{
  "title": "Accuracy dispute",
  "url": "https://wiki.archlinux.org/title/Accuracy_dispute",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: Please do not experiment with this template; you could ruin all pages using this template. If you want to edit this template, copy the text to Template:Sandbox, edit and test it there, and copy it back when it works.\n\nPlease do not experiment with this template; you could ruin all pages using this template. If you want to edit this template, copy the text to Template:Sandbox, edit and test it there, and copy it back when it works.\n\nFeel free to voice your opinion regarding this template.\n\nAn \"accuracy dispute\" flag used to indicate inaccurate content.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "This template should be added at the beginning of articles or sections suspected of incorrect, misleading, or confusing content. Ensure to cite specific concerns with the first argument and possibly also on the flagged article's discussion page.\n\n```\n{{Accuracy|reason}}\n```\n\nYou can override the default discussion page with a second optional argument:\n\n```\n{{Accuracy|reason|Talk:Alternative Page}}\n```\n\nAlternatively you can point to a specific section in the default talk page with the named section parameter:\n\n```\n{{Accuracy|reason|section=Section name}}\n```\n\nFlagged pages can be found in Special:WhatLinksHere/Template:Accuracy or in Category:Pages or sections flagged with Template:Accuracy. If knowledgeable in a subject, users are encouraged to participate to resolve the issue. The {{Accuracy}} flag should be removed after verification/correction/removal of disputed facts.\n\n"
    },
    {
      "title": "Example",
      "level": 2,
      "content": "```\n{{Accuracy|This is just a demonstration template.}}\n```\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n"
    }
  ]
}