{
  "title": "Acer Aspire S7-392",
  "url": "https://wiki.archlinux.org/title/Acer_Aspire_S7-392",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThis page contains instructions, tips, pointers, and links for installing and configuring Arch Linux on the Acer Aspire S7-392 Laptop.\n\nThis page only applies to the 392 model (4th Gen Intel CPU), and may not be entirely correct for the 391 or 191 models (3rd Gen Intel CPU).\n\n"
    },
    {
      "title": "Compatibility",
      "level": 2,
      "content": "The laptop works surprisingly well with Arch Linux, requiring minimal or no configuration hacking, depending on your desired setup.\n\n"
    },
    {
      "title": "What works?",
      "level": 3,
      "content": "- Touchscreen\n- Screen Brightness Adjustment Requres a window manager or desktop environment with the functionality, such as Xfce, GNOME, or MATE. Alternatively, a hotkey daemon such as acpid may provide hotkey functionality (Not tested).\n- Keyboard Backlight (And adjustment)\n- Most Keyboard Hotkeys Wireless Toggle may not work. acpid may work with it (Not tested)\n- Wireless Networking\n\n- Requres a window manager or desktop environment with the functionality, such as Xfce, GNOME, or MATE.\n- Alternatively, a hotkey daemon such as acpid may provide hotkey functionality (Not tested).\n\n- Wireless Toggle may not work. acpid may work with it (Not tested)\n\n"
    },
    {
      "title": "What does not work, or is weird?",
      "level": 3,
      "content": "- Touchpad Multitouch Gestures\n- Touchscreen stops working after waking up from suspend\n\n"
    },
    {
      "title": "BIOS Setup",
      "level": 2,
      "content": "The BIOS Setup utility is accessed by pressing Fn+2 at the Acer Logo screen during startup.\n\n"
    },
    {
      "title": "Disable Secure Boot",
      "level": 3,
      "content": "In order to install Arch on the S7 you need to disable Secure Boot from the BIOS Setup. You need to do Security > Set Supervisor Password to set a supervisor password. Without it the option to disable Secure boot will be grayed out. Then go to Boot > Secure Boot and set it to Disabled and remove the supervisor password (by setting an empty one).\n\n"
    },
    {
      "title": "Booting",
      "level": 2,
      "content": "The information in Boot loaders applies here. GRUB is confirmed to work.\n\n"
    },
    {
      "title": "Change Boot from UEFI to BIOS",
      "level": 3,
      "content": "If desired, you can optionally select whether to use BIOS or UEFI when booting. This is an option in the BIOS Setup utility.\n\n"
    },
    {
      "title": "Boot from USB",
      "level": 3,
      "content": "Booting from USB is possible by reordering boot devices in the BIOS setup, or by accessing the Boot Menu by pressing the \"Fn\" key and \"=\" key simultaneously (Translates to F12).\n\n"
    },
    {
      "title": "UEFI Boot Arch",
      "level": 3,
      "content": "One some dual-SSD machines the disk that BIOS boots from by default is identified as /dev/sdb rather than /dev/sda. If you are running a RAID it is recommended to leave a GPT partition on both disks. If you get an error after booting that BIOS cannot find a bootable media, but drops you in the boot menu where you can select HDD and it boots from there - you have installed grub on the wrong disk.\n\n"
    },
    {
      "title": "Graphics Drivers",
      "level": 2,
      "content": "With the default setup, there will be graphics tearing on the S7-392. You can check the \"Tear-free video\" section of the Intel graphics page for information on fixing tearing.\n\n"
    },
    {
      "title": "Multitouch Gestures",
      "level": 2,
      "content": "The touchpad works well with xf86-input-synaptics, and with touchegg for advanced multitouch gestures.\n\n"
    },
    {
      "title": "Console fonts",
      "level": 2,
      "content": "Since some of these come with HiDPI displays the default console font is barely readable - refer to Linux console#Fonts on how to change them.\n\n"
    },
    {
      "title": "Wi-Fi instability",
      "level": 2,
      "content": "This laptop uses Intel Corporation Wireless 7260 Wi-Fi chipset. With the current firmware it might have issues connecting when signal is suboptimal. Disabling power save mode on the chip improves the connection times and connection speed. See Wireless network configuration#Power saving on how to disable it and make it permanent.\n\n"
    }
  ]
}