{
  "title": "Acer Spin 5",
  "url": "https://wiki.archlinux.org/title/Acer_Spin_5",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU | 8086:5917 | Yes\nWi-Fi | 168c:003e | Yes\nBluetooth | 04ca:3016 | Yes\nAudio | 8086:9d71 | Yes\nTouchpad | PS/2 | Yes\nTouchScreen | 04f3:2560 | Yes\nCamera | 04f2:b5f7 | Yes\nFingerprint scanner | 04f3:0c03 | Yes\n\nGeneral info about the Acer Spin 5 SP513-52N laptop.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "To disable Secure Boot, set the supervisor password in the UEFI settings. Then you should be able to disable Secure Boot and boot Arch.\n\nEven with Secure Boot disabled, if the Windows Boot Manager is not the *first* EFI entry, it then becomes impossible to access the UEFI settings and the only known method that works for regaining such access is temporarily placing the Windows Boot Manager as the first option again. The cause for this behavior is unknown and it is therefore strongly recommended that you select your preferred settings prior to installing Arch, especially enabling the F12 Boot Menu in order to allow booting from external devices.\n\nIf the F12 Boot Menu is not enabled and you need to boot from an external device, your only option will be opening the chassis and temporarily removing the SSD to prevent it from being used as the boot device. Also note that the Spin 5 comes with a battery protection measure which causes battery power to be supplied only when the case is completely closed with all screws, as explained in an Acer community answer. Any loose screw may prevent the computer from turning on except when the power chord is plugged in, or else cause unexpected shutdowns while on battery power, as reported in Acer forums.\n\nAnother quirk is that apparently the UEFI \"function keys\" setting will either enable special keys such as sleep and Wi-Fi as default (thus making the Fn prefix necessary for using F1 through F12), OR it will enable the opposite behavior but completely disabling the AltGr key as a side effect. This is not specific to Linux and there is no known solution to this problem.\n\n"
    },
    {
      "title": "Touchscreen and active stylus",
      "level": 2,
      "content": "The touchscreen should work perfectly out of the box, including pinching gestures - except for applications which do not implement such support (for example, viewnior).\n\nWhen in tablet mode, the keyboard and touchpad are disabled, but the screen does not rotate automatically. For manual or automatic screen rotation, see Tablet PC#Rotation and Tablet PC#Automatic rotation.\n\nThe Acer Spin 5 has MPP (Microsoft Pen Protocol) support. To improve the functionality of an active stylus in Arch Linux, follow the instructions on Microsoft Surface Pro 3#Tuning the Pen. This post might also have useful information on the subject.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "The touchpad works perfectly with libinput. Some commonly reviewed settings are Tapping (tap-to-click) and Natural Scrolling. The default middle button emulation may also present undesired behavior due to the fact that the button pressing area is divided in three equal parts, which causes frequent accidental middle clicks: for example, when trying to select a web browser tab, if the default region for the middle button is pressed down, the tab will be closed instead of selected.\n\nTo disable middle button emulation and enable Tapping and Natural Scrolling, create/edit the following configuration file:\n\n```\n/etc/X11/xorg.conf.d/40-libinput.conf\n```\n\n```\nSection \"InputClass\"\n        Identifier \"touchpad\"\n        Driver \"libinput\"\n        MatchIsTouchpad \"on\"\n        Option \"Tapping\" \"on\"\n        Option \"NaturalScrolling\" \"on\"\n        Option \"ButtonMapping\" \"1 1 3 4 5 6 7\"\nEndSection\n```\n\nFor more details refer to libinput#Tapping button re-mapping.\n\nTo use touch gestures such as pinching in a window manager or desktop environment that does not implement it, fusuma is recommended.\n\n"
    },
    {
      "title": "Temperature management",
      "level": 2,
      "content": "The laptop has been observed to overheat while the power chord is connected. This can be fixed by simply installing thermald and starting/enabling the respective service. For more information, see CPU frequency scaling.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- SP513-52N\n\n"
    }
  ]
}