{
  "title": "Ada",
  "url": "https://wiki.archlinux.org/title/Ada",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ada is a general purpose, compiled programming language. It features strong static typing, packages, exceptions, generics, tasking, object-orientation and contracts.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the gcc-ada package. This will install the GNAT compiler, which is an Ada front-end for the GNU Compiler Collection (GCC).\n\nAdditional packages:\n\n- all-adaAUR - A meta package which installs all Ada tools and components.\n- adacursesAUR - An Ada binding to the 'ncurses' C library.\n- adaoggAUR - A complete interface layer that brings the Ogg, Vorbis, and Theora libraries to the Ada 2012 programming language.\n- ada_language_serverAUR - High performance syntactic and semantic engine for the Ada programming language.\n- ada-libfswatchAUR - An Ada binding to the libfswatch library in the fswatch project.\n- adasatAUR - Implementation of a DPLL-based SAT solver in Ada.\n- adasocketsAUR - BSD sockets in Ada.\n- ada_spawnAUR - A simple Ada API to start processes and communicate with them.\n- ada-web-serverAUR - Ada Web Server\n- ahvenAUR - A simple unit test framework for the Ada programming language.\n- alireAUR - A catalog of ready-to-use Ada libraries plus a command-line package manager tool (alr) to use them.\n- aunitAUR - Ada Unit Testing Framework\n- floristAUR - An open-source implementation of IEEE Standard 1003.5b-1996, the POSIX Ada binding.\n- gcc-ada-debugAUR - Ada front-end for GCC (GNAT) with an unstripped runtime for effective debugging in gdb.\n- GNATColl - GNAT Components Collection gnatcoll-coreAUR or gnatcoll-core-gitAUR gnatcoll-db2adaAUR gnatcoll-gmpAUR or gnatcoll-gmp-gitAUR gnatcoll-iconvAUR or gnatcoll-iconv-gitAUR gnatcoll-gnatinspectAUR gnatcoll-lzmaAUR gnatcoll-ompAUR gnatcoll-postgresAUR gnatcoll-pythonAUR gnatcoll-readlineAUR gnatcoll-sqlAUR gnatcoll-sqliteAUR gnatcoll-syslogAUR gnatcoll-xrefAUR gnatcoll-zlibAUR\n- gnatcoverage-binAUR - A tool to analyze and report program coverage of Ada and C programs.\n- gnatdocAUR - GNAT documentation generation tool.\n- gnatstudioAUR - GnatStudio for Ada.\n- gnatstudio-binAUR - GnatStudio binary for Ada.\n- gnatsymbolizeAUR - Translates addresses into their corresponding filename, line number, and function names for Ada programs.\n- gprbuildAUR or gprbuild-gitAUR - GPRbuild build system.\n- gprbuild-toolboxAUR - Meta builder toolbox for multi-language systems.\n- gprAUR - Parser for Ada GPR project files.\n- gpr-unit-providerAUR - A unit provider for Libadalang based on GPR project analysis library.\n- gtkadaAUR - Ada bindings for the Gtk+ library.\n- ini_file_managerAUR - Ini configuration file reader and manipulator package for Ada.\n- inotify-adaAUR - An Ada 2012 library to monitor filesystem events using the Linux inotify API.\n- kazakov_simple_componentsAUR - A set of low-level Ada components by Dmitri Kazakov.\n- langkitAUR - Compiler for syntactic and semantic language analysis libraries.\n- libadalangAUR - A high performance semantic engine for the Ada programming language.\n- libadalang-toolsAUR - Libadalang-based tools for Ada: gnatpp, gnatmetric and gnatstub.\n- libgprAUR - Ada library to handle Gnat project files.\n- libvssAUR - A high level string and text processing library for Ada.\n- markdownAUR - A markdown parser for Ada.\n- polyorbAUR - Provides the Distributed Systems Annex (DSA) to build distributed applications with Ada.\n- sdladaAUR - An Ada binding to the Simple DirectMedia Layer (SDL) library.\n- spark2014AUR - Formally defined programming language based on Ada (GNAT FSF version).\n- templates_parserAUR - Ada tools to create templated text streams, such as dynamic HTML documents.\n- vulkadaAUR - A complete Vulkan 1.3 binding for the Ada 2012 programming language.\n- xmladaAUR or xmlada-gitAUR - XML/Ada\n\n- gnatcoll-coreAUR or gnatcoll-core-gitAUR\n- gnatcoll-db2adaAUR\n- gnatcoll-gmpAUR or gnatcoll-gmp-gitAUR\n- gnatcoll-iconvAUR or gnatcoll-iconv-gitAUR\n- gnatcoll-gnatinspectAUR\n- gnatcoll-lzmaAUR\n- gnatcoll-ompAUR\n- gnatcoll-postgresAUR\n- gnatcoll-pythonAUR\n- gnatcoll-readlineAUR\n- gnatcoll-sqlAUR\n- gnatcoll-sqliteAUR\n- gnatcoll-syslogAUR\n- gnatcoll-xrefAUR\n- gnatcoll-zlibAUR\n\nSigned, pre-built packages are available from the unofficial Ada repository.\n\n"
    },
    {
      "title": "Test your installation",
      "level": 3,
      "content": "Check that GNAT is installed correctly by building a simple program, as follows:\n\n```\nhello.adb\n```\n\n```\nwith Ada.Text_IO;\n\nprocedure Hello is\nbegin\n   Ada.Text_IO.Put_Line (\"Hello, Arch!\");\nend Hello;\n```\n\nYou can compile it with gnatmake:\n\n```\n$ gnatmake hello\n```\n\n```\ngcc -c hello.adb\ngnatbind -x hello.ali\ngnatlink hello.ali\n```\n\nThen run it:\n\n```\n$ ./hello\n```\n\n```\nHello, Arch!\n```\n\n"
    },
    {
      "title": "Language",
      "level": 3,
      "content": "- Rationale for Ada 2012\n- Ada 2012 Language Reference Manual\n- Wikibooks:Ada Programming\n- Interactive learning platform Learn.adacore.com\n- Wikipedia:SPARK (programming language)\n\n"
    },
    {
      "title": "Tools",
      "level": 3,
      "content": "- GNAT User’s Guide for Native Platforms\n- GNAT Reference Manual\n- GPRbuild and GPR Companion Tools User’s Guide\n\n"
    },
    {
      "title": "Library Docs",
      "level": 3,
      "content": "- XML/Ada: The Unicode and XML Library for Ada\n- AWS: The Ada Web Server\n- AUnit Cookbook\n- GNAT Reusable Components\n- GtkAda User’s Guide\n\n"
    }
  ]
}