{
  "title": "AMDGPU PRO",
  "url": "https://wiki.archlinux.org/title/AMDGPU_PRO",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- AMDGPU\n- Vulkan\n- GPGPU\n- DaVinci Resolve\n\nThis page describes close source drivers for AMD GPUs.\n\n"
    },
    {
      "title": "Purpose of proprietary components",
      "level": 2,
      "content": "AMD releases their open source drivers via standard distribution channels. And they also periodically do releases of their Radeon Software for Linux suite, which includes both open and proprietary components. Open source components are not needed from there, and proprietary components are repacked from the latest ubuntu lts version. They are published in AUR in the amdgpu-pro-installer package base.\n\nComment by John Bridgman from AMD explaining why they still package close source drivers:\n\n- customers using slower moving enterprise/LTS distros which do not automatically pick up the latest graphics drivers - we offer them both open source and proprietary/workstation options\n- customers using workstation apps who need the extra performance/certification from a workstation-oriented driver (although Marek has done a lot of great work over the last year to improve Mesa performance on workstation apps)\n- The third target audience is customers looking for ready-to-go OpenCL, either for use with the packaged open/closed drivers or with the upstream-based stack in a recent distro.\n\nThere are several proprietary components: OpenGL, OpenCL, Vulkan and AMF. Sometimes you may want to use these components due to specific features that open source components may lack.\n\nAMDGPU PRO OpenGL is a proprietary, binary userland driver, which works on top of the open-source amdgpu kernel driver. From Radeon Software 18.50 vs Mesa 19 benchmarks article: When it comes to OpenGL games, the RadeonSI Gallium3D driver simply dominates the proprietary AMD OpenGL driver. Users of graphic cards other than Radeon Pro are advised to use the amdgpu graphics stack. Mostly used because of lacking compatibility layers that some software relies on. See gentoo wiki linked below.\n\nAMDGPU PRO Vulkan - required dependency for AMF.\n\nAMDGPU PRO OpenCL - used because Mesa OpenCL is not fully complete. Proprietary component only for Polaris GPUs. The onward GPUs use the open ROCm OpenCL.\n\nAMDGPU AMF - used for gpu encoding/decoding.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "For proprietary OpenGL implementation, use the amdgpu-pro-installer package base. It contains all the following packages:\n\n- amdgpu-pro-oglpAUR: For proprietary OpenGL implementation\n- lib32-amdgpu-pro-oglpAUR: For proprietary OpenGL implementation 32 bit applications support\n- vulkan-amdgpu-proAUR: For proprietary Vulkan implementation\n- lib32-vulkan-amdgpu-proAUR: For proprietary Vulkan implementation 32 bit applications support\n- amf-amdgpu-proAUR : For Advanced Media Framework implementation\n\nFor available OpenCL implementations see GPGPU#AMD/ATI.\n\n"
    },
    {
      "title": "Using proprietary OpenGL",
      "level": 3,
      "content": "Launch your application with progl prefix, for example:\n\n```\n$ progl glmark2\n```\n\n"
    },
    {
      "title": "How to ensure you are using AMDGPU-PRO driver",
      "level": 4,
      "content": "Run the following command:\n\n```\n$ glxinfo | grep \"OpenGL vendor string\" | cut -f2 -d\":\" | xargs\n```\n\nIf it returns AMD, then you are running open source driver. If it returns Advanced Micro Devices, Inc. or ATI Technologies Inc., then you are running proprietary driver.\n\nAlternatively, run glmark2. When using open driver, in OpenGL Information you will see:\n\n```\nGL_VENDOR:     AMD\n   GL_RENDERER:   Radeon RX 580 Series (POLARIS10, DRM 3.40.0, 5.10.7-arch1-1, LLVM 11.0.1)\n   GL_VERSION:    4.6 (Compatibility Profile) Mesa 20.3.3\n```\n\nBut when using closed driver, you will see:\n\n```\nGL_VENDOR:     ATI Technologies Inc.\n   GL_RENDERER:   Radeon RX 580 Series\n   GL_VERSION:    4.6.14756 Compatibility Profile Context\n```\n\n"
    },
    {
      "title": "Using proprietary Vulkan",
      "level": 3,
      "content": "Launch your application with vk_pro, for example:\n\n```\n$ vk_pro vkmark\n```\n\nSee Vulkan#Selecting via AMD Vulkan Prefixes for more information.\n\n"
    },
    {
      "title": "Using Advanced Multimedia Framework",
      "level": 3,
      "content": "See FFmpeg#AMD AMF\n\n"
    },
    {
      "title": "Intel + AMD hybrid graphics",
      "level": 3,
      "content": "For users of a hybrid setup with both an Intel GPU and an AMD GPU, usage of the proprietary AMDGPU Pro Workstation Driver might not work as expected due to different MESA implementations.\n\nThe symptom is the following: when you boot your machine, you get a black screen, but with your mouse cursor is moving normally.\n\nUnfortunately, Reverse PRIME is not a solution. See the developer response.\n\n"
    },
    {
      "title": "Uninstalling packages",
      "level": 3,
      "content": "If you are in trouble, for example, you cannot login to your system due to black screen, you can revert all back by uninstalling all packages related to AMDGPU PRO.\n\nSwitch a virtual console (with e.g. Ctrl+Alt+F2), login and run:\n\n```\n# pacman -R $(pacman -Qg Radeon_Software_for_Linux | cut -f2 -d\" \")\n```\n\nthen reboot.\n\n"
    },
    {
      "title": "Southern Islands (SI) or Sea Islands (CIK) GPUs",
      "level": 3,
      "content": "If using Southern Islands (SI) or Sea Islands (CIK) GPU, when running clinfo, you get:\n\n```\namdgpu_device_initialize: DRM version is 2.50.0 but this driver is only compatible with 3.x.x.\n```\n\nthen ensure you are using amdgpu driver, but not radeon.\n\nCheck which driver is currently in use:\n\n```\n$ lspci -k\n```\n\n```\n03:00.0 Display controller: Advanced Micro Devices, Inc. [AMD/ATI] Opal XT [Radeon R7 M265/M365X/M465]\n        Subsystem: Acer Incorporated [ALI] Aspire V5 Radeon R7 M265\n        Kernel driver in use: radeon\n        Kernel modules: radeon, amdgpu\n```\n\nSee AMDGPU#Enable Southern Islands (SI) and Sea Islands (CIK) support for more information.\n\n"
    },
    {
      "title": "Firmware and AMD drivers",
      "level": 3,
      "content": "AMD drivers and firmware (especially recent firmware) can get out of sync and create issues or not work at all. You can search in the journal for VCN:\n\n```\nsystem VCN FW Encode interface version=1.9, expected version=1.8\n```\n\nDowngrading the firmware seems to fix the problem.\n\n- As of 2024-01-29 linux-firmware-gitAUR version 20240126.8fa621d2-1 works with 23.40 (6.0.1) driver.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Gentoo:AMDGPU-PRO\n\n"
    }
  ]
}