{
  "title": "Arch Comparada con Otras Distribuciones",
  "url": "https://wiki.archlinux.org/title/Arch_Comparada_con_Otras_Distribuciones",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-07** \n\nArtículos relacionados\n\n- Arch Linux\n- Distribuciones basadas en Arch\n- Pacman/Rosetta\n- Arch is the best\n\nEsta página pretende mostrar una comparación entre Arch Linux y otras distribuciones de GNU/Linux y sistemas operativos basados en UNIX. Los resúmenes que siguen son breves descripciones que pueden ayudar a un usario a decidir si Arch Linux se adapta a sus necesidades. Aunque las revisiones y descripciones pueden ser útiles, la propia experiencia es siempre la mejor manera de comparar las distribuciones.\n\nPara una comparación más completa, véase esta comparación de sistemas operativos y esta comparación de distribuciones Linux.\n\nEn adelante, solo se compara Arch Linux con otras distribuciones. Las adaptaciones de la comunidad que admiten arquitecturas que no sean x86_64 se pueden encontrar listados entre las distribuciones basadas en Arch.\n\n"
    },
    {
      "title": "Basadas en las fuentes",
      "level": 2,
      "content": "Las distribuciones basadas en las fuentes son altamente portables, proporcionando la ventaja de controlar y compilar todo el sistema operativo y las aplicaciones para una arquitectura de máquina y un esquema de uso particulares, con la desventaja de la lentitud en la compilación de fuentes. La base de Arch y todos los paquetes solo se compilan para la arquitectura x86_64.\n\n"
    },
    {
      "title": "CRUX",
      "level": 3,
      "content": "- CRUX es una distribución liviana que se enfoca en el principio KISS. CRUX inspiró a Judd Vinet para crear Arch.\n- CRUX utiliza scripts de inicio de estilo BSD, mientras que Arch usa systemd.\n- Mientras Arch usa un sistema de lanzamiento continuo, CRUX tiene lanzamientos más o menos anuales.\n- Ambos vienen con sistemas porst-like y, como *BSD, proporcionan un entorno base sobre el que construir.\n- Arch presenta a pacman, que maneja la administración de paquetes binarios del sistema y funciona a la perfección con el sistema Arch Build System. CRUX usa un sistema de contribución comunitario llamado prt-get, que, en combinación con su propio sistema de ports, se ocupa de la resolución de dependencias, pero construye todos los paquetes desde la fuente (aunque la instalación base de CRUX es binaria).\n- Tanto Arch como CRUX solo admiten oficialmente la arquitectura x86_64.\n- Arch presenta una gran variedad de repositorios de paquetes binarios, así como el Arch User Repository. CRUX proporciona un sistema oficialmente respaldado de ports más reducido, además de un repositorio comunitario más modesto comparativamente.\n\n"
    },
    {
      "title": "LFS",
      "level": 3,
      "content": "- LFS, (o Linux From Scratch) existe simplemente como documentación. El libro instruye al usuario sobre la obtención del código fuente para un paquete base mínimo establecido para un sistema funcional GNU/Linux, y cómo compilarlo, parchearlo y configurarlo desde cero. LFS es tan mínimo como sea posible y ofrece un excelente y educativo proceso de construcción y personalización de un sistema base.\n- LFS no ofrece repositorios en línea, las fuentes se obtienen manualmente, compilando e instalándolas con make. (Existen varios métodos manuales de gestión de paquetes y son mencionados en LFS Hints).\n- Arch ofrece estos mismos paquetes, además de systemd, algunas herramientas adicionales y el potente administrador de paquetes pacman como su sistema base, ya compilado para x86_64. Junto con el sistema base mínimo de Arch, la comunidad y los desarrolladores de Arch proporcionan y mantienen miles de paquetes binarios instalables a través de pacman, así como los scripts de compilación PKGBUILD para usar con Arch Build System. Arch también incluye la herramienta makepkg para construir o personalizar convenientemente paquetes, instalados fácilmente por pacman.\n- Judd Vinet creó Arch desde cero, y luego escribió pacman en C. Históricamente, Arch a veces se describía con humor simplemente como «Linux, con un buen administrador de paquetes».\n\n"
    },
    {
      "title": "Gentoo Linux",
      "level": 3,
      "content": "- Tanto Arch Linux como Gentoo Linux son sistemas de lanzamiento continuo, lo que hace que los paquetes estén disponibles para la distribución poco después de que se liberen.\n- Los paquetes y el sistema base de Gentoo se construyen directamente desde el código fuente de acuerdo con los ajustes USE especificados por el usuario. Arch proporciona una especie de sistema de ports para construir paquetes desde la fuente, aunque el sistema base Arch está diseñado para instalarse como binarios x86_64 pre-construidos. Esto generalmente hace que Arch sea más rápido de construir y actualizar, y permite a Gentoo ser sistemáticamente más personalizable.\n- Arch solo soporta x86_64, mientras que Gentoo admite oficialmente arquitecturas x86 (i486/i686), x86_64, PPC/PPC64, SPARC, Alpha, ARM, MIPS, HPPA, S/390 e Itanium.\n- Los paquetes oficiales de Gentoo y las herramientas de administración del sistema tienden a ser bastante más complejos y «potentes» que los provistos por Arch, y ciertas características que están en el corazón de Gentoo (ajustes USE, Gentoo:Handbook:X86/Working/Portage/es#Terminolog.C3.ADa SLOTs, etc.) no tienen ningún equivalente directo en Arch Linux. Parte de esto se debe al hecho de que Arch es principalmente una distribución binaria, pero las diferencias en la filosofía de diseño también juegan un papel importante, ya que Arch adopta una postura más en favor de la simplicidad arquitectónica, evitando el exceso de ingeniería.\n- Debido a que tanto las instalaciones de Gentoo como las de Arch solo incluyen un sistema base, ambas se consideran altamente personalizables. Si como usuario de Gentoo se siente cómodo con systemd, también se sentirá cómodo con la mayoría de los aspectos de Arch.\n\n"
    },
    {
      "title": "Sistema GNU Guix",
      "level": 3,
      "content": "- El sistema GNU Guix se inspiró en NixOS de manera similar a como Arch se inspiró en CRUX.\n- Tanto Arch Linux como el sistema Guix son distribuciones de lanzamiento continuo, lo que hace que los paquetes estén disponibles para la distribución poco tiempo después de su lanzamiento. Sin embargo, el sistema Guix es principalmente una distribución basada en fuentes (aunque existen binarios preconstruidos y se denominan \"substitutos\"), mientras que Arch es principalmente una distribución binaria.\n- Arch utiliza pacman como gestor de paquetes, mientras que el sistema Guix utiliza guix, que soporta características de empaquetado experimental no presente en otras distribuciones.\n- Arch solo soporta x86_64, mientras que el sistema Guix soporta oficialmente varias arquitecturas.\n- Arch utiliza systemd como sistema init, mientras que el sistema Guix utiliza GNU Shepherd.\n- El sistema Guix rompe con muchos conceptos tradicionales de Unix, incluyendo la jerarquía del sistema de archivos de Arch. Por ejemplo, muchos archivos que en las distribuciones tradicionales se distribuyen en diferentes directorios, en el sistema Guix se ubicarán en algún lugar bajo /gnu/store/.\n- Arch puede enviar ocasionalmente software que no es libre (a menudo controladores), mientras que el sistema Guix solo envía software libre y está respaldado por la Free Software Foundation, aunque los repositorios alternativos que envían software que no es libre para Guix existen.\n- Arch espera que el usuario configure directamente los paquetes de software instalados, mientras que el sistema Guix fomenta una configuración de sistema global en Scheme, que a su vez instancia archivos de configuración.\n\n"
    },
    {
      "title": "Generalistas",
      "level": 2,
      "content": "Estas distribuciones ofrecen una amplia gama de ventajas y fortalezas y pueden satisfacer la mayoría de usos de un sistema operativo.\n\n"
    },
    {
      "title": "Debian",
      "level": 3,
      "content": "- Debian es la distribución de Linux más amplia con una comunidad más grande y cuenta con ramas estables, de prueba e inestables, ofreciendo más de 148 000 paquetes. El número disponible de paquetes binarios en Arch es más modesto. Sin embargo, al incluir los de AUR, las cantidades son comparables.\n\n- Debian tiene una postura más vehemente en el software libre, pero aún incluye software no libre en sus repositorios no libres. Arch es más indulgente, y por lo tanto incluyente, con respecto a los paquetes no libres según lo define GNU.\n\n- Debian se centra en las pruebas rigurosas de la rama estable, que está «congelada» y da soporte hasta cinco años. Los paquetes de Arch son más actuales que los de la rama estable de Debian, siendo más comparables con las ramas de prueba e inestables de Debian, y no tienen un calendario de lanzamiento fijo.\n\n- Debian está disponible para muchas arquitecturas, incluidas alpha, arm, hppa, i386, x86_64, ia64, m68k, mips, mipsel, powerpc, s390, y sparc, mientras que Arch está solo para x86_64.\n\n- Arch ofrece un soporte más conveniente para crear e instalar paquetes personalizables desde fuentes externas, con una especie de sistema de compilación de ports. Debian no ofrece un sistema de ports, confiando en cambio en sus grandes repositorios binarios.\n\n- El sistema de instalación de Arch solo ofrece una base mínima, expuesta de forma transparente durante la configuración del sistema, mientras que los métodos de Debian, como el uso de tareas apt para instalar grupos de paquetes preseleccionados, ofrecen un enfoque de configuración más automático así como varios métodos alternativos de instalación.\n\n- Arch generalmente empaqueta las bibliotecas de software junto con sus archivos de cabecera, mientras que en Debian los archivos de cabecera deben descargarse por separado.\n\n- Arch mantiene los parches al mínimo, evitando así los problemas que los desarrolladores no pueden revisar, mientras que Debian parchea sus paquetes de forma más liberal para un público más amplio.\n\n"
    },
    {
      "title": "Fedora",
      "level": 3,
      "content": "- Fedora está desarrollado por la comunidad, pero respaldada corporativamente por Red Hat; a menudo se presenta como un sistema de lanzamiento de prueba (o testbed release system). Los paquetes y proyectos de Fedora migran a RHEL y algunos finalmente son adoptados por otras distribuciones. Arch no tiene lanzamientos fijos, y no sirve como una rama de prueba para otra distribución.\n\n- Los paquetes de Fedora usan el formato RPM con el administrador de paquetes DNF. Arch usa pacman para administrar paquetes.\n\n- Fedora rehúsa a incluir software no libre en repositorios oficiales debido a su dedicación al software libre, aunque existen repositorios de terceros disponibles para dichos paquetes. Arch es más indulgente en su disposición hacia el software no libre, dejando la decisión al usuario.\n\n- Fedora ofrece muchas opciones de instalación que incluyen un instalador gráfico y una opción mínima. Los «spins» de Fedora también ofrecen un surtido de entornos de escritorio alternativos donde elegir, cada uno con una variedad modesta de paquetes predeterminados. Arch, por otro lado, solo proporciona algunos scripts para facilitar el proceso de instalación de un sistema base mínimo.\n\n- Fedora tiene un ciclo de lanzamiento programado, pero oficialmente admite actualizaciones discretas de versiones con la herramienta FedUp. Arch es un sistema de lanzamiento continuo.\n\n- Arch presenta un sistema de ports, mientras que Fedora no.\n\n- Tanto Arch como Fedora están dirigidos a usuarios y desarrolladores experimentados. Ambos alientan fuertemente a sus usuarios a contribuir al desarrollo del proyecto.\n\n- Fedora ha ganado mucho reconocimiento de la comunidad por la integración de SELinux, los paquetes compilados de GCJ (para eliminar la necesidad de JRE de Oracle) y la contribución prolífica de los desarrolladores; de Red Hat y, por extensión, los de Fedora, contribuyen con el porcentaje más alto de código del kernel de Linux en comparación con cualquier otro proyecto.\n\n- Arch Linux proporciona lo que ampliamente se considera como la wiki de una distribución más exhaustiva e integral. La wiki de Fedora se usa en el sentido original de la palabra «wiki», o una forma rápida de intercambiar información entre desarrolladores, probadores y usuarios. No pretende ser una base de conocimiento para el usuario final como en Arch. El wiki de Fedora se asemeja a un rastreador de incidencias o una wiki corporativa.\n\n"
    },
    {
      "title": "Slackware",
      "level": 3,
      "content": "- Slackware utiliza scripts de inicio estilo BSD, mientras que Arch usa systemd.\n\n- Arch suministra un sistema de gestión de paquetes mediante pacman que, a diferencia de las herramientas estándar de Slackware, ofrece una resolución de dependencia automática y permite actualizaciones del sistema más automatizadas. Los usuarios de Slackware generalmente prefieren su método manual de resolución de dependencias, citando el nivel de control del sistema que les concede, aprovechando el excelente suministro de bibliotecas y dependencias pre-instaladas de Slackware.\n\n- Arch es un sistema de lanzamiento continuo. Slackware es visto como más conservador en su ciclo de lanzamiento, prefiriendo paquetes de probada estabilidad. Arch es más innovadora en este sentido.\n\n- Arch Linux proporciona miles de paquetes binarios en sus repositorios oficiales, mientras que los repositorios oficiales de Slackware son más modestos.\n\n- Arch ofrece el Arch Build System, similar a un sistema de ports y también el AUR, una gran colección de PKGBUILD aportados por los usuarios. Slackware ofrece un sistema similar aunque más limitado en slackbuilds.org que es un repositorio semi-oficial de Slackbuilds, análogos a los PKGBUILDs de Arch. Los usuarios de Slackware estarán generalmente bastante cómodos con la mayoría de los aspectos de Arch.\n\n"
    },
    {
      "title": "Adecuadas para principiantes",
      "level": 2,
      "content": "A veces llamadas «distribuciones para novatos», las distribuciones adecuadas para principiantes comparten muchas similitudes, aunque Arch es bastante diferente de ellas. Arch puede ser una mejor opción si desea aprender sobre GNU/Linux construyendo desde una base pequeña, ya que una instalación de Arch instala pocos paquetes en comparación. Las diferencias específicas entre las distribuciones se describen a continuación.\n\n"
    },
    {
      "title": "Ubuntu",
      "level": 3,
      "content": "- Ubuntu es una distribución popular basada en Debian patrocinada comercialmente por Canonical Ltd., mientras que Arch es un sistema desarrollado de forma independiente desde cero.\n\n- Ambos proyectos tienen objetivos muy diferentes y están dirigidos a una base de usuarios diferente. Arch está diseñado para usuarios que desean un enfoque de «hazlo tú mismo», mientras que Ubuntu proporciona un sistema pre-configurado. Arch presenta un diseño más simple desde la instalación base en adelante, confiando en que el usuario lo personalice según sus necesidades específicas. Muchos usuarios de Arch han comenzado en Ubuntu y finalmente migraron a Arch.\n\n- El desarrollo de Arch no está enfocado hacia una interfaz de usuario en particular más allá de la que su comunidad proporciona soporte. Además, la naturaleza comercial de Canonical les ha llevado a tomar decisiones controvertidas, como la inclusión de anuncios en el menú Dash de Unity y la recopilación de datos de los usuarios. Arch es un proyecto independiente, impulsado por la comunidad sin agenda comercial.\n\n- Ubuntu se mueve entre lanzamientos discretos cada 6 meses, mientras que Arch es un sistema de lanzamiento continuo.\n\n- Arch ofrece un sistema de compilación de paquetes similar a ports y el AUR, donde los usuarios pueden compartir paquetes fuente para el administrador de paquetes pacman. Ubuntu usa la más compleja apt, y permite la redistribución de paquetes binarios a través de Personal Package Archives.\n\n- Las dos comunidades también difieren en algunos aspectos. La comunidad de Arch es mucho más pequeña y está fuertemente alentada a contribuir con la distribución. Por el contrario, la comunidad de Ubuntu es relativamente grande y, por lo tanto, puede tolerar un porcentaje mucho mayor de usuarios que no contribuyen activamente al desarrollo, el empaquetado o el mantenimiento de repositorios.\n\n"
    },
    {
      "title": "Linux Mint",
      "level": 3,
      "content": "- Linux Mint nació como un derivado Ubuntu, y más tarde añadió LMDE (Linux Mint Debian Edition) que está basado en Debian. Por otro lado, Arch es una distribución independiente que se basa en su propio sistema de compilación y repositorios.\n- Mint incluye varias herramientas gráficas para un mantenimiento más sencillo, llamadas MintTools. Arch solo proporciona herramientas simples de línea de órdenes como pacman y deja la administración del sistema en manos del usuario.\n- Las nuevas versiones de Mint se liberan cada seis meses, aproximadamente un mes después de Ubuntu. Cada versión se basa en el Ubuntu LTS más reciente y recibe soporte durante cinco años. Linux Mint Debian Edition (LMDE) se basa en Debian estable y solo recibe actualizaciones en los paquetes Mint y las actualizaciones de seguridad. Arch en cambio, es una distribución de lanzamiento continuo.\n\n"
    },
    {
      "title": "openSUSE",
      "level": 3,
      "content": "openSUSE se centra en el formato de paquetes RPM y su reconocida herramienta YaST2, de configuración guiada por GUI. Arch no ofrece esa facilidad. openSUSE, por lo tanto, puede ser más apropiada para los usuarios que desean un entorno más guiado por la GUI, la configuración automática o la funcionalidad que se espera, permitiendo una profunda personalización.\n\n"
    },
    {
      "title": "Mandriva/Mageia",
      "level": 3,
      "content": "Mandriva Linux (anteriormente conocida como Mandrake Linux) se creó en 1998 con el objetivo de hacer que GNU/Linux sea fácil de usar para todos; está basada en RPM y usa el administrador de paquetes urpmi. Mageia es una bifurcación de Mandriva creada por antiguos empleados de Mandriva que se opone a la posición comercial de su distribución principal, ya que es un proyecto sin fines de lucro y dirigido por la comunidad. Arch toma un enfoque más simple que Mandriva o Mageia, ya que está basada en texto y se apoya en una configuración más manual, estando dirigida a usuarios de nivel tanto intermedios como avanzados.\n\n"
    },
    {
      "title": "Los *BSD",
      "level": 2,
      "content": "- Los *BSD comparten un origen común y descienden directamente del trabajo realizado en UC Berkeley para proporcionar un sistema UNIX de redistribución libre. No son distribuciones GNU/Linux, más bien son sistemas operativos de tipo UNIX, derivadas del código UNIX original de AT&T.\n- Arch y los *BSD comparten el concepto de una base y un sistema de ports estrechamente integrados. Sin embargo, a diferencia de las distribuciones GNU/Linux como Arch, el kernel de los *BSD y los programas del espacio de usuario (tanto la shell y las utilidades más comunes como ls, cp, cat y ps) se desarrollan conjuntamente en un único repositorio fuente.\n- La licencia BSD es permisiva, en contraste con la GPL, que establece que los derivados deben publicarse bajo la misma licencia. Arch está publicada bajo la GPL.\n- Para obtener más información sobre las variantes de los *BSD, véase esta comparación de los sistemas operativos BSD.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- DistroWatch.com - Novedades y reseñas sobre distribuciones de Linux\n\n"
    }
  ]
}