{
  "title": "Archinstall",
  "url": "https://wiki.archlinux.org/title/Archinstall",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is a candidate for moving to Install Arch Linux with menu-guided archinstall.** This article or section is a candidate for moving to Install Arch Linux with menu-guided archinstall.\n\nThis article or section is a candidate for moving to Install Arch Linux with menu-guided archinstall.\n\narchinstall is a helper library which automates the installation of Arch Linux. It is packaged with different pre-configured installers, such as a \"guided\" installer.\n\nThis document does not discuss use of archinstall as a Python library; see the official documentation for that.\n\n- Different defaults than the regular installation process are used. When using a system installed with archinstall, please mention so in support requests and provide /var/log/archinstall/install.log.\n- The Manual Partitioning does not protect against creating overlapping partitions, misaligned partitions or the last partition overlapping with the backup GPT header.\n\n"
    },
    {
      "title": "Running the installer",
      "level": 2,
      "content": "First, acquire and boot the live medium as described in Installation guide#Pre-installation. The archinstall package is part of the live medium and can be run directly:\n\n```\n# archinstall\n```\n\nThe guided installer will perform or ask user input for multiple steps, described in the official documentation.\n\nAdditional packages can be installed by specifying them after the Write additional packages to install prompt.\n\nOnce the installation is complete, green text should appear saying that it is safe to reboot, which is also the command you use to reboot.\n\n"
    },
    {
      "title": "Profiles",
      "level": 3,
      "content": "archinstall includes profiles, or sets of packages and pre-configured options which can be installed next to the base system.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- python-archinstall: guided\n\n"
    }
  ]
}