{
  "title": "ASUS TUF DASH F15 (2022)",
  "url": "https://wiki.archlinux.org/title/ASUS_TUF_DASH_F15_(2022)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU (Intel) | 8086:46a3 | Yes\nGPU (NVIDIA) | 10de:25a0 | Yes\nWebcam | 322e:202c | Yes\nEthernet | 8086:1a1e | Yes\nBluetooth | 8087:0026 | Yes\nAudio | 8086:51c8 | Yes\nWireless | 8086:51f0 | Yes\nTPM |  | Yes\n\nThis page contains instructions and tips for configuring Arch Linux on the ASUS TUF DASH F15 Laptop.\n\nNote: **DOES NOT** \n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "This laptop uses the standard American Megatrends UEFI interface, it is very bright and has both simple and advanced mode (F7 to swap between them). It has touchpad support in both modes though scrolling does not work in advanced mode meaning you need to use the keyboard to navigate the longer menus.\n\nSimple mode provides basic functions in a visual manner using defined box areas the user can click to open a sub menu. Most normal operations can be done here using either the keyboard or touchpad. This mode should not be difficult for visually impaired users to navigate.\n\nAdvanced mode is a more traditional menu driven layout. It is simply text on a coloured background and while the touchpad does work, scrolling does not so the keyboard must be used for most menus. This mode might be difficult for users with a visual impairment to navigate.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "This section contains instructions for installing and configuring Arch Linux\n\n"
    },
    {
      "title": "ASUS Linux",
      "level": 3,
      "content": "The ASUS Linux stack provides users of this laptop with a great many ASUS specific functions, to name a few:\n\n- Battery Charge Limit,\n- Multiplexer (GPU) Controls,\n- Panel Overdrive,\n- Much more.\n\nIt is highly recommended to install these tools for the optimal experience on these laptops.\n\n"
    },
    {
      "title": "Keyboard RGB control",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nThe keyboard does not have RGB support, as is stated on Asus' support website. It does, however, have support for simple lighting effects such as strobing.\n\nThe patches for controlling the backlight effects have been submitted for inclusion with Kernel version 6.10, as of right now you can install the G14 custom kernel, as outlined in the ASUS Linux#Custom kernel section.\n\n- The exact kernel version that works is Linux 6.9.9-arch1-1.1-g14.\n- From testing, the current AUR release DOES NOT support the effects.\n\n"
    },
    {
      "title": "Dedicated GPU mode",
      "level": 3,
      "content": "While asusctl bios -D 0 is able to set this laptop into Dedicated(Ultimate) mode, doing this will make video output unavailable even on bios screen, Asus logo, until you reach a X session. If you have any extra input configuration like luks you will have to touch type your passphrase in. There is an ongoing issue at https://gitlab.com/asus-linux/asusctl/-/issues/404\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Other than changing the boot device order, no firmware changes are required for this laptop.\n\nfwupd supports this device.\n\n"
    },
    {
      "title": "Manual Setup",
      "level": 4,
      "content": "Firmware will allow you to easily put Secure Boot into Setup/Custom mode so you can deploy your own keys with keytool.\n\nThere is no need to reset the TPM state to put firmware into setup mode, and also, if you have a usb thumbdrive with your CA files, or they are placed inside your ESP, you can deploy these certificates directly from the firmware as well.\n\nAlso, right after deploying your CA information, this laptop firmware will delete any additional EFI external drive boot entry it might have configured(USB, CD, PXE).\n\n"
    },
    {
      "title": "Automated Setup",
      "level": 4,
      "content": "If you do not want the hassle of manually handling keys then sbctl fully supports this laptop. See Secure Boot#Assisted process with sbctl for instructions.\n\n"
    },
    {
      "title": "Standalone Firmware Update Files Availability",
      "level": 4,
      "content": "Some UEFI upgrades might not be available directly from Asus website and will require Windows 10 or 11 to fetch them because those are only provided through the \"MyASUS\" Windows Store app only.\n\nAs an example, when accessing Asus Support website for the model FX517ZR here, the last UEFI firmware version available to download is v317. However, on the Linux Hardware Database, there is a report for this model here running firmware version FX517ZR.319, indicating that this user is dual-booting Windows to receive such UEFI updates or used Windows in the past to apply such updates.\n\n"
    },
    {
      "title": "D-Bus notifications",
      "level": 2,
      "content": "Notifications provide feedback when a setting is changed using asusctl, they used to rely on a systemd service but have since been integrated into asusctl and should now work with no user intervention.\n\n"
    },
    {
      "title": "Tips and tricks",
      "level": 2,
      "content": "To maximize the battery life, follow the general tips at power management.\n\n"
    },
    {
      "title": "Battery charge limit",
      "level": 3,
      "content": "Setting a limit to the battery charge can be useful to preserve its longevity when the laptop is used as a static workstation for long period of times. Set your preferred limit (in percent, from 20 to 100) using:\n\n```\n# asusctl -c 60\n```\n\n60% is usually considered a stable charge state for lithium-based batteries.\n\n"
    },
    {
      "title": "Power profile",
      "level": 3,
      "content": "The power profile controls three settings: CPU scaling (only on Intel CPUs), Boost mode and fans speed. By default, three profiles are provided: quiet, balanced and performance. Custom profiles can be defined.\n\nFn+F5 is automatically bound to switch power profile. This will imitate the way the original ASUS service works on Windows. Notifications should be enabled in order to know which profile is selected each time the shortcut is pressed. A specific profile can be manually selected using:\n\n```\n# asusctl profile -P quiet\n```\n\n"
    },
    {
      "title": "Disabling turbo boost",
      "level": 3,
      "content": "While not necessarily saving power, some user prefer to disable turbo boost for smoother power delivery and less heat. To temporarily disable boost, execute the following:\n\n```\n# echo 0 > /sys/devices/system/cpu/cpufreq/boost\n```\n\nOr use the power profiles from asusctl to handle this automatically, as explained in #Power profile.\n\n"
    },
    {
      "title": "DisplayPort",
      "level": 3,
      "content": "At the left side of the laptop (from the user's point of view) where the DC jack is located, there are two USB type C connectors, where the first one is a Thunderbolt 4 port and the other one is a USB 3.2 + DP 1.4 combo port.\n\nIf you are using more than one external monitor, use the Thunderbolt port to connect your DisplayPort to USB-C cable that leads to your secondary monitor.\n\nAfter some testing, it was proved that using this combo port instead of the Thunderbolt port somehow limits the other two monitors (built-in and HDMI) that are configured as 144hz but will not be able to deliver more than 60 frames per second on games.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "These is the list of functions keys and how they are handled by the system. Some of them like Fn+F2 are not visible to libinput debug-events meaning they are hardwired or lack of additional implementation to better handle them since they behave differently on Windows.\n\nThe first four keys on the following table are the dedicate buttons located right above F1 to F4 and since they are dedicated multimedia keys, Fn combination is not needed.\n\nTable content:\nKey | Visible? | Marked? | Effect\nVolume Down | Yes | Yes | XF86AudioLowerVolume.\nVolume Up | Yes | Yes | XF86AudioRaiseVolume.\nMic Mute | Yes | Yes | F20 Function key.\nAsus Key | Yes | No | KEY_PROG3 code 202. This key has a generic stamp on it which is bound to Asus internal design.\nFn+F1 | Yes | Yes | XF86AudioMute.\nFn+F2 | No | Yes | Lower keyboard brightness directly through hardware.\nFn+F3 | No | Yes | Raise keyboard brightness directly through hardware. These two keyboard brightness behave differently on Windows, changing also led style/patterns.\nFn+F4 | Yes | No | KEY_PROG4 code 203. Function named \"Aura\", on Windows it cycles keyboard backlight effects, on Linux it does nothing\nFn+F5 | No | No | A key with a Fan icon on it, cycles though available power profiles\nFn+F6 | Yes | Yes | Shortcut to Super + Shift + s, which is the screenshot crop hotkey for Windows. Keycap logo makes sense in some way.\nFn+F7 | Yes | Yes | XF86MonBrightnessDown.\nFn+F8 | Yes | Yes | XF86MonBrightnessUp.\nFn+F9 | Yes | Yes | Shortcut to Super + p, which is the external monitor tool for Windows. Keycap logo makes sense.\nFn+F10 | Yes | No | Key maps to F20 (press and release) and after that a sequence of AltGr + KEY_ZENKAKUHANKAKU code 85 keystroke. Logo seems to be a crossed touchpad but prints out this unusual sequence.\nFn+F11 | Yes | Yes | KEY_SLEEP code 142. Little Zzz on key makes it meaningful.\nFn+F12 | No | No | Key should be Airplane mode but does not show on libinput nor disables network interfaces.\nFn+Down | Yes | Yes | KEY_PAGEDOWN code 109.\nFn+Up | Yes | Yes | KEY_PAGEUP code 104.\nFn+Left | Yes | Yes | KEY_HOME code 102. This laptop has a dedicated Home key at the top of the numpad, and this key combination for it as well.\nFn+Right | Yes | Yes | KEY_END code 107.\nFn+Del | Yes | Yes | KEY_INSERT code 110. This laptop has these dual keys around the numpad, some of them repeating keys that are elsewhere.\nFn+Pause | Yes | Yes | No effect so all. Pressing Fn+Pause or Pause it will issue KEY_PAUSE code 119 on both cases\nFn+PrtSc | Yes | Yes | It will send BOTH keys, PrtSc and SysRq in that sequence, no matter if using Fn+PrtSc or PrtSc. Really weird.\nFn+Home | Yes | Yes | KEY_END code 107.\nFn+Numpad Enter | Yes | Yes | XF86Calculator.\nFn+Right Ctrl | Yes | Yes | KEY_COMPOSE code 127.\nFn+Super | Yes | No | Issuing this key combination will lock Super into sending KEY_UNKNOWN code 240, until you issue Fn+Super again to change this behavior.\n\n"
    },
    {
      "title": "Suspend and Resume",
      "level": 2,
      "content": "This model is known for two outstanding firmware bugs that were not fixed by Asus yet, and maybe they will not be fixed since the last bios update(v317) dates back from 2023-08-24. These bugs are:\n\n- When the laptop resumes from S3 sleep mode (deep at /sys/power/mem_sleep), it will work for about one minute and reset the laptop without logs or indications that the operating system did something. It just power cycles the laptop. Multiple reports can be found over the internet, and two of them can be found here and here.\n- If VMD is enabled in firmware for Raid Mode disks(Intel RST), when memory sleep is configured for modern standby (s2idle at /sys/power/mem_sleep), there will be a significant power drain during the sleep, in magnitudes of 10% each 4 to 6 hours depending on the amount of softwares loaded.\n\nThis means that the user will have to configure s2idle instead of relying on firmware S3 suspend-to-ram, and also disable Intel RST for a decent suspend and resume configuration.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Hardware Probe - i5 + RTX3060 version\n- Hardware Probe - i7 + RTX3070 version (additional Sabrent drive not included with base model)\n- Official Asus TUF Dash F15(2022) page\n- TUF Dash F15 Online PDF manuals\n\n"
    }
  ]
}