{
  "title": "ASUS ROG Zephyrus G14 (2022) GA402",
  "url": "https://wiki.archlinux.org/title/ASUS_ROG_Zephyrus_G14_(2022)_GA402",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU | 1002:1681 | Yes\nWi-Fi | 14c3:7922 | Yes\nBluetooth | 13d3:3568 | Yes\nAudio | 1022:15e3 | Yes\nTouchpad | 04F3:319B | Yes\nKeyboard | 0b05:19b6 | Yes\nWebcam | 13d3:56eb | Yes\n\nThis page is applicable to the Asus ROG Zephyrus G14 GA402.\n\n"
    },
    {
      "title": "VFIO",
      "level": 2,
      "content": "The GPUs being muxed makes this laptop great for PCI Passthrough.\n\nKernel parameters can be set to bind vfio-pci to the discrete GPU.\n\n```\nrd.driver.pre=vfio-pci nogpumanager vfio-pci.ids=1002:73ef,1002:ab28\n```\n\nThe GPU can then later be unbound from vfio-pci and rebound to AMDGPU later without disturbing the X11 session.\n\n```\n# echo 0000:03:00.0 > /sys/bus/pci/devices/0000:03:00.0/driver/unbind  \n# echo 0000:03:00.1 > /sys/bus/pci/devices/0000:03:00.1/driver/unbind\n# modprobe amdgpu\n# echo 0000:03:00.0 > /sys/module/amdgpu/drivers/pci:amdgpu/bind \n# echo 1 > /sys/bus/pci/rescan\n```\n\n"
    },
    {
      "title": "Power Management",
      "level": 2,
      "content": "See Power management, Laptop#Power management, AMDGPU#Power profiles\n\n"
    },
    {
      "title": "Suspend",
      "level": 2,
      "content": "Attempting to use s2idle occasionally crashes AMDGPU, resulting in artifacting.\n\nA legacy s3 patch is available. See Power management/Suspend and hibernate#Changing suspend method.~\n\n"
    },
    {
      "title": "Wi-Fi",
      "level": 3,
      "content": "The MediaTek MT7922 works with the MT7921e driver, but has oddly high ping times (~20ms for a single hop) with high variability (>2ms jitter). So it is functional, but has problems.\n\nSome have recommended switching it out for the more popular and widely supported Intel Wi-Fi cards.\n\n"
    },
    {
      "title": "ASUS Linux",
      "level": 2,
      "content": "The ASUS Linux stack provides users of this laptop with a great many ASUS specific functions, to name a few:\n\n- Battery Charge Limit,\n- Multiplexer (GPU) Controls,\n- Panel Overdrive,\n- Much more.\n\nIt is highly recommended to install these tools for the optimal experience on these laptops.\n\n"
    },
    {
      "title": "Issues",
      "level": 2,
      "content": "Seems to be mostly fixed as of 6.8.1. Some users still report occasional problems.\n\nAs of kernel 6.6.8, there are some issues on this laptop:\n\n- Laptop will not resume from suspend and must be forcefully shutdown.\n- Laptop will suddenly jump to 100% fan usage while on suspend and must be forcefully shutdown.\n- Laptop will freeze after Gnome log-in and must be forcefully shutdown. After restarting, log-in works.\n\nSome of these issues are stated to be solved as of 6.8rc5, but some still persist, so it is probably a good idea to stay on 6.6.7, at least until all of the issues are fixed.\n\ndowngradeAUR can be used to easily downgrade the kernel and add it to IgnorePkg automatically.\n\nThere is an issue open on the amd repo: https://gitlab.freedesktop.org/drm/amd/-/issues/3132#note_2293507.\n\nMore info on these issues on the Linux on ASUS ROG discord thread: https://discord.com/channels/725125934759411753/1197603143660339311. If you are not part of the discord server, then you can join via the invite link: https://discord.gg/gZEEynwA.\n\n"
    }
  ]
}