{
  "title": "ASUS Linux",
  "url": "https://wiki.archlinux.org/title/ASUS_Linux",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- asusctl\n- supergfxctl\n\nASUS Linux is a suite of tools designed to improve the performance and functionality of ASUS laptops when running Linux. It comes in 2 main parts, asusctl and supergfxctl, the former interacts with the asus-wmi and the asus-armoury kernel modules to control BIOS level features and the latter is used to control the dedicated GPU in dual GPU systems.\n\nThe project is maintained by Luke Jones and is hosted on GitLab.\n\n"
    },
    {
      "title": "Software",
      "level": 2,
      "content": "ASUS Linux provides many packages, please see subsections below.\n\nThere is a custom repository which contains prebuilt binaries available: Unofficial user repositories#g14, provided by Luke Jones.\n\nThis repository is the officially recommended way of installing the asus-linux utilities by the asus-linux developers, it was created and is being maintained by them.\n\nSee: https://asus-linux.org/guides/arch-guide/\n\nNote: **does not** \n\nNote: **first** \n\n"
    },
    {
      "title": "asusctl",
      "level": 3,
      "content": "asusctlAUR is a CLI utility for ASUS ROG & TUF laptop, to name some of the important features it gives users control over:\n\n- Integrated GPU MUX Control\n- Keyboard RGB Lighting Profile (but limited compared to the Windows AURA/Armoury Crate)\n- Fan Curves\n- Battery Charge Limit\n- Panel Overdrive\n- AniMe Matrix Screens\n\nFor usage instructions see asusctl.\n\n"
    },
    {
      "title": "supergfxctl",
      "level": 3,
      "content": "supergfxctlAUR is a CLI utility for managing GPU switching functionality on ASUS hybrid laptops, particularly dedicated GPU MUX control.\n\nFor usage instructions see supergfxctl.\n\n"
    },
    {
      "title": "rog-control-center",
      "level": 3,
      "content": "rog-control-centerAUR is a GUI frontend for asusctl and supergfxctl.\n\n"
    },
    {
      "title": "Custom kernel",
      "level": 3,
      "content": "The ASUS Linux project maintains a set of kernel patches specific to ASUS mobile devices and packages them into a kernel. Typically using this kernel is not required however in some edge cases (usually for very recent laptops) all your laptop features might not function without it.\n\nInstall linux-g14AUR and linux-g14-headersAUR.\n\n- If you added the G14 unofficial repository, you can install the AUR packages above directly through pacman.\n- If you are switching from a stock kernel to a custom kernel you must also update any kernel modules to their DKMS variants.\n- If you encounter an error that says 'The asus-armoury driver is not loaded', you should be able to solve it by installing this kernel.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Project homepage - https://asus-linux.org/\n- Project GitLab page - https://gitlab.com/asus-linux\n\n"
    }
  ]
}