{
  "title": "ASUS Zenbook UM425",
  "url": "https://wiki.archlinux.org/title/ASUS_Zenbook_UM425",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWireless |  | Yes\nAudio |  | Yes\nTouchpad |  | Partial\nKeyboard |  | Partial\nCamera |  | Yes\nCard Reader |  | Yes\nBluetooth |  | Yes\n\n"
    },
    {
      "title": "Secure Boot (option)",
      "level": 3,
      "content": "In order to boot any Linux operating system, navigate to BIOS (hold F2 during power-on), then hit F7 or click on Advanced Menu, then the Security tab and set Secure Boot to Off.\n\nIf the aforementioned Secure Boot option is a menu rather than an on-or-off option, click on Secure Boot, Key Management, then Reset to Setup Mode and confirm in the dialog.\n\n"
    },
    {
      "title": "Video",
      "level": 3,
      "content": "See AMD and Hardware video acceleration.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "See PulseAudio.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "See Libinput.\n\nThe NumPad is working with asus-touchpad-numpad-driver implementation from GitHub. Be sure to install python-libevdev and i2c-tools before starting systemd's service, otherwise this script will not work.\n\n"
    },
    {
      "title": "Keyboard",
      "level": 3,
      "content": "Some people encounter issues on cold boot where the keyboard is unresponsive.\n\nAdding i8042.probe_defer to the kernel parameters seems to resolve the problem, this can be done by either rebooting, using a USB keyboard, or using chroot.\n\nSee https://lore.kernel.org/lkml/20211112180022.10850-1-tiwai@suse.de/T/ (this commit only seems to mention the UA version but this was tested on UX425QA).\n\n"
    },
    {
      "title": "Battery charge threshold",
      "level": 3,
      "content": "Battery charge threshold is working. Laptop's battery stops charging at certain percentage when value in /sys/class/power_supply/BATT/charge_control_end_threshold is set to either 60, 80, or 100. But upower may report the wrong charging status and percentage when the battery threshold is set below 100; You may see the status listed as \"Charging\" even when the battery is fully charged to the limit, and the percentage may be one point short of the limit. For example when charging to 80, the battery's charge may say 79. See https://gitlab.freedesktop.org/upower/upower/-/issues/142\n\nIn order to automatically change the value at boot, user can create the systemd service: refer to Laptop/ASUS#Battery charge threshold\n\n"
    },
    {
      "title": "Tips and tricks",
      "level": 2,
      "content": "See ASUS Zenbook UX430/UX530#Tips and tricks (with the exception of battery life, which is 20 hours for this model).\n\n"
    }
  ]
}