{
  "title": "ASUS Zenbook UM5606",
  "url": "https://wiki.archlinux.org/title/ASUS_Zenbook_UM5606",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad | PS/2 | Yes\nTouchscreen & stylus | PS/2 | Yes\nKeyboard | PS/2 | Yes\nGPU | 1002:150e | Yes\nNPU | c5:00.1 | Yes\nWebcam | 3277:0059 | Yes\nALS |  | Yes\nBluetooth | 13d3:3608 | Yes\nSD-card reader | 17a0:9755 | Yes\nAudio | 1022:15e3 | Yes\nWireless | 14c3:7925 | Yes\nThunderbolt | 1022:151c | Yes\nTPM | 1022:17e0 | Yes\nFans |  | Yes\n\nThis page is for the ASUS Zenbook S 16 (UM5606/UM5606WA), although this may help for other 2024 ASUS laptops with the Ryzen 9 AI chips (HX 365/370) such as the ASUS Vivobook S 16 (M5606) and the ProArt P16 (H7606/H7606WV).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "When booting into the Arch Linux ISO, press the e key to edit the chosen boot option and add the amdgpu.dcdebugmask=0x600 kernel parameter to prevent freezing during installation. A similar setting may or may not be needed after installation, see the Power Management section.\n\nIf you're using KDE, you need to run systemctl edit --user plasma-kwin_wayland.service and add this to the configuration:\n\n```\n~/.config/systemd/user/plasma-kwin_wayland.service.d/override.conf\n```\n\n```\n[Service]\nEnvironment=\"KWIN_DRM_DISABLE_TRIPLE_BUFFERING=1\"\n```\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The UEFI may be difficult to navigate using screen readers, and it may be difficult to see the boot menu edit options when inputting the temporary kernel parameter. If necessary, you should proceed with the assistance of a sighted person.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "fwupd shows the CPU/GPU, TPM, SMU, UEFI firmware, NVMe, System firmware (which can have an attestation added), and the webcam. Most of them show as updatable, but no OTA updates have been released as of the time of writing.\n\nThere is an important UEFI update that has been posted on ASUS's website -- to apply it, download the \"BIOS for ASUS EZ Flash Utility\" (not \"for Windows\") file, extract the contents to a FAT32 formatted USB drive, reboot and go into the firmware setup, and then go into the \"EZ Flash\" menu. The update can be found here: [1]\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "Linux ≥6.14rc1 is needed to alleviate most power management problems, including high power usage during suspend and random freezing/hanging.\n\n"
    },
    {
      "title": "Panel Self Refresh",
      "level": 3,
      "content": "Random freezing/hanging may persist despite upgrading to a 6.14 relase candidate kernel due to a known issue with PSR2-SU on Strix Point APUs. PSR2-SU should be disabled by default in future kernels, it can be disabled in the meantime by setting amdgpu.dcdebugmask=0x200, which will disable PSR2-SU but keep legacy PSR enabled. PSR status can be confirmed using\n\n```\n# cat /sys/kernel/debug/dri/1/eDP-1/psr_state\n```\n\n```\n6\n```\n\nwhich should not return a non-negative value (note that compositor options and misbehaving applications may also interfere with PSR). If you continue to encounter issues, set amdgpu.dcdebugmask=0x600 as in the installation, which will entirely disable PSR. amdgpu.sg_display=0 may also need to be set if you encounter issues with external monitors.\n\n"
    },
    {
      "title": "Fan Control",
      "level": 3,
      "content": "The firmware supports four fan profiles: standard, quiet, high-performance, and full-performance. Out of the box, it's set to standard, but this can be changed with asus-5606-fan-state-gitAUR.\n\n"
    },
    {
      "title": "Wake from suspend",
      "level": 3,
      "content": "There is currently known a problem when waking up from suspend (s2idle) that the screen will freeze for about 10 seconds. This problem is currently caused by the mt7925e kernel module failing to properly re-initialize the MT7925 wireless card after resuming. This has been fixed in Linux ≥6.14-rc1].\n\nHowever, as a temporary workaround for older kernel, you can unbind the device from the driver before suspending and later rebind it after resuming. This can be achieved using the following two systemd service units:\n\n```\nunbind-wifi-before-suspend.service\n```\n\n```\n[Unit]\nDescription=Unbind Wi-Fi PCI device before suspend\nBefore=suspend.target\n\n[Service]\nType=oneshot\nExecStart=/bin/bash -c \"echo \"0000:c3:00.0\" > /sys/bus/pci/drivers/mt7925e/unbind\"\nRemainAfterExit=false\n\n[Install]\nWantedBy=sleep.target\n```\n\n```\nbind-wifi-after-resume.service\n```\n\n```\n[Unit]\nDescription=Bind Wi-Fi PCI device after resume\nAfter=suspend.target\n\n[Service]\nType=oneshot\nExecStart=/bin/bash -c \"echo \"0000:c3:00.0\" > /sys/bus/pci/drivers/mt7925e/bind\"\nRemainAfterExit=false\n\n[Install]\nWantedBy=suspend.target\n```\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "Linux ≥6.13 is needed to get audio fully working without sounding tinny.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "Linux ≥6.12 is needed to get Bluetooth working. The aptX HD, LDAC, SBC-XQ codecs over Bluetooth have been tested for and work for wireless headphones.\n\n"
    },
    {
      "title": "NPU",
      "level": 2,
      "content": "Currently Linux ≥6.14rc1, xrt-npu-gitAUR, and amdxdna-driver-binAUR are all needed to get the NPU to work. Tested against the AMD XDNA Linux driver's provided example on the arch-linux branch of ThatOneCalculator's fork.\n\n"
    },
    {
      "title": "GPU",
      "level": 2,
      "content": "The GPU pretty much all works as expected.\n\nHowever, GPU screen recording with tools like wl-screenrecAUR and gpu-screen-recorderAUR don't work with mesa 24.2 or 24.3, but does work with mesa-gitAUR (as of 8 December 2024). This will be backported to 24.3 with mesa MR !32542.\n\n"
    },
    {
      "title": "ALS",
      "level": 2,
      "content": "The Ambient Light Sensor (ALS) works out of the box on GNOME, and on wlroots/smithay compositors with wlumaAUR and this configuration:\n\n```\n~/.config/wluma/config.toml\n```\n\n```\n[als.iio]\npath = \"/sys/bus/iio/devices\"\nthresholds = { 0 = \"night\", 2 = \"dark\", 5 = \"dim\", 8 = \"normal\", 13 = \"bright\", 15 = \"outdoors\" }\n\n[[output.backlight]]\nname = \"eDP-1\"\npath = \"/sys/class/backlight/amdgpu_bl1\"\ncapturer = \"none\"\n```\n\n"
    },
    {
      "title": "Backlight",
      "level": 3,
      "content": "Linux ≥6.12 is needed to make keyboard backlight control work.\n\n"
    },
    {
      "title": "Function keys",
      "level": 3,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Enables Fn lock\nFn+F1 | Yes | Yes | XF86AudioMuteToggle\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | No3 | Yes | Adjusts keyboard backlight\nFn+F5 | Yes | Yes | XF86MonBrightnessDown\nFn+F6 | Yes | Yes | XF86MonBrightnessUp\nFn+F7 | Yes | Screen mirroring icon | Super+P\nFn+F8 | Yes | Smiley face icon | Super+.\nFn+F9 | Yes | Yes | XF86AudioMicMute\nFn+F10 | Yes | Yes | XF86Webcam\nFn+F12 | Yes | Icon that looks like ⫽] | XF86Launch1\nCopilot | Yes | MS Copilot logo | Super+Shift+XF86Assistant\n\n1. The key is visible to xev, showmethekey, screenkey, and similar tools\n1. The physical key has a symbol on it, which describes its function\n1. The key isn't visible to keycode viewer tools, but it sends a signal that D-Bus picks up on, and GNOME sees it (and shows the OSD popup). The signal looks like this:\n\n```\nsignal time=XXXXXXXXX.XXXXXX sender=:1.44 -> destination=(null destination)    serial=XXX path=/org/freedesktop/UPower/KbdBacklight; interface=org.freedesktop.UPower.KbdBacklight; member=BrightnessChanged\n   int32 3\n```\n\nWhere the int32 can be a value between 0 and 3, denoting which of the four brightness levels the keyboard backlight has been set to (0 = off, 1 = low, 2 = medium, 3 = high).\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official tech specs\n- UEFI updates\n- HW Probe\n- DSDT dump\n- BNieuwenhuizen's ongoing research\n- Bug report for PSR2-SU on Strix Point APUs\n\n"
    }
  ]
}