{
  "title": "Belgian eID card reader",
  "url": "https://wiki.archlinux.org/title/Belgian_eID_card_reader",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Common Access Card\n- Smartcards\n\nNote: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nAn electronic identification (\"eID\") is an electronic identification solution of citizens or organizations, for example in view to access benefits or services provided by government authorities, banks or other companies. Apart from online authentication many eICs also give users the option to sign electronic documents with a digital signature.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the ccid package, all electronic identification requires this package. Then see #Hardware specific packages.\n\nFor pinentry support, install pinentry.\n\n"
    },
    {
      "title": "ACS smart cards",
      "level": 4,
      "content": "Install the acsccid package.\n\nFor more information about ACS smart cards, see [1].\n\n"
    },
    {
      "title": "Cr-75 card reader",
      "level": 4,
      "content": "Install the libcr75-gitAUR package for the device with the 1307:0361 ID.\n\n"
    },
    {
      "title": "Belgium",
      "level": 2,
      "content": "To identify with an identification card reader, the following steps are required:\n\n- The app for authentication [2]\n\nImport the (continuous build) keys from [3]. See makepkg#Signature checking.\n\nInstall the eid-mwAUR package, then run:\n\n```\n$ about-eid-mw\n```\n\nwhich should open a window. In the window, check that the \"PCSC daemon status\" is \"running\". If it is not the case, start pcscd.service. Even if it says it's socket activated / automatically started instead of \"running\", try starting the service manually and see if it works then. In the same window, copy the value for \"PKCS#11 location\". This value can alternatively be found by first finding the module (which might be beidpkcs11.so) by doing:\n\n```\n# p11tool --list-tokens\n```\n\nThen finding the full path with:\n\n```\n# find /usr/lib -name beidpkcs11.so\n```\n\n- The driver of the card reader itself.\n\nLook at the brand of the card reader; there is a high chance it is ACS (Advanced Card System Ltd). If it is ACS, go to https://belgeid.be/en/product/acr38 and download the Linux driver. Follow the described install driver process.\n\n- Know which internet browser you will be using\n\nFor Chrome, no plugin. For Chromium, you will need to install opensc and p11-kit as well. You may consider: https://devctl.blogspot.com/2014/01/making-belgian-eid-work-on-arch-linux.html\n\nFor Firefox, add the Firefox plugin to your browser. In recent versions, you will need to manually add the eID module to the Firefox security devices configuration. Your module path might be different than the one in the guide, use the value of \"PKCS#11 location\" found with the instructions at the authentication paragraph.\n\nFor Librewolf, also symlink the directories created by the middleware to /usr/lib/librewolf/, to avoid an error notification when starting Librewolf:\n\n```\n# ln -s /usr/lib/mozilla/managed-storage /usr/lib/librewolf/managed-storage\n# ln -s /usr/lib/mozilla/pkcs11-modules /usr/lib/librewolf/pkcs11-modules\n```\n\nTo test if the setup worked, try it out on the test page. You may find hints for troubleshooting in the official documentation but keep in mind that Arch Linux is not officially supported.\n\nAlso note that using Flatpak or Snap is/was not supported, as those do not allow PKCS#11 modules such as eID to be loaded. Fixed for snap for all opensc readers: closed launchpad bug.\n\n"
    },
    {
      "title": "Signing documents",
      "level": 3,
      "content": "Signing emails with Thunderbird and documents with LibreOffice is explained in a blog post by Luc Stroobant.\n\nDepending on your system configuration it may be possible to run Adobe Reader DC under wine (see also the official FAQ on digital digital signatures). If using Adobe Reader is not possible, you can use Belgian Federal Public Services' \"signing box\". Using this service requires the installation of an extra eID middleware beidconnectAUR and browser extension by e-contract.be. Navigate to the signing box page, upload any pdf-file and attempt to add a digital signature to begin the installation process.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nAlternatively, okular provides native digital signing of pdf's in Linux since version 21.04.\n\n"
    },
    {
      "title": "SSL",
      "level": 3,
      "content": "Install ca-certificates-icp_brAUR as the Brazilian root CAs are not part of Mozilla's NSS due to a long standing issue.\n\nThe above package should be enough. If you have any issue, check [ITI's installation instructions https://www.gov.br/iti/pt-br/assuntos/navegadores] for Chromium, Firefox and other popular web browsers, and for Java.\n\n"
    },
    {
      "title": "Smart Cards (A3 certificates)",
      "level": 3,
      "content": "1. Install safesignidentityclientAUR and opensc.\n\n2. Start/enable pcscd.service\n\n"
    },
    {
      "title": "Firefox",
      "level": 4,
      "content": "Navigate to Edit -> Preference -> Advanced -> Certificates -> Security Devices and click \"Load\" to load a module using /usr/lib/libaetpkss.so and name it ICP-Brasil A3 - Safe Sign Identity Client.\n\nTest it by going to Receita Federal's e-CAC.\n\n"
    },
    {
      "title": "Chrome",
      "level": 4,
      "content": "Ensure Chrome is closed and run:\n\n```\n$ modutil -dbdir sql:$HOME/.pki/nssdb/ -add \"ICP-Brasil A3 - Safe Sign Identity Client\" -libfile /usr/lib/libaetpkss.so\n```\n\n"
    },
    {
      "title": "Croatia",
      "level": 2,
      "content": "1. Start/enable pcscd.service\n1. Install certiliamiddlewareAUR.\n1. Launch the client. It is used for activating the card or changing the PINs or the PUK.\n\n"
    },
    {
      "title": "Firefox",
      "level": 3,
      "content": "Navigate to Edit > Preference > Advanced > Certificates > Security Devices and click Load to load a module using /usr/lib/akd/certiliamiddleware/pkcs11/libEidPkcs11.so. You can assign any name to it, i.e. Cro PKCS#11 Module.\n\n"
    },
    {
      "title": "Estonia",
      "level": 2,
      "content": "See https://www.id.ee/en/.\n\n"
    },
    {
      "title": "DigiDoc",
      "level": 3,
      "content": "Once ccid and opensc is installed and pcscd.socket is started, install qdigidoc4AUR. One of the dependency xml-security-cAUR is verified with a signature that you have to import to your GnuPG keyring.\n\n```\n$ gpg --keyserver keys.openpgp.org --recv-keys DCAA15007BED9DE690CD9523378B845402277962\n```\n\nIf you have an ACS card reader, acsccid is required.\n\nDigiDoc4 has an optional GNOME/Files right click menu integration that requires nautilus-python to be installed.\n\n"
    },
    {
      "title": "Browser Configuration",
      "level": 3,
      "content": "Current browser ID-Card stack is based on Web eID. It provides consistent user experience on all supported platforms for both PIN 1 authentication and PIN 2 document signing.\n\nWeb eID consists of two components. Both need to be installed.\n\n- web-eid-nativeAUR - Native component used by all browsers\n- web-eid-chromeAUR and web-eid-firefoxAUR - Browser extension that talks to the native component\n\nweb-eid-nativeAUR is verified with a signature and you need to import developer PGP keys to your GnuPG keyring.\n\n```\n$ wget -q -O- https://github.com/metsma.gpg | gpg --import -\n$ wget -q -O- https://github.com/mrts.gpg | gpg --import -\n```\n\nNot all sites have migrated to the new Web eID PIN 1 JavaScript API and use the older Mutual TLS (also some times called TLS-CCA. You still need to configure opensc PKCS #11 provider in the browsers by running this command:\n\n```\n$ pkcs11-register\n```\n\nYou will also need to restart the browser afterwards.\n\n"
    },
    {
      "title": "Testing",
      "level": 3,
      "content": "- Make sure that Web eID extension is installed and enabled\n- Go to https://web-eid.eu/ and follow Authenticate -> Sign flow\n- Test Mutal TLS (TLS-CCA) using https://test-eid.eesti.ee/\n\n"
    },
    {
      "title": "Finland",
      "level": 2,
      "content": "Official instructions: https://dvv.fi/kansalaisvarmenne-kortinlukijaohjelmisto.\n\n"
    },
    {
      "title": "mPollux Digisign Client",
      "level": 3,
      "content": "First install the prequisites as described in #Installation. Then install vrk-mpollux-digisign-clientAUR. Launch the client, connect your reader and put in your card. Click the icon in your status bar once it turns yellow. This should trigger the card activation process if you have not activated it before.\n\n"
    },
    {
      "title": "Firefox",
      "level": 4,
      "content": "Navigate to Security Devices page (Search it via Preferences), then click Load and set Module Name to DigiSign PKCS#11-moduuli and module filename to /usr/lib/libcryptoki.so. Finally restart Firefox. The card can be tested at: https://dvv.fi/testaa-varmenteen-kayttoa.\n\n"
    },
    {
      "title": "ReinerSCT devices",
      "level": 3,
      "content": "For some devices, you need to install pcsc-cyberjackAUR and copy the default configuration file /etc/pcsc-cyberjack/cyberjack.conf.default to the same folder, without the .default suffix. Restart pcsc.service and applications like ausweisapp2AUR should recognize the scanner. The ReinerSCT RFID will blink its LED, which it does not when the driver is not installed correctly.\n\nYou can also use a smartphone as the card reader, if both your computer and the smartphone are in the same network. You must install and run AusweisApp on the phone (available for Android / iPhone).\n\n"
    },
    {
      "title": "Latvia",
      "level": 2,
      "content": "For document signing install the eparakstitajs3AUR package. No additional software is necessary to use it with eParaksts mobile.\n\nTo use the eID card, install latvia-eid-middlewareAUR and the perquisite packages listed in #Installation, and make sure to enable and start pcscd.service. To use it in a browser, additionally install the browser extension eparaksts-token-signingAUR.\n\n"
    },
    {
      "title": "DNI electrónico (DNIe)",
      "level": 3,
      "content": "Install ca-certificates-dnieAUR. To sign documents using your identity card, install autofirmaAUR.\n\n"
    },
    {
      "title": "Sweden",
      "level": 2,
      "content": "BankID is the leading electronic identification in Sweden.\n\n"
    }
  ]
}