{
  "title": "Borg backup",
  "url": "https://wiki.archlinux.org/title/Borg_backup",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- System backup\n- Synchronization and backup programs\n\nBorgBackup (short: Borg) is a deduplicating backup program. Optionally, it supports compression and authenticated encryption.\n\nThe main goal of Borg is to provide an efficient and secure way to backup data. The data deduplication technique used makes Borg suitable for daily backups since only changes are stored. The authenticated encryption technique makes it suitable for backups to not fully trusted targets.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the borg package. The next major release, version 2, is available as beta with borg2AUR. The development version is available with borg-gitAUR.\n\nFor additional features, install the following packages:\n\nIf you wish to backup to a different machine than the one where data is sourced, this other machine (the \"server\") also requires borg to be installed. In order to facilitate creation and management of backups, server administrators can take advantage of:\n\n"
    },
    {
      "title": "Documentation",
      "level": 2,
      "content": "The official documentation includes a quickstart guide. Local documentation can be found in borg(1) and apropos borg.\n\nAdditionally, guidance can be found through the command, either generally:\n\n```\n$ borg help\n```\n\nor for specific commands:\n\n```\n$ borg help command\n```\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "The main concept behind Borg is de-duplication: rather than accumulating files as in traditional TAR archiving, de-duplication verifies the identity of files, regardless of their names, by hashing them so that they are only copied once. This means that even without compression, it takes up minimal space for repeated incremental backups.\n\nFile compression is optional and supports multiple algorithms (zstd is recommended) and intensities.\n\nArchives created with Borg can be mounted as FUSE filesystems for browsing and restoring individual files.\n\nArchives can be created locally, or on remote systems using SSHFS, NFS, Samba, or similar mounting solutions. Transfer over SSH is supported, but the remote host must have Borg available.\n\n"
    },
    {
      "title": "Creating repositories",
      "level": 3,
      "content": "Borg repositories can be encrypted or made tamper-evident. For more information on modes and options, consult the official documentation on setting up a repository.\n\nTo create a Borg repository without encryption or authentication:\n\n```\n$ borg init --encryption=none /path/to/repo\n```\n\n"
    },
    {
      "title": "Creating archives",
      "level": 3,
      "content": "Individual archive instances can be created within the repository with the borg create command. Each archive must be given a unique name. Borg includes a list of placeholders to make adding strings such at dates, times, usernames, and hostnames easier.\n\nTo create an archive of the archivable-dir directory with the hostname of the source machine and the current date:\n\n```\n$ borg create /path/to/repo::{hostname}-{now:%Y-%m-%d} archivable-dir\n```\n\nBorg supports extensive inclusion and exclusion options. To exclude .pyc files from the archive:\n\n```\n$ borg create ... --exclude '*.pyc' /path/to/repo::archive-name\n```\n\nMore information can be found on the borg create documentation page.\n\n"
    },
    {
      "title": "Pruning archives",
      "level": 3,
      "content": "The removal of old archives is not performed automatically, but can be performed manually with the borg prune command. The number of archives to keep must be specified, and can be limited by the time the archive was created.\n\nTo keep only the last 7 daily archives, the last four weekly archives, and the last three monthly archives:\n\n```\n$ borg prune --keep-daily=7 --keep-weekly=4 --keep-monthly=3 /path/to/repo\n```\n\nTo keep only the last 10 archives, regardless of when they were created:\n\n```\n$ borg prune --keep-last=10 /path/to/repo\n```\n\nTo keep all archives from the past 30 days, regardless of how many archives that includes:\n\n```\n$ borg prune --keep-within=30d /path/to/repo\n```\n\nNote: **all** \n\nMore information can be found on the borg prune documentation page.\n\n"
    },
    {
      "title": "Restoring from an archive",
      "level": 3,
      "content": "To restore from an archive:\n\n```\n$ borg extract /path/to/repo::archive-name path/to/restore\n```\n\nAlternatively, a repository can be mounted for interactive restoration:\n\n```\n$ borg mount /path/to/repo::archive-name\n```\n\n"
    },
    {
      "title": "Cache exclusion",
      "level": 3,
      "content": "Archives' size can be reduced by excluding cache directories. Directories that adhere to the Cache Directory Archiving Standard can be automatically excluded by appending --exclude-caches to the archive creation command:\n\n```\n$ borg create ... --exclude-caches /path/to/repo::archive-name\n```\n\n"
    },
    {
      "title": "Listing affected files",
      "level": 3,
      "content": "Many operations in Borg support the --list flag to list affected files or archives. If paired with --dry-run, the user can verify the effects of a given command.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official documentation\n\n"
    }
  ]
}