{
  "title": "Budgie",
  "url": "https://wiki.archlinux.org/title/Budgie",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- Display manager\n- Window manager\n- GTK\n\nBudgie is a desktop environment, formerly a project within Solus, becoming independent under the newly formed Buddies of Budgie organization in January 2022. It uses GTK for widgets, and is written in C and Vala. As of Budgie 10, the only available session is on Xorg.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the budgie package group to install all first-party components of the desktop. Individual packages can also be installed - use the budgie-desktop package for the latest stable or budgie-desktop-gitAUR for current git main. Installed alongside as runtime dependencies are budgie-screensaver for screen locking support, and budgie-control-center for modification of system settings. The following packages are optional, but add additional functionality to the desktop:\n\n- budgie-desktop-view: Official implementation of desktop icons\n- budgie-backgrounds: Official set of default desktop backgrounds\n- network-manager-applet: Network management from within the panel\n- materia-gtk-theme or arc-gtk-themeAUR: The GTK themes recommended by upstream\n- papirus-icon-theme: The default icon theme\n\nExtra applets developed by the Ubuntu Budgie team are available in the budgie-extras package - be warned, however, that this package also modifies existing functionality and could cause issues.\n\n"
    },
    {
      "title": "Configuring user directories",
      "level": 3,
      "content": "Follow the XDG user directories instructions to create the \"well known\" user directories like Desktop, Downloads, etc. Logout and log back in for the Budgie menu to detect changes to the configuration.\n\n"
    },
    {
      "title": "File manager",
      "level": 3,
      "content": "Budgie does not come with a file manager, and one is not installed by default. GNOME/Files (previously Nautilus) works well, and others are available.\n\n"
    },
    {
      "title": "Starting",
      "level": 2,
      "content": "Choose Budgie Desktop session from a display manager of choice, or modify xinitrc to include Budgie Desktop:\n\n```\n~/.xinitrc\n```\n\n```\nexport XDG_CURRENT_DESKTOP=Budgie:GNOME\nexec budgie-desktop\n```\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "You can see your notification backlog, set the system and application volume, view a calendar, and see any currently playing videos or music with the \"Raven\" sidebar. The \"Notifications\" section can be accessed quickly with Super+n or by clicking on the Notifications applet in the panel, and the \"Applets\" section can be accessed quickly with Super+a. Raven can also be opened by clicking on the \"Raven Trigger\" applet in the panel, and will be opened to the previously selected pane.\n\n"
    },
    {
      "title": "Theming",
      "level": 2,
      "content": "Budgie uses GTK for its UI elements, and is thus supported by many GTK themes. Budgie also ships a built-in theme that is only applied to its own elements, such as panels and Raven, which can be toggled in Budgie Desktop Settings. Icon themes and cursor themes can be set in Budgie Desktop Settings as well.\n\n"
    },
    {
      "title": "Customizing themes",
      "level": 3,
      "content": "Customizing GTK themes requires to build them from source. Each theme will have documentation on how to do so. For example, the Materia theme code can be found in their repository.\n\n"
    },
    {
      "title": "Forking Materia",
      "level": 4,
      "content": "Materia comes with hacking and installation instructions. If the theme is already installed from the materia-gtk-theme package, it is recommended to rename the forked version just in case an edit breaks the UI:\n\n```\nmeson_options.txt\n```\n\n```\noption(\n  'theme_name',\n  type: 'string',\n  value: 'Materia-fork',\n  description: 'Base theme name',\n)\n```\n\nThe theme is written with Sass. For example, to make all windows have a square border (instead of rounded), change the $corner-radius variable:\n\n```\nsrc/_theme.scss\n```\n\n```\n$corner-radius: 0px;\n```\n\nThe Sass compiler and the Meson builder are required. Both can be installed from dart-sass and meson packages. The theme can be built and installed with:\n\n```\nmeson _build\nmeson install -C _build\n```\n\nOnce installed, the theme can be activated from Budge Desktop Settings.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Configuration of Budgie Desktop is done through the built-in Budgie Desktop Settings application, and changes to system settings are made through budgie-control-center.\n\n"
    },
    {
      "title": "Changing button layout",
      "level": 3,
      "content": "Window button layout can be changed using dconf, dconf-editor or gsettings.\n\nFor example:\n\n```\n$ gsettings set com.solus-project.budgie-wm button-layout 'close,minimize,maximize:appmenu'\n$ gsettings set com.solus-project.budgie-helper.workarounds fix-button-layout 'close,minimize,maximize:menu'\n```\n\n"
    },
    {
      "title": "Use a different window manager",
      "level": 3,
      "content": "Budgie does not support using a different window manager.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:Budgie (desktop environment)\n- Official Budgie Desktop website\n- Official git repositories for Budgie development\n\n"
    }
  ]
}