{
  "title": "Burning Xbox 360 games",
  "url": "https://wiki.archlinux.org/title/Burning_Xbox_360_games",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nXbox 360 games come in two image formats: .iso and .000. They are burned on dual layer DVD+R discs. This requires a dual-layer DVD burner. No specific brand or burner is needed for XGD1- or XGD2-formatted games, but XGD3-formatted games require a LiteOn drive with either flashed iHAS firmware or the BurnerMAX payload to burn successfully and reliably. In order to maximize the success of your burn, you should verify your disc images with abgx360 and burn at the slowest speed your burner and media allow. The manufacturer of your discs is also important; Verbatim DVD+R DL discs are the most reliable.\n\n"
    },
    {
      "title": "Burning ISOs",
      "level": 2,
      "content": "Burning an ISO is best done through the command line with growisofs. This is found in the dvd+rw-tools package.\n\nThere are other applications you can use to burn the image (k3b etc) but you may miss some configuration options and end up with a dud burn. Use the following commands to burn the image to disc.\n\nXGD1 (Xbox1):\n\n```\n# growisofs -use-the-force-luke=dao -use-the-force-luke=break:1913776 -dvd-compat -speed=2 -Z /dev/sr0=rom.iso\n```\n\nXGD2:\n\n```\n# growisofs -use-the-force-luke=dao -use-the-force-luke=break:1913760 -dvd-compat -speed=2 -Z /dev/sr0=rom.iso\n```\n\nXGD3 (iXtreme Burner Max Firmware):\n\n```\n# cdrecord -v speed=4 -force -sao -overburn driveropts=burnfree rom.iso\n```\n\nThis should determine the necessary layerbreak on its own.\n\nXGD3 (truncated):\n\n```\n$ truncate --size=8547991552 rom.iso\n# growisofs -use-the-force-luke=dao -use-the-force-luke=break:2086912 -dvd-compat -speed=2 -Z /dev/sr0=rom.iso\n```\n\nReplace /dev/sr0 with the path to your dual layer drive. For most systems it will be /dev/sr0.\n\nIf everything has been set up correctly you should see a messages like this:\n\n```\nExecuting 'builtin_dd if=rom.iso of=/dev/sr0 obs=32k seek=0'\n/dev/sr0: splitting layers at 1913760 blocks\n/dev/sr0: \"Current Write Speed\" is 2.5x1352KBps.\n3538944/7835492352 ( 0.0%) @0.8x, remaining 45:39 RBU  89.7% UBU   7.1%\n```\n\nThe burn should take around approximately 40 minutes at 2.4x write speed, depending on the size of the iso.\n\n"
    },
    {
      "title": "xbox360_burn",
      "level": 2,
      "content": "It is obviously possible to create an executable file containing the command to burn DVDs. Someone has created a bash script to allow for a more user-friendly interface. It has since been rewritten into python.\n\nTo burn, you then only have to use this command:\n\n```\n# xbox360_burn -ib /dev/sr0 rom.iso\n```\n\nReplace /dev/sr0 with the path to your dual layer drive. For most systems it will be /dev/sr0.\n\n"
    }
  ]
}