{
  "title": "Chuwi MiniBook X (2023)",
  "url": "https://wiki.archlinux.org/title/Chuwi_MiniBook_X_(2023)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU | 8086:4E61 | Yes\nWebcam | 1B0A:2BC9 | Yes\nBluetooth | 8087:0026 | Yes\nAudio | 8086:4DC8 | Yes\nWireless | 8086:4DC8 | Yes\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "The default BIOS options are correct. In order to bring the UEFI Boot screen selection, tap the Esc key, and using the right arrow key, go to the last page, then select the desired option in the Boot Override section. The device does not contain any USB Type-A port, use a USB-C dock in order to plug in the Flash Memory via USB. The device supports booting from SD cards via an USB-C Dock.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nfwupd supports parts on this device, though, as of writing, no updates were provided.\n\n"
    },
    {
      "title": "Screen rotation",
      "level": 2,
      "content": "Upon exiting the BIOS the device screen is rotated counter-clockwise. In order to correct that, use the fbcon=rotate:1 kernel parameter.\n\nOne may change the configuration e.g. in GNOME settings, see GDM#Setup default monitor settings to get GDM to use those settings.\n\n"
    },
    {
      "title": "Garbled screen on resume",
      "level": 2,
      "content": "Sometimes, when using particular kernels, built-in screen looks like it was physically damaged when coming out of shallow sleep. Workaround: Tap the sleep button, then wake the computer using the built-in keyboard. It should start working again.\n\n"
    },
    {
      "title": "USB-C Charging",
      "level": 3,
      "content": "The device has two USB Type-C ports on the right hand side. One of the ports is labelled as power input. The second one is not. The first port supports original packaged charger. The second one supports charging via compatible USB-C Dock.\n\n"
    },
    {
      "title": "USB 3.0/DisplayLink evdi drivers",
      "level": 3,
      "content": "In order to support some external USB-C Docks with external displays plugged-in, one may need DisplayLink driver.\n\n"
    }
  ]
}