{
  "title": "Cinnamon",
  "url": "https://wiki.archlinux.org/title/Cinnamon",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- Nemo\n\nCinnamon is a desktop environment which combines a traditional desktop layout with modern graphical effects. The underlying technology was forked from the GNOME desktop. As of version 2.0, Cinnamon is a complete desktop environment and not merely a frontend for GNOME like GNOME Shell and Unity.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Cinnamon can be installed with the package cinnamon.\n\n"
    },
    {
      "title": "Cinnamon applications",
      "level": 3,
      "content": "Cinnamon introduces X-Apps which are based on GNOME Core Applications but are changed to work across Cinnamon, MATE and XFCE; they have the traditional user interface (UI).\n\nTable content:\nApplication | GNOME | Cinnamon\nText editor | Gedit/Pluma | xed\nImage viewer | Eye of GNOME | xviewerAUR\nDocument viewer | Evince/Atril | xreader\nMedia player | Totem | xplayerAUR\nImage organizer | gThumb | pixAUR\n\n"
    },
    {
      "title": "Fallback mode",
      "level": 3,
      "content": "On the event when Cinnamon crashes, its Fallback mode activates. To control opened windows in this mode, you need to install metacity package and gnome-shell to have a taskbar.\n\n"
    },
    {
      "title": "Graphical log-in",
      "level": 3,
      "content": "Choose Cinnamon or Cinnamon (Software Rendering) from the menu in a display manager of choice. Cinnamon is the 3D accelerated version, which should normally be used. If you experience problems with your video driver (e.g. artifacts or crashing), try the Cinnamon (Software Rendering) session, which disables 3D acceleration.\n\n"
    },
    {
      "title": "Starting Cinnamon manually",
      "level": 3,
      "content": "If you prefer to start Cinnamon manually from the console, add the following line to Xinitrc:\n\n```\n~/.xinitrc\n```\n\n```\nexec cinnamon-session\n```\n\nIf the Cinnamon (Software Rendering) session is required, use cinnamon-session-cinnamon2d instead of cinnamon-session.\n\n"
    },
    {
      "title": "Restarting Cinnamon",
      "level": 3,
      "content": "The following needs to be executed as the user the Cinnamon instance is running under:\n\n```\n$ cinnamon-dbus-command RestartCinnamon 1\n```\n\nTo restart Cinnamon from outside a dbus session, you can use something like this:\n\n```\n$ DBUS_SESSION_BUS_ADDRESS=\"unix:path=/run/user/${TARGET_USER_UID}/bus\"\n$ sudo -u \"#${TARGET_USER_UID}\" -H dbus-send --bus=$DBUS_SESSION_BUS_ADDRESS --type=method_call --dest=org.Cinnamon /org/Cinnamon org.Cinnamon.RestartCinnamon boolean:true 2> /dev/null\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Cinnamon is quite easy to configure — most common settings can be configured graphically. Its usability can be expanded with applets and extensions, and also it supports theming.\n\n"
    },
    {
      "title": "Cinnamon settings",
      "level": 3,
      "content": "cinnamon-settings launches a settings module specified on the command line. Without (correct) arguments, it launches System Settings. For example, to start the panel settings:\n\n```\n$ cinnamon-settings panel\n```\n\nTo list all available modules:\n\n```\n$ pacman -Ql cinnamon | grep -Po '(?<=cs_).+(?=\\.py)'\n```\n\n"
    },
    {
      "title": "Applets and extensions",
      "level": 3,
      "content": "While an applet is an addition to the Cinnamon panel, an extension can fully change the Cinnamon experience. They can be installed from the AUR, (package search), or from inside Cinnamon (Get more online):\n\n```\n$ cinnamon-settings applets\n$ cinnamon-settings extensions\n```\n\nAlternatively, install manually from Cinnamon spices.\n\n"
    },
    {
      "title": "Pressing power buttons suspend the system",
      "level": 3,
      "content": "This is the default behaviour. To change the setting, open the cinnamon-settings panel and click on the \"Power Management\" option. Change the \"When the power button is pressed\" option to your desired behaviour.\n\n"
    },
    {
      "title": "Manage languages used in Cinnamon",
      "level": 3,
      "content": "- To add/remove languages: see Locale.\n- To change between enabled languages: install the mintlocaleAUR package.\n- For Cinnamon to correctly display another language: install the cinnamon-translations package.\n- To change the keyboard layout: navigate to System Settings > Hardware > Keyboard > Layouts.\n\n"
    },
    {
      "title": "Use a different window manager",
      "level": 3,
      "content": "Cinnamon does not support using a different window manager.\n\n"
    },
    {
      "title": "Creating custom applets",
      "level": 3,
      "content": "The official tutorial on creating a Cinnamon applet can be found here.\n\n"
    },
    {
      "title": "Default desktop background wallpaper path",
      "level": 3,
      "content": "When you add a wallpaper from a custom path in Cinnamon Settings, Cinnamon copies it to ~/.cinnamon/backgrounds. Thus, with every change of your wallpaper, you would have to add your updated wallpaper again from the settings menu or copy / symlink it manually to ~/.cinnamon/backgrounds.\n\nAdditionally, the official mint wallpapers are available for every release. Checkout the AUR.\n\n"
    },
    {
      "title": "Show home, filesystem desktop icons",
      "level": 3,
      "content": "By default, Cinnamon starts with desktop icons enabled but with no desktop icons on screen. To show desktop icons for the home folder, the filesystem, the trash, mounted volumes and network servers, open Cinnamon settings and click on desktop. Enable the checkboxes of the icons you want to see on screen.\n\n"
    },
    {
      "title": "Menu editor",
      "level": 3,
      "content": "The Menu applet supports launching custom commands. Right click on the applet, click on Configure... and then Open the menu editor. Select a sub-menu (or create a new one) and select New Item. Set Name, Command and Comment. Check the launch in terminal checkbox if needed. Leave unchecked for graphical applications. Click OK and close the menu editor afterwards. The launcher is added to the menu.\n\n"
    },
    {
      "title": "Workspaces",
      "level": 3,
      "content": "A workspace pager can be added to the panel. Right click the panel and choose the option Add applets to the panel. Add the Workspace switch applet to the panel. To change its position, right click on the panel and change the Panel edit mode on/off switch to on. Click and drag the switcher to the desired position and turn the panel edit mode off when finished.\n\nBy default, there are 2 workspaces. To add more, hit Control+Alt+Up to show all workspaces. Then click on the plus sign button on the right of the screen to add more workspaces.\n\nAlternatively, you can choose the number by command-line:\n\n```\n$ gsettings set org.cinnamon.desktop.wm.preferences num-workspaces 4\n```\n\nReplacing 4 with the number of workspaces you want.\n\n"
    },
    {
      "title": "Hide desktop icons",
      "level": 3,
      "content": "The desktop icons rendering feature is enabled in Nemo by default. To disable this feature, change the setting with the following command:\n\n```\n$ gsettings set org.nemo.desktop show-desktop-icons false\n```\n\n"
    },
    {
      "title": "Themes, icons and backgrounds",
      "level": 3,
      "content": "Linux Mint styled themes, icons and backgrounds can be installed with the mint-themesAUR, mint-l-themeAUR, mint-x-iconsAUR, mint-y-iconsAUR, mint-artworkAUR and mint-backgroundsAUR packages. Whereby the latter is a collection of all backgrounds included in all Linux Mint Versions. Backgrounds of individual Linux Mint versions are also available over the AUR.\n\nThe themes and icons can be edited in Settings > Themes. The backgrounds in Settings > Backgrounds.\n\nSetting the desktop theme via shell can be done like this:\n\n```\n$ gsettings set org.cinnamon.theme name \"Theme-Name\"\n```\n\n"
    },
    {
      "title": "Sound events",
      "level": 3,
      "content": "Cinnamon does not come with sounds used for events like the startup of the desktop that are also used in Linux Mint by default. These sound effects can be installed with the mint-artworkAUR package. The sound events can be edited in Settings > Sound > Sound Effects.\n\n"
    },
    {
      "title": "Resize windows by mouse",
      "level": 3,
      "content": "To resize windows with Alt+Right click, use gsettings:\n\n```\ngsettings set org.cinnamon.desktop.wm.preferences resize-with-right-button true\n```\n\n"
    },
    {
      "title": "Portable keybindings",
      "level": 3,
      "content": "To export your keyboard shortcut keys:\n\n```\n$ dconf dump /org/cinnamon/desktop/keybindings/ > keybindings-backup.dconf\n```\n\nTo later import it on another device:\n\n```\n$ dconf load /org/cinnamon/desktop/keybindings/ < keybindings-backup.dconf\n```\n\n"
    },
    {
      "title": "Screenshot",
      "level": 3,
      "content": "As explained in Taking a screenshot, installing gnome-screenshot will add this functionality. The default shortcut key is PrintScreen key. This binding can be changed in the applet Menu > Preferences > Keyboard under Shortcuts > System > Screenshots and Recording. The default save directory is $HOME/Pictures, but can be customized with eg.\n\n```\n$ gsettings set org.gnome.gnome-screenshot auto-save-directory file:///home/USER/some_path\n```\n\n"
    },
    {
      "title": "Prevent Cinnamon from overriding xrandr/xinput configuration",
      "level": 3,
      "content": "The cinnamon-settings-daemon provides a number of plugins which can manage the display, keyboard and mouse. These plugins will override user set configuration (such as xrandr commands in the xinitrc file). To stop user set configuration from being overridden, it is necessary to prevent the settings daemon plugins from being started.\n\nThis can be done by copying the .desktop entry for the relevant settings daemon plugin (these will be located in /etc/xdg/autostart/) to $HOME/.config/autostart. Then append the line Hidden=true to each copied entry.\n\nTo preserve display, keyboard and mouse settings, consider disabling the following:\n\n```\ncinnamon-settings-daemon-a11y-keyboard.desktop\ncinnamon-settings-daemon-a11y-settings.desktop\ncinnamon-settings-daemon-keyboard.desktop\ncinnamon-settings-daemon-mouse.desktop\ncinnamon-settings-daemon-xrandr.desktop\n```\n\n"
    },
    {
      "title": "Debugging",
      "level": 3,
      "content": "You can use the cinnamon-looking-glass tool (Melange - Cinnamon Debugger) to inspect various things about the Cinnamon environment:\n\n- a list of currently-open windows\n- a list of currently-loaded extensions (applets, desklets, etc.)\n- logs\n\nThe \"logs\" feature is especially useful if you are encountering crashes (often happening due to extensions no being compatible or buggy).\n\n"
    },
    {
      "title": "cinnamon-settings: No module named Image",
      "level": 3,
      "content": "If cinnamon-settings does not start with the message that it cannot find a certain module, e.g. the Image module, it is likely that it uses outdated compiled files which refer to no longer existing file locations. In this case, remove all *.pyc files in /usr/lib/cinnamon-settings and its sub-folders. See the upstream bug report.\n\n"
    },
    {
      "title": "Starting Cinnamon from tty after crash",
      "level": 3,
      "content": "If Cinnamon is completely unresponsive, it can be restarted from the TTY (Alt+F2) with:\n\n```\n$ cinnamon --replace -d :0 &\n```\n\n"
    },
    {
      "title": "Video tearing",
      "level": 3,
      "content": "Because muffin is based upon mutter, video tearing fixes for GNOME should also work in Cinnamon. See GNOME/Troubleshooting#Tear-free video with Intel HD Graphics for more information.\n\n"
    },
    {
      "title": "Disable the NetworkManager applet",
      "level": 3,
      "content": "Even if you do not use NetworkManager and remove the Network Manager applet from the default panel, Cinnamon will still load nm-applet and display it in the system tray. You cannot uninstall the package because it is required by cinnamon and cinnamon-control-center, but you can still easily disable it. To do so, copy the autostart file from /etc/xdg/autostart/nm-applet.desktop to ~/.config/autostart/nm-applet.desktop. Open it with your favorite text editor and add at the end X-GNOME-Autostart-enabled=false.\n\nAlternatively, you can disable it by creating the following symlink:\n\n```\n$ ln -s /bin/true /usr/local/bin/nm-applet\n```\n\nThe ability to blacklist particular icons from the system tray (such as the nm-applet icon) has been requested upstream.\n\n"
    },
    {
      "title": "Cinnamon overrides settings in xorg.conf",
      "level": 3,
      "content": "Cinnamon overrides custom settings in xorg.conf like display orientation and layout.\n\nOpen System Settings > Startup Applications and set Cinnamon Settings Daemon - xrandr to OFF.\n\n"
    }
  ]
}