{
  "title": "Come contribuire",
  "url": "https://wiki.archlinux.org/title/Come_contribuire",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articoli correlati\n\n- FAQ (Italiano)\n- ArchWiki:Contributing (Italiano)\n\nNella biologia evoluzionistica, il mutualismo descrive interazioni che vedono un individuo pagare un basso costo per generare un più importante beneficio ad altri. Se questo costoso contributo viene reciprocato, tutti gli individui coinvolti possono beneficiarne immensamente. Questo principio si applica anche ai membri volenterosi e motivati della comunità di Arch che vogliono essere coinvolti e contribuire alla loro distribuzione GNU/Linux preferita. La loro partecipazione non beneficia soltanto il membro della comunità e i suoi compagni Arceri, ma tutti gli utilizzatori di software libero ed open source.\n\nQuest'articolo descrive vari modi in cui gli utenti di Arch sia nuovi che con esperienza possono contribuire alla comunità. Notate come questa non sia una lista esaustiva. Prima di contribuire, familiarizzatevi con il Codice di condotta, per favore.\n\n"
    },
    {
      "title": "Pubblicate nei Fora",
      "level": 3,
      "content": "Una delle maniere più facili per venire coinvolti è partecipare ai Fora di Arch Linux, che consente di fare la conoscenza di questa comunità e di dare una mano ai nuovi utenti.\n\n"
    },
    {
      "title": "Migliorate questa Wiki",
      "level": 3,
      "content": "ArchWiki è parte della documentazione Arch Linux mantenuta in collaborazione. Tutti gli utenti sono incoraggiati a dare il proprio contributo.\n\n"
    },
    {
      "title": "Unitevi alla chatroom",
      "level": 3,
      "content": "Potete aiutare gli altri utenti nella risoluzione di problemi sul canale IRC. È però di vitale importanza che voi leggiate le regole del canale, prima di partecipare. Sono disponibili ulteriori canali per argomenti specifici.\n\n"
    },
    {
      "title": "Unitevi alle liste di posta",
      "level": 3,
      "content": "Prendete parte alla discussione su una o più delle liste di posta pubbliche. Assicuratevi di rimanere in tema con quello fornito nella descrizione della lista.\n\n"
    },
    {
      "title": "Arte",
      "level": 3,
      "content": "Sentitevi liberi di condividere con la comunità sfondi, schermate di caricamento, palettes di colori, widgets, temi, etc. sulla sottosezione di arte del forum.\n\nControllate anche Arte di Arch Linux e Arte.\n\n"
    },
    {
      "title": "Generate un report dei programmi installati",
      "level": 3,
      "content": "pkgstats mette a disposizione un timer di systemd; esso invia, agli sviluppatori di Arch Linux, un elenco dei programmi installati sul vostro sistema, insieme all'architettura ed agli specchi di scaricamento da voi utilizzati, in modo da aiutarli a prioritizzare i loro sforzi e migliorare nel mentre la distribuzione GNU/Linux ancora di più. L'informazione è recapitata in modo anonimo e non può essere utilizzata per identificarvi. I dati raccolti sono visibili sulla Pagina statistiche. Sono disponibili più informazioni in questa discussione del forum.\n\n"
    },
    {
      "title": "Risolvete e segnalate i problemi",
      "level": 3,
      "content": "Segnalare e risolvere i problemi sul tracciatore è un altro dei modi possibili per aiutare la comunità.\n\nCiononostante, un utilizzo inefficace del traciatore di problemi può essere controproducente. Leggete le Linee guida per la segnalazione dei problemi, per favore.\n\n"
    },
    {
      "title": "Informateci sulle problematiche di sicurezza",
      "level": 3,
      "content": "Spesso vengono trovate nuove vulnerabilità. Aiutate gli Addetti alla Sicurezza di Arch a tenerne traccia.\n\n"
    },
    {
      "title": "Aiutate a provare i programmi",
      "level": 3,
      "content": "I programmi sulle repositories di prova necessitano di essere, appunto, provati e firmati prima di essere promossi a quelle principali. Aiutate gli Addetti alla Prova di Arch a controllare i nuovi programmi.\n\n"
    },
    {
      "title": "Proponete funzionalità",
      "level": 3,
      "content": "Proponete delle funzionalità per i contenuti di Arch sul tracciatore di problemi. Prima di fare ciò, leggete Linee guida per la segnalazione di problemi#Problema_o_funzionalità? ed assicuratevi che sia una proposta di funzionalità valida.\n\nProponete delle funzionalità per i contenuti dell'AUR sulle pagine del contenuto AUR corrispondenti.\n\n"
    },
    {
      "title": "Create e adottate programmi nell'AUR",
      "level": 3,
      "content": "La Repository degli Utenti di Arch contiene scripts dei programmi assemblati dalla comunità, che consentono agli utenti di installare facilmente software non incluso nelle repositories ufficiali. I contenuti popolari divengono parte della repository extra.\n\naurphanAUR[broken link: package not found] può esservi utile per identificare i contenuti orfani da voi utilizzati, permettendovi di adottarli.\n\n"
    },
    {
      "title": "Diventare un Utente Fidato",
      "level": 3,
      "content": "Se desiderate aiutare nel mantenimento dell'AUR e dei programmi nella repository extra, potete sottoporvi al ruolo di Utente Fidato. Vedasi Package Maintainers#How do I become a Package Maintainer? per ulteriori dettagli.\n\n"
    },
    {
      "title": "Eventi",
      "level": 2,
      "content": "Esistono eventi aperti alla comunità che regolarmente facilitano la risoluzione di problemi, la pulizia ed altre attività.\n\n- Giorno dei Problemi\n- Giorno della Pulizia dell'AUR\n\n"
    },
    {
      "title": "Progetti di software",
      "level": 2,
      "content": "La distribuzione Arch Linux comprende molti componenti, ad esempio il manager di programmi pacman, il sito archlinux.org (archweb), o il sistema di supporto per la Repository degli Utenti di Arch (aurweb). Si può contribuire singolarmente a ciascuno di questi progetti.\n\nVedasi WikiSviluppatori:Progetti per una panoramica degli addetti, dei canali di comunicazione e dei linguaggi di programmazione utilizzati. Gli stessi progetti sono ospitati mediante git su gitlab.archlinux.org.\n\n"
    },
    {
      "title": "Donate denaro",
      "level": 2,
      "content": "È possibile informarsi su come sostenere i costi dei server sulla pagina ufficiale di Arch Linux per le donazioni.\n\n"
    },
    {
      "title": "Progetti ufficiosi",
      "level": 2,
      "content": "La comunità di Arch mantiene molti progetti. Sentitevi liberi di includere il vostro!\n\n"
    },
    {
      "title": "Gruppi",
      "level": 3,
      "content": "Gruppi specificatamente per Arch coi quali potete interagire.\n\n"
    },
    {
      "title": "Software",
      "level": 3,
      "content": "Software sviluppato dalla comunità focalizzato su Arch Linux.\n\n"
    },
    {
      "title": "Diventare uno Sviluppatore Arch",
      "level": 2,
      "content": "La motivazione principale del proprio lavoro riguardo Arch dovrebbe essere aiutare l'intera comunità, e niente affatto il semplice cercare di diventare uno sviluppatore Arch.\n\nIn genere, i nuovi sviluppatori sono scelti da quelli già esistenti man mano che il carico di lavoro aumenta. A volte pubblicano una posizione a cui ci si può sottoporre, per poterla ottenere, ma, più spesso, invitano semplicemente qualcuno che sanno svolgerebbe bene quel compito e che si integrerebbe bene con il resto della squadra. Possedere un portfolio di contributi ad Arch è il modo migliore per garantirsi un posto nella squadra.\n\nQuesta è una lista di cose che potreste fare per rendersi \"popolari\" verso gli sviluppatori di Arch:\n\n- Costruirsi una reputazione di disponibilità all'aiuto, offrendosi disponibili quando possibile.\n- Rispondere alle domande su forum, IRC e liste di posta.\n- Unirsi agli Utenti Fidati per acquisire esperienza nella creazione di contenuti e mostrare le proprie capacità.\n- Inserire dei contenuti nell'AUR.\n- Prendere parte ad uno dei progetti derivati che in futuro potrebbero essere incorporati ufficialmente in Arch, oppure cominciarne uno proprio.\n- Sviluppare per pacman, makepkg o altri progetti (su GitLab) e inviare delle patches al tracciatore di problemi.\n- Navigare il tracciatore di problemi e correggere quelli esistenti.\n- Cercare e segnalare nuovi problemi.\n- Correggere gli errori nella Wiki, aggiungere nuove pagine, riordinare quelle esistenti, ed assicurarsi che le procedure siano aggiornate.\n- Inviare traduzioni.\n\n"
    }
  ]
}