{
  "title": "ContactList",
  "url": "https://wiki.archlinux.org/title/ContactList",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ArchWiki:Requests\n- Help:Procedures\n- Help:Style\n\nThe Maintenance Team is ArchWiki official group of users whose goal includes supervising and fixing the edits that are made every day to the articles in the wiki. They also assist users, improve existing pages and aim to improve the wiki as a whole.\n\n"
    },
    {
      "title": "Who, when and how to contact",
      "level": 2,
      "content": "All members of the Maintenance Team provide ways to contact them personally if you desire so. Nevertheless, prefer using the following methods instead.\n\n- For page-specific comments, use its talk page which can be accessed from the discussion tab above each page.\n- For generic requests regarding wiki content, use ArchWiki talk:Requests.\n- To discuss style conventions used on the wiki pages, use Help talk:Style.\n- To discuss wiki content organization, or if you require assistance from the Maintenance Team, use ArchWiki talk:Maintenance Team.\n- For privacy requests (e.g. removal of inadvertently published personal information, wiki account deletion, etc.), either send an email from the wiki interface using Special:EmailUser/Privacy-requests (to allow making reasonable assumptions about the link between the username and email address) or email privacy@archlinux.org from the email address associated with your wiki account.\n- For other matters (not related to privacy) that cannot be discussed publicly, contact the ArchWiki Administrators by sending an email from wiki interface using Special:EmailUser/WikiSysop (to allow making reasonable assumptions about the link between the username and email address).\n- Casual, non-binding discussions with wiki contributors (which may include members of the Maintenance Team) can also be held in the #archlinux-wiki IRC channel.\n\n"
    },
    {
      "title": "Members",
      "level": 2,
      "content": "Maintainers belong to a particular group of wiki users with special rights. Administrators and bureaucrats are maintainers with higher access levels, see ArchWiki:Access levels and roles.\n\n"
    },
    {
      "title": "Active maintainers",
      "level": 3,
      "content": "Active members of the Maintenance Team are listed in the following table. Maintainers are periodically and automatically sorted in descending order by their number of edits in the previous 30 days.\n\nTable content:\nUser | Name | Extra groups | Contact\nLahwaacz (talk) | Jakub Klinkovský | administrator, bureaucrat | ⟨username⟩ ⟨cat⟩ archlinux ⟨dog⟩ org\nErus_Iluvatar (talk) | Vladimir LAVALLADE | administrator | See User:Erus Iluvatar#Contact\nnl6720 (talk) |  | administrator, bureaucrat | Send Email\nIndigo (talk) |  | administrator | ialbrecht@gmx.net\nandreymal (talk) | Andrey Kashlak |  | Send Email\nAndrei Korshikov (talk) | Andrei Korshikov |  | Send Email\nNetSysFire (talk) |  |  | See user page\nNeitsab (talk) |  |  | Send Email\n\n"
    },
    {
      "title": "Inactive maintainers",
      "level": 3,
      "content": "The following maintainers are currently inactive (less than 10 edits in the last 30 days):\n\nTable content:\nUser | Name | Extra groups | Contact\nGraysky (talk) |  |  | graysky@archlinux.us\nKewl (talk) |  |  | Send Email\nAlad (talk) |  | administrator, bureaucrat | Send Message\nFengchao (talk) |  | administrator | Send Email\nLonaowna (talk) |  | administrator | Send Email\nCodingKoopa (talk) |  |  | See User:CodingKoopa#Contact\nEdh (talk) | Gordian Edenhofer |  | gordian.edenhofer@gmail.com\nSvito (talk) |  |  | Send Email\nSilverhammermba (talk) |  |  | Send Email\nKynikos (talk) | Dario Giovannetti | administrator, bureaucrat | dario {nospam} giova@gmai {nospam} l.com\nChazza (talk) |  |  | Send Email\nMisfit138 (talk) |  | administrator fellow | pitsker@gmail.com\nFlyingpig (talk) |  |  | Send Email\nKycok (talk) |  |  | Send Email\njasonwryan (talk) |  | administrator fellow | jasonwryan@gmail.com\nFrancoism (talk) | François Menning |  | Send Email\nBlackteahamburger (talk) |  |  | blackteahamburger@outlook.com\nPypi (talk) |  |  | Send Email\njstjohn (talk) |  |  | Send Email\nRdeckard (talk) |  |  | Send Email\nLarivact (talk) |  |  | Send Email\nDet (talk) |  |  | Send Email\nSkydiver (talk) |  |  | Send Email\nFlu (talk) |  |  | Send Email\nEmiralle (talk) |  |  | Send Email\nFilam (talk) |  |  | Send Email\nAlexanderR (talk) |  |  | alexanherrder.r@gmx.com\npointone (talk) |  | administrator fellow | desmondgc@gmail.com\n\n"
    },
    {
      "title": "How to join",
      "level": 2,
      "content": "Official maintainers are usually chosen by the administrators among the most active and collaborative users of the wiki, and personally invited to participate in the team. You can also explicitly present yourself as a candidate by contacting one of the administrators.\n\nCommon requisites for becoming a maintainer are:\n\n- Familiarity with community and wiki guidelines; willingness to collaborate and discuss with the other team members.\n- Some free time and the commitment to contribute regularly enough.\n- Patience, accuracy and tidiness.\n- Experience in wiki editing and good knowledge of wiki syntax.\n- Good knowledge of the structure of the ArchWiki and its style rules.\n- Sufficient knowledge of Arch Linux and the subjects treated in the articles, or willingness to do some research or discuss with the edits' authors when fixing content-related issues.\n\nIf you are interested in joining the team, you can start making yourself visible to the community by helping with the common tasks, in particular help out with patrolling among the other tasks listed in Help:Procedures, and contributing to the discussions that take place in the various talk pages.\n\nNew members get announced in the ArchWiki:News.\n\nOnce elected, members should add their username to the table above and also add a special tag in their user page: [[ArchWiki:Maintainers|ArchWiki Maintainer]]. Administrators should instead use: [[ArchWiki:Administrators|ArchWiki Administrator]].\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Category:Maintenance - maintenance categories\n- Special:SpecialPages - maintenance pages\n- Wikipedia:Recent changes patrol\n\n"
    }
  ]
}