{
  "title": "COSMIC",
  "url": "https://wiki.archlinux.org/title/COSMIC",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- GDM\n\nCOSMIC is a desktop environment developed in the Rust programming language, using the iced cross platform GUI library for Rust, and Smithay as building blocks for its compositor, cosmic-comp. Cosmic-comp is comparable to smithay's own anvil compositor demonstration, just like the Wayland project uses Weston as demo compositor. Its first release is called Epoch.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "COSMIC can be installed via cosmic-session or the cosmic group. The development version can be obtained with cosmic-session-gitAUR which depend on all of the component packages.\n\nWhen building from source, beware the cosmic-applets-gitAUR dependency needs more than 8GB of RAM. Restricting linking to one job is an option to get it built. If you build it repeatedly, setting the CARGO_TARGET_DIR environment variable helps downloading less often:\n\n```\nMOLD_JOBS=1 CARGO_TARGET_DIR=/tmp/mytarget\n```\n\n"
    },
    {
      "title": "Individual components coming as dependencies of cosmic-session",
      "level": 3,
      "content": "COSMIC comprises a compositor, library, and applets, which may be installed as parts. cosmic-comp, cosmic-applets, cosmic-app-library, cosmic-bg, cosmic-icon-theme, cosmic-launcher, cosmic-notifications, on screen display to overlay messages with cosmic-osd, a dock and panel with cosmic-panel, cosmic-settings, and others.\n\n"
    },
    {
      "title": "Independent components",
      "level": 3,
      "content": "An editor, cosmic-text-editor, a file manager cosmic-files, a terminal, cosmic-terminal, a multimedia player cosmic-player, and wallpapers, cosmic-wallpapers are provided.\n\n"
    },
    {
      "title": "Starting",
      "level": 2,
      "content": "The easiest way to start COSMIC is through a display manager, where it will show up as an additional option after installation, besides e.g. GNOME, KDE Plasma, etc.\n\nTo start COSMIC directly from the console, run:\n\n```\n$ start-cosmic\n```\n\n"
    },
    {
      "title": "Using Cosmic Greeter",
      "level": 3,
      "content": "COSMIC ships cosmic-greeter, a display manager based on greetd. To use it, enable cosmic-greeter.service.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The panel can be used to configure besides using the settings applet, examples of applets are provided.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- System76 Blog\n- Pop!_OS Welcome Page\n\n"
    }
  ]
}