{
  "title": "Często zadawane pytania",
  "url": "https://wiki.archlinux.org/title/Cz%C4%99sto_zadawane_pytania",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Powiązane artykuły\n\n- Arch terminology\n- Arch User Repository#Frequently asked questions\n- General troubleshooting\n\n"
    },
    {
      "title": "Czym jest Arch Linux?",
      "level": 3,
      "content": "Przeczytaj artykuł o Arch Linux.\n\n"
    },
    {
      "title": "Kiedy nie powinienem używać Arch Linux?",
      "level": 3,
      "content": "Prawdopodobnie nie powinieneś używać Arch Linux jeśli:\n\n- nie masz umiejętności / czasu / chęci aby używać dystrybucji GNU/Linux opartej na zasadzie „zrób to sam” - jeśli przeraża Cię sama myśl o korzystaniu z wiersza poleceń (konsoli), Arch Linux nie jest na razie dla Ciebie.\n- potrzebujesz obsługi architektury innej niż x86_64.\n- nie chcesz używać dystrybucji, która zapewnia tylko darmowe oprogramowanie zgodnie z definicją GNU.\n- uważasz, że system operacyjny powinien się skonfigurować sam, być od razu gotowy do użycia i zawierać na nośniku instalacyjnym pełny domyślny zestaw oprogramowania i środowisko komputerowe.\n- nie chcesz rozpowszechniać dystrybucji GNU/Linux.\n- jesteś zadowolony ze swojego obecnego systemu operacyjnego.\n\n"
    },
    {
      "title": "Dlaczego miałbym chcieć używać Archa?",
      "level": 3,
      "content": "Ponieważ Arch jest najlepszy.\n\n"
    },
    {
      "title": "Jakie architektury obsługuje Arch?",
      "level": 3,
      "content": "Arch obsługuje tylko architekturę x86_64 (czasami nazywaną amd64). Wsparcie dla i686 zostało porzucone w listopadzie 2017 r [1].\n\nIstnieją nieoficjalne porty dla architektury i686 [2] i procesorów ARM [3], każdy z własną społecznością i kanałami komunikacji.\n\n"
    },
    {
      "title": "Czy Arch przestrzega standardów systemu plików Linux Foundation Hierarchy Standard (FHS)?",
      "level": 3,
      "content": "Arch Linux przestrzega hierarchii systemu plików dla systemów operacyjnych korzystających z menedżera usług systemd. Wpisz komendę man file-hierarchy, aby uzyskać wyjaśnienie dotyczące hierarchii katalogów w systemie wraz z ich oznaczeniami. Przykładowo /bin, /sbin i /usr/sbin są symbolicznymi linkami do /usr/bin a /lib i /lib64 to dowiązania symboliczne do /usr/lib.\n\n"
    },
    {
      "title": "Jestem zupełnie początkującym użytkownikiem systemu GNU/Linux. Czy powinienem używać Arch?",
      "level": 3,
      "content": "Jeśli jesteś początkujący i chcesz korzystać z Arch Linux, będziesz musiał poświęcić czas na naukę nowego systemu i zaakceptować fakt, że Arch Linux jest zaprojektowany jako dystrybucja z kategorii „zrób to sam”. To użytkownik składa cały system w całość i go konfiguruje.\n\nDomyślna i podstawowa instalacja Arch Linux nie zawiera żadnego środowiska pulpitu (okienek), a cała jej obsługa odbywa się (przynajmniej na początku) jedynie poprzez wiersz poleceń (konsolę). Arch nie zawiera żadnych domyślnych konfiguratorów. Oczywiście możesz później doinstalować całe spektrum oprogramowania (w tym środowiska pulpitu) znajdujące się w oficjalnych i nieoficjalnych repozytoriach Arch, w tym w AUR.\n\nZanim poprosisz o pomoc, przeszukaj sieć, nasze forum oraz doskonałą dokumentację dostarczoną przez Arch Wiki. Zasoby te zostały udostępnione użytkownikom nie bez powodu. Zgromadzenie tych użytecznych informacji zajęło ochotnikom wiele tysięcy godzin.\n\nZobacz także uwagi o zdobywaniu informacji na temat systemu oraz Instrukcję instalacji.\n\n"
    },
    {
      "title": "Czy Arch Linux został zaprojektowany do użytku domowego czy jako serwer?",
      "level": 3,
      "content": "Arch Linux nie ma jednego określonego zastosowania. Jest on raczej przeznaczony dla określonego typu użytkownika. Arch jest skierowany do kompetentnych użytkowników, którzy zgadzają się z filozofią \"zrób to sam\" i którzy lubią dostosowywać system do własnych potrzeb. Dlatego w rękach członka docelowej bazy użytkowników, Arch Linux może być używany praktycznie do każdego celu. Wielu korzysta z Arch zarówno na swoich komputerach stacjonarnych, jak i na serwerach. Oczywiście archlinux.org, aur.archlinux.org i prawie cała infrastruktura Arch [4] działa na Arch.\n\n"
    },
    {
      "title": "Naprawdę lubię Arch Linux, ale zespół programistów powinien wdrożyć funkcję X",
      "level": 3,
      "content": "Zaangażuj się, przekaż społeczności swój kod lub rozwiązanie. Jeśli Twoje propozycje zostaną dobrze ocenione przez społeczność i zespół programistów, być może zostaną one włączone do systemu. Społeczność Arch rozwija się dzięki udostępnianiu kodu i narzędzi.\n\n"
    },
    {
      "title": "Kiedy nowe wydanie zostanie udostępnione?",
      "level": 3,
      "content": "Wydania Arch Linux są po prostu środowiskiem instalacyjnym lub ratunkowym, które zawiera metapakiet base i kilka innych pakietów. Wydania ukazują się zazwyczaj w pierwszej połowie każdego miesiąca.\n\n"
    },
    {
      "title": "Czy Arch Linux jest stabilną dystrybucją? Czy często się psuje?",
      "level": 3,
      "content": "To użytkownik jest ostatecznie odpowiedzialny za stabilność własnego systemu. To on decyduje, kiedy uaktualnić system i w razie potrzeby wprowadza niezbędne zmiany w oprogramowaniu i konfiguracji. Jeśli użytkownik zwraca się do społeczności o pomoc, często udzielana jest ona odpowiednim czasie. Różnica między Arch Linux i innymi dystrybucjami pod tym względem polega na tym, że Arch jest dystrybucją typu „zrób to sam”. Oznacza to, że wszelkie pretensje co do awarii danego systemu są bezproduktywne i niepotrzebne, gdyż za wszystkie zmiany w konkretnym systemie nie są odpowiedzialni twórcy Arch Linux, a sam użytkownik.\n\nZobacz artykuł System maintenance, aby uzyskać wskazówki, jak uczynić system Arch Linux tak stabilnym, jak to możliwe.\n\n"
    },
    {
      "title": "Arch potrzebuje więcej rozgłosu (tj. reklamy)",
      "level": 3,
      "content": "Arch Linux już dostaje dużo rozgłosu. Celem Arch Linux nie jest być wszechobecną i potężną dystrybucją. Dla twórców istotny jest zrównoważony wzrost rozpoznawalności systemu wśród docelowej grupy użytkowników.\n\n"
    },
    {
      "title": "Arch potrzebuje więcej programistów",
      "level": 3,
      "content": "Pewnie tak. Zapraszamy do poświęcenia czasu na rozwój dystrybucji! Odwiedź fora, kanały IRC Archa lub listy mailingowe i zobacz, co należy zrobić. Zobacz także Zaangażowanie po szczegóły.\n\n"
    },
    {
      "title": "Arch potrzebuje instalatora. Może instalator graficzny (GUI)?",
      "level": 3,
      "content": "Arch miał kiedyś instalator z tekstowym interfejsem użytkownika o nazwie Arch Installation Framework (AIF). Po opuszczeniu go przez opiekuna pakietu, został on porzucony na rzecz Skryptów instalacyjnych Arch (Arch Install Scripts).\n\nPonieważ instalacja od zera co do zasady nie zdarza się często (przeczytaj resztę tego artykułu, aby dowiedzieć się więcej o tym, co oznacza „wydanie ciągłe”), instalator graficzny nie jest priorytetem dla programistów ani użytkowników. Instrukcja instalacji została w pełni zaktualizowana w celu wykorzystania wiersza poleceń (konsoli).\n\n"
    },
    {
      "title": "Zainstalowałem Arch i mam przed sobą wiersz poleceń! Co teraz?",
      "level": 3,
      "content": "Zobacz Zalecenia ogólne.\n\n"
    },
    {
      "title": "Jakiego środowiska pulpitu lub menedżera okien powinienem użyć?",
      "level": 3,
      "content": "Ponieważ wiele z nich jest dostępnych, użyj tego, który najbardziej Ci się podoba, w zależności od potrzeb. Zajrzyj do artykułów Desktop environment i Window manager.\n\n"
    },
    {
      "title": "Co czyni Arch wyjątkowym spośród innych „minimalnych” dystrybucji?",
      "level": 3,
      "content": "Zobacz porównanie z innymi dystrybucjami.\n\n"
    },
    {
      "title": "Konserwacja systemu",
      "level": 2,
      "content": "Zobacz także System maintenance.\n\n"
    },
    {
      "title": "Dlaczego mój internet jest wolniejszy niż na innych systemach operacyjnych/dystrybucjach?",
      "level": 3,
      "content": "Czy Twoja sieć jest poprawnie skonfigurowana? Przeczytaj artykuł Network configuration (Polski).\n\nZauważ też, że Arch Linux nie ma włączonej usługi kształtowania ruchu sieciowego. Dlatego możliwe jest, że jeśli program w jakiś sposób w pełni wykorzysta przepustowość Twojego połączenia internetowego - niezależnie od tego, czy jest to połączenie P2P lub klasyczne połączenia klient-serwer - inne lokalne połączenia nie uzyskają wymaganej przepustowości, co powoduje poważne opóźnienia i przekroczenia limitu czasu. Spowolnienie mogą powodować także zapory sieciowe, takie jak „Shorewall” lub „Vuurmuur”; istnieją również skrypty statyczne dla iproute2 (takie jak pochodne „Wondershaper”), które umożliwiają modyfikacje sieci.\n\n"
    },
    {
      "title": "Dlaczego Arch Linux używa całej mojej pamięci RAM?",
      "level": 3,
      "content": "Zasadniczo nieużywana pamięć RAM to zmarnowana pamięć RAM.\n\nWielu nowych użytkowników zauważa, że jądro Linuksa traktuje pamięć inaczej, niż to się działo do tej pory. Ponieważ dostęp do danych z pamięci RAM jest znacznie szybszy niż z dysku twardego, jądro buforuje ostatnio dostępne dane w pamięci. Buforowane dane są usuwane tylko wtedy, gdy w systemie zaczyna brakować dostępnej pamięci i konieczne jest załadowanie nowych danych.\n\nMożemy to sprawdzić za pomocą polecenia free:\n\n```\n$ free -h\n```\n\n```\ntotal        used        free      shared  buff/cache   available\nMem:          2.8Gi       1.1Gi       283Mi       224Mi       1.4Gi       1.2Gi\nSwap:         3.0Gi       881Mi       2.1Gi\n```\n\nWażne jest, aby zwrócić uwagę na różnicę między „wolną” i „dostępną” pamięcią. W powyższym przykładzie laptop z 2,8 GiB całkowitej pamięci RAM wydaje się wykorzystywać większość tej pamięci, z zaledwie 283 MiB jako wolną pamięcią. Jednak 1,4 GiB to „buff/cache”. Wciąż dostępne jest 1,2 GiB do uruchamiania nowych aplikacji, bez swapowania. Zobacz free(1) po szczegóły. Jaki jest tego rezultat? Wysoka wydajność!\n\nPrzeczytaj ten wspaniały artykuł, jeśli Twoja ciekawość została pobudzona. Istnieje również strona internetowa poświęcona wyjaśnieniu wszystkich tych kwestii: https://www.linuxatemyram.com/.\n\n"
    },
    {
      "title": "Gdzie się podziała cała moja wolna przestrzeń dyskowa?",
      "level": 3,
      "content": "Odpowiedź na to pytanie zależy od Twojego systemu. Istnieje kilka doskonałych narzędzi, które mogą pomóc znaleźć odpowiedź na to pytanie.\n\n"
    },
    {
      "title": "Zarządzanie pakietami",
      "level": 2,
      "content": "Zobacz strony pacman (Polski), pacman/Tips and tricks i Official repositories, aby uzyskać więcej odpowiedzi.\n\n"
    },
    {
      "title": "Znalazłem błąd w pakiecie X. Co powinienem zrobić?",
      "level": 3,
      "content": "Najpierw musisz dowiedzieć się, czy ten błąd jest z kategorii takich, które zespół Arch jest w stanie naprawić. Często tak nie jest (np. awarie Firefoksa mogą być winą zespołu Mozilli). Jeśli jest to problem z Arch Linux, możesz wykonać szereg kroków:\n\n1. Przeszukaj Google i fora w celu uzyskania informacji. Sprawdź, czy ktoś zauważył to samo co Ty.\n1. Opublikuj raport o błędzie ze szczegółowymi informacjami na stronie bug trackera Arch Linux na Gitlabie.\n1. Jeśli chcesz, możesz napisać post na forum szczegółowo opisujący znaleziony błąd i wskazać, że już go zgłosiłeś. Pomoże to zapobiec zgłaszaniu tego samego błędu przez kilka osób.\n\n"
    },
    {
      "title": "Pakiety Arch powinny używać unikalnej konwencji nazewnictwa. Rozszerzenia .pkg.tar.xz są za długie lub mylące",
      "level": 3,
      "content": "Zostało to przedyskutowane na liście dyskusyjnej Arch. Niektórzy proponowali rozszerzenie pliku .pac, ale nie ma planu zmiany rozszerzenia pakietu. Jak ujął to Tobias Kieslich, jeden z deweloperów Archa, \"Pakiet jest [skompresowanym] tarballem! Może być otwierany, badany i manipulowany przez dowolną aplikację obsługującą tar. Co więcej, typ mime jest automatycznie wykrywany poprawnie przez większość aplikacji\".\n\n"
    },
    {
      "title": "Pacman potrzebuje biblioteki, aby inne aplikacje mogły łatwo uzyskać dostęp do informacji o pakiecie",
      "level": 3,
      "content": "Pacman jest nakładką na libalpm(3) - bibliotekę \"Arch Linux Package Management\" - która umożliwia alternatywne interfejsy, takie jak interfejs GUI.\n\n"
    },
    {
      "title": "Pacman potrzebuje funkcji X!",
      "level": 3,
      "content": "Jeśli uważasz, że Twój pomysł coś wnosi, możesz przedyskutować go na pacman-dev. Sprawdź również https://gitlab.archlinux.org/pacman/pacman/-/issues pod kątem istniejących propozycji zmian i funkcji.\n\nJednak najlepszym sposobem na dodanie funkcji do pacman lub Arch Linux jest jej samodzielne wdrożenie. Łatka lub kod może nie zostać oficjalnie zaakceptowany, ale inni mogą go ocenić, przetestować lub udoskonalić.\n\n"
    },
    {
      "title": "Właśnie zainstalowałem pakiet X. Jak go uruchomić?",
      "level": 3,
      "content": "Jeśli używasz środowiska pulpitu takiego jak KDE (Polski) lub GNOME (Polski), program powinien automatycznie pojawić się w menu. Jeśli próbujesz uruchomić program z terminala i nie znasz nazwy binarnej, użyj:\n\n```\n$ pacman -Qlq nazwa_pakietu | grep /usr/bin/\n```\n\n"
    },
    {
      "title": "Dlaczego w oficjalnych repozytoriach jest tylko jedna wersja każdej biblioteki współdzielonej?",
      "level": 3,
      "content": "Niektóre dystrybucje, takie jak np. Debian, mają różne wersje bibliotek współdzielonych spakowanych jako różne pakiety: libfoo1, libfoo2, libfoo3 i tak dalej. W ten sposób można kompilować aplikacje dla różnych wersji libfoo zainstalowanych w tym samym systemie.\n\nW przypadku dystrybucji takiej jak Arch oficjalnie obsługiwane są tylko najnowsze wersje pakietów. Porzucając obsługę przestarzałego oprogramowania, opiekunowie pakietów mogą spędzić więcej czasu na sprawdzenie, czy najnowsze wersje działają zgodnie z oczekiwaniami. Gdy tylko nowa wersja biblioteki współdzielonej stanie się dostępna, zostanie ona dodana do repozytoriów, a pakiety, których dotyczy problem, zostaną przebudowane tak, aby używać najnowszej wersji.\n\n"
    },
    {
      "title": "Co się stanie, jeśli uruchomię pełną aktualizację systemu, a aktualizacja zostanie udostępniona dla biblioteki współużytkowanej, ale nie dla zależnych od niej aplikacji?",
      "level": 3,
      "content": "Coś takiego nie powinno się wydarzyć. Zakładając, że aplikacja o nazwie foobaz znajduje się w jednym z oficjalnych repozytoriów i z powodzeniem buduje się na nowej wersji biblioteki współdzielonej o nazwie libbaz, zostanie ona zaktualizowana wraz z libbaz. Jeśli jednak nie uda się jej skompilować, pakiet foobaz będzie zależny od wersji (np. Libbaz 1.5) i zostanie usunięty przez pacmana podczas aktualizacji libbaz z powodu konfliktu.\n\nJeśli foobaz to pakiet, który sam zbudowałeś i zainstalowałeś z AUR, powinieneś przebudować foobaz na nową wersję libbaz. Jeśli kompilacja się nie powiedzie, zgłoś błąd programistom foobaz.\n\n"
    },
    {
      "title": "Czy jest możliwe, że w repozytorium znajduje się poważna aktualizacja jądra i że niektóre pakiety sterowników nie zostały zaktualizowane?",
      "level": 3,
      "content": "Nie, nie jest to możliwe. Ważnym aktualizacjom jądra (np. „Linux 3.5.0-1” do „linux 3.6.0-1”) zawsze towarzyszą przebudowy wszystkich obsługiwanych pakietów sterowników jądra. Z drugiej strony, jeśli masz zainstalowany nieobsługiwany pakiet sterowników, taki jak z AUR, to aktualizacja jądra może się zepsuć, jeśli nie przebudujesz go dla nowego jądra. Użytkownicy są odpowiedzialni za aktualizację wszelkich nieobsługiwanych pakietów sterowników, które zainstalowali.\n\n"
    },
    {
      "title": "Co zrobić przed aktualizacją?",
      "level": 3,
      "content": "Postępuj zgodnie z sekcją System maintenance#Upgrading the system.\n\n"
    },
    {
      "title": "Wydano aktualizację pakietu, ale Pacman mówi, że system jest aktualny",
      "level": 3,
      "content": "Serwery lustrzane „Pacman” nie są natychmiast synchronizowane. Aktualizacja może potrwać 24 godziny. Jedynymi rozwiązaniami są cierpliwość lub użycie innego serwera lustrzanego. MirrorStatus może pomóc w identyfikacji aktualnego serwera lustrzanego.\n\n"
    },
    {
      "title": "Dystrybutor projektu X wydał nową wersję. Jak długo potrwa aktualizacja pakietu Arch do tej nowej wersji?",
      "level": 3,
      "content": "Aktualizacje pakietów zostaną wydane, gdy będą gotowe. Określony czas może wynieść kilka godzin po wydaniu oficjalnym (upstream) gdy dotyczy niewielkiej aktualizacji błędów lub też nawet kilka tygodni po dużej aktualizacji dużej grupy pakietów. Czas od nowej wersji nadrzędnej do wydania przez Arch nowego pakietu zależy od konkretnych pakietów i dostępności opiekunów pakietów. Ponadto niektóre pakiety spędzają trochę czasu w repozytorium testowym, co może wydłużyć czas do aktualizacji pakietu. Jeśli znajdziesz pakiet w oficjalnych repozytoriach, który jest nieaktualny, przejdź do strony tego pakietu na stronie pakietów i oznacz go.\n\n"
    },
    {
      "title": "Jeśli potrzebuję starszej wersji zainstalowanej biblioteki, czy mogę po prostu dowiązać symbolicznie do nowszej wersji?",
      "level": 3,
      "content": "Jeśli masz szczęście, może to działać przez jakiś czas. Nie jest to jednak właściwe rozwiązanie, ponieważ:\n\n- Biblioteki nie zmieniają wersji losowo – interfejs API/ABI prawdopodobnie się zmieni (możliwe, że z usuniętymi bitami), a to, czy zmiany te wpływają na użytkowanie biblioteki, jest kwestią przypadku.\n- Menedżer pakietów nie wyśledzi dowiązania symbolicznego. Początkujący, którzy natychmiast próbują włamać się do plików biblioteki systemowej, są najbardziej narażeni na dokonanie niepożądanej zmiany, której nie mogą zdiagnozować/naprawić, przed czym chroni menedżer pakietów.\n- Niewielka alternatywa zrzucenia starego pliku biblioteki do systemu plików, bez śledzenia, zostałaby zapomniana i nie zauważono by/nie usunięto potencjalnych błędów bezpieczeństwa.\n\nZamiast tego użyj/napisz pakiet compat, który zapewnia wymaganą wersję biblioteki.\n\n"
    },
    {
      "title": "Dlaczego w grupie podstawowej istnieją niepotrzebne pakiety (np. netctl)?",
      "level": 3,
      "content": "Istnieją propozycje poprawy tego stanu rzeczy. Oto dyskusje z listy mailingowej:\n\nhttps://lists.archlinux.org/archives/list/arch-dev-public@lists.archlinux.org/thread/GRX4NIR2AQVBUGYS4K4TKBS3HGSAS456/\n\nhttps://lists.archlinux.org/archives/list/arch-dev-public@lists.archlinux.org/message/CA4MYTK55ASAXVFXK3LLSLVJJV4RO75L/\n\n"
    },
    {
      "title": "Jak ustalić, czy mój procesor jest zgodny z architekturą x86_64?",
      "level": 3,
      "content": "Jeśli twój procesor jest kompatybilny z x86_64, będziesz mieć flagę lm (tryb długi) w /proc/cpuinfo. Na przykład:\n\n```\n$ grep -w lm /proc/cpuinfo\n```\n\nW systemie Windows skorzystanie z bezpłatnego oprogramowania CPU-Z pomoże ustalić, czy Twój procesor jest kompatybilny z 64-bitami. Procesory z zestawem instrukcji AMD „AMD64” lub rozwiązaniem Intela „EM64T” powinny być kompatybilne z wydaniami x86_64 i pakietami binarnymi.\n\n"
    },
    {
      "title": "Dlaczego 64-bity?",
      "level": 3,
      "content": "W większości przypadków 64-bitowy system operacyjny jest szybszy i dodatkowo z natury bardziej bezpieczny ze względu na swoje właściwości Randomizacja układu przestrzeni adresowej (ASLR) w połączeniu z Kod niezależny od pozycji (PIC) i NX Bit, który nie jest dostępny w standardowym jądrze i686 z powodu wyłączenia Physical Address Extension (PAE). Jeśli Twój komputer ma więcej niż 4 GiB pamięci RAM, tylko 64-bitowy system operacyjny będzie mógł go w pełni wykorzystać.\n\nProgramiści również coraz mniej dbają o 32-bitowe („starsze”) procesory, ponieważ „nowe” procesory x86 zazwyczaj obsługują rozszerzenia 64-bitowe.\n\nIstnieje wiele innych powodów, które moglibyśmy tutaj wymienić, a które świadczą o wyższości systemów 64-bitowych, ale między jądrem, przestrzenią użytkownika i poszczególnymi programami po prostu nie jest możliwe wyszczególnienie każdej rzeczy, którą 64-bit robi obecnie znacznie lepiej.\n\n"
    }
  ]
}