{
  "title": "Dark mode switching",
  "url": "https://wiki.archlinux.org/title/Dark_mode_switching",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Switching between light and dark modes/themes is nice to have. It allows you to switch to dark mode on sunset or toggle modes with a keyboard shortcut.\n\nThe switch between themes can apply to currently running programs, probably requiring a daemon, or only to newly launched ones. This article focuses on switching at runtime, so toggling during use affects currently running programs.\n\nSwitching between light and dark mode requires support from applications or application toolkits like GTK and Qt.\n\nIf you don't need live theme switching, to quickly set a dark theme system-wide Install gnome-themes-extra, adwaita-qt5-gitAUR and adwaita-qt6-gitAUR and Export GTK_THEME=Adwaita:dark, GTK2_RC_FILES=/usr/share/themes/Adwaita-dark/gtk-2.0/gtkrc and QT_STYLE_OVERRIDE=Adwaita-Dark.\n\n"
    },
    {
      "title": "Tools",
      "level": 2,
      "content": "- darkman — darkman is a tool that allows automating transitioning to dark mode at sundown, and back to light mode at sunrise. It allows placing drop-in scripts to be run automatically at those times. It also exposes an XDG Desktop Portal backend with the current value.\n\n- Yin-Yang — Yin-Yang is a similar tool, which can be also run manually (not only on sunset/sunrise). Currently it supports Plasma, GNOME & Budgie DE, as well as few of the most used miscellaneous applications (Firefox, VSCode etc.). Running custom scripts is also supported.\n\n- Blueblack — Blueblack is an alternative to darkman with no dependencies to geoclue. Provide your own location instead and get scripts ran on sunrise and sunset automatically.\n\n"
    },
    {
      "title": "GTK",
      "level": 3,
      "content": "To change the light/dark mode, you have to change the used theme.\n\nMost themes do have a dark variant and those have by convention the suffix -dark. For example the default GTK theme Adwaita has the variant Adwaita-dark.\n\nTo permanently change to the dark variant, see GTK#Dark theme variant\n\nTo switch themes instantly for running programs, either a daemon providing the xsettings spec or gsettings is required. For desktops running with Xorg, an xsettings daemon is needed. For desktops running with Wayland, gsettings is queried. To query gsettings configuration, GTK requires the Settings XDG Desktop Portal, provided by xdg-desktop-portal-gtk, to be running.\n\n"
    },
    {
      "title": "xsettings daemon",
      "level": 4,
      "content": "xsettings is queried for Xorg sessions.\n\nThe xsettings daemon from Xfce is xfsettingsd, which is provided by the xfce4-settings package.\n\nTo query current GTK theme:\n\n```\n$ xfconf-query -c xsettings -p /Net/ThemeName\n```\n\nTo set GTK theme:\n\n```\n$ xfconf-query -c xsettings -p /Net/ThemeName -s \"new-theme\"\n```\n\nChanges to this entry are instant and affect all GTK applications.\n\n"
    },
    {
      "title": "gsettings",
      "level": 4,
      "content": "gsettings is queried for Wayland sessions. For this to work, you need xdg-desktop-portal-gtk running.\n\nTo query the current GTK theme:\n\n```\n$ gsettings get org.gnome.desktop.interface gtk-theme\n```\n\nTo set the GTK theme:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme \"new-theme\"\n```\n\nAlternatively, if your theme does not apply the dark scheme to Gtk4 applications, you can request the dark variant of the default theme:\n\n```\n$ gsettings set org.gnome.desktop.interface color-scheme 'prefer-dark'\n```\n\nor light variant:\n\n```\n$ gsettings set org.gnome.desktop.interface color-scheme 'prefer-light'\n```\n\nChanges to this entry are instant and affect all GTK applications.\n\nNote that not all GTK themes support both light and dark variants. Notably, if you are using KDE, the Breeze GTK theme does not support it. You can switch to Adwaita theme by running the command below.\n\nIf you are using KDE and want to switch dark and light modes on the fly (even at the cost of different themes for Qt and GTK apps), you can switch the GTK theme to one that supports both dark and light variant - like the default Adwaita theme. You can switch to the Adwaita theme by running:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme 'Adwaita'\n```\n\nand if you want to revert to KDE default theme, run:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme 'Breeze'\n```\n\nDoing this will allow you to switch theme even on already running apps using the color-scheme command above. It will also respect the KDE dark/light setting, that can be switched on in KDE Settings.\n\n"
    },
    {
      "title": "Qt",
      "level": 3,
      "content": "Qt has theme support similar to GTK.\n\nOne method to theme Qt applications is using GTK for styling. Changes to the GTK theme then affect Qt applications as well.\n\nAnother method is using a native Qt theme, e.g. adwaita-qt5-gitAUR. To switch between themes, you can follow Qt#Configuration of Qt 5/6 applications under environments other than KDE Plasma.\n\n"
    },
    {
      "title": "Firefox",
      "level": 3,
      "content": "Firefox automatically uses the current GTK theme mode and adapts the appearance of the browser accordingly. See Firefox#Dark themes for some more settings and caveats.\n\nTo change web content smartly, the Dark Reader Add-On is recommended.\n\nBy setting Automation to Use system color scheme, Dark Reader activates automatically with dark GTK themes.\n\n"
    },
    {
      "title": "Libreoffice",
      "level": 3,
      "content": "Libreoffice automatically uses the current GTK theme mode. To manually set it, use:\n\n```\nTools > Options > Preferences > View > Appearance > Mode: Dark.\n```\n\n"
    },
    {
      "title": "Thunderbird",
      "level": 3,
      "content": "Thunderbird conforms with the current GTK Theme, but some changes are recommended.\n\nSee Thunderbird#Theming tweaks.\n\n"
    },
    {
      "title": "Visual Studio Code",
      "level": 3,
      "content": "To change the theme in Visual Studio Code, this script may help.\n\n"
    },
    {
      "title": "IntelliJ",
      "level": 3,
      "content": "The Auto Dark Mode plugin will automatically switch themes based on the current GTK theme once installed.\n\n"
    },
    {
      "title": "Alacritty",
      "level": 3,
      "content": "Alacritty has support for multiple custom color schemes. The configuration syntax and published color schemes can be found here.\n\nTo quickly change theme, you should declare a pointer to each color scheme, for example &black. Then you can switch to a color scheme by simply setting colors: *black. This change to the configuration file is instant and affects all currently running instances. If not, you may have to set live_config_reload: true.\n\nThe borders and title bar are themed with GTK. To abide by the GTK theme, you should set the setting gtk_theme_variant to the default None.\n\n"
    },
    {
      "title": "Ghostty",
      "level": 3,
      "content": "Ghostty has support for Light and Dark Themes\n\nTo use it, add a line to the configuration file specifying the themes for dark and light mode:\n\n```\ntheme = dark:catppuccin-frappe,light:catppuccin-latte\n```\n\nLink to docs\n\n"
    }
  ]
}