{
  "title": "Dell Latitude 7440",
  "url": "https://wiki.archlinux.org/title/Dell_Latitude_7440",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad | 0488:104A | Yes\nKeyboard | 0001:0001 | Yes\nGPU | 8086:46a6 | Yes\nWebcam |  | Partially\nBluetooth | 8087:0033 | Yes\nAudio | 8086:51c8 | Yes\nWireless | 8086:51f0 | Yes\nFingerprint reader | 0a5c:5843 | Yes\nTPM |  | untested\nTouchscreen |  | Yes\nFn Keys |  | Yes\nSuspend to RAM |  | Yes\nSuspend to disk |  | untested\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "As of mid 2023, installation from USB medium is relatively smooth except for the webcam driver, which is currently barely supported and only works through a workaround that is extremely tedious to install. It does work though, see below.\n\n"
    },
    {
      "title": "Graphics",
      "level": 3,
      "content": "Do not install the xf86-video-intel package: it makes things worse, as you can verify using glxgears from the mesa-demos package.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "Audio (both speakers and microphone) works out of the box. You might have to unmute the speakers and/or the microphone using e.g. pavucontrol.\n\n"
    },
    {
      "title": "Disks",
      "level": 3,
      "content": "Disks are recognized in AHCI mode. RAID mode untested.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "Works out of the box, but without some essential gestures (e.g. paste from primary clipboard with three-finger tap). In Xorg, you can use libinput to activate the tap paste, and then create an Xorg configuration file to save the setting across reboots, e.g.:\n\n```\n/etc/X11/xorg.conf.d/99-enable-touchpad-tapping.conf\n```\n\n```\nSection \"InputClass\"\n\tIdentifier \"VEN_0488:00 0488:104A Touchpad\"\n\tMatchIsTouchpad \"on\"\n\tMatchDevicePath \"/dev/input/event*\"\n\tMatchDriver \"libinput\"\n\tOption \"Tapping\" \"1\"\nEndSection\n```\n\n"
    },
    {
      "title": "Webcam",
      "level": 3,
      "content": "Works but requires tedious installation of drivers, firmware and other software. To make a long story short, Intel decided to ship IPU6/MIPI webcams including the one on this laptop without first upstreaming drivers into the linux kernel. It then turned out that the camera requires not just a driver, but a whole separate substack because certain operations that are typically performed within the camera silicon are now delegated to the CPU/GPU. Dell ships Ubuntu \"certified\" laptops with this camera using a workaround that creates a \"virtual camera\", but the code is scattered across multiple packages, several of which require custom PKGBUILDs. A recipe to get it working as of kernel 6.4.2 is listed here.\n\nEfforts are under way by Intel and the Linux kernel community to support this webcam out of the box, but it might take a year or two (i.e. 2024-2025).\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 3,
      "content": "libfprint-2-tod1-broadcomAUR is required for the fingerprint reader to be working. The package fprintd needs to be installed as well, as described in Fprint.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Dell provides firmware updates that can be installed automatically using fwupd.\n\nIt is possible to install custom Secure Boot root keys in the BIOS and use them for Secure Boot with Linux.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Toggles Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume3\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume3\nFn+F4 | Yes | Yes | F204\nFn+F5 | Yes | Yes | Toggle Keyboard Backlight Brightness 0%/50%/100%\nFn+F6 | Yes | Yes | XF86MonBrightnessDown3\nFn+F7 | Yes | Yes | XF86MonBrightnessUp3\nFn+F8 | Yes | Wrong marking | It appears to be SuperL\nFn+F9 | No | No | None\nFn+F10 | Yes | Yes | PrintScreen\nFn+F11 | Yes | Yes | Home\nFn+F12 | Yes | Yes | End\nFn+Up | Yes | Yes | PageUp\nFn+Down | Yes | Yes | PageDown\nFn+Left | Yes | No | Home\nFn+Right | Yes | No | End\nFn+Ctrl | Yes | Yes | XF86MenuKB\nFn+B | Yes | No | Pause\nFn+S | Yes | No | Scroll Lock\nFn+R | Yes | No | SysRq\nFn+Ctrl+B | Yes | No | Break\n\n1. The key is visible to xev and similar tools.\n1. The physical key has a symbol on it, which describes its function.\n1. Keypress is best handled via ACPI events, e.g. the acpid package/service.\n1. Keypress is only recognized via ACPI (e.g. acpi_listen as button/f20 F20. User reports it used to be recognized as X86MicrophoneMute on a fresh installation, but it somehow does not work anymore.\n\n"
    },
    {
      "title": "BIOS Settings overview",
      "level": 3,
      "content": "The \"BIOS Settings\" interface can be reached by pressing F2 during POST.\n\nThe BIOS settings page itself is GUI based. There is a panel taking approximately 20% of the screen on the left, containing various sub-categories of settings. The main panel takes 80% of the screen to the right, and contains the settings associated with each sub-category. The font is relatively large, and toggle switches will appear as light grey if set to 'off', and turn light blue if set to 'on'.\n\nThe BIOS can be updated through the \"One-Time Boot Menu\" (press F12 during POST).\n\n"
    },
    {
      "title": "BIOS Settings navigation",
      "level": 3,
      "content": "The \"BIOS Settings\" interface can be navigated using a keyboard, or mouse - with mouse being the preferred mode. Keyboard navigation keys are as follows:\n\nTable content:\nKey | Effect\nUp | Moves to the previous field.\nDown | Moves to the next field.\nEnter | Selects a value in the selected field (if applicable) or follow the link in the field.\nSpace | Expands or collapses a drop-down list, if applicable.\nTab | Moves to the next focus area\nPageUp | Scrolls the currently selected view up.\nPageDown | Scrolls the currently selected view down.\nEsc | Moves to the previous page until you view the main screen. Pressing Esc in the main screen displays a message that prompts you to save any unsaved changes and restarts the system.\n\n"
    },
    {
      "title": "Diagnostics",
      "level": 2,
      "content": "Pressing F12 during POST starts the \"One-Time Boot Menu\" (if enabled in BIOS). There the diagnostic option can be found, which offers various thorough on-board tests.\n\nIf d is held while powering on, the \"Display panel built-in self-test\" (LCD-BIST) is initiated. The screen will cycle three times through solid colors before powering off again. This can be used to make sure all colors are displayed correctly without distortions and no dead pixels are present.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Setup and specifications guide: https://dl.dell.com/content/manual64458532-latitude-7440-setup-and-specifications.pdf?language=en-us\n- Official service manual: https://dl.dell.com/content/manual32605743-latitude-7440-service-manual.pdf?language=en-us\n\n"
    }
  ]
}