{
  "title": "Dell XPS 17 (9720)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_17_(9720)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThis page applies to the Dell XPS 17 (9720) and the Precision 5770, that are the same hardware.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) | 8086:46a6 | Yes\nGPU (NVIDIA) | 10de:25a2 | Yes\nWi-Fi | 8086:51f0 | Yes\nBluetooth |  | Yes\nAudio | 8086:51c8 | Yes\nTouchpad | 06CB:CE7E | Yes\nWebcam |  | Yes\nFingerprint sensor | 27c6:63ac | Yes\nSD Card Reader | 10ec:5260 | Yes\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Before installing it is necessary to modify some UEFI Settings. They can be accessed with F2 when booting.\n\n- Change the SATA Mode from the default \"RAID\" to \"AHCI\". This will allow Linux to detect the NVMe SSD.\n- Disable Secure Boot. This may be re-enabled at a later point. See Secure Boot#Using a signed boot loader.\n\n"
    },
    {
      "title": "Dual boot",
      "level": 3,
      "content": "Please note that changing from \"RAID\" to \"AHCI\" can break the default Windows installation and require a complete reinstall. Usually running windows own startup repair utility however fixes this issue in most cases. Another alternative is to follow this guide.\n\nThe reinstall can be done through the Dell recovery in the UEFI if needed.\n\nOnce you used the startup repair utility or have reinstalled, Windows should boot normally in AHCI mode and without error. Then one can proceed with typical dual boot setup.\n\n"
    },
    {
      "title": "Thunderbolt",
      "level": 2,
      "content": "The following thunderbolt devices have been tested:\n\nTable content:\nDevice | Working? | Comments\nDell WD22TB4 | Yes | –\nDell WD19DC | Yes | –\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "Sound Open Firmware is required, and allows full functionality.\n\n"
    },
    {
      "title": "Microphone",
      "level": 3,
      "content": "The laptop has several mic channels and the appropriate channel has to be unmuted before the mic will work. Run alsamixer, press F6, then in sof-soundwire:\n\n- Select Playback (F3)\n- Under Playback, select rt714 ADC 22 Mux and set it to DMIC1\n- Select Capture (F4)\n- Make sure PGA5.0 5 Master is unmuted and and the two rt714 FU02 channels are unmuted\n\nMake sure both the left and right microphones for the PGA5.0 channel (use keys ; and ') are selected. Other than the above mentioned channels in Playback and Capture, none of the other channels appears to able to influence recorded audio.\n\n"
    },
    {
      "title": "Touchpad sluggish/sticky",
      "level": 2,
      "content": "As in previous XPS 17 iterations, some users may find the touchpad is sluggish or sticky occasionally. Previous tracking bug https://gitlab.freedesktop.org/libinput/libinput/-/issues/618 but it is not root-caused yet.\n\nTouchpad is significantly more stable in X than Wayland. X will rarely exhibit an issue where only the top left quadrant of the touchpad is usable, for a short amount of time (and is fixable by a reboot).\n\nUsing Wayland, if the lower 20% of the screen is exhibiting significant tearing during pointer travel in that area, add the kernel parameter i915.enable_psr=0 to resolve this.\n\n"
    },
    {
      "title": "Power Management",
      "level": 2,
      "content": "See Hibernation for kernel parameters & initramfs configuration.\n\nS3 Sleep: Not supported. S0ix however works reasonably, losing ~ 0.5% per hour. \"RAID\" needs to be changed to \"AHCI\" for S0ix to work.\n\nNVIDIA's open source driver does not support power management as of July 2022. Installing the proprietary driver is needed for NVIDIA Optimus. Once the proprietary driver is installed, no additional configuration is needed and it automatically turns the GPU off when not in use, reducing battery power usage by 7-12 watts per hour.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Dell provides firmware updates that can be installed automatically using fwupd (or one of its graphical frontends such as Gnome Software or KDE Discover). User reports not receiving UEFI and some other firmware updates this way when there were newer versions available for download.\n\nAlternatively, firmware updates can also be installed from the UEFI directly by connecting to Wi-Fi, or even installed manually by downloading them from the support page and placing the .exe file on a FAT32 drive or the EFI system partition, then selecting the file in the \"BIOS update\" page after pressing F12 at boot time.\n\nIt is possible to install custom Secure Boot root keys in the UEFI and use them for Secure Boot with Linux.\n\n"
    }
  ]
}