{
  "title": "Dell Inspiron 15 (7590)",
  "url": "https://wiki.archlinux.org/title/Dell_Inspiron_15_(7590)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWi-Fi |  | Yes\nBluetooth |  | Yes\nAudio |  | Yes\nMicrophone |  | Yes\nTouchpad |  | Yes\nWebcam |  | Yes\nFingerprint Reader | 27c6:538d | No\n\nThe Dell Inspiron 15 (7590) was released in May 2019, some country released it called Vostro 7590, and the aluminum alloy body version is Inspiron 7591. They use the same BIOS and Motherboard. The information on this page may also be useful to those with the Dell Inspiron 7391 (13\" screen correspondent model).\n\nThe installation process for Arch on the Inspiron 15 does not differ from any other PC. For installation help, please see the Installation guide and UEFI. This page covers the current status of hardware support on Arch, as well as post-installation recommendations.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Before installing it is necessary to modify some UEFI Settings. They can be accessed by pressing the F2 key repeatedly when booting.\n\n- Change the SATA Mode from the default \"RAID\" to \"AHCI\". This will allow Linux to detect the NVMe SSD. If dual booting with an existing Windows installation, Windows will not boot after the change, but you can do this before switching to AHCI.\n- If you have already changed RAID to AHCI and cannot boot into Windows, just continue booting until showing up WINRE, then enter safe mode for once. Reboot once more and Windows will automatically start with AHCI drivers enabled.\n- Disable Secure Boot to allow Linux to boot. If not, Linux can be booting with secure boot by rEFInd\n\nBooting and installing from a micro SD card is also possible, as long as SD Card and SD Card Boot are both enabled in the UEFI setup.\n\n"
    },
    {
      "title": "Display",
      "level": 3,
      "content": "The video should work with the i915 driver of the current linux kernel. Consult Intel graphics for a detailed installation and configuration guide as well as for Intel graphics#Troubleshooting.\n\nIf you have the 4K (3840x2160) model, also check out HiDPI for UI scaling configurations.\n\nDisplayPort connection via the USB C / Thunderbolt port is detected automatically and appears to work flawlessly.\n\n"
    },
    {
      "title": "Graphics Configuration",
      "level": 3,
      "content": "The Dell Inspiron 15 7590 has Intel HD Graphics 630 integrated graphics, and some models have an Nvidia GeForce GTX 1650 dedicated card as well in a hybrid configuration.\n\nFor computers with only integrated graphics, just install the xf86-video-intel driver.\n\nIf your Inspiron has a hybrid graphics configuration (GTX1650 + HD Graphics 630) and you want to maximize battery life you can just use the Intel Graphics.\n\n"
    },
    {
      "title": "Intel Only",
      "level": 4,
      "content": "If your model comes with an nVidia card which you do not use then you can try to disable it with an ACPI command. Depending on the model, this can have a small to profound effect on the laptop's temperature and battery life (it can more than double battery life!)\n\n- Install the Intel video driver using the xf86-video-intel package.\n- Blacklist the nvidia & nouveau modules Kernel modules#Blacklisting\n- Power down the GPU with an ACPI command\n\n"
    },
    {
      "title": "Optimus Configuration (Hybrid Intel and Nvidia)",
      "level": 4,
      "content": "Follow the instructions for PRIME. In the case of this laptop, there are only two required steps:\n\n- Once the NVIDIA drivers are installed, install the nvidia-prime package, and use the prime-run command to run applications that should run on the dGPU.\n- Follow the steps outlined in the \"Automated Setup\" section on this page: https://download.nvidia.com/XFree86/Linux-x86_64/435.17/README/dynamicpowermanagement.html\n\n- Switching graphics card by logout may cause Wi-Fi function in NetworkManager stop working, you can restart NetworkManager.service to solve it.\n- The Optimus setup consists of the integrated Intel chip connected to the laptop screen and the Nvidia card runs through this. As such, the Nvidia chip cannot be used without the Intel chip (some other laptops have the option in BIOS to turn Intel off and use just Nvidia, but not this laptop).\n\n"
    },
    {
      "title": "Use the new sof-hda-dsp driver",
      "level": 3,
      "content": "This laptop requires Sound Open Firmware in order for the sound card to work.\n\nAfter reboot, you should see a list of audio devices with names include Cannon Lake PCH cAVS. Also, you should be able to see Digital Microphone appearing in the \"Recording Devices\". If using the new sof-hda-dsp driver does not solve the problem, you will need to follow instructions below to use the legacy driver.\n\nAs of July 2020, there exists a bug that the Master device is automatically muted after rebooting. If you can hear no sound from output, install alsa-utils and run alsamixer -c 0. Then, switch to \"Master\" device, press \"m\" to unmute it so that you see \"00\" instead of \"MM\" under it. If it has 0% volume, you should also press up arrow key to increase the volume to 100%. After that, the sound should work.\n\nYou can use following command to store your current setting, so you do not need to un-mute the device manually after each reboot.\n\n```\n# alsactl store\n```\n\n"
    },
    {
      "title": "Automatically un-muting Master device after booting",
      "level": 4,
      "content": "If entering alsamixer -c 0 and un-muting the device manually after each reboot seems too laborious, you can also automate this process.\n\nCreate an executable script with the following commands and make it autostart depending on your environment (see Autostarting for details).\n\n```\namixer -Dhw:0 cset name='Master Playback Switch' on\namixer -Dhw:0 cset name='Master Playback Volume' 100%\n```\n\n"
    },
    {
      "title": "Use legacy HDA-Intel driver",
      "level": 3,
      "content": "Create the following file:\n\n```\n/etc/modprobe.d/audio-fix.conf\n```\n\n```\nblacklist snd-sof-pci\noptions snd-intel-dspcfg dsp_driver=1\n```\n\nIt is also possible to provide this as a kernel parameter in GRUB configuration: snd-intel-dspcfg.dsp_driver=1.\n\nYou could also try setting the snd_hda_intel.dmic_detect=0 kernel parameter, although this is due to be deprecated in favour of the above method.\n\n"
    },
    {
      "title": "Wi-Fi",
      "level": 2,
      "content": "The Wi-Fi adapter contains a Intel(R) Wireless-AC 9560 160MHz module. It should work out of the box with the iwlwifi driver in recent linux kernels.\n\n"
    },
    {
      "title": "Keyboard",
      "level": 2,
      "content": "The keyboard backlight has a feature that makes it automatically turn off after a given timeout. This timeout can be adjusted by writing into /sys/class/leds/dell\\:\\:kbd_backlight/stop_timeout. For example,\n\n```\necho \"5m\" > /sys/class/leds/dell\\:\\:kbd_backlight/stop_timeout\n```\n\nThis would set the timeout to 5 minutes.\n\n"
    },
    {
      "title": "Enable thermald",
      "level": 3,
      "content": "Thermald is a daemon created by Intel to control CPU heat more intelligently than the laptop's firmware is capable of. It plays nicely with TLP.\n\n"
    },
    {
      "title": "Enable TLP",
      "level": 3,
      "content": "The TLP may increase battery life.\n\nYou can monitor the used power and also the temperature of your machine with the s-tui tool.\n\n"
    },
    {
      "title": "CPU Undervolting",
      "level": 3,
      "content": "It is possible to undervolt CPU and GPU with intel-undervolt\n\nThis is an example of stable values for i7-9750H (depend of your cpu):\n\n```\nCPU (0): -155.27 mV\nGPU (1): -110.35 mV\nCPU Cache (2): -139.65 mV\nSystem Agent (3): -0.00 mV\nAnalog I/O (4): -0.00 mV\n```\n\nEdit the config file /etc/intel-undervolt.conf.\n\nThis is an example for i7-9750H\n\n```\n# CPU Undervolting\n\nundervolt 0 'CPU' -155\nundervolt 1 'GPU' -110\nundervolt 2 'CPU Cache' -140\nundervolt 3 'System Agent' 0\nundervolt 4 'Analog I/O' 0\n\n# Daemon Update Interval\n\ninterval 5000\n```\n\nthen enable/start intel-undervolt.service.\n\n"
    },
    {
      "title": "S3 Suspend",
      "level": 3,
      "content": "See Power management/Suspend and hibernate#Changing suspend method.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Dell provides firmware updates via Linux Vendor Firmware Service (LVFS). Refer to Flashing BIOS from Linux#fwupd for additional information. A package is readily available at fwupd. Updates are provided for the Thunderbolt controller as well. There is an issue where the Thunderbolt version number is detected as 00.00 after re-flashing (currently being investigated).\n\nDell has also released updates to the SSD firmware, but these can only be updated from Windows, not from Linux.\n\n"
    },
    {
      "title": "Thermal Modes / Fan profiles",
      "level": 2,
      "content": "Just like in Windows by using Dell Power Manager you can set the thermal configuration and behavior of the fans and CPU of your machine. This is done within a terminal with the commands below, or via plasma5-applets-plasma-pstateAUR[broken link: package not found]:\n\nTo find out what thermal mode is set to type:\n\n```\n# smbios-thermal-ctl -g\n```\n\nTo find all available thermal modes type:\n\n```\n# smbios-thermal-ctl -i\n```\n\nAnd finally to set the desired thermal mode that you identified with the command before type:\n\n```\n# smbios-thermal-ctl --set-thermal-mode=THERMAL_MODE\n```\n\n\"Quiet\" profile limits CPU power to 25W and thus reduces overall system performance.\n\n\"Balanced\" and \"Performance\" profiles remove this limit.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "By default, the libinput driver might not have the desired sensitivity. The acceleration can be changed via xinput as follows:\n\n```\nxinput --set-prop $(xinput | grep 'DELL.*Touchpad' | awk '{print $6}' | sed 's/id=//g') 'libinput Accel Speed' 0.5\n```\n\n"
    },
    {
      "title": "I/O Operating is very slow",
      "level": 3,
      "content": "While running sudo, htop, lspci and so on, then get freezing or very slow, to fix it below:\n\nIf you are running over Linux Kernel 5.2, while staying in boot loader, add kernel parameter nomodeset to boot, then add nouveau to blacklist (Kernel module#Blacklisting)\n\n"
    },
    {
      "title": "Suspend",
      "level": 3,
      "content": "Add these kernel parameters: acpi_rev_override=1 acpi_osi=Linux mem_sleep_default=deep\n\nS0ix(or S2idle) suspend mode may cause freezing, only S3 can work properly, see Power management/Suspend and hibernate#Changing suspend method.\n\n"
    },
    {
      "title": "Sound card not detected",
      "level": 3,
      "content": "This may be caused by newer kernels attempting to load the newer SOF audio driver in preference to the old driver.\n\nYou should install the sof-firmware package and reboot.\n\n"
    },
    {
      "title": "No audio from 3.5mm headphone jack port when using legacy driver",
      "level": 3,
      "content": "In pavucontrol, try changing the PulseAudio output profile from Analog Stereo Output to Analog Stereo Duplex.\n\n"
    },
    {
      "title": "Microphone not working",
      "level": 3,
      "content": "Instruct the kernel to use the new SOF drivers. See #Use the new sof-hda-dsp driver\n\n"
    },
    {
      "title": "Removing HDMI Audio devices when using SOF driver",
      "level": 3,
      "content": "If the three HDMI entries in the Audio Devices bothers you, you can remove ALL of them by the following config file:\n\n```\n/etc/modprobe.d/audio-fix.conf\n```\n\n```\noptions snd_sof_intel_hda_common codec_mask=0x1\n```\n\n"
    }
  ]
}