{
  "title": "Dell Mini 10v",
  "url": "https://wiki.archlinux.org/title/Dell_Mini_10v",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "This page exists as a redirect target for archived pages.\n\nIf you arrived here after following a link to what was supposed to be an article, it means that it has been archived: you can browse its revisions by following the \"Redirected from\" link at the top of this page, and then opening the history of that redirect page.\n\nVisit Category:Archive or Special:WhatLinksHere/ArchWiki:Archive for listings of archived pages.\n\nIf among the archived pages you find some that could make sense to instead redirect to an existing article, please do so.\n\n"
    },
    {
      "title": "How to archive a page",
      "level": 2,
      "content": "Before archiving a page, consider redirecting it to a more suitable existing article (e.g. redirect old or bad translations to the English page, see ArchWiki:Translation Team#Dealing with old translations). If none can be found, follow this procedure:\n\n1. The page should have been marked with Template:Archive for at least 1 week.\n1. Remove all the links (backlinks) that point to the page to be archived or one of its redirects, by looking at its Special:WhatLinksHere page.\n1. If the page is in the \"Template\" or \"Category\" namespaces, it must be disabled by renaming it, changing the first colon (\":\") to a semicolon (\";\"). The associated Talk page, if existing, must be renamed too. For example, \"Template:Example\" would change to \"Template;Example\", and \"Template talk:Example\" would change to \"Talk:Template;Example\".\n1. Replace the whole content with a redirect to this very page, and categorize the page under Category:Archive: #redirect [[ArchWiki:Archive]] [[Category:Archive]] Tip: This can be done more quickly with Template:AR: {{subst:AR}}\n1. Fix any double redirects that may result from the archiving of the article, i.e. all the titles that were previously redirecting to it should be equally archived as specified at step 4.\n1. If the archived page has an associated Talk page, that must be archived with this same procedure, starting from step 2.\n1. If the archived page has associated translations, they must be archived with this same procedure, starting from step 2.\n\n```\n#redirect [[ArchWiki:Archive]]\n[[Category:Archive]]\n```\n\n```\n{{subst:AR}}\n```\n\n"
    }
  ]
}