{
  "title": "Dell Vostro 1320",
  "url": "https://wiki.archlinux.org/title/Dell_Vostro_1320",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (NVIDIA) |  | Yes\nGPU (Intel) |  | Untested\nAudio |  | Yes\nWebcam |  | Yes\nFingerprint Reader |  | Untested\nCard Reader |  | Yes\nWireless (Dell 1397) |  | Yes\nWireless (Dell 1510) |  | Yes\nWireless (Intel 5100) |  | Yes\nWireless (Intel 5300) |  | Yes\nBluetooth |  | Yes\n\nThis page is about setting up Arch Linux on the Dell Vostro 1320 laptop, which has replaced the former Dell Vostro 1310. Basically it runs just fine, although there are some things you should know. Furthermore it is advisable to read the article about laptops to get a idea about the topic in general.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "It is highly recommendable to setup Windows Vista first, because during the setup the region code of the DVD drive is set.\n\nIf you want to install Arch Linux over a wireless connection you have to setup the connection manually. Since kernel 2.6.24 and above are containing the appropriate drivers already, it should work with both the \"Netinstall ISO\" as well as the \"Core ISO\", although using the \"Netinstall ISO\" is the preferred install media for Arch Linux. Do not forget to choose the source \"net\" and the wlan interface (normally wlan0).\n\nApart from that you can follow the Installation guide, which should deliver you a good insight how to install Arch Linux.\n\nFurther attention has to be drawn during the partitioning, as Dell uses an uncommon partition table, which may you run into some trouble. You will get a \"FATAL ERROR\", whenever you try to partition \"/dev/sda\" using the setup. Therefore switch to another terminal (Ctrl + Alt + F2, for instance) and delete the partition table using \"fdisk /dev/sda\". Follow the program options. More instructions can be found in the man page or the help option (m). It is sufficient to delete all partitions (and writing the table to the disc), from there on you can use the setup in the first terminal again (Ctrl + Alt + F1).\n\n"
    },
    {
      "title": "CPU",
      "level": 2,
      "content": "See CPU frequency scaling.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "There is just a mono built-in speaker, do not wonder when you cannot balance the channel properly.\n\n"
    },
    {
      "title": "Fingerprint Reader",
      "level": 2,
      "content": "The Fingerprint Reader itself was not tested yet, but it should work following these steps.\n\n"
    },
    {
      "title": "Extra Keyboard Keys",
      "level": 2,
      "content": "Works using keytouchd. See Extra keyboard keys\n\n"
    },
    {
      "title": "Wireless",
      "level": 2,
      "content": "See Wireless network configuration.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "If your Vostro comes with Windows Vista installed (most of all), you need to update the Bluetooth driver in Windows Vista. Among other things, the driver changes the firmware of the module. Only after that Bluetooth will work under Linux.\n\n"
    },
    {
      "title": "Framebuffer",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nYou may experience some problems using the X server and console simultaneously, as soon as you work with different resolutions. In order to change the resolution of the console you should look at KMS. At the time of writing this page in 2009 adding vga=0x0361 to the /boot/grub/menu.lst worked.\n\n"
    },
    {
      "title": "Card Reader",
      "level": 3,
      "content": "Some cards may not be readable, in which case, dmesg will output the following lines:\n\n```\n[    8.790027] mmc0: error -110 whilst initialising SD card\n[    8.790764] sdhci-pci 0000:1a:00.1: Will use DMA mode even though HW doesn't fully claim to support it.\n```\n\nThis problem is easy to solve.Just add this line to your modprobe.conf\n\n```\noptions sdhci debug_quirks=0x40\n```\n\nThis will disable ADMA.\n\n"
    }
  ]
}