{
  "title": "Dell Inspiron 11 3000 (3162)",
  "url": "https://wiki.archlinux.org/title/Dell_Inspiron_11_3000_(3162)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWireless |  | Yes\nAudio |  | Yes\nTouchpad |  | Yes\nCamera |  | Yes\nCard Reader |  | Yes\nBluetooth |  | Yes\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "This laptop hides the \"Push XXX to enter setup\" message during boot.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Though the laptop does support booting from legacy devices, this causes serious video issues (you can not boot into the CLI with KMS enabled but disabling KMS prevents X from starting). Simply turning off the legacy boot option fixes this issue.\n\nWith \"Load Legacy Option Rom\" enabled the laptop screen would shut off while booting the install media and when booting the installed system unless KMS was disabled. Disabling KMS, however, prevents X from starting as, from what I have read, the xf86-video-intel driver requires KMS.\n\n"
    },
    {
      "title": "Keyboard",
      "level": 2,
      "content": "Most of the extra keys did not work for me after install. Some or all will work if you use a full desktop environment like Gnome or KDE though. I was able to configure my window manager to run appropriate commands when the extra keys are pressed. The Enable/Disable wireless key did work without any extra work on my part. However, the page up and page down keys (activated by pressing Fn + PageUp or PageDn) do not work as expected. After pressing and releasing them, the scrolling action will be glitched and will not stop. To fix this create the following hwdb:\n\n```\n/etc/udev/hwdb.d/90-custom-keyboard.hwdb\n```\n\n```\nevdev:atkbd:dmi:bvn*:bvr*:bd*:svnDell*:pnInspiron*3162:pvr*\n KEYBOARD_KEY_c7=!home\n KEYBOARD_KEY_cf=!end\n KEYBOARD_KEY_c9=!pageup\n KEYBOARD_KEY_d1=!pagedown\n```\n\nPay attention to formatting. This is the first reason why it may not work.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "With xf86-input-evdev as the only input driver, the touchpad will react like a disembodied touchscreen. Replacing xf86-input-evdev with xf86-input-libinput this caused the touchpad to work fine but the keyboard stopped working once I started X. With both xf86-input-evdev and xf86-input-libinput installed, the keyboard and touchpad both work fine.\n\nIf your touchpad stops working after suspend, it might be due to a problem with the i8042 module.\n\nTo make taps work as clicks on the touchpad this file has to be created (see libinput):\n\n```\n/etc/X11/xorg.conf.d/30-touchpad.conf\n```\n\n```\nSection \"InputClass\"\n    Identifier \"touchpad\"\n    Driver \"libinput\"\n    MatchIsTouchpad \"on\"\n    Option \"Tapping\" \"on\"\nEndSection\n```\n\n"
    }
  ]
}