{
  "title": "Developer",
  "url": "https://wiki.archlinux.org/title/Developer",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "ArchWiki differentiates two types of groups in order to independently define access levels and user roles. Compared to the convention, popular in other MediaWiki projects, where each role is represented by a group with its own set of rights, this approach is more flexible, allowing to fine-tune the access level for each user regardless of their roles.\n\n"
    },
    {
      "title": "Access levels",
      "level": 2,
      "content": "Access levels are groups with a non-empty set of granted rights: their purpose is to define the extent of the permissions that users have in the wiki.\n\nThe following access levels are assigned automatically by MediaWiki:\n\n- user is the default group for all users, which grants the basic read/write permissions.\n- autoconfirmed is a group for users with at least 20 edits and 3 days since their account creation [1]. Before these thresholds are reached, user actions are subject to some restrictions aimed at preventing spam attacks.\n\nThe following access levels can be assigned manually by a bureaucrat. Members of specific roles may request temporary or permanent assignment of these levels, for example following the acquisition or change of a role, or to address specifically-justified individual needs. Permanent assignments are possible only after internal discussion and approval by the Administrators.\n\n- privileged is a group for trusted community members with the purpose of allowing to edit most protected pages, such as those in the DeveloperWiki namespace.\n- cosysop is a group for users who have been trusted to partake in wiki maintenance. They are also able to edit most protected pages.\n- sysop is a group for highly trusted users who are responsible for critical wiki-administrative tasks like page deletion or user blocking, thus requiring the demonstration of extensive knowledge of how the wiki is organized. They also have all rights of the checkuser, interface-admin and suppress groups which are created automatically by MediaWiki.\n- bureaucrat is a group for sysops who can grant access levels and roles to other users.\n- bot is a group for ArchWiki:Bots.\n\n"
    },
    {
      "title": "Roles",
      "level": 2,
      "content": "Roles are groups with an empty set of granted rights: their purpose is to clarify the function of wiki users within the Arch community. In general, roles are not removed from users who may become inactive. The Administrators reserve the right to make per-user variations to the default access levels for each role.\n\n- Maintainers (maintainer) is a group for the ArchWiki:Maintenance Team members. All maintainers are given the cosysop access level by default. Maintainers with the sysop access level are called Administrators. There is also an Administrator fellows (administrator_fellow) group for retired Administrators.\n- Translators (translator) is a group for the most productive members of an ArchWiki Translation Team or individual translators.\n- Arch Linux Developers (archdev) is a group for Arch Developers. All Arch Linux Developers are given the privileged access level by default.\n- Arch Linux Package Maintainers (archpackager) is a group for Arch Package Maintainers.\n- Arch Linux Support Staff (archstaff) is a group for users with other roles within the Arch Linux community: The Arch Testing Team makes sure that packages submitted to the testing repositories are functional. The Arch Security Team tracks security issues with packages on security.archlinux.org. Forum moderators moderate the Arch Linux Forums. IRC channel operators moderate the main IRC channels.\n\n- All maintainers are given the cosysop access level by default. Maintainers with the sysop access level are called Administrators. There is also an Administrator fellows (administrator_fellow) group for retired Administrators.\n\n- All Arch Linux Developers are given the privileged access level by default.\n\n- The Arch Testing Team makes sure that packages submitted to the testing repositories are functional.\n- The Arch Security Team tracks security issues with packages on security.archlinux.org.\n- Forum moderators moderate the Arch Linux Forums.\n- IRC channel operators moderate the main IRC channels.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Original pull request\n\n"
    }
  ]
}