{
  "title": "Dhcpd",
  "url": "https://wiki.archlinux.org/title/Dhcpd",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Network configuration\n- Network tools\n\ndhcpd is the older ISC DHCP server.\n\nNote: **server** \n\n- dhcpd is no longer maintained. Internet Systems Consortium (ISC) promotes Kea as its official replacement.\n- dhcpd (DHCP server daemon) is not the same as dhcpcd (DHCP client daemon).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dhcp package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Assign a static IPv4 address to the interface you want dhcpd to listen on (here eth0). The specified subnet should not overlap with that of other interfaces:\n\n```\n# ip link set up dev eth0\n# ip addr add 139.96.30.100/24 dev eth0 # arbitrary address\n```\n\n- To have a static IP address assigned at boot, see Network configuration#Static IP address.\n- The RFC 1918 subnets are reserved for private networks and will not conflict with hosts on the Internet.\n\nThe default configuration file dhcpd.conf contains many uncommented examples, so relocate it:\n\n```\n# cp /etc/dhcpd.conf /etc/dhcpd.conf.example\n```\n\nTo only listen on the subnet 139.96.30.0/24, you may create the following minimal configuration file:\n\n```\n/etc/dhcpd.conf\n```\n\n```\noption domain-name-servers 8.8.8.8, 8.8.4.4;\noption subnet-mask 255.255.255.0;\noption routers 139.96.30.100;\nsubnet 139.96.30.0 netmask 255.255.255.0 {\n  range 139.96.30.150 139.96.30.250;\n}\n```\n\nThe options used in this configuration file are:\n\ndomain-name-servers which contains addresses of DNS servers supplied to the clients. Here we use Google's public DNS servers. If you have configured your own DNS server on a local machine, specify its address in your subnet (here 139.96.30.0/24).\n\nsubnet-mask and routers which define a subnet mask and a list of available routers on the subnet; routers also defines the default gateway served to the client. For small networks, you can usually use 255.255.255.0 as a mask and specify an IP address of the machine on which you are running dhcpd (here 139.96.30.100).\n\nsubnet which defines options for separate subnets that are applied to the network interfaces on which dhcpd is listening. Here we have defined the range of available IP addresses for a single subnet 139.96.30.0/24 (on a single interface eth0).\n\nFor a complete list of options, consult dhcpd.conf(5).\n\n"
    },
    {
      "title": "PXE",
      "level": 3,
      "content": "Preboot Execution Environment (PXE) configuration is done with the following two options:\n\n```\n/etc/dhcpd.conf\n```\n\n```\nnext-server 192.168.0.2;\nfilename \"/pxelinux.0\";\n```\n\nnext-server is the IP address of the TFTP server, and filename is the image to boot.\n\nThis section can either be in an entire subnet, or just in a host definition.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "dhcpd includes two unit files, dhcpd4.service and dhcpd6.service, which can be used to control the daemon. They start the daemon on all network interfaces for IPv4 and IPv6 respectively.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- ISC DHCP Documentation\n\n"
    }
  ]
}