{
  "title": "Dm-integrity",
  "url": "https://wiki.archlinux.org/title/Dm-integrity",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- dm-verity\n\nThe dm-integrity kernel device mapper target provides an additional layer with per-sector integrity information. In standalone mode it supports CRC (CRC-32, CRC-32C) or hash functions (xxHash64, SHA-1, SHA-256). It can also be used with dm-crypt to provide authenticated disk encryption with HMAC-SHA256. It uses journaling for guaranteeing write atomicity by default, which effectively halves the write speed.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "The main utility for standalone management is integritysetup, included in the cryptsetup package. The dm-integrity layer can also be activated and managed with the cryptsetup utility or with LVM. This section covers management in standalone mode.\n\n"
    },
    {
      "title": "Format",
      "level": 3,
      "content": "The underlying device/partition/volume has to be formatted and the initial integrity metadata written, which takes some time. The integrity algorithm algo can be one of crc32c, crc32, xxhash64, sha1 or sha256.\n\n```\n# integritysetup format -v --integrity algo /dev/device\n```\n\n"
    },
    {
      "title": "Open",
      "level": 3,
      "content": "A dm-integrity-protected volume is opened with:\n\n```\n# integritysetup open -v --integrity algo /dev/device volname\n```\n\nAfterwards the volume can be accessed through /dev/mapper/volname.\n\n"
    },
    {
      "title": "Close",
      "level": 3,
      "content": "After all contained filesystems are unmounted the volume is closed with:\n\n```\n# integritysetup close -v volname\n```\n\n"
    },
    {
      "title": "/etc/integritytab",
      "level": 3,
      "content": "The /etc/integritytab file can be set up to open specific volumes at system boot. See integritytab(5).\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- integritysetup(8)\n- cryptsetup(8)\n- dm-integrity kernel documentation\n\n"
    }
  ]
}