{
  "title": "Dma",
  "url": "https://wiki.archlinux.org/title/Dma",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Mail server\n\ndma (Dragonfly Mail Agent) is a tiny Mail Transport Agent (MTA). It is able to accept mails and deliver it to local or remote destinations; however, if you want to send and receive mails with your domain name, then you will need a full-featured mail server.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dma package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "dma has two main configuration files: /etc/dma/dma.conf contains main setup directives and /etc/dma/auth.conf is necessary for authentication on SMTP servers. dma provides sane defaults so you may be able to use it without special configuration for local mail delivery.\n\n"
    },
    {
      "title": "SMTP transport",
      "level": 3,
      "content": "If you want to route mail through external SMTP server you must set SMARTHOST address (also known as relay host) in /etc/dma/dma.conf:\n\n```\n/etc/dma/dma.conf\n```\n\n```\nSMARTHOST smtp-host\n```\n\nAlso do not forget to set authentication credentials in /etc/dma/auth.conf in the following format:\n\n```\n/etc/dma/auth.conf\n```\n\n```\nuser|smarthost.example.com:password\n```\n\nTo have dma actually use the credentials file, set AUTHPATH:\n\n```\n/etc/dma/dma.conf\n```\n\n```\nAUTHPATH /etc/dma/auth.conf\n```\n\nTo change default port set PORT directive (25 is default):\n\n```\n/etc/dma/dma.conf\n```\n\n```\n# accept mail from external MTAs (STARTTLS is also an option)\nPORT 25\n\n# accept mail from MUAs with TLS\nPORT 465\n\n# accept mail from MUAs (STARTTLS is also an option)\nPORT 587\n```\n\n"
    },
    {
      "title": "Encryption",
      "level": 3,
      "content": "SECURETRANSFER directive enables encryption during mail transfers. Depending on your needs uncomment STARTTLS to enable STARTTLS support and activate OPPORTUNISTIC_TLS to permit unencrypted fallback in case of error.\n\nFor whatever reason you may want to perform plain text SMTP authentication. In such case uncomment SECURE directive and change it to INSECURE explicitly.\n\n"
    },
    {
      "title": "Masquerading",
      "level": 3,
      "content": "If you want to substitute original From: field in envelope you can use MASQUERADE feature:\n\n```\n/etc/dma/dma.conf\n```\n\n```\n# send mails as user foo (hostname will be derived with gethostbyname() or set to MAILNAME directive)\nMASQUERADE foo@\n\n# send mails from host bar (username will be substituted)\nMASQUERADE bar\n\n# send mail as user foo from host bar\nMASQUERADE foo@bar\n```\n\n"
    },
    {
      "title": "Testing",
      "level": 3,
      "content": "To send test mail execute the following from command line:\n\n```\n$ mail -s \"Just a dma test\" foo@bar.example.com\nThis is just a small test message\n<Ctrl+D>\n```\n\nRun journalctl -r as root to see if all went good. Also you can check dma queue with:\n\n```\n$ dma -bp\n```\n\n/var/spool/dma directory also holds undelivered/unprocessed mails.\n\n"
    },
    {
      "title": "Prerequisites",
      "level": 4,
      "content": "If you use 2-Step Verification (also known as two-factor authentication) procedure then you should create so-called App Password.\n\nTo do that login into your Google Account, choose Security entry on the left panel and click on App Passwords in Signing in to Google panel. If you do not see this item please consult corresponding thread on Google.\n\nClick on Select app and choose desired application (usual called as Mail). Then click on Select device and choose the device, but it is better to add custom device and call it appropriately for easy future management. Then click on Generate and write down your App Password (16-character code in the yellow bar).\n\n"
    },
    {
      "title": "Configuration",
      "level": 4,
      "content": "```\n/etc/dma/dma.conf\n```\n\n```\nSMARTHOST smtp.gmail.com\nPORT 587\nAUTHPATH /etc/dma/auth.conf\nSECURETRANSFER\nSTARTTLS\nMASQUERADE username@gmail.com\n```\n\nThe MASQUERADE line ensures that mails sent by DMA appear to come from the specified user. Google will reject emails that do not come from the correct Google account.\n\n```\n/etc/dma/auth.conf\n```\n\n```\nusername@gmail.com|smtp.gmail.com:your-password\n```\n\n"
    },
    {
      "title": "Minimalistic configuration with \"null client\"",
      "level": 4,
      "content": "If your use case is \"all emails to be send to external mailbox(es) without any local delivery\", the following configuration:\n\n- Uses port 465 (TLS by default, always encrypted, no STARTTLS negotiation needed)\n- Sends everything to Google SMTP server, bypassing any local mboxes.\n\n```\n/etc/dma/dma.conf\n```\n\n```\nSMARTHOST smtp.gmail.com\nPORT 465\nAUTHPATH /etc/dma/auth.conf\nSECURETRANSFER\nMASQUERADE username@gmail.com\nNULLCLIENT\n```\n\n"
    }
  ]
}