{
  "title": "Dolphin emu",
  "url": "https://wiki.archlinux.org/title/Dolphin_emu",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Dolphin is a Nintendo GameCube and Wii emulator, currently supporting the x86_64 and AArch64 architectures. Dolphin is available for Linux, macOS, Windows, and Android. It is a free and open source, community-developed project. Dolphin was the first GameCube and Wii emulator, and currently the only one capable of playing commercial games.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dolphin-emu package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "While no additional configuration is needed for the emulator to run (it is preconfigured with the default settings), altering the settings can improve performance and graphics alike. Settings are split to three main sections, Config, Graphics and DSP.\n\n"
    },
    {
      "title": "Config section",
      "level": 3,
      "content": "On the General tab, check Enable Dual Core and Enable Idle Skipping. The frame limit should be set to \"Auto\", so that it works with games from all regions. The CPU emulation engine should be left as JIT Recompiler. Only check \"Force console as NTSC-J\" if intending to play imported Japanese discs.\n\nAll options on the \"Interface\" tab are personal choices.\n\nThe Audio tab is the DSP section's screen; setting it up now means there will be no need to do it later. See #DSP section.\n\nThe next two tabs are not very important; the GameCube tab has settings about connected accessories, such as memory cards, and the only remarkable Wii tab option is the \"Aspect Ratio\" drop-down list. Set it to either 16:9 or 4:3, depending on the display's aspect ratio.\n\nOn the final tab, \"Paths\", ISO directories can be set. The directory of game ISOs can also be set by clicking browse from the home screen, but here more options are available, such as Search Subfolders.\n\n"
    },
    {
      "title": "Graphics section",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nOn the \"General\" tab, choose OpenGL from the backend drop-down list for the currently most compatible renderer. Set the \"Display\" and \"Other\" settings to the desired configuration. V-sync is useful, but it can lead to slowdowns. The \"render to main window\" option improves the experience aesthetically.\n\nIf your graphics card supports Vulkan, using the Vulkan backend may give you higher performance than OpenGL. Note that the Vulkan backend might not be compatible with certain titles, so if you run into issues with a game, try switching back to OpenGL before giving up. The official compatibility list often has hints about how each renderer handles a title.\n\nOn the \"Enhancements\" tab are the options that can improve graphics. While they result to great output, they can slow the emulation down to the point of making games unplayable. Choose the best settings possible, as long as speed remains 100%.\n\nTable content:\nOption | Performance | Quality\nInternal resolution | 1x Native | Auto (Window size)\nAnti-aliasing | None | at least 2x\nAnisotropic filtering | 1x | at least 2x\nPost-Processing Effect | (off) | your choice(see tip below)\nScaled EFB copy | unchecked | checked\nPer-Pixel Lightning | unchecked | checked\nForce texture filtering,Widescreen Hack,Disable fog | off | your option(recommended: off)\n\nNote: **necessary** \n\nUnless sure, the Hacks tab is best left untouched.\n\nTable content:\nOption | Value\nSkip EFB access from CPU | unchecked\nIgnore format changes | checked\nEFB copies | texture\nTexture cache/ Accuracy | Fast\nExternal frame buffer | disable\nCache display lists | unchecked\nDisable destination alpha | unchecked\nOpenCL texture decoder | unchecked\nOpenMP texture decoder | unchecked\nFast depth calculation | checked(Should uncheck for anaglyph 3D)\nVertex streaming hack | unchecked\n\nSimilarly, unless sure, leave everything in the Advanced tab unchecked.\n\n"
    },
    {
      "title": "DSP section",
      "level": 3,
      "content": "Set the DSP emulation engine to\n\n- DSP HLE for speed over accuracy,\n- DSP LLE recompiler for better accuracy with the cost of some speed,\n- DSP LLE interpreter; accurate but makes everything unplayable. Too slow.\n\nDSP LLE on separate thread improves speed on computers with multi-core CPUs, but might cause audio glitches, and is known to break Zelda ucode games. Audio backend is best set to ALSA. For pulseaudio, Dolphin's optional dependency PulseAudio needs to be installed.\n\n"
    },
    {
      "title": "Playing",
      "level": 2,
      "content": "Note: **only** \n\nClick on browse to set a directory of ISOs so that they are shown as a library on Dolphin's default screen. Otherwise just click Open and select the file.\n\n"
    },
    {
      "title": "Dolphin's Wiki",
      "level": 3,
      "content": "Whenever a game does not work properly, try reading its page on Dolphin's wiki. Listed there are tips on setting up the emulator for each game, version compatibility charts, testing entries, troubleshooting and video previews. Contributions, such as testing entries and workarounds are welcome and help other users.\n\nHere is a xfce4-whiskermenu-plugin search action command for searching on Dolphin's wiki:\n\n```\nexo-open --launch WebBrowser https://wiki.dolphin-emu.org/index.php?search=%u\n```\n\n"
    },
    {
      "title": "Themes",
      "level": 2,
      "content": "To change the theme of Dolphin, place a css file in ~/.local/share/dolphin-emu/Styles directory. Then go to the interface tab in the options and check the Use Custom User Style box. Click on the User Style tab to change the theme.\n\n"
    },
    {
      "title": "Incompatibility with Wayland",
      "level": 3,
      "content": "Dolphin 5.0 is not compatible with Wayland. Force it to run as X11 application via this command:\n\n```\nQT_QPA_PLATFORM=xcb dolphin-emu\n```\n\n"
    },
    {
      "title": "Games play too fast",
      "level": 3,
      "content": "Make sure the framelimit is set to a proper value for the game's region; 60 for NTSC games or 50 for PAL ones. Auto is recommended. Avoid playing other media simultaneously with Dolphin.\n\n"
    },
    {
      "title": "Emulation is too slow",
      "level": 3,
      "content": "Double-check the CPU scaling governor. If using an NVidia graphics card, on nvidia-settings changing the powermizer setting to \"Prefer maximum performance\"; check its temperature to make sure the card does not overheat, though. Change Dolphin's priority using nice. Killing unnecessary processes and disabling compositing also helps. Configuring Dolphin correctly, as described above, is the most important part.\n\nMany systems have more than one GPU, like an integrated low-performance one by Intel and a dedicated graphics card. See PRIME on how to execute Dolphin on your dedicated GPU.\n\n"
    },
    {
      "title": "Games frequently stutter on first playthrough, but subsequent runs are smooth",
      "level": 3,
      "content": "This stutter is likely introduced because graphics rendering has to pause due to shader compilation. Dolphin has gained advanced techniques for minimizing such stutter, called Ubershaders. They require strong GPUs to work best and thus are not enabled by default. In the graphics configuration dialog under \"Shader Compilation\", try one of the options \"Synchronous (Ubershaders)\" or \"Asynchronous (Ubershaders)\". Hover over the radio buttons to see a more detailed explanation text in the dialog. Using the option \"Compile Shaders Before Starting\" may also reduce stutter, but at the cost of a longer delay before the game starts.\n\nSee also: Improving performance – most of the advice should be helpful.\n\n"
    },
    {
      "title": "Input is not detected after emulation window loses focus once",
      "level": 3,
      "content": "Enable Render to Main Window under Graphics Settings, or enable Background Input under Controller Settings.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:Dolphin (emulator)\n- Dolphin's performance guide.\n- Dolphin's FAQ\n- Dolphin's wiki entry for legally obtaining game dumps.\n\n"
    }
  ]
}