{
  "title": "Dosbox",
  "url": "https://wiki.archlinux.org/title/Dosbox",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "DOSBox is an x86 PC DOS-emulator for running old DOS games or programs.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dosbox package or dosbox-svnAUR for the development version. Alternatively, two forks can be installed:\n\n- dosbox-stagingAUR aims to modernize the codebase\n- dosbox-xAUR tries to emulate hardware much more accurately\n\nNote that vanilla DOSBox has not seen a new release since 2019, and some distributions ship dosbox-staging as the default. [1]\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "No initial configuration is needed, however the official DOSBox manual refers to a configuration file named dosbox.conf. By default that file exists in your ~/.dosbox folder.\n\nYou can also make a new configuration file on a per-application basis by copying dosbox.conf from ~/.dosbox to the directory where your DOS app resides and modifying the settings accordingly. You can also create a configuration file automatically: simply run dosbox without any parameters inside your desired application's folder:\n\n```\n$ dosbox\n```\n\nThen at the DOS prompt, type:\n\n```\nZ:\\> config -wc dosbox.conf\n```\n\nThe configuration file dosbox.conf will then be saved in the current directory. Go in a change whatever settings you need.\n\nThe configuration options are described in the official DOSBox wiki.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "A simple way to run DOSBox is to place your DOS game (or its setup files) into a directory and then run dosbox with the directory path appended. For example:\n\n```\n$ dosbox ./game-folder/\n```\n\nYou should now have a DOS prompt whose working directory is the one specified above. From there, you can execute the desired programs:\n\n```\nC:\\> SETUP.EXE\n```\n\n"
    },
    {
      "title": "Free DOSBox focus",
      "level": 3,
      "content": "If DOSBox traps your focus, use Ctrl+F10 to free it.\n\n"
    },
    {
      "title": "Play music in DOS games",
      "level": 3,
      "content": "To play music, some DOS games require a MIDI synthesizer which DOSBox does not emulate. However, DOSBox can use one if it is available. A software synthesizer such as FluidSynth or Timidity can be used if your computer does not have a hardware synthesizer.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- The official DOSBox website\n- DOSGames.com - large repository of DOS games.\n- Abandonia - large repository of old and abandoned DOS games.\n\n"
    }
  ]
}