{
  "title": "Duply",
  "url": "https://wiki.archlinux.org/title/Duply",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From duply.net:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Duply can be installed with the duplyAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "For an overview on how to use Duply, run duply usage.\n\nThe first thing to do is create a profile. Run duply my_profile create to create a profile named my_profile. Then configure the profile using the file ~/.duply/my_profile/conf.\n\nUse duply my_profile backup to make backups and duply my_profile restore restore_directory to restore after configuration is complete.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Set GPG_KEY to encrypt and sign the backup with a GPG key. Set the GPG_PW with the GPG passphrase. See #No GPG Passphrase for details on Duply prompting for the GPG passphrase. Set TARGET for the destination of the backup. Set SOURCE for the base location to backup. See the conf file for information on other Duply backup settings.\n\nExample:\n\n```\n~/.duply/my_profile/conf\n```\n\n```\nGPG_KEY='72AD0468'\nGPG_PW='password'\nTARGET='file://my_profile_backup'\nSOURCE='/tmp/important_files'\n```\n\nNow run duply my_profile backup to backup everything in /tmp/important_files. The first time duply my_profile backup the user will be prompted for the GPG passphrase so that the key can be exported for safe keeping. Afterwords, Duply should run without prompting for a passphrase.\n\nTo exclude files backed up, see the ~/.duply/my_profile/exclude file.\n\n```\n~/.duply/my_profile/exclude\n```\n\n```\n# Backup everything except this directory\n- **/less_important_files\n```\n\nOR\n\n```\n~/.duply/my_profile/exclude\n```\n\n```\n# Individual files\n+ /tmp/important_files/file1\n+ /tmp/important_files/file2\n\n# Exclude cache inside directory\n- /tmp/important_files/directory/cache\n+ /tmp/important_files/directory\n\n# Exclude everything else\n- **\n```\n\nDupicity exclude requires ** as to match the base directory.\n\n"
    },
    {
      "title": "No GPG Passphrase",
      "level": 3,
      "content": "Because of a bug in the Duply, duplicity will prompt for a GPG passphrase even though it is available from the gpg-agent. Simply pressing return during the prompt will work as the passphrase is not needed to use the key (if the key is cached), or the DUPL_PARAMS=\"$DUPL_PARAMS --use-agent\" line can be added to the conf.\n\n```\n~/.duply/my_profile/conf\n```\n\n```\n# Turn on --use-agent option no matter what\nDUPL_PARAMS=\"$DUPL_PARAMS --use-agent\"\n```\n\n"
    },
    {
      "title": "Signing fails using GPG version 2.1.0 or later",
      "level": 3,
      "content": "Due to changes in recent versions of GPG, this message may occur during backup process:\n\n```\nduply gpg: signing failed: Inappropriate ioctl for device\n```\n\nThis can be fixed by uncommenting GPG_OPTS section of Duply's conf file and adding --pinentry-mode loopback argument into it:\n\n```\n~/.duply/my_profile/conf OR /etc/duply/my_profile/conf (if running as root)\n```\n\n```\nGPG_OPTS='--pinentry-mode loopback'\n```\n\n"
    },
    {
      "title": "Backup configuration",
      "level": 2,
      "content": "It is important to backup the configuration for your profile so that the backup can be recovered. One way to do this automatically is to add a post script which tars the profile after a backup. For example:\n\n```\n~/.duply/my_profile/post\n```\n\n```\n#!/bin/bash\n\nprofile_name=$(basename $CONFDIR)\n\ntime=$(date +%s)\nbackup_file=\"$HOME/.duply/duply-$profile_name-\"$time\".tar.gz\"\n\n# Archive the profile in the ~/.duply directory.\ntar -zcvf $backup_file -C $HOME/.duply $profile_name\nchmod 600 $backup_file\n```\n\nCopy the *.tar.gz file to a secure storage location such as LastPass, KeePass, Bitwarden or an offline USB harddrive. Another option is to archive the profile on a piece of paper as QR code (duply_qr-gitAUR). The configuration file should accessible even if access is lost to the computer being backed up because the whole point of the backup is that it can be recovered even if the computer is lost or destroyed.\n\n"
    }
  ]
}