{
  "title": "DVB-S",
  "url": "https://wiki.archlinux.org/title/DVB-S",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- DVB-T\n- MythTV Walkthrough\n\nDVB-S is a satellite television standard. This article describes the setup and use of DVB-S cards on Arch Linux.\n\n"
    },
    {
      "title": "Load required kernel modules",
      "level": 2,
      "content": "You have to lookup the chipset of your specific card; tools like lshwdAUR may help you.\n\n"
    },
    {
      "title": "Pinnacle PCTV Sat",
      "level": 3,
      "content": "This card uses bt878 and cx24110 as chipset. These require the dvb-bt8xx and cx24110 kernel modules.\n\nLoad them with modprobe:\n\n```\n# modprobe dvb-bt8xx\n# modprobe cx24110\n```\n\nYou can load the module at boot to automate this step.\n\n"
    },
    {
      "title": "Additional modules: S2-liplianin",
      "level": 3,
      "content": "Some modules not included in the kernel are available from Igor M. Liplianin's git repository\n\n"
    },
    {
      "title": "Setup",
      "level": 4,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nFirst of all, you have to download and prepare the source code.\n\n```\n$ git clone https://github.com/crazycat69/szap-s2\n```\n\nTo clone the repository will need to install git or alternatively you can download the source code from https://github.com/crazycat69/szap-s2/archive/refs/heads/master.zip and extract it manually.\n\nAfter obtaining the code, change the working directory to the extracted folder:\n\n```\n$ cd s2-liplianin\n```\n\nUnfortunately not all modules of liplianin are compatible with recent kernels and cause some trouble if you want to compile them hence you have to exclude these modules from the build process (if you do not need them). You can choose which modules you want to build by executing:\n\n```\n$ make config\n```\n\nwhich will create a configuration file: v4l/.config.\n\nAfter that, you have to build the chosen modules:\n\n```\n$ make\n```\n\nIf all configured modules were compiled successfully, you can install the modules at the kernel's default modules directory by executing:\n\n```\n# make install\n```\n\nAfter that, reboot your machine.\n\n"
    },
    {
      "title": "Additional firmware: LibreELEC DVB-firmware",
      "level": 2,
      "content": "The LibreELEC project provides additional firmware files for various DVB devices, eg. TechniSat SkyStar S2. To use these firmware files you can install libreelec-dvb-firmware-gitAUR.\n\n"
    },
    {
      "title": "Setup permissions",
      "level": 2,
      "content": "To use your DVB-S card as user add it to the video group:\n\n```\n# gpasswd -a [username] video\n```\n\n"
    },
    {
      "title": "Scanning channels",
      "level": 2,
      "content": "Most applications like szap or xine are needing a channel list created by scan, which is part of dvb-utils. You will find the dvb-utils package under the name linuxtv-dvb-appsAUR.\n\n"
    },
    {
      "title": "Using scan",
      "level": 3,
      "content": "scan needs an channel to initialize scanning. In /usr/share/dvb/dvb-s/ are some files which contain these channels; you will need that one that fits the satellite you are watching from.\n\nThe following command will scan all channels and save them to channels.conf:\n\n```\n$ scan -x0 -t1 -s1 /usr/share/dvb/dvb-s/[your satellite] | tee channels.conf\n```\n\n- The channel file does not have to be called channels.conf but it is more convenient as you will see later.\n- Depending on your satellite dish setup you may have to try other arguments.\n\n"
    },
    {
      "title": "Using w_scan_cpp",
      "level": 3,
      "content": "w_scan_cppAUR allows for automatic scanning of channels without configuration. Install it then issue:\n\n```\n# w_scan_cpp -c [your country] > ~/someChannels.conf\n```\n\nAlternatively you can also scan using the satellite position like 19.5E for Astra 1. Scans like that can be done as follows:\n\n```\n# w_scan_cpp -fs -s S19E5 > ~/someChannels.conf\n```\n\nYou can also add the -X flag to generate tzap/czap/xine output instead of vdr output.\n\n```\n# w_scan_cpp -X -c AU > ~/AustraliaChannels.conf\n```\n\nTo get a file that can be loaded with VLC use the -L flag\n\n```\n# w_scan_cpp -L > ~/AustraliaChannels.conf\n```\n\n"
    },
    {
      "title": "DiSEqC switch scanning (AKA multiple satellite LNB)",
      "level": 4,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nIf you have a LNB with a DiSEqC switch in it you can manually select that using the -D option like so:\n\n```\n# w_scan -fs -s S23E5 -D 1c > ~/someChannels.conf\n```\n\nThe above line should work but not all found channels where actually saved. The line below worked perfectly for me:\n\n```\n# w_scan -fs -s S23E5 -a 0 -D 1c -o 7 -e 2 > ~/someChannels.conf\n```\n\n"
    },
    {
      "title": "Switching channels",
      "level": 2,
      "content": "By using zap, which comes with dvb-utils, you can switch channels, so you do not have to rely on the abilities of your player.\n\nszap needs the channel file we created earlier; it will try ~/.szap/channels.conf by default. You can move the channels.conf there or you can use the \"-c\" command-line option.\n\nSwitching channels works like this:\n\n```\n$ szap -r [channel]\n```\n\nYou can list all available channels with:\n\n```\n$ szap -q\n```\n\nNow you can watch the stream for example with xine:\n\n```\n$ xine -g stdin://mpeg2 < /dev/dvb/adapter0/dvr0\n```\n\nor with mplayer:\n\n```\n$ mplayer /dev/dvb/adapter0/dvr0\n```\n\nor with mplayer, but using DVB directly:\n\n```\n$ mplayer \"dvb://RTL Television\"\n```\n\nYou can find all the channel names by running szap -q (assuming the channel list is also in ~/.szap/channels.conf).\n\n"
    },
    {
      "title": "Kaffeine",
      "level": 3,
      "content": "Kaffeine is a really nice player; it supports EPG, time-shifting, and recording. Additionally Kaffeine has built-in channel-searching.\n\nInstall it with the kaffeine package.\n\n- More Information\n- Project page\n\n"
    },
    {
      "title": "Importing channel list",
      "level": 4,
      "content": "- Linosaw.de provides channels.conf[dead link 2021-11-07 ⓘ] files for VDR\n- conv2conf converts these files into kaffeine channel list format\n\n"
    },
    {
      "title": "Me-tv",
      "level": 3,
      "content": "Me-tv is a simple but powerfull dvb-viewer, supporting EPG, recording and channel-searching with a light-weight gui.\n\nInstall Me-tv with the me-tvAUR package.\n\n"
    },
    {
      "title": "Xine",
      "level": 3,
      "content": "Copy your channel file to ~/.xine/channels.conf.\n\nWatch a specific channel with following command:\n\n```\n$ xine dvb://[channel]\n```\n\nor use the playlist editor in Xine\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- TV Cards in general: Ubuntuusers.de-Wiki (German)\n- List of supported DVB-S/DVB-S2 devices\n\n"
    }
  ]
}