{
  "title": "Emuladores de Video game",
  "url": "https://wiki.archlinux.org/title/Emuladores_de_Video_game",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Um emulador é um programa que serve para replicar as funções de outra plataforma ou sistema, de modo a permitir que aplicativos e jogos sejam executados em ambientes para os quais não foram programados.\n\nNote: **ilegais** \n\n"
    },
    {
      "title": "Consoles",
      "level": 2,
      "content": "- Citra — Emulador de Nintendo 3DS.\n\n- DeSmuME — Emulador de Nintendo DS.\n\n- Dolphin — Emulador de GameCube e Wii.\n\n- epsxe — Emulador para o console de videogame PlayStation para hardware de PC baseado em x86.\n\n- FCEUX — NTSC e PAL emulador de 8 bits Nintendo / Famicom que é uma evolução do emulador original do FCE Ultra. É preciso, compatível e mantido ativamente.\n\n- Gambatte — Emulador de Game Boy Color.\n\n- Gens2 — Emulador de Sega Genesis, Sega CD e 32x escrito em linguagem assembly e não mais desenvolvido ativamente.\n\n- Ative o OpenGL, defina a resolução de vídeo por personalização para 1024x600 para tela cheia esticada ou 800x600 para não estriada;\n- use o renderizador \"Normal\", não consegui encontrar uma vantagem visível com os outros.\n\n- Gens-GS — Gens2, reescrito em C++, combinando recursos de vários forks do Gens.\n\n- gngeo — Emulador de Linha de comando do NeoGeo.\n\n- higan — Emulador multissistema com foco em precisão, suportando SNES, NES, GB, GBC, GBA.\n\n- mednafen — Emulador multissistema de Linha de comando.\n\n- Mupen64Plus — Emulador de Nintendo 64 altamente compatível com sistema de plugins.\n\n- Nestopia — Emulador de NES muito preciso.\n\n- pSX — Um emulador de PlayStation não baseado em plugins com alta compatibilidade.\n\n- PCSXR — Emulador de PlayStation; Fork do Debian do PCSX original abandonado.\n\n- PCSX2 — Emulador de PlayStation 2. Ainda está sendo mantido e desenvolvido. Requer arquivos BIOS.\n\n- PPSSPP — Emulador de PlayStation Portable(PSP).\n\n- RPCS3 — Emulador e depurador experimental open-source do Sony PlayStation 3.\n\n- Snes9x — Emulador de SNES.\n\n- Visual Boy Advance — Emulador de Game Boy com Game Boy Advance, Game Boy Color e suporte a Super Game Boy.\n\n- XQEMU — Um emulador de Xbox original.\n\n- Yuzu — Um emulador de código-aberto experimental de Nitendo Switch\n\n- ZSNES — Emulador de Super Nitendo(SNES) altamente compatível.\n\n"
    },
    {
      "title": "Outros",
      "level": 2,
      "content": "- DOSBox — Emulador de DOS de código aberto que se concentra principalmente na execução de jogos DOS.\n\n- DOSEmu — Emulador de código aberto de DOS.\n\n- MAME — Emulador de Arcade.\n\n- ResidualVM — Interpretador de jogos 3D multiplataforma que permite jogar as aventuras em 3D da LucasArts baseadas em Lua.\n\n- RetroArch — Frontend para o libretro (biblioteca de emulação, usando versões modificadas de emuladores existentes como plugins).\n\n- ScummVM — Máquina virtual para aventuras da velha escola .\n\n- X Neko Project II — Emulador de PC-9801.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Emulation General wiki\n- Wikipedia:List of video game console emulators\n\n"
    }
  ]
}