{
  "title": "Environnement de bureau",
  "url": "https://wiki.archlinux.org/title/Environnement_de_bureau",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Comparison of desktop environments\n- Category:Freedesktop.org\n- Window manager\n\nA desktop environment (DE) is an implementation of the desktop metaphor made of a bundle of programs, which share a common graphical user interface (GUI).\n\nA desktop environment bundles together a variety of components to provide common graphical user interface elements such as icons, toolbars, wallpapers, and desktop widgets. Additionally, most desktop environments include a set of integrated applications and utilities. Most importantly, desktop environments provide their own window manager, which can however usually be replaced with another compatible one.\n\nThe user is free to configure their GUI environment in any number of ways. Desktop environments simply provide a complete and convenient means of accomplishing this task. Note that users are free to mix-and-match applications from multiple desktop environments. For example, a Plasma user may install and run GNOME applications such as the Epiphany web browser, should they prefer it over KDE Konqueror web browser. One drawback of this approach is that many applications provided by desktop environment projects rely heavily upon the libraries underlying the respective desktop environment. As a result, installing applications from a range of desktop environments will require installation of a larger number of dependencies. Users seeking to conserve disk space often avoid such mixed environments, or choose alternatives which do depend on only few external libraries.\n\nFurthermore, applications provided by desktop environments tend to integrate better with their native environments. Superficially, mixing environments with different widget toolkits will result in visual discrepancies (that is, interfaces will use different icons and widget styles). In terms of usability, mixed environments may not behave similarly (e.g. single-clicking versus double-clicking icons; drag-and-drop functionality) potentially causing confusion or unexpected behavior.\n\n"
    },
    {
      "title": "Officially supported",
      "level": 3,
      "content": "- Budgie — Budgie is a desktop environment designed with the modern user in mind, it focuses on simplicity and elegance.\n\n- Cinnamon — Cinnamon strives to provide a traditional user experience. Cinnamon is a fork of GNOME 3.\n\n- COSMIC — COSMIC is a Rust based desktop environment created by System76 for Pop! OS, inspired by highly customized GNOME. Still in alpha.\n\n- Cutefish — Cutefish is a new and modern desktop environment.\n\n- Deepin Desktop Environment — Deepin desktop interface and applications feature an intuitive and elegant design. Moving around, sharing and searching etc. has become simply a joyful experience.\n\n- Enlightenment — The Enlightenment desktop shell provides an efficient window manager based on the Enlightenment Foundation Libraries along with other essential desktop components like a file manager, desktop icons and widgets. It supports themes, while still being capable of performing on older hardware or embedded devices.\n\n- GNOME — The GNOME desktop environment is an attractive and intuitive desktop with both a modern (GNOME) and a classic (GNOME Classic) session.\n\n- GNOME Flashback — GNOME Flashback is a shell for GNOME 3 which was initially called GNOME fallback mode. The desktop layout and the underlying technology is similar to GNOME 2.\n\n- KDE Plasma — The KDE Plasma desktop environment is a familiar working environment. Plasma offers all the tools required for a modern desktop computing experience so you can be productive right from the start.\n\n- LXDE — The Lightweight X11 Desktop Environment is a fast and energy-saving desktop environment. It comes with a modern interface, multi-language support, standard keyboard short cuts and additional features like tabbed file browsing. Fundamentally designed to be lightweight, LXDE strives to be less CPU and RAM intensive than other environments.\n\n- LXQt — LXQt is the Qt port and the upcoming version of LXDE, the Lightweight Desktop Environment. It is the product of the merge between the LXDE-Qt and the Razor-qt projects: A lightweight, modular, blazing-fast and user-friendly desktop environment.\n\n- MATE — Mate provides an intuitive and attractive desktop to Linux users using traditional metaphors. MATE started as a fork of GNOME 2, but now uses GTK 3.\n\n- Pantheon — Pantheon is the default desktop environment originally created for the elementary OS distribution. It is written from scratch using Vala and the GTK3 toolkit. With regards to usability and appearance, the desktop has some similarities with GNOME Shell and macOS.\n\n- Phosh — Phosh is a Wayland shell user interface based on GNOME, useful on mobile devices.\n\n- Sugar — The Sugar Learning Platform is a computer environment composed of Activities designed to help children from 5 to 12 years of age learn together through rich-media expression. Sugar is the core component of a worldwide effort to provide every child with the opportunity for a quality education — it is currently used by nearly one-million children worldwide speaking 25 languages in over 40 countries. Sugar provides the means to help people lead fulfilling lives through access to a quality education that is currently missed by so many.\n\n- UKUI — UKUI is a lightweight Linux desktop environment, developed based on GTK and Qt. UKUI is the default desktop environment for Ubuntu kylin.\n\n- Xfce — Xfce embodies the traditional UNIX philosophy of modularity and re-usability. It consists of a number of components that provide the full functionality one can expect of a modern desktop environment, while remaining relatively light. They are packaged separately and you can pick among the available packages to create the optimal personal working environment.\n\n"
    },
    {
      "title": "Unofficially supported",
      "level": 3,
      "content": "- CDE — The Common Desktop Environment is a desktop environment for Unix and OpenVMS, based on the Motif widget toolkit. It was part of the UNIX98 Workstation Product Standard, and was long the \"classic\" Unix desktop associated with commercial Unix workstations. Despite being a legacy environment, it is still kept alive with support for Linux systems as well.\n\n- EDE — The \"Equinox Desktop Environment\" is a desktop environment designed to be simple, extremely light-weight and fast.\n\n- Liri — Liri is a desktop environment with modern design and features. Liri is the merge between Hawaii, Papyros and the Liri Project. Highly experimental.\n\n- Lumina — Lumina is a lightweight desktop environment written in Qt 5 for FreeBSD that uses Fluxbox for window management.\n\n- MaXX Interactive Desktop — The MaXXdesktop is designed from the ground up for speed, fast/responsive, lightweight/simplicity over eye-candidness\n\n- Maui Shell — Maui Shell is a convergent shell for desktops, tablets, and phones.\n\n- Moksha — Fork of Enlightenment currently used as default desktop environment in Ubuntu-based Bodhi Linux, with optional modules.\n\n- Orbitiny Desktop — is a new, 100% portable, innovative and traditional but modern looking desktop environment for Linux\n\n- PaperDE — Desktop environment built on top of Qt/Wayland and wayfire.\n\n- plainDE — A lightweight GNU/Linux desktop environment written in Qt. As for now, includes panel and control center.\n\n- Plasma Mobile — Plasma Mobile is a mobile focused desktop environment built on the KDE Plasma stack and Wayland.\n\n- theDesk — theDesk is a desktop environment that tries to be as transparent as possible. It uses Qt 5 as its widget toolkit and KWin as its window manager.\n\n- Trinity — The Trinity Desktop Environment (TDE) project is a computer desktop environment for Unix-like operating systems with a primary goal of retaining the overall KDE 3.5 computing style.\n\n"
    },
    {
      "title": "Use a different window manager",
      "level": 2,
      "content": "If the desktop environment has an article, see its Use a different window manager section, otherwise consult the official documentation.\n\n- Budgie#Use a different window manager\n- Cinnamon#Use a different window manager\n- GNOME#Use a different window manager\n- Plasma#Use a different window manager\n- LXDE#Use a different window manager\n- LXQt#Use a different window manager\n- MATE#Use a different window manager\n- Xfce#Use a different window manager\n\n"
    },
    {
      "title": "Custom environments",
      "level": 2,
      "content": "Desktop environments represent the simplest means of installing a complete graphical environment. However, users are free to build and customize their graphical environment in any number of ways if none of the popular desktop environments meet their requirements. Generally, building a custom environment involves selection of a suitable window manager or compositor, a taskbar and a number of applications (a minimalist selection usually includes a terminal emulator, file manager, and text editor).\n\nOther components usually provided by desktop environments are:\n\n- Application launcher\n- Audio control\n- Backlight control\n- Compositor\n- Default applications\n- Display manager\n- Logout dialogue\n- Media control\n- Notification daemon\n- Polkit authentication agent\n- Power management\n- Screen capture\n- Screen locker\n- Screen temperature\n- Wallpaper setter\n\n"
    }
  ]
}