{
  "title": "Eve V (2017)",
  "url": "https://wiki.archlinux.org/title/Eve_V_(2017)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad | 0603:00f1 | Yes\nKeyboard | 0603:00f1 | Yes\nWebcam | ov2680 and ov2685 [1][dead link 2024-10-12 ⓘ] | No\nBluetooth | 8087:0a2b | Yes\nAudio | 8086:9d71 | Yes\nWireless | 8086:24fd | Yes\nTouchscreen | 04f3:2513 | Yes\nDigitizer Pen | 04f3:2513 | Yes\nAccelerometer | KIOX000A:00 | Yes\nAmbient Light Sensor | CPLM3218:00 | Untested\n\nNote: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThe Eve V is a crowd-sourced tablet computer from 2017. A 2021 version is in the works[dead link 2024-10-12 ⓘ], but this page is about the old one. The author uses the i7-7Y75 (1.30GHz) version (SKU EMWT02I60P01Cfg00EVEORD0 in dmidecode), and there is also an i5 version. These machines are fanless (completely silent), using the aluminum case to dissipate heat.\n\n"
    },
    {
      "title": "USB, Thunderbolt, microSD",
      "level": 2,
      "content": "There are 2 type-C ports and 2 type-A ports, working fine in Linux. The lower Thunderbolt (type C) port seems to work better for adding an external monitor via a Type C to HDMI adapter (preferably one that also has ethernet, since that's not built-in). The microSD adapter (in a depressed area on the back side) works fine too.\n\n"
    },
    {
      "title": "Screen and graphics",
      "level": 2,
      "content": "The LCD is 2880x1920, 260x174mm (so DPI about 225). Intel integrated graphics drivers work fine. With Mesa 22 you get support for OpenGL 4.6 and Vulkan.\n\n"
    },
    {
      "title": "IIO sensors",
      "level": 2,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nThe iio packages are useful (iio-sensor-proxy, iioutils etc.) and you need libad9361-iio-gitAUR[broken link: package not found]. If you run screenrotator-gitAUR you can get your X11 desktop to rotate according to the physical orientation of the machine.\n\n"
    },
    {
      "title": "Keyboard and touchpad",
      "level": 2,
      "content": "The combination bluetooth/pogo-pin keyboard cover is infamously fragile; but if it's working, the touchpad also works and supports multi-finger gestures. The pogo pinout is reported to be USB (not confirmed): [4][dead link 2024-10-12 ⓘ] [5][dead link 2024-10-12 ⓘ]\n\n"
    },
    {
      "title": "Touchscreen and stylus",
      "level": 2,
      "content": "On X11, the libinput driver works fine for both: you get up to 10 touchpoints, pressure-sensitive drawing with the included stylus, and a side button on the stylus for the eraser. The stylus is the nTrig type. If you lose the original, a Wacom Bamboo Ink stylus also works OK.\n\n"
    },
    {
      "title": "Links",
      "level": 2,
      "content": "- Eve V 2017 forum[dead link 2024-10-12 ⓘ], including pre-release design discussions and newer threads\n- Thread about Linux support[dead link 2024-10-12 ⓘ]\n- Arch Linux article on the Dough wiki[dead link 2024-10-12 ⓘ]\n\n"
    }
  ]
}