{
  "title": "Extra Keyboard Keys",
  "url": "https://wiki.archlinux.org/title/Extra_Keyboard_Keys",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "This article assumes you have read Keyboard input.\n\nMany keyboards include some special keys (also called hotkeys or multimedia keys), which are supposed to execute an application or print special characters (not included in the standard national keymaps). udev contains a large database of mappings specific to individual keyboards, so common keyboards usually work out of the box. If you have very recent or uncommon piece of hardware, you may need to adjust the mapping manually.\n\n"
    },
    {
      "title": "Apple MacBooks",
      "level": 3,
      "content": "All the required information is available on the Apple Keyboard dedicated article.\n\n"
    },
    {
      "title": "Asus M series",
      "level": 3,
      "content": "In order to have control over the light sensor and the multimedia keys on your Asus machine, you should use the following command:\n\n```\n# echo 1 > /sys/devices/platform/asus_laptop/ls_switch\n```\n\nTo have it run on boot create a Systemd tmpfile:\n\n```\n/etc/tmpfiles.d/local.conf\n```\n\n```\nw /sys/devices/platform/asus_laptop/ls_switch - - - - 1\n```\n\n"
    },
    {
      "title": "Asus N56VJ (or possibly others)",
      "level": 3,
      "content": "If most of your special keys do not work, try loading the asus-nb-wmi kernel module with\n\n```\n# modprobe asus-nb-wmi\n```\n\nthen check xev again. If you combine this with the acpi_osi=\"!Windows 2012\" boot option, you may get weird results in xev, so try not using it. If this did fix things, make sure to make the module load at boot with methods described in Kernel modules#Automatic module loading.\n\n"
    },
    {
      "title": "Lenovo T460p (or possibly others)",
      "level": 3,
      "content": "Out of the box, the backlight keys (on F5, F6) might not be available, even via the /dev/input interface. To fix this, follow Backlight#Kernel command-line options.\n\n"
    },
    {
      "title": "Gaming Keyboards",
      "level": 2,
      "content": "Gaming keyboards have some special features which may cause them to \"misbehave\" in Linux.\n\n"
    },
    {
      "title": "Cooler Master CM Storm QuickFire TK",
      "level": 3,
      "content": "This keyboard has two features that could cause confusion in Linux: N-Key Rollover and the Win-Lock Key.\n\nN-Key Rollover can cause problems with the Function keys. To disable N-key rollover, hold down the FN lock key (next to right-ctrl) until it lights up, then hold Escape and press 6 to switch to 6-key rollover. Hold down the FN lock key to disable the Fn lock.\n\nThe Win-Lock Key completely disables the Super (Windows) keys. Simply press the FN lock key and F12 together to toggle Win-Lock on and off.\n\n"
    },
    {
      "title": "Corsair K series keyboards",
      "level": 3,
      "content": "There is a winlock button on these keyboards that can disable the use of the Super (Windows) keys. This button is located at the top right of the keyboard next to the num and capslock buttons. CKB can be used to disable this functionality entirely preventing further locking. However, in a default state, simply pressing the button would enable the Super (Windows) keys again.\n\n"
    },
    {
      "title": "Logitech G series G710 and 710+",
      "level": 3,
      "content": "This keyboard has a row of 6 programmable G keys. In order to use them as intended by Logitech, you need to install sidewinderdAUR and start sidewinderd.service.\n\n"
    },
    {
      "title": "Logitech G613",
      "level": 3,
      "content": "This keyboard has a row of 6 programmable G keys. In order to use them as intended by Logitech, you need to install solaar. Within solaar, you will be able to divert the G-Key functions and remap them.\n\n"
    },
    {
      "title": "Logitech MX",
      "level": 3,
      "content": "These keyboards have special keys such as Snipping Tool, Mic Mute that does not produce key codes. Using solaar, you can divert these keys and remap them.\n\n"
    },
    {
      "title": "Royal Kludge RK61 and possibly other Apple keyboards",
      "level": 3,
      "content": "Some Apple keyboards (including the Royal Kludge RK61) have the function F1–F12 keys defaulted to mac media keys. If no Fn Lock is available, this is the only available behavior unless the default Apple Keyboard behavior is changed. In order to remedy this, make sure the keyboard is being identified as an Apple keyboard using the following command:\n\n```\n# lsusb | grep \"Apple.*Keyboard\"\n```\n\nProceed to Apple Keyboard#Function keys do not work if an Apple Keyboard is found.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- LQWiki:Configuring keyboards#Enabling Keyboard Multimedia Keys\n\n"
    }
  ]
}