{
  "title": "Fbterm",
  "url": "https://wiki.archlinux.org/title/Fbterm",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- KMSCON\n\nFbterm (Frame buffer terminal emulator) is standalone replacement of Linux kernel terminal that can function outside of graphical environments. It was previously hosted at Google Code, https://code.google.com/archive/p/fbterm/, and it is since 2020 maintained by Debian.\n\nIt provides support for fontconfig (and draws text with freetype2, same as Qt/Gtk based GUI applications), up to 10 windows with a scroll-back history for each, auto-detect text encoding with current locale, double width scripts like Chinese, Japanese and more: see https://salsa.debian.org/debian/fbterm/-/blob/master/README.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the fbtermAUR package. Pay attention to the instructions and minor changes by the included patches.\n\nAfter installation, to be able to use fbterm as a non-root user add yourself to the video user group.\n\nTo enable keyboard shortcuts for non-root users, use setcap to give fbterm the cap_sys_tty_config capability.\n\n```\n# setcap cap_sys_tty_config+ep /usr/bin/fbterm\n```\n\n"
    },
    {
      "title": "Configuration file",
      "level": 3,
      "content": "The user configuration file is located in $XDG_CONFIG_HOME/fbterm/fbtermrc. The global /etc/fbterm/fbtermrc.example is well commented and serves as a good starting point.\n\n"
    },
    {
      "title": "Fonts",
      "level": 3,
      "content": "Fbterm uses fontconfig for a list of fonts, trying each sequentially until it is able to render the characters.\n\nTo change the fonts that are used, use the --font-names option to select favorites from the list given by fc-list.\n\n"
    },
    {
      "title": "Input method support",
      "level": 3,
      "content": "Fbterm supports diverse input methods by acting as a client for an independent input method framework server. Several such programs are available, see Internationalization#Input method.\n\n"
    },
    {
      "title": "As a non-graphical environment",
      "level": 3,
      "content": "In the late 2010's, developments in the Linux ecosystem and its framebuffer capabilities, together with cheap and powerful hardware (standard mainstream graphical cards) made things that were difficult in the past possible, and without too much customization or hacking:\n\n- 256 colorschemes support\n- display of CJK web pages and documents\n- access to a much wider variety of TTF fonts\n\nIn addition to the modern capabilities of the framebuffer, for example:\n\n- Watching movies with mpv (e.g. with --vo=gpu)\n- Screenshots and screencasts with (ex: fbgrab, fbdump)\n- PDF and other complex documents display with (ex: fbpdf, jfbview, fbgs)\n- Previewing pictures in the ranger file manager (w3mimgdisplay support)\n- Running some heavy GUI QT Platform applications (ex: qutebrowser, maps)\n\nFbterm with other modern text-centric tools make an environment without the concept of windows possible. Combined usage of fbterm with a terminal multiplexer like tmux allows for a very powerful desktop alternative mimicking the use of a window manager. Some examples of this advanced usage from Arch users:\n\n- https://github.com/xlucn/dotfiles - Examples of a dwm alike desktop with fbterm and tmux\n- https://github.com/xlucn/fbterm - Some patch examples\n- https://github.com/ivanp7/sweet-home - Custom wallpapers, use with tmux and fbi\n\n"
    },
    {
      "title": "Background image",
      "level": 3,
      "content": "To use a background image, Fbterm can be set to take a screen shot of the frame buffer device when it starts.\n\nThe following script (using the fbvAUR image viewer) is recommended in the man page:\n\n```\n#!/bin/bash\n# fbterm-bi: a wrapper script to enable background image with fbterm\n# usage: fbterm-bi /path/to/image fbterm-options\necho -ne \"\\e[?25l\" # hide cursor\nfbv -ciuker \"$1\" << EOF\nq\nEOF\nshift\nexport FBTERM_BACKGROUND_IMAGE=1\nexec /bin/fbterm \"$@\"\n```\n\n"
    },
    {
      "title": "White font color",
      "level": 3,
      "content": "By default, fbterm displays the \"white\" text as a gray color, even using the -f 7 switch. It's possible to get a real white color by doing an echo once inside fbterm, like this:\n\n```\necho -en \"\\e]P7ffffff\"\n```\n\n"
    }
  ]
}