{
  "title": "FireHOL",
  "url": "https://wiki.archlinux.org/title/FireHOL",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "FireHOL is a language (and a program to run it) to build secure, stateful firewalls from easy to understand, human-readable configuration files. The configuration stays readable even for very complex setups. In the background it interfaces with iptables (IPv4/IPv6).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install fireholAUR or firehol-gitAUR.\n\n"
    },
    {
      "title": "Initial Auto Configuration",
      "level": 3,
      "content": "Firehol comes with its own firewall wizard. All traffic is allowed by default. Using the wizard is the first step to get a basic firewall configuration which automatically detects all open port and interfaces running on the system.\n\n```\n# firehol wizard > /tmp/firehol.conf\n```\n\nThe configuration is well documented. After finishing editing move it to /etc/firehol/firehol.conf. Then test run it with the command\n\n```\n# firehol try\n```\n\nYou have 30 seconds before those changes are undone and if everything works as expected, you can make it permanent by starting and enabling firehol.service\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nA good way to start learning its scripting declarations is by copying an Firehol example configuration.\n\nThe configuration file is bash file and has 3 parts:\n\n- helper\n- interface\n- router\n\n"
    },
    {
      "title": "Try, Run and Enable",
      "level": 2,
      "content": "You can test the configuration file's correctness by issuing:\n\n```\n# firehol try\n```\n\nor\n\n```\n# firehol nofast try\n```\n\nIf the configuration is working, start/enable the firehol.service.\n\n- The package also includes FireQOS, a helper for Advanced traffic control. It is packaged with its own fireqos.service.\n- The netdata (or netdata-gitAUR) application for traffic monitoring, created by the same project authors, also is available. See Netdata for more information.\n\n"
    }
  ]
}