{
  "title": "Font packaging guidelines",
  "url": "https://wiki.archlinux.org/title/Font_packaging_guidelines",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "32-bit – CLR – CMake – Cross – DKMS – Eclipse – Electron – Font – Free Pascal – GNOME – Go – Haskell – Java – KDE – Kernel modules – Lisp – Meson – MinGW – Node.js – Nonfree – OCaml – Perl – PHP – Python – R – Ruby – Rust - Security – Shell – VCS – Web – Wine\n\nThis document covers proposed standards and guidelines on writing PKGBUILDs for Fonts.\n\n"
    },
    {
      "title": "Package naming",
      "level": 3,
      "content": "- TTF fonts: ttf-fontname\n- OTF fonts: otf-fontname\n\nIf the font is a variable font, add the suffix -variable.\n\n- The package name should be entirely lowercase.\n- Ultimately there is no hard rule for font package naming, i.e. these are only guidelines. In general, package naming follows upstream. See also FS#77425.\n\n"
    },
    {
      "title": "Package description",
      "level": 3,
      "content": "The package description should at least contain the word font and what type of font it is: sans-serif, serif or monospace.\n\n"
    },
    {
      "title": "Architecture",
      "level": 3,
      "content": "Fonts are architecture-independent. Use arch=(any).\n\n"
    },
    {
      "title": "Dependencies",
      "level": 3,
      "content": "Fonts do not depend on anything. Many packages in the repositories, however, include fontconfig and xorg-mkfontscale as dependencies. Those were required when font packages needed to use install scripts to update the font cache – a lot of duplicate work now done by pacman hooks. If you install fontconfig or xorg-mkfontscale, all existing fonts in /usr/share/fonts/ will be cached making it unnecessary to force people to use fontconfig or mkfontscale.\n\n"
    },
    {
      "title": "Provides",
      "level": 3,
      "content": "Many applications rely on the virtual package ttf-font. If your font family meets the criteria, add provides=('ttf-font').\n\n"
    },
    {
      "title": "Source",
      "level": 3,
      "content": "See whether a font is available from the following sources in this order:\n\n- a code hosting platform like GitHub or an official website\n- github.com/google/fonts (you should download individual files instead of cloning the repository, see ttf-roboto-mono for an example)\n- Font Squirrel, Font Library, FFonts, 1001 Fonts, 1001 Free Fonts, DaFont\n\nThe following sites are not recommended:\n\n- fonts.google.com (it no longer provides stable download URLs)\n- FontSpace (checksums change for unknown reasons)\n\n"
    },
    {
      "title": "Package",
      "level": 2,
      "content": "The following snippet is an example for an OTF font released under the SIL Open Font License 1.1 with Reserved Font Name:\n\n```\nlicense=('OFL-1.1-RFN')\n...\npackage() {\n  install -Dm644 -t \"$pkgdir/usr/share/fonts/$pkgname\" \"path/to/font/*.otf\"\n  install -Dm644 -t \"$pkgdir/usr/share/licenses/$pkgname\" \"path/to/license/OFL.txt\"\n}\n```\n\n- The OFL is technically a custom license, so each font package's license file needs to be installed under /usr/share/licenses/$pkgname.\n- If the font contains many font files, consider using $pkgname instead of OTF for the destination directory.\n\n"
    },
    {
      "title": "Example packages",
      "level": 2,
      "content": "- ttf-merriweather-sansAUR\n- otf-commissionerAUR – split package with OTF, TTF and variable version\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Forum discussion concerning this article\n\n"
    }
  ]
}