{
  "title": "Foot",
  "url": "https://wiki.archlinux.org/title/Foot",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Foot is a fast, lightweight and minimalistic Wayland terminal emulator.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the foot package or foot-gitAUR for the development version.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "foot loads configuration file at $XDG_CONFIG_HOME/foot/foot.ini (defaulting to $HOME/.config/foot/foot.ini). A template for the configuration file can be found in /etc/xdg/foot/foot.ini, copy the template to $XDG_CONFIG_HOME/foot/foot.ini and uncomment the setting you want to change. Restart foot to apply the new settings.\n\nManual page foot.ini(5) provides detailed information on how to configure foot.\n\n"
    },
    {
      "title": "Colors",
      "level": 3,
      "content": "You can customize colors by modifying [colors] section.\n\nThemes can be found in /usr/share/foot/themes. To apply a theme, add an include key under [main].\n\n```\n$HOME/.config/foot/foot.ini\n```\n\n```\n[main]\ninclude=/usr/share/foot/themes/name-of-theme\n```\n\n"
    },
    {
      "title": "Server (daemon) mode",
      "level": 3,
      "content": "- Advantages to run foot in server mode including reduced memory footprint and startup time.\n- The downside is a performance penalty; all windows' input and output are multiplexed in the same thread (but each window will have its own set of rendering threads). This means that if one window is very busy with, for example, producing output, then other windows will suffer. Also, should the server process crash, all windows will be gone.\n\nWhen run normally, foot starts a new foot process for each window.\n\nfoot can also be run in a server mode. In this mode, one process hosts multiple windows. All Wayland communication, VT parsing and rendering is done in the server process.\n\nNew windows are opened by running footclient, which remains running until the terminal window is closed, at which point it exits with the exit value of the client process (typically the shell).\n\nEnable/start the user unit foot-server.service or the corresponding foot-server.socket for socket activation to start the foot server automatically on login.\n\n"
    },
    {
      "title": "Show borders",
      "level": 4,
      "content": "Currently, GNOME does not support server side decoration on Wayland. foot running on GNOME will show a plain and flat window. You can configure foot to show borders so that different foot windows can be distinguished more easily.\n\n```\n$HOME/.config/foot/foot.ini\n```\n\n```\n[csd]\nborder-width=2\nborder-color=ff404040\n```\n\n"
    },
    {
      "title": "foot-server is not started after login",
      "level": 3,
      "content": "The foot-server.service and foot-server.socket units require graphical-session.target, but Sway does not set it automatically. So create a sway-session.target unit and start it whenever Sway started by following the steps in Sway#Manage Sway-specific daemons with systemd.\n\n"
    }
  ]
}