{
  "title": "Freeswitch",
  "url": "https://wiki.archlinux.org/title/Freeswitch",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The FreeSWITCH telephony engine is a powerful system enabling voice, video, presence, chat, and other media types via a variety of protocols.\n\n"
    },
    {
      "title": "Installing",
      "level": 2,
      "content": "Install the 'release' version with freeswitchAUR.\n\nYou may wish to configure FreeSWITCH build options. Edit the PKGBUILD and change build configuration options to suit your desired usage.\n\n"
    },
    {
      "title": "Configuring",
      "level": 2,
      "content": "The FreeSWITCH configuration files with the custom modules.conf and modules.conf.xml reside in /etc/freeswitch. For following FreeSWITCH documentation, the base directory is /var/lib/freeswitch (generally seen as /usr/local/freeswitch in FreeSWITCH documentation).\n\nFreeSWITCH comes out of the box with a default password for registrations to users 1000-1019 as '1234'. You are advised to change this before running it. This variable is set in /etc/freeswitch/vars.xml. The overall default configuration given is a kitchen sink featured PBX, likely many more things than are typically used. Customizing the PBX (or non-PBX) features of FreeSWITCH is beyond the scope of this document; see the FreeSWITCH Wiki for in-depth documentation.\n\nUpstream documentation as well as the original conf/ directory are provided in /usr/share/doc/freeswitch.\n\n"
    },
    {
      "title": "Running",
      "level": 2,
      "content": "Startup options are configured in /etc/conf.d/freeswitch.conf. You may wish to add -nonat if you are not behind nat, see freeswitch --help for a full list of command line options.\n\nFreeSWITCH can be started using the freeswitch.service.\n\nTo start FreeSWITCH upon each boot, enable freeswitch.service. You will need to use the -nc and -nf options to the freeswitch command line to keep it running in the foreground as supervisors expect.\n\n"
    },
    {
      "title": "Testing",
      "level": 2,
      "content": "- Fire up a SIP Client\n- Register to your FreeSWITCH box as user 1000, password what you set as default_password in vars.xml\n- Dial 9196 (You should connect to an Echo Test)\n- To measure call capacity, you can use StarTrinity SIP Tester (see an example performance report for 2250 G.711 channels)\n\n"
    },
    {
      "title": "Hints",
      "level": 2,
      "content": "To see interesting things you can do with a dialplan, open up /etc/freeswitch/dialplan/default.xml and scroll through those examples. Dialing the numbers that match the 'expression' of a condition from your SIP client will demonstrate their use.\n\nYou can dial into the FreeSWITCH public voice conference, for instance, by dialing 9888 (8k codec), 91616 (16k codec), or 93232 (32k codec)\n\nFreeSWITCH support is available in #freeswitch on Libera Chat.\n\n"
    }
  ]
}