{
  "title": "Gajim",
  "url": "https://wiki.archlinux.org/title/Gajim",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nGajim is a full featured and easy to use XMPP client.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install one of the following:\n\n- gajim - Latest release\n- gajim-gitAUR - Latest commit to master\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Gajim is a Graphical User Interface (GUI), all configuration is done through the interface under preferences, you can access this via the top left gajim drop down, and selecting preferences or using the Ctrl+p shortcut.\n\nWithin the Preferences menu, you can find the following configuration categories:\n\n- General - General behaviour of the client, such as how it should behave when closed.\n- Chats - General behaviour of chat windows, such as allowing you to disable status change notifications, or join/leave messages.\n- Notification - General behaviour of notifications within the client, allowing you to enable/disable audible notifications.\n- Status - General configuration of notifications, such as automatic status changes invoked by events such as inactivity for a certain period of time.\n- Style - Configuration of the client theme.\n- Audio/Video - Configuration of Audio and Video call support, such as NAT traversal and input devices (microphone and camera).\n- Advanced - Settings aimed towards more advanced users, allowing purging of message history, changing client proxy settings, and enabling/disabling debug logging\n\n"
    },
    {
      "title": "D-Bus remote control",
      "level": 3,
      "content": "To enable D-Bus remote control support, go to Advanced menu within Preferences and enable D-Bus Interface, then restart gajim.\n\n"
    },
    {
      "title": "Show/hide roster",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nIf you would like to be able to show/hide the roster using a script or your window manager, you can use the following command:\n\n```\n$ gajim-remote toggle_roster_appearance\n```\n\nIt may be necessary to restart Gajim if this does not work.\n\n"
    },
    {
      "title": "OMEMO support",
      "level": 3,
      "content": "OMEMO Multi-End Message and Object Encryption is an XMPP Extension Protocol (XEP) for secure multi-client end-to-end encryption. It is an open standard based on Axolotl and PEP and Gajim implemented it.\n\n"
    },
    {
      "title": "Notification sounds",
      "level": 3,
      "content": "1. Install the gsound package.\n1. Enable notification sound under Notifications within the Preferences menu, then enable the Play Sounds setting.\n\n"
    },
    {
      "title": "Audio and video call support",
      "level": 3,
      "content": "To use Gajim's Audio / Video Call feature, install the optdepends with the \"for video and audio calls\" description.\n\n"
    },
    {
      "title": "Minimize or close to tray",
      "level": 3,
      "content": "By default Gajim remains in the taskbar (for Docks) instead of minimizing to tray when closing it, to disable this behavior enable the hide_on_roster_x_button preference.\n\n"
    },
    {
      "title": "Save history of messages",
      "level": 3,
      "content": "If the Save of Message History is enabled, a file ~/.local/share/gajim/logs.db is created. This is a SQLite database. (Open it with DB Browser for SQLite, install sqlitebrowser) To look for a message, first get the jid_id of the contact in table jids. Click on Tab \"Search Data\". Choose Table jids. Now click the tab \"Run SQL\" and run the statement\n\n```\nSELECT time, kind, message FROM logs WHERE jid_id=(the jid_id from table jids) ORDER BY time ASC;\n```\n\nand click the run button. The result ist a list of your messages orderd by time (first message first, latest message at the bottom). The column kind shows if the message was sent (Code: 6) or received (Code: 4).\n\n"
    },
    {
      "title": "Fix dark theme",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Dark mode switching#Applications.** This article or section is a candidate for merging with Dark mode switching#Applications.\n\nThis article or section is a candidate for merging with Dark mode switching#Applications.\n\nWhen switching to dark mode in the Preferences does not work, set gtk-theme-name=Adwaita and gtk-application-prefer-dark-theme=1 in .config/gtk-3.0/settings.ini.\n\n"
    },
    {
      "title": "Fix emojis",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nThe emojis is Gajim require the Noto font. You need to install noto-fonts and noto-fonts-emoji to fix this.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Gajim Documentation\n\n"
    }
  ]
}