{
  "title": "Gamemode",
  "url": "https://wiki.archlinux.org/title/Gamemode",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- MangoHud\n\nGameMode is a daemon and library combo for Linux that allows games to request a set of optimisations be temporarily applied to the host OS and/or a game process.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install gamemode and lib32-gamemode.\n\nAdd yourself to the gamemode user group. Without it, the GameMode user daemon will not have rights to change CPU governor or the niceness of processes.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "GameMode is configured via the following files, which are read and then merged in the following order:\n\n1. /etc/gamemode.ini for system-wide configuration;\n1. $XDG_CONFIG_HOME/gamemode.ini for user-local configuration;\n1. ./gamemode.ini for directory-local configuration.\n\n"
    },
    {
      "title": "Renicing",
      "level": 3,
      "content": "GameMode can optionally adjust the priority of game processes (see renice(1)) to beyond the regular user lower limit of 0.\n\nThis is controlled by the following configuration option:\n\n```\n[general]\nrenice=0\n```\n\nUnlike renicing a process with the renice command, GameMode uses a positive value and negates it before applying it to the process, ie, a value of 10 will renice the game process to -10.\n\n"
    },
    {
      "title": "Overclocking",
      "level": 3,
      "content": "GameMode can optionally overclock your GPU when it is running, but requires special configuration on part of the user.\n\nIndependently of the used GPU, the apply_gpu_optimizations and gpu_device configuration options must be set appropriately.\n\n"
    },
    {
      "title": "AMD",
      "level": 4,
      "content": "To alter the performance level of AMD GPUs, overclocking must be manually enabled, and the amd_performance_level configuration option must be set.\n\n"
    },
    {
      "title": "NVIDIA",
      "level": 4,
      "content": "To alter the performance level of NVIDIA GPUs, overclocking must be manually enabled, and the nv_powermizer_mode, nv_core_clock_mhz_offset, and the nv_mem_clock_mhz_offset configuration options must be set.\n\n"
    },
    {
      "title": "Test configuration",
      "level": 3,
      "content": "Verify if the settings in the configuration file are working:\n\n```\n$ gamemoded -t\n```\n\n"
    },
    {
      "title": "Run a single game",
      "level": 3,
      "content": "To run a game with GameMode start it like this:\n\n```\n$ gamemoderun ./game\n```\n\n"
    },
    {
      "title": "Use with MangoHud",
      "level": 4,
      "content": "See MangoHud#Use with GameMode\n\n"
    },
    {
      "title": "Verify that GameMode is running",
      "level": 3,
      "content": "When you have started your game you can verify that GameMode is running with the command:\n\n```\n$ gamemoded -s\n```\n\n"
    },
    {
      "title": "Run a single Steam game",
      "level": 3,
      "content": "To make Steam start a game with GameMode, right click the game in the Library, select Properties..., then in the Launch Options text box enter:\n\n```\ngamemoderun %command%\n```\n\n"
    },
    {
      "title": "Run Steam with GameMode",
      "level": 3,
      "content": "To avoid having to change launch options for all Steam games, you may launch Steam directly with GameMode:\n\n```\n$ gamemoderun steam-runtime\n```\n\nThe downside of this approach is that GameMode will be running for as long as the Steam process is open, instead of only when a game is opened.\n\n"
    },
    {
      "title": "Renicing fails when set to less than -10",
      "level": 3,
      "content": "By default, GameMode provides PAM limits that allow changing the scheduling priority up to a maximum of -10. If the renice setting in the configuration file is set to an unsupported value, renicing of the process will fail entirely.\n\nYou can adjust the requested value or adjust the maximum scheduling priority GameMode can set by editing /etc/security/limits.d/10-gamemode.conf. The example below configures -19 as the maximum scheduling priority GameMode can set:\n\n```\n/etc/security/limits.d/10-gamemode.conf\n```\n\n```\n@gamemode - nice -19\n```\n\n"
    }
  ]
}