{
  "title": "Gestionnaire d'affichage",
  "url": "https://wiki.archlinux.org/title/Gestionnaire_d%27affichage",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Xinit (Français)#Démarrage automatique de X à la connexion\n\nUn gestionnaire d'affichage, ou gestionnaire de connexion, est typiquement une interface utilisateur graphique qui est affichée à la fin du processus de démarrage à la place du shell par défaut. Il existe différentes implémentations des gestionnaires d'affichage, tout comme il existe différents types de gestionnaires de fenêtres et d'environnements de bureau. Il y a généralement une certaine quantité de personnalisation et de thématisation disponible avec chacun d'eux.\n\n"
    },
    {
      "title": "Console",
      "level": 3,
      "content": "- CDM — Gestionnaire de connexion écrit en Bash.\n\n- Console TDM — Extension pour xinit écrite en Bash pur.\n\n- nodm — Gestionnaire d'affichage pour les connexions automatiques (non maintenu depuis 2017).\n\n- Ly — TUI (ncurses-like) gestionnaire d'affichage pour Linux et BSD. Prend en charge les sessions X et Wayland.\n\n- tbsm — Un lanceur de session ou d'application Bash. Prend en charge les sessions X et Wayland (non maintenu depuis 2018).\n\n- emptty — Simple gestionnaire d'affichage CLI sur TTY avec prise en charge de X et Wayland.\n\n"
    },
    {
      "title": "Graphique",
      "level": 3,
      "content": "- Entrance — Le gestionnaire de connexion d'Enlightenment.\n\n- GDM — Le gestionnaire de connexion de GNOME.\n\n- LightDM — Gestionnaire d'affichage multi-bureau, peut utiliser divers frontaux écrits dans n'importe quelle boîte à outils.\n\n- LXDM — Le gestionnaire de connexion de LXDE. Peut être utilisé indépendamment de l'environnement de bureau LXDE.\n\n- SDDM — Gestionnaire d'affichage basé sur QML et successeur de KDM ; recommandé pour KDE et LXQt.\n\n- XDM — X gestionnaire d'affichage avec prise en charge de XDMCP, sélecteur d'hôte.\n\n"
    },
    {
      "title": "Daemons de connexion",
      "level": 3,
      "content": "- greetd — Daemon de connexion qui prend en charge des greeters en console et en mode graphique.\n\n"
    },
    {
      "title": "Chargement du gestionnaire d'affichage",
      "level": 2,
      "content": "Pour activer la connexion graphique, activez le service systemd approprié. Par exemple, pour SDDM, activez sddm.service.\n\nCela devrait fonctionner par défaut. Sinon, vous devrez peut-être réinitialiser un lien symbolique personnalisé default.target pour qu'il pointe vers la graphical.target par défaut. Consultez Systemd (Français)#Changer la cible par défaut pour le démarrage.\n\nAprès avoir activé SDDM, un lien symbolique display-manager.service doit être défini dans /etc/systemd/system/. Vous devrez peut-être utiliser --force pour remplacer les anciens liens symboliques.\n\n```\n$ file /etc/systemd/system/display-manager.service\n```\n\n```\n/etc/systemd/system/display-manager.service: symbolic link to /usr/lib/systemd/system/sddm.service\n```\n\n"
    },
    {
      "title": "Utilisation de systemd-logind",
      "level": 3,
      "content": "Afin de vérifier l'état de votre session utilisateur, vous pouvez utiliser loginctl. Toutes les actions polkit comme la suspension du système ou le montage de disques externes fonctionneront d'emblée.\n\n```\n$ loginctl show-session $XDG_SESSION_ID\n```\n\n"
    },
    {
      "title": "Configuration de la session",
      "level": 2,
      "content": "De nombreux gestionnaires d'affichage lisent les sessions disponibles dans le répertoire /usr/share/xsessions/. Ce répertoire contient les desktop entry files standard pour chaque environnement de bureau ou gestionnaire de fenêtres. Certains gestionnaires d'affichage utilisent un répertoire séparé /usr/share/wayland-sessions/ pour lister les sessions spécifiques à Wayland.\n\nPour ajouter/supprimer des entrées dans la liste de sessions de votre gestionnaire d'affichage, créez/supprimez les fichiers .desktop dans /usr/share/xsessions/ comme vous le souhaitez. Un fichier .desktop typique ressemblera à quelque chose comme :\n\n```\n[Desktop Entry]\nName=Openbox\nComment=Log in using the Openbox window manager (without a session manager)\nExec=/usr/bin/openbox-session\nTryExec=/usr/bin/openbox-session\nIcon=openbox.png\nType=Application\n```\n\n"
    },
    {
      "title": "Exécuter ~/.xinitrc en tant que session",
      "level": 3,
      "content": "L'installation de xinit-xsessionAUR fournira une option pour exécuter votre xinitrc en tant que session. Il suffit de définir xinitrc comme session dans les paramètres de votre gestionnaire d'affichage et de s'assurer que le fichier ~/.xinitrc est exécutable.\n\n"
    },
    {
      "title": "Lancement d'applications sans gestionnaire de fenêtres",
      "level": 3,
      "content": "Vous pouvez également lancer une application sans aucune décoration, ni bureau, ni gestion de fenêtre. Par exemple, pour lancer google-chromeAUR, créez un fichier web-browser.desktop dans /usr/share/xsessions/ comme ceci :\n\n```\n[Desktop Entry]\nName=Web Browser\nComment=Use a web browser as your session\nExec=/usr/bin/google-chrome --auto-launch-at-startup\nTryExec=/usr/bin/google-chrome --auto-launch-at-startup\nIcon=google-chrome\nType=Application\n```\n\nDans ce cas, lorsque vous vous connectez, l'application définie avec Exec sera lancée immédiatement. Lorsque vous fermez l'application, vous revenez au gestionnaire de connexion (comme lorsque vous vous déconnectez d'un environnement de bureau normal ou d'un gestionnaire de fenêtres).\n\nIl est important de se rappeler que la plupart des applications graphiques n'ont pas été conçues pour être lancées de cette manière et qu'il se peut que vous ayez des ajustements manuels à faire ou des limitations avec lesquelles vivre (il n'y a pas de gestionnaire de fenêtres, donc ne vous attendez pas à pouvoir déplacer ou redimensionner aucune fenêtre, y compris les boîtes de dialogue ; néanmoins, vous pourrez peut-être définir la géométrie des fenêtres dans les fichiers de configuration de l'application).\n\nConsultez également Xinit (Français)#Démarrer des applications sans gestionnaire de fenêtres.\n\n"
    },
    {
      "title": "Démarrage automatique",
      "level": 3,
      "content": "La plupart des gestionnaires d'affichage ont pour source /etc/xprofile, ~/.xprofile et /etc/X11/xinit/xinitrc.d/. Pour plus de détails, consultez xprofile.\n\n"
    },
    {
      "title": "Définir la langue de la session utilisateur",
      "level": 3,
      "content": "Pour les gestionnaires d'affichage qui utilisent AccountsService, la locale de la session utilisateur peut être définie en modifiant:\n\n```\n/var/lib/AccountsService/users/$USER\n```\n\n```\n[User]\nLanguage=your_locale\n```\n\noù your_locale est une valeur telle que en_GB.UTF-8.\n\nVous pouvez également réaliser cette opération en utilisant D-Bus : busctl call org.freedesktop.Accounts /org/freedesktop/Accounts/User$UID org.freedesktop.Accounts.User SetLanguage s your_locale\n\nDéconnectez-vous et reconnectez-vous pour que les changements prennent effet.\n\n"
    }
  ]
}