{
  "title": "Gitosis",
  "url": "https://wiki.archlinux.org/title/Gitosis",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Gitosis is a tool which provides access control and remote management for hosted Git repositories. It allows for fine-grained management of read and write access over SSH, without requiring that the users have local system accounts on the server. To do this, it sets up a single system account git which is then used for all Git access.\n\nGitosis provides installation instructions in its README file. This guide is based on those instructions.\n\n"
    },
    {
      "title": "Installation and setup",
      "level": 2,
      "content": "Install the gitosis-gitAUR package from the AUR. This will create three things:\n\n- the git user\n- the git group to which this user belongs\n- the /srv/gitosis directory, which will hold data and repositories for Gitosis\n\nTo configure Gitosis, you do not edit files directly on the server. Instead, Gitosis provides a Git repository which contains the configuration. To update this configuration, you clone, commit, and push to gitosis-admin just as you would with any other repository.\n\nSince Gitosis uses SSH keys to authenticate users, you will need to generate a keypair to use for the administrative repository. If you do not have one, you can generate it using ssh-keygen, for example:\n\n```\n$ ssh-keygen -t rsa\n```\n\nYou can now initialize the administrative repository.\n\n```\n$ sudo -H -u git gitosis-init < /path/to/public_key.pub\nInitialized empty Git repository in /srv/gitosis/repositories/gitosis-admin.git/\nReinitialized existing Git repository in /srv/gitosis/repositories/gitosis-admin.git/\n```\n\nNote: The cause of this might be that the git home directory was not set properly. Fix it by setting it manually:\n\n```\nOSError: [Errno 13] Permission denied: '//gitosis'\n```\n\nThe cause of this might be that the git home directory was not set properly. Fix it by setting it manually:\n\n```\n# usermod -d /srv/gitosis git\n```\n\nIn addition, this command creates the directory /srv/gitosis/repositories in which the actual hosted repositories will be stored.\n\nAfter the initialisation of the admin repository is complete, it might be sensible to disable the password based ssh login of the user git.\n\n```\n/etc/ssh/sshd_config\n```\n\n```\nMatch User git\nPasswordAuthentication no\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "As mentioned above, Gitosis is configured by pushing commits to the gitosis-admin repository. To clone this repository (using Gitosis!), run:\n\n```\n$ git clone git@your.git.server:gitosis-admin.git\n```\n\nInside the gitosis-admin repository, you will see two things:\n\n- gitosis.conf – configuration file for Gitosis and repository permissions\n- keydir – directory containing public keys for each user\n\nTo modify repositories or users, or to configure Gitosis, just commit changes in your clone and push them back to the server.\n\n"
    },
    {
      "title": "Repositories and permissions",
      "level": 3,
      "content": "You will be able to find some example configuration files in /usr/share/doc/gitosis.\n\n```\n[gitosis]\ngitweb = yes\n\n[repo foobar]\ndescription = Git repository for foobar\nowner = user\n\n[group devs]\nmembers = user1 user2\n\n[group admins]\nmembers = user1\n\n[group gitosis-admin]\nwritable = gitosis-admin\nmembers = @admins\n\n[group foobar]\nwritable = foobar\nmembers = @devs\n\n[group myteam]\nwritable = free_monkey\nmembers = jdoe\n\n[group deployer]\nwritable = free_monkey\nreadonly = monkey_deployer\n```\n\nThis defines a new group called \"free_monkey\", which is an arbitrary string. \"jdoe\" is a member of myteam and will have write access to the \"gitosis\" repository. The \"monkey_deployer\" key will have only read-only access to \"free_monkey\".\n\nSave this addition to gitosis.conf, commit and push it:\n\n```\n$ git commit -a -m \"Allow jdoe write access to free_monkey\"\n$ git push\n```\n\nNow the user \"jdoe\" has access to write to the repository named \"free_monkey\", but we still have not created a repository yet. What we will do is create a new repository locally, initialize it on the Git server, and then push it:\n\n```\n$ mkdir free_monkey\n$ cd free_monkey\n$ git init\n$ git remote add origin git@YOUR_SERVER_HOSTNAME:free_monkey.git\n```\n\nDo some work, git add and commit files\n\n```\n$ git push origin master:refs/heads/master\n```\n\nWhen using SSH, the last command will fail with the error message \"does not appear to be a Git repository\" This can be fixed by initializing the repository manually on the server\n\n```\n$ git init --bare /srv/gitosis/repositories/free_monkey.git\n```\n\nand retry the last command\n\nWith the final push, you are off to the races. The repository \"free_monkey\" has been created on the server (in /srv/gitosis/repositories) and you are ready to start using it like any ol' Git repository.\n\nGitosis repositories can also be used with gitweb; just point the directory that contains the repository inside the gitweb configuration.\n\n"
    },
    {
      "title": "Adding users",
      "level": 3,
      "content": "The next natural thing to do is to grant a lucky few commit access to the FreeMonkey project. This is a simple two step process.\n\nFirst, gather their public SSH keys, which I will call \"alice.pub\" and \"bob.pub\", and drop them into keydir/ of your local gitosis-admin repository. Second, edit gitosis.conf and add them to the \"members\" list.\n\n```\n$ cd gitosis-admin\n$ cp ~/alice.pub keydir/\n$ cp ~/bob.pub keydir/\n$ git add keydir/alice.pub keydir/bob.pub\n```\n\nNote that the key filename must have a \".pub\" extension.\n\ngitosis.conf changes:\n\n```\n[group myteam]\nmembers = jdoe alice bob\nwritable = free_monkey\n```\n\nCommit and push:\n\n```\n$ git commit -a -m \"Granted Alice and Bob commit rights to FreeMonkey\"\n$ git push\n```\n\nThat's it. Alice and Bob can now clone the free_monkey repository like so:\n\n```\n$ git clone git@YOUR_SERVER_HOSTNAME:free_monkey.git\n```\n\nAlice and Bob will also have commit rights.\n\n"
    },
    {
      "title": "Public access",
      "level": 3,
      "content": "If you are running a public project, you will have your users with commit rights, and then you will have everyone else. How do we give everyone else read-only access without fiddling with SSH keys?\n\nWe just use git-daemon. This is independent of Gitosis and it comes with Git itself.\n\n```\n[git]$ git-daemon --base-path=/srv/gitosis/repositories/ --export-all\n```\n\nThis will make all the repositories you manage with Gitosis read-only for the public. Someone can then clone FreeMonkey like so:\n\n```\n$ git clone git://YOUR_SERVER_HOSTNAME/free_monkey.git\n```\n\nTo export only some repositories and not others, you need to touch git-daemon-export-ok inside the root directory (e.g. /srv/gitosis/repositories/free_monkey.git) of each repository that you want public. Then remove \"--export-all\" from the git-daemon command above.\n\n"
    },
    {
      "title": "More tricks",
      "level": 3,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\ngitosis.conf can be set to do some other neat tricks. Open example.conf in the Gitosis source directory (where you originally cloned Gitosis way at the top) to see a summary of all options. You can specify some repositories to be read-only (opposite of writable), but yet not public. A group members list can include another group. And a few other tricks that I will leave it to the reader to discover.\n\nCaveats\n\nIf /srv/gitosis/.gitosis.conf on your server never seems to get updated to match your local copy (they should match), even though you are making changes and pushing, it could be that your post-update hook is not executable. Older versions of setuptools can cause this. Be sure to fix that.\n\nIf your Python goodies are in a non-standard location, you must additionally edit post-update and put an \"export PYTHONPATH=...\" line at the top. Failure to do so will give you a Python stack trace the first time you try to push changes within gitosis-admin.\n\nIf you want to install Gitosis in a non-standard location, I do not recommend it. It is an edge case that the author has not run up against until I bugged him to help me get it working.\n\nFor the brave, you need to edit whatever file on your system controls the default PATH for a non-login, non-interactive shell. On Ubuntu this is /etc/environment. Add the path to gitosis-serve to the PATH line. Also insert a line for PYTHONPATH and set it to your non-standard Python site-packages directory. As an example, this is my /etc/environment:\n\n```\n$ PATH=\"/home/$(whoami)/sys/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/bin/X11:/usr/games\"\n$ PYTHONPATH=/home/$(whoami)/sys/lib/python2.4/site-packages\n```\n\nBe sure to logout and log back in after you make these changes.\n\nDo not use the gitosis-init line I have above for the standard install, instead use this slightly modified one:\n\n```\n$ sudo -H -u git env PATH=$PATH gitosis-init < /tmp/id_rsa.pub\n```\n\nBe sure to also set PYTHONPATH in your post-update hook as described above.\n\nThat *should* do it. I am purposefully terse with this non-standard setup as I think not many people will use it.\n\n"
    },
    {
      "title": "Non-standard SSH port",
      "level": 3,
      "content": "If you run SSH on a non-standard port on your server, there are two ways of specifying on which port Git will try to connect. One is to explicitly state that you are using the SSH protocol, as this lets you put in a port number in the URL too:\n\n```\ngit clone ssh://git@myserver.com:1234/repo.git\n```\n\nOr you can put this in your ~/.ssh/config file:\n\n```\n$ Host myserver.com\n$ Port 1234\n```\n\n- [repo] blocks are used to define some necessary areas being used with gitweb.\n- [group] blocks are used for both: defining user groups defining repository permissions\n- @ is used to define user groups.\n\n- defining user groups\n- defining repository permissions\n\nYou should commit and push any changes you do in this file.\n\n"
    },
    {
      "title": "keydir",
      "level": 3,
      "content": "keydir is simply a directory that contains public keys of the users. Some of the keys can be in the form of user@machine and those keys must be defined with that form inside gitosis.conf. It is better to create user groups and use them as members of the repositories. Once you add new keys to enable some new users, you should add the files to the Git repository and commit and push them. The new users will use the above form of Git commands like you have used to clone the gitosis-admin repository.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Gitosis source\n- Gitolite – an alternative to Gitosis which provides many similar features\n- Girocco – Git hosting code used on repo.or.cz\n- GitLab – a free git repository management application based on Ruby on Rails and Gitolite.\n\n"
    }
  ]
}