{
  "title": "GNOME Risoluzione dei problemi",
  "url": "https://wiki.archlinux.org/title/GNOME_Risoluzione_dei_problemi",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\n"
    },
    {
      "title": "Shell che si blocca",
      "level": 2,
      "content": "In caso di blocco della Shell (che potrebbe essere causato da alcune modifiche all'aspetto, estensioni malfunzionanti o forse una mancanza di memoria disponibile) riavviare la Shell premendo Alt+F2 e quindi immettendo 'r' potrebbe non essere possibile.\n\nIn questo caso, prova a passare a un altro TTY ( 'Ctrl' + 'Alt' + 'F2' ) e inserisci il seguente comando: pkill -HUP gnome-shell . Potrebbero essere necessari alcuni secondi prima che Shell si riavvii correttamente. Su X11 riavviare la shell in questo modo non dovrebbe disconnettere l'utente ma è una buona idea cercare di assicurarsi che tutto il lavoro sia salvato comunque; su Wayland (attualmente l'impostazione predefinita) il riavvio della shell interrompe l'intera sessione, quindi tutto andrà perso.\n\nSe questo fallisce, il server Xorg dovrà essere riavviato da: pkill X per gli accessi alla console o: systemctl restart gdm per gli accessi GDM. Tieni presente che il riavvio del server Xorg disconnetterà l'utente quindi cerca di assicurarti che tutto il lavoro sia salvato prima di tentare questo.\n\n"
    },
    {
      "title": "Shell segfaults",
      "level": 2,
      "content": "Se riscontri la scomparsa e la ricomparsa di gnome-shell, significa che ha subito un segfault (probabilmente a causa di un'estensione). Le estensioni di Gnome-shell utilizzano javascript; per abilitare il debug delle estensioni, è necessario\n\n1) ricostruisci gjs con le seguenti modifiche al PKGBUILD:\n\n```\n--- PKGBUILD (old)\n+++ PKGBUILD (new)\n@@ -29,10 +29,13 @@\n build() {\n   cd $pkgname\n+  export CXXFLAGS='-g -O0'\n+  export CPPFLAGS='-D_FORITFY_SOURCE=0'\n   ./configure \\\n+    --enable-debug-symbols=-gdwarf-2 \\\n     --prefix=/usr \\\n     --libexecdir=/usr/lib \\\n     --disable-static \\\n     --enable-compile-warnings=yes \\\n     --with-xvfb-tests\n   sed -i -e 's/-shared/-Wl,-O1,--as-needed\\0/g' libtool\n   make\n }\n```\n\n2) ricostruisci js78[broken link: package not found] con le seguenti modifiche al PKGBUILD:\n\n```\n--- PKGBUILD (old)\n+++ PKGBUILD (new)\n@@ -24,0 +25 @@\n+options=(debug)\n@@ -36,11 +37,9 @@\n build() {\n   unset CPPFLAGS\n   CFLAGS+=' -fno-delete-null-pointer-checks -fno-strict-aliasing -fno-tree-vrp -flto=3'\n   CXXFLAGS+=' -fno-delete-null-pointer-checks -fno-strict-aliasing -fno-tree-vrp -flto=3'\n   export CC=gcc CXX=g++ PYTHON=/usr/bin/python2\n \n   cd mozilla-unified/js/src\n   sh configure \\\n     --prefix=/usr \\\n-    --disable-debug \\\n-    --disable-debug-symbols \\\n```\n\nUna volta installati i pacchetti gjs e js78 e riavviato gnome-shell (Alt+F2+r), ogni volta che gnome-shell va in crash i simboli di debug saranno disponibili .\n\nDopo il crash:\n\n```\n$ coredumpctl -1\n```\n\n```\nTIME                            PID   UID   GID SIG COREFILE  EXE\nMon 2017-07-17 15:34:49 CEST  27368  1000  1000  11 present   /usr/bin/gnome-shell\n$ coredumpctl gdb 27368\n(gdb) bt\n#0  0x00007fbc7b997945 in js::GCMethods<JSObject*>::needsPostBarrier(JSObject*) (v=0x7fbc0a9548c0) at /usr/include/mozjs-38/js/RootingAPI.h:663\n#1  0x00007fbc7b997945 in JS::Heap<JSObject*>::set(JSObject*) (newPtr=0x0, this=0x254c260) at /usr/include/mozjs-38/js/RootingAPI.h:296\n#2  0x00007fbc7b997945 in JS::Heap<JSObject*>::operator=(JSObject* const&) (p=<optimized out>, this=0x254c260) at /usr/include/mozjs-38/js/RootingAPI.h:266\n#3  0x00007fbc7b997945 in GjsMaybeOwned<JSObject*>::reset() (this=0x254c250) at ./gjs/jsapi-util-root.h:267\n#4  0x00007fbc7b997945 in closure_clear_idle(void*) (data=0x254c220) at gi/closure.cpp:133\n#5  0x00007fbc79abd8c5 in g_main_context_dispatch () at /usr/lib/libglib-2.0.so.0\n#6  0x00007fbc79abdc88 in  () at /usr/lib/libglib-2.0.so.0\n#7  0x00007fbc79abdfa2 in g_main_loop_run () at /usr/lib/libglib-2.0.so.0\n#8  0x00007fbc7b27508c in meta_run () at /usr/lib/libmutter-0.so.0\n#9  0x0000000000401ff7 in main ()\n```\n\nÈ quindi possibile segnalare il bug suproject page in GNOME GitLab.\n\n"
    },
    {
      "title": "Impostazioni predefinite dell'applicazione non corrette",
      "level": 2,
      "content": "Quando installi le applicazioni per la prima volta potresti scoprire che GNOME ha l'applicazione sbagliata associata a certi protocolli - per esempio, \"easytag\" diventa il gestore delle cartelle invece di GNOME Files.\n\nPer i file GNOME vedere la pagina seguente:GNOME Files#Files is no longer the default file manager.\n\nPer Document Viewer, esegui il comando seguente:\n\n```\n$ xdg-mime default evince.desktop application/pdf\n```\n\nPer altre applicazioni, le impostazioni del gestore predefinito sono descritte in dettaglio nella pagina seguente:Default applications.\n\nOpzionale, puoi install gnome-defaults-listAUR. Posizionerà il file di configurazione in /etc/gnome/defaults.list.\n\n"
    },
    {
      "title": "Tracker & Documents non elenca alcun file locale",
      "level": 2,
      "content": "Affinché Tracker (e, quindi, Documenti) rilevi i file locali, devono essere archiviati in una directory compatibile con XDG ( come \"Documenti\" o \"Musica\"). Per ulteriori informazioni, vedere XDG user directories.\n\nPuoi anche configurare Tracker per cercare ricorsivamente all'interno di directory specifiche come la tua home directory. Queste impostazioni possono essere effettuate utilizzando tracker-Preferences.\n\n"
    },
    {
      "title": "La pagina delle impostazioni degli account online GNOME non viene visualizzata correttamente",
      "level": 2,
      "content": "In alcuni casi, a causa delle interazioni con Alacarte (editor di menu), la pagina delle impostazioni degli account di Gnome Online non veniva visualizzata. Se ciò accade, \"Ripristina configurazione di sistema\" in Alacarte può ripristinare le funzioni mancanti in gnome-control-center. (Vedi https://bugzilla.redhat.com/show_bug.cgi?id=1520431.)\n\n"
    },
    {
      "title": "Impossibile modificare le impostazioni in dconf-editor",
      "level": 2,
      "content": "Quando non è possibile impostare le impostazioni in dconf, è possibile che le impostazioni utente di dconf siano corrotte. In questo caso è meglio eliminare i file dconf dell'utente in ~/.config/dconf/user * e successivamente impostare le impostazioni in dconf-editor.\n\n"
    },
    {
      "title": "Quando un'estensione rompe la shell",
      "level": 2,
      "content": "Quando l'abilitazione delle estensioni della shell causa la rottura di GNOME, è necessario prima rimuovere le estensioni \"user-theme\" e \"auto-move-windows\" dalla loro directory di installazione.\n\nLa directory di installazione potrebbe essere una di ~/.local/share/gnome ‑ shell/extensions, /usr/share/gnome ‑ shell/extensions o /usr//share/gnome-shell/locale estensioni. La rimozione di queste due cartelle contenenti estensioni potrebbe risolvere il problema. In caso contrario, isolare l'estensione del problema con tentativi ed errori.\n\nLa rimozione o l'aggiunta di una cartella contenente un'estensione alle suddette directory rimuove o aggiunge l'estensione corrispondente al sistema. I dettagli sulle estensioni della shell GNOME sono disponibili sul sito web GNOME.\n\nSe hai problemi con la disinstallazione di un'estensione tramite [1], probabilmente sono state installate come estensioni a livello di sistema con gnome-shell-extensions. La rimozione di nuovo del pacchetto ovviamente influisce su tutti gli account utente.\n\n"
    },
    {
      "title": "Le estensioni non funzionano dopo l'aggiornamento a GNOME 3",
      "level": 2,
      "content": "Prima di provare le soluzioni alternative seguenti, controlla se è disponibile un aggiornamento per l'estensione visitando extensions.gnome.org/local.\n\nSe non è ancora disponibile alcun aggiornamento per la versione corrente di GNOME, utilizzare il comando seguente per disabilitare la convalida della versione per le estensioni:\n\n```\n$ gsettings set org.gnome.shell disable-extension-version-validation true\n```\n\nIn alternativa, è possibile modificare l'estensione stessa, cambiando la versione della shell supportata per soddisfare la convalida della versione. Vedi il metodo sotto.\n\nIndividua la cartella in cui sono installate le tue estensioni. Potrebbe essere ~/.local/share/gnome-shell/extensions o /usr/share/gnome-shell/extensions.\n\nModifica ogni occorrenza di metadata.json che appare in ogni sottocartella di estensione.\n\nTable content:\nInsert: | \"shell-version\": [\"3.x\"]\nInstead of (for example): | \"shell-version\": [\"3.4\"]\n\n\"3.x\" indicates the extension works with every shell version. If it breaks, you will know to change it back.\n\n"
    },
    {
      "title": "La scorciatoia da tastiera non funziona solo con conky in esecuzione",
      "level": 2,
      "content": "Le scorciatoie da tastiera della shell GNOME come Alt+F2, Alt+F1 e le scorciatoie da tastiera multimediali non funzionano se conky è l'unico programma in esecuzione. Tuttavia, se è in esecuzione un'altra applicazione come \"gedit\", le scorciatoie da tastiera funzionano.\n\nSoluzione: modifica .conkyrc\n\n```\nown_window yes\nown_window_transparent yes\nown_window_argb_visual yes\nown_window_type dock\nown_window_class Conky\nown_window_hints undecorated,below,sticky,skip_taskbar,skip_pager\n```\n\n"
    },
    {
      "title": "Impossibile applicare la configurazione memorizzata per i monitor",
      "level": 2,
      "content": "Se incontri questo messaggio, prova a disabilitare \"xrandr\" gnome-settings-daemon plugin:\n\n```\n$ dconf write /org/gnome/settings-daemon/plugins/xrandr/active false\n```\n\n"
    },
    {
      "title": "Tema del cursore coerente",
      "level": 2,
      "content": "VedereCursor themes#Desktop environments.\n\n"
    },
    {
      "title": "Windows non può essere modificato con il tasto Alt+il pulsante del mouse",
      "level": 2,
      "content": "In GNOME 3.6 e versioni successive, il modificatore del pulsante del mouse (il tasto che consente di trascinare una finestra da una posizione diversa dalla barra del titolo) è il tasto Super invece del tasto Alt che è stato utilizzato in passato. La modifica è stata apportata in risposta alla seguente segnalazione di bug.\n\nPer riportare il modificatore del pulsante del mouse sul tasto Alt, eseguire quanto segue:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences mouse-button-modifier '<Alt>'\n```\n\n"
    },
    {
      "title": "Caricamento lento delle icone di sistema/login GDM lento",
      "level": 2,
      "content": "I problemi con il caricamento delle icone di sistema, come quelle nella barra del titolo di File, potrebbero essere risolti eseguendo il seguente comando:\n\n```\n# gdk-pixbuf-query-loaders --update-cache\n```\n\nL'esecuzione del comando di cui sopra può anche correggere le ricorrenze ripetute del messaggio \"Oh no! Qualcosa è andato storto!\" schermata di errore e/o caricamento molto lento e login con GDM come descritto nel seguente thread del forum.\n\n"
    },
    {
      "title": "Artefatti quando si massimizzano le finestre",
      "level": 2,
      "content": "L'ottimizzazione delle finestre può causare artefatti a partire da GNOME 3.12.0 - vedere quanto segue thread del forum e cgi? id=728385 segnalazione di bug[link interrotto 2024-10-19]. Una soluzione è descritta in dettaglio nella sezione seguente: #Video senza strappi con Intel HD Graphics.\n\n"
    },
    {
      "title": "Video senza strappi con Intel HD Graphics",
      "level": 2,
      "content": "Secondo this bug report, DRI3 include l'estensione buffer_age che consente al compositore Mutter di GNOME Shell di sincronizzare le finestre in vblank in un modo efficiente. Dalla versione 1:2.99.917+682+g4eaab17-1, DRI3 è abilitato per impostazione predefinita in xf86-video-intel [2].\n\nAbilitare l 'Xorg Intel TearFree option è una soluzione nota per i problemi di tearing sugli adattatori Intel. Tuttavia, il modo in cui questa opzione agisce aumenta il consumo di memoria e riduce le prestazioni, vedere the original bug report's final comment.\n\nIl compositore Mutter di GNOME Shell ha un tweak noto per risolvere i problemi di tearing (vedere il suggerimento originale per questa correzione e la sua menzione in la segnalazione di bug di Freedesktop). Per abilitare questo tweak, aggiungi la seguente riga a /etc/environment: CLUTTER_PAINT=disable-clipped-redraws:disable-culling. Quindi riavvia il server Xorg.\n\nGnome Shell non reindirizza le applicazioni a schermo intero per impostazione predefinita. Ciò potrebbe provocare lacrimazione. Puoi disabilitarlo con l'estensione della shell gnome gnome-shell-extension-disable-unredirectAUR.\n\n"
    },
    {
      "title": "La finestra si apre dietro altre finestre quando si utilizzano più monitor",
      "level": 2,
      "content": "Questo è probabilmente un bug in GNOME Shell che causa l'apertura di nuove finestre dietro ad altre. Per risolvere questo problema, è possibile eseguire il seguente comando:\n\n```\n$ gsettings set org.gnome.shell.overrides workspaces-only-on-primary false\n```\n\n"
    },
    {
      "title": "Il pulsante di blocco non riesce a riattivare il touchpad",
      "level": 2,
      "content": "Alcuni laptop hanno un pulsante di blocco del touchpad che disabilita il touchpad in modo che gli utenti possano digitare senza preoccuparsi di toccare il touchpad. Attualmente, sembra che sebbene GNOME possa bloccare il touchpad premendo questo pulsante, non può sbloccarlo. Se il touchpad si blocca, puoi eseguire quanto segue per sbloccarlo:\n\n```\n$ xinput set-prop \"SynPS/2 Synaptics TouchPad\" \"Device Enabled\" 1\n```\n\n"
    },
    {
      "title": "Il menu dei sorgenti della tastiera della shell GNOME non è visibile",
      "level": 2,
      "content": "Un menu che mostra le sorgenti di input della tastiera (ad esempio \"en\" per un layout di tastiera inglese) dovrebbe essere visibile accanto all'area di stato contenente le icone per la rete, il volume e le sorgenti di alimentazione. Se il menu delle sorgenti della tastiera non è visibile, probabilmente è perché hai configurato il layout della tastiera Xorg in un modo che GNOME non riconosce.\n\nPer assicurarti che il menu sia visibile, rimuovi qualsiasi configurazione della tastiera Xorg che potresti aver creato e imposta le impostazioni internazionali della tastiera usando localectl.\n\nDopo aver eseguito il comando e poi disconnesso, dovresti scoprire che il menu delle sorgenti di input della tastiera è visibile in GDM e nel desktop GNOME Shell. Vedere sources in GNOME per maggiori informazioni.\n\n"
    },
    {
      "title": "Cursore del mouse mancante",
      "level": 2,
      "content": "Quando si utilizza un window manager separato con gnome-settings-daemon , il cursore del mouse potrebbe scomparire. lanciare questo comando:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.cursor active false\n```\n\n"
    },
    {
      "title": "Nessun pulsante di riavvio nel menu della sessione quando lo schermo è bloccato",
      "level": 2,
      "content": "Se è installato XScreenSaver, assicurarsi che non sia in esecuzione all'avvio, vedere GNOME#Autostart.\n\n"
    },
    {
      "title": "PulseAudio a livello di sistema causa ritardi in GNOME e GDM",
      "level": 2,
      "content": "Se si esegue PulseAudio in modalità a livello di sistema, l'aggiornamento di PulseAudio 7.0 interrompe GDM e GNOME. Vedi questo post del forum per maggiori informazioni.\n\n"
    },
    {
      "title": "GNOME si arresta in modo anomalo quando si tenta di riordinare le applicazioni in GNOME Shell Dash",
      "level": 2,
      "content": "Il trattino è la \"barra degli strumenti\" che appare, per impostazione predefinita, a sinistra quando fai clic su Attività. Le applicazioni possono essere riordinate nel trattino trascinandole e rilasciandole. Se questo fallisce e/o causa l'arresto anomalo di GNOME, prova a cambiare il tema dell'icona.\n\n"
    },
    {
      "title": "Gnome si blocca durante l'installazione di gnome-extra",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nIl tentativo di installare il gruppo gnome-extra mentre è in esecuzione un ambiente gnome farà andare in crash gnome durante l'installazione di gnome-getting-started-docs. X continuerà a funzionare, ma gnome non funzionerà finché non verrà risolto. Per risolvere il problema, installa semplicemente gnome-extra da un terminale piuttosto che da gnome. Al termine, gnome dovrebbe funzionare di nuovo.\n\n"
    },
    {
      "title": "Nessun video H264 in Gnome Video Player (Totem)",
      "level": 2,
      "content": "Vedi Codec\n\n"
    },
    {
      "title": "Nessuna sospensione alla chiusura del LID",
      "level": 2,
      "content": "L'impostazione predefinita di GNOME è questo comportamento sulla sospensione:\n\n- Nessun monitor esterno collegato, il computer va in sospensione quando il LID si chiude.\n- Monitor esterno collegato, il computer non va in sospensione alla chiusura del LID.\n\nAttualmente gnome-tweaks non è in grado di modificare il comportamento nel secondo caso, quando un monitor è collegato al computer. Anche se può inibire la sospensione senza monitor collegato.\n\n"
    },
    {
      "title": "gnome-shell/gnome-session si arresta in modo anomalo all'avvio della sessione",
      "level": 2,
      "content": "A volte gnome-session si blocca immediatamente dopo il login. Questo potrebbe essere più visibile su Wayland e potrebbe sembrare che ogni secondo tentativo di accesso fallisca. Il problema può essere temporaneamente aggirato rimuovendo i file in ~/.config/gnome-session/saved-session. Una soluzione più duratura è disabilitare la funzione auto-save-session del gestore sessioni:\n\n```\n$ gsettings set org.gnome.SessionManager auto-save-session false\n```\n\n"
    },
    {
      "title": "Prestazioni OpenGL basse e balbuzie",
      "level": 2,
      "content": "- Con driver NVIDIA proprietario\n\nThis bug is much likely the cause of it. You should revert 383ba566bd7c2a76d0856015a66e47caedef06b6 commit in mutter. Use ABS for this and add git revert -n 383ba566bd7c2a76d0856015a66e47caedef06b6 to the prepare() function in the PKGBUILD or simply install mutter-performanceAUR instead.\n\n- Con driver non-propetario\n\nSe la riproduzione del video si interrompe (un po '), prova \"GNOME su Xorg\" invece di Wayland.\n\n"
    },
    {
      "title": "Sessione GNOME Wayland non disponibile",
      "level": 2,
      "content": "GNOME Wayland non supporta ancora più di una GPU per l'output, falling back su GNOME X11.\n\nSe i tuoi display sono collegati solo a uno dei tuoi dispositivi video, aggiungilo a system environment variables:\n\n```\nMUTTER_ALLOW_HYBRID_GPUS=1\n```\n\nPer evitare problemi con alcuni chipset abilitare Early KMS.\n\n"
    },
    {
      "title": "gnome-control-center è vuoto e non elenca alcuna categoria",
      "level": 2,
      "content": "Sotto gestori di finestre alternativi (i3 per esempio), \"gnome-control-center\" inizia come una finestra vuota. È necessario impostare la variabile XDG_CURRENT_DESKTOP su GNOME per avviarla (in uno script o esportando la variabile in ~/.profile).\n\n```\nexport XDG_CURRENT_DESKTOP=GNOME\n gnome-control-center &\n```\n\n"
    },
    {
      "title": "Gnome si blocca per un secondo dopo aver utilizzato una scorciatoia da tastiera Funzione (Fn)",
      "level": 2,
      "content": "Questo è un problema con la tastiera brasiliana portoghese ABNT 2. Se hai abilitato il portoghese brasiliano, GNOME potrebbe riscontrare questo problema. Per risolvere questo problema e continuare a utilizzare questo layout di tastiera, annullare la mappatura del pulsante di blocco dello scorrimento commentando questa riga in /usr/share/X11/xkb/symbols/br:\n\n```\nmodifier_map Mod3   { Scroll_Lock };\n```\n\nE riavvia la sessione (disconnettiti e accedi).\n\n"
    },
    {
      "title": "Le scorciatoie da tastiera Zoom avanti/indietro non funzionano su alcune app",
      "level": 2,
      "content": "Ctrl++ e Ctrl+- scorciatoie da tastiera per le funzioni di zoom in/out non funzionano immediatamente su alcuni Gnome app, come File e Gnome-Terminal.\n\nIn questi casi, apri GNOME Tweaks ( gnome-tweaks) e vai a Tastiera e Mouse> pulsante Opzioni di layout aggiuntive> Layout del tastierino numerico. Modificare il valore Disabled in Hexadecimal.\n\n"
    },
    {
      "title": "La configurazione delle stampanti non funziona nelle impostazioni di GNOME",
      "level": 2,
      "content": "CUPS e system-config-printer dovrebbero essere installati\n\n"
    },
    {
      "title": "Lo screen reader non funziona",
      "level": 2,
      "content": "Installa espeak-ng. In alternativa, è possibile utilizzare festival\n\n"
    },
    {
      "title": "Il software Gnome non mostra i pacchetti Arch Linux",
      "level": 2,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nInstalla gnome-software-packagekit-plugin[broken link: package not found]\n\n"
    }
  ]
}