{
  "title": "GPD MicroPC",
  "url": "https://wiki.archlinux.org/title/GPD_MicroPC",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU | 8086:3185 | Yes\nAudio | 8086:3198 | Yes\nEthernet | 10ec:8168 | Yes\nWireless | 8086:3165 | Yes\nBluetooth | 8087:0a2a | Yes\nSD Card Reader | 0bda:0316 | Yes\n\nThis page applies to the GPD MicroPC.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the linux-firmware-qlogic package to fix most external display issues. UHD external displays on both DP and HDMI are supported at 60hz and above, lower refresh rates may cause a flashing or blank screen.\n\n"
    },
    {
      "title": "Kernel modules",
      "level": 3,
      "content": "For an working keyboard during boot, add battery to the preloaded modules:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\n...\nMODULES=(battery)\n...\n```\n\n"
    },
    {
      "title": "Screen rotation during boot",
      "level": 3,
      "content": "For the correct screen rotation during boot, add fbcon=rotate:1 to your kernel parameters.\n\n"
    },
    {
      "title": "Wayland",
      "level": 3,
      "content": "The screen is on DSI-1 and 90° rotated, so you need to configure it depending on your compositor or desktop environment.\n\n"
    },
    {
      "title": "Hyprland",
      "level": 4,
      "content": "If you are using Hyprland with way-displays, you will need to run hyprctl monitor \"DSI-1,transform,3\" to upright the screen.\n\n"
    },
    {
      "title": "X11",
      "level": 3,
      "content": "If you are using X11 instead of Wayland, you can try using xrandr --output DSI1 --mode 720x1280 --pos 0x0 --rotate right in your console or add that command to your ~/.bash_aliases to upright the screen. However, modifying the kernel parameters (as previously mentioned) is still the best way to fix it.\n\n"
    },
    {
      "title": "Charge control",
      "level": 2,
      "content": "Charge control is not possible directly. Only with some hardware hack manual charge control can be added; see this reddit post for more information.\n\n"
    },
    {
      "title": "MongoDB Service will Coredump",
      "level": 2,
      "content": "Note: **This article or section is a candidate for merging with MongoDB.** This article or section is a candidate for merging with MongoDB.\n\nThis article or section is a candidate for merging with MongoDB.\n\nBecause of the GPC MicroPC's Intel Celeron \"Gemini Lake Refresh\" architecture, running a MongoDB Database server will cause a dumped, signal=ILL to appear in coredumpctl info. What this means is that the CPU doesn't have the instructions to run it. On the other hand, you can set MongoDB to use MongoDB Atlas to set up a cloud-based database\n\n"
    }
  ]
}