{
  "title": "Grupo de usuario",
  "url": "https://wiki.archlinux.org/title/Grupo_de_usuario",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-14** \n\nArtículos relacionados\n\n- DeveloperWiki:UID / GID Database\n- Sudo\n- polkit\n- Permisos y atributos de archivo\n- systemd-homed\n\nLos usuarios y grupos se utilizan en GNU/Linux para el control de acceso, es decir, para controlar el acceso a los archivos, directorios y periféricos del sistema. Linux ofrece mecanismos de control de acceso relativamente simples/toscos por defecto. Para obtener opciones más avanzadas, véase Listas de control de acceso, Capabilities y PAM (Español)#Configuración guiada.\n\n"
    },
    {
      "title": "Descripción",
      "level": 2,
      "content": "Un usuario es cualquiera que use una computadora. En este caso, estamos describiendo los nombres que representan a esos usuarios. Puede ser Mary o Bill, y pueden usar los nombres Dragonlady o Pirate en lugar de su nombre real. Lo único que importa es que la computadora tenga un nombre para cada cuenta que cree, y es este nombre por el que una persona obtiene acceso para usar la computadora. Algunos servicios del sistema también se ejecutan utilizando cuentas de usuario restringidas o privilegiadas.\n\nLa administración de los usuarios se realiza con fines de seguridad al limitar el acceso de ciertas maneras específicas. El superusuario (root) tiene acceso completo al sistema operativo y su configuración; está destinado solo para uso administrativo. Los usuarios sin privilegios pueden usar los programas su y sudo para la escalada de privilegios controlada.\n\nCualquier persona puede tener más de una cuenta, siempre que utilicen un nombre diferente para cada una de ellas. Además, hay algunos nombres reservados que no se pueden usar, como «root».\n\nLos usuarios pueden agruparse en un «grupo» y, del mismo modo, pueden añadirse a un grupo existente para utilizar el acceso privilegiado que dicho grupo concede.\n\n"
    },
    {
      "title": "Permisos y propiedad",
      "level": 2,
      "content": "De En Unix todo es un archivo:\n\nDe Extendiendo la abstracción de archivo de UNIX para fines generales de administración de redes[enlace roto 2024-01-13]:\n\nCada archivo en un sistema GNU/Linux es propiedad de un usuario y un grupo. Además, hay tres tipos de permisos de acceso: lectura, escritura y ejecución. Los permisos de acceso pueden aplicarse de forma diferente al usuario propietario del archivo, al grupo propietario y a otros (aquellos que no tienen la propiedad). Uno puede determinar los propietarios y permisos de un archivo al ver el formato de listado extenso de la orden ls:\n\n```\n$ ls -l /boot/\n```\n\n```\ntotal 13740\ndrwxr-xr-x 2 root root    4096 Jan 12 00:33 grub\n-rw-r--r-- 1 root root 8570335 Jan 12 00:33 initramfs-linux-fallback.img\n-rw-r--r-- 1 root root 1821573 Jan 12 00:31 initramfs-linux.img\n-rw-r--r-- 1 root root 1457315 Jan  8 08:19 System.map26\n-rw-r--r-- 1 root root 2209920 Jan  8 08:19 vmlinuz-linux\n```\n\nLa primera columna muestra los permisos del archivo (por ejemplo, el archivo initramfs-linux.img tiene los permisos -rw-r--r--). La tercera y cuarta columnas muestran los propietarios de usuario y grupo del archivo, respectivamente. En el presente ejemplo, todos los archivos son propiedad del usuario root y del grupo root.\n\n```\n$ ls -l /media/\n```\n\n```\ntotal 16\ndrwxrwx--- 1 root vboxsf 16384 Jan 29 11:02 sf_Shared\n```\n\nEn este ejemplo, la carpeta sf_Shared es propiedad del usuario root y del grupo vboxsf. También es posible determinar los propietarios y los permisos de un archivo con la orden stat:\n\nEl usuario propietario:\n\n```\n$ stat -c %U /media/sf_Shared/\n```\n\n```\nroot\n```\n\nEl grupo propietario:\n\n```\n$ stat -c %G /media/sf_Shared/\n```\n\n```\nvboxsf\n```\n\nLos permisos de acceso:\n\n```\n$ stat -c %A /media/sf_Shared/\n```\n\n```\ndrwxrwx---\n```\n\nLos permisos de acceso se muestran en tres grupos de caracteres, representando los permisos del usuario propietario, del grupo propietario, y de los otros, respectivamente. Por ejemplo, los caracteres -rw-r--r-- indican que el usuario propietario del archivo tiene permisos de lectura y escritura, pero no de ejecución (rw-), mientras que los usuarios que pertenecen al grupo propietario y los demás usuarios solo tienen permiso de lectura (r-- y r--). Mientras tanto, los caracteres drwxrwx--- indican que el usuario propietario del archivo y todos los usuarios que pertenecen al grupo propietario tienen permisos de lectura, escritura y ejecución (rwx y rwx), mientras que los demás usuarios no pueden acceder (---). El primer carácter representa el tipo de archivo.\n\nPuede listar los archivos que pertenecen a un usuario o a un grupo con la herramienta find:\n\n```\n# find / -group nombredegrupo\n```\n\n```\n# find / -group númerodegrupo\n```\n\n```\n# find / -user usuario\n```\n\nEl usuario y el grupo propietarios de un archivo pueden ser cambiados con la orden chown (change owner). Los permisos de acceso a un archivo se pueden cambiar con la orden chmod (change mode).\n\nVéase chown(1), chmod(1), y Linux file permissions para obtener información adicional.\n\n"
    },
    {
      "title": "Shadow",
      "level": 2,
      "content": "Las herramientas de gestión de usuarios, grupos y contraseñas en Arch Linux provienen del paquete shadow, que es una dependencia del meta paquete base.\n\n"
    },
    {
      "title": "Lista de archivos",
      "level": 2,
      "content": "Table content:\nArchivo | Propósito\n/etc/shadow | Información reservada de las cuentas de usuario\n/etc/passwd | Información de las cuentas de usuario\n/etc/gshadow | Contiene información reservada de los grupos de usuarios\n/etc/group | Define los grupos a los que pertenecen los usuarios\n\n"
    },
    {
      "title": "Administración de usuarios",
      "level": 2,
      "content": "Para listar los usuarios que actualmente están conectados en el sistema, se puede usar la orden who. Para listar todas las cuentas de usuario existentes, incluidas sus propiedades almacenadas en la base de datos del usuario, ejecute passwd -Sa como superusuario. Véase passwd(1) para la descripción del formato de salida.\n\nPara añadir un nuevo usuario, utilice el comando useradd:\n\n```\n# useradd -m -G grupos_adicionales -s intérprete_de_línea_de_órdenes nombre_de_usuario\n```\n\nSi un grupo de inicio de sesión se especifica por nombre o número, debe referirse a un grupo ya existente. Si no se especifica, el comportamiento de useradd dependerá de la variable USERGROUPS_ENAB contenida en /etc/login.defs. El comportamiento predeterminado (USERGROUPS_ENAB yes) es crear un grupo con el mismo nombre del usuario.\n\nCuando el intérprete de línea de órdenes de inicio de sesión no es funcional, por ejemplo, cuando la cuenta de usuario se crea para un servicio específico, se puede especificar /usr/bin/nologin en lugar de un intérprete de línea de órdenes normal para rechazar amablemente el inicio de sesión (véase nologin(8)).\n\nConsulte useradd(8) para ver otras opciones.\n\n"
    },
    {
      "title": "Ejemplo para añadir un usuario",
      "level": 3,
      "content": "Para añadir un nuevo usuario llamado archie, creando su directorio de inicio y usando todos los valores predeterminados en términos de grupos, nombres de carpetas, intérpretes de órdenes utilizados y otros parámetros:\n\n```\n# useradd -m archie\n```\n\nAunque no es necesario proteger al usuario archie recién creado con una contraseña, se recomienda encarecidamente hacerlo:\n\n```\n# passwd archie\n```\n\nLa orden useradd anterior también creará automáticamente un grupo llamado archie y lo convierte en el grupo predeterminado para el usuario archie. Hacer que cada usuario tenga su propio grupo (con el nombre de grupo igual al nombre del usuario) es la forma de añadir usuarios preferida.\n\nTambién puede hacer que el grupo predeterminado sea distinto usando la opción -g, pero tenga en cuenta que en sistemas multiusuario, no se recomienda utilizar un único grupo predeterminado (por ejemplo, users) para cada usuario. La razón es que, por lo general, el método para facilitar el acceso de escritura compartido para grupos específicos de usuarios establece el valor de usuario umask en 002, lo que significa que el grupo predeterminado siempre tendrá acceso de escritura a cualquier archivo que cree. Véase también User Private Groups. Si un usuario debe ser miembro de un grupo específico, especifique ese grupo como un grupo suplementario al crear el usuario.\n\nEn el escenario recomendado, donde el grupo predeterminado tiene el mismo nombre que el usuario, todos los archivos se pueden escribir de forma predeterminada solo por el usuario que los creó. Para permitir el acceso de escritura a un grupo específico, los archivos/carpetas compartidos se pueden escribir de forma predeterminada por todos en este grupo y, el grupo propietario, se puede fijar automáticamente al grupo dueño del directorio personal estableciendo el bit setgid en este directorio:\n\n```\n# chmod g+s nuestro_directorio_compartido\n```\n\nDe lo contrario, se utiliza el grupo predeterminado del creador del archivo (generalmente el mismo que el nombre de usuario).\n\nSi se requiere un cambio de GID temporalmente, también puede usar la orden newgrp para cambiar el GID predeterminado del usuario a otro GID en tiempo de ejecución. Por ejemplo, después de ejecutar newgrp nombre_de_grupo los archivos creados por el usuario se asociarán con el GID de nombre_de_grupo, sin necesidad de volver a iniciar sesión. Para volver al GID predeterminado, ejecute newgrp sin un nombre de grupo.\n\n"
    },
    {
      "title": "Ejemplo para añadir un usuario del sistema",
      "level": 3,
      "content": "Los usuarios del sistema se pueden usar para ejecutar procesos/demonios bajo un usuario diferente, protegiendo (por ejemplo, con chown) en archivos y/o directorios y más ejemplos de fortalecimiento informático.\n\nCon la orden siguiente se crea un usuario del sistema sin acceso al intérprete de línea de órdenes y sin un directorio personal home (opcionalmente se añade el parámetro -U para crear un grupo con el mismo nombre que el usuario, y se añade el usuario a este grupo):\n\n```\n# useradd -r -s /usr/bin/nologin usuario\n```\n\nSi el usuario del sistema requiere un ID de usuario y grupo específico, indíquelos con las opciones -u/--uid y -g/-gid al crear el usuario:\n\n```\n# useradd -r -u 850 -g 850 -s /usr/bin/nologin usuario\n```\n\n"
    },
    {
      "title": "Cambio del nombre de inicio de sesión de un usuario o el directorio personal",
      "level": 3,
      "content": "Para cambiar el directorio de inicio de un usuario:\n\n```\n# usermod -d /mi/nuevo/directorio/personal -m usuario\n```\n\nLa opción -m también crea automáticamente el nuevo directorio y mueve el contenido allí.\n\nNote: **no** Asegúrese de que no haya / al final de /mi/antiguo/directorio/personal.\n\n```\n# ln -s /mi/nuevo/directorio/personal/ /mi/antiguo/directorio/personal\n```\n\nAsegúrese de que no haya / al final de /mi/antiguo/directorio/personal.\n\nPara cambiar el nombre de inicio de sesión de un usuario:\n\n```\n# usermod -l nombrenuevo nombreantiguo\n```\n\nCambiar un nombre de usuario es seguro y fácil cuando se hace correctamente, simplemente use la orden usermod. Si el usuario está asociado a un grupo con el mismo nombre, puede cambiarle el nombre con la orden groupmod.\n\nAlternativamente, el archivo /etc/passwd puede modificarse directamente, véase #Base de datos del usuario para una introducción a su formato.\n\nTenga también en cuenta las siguientes notas:\n\n- Si está utilizando sudo, asegúrese de actualizar /etc/sudoers para reflejar el nuevo nombre de usuario (a través de la orden visudo como superusuario).\n- Los crontabs personales debe ajustarse al cambiar el nombre del archivo del usuario en /var/spool/cron del antiguo al nuevo nombre, y luego abrir crontab -e para cambiar las rutas relevantes y ajustar los permisos del archivo en consecuencia.\n- Los archivos/carpetas personales de Wine contenidos en ~/.wine/drive_c/users, ~/local/share/applications/wine/Programs y posiblemente otros necesiten ser renombrados/modificados manualmente.\n- Es posible que sea necesario volver a instalar ciertos complementos de Thunderbird, como Enigmail.\n- Cualquier cosa en su sistema (atajos de escritorio, scripts del intérprete de línea de órdenes, etc.) que use una ruta de acceso absoluta a su directorio personal (es decir, /home/nombreantiguo) deberá modificarse para reflejar su nuevo nombre. Para evitar estos problemas en los scripts del intérprete de línea de órdenes, use las variables ~ o $HOME para definir el directorios personal.\n- Además, no olvide modificar en consecuencia los archivos de configuración en /etc que dependan de su ruta absoluta (p.ej. Samba, CUPS, etc.). Una buena forma de aprender qué archivos necesita actualizar implica usar la orden grep de esta manera: grep -r usuario_antiguo *\n\n"
    },
    {
      "title": "Otros ejemplos de administración de usuarios",
      "level": 3,
      "content": "Para introducir información del usuario como comentarios en GECOS (por ejemplo, el nombre de usuario completo), escriba:\n\n```\n# chfn usuario\n```\n\n(De esta forma chfn se ejecuta en modo interactivo).\n\nAlternativamente, el comentario de GECOS se puede establecer de forma más liberal con:\n\n```\n# usermod -c \"Comentario\" usuario\n```\n\nPara marcar la contraseña de un usuario como caducada y solicitarles que creen una nueva la primera vez que inician sesión, escriba:\n\n```\n# chage -d 0 usuario\n```\n\nLas cuentas de usuario se pueden eliminar con la orden userdel:\n\n```\n# userdel -r usuario\n```\n\nLa opción -r especifica que el directorio de inicio y la cola de mensajes del usuario también deben eliminarse.\n\nPara cambiar el intérprete de línea de órdenes de inicio de sesión del usuario:\n\n```\n# usermod -s /bin/bash usuario\n```\n\n"
    },
    {
      "title": "Base de datos del usuario",
      "level": 2,
      "content": "La información del usuario local se almacena en el archivo de texto sin formato /etc/passwd: cada una de sus líneas representa una cuenta de usuario y tiene siete campos delimitados por dos puntos.\n\n```\ncuenta:contraseña:UID:GID:GECOS:directorio:intérprete_de_línea_de_órdenes\n```\n\nDonde:\n\n- cuenta es el nombre de usuario. Este campo no puede estar vacío. Se aplican las reglas de nomenclatura estándar de *NIX.\n- contraseña es la contraseña del usuario Advertencia: El archivo passwd es legible para todo el mundo, por lo que almacenar las contraseñas (con hash o sin él) en este archivo es inseguro. En cambio, Arch Linux utiliza contraseñas ocultas (shadowed): el campo contraseña contendrá un carácter de marcador de posición (x) que indica que la contraseña hash se guarda en el archivo de acceso restringido /etc/shadow. Por esta razón, se recomienda cambiar siempre las contraseñas usando la orden passwd.\n- UID es la identificación numérica del usuario. En Arch, el primer nombre de inicio de sesión (después del superusuario) para un llamado usuario normal, a diferencia de los servicios, es UID 1000 de forma predeterminada; las entradas subsecuentes de UID para los usuarios deberían ser mayores a 1000.\n- GID es la identificación numérica del grupo principal para el usuario. Los valores numéricos para los GID se enumeran en /etc/group.\n- GECOS es un campo opcional utilizado con fines informativos; generalmente contiene el nombre de usuario completo, pero también puede ser utilizado por servicios como finger y se puede administrar con la orden chfn. Este campo es opcional y puede dejarse en blanco.\n- directorio es utilizado por la orden de inicio de sesión para establecer la variable de entorno $HOME. Varios servicios con sus propios usuarios usan /, pero los usuarios normales generalmente establecen una carpeta bajo /home.\n- intérprete_de_línea_de_órdenes es la ruta al intérprete de línea de órdenes predeterminado del usuario. Este campo es opcional y su valor predeterminado es /bin/bash.\n\nNote: **passwd** \n\nEjemplo:\n\n```\njack:x:1001:1003:Jack Smith,algún comentario va aquí,,:/home/jack:/bin/bash\n```\n\nDesglosado, esto significa: usuario jack, cuya contraseña está en /etc/shadow, cuyo UID es 1001 y cuyo grupo principal es 1003. Jack Smith es su nombre completo y existe un comentario asociado a su cuenta; su directorio personal es /home/jack y está usando Bash.\n\nLa orden pwck se puede usar para verificar la integridad de la base de datos del usuario. Puede ordenar la lista de usuarios por GID al mismo tiempo, lo que puede ser útil para comparar:\n\n```\n# pwck -s\n```\n\n"
    },
    {
      "title": "Comprobaciones automáticas de integridad",
      "level": 2,
      "content": "En lugar de ejecutar pwck manualmente, el servicio systemd shadow.timer, que es parte y está activado por la instalación del paquete shadow, ejecutará a diario la comprobación pwck tanto a los grupos como a los usuarios.\n\nSi se encuentran discrepancias, el grupo se puede editar con la orden vigr y los usuarios con vipw. Esto proporciona un margen adicional de protección ya que estas órdenes bloquean las bases de datos para su edición. Tenga en cuenta que el editor de texto predeterminado es vi, pero se usará un editor alternativo si se establece la variable de entorno EDITOR, entonces se utilizará ese editor en su lugar.\n\n"
    },
    {
      "title": "Administración de grupos",
      "level": 2,
      "content": "/etc/group es el archivo que define los grupos en el sistema (véase group(5) para más detalles). También está su compañero gshadow que rara vez se utiliza. Sus detalles están en gshadow(5).\n\nLa orden groups muestra la pertenencia al grupo:\n\n```\n$ groups usuario\n```\n\nSi se omite usuario, se muestran los grupos a los que pertenece el usuario actual.\n\nLa orden id proporciona detalles adicionales, tales como el UID del usuario y los GID asociados:\n\n```\n$ id usuario\n```\n\nPara listar todos los grupos en el sistema:\n\n```\n$ cat /etc/group\n```\n\nCree un nuevo grupo con la orden groupadd:\n\n```\n# groupadd grupo\n```\n\nAñada un usuario a un grupo con la orden gpasswd (véase FS#58262 sobre los errores):\n\n```\n# gpasswd -a usuario grupo\n```\n\nAlternativamente, añada un usuario a grupos adicionales con usermod (reemplace grupos_adicionales por una lista separada por comas):\n\n```\n# usermod -aG grupos_adicionales usuario\n```\n\nModifique un grupo existente con la orden groupmod, p.ej. para cambiar el nombre del grupo grupo_antiguo a grupo_nuevo: grupo_nuevo}}):\n\n```\n# groupmod -n grupo_nuevo grupo_antiguo\n```\n\nPuede eliminar un grupo existente:\n\n```\n# groupdel grupo\n```\n\nPuede eliminar un usuario de un grupo:\n\n```\n# gpasswd -d usuario grupo\n```\n\nLa orden grpck se puede utilizar para comprobar la integridad de los archivos de grupo del sistema.\n\n"
    },
    {
      "title": "Listado de grupos",
      "level": 2,
      "content": "Esta sección explica el propósito de los grupos esenciales del paquete filesystem. Hay muchos otros grupos, que se crearán con el GID correcto cuando se instale el paquete correspondiente. Véase la página principal del software para más detalles.\n\n"
    },
    {
      "title": "Grupos de usuarios",
      "level": 3,
      "content": "A menudo, los usuarios que no son superusuarios de la computadora deben añadirse a algunos de los siguientes grupos para permitir el acceso a los periféricos y facilitar la administración del sistema:\n\nTable content:\nGrupo | Archivos afectados | Propósito\nadm |  | Grupo de administración, comúnmente utilizado para dar acceso de lectura a registros protegidos. Tiene acceso de lectura completo a los archivos journal.\nftp | /srv/ftp/ | Acceso a archivos servidos por servidores FTP.\ngames | /var/games | Acceso a algunas aplicaciones de juegos.\nhttp | /srv/http/ | Acceso a archivos servidos por servidores HTTP.\nlog |  | Acceso a archivos de registro en /var/log/ creados por syslog-ng.\nrfkill | /dev/rfkill | Derecho a controlar el estado de energía de los dispositivos inalámbricos (utilizado por rfkill).\nsys |  | Derecho a administrar impresoras en CUPS.\nsystemd-journal | /var/log/journal/* | Se utiliza para proporcionar acceso de solo lectura a los registros systemd, como una alternativa a adm y wheel [1]. De lo contrario, solo se muestran los mensajes generados por el usuario.\nuucp | /dev/ttyS[0-9]+, /dev/tts/[0-9]+, /dev/ttyUSB[0-9]+, /dev/ttyACM[0-9]+, /dev/rfcomm[0-9]+ | Acceso a los puertos serie RS-232 y dispositivos conectados a ellos.\nwheel |  | Grupo de administración, comúnmente utilizado para dar privilegios para realizar acciones administrativas. Tiene acceso de lectura total a los archivos journal y el derecho de administrar impresoras en CUPS. Puede ser utilizado también para dar acceso a las utilidades sudo y su (ninguno lo usa por defecto.\n\n"
    },
    {
      "title": "Grupos del sistema",
      "level": 3,
      "content": "Los siguientes grupos se utilizan para fines del sistema, solo es necesario su asignación a los usuarios para fines específicos:\n\nTable content:\nGrupo | Archivos afectados | Propósito\ndbus |  | Utilizado internamente por dbus\nkmem | /dev/port, /dev/mem, /dev/kmem | \nlocate | /usr/bin/locate, /var/lib/locate, /var/lib/mlocate, /var/lib/slocate | Véase Locate.\nlp | /dev/lp[0-9]*, /dev/parport[0-9]* | Acceso a dispositivos de puerto paralelo (impresoras y otros).\nmail | /usr/bin/mail | \nnobody |  | Grupo sin privilegios.\nproc | /proc/pid/ | Un grupo autorizado para aprender información de procesos que de lo contrario está prohibida por la opción de montaje hidepid= del sistema de archivos de proc. El grupo debe establecerse explícitamente con la opción de montaje gid=.\nroot | /* | Administración y control completo del sistema (root, admin).\nsmmsp |  | Grupo sendmail.\ntty | /dev/tty, /dev/vcc, /dev/vc, /dev/ptmx | \nutmp | /run/utmp, /var/log/btmp, /var/log/wtmp | \n\n"
    },
    {
      "title": "Grupos pre-systemd",
      "level": 3,
      "content": "Antes de que Arch migrase a systemd, los usuarios tenían que añadirse manualmente a estos grupos para poder acceder a los dispositivos correspondientes. Esta metodología está obsoleta en favor de udev marcando los dispositivos con uaccess tag y logind asignando los permisos a los usuarios dinámicamente a través de ACLs según la sesión que esté actualmente activa. Tenga en cuenta que la sesión no debe interrumpirse para que esto funcione (véase Permisos de sesión para comprobarlo).\n\nHay algunas excepciones notables que requieren añadir un usuario a algunos de estos grupos: por ejemplo, si desea permitir que los usuarios accedan al dispositivo incluso cuando no están conectados. Sin embargo, tenga en cuenta que añadir usuarios a los grupos puede incluso causar la rotura de alguna funcionalidad (por ejemplo, el grupo audio romperá el cambio rápido de usuario y permite que las aplicaciones bloqueen el mezclador por software).\n\nTable content:\nGrupo | Archivos afectados | Propósito\naudio | /dev/audio, /dev/snd/*, /dev/rtc0 | Acceso directo a hardware de sonido para todas las sesiones. Todavía es necesario hacer que ALSA y OSS funcionen en sesiones remotas, véase ALSA#User privileges. También utilizado por JACK para dar a los usuarios permisos de procesamiento en tiempo real.\ndisk | /dev/sd[a-zA-Z]*[1-9] | Acceso a dispositivos de bloques no afectados por otros grupos como optical, floppy, y storage.\nfloppy | /dev/fd[0-9] | Acceso a unidades de disquete.\ninput | /dev/input/event[0-9]*, /dev/input/mouse[0-9]* | Acceso a dispositivos de entrada. Introducido en systemd 215 [2].\nkvm | /dev/kvm | Acceso a máquinas virtuales usando KVM.\noptical | /dev/sr[0-9], /dev/sg[0-9] | Acceso a dispositivos ópticos como unidades de CD y DVD.\nscanner | /var/lock/sane | Acceso al hardware del escáner.\nstorage | /dev/st[0-9]*[lma]*, /dev/nst[0-9]*[lma]* | Utilizado para obtener acceso a unidades extraíbles como discos duros USB, unidades flash, reproductores de MP3; permite al usuario montar dispositivos de almacenamiento. [3] Now solely for direct access to tapes if no custom udev rules is involved.[4][5][6][7]\nvideo | /dev/fb/0, /dev/misc/agpgart | Acceso a dispositivos de captura de vídeo, aceleración por hardware 2D/3D, framebuffer (se puede utilizar X sin pertenecer a este grupo).\n\n"
    },
    {
      "title": "Grupos no utilizados",
      "level": 3,
      "content": "Los siguientes grupos no tienen actualmente ninguna propósito:\n\nTable content:\nGrupo | Archivos afectados | Propósito\nbin | ninguno | Histórico\ndaemon |  | \nlock |  | Usado para el acceso de bloqueo de archivos. Requerido por ejemplo en gnokiiAUR.\nmem |  | \nnetwork |  | No utilizado por defecto. Puede ser utilizado, por ejemplo para otorgar acceso a NetworkManager (véase NetworkManager#Set up PolicyKit permissions).\npower |  | \nuuidd |  | \nusers |  | El grupo primario para usuarios cuando no se utilizan grupos privados de usuarios (generalmente no recomendado), p.ej. al crear usuarios con USERGROUPS_ENAB no en /etc/login.defs o la opción -N/--no-user-group de useradd.\n\n"
    },
    {
      "title": "Otras herramientas relacionadas con estas bases de datos",
      "level": 2,
      "content": "getent(1) se puede utilizar para leer un registro en particular.\n\n```\n% getent group tty\n```\n\nComo se advirtió en #Base de datos del usuario, utilizar utilidades específicas como passwd y chfn, es una mejor forma de cambiar las bases de datos. Sin embargo, hay momentos en que hay que editarlos directamente. Para estos casos se proporcionan vipw y vigr. Se recomienda encarecidamente utilizar estos editores personalizados antes que un editor de texto general, ya que bloquean las bases de datos contra la modificación concurrente. También ayudan a evitar entradas no válidas y/o errores de sintaxis. Tenga en cuenta que Arch Linux prefiere la utilización de herramientas específicas, tales como chage, para modificar la base de datos en vez de utilizar vipw -s y vigr -s de util-linux. véase también FS#31414.\n\n"
    }
  ]
}