{
  "title": "Guake",
  "url": "https://wiki.archlinux.org/title/Guake",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- GNOME\n\nGuake is a top-down terminal for GNOME (in the style of Yakuake for KDE, Tilda or the terminal used in Quake).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the guake package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Once installed, you can start Guake from the terminal with:\n\n```\n$ guake\n```\n\nAfter guake has started you can right click on the interface and select Preferences to change the hotkey to drop the terminal automatically, by default it is set to F12.\n\n"
    },
    {
      "title": "Autostartup",
      "level": 2,
      "content": "You may want Guake to load on starting up Desktop Environment. To do this, you need to\n\n```\n# cp /usr/share/applications/guake.desktop /etc/xdg/autostart/\n```\n\nSee Autostarting for more info.\n\n"
    },
    {
      "title": "Guake scripting",
      "level": 2,
      "content": "Like Yakuake, Guake allows to control itself at runtime by sending the D-Bus messages. Thus it can be used to start Guake in a user defined session. You can create tabs, assign names for them and also ask to run any specific command in any opened tab or just to show/hide Guake window, manually in a terminal or by creating a custom script for it.\n\nExample of such a script is given below this section.\n\nYou can use guake executable itself to send D-Bus messages. Here is the list of available options you may be interested in:\n\n- -t, --toggle-visibility — toggle the visibility of the terminal window. Actually, you can just type guake, and it will toggle the visibility of already running instance.\n- -f, --fullscreen — put Guake to fullscreen mode.\n- --show — show Guake main window.\n- --hide — hide Guake main window.\n- -n CUR_DIR, --new-tab=CUR_DIR — create new tab and select it. Value of CUR_DIR used to set a current directory for the tab, if specified.\n- -s INDEX, --select-tab=INDEX — select tab with index INDEX. Tab indexes are started with 0.\n- -g, --selected-tab — print index of currently selected tab.\n- -e CMD, --execute-command=CMD — execute an arbitrary command CMD in the selected tab.\n- -i INDEX, --tab-index=INDEX — used with --rename-tab to specify index INDEX of a tab to rename. Default value is 0.\n- --rename-tab=TITLE — set the tab name to TITLE. You can reset tab title to default value by passing a single dash (\"-\"). Use -i option to specify which tab to rename.\n- --bgcolor=RGB — set the hexadecimal (#rrggbb) background color RGB of the selected tab.\n- --fgcolor=RGB — set the hexadecimal (#rrggbb) foreground color RGB of the selected tab.\n- -r TITLE, --rename-current-tab=TITLE — same as --rename-tab, but renames the currently selected tab.\n- -q, --quit — shutdown running Guake instance.\n\nMultiple options may be combined in a single call. If there is no guake instance running, all of the options specified will be applied to the newly created instance.\n\nTo display list of all available options, type guake --help.\n\nThere are 2 ways of starting guake while applying these scripts\n\n- copying the below example into a file like guake-init.sh making it executable and running that file instead of guake\n- right clicking on Guake Terminal > Preferences > Hooks and adding the path to the guake-init.sh script in the \"On start:\" field while making certain to comment out /usr/bin/guake & and sleep 5 from the script below\n\nThe second option is preferable if you want the script to run regardless of how guake is started and you can still instruct guake not to run the script with guake --no-startup-script if needed.\n\nExample:\n\n```\n#!/bin/sh\n\n/usr/bin/guake &\nsleep 5 # let main guake process start and initialize D-Bus session\n\n# adjust tab which was opened by default\nguake --rename-tab=\"iotop\" --execute=\"/usr/bin/iotop\"\n\n# create new tab, start bash session in it\nguake --new-tab --execute=\"/usr/bin/bash\"\n# and then execute htop, renaming the tab to \"htop\"\nguake --execute=\"/usr/bin/htop\" --rename-current-tab=\"htop\"\n\n# ...\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/atop\" --rename-current-tab=\"atop\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"~/.iptables.sh\" --rename-current-tab=\"iptables -nvL\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/journalctl --follow --full\" --rename-current-tab=\"journalctl\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/irssi\" --rename-current-tab=\"irssi\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/sudo -i\" --rename-current-tab=\"rootshell0\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/sudo -i\" --rename-current-tab=\"rootshell1\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --rename-current-tab=\"shell0\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --rename-current-tab=\"shell1\"\n```\n\nNotice than we should wait some time calling sleep to avoid race conditions between running instances.\n\n"
    },
    {
      "title": "Floating mode in window managers",
      "level": 3,
      "content": "Guake may not open in floating mode with some window managers. This can be resolved by using Guake's window class string (\"guake\" or \"Guake\" per xprop WM_CLASS). For example, see \"WM_CLASS\" in i3#Correct handling of floating dialogs for i3.\n\n"
    },
    {
      "title": "Toggling Guake visibility does not work (Wayland)",
      "level": 3,
      "content": "If you are using Wayland, the Guake visibility toggle hotkey may not work under some applications. This is because Guake uses a global hotkey library made for X environments and there is no equivalent global hotkey interface for Wayland. Many applications (e.g. Firefox) run on Wayland through Xwayland where the Guake toggle will work but others that natively run Wayland (e.g. GNOME applications) disable Guake toggle functionality.\n\nIf you do not wish to switch over to an X environment, a simple workaround requires configuring a shortcut with your window manager/desktop environment for the command guake-toggle.\n\nSee github issue for more details.\n\n"
    },
    {
      "title": "Guake is blurry on Wayland",
      "level": 3,
      "content": "If you are using a Wayland desktop environment with fractional scaling guake might be blurry. If this is the case it is likely because your desktop environment is upscaling guake for you. Guake does not respect the GDK_BACKEND environment variable. Instead, to make guake use Wayland set the GUAKE_ENABLE_WAYLAND=1 environment variable.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Guake documentation\n\n"
    }
  ]
}