{
  "title": "Guida Ufficiale all'Installazione",
  "url": "https://wiki.archlinux.org/title/Guida_Ufficiale_all%27Installazione",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Questo documento costituisce una guida per l'installazione di Arch Linux utilizzando un sistema live avviato da un supporto di installazione creato con un'immagine di installazione ufficiale. Il supporto di installazione offre funzioni di accessibilità descritte nella pagina Install Arch Linux with accessibility options. Per informazioni sui metodi di installazione alternativi, vedere Category:Installation process.\n\nPrima di eseguire l'installazione, si consiglia di consultare le FAQ. In riferimento alle convenzioni utilizzate nel presente documento, vedere Help:Reading (Italiano). In particolare, gli esempi di codice potrebbero contenere dei segnaposto (formattati in corsivo) che devono essere sostituiti manualmente.\n\nQuesta guida è concisa ed è consigliato seguire le istruzioni sezione per sezione nell'ordine in cui sono presentate. Per istruzioni più dettagliate, vedere i rispettivi articoli ArchWiki e le man page dei programmi, entrambe presenti come link in questa guida. Per un aiuto interattivo sono inoltre disponibili i canali IRC e il forum internazionale.\n\nArch Linux dovrebbe funzionare su qualsiasi computer compatibile x86_64 con un minimo di 512 MiB di RAM, ma l'avvio del sistema live per l'installazione richiede più memoria.[1] Un'installazione basilare dovrebbe occupare meno di 2 GiB di spazio su disco. Poiché il processo di installazione necessita di recuperare pacchetti da un repository remoto, la presente guida presuppone la presenza di una connessione internet funzionante.\n\n"
    },
    {
      "title": "Acquisire un'immagine di installazione",
      "level": 3,
      "content": "Il supporto di installazione, sotto forma di immagine ISO o netboot, e le rispettive firme GnuPG possono essere ottenuti visitando la pagina download, a seconda di come si desidera procedere.\n\n"
    },
    {
      "title": "Verifica della firma",
      "level": 3,
      "content": "Si raccomanda di verificare la firma dell'immagine prima dell'utilizzo, specialmente se è stata scaricata da un mirror HTTP, dove i download possono essere soggetti ad intercettazioni al fine di fornire immagini malevole.\n\nIn un sistema con GnuPG installato, eseguire il seguente comando per scaricare la firma PGP ISO (sotto checksums nella pagina di download) nella directory contenente il file ISO, e verificarla con:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nIn alternativa, da un'installazione esistente di Arch Linux eseguire:\n\n```\n$ pacman-key -v archlinux-version-x86_64.iso.sig\n```\n\n- La firma stessa potrebbe essere stata manipolata se è stata scaricata da un sito mirror, anziché dalla pagina archlinux.org come precedentemente indicato. In questo caso, assicurarsi che la chiave pubblica, che è utilizzata per decifrare la firma, sia firmata da un'altra chiave di fiducia. Il comando gpg restituirà l'impronta (fingerprint) della chiave pubblica.\n- Un altro metodo per verificare l'autenticità della firma è assicurarsi che l'impronta della chiave pubblica sia identica all'impronta della chiave dello sviluppatore di Arch Linux che ha firmato il file ISO. Vedere Wikipedia:it:Crittografia asimmetrica per maggiori informazioni sul processo di autenticazione della chiave pubblica.\n\n"
    },
    {
      "title": "Preparare un supporto di installazione",
      "level": 3,
      "content": "L'ambiente live può essere avviato da una memoria USB, un disco ottico o da una rete con PXE. Seguire le istruzioni contenute nei relativi articoli per predisporre il proprio supporto di installazione in base all'immagine scelta.\n\n"
    },
    {
      "title": "Boot dell'ambiente live",
      "level": 3,
      "content": "1. Indicare come dispositivo boot attuale l'unità contenente il supporto di installazione di Arch Linux. Questa operazione è tipicamente eseguita premendo un tasto specifico durante la fase POST, come indicato nella schermata di avvio. Fare riferimento al manuale della propria scheda madre per i dettagli.\n1. Quando compare il menu del boot loader del supporto di installazione, selezionare Arch Linux install medium e premere Invio per accedere all'ambiente di installazione. Suggerimento: L'immagine di installazione utilizza GRUB per il boot UEFI e syslinux per il boot BIOS. Utilizzare rispettivamente e o Tab per accedere ai parametri di boot. Vedere README.bootparams per un elenco dei parametri. Un esempio comune di parametro di boot definito manualmente è la dimensione del font. Può essere utile utilizzare fbcon=font:TER16x32 per migliorare la leggibilità sugli schermi HiDPI che non siano già stati riconosciuti come tali. Vedere HiDPI#Linux console (tty) per una spiegazione dettagliata.\n1. \n1. Il login sarà effettuato nella prima console virtuale come utente root, e verrà visualizzata una shell dei comandi Zsh.\n\n- L'immagine di installazione utilizza GRUB per il boot UEFI e syslinux per il boot BIOS. Utilizzare rispettivamente e o Tab per accedere ai parametri di boot. Vedere README.bootparams per un elenco dei parametri.\n- Un esempio comune di parametro di boot definito manualmente è la dimensione del font. Può essere utile utilizzare fbcon=font:TER16x32 per migliorare la leggibilità sugli schermi HiDPI che non siano già stati riconosciuti come tali. Vedere HiDPI#Linux console (tty) per una spiegazione dettagliata.\n\nPer passare a una console diversa - ad esempio, per leggere questa guida con Lynx in parallelo all'installazione - utilizzare la scorciatoia da tastiera Alt+freccia. Per modificare i file di configurazione sono disponibili mcedit(1), nano e vim. Vedere pkglist.x86_64.txt per un elenco dei pacchetti inclusi nel supporto di installazione.\n\n"
    },
    {
      "title": "Impostare la mappatura della tastiera e il font nella console",
      "level": 3,
      "content": "La mappatura della tastiera predefinita è quella US. È possibile elencare le mappature disponibili con il seguente comando:\n\n```\n# localectl list-keymaps\n```\n\nPer impostare la mappatura della tastiera, eseguire il comando loadkeys(1) seguito dal nome della rispettiva mappatura. Ad esempio, per impostare una mappatura tedesca:\n\n```\n# loadkeys de-latin1\n```\n\nI font per la console sono installati in /usr/share/kbd/consolefonts/ e possono anch'essi essere impostati con il comando setfont(8) omettendo il percorso e l'estensione del file. Ad esempio, per utilizzare uno dei font di dimensioni maggiori, adatto per gli schermi HiDPI, eseguire:\n\n```\n# setfont ter-132b\n```\n\n"
    },
    {
      "title": "Verificare la modalità di boot",
      "level": 3,
      "content": "Per verificare la modalità di boot, eseguire il seguente comando:\n\n```\n# cat /sys/firmware/efi/fw_platform_size\n```\n\nSe il comando restituisce il valore 64, il boot del sistema è stato eseguito in modalità UEFI x64 a 64 bit. Se il comando restituisce il valore 32, il boot del sistema è stato eseguito in modalità UEFI IA32 a 32 bit; pur essendo questa modalità supportata, limiterà la scelta del boot loader a systemd-boot e GRUB. Se il file non esiste, il boot del sistema potrebbe essere stato eseguito in modalità BIOS o CSM. Se il boot del sistema non è stato eseguito nella modalità desiderata (UEFI vs BIOS), fare riferimento al manuale della propria scheda madre.\n\n"
    },
    {
      "title": "Connettersi ad Internet",
      "level": 3,
      "content": "Per impostare una connessione di rete nell'ambiente live, eseguire i seguenti passaggi:\n\n- Assicurarsi che l'interfaccia di rete sia elencata e abilitata, ad esempio con ip-link(8): # ip link\n- Per le reti wireless e WWAN, assicurarsi che la scheda non sia bloccata con rfkill.\n- Connettersi alla rete: Ethernet - collegare il cavo di rete. Wi-Fi - eseguire l'autenticazione alla rete wireless utilizzando iwctl. Modem di rete mobile a banda larga - connettersi alla rete mobile utilizzando lo strumento mmcli.\n- Configurare la propria connessione di rete: DHCP: l'assegnazione dinamica dell'indirizzo IP e del server DNS (fornita da systemd-networkd e systemd-resolved) dovrebbe funzionare per le interfacce di rete Ethernet, WLAN e WWAN senza bisogno di ulteriori configurazioni. Indirizzo IP statico: seguire le istruzioni alla pagina Configurazione di rete#Indirizzo_IP_statico.\n- La connessione può essere verificata con il comando ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernet - collegare il cavo di rete.\n- Wi-Fi - eseguire l'autenticazione alla rete wireless utilizzando iwctl.\n- Modem di rete mobile a banda larga - connettersi alla rete mobile utilizzando lo strumento mmcli.\n\n- DHCP: l'assegnazione dinamica dell'indirizzo IP e del server DNS (fornita da systemd-networkd e systemd-resolved) dovrebbe funzionare per le interfacce di rete Ethernet, WLAN e WWAN senza bisogno di ulteriori configurazioni.\n- Indirizzo IP statico: seguire le istruzioni alla pagina Configurazione di rete#Indirizzo_IP_statico.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Aggiornare l'orologio di sistema",
      "level": 3,
      "content": "systemd-timesyncd è attivo per impostazione predefinita nell'ambiente live e l'orario sarà sincronizzato automaticamente una volta che venga stabilita una connessione a Internet.\n\nUtilizzare il comando timedatectl(1) per assicurarsi che l'orologio di sistema sia correttamente impostato:\n\n```\n# timedatectl\n```\n\n"
    },
    {
      "title": "Partizionare i dischi",
      "level": 3,
      "content": "Una volta riconosciuti dal sistema live, i dischi sono assegnati a un dispositivo a blocchi come /dev/sda, /dev/nvme0n1 o /dev/mmcblk0. Per identificare questi dispositivi, utilizzare lsblk o fdisk.\n\n```\n# fdisk -l\n```\n\nI risultati che terminano con rom, loop o airootfs possono essere ignorati. I dispositivi mmcblk* che terminano con rpbm, boot0 e boot1 possono essere ignorati.\n\nLe seguenti partizioni sono necessarie per un dato dispositivo:\n\n- Una partizione per la directory di root /.\n- Per eseguire il boot in modalità UEFI: una partizione di sistema EFI.\n\nSe si desidera creare una configurazione in stack dei dispositivi a blocchi per LVM, system encryption o RAID, farlo ora.\n\nUtilizzare uno strumento di partizionamento come fdisk per modificare le tabelle delle partizioni. Ad esempio:\n\n```\n# fdisk /dev/il_disco_da_partizionare\n```\n\n- Se nel disco da cui si desidera eseguire il boot è già presente una partizione di sistema EFI, utilizzare quella esistente, senza crearne un'altra.\n- Lo spazio di swap può essere impostato su uno swap file per i file system che lo supportano.\n\n"
    },
    {
      "title": "Esempi di layout",
      "level": 4,
      "content": "Table content:\nPunto di montaggio | Partizione | Tipo di partizione | Dimensione suggerita\n/mnt/boot1 | /dev/partizione_efi_di_sistema | Partizione di sistema EFI | Almeno 300 MiB. Se sono installati kernel multipli, almeno 1 GiB.\n[SWAP] | /dev/partizione_di_swap | Linux swap | Maggiore di 512 MiB\n/mnt | /dev/partizione_di_root | Linux x86-64 root (/) | Resto del dispositivo. Almeno 23–32 GiB.\n\n1. È possibile utilizzare altri punti di montaggio, come /mnt/efi, a condizione che il boot loader utilizzato sia in grado di caricare il kernel e le immagini initramfs dal volume di root. Vedere l'avviso in Arch boot process#Boot loader.\n\nTable content:\nPunto di montaggio | Partizione | Tipo di partizione | Dimensione suggerita\n[SWAP] | /dev/partizione_di_swap | Linux swap | Maggiore di 512 MiB\n/mnt | /dev/partizione_di_root | Linux | Resto del dispositivo. Almeno 23–32 GiB.\n\nVedere anche Partitioning#Example layouts.\n\n"
    },
    {
      "title": "Formattare le partizioni",
      "level": 3,
      "content": "Ciascuna delle partizioni appena create deve essere formattata con un file system appropriato. Vedere File systems (Italiano)#Creazione di un file system per i dettagli.\n\nAd esempio, per creare un file system Ext4 su /dev/partizione_di_root, eseguire:\n\n```\n# mkfs.ext4 /dev/partizione_di_root\n```\n\nSe è stata creata una partizione di swap, inizializzarla con mkswap(8):\n\n```\n# mkswap /dev/partizione_di_swap\n```\n\nSe è stata creata una partizione EFI di sistema, formattarla in FAT32 utilizzando mkfs.fat(8).\n\n```\n# mkfs.fat -F 32 /dev/partizione_di_sistema_efi'\n```\n\n"
    },
    {
      "title": "Montare i file system",
      "level": 3,
      "content": "Montare il volume di root in /mnt. Ad esempio, se il volume di root è /dev/partizione_di_root eseguire:\n\n```\n# mount /dev/partizione_di_root /mnt\n```\n\nCreare eventuali ulteriori punti di montaggio (come /mnt/boot) e montare i rispettivi volumi nell'ordine gerarchico corrispondente.\n\nPer i sistemi UEFI, montare la partizione di sistema EFI:\n\n```\n# mount --mkdir /dev/partizione_di_sistema_efi /mnt/boot\n```\n\nSe è stato creato un volume di swap, abilitarlo con swapon(8):\n\n```\n# swapon /dev/partizione_di_swap\n```\n\ngenfstab(8) successivamente rileverà i file system montati e lo spazio di swap.\n\n"
    },
    {
      "title": "Selezionare i mirror",
      "level": 3,
      "content": "I pacchetti da installare devono essere scaricati da server mirror che sono definiti nel file /etc/pacman.d/mirrorlist. Nel sistema live, dopo aver stabilito la connessione a Internet, reflector provvederà ad aggiornare l'elenco dei server mirror scegliendo i 20 server mirror HTTPS sincronizzati più di recente e ordinandoli in base alla loro velocità di download.\n\nPiù in alto un server mirror si trova nell'elenco, maggiore sarà la sua priorità quando si procederà al download di un pacchetto. Potrebbe essere opportuno controllare il file per verificare che soddisfi le proprie esigenze. Se necessario, modificare il file a proprio piacimento e spostare i server mirror più vicini geograficamente in cima all'elenco, per quanto possa essere opportuno considerare anche altri criteri.\n\nQuesto file verrà poi copiato nel nuovo sistema installato da pacstrap, pertanto è importante configurarlo correttamente.\n\n"
    },
    {
      "title": "Installare i pacchetti essenziali",
      "level": 3,
      "content": "Usare lo script pacstrap(8) per installare il pacchetto base, il kernel Linux e il firmware per i dispositivi hardware più comuni:\n\n```\n# pacstrap -K /mnt base linux linux-firmware\n```\n\n- È possibile sostituire il pacchetto linux con un kernel di propria scelta, oppure è possibile ometterlo del tutto in caso di installazione in un container.\n- È possibile omettere l'installazione del pacchetto del firmware se si sta eseguendo l'installazione in una macchina virtuale o in un contenitore.\n\nIl pacchetto base non include tutti gli strumenti presenti nell'installazione live, quindi potrebbe rendersi necessaria l'installazione di ulteriori pacchetti per un sistema base completamente funzionante. Per installare altri pacchetti o gruppi di pacchetti, aggiungere i nomi (separati da spazio) al comando pacstrap indicato in precedenza o utilizzare pacman dopo aver eseguito il chroot nel nuovo sistema. In particolare, prendere in considerazione l'installazione di:\n\n- strumenti in spazio utente per la gestione dei file system che verranno utilizzati dal sistema - ad es. per creare file system ed eseguire fsck,\n- strumenti per l'accesso a e la gestione di configurazioni RAID o LVM nel caso vengano utilizzate nel sistema,\n- firmware specifico per altri dispositivi non incluso in linux-firmware (es. sof-firmware per schede audio), linux-firmware-marvell per i dispositivi wireless Marvell e qualunque dei diversi pacchetti firmware per i dispositivi wireless Broadcom),\n- software necessario per la rete (es. un gestore di rete o un client DHCP standalone), software di autenticazione per Wi-Fi, ModemManager per connessioni mobili a banda larga),\n- un editor di testo,\n- pacchetti per accedere alla documentazione nelle pagine man e info: man-db, man-pages e texinfo.\n\nA scopo di confronto, i pacchetti disponibili nel sistema live possono essere visualizzati nel file pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Generare un file fstab (utilizzare -U o -L per definire le partizioni rispettivamente in base agli UUID o alle etichette):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nVerificare il file /mnt/etc/fstab ottenuto e, in caso di errori, modificarlo.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Passare al nuovo sistema entrando nell'ambiente chroot:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Fuso orario",
      "level": 3,
      "content": "Impostare il proprio fuso orario:\n\n```\n# ln -sf /usr/share/zoneinfo/Regione/Città /etc/localtime\n```\n\nEseguire hwclock(8) per generare /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nQuesto comando presuppone che il proprio orologio hardware sia impostato su UTC. Per ulteriori dettagli, vedere System time#Time standard.\n\nPer evitare che deviazioni dell'orologio e garantirne la precisione, impostare la sincronizzazione utilizzando un client Network Time Protocol (NTP) quale systemd-timesyncd.\n\n"
    },
    {
      "title": "Localizzazione",
      "level": 3,
      "content": "Modificare /etc/locale.gen e decommentare it_IT.UTF-8 UTF-8 e altre localizzazioni eventualmente necessarie. Generare le localizzazioni eseguendo:\n\n```\n# locale-gen\n```\n\nCreare il file locale.conf(5), e impostare la variable LANG di conseguenza:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=it_IT.UTF-8\n```\n\nSe si è impostata una mappatura della tastiera, rendere persistente questa modifica in vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=it\n```\n\n"
    },
    {
      "title": "Configurazione della rete",
      "level": 3,
      "content": "Creare il file hostname(5):\n\n```\n/etc/hostname\n```\n\n```\n'proprio_hostname\n```\n\nCompletare la configurazione della rete per l'ambiente appena installato. Questa operazione può includere l'installazione del software preferito per la gestione della rete, la sua configurazione e l'abilitazione della relativa unità systemd in modo che si avvii al boot.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "La creazione di una nuova immagine initramfs non è normalmente necessaria, in quanto mkinitcpio è stato eseguito durante l'installazione del pacchetto kernel con pacstrap.\n\nPer LVM, cifratura del sistema o RAID, modificare mkinitcpio.conf(5) e ricreate l'immagine initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Password di root",
      "level": 3,
      "content": "Impostare la password per l'utente root:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Boot loader",
      "level": 3,
      "content": "Scegli e installa un boot loader compatibile con Linux. Inoltre, se si possiede una CPU Intel o AMD, abilitarne l'aggiornamento del microcodice.\n\n"
    },
    {
      "title": "Reboot",
      "level": 2,
      "content": "Uscire dall'ambiente chroot digitando exit o premendo Ctrl+D.\n\nOpzionalmente smontare manualmente le partizioni con umount -R /mnt: questa operazione permette di rilevare eventuali partizioni \"busy\" (occupata, quindi impossibile da smontare), e di individuarne la causa con fuser(1).\n\nInfine riavviare la macchina digitando reboot: tutte le partizioni ancora montate vengono smontate automaticamente da systemd. Ricordare di rimuovere il supporto di installazione e di eseguire il log nel nuovo sistema con l'account root.\n\n"
    },
    {
      "title": "Post-installazione",
      "level": 2,
      "content": "Vedere Raccomandazioni Generali per la gestione del sistema e per tutorial post installazione (creazione di account utente non privilegiati, impostazione di un'interfaccia utente grafica, suoni o un eventuale touchpad).\n\nPer un elenco di applicazioni di potenziale interesse, vedere Lista delle applicazioni.\n\n"
    }
  ]
}