{
  "title": "HASEE K650D i7 D3",
  "url": "https://wiki.archlinux.org/title/HASEE_K650D_i7_D3",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThe HASEE K650D-i7-D3 is a powerful laptop, on which Arch Linux runs fine. For a lightweight window manager, some additional configuration should be setup.\n\n"
    },
    {
      "title": "Touchpad synaptics",
      "level": 2,
      "content": "xf86-input-synaptics should be installed for a lightweight window manager (but not Gnome or KDE). In some cases, addition configuration is necessary for single-click, double-click and middle-click:\n\n```\n/etc/X11/xorg.conf.d/70-synaptics.conf\n```\n\n```\nSection \"InputClass\"\n    Identifier \"touchpad\"\n    Driver \"synaptics\"\n    MatchIsTouchpad \"on\"\n        Option \"TapButton1\" \"1\"\n        Option \"TapButton2\" \"3\"\n        Option \"TapButton3\" \"2\"\nEndSection\n```\n\nFor details, see Touchpad Synaptics.\n\n"
    },
    {
      "title": "Backlight",
      "level": 2,
      "content": "Hot keys for backlight might not work after installation of Arch Linux, so xorg-xbacklight is necessary for backlight configuration. See Backlight#xbacklight.\n\n"
    },
    {
      "title": "Video cards",
      "level": 2,
      "content": "Install bumblebee along with Nvidia and Intel drivers. nvidia-dkms is recommended for auto configuration after kernel updates. Acceleration mode of the Intel video card should be changed to \"uxa\", according to Intel graphics#AccelMethod, so that firefox will not fail to scroll smoothly, and 3D games will run normally.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "After regular sound check, additional configuration should be conducted. Run aplay -l to find default build-in Audio Analog Stereo. In current machine, you can find the card ID with 1 and the device ID with 0. Then following configuration file can be created as following:\n\n```\n~/.asoundrc\n```\n\n```\ndefaults.pcm.card 1\ndefaults.pcm.device 0\ndefaults.ctl.card 1\n```\n\nAfter that, run alsamixer to unmute.\n\n"
    },
    {
      "title": "Webcam",
      "level": 2,
      "content": "The webcam works out of the box. In order to test the device, see Webcam setup#Applications.\n\n"
    },
    {
      "title": "Software access point",
      "level": 2,
      "content": "A Wi-Fi access point can be created in this computer following Software access point. However, WPA/WPA2 will not work properly in channel 1 ~ 9, so channel must be set at 10 or more in the configuration:\n\n```\n/etc/hostapd/hostapd.conf\n```\n\n```\nchannel=10\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Laptop\n- Microcode should be installed for cpu.\n- UEFI/GPT mode is recommended for a rapid boot process; the default boot logo can be hidden under UEFI.\n- Micphone should be set to 0, and webcam should be covered for potential risk.\n\n"
    }
  ]
}