{
  "title": "Hauppauge Nova-T Stick",
  "url": "https://wiki.archlinux.org/title/Hauppauge_Nova-T_Stick",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The Hauppauge Nova-T Stick is an USB2.0 DVB-T tuner with an additional antenna port. It features:\n\n- Microtune MT2060 tuner\n- Dibcom DVB-T demodulator\n- USB 2.0 controller\n- Remote control\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Plug in your Nova-T Stick. You should see the following:\n\n```\n# dmesg\n```\n\n```\nusb 2-3: new high speed USB device using ehci_hcd and address 5\nusb 2-3: configuration #1 chosen from 1 choice\ndvb-usb: found a 'Hauppauge Nova-T Stick' in cold state, will try to load a firmware\ndvb-usb: did not find the firmware file. (dvb-usb-dib0700-01.fw) Please see linux/Documentation/dvb/ for more details on firmware-problems. (-2)\n```\n\nThe stick has been recognized, but it is not working yet because the firmware was missing. Download the firmware file and copy it to /lib/firmware.\n\nDepending on your box number (e.g. 293) or device number (e.g. 70009), the kernel may require the firmware version to be dvb-usb-dib0700-01.fw. Either rename the firmware linked above or use a link.\n\nPlug in the USB stick again, the result should look like this:\n\n```\n# dmesg\n```\n\n```\nusb 2-3: new high speed USB device using ehci_hcd and address 7\nusb 2-3: configuration #1 chosen from 1 choice\ndvb-usb: found a 'Hauppauge Nova-T Stick' in cold state, will try to load a firmware\ndvb-usb: downloading firmware from file 'dvb-usb-dib0700-01.fw'\ndib0700: firmware started successfully.\ndvb-usb: found a 'Hauppauge Nova-T Stick' in warm state.\ndvb-usb: will pass the complete MPEG2 transport stream to the software demuxer.\nDVB: registering new adapter (Hauppauge Nova-T Stick).\nDVB: registering frontend 0 (DiBcom 7000PC)...\nMT2060: successfully identified (IF1 = 1220)\ndvb-usb: Hauppauge Nova-T Stick successfully initialized and connected.\n```\n\n"
    },
    {
      "title": "User permissions",
      "level": 3,
      "content": "In order to have access to the USB stick, you will have to add yourself to the video user group.\n\n"
    },
    {
      "title": "Getting channels",
      "level": 3,
      "content": "Install linuxtv-dvb-appsAUR.\n\nWe need a initial scan file. This file is needed for scan to work properly. It provides a frequency that scan is going to use as a starting point from which it will proceed with its scan. These files are specific to your geographic location and have the form of cc-Location, where cc is a two-letter country code. You will find scan files in the official dvb-apps repository[dead link 2024-07-30 ⓘ].\n\nIf you cannot find a suitable initial scan file, then you can build your own with w_scan_cppAUR:\n\n```\n$ w_scan -x > cc-Location\n```\n\nFor example in Leipzig, Germany; you would look for a file called de-Leipzig:\n\n```\n$ scan de-Leipzig > leipzig.conf\n```\n\nAfter a few seconds, the scan should finish and all found channels will been written into leipzig.conf.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Various players such as kaffeine, xine-ui, MPlayer or VLC media player should be able to open the previously created leipzig.conf to watch TV.\n\n"
    },
    {
      "title": "External Links",
      "level": 2,
      "content": "- Official LinuxTV site\n- Hauppauge Germany product page[dead link 2025-01-19 ⓘ]\n\n"
    }
  ]
}