{
  "title": "HDR Video Playback",
  "url": "https://wiki.archlinux.org/title/HDR_Video_Playback",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Steam\n- Gaming\n- Gamescope\n\nThis page will serve as a guide to the current state of HDR monitor support on Linux. To better understand the challenges involved you can watch the Harry Wentland presentation \"Is HDR Harder?\" from the X.Org Developers' Conference from 2022.\n\nSupport for HDR is merged in Wayland and some compositors have begun to implement it.\n\nX.org has no plan to support HDR.\n\nOther progress includes:\n\n- KDE Plasma 6.0 introduced experimental HDR support for Wayland session.\n- DRM clients can directly pass HDR metadata, but this is not available from regular userspace clients, only specialized software can use it.\n- COSMIC developers have promised HDR support in the initial stable release.\n- Hyprland introduced HDR support since #8715.\n- Wlroots, \"HDR10 support\" issue.\n- GNOME 48-beta introduces HDR support and toggle under Wayland.\n\n"
    },
    {
      "title": "Requirements",
      "level": 2,
      "content": "- HDR capable display.\n- HDR capable graphics driver: AMDGPU and NVIDIA (550.54.14+) are confirmed to work. A bug in NVIDIA before 565.57.01 will cause colors to appear washed out in HDR. [1]\n- A supported display server, see #Configuration\n- A program with HDR support: Games: List of games supporting HDR. Video players: mpv. Web browsers: No web browsers officially support HDR on Linux at this time. Firefox 137.0 introduced hidden preference gfx.wayland.hdr ; HDR support still in progress [2] [3].\n- A supported compatibility layer if playing Windows games: Wine or Steam Proton. DXVK (2.1+) or VKD3D-Proton (2.8+), depending on DirectX version used by the game. Tip: Use either Proton 8.0, Experimental, or Proton GE 44+. All come packaged with sufficient DXVK and VKD3D versions.\n\n- A bug in NVIDIA before 565.57.01 will cause colors to appear washed out in HDR. [1]\n\n- Games: List of games supporting HDR.\n- Video players: mpv.\n- Web browsers: No web browsers officially support HDR on Linux at this time. Firefox 137.0 introduced hidden preference gfx.wayland.hdr ; HDR support still in progress [2] [3].\n\n- DXVK (2.1+) or VKD3D-Proton (2.8+), depending on DirectX version used by the game. Tip: Use either Proton 8.0, Experimental, or Proton GE 44+. All come packaged with sufficient DXVK and VKD3D versions.\n\n"
    },
    {
      "title": "KDE Plasma",
      "level": 3,
      "content": "See KDE#HDR.\n\n"
    },
    {
      "title": "Hyprland",
      "level": 3,
      "content": "See https://wiki.hyprland.org/Configuring/Variables/#experimental\n\n"
    },
    {
      "title": "Gamescope with Steam session",
      "level": 3,
      "content": "Valve's Steam compositor gamescope offers experimental HDR support. Following these steps will allow you to try out Valve's Steam client running through the HDR capable gamescope.\n\n- Install gamescope and gamescope-session-steam-gitAUR\n- You may create the optional config file ~/.config/environment.d/gamescope-session.conf with the following content: if [ \"$XDG_SESSION_DESKTOP\" = \"gamescope\" ] ; then SCREEN_WIDTH=1920 SCREEN_HEIGHT=1080 CONNECTOR=*,eDP-1 CLIENTCMD=\"steam -gamepadui -pipewire-dmabuf\" GAMESCOPECMD=\"/usr/bin/gamescope --hdr-enabled --hdr-itm-enable \\ --hide-cursor-delay 3000 --fade-out-duration 200 --xwayland-count 2 \\ -W $SCREEN_WIDTH -H $SCREEN_HEIGHT -O $CONNECTOR\" fi Update the resolution values above to the correct ones. You can list your displays by running xrandr --query. You may need to set the Display CONNECTOR if it does not pick the right one by default.\n\n```\nif [ \"$XDG_SESSION_DESKTOP\" = \"gamescope\" ] ; then\n    SCREEN_WIDTH=1920\n    SCREEN_HEIGHT=1080\n    CONNECTOR=*,eDP-1\n    CLIENTCMD=\"steam -gamepadui -pipewire-dmabuf\"\n    GAMESCOPECMD=\"/usr/bin/gamescope --hdr-enabled --hdr-itm-enable \\\n    --hide-cursor-delay 3000 --fade-out-duration 200 --xwayland-count 2 \\\n    -W $SCREEN_WIDTH -H $SCREEN_HEIGHT -O $CONNECTOR\"\nfi\n```\n\n- Update the resolution values above to the correct ones. You can list your displays by running xrandr --query.\n- You may need to set the Display CONNECTOR if it does not pick the right one by default.\n\nYou can now start gamescope from your login manager or a terminal using one of the following steps:\n\n"
    },
    {
      "title": "Via a login manager",
      "level": 4,
      "content": "Log out and select the Steam Big Picture in your login manager and log in.\n\n"
    },
    {
      "title": "Via the command line",
      "level": 4,
      "content": "1. Go to a new TTY by pressing Ctrl+Alt+F2\n1. Log in and run gamescope-session-plus steam to start the standalone steam session in HDR. If networking does not work you can fix it by installing and enabling NetworkManager.\n\n- If networking does not work you can fix it by installing and enabling NetworkManager.\n\n"
    },
    {
      "title": "Configure Steam",
      "level": 4,
      "content": "1. In the general settings, under Display, you should now see HDR settings. Enable HDR and Experimental HDR Support.\n1. Select an HDR compatible game and click on the cog next to it.\n1. Set Compatibility to Force Proton 8.0 or Proton Experimental.\n1. Set Game Resolution to match your monitor otherwise it will launch at Steam Deck native resolution.\n1. Click Play to start the game. Check the in-game settings to see if the HDR setting is available and enable it.\n1. To switch back to your normal session, select Power and Switch to desktop mode from the Steam menu.\n\n"
    },
    {
      "title": "Lutris with Wine/Proton without Gamescope",
      "level": 3,
      "content": "Use a build of Wine that has native Wayland support, such as Proton-with-Wayland. Then add the environment variables DXVK_HDR=1 and ENABLE_HDR_WSI=1 when starting the game.\n\n"
    },
    {
      "title": "mpv",
      "level": 3,
      "content": "Start mpv with the flag --vo=dmabuf-wayland.\n\n"
    },
    {
      "title": "Requirements",
      "level": 4,
      "content": "Ensure you have GNOME 48 or higher.\n\nInstall vk-hdr-layer-kwin6-gitAUR.\n\n"
    },
    {
      "title": "Enabling HDR",
      "level": 4,
      "content": "Enable HDR in GNOME's display settings. The HDR toggle is per-monitor and is located next to the resolution and refresh rate setting.\n\nTo use HDR see KDE#Games and KDE#Video.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- https://zamundaaa.github.io/wayland/2023/12/18/update-on-hdr-and-colormanagement-in-plasma.html\n- https://github.com/ChimeraOS/gamescope-session/tree/main\n- https://www.reddit.com/r/linux_gaming/comments/10m2gyx/guide_alpha_test_hdr_on_linux/\n- https://forums.developer.nvidia.com/t/plasma-6-0-hdr-success-report/284564\n\n"
    }
  ]
}