{
  "title": "HowTo: TeXlive and CJK",
  "url": "https://wiki.archlinux.org/title/HowTo:_TeXlive_and_CJK",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "A guide for typesetting Chinese, Japanese, and Korean documents with TeX Live.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Language-specific fonts and macro packages are made available by installing the appropriate package(s) from the texlive-lang group:\n\n- texlive-langchinese\n- texlive-langjapanese\n- texlive-langkorean\n\nOther fonts can be installed through methods outlined in Fonts#Installation. You may also be interested in making Tex Live fonts available to Fontconfig (but this is not strictly necessary).\n\nUsers of poppler-based PDF viewers like Evince should install poppler-data as an additional dependency to properly display PDF documents containing CJK characters. (This appears unnecessary if CJK fonts from noto-fonts-cjk are used.)\n\nNeedless to say, your locale should have a character encoding that can deal with special characters (such as UTF-8) and you should also have an input method editor installed. The (Simplified/Traditional) Chinese, Japanese, and Korean subpages of Localization also contain information pertaining to locales and fonts.\n\n"
    },
    {
      "title": "Typesetting",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nOverleaf's online documentation has articles covering different methods for CJK typesetting that are also applicable to TeX Live installations on Arch Linux:\n\n- https://overleaf.com/learn/latex/Chinese\n- https://overleaf.com/learn/latex/Japanese\n- https://overleaf.com/learn/latex/Korean\n\n"
    },
    {
      "title": "Fonts",
      "level": 3,
      "content": "A table of the font families/files mentioned in the Overleaf articles, and their respective packages can be found below:\n\nTable content:\nLanguage | Font family/file | Package\nChinese | BabelStone Han | ttf-babelstone-hanAUR\nJapanese | IPAMincho | otf-ipafont\nIPAGothic\nTakaoMincho | otf-takaoAUR\nTakaoGothic\nKomatuna | ttf-komatunaAUR\nKorean | UnGungseo.ttf | texlive-langkorean\ngulim.ttf\n\nYou can set fonts with \\setCJKtypefont{font} when using ctex or xeCJK. (\\settypejfont{font} can be used with the pTeX engine.) type can take on the values of main, sans, and mono. font is the font family for user/system fonts and the font file for TeX Live fonts.\n\n"
    },
    {
      "title": "pTeX engine",
      "level": 3,
      "content": "Overleaf's Japanese#The pTeX engine provides a latexmkrc file that is meant to be used with the latemk utility from texlive-doc. Running latexmk on Arch Linux without any arguments will only produce a DVI file from the example document. Use the -pdfdvi option to also produce a PDF file from the DVI file. See latexmk(1) or latexmk -help for more information.\n\nAs briefly mentioned in the Overleaf article, upLaTeX (similarly to pLaTeX) \"provides pLaTeX2ε macros for upTeX\", a \"Unicode version of pTeX\".\n\n"
    },
    {
      "title": "CTeX-kit",
      "level": 3,
      "content": "Solutions to common problems when using a CTeX-kit collection/package like ctex or xeCJK.\n\n"
    },
    {
      "title": "ctexhook.sty not found",
      "level": 4,
      "content": "The following error may be encountered when compiling a Japanese or Korean document:\n\n```\n! LaTeX Error: File `ctexhook.sty' not found.\n```\n\nInstall the texlive-langchinese package to obtain ctexhook.sty. This is required even for non-Chinese typeset documents.\n\n"
    },
    {
      "title": "Missing or inconsistent fonts",
      "level": 4,
      "content": "Japanese or Korean PDF documents may have missing characters or inconsistent font weights. When no CJK font is specified, the default font Fandol will be used. However, Fandol is \"designed for Chinese typesetting\" and thus unsuitable for Japanese and Korean. Explicitly set a Japanese or Korean font to avoid this issue.\n\n"
    },
    {
      "title": "LuaLaTeX",
      "level": 3,
      "content": "Solutions to common problems when using LuaLaTeX to compile documents.\n\n"
    },
    {
      "title": "luatexja.sty not found",
      "level": 4,
      "content": "The following error may be encountered when compiling a Chinese or Korean document with a ctex document class:\n\n```\n! LaTeX Error: File `luatexja.sty' not found.\n```\n\nInstall the texlive-langjapanese package to obtain luatexja.sty. This is required even for non-Japanese typeset documents.\n\n"
    },
    {
      "title": "Resource problems with large fonts",
      "level": 4,
      "content": "When using large fonts like those from noto-fonts-cjk, document compilation can be resource intensive and time consuming due to font cache generation. Subsequent compilations should be much quicker though. One possible workaround (besides using a smaller font) is to trim the font by removing glyph names. Bear in mind that doing this may have consequences.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikibooks:LaTeX/Special Characters\n- Wikibooks:LaTeX/Internationalization#Chinese\n- Wikibooks:LaTeX/Internationalization#Japanese\n- Wikibooks:LaTeX/Internationalization#Korean\n\n"
    }
  ]
}