{
  "title": "HP Envy x360 15-bq102ng",
  "url": "https://wiki.archlinux.org/title/HP_Envy_x360_15-bq102ng",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThe HP Envy X360 15-bq102ng was released in 2017. It has a Ryzen Mobile 5 2500u with an integrated Vega 8 GPU and 8GB of DDR4 RAM.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU | 1002:15dd | Yes\nWi-Fi | 10ec:b822 | Yes\nBluetooth | 0bda:b00b | Yes\nAudio | 1022:15e3 | Yes\nTouchpad | PS/2 | Yes\nCamera |  | Yes\nCard Reader | 10ec:522a | Yes\nSensors | 0483:91d1 | Yes\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "This laptop has Secure Boot enabled by default. To start the installer you need to disable it in the UEFI. Then you can just boot the installer in UEFI mode and just install like a normal UEFI system.\n\n"
    },
    {
      "title": "Battery and Power Management",
      "level": 2,
      "content": "On Linux 4.17 I get about 5 hours on light load, like watching youtube. Installing tlp is a good idea. Suspend and Hibernate works.\n\n"
    },
    {
      "title": "Orientation Sensor",
      "level": 2,
      "content": "You currently need to install iio-sensor-proxy and reboot to make the orientation sensor work. This will disable the keyboard and touchpad, and invert the side volume buttons when the screen is held at the right orientation or is folded. The Gnome desktop environment does support the rotation natively. Other desktop enviroments may need extra software. You could compile and use this daemon [1] written in C.\n\n"
    },
    {
      "title": "Hard Drive",
      "level": 2,
      "content": "Built-in NVMe drive works with advertised speed. Blockdevices are loacated at /dev/nvme0n1p*. There is an empty bay for an additional SATA 2.5 inch drive, but you have to buy a proprietary cable.\n\n"
    },
    {
      "title": "Freezes",
      "level": 2,
      "content": "On some devices the laptop freezes randomly (e.g. when surfing on Youtube). A workaround is to set these kernel parameters: idle=nomwait rcu_nocbs=0-7.\n\n"
    }
  ]
}