{
  "title": "HP ProBook 4530s",
  "url": "https://wiki.archlinux.org/title/HP_ProBook_4530s",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) |  | Yes\nGPU (AMD) |  | Yes\nBluetooth |  | Yes\nEthernet |  | Yes\nWireless |  | Yes\nAudio |  | Yes\nWebcam |  | Yes\nCard reader |  | Yes\nTouchpad |  | Yes\n\n"
    },
    {
      "title": "Fan throttling",
      "level": 2,
      "content": "The fan can be controlled (throttled) in software, otherwise it never shuts off, even if the BIOS option \"Fan always on while on AC power\" is disabled. There are two programs supporting the 4530s:\n\n- NoteBook FanControl. NBFC have pre-made profile for HP ProBook 4530s.\n- probook_ec.pl script daemonized in Python and in Ruby\n\n"
    },
    {
      "title": "Intel CPU microcode",
      "level": 2,
      "content": "See Microcode page.\n\n"
    },
    {
      "title": "Network",
      "level": 2,
      "content": "Both the wired and wireless network cards (with the exception of the ralink RT3592 and RT3590) works out-of-the-box. The Atheros card requires the ath9k module, and the Realtek Ethernet card requires the r8169 module. More information can be found at Wireless network configuration#ath9k\n\n"
    },
    {
      "title": "WLAN BIOS whitelist workaround (experimental)",
      "level": 3,
      "content": "HP BIOS allows only certain WLAN cards (whitelisting) to be used. This can be worked around by adding the following as the first GRUB command in every OS entry:\n\n```\nwrite_dword 0xFED1F418 0x1F501FEB\n```\n\nYou can read more on engineering this hack here. It is confirmed to work on the 4330s, 4530s and 4730s, but consider it experimental.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "Sending/receiving files and switching Bluetooth on/off works. The ath3k module is required.\n\n"
    },
    {
      "title": "hciconfig -a",
      "level": 3,
      "content": "```\nhci0:\tType: BR/EDR  Bus: USB\n\tBD Address: D0:DF:9A:91:B2:51  ACL MTU: 1022:8  SCO MTU: 121:3\n\tUP RUNNING PSCAN ISCAN \n\tRX bytes:1823103 acl:11471 sco:0 events:10296 errors:0\n\tTX bytes:334040 acl:9846 sco:0 commands:259 errors:0\n\tFeatures: 0xff 0xfe 0x0d 0xfe 0x98 0x7f 0x79 0x87\n\tPacket type: DM1 DM3 DM5 DH1 DH3 DH5 HV1 HV2 HV3 \n\tLink policy: RSWITCH HOLD SNIFF \n\tLink mode: SLAVE ACCEPT \n\tName: '4530s'\n\tClass: 0x580100\n\tService Classes: Capturing, Object Transfer, Telephony\n\tDevice Class: Computer, Uncategorized\n\tHCI Version: 3.0 (0x5)  Revision: 0x9999\n\tLMP Version: 3.0 (0x5)  Subversion: 0x9999\n\tManufacturer: Atheros Communications, Inc. (69)\n```\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "Intel HD Graphics 3000 is supported by the open-source xf86-video-intel driver. Dual-head with HDMI works. If using hybrid graphics in conjunction with AMD, open-source ATI driver should be used for GPU card (proprietary driver is not available, see Xorg#AMD). For dynamic switching can be used PRIME technology. ATI driver should be installed along with xf86-video-intel to support hybrid (Intel) GPU.\n\n"
    },
    {
      "title": "Brightness",
      "level": 3,
      "content": "Controlling screen brightness with the keystrokes Fn+F2 and Fn+F3 works in Gnome 3, KDE and MATE and has not been tested in other desktop environments.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "Touchpad function works with xf86-input-synaptics package. Disabling touchpad using the top-left corner double tap works with xf86-input-synaptics-ledAUR and synaptics-ledAUR (synaptics-led-dkmsAUR) packages.\n\n"
    },
    {
      "title": "Card reader",
      "level": 3,
      "content": "```\n23:00.0 System peripheral: JMicron Technology Corp. SD/MMC Host Controller (rev 30)\n23:00.2 SD Host controller: JMicron Technology Corp. Standard SD Host Controller (rev 30)\n23:00.3 System peripheral: JMicron Technology Corp. MS Host Controller (rev 30)\n```\n\nSD cards tested and working. With 3.4.7 kernel, Memory Stick card works as intended.\n\n"
    },
    {
      "title": "Function keys",
      "level": 3,
      "content": "Module hp-wmi is likely to be required for the keys to work. In Gnome 3 and MATE every Fn+F* key works. Fn-F6 key requires gnome-power-manager installed. Keys above numeric keypad are also recognized. The Web key has a XF86HomePage symbol (opens home page), Wi-Fi key has NoSymbol and switch fly mode in Gnome 3 (has not been tested in other desktop environments).\n\n"
    },
    {
      "title": "Camera",
      "level": 3,
      "content": "Works with uvcvideo module.\n\n"
    },
    {
      "title": "HP DriveGuard",
      "level": 3,
      "content": "Works with hpfall-gitAUR package.\n\n"
    },
    {
      "title": "Power",
      "level": 2,
      "content": "Module acpi-cpufreq and at least one of CPU governors (cpufreq_ondemand, cpufreq_conservative, etc.) are required. More information on CPU frequency scaling.\n\n- With laptop-mode-tools, tune from powertop2 and i915_enable_rc6 parameter I was able to get about 5:30h of estimated battery life.\n- Keep in mind that the powertop \"good/bad\" parameters will not survive a reboot. As of 3.4.x rc6 is enabled by default for Ivy Bridge and Sandy Bridge processors. The default (marked -1) is equivalent of i915_enable_rc6=3 which enables rc6 and rc6p. An additional, lower power state can also be enabled by using i915_enable_rc6=7, though this has been reported to sometimes come at the cost of stability. Also, as of 2011Q4 the i915 module in Sandy Bridge and Ivy Bridge also have framebuffer compression enabled by default.\n\n"
    },
    {
      "title": "Suspend and hibernation",
      "level": 2,
      "content": "Both suspend and hibernation work with pm-utils and kernel backend.\n\n"
    },
    {
      "title": "Sensors",
      "level": 3,
      "content": "lm_sensors shows one acpitz-virtual device with 4 working temperature readings and coretemp-isa device which has one sensor for each CPU core. It does not show any info about fans RPMs.\n\n"
    }
  ]
}