{
  "title": "I2P",
  "url": "https://wiki.archlinux.org/title/I2P",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Tor\n- GNUnet\n- Freenet\n\nI2P is an anonymizing network, offering a simple layer that identity-sensitive applications can use to securely communicate. All data is wrapped with several layers of encryption, and the network is both distributed and dynamic, with no trusted parties. Many applications are available that interface with I2P, including mail, peer-peer, IRC chat, and others.\n\nTwo implementations of I2P are as follows:\n\n- I2P — Written in Java. First development. Most interactive and user-friendly web user interface and features, has a built-in client of email (SusiMail) and torrent (I2PSnark).\n- i2pd — Alternative development. Does not require Java, is written in C++, consumes less memory and CPU.\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "The standard I2P suite is available with the i2pAUR and i2p-binAUR packages. Both require a Java Runtime Environment. A recent Sun/Oracle Java or OpenJDK version with \"mixed mode\" support is recommended, \"interpreted mode\" could result in performance degradation, check with \"java -version\".\n\nThe I2P homepage also provides a pre-compiled binary which includes command line (headless) option and can be installed in the user's home directory. Such an installation will auto update through the i2p network with signed zip packages directly from the i2p developers.\n\n"
    },
    {
      "title": "Usage",
      "level": 3,
      "content": "Start/enable i2prouter.service in case of i2pAUR. For the pre-compiled binary, run i2prouter in a terminal and see the available options.\n\nOpen your browser of choice and visit the I2P welcome page at 127.0.0.1:7657 for the suite (see the FAQ). From here you can navigate to I2Ps configuration and statistics pages, and links to Eepsites. Also, be aware that eepsites are unavailable until the daemon has bootstrapped to the network, which can take several minutes. In order to visit eepsites configure your browser to use the local proxy:\n\n```\nHTTP  127.0.0.1 4444\n```\n\n"
    },
    {
      "title": "Eepsite",
      "level": 3,
      "content": "To make an eepsite, follow the I2P instructions, but keep in mind that the home directory will apply to the i2p user whose home directory is /opt/i2p as shown in the AUR i2p.install file.\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "Install the i2pd package for the daemon written in C++ which may suit hardware with limited resources or i2pd-gitAUR for the development version.\n\n"
    },
    {
      "title": "Usage",
      "level": 3,
      "content": "Start/enable i2pd.service.\n\nThe configuration is made in /etc/i2pd/i2pd.conf. Open your browser of choice and visit the I2P welcome page at 127.0.0.1:7070 In order to visit eepsites configure your browser to use the local proxy:\n\n```\nHTTP  127.0.0.1 4444\nSOCKS 127.0.0.1 4447\n```\n\ni2pd has no built-in email client, filesharing or webserver for Eepsite. See the How-To / Tutorials in upstream documentation for more details, also for chat servers, XMPP / Jabber or RetroShare.\n\n"
    },
    {
      "title": "Eepsite",
      "level": 3,
      "content": "Tools required to register your site on http://reg.i2p/add and/or http://stats.i2p/i2p/addkey.html are included in i2pd-tools-gitAUR, see the readme for usage documentation.\n\n"
    },
    {
      "title": "Firefox: wrong redirect to a search engine",
      "level": 3,
      "content": "After entering an i2p page, e.g. \"zzz.i2p\" Firefox will try to redirect wrongly to duckduckgo.com or www.google.com. Since most i2p does not provide https, enter your address always explicit with the http protocol prefix, e.g. http://zzz.i2p/\n\nAlternatively, navigate to about:config and create a new boolean config variable named browser.fixup.domainsuffixwhitelist.i2p and set its value to true.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- I2P FAQ\n- I2P on Wikipedia\n- I2P Homepage mirror\n- i2pd daemon homepage\n- i2pd documentation\n\n"
    }
  ]
}