{
  "title": "IBM ThinkPad X120e",
  "url": "https://wiki.archlinux.org/title/IBM_ThinkPad_X120e",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\n"
    },
    {
      "title": "Wireless",
      "level": 2,
      "content": "The Thinkpad x120e is available with one of two wireless cards.\n\n- The Realtek BGN Wi-Fi card is currently supported out of the box by the rtl8192ce driver, which was integrated into the Linux kernel as of version 3.2. This card, however, suffers from access point association and connection stability problems, especially in meshed wireless networks due to poor wireless radius detection. Since driver development by Realtek effectively stopped as of January 2012, the general consensus among many owners online has been to swap out this wireless card for a different better supported half-mini PCI card such as the Intel 6230. This however requires a BIOS patch to remove Lenovo's hardware restriction on which wireless cards can be used in the computer. More information in regards to that can be found in this thread.\n\n- The Broadcom ABGN Wi-Fi card is currently supported by the b43 driver. This driver is recommended over the broadcom-wl.\n\n(Note from the ThinkWiki the Realtek card is either FRU 60Y3247 or 60Y3249, the Broadcom is FRU 60Y3251 - which should work without needing modification of the bios)\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "The kernel modules work, but the HDMI audio is the primary device (not the speaker). You can swap that:\n\n```\n$ vim ~/.asoundrc\n```\n\n```\ndefaults.pcm.card 1\ndefaults.pcm.device 0\ndefaults.ctl.card 1\n```\n\nNote: Alternatively, you can accomplish the same thing by configuring the snd-hda-intel module:\n\n```\n$ grep snd-hda-intel /etc/modprobe.d/snd-hda-intel.conf\n```\n\n```\noptions snd-hda-intel index=1\n```\n\nBy specifying index you should no longer specify the default in ~/.asoundrc.\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "Suspend works out of the box, but hibernate may fail - the system usually hangs with a black screen and a blinking power button led. To fix this we need to modify the hibernation mode; using pm-utils is just a matter of creaing a file /etc/pm/config.d/hibernate_mode containing a single line:\n\n```\nHIBERNATE_MODE=\"shutdown\"\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- IBM ThinkPad X100e\n- X120e on ThinkWiki\n- Undervolting the AMD Fusion with PHC-tool\n\n"
    }
  ]
}