{
  "title": "IBM ThinkPad X100e",
  "url": "https://wiki.archlinux.org/title/IBM_ThinkPad_X100e",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is a candidate for merging with Laptop/Lenovo#X series.** This article or section is a candidate for merging with Laptop/Lenovo#X series.\n\nThis article or section is a candidate for merging with Laptop/Lenovo#X series.\n\nNote: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\n"
    },
    {
      "title": "Wireless",
      "level": 2,
      "content": "Thinkwiki reports that Wi-Fi should work out of the box on kernels 2.6.32-22.33 but this did not seem to be the case as of 2.6.35. Others may have better success with out of the box support and if so please note here.\n\nIf using the Intel 5100 agn Wi-Fi card (must be the Lenovo part, FRU 43Y6517, as the BIOS detects non-Lenovo cards and will fail to boot) the card will work out of the box 2.6.35 or later (possibly earlier kernels as well, but those weren’t tested in this write-up).\n\nIf you find that you cannot make use of your wireless interface due to the following error:\n\n```\n# ip link set dev eth0 up\n```\n\n```\nSIOCSIFFLAGS: Operation not possible due to RF-kill\n```\n\nAnd you see the interface as \"Hard blocked\" by rfkill:\n\n```\n# rfkill list\n```\n\n```\n0: phy0: Wireless LAN\n        Soft blocked: no\n        Hard blocked: yes\n```\n\nTry these steps:\n\n1. Reboot.\n1. When the ThinkPad splash appears, press Enter, then F1 to access the BIOS configuration interface.\n1. Go to Config > Network.\n1. Enable Wireless LAN and WiMAX Radios.\n1. Press F10 and save changes.\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "Poweroff stalls unless clocksource-jiffies kernel parameter is set. There may be other work arounds or kernel parameters that would address this. noalpic-timer parameter also works but results in failure to bring CPUs up to high res mode (though I assume jiffies prevents high res mode too... out of my depth here and will be researching more).\n\nUpon resume from suspend to ram, there are rare incidents of the filesystem not mounting properly and being set to a read-only state due to a journaling failure at the time of suspend. This seems to be addressed in a patch submitted for inclusion in kernel 2.6.36-rc4. It is unclear whether this is related to the x100e alone, the Intel X25-V alone, or the specific combination of unit/drive. It is rare enough in the installation described here that no steps have been taken to patch ahead of expected availabilty of kernel 2.6.36.\n\n"
    }
  ]
}