{
  "title": "Il Metodo Arch",
  "url": "https://wiki.archlinux.org/title/Il_Metodo_Arch",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "This page is intended to be a page to demystify common terms used among the Arch Linux community. Feel free to add or modify any terms, but please use that particular section's edit option. If you decide to add one, put it in alphabetical order.\n\n"
    },
    {
      "title": "ABS",
      "level": 2,
      "content": "ABS stands for Arch build system.\n\n"
    },
    {
      "title": "Arch Linux",
      "level": 2,
      "content": "Arch should be referred to as:\n\n- Arch Linux\n- Arch (Linux implied)\n- archlinux (UNIX name)\n\nArchlinux, ArchLinux, archLinux, aRcHlInUx, etc. are all weird, and weirder mutations.\n\nOfficially, the 'Arch' in \"Arch Linux\" is pronounced /ɑːrtʃ/ as in an \"archer\"/bowman, or \"archnemesis\", and not as in \"ark\" or \"archangel\".\n\n"
    },
    {
      "title": "Arch Linux Archive",
      "level": 2,
      "content": "The Arch Linux Archive (a.k.a ALA), formerly known as Arch Linux Rollback Machine (a.k.a ARM), stores official repositories snapshots, ISO images and bootstrap tarballs across time.\n\n"
    },
    {
      "title": "AUR",
      "level": 2,
      "content": "The Arch User Repository (AUR) is a community-driven repository for Arch users. It contains package descriptions (PKGBUILDs) that allow you to build a package from source with makepkg and then install it via pacman. The AUR was created to organize and share new packages from the community and to help expedite popular packages' inclusion into the extra repository.\n\nA good number of new packages that enter the official repositories start in the AUR. In the AUR, users are able to contribute their own package builds (PKGBUILD and related files). The AUR community has the ability to vote for or against packages in the AUR. If a package becomes popular enough — provided it has a compatible license and good packaging technique — it may be entered into the extra repository (directly accessible by pacman or the ABS).\n\nYou can access the Arch Linux User Community Repository here.\n\n"
    },
    {
      "title": "bbs",
      "level": 2,
      "content": "Bulletin board system, but in Arch's case, it is just the support forum located here.\n\n"
    },
    {
      "title": "core/[core]",
      "level": 2,
      "content": "The core repository contains the bare packages needed for an Arch Linux system. core has everything needed to get a working command-line system.\n\n"
    },
    {
      "title": "custom/user repository",
      "level": 2,
      "content": "Anyone can create a repository and put it online for other users. To create a repository, you need a set of packages and a pacman-compatible database file for your packages. Host your files online and everyone will be able to use your repository by adding it as a regular repository.\n\nSee Custom local repository.\n\n"
    },
    {
      "title": "Developer",
      "level": 2,
      "content": "Half-gods working to improve Arch for no financial gain. Developers are outranked only by our gods, Judd Vinet and Aaron Griffin, who in turn are outranked by tacos.\n\n"
    },
    {
      "title": "extra/[extra]",
      "level": 2,
      "content": "Arch's core package set is fairly streamlined, but we supplement this with a larger, more complete extra repository. This repository is constantly growing with the help of packages submitted from our strong community. This is where desktop environments, window managers and common programs are found.\n\n"
    },
    {
      "title": "initramfs/initrd",
      "level": 2,
      "content": "See mkinitcpio.\n\n"
    },
    {
      "title": "KISS",
      "level": 2,
      "content": "Acronym of Keep It Simple, Stupid. Simplicity is a main principle Arch Linux tries to achieve.\n\n"
    },
    {
      "title": "makepkg",
      "level": 2,
      "content": "makepkg will build packages for you. makepkg will read the metadata required from a PKGBUILD file. All it needs is a build-capable Linux platform, curl, and some build scripts. The advantage to a script-based build is that you only really do the work once. Once you have the build script for a package, you just need to run makepkg and it will do the rest: download and validate source files, check dependencies, configure the build time settings, build the package, install the package into a temporary root, make customization, generate meta-info, and package the whole thing up for pacman to use.\n\n"
    },
    {
      "title": "namcap",
      "level": 2,
      "content": "namcap is a package analysis utility that looks for problems with Arch Linux packages or their PKGBUILD files. It can apply rules to the file list, the files themselves, or individual PKGBUILD files.\n\nRules return lists of messages. Each message can be one of three types: error, warning, or information (think of them as notes or comments). Errors (designated by 'E:') are things that namcap is very sure are wrong and need to be fixed. Warnings (designated by 'W:') are things that namcap thinks should be changed but if you know what you are doing then you can leave them. Information (designated 'I:') are only shown when you use the info argument. Information messages give information that might be helpful but is not anything that needs changing.\n\n"
    },
    {
      "title": "package",
      "level": 2,
      "content": "See pacman#Installing packages.\n\n"
    },
    {
      "title": "Package maintainer",
      "level": 2,
      "content": "The role of a package maintainer is to update packages as new versions become available upstream and to field support questions relating to bugs in said packages. The term applies to:\n\n- Arch staff previously called Trusted Users (TU) who maintain packages in the extra repository and oversee the AUR. They are appointed by a majority vote by the existing package maintainers and they follow the AUR Package Maintainer guidelines and Package Maintainer Bylaws.\n- Developers who maintain packages in the official repositories (core in particular).\n- All users who maintain PKGBUILDs in the AUR.\n\nThe maintainer of a package is the person currently responsible for the package. Previous maintainers should be listed as contributors in the PKGBUILD along with others who have contributed to the package.\n\n"
    },
    {
      "title": "pacman",
      "level": 2,
      "content": "See pacman.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 2,
      "content": "PKGBUILDs are small scripts that are used to build Arch Linux packages. See Creating packages for more detail.\n\n"
    },
    {
      "title": "Repository (repo)",
      "level": 2,
      "content": "A repository has the pre-built packages of one or (usually) more PKGBUILDs. Official repositories are split into different parts for easy maintenance. Pacman uses these repositories to search for packages and install them. A repository can be local (i.e. on your own computer) or remote (i.e. the packages are downloaded before they are installed).\n\n"
    },
    {
      "title": "RTFM",
      "level": 2,
      "content": "RTFM stands for \"Read The Friendly Manual\". This simple message is replied to a lot of new Linux/Arch users who ask about the functionality of a program when it is clearly defined in the program's manual.\n\nThis acronym is an invitation to self-care, not an insult. It is often used when a user is seen as failing to make any attempt to find a solution to the problem themselves. If someone tells you this, they are not trying to offend you; they are just feeling frustrated with a perceived lack of effort.\n\nThe best thing to do if you are told to do this is to read the manual page. To read the program manual page for a particular program named PROGRAM-NAME, type this at the command line: man PROGRAM-NAME.\n\nIf you do not find the answer to your question in the program manual, there are more ways to find the answer. You can:\n\n- search the wiki\n- search the forum\n- search the mailing lists\n- search the web\n\n"
    },
    {
      "title": "Testing repositories",
      "level": 2,
      "content": "They are the repositories where major packages/updates to packages are kept prior to release into the main repositories, so they can be bug tested and upgrade issues can be found. They are disabled by default but can be enabled in /etc/pacman.conf.\n\n"
    },
    {
      "title": "The Arch Way",
      "level": 2,
      "content": "The unofficial term traditionally used to refer to the main Arch Linux principles.\n\n"
    },
    {
      "title": "Trusted User (TU)",
      "level": 2,
      "content": "See #Package maintainer.\n\n"
    },
    {
      "title": "wiki",
      "level": 2,
      "content": "Our wiki is a place to find documentation about Arch Linux. Anyone can contribute to the documentation.\n\n"
    }
  ]
}