{
  "title": "Incrond",
  "url": "https://wiki.archlinux.org/title/Incrond",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "incron is an \"inotify cron\" system. It consists of a daemon and a table manipulator. You can use it a similar way as the regular cron. The difference is that the inotify cron handles filesystem events rather than time periods.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the incron package.\n\n"
    },
    {
      "title": "Activation and autostart",
      "level": 2,
      "content": "After installation, the daemon will not be enabled by default. You can enable incrond.service.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Incrontabs should never be edited directly; instead, users should use the incrontab program to work with their incrontabs.\n\n"
    },
    {
      "title": "Using incrontab",
      "level": 3,
      "content": "To view their incrontabs, users should issue the command:\n\n```\n$ incrontab -l\n```\n\nTo edit their incrontabs, they should use:\n\n```\n$ incrontab -e\n```\n\nTo remove their incrontabs, they may use:\n\n```\n$ incrontab -r\n```\n\nTo reload incrond, use:\n\n```\n$ incrontab -d\n```\n\nTo edit another user's incrontab, isue the following command:\n\n```\n# incrontab -u user -e\n```\n\n"
    },
    {
      "title": "Incrontab format",
      "level": 3,
      "content": "Each row in an incrontab file is a table that the dameon runs when an event happens to a certain directory or file.\n\nThe basic format for an incrontab is:\n\n```\npath mask command\n```\n\n"
    },
    {
      "title": "Mask types",
      "level": 4,
      "content": "incrontab uses mask types to specify which file system event to monitor for. For more options see inotify(7)\n\nTo trigger a command if a file is accessed or read:\n\n```\nIN_ACCESS\n```\n\nTo trigger a command if metadata of a file change (e.g. timestamps, permissons):\n\n```\nIN_ATTRIB\n```\n\nTo trigger a command if a file opened for writing is closed:\n\n```\nIN_CLOSE_WRITE\n```\n\nTo trigger a command if a file or directory not opened for writing is closed:\n\n```\nIN_CLOSE_NOWRITE\n```\n\nTo trigger a command if a file or directory is created in a watched directory:\n\n```\nIN_CREATE\n```\n\nTo trigger a command if a file or directory is deleted from a watched directory:\n\n```\nIN_DELETE\n```\n\nTo trigger a command if a watched file or directory is deleted (or moved to a different filesystem):\n\n```\nIN_DELETE_SELF\n```\n\nTo trigger a command if a file was modified:\n\n```\nIN_MODIFY\n```\n\nTo trigger a command if a watched file or directory is moved within the filesystem:\n\n```\nIN_MOVE_SELF\n```\n\nTo trigger a command if a file or directory is moved out of the watched directory:\n\n```\nIN_MOVED_FROM\n```\n\nTo trigger a command if a file or directory is moved to the watched directory:\n\n```\nIN_MOVED_TO\n```\n\nTo trigger a command if a watched file or directory is opened:\n\n```\nIN_OPEN\n```\n\n"
    },
    {
      "title": "Custom Mask Types",
      "level": 4,
      "content": "Incrond provides additional custom event types to modify its monitoring behavior.\n\nFor instance, to pause monitoring an event until the current one is completely handled, add loopable=true to the event list, eg:\n\n```\nIN_CLOSE,loopable=true\n```\n\nAn event with the loopable event enabled will not fire again until the associated command exits.\n\nSee incrontab(5) for the complete list of custom mask types.\n\n"
    }
  ]
}