{
  "title": "Instal·lat",
  "url": "https://wiki.archlinux.org/title/Instal%C2%B7lat",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles relacionats\n\n- Ajuda:Navegació\n- Ajuda:Estil\n\nCom la gran majoria d'articles de l'ArchWiki contenen indicacions que poden necessitar clarificacions de cara als nous usuaris d'Arch Linux (o GNU/Linux en general), s'ha redactat aquest resum de procediments bàsics per a evitar confusions en assimilar els articles i la repetició del contingut.\n\n"
    },
    {
      "title": "Organització",
      "level": 2,
      "content": "La majoria d'articles de l'ArchWiki no intenten oferir una introducció holística a cada un dels temes tractats; aquests articles s'han escrit adherint-se al principi \"Don't Repeat Yourself\" (No et repeteixis), sota la premissa que l'usuari buscarà i llegirà el material de suport que encara no entén. Quan és possible, aquest material de suport s'indica a l'article mitjançant format especial, vegeu #Format.\n\nA causa d'aquesta organització, pot ser necessari examinar diverses fonts relacionades per a entendre totalment un article de l'ArchWiki. En particular, els nous usuaris d'Arch (o GNU/Linux en general) haurien d'esperar llegir una gran quantitat d'articles, fins i tot a l'hora de resoldre problemes simples. És especialment important estudiar el material de suport abans de cercar ajuda addicional d'altres usuaris.\n\n"
    },
    {
      "title": "Format",
      "level": 2,
      "content": "- enllaç a una secció de l'article actual: #Organització\n- enllaç a un altre article de l'ArchWiki\n- enllaç a una pàgina web externa\n- enllaç a una pàgina del man: intro(1)\n- una pàgina del man només disponible fora de línia: foo(1)\n- enllaç a un paquet en els repositoris oficials: foobar\n- enllaç a un paquet en el AUR: foobarAUR\n\n"
    },
    {
      "title": "Usuari regular o root",
      "level": 2,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nAlgunes línies estan escrites així:\n\n```\n# mkinitcpio -p linux\n```\n\nAltres tenen un prefix diferent:\n\n```\n$ makepkg -s\n```\n\nEl signe numèric o coixinet (#) indica que l'ordre s'ha d'executar com a root, mentre el signe de dòlar ($) mostra que l'ordre s'ha d'executar com a un usuari regular.\n\nUna excepció notable a tenir en compte:\n\n```\n# Aquest àlies fa que ls acoloreixi la llista\nalias ls='ls --color=auto'\n```\n\nEn aquest exemple, el context al voltant del signe numèric comunica que això no s'ha d'executar com a una ordre; s'ha d'editar dins un fitxer. Llavors, en aquest cas el signe numèric denota un comentari. Un comentari pot ser text explicatori que no serà interpretat pel programa associat. La denotació dels scripts de Bash per als comentaris justament coincideix amb el PS1 de root.\n\nSi ens hi fixem, una de les \"pistes\" és el caràcter en majúscula que segueix al signe #. Normalment, les comandes Unix no s'escriuen així, sinó que la majoria són abreviatures de l'anglès en comptes de paraules completes en català (per exemple, Copia es converteix en cp, de l'anglès copy).\n\nAixí i tot, la majoria d'articles deixen clara la diferència avisant al lector:\n\nAfegiu a ~/ruta/cap/al/fitxer:\n\n```\n# Aquest àlies fa que ls acoloreixi la llista\nalias ls='ls --color=auto'\n```\n\n"
    },
    {
      "title": "Afegir, crear, editar",
      "level": 2,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nQuan se us demani afegir a, crear, o editar un o més fitxers, se sobreentén que usareu un dels mètodes presentats a continuació.\n\nPer a crear o modificar fitxers multilínia, se us suggereix utilitzar un editor de text. Per exemple, per a utilitzar nano per a editar el fitxer /etc/bash.bashrc executeu:\n\n```\n# nano /etc/bash.bashrc\n```\n\nPer a crear o sobreescriure un fitxer a partir d'una cadena de text, podria ser més simple utilitzar la redirecció de sortida. L'exemple següent crea o sobreescriu els continguts del fitxer /etc/hostname amb el text elmeuhostname.\n\n```\n# echo elmeuhostname > /etc/hostname\n```\n\nLa redirecció de sortida també pot utilitzar-se per a afegir una cadena al final d'un fitxer. L'exemple següent afegeix el text [repositori-personalitzat] al final del fitxer /etc/pacman.conf.\n\n```\n# echo \"[repositori-personalitzat]\" >> /etc/pacman.conf\n```\n\nQuan se us demani crear directoris, useu l'ordre mkdir:\n\n```\n# mkdir /mnt/boot\n```\n\n"
    },
    {
      "title": "Fer executable",
      "level": 3,
      "content": "Després de crear un fitxer, si ha de ser executat com a un script (sigui manualment o cridant-lo amb un altre programa), cal marcar-lo com a executable, per exemple amb:\n\n```\n$ chmod +x script\n```\n\nVegeu chmod. Algunes aplicacions com els gestors de fitxers podrien oferir interfícies gràfiques per a dur a terme la mateixa tasca.\n\n"
    },
    {
      "title": "Carregar scripts (sourcing)",
      "level": 2,
      "content": "Algunes aplicacions, notablement els intèrprets d'ordres, utilitzen scripts per a la seva configuració: després de modificar-los, han de carregar-se (en anglès, source) per a aplicar els canvis. En el cas de bash, per exemple, això es fa executant (podeu substituir source amb .):\n\n```\n$ source ~/.bashrc\n```\n\nQuan la wiki suggereixi modificar un fitxer de configuració d'aquest tipus, no us recordarà que carregueu el fitxer i, només en alguns casos, apuntarà cap a aquesta secció amb un enllaç de recordatori.\n\n"
    },
    {
      "title": "Instal·lar paquets",
      "level": 2,
      "content": "Quan un article us convidi a instal·lar paquets mitjançant el mètode convencional, no us indicarà les instruccions detallades per a fer-ho; en canvi, només us mencionarà el nom dels paquets a instal·lar.\n\nLes subseccions a continuació donen una visió general del procés d'instal·lació genèric en funció del tipus de paquet.\n\n"
    },
    {
      "title": "Paquets oficials",
      "level": 3,
      "content": "En el cas dels paquets dels repositoris oficials, llegireu quelcom similar a:\n\nAixò significa que heu d'executar:\n\n```\n# pacman -S foobar\n```\n\nL'article pacman (Català) conté explicacions detallades sobre com gestionar els paquets d'Arch Linux hàbilment.\n\n"
    },
    {
      "title": "Arch User Repository",
      "level": 3,
      "content": "En el cas dels paquets del Arch User Repository (AUR), llegireu quelcom similar a:\n\nAixò significa que en general haureu de seguir l'enllaç foobarAUR, descarregar el fitxer PKGBUILD, extreure'l, verificar els continguts i, finalment, executar, a la mateixa carpeta:\n\n```\n$ makepkg -si\n```\n\nL'article Arch User Repository (Català) conté totes les explicacions detallades i millors pràctiques a l'hora de gestionar paquets de l'AUR.\n\n"
    },
    {
      "title": "Controlar unitats del systemd",
      "level": 2,
      "content": "Quan un article us convidi a iniciar, activar, parar o reiniciar unitats del systemd (per exemple, un servei), no us indicarà les instruccions detallades per a fer-ho; en canvi, llegireu quelcom similar a:\n\nAixò significa que heu d'executar:\n\n```\n# systemctl start exemple.service\n```\n\nL'article systemd (Català) conté totes les explicacions detallades sobre com interactuar amb les unitats del systemd a Arch Linux hàbilment.\n\n"
    },
    {
      "title": "Configuració del sistema versus configuració d'usuari",
      "level": 2,
      "content": "És important recordar que hi ha dos tipus de configuració a un sistema GNU/Linux. La configuració del sistema (system-wide en anglès) afecta a tots els usuaris. Com les configuracions del sistema normalment es troben al directori /etc, calen privilegis de root per a alterar-les. Per exemple, per a aplicar una configuració de Bash que afecti a tots els usuaris, s'ha de modificar el fitxer /etc/bash.bashrc.\n\nLa configuració d'usuari (user-specific en anglès) afecta un únic usuari. Els dotfiles s'utilitzen per a la configuració d'usuari. Per exemple, el fitxer ~/.bashrc és el fitxer de configuració d'usuari. La idea és que cada usuari pot definir la seva pròpia configuració, com àlies, funcions i altres característiques interactives com l'indicador (o prompt), sense afectar a les preferències de la resta d'usuaris.\n\n"
    },
    {
      "title": "Fitxers comuns del shell",
      "level": 3,
      "content": "El Bash i altres shells compatibles amb Bourne, com Zsh, tambè carreguen fitxers en funció de si el shell és un shell de login o un shell interactiu. Vegeu Bash (Català)#Fitxers de configuració i Zsh (Català)#Fitxers d'inici/tancament per a més detalls.\n\n"
    },
    {
      "title": "Pseudovariables als exemples de codi",
      "level": 2,
      "content": "Alguns blocs de codi poden contenir les anomenades pseudovariables, que, com el nom indica, no són variables usades al codi. En canvi, marquen posicions en el text a editar, i han de ser substituïdes amb ítems específics a la configuració del sistema abans d'executar o processar el codi. Els shells més comuns com bash o zsh ofereixen compleció mitjançant tabulador per a autocompletar els paràmetres de les ordres més comunes, com systemctl.\n\nEn els articles que respecten les pautes a Help:Style (Català)/Formatting and punctuation (Català), les pseudovariables s'indiquen amb cursiva. Per exemple:\n\n- Activeu el servei dhcpcd@nom_d_interfície.service corresponent a la interfície identificada mitjançant la sortida de l'ordre ip link.\n\nEn aquest cas, nom_d_interfície s'utilitza com a pseudovariable en el nom d'una unitat plantilla del systemd. Totes les unitats plantilla del systemd, identificables pel signe @, requereixen un ítem de configuració específic al sistema com a argument. Vegeu Systemd (Català)#Ús de les unitats.\n\n- L'ordre dd if=font_de_dades of=/dev/sdX bs=mida_del_sector count=nombre_de_sectors seek=sector_inicial_de_la_partició pot ser executada com a root per a netejar una partició amb els paràmetres especificats.\n\nEn aquest cas, les pseudovariables s'utilitzen per a descriure els paràmetres que han de substituir-les. Els detalls sobre com obtenir-los s'especifiquen a la secció Securely wipe disk (Català)#Càlcul dels blocs a netejar manualment, que presenta aquesta ordre.\n\nEn el cas dels fitxers d'exemple, enganxar les pseudovariables en els fitxers de configuració reals podria trencar els programes que els utilitzen.\n\n"
    },
    {
      "title": "El·lipsis",
      "level": 3,
      "content": "En la majoria de casos, les elipsis (...) no formen part del contingut real del fitxer o de la sortida real del codi i, en canvi, representen text omès o opcional que no és rellevant per al tema presentat.\n\nPer exemple HOOKS=\"... encrypt ... filesystems ...\" o:\n\n```\n/etc/X11/xorg.conf.d/50-synaptics.conf\n```\n\n```\nSection \"InputClass\"\n    ...\n    Option      \"CircularScrolling\"          \"on\"\n    Option      \"CircScrollTrigger\"          \"0\"\n    ...\nEndSection\n```\n\nTingueu precaució, però, ja que, en alguns casos, les el·lipsis podrien ser una part important de la sintaxi del codi: els usuaris atents podran fàcilment reconèixer aquests casos amb l'ajuda del context.\n\n"
    }
  ]
}