{
  "title": "Instalar Arch Linux com Fake RAID",
  "url": "https://wiki.archlinux.org/title/Instalar_Arch_Linux_com_Fake_RAID",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Instalando com Software RAID ou LVM\n- Converter um sistema de unidade única para RAID\n- Guia de instalação\n\nO objetivo deste guia é permitir o uso de um conjunto RAID criado pelo controlador RAID BIOS integrado e, assim, permitir a inicialização dupla do Linux e do Windows a partir de partições dentro do conjunto RAID usando o GRUB. Ao usar o chamado fake RAID ou host RAID, os conjuntos de discos são alcançados em /dev/mapper/nome-do-chipset_nome-aleatório e não em /dev/sdX .\n\n"
    },
    {
      "title": "O que é \"Fake RAID\"",
      "level": 2,
      "content": "Segundo a Wikipedia:\n\nVeja também Guia de FakeRaid - Documentação Comunitária do Ubuntu para mais informações.\n\nApesar da terminologia, \"fake RAID\" via dmraid é uma implementação robusta de software RAID que oferece um sistema sólido para espelhar ou distribuir dados em vários discos com sobrecarga insignificante para qualquer sistema moderno. dmraid é comparável a mdadm (RAID de software Linux puro) com o benefício adicional de poder reconstruir completamente uma unidade após uma falha antes do sistema ser inicializado. No entanto, esteja ciente de que nem todas as implementações de BIOS RAID suportam a reconstrução de unidade. Em vez disso, eles contam com software não-linux para realizar a reconstrução. Se o seu sistema não puder reconstruir uma unidade no utilitário de configuração do BIOS RAID, você é fortemente encorajado a usar mdraid (puro Linux Software Raid via mdadm - veja RAID) em vez de dmraid, ou você não conseguirá reconstruir uma matriz em caso de uma falha de unidade - ou incapaz de recuperar informações de sua matriz em caso de falha de placa-mãe sem muito trabalho adicional.\n\n"
    },
    {
      "title": "História",
      "level": 2,
      "content": "No Linux 2.4, a estrutura do kernel ATARAID forneceu suporte para fake RAID (RAID de software assistido pelo BIOS). Para Linux 2.6, o framework device-mapper pode, entre outras coisas legais como LVM e EVMS, fazer o mesmo tipo de trabalho que ATARAID em 2.4. Embora o novo código que lida com a E/S RAID ainda seja executado no kernel, o mapeador de dispositivos geralmente é configurado por um aplicativo de espaço do usuário. Ficou claro que ao usar o mapeador de dispositivos para RAID, a detecção iria para o espaço do usuário.\n\nHeinz Maulshagen criou a ferramenta dmraid para detectar conjuntos RAID e criar mapeamentos para eles. Os controladores suportados são (na maioria baratos) controladores RAID IDE/SATA falsos que contêm funções do BIOS. Exemplos comuns incluem: controladores Promise FastTrak; High Point HPT37x; Intel Matriz RAID; Silicon Image Medley; e NVIDIA nForce.\n\n"
    },
    {
      "title": "Preparação",
      "level": 2,
      "content": "Note: **Considere-se avisado!** \n\n- Abra quaisquer guias necessários do (Guia de instalação) em outra máquina. Se você não tiver acesso a outra máquina, imprima-os.\n- Baixe a imagem de instalação do Arch Linux mais recente.\n- Faça backup de todos os arquivos importantes, pois tudo nas partições de destino será destruído.\n\n"
    },
    {
      "title": "Configure conjuntos de RAID",
      "level": 4,
      "content": "- Entre na configuração do BIOS e ative o controlador RAID. O BIOS pode conter uma opção para configurar unidades SATA como \"IDE\", \"AHCI\" ou \"RAID\"; certifique-se de que \"RAID\" esteja selecionado.\n- Salve e saia da configuração do BIOS. Durante a inicialização, entre no utilitário de configuração RAID. O utilitário RAID geralmente é acessível através do menu de inicialização (geralmente F8, F10 ou CTRL+I) ou enquanto o controlador RAID está inicializando.\n- Use o utilitário de configuração RAID para criar conjuntos de faixas/espelhos (stripe/mirror) preferidos.\n\n- O BIOS pode conter uma opção para configurar unidades SATA como \"IDE\", \"AHCI\" ou \"RAID\"; certifique-se de que \"RAID\" esteja selecionado.\n\n- O utilitário RAID geralmente é acessível através do menu de inicialização (geralmente F8, F10 ou CTRL+I) ou enquanto o controlador RAID está inicializando.\n\n"
    },
    {
      "title": "Inicialize o instalador",
      "level": 2,
      "content": "Consulte Guia de instalação#Pré-instalação para obter detalhes.\n\n"
    },
    {
      "title": "Exemplo de instalação do MBR usando mdadm e Intel FakeRAID",
      "level": 2,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nIsso aqui porque passei horas fazendo isso funcionar, porque há muita informação por aí sobre diferentes maneiras de fazê-lo, além de informações desatualizadas. Ele pode precisar ser integrado a esta página melhor, com mais explicações e sintaxe da wiki do Arch, mas estou encerrando isso neste momento. Este é um dump de linha de comando básico que mostra uma configuração RAID bem-sucedida usando a estrutura de partição MBR.\n\nParece que, uma vez que você cria o array no Intel util, ele grava os metadados do raid. Portanto, a montagem/criação de um array não precisa acontecer. Chamei meu array de ZERO no Intel util e você pode vê-lo neste exemplo.\n\nEstou deixando todo o exemplo de instalação, pois mostra quando configurar as coisas durante a instalação. Você vai ter que modificar algumas coisas para que funcionem, não copie e cole!\n\n```\nls /dev/md/\nparted /dev/md/ZERO_0\nmklabel msdos\nmkpart primary ext4 1MiB 100MiB\nset 1 boot on\nmkpart primary ext4 100MiB 16.5GiB\nmkpart primary linux-swap 16.5GiB 100%\n```\n\nSó para ver as mudanças:\n\n```\nfdisk -l /dev/md/ZERO_0\n```\n\nCrie o sistema de arquivos, o swap e ative-o\n\n```\nmkfs.ext4 /dev/md/ZERO_0p1\nmkfs.ext4 /dev/md/ZERO_0p2\nmkswap /dev/md/ZERO_0p3\nswapon /dev/md/ZERO_0p3\nmount /dev/md/ZERO_0p2 /mnt\nmkdir -p /mnt/boot\nmount /dev/md/ZERO_0p1 /mnt/boot/\nnano /etc/pacman.conf\n```\n\nDescomente multilib em x64 (por que não) (faça depois do chroot também)\n\n```\npacstrap -i /mnt base base-devel\ngenfstab -U /mnt > /mnt/etc/fstab\ncat /mnt/etc/fstab\nnano /mnt/etc/fstab\n```\n\nSubstitua UUIDs por (isso pode ser opcional):\n\n```\n/dev/md/ZERO_0p1\n/dev/md/ZERO_0p2\n/dev/md/ZERO_0p3\nmdadm --detail --scan >> /mnt/etc/mdadm.conf\n```\n\nEntre em chroot para configuração\n\n```\narch-chroot /mnt /bin/bash\nnano /etc/locale.gen\n```\n\npt_BR.UTF-8 UTF-8\n\n```\nnano /etc/locale.conf\n```\n\nLANG=pt_BR.UTF-8\n\n```\nlocale-gen pt-BR pt_BR.UTF-8\ntzselect\nln -sf /usr/share/zoneinfo/America/Sao_Paulo /etc/localtime\n```\n\nTrabalhe em algumas coisas do GRUB\n\n```\npacman -Sv grub\nnano /etc/default/grub\n```\n\n- Descomente GRUB_DISABLE_LINUX_UUID=true\n\nCoisas do RAID\n\n```\ncat /etc/mdadm.conf\nnano /etc/mkinitcpio.conf\n```\n\nAdicione mdadm_udev em HOOKS\n\n```\nHOOKS=\"base udev autodetect modconf block mdadm_udev filesystems keyboard fsck\"\n```\n\nAdicione /sbin/mdmon em BINARIES<ref>https://bbs.archlinux.org/viewtopic.php?id=137058</ref>\n\n```\nBINARIES=\"/sbin/mdmon\"\n```\n\nRegenere-o\n\n```\nmkinitcpio -p linux\n```\n\n```\ngrub-install --recheck /dev/md/ZERO_0\ngrub-mkconfig -o /boot/grub/grub.cfg\n```\n\n```\ncat /boot/grub/grub.cfg\n```\n\n```\necho seu_hostname > /etc/hostname\nnano /etc/hosts\nsystemctl enable dhcpcd@enp13s0.service\nexit\numount -R /mnt\nreboot\n```\n\nRemova o CD live\n\n"
    },
    {
      "title": "Inicie o dmraid",
      "level": 3,
      "content": "Inicie o \"device-mapper\" e procure os arranjos RAID:\n\n```\n# modprobe dm_mod\n# dmraid -ay\n# ls -la /dev/mapper/\n```\n\nExemplo de saída:\n\n```\n/dev/mapper/control            <- Criado pelo device-mapper; se presente, o mapeador de dispositivo provavelmente está funcionando\n/dev/mapper/sil_aiageicechah   <- O arranjo RAID na controladora Silicon Image\n/dev/mapper/sil_aiageicechah1  <- Primeira partição nesse arranjo RAID\n```\n\nSe houver apenas um arquivo (/dev/mapper/control), verifique se o módulo do seu chipset está carregado com lsmod. Se estiver carregado, então o dmraid não suporta essa controladora, ou não existem arranjos RAID no sistema (verifique a BIOS RAID novamente). Se tudo estiver correto, então você será forçado a utilizar Software RAID (não será possível fazer Dual Boot com essa controladora).\n\nSe o módulo do seu chipset não foi carregado, faça-o agora. Como no exemplo:\n\n```\n# modprobe sata_sil\n```\n\nVeja /lib/modules/`uname -r`/kernel/drivers/ata/ para os drivers disponíveis.\n\nPara testar os arranjos raid:\n\n```\n# dmraid -tay\n```\n\n"
    },
    {
      "title": "GRUB2",
      "level": 3,
      "content": "Consulte GRUB2 para obter detalhes sobre como configurar o GRUB2. grub-bios funciona fora da caixa com partições dm-raid:\n\n```\n$ grub-install --target=i386-pc --recheck --debug /dev/mapper/sil_aiageicechah\n```\n\n(Opcional) Instale o os-prober se você tiver outro sistema operacional como o Windows.\n\n```\n$ grub-mkconfig -o /boot/grub/grub.cfg\n```\n\nIsso é tudo, grub-mkconfig irá gerar o configure automaticamente. Você pode editar /etc/default/grub para modificar a configuração (tempo limite, cor, etc) antes do grub-mkconfig.\n\n"
    },
    {
      "title": "Iniciando com um arranjo corrompido",
      "level": 3,
      "content": "Uma desvantagem do uso de Fake RAID no GNU/Linux é que o dmraid é, atualmente, incapaz de lidar com arranjos degradados e se recusa a ativar. Nesse cenário, é preciso resolver o problema através de outro sistema operacional (por exemplo o Windows) ou através do utilitário do chipset RAID.\n\nComo alternativa, se estiver usando um array espelhado (RAID 1), os usuários podem ignorar temporariamente o dmraid durante o processo de inicialização e inicializar a partir de uma única unidade:\n\n1. Edite a linhe kernel no menu do GRUB Remova as referencias aos dispositivos dmriad (exemplo mude /dev/mapper/raidSet1 para /dev/sda1) Acrescente disablehooks=dmraid para prevenir um kernel panic se o dmraid descobrir o arranjo degradado\n1. Inicie o sistema\n\n1. Remova as referencias aos dispositivos dmriad (exemplo mude /dev/mapper/raidSet1 para /dev/sda1)\n1. Acrescente disablehooks=dmraid para prevenir um kernel panic se o dmraid descobrir o arranjo degradado\n\n"
    },
    {
      "title": "Erro: Não foi possível determinar o número principal/menor do dispositivo raiz",
      "level": 3,
      "content": "Se ocorrer uma falha de inicialização após a atualização do kernel, onde o processo de inicialização não consegue determinar o número principal/menor do dispositivo raiz, isso pode ser apenas um problema de tempo (ou seja, dmraid -ay pode ser chamado antes de /dev/sd* estar totalmente configurado e detectado). Isso pode afetar as imagens de kernel normal e LTS. A inicialização da imagem do kernel 'Fallback' deve funcionar. O erro será algo assim:\n\n```\nActivating dmraid arrays...\nno block devices found\nWaiting 10 seconds for device /dev/mapper/nvidia_baaccajap5\nRoot device '/dev/mapper/nvidia_baaccajap5' doesn't exist attempting to create it.\nError: Unable to determine major/minor number of root device '/dev/mapper/nvidia_baaccajap5'\n```\n\nPara contornar este problema:\n\n- inicialize o kernel Fallback\n- insira o hook sleep na linha HOOKS de /etc/mkinitcpio.conf após o hook udev, assim:\n\n```\nHOOKS=\"base udev sleep autodetect block dmraid filesystems\"\n```\n\n- reconstrua a imagem do kernel e reinicie.\n\n"
    },
    {
      "title": "Espelho dmraid falha ao ativar",
      "level": 3,
      "content": "Tudo acima funciona corretamente na primeira vez, mas quando você reinicia o dmraid não consegue encontrar o array?\n\nIsso ocorre porque o software raid do Linux (mdadm) já tentou montar o array fake RAID durante a inicialização do sistema e o deixou em um estado desmontável. Para evitar que mdadm seja executado, remova a regra do udev responsável:\n\n```\n# cd /lib/udev/rules.d\n# mkdir disabled\n# mv 64-md-raid.rules disabled/\n# reboot\n```\n\n"
    },
    {
      "title": "Nenhum dispositivo de bloco para partições na matriz RAID existente",
      "level": 3,
      "content": "Se o seu array existente, configurado antes de tentar instalar o Arch, aparece em /dev/mapper/nome_do_raid, mas não tem partições (nome_do_raid1, etc) verifique novamente o status de suas partições RAID.\n\nO Arch pode não criar dispositivos de bloco para partições que funcionem em outro sistema operacional se houver certos problemas, mesmo pequenos.\n\ngparted é útil para diagnosticar e reparar a maioria dos problemas. Infelizmente, você pode ter que reparticionar do zero.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Tópico do fórum relacionado\n\n"
    }
  ]
}