{
  "title": "Insync",
  "url": "https://wiki.archlinux.org/title/Insync",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Dropbox\n\ninsync is an alternative Google Drive and Microsoft OneDrive client that is available for Windows, macOS, and Linux which allows you to sync a local folder or symlinked folders with your Google Drive or OneDrive. Whilst previous Beta versions used to be for free, the final release features a trial period after which a one-time payment per account is required.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the insyncAUR package. It contains the synchronization daemon, a systemd service file, and a command-line utility for configuration. It can be used and integrates nicely with different desktop environments such as KDE, Gnome, or Cinnamon.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Insync can be started with the insync start command and stopped with the insync quit command. A shortcut for starting Insync should be available in the applications menu of your desktop environment.\n\n"
    },
    {
      "title": "Running as a systemd service",
      "level": 3,
      "content": "Enable insync@user.service or the systemd user service insync.service.\n\n"
    },
    {
      "title": "Cinnamon",
      "level": 3,
      "content": "When you start insync from the start menu it may not appear in the taskbar. For that, you need to add the taskbar applet by right-clicking on your panel.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "The usage is self-explanatory. Copy files and folders from and to your local folder to sync it with your Google Drive.\n\n"
    },
    {
      "title": "Control via CLI",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nCLI support was dropped in the latest versions. However, users who need CLI support or want to use Insync headless can use Insync 1.5.7.\n\nSee Headless and CLI community support and How to control Insync via command line (CLI).\n\n"
    },
    {
      "title": "Slow sync process",
      "level": 3,
      "content": "The default systemd service file provided in insyncAUR uses the --synchronous-full flag to make sqlite transactions safer and prevent database corruption. However, for some users this might considerably slow down the sync process. If you do not need full synchronisation, use a drop-in file to modify the ExecStart variable:\n\n```\n/etc/systemd/system/insync@.service.d/override.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=/usr/bin/insync start\n```\n\n"
    },
    {
      "title": "GUI not starting and failing silently",
      "level": 3,
      "content": "When running insync start, the system tray icon does not appear and Insync does not start.\n\nAccording to [1], this is due to QGtkStyle. You will need to set the Qt4 theme to something other than GTK using qtconfig-qt4.\n\nThis issue is sometimes observed when using the Nouveau driver for NVIDIA graphics cards, and can be resolved by using the proprietary NVIDIA drivers.\n\nRunning insync start --no-daemon from the terminal logs output to stdout and prevents the process from being detached. This makes troubleshooting much simpler.\n\n"
    },
    {
      "title": "Missing system tray icon",
      "level": 3,
      "content": "If Insync is running, but it is not appearing in your system tray, try running it with the XDG_CURRENT_DESKTOP=GNOME environment variable.\n\nIf the system tray icon still is not showing, you can try running it a after rather than before starting your window manager. For example, do not run insync start from xinitrc, but from the window manager's autostart mechanism.\n\n"
    },
    {
      "title": "System tray icon flickers between checkmark and inactive",
      "level": 3,
      "content": "This problem may occur due to Insync using Google's API telemetry for analytics, which could be blocked by a network installed Pi-hole. To fix, enter Insync's app settings and disable \"Anonymously send usage data to Insync\".\n\n"
    }
  ]
}