{
  "title": "Intel QC71",
  "url": "https://wiki.archlinux.org/title/Intel_QC71",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) |  | Yes\nGPU (nvidia) |  | Yes\nEthernet |  | Yes\nCard Reader |  | Yes\nWireless |  | Yes\nBluetooth |  | Yes\nAudio |  | Yes\nTouchpad |  | Yes\nWebcam |  | Yes\nThunderbolt |  | Yes\nFunction Keys |  | Yes\n\nThe Intel QC71 is also known as Intel NUC 9 Extreme Laptop Kit (LAPQC71), XMG FUSION 15 (powered by TUXEDO), Eluktronics Mag-15, Aftershock / LEVEL 51 Vapor 15 Pro, MAINGEAR ELEMENT and Avell A60 Muv.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "During the installation an external keyboard might be needed.\n\n"
    },
    {
      "title": "Function Keys",
      "level": 2,
      "content": "Most Fn function keys are recognized correctly and given sufficient userspace support they work out of the box. To have working touchpad toggle (Fn + F5), and keyboard brightness up/down keys (Fn + F6/F7, respectively), you can install tuxedo-drivers-dkmsAUR.\n\nSince BIOS version 0114, it is possible to configure Fn+ESC to toggle the Fn lock. This can be configured in the BIOS or with the qc71-laptop-dkms-gitAUR kernel module.\n\n"
    },
    {
      "title": "Lightbar",
      "level": 2,
      "content": "The LED bar on the front of the device maybe controlled using one of the following:\n\n- the tuxedo-drivers-dkmsAUR kernel driver made by TUXEDO Computers; or\n- the qc71-laptop-dkms-gitAUR kernel module.\n\n"
    },
    {
      "title": "Battery charge threshold",
      "level": 3,
      "content": "Since BIOS version 0114, it is possible to configure a percentage threshold at which charging will stop. This can be configured in the BIOS or with the qc71-laptop-dkms-gitAUR kernel module.\n\n"
    },
    {
      "title": "Reduced fan duty cycle and always-on mode",
      "level": 3,
      "content": "Since BIOS version 0114, it is possible to configure the fans to spin at about 25% of their maximum speed instead of 30% at idle. It is also possible to configure the fans to always be active. These options are configurable in the BIOS or with the qc71-laptop-dkms-gitAUR kernel module.\n\n"
    },
    {
      "title": "TUXEDO Control Center",
      "level": 3,
      "content": "TUXEDO Computers provides their own Control Center named TUXEDO Control Center (short TCC), tuxedo-control-center-binAUR.\n\nTCC helps you to control fan speed, energy and performance.\n\n"
    }
  ]
}