{
  "title": "Intel nuc",
  "url": "https://wiki.archlinux.org/title/Intel_nuc",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Next Unit of Computing (NUC) is a small-form-factor (SFF) PC designed by Intel and is based on soldered-on low-power Celeron, Pentium, i3, i5 and i7 CPUs. Its motherboard measures 4 × 4 inches (10.16 × 10.16 cm).\n\nThe barebone kits consist of the board, in a plastic case with a fan, an external power supply and VESA mounting plate. Intel does offer for sale just the NUC motherboards, which have a built-in CPU, although (as of 2013) the price of a NUC motherboard is very close to the corresponding cased kit; third-party cases for the NUC boards are also available.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Follow usual installation guide procedures.\n\nIt is highly recommended to update the board BIOS prior to installation. See official Intel BIOS update instructions for details.\n\n"
    },
    {
      "title": "NVMe",
      "level": 3,
      "content": "Intel NUCs support NVMe drives connected to the PCIe M.2 connector. See Solid State Drives/NVMe.\n\nNote: **enable** \n\n"
    },
    {
      "title": "Graphics",
      "level": 3,
      "content": "Most NUCs use integrated Intel graphics. See Hardware video acceleration to use it on supported NUC models.\n\n"
    },
    {
      "title": "Wireless",
      "level": 3,
      "content": "Most NUC wireless adapters should work out of the box. Make sure relevant firmware is loaded. See Wireless network configuration#iwlwifi for details.\n\n"
    },
    {
      "title": "LEDs",
      "level": 3,
      "content": "Some NUCs have LEDs which can be controlled by software by installing the kernel driver intel_nuc_led-dkms-gitAUR [1]. To use this, Software Control must be enabled in the BIOS Power settings.\n\n"
    },
    {
      "title": "Boot",
      "level": 3,
      "content": "Fastest boot times are achieved with UEFI boot and disabling legacy boot in the BIOS settings.\n\n"
    },
    {
      "title": "4K",
      "level": 3,
      "content": "If you want to use 4K graphic output, open the BIOS settings and set Devices and Peripherals -> Video -> IGD Minimum Memory to 512 MB and IGD Aperture Size to 1024 MB.\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "It is possible to reduce power usage, see TLP and Powertop.\n\n"
    },
    {
      "title": "Hades Canyon NUC - no external microphones",
      "level": 3,
      "content": "External microphones being plugged into the front or back 3.5mm jack may not appear in PulseAudio (only the Internal Microphone array will be used).\n\nTo fix this, use model=dell-headset-multi as explained in Advanced Linux Sound Architecture/Troubleshooting#Wrong model autodetection.\n\nReboot the device, and three new input devices should be listed under Input Devices, Built-in Audio Analog Stereo - Internal Microphone, Headset Microphone, and Microphone.\n\n"
    },
    {
      "title": "TPM",
      "level": 3,
      "content": "The Intel specifications for some NUC devices indicate that TPM is unavailable. However, those devices are often capable of TPM 2.0 features through a firmware-based implementation called Intel PTT. Storing and retrieving values works as one would expect from a TPM chip.\n\n"
    },
    {
      "title": "Poweroff",
      "level": 3,
      "content": "After issuing a shutdown, the NUC might remain in some state which is not completely shut down, as indicated by a remaining blue power LED. In this case it is necessary to power off the unit by holding the power button for a few seconds.\n\nThe workaround for this issue is to disable all wake-on-CIR (infrared sensor) options in the BIOS. In some cases it might be required to disable the CIR sensor completely to fix the issue.\n\n"
    },
    {
      "title": "iSCSI boot",
      "level": 3,
      "content": "Following the procedure outlined in iSCSI/Boot.\n\nChroot into the iSCSI target root, and modify these two configuration files:\n\n```\n/etc/initcpio/install/iscsi\n```\n\n```\nbuild () {\n        map add_module iscsi_tcp iscsi_ibft libiscsi libiscsi_tcp scsi_transport_iscsi crc32c e1000e\n        add_checked_modules \"/drivers/net\"\n        add_binary iscsistart\n        add_runscript\n}\n\nhelp () {\ncat <<HELPEOF\n        This hook allows you to boot from an iSCSI target.\nHELPEOF\n}\n```\n\n```\n/etc/initcpio/hooks/iscsi\n```\n\n```\nrun_hook () {\n        modprobe iscsi_tcp\n        modprobe e1000e\n        msg \"Mounting iSCSI target\"\n        iscsistart -i INITIATOR_NAME -t TARGET_NAME -g 1 -a PORTAL_IP_ADDRESS -d 1\n}\n```\n\nThen, regenerate the initramfs.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Intel NUC Support Community\n\n"
    }
  ]
}