{
  "title": "Ipod",
  "url": "https://wiki.archlinux.org/title/Ipod",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- iOS\n\nThe iPod is a discontinued series of portable media players created by Apple Inc. Officially, you can only add music to iPods using Apple's iTunes program, but there are several other programs that are able to sync music with an iPod.\n\n"
    },
    {
      "title": "Accessing the storage",
      "level": 2,
      "content": "Traditional iPods are accessed just like a normal USB storage device containing a vfat or hfsplus file system. See the USB storage devices article for detailed instructions on how to access your device.\n\n- If your iPod is formatted as hfsplus, you will need hfsprogsAUR to access it. You may also restore your iPod using iTunes on Windows in order to format it as vfat.\n- If your iPod is formatted as vfat, you can use dosfslabel (from dosfstools) to rename your iPod's volume label:\n\n```\n# dosfslabel /dev/sdXY ArchPod\n```\n\n"
    },
    {
      "title": "Library management",
      "level": 2,
      "content": "These tools use the libgpod library:\n\n- Clementine — Amarok 1.4 clone, ported to Qt5.\n\n- Strawberry — Fork of Clementine aimed at audio enthusiasts and music collectors.\n\n- Rhythmbox — GTK clone of iTunes, formerly GNOME's default music player.\n\n- gtkpod — GUI for Apple's iPod using GTK. It allows you to import your existing iTunes database, add songs, podcasts, videos and cover art, and to edit ID3 tags.\n\n- Amarok — Mature Qt-based player known for its plethora of features.\n\n"
    },
    {
      "title": "Handbrake",
      "level": 3,
      "content": "Handbrake is a nifty tool with presets for a variety of iPod versions. CLI and GTK versions are available with the handbrake-cli and handbrake packages respectively.\n\nIf you do decide to take the CLI way, a good guide is available at https://handbrake.fr/docs/en/latest/cli/command-line-reference.html.\n\n"
    },
    {
      "title": "Avidemux",
      "level": 3,
      "content": "Install the avidemux-qt package.\n\nThis can convert to mp4 files. If you enforce a hard max of bit rate @ 700ish and keep the video size to 720x480 or 320x240 than it works fine for video file exporting.\n\n"
    },
    {
      "title": "Mencoder",
      "level": 3,
      "content": "Install the mplayer package.\n\nHas extremely comprehensive configuration support, which will be able to spit out iPod-compatible video files. Check out mencoder(1); a lot of MPlayer opts will also affect encoding.\n\nA basic guide is also available at MEncoder.\n\nAn example command to encode iPhone/iPod Touch-compatible video:\n\n```\n$ mencoder INPUT -o output.mp4 \\\n-vf scale=480:-10,harddup \\\n-oac faac -faacopts mpeg=4:object=2:raw:br=128 \\\n-of lavf -lavfopts format=mp4 \\\n-ovc x264 -x264encopts nocabac:level_idc=30:bframes=0\n```\n\n"
    },
    {
      "title": "FFmpeg",
      "level": 3,
      "content": "Install the ffmpeg package.\n\nAnother encoder with comprehensive configuration support. Example command to encode for 5G iPod:\n\n```\n$ ffmpeg -vcodec xvid -b 300 -qmin 3 -qmax 5 -bufsize 4096 \\\n-g 300 -acodec aac -ab 96 -i INPUT -s 320x240 \\\n-aspect 4:3 output.mp4\n```\n\nor iPod Touch/iPhone compatible video output:\n\n```\n$ ffmpeg -f mp4 -vcodec mpeg4 -maxrate 1000 -b 700 -qmin 3 -qmax 5\\\n-bufsize 4096 -g 300 -acodec aac -ab 192 -s 480×320 -aspect 4:3 -i INPUT output.mp4\n```\n\n"
    },
    {
      "title": "Generating HashInfo file",
      "level": 4,
      "content": "If you have never synced your device using iTunes, you will get error messages telling you that the HashInfo file is missing. This can be fixed by syncing once with iTunes in order to create it. Alternatively one can create this file using the site http://ihash.marcansoft.com/. Enter the serial number of the iPod on the website. It will generate a file named HashInfo which you will place under the /mnt/ipod/iPod_Control/Device/ directory. Unplug the iPod device and plug it back.\n\n"
    },
    {
      "title": "Unobfuscating the Database",
      "level": 4,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nSince firmware version 2.0, Apple has obfuscated the music database. If you are using recent firmware, the file /System/Library/Lockdown/Checkpoint.xml can be modified to enable use of the older, non-obfuscated database. If that file does not exist then try to copy from /System/Library/CoreServices/Checkpoint.xml to /System/Library/Lockdown/Checkpoint.xml then replace:\n\n```\n<key>DBVersion</key>\n<integer>4</integer>\n```\n\nwith:\n\n```\n<key>DBVersion</key>\n<integer>2</integer>\n```\n\nThen reboot your device.\n\nIf syncing fails with ERROR: Unsupported checksum type '0' in cbk file generation!, you may need to leave this at 4. libgpod seems to expect a hashed database[dead link 2023-04-23 ⓘ].\n\n"
    },
    {
      "title": "iPod Classic/Nano (3rd generation)",
      "level": 3,
      "content": "You need to set up the iPod to make libgpod able to find its Firewire ID. For this, you will need to get your FireWire ID manually\n\n1. Mount the iPod as a rw mount point. In the following example, use /mnt/ipod.\n1. Find the serial number by typing # lsusb -v | grep -i Serial this should print a 16 character long string like 00A1234567891231 (it will have no colons or hyphens)\n1. Once you have that number, create or edit /mnt/ipod/iPod_Control/Device/SysInfo. Add to that file the line below: FirewireGuid: 0xffffffffffffffff (replace ffffffffffffffff with the 16 digit string you obtained at the previous step and do not forget the leading 0x before the string)\n\n```\n# lsusb -v | grep -i Serial\n```\n\n```\nFirewireGuid: 0xffffffffffffffff\n```\n\nYour iPod can now be managed with Amarok or gtkpod.\n\n"
    },
    {
      "title": "iPod Nano 5th generation",
      "level": 3,
      "content": "Follow the instructions above #Generating HashInfo file in order to set up the hash file, it is needed to write into the device music library. To be able to use the iPod Nano 5th gen with libgpod, a SysInfoExtended file is also needed to be placed in the directory /mnt/ipod/iPod_Control/Device/. It can be generated using:\n\n```\n# ipod-read-sysinfo-extended bus device mountpoint\n```\n\nfor example:\n\n```\n# ipod-read-sysinfo-extended 001 011 /mnt/ipod/\n```\n\n"
    },
    {
      "title": "iPod Nano 6th generation",
      "level": 3,
      "content": "By default libgpod does not seem to be able to synchronize on a iPod Nano 6th generation. It copies data, but as soon as USB is disconnected, everything is as before. The package libhashab-gitAUR fixes this. Additionally, the SysInfoExtended file is also required, and can be generated in the same fashion as in #iPod Nano 5th generation, however a HashInfo file is unnecessary on this model.\n\n"
    },
    {
      "title": "iPod Shuffle 1st and 2nd generation",
      "level": 3,
      "content": "rebuild_db is a Python 2 script that makes it possible to use the iPod Shuffle almost like any other USB flash MP3 player. Download the script from the website, then place it in the iPod's root directory. Copy your MP3 files onto the iPod Shuffle (sub-folders are allowed too) and then run the script:\n\n```\n$ python2 /mnt/iPod/rebuild_db.py\n```\n\n"
    },
    {
      "title": "iPod Shuffle 4th generation",
      "level": 3,
      "content": "In order to use this version of the iPod Shuffle under linux, you can use the python based command line tool ipod-shuffle-4gAUR. It also provides advanced voiceover and (auto)playlist generation support.\n\n"
    },
    {
      "title": "iPod Video (5th and 5.5th generation)",
      "level": 3,
      "content": "iPods in the mainline series up to and including this model do not support the AAC PNS feature, and will display audible artifacts when encountering it. Disable the feature in ffmpeg when encoding AAC files for these devices.\n\n```\n$ ffmpeg -i input.ogg -c:a aac -b:a 256k -aac_pns 0 -movflags +faststart -vn output.m4a\n```\n\nThe -movflags +faststart options place the moov atom at the start of the file, which helps the iPod parse the file faster.\n\n"
    }
  ]
}