{
  "title": "IRC",
  "url": "https://wiki.archlinux.org/title/IRC",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ArchWiki:IRC\n- International communities\n- phrik\n\nTo use Internet Relay Chat (IRC), you need an IRC client. The installation live environment includes the Irssi client.\n\nYou are expected to familiarize yourself with our Code of conduct and General guidelines#IRC before joining any of the official channels. For a list of commonly used abbreviations, see Arch terminology.\n\n"
    },
    {
      "title": "Main channels",
      "level": 2,
      "content": "This section is about #archlinux, the main Arch Linux support IRC channel, and #archlinux-offtopic, the main Arch Linux social channel, both available on the Libera Chat network. See https://archlinux.org/news/move-of-official-irc-channels-to-liberachat/\n\nThe central topic for #archlinux is support and general discussion about Arch Linux.\n\n"
    },
    {
      "title": "Registration",
      "level": 3,
      "content": "In order to reduce spam, #archlinux and #archlinux-offtopic have the channel mode set to +r and +q $~a. This means you have to be identified via NickServ to be able to join these channels and send messages, respectively. If you are not registered and identified, you will be forwarded to #archlinux-unregistered.\n\nTo register with NickServ, follow the Libera Chat FAQ, as well as NickServ HELP when connected to irc.libera.chat:\n\n```\n/query NickServ HELP REGISTER\n/query NickServ HELP IDENTIFY\n```\n\nNote: **#libera** \n\n- If /query happens to not work in your client, you can try using either /quote NickServ command or /msg NickServ command.\n- Some IRC clients have a race-condition where they try to autojoin channels before you have been identified with NickServ. You need to enable SASL to solve this. Either look up your IRC client's documentation or look at the Libera Chat SASL page to find instructions for how to enable it.\n- You can get a list of people who can help you by typing /msg ChanServ FLAGS #archlinux, or join #libera and ask there.\n\n"
    },
    {
      "title": "Channel operators",
      "level": 3,
      "content": "Arch operators are ops in both #archlinux and #archlinux-offtopic. See the list below, or run /msg phrik listops on Libera Chat.\n\nIf you for some reason need the help of an op, do not be shy to /query or /msg us. Here is the list of ops as of 2021-09-24:\n\n- alad\n- BrainDamage\n- gehidore / man\n- grawity\n- jelle\n- MrElendig / Mion\n- Namarrgon\n\n"
    },
    {
      "title": "Libera Chat group contacts",
      "level": 3,
      "content": "Group contacts mediate matters between the Libera Chat network staff, Arch Linux staff and Arch Linux users. That includes the management of channels in the #archlinux-* namespace on the Libera Chat network and the assignment of archlinux/* hostmasks. Please note that only Arch Linux staff is eligible for hostmasks.\n\n- wonder / ioni\n- fukawi2\n- anthraxx\n- dvzrv\n- Namarrgon\n\n"
    },
    {
      "title": "Collaborative debugging",
      "level": 2,
      "content": "When requesting help from an IRC help channel (like #archlinux), it is inappropriate to paste logs into the channel and this may even get you kicked. Use a pastebin instead, you can use phriks factoid !paste to see which pastebins are acceptable. Acceptable pastebins usually work without enabling JavaScript. Some require enabling JavaScript for posting from a web browser, which is still acceptable because it does not affect the viewer. They should not display advertising or other disrupting content and should also not require a login. Excellent pastebins usually provide a way to paste output via piping.\n\nAn example list of acceptable pastebins:\n\n- https://0x0.st - supports pasting of almost any filetype. May have slightly broken MIME type detection.\n- https://paste.rs - supports pasting of images, but MIME type will be off.\n- https://bpa.st - good for people who want something graphical.\n- https://gist.github.com - useful if you want to also have rendered markdown or multiple files, supports CLI pasting via github-cli.\n\n"
    },
    {
      "title": "IRC usage",
      "level": 3,
      "content": "When first entering the channel, there is no need to say hello. State the problem you are experiencing and make sure to be verbose and to provide logfiles. It also helps to search for any error messages you are getting first to not waste anybodys time. It is also worth it to search for issues on any of the bugtrackers of the relevant software. The more helpful and verbose you are, the quicker you are going to receive help.\n\nIf this is a problem or question which is very specific to a specific software, consider visiting the dedicated IRC channel for it if there is one. It is more likely to receive a good answer there.\n\n"
    },
    {
      "title": "Output errors/messages to a file",
      "level": 3,
      "content": "Sometimes it is not possible to pipe the output to a pastebin directly and it should be written into a file before.\n\n```\n$ application &> application-output.txt\n```\n\nThis is useful if pasting logs that contain sensitive data, e.g serial numbers in smartctl output, which have to be manually edited out.\n\n"
    },
    {
      "title": "Other channels",
      "level": 2,
      "content": "The size of our community led to the creation of multiple IRC channels. To get a list of all channels on irc.libera.chat that contain archlinux in their name, use the command /query alis LIST *archlinux*. For further information on how to search channels, see https://libera.chat/guides/findingchannels.\n\nTable content:\nChannel | Topic\n#archlinux-aur | AUR general discussion\n#archlinux-aurweb | aurweb development discussion\n#archlinux-bugs | Bug-centric discussion\n#archlinux-buildbtw | buildbtw development discussion\n#archlinux-classroom | A project that develops and hosts classes for the Arch Linux community\n#archlinux-conf | ArchConf organization and discussion\n#archlinux-devops | Arch Linux internal infrastructure and devops discussions\n#archlinux-mirrors | Arch Linux mirror infrastructure and organization\n#archlinux-multilib | Arch Linux Multilib Project discussion and packaging\n#archlinux-newbie | A space to learn, try new things, and ask for help without fear of ridicule\n#archlinux-pacman | Pacman development and discussion\n#archlinux-proaudio | Discussion about Arch Linux Pro Audio\n#archlinux-projects | Projects development and discussion (mkinitcpio, abs, dbscripts, devtools…)\n#archlinux-releng | Arch Linux Release Engineering discussion (arch-boxes, archiso, archlinux-docker and releng)\n#archlinux-reproducible | Discussion channel for achieving reproducible builds\n#archlinux-security | Discussion of security issues within Arch packages\n#archlinux-signstar | signstar development discussion\n#archlinux-testing | Discussion channel regarding the testing repositories\n#archlinux-wiki | Discussion about ArchWiki, its articles and the Arch Linux Forums\n#archlinux-women | Project discussion for programs/events to encourage women to contribute to Arch Linux and provide space for women to socialize and meet each other. Mostly in English.\n\n"
    },
    {
      "title": "International IRC channels",
      "level": 3,
      "content": "International discussions are available at the following channels, also located at the irc.libera.chat IRC network, unless stated otherwise.\n\nTable content:\nChannel | Community\n#archlinux-ar | Arabic\n#archlinux-br | Brazilian\n#archlinux-ca | Catalan\n#archlinux-cn | Chinese; also on irc.oftc.net#arch-cn\n#archlinux-cz | Czech\n#archlinux-de | German\n#archlinux-dk | Danish\n#archlinux-es | Spanish\n#archlinux-fr | French\n#archlinux-mx | Mexican\n#archlinux-nordics | The Nordics: Danish, Finnish, Norwegian and Swedish\n#archlinux-pl | Polish\n#archlinux-pt | Portuguese\n#archlinux-ro | Romanian\n#archlinux-tr | Turkish\n#archlinux-ua | Ukrainian\n\n"
    }
  ]
}