{
  "title": "Jinzora",
  "url": "https://wiki.archlinux.org/title/Jinzora",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Jinzora is a GPL web based multimedia application. It serves as a streaming server as well as a media management platform. This article will show you how to install and configure Jinzora.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Jinzora can run in two modes, streaming and using mpd. If you have not installed MPD already, see mpd (it is not required for the streaming mode to operate).\n\n"
    },
    {
      "title": "Setup the webserver",
      "level": 3,
      "content": "See LAMP for installing Apache, PHP and MySQL.\n\n(Note: Installing phpMyAdmin from the above guide is optional; if you are ever likely to make your own website that will use PHP and MySQL, I would suggest you install it. Otherwise you probably will not need it.)\n\n"
    },
    {
      "title": "Configure PHP",
      "level": 3,
      "content": "Jinzora can make use of the GD and iconv library. It is recommend you enable these. Uncomment the following lines in /etc/php/php.ini:\n\n```\nextension=gd\nextension=iconv\n```\n\nThe PHP gd extension requires the gd library, php-gd, to be installed.\n\nAlso take a look at the open_basedir setting. Your media directory should be in or below the paths specified in this directory.\n\n"
    },
    {
      "title": "Download and extract Jinzora",
      "level": 3,
      "content": "Download the latest version of Jinzora2 from https://sourceforge.net/projects/jinzora/ and extract the contents using tar:\n\n```\n# tar -xvf jz2current.tar.gz\n```\n\n"
    },
    {
      "title": "Configuring Jinzora",
      "level": 2,
      "content": "In the ~/httpd/html/jinzora2 directory, run configure.sh:\n\n```\n# sh configure.sh\n```\n\n"
    },
    {
      "title": "Run the installer",
      "level": 3,
      "content": "The installer will automatically configure Jinzora and create the database. Open up your web browser, go to http://localhost/jinzora2/index.php and follow the instructions.\n\n- Pay attention to these setup steps: Page 4 - Installation Type : Change from 'Streaming' to 'Streaming & Jukebox' if you wish to listen to the music on the computer you are installing Jinzora2 on (it is primarily a streaming application to allow remote access to, and control of, a streaming server running it). Page 5 - Main Settings : If you hover over the boxes here they explain the settings, so choose whatever you want. It is best to choose 'Database' for Backend Type. Also consider using the 'Tag Data' option for 'Data Structure', unless your music is organized on your filesystem exactly the way you want it to be. Page 6 - Backend Setup : Unless you have used Jinzora before, or for some reason wish to manually create a MySQL database for it to use, then select 'True' under 'Create Database'. Page 7 - Import Media : This step may take a few minutes if you have got a few gigs of music; simply enter into the box the directory where your music is stored. When the installer is finished importing the music from this directory, you will have the option to import as many other directories as you want, one after the other.\n\n- Page 4 - Installation Type : Change from 'Streaming' to 'Streaming & Jukebox' if you wish to listen to the music on the computer you are installing Jinzora2 on (it is primarily a streaming application to allow remote access to, and control of, a streaming server running it).\n- Page 5 - Main Settings : If you hover over the boxes here they explain the settings, so choose whatever you want. It is best to choose 'Database' for Backend Type. Also consider using the 'Tag Data' option for 'Data Structure', unless your music is organized on your filesystem exactly the way you want it to be.\n- Page 6 - Backend Setup : Unless you have used Jinzora before, or for some reason wish to manually create a MySQL database for it to use, then select 'True' under 'Create Database'.\n- Page 7 - Import Media : This step may take a few minutes if you have got a few gigs of music; simply enter into the box the directory where your music is stored. When the installer is finished importing the music from this directory, you will have the option to import as many other directories as you want, one after the other.\n\nYou can also import more files from the Settings interface when Jinzora is up and running. You do not have to do it while installing.\n\nNote: While Jinzora was importing my music collection, I had the following error appear twice on the page:\n\n```\nWarning: strpos() [function.strpos]: Offset not contained in string. in /home/httpd/html/jinzora2/services/services/tagdata/getid3/module.tag.id3v2.php\non line 1542\n```\n\nThis seemed to have no adverse effect on the installation though, so if something similar happens to you, do not worry!\n\n"
    },
    {
      "title": "Save the configuration",
      "level": 3,
      "content": "When you have finished importing your music, click Proceed to save config, then Proceed to launch Jinzora.\n\n"
    },
    {
      "title": "Setting up MPD to play your music",
      "level": 3,
      "content": "Edit ~/httpd/html/jinzora2/jukebox/settings.php: under 'Description', change 'Winamp Media Player' to 'Music Player Daemon' (or whatever you want), and under 'type' change 'winamp3' to 'mpd'.\n\nChange 'password' to be empty (so it just reads '' rather than 'jinzora'), or change this to whatever password you have set in /etc/mpd.conf.\n\nAlso in this file, change the port from '4800' to '6600', or whatever port you have set MPD to accept connections on in /etc/mpd.conf.\n\nIf you wish to use Jinzora's streaming functionality, simply go back to your web browser, click refresh, select 'Music Player Daemon' from the 'Playback To' drop-down menu and Voila! Your own working copy of Jinzora!\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "- If you cannot get any sound despite all of the above, try testing mpd with another GUI client. If you have no sound in this either, you need to further edit /etc/mpd.conf. Try uncommenting some of the ALSA settings in this file (assuming you use ALSA).\n- If you know that MPD is working, then try to match up the settings in Jinzora as closely to those in /etc/mpd.conf as possible (the settings in Jinzora are accessed from the 4th small green button on the upper left of the 'Slick' interface).\n- If changes to your playlist are ignored, go to System Tools > Settings Manager > Main Settings/Playlist and set use_ext_playlists to false.\n- If when you click on the PLAY button of any song / album you are offered a 'playlist.m3u' download, then you have not changed the Playback To option to Music Player Daemon.\n\n"
    }
  ]
}