{
  "title": "Joplin",
  "url": "https://wiki.archlinux.org/title/Joplin",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nJoplin is a markdown cross-platform note-taking and to-do application. It is developed as an open source alternative to Evernote. It is available in various operating systems, such as Linux, Windows, MacOS, Android, and iOS. It supports cloud synchronization, end-to-end encryption, web clipping, note history, note import/export, markdown editing, WYSIWYG editing, and tagging. In addition, there are many Joplin plugins that can be installed to enhance note-taking experience.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install joplinAUR to obtain the CLI version of Joplin. To use the desktop version of Joplin running on Electron, Install joplin-desktopAUR.\n\n"
    },
    {
      "title": "Plugins",
      "level": 2,
      "content": "Since v1.6.4, Joplin plugins can be installed directly by opening the plugin search menu under Tools > Options > Plugins. The plugin archive file will be downloaded automatically into the Joplin plugin folder ~/.config/joplin-desktop/plugins. Upon restarting the app, installed Joplin plugins will work with their intended function.\n\nNote that plugins only work on the desktop version of Joplin.\n\n"
    },
    {
      "title": "Importing Notes from Evernote",
      "level": 3,
      "content": "To import notes from Evernote and save them in Joplin in markdown format, open File > Import > ENEX - Evernote Export File (as Markdown) from the main application window. A file dialog will be shown, upon which the Evernote export file can be located and imported to Joplin.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Joplin Documentation\n- Joplin Home Page\n- Joplin Official Plugin Repository\n- Joplin review article by It's FOSS blog site\n\n"
    }
  ]
}