{
  "title": "Kanały IRC Archa",
  "url": "https://wiki.archlinux.org/title/Kana%C5%82y_IRC_Archa",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Powiązane artykuły\n\n- ArchWiki:IRC\n- Międzynarodowe społeczności\n- phrik\n\nAby korzystać z Internet Relay Chat (IRC), potrzebny jest klient IRC. Instalacja środowiska live zawiera klienta Irssi.\n\nPrzed dołączeniem do któregokolwiek z oficjalnych kanałów należy zapoznać się z kodeksem postępowania i ogólnymi wytycznymi. Lista powszechnie używanych skrótów znajduje się w Arch terminology.\n\n"
    },
    {
      "title": "Główne kanały",
      "level": 2,
      "content": "Ta sekcja dotyczy #archlinux, głównego kanału wsparcia Arch Linux IRC oraz #archlinux-offtopic, głównego kanału społecznościowego Arch Linux, oba dostępne w sieci Libera Chat. Zobacz https://archlinux.org/news/move-of-official-irc-channels-to-liberachat/\n\nGłównym tematem #archlinux jest wsparcie i ogólna dyskusja na temat Arch Linux.\n\n"
    },
    {
      "title": "Rejestracja",
      "level": 3,
      "content": "W celu ograniczenia spamu, #archlinux i #archlinux-offtopic mają tryb kanału ustawiony na +r i +q $~a. Oznacza to, że musisz być zidentyfikowany przez NickServ, aby móc dołączyć do tych kanałów i wysyłać wiadomości. Jeśli nie jesteś zarejestrowany i zidentyfikowany, zostaniesz przekierowany do #archlinux-unregistered.\n\nAby zarejestrować się w NickServ, postępuj zgodnie z FAQ Libera Chat, a także NickServ HELP po podłączeniu do irc.libera.chat:\n\n```\n/query NickServ HELP REGISTER\n/query NickServ HELP IDENTIFY\n```\n\nNote: **#libera** \n\n- Jeśli /query nie działa w twoim kliencie, możesz spróbować użyć /quote NickServ command lub /msg NickServ command.\n- Niektóre klienty IRC mają problem z automatycznym dołączaniem do kanałów, zanim użytkownik zostanie zidentyfikowany przez NickServ. Aby rozwiązać ten problem, należy włączyć SASL. Sprawdź dokumentację swojego klienta IRC lub zajrzyj na stronę SASL Libera Chat, aby znaleźć instrukcje, jak ją włączyć.\n- Możesz uzyskać listę osób, które mogą ci pomóc, wpisując /msg ChanServ FLAGS #archlinux lub dołącz do #libera i zapytaj tam.\n\n"
    },
    {
      "title": "Operatorzy kanałów",
      "level": 3,
      "content": "Operatorzy Arch są ops zarówno w #archlinux jak i #archlinux-offtopic. Zobacz listę poniżej lub uruchom /msg phrik listops w Libera Chat.\n\nJeśli z jakiegoś powodu potrzebujesz pomocy opa, nie krępuj się wykonać /query lub napisać wiadomość poprzez /msg. Oto lista operatorów na dzień 2021-09-24:\n\n- alad\n- BrainDamage\n- gehidore / man\n- grawity\n- jelle\n- MrElendig / Mion\n- Namarrgon\n\n"
    },
    {
      "title": "Kontakty grupowe Libera Chat",
      "level": 3,
      "content": "Kontakty grupowe pośredniczą w sprawach między personelem sieci Libera Chat, personelem Arch Linux i użytkownikami Arch Linux. Obejmuje to zarządzanie kanałami w przestrzeni nazw #archlinux-* w sieci Libera Chat i przydzielanie masek hostów archlinux/*. Należy pamiętać, że tylko pracownicy Arch Linuksa są uprawnieni do otrzymywania masek hostów.\n\n- wonder / ioni\n- fukawi2\n- anthraxx\n- dvzrv\n- Namarrgon\n\n"
    },
    {
      "title": "Wspólne debugowanie",
      "level": 2,
      "content": "Prosząc o pomoc na kanale pomocy IRC (takim jak #archlinux), niewłaściwe jest wklejanie logów na kanał, co może nawet skutkować wyrzuceniem. Zamiast tego użyj pastebina, możesz użyć factoida phrika !paste, aby zobaczyć, które pastebiny są akceptowalne. Akceptowalne pastebiny zazwyczaj działają bez włączania JavaScript. Niektóre wymagają włączenia JavaScript do publikowania z przeglądarki internetowej, co jest nadal akceptowalne, ponieważ nie wpływa na przeglądarkę. Nie powinny wyświetlać reklam ani innych zakłócających treści, a także nie powinny wymagać logowania. Doskonałe pastebiny zwykle zapewniają sposób wklejania danych wyjściowych za pomocą pipingu.\n\nPrzykładowa lista akceptowanych pastebinów:\n\n- https://0x0.st - obsługuje wklejanie prawie każdego typu pliku. Może mieć nieznacznie uszkodzone wykrywanie typu MIME.\n- https://paste.rs - obsługuje wklejanie obrazów, ale typ MIME będzie nieprawidłowy.\n- https://bpa.st - dobre dla osób, które chcą czegoś graficznego.\n- http://ix.io - tylko http. Popularny, ale przydatny podczas debugowania problemu SSL, który oznacza, że nie można używać pastebinów opartych na https.\n\n"
    },
    {
      "title": "Użycie IRC",
      "level": 3,
      "content": "Przy pierwszym wejściu na kanał nie ma potrzeby witania się. Podaj problem, którego doświadczasz i upewnij się, że jesteś szczegółowy i dostarczysz pliki dziennika. Warto również najpierw wyszukać komunikaty o błędach, aby nie marnować niczyjego czasu. Warte uwagi jest również wyszukanie problemów na którymkolwiek z bugtrackerów danego oprogramowania. Im bardziej jesteś pomocny i konkretny, tym szybciej otrzymasz pomoc.\n\nJeśli jest to problem lub pytanie, które jest bardzo specyficzne dla konkretnego oprogramowania, rozważ odwiedzenie dedykowanego kanału IRC, jeśli taki istnieje. Jest bardziej prawdopodobne, że uzyskasz tam dobrą odpowiedź.\n\n"
    },
    {
      "title": "Wysyłanie błędów/komunikatów do pliku",
      "level": 3,
      "content": "Czasami nie jest możliwe bezpośrednie przesłanie danych wyjściowych do pastebina i należy je wcześniej zapisać w pliku.\n\n```\n$ aplikacja &> aplikacja-wyjscie.txt\n```\n\nJest to przydatne w przypadku wklejania logów zawierających poufne dane, np. numery seryjne w smartctl, które muszą być ręcznie edytowane.\n\n"
    },
    {
      "title": "Inne kanały",
      "level": 2,
      "content": "Rozmiar naszej społeczności doprowadził do utworzenia wielu kanałów IRC. Aby uzyskać listę wszystkich kanałów na irc.libera.chat, które zawierają archlinux w nazwie, użyj polecenia /query alis LIST *archlinux*. Więcej informacji na temat wyszukiwania kanałów można znaleźć na stronie https://libera.chat/guides/findingchannels.\n\nTable content:\nKanał | Temat\n#archlinux-aur | AUR - dyskusja ogólna\n#archlinux-aurweb | aurweb - dyskusja na temat rozwoju\n#archlinux-bugs | Dyskusja skoncentrowana na błędach\n#archlinux-classroom | Projekt, który rozwija i prowadzi zajęcia dla społeczności Arch Linux\n#archlinux-conf | ArchConf - organizacja i dyskusja\n#archlinux-devops | Wewnętrzna infrastruktura Arch Linux i dyskusje na temat devops\n#archlinux-multilib | Dyskusja na temat projektu Arch Linux Multilib i jego pakowania\n#archlinux-newbie | Przestrzeń do nauki, próbowania nowych rzeczy i proszenia o pomoc bez obawy przed ośmieszeniem\n#archlinux-pacman | Rozwój i dyskusja na temat Pacmana\n#archlinux-proaudio | Dyskusja na temat Arch Linux Pro Audio\n#archlinux-projects | Rozwój i omawianie projektów (mkinitcpio, abs, dbscripts, devtools...)\n#archlinux-releng | Dyskusja na temat inżynierii wydań Arch Linux (arch-boxes, archiso, archlinux-docker oraz releng)\n#archlinux-reproducible | Kanał dyskusyjny umożliwiający tworzenie powtarzalnych kompilacji\n#archlinux-security | Dyskusja na temat bezpieczeństwa pakietów Arch\n#archlinux-testing | Kanał dyskusyjny dotyczący repozytoriów testowych\n#archlinux-wiki | Dyskusja na temat ArchWiki, jego artykułów i Arch Linux Forums\n#archlinux-women | Dyskusje o projektach/wydarzeniach mających na celu zachęcenie kobiet do współtworzenia Arch Linux i zapewnienie przestrzeni dla kobiet do spotkań towarzyskich i poznawania się nawzajem. Głównie w języku angielskim.\n\n"
    },
    {
      "title": "Międzynarodowe kanały IRC",
      "level": 3,
      "content": "Międzynarodowe dyskusje są dostępne na następujących kanałach, znajdujących się również w sieci IRC irc.libera.chat, chyba że zaznaczono inaczej.\n\nTable content:\nKanał | Społeczność\n#archlinux-br | Brazylijska\n#archlinux-ca | Katalońska\n#archlinux-cn | Chińska; również na irc.oftc.net#arch-cn\n#archlinux-cz | Czeska\n#archlinux-de | Niemiecka\n#archlinux-dk | Duńska\n#archlinux-es | Hiszpańska\n#archlinux-fr | Francuska\n#archlinux-mx | Meksykańska\n#archlinux-nordics | Kraje nordyckie: duńska, fińska, norweska i szwedzka\n#archlinux-pl | Polska\n#archlinux-pt | Portugalska\n#archlinux-ro | Rumuńska\n#archlinux-tr | Turecka\n#archlinux-ua | Ukraińska\n\n"
    }
  ]
}