{
  "title": "KDE package guidelines",
  "url": "https://wiki.archlinux.org/title/KDE_package_guidelines",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "32-bit – CLR – CMake – Cross – DKMS – Eclipse – Electron – Font – Free Pascal – GNOME – Go – Haskell – Java – KDE – Kernel modules – Lisp – Meson – MinGW – Node.js – Nonfree – OCaml – Perl – PHP – Python – R – Ruby – Rust - Security – Shell – VCS – Web – Wine\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nThe KDE packages on Arch Linux follow a certain schema.\n\n"
    },
    {
      "title": "Build directory",
      "level": 2,
      "content": "A good way of building CMake packages is to make a build directory outside the root of the project and run cmake from that directory. The PKGBUILD should look this way:\n\n```\nprepare() {\n  mkdir -p build\n}\n\nbuild() {\n  cd build\n  cmake ../${pkgname}-${pkgver}\n}\n```\n\n"
    },
    {
      "title": "Install prefix",
      "level": 2,
      "content": "Every packages must set the CMAKE_INSTALL_PREFIX variable.\n\n```\n-DCMAKE_INSTALL_PREFIX=/usr\n```\n\n"
    },
    {
      "title": "Build type",
      "level": 2,
      "content": "Generally you should not specify the build type; this makes CMake honor environmental variables like such as CFLAGS, CPPFLAGS, etc. [1]\n\n"
    },
    {
      "title": "Force Qt version",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "KF package naming",
      "level": 2,
      "content": "Note: Some packages even do not follow kde4 naming scheme. Some examples: kde theme, plasma-runners. Also, there are still some outdated kf5-related packages: plasma5-applets, plasma5-runners, kf5-servicemenus, plasma5-themes.\n\nSome packages even do not follow kde4 naming scheme. Some examples: kde theme, plasma-runners. Also, there are still some outdated kf5-related packages: plasma5-applets, plasma5-runners, kf5-servicemenus, plasma5-themes.\n\n"
    },
    {
      "title": "Plasma widgets",
      "level": 3,
      "content": "Plasma widgets (formerly Plasmoids) packages should be named plasma6-applets-widgetname so that they are recognizable as Plasma 6-related packages; this also distinguishes them from the official packages. See plasma6-applets examples.\n\n"
    },
    {
      "title": "Runners",
      "level": 3,
      "content": "Plasma runners packages should be named plasma6-runners-runnername so that they are recognizable as Plasma 6-related packages; this also distinguishes them from the official packages. See plasma6-runners examples.\n\n"
    },
    {
      "title": "Service menus",
      "level": 3,
      "content": "Service menus packages should be named kf6-servicemenus-servicename so that they are recognizable as KF6 related packages. See kf6-servicemenus examples.\n\n"
    },
    {
      "title": "Themes",
      "level": 3,
      "content": "Plasma themes packages should be named plasma6-themes-themename so that they are recognizable as Plasma 6-related packages. See plasma6-themes examples.\n\n"
    },
    {
      "title": "Icons and .desktop files installation",
      "level": 2,
      "content": "Some KDE software provide icons in the hicolor icon theme and .desktop files, which must be installed via pacman hooks. Refrain from using installation command for these type of files in a .install, as it would result in unnecessary double execution of them.\n\n"
    }
  ]
}