{
  "title": "Keybase",
  "url": "https://wiki.archlinux.org/title/Keybase",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- GnuPG\n\nFrom Wikipedia:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Keybase is provided by the keybaseAUR package. The KBFS filesystem and Keybase GUI can be additionally installed with the kbfsAUR and keybase-guiAUR packages. Alternatively, keybase-binAUR is available on the AUR which includes everything in a single package. See also the install instructions on keybase.io.\n\n"
    },
    {
      "title": "Signup / Login",
      "level": 2,
      "content": "If you installed the GUI via keybase-binAUR, it will walk you through signup. These instructions are for the CLI-only keybaseAUR package.\n\nKeybase requires its service to be running so you can interact with it. Start the keybase.service user unit and enable it to run on boot.\n\nAlternatively, run the keybase service manually:\n\n```\n$ keybase service\n```\n\nTo signup for a Keybase account use, and follow the on-screen prompts:\n\n```\n$ keybase signup\n```\n\nIf you already have a Keybase account you can login with:\n\n```\n$ keybase login keybase_username\n```\n\n"
    },
    {
      "title": "GnuPG Keys",
      "level": 2,
      "content": "During the interactive signup if you already have any GnuPG key pairs on your keyring, Keybase will ask if you wish to use one of them. If you do not have a key pair, you can generate one with:\n\n```\n$ keybase pgp gen\n```\n\nThis will interactively generate a key pair and securely upload the keys.\n\n"
    },
    {
      "title": "Keybase Filesystem (KBFS)",
      "level": 2,
      "content": "KBFS uses FUSE to mount the remote cryptographic filesystem. It comes with the keybase-binAUR package, or can be installed separately with kbfsAUR.\n\nKeybase allows users to store up to 250 GB of files in a cloud storage called the Keybase filesystem. The filesystem is divided into three parts: public files, private files, and team files. The filesystem is mounted to /keybase by default if installed through keybase-binAUR.\n\nTo configure kbfs if installed via the kbfsAUR package, first ensure the keybase service is running (see instructions above). Then configure the desired mountpoint for the KBFS:\n\n```\n$ keybase config set mountdir /path/to/kbfs\n```\n\nNow the kbfs.service user unit can be started.\n\nEnable this service to have the kbfs mounted on boot.\n\nAll files under /path/to/kbfs/public are automatically signed by the client. All files under /path/to/kbfs/private are both encrypted and signed before being uploaded, making them end-to-end encrypted. See the KBFS docs on keybase.io for more information and usage instructions.\n\n"
    },
    {
      "title": "Keybase GUI starts automatically",
      "level": 3,
      "content": "By default, keybase-gui add a desktop entry in your autostart. To disable it:\n\n```\n$ keybase ctl autostart --disable\n```\n\n"
    },
    {
      "title": "Tray icon using AppIndicator GNOME Shell extension",
      "level": 3,
      "content": "You might find that no icon shows up when Keybase starts, if you are using the gnome-shell-extension-appindicator extension. It seems that Electron needs the libappindicator-gtk3 to be installed, so that it can create and manage those icons.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Keybase Homepage\n- Wikipedia:Keybase\n- Keybase Basics\n\n"
    }
  ]
}