{
  "title": "KMSCON",
  "url": "https://wiki.archlinux.org/title/KMSCON",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- KMS\n- systemd\n\nFrom the project's git repository:\n\n"
    },
    {
      "title": "Features",
      "level": 2,
      "content": "Kmscon can function as a drop-in replacement for the in-kernel linux-console. Features include:\n\n- Full vt220 to vt510 implementation.\n- Full internationalization support: Kmscon supports printing full Unicode glyphs, including the CJK ones. Kmscon provides internationalized keyboard handling through libxkbcommon, thus allowing it to use the full range of keyboard layouts supported in X keyboard.\n- Hardware accelerated rendering.\n- Multi-seat capability.\n\n- Kmscon supports printing full Unicode glyphs, including the CJK ones.\n- Kmscon provides internationalized keyboard handling through libxkbcommon, thus allowing it to use the full range of keyboard layouts supported in X keyboard.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Despite its name, KMS is not a hard requirement for kmscon. Kmscon supports the following video backends: drm3d (Linux DRM hardware-rendering backend), drm2d (Linux DRM software-rendering backend), superseded fbdev (Linux fbdev video backend). Make sure one of them is available on your system.\n\nInstall the kmsconAUR package or the kmscon-gitAUR package for a development version. Alternatively, install kmscon-patched-gitAUR. The patched version, along with its patched dependency (libtsm-patched-gitAUR), includes fixes and improvements.\n\nNormally, there is a special systemd configuration for tty1. To be conservative, you can continue to run the traditional agetty on tty1 and only run kmscon on all the other virtual terminals. Or you can run kmscon on both tty1 and the other VTs.\n\nTo enable kmscon on tty1, disable getty@tty1.service and enable kmsconvt@tty1.service.\n\nTo enable kmscon on all virtual terminals, run:\n\n```\n# ln -s '/usr/lib/systemd/system/kmsconvt@.service' '/etc/systemd/system/autovt@.service'\n```\n\nThis will make systemd start kmscon instead of agetty on each VT. More precisely, this will make systemd-logind use kmsconvt@.service instead of getty@.service for new VTs. Additionally, all other systemd units that use getty@.service will not be affected by this change.\n\nIf kmscon cannot start for whatever reason, this unit will cause getty@.service to be started instead. Furthermore, if no VTs are available, this unit will not start anything.\n\n"
    },
    {
      "title": "CJK support",
      "level": 2,
      "content": "Kmscon supports rendering CJK characters through the default font engine pango. However, fontconfig has to be globally configured to map the monospace font alias to proper CJK fonts. For Chinese users, the following template is provided and proved to result in satisfactory Chinese characters rendering:\n\n```\n/etc/fonts/conf.d/99-kmscon.conf\n```\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n<match>\n        <test name=\"family\"><string>monospace</string></test>\n        <edit name=\"family\" mode=\"prepend\" binding=\"strong\">\n                <string>DejaVu Sans Mono</string>\n                <string>WenQuanYi Micro Hei Mono</string>\n        </edit>\n</match>\n</fontconfig>\n```\n\nAlternatively, we can add the following line to /etc/kmscon/kmscon.conf for globally configuring kmscon using the fonts:\n\n```\n/etc/kmscon/kmscon.conf\n```\n\n```\nfont-name=DejaVu Sans Mono, WenQuanYi Micro Hei Mono\nfont-size=14\n```\n\nSee kmscon(1).\n\nYou need to have ttf-dejavu and wqy-microhei, both available from the official repositories, installed.\n\n"
    },
    {
      "title": "Problems with switching between Xorg and kmscon",
      "level": 3,
      "content": "You may want to add hwaccel to /etc/kmscon/kmscon.conf if you have problems with switching between Xorg and kmscon. The file and folder are not part of the package and therefore have to be created manually. Another possibility would be editing the systemd service file.\n\n"
    },
    {
      "title": "No audio control",
      "level": 3,
      "content": "As version 7, if you cannot control the audio, add your user to the audio user group. Be aware of the shortcomings of this choice.\n\n"
    },
    {
      "title": "Vim does not clear terminal output",
      "level": 3,
      "content": "Vim might open without clearing the terminal output, it is still possible to edit the file but the text will not be visible until it is changed. As a workaround, try setting the environment variable TERM=vt220. Alternatively, another vim-like editor like vi or Neovim might work.\n\n"
    },
    {
      "title": "Automatic login",
      "level": 3,
      "content": "It is possible to login as user username automatically without asking for password by adding this to /etc/kmscon/kmscon.conf\n\n```\n/etc/kmscon/kmscon.conf\n```\n\n```\n# Example: Login as user \"username\" without asking for password\nlogin=/bin/login -p -f username\n```\n\nOr as user root:\n\n```\n/etc/kmscon/kmscon.conf\n```\n\n```\n# Example: Login as root in a bash shell without asking for password\nlogin=/bin/bash --login\n```\n\n"
    },
    {
      "title": "HiDPI support",
      "level": 3,
      "content": "You can change font size on the fly with Ctrl++, Ctrl+Shift+=, Ctrl+- shortcuts. Also you can set 'font-dpi' and 'font-size' in /etc/kmscon/kmscon.conf e.g. 'font-dpi=288' 288 is 96 * 3 that is 300% scaling. 96 is default.\n\n"
    },
    {
      "title": "Window managers cannot be started from KMS console",
      "level": 3,
      "content": "Starting an Xorg or Wayland session from the commandline, using startx or, e.g., sway, will fail. Either keep a traditional, non-KMS tty for this purpose or use a login manager instead.\n\n"
    }
  ]
}