{
  "title": "Korean Input",
  "url": "https://wiki.archlinux.org/title/Korean_Input",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Internationalization\n\nThis article describes how to set up a Korean language environment. It does not cover setting up Korean input on a tty.\n\n"
    },
    {
      "title": "Fonts",
      "level": 2,
      "content": "- adobe-source-han-sans-kr-fonts - Korean OpenType/CFF fonts\n- noto-fonts-cjk - Google Noto CJK fonts\n- spoqa-han-sansAUR - Source Han Sans customized by Spoqa\n- ttf-baekmuk - Collection of Korean TrueType fonts\n- ttf-d2codingAUR - D2Coding fixed width TrueType font made by Naver\n- ttf-nanumAUR - Nanum series TrueType fonts\n- ttf-nanumgothic_codingAUR - Nanum series fixed width TrueType fonts\n- ttf-kopubAUR/otf-kopubAUR - Korean TrueType/OpenType fonts by Korea Publisher Society\n- ttf-kopubworldAUR/otf-kopubworldAUR - Multilingual (Korean, Yethangul, Chinese extended, Japanese, Latin extended, Cyrillic, Arabic, Hebrew, Devanagari) TrueType/OpenType fonts by Korea Publisher Society\n\n"
    },
    {
      "title": "Locale",
      "level": 2,
      "content": "You should have ko_KR.UTF-8 enabled in /etc/locale.gen. It is recommended that you always use a .UTF-8 locale rather than the ko_KR.EUC-KR locale. For more information, read locale.\n\n"
    },
    {
      "title": "Input methods",
      "level": 2,
      "content": "The following input methods are available for Korean:\n\n- fcitx5-hangul for Fcitx5\n- ibus-hangul for IBus\n- scim-hangulAUR for SCIM\n- uim-byeoru of uim\n- Nimf\n- #Nabi\n\n"
    },
    {
      "title": "Fcitx5",
      "level": 4,
      "content": "Fcitx5 is a modern Chinese/Japanese/Korean input method. Install the fcitx5-hangul and fcitx5-im packages for Korean input and configuration respectively.\n\nAfter installing Fcitx5-im, run fcitx5-configtool, select Add Input Method -> Deselect \"Show Only Current Language\" and add Hangul.\n\nLastly, add the following to /etc/environment for Fcitx5 to work across almost all apps:\n\n```\nGTK_IM_MODULE=fcitx\nQT_IM_MODULE=fcitx\nXMODIFIERS=@im=fcitx\n```\n\n"
    },
    {
      "title": "Nabi",
      "level": 4,
      "content": "Nabi is a standalone Korean input method, developed by Choe Hwanjin, offering many unique features, such as Yethangul support.\n\nInstall the nabi-gitAUR package.\n\nOnce you have finished the installation, add the following to xprofile, xinitrc, or xsession:\n\n```\nexport XIM=nabi\nexport XIM_ARGS=\nexport XIM_PROGRAM=\"nabi\"\nexport XMODIFIERS=\"@im=nabi\"\nexport GTK_IM_MODULE=xim\nexport QT_IM_MODULE=xim\n```\n\nOnce you restart the X session, nabi will autostart by default. The default Korean keyboard layout is Dubeolsik(두벌식). If you need a different Korean keyboard layout (e.g. Sebeolsik or Dubeolsik Yetgul), click on the system tray icon of nabi, and select a input method from the menu that pops up.\n\n"
    },
    {
      "title": "scim-hangul",
      "level": 4,
      "content": "Install scim-hangulAUR.\n\nNow add the following to the user's .xinitrc, .xprofile, or .xsession:\n\n```\nexport XMODIFIERS=@im=SCIM\nexport GTK_IM_MODULE=\"xim\"\nexport QT_IM_MODULE=\"scim\"\nscim -d\n```\n\n"
    },
    {
      "title": "uim-byeoru",
      "level": 4,
      "content": "Follow the instructions in User:Isaac914/uim to install uim and to get it running. Return to this section after uim is installed and running as the default input method.\n\nOpen the uim preferences window by running :\n\n```\n$ uim-pref-gtk (Or, uim-pref-gtk3/uim-pref-qt4)\n```\n\nWithin global settings, check on the Specify default IM checkbox. Then, set Byeoru as default. You may also want to disable input methods that you do not plan on using by clicking on the 'edit' button. If you want to quickly switch between Korean and other languages (other than English), check the enable IM switching by hotkey checkbox, and set a hotkey to switch between enabled IMEs.\n\nWhen you are done with the global preferences, find Byeoru in the tree menu on the left side of the preferences window. From there, you can set the Korean keyboard layout you want to use (e.g. 3 beol), specify the korean/Hanja dictionary that Byeoru will use, and other miscellaneous settings. Then, click on Byeoru Keybinding 1 in the tree menu. Set the hotkey you want to use to enable/disable Byeoru. Most Korean users use Ctrl+space or shift+space.\n\nIf all went properly, you should now be able to use UIM-byeoru to type in Korean.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n"
    },
    {
      "title": "Libreoffice",
      "level": 4,
      "content": "In some cases, Libreoffice will not take Korean input from any input method. To resolve this issue, try adding export OOO_FORCE_DESKTOP=\"gnome\" to .xinitrc, .xprofile, or .xsession.\n\n"
    },
    {
      "title": "Using the Right alt key to switch input methods",
      "level": 4,
      "content": "You can use the right Alt key (e.g. '한/영키') to switch between Input methods if you are using uim, scim, or nabi. To do this, add the following lines after the environment variables that start your input method:\n\n```\n~/.xprofile\n```\n\n```\nxmodmap -e 'remove mod1 = Alt_R'\nxmodmap -e 'keycode 108 = Hangul'\nxmodmap -e 'remove control = Control_R'\nxmodmap -e 'keycode 105 = Hangul_Hanja'\n```\n\nThen, in the settings of your input method, add the right Alt key as a hotkey to switch IMEs. The right Alt key has been remapped to a non-modifier key called \"Hangul\". The script above also allows you to use the right Ctrl key (e.g. '한자키') to activate Hanja input. The right Ctrl key should also have been remapped to \"Hangul_Hanja\". Add this key as a Hanja hotkey within the settings of your input method. If adding that to your .xprofile or .xinitrc file did not work, create a script containing those four lines and set it to auto execute when your desktop environment starts up.\n\n"
    }
  ]
}