{
  "title": "Lenovo ThinkPad T25",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_T25",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nNote: **This article or section is a candidate for merging with Lenovo ThinkPad T470.** This article or section is a candidate for merging with Lenovo ThinkPad T470.\n\nThis article or section is a candidate for merging with Lenovo ThinkPad T470.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) |  | Yes\nGPU (Nvidia) |  | Yes\nWireless |  | Yes\nBluetooth |  | Yes\nMobile broadband |  | Yes\nWebcam |  | Yes\nIR Camera |  | Yes\nTrackPoint |  | Yes\nTouchpad |  | Yes\nTouchscreen |  | Yes\nFingerprint Reader |  | No\n\nThis article covers the installation and configuration of Arch Linux on a Lenovo T25 Anniversary Edition laptop. It is based on the Lenovo T470 laptop so most of the hardware is identical and therefore should work like the T470.\n\nFor a general overview of laptop-related articles and recommendations, see Laptop.\n\n"
    },
    {
      "title": "Firmware (e.g. bios and peripherals)",
      "level": 2,
      "content": "As of writing, the current BIOS version is 1.54. By visiting the downloads section (T25) an ISO can be downloaded and burned to disk which will perform the update from Lenovo. Or extracted and copied on a USB Stick.\n\n"
    },
    {
      "title": "Kernel and hardware support",
      "level": 2,
      "content": "Hardware video acceleration with Kaby Lake seems to work fine via va-api.\n\nAs noted in Intel graphics, the xf86-video-intel driver seems to cause more issue than the builtin modesetting Xorg driver. Works fine without the intel driver (on a Skylake configuration).\n\n138a:0097 will hopefully be supported as part of Validity90. Since the hardware is the same as in the T470 model, the fingerprint reader guide probably will work.\n\n"
    },
    {
      "title": "Screen backlight",
      "level": 3,
      "content": "With the intel driver (xf86-video-intel the xbacklight brightness control is not working. It is possible that, with the good acpi_* kernel parameters, the backlight related keys do their job.\n\nOther workaround exists, such as described on this post or in the wiki acpid#Enabling backlight control. Using the acpilightAUR package as a xbacklight replacement works well. You can also check this repository as a base to add the ACPI rules to call xbacklight when backlight keys are pressed.\n\n"
    },
    {
      "title": "UEFI boot",
      "level": 3,
      "content": "After configuring the BIOS setup to allow UEFI boot (either UEFI only or both), it works flawlessly.\n\n"
    },
    {
      "title": "Special buttons",
      "level": 3,
      "content": "See Laptop/Lenovo#Special buttons, an additional key has to be added for this model:\n\nTable content:\nKey combination | Scancode | Keycode\nFn+Space | 0x13 | 372 KEY_ZOOM\n\n"
    },
    {
      "title": "Touchpad and trackpoint",
      "level": 3,
      "content": "Touchpad and trackpoint share bandwidth, so using them at the same time makes trackpoint slow, jumpy, and abrupt. Disabling the touchpad either in BIOS or via xinput does not fix the problem, so the trackpoint becomes unusable each time the touchpad is occasionally touched.\n\nThe touchpad is also accessible over secondary bus (SMBUS/RMI), allowing to leave the full bandwidth for the trackpoint. The kernel source code contains the whitelist of supported devices, which does not include LEN008e (T25 touchpad). You can enforce this feature setting synaptics_intertouch parameter of psmouse module to 1. For instance, using the kernel command line: psmouse.synaptics_intertouch=1.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Lenovo Support Page\n\n"
    }
  ]
}