{
  "title": "Lenovo ThinkPad X1 Extreme (Gen 2)",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_X1_Extreme_(Gen_2)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad | PS/2 | Yes\nGPU (Intel) | 8086:3e9b | Yes\nGPU (NVIDIA) | 10de:1f91 | Yes\n10de:1fb8 | Yes\nTouchscreen | 056a:51a0 | Yes\nWebcam | 04f2:b67c | Yes\nEthernet | 8086:15bc | Yes\n8086:15bb | Yes\nBluetooth | 8087:0029 | Yes\nSD-card reader | 10ec:525a | Yes\n17a0:9755 | Untested\nSmart-card reader | 058f:9540 | Untested\nAudio | 8086:a348 | Yes\nWi-Fi | 8086:2723 | Yes\nFingerprint reader | 06cb:00bd | Yes\nThunderbolt | 8086:15ea | Untested\n\nThis page covers the ThinkPad P1 (Gen 2) and the ThinkPad X1 Extreme (Gen 2), as their hardware is extremely similar.\n\n"
    },
    {
      "title": "Thunderbolt",
      "level": 2,
      "content": "To use Thunderbolt 3, go into BIOS and enable BIOS Assist mode (Thunderbolt 3 -> Enable BIOS assist mode)\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "As of writing, a bug exists where the battery data can appear corrupt, wildly incorrect, or seem to change drastically from boot to boot. To workaround this bug you should add battery to the /etc/mkinitcpio.conf.\n\n```\nMODULES=(battery)\n```\n\nRemember to regenerate the initramfs for these changes to take effect.\n\n"
    },
    {
      "title": "Video",
      "level": 2,
      "content": "As of Linux 5.2.9, the Nouveau driver can cause quite a lot of kernel panics when using the webcamera.\n\n"
    },
    {
      "title": "OLED Display",
      "level": 3,
      "content": "OLED screens have no backlight, brightness cannot be controlled by changing backlight power in the traditional way. Instead, it can be controlled using PWM by enabling following option:\n\n```\n/etc/modprobe.d/i915.conf\n```\n\n```\noptions i915 enable_dpcd_backlight=1\n```\n\nAlternatively, you can add it as a kernel parameter:\n\n```\ni915.enable_dpcd_backlight=1\n```\n\nBrightness control is not yet supported by standard tools. You can try oled-backlightAUR.\n\n"
    },
    {
      "title": "Hybrid Graphics",
      "level": 4,
      "content": "Hybrid Graphics (also known as Nvidia Optimus) Allows the system to use the integrated Intel graphics and the Nvidia GPU interchangeably without rebooting.\n\nBrightness control under Hybrid Graphics should work \"out of the box\" with no kernel command line options necessary. If you notice brightness controls cease working, check that your BIOS settings are still for \"Hybrid Graphics\" and not \"Discrete Graphics\".\n\n"
    },
    {
      "title": "Discrete Graphics",
      "level": 4,
      "content": "Discrete graphics means only the Nvidia GPU is available to the system (i.e. \"Discrete Graphics\" selected in BIOS).\n\nBrightness control can be controlled with xbacklight. Keys might need to be bound using a tool like xbindkeys.\n\n"
    },
    {
      "title": "Keyboard",
      "level": 2,
      "content": "There is an issue with keystrokes being skipped at times (see the Lenovo forums). This is resolved with system firmware version 1.30. See Firmware to check your current version and upgrade.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "If you are having issues with trackpad functionality not working after a sleep and resume, like non-smooth tracking or tap clicking not registering, you can switch back to the older communication protocol:\n\n```\n/etc/modprobe.d/trackpad.conf\n```\n\n```\noptions psmouse synaptics_intertouch=0\n```\n\nMore details on what this does at BBS#229349.\n\n"
    },
    {
      "title": "Wireless",
      "level": 2,
      "content": "If your Wi-Fi card is occasionally not detected after reboots, this may be related to a known bug that is related to windows fastboot. Workarounds are to completely shutdown the machine (no suspend or reboot), on next boot it works for me. Alternatives suggested are to first boot into windows, and/or disable windows fastboot in the bios.\n\nReferences: [1] [2] [3]\n\n"
    },
    {
      "title": "Ethernet",
      "level": 2,
      "content": "If you have issues with a gigabit connection being capped at 100 MB/s and you are using the e1000e driver, try adding pcie_aspm=off to the kernel boot parameters.\n\nAdditionally, run the following to get a more slight network performance improvement:\n\n```\nethtool -s <INTERFACE> autoneg on speed 1000 duplex full\n```\n\nReferences: [4]\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "BIOS and firmware updates are available via fwupd, the Lenovo Vantage application on Windows, or from Lenovo's website.\n\nThe latest BIOS version is highly recommended. All information on this page should assume the latest BIOS unless explicitly stated otherwise.\n\n"
    },
    {
      "title": "Check BIOS version",
      "level": 3,
      "content": "From Lenovo's firmware readme, to check the system's installed BIOS version:\n\n```\nDETERMINING WHICH VERSION IS INSTALLED\n\n [Checking on ThinkPad Setup]\n\n  1. Turn on the computer.\n  2. While the \"To interrupt normal startup, press Enter\" message is displayed\n     at the lower-left area or lower-center of the screen, press the F1 key.\n     The ThinkPad Setup menu will be displayed. If a password prompt appears,\n     type the correct password.\n  3. Locate the UEFI BIOS Version line.\n     \"UEFI BIOS version (BIOS ID)\" will be shown on the UEFI BIOS Version line.\n  4. Turn off the computer.\n```\n\nAlternatively, use fwupdmgr from fwupd without rebooting:\n\n```\n$ fwupdmgr get-devices\n```\n\n```\n...\n├─System Firmware:\n│     Current version:     0.1.30\n...\n```\n\n"
    },
    {
      "title": "Disabling Absolute Persistence",
      "level": 3,
      "content": "Lenovo offers two BIOS versions with their releases; Absolute Persistence and Non-absolute Persistence. Absolute Home & Office (originally known as CompuTrace, and LoJack for Laptops) is a proprietary laptop theft recovery software (laptop tracking software) with features including the abilities to remotely lock, delete files from, and locate the stolen laptop on a map. More information about its functionality and vulnerabilities can be read here\n\nIf you do not subscribe to this service and have no use for it, you can flash an alternate BIOS provided by Lenovo listed as \"Non-Absolute Persistence\". The BIOS versions are identified by their letter at the end of the .cab file. Versions ending in W include Absolute's features and versions ending in P remove it. The Non-Absolute version is included in the zip file containing BIOS updates from Lenovo's website or you can directly download it from fwupd.org.\n\nTo install the Non-Absolute Persistence BIOS, you must first permanently disable Computrace in the BIOS. Once done, you can flash the Non-Absolute Persistence (P version) with the same instructions.\n\n"
    },
    {
      "title": "Updating",
      "level": 4,
      "content": "Download the zip file labelled \"BIOS Update Utility (Linux)\" from Lenovo's support website or fwupd.org directly. Extract the zip file, then use fwupd to update the firmware:\n\n```\n# fwupdmgr install filename.cab\n```\n\nThen reboot immediately to finish the upgrade.\n\n"
    },
    {
      "title": "Reverting to previous versions",
      "level": 4,
      "content": "To downgrade your bios, you can use the --allow-older flag with fwupd.\n\n"
    }
  ]
}