{
  "title": "Lenovo IdeaPad 7 14are05",
  "url": "https://wiki.archlinux.org/title/Lenovo_IdeaPad_7_14are05",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU |  | Yes\nWebcam | 13d3:5419 | Yes\nBluetooth | 8087:0029 | Yes\nSD-card reader |  | Yes\nAudio |  | Yes\nWireless | 8086:9df0 | Yes\nFingerprint reader |  | Untested\nTPM |  | Untested\n\n"
    },
    {
      "title": "Specifications",
      "level": 2,
      "content": "This device is marketed both as Lenovo IdeaPad Slim 7 as well as Lenovo Yoga Slim 7 depending on the region. Hence, the below instructions should in principle apply to both these models and minor variants.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Enter the UEFI Firmware setup by pressing (Fn+) F2 during boot and disable Secure Boot which should deactivate bootloader and kernel verification for Windows 10 against Lenovo and Microsoft keys. Proceed to ensure that the machine allows for booting from a USB key. Boot with the latest Arch Linux ISO image and follow the Installation guide.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The appearance of the UEFI Firmware interface is reminiscent of regular BIOS'es and solely keyboard-driven.\n\nThe device has a convenient feature which is enabled by default in the UEFI Firmware, where pressing of a key when the device is off will display the state of charge (SoC) of the battery.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Firmware updates are supported via fwupd:\n\n```\n# fwupdate -s\n```\n\n```\nFirmware updates are supported on this machine.\n```\n\nFirmware updates should become / be made available for the following devices:\n\n- Integrated Camera\n- Samsung NVMe SSD\n- System Firmware\n- Touchpad\n- UEFI dbx\n\n"
    },
    {
      "title": "Secure Boot",
      "level": 3,
      "content": "Optionally verify the UEFI Firmware version via:\n\n```\n# dmidecode -s bios-version\n```\n\nIn order to enable Secure Boot with your own custom keys, follow the steps as outlined on the Secure Boot page, up to the point of installing your own Platform Key (PK).\n\nAn attempt to install a custom Platform Key will fail using the mentioned methods, including using efi-updatevar -f PK.auth as well as sbkeysync --verbose --PK with error messages such as 'operation not permitted'.\n\nThese errors are due to the fact that the PK file in the firmware has the 'immutable' bit set. Source for this idea was a comment in this thread from the author of efitools. To verify the state of the 'immutable' bit, do:\n\n```\n$ lsattr /sys/firmware/efi/efivars/PK-(Lenovo key UID)\n```\n\nThe output should be;\n\n```\n----i--------------\n```\n\nwhere the single 'i' indicates that the immutable bit is indeed set.\n\nProceed to unset the 'immutable' bit by entering:\n\n```\n# chattr -i /sys/firmware/efi/efivars/PK-(Lenovo key UID)\n```\n\nNext, install your custom Platform Key (PK) as per one of the methods mentioned in the Secure Boot page instructions (sbkeysync, part of sbsigntools should work fine). It should install without error.\n\nCheck the correct installation of the new PK:\n\n```\n$ efi-readvar\n```\n\nIt should list all custom keys/certificates (PK, KEK, DB, optionally dbx) as enrolled in the machine's UEFI Firmware.\n\nSet the immutable bit for the new PK:\n\n```\n# chattr +i /sys/firmware/efi/efivars/PK-(UID of your new PK)\n```\n\nThe instructions from the Secure Boot page apply again from this point.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "Bluetooth works out of the box by simply following the instructions on the Bluetooth page.\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "See Power management/Suspend and hibernate for the details on the various supported sleep states.\n\nThere are descriptions of ways of re-enabling the S3 power state on similar devices (see Lenovo IdeaPad 5 14are05#Suspend and here for example). However this has not been tested as of yet on this machine by the author.\n\n"
    },
    {
      "title": "Energy Saving",
      "level": 3,
      "content": "The tips on the Power management page can be followed in order to optimize the power savings for the machine, such as creating configuration files in /etc/modprobe.d/ for WiFi and audio power saving. This can be tested, verified and optimized in conjunction with powertop for example. When idling, the machine should consume as little as around 3W.\n\n"
    },
    {
      "title": "Battery Conservation Mode",
      "level": 3,
      "content": "A simplified summary of lithium-ion battery chemistry limitations is that lithium-ion cells can get damaged when fully drained, but equally dislike being kept at or near 100% SoC (State of Charge), which stresses the cells causing them to degrade faster than normal/expected. In case lithium-ion batteries are to be stored or otherwise remain unused for a prolonged period of time, a SoC of around 50% to 60% is advisable (it is for example no accident that nearly all new devices such as tablets, cellphones etc. are pre-charged to around 50% SoC when one first unpacks them).\n\nEqually, lithium-ion batteries should preferably be charged at 0,5C, meaning that the input current (Amps) should not exceed half of the cell's rated capacity (e.g. 2100mAh rated AA cell should preferably be placed in a charger that charges at max 1050 mAmps). Charging at higher rates can be done safely (even much higher rates can be achieved under controlled conditions, such as with cooling to prevent a 'thermal runaway' reaction) but will put a strain on the cells causing for faster degradation.\n\nSeveral Lenovo laptops including this machine have hardware in place that manages both of the above, called battery Conservation Mode. Under GNU/Linux, this mode can be set persistently from the command-line. When set, the machine will either discharge to 60% or charge up to 60%, depending on the current SoC being either higher or lower.\n\nThus, in this mode, one can use the device as a desktop machine and safely leave the charger connected for extended periods of time.\n\nIn order to set this mode, first verify that the 'ideapad_laptop' kernel module has been loaded:\n\n```\n# lsmod | grep ideapad_laptop\n```\n\nIf not, you can attempt to load it manually:\n\n```\n# modprobe ideapad_laptop\n```\n\nTo turn on battery Conservation Mode for the machine, perform the following action:\n\n```\n# echo 1 > /sys/bus/platform/drivers/ideapad_acpi/VPC2004\\:00/conservation_mode\n```\n\nCheck/verify the current value:\n\n```\n$ cat /sys/bus/platform/drivers/ideapad_acpi/VPC2004\\:00/conservation_mode\n```\n\nIt should now list \"1\"\n\nThe laptop should now charge/discharge until it reaches 60%.\n\nAt 60% the reported battery state should, instead of \"charging\" or \"discharging\", be reported as \"unknown\"\n\n```\n$ acpi -i\n```\n\n```\nBattery 0: Unknown, 59%\n```\n\n- You can turn off Conservation Mode again at any time by echoing a value of \"0\" instead of \"1\" in the echo-step above in order to revert to the original mode.\n- There are two Bash-scripts in the AUR with which battery Conservation Mode can be conveniently set: ideapad-cmAUR, ipmanAUR.\n\n"
    },
    {
      "title": "Video",
      "level": 4,
      "content": "The HDMI output will work out of the box. Read the Multihead and xrandr pages in order to set up a second monitor and for example switch between the internal eDP screen and an external HDMI monitor.\n\n"
    },
    {
      "title": "Audio",
      "level": 4,
      "content": "Additionally, pulseaudio can be made to output sound to the speakers of the external display, if present. In order to do this, set the external monitor as default output using e.g. pulsemixer or pamixer or check the PulseAudio page for further reference. When the external monitor goes into standby or is disconnected, audio will automatically switch back to the machine's speakers.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nFn | Yes | Yes | XF86WakeUp\nFn+Esc | No | Yes | Enables Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86AudioMicMute\nFn+F5 | Yes | Yes | XF86MonBrightnessDown\nFn+F6 | Yes | Yes | XF86MonBrightnessUp\nFn+F7 | Yes | Yes | \nFn+F8 | Yes | Yes | XF86RFKill\nFn+F9 | No | Yes | \nFn+F10 | No | Yes | Lock X screen\nFn+F11 | No | Yes | \nFn+F12 | Yes | Yes | XF86Calculator\nFn+Space | No | Yes | Enables/disables keyboard backlight\nFn+Up | Yes | Yes | Page Up\nFn+Down | Yes | Yes | Page Down\n\n1. The key is visible via xev (see package xorg-xev) and similar tools.\n1. The physical key has a symbol on it, which describes its function.\n\n"
    },
    {
      "title": "Screen brightness control",
      "level": 3,
      "content": "Brightness of the built-in (eDP) screen can be set by echoing any value between 0 and 255 to /sys/class/backlight/amdgpu_bl0/brighness, e.g.\n\n```\n# echo 70 > /sys/class/backlight/amdgpu_bl0/brightness\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Lenovo Yoga Slim 7 / IdeaPad Slim 7 User Guides: https://pcsupport.lenovo.com/ar/en/products/laptops-and-netbooks/ideapad-s-series-netbooks/slim-7-14are05/documentation/doc_userguide\n\n"
    }
  ]
}