{
  "title": "Lenovo ThinkPad Edge 13",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_Edge_13",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nHow to setup Arch Linux on Lenovo ThinkPad Edge 13. This guide has been written aside the ThinkPad Edge AMD version with ATI-graphics.\n\nThis article was written to assist you with getting Arch Linux run on the Lenovo ThinkPad Edge 13 (released in 2010).\n\n"
    },
    {
      "title": "Prerequisites",
      "level": 2,
      "content": "First and important to do is an BIOS-Update (As of 2010/08/20 to Version 1.19.)\n\nThis was done by using grub4dos which can be found here. Because a simple dd did not create a bootable USB-Stick for me.\n\n"
    },
    {
      "title": "BIOS-Update:",
      "level": 3,
      "content": "Download grub4dos.\n\nUnpack it on another *nix-box and run:\n\n```\n# ./bootlace.com /dev/sdX\n```\n\nwith /dev/sdX being your USB-Stick (as the Thinkpad Edge 13 has no CDROM-Drive) in the directory, where you unpacked your files.\n\nAfterwards copy grldr and menu.lst to the device:\n\n```\n$ cp grldr /media/USBSTICK\n$ cp menu.lst /media/USBSTICK\n```\n\nDownload the BIOS update from the BIOS section on this support site. Pick the one that matches your current BIOS Id. Copy the iso-file to the / directory of the USB-Stick!\n\nFinally you have to add the following code to the menu.lst on your pendrive to make the USB-Stick boot the PC DOS program made by lenovo:\n\n```\ntitle Thinkpad-Edge-BIOS-UPDATE\nfind --set-root /6yuj06uc.iso\nmap /6yuj06uc.iso (0xff) || map --mem /6yuj06uc.iso (0xff)\nmap --hook\nchainloader (0xff)\nboot\n```\n\nInserting such a prepared USB-Stick into your Thinkpad Edge, and things should be self-explanatory after that.\n\n"
    },
    {
      "title": "Creating an installation medium",
      "level": 3,
      "content": "See USB flash installation medium\n\n"
    },
    {
      "title": "WLAN deauthentication issues",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nIf you are using the rtl8192ce module, you may experience some intermittent deauthentication issues with newer kernels (tested on 3.4.4-2-ARCH). The reason is because the BIOS is turning off the wireless card when the BIOS deems it to be \"inactive.\" This is the case if dmesg reports\n\n```\n[  285.140301] wlan0: deauthenticating from MAC by local choice (reason=3)\n```\n\nA simple solution to this problem is to enter the BIOS setup and disable PCI Express power management.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "To get jack sensing to work add:\n\n```\noptions snd-hda-intel model=\"olpc-xo-1_5\"\n```\n\nto /etc/modprobe.d/modprobe.conf.\n\n"
    },
    {
      "title": "Video",
      "level": 3,
      "content": "If you have the AMD-AMD model you can use the free ati drivers. Install xorg-server xf86-video-ati.\n\nThese drivers give enough horsepower for compiz and video playback.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "A synaptics touchpad with two-finger scrolling. Install xf86-input-synaptics.\n\n"
    },
    {
      "title": "Frequency scaling",
      "level": 3,
      "content": "The Turion work well with powernow-k8. Please refer to the wiki for more information on cpufrequtils. Dont forget to add powernow-k8 to your modules array.\n\n"
    },
    {
      "title": "Fan control",
      "level": 3,
      "content": "Add the follwing line to your /etc/modprobe.d/modprobe.conf\n\n```\noptions thinkpad_acpi fan_control=1\n```\n\nThen you can manually set your fanspeed with:\n\n```\n# echo level 7 > /proc/acpi/ibm/fan\n$ cat /proc/acpi/ibm/fan # for more commands.\n```\n\nOther files will report their status and commands when read too.\n\n"
    },
    {
      "title": "Webcam",
      "level": 3,
      "content": "Works out of the box. Test with\n\n```\n$ mplayer tv:// -tv driver=v4l2\n```\n\nIf you use skype and the video is way to dark, skype forgot to enable automatic exposure control. Install v4l2 control and set it yourself. You need to to do it everytime you use skype. Install v4l-utils, then:\n\n```\n$ v4l2-ctl -c exposure_auto_priority 1\n```\n\nYour video should gradually begin to brighten up. More options:\n\n```\n$ v4l2-ctl -l\n```\n\n"
    },
    {
      "title": "Suspend",
      "level": 3,
      "content": "First, you might need to add the following to your kernel commandline if suspend does not work. Newer models do not require the following hacks, so make sure that neither suspend nor Wi-Fi works.\n\n```\nkernel root= ... acpi_osi=linux noapic\n```\n\nSecond, your Wi-Fi card will delay resume by roughly 2 minutes. That means that your laptop is not frozen but still resuming. Wi-Fi wont want to work, too. This can be worked around by removing the Wi-Fi modules before suspend. You can do this automatically if you use pm-utils. Please refer for more information to the pm-utils wiki article. Below follows a /etc/pm/sleep.d/100wifiworkaround.sh script for automation\n\n```\n#!/bin/bash\n#\ncase $1 in\n  hibernate)\n    ifconfig wlan0 down\n    rmmod rtl8192ce\n    rmmod r8169\n    ;;\n  thaw)\n    modprobe rtl8192ce # Pulls r8169 in\n    ;;\n  sleep)\n    ifconfig wlan0 down\n    rmmod rtl8192ce\n    rmmod r8169\n    ;;\n  resume)\n    modprobe rtl8192ce\n    ;;\n  *)\n    echo \"I dont do that. Read me first please.\"\n    ;;\nesac\n```\n\n"
    },
    {
      "title": "High power consumption",
      "level": 3,
      "content": "In some cases you may experience high power consumption despite of all BIOS powersaving functions turned on.\n\nThis is because the BIOS settings do not really disable the dedicated video card, they just force the notebook to use the integrated graphics.\n\nThe solution is simple: enable video card switching and use system means (vgaswitcheroo?) to disable dedicated graphics.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Lenovo ThinkPad T61\n\n"
    }
  ]
}