{
  "title": "Lenovo ThinkPad T490s",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_T490s",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWireless |  | Yes\nAudio |  | Yes\nTrackPoint |  | Yes\nTouchpad |  | Yes\nWebcam | 04ca:7070 | Yes\nBluetooth |  | Yes\nMobile broadband | 2cb7:0210 | Yes\nFingerprint reader | 06cb:00bd | Yes\nMicroSD Reader |  | Yes\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "Touchpad works. But some users have reported issues with the related Lenovo ThinkPad T490#Touchpad.\n\nSometimes the kernel may use an incorrect mode for communicating with the touchpad, causing the touchpad to completely cease working. This could happen after upgrading the firmware in Windows. This could be indicated by something like following in the kernel log.\n\n```\n# dmesg\n```\n\n```\n[ 2.874664] elan_i2c 0-0015: 0-0015 supply vcc not found, using dummy regulator\n```\n\nA workaround is to load the psmouse module with elantech_smbus=0 option. You can do so by creating a file /etc/modprobe.d/psmouse.conf with the following content:\n\n```\n/etc/modprobe.d/psmouse.conf\n```\n\n```\noptions psmouse elantech_smbus=0\n```\n\nor by applying the psmouse.elantech_smbus=0 kernel parameter. See FS#59714 for more info.\n\n"
    },
    {
      "title": "Mobile broadband",
      "level": 2,
      "content": "Fibocom L830-EB-00 LTE WWAN USB Modem works out of box. Newest models like Fibocom L850-GL USB/PCI can be more problematic because missing PCI motherboard specific driver.\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 2,
      "content": "The fingerprint reader works with some recent firmware and software updates.\n\n1. Use fwupd to install the latest firmware for \"Synaptics Prometheus Fingerprint Reader\". The update might have to be done manually as the released firmware is in testing; or you could enable the testing remote in fwupd to allow automated upgrade. The relevant firmwares are Prometheus Fingerprint Reader and Prometheus Fingerprint Reader Configuration.\n1. fprintd ≥ 1.90.1 and libfprint ≥ 1.90.1 are required.\n\nfprint has more details on how to setup the fingerprint, for PAM-based authentication for example.\n\n"
    },
    {
      "title": "ACPI",
      "level": 2,
      "content": "The default /etc/acpi/handler.sh script has a check for the device that looks like this:\n\n```\nac_adapter)\n        case \"$2\" in\n            AC|ACAD|ADP0)\n```\n\nThis will not work, since the T490s device is called ACPI0003:00 which is not matched by the above check. The instructions in Acpid does mention a pattern that does work and it is recommended to use this instead.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Most function keys should work out of the box, but if it does not, bind mentioned keys to below commands:\n\n- F1 key: amixer set Master toggle.\n- F2 key: amixer set Master 5%-.\n- F3 key: amixer set Master 5%+.\n- F4 key: amixer set Capture toggle.\n\n"
    }
  ]
}