{
  "title": "Lenovo ThinkPad T570",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_T570",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nTrackPoint |  | Yes\nKeyboard |  | Yes\nVideo | 8086:1916 | Yes\nWebcam | 04f2:b5ab | Yes\nBluetooth | 8087:0a2b | Yes\nWi-Fi | 8086:24f3 | Yes\nI219-LM | 8086:156f | Yes\nAudio | 8086:9d70 | Yes\nSD card reader | 0bda:0316 | Yes\nFingerprint reader |  | Not tested\nMobile broadband |  | Not tested\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Make sure that Secure Boot is disabled in BIOS Setup.\n\n"
    },
    {
      "title": "BIOS Update",
      "level": 3,
      "content": "Install this BIOS update (or a newer one) to fix a serious bug concerning hyperthreading and issues with thunderbolt [1] [2] , which can affect you even if you do not use thunderbolt. [3] See Flashing BIOS from Linux for details on how to install the BIOS without an optical drive; the geteltoritoAUR method is known to work on the T570.\n\nNote: before flashing, you have to disable the Intel BIOS guard or risk bricking your laptop. In the BIOS, set Security - Intel (R) SGX - Intel (R) SGX Control to Disabled. Do the same for Device guard, if needed. If you corrupt your BIOS, you can fix it by flashing a working ROM directly into the EEPROM chip either with a Raspberry Pi or a specialized programming device.\n\n"
    },
    {
      "title": "Healing a corrupted BIOS",
      "level": 4,
      "content": "If you got bitten by the Intel BIOS (Boot) Guard, you can follow these instructions to reverse the damage.\n\n1. Open the bottom cover (see video)\n1. Locate the chip containing the BIOS. It is under a black sticker (see photo). The model of the chip is MXIC MX25L12873F M2I-10G (see datasheet).\n1. Connect your programming device to the chip using a SOIC8 clip. You should probably support the clip and its cable somehow, so it remains completely still.\n1. Read the old BIOS image from the chip using Flashrom or the software that came with your programming device\n1. Open the old BIOS image with uefitoolAUR\n1. In UEFITool, do File - Search - String and systematically input BIOS IDs that are found in the VERSION INFORMATION section of the Lenovo BIOS readme file found on the Lenovo BIOS download page\n1. When you hit the corresponding ID, you will see something like this in the Message section of UEFITool: \"Unicode text \"N1VET31W\" found in PE32 image section at offset 31B0h\"\n1. Download the BIOS with the matching ID from Lenovo's site (it has to be the same, because Boot Guard is looking at the specific cryptographic signature)\n1. Install geteltoritoAUR\n1. Extract the boot image with a command like $ geteltorito.pl -o n1vur04w.img n1vur04w.iso\n1. Create a loop device # losetup -P /dev/loop0 n1vur04w.img\n1. Mount the partition found in the loop device # mount /dev/loop0p1 /mnt\n1. In the mounted partition, navigate into the directory named something like Flash/N1VET31W/\n1. Copy the file with the extension FL1 into your project directory\n1. Unmount # umount /mnt # losetup -d /dev/loop0\n1. In your old corrupted BIOS, the section with the corruption is pinpointed by UEFITool with a message like \"parseSection: GUID defined section can not be processed\". Double-clicking the message will show you the volume it belongs to. In the BIOS region, you will replace the corrupted volume and all the preceding ones with healthy volumes extracted from the downloaded BIOS image. This type of minimal replacement is needed instead of replacing every volume, because UEFITool is not yet smart enough to preserve all the required Boot Guard data. UEFITool_NE (New Engine) is able to display the Boot Guard keys and signatures, but, as of the writing of this, is not yet able to do volume replacing. It is probably a good idea to use the NE version to do the extraction.\n1. Open the FL1 file in UEFITool NE\n1. Do Right-click - Extract as is... or Ctrl-E for each of the needed volumes (save them with names that preserve the order they appear in)\n1. Open the corrupted BIOS in UEFITool (old engine version) and do Right-click - Replace as is... or Ctrl-R for the respective volumes\n1. File - Save image file... under some different name\n1. Flash the healed image back into the chip\n\n```\n$ geteltorito.pl -o n1vur04w.img n1vur04w.iso\n```\n\n```\n# losetup -P /dev/loop0 n1vur04w.img\n```\n\n```\n# mount /dev/loop0p1 /mnt\n```\n\n```\n# umount /mnt\n# losetup -d /dev/loop0\n```\n\nIf you find your bootloader is gone, install it using a live USB.\n\n"
    },
    {
      "title": "Bumblebee",
      "level": 3,
      "content": "Until bbswitch is updated to support the new power management method, add pcie_port_pm=off to your kernel parameters.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 3,
      "content": "If you have a very weak Bluetooth signal when using Wi-Fi, make sure you have a recent linux-firmware. See https://bugs.launchpad.net/ubuntu/+source/linux/+bug/1721271 for more information.\n\n"
    }
  ]
}