{
  "title": "Lenovo ThinkPad X1 Extreme (Gen 5)",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_X1_Extreme_(Gen_5)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad | 04f3:320d | Yes\nGPU (Intel) | 8086:46a6 | Yes\nGPU (NVIDIA) | 10de:25a0 | Yes\nWebcam | 04f2:b74f | Yes\nBluetooth | 8087:0033 | Yes\nSD-card reader | 10ec:5261 | Yes\nAudio | 8086:51c8 | Yes\nWireless | 8086:51f0 | Yes\nFingerprint reader | 27c6:6594 | Yes\n\nTo ensure you have this version, install the package dmidecode and run:\n\n```\n# dmidecode -s system-version\n```\n\n```\nThinkPad X1 Extreme Gen 5\n```\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "This laptop requires Sound Open Firmware in order for the soundcard to work.\n\n"
    },
    {
      "title": "Fingerprint Sensor",
      "level": 2,
      "content": "Works fine, the packages fprintd and libfprint are required.\n\n"
    },
    {
      "title": "Suspend",
      "level": 2,
      "content": "Often, suspending the laptop won't work at all, or the fans might keep spinning. Here are fixes that seem to work so far:\n\nUnder System Firmware >0.1.12, and with a Linux Kernel >6.1, the problem seems fixed by using the sleep state Windows and Linux (Config > Power > Sleep state, and set to Windows and Linux), and disabling Tile in the UEFI settings (Security > I/O > Tile). The Thunderbolt 4 ports can be used without issue.\n\nIf you run an older kernel and/or firmware, you need to disable the Thunderbolt 4 in BIOS in order to get suspend work, go to the BIOS under Security > I/O Port Access and disable the Thunderbolt 4 also go to Config > Power > Sleep state, and set to Linux S3.\n\nAlso some thread about this issue on Lenovo forums.\n\n"
    },
    {
      "title": "Video",
      "level": 2,
      "content": "Generally work fine with PRIME GPU offloading, however seems the external displays through display port only are detected under X11.\n\n"
    },
    {
      "title": "KMS",
      "level": 3,
      "content": "If you use the closed source NVIDIA driver, see NVIDIA#Early loading.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "BIOS and firmware updates are available via fwupd, the Lenovo Vantage application on Windows, or from Lenovo's website.\n\nThe latest BIOS version is highly recommended. All information on this page should assume the latest BIOS unless explicitly stated otherwise.\n\n"
    },
    {
      "title": "Check BIOS version",
      "level": 3,
      "content": "From Lenovo's firmware readme, to check the system's installed BIOS version:\n\n```\nDETERMINING WHICH VERSION IS INSTALLED\n\n [Checking on ThinkPad Setup]\n\n  1. Turn on the computer.\n  2. While the \"To interrupt normal startup, press Enter\" message is displayed\n     at the lower-left area or lower-center of the screen, press the F1 key.\n     The ThinkPad Setup menu will be displayed. If a password prompt appears,\n     type the correct password.\n  3. Locate the UEFI BIOS Version line.\n     \"UEFI BIOS version (BIOS ID)\" will be shown on the UEFI BIOS Version line.\n  4. Turn off the computer.\n```\n\nAlternatively, use fwupdmgr from fwupd without rebooting:\n\n```\n$ fwupdmgr get-devices\n```\n\n```\n...\n├─System Firmware:\n│     Current version:     0.1.8\n...\n```\n\n"
    },
    {
      "title": "Updating",
      "level": 4,
      "content": "Download the zip file labelled \"BIOS Update Utility (Linux)\" from Lenovo's support website or fwupd.org directly. Extract the zip file, then use fwupd to update the firmware:\n\n```\n$ su\n # fwupdmgr install <filename>.cab\n```\n\nThen reboot immediately to finish the upgrade.\n\n"
    },
    {
      "title": "Reverting to previous versions",
      "level": 4,
      "content": "To downgrade your bios, you can use the --allow-older flag with fwupd.\n\n"
    }
  ]
}