{
  "title": "Lenovo ThinkPad X200S",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_X200S",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nAudio | 8086:293e | Yes\nBluetooth |  | Yes\nEthernet | 8086:10f5 | Yes\nFingerprint reader |  | Untested\nGPU | 8086:2a43 | Yes\nKeyboard |  | Yes\nSD-card reader |  | Yes\nTouchpad |  | Yes\nTPM |  | Untested\nTrackpoint |  | Yes\nWebcam | 17ef:480c | Yes\nWi-Fi | 8086:4236 | Yes\n8086:4237 | Yes\n\n"
    },
    {
      "title": "BIOS card whitelist removal",
      "level": 3,
      "content": "Like most ThinkPads, the X200(s) / X200T has an FCC enforced whitelist[dead link 2021-11-13 ⓘ] for wireless cards. This means if a third party wireless card is installed via Mini PCIe or PCMCIA slot, the system will not boot. However, there are many individuals who modify and distribute whitelist-free BIOS updates online.\n\nThe whitelist-free BIOS for the X200(s) can be found here and the whitelist-free BIOS for the X200T can be found here.\n\nMake sure the BIOS version the system is running matches the cracked version being distributed.\n\nFor more information about BIOS flashing and system firmware, please see Flashing BIOS from Linux.\n\n"
    },
    {
      "title": "Coreboot / Libreboot",
      "level": 3,
      "content": "Coreboot is a fast and flexible open source firmware solution to replace the system BIOS. The ThinkPad X200 is fully supported by Coreboot and good documentation can be found at the Libreboot project's official website. The X200s and X200 Tablet are also partially supported per the Libreboot X200 documentation.\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 2,
      "content": "Install fprint. Support depends on the model variant.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nFn | Yes | No | XF86WakeUp\nFn+PrintScreen | Yes | Yes | Alt+Sys_Req\nFn+ScrollLock | No | Yes | Toggle the function of the numeric keys3\nFn+Pause | Yes | Yes | Ctrl+Break\nFn+Home | Yes | Yes | XF86MonBrightnessUp\nFn+PageUp | No | Yes | Toggles the ThinkLight on T-series laptops.\nFn+End | Yes | Yes | XF86MonBrightnessDown\nFn+F2 | Yes | Yes | XF86ScreenSaver\nFn+F3 | Yes | Yes | XF86Battery\nFn+F4 | Yes | Yes | XF86Sleep\nFn+F5 | Yes | Yes | XF86WLAN\nFn+F6 | Yes | No4 | XF86WebCam\nFn+F7 | Yes | Yes | XF86Display\nFn+F8 | Yes | Yes | XF86TouchpadToggle\nFn+F9 | No | Yes | (On Microsoft Windows) open the ThinkPad EasyEject Utility screen.\nFn+F12 | Yes | Yes | XF86Suspend\nFn+Space | No | Yes | (On Microsoft Windows) enable the FullScreen Magnifier function.\nFn+Up | Yes | Yes | XF86AudioStop\nFn+Left | Yes | Yes | XF86AudioPrev\nFn+Down | Yes | Yes | XF86AudioPlay\nFn+Right | Yes | Yes | XF86AudioNext\n\n1. The key is visible to xev and similar tools\n1. The physical key has a symbol on it, which describes its function\n1. The number lock works and is handled in firmware. This is opaque to the software and NmLk itself is not visible to xev. This is not the same as the number lock found on most keyboards, where the number lock key is visible to software, but keys pressed with the number lock toggled will have the keysym of a keypad key (7 versus KP_7).\n1. Unmarked but documented in the hardware maintenance manual.\n\n"
    },
    {
      "title": "Mute button",
      "level": 3,
      "content": "If the mute button on the keyboard is not working, then be sure to add acpi_osi=\"Linux\" to the kernel parameters.\n\n"
    },
    {
      "title": "Tablet buttons",
      "level": 3,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nButton 1 | Yes | Yes | XF86TaskPane\nButton 2 | No | Yes | Possibly changes screen rotation.\nButton 3 | No | Yes | Possibly opens a menu.\nButton 4 | Yes | Yes | XF86ScreenSaver\n\n1. The key is visible to xev and similar tools\n1. The physical key has a symbol on it, which describes its function\n\n"
    },
    {
      "title": "Screen rotation",
      "level": 4,
      "content": "The screen rotation hardware button does not work by default. The button must first be assigned to a free keycode. Then it can then be utilized with a script similar to the ones below.\n\nKeycodes can be bound to the execution of scripts in many desktop environments' settings. Environment-independent X applications also exist such as xbindkeys and sxhkd.\n\nBesides manually switching between vertical and horizontal orientation you probably also want sway to automatically flip the screen upside down when you fold the device into tablet mode. Add this to your sway configuration file:\n\n```\n~/.config/sway/config\n```\n\n```\n# Screen Rotation\n\n#    First bind the input to rotate the stylus' input\n#     when the display's output is rotated.\ninput 1386:147:Wacom_Serial_Penabled_1FG_Touchscreen_Pen map_to_output LVDS-1  \n\n# These 2 lines rotate the screen when you enter \"tablet mode\"\nbindswitch tablet:on exec sway output LVDS-1 transform 180                 \nbindswitch tablet:off exec sway output LVDS-1 transform 0\n```\n\n```\n/usr/local/bin/sway_screen_rotation.sh\n```\n\n```\n#!/bin/sh\n# If it's in horizontal mode, switch to vertical\n#   and wise versa. \n# \"90\" refers to the angle of rotation, so 270 is also a valid option,\n#    that depends on your own preference.\nif swaymsg -t get_outputs | grep transform | grep 180; then\n\tsway output LVDS-1 transform 90\nelse \n\tsway output LVDS-1 transform 180\nfi\n```\n\n```\n/usr/local/bin/screen_rotation.sh\n```\n\n```\n#!/bin/sh\n\n# Find the line in \"xrandr -q --verbose\" output that contains current screen orientation and \"strip\" out current orientation.\nrotation=\"$(xrandr -q --verbose | grep 'connected' | grep -Eo  '\\) (normal|left|inverted|right) \\(' | grep -Eo '(normal|left|inverted|right)')\"\n\n# Using current screen orientation proceed to rotate screen and input tools.\ncase \"$rotation\" in\n    normal)\n    # rotate to the left\n    xrandr -o left\n    xsetwacom set \"Serial Wacom Tablet WACf004 stylus\" rotate ccw\n    xsetwacom set \"Serial Wacom Tablet WACf004 eraser\" rotate ccw\n    ;;\n    left)\n    # rotate to normal\n    xrandr -o normal\n    xsetwacom set \"Serial Wacom Tablet WACf004 stylus\" rotate none\n    xsetwacom set \"Serial Wacom Tablet WACf004 eraser\" rotate none\n    ;;\nesac\n```\n\n"
    },
    {
      "title": "Hard disk shock protection",
      "level": 2,
      "content": "The ThinkPad X200 comes with an integrated 2-axis accelerometer providing the possibility of parking the hard drive's disk heads preventing from data loss due to heavy shocks. See HDAPS for details. It may be necessary to set correct invert parameter.\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "To set up an efficient power saving environment, install the tlp package. A detailed guide how to implement a simplistic power saving environment based upon TLP can be found here.\n\nFan-control software can be used to further reduce power consumption.\n\nInvestigate Powertop and the powerstat-gitAUR package from AUR for more information on measuring actual power consumption.\n\nSee Power saving for additional tips.\n\n"
    },
    {
      "title": "Loading the correct ICC colour profile",
      "level": 3,
      "content": "Download x200.icc and move it to ~/.color/icc. Load the profile with xcalib as follows:\n\n```\n$ /usr/bin/xcalib -d :0 ~/.color/icc/x200.icc\n```\n\n"
    },
    {
      "title": "Calibrating the digitizer",
      "level": 3,
      "content": "If the stylus happens to be working very imprecisely, the screen may be in need of calibration. Installing xinput_calibratorAUR and running the following command will begin the calibration process.\n\n```\n# xinput_calibrator --device \"Serial Wacom Tablet WACf004 stylus\"\n```\n\nTo save the calibration settings, create a config file at /etc/X11/xorg.conf.d/99-calibration.conf with the settings provided by xinput_calibrator.\n\n"
    },
    {
      "title": "Wireless internet",
      "level": 2,
      "content": "The Thinkpad X200 and X200 Tablet can have any of the following wireless cards supplied by the factory:\n\n- Condor Peak 1x2 HMC WIFI\n- EchoPeak 1X2 HMC RUSSIA SKU (WiMAX/WIFI5150) for Russia\n- Intel Centrino Wireless-N 1000, Advanced-N 6200, Advanced-N + WiMAx 6250, Ultimate-N 6300\n- Intel WiFi Link 5100, 5300\n- Intel WiMAX/WiFi Link 5150, 5350\n- ThinkPad 11b/g/n Wireless LAN Mini-PCI Express Adapter II, III\n\nAll of which are supported by linux-firmware.\n\nIf connectivity problems such as a slow connection or aborts are experienced, especially when connected to a WPA2 Enterprise network, then try to load the iwlwifi module with the options 11n_disable=1, 11n_disable=2, swcrypto=1, bt_coex_active=0. There is no clear recommendation which of these options to be used as for some users 11n_disable=1 already solves the problem sufficiently, for others bt_coex_active=0. See Wireless network configuration#iwlwifi for more detailed instructions.\n\n"
    },
    {
      "title": "Libreboot uneven backlight brightness problem",
      "level": 3,
      "content": "In some CCFL display panel libreboot fails to detect the correct PWM brightness value resulting in uneven backlight (summary). To fix this, you need to flash libreboot version 20210522 or newer (download) (warning libreboot 20210522 has a grub font & restart bug, altough shutdown is okay).\n\n"
    },
    {
      "title": "Failed to execute '/usr/sbin/inputattach'",
      "level": 3,
      "content": "If you see the above error in your logs, copy /usr/lib/udev/rules.d/70-wacom.rules to /etc/udev/rules.d/70-wacom.rules and comment out SUBSYSTEM of inputattach.\n\n"
    },
    {
      "title": "System feels unresponsive",
      "level": 3,
      "content": "If your system feels unresponsive and lagging, you can try creating a file called /etc/modprobe.d/drm_kms.conf:\n\n```\noptions drm_kms_helper poll=N\n```\n\n"
    },
    {
      "title": "Backlight fails to activate after system resume",
      "level": 3,
      "content": "On rare occasions the backlight may not activate after resuming. See Problem with display remaining black after resume for possible workarounds.\n\n"
    },
    {
      "title": "PM device: Resume from hibernation error: Failed to restore -19",
      "level": 3,
      "content": "This is likely to be related to the tpm_tis and tpm modules not being properly unloaded before hibernation. These modules are required by the device listed in the error as 00:0a:\n\n```\n# dmesg | grep 00:0a\n[    0.377877] pnp 00:0a: Plug and Play ACPI device, IDs PNP0c31 (active)\n[   10.746742] tpm_tis 00:0a: 1.2 TPM (device-id 0x1020, rev-id 6)\n[   10.746751] tpm_tis 00:0a: Intel iTPM workaround enabled\n[   10.866734] tpm_tis 00:0a: TPM is disabled/deactivated (0x6)\n```\n\nTo unload the module create the following executable file called /usr/lib/systemd/system-sleep/tpm.sh, assuming the use of the systemd hibernation procedure:\n\n```\n#!/bin/sh\ncase $1/$2 in\n  pre/*)\n    echo \"Going to $2...\"\n    modprobe -r tpm\n    modprobe -r tpm_tis\n    ;;\n  post/*)\n    echo \"Waking up from $2...\"\n    modprobe tpm\n    modprobe tpm_tis\n    ;;\nesac\n```\n\n"
    },
    {
      "title": "mei_me 0000:00:03.0: suspend",
      "level": 3,
      "content": "If you are seeing this error, a workaround is to blacklist the mei and mei_me modules. More information can be found here.\n\n"
    },
    {
      "title": "pciehp 0000:00:1c.1:pcie04: Cannot add device at 0000:03:00",
      "level": 3,
      "content": "See #mei_me 0000:00:03.0: suspend.\n\n"
    },
    {
      "title": "Uhhuh. NMI received for unknown reason 30.",
      "level": 3,
      "content": "The Thinkpad X200 is known to report the following error on resume from hibernation or suspension:\n\n```\nUhhuh. NMI received for unknown reason 30.\nDazed and confused, but trying to continue\nDo you have a strange power saving mode enabled?\n```\n\nIn this case you can disable the high precision event timer (HPET) by adding \"nohpet\" to your GRUB kernel parameter line.\n\n"
    },
    {
      "title": "High pitched noises",
      "level": 3,
      "content": "The X200(s) is prone to high pitched, low volume noises originating from the CPU, usually in low power scenarios. One proved solution to this is to disable CPU power control in the BIOS.\n\nHigh pitched noises may also be emitted from the display's inverter board on CCFL models. This is normal behavior and may or may not be present depending on how much energy the installed display draws.\n\nFor more information see [1].\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Thinkpad X200, X200s, X200si, X201, X201i, and X201s Hardware Maintenance Manual (12th ed)\n- ThinkPad X200 Tablet and X201 Tablet Hardware Maintenance Manual (5th ed)\n- Linux Hardware Database: Thinkpad X200 (All)\n- Linux Hardware Database: Thinkpad X200 Tablet (All)\n- Thinkwiki: X200 Overview\n- Thinkwiki: X200 Tablet Overview\n- ThinkWiki: How to reduce power consumption\n- Trinity.moe: Thinkpad X200 Tablet\n\n"
    }
  ]
}