{
  "title": "Lenovo ThinkPad X1 Carbon (Gen 6)",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_X1_Carbon_(Gen_6)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU | 8086:5917 | Yes\nWireless | 8086:24fd | Yes\nEthernet | 8086:15d7 | Yes\nMobile broadband |  | Yes\nAudio | 8086:9d71 | Yes\nTouchpad |  | Yes\nTrackPoint |  | Yes\nWebcam | 13d3:56b2 | Yes\nFingerprint Reader | 06cb:009a | Yes\nBluetooth | 8087:0a2b | Yes\nNFC |  | No\nmicroSD card reader | 0bda:0328 | Yes\nThunderbolt |  | Yes\n\nThe Lenovo ThinkPad X1 Carbon, 6th generation is an ultrabook introduced in early 2018. It comes in several variants(20KH* and 20KG*) and features a 14\" screen, 8th-gen Intel Core processors and integrated Intel UHD 620 graphics.\n\nTo ensure you have this version, install the package dmidecode and run:\n\n```\n# dmidecode -s system-version\n```\n\n```\nThinkPad X1 Carbon 6th\n```\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "The most convenient way to install Arch Linux is by disabling \"Secure Boot\" Security -> Secure Boot - Set to \"Disabled\". However it is possible to self-sign your kernel and boot with it enabled. For further information, have a look at the Secure Boot article.\n\nIn case your efivars are not properly set it is most likely due to you not being booted into UEFI. Should the problem persist be sure to consult the UEFI#UEFI variables section.\n\n"
    },
    {
      "title": "Automatic (Linux Vendor Firmware Service)",
      "level": 4,
      "content": "In August of 2018 Lenovo has joined the Linux Vendor Firmware Service(LVFS) project, which enables firmware updates from within the OS. BIOS updates (and other firmware such as the Thunderbolt controller) can be queried for and installed through fwupd.\n\n"
    },
    {
      "title": "Manual (fwupdmgr)",
      "level": 4,
      "content": "Lenovo provides a cabinet file that can be directly installed with fwupdmgr. Take the most recent .cab file from the Lenovo ThinkPad X1 Carbon (Gen 6) driver website.\n\n1. Make sure the AC adapter is firmly connected to the target computer.\n1. Launch Terminal.\n1. Move to the directory where the cabinet file was placed.\n1. Run fwupdmgr install xxxxxxxx.cab to schedule firmware update.\n1. Restart the system.\n1. The computer will be restarted and the UEFI BIOS will be updated.\n\n"
    },
    {
      "title": "Manual (El Torito)",
      "level": 4,
      "content": "Download the latest BIOS update ISO. Obtain geteltoritoAUR and run geteltorito.pl -o bios-update.img n23ur12w.iso on the downloaded ISO file to create a valid El Torito image file, then flash this file on a USB drive via dd like you would flash Arch installation media. For further information see flashing BIOS from Linux.\n\nThe ThinkPad X1 Carbon supports setting a custom splash image at the earliest boot stage (instead of the red \"Lenovo\" logo), more information can be found in the README.TXT located in the FLASH folder of the update image. This only needs to be done once, as subsequent UEFI upgrades will ask whether you wish to keep your custom logo.\n\nOnce the USB drive is flashed, the logo file can be placed in to the root directory of the flash drive.\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 2,
      "content": "The python-validity driver available via AUR allows to use the fingerprint reader as usual using fprintd.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "See this blog post for improvements to reliability.\n\n"
    },
    {
      "title": "IR Camera",
      "level": 2,
      "content": "See Howdy for logging in with the IR camera. The frame_width and frame_height must be set to 400 for the IR emitters to turn on.\n\n"
    },
    {
      "title": "NFC",
      "level": 2,
      "content": "Connected via I2C, support was discussed in the libnfc project.\n\n"
    },
    {
      "title": "Battery Stats and Charge Limit",
      "level": 2,
      "content": "Install the tlp package and show battery stats from command line:\n\n```\n# tlp-stat -b\n```\n\nTo prolong battery lifetime, you can limit battery charging to a maximum of 80% and start charging only if SoC (state of charge) is below 79%:\n\n```\n# tpacpi-bat -s ST 1 79 # Start charging if battery below 79%\n# tpacpi-bat -s SP 1 80 # Stop charging if battery above 80%\n# tpacpi-bat -s IC 1 0 # Disable charging entirely\n```\n\nFor making the changes permanent, you can edit /etc/tlp.conf. Please refer to the TLP article for more information and GUI tools.\n\n"
    },
    {
      "title": "Suspend",
      "level": 2,
      "content": "Since BIOS version 1.30, the X1 Carbon supports S3 mode when enabled in the BIOS menu (choose \"Linux\" sleep mode instead of the default \"Windows 10\"). See #Automatic (Linux Vendor Firmware Service) for instructions to update and verify your BIOS version.\n\n"
    },
    {
      "title": "Enabling S3",
      "level": 3,
      "content": "To enable S3 support, make sure you have at least BIOS version 1.30 installed. Then, go into the BIOS configuration, and Config > Power > Sleep State and set it to Linux. This should make S3 available.\n\nReboot and verify whether deep sleep is available, as explained in Power management/Suspend and hibernate#Changing suspend method.\n\n"
    },
    {
      "title": "S3 Suspend Bug with Bluetooth Devices",
      "level": 3,
      "content": "Occasionally your Thinkpad will wake up immediately or a few seconds after suspending with certain Bluetooth devices added. To prevent this, remove the devices or disable Bluetooth before suspending.\n\n"
    },
    {
      "title": "Disabling the memory card reader",
      "level": 3,
      "content": "You might also need to disable the Realtek memory card reader (which appears to use a constant 2-3 W) either via the BIOS or via\n\n```\n# printf 2-3 > /sys/bus/usb/drivers/usb/unbind\n```\n\n"
    },
    {
      "title": "BIOS configurations",
      "level": 3,
      "content": "In Config > Thunderbolt BIOS Assist Mode set to Enabled. When disabled, on Linux, power usage appears to be significantly higher because of a substantial number of CPU wakeups during s2idle.\n\n"
    },
    {
      "title": "Suspend fails",
      "level": 3,
      "content": "If the machine starts entering suspend but comes back online immediately when anything is plugged through USB-C, showing the following errors:\n\n```\n# journalctl -p err -u systemd-suspend\n```\n\n```\nFailed to suspend system. System resumed again: Device or resource busy\n```\n\n```\n# dmesg -Tl err\n```\n\n```\n[Mon Nov 11 20:18:03 2019] PM: pci_pm_suspend(): hcd_pci_suspend+0x0/0x30 returns -16\n[Mon Nov 11 20:18:03 2019] PM: dpm_run_callback(): pci_pm_suspend+0x0/0x130 returns -16\n[Mon Nov 11 20:18:03 2019] PM: Device 0000:00:14.0 failed to suspend async: error -16\n[Mon Nov 11 20:18:04 2019] PM: Some devices failed to suspend, or early wake event detected\n```\n\nBlock USB devices from waking up the computer.\n\nCheck that grep XHC /proc/acpi/wakeup shows enabled. If yes, disable XHC wakeup with:\n\n```\n# echo XHC > /proc/acpi/wakeup\n```\n\nOne you have verified this fixes the issue, create the following systemd unit file and enable the service.\n\n```\n[Unit]\nDescription=Fixes failing suspend by disabling wakeup through USB\n\n[Service]\nExecStart=/bin/bash -c 'grep --silent '^XHC.*disabled' /proc/acpi/wakeup || echo XHC > /proc/acpi/wakeup'\nType=oneshot\nRemainAfterExit=yes\n\n[Install]\nWantedBy=multi-user.target\n```\n\n"
    },
    {
      "title": "Power management/Throttling",
      "level": 2,
      "content": "Due to wrong configured power management registers the CPU may consume a lot less power than under Windows and the thermal throttling occurs at 80°C (97°C when using Windows, see T480s throttling bug).\n\nThere is a post in the official Lenovo forum to inform Lenovo about this issue.\n\n"
    },
    {
      "title": "Using thermald",
      "level": 3,
      "content": "A fix has reportedly been applied in thermald 2.4.3 according to this long running discussion. The aforementioned thread also contains links to the patch which was developed by Lenovo.\n\nAs of thermald 2.4.3 and Linux 5.12 it appears to be enough to just use thermald with no further workarounds.\n\n"
    },
    {
      "title": "Using throttled",
      "level": 3,
      "content": "Alternatively, a package has been written to address the problem until Lenovo completes the OS agnostic fix for the X1C6.\n\nInstall throttled, then start/enable throttled.service\n\nThe script also supports more advance thermal/performance features including CPU undervolting. See the repository README.md for details.\n\n"
    },
    {
      "title": "Microphone distorted due to automatic adjustment",
      "level": 3,
      "content": "If your microphone volume creeps up automatically and causes the sound to be distorted, you can fix it by disabling mic boost. See Pulse Audio for details.\n\n"
    },
    {
      "title": "Built-in speakers low volume",
      "level": 3,
      "content": "If your ThinkPad X1 Carbon (Gen 6) built-in speakers are limited to a maximum of about 20% volume even though the volume is set at 100%, try adding the following parameter to the snd_hda_intel module, which can be set through a file in /etc/modprobe.d/, e.g.:\n\n```\n/etc/modprobe.d/alsa-base.conf\n```\n\n```\noptions snd-hda-intel model=nofixup\n```\n\n"
    },
    {
      "title": "Mobile broadband",
      "level": 2,
      "content": "ThinkPad X1 Carbon (Gen 6) is exclusively shipped with a Fibocom L850-GL LTE WWAN modem, which is currently not supported out of the box under Linux.\n\nIt is normally impossible to swap the LTE modem for a supported one due to BIOS-level restrictions (\"whitelists\" of allowed M.2 expansion cards) implemented in all modern Lenovo laptops. However, a method has been found to configure any Sierra Wireless EM73xx/EM74xx modem to \"evade\" the whitelist checks, so these modems can be used normally.\n\nTake a look at ThinkPad mobile internet: Getting around BIOS-level whitelist restrictions for instructions.\n\nSee also the work done in github: Tools for the Fibocom L850-GL / Intel XMM7360 LTE modem, github: Kernel module for Fibocom L850-GL / Intel XMM7360 LTE modem and Lenovo Forums: WWAN Fibocom L850-GL and Linux support.\n\nSee also MBIM-Switch and kernel-module.\n\n"
    },
    {
      "title": "WWAN / LTE GUI",
      "level": 3,
      "content": "Install NetworkManager and network-manager-applet to make your life easier founding the correct APN for your SIM card.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "- Fn+4 sends XF86Sleep (puts computer to sleep by default)\n- Fn+S sends Alt_L+Sys_Req\n- Fn+P sends Pause\n- Fn+B sends Control_L+Break\n- Fn+K sends Scroll_Lock\n- Fn+Space toggles the keyboard backlight\n- The function key by itself sends XF86WakeUp (wakes computer from sleep by default)\n\n"
    },
    {
      "title": "Special buttons",
      "level": 3,
      "content": "See Laptop/Lenovo#Special buttons.\n\n"
    },
    {
      "title": "Disabling red LED in ThinkPad logo",
      "level": 3,
      "content": "To disable the red LED in the ThinkPad logo on the cover:\n\n1. Enable writing to the embedded controller registers by adding the kernel parameter ec_sys.write_support=1.\n1. Then, you can disable directly the LED with this command:\n\n```\n# printf '\\x0a' | dd of=/sys/kernel/debug/ec/ec0/io bs=1 seek=12 count=1 conv=notrunc 2> /dev/null\n```\n\nTo disable the LED at startup, you can create a systemd service:\n\n```\n/etc/systemd/system/led.service\n```\n\n```\nDescription=Disabling ThinkPad LED\n\n[Service]\nExecStart=sh -c \"printf '\\x0a' | dd of=/sys/kernel/debug/ec/ec0/io bs=1 seek=12 count=1 conv=notrunc 2> /dev/null\"\n\n[Install]\nWantedBy=multi-user.target\n```\n\nEnable/start led.service\n\n"
    },
    {
      "title": "Intel GPU firmware",
      "level": 3,
      "content": "On Wayland enabling GuC/HuC firmware loading can cause issues with the GPU hanging. These issues can be reflected by various crashes or freezes of graphical processes.\n\nIn dmesg the following can be observed:\n\n```\nkernel: [drm] GPU HANG: ecode 9:0:0x85dffffd, in chrome [18418], reason: hang on rcs0, action: reset\nkernel: [drm] GPU hangs can indicate a bug anywhere in the entire gfx stack, including userspace.\nkernel: [drm] Please file a _new_ bug report on bugs.freedesktop.org against DRI -> DRM/Intel\nkernel: [drm] drm/i915 developers can then reassign to the right component if it's not a kernel issue.\nkernel: [drm] The gpu crash dump is required to analyze gpu hangs, so please always attach it.\nkernel: [drm] GPU crash dump saved to /sys/class/drm/card0/error\nkernel: i915 0000:00:02.0: Resetting rcs0 for hang on rcs0\n```\n\nDo not enable GuC / HuC firmware loading, at least on Wayland. See https://bugs.freedesktop.org/show_bug.cgi?id=108717.\n\n"
    },
    {
      "title": "Screen tearing",
      "level": 3,
      "content": "See Intel graphics#Tearing.\n\n"
    },
    {
      "title": "HDR display color calibration",
      "level": 3,
      "content": "For models with the 1440p HDR display, the default color profile can be corrected under Gnome using an ICC calibration provided by notebookcheck.net's review.\n\n```\n$ wget https://www.notebookcheck.net/uploads/tx_nbc2/B140QAN02_0.icm\n$ colormgr import-profile B140QAN02_0.icm\n```\n\nThis will import the ICC profile, and next you will need to activate it for your display. Find your display's object path:\n\n```\n$ colormgr get-devices | sed -rn 's/Object Path:\\s*(.*eDP1.*)/\\1/p'\n```\n\nAnd your new color profile object path:\n\n```\n$ colormgr get-profiles | grep -4 -i B140QAN02\n```\n\nAnd finally activate the profile and set it as the default for this display:\n\n```\n$ colormgr device-add-profile <device object id> <profile object id>\n$ colormgr device-make-profile-default <device object id> <profile object id>\n```\n\nYou can verify the profile is active by running colormgr get-devices.\n\n"
    },
    {
      "title": "TrackPoint and Touchpad issues",
      "level": 2,
      "content": "Some models of the 6th generation X1 Carbon seem to have issues with the TrackPoint and Touchpad working at the same time.\n\nTo get the TrackPoint and Touchpad to work at the same time, add synaptics_intertouch=1 to the psmouse kernel module options:\n\n```\n/etc/modprobe.d/psmouse.conf\n```\n\n```\noptions psmouse synaptics_intertouch=1\n```\n\nWhen using TLP with default power saving settings, there might be occasional hiccups such as dropouts of tap-to-click functionality for the Touchpad, as well as the TrackPoint not surviving suspends and needing to be re-initialized.\n\nReconnecting a dead trackpad can be done via the following command:\n\n```\n# printf none > /sys/bus/serio/devices/serio1/drvctl\n# printf reconnect > /sys/bus/serio/devices/serio1/drvctl\n```\n\n"
    },
    {
      "title": "Plugable USB-C Mini Docking Station with 85W Power Delivery UD-CAM",
      "level": 3,
      "content": "If you are using an external plugable UD-CAM thunderbolt dock connected to the laptop through its USB-C thunderbolt port, you might experience random disconnections (external monitor, bluetooth and ethernet) with this kind of error in dmesg :\n\n```\npcieport 0000:05:00.0: BAR 13: no space for [io  size 0x3000]\n```\n\nIt should be noted that bolt is not working with this UD-CAM dock.\n\nTo avoid random disconnection, proceed as followed by editing the bios and TLP\n\n"
    },
    {
      "title": "Bios settings",
      "level": 4,
      "content": "You should then look at your bios settings :\n\n- Wake by thunderbolt : enable\n- Security level : no security\n- Pre-boot ACL option : enable\n\n"
    },
    {
      "title": "TLP blacklisting devices from USB autosuspend",
      "level": 4,
      "content": "If you are using TLP you have to edit /etc/tlp.conf and make sure that you exclude all dock devices from USB autosuspend as follow:\n\n```\nUSB_DENYLIST==\"0000:1111 2222:3333 4444:5555\"\n```\n\nThen reboot and your dock should work correctly.\n\n"
    },
    {
      "title": "Lenovo dock",
      "level": 3,
      "content": "Some problems can be caused by outdated dock firmware. Updates are not supplied by LVFS, use \"Firmware for Windows\" from the dock support page.\n\n"
    },
    {
      "title": "DisplayLink",
      "level": 3,
      "content": "If you want to continue using the Intel graphics for your primary and HDMI displays, change its config file numerical prefix so that it precedes the DisplayLink configuration. For example, rather than naming it /etc/X11/xorg.conf.d/20-intel.conf instead name it /usr/share/X11/xorg.conf.d/19-intel.conf.\n\n"
    },
    {
      "title": "OPAL: Hardware based full-disk encryption",
      "level": 3,
      "content": "See Self-encrypting drives (Confirmed working)\n\n"
    },
    {
      "title": "NVMe disk failure",
      "level": 2,
      "content": "There is an issue with the NVMe disk installed in ThinkPad X1 Carbon (Gen 6) resulting in device failure. Be sure to update firmware or reach out to Lenovo support for replacement.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- T480s throttling bug, affects X1C6 as well\n- Lenovo forums: T480s low cTDP and trip temperature in Linux\n- Thread: TrackPoint/Touchpad issues, 20KG model\n- StackExchange: Success with enabling RMI4 config flags for Touchpad and TrackPoint\n- Kernel patch - Input: elantech - add support for SMBus devices\n- Kernel patch - Input: synaptics - add Lenovo 80 series ids to SMBus\n- https://www.thinkwiki.org/wiki/ThinkWiki\n- ThinkWiki X1 Carbon 6th Gen page\n- Benjamin Tissoires, kernel maintainer of peripherals, has explained how input bugs get fixed in his talk Tools to debug a broken input device (Slides), especially interesting are slides 16 onward.\n- Dell XPS 13 9370 quirks: Some pointers on getting Watt usage down to ~2W, Intel video powersaving features might be interesting, see also the Intel graphics page for interesting power-saving options.\n- Dell XPS 13 (9360): Shares some hardware with the X1C6\n- Intel Blog: Best practice to debug Linux* suspend/hibernate issues[dead link 2023-09-16 ⓘ], including the pm-graph tool to analyze power usage during suspend\n- A comprehensive example Arch install for the X1C6\n\n"
    }
  ]
}