{
  "title": "Lenovo ThinkPad T14s (AMD) Gen 1",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_T14s_(AMD)_Gen_1",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWireless |  | Yes\nAudio |  | Yes\nTrackPoint |  | Yes\nTouchpad |  | Yes\nWebcam | 13d3:5405 | Yes\nFingerprint reader | 06cb:00bd | Yes\nMobile broadband |  | Untested\nBluetooth | 8087:0029 | Yes\nSmartcard reader | 058f:9540 | Yes\n\nThis article covers the installation and configuration of Arch Linux on a Lenovo Thinkpad T14s (AMD) Gen 1 laptop. Almost everything seems to work pretty much out the box with linux≥5.8.0.\n\nFor a general overview of laptop-related articles and recommendations, see Laptop.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Updating the firmware using the fwupd utility works as long as all the relevant options are enabled in the BIOS (Enable Windows Update UEFI Update). A BIOS update Bootable CD ISO that is OS agnostic may be downloaded from https://pcsupport.lenovo.com/.\n\nThe UEFI BIOS can also be updated without using fwupd; see Flashing BIOS from Linux#Bootable optical disk emulation for more information (and heed the warning at the top of the article). A charged battery and AC power are required for a successful update. Avoid having any addons/docks plugged in when performing the BIOS update.\n\n"
    },
    {
      "title": "Secure boot",
      "level": 3,
      "content": "As of August 2021 deleting Secure Boot keys and installing your own keys (for example by using KeyTool) will brick the device. This is a problem that is similar to one which has been reported on some other Lenovo laptops and is likely due to a faulty firmware. If the device is stuck in a boot loop after replacing the Secure Boot keys, the only way to repair it is by replacing the mainboard of the device. Hopefully, the issue will get fixed with a firmware update in the future.\n\n"
    },
    {
      "title": "Fingerprint sensor",
      "level": 2,
      "content": "The fingerprint sensor works with some recent firmware and software updates.\n\n1. Use fwupd to install the latest firmware for \"Synaptics Prometheus Fingerprint Reader\". The update might have to be done manually as the released firmware is in testing; or you could enable the testing remote in fwupd to allow automated upgrade. The relevant firmwares are Prometheus Fingerprint Reader and Prometheus Fingerprint Reader Configuration.\n1. fprintd ≥ 1.90.1 and libfprint ≥ 1.90.1 are required.\n\nfprint has more details on how to setup the fingerprint, for PAM-based authentication for example.\n\nIf the fingerprint reader is not detected by fwupd but is detected by lsusb you will need to reset the fingerprint reader in the Bios.\n\n"
    },
    {
      "title": "Backlight",
      "level": 2,
      "content": "Backlight works correctly by manipulating the values, between 0-255, inside /sys/class/backlight/amdgpu_bl0/brightness or using a backlight managing utility.\n\n"
    },
    {
      "title": "Smartcard reader",
      "level": 2,
      "content": "Seems to work and read cards. Following instructions from smartcards.\n\n"
    },
    {
      "title": "Enabling S3 sleep",
      "level": 3,
      "content": "For Suspend to work as expected, in the UEFI setup, under Config > Power set the option Sleep State to Linux.\n\nReboot and verify whether deep sleep is available, as explained in Power management/Suspend and hibernate#Changing suspend method.\n\n"
    },
    {
      "title": "Mobile broadband",
      "level": 2,
      "content": "The only supported WWAN card is the Fibocom L850-GL, a PCIe card without any Linux drivers (and most probably never will get any, it is an Apple owned chipset now). All the existing WWAN workaround involve flashing a Sierra Wireless (Qualcomm) WWAN to escape the BIOS whitelist by enumerating slowly. This however does not work in the T14s, the card is entirely disabled and not even visible in lsusb. It is possible that the USB lanes are disabled on the M.2 port.\n\nThere exists an alpha-quality driver for the Fibocom L850-GL. The L860 is not proposed in the T14s AMD but is in the T14s Intel and a Linux mainline driver is being worked on by Lenovo for it. See Xmm7360-pci for more information.\n\n"
    },
    {
      "title": "Wireless",
      "level": 2,
      "content": "See Lenovo ThinkPad T14 (AMD) Gen 1#Wireless\n\n"
    },
    {
      "title": "Microphone",
      "level": 2,
      "content": "The microphone may not be operational. A possible fix is to blacklist the snd_pci_acp3x module (to allow newer kernels to use snd_rn_pci_acp3x?)\n\n"
    },
    {
      "title": "Webcam",
      "level": 2,
      "content": "If the webcam is missing after updating to kernel 5.13, install upd72020x-fwAUR (USB 3.0 chipset firmware).\n\n"
    },
    {
      "title": "Install videos",
      "level": 2,
      "content": "- T14s Arch video playlist\n\n"
    }
  ]
}