{
  "title": "Lenovo ThinkPad P1 (Gen 4)",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_P1_(Gen_4)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU (NVIDIA) |  | Yes\nGPU (Intel) |  | Yes\nWebcam |  | Yes\nBluetooth |  | Yes\nSD-card reader |  | Yes\nAudio |  | Yes\nWireless |  | Yes\nFingerprint reader |  | Yes\nTPM |  | Untested\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "The device supports fwupd.\n\n"
    },
    {
      "title": "OLED display",
      "level": 3,
      "content": "OLED screens have no backlight, brightness cannot be controlled by changing backlight power in the traditional way. Instead, it can be controlled using PWM by enabling following option:\n\n```\n/etc/modprobe.d/i915.conf\n```\n\n```\noptions i915 enable_dpcd_backlight=1\n```\n\nAlternatively, you can add i915.enable_dpcd_backlight=1 as a kernel parameter.\n\n"
    },
    {
      "title": "Hybrid graphics",
      "level": 4,
      "content": "Hybrid graphics (also known as NVIDIA Optimus) allow the system to use the integrated Intel graphics and the NVIDIA GPU interchangeably without rebooting.\n\nBrightness control under hybrid graphics should work \"out of the box\" with no kernel command line options necessary. If you notice brightness controls cease working, check that your BIOS settings are still for Hybrid Graphics and not Discrete Graphics.\n\n"
    },
    {
      "title": "Discrete graphics",
      "level": 4,
      "content": "Discrete graphics means only the NVIDIA GPU is available to the system.\n\nCurrently brightness control does not work with Discrete Graphics selected in BIOS.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "Install Sound Open Firmware to get audio working.\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "Some models can come with a powerful dGPU (Like a 3070 Max-Q) and this can drain the battery very rapidly consuming ~11Wh when using the nvidia-open driver and even if the NVIDIA dGPU is not being used in any process.\n\nTo solve this you can use EnvyControl to disable the NVIDIA dGPU temporally using the command:\n\n```\n# envycontrol -s integrated\n```\n\nThis will blacklist all the NVIDIA modules leaving the GPU powered off and unusable.\n\nTo re-enable the NVIDIA dGPU you can use:\n\n```\n# envycontrol -s hybrid\n```\n\n- This was not tested using the proprietary nvidia or nvidia-dkms packages.\n- For more power saving related tweaks, see Power management.\n\n"
    }
  ]
}