{
  "title": "Lenovo IdeaPad S205",
  "url": "https://wiki.archlinux.org/title/Lenovo_IdeaPad_S205",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU | 1002:9806 | Yes\nAudio | 1002:4383 | Yes\nEthernet | 10ec:8136 | Untested\nWi-Fi | 1814:3090 | Yes\nBluetooth | 0489:e00d | Untested\nWebcam | 04f2:b278 | Untested\nCard reader | 0bda:0139 | Untested\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "The IdeaPad uses a system firmware based on the SecureCore Tiano Platform. It supports UEFI and Legacy booting, but you cannot manually switch between them; which one is used depends whether the disk is partitioned as GPT or MBR. It does not have secure boot.\n\nThe firmware has many bugs. If anything related to it does not work, try loading setup defaults.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Follow the Installation guide until boot loader installation.\n\nYou can not use the GUID Partition Table and still boot using legacy BIOS. If your desired partition layout does not work for MBR you must use UEFI.\n\n"
    },
    {
      "title": "UEFI",
      "level": 3,
      "content": "While installing the boot loader, you might get the error:\n\n```\nFailed to create EFI Boot variable entry: No space left on device\n```\n\nThe firmware wants the .efi-file to be the UEFI default loader, see UEFI#UEFI boot loader does not show up in firmware menu.\n\n"
    },
    {
      "title": "Wi-Fi",
      "level": 2,
      "content": "If you are using UEFI, your device might show up as hard blocked. This is due to a bug in the firmware. You can fix it by doing the following things:\n\n1. Go into system firmware settings and reload factory defaults\n1. If Wi-Fi still does not work, change the boot order so that it boots from PXE (PCI LAN) before booting from Hard Drive.\n\n"
    }
  ]
}