{
  "title": "Lenovo ThinkPad Edge E430",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_Edge_E430",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nEthernet |  | Yes\nWi-Fi |  | Yes\nBluetooth |  | Yes\nAudio |  | Yes\nWebcam |  | Yes\nFingerprint reader | 147e:1002 | Yes\nCard Reader |  | Yes\n\nThe following is regarding the Lenovo Thinkpad Edge E430 with 3rd Generation Ivy Bridge Intel processor, released in mid 2012. The E430 is intended to be an affordable, yet still entirely capable business machine. This article is meant to suppliment the current Installation guide.\n\n"
    },
    {
      "title": "Ethernet",
      "level": 2,
      "content": "The Realtek RTL8111/8168B ethernet controller may be relatively unreliable with the r8169 module. Better Ethernet connectivity can be achieved with the r8168AUR module. See Network configuration/Ethernet#Realtek RTL8111/8168B for instructions.\n\n"
    },
    {
      "title": "Wireless",
      "level": 2,
      "content": "If the Thinkpad in question has the Thinkpad branded Wi-Fi adapter, it semi-works out of the box. There may be a delay preceding any attempted network activity, which can be resolved by disabling the power saving feature. The usual\n\n```\n# ip link interface power off\n```\n\nis not a feature of this particular card. Instead, the over aggressive power saving feature may be turned off upon loading the module on boot.\n\nThis may be achieved with the following kernel module parameter:\n\n```\nrtl8192ce.fwlps=0\n```\n\nThis will turn off the firmware lowpowerstate or fwlps.\n\nBecause Lenovo is one of a few companies that whitelist wireless cards, replacing/upgarding can be challenging, costly, or just downright impossible. To find what FRU (Field Replaceable Unit) this machine accepts, go to the Lenovo support site where you should be able to find the necessary documentation.\n\nIf you failed to realize that the wireless card was a horribly supported Realtek, and you are now kicking yourself because of the above mentioned whitelist, you do have an option to change it without ordering a Lenovo specific card. Some kind souls are willing to help others modify their BIOS' in various ways, one of which is removal of the whitelist. See thread[dead link 2021-05-13 ⓘ] where Serg008 was able to remove the whitelist for the E430. If you go this route, proceed with caution, as upgrading the BIOS (and messing up) can render your machine a brick. Also, there are legitimate warranty concerns with unauthorized BIOS modifications.\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 2,
      "content": "Typically with older hardware, one can get the fingerprint reader to function by using one of two open-source fingerprint reader projects. They are ThinkFinger and fprint. Alternatively, Ubuntu has put together a system that includes drivers included in these previous projects, as well as including proprietary drivers for the newest models. In typical Ubuntu fashion, it is gui driven and appropriately named fingerprint-guiAUR.\n\nThe fingerprint reader included on the newest generation of Thinkpad E430 is a Upek. To verify the model of the device in a given machine, one may use lsusb.\n\n"
    },
    {
      "title": "Trackpoint",
      "level": 2,
      "content": "See TrackPoint.\n\n"
    },
    {
      "title": "Fans",
      "level": 2,
      "content": "Thinkfan may be used to control the fan speed. This is probably not necessary as the BIOS seems to typically handle the fan speed just fine.\n\nThe thinkpad_acpi kernel module needs to be configured so user space programs can control the fan speed.\n\n```\n/etc/modprobe.d/modprobe.conf\n```\n\n```\noptions thinkpad_acpi fan_control=1\n```\n\nThe thinkfan configuration file also needs to know how to set the fan speed. Replace the default sensor settings with the following.\n\n```\n/etc/thinkfan.conf\n```\n\n```\nsensor /sys/devices/platform/coretemp.0/temp1_input\n```\n\nDirect fan control can be achieved by using \"echo\" to apply the desired level. Set the speed as shown in the following examples:\n\n```\n# echo engage > /proc/acpi/ibm/fan\n# echo level auto > /proc/acpi/ibm/fan\n# echo level 1 > /proc/etc/ibm/fan\n```\n\nOnce thinkpad_acpi has been loaded with fan_control=1, available settings can be displayed like so:\n\n```\n$ cat /proc/acpi/ibm/fan\n```\n\n"
    }
  ]
}