{
  "title": "ListaContato",
  "url": "https://wiki.archlinux.org/title/ListaContato",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Help:Estilo\n- ArchWiki:Requests\n- ArchWiki:Contribuindo\n- Help:Procedimentos\n\nA Equipe de Manutenção (Maintenance Team) é o grupo oficial do ArchWiki de usuários cujo objetivo é supervisionar e corrigir as edições que são feitas todo dia aos artigos no wiki.\n\n"
    },
    {
      "title": "Membros",
      "level": 2,
      "content": "Os mantenedores pertencem a um grupo particular de usuários wiki com privilégios especiais. Administradores e burocratas são mantenedores com níveis de acesso mais alto, veja ArchWiki:Níveis de acesso e papéis.\n\nTodos os membros da equipe de manutenção fornecem maneiras de contatá-los, se desejar. No entanto, prefira usar a aba de discussão acima de cada página para comentários específicos da página.\n\nUse ArchWiki talk:Maintenance Team para observações genéricas ou se precisar de ajuda da equipe de manutenção, ou para discutir organização, convenções, etc. Para entrar em contato com os administradores do ArchWiki em assuntos que não podem ser discutidos publicamente (por exemplo, sobre questões sobre contas de usuário), envie um e-mail da interface do wiki para todos os administradores do wiki usando Special:EmailUser/WikiSysop (este método permite fazer suposições razoáveis sobre o link entre o nome de usuário e o endereço de e-mail).\n\n"
    },
    {
      "title": "Mantenedores ativos",
      "level": 3,
      "content": "Acesse ArchWiki:Maintenance Team#Active maintainers para a relação de membros ativos da equipe de manutenção.\n\n"
    },
    {
      "title": "Mantenedores inativos",
      "level": 3,
      "content": "Acesse ArchWiki:Maintenance Team#Inactive maintainers para ver a relação de mantenedores que estão atualmente inativos (menos de 10 edições nos últimos 30 dias).\n\n"
    },
    {
      "title": "Como se juntar",
      "level": 2,
      "content": "Os mantenedores oficiais são geralmente escolhidos pelos administradores entre os usuários mais ativos e colaborativos do wiki, e pessoalmente convidados a participar da equipe. Você também pode se apresentar explicitamente como candidato entrando em contato com um dos administradores.\n\nRequisitos comuns para se tornar um Mantenedor são:\n\n- Familiaridade com as diretrizes da comunidade e do wiki; vai colaborar e discutir com outros membros da equipe.\n- Algum tempo livre e comprometimento em contribuir com regularidade suficiente.\n- Paciência, precisão e qualidade.\n- Experiência em edição de wiki e um bom conhecimento da sintaxe wiki.\n- Bom conhecimento da estrutura do ArchWiki e suas regras de estilo.\n- Conhecimento suficiente do Arch Linux e os assuntos tratados nos artigos, ou vontade de fazer alguma pesquisa ou discutir com os autores das edições ao corrigir problemas relacionados ao conteúdo.\n\nSe você está interessado em se juntar à equipe, você pode começar se tornando visível para a comunidade ajudando com tarefas comuns, principalmente ajudando com patrulhamento e contribuindo para as discussões que ocorrem em várias páginas de discussão (talk).\n\nNovos membros são anunciados no ArchWiki:Novidades.\n\nUma vez eleitos, membros devem adicionar seus nomes de usuário à tabela em ArchWiki:Maintenance Team#Members e também adicionar um rótulo especial em sua página de usuário: [[ArchWiki:Maintainers|ArchWiki Maintainer]].\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Category:Maintenance - categorias de manutenção\n- Special:SpecialPages - páginas de manutenção\n- Wikipedia:Recent changes patrol\n\n"
    }
  ]
}