{
  "title": "Localization/Bengali",
  "url": "https://wiki.archlinux.org/title/Localization/Bengali",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Internationalization\n\nThis article describes how to set up a Wikipedia:Bengali language environment. It does not cover setting up Bengali/Bangla input on the console.\n\n"
    },
    {
      "title": "Fonts",
      "level": 2,
      "content": "- ttf-freebanglafontAUR - Font for Bangla\n- Avro Unicode Fonts & Lipighor free fonts - Install following Fonts#Manual installation\n\n"
    },
    {
      "title": "Locale",
      "level": 2,
      "content": "Open /etc/locale.gen with your favorite text editor. And then uncomment bn_BD.UTF-8 UTF-8 or bn_IN.UTF-8 UTF-8:\n\n```\n/etc/locale.gen\n```\n\n```\n...\n#bi_VU UTF-8\nbn_BD UTF-8\n#bn_IN UTF-8\n...\n```\n\nand then run locale-gen. For more information please read this article\n\n"
    },
    {
      "title": "Input methods",
      "level": 2,
      "content": "There are multiple open source input method engines available:\n\n- Avro supports phonetic input for Bangla in IBus via ibus-avro-gitAUR.\n- OpenBangla Keyboard supports Bangla phonetic (Avro phonetic), Probhat, Munir Optima layout for Bangla in IBus via openbangla-keyboardAUR.\n- ibus-m17nAUR provider for Unijoy, Inscript, Probhat, Disha and ITRANS\n\nSee IBus to set up the engines above.\n\nSee also Input method for a list of available input-method frameworks.\n\n"
    },
    {
      "title": "Broken fonts in Firefox",
      "level": 3,
      "content": "Some applications (like Firefox) and Desktop Environments will use ttf-font (ttf-dejavu, ttf-liberation, ttf-bitstream-vera, ttf-droid, gnu-free-fonts, noto-fonts, ttf-croscore, ttf-ibm-plex) by default. The gnu-free-fonts do not have full support for Bengali characters alignment. Consider using noto-fonts over ttf-dejavu or gnu-free-fonts as a ttf-font source.\n\n"
    },
    {
      "title": "No IBus Support in GNOME",
      "level": 3,
      "content": "The IBus preferences does not work with GNOME. Make sure to enable Avro/OpenBangla from gnome-control-center.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- ibus-avro\n- OpenBangla Keyboard\n\n"
    }
  ]
}