{
  "title": "LPRng",
  "url": "https://wiki.archlinux.org/title/LPRng",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From upstream:\n\n- Complete (no databases needed) lpr, lpc, and lprm programs\n- Dynamic redirection of print queues; automatic job holding\n- Highly verbose diagnostics\n- Multiple printers serving a single queue\n- Client programs do not need to run SUID root\n- Greatly enhanced security checks\n- Greatly improved permission and authorization mechanism\n\nLPRng is mature and stable and incorporates a flexible print filtering mechanism. It excels as a print server but can be used as a print client. It can also print from CUPS clients installed on other machines with minor hand configuration on the CUPS side.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the lprngAUR package.\n\nInstall optional filter packages:\n\n- poppler\n- Any one out of a2ps, enscript, mpageAUR\n- ghostscript\n- hplip\n- foomatic-filters-lprngAUR\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Configuration consists of the following steps:\n\n- Set up control files\n- Configure filters\n- Create a printcap file and spool directories\n- Enable and start the lpd daemon\n\n"
    },
    {
      "title": "Local configuration",
      "level": 4,
      "content": "Two control files must be configured:\n\n- /etc/lprng/lpd/lpd.conf\n- /etc/lprng/lpd/lpd.perms\n\n"
    },
    {
      "title": "Remote configuration",
      "level": 4,
      "content": "The default configurations in /usr/share/doc/lprng are adequate for a client computer printing to a remote printer. Copy these to /etc/lprng/lpd/\n\n```\n# cp /usr/share/doc/lprng /etc/lprng/lpd\n```\n\nand edit it.\n\n"
    },
    {
      "title": "Server configuration",
      "level": 4,
      "content": "For a server receiving requests across the Internet, uncomment the last line in /etc/lprng/lpd/lpd.conf and configure permissions as documented in the comments of /etc/lprng/lpd/lpd.perms.\n\n"
    },
    {
      "title": "Configure printer settings (filters)",
      "level": 3,
      "content": "It is fine if you just pick one of the following filter (settings) instructions. Just decide which way you want to go.\n\n"
    },
    {
      "title": "Postscript printers",
      "level": 4,
      "content": "If you have a network Postscript printer you are in luck. The sample postscript filter /usr/share/doc/lprng/psfilter converts PDF and text files to Postscript. Other file types are rejected.\n\nCopy this file to /usr/lib/lprng/lpd and rename it as desired. Then edit it to set your paper type and your choice of single-sided/double-sided printing.\n\nIf you wish to have separate single-sided and double-sided print queues, make two copies with different names and edit appropriately.\n\n"
    },
    {
      "title": "Foomatic system",
      "level": 4,
      "content": "Another mechanism for print filtering is via the Foomatic system. This system used by CUPS. Install foomatic-filters-lprngAUR as the foomatic-rip program in the CUPS installation has been modified to remove LPRng support).\n\nUse foofilter as described above, editing for your desired .ppd file. Install the .ppd file in conformance with the path specified in foofilter. (/etc/lprng/lpd is a good location.)\n\nTo use Hewlett Packard printers, install hplip from the main distribution. This package has .ppd files for virtually all Hewlett Packard printers.\n\n"
    },
    {
      "title": "Ghostscript drivers",
      "level": 4,
      "content": "If you have a printer that has a Ghostscript driver, copy and edit gsfilter as above to set the appropriate driver and the paper type. You can discover the drivers available in your version of Ghostscript by typing the command\n\n```\n$ gs -h\n```\n\nNote that support for various printer features is typically limited and out of date with this option.\n\n"
    },
    {
      "title": "Printcap file",
      "level": 3,
      "content": "The /etc/lprng/printcap file tells LPRng about the printers you have and the print filters that need to be used.\n\n"
    },
    {
      "title": "Examples",
      "level": 4,
      "content": "The printcap.sample file (in /usr/share/doc/lprng) provides a short tutorial as to how to set up a printcap file. The printcap fragments printcap_server and printcap_client in this directory provide additional information.\n\nAn example file may look like this for two local printers:\n\n```\nDCPJ4120DW:\\\n     :mx=0:\\\n     :sd=/var/spool/lpd/DCPJ4120DW:\\\n     :sh:\\\n     :lp=/dev/usb/lp1:\\\n     :if=/opt/brother/Printers/dcpj4120dw/lpd/filterdcpj4120dw:\nHL2035:\\\n     :mx=0:\\\n     :sd=/var/spool/lpd/HL2035:\\\n     :sh:\\\n     :lp=/dev/usb/lp0:\\\n     :if=/opt/brother/Printers/brhl2035/lpd/filterHL2030:\n```\n\n"
    },
    {
      "title": "Network printing advice",
      "level": 4,
      "content": "Generally, one computer should be designated as the server for one or more printers. Other client computers should send their print jobs to the server rather than the printer directly.\n\nThe rather non-obvious server setup in printcap_server is needed to make print filtering work on network printers, as opposed to printers attached directly to the server computer via, say, a USB port. (See the reference manual.)\n\nAfter creating the printcap file, run the command as root\n\n```\n$ /usr/bin/checkpc -f\n```\n\nThis will check your configuration and create spool directories in /var/spool/lpd. If checkpc complains about something, address the issue and rerun.\n\n"
    },
    {
      "title": "Start the lpd daemon",
      "level": 3,
      "content": "LPRng runs a daemon in background called lpd to manage print requests. Start/enable lpd.service.\n\nIf any configuration files are changed, one must restart lpd.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "The lpr command is the printing tool in LPRng. The general form of use is\n\n```\n$ lpr [options] file_to_be_printed\n```\n\nIf no file is specified, input is accepted on the standard input. The most useful options are -P printer and -K number_of_copies. In the absence of the printer option, setting the environment variable PRINTER to the name of the printer will tell LPRng which printer to use.\n\nOther useful commands are lpq (examine the print queue) and lprm (remove a print job from the queue). See lpr(1), lpq(1), and lprm(1).\n\n"
    },
    {
      "title": "CUPS and LPRng",
      "level": 2,
      "content": "CUPS may be used to access a printer on a server from a client machine on which LPRng is not installed. The trick is to configure CUPS to access the printer via the lpd protocol. This is easy to do using the web interface to CUPS. Also, since the server as set up here does all necessary print filtering, tell CUPS to use the raw filter. Alternative divisions between filtering responsibilities can be devised, depending on your needs.\n\n"
    },
    {
      "title": "Printer specific instrcutions",
      "level": 3,
      "content": "Despite its title, some of the information at CUPS/Printer-specific problems is not Cups specific.\n\n"
    },
    {
      "title": "GTK2",
      "level": 3,
      "content": "GTK2 applications still support lpr printing. To make this work, create the file ~/.gtkrc-2.0 in your home directory containing a single line\n\n```\ngtk-print-backends = \"file,lpr\"\n```\n\n"
    },
    {
      "title": "LXDE",
      "level": 3,
      "content": "LXDE may create its own ~/.gtkrc-2.0 file if the look and feel of the desktop are altered — look in this file for instructions as to how to proceed.\n\n"
    },
    {
      "title": "Postscript printing",
      "level": 3,
      "content": "The filter pdftops from the poppler package is used to create Postscript from PDF files in the print filters.\n\nOccasionally, pdftops produces bad or no output. An alternative filter, pdf2ps from the ghostscript package, can be substituted, but this filter has its own problems.\n\nFor a one-shot case, just use pdf2ps or some other converter to produce Postscript and send that to the printer.\n\n"
    },
    {
      "title": "Double-Sided PS",
      "level": 4,
      "content": "Double-sided printing of Postscript files is effected in the example filters by inserting a line of Postscript code right after the first line. For some Postscript files, this does not work.\n\nIn this case, send the Postscript file to a single-side print queue. The print filter psfilter set up for single-sided printing does no filtering of Postscript files.\n\n"
    }
  ]
}