{
  "title": "Make backup of DVD Video",
  "url": "https://wiki.archlinux.org/title/Make_backup_of_DVD_Video",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Optical disc drive\n- Rip Audio CDs\n\nThere are several ways to backup DVD videos. The quickest and simplest is to copy the ISO image as is. Many other methods are slow, and require several steps to accomplish. dvdbackup provides one of the simpler methods to rip a DVD (with some help from dvdauthor). It is elegant because it does not demux/remux/transcode/reformat the movie. This means the backup process is done in one step. But it can be tricked into copying much more than necessary by a DVD reporting incorrect size data.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dvdbackup package. libdvdcss is required to read encrypted DVDs. dvdauthor is only required if backing up specific titles or title sets.\n\n"
    },
    {
      "title": "Examining the DVD",
      "level": 2,
      "content": "First, determine which title to backup. The following command retrieves information about the DVD:\n\n```\n$ dvdbackup -i /dev/dvd -I\n```\n\nAfter some less useful information, dvdbackup will display something similar to the following:\n\n```\n$ dvdbackup -i /dev/sr0 -I\n```\n\n```\n[...]\n\nMain feature:\n\tTitle set containing the main feature is  1\n\tThe aspect ratio of the main feature is 16:9\n\tThe main feature has 1 angle(s)\n\tThe main feature has 1 audio_track(s)\n\tThe main feature has 2 subpicture channel(s)\n\tThe main feature has a maximum of 28 chapter(s) in on of it's titles\n\tThe main feature has a maximum of 6 audio channel(s) in on of it's titles\n```\n\nThis indicates that the main feature is in title set 1. Next a list of title sets is displayed:\n\n```\n$ dvdbackup -i /dev/sr0 -I\n```\n\n```\n[...]\n\nTitle Sets:\n\n\tTitle set 1\n\t\tThe aspect ratio of title set 1 is 16:9\n\t\tTitle set 1 has 1 angle(s)\n\t\tTitle set 1 has 1 audio_track(s)\n\t\tTitle set 1 has 2 subpicture channel(s)\n\n\t\tTitles included in title set 1 is/are\n\t\t\tTitle 1:\n\t\t\t\tTitle 1 has 28 chapter(s)\n\t\t\t\tTitle 1 has 6 audio channle(s)\n```\n\nThe main feature in this example is title 1. Sometimes a title set will include more than one title, sometimes not. Title sets can also include menus, which will no longer work if not backing up the entire DVD.\n\n"
    },
    {
      "title": "A single title",
      "level": 3,
      "content": "The -t option allows you to extract a specific title:\n\n```\n$ dvdbackup -i /dev/dvd -o ~ -t 1 -p\n```\n\nYou will now see a number of VOB files on the hard drive (in ~/movie_name/VIDEO_TS). These files can be played in MPlayer or VLC, but are insufficient to create a DVD copy. This is where dvdauthor is useful.\n\nA title set must now be created (e.g. VTS_01_0.IFO and VTS_01_0.BUP). Be aware that the following command will make a copy of the entire movie. The original can be deleted right afterwards.\n\n```\n$ mkdir ~/dvd\n$ cd ~/movie_name/VIDEO_TS\n$ dvdauthor -t -o ~/dvd *.VOB\n```\n\ndvdauthor will create a copy of the movie. If it outputs anything like \"SCR moves backwards, remultiplex input\" there might be trouble. Before deleting any files, check the file sizes of the original VOB files compared to the copied ones. If all roughly the same size, you may be alright. You can use mplayer to test the affected VOB files to see if anything is missing.\n\nNow, table of contents files must be created (e.g. VIDEO_TS.IFO and VIDEO_TS.BUP). This is much less time-consuming, and does not waste hard drive space:\n\n```\n$ cd ~/dvd/VIDEO_TS\n$ dvdauthor -o ~/dvd -T\n```\n\n"
    },
    {
      "title": "The main feature",
      "level": 3,
      "content": "The -F option automatically detects the main feature (though not always correctly) and copies the entire title set:\n\n```\n$ dvdbackup -i /dev/dvd -o ~ -F -p\n```\n\nNow, table of contents files must be created (e.g. VIDEO_TS.IFO and VIDEO_TS.BUP):\n\n```\n$ cd ~/movie_name/VIDEO_TS\n$ dvdauthor -o ~/movie_name -T\n```\n\n"
    },
    {
      "title": "The whole DVD",
      "level": 3,
      "content": "The -M option will backup the entire DVD structure, including menus, special features, etc. to the current directory. This requires approximately 7 GB of disk space for most DVDs:\n\n```\n$ dvdbackup -i /dev/dvd -M -p\n```\n\n"
    },
    {
      "title": "Shrinking the DVD",
      "level": 2,
      "content": "If the movie needs to fit on a 4.7 GB single layer DVD, vamps can be used to shrink it down to size. First, rip the main title and concatenate the VOBs into one file.\n\n```\n$ dvdbackup -t 1 \n$ cat ./movie/VIDEO_TS/*.VOB > ./movie.vob\n```\n\nCalculate the shrink factor for vamps. Divide the size of your VOB file by the size of your writable media and round up.\n\n```\n$ du -BMB movie.vob\n5376MB movie.vob\n$ echo '5376 / 4707' | bc -l\n```\n\nRun vamps, -a selects the audio stream. Running ffprobe movie.vob beforehand might help determine which stream to select.\n\n```\n$ vamps -E 1.15 -a 1 < movie.vob > movie.dvd5.vob\n```\n\nAuthor the dvd with dvdauthor:\n\n```\n$ dvdauthor -t -o ./author movie.dvd5.vob\n$ dvdauthor -T -o ./author\n```\n\n"
    },
    {
      "title": "Writing to disc",
      "level": 2,
      "content": "Note: **This article or section is a candidate for merging with Optical Disc Drive.** This article or section is a candidate for merging with Optical Disc Drive.\n\nThis article or section is a candidate for merging with Optical Disc Drive.\n\nSee DVD Writing.\n\n"
    },
    {
      "title": "Creating an ISO",
      "level": 3,
      "content": "The advantage of creating the ISO file is that you can test that everything works fine with mplayer before continuing. The disadvantage is that the ISO consumes hard drive space.\n\n```\n$ mkisofs -dvd-video -udf -o ~/dvd.iso ~/dvd # if a single title was extracted\n```\n\nor the following if the whole DVD was extracted:\n\n```\n$ mkisofs -dvd-video -udf -o ~/dvd.iso ~/movie_name\n```\n\nTo test the image:\n\n```\n$ mplayer dvd:// -dvd-device ~/dvd.iso\n```\n\nIf everything seems fine, burn the image:\n\n```\n$ growisofs -Z /dev/dvd=~/dvd.iso\n```\n\n"
    },
    {
      "title": "Burning straight to DVD",
      "level": 3,
      "content": "Creating and testing an image is a waste of time and hard drive space! Basically, we can merge the mkisofs with the growisofs command:\n\n```\n$ growisofs -dvd-video -udf -Z /dev/dvd ~/dvd # if a single title was extracted\n```\n\nor\n\n```\n$ growisofs -dvd-video -udf -Z /dev/dvd ~/movie_name\n```\n\n"
    }
  ]
}