{
  "title": "Mantenedores de Pacote",
  "url": "https://wiki.archlinux.org/title/Mantenedores_de_Pacote",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Mantenedores de Pacote, ou Package Mantainers, (anteriormente chamados de Trusted Users) é um papel na equipe oficial do Arch Linux. Mantenedores de Pacotes cumprem as seguintes tarefas:\n\n- Manter pacotes nos repositórios oficiais (exceto pelo do core).\n- Manter, gerir e supervisionar a operação do AUR.\n\nO termo genérico \"mantenedor de pacote\" também é usado para descrever qualquer pessoa que mantém um pacote, independentemente do repositório, conforme descrito em Terminologia do Arch#Package maintainer.\n\n"
    },
    {
      "title": "Como eu me torno um Mantenedor de Pacote?",
      "level": 2,
      "content": "Os requisitos mínimos para se tornar um Mantenedor de Pacote são as seguintes:\n\n- conhecer o básico de shell script\n- manter alguns pacotes no AUR com PKGBUILDs limpos e de alta qualidade\n- envolvimento básico na comunidade (lista de discussão, fóruns, IRC)\n- conhecer Google-Fu\n- uma ideia geral do tipo de pacotes que você deseja manter (basicamente, por que você deseja se tornar um Mantenedor de Pacote?)\n\nAinda que você possa se tornar um Mantenedor de Pacote por meramente preencher aqueles requisitos mínimos, as pessoas julgando você durante o procedimento padrão de votação podem esperar mais de você. Tal como:\n\n- envolvimento no rastreador de erros (relatando, pesquisando solução, informações)\n- patches para projetos do Arch\n- envolvimento em alguns projetos de código-fonte (mesmo se eles são seus próprios)\n\nSe você ainda estiver interessado em se tornar um Mantenedor de Pacote após ler essas linhas, o primeiro passo é encontrar dois Mantenedores de Pacote que concordem em patrocinar (sponsor) você. Uma vez definido os patrocinadores, escreva uma aplicação espirituosa assinada com sua chave GPG para a lista de discussão do aur-general.\n\nPara mais informações, veja as Package Maintainer Bylaws (\"Estatuto dos Mantenedores de Pacote\") e Diretrizes de Mantenedor de Pacote.\n\n"
    },
    {
      "title": "Mantenedores de Pacote ativos",
      "level": 2,
      "content": "Veja https://archlinux.org/people/package-maintainers/\n\n"
    },
    {
      "title": "Mantenedores de Pacote anteriores",
      "level": 2,
      "content": "Veja https://archlinux.org/people/package-maintainer-fellows/\n\n"
    }
  ]
}