{
  "title": "Mantenedor de pacotes",
  "url": "https://wiki.archlinux.org/title/Mantenedor_de_pacotes",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O ArchWiki diferencia dois tipos de grupos para definir independentemente os níveis de acesso e as funções do usuário. Em comparação com a convenção, popular em outros projetos do MediaWiki, onde cada função é representada por um grupo com seu próprio conjunto de direitos, essa abordagem é mais flexível, permitindo ajustar o nível de acesso de cada usuário, independentemente de suas funções.\n\n"
    },
    {
      "title": "Níveis de acesso",
      "level": 2,
      "content": "Os níveis de acesso são grupos com um conjunto não vazio de direitos concedidos: sua finalidade é definir a extensão das permissões que os usuários têm no wiki.\n\nOs seguintes níveis de acesso são atribuídos automaticamente pelo MediaWiki:\n\n- user é o grupo padrão para todos os usuários, o que concede as permissões básicas de leitura/escrita.\n- autoconfirmed é um grupo para usuários com pelo menos 20 edições e 3 dias desde a criação da conta [1]. Antes que esses limites sejam atingidos, as ações do usuário estão sujeitas a algumas restrições destinadas a evitar ataques de spam.\n\nOs seguintes níveis de acesso podem ser atribuídos manualmente por um bureaucrat. Os membros de funções específicas podem solicitar a atribuição temporary ou permanent desses níveis, por exemplo, após a aquisição ou mudança de uma função, ou para atender a necessidades individuais especificamente justificadas. As atribuições permanentes só são possíveis após discussão interna e aprovação pelos Administradores.\n\n- privileged é um grupo de membros da comunidade confiáveis com o propósito de permitir editar páginas mais protegidas, como as do namespace DeveloperWiki.\n- cosysop é um grupo para usuários que são confiados a participar da manutenção do wiki. Eles também podem editar as páginas mais protegidas.\n- sysop é um grupo para usuários altamente confiáveis que são responsáveis por tarefas críticas administrativas do wiki, como exclusão de páginas ou bloqueio de usuários, exigindo, portanto, a demonstração de amplo conhecimento de como o wiki é organizado. Eles também têm todos os direitos dos grupos checkuser, interface-admin e suppress que são criados automaticamente pelo MediaWiki.\n- bureaucrat é um grupo para sysops que podem conceder níveis de acesso e funções a outros usuários.\n- bot é um grupo para Bots.\n\n"
    },
    {
      "title": "Papéis",
      "level": 2,
      "content": "Papéis (Roles) são grupos com um conjunto vazio de direitos concedidos: sua finalidade é esclarecer a função dos usuários do wiki dentro da comunidade do Arch. Em geral, as funções não são removidas dos usuários que podem se tornar inativos. Os Administradores se reservam o direito de fazer variações por usuário para os níveis de acesso padrão de cada função.\n\n- Maintainers (maintainer) é um grupo para os membros do Maintenance Team. A todos os mantenedores é dado o nível de acesso cosysop por padrão. Mantenedores com o nível de acesso sysop são chamados de Administradores. Há também um grupo Administrator fellows (administrator_fellow) para Administradores afastados.\n- Translators (translator) é um grupo para os membros mais produtivos de uma Equipe de Tradução do ArchWiki ou tradutores individuais.\n- Arch Linux Developers (archdev) é um grupo para Desenvolvedores do Arch. A todos os Arch Linux Developers é dado o nível de acesso privileged por padrão.\n- ⧼group-archtu⧽ (archtu) é um grupo para Trusted Users do Arch.\n- Arch Linux Support Staff (archstaff) é um grupo para usuários com outros papéis dentro da comunidade do Arch Linux:\n\n- A todos os mantenedores é dado o nível de acesso cosysop por padrão. Mantenedores com o nível de acesso sysop são chamados de Administradores. Há também um grupo Administrator fellows (administrator_fellow) para Administradores afastados.\n\n- A todos os Arch Linux Developers é dado o nível de acesso privileged por padrão.\n\n- A Equipe de Teste do Arch se assegura que os pacotes submetido para os repositórios de teste estejam funcionais. A Equipe de Segurança do Arch rastreia problemas de segurança com pacotes em security.archlinux.org. Moderadores de fórum moderam os Fóruns do Arch Linux. Operadores de canais IRC moderam os principais canais IRC.\n\n- A Equipe de Teste do Arch se assegura que os pacotes submetido para os repositórios de teste estejam funcionais.\n- A Equipe de Segurança do Arch rastreia problemas de segurança com pacotes em security.archlinux.org.\n- Moderadores de fórum moderam os Fóruns do Arch Linux.\n- Operadores de canais IRC moderam os principais canais IRC.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Pull request original\n\n"
    }
  ]
}