{
  "title": "Maple",
  "url": "https://wiki.archlinux.org/title/Maple",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Octave\n- Sage-mathematics\n- Mathematica\n- Matlab\n\nFrom the official website:\n\nMaple is proprietary software produced by Maplesoft and requires a license to obtain, install, and activate. Arch is not officially supported, but the installer provided by Maplesoft may work in some cases.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Maplesoft provides an installer script that may work on some Arch Linux installations. Version 18 is supported by maple18AUR, later versions use the year as a version: e.g. maple2024AUR. Make sure that you have a working Java installation before beginning.\n\nAfter purchasing your license, download the appropriate Maple release package and unpack it in a location of your choosing. Open a terminal, change to the directory in which you unpacked the files, and run the installer script as a normal user. Installing the program's files inside of a user's home directory is the default option, and allows for easy removal of all components at a later time.\n\nOnce the package is installed, you will need to provide a license activation code. This should have been included in your installation archive.\n\n"
    },
    {
      "title": "Blank main window with tiling window managers",
      "level": 3,
      "content": "See Java#Gray window, applications not resizing with WM, menus immediately closing.\n\n"
    },
    {
      "title": "3D plots failing",
      "level": 3,
      "content": "Maple ships with its own C++ runtime, which seems to cause issues with 3D rendering (plot3d, implicitplot3d, ...).\n\nLinking the system's gcc-libs instead seems to fix the problem (replace nn with your version):\n\n```\nmaple20nn/bin.X86_64_LINUX/system\n```\n\nand link libstdc++.so.6.0.20 and libstdc++.so.6 to your system's version:\n\n```\nlibstdc++.so.6 -> /usr/lib64/libstdc++.so.6\nlibstdc++.so.6.0.20 -> /usr/lib64/libstdc++.so.6.0.22\n```\n\nAnother problem with 3D plots, when using Intel graphics, unrelated to the libstdc++: if the method described above does nothing, you should run the following command before launching Maple:\n\n```\nexport MESA_LOADER_DRIVER_OVERRIDE=i965\n```\n\nYou can modify the .desktop file, so that this command is ran automatically when Maple is launched.\n\n"
    },
    {
      "title": "Offline activation",
      "level": 3,
      "content": "If activation by license key does not work, you may try Offline Activation.\n\nEnter your license key in the Purchase Code field, and select either Host ID or Disk Serial Number as the hardware activation method.\n\nTo obtain your Host ID, run the following command:\n\n```\n$ ip address show | grep link/ether | awk '{ print $2; }' | sed 's/://g'\n```\n\nand use one of the resulting IDs.\n\nEnter your e-mail address (or use a disposable one), then copy the contents into maplehome/license/license.dat.\n\nThis should activate Maple on next startup.\n\n"
    },
    {
      "title": "Offline use",
      "level": 3,
      "content": "Your Maple license is bound to your MAC address (they call it host ID).\n\nFor NetworkManager 1.2.0 and newer, MAC address randomization while not connected to a network is enabled by default, which interferes with Maple's ability to verify the license.\n\nTo fix this, add the following to NetworkManager.conf and restart NetworkManager.\n\n```\n[device]\nwifi.scan-rand-mac-address=no\n```\n\n"
    },
    {
      "title": "Error trying to write your license file",
      "level": 3,
      "content": "When installed via the AUR script maple2024AUR mentioned on this page, the activation application (e.g /usr/share/maple2024/bin/activation) mentioned in the post-install hook must be run as root or you will receive the error\n\nAs it is a GUI application, you may need to follow the instructions under Running GUI applications as root for the activation application to open.\n\n"
    }
  ]
}