{
  "title": "Mercurial",
  "url": "https://wiki.archlinux.org/title/Mercurial",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Mercurial (commonly referred to as hg) is a distributed version control system written in Python and is similar in many ways to Git, Bazaar and Darcs.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the mercurial package. For the development version, install mercurial-hgAUR.\n\n"
    },
    {
      "title": "Graphical front-ends",
      "level": 3,
      "content": "See also Mercurial graphical user interfaces.\n\n- hgk — Tcl/Tk based tool to browse the history of a repository in a graphical way.\n\n- TortoiseHg — Set of graphical tools and a Nautilus extension for the Mercurial distributed revision control system.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "At the minimum you should configure your username or mercurial will most likely give you an error when trying to commit. Do this by editing ~/.config/hg/hgrc or ~/.hgrc and adding the following:\n\n```\n~/.hgrc\n```\n\n```\n[ui]\nusername = John Smith <johnsmith@domain.tld>\n```\n\nTo use the graphical browser hgk aka. hg view, add the following to ~/.hgrc (see forum thread):\n\n```\n~/.hgrc\n```\n\n```\n[extensions]\nhgk=\n```\n\nYou will need to install tk before running hg view to avoid the rather cryptic error message:\n\n```\n/usr/bin/env: wish: No such file or directory\n```\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "All mercurial commands are initiated with the hg prefix. To see a list of some of the common commands, run\n\n```\n$ hg help\n```\n\nEach command has a help page that can be read using\n\n```\n$ hg help subcommand\n```\n\nYou can either work with a pre-existing repository (collection of code or files), or create your own to share.\n\nTo work with a pre-existing repository, you must clone it to a directory of your choice:\n\n```\n$ mkdir mercurial\n$ cd mercurial\n$ hg clone https://repo.mercurial-scm.org/hello\n```\n\nTo create you own, change to the directory you wish to share and initiate a mercurial project\n\n```\n$ cd myfiles\n$ hg init myfiles\n```\n\n"
    },
    {
      "title": "Dotfiles Repository",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Dotfiles.** This article or section is a candidate for merging with Dotfiles.\n\nThis article or section is a candidate for merging with Dotfiles.\n\nIf you intend on creating a repository of all your ~/. files, you simply initiate the project in your home folder:\n\n```\n$ hg init\n```\n\nIt is then just a case of adding the specific files you wish to track:\n\n```\n$ hg add |file1 file2 file3\n```\n\nYou can then create a ~/.hgignore to ensure that only the files you wish to include in the repository are tracked by mercurial.\n\n"
    },
    {
      "title": "Progress bar",
      "level": 3,
      "content": "If you are going to be working with large repositories, you may want to enable the progress extension by adding it to your ~/.hgrc file:\n\n```\n~/.hgrc\n```\n\n```\n[extensions]\nprogress =\n```\n\nThis will show progress bars on operations longer than 3 seconds. If you would like the progress bar to show sooner, you can append the following to your configuration file:\n\n```\n~/.hgrc\n```\n\n```\n[progress]\ndelay = 1.5\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Mercurial: The Definitive Guide\n- hginit.com - a tutorial by Joel Spolsky\n- Mercurial Kick-Start one more tutorial by Aragost.\n- Mercurial Hosting - List of services that offer Mercurial hosting, from the official Mercurial wiki\n\n"
    }
  ]
}