{
  "title": "Metapacote",
  "url": "https://wiki.archlinux.org/title/Metapacote",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Um metapacote e grupo de pacotes podem ser definidos pelo empacotador para denotar um conjunto de pacotes relacionados. Ambos podem permitir instalar ou desinstalar este conjunto de pacotes simultaneamente usando o metapacote ou o nome do grupo como um substituto para cada nome de pacote individual. Embora um grupo não seja um pacote, ele pode ser instalado de maneira semelhante a um pacote, consulte pacman (Português)#Instalando grupos de pacotes e PKGBUILD (Português)#groups.\n\n"
    },
    {
      "title": "Diferença entre um metapacote e um grupo de pacotes",
      "level": 2,
      "content": "A diferença entre um metapacote e um pacote comum é que um metapacote é vazio e existe apenas para vincular pacotes relacionados por meio de dependências. Um metapacote, muitas vezes (embora nem sempre) intitulado com o sufixo \"-meta\", fornece funcionalidade semelhante a um grupo de pacotes, pois permite que vários pacotes relacionados sejam instalados ou desinstalados simultaneamente.\n\nCada solução possui vantagens e desvantagens:\n\nmetapacote:\n\n- Os metapacotes podem ser instalados como qualquer outro pacote (consulte pacman (Português)#Instalando pacotes específicos).\n- Os metapacotes podem ser removidos como qualquer outro pacote (veja pacman (Português)#Removendo pacotes).\n- Quaisquer novos pacotes-membro serão instalados quando o metapacote é atualizado com um novo conjunto de dependências.\n- Os usuários não podem escolher quais dependências de metapacotes que desejam instalar.\n- Os usuários não podem remover as dependências do metapacote sem precisar desinstalar o próprio pacote.\n\ngrupo:\n\n- Os grupos de pacotes solicitarão aos usuários que selecionem os pacotes do grupo que desejam instalar (consulte pacman (Português)#Instalando grupos de pacotes).\n- Os usuários não podem desinstalar um grupo, porque instalaram uma lista de pacotes. Em vez disso, pacman -R nome_grupo tente remover todos os membros do grupo.\n- Novos membros do grupo não serão instalados automaticamente.\n- Os usuários podem escolher quais membros do grupo eles desejam instalar.\n- Os usuários podem desinstalar membros do grupo sem precisar remover o grupo inteiro.\n\n"
    },
    {
      "title": "Metapacotes",
      "level": 2,
      "content": "O metapacote mais importante é o base. Ele contém um conjunto mínimo de pacotes que define uma instalação básica do Arch Linux. Ele inclui:\n\n- básico como glibc e bash,\n- coisas relacionadas à distribuição como pacman e systemd\n- ferramentas POSIX como utilitários principais, utilitários de processo, arquivo e compressão de arquivo\n- ferramentas de rede como iproute2\n\nO kernel é uma dependência opcional. Veja o anúncio quando ele foi introduzido e os motivos para o base ser um metapacote.\n\n"
    },
    {
      "title": "Grupos",
      "level": 2,
      "content": "O grupo de pacotes mais importante é o base-devel. Ele contém ferramentas necessárias para compilar muitos pacotes como o GCC e o make. Veja também makepkg (Português)#Uso.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Lista de todos os grupos de pacotes\n- Exemplos: GNOME (Português)#Instalação KDE (Português)#Instalação i3#Installation\n\n- GNOME (Português)#Instalação\n- KDE (Português)#Instalação\n- i3#Installation\n\n"
    }
  ]
}