{
  "title": "Microsoft Surface Book 2",
  "url": "https://wiki.archlinux.org/title/Microsoft_Surface_Book_2",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) | 8086:5917 | Yes\nGPU (NVIDIA) | 10de:1c8d | Yes\nWi-Fi | 11ab:2b38 | Yes\nAudio | 8086:9d71 | Yes\nTouchpad |  | Yes\nTouchscreen |  | Yes\nCamera |  | No\nCard reader |  | Yes\nBluetooth |  | Yes\n\nThis page contains instructions, tips, pointers, and links for installing and configuring Arch Linux on Microsoft Surface Book 2 devices.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "The information in Boot loaders applies here. refind and systemd-boot work well.\n\n"
    },
    {
      "title": "UEFI setup and disabling Secure Boot",
      "level": 3,
      "content": "Disabling Secure Boot is not necessary, but makes things easier.\n\nFollow the manufacturer's directions for accessing UEFI setup:\n\n1. Shut down your Surface and wait about 10 seconds to be sure it is off.\n1. Press and hold the volume-up button on your Surface, and, at the same time, press and release the power button.\n1. When you see the Surface logo, release the volume-up button. The UEFI menu will appear within a few seconds.\n\n"
    },
    {
      "title": "Boot from USB",
      "level": 3,
      "content": "Booting from USB is possible by reordering boot devices in the UEFI setup or by holding the volume down button while booting.\n\nThe \"Enable Boot from USB devices\" UEFI option needs to be enabled in order to boot to the installer.\n\n"
    },
    {
      "title": "Drivers",
      "level": 3,
      "content": "The standard xf86-video-intel driver works with the Surface Book devices.\n\nThe Nvidia 1050 and 1060 cards in the Surface Book 2 Performance Base are recognized by the kernel and supported by nvidia and nvidia-dkms drivers.\n\nWithout the kernel (linux-surface), there was a bug which causes it to be effectively useless because when a load is put on the Nvidia graphics hardware, it immediately and severely throttles down to around 139MHz. The reason, as reported by nvidia-smi, is software thermal throttling. The cause is that, apparently, the fan cannot be controlled automatically, nor through nvidia-smi or nvidia-settings, even when the Coolbits option is set to 8.\n\n"
    },
    {
      "title": "Console fonts",
      "level": 3,
      "content": "Because of the screen's resolution, the console font is barely readable - refer to Linux console#Fonts on how to change them.\n\nUsing terminus-font with 32pt looks good on Surface Book 2 on the vconsole (add FONT=ter-m32n to /etc/vconsole.conf after installing).\n\n"
    },
    {
      "title": "Touchscreen",
      "level": 2,
      "content": "Only works in a Window Manager or Desktop Environment that has full support for it. It is recognized as a mouse click otherwise.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "Surface Book 2 devices exhibit a hissing noise at times. See Advanced Linux Sound Architecture#Disabling auto mute on startup for the fix.\n\n"
    },
    {
      "title": "Wi-Fi",
      "level": 2,
      "content": "Requires the installation of the linux-firmware-marvell package for the wireless network interface to be recognized by the kernel.\n\nSince September 2018, Surface Book 2 Wi-Fi may power off during use. When this happens, it is not visible with lspci and rebooting is a way to get it back on. However, this behavior can be prevented (temporarily) by installing iw and running the following command as root:\n\n```\n# iw dev wlp1s0 set power_save off\n```\n\nTo permanently fix the issue with NetworkManager, add this to your NetworkManager config. (Such as /etc/NetworkManager/NetworkManager.conf)\n\n```\n[connection]\nwifi.powersave = 2\n[device]\nwifi.scan-rand-mac-address=false\n```\n\n"
    },
    {
      "title": "Keyboard base",
      "level": 2,
      "content": "Removal is a few seconds slower in Linux than in Windows, may cause touchscreen to stop working until reboot and may cause issues with dedicated graphics (if equipped). Installing surface-dtx-daemonAUR reduces this time significantly.\n\n"
    },
    {
      "title": "Hibernation",
      "level": 2,
      "content": "Hibernation with the qzed kernel only works when the touchscreen firmware loading is disabled (adding i915.enable_guc=0 to the kernel parameters).\n\n"
    },
    {
      "title": "Camera",
      "level": 2,
      "content": "Reportedly not working.\n\n"
    }
  ]
}