{
  "title": "Moving an existing install into (or out of) a virtual machine",
  "url": "https://wiki.archlinux.org/title/Moving_an_existing_install_into_(or_out_of)_a_virtual_machine",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- QEMU\n- VirtualBox\n- VMware\n- Migrate installation to new hardware\n\nThis article describes how to transfer your current Arch Linux installation in or out of a virtual environment (i.e. QEMU, VirtualBox, VMware). A virtual machine uses different hardware, which needs to be addressed by re-generating the initramfs image and possibly adjusting the fstab – especially if it is an SSD.\n\n"
    },
    {
      "title": "Moving out of a virtual machine",
      "level": 2,
      "content": "Moving out of a virtual environment is relatively easy.\n\n"
    },
    {
      "title": "Set up a shared folder",
      "level": 3,
      "content": "Setting up a shared folder between the guest virtual machine and the host depends on the hypervisor you use. Please thus refer to their specific wiki page or manual.\n\nIf you do not already have an ext4 partition, see File systems.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nIf you are on Windows, install Ext2Fsd to be able to mount ext volumes.\n\n"
    },
    {
      "title": "Transfer the system",
      "level": 3,
      "content": "From the virtual machine, open a terminal and transfer the system:\n\n```\n# rsync -aAXHSv /* /path/to/shared/folder --exclude={/dev/*,/proc/*,/sys/*,/tmp/*,/run/*,/mnt/*,/media/*,/lost+found,/home/*/.gvfs}\n```\n\nThis can also be done with clonezilla boot disk or dd from a random Linux live-cd. If you are using Virtualbox you need to connect the target drive through USB (or SATA to USB cable) otherwise use an external USB drive to save the disk image (with dd or clonezilla).\n\n"
    },
    {
      "title": "Chroot and reinstall the boot loader",
      "level": 3,
      "content": "Boot a \"live\" GNU/Linux distribution, mount the root partition and chroot into it.\n\nReinstall your boot loader or boot manager: either Syslinux, GRUB or systemd-boot. Do not forget to update the configuration file: syslinux.cfg for Syslinux, grub.cfg for Grub, or the systemd-boot boot entries located in /boot/loader/entries/.\n\n"
    },
    {
      "title": "Adjust the fstab",
      "level": 3,
      "content": "Since your entire root tree has been transferred to a single partition, edit the fstab file to reflect the right partition(s).\n\nCheck with the blkid command, since lsblk is not very useful inside a chroot.\n\n"
    },
    {
      "title": "Re-generate the initramfs image",
      "level": 3,
      "content": "Because the hardware has changed, while you are still in the chroot, regenerate the initramfs.\n\nAnd that is about it.\n\nYou will most likely need to set up the network, since the virtual machine was probably piggybacking on the host OS's network settings. See Network configuration.\n\n"
    },
    {
      "title": "Moving into a virtual machine",
      "level": 2,
      "content": "Moving into a virtual environment takes a little more effort.\n\n"
    },
    {
      "title": "Create the container",
      "level": 3,
      "content": "This will create a 32 GiB raw image:\n\n```\n# fallocate -l 32GiB -o 1024 /media/Backup/backup.img\n```\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nIf you want to create one the exact size of your root partition, run fdisk -l and use the value from the Blocks column for the count= parameter. Note that you will transfer your entire root tree, so that includes the /boot and /home folders. If you have any separate partitions for those, you need to take them into account when creating the container.\n\nPartition the /media/Backup/backup.img file by running your favourite partitioning tool. Create a partition table on it (e.g. msdos), choose the partition scheme and create the partitions.\n\nNow load the necessary module and mount it as a loopback device, on /dev/loop5 (for example):\n\n```\n# modprobe loop\n# losetup --partscan /dev/loop5 /media/Backup/backup.img\n```\n\nThen create a file system on the partitions, which will appear as /dev/loop5p1, /dev/loop5p2, etc.\n\n"
    },
    {
      "title": "Transfer the system",
      "level": 3,
      "content": "Mount the loopback device and transfer the system:\n\n```\n# mount --mkdir /dev/loop5p1 /mnt/Virtual\n# rsync -aAXv /* /mnt/Virtual --exclude={/dev/*,/proc/*,/sys/*,/tmp/*,/run/*,/mnt/*,/media/*,/lost+found,/home/*/.gvfs}\n```\n\n"
    },
    {
      "title": "Convert the container to a compatible format",
      "level": 3,
      "content": "Choose the appropriate command depending on the desired virtual machine.\n\nTo convert into a KVM container, use qemu-desktop with the following command line:\n\n```\n$ qemu-img convert -c -f raw -O qcow /media/backup.img /media/backup.qcow2\n```\n\nTo convert into a VirtualBox container, use virtualbox with the following command line:\n\n```\n$ VBoxManage convertfromraw --format VDI /media/backup.img /media/backup.vdi\n```\n\nTo convert into a VMware container, use virtualbox with the following command line:\n\n```\n$ VBoxManage convertfromraw --format VMDK /media/backup.img /media/backup.vmdk\n```\n\n"
    },
    {
      "title": "Chroot and reinstall the boot loader",
      "level": 3,
      "content": "Connect the container to the virtual machine, along with a Linux LiveCD (e.g. the latest Arch Linux ISO) in the virtual machine's virtual CD-ROM, then start the virtual machine and chroot into it:\n\n```\n# mount /dev/sda1 /mnt\n# arch-chroot /mnt /bin/bash\n```\n\nReinstall either Syslinux or GRUB. Do not forget to update its configuration file:\n\n- For Syslinux, it should be APPEND root=/dev/sda1 ro in syslinux.cfg.\n- For GRUB, it is recommended that you automatically re-generate a grub.cfg.\n\n"
    },
    {
      "title": "Adjust the fstab",
      "level": 3,
      "content": "Since your entire root tree has been transferred to a single partition, edit the fstab file. You may use the UUID or label if you want, but those are more useful in multi-drive, multi-partition configurations (to avoid confusions). For now, /dev/sda1 for your entire system is just fine.\n\n```\n/etc/fstab\n```\n\n```\ntmpfs                    /tmp      tmpfs     nodev,nosuid          0   0\n/dev/sda1                /         ext4      defaults,noatime      0   1\n```\n\n"
    },
    {
      "title": "Disable any Xorg-related files",
      "level": 3,
      "content": "Having an nvidia, nouveau, radeon, intel, etc., entry in the Device section from one of the Xorg configuration files will prevent it from starting, since you will be using emulated hardware (including the video card). So it is recommended that you move/rename or delete the following:\n\n```\n# mv /etc/X11/xorg.conf /etc/X11/xorg.conf.bak\n# mv /etc/X11/xorg.conf.d/10-monitor /etc/X11/xorg.conf.d/10-monitor.bak\n```\n\n"
    },
    {
      "title": "Re-generate the initramfs image",
      "level": 3,
      "content": "Because the hardware has changed, while you are still in the chroot, re-generate the initramfs image and do a proper shutdown:\n\n```\n# mkinitcpio -p linux\n# exit\n# umount -R /mnt\n# poweroff\n```\n\nFinally, pull out the LiveCD (the ISO file), so that you do not boot back into it, and start the virtual machine.\n\nEnjoy your new virtual environment.\n\n"
    },
    {
      "title": "\"mount: special device /dev/loop5p1 does not exist\"",
      "level": 3,
      "content": "Use losetup --partscan, for example:\n\n```\n# losetup --partscan /dev/loop5 /media/Backup/backup.img\n```\n\nThis should create device nodes for each partition you have created inside the loop device.\n\n"
    },
    {
      "title": "\"Waiting 10 seconds for device /dev/sda1; ERROR: Unable to find root device '/dev/sda1'\"",
      "level": 3,
      "content": "```\nWaiting 10 seconds for device /dev/sda1 ...\nERROR: Unable to find root device '/dev/sda1'.\nYou are being dropped to a recovery shell\n    Type 'exit' to try and continue booting\nsh: cannot access tty; job control turned off\n[rootfs /]# _\n```\n\nIt most likely means that you did not run poweroff like you were instructed to, and closed the virtual machine with the \"close\" button, which is the equivalent of a power outage. Now you need to regenerate your initramfs image. To do that, you can start the virtual machine using the Fallback entry. If you do not have a Fallback entry, press Tab (for Syslinux) or e (for GRUB) and rename it initramfs-linux-fallback.img. After it boots, open up a terminal and run:\n\n```\n# mkinitcpio -p linux\n# poweroff\n```\n\n"
    },
    {
      "title": "\"Missing operating system. FATAL: INT18: BOOT FAILURE\"",
      "level": 3,
      "content": "- You either need to install or reinstall a boot loader. See Arch boot process#Boot loader.\n- You are using a Btrfs filesystem with compression for /boot, for which Syslinux currently cannot boot from.\n- The boot order from the BIOS or from the virtual machine's settings is not properly set up. Make sure that the drive containing the boot loader is the first one to boot.\n\n"
    },
    {
      "title": "I am asked for the root password, for maintenance",
      "level": 3,
      "content": "```\n:: Checking Filesystems                        [BUSY]\nfsck.ext4: Unable to resolve '...'\n```\n\nThis means that you forgot to add the drive's UUID, label or device name in /etc/fstab. The UUID is different every time you format it (or in this case, create one from scratch), and they likely do not match. Check with blkid.\n\n"
    }
  ]
}