{
  "title": "MSI GS75",
  "url": "https://wiki.archlinux.org/title/MSI_GS75",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad | 8086:a324 | Yes\nKeyboard | 1038:1122 | Yes\nGPU (Intel) | 8086:3e9b | Yes\nGPU (NVIDIA) | 10de:1f10 | Yes\nEthernet | 1969:e0b1 | Yes\nWi-Fi | 8086:a370 | Yes\nWebcam | 5986:211c | Yes\nBluetooth | 8087:0aaa | Yes\nThunderbolt | 8086:15da | Yes\nAudio | 8086:a348 | Yes\nSD Card Reader | 10ec:5250 | Yes\n\nThe MSI GS75 Stealth (9SF) is an Intel architecture American Megatrends Inc. notebook with an Intel i7-9750H CPU and an NVIDIA Turing 20XX Q GPU.\n\n- HDMI ports are directly wired to the dedicated GPU, Thunderbolt Type-C is not.\n- The Intel integrated GPU (iGPU) is directly wired to the notebooks screen (EDP-1).\n- The NVIDIA GPU (dGPU) is directly wired to the external HDMI port.\n- Thunderbolt is wired to its own controller, but is somehow attached to the power state of the NVIDIA GPU.\n- Thunderbolt firmware can be updated via BIOS, but the process is dangerous and can brick the machine.\n- Native Microphone comprises two mono microphones that need to be managed for stereo-input and noise reduction.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "It is best to to enable factory default settings in the UEFI before installing. This will disable Secure Boot and provide sane settings for the CPU/GPU/PCH/EC. Resetting is not required, but this suggestion exists due to the complexity of advanced options and the configuration of PCIe on this model.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "- Enter UEFI configuration: Del\n- Select BOOT Device: F11\n\nThe default UEFI menu does not expose all possible options, to do so you must enable the \"Advanced BIOS\" feature:\n\n- Enter \"Advanced BIOS\": LAlt+F2+RShift+RCtrl\n\n"
    },
    {
      "title": "fwupdate",
      "level": 3,
      "content": "MSI provides firmware binaries for both the UEFI and Embedded Controller (EC). These files can be found at https://www.msi.com/Laptop/GS75-Stealth-9SF/support .\n\nSystem firmware (EC) can be update via fwupd, but the UEFI cannot.\n\n"
    },
    {
      "title": "Backlight",
      "level": 3,
      "content": "Keyboard brightness works out of the box with Fn+NumPadMinus/Plus.\n\nThe lights on the keyboard cannot be configured with msi-keyboard-gitAUR, because this tool only works with region-based RGB lighting. For this laptop model, the tool msi-perkeyrgbAUR provides partial control.\n\n"
    },
    {
      "title": "Function keys",
      "level": 3,
      "content": "The airplane mode key combination (Fn+F10) is disabled by default. Adding the following kernel parameters activates airplane mode key combination:\n\n```\nacpi_osi=! acpi_osi=\"Windows 2009\"\n```\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "Multi gestures do not work out the box, but are detected with libinput-gesturesAUR.\n\n"
    },
    {
      "title": "Thermals",
      "level": 2,
      "content": "Control the fans with iswAUR. It will only work after enabling ec_sys write-support by adding the following to your kernel command line:\n\n```\nec_sys.write_support=1\n```\n\n"
    },
    {
      "title": "Microphone",
      "level": 2,
      "content": "This notebook has a microphone array which provides stereo input. Noise reduction, echo cancellation, noise suppression can all be done via beamforming. To get the best of it add:\n\n```\n/etc/pulse/default.pa\n```\n\n```\nload-module module-echo-cancel use_master_format=1 aec_method=webrtc aec_args=\"beamforming=1 mic_geometry=-0.025,0,0,0.025,0,0\"\nset-default-source alsa_input.pci-0000_00_1f.3.analog-stereo.echo-cancel\n```\n\n"
    }
  ]
}