{
  "title": "MythTV Walkthrough",
  "url": "https://wiki.archlinux.org/title/MythTV_Walkthrough",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "MythTV is an application suite designed to provide an amazing multimedia experience. It provides PVR functionality to a Linux based computer and also supports other media types. Combined with a nice, quiet computer and a decent TV, it makes an excellent centerpiece to a home theater system.\n\n"
    },
    {
      "title": "Structure",
      "level": 2,
      "content": "The MythTV system is split into a backend and a frontend. Each component has its own functions:\n\n"
    },
    {
      "title": "mythbackend",
      "level": 3,
      "content": "- Schedule and record television programming\n- Stream video data to the frontend\n- Flag commercial breaks\n- Transcode videos from one format to another\n\n"
    },
    {
      "title": "mythfrontend",
      "level": 3,
      "content": "- Provide a pretty GUI\n- Play back recorded content\n- Provide an interface to schedule programs\n\nThe frontend and backend may be on separate computers on a network, and there may also be multiple frontends. This architecture allows for a central media distribution system that can reach anywhere a network can. This is a remarkably flexible system, and it even allows very low power machines to act as perfectly usable frontends.\n\n"
    },
    {
      "title": "Hardware requirements",
      "level": 2,
      "content": "All systems are going to need a tuner card. The Hauppauge PVR series of cards (150, 250, 350, and 500) are very popular for use with MythTV due to fairly decent Linux support and low CPU usage. Other cards, like those based on the BT878 chipset, are also used. Unlike the PVR series, BT878 based cards require significant amounts of CPU power to save the video, as these cards output raw frames and not compressed streams.\n\n"
    },
    {
      "title": "Software requirements",
      "level": 2,
      "content": "For the backend, it is also good to have LAMP working properly so that anybody can use a web browser to schedule programming through MythWeb. While it is not necessary, it is a very handy feature.\n\nA working Xorg (graphical) environment is necessary. For setting MythTV up, a remote access via X11-forwarding mechanism is sufficient.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the mythtv-gitAUR package and any desired plugins. The package creates the mythtv user.\n\nAt this point a generic MythTV installation is present that must be refined into a backend, a frontend, or both.\n\n"
    },
    {
      "title": "Backend setup",
      "level": 3,
      "content": "Before setting up your backend, make sure you have a functioning video capture card or a firewire input from a STB. Unfortunately, that part of setup is outside the scope of this article. If you are in the United States, get an account at Schedules Direct (this service provides TV listings at a minimal cost). Users outside the United States will need to use screen scrapers (xmltv) to do the same job.\n\n"
    },
    {
      "title": "Setting up the database",
      "level": 4,
      "content": "Install mariadb and start mysqld.service.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nIf other machines in the LAN are expected to connect to the masterbackend server, comment out the \"skip-networking\" line in /etc/mysql/my.cnf at this point.\n\nSetup mysql with a password:\n\n```\n# mysql_secure_installation\n```\n\nCreate the database structure:\n\n```\n$ mysql -u root -p </usr/share/mythtv/mc.sql\n```\n\nIf you have lost or overwritten your mc.sql file, it is always available here.\n\nUpdate your database\n\n```\n# mysql_upgrade -u root -p\n```\n\nMythTV requires time zone tables are required to be in MySQL, add them:\n\n```\nmysql_tzinfo_to_sql /usr/share/zoneinfo | mysql -u root -p<yourpassword> mysql\n```\n\nSome setups refuse frontends from remote machines. To fix this:\n\n```\n# mysql -u root -p\nmysql> GRANT ALL ON mythconverg.* TO 'user'@'host.net' IDENTIFIED BY 'password';\nQuery OK, 0 rows affected (0.00 sec)\nmysql> FLUSH PRIVILEGES;\nQuery OK, 0 rows affected (0.00 sec)\n```\n\n- Replace user with the user name running on the frontend (default: mythtv).\n- Replace host.net with the host name or IP address of the remote box needing access. Other common values are %.local and 192.168.1.%.\n- Replace password with a suitable password (default: mythtv).\n\nExample:\n\n```\n# mysql -u root -p\nmysql> GRANT ALL ON mythconverg.* TO 'mythtv'@'192.168.0.%' IDENTIFIED BY 'mythtv';\nQuery OK, 0 rows affected (0.00 sec)\nmysql> FLUSH PRIVILEGES;\nQuery OK, 0 rows affected (0.00 sec)\n```\n\n"
    },
    {
      "title": "Setting up the master backend",
      "level": 4,
      "content": "Load up your WM (lxde is a good choice for light-weight builds, but anything will work.)\n\nNow run the mythtv-setup program\n\n```\n$ mythtv-setup\n```\n\nIf your backend runs on a headless server, mythtv-setup can be run via OpenSSH#X11 forwarding by running:\n\n```\n$ ssh -X user@backend '. /etc/profile.d/perlbin.sh && LANG=C.UTF-8 mythtv-setup'\n```\n\n- General menu\n\n- Capture card menu\n\n- Video sources menu\n\n- Input connections menu\n\n- Channel editor menu\n\n- Exit the program (Esc)\n\n- Run mythfilldatabase\n\n```\n$ mythfilldatabase\n```\n\nThis should populate your mysql database with TV listings for the next two weeks (or so).\n\n"
    },
    {
      "title": "Enable the mythbackend daemon",
      "level": 4,
      "content": "Enable the mythbackend.service systemd unit.\n\n"
    },
    {
      "title": "PVR150",
      "level": 4,
      "content": "If you cannot open /dev/video0 of your PVR150, install the firmware, located in the ivtv-utilsAUR package.\n\n"
    },
    {
      "title": "Opening DVB frontend device failed",
      "level": 4,
      "content": "The kernel takes time to register the frontend devices (such as those of TurboSight TBS 62x1) and they may not be available when systemd starts mythbackend.service. This leads to the following error recorded in the system log:\n\n```\n# DVBChan[1](/dev/dvb/adapter0/frontend0): Opening DVB frontend device failed.\n# eno:No such file or directory (2)\n# DVBChan[1](/dev/dvb/adapter0/frontend0): Failed to open DVB frontend device due to fatal error or too many attempts.\n# ChannelBase: CreateChannel() Error: Failed to open device /dev/dvb/adapter0/frontend0\n# Problem with capture cardsCard 1failed init\n```\n\nThe solution consists in starting the mythbackend.service only after the devices are available:\n\n- Create file /etc/udev/rules.d/99-mythbackend.rules:\n\n```\n#\n# Create systemd device units for capture devices\n#\nSUBSYSTEM==\"video4linux\", TAG+=\"systemd\"\nSUBSYSTEM==\"dvb\", TAG+=\"systemd\"\nSUBSYSTEM==\"firewire\", TAG+=\"systemd\"\n```\n\n- Create a drop-in unit file for mythbackend.service as follows:\n\n```\n/etc/systemd/system/mythbackend.service.d/override.conf\n```\n\n```\n# [Unit]\n# After=dev-dvb-adapter0-frontend0.device\n# Wants=dev-dvb-adapter0-frontend0.device\n```\n\nSee MythTV wiki's page Systemd mythbackend Configuration for further details.\n\n"
    },
    {
      "title": "Frontend setup",
      "level": 2,
      "content": "Compared to the backend, getting a frontend running is simple. The frontend machine needs permission to access the database on the backend machine. On the backend machine, follow the instructions to grant remote access in the MariaDB article. On the frontend machine, install the mythtv packages using pacman as above. Afterward, make sure you are in an X environment as a normal user and run mythfrontend. It will pop up a menu asking about the IP address of the backend and the local computer's name and IP address. Fill in this information and your frontend should be functional.\n\nOn the other hand, the frontend has more options than a luxury car. All of those are an article on their own. There are a few notable options that should be set to ensure a good working setup. If you do not have an interlaced monitor (and almost nobody does), you will need to deinterlace your television output. Go into the TV playback menu and select kernel deinterlacing or bob2x deinterlacing. Try both and see which you like better. Also, in the general settings page, it is good to set up your ALSA setup settings, but those vary so greatly it is not worth suggesting values here.\n\n"
    },
    {
      "title": "MythTV plugins",
      "level": 2,
      "content": "There are a number of plugins available for MythTV in the AUR. They range from RSS readers to DVD players. Take a look at them. Simply installing the package on the frontend computer should impart the intended functionality. There is rarely any additional setup, and when there is, the install file will mention it.\n\n"
    },
    {
      "title": "MythWeb",
      "level": 3,
      "content": "MythWeb is a web interface for MythTV. Instructions for configuring MythWeb in Arch Linux can be found on the MythWeb page.\n\n"
    },
    {
      "title": "Hints to a Happy Myth System",
      "level": 2,
      "content": "But not full articles (yet)\n\n- Run ntpd or openntpd on your backend to make sure it always has the right time.\n- LIRC on your frontend allows you to use a remote control, which is wonderful in a living room.\n- Use gdm, sddm, or xdm to automatically log in your frontend, and ~/.xinitrc to load mythfrontend on boot.\n- Set the \"automatically run mythfilldatabase\" option on one of your frontends to make sure you always have listings.\n- Do not forget to use the verbosity statements and log file location arguments to mythfrontend so you can see when things break.\n- Do not run your frontend as root, create a mythtv user\n\n"
    },
    {
      "title": "Using GDM to autologin your Mythfrontend",
      "level": 3,
      "content": "In /etc/gdm/custom.conf, add the following statements under the [daemon] heading:\n\n```\nAutomaticLoginEnable=true\nAutomaticLogin=mythtv (assuming your frontend user is mythtv)\n```\n\nFYI - GDM will not autologin as root\n\n"
    },
    {
      "title": "Using XDM to automically login to your MythFrontend",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nFind in your /etc/inittab file the following line:\n\n```\nid:3:initdefault:\n```\n\nChange to:\n\n```\nid:5:initdefault:\n```\n\nThen add the following below it (or anywhere in the file):\n\n```\nx:5:respawn:su - MYTHUSER -c startx\n```\n\nIf you would like to start mythfrontend on booting into Xorg, edit (or create if none exists) your MYTHUSER's .xinitrc file and add the following line:\n\n```\nmythfrontend\n```\n\n"
    },
    {
      "title": "Optmize your system",
      "level": 3,
      "content": "Be sure to have a look at Optimizing Performance at the MythTV Wiki for how to keep your data stores happy, as well as optimize your system in various other ways to get the most out of your Myth box.\n\n"
    },
    {
      "title": "References",
      "level": 2,
      "content": "- https://www.mythtv.org/\n- https://www.mythtv.org/wiki/\n- http://www.linhes.org A user friendly MythTV and Linux install that uses Arch Linux\n\n"
    }
  ]
}