{
  "title": "Netatalk",
  "url": "https://wiki.archlinux.org/title/Netatalk",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Netatalk is a free, open-source implementation of the Apple Filing Protocol (AFP). It allows Unix-like operating systems to serve as file servers for Macintosh computers.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the netatalkAUR package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Start/enable netatalk.service.\n\nBesides the configuration files that are installed (and checked during upgrade), netatalk may generate two files /etc/netatalk/afp_signature.conf or /var/lib/netatalk/afp_signature.conf which holds the system UUID, and /etc/netatalk/afp_voluuid.conf or /var/lib/netatalk/afp_voluuid.conf which holds volume UUIDs for TimeMachine. These files may remain after package removal and should be kept in most cases to disambiguate the services broadcast over the local network.\n\nNetatalk 3.x uses a single configuration file, /etc/afp.conf. See afp.conf(5) and the following example (make sure processes have write access to afpd.log):\n\n```\n/etc/afp.conf\n```\n\n```\n[Global]\n mimic model = TimeCapsule6,106\n log level = default:warn\n log file = /var/log/afpd.log\n hosts allow = 192.168.1.0/16\n\n[Homes]\n basedir regex = /home\n\n[TimeMachine]\n path = /mnt/timemachine\n valid users = tmuser\n time machine = yes\n\n[Shared Media]\n path = /srv/share/media\n valid users = joe sam\n```\n\n"
    },
    {
      "title": "Guest access",
      "level": 3,
      "content": "In order to allow guest read-only access to your shared folders, add following line to the [Global] section:\n\n```\n/etc/afp.conf\n```\n\n```\n[Global]\nuam list = uams_guest.so\n```\n\nTo allow guest read/write access, first, allow read-only access as in the previous example and then add following lines to a particular share section:\n\n```\n/etc/afp.conf\n```\n\n```\n[Your Share]\npath = /mnt/public/share\nrwlist = nobody\n```\n\n"
    },
    {
      "title": "iptables",
      "level": 2,
      "content": "If you use the iptables package for firewall services, consider adding the following (replace -I with -A as necessary):\n\n```\nBonjour/Zeroconf\n```\n\n```\niptables -I INPUT -p udp --dport mdns -d 224.0.0.251 -j ACCEPT\niptables -I OUTPUT -p udp --dport mdns -d 224.0.0.251 -j ACCEPT\n```\n\n```\nAFP\n```\n\n```\niptables -I INPUT -p tcp --dport afpovertcp -j ACCEPT\n```\n\n```\nSLP\n```\n\n```\niptables -I INPUT -p tcp --dport slp -j ACCEPT\niptables -I OUTPUT -p tcp --dport slp -j ACCEPT\niptables -I INPUT -p udp --dport slp -j ACCEPT\niptables -I OUTPUT -p udp --dport slp -j ACCEPT\n```\n\n```\nAppleTalk\n```\n\n```\niptables -I INPUT -p tcp -m multiport --dport at-rtmp,at-nbp,at-echo,at-zis -j ACCEPT\niptables -I OUTPUT -p tcp -m multiport --dport at-rtmp,at-nbp,at-echo,at-zis -j ACCEPT\n```\n\n"
    },
    {
      "title": "Enable Bonjour/Zeroconf",
      "level": 2,
      "content": "Bonjour/Zeroconf is now a requirement of netatalk and is compiled by default. No configuration is necessary, netatalk will register its own services using the dbus link. Make sure you set -mimicmodel to the desired string (see /System/Library/CoreServices/CoreTypes.bundle/Contents/Info.plist on a Mac for a full list).\n\nYou may need to start and enable avahi-daemon.service if it is not running yet.\n\n"
    }
  ]
}