{
  "title": "Nullmailer",
  "url": "https://wiki.archlinux.org/title/Nullmailer",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Nullmailer is a small mail program that allows you (or your system) to send mails through an existing email account (using an SMTP server). Technically, this is a MTA. Nullmailer is particularly useful on systems that are not always online (like a travelling laptop).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the package nullmailer.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Configuration files are located in /etc/nullmailer/. Each file contains one option and the possible configurations are not particularly well documented. Below we give an example of a configuration to use gmail as a relay host.\n\nAfter setting the configurations, start/enable the nullmailer.service.\n\n"
    },
    {
      "title": "Example: gmail",
      "level": 3,
      "content": "In the file /etc/nullmailer/remotes you need to set the connection to the relay host. For gmail:\n\n```\n/etc/nullmailer/remotes\n```\n\n```\nsmtp.gmail.com smtp --port=465 --auth-login --user=gmail_address --pass=password --ssl\n```\n\nYou can also use starttls.\n\nIn the file /etc/nullmailer/me, you need to encode the hostname of your computer.\n\nIn the file /etc/nullmailer/defaultdomain, you need to set the gmail domain:\n\n```\n/etc/nullmailer/defaultdomain\n```\n\n```\ngmail.com\n```\n\nNote: in the journal, this might refer to this file.\n\n```\nCondition check resulted in Nullmailer relay-only MTA being skipped.\n```\n\nin the journal, this might refer to this file.\n\n"
    },
    {
      "title": "Other configurations",
      "level": 3,
      "content": "In the file /etc/nullmailer/pausetime you can set the minimum time to pause between successive queue runs when there are messages in the queue, in seconds. This defaults to 60, which for a travelling laptop is way too soon. You can set this to one hour for example:\n\n```\n3600\n```\n\nIn the file /etc/nullmailer/sendtimeout you can set how long nullmailer tries to send a particular message before giving up. The default is one hour, 3 minutes might be a more reasonable cutoff:\n\n```\n180\n```\n\n"
    },
    {
      "title": "Testing",
      "level": 2,
      "content": "You can test the configuration by sending a test email:\n\n```\n$ echo \"Subject: sendmail test\" | sendmail -v recipient_address\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official page, only a reference to a mailing list: untroubled.org/nullmailer.\n- A \"for Dummies\" style blog post with useful configuration tips: www.troubleshooters.com/linux/nullmailer.\n\n"
    }
  ]
}