{
  "title": "Oblogout",
  "url": "https://wiki.archlinux.org/title/Oblogout",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Openbox\n- Window manager\n\nOblogout is an optional, configurable logout script that presents a graphical interface (i.e. buttons) to cancel, logout, restart, shutdown, suspend, hibernate, and lock the screen.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the oblogout-py3-gitAUR package.\n\nAlthough Oblogout may be used with a range of window managers, this article will focus on its use with the Openbox window manager. It may be executed as keybind and/or as a desktop menu entry.\n\n"
    },
    {
      "title": "Keybind",
      "level": 2,
      "content": "To execute the script by pressing Super+x (i.e. create a keybind for it), edit ~/.config/openbox/rc.xml to add the following to the appropriate part of the <keyboard> section:\n\n```\n<keybind key=\"W-x\">\n <action name=\"Execute\">\n  <startupnotify>\n   <enabled>true</enabled>\n  </startupnotify>\n  <command>oblogout</command>\n </action>\n</keybind>\n```\n\n"
    },
    {
      "title": "Screen locking",
      "level": 2,
      "content": "It will be necessary to edit /etc/oblogout.conf to change the lock = command under the [commands] section, in order to execute the desired package installed for this purpose.\n\nFor example, where having installed XScreenSaver - which must itself also be autostarted as a Daemon process in the ~/.config/openbox/autostart file - then /etc/oblogout.conf would be edited accordingly:\n\n```\nlock = xscreensaver-command --lock\n```\n\nOtherwise, where a package such as xlockmore has been installed - which does not need to be autostarted - then an example of the necessary command (to lock with a blank screen) would be:\n\n```\nlock = xlock -mode blank\n```\n\n"
    },
    {
      "title": "Button theme",
      "level": 2,
      "content": "The default button theme is oxygen. A few other themes are also available, including the pre-installed (and more elegant) foom. To change the button theme, edit /etc/oblogout.conf and change the buttontheme = command under the [looks] section. An example has been provided below for foom:\n\n```\nbuttontheme = foom\n```\n\n"
    },
    {
      "title": "Button display",
      "level": 2,
      "content": "Default buttons are available to cancel, logout, restart, shutdown, suspend, hibernate, and lock the screen. Each button also has a configurable shortcut key assigned (e.g. once oblogout has been executed, the system may then be shutdown by pressing the s key, for example).\n\nBoth the buttons presented and their order may be configured to suit personal preference. To do so, edit/etc/oblogout.conf and change the buttons = command under the [looks] section. In the example below, the suspend and hibernate buttons have been removed:\n\n```\nbuttons = cancel, logout, lock, restart, shutdown\n#buttons = cancel, logout, restart, shutdown, suspend, hibernate, lock\n```\n\nWhere removing or adding buttons, it will also be necessary to amend the appropriate shortcut key commands under the [shortcuts] section. Not doing so will mean, for example, that it will still be possible to execute certain functions via the keyboard even where the buttons for them have been removed. For the example provided above, it will be necessary to comment out the suspend and hibernate shortcuts:\n\n```\n[shortcuts]\ncancel = Escape\nshutdown = S\nrestart = R\n#suspend = U\nlogout = L\nlock = K\n#hibernate = H\n```\n\n"
    },
    {
      "title": "Dual Head",
      "level": 2,
      "content": "When using multiple monitors, oblogout may cover all monitors. If you only want oblogout to appear on one monitor, you can create an application rule in the Openbox rc.xml file to set oblogout's position and size.\n\nFor example, if you have two monitors, and you only want oblogout to appear on the first monitor, add to the applications section:\n\n```\n~/.config/openbox/rc.xml\n```\n\n```\n<applications>\n  <application class=\"oblogout\">\n    <position force=\"yes\">\n      <monitor>1</monitor>\n    </position>\n    <fullscreen>yes</fullscreen>\n  </application>\n  ...\n</applications>\n```\n\n"
    }
  ]
}