{
  "title": "Oidentd",
  "url": "https://wiki.archlinux.org/title/Oidentd",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "oidentd is an ident (RFC:1413 compliant) daemon that runs on Linux, Darwin, FreeBSD, OpenBSD, NetBSD and Solaris. oidentd can handle IP masqueraded/NAT connections on Linux, Darwin, FreeBSD (ipf only), OpenBSD and NetBSD. oidentd has a flexible mechanism for specifying ident responses. Users can be granted permission to specify their own ident responses. Responses can be specified according to host and port pairs.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the oidentd package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "With no global nor user configuration file(s), the users' ident replies will be that of their login name. This makes configuration files optional. See oidentd.conf(5) for more detail.\n\n"
    },
    {
      "title": "Global configuration",
      "level": 3,
      "content": "You may create the global configuration file /etc/oidentd.conf.\n\nAccording to the manual, the following is suitable for a global configuration.\n\n```\n/etc/oidentd.conf\n```\n\n```\ndefault {\n     default {\n          deny spoof\n          deny spoof_all\n          deny spoof_privport\n          allow random\n          allow random_numeric\n          allow numeric\n          allow hide\n     }\n}\nuser root {\n     default {\n          force reply \"UNKNOWN\"\n     }\n}\n```\n\nWhich says, \"Grant all users the ability to generate random numeric ident replies, the ability to generate numeric ident replies, and the ability to hide their identities on all ident queries. Explicitly deny the ability to spoof ident responses. And reply with `UNKNOWN' for all successful ident queries for root.\"\n\n"
    },
    {
      "title": "User configuration",
      "level": 3,
      "content": "Additionally and/or alternatively, each user may create their own local configuration file, $HOME/.oidentd.conf.\n\n```\n~/.oidentd.conf\n```\n\n```\nglobal { reply \"unknown\" }\nto irc.example.org { reply \"example\" }\n```\n\nWhich says, \"Reply with `unknown' to all successful ident lookups, but reply with `example' to ident lookups for connections to irc.example.org.\"\n\nThe global configuration file will dictate what works in the user's local configuration file.\n\n"
    },
    {
      "title": "Starting oidentd",
      "level": 2,
      "content": "With oidentd installed and configured, start oidentd.socket to start the daemon. If you want to have oidentd start up automatically every time you start your computer, then you need to enable oidentd.socket.\n\n"
    }
  ]
}