{
  "title": "OpenDoas",
  "url": "https://wiki.archlinux.org/title/OpenDoas",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Users and groups\n- sudo\n- List of applications/Security#Privilege elevation\n\nOpenDoas is a portable version of OpenBSD's doas command, known for being substantially smaller in size compared to sudo. Like sudo, doas is used to assume the identity of another user on the system.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the opendoas package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "To begin using doas as a non-privileged user, it must be properly configured. See #Configuration.\n\nTo use doas, simply prefix a command and its arguments with doas and a space:\n\n```\n$ doas cmd\n```\n\nFor example, to use pacman:\n\n```\n$ doas pacman -Syu\n```\n\nTo get to an interactive shell as an other user (omitting -u user will default to root):\n\n```\n$ doas -su user\n```\n\nLogging in as an other user is needed for some commands, see Sudo#Login shell.\n\nFor more information, see doas(1).\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "After installing OpenDoas, it will be attached with PAM, but no default configuration or examples are included.\n\nTo allow members of group wheel to run commands as other users, create a configuration file with the following content:\n\n```\n/etc/doas.conf\n```\n\n```\npermit setenv {PATH=/usr/local/bin:/usr/local/sbin:/usr/bin:/usr/sbin} :wheel\n```\n\n- The configuration file must end with a newline.\n- The setenv option works around an issue arising from OpenDoas's BSD origin where additional system packages are stored under /usr/local/bin. In Linux /usr/local/bin is generally used to override executables so it comes before /usr/bin which contains executables from packages.\n\nThe owner and group for /etc/doas.conf should both be 0, file permissions should be set to 0400:\n\n```\n# chown -c root:root /etc/doas.conf\n# chmod -c 0400 /etc/doas.conf\n```\n\nTo check /etc/doas.conf for syntax errors, run:\n\n```\n# if doas -C /etc/doas.conf; then echo \"config ok\"; else echo \"config error\"; fi\n```\n\nTo allow members of the plugdev group to run smartctl without password as Root user:\n\n```\n/etc/doas.conf\n```\n\n```\npermit nopass :plugdev as root cmd /usr/bin/smartctl\n```\n\nThe general syntax form of /etc/doas.conf is:\n\n```\npermit|deny [options] identity [as target] [cmd command [args ...]]\n```\n\nThe last matching rule determines the action taken, so rules must be ordered accordingly.\n\nFor more details please read doas.conf(5).\n\n"
    },
    {
      "title": "doas persist feature",
      "level": 3,
      "content": "doas provides a persist feature: after the user successfully authenticates, they will not be prompted for a password again for 5 minutes. It is disabled by default, enable it with the persist option:\n\n```\n/etc/doas.conf\n```\n\n```\npermit persist setenv {PATH=/usr/local/bin:/usr/local/sbin:/usr/bin:/usr/sbin} :wheel\n```\n\nExecuting doas -L clears a persisted authentication prior to its automatic timeout.\n\n"
    },
    {
      "title": "Smooth transition sudo to doas",
      "level": 3,
      "content": "For a smooth transition from sudo to doas and to stay downward compatible, you could add to your environment:\n\n```\nalias sudo='doas'\nalias sudoedit='doas rnano'\n```\n\nOr alternatively, symlink doas to where sudo would normally be (but it does not provide sudoedit command):\n\n```\n# ln -s $(which doas) /usr/bin/sudo\n```\n\nAnother way is to install doas-sudo-shimAUR, which emulates a couple of sudo's options.\n\n```\n/etc/doas.conf\n```\n\n```\npermit setenv { XAUTHORITY LANG LC_ALL } :wheel\n```\n\n"
    },
    {
      "title": "Bash tab completion",
      "level": 3,
      "content": "By default Bash will only tab complete files and directories within the current or referenced directory. To tell Bash to complete arguments as if they were separate commands (also leveraging the tab completion settings of other commands) the following can be added to either the users .bashrc, or the global /etc/bash.bashrc:\n\n```\n~/.bashrc\n```\n\n```\ncomplete -cf doas\n```\n\nIf bash-completion is installed, the following can be used instead to allow for additional completion of the target command:\n\n```\n~/.bashrc\n```\n\n```\ncomplete -F _command doas\n```\n\n"
    }
  ]
}