{
  "title": "Panasonic CF-SZ5",
  "url": "https://wiki.archlinux.org/title/Panasonic_CF-SZ5",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad | PS/2 | Partial\nGPU | 8086:1916 | Yes\nWebcam | 5986:054c | Yes\nInfrared Camera |  | Untested\nEthernet | 8086:156f | Yes\nBluetooth | 8087:0a2b | Yes\nCard reader | 1217:8520 | Yes\nAudio | 8086:9d70 | Yes\nWireless | 8086:24f3 | Yes\nFingerprint reader |  | Untested\nTPM |  | Yes\nLight sensor |  | Untested\n\nNote: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The BIOS setup and battery calibration utility have a standard text based UI, only the keyboard is required to interact with both programs. The menus should be easy to OCR. The Esc or Del key can be used to enter BIOS setup, and F9 can be used to enter the built-in battery calibration utility.\n\n- To restore factory default settings, press F9 in BIOS setup.\n- To save changes and reboot, press F10 in BIOS setup.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "fwupd detects the device, but fails to provide any firmware updates. Firmware updates for BIOS, ME and EC can be downloaded from Panasonic's official website.\n\n"
    },
    {
      "title": "Battery",
      "level": 2,
      "content": "Battery can be swapped while the system is connected to external power and in sleep state without causing the system to lose power. ECO mode state (80% Charging restriction to preserve battery life) will persist across reboots and in Linux if toggled on in the Panasonic PC Settings Utility under Windows.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "See Panasonic CF-SV9#Touchpad.\n\n"
    },
    {
      "title": "TPM",
      "level": 2,
      "content": "CF-SZ5 has a SLB9660VQ1.2 TPM 1.2 onboard, which can be unofficially upgraded to support TPM 2.0 for better integrations with systemd. BIOS version V3xxL25 and later have built in TPM 2.0 support and is able to interact with the TPM upon upgrade. A firmware upgrade tool from Supermicro can be used to perform the upgrade. A detailed blog post provides instructions to perform an Infineon TPM upgrade.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Panasonic CF-SV9\n\n"
    }
  ]
}