{
  "title": "Powerdown",
  "url": "https://wiki.archlinux.org/title/Powerdown",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Laptop\n- Laptop Mode Tools\n- Powertop\n\nTLP is a feature-rich command line utility for Linux, saving laptop battery power without the need to delve deeper into technical details.\n\nTLP's default settings are already optimized for battery life and implement Powertop's recommendations out of the box, so additional configuration is not needed. Also, TLP is completely customizable, which means you can get even more power savings or meet your exact requirements.\n\nTLP intentionally excludes some settings from the project, notably Fan speed control and Backlight.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the tlp package. Installing the optional dependencies may help provide additional power saving.\n\nEnable/start tlp.service.\n\nOne should also mask the service systemd-rfkill.service and socket systemd-rfkill.socket to avoid conflicts and ensure proper operation of TLP's radio device switching options.\n\n"
    },
    {
      "title": "Radio Device Wizard (tlp-rdw)",
      "level": 3,
      "content": "When using the Radio Device Wizard (tlp-rdw), it is required to use NetworkManager and enabling NetworkManager-dispatcher.service.\n\nSee TLP settings for details.\n\n"
    },
    {
      "title": "Front end",
      "level": 3,
      "content": "- tlpuiAUR is a GTK user interface for TLP written in Python.\n- slimbookbatteryAUR is a different GTK interface that works with additional drivers like AMD and NVIDIA.\n\n"
    },
    {
      "title": "ThinkPads only",
      "level": 3,
      "content": "Controlling the charge thresholds using D-Bus without root privileges is possible using threshyAUR and its example Qt user interface threshy-guiAUR.\n\n"
    },
    {
      "title": "Before Sandy Bridge (until 2010)",
      "level": 4,
      "content": "For ThinkPads before model year 2011, the tp_smapi kernel module is required. See tp_smapi#Installation for kernel-specific installation instructions.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The configuration file is located at /etc/tlp.conf and provides a largely optimized power saving by default. For a full explanation of options see: TLP settings.\n\n"
    },
    {
      "title": "USB autosuspend",
      "level": 3,
      "content": "When starting TLP with the default configuration, some USB devices such as audio DACs will be powered down when running on battery due to TLP's autosuspend feature. Some devices such as keyboards and scanners are blacklisted from autosuspend by default.\n\nYou may simply want to disable USB autosuspend entirely with the following setting:\n\n```\n/etc/tlp.conf\n```\n\n```\n# Do not suspend USB devices\nUSB_AUTOSUSPEND=0\n```\n\nOr blacklist specific devices from being auto-suspended. See the TLP documentation on USB devices for details.\n\n"
    },
    {
      "title": "Force battery (BAT) configuration",
      "level": 3,
      "content": "When no power supply can be detected, the setting for AC will be used on devices like desktops and embedded hardware.\n\nYou may want to force the battery (BAT) settings when using TLP on these devices to enable more power saving:\n\n```\n/etc/tlp.conf\n```\n\n```\n# Operation mode when no power supply can be detected: AC, BAT.\nTLP_DEFAULT_MODE=BAT\n\n# Operation mode select: 0=depend on power source, 1=always use TLP_DEFAULT_MODE\nTLP_PERSISTENT_DEFAULT=1\n```\n\n"
    },
    {
      "title": "Bumblebee with NVIDIA driver",
      "level": 3,
      "content": "If you are running Bumblebee with NVIDIA driver, you need to disable power management for the GPU in TLP in order to make Bumblebee control the power of the GPU.\n\nDepending on the driver(s) that you are using, blacklist one or more of them, preventing TLP from managing their power state:\n\n```\n/etc/tlp.conf\n```\n\n```\nRUNTIME_PM_DRIVER_DENYLIST=\"nouveau nvidia\"\n```\n\n"
    },
    {
      "title": "PRIME with NVIDIA driver",
      "level": 3,
      "content": "If you are running PRIME with NVIDIA driver, do not disable power management for the GPU in TLP. Instead, you may want to enable power management all the time to prevent your laptop from heating by adding the NVIDIA card PCI ID (lspci | grep NVIDIA) to the variable RUNTIME_PM_ENABLE:\n\n```\n/etc/tlp.conf\n```\n\n```\nRUNTIME_PM_ENABLE=\"01:00.0\"\n```\n\n"
    },
    {
      "title": "PCI(e) runtime power management on AC",
      "level": 3,
      "content": "Enabling runtime power management for PCI(e) bus devices while on AC may improve power saving on some laptops. This is enabled by default on battery, but not on AC. To enable on AC, set:\n\n```\n/etc/tlp.conf\n```\n\n```\nRUNTIME_PM_ON_AC=auto\n```\n\n"
    },
    {
      "title": "Command line",
      "level": 3,
      "content": "TLP provides several command line tools. See TLP commands.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "For debugging you can display information about the currently used Mode(AC/BAT) and applied configurations:\n\n```\n# tlp-stat\n```\n\nSee also the upstream troubleshooting guide.\n\n"
    },
    {
      "title": "hci0: link tx timeout",
      "level": 3,
      "content": "If your bluetooth headphones suddenly stop working and you see this error from dmesg, it may be caused by TLP suspending your device. Add device ID to USB_DENYLIST in /etc/tlp.conf:\n\n```\n# Disable bluetooth autosuspend\nUSB_DENYLIST=\"8087:0aaa\"\n```\n\nGet the device ID for your bluetooth device from lsusb -v. Restart TLP and the bluetooth service.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- TLP - Optimize Linux Laptop Battery Life — Project homepage & documentation\n- Project FAQ\n\n"
    }
  ]
}