{
  "title": "Pufferpanel",
  "url": "https://wiki.archlinux.org/title/Pufferpanel",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Minecraft\n\nFrom Pufferpanel:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the pufferpanel-binAUR package.\n\nIn order to be able to login to the web interface, and configure the installation you will need to create a user:\n\n```\n# pufferpanel user add\n```\n\nThis will bring up a command line interactive prompt.\n\nAfter creating the admin user, you can Start/enable pufferpanel.service.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Pufferpanel configuration can be found under /etc/pufferpanel. Within this directory you will find a config.json file which contains all the configuration for the instance. Email templates can be found within /etc/pufferpanel/email, this allows for the configuration of the notification emails sent to users.\n\nYou can configure the panel through the web interface, by logging in as the administrator account which you created during #Installation and going to the Settings.\n\n"
    },
    {
      "title": "Reverse proxy",
      "level": 3,
      "content": "By default, pufferpanel does not support TLS encryption, it relies on other web servers to reverse proxy to provide TLS support.\n\n- Upstream strongly recommends you to use TLS encryption (https) to prevent accounts credentials being leaked, pufferpanel should never be open to the internet unless reverse proxied.\n- Regardless of the chosen HTTP server, ensure to Start/enable the service, otherwise pufferpanel will not be accessible over HTTPS.\n\n"
    },
    {
      "title": "Nginx",
      "level": 4,
      "content": "Ensure you have installed nginx, then follow the upstream guide [1].\n\n"
    },
    {
      "title": "Apache",
      "level": 4,
      "content": "Ensure you have installed Apache, then follow the upstream guide [2].\n\n"
    },
    {
      "title": "Caddy",
      "level": 4,
      "content": "Ensure you have installed Caddy, then follow the upstream guide [3].\n\n"
    },
    {
      "title": "Database",
      "level": 3,
      "content": "By default, pufferpanel uses a sqlite3 database, located at /var/lib/pufferpanel/database.db.\n\nOther, external databases, are also supported for scalability and redundancy, along with the ability to change the path of the embedded sqlite3 database.\n\n"
    },
    {
      "title": "MySQL/MariaDB",
      "level": 4,
      "content": "Ensure you have installed MariaDB and configured MariaDB, then follow the configuration provided by upstream [4].\n\n"
    },
    {
      "title": "PostgreSQL",
      "level": 4,
      "content": "Ensure you have installed PostgreSQL, followed initial configuration and created a user and database, then follow the configuration provided by upstream [5].\n\n"
    },
    {
      "title": "Microsoft SQL Server",
      "level": 4,
      "content": "Follow the configuration provided by upstream [6].\n\n- Microsoft SQL Server is proprietary unlike the other alternative databases provided above.\n- Not supported by Arch Linux officially, must be installed using mssql-serverAUR AUR package.\n- There is no ArchWiki page for the configuration of Microsoft SQL Server, thus you must follow the Microsoft Documentation.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official documentation\n\n"
    }
  ]
}