{
  "title": "Puppet server",
  "url": "https://wiki.archlinux.org/title/Puppet_server",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Puppet\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "To install puppet server first add the upstream GPG key:\n\n```\n$ gpg --fetch-keys https://yum.puppetlabs.com/RPM-GPG-KEY-puppet-20250406\n```\n\nThen install the puppetserverAUR package. Afterwards, enable and start the puppetserver service.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The Puppet Server's configuration files are stored in /etc/puppetlabs/puppetserver/:\n\n```\n.\n|-- conf.d\n|   |-- auth.conf\n|   |-- global.conf\n|   |-- puppetserver.conf\n|   |-- web-routes.conf\n|   `-- webserver.conf\n|-- logback.xml\n|-- request-logging.xml\n`-- services.d\n    `-- ca.cfg\n```\n\nin conf.d there are:\n\n- auth.conf which allows you to configure what puppet nodes (clients) are allowed to request from the server.\n- global.conf by default just contains the path to the logging configuration file.\n- puppetserver.conf is the main configuration file for the server, it allows you to set the JRuby load path, JRuby gem home path, the puppet master-conf-dir, master-code-dir, master-var-dir, master-run-dir, master-log-dir and most importantly the max-active-instances. It also has a section for adjusting the http-client allowed protocols which enable you to enable or disable the various SSL cipher suites and protocols.\n- web-routes.conf allows you to configure the puppet server's web-routes.\n- webserver.conf allows you to set the listen address, port, authentication type and log file path for the puppet server web interface.\n\nAdditionally, there is the /etc/default/puppetserver configuration file that allows you to tweak the Java Virtual Machine's startup settings, set the user and group the server runs as, the path to the puppet server's files and the configuration path.\n\n"
    },
    {
      "title": "Tuning the server for lower memory usage",
      "level": 3,
      "content": "By default the puppet server allocates 2 gigabytes of RAM for itself, this can be adjusted in /etc/default/puppetserver by editing the JAVA_ARGS.\n\nBy default it is:\n\n```\n-Xms2g -Xmx2g -XX:MaxPermSize=256m\n```\n\nBut if you are using a server that does not have sufficient RAM spare you can set it to as little as 512 megabytes. Keep in mind though that this will only cater for a small amount of managed servers and you will also need to change the maximum active instances of puppet to 1 in /etc/puppetlabs/puppetserver/puppetserver.conf which limits the number of server's that the server is able to communicate with at once.\n\n"
    },
    {
      "title": "Installing support for hiera eyaml",
      "level": 3,
      "content": "If you wish to use Hiera eyaml on the puppet server you should install the gems for it on the puppet server using the following command:\n\n```\npuppetserver gem install hiera-eyaml\n```\n\nand then restart puppet server.\n\n"
    },
    {
      "title": "Accessing the puppet server web interface",
      "level": 2,
      "content": "The web interface by default listens on https port 8140 on all interfaces. This can be changed by editing the ssl-host and ssl-port configuration options in /etc/puppetlabs/puppetserver/conf.d/webserver.conf.\n\n"
    }
  ]
}