{
  "title": "Questionable edits",
  "url": "https://wiki.archlinux.org/title/Questionable_edits",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "A collection of check lists to be used when performing complex changes to articles or other maintenance operations.\n\n"
    },
    {
      "title": "Move a section within the same page",
      "level": 2,
      "content": "The move should be done in a single edit that does not change anything else:\n\n1. Open the article in an editor.\n1. Cut the text to be moved. Do not save the page now, i.e. do not perform the move in two edits, the first removing the section and the second pasting it, or in the second edit it will seem that you are the author of the section, especially if the accompanying edit summary is not clear.\n1. Paste the cut text at the new position.\n1. Adapt the heading level if needed, but do not make any other adaptations to the content for the moment, otherwise the modifications will not be visible in the resulting edit diff.\n1. Save the page, properly writing the edit summary.\n1. Now you can proceed to editing the section text normally, as required.\n\n"
    },
    {
      "title": "Split section to a new subpage",
      "level": 2,
      "content": "This procedure is useful when moving a section of an article that has become too long to a subpage of that article.\n\n1. Open the origin article section in an editor.\n1. Copy the entire section content.\n1. Open the destination subpage in another editor.\n1. Paste the copied content in the destination editor without modifications.\n1. Save the destination subpage with an edit summary like content split from [[Origin article#Section]]; make sure to include a link to the original page, or it will seem that you are the author of the content.\n1. In the origin editor, replace the split content with a link to the destination subpage either leaving the section heading in place, or adding a link to the Related articles box of the article.\n1. Save the origin page with an edit summary like content moved to [[Destination subpage]].\n1. Re-open the destination subpage in an editor.\n1. Categorize the destination subpage like the origin article.\n1. Add a link to the origin article at the top, for example See [[Origin article]] for the main article.\n1. Adapt the levels of the headings of the new subpage to start from the second level. Tip: This step can be done automatically with Wiki Monkey's plugin.\n1. Save the destination subpage with a proper edit summary.\n\nFurther advanced additional steps:\n\n- Check and fix any broken links to sections in both the origin and destination pages, and in pages linking to the origin page.\n\n"
    },
    {
      "title": "Deal with talk pages after redirecting a page to another",
      "level": 2,
      "content": "If page A has been redirected to page B, for example after merging the content of A into page B, and Talk:A exists:\n\n- If Talk:B does not exist, move the entire Talk:A to Talk:B, letting MediaWiki automatically redirect Talk:A to Talk:B.\n- If Talk:B exists: Move the still relevant discussions, if any, from Talk:A to Talk:B. Ensure that the discussions left in Talk:A, if any, are closed. If Talk:A hosts discussions that have been closed for less than the period specified in Help:Discussion#Closing a discussion, flag Talk:A with Template:Redirect, so that the page will be redirected to Talk:B after the closing period. Else, immediately redirect Talk:A to Talk:B.\n\n1. Move the still relevant discussions, if any, from Talk:A to Talk:B.\n1. Ensure that the discussions left in Talk:A, if any, are closed. If Talk:A hosts discussions that have been closed for less than the period specified in Help:Discussion#Closing a discussion, flag Talk:A with Template:Redirect, so that the page will be redirected to Talk:B after the closing period. Else, immediately redirect Talk:A to Talk:B.\n\n- If Talk:A hosts discussions that have been closed for less than the period specified in Help:Discussion#Closing a discussion, flag Talk:A with Template:Redirect, so that the page will be redirected to Talk:B after the closing period.\n- Else, immediately redirect Talk:A to Talk:B.\n\n"
    },
    {
      "title": "Fix double redirects",
      "level": 2,
      "content": "1. Read this section to understand what redirects are.\n1. Check out Special:DoubleRedirects to see if there are any.\n1. For example, if you see Pastebin Clients (Edit) →‎ Common Applications →‎ List of applications, it means Pastebin Clients redirects to Common Applications, and Common Applications redirects to List of applications. Therefore, Pastebin Clients is a double redirect.\n1. To fix it, edit Pastebin Clients and change #REDIRECT [[Common Applications]] to #REDIRECT [[List of applications]] to skip the middleman.\n1. Enter an edit summary such as Fixed double redirect and save.\n\n"
    },
    {
      "title": "Fix broken package links",
      "level": 2,
      "content": "ArchWiki contains many broken links to packages not found either in official repositories or AUR, which is the result of packages being merged, split or removed from the repositories. All pages in the main namespace are regularly checked by a bot, which checks all instances of AUR, Grp and Pkg templates, tries to automatically update them and marks them with Template:Broken package link when it is not possible to update them automatically.\n\nTo fix a broken package link, do not simply remove the reference to the packages from the wiki, do some research first:\n\n- Search the package database (pacman -Ss) and AUR, it is possible that the package was merged/renamed. For broken packages from the official repositories, you can also search the commits at https://gitlab.archlinux.org/archlinux/packaging/state/-/commits. For broken packages from the AUR, you can look in the aur-request mailing list archives.\n- If looking for a specific file, for example a binary that was part of the package, pkgfile might do the trick.\n- If unsure, mark the page or section with an appropriate status template rather than completely removing the reference to the package.\n\n- For broken packages from the official repositories, you can also search the commits at https://gitlab.archlinux.org/archlinux/packaging/state/-/commits.\n- For broken packages from the AUR, you can look in the aur-request mailing list archives.\n\nTo help with manual updates, each \"broken package link\" template provides a hint:\n\n- \"invalid number of template parameters\" — All AUR, Grp and Pkg templates take exactly one parameter, but the wikitext specified more (or none). In most cases the excessive parameters should be moved to the surrounding text, or removed if already there.\n- \"replaced with [other package]\" — The package was renamed or merged into another, which specifies the old package name in the replaces array. In most cases the old package should be simply replaced with the new one and surrounding text updated accordingly.\n- \"package not found\" — Default hint when none of the above applies.\n\nAll pages with broken package links are tracked in Category:Pages with broken package links. There is also an automatic report page at User:Lahwaacz.bot/Reports/archpkgs.\n\n"
    },
    {
      "title": "Fix broken section links",
      "level": 2,
      "content": "Pages may occasionally contain broken section links, which is the result of sections being renamed, merged, moved or deleted from the pages. All pages in the main namespace are regularly checked by Lahwaacz.bot, which checks all links and marks them with Template:Broken section link when section links are broken.\n\nTo fix a broken section link, do not simply remove the reference to the section links from the wiki, do some research first:\n\n- Looking at the history of the page where the section is located, it is possible that the section was renamed/merged/moved/deleted.\n- If unsure, mark the section with an appropriate status template rather than completely removing the reference to the section.\n\nAll pages with broken section links are tracked in Category:Pages with broken section links.\n\n"
    },
    {
      "title": "Maintenance of listings of applications",
      "level": 2,
      "content": "There are a number of lists of applications articles, mostly at List of applications but it also links to sub pages containing listings, e.g PDF, PS and DjVu. Because of the sheer number of them, listings need constant maintenance due to entries becoming irrelevant, breaking, changing or moving to a different place.\n\nSee #Fix broken package links above and to a lesser degree also #Fix broken section links.\n\nObvious signs for an entry needing maintenance are dead or broken links. A common workflow would be as follows:\n\n1. Is the entry still relevant? E.g a floppy disk manager or token ring networking tool would not be relevant anymore. As are tools for services that ceased to exist, e.g ICQ.\n1. Is it still maintained? Generally, archived repositorites also include an explicit hint that it is unmaintained and abandoned, but if the last commit was many years ago, it counts as the same thing. While some programs are considered finished and will stay in working condition for years to come, this is generally an edge case and software should be actively maintained by upstream. Also consider the state of the package. Does it build? Will it break soon? If you discovered that upstream was archived and it serves no use anymore, because there are better alternatives anyways, you may also want to file a deletion request for the package in the AUR.\n1. Are there alternatives listed? Even if upstream is not in the best condition but it is still usable, you may want to avoid removing (one of the) last entries in a listing. Of course, this depends on the relevance of the listing itself. There is no sense in keeping a listing if all entries stopped working entirely.\n\n1. E.g a floppy disk manager or token ring networking tool would not be relevant anymore.\n1. As are tools for services that ceased to exist, e.g ICQ.\n\n1. Generally, archived repositorites also include an explicit hint that it is unmaintained and abandoned, but if the last commit was many years ago, it counts as the same thing.\n1. While some programs are considered finished and will stay in working condition for years to come, this is generally an edge case and software should be actively maintained by upstream.\n1. Also consider the state of the package. Does it build? Will it break soon? If you discovered that upstream was archived and it serves no use anymore, because there are better alternatives anyways, you may also want to file a deletion request for the package in the AUR.\n\n1. Even if upstream is not in the best condition but it is still usable, you may want to avoid removing (one of the) last entries in a listing. Of course, this depends on the relevance of the listing itself. There is no sense in keeping a listing if all entries stopped working entirely.\n\n"
    },
    {
      "title": "Fix links to archived pages",
      "level": 2,
      "content": "When a page is archived, the guidelines at ArchWiki:Archive#How to archive a page state that all link to the page should be removed prior to archival. In some contexts (in particular for translations, where the context of the sentence does not allow the simple removal of the link without altering the experience of the reader), this might not be done when archiving the page.\n\nTo fix a link to an archived page, do not simply remove the link from the page without doing some research first:\n\n- Adjust the page by replacing the reference to the outdated content with its replacement (e.g. Special:Diff/704983).\n- For a translation where you are fluent enough to update the page, match what has been done to the English page.\n- If unsure, mark the section with an appropriate status template rather than completely removing the link.\n\nAll pages with links to archived pages are tracked in Category:Pages with links to archived pages.\n\n"
    },
    {
      "title": "Archive a page",
      "level": 2,
      "content": "See ArchWiki:Archive#How to archive a page\n\n"
    },
    {
      "title": "Create a new page and its translation",
      "level": 2,
      "content": "See ArchWiki Translation Team#Create a new page and its translation.\n\n"
    },
    {
      "title": "Editing over a redirect",
      "level": 2,
      "content": "See mw:Help:Redirects#Viewing a redirect.\n\n"
    },
    {
      "title": "Move a discussion to another talk page",
      "level": 2,
      "content": "1. Copy the discussion text to the destination talk page, making sure to add, between the new heading and the pasted text, a note like: ''[Moved from [[Origin talk page#Heading]]. -- ~~~~]''\n1. Strike the heading in the origin talk page and replace the content with a note like: ''[Moved to [[Destination talk page#Heading]]. -- ~~~~]''\n\n"
    },
    {
      "title": "Rename a category",
      "level": 2,
      "content": "1. Move the category page the same way as you would move a normal page, ensuring a redirect is created from the old title to the new one. This will only rename the category page itself, the members of the category will not be recategorized.\n1. Recategorize all members of the old category to use the new one. Tip: This can be done automatically with wiki-scripts' recategorize-over-redirect.py, which relies on the redirect from the old category to detect the new name and thus it is not limited to changes in capitalization or similar heuristics.\n1. Update all interlanguage links. Tip: This can be done automatically with wiki-scripts' interlanguage.py or Wiki Monkey's bot plugin.\n1. Update all backlinks of the old category to refer to the new one. Tip: This can be done automatically by running Wiki Monkey's RegExp substitution plugin on the old category's Special:WhatLinksHere page, with a substitution like (\\[\\[|\\{\\{Related2?\\|):[ _]*[Cc]ategory[ _]*:[ _]*[Oo]ld[ _]name[ _]*(#|\\||\\]\\]|\\}\\}) -> $1:Category:New name$2 (assuming the old category name is \"Category:Old name\").\n1. Mark the old category with Template:Archive, without destroying the redirect (the old category is likely still linked from Table of contents). Tip: If the category has no relevant history, it can be deleted by an administrator, after ensuring that steps 2.-4. have actually been performed.\n\n"
    },
    {
      "title": "Remove an entire page",
      "level": 2,
      "content": "- New but inappropriate page: if inappropriate because of spam or other clearly malicious content (evaluation is made by an Administrator), it is deleted right away; in the other cases, e.g. irrelevance to Arch, the article should be: marked with Template:Merge; or marked with Template:Redirect; or marked to be moved as a subpage of its author's User page with Template:Move (or moved right away).\n- Old article become obsolete: mark with one of the following, in order of preference: Template:Merge; Template:Redirect; Template:Archive; wait at least 7 days; in absence of objecting discussions, or when these eventually resolve in favor of removal, perform the proposed action; when redirecting, consider following #Deal with talk pages after redirecting a page to another and #Fix double redirects; when archiving, follow the instructions in ArchWiki:Archive.\n\n- if inappropriate because of spam or other clearly malicious content (evaluation is made by an Administrator), it is deleted right away;\n- in the other cases, e.g. irrelevance to Arch, the article should be: marked with Template:Merge; or marked with Template:Redirect; or marked to be moved as a subpage of its author's User page with Template:Move (or moved right away).\n\n- marked with Template:Merge; or\n- marked with Template:Redirect; or\n- marked to be moved as a subpage of its author's User page with Template:Move (or moved right away).\n\n1. mark with one of the following, in order of preference: Template:Merge; Template:Redirect; Template:Archive;\n1. wait at least 7 days;\n1. in absence of objecting discussions, or when these eventually resolve in favor of removal, perform the proposed action; when redirecting, consider following #Deal with talk pages after redirecting a page to another and #Fix double redirects; when archiving, follow the instructions in ArchWiki:Archive.\n\n- Template:Merge;\n- Template:Redirect;\n- Template:Archive;\n\n- when redirecting, consider following #Deal with talk pages after redirecting a page to another and #Fix double redirects;\n- when archiving, follow the instructions in ArchWiki:Archive.\n\n"
    },
    {
      "title": "Patrolling",
      "level": 2,
      "content": "Checking the recent changes can be done by everybody. Maintenance Team members however can also mark edits and pages as patrolled. This section is primarily about the things everybody can do.\n\nKeep in mind that patrolling the recent changes obviously requires a more constant commitment, while fixing other things is more flexible and can be done whenever you have time.\n\n"
    },
    {
      "title": "Recent changes patrolling",
      "level": 3,
      "content": "There are two main ways you can patrol the recent changes:\n\n- Visiting Special:RecentChanges at regular intervals, checking all the edits that have been made since the previous visit.\n- Subscribing to the Special:RecentChanges Atom feed and checking the edits as soon as you find some time.\n\nFor each edit, or group of edits made to the same page, you should assess if it is questionable, according to your experience and knowledge, also taking into account the list of the most frequent problems.\n\n- If you think the edit requires a quick fix that you can perform immediately, just do it. This especially applies to minor style problems, typos and grammar fixes.\n- If instead the edit is questionable but you cannot fix it, you should look if it has already been flagged with appropriate template: If not, add appropriate template to appropriate section describing the problem. In case there is already a discussion for the edit, see if you can add useful details to the accompanying note or discussion.\n\n- If not, add appropriate template to appropriate section describing the problem.\n- In case there is already a discussion for the edit, see if you can add useful details to the accompanying note or discussion.\n\n- Enable the Group changes by page in recent changes and watchlist setting under Preferences > Recent changes > Advanced options.\n- To follow your watched articles using a feed reader, use the Atom link in the left column of your watchlist page.\n\n"
    },
    {
      "title": "Bot edits",
      "level": 4,
      "content": "MediaWiki does not display edits by bots in the recent changes by default. It may be desirable to check when one of the bots modified pages since it may indicate that changes are necessary. The bots flag broken package links, broken section links and dead links.\n\nIt is highly recommended to fix the flagged things as soon as they appear before they get buried under a ton of changes. This also applies to dead links, which are usually external resources.\n\n"
    },
    {
      "title": "Abuse",
      "level": 4,
      "content": "Fortunately, spam and other things that violate the Code of conduct are quite uncommon, but it will still happen occasionally.\n\nThe most important task is also applying here. Make sure to fight abuse immediately:\n\n1. First and foremost, undo all the damage.\n1. Contact the Maintenance Team. You can also do so by joining the ArchWiki IRC channel and mentioning the administrators, which are usually all channel operators.\n\nIf there is a wave of abuse and undoing the damage would take too long, report it first.\n\n"
    },
    {
      "title": "Content-related",
      "level": 4,
      "content": "- Removal of useful content: undo or contact the author.\n- Unexplained modification or removal of content: contact the author, undo if there is no reaction.\n- Major modification (usually in a single bulky edit) without sufficient explanation: contact the author.\n\n"
    },
    {
      "title": "Style-related",
      "level": 4,
      "content": "- Signature, credits, personal observations in articles: undo or move to talk page.\n- Start headings from level 1: move all sections up 1 level.\n- Uncategorized new article: add category and fix header.\n- Improper use of templates: fix according to Help:Style.\n- Addition of installation instructions: undo or comply with Help:Style.\n\n"
    },
    {
      "title": "The MediaWiki patrolling feature",
      "level": 3,
      "content": "Marking changes as patrolled is a very useful way to avoid doing things twice when not necessary. Every member of the Maintenance Team is encouraged to make use of this feature to save the time of others.\n\nSometimes, especially when someone does not have experience with a topic, it is not clear if one should mark the edit as patrolled or not. Not marking an edit as patrolled means that other members of the Maintenance Team are more likely to look at the change. Here are some tips which may help to patrol more changes:\n\n- Typos, grammar or language fixes are usually very easy to validate. Take care of them first if possible.\n- Additions to talk pages can be marked as patrolled if they make sense (appropriate for the topic, e.g discussing games on a page about the archiso is not appropriate).\n- User pages may contain anything as long as it does not violate any rules. They are unfortunately basically exempt from most style guidelines.\n- Any developer may do anything in the DeveloperWiki.\n- Translations are hard to check if the language in question is not known. One can use DeepL to check if the translation is roughly correct. Checking translations of very new users helps to find low-quality edits and vandalism.\n- Mistakes happen. If a user notices a mistake of them and undos their own edit, it is alright to mark both of them as patrolled.\n- Mark edits which were reverted by a member of the maintenance team as patrolled, as the one who reverted the edit likely just forgot it.\n- New pages may be incomplete and/or have style issues. Mark it as patrolled if it fits into the ArchWiki. Consider watching this page and make sure to take care of it if it gets abandoned.\n\nAll of these points imply that the change must not violate the code of conduct or the rules described in ArchWiki:Contributing.\n\n"
    },
    {
      "title": "Other",
      "level": 3,
      "content": "There are other things which need to be taken care of:\n\n- Check the list of newly created accounts to see if any of them edited yet. Edits made by very new editors should always be checked since the editor may not be familiar with all guidelines yet.\n- Make sure any additions to talk pages are signed. Sometimes, users are not aware of the Add topic button on a talk page. Make sure new discussions are placed at the bottom and have an appropriate section name. If the edit summary looks like →Some section: new section, the user used the Add topic button. If a user consistently adds new sections manually, feel free to remind them that there is the more convenient Add topic button.\n- Blankings and edits with very large differences should always be investigated.\n- New pages are also worth a look, improving them and fixing style issues sets a good example and helps the author.\n- Make sure that edits which modify tables do not break them by e.g inserting a stray column.\n- Edits without a proper edit summary need special attention. There is also Template:Editsum if the user is not using edit summaries properly.\n- Undos are a common sight but should still be checked.\n\n- Sometimes, users are not aware of the Add topic button on a talk page. Make sure new discussions are placed at the bottom and have an appropriate section name.\n- If the edit summary looks like →Some section: new section, the user used the Add topic button.\n- If a user consistently adds new sections manually, feel free to remind them that there is the more convenient Add topic button.\n\n"
    },
    {
      "title": "Request solving",
      "level": 2,
      "content": "See ArchWiki talk:Requests.\n\n- If you think you can fix the request, just do it and remove appropriate templates. See also #Common problems and solutions.\n- If otherwise you feel it is better to contact the author of the questionable edit, write them a message in his talk page, or send them an email in order to request an explanation or discuss further.\n\n- Prefer trying to fix the oldest requests.\n- Prefer fixing content-related over style-related issues.\n- You may consider using an editor assistant (e.g. Wiki Monkey's Editor configuration) in order to solve some common style issues automatically.\n\n"
    }
  ]
}