{
  "title": "Raccourcis clavier",
  "url": "https://wiki.archlinux.org/title/Raccourcis_clavier",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Cet article fournit une liste de raccourcis clavier (peu connus) par défaut et fournit des informations sur la personnalisation par l'utilisateur.\n\n"
    },
    {
      "title": "Noyau (SysRq)",
      "level": 3,
      "content": "Il existe plusieurs raccourcis de bas niveau qui sont implémentés dans le noyau via la touche sysrq et qui peuvent être utilisés pour le débogage et la récupération d'un système qui ne répond pas. Dans la mesure du possible, il est recommandé d'utiliser ces raccourcis plutôt que d'effectuer un arrêt brutal (en maintenant le bouton d'alimentation enfoncé pour éteindre complètement le système).\n\nConsultez l'article de Wikipedia sur lestouche magique SysRq pour plus de détails.\n\n"
    },
    {
      "title": "Activation",
      "level": 4,
      "content": "systemd possède le bitmask de permissions sysrq défini à 0x10 par défaut, qui ne permet pas la signalisation aux processus ou le redémarrage, entre autres choses. Pour permettre l'utilisation complète de la clé sysrq sur votre système, ajoutez kernel.sysrq = 1 à votre configuration de sysctl. Les valeurs supérieures à 1 peuvent être utilisées pour activer sélectivement les fonctions sysrq ; consultez la documentation du noyau Linux pour plus de détails. Si vous voulez être sûr qu'il sera activé avant même que les partitions soient montées et dans l'initrd, ajoutez sysrq_always_enabled=1 à vos paramètres du noyau.\n\nNotez que si vous modifiez le paramètre par ces méthodes, les changements persisteront lors des redémarrages. Si vous voulez essayer de modifier les paramètres sysrq pour votre session actuelle uniquement, vous pouvez exécuter soit sysctl kernel.sysrq=1 soit echo \"1\" > /proc/sys/kernel/sysrq.\n\nL'activation complète de la clé sysrq comporte des risques de sécurité évidents. En plus de forcer les redémarrages et autres, elle peut être utilisée pour vider le contenu des registres du CPU, ce qui pourrait théoriquement révéler des informations sensibles. Étant donné que son utilisation nécessite un accès physique au système (à moins que vous ne l'ayez volontairement mis en place), la plupart des utilisateurs d'ordinateurs de bureau considéreront probablement que le niveau de risque est acceptable. Cela dit, assurez-vous de bien comprendre les implications de son activation et la dynamique du contexte plus large dans lequel votre système fonctionne avant d'activer sysrq complètement.\n\n"
    },
    {
      "title": "Redémarrer",
      "level": 4,
      "content": "Un idiome commun pour s'en souvenir est \"Reboot Even If System Utterly Broken\" (également appelé \"REISUB\"). On peut aussi penser que c'est \"BUSIER\" à l'envers.\n\nTable content:\nKeyboard Shortcut | Description | Code to Enable | Other Functions Enabled\nAlt+SysRq+r Unraw | Take control of keyboard back from X. | 4 | Alt+SysRq+k SAK\nAlt+SysRq+e Terminate | Send SIGTERM to all processes, allowing them to terminate gracefully. | 64 | Alt+SysRq+f OOM kill Alt+SysRq+j Thaw\nAlt+SysRq+i Kill | Envoyer SIGKILL à tous les processus, les forçant à se terminer immédiatement.\nAlt+SysRq+s Sync | Synchroniser les données sur le disque. | 16 | -\nAlt+SysRq+u Démonter | Démontez et remontez tous les systèmes de fichiers en lecture seule. | 32 | -\nAlt+SysRq+b Redémarrer | Reboot | 128 | -\n\nPar exemple, pour activer de manière sélective uniquement la fonction de redémarrage, définissez kernel.sysrq à 128. L'ensemble des fonctions REISUB peut être activé en lui attribuant la valeur 244, bien que cela active également les fonctions supplémentaires listées dans la dernière colonne du tableau. Pour plus de documentation, consultez la documentation sur la clé sysrq, et le fichier source du noyau /drivers/tty/sysrq.c.\n\n"
    },
    {
      "title": "Tuer un processus gourmand en mémoire",
      "level": 4,
      "content": "Alt+SysRq+f peut être utilisé pour invoquer le OOM (out-of-memory) killer sans provoquer de panique du noyau si rien ne peut être tué. Le tueur OOM utilise un ensemble d'heuristiques pour choisir le processus relativement non vital qui utilise le plus de mémoire et le tuer. C'est très utile pour tuer un processus qui bloque votre système en provoquant des battements excessifs, comme un script de navigateur qui s'emballe, et peut éviter la nécessité d'un redémarrage dans de nombreux cas. Notez que le tueur OOM peut cibler une grande variété de processus en dépit de ses heuristiques bien intentionnées et peut être quelque peu imprévisible, donc soyez prudent avant de l'appeler avec désinvolture.\n\n"
    },
    {
      "title": "Dépannage",
      "level": 4,
      "content": "- Si vous utilisez un gestionnaire d'affichage et qu'après Alt+SysRq+e vous êtes présenté avec l'écran de connexion (ou le bureau complet si l'autologin est activé), cela est très probablement causé par la directive Restart=always dans le fichier service concerné. Si nécessaire, éditez l'unité, cependant cela ne devrait pas empêcher la séquence \"REISUB\" de fonctionner.\n- Si toutes les combinaisons ci-dessus fonctionnent sauf Alt+SysRq+b, essayez d'utiliser la touche Alt du côté opposé de votre clavier.\n- Sur les ordinateurs portables qui utilisent la touche Fn pour différencier SysRq de PrtScrn, il peut ne pas être nécessaire d'utiliser la touche Fn (par exemple, Alt+PrtSc+ lettre pourrait fonctionner).\n- Sur les ordinateurs portables Lenovo, la touche SysRq est souvent configurée comme Fn+S. Pour l'utiliser, maintenez la touche Alt enfoncée, puis appuyez sur Fn+s, relâchez Fn et s en maintenant toujours Alt, puis appuyez sur les touches ci-dessus.\n- Vous devrez peut-être appuyer sur Ctrl en même temps que Alt. Ainsi, par exemple, le raccourci clavier complet serait Ctrl+Alt+SysRq+b.\n\n"
    },
    {
      "title": "Console Linux",
      "level": 3,
      "content": "Consultez Linux console#Keyboard shortcuts.\n\n"
    },
    {
      "title": "Xorg et Wayland",
      "level": 3,
      "content": "Table content:\nRaccourci clavier | Description | Notes\nCtrl+Alt+F1, F2, F3, ... | Passer à la n-ième console virtuelle. | Si cela ne fonctionne pas, essayez Ctrl+Alt+Fn+F….\nShift+Insert Mouse Button 2 | Coller du texte à partir du Tampon PRIMAIRE. | Par défaut, Qt affecte Shift+Insert au CLIPBOARD au lieu du tampon PRIMAIRE (consultez par exemple [1]) et Ctrl+Shift+Insert est affecté au tampon PRIMAIRE.\n\n"
    },
    {
      "title": "Readline",
      "level": 3,
      "content": "Readline est une bibliothèque couramment utilisée pour l'édition de lignes ; elle est utilisée par exemple par Bash, FTP, et bien d'autres (consultez les détails du paquet readline dans \"Required By\" pour plus d'exemples). Il possède des modes d'édition semblables à Emacs et vi qui peuvent être personnalisés avec des séquences d'échappement. Les combinaisons de touches par défaut sont listées dans readline(3) et dans la documentation.\n\n"
    },
    {
      "title": "Zsh",
      "level": 3,
      "content": "Zsh utilise ZLE pour associer des raccourcis aux widgets, scripts et commandes.\n\n"
    },
    {
      "title": "Xorg",
      "level": 3,
      "content": "Consultez Xorg (Français)/Keyboard configuration (Français)#Options XKB fréquemment utilisées pour certains raccourcis courants, qui sont désactivés par défaut.\n\nLorsque nous sommes dans un environnement graphique, nous pouvons vouloir exécuter une commande lorsqu'une certaine combinaison de touches est pressée (c'est-à-dire lier une commande à une keysym). Il existe plusieurs façons de le faire :\n\n- La manière la plus portable en utilisant des outils de bas niveau, tels que acpid. Toutes les touches ne sont pas prises en charge, mais une configuration uniforme est possible pour les touches du clavier, la connexion de l'adaptateur d'alimentation et même les événements de (dé)branchement de la prise casque. Il est également difficile d'exécuter correctement des programmes dans une session X.\n- La méthode universelle utilisant les utilitaires Xorg (par exemple Xbindkeys) et éventuellement votre environnement de bureau ou vos outils de gestion de fenêtres.\n- La manière plus rapide en utilisant un programme tiers pour tout faire dans l'interface graphique, comme le Centre de contrôle Gnome.\n\n"
    },
    {
      "title": "sxhkd",
      "level": 4,
      "content": "Un daemon de touches de raccourci X simple avec une syntaxe de configuration puissante et compacte. Consultez sxhkd pour plus de détails.\n\n"
    },
    {
      "title": "actkbd",
      "level": 4,
      "content": "Selon la page d'accueil actkbd :\n\nUn exemple de configuration et un guide sont disponibles ici.\n\n"
    },
    {
      "title": "xbindkeys",
      "level": 4,
      "content": "Xbindkeys permet un mappage avancé des touches à des actions indépendamment de l'environnement de bureau.\n\n"
    },
    {
      "title": "Environnements de bureau",
      "level": 3,
      "content": "- LXDE (Français)#Raccourcis clavier\n- Xfce#Keyboard shortcuts\n\n"
    },
    {
      "title": "Gestionnaires de fenêtres",
      "level": 3,
      "content": "- Fluxbox (Français)#Raccourcis clavier\n- Openbox (Français)#Raccourcis clavier\n- I3 (Français)#Raccourcis clavier\n\n"
    },
    {
      "title": "Raccourci clavier pour coller la sélection de X",
      "level": 3,
      "content": "Les utilisateurs qui préfèrent travailler avec le clavier plutôt qu'avec la souris peuvent bénéficier d'un raccourci à l'opération de collage du bouton central de la souris. Ceci est particulièrement utile dans un environnement centré sur le clavier. Voici un exemple de flux de travail :\n\n1. Dans Firefox, sélectionnez une chaîne de caractères que vous souhaitez rechercher dans Google (avec la souris).\n1. Appuyez sur Ctrl+k pour entrer dans le champ \"moteur de recherche\".\n1. Appuyez sur F9 pour coller le tampon, au lieu de déplacer le pointeur de la souris sur le champ et de cliquer avec le bouton central pour coller.\n\nLa méthode proposée ici utilise les trois paquets suivants : :\n\n- xsel pour donner accès au contenu de la sélection de X.\n- Xbindkeys pour associer une frappe de touche à une action.\n- xvkbdAUR pour transmettre la chaîne du tampon à l'application en émulant l'entrée du clavier.\n\nCet exemple associe l'opération x-selection-paste à la touche F9 :\n\n```\n.xbindkeysrc\n```\n\n```\n\"xvkbd -no-jump-pointer -xsendevent -text \"\\D1`xsel`\" 2>/dev/null\"\n    F9\n```\n\nLe code \"\\D1\" fait précéder l'insertion du tampon de sélection d'une pause de 100 ms (consultez la page d'accueil xvkbd).\n\nLes codes des touches autres que F9 peuvent être déterminés en utilisant xbindkeys -k.\n\nRéférences :\n\n- Collage du contenu de la sélection X (et non du presse-papiers) avec le clavier.\n- page d'accueil de xvkbd.\n\n"
    },
    {
      "title": "Gestionnaire de fenêtres XMonad",
      "level": 4,
      "content": "Dans le gestionnaire de fenêtres xmonad, il existe une fonction intégrée permettant de coller le contenu du tampon de sélection X. Pour lier cette fonction à une autre fonction, il suffit d'utiliser le clavier. Afin de lier cette fonction à une touche (ici la touche Insert), la configuration suivante peut être utilisée :\n\n```\nxmonad.hs\n```\n\n```\nimport XMonad.Util.Paste\n...\n  -- X-selection-paste buffer\n  , ((0,                     xK_Insert), pasteSelection) ]\n```\n\n"
    },
    {
      "title": "Trucs et astuces",
      "level": 2,
      "content": "- Si vous aimez un flux de travail centré sur le clavier, vous pourriez également apprécier un gestionnaire de fenêtre en pavage.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Guide de l'administrateur débutant de Linux - Raccourcis et commandes\n- Le clavier et la console Linux - Guide pratique\n\n"
    }
  ]
}