{
  "title": "Radicale",
  "url": "https://wiki.archlinux.org/title/Radicale",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- DAViCal\n\nRadicale is a server designed to support the CalDav and CardDav protocols. It operates either as a standalone package using its own internal http server or can be integrated with an existing webserver.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the radicale package.\n\nThe package creates the radicale user and service as per the Radicale systemd instructions, along with the /var/lib/radicale/collections data folder, so you can just enable radicale.service.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The easiest thing is to follow the instructions at the Radicale website.\n\nThe main configuration file is located at /etc/radicale/config\n\nIf this is setup on a remote / headless system, consider adding the hosts option to enable remote access to the built-in web interface.\n\nMany of the configuration options can be changed on the command-line:\n\n```\n$ radicale --help\n```\n\n"
    },
    {
      "title": "Authentication",
      "level": 3,
      "content": "By default, anyone can access the web interface and create address books or calendars, so authentication should be considered.\n\nAuthentication is controlled by /etc/radicale/users which can use Apache httpasswd formatted passwords (as well as plaintext & other options). If you are not planning to install Apache HTTP Server, you can just use an online htpasswd generator to generate the user:password hashes.\n\n"
    },
    {
      "title": "Non-default Storage Location",
      "level": 3,
      "content": "By default, the Radicale package comes configured to store data in /var/lib/radicale/collections. If you want to change this you can specify another location in the configuration file but you must also adjust the systemd configuration. The included radicale.service file sets ProtectSystem=strict which means systemd won't allow the service read-write access to any area outside /var/lib/radicale/. To get around this create a drop-in file with the following contents:\n\n```\n/etc/systemd/system/radicale.service.d/override.conf\n```\n\n```\n[Service]\nReadWritePaths=/path/to/storage\n```\n\nYou can now tell Radicale to use your chosen location by editing the config file as in the Radicale documentation:\n\n```\n/etc/radicale/config\n```\n\n```\n[storage]\nfilesystem_folder = /path/to/storage\n```\n\nChanging /path/to/storage in both files to your chosen location.\n\n"
    },
    {
      "title": "Web Servers",
      "level": 3,
      "content": "Radicale provides its own web server (initially restricted to localhost only, accessible at localhost:5232 with any username and password), but it can be integrated with HTTP webservers like Apache HTTP Server via Reverse Proxy or the WSGI interface.\n\n"
    },
    {
      "title": "Client support",
      "level": 2,
      "content": "Since it uses the CalDav and CardDav protocols, it should support most clients, particularly the officially supported.\n\nThe following list may or may not be accurate:\n\n- Thunderbird To add calendars, on the calendar view click on \"New Calendar\" -> On the network, in the location field add the root address radicale is listening to, for instance http://localhost:5232, not the address of a single calendar, and Thunderbird will automatically discover all the calendars shared by radicale\n- GNOME/Evolution, Contacts and Calendar\n- KOrganizer (korganizer)\n- InfCloud (infcloudAUR), CalDavZAP, CardDavMATE\n- syncEvolution (syncevolutionAUR)\n- DAVx⁵, Infomaniak kSync, Simple Contacts Pro SE for Android (ICSx⁵ will also works for single calendars, but DAVx⁵ is highly recommended over it for full experience, as will automatically detect all calendars and addressbooks that radicale exposes).\n- Mac OSX Calendar/Contacts\n- Apple iOS Note that iOS requires a SSL in order to sync CalDAV/CarDAV (as of iOS14 self-signed SSL is sufficient for Radicale to integrate as an account) [1], this can be created by following the instructions in OpenSSL#Generate a self-signed certificate with private key in a single command. Note also that key sizes must be greater than 2048 bits [2]\n\n- To add calendars, on the calendar view click on \"New Calendar\" -> On the network, in the location field add the root address radicale is listening to, for instance http://localhost:5232, not the address of a single calendar, and Thunderbird will automatically discover all the calendars shared by radicale\n\n- Note that iOS requires a SSL in order to sync CalDAV/CarDAV (as of iOS14 self-signed SSL is sufficient for Radicale to integrate as an account) [1], this can be created by following the instructions in OpenSSL#Generate a self-signed certificate with private key in a single command. Note also that key sizes must be greater than 2048 bits [2]\n\n- Note also that key sizes must be greater than 2048 bits [2]\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Project Website\n\n"
    }
  ]
}