{
  "title": "Ratpoison-sloppymove",
  "url": "https://wiki.archlinux.org/title/Ratpoison-sloppymove",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Window manager\n\nNote: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nRatpoison is a tiling window manager written in C that allows the user to manage applications without a mouse. The user interface is inspired by GNU Screen.\n\nBy default, ratpoison controls in much the same way as Emacs. Commands begin by pressing Ctrl+t, and are then followed by another combination such as Ctrl+Space to move to the next window.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the ratpoisonAUR package.\n\n"
    },
    {
      "title": "Using ratpoison",
      "level": 2,
      "content": "After X11 starts up you will see a black screen and a little textbox on the upper right of it that says \"Welcome to Ratpoison\". Now type Ctrl+t and then ? to get a list of keybindings. If you are used to GNU screen, you will feel at home very soon.\n\nYou are able to define custom keystrokes and even override existing ones in ~/.ratpoisonrc\n\nExample:\n\n```\n~/.ratpoisonrc\n```\n\n```\n# Overriding CTRL+t 'c' to start aterm instead of xterm\nbind c exec aterm\n\nbind f exec firefox\n```\n\nSo, if you type Ctrl+t and then f, ratpoison will fire up Firefox.\n\nCtrl+t is the default escape key, the key used to trigger ratpoison commands. To change the mapping of the escape key to the Windows key, use the following line in your ~/.ratpoisonrc:\n\n```\n~/.ratpoisonrc\n```\n\n```\n# Setting the escape key to the Windows key\nescape Super_L\n```\n\nHere is a another ~/.ratpoisonrc:\n\n```\n~/.ratpoisonrc\n```\n\n```\nexec xsetroot -cursor_name left_ptr\nstartup_message off\nescape C-z\n\n# Make a screenshot\nalias sshot exec import -window root ~/screenshot-$(date +%F).jpg\ndefinekey top M-C-Print sshot\n\n#virtual desks\ngnewbg one\ngnewbg two\n\ndefinekey top M-l exec ratpoison -c \"select -\" -c \"gprev\" -c \"next\"\ndefinekey top M-h exec ratpoison -c \"select -\" -c \"gnext\" -c \"next\"\n\n#switch between windows\ndefinekey top M-j next\ndefinekey top M-k prev\n\n#apps\nunbind c\nbind c exec urxvt -tr\n#bind c exec aterm\n\nbind g exec gftp\nbind f exec firefox\n```\n\n"
    },
    {
      "title": "Screen reader accessibility",
      "level": 3,
      "content": "By default, ratpoison is not accessible with Orca. There is a project at https://gitlab.com/stormdragon2976/strychnine that replaces the default ratpoison widgets with GTK counterparts.\n\n```\n$ git clone https://gitlab.com/stormdragon2976/strychnine.git\n$ cd strychnine\n$ ./setup.sh\n```\n\nFollow the on screen prompts, and you will get a ~/.ratpoisonrc that will automatically launch Orca when it starts. See the included README.md for more options.\n\n"
    },
    {
      "title": "Java applications",
      "level": 3,
      "content": "Java GUI applications assume stacking window managers, and do not go to fullscreen properly with the default ratpoison configuration. See Java#Impersonate another window manager and Java#Gray window, applications not resizing with WM, menus immediately closing for solutions.\n\n"
    },
    {
      "title": "Multiple workspaces",
      "level": 3,
      "content": "By default, ratpoison only has one workspace, but using a script called rpws (installed by default) you can have more.\n\nEdit your ~/.ratpoisonrc, and add:\n\n```\n~/.ratpoisonrc\n```\n\n```\nexec /usr/bin/rpws init 6 -k\n```\n\nThat creates 6 workspaces. By default, you can access to them by using Alt+F1 to access the first, Alt+F2 to access the second, etc.\n\nYou can also add binds to them, like this:\n\n```\nbind C-1 exec rpws 1\nbind C-2 exec rpws 2\n...\n```\n\nThat allows to access them with Ctrl+t Ctrl+1 (assuming Ctrl+t as your escape key)\n\n"
    },
    {
      "title": "URxvt and xterm",
      "level": 3,
      "content": "URxvt and xterm, as they are installed by default, send resize hints to the window manager. This works in most tiling window managers, but not in ratpoison. The end result is that URxvt/xterm resizes itself in multiples of the font size, rather than resizing to the whole screen, and chances that there are unfilled gaps are high. There are two solutions to this problem, documented below.\n\n"
    },
    {
      "title": "Install a patched URxvt",
      "level": 4,
      "content": "If you use URxvt, the rxvt-unicode-fontspacing-noinc-vteclear-secondarywheelAUR package, among other improvements, sends no resize hints to the window manager. If you install this version of URxvt rather than the default, URxvt will resize properly within ratpoison.\n\n"
    },
    {
      "title": "Adjust the border",
      "level": 4,
      "content": "We can use the xterm/urxvt option internalBorder and set the border of ratpoison to 0.\n\nA trial and error process must be done to find the exact number of internalBorder for each combination of resolution and font size. (the border of ratpoison must be set to 0 before doing the tests) The term command line option -b can be used to test for the correct number and then can be saved on the following files.\n\n```\n~/.Xresources\n```\n\n```\nurxvt*internalBorder: 8 #change urxvt to xterm if necessary. Using the font terminus in urxvt at 14px size, 8 is the correct number here.\n```\n\n```\n~/.ratpoisonrc\n```\n\n```\nset border 0\n```\n\nIf a combination cannot be found, you could try changing the font size and the font family also. (that changes the required border number)\n\n"
    },
    {
      "title": "Autostart",
      "level": 3,
      "content": "Examples for launching programs when ratpoison starts. File ~/.ratpoisonrc is executed by ratpoison on startup.\n\nTo launch urxvt with a tmux session:\n\n```\nexec urxvt -e bash -c \"tmux -q has-session && exec tmux attach-session -d || exec tmux new-session -n$USER -s$USER@$HOSTNAME\"\n```\n\nTo launch chromium with the cache in a tmpfs:\n\n```\nexec bash -c 'pidof chromium &>/dev/null || exec /usr/bin/chromium --disk-cache-dir=~/tmp/cache'\n```\n\n"
    },
    {
      "title": "Wallpaper and transparency",
      "level": 3,
      "content": "Example for setting transparency using xcompmgr and nitrogen. First start nitrogen and set the desired wallpaper. Then use this in your ~/.ratpoisonrc\n\n```\nWallpaper and transparency\n```\n\n```\nexec xcompmgr -c -f -D 5 &\nexec nitrogen --restore\n```\n\n"
    },
    {
      "title": "Useful key bindings",
      "level": 2,
      "content": "Table content:\nKey bindings | Effect\nCtrl+t ! <Program Name> | Start any program\nCtrl+t ? | Show key bindings\nCtrl+t c | Start an X terminal\nCtrl+t n | Switch to next window\nCtrl+t p | Switch to previous window\nCtrl+t 1–9 | Switch to windows 1–9\nCtrl+t k | Close the current window\nCtrl+t Shift+k | XKill the current application\nCtrl+t s,Shift+s | Split the current frame into two vertical,horizontal ones\nCtrl+t Tab, Left, Up, Right, Down | Switch to the next, left, top, right, bottom frame.\nCtrl+t Shift+q | Make the current frame the only one\nCtrl+t : | Execute a ratpoison command\n\n"
    },
    {
      "title": "Focus follows mouse (sloppy.c)",
      "level": 2,
      "content": "sloppy.c is a companion program for ratpoison and can be found in /usr/share/ratpoison/. To enable focus follows mouse, run the following:\n\n```\n# cd /usr/share/ratpoison/\n# gcc -o sloppy sloppy.c -lX11\n# ./sloppy\n```\n\nTo autostart focus follows mouse, add the following to your ~/.ratpoisonrc:\n\n```\n~/.ratpoisonrc\n```\n\n```\nexec /usr/share/ratpoison/sloppy\n```\n\n"
    },
    {
      "title": "ratpoison-sloppymove",
      "level": 3,
      "content": "Sloppy.c inhibits continued use of the keyboard to make focus changes. An improved version of focus follows mouse which does not interfere with keyboard-driven focus changes is available ratpoison-sloppymoveAUR\n\nTo autostart ratpoison-sloppymove, add the following to your ~/.ratpoisonrc:\n\n```\n~/.ratpoisonrc\n```\n\n```\nexec ratpoison-sloppymove\n```\n\n"
    },
    {
      "title": "Ratpoison and display managers",
      "level": 2,
      "content": "Many display managers (e.g., LightDM) source the available sessions from /usr/share/xsessions/ and most window managers and desktop environments create .desktop files there. However ratpoison instead creates a ratpoison.desktop file in /etc/X11/sessions/. To allow display managers to find ratpoison one may need to copy the ratpoison.desktop file from /etc/X11/sessions/ratpoison.desktop to /usr/share/xsessions/ratpoison.desktop. If the /usr/share/xsessions directory does not exist, create it as root.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- The Ratpoison documentation\n- Ratpoison config sample\n- Share your Ratpoison (experience) forum thread\n- Collection of scripts for the Ratpoison window manager\n- Stumpwm - a successor to Ratpoison written in Common lisp\n\n"
    }
  ]
}