{
  "title": "Razer Blade 14 RZ09-0370",
  "url": "https://wiki.archlinux.org/title/Razer_Blade_14_RZ09-0370",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU (AMD) | 1002:1638 | Yes\nGPU (Nvidia) | 10de:249c | Yes\nWebcam | 13d3:56d5 | Yes\nBluetooth | 8087:0032 | Yes\nAudio | 1022:15e3 | Partial\nWireless | 8086:2725 | Yes\n\nThis page contains information about the Razer Blade 14 RZ09-0370 (mid 2021) the first Razer Blade notebook to have an AMD Ryzen processor. Currently the information on this page corresponds to the RTX 3070 and RTX 3080 QHD 165 Hz display versions, but should apply to other versions.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "In order to boot into the installation it is important to disable modesetting by adding nomodeset to the kernel flags. Disabling only the nouveau modset using nouveau.modeset=0 can work but is unstable.\n\nYou can also opt to install while running the proprietary nvidia drivers.\n\n"
    },
    {
      "title": "EFI system partition",
      "level": 3,
      "content": "The computer comes with an EFI system partition from the factory that is used by Windows. The partition is only 100 MiB in size and can cause problems holding both a bootloader and Arch kernels. Resize this partition, create a new EFI system partition, or reformat the disk before installing.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The appearance of the BIOS is pretty simple and not very colorful, so it might work well with OCR software.\n\nThe BIOS can be navigated via the keyboard. Left and Right to select the screen, Up and Down to select an item. Enter can be used to enter a menu or change an option. + and - can be used to change options directly without open a dialog. F3 can be used to load defaults. F4 save and exit.\n\nThe keyboard layout defaults to QWERTY in the BIOS even if the computer itself has a different keyboard layout. For example with the AZERTY version, keys such as - must be accessed using Shift+) instead of the regular - key.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "fwupd does not support this device.\n\nRazer statement on the LVFS website: Updating firmware is only supported on Windows\n\n"
    },
    {
      "title": "Secure Boot",
      "level": 3,
      "content": "The BIOS does not seem to support custom keys.\n\n"
    },
    {
      "title": "nVidia+AMD Hybrid Graphics Battery Drain",
      "level": 3,
      "content": "If you experience very poor battery life compared to Windows, even after implementing Powertop (which sometimes misidentifies dGPU power use as iwlwifi, bluetooth or webcam power use), TPL and cpupower-gui recommendations, try reverting back to the nvidia525 drivers instead of the nvidia535 drivers; the 535xx series have a known bug which does not properly power down the dGPU even when the iGPU is set to integrated.\n\n"
    },
    {
      "title": "Webcam power drain",
      "level": 3,
      "content": "The webcam is consuming power regardless of whether it is in use or not as seen in powertop. The recommended methods for disabling the webcam work to disable the webcam but power drain remains constant. Those methods include added blacklist uvcvideo to /etc/modprobe.d/blocklist.conf and echo usb-id > /sys/bus/usb/drivers/unbind.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "Bluetooth works out of the box, however Bluetooth mice experience lagging and hangs when the laptop is running on battery power and/or under load.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "The integrated speakers work perfectly. The microphone array works perfectly. The headphone jack produces a muffled (only high frequencies), low volume and apparently mono output. Tested with the 5.12 kernel.\n\nAs of Kernel 6.4, the headphone jack still does not work. It produces very low-quality, low-volume unusable sound. Speakers and Bluetooth headsets do work fine, however.\n\n"
    },
    {
      "title": "Backlight",
      "level": 2,
      "content": "The backlight controls do not work after installation and is caused by a bug in amdgpu driver. As suggested in the OpenSUSE forum, adding the amdgpu.backlight=0 kernel parameter would solve the issue.\n\nTo make systemd save and load brightness settings after restarts, one may need to enable systemd-backlight@backlight:amdgpu_bl0.service\n\n"
    },
    {
      "title": "HDMI Port",
      "level": 2,
      "content": "The external HDMI is bound to the discrete NVIDIA GPU. Reverse PRIME can be used to allow for using the iGPU for rendering.\n\n"
    },
    {
      "title": "RGB",
      "level": 2,
      "content": "The keyboard RGB lights can be controlled using openrgb-gitAUR. The logo illumination can be controlled using logo-control.\n\n"
    }
  ]
}