{
  "title": "RecordMyDesktop",
  "url": "https://wiki.archlinux.org/title/RecordMyDesktop",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "recordMyDesktop is a screencasting software for X. It can record audio through ALSA, OSS or the JACK audio server. It is able capture through jack and thus is important for pro-audio video tutorials. recordMyDesktop only outputs to Ogg using Theora for video and Vorbis for audio.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the recordmydesktop package. A GUI is available: gtk-recordmydesktopAUR[broken link: package not found].\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "The basic usage is simple and a man page (recordmydesktop(1)) is provided. Here is a simple example using jack for audio capture:\n\n```\n$ recordmydesktop --use-jack system:capture_1\n```\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nCurrent versions behave weird and need strange parameters to work properly. Here is an example that should help achieve non-choppy capture:\n\n```\n$ recordmydesktop --use-jack system:capture_1 --v_bitrate 2000000\n```\n\n"
    },
    {
      "title": "Audio record is lagging",
      "level": 3,
      "content": "If it appears that you have lags (error message when starting from the shell: Broken pipe: Overrun occurred) in your audio record (often with Intel onboard cards) then it might help to change the audio device. This can be done in two ways.\n\n- Assuming that the terminal version is used then recordmydesktop should be started with: $ recordmydesktop --device plughw:0,0\n\n```\n$ recordmydesktop --device plughw:0,0\n```\n\n- If a GUI is used then you can change the device from DEFAULT to plughw:0,0 in the audio tab of the settings.\n\nMore information on this issue can be found in this blog post.\n\n"
    },
    {
      "title": "Audio record lags and is out of sync",
      "level": 3,
      "content": "Using the plughw:0,0 device as described above may work partially for some Intel cards. You might try:\n\n```\n$ recordmydesktop --device plughw:0,0 --freq 22050 --channels 2\n```\n\nIt seems the trick was to specify the correct number of channels generated by the input source (in this case, a stereo mic).\n\n"
    },
    {
      "title": "Audio record is distorted (slower/graver)",
      "level": 3,
      "content": "This happens at least with Rode Podcaster USB Microphone, and can be fixed by setting the frequency to 45000:\n\n```\n$ recordmydesktop --device plughw:2,0 --freq 45000 --channels 2\n```\n\n"
    },
    {
      "title": "No sound with PulseAudio",
      "level": 3,
      "content": "This is pretty simple, but should be better explained. If recordmydesktop exits like this:\n\n```\nCouldn't open PCM device hw:0,0\nError while opening/configuring soundcard hw:0,0\nTry running with the --no-sound or specify a correct device.\n```\n\nInstall the package alsa-plugins and then run it like:\n\n```\n$ recordmydesktop --device pulse\n```\n\n"
    },
    {
      "title": "External Links",
      "level": 2,
      "content": "- Wikipedia:RecordMyDesktop\n- using ffmpeg directly\n\n"
    }
  ]
}