{
  "title": "Remind",
  "url": "https://wiki.archlinux.org/title/Remind",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Remind is a sophisticated calendar and alarm program.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the remind package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "After installation, the user can define reminders in remind script files (.rem). A good place for these files could be ~/.reminders or ~/.config/remind.\n\nHere are some example reminders that could be in the remind script:\n\n```\n~/.config/remind/reminders.rem\n```\n\n```\nREM Jan 1 MSG Remind every year on new years day\nREM January 1 2015 MSG Remind only on new years day 2015\nREM Sunday 2 MSG Remind every second Sunday\nREM March Monday 1 --7 MSG remind on the last Monday of February\nREM December 25 +30 MSG Christmas\n```\n\nThe last particular day of a month is given by subtracting 7 days from the first day of the next month. The + symbol tells remind to start reminding that number of days ahead.\n\nSee also remind(1) man page for detailed information about configuring remind.\n\n"
    },
    {
      "title": "Include",
      "level": 3,
      "content": "A reminder script can also include any number of external scripts. For example, a user might want to have a separate file for birthday reminders and a separate file for holidays. This can be done like so:\n\n```\ninclude ~/.config/remind/birthdays.rem\ninclude ~/.config/remind/holidays.rem\n```\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "The simplest thing one can do with remind, is to check for reminders. Do this by passing a reminder file to remind:\n\n```\nremind ~/.config/remind/reminders.rem\n```\n\nThis will output a list of reminders that it is scheduled to tell the user about.\n\nTo output a text based calendar, use the -c option:\n\n```\nremind -c1 ~/.config/remind/reminders.rem\n```\n\nThis will output a text calendar for the current month. To print months in advance, replace 1 with the number of months to print.\n\n"
    },
    {
      "title": "Postscript/pdf calendars",
      "level": 3,
      "content": "It is also possible to create calendars in a postscript format.\n\n```\nremind -c2 -p ~/.config/remind/reminders.rem | rem2ps > calendar.ps\n```\n\nThe -p option makes remind print output suitable for rem2ps. rem2ps by default prints the output to standard output, so it must be redirected to a file so it can be opened by a program like evince.\n\nPostscript files can be converted with ps2pdf. Ps2pdf is provided by ghostscript.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- remind(1) man page\n- Remind wiki index\n\n"
    }
  ]
}