{
  "title": "Reproducible Builds",
  "url": "https://wiki.archlinux.org/title/Reproducible_Builds",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux is currently working on making all packages reproducible. This lets users and researchers verify the distributed packages from Arch Linux. For the exact definition of reproducible builds and its benefits take a look at the project website.\n\n"
    },
    {
      "title": "Repository vs. rebuild",
      "level": 3,
      "content": "An experimental rebuilderd instance has been setup on our own infrastructure with a status page. Rebuilderd rebuilds our repository packages and checks if they are bit for bit identical. If they are not reproducible there is either a bug in the tooling, the package is not reproducible or the package has not been built cleanly.\n\nA list of known issues is located on /Status.\n\n"
    },
    {
      "title": "Rebuild vs. another rebuild with variations",
      "level": 3,
      "content": "The Reproducible Builds project rebuilds Arch Linux packages and compares them with another rebuild in a different environment. The package status and environment variations are listed in the dedicated Arch Linux page.\n\n"
    },
    {
      "title": "Tooling",
      "level": 3,
      "content": "Help out on fixing bugs and adding features for repro.\n\n"
    },
    {
      "title": "Running a Rebuilder instance",
      "level": 3,
      "content": "Setting up rebuilderd to build Arch Linux packages helps to independently verify repository packages.\n\n"
    },
    {
      "title": "Verifying packages with repro and finding issues",
      "level": 3,
      "content": "A great way to help out is to find an unreproducible package and figuring out how it can be made reproducible.\n\n- Download an Arch Linux package or get one from the Arch Linux Archive\n- Run repro on the downloaded package or a package from your pacman cache. Ideally with repro -d to get diffoscope output. For example, repro -d /var/cache/pacman/pkg/curl-7.73.0-1-x86_64.pkg.tar.zst\n\n- Investigate if it is an issue with Arch Linux packaging or upstream, issues can be added on the status page. More information can be found on the Reproducible Builds website.\n\n"
    },
    {
      "title": "Work on issues in the tests.reproducible-builds.org infrastructure",
      "level": 3,
      "content": "Arch users can help contribute to Reproducible Build issues by looking at the continuous reproducing environment. There are various issues which can be sorted out:\n\n- FTBS (failed to build from source): reproduce the build failure locally and create a bug report if the package cannot be built from a clean chroot (extra-x86_64-build or multilib-build).\n- Failed to download sources, reproduce the issue (makepkg -o -d) and create a bug report on the Arch bugtracker.\n- Failed to reproduce. Locally you can reproduce packages using reprotest. Note that not all variations can be used. For simple time related testing: $ reprotest --variations '+time' 'sudo extra-x86_64-build' '*.pkg.tar.zst'\n\n```\n$ reprotest --variations '+time' 'sudo extra-x86_64-build' '*.pkg.tar.zst'\n```\n\nThere might be various reasons for a package to not be reproducible, but before digging in take a look at the upstream repository or the reproducible status in Debian\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\n- Failed to run tests, these failures are heavily on the testing environment. Most likely due to to LANG=C being set and Arch not supporting LANG=C.UTF-8.\n\nIf you are interested in the code which runs the continuous reproducing environment, the first build code starts here on salsa\n\n"
    },
    {
      "title": "GPG verification",
      "level": 3,
      "content": "There is a possible rebuild scenario where GPG keys will not verify as the packager was removed from the keyring or revoked as we use the latest keyring and a package in the archive which we need might need be signed by a revoked key we are unable to verify it and the build will fail.\n\n"
    },
    {
      "title": "Contact",
      "level": 2,
      "content": "- #archlinux-reproducible — Main channel for the progress of Reproducible Builds on Arch Linux\n\n"
    }
  ]
}