{
  "title": "Rhythmbox",
  "url": "https://wiki.archlinux.org/title/Rhythmbox",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Rhythmbox is an audio player that plays and helps organize digital music. It is designed to work well under the GNOME desktop using the GStreamer media framework.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the rhythmbox package.\n\n"
    },
    {
      "title": "Playing remote media from Internet sources (blip.tv, Jamendo, SHOUTcast)",
      "level": 3,
      "content": "Rhythmbox takes advantage of the Grilo framework to browse external sources such as SHOUTcast webradios and more.\n\nYou need to install the grilo and grilo-plugins packages. Then, be sure to enable the Grilo Media Browser plugin into Rhythmbox (\"Edit\" > \"Plugins\").\n\n"
    },
    {
      "title": "How to activate the Cover Art plugin",
      "level": 3,
      "content": "If you want to use the cover art plugin, but are unable to do so, you need to install gnome-pythonAUR.\n\nAfter you do that, restart Rhythmbox.\n\nThis requirement also affects the Song Lyrics and Magnitune plugins, as well as several others.\n\n"
    },
    {
      "title": "What to do when the little red icon shows when you try to play radio stations",
      "level": 3,
      "content": "First thing to do when the stop sign icon shows is to right-click the name of the station you are trying to listen to and open the Properties dialog box. Rhythmbox should give a bit more explanation about why it was unable to start playing the audio stream.\n\n"
    },
    {
      "title": "Using the DAAP Music Sharing plugin",
      "level": 3,
      "content": "Install the optional dependency for DAAP sharing, libdmapsharing, and set up hostname resolution with Avahi.\n\n"
    },
    {
      "title": "\"Unknown Playback Error\" when streaming or playing from regular files",
      "level": 3,
      "content": "Rhythmbox may display this error when it does not have the correct codec to play that stream. You will need to identify what format the stream is (by looking at the command line error messages that Rhythmbox displays) and then install the correct GStreamer codec for that particular audio stream: see GStreamer#Installation.\n\n"
    },
    {
      "title": "\"Error, impossible to activate plugin 'Audio CD Recorder'\" shows up every time I start Rhythmbox",
      "level": 3,
      "content": "You have two options:\n\n1. install brasero\n1. disable the cd recording plugin: Run dconf-editor, navigate to /org/gnome/rhythmbox/plugins/ and remove cd-recorder from active-plugins.\n\n"
    },
    {
      "title": "Slow start and \"Unable to start mDNS browsing: MDNS service is not running\" output",
      "level": 3,
      "content": "You have two options:\n\n1. activate the DAAP Music Sharing (see #Using the DAAP Music Sharing plugin above)\n1. disable the DAAP plugin: Run dconf-editor, navigate to /org/gnome/rhythmbox/plugins/ and remove DAAP from active-plugins.\n\n"
    },
    {
      "title": "Rhythmbox Startup is Slow",
      "level": 3,
      "content": "This can be easily fixed by disabling some of the plugins. For example, if you do not use a mediaplayer gnome-shell extension you do not need the MRPIS and D-bus plugins enabled.\n\n"
    },
    {
      "title": "No cover are shown in the dedicated box",
      "level": 3,
      "content": "Creating a lastFM account and login in with the rhythmbox plugin can solve the problem.\n\n"
    },
    {
      "title": "Cannot enable MTP device support",
      "level": 3,
      "content": "Install gvfs-mtp.\n\n"
    },
    {
      "title": "Cannot enable iPod support",
      "level": 3,
      "content": "Install libgpod.\n\n"
    },
    {
      "title": "Music files within the music library are not found",
      "level": 3,
      "content": "Sometimes it helps to remove the Rhythmbox library in order to rebuild it properly. Quit Rhythmbox, move ~/.local/share/rhythmbox/rhythmdb.xml to an other directory. Restart Rhythmbox and rescan your music library.\n\n"
    },
    {
      "title": "uPnP/DLNA Client does not work out of the box",
      "level": 3,
      "content": "Install grilo-plugins and dleyna. Then enable Grilo media browser plugin. DLNA server should appear under shared sources.\n\n"
    },
    {
      "title": "Certain files return \"Additional GStreamer plugins required\"",
      "level": 3,
      "content": "Install gst-plugins-ugly. However, these plugins may pose distribution problems.\n\n"
    }
  ]
}