{
  "title": "RPCS3",
  "url": "https://wiki.archlinux.org/title/RPCS3",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "RPCS3 is an emulator for PlayStation 3 games.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install rpcs3AUR, rpcs3-gitAUR or rpcs3-binAUR.\n\nTo be able to actually run games, the PlayStation 3 system software is required, as indicated in the quickstart guide. Fortunately it is easy to acquire this firmware compared with other Sony systems like the PlayStation 2. Sony even provides the files online, so it is not necessary to dump anything. Download the PS3UPDAT.PUP file by clicking on the big button.\n\nAfter installing RPCS3, open it and go to File > Install Firmware, then choose the downloaded file.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "In order to play games comfortably, a gamepad should be present. In the most optimal case, it is an original PlayStation 3 controller. Other gamepads are supported as well, make sure Handlers is set to evdev under the menu entry Pads.\n\n"
    },
    {
      "title": "Installing games",
      "level": 2,
      "content": "RPCS3 stores its data in $XDG_CONFIG_HOME/rpcs3. More game directories can be added. It differentiates between disc dumps and downloaded (PSN) games. Put disc dumps into the disc directory and the downloaded ones into the game directory.\n\nThe usual way of running games is pointing rpcs3 to the directory or installing it, if it is a .pkg file.\n\n"
    },
    {
      "title": "The difference between downloads and disc dumps",
      "level": 3,
      "content": "Downloaded games (or other content, such as DLCs) usually consist of only two files, a key (or license) and the actual game. The key is usually contained in a tiny .rap file, the game is much bigger in size, usually around 10-15 gigabytes. Put both files into game dir/name of the game. name of the game is purely cosmetic, as this directory only exists so that the files, which may have random names, do not make the directory listing unreadable.\n\nDisc dumps contain many files and can easily identified by the PS3_GAME directory in it. PS3_GAME/ICON0.png and PS3_GAME/PIC1.png contain the icon and background for that specific game.\n\n"
    },
    {
      "title": "Enabling the debug menu",
      "level": 3,
      "content": "Unfortunately many games are still not fully playable and require workarounds. Since not all settings that are visible by default will help with glitches and other bugs, some important configuration is done in the debug menu. See the RPCS3 FAQ on how to enable the debug menu.\n\n"
    },
    {
      "title": "The main window looks odd with a system-wide dark theme",
      "level": 3,
      "content": "Users which configured their environment to use dark themes may have problems with the default theme. Go to Config > GUI and choose a different theme.\n\n"
    },
    {
      "title": "Graphics suddenly pop in when compiling shaders",
      "level": 3,
      "content": "Go to Config > GPU and set Shader Mode to Async with Shader Interpreter.\n\nThis can help with situations where it takes a while to fully compile the shaders. Objects are invisible until their shader is compiled, which can ruin the fun of e.g cutscenes.\n\n"
    },
    {
      "title": "Weird graphics errors",
      "level": 3,
      "content": "If the game once worked perfectly and suddenly stopped working after starting it, clear the cache. It is usually found in $XDG_CACHE_HOME/rpcs3 and is safe to remove. This location only contains logs and other things that can be regenerated without problems, like compiled shaders and PPU modules. Removing this will cause the next startup to be slower.\n\n"
    },
    {
      "title": "Increasing RLIMIT_MEMLOCK",
      "level": 3,
      "content": "```\nFailed to set RLIMIT_MEMLOCK size to 2 GiB. Try to update your system configuration\n```\n\nInstall realtime-privileges and add your own user to the realtime user group.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- RPCS3 Wiki\n- https://emulation.gametechwiki.com/index.php/RPCS3\n- https://github.com/RipleyTom/rpcn\n\n"
    }
  ]
}