{
  "title": "Rss2email",
  "url": "https://wiki.archlinux.org/title/Rss2email",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Web feed\n\nrss2email is a free tool for retrieving content from RSS feeds and mailing it. It is useful for those who do not want yet another program with which to keep up and for people who have a system for e-mail management that they would like to apply to their RSS feeds as well. People with lots of e-mail often have highly customized systems that let them process their mail efficiently; rss2email allows them to easily apply this system to their feeds as well.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the rss2email package.\n\n"
    },
    {
      "title": "Adding feeds",
      "level": 2,
      "content": "First, tell rss2email where it should send feeds by running the command:\n\n```\n$ r2e new user@example.com\n```\n\nNext, subscribe to an RSS feed. For example, to subscribe to the Arch Linux package updates feed, run:\n\n```\n$ r2e add name-for-rss https://www.archlinux.org/feeds/packages/ e-mail address\n```\n\nNote that an e-mail address only has to be given if the feed is to be delivered to an address other than the default one; otherwise, leaving off the e-mail address is acceptable.\n\nAfter a new feed is added, rss2email will e-mail every post it has not previously e-mailed. The first time it is run, therefore, it will e-mail every post. To avoid this behavior, after adding a new feed, run:\n\n```\n$ r2e run --no-send\n```\n\n"
    },
    {
      "title": "Getting RSS feeds",
      "level": 2,
      "content": "To get new stories, execute the command:\n\n```\n$ r2e run\n```\n\nTo automate this process and have rss2email check for new feeds every 30 minutes, see Autostarting#On time events.\n\n"
    },
    {
      "title": "Managing rss2email",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nTo view feeds previously added to rss2email, run:\n\n```\nr2e list\n```\n\nThis will output a numbered list of feeds. To delete a feed, run:\n\n```\nr2e delete number\n```\n\nwhere number is the number of the feed to be deleted.\n\nTo change the default e-mail address, run:\n\n```\nr2e email new_address@example.net\n```\n\n"
    },
    {
      "title": "Advanced configuration",
      "level": 2,
      "content": "The following configuration changes should be made in rss2email.cfg, which should be located at ~/.config/rss2email.cfg.\n\nTo have RSS entries sent as HTML e-mails instead of as plain text, set:\n\n```\nHTML-MAIL = 1\n```\n\nTo receive new e-mails when RSS posts are updated, set:\n\n```\nTRUST-GUID = 0\n```\n\nTo set the date header of e-mails to when the RSS post was written, rather than when the e-mail is actually sent, set:\n\n```\nDATE-HEADER = 1\n```\n\nTo fix the error message \"sender domain must exist\" or to change the address from which e-mails are sent, set:\n\n```\nFROM = user@example.com\n```\n\nTo force all feeds to use this address, even if they have their own address set, use:\n\n```\nFORCE-FROM = 1\n```\n\nTo have rss2email automatically wrap long lines, set:\n\n```\nBODY-WIDTH = 72\n```\n\nWhere 72 is the number of characters after which rss2email should start a new line.\n\nTo send mail using an SMTP server rather than the local machine, use:\n\n```\nSMTP_SEND = 1\nSMTP_SERVER = smtp.example.com:25\n```\n\nIf the SMTP server requires authentication, set:\n\n```\nSMTP-AUTH = 1\nSMTP-USERNAME = user@example.com\nSMTP-PASSSWORD = password\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- https://web.archive.org/web/20100412191758/http://www.allthingsrss.com/rss2email/?page_id=31#unix - Official getting started page\n- https://www.linux.com/archive/feed/50469 - linux.com article.\n\n"
    }
  ]
}