{
  "title": "Sender policy framework",
  "url": "https://wiki.archlinux.org/title/Sender_policy_framework",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ClamAV\n- SpamAssassin\n\nA mail server consists of multiple components. A mail transfer agent (MTA) receives and sends emails via SMTP. Received and accepted emails are then passed to a mail delivery agent (MDA), which stores the mail in a mailbox (usually in mbox or Maildir format). If you want users to be able to remotely access their mail using email clients (MUA), you need to run a POP3 and/or IMAP server.\n\n"
    },
    {
      "title": "Software",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n- Add mailutils somewhere.\n- Addition of mailing list software\n- Find article or guide on how to create a \"simple\" mailing list with Postfix\n- Differentiate between POP3 and IMAP servers (Dovecot etc.) and clients (fdm etc.)\n\nBelow is a table containing all mail servers with the features they support.\n\nTable content:\nName | Mail transfer agent | Mail delivery agent | Sendmail | Mailing list | JMAP | Notes\nSending | Receiving | POP3 | IMAP\ndma | Yes | Yes | – | – | Yes | – | – | Does not support email domains; limited MTA receiving (see Use Google SMTP)\nExim | Yes | Yes | – | – | Yes | – | – | –\nOpenSMTPD | Yes | Yes | – | – | Yes | – | – | –\nPostfix | Yes | Yes | – | – | Yes | Partially, through alias feature | – | –\nCourier | Yes | Yes | Yes | Yes | No | Yes | – | Includes a web client\nCyrus IMAP | – | – | Yes | Yes | – | – | Yes | Can be installed from cyrus-imapdAUR\nDovecot | – | – | Yes | Yes | – | – | No, requested | –\nUW IMAP | Yes using c-clientAUR | – | Yes | Yes | Yes c-clientAUR has same capabilities | – | – | Project is abandoned\nmsmtp | Yes | No | – | – | Yes msmtp has same capabilities | – | – | –\nSendmail | Yes | No | – | – | Yes | – | – | Sendmail implementation is deprecated\nsSMTP | Yes | No | – | – | Yes | – | – | –\nfdm | – | – | Yes | Yes | – | – | – | Can also fetch mail from standard input (stdin)\nProcmail | – | – | Partially, see module [1] | No | – | – | – | Only reads mail through standard input (stdin), upstream is unmaintained\nMaildrop | – | – | No | No | – | – | – | Only supports receiving emails over standard input (stdin)\nStalwart | Yes | Yes | Yes | Yes | – | – | Yes | –\n\n- Sendmail executables are command line tools which allow the sending of emails over SMTP.\n- \"Sending\" and \"Receiving\" columns refer to the ability to send emails over SMTP and receive emails over SMTP.\n- \"Mailing list\" software, allow for the creation of mailing lists, see Mailing lists.\n\n"
    },
    {
      "title": "Ports",
      "level": 2,
      "content": "Table content:\nPurpose | Port | Protocol | Encryption\nAccept mail from other MTAs. | 25 | SMTP | STARTTLS\nAccept submissions from MUAs. | 587 | SMTP | STARTTLS\n465 | SMTPS | implicit TLS\nLet MUAs access mail. | 110 | POP3 | STARTTLS\n995 | POP3S | Implicit TLS\n143 | IMAP | STARTTLS\n993 | IMAPS | implicit TLS\n\n- Implicit TLS is more secure than STARTTLS because the latter is vulnerable to man-in-the-middle attacks. For more information, see [2] and RFC:8314.\n- The table above contains the generic ports to be used, however mail servers could use other ports, ensure to check with your mail provider to ensure the ports are correct. The only port which remains constant is port 25, the relay port is expected to be open otherwise emails will not be relayed through a specific server (However some software does support setting custom relay ports).\n\n"
    },
    {
      "title": "MX record",
      "level": 2,
      "content": "Hosting a mail server requires a domain name with an MX record pointing to the domain name of your mail transfer agent. The domain name used as the value of the MX record must map to at least one address record (A, AAAA) and must not have a CNAME record to conform with RFC 2181, otherwise you may not get mail from some mail servers. Configuring DNS records is usually done from the configuration interface of your domain name registrar.\n\n"
    },
    {
      "title": "Authentication",
      "level": 2,
      "content": "Note: **This article or section is a candidate for merging with Mail server#Software.** This article or section is a candidate for merging with Mail server#Software.\n\nThis article or section is a candidate for merging with Mail server#Software.\n\nThere are various email authentication techniques.\n\n"
    },
    {
      "title": "Sender Policy Framework",
      "level": 3,
      "content": "From Wikipedia:\n\nTo allow other mail exchangers to validate mails apparently sent from your domain, you need to set a DNS TXT record as explained in the Wikipedia article (there is also an online wizard). To validate incoming mail using SPF you need to configure your mail transfer agent to use a SPF implementation. There are several SPF implementations available: libspf2, perl-mail-spf and perl-mail-spf-query.\n\nTable content:\nCourier | Yes, built-in\nPostfix | Yes\nSendmail | through Milter and spfmilter-acmeAUR\nExim | Yes, requires libspf2\nOpenSMTPD | No\n\nThe following websites let you validate your SPF record:\n\n- SPF Record Checker\n- SPF Email test\n\n"
    },
    {
      "title": "Sender Rewriting Scheme",
      "level": 3,
      "content": "The Sender Rewriting Scheme (SRS) is a secure scheme to allow forwardable bounces for server-side forwarded emails without breaking the Sender Policy Framework.\n\nFor Postfix, see Postfix#Sender Rewriting Scheme.\n\n"
    },
    {
      "title": "DKIM",
      "level": 3,
      "content": "DomainKeys Identified Mail (DKIM) is a domain-level email authentication method designed to detect email spoofing.\n\nAvailable DKIM implementations are OpenDKIM and perl-mail-dkim.\n\n"
    },
    {
      "title": "ARC",
      "level": 3,
      "content": "ARC is an experimental Standard, the Authenticated Received Chain (ARC) email authentication system. It allows an intermediate mail server like a mailing list or forwarding service to sign an email's original authentication results. ARC is implemented by Google, Microsoft, ProtonMail, Fastmail, and others.\n\nAvailable ARC implementations are rspamd (as a module of rspamd), and OpenARC (standalone).\n\n"
    },
    {
      "title": "Testing",
      "level": 2,
      "content": "There are several options to help you test DNS records, deliver ability, and encryption support.\n\n"
    },
    {
      "title": "Dedicated tools",
      "level": 3,
      "content": "- swaksAUR\n\n"
    },
    {
      "title": "Dedicated websites",
      "level": 3,
      "content": "There are several handy web sites that can help you testing.\n\n- https://mxtoolbox.com/\n- https://ismyemailworking.com/\n- https://www.mail-tester.com/ (3 free tries only!)\n- https://www.checktls.com/\n- https://pingability.com/zoneinfo.jsp\n- https://www.mailhardener.com/tools/\n\n"
    },
    {
      "title": "Removing IP addresses from emails",
      "level": 3,
      "content": "Most mail servers can be configured to strip users' IP addresses and user agents from outgoing mail.\n\n"
    },
    {
      "title": "Scanning emails for viruses",
      "level": 3,
      "content": "See ClamAV for email antivirus scanning.\n\n"
    },
    {
      "title": "Spam filtering",
      "level": 3,
      "content": "See SpamAssassin for filtering of spam emails.\n\n"
    },
    {
      "title": "Webmail",
      "level": 3,
      "content": "See Roundcube and Squirrelmail for setting up of a webmail.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Comparison of mail servers - Further comparison of mail servers, including ones which are not supported by Arch Linux\n- Sieve – a mail filtering programming language\n- Webmail\n\n"
    }
  ]
}