{
  "title": "Simple stateful firewall HOWTO",
  "url": "https://wiki.archlinux.org/title/Simple_stateful_firewall_HOWTO",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Firewalls\n- Internet sharing\n- Nftables#Simple stateful firewall\n- Router\n- Uncomplicated Firewall\n\nThis page explains how to set up a stateful firewall using iptables. It also explains what the rules mean and why they are needed. For simplicity, it is split into two major sections. The first section deals with a firewall for a single machine, the second sets up a NAT gateway in addition to the firewall from the first section.\n\n"
    },
    {
      "title": "Prerequisites",
      "level": 2,
      "content": "First, install the userland utilities iptables or verify that they are already installed.\n\nThis article assumes that there are currently no iptables rules set. To check the current ruleset and verify that there are currently no rules run the following:\n\n```\n# iptables-save\n```\n\n```\n# Generated by iptables-save v1.4.19.1 on Thu Aug  1 19:28:53 2013\n*filter\n:INPUT ACCEPT [50:3763]\n:FORWARD ACCEPT [0:0]\n:OUTPUT ACCEPT [30:3472]\nCOMMIT\n# Completed on Thu Aug  1 19:28:53 2013\n```\n\nor\n\n```\n# iptables -nvL --line-numbers\n```\n\n```\nChain INPUT (policy ACCEPT 156 packets, 12541 bytes)\nnum   pkts bytes target     prot opt in     out     source               destination\n\nChain FORWARD (policy ACCEPT 0 packets, 0 bytes)\nnum   pkts bytes target     prot opt in     out     source               destination\n\nChain OUTPUT (policy ACCEPT 82 packets, 8672 bytes)\nnum   pkts bytes target     prot opt in     out     source               destination\n```\n\nIf there are rules, you may be able to reset the rules by loading a default rule set:\n\n```\n# iptables-restore < /etc/iptables/empty.rules\n```\n\nOtherwise, see Iptables#Resetting rules.\n\n"
    },
    {
      "title": "Creating necessary chains",
      "level": 3,
      "content": "For this basic setup, we will create two user-defined chains that we will use to open up ports in the firewall.\n\n```\n# iptables -N TCP\n# iptables -N UDP\n```\n\nThe chains can of course have arbitrary names. We pick these just to match the protocols we want handle with them in the later rules, which are specified with the protocol options, e.g. -p tcp, always.\n\n"
    },
    {
      "title": "The FORWARD chain",
      "level": 3,
      "content": "If you want to set up your machine as a NAT gateway, please look at #Setting up a NAT gateway. For a single machine, however, we simply set the policy of the FORWARD chain to DROP and move on:\n\n```\n# iptables -P FORWARD DROP\n```\n\n"
    },
    {
      "title": "The OUTPUT chain",
      "level": 3,
      "content": "The OUTPUT chain can be a powerful tool for filtering outbound traffic, especially for servers and other devices which do not run web browsers or peer-to-peer tools that need to connect to arbitrary destinations on the internet. However, properly setting up an OUTPUT chain requires information about the intended use of the system. A secure set of rules for a desktop system, laptop system, cloud server and home/on-prem server would all be very different.\n\nIn this simple example, we will allow all outbound traffic by setting the default policy for the OUTPUT chain to ACCEPT. This is less secure, but is highly compatible with many systems.\n\n```\n# iptables -P OUTPUT ACCEPT\n```\n\n"
    },
    {
      "title": "The INPUT chain",
      "level": 3,
      "content": "Similar to the previous chains, we set the default policy for the INPUT chain to DROP in case something somehow slips by our rules. Dropping all traffic and specifying what is allowed is the best way to make a secure firewall.\n\n1. add the first INPUT chain rule below (it will keep the session open),\n1. add a regular rule to allow inbound SSH (to be able to reconnect in case of a connection drop) and\n1. set the policy.\n\n```\n# iptables -P INPUT DROP\n```\n\nEvery packet that is received by any network interface will pass the INPUT chain first, if it is destined for this machine. In this chain, we make sure that only the packets that we want are accepted. For a simplified ASCII art showing how packets traverse those builtin chains, see How Packets Traverse The Filters.\n\nThe first rule added to the INPUT chain will allow traffic that belongs to established connections, or new valid traffic that is related to these connections such as ICMP errors, or echo replies (the packets a host returns when pinged). ICMP stands for Internet Control Message Protocol. Some ICMP messages are very important and help to manage congestion and MTU, and are accepted by this rule:\n\n```\n# iptables -A INPUT -m conntrack --ctstate RELATED,ESTABLISHED -j ACCEPT\n```\n\nThe connection state ESTABLISHED implies that either another rule previously allowed the initial (--ctstate NEW) connection attempt or the connection was already active (for example an active remote SSH connection).\n\nThe second rule will accept all traffic from the \"loopback\" (lo) interface, which is necessary for many applications and services.\n\n```\n# iptables -A INPUT -i lo -j ACCEPT\n```\n\nThe third rule will drop all traffic with an \"INVALID\" state match. Traffic can fall into four \"state\" categories: NEW, ESTABLISHED, RELATED or INVALID and this is what makes this a \"stateful\" firewall rather than a less secure \"stateless\" one. States are tracked using the \"nf_conntrack_*\" kernel modules which are loaded automatically by the kernel as you add rules.\n\n- This rule will drop all packets with invalid headers or checksums, invalid TCP flags, invalid ICMP messages (such as a port unreachable when we did not send anything to the host), and out of sequence packets which can be caused by sequence prediction or other similar attacks. The \"DROP\" target will drop a packet without any response, contrary to REJECT which politely refuses the packet. We use DROP because there is no proper \"REJECT\" response to packets that are INVALID, and we do not want to acknowledge that we received these packets.\n- ICMPv6 Neighbor Discovery packets remain untracked, and will always be classified \"INVALID\" though they are not corrupted or the like. Keep this in mind, and accept them before this rule! Run iptables -A INPUT -p 41 -j ACCEPT as root.\n\n```\n# iptables -A INPUT -m conntrack --ctstate INVALID -j DROP\n```\n\nThe next rule will accept all new incoming ICMP echo requests, also known as pings. Only the first packet will count as NEW, the others will be handled by the RELATED, ESTABLISHED rule. Since the computer is not a router, no other ICMP traffic with state NEW needs to be allowed.\n\n```\n# iptables -A INPUT -p icmp --icmp-type 8 -m conntrack --ctstate NEW -j ACCEPT\n```\n\nNow we attach the TCP and UDP chains to the INPUT chain to handle all new incoming connections. Once a connection is accepted by either TCP or UDP chain, it is handled by the RELATED/ESTABLISHED traffic rule. The TCP and UDP chains will either accept new incoming connections, or politely reject them. New TCP connections must be started with SYN packets.\n\n```\n# iptables -A INPUT -p udp -m conntrack --ctstate NEW -j UDP\n# iptables -A INPUT -p tcp --syn -m conntrack --ctstate NEW -j TCP\n```\n\nWe reject TCP connections with TCP RESET packets and UDP streams with ICMP port unreachable messages if the ports are not opened. This imitates default Linux behavior (RFC compliant), and it allows the sender to quickly close the connection and clean up.\n\n```\n# iptables -A INPUT -p udp -j REJECT --reject-with icmp-port-unreachable\n# iptables -A INPUT -p tcp -j REJECT --reject-with tcp-reset\n```\n\nFor other protocols, we add a final rule to the INPUT chain to reject all remaining incoming traffic with icmp protocol unreachable messages. This imitates Linux's default behavior.\n\n```\n# iptables -A INPUT -j REJECT --reject-with icmp-proto-unreachable\n```\n\n"
    },
    {
      "title": "Resulting iptables.rules file",
      "level": 3,
      "content": "Example of iptables.rules file after running all the commands from above:\n\n```\n/etc/iptables/iptables.rules\n```\n\n```\n# Generated by iptables-save v1.4.18 on Sun Mar 17 14:21:12 2013\n*filter\n:INPUT DROP [0:0]\n:FORWARD DROP [0:0]\n:OUTPUT ACCEPT [0:0]\n:TCP - [0:0]\n:UDP - [0:0]\n-A INPUT -m conntrack --ctstate RELATED,ESTABLISHED -j ACCEPT\n-A INPUT -i lo -j ACCEPT\n-A INPUT -m conntrack --ctstate INVALID -j DROP\n-A INPUT -p icmp -m icmp --icmp-type 8 -m conntrack --ctstate NEW -j ACCEPT\n-A INPUT -p udp -m conntrack --ctstate NEW -j UDP\n-A INPUT -p tcp --tcp-flags FIN,SYN,RST,ACK SYN -m conntrack --ctstate NEW -j TCP\n-A INPUT -p udp -j REJECT --reject-with icmp-port-unreachable\n-A INPUT -p tcp -j REJECT --reject-with tcp-reset\n-A INPUT -j REJECT --reject-with icmp-proto-unreachable\nCOMMIT\n# Completed on Sun Mar 17 14:21:12 2013\n```\n\nThis file can be generated and saved with:\n\n```\n# iptables-save -f /etc/iptables/iptables.rules\n```\n\nand can be used to continue with the following sections. If you are setting up the firewall remotely via SSH, append the following rule to allow new SSH connections before continuing (adjust port as required):\n\n```\n# iptables -A TCP -p tcp --dport 22 -j ACCEPT\n```\n\n"
    },
    {
      "title": "The TCP and UDP chains",
      "level": 3,
      "content": "The TCP and UDP chains contain rules for accepting new incoming TCP connections and UDP streams to specific ports.\n\n"
    },
    {
      "title": "Opening ports to incoming connections",
      "level": 4,
      "content": "To accept incoming TCP connections on port 80 for a web server:\n\n```\n# iptables -A TCP -p tcp --dport 80 -j ACCEPT\n```\n\nTo accept incoming TCP connections on port 443 for a web server (HTTPS):\n\n```\n# iptables -A TCP -p tcp --dport 443 -j ACCEPT\n```\n\nTo allow remote SSH connections (on port 22):\n\n```\n# iptables -A TCP -p tcp --dport 22 -j ACCEPT\n```\n\nTo accept incoming TCP/UDP requests for a DNS server (port 53):\n\n```\n# iptables -A TCP -p tcp --dport 53 -j ACCEPT\n# iptables -A UDP -p udp --dport 53 -j ACCEPT\n```\n\nSee iptables(8) for more advanced rules, like matching multiple ports.\n\n"
    },
    {
      "title": "Port knocking",
      "level": 4,
      "content": "Port knocking is a method to externally open ports that, by default, the firewall keeps closed. It works by requiring connection attempts to a series of predefined closed ports. When the correct sequence of port \"knocks\" (connection attempts) is received, the firewall opens certain port(s) to allow a connection. See Port knocking for more information.\n\n"
    },
    {
      "title": "Protection against spoofing attacks",
      "level": 3,
      "content": "Blocking reserved local addresses incoming from the internet or local network is normally done through setting rp_filter (Reverse Path Filter) in sysctl to 1. To do so, add the following line to your /etc/sysctl.d/90-firewall.conf file (see sysctl for details) to enable source address verification which is built into Linux kernel itself. The verification by the kernel will handle spoofing better than individual iptables rules for each case.\n\n```\nnet.ipv4.conf.all.rp_filter=1\n```\n\nThis can be done with netfilter instead if statistics (and better logging) are desired:\n\n```\n# iptables -t mangle -I PREROUTING -m rpfilter --invert -j DROP\n```\n\nFor niche setups where asymmetric routing is used, the rp_filter=2 sysctl option needs to be used instead. Passing the --loose switch to the rpfilter module will accomplish the same thing with netfilter.\n\n"
    },
    {
      "title": "\"Hide\" your computer",
      "level": 3,
      "content": "If you are running a desktop machine, it might be a good idea to block some incoming requests.\n\n"
    },
    {
      "title": "Block ping request",
      "level": 4,
      "content": "A 'Ping' request is an ICMP packet sent to the destination address to ensure connectivity between the devices. If your network works well, you can safely block all ping requests. It is important to note that this does not actually hide your computer — any packet sent to you is rejected, so you will still show up in a simple nmap \"ping scan\" of an IP range.\n\nThis is rudimentary \"protection\" and makes life difficult when debugging issues in the future. This should only be done for educational purposes.\n\nTo block echo requests, add the following line to your /etc/sysctl.d/90-firewall.conf file (see sysctl for details):\n\n```\nnet.ipv4.icmp_echo_ignore_all = 1\n```\n\nMore information in iptables(8), or reading the docs and examples on the webpage http://www.snowman.net/projects/ipt_recent/\n\n"
    },
    {
      "title": "Tricking port scanners",
      "level": 4,
      "content": "- This opens you up to a form of DoS. An attack can send packets with spoofed IPs and get them blocked from connecting to your services.\n- This trick may block a legitimate IP address if some packets from this address to the destination port are regarded as INVALID by module conntrack. To avoid blacklisting, a workaround is to allow all packets directed to that particular destination port.\n\nPort scans are used by attackers to identify open ports on your computer. This allows them to identify and fingerprint your running services and possibly launch exploits against them.\n\nThe INVALID state rule will take care of every type of port scan except UDP, ACK and SYN scans (-sU, -sA and -sS in nmap respectively).\n\nACK scans are not used to identify open ports, but to identify ports filtered by a firewall. Due to the SYN check for all TCP connections with the state NEW, every single packet sent by an ACK scan will be correctly rejected by a TCP RESET packet. Some firewalls drop these packets instead, and this allows an attacker to map out the firewall rules.\n\nThe recent module can be used to trick the remaining two types of port scans. The recent module is used to add hosts to a \"recent\" list which can be used to fingerprint and stop certain types of attacks. Current recent lists can be viewed in /proc/net/xt_recent/.\n\nIn a SYN scan, the port scanner sends a SYN (synchronization) packet to every port to initiate a TCP connection. Closed ports return a TCP RESET packet, or get dropped by a strict firewall, while open ports return a SYN ACK packet.\n\nThe recent module can be used to keep track of hosts with rejected connection attempts and return a TCP RESET for any SYN packet they send to open ports as if the port was closed. If an open port is the first to be scanned, a SYN ACK will still be returned, so running applications such as ssh on non-standard ports is required for this to work consistently.\n\nFirst, insert a rule at the top of the TCP chain. This rule responds with a TCP RESET to any host that got onto the TCP-PORTSCAN list in the past sixty seconds. The --update switch causes the recent list to be updated, meaning the 60 second counter is reset.\n\n```\n# iptables -I TCP -p tcp -m recent --update --rsource --seconds 60 --name TCP-PORTSCAN -j REJECT --reject-with tcp-reset\n```\n\nNext, the rule for rejecting TCP packets need to be modified to add hosts with rejected packets to the TCP-PORTSCAN list.\n\n```\n# iptables -D INPUT -p tcp -j REJECT --reject-with tcp-reset\n# iptables -A INPUT -p tcp -m recent --set --rsource --name TCP-PORTSCAN -j REJECT --reject-with tcp-reset\n```\n\nUDP port scans are similar to TCP SYN scans except that UDP is a \"connectionless\" protocol. There are no handshakes or acknowledgements. Instead, the scanner sends UDP packets to each UDP port. Closed ports should return ICMP port unreachable messages, and open ports do not return a response. Since UDP is not a \"reliable\" protocol, the scanner has no way of knowing if packets were lost, and has to do multiple checks for each port that does not return a response.\n\nThe Linux kernel sends out ICMP port unreachable messages very slowly, so a full UDP scan against a Linux machine would take over 10 hours. However, common ports could still be identified, so applying the same countermeasures against UDP scans as SYN scans is a good idea.\n\nFirst, add a rule to reject packets from hosts on the UDP-PORTSCAN list to the top of the UDP chain.\n\n```\n# iptables -I UDP -p udp -m recent --update --rsource --seconds 60 --name UDP-PORTSCAN -j REJECT --reject-with icmp-port-unreachable\n```\n\nNext, modify the reject packets rule for UDP:\n\n```\n# iptables -D INPUT -p udp -j REJECT --reject-with icmp-port-unreachable\n# iptables -A INPUT -p udp -m recent --set --rsource --name UDP-PORTSCAN -j REJECT --reject-with icmp-port-unreachable\n```\n\nIf either or both of the portscanning tricks above were used, the final default rule is no longer the last rule in the INPUT chain. It needs to be the last rule, or it would intercept the trick port scanner rules you just added, rendering them useless. Simply delete (-D) the rule, then add it again using append (-A), which will place it at the end of the chain.\n\n```\n# iptables -D INPUT -j REJECT --reject-with icmp-proto-unreachable\n# iptables -A INPUT -j REJECT --reject-with icmp-proto-unreachable\n```\n\n"
    },
    {
      "title": "Protection against other attacks",
      "level": 3,
      "content": "See the sysctl#TCP/IP stack hardening for relevant kernel parameters.\n\n"
    },
    {
      "title": "Bruteforce attacks",
      "level": 4,
      "content": "Unfortunately, bruteforce attacks on services accessible via an external IP address are common. One reason for this is that the attacks are easy to perform with the many tools available. Fortunately, there are a number of ways to protect the services against them. One is the use of appropriate iptables rules which activate and blacklist an IP after a set number of packets attempt to initiate a connection. Another is the use of specialised daemons that monitor the logfiles for failed attempts and blacklist accordingly.\n\nTwo packages that ban IPs after too many password failures are Fail2ban or, for sshd in particular, Sshguard. These two applications update iptables rules to reject temporarily or permanently future connections from attackers.\n\nThe following rules give an example configuration to mitigate SSH bruteforce attacks using iptables.\n\n```\n# iptables -N IN_SSH\n# iptables -N LOG_AND_DROP\n# iptables -A INPUT -p tcp --dport ssh -m conntrack --ctstate NEW -j IN_SSH\n# iptables -A IN_SSH -m recent --name sshbf --rttl --rcheck --hitcount 3 --seconds 10 -j LOG_AND_DROP\n# iptables -A IN_SSH -m recent --name sshbf --rttl --rcheck --hitcount 4 --seconds 1800 -j LOG_AND_DROP \n# iptables -A IN_SSH -m recent --name sshbf --set -j ACCEPT\n# iptables -A LOG_AND_DROP -j LOG --log-prefix \"iptables deny: \" --log-level 7\n# iptables -A LOG_AND_DROP -j DROP\n```\n\nMost of the rules should be self-explanatory: the first one allows for a maximum of three connection packets in ten seconds and drops further attempts from this IP. The next rule adds a quirk by allowing a maximum of four hits in 30 minutes. This is done because some bruteforce attacks are actually performed slow and not in a burst of attempts. The rules employ a number of additional options. To read more about them, check the original reference for this example in compilefailure.blogspot.com. The LOG_AND_DROP chain is used for logging dropped connections.\n\nThe above rules can be used to protect any service, though the SSH daemon is probably the most often required one.\n\nIn terms of order, one must ensure that -A INPUT -p tcp --dport ssh -m conntrack --ctstate NEW -j IN_SSH is at the right position in the iptables sequence: it should come before the TCP chain is attached to INPUT in order to catch new SSH connections first. If all the previous steps of this wiki have been completed, the following positioning works:\n\n```\n...\n-A INPUT -m conntrack --ctstate INVALID -j DROP\n-A INPUT -p icmp -m icmp --icmp-type 8 -m conntrack --ctstate NEW -j ACCEPT\n-A INPUT -p tcp --dport 22 -m conntrack --ctstate NEW -j IN_SSH\n-A INPUT -p udp -m conntrack --ctstate NEW -j UDP\n-A INPUT -p tcp --tcp-flags FIN,SYN,RST,ACK SYN -m conntrack --ctstate NEW -j TCP\n...\n```\n\n"
    },
    {
      "title": "IPv6",
      "level": 3,
      "content": "If you do not use IPv6, you can consider disabling it, otherwise follow these steps to enable the IPv6 firewall rules.\n\nCopy the IPv4 rules used in this example as a base, and change any IPs from IPv4 format to IPv6 format:\n\n```\n# cp /etc/iptables/iptables.rules /etc/iptables/ip6tables.rules\n```\n\nA few of the rules in this example have to be adapted for use with IPv6. The ICMP protocol has been updated in IPv6, replacing the ICMP protocol for use with IPv4. Hence, the reject error return codes --reject-with icmp-port-unreachable and --reject-with icmp-proto-unreachable have to be converted to ICMPv6 codes.\n\nThe available ICMPv6 error codes are listed in RFC 4443, which specifies that connection attempts blocked by a firewall rule should use --reject-with icmp6-adm-prohibited. Doing so will basically inform the remote system that the connection was rejected by a firewall, rather than a listening service.\n\nIf it is preferred not to explicitly inform about the existence of a firewall filter, the packet may also be rejected without the message:\n\n```\n-A INPUT -j REJECT\n```\n\nThe above will reject with the default return error of --reject-with icmp6-port-unreachable. You should note though, that identifying a firewall is a basic feature of port scanning applications and most will identify it regardless.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nIn the next step make sure the protocol and extension are changed to be IPv6 appropriate for the rule regarding all new incoming ICMP echo requests (pings):\n\n```\n# ip6tables -A INPUT -p ipv6-icmp --icmpv6-type 128 -m conntrack --ctstate NEW -j ACCEPT\n```\n\nNetfilter conntrack does not appear to track ICMPv6 Neighbor Discovery Protocol (the IPv6 equivalent of ARP), so we need to allow ICMPv6 traffic regardless of state for all directly attached subnets. The following should be inserted after dropping --ctstate INVALID, but before any other DROP or REJECT targets, along with a corresponding line for each directly attached subnet:\n\n```\n# ip6tables -A INPUT -s fe80::/10 -p ipv6-icmp -j ACCEPT\n```\n\nIf you want to enable DHCPv6, you need to accept incoming connections on UDP port 546:\n\n```\n# ip6tables -A INPUT -p udp --sport 547 --dport 546 -j ACCEPT\n```\n\nSince there is no kernel reverse path filter for IPv6, you may want to enable one in ip6tables with the following:\n\n```\n# ip6tables -t mangle -A PREROUTING -m rpfilter -j ACCEPT\n# ip6tables -t mangle -A PREROUTING -j DROP\n```\n\n"
    },
    {
      "title": "Saving the rules",
      "level": 3,
      "content": "The rule sets are now finished and should be saved to a file so that they can be loaded on every boot.\n\nSave the IPv4 and IPv6 rules with these commands:\n\n```\n# iptables-save -f /etc/iptables/iptables.rules\n# ip6tables-save -f /etc/iptables/ip6tables.rules\n```\n\n"
    },
    {
      "title": "Resulting ip6tables.rules file",
      "level": 3,
      "content": "Example of ip6tables.rules file after running all the commands from above:\n\n```\n/etc/iptables/ip6tables.rules\n```\n\n```\n# Generated by ip6tables-save v1.8.2 on Sat Apr 20 10:53:41 2019\n*filter\n:INPUT DROP [0:0]\n:FORWARD DROP [0:0]\n:OUTPUT ACCEPT [0:0]\n:TCP - [0:0]\n:UDP - [0:0]\n-A INPUT -m conntrack --ctstate RELATED,ESTABLISHED -j ACCEPT\n-A INPUT -i lo -j ACCEPT\n-A INPUT -m conntrack --ctstate INVALID -j DROP\n-A INPUT -s fe80::/10 -p ipv6-icmp -j ACCEPT\n-A INPUT -p udp --sport 547 --dport 546 -j ACCEPT\n-A INPUT -p udp -m conntrack --ctstate NEW -j UDP\n-A INPUT -p tcp -m tcp --tcp-flags FIN,SYN,RST,ACK SYN -m conntrack --ctstate NEW -j TCP\n-A INPUT -p udp -j REJECT --reject-with icmp6-adm-prohibited\n-A INPUT -p tcp -j REJECT --reject-with tcp-reset\n-A INPUT -j REJECT --reject-with icmp6-adm-prohibited\n-A INPUT -p ipv6-icmp -m icmp6 --icmpv6-type 128 -m conntrack --ctstate NEW -j ACCEPT\nCOMMIT\n# Completed on Sat Apr 20 10:53:41 2019\n```\n\nThen enable and start iptables.service and the ip6tables.service. Check the status of the services to make sure the rules are loaded correctly.\n\n"
    },
    {
      "title": "Setting up a NAT gateway",
      "level": 2,
      "content": "This section of the guide deals with NAT gateways. It is assumed that you already read the first part of the guide and set up the INPUT, OUTPUT, TCP and UDP chains like described above. All rules so far have been created in the filter table. In this section, we will also have to use the nat table. There is an ASCII art of the situation at Controlling What To NAT.\n\n"
    },
    {
      "title": "Creating necessary chains",
      "level": 4,
      "content": "In our setup, we will create two new chains in the filter table, fw-interfaces and fw-open, using the following commands:\n\n```\n# iptables -N fw-interfaces\n# iptables -N fw-open\n```\n\n"
    },
    {
      "title": "Setting up the FORWARD chain",
      "level": 4,
      "content": "Setting up the FORWARD chain is similar to the INPUT chain in the first section.\n\nNow we set up a rule with the conntrack match, identical to the one in the INPUT chain:\n\n```\n# iptables -A FORWARD -m conntrack --ctstate RELATED,ESTABLISHED -j ACCEPT\n```\n\nThe next step is to enable forwarding for trusted interfaces and to make all packets pass the fw-open chain.\n\n```\n# iptables -A FORWARD -j fw-interfaces \n# iptables -A FORWARD -j fw-open\n```\n\nThe remaining packets are denied with an ICMP message:\n\n```\n# iptables -A FORWARD -j REJECT --reject-with icmp-host-unreachable\n# iptables -P FORWARD DROP\n```\n\n"
    },
    {
      "title": "Setting up the fw-interfaces and fw-open chains",
      "level": 4,
      "content": "The meaning of the fw-interfaces and fw-open chains is explained later, when we deal with the POSTROUTING and PREROUTING chains in the nat table, respectively.\n\n"
    },
    {
      "title": "Setting up the nat table",
      "level": 3,
      "content": "All over this section, we assume that the outgoing interface (the one with the public internet IP) is ppp0. Keep in mind that you have to change the name in all following rules if your outgoing interface has another name.\n\n"
    },
    {
      "title": "Setting up the POSTROUTING chain",
      "level": 4,
      "content": "Now, we have to define who is allowed to connect to the internet. Let us assume we have the subnet 192.168.0.0/24 (which means all addresses that are of the form 192.168.0.*) on eth0. We first need to accept the machines on this interface in the FORWARD table, that is why we created the fw-interfaces chain above:\n\n```\n# iptables -A fw-interfaces -i eth0 -j ACCEPT\n```\n\nNow, we have to alter all outgoing packets so that they have our public IP address as the source address, instead of the local LAN address. To do this, we use the MASQUERADE target:\n\n```\n# iptables -t nat -A POSTROUTING -s 192.168.0.0/24 -o ppp0 -j MASQUERADE\n```\n\nDo not forget the -o ppp0 parameter above. If you omit it, your network will be screwed up.\n\nLet us assume we have another subnet, 10.3.0.0/16 (which means all addresses 10.3.*.*), on the interface eth1. We add the same rules as above again:\n\n```\n# iptables -A fw-interfaces -i eth1 -j ACCEPT\n# iptables -t nat -A POSTROUTING -s 10.3.0.0/16 -o ppp0 -j MASQUERADE\n```\n\nThe last step is to enable packet forwarding (if it is not already enabled).\n\nMachines from these subnets can now use your new NAT machine as their gateway. Note that you may want to set up a DNS and DHCP server to simplify network settings on the client machines. This is not the topic of this guide.\n\n"
    },
    {
      "title": "Setting up the PREROUTING chain",
      "level": 4,
      "content": "Sometimes, we want to change the address of an incoming packet from the gateway to a LAN machine. To do this, we use the fw-open chain defined above, as well as the PREROUTING chain in the nat table in the following two simple examples.\n\nFirst, we want to change all incoming SSH packets (port 22) to the ssh server of the machine 192.168.0.5:\n\n```\n# iptables -t nat -A PREROUTING -i ppp0 -p tcp --dport 22 -j DNAT --to 192.168.0.5\n# iptables -A fw-open -d 192.168.0.5 -p tcp --dport 22 -j ACCEPT\n```\n\nThe second example will show you how to change packets to a different port than the incoming port. We want to change any incoming connection on port 8000 to our web server on 192.168.0.6, port 80:\n\n```\n# iptables -t nat -A PREROUTING -i ppp0 -p tcp --dport 8000 -j DNAT --to 192.168.0.6:80\n# iptables -A fw-open -d 192.168.0.6 -p tcp --dport 80 -j ACCEPT\n```\n\nThe same setup also works with udp packets.\n\n"
    },
    {
      "title": "Saving the rules",
      "level": 3,
      "content": "Save the rules:\n\n```\n# iptables-save -f /etc/iptables/iptables.rules\n```\n\nThis assumes that you have followed the steps above to enable the iptables systemd service.\n\n"
    },
    {
      "title": "See Also",
      "level": 2,
      "content": "- Methods to block SSH attacks\n- Using iptables to block brute force attacks\n- 18 examples of basic iptables rules\n- 25 Most Frequently Used Linux IPTables Rules Examples\n\n"
    }
  ]
}