{
  "title": "Snapraid",
  "url": "https://wiki.archlinux.org/title/Snapraid",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "SnapRAID is a folder-based backup tool that behaves like a software or hardware RAID5/6 disk raid, but is not a disk raid itself. There is no realtime recovery, free space between disks cannot be combined and manual excution of backup is needed.\n\nBecause of the nature of folder-based backup, SnapRAID is more flexible and simpler than software raids. Although disk raids have advantages such as realtime backup, increased complexity or reduced performance are the drawback. Not to mention a two-disk failure or a SATA URE (Unrecoverable Read Error) happening to RAID5 could damage all data, which is not the case with SnapRAID. Thus the use of SnapRAID is logical when backup is the main goal rather than preventing a system from going offline due to disk failure.\n\nSnapRAID works by storing parity of all folders to another disk. The destination disk which the parity file is stored on should be the largest. Other disks do not have this restriction and can be of any size. Summing up, SnapRAID is suitable for media centers where files are usually large and rarely changed. SnapRAID is highly flexible and can be configured to add/remove disk at any time. Also, more than one redundant disks are supported.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the snapraidAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "See also Manual for SnapRAID[dead link 2025-04-06 ⓘ].\n\nWe have four disks with data on them, and want to save a redundant just in case. These four disks are mounted at:\n\n- /mnt/sda\n- /mnt/sdb\n- /mnt/sdc\n- /mnt/sdd\n\nAnd an empty redundant disk mounted at:\n\n- /mnt/sde\n\nLet us create a configuration file! Lines begining with \"content\" designate the path to a content file that stores SnapRAID metadata.\n\n```\n/etc/snapraid.conf\n```\n\n```\ndata d1 /mnt/sda\ndata d2 /mnt/sdb\ndata d3 /mnt/sdc\ndata d4 /mnt/sdd/I_only_want_to_backup_this_folder\nparity /mnt/sde/SnapRAID.parity\ncontent /mnt/sda/SnapRAID.content\ncontent /mnt/sdb/SnapRAID.content\ncontent /mnt/sdc/SnapRAID.content\ncontent /var/snapraid/SnapRAID.content\nexclude /lost+found/\n```\n\n"
    },
    {
      "title": "Backup",
      "level": 3,
      "content": "To begin backup process, run:\n\n```\n# snapraid sync\n```\n\n"
    },
    {
      "title": "Undeletion",
      "level": 3,
      "content": "To revert a file or folder to an earlier version (undelete):\n\n```\n# snapraid fix -f FILENAME\n```\n\n( using compelete PATH of file or dir is better. file path is relative to all root dir )\n\n"
    },
    {
      "title": "Disk recovery",
      "level": 3,
      "content": "If the disk is mounted at /mnt/sda is dead and being replaced, edit /etc/snapraid.conf before doing a recovery.\n\nChange the line\n\n```\ndata d1 /mnt/sda\n```\n\nto\n\n```\ndata d1 /mnt/sda_new\n```\n\nTo begin recovery\n\n```\n# snapraid -d d1 -l recovery.log fix\n```\n\n"
    }
  ]
}