{
  "title": "Sound system",
  "url": "https://wiki.archlinux.org/title/Sound_system",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Codecs\n- MIDI\n- PC speaker\n\nThis article is about basic sound management. For advanced topics see Professional audio.\n\n"
    },
    {
      "title": "General information",
      "level": 2,
      "content": "The Arch sound system consists of several levels:\n\n- Drivers and interface – hardware support and control\n- Usermode API (libraries) – utilized and required by applications\n- Usermode sound servers (optional) – best for the complex desktop, needed for multiple simultaneous audio applications, and vital for more advanced capabilities e.g. pro audio\n- Sound frameworks (optional) – higher-level application environments not involving server processes\n\nA default Arch installation already includes the kernel sound system (ALSA), and lots of utilities for it can be installed from the official repositories. If you want additional features you can install one of several sound servers.\n\n"
    },
    {
      "title": "Drivers and interface",
      "level": 2,
      "content": "- ALSA — The default Linux kernel component providing device drivers and lowest-level support for audio hardware.\n\n- OSS — An alternative sound architecture for Unix-like and POSIX-compatible systems which has been superseded by ALSA due to a licensing change, but got opened back in 2007.\n\n"
    },
    {
      "title": "Sound servers",
      "level": 2,
      "content": "- JACK Audio Connection Kit — Sound server for pro audio use, especially for low-latency applications including recording, effects, realtime synthesis, and many others.\n\n- Network Audio System — An open-source, network-transparent, client–server audio transport system.\n\n- PipeWire — Multimedia framework intended as a replacement for both PulseAudio and JACK, supports containers like Flatpak.\n\n- PulseAudio — General purpose sound system intended for out-of-the-box audio, multiple simultaneous inputs, can handle complex setups; is network-capable.\n\nSee also Wikipedia:Sound server.\n\n"
    }
  ]
}