{
  "title": "Spacefm",
  "url": "https://wiki.archlinux.org/title/Spacefm",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- File manager functionality\n- PCManFM\n- Window manager\n\nSpaceFM (a fork of PCManFM) is a lightweight, highly configurable, desktop-independent multi-panel tabbed file and desktop manager. It features a built-in virtual file system, a udev-based device manager, a customisable menu system, and Bash integration.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the spacefmAUR package.\n\nOr you can use spacefm-gtk2AUR package if you need a GTK 2 version.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "See the User's Manual.\n\n"
    },
    {
      "title": "File searches",
      "level": 3,
      "content": "SpaceFM provides a built-in file search feature similar to catfish:\n\n```\n$ spacefm -f\n```\n\n"
    },
    {
      "title": "Desktop management",
      "level": 3,
      "content": "SpaceFM includes a lightweight desktop manager. [1]. It replaces the desktop menu, adds desktop icons, and sets the wallpaper.\n\nTo restore the native window manager menu, open Desktop preferences\n\n```\n$ spacefm --desktop-pref\n```\n\nand enable the Right click shows WM menu option in the Desktop tab. Consider adding the above command to a keybind and/or the native desktop menu for easy access.\n\nTo run SpaceFM as a daemon without it managing the desktop [2], use:\n\n```\n$ spacefm -d\n```\n\nHow SpaceFM may be autostarted as a daemon process or to manage the desktop for a standalone window manager will depend on the window manager itself. Should a window manager not provide an autostart file, edit xinitrc or xprofile.\n\n"
    },
    {
      "title": "Mounting remote hosts",
      "level": 3,
      "content": "SpaceFM supports mounting remote hosts via udevil. To add a remote host, add the access URL into the URL bar. A terminal window should pop up showing the mounting process which is useful for error tracing.\n\nAn overview of the supported remote hosts is available in the udevil help. For example to mount a remote FTP server:\n\n```\nftp://user:pass@sys.domain/share\n```\n\n"
    },
    {
      "title": "Open archive in app instead of extracting",
      "level": 3,
      "content": "By default, SpaceFM is configured to extract an archive when double clicking on it. If you instead want to open it with your default archive manager such as file-roller, then select an archive, right-click for context menu, and then: Open / Archive default / Open With App\n\n"
    },
    {
      "title": "Show custom context menu command only on files/folders",
      "level": 3,
      "content": "If you have a custom context menu command that should be only shown on selection of files or folders, then add the following rules to Menu Item Properties -> Context:\n\n```\nMIME Type equals true\nFile Is Dir equals true\nFile Is Text equals true\n```\n\n"
    },
    {
      "title": "Columns are not resizeable",
      "level": 3,
      "content": "This should only happen on the first start of SpaceFM (GTK 2 version). [3]\n\n"
    },
    {
      "title": "Segmentation faults",
      "level": 3,
      "content": "If SpaceFM crashes with errors such as:\n\n```\nlocalhost kernel: [245086.687050] spacefm[30684]: segfault at 3e8000003e8 ip 00007fc95c586866 sp 00007fffb1dc9cc0 error 4 in libgtk-x11-2.0.so.0.2400.24[7fc95c446000+435000]\n```\n\nSpaceFM uses many different GUI elements, and is thus suspectible to a malfunctioning theme (especially in GTK 3). Try a different theme such as Raleigh (default theme). To do so for SpaceFM only, in GTK 2:\n\n```\nGTK2_RC_FILES=/usr/share/themes/Raleigh/gtk-2.0/gtkrc spacefm\n```\n\nSee [4] for details.\n\n"
    }
  ]
}