{
  "title": "Spammers",
  "url": "https://wiki.archlinux.org/title/Spammers",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Is the wiki missing documentation for a popular software package or coverage of an important topic? Or, is existing content in need of correction, updating, or expansion? Write your requests below and share your ideas...\n\n"
    },
    {
      "title": "Creation requests",
      "level": 2,
      "content": "Here, list requests for topics that you think should be covered on ArchWiki. If not obvious, explain why ArchWiki coverage is justified (rather than existing Wikipedia articles or other documentation). Furthermore, please consider researching and creating the initial article yourself (see Help:Editing for content creation help).\n\n"
    },
    {
      "title": "Left-Handed Adjustments for Desktop Environments",
      "level": 3,
      "content": "I was thinking it would be helpful for lefties if there were a list of configuration options for each desktop environment that facilitate left-handed use of mice and touchpads. I'm not sure if this is related enough to Arch to include in this wiki, but I haven't had a lot of luck finding information for my own DE (KDE) let alone for others. I will start writing down information, and if no one else thinks there should be a separate page for this, I'll just add the information I find to each individual DE's page. —ajrl 2013-08-11T15:09−06:00\n\n"
    },
    {
      "title": "iPXE",
      "level": 3,
      "content": "iPXE is a powerful network boot program with many features. Currently, there is no iPXE specific page to describe iPXE in details. There are some pages mentioning iPXE in the wiki, mostly related to network booting, without any further instruction on how to get iPXE to work. So I think it's worth to add a page with detailed iPXE explanation in the wiki. Alive4ever (talk) 10:08, 21 July 2016 (UTC)Reply\n\n"
    },
    {
      "title": "Missing redirects",
      "level": 3,
      "content": "- Linux namespaces\n- sysfs\n- lspci and lsusb\n- stty\n- terminfo (termcap)\n- LPD, LPR\n- JSON, XML, CSV, JS, CSS\n- Exif\n- CGI\n- SQL\n- YAML, TOML\n- Chromecast\n\n--Larivact (talk) 15:35, 21 October 2018 (UTC)Reply\n\n"
    },
    {
      "title": "Mirror troubleshooting",
      "level": 3,
      "content": "Unfortunately, Mirrors#Troubleshooting is a bit lacking and can definitely benefit from more information such as how to detect a bad mirror. A mirror becoming faulty is not extremely uncommon so this topic should definitely be covered, including who to tell about the bad mirror so it can e.g be removed from the mirrorlist.\n\nThis topic is impacting enough people that it is worth putting it into here.\n\n-- NetSysFire (talk) 00:07, 6 August 2021 (UTC)Reply\n\n"
    },
    {
      "title": "Random page - only with specific language ?",
      "level": 3,
      "content": "I like the \"Random page\", https://wiki.archlinux.org/title/Special:Random , but often it provides me the articles not in English, e.g. today fstab in Português which is above my pay-grade :-) Is it possible to call the random page url with an extra option and get e.g. only wiki articles in English ? Thanks. Ua4000 (talk) 09:34, 19 May 2023 (UTC)Reply\n\n"
    },
    {
      "title": "Observability",
      "level": 3,
      "content": "This article could start by quoting and linking to the Wikipedia article on the same topic. I also have an idea of adding a brief blurb to the General Recommendations page, or even to the list of applications (with a link to the main Observability article prominently at the top of the section).\n\nAs a budding cloud engineer, I've become more interested in observability in web applications/services, and in my own hobby projects. I've done some research into it, and I'm slightly familiar with a few different options. Most of what I found are open source, and I'd like to link to some options from within this Observability page, with possibly full-blown wiki articles describing various options. There are more turnkey, commercial offerings as well, and we could list some of those with links for more information. I actually went with one of those to start off with, mainly so I could learn which features were important to me, before I cobble together some of the more manual options.\n\nWhen I was searching for ways to monitor my personal web projects, I stumbled upon an ad for New Relic, one of the many commercial services. What struck me as interesting, was that most of New Relic's tools are open source (under an Apache 2.0 license, written in Go). They offer 100GB of data upload per month for free, which has been plenty for observing my hobby projects on my VPS. I've already drafted (but not published) PKGBUILDs for some of the tools I've used, mostly from their pre-compiled debs. There are PKGBUILDs in the AUR (like newrelic-cliAUR and newrelic-infraAUR), but I didn't see a Wiki article describing how to use them. Unfortunately Arch Linux isn't currently supported by New Relic, and their method of bootstrapping New Relic using only the newrelic command (part of newrelic-cliAUR) didn't work for me so I've had to follow their dispersed manual instructions. I've run across a few issues so I've gotten onto their forums to seek help. They have community members who provide the first line of support, and for at least one of my issues they've actually created a New Relic support case for it.\n\nI even learned about Pressure Stall Information, and wrote my own scripts to monitor and alert when CPU, I/O, or memory pressure gets too high. It's in a public Git repository, but I wanted shore up some of the documentation before I share a link to it anywhere.\n\nWould an Arch Wiki article like this be worthwhile? I think it would be, but I didn't want to simply start writing it without having a discussion first. Ectospasm (talk) 18:00, 17 December 2023 (UTC)Reply\n\n"
    },
    {
      "title": "Installation Recipes",
      "level": 3,
      "content": "Thanks to the rolling release of Arch Linux, I've only actually installed Arch a handful of times. And the Wiki is wonderful in documenting the process. The first time I ever installed Arch, I didn't have another computer to access the wiki, and didn't think to use my phone. I just used separate virtual consoles on the desktop system I was using, and had the wiki loaded in a text mode browser (elinks or lynx, I don't remember which). I may have even enabled GPM so I could copy and paste with my mouse in the Linux console (this part I don't rightly remember).\n\nHowever, each time I've installed Arch I've always wanted something specific, which generally meant searching, following, and backtracking through several Wiki articles to achieve my end. Now that I have a new laptop, and I'm planning on installing Arch on it very soon, I've drafted a \"recipe\" for myself to follow. I've been told that publishing such a \"recipe\" is against the spirit of the Wiki, but I'm finding it's a slog to go through all the articles to piece together how I want to do it, especially without planning ahead. I think many Archers might find such \"recipes\" useful, if only to get ideas for their own systems.\n\nI think the format of these \"recipes\" would need to be debated, as I'm not sure what would be best. We definitely don't want to replicate or repeat sections within the wiki. Here's my proposed format, but I'm not settled that this is the best way to do it. First, start with hardware prerequisites for the recipe. A recipe for a file server or Network Attached Server (NAS) would be different from a laptop, or an x86_64 handheld or mobile device, as would a recipe for a virtual private server (VPS) or other virtual machine. The recipe could go on to describe the partition layout, filesystems, bootloader, network topology and corresponding network manager, etc. The reasoning behind each decision can be explained in whatever detail the author wants. It could then provide a link to a (pseudo-)script that executes it, possibly pausing where the user is intended to make a decision. I'm not familiar with the Archinstall, but if these work well perhaps they could be an optional component of the Archinstall script (this might be getting ahead of myself, though).\n\nWhat would be the proper way to address this kind of documentation, and keep to the spirit of the wiki? Or is this really a bad idea? If it is a bad idea, why would it be so? I mean, such a section in the Wiki could have a disclaimer stating that it is a requirement for readers to understand the installation process, and not blindly follow what's listed. Of course, links back to the Wiki articles describing how to perform each task should be all over these \"recipes,\" I don't think these are a substitute for understanding the installation guide. Maybe the wiki isn't the best place for this; the wiki could collect links to recipes by various users, and the recipes themselves could be hosted on the Arch Linux GitLab instance. Ectospasm (talk) 22:14, 17 December 2023 (UTC)Reply\n\n"
    },
    {
      "title": "Article about how to optimize for Privacy",
      "level": 3,
      "content": "I know that Arch doesn't want to follow an Ideology like some other distros do, but wants to give everyone any options. But as we do already have an article about how to improve you System towards other goals like Security or Improving performance i think an article, at with at least links to the various ways to improve your system for Privacy would be a good idea.\n\nEspecially because on many pages like NetworkManager/Privacy or Firefox/Privacy we already have pages about specific applications Privacy related config and if you search beyond arch, especially when it comes to linux system config, you have to look at a bunch of sites and sometimes change things to make them work on arch.\n\nSolarpunkJulian (talk) 18:00, 17 September 2024 (UTC)Reply\n\n"
    },
    {
      "title": "Article about AppImage",
      "level": 3,
      "content": "We have a dedicated page about Flatpak, we might want to have a short explanation about what AppImages are, how to use them, if there are tips and tricks about them or security best practices etc…\n\n--Erus Iluvatar (talk) 18:06, 8 April 2025 (UTC)Reply\n\n"
    },
    {
      "title": "Modification requests",
      "level": 2,
      "content": "Here, list requests for correction or other modification of existing articles. Only systemic modifications that affect multiple articles should be included here. If a specific page needs modification, use that page's discussion or talk page instead and one of the article status templates.\n\nAs a rolling release, Arch is constantly receiving updates and improvements. Because of this the Arch wiki must be updated quickly to reflect these changes.\n\n"
    },
    {
      "title": "Change drive naming/accessing to UUID?",
      "level": 3,
      "content": "Trying to install drives with/out Luks, LVM on internal, external drives is quite complicated currently. Following the ralated articles suggest different ways of reaching the goal. Many different drive name conventions are suggested, eg.:\n\n- /dev/sda2\n- /dev/md0\n- /dev/mapper/md/0\n- /dev/mapper/vgroup-lvm-root\n- /dev/vgroup-luks/root\n- ...\n\nSome of them don't work with portable external drives. This overcomplicates setting up encrypted drives in different situations. My suggestion is, to change all drive related articles to one specific solution of addressing drives universal. Currently I think of UUDI drive naming as a way to go. This would ease the process of drive naming in all kinds of situations:\n\n- The reader is guided through system setup along one red line\n- Troubleshootiing \"no drie found\" is strait forward\n- Many sections become clearer to read even when not reading the whole article\n- Articles are easier to write and maintain\n- Beginners have an easier read and geta better idea of how to access drives\n- Accessing internal/external encrypted drives is easy\n\n' LMV or other virtual file systems are easier to describe and setup\n\nOk, I know it is a big suggestion. I wanted to bring it up here, bacause I have the impression that following one primary path would help a lot - everyone involved. It doesn't need to be done in one day. While I think to have one suggested guideline would be a good start. Then with thain mind, we all have it easier to change those sections while Writing/editing Wiki entries.\n\nT.ask (talk) 11:22, 30 March 2015 (UTC)Reply\n\n- \"mount /dev/disks/by-uuid/e9ea05ce-0ccb-87a1-c71e-90fab8be1944 /mnt\"\n\n- \"/dev/disks/by-uuid/[UUID] /mnt\"\n\n- \"mount /dev/sda3 or\n- /dev/mapper/vgroup--lvm-root or\n- /dev/md/0 or\n- /dev/md0 or\n- ... /mnt\"\n\n- \"I just need to alter [UUID]\"\n\n- Can I use that example's local path in my case, too?\n- What's my case anyway? And how is it different for the one provided?\n- Is my drive IDE, SATA or ... what?\n- Where and how is the correct format of my drive/partitions's path?\n- I need an example to boot my USB drive everywhere. That provided example doesn't work for me. Where is the article I need to know?\n- I skimmed through many articles, no success so far. There must be one, but where?\n- I have an Luks, Raid, LVM (or mixed) situation here. The current article just uses /dev/sdi3. What to do?\n- Which article do I need to read first? I can't use the current example. How about alternatives?\n\n- We get a good article structure for the writer, reader and maintainer.\n- The provided method will work in either situation (local/mobile/..).\n- All alternative methods can be listed in one conversion article/table.\n\n- Great, I already know how to determine UUIDs. I just change it..\n\n- Just enter lsblk -f and it's obvious which UUID points to which drive in any context (raid, luks, lvm, ...). As this Get UUID example shows, just copy the corresponding UUID and use it with all UUID Wiki examples. IMHO it's quite easy.\n\n"
    },
    {
      "title": "Drop of i686 support",
      "level": 3,
      "content": "Following [1] I've done these edits for the moment:\n\n- Arch Linux\n- Arch compared to other distributions\n- Arch Linux April Jokes\n- FAQ\n- Installation guide\n\nThere are so many other articles that need updating, and also the edits above will need to be amended after November 2017. I think it's better to decide here whether we remove all the i686 content immediately, or we keep it until the final deprecation and do the cleanup then.\n\n— Kynikos (talk) 08:57, 26 January 2017 (UTC)Reply\n\nI think it's good to keep Migrating between architectures around, it's also linked at least from the FAQ.\n\n— Kynikos (talk) 08:57, 26 January 2017 (UTC)Reply\n\nAbout Makepkg#Build 32-bit packages on a 64-bit system and Install bundled 32-bit system in 64-bit system I'm not sure, perhaps they may be useful for somebody during the transition?\n\n— Kynikos (talk) 08:57, 26 January 2017 (UTC)Reply\n\nFor some x86_64 capable hardware there are 32-bit UEFI restrictions. Example section: Unified Extensible Firmware Interface#UEFI Firmware bitness. It needs to be checked whether i386.efi bootloader files will continue to be built after i686 is dropped (FS#52772). Depending on result, it may be useful to rebase Category:Boot loaders content to x86_64 early on?\n\n--Indigo (talk) 08:45, 30 January 2017 (UTC)Reply\n\n"
    },
    {
      "title": "php-fpm",
      "level": 3,
      "content": "In preparation to making all (php) webapps use a dedicated user, I extended information on PostfixAdmin and realized, that the information on php-fpm is scattered all over the articles of nginx and apache (and probably all over some other web server pages as well). I think the citation/ linking in all of the web server pages and the php web application pages would greatly improve, if this information was moved to a dedicated page, or to a sub-page for PHP, as it is quite PHP specific (unlike e.g. uwsgi). Davezerave (talk) 00:55, 26 May 2019 (UTC)Reply\n\n"
    },
    {
      "title": "Templates & pages that need to be modified",
      "level": 3,
      "content": "I am modifying the template to deprecate Template:META Box Red, Template:META Box Blue and Template:META Box Green, but I cannot modify the Arabic template (probably because Arabic is arranged from right to left). These templates need to be modified:\n\n- Template:Warning (العربية)\n- Template:Note (العربية)\n- Template:TranslationStatus (العربية)\n- Template:Tip (العربية)\n\nSome Arabic pages also need to be modified, see Special:WhatLinksHere/Template:META_Box_Blue, Special:WhatLinksHere/Template:META_Box_Red and Special:WhatLinksHere/Template:META_Box_Green.\n\n-- Blackteahamburger (talk) 16:53, 11 June 2020 (UTC) (EDIT: 11:20, 31 July 2020 (UTC))Reply\n\n- Template:META Box Yellow is only used in Template:Committed identity, but there is no replacement class in MediaWiki:Common.css.\n- Template:META Box Red is still used in MediaWiki:Spamprotectiontext which is protected but also begs the same question as before.\n- Template:META Box Green is only used in two user pages : should anything be done to those before archiving ?\n- Template:META Box Blue is also only used in two user pages, so the same question applies.\n\n"
    },
    {
      "title": "php-legacy",
      "level": 3,
      "content": "PHP 8.2 update and introduction of legacy branch.\n\n- PHP page should add php-legacy\n- Pages mention PHP7 should update package and configuration.\n\n--Fengchao (talk) 01:23, 15 January 2023 (UTC)Reply\n\n"
    },
    {
      "title": "Information about older kernels/ program versions",
      "level": 3,
      "content": "Is there guidance on how long information about kernel and program versions should be kept ? e.g \"btrfs supports this as of linux 5.0\" or \"fdisk supports GPT since....\" It's mildly interesting when those are recent changes but a lot of occurrences on the wiki relate to versions which have been removed from repos for years... I think in most cases it adds unnecessary clutter, ideas ?\n\n-- Cvlc (talk) 12:39, 23 January 2023 (UTC)Reply\n\n"
    },
    {
      "title": "Localize the sidebar texts",
      "level": 3,
      "content": "I don't know if I should post it under here, but here it is.\n\nSince many of the languages' ArchWiki just directly sit on English ArchWiki, having sidebar being half-translated would be a bit weird.\n\nso, on MediaWiki:Sidebar, each second level item represents a link (texts on the left of | is the destination and on the right of it is the \"name\". I'll call these \"name\"s as \"message\"s below, you'll know the reason), and some of the first level item represents a title. When displaying the sidebar, MediaWiki will try to retrieve the name from the MediaWiki: namespace (every page in that namespace is called a system message). For example in current MediaWiki:Sidebar:\n\n```\nMediaWiki:Sidebar\n```\n\n```\n...\n* Interaction\n** :Category:Help|help\n** {{ns:Project}}:Contributing|Contributing\n...\n```\n\nTake Interaction as example. MediaWiki will first read the message MediaWiki:Interaction/user's display language (let's say Simplified Chinese, then it's MediaWiki:Interaction/zh-hans and assuming its content is 互动). If the page is there, the page's content 互动 will substitute \"Interaction\". If there isn't, then the root page, if still isn't, then leave it as-is. The whole mechanism may differ since the actual mechanism goes through a long list of language fallback (still take zh-hans, it may go through /zh-hans, /zh-hant, /en, root).\n\nSo, to localize the sidebar, we will going to create some MediaWiki: pages, or system messages, and their subpages with sub-title the corresponding interlanguage link prefix. Some of the messages are already translated by MediaWiki core, and I'll list those that aren't present now. I'd suggest renaming these pages as well to have kebab-case though, and then change them correspondingly in MediaWiki:Sidebar.\n\n```\nMediaWiki:Table of contents\nMediaWiki:Interaction\nMediaWiki:Contributing\nMediaWiki:Recent talks\nMediaWiki:Requests\n```\n\n(MediaWiki:Statistics is present due to Special:Statistics.)\n\nThanks! --Lakejason0 (talk) 13:52, 4 February 2023 (UTC)Reply\n\nTable content:\nen | zh-hans | zh-hant | note\nTable of contents | 目录 | 目錄\nInteraction | 参与 | 參與 | “Interaction” is a rather formal word in Chinese (at least for simp.), translated as \"Getting involved\".\nContributing | 贡献 | 貢獻\nRecent talks | 最近讨论 | 近期討論 | extended from \"Recent Changes\", thus also need a /zh-hk with content 最近討論.\nRequests | 请求 | 請求\n\n"
    },
    {
      "title": "Drop Qt4 content",
      "level": 3,
      "content": "The Qt4 major version of the Qt GUI toolkit has not been supported by the Qt Company since 2015. It also has not been a part of the Arch repos (only in the AUR) since 2019-05. I believe that documenting software in the AUR (!= providing official support for AUR packages) is within the scope of ArchWiki; I can only think of dwm right now, but I am sure that there are more. However, maintaining old Qt content means keeping it in the Qt page and related pages (!). As adoption of Qt6 ramps up, I think we should consider removing Qt4 content from the main wiki. I have not searched for the occurrences yet, but I at least volunteer to aggregate them somewhere for User:CodingKoopa/Removed content. -- CodingKoopa (talk) 16:12, 25 June 2023 (UTC)Reply\n\n"
    },
    {
      "title": "Update links to Intel domains",
      "level": 3,
      "content": "Intel has changed their domains and all the following links lead to some general landing page:\n\n- https://wiki.archlinux.org/title/Special:LinkSearch?target=https%3A%2F%2F01.org\n- https://wiki.archlinux.org/title/Special:LinkSearch?target=http%3A%2F%2Fintellinuxgraphics.org\n- https://wiki.archlinux.org/title/Special:LinkSearch?target=https%3A%2F%2Fcommunities.intel.com%2Fmessage\n\nActually all Intel links should be checked by a human, because the script used by the bot gets status 404 for most Intel links, even those that work fine...\n\n— Lahwaacz (talk) 09:18, 30 July 2023 (UTC)Reply\n\n"
    },
    {
      "title": "Bug migration",
      "level": 3,
      "content": "As announced on the Mailing list all bugs have been migrated to GitLab, and GitLab is the new bug tracker. The pages refereeing to bugs.archlinux.org (e.g. Bug reporting guidelines) must be updated to point to our GitLab.\n\n- Special:LinkSearch/https://bugs.archlinux.org\n\nKlausenbusk (talk) 20:42, 25 November 2023 (UTC)Reply\n\n"
    },
    {
      "title": "RFC: Vendor & Model Specific Discussion",
      "level": 3,
      "content": "Currently implementation detail about specific vendors and in some cases even specific models is spread out across multiple pages. This has two problems:\n\n- As somebody without the hardware: Generic pages are cluttered with discussion that is only relevant to a subset of users.\n- As somebody looking for help with specific hardware: I have to visit multiple different pages to find relevant information.\n\nFor example, if I have an ASUS laptop, I will find many things I need to know on the Laptop/ASUS page. But for some reason information on fan control is in Fan_speed_control#ASUS_laptops, there are notes about extra keys on Extra_keyboard_keys, etc.\n\nI would like to propose that all these hardware specific sections are moved to their associated articles. This includes troubleshooting sections for specific software where the information cannot be rewritten to be useful generally.\n\nThis would NOT include separate articles about specific topics such as ASUS_Linux, Asusctl, etc that already have their own page. This would also not include example pages such as GRUB/EFI_examples#ASUS which are just using the hardware as an example.\n\nComic-paralyze-image (talk) 18:51, 1 March 2025 (UTC)Reply\n\n"
    },
    {
      "title": "Bot requests",
      "level": 2,
      "content": "Here, list requests for repetitive, systemic modifications to a series of existing articles to be performed by a wiki bot.\n\n"
    },
    {
      "title": "Package links to wiki links",
      "level": 3,
      "content": "It'd be nice if a bot went around changing links to packages that have a wiki entry to links to the wiki entry (e.g. change git to git), possibly also for aur packages (e.g. dropboxAUR to dropbox). Jabranham (talk) 19:42, 31 July 2018 (UTC)Reply\n\n"
    },
    {
      "title": "Automatically add/update language links for languages hosted by external wikis",
      "level": 3,
      "content": "Some languages are hosted on external wikis, and I want the bot to automatically add / update language links for languages hosted on external wikis so that users do not need to add them manually. -- Blackteahamburger (talk) 15:27, 20 May 2020 (UTC)Reply\n\n"
    },
    {
      "title": "Hints for Template:Broken package link",
      "level": 3,
      "content": "Can the hints for Template:Broken package link marked on the localization page use the localized version? This allows users who do not understand English to understand the status of the software package. -- Blackteahamburger (talk) 11:34, 26 May 2020 (UTC)Reply\n\n"
    },
    {
      "title": "Arch's git URLs",
      "level": 3,
      "content": "Sooner or later git.archlinux.org will cease to exist. It's not clear when (or if) there will be redirects and after a project has moved to gitlab.archlinux.org, the repo in git.archlinux.org might not get updated anymore. Lets prepare to update the links in the wiki pages.\n\n- Special:LinkSearch/http://projects.archlinux.org\n- Special:LinkSearch/https://projects.archlinux.org\n- Special:LinkSearch/https://git.archlinux.org\n- Special:LinkSearch/git://projects.archlinux.org\n- Special:LinkSearch/git://git.archlinux.org\n- Special:LinkSearch/https://github.com/archlinux/\n\n-- nl6720 (talk) 08:47, 22 July 2020 (UTC)Reply\n\n"
    },
    {
      "title": "Dead interwiki links",
      "level": 3,
      "content": "We already flag external links, broken packages in the repositories and AUR: could we do the same for interwiki links? I've seen a few of those manually fixed recently, in particular on translations. --Erus Iluvatar (talk) 19:41, 2 March 2022 (UTC)Reply\n\n"
    }
  ]
}