{
  "title": "Sslh",
  "url": "https://wiki.archlinux.org/title/Sslh",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is a candidate for merging with List of applications/Security.** This article or section is a candidate for merging with List of applications/Security.\n\nThis article or section is a candidate for merging with List of applications/Security.\n\nsslh is a ssl/ssh multiplexer.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the sslh package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The default configuration file is located at /etc/sslh.cfg, which supports ssh, openvpn, xmpp, http, ssl, and anyprot protocols.\n\n2 additional configuration files are included in the package:\n\n- /usr/share/doc/sslh/basic.cfg, which is a basic configuration file that should provide sensible values for \"standard\" setup.\n- /usr/share/doc/sslh/example.cfg, which is provided as documentation to show what is possible. It should not be used as-is, and probably should not be used as a starting point for a working configuration.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Start/enable sslh-fork.service or sslh-select.service, depending on which option is right for your server:\n\n- sslh-fork forks a new process for each incoming connection. It is well-tested and very reliable, but incurs the overhead of many processes. If you're going to use sslh for a \"small\" setup (less than a dozen SSH connections and a low-traffic HTTPS server), then sslh-fork is probably the best option for you.\n- sslh-select uses only one thread, which monitors all connections at once. It is more recent and less tested, but the main process only incurs a 16 byte overhead per connection. However, if it stops then you will lose all non-forked connections, which means you can only upgrade it remotely if the necessary connections are set to fork mode. If you're going to use sslh on a \"medium\" setup (a few thousand SSH connections, and another few thousand SSL connections), sslh-select will be the most suitable option.\n- sslh-ev is the most recent option, introduced in version 2.0. It's almost functionally identical to sslh-select, but uses libev to scale much higher, making it ideal if you have a very large site (tens of thousands of connections).\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Difference between sslh-fork and sslh-select\n- basic.cfg\n- example.cfg\n\n"
    }
  ]
}