{
  "title": "System-tar-and-restore",
  "url": "https://wiki.archlinux.org/title/System-tar-and-restore",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Synchronization and backup programs\n- System maintenance#Backup\n- System backup\n\nDisk cloning is the process of making an image of a partition or of an entire hard drive. This can be useful for copying the drive to other computers or for backup and recovery purposes.\n\n- Moving to a drive with a smaller logical sector size (e.g. from 4096 bytes to 512 bytes) will require recreating the partition table since partition boundaries are specified in sector numbers.\n- Moving to a drive with a larger logical sector size (e.g. from 512 bytes to 4096 bytes) may not be possible at all if a file system's block size is less than target drive's logical sector size or is not divisible by it.\n\n"
    },
    {
      "title": "Using dd",
      "level": 3,
      "content": "See dd#Disk cloning and restore and Core utilities#dd alternatives.\n\n"
    },
    {
      "title": "Using ddrescue",
      "level": 3,
      "content": "If possible, data recovery from disks should be performed using their native interface: SATA or, for older drives, IDE. Results may vary while using USB adapters.\n\nGNU ddrescue is a data recovery tool capable of ignoring read errors. ddrescue is not related to dd in any way except that both can be used for copying data from one device to another. The key difference is that ddrescue uses a sophisticated algorithm to copy data from failing drives causing them as little additional damage as possible. See the ddrescue manual for details.\n\n"
    },
    {
      "title": "First round",
      "level": 4,
      "content": "To clone a faulty or dying drive, run ddrescue twice. For the first round, copy every block without read error and map the errors to rescue.map.\n\n```\n# ddrescue --force --no-scrape /dev/sdX /dev/sdY rescue.map\n```\n\nThis command copies data from one device (/dev/sdX) to another device (/dev/sdY) while prioritizing speed (by skipping retry attempts).\n\n- The --force option is needed because you are writing directly to a device (/dev/sdY).\n- The rescue.map file keeps track of progress, allowing you to resume the recovery if it stops.\n\n"
    },
    {
      "title": "Second round",
      "level": 4,
      "content": "For the second round, copy only the bad blocks and try 3 times to read from the source before giving up.\n\n```\n# ddrescue --force --idirect --retry-passes=3 --no-scrape /dev/sdX /dev/sdY rescue.map\n```\n\nThis command attempts to read problematic sectors more aggressively.\n\nif you encounter issue like this:\n\n```\nddrescue: /dev/sdX: Unaligned read error. Is sector size correct?\n```\n\ncheck sector size of the device:\n\n```\n# blockdev --getss /dev/sdX\n```\n\nThis will display the sector size in bytes. For example, most CD/DVD drives, the correct sector size is 2048 bytes. and specify sector size manually:\n\n```\n# ddrescue --sector-size=2048 --force --idirect --retry-passes=3 --no-scrape /dev/sdX /dev/sdY rescue.map\n```\n\n"
    },
    {
      "title": "Third round (optional)",
      "level": 4,
      "content": "```\n# ddrescue --force --idirect --retry-passes=3 --reverse /dev/sdX /dev/sdY rescue.map\n```\n\n--reverse reads the drive in reverse, which can sometimes bypass issues that prevent forward reads.\n\n"
    },
    {
      "title": "Fourth round",
      "level": 4,
      "content": "For the fourth round, use scraping mode for fine-grained recovery:\n\n```\n# ddrescue --force --idirect --retry-passes=3 /dev/sdX /dev/sdY rescue.map\n```\n\n--retry-passes=3 will scrape over the problematic sectors multiple times. It tries to rescue data from the most damaged sectors.\n\nWhen to stop: If the drive continues to have read speeds near 0 B/s with no further improvement, the likelihood of recovering more data diminishes. In such cases, professional data recovery services might be the best option. Ultimately, if the process continues to stall without rescuing more data, the drive might be physically failing, and further attempts may yield minimal results..\n\nIn some circumstances the disk controller or a USB adapter may lock, while attempting to read a particular sector. The --input-position option may be used to instruct ddrescue to start reading after that position.\n\nNow you can check the file system for corruption and mount the new drive.\n\n```\n# fsck -f /dev/sdY\n```\n\n"
    },
    {
      "title": "Using e2image",
      "level": 3,
      "content": "e2image is a tool included in e2fsprogs for debugging purposes. It can be used to copy ext2, ext3, and ext4 partitions efficiently by only copying the used blocks. Note that this only works for ext2, ext3, and ext4 filesystems, and the unused blocks are not copied so this may not be a useful tool if one is hoping to recover deleted files.\n\nTo clone a partition from physical disk /dev/sda, partition 1, to physical disk /dev/sdb, partition 1 with e2image, run\n\n```\n# e2image -ra -p /dev/sda1 /dev/sdb1\n```\n\n"
    },
    {
      "title": "Using xfs_copy",
      "level": 3,
      "content": "xfs_copy(8) from xfsprogs can be used to copy an XFS file system to one or more block devices in parallel.\n\nFor example, to clone the file system on /dev/sda1 to /dev/sdb1, run:\n\n```\n# xfs_copy /dev/sda1 /dev/sdb1\n```\n\n"
    },
    {
      "title": "Versatile cloning solutions",
      "level": 2,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThese applications allow easy backup of entire file systems and recovery in case of failure, usually in the form of a Live CD or USB drive. They contain complete system images from one or more specific points in time and are frequently used to record known good configurations. See Wikipedia:Comparison of disk cloning software for their comparison.\n\nSee also Synchronization and backup programs for other applications that can take full system snapshots, among other functionality.\n\n- Clonezilla — A partition and disk imaging/cloning program which helps with system deployment, bare metal backup and recovery. Complete backup and recovery solution: able to image and restore entire drives including boot sector, boot loader, partition table... for different operating systems including Windows Supports BIOS and UEFI, MBR and GPT Supports most filesystems (ext2-3-4, reiserfs, reiser4, xfs, jfs, btrfs, f2fs, FAT12-16-32, NTFS, HFS+, UFS and others) and LVM2 Free-space aware when using Partclone (default), Partimage (optional), ntfsclone (optional), otherwise falls back to dd for block-level copying (dm-crypt/LUKS containers, unsupported filesystems...) Supports multi-threaded compression with different formats (including zstd) and levels Supports encrypting the backup Multicasting server to restore to many machines at once Dedicated LiveCD available to boot from CD, USB drive or PXE server Included on the Arch Linux installation media.\n\n- Complete backup and recovery solution: able to image and restore entire drives including boot sector, boot loader, partition table... for different operating systems including Windows\n- Supports BIOS and UEFI, MBR and GPT\n- Supports most filesystems (ext2-3-4, reiserfs, reiser4, xfs, jfs, btrfs, f2fs, FAT12-16-32, NTFS, HFS+, UFS and others) and LVM2\n- Free-space aware when using Partclone (default), Partimage (optional), ntfsclone (optional), otherwise falls back to dd for block-level copying (dm-crypt/LUKS containers, unsupported filesystems...)\n- Supports multi-threaded compression with different formats (including zstd) and levels\n- Supports encrypting the backup\n- Multicasting server to restore to many machines at once\n- Dedicated LiveCD available to boot from CD, USB drive or PXE server\n- Included on the Arch Linux installation media.\n\n- Deepin Clone — Tool by Deepin to backup and restore. It supports to clone, backup and restore disk or partition.\n\n- FSArchiver — A safe and flexible file-system backup/deployment tool Support for basic and extended file attributes Support for basic file-system attributes (label, uuid, block-size) for all linux file-systems Support for multiple file-systems per archive Support for all major Linux filesystems (extfs, xfs, btrfs, reiserfs, etc) and FAT (in order to backup/restore EFI System Partitions) Experimental support for cloning ntfs filesystems Checksumming of everything which is written in the archive (headers, data blocks, whole files) Ability to restore an archive which is corrupt (it will just skip the current file) Multi-threaded lzo, lz4, gzip, bzip2, xz/lzma and zstd compression Support for splitting large archives into several files with a fixed maximum size Encryption of the archive using a password. Based on blowfish from libgcrypt Support for restoring to a bigger or smaller partition (as long as there is enough space to store the data) Support for exclusion patterns to filter what is archived/restored Works with directories (creating a compressed and checksummed tarball of sorts) Included on the Arch Linux installation media\n\n- Support for basic and extended file attributes\n- Support for basic file-system attributes (label, uuid, block-size) for all linux file-systems\n- Support for multiple file-systems per archive\n- Support for all major Linux filesystems (extfs, xfs, btrfs, reiserfs, etc) and FAT (in order to backup/restore EFI System Partitions)\n- Experimental support for cloning ntfs filesystems\n- Checksumming of everything which is written in the archive (headers, data blocks, whole files)\n- Ability to restore an archive which is corrupt (it will just skip the current file)\n- Multi-threaded lzo, lz4, gzip, bzip2, xz/lzma and zstd compression\n- Support for splitting large archives into several files with a fixed maximum size\n- Encryption of the archive using a password. Based on blowfish from libgcrypt\n- Support for restoring to a bigger or smaller partition (as long as there is enough space to store the data)\n- Support for exclusion patterns to filter what is archived/restored\n- Works with directories (creating a compressed and checksummed tarball of sorts)\n- Included on the Arch Linux installation media\n\n- Mondo Rescue — A disaster recovery solution to create backup media that can be used to redeploy the damaged system. Image-based backups, supporting Linux/Windows. Compression rate is adjustable. Can backup live systems (without having to halt it). Can split image over many files. Supports booting to a Live CD to perform a full restore. Can backup/restore over NFS, from CDs, tape drives and other media. Can verify backups.\n\n- Image-based backups, supporting Linux/Windows.\n- Compression rate is adjustable.\n- Can backup live systems (without having to halt it).\n- Can split image over many files.\n- Supports booting to a Live CD to perform a full restore.\n- Can backup/restore over NFS, from CDs, tape drives and other media.\n- Can verify backups.\n\n- Partclone — A tool that can be used to back up and restore a partition while considering only used blocks. Supports ext2, ext3, ext4, hfs+, reiserfs, reiser4, btrfs, vmfs3, vmfs5, xfs, jfs, ufs, ntfs, fat(12/16/32), exfat, f2fs, nilfs Supports pipe, stdin and stdout to script special features (compression, encryption...) Rescue mode tries to skip bad blocks and backup only good blocks, option to create GNU Ddrescue domain log file from source device ncurses interface available All backed-up blocks are checksummed with crc32 Included on the Arch Linux installation media\n\n- Supports ext2, ext3, ext4, hfs+, reiserfs, reiser4, btrfs, vmfs3, vmfs5, xfs, jfs, ufs, ntfs, fat(12/16/32), exfat, f2fs, nilfs\n- Supports pipe, stdin and stdout to script special features (compression, encryption...)\n- Rescue mode tries to skip bad blocks and backup only good blocks, option to create GNU Ddrescue domain log file from source device\n- ncurses interface available\n- All backed-up blocks are checksummed with crc32\n- Included on the Arch Linux installation media\n\n- Partimage — An ncurses disk cloning utility for Linux/UNIX environments. Has a Live CD. Supports the most popular filesystems on Linux, Windows and Mac OS. Compression. Saving to multiple CDs or DVDs or across a network using Samba/NFS. Development stopped in favor of FSArchiver.\n\n- Has a Live CD.\n- Supports the most popular filesystems on Linux, Windows and Mac OS.\n- Compression.\n- Saving to multiple CDs or DVDs or across a network using Samba/NFS.\n- Development stopped in favor of FSArchiver.\n\n- Redo Backup and Recovery — A backup and disaster recovery application that runs from a bootable Linux CD image. Is capable of bare-metal backup and recovery of disk partitions. Uses xPUD and Partclone for the backend.\n\n- Is capable of bare-metal backup and recovery of disk partitions.\n- Uses xPUD and Partclone for the backend.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:List of disk cloning software\n- Arch Linux forum thread\n\n"
    }
  ]
}