{
  "title": "System76 Pangolin pang12",
  "url": "https://wiki.archlinux.org/title/System76_Pangolin_pang12",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nGPU | 1002:1681 | Yes\nWireless | 14c3:0608 | Yes\nAudio | 1002:1640 | Yes\nTouchpad | 0911:5288 | Yes\nWebcam | 0c45:6809 | Yes\nFingerprint reader | 2808:9348 | No\nBluetooth | 0e8d:0608 | Yes\n\nThis article covers the installation and configuration of Arch Linux on a System76 Pangolin model name \"pang12\", manufactured in 2023. Specific specifications can be found at the manufacturer's website[dead link 2024-11-06 ⓘ].\n\nUnlike many previous System76 laptops which were manufactured by Clevo, this model was made by Emdoor.\n\nFor a general overview of laptop-related articles and recommendations, see Laptop.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "System76 develops a special distribution (Pop!_OS) for their computers, and it comes with many tweaks and tools to ensure a seamless end-user experience. Arch does not have these out of the box, but can be installed if desired. They are not necessary for a good user experience with this particular laptop.\n\n"
    },
    {
      "title": "Recovery partition",
      "level": 3,
      "content": "If you are replacing Pop!_OS on the NVMe that came with your laptop, it is recommended to leave the recovery partition intact. The BIOS is hard-coded to attempt to boot this on Space, and this recovery partition can be a handy way to get out of a tight spot if something should happen that renders your Arch install unbootable.\n\nSystem76 automatically updates this recovery partition from within Pop!_OS; at present, it is not known how to update it from within Arch Linux.\n\nIt may be possible to replace the contents of this recovery partition with any LiveCD you want, but as of now it is not known if anyone has tried.\n\n"
    },
    {
      "title": "Packages",
      "level": 3,
      "content": "All System76 specific packages can be found in the AUR.\n\n- system76-dkms-gitAUR\n\n- system76-driverAUR\n- system76-powerAUR\n- system76-firmware\n\n"
    },
    {
      "title": "Activation",
      "level": 3,
      "content": "Once you have installed the above, you will need to tell your computer to use them.\n\nEnable the following services:\n\n- system76\n- system76-firmware-daemon\n- system76-power\n\nTo make sure all drivers are being loaded correctly, run system76-driver-cli; this will automatically add necessary rules to /etc/modprobe.d, and execute mkinitcpio.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "- Laptop comes with Pop!_OS installed by default, but is ready out of the box to be installed with Arch Linux install media.\n- BIOS is fully navigable via keyboard and is simple (blue and light grey with some white), so it may work well with OCR software.\n- External hardware guide and LED key\n- The BIOS is accessed with the Esc key. Del may work too.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Install the following:\n\n- firmware-managerAUR (optional if you want to know when there is a BIOS update available)\n- system76-firmware (required if you want to update your BIOS)\n\nTo check your current BIOS version and whether there is a new version available, run firmware-manager as root. Keep in-mind that this is a GTK application, so you need to be running X or Wayland for it to run. (It has no CLI -- it does not even respond to --help.)\n\nTo update your system to the latest firmware on the next boot, run system76-firmware-cli schedule.\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "This system comes complete with integrated (AMD) graphics. It is suggested to follow the instructions there, including support for Vulkan and hardware acceleration.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "Some Pangolin models have touchpad issues that can surface later. The touchpad registers mouse events when idle (interrupting sleep and suspend to RAM and consuming battery). In extreme case, the laptop mouse being unusable with multiple unintended mouse events (movement/clicks).\n\nSystem76 and users suggest the following Kernel parameters:\n\n```\nmodprobe.blacklist=psmouse\ni8042.noaux\n```\n\nSometimes the issue does not get fixed, you might have to contact support and send it for repair.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Keys can be changed between serving as an F key or a Function in bios. By default, (aka on new firmware updates), it will work as the following:\n\nTable content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | Yes | Yes | Vanilla Escape Key\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | No | No | No function\nFn+F5 | No | No | No function\nFn+F6 | Yes | Yes | XF86TouchpadToggle\nFn+F7 | No | Yes | Keyboard Backlight\nFn+F8 | No | No | No function\nFn+F9 | Yes | Yes | XF86RFKill\nFn+F10 | Yes | Yes | Multiple, brings up display manager\nFn+F11 | Yes | Yes | XF86MonBrightnessDown\nFn+F12 | Yes | Yes | XF86MonBrightnessUp\n\n1. The key is visible to xev and similar tools.\n1. The physical key has a symbol on it, which describes its function.\n\n"
    }
  ]
}