{
  "title": "Telnet",
  "url": "https://wiki.archlinux.org/title/Telnet",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From Wikipedia:\n\nToday, telnet is rarely used due to security concerns and is often only used for legacy software and hardware, for information on how to mitigate the security issues see #Security concerns.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the inetutils package which includes a telnet client, a telnet server with systemd service and sockets.\n\nTo configure a telnet server with xinetd, install xinetdAUR as well.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "To enable telnet server connections in systemd, enable telnet.socket (if the telnet server should be started on every boot), and start telnet.socket to test connectivity.\n\nTo enable telnet server connections in xinetd, edit /etc/xinetd.d/telnet, change disable = yes to disable = no and restart the xinetd service.\n\nEnable systemd xinetd service if you wish to start it at boot time.\n\n"
    },
    {
      "title": "Testing the setup",
      "level": 3,
      "content": "Try opening a telnet connection to your server:\n\n```\n$ telnet localhost\n```\n\nTry a root login to see if your configuration permits it and the security implications that implies.\n\nIf the session disconnects before you receive a login prompt, try installing inetutils-gitAUR in place of the current inetutils and restarting telnet.socket.\n\n"
    },
    {
      "title": "Security concerns",
      "level": 3,
      "content": "Telnet is a plain text protocol which does not support TLS encryption. Data can be easily intercepted and modified therefore should not be used on production servers, or to transmit sensitive data.\n\nThere are attempts to mitigate said security concerns, see #Netkit and #Tunneling for mitigations.\n\n"
    },
    {
      "title": "Netkit",
      "level": 4,
      "content": "You can use netkit-telnet-sslAUR which modifies the protocol to support TLS encryption.\n\n"
    },
    {
      "title": "Tunneling",
      "level": 4,
      "content": "You can use a VPN or SSH to create an encrypted tunnel for the telnet traffic between two devices, or networks.\n\n"
    }
  ]
}