{
  "title": "Terminologia do Arch",
  "url": "https://wiki.archlinux.org/title/Terminologia_do_Arch",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "A intenção desta página é desmistificar os termos comumente usados pela comunidade do Arch Linux. Sinta-se à vontade para adicionar ou modificar quaisquer termos, mas por favor use a opção de editar da opção específica. Se você decidir adicionar algum termo, por favor adicione-o em ordem alfabética.\n\n"
    },
    {
      "title": "ABS",
      "level": 2,
      "content": "ABS é o acrônimo de Arch build system, que pode ser traduzido como \"sistema de compilação do Arch\".\n\n"
    },
    {
      "title": "Arch Linux",
      "level": 2,
      "content": "Arch deve ser referenciado como:\n\n- Arch Linux\n- Arch (Linux implícito)\n- archlinux (nome UNIX)\n\nArchlinux, ArchLinux, archLinux, aRcHlInUx, etc. são todos estranhas mutações.\n\nOficialmente, o 'Arch' de \"Arch Linux\" é pronunciado /ɑːrtʃ/ como em \"archer\"/arqueiro, ou \"archnemesis\" (\"arqui-inimigo\") e não como em \"ark\" ou \"archangel\" (\"arcanjo\").\n\n"
    },
    {
      "title": "Arch Linux Archive",
      "level": 2,
      "content": "O Arch Linux Archive (abreviado ALA), anteriormente conhecido Arch Linux Rollback Machine (a.k.a ARM), armazena snapshots de repositórios oficiais, imagens ISO e tarballs de bootstrap ao longo do tempo.\n\n"
    },
    {
      "title": "AUR",
      "level": 2,
      "content": "O Arch User Repository (AUR) é um repositório dirigido por uma comunidade de usuários do Arch. Ele contém descrições de pacotes (PKGBUILDs) que permitem que você compile um pacote da fonte com o makepkg e, então, instale-o via pacman. O AUR foi criado e organizado para compartilhar novos pacotes da comunidade ajudando a acelerar a inclusão de pacotes populares para o repositório extra.\n\nUm bom número de novos pacotes que entram nos repositórios oficiais iniciam no AUR. No AUR, usuários são capazes de contribuir suas próprias compilações de pacote (PKGBUILD e arquivos relacionados). A comunidade do AUR possui a habilidade de votar a favor ou contra pacotes no AUR. Se um pacote se torna popular o suficiente — desde que tenha uma licença compatível e uma boa técnica de empacotamento — ele pode ser inserido no repositório extra (diretamente acessível por pacman ou o ABS).\n\nVocê pode acessar o Arch Linux User Community Repository aqui.\n\n"
    },
    {
      "title": "bbs",
      "level": 2,
      "content": "bbs é o acrônimo para \"Bulletin Board System\"; no caso do Arch, é somente o fórum para suporte localizado aqui.\n\n"
    },
    {
      "title": "core/[core]",
      "level": 2,
      "content": "O repositório core contém os pacotes básicos para um sistema do Arch Linux. O core tem tudo que é necessário ter um sistema funcional de linha de comando.\n\n"
    },
    {
      "title": "custom/user repository",
      "level": 2,
      "content": "Trata-se de repositório personalizado, de usuário. Qualquer um pode criar um e disponibilizá-lo para outros usuários. Para criar um repositório, você precisa de um conjunto de pacotes e um arquivo de banco de dados compatível com o pacman para seus pacotes. Hospede seus arquivos online e todo mundo poderá usar seu repositório adicionando-o como um repositório comum.\n\nVeja Repositório local personalizado.\n\n"
    },
    {
      "title": "Developer",
      "level": 2,
      "content": "Desenvolvedores são semideuses trabalhando para melhorar o Arch sem qualquer ganho financeiro. Desenvolvedores são deixados para trás somente por seus deuses, Judd Vinet e Aaron Griffin, que, por sua vez, só são superados por tacos mexicanos.\n\n"
    },
    {
      "title": "extra/[extra]",
      "level": 2,
      "content": "A coleção pacotes centrais do Arch é razoavelmente simples, mas suplementamos isso com um maior e mais completo do repositório extra. Este repositório está constantemente aumentando com a ajuda de pacotes enviados da comunidade forte. É aqui onde os ambientes de trabalho, gerenciadores de janela e programas comuns são encontrados.\n\n"
    },
    {
      "title": "initramfs/initrd",
      "level": 2,
      "content": "Veja mkinitcpio.\n\n"
    },
    {
      "title": "KISS",
      "level": 2,
      "content": "Acrônimo para Keep It Simple, Stupid, que em português seria algo como \"mantenha isto simples, estúpido\". Simplicidade é um princípio central que o Arch Linux tenta atingir.\n\n"
    },
    {
      "title": "makepkg",
      "level": 2,
      "content": "makepkg vai construir pacotes para você. O makepkg vai ler metadados necessários de um arquivo PKGBUILD. Tudo que ele precisa é uma plataforma Linux capaz de compilação, curl e alguns scripts de compilação. A vantagem a de compilar baseado em script é que você realmente faz o trabalho uma vez. Assim que você tiver o script de compilação para um pacote, tudo o que você precisará é executar makepkg e ele vai fazer o resto: baixa e balida os arquivos fontes, verifica as dependências, configura as configurações de tempo de compilação, compilação do pacote, instala o pacote em uma raiz temporária, faz personalização, cria metainformações e empacota toda a coisa para o pacman usar.\n\n"
    },
    {
      "title": "namcap",
      "level": 2,
      "content": "namcap é um utilitário de análise de pacotes que procura por problemas com pacotes do Arch Linux ou em seus arquivos PKGBUILD. Ele pode aplicar regras à lista de arquivos, no próprios arquivos ou em arquivos PKGBUILD individuais.\n\nAs regras retornam listas de mensagens. Cada mensagem pode ser uma dos três tipos: erro, aviso ou informação (pense nelas como notas ou comentários). Erros (referidos por \"E:\" são coisas que o namcap tem muita certeza de que estão erradas e precisam ser corrigidas. Avisos (referidos por \"W:\") são coisas que o namcap pensa que deveriam ser alteradas, mas se você sabe o que você está fazendo, então você pode ignorá-las. Informações (referidas por \"I:\") são apenas mostradas quando você usar o argumento de informação. Mensagens informacionais dão informações que podem ser úteis, mas é nada que tenha que ser alterado.\n\n"
    },
    {
      "title": "package",
      "level": 2,
      "content": "Veja pacman (Português)#Instalando pacotes\n\n"
    },
    {
      "title": "Package maintainer",
      "level": 2,
      "content": "O papel de um mantenedor de pacotes é atualizar pacotes à medida que novas versões são disponibilizados pelo upstream e para questões de suporte relacionadas a bugs em tais pacotes. O termo se aplica a:\n\n- A equipe do Arch anteriormente chamada de Trusted Users, os quais mantêm pacotes no repositório extra e supervisionam o AUR. Eles são nomeados por maioria de votos pelos mantenedores de pacotes existentes e seguem as Diretrizes de Mantenedor de Pacote e as Package Maintainer Bylaws (\"Estatuto dos Mantenedores de Pacote\").\n- Os desenvolvedores que mantêm pacotes nos repositórios oficiais (core em especial).\n- Todos os usuários que mantêm PKGBUILDs no AUR.\n\nO mantenedor de um pacote é a pessoa atualmente responsável pelo pacote. Os mantenedores anteriores devem ser listados como contribuidores no PKGBUILD, juntamente com outros que contribuíram para o pacote.\n\n"
    },
    {
      "title": "pacman",
      "level": 2,
      "content": "Veja pacman\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 2,
      "content": "PKGBUILDs são pequenos scripts que são usados para compilar pacotes do Arch Linux. Veja Criando pacotes para mais detalhes.\n\n"
    },
    {
      "title": "repository/repo",
      "level": 2,
      "content": "Repositório contém pacotes pré-compilados de um ou (geralmente) mais PKGBUILDs. Repositórios oficiais são divididos em diferentes partes para facilitar manutenção. O pacman usa esses repositórios para pesquisar por pacotes e instalá-los. Um repositório podem ser local (i.e. em seu computador) ou remoto (i.e. os pacotes são baixados antes de serem instalados).\n\n"
    },
    {
      "title": "RTFM",
      "level": 2,
      "content": "RTFM significa \"Read The Friendly Manual\", que pode ser traduzido como \"Leia o manual amigável\". Essa mensagem simples é respondida a muitos dos novos usuários Linux/Arch que perguntam sobre a funcionalidade de um programa quando ela está definida, de forma clara, no manual do programa.\n\nEssa sigla é um convite ao autocuidado, não um insulto. É geralmente usada quando um usuário é visto falhando em fazer qualquer tentativa de encontrar uma solução para o problema por conta própria. Se alguém lhe disser isso, não está tentando lhe ofender; está apenas frustrado com sua falta de esforço.\n\nA melhor coisa a se fazer se lhe falarem isso é ler a página do manual. Para ler a página de manual de um programa em particular chamado NOME-PROGRAMA, digite isso na linha de comando: man NOME-PROGRAMA.\n\nSe você não localizar a resposta para sua pergunta no manual do programa, há mais formas de encontrar a resposta. Você pode:\n\n- pesquisar no wiki\n- pesquisar no fórum\n- Pesquisar nas listas de discussão\n- Pesquisar na web\n\n"
    },
    {
      "title": "Repositórios de teste",
      "level": 2,
      "content": "São os repositórioes nos quais a maioria dos pacotes ou das atualizações de pacotes são mantidas antes de serem lançadas para os repositórios principais, de forma que eles podem ser testados e atualizações de problemas podem ser descobertas. Eles estão desabilitados por padrão, mas podem ser habilitados no /etc/pacman.conf.\n\n"
    },
    {
      "title": "The Arch Way",
      "level": 2,
      "content": "Podendo ser traduzido como \"A Forma do Arch\" ou \"O Jeito do Arch\", é um termo extraoficial tradicionalmente usado para se referir aos mais importantes princípios do Arch Linux.\n\n"
    },
    {
      "title": "TU, Trusted User",
      "level": 2,
      "content": "Veja #Package maintainer.\n\n"
    },
    {
      "title": "wiki",
      "level": 2,
      "content": "Nossa wiki é um lugar para encontrar documentação sobre o Arch Linux. Qualquer um pode contribuir para a documentação.\n\n"
    }
  ]
}