{
  "title": "Thinkpad mobile internet",
  "url": "https://wiki.archlinux.org/title/Thinkpad_mobile_internet",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Many Lenovo ThinkPads come with a mobile broadband modem. By inserting a SIM card into the modem, it is possible to use a cellular network to connect to the internet.\n\n"
    },
    {
      "title": "ModemManager-handled devices",
      "level": 2,
      "content": "Newer Quectel modems (for example, the Quectel EM120R-GL on X13 Gen2, X1C Gen9, T14 Gen 2 AMD) can be set by ModemManager and managed with NetworkManager.\n\nInstall modemmanager, then start and enable ModemManager.service.\n\n"
    },
    {
      "title": "FCC unlock a Quectel modem",
      "level": 3,
      "content": "On some devices the modem will be in an fcc-lock state.\n\nYou need to find the modem device: known devices are /dev/ww* and /dev/cdc*. Alternatively, search the kernel log for wwan or WDM.\n\nA locked modem can be confirmed with the following command:\n\n```\n# mbimcli -p -d device -v --quectel-query-radio-state\n```\n\n```\n...\n >>>>>>   RadioState = 'fcc-locked'\n...\n```\n\nYou can then unlock the modem:\n\n```\n# mbimcli -p -d device -v --quectel-set-radio-state=on\n```\n\nThen you can enable the modem:\n\n```\n$ mmcli --modem 0 --enable\n```\n\n"
    },
    {
      "title": "Configuring ModemManager-handled devices",
      "level": 3,
      "content": "This can be set via CLI or GUI.\n\nYou can use NetworkManager's nm-connection-editor to add a new Mobile Broadband connection and follow the prompts to configure your connection.\n\nOr as an example on KDE Plasma:\n\n- In System Settings > Connections click the plus sign in the lower right corner to create a new link\n- Select Mobile Broadband > Create\n- Set up mobile broadband connection > any GSM device\n- Country > country_code\n- Provider > provider_name\n- Select your plan > My plan is not listed\n- APN > apn.number\n\n"
    },
    {
      "title": "Requirements",
      "level": 3,
      "content": "The broadband modems in older ThinkPads use the QMI modem protocol — see \"an introduction to libqmi\" by a ModemManager developer for more information. These modems will show up as /dev/cdc-wdm on the filesystem.\n\nIt is not possible to initialize a QMI modem for use on Linux. Use Windows to activate the modem using Lenovo's activation app (or web search for \"Lenovo mobile broadband\" for the correct app for your modem). The modem will not work until it has been correctly initialized using the app.\n\n"
    },
    {
      "title": "Procedure",
      "level": 3,
      "content": "Install the libqmi package, which provides the qmicli and qmi-network programs. Also install net-tools for the helper script, which uses the ifconfig command.\n\nSaid helper script for qmi-network is available on GitHub. Save the script to somewhere in your $PATH, then review the script and make it executable. The values of some of the variables might need to be changed, especially WWAN_DEV which can be found via ip a (device name start with ww).\n\nLoad the kernel modules qmi_wwan and qcserial:\n\n```\n# modprobe qmi_wwan\n# modprobe qcserial\n```\n\nAlso read the README on the GitHub page of the QMI helper for any further prerequisites. In particular, you may need to set the APN provided by your cellular internet provider in /etc/qmi-network.conf.\n\n```\n/etc/qmi-network.conf\n```\n\n```\nAPN=foo.bar.net\n```\n\nFinally, running qmi_setup.sh start should start the cellular internet connection.\n\n"
    },
    {
      "title": "Gobi modems",
      "level": 2,
      "content": "This method is an alternative for some QMI modems.\n\nFirst of all you need to make sure what model your modem is. Open your ThinkPad's backplate and look for an IC or FCC ID. For this example we are going to use GOBI2000 (IC: 2723A-GOBI2000, FCC ID: J9CGOBI2000-L)\n\nEnable your modem device from you BIOS I/O settings.\n\nDownload the driver installer executable from https://support.lenovo.com/us/en/downloads/ds001302 and extract it with Wine. It will unpack the drivers to ~/.wine/drive_c/DRIVERS/WWANQL. The unpacker will prompt you to install the drivers automatically after unpacking, but if you need the installer again it is GobiInstaller.msi in previously mentioned folder. The installer will in turn unpack the firmware images to ~/.wine/drive_c/Program\\ Files\\ \\(x86\\)/QUALCOMM/Images/Lenovo.\n\nNow refer to the reference information on what firmware you want/need. Generally you are good to go with the Generic UMTS and Default Firmware (Forlders 6 an UMTS).\n\nInstall gobi-loaderAUR. Now copy the 3 previous firmware files to /lib/firmware/gobi (if the folder does not exist, create it). Insert your sim card to the port found under your battery pack and restart. Your modem should now show up in your network manager.\n\nSee: https://www.thinkwiki.org/wiki/Qualcomm_Gobi_2000\n\n"
    },
    {
      "title": "Getting around BIOS-level whitelist restrictions",
      "level": 2,
      "content": "In newer ThinkPad models, it is normally impossible to swap the LTE modem for a supported one due to BIOS-level restrictions (\"whitelists\" of allowed M.2 expansion cards) implemented in all modern Lenovo laptops. However, a method has been found to configure any Sierra Wireless EM73xx/EM74xx modem to \"evade\" the whitelist checks, so these modems can be used normally.\n\nWe will assume the model to be Sierra Wireless EM7455 here.\n\n"
    },
    {
      "title": "General description",
      "level": 4,
      "content": "Use AT!CUSTOM=\"FASTENUMEN\",0 AT command to disable the modem's USB fast enumeration feature. The modem will take a significantly longer time to appear on the USB bus and the firmware will \"miss\" the modem at boot time.\n\nAlternatively, use AT!CUSTOM=\"FASTENUMEN\",2 to selectively enable USB fast enumeration for warm boots only. The modem will reappear faster on S3 resume but still evade the whitelist checks on regular boots and reboots (the mechanism of this effect is not fully clear to the author).\n\nThis comes with a downside: because the firmware does not \"see\" the modem, it will not export the WWAN rfkill but instead it will unconditionally assert the W_DISABLE pin of the M.2 slot, forcing the modem into \"airplane mode\". Use AT!PCOFFEN=2 AT command to configure the modem to ignore this pin.\n\n"
    },
    {
      "title": "Step-by-step",
      "level": 4,
      "content": "Boot the laptop with the stock modem in place and WWAN card access enabled in BIOS setup.\n\nSuspend the laptop (make sure it is configured to use S3).\n\nHot-swap the stock Fibocom modem with the Sierra Wireless one, then resume. Whitelists are not consulted at S3 resume.\n\nCheck that the modem is present on the USB bus:\n\n```\n# lsusb\n```\n\n```\n<...>\nBus 001 Device 004: ID 1199:9071 Sierra Wireless, Inc.\n<...>\n```\n\nRemember the VID (vendor ID) of the modem (1199 in this example).\n\nStop ModemManager.service if it is running.\n\nOptionally, update the modem firmware with the qmi-firmware-update tool:\n\n```\n# cd /path/to/extracted/firmware\n# qmi-firmware-update -d 1199 -u *.cwe *.nvu\n```\n\nChange the modem's USB composition to enable AT command ports:\n\n```\n# qmicli -d /dev/cdc-wdm1 --dms-swi-set-usb-composition=8\n```\n\nPower-cycle the modem as advised by qmicli:\n\n```\n# qmicli -d /dev/cdc-wdm1 --dms-set-operating-mode=offline\n# qmicli -d /dev/cdc-wdm1 --dms-set-operating-mode=reset\n```\n\nWait for the modem to reappear, then verify:\n\n```\n# qmicli -d /dev/cdc-wdm1 --dms-swi-get-usb-composition\n```\n\n```\n[/dev/cdc-wdm1] Successfully retrieved USB compositions:\n            USB composition 6: DM, NMEA, AT, QMI\n        [*] USB composition 8: DM, NMEA, AT, MBIM\n            USB composition 9: MBIM\n```\n\nVerify that the three serial ports /dev/ttyUSB0, /dev/ttyUSB1 and /dev/ttyUSB2 are now available (assuming you do not have any other USB-serial converters plugged in):\n\n```\n# ls -l /dev/ttyUSB*\n```\n\n```\ncrw-rw---- 1 root uucp 188, 0 Feb 14 20:11 /dev/ttyUSB0\ncrw-rw---- 1 root uucp 188, 1 Feb 14 20:11 /dev/ttyUSB1\ncrw-rw---- 1 root uucp 188, 2 Feb 14 20:11 /dev/ttyUSB2\n```\n\nAttach to /dev/ttyUSB2 with a serial terminal emulator of your choice (e. g. screen):\n\n```\n# screen /dev/ttyUSB2 115200\n```\n\nEnter the AT commands (note that you do not need to type OK, the replies are included here as part of a session transcript):\n\nEnable command echo (if echo is initially disabled, you will not see this command as you type it):\n\n```\nATE1\nOK\n```\n\nUnlock engineering commands:\n\n```\nAT!ENTERCND=\"A710\"\nOK\n```\n\nCheck customization options (these are the author's options):\n\n```\nAT!CUSTOM?\n!CUSTOM: \n             GPSENABLE          0x01\n             GPSSEL             0x01\n             IPV6ENABLE         0x01\n             SIMLPM             0x01\n             SINGLEAPNSWITCH    0x01\n\n\nOK\n```\n\nConfigure USB fast enumeration (swap 2 for 0 if you want to play it safe):\n\n```\nAT!CUSTOM=\"FASTENUMEN\",2\nOK\n```\n\nVerify, it should now show the FASTENUMEN option alongside others:\n\n```\nAT!CUSTOM?\n!CUSTOM: \n             GPSENABLE          0x01\n             GPSSEL             0x01\n             IPV6ENABLE         0x01\n             SIMLPM             0x01\n             FASTENUMEN         0x02\n             SINGLEAPNSWITCH    0x01\n\n\nOK\n```\n\nConfigure the modem to ignore W_DISABLE:\n\n```\nAT!PCOFFEN=2\nOK\n```\n\nVerify:\n\n```\nAT!PCOFFEN?\n2\n   \nOK\n```\n\nReset the modem:\n\n```\nAT!RESET\nOK\n```\n\nthe terminal will disconnect after a while.\n\nWait for the modem to reappear, then verify configuration by rebooting / powering down / hard resetting the laptop.\n\n"
    },
    {
      "title": "Remarks",
      "level": 4,
      "content": "For more information (including the original thought process that led to this discovery), see these lenovo threads and this reddit thread.\n\nYou may also apply other useful configuration options described here.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "Ensure that you have initialized the modem on Windows.\n\n"
    },
    {
      "title": "WWAN/LTE GUI",
      "level": 3,
      "content": "Install NetworkManager and network-manager-applet to make your life easier finding the correct APN for your SIM card.\n\n"
    },
    {
      "title": "Invalid Transition",
      "level": 3,
      "content": "If you get an error Invalid Transition when running mmcli -m 0 -e, it is likely you have not yet removed the fcc-lock on the modem. See the example commands in #FCC unlock a Quectel modem.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Thinkwiki\n\n"
    }
  ]
}