{
  "title": "Timeshift",
  "url": "https://wiki.archlinux.org/title/Timeshift",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nRelated articles\n\n- Btrfs\n- System maintenance\n- Synchronization and backup programs\n\nTimeshift is a tool originally created by Tony George, that is now part of the Xapp project.\n\nTimeshift helps create incremental snapshots of the file system at regular intervals, which can then be restored at a later date to undo all changes to the system.\n\nIt supports rsync snapshots for all filesystems, and uses the built-in snapshot features for Btrfs drives configured to use the @ and @home subvolume layout for root and home directories respectively.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the timeshift package and enable/start your chosen cron scheduler (see cron#Configuration). This will ensure that snapshots scheduled within the Timeshift application run as intended.\n\nAlternatively, timeshift-systemd-timerAUR can be installed instead of using a cron scheduler.\n\n"
    },
    {
      "title": "Configuring btrfs snapshots",
      "level": 2,
      "content": "Timeshift has strict restrictions on what it requires for snapshots.\n\nFirst create a subvolume named @ in root:\n\n```\n# btrfs subvolume create /@\n```\n\nThen edit the /etc/fstab entry so that the root partition contains subvol=@ mount option.\n\n"
    },
    {
      "title": "GRUB entries for btrfs snapshots",
      "level": 2,
      "content": "To add snapshots to the GRUB menu each time GRUB configuration is generated, install the grub-btrfs package. It comes with the grub-btrfsd.service, which can be enabled to automatically update the GRUB configuration whenever a new snapshot is created.\n\nTo make grub-btrfsd work with Timeshift, edit the service by running:\n\n```\n# systemctl edit --full grub-btrfsd\n```\n\nand replace grub-btrfsd --syslog /.snapshots with grub-btrfsd --syslog -t.\n\n"
    },
    {
      "title": "Timeshift GUI not launching on Wayland",
      "level": 3,
      "content": "Xwayland will only allow the user who started the X server to connect clients to it (see Running GUI applications as root#Wayland).\n\nDue to Timeshift requiring root permissions, attempting to launch the Timeshift GUI via an application launcher or a terminal with the command timeshift-launcher will result in an error containing xhost: command not found.\n\nUsers encountering this error may also be presented with their authentication agent prompting for a password, only to find that the Timeshift GUI does not launch after entering the password. [1][dead link 2025-03-15 ⓘ] This is because the command timeshift-launcher requires the xorg-xhost package: install it.\n\nIf GTK can't open your display and you get a warning message in the terminal, it means that the root user need the access to the graphical X server (Display :0, :1, etc.)\n\nNormally only the user who started the graphical session can open new windows in your compositor and since your need to execute Timeshift with the root user, you are not able to open the GUI\n\n```\n# xhost +SI:localuser:root\n```\n\n"
    }
  ]
}