{
  "title": "Toolbox",
  "url": "https://wiki.archlinux.org/title/Toolbox",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Linux Containers\n- Podman\n- Buildah\n- Distrobox\n\nToolbox is a tool that allows you to create and run containers that seamlessly integrate with the rest of the operating system by providing access to the user's home directory, the Wayland and X11 sockets, networking (including Avahi), removable devices (like USB sticks), systemd journal, SSH agent, D-Bus, ulimits, /dev and the udev database, etc.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the toolbox package.\n\nNote that podman is installed as a dependency of Toolbox. By default it is only possible to run Podman containers as root. See Podman#Rootless Podman to set up running containers as a non-root user. In general, if you are having issues with Toolbox, make sure your issues are not with Podman first.\n\nIf you want to build your own toolbox-compatible images, install buildah as well.\n\n"
    },
    {
      "title": "Fedora Containers",
      "level": 3,
      "content": "You can create a Fedora 35 toolbox with the following:\n\n```\n$ toolbox create -d fedora -r 35\n```\n\nOnce that's done, you can enter the toolbox with:\n\n```\n$ toolbox enter fedora-toolbox-35\n```\n\n"
    },
    {
      "title": "Arch Containers",
      "level": 3,
      "content": "You can create an ArchLinux toolbox with the following:\n\n```\n$ toolbox create\n```\n\nThis will create a container named arch-linux-latest.\n\nOnce that's done, you should be able to enter the toolbox with:\n\n```\n$ toolbox enter\n```\n\n"
    },
    {
      "title": "Error: failed to start container (rootless containers)",
      "level": 3,
      "content": "You may not be able to enter rootless containers if virtualbox is installed due to strict permissions in /dev/vboxusb and toolbox trying to stat vboxusb.\n\nTo fix this, change /dev/vboxusb permissions from 750 to 755:\n\n```\n# chmod -R 755 /dev/vboxusb\n```\n\n"
    },
    {
      "title": "X11 applications not starting",
      "level": 3,
      "content": "When attempting to run an X11 application from within the toolbox, you may get the following error:\n\n```\nAuthorization required, but no authorization protocol specified\nError: Can't open display: :0\n```\n\nTo fix this, you can use xorg-xauth (on your host machine) to give your container permission to communicate with X11. Run the following, or add it to Xinit#xinitrc:\n\n```\n$ xauth add \"toolbox/unix$DISPLAY\" . \"$(xauth list | grep \"^$(hostnamectl hostname)/unix$DISPLAY\\s*MIT-MAGIC-COOKIE-1\\s*\" | awk '{print $3}')\"\n```\n\nAlternatively, run:\n\n```\n$ xauth nlist | sed -e 's/^..../ffff/' | xauth nmerge -\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official website\n- Github repo\n- Fedora Silverblue documentation\n- toolbx-images - Community maintained container images to use with Toolbox, with pre-built images available via quay.io\n- duhdugg's custom toolboxes - a set of custom scripts to build toolbox containers using a directory structure that makes them simple to modify\n\n"
    }
  ]
}