{
  "title": "Tp-battery-mode",
  "url": "https://wiki.archlinux.org/title/Tp-battery-mode",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is a candidate for merging with tp_smapi.** This article or section is a candidate for merging with tp_smapi.\n\nThis article or section is a candidate for merging with tp_smapi.\n\ntp-battery-mode is a module to easily switch your Thinkpad's battery charging mode to prolong battery lifetime using tpacpi-batAUR.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the tp-battery-modeAUR package.\n\n"
    },
    {
      "title": "Features",
      "level": 2,
      "content": "Your Thinkpad's default behavior is to start charging its battery as soon as it drops below 100% capacity and stop charging once it is at 100% capacity. Switching your battery charging mode changes these start & stop threshold. tp-battery-mode's default values can be found in /etc/tp-battery-mode.conf\n\n```\nSTART_THRESHOLD=85\nSTOP_THRESHOLD=90\n```\n\nThese values mean that your battery will start charging once the capacity drops below 85% and stop charging once it has reached 90% capacity. This should prolong your battery's lifespan while still giving you ample charge for portable needs.\n\n"
    },
    {
      "title": "Prolong Battery Lifetime",
      "level": 3,
      "content": "Switching to these new charging thresholds is as simple as enabling and starting tp-battery-mode.service\n\nYou can tailor the start/stop thresholds to fit your needs by modifying /etc/tp-battery-mode.conf. If you modify these values, you will need to restart the tp-battery-mode service otherwise the changes will not be reflected until you reboot.\n\n"
    },
    {
      "title": "Reverting to default charging behavior",
      "level": 3,
      "content": "Sometimes you might want to charge your battery all the way to 100% If you wish to revert to the default Thinkpad charging behavior, you just need to stop tp-battery-mode.service\n\nIf you wish to revert to the default Thinkpad charging behavior completely, you will also need to disable tp-battery-mode.service\n\n"
    }
  ]
}