{
  "title": "Trickle",
  "url": "https://wiki.archlinux.org/title/Trickle",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "trickle is a portable lightweight userspace bandwidth shaper, that either runs in collaborative mode (together with trickled) or in stand alone mode.\n\nIt works by preloading its own socket library wrappers, that limit traffic by delaying data.\n\nTrickle runs entirely in userspace. [1]\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the trickleAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "- Programs that generate heavy traffic, but get controlled via a web interfaces (with very light traffic), will also have the web interface traffic shaped. This means that they will barely be accessible.\n- Trickle can only limit traffic of programs that do not fork, so shaping a FTP server's traffic will not work that way.\n\nIf you are running the daemon (see below), just start any program with \"trickle\" in front of it:\n\n```\n# trickle pacman -Syu\n```\n\nOtherwise also specify upload and download limit as well as other configuration options (see trickle(1) for more information):\n\n```\n# trickle -s -d200 -u50 pacman -Syu\n```\n\n"
    },
    {
      "title": "Modifying other systemd services",
      "level": 3,
      "content": "Modify ExecStart for a desired systemd service, appending /usr/bin/trickle. For example:\n\n```\nExecStart=/usr/bin/daemon\n```\n\nchanges to\n\n```\nExecStart=/usr/bin/trickle /usr/bin/daemon\n```\n\nWhen using the standalone mode, also add the configuration options as described in #Usage. Restart the daemon, which should now have shaped bandwith.\n\n"
    },
    {
      "title": "Use with rsync",
      "level": 3,
      "content": "Instead of putting trickle in front of the rsync command (which will not work, since rsync presumably forks the ssh process), you call rsync like this:\n\n```\nrsync --rsh=\"trickle -d 10 -u 10 ssh\" SRC DEST\n```\n\n"
    },
    {
      "title": "Daemon configuration",
      "level": 2,
      "content": "If you want to have application specific settings with trickled, create the optional /etc/trickled.conf file as described in the trickled.conf(5) man page. For example:\n\n```\n[ssh]\nPriority = 1\nTime-Smoothing = 0.1\nLength-Smoothing = 2\n[ftp]\nPriority = 8\nTime-Smoothing = 5\nLength-Smoothing = 20\n```\n\n"
    }
  ]
}