{
  "title": "Unity-editor",
  "url": "https://wiki.archlinux.org/title/Unity-editor",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From https://unity.com:\n\nNot to be confused with Canonical's Unity (which is now maintained by the UBPorts Foundation and renamed to Lomiri).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Unity has made available a program called Unity Hub that is designed to streamline your workflow by providing a centralized location where you can manage your Unity Projects and simplifies how you find, download, and manage your Unity Editor installs. The application comes available as a Deb or RPM package. To install the Unity Hub, simply install the unityhubAUR package.\n\nTo install the beta version, simply install the unityhub-betaAUR package.\n\n"
    },
    {
      "title": "Android Remote",
      "level": 2,
      "content": "Unity Remote is an Android app to help test input for Android devices. It achieves this by sending a compressed screenshot to the device each frame.\n\n"
    },
    {
      "title": "Install packages",
      "level": 4,
      "content": "Install the android-udev package, which will ensure you have correct udev rules for your device.\n\nInstall the android-sdkAUR package.\n\n"
    },
    {
      "title": "Configure the Editor",
      "level": 4,
      "content": "Open the editor, navigate to Edit > Preferences and set the correct paths to the Android SDK and the JDK.\n\n- The Android SDK is usually in /opt/android-sdk.\n- The JDK varies by the version you are using, if you want to use the default set it to /usr/lib/jvm/default.\n\nThen navigate to Edit > Project Settings > Editor and set Unity Remote Device to Any Android Device.\n\nFor more help see the Unity documentation.\n\n"
    },
    {
      "title": "Prepare Android",
      "level": 3,
      "content": "Install Unity Remote 5 from the Play Store. Alternatively you can download and build it yourself from the Asset Store.\n\nIt is also recommended to set your Android device to PTP mode.\n\nFor more help see the Unity documentation.\n\n"
    },
    {
      "title": "Test",
      "level": 3,
      "content": "If you have Unity opened, close it.\n\nConnect the phone to the computer and launch Unity Remote.\n\nOpen the Editor and press play. You should now see your game transmitted to your Android device.\n\nIf it does not work or you have questions, see the Unity Documentation.\n\n"
    },
    {
      "title": "Visual Studio Code",
      "level": 2,
      "content": "For those using the Visual Studio Code as their script editor, there are a few additional steps you need to do to get it running without displaying errors similar to:\n\n```\n[fail]: The reference assemblies for framework \".NETFramework,Version=v3.5\" were not found\n```\n\n```\n[warn]: OmniSharp.MSBuild.ProjectFile.ProjectFileInfo Unable to create directory \"/Debug/\". Access to the path \"/Debug/\" is denied.\n[fail]: OmniSharp.MSBuild.ProjectFile.ProjectFileInfo Could not write lines to file \"/Debug/Assembly-CSharp.csproj.CoreCompileInputs.cache\". Could not find a part of the path \"/Debug/Assembly-CSharp.csproj.CoreCompileInputs.cache\".\n```\n\nTo eliminate these errors you need to install the following packages: dotnet-runtime, dotnet-sdk, mono-msbuild, mono-msbuild-sdkresolver, and mono. You also need to install aspnet-runtime if you want to use the C# Dev Kit or Unity extension. Finally remember to install the C# extension from the VS Code Marketplace by pressing Ctrl-P and entering:\n\n```\next install ms-dotnettools.csharp\n```\n\nTo use the system-provided .NET SDK, you will also have to disable the following option:\n\n```\n\"omnisharp.useModernNet\": false\n```\n\nAfter this configuration change, you may need to restart Visual Studio Code.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "Crash logs are available at $HOME/.config/unity3d/Editor.log\n\n"
    },
    {
      "title": "Unity crashes on first launch before/while signing in",
      "level": 3,
      "content": "This is a rare bug where Unity's configuration gets created wrongly. You can try resetting it by:\n\n```\n$ rm -rf ~/.config/unity3d/{*.prefs,*.log,Preferences}\n```\n\n"
    },
    {
      "title": "Unity crashes when trying to load project",
      "level": 3,
      "content": "Users have reported that unsetting GTK_IM_MODULE prevents the crash.\n\n"
    },
    {
      "title": "Unity crashes if ~/.config/user-dirs.dirs is missing",
      "level": 3,
      "content": "See how to generate the xdg files here: XDG user directories\n\n"
    },
    {
      "title": "Unity crashes with DllNotFoundException",
      "level": 3,
      "content": "In unity 2019 and newer, if you see a message along the lines of: DllNotFoundException: Unable to load the unmanaged library (x) Reason: libtinfo.so: cannot open shared object file: No such file or directory , try installing ncurses5-compat-libsAUR.\n\n"
    },
    {
      "title": "Unity fails to build project to webGL platform",
      "level": 3,
      "content": "IL2CPP needs libtinfo-5.so library for the building process and ncurses5 provides it. So make sure to install ncurses5-compat-libsAUR if you want to build to webGL.\n\n"
    },
    {
      "title": "Minor stuttering while playtesting (NVIDIA)",
      "level": 3,
      "content": "Vsync does not seem to work correctly with NVIDIA graphics cards / drivers. Solution: In nvidia-settings go to \"OpenGL Settings\" and turn off \"Sync to VBlank\".\n\nThe behaviour occured/noticed when used \"transform.Rotate\" in combination with \"Input.GetKey\".\n\n"
    },
    {
      "title": "Error: Multiple Unity instances cannot open the same project",
      "level": 3,
      "content": "Unity probably did not shutdown properly, in this case you should navigate to your project folder and delete Temp folder.\n\n"
    },
    {
      "title": "Android Remote not working / Running Android build fails with \"Unable to forward network traffic to device\"",
      "level": 3,
      "content": "Try this workaround :\n\n1. Close Unity.\n1. Shutdown adb daemon with adb kill-server\n1. Plug in the android device.\n1. Find your device ID with adb devices\n1. Use adb -s \"deviceID\" forward \"tcp:34999\" \" \" replacing \"deviceID\" with the correct one.\n\nThat's it now you can open unity and test it, an error \"socket bind failed\" will appear that you can safely ignore.\n\n"
    },
    {
      "title": "No window opens: Desktop is 0 x 0 @ 0 Hz",
      "level": 3,
      "content": "If using Wayland, try using the Xorg backend of SDL by setting the environment variable SDL_VIDEODRIVER=x11.\n\n"
    },
    {
      "title": "Brotli invalid ELF header",
      "level": 3,
      "content": "If you see an error similar to:\n\n```\nFailed running python2 \"$EDITOR_PATH/Editor/Data/PlaybackEngines/WebGLSupport/BuildTools/Brotli/python/bro.py\"\n```\n\nEither replace the Brotli Mac OS X egg with a Linux egg at ~/.cache/Python-Eggs/Brotli-0.4.0-py2.7-macosx-10.10-x86_64.egg-tmp, or switch from Brotli to gzip in File > Build Settings > Player Settings > Player > Publishing Settings > Compression Format.\n\n"
    },
    {
      "title": "Cannot load assets in package manager",
      "level": 3,
      "content": "If you have proxy/VPN configured, reset it. Resetting your firewall may also work (e.g., iptables#Resetting rules for iptables).\n\n"
    },
    {
      "title": "Menus don't react to clicks after entering play mode",
      "level": 3,
      "content": "First, install downgradeAUR.\n\nThen, run\n\n```\ndowngrade glib2\n```\n\nand select version \"2.72.1\".\n\n"
    },
    {
      "title": "Unity fails to save preferences",
      "level": 3,
      "content": "Unity Hub or the editor fails to create the folder where it's storing preferences.\n\nIf this happens create the unity3d folder manually in ~/.local/share. Full path should be: ~/.local/share/unity3d\n\nIf done successfully, the editor will create a prefs file in it.\n\n"
    }
  ]
}