{
  "title": "USB flash drives",
  "url": "https://wiki.archlinux.org/title/USB_flash_drives",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Mount\n\nThis document describes how to use the popular USB memory sticks with Linux. However, it is also valid for other devices such as digital cameras that act as if they were just a USB storage device.\n\nIf you have an up-to-date system with the standard Arch kernel and a modern desktop environment, your device should just show up on your desktop, with no need to open a console.\n\n"
    },
    {
      "title": "Auto-mounting with udisks",
      "level": 2,
      "content": "This is the easiest and most frequently used method. It is used by many desktop environments, but can be used separately too.\n\nSee Udisks for detailed information, including list of mount helpers.\n\n"
    },
    {
      "title": "Getting a kernel that supports usb_storage",
      "level": 3,
      "content": "If you do not use a custom-made kernel, you are ready to go, for all Arch Linux stock kernels are properly configured. If you do use a custom-made kernel, ensure it is compiled with SCSI-Support, SCSI-Disk-Support and usb_storage. If you use the latest udev, you may just plug your device in and the system will automatically load all necessary kernel modules.\n\n"
    },
    {
      "title": "Identifying device",
      "level": 3,
      "content": "The first thing one needs to access a storage device is its identifier assigned by kernel. See File systems#Identify existing file systems for details.\n\nNewly plugged-in devices are usually shown in the journal.\n\n"
    },
    {
      "title": "Mounting USB memory",
      "level": 3,
      "content": "See File systems#Mount a file system.\n\nIf mount does not recognize the file system of the device you can try to use the -t argument, see mount(8) for details. If mounting does not work, you can try to recreate the file system or even repartition the disk.\n\n"
    },
    {
      "title": "Allow writing by regular users",
      "level": 4,
      "content": "If you want non-root users to be able to write to the USB stick, you can issue the following command:\n\n```\n# mount -o gid=users,fmask=113,dmask=002 /dev/sda1 /mnt/usbstick\n```\n\nIf it does not work, make sure that the file system is mountable and writable as root, see the previous section for details.\n\n"
    },
    {
      "title": "As normal user with fstab",
      "level": 4,
      "content": "See FAT#Writing to FAT32 as normal user if you want normal user to do the mount/unmount action.\n\n"
    },
    {
      "title": "Mount tools",
      "level": 4,
      "content": "Multiple mount tools facilitate mounting as a regular user.\n\n"
    },
    {
      "title": "No USB storage devices are detected",
      "level": 3,
      "content": "If you have connected your USB storage device and it is not listed by lsblk but appears in the journal without being assigned a block device, see General troubleshooting#Cannot use some peripherals after kernel upgrade.\n\nAlso ensure that your BIOS has both XHCI Handoff and EHCI Handoff enabled, but this is usually not an issue with most modern devices.\n\n"
    },
    {
      "title": "Device not shutting down after unmounting all partitions",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nFailure to power off a device might result in:\n\n- a hard disk drive not parking its head, making a faint scratching sound while spinning out and degrading the device [2], or\n- a solid-state drive (especially older) not flushing its cache buffers or updating its mapping tables, and losing data [3].\n\nWhen you unmount the partitions, the device is still powered on. You should ask the system to turn it off first in order to safely remove it: [4]\n\n```\n# echo 1 > /sys/block/disk_name/device/delete\n```\n\nIf you use udisks, you can use these commands: [5]\n\n```\n$ udisksctl unmount -b /dev/sdXY\n$ udisksctl power-off -b /dev/sdX\n```\n\n"
    },
    {
      "title": "Device is detected but does not register as mountable",
      "level": 3,
      "content": "udev is shipped with a default set of rules, found in /usr/lib/udev/rules.d/, including one for ignoring some specific devices for various reasons. Some hardware devices, such as digital cameras, portable recorders, etc., may format usb storage in a way that results in the ignore rules to be triggered. You can check if one of these rules was applied with the following command and then find the corresponding conditions in the defaults:\n\n```\n$ udevadm info --attribute-walk --name=device_name | grep UDISKS_IGNORE\n```\n\nIf this is the case and your device has this property set to \"1\", you can override it with a custom rule, following the udev page.\n\n"
    }
  ]
}