{
  "title": "Ventoy",
  "url": "https://wiki.archlinux.org/title/Ventoy",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Multiboot USB drive\n\nVentoy is a free and open source tool to create drives that allow you to select and boot any EFI, IMG, ISO, VHD(x), or WIM files stored on a rewritable partition on the drive.\n\nMost types of operating systems are supported (Windows/WinPE/Linux/ChromeOS/Unix/VMware/Xen...), see the full list.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the ventoy-binAUR or ventoyAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "There are three utilities for setting up the media:\n\n1. /opt/ventoy/Ventoy2Disk.sh, which is a shell script to be run from the command line.\n1. /opt/ventoy/VentoyGUI.x86_64, which is a graphical application. xauth or a similar application is needed to escalate to root if the application is not started with root permissions.\n1. Opening file:///opt/ventoy/WebUI/index.html with a web browser.\n\nThe same utilities can be used for upgrading the Ventoy installation on the drive.\n\nVentoy creates two partitions on the drive. Their default names are Ventoy and VTOYEFI. The Ventoy partition is to store the bootable images (iso files), and any other data. VTOYEFI is for the Ventoy binaries.\n\nTo add images from which you can boot, mount the first partition and copy the images over.\n\n"
    },
    {
      "title": "Use without installing",
      "level": 3,
      "content": "If you just want to create a multi-boot drive, you can simply download the pre-built executable at the GitHub releases page. You need dosfstools to be installed because a vfat partition is created by using mkfs.vfat. After verifying the sha256sum and unpacking, you can display the included CLI's[1] help page by running the shell script without any arguments:\n\n```\n# ./ventoy-VERSION/Ventoy2Disk.sh\n```\n\nYou can afterwards upgrade the drive for future versions by following a similar procedure. Downloading a NEWER-VERSION, verifying the sha256sum, unpacking, running\n\n```\n# ./ventoy-NEWER-VERSION/Ventoy2Disk.sh\n```\n\nand following the on screen help message.\n\nAs an alternative to the shell script mentioned here, a GTK/qt[2], and a webUI[3], are also included.\n\n"
    },
    {
      "title": "What version is already installed?",
      "level": 3,
      "content": "With Ventoy2Disk.sh utility mentioned earlier, start, and do not approve, an upgrade process (-u). It will inform from which version it intends to upgrade, before asking for confirmation.\n\n"
    },
    {
      "title": "Checking files integrity",
      "level": 3,
      "content": "As described in upstream documentation, a built-in checksum utility allows verification of the integrity of the files on the disk.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Ventoy Documentation\n- Wikipedia:Ventoy\n\n"
    }
  ]
}