{
  "title": "Volnoti",
  "url": "https://wiki.archlinux.org/title/Volnoti",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Advanced Linux Sound Architecture\n- Desktop notifications\n\nVolnoti is, according to its own GitHub page,\n\nVolnoti can be useful to check volume changes if you are running a lightweight window manager like Openbox, which does not usually come with a notification daemon, especially in combination with your laptop/keyboard's special keys.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the volnotiAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "To start the daemon, run the command\n\n```\n$ volnoti\n```\n\nVolnoti will run in background. In order to have Volnoti run automatically, autostart it. Check the program is running by typing in your terminal emulator\n\n```\n$ volnoti-show 20\n```\n\nA semi-transparent square should appear at the centre of your screen, showing a volume of 25%. Now you should configure Volnoti to display a notification each time your volume is changed.\n\n"
    },
    {
      "title": "Xbindkeys",
      "level": 3,
      "content": "The configuration below will use Volnoti, ALSA and Xbindkeys to show the volume changes while pressing the hotkeys; this example will assume Xbindkeys has already been install and configured as described in its page.\n\nOpen ~./xbindkeysrc in a text editor and add these lines before the string # End of xbindkeys configuration:\n\n```\n# Increase volume\n\"amixer set Master 5%+ && volnoti-show $(amixer get Master | grep -Po \"[0-9]+(?=%)\" | tail -1)\"\n   XF86AudioRaiseVolume\n# Decrease volume\n\"amixer set Master 5%- && volnoti-show $(amixer get Master | grep -Po \"[0-9]+(?=%)\" | tail -1)\"\n   XF86AudioLowerVolume\n# Toggle volume\n\"amixer set Master toggle; if amixer get Master | grep -Fq \"[off]\"; then volnoti-show -m; else volnoti-show $(amixer get Master | grep -Po \"[0-9]+(?=%)\" | tail -1); fi\"\n   XF86AudioMute\n```\n\nThe first two commands will increase or lower the volume when the corresponding special keys are pressed, reading the new volume level and sending it as an argument to volnoti-show; the third one will toggle the volume and display Volnoti's corresponding notification (according to whether the volume was muted or unmuted).\n\nNow you can restart Xbindkeys with kill -1 $(pidof xbindkeys) and test your configuration.\n\n"
    },
    {
      "title": "i3",
      "level": 3,
      "content": "Add the following three lines to your i3 configuration file:\n\n```\nbindsym XF86AudioRaiseVolume exec --no-startup-id \"amixer set Master 2%+ && volnoti-show $(amixer get Master | grep -Po '[0-9]+(?=%)' | head -1)\"\nbindsym XF86AudioLowerVolume exec --no-startup-id \"amixer set Master 2%- && volnoti-show $(amixer get Master | grep -Po '[0-9]+(?=%)' | head -1)\"\nbindsym XF86AudioMute exec --no-startup-id \"amixer set Master toggle && if amixer get Master | grep -Fq '[off]'; then volnoti-show -m; else volnoti-show $(amixer get Master | grep -Po '[0-9]+(?=%)' | head -1); fi\"\n```\n\n"
    }
  ]
}