{
  "title": "WebAuthn",
  "url": "https://wiki.archlinux.org/title/WebAuthn",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Universal 2nd Factor\n- Security\n\nWeb Authentication (WebAuthn) is a web standard published by the World Wide Web Consortium (W3C). WebAuthn is a core component of the FIDO2 Project under the guidance of the FIDO Alliance. The goal of the project is to standardize an interface for authenticating users to web-based applications and services using public-key cryptography.\n\nSimilar to legacy U2F, Web Authentication is resilient to verifier impersonation, that is, it is resistant to active man-in-the-middle-attacks, but unlike U2F, WebAuthn does not require a traditional password. Moreover, a roaming hardware authenticator is resistant to malware since the private key material is at no time accessible to software running on the host machine. Passkey is another term used by some vendors to refer to WebAuthn or FIDO credentials.\n\n"
    },
    {
      "title": "FIDO2 vs U2F",
      "level": 2,
      "content": "FIDO2 is the successor of the FIDO Universal 2nd Factor U2F legacy protocol. FIDO2 authentication has all the advantages of U2F—the primary difference is that a FIDO2 authenticator can also be a single-factor (passwordless) authenticator. The U2F protocol is designed to act as a second factor to strengthen existing username/password-based login flows.\n\n"
    },
    {
      "title": "Authentication for websites",
      "level": 2,
      "content": "WebAuthn/FIDO2 is supported by major sites like Google, Facebook, Twitter, or GitHub. See https://www.dongleauth.com/ to find other websites and links to setup documentation. Major sites offer different WebAuthn variants but may first offer Passkeys authentication, since that allows to transiently synchronize credentials to a cloud-based account instead of relying on a separate hardware authenticator or password manager.\n\nModern browsers like Firefox and Chromium support WebAuthn authentication standalone, additional dependencies are not required.\n\nFor a demo site to test the WebAuthn authentication process, see https://webauthn.io/.\n\n"
    },
    {
      "title": "Local Linux authentication (PAM)",
      "level": 2,
      "content": "For using U2F authentication see U2F.\n\n"
    },
    {
      "title": "Using a FIDO2 authenticator for local login",
      "level": 3,
      "content": "The FIDO2 specification includes an extension called HMAC Secret Extension (hmac-secret), which allows the secure use of a shared secret stored on the authenticator for local authentication.\n\nOne of the easiest ways to setup the local authentication process with FIDO2 is through the use of systemd-homed and the setup options of homectl.\n\n"
    },
    {
      "title": "Using TPM as a FIDO device",
      "level": 3,
      "content": "To use TPM as a FIDO device, install tpm-fido-gitAUR. This is useful for testing or if you do not have a FIDO key.\n\nOther option is https://github.com/matejsmycka/linux-id, a fork of the original tpm-fido.\n\n"
    },
    {
      "title": "Support",
      "level": 2,
      "content": "- Chromium: supported since v70\n- Firefox: supported since v60\n- bitwarden: the web extension firefox-extension-bitwarden-binAUR, bitwarden-chromiumAUR enables saving passkeys directly in the vault without the need for a security key.\n- KeePassXC\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- https://fidoalliance.org/specs/fido-v2.0-rd-20180702/fido-client-to-authenticator-protocol-v2.0-rd-20180702.html\n- https://fidoalliance.org/specs/fido-v2.0-rd-20180702/fido-client-to-authenticator-protocol-v2.0-rd-20180702.html#sctn-hmac-secret-extension\n- Passkeys: a shattered dream\n\n"
    }
  ]
}