{
  "title": "WhatsApp",
  "url": "https://wiki.archlinux.org/title/WhatsApp",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "WhatsApp is a mobile-first instant messaging service owned by Meta, featuring end-to-end encryption. It requires an active mobile phone number and data connection to operate.\n\nThere is no official WhatsApp desktop client for Linux, and Meta has strictly attempted to ban third-party clients and plugins using their protocol. You might want to avoid using WhatsApp altogether in favor of IM services with more openness, such as XMPP, signal-desktop, Telegram, or Matrix.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "You can use one of following methods in order to use WhatsApp in Arch:\n\n"
    },
    {
      "title": "Web",
      "level": 3,
      "content": "WhatsApp Web, the only official way of using WhatsApp on Linux.\n\nNote: This way, WhatsApp Web will always open in the new profile while links and other shortcuts will open in your default profile. You can clear browsing data without worrying about it clearing your WhatsApp login.\n\n- Create and configure a new Chromium profile.\n- Open WhatsApp Web in the new profile.\n- Install WhatsApp Web as an app (Hamburger menu > Cast, save, and share > Install WhatsApp Web...).\n- Set the --profile-directory=Default flag. See Chromium#Making flags persistent for more details.\n\nThis way, WhatsApp Web will always open in the new profile while links and other shortcuts will open in your default profile. You can clear browsing data without worrying about it clearing your WhatsApp login.\n\n"
    },
    {
      "title": "Web-based clients",
      "level": 3,
      "content": "- ElecWhat — Simple and stable WhatsApp client. Uses system electron package to save resources.\n\n- Ferdium — A community fork of franz, previously created to offer an alternative to ferdi.\n\n- Franz — An open-source Chrome-based application that can be used for web-based interface of various instant messaging software including WhatsApp.\n\n- Hamsket — A GPL-licensed alternative to Franz, forked from the last open sources of Rambox.\n\n- Silos — Another web-app container for multimedia apps like WhatsApp web.\n\n- WALC — An unofficial WhatsApp Desktop client for Linux systems.\n\n- WasIstLos (former WhatsApp for Linux) — An unofficial WhatsApp desktop application for Linux.\n\n- WhatsApp Nativefier — A desktop wrapper of WhatsApp Web built using nodejs-nativefierAUR which is unmaintained.\n\n- WhatsDesk — A desktop wrapper of WhatsApp Web built using Electron.\n\n- Whatsie — A desktop wrapper of WhatsApp Web built using Qt WebEngine.\n\n- WhatsTux — A Rust and GTK WhatsApp Web Client.\n\n- ZapZap — A WhatsApp desktop application written in Pyqt6 + PyQt6-WebEngine.\n\n"
    },
    {
      "title": "TUI-based clients",
      "level": 3,
      "content": "- whatscli — TUI-based experimental WhatsApp application. Supports Vim-like navigation natively.\n\n- nchat — A terminal-based chat client with support for WhatsApp.\n\n"
    }
  ]
}