{
  "title": "Writing Article Overviews",
  "url": "https://wiki.archlinux.org/title/Writing_Article_Overviews",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ArchWiki:About\n- Help:Style\n- Help:Editing\n- Help:Article naming guidelines\n- Help:Effective use of headers\n\nThis article was written to assist wiki writers and editors in creating effective articles and expand the ArchWiki readers' experience.\n\nYou are not required to know how to edit a wiki page in order to follow this article. This page is a more general style guide, rather than a technical editing HOWTO.\n\n"
    },
    {
      "title": "Article introduction",
      "level": 2,
      "content": "The article introduction is (usually) the first thing readers encounter and has the purpose of introducing them to the topic.\n\nEach article is started with a set of assumptions. These assumptions are seldom true for most readers, and an article introduction has the purpose of filtering readers that fulfill the assumptions made by writers. You do not really have to introduce readers to the rest of the article, but it may help clear some things up, that would otherwise remain unclear even after reading the whole article... many times over.\n\nFor instance, you may have written an article about configuring the system in a certain way. However, you have assumed that readers have a clean and freshly installed Arch Linux on their primary hard drive. How would your method be affected if the kernel was, for example, customized? Or, how would step 3 work if package X was missing?\n\nYou need to think about prerequisites for your method and present those prerequisites before you start your article. This has two key benefits:\n\n1. It allows readers to decide if they want to read the article, before they have gone too far.\n1. It enables you to write an article without too many unnecessary digressions.\n\nNumber two has a huge impact on reader performance, and actually makes your article more streamlined.\n\nThere are a number of things you might consider including in your article introduction, but here are some of the more important ones in no particular order:\n\n- previous experiences and knowledge required\n- system states and configuration\n- ownership of hardware components\n- what readers are not going to find in the article\n\n"
    },
    {
      "title": "The text",
      "level": 2,
      "content": "We have already mentioned some things you might mention in an article introduction. We will now take a look at some of the problems in formulating an effective and useful article introduction.\n\n"
    },
    {
      "title": "Previous experiences and knowledge",
      "level": 3,
      "content": "When talking about previous experience, you need to keep in mind that there are two meanings of the words. One is a more general meaning. We may call someone a newbie or a guru based on the overall knowledge/experience/reputation of that individual. The other is a concrete experience of participating in an event or activity (and the knowledge derived from that). For practical reasons, it is better to demand previous experience(s) in the latter sense. Most articles on ArchWiki talk about topics that are specific, and in some context. In a given context, a newbie may display proficiency, whereas a guru may show lack of interest. If you require specific previous experiences, readers have a better chance of judging their ability to follow the rest of the article.\n\nYou may also want to provide readers with links to resources that would help them gain knowledge required to understand the article.\n\n"
    },
    {
      "title": "System states and configuration",
      "level": 3,
      "content": "Sometimes, a missing package or a differently configured system component may render an article useless on some systems. Therefore, you need to track down and define all relevant system configuration (like, relevant rc.config parameters, required packages, etc) whenever possible.\n\n"
    },
    {
      "title": "Hardware requirements",
      "level": 3,
      "content": "Hardware requirements are usually fairly obvious. If you are talking about installing drivers for dial-up modem XYZ, nobody will ever think you are talking about a modem ZYX. However, in some cases it is good to mention the specific hardware requirements. For instance, if you are writing an article about installing drivers for XYZ-123, you may warn users that the same might not apply to XYZ-456.\n\nIt is also a nice touch to add the photo of the hardware your article is about to discuss.\n\n"
    },
    {
      "title": "What readers are not going to find in the article",
      "level": 3,
      "content": "Sometimes, the article's title may be slightly misleading. Therefore you may need to warn readers about the actual topic of the article, and possibly offer a link to other articles that readers might have been looking for.\n\nFor example, some readers might have thought this article was about how to format pages using wiki text. Therefore, those readers have been warned that this is not the page they were looking for, and the link to the right page was provided.\n\n"
    },
    {
      "title": "Formatting",
      "level": 2,
      "content": "The formatting of the article introduction follows the usual ArchWiki customs. However, there are still details that deserve closer attention.\n\nWhen listing requirements, you have two approaches. One is to verbosely explain the requirements and other introductory notes in plain (your language here). The other method is to offer a well-organized list of requirements.\n\n"
    }
  ]
}