{
  "title": "Yandex Disk",
  "url": "https://wiki.archlinux.org/title/Yandex_Disk",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is a candidate for merging with List of applications/Internet#Other synchronization clients.** This article or section is a candidate for merging with List of applications/Internet#Other synchronization clients.\n\nThis article or section is a candidate for merging with List of applications/Internet#Other synchronization clients.\n\nYandex.Disk is a free cloud storage service created by Yandex that gives you access to your photos, videos and documents from any internet-enabled device. The official Yandex.Disk console client lets you:\n\n- synchronize files and folders with your Disk,\n- get public links to files and folders,\n- customize folder syncing.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the yandex-diskAUR package. Note that it is a CLI client — there is no official GUI for it at the moment. For alternatives see #Unofficial clients.\n\nTo setup your proxy, user and local folder, enter\n\n```\n$ yandex-disk setup\n```\n\nSyncing will start after completing this step, now you are ready to use Yandex.Disk.\n\n"
    },
    {
      "title": "Commands",
      "level": 2,
      "content": "You can manage your folder using any file manager or console.\n\nFull list of commands is available in man yandex-disk or using\n\n```\n$ yandex-disk --help\n```\n\nHere are some examples of use:\n\n- setup — Launch the setup wizard.\n- start — Launch the daemon and start syncing folders. The current sync status is recorded in the file .sync/status.\n- stop — stop the daemon.\n- status — show daemon status: sync status, errors, recently synced files, disk space status. If FILE is specified, the status for this file will be returned.\n- token — receive OAuth token, encode and save it in a special file (by default ~/.config/yandex-disk/passwd). If the options -p password or --password password are not specified, the password will be read from STDIN.\n- sync — sync the folder and log out (if the daemon is running, wait for syncing to finish).\n- publish — make the specified file/folder public and print the link to STDOUT. The item will be copied to the sync folder. Use the option --overwrite to rewrite existing items.\n- unpublish — removes public access to the file/folder.\n\n"
    },
    {
      "title": "Unofficial clients",
      "level": 2,
      "content": "- Ekstertera — GUI client based on Qt5.\n\n- yandex-disk-indicator — GUI panel indicator.\n\n- ydcmd — Console client written in Python.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "https://yandex.com/support/disk-desktop-linux/index.html\n\n"
    }
  ]
}