{
  "title": "Zeitgeist",
  "url": "https://wiki.archlinux.org/title/Zeitgeist",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Zeitgeist is a service which logs user activities and events, anywhere from files opened to websites visited or conversations held via email and more. It makes this information readily available for other applications to use in the form of timelines and statistics. See the Wikipedia article for a more detailed description of Zeitgeist itself.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the zeitgeist package, which includes the daemon and the datahub. The daemon receives metadata from data sources, and provides them to applications using D-Bus. The datahub provides passive plugins which insert events into Zeitgeist.\n\nTo configure what gets logged by Zeitgeist, install activity-log-manager which provides a graphical user interface where you can filter out specific folders, file types, and applications.\n\nTo monitor and inspect Zeitgeist's log at a low level, install zeitgeist-explorer which provides a graphical user interface where you can see the events logged in real-time just like Wireshark.\n\n"
    },
    {
      "title": "Data providers",
      "level": 3,
      "content": "The following applications are just a few examples of software able to send metadata to Zeitgeist. In some cases this functionality must be enabled manually.\n\n- pantheon-code\n- pantheon-files\n- pantheon-music\n- Zim\n\n"
    },
    {
      "title": "Applications",
      "level": 3,
      "content": "The following applications can be used to browse or search for recent activity using the Zeitgeist engine:\n\n- GNOME Activity Journal — Browse a chronological log of your activities and easily find files, contacts, etc.\n\n- Recent Events applet (Cairo-Dock plugin) — Applet for Cairo-Dock using Zeitgeist.\n\n- Synapse — Semantic launcher written in Vala that you can use to start applications as well as find and access relevant documents and files by making use of the Zeitgeist engine.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Catfish — Versatile file searching tool. Can be powered by Zeitgeist.\n\n"
    }
  ]
}