{
  "title": "ZeroTier",
  "url": "https://wiki.archlinux.org/title/ZeroTier",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "ZeroTier is a cross-platform and easy to use virtual LAN / Hamachi alternative, also available on Android, iOS, Mac, and Windows. A GUI is only available on Mac and Windows according to the developers.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the zerotier-one package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "You will need to create an account over at My ZeroTier and create a network and select your desired options, such as support for IPv4 or IPv6 or both. Keep note of the network ID of the newly-created network as you will be needing it later on.\n\nLeave the page for the network that you will use open, as you will need to authorize each computer or device that you connect, and also verify that they get an IP.\n\nTo begin start zerotier-one.service, if one would like it to start at boot enable zerotier-one.service. To find out your computer id, which will be a 10-digit hexadecimal number similar to 89e92ceee5, run:\n\n```\n# zerotier-cli info\n```\n\n```\n200 info 89e92ceee5 1.2.4 ONLINE\n```\n\nwhere 89e92ceee5 is address and 1.2.4 is the version, followed by its status.\n\nNext you will need to join a network:\n\n```\n# zerotier-cli join network_id\n```\n\nThe network ID is a 16-digit hexadecimal number like 8056c2e21c000001 which you can get on the Networks page.\n\nBack on the network page at my.zerotier, scroll down to the Members section where you should see all addresses that have joined. To authorize each computer or device, check the left-most checkbox and verify that it is given an IP address (this may take 10 or 20 seconds). You may need to run dhcpcd to acquire the new IP address locally.\n\nTo verify that all devices can see each other you can ping each address using its associated IP, like so:\n\n```\n$ ping 192.168.192.91\n```\n\n```\nPING 192.168.192.91 (192.168.192.91) 56(84) bytes of data.\n64 bytes from 192.168.192.91: icmp_req=1 ttl=53 time=52.9 ms\n...\n```\n\nOne can also see connected peers by running:\n\n```\n# zerotier-cli listpeers\n```\n\n```\n200 listpeers <ztaddr> <path> <latency> <version> <role>\n200 listpeers 12ac4a1e71 87.98.218.130/30883;12;12;1.00 589 1.2.5 LEAF\n200 listpeers 8841408a2e 159.203.2.154/9993;13262;13220;1.00 127 1.1.5 PLANET\n200 listpeers 9d219039f3 159.203.97.171/9993;13241;3218;1.00 63 1.1.5 PLANET\n...\n```\n\nand see a list of networks the computer is connected to by running:\n\n```\n# zerotier-cli listnetworks\n```\n\n"
    },
    {
      "title": "Manual configuration",
      "level": 2,
      "content": "Manual configuration can be achieved by creating the file local.conf in the program's home directory /var/lib/zerotier-one. This allows you to set various configuration options, such as restricting the service to specific interfaces, or enforcing use of a different port. This file must be valid JSON as it can be re-written by zerotier-one. Below is an example local.conf which stops zerotier-one using docker and bridged interfaces:\n\n```\nlocal.conf\n```\n\n```\n{\n    \"settings\": {\n        \"interfacePrefixBlacklist\": [ \"docker\", \"br-\" ]\n    }\n}\n```\n\nMore information on the available configuration items is available on the program's GitHub repository.\n\n"
    },
    {
      "title": "Devices in virtual network not reachable",
      "level": 3,
      "content": "Check the unit status of zerotier-one.service. If you see following error, the TUN/TAP kernel module is probably not loaded:\n\n```\nERROR: unable to configure virtual network port: could not open TUN/TAP device: No such file or directory\n```\n\nA reboot should resolve the issue.\n\n"
    }
  ]
}