{
  "title": "Zoom Meetings",
  "url": "https://wiki.archlinux.org/title/Zoom_Meetings",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Jitsi-meet\n- List of applications/Internet#Other IM clients\n\nZoom Meetings (commonly shortened to Zoom) is a proprietary, cross-platform, cloud-based video conferencing platform.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Preferably, install zoomAUR, since the files from the website will not allow self-updating.\n\n"
    },
    {
      "title": "Tips and tricks",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "Virtual backgrounds",
      "level": 3,
      "content": "Zoom saves the default virtual backgrounds to ~/.zoom/data/VirtualBkgnd_Default and the custom virtual backgrounds to ~/.zoom/data/VirtualBkgnd_Custom.\n\n"
    },
    {
      "title": "Logs",
      "level": 3,
      "content": "Zoom saves the logs to /home/user/.zoom/logs/zoom_stdout_stderr.log.\n\n"
    },
    {
      "title": "Use system theme",
      "level": 3,
      "content": "Edit ~/.config/zoomus.conf and change the value of useSystemTheme to true, then restart zoom.\n\n"
    },
    {
      "title": "Disable Zoom mini window",
      "level": 3,
      "content": "Zoom's \"Mini Window\" feature allows to minimize the Zoom video, but keep it on top as an overlay. To disable it:\n\nEdit ~/.config/zoomus.conf and change the value of enableMiniWindow to false, then restart zoom.\n\n"
    },
    {
      "title": "Increase interface size",
      "level": 3,
      "content": "Edit ~/.config/zoomus.conf and add scaleFactor=1.2 to your config. Restart Zoom to apply the change. Note that your autoScale setting is ignored when this is enabled.\n\nAn alternative and more reliable approach is to set QT_SCALE_FACTOR=2 environment variable before launching Zoom (see HiDPI#Qt 5). Otherwise, the embedded \"Schedule\" panel will not be scaled correctly.\n\n"
    },
    {
      "title": "Disable ZoomWebviewHost",
      "level": 3,
      "content": "You can disable ZoomWebviewHost by setting disableCef=false in ~/.config/zoomus.conf if you want to to save RAM. It disables some features such as whiteboard.\n\n"
    },
    {
      "title": "Running on Wayland without Xwayland",
      "level": 3,
      "content": "You need to set xwayland=false in ~/.config/zoomus.conf if you do not use Xwayland. The ZoomWebviewHost process may stop with 0MB memory without Xwayland.\n\n"
    },
    {
      "title": "Wayland",
      "level": 4,
      "content": "To share your screen on Wayland, install the required packages for WebRTC screen sharing, edit ~/.config/zoomus.conf and make sure the value enableWaylandShare is set to true, if not, then restart zoom.\n\nThere are reports that even with all the dependencies in place Zoom will still not use pipewire for screen capture. In this situation manually configuring Zoom to use Pipewire has been reported to work. This can be done as follows:\n\n1. Start the desktop client and go to Settings->Share Screen\n1. Click Advanced\n1. Change the Screen capture mode to Pipewire (as opposed to Automatic)\n\n"
    },
    {
      "title": "Xorg",
      "level": 4,
      "content": "To enable screen share on Xorg, you must change the session type to X11 (i.e. set the XDG_SESSION_TYPE=X11 environment variable). Depending on how you start your graphical session, this value might not be set by default.\n\n"
    },
    {
      "title": "Joining meetings in the browser",
      "level": 2,
      "content": "If you want to avoid the Zoom binary entirely, a reasonable alternative is the Zoom web client. While the web client is not fully on par with all the features offered by the client binary, it offers a smooth and stable experience, and does raise fewer security concerns than installing a proprietary binary.\n\nIf the original meeting URL is https://<subdomain>.zoom.us/j/meeting_id?pwd=password, the web client can be accessed via the URL https://<subdomain>.zoom.us/wc/join/meeting_id?pwd=password.\n\n"
    },
    {
      "title": "\"Redirector\" browser extension",
      "level": 3,
      "content": "In Firefox, Chromium, and Opera, it is possible to use the Redirector extension to rewrite the URL automatically. Create a rule as follows:\n\n- Description: Zoom web client\n- Example URL: https://sub.zoom.us/j/123456?pwd=pass\n- Include pattern: *//*.zoom.us/j/*\n- Redirect to: $1//$2.zoom.us/wc/join/$3\n- Pattern type: Wildcard\n\n"
    }
  ]
}