{
  "title": "Acessibilidade",
  "url": "https://wiki.archlinux.org/title/Acessibilidade",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- TalkingArch\n\nExistem muitos métodos diferentes de fornecer acessibilidade a usuários com deficiência física ou visual. No entanto, a menos que um ambiente de desktop seja usado, a configuração pode exigir alguns ajustes até que fique certo.\n\n"
    },
    {
      "title": "Ambiente de desktop",
      "level": 2,
      "content": "A maioria dos ambientes de desktop modernos é fornecida com um amplo conjunto de recursos, entre os quais se pode encontrar uma ferramenta para configurar as opções de acessibilidade. Geralmente, essas opções podem ser encontradas listadas sob as de \"acessibilidade\" ou sob as do dispositivo de entrada correspondente (por exemplo, \"teclado\" e \"mouse\"). Por exemplo, com GNOME e KDE.\n\n"
    },
    {
      "title": "Independente a ambientes desktop específicos",
      "level": 2,
      "content": "O servidor Xorg possui recursos (accessx) para assistência física, configurando parâmetros via X keyboard extension. Esta seção cobre exemplos.\n\nPara reconhecimento de fala, consulte também Conversores de texto para fala.\n\n"
    },
    {
      "title": "Operando o teclado",
      "level": 3,
      "content": "Para Braille, veja Arch Linux para os cegos.\n\n"
    },
    {
      "title": "Teclas de aderência com systemd",
      "level": 4,
      "content": "Para habilitar as teclas de aderência em um TTY, você precisa saber os códigos exatos das teclas a serem usadas. Eles podem ser encontrados por uma ferramenta como xorg-xev ou xkeycaps. Como alternativa, você pode inspecionar a saída de dumpkeys, desde que o mapa de teclado atual esteja correto.\n\nPor exemplo, um Logitech Ultra-X fornecerá os seguintes códigos de teclas para as teclas modificadoras:\n\n```\nLCtrl = 29\nLShift = 42\nLAlt = 56\nRShift = 54\nRCtrl = 97\n```\n\nEm seguida, use dumpkeys para determinar o intervalo dos códigos de teclas:\n\n```\n# dumpkeys | head -1\nkeymaps 0-63\n```\n\nContinue criando um novo arquivo com um nome adequado, por exemplo \"teclasDeAderência\", e use seu editor favorito para combinar as informações encontradas anteriormente com a função de tecla desejada.\n\nNo caso dos códigos de teclas encontrados anteriormente, você obteria:\n\n```\nkeymaps 0-63\nkeycode 29 = SCtrl\nkeycode 42 = SShift\nkeycode 56 = SAlt\nkeycode 54 = SShift\nkeycode 97 = SCtrl\n```\n\nAqui, a letra \"S\" na frente de uma tecla modificadora indica que queremos a versão de aderência desta tecla.\n\nCarregue seu novo mapeamento executando o seguinte comando:\n\n```\n# loadkeys ./teclasDeAderência\n```\n\nSe você estiver satisfeito com os resultados, mova o arquivo para um diretório adequado. Para ter isso habilitado seja inicializado, veja a seguinte unit systemd:\n\n```\n/etc/systemd/system/loadkeys.service\n```\n\n```\n[Unit]\nDescription=\"Carrega mapeamento de teclas personalizado (teclas de aderência)\"\n \n[Service]\nType=oneshot\nExecStart=/usr/bin/loadkeys /caminho/para/teclasDeAderência\nStandardInput=tty\nRemainAfterExit=yes\n \n[Install]\nWantedBy=multi-user.target emergency.target rescue.target\n```\n\n"
    },
    {
      "title": "Teclas de aderência com xserverrc",
      "level": 4,
      "content": "Um método para habilitar a função de acessibilidade independente de ambiente de desktop é passá-lo pelo X, já que ele é construído com suporte a XKB. Isso pode ser feito definindo parâmetros para o servidor X, conforme especificado em sua página man:\n\n```\n[+-]accessx [ timeout [ timeout_mask [ feedback [ options_mask ] ] ] ]\n              enables(+) or disables(-) AccessX key sequences (Sticky Keys).\n\n-ardelay milliseconds\n              sets the autorepeat delay (length of time in milliseconds  that\n              a key must be depressed before autorepeat starts).\n\n-arinterval milliseconds\n              sets  the  autorepeat  interval (length of time in milliseconds\n              that should elapse between autorepeat-generated keystrokes).\n```\n\nEstes parâmetros devem ser colocados no arquivo ~/.xserverrc, que você pode precisar criar.\n\nPor exemplo, para ativar as teclas de aderência sem tempo limite e sem feedback audível ou visível, é possível usar o seguinte:\n\n```\nif [ -z \"$XDG_VTNR\" ]; then\n  exec /usr/bin/X -nolisten tcp \"$@\" +accessx 0 0x1e 0 0xcef\nelse\n  exec /usr/bin/X -nolisten tcp \"$@\" vt$XDG_VTNR +accessx 0 0x1e 0 0xcef\nfi\n```\n\nNote que uma vez que o X tenha iniciado, por ex. Ao executar startx, ainda é necessário pressionar a tecla Shift 5 vezes para ativar as teclas de aderência. Infelizmente, isso é necessário toda vez que o X inicia. Como alternativa, um script pode ser usado para automatizar esse processo.\n\nSemelhante à maioria das implementações, as teclas de aderência podem ser desativadas pressionando uma tecla modificadora e qualquer outra tecla ao mesmo tempo.\n\n"
    },
    {
      "title": "Mapeamento de botão",
      "level": 4,
      "content": "Usando o xmodmap, você pode mapear funções para botões do mouse, independentemente do seu ambiente gráfico. Para isso, você precisa saber qual botão físico do mouse é lido como o número, que pode ser encontrado por uma ferramenta como xorg-xev. Geralmente, os botões físicos da esquerda, do meio e da direita são lidos como o primeiro, o segundo e o terceiro botão, respectivamente.\n\nDepois de adquiri-los, continue criando um arquivo de configuração em um local adequado, por exemplo, ~/.mouseconfig. Em seguida, abra o arquivo com seu editor favorito e escreva a palavra-chave pointer= seguida de uma enumeração do número de botões do mouse encontrado anteriormente.\n\nPor exemplo, um mouse de três botões com uma roda de rolagem é capaz de fornecer cinco ações físicas: esquerda, central e direita, bem como rolar para cima e rolar para baixo. Isso pode ser mapeado para as mesmas funções usando a seguinte linha no arquivo de configuração:\n\n```\npointer = 1 2 3 4 5\n```\n\nAqui, o local informará a ação necessária para executar uma função interna do botão do mouse. Por exemplo, um mapeamento para pessoas canhotas (botão esquerdo e direito comutado) pode parecer\n\n```\npointer = 3 2 1 4 5\n```\n\nQuando terminar, você poderá testar e inspecionar seu mapeamento executando xmodmap:\n\n```\n$ xmodmap ~/.mouseconfig\n$ xmodmap -pp\n```\n\nUma vez satisfeito, você pode ativá-lo no começo colocando a primeira linha em ~/.xinitrc.\n\n"
    },
    {
      "title": "Teclas de mouse",
      "level": 4,
      "content": "Teclas de mouse (em inglês, mouse keys) é um recurso do Xorg (como teclas de aderência) para usar o teclado (especialmente um teclado numérico) como um dispositivo apontador. Pode substituir um mouse ou trabalhar ao lado dele. É desativado por padrão. Você pode usar\n\n```\n$ xset q | grep \"Mouse Keys\"\n```\n\npara ver o estado. Para ativá-lo para uma sessão:\n\n```\n$ setxkbmap -option keypad:pointerkeys\n```\n\nSe você usa uma configuração com xmodmap, esteja ciente que setxkbmap o redefine.\n\nPara ativar as teclas de mouse permanentemente, adicione\n\n```\nOption \"XkbOptions\" \"keypad:pointerkeys\"\n```\n\nPara o arquivo de configuração do teclado. Isso fará o atalhos Shift+NumLock ativar ou desativar teclas de mouse.\n\nPara mais, veja Keyboard configuration in Xorg#Using X configuration files e X keyboard extension#Mouse control para configuração avançada.\n\n"
    },
    {
      "title": "Assistência visual",
      "level": 3,
      "content": "Como tal, a maioria dos ambientes de desktop modernos é fornecida com um amplo conjunto de recursos para ajustar os aspectos visuais de seu sistema. Geralmente, essas opções são listadas sob as de \"acessibilidade\" ou \"assistência visual\". Como alternativa, opções úteis podem ser encontradas nas configurações dos aplicativos individuais.\n\n"
    },
    {
      "title": "Reconhecimento de voz",
      "level": 4,
      "content": "Veja Reconhecimento de fala.\n\n"
    },
    {
      "title": "Emuladores de terminal virtual e consoles",
      "level": 4,
      "content": "- Edite /etc/vconsole.conf.\n- Edite ~/.Xresources.\n\n"
    },
    {
      "title": "Problemas conhecidos",
      "level": 2,
      "content": "- A configuração de dispositivos de entrada não é reconhecida por softwares que contornam a camada de software, por exemplo, wine, VirtualBox e QEMU.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Aplicativos de acessibilidade avançada do KDE.\n\n"
    }
  ]
}