{
  "title": "Agregando Motores de Busqueda a Firefox Como Usuario",
  "url": "https://wiki.archlinux.org/title/Agregando_Motores_de_Busqueda_a_Firefox_Como_Usuario",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artículos relacionados\n\n- Firefox Tips and Tweaks\n\nFirefox es un popular proyecto open-source, es el navegador web de Mozilla.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete firefox de los repositorios oficiales.\n\nInstale el idioma español con alguno de los siguientes paquetes:\n\n- firefox-i18n-es-ar – Español Argentina\n- firefox-i18n-es-cl – Español Chile\n- firefox-i18n-es-es – Español España\n- firefox-i18n-es-mx – Español Mexico\n\nOtras alternativas incluyen:\n\n- Firefox Extended Support Release — versión de soporte extendido\n\n- Firefox Beta — versión en desarrollo\n\n- Firefox Developer Edition/Aurora — para desarrolladores\n\n- Firefox Nightly — creadas diariamente para pruebas\n\n- Firefox KDE — Version de Firefox que incorpora un parche de OpenSUSE para una mejor intregración con KDE de la que es posible con plugis de Firefox\n\nAquí pueden dar un vistazo a las diferentes versiones de Firefox.\n\n"
    },
    {
      "title": "Add-ons",
      "level": 2,
      "content": "Firefox es bien conocido por su gran cantidad de add-ons que pueden ser empleados para añadir nuevas características o modificar el comportamiento de las características existentes de Firefox. Puede encontrar nuevos add-ons o administrar los instalados mediante el \"Administrador de Add-ons\" del propio Firefox.\n\nPara obtener una lista de add-ons populares, visite: extensiones por descargas semanales en Mozilla.\n\n"
    },
    {
      "title": "Plugins",
      "level": 2,
      "content": "See: Browser plugins\n\nPara comprobar qué plugins están instalados/habilitados, introduzca:\n\n```\nabout:plugins\n```\n\nen la barra de direcciones de firefox. O vaya a Addons desde la barra principal y seleccione la pestaña Plugins. <-- tengo pendiente ponerme el vimperator -->\n\n"
    },
    {
      "title": "Integración con Gnome",
      "level": 3,
      "content": "Instalar firefox-extension-gnome-keyring-gitAUR[enlace roto: package not found] de AUR para integrar Firefox 3.6.x con el Gnome-keyring (\"llavero\" de gnome).\n\nTambién puede instalar firefox-extension-firefoxnotify-gitAUR[enlace roto: package not found] para obtener la integración con libnotify/notifyOSD.\n\n"
    },
    {
      "title": "Diccionarios para corrección ortográfica",
      "level": 3,
      "content": "Haga click derecho con el ratón en cualquier campo de texto y añada el diccionario para el idioma solicitado. Reinicie Firefox, y haga click en el campo de texto de nuevo para habilitar la corrección ortográfica.\n\nInstale hunspell\n\n"
    },
    {
      "title": "Añadiendo motores de búsqueda a Firefox",
      "level": 3,
      "content": "Visite https://addons.mozilla.org/firefox/search-tools/ e instálelos.\n\nSi desea uno personalizado, eche un vistazo a: ~/.mozilla/firefox/xxx.default/searchplugins/ donde xxx es su identificador de perfil.\n\n"
    },
    {
      "title": "firefox-extension-arch-search",
      "level": 4,
      "content": "Añade soporte para las búsquedas relacionadas con Arch (AUR, wiki, forum, etc, según el usuario especifique) a la barra de utilidades de Firefox. firefox-extension-arch-searchAUR\n\n"
    },
    {
      "title": "Firefox en español",
      "level": 3,
      "content": "Para que Firefox se muestre en español, además de instalar el paquete de idioma, es necesario establecer la variable de entorno LC_ALL. Por ejemplo, para español de España, se puede establecer en el fichero ~/.bashrc añadiendo esta línea:\n\n```\nexport LC_ALL=es_ES.UTF-8\n```\n\n"
    },
    {
      "title": "Derivados de Firefox",
      "level": 3,
      "content": "- Iceweasel - El nombre de dos forks (variantes) de Firefox. Uno era un proyecto GNU; el nombre de este proyecto ha cambiado desde entonces a Icecat. second está siendo desarrollado por Debian y está basado en 2.0. En el momento en el que se escribe en AUR sólo está disponible Icecat.\n\n- GNU/IceCat - antiguamente conocido como GNU IceWeasel, es un navegador web distribuido por el proyecto GNU. IceCat es un fork de Mozilla Firefox realizado totalmente de software libre. Es compatible con el sistema operativo GNU/Linux y la gran mayoría de plugins de addons de Firefox. GNU/IceCat puede reemplazar totalmente a Firefox.\n\n"
    },
    {
      "title": "Mejorar la integración de Firefox con KDE",
      "level": 3,
      "content": "- firefox-kde-opensuseAUR\n\n- kpartsplugin[enlace roto: package not found]\n\n- Oxygen KDE\n\n"
    },
    {
      "title": "Nueva barra de menús de Firefox 4/ botón de Firefox",
      "level": 3,
      "content": "Por defecto, Arch Linux muestra la disposición clásica de la barra de menú. Para activar la disposición nueva de Firefox 4 con el botón \"Firefox\" reemplazando la barra de menús, desmarque Vista -> Barra de tareas -> Barra de menú.\n\nEn GNU/Linux sólo obtendrá un botón de color gris en lugar del nuevo botón naranja de Windows. De todas maneras, puede cambiar esto por un agradable icono de Firefox añadiendo a su ~/.mozilla/firefox/userprofile/chrome/userChrome.css esto:\n\n```\n#appmenu-toolbar-button {\n  list-style-image: url(\"chrome://branding/content/icon16.png\");\n}\n#appmenu-toolbar-button > .toolbarbutton-text,\n#appmenu-toolbar-button > .toolbarbutton-menu-dropmarker {\n  display: none !important;\n}\n```\n\nNOTA: puede ser que, si no existen previamente, necesite crear los directorios chrome y userChrome.css.\n\n"
    },
    {
      "title": "Problema abriendo carpetas contenedoras (KDE)",
      "level": 3,
      "content": "Si Firefox en lugar de lanzar su gestor de ficheros preferidos cuando se utiliza la opción \"Abrir carpeta contenedora\" en el administrador de descargas lanza otro, asegúrese que ha seleccionado su gestor de ficheros elegido (por ejemplo, Dolphin) en los ajustes de sistema de KDE.\n\nSi ya ha seleccionado su administrador de ficheros y Cervisia (u otro administrador de ficheros que no sea el favorito) es el que se está abriendo modifique el $HOME/.local/share/applications/defaults.list de su usuario, añadiendo estas dos líneas:\n\n```\nx-directory/normal=kde4-dolphin.desktop;kde4-kfmclient_dir.desktop;\ninode/directory=kde4-dolphin.desktop;kde4-kfmclient_dir.desktop;kde4-gwenview.desktop;kde4-filelight.desktop;kde4-cervisia.desktop;\n```\n\n"
    },
    {
      "title": "Firefox continua creando ~/Desktop incluso cuando no quiero!",
      "level": 3,
      "content": "Vea este post.\n\n"
    },
    {
      "title": "Cómo prevenir que los plugins abran popups ?",
      "level": 3,
      "content": "Se pregunta por qué aparecen popups incluso cuando los ha bloqueado? Al parecer el plugin de Flash puede esquivar los ajustes por defecto y molestarnos a base de popups. Nada que temer, podemos prevenir que esto suceda.\n\nPara evitarlo:\n\n1. Escriba about:config en la barra de direcciones.\n1. Haga click en la página y seleccione Nuevo y después Entero.\n1. Llámelo privacy.popups.disable_from_plugins\n1. Ponga el valor a 2.\n\nLos valores posibles son:\n\n- 0: Permite que los plugins emitan popups\n- 1: Permite popups, pero los limita a dom.popup_maximum.\n- 2: Bloquea los popups de los plugins.\n- 3: Bloquea los popups de los plugins, incluso en los sitios que están permitidos.\n\n"
    },
    {
      "title": "Errores haciendo click con el botón central",
      "level": 3,
      "content": "```\n! La URL no es válida y no puede ser cargada.\n```\n\nOtro síntoma es que hacer click con el botón central tiene un comportamiento inesperado, como por ejemplo acceder a una página aleatoria.\n\nEl motivo viene dado por el uso del botón central en los sistemas operativos derivados de UNIX. El botón central se emplea para pegar el texto que ha sido marcado/añadido al portapapeles. Luego esto posiblemente es lo que entra en conflicto con la característia de Firefox, el cual por defecto carga la URL del texto correspondiente cuando el botón es pulsado. Esto puede ser deshabilitado como sigue:\n\nAbra el navegador, y escriba lo siguiente en la barra de direcciones:\n\n```\nabout:config\n```\n\nBusque middlemouse.contentLoadURL y póngalo a false.\n\nEn caso alternativo, disponer del scroll tradicional al pulsar el botón central (comportamiento por defecto en los navegadores de Windows) puede obtenerse buscando general.autoScroll y poniéndo la variable a true.\n\n"
    },
    {
      "title": "La tecla de borrar no funciona como botón \"Atrás\"",
      "level": 3,
      "content": "Como se indica en este artículo, la característica ha sido eliminada para solucionar un bug. Siga las siguientes instrucciones para volver al comportamiento original.\n\nAbra el navegador y escriba la siguiente dirección:\n\n```\nabout:config\n```\n\nBusque la propiedad browser.backspace_action y póngala a 0 (cero).\n\n"
    },
    {
      "title": "Firefox no recuerda la información de login",
      "level": 3,
      "content": "Puede ser debido a que el fichero cookies.sqlite del directorio de su perfil está corrupto. Para solucionarlo, renombre o elimine el fichero cookie.sqlite mientras Firefox no se está ejecutando.\n\nAbra un terminal (de su elección) y escriba lo siguiente:\n\n```\n$ cd ~/.mozilla/firefox/xxxxxxxx.default/\n$ rm -f cookies.sqlite\n```\n\nReinicie Firefox y comprube si ha resuelto el problema.\n\n"
    },
    {
      "title": "Sitios web rotos / campos de entrada con temas Gtk oscuros",
      "level": 3,
      "content": "Cuando se usa un tema GTK oscuro, es posible que algunas páginas de Internet tengan campos de entrada y de texto ilegibles (p.e. Amazon - texto blanco sobre fondo blanco). Esto puede suceder porque el sitio web sólo defina el color de fondo o el de texto, y Firefox utilice el del tema GTK.\n\nUna solución es definir explícitamente colores estándar para todas las páginas web en ~/.mozilla/firefox/.../chrome/userContent.css.\n\nLo siguiente define los campos de entrada de texto al estándar letra negra sobre fondo blanco; Ambos pueden ser redefinidos por el sitio web, así que se fuerza que los colores sean los siguientes:\n\n```\ninput {\n    -moz-appearance: none !important;\n    background-color: white;\n    color: black;\n}\n\ntextarea {\n    -moz-appearance: none !important;\n    background-color: white;\n    color: black;\n}\n```\n\nEsto forzará los colores (Opción \"Permitir a las páginas elegir sus propios colores [..]\" , en el diálogo Preferencias > Contenido > Color):\n\n```\ninput {\n    -moz-appearance: none !important;\n    background-color: pink !important;\n    color: green !important;\n}\n\ntextarea {\n    -moz-appearance: none !important;\n    background-color: pink !important;\n    color: green !important;\n}\n```\n\nCambie los colores por valores adecuados, o utilice un add-on como por ejemplo Stylish.\n\n"
    },
    {
      "title": "Problemas de asociación de ficheros",
      "level": 3,
      "content": "Para no usuarios de GNOME, es posible que Firefox no asocie los tipos de archivo (en el diálogo \"Abrir Con\"). Instalar libgnomeAUR soluciona el problema.\n\nSi está utilizando KDE también puede hacer lo siguiente:\n\n```\nln -s ~/.local/share/applications/mimeapps.list ~/.local/share/applications/mimeinfo.cache\n```\n\nDe ahora en adelante Firefox debería utilizar las aplicaciones que están indicadas explícitamente en KDE.\n\n"
    },
    {
      "title": "Modo \"Voy a tener suerte\"",
      "level": 3,
      "content": "El modo \"Voy a tener suerte\" permite al usuario aprovechar la potencia de la característica \"Voy a tener suerte\" de Google mediante la barra de direcciones de Firefox.\n\nTo activate this mode, do the following Para activar este modo, haga lo siguiente (solución extraída de este post):\n\n1. Teclee \"about:config\" en la barra de direcciones.\n1. Busque la cadena de caracteres keyword.url\n1. Modifique su valor (si lo tiene) a\n\n```\nhttp://www.google.com/search?btnI=I%27m+Feeling+Lucky&q=\n```\n\n"
    },
    {
      "title": "Modo \"Voy a tener suerte\" (para DuckDuckGo)",
      "level": 3,
      "content": "\"Voy a tener suerte\" es similar al modo \"Voy a tener suerte\" de Google pero utilizando el motor de búsqueda DuckDuckGo.\n\nPara activar este modo, haga lo siguiente (solución utilizando la anterior):\n\n1. Teclee \"about:config\" en la barra de direcciones.\n1. Busque la cadena de caracteres keyword.url\n1. Modifique su valor (si lo tiene) a\n\n```\nhttps://duckduckgo.com/?q=!\n```\n\nEl último caracter es un espacio ' '. Es necesario porque si no lo pone, se convertirá en un !Bang.\n\n"
    },
    {
      "title": "El diálogo \"Desea que Firefox guarde sus pestañas para la próxima vez?\" no aparece",
      "level": 3,
      "content": "Desde el sitio de soporte de Mozilla:\n\n1. Teclee \"about:config\" en la barra de direcciones.\n1. Ponga la variable browser.warnOnQuit a true.\n1. Ponga la variable browser.showQuitWarning a true.\n\n"
    },
    {
      "title": "Firefox en Wayland",
      "level": 2,
      "content": "A partir de la versión 121, Firefox abre de forma predeterminada a través de Wayland y ya no requiere de ninguna configuración adicional.\n\nPara versiones anteriores de Firefox, en caso de no haber un archivo presente, crear uno nuevo. Si existe, añadir al final del documento:\n\nIndividualmente (usuario):\n\n```\nAñadir \"MOZ_ENABLE_WAYLAND=1 firefox\" en  ~/.config/environment.d/envvars.conf\n```\n\nTodo el sistema (globalmente):\n\n```\nAñadir \"MOZ_ENABLE_WAYLAND=1 firefox\" en  /etc/environment.d/envvars.conf\n```\n\nPara verificar si funcionó, revise en el apartado de \"Protocolo de ventana\" en about:support, en donde debe decir wayland.\n\n"
    },
    {
      "title": "Recursos",
      "level": 2,
      "content": "- Detalles sobre Debian y Mozilla® Firefox\n\n- Gnuzilla and IceWeasel\n\n"
    }
  ]
}