{
  "title": "AirPort",
  "url": "https://wiki.archlinux.org/title/AirPort",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Shairport\n\nFrom Wikipedia:\n\nApple sells a number of AirPort models: AirPort Express, AirPort Extreme, and AirPort Time Capsule. The AirPort Time Capsule is essentially the AirPort Extreme, but with a 2-3 TB hard drive added, depending on which model you buy. All AirPort models have the ability to share printers on the network (through the USB port), and all AirPort models support up to 50 users.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Traditionally, AirPort base stations can be configured two ways, both of which require applications from Apple - AirPort base stations do not have web interfaces, unlike most routers. The first is using the desktop application, which is shipped with all Macs as a part of macOS and can be downloaded separately for Windows. There is no GNU/Linux version.\n\nThe second way is to use the AirPort Utility app on an iOS device. If you or a friend has an iPod Touch, iPhone, or iPad lying around, this is probably the most hassle-free way to configure your AirPort base station.\n\nIf that is not an option, you basically have two things to try: either run the desktop version of AirPort Utility in Wine, or use airport-utils-binAUR.\n\n"
    },
    {
      "title": "Music streaming",
      "level": 2,
      "content": "If you want to emulate the AirPort Express, take a look at Shairport Sync. If you wish to use the music streaming feature of AirPort Express base stations, look for \"raop\" in the AUR.\n\n"
    },
    {
      "title": "Printing",
      "level": 2,
      "content": "Scan the Airport Express station to determine which port is used for printing.\n\n```\n# nmap 192.168.0.4\n```\n\n```\nStarting Nmap 4.20 ( https://insecure.org ) at 2007-06-26 00:50 CEST\nInteresting ports on 192.168.0.4:\nNot shown: 1694 closed ports\nPORT      STATE SERVICE\n5000/tcp  open  UPnP\n9100/tcp  open  jetdirect\n10000/tcp open  snet-sensor-mgmt\nMAC Address: 00:14:51:70:D5:66 (Apple Computer)\n\nNmap finished: 1 IP address (1 host up) scanned in 25.815 seconds\n```\n\nNote the port of the jetdirect service, and use a printer URI of socket://, followed by your station IP address, a colon, and the jetdirect port number.\n\nSee CUPS for more information.\n\n"
    }
  ]
}