{
  "title": "Alpine",
  "url": "https://wiki.archlinux.org/title/Alpine",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- OpenPGP\n\nAlpine is based on pine, a text-based E-mail and newsclient that was originally released by the University of Washington in 1991. It is an easier to use alternative to mutt, a more lightweight approach to the mail reader concept.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install alpineAUR or alpine-gitAUR. Optionally a spellchecker may be installed. Alpine supports both aspell and hunspell.\n\ntopalAUR is a glue program that links GnuPG and Alpine.\n\n"
    },
    {
      "title": "IMAP",
      "level": 2,
      "content": "Launch alpine:\n\n```\n$ alpine\n```\n\nNavigate to the configuration page by pressing S then C. Fill in your name, the name of your mailserver in \"User Domain\", and your SMTP server for sending mail. The format for the SMTP server is as follows:\n\n```\nmailserver.org:portnumber/user=username/ssl (or tls)\n```\n\nAlso note the format for where Alpine is configured to keep saved and postponed messages. This keeps the messages on the mailserver, instead of saving them locally.\n\n```\n{mailserver.org}path/to/folder\n```\n\nThe following example assumes a mailserver located at mailserver.org that uses STARTTLS, a user named Jim Bob, and common locations for mail folders on the server.\n\n```\nPersonal Name                     = Jim Bob\nUser Domain                       = mailserver.org\nSMTP Server (for sending)         = mailserver.org:587/user=jimbob123/tls\nNNTP Server (for news)            = <No Value Set>\nInbox Path                        = {mailserver.org}Inbox\nIncoming Archive Folders          = <No Value Set>\nPruned Folders                    = <No Value Set>\nDefault Fcc (File carbon copy)    = {mailserver.org}Sent\nDefault Saved Message Folder      = {mailserver.org}Archives\nPostponed Folder                  = {mailserver.org}Drafts\nRead Message Folder               = <No Value Set>\nForm Letter Folder                = <No Value Set>\nTrash Folder                      = {mailserver.org}Trash\nLiteral Signature                 = <No Value Set>\nSignature File                    = <No Value Set: using \".signature\">\nFeature List                      =\n```\n\nPress E to exit config. From the main menu, navigate the collectionLists page by pressing (S then L) to configure folders. Press enter to edit the folders on mailserver.org, and optionally set a nickname. The Server line uses the same format as the SMTP Server line above, except that this is for retrieving rather than sending mail. The following example is for an IMAP server:\n\n```\nmailserver.org:143/user=jimbob123/tls\n```\n\nThe Path and View fields can often be left blank.\n\n"
    },
    {
      "title": "Setting the return address",
      "level": 2,
      "content": "To set a return address, enter the configuration page and navigate to the \"Customized Headers\" field (either use the \"Whereis\" command to search, or page down a few pages to find this) and change the value to:\n\n```\nFrom:  Jim Bob <jimbob123@mailserver.org>\n```\n\nOf course, replace Jim Bob with your name and put your proper e-mail address in the <>.\n\n"
    },
    {
      "title": "What else can you configure?",
      "level": 2,
      "content": "Almost anything, in particular you can specify which colors to use, (from the main menu press S for set up, then K for colors), a browser to open external links (this is in the \"Config\" setup that we have previously been modifying\"), an alternate text editor to use, different folder views, etc.\n\nPressing W allows you to quickly search for options. Messages can be listed in localtime by enabling the option \"Convert Dates to Localtime\". Toggling options can be done using the enter key.\n\n"
    },
    {
      "title": "Printing from alpine",
      "level": 2,
      "content": "Printing from Alpine directly to lpr does not work with special characters like Germanic umlauts in the Mail to be printed. The a2ps program does help. You can then edit ~/.pinerc:\n\n```\n# Your default printer selection\nprinter=YOURPRINTER [] a2ps -q --center-title --footer -PYOURPRINTER\n\n# List of special print commands\npersonal-print-command=YOURPRINTER [] a2ps -q --center-title --footer -PYOURPRINTER\n\n# Which category default print command is in\npersonal-print-category=3\n```\n\nReplace YOURPRINTER with the name of your printer. Note that these settings can also be applied in the setup UI of Alpine. See the manpage of a2ps for more configuration options.\n\n"
    },
    {
      "title": "Remote configuration",
      "level": 2,
      "content": "From the setup page, press Z to enter RemoteConfigSetup. You will be prompted to upload your addressbook, signature, and configuration. In order to use the remote configuration on any computer, on the command line, enter:\n\n```\n$ alpine -p \"{mailserver.org:143/user=jimbob123/tls}remote_pinerc\"\n```\n\nIt may be desirable to make this command an alias in your .bashrc.\n\n"
    },
    {
      "title": "Tips and tricks",
      "level": 2,
      "content": "There is no direct, or immediately apparent command for arbitrarily invoking an update of the inbox, however, as indirectly referenced in the manual;\n\n```\nNew mail checking and notification occurs automatically every 2.5 minutes and after certain commands, e.g. refresh-screen (Ctrl-L).\n```\n\n"
    }
  ]
}