{
  "title": "Alpm based tools",
  "url": "https://wiki.archlinux.org/title/Alpm_based_tools",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Pacman is a front-end to libalpm(3)—the \"Arch Linux Package Management\" library—which allows alternative tools and front-end to be written.\n\nThis page lists other tools and libraries which make use of libalpm.\n\n"
    },
    {
      "title": "Language bindings",
      "level": 2,
      "content": "libalpm is a C library and thus generally requires tools linking to libalpm to also be written in C. Language bindings allow for libalpm based tools to be written in other languages.\n\n- alpm.rs — Rust bindings for libalpm.\n\n- go-alpm — Go bindings for libalpm.\n\n- pyalpm — Python bindings for libalpm.\n\n"
    },
    {
      "title": "Tools",
      "level": 2,
      "content": "- arch-audit — A utility like pkg-audit based on Arch Security Team data.\n\n- arch-hs — Distribute hackage packages to archlinux.\n\n- arch-rebuild-order — CLI tool to determine the rebuild order of provided package(s).\n\n- expac — Data extraction tool for alpm databases. It features printf-like flexibility and aims to be used as a simple tool for other pacman based utilities which do not link against the library.\n\n- paccat — Utility to cat files from the repos. Useful for looking up default config files or extracting files from packages you do not want to install.\n\n- pacfinder — Pacman repository and package explorer.\n\n- packagekit — High-level GUI front end for a number of different package management systems.\n\n- pac-sort — Sort utility implementing alpm_pkg_vercmp.\n\n- pac-tree — Package dependency tree viewer.\n\n- pacutils — Encapsulates several of the common tasks that most users of libalpm need to perform, such as parsing pacman.conf and providing standard output functions for callbacks. The included programs can also be used as guides for how to accomplish particular tasks using libalpm.\n\n- reboot-arch-btw — Check if you need to reboot due to an updated kernel\n\n"
    },
    {
      "title": "AUR helpers",
      "level": 2,
      "content": "Various AUR helpers make use of libalpm to query the package database.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Pacman\n- libalpm(3)\n\n"
    }
  ]
}