{
  "title": "Arch Linux for the blind",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_for_the_blind",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The official Arch Linux installation medium supports various Accessibility features:\n\n- speech is provided by the espeakup package\n- braille terminal support is handled by the brltty package\n\nThis document describes how to install Arch Linux using these features.\n\n"
    },
    {
      "title": "Boot the live environment",
      "level": 3,
      "content": "When the installation medium starts booting, press Down followed by Enter to boot with speech enabled.\n\nUSB braille displays should be detected automatically via udev.\n\n"
    },
    {
      "title": "Multiple sound cards",
      "level": 3,
      "content": "If your computer has several sound cards, you will hear the following message: Please select your sound card for speech output.\n\nWhen you hear a beep on the output that you would like to use, press Enter to select the card.\n\n"
    },
    {
      "title": "Change speech language",
      "level": 3,
      "content": "To change the espeak-ng language/voice used by espeakup.service, edit the unit so that the language code is appended to default_voice= in the Environment= directive.\n\nYou can also change the espeak-ng voice variant by appending +variant to the language code. See espeakup(8) and espeak-ng(1) for more information.\n\n"
    },
    {
      "title": "Install essential packages",
      "level": 3,
      "content": "For speech support in the installed system, you need espeakup and alsa-utils. If you use a braille display, install the brltty package.\n\nAppend the required packages to the pacstrap(8) call when installing:\n\n```\n# pacstrap -K /mnt base linux linux-firmware espeakup alsa-utils\n```\n\n"
    },
    {
      "title": "Sound card",
      "level": 3,
      "content": "If #Multiple sound cards were detected, copy the /etc/asound.conf file, which has been generated in the installation medium:\n\n```\n# cp /etc/asound.conf /mnt/etc/\n```\n\n"
    },
    {
      "title": "Enable the services",
      "level": 3,
      "content": "To have speech support after booting into the installed system you need to enable espeakup.service. See also #Change speech language.\n\n"
    },
    {
      "title": "Reboot",
      "level": 2,
      "content": "After booting into the newly installed system it should start speaking automatically.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "See Accessibility#Troubleshooting.\n\n"
    }
  ]
}