{
  "title": "ArchWiki",
  "url": "https://wiki.archlinux.org/title/ArchWiki",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Help:Editing\n- Help:Style\n- Help:Reading\n\nThis article is a general overview of the ArchWiki, answering the questions \"Who?\", \"What?\", \"Why?\", and \"How?\".\n\n"
    },
    {
      "title": "Goals",
      "level": 2,
      "content": "The primary objective of ArchWiki is to provide the Arch Linux user community with the most comprehensive and the most accessible documentation on the web. This is a world-wide project with many participants from all corners of the globe. The wiki embraces all Arch Linux principles, in particular with respect to simplicity. ArchWiki is constantly evolving and thrives on collaboration; there is always room for improvement.\n\n"
    },
    {
      "title": "Comprehensive",
      "level": 3,
      "content": "One of the primary objectives of ArchWiki is to cover all aspects of computing using Arch Linux. From the media center to managing corporate networks, anything Arch Linux can achieve is within the scope of ArchWiki.\n\n"
    },
    {
      "title": "Accessible",
      "level": 3,
      "content": "The primary goal of ArchWiki may be grandiose, and thousands of articles are required; ArchWiki must offer a simple and intuitive way of accessing all the information. This is not a simple task, but typical Arch ingenuity and imagination will prevail.\n\nThe official arch-wiki-docs package offers users the ability to download a copy of ArchWiki content. See this forum discussion for details.\n\n"
    },
    {
      "title": "How it works",
      "level": 2,
      "content": "ArchWiki is maintained by the official Maintenance Team and thousands of contributors. Users edit and organize articles to offer readers the best in Arch Linux documentation. The contents are created by the community, for the community: most articles are not written by a single person, but represent a cumulative effort of many people that correct erroneous information, update outdated articles, and otherwise keep improving the ArchWiki contents.\n\n"
    },
    {
      "title": "How you can help",
      "level": 2,
      "content": "ArchWiki is maintained by volunteers. Contributors are never too numerous, and help is always needed. If you feel capable of editing wiki pages, consider donating some of your time and energy to the community.\n\nPlease see ArchWiki:Contributing to discover ways to contribute.\n\n"
    },
    {
      "title": "Early history",
      "level": 2,
      "content": "- 2004-01-11 || An initial wiki-like way of contributing documentation to the forums was announced, based on an open user account.\n- 2004-02-03 || The first traceable proposal of a wiki documentation for Arch Linux was made in the forums.\n- 2004-02-27 || A first wiki based on PhpWiki was announced in the forums.\n- 2005-06-05 || The migration to the current MediaWiki installation was proposed.\n- 2005-07-08 || The ArchWiki was set up on MediaWiki.\n- 2005-07-11 || First edit, made to the ArchWiki:General disclaimer article.\n- 2005-07-11 || First edit in the Main namespace, made to the Main page.\n- 2005-07-18 || The new installation was announced in the forums: the migration of the pre-existing articles from the PhpWiki version thus began.\n\n"
    },
    {
      "title": "Contacts",
      "level": 2,
      "content": "See ArchWiki:Maintenance Team for a list of ArchWiki coordinators.\n\n"
    },
    {
      "title": "Thanks",
      "level": 2,
      "content": "- Hosting is graciously provided by the Arch Linux team\n- Powered by MediaWiki\n- Thanks to all our contributors and supporters!\n\n"
    }
  ]
}