{
  "title": "Artificial Intelligence",
  "url": "https://wiki.archlinux.org/title/Artificial_Intelligence",
  "sections": [
    {
      "title": "Calculator",
      "level": 3,
      "content": "See also Wikipedia:Comparison of software calculators.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- bc — Arbitrary precision calculator language.\n\n- calc — Arbitrary precision console calculator.\n\n- clac — Command-line, stack-based calculator with postfix notation.\n\n- kalker — Command-line calculator with math syntax that supports user-defined variables and functions, complex numbers, and estimation of derivatives and integrals.\n\n- qalc — Command-line calculator and equation solver with fault-tolerant parsing, constant recognition and units.\n\n- calcpy — Terminal calculator and advanced math solver using Python, IPython and SymPy.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Binary — Simple app to convert between different hexadecimal and binary numbers.\n\n- Deepin Calculator — Easy to use calculator for Deepin desktop.\n\n- Extcalc — Qt-based scientific graphical calculator.\n\n- FOX Calculator — Simple desktop calculator.\n\n- galculator — GTK-based scientific calculator.\n\n- Genius — Advanced calculator including a mathematical programming language.\n\n- GNOME Calculator — Scientific calculator included in the GNOME desktop. Part of gnome.\n\n- KAlgebra — Calculator and 3D plotter. Part of kde-education.\n\n- Kalk — A convergent calculator application built with the Kirigami framework. Part of kde-utilities.\n\n- KCalc — Scientific calculator included in the KDE desktop. Part of kde-utilities.\n\n- KEuroCalc — Universal currency converter and calculator.\n\n- Liri Calculator — Calculator for Liri.\n\n- MATE Calc — Calculator for the MATE desktop environment.\n\n- Qalculate! — Calculator and equation solver with fault-tolerant parsing, constant recognition and units.\n\n- SpeedCrunch — Fast, high precision and powerful cross-platform calculator.\n\n- xcalc — Scientific calculator for X with algebraic and reverse polish notation modes.\n\n- Valuta — Simple application for converting currencies.\n\n"
    },
    {
      "title": "Computer algebra system",
      "level": 3,
      "content": "See also Wikipedia:Comparison of computer algebra systems.\n\n- AXIOM — FriCAS: derivative of the powerful AXIOM-CAS\n\n- GAP — Computer algebra system for computational discrete algebra with particular emphasis on computational group theory.\n\n- Maple — Famous commercial CAS. Often used in education.\n\n- Mathics — A free CAS for symbolic mathematical computations which uses Python as its main language. It aims at achieving a Mathematica-compatible syntax and functions. It relies mostly on Sympy for most mathematical tasks and, optionally, Sage for more advanced functionality.\n\n- Mathomatic — General purpose Computer Algebra System written in C.\n\n- Maxima — Maple/Mathematica-like computer algebra system.\n\n- PARI/GP — Computer algebra system designed for fast computations in number theory.\n\n- Singular — Computer algebra system for polynomial computations, with special emphasis on commutative and non-commutative algebra, algebraic geometry, and singularity theory.\n\n- wxMaxima — Graphical user interface for Maxima being a powerful computer algebra system.\n\n- Xcas — User interface to Giac, a free, basic computer algebra system.\n\n"
    },
    {
      "title": "Visualization of networks/graphs",
      "level": 3,
      "content": "- Glue — Linked data visualizations across multiple files.\n\n- Graphviz — The established tool for displaying smallish graphs in 2D.\n\n"
    },
    {
      "title": "Scientific or technical computing",
      "level": 3,
      "content": "See also Wikipedia:Comparison of numerical analysis software.\n\n- Cadabra — A field-theory motivated approach to computer algebra.\n\n- Cantor — Application that lets you use your favorite mathematical applications from within a nice KDE-integrated Worksheet Interface. Part of kde-education.\n\n- FFTW — A Fast Fourier Transform library for computing discrete Fourier transforms. Used for a wide variety of numerical applications, which includes spectral methods.\n\n- FreeMat — Matlab-like program that supports many of its functions and features a codeless interface to external C, C++, and Fortran code, further parallel distributed algorithm development (via MPI), and 3D visualization capabilities.\n\n- GeoGebra — Dynamic mathematics software with interactive graphics, algebra and spreadsheet\n\n- Julia — High-level, high-performance dynamic language for technical computing.\n\n- Kig — Application for Interactive Geometry. Part of kde-education.\n\n- matplotlib (PyLab) — Collection of Python modules (pyplot, numpy, etc.) used for scientific calculations.\n\n- Octave — MATLAB-like language and interface for numerical computations.\n\n- SageMath — Mathematics software system, that combines many existing open-source packages into a common Python interface. Alternative to Magma, Maple, Mathematica and Matlab.\n\n- Scilab — Matlab alternative used for numerical computations. Its syntax is not equivalent to that of Matlab, but it can be easily converted.\n\n"
    },
    {
      "title": "Statistics",
      "level": 3,
      "content": "See also Wikipedia:Comparison of statistical packages.\n\n- gretl — A cross-platform software package for econometric analysis, written in the C programming language.\n\n- JAGS (Just another Gibbs sampler) — Cross-platform program for analysis of Bayesian hierarchical models using Markov Chain Monte Carlo (MCMC) simulation.\n\n- jamovi — Statistics package, which is easy to use, and designed to be familiar to users of SPSS. Based on the Electron platform.\n\n- Python Data Analysis Library (pandas) — Providing high-performance, easy-to-use data structures and data analysis tools with Python programming language.\n\n- PSPP — Free SPSS implementation.\n\n- R — Software environment for statistical computing and graphics.\n\n- RKWard — Frontend for the statistical language R.\n\n- RStudio — A powerful and productive IDE for R written in Qt.\n\n"
    },
    {
      "title": "Data analysis and plotting",
      "level": 3,
      "content": "See also Wikipedia:List of information graphics software.\n\n- AlphaPlot — Application for scientific data analysis and visualization, fork of SciDAVis / QtiPlot.\n\n- DataWarrior — Open-source data visualization and analysis program with embedded chemical intelligence.\n\n- Engauge Digitizer — Extracts data points from images of graphs.\n\n- Fityk — Curve fitting and data analysis application, predominantly used to fit analytical, bell-shaped functions to experimental data.\n\n- Gnuplot — Command-line program that can generate 2D and 3D plots of functions, data, and data fits.\n\n- Grace — WYSIWYG 2D graph plotting tool.\n\n- Graphs — Tool to plot and manipulate data.\n\n- KmPlot — Program to draw graphs, their integrals or derivatives. Part of kde-education.\n\n- LabPlot — Free software data analysis and visualization application, similar to SciDAVis.\n\n- OVITO (Open Visualization Tool) — Scientific data visualization and analysis solution for particle-based simulations.\n\n- Plots — A graph plotting application for GNOME.\n\n- Rocs — Graph Theory IDE for everybody interested in designing and analyzing graph algorithms (e.g., lecturers, students, researchers). Part of kde-education.\n\n- ROOT — Data analysis program and library (originally for particle physics) developed by CERN.\n\nSee also List of applications/Documents#Spreadsheets.\n\n"
    },
    {
      "title": "Proof assistants",
      "level": 3,
      "content": "See also Wikipedia:Proof assistant.\n\n- Agda — Dependently typed functional programming language and proof assistant. It is an interactive system for writing and checking proofs.\n\n- Coq — Formal proof management system. It provides a formal language to write mathematical definitions, executable algorithms and theorems together with an environment for semi-interactive development of machine-checked proofs.\n\n- Isabelle — Generic proof assistant that allows mathematical formulas to be expressed in a formal language and provides tools for proving those formulas in a logical calculus.\n\n- Lean Theorem Prover — Proof assistant developed principally by Leonardo de Moura at Microsoft Research, used in conjunction with the Lean mathematical library.\n\n"
    },
    {
      "title": "Tools",
      "level": 3,
      "content": "- Geiger Counter Logger — Is a lightweight daemon running in the background and constantly reporting your Geiger counter readings to various radiation monitoring websites\n\n- GWtool — Simple tools for working with gravitational waves\n\n- JaxoDraw — A particle physics program for drawing Feynman diagrams.\n\n- InterSpec — spectral radiation analysis software\n\n- Libint — A high-performance library for computing Gaussian integrals in quantum mechanics\n\n- Pysolar — Collection of Python libraries for simulating the irradiation of any point on earth by the sun. It includes code for extremely precise ephemeris calculations.\n\n- Silx — A collection of Python packages for data analysis at synchrotron radiation facilities.\n\n"
    },
    {
      "title": "Physics simulation",
      "level": 3,
      "content": "- Calculix — A three-dimensional structural finite element program.\n\n- DFTB+ — A quantum mechanical simulation software package based on the DFTB method\n\n- EPANET — EPANET performs extended period simulation of the water movement and quality behavior within pressurized pipe networks.\n\n- Elmer_FEM_solver — Finite element analysis (FEA/FEM) software for multiphysics problems. Includes models for fluid dynamics, structural mechanics, electromagnetics, heat transfer, and acoustics.\n\n- FEniCS — An open-source computing platform for solving partial differential equations, enabling users to quickly translate scientific models into efficient finite element code with the high-level Python and C++ interfaces that scale across platforms ranging from laptops to high-performance clusters.\n\n- Finesse — Frequency domain INterfErometer Simulation SoftwarE\n\n- Geant4 — A simulation toolkit for particle physics interactions.\n\n- ONELAB/Gmsh — An open-source, lightweight interface to finite element software, by default containing the mesh generator Gmsh, the finite element solver GetDP and the optimization library conveks.\n\n- Herwig — Herwig is a multi-purpose particle physics event generator.\n\n- Netgen/NGSolve — A high performance multiphysics finite element software, with a flexible Python interface to implement new physical equations and solution algorithms easily.\n\n- OpenFOAM — Software package and toolkit for computational fluid dynamics (CFD).\n\n- OpenLoops 2 — A particle physics package for the fast numerical evaluation of tree and one-loop matrix elements.\n\n- QuTiP — QuTiP is open-source software for simulating the dynamics of open quantum systems\n\n- Rivet — A particle physics package for data analysis and validation of Monte Carlo event generators\n\n- Speaq — Tools for Nuclear Magnetic Resonance (NMR) Spectra Alignment, Peak Based Processing, Quantitative Analysis and Visualizations\n\n- SWMM — Storm Water Management Model is a dynamic rainfall-runoff-subsurface runoff simulation model used for simulation of the surface/subsurface hydrology quantity and quality.\n\n- Sherpa — A particle physics package for Monte Carlo simulation of collider events.\n\n- Step — Two-dimensional physics simulation engine. Part of kde-education.\n\n- VESTA — 3D visualization program for structural models, volumetric data such as electron/nuclear densities, and crystal morphologies.\n\n- WHIZARD — The Generator of Monte Carlo Event Generators for Tevatron, LHC, ILC, CLIC, CEPC, FCC-ee, FCC-hh, SppC and other High Energy Physics Experiments.\n\n"
    },
    {
      "title": "Unit conversion",
      "level": 3,
      "content": "- ConvertAll — Unit conversion application that allows one to combine units in any way (e.g. inches per decade), even if it does not make sense.\n\n- fend — An arbitrary-precision unit-aware calculator.\n\n- Gonvert — Conversion utility that allows conversion between many units like CGS, Ancient, Imperial with many categories like length, mass, numbers, etc.\n\n- Numbat — Statically typed programming language for scientific computations with first class support for physical dimensions and units.\n\n- Rink — A unit conversion tool and library written in rust. It can be used for physics and engineering calculations, as well as dimensionality analysis.\n\n- UDUNITS — A tool for calculations of physical quantities.\n\n- Units — Command-line unit converter and calculator that can handle multiplicative scale changes, nonlinear conversions such as Fahrenheit to Celsius or wire gauge and others.\n\n"
    },
    {
      "title": "Chemistry",
      "level": 2,
      "content": "- ChemCalc — A chemical calculator that calculates the amount of reagents to use when making solutions.\n\n- TCcalc — A basic CLI Chemical thermodynamics calculator. Allows for calculating delta S and H of reactions/state changes.\n\n"
    },
    {
      "title": "Viewers",
      "level": 4,
      "content": "See also Wikipedia:List of molecular graphics systems.\n\n- Avogadro — Editor, viewer and simulator for 3D molecule structures (also supports downloading files from the Protein Data Bank).\n\n- Ghemical — Computational chemistry software package used to edit, view and simulate molecular structures.\n\n- PyMOL — Open-source molecular visualization system that can produce high quality 3D images of small molecules and biological macromolecules, such as proteins.\n\n- UCSF Chimera — Extensible molecular modeling system.\n\n- UCSF ChimeraX — Next-generation molecular visualization program, following UCSF Chimera.\n\n- VMD — VMD is a molecular visualization program for displaying, animating, and analyzing large biomolecular systems using 3-D graphics and built-in scripting.\n\n- wxMacMolPlt — An open-source GUI for preparing, submitting and visualizing input and output for the GAMESS quantum chemistry package.\n\n"
    },
    {
      "title": "Drawing",
      "level": 4,
      "content": "- Chemtool — GTK-based program for drawing chemical structural formulas.\n\n"
    },
    {
      "title": "Modeling",
      "level": 4,
      "content": "- AmberTools — AmberTools consists of several independently developed packages that work well by themselves, and with Amber18 itself. The suite can also be used to carry out complete molecular dynamics simulations, with either explicit water or generalized Born solvent models.\n\n- APBS — Electrostatic and solvation properties for complex molecules.\n\n- COPASI — COmplex PAthway SImulator for analysis of biochemical networks and their dynamics.\n\n- CP2K — A quantum chemistry and solid state physics software package.\n\n- Fpocket — Fpocket is a very fast open source protein pocket detection algorithm based on Voronoi tessellation.\n\n- GROMACS (GROningen MAchine for Chemical Simulations) — Versatile package to perform molecular dynamics, i.e. simulate the Newtonian equations of motion for systems with hundreds to millions of particles.\n\n- LAMMPS — Large-scale Atomic/Molecular Massively Parallel Simulator.\n\n- MODELLER — 3D structure homology modeller.\n\n- NAMD — NAMD is a parallel molecular dynamics code designed for high-performance simulation of large biomolecular systems.\n\n- NWChem — Ab initio computational chemistry software package.\n\n- Open Babel — A library designed to interconvert between many file formats used in molecular modeling and computational chemistry.\n\n- ORCA — ORCA is an ab initio, DFT, and semi-empirical SCF-MO package.\n\n- PDB2PQR — Electrostatic and solvation properties for complex molecules.\n\n- PLUMED — An open source plugin for free energy calculations in molecular systems which works together with some of the most popular molecular dynamics engines.\n\n- PSI4 — Open-source quantum chemistry\n\n- Quantum ESPRESSO — Integrated suite of applications for electronic-structure calculations and materials modeling at nanoscale. It is based on density-functional theory, plane waves, and pseudopotentials (both norm-conserving and ultrasoft).\n\n- RDKit — A collection of cheminformatics and machine-learning software written in C++ and Python.\n\n- rDock — A fast, versatile and open-source program for docking ligands to proteins and nucleic acids.\n\n- smina — Smina is a fork of Autodock Vina that focuses on improving scoring and minimization.\n\n"
    },
    {
      "title": "Simulation analysis",
      "level": 3,
      "content": "- mdanalysis — An object-oriented python toolkit to analyze molecular dynamics trajectories in many popular formats.\n\n- MDTraj — A modern, open library for the analysis of molecular dynamics trajectories.\n\n- xdrfile — Allows to read GROMACS trr and xtc files and also to convert from one format to another.\n\n"
    },
    {
      "title": "Periodic table",
      "level": 3,
      "content": "- eperiodique — A simple Periodic Table Of Elements viewer using the EFL.\n\n- gElemental — Periodic table of the elements with additional information.\n\n- Kalzium — Periodic table of the elements with molecule editor and equation solver. Part of kde-education.\n\n"
    },
    {
      "title": "Climatology",
      "level": 3,
      "content": "- Climate Data Operators — Command line tool to manipulate and analyse Climate model Data. Supported data formats are GRIB, netCDF, SERVICE, EXTRA and IEG.\n\n"
    },
    {
      "title": "Map viewers",
      "level": 4,
      "content": "- Cruiser — Map and navigation application using offline vector maps\n\n- GNOME Maps — A simple map client for GNOME with navigation and GNSS features (adapted to Linux Mobile). Part of gnome.\n\n- kosmindoormap — Indoor cartography, levels by levels of buildings, mainly Train station, and Airport buildings. Based on OSM data.\n\n- MapSCII — Console Map Viewer.\n\n- Mapton — Extensible desktop map and globe application written in Java.\n\n- Marble — Virtual Globe and World Atlas that can be used to learn more about the Earth. Part of kde-education.\n\n- Marble Behaim — Viewer for the oldest existent globe of the Earth made by Martin Behaim and collaborators around 1492.\n\n- Marble Maps — Vector and GNSS navigation system, with Modular turn-by-turn car, foot, and bike navigation system (adapted to Linux Mobile).\n\n- OffRoad — Offline vector map display ported from OsmAnd.\n\n- Organic Maps — GNSS based navigation, with vector off-line and routing features, and turn by turn routing\n\n- OSMin — GNSS based navigation, with vector off-line and routing features, and turn by turn car, foot, bike, and hiking routing (adapted to Linux Mobile).\n\n- Pure Maps — Display vector and raster maps, places, routes, etc.\n\n"
    },
    {
      "title": "Navigation and routing",
      "level": 4,
      "content": "- KTrip — Public transport assistant for mobile devices. Part of kde-utilities.\n\n- Railway — Lets you look up travel information for many different railways, all without needing to navigate through different websites.\n\n"
    },
    {
      "title": "Positioning and tracking",
      "level": 4,
      "content": "- BT747 — The swiss army knife for MTK GPS dataloggers.\n\n- FoxtrotGPS — Lightweight and fast mapping application.\n\n- Gebabbel — Alternative GUI for GPSBabel.\n\n- Gpredict — Real-time satellite tracking and orbit prediction application.\n\n- GPSBabel — Reads, writes, and manipulates GPS waypoints, tracks, routes in a variety of formats.\n\n- gpsd — Service daemon that monitors one or more GPSes or AIS receivers attached to a host computer through serial or USB ports, making all data on the location/course/velocity of the sensors available to be queried on TCP port 2947 of the host computer.\n\n- GpsPrune — View, edit and convert coordinate data from GPS systems.\n\n- GPX Viewer — Simple tool to visualize tracks and waypoints stored in a gpx file.\n\n- GPXSee — GPS log file viewer and analyzer.\n\n- Navit — Modular turn-by-turn car navigation system.\n\n- PreviSat — PreviSat is a satellite tracking software for observing purposes\n\n- QMapShack — Plan your next outdoor trip.\n\n- Satellite — Displays Global Navigation Satellite System (GNSS: GPS, Galileo, Glonass etc.) information obtained from NMEA sources and saves your tracks\n\n- Subsurface — Diving logbook to keep track of your dives by logging dive locations (with GPS coordinates), weights and exposure protection used, divemasters and dive buddies, etc.\n\n- Viking — GTK 2 application to manage GPS data.\n\n"
    },
    {
      "title": "Map editors",
      "level": 4,
      "content": "- JOSM — Main editor for OpenStreetMap written in Java.\n\n- Merkaartor — OpenStreetMap editor.\n\n- OpenOrienteering Mapper — Orienteering mapmaking program.\n\n- Phyghtmap — Generate OSM contour lines from NASA SRTM data\n\n"
    },
    {
      "title": "Geospatial data analysis and GIS",
      "level": 4,
      "content": "- GeoDa — A tool for spatial data analysis.\n\n- GRASS GIS — Geospatial data management and analysis, image processing, graphics/maps production, spatial modeling and visualization.\n\n- gvSIG — vSIG is a geographic information system (GIS), that is, a desktop application designed for capturing, storing, handling, analyzing and deploying any kind of referenced geographic information in order to solve complex management and planning problems.\n\n- Panoply — NetCDF, HDF and GRIB Data Viewer by NASA GISS\n\n- QGIS — Geographic Information System (GIS) that supports vector, raster & database formats.\n\n- SAGA — A Geographic Information System (GIS) software with immense capabilities for geodata processing and analysis.\n\n- WCSTools — A package of programs for setting and using the world coordinate systems\n\n"
    },
    {
      "title": "Geology",
      "level": 3,
      "content": "- CDI — Is a general purpose C-library with an additional Fortran interface for file IO in the geoscience area.\n\n- EnhancedVolcano — Publication-ready volcano plots with enhanced colouring and labeling.\n\n- GEOmap — Topographic and Geologic Mapping.\n\n- GPlates — Is a plate tectonics program. Manipulate reconstructions of geological and paleogeographic features through geological time.\n\n- Gstat — Spatial and Spatio-Temporal Geostatistical Modelling, Prediction and Simulation\n\n- Madagascar — Multidimensional data analysis and reproducible computational experiments.\n\n- SeisComP — A seismological software for data acquisition, processing, distribution and interactive analysis.\n\n- Seismic Un*x — A seismic processing and research environment developed at the Center for Wave Phenomena, Colorado School of Mines\n\n- TauP — A seismic travel time calculator.\n\n"
    },
    {
      "title": "Oceanography",
      "level": 3,
      "content": "- Cmocean — Colormap setup for standardizing commonly-plotting oceanographic variables.\n\n"
    },
    {
      "title": "Weather status",
      "level": 3,
      "content": "- Gis Weather — Customizable weather forecast desktop widget.\n\n- GNOME Weather — Small application for GNOME that allows you to monitor the current weather conditions for your city, or anywhere in the world, and to access updated forecasts provided by various internet services. Part of gnome.\n\n- KWeather — A convergent weather application for Plasma. Part of kde-utilities.\n\n- meteo-qt — System tray application for weather status information.\n\n- wttr — A simple console application to check the weather, using data from https://wttr.in\n\n- Xfce Weather Panel Plugin — Weather forecast plugin for the Xfce4 panel.\n\n- wego — A terminal weather application.\n\n"
    },
    {
      "title": "Astrometrical and image processing software",
      "level": 3,
      "content": "See also Wikipedia:List of astrometric solvers.\n\n- APTS — Set of tools for automatic astrophotography images acquisition and processing\n\n- Astap — Astrometric (plate) solver, stacking of images, photometry and FITS viewer\n\n- AstroCrop — Astronomical image preprocessing tool\n\n- AstroImageJ — ImageJ for Astronomy\n\n- Astrometry.net — Automatic recognition of astronomical images\n\n- AudeLA — AudeLA is a TCL extension aimed at providing amateur astronomers with image processing, telescope controling, ccd camera driving, and various astronomical algorithms\n\n- CARTA — Cube Analysis and Rendering Tool for Astronomy\n\n- FITSH — a software package for astronomical image processing\n\n- GIMP Astronomy Plugins — Set of GIMP plugins for astronomical image processing.\n\n- Ginga — A viewer for astronomical data FITS (Flexible Image Transport System) files\n\n- SCAMP — reads SExtractor catalogs and computes astrometric and photometric solutions for any arbitrary sequence of FITS images in a completely automatic way.\n\n- SExtractor — Is a program that builds a catalogue of objects from an astronomical image.\n\n- Montage — An astronomical image mosaic engine\n\n- Munipack — A general astronomical image processing software\n\n- oaCapture — A planetary imaging application using Qt5\n\n- PlanetarySystemStacker — Produce a sharp image of a planetary system object\n\n- THELI — THELI is a data processing pipeline for optical, near-infrared and mid-infrared astronomical images\n\n"
    },
    {
      "title": "Image capture software",
      "level": 3,
      "content": "- CCDciel — A CCD capture software intended for the amateur astronomer.\n\n- FireCapture — The leading planetary capture tool\n\n- GoQat — Camera acquisition software, especially for QSI cameras, that provides other features such as autoguiding, focusing help and others.\n\n- lin_guider — astronomical autoguiding program\n\n- Mrcal — Is a generic toolkit built to solve the calibration and SFM-like problems we encounter at NASA/JPL.\n\n- Open PHD Guiding — PHD2 astrophotography autoguiding tool\n\n- SAOImageDS9 — SAOImage DS9: Astronomical Data Visualization Application\n\n- Siril — Siril is a software application for astrophotography, which allows pre-processing and processing of images from any type of camera (CCD, planetary camera, webcam etc.)\n\n"
    },
    {
      "title": "Common Library",
      "level": 3,
      "content": "- Astropy — The Astropy Project is a community effort to develop a common core package for Astronomy in Python and foster an ecosystem of interoperable astronomy packages.\n\n- CASA — the Common Astronomy Software Applications package.\n\n- Casacore — package contains the core libraries of the old AIPS++/CASA package.\n\n- CDF — NASA Common Data Format (CDF) library for scientific data management\n\n- ERFA — Essential Routines for Fundamental Astronomy\n\n- HEASoft — NASA high energy astrophysics library\n\n- libTheSky — Fortran library to compute the positions of celestial bodies and events with great accuracy\n\n- Pal — Positional Astronomy Library.\n\n- PyEphem — PyEphem provides scientific-grade astronomical computations\n\n- SOFA — Set of algorithms and procedures used in fundamental astronomy\n\n"
    },
    {
      "title": "Toolkits",
      "level": 3,
      "content": "- AstroML — Machine learning, statistics, and data mining for astronomy and astrophysics\n\n- Exoplanet — exoplanet is a toolkit for probabilistic modeling of time series data in astronomy with a focus on observations of exoplanets\n\n- Galpy — Galactic Dynamics in python\n\n- Gammapy — A Python package for gamma-ray astronomy\n\n- HEALPix — Software for pixelization, hierarchical indexation, synthesis, analysis, and visualization of data on the sphere\n\n- JHelioviewer — Visualization software for solar image data in space weather context\n\n- JMARS — Java Mission-planning and Analysis for Remote Sensing.\n\n- JSkyCalc — A tool for observing preparation in java\n\n- Period04 — Period04 is a computer program especially dedicated to the statistical analysis of large astronomical time series containing gaps\n\n- Pywwt — Is the official toolkit for accessing AAS WorldWide Telescope (WWT) from Python\n\n- RochePlot — Plot the key stages in the evolution of a binary star\n\n- Skyfield — Elegant astronomy for Python\n\n- SolTrack — A free, fast and accurate C/C++ routine to compute the position of the Sun\n\n- SPICE — A comprehensive toolkit and api to design, simulate and analyse space missions\n\n- STILTS — Starlink Tables Infrastructure Library Tool Set\n\n- sunclock — An astronomical world map that shows day and night and the Sun and Moon positions\n\n- Tempo — Pulsar Timing Software\n\n- TOPCAT — Tool for OPerations on Catalogues And Tables\n\n- VaST — VaST is a software tool for finding variable objects on a series of astronomical images\n\n- VStar — VStar is a multi-platform, easy-to-use variable star data visualization and analysis tool that was originally developed as part of the AAVSOs Citizen Sky project\n\n"
    },
    {
      "title": "Calculators and CLI utils",
      "level": 3,
      "content": "- astroTools — Command-line tools for astronomy and astrophysics\n\n- Gnuastro — Various programs and library functions for the manipulation and analysis of astronomical data\n\n- Kosmorro — A program to calculate the ephemerides\n\n- Project Pluto — Project Pluto supplies astronomical software, both commercial and freeware, to amateur and professional astronomers\n\n- star-charter — A command-line tool for producing vector-graphics charts of the night sky in SVG, PDF and PNG formats\n\n- Sunwait — Calculate sunrise/sunset times with civil, nautical, astronomical and custom twilights\n\n"
    },
    {
      "title": "Management of telescopes and observatories",
      "level": 3,
      "content": "- GILDAS — Is a collection of state-of-the-art software oriented toward (sub-)millimeter radioastronomical applications (either single-dish or interferometer)\n\n- imSim — software package that simulates the LSST telescope and survey\n\n- rubin_sim — Scheduler, survey strategy analysis, and other simulation tools for Rubin Observatory\n\n- Srt-py — Small Radio Telescope Control Code for Python.\n\n"
    },
    {
      "title": "Simulation",
      "level": 3,
      "content": "- APSYNSIM — Aperture Synthesis Simulator for Radio Astronomy\n\n- Galaxy2 — Is program which simulates the motion of stars under the influence of gravity\n\n- GalSim — Modular galaxy image simulation toolkit\n\n- FriendlyVRI — Is designed to simulate astronomical observations using linked arrays of radio antennas in a technique called earth rotation aperture synthesis\n\n- Pynterferometer — Is a graphical interface designed to demonstrate the techniques of radio interferometry used by telescopes\n\n"
    },
    {
      "title": "Space exploration programs",
      "level": 3,
      "content": "- Cosmographia — Cosmographia is a visualization program rendering the solar system and its bodies in 3D to create a freely navigable map of the solar system\n\n- Cosmonium — 3D astronomy and space exploration program\n\n- OpenSpace — OpenSpace is an open source, non-commercial, and freely available interactive data visualization software designed to visualize the entire known universe and portray our ongoing efforts to investigate the cosmos\n\n- Our Galaxy — Is a unique app that helps you understand the structural components of the Galaxy and visualize the locations and physical properties of deep sky objects in and around it\n\n"
    },
    {
      "title": "Planetary and Virtual Atlas",
      "level": 3,
      "content": "See also Wikipedia:Planetarium software.\n\nSee also Wikipedia:List of observatory software.\n\n- Aladin — Interactive software sky atlas\n\n- Celestia — 3D astronomy simulation program that allows users to travel through an extensive universe, modeled after reality, at any speed, in any direction and at any time in history.\n\n- Gaia Sky — An open source 3D universe simulator with support for more than a billion objects\n\n- HNSKY — Hallo Northern Sky is the semi professional free planetarium program\n\n- KStars — Planetarium application that provides an accurate graphical simulation of the night sky, from any location on Earth, at any date and time. It is included in KDE Edu.\n\n- Skychart / Cartes du Ciel — Planetarium that maps out and labels most of the constellations, planets, and objects you can see with a telescope. It can also download Digitized Sky Survey Charts and superimpose images over these charts.\n\n- StarPlot — 3-dimensional star chart viewer.\n\n- Stellarium — Beautiful 3D planetarium that uses OpenGL to render a realistic sky in real time.\n\n- Virtual Moon Atlas — Software for Moon observation and survey\n\n- XEphem — Motif-based ephemeris and planetarium program.\n\n"
    },
    {
      "title": "Computational biology and bioinformatics",
      "level": 3,
      "content": "See also Wikipedia:List of open source bioinformatics software.\n\n- Biopython — Python package with tools for computational biology, as well as bioinformatics.\n\n- EMBOSS (European Molecular Biology Open Software Suite) — Open source software analysis package specially developed for the needs of the molecular biology and bioinformatics user community.\n\n- MUMmer — Bioinformatics software system for sequence alignment based on suffix trees.\n\n- Snapgene — Closed source molecular cloning application that offers a fast and easy way to plan, visualize, and document molecular biology procedures. Supports a wide range of cloning and PCR manipulations. The free version allows most common visualizations of a molecular biology workflow.\n\n- UGENE — Application that integrates dozens of well-known biological tools and algorithms, providing both graphical user and command-line interfaces.\n\n"
    },
    {
      "title": "Genealogy",
      "level": 3,
      "content": "- Gramps — Genealogy program, which helps you track your family tree.\n\n- LifeLines — Text based genealogy software for family trees and reports.\n\n"
    },
    {
      "title": "Image manipulation",
      "level": 3,
      "content": "- ImageJ — Java-based image processing and analysing program that provides extensibility via plugins and macros. It is widely used in microscopy (e.g. for cell counting).\n\n- Fiji — ImageJ2AUR distribution with a lot of plugins organized into a coherent menu structure.\n\n"
    },
    {
      "title": "DICOM viewers and volume rendering",
      "level": 3,
      "content": "- aeskulap — Simple DICOM data viewer\n\n- weasis — Multipurpose DICOM viewer with a highly modular architecture\n\n- aliza — Open 2D, 3D and 4D images in DICOM, MetaIO, Nifti, Nrrd and other formats, meshes in DICOM, VTK, STL and OBJ formats\n\n- 3DSlicer — Comprehensive MRI, CT, LSCM microscopy volume processing, segmentation and 3D-reconstruction\n\n- ParaView — Interactive data visualization tool built using VTK that can scale across distributed computer hardware.\n\n"
    },
    {
      "title": "Computer-aided design",
      "level": 3,
      "content": "See also Wikipedia:List of computer-aided design editors.\n\n- BRL-CAD — Constructive solid geometry modeling CAD system that includes an interactive geometry editor, ray tracing support for graphics rendering and geometric analysis, computer network distributed framebuffer support, scripting, image-processing and signal-processing tools.\n\n- FreeCAD — Parametric 3D CAD modeler based on OpenCascade, Coin3D, Qt, and Python with features such as macro recording, workbenches and the ability to run as a server.\n\n- LeoCAD — CAD program for creating virtual LEGO models. It has an easy to use interface and currently includes over 10,000 different pieces created by the LDraw community.\n\n- LibreCAD — A 2D CAD application based on Qt5. Forked from QCAD Community Edition.\n\n- OpenSCAD — A 3D CAD modeler that uses a textual, programmatic approach to creating and manipulating objects.\n\n- QCAD — A 2D CAD application based on Qt. Supports the DFX and HPGL standard file formats, and optionally the DWG format through a proprietary plugin.\n\n- SolveSpace — Powerful 3D CAD constraint-based parametric modeler with simple mechanical simulation capabilities.\n\n"
    },
    {
      "title": "3D printing",
      "level": 3,
      "content": "See also RepRap.\n\n"
    },
    {
      "title": "Slicers",
      "level": 4,
      "content": "Slicers convert 3D models into a format supported by the 3D printer, usually this format is G-code.\n\n- PrusaSlicer — Slicer by Prusa Research. A fork of Slic3r. Aimed at their printers but supports other brands as well. Open source.\n\n- Cura — Slicer by Ultimaker. Aimed at their printers but supports other brands as well. Open source.\n\n- SuperSlicer — Community maintained improved fork of PrusaSlicer. Not brand specific. Open source.\n\n- BambuStudio — Slicer for printers from BambuLabs. Fork of PrusaSlicer. Open source.\n\n- orca-slicer — Community maintained fork of BambuStudio (in turn forked from PrusaSlicer). Open Source.\n\n- MatterControl — Simple 3D editor, slicer, and 3D printer control software by MatterHackers. Not brand specific. Open source.\n\n- IdeaMaker — Slicer by Raise3D. Aimed at their printers but supports other brands as well. Closed source.\n\n- Slic3r — One of the earliest slicers. Not used much any longer. Not brand specific. Open source.\n\n- icesl — Modelling software with integrated slicer. Not brand specific. Closed source.\n\n- FlashPrint — Slicer for the FlashForge 3D printers. Closed source.\n\n"
    },
    {
      "title": "Control software",
      "level": 4,
      "content": "Software for controlling 3D printers, usually over a cable or wireless.\n\n- OctoPrint — Web interface for FDM 3D printers using G-code. Open source.\n\n- PrintRun — GUI control software for FDM 3D printers using G-code. Open source.\n\n- Repetier-Host — Combined slicer and control software for 3D printers. Closed source.\n\n"
    },
    {
      "title": "Electronics",
      "level": 3,
      "content": "See also Wikipedia:Comparison of EDA software.\n\n"
    },
    {
      "title": "Digital logic",
      "level": 4,
      "content": "Digital logic software are mainly simple educational tools that intended for only designing and simulating logic circuits.\n\n- Digital — Interactive simulator similar to the discontinued Logisim. Features Karnaugh maps, logic tables, FSM editor, VHDL export and more, written in Java.\n\n- GTKWave — Fully featured GTK-based wave viewer which reads LXT, LXT2, VZT, FST, and GHW files as well as standard Verilog VCD/EVCD files and allows their viewing.\n\n- Logisim — Educational digital logic design and simulation software, written in Java, officially its development has stopped.\n\n- Logisim Evolution — Project which continue the development of the original Logisim with new features, written in Java.\n\n- PulseView — Logic analyzer, oscilloscope and MSO GUI.\n\n- SmartSim — Simple and beautiful digital logic circuit design and simulation software, mainly target teachers and students, very lightweight and cross platform, GPL licensed, written in Vala.\n\n- WaveDrom editor — Timing diagram rendering in real-time from simple textual description. Can also be edited and embedded in the browser.\n\n"
    },
    {
      "title": "HDL",
      "level": 4,
      "content": "Also see Wikipedia:Hardware description language.\n\n- Gowin EDA Edu IDE — An IDE for Gowin's FGPA devices, including Sipeed Tang Nano and Sipeed Tang Nano 4K.\n\n- Intel Quartus Prime — A set of design tools for Intel's FPGA devices that includes Quartus Prime, ModelSim-Intel, HLS Compiler, etc.\n\n- Lattice Diamond — A set of design tools for Lattice's FPGA chips.\n\n- Microsemi Libero — Development tools for designing with Microsemi's PolarFire, IGLOO2, SmartFusion2, RTG4, SmartFusion, IGLOO, ProASIC3 and Fusion families.\n\n- Xilinx ISE WebPACK — FPGA programmable logic design suit.\n\n- GHDL — Free and Open Source VHDL 2008/93/87 analyzer, compiler and simulator.\n\n- OpenFPGAloader — Universal utility for programming FPGA. Try openfpgaloader-gitAUR if your board is not managed by the stable version.\n\n- Verilator — A Verilog/SystemVerilog simulator, performs lint code-quality checks, compile to threaded C++ code for simulation.\n\n- iverilog — Icarus Verilog compiler and simulation tool (slower but older than Verilator).\n\n- VTR — Verilog to Routing, Open Source CAD Flow for FPGA ResearchVerilog to Route.\n\n"
    },
    {
      "title": "MCU IDE and programmers",
      "level": 4,
      "content": "- Arduino — Arduino prototyping platform SDK.\n\n- avrcalc — Calculator to speed development of Atmel AVRs.\n\n- AVRDUDE — Download/upload/manipulate the ROM and EEPROM contents of AVR microcontrollers.\n\n- stlink — Open source STM32 MCU programming toolset for ST microcontrollers.\n\n- dfu-util — Device firmware update (DFU) USB programmer.\n\n- SPIPGM — Tool for programming serial SPI FlashROM memories attached to PC via parallel port cable.\n\n- esp-idf — Espressif IoT Development Framework. Official development framework for ESP32.\n\n- platformio — Collaborative platform for embedded development, embedded development, with debugger, unit testing, code analysis. Default IDE is VSCode, but can be used by Atom, Eclipse, Emacs Qt Creator, Vim and several other IDE. Core CLI utils.\n\n- sdcc — Small Device C Compiler, appropriate for various 8-bit microcontrollers and microprocessors including those made by or based on Intel MCS51, Maxim/Dallas, DS80C390, Freescale/Motorola HC08, Zilog Z80, Padauk, ST Microelectronics STM8, MOS 6502, and WDC 65C02. Suite contains compiler, assembler, linker, preprocessor, various simulators, debuggers, etc.\n\n"
    },
    {
      "title": "Electronic circuit simulation and schematic capture editing",
      "level": 4,
      "content": "- easy_spice — Electronic circuit simulator. SPICE frontend, using gschem for schematics and ngspice as simulator.\n\n- gnucap — GNU circuit simulator.\n\n- gspiceui — GUI to various freely available Spice electronic circuit simulators.\n\n- Oregano — Graphical software application for schematic capture and simulation of electrical circuits. The actual simulation is done by the ngspice or Gnucap engines.\n\n- ngspice — The established Linux circuit simulator. Open source successor of the spice3f5 code. Has the most versatile user interface; supporting scripting within the circuit descriptions, use through an interpreter, as a C library, through tcl or various external wrappers (e.g., Python).\n\n- Qucs — Electronics circuit simulator application that gives you the ability to set up a circuit with a graphical user interface and simulate its large-signal, small-signal and noise behaviour.\n\n- qucs-s — Electronics circuit simulator that gives you the ability to set up a circuit with a GUI and simulate it. Fork of qucs that uses external, better, programs to do actual simulation.\n\n- Xyce — SANDIA Xyce is an open source, SPICE-compatible, high-performance analog circuit simulator, capable of solving extremely large circuit problems by supporting large-scale parallel computing platforms.\n\n"
    },
    {
      "title": "Electronic design and schematic capture editing",
      "level": 4,
      "content": "- asco — SPICE Circuit Optimizer.\n\n- Fritzing — Easy to use program to draw good-looking circuit diagrams, and also create schematics and PCBs.\n\n- gEDA — Full suite and toolkit of Electronic Design Automation tools that are used for electrical circuit design, schematic capture, simulation, prototyping, and production.\n\n- gEDA PCB — Interactive printed circuit board editor.\n\n- KiCad — Software suite for electronic design automation (EDA) that facilitates the design of schematics for electronic circuits and their conversion to PCB (printed circuit board).\n\n- KTechLab — IDE for microcontrollers and electronic circuit simulation.\n\n- QElectroTech — Application used to draw advanced electrical circuits.\n\n"
    },
    {
      "title": "Telecommunication",
      "level": 2,
      "content": "- GNU Radio — Software development toolkit that provides signal processing blocks to implement software radios.\n\n- Gqrx — Software defined radio receiver implemented using GNU Radio and the Qt GUI toolkit.\n\n- Pothos — The Pothos project is a complete data-flow framework for creating topologies of interconnected processing blocks.\n\n- SDR# — The most popular SDR program.\n\n- SigDigger — Qt-based digital signal analyzer, using Suscan core and Sigutils DSP library.\n\n"
    },
    {
      "title": "Amateur radio",
      "level": 3,
      "content": "See the main article: Amateur radio#Software.\n\nSee also Wikipedia:List of software-defined radios.\n\n"
    },
    {
      "title": "Simulation modeling",
      "level": 2,
      "content": "- Flight Gear — Open-source, multi-platform atmospheric and orbital flight simulator with a flight dynamics engine (JSBSim) that is part of a 2015 NASA benchmark to judge new simulation code to space industry standards.\n\n- gephi — Gephi is an open-source network analysis and visualization software package written in Java.\n\n- golly — Golly is an open source, cross-platform application for exploring Conway's Game of Life and many other types of cellular automata.\n\n- Netlogo — NetLogo is a multi-agent programmable modeling environment.\n\n- AnyLogic — AnyLogic is a cross-platform proprietary multimethod simulation modeling tool, which is also available for personal use.\n\n"
    },
    {
      "title": "Architecture",
      "level": 3,
      "content": "- edumips64 — Cross-platform educational MIPS64 CPU simulator.\n\n- Qiskit Aer — A high performance simulator for quantum circuits that includes noise models.\n\n- QtMips — MIPS CPU simulator for education purposes with pipeline and cache visualization.\n\n- QtRvSim — RISC-V CPU simulator for education purposes.\n\n- QtSpim — Qt port of one of the first educational MIPS CPU simulators. No longer maintained, but still used in some classrooms.\n\n"
    },
    {
      "title": "Artificial intelligence",
      "level": 3,
      "content": "See also Wikipedia:Comparison of deep learning software.\n\n- Fast Artificial Neural Network — Library for developing feedforward Artificial Neural Networks.\n\n- Mycroft — Intelligent personal assistant and knowledge navigator with speech recognition.\n\n- Orange — Data visualization, machine learning and data mining toolkit, accessible via visual programming and Python.\n\n- Torch — Machine learning library, scientific computing framework, and script language based on LuaJIT.\n\n- Tensorflow — An end-to-end open source machine learning platform.\n\n- Prolog — Prolog is a logic programming language associated with artificial intelligence and computational linguistics.\n\n- PyTorch — An open source machine learning framework that accelerates the path from research prototyping to production deployment.\n\n- Theano — Theano is a Python library that allows you to define, optimize, and evaluate mathematical expressions involving multi-dimensional arrays efficiently.\n\n"
    },
    {
      "title": "Distributed systems",
      "level": 3,
      "content": "- SimGrid — A scientific instrument to study large-scale distributed systems.\n\n- Shadow — An open-source distributed system/network simulator/emulator hybrid (e.g. for Tor and Bitcoin).\n\n"
    },
    {
      "title": "Networking",
      "level": 3,
      "content": "- CORE — Common Open Research Emulator.\n\n- IMUNES — Integrated Multiprotocol Network Emulator/Simulator.\n\n- GNS3 — Network software emulator using a combination of virtual and real devices to simulate complex networks.\n\n- ns-2 — Discrete event simulator targeted at networking research.\n\n- ns-3 — Discrete-event network simulator for Internet systems.\n\n- OMNeT++ — Component-based simulation package designed for modeling communication networks.\n\n"
    },
    {
      "title": "Photogrammetry",
      "level": 3,
      "content": "See also Wikipedia:Comparison_of_photogrammetry_software.\n\n- OpenMVS — A library for computer-vision scientists and especially targeted to the Multi-View Stereo reconstruction community.\n\n- OpenMVG — OpenMVG provides an end-to-end 3D reconstruction from images framework compounded of libraries, binaries, and pipelines.\n\n- AliceVision — Photogrammetric Computer Vision Framework\n\n"
    }
  ]
}