{
  "title": "ASUS MeMO Pad 7 (ME176C(X))",
  "url": "https://wiki.archlinux.org/title/ASUS_MeMO_Pad_7_(ME176C(X))",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nSD card |  | Yes\nGPU |  | Yes\nTouchscreen |  | Yes\nBattery |  | Yes\nAudio |  | Yes\nWi-Fi |  | Yes\nBluetooth |  | Yes\nUSB-OTG |  | Yes\nSensors |  | Yes\nBacklight |  | Yes\nCamera |  | No\nGPS |  | No\n\nThe ASUS MeMO Pad 7 (ME176C) is an x86_64-based Android tablet. With Android 5.0 (Lollipop) it was updated with UEFI boot, which makes it possible to boot any Linux distribution on it. In general, Arch Linux works as-is, but there are additional (custom) packages available for full functionality.\n\n"
    },
    {
      "title": "Overview",
      "level": 2,
      "content": "archlinux-me176c contains a few additional packages that simplify installation and provide additional functionality.\n\n"
    },
    {
      "title": "Requirements",
      "level": 3,
      "content": "- USB-OTG hub with external power supply (or USB-OTG adapter and USB hub with external power supply?)\n- USB keyboard\n- USB flash drive\n- Consider testing Arch Linux installation using UEFI and systemd-boot on a desktop PC or VM first.\n\n"
    },
    {
      "title": "Boot loader",
      "level": 3,
      "content": "The tablet can boot using UEFI from the internal storage and USB(-OTG). It does not seem to be able to boot directly from an external SD card. However, it is possible to keep only the boot partition on the internal storage and have the root partition on an external SD card for dual/multi boot.\n\n1. To boot from internal storage you need an UEFI boot loader. me176c-boot is a fork of systemd-boot with extra features for this tablet. See me176c-boot - Installation.\n1. There is not enough space on the EFI system partition to use it as a boot partition. Follow me176c-boot - Setting up an additional ESP partition to set up a supplemental ESP on the APD (ASUS Product Demo) partition.\n\n"
    },
    {
      "title": "Boot the live environment",
      "level": 3,
      "content": "The default Arch Linux ISO does not contain the packages from archlinux-me176c. Therefore, Wi-Fi is not working out of the box. For convenience there are custom ISO provided in the archlinux-me176c releases. They do not differ from the default except that they run with linux-me176c and have all me176c packages installed. Look for the latest \"archiso\" release and download it, then follow USB flash installation media to flash it to your USB flash drive.\n\nConnect the USB keyboard and the USB flash drive to the USB hub, enable the external power supply and connect it to the tablet while it is powered off. Keep pressing F2 to enter the UEFI setup. There is no need to change anything. Navigate to the Save & Exit tab and use Boot Override to boot from the USB flash drive.\n\nInstallation instructions are provided in the Installation guide. A few device-specific recommendations and instructions are listed here.\n\n"
    },
    {
      "title": "Partitioning",
      "level": 3,
      "content": "Note: **Do not wipe or re-partition the internal storage!** \n\nThe internal storage is usually available as /dev/mmcblk2, the external SD card as /dev/mmcblk0. Check carefully. The internal storage has 16 partitions.\n\nme176c-boot - Example: Dual/multi boot provides an overview about possible partitioning for dual/multi boot setups.\n\nAt the very least, you need a single root partition, and /boot on the ASUS Product Demo (APD) partition. If you have not changed the APD file system to FAT32 yet, do it first:\n\n```\n# mkfs.fat -F32 /dev/disk/by-partlabel/APD\n# mount ... /mnt\n# mkdir /mnt/boot\n# mount /dev/disk/by-partlabel/APD /mnt/boot\n```\n\n"
    },
    {
      "title": "Additional packages",
      "level": 3,
      "content": "Enable upi_ug31xx.service (from me176c-batteryAUR) if you have chosen to install it.\n\n"
    },
    {
      "title": "Boot loader configuration",
      "level": 3,
      "content": "There is no need to install any boot loader when using me176c-boot. However, you need to create a loader configuration for your Arch Linux installation. The configuration needs to reside on the main EFI system partition. While in the chroot, mount the ESP at /mnt:\n\n```\n# mount /dev/disk/by-partlabel/ESP /mnt\n```\n\nThen create a new loader configuration in /mnt/loader/entries. Make sure to reference the APD partition, correct kernel and additional initrds:\n\n```\ntitle    Arch Linux\nvolume   80868086-8086-8086-8086-000000000007\nlinux    /vmlinuz-linux-me176c\ninitrd   /acpi-me176c.img\ninitrd   /initramfs-linux-me176c.img\noptions  root=PARTUUID=... rw\n```\n\nConsider setting up Intel Microcode updates.\n\n"
    },
    {
      "title": "Packages",
      "level": 2,
      "content": "- me176c-acpiAUR contains a patched ACPI DSDT that is necessary for Touchscreen, Bluetooth, Battery/Charging and other functionality. Installs additional initrd /acpi-me176c.img.\n- me176c-firmwareAUR contains additional Wi-Fi/Bluetooth firmware from the stock ROM.\n- me176c-factoryAUR loads the Wi-Fi/Bluetooth MAC address from the factory partition and provides udev rules/systemd units to automatically apply them while booting.\n- me176c-batteryAUR provides systemd units for the battery daemon upi_ug31xx used on the stock ROM. It may be needed for the battery driver to work correctly. Start/enable upi_ug31xx.service.\n- thermald-me176cAUR provides a custom configuration for thermald based on values from the stock ROM. Start/enable thermald-me176c.service instead of thermald.service.\n\nThese packages are maintained on GitHub and are available through the AUR. Older versions are available on GitHub Releases.\n\n"
    },
    {
      "title": "me176c-factory",
      "level": 3,
      "content": "With me176c-factoryAUR installed, the Wi-Fi/Bluetooth MAC address is loaded from the factory partition during the boot process and applied to the controllers. This is necessary for Bluetooth to work, because it does not have a unique MAC address otherwise. If you would like to use MAC address spoofing you may need to disable this feature by masking me176c-factory-wifiaddr@wlan0.service and/or me176c-factory-bdaddr@hci0.service. The MAC addresses are loaded using me176c-factory.service and are available in /run/me176c. See me176c-factory.\n\n"
    },
    {
      "title": "Swap",
      "level": 3,
      "content": "The tablet has only very little RAM, so you almost certainly want to set up some kind of swap space. However, keep in mind SD cards are slow and flash storage in general has only a limited amount of write cycles. Using it as swap space may kill it quickly. An alternative is zram, which compresses parts of the RAM to provide additional space at the cost of higher CPU usage.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "Unless you are using PulseAudio, you need to configure a few ALSA mixers to make audio working. This is done using alsaucm:\n\n```\n# alsaucm -i -c bytcr-rt5640\nalsaucm>> reset\nalsaucm>> set _verb HiFi\nalsaucm>> set _enadev Speaker\n```\n\nUsing ALSA some audio files (especially MP3/AAC) are not played correctly when converted to float format instead of s16. This does not happen when using PulseAudio.\n\n"
    },
    {
      "title": "Screen rotation",
      "level": 3,
      "content": "See Automatic Rotation. To rotate the Linux console, add the kernel parameter fbcon=rotate:<direction>, e.g. fbcon=rotate:1 to rotate 90° (see fbcon.html).\n\n"
    },
    {
      "title": "Hall sensor",
      "level": 3,
      "content": "If you have a case that closes magnetically and automatically wakes/puts the device to sleep, it may trigger too early/often and suspend your device unexpectedly. To disable this, edit /etc/systemd/logind.conf with HandleLidSwitch=ignore.\n\n"
    },
    {
      "title": "See also",
      "level": 3,
      "content": "- Wireless network configuration\n- Tablet PC\n- Power management\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- XDA-Developers Forum Thread\n- Project Overview for ASUS MeMO Pad 7 (ME176C(X))\n- archlinux-me176c (source code for packages)\n- me176c-boot (documentation, examples and source code)\n- linux-me176c (shared code and Linux kernel source code)\n\n"
    }
  ]
}