{
  "title": "ASUS Zenbook UM3402YA",
  "url": "https://wiki.archlinux.org/title/ASUS_Zenbook_UM3402YA",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "In the default kernel configuration, there is currently no sound output with the internal speakers, due to the Cirrus CS35L41 HD amplifier which cannot be set up properly on boot [1]. The ASUS Zenbook UM3402YA series seems to not be the only device where this problem occurs. This was first caused by a firmware bug, but according to a Cirrus developer, the no-sound-issue seems to be fixed in a BIOS update due to the missing of certain ACPI entries [2].\n\nThere are some unofficial patches available, but these patches got rejected by a kernel developer due to the possibility of harming your device. An updated patches is available for the 6.2 kernel. Also this ssdt patch can be applied by grub (also needs at least 6.2 kernel) possibility of harming your device.\n\nSome further, related threads: [3], [4], [5], [6], [7], [8]\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "If you have kept Windows in dual-boot and cannot get Bluetooth working: power-off your laptop, then hold power button for 60 seconds. That will reset UEFI settings, so disable Secure Boot again if needed. After that Bluetooth will be detected and work properly.\n\n"
    },
    {
      "title": "Fingerprint",
      "level": 2,
      "content": "See fprint, in particular fprint#Enrolling works but verifying does not for tips on how to use the sensor.\n\n"
    },
    {
      "title": "Fan control",
      "level": 2,
      "content": "See ASUS Zenbook UM3402YAR#Fan control.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Laptop\n- Laptop/ASUS\n\n"
    }
  ]
}