{
  "title": "ASUS ROG STRIX G17 (2022)",
  "url": "https://wiki.archlinux.org/title/ASUS_ROG_STRIX_G17_(2022)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad | 04F3:319B | Yes\nKeyboard | 0b05:19b6 | Yes\nGPU (AMD) | 1002:1681 | Yes\nGPU (NVIDIA) |  | Untested\n10de:24a0 | Yes\n | Untested\nWebcam |  | Untested\nEthernet | 10ec:8125 | Yes\nBluetooth | 14c3:7922 | Yes\nSpeakers | 1022:15e3 | Yes\nMicrophone | Partial\nWi-Fi | 14c3:7922 | Yes\nTPM 2.0 |  | Yes\n\nASUS ROG STRIX G17 (2022) refers to the following laptop models:\n\n- ASUS ROG Strix G17 (2022) G713RW\n- ASUS ROG Strix G17 (2022) G713RM\n- ASUS ROG Strix G17 (2022) G713RC\n- ASUS ROG Strix G17 (2022) G713RS\n\nThe only apparent difference between the models is the dedicated NVIDIA GPU (RTX 3050, RTX 3060, RTX 3070-Ti or RTX 3080) and the display (1440p@240hz or 1080p@360hz). International versions may have more differences such as a lower end processors, or no webcam.\n\nThese laptops seem to work extremely well out of the box with the only real problem of note being some issues with the microphone.\n\n"
    },
    {
      "title": "ASUS Linux",
      "level": 2,
      "content": "The ASUS Linux stack provides users of this laptop with a great many ASUS specific functions, to name a few:\n\n- Battery Charge Limit,\n- Multiplexer (GPU) Controls,\n- Panel Overdrive,\n- Much more.\n\nIt is highly recommended to install these tools for the optimal experience on these laptops.\n\n"
    },
    {
      "title": "CPU",
      "level": 2,
      "content": "There is a known issue for AMD CPUs where there is a system-wide stutter (audio/video and input will all stutter) for a few seconds whenever TPM does its completely non-shady spyware thing. This model is affected by that, and this issue is OS agnostic. There is no option to disable TPM in the bios. You can expect this to happen maybe once per hour on any recent AMD PC. This issue has been hotfixed since kernel 6.5 (see note).\n\n- Kernel 6.3 was supposed to have a hotfix for this issue, but it does not seem to work for this model.\n- On 7 August 2023 a decision was made to disable random number generation on fTPM for all AMD fTPM users to combat this issue on kernel 6.5 and also on the next updates to other stable kernels 6.1 and newer. This did finally resolve the issue for this laptop.\n\n"
    },
    {
      "title": "Undervolt",
      "level": 3,
      "content": "Like with many laptop models, these models seem to be designed to run your CPU at a steamy 90+°C when under load, as such thermals (and therefore performance) may be improved with undervolting. You do this at your own risk!\n\nYou can undervolt via the amdctlAUR utility, it is recommended to only do so in small increments (e.g. 5-10mv at a time or so)\n\n"
    },
    {
      "title": "Display",
      "level": 2,
      "content": "The default color profile you will get for the display may be wrong thus displaying colors incorrectly (this happened on the tested model), to get a correct color profile you can boot into windows and extract the color profile from there. The main problem is that the color temperature in the default profile you will get on Linux from the EDID will be configured for 5000k when it should be 6500k as is standard.\n\nIf you have the same 1440p@240hz display as the tested model this color profile might work for you.\n\n"
    },
    {
      "title": "Video",
      "level": 2,
      "content": "The dedicated graphics are multiplexed and should work well for VGA pass-through, as well as just behave generally better than non-multiplexed GPUs.\n\n"
    },
    {
      "title": "Universal",
      "level": 3,
      "content": "Stutters a lot when display refresh rate misconfigured (the tested model behaved fine at 240hz(native for that model) and 120hz, but lower (96, 72 and 60) resulted in a great deal of stuttering on the display); This is a common problem (not unique to this hardware)\n\n"
    },
    {
      "title": "Integrated AMD graphics",
      "level": 3,
      "content": "The integrated GPU works without problems as expected.\n\n"
    },
    {
      "title": "Dedicated NVIDIA graphics",
      "level": 3,
      "content": "- If you boot on battery then plug the laptop into AC, the GPU will still perform as if you are on battery. (bug report)\n- If you boot on AC power then unplug your laptop and run on battery, the GPU will try to perform as if it were still on AC (this could damage your hardware!) (bug report)\n\nThe solution to the problems with GPU performance modes not properly changing when switching between battery and AC power is to log out of your x session or restart Xorg. (Wayland seems to be unaffected)\n\n"
    },
    {
      "title": "Playback",
      "level": 3,
      "content": "Playback works near flawlessly out of the box, the only issue is the occasional (non-frequent) crackling noise, but this issue occurs on windows as well so it is not a Linux or ALSA specific issue. The device was tested with PipeWire, PulseAudio performance was not tested.\n\nIf there is a lot of crackling in an application (particularly Wine applications) you can try setting PULSE_LATENCY_MSEC to 83 or 126, alternatively you can follow the instructions in this guide to alleviate the issue.\n\nYou can achieve Dolby Atmos like effects and much more through EasyEffects, although it may require you to work a bit to get an optimal preset set up. Chances are you can make the speakers sound even better on Linux with EasyEffects than they do on Windows with Dolby Atmos (this was the case for the tested model according to the tester, but as sound quality is subjective mileage may vary)\n\nUse the following kernel module parameter:\n\n```\nsnd-hda-intel model=asus-zenbook-ux31a\n```\n\nMight improve the audio, but the difference is so small it could easily be placebo; this requires further testing.\n\n"
    },
    {
      "title": "Recording",
      "level": 3,
      "content": "The microphone has somewhat serious problems, while it does 'work' it creates constant static noise with spikes of even louder static noise that occur about once every other second.\n\nThrough EasyEffects it is possible to make the mic 'usable' by setting mic volume to 30-40% and using a good noise & echo cancelling preset, but it will never sound very good.\n\nComparatively on Windows it sounds very high quality but has problems of its own, a user reported the issue of their internal microphone not working unless their headphones (which did not have a microphone attached) were plugged in. It would also seemingly at random stop working and then just as randomly start working again.\n\nThe reason might be related to soundwire, since the model has an AMD Audio Coprocessor suspected of being related to that, and this technology is among other things specifically for microphone arrays.\n\nNote: **might** \n\n"
    },
    {
      "title": "Wi-Fi and Bluetooth",
      "level": 2,
      "content": "The Wi-Fi and Bluetooth are on the same MediaTek Corp. Device 7922 chip. It is only supported in kernel 5.17 (possibly 5.16) and up.\n\nUser reports an issue where the Bluetooth seemed to be working but the Wi-Fi was not, with a hardware init failed error. Cold booting (shutting down the PC for a couple mins and then starting it again) solved the issue that time, but it seems a common issue with this chip.\n\nIt should however be noted that the hardware initialization issue did not occur on Windows, and booting into Windows and back into Linux did not resolve the issue in my case.\n\nWhatever conditions cause the chip to become undetectable by the driver can occur while the PC is running leading to a driver crash which will lead to a hard system freeze, after which you will again encounter the hardware initialization issue. When this happens a cold boot (shut down, wait 2 minutes, turn on again) should be enough to recover.\n\nThe performance of the card also may not be very good, although it is untested on this particular model, since the card is identical to the one in the linked article the same issues are very likely to exist.\n\nIf you wish to replace this Wi-Fi/Bluetooth module, it is located underneath the NVMe drive.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "It works fine, gestures have not been tested, pressure-based touch detection (used for a form of palm-detect) is not working in libinput, palm detect is nevertheless working.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Detected | Labeled | Effect\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86KbdBrightnessDown\nFn+F3 | Yes | Yes | XF86KbdBrightnessUp\nFn+F4 | Yes | Yes | XF86Launch3 (AURA)\nFn+F5 | Yes | Yes | XF86Launch4 (Fan Symbol)\nFn+F6 | Yes | Yes | SHIFT_R + SUPER_R + S (Cut)\nFn+F7 | Yes | Yes | XF86MonBrightnessDown\nFn+F7 | Yes | Yes | XF86MonBrightnessUp\nFn+F9 | Yes | Yes | Super_R + P (Screen switch)\nFn+F10 | Yes | Yes | XF86TouchpadToggle\nFn+F11 | Yes | Yes | XF86Sleep\nFn+F12 | Yes | Yes | XF86RFKill (Airplane Mode)\nFn+Delete | Yes | Yes | Insert\nFn+Pause | Yes | Yes | Control_R + c\nFn+Print Screen | Yes | Yes | NoSymbol (Keycode: 248)\nFn+Home | Yes | Yes | End\nFn+KP_Enter | Yes | Yes | XF86Calculator\nFn+Control_R | Yes | Yes | Menu\nFn+Up | Yes | Yes | Prior(Page Up)\nFn+Down | Yes | Yes | Next(Page Down)\nFn+Left | Yes | Yes | Home\nFn+Right | Yes | Yes | End\nFn+Super_L | Hardware | Yes | Lock/Unlock Super_L\nFn+c | No | No | Fn-Lock\nFn+v | No | No | Cycles display color modes if on Windows\n\n"
    },
    {
      "title": "M keys",
      "level": 3,
      "content": "The M1-M5 keys are mostly functional.\n\nM3/Microphone toggle is not detected out of the box.\n\nAlso M4 and Fn+F5 have exactly the same label and effect; this is a weird design choice by ASUS, but if you go into Windows you can alter the M keys effects in the ASUS Armoury Crate/G-Helper software. These changes will carry over to Linux.\n\nFor instance you can rebind M4 key to be play/pause in Armoury Crate/G-Helper and next time you boot into Linux the key will read as XF86AudioPlay instead of the default XF86Launch4.\n\n"
    },
    {
      "title": "Toggle Microphone (M3) Key Solution",
      "level": 4,
      "content": "Create the below file:\n\n```\n/etc/udev/hwdb.d/90-nkey.hwdb\n```\n\n```\nevdev:input:b0003v0B05p19B6*\n  KEYBOARD_KEY_ff31007c=f20 # x11 mic-mute\n```\n\nThen update hwdb\n\n```\n# systemd-hwdb update\n# udevadm trigger\n```\n\nNow the key should properly be detected as XF86AudioMicMute\n\n"
    },
    {
      "title": "RGB Backlighting",
      "level": 3,
      "content": "#ASUS Linux provides the ability to control the RGB backlighting; it is however unfortunately quite limited compared to the AURA/Armoury Crate utility available on Windows.\n\n"
    },
    {
      "title": "S, Z and/or X keys not working",
      "level": 4,
      "content": "This is more of a warning about these laptops than something specifically linux related.\n\nA common issue with ASUS laptops for years believed to be a planned obsolescence scheme by many users is for some or all of these particular keys to stop working normally. The G713RW is confirmed to be affected by this.\n\nYou may be able to still press these keys when they are acting up by simultaneously pressing another key (such as Shift or Fn).\n\nThe only known reliable fix for this issue is replacing the keyboard, which is both an expensive and non-trivial (as in not a diy job for any but the most hardened laptop repairmen).\n\n"
    }
  ]
}