{
  "title": "ASUS ROG GA401I",
  "url": "https://wiki.archlinux.org/title/ASUS_ROG_GA401I",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThis page contains instructions and tips for configuring Arch Linux on the ASUS Zephyrus G14 and ASUS ROG Studio Pro 14 (GA401I).\n\n"
    },
    {
      "title": "ASUS Linux",
      "level": 2,
      "content": "The ASUS Linux stack provides users of this laptop with a great many ASUS specific functions, to name a few:\n\n- Battery Charge Limit,\n- Multiplexer (GPU) Controls,\n- Panel Overdrive,\n- Much more.\n\nIt is highly recommended to install these tools for the optimal experience on these laptops.\n\n"
    },
    {
      "title": "High battery usage/low runtime on battery",
      "level": 2,
      "content": "The G14 can be tweaked to have far better battery live and performance on windows [1]. A few optimizations can be taken to reach a similar battery live on Arch (you can monitor your current power usage using powertop - note that only the reported battery discharge seems to be fully accurate).\n\n"
    },
    {
      "title": "NVIDIA driver optimization",
      "level": 3,
      "content": "When using the official NVIDIA driver, the power usage can be reduced by putting the following line in /etc/modprobe.d/nvidia.conf:\n\n```\noptions nvidia \"NVreg_DynamicPowerManagement=0x02\"\n```\n\nThis has also shown to reduce fan noise and overall heat.\n\n"
    },
    {
      "title": "Disabling turbo boost",
      "level": 3,
      "content": "While not necessarily saving power, some user prefer to disable turbo boost for smoother power delivery and less heat. To temporarily disable boost, execute the following:\n\n```\n# echo 0 > /sys/devices/system/cpu/cpufreq/boost\n```\n\nOr use the power profiles from asusctl to handle this automatically.\n\n"
    },
    {
      "title": "General Tips",
      "level": 3,
      "content": "To maximize the battery life, follow the general tips at power management.\n\n"
    },
    {
      "title": "Using external display through the USB-C port",
      "level": 3,
      "content": "While the dedicated HDMI port works out of the box, the display output through the USB-C port does not appear to be connected to the integrated graphics controller. Using an external display through this port requires to switch to the dedicated NVIDIA graphics card. See asusctl for more details.\n\n"
    },
    {
      "title": "Volume adjustment",
      "level": 3,
      "content": "When using built-in speakers, volume adjustment will not work for PulseAudio. Download this patch and apply it:\n\n```\n# patch -p1 -d /usr/share/alsa-card-profile/mixer/paths/ -i /path/to/patch\n```\n\nThen restart the pulseaudio.service user unit.\n\n"
    },
    {
      "title": "Pacman hook",
      "level": 4,
      "content": "To apply the patch automatically after a pulseaudio upgrade, you can use a pacman hook:\n\n```\n/etc/pacman.d/hooks/pulseaudio-volume-adj.hook\n```\n\n```\n[Trigger]\nType = Path\nOperation = Install\nOperation = Upgrade\nTarget = usr/share/alsa-card-profile/mixer/paths/analog-output-speaker.conf\n\n[Action]\nDescription = Fixing PulseAudio volume adjustment...\nWhen = PostTransaction\nExec = /usr/bin/patch -p1 -d /usr/share/alsa-card-profile/mixer/paths/ -i /path/to/patch\n```\n\n"
    }
  ]
}