{
  "title": "AWK",
  "url": "https://wiki.archlinux.org/title/AWK",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "AWK is a small programming language designed for text processing. Its name is derived from the surnames of its authors: Alfred Aho, Peter Weinberger, and Brian Kernighan. The language is standardized and widely available on Unix-like systems.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "On Arch, the awk(1p) command is provided by gawk, which is installed by default, with native Unicode support and a load of extrafeatures.\n\n"
    },
    {
      "title": "Alternative implementations",
      "level": 3,
      "content": "Like many other core utilities, there are several more-or-less compliant implementations available:\n\n- BusyBox — The BusyBox implementation is not that well performant but has a smaller footprint suitable for memory strained environment.\n\n- GoAWK — AWK implementation in Go language.\n\n- nawk — The \"new\" AWK as described in The AWK Programming Language, a.k.a. BWK AWK or the One-True-AWK, is now co-maintained by Arnold Robbins and B. W. Kernighan, featuring UTF-8 and csv support.\n\n- mawk — A rather performant AWK implementation.\n\n"
    },
    {
      "title": "Assignment to ARGC variable via -v option does not preserve in runtime",
      "level": 3,
      "content": "Although undocumented, it appears that many implementations will reset the ARGC variable internally after processing the variable assignment of -v options specified on command line. Therefore, to get desired value of ARGC variable in runtime (e.g. BEGIN code blocks), it's required to set the variable in code block directly:\n\n```\nBEGIN {\n  ARGC=1;\n  ...\n}\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- nawk(1): a refcard-style man page of nawk\n- The GNU AWK manual: both a comprehensive tutorial and a canonical reference text on gawk(1)\n- Alpine Linux's community wiki article on AWK: has some notes on implementation difference between BusyBox and other AWKs\n- AWK tech notes: language gotchas and design difference compared to other modern programming languages\n- Idiomatic AWK: how concise an AWK program could be\n\n"
    }
  ]
}