{
  "title": "Borgmatic",
  "url": "https://wiki.archlinux.org/title/Borgmatic",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "borgmatic is a Python-based wrapper script for Borg backup, designed to simplify and automate backups. It aims to provide an easy-to-use and flexible solution for creating backups using borgbackup.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the borgmatic package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "By default no configuration file is installed. To create one you can use the command borgmatic config generate to generate one:\n\n```\n# borgmatic config generate\n```\n\n```\nGenerating a configuration file at: /etc/borgmatic/config.yaml\n \nThis includes all available configuration options with example values, the few\nrequired options as indicated. Please edit the file to suit your needs. \n \nIf you ever need help: https://torsion.org/borgmatic/#issues\n \nsummary:\nGenerate successful\n```\n\nThe configuration file for borgmatic is located at one of the following\n\n- /etc/borgmatic/config.yaml (or drop-ins in /etc/borgmatic.d)\n- ~/.config/borgmatic/config.yaml (or drop-ins in ~/.config/borgmatic.d)\n\nThe configuration file allows you to define backup repositories, backup sources, retention policies, and other parameters.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Once you have configured borgmatic to your liking, you can run it using the following command:\n\n```\n# borgmatic --verbosity 2\n```\n\nThis will start the backup process using the settings specified in your configuration file. borgmatic provides various options and flags that you can use to customize your backup behavior.\n\nBorgmatic also provides systemd system and user units and timers.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- How to snapshot your filesystems\n\n"
    }
  ]
}