{
  "title": "Citrix",
  "url": "https://wiki.archlinux.org/title/Citrix",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nCitrix Workspace App (previously known as Citrix Receiver and ICA Client) is the client component of XenDesktop (desktop virtualization software) and XenApp (application virtualization software), developed by Citrix Systems.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the icaclientAUR package. It includes the wfica.desktop file, so Arch knows how to open ica files.\n\n"
    },
    {
      "title": "Chromium/Google Chrome",
      "level": 3,
      "content": "If you have problems launching Citrix applications with Chromium, just go to chrome://extensions and disable \"Citrix Receiver for Linux\".\n\n"
    },
    {
      "title": "wfica.desktop",
      "level": 3,
      "content": "Create /usr/share/applications/wfica.desktop (Exec path may vary based on package installed):\n\n```\n[Desktop Entry]\nName=Citrix ICA client\nComment=\"Launch Citrix applications from .ica files\"\nCategories=Network;\nExec=/opt/Citrix/ICAClient/wfica\nTerminal=false\nType=Application\nNoDisplay=true\nMimeType=application/x-ica;\n```\n\nNow xdg-open will handle .ica extensions using /opt/Citrix/ICAClient/wfica.\n\n"
    },
    {
      "title": "TLS/SSL Certificates",
      "level": 2,
      "content": "Because ICAClient uses SSL you may need a security certificate to connect to the server, check with the server administrator. If there is a certificate download and place it in /usr/lib/ICAClient/keystore/cacerts/.\n\nYou may then receive the error You have not chosen to trust the issuer of the server's security certificate. (SSL Error 61).\n\nThere may be several reasons for this:\n\n```\n# cd /opt/Citrix/ICAClient/keystore/cacerts/\n# cp /etc/ca-certificates/extracted/tls-ca-bundle.pem .\n# awk 'BEGIN {c=0;} /BEGIN CERT/{c++} { print > \"cert.\" c \".pem\"}' < tls-ca-bundle.pem\n```\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\n```\n# c_rehash /opt/Citrix/ICAClient/keystore/cacerts/\n```\n\nInstead of using c_rehash which no longer works the openssl rehash command can be used instead.\n\n```\n# openssl rehash /opt/Citrix/ICAClient/keystore/cacerts/\n```\n\n"
    },
    {
      "title": "Pulse Audio",
      "level": 3,
      "content": "Citrix Receiver uses ALSA. If you use Pulse Audio, install pulseaudio-alsa.\n\nTo get audio input into Citrix Receiver, in ~/.ICAClient/wfclient.ini, add AllowAudioInput=True anywhere in the [WFClient] section.\n\nAs of client 2012 - December 2020 Citrix has introduced additional audio redirection: https://docs.citrix.com/en-us/citrix-workspace-app-for-linux/configure-xenapp.html#audio . If your audio device is no longer detected within the Citrix Workspace App, you may need to disable this new functionality following the instructions provided.\n\n"
    },
    {
      "title": "PipeWire",
      "level": 3,
      "content": "PipeWire—although not officially supported—interacts with Citrix much in the same way PulseAudio does. Install pipewire-alsa to allow Citrix to redirect audio and make sure you have AllowAudioInput=True in your ~/.ICAClient/wfclient.ini like described above.\n\nCitrix also checks for the /usr/bin/pulseaudio binary to be present on the system and aborts audio redirection otherwise. For this reason you also need to create a dummy executable with the following content[2]:\n\n```\n/usr/bin/pulseaudio\n```\n\n```\n#!/bin/sh\nif [ \"$1\" == \"--version\" ]; then\n    pactl info | grep Server\\ Name | sed -e \"s/Server Name: //\"\nelse\n    echo \"This is a dummy file for apps that check if PulseAudio is available by checking for the binary existing\"\nfi\n```\n\nMake it executable.\n\n"
    },
    {
      "title": "Endpoint Analysis (EPA)",
      "level": 2,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nIf your company has activated the optional endpoint analysis to check if your computer meets certain requirements, you will have to install another component, the EPA-Plugin. It seems like it was a browser plugin using the legacy NPAPI, but now it is just an application the browser calls with a protocol handler for \"nsgcepa://\". Here is what you have to do to get it running:\n\n- Step 1. Download the EPA plugin from your company's Citrix gateway. Opening the URL of your company's Citrix gateway will try to start the endoint check immediately, which (of course) fails, because you have not installed the EPA plugin, yet. Under the error message you will see a button for downloading nsepa.deb. Download it.\n\n- Step 2. Transform the Debian package into an Arch package with debtap. You might need to install debtapAUR first. # debtap nsepa.deb Call the package \"nsepa\" and use the suggested version. Install it like so: # pacman -U nsepa-1.0.0.35-1-x86_64.pkg.tar.xz\n\n```\n# debtap nsepa.deb\n```\n\n```\n# pacman -U nsepa-1.0.0.35-1-x86_64.pkg.tar.xz\n```\n\nRecent versions of the EPA are linked to libcurl-gnutls and you are done now. Unfortunately your company might use and old version that has the following problem:\n\n```\n$ ldd /opt/Citrix/Browser-EPA/nsgcepa\n/opt/Citrix/Browser-EPA/nsgcepa: /usr/lib/libcurl.so.4: version `CURL_OPENSSL_3' not found (required by /opt/Citrix/Browser-EPA/nsgcepa)\n\tlinux-vdso.so.1 (0x00007fff33f4f000)\n\tlibX11.so.6 => /usr/lib/libX11.so.6 (0x00007fe4401d9000)\n        [...]\n```\n\nAs you can see, the nsgcepa executable (which is the main executable of nsepa) has been linked to a libcurl.so.4 that contains the \"CURL_OPENSSL_3\" symbol. I think this is a patched version from Ubuntu and I could not find an Arch package providing it, not even libcurl-compat. Unfortunately you have to find an appropriate lib for yourself. I found one in the Steam runtime under ~/.local/share/Steam/ubuntu12_32/steam-runtime/usr/lib/x86_64-linux-gnu.\n\n- Troubleshooting-Step 1. Create a directory for patched library files and copy libcurl.so.4 into it. Also copy dependencies.\n\n```\n# mkdir /opt/Citrix/lib\n$ cd ~/.local/share/Steam/ubuntu12_32/steam-runtime/usr/lib/x86_64-linux-gnu\n# cp libcurl.so.4 /opt/Citrix/lib\n# cp libhogweed.so.4 libnettle.so.6 librtmp.so.0 libidn.so.11 /opt/Citrix/lib\n```\n\n- Troubleshooting-Step 2. In order to use these libs instead of your system's libs, we have to fiddle with the way nsgcepa is being called. There is a .desktop file provided in the nsepa package for that: /opt/Citrix/Browser-EPA/nsgcepa.desktop. Change the Exec line to: Exec=env LD_LIBRARY_PATH=/opt/Citrix/lib LD_PRELOAD=/opt/Citrix/lib/libcurl.so.4 /opt/Citrix/Browser-EPA/nsgcepa\n\n```\nExec=env LD_LIBRARY_PATH=/opt/Citrix/lib LD_PRELOAD=/opt/Citrix/lib/libcurl.so.4 /opt/Citrix/Browser-EPA/nsgcepa\n```\n\n- Troubleshooting-Step 3. The .desktop file had already been copied to where the system expects it to be: /usr/share/applications/. Overwrite it with your new one. $ cp /opt/Citrix/Browser-EPA/nsgcepa.desktop /usr/share/applications/\n\n```\n$ cp /opt/Citrix/Browser-EPA/nsgcepa.desktop /usr/share/applications/\n```\n\nNow go to you company's Citrix URL again. The EPA should run. If it does not, you should check if the protocol handler for \"nsgcepa://\" works:\n\n```\n$ xdg-open nsgcepa://something.com\n```\n\nIf it answers \"gio: nsgcepa://something.com: The specified location is not supported\" or \"klauncher said: Unknown protocol 'nsgcepa'\" you need to add the protocol handler manually:\n\n```\n$ xdg-mime default nsgcepa.desktop x-scheme-handler/nsgcepa\n```\n\nIf the EPA still fails you should ask your company's Citrix Netscaler admins if they have disabled Linux logins completely. It seems like there is no corresponding error message for that case, instead the error message is the same as if you do not have installed the EPA plugin at all.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "- If you have issues opening a Citrix connection under Firefox you may need to set the Citrix Receiver plugin to 'Always Activate' under the Firefox Add-ons Manager plugin settings.\n\n- perl-file-mimeinfo may be required to correctly interpret the .ica file mimeinfo and open it as per the setup in wfica.desktop\n\n- If you have cursor alignment issues under Citrix and you have multiple displays connected to your machine you may need to disable all but one when using Citrix.\n\n- If you have sticky Control Ctrl key issues after logging to session you may resolve it using this guide\n\n- On i3, Citrix might go full screen and grab all keyboard input. A workaround is to disable full screen mode. See https://bbs.archlinux.org/viewtopic.php?id=242398. Tip: In case the keyboard in Sway is not working properly, setting TWIMode=* might help.\n\n```\n~/.ICAClient/All_Regions.ini\n```\n\n```\n[Virtual Channels\\Seamless Windows]\nTWIMode=0\n\n[Virtual Channels\\Thinwire Graphics]\nDesiredColor=8\nApproximateColors=*\nDesiredHRES=1024\nDesiredVRES=768\nScreenPercent=*\nUseFullScreen=false\nTWIFullScreenMode=false\nNoWindowManager=false\n```\n\n- If Alt+Tab does not work in a remote Citrix session on GNOME Wayland, these two settings will enable key passthrough.\n\n```\n$ gsettings set org.gnome.mutter.wayland xwayland-grab-access-rules \"['Wfica']\"\n$ gsettings set org.gnome.mutter.wayland xwayland-allow-grabs true\n```\n\n- If ICAClient is flooding the journal with error messages, a simple fix is to disable all logging in Citrix Workspace Preferences.\n\n- If your timezone inside the VDI is reset to UTC when starting session from Firefox, you might need to go to about:config and set privacy.resistFingerprinting=false. This feature spoofs the browser's timezone to UTC which is then redirected to the Citrix session.\n\nNote: at the time of writing the privacy.resistFingerprinting.exemptedDomains setting cannot be used to exclude your company's self-service portal because it's still under testing and not fully working. This might not be the case in the future anymore.\n\n"
    },
    {
      "title": "Microsoft Teams audio redirection troubleshooting",
      "level": 3,
      "content": "- If audio devices are detected by Windows inside the VDI but not by MS Teams, check whether the HdxRtcEngine process is running on your client machine:\n\n```\n$ ps -ef | grep HdxRtcEngine\n```\n\nIf not, the process might have crashed. Look for any libraries that are not installed or loaded from the wrong path:\n\n```\n$ ldd /opt/Citrix/ICAClient/util/HdxRtcEngine\n```\n\nIn most cases you might be missing some of them. In particular libunwind might be installed in a different path from the one Citrix is trying to load it from. In such case execute the following to fix that:\n\n```\n# ln -s /usr/lib/libunwind.so /usr/lib/libunwind.so.1\n```\n\nAnother thing that might be crashing the HdxRtcEngine process is an incompatible version (at the time of writing) of gpsd. Downgrading to version 3.18-2 from the Arch Linux Archive may fix the issue:\n\n```\n# pacman -U https://archive.org/download/archlinux_pkg_gpsd/gpsd-3.18-2-x86_64.pkg.tar.xz\n```\n\nNote: you don't actually need to start the gpsd service, but only have a compatible libgps installed.\n\n- When starting sessions from Firefox, calls are interrupting after a few minutes or audio is dropping, it might be related to resource limits set by Firefox and inherited by the Citrix processes. You can check that by running $ prlimit --rttime --pid=$(pgrep HdxRtcEngine) while a session is running. If the soft or hard limits show anything different than unlimited (default on most systems) you might have to run # prlimit --rttime=unlimited --pid=$(pgrep HdxRtcEngine) to fix that. Note that limits are reset when you close and reopen a session so you'll have to set them every time.\n\nAlternatively you can just start your session from chromium or other Chromium based browsers.\n\n"
    }
  ]
}