{
  "title": "DekTec TV cards",
  "url": "https://wiki.archlinux.org/title/DekTec_TV_cards",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "DekTec is a manufacturer of PC add-on cards, USB devices, IP converters and software for the professional digital-television market. Products are used for test and measurement, to build broadcast infrastructure or as OEM component integrated in your PC-based product.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dektec-drivers-dkmsAUR dkms drivers for full support of all DekTec PC add-on cards.\n\nMake sure to reboot the PC to load the newly installed dkms drivers.\n\n"
    },
    {
      "title": "Check if drivers are installed and detected",
      "level": 3,
      "content": "To check if dkms drivers are installed, type:\n\n```\n$ dkms status\n```\n\nTo check if DekTec PCI/PCIe add-on card is detected, type:\n\n```\n$ lspci -k | grep DekTec\n```\n\nTo check if DekTec USB add-on card is detected (requires usbutils), type:\n\n```\n$ lsusb -t | grep DekTec\n```\n\nIf tsduckAUR is installed, it is possible to list all type of DekTec add-on cards with:\n\n```\n$ tsdektec -a\n```\n\n"
    },
    {
      "title": "Demodulator boards DtapiService daemon",
      "level": 3,
      "content": "The DtapiService is a Linux daemon that manages DekTec's range of demodulator boards. The following demodulators are supported:\n\nInstall the dektec-dtapiservice-binAUR and start/enable DtapiServiced.service.\n\n- This service must be running to be able to use the above boards.\n- For the DtapiService to properly work the Dta driver must be running.\n\n"
    },
    {
      "title": "Example usage",
      "level": 2,
      "content": "All mainstream DekTec Applications require a license and is exclusively developed for use on Microsoft Windows. A license can be purchased from DekTec or one of its distributors. There are also free utilities, such as DtInfoCL which can be installed with dektec-utilitiesAUR.\n\n"
    },
    {
      "title": "Linux SDK solution",
      "level": 3,
      "content": "Linux SDK – SDK for DTA, DTU and DTE products provides developers with a driver and an API for using DekTec's DVB/MPEG-2 PCI/PCIe and USB-2 devices in applications running under Linux. All drivers are free to use except for DTAPITS and DtapiService.bin (self-extracting binary installer for DtapiService) which requires a license.\n\n"
    },
    {
      "title": "SDK Examples",
      "level": 3,
      "content": "Install the dektec-avfifo-examplesAUR package.\n\nAvFifo code examples for Linux, demonstrating the usage of the AvFifo API for receiving and transmitting SMPTE 2110 streams.\n\n"
    },
    {
      "title": "External toolkits",
      "level": 3,
      "content": "Using TSDuck the MPEG Transport Stream Toolkit. TSDuck can be installed with tsduckAUR or tsduck-binAUR. It is an extensible toolkit for MPEG transport streams and can be used in digital television systems for test, monitoring, integration, debug, lab, demo. With this tool, the development possibilities are essentially endless.\n\n"
    },
    {
      "title": "FFmpeg Integration",
      "level": 2,
      "content": "Install the ffmpeg-dektecAUR package.\n\nUnlock the power of FFmpeg for real-time streaming of SDI or SMPTE 2110 via DekTec devices. DekTec device support to the ffmpeg-dektec and ffplay-dektec command-line utilities, the FFmpeg libraries for custom application development and the new .sdi file format for storage of raw SDI streams has been introduced since September 2023.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- DekTec homepage\n- DekTec Software Development Kits (SDKs)\n- FFmpeg Integration for DekTec Devices\n- TSDuck homepage\n- TSDuck GitHub page\n\n"
    }
  ]
}