{
  "title": "Dell XPS 17 (9710)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_17_(9710)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nBluetooth |  | Yes\nWebcam |  | Yes\nWi-Fi | 8086:43f0 | Yes\nGPU (Intel) | 8086:9a60 | Yes\nGPU (NVIDIA) | 10de:2520 | Yes\nTouchpad |  | Partial\nKeyboard |  | Yes\nFingerprint reader |  | Yes\nSD-card reader |  | Yes\nSpeakers |  | Yes\nMicrophone |  | Yes\nInfrared camera |  | Partial\nAmbient light sensor |  | Untested\nFan-control |  | Partial\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Before installing it is necessary to modify some UEFI Settings. They can be accessed by pressing the F12 key repeatedly when booting.\n\n- Change the SATA Mode from the default \"RAID\" to \"AHCI\". This will allow Linux to detect the NVMe SSD.\n- Disable Secure Boot to allow Linux to boot. This may be re-enabled at a later point. See Secure Boot#Using a signed boot loader\n\n"
    },
    {
      "title": "Dual boot",
      "level": 3,
      "content": "Please note that changing from \"RAID\" to \"AHCI\" can break the default Windows installation and require a complete reinstall. Usually running windows own startup repair utility however fixes this issue in most cases. Another alternative is to follow this guide.\n\nThe reinstall can be done through the Dell recovery in the BIOS if needed.\n\nOnce you used the startup repair utility or have reinstalled, Windows should boot normally in AHCI mode and without error. Then one can proceed with typical dual boot setup.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The appearance of the BIOS is simple, being mostly made up of a plain white background and clear, black text. It might work with OCR software. The graphical BIOS setup program can be navigated with the keyboard (see Entering BIOS setup program).\n\n"
    },
    {
      "title": "GPU",
      "level": 2,
      "content": "The GPU does not work properly with bbswitch, make sure to uninstall it and install only primus and bumblebee to start GPU driven applications with optirun or primusrun.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "fwupd supports this device.\n\n"
    },
    {
      "title": "Thunderbolt",
      "level": 2,
      "content": "The following thunderbolt devices have been tested:\n\nTable content:\nDevice | Working? | Comments\nDell WD19TBS 180W | Yes | –\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "Some users find the touchpad are sluggish or sticky occasionally. There is a tracking bug https://gitlab.freedesktop.org/libinput/libinput/-/issues/618 but it is not root-caused yet.\n\n"
    },
    {
      "title": "Wireless",
      "level": 2,
      "content": "The wireless card seems to be rather weak compared to other laptops, users noticed that using the laptop while the lid is closed impacts the Wi-Fi signal (5GHz) negatively by about 36%.\n\n"
    },
    {
      "title": "Fan control",
      "level": 2,
      "content": "The dell-smm-hwmon currently does not work, since it does not have any access to the fans and cannot read or write to them. The bios has to regulate and take care. However fans are very silent usually.\n\n"
    },
    {
      "title": "BIOS Thermal Modes / Fan profiles",
      "level": 3,
      "content": "Currently the only choice are the BIOS controlled fans, which means you have to control the bios thermal parameters. This is done within a terminal with the libsmbios package, or alternatively via plasma5-applets-plasma-pstateAUR[broken link: package not found]:\n\nTo find out what thermal mode is set type:\n\n```\n# smbios-thermal-ctl -g\n```\n\nTo find all available thermal modes type:\n\n```\n# smbios-thermal-ctl -i\n```\n\nAnd finally to set the desired thermal mode that you identified with the command before type:\n\n```\n# smbios-thermal-ctl --set-thermal-mode=THERMAL_MODE\n```\n\n- \"Quiet\" and \"Cool Bottom\" profiles limit CPU power and thus reduces overall system performance.\n- \"Balanced\" and \"Performance\" profiles remove this limit.\n\n"
    },
    {
      "title": "Performance throttling",
      "level": 2,
      "content": "There is a problem with performance throttling currently. Which can be fixed by executing the following:\n\n```\n# rmmod intel_rapl_msr \n# rmmod processor_thermal_device_pci_legacy\n# rmmod processor_thermal_device \n# rmmod processor_thermal_rapl \n# rmmod intel_rapl_common \n# rmmod intel_powerclamp\n# modprobe intel_powerclamp\n# modprobe intel_rapl_common \n# modprobe processor_thermal_rapl \n# modprobe processor_thermal_device\n# modprobe intel_rapl_msr\n```\n\nThe underlying issue is yet unknown and has to be tracked down.\n\n"
    },
    {
      "title": "Hardware acceleration",
      "level": 2,
      "content": "The dell ships with Gen12 Intel CPUs. Those only work with intel-media-driver. Firefox tabs will crash currently, which is related to the following bug.\n\nThere is no real fix but to disable the sandbox, which can be done via about:config by setting security.sandbox.content.level to 0. This however is an impact security wise, so the recommendation is to wait for the bug to be fixed and disable the hardware acceleration instead.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- External Display Connection Guide\n- Setup and Specifications\n- Entering BIOS setup program\n\n"
    }
  ]
}