{
  "title": "Dell XPS 15 (9550)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_15_(9550)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWireless |  | Yes\nBluetooth |  | Yes\nAudio |  | Yes\nTouchpad |  | Yes\nWebcam |  | Yes\nCard Reader |  | Yes\n\nThis page covers the current status of hardware support on Arch, pre-installation system configuration tweaks, as well as post-installation recommendations to improve the usability of the system.\n\nThe installation process for Arch on the XPS 15 9550 does not differ from any other PC. For installation help please see the Installation guide and UEFI. To set up a dual boot configuration with Windows, refer to Dual boot with Windows.\n\nAs of kernel 4.3, the Intel Skylake architecture is supported.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Prior to installation, access the system UEFI firmware by pressing F2 during boot.\n\n- Turn off legacy ROM\n- System -> SATA: change to AHCI\n- Disable Secure Boot\n- Set the POST Behavior: Fastboot to Thorough\n\nSource\n\nProceed to the Installation guide.\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "The Dell XPS 15 9550 has Intel HD Graphics 530 integrated graphics, and some models have a Nvidia GeForce GTX 960 dedicated card as well in a hybrid configuration.\n\nFor computers with only integrated graphics, just install the xf86-video-intel driver.\n\nIf your XPS has a hybrid graphics configuration (GTX960M + HD Graphics 530) and you want to maximize battery life you can just use the Intel Graphics.\n\n"
    },
    {
      "title": "Intel Only",
      "level": 3,
      "content": "If your model comes with an nVidia card which you do not use then you can try to disable it with an ACPI command. Depending on the model, this can have a small to profound effect on the laptop's temperature and battery life (it can more than double battery life!)\n\n- Install the Intel video driver using the xf86-video-intel package.\n- Blacklist the nvidia & nouveau modules Kernel modules#Blacklisting\n- Power down the GPU with an ACPI command\n\n"
    },
    {
      "title": "Optimus Configuration (Hybrid Intel and Nvidia)",
      "level": 3,
      "content": "The Optimus setup consists of the integrated Intel chip connected to the laptop screen and the Nvidia card runs through this. As such, the Nvidia chip cannot be used without the Intel chip (some other laptops have the option in BIOS to turn Intel off and use just Nvidia, but not this laptop). See the Bumblebee page set of instructions, particularly the Bumblebee#Installation Intel/Nvidia section. The main thing to note is that installing both the Intel and Nvidia packages at once tends to avoid dependency issues. The correct driver for the Nvidia card is nvidia.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "By default the touchpad does not respond to tap input or two finger scrolling. You can change the behavior by installing Libinput and adding 30-touchpad.conf to /etc/X11/xorg.conf.d:\n\n```\n/etc/X11/xorg.conf.d/30-touchpad.conf\n```\n\n```\nSection \"InputClass\"\n    Identifier \"MyTouchPad\"\n    MatchIsTouchpad \"on\"\n    Driver \"libinput\"\n    Option \"Tapping\" \"on\"\n    Option \"Natural Scrolling\" \"on\"\nEndSection\n```\n\nSource\n\n"
    },
    {
      "title": "Gestures",
      "level": 3,
      "content": "You can configure custom gestures using the libinput-gesturesAUR package. You can follow the instructions from the documentation. Below is a sample configuration file that one might use with this tool:\n\n```\n~/.config/libinput-gestures.conf\n```\n\n```\n# Go back/forward in chrome\ngesture: swipe right 3 xdotool key Alt+Left\ngesture: swipe left 3 xdotool key Alt+Right\n\n# Zoom in / Zoom out\ngesture: pinch out xdotool key Ctrl+plus\ngesture: pinch in xdotool key Ctrl+minus\n  \n# Switch between desktops\ngesture: swipe left 4 xdotool set_desktop --relative 1\ngesture: swipe right 4 xdotool set_desktop --relative -- -1\n```\n\n"
    },
    {
      "title": "Suspend & Hibernate",
      "level": 3,
      "content": "Suspend works without issues, however Hibernation is not completely stable. Write the following to /etc/systemd/sleep.conf:\n\n```\n/etc/systemd/sleep.conf\n```\n\n```\n[Sleep]\nHibernateState=disk\nHibernateMode=shutdown\n```\n\n"
    },
    {
      "title": "Battery",
      "level": 3,
      "content": "Battery life can be improved by installing powertop and calibrating it. See Powertop for more info. To further improve the battery life, you can disable the touchscreen in the BIOS.\n\n"
    },
    {
      "title": "Fans",
      "level": 3,
      "content": "The fans may remain on even at low temperatures, draining the battery and producing an unpleasant noise that will only stop on reboot. This is due to the fans being controlled by the BIOS by default.\n\nTo prevent this behavior, configure i8k as described in Fan speed control#Dell laptops and use dell-bios-fan-control-gitAUR utility to disable BIOS control of fans which conflicts with i8k. You may also want to enable and start dell-bios-fan-control.service to ensure BIOS control of fans is disabled at boot.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "Bluetooth is disabled by default. If you wish to use Bluetooth you will need to install some firmware. See Bluetooth and bug report for details.\n\nbcm20703a1-firmwareAUR includes includes the firmware necessary for the Broadcom BCM20703A1 Bluetooth device.\n\nThis firmware has been added upstream to linux-firmware [1], so bcm20703a1-firmwareAUR is no longer needed as of release 20200421.78c0348-1\n\nIf you are experiencing low signal or disconnecting issues specifically with a2dp devices, using this alternative firmware can fix it: broadcom-bt-firmware-gitAUR maybe you still need to play with latency/buffer settings on PulseAudio or try using PipeWire\n\n"
    },
    {
      "title": "Thunderbolt 3 Docks",
      "level": 2,
      "content": "It is possible to get video, audio, Ethernet and USB devices working by updating your BIOS to version >=1.2.19 and disabling Thunderbolt security in your bios settings. If you do not disable Thunderbolt security, then only video and power will work (at lest on the Dell TB16 dock).\n\nOn bios version 1.4.0 the USB and Ethernet peripherals will not work unless Thunderbolt security and Thunderbolt Boot support options are disabled.\n\nUsing bolt allows to use all features of the dock with Thunderbolt security activated.\n\nIt should also be noted that the TB16 dock will crash when hot plugged on all BIOS versions after 1.2.18 (Still the case as of version 1.4.0, but no longer as of version 1.8.1).\n\n"
    },
    {
      "title": "USB-C / Thunderbolt 3 Compatibility Chart",
      "level": 2,
      "content": "Table content:\nDevice | Ports | Working?\nStarTech TBT3TBTADAP Thunderbolt 3 to Thunderbolt Adapter | Thunderbolt 2, Thunderbolt | Yes\nApple Thunderbolt 3 (USB-C) to Thunderbolt 2 Adapter | Thunderbolt 2, Thunderbolt | No\nCHOETECH USB-C to DisplayPort Cable (4K@60Hz) | DisplayPort | Yes\nCableCreation USB-C to HDMI DVI DP | HDMI, DVI, DisplayPort | Yes\n\nThis chart may also be helpful.\n\n"
    },
    {
      "title": "BIOS/firmware Updates",
      "level": 2,
      "content": "You can update your BIOS either manually, or with fwupdmgr (recommended). Recent BIOSes fix the screen flickering issue previously worked around with the i915.edp_vswing=2 kernel parameter.\n\n"
    }
  ]
}