{
  "title": "Dell Precision 5570",
  "url": "https://wiki.archlinux.org/title/Dell_Precision_5570",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU (Intel) | 8086:46a6 | Yes\nGPU (NVIDIA) |  | Yes\nWebcam | 0c45:6d1f | Yes\nBluetooth |  | Yes\nSD Card reader |  | Yes\nAudio | 8086:51c8 | Yes\nWireless | 8086:51f0 | Yes\nFingerprint reader | 27c6:63ac | Yes\nTPM |  | Untested\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "You can enter the bios menu with F2, disable Secure Boot or you will not be able to boot the Arch Linux image.\n\nYou can enter the bios one-time boot menu with F12.\n\nWith both disk inserted, boot to any of them individually with the firmware storage mode set to RAID (default setting) remains possible. One may consider setting the mode to AHCI.\n\nSee the following forum post for more information on storage modes.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The appearance of the UEFI is pretty simple and not very colorful, so it might work well with OCR software. However, it requires the user to use a mouse.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "fwupd is supported on this device and it is advised to upgrade the firmware version before configure it as new options will likely be added. If using two disk with an EFI system partition on both, fwupd will need your help to figure out your current EFI system partition.\n\n"
    },
    {
      "title": "Secure Boot",
      "level": 3,
      "content": "The UEFI accepts .auth files.\n\n"
    },
    {
      "title": "Firmware data path",
      "level": 3,
      "content": "The UEFI stores logs, telemetry and recovery images in ESP/EFI/Dell. Recovery images are stored in ESP/EFI/Dell/bios/recovery. It appears that there will only be two images at the same time, BIOS_CUR.rcv and BIOS_PRE.rcv. Those files will be created when the UEFI was updated. The firmware also expose some telemetry (metrics) that you could use in ESP/EFI/Dell/BiosTelemetry. It seems to have file for previous boots, formatted in json.\n\n"
    },
    {
      "title": "Logs",
      "level": 4,
      "content": "ESP/EFI/dell/logs contains XML files which contain diagnostics data (SupportAssist). It appears that there will only be two logs at the same time, diags_previous.xml and diags_current.xml. Those files will be created when an error happened and are really useful to troubleshoot any issue you may have with the laptop or when plugged with external devices.\n\n"
    },
    {
      "title": "LFE Speakers",
      "level": 2,
      "content": "By default only the front speakers are enable. To enable the LFE speakers, install alsa-tools.\n\nWith hdajackretask:\n\n- Choose Realtek ALC289 in codec menu,\n- Check Show unconnected pins,\n- Enable Pin ID Ox17 and select Internal Speaker (LFE),\n- Enable Pin ID 0x1e ans select Internal Speaker,\n- Click Apply Now,\n- Click Install boot override.\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 2,
      "content": "Fingerprint authentication works flawlessly. The sensor is located under the power button on the top right corner of the keyboard. Just follow the steps in fprint. This amounts to installing fprintd and configuring PAM appropriately. Then registering (or in fprint lingo: enrolling) your fingerprint with fprintd-enroll USERNAME.\n\n"
    },
    {
      "title": "Battery charge limit",
      "level": 2,
      "content": "In order to extend the lifetime of the laptop battery, charge limits can be set. There is a Dell utility to do this called Dell Command Configure, but it only supports old versions of Ubuntu, and does not work with Arch due to dependencies on old system libraries.\n\nBut there is a better solution. Install libsmbios. Then, to limit the charge level to 80%:\n\n```\n# smbios-battery-ctl --set-custom-charge-interval 75 80\n# smbios-battery-ctl --set-charging-mode=custom\n```\n\nTo revert to the default settings:\n\n```\n# smbios-battery-ctl --set-charging-mode=adaptive\n```\n\nSource: https://askubuntu.com/a/1351481\n\n"
    }
  ]
}