{
  "title": "Dell XPS 13 2-in-1 (7390)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_13_2-in-1_(7390)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThe New Dell XPS 13 2-in-1 (7390) is the model released in mid 2019 in most territories and is the second iteration of the Dell XPS 13 2-in-1 series, including an updated 10th generation Intel Ice Lake processor with Iris Plus integrated graphics. It can be used like a tablet when folding the display 180 degrees backwards and includes a enlarged 16:10 FHD+ or UHD touchscreen which should work out of the box. This includes support for Wacom pen technology (tested with the \"Wacom Bamboo Ink Plus\").\n\nIn order for Linux to see the internal NVMe SSD, it must be changed in the BIOS from the default \"RAID mode\" to \"AHCI mode\".\n\n"
    },
    {
      "title": "Automatic screen rotation under GNOME and Wayland",
      "level": 3,
      "content": "Install the iio-sensor-proxy package. The screen will now automatically rotate and keyboard input will be disabled in tablet mode. If the screen does not rotate automatically, try running\n\n```\n$ gsettings set org.gnome.settings-daemon.peripherals.touchscreen orientation-lock false\n```\n\nAlternatively, use Super+o to toggle lock state.\n\n"
    },
    {
      "title": "Fingerprint Reader",
      "level": 3,
      "content": "There are currently no drivers available for the fingerprint reader. More information:\n\n[1] libfprint issues adressing Goodix devices\n\n[2] Older Goodix drivers\n\nNew work is being done on multiple Goodix fingerprint readers by reverse engineering the windows drivers:\n\n[3] Blog post about the actual progress\n\n[4] Discord server where all device dumps are posted\n\n"
    },
    {
      "title": "S3 Sleep",
      "level": 3,
      "content": "See Power management/Suspend and hibernate#Changing suspend method.\n\nThe screen will not be properly woken up on resume. To fix the screen wakeup issue, the following setting must be disabled in the BIOS settings: POST Behaviour > Sign of Life > Early Dell Logo Display [5]\n\n"
    },
    {
      "title": "Sleep/Suspend causes slow system",
      "level": 3,
      "content": "Issue exists with aggressive suspend settings in clock modulation settings. Setting the MSR registers manually during system wakeup using systemd is a good solution.\n\nRun command `wrmsr -a 0x19a 0x0` to set the registers to zero after suspend. Check the registers with `rdmsr -a 0x19a `\n\nReference [6]\n\n"
    },
    {
      "title": "Thermal Throttling",
      "level": 3,
      "content": "By default, or whatever was set on Windows by Dell Power Manager, a very conservative power profile is set somewhere in memory (seems to persist BIOS resets) and starts throttling the CPU very early (2.4GHz out of 3.9GHz max on i7-1065G7).\n\nThis can be resolved using throttled. Despite originally conceived to resolve the same issue with Lenovo laptops, it works with Dell computers.\n\n"
    },
    {
      "title": "Backlight",
      "level": 3,
      "content": "If you want to use xbacklight without xf86-video-intel, you can install acpilightAUR. Make sure to add yourself to the video group.\n\nFor more info, see Backlight.\n\n"
    },
    {
      "title": "Thunderbolt docks and external monitors",
      "level": 3,
      "content": "There is a known issue with the Dell Thunderbolt dock (WD19TB) that causes attached external monitors to lose the signal after anything between a few minutes and a few hours of use. A full power cycle resolves the issue temporarily. The fault is related to DisplayPort Multi-Stream-Transport (MST), which is used by the dock, and a faulty kernel implementation. The issue is being tracked here: [7].\n\nDisabling MST resolves the issue, but limits the dock to drive only 1 display across all its outputs. To disable MST, add the i915.enable_dp_mst=0 kernel parameter.\n\nYou can drive an additional display by connecting a ThunderBolt3-to-DisplayPort cable to the ThunderBolt-connector on the back side of the dock, which is passed through to the device without MST for a total of 2 external screens.\n\n"
    },
    {
      "title": "Hard crashes with IntelliJ IDEA",
      "level": 3,
      "content": "The Intel Ice Lake platform has a bug that causes the CPU to crash with certain compilation workloads of the IntelliJ IDEA IDE with old microcode versions.\n\nThe issue is resolved with the microcode revision 0xa0 available with the intel-ucode package.\n\n"
    }
  ]
}