{
  "title": "Dell Latitude E7440",
  "url": "https://wiki.archlinux.org/title/Dell_Latitude_E7440",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU | 8086:0a16 | Yes\nEthernet | 8086:155a | Yes\nAudio | 8086:9c20 | Yes\nWi-Fi | 8086:08b1 | Yes\nSD Card reader | 1217:8520 | Yes\nBluetooth | 8087:8000 | Yes\nWebcam | 1bcf:2985 | Yes?\nFingerprint reader |  | No\n\nThe Dell Latitude E7440 is a business Ultrabook™. Generally speaking, it has nice support of (Arch) Linux.\n\n"
    },
    {
      "title": "Update the firmware",
      "level": 3,
      "content": "The firmware update process does not need an operating system and it can be done with the BIOS utilities of the laptop. A USB flash drive can be prepared on another computer. The latest BIOS firmware, which is an .exe file, can be downloaded from the Dell website. On Windows, the firmware can be burned with Rufus into a bootable USB flash drive. USB Flash drive can be made UEFI/GPT bootable. After the USB flash is prepared, plug the USB flash stick, boot the laptop by pressing F12 and follow the instructions to boot the USB flash. After the firmware update, during reboot press F2 and check whether the shown BIOS version is the one which is burned.\n\n"
    },
    {
      "title": "Secure Boot",
      "level": 3,
      "content": "The Arch Linux kernel is not signed by default, thus it cannot be booted if Secure Boot is enabled in the BIOS. If you want to use the Secure Boot, see Secure Boot to prepare the kernel. The signed kernel itself can be booted by a signed boot loader, e.g. shimx64.efi from Ubuntu.\n\n"
    },
    {
      "title": "Drivers",
      "level": 2,
      "content": "- Intel graphics for HD4400 graphics card.\n- Wireless#iwlwifi for Intel 7260 Wi-Fi card. This driver is from Intel and also part of the Arch Linux package repository.\n- Synaptics for Touchpad\n- Fan speed control#Dell laptops to control fan speed. There is only one fan on this laptop, detected on the right. Do not forget to disable BIOS fan speed control to be able to use custom fan speed config.\n\n"
    },
    {
      "title": "What does not work",
      "level": 2,
      "content": "- Webcam does not work with Virtualbox (as of 4.3.6-1), but it works with native programs such as skype.\n- There is no driver for the fingerprint sensor.\n- Occassionally crashes/freezes/hangs when docked and then changing display modes Tested with Dell E-Port Plus II, using two external monitors together with the laptop display (three displays total)\n- hddtemp cannot read the temperature of the harddisk. Use smartctl -l scttemp /dev/sda instead.\n- As of August 2019, there is no known way how to update the firmware of the SSD. Also not known where to find the most up-to-date firmware.\n\n- Tested with Dell E-Port Plus II, using two external monitors together with the laptop display (three displays total)\n\n"
    },
    {
      "title": "\"Invalid partition table!\" when booting",
      "level": 3,
      "content": "If you use BIOS+MBR boot method and msdos partition table, the BIOS may show this error message before entering Syslinux or other boot loaders. To bypass it, press Enter. To prevent it, put the \"boot\" flag on a primary partition (instead of a logical partition). You may refer to the wiki page of your boot loader to see how this works. It may be a \"kindly reminder\" to Windows users, since Windows can only boot on primary partitions.\n\n"
    },
    {
      "title": "Freeze before going to suspend when lid is closed",
      "level": 3,
      "content": "This seems to be related to https://bugs.launchpad.net/ubuntu/+source/linux/+bug/1301601. Workaround 2 helps decrease frequency of freezes. Create:\n\n```\n/usr/lib/systemd/system-sleep/99switch_to_vt2\n```\n\n```\n#!/bin/sh\n# Possible workaround for bug:\n# https://bugs.launchpad.net/ubuntu/+source/linux/+bug/1301601\n#\n# Switch to a VT before suspending and back after resume \ncase \"$1\" in\n    post)\n        /bin/chvt 1\n    ;;\n    pre)\n        /bin/chvt 2\n    ;;\nesac\n```\n\n"
    },
    {
      "title": "Wi-Fi problems with Bluetooth enabled",
      "level": 3,
      "content": "Severe Wi-Fi problems (decreasing traffic, connection drops) with Bluetooth enabled. Workaround is to switch it off when not needed. This bug seems to be router-specific (e.g. with a Fritzbox).\n\n"
    },
    {
      "title": "Wi-Fi problems when coming back from suspend state",
      "level": 3,
      "content": "When your Wi-Fi is gone after resume try going to BIOS and deactivate the functionality to turn Wi-Fi and WWAN down when an Ethernet cable is connected.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "Dell Latitude E7440 | Post-installation et optimisation (French) (Archived. Original content was removed.)\n\n"
    }
  ]
}