{
  "title": "Dictd",
  "url": "https://wiki.archlinux.org/title/Dictd",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The official website describes dictd as:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dictd package.\n\n"
    },
    {
      "title": "Graphical front ends",
      "level": 3,
      "content": "There are various graphical applications that can access dictd through the DICT protocol:\n\n- GoldenDict — Feature-rich dictionary lookup program supporting multiple dictionary formats.\n\n- gnome-dictionary — A GNOME application to look up definitions.\n\n- xfce4-dict — A dictionary plugin for the Xfce panel. Similar to Gnome dictionary.\n\n- MATE Dictionary — MATE application to look up words in dictionary sources. Similar to Xfce Dictionary.\n\n- Emacs — The extensible editor has a built-in dictd client to look up words in a window or while writing.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Dictionaries can be queried by:\n\n```\n$ dict word\n```\n\nTo query a specific dictionary database, you can use the -d flag. To query the English-Spanish database, for example, you can use:\n\n```\n$ dict -d eng-spa word\n```\n\nWithout further configuration, it is likely that dictd will query online databases. See below to set up offline dictionaries.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "By default, dictd tries to query offline databases first, then online databases. However, offline databases will not be available unless dictd.service is enabled, with locale properly set up and offline dictionaries installed (see below).\n\nThe online mode can be disabled by commenting server dict.org out in /etc/dict/dict.conf. Conversely, the offline mode can be disabled by commenting server localhost out.\n\n"
    },
    {
      "title": "Locale",
      "level": 3,
      "content": "By default, dictd comes configured to use the en_US.UTF-8 locale. If your system does not have this locale compiled, dictd.service will fail to start without a helpful error message.\n\nIt is likely that you want to configure it to use another locale:\n\n```\n/etc/default/dictd\n```\n\n```\nDICTD_ARGS=\"--locale your locale\"\n```\n\n"
    },
    {
      "title": "Hosting offline dictionaries",
      "level": 3,
      "content": "Dictd can be configured to host offline dictionaries by enabling dictd.service and dict need to be configured to using localhost as the server in /etc/dict/dict.conf or .dictrc.\n\nFirst, offline dictionaries need to be installed. Dictionaries are available through the Arch User Repository with the search term dictd. Some popular English dictionaries include:\n\n- dict-gcideAUR - GNU version of the Collaborative International Dictionary of English\n- dict-wnAUR - WordNet\n- dict-moby-thesaurusAUR - Moby Thesaurus\n\nThe FreeDict project also provides many bilingual dictionaries compatible with dictd, which are usually available on AUR.\n\nAfter installation, restart dictd.service if needed to access the newly available dictionary. Afterwards, dictionaries can be queried as described above.\n\n"
    },
    {
      "title": "Parse error",
      "level": 3,
      "content": "The following error:\n\n```\n/etc/dict/dictd.conf:25: syntax error, unexpected $end\n/etc/dict/dictd.conf:25: #LASTLINE\n/etc/dict/dictd.conf:25:          ^\ndictd (yyerror): parse error\nparse error\n```\n\nMeans that dictd cannot find a dictionary database. These can be added manually to /etc/dict/dictd.conf. For example:\n\n```\ndatabase eng-spa {\n\tdata /usr/share/dictd/eng-spa.dict.dz\n\tindex /usr/share/dictd/eng-spa.index\n}\n```\n\nAdds the English-Spanish dictionary installed by dict-freedict-eng-spaAUR. For other dictionaries, copy and paste the above database declaration but make sure to change the database name, i.e. eng-spa, and also change the data and index paths above to specify the right files.\n\n"
    }
  ]
}