{
  "title": "DNSSEC",
  "url": "https://wiki.archlinux.org/title/DNSSEC",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Unbound#DNSSEC validation\n\nFrom the DNSSEC Wikipedia article:\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "Install the ldns package, which provides drill. The drill tool can be used for basic DNSSEC validation.\n\nFor other available tools, see Domain name resolution#Lookup utilities.\n\n"
    },
    {
      "title": "Query with DNSSEC validation",
      "level": 3,
      "content": "Then to query with DNSSEC validation, use the -D flag:\n\n```\n$ drill -D example.com\n```\n\n"
    },
    {
      "title": "Testing",
      "level": 3,
      "content": "As a test use the following domains, adding the -T flag, which traces from the root name servers down to the domain being resolved.\n\nThe result should end with the following lines, indicating that the DNSSEC signature is bogus:\n\n```\n$ drill -DT badsig.go.dnscheck.tools\n```\n\n```\n[B] badsig.go.dnscheck.tools.   1       IN      A       142.93.10.179\n;; Error: Bogus DNSSEC signature\n;;[S] self sig OK; [B] bogus; [T] trusted; [U] unsigned\n```\n\nNow to test a trusted signature, the result should end with the following lines, indicating the signature is trusted:\n\n```\n$ drill -DT go.dnscheck.tools\n```\n\n```\n[T] go.dnscheck.tools.  1       IN      A       142.93.10.179\n;;[S] self sig OK; [B] bogus; [T] trusted; [U] unsigned\n```\n\n"
    },
    {
      "title": "Install a DNSSEC-validating resolver",
      "level": 2,
      "content": "To use DNSSEC system-wide, you can use a DNS resolver that is capable of validating DNSSEC records, so that all DNS lookups go through it. See Domain name resolution#DNS servers for available options. Note that each requires specific options to enable their DNSSEC validation feature.\n\nIf you attempt to visit a site with a bogus (spoofed) IP address, the validating resolver will prevent you from receiving the invalid DNS data and your browser (or other application) will be told there is no such host. Since all DNS lookups go through the validating resolver, you do not need software that has DNSSEC support built-in when using this option.\n\n"
    },
    {
      "title": "Enable DNSSEC in specific software",
      "level": 2,
      "content": "If you choose not to #Install a DNSSEC-validating resolver, you need to use software that has DNSSEC support builtin. Often this means you must patch the software yourself. Hopefully, a full list of several patched applications will eventually (Dec 2020) be found at [1]. Additionally, some web browsers, some of them mentioned at [2], have extensions or add-ons that can be installed to implement DNSSEC without patching the program.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- DNSSEC Resolver Test - a simple test to see if you have DNSSEC implemented on your machine.\n- DNSSEC-Tools\n- DNSSEC Visualizer - a tool for visualizing the status of a DNS zone.\n- Red Hat: Securing DNS Traffic with DNSSEC - thorough article on implementing DNSSEC with unbound. Note that some tools are Red Hat specific and not found in Arch Linux.\n- Wikipedia:Domain Name System Security Extensions\n- dns_tools — Tool to simplify managing DNSSEC zones.\n\n"
    }
  ]
}