{
  "title": "Echinus",
  "url": "https://wiki.archlinux.org/title/Echinus",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- dmenu\n- Window manager\n\nechinus is a simple and lightweight tiling and floating window manager for X11. Started as a dwm fork with easier configuration, echinus became a full-featured reparenting window manager with EWMH support.\n\nUnlike dwm, echinus does not need to be re-compiled after changes have been made to the config. It supports Xft (freetype) out of the box and has the option of configurable titlebars.\n\n"
    },
    {
      "title": "Installing",
      "level": 2,
      "content": "Install echinusAUR. You might also want to install ouricoAUR, a lightweight EWMH taskbar, originally designed for echinus, and dmenu.\n\nAfter successfully installing, copy all files from /etc/xdg/echinus to ~/.echinus(for user).\n\n"
    },
    {
      "title": "Configuring",
      "level": 2,
      "content": "echinus is configured in one simple text file, in Xresources format: ~/.echinus/echinusrc. Details for all of the configuration options are in /usr/share/doc/echinus/README. A section of a sample configuration file looks like:\n\n```\nEchinus*selected.border: #404040\nEchinus*selected.button: #d3d7cf\nEchinus*selected.bg: #262626\nEchinus*selected.fg: #d3d7cf\n```\n\n"
    },
    {
      "title": "Rules",
      "level": 3,
      "content": "Rules can be set up to spawn applications in specific tags. The following rule, for example, would open firefox in the \"web\" tag:\n\n```\nEchinus*rule0: firefox.* web 0 1\n```\n\nOpening applications in a terminal requires that you explicitly set the -title tag when spawning them so that echinus can manage them:\n\n```\nEchinus*spawn0: CA + m = urxvtc -title mutt -e mutt\n```\n\nSimilarly, when spawning dmenu, you will need to declare the requisite properties, like so:\n\n```\nEchinus*spawn1: Menu = dmenu_run -fn \"-*-dina-medium-r-*-*-*-100-*-*-*-*-*-*\" -nb \"#1A1A1A\" -nf \"#696969\" -sb \"#1A1A1A\" -sf \"#D3D7Cf\"\n```\n\n"
    },
    {
      "title": "Starting echinus",
      "level": 2,
      "content": "To start echinus with startx or the SLiM login manager, simply append the following to ~/.xinitrc:\n\n```\nexec echinus\n```\n\n"
    },
    {
      "title": "Using echinus",
      "level": 2,
      "content": "After making changes to echinusrc, you can reload the configuration without recompiling by restarting echinus, with Alt+Shift+q. This keybinding, and any other, can be customized to suit your preference or muscle-memory.\n\nFurther details for manipulating windows are in the manpage and the README.\n\n"
    },
    {
      "title": "Panels & Pagers",
      "level": 3,
      "content": "echinus supports some parts of EWMH - the following are known to work:\n\n- tint2\n- fbpanel\n- ipager[dead link 2025-03-15 ⓘ]\n- ouricoAUR\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- echinus website\n- GitHub repository\n\n"
    },
    {
      "title": "Screenshots",
      "level": 3,
      "content": "- https://www.flickr.com/photos/jasonwryan/5270660692/lightbox/\n- http://plhk.ru/gallery/echinus-0.4.6.png\n- http://plhk.ru/gallery/profont.png\n- http://plhk.ru/gallery/echinus027.png\n\n"
    }
  ]
}