{
  "title": "Espelho",
  "url": "https://wiki.archlinux.org/title/Espelho",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Espelhos não oficiais\n- pacman\n\nEsta página é um guia para selecionar e configurar seus espelhos e uma lista dos espelhos disponíveis atualmente.\n\n"
    },
    {
      "title": "Espelhos oficiais",
      "level": 2,
      "content": "A lista de espelhos oficial do Arch Linux está disponível no pacote pacman-mirrorlist. Para obter uma lista de espelhos mais atualizada, use a página Pacman Mirrorlist Generator no site principal.\n\nVerifique o status dos espelhos do Arch visitando a página Mirror Status. É recomendável usar apenas espelhos atualizados, ou seja, não fora de sincronia.\n\nSe você quiser que o seu espelho seja adicionado à lista oficial, veja DeveloperWiki:NewMirrors. Enquanto isso, adicione-o ao artigo Espelhos não oficiais.\n\n"
    },
    {
      "title": "Espelhos prontos para IPv6",
      "level": 3,
      "content": "O Pacman Mirrorlist Generator também pode ser usado para localizar uma lista atual de espelhos IPv6.\n\n"
    },
    {
      "title": "Habilitando um espelho específico",
      "level": 2,
      "content": "Para habilitar espelhos, edite /etc/pacman.d/mirrorlist e localize sua região geográfica. Descomente os espelhos que você gostaria de usar.\n\nExemplo:\n\n```\n# Any\n# Server = http://mirrors.kernel.org/archlinux/$repo/os/$arch\nServer = https://mirrors.kernel.org/archlinux/$repo/os/$arch\n```\n\nVeja #Ordenando espelhos para ferramentas que ajudam a escolher espelhos.\n\n- Descomente 5 espelhos favoritos e coloque-os no topo do arquivo mirrorlist. Dessa forma, é fácil encontrá-los e movê-los se o primeiro espelho da lista tiver problemas. Também facilita a atualização de atualizações de lista espelhada.\n- Os espelhos HTTP são mais rápidos que o FTP devido a conexão HTTP persistente: com o FTP, uma nova conexão ao servidor deve ser estabelecida toda vez que pacman solicita o download de um pacote, em uma breve pausa.\n\nTambém é possível especificar espelhos em /etc/pacman.conf. Para o repositório [core], a configuração padrão é:\n\n```\n[core]\nInclude = /etc/pacman.d/mirrorlist\n```\n\nPara usar o espelho HostEurope como espelho padrão, adicione-o antes da linha Include:\n\n```\n[core]\nServer = http://ftp.hosteurope.de/mirror/ftp.archlinux.org/core/os/$arch\nInclude = /etc/pacman.d/mirrorlist\n```\n\nO pacman agora tentará se conectar a esse espelho primeiro. Prossiga para fazer o mesmo para [core-testing], [extra], e [extra-testing], se aplicável.\n\n"
    },
    {
      "title": "Forçar o pacman a renovar as listas de pacotes",
      "level": 3,
      "content": "Os espelhos podem estar fora de sincronia e a lista de pacotes do espelho antigo pode não corresponder à lista de pacotes do novo espelho, mesmo que as datas das listas possam sugerir isso.\n\nApós criar/editar o /etc/pacman.d/mirrorlist, execute o seguinte comando:\n\n```\n# pacman -Syyu\n```\n\nPassar dois sinalizadores --refresh/-y força o pacman a atualizar todas as listas de pacotes, mesmo que sejam consideradas atualizadas. Emitir pacman -Syyu é um gasto desnecessário de largura de banda na maioria dos casos, mas algumas vezes pode corrigir problemas ao trocar entre um espelho defeituoso para um funcional. Veja também Is -Syy safe? (-Syy é seguro?).\n\nNote: Isso não é necessário ao usar carimbos de hora (timestamps) para garantir que os espelhos apenas estejam atualizados.\n\n```\n# pacman -Syyuu\n```\n\nIsso não é necessário ao usar carimbos de hora (timestamps) para garantir que os espelhos apenas estejam atualizados.\n\n"
    },
    {
      "title": "Ordenando espelhos",
      "level": 2,
      "content": "Ao baixar os pacotes, o pacman usa os espelhos na ordem em que estão listados no /etc/pacman.d/mirrorlist. A ordem que os servidores aparecem na lista define sua prioridade.\n\nNão é ideal classificar apenas com base nos espelhos na velocidade, pois os servidores mais rápidos podem estar fora de sincronia. Em vez disso, faça uma lista de espelhos classificados por sua velocidade, depois remova da lista aqueles que estão fora de sincronia conforme seu status.\n\nÉ recomendado repetir esse processo antes de toda atualização de sistema para manter a lista de espelhos atualizada.\n\n"
    },
    {
      "title": "Classificando uma lista de espelhos existente",
      "level": 4,
      "content": "O pacote pacman-contrib fornece um script Bash, /usr/bin/rankmirrors, que pode ser usado para classificar os espelhos de acordo com suas velocidades de conexão e abertura para aproveitar o uso do espelho local mais rápido.\n\nFaça um backup do /etc/pacman.d/mirrorlist existente:\n\n```\n# cp /etc/pacman.d/mirrorlist /etc/pacman.d/mirrorlist.backup\n```\n\nPara preparar mirrorlist.backup para classificar com rankmirrors, as seguintes ações podem ser executadas:\n\nEdite mirrorlist.backup e descomente os servidores a serem testados\n\n- Se os servidores no arquivo estiverem agrupados por país, pode-se extrair os servidores de um país específico por uso: $ awk '/^## Nome do país$/{f=1; next}f==0{next}/^$/{exit}{print substr($0, 1); f=0}' /etc/pacman.d/mirrorlist.backup\n\n```\n$ awk '/^## Nome do país$/{f=1; next}f==0{next}/^$/{exit}{print substr($0, 1); f=0}' /etc/pacman.d/mirrorlist.backup\n```\n\n- Para descomentar todo o espelho, execute a seguinte linha sed: # sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n\n```\n# sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n```\n\nFinalmente, classifique os espelhos, aqui com o operando -n 6 para emitir apenas os 6 espelhos mais rápidos:\n\n```\n# rankmirrors -n 6 /etc/pacman.d/mirrorlist.backup > /etc/pacman.d/mirrorlist\n```\n\n"
    },
    {
      "title": "Obtendo e classificando uma lista de espelho live",
      "level": 4,
      "content": "Para iniciar com uma lista curta de espelhos atualizados baseada em alguns países e fornecê-la ao rankmirrors, pode-se obter a lista do Pacman Mirrorlist Generator. O comando abaixo pega os espelhos atualizados na França ou no Reino Unido, que possuem suporte ao protocolo https, ele descomenta os servidores na lista e então os classifica e retorna os 5 mais rápidos.\n\n```\n$ curl -s \"https://archlinux.org/mirrorlist/?country=FR&country=GB&protocol=https&use_mirror_status=on\" | sed -e 's/^#Server/Server/' -e '/^#/d' | rankmirrors -n 5 -\n```\n\n"
    },
    {
      "title": "Classificação do lado do servidor",
      "level": 3,
      "content": "O Pacman Mirrorlist Generator oficial fornece uma maneira fácil de obter uma lista ordenada de espelhos. Como toda a classificação é feita em um único servidor que leva vários fatores em consideração, a quantidade de carga nos espelhos e nos clientes é significativamente menor em comparação à classificação em cada cliente individual.\n\nOutra alternativa popular é a ferramenta a seguir:\n\nReflector — Obtém o último mirrorlist da página MirrorStatus, filtra e ordena-os por velocidade e sobrescreve /etc/pacman.d/mirrorlist\n\n"
    },
    {
      "title": "Solução de problemas",
      "level": 2,
      "content": "Se você encontrar o seguinte erro:\n\n```\nerro: arquivo de configuração /etc/pacman.d/mirrorlist não pôde ser lido: Arquivo ou diretório inexistente\n```\n\nObtenha o mirrorlist do site:\n\n```\n# curl -o /etc/pacman.d/mirrorlist https://www.archlinux.org/mirrorlist/all/\n```\n\nLembre-se de descomentar um espelho preferencial conforme descrito acima e então:\n\n```\n# pacman -Syu pacman-mirrorlist\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- mirrorlist.py no GitHub do archweb - código fonte do gerador de mirrorlist do archweb\n\n"
    }
  ]
}