{
  "title": "Eureka",
  "url": "https://wiki.archlinux.org/title/Eureka",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From Eureka's README:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the eureka-notesAUR package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Eureka does not currently support any sort of complex configuration. However generates its own configuration when you first execute eureka.\n\nWhen you first execute eureka, it will ask you to enter the full path to the repository you would like to use, this is a git repository containing a README.md file. For this setup we will store the eureka data within the home directory of the user you are logged in as.\n\nFirstly, ensure you are in your home directory.\n\n```\n$ cd\n```\n\nThen create the eureka directory, and enter it.\n\n```\n$ mkdir eureka && cd eureka\n```\n\nThen initialise a new git repository within the eureka directory.\n\n```\n$ git init\n```\n\nThen create the README.md file in which the notes will be stored.\n\n```\n$ touch README.md\n```\n\nCongratulations, you have created the eureka storage directory, now in order to keep these notes safe from loss of data, such as you dropping your laptop and losing all the data, eureka automatically pushes to the \"origin\" remote ever change you make to your notes, so we must add this remote.\n\nAny git provider can be used, such as Github or Gitlab as long as you have read/write permissions to the repository you would like to use, once you have created the repository, copy the ssh link and copy it into the following command:\n\ngit remote add origin ssh-url - With your ssh url of the repository you would like to use\n\nFinally, you are ready to start eureka, once executed eureka will ask for the full path to your repository, enter /home/user/eureka.\n\nEureka will automatically generated the configuration for you in json format, you can find the configuration file at $HOME/.config/eureka/config.json.\n\n"
    },
    {
      "title": "Cannot find binary path error",
      "level": 3,
      "content": "If you get the following error ERROR eureka > cannot find binary path, Eureka defaults to the vi editor when no EDITOR environment variable is set.\n\nIf you do not want to define the environment variable globally, you can always define it inline when executing eureka, below is an example with using eureka with neovim without any environment variable set:\n\n```\n$ EDITOR=nvim eureka\n```\n\n"
    },
    {
      "title": "No such file or directory error",
      "level": 3,
      "content": "If you get the following error ERROR eureka > No such file or directory (os error 2) Eureka has attempted to look for the directory you defined on first startup, and could not find it, or the directory does not contain the README.md file which must be present for eureka to function.\n\n"
    }
  ]
}