{
  "title": "Feh",
  "url": "https://wiki.archlinux.org/title/Feh",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Nitrogen\n- sxiv\n\nFrom Wikipedia:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the feh package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "feh is highly configurable. For a full list of options, run feh --help or see the feh(1) man page.\n\n"
    },
    {
      "title": "Browse images",
      "level": 3,
      "content": "To quickly browse images in a specific directory, you can launch feh with the following arguments:\n\n```\n$ feh -g 640x480 -d -S filename /path/to/directory\n```\n\n- The -g flag forces the images to appear no larger than 640x480\n- The -d flag draws the file name\n- The -S filename flag sorts the images by file name\n\nThis is just one example; there are many more options available should you desire more flexibility.\n\n"
    },
    {
      "title": "Set the wallpaper",
      "level": 3,
      "content": "feh can be used to set the desktop wallpaper, for example for window managers without this feature such as Openbox, Fluxbox, and xmonad.\n\nThe following command is an example of how to set the initial background:\n\n```\n$ feh --bg-scale /path/to/image.file\n```\n\nOther scaling options include:\n\n```\n--bg-tile FILE\n--bg-center FILE\n--bg-max FILE\n--bg-fill FILE\n```\n\nTo restore the background on the next session, add the following to your startup file (e.g. ~/.xinitrc, ~/.config/openbox/autostart, etc.):\n\n```\n~/.fehbg &\n```\n\nTo change the background image, edit the file ~/.fehbg which gets created after running the command feh --bg-scale /path/to/image.file mentioned above.\n\nOne can explicitly disable the creation of the ~/.fehbg, by passing the --no-fehbg flag as well.\n\nTo setup different wallpapers for different monitors one should pass as many file paths as many monitors are available. For example, for a dual monitor setup it would be:\n\n```\n$ feh --bg-center path/to/file/for/first/monitor path/to/file/for/second/monitor\n```\n\n"
    },
    {
      "title": "Open SVG images",
      "level": 3,
      "content": "```\n$ feh --conversion-timeout 1 file.svg\n```\n\nNote that this requires the imagemagick package.\n\n"
    },
    {
      "title": "Random background image",
      "level": 3,
      "content": "You can have feh set a random wallpaper using the --randomize option with one of the --bg-foo options, for example:\n\n```\n$ feh --bg-fill --randomize ~/.wallpaper/*\n```\n\nThe above command tells feh to randomize the list of files in the ~/.wallpaper/ directory and set the backgrounds for all available desktops to whichever images are at the front of the randomized list (one unique image for each desktop). You can also do this recursively, if you have your wallpapers divided into subfolders:\n\n```\n$ feh --recursive --bg-fill --randomize ~/.wallpaper\n```\n\nTo set a different random wallpaper from ~/.wallpaper each session, add the following to your .xinitrc:\n\n```\n$ feh --bg-max --randomize ~/.wallpaper/* &\n```\n\nAnother way to set a random wallpaper on each xorg session is to edit your .fehbg as following.\n\n```\n$HOME/.fehbg\n```\n\n```\nfeh --bg-max --no-fehbg --randomize ~/.wallpaper/*\n```\n\n"
    },
    {
      "title": "Using in cron job",
      "level": 3,
      "content": "To use feh in a cron job for randomizing your wallpapers, you must specify the DISPLAY environment variable:\n\n```\nDISPLAY=:0 feh --bg-max --randomize ~/.wallpaper/*\n```\n\nNote that some display managers like sddm might not save of XAUTHORITY file in ~/.Xauthority where feh expects it to be, which causes the cronjob to complain about: \"Authorization required, but no authorization protocol specified\".\n\n"
    }
  ]
}