{
  "title": "Ficihp K2 keyboard",
  "url": "https://wiki.archlinux.org/title/Ficihp_K2_keyboard",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The Ficihp K2 (pronouced \"Fichip\") is a mechanical keyboard with a 12.6 inch (320 mm) 1920x515 display with a touchscreen at the top of the keyboard. The keyboard also features RGB lighting on each key. The programming for the keyboard appears to be independent of the computer it is plugged into as settings can be modified without the need for RGB software (e.g. OpenRGB) on the host computer.\n\n"
    },
    {
      "title": "Applications",
      "level": 2,
      "content": "The display works well. It is ideal for anyone who needs a dashboard display. However, the touchscreen needs to be calibrated. Something this article should discuss.\n\nWindows users have used programs that have detachable editing controls to the keyboard screen while other users have used it to put their music players, chat programs feed, or other utility panels into the smaller screen.\n\n"
    },
    {
      "title": "Connection",
      "level": 3,
      "content": "The keyboard connects to the computer via USB-C to USB-C cable or USB-C to two USB-A cables and an HDMI port. The USB-C connection connects to the keyboard; however, there are two USB-A ports at the top edge of this keyboard which act as a pass-through connection for devices such as a mouse.\n\n"
    },
    {
      "title": "Keyboard Layout",
      "level": 3,
      "content": "The keyboard has 71 keys on it with mechanical blue switches that can be replaced. The keyboard layout does not have a row of function keys, but there is an escape key in the number row. The Backtick/Tilde key is accessible by holding down the Fn key then pressing the Escape for the backtick. Adding Shift to this sequence will produce the tilde. The Fn key is also how the number keys (1-9, and 0 as well as the + and = keys) act as the F1 through F12 keys.\n\nIn addition, some of the other F-Keys (though unmarked) can control playing of media for a media player.\n\nArrow keys are in the lower right side where above them are seven utility keys Ins, Del, Pause, Home, End, PgUp, and PgDn.\n\n"
    },
    {
      "title": "Other Controls",
      "level": 3,
      "content": "There are three buttons on the top edge of the screen to browse through an on-screen display for this device.\n\n"
    },
    {
      "title": "Display",
      "level": 3,
      "content": "This keyboard has a 12.6 inch (320 mm) 1920x515 display with a touchscreen at the top of the keyboard. According to the documentation in its manual, it supports 45% of the color gamut and has a scale ratio of 3:1 and a refresh rate of 60 Hz.\n\n"
    },
    {
      "title": "RGB Backlighting",
      "level": 3,
      "content": "The RBG Backlighting under each key is controlled using the Fn. The programming appears to be independent of the host device, meaning that a program like openrgb will likely not have the ability to manipulate this feature.\n\n"
    },
    {
      "title": "Technical Information",
      "level": 2,
      "content": "Information about this device was also detected using a computer that was using Sway window manager using sway-input and sway-output to detect information about the device.\n\nBecause the device was connected to device that did not have a free USB-C port available, it was plugged in using the two USB-A ports and the HDMI port.\n\n"
    },
    {
      "title": "Output",
      "level": 3,
      "content": "With the 2 USB-A and HDMI configuration, sway-output reported the device was connected to a device named HDMI-A-1. The make was Unknown, the model was listed as KEYBOARD and the serial listing was listed as KEYBOARD-1118.\n\n"
    },
    {
      "title": "Input",
      "level": 3,
      "content": "sway-input had provided more information about this device, including identifier, name, vendor and product number.\n\nThe identifier was 9282:3:USB_HID_Gaming_Keyboard. The name of the device was USB HID Gaming Keyboard. The vendor ID was listed as 9282 and the product number of 3. The type was listed as a keyboard.\n\nAnother device was listed with a type of pointer. The identifier of this device was listed as 9282:3:USB_HID_Gaming_Keyboard_Consumer_Control. A third device was listed with the same identifier but with a type of keyboard similar to the first listing but with the same identifier as the pointer device.\n\nAnother device listed its identifier as 9282:3:USB_HID_Gaming_Keyboard_Mouse with a type of pointer.\n\nFinally, two more devices with the identifier 10473:650:GigaDevice_GD32_custom_HID_in_FS_Mode_V1.06 listed as types touch and pointer. libinput reported that each of these items had a calibration_matrix which likely needs to be mapped to the size of the screen as initially half of the screen was not interacting properly.\n\n"
    },
    {
      "title": "Alternate technical information",
      "level": 3,
      "content": "Using way-displays -g, we could find out much of the same information, but in a more succinct format.\n\n```\n$ way-displays -g\n```\n\n```\n...\nHDMI-A-1:\n  info:\n    name:     'HDMI-A-1'\n    make:     'Jiangxi Jinghao Optical Co., Ltd.'\n    model:    'KEYBOARD'\n    serial:   'KEYBOARD-1118'\n    desc:     'Jiangxi Jinghao Optical Co., Ltd. KEYBOARD KEYBOARD-1118 (HDMI-A-1)'\n    width:    300mm\n    height:   80mm\n    dpi:      163.04 @ 1920x515\n    mode:     1920 x 515 @ 60 Hz  59,998 mHz (preferred)\n    mode:      720 x 400 @ 70 Hz  70,082 mHz\n    mode:      640 x 480 @ 75 Hz  75,000 mHz\n    mode:      640 x 480 @ 60 Hz  59,940 mHz\n  current:\n    scale:    1.750 (1.698)\n    position: 1280,0\n    mode:      1920x515@60Hz (59,998mHz) (preferred)\n    VRR:       off\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Maxfree K3 keyboard another keyboard with a screen on the top half, this time with a lot more features.\n\n"
    }
  ]
}