{
  "title": "Fingerprint GUI",
  "url": "https://wiki.archlinux.org/title/Fingerprint_GUI",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- fprint\n- ThinkFinger\n\nFingerprint GUI is a program that provides an interface and drivers for fingerprint readers. The package includes drivers from the open-source project fprint as well as proprietary drivers not included in fprint.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install fingerprint-guiAUR.\n\nThe package includes an installation guide in HTML at /usr/share/doc/fingerprint-gui/Manual_en.html.\n\nIf you are using GNOME or KDE follow the instructions pacman gives and remove the following files:\n\n```\n/etc/xdg/autostart/\n```\n\n```\npolkit-gnome-authentication-agent-1.desktop\npolkit-kde-authentication-agent-1.desktop\n```\n\nIf you are using a window manager, you may need an authentication agent. The package includes an authentication agent /lib/fingerprint-gui/fingerprint-polkit-agent. If your window manager is fully XDG compliant, this agent will autostart. An agent is only needed when enrolling fingers, not when identifying.\n\n"
    },
    {
      "title": "Registering fingerprints",
      "level": 2,
      "content": "After installation, test if your hardware is recognized and correctly working by launching the configuration utility:\n\n```\n$ fingerprint-gui -d\n```\n\nThe -d is for debugging, and simply creates a verbose log of events. If you are comfortable without the debug info, you may safely omit the flag.\n\nIf your device is not recognized, you might need to reboot in order for udev to set the correct permissions for the device. You may need to add your user to the scanner group.\n\nTo start registering your fingerprints with the configuration utility, select the tab \"Finger\", select a finger and choose \"next\".\n\n"
    },
    {
      "title": "Authentication",
      "level": 2,
      "content": "Once your fingerprints have been registered, you may notice that in the setup procedure that the \"test\" section does not yet work. This is because the necessary authentication has not been approved in the appropriate pam.d files.\n\nAs an example of how to set up fingerprint authetication for a given service, we will first start with sudo. Open /etc/pam.d/sudo in your text editor and insert the following bold text:\n\n```\n/etc/pam.d/sudo\n```\n\n```\n#%PAM-1.0\nauth\t\tsufficient\tpam_fingerprint-gui.so\nauth\t\trequired\tpam_unix.so\nauth\t\trequired\tpam_nologin.so\n```\n\nKeep in mind that your 'sudo' file may contain more entries.\n\nSome users may not have (or want to have) sudo installed on their systems. In this case, it is still possible to use your fingerprint to authenticate su. This can be done just like the sudo example, of course instead adding an entry to /etc/pam.d/su. Again, add the following bold text.\n\n```\n/etc/pam.d/su\n```\n\n```\n#%PAM-1.0\n auth\t\tsufficient\tpam_rootok.so\n auth\t\tsufficient\tpam_fingerprint-gui.so\n auth\t\trequired\tpam_unix.so\n account\t\trequired\tpam_unix.so\n session\t\trequired\tpam_unix.so\n```\n\nOne may also configure such things as GDM, SDDM, LightDM and the Gnome-Screensaver. Again, if more information or instruction is needed, please refer to the included manual. The Package Maintainer's Manual might provide further information that cannot be obtained by the included manual.\n\n"
    },
    {
      "title": "Verification",
      "level": 2,
      "content": "Now that the necessary authentication has been added to pam, you may wish the confirm the functionality of your setup. The easiest way to do this is to, again, launch the fingerprint-gui. Rather than go through the steps (as your fingerprints should already be established), click directly on the Settings tab. From here you may select the function you wish to test (ie. sudo, su, gdm, etc).\n\nThere is also an included utility to simply confirm that your registered fingerprints are recognized. This can be done by simply running:\n\n```\n$ fingerprint-identifier\n```\n\nand following the onscreen instructions.\n\n"
    },
    {
      "title": "Exporting",
      "level": 2,
      "content": "If you wish to save your user's fingerprint data to a file, simply use the Export button in the Settings tab. A file Fingerprints.tar.gz\" will be created in the desired directory. The saved file appears to be of little use, however, as an \"Import\" function has not yet been discovered (as of May 2018).\n\n"
    },
    {
      "title": "Password",
      "level": 2,
      "content": "In some cases, using your fingerprint to log into the system may inhibit certain other functions of the desktop environment. For example, GNOME Keyring is dependent on your password, as it is used to encrypt the data in your keyring. To overcome this, Fingerprint GUI contains a feature that allows you to store your encrypted password on removable media (USB). You may then use the key to decrypt your keychain by authenticating your fingerprint while the removable media is plugged in.\n\nThe manual indicates that to use this function, mount your USB drive and ensure that you have write access to it. Under the \"Password\" tab of Fingerprint GUI, indicate the appropriate path to your device where it says \"Save to directory\" (ie. if using gvfs it should be under /run/media/your_uid/device). Enter your password and re-enter it and select \"save\". This will create a hidden directory on your removable media /.fingerprints and create a file username@hostname.xml. On the local machine, this will also create the file /var/lib/fingerprint-gui/username/config.xml.\n\n"
    },
    {
      "title": "Device is not recognized",
      "level": 3,
      "content": "If your device (for example 06cb:00bd, which can be found on recent Thinkpads) is not recognized while it is recognized by the CLI (fprint), it is because currently the Fingerprint GUI is based on an old version. See [1] for details.\n\n"
    }
  ]
}