{
  "title": "Framework Laptop 13 (AMD Ryzen 7040 Series)",
  "url": "https://wiki.archlinux.org/title/Framework_Laptop_13_(AMD_Ryzen_7040_Series)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWi-Fi | 14c3:0616 | Yes\nAudio | 1002:1640 | Yes\nTouchpad | 093a:0274 | Yes\nKeyboard |  | Yes\nWebcam (1st Gen) | 0bda:5634 | Yes\nWebcam (2nd Gen) | 32ac:001c | Yes\nFingerprint reader | 27c6:609c | Yes\nBluetooth | 0e8d:e616 | Yes\nTPM |  | Yes\nAmbient light sensor |  | Yes\n\nThis article covers the installation and configuration of Arch Linux on a Framework Laptop 13 with a AMD Ryzen 7040 Series mainboard.\n\nFor a general overview of laptop-related articles and recommendations, see Laptop.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "It is highly recommended to use the latest stable kernel (linux) as linux-lts does not yet include patches for the Phoenix APU and Zen 4 platform that improve stability, power efficiency and performance.\n\n"
    },
    {
      "title": "Display",
      "level": 2,
      "content": "The Ryzen 7040 Series can be configured with one of two different displays.\n\nThe default 2256x1504 resolution display has 400nit brightness and 60Hz refresh rate. The matte display module is manufactured by BOE and is uncalibrated from factory, giving a suboptimal default sRGB coverage. It is thus recommended to apply this ICC profile if you have this display in order to have better color reproduction.\n\nThe newer 2880x1920 resolution display, better known as the 2.8k display module has 30-120Hz variable refresh rate and 10-bit color support. This display can be identified by the rounded top corners. The 2.8k display resolution at 256 DPI is perfect for 2x scaling factor as many desktop environments under Linux currently struggle with fractional scaling. This ICC profile is available to improve color reproduction.\n\n"
    },
    {
      "title": "Speakers",
      "level": 2,
      "content": "By default, the speakers do not sound very balanced due to the downward firing speakers, so you may want to use an equalizer to fix this. The recommended method is to install EasyEffects and use the official preset found here.\n\nAlternatively, you can use user-created profiles such as this one created by cab404.\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "power-profiles-daemon should be installed and enabled to be able to control power states. AMD and Framework do not recommend the use of tlp - see [1] [2].\n\n"
    },
    {
      "title": "Wi-Fi",
      "level": 2,
      "content": "You will be limited to 802.11n (Wi-Fi 4) and 2.4GHz bands if you do not configure the regulatory domain.\n\nThere have been reports of Wi-Fi stability and throughput improvements when using iwd, either directly or as the NetworkManager backend.\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 2,
      "content": "Install fprint to enable fingerprint authentication. You will need to upgrade the fingerprint reader firmware following the article on the Framework knowledgebase if your reader isn't recognised.\n\n"
    },
    {
      "title": "Ambient light sensor",
      "level": 2,
      "content": "Install iio-sensor-proxy to enable automatic brightness in Gnome. Other desktop environments are unsupported at this time.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "fwupd is support is offered by Framework. It is highly recommended to upgrade to BIOS 3.05 for maximum compatibility. Full instructions, changelogs, known issues and EFI shell updaters can be found in the Framework knowlegebase.\n\nCustom Secure Boot keys can be installed.\n\n"
    },
    {
      "title": "Wakeup issues",
      "level": 3,
      "content": "Some users experience issues on wakeup from suspend / hibernate, as the framework has a chance of rebooting instead of waking up. The wifi module Mediatek MT7921 seems to cause this. As a workaround, turn off wifi before suspend and enable it after wakeup. The following systemd service automates this for both wifi and bluetooth for suspend / hibernate / suspend-then-hibernate:\n\n```\n/etc/systemd/system/rfkill-before-sleep.service\n```\n\n```\n[Unit]\nDescription=Disable wifi and bluetooth before suspend\nBefore=sleep.target\n\n[Service]\nType=oneshot\n\nExecStart=/usr/sbin/rfkill block all\nExecStop=/usr/sbin/rfkill unblock all\n\n[Install]\nWantedBy=sleep.target\n```\n\n"
    },
    {
      "title": "Video freezes",
      "level": 3,
      "content": "Some users experience video freezes. System became completely unresponsive and cames back after a few minutes.\n\nThe following kernel parameter seems to fix this issue :\n\namdgpu.dcdebugmask=0x10\n\nsee 1\n\nsee 2\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- ArchWiki vendor page\n- AMD Ryzen 7040 Series Knowledge base[dead link 2025-03-15 ⓘ]\n- Framework Linux forum\n\n"
    }
  ]
}