{
  "title": "Godot",
  "url": "https://wiki.archlinux.org/title/Godot",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Godot Engine is an open-source game engine.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the godot package, or godot-gitAUR for the development version.\n\nInstall the godot-mono package for C# programming support.\n\n"
    },
    {
      "title": "Legacy versions",
      "level": 3,
      "content": "To use version 3 of the engine, install the godot3AUR package.\n\nTo use version 2 of the engine, install the godot2AUR package.\n\n"
    },
    {
      "title": "Export templates",
      "level": 3,
      "content": "To be able to export your project, you will need prebuilt binaries. If using the Git version, you will need to compile them yourself as described separately for each platform on the wiki or use godot-export-templates-gitAUR. If you are using the stable version, you can install the export templates provided by Godot. Install them by clicking on the engine settings icon in the top right corner, and then press \"Install export templates\" and provide the downloaded templates.\n\n"
    },
    {
      "title": "UI freezes in Wayland",
      "level": 3,
      "content": "Godot runs on Wayland using Xwayland, which causes a variety of UI issues, when not running in single window mode. [1] To get around this, start Godot with godot --single-window, then open a project, and enable single window mode in the editor settings.\n\nThis issue has been resolved in Godot 4.1.1. [2] This issue seems to have recurred in Godot 4.2 [3]\n\nWith Godot 4.3, Wayland can be used natively. [4] There are two ways to do this:\n\n- Set the command-line argument --display-driver wayland.\n- Enable the editor setting located at run/platforms/linuxbsd/prefer_wayland.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Godot (game engine) on Wikipedia\n- Godot documentation\n- Godot source code\n- Godot: the Game-Changer for GameDevs - Introduction and comparison with other engines\n- awesome-godot - free/libre plugins, scripts and add-ons for Godot\n- /r/godot community on reddit.com\n- Godot Engine Resources tutorials\n- Gamesfromscratch video tutorials\n- KidsCanCode video tutorials\n- Andreas Esau video tutorials\n- Heartbeast video tutorials\n- GDQuest video tutorials\n- Jose Moreno video tutorials\n\n"
    }
  ]
}