{
  "title": "Gopro-webcam",
  "url": "https://wiki.archlinux.org/title/Gopro-webcam",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nCurrently there is no official support for using your GoPro 8 and 9 (the only versions that offer this feature natively) as a webcam on Linux. The web is full of incomplete tutorials for this topic. This page tries to simplify this effort.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the gopro-webcamAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "The following command starts the tool in the interactive mode and tries to identify the GoPro's device, find the interface and ultimately start the webcam mode:\n\n```\n# gopro webcam\n```\n\nThere are a couple of options you can also set. See the --help option.\n\n"
    },
    {
      "title": "Examples",
      "level": 2,
      "content": "Start the webcam at a resolution of 1080p and with the linear FOV and start FFmpeg to expose the device to the OS:\n\n```\n# gopro webcam -a -r 1080 -f linear\n```\n\nFind a device that matches the pattern enx and starts the webcam mode without asking for user input (it also starts ffmpeg to expose the device to the OS):\n\n```\n# gopro webcam -p enx -n -a\n```\n\nUse the provided device enxenx9245589250e7 and do not ask for user input (just start VLC to preview the output you will get from the Camera):\n\n```\n# gopro webcam -d enxenx9245589250e7 -n -v\n```\n\nUse the provided IP 172.27.187.52 and automatically start ffmpeg to expose the device to the OS (and do not ask for user input):\n\n```\n# gopro webcam -i 172.27.187.52 -a -n\n```\n\n"
    },
    {
      "title": "Start on boot",
      "level": 2,
      "content": "In order to start the webcam on boot, enable gopro_webcam.service.\n\nIf you would like to change the start parameters, edit gopro_webcam.service.\n\n"
    },
    {
      "title": "Start on plug in",
      "level": 2,
      "content": "gopro-webcam comes with a udev rule that will automatically start the gopro_webcam service when a GoPro Hero9 is plugged in, which may be undesirable to some users. The udev rule can be disabled as follows:\n\n```\n# ln -s /dev/null /etc/udev/rules.d/60-gopro.rules\n```\n\nTo have the udev rule work with a GoPro Hero8 Black instead, change GoPro HERO9 in 60-gopro.rules to HERO8 Black.\n\n"
    },
    {
      "title": "Cannot find network device for GoPro",
      "level": 3,
      "content": "Double check that the USB connection mode is GoPro Connect and not MTP under Preferences > Connections > USB Connection. If that option does not exist, you likely need a firmware upgrade. Instructions can be found at https://gopro.com/en/us/update.\n\n"
    }
  ]
}