{
  "title": "Groff",
  "url": "https://wiki.archlinux.org/title/Groff",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Man page\n\nAccording to Wikipedia:\n\nOutput may be PostScript or PDF, html, or ASCII/UTF8 for display at the terminal. Formatting commands may be either low-level typesetting requests (“primitives”) or macros from a supplied set. Users may also write their own macros. All three may be combined. Using groff may be a solid alternative to TeX Live due to small size and native language.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "You may find groff already installed on your system as it is a dependency of the base-devel package. Otherwise install it as usual.\n\n"
    },
    {
      "title": "Package documentation",
      "level": 3,
      "content": "Detailed documentation and usage examples are available in groff(1) or its Info document groff.\n\nYou can also access the documentation at https://www.gnu.org/software/groff/groff.html#documentation.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Groff is a powerful and yet lightweight easy to use system.\n\nYou can see an example of document created with -me macros, however, groff has several built-in macros as well.\n\nYou may be interested in using ms for not complicated tasks or mom to produce scientific papers. See groff_ms(7) and groff_mom(7).\n\nSee the following resources for feature information:\n\n- The Groff and Friends HOWTO\n- Creating Documents in Groff or LaTeX\n- Mom macros examples\n\n"
    },
    {
      "title": "Adding support for cyrillic fonts",
      "level": 3,
      "content": "If you see inappropriate symbols when outputting documents with cyrillic fonts to ps or pdf, take the following steps:\n\n- Download type1 fonts with cyrillic support (for example from gs-type1_koi8_fonts.tgz Arial, Times, Courier)\n- Place your cyrillic type1 fonts into /usr/share/fonts/gsfonts — this is default folder for ghostscript to find fonts\n- Create a copy of the original file before changing it:\n\n```\ncd /usr/share/ghostscript/YOUR_VERSION/Resource/Init/\n cp Fontmap.GS Fontmap.GS.backup\n```\n\n- Change ghostscript fontmap file to associate default fonts with cyrillic ones, using '%' to comment lines with default associations. Add new aliases, as follows:\n\n```\n/usr/share/ghostscript/YOUR_VERSION/Resource/Init/Fontmap.GS\n```\n\n```\n%/Times-Roman /NimbusRoman-Regular ;\n /Times-Roman  /TimesNRCyrMT ;\n /TimesNRCyrMT (times8.pfb) ;\n```\n\nWhere '(times8.pfb)' is a name of your copied type1 font.\n\n- From now on you can prepend your default groff command with iconv prefix to print cyrillic symbols in ps files:\n\n```\n$ iconv -f utf-8 -t koi8-r test.ms | groff -ms -Tps > test.ps && ps2pdf test.ps test.pdf\n```\n\n"
    },
    {
      "title": "Correctly display Polish diacritics",
      "level": 3,
      "content": "To display Polish diacritics:\n\n```\n$ groff -Kutf8 -Tdvi -mec -ms test.ms > test.dvi\n$ dvipdfm -cz 9 test.dvi\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Groff parser and template engines for Rails\n- Mom macros\n- Mom macros full manual\n\n"
    }
  ]
}