{
  "title": "Himitsu",
  "url": "https://wiki.archlinux.org/title/Himitsu",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Himitsu is a secure secret storage system for Unix-like systems. It is extensible and suitable for storing passwords, private keys, logins, etc.\n\nHimitsu secrets are stored in a arbitrary key/value store, accessible via a daemon. Himitsu also provides a command-line interface and query language for the store. Himitsu is designed for various integrations and frontends, including the graphical himitsu-keyring application.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the himitsuAUR or himitsu-gitAUR package.\n\nYou will also need a Himitsu prompter: hiprompt-gtk-pyAUR.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The himitsu(7) man page is worth reading. The following is a guide specific to an Arch Linux installation of himitsuAUR.\n\nFirstly, you will need a himitsu secstore (secrets store) and some basic configuration. Initialize these with himitsu-store(1).\n\n```\n$ himitsu-store -i\n```\n\nYou will then need to configure Himitsu to use your prompter of choice. Edit the himitsu.ini(5) config file. For example, for hiprompt-gtk-pyAUR:\n\n```\n~/.config/himitsu/config.ini\n```\n\n```\n[himitsud]\nprompter=hiprompt-gtk\n```\n\nThe Himitsu daemon himitsud(1) can now be run. The Himitsu package comes with a systemd user unit, himitsud.service. Starting/enabling it runs himitsud in the background.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Use the hiq(1) command to query and manage the keystore.\n\nYou can manage the keystore graphically using himitsu-keyringAUR.\n\n"
    },
    {
      "title": "Integrations",
      "level": 2,
      "content": "Himitsu has integrations for various software.\n\n"
    },
    {
      "title": "SSH",
      "level": 3,
      "content": "The himitsu-sshAUR package provides an SSH agent and utilities for using and storing SSH keys in the Himitsu keystore.\n\nFor ssh to use the Himitsu SSH agent, it is required that:\n\n- The agent is running (enable/start the included hissh-agent.service user unit).\n- The $SSH_AUTH_SOCK environment variable is set to the Himitsu SSH agent's socket (i.e. $XDG_RUNTIME_DIR/hissh-agent).\n\nSee hissh-agent(1).\n\nWith that, ssh will consult the Himitsu keystore for SSH key data.\n\n"
    },
    {
      "title": "Firefox",
      "level": 3,
      "content": "The himitsu-firefoxAUR package provides the backend (a native messaging component) for the official Firefox Himitsu Add-on. Once both installed, Firefox can consult the Himitsu keystore for logins/passwords, from keystore entries with the proto=web key-value pair. The add-on implements the \"web\" protocol.\n\n"
    }
  ]
}