{
  "title": "HP Spectre x360 13-w023dx",
  "url": "https://wiki.archlinux.org/title/HP_Spectre_x360_13-w023dx",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU | 8086:5916 | Yes\nWireless | 8086:24fd | Yes\nBluetooth | 8087:0a2b | Yes\nAudio | 8086:9d71 | Partial\nTouchscreen | 04F3:2493 | Yes\nTouchpad | PS/2 | Yes\nWebcam | 0408:5150 | Yes\nIR Camera | 0408:50e0 | Untested\n\nThis article covers hardware specific configuration of this laptop, some minor issues remain after customization. These can be performed after an installation of Arch Linux has been finished and the machine rebooted into it.\n\nFor a general overview of laptop-related articles and recommendations, see Laptop.\n\n"
    },
    {
      "title": "Hardware options",
      "level": 3,
      "content": "This is the model of HP Spectre x360 released in late 2016. Distinctive features include two thunderbolt ports and no digitizer. The main hardware components are\n\n- Intel i7 Kabylake 7500U\n- OLED touch screen running at 1920x1080\n- 500 GB M.2 SDD\n- 16 GB RAM\n- 4 speakers\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installing arch is straight forward for everything (disable secure boot, F10 for BIOS, F9 for boot options) but one thing: you may have to disable a BIOS option called \"fast boot\". While this option is activated in BIOS the machine may boot into Windows no matter what you select. If you make to boot into the latest arch ISO (June 2016) on a USB, arch EFI boot menu hangs. After you installed arch, you may activate that option again: no difference in boot performance could be observed with the option activated or deactivated.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "Codec has changed from the previous version, now it is Realtek ALC295:\n\n```\n# aplay -l\n```\n\n```\n**** List of PLAYBACK Hardware Devices ****\ncard 0: PCH [HDA Intel PCH], device 0: ALC295 Analog [ALC295 Analog]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\n```\n\nIn best case scenario just one speaker is going to work. There is a bug for that: https://bugzilla.kernel.org/show_bug.cgi?id=189331\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "When using synaptics X11 drivers touchpad works but fails to detect palm, which causes problems when typing. Dell XPS13 had similar issue and they fixed it, but HP is not going to do that. Refer to https://github.com/advancingu/XPS13Linux/issues/3\n\nWhen using libinput drivers palm detection works out of the box.\n\n"
    },
    {
      "title": "Multimedia keys",
      "level": 3,
      "content": "While the keyboard backlight (f5) and airplane mode (f12) keys work without any intervention, the rest of the fn keys will be nonfunctional out of the box (unless your DE/WM provides this functionality). In the case that it does not, this can be remedied with acpid, allowing the screen brightness, volume, and multimedia back/play/forward keys to work.\n\nHardware names that the acpi event handler recognizes for these buttons are as follows:\n\n```\n# journalctl -f\n```\n\n```\n... ACPI group/action undefined: video/brightnessdown / BRTDN\n... ACPI group/action undefined: video/brightnessup / BRTUP\n... ACPI group/action undefined: button/mute / MUTE\n... ACPI group/action undefined: button/volumedown / VOLDN\n... ACPI group/action undefined: button/volumeup / VOLUP\n... ACPI group/action undefined: cd/prev / CDPREV\n... ACPI group/action undefined: cd/play / CDPLAY\n... ACPI group/action undefined: cd/next / CDNEXT\n```\n\nFollowing the information and examples provided in acpid#Tips and tricks, handlers can be put in /etc/acpi/events/ to perform actions on all of these.\n\nAlternatively, a quick solution to get screen backlight control working with the media keys is to use xfce4-power-manager, selecting Handle display brightness keys in the settings.\n\n"
    },
    {
      "title": "Auto Rotation",
      "level": 3,
      "content": "See Tablet PC#Automatic rotation for common methods of achieving this, as well as here, for a python auto-rotation script specifically written for this laptop.\n\n"
    }
  ]
}