{
  "title": "JDownloader",
  "url": "https://wiki.archlinux.org/title/JDownloader",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "JDownloader is a download manager written in Java. JDownloader can download normal files, but also files from online file hosting services.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install jdownloader2AUR.\n\n"
    },
    {
      "title": "Running",
      "level": 3,
      "content": "Use the command jdownloader to start JDownloader. When you have just installed JDownloader, this will run the update tool to download some required files for JDownloader, else this will start JDownloader directly.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "When you first start JDownloader you can choose your preferred language and also your download directory. On the next window, JDownloader will ask you if you want to install FlashGot, a Firefox extension, which is entirely optional.\n\nIf you enable the Light(GTK) theme and the fonts appear to lack anti-aliasing, follow the directions at Java Runtime Environment fonts#Anti-aliasing.\n\n"
    },
    {
      "title": "Downloading files without creating a subdirectory",
      "level": 3,
      "content": "By default jdownloader will create a subdirectory for each file you download in your destination folder. To stop this behaviour go to Settings > Packagiser and untick the predefined rules as desired.\n\n"
    },
    {
      "title": "Changing preferences for individual sites",
      "level": 3,
      "content": "Preferences for individual sites can be found by going to Settings > Plugins. For example, by changing settings on the youtube.com plugin you could tell jdownloader to only download the audio from YouTube links.\n\n"
    },
    {
      "title": "Changing font scale",
      "level": 3,
      "content": "If font is too small, it can be enlarged by increasing scale factor: settings > advanced settings > LAFSettings.fontscalefactor jd forum.\n\n"
    },
    {
      "title": "Cleaning up the UI",
      "level": 3,
      "content": "The graphical user interface can be adjusted to a bigger extent:\n\n- Flashing of the update button can be disabled: change GraphicalUserInterfaceSettings: Update Button Flashing in the advanced preferences.\n- The banner at the top can be disabled by changing GraphicalUserInterfaceSettings: Banner.\n- Some warning icons can be removed when looking for Premium Alert.\n- The Donate Tab can be disabled by setting GraphicalUserInterfaceSettings: Donate Button State to Hidden (User Mode).\n- Entries in the menu can be changed when visiting Settings > User Interface > Main Menu, same goes for the Right Click Menu\n\n"
    },
    {
      "title": "Application not resizing with WM, menus immediately closing",
      "level": 3,
      "content": "see Java#Gray window, applications not resizing with WM, menus immediately closing\n\n"
    },
    {
      "title": "Using the system tray icon",
      "level": 3,
      "content": "Minimize to tray is broken on Linux. You will run in problems like a little stray window appearing. Disable the feature altogether just to not accidentally run into it. For that, just unplug the checkbox in the settings.\n\nTo use the tray, applications which put JDownloader into the tray can be used, namely kdockerAUR or alltray.\n\nBoth of them have a launcher, which would send an active application into the tray. The other way to start use them is to launch JDownloader (or any other programm) like that:\n\n```\n$ kdocker -q -i /usr/share/icons/hicolor/22x22/apps/jdownloader.png -d 15 JDownloader\n```\n\nor\n\n```\n$ alltray JDownloader\n```\n\nTo use the command, you could:\n\n- copy the desktop file to /usr/local/share/applications/ and edit it.\n- copy the desktop file to ~/config/autostart/ and edit it.\n- or create /usr/local/bin/JDownloader\n\nIt should be noted though, that when the application restarts, which JDownloader does to install updates, it will not be managed anymore by kdocker / alltray.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "List of applications/Internet#Download managers.\n\n"
    }
  ]
}