{
  "title": "Kiwix",
  "url": "https://wiki.archlinux.org/title/Kiwix",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From Wikipedia, ZIM is an open file format that stores wiki content for offline usage. It is also the name of a graphical text editor used to edit this format.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "- zim: GUI editor\n- zim-gitAUR: latest developer git version.\n- Kiwix: offline ZIM viewer designed primarily for reading Wikis installed via kiwix-desktop. The project includes mobile versions and an online library of free ZIM files.\n- Web archives\n- goldendict-ngAUR: designed for dictionary use.\n\nConsole-based:\n\n- zim-tools\n- kiwix-tools: CLI reading by server requests instead of downloading the whole ZIM database.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Zim can be used to:\n\n- Keep an archive of notes\n- Take notes during meetings or lectures\n- Organize task lists\n- Draft blog entries and emails\n- Do brainstorming\n\nThis screencast provides an overview about the basic functionality.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Zim uses the XDG base directories.\n\nBesides the configuration there exist the wiki directories which are set up when a new wikis are created. Those folders store all wiki pages in plain txt format.\n\n"
    },
    {
      "title": "Tips",
      "level": 2,
      "content": "Specific user tricks to accomplish tasks.\n\n"
    },
    {
      "title": "Plugins",
      "level": 3,
      "content": "Zim provides a lot of useful plugins where many of them are not enabled by default. They can be found at Edit > Preferences > Plugins. That is, there is a plugin which provides a tray icon.\n\n"
    },
    {
      "title": "Spell checker",
      "level": 4,
      "content": "The requirements for the Spell Checker plugin are as follows: gtkspell3 and aspell-en.\n\nChange aspell-en to your desired language support. Now you can configure the Spell Checker and define the default language, in my case en_GB. If you do not want Zim to spell-check based on your system default language, go to File > Properties > Spell Checker and enter a language code such as en_US or en_GB.\n\n"
    },
    {
      "title": "Source View",
      "level": 4,
      "content": "The requirements for Source View are as follows: gtksourceview3\n\n"
    },
    {
      "title": "Problems at launch",
      "level": 3,
      "content": "A common error is at start up resulting in a error message like the following this thread:\n\n```\nUnboundLocalError: local variable 'i' referenced before assignment\n```\n\nIt is often related to a problem with the file path of the wikis stored in ~/.config/zim/notebooks.list. Try to delete or move this file and restart Zim.\n\n"
    },
    {
      "title": "Error: Unable to find or create trash directory",
      "level": 3,
      "content": "This error message indicates that Zim is not able to find the trash directory as in this thread. This occurs when the wiki is stored on a partition that does not have any trash directory under /partition/.local/share/Trash. Due to that one is not able to delete pages as Zim tries to move them to the trash. Solutions are either the creation of a trash directory or the installation of the developer snapshot instead of the stable version which permanently deletes a page if no trash directory can be found. Thus, the user does not receive this error message anymore.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Zim homepage\n- Zim official manual\n- A short screencast\n- Zim community documentation\n- Getting work done in Zim\n- Zim content pulled from various Wikis\n\n"
    }
  ]
}