{
  "title": "Lenovo Yoga Slim 7 Pro AMD (14ACH5)",
  "url": "https://wiki.archlinux.org/title/Lenovo_Yoga_Slim_7_Pro_AMD_(14ACH5)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad | PS/2 | Yes\nKeyboard |  | Yes\nGPU | 1002:1638 | Yes\nWebcam | 13d3:5419 | Yes\nBluetooth | 0489:e0cd | Yes\nAudio | 1022:15e3 | Yes\nWireless | 14c3:7961 | Yes\nTPM |  | Untested\n\nThis laptop comes in an O or D model:\n\nO = Onboard Vega graphics\n\nD = Onboard + Dedicated nVidia MX450 2GB GPU\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "In order to install, Secure Boot must be disabled in the UEFI. You can enter it by pressing F2 (or Fn+F2) during boot. In order to access the boot-menu allowing you to choose a non standard boot device (like USB devices), press F12 (or Fn+F12) during boot.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "While Lenovo is known to support fwupd in general, the Yoga Slim 7 has not been added yet.\n\n"
    },
    {
      "title": "UEFI",
      "level": 3,
      "content": "The UEFI can be accessed at boot by pressing F2, minimal options are available.\n\nUpdates are currently provided by Lenovo as Windows binaries.\n\n"
    },
    {
      "title": "Display",
      "level": 2,
      "content": "The laptop comes with an optional 2800x1800 90hz glossy display: recommended settings for Gnome are 200% scale and 85% font scale, KDE scaling is customizable enough to handle the resolution.\n\nFor more details, see HiDPI.\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "The integrated Vega graphics are decent, on the D model the dedicated NVIDIA graphics can be disabled in the BIOS under the \"UMA Graphics\" setting.\n\nWhen using the dedicated NVIDIA graphics it is recommended to keep the chip off when not in use using one of the NVIDIA Optimus solutions\n\n"
    },
    {
      "title": "Suspend",
      "level": 3,
      "content": "s0ix is the only supported sleep mode, this mode works well in kernel 5.16 onwards although a slight drain is observed while the machine is in a sleep state.\n\n"
    },
    {
      "title": "Hibernation",
      "level": 3,
      "content": "Untested although hibernation should work using kernels 5.16 onwards.\n\n"
    },
    {
      "title": "Battery Saving",
      "level": 3,
      "content": "Using GNOME, the battery saving profile can be changed which is reflected in the UEFI\n\n- Battery Life − Battery Saver\n- Balanced − Intelligent Cooling\n- High Performance − Performance\n\nIt is recommended to install TLP for battery saving.\n\nThis laptop supports the amd_pstate frequency driver, see CPU frequency scaling once amd_pstate is activated the cores can run as low as 400mhz reducing the battery consumption when idle.\n\nA custom resolution of 2880x1800 at 60hz can be added to reduce drain from running the display at 90hz.\n\n- When operating in Balanced power mode on AC power, the machines fan will often be spinning.\n- Battery conservation mode and Rapid Charge mode can be turned on from Windows using Lenovo Vantage program. It will stay turned on after booting Linux. They can also be controlled on Gnome via the IdeaPad Controls extension\n\n"
    }
  ]
}