{
  "title": "Lenovo Yoga Slim 7 (AMD)",
  "url": "https://wiki.archlinux.org/title/Lenovo_Yoga_Slim_7_(AMD)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nVideo |  | Partial\nWebcam |  | Yes\nBluetooth |  | Yes\nAudio |  | Yes\nWireless |  | Yes\nTPM |  | Untested\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "In order to install, secure boot must be disabled in the BIOS. You can enter it by pressing F2 (or Fn+F2) during bootup. In order to access the boot-menu allowing you to choose a non standard boot device (like USB devices), press F12 (or Fn+F12) during bootup.\n\nInitially, the touchpad is unusable, see Touchpad section below.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "The touchpad does not work to begin with. It may work initially with libinput or synaptics, but only sometimes. The touchpad can be seen registered either as Elan Touchpad or ELAN0634:00 04F3:3124 in the Xorg logs. Since the touchpad only works, when it is seen registered as ELAN0634:00 04F3:3124 in the Xorg logs, the touchpad works quite randomly, but not consistently. To circumvent this, one has to blacklist the elan_i2c kernel module.\n\nelants_i2c would need to be blacklisted instead for the Intel version of the Lenovo Yoga Slim 7.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "While Lenovo is known to support fwupd in general, the Yoga Slim 7 has not been added yet.\n\n"
    },
    {
      "title": "UEFI",
      "level": 3,
      "content": "\"BIOS updates\" are currently provided by Lenovo as a Windows binary that can only be executed on the original Windows installation.\n\n"
    },
    {
      "title": "Suspend",
      "level": 2,
      "content": "See Power management/Suspend and hibernate#Changing suspend method.\n\n"
    },
    {
      "title": "Hibernation",
      "level": 2,
      "content": "The Yoga Slim 7 14ARE05 model does not resume from sleep and needs to be forcefully shut down by holding the power button for 10 seconds after opening the lid. This can be resolved by enabling the advanced settings in the BIOS using the Yoga BIOS unlock tool, and then changing the option AMD PBS > S3/Modern Standby Support to S3 Enable in the BIOS.\n\nAs of kernel 5.16.15, suspend and hibernate work.\n\n"
    },
    {
      "title": "Backlight",
      "level": 2,
      "content": "If backlight control does not work, pass acpi_backlight=video and amdgpu.backlight=0 as kernel parameters.\n\n"
    }
  ]
}