{
  "title": "Lenovo ThinkPad X1 Carbon (Gen 7)",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_X1_Carbon_(Gen_7)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nVideo | 8086:3ea0 | Yes\nWireless | 8086:9df0 | Yes\nEthernet | 8086:15be | Yes\nMobile broadband |  | Yes\nAudio | 8086:9dc8 | Yes\nTouchpad | 06cb:cd8b | Yes\nTrackPoint | 06cb:cd8b | Yes\nCamera | 13d3:56ba | Yes\nFingerprint reader | 06cb:00bd | Yes\nBluetooth | 8087:0aaa | Yes\nNFC |  | No\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "The most convenient way to install Arch Linux is by disabling \"Secure Boot\" Security -> Secure Boot - Set to \"Disabled\". However it is possible to self-sign your kernel and boot with it enabled. For further information have a look at the Secure Boot article.\n\nIn case your efivars are not properly set it is most likely due to you not being booted into UEFI. Should the problem persist be sure to consult the UEFI#UEFI variables section.\n\n"
    },
    {
      "title": "Automatic (Linux Vendor Firmware Service)",
      "level": 4,
      "content": "In August of 2018 Lenovo has joined the Linux Vendor Firmware Service (LVFS) project, which enables firmware updates from within the OS. BIOS updates (and possibly other firmware such as the Thunderbolt controller) can be queried for and installed through fwupd.\n\nIf your thunderbolt port is unstable after upgrading with fwupd, you can visit the Lenovo ThinkPad X1 Carbon (Gen 7) driver website and upgrade the thunderbolt firmware manually.\n\n"
    },
    {
      "title": "Manual (fwupdmgr)",
      "level": 4,
      "content": "Lenovo may in the future provide cabinet files that can be directly installed with fwupdmgr. Check for Linux .cab files from the Lenovo ThinkPad X1 Carbon (Gen 7) driver website.\n\n1. Make sure the AC adapter is firmly connected to the target computer.\n1. Launch Terminal.\n1. Move to the directory where the cabinet file was placed.\n1. Run fwupdmgr install xxxxxxxx.cab to schedule firmware update.\n1. Restart the system.\n1. The computer will be restarted and the UEFI BIOS will be updated.\n\n"
    },
    {
      "title": "Sleep/Suspend",
      "level": 3,
      "content": "The BIOS has two \"Sleep State\" options, Windows and Linux, which you can find in Config -> Power -> Sleep State. The Linux option is the traditional S3 power state where all hardware components are turned off except for the RAM, and it should work normally. The Windows option is a newer software-based \"modern standby\" which works on Linux (despite the name). One possible benefit to the Windows sleep state is faster wake up time, and one possible drawback is increased power usage.\n\nMark Pearson, a Lenovo employee, recommends using the \"Windows\" sleep state option as it is better supported on modern Intel processors. The same is true for other modern Thinkpads except for AMD models (as of November 2020).\n\n"
    },
    {
      "title": "S3 Suspend Bug with Bluetooth Devices",
      "level": 3,
      "content": "Occasionally your Thinkpad will wake up immediately after suspending with certain bluetooth devices added. To prevent this, remove the devices or disable bluetooth before suspending.\n\n"
    },
    {
      "title": "BIOS configurations",
      "level": 3,
      "content": "In Config > Thunderbolt BIOS Assist Mode set to Enabled. When disabled, power usage appears to be significantly higher because of a substantial number of CPU wakeups in s2idle.\n\n"
    },
    {
      "title": "Firmware issues",
      "level": 3,
      "content": "The following issues can all be resolved by upgrading the firmware with fwupdmgr (see #BIOS Updates), but there may be alternative manual/temporary fixes.\n\n"
    },
    {
      "title": "Touchpad issues",
      "level": 4,
      "content": "Due to a bug in a touchpad firmware, the touchpad might not work with following logs in dmesg:\n\n```\n[    4.499490] i2c_designware i2c_designware.1: i2c_dw_handle_tx_abort: lost arbitration\n[...]\n[   12.668795] i2c_hid i2c-SYNA8005:00: failed to set a report to device.\n[   13.678765] i2c_designware i2c_designware.1: controller timed out\n```\n\n"
    },
    {
      "title": "Freeze when suspending",
      "level": 4,
      "content": "There are reports of the system freezing after initiating a suspend or hibernate. A temporary fix is to add snd_hda_intel.dmic_detect=0 to your kernel parameters. see [1]. This temporary fix is somehow disable the microphone, use this at your own risk\n\n"
    },
    {
      "title": "Power management/Throttling issues",
      "level": 4,
      "content": "A bug causes the CPU to consume less power than under Windows and throttle at 80°C instead of 97°.\n\nLenovo has confirmed the issue, explained the cause and published updates for the embedded controller and the BIOS to LVFS .\n\nThe alternative fix is to install throttled, then start/enable throttled.service.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "This laptop requires Sound Open Firmware to work.\n\nIf you are still having issues, add the following:\n\n```\n/etc/modprobe.d/blacklist.conf\n```\n\n```\nblacklist snd_hda_intel\nblacklist snd_soc_skl\n```\n\nand append the following:\n\n```\n/etc/pulse/default.pa\n```\n\n```\nload-module module-alsa-sink device=hw:0,0 channels=4\nload-module module-alsa-source device=hw:0,7 channels=4\n```\n\nAfterwards, reboot.\n\n"
    },
    {
      "title": "Clicking/cracking noise when using headphones",
      "level": 3,
      "content": "If you are hearing clicking/cracking noises when using headphones, this command helped me. I have to run it after each restart.\n\n```\n# hda-verb /dev/snd/hwC0D0 0x1d SET_PIN_WIDGET_CONTROL 0x0\n```\n\n"
    },
    {
      "title": "Clicking/cracking noise when using speakers",
      "level": 3,
      "content": "The newest alsa-ucm-conf is missing the speakers configuration. Downgrade it to 1.2.3-2.\n\n```\n# downgrade alsa-ucm-conf\n```\n\n"
    },
    {
      "title": "Microphone",
      "level": 3,
      "content": "On version 5.3 and newer the SOF firmware can be enabled, see Talk#Microphone.\n\nIf you are having issues getting the microphone to be detected, see the troubleshooting section in #Audio.\n\n"
    },
    {
      "title": "Secondary IR",
      "level": 3,
      "content": "Some models of this laptop include a second infrared (IR) webcam (originally to be used with Windows Hello) which is uncovered by the privacy slider. v4l2-ctl --list-devices will show all available video devices. The IR emitter can be manipulated using chicony-ir-toggle.\n\nFacial authentication can be archived using Howdy.\n\n"
    },
    {
      "title": "Function Keys",
      "level": 2,
      "content": "In the firmware configuration it is possible to swap the Ctrl and Fn keys.\n\nTable content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Toggles Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86AudioMicMute\nFn+F5 | Yes | Yes | XF86MonBrightnessDown\nFn+F6 | Yes | Yes | XF86MonBrightnessUp\nFn+F7 | Yes | Yes | XF86Display\nFn+F8 | Yes | Yes | XF86WLAN\nFn+F9 | Yes | Yes | XF86Tools\nFn+F10 | Yes | Yes | XF86Bluetooth\nFn+F11 | No | Yes | No Effect\nFn+F12 | Yes | Yes | XF86Favorites\n\n1. The key is visible to xev and similar tools.\n1. The physical key has a symbol on it, which describes its function.\n\n"
    },
    {
      "title": "Fingerprint sensor",
      "level": 2,
      "content": "An official Lenovo firmware with Linux support is available from fwupd. After installing fwupd, you can update the Synaptics Prometheus driver for the fingerprint sensor:\n\n```\n# fwupdmgr refresh\n# fwupdmgr get-updates\n   Prometheus Fingerprint Reader Device Update:\n   New version:       10.01.3158804\n   New features and enhancements:   Support Linux system\n# fwupdmgr update\n```\n\nTo use the fingerprint sensor, follow the instructions from Fprint.\n\nIf you had previously installed the testing version of this driver from lvfs-testing, there should be no issues updating to this driver version from the main repository.\n\n"
    },
    {
      "title": "Mobile broadband",
      "level": 2,
      "content": "The Fibocom LTE module has Linux support once switched to USB mode; see [2] and [3]\n\n"
    },
    {
      "title": "Disabling red LED in ThinkPad logo",
      "level": 2,
      "content": "You can temporarily disable the red LED in the ThinkPad logo on the cover:\n\n1. Enable writing to the embedded controller registers by adding the kernel parameter ec_sys.write_support=1.\n1. Disable the LED with this command:\n\n```\n# echo -n -e \"\\x0a\" | dd of=\"/sys/kernel/debug/ec/ec0/io\" bs=1 seek=12 count=1 conv=notrunc 2> /dev/null\n```\n\nThis would need to be run after each suspend/reboot to be permanent.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- https://www.thinkwiki.org/wiki/ThinkWiki\n- Dell XPS 13 9370 quirks: Some pointers on getting Watt usage down to ~2W, Intel video powersaving features might be interesting, see also the Intel graphics page for interesting power-saving options.\n- Intel Blog: Best practice to debug Linux* suspend/hibernate issues[dead link 2023-09-16 ⓘ], including the pm-graph tool to analyze power usage during suspend\n- How to fix volume control (ALSA problem) This is where the volume fix came from originally.\n- Windows System Power States\n- System Sleep States at kernel.org\n\n"
    }
  ]
}