{
  "title": "Lenovo ThinkPad T14 (AMD) Gen 2",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_T14_(AMD)_Gen_2",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTrackpoint |  | Yes\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU | 1022:1638 | Yes\nWebcam | 04f2:b724 | Yes\nEthernet | 10ec:8168 | Yes\nBluetooth | 0bda:4852 | Yes\nMicoSD-card reader | 17a0:975010ec:522a | Yes\nAudio | 1022:15e2 | Yes\nWi-Fi | 10ec:8852 | Yes\nWWAN | 1eac:1001 | Yes\nTPM | 1022:15df | Yes\nFingerprint reader | 06cb:00bd | Yes\nSmartcard reader | 058f:9540 | Yes\nNFC reader | ??? | No\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "High contrast black on white with large type. Unfortunately the selected menu item is indicated with faint dotted lines, which would make it hard to read for those with visual limitations. Under the Config tab, there is a Setup UI item that toggles the BIOS look-and-feel back to the old-school Thinkpad grey-blue-and-white, all-text, keyboard navigation mode, which may be easier. A table of navigation keys is found under the heading \"Navigate in the UEFI BIOS interface\" on p.31 of the user guide.\n\nThis device has no diagnostic LEDs but relies on audible beep codes. However, those codes can be translated into visible form by using Lenovo's SmartBeep app. This is described under the heading \"Beep errors\" on p.53 of the user guide.\n\n"
    },
    {
      "title": "fwupd",
      "level": 3,
      "content": "fwupd supports the UEFI BIOS, the webcam, the fingerprint reader and the NVMe controller.\n\n"
    },
    {
      "title": "November 2021 security update",
      "level": 3,
      "content": "On November 4, 2021 Lenovo pushed System Firmware Version 1.12, a UEFI/BIOS update, to LVFS. This is described as a security update (although without further detail). See LVFS page for this update.\n\n"
    },
    {
      "title": "Secure boot",
      "level": 3,
      "content": "For a number of Lenovo laptops of the same cohort, it has been reported that deleting SecureBoot keys and substituting your own keys bricks the motherboard. Further, Lenovo classifies this as caused-by-customer and thus outside the scope of warranty coverage. See here for Lenovo forum threads on XC17,T14s and T14 (AMD) Gen 1.\n\nYou break it, you keep both pieces.\n\nNote that keeping the Lenovo Certificates should not brick the machine according to this thread.\n\n"
    },
    {
      "title": "Realtek Ethernet",
      "level": 2,
      "content": "lspci shows two distinct Ethernet controllers:\n\n```\n$ lspci | grep Ethernet\n```\n\n```\n02:00.0 Ethernet controller: Realtek Semiconductor Co., Ltd. RTL8111/8168/8411 PCI Express Gigabit Ethernet Controller (rev 0e)\n05:00.0 Ethernet controller: Realtek Semiconductor Co., Ltd. RTL8111/8168/8411 PCI Express Gigabit Ethernet Controller (rev 15)\n```\n\nenp5s0 is the RJ45 port. enp2s0f0 is the proprietary connector next to the 2nd USB Type-C port for use in the Lenovo ThinkPad Ultra Docking Station or with a Lenovo ThinkPad Ethernet Extension Cable Gen 2 cable.\n\nCheck ip link to see what interface has carrier and then set up that interface.\n\n```\n$ ip link\n```\n\n```\n1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN mode DEFAULT group default qlen 1000\n    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00\n2: enp2s0f0: <NO-CARRIER,BROADCAST,MULTICAST,UP> mtu 1500 qdisc fq_codel state DOWN mode DEFAULT group default qlen 1000\n    link/ether 38:f3:ab:f4:0a:b9 brd ff:ff:ff:ff:ff:ff\n3: enp5s0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000\n    link/ether 38:f3:ab:f4:0a:b8 brd ff:ff:ff:ff:ff:ff\n4: wlp3s0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc noqueue state UP mode DORMANT group default qlen 1000\n    link/ether 14:5a:fc:1b:d5:15 brd ff:ff:ff:ff:ff:ff\n```\n\n"
    },
    {
      "title": "Mobile broadband",
      "level": 2,
      "content": "According to the service manual the only supported WWAN card is the Quectel EM120R-GL.\n\nThis modem is confirmed working after following the FCC unlock procedure outlined in the ThinkPad mobile Internet#FCC unlock a Quectel modem page.\n\n"
    },
    {
      "title": "Unreliable mic mute LED",
      "level": 2,
      "content": "See Lenovo ThinkPad T14 (AMD) Gen 3#Mute Mic LED always on.\n\n"
    },
    {
      "title": "Synaptics touchpad RMI bus non-functional",
      "level": 2,
      "content": "The Synaptics touchpad uses the psmouse module rather than its native RMI bus, which is qualitatively superior. dmesg says:\n\n```\n[    2.148382] psmouse serio1: synaptics: queried max coordinates: x [..5678], y [..4694]\n[    2.184193] psmouse serio1: synaptics: queried min coordinates: x [1266..], y [1162..]\n[    2.184214] psmouse serio1: synaptics: Your touchpad (PNP: LEN2073 PNP0f13) says it can support a different bus. If i2c-hid and hid-rmi are not used, you might want to try setting psmouse.synaptics_intertouch to 1 and report this to linux-input@vger.kernel.org.\n```\n\nFollowing that advice by adding psmouse.synaptics_intertouch=1 to the kernel command line results in a different complaint:\n\n```\n[    2.217261] psmouse serio1: synaptics: Trying to set up SMBus access\n[    2.220337] psmouse serio1: synaptics: SMbus companion is not ready yet.\n```\n\nFor more, see the relevant thread in the Lenovo Ubuntu forums and related kernel bug report.\n\n"
    },
    {
      "title": "Freezing Trackpad",
      "level": 2,
      "content": "The trackpad may freeze randomly. The cure is to unload the psmouse module with rmmod and reload it with modprobe.\n\n"
    },
    {
      "title": "Fingerprint reader unavailable after suspend",
      "level": 2,
      "content": "There have been reports that while the fingerprint reader works well with fprintd after a cold start (including wake from hibernation) it vanishes from the list of available devices after sleep or suspend. As of July 2022, with the latest system firmware updates applied, this issue now seems to be resolved.\n\n"
    },
    {
      "title": "AMD P-State",
      "level": 2,
      "content": "Starting with kernel 5.17, AMD processors should have more finesse in frequency control due to the inclusion of the AMD p-states driver. Starting with kernel 6.3, the AMD p-states driver provides EPP (energy preference performance) which provides a hint to the hardware if software wants to bias toward performance or energy efficiency. Starting with kernel 6.4, the AMD p-states driver provides a guided mode in which the driver requests minimum and maximum performance level and firmware autonomously selects a performance level in this range and appropriate to the current workload.\n\nUnfortunately, the acpi_cpufreq driver does not play well with others. To get it working:\n\n- Blacklist acpi_cpufreq by adding the entry acpi_cpufreq to the /etc/modprobe.d/blacklist.conf file;\n- Add amd_pstate=passive, amd_pstate=active or amd_pstate=guided to your kernel boot options.\n\nConfirm if it has worked by running cpupower frequency-info to confirm the driver being used. You can also load the amd_pstate_ut module and review dmesg to confirm that the driver passed the relevant tests.\n\nNote that the amd_pstate driver is now a boolean option in the kernel configuration and can no longer be built as a module.\n\nFor those using TLP to manage power, AMD p-state performance is slated for inclusion in the 1.06 release. For the impatient, switch to tlp-gitAUR in the AUR.\n\n"
    },
    {
      "title": "Sleep mode (S3)",
      "level": 2,
      "content": "Sleep mode and, in particular, the lid switch are slow and flaky unless the sleep mode is set to Linux rather than Windows 10 in the UEFI. Be sure that you have logged out of, rather than suspending, any Windows installation before changing this.\n\nSee Power management/Suspend and hibernate for more details.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible? | Marked? | Effect\nFn+Esc | Yes | Yes | Toggles Fn lock\nF1 | Yes | Yes | XF86AudioMute\nF2 | Yes | Yes | XF86AudioLowerVolume\nF3 | Yes | Yes | XF86AudioRaiseVolume\nF4 | Yes | Yes | XF86AudioMicMute\nF5 | Yes | Yes | XF86MonBrightnessDown\nF6 | Yes | Yes | XF86MonBrightnessUp\nF7 | Yes | Yes | XF86Display\nF8 | Yes | Yes | XF86WLAN\nF9 | Yes | Yes | XF86NotificationCenter\nF10 | Yes | Yes | XF86PickupPhone\nF11 | Yes | Yes | XF86HangupPhone\nF12 | Yes | Yes | XF86Favorites\nFn+Space | No | Yes | Controls the keyboard backlight\nFn+b | Yes | No | Control_L+Break\nFn+d | No | No | Toggles ePrivacy screen (if it's supported)\nFn+k | Yes | No | Scroll_Lock\nFn+p | Yes | No | Pause\nFn+s | Yes | No | Alt_L Alt_L+Sys_Req\nFn+4 | Yes | No | XF86Sleep\nFn | Yes | No | XF86WakeUp\nFn+Left Arrow | Yes | No | Home\nFn+Right Arrow | Yes | No | End\n\n"
    },
    {
      "title": "PCI Express Card Reader",
      "level": 2,
      "content": "The on-board reader requires the rtsx_pci_sdmmc kernel module to be loaded. This can be enabled at boot by adding a file in /etc/modprobe.d/ with the module name.\n\n"
    },
    {
      "title": "Touchscreen",
      "level": 2,
      "content": "Blacklist kernel module raydium_i2c_ts to make touchscreen work.\n\nSee BBS#274704 for more information.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Tech specs (pdf)\n- User guide (pdf)\n- Lenovo Product page\n\n"
    }
  ]
}