{
  "title": "Lenovo Yoga Slim 7i Aura (15ILL9)",
  "url": "https://wiki.archlinux.org/title/Lenovo_Yoga_Slim_7i_Aura_(15ILL9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nKeyboard |  | Yes\nTouchpad | 04F3:06FA | Yes\nTouchscreen | 4858:3132 | Yes\nGPU | 8086:9a49 | Yes\nSpeakers |  | No\nMicrophone |  | No\nWebcam | 30c9:00CA | Yes\nWi-Fi | 8086:A840 | Yes\nBluetooth | 8087:0037 | Yes\nTPM |  | Untested\n\n"
    },
    {
      "title": "Initial Setup",
      "level": 2,
      "content": "As a Lunar Lake device, this realistically requires Linux 6.12 as a minimum kernel version to boot reliably. When install media is unavailable, installing via a virtual machine to a drive, upgrading to a supported kernel, and booting from that drive with the fallback initramfs can be used to get the system online.\n\nAdditionally, this device originally shipped with a buggy/incomplete ACPI table for Linux. Prior to installing Linux, the EFI/BIOS needs to be updated via Windows to version 66 (specifically NYCN66WW from February 2025) or newer.\n\n"
    },
    {
      "title": "Video",
      "level": 2,
      "content": "Linux detects the brightness range as supporting HDR and the controls for HDR are present in the KDE display manager settings. Brightness control works without issue.\n\nVLC detects available hardware acceleration components and will play video while keeping the CPU at the minimum clock speed.\n\n"
    },
    {
      "title": "Webcam",
      "level": 2,
      "content": "Both IR and visible webcams work. The IR light source to illuminate the user's face is untested.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "No audio devices are detected by the system. The Intel sound devices are readily identified via lspci, but no devices are exposed to any of the kernel sound subsystems.\n\n"
    },
    {
      "title": "Wireless and Bluetooth",
      "level": 2,
      "content": "Bluetooth works without with the installed linux-firmware package.\n\nWifi requires a backported (pending formal release) binary blob. This is provide by linux-firmware. As of January 2025, linux-firmware package contains both wilwifi-bz-b0-fm-c0-94.ucode (BE202) and wilwifi-bz-b0-fm-c0-92.ucode (BE200), but not the wilwifi-bz-b0-fm-c0-93.ucode (BE201) variant this device requires. Simply downloading the required ucode file from upstream and placing it in the same directory as the other two ucode files, then rebooting, is sufficient to enable Wifi support.\n\n"
    }
  ]
}