{
  "title": "Lenovo ThinkPad Helix",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_Helix",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nForm Factor | Tablet/Ultrabook Convertible (detachable keyboard dock)\nDisplay | 11.6\" 1920x1080 LCD with Capacitive and Pen Digitizers\nCPU | 3rd Generation (Ivy Bridge) Core i5-3427U or i7-3667U\nRAM | 4GiB (i5) or 8GiB (i7) DDR3L RAM (dependent upon CPU)\nStorage | 128/160/256GB mSATA SSD\nWiFi | Intel Centrino Advanced-N 6205S mPCI WLAN\nBluetooth | Broadcom BCM20702 Bluetooth 4.0 (USB connected)\nCamera | 5MP Rear and 2MP Front (also USB)\n\nFor the second generation of Helix hardware (models 20CG and 20CH), see Levovo ThinkPad Helix 2nd Gen.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Due to the fact that there is no optical drive, you need to use a USB flash installation medium.\n\n"
    },
    {
      "title": "Digitizers",
      "level": 2,
      "content": "The Lenovo Helix comes with the following input devices (the ids may not be the same on your system):\n\n```\n$ xinput list\n⎡ Virtual core pointer                    \tid=2\t[master pointer  (3)]\n⎜   ↳ Virtual core XTEST pointer              \tid=4\t[slave  pointer  (2)]\n⎜   ↳ Wacom ISDv4 EC Pen stylus               \tid=15\t[slave  pointer  (2)]\n⎜   ↳ Atmel Atmel maXTouch Digitizer          \tid=16\t[slave  pointer  (2)]\n⎜   ↳ SynPS/2 Synaptics TouchPad              \tid=18\t[slave  pointer  (2)]\n⎜   ↳ TPPS/2 IBM TrackPoint                   \tid=19\t[slave  pointer  (2)]\n⎜   ↳ Wacom ISDv4 EC Pen eraser               \tid=21\t[slave  pointer  (2)]\n```\n\nA Wacom USB device recognized by the xf86-input-wacom driver will create multiple X input devices from a single kernel device. In the Lenovo Helix's case, three such X input devices are created when properly configured:\n\n- Wacom ISDv4 EC Pen stylus\n- Wacom ISDv4 EC Pen eraser\n- Atmel Atmel maXTouch Digitizer\n\nThe Wacom ISDv4 EC Pen stylus xinput device is recognized by the xf86-input-wacom driver out of the box. However, additional Udev and Xorg configuration is required to recognize the Atmel Atmel maXTouch Digitizer touchscreen device as well as Wacom ISDv4 EC Pen eraser input if using a pen with an eraser function.\n\n"
    },
    {
      "title": "Xorg configuration",
      "level": 3,
      "content": "Next, you will need to tell Xorg to use the new inputs. The xf86-input-wacom driver package has an up-to-date list of devices that the Helix has. But, the package does not install the updated list by default. You will need to link it for Xorg to see them:\n\n```\n# ln -s /usr/share/X11/xorg.conf.d/50-wacom.conf /etc/X11/xorg.conf.d/50-wacom.conf\n```\n\nOnce done with all the above, reboot and you verify xinput list looks the same as the above.\n\n"
    },
    {
      "title": "Touchscreen",
      "level": 3,
      "content": "If you find yourself frustrated by the capacitive digitizer while trying to use the pen, there are a few options as outlined below that can help.\n\n"
    },
    {
      "title": "thinkpad-helix-utils: Toggle Touch",
      "level": 4,
      "content": "The thinkpad-helix-utilsAUR package contains a script located at /usr/bin/helix-toggle-touch that will toggle the capacitive digitizer on and off with a simple command using Xorg's xinput function. It also installs a desktop file called Toggle Touch that can be used to toggle xinput on and off with the pen.\n\nOnce activated, it disables the touchscreen xinput device until it is ran again to re-activate it.\n\n"
    },
    {
      "title": "xnohands",
      "level": 4,
      "content": "Another option that also uses Xorg's xinput is xnohands. This utility disables the touch device in a system when a stylus is detected (either pen or eraser) and re-enables the touchscreen once then stylus is pulled away from the screen. It does this by listening to the digitizer's \"presence\" event, which the Helix's Wacom ISDv4 EC input devices support. You will need to download and extract it. Follow the README for instructions as it outlines how to set it up.\n\nNOTE: You must have followed the udev and xorg configuration instructions earlier to have both the Pen and Eraser detected, as well as the touchscreen (all three must be detected); or else, this tool will not work.\n\nIf you want it always running, install the desktop file in your autostart to have it run on startup:\n\n```\n$ cp xnohands.desktop ~/.config/autostart/\n```\n\nPlease note that you can have both the thinkpad-helix-utils Toggle Touch and xnohands installed; but, do not use both at the same time. xnohands will \"re-activate\" the touchscreen as soon as you pull the pen away from the screen, defeating the purpose of Toggle Touch to keep touch disabled at all times.\n\n"
    },
    {
      "title": "Sensors",
      "level": 2,
      "content": "Install the package iio-sensor-proxy to expose the dbus events. For example, gnome will automatically utilize the dbus events exposed by the iio-sensor-proxy package to:\n\n- Adjust the display brightness when moving from dark to bright lighting\n- Automatically rotate the display based on orientation.\n\nSee the upstream source for more information about iio-sensor-proxy and how to configure/test its functionality.\n\n"
    },
    {
      "title": "Screen rotation",
      "level": 2,
      "content": "If you have both digitizers configured through the xf86-input-wacom driver and the iio-sensor-proxy package, they will automatically rotate with the display.\n\nAlternatively, you can use a simple command like xrandr --output eDP1 --rotate left to rotate the screen with ease.\n\nIf you want to use the bezel buttons (or some other hotkey) to cycle through orientations (or toggle between two specific ones), helix-rotate, also from from thinkpad-helix-utilsAUR, provides an easy-to-bind command that may serve your needs well.\n\nThere is also Magick Rotation, which is supposed to automatically rotate the screen based on input events, but it only seems to respond to docking/undocking the tablet.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Helpfully, Lenovo now provides bootable ISO images for the purpose of installing BIOS updates. While it is not stated on their site, these bootable images also include updated firmware for the keyboard dock MPU. It is uncertain as to whether the USB hub firmware is also updated via this utility.\n\nIf you do not have access to a USB optical drive and writable media, the information on ThinkWiki is extremely helpful.\n\n"
    }
  ]
}