{
  "title": "Lenovo ThinkPad X1 2-in-1 (Gen 9)",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_X1_2-in-1_(Gen_9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nAudio | 8086:7e28 | Yes\nFingerprint reader | 06cb:0123 | Yes\nGPU | 8086:7d45 | Yes\nNFC |  | No\nNPU | 8086:7d1d | Untested\nMobile Broadband | 1eac:1007 | Yes\nTouchpad |  | Yes\nTouchscreen |  | Yes\nTrackPoint |  | Yes\nWebcam | 30c9:005f | Yes\n\"Intel IPU6\" | Partial\nWireless | 8087:0033 | Yes\n\nThe 9th generation of the Lenovo Thinkpad X1 2-in-1 (formely X1 Yoga) is an Intel based 2-in-1 laptop with a 14 inch touchscreen introduced in 2024. The laptop screen can be folded over transforming the device in a tablet like tool while also including a stylus as an extra form of input. It uses the Intel Iris Xe graphics card and the 14th generation of Intel processors. One of the main changes is that the pen is not stored inside the housing but instead outside fixed with a magnet.\n\nTo ensure you have this version, install the package dmidecode and run:\n\n```\n# dmidecode -t system | grep Version\n```\n\n```\nVersion: ThinkPad X1 2-in-1 Gen 9\n```\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "This laptop features a UEFI interface that is driven with a mouse or touchscreen; however, this interface can be disabled in favor of a traditional keyboard interface which is more accessible to use. Blind users might need to request help from a sighted person in order to make this change initially, but once changed the interface is far more easily navigable.\n\nThe boot device can be changed out of the box without needing to access the UEFI menu during boot by hitting F12, though the menu is initially on a 10 second timer so it might be necessary to input an UP or DOWN after the menu loads if the user is using a screen reader or something else which might take time in order to provide the user feedback on which option to select.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "This laptop requires Sound Open Firmware in order to make the sound card working.\n\n"
    },
    {
      "title": "Fingerprint",
      "level": 2,
      "content": "The fingerprint reader works out of the box using fprintd. See Fprint.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Similar to Lenovo ThinkPad X1 Carbon (Gen 10)#Firmware, UEFI firmware and other device firmware is available through the Linux Vendor Firmware Service (LVFS), and can be installed using fwupd. Updates to the UEFI firmware include updates to the Intel Management Engine, so they may fail altogether if IME is disabled on the UEFI settings. A workaround for this is to temporarily enable IME, upgrade the firmware with fwupd, and disable IME after that.\n\nSecure boot works out of the box with custom keys from multiple tools, including sbctl.\n\nIntel Total Memory Encryption works out of the box by enabling it in the firmware configuration. Probably applies to vPro variants only.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "In the firmware configuration it is possible to swap the Ctrl and Fn keys.\n\nTable content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Toggles Fn lock\nFn+F1 | Yes | Yes | Toggles audio mute\nFn+F2 | Yes | Yes | Audio lower volume\nFn+F3 | Yes | Yes | Audio raise volume\nFn+F4 | Yes | Yes | Toogles microphone mute\nFn+F5 | Yes | Yes | Display brightness down\nFn+F6 | Yes | Yes | Display brightness up\nFn+F7 | Yes | Yes | Toggle display\nFn+F8 | No | Yes | Marked as Mode\nFn+F9 | Yes | Yes | Print screen\nFn+F10 | Yes | Yes | Launch2\nFn+F11 | No | Yes | Marked as Microsoft Phone Link\nFn+F12 | Yes | Yes | Favorites\nFn+Space | No | Yes | Toggles keyboard backlights\nFn+4 | Yes | No | System sleep\nFn+Left | Yes | No | Home\nFn+Right | Yes | No | End\nFn+l | No | No | Switch to low power mode\nFn+m | No | No | Switch to balanced/medium power mode\nFn+h | No | No | Switch to performance/high power mode\n\n1. The key is visible to showkey and similar tools. Wayland-only indicates the code can only be seen from a Wayland session.\n1. The physical key has a symbol on it, which describes its function.\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "The still experimental Xe driver works, see Intel graphics#Testing the new experimental Xe driver for more details.\n\n"
    },
    {
      "title": "Libinput",
      "level": 2,
      "content": "Touchpad, Trackpad, Touchscreen, and Wacom digitizer work out of the box using Libinput and Wayland.\n\n"
    },
    {
      "title": "NFC",
      "level": 2,
      "content": "The instruction on NFC did not work in my case and I was not able to even list the device using pcsc_scan -r.\n\n"
    },
    {
      "title": "Mobile Broadband",
      "level": 2,
      "content": "There are two models supported: Quectel EM160R-GL G2, and Quectel RM520N-GL. Both modules use a direct PCI connection instead of USB, and they are all integrated through the new \"wwan\" subsystem: the Qualcomm based ones are supported in the kernel since 5.13.\n\nPutting any other card will result in a \"unsupported network card\" message during POST following a forced shutdown.\n\nTable content:\nModel | FRU | P/N\nQuectel EM160R-GL G2 | 5W11H85449 | ?\nQuectel RM520N-GL | 5W11H85459 | 4XC1Q24435\n\nBoth card need the FCC unlock procedure as detailed in Mobile broadband modem#FCC locking.\n\nFor Quectel RM520N-GL that would be:\n\n```\n# ln -s /usr/share/ModemManager/fcc-unlock.available.d/1eac /etc/ModemManager/fcc-unlock.d/1eac:1007\n```\n\n"
    },
    {
      "title": "Webcam",
      "level": 2,
      "content": "There are two webcam types:\n\n- FHD 1080p camera - works out of the box\n- MIPI \"Computer Vision\" 2160p camera - does not work out of the box currently\n\nBecause webcam and display are treated as a single unit, the type is determined with the display option:\n\nTable content:\nDisplay | Webcam\n14\" WUXGA (1920 x 1200) | FHD 1080p\n14\" WUXGA (1920 x 1200) matte | FHD 1080p\n14\" 2,8K (2880 x 1800) OLED | MIPI \"Computer Vision\" 2160p\n14\" WUXGA (1920 x 1200) ePrivacy | MIPI \"Computer Vision\" 2160p\n\n"
    },
    {
      "title": "Brightness OLED Screen",
      "level": 2,
      "content": "Unlike previous OLED panels, the value written in /sys/class/backlight/intel_backlight/brightness defines the screen brightness. For the OLED version the maximum value is 400.\n\n"
    },
    {
      "title": "Performance modes",
      "level": 2,
      "content": "Lenovo supports 'platform-profiles', which can either greatly improve performance and throttling, or battery life and thermals. The default mode is \"balanced\" however users can switch between these modes using keyboard shortcuts:\n\n- Fn+l - Low-power mode\n- Fn+m - Balanced mode (aka Medium)\n- Fn+h - Performance mode (aka High)\n\nThe currently active mode can be checked with the following command:\n\n```\n# cat /sys/firmware/acpi/platform_profile\n```\n\nThe performance mode may also be queried and set using powerprofilesctl from power-profiles-daemon. See CPU frequency scaling#Userspace tools.\n\n"
    }
  ]
}