{
  "title": "Lenovo IdeaPad Flex 5 14IAU7",
  "url": "https://wiki.archlinux.org/title/Lenovo_IdeaPad_Flex_5_14IAU7",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nBluetooth | 8087:0026 | Yes\nWebcam | 04f2:b71f | Yes\nWireless | 8086:51f0 | Yes\nGPU | 8086:46a8 | Yes\nTouchpad |  | Yes\nTouchscreen |  | Yes\nFingerprint reader | 27c6:55b4 | Yes\nSD card reader | 1217:8621 | Yes\nAudio | 8086:51c8 | Yes\nAccelerometer |  | Yes\nTPM |  | Yes\n\nThe Lenovo IdeaPad Flex 5 14IAU7 is a convertible 2-in-1 laptop computer with a 14\" touch enabled display, powered by a 12th Gen Intel CPU with integrated graphics.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "To boot into BIOS: F2\n\nTo bring up the boot entry selection menu: F12\n\nRemember that in order to be able to boot from external USB, the following BIOS settings have to temporarily be adjusted as follows:\n\n- Security > Device Guard (Disabled)\n- Security > Natural File Guard (Disabled)\n- Boot > USB boot (Enabled)\n\n"
    },
    {
      "title": "Touch screen and pen",
      "level": 2,
      "content": "The touchscreen and pen are recognized by the input-wacom driver. For setup information look at Wacom. Pens that use the MPP 2.0 (Microsoft Pen Protocol 2.0) are not compatible with this device.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Lenovo provides .exe files for updating the BIOS and the Intel ME firmware. There is no way to update these through BIOS itself. These firmware updates are not available through LVFS so updating through fwupd is not an option. The only update that comes through LVFS is the UEFI keys database (for device: UEFI dbx).\n\nAs of March 2024 and fwupd version 1.9.15, flashing the BIOS update through Linux is not working. Using innoextract BIOS.exe to extract the contents of the BIOS firmware update file and trying to flash the .CAP file with fwupdtool install-blob BIOS.CAP DEVICE-ID would be an idea of doing this, but is still failing after rebooting to fwupd for the update process.\n\nThe easiest way to update is by booting a Windows OS and running the .exe files. For example:\n\n- Dual Boot Windows 10/11, then run the update.\n- Have Windows 11 installed in an external SSD or USB-stick and boot from it, then run the update.\n- Create your own Windows PE USB-stick (or image and use it for example with Ventoy), boot it, then run the update.\n- Grab a ready Windows PE image (like Hiren's BootCD) and flash it to a USB-stick (or use it for example with Ventoy), boot it, then run the update.\n\nKeep in mind that the \"Intel Management Engine Interface Driver\" needs to be installed before running the Intel ME firmware update, so remember to download it and have it accessible for install to the temporary Windows PE environment, every time you intent to update the Intel ME firmware.\n\nThe BIOS update has no driver prerequisites.\n\n"
    },
    {
      "title": "Fingerprint sensor",
      "level": 2,
      "content": "The fingerprint sensor is currently not supported by the official libfprint driver. However, there is a custom libfprint build that supports it (libfprint-goodixtls-55x4AUR, Source code. A prerequisite for the custom driver to work is to flash the fingerprint sensor with goodix-fp-dump, which is a custom firmware for it.\n\nRemember that, if you dual boot Windows 10 or 11, Windows is going to replace the original firmware of the fingerprint sensor at boot. If you want to disable this behavior, you can go to Device Manager in Windows and disable the fingerprint sensor device. This way, the fingerprint sensor firmware is going to remain untouched by Windows and the sensor is going to continue working on Linux. So, in practice, one has to choose which OS the fingerprint sensor is going to work with.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Flashing BIOS from Linux\n- Windows PE\n\n"
    }
  ]
}