{
  "title": "Libtool",
  "url": "https://wiki.archlinux.org/title/Libtool",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Arch Linux\n- Core utilities\n\nFrom Wikipedia:\n\nBecause the GNU kernel, Hurd, is not production-ready [1], GNU is usually used with the Linux kernel. Arch Linux is such a GNU/Linux distribution, using GNU software like the Bash shell, the GNU coreutils, the GNU toolchain and numerous other utilities and libraries. This page does not attempt to list all of the nearly 400 GNU packages and only highlights some.\n\n"
    },
    {
      "title": "Texinfo",
      "level": 2,
      "content": "GNU software is documented using the Texinfo typesetting syntax. You can view Info documents using the info program, provided by the texinfo package.\n\nWhile most GNU software also provides man pages, the Info documents tend to be more comprehensive. To view an Info document, simply enter:\n\n```\n$ info page_name\n```\n\n"
    },
    {
      "title": "Base system",
      "level": 2,
      "content": "- Bash — It is an sh-compatible shell that incorporates useful features from the Korn shell (ksh) and C shell (csh).\n\n- Coreutils — Coreutils provides the basic file, shell and text manipulation utilities of the GNU operating system.\n\n- GRUB — GRUB is the boot loader from the GNU project.\n\n- gzip — gzip is both a file format and a software application for compression and decompression.\n\n- tar — It provides the ability to create or decompress tar archives, as well as various other kinds of manipulation.\n\n"
    },
    {
      "title": "Toolchain",
      "level": 2,
      "content": "Most tools of the GNU toolchain are dependencies of the base-devel package, except glibc (required by base) and GDB.\n\n- Binutils — A set of programs to assemble and manipulate binary and object files. Includes ld.\n\n- Bison — The GNU general-purpose parser generator.\n\n- GCC — The GNU Compiler Collection - C and C++ frontends.\n\n- GDB — The GNU Debugger.\n\n- glibc — GNU's implementation of the C library.\n\n- m4 — The GNU macro processor.\n\n- make — GNU make utility to maintain groups of programs.\n\n"
    },
    {
      "title": "Build system",
      "level": 3,
      "content": "From Wikipedia:\n\n- Autoconf — Tool for automatically configuring source code.\n\n- Automake — Tool for automatically creating Makefiles.\n\n- Libtool — A generic library support script.\n\n"
    },
    {
      "title": "Other software",
      "level": 2,
      "content": "Many other optional GNU tools are available in the official repositories:\n\n- Aspell — A spell checker.\n\n- bc — An arbitrary precision calculator language.\n\n- ddrescue — A data recovery tool.\n\n- Emacs — An extensible, customizable, self-documenting text editor.\n\n- FreeFont — A free family of scalable outline fonts.\n\n- GIMP — An image editor.\n\n- GnuCash — An accounting program.\n\n- Gnumeric — A spreadsheet software.\n\n- GnuPG — An OpenPGP implementation.\n\n- Indent — C language source code formatting program.\n\n- Jami — Peer-to-peer communication solution.\n\n- LilyPond — A music engraving program.\n\n- Mailman — A mailing list manager.\n\n- Midnight Commander — A two-pane terminal file manager.\n\n- nano — A command-line text editor.\n\n- Ocrad — OCR program based on a feature extraction method.\n\n- Octave — A scientific programming language.\n\n- Parted — A partition manager.\n\n- plotutils — Set of utilities and libraries for plotting.\n\n- Readline — A line-editing library for command-line interfaces.\n\n- Screen — A terminal multiplexer.\n\n- Stow — Manage installation of multiple softwares in the same directory tree.\n\n- Units — Converts between different units.\n\n- Wget — Network utility to retrieve files from the web.\n\n- Zile — A lightweight clone of emacs.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- https://www.gnu.org/\n- The GNU Manifesto\n- Wikipedia:List of GNU packages\n- The Arch Hurd Project aims to port Arch Linux to the Hurd kernel.\n\n"
    }
  ]
}