{
  "title": "Logitech Gaming Keyboards",
  "url": "https://wiki.archlinux.org/title/Logitech_Gaming_Keyboards",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nSome Logitech Gaming Keyboards can work on Linux through Unofficial drivers. There are a few packages available\n\n- the python based Gnome15 project\n- the C based g15daemon project.\n- https://github.com/tolga9009/sidewinderd\n- https://github.com/Wattos/logitech-g710-linux-driver\n- https://github.com/MatMoul/g810-led\n- Animation support with C++ based Keyleds project.\n- Gkeys support for G910 Orion Spectrum/Spark: g910-gkeys-gitAUR (https://github.com/JSubelj/g910-gkey-macro-support), or a fork of it supporting M keys and their profile changing ability here (https://github.com/MR-R080T/g910-gkey-macro-support)\n- Some Logitech gaming mice and keyboards are remappable using libratbag and piper. The app includes basic LED led customization and a simple graphical interface.\n- LED customization support is available through openrgb for most keyboards.\n\n"
    },
    {
      "title": "Install",
      "level": 2,
      "content": "g15daemonAUR and its dependencies are available in the Arch User Repository (AUR). G15daemon drivers still work for the keyboards they supported, but their development was mostly dropped in 2008, the source is still available for anyone to pick up and continue their development, there are a few bugs in them that were never solved. These drivers use the g15macroAUR to interact with the G keys. There is also a g15statsAUR plugin to show system information on the LCD display.\n\nsidewinderdAUR\n\nhid-lg-g710-plus-dkms-gitAUR\n\nkeyledsAUR is available through Arch User Repository. Detailed configuration, effects and LUA scripting are in the project's documentation.\n\n"
    },
    {
      "title": "Supported Models",
      "level": 3,
      "content": "g15daemon supports:\n\n- G15 (Orange and Blue)\n- G11\n- Gamepad\n- G510 (Requires Patching; Read below)\n\nGnome15[dead link 2023-10-29 ⓘ] has a list of supported devices on its front page. The keyboards are:\n\n- G19\n- G19s\n- G15 (Orange and Blue)\n- G13\n- G110\n- G510 and G510s (Partial)\n\nsidewinderdAUR supports:\n\n- G710 / G710+\n- G105\n- (and Microsoft SideWinder X4 / X6, hence name)\n\nhid-lg-g710-plus-dkms-gitAUR supports:\n\n- Logitech G710 / G710+\n\ng810-led-gitAUR[broken link: package not found] [1][2] led supports:\n\n- G213\n- G410\n- G413\n- G512\n- G513\n- G610\n- G810\n- G815\n- G910\n- GPRO\n\nkeyledsAUR led supports (possible lua scripting):\n\n- G410\n- G610\n- G810\n- G910\n- GPro\n\n"
    },
    {
      "title": "G510 on g15daemon",
      "level": 2,
      "content": "Forum Thread (This thread has more detailed instructions and might be helpful for readers from other distributions or less advanced users, it also contains a list of known issues.)\n\nNote: **lsusb** \n\nA patch was written to make the G510 keyboard fully compatible with the g15daemon drivers. It is however not compatible with g15macro and as such an alternative approach was needed (which involved heavy modifications of the original code) the result yields much better performance for than using the gnome15 drivers which can currently result in severe input lag for this keyboard.\n\nTo apply the patch you must download the g15daemonAUR and libg15AUR sources.\n\nThen download the libg15 and g15daemon patches and modify to your will. The color profiles per M-Led settings are hard coded into the libg15 patch at line 341, 344, 347 and 350 in R,G,B color code.\n\nThen place the files (libg15.patch and g15daemon.patch) into the folders that your packages were downloaded into, after this you must replace the PKGBUILDS with the new ones: g15daemon, libg15 These new PKGBUILDS refer to local sources only, this means they do not fetch sources from the net if they are not present so make sure you hold on to your tar.bz2 files. If you want them to fetch these from the net you can refer to the original PKGBUILDs.\n\nNow install the packages, libg15AUR comes first, libg15renderAUR is required as well before you install g15daemon:\n\n```\n$ makepkg -fic\n```\n\nThis will compile, install and clean up the extracted sources afterwards to avoid cluttering the folder. I also recommend installing g15statsAUR from AUR next. For fluff.\n\nAfter the installation you need to create the macro script files, and place them into /usr/share/g15daemon/macros. If you want to create them yourself the files need to be executable and the filenames are corresponding to the label on each key (so for the G1 key use /usr/share/g15daemon/macros/G1). Normally these files should use the bash script syntax.\n\nFor commands on the G keys to work with graphical applications g15daemon must be started after the X11 session. To do this you must add these commands to your autostart/xinitrc:\n\n```\n$ sudo g15daemon && sleep 3 && g15stats\n```\n\nAnd congratulations! you have a working G510 keyboard on Linux :) With a few issues of course (known issues are in the forum thread linked to at the start of this section)\n\n"
    }
  ]
}