{
  "title": "Machine Check Exceptions",
  "url": "https://wiki.archlinux.org/title/Machine_Check_Exceptions",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "This article aims to help users implement services to actively monitor, log, and report hardware errors. A machine check exception (MCE) is an error generated by the CPU when the CPU detects that a hardware error or failure has occurred.\n\nMachine check exceptions (MCEs) can occur for a variety of reasons ranging from undesired or out-of-spec voltages from the power supply, from cosmic radiation flipping bits in memory DIMMs or the CPU, or from other miscellaneous faults, including faulty software triggering hardware errors.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the rasdaemonAUR package. rasdaemon written by Mauro Carvalho Chehab is one of the tools to gather MCE information.\n\nPreviously, the task was performed by the mcelog package. However, it has been deprecated, and Arch kernels are not even compiled with the necessary configuration option CONFIG_X86_MCELOG_LEGACY (FS#55657) now.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "There are two systemd services that need to be started and enabled. ras-mc-ctl.service registers DIMM labels (from /etc/ras/dimm_labels.d/) with EDAC drivers. On consumer-grade motherboards it usually logs a No dimm labels for <motherboard model> error and does nothing. rasdaemon.service runs as a daemon and logs RAS events to systemd journal.\n\nSee ras-mc-ctl(8) and rasdaemon(1) for more information.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "You can use ras-mc-ctl --error-count and ras-mc-ctl --summary to quickly glance at the recorded errors. Errors are logged to the journal as well as the sqlite database at /var/lib/rasdaemon/ras-mc_event.db.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:Machine_Check_Exception\n- Wikipedia:Machine_check_architecture\n- Rasdaemon initial announcement\n- Monitoring ECC memory on Linux with rasdaemon\n\n"
    },
    {
      "title": "Hardware documentation",
      "level": 3,
      "content": "- AMD64 Architecture Programmer's Manual, Volume 2: System Programming\n- BIOS and Kernel Developer's Guide for AMD Athlon™ 64 and AMD Opteron™ Processors\n\n"
    }
  ]
}