{
  "title": "Megafuse",
  "url": "https://wiki.archlinux.org/title/Megafuse",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- File systems\n\nFilesystem in Userspace (FUSE) is a mechanism for Unix-like operating systems that lets non-privileged users create their own file systems without editing kernel code. This is achieved by running file system code in user space, while the FUSE kernel module provides only a \"bridge\" to the actual kernel interfaces.\n\n"
    },
    {
      "title": "Unmounting",
      "level": 2,
      "content": "FUSE filesystems can be unmounted using fusermount3(1) provided by fuse3 or using fusermount(1) provided by fuse2. E.g.:\n\n```\n$ fusermount3 -u mountpoint\n```\n\n"
    },
    {
      "title": "List of FUSE filesystems",
      "level": 2,
      "content": "- adbfs-rootless — Mount an Android device connected via USB.\n\n- apfs-fuse — FUSE driver for APFS (Apple File System).\n\n- astreamfs — A(synchronous) Stream(ing) (fuse) F(ile)S(ystem).\n\n- AVFS — A Virtual File System that allows browsing compressed files (archives).\n\n- bindfs — A FUSE filesystem for mirroring a directory to another directory, similar to mount --bind, with permission settings.\n\n- CurlFtpFS — Filesystem for accessing FTP hosts based on FUSE and libcurl.\n\n- davfs2 — File system driver that allows you to mount a WebDAV folder.\n\n- EncFS — Userspace stackable cryptographic file-system.\n\n- fuse-archive — Serves an archive or compressed file as a read-only FUSE file system.\n\n- fuseiso — Mount an ISO as a regular user.\n\n- gitfs — gitfs is a FUSE file system that fully integrates with git.\n\n- gocryptfs — gocryptfs is a userspace stackable cryptographic file-system.\n\n- google-drive-ocamlfuse — FUSE-based file system backed by Google Drive, written in OCaml.\n\n- gphotofs — FUSE module to mount camera as a filesystem.\n\n- HubicFuse — FUSE filesystem to access HubiC cloud storage.\n\n- iFuse — A fuse filesystem to access the contents of an iPhone or iPod Touch.\n\n- mtpfs — A fuse filesystem for reading and writing any MTP device.\n\n- NTFS-3G — NTFS driver with extended capabilities.\n\n- rclone — Mount a remote file system on a mountpoint.\n\n- s3fs — FUSE-based file system backed by Amazon S3.\n\n- SSHFS — FUSE-based filesystem client for mounting directories over SSH.\n\n- TMSU — A command-line tool for tagging your files and accessing them through a virtual filesystem.\n\n- UFSv2 — FreeBSD's Unix File System UFSv2.\n\n- vdfuse — Mounting VirtualBox disk images (VDI/VMDK/VHD).\n\n- vramfs — VRAM based file system.\n\n- wimmount — Mount Windows Imaging Format (WIM) images.\n\n- xbfuse — Mount an Xbox (360) ISO.\n\n- xmlfs — Represent an XML file as a directory structure for easy access.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:Filesystem in Userspace#Applications\n\n"
    }
  ]
}