{
  "title": "Minecraft-Server",
  "url": "https://wiki.archlinux.org/title/Minecraft-Server",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\n- Does not follow the conventional format for most pages, encapsulates a lot of different software, which gets highly confusing whether this is a minecraft install guide or whether this is a package page\n- These guides and troubleshooting should be split off into dedicated pages to be more clear. Compressing them all into a single page is messy and hard to find the information you want.\n- The page would benefit from the use of a \"software\" category, listing all the software, and linking to the dedicated page if there is one for it.\n\nMinecraft is a game about breaking and placing blocks. At first, people built structures to protect against nocturnal monsters, but as the game grew, players worked together to create wonderful, imaginative things.\n\nThere are two separate editions of this game: Minecraft Java Edition, and Bedrock Edition. Java Edition is the original version of the game, starting development back in 2009. This edition can be played on Mac, Windows and Linux. Bedrock Edition was originally Pocket Edition, but has since been ported to different platforms. It is currently supported on Windows 10 and 11, Amazon FireOS and FireTV, Android, iOS, Xbox One, Playstation 4, Nintendo Switch and Samsung Gear VR devices. The Bedrock Edition client is not supported on Linux officially, but Bedrock server software is available.\n\n"
    },
    {
      "title": "Installation",
      "level": 4,
      "content": "The Minecraft client can be installed via the minecraft-launcherAUR package. It provides the official game launcher, a script to launch it and a .desktop file. The package is officially recommended by Mojang on their website.\n\n"
    },
    {
      "title": "Firewall configuration for Client/LAN worlds",
      "level": 4,
      "content": "Most shared Minecraft worlds are hosted using dedicated Minecraft servers. For more information about hosting dedicated servers, see the #Server section below.\n\nA simpler way is to allow others to join your current Minecraft game. When playing, your Minecraft client also allows others to join the game in progress. Your client automatically broadcasts the info about your game on port 4445. It will also listen for TCP connections on which other players join. This TCP listening port is picked at random every time you start Minecraft. This works well if you do not have a firewall. But if your firewall blocks incoming TCP connections, then it is very tricky to allow this random port in.\n\nTo allow your client to host a local LAN game, your firewall needs to allow:\n\n- UDP port 4445 to broadcast your game.\n- A TCP port to allow friends to join your game.\n\nSee also:\n\n- Setting up a LAN world.\n\n"
    },
    {
      "title": "Bedrock Edition",
      "level": 3,
      "content": "The unofficial Bedrock Minecraft client can be installed by mcpelauncher-uiAUR package, which is the UI interface for mcpelauncher-linuxAUR. Alternatively, the upstream appimage can be used by mcpelauncher-appimageAUR. The launcher can also be used by an appimage provided on the GitHub page.\n\n"
    },
    {
      "title": "Minecraft Education",
      "level": 3,
      "content": "Minecraft Education can be used as an alternative way of running Minecraft with online features stripped out, since the code is mostly based on the Minecraft for Windows 10 edition (i.e. a win32 codebase).\n\nIt can be installed manually and runs fine with Wine or Proton.\n\nAdditionally, Minecraft Education can be used as a gateway to Minecraft RTX running on Linux using vkd3d (This is exclusive to the Microsoft store, x64 release of Minecraft Education).\n\n"
    },
    {
      "title": "Java Edition",
      "level": 3,
      "content": "See Minecraft/Java Edition server for more information on how to set up a Minecraft Java server.\n\n"
    },
    {
      "title": "Installation",
      "level": 4,
      "content": "The Bedrock Minecraft server can be installed via the minecraft-bedrock-serverAUR package. It provides a systemd unit file. This package creates a separate minecraft-bedrock account.\n\nTo start the server, you may either use systemd or run it directly from the command line. Using systemd, you may start and enable the included minecraft-bedrock-server.service. Alternatively, run the following as the minecraft-bedrock user inside the /opt/minecraft-bedrock-server directory:\n\n```\n$ LD_LIBRARY_PATH=. ./bedrock_server\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 4,
      "content": "The configuration file server.properties contains the server settings and additional documentation. Most importantly, server-port determines the UDP port at which the server will listen for incoming connections. The default port is 19132 for IPv4, and 19133 for IPv6. UDP ports 43351 for IPv4 and 51885 for IPv6 are required for authentication.\n\n"
    },
    {
      "title": "Minecraft mod launchers",
      "level": 2,
      "content": "You can launch Minecraft from different so called launchers that often include an array of modpacks to enhance one's gameplay and add mods.\n\n- ATLauncher — Minecraft ModPack launcher consisting of multiple different modpacks made by the community.\n\n- Badlion Client — PvP modpack for all modern versions of Minecraft.\n\n- CheatBreaker Client — The free FPS boosting modpack for Minecraft 1.7 & 1.8\n\n- Feed The Beast — Originated as a custom challenge map in Minecraft that made heavy use of multiple tech mods, and later evolved into a mod package launcher.\n\n- GDLauncher — Open-source Minecraft launcher written in Electron/React.\n\n- Hello Minecraft Launcher — Open-source Minecraft launcher supports Mod Management, Game Customizing, Auto Installing, Modpack Creating, UI Customization...\n\n- Labymod Launcher — LabyMod Launcher for launching LabyMod, which is a Minecraft client that adds bunch of useful features\n\n- Lunar Client — PvP modpack for all modern versions of Minecraft.\n\n- Modrinth Launcher — The open-source, lightweight and official Modrinth launcher.\n\n- MultiMC — Sandbox environment manager for separable pack association.\n\n- PolyMC — Power user launcher with features like mod management. Originally forked from MultiMC.\n\n- Prism Launcher — Power user launcher with features like mod management. Originally forked from MultiMC, now forked from PolyMC.\n\n- Technic Launcher — Modpack installer with a focus on mod discovery via popularity rankings.\n\n"
    },
    {
      "title": "Other programs and editors",
      "level": 2,
      "content": "There are several programs and editors which can make your Minecraft experience a little easier to navigate. The most common of these programs are map generators. Using one of these programs will allow you to load up a Minecraft world file and render it as a 2D image, providing you with a top-down map of the world.\n\n- AMIDST — Standing for Advanced Minecraft Interface and Data/Structure Tracking, it is a program that aids in the process of finding structures, biomes, and players in Minecraft worlds. It can draw the biomes of a world out and show where points of interest are likely to be by either giving it a seed, telling it to make a random seed, or having it read the seed from an existing world (in which case it can also show where players in that world are). The project has been forked in the past, of which the most notable one is \"Amidst Exporter\" (amidstexporterAUR) which includes a patch for calculating Ocean Monument locations in 1.8+ worlds.\n\n- Mapcrafter — A high performance Minecraft map renderer written in C++ which renders worlds to maps with an 3D-isometric perspective. You can view these maps in any webbrowser hence they are easily deployed on one's server. Mapcrafter has a simple configuration file format to specify worlds to render, different rendermodes such as day/night/cave and can also render worlds from different rotations.\n\n- Minutor — A minimalistic map generator for Minecraft. You are provided with a simple GTK based interface for viewing your world. Several rendering modes are available, as well as custom coloring modes and the ability to slice through z-levels.\n\n"
    },
    {
      "title": "Logs",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Minecraft/Java Edition server.** This article or section is a candidate for merging with Minecraft/Java Edition server.\n\nThis article or section is a candidate for merging with Minecraft/Java Edition server.\n\nScreen logs are in /tmp/spigot_spigot_command_dump.txt file. If systemctl fails to start the service, inspect the screen logs.\n\nJournal logs are under spigot.service.\n\n"
    },
    {
      "title": "Client or server does not start",
      "level": 3,
      "content": "It might be a problem with the Java version. Different Minecraft version numbers have different JRE requirements.\n\nTable content:\nMinecraft Version | Minimum Compatible JRE Version\n< 1.17 | 8\n1.17 | 16\n<= 1.20.4 | 17\n> 1.20.4 | 21\n\nNote that the client/server work with newer versions of Java, such as jre-openjdk, but the Minecraft game launcher (and possibly mods) might only work with Java version 8.\n\n"
    },
    {
      "title": "Broken fonts with MinecraftForge",
      "level": 3,
      "content": "Force Unicode fonts from the language menu.\n\nSince you cannot read any of the menu options: in the main menu, choose the bottom-left most button is Options, second-from-the-bottom on the left side is the Language Button. From there, the Force Unicode Font button is on the bottom, on the left side.\n\n"
    },
    {
      "title": "MultiMC forks unable to build",
      "level": 3,
      "content": "If you are trying to install one of multimc5 forks like (polymcAUR) and get an error similar to:\n\n```\nNo CMAKE_Java_COMPILER could be found.\nTell CMake where to find the compiler by setting either the environment\nvariable \"JAVA_COMPILER\" or the CMake cache entry CMAKE_Java_COMPILER to\nthe full path to the compiler, or to the compiler name if it is in the\nPATH.\n```\n\nThe error could be caused by Java missing, which can be fixed by installing jdk8-openjdk. If the error is not fixed by that or Java was properly installed in the first place, the wrong version could still be the default environment:\n\n```\n$ archlinux-java status\n```\n\n```\nAvailable Java environments:\n  java-13-openjdk (default)\n  java-8-openjdk\n```\n\nYou can set the default java version using archlinux-java set version.\n\n"
    },
    {
      "title": "Cannot change pulseaudio sink",
      "level": 3,
      "content": "If you are unable to switch the audio output device (indicated by DONT_MOVE flag in the output of pacmd list-sink-inputs), then the following openalsoft config may help\n\n```\n~/.alsoftrc\n```\n\n```\n[pulse]\nallow-moves=yes\n```\n\n"
    },
    {
      "title": "Audio stutters on PipeWire or Java crashes with SIGFPE",
      "level": 3,
      "content": "OpenAL defaults to using JACK over PipeWire's PulseAudio backend. If that causes issues for you, you can tell OpenAL to use Pulse instead:\n\n```\n~/.alsoftrc\n```\n\n```\ndrivers=pulse\n```\n\nAlternatively, you can set the following environment variable ALSOFT_DRIVERS=pulse if you do not want to set it for all applications.\n\n"
    },
    {
      "title": "Minecraft does not start on native Wayland",
      "level": 3,
      "content": "You may see an error like GLFW error 65548: Wayland: The platform does not support setting the window icon.\n\nThis is because of the version of GLFW bundled with Minecraft defaulting to X. If you do not want to use Xwayland, you can resolve this by using the system installation of glfw:\n\n- For MultiMC-based launchers (like prismlauncher) check Workarounds > Native Settings > Use system GLFW in the instance settings.\n- For others, add -Dorg.lwjgl.glfw.libname=/usr/lib/libglfw.so to the java command in the settings.\n\n- There is a bug present which will prevent the cursor from being centered when opening menus, leading to a suboptimal experience. This can be fixed by installing glfw-wayland-minecraft-cursorfixAUR.\n- You can use VulkanMod to add native support for Wayland.\n\n"
    },
    {
      "title": "2 and 6 do not work when pressed in combination with shift on legacy versions",
      "level": 3,
      "content": "This is a problem caused by LWGLJ2. There are a few ways to fix it:\n\n- Use a client that uses an updated version of LWGLJ or adds the patch themselves.\n- Switch keyboard layout to a different one (e.g. German).\n- Use mods to fix it. On 1.8.9 Forge, you can use mckeyboardfix.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Minecraft site\n- Minecraft community links\n- Minecraft Wiki\n- Minecraft Client and Server download link\n- Crafting Recipes\n- Block and item data values\n- Reddit Minecraft community\n- Minecraft Skins\n\n"
    }
  ]
}