{
  "title": "Modules du noyau",
  "url": "https://wiki.archlinux.org/title/Modules_du_noyau",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- General troubleshooting (Français)#Problèmes de démarrage\n- Noyau\n- Kernel parameters\n- Compile kernel module\n\nModules du noyau sont des morceaux de code qui peuvent être chargés et déchargés dans le noyau à la demande. Ils étendent les fonctionnalités du noyau sans qu'il soit nécessaire de redémarrer le système.\n\nPour créer un module de noyau, vous pouvez lire le Guide de programmation des modules du noyau Linux. Un module peut être configuré comme intégré ou chargeable. Pour charger ou supprimer dynamiquement un module, il doit être configuré comme un module chargeable dans la configuration du noyau (la ligne relative au module affichera donc la lettre M).\n\n"
    },
    {
      "title": "Obtenir des informations",
      "level": 2,
      "content": "Les modules sont stockés dans /usr/lib/modules/kernel_release. Vous pouvez utiliser la commande uname -r pour obtenir la version actuelle de votre noyau.\n\nPour montrer quels modules du noyau sont actuellement chargés :\n\n```\n$ lsmod\n```\n\nPour afficher des informations sur un module :\n\n```\n$ modinfo nom_du_module\n```\n\nPour lister les options qui sont définies pour un module chargé :\n\n```\n$ systool -v -m nom_du_module\n```\n\nPour afficher la configuration complète de tous les modules :\n\n```\n$ modprobe -c | less\n```\n\nPour afficher la configuration d'un module particulier :\n\n```\n$ modprobe -c | grep nom_du_module\n```\n\nLister les dépendances d'un module (ou alias), y compris le module lui-même :\n\n```\n$ modprobe --show-depends nom_du_module\n```\n\n"
    },
    {
      "title": "Chargement automatique des modules",
      "level": 2,
      "content": "Aujourd'hui, tous les chargements de modules nécessaires sont gérés automatiquement par udev, donc si vous n'avez pas besoin d'utiliser de modules noyau hors-arbre, il n'est pas nécessaire de mettre les modules qui doivent être chargés au démarrage dans un fichier de configuration. Cependant, il y a des cas où vous pouvez vouloir charger un module supplémentaire pendant le processus de démarrage, ou en mettre un autre sur liste noire pour que votre ordinateur fonctionne correctement.\n\n"
    },
    {
      "title": "systemd",
      "level": 3,
      "content": "Les modules du noyau peuvent être explicitement listés dans des fichiers sous /etc/modules-load.d/ pour que systemd les charge pendant le démarrage. Chaque fichier de configuration est nommé dans le style de /etc/modules-load.d/program.conf. Les fichiers de configuration contiennent simplement une liste de noms de modules du noyau à charger, séparés par des nouvelles lignes. Les lignes vides et les lignes dont le premier caractère non espace est # ou ; sont ignorées.\n\n```\n/etc/modules-load.d/virtio-net.conf\n```\n\n```\n# Chargement de virtio_net.ko au démarrage\nvirtio_net\n```\n\nConsultez modules-load.d(5) pour plus de détails.\n\n"
    },
    {
      "title": "Chargement précoce des modules",
      "level": 3,
      "content": "L'image initramfs peut ne pas contenir les modules du noyau demandés dans /etc/modules-load.d/, il peut également manquer les fichiers qui ont été définis dans ce dossier. Le chargement précoce des modules dépend du générateur d'initramfs utilisé :\n\n- mkinitcpio : consultez Mkinitcpio (Français)#MODULES\n- dracut : consultez Dracut#Early kernel module loading\n- booster : consultez Booster#Early module loading\n\n"
    },
    {
      "title": "Gestion manuelle des modules",
      "level": 2,
      "content": "Les modules du noyau sont gérés par des outils fournis par le paquet kmod. Vous pouvez utiliser ces outils manuellement.\n\nPour charger un module :\n\n```\n# modprobe nom_du_module\n```\n\nPour charger un module par nom de fichier (c'est-à-dire un module qui n'est pas installé dans /usr/lib/modules/$(uname -r)/) :\n\n```\n# insmod filename [args]\n```\n\nPour décharger un module :\n\n```\n# modprobe -r nom_du_module\n```\n\nOu, alternativement :\n\n```\n# rmmod nom_du_module\n```\n\n"
    },
    {
      "title": "Définir les options du module",
      "level": 2,
      "content": "Pour passer un paramètre à un module du noyau, vous pouvez le faire manuellement avec modprobe ou vous assurer que certains paramètres sont toujours appliqués en utilisant un fichier de configuration modprobe ou en utilisant la ligne de commande du noyau.\n\n"
    },
    {
      "title": "Manuellement au moment du chargement à l'aide de modprobe",
      "level": 3,
      "content": "La manière de base de passer des paramètres à un module est d'utiliser la commande modprobe. Les paramètres sont spécifiés sur la ligne de commande en utilisant de simples key=value assignations :\n\n```\n# modprobe nom_du_module nom_du_paramètre=valeur_du_paramètre\n```\n\n"
    },
    {
      "title": "Utilisation des fichiers dans /etc/modprobe.d/",
      "level": 3,
      "content": "Les fichiers du répertoire /etc/modprobe.d/ peuvent être utilisés pour transmettre les paramètres des modules à udev, qui utilisera modprobe pour gérer le chargement des modules lors du démarrage du système. Les fichiers de configuration dans ce répertoire peuvent avoir n'importe quel nom, du moment qu'ils se terminent par l'extension .conf. La syntaxe est la suivante :\n\n```\n/etc/modprobe.d/myfilename.conf\n```\n\n```\noptions nom_du_module nom_du_paramètre=valeur_du_paramètre\n```\n\nPar exemple :\n\n```\n/etc/modprobe.d/thinkfan.conf\n```\n\n```\n# Sur les ThinkPads, cela permet au daemon 'thinkfan' de contrôler la vitesse du ventilateur.\noptions thinkpad_acpi fan_control=1\n```\n\n"
    },
    {
      "title": "Utilisation de la ligne de commande du noyau",
      "level": 3,
      "content": "Si le module est intégré au noyau, vous pouvez également passer des options au module en utilisant la ligne de commande du noyau. Pour tous les chargeurs d'amorçage courants, la syntaxe suivante est correcte :\n\n```\nnom_du_module.nom_du_paramètre=valeur_du_paramètre\n```\n\nPar exemple\n\n```\nthinkpad_acpi.fan_control=1\n```\n\nAjoutez simplement ceci à la ligne de commande du noyau de votre chargeur d'amorçage, comme décrit dans Paramètres du noyau.\n\n"
    },
    {
      "title": "Aliasing",
      "level": 2,
      "content": "Les alias sont des noms alternatifs pour un module. Par exemple : alias my-mod really_long_modulename signifie que vous pouvez utiliser modprobe my-mod au lieu de modprobe really_long_modulename. Vous pouvez également utiliser des caractères génériques de type shell, ainsi alias my-mod* really_long_modulename signifie que modprobe my-mod-something a le même effet. Créez un alias :\n\n```\n/etc/modprobe.d/myalias.conf\n```\n\n```\nalias monmod nom_de_module_très_long\n```\n\nCertains modules ont des alias qui sont utilisés pour les charger automatiquement lorsqu'ils sont nécessaires à une application. La désactivation de ces alias peut empêcher le chargement automatique mais permettra toujours le chargement manuel des modules.\n\n```\n/etc/modprobe.d/modprobe.conf\n```\n\n```\n# Empêcher le chargement automatique de Bluetooth\nalias net-pf-31 off\n```\n\n"
    },
    {
      "title": "Liste noire",
      "level": 2,
      "content": "La liste noire, dans le contexte des modules du noyau, est un mécanisme permettant d'empêcher le chargement du module du noyau. Cela peut être utile si, par exemple, le matériel associé n'est pas nécessaire, ou si le chargement de ce module pose des problèmes : par exemple, il peut y avoir deux modules de noyau qui essaient de contrôler la même pièce de matériel, et les charger ensemble entraînerait un conflit.\n\nCertains modules sont chargés en tant que partie de l'initramfs. mkinitcpio -M affichera tous les modules détectés automatiquement : pour empêcher l'initramfs de charger certains de ces modules, mettez-les sur liste noire dans un fichier .conf sous /etc/modprobe.d et il sera ajouté par le hook modconf pendant la génération de l'image. L'exécution de mkinitcpio -v listera tous les modules ajoutés par les différents hooks (par exemple, le hook filesystems, le hook block, etc.) N'oubliez pas d'ajouter ce fichier .conf au tableau FILES de /etc/mkinitcpio.conf si vous n'avez pas le hook modconf dans votre tableau HOOKS (par exemple si vous avez dévié de la configuration par défaut), et une fois que vous avez mis les modules sur liste noire régénérez l'initramfs, et redémarrez ensuite.\n\n"
    },
    {
      "title": "Utilisation des fichiers dans /etc/modprobe.d/",
      "level": 3,
      "content": "Créez un fichier .conf dans /etc/modprobe.d/ et ajoutez une ligne pour chaque module que vous voulez mettre sur liste noire, en utilisant le mot-clé blacklist. Si par exemple vous voulez empêcher le chargement du module pcspkr pour éviter les sons avec le bipeur du PC :\n\n```\n/etc/modprobe.d/nobeep.conf\n```\n\n```\n# Ne pas charger le module 'pcspkr' au démarrage.\nblacklist pcspkr\n```\n\nNote: Cependant, il existe une solution de contournement pour ce comportement ; la commande install demande à modprobe d'exécuter une commande personnalisée au lieu d'insérer le module dans le noyau normalement, de sorte que vous pouvez forcer le module à toujours échouer au chargement avec :\n\nCependant, il existe une solution de contournement pour ce comportement ; la commande install demande à modprobe d'exécuter une commande personnalisée au lieu d'insérer le module dans le noyau normalement, de sorte que vous pouvez forcer le module à toujours échouer au chargement avec :\n\n```\n/etc/modprobe.d/blacklist.conf\n```\n\n```\n...\ninstall nom_du_module /bin/true\n...\n```\n\n"
    },
    {
      "title": "Utilisation de la ligne de commande du noyau",
      "level": 3,
      "content": "Vous pouvez également mettre les modules sur liste noire à partir du chargeur d'amorçage.\n\nAjoutez simplement module_blacklist=modname1,modname2,modname3 à la ligne de commande du noyau de votre chargeur d'amorçage, comme décrit dans Paramètres du noyau.\n\n"
    },
    {
      "title": "Les modules ne se chargent pas",
      "level": 3,
      "content": "Dans le cas où un module spécifique ne se charge pas et que le journal de démarrage (accessible en exécutant journalctl -b en tant que root) indique que le module est sur liste noire, mais que le répertoire /etc/modprobe.d/ ne montre pas d'entrée correspondante, vérifiez dans un autre répertoire source de modprobe à /usr/lib/modprobe.d/ les entrées de liste noire.\n\nUn module ne sera pas chargé si la chaîne \"vermagic\" contenue dans le module du noyau ne correspond pas à la valeur du noyau en cours d'exécution. Si l'on sait que le module est compatible avec le noyau en cours d'exécution, la vérification de \"vermagic\" peut être ignorée avec modprobe --force-vermagic.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Désactiver le bip du haut-parleur du PC\n- Writing a WMI driver - an LWM introduction (en anglais)\n\n"
    }
  ]
}