{
  "title": "Movim",
  "url": "https://wiki.archlinux.org/title/Movim",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Movim is a browser based XMPP client. Movim is designed to be easy to use, quick to get started using their publically hosted instance. Movim aims to be a powerful replacement to social media by providing blogging features, as well as being an XMPP client.\n\nMovim is Free and Open Source Software licensed under AGPL3.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the movimAUR package.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\n"
    },
    {
      "title": "Public instances",
      "level": 3,
      "content": "Mov.im - Officially hosted instance of movim provided by the movim developers.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Since 0.20, all configuration is done through /etc/movim.env.\n\n"
    },
    {
      "title": "Reverse proxy",
      "level": 3,
      "content": "Movim's development team has an amazing guide on setting up a reverse proxy for movim, please see [1]. The guide supports the following web servers:\n\n- nginx\n- apache\n- caddy\n\n"
    },
    {
      "title": "Images are not OMEMO encrypted",
      "level": 3,
      "content": "Movim does not currently support encryption of HTTP uploads, thus images and other media posted will not be encrypted using OMEMO. This is not to say that they are still not secure, as TLS encryption will still be in use. This feature is being worked on but has no tracking issue to follow its progression.\n\n"
    },
    {
      "title": "Messages are \"gibberish\"",
      "level": 3,
      "content": "If the message is red, and it seems to make no apparent sense, like a cat has been walking over your friends keyboard, this is due to them using OMEMO encryption (end to end encryption), the message was not encrypted for your client and thus you are unable to decrypt it. To fix this, movim does key exchange when OMEMO is enabled, so enabling OMEMO encryption and then sending your friend a message such as \"could not decrypt your messages, please send them again\" should solve this issue.\n\nAs a warning, movim does have issues with OMEMO encryption due to the complexity of the XEP, it is being constantly improved. If you find a bug, do not hesitate to report it on movim's Issue Tracker.\n\n"
    },
    {
      "title": "Cannot enable OMEMO encryption",
      "level": 3,
      "content": "In order to enable OMEMO encryption, you must have your friend added as a contact, and visa versa, once this has been achieved a lock icon at the end of the message input box should appear, click this to enable OMEMO encryption.\n\n"
    }
  ]
}