{
  "title": "MuPDF",
  "url": "https://wiki.archlinux.org/title/MuPDF",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- llpp\n- zathura\n- List of applications/Documents#Readers and viewers\n\nMuPDF is a lightweight document viewer and toolkit written in portable C. It can render PDF, XPS, EPUB, XHTML, CBZ, and various image formats such as PNG, JPEG, GIF, and TIFF. Native Wayland support is not planned yet.\n\nThe renderer in MuPDF is tailored for high quality anti-aliased graphics. It renders text with metrics and spacing accurate to within fractions of a pixel for the highest fidelity in reproducing the look of a printed page on screen.\n\nMuPDF supports all static functions required by PDF 1.7 and is a lightweight alternative to poppler based pdf applications. It also support standard PDF annotations such as highlight, shape tools, drawing, notes and file attachment.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the mupdf package or mupdf-gl for the OpenGL backend and mupdf-gitAUR for the development version. For the document manipulation tools install the mupdf-tools package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nSee mupdf --help or mupdf(1) and mutool(1) for more information.\n\nThe application is started either from the command-line with mupdf filename.pdf or from a file manager.\n\nNavigation within a document works with standard keyboard shortcuts and mouse interaction. For example, B and Space scroll up and down.\n\n"
    },
    {
      "title": "MuPDF",
      "level": 3,
      "content": "Supported arguments are -d password for required passwords, -z N% for the zoom level and -p N for the first selected page and more.\n\nWhen zoomed in, the document can be moved by using the left mouse button. Pressing the right mouse button while moving the mouse will mark an area, and all text will be copied and can be inserted by clicking the middle mouse button.\n\n"
    },
    {
      "title": "MuPDF GL",
      "level": 3,
      "content": "Press I to invert colours. See https://mupdf.readthedocs.io/en/latest/mupdf-command-line.html#mupdf-gl for the manual or press F1 for help.\n\n"
    },
    {
      "title": "Set as default PDF viewer",
      "level": 3,
      "content": "```\n$ xdg-mime default mupdf.desktop application/pdf\n```\n\nFor more information on setting default applications see XDG MIME Applications.\n\n"
    },
    {
      "title": "Annotation Support",
      "level": 3,
      "content": "To access annotation menu, simply press a, a sidebar for annotation will appear which support almost all standard PDF annotations tools (available at least in mupdf-gl) .\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- MuPDF website\n- Poppler website\n- PDF, PS and DjVu\n\n"
    }
  ]
}