{
  "title": "Netdata",
  "url": "https://wiki.archlinux.org/title/Netdata",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "netdata is a system for distributed real-time performance and health monitoring. netdata is created by the group that also created FireHOL and FireQOS.\n\nnetdata is designed to permanently run on all systems (physical and virtual servers, containers, IoT devices), without disrupting their core function.\n\nNetdata allows to create dashboards of multiple servers, which stream on the fly the data from them to the browser. This functionality is called cloud and available through their website. This service is free of charge.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the netdata package. The installation package includes go.d.plugin.\n\nStart/enable the netdata service.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Netdata reads its configuration file from /etc/netdata/netdata.conf. This configuration file is not needed by default. Netdata works with the default settings without it, but it does allow you to adapt the general behavior of Netdata. You can find all these settings (and their default values) by accessing the http://localhost:19999/netdata.conf URL.\n\nThe plugins folders is at /usr/lib/netdata and their configuration at /usr/lib/netdata/conf.d.\n\n"
    },
    {
      "title": "Enable cloud connection",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nThe cloud functionality allows you to visit the metrics of multiple nodes via a stream through the website of the Netdata company. To enable this connection you have to connect your local instance by logging into the website and generate a token (and a room-id). To establish a permanent connection to the cloud for streaming of the metrics run the following command in a terminal:\n\n```\n# netdata-claim.sh  -token=abcdefg -rooms=abcdefg-abcdefg\n```\n\n"
    },
    {
      "title": "Disable cloud integration",
      "level": 3,
      "content": "To hide all Netdata Cloud advertisements and connection attempts:\n\n```\n/var/lib/netdata/cloud.d/cloud.conf\n```\n\n```\n[global]\n    enabled = no\n```\n\nIf the /var/lib/netdata/cloud.d/ folder does not exist (which is the case if Netdata was just installed without starting it for the first time), create it:\n\n```\n# mkdir -p /var/lib/netdata/cloud.d\n# chown -R netdata:netdata /var/lib/netdata\n```\n\n"
    },
    {
      "title": "Behind a web server",
      "level": 3,
      "content": "netdata can be run behind another web server (proxy) and you can configure it accordingly. The netdata documentation has examples for Apache, Nginx, lighttpd, haproxy and caddy.\n\n"
    },
    {
      "title": "Built-in web server",
      "level": 3,
      "content": "netdata is accessible at http://localhost:19999/ by default.\n\nTo enable remote IPv4 (0.0.0.0) and IPv6 ([::]) access, edit /etc/netdata/netdata.conf:\n\n```\n[web]\n    bind to = 0.0.0.0 [::]\n```\n\n"
    },
    {
      "title": "Telemetry",
      "level": 3,
      "content": "Netdata collects anonymous usage information through its own infrastructure and via PostHog by default. To opt out of this telemetry functionality, create the following configuration file:\n\n```\n# touch /etc/netdata/.opt-out-from-anonymous-statistics\n```\n\nMore details on the data gathered can be found here.\n\n"
    },
    {
      "title": "Optimization",
      "level": 3,
      "content": "netdata can be optimized for different scenarios.[1]\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:Netdata\n\n"
    }
  ]
}