{
  "title": "Nwg-shell",
  "url": "https://wiki.archlinux.org/title/Nwg-shell",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The nwg-shell project aims to create a consistent, GTK based user interface for the Sway Wayland Compositor.\n\nIt also supports Hyprland since version 0.5.0 [1].\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "The nwg-shell components can be installed with the nwg-shell (meta) package.\n\n- Support for Hyprland requires a few additional packages. Check the list of optional dependencies for the nwg-shell package.\n- Most components of the nwg-shell can also be installed and used standalone. See #Shell components for a full list of components.\n\nThe nwg-shell-installer script (see #Configuration) also expects a web browser, a file manager and a text editor to be installed before being run in order to setup keybindings properly. The suggested ones are firefox, thunar and typobuster but other ones can be installed instead.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The nwg-shell package provides the nwg-shell-installer script which can be run to interactively generate a default configuration for every nwg-shell components as well as a custom configuration for Sway/Hyprland.\n\nFor Sway, run:\n\n```\n$ nwg-shell-installer -a\n```\n\nFor Sway and Hyprland:\n\n```\n$ nwg-shell-installer -a -hypr\n```\n\nNote: **before** \n\nAlternatively, one can modify each nwg-shellcomponents' configurations and style sheets graphically or by modifying the related files under ~/.config/component_name.\n\nFinally, one can enable the greetd.service (so greetd will be started at boot) and set up the nwg-hello greeter.\n\n"
    },
    {
      "title": "Shell components",
      "level": 2,
      "content": "The nwg-shell package provides the following nwg-shell components:\n\n- azote — Wallpaper manager for wlroots-based compositors and some other WMs.\n\n- gopsuinfo — A gopsutil-based command to display system usage info as text in panels like Waybar or icon/text in tint2 and nwg-panel executors.\n\n- nwg-bar — GTK3-based button bar for wlroots-based compositors.\n\n- nwg-clipman — a GTK3-based GUI for cliphist.\n\n- nwg-displays — Output management utility for sway and Hyprland.\n\n- nwg-dock — GTK3-based dock for Sway.\n\n- nwg-dock-hyprland — GTK3-based dock for Hyprland.\n\n- nwg-drawer — Application drawer for wlroots-based Wayland compositors.\n\n- nwg-hello — GTK3-based greeter for greetd written in python.\n\n- nwg-icon-picker — GTK icon chooser with a text search option.\n\n- nwg-look — GTK3 settings editor adapted to work in the wlroots environment.\n\n- nwg-menu — MenuStart plugin to nwg-panel, also capable of working standalone.\n\n- nwg-panel — GTK3-based panel for sway and Hyprland Wayland compositors.\n\n- nwg-readme-browser — WebKitGTK-based README file browser.\n\n- nwg-shell — Installer & meta-package for the nwg-shell project: a GTK3-based shell for Sway and Hyprland Wayland compositors.\n\n- nwg-shell-config — nwg-shell configuration utility.\n\n- nwg-shell-wallpapers — Selection of wallpapers contributed to the nwg-shell project.\n\n"
    }
  ]
}