{
  "title": "Old School RuneScape",
  "url": "https://wiki.archlinux.org/title/Old_School_RuneScape",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From Wikipedia:\n\nFrom Wikipedia:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "The installation alternatives offer different features to make a choice on, and may use different dependencies.\n\n"
    },
    {
      "title": "Jagex Launcher",
      "level": 3,
      "content": "The Jagex Launcher offers installation and shortcuts to each game client Executable and does not Linux support on release.\n\n"
    },
    {
      "title": "Unofficial client",
      "level": 4,
      "content": "jagex-launcher-linux is a repository that \"contains community projects to install the Jagex Launcher and use Jagex Accounts in Linux\" as recommended by Jagex Support.\n\nBolt is a third-party launcher. Install with the bolt-launcherAUR package or with Flatpak as com.adamcake.Bolt from Flathub.\n\n"
    },
    {
      "title": "Official client",
      "level": 4,
      "content": "Install the official RuneScape NXT client with the runescape-launcherAUR package. The official client can also be installed with Flatpak as com.jagex.RuneScape from Flathub.\n\n"
    },
    {
      "title": "RuneLite",
      "level": 4,
      "content": "RuneLite is an open-source alternative to other third-party Old School RuneScape clients. It is available on the AUR: runeliteAUR.\n\nTo enable the GPU feature within RuneLite, ensure you meet the requirements and have updated to the latest version of mesa.\n\n"
    },
    {
      "title": "OSRS-Launcher",
      "level": 4,
      "content": "osrs-launcher is a repackaging of the mac version of the official Old School RuneScape launcher. It is available for installation from the AUR, osrs-launcherAUR.\n\n"
    },
    {
      "title": "Steam",
      "level": 3,
      "content": "It is worth mentioning that RuneScape and OSRS are individually available on Steam, which offers its own Compatibility layer Proton. Steam is a separate program, and not recommended if unfamiliar. The Steam releases predate the official #Jagex Launcher release by around three years, and lack support for Jagex Account features such as multiple characters.\n\n"
    },
    {
      "title": "Audio issues",
      "level": 3,
      "content": "The Java client (jagexappletviewer.jar) requires pulseaudio-alsa to be installed for sound to work properly. Otherwise there will be no in-game sound or other applications will not be able to play audio due to the client claiming direct access to /dev/snd/* devices. For more details, see PulseAudio#ALSA.\n\n"
    },
    {
      "title": "SSL errors",
      "level": 3,
      "content": "If you receive an error like this (with RuneLite or otherwise):\n\n```\njavax.net.ssl.SSLHandshakeException: Received fatal alert: handshake_failure\n```\n\nThis error may be due to Java's new TLSv1.3 implementation. Try adding -Djdk.tls.client.protocols=TLSv1.2 to your client's launch options. For example:\n\n```\n$ java -Djdk.tls.client.protocols=TLSv1.2 -jar RuneLite.jar\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- The RuneScape Wiki\n- Jagex Support\n\n"
    }
  ]
}