{
  "title": "OpenPGP card",
  "url": "https://wiki.archlinux.org/title/OpenPGP_card",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Data-at-rest encryption\n- List of applications/Security#Encryption, signing, steganography\n- Nitrokey\n- OpenPGP\n- OpenPGP-card-tools\n- Smartcards\n- Yubikey\n\nOpenPGP card describes an open standard for an application that runs on hardware security devices. Both open and closed source implementations exist.\n\nThe motivation to use OpenPGP card devices, as for all hardware security devices, is to not expose the private key material to the host computer.\n\nWith OpenPGP card it is possible to cover all OpenPGP private key operations: Decryption and signing.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "OpenPGP card devices can either be used with pcsclite and the ccid driver or with gnupg which includes its own, custom CCID driver.\n\n"
    },
    {
      "title": "Key slots",
      "level": 2,
      "content": "OpenPGP card devices offer three dedicated slots for private key material, one each for signing, decryption and authentication.\n\n"
    },
    {
      "title": "Ssh-agent",
      "level": 2,
      "content": "Using private key material in an authentication slot SSH logins can be performed by an ssh-agent implementation that can use OpenPGP card devices. Available options include GnuPG as ssh-agent and openpgp-card-ssh-agent.\n\n"
    },
    {
      "title": "Further use-cases",
      "level": 2,
      "content": "OpenPGP card devices can be used in a wide range of contexts to perform OpenPGP operations for signing and decryption. Typical uses include signing commits with git and data-at-rest encryption when integrating Thunderbird with OpenPGP cards or when using pass for passwords.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- \"Functional Specification of the OpenPGP application on ISO Smart Card Operating Systems\" by Achim Pietig\n- Gnuk - An OpenPGP card implementation in C targeting STM32F103 processors\n- opcard-rs - OpenPGP card implementation in Rust\n- SmartPGP - JavaCard implementation of the OpenPGP card specification\n- Yubico's closed source OpenPGP card implementation\n\n"
    }
  ]
}