{
  "title": "OTPW",
  "url": "https://wiki.archlinux.org/title/OTPW",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Secure Shell\n- pam_abl\n- Google Authenticator\n\nOne Time PassWord (OTPW) is a PAM module allowing single-use passwords to login to a system. This is especially useful in the context of Secure Shell, allowing a user to login from a public or shared computer using a single-use password which will never work again.\n\nInstructions for installing OTPW and configuring SSH to allow OTPW logins are below.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the otpwAUR package.\n\n"
    },
    {
      "title": "PAM configuration",
      "level": 3,
      "content": "Create a PAM configuration file for otpw:\n\n```\n/etc/pam.d/ssh-otpw\n```\n\n```\nauth sufficient pam_otpw.so\nsession optional pam_otpw.so\n```\n\nNext, modify sshd's PAM configuration to include otpw. If you are disabling static password authentication (auth), comment out the second bold line. Here is the modified /etc/pam.d/sshd for reference:\n\n```\n/etc/pam.d/sshd\n```\n\n```\n#%PAM-1.0\n#auth     required  pam_securetty.so     #disable remote root\n\nauth      include   ssh-otpw\n#auth      include   system-remote-login #NOTE: This must be disabled to completely disable password logins.\naccount   include   system-remote-login\npassword  include   system-remote-login\nsession   include   system-remote-login\n```\n\n"
    },
    {
      "title": "sshd configuration",
      "level": 3,
      "content": "OTPW uses Keyboard-Interactive logins for SSH sessions, which are enabled by adding these lines:\n\n```\n/etc/ssh/sshd_config\n```\n\n```\nUsePAM yes\nKbdInteractiveAuthentication yes\n```\n\nIf you wish to allow static password logins as well, ensure /etc/ssh/sshd_config contains a line like this:\n\n```\n/etc/ssh/sshd_config\n```\n\n```\nPasswordAuthentication yes\n```\n\nOtherwise, set it to no. See the above info on editing /etc/pam.d/sshd to fully disable static password auth, as PAM will otherwise allow a static password if OTPW fails (e.g. when a user runs out of passwords).\n\nIf you allow password authentication, then after failing one authentication method, ssh clients will fall back to the other. Note that by default, ssh allows you three attempts at a password per login method.\n\n"
    },
    {
      "title": "OTPW configuration",
      "level": 3,
      "content": "OTPW is configured independently for each user account. If a given account does not have OTPW configured, that account will simply use a static password as usual. To configure OTPW for an account, run as that user:\n\n```\n$ otpw-gen > ~/otpw_passwords\n```\n\notpw-gen will ask for a password prefix, which must be typed at the beginning of all otpw passwords. This is to ensure that if someone else gets your OTPW list, they cannot use it to login to your account without knowing your prefix.\n\nAfter running the above command, there should be a file in the user's home directory called otpw_passwords which contains all of the user's OTPW passwords. There will also be a file ~/.otpw which contains the password hashes. otpw_passwords can be printed and referenced when logging in.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "After completing the configuration above, ssh should use OTPW automatically for users who have it configured. An OTPW login prompt looks like so:\n\n```\nPassword 041:\n```\n\nTo log in, simply look up password 41 in your otpw_passwords list, for example:\n\n```\n041 lYr0 g7QR\n```\n\nAnd type in your prefix followed by both halves of the password. The space is provided for readability and may or may not be included in the typed password. Do not enter a space between the prefix and the single-use password.\n\nTo specify to the ssh client which login method you would like to use, add -o PreferredAuthentication=keyboard-interactive to use OTPW, or -o PreferredAuthentication=password for static passwords. These options can also be specified in ~/.ssh/config per-server.\n\nTo prevent someone from shoulder-surfing your OTPW and quickly using it to login to your account before you login, OTPW requires a concurrent login to enter three passwords instead of just one. This will usually not be an issue, but if OTPW should give a prompt like this:\n\n```\nPassword 072/251/152:\n```\n\nThen simply enter your prefix, and the three requested passwords in the order they are requested in. When a login is initiated, OTPW creates a file ~/.otpw.lock to detect concurrent logins. If a second login is initiated when this file exists, OTPW will request the three passwords.\n\n"
    }
  ]
}