{
  "title": "Owx",
  "url": "https://wiki.archlinux.org/title/Owx",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is a candidate for merging with List of applications.** This article or section is a candidate for merging with List of applications.\n\nThis article or section is a candidate for merging with List of applications.\n\nRelated articles\n\n- GNU Radio\n- RTL-SDR\n\nAmateur radio enthusiasts (sometimes called ham radio operators or \"hams\") have been at the forefront of experimentation and development since the earliest days of radio. A wide variety of communication modes are used on a vast range of frequencies that span the electromagnetic spectrum. This page lists software related to amateur radio. Some of it is stand-alone while the various digital communication applications require interfacing to radio hardware and possibly the computer soundcard. Interface hardware can be purchased from vendors or home-built.\n\n"
    },
    {
      "title": "Getting started",
      "level": 2,
      "content": "Many of the following programs will need to access a serial port to key the transmitter (eg. /dev/ttyS0). This requires that the user to be added to uucp user group.\n\n"
    },
    {
      "title": "Hardware",
      "level": 2,
      "content": "A common interface for various radio hardware is Digirig. Although there are several models, they will all generally present to the operating system via ALSA as a \"C-Media Electronics USB Audio Device\", with two channels for both audio input and output. Rig control is also provided by the Digirig via the /dev/ttyUSB0 serial device.\n\nOther devices, such as the ICom IC-705 have built-in soundcard and CAT control. You can directly connect to the transceiver via USB, which should be exposed as USB audio (via Burr-Brown USB Audio) and serial devices (via /dev/ttyUSB0 and /dev/ttyUSB1)\n\n"
    },
    {
      "title": "Software",
      "level": 2,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\n- Hamlib — provides an interface between hardware and radio control programs. It is a software layer to facilitate the control of radios and other hardware (eg. for logging, digital modes) and is not a stand-alone application.\n\n- Soundmodem — Written by Tom Sailer (HB9JNX/AE4WA) to allow a standard PC soundcard to act as a packet radio modem for use with the various AX.25 communication modes.\n\n- Grig — simple control program based on Hamlib\n\n- linrad — Software defined radio by SM5BSZ\n\n- quisk — Software defined radio by N2ADR\n\n- owx — Command-line utility for programming Wouxun radios using CSV spreadsheets.\n\n- fldigi — popular GUI developed by W1HKJ for a variety of digital communication modes\n\n- libfap — APRS packet parser\n\n- aprx — lightweight APRS digipeater and i-Gate interface\n\n- xdx — network client\n\n- qsstv — Slow-scan television\n\n- linpsk — PSK31\n\n- xpsk31 — PSK31 using a GUI rendered by GTK\n\n"
    },
    {
      "title": "AX.25",
      "level": 3,
      "content": "AX.25 — data link layer protocol that is used extensively in packet radio networks. It supports connected operation (eg. keyboard-to-keyboard contacts, access to local bulletin board systems, and DX clusters) as well as connectionless operation (eg. APRS). The Linux kernel includes native support for AX.25 networking. Please refer to this guide for more information. The following software is available in the AUR:\n\n- ax25-appsAUR\n- ax25-toolsAUR\n- libax25AUR\n\n"
    },
    {
      "title": "WSJT-X",
      "level": 3,
      "content": "WSJT-X (Weak Signal Communication by K1JT) — offers offers a rich variety of features, including specific digital modes (such as the popular FT-8 and WSPR modes) optimized for weak signal communication, meteor scatter, ionospheric scatter, and EME (moonbounce) at VHF/UHF, as well as HF skywave propagation. WSJT-X is developed by a team of developer led by Nobel Prize winning physicist Joe Taylor, who has the amateur radio callsign K1JT. The program can decode fraction-of-a-second signals reflected from ionized meteor trails and steady signals 10 dB below the audible threshold. WSJT-X requires access to the serial port; see the note in the Interfacing section above about the uucp group.\n\n"
    },
    {
      "title": "WSJT-X_Improved",
      "level": 3,
      "content": "wsjt-x_improved by DG2YCB is an enhanced version of the excellent WSJT-X software by Joe Taylor K1JT, Steve Franke K9AN, Bill Somerville G4WJS and others. WSJT-X_Improved offers DX-oriented optimizations as well as innovative enhancements and features, that sometimes may not (yet) be fully suitable for the mass market. There are three different packages available, standard GUI, Alternate Layout (AL) GUI, and Widescreen GUI.\n\n"
    },
    {
      "title": "JTDX_Improved",
      "level": 3,
      "content": "jtdx_improved by DG2YCB is an enhanced version of JTDX by Igor Chernikov et al. (https://sourceforge.net/projects/jtdx/). Both DG2YCB and Igor's forks are based on the excellent WSJT-X software by Joe Taylor K1JT, Steve Franke K9AN, Bill Somerville G4WJS and others (https://sourceforge.net/projects/wsjt/). There are two different GUI layouts, improved GUI and standard JTDX GUI.\n\n"
    },
    {
      "title": "Xastir",
      "level": 3,
      "content": "Xastir — stands for X Amateur Station and Information Reporting. It works with APRS, an amateur radio-based system for real time tactical digital communications. Xastir is an open-source program that provides full-featured, client-side access to APRS. It is currently in a state of active development.Xastir is highly flexible and there are a wide variety of ways it can be configured. For example, it can be evaluated without radio hardware if an Internet connection is available. The wiki at xastir.org is very thorough and gives excellent information on its range of capabilities and setup.An optional speech feature can be enabled with the festival package; you will also need a speaker package such as festival-en or festival-english. If you want this option, festival must be installed on your system before building xastir. Launch festival before the xastir program is started for speech to function properly:\n\n```\n$ festival --server\n```\n\nor you can write a simple script to automate the sequential starting process. There may be problems if other programs such as a media player are accessing sound simultaneously.The PKGBUILD automatically downloads an 850 kB bundle of .wav files and places them here: /usr/share/xastir/sounds/.These are audio alarm recordings of a North American English speaker that do not require the presence of festival to render. The audio play command `play' in the configure menu may not work; try `aplay' instead.\n\n"
    },
    {
      "title": "Digital Voice",
      "level": 3,
      "content": "FreeDV — is a Digital Voice mode for HF radio. It uses the free and open Codec2 voice codec to enable efficient narrow bandwith, low bitrate voice communication ideally suited for shortwave radio contacts. A SSB radio connected to a computer running the FreeDV GUI application are all that is needed to start using the FreeDV mode. FreeDV as well as Codec2 are available to Arch Linux via the AUR system. Both are needed for FreeDV to work!\n\n- https://www.rowetel.com/codec2.html codec2\n\n"
    },
    {
      "title": "Analysis tools",
      "level": 3,
      "content": "- gpredictAUR – Real-time satellite tracking and orbit prediction application\n- hamsolarAUR – Small desktop display of the current solar indices\n- splatAUR – rf signal propagation, loss, and terrain analysis\n- sunclockAUR – Useful for predicting grayline propagation paths\n- xnec2cAUR – Electromagnetic antenna modeler\n\n"
    },
    {
      "title": "Logging",
      "level": 3,
      "content": "- cqrlog-binAUR – a popular Linux logging program\n- fdlogAUR – a Field Day Logger with networked nodes\n- klogAUR – a Ham radio logging program for Linux / KDE.\n- tlfAUR – a console mode networked logging and contest program\n- trustedqslAUR – QSL application for ARRL's Logbook of the World\n- xlogAUR – a logging program for amateur radio operators.\n- yfklogAUR – a general purpose ham radio logbook for *nix operating systems.\n- yfktestAUR – a logbook program for ham radio contests.\n- hamrs-appimageAUR – a multi-platform logger tailored for activities like Parks on the Air, Field Day, and more.\n\n"
    },
    {
      "title": "Tools",
      "level": 3,
      "content": "- ctyAUR – package contains databases of entities (countries), prefixes and callsigns that are used by amateur radio logging software.\n- dxccAUR – a small program for determining ARRL DXCC entity of a ham radio callsign\n\n"
    },
    {
      "title": "Morse code training",
      "level": 3,
      "content": "- aldoAUR\n- cutecwAUR\n- ebook2cwAUR\n- gtkmmorseAUR\n- kochmorseAUR\n- qrqAUR\n- unixcwAUR\n\n"
    },
    {
      "title": "Other",
      "level": 3,
      "content": "- cwircAUR – Send and receive Morse code messages via IRC\n\n"
    }
  ]
}