{
  "title": "Pacserve",
  "url": "https://wiki.archlinux.org/title/Pacserve",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Pacserve allows to easily share pacman packages between computers. This is very useful if you have a slow internet connection and multiple machines running Arch Linux.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install pacserveAUR.\n\nFinally start/enable pacserve.service.\n\nIn case you use iptables, you will probably want to start pacserve-ports.service too. For other firewalls open TCP port 15678 and UDP port 15679. The UDP port can be limited to multicast traffic only.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The pacserve.service can configured by editing PACSERVE_ARGS in /etc/pacserve/pacserve.service.conf. Run pacserve --help to see the available options.\n\n"
    },
    {
      "title": "Avahi",
      "level": 3,
      "content": "To announce and discover Pacserve using mDNS add the option --avahi to PACSERVE_ARGS in /etc/pacserve/pacserve.service.conf.\n\n"
    },
    {
      "title": "Standalone usage",
      "level": 2,
      "content": "Instead of pacman, use the pacsrv wrapper to perform an update, install packages and so on. It will automatically download all packages from the LAN, if someone hosts them with pacserve there. Otherwise it will just download them from the internet mirrors, as usually. For example:\n\n```\n# pacsrv -Syu\n# pacsrv -S openssh\n```\n\n"
    },
    {
      "title": "Configure Pacman to use Pacserve",
      "level": 2,
      "content": "If you are always running the pacserve daemon and want pacman to use it without the wrapper, insert the following line (before any other Include lines) in each repository in /etc/pacman.conf.\n\n```\nInclude = /etc/pacman.d/pacserve\n```\n\nHere is an example for the Xyne repository:\n\n```\n/etc/pacman.conf\n```\n\n```\n...\n[xyne-x86_64]\nSigLevel = Required\nInclude  = /etc/pacman.d/pacserve\nServer   = https://xyne.dev/repos/xyne\n...\n```\n\nAlternatively (for official mirrors only), you may insert the Include line at the top of the Pacman mirrorlist file or let pacman.conf-insert_pacserve generate a pacman.conf file for you.\n\n"
    },
    {
      "title": "Problems if using external downloaders in pacman.conf",
      "level": 3,
      "content": "If you are using an external downloader such as wget, pacsrv may return errors when downloading. To work around these errors, simply quote the url and output formatting strings (%u resp. %o) using single quotes:\n\n```\nXferCommand = /usr/bin/wget --timeout=6 --passive-ftp -c -O '%o' '%u'\n```\n\n"
    },
    {
      "title": "Machines do not see each other",
      "level": 3,
      "content": "Peers detection relies on version of python3-threaded_serversAUR. TCP multicast frames coming from a different version of the service are discarded. In this case, running journalctl -u pacserve as root will warn about such unrecognized frames. Upgrade this package first then restart the pacserve.service.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- pacserve thread on the Arch Linux forums\n\n"
    }
  ]
}