{
  "title": "Powertop",
  "url": "https://wiki.archlinux.org/title/Powertop",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Power saving\n- Laptop Mode Tools\n- TLP\n\nPowertop is a tool provided by Intel to enable various powersaving modes in userspace, kernel and hardware. It is possible to monitor processes and show which of them are utilizing the CPU and wake it from its Idle-States, allowing to identify applications with particular high power demands.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the powertop package, or powertop-gitAUR for the latest development version.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Powertop's interactive mode can be invoked with:\n\n```\n# powertop\n```\n\nIn interactive mode, you can modify recommended settings in the Tunables and WakeUp tabs. This allows you to change settings and monitor how they affect your power consumption in the Overview tab. However this does not persist any settings and the changes will be lost on reboot.\n\n"
    },
    {
      "title": "Generate reports",
      "level": 3,
      "content": "Powertop can generate reports in either CSV or HTML format. The HTML export is an interactive document that shows recommended settings. Make sure to reboot to revert to system defaults before generating a report!\n\nYou can also extract the recommended parameters by following these steps:\n\n1. Use powertop to produce a report on parameters: # powertop --html=powerreport.html\n1. Open the report in your favorite web browser. The \"Tuning\" tab of the report now shows the actual parameters suggested by the tool to apply to save power. You may extract the commands with $ awk -F '</?td ?>' '/tune/ { print $4 }' powerreport.html\n\n```\n# powertop --html=powerreport.html\n```\n\n```\n$ awk -F '</?td ?>' '/tune/ { print $4 }' powerreport.html\n```\n\nNewer versions of Powertop include the --auto-tune-dump option which will output the commands Powertop's --auto-tune would have run. This is useful for including in a script in case you do not want to run all of Powertop's recommendations.\n\n"
    },
    {
      "title": "Apply settings",
      "level": 3,
      "content": "There are two ways to automatically apply the suggested settings:\n\n- Recommended: You can apply these settings at boot by using module parameters, udev rules and sysctl. For details, see the power management page. You can also use the powertop-to-tmpfileAUR helper to apply the settings via systemd-tmpfiles.\n- You can use the --auto-tune feature from powertop which sets all tunable options to their GOOD setting. This can be combined with the systemd service to have the tunables set on boot. Remember to enable/start the service.\n\n```\n/etc/systemd/system/powertop.service\n```\n\n```\n[Unit]\nDescription=Powertop tunings\n\n[Service]\nType=oneshot\nRemainAfterExit=yes\nExecStart=/usr/bin/powertop --auto-tune\n\n[Install]\nWantedBy=multi-user.target\n```\n\nYou can also add this line to the [Service] section in order to prevent your \"Mouse\" from getting disconnected upon booting, if it is already connected to your system.\n\n```\nExecStartPost=/bin/sh -c 'for f in $(grep -l \"Mouse\" /sys/bus/usb/devices/*/product | sed \"s/product/power\\\\/control/\"); do echo on >| \"$f\"; done'\n```\n\n"
    },
    {
      "title": "Error: Cannot load from file",
      "level": 3,
      "content": "If you receive an error like the following when starting powertop, it is likely that powertop has not collected enough measurement data yet. To fix this, keep powertop running for a certain time connected to battery power only.\n\n```\nLoaded 39 prior measurements\nCannot load from file /var/cache/powertop/saved_parameters.powertop\nCannot load from file /var/cache/powertop/saved_parameters.powertop\n```\n\n"
    },
    {
      "title": "Calibration to prevent inaccurate measurement",
      "level": 3,
      "content": "If you experience inaccurate measurement, then it is likely that you need to calibrate powertop first. This can be done by running powertop with the --calibrate parameter.\n\n```\n# powertop --calibrate\n```\n\n"
    },
    {
      "title": "Display power estimation",
      "level": 3,
      "content": "Prior to displaying the power usage estimation column, powertop needs to run 270 measurements. Each one lasts 20 seconds, which means you need to let powertop run for 1h30 in total.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Project repository\n- Wikipedia article\n\n"
    }
  ]
}