{
  "title": "PrBoom",
  "url": "https://wiki.archlinux.org/title/PrBoom",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "PrBoom is a cross-platform version of the classic 3D first person shooter Doom from id Software. Originally written for Microsoft Windows, PrBoom has since been ported to Linux and many other platforms. It offers a number of enhancements over the original game, including OpenGL rendering and high video resolutions, while attempting to remain true to the original Doom in terms of play. You will need the original Doom data, unless you install the FreeDoom package (see below).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the prboomAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "To use prboom, the original data files are required. An IWAD - short for Internal WAD - is the main resource file for a Doom-engine game, containing all the game's original sounds, levels, and graphics. With an IWad file with default settings (unless you already have ~/.prboom/prboom.cfg edited):\n\n```\n# prboom -iwad /path/to/file\n```\n\nTo change window resolution (you must disable fullscreen in options in-game):\n\n```\n# prboom -width 800 -height 600 -iwad /path/to/file\n```\n\nA full list of settings can be found in prboom(6).\n\n"
    },
    {
      "title": "Server",
      "level": 2,
      "content": "To start a server:\n\n```\n# prboom-game-server\n```\n\nBy default it listens on port 5030, so to join the game:\n\n```\n# prboom -net localhost:5030 -iwad /path/to/file\n```\n\n"
    },
    {
      "title": "Music",
      "level": 2,
      "content": "If music is not working, then follow these steps. Install timidity++ and freepats-general-midi, then add:\n\n```\n/etc/timidity++/timidity.cfg\n```\n\n```\ndir /usr/share/timidity/freepats\nsource /etc/timidity++/freepats/freepats.cfg\n```\n\nPlease note that freepats is an incomplete soundfont; therefore it will not play every instrument used by Doom and Doom 2. You should consider installing an alternative SoundFont.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "Wikipedia:PrBoom\n\n"
    }
  ]
}