{
  "title": "Quod Libet",
  "url": "https://wiki.archlinux.org/title/Quod_Libet",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Quod Libet is a music player written in Python and based on GTK, extendable using native or user plugins, and supporting a lot of audio formats using GStreamer as backend. It supports ReplayGain, reading and writing tags, displaying album arts and lyrics, filtering library based on regular expressions, and more.\n\nThe Quod Libet project provides 3 commands:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the quodlibet package.\n\n"
    },
    {
      "title": "Extending decoding capabilities",
      "level": 3,
      "content": "Quod Libet can benefit from Libav-based codecs through GStreamer (e.g. to decode Monkey's Audio (APE) files). To enable this, install the gst-libav package and restart the audio player.\n\n"
    },
    {
      "title": "Extending plugins list",
      "level": 3,
      "content": "Quod Libet can benefit from some GStreamer's plugins (e.g. to compute ReplayGain information). To make them available in the Quod Libet's plugins list, install the gst-plugins-good package and restart the audio player.\n\n"
    },
    {
      "title": "Configuring the player core",
      "level": 3,
      "content": "In the menu, go to File and then Preferences. From here, you can configure the library path, enable ReplayGain, and configure the player layout.\n\n"
    },
    {
      "title": "Enabling plugins",
      "level": 3,
      "content": "The default preferences of the player are not exhaustive. A more advanced configuration is done via plugins. To enable them, in the menu, go to File > Plugins, and enable the desired plugins.\n\nHere is a list of interesting plugins:\n\n"
    },
    {
      "title": "ReplayGain",
      "level": 3,
      "content": "ReplayGain is disabled by default on Quod Libet. You must enable it in the preferences so that the volume of tracks will be adjusted at runtime based on ReplayGain tags.\n\nQuod Libet is able to compute ReplayGain information and store it in the tags of audio files. It relies on the GStreamer's rganalysis plugin. To do so:\n\n- Ensure GStreamer's plugins are installed through the gst-plugins-good package.\n- Enable the ReplayGain plugin, right click on a file, go to Plugins and click on ReplayGain.\n\n"
    },
    {
      "title": "External control",
      "level": 3,
      "content": "Quod Libet can be controlled programmatically using MPRIS through D-Bus. To do so, enable the D-BUS MPRIS support plugin. It allows control using multimedia keys and terminal.\n\nThe following demonstrate some examples of player control using the terminal.\n\n```\n$ dbus-send --dest=org.mpris.MediaPlayer2.quodlibet --print-reply /org/mpris/MediaPlayer2 org.freedesktop.DBus.Properties.Set string:org.mpris.MediaPlayer2.Player string:Volume variant:double:0.5\n```\n\n```\n$ dbus-send --dest=org.mpris.MediaPlayer2.quodlibet --print-reply /org/mpris/MediaPlayer2 org.mpris.MediaPlayer2.Player.Next\n```\n\nInstead of Next, you can use one of the following actions: Pause, Play, Previous, Stop.\n\n"
    },
    {
      "title": "Media server",
      "level": 3,
      "content": "Quod Libet can act as a media server using Music Player Daemon or Rygel as backends. To select and use one of them, enable the correspond plugins in the preferences.\n\n"
    },
    {
      "title": "Multimedia keys do not work",
      "level": 3,
      "content": "Multimedia keys work using the MPRIS interface. This interface has to be enabled in the plugins of Quod Libet to make them work.\n\n"
    },
    {
      "title": "Interface freeze when title changes",
      "level": 3,
      "content": "Enabling a buggy plugin or too many sane plugins can sometimes leads to poor performance. Disable plugins until the freeze disappear, such that you can identify the faulty plugin. For instance, the Waveform search bar is known to cause some lags for low-end systems.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia page\n- GitHub repository\n- Official website\n\n"
    }
  ]
}