{
  "title": "Razer Blade",
  "url": "https://wiki.archlinux.org/title/Razer_Blade",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nRazer Blade is Razer's line of gaming laptops. As of 2018, the lineup consists of a 13\" model (Razer Blade Stealth), 15\" model (Razer Blade), and a 17\" model (Razer Blade Pro). It is known to have very limited bios feature and limited Linux stability.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nDue to the proprietary SBUI trackpad on the 17\" model, it will be extremely difficult to get it to work without extensive USB protocol reversing.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Before uninstalling Windows, make sure to update the bios. It is easier to install the Razer drivers with Windows. You can find updates on the support page related to your model.\n\nIf you are for some reason unable to boot into Windows to perform the update, there is still a patch that you can apply to your kernel build to get things working. However, this will unlikely be maintained due to the availability of the BIOS patch.\n\nThe normal installation process works in general with the exceptions enumerated below.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "Install the xf86-input-libinput package: this is also the only one that will enable natural scrolling. See libinput for more information on this driver.\n\nAlternatively, if you prefer using the Touchpad Synaptics driver, install the xf86-input-synaptics package.\n\nIf you have issues with the touchpad not working after resuming from sleep, restarting the module i2c_hid seems to work.\n\nIn the 2013 version, the touchpad works only on Linux 4.0+ without libinput-based X.Org input driver (xf86-input-libinput) thanks to Andrew Duggan's work.\n\nIn the 2018 version, the touchpad works with the vanilla kernel with BIOS version 1.05.\n\nIn the 2019 version, the touchpad works with the vanilla kernel and BIOS version 1.02.\n\n"
    },
    {
      "title": "Touchscreen",
      "level": 3,
      "content": "While the touchscreen will provide basic functionality out of the box, it is best to use touchegg to configure multitouch gestures. These include two-finger scrolling, right-click, etc.\n\n"
    },
    {
      "title": "Graphics drivers",
      "level": 3,
      "content": "The graphics card works OK with the standard Intel drivers which you can install with the xf86-video-intel package. See Intel graphics for more information on installation and configuration.\n\nIssues with screen flickering seem to be resolved by changing AccelMethod to uxa as described in the SNA issues section.\n\n```\n# cat >/etc/X11/xorg.conf.d/20-intel.conf\nSection \"Device\"\n  Identifier  \"Intel Graphics\"\n  Driver      \"intel\"\n  Option      \"AccelMethod\"  \"uxa\"\n  #Option      \"AccelMethod\"  \"sna\"\nEndSection\n```\n\nIf you experience screen tearing while scrolling, add the following line to the configuration above: Option \"TearFree\" \"true\" and set the \"AccelMethod\" to \"sna\" and comment out \"uxa\".\n\nIf you have an Intel Kaby Lake chip Wikipedia:Kaby Lake, and the issue is not fixed with the configuration above, add to i915.enable_rc6=0 to the kernel parameters.\n\n"
    },
    {
      "title": "Hybrid graphics",
      "level": 3,
      "content": "If the discrete NVIDIA GPU is switched off before starting Xorg or Wayland, then the system freezes. The only possible solution is to manually disable/enable the discrete card after starting the graphical session. However, there is an ACPI DSDT fix available which fixes this problem. Check the repository and DSDT for more information.\n\nIf you experience very poor battery life compared to Windows, even after implementing Powertop, TPL and cpupower-gui recommendations, try reverting back to the nvidia525 drivers instead of the nvidia535 drivers; the 535xx series have a known bug which does not properly power down the dGPU even when the iGPU is set to integrated.\n\n"
    },
    {
      "title": "Keyboard backlight",
      "level": 3,
      "content": "There are two drivers to control the keyboard backlight:\n\n- OpenRazer — Allows changing the effects and colours for a multitude of Razer peripherals. This one is recommended for a desktop setup with Razer peripherals. It comes with a python library and various GUIs are available to configure it. On a laptop the BIOS still handles to turning on and off of the keyboard backlight without possibility of changing what triggers it or how long for (touchpad activity won't turn the keyboard backlight on for example).\n\n- Razer Laptop Control — Is the laptop centric driver. It allows changing the colours and effects as well as fan speed and power mode. It comes with a command line interface and takes precedence over the BIOS which allows complete control over the backlight, via Bash scripts for example.\n\n"
    },
    {
      "title": "Thunderbolt",
      "level": 3,
      "content": "While thunderbolt does work (tested thunderbolt 4 on 2021 Razer Blade Stealth 13\"), there are many issues that could arise due to the limited capabilities of the bios. For example, the latest kernels will segfault for some thunderbolt drivers (such as those for blackmagic video capture device), and solutions that work on thinkpad, such a turning of Intel VT or other bios features, are not available on the Razer series of laptops.\n\n"
    },
    {
      "title": "No Sound",
      "level": 4,
      "content": "On newer models (such as RZ09-0409x from 2021), Sound Open Firmware is required for the built-in Intel sound card and the headphone jack (aux port) to work.\n\nIf the speakers are detected but don't produce any sound try the script verbs until there is a proper kernel fix available.\n\n"
    },
    {
      "title": "Bad Sound from headphone jack",
      "level": 4,
      "content": "On newer models (such as Blade 14+ 2021), the quality from the headphone jack is very bad/low volume, and is unusable. You can use Bluetooth, the internal speakers, or a USB audio adapter to remedy this.\n\n"
    },
    {
      "title": "Bad sound from speakers",
      "level": 4,
      "content": "Razer models can require equalization to sound as good as they do in their windows configurations. EasyEffects, Calf, or Carla can be used with parametric equalizers to fix that issue. Equalization can be automatically applied using PipeWire filters, which may be more user friendly than running one of these tools constantly.\n\nIn the following example, Freq, Q, and Gain settings are copied directly from saved LSP Parametric Equalizer configuration - equalized on a 2022 Blade 15\" Advanced RZ09-421. The mix node dumps 5% of input to account for increases in the mid-range. It uses wireplumber smart filter features to auto-wire the filter to the correct interface, without touching the default audio sink. This pipewire config could be placed under ~/.config/pipewire/pipewire.conf.d/razer.conf.\n\n```\ncontext.modules = [\n    { name = libpipewire-module-filter-chain\n        args = {\n            node.description = \"Equalizer Sink\"\n            media.name       = \"Equalizer Sink\"\n            filter.graph = {\n                nodes = [\n                    {\n                        type    = builtin\n                        name    = eq_band_0\n                        label   = bq_lowpass\n                        control = { \"Freq\" = 18000.0 \"Q\" = 0.707 \"Gain\" = 0.0 }\n                    }\n                    {\n                        type    = builtin\n                        name    = eq_band_1\n                        label   = bq_peaking\n                        control = { \"Freq\" = 250.0 \"Q\" = 1.0 \"Gain\" = 4.3 }\n                    }\n                    {\n                        type    = builtin\n                        name    = eq_band_2\n                        label   = bq_peaking\n                        control = { \"Freq\" = 500.0 \"Q\" = 1.698 \"Gain\" = -4.3 }\n                    }\n                    {\n                        type    = builtin\n                        name    = eq_band_3\n                        label   = bq_peaking\n                        control = { \"Freq\" = 760.612 \"Q\" = 1.0 \"Gain\" = -8.7 }\n                    }\n                    {\n                        type    = builtin\n                        name    = eq_band_4\n                        label   = bq_peaking\n                        control = { \"Freq\" = 8000.0 \"Q\" = 1.0 \"Gain\" = -1.2 }\n                    }\n                    {\n                        type    = builtin\n                        name    = eq_band_5\n                        label   = bq_highshelf\n                        control = { \"Freq\" = 5000.0 \"Q\" = 0.707 \"Gain\" = 0.0 }\n                    }\n                    {\n                        name   = mix\n                        type   = builtin\n                        label  = mixer\n                        control = {\n                          \"Gain 1\" = .95\n                        }\n                    }\n                ]\n                links = [\n                    { output = \"mix:Out\" input = \"eq_band_0:In\" }\n                    { output = \"eq_band_0:Out\" input = \"eq_band_1:In\" }\n                    { output = \"eq_band_1:Out\" input = \"eq_band_2:In\" }\n                    { output = \"eq_band_2:Out\" input = \"eq_band_3:In\" }\n                    { output = \"eq_band_3:Out\" input = \"eq_band_4:In\" }\n                    { output = \"eq_band_4:Out\" input = \"eq_band_5:In\" }\n                ]\n                inputs  = [ \"mix:In 1\" ]\n                outputs = [  \"eq_band_5:Out\"  ]\n            }\n\t    audio.channels = 2\n\t    audio.position = [ FL FR ]\n        capture.props = {\n            node.name   = \"effect_input.eq6\"\n            media.class = Audio/Sink\n            filter.smart = true\n            filter.smart.name = \"effect_input.eq6.smart.1\"\n            filter.smart.target = { node.name = \"alsa_output.pci-0000_00_1f.3-platform-skl_hda_dsp_generic.HiFi__Speaker__sink\" }\n        }\n        playback.props = {\n            node.name   = \"effect_output.eq6\"\n            node.passive = true\n        }\n\n        }\n    }\n]\n```\n\nGet the node.name for the smart.target parameter by inspecting the default sink wpctl status :\n\n```\n#wpctl inspect 75 | grep 'node\\.name'\n  * node.name = \"alsa_output.pci-0000_00_1f.3-platform-skl_hda_dsp_generic.HiFi__Speaker__sink\"\n```\n\nThe id for the default output can be found wpctl status | grep '\\*' | head -n1 or by examining wpctl status.\n\nApply the settings by restarting pipewire and wireplumber services systemctl --user restart pipewire && systemctl --user restart wireplumber\n\n"
    },
    {
      "title": "Left/Right Speaker Signal is Reversed",
      "level": 3,
      "content": "On the RZ09-421 model left/right speaker sound is swapped.\n\nThis can be automatically corrected using a pipewire configuration that follows. The example uses wireplumber smart filter features to auto-wire the filter to the correct interface, without touching the default audio sink. File ~/.config/pipewire/pipewire.conf.d/razer_speaker_swap.conf:\n\n```\ncontext.modules = [\n    { name = libpipewire-module-filter-chain\n        args = {\n            node.description = \"remap-FL-FR-to-FR-FL\"\n            media.name       = \"remap-FL-FR-to-FR-FL\"\n            filter.graph = {\n                nodes = [\n                    {\n                        name   = copyIL\n                        type   = builtin\n                        label  = copy\n                    }\n                    {\n                        name   = copyIR\n                        type   = builtin\n                        label  = copy\n                    }\n                    {\n                        name   = copyOL\n                        type   = builtin\n                        label  = copy\n                    }\n                    {\n                        name   = copyOR\n                        type   = builtin\n                        label  = copy\n                    }\n                ]\n                links = [\n                # we can only tee from nodes, not inputs so we need\n                # to copy the inputs and then tee.\n                    { output = \"copyIL:Out\" input = \"copyOR:In\" }\n                    { output = \"copyIR:Out\" input = \"copyOL:In\" }\n                ]\n                inputs  = [ \"copyIL:In\"  \"copyIR:In\" ]\n                outputs = [ \"copyOL:Out\" \"copyOR:Out\" ]\n            }\n            capture.props = {\n                node.name         = \"remap_input.remap-FL-FR-to-FR-FL\"\n                audio.position    = [ FL FR ]\n                stream.dont-remix = true\n                node.passive      = true\n                media.class = Audio/Sink\n                filter.smart = true\n                filter.smart.name = \"swapflfr\"\n                filter.smart.target = { node.name = \"alsa_output.pci-0000_00_1f.3-platform-skl_hda_dsp_generic.HiFi__Speaker__sink\" }\n            }\n            playback.props = {\n                node.name         = \"remap_output.remap-FL-FR-to-FR-FL\"\n                audio.position    = [ FL FR ]\n            }\n        }\n    }\n]\n```\n\nGet the node.name for the smart.target parameter by inspecting the default sink wpctl status :\n\n```\n#wpctl inspect 75 | grep 'node\\.name'\n  * node.name = \"alsa_output.pci-0000_00_1f.3-platform-skl_hda_dsp_generic.HiFi__Speaker__sink\"\n```\n\nThe id for the default output can be found wpctl status | grep '\\*' | head -n1 or by examining wpctl status. This effect can be chained with the equalized described in the previous section by adding a wireplumber filter smart rule to capture.props : filter.smart.after = [ \"effect_input.eq6.smart.1\"]\n\nApply the settings by restarting pipewire and wireplumber services systemctl --user restart pipewire && systemctl --user restart wireplumber\n\n"
    },
    {
      "title": "Dual Boot",
      "level": 3,
      "content": "On later 'Kaby Lake' Intel CPU, if you also have a dual-boot with Windows, you might experience some audio issues when booting to Windows and restarting on Linux. The problem is no sound from the speakers and some cracking noises on the headphones—especially when using the touchpad. No official solution has been posted yet, but a quick hack is to completely shut down the computer (so power off, not restart).\n\n"
    },
    {
      "title": "Secure Boot",
      "level": 3,
      "content": "The bios does not allow changing signing keys. Therefore, it is not possible to setup a full secure boot system on most Razer hardware. Tested on 2021 Razer Blade Stealth 13\" but based on forum posts and research, it appears to apply to many other Razer laptops. We tested appending or changing keys using efitools KeyTool.efi or the efi-updatevars tool; neither work.\n\n"
    },
    {
      "title": "Suspend issues",
      "level": 3,
      "content": "- If the fan is running when executing systemctl suspend, the fan will stay running constantly (tested on Razer Blade Stealth 13\" 2021).\n- Changing the suspend method to deep on newer laptops may resolve this issue (tested on Razer Blade 15 2023).\n\n"
    },
    {
      "title": "Touchpad issues",
      "level": 3,
      "content": "- Touchpad activates when typing. Despite settings in the window manager to ignore touchpad when typing, this still happens often. No easy resolution is available, and one probably needs to disable the right half of the touch pad as nearly every Razer laptop positions the touchpad off-center from the space bar, causing unwanted touches very often from the right side\n- The location of the right click is uncomfortable on nearly every Razer laptop. There is no known way with libinput or synaptics drivers to change the x,z division of the mousepad so that it better aligns with hand placement. Currently, one must take their right hand entirely off the keyboard to get to the right mouse button. A workaround can be to turn on left-handed mode (if you are right handed) so that the secondary click is the far left instead of far right.\n\n"
    },
    {
      "title": "Webcam power drain",
      "level": 3,
      "content": "- The webcam is constantly consuming power regardless of whether it is in use or not as seen in powertop. The recommended methods for disabling the webcam work to disable the webcam but power drain remains constant. Those methods include added blacklist uvcvideo to /etc/modprobe.d/blocklist.conf and echo usb-id > /sys/bus/usb/drivers/unbind. We observed that the only way to get the power drain to reduce is to first fully load uvcvideo module after system has completely started and then after that unload and unbind.\n\n"
    },
    {
      "title": "SwitchBlade UI not working (2013)",
      "level": 3,
      "content": "Source\n\n- SwitchBlade UI, the secondary LCD placed next to keyboard found in some models, does not work due to lack of drivers.\n\n"
    },
    {
      "title": "Tweaking",
      "level": 3,
      "content": "If you are using GNOME, the gnome-tweak-tool can be used to adjust the window and font scaling. A font scale of 1.25 puts the font sizes closer to how they are displayed by default in Windows 10.\n\nIf you are using an external monitor that is not HiDPI, you can use xrandr to alter the scaling of the external monitor using the instructions for multiple displays. You may have better results though running GNOME on Wayland. When installed, clicking the gear icon in GDM will allow you to select Gnome On Wayland and will default to that in the future.\n\n"
    },
    {
      "title": "Power management",
      "level": 3,
      "content": "Configuration option 1 is compatible if you use optimus manager to switch between Intel and NVIDIA drivers.\n\n"
    },
    {
      "title": "Power modes and fan control",
      "level": 4,
      "content": "Razer-Laptop-Control can be used to switch between balanced, gaming and creator power modes, as well as manually adjust fan RPM for much better gaming performance and cooling. You can install it via razer-laptop-control-dkms-gitAUR package for the driver and use the razer-laptop-control-gitAUR package for the CLI tool.\n\n"
    },
    {
      "title": "Webcam",
      "level": 4,
      "content": "There is a known issue using high resolutions (more than 360p) on the webcam video driver used by this models. This is well described in this issue #207045 from the Linux Kernel. You can solve it using Arch build system to build your custom kernel and applying this small patch[dead link 2024-10-12 ⓘ].\n\nHere is how to Patch your kernel.\n\n"
    },
    {
      "title": "2014 model issues",
      "level": 3,
      "content": "Source\n\n- touchpad (multitouch, although this may be a kernel bug that has since been fixed)\n- keys to increase/decrease screen illumination not working\n- keys to increase/decrease keyboard illumination not working\n\n"
    },
    {
      "title": "Possible trackpad solution",
      "level": 4,
      "content": "Source\n\n```\n$ git clone https://github.com/aduggan/hid-rmi.git -b rb14 # and then install it\n# depmod -a\n```\n\nThen install the xf86-input-synaptics package.\n\nFeature still not working: pinch to zoom, 3rd mouse button.\n\n"
    },
    {
      "title": "Webcam",
      "level": 3,
      "content": "Setting the uvcvideo option \"quirks=128\" appears to let the webcam work at 720p30, thus enabling Google Hangouts support. cheese works after changing resolution to 720p and relaunching. Multiplying the quirk by a power of 2+ further improves video quality to a point. \"quirks=512\" seems to work best for one user.\n\n```\n/etc/modprobe.d/uvcvideo.conf\n```\n\n```\n## fix issue with built-in webcam\noptions uvcvideo quirks=512\n```\n\n"
    },
    {
      "title": "Keyboard",
      "level": 3,
      "content": "The openrazer-meta-gitAUR package enables backlight control capabilities (including effects) and macro controls. You may use polychromaticAUR or razercommander-gitAUR for a GUI to set the keyboard options.\n\nFor more information on OpenRazer, see Razer peripherals#OpenRazer.\n\n"
    },
    {
      "title": "Infinite suspend loop",
      "level": 3,
      "content": "Add the following kernel parameter:\n\n```\nbutton.lid_init_state=open\n```\n\nto fix the suspend-resume-loop after closing the lid the first time after boot.\n\n"
    },
    {
      "title": "Suspend loop",
      "level": 3,
      "content": "Suspending (Close laptop lid) does not seem to work with a basic installation. The lid state transitions from \"open\" to \"closed\" correctly the first time (and the system suspends), but after resuming from suspend by opening the lid, the lid state does not change back to \"open\". This results in the laptop entering a suspend loop because systemd monitors the lid state, sees that the lid is closed, and suspends the system.\n\nA bug was filed against the kernel ACPI driver in November 2016. It contains a fair amount of documentation on the issue along with a workaround that seems to solve the problem.\n\nTo work around the issue, add the following to your kernel parameters:\n\n```\nbutton.lid_init_state=open\n```\n\nThis will instruct the acpi driver to generate an extra open event when waking from suspend which will keep the system up.\n\nYou can check that the setting was acknowledged:\n\n```\n# cat /sys/module/button/parameters/lid_init_state\n```\n\n```\nignore [open] method disabled\n```\n\nAnd also view all boot parameters:\n\n```\n$ cat /proc/cmdline\n```\n\n```\ninitrd=\\initramfs-linux.img ... button.lid_init_state=open\n```\n\n"
    },
    {
      "title": "Suspending",
      "level": 3,
      "content": "Some users are reporting the laptop immediately waking up after suspending. It appears to be XHC (USB 3.0 chip) that is causing the wakeups.\n\nYou can fix this by running\n\n```\n# echo XHC > /proc/acpi/wakeup\n```\n\nThis will not persist on a restart though. To run this command on every startup, see systemd#Writing unit files.\n\n"
    },
    {
      "title": "Suspension issues",
      "level": 3,
      "content": "If you have suspending stall issue, try to add a new file in /etc/modprobe.d/ with the following contents:\n\n```\nblacklist i2c_nvidia_gpu\n```\n\nIf you have an infinite suspend loop after the first time you close laptop's lid, then try adding button.lid_init_state=open to your kernel parameters.[https://bbs.archlinux.org/viewtopic.php?pid=1738818#p1738818\n\nIf you have resume issues with suspension, try adding acpi_sleep=nonvs as a kernel module parameter.\n\n"
    },
    {
      "title": "Screen flickering / distorted / noise on the 2017 Stealth",
      "level": 3,
      "content": "Add the kernel parameter:\n\n```\ni915.edp_vswing=2\n```\n\nOther fixes (changing xf86-video-intel settings like DRI and AccelMode) do not seem to help.\n\nAlternatively, add the following kernel parameter:\n\n```\nintel_idle.max_cstate=1\n```\n\nThis changes the power options for the kernel. This will increase the power usage as it keeps the processor on all the time. More information can be found at https://gist.github.com/wmealing/2dd2b543c4d3cff6cab7. It may be worth setting max_cstate as high as possible to reduce power usage. Users reports testing from 8 downward and the first one to work was intel_idle.max_cstate=4\".\n\n"
    },
    {
      "title": "Possible trackpad solution for 2013 version",
      "level": 3,
      "content": "Source\n\n```\n$ git clone https://github.com/aduggan/hid-rmi.git -b rb14 # and then install it\n# depmod -a\n```\n\nThen install the xf86-input-synaptics packages.\n\nFeature still not working: pinch to zoom, 3rd mouse button\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "pcieport PCIe bus error",
      "level": 3,
      "content": "You may see the following errors in dmesg:\n\n```\nkernel: pcieport 0000:00:1c.0: PCIe Bus Error: severity=Corrected, type=Data Link Layer, id=00e0(Transmitter ID)\nkernel: pcieport 0000:00:1c.0:   device [8086:9d12] error status/mask=00001000/00002000\nkernel: pcieport 0000:00:1c.0:    [12] Replay Timer Timeout\n```\n\nTo avoid these log messages, add a kernel parameter:\n\n```\npci=noaer\n```\n\n"
    },
    {
      "title": "What works",
      "level": 3,
      "content": "Source\n\n- Wireless\n- Switchable graphics\n- Bluetooth\n- Keyboard light (hardware controlled)\n- UEFI boot\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Razer peripherals\n- Wikipedia:List of Razer products#Laptops\n- The Linux Corner on Razer Insider\n- Razer Systems Drivers[dead link 2025-04-06 ⓘ]Template:Dead·link\n- Razer laptop support\n\n"
    }
  ]
}