{
  "title": "Reposilite",
  "url": "https://wiki.archlinux.org/title/Reposilite",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From the project repository, reposilite is a:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the reposiliteAUR package. It can also be downloaded through Github Releases.\n\n"
    },
    {
      "title": "Configuration",
      "level": 4,
      "content": "Configuration files are located in /etc/reposilite :\n\n- default.env : configuration variables used to run reposilite (allocated memory, user, working directory, configuration location)\n- reposilite.cdn : main reposilite configuration file\n\n"
    },
    {
      "title": "Data directory",
      "level": 4,
      "content": "Reposilite data is stored in /var/lib/reposilite. This include default shared configuration database as well as repositories contents.\n\n"
    },
    {
      "title": "Service files",
      "level": 4,
      "content": "The package contains the reposilite.service systemd unit. It is not enabled by default.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Reposilite does the majority of its configuration through the web interface. When you first install reposilite you will not have any user to login as (reposilite designates users as \"tokens\"). Before creating the first token, ensure that reposilite.service is stopped.\n\nRun the reposilite binary as root:\n\n```\n# /usr/bin/reposilite\n```\n\nThis will start the server and a CLI interface in the terminal; the next set of commands will be run from the CLI (we will use ! to indicate that these command are run in the reposilite CLI):\n\n```\n! token-generate username m\n```\n\nRemember to replace username with the desired username, it is best to let reposilite generate you a secure token, but if you wish to use your own token, you can use the following command:\n\n```\n! token-generate --secret=\"your password\" username m\n```\n\nNow that you have generated the username (if you let reposilite generate your token, make sure to copy this down securely, a password manager is recommended), you can stop the reposilite server using the following command:\n\n```\n! stop\n```\n\nReposilite will then gracefully shutdown and detach from your terminal.\n\nYou can now start/enable reposilite.service and you will be able to access the reposilite web interface over http://127.0.0.1:8080.\n\n"
    }
  ]
}