{
  "title": "Rygel",
  "url": "https://wiki.archlinux.org/title/Rygel",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Rygel is a streaming media server compatible with many DLNA/UPnP clients including the Sony PlayStation, Microsoft Xbox, smart televisions, DLNA speakers and many smartphones. Rygel will automatically transcode media to a format compatible with the client device. It can also utilise published media hierarchies from external applications like Rhythmbox and DVB Daemon through the D-Bus MediaServer specification. It is under active development and is a part of the GNOME project.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the rygel package.\n\n"
    },
    {
      "title": "Starting",
      "level": 2,
      "content": "On a GNOME environment, go to Settings > Sharing > Media Sharing, then turn Media Sharing on. In Folders add or exclude the folders you want to share or not, and in Networks select in which network should the media be shared.\n\nOn non-GNOME environments, the rygel.service user unit can be enabled to have it start automatically.\n\nTo start rygel manually, any user can run in a terminal:\n\n```\n$ rygel -g 5\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Rygel can be configured globally (/etc/rygel.conf) or per-user (~/.config/rygel.conf). The default /etc/rygel.conf is well documented. The command rygel-preferences generates the ~/.config/rygel.conf and allows some basic configuration.\n\nMore information on these and other configuration options can be found with rygel.conf(5).\n\nIf you use rygel behind a firewall (nftables, iptables, etc.), add a rule to allow the connection to the listening port (see [1]). By default, rygel assigns a port dynamically which may change from one session to another if the /etc/rygel.conf sets port=0. To control the listening port (here 50000), start rygel as follows:\n\n```\n$ rygel -g -p 50000\n```\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "When starting Rygel from the command line, there are several options that might help you troubleshoot any strange behaviour. Find out more about these options with rygel(1).\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Rygel homepage in GNOME Wiki\n- Rygel FAQ in GNOME Wiki\n\n"
    }
  ]
}