{
  "title": "SABnzbd",
  "url": "https://wiki.archlinux.org/title/SABnzbd",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "SABnzbd is an open-source binary newsreader written in Python.\n\nFrom sabnzbd.org:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install sabnzbdAUR or sabnzbd-gitAUR.\n\n"
    },
    {
      "title": "SSL Support",
      "level": 3,
      "content": "Install python-pyopenssl to enable SSL support for news servers:\n\n- Transmission of data from the server to the NNTP client is encrypted, protecting your privacy\n- Decreasing the chances of throttling NNTP traffic done by the ISP.\n\n"
    },
    {
      "title": "Archive unpacking",
      "level": 3,
      "content": "- Install 7zip and unzip to allow unpacking of archives.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "SABnzbd is able to run globally (settings apply to all users) and locally (per user settings). The way of setting up SABnzbd depends on the way it is intended to be used. A local configuration may prove more useful on a desktop system when used by several people simultaneously.\n\nIf SABnzbd is started for the first time, the webinterface will present a setup wizard for configuring UI language and a single news server.\n\nFurther configuration can be done from within the UI (adding additional servers, setting folder paths etc.) or by editing sabnzbd.ini.\n\n"
    },
    {
      "title": "Global usage",
      "level": 3,
      "content": "Start/enable sabnzbd.service.\n\nAdd users to the sabnzbd user group to allow read/write access to SABnzbd files.\n\n"
    },
    {
      "title": "Running as a user",
      "level": 3,
      "content": "Alternatively, enable and start the sabnzbd@myuser.service to run SABnzbd under the preferred user.\n\n"
    },
    {
      "title": "Stopping SABnzbd",
      "level": 3,
      "content": "SABnzbd can be easily shutdown in the web-interface or the systemd sabnzbd.service unit.\n\nIt is also possible to shutdown a running (remote) SABnzbd client using the provided API:\n\n```\n$ curl \"http(s)://host:port/sabnzbd/api?mode=shutdown&apikey=API-key\"\n```\n\n"
    },
    {
      "title": "Accessing the web-interface",
      "level": 3,
      "content": "After starting SABnzbd, access the web-interface by browsing to http://127.0.0.1:8080.\n\n- SABnzbd can only be accessed on the running computer. Change host = 127.0.0.1 in /var/lib/sabnzbd/sabnzbd.ini to host = 0.0.0.0 (or the host IP-address) to allow access from another computer.\n- SABnzbd listens on port 8080. Change port = 8080 in /var/lib/sabnzbd/sabnzbd.ini to the preferred port.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- SABnzbd homepage\n- SABnzbd wiki\n\n"
    }
  ]
}