{
  "title": "Surf",
  "url": "https://wiki.archlinux.org/title/Surf",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "surf is a simple web browser based on WebKit/GTK. It is able to display websites and follow links. It supports the XEmbed protocol which makes it possible to embed it in another application. Furthermore, one can point surf to another URI by setting its XProperties.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the surfAUR package. Alternatively, there is the surf-gitAUR package for the development version.\n\nOptionally also install the dmenu package for URL-bar\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "surf is configured through its config.h file. A sample config.def.h file is included with the source and should be instructive.\n\nAs with other packages such as dwm, consider using the Arch Build System (ABS) and maintaining your own PKGBUILD with sources and md5sums for your own configuration and source files.\n\n"
    },
    {
      "title": "Patches & additional features",
      "level": 3,
      "content": "There are many user-created patches available from the offical site that greatly extend the functionality of surf. Patches can be applied to both the source surf.c file and the config.h file:\n\n```\n$ cd src/surf-version/\n$ patch -p1 < path/to/patch.diff\n```\n\n"
    },
    {
      "title": "Tabbed browsing",
      "level": 3,
      "content": "The tabbed-gitAUR program can be used with surf to create a simple tabbed browsing experience.\n\nA basic set-up:\n\n```\n$ tabbed surf -e\n```\n\nNote that to achieve a similar effect to Firefox or Chromium where upon closing the last tab, the browser exits, use instead:\n\n```\n$ tabbed -c surf -e\n```\n\nSee man page tabbed(1) for more details and possibilities.\n\n"
    },
    {
      "title": "Fuzzy font in Github",
      "level": 3,
      "content": "Install gnu-free-fonts or add this in your ~/.config/fontconfig/fonts.conf inside the fontconfig-tags:\n\n```\n<selectfont>\n   <rejectfont>\n     <pattern>\n       <patelt name=\"family\">\n         <string>Clean</string>\n       </patelt>\n     </pattern>\n   </rejectfont>\n </selectfont>\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- surf's official website\n- dmenu - Simple application launcher from the developers of dwm\n- Hacking surf thread\n\n"
    }
  ]
}