{
  "title": "Tftpd server",
  "url": "https://wiki.archlinux.org/title/Tftpd_server",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The Trivial File Transfer Protocol (TFTP) provides a minimalistic means for transferring files. It is generally used as a part of PXE booting or for updating configuration and firmware on devices which have limited memory such as routers, IP phones and printers.\n\n"
    },
    {
      "title": "Server",
      "level": 2,
      "content": "There are several TFTP server implementations, some of which are listed below.\n\n"
    },
    {
      "title": "tftp-hpa",
      "level": 3,
      "content": "Install tftp-hpa and then start tftpd.service.\n\nTo modify service parameters edit /etc/conf.d/tftpd.\n\n"
    },
    {
      "title": "URL rewriting",
      "level": 4,
      "content": "This server includes a useful URL rewriting feature via the --map-file option (--mapfile in some versions). It allows requests to be altered via regular expressions so the files on the server do not have to match the view the client sees, and different files can be returned to different clients even if they request the same file.\n\nConfigure a map by adding --map-file /etc/tftpd.map to /etc/conf.d/tftpd and creating a file such as this:\n\n```\n/etc/tftpd.map\n```\n\n```\n# Add the remote IP address as a folder on the front of all requests.\nr ^ \\i/\n```\n\nThis example file will result in each TFTP request being prefixed with the remote IP address. For example if the machine at 192.168.0.1 requests \"boot.bin\" and the TFTP server root is /srv/tftp then the file /srv/tftp/192.168.0.1/boot.bin will be returned (or /srv/tftp/::ffff:192.168.0.1/boot.bin if the server is listening on an IPv6 port).\n\nThe available map file options are documented in in.tftpd(8) ยง FILENAME REMAPPING.\n\n"
    },
    {
      "title": "Debugging",
      "level": 4,
      "content": "The --verbosity 5 option can be used to turn on all debugging messages. This is very useful for diagnosing why a machine will not successfully boot from the network, as the debug messages list all requests for files, whether rewrite rules were used, where the files were read from on the filesystem and whether the request was successful or not.\n\nIt is not possible to log messages to stdout/stderr, as only syslog is supported. This means the messages can be viewed with journalctl or similar.\n\n"
    },
    {
      "title": "atftp",
      "level": 3,
      "content": "Install atftp and then start atftpd.service.\n\nTo modify service parameters edit /etc/conf.d/atftpd.\n\n"
    },
    {
      "title": "uftpd",
      "level": 3,
      "content": "uftpdAUR is a simple (T)FTP server that can be run from the command line:\n\n```\n# uftpd -n -o ftp=0,tftp=69 /tmp/tftp\n```\n\nThe option -o ftp=0 disables the FTP server and only runs TFTP. The server runs in read-only mode by default and passing -o writable allows clients to put files on the server. The -o tftp=69 is redundant in the case of default port, but shows a way to select a different one.\n\n"
    },
    {
      "title": "dnsmasq",
      "level": 3,
      "content": "See dnsmasq#TFTP server.\n\n"
    },
    {
      "title": "tftp-hpa",
      "level": 3,
      "content": "Install tftp-hpa and then tftp your day away!\n\n```\n$ tftp\n```\n\n"
    },
    {
      "title": "atftp",
      "level": 3,
      "content": "The package atftp contains both a server and a client with interactive and batch mode. The client binary is atftp and supports both getting and putting files.\n\n"
    },
    {
      "title": "curl",
      "level": 3,
      "content": "Standard curl has an ability to connect to a TFTP server and upload a file via:\n\n```\n$ curl -T FILE tftp://HOST\n```\n\nDownload a file:\n\n```\n$ curl -o DESTINATION tftp://HOST/file\n```\n\nWhere file is relative to the TFTP root directory.\n\n"
    }
  ]
}