{
  "title": "ThinkPad Docks",
  "url": "https://wiki.archlinux.org/title/ThinkPad_Docks",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Laptop/Lenovo\n- Docking\n\nBusiness laptops manufactured by Lenovo and IBM under the ThinkPad brand have a proprietary connector at the bottom of the laptop that is used in junction with docking stations that enable the ThinkPad to be used as a desktop PC.\n\nThese docking stations can function in two ways:\n\n- Passive port replicators (no active components)\n- Active docks (active components such as USB hubs or USB 3.0 controllers)\n\nBoth of them are supported out-the-box by GNOME and KDE and should not require additional software. Otherwise you can use dockd.\n\n- Some modern ThinkPads with exotic NVIDIA graphics like the Quadro M2200 might not work with dockdAUR because the NVIDIA driver is buggy and causes a kernel crash. See Issue #3 on Github\n- If you are using a different environment than GNOME or KDE and you are connecting the dock through a thunderbolt connector, you may have to authorize the use of the thunderbolt device before you can use the dock. You can use bolt or tbtAUR to authorize devices. See Thunderbolt for more information.\n\n"
    },
    {
      "title": "Using dockd",
      "level": 2,
      "content": "To handle docks outside KDE and GNOME you will need to install a dock daemon that will auto-switch the monitors. dockdAUR is a dock daemon that was developed for light desktops and will auto switch the monitor configuration.\n\n"
    },
    {
      "title": "Installing",
      "level": 2,
      "content": "Install the dockdAUR package.\n\nThe daemon needs to know your current display configuration when the laptop is docked and undocked, so we need to configure the daemon first before using it.\n\n- Insert your ThinkPad into the dock\n- Configure the display layouts and resolutions using your desktop environments interface or xrandr\n- Write the profile when the ThinkPad is docked\n\n```\n# dockd --config docked\n```\n\n- Remove the ThinkPad from the dock\n- Configure the internal panel resolution and refresh rates using your desktop environments interface or xrandr\n- Write the profile when the ThinkPad is undocked\n\n```\n# dockd --config undocked\n```\n\n- Start/enable acpid.service (see acpid if needed).\n- If you are using i3, you need to manual autostart dockd as i3 is not XDG Autostart compatible\n\n```\n~/.config/i3/config\n```\n\n```\nexec --no-startup-id dockd --daemon\n```\n\n- Log out and log back in\n\nThe daemon should now be configured and ready to use. Insert the ThinkPad into the dock and observe if the daemon switches to your external display automatically.\n\nNote: **MUST** \n\n"
    },
    {
      "title": "Dock and undock hooks",
      "level": 2,
      "content": "As of dockd 1.21, you can define some hooks that run when the ThinkPad is docked and undocked.\n\nFor example, to disable Wi-Fi when docking and enable it when undocking:\n\n```\n/etc/dockd/dock.hook\n```\n\n```\nnmcli radio wifi off\n```\n\n```\n/etc/dockd/undock.hook\n```\n\n```\nnmcli radio wifi on\n```\n\n"
    },
    {
      "title": "Troubleshooting headset microphone on 4X10E52935 dock",
      "level": 2,
      "content": "This dock appears to use an OMTP standard wiring for the headset connector instead of the more common CTIA standard. Thus the pins (from tip to sleeve) are left channel, right channel, microphone, ground instead of left channel, right channel, ground, microphone. Adapters can be found by searching \"3.5mm OMTP to CTIA adapter\" on your favorite e-commerce site.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- dockd Documentation - ThinkPads.org\n- Docking Port - ThinkWiki\n\n"
    }
  ]
}