{
  "title": "Touchegg",
  "url": "https://wiki.archlinux.org/title/Touchegg",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Touchegg is a multitouch gesture program that runs as a user in the background, recognizes gestures, translates them to more conventional types of events and/or performs custom actions in response to them.\n\nTouchegg is not compatible with Wayland.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install touchegg package. Alternatively, it is also available at touchegg-gitAUR. Install toucheAUR if you want a desktop application to configure touchegg.\n\nFor X11 GNOME, one can also install the extension X11 Gestures in addition to touchegg.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The default configuration can be found in /usr/share/touchegg/touchegg.conf.\n\nTo customize it, copy the default configuration to ~/.config/touchegg/touchegg.conf and make your changes.\n\nIt is a basic XML file that defines various gestures. Please note that at this time, TAP_AND_HOLD, PINCH, and ROTATE do not appear to work.\n\nSee the list of triggers and the list of actions.\n\nThe two-fingers scrolling emulation has been dropped, due to bad user experience, in the recent 2.0 rewrite of touchegg. To restore it, install xdotool and add the following to the configuration file:\n\n```\n<gesture type=\"SWIPE\" fingers=\"2\" direction=\"DOWN\">\n      <action type=\"RUN_COMMAND\">\n        <repeat>true</repeat>\n        <command>xdotool click 4</command>\n        <decreaseCommand>xdotool click 5</decreaseCommand>\n      </action>\n    </gesture>\n    <gesture type=\"SWIPE\" fingers=\"2\" direction=\"UP\">\n      <action type=\"RUN_COMMAND\">\n        <repeat>true</repeat>\n        <command>xdotool click 5</command>\n        <decreaseCommand>xdotool click 4</decreaseCommand>\n      </action>\n    </gesture>\n```\n\nNote that on KDE, text gets selected while scrolling (see upstream issue 401).\n\n"
    },
    {
      "title": "Start on login",
      "level": 2,
      "content": "Enable touchegg.service, the client can then be autostarted.\n\n"
    }
  ]
}