{
  "title": "Trash management",
  "url": "https://wiki.archlinux.org/title/Trash_management",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "To prevent accidental deletion of files, you can use a trash can. To ensure compatibility between multiple applications, you can use software (CLI, GUI or Library) that follow the FreeDesktop.org's Trash specification.\n\n"
    },
    {
      "title": "Trash creation",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nSome GUI file managers, such as GNOME Files and Dolphin, natively support moving files into the trash. There are also some CLI tools:\n\n- glib2 provides a gio trash file... command to move files into the trash, while gio trash --empty empties the trash. See also \"trash\" in gio(1) § COMMANDS. The gvfs package is required to fully support trash management through the gio trash command.\n- kde-cli-tools provides a kioclient5 command that can be used as kioclient5 move file trash:/ to move file to the trash.\n- trash-cli — A command-line interface implementing FreeDesktop.org's Trash specification.\n\n- trashman — A Python trash manager.\n\n- rmtrash — trash-put made compatible to GNUs rm and rmdir.\n\n- trash-d — drop-in replacement for GNU rm, focusing on compatibility and with much better performance, written in D.\n\n- trashy — simple, fast, and featureful alternative to rm and trash-cli written in rust\n\n- gtrash — A Featureful Trash CLI manager written in Go\n\n- rmw (ReMove to Waste) — A configurable CLI trash management utility that can purge your trash after X days and integrate with FreeDesktop.org's Trash specification, written in C\n\n"
    },
    {
      "title": "Trash space usage management",
      "level": 2,
      "content": "To prevent the trash can from using too much space, you can empty it yourself, or have a pruning policy\n\n"
    },
    {
      "title": "Software list",
      "level": 3,
      "content": "- autotrash — Tool to automatically purge old trashed files\n\n"
    },
    {
      "title": "Criteria",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n- make sure to have at least x MB of free space\n- delete files older than x days\n- only empty if you have less than x MB of free space (useful in combination of previous criteria)\n- maximum trash can size\n- file size\n- file type\n- original path\n\n"
    },
    {
      "title": "Automation",
      "level": 3,
      "content": "To automate emptying the trash can, you can use cron, systemd/Timers, or inotify (using inotify, only new deletion would trigger the trash can automation)\n\n"
    },
    {
      "title": "External drives",
      "level": 4,
      "content": "/etc/fstab might not be set correctly. Note that ID must be replaced by your own user id by $ id.\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                <dir>              <type>    <options>         <dump> <fsck>\nUUID=75667752-8b06-11ea-bc55-0242ac130003 /externalDrive     ntfs-3g   defaults,uid=ID   0      1\n```\n\nMake sure that the root directory of the drive contains ~/.Trash-1000/{expunged,files,info} and set relevant read permissions for the directory and sub-directory.\n\n"
    }
  ]
}