{
  "title": "Twm",
  "url": "https://wiki.archlinux.org/title/Twm",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Window manager\n\ntwm is a window manager for Xorg. It is a small program, being built against Xlib rather than using a widget library, and as such, it is very light on system resources. Though simple, it is highly configurable; fonts, colours, border widths, title bar buttons, etc. can all be set by the user.\n\ntwm was written by Tom LaStrange, a developer who was frustrated by the limitations of uwm (Ultrix Window Manager), the only window manager around when X11 was first released. [1]\n\ntwm supplanted uwm as the default window manager supplied with X11 from the X11R4 release in 1989. [2]\n\ntwm has stood for Tom's Window Manager, Tab Window Manager and more recently Timeless Window Manager.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "twm is installed through the xorg-twm package.\n\n"
    },
    {
      "title": "Starting",
      "level": 2,
      "content": "Run twm with xinit.\n\nYou can also start twm with a display manager. The twm.desktop file does not exist so we have to create it at /usr/share/xsessions/. In the newly created /usr/share/xsessions/twm.desktop file, copy and paste:\n\n```\n/usr/share/xsessions/twm.desktop\n```\n\n```\n[Desktop Entry]\nName=twm\nComment=xorg-twm\nTryExec=twm\nExec=twm\nType=Application\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "By default, twm looks very dated and unintuitive. By creating the file ~/.twmrc, you can customize twm to make it more friendly.\n\ntwm(1) gives full details of the commands which can be used in your ~/.twmrc file.\n\n"
    },
    {
      "title": ".twmrc examples",
      "level": 3,
      "content": "Many ~/.twmrc files have been posted online. Some examples include:\n\n- Sample .twmrc file (Physics Department Unix Login Mini-Howto, W&M University through Wayback Machine)\n- sample twmrc files[dead link 2024-11-06 ⓘ] (Apple Open Source/X11/X11-0.46.4)\n- system.twmrc[dead link 2024-11-06 ⓘ] (Apple Open Source/X11/X11-0.46.4)\n- twm configs - 1 (custompc.plus.com)\n- twm configs - 2 (custompc.plus.com)\n\nA Google search for \"twmrc\" can also be used to find new ideas.\n\n"
    },
    {
      "title": "Patched version",
      "level": 3,
      "content": "There is a patched version, not in the repositories, with updated features such as transparency. A description and build script is available on the xorg mailing list. It can be tried out by installing xcompmgr, running the build script, putting the resulting twm and dot.twmrc files in a convenient directory, and editing the ~/.xinitrc file so that the last two lines are\n\n```\nxcompmgr -o 0.3  -c -r 8 -t -10 -l -12 &\n/path-to-directory/twm -visual TrueColor -depth 32 -f /path-to-directory/dot.twmrc\n```\n\n"
    },
    {
      "title": "Oversized window titles and menus",
      "level": 3,
      "content": "You might find that titlebars and menu entries in TWM are extremely large - twice the size that one might typically expect. This is a locale issue with TWM that occurs when a UTF-8 locale is used. Setting the locale to C fixes the issue. See [3].\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Graham's TWM Page!\n- Graham's TWM Page 2\n- TWM -- Revised Edition -- Again\n- twm(1) man page\n- twm official Gitlab\n- twm on Wikipedia\n- X Window System User's Guide - Ch. 3 Using the twm Window Manager\n- X Window System User's Guide - Ch. 10 Customizing the twm Window Manager\n\n"
    }
  ]
}