{
  "title": "V2Ray",
  "url": "https://wiki.archlinux.org/title/V2Ray",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Qv2ray\n\nV2Ray is the core tool of Project V, which is mainly responsible for the realization of network protocols and functions, and communicates with other Project V.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the v2ray package. For the development version, install the v2ray-gitAUR package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "V2Ray configuration is done with a JSON formatted file. See Config Reference. There are several methods of configuration, a good practice is to use WebSocket+TLS+Web.\n\n"
    },
    {
      "title": "From the command line",
      "level": 3,
      "content": "V2Ray is started with the v2ray command. Run v2ray help and v2ray help run to see its command line help.\n\n"
    },
    {
      "title": "Service management",
      "level": 3,
      "content": "Start/enable v2ray.service.\n\n"
    },
    {
      "title": "Routing rules",
      "level": 3,
      "content": "See Routing of V2Ray.\n\nThe preset routing rule files are geosite.dat and geoip.dat in /usr/share/v2ray. They are provided by the v2ray-domain-list-community and v2ray-geoip packages respectively. These two packages are installed by default as dependencies of v2ray.\n\n"
    },
    {
      "title": "Replacing the preset routing rule files",
      "level": 4,
      "content": "There are ready-made packages for some routing rule files. For example, you can install the v2ray-rules-dat-gitAUR package for @Loyalsoldier/v2ray-rules-dat.\n\nFor routing rule files without ready-made packages, you can create packages and install or remove v2ray-domain-list-community and v2ray-geoip without removing the dependent package and put the routing rule files in the /usr/share/v2ray directory.\n\n"
    },
    {
      "title": "Multiple configs",
      "level": 3,
      "content": "With multiple configs, it's convenient to achieve things like dropping new inbounds to the config directory without having to touch the master config.\n\n"
    },
    {
      "title": "Rules of multiple configs",
      "level": 4,
      "content": "- For top-level objects, objects in the latter config file override or supplement the former.\n- Inbounds and outbounds are array structures, they have special rules: If arrays in the latter config file have 2 or more elements, arrays in the latter config file overwrite the former config file. If arrays in the latter config file have only 1 element, overwrite the original element with the same tag; if the element cannot be found: For inbounds, add them to the end. For outbounds, add them to the front; if the name of config file contains tail, add the outbounds to the end.\n\n- If arrays in the latter config file have 2 or more elements, arrays in the latter config file overwrite the former config file.\n- If arrays in the latter config file have only 1 element, overwrite the original element with the same tag; if the element cannot be found: For inbounds, add them to the end. For outbounds, add them to the front; if the name of config file contains tail, add the outbounds to the end.\n\n- For inbounds, add them to the end.\n- For outbounds, add them to the front; if the name of config file contains tail, add the outbounds to the end.\n\n"
    },
    {
      "title": "Enable multiple configs with systemd",
      "level": 4,
      "content": "To enable multiple configs with systemd, you can create the following drop-in file:\n\n```\n# systemctl edit --drop-in=multi_config v2ray.service\n```\n\n```\nExecStart=\nExecStart=/usr/bin/v2ray run -confdir /absolute/path/to/dir/\n```\n\n"
    },
    {
      "title": "Failed with result 'exit-code'",
      "level": 3,
      "content": "If you see this error in the log: Failed with result 'exit-code', it is because V2Ray does not have write permission to /var/log/v2ray/access.log. Use the following command to solve the problem.\n\n```\nchown -R nobody /var/log/v2ray\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- V2Fly offical Website & Documentation\n- V2Ray Beginner's Guide\n- Qv2ray official Website & Documentation\n\n"
    }
  ]
}