{
  "title": "Xrdp",
  "url": "https://wiki.archlinux.org/title/Xrdp",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "xrdp is a daemon that supports Microsoft's Remote Desktop Protocol (RDP). It uses Xvnc or xorgxrdp as a backend.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the xrdpAUR package (or alternatively xrdp-gitAUR for the development version). This only supports Xvnc as the backend.\n\n"
    },
    {
      "title": "Xorg backend",
      "level": 3,
      "content": "To use xorgxrdp instead for the backend, install the xorgxrdpAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "First, start the xrdp service. You should be able to connect an RDP client to the host on the default RDP port (3389). If successful, you will be greeted with the xrdp session manager window which allows you to choose between Xorg or Xvnc sessions and provides inputs for user authentication. The session manager UI can be highly customized by modifying /etc/xrdp/xrdp.ini.\n\nThe parameters used to start Xorg and Xvnc display servers can be configured in /etc/xrdp/sesman.ini.\n\nAfter successfully starting a display server, xrdp will execute /etc/xrdp/startwm.sh by default. This script is meant to start a window manager (similar to .xinitrc) and will read from ~/.xinitrc or /etc/X11/xinit/xinitrc if they exist. It is recommended to edit ~/.xinitrc to start your desktop environment or window manager, but you can also edit /etc/xrdp/startwm.sh.\n\nIf you just close the session window and RDP connection, you can access the same session again next time you connect with RDP. When you exit the window manager or desktop environment from the session window, the session will close and a new session will be opened the next time.\n\n"
    },
    {
      "title": "Autostart at boot",
      "level": 3,
      "content": "The xrdpAUR package contains service files for systemd. Enable xrdp.service.\n\n"
    },
    {
      "title": "Graphical acceleration",
      "level": 3,
      "content": "For Xorg sessions, you can enable OpenGL and Vulkan graphical acceleration by installing xorgxrdp-glamorAUR for Intel and AMD GPUs and xorgxrdp-nvidiaAUR for NVIDIA GPUs.\n\n"
    },
    {
      "title": "Sound",
      "level": 3,
      "content": "Install the necessary PulseAudio modules with pulseaudio-module-xrdpAUR.\n\nfor PipeWire user, install pipewire-module-xrdpAUR.\n\n"
    },
    {
      "title": "Non-root user",
      "level": 3,
      "content": "Include the following lines in Xwrapper.config:\n\n```\n/etc/X11/Xwrapper.config\n```\n\n```\nallowed_users=anybody\nneeds_root_rights=no\n```\n\nIf the above lines are not present, the remote desktop connection from applications like Remmina will start with an empty screen.\n\n"
    },
    {
      "title": "Black box around cursor",
      "level": 3,
      "content": "If you encounter black box around mouse pointer create ~/.Xresources-xrdp with line Xcursor.core:1 and load it in ~/.xinitrc like\n\n```\nxrdb ~/.Xresources-xrdp\nexec startlxde\n```\n\nYou may need to install xorg-xrdb.\n\n"
    },
    {
      "title": "Black screen",
      "level": 3,
      "content": "You may get a black screen after logging into the session manager.\n\nThe last line in ~/.xinitrc may look like exec $(get_session \"$1\"). It needs a default parameter, if not supplied in /etc/xrdp/startwm.sh.\n\nOne can edit the last line of ~/.xinitrc to be exec $(get_session \"${1:-\"$SESSION\"}\") or exec $(get_session \"${1:-xfce}\"), depending on your preference.\n\nAlternatively, you can also edit your call to ~/.xinitrc in /etc/xrdp/startwm.sh; eg. . ~/.initrc xfce. This will affect all users.\n\n"
    },
    {
      "title": "Exit upon disconnect",
      "level": 3,
      "content": "You may get your windows exit after disconnect, if your ~/.xinitrc has --exit-with-session set in the dbus_args.\n\nTry copying ~/.xinitrc to ~/.xrdpinitrc, removing --exit-with-session, and updating /etc/xrdp/startwm.sh to call ~/.xrdpinitrc instead of ~/.xinitrc.\n\nDirectly editing ~/.xinitrc to remove --exit-with-session may cause unexpected bahavior using non-xrdp sessions.\n\nPer dbus-launch(1):\n\n"
    },
    {
      "title": "Black screen with a desktop environment",
      "level": 3,
      "content": "If you get a black screen and you use a desktop environment, it may be a result of D-Bus not being properly initialized. Some DEs (like KDE Plasma) might also be able to restore fully working applications/windows from a previous session, which makes it seem that \"only plasmashell\" is missing.\n\nTry running the desktop environment with dbus-launch --exit-with-session in your ~/.xinitrc file. For KDE Plasma, you can use the command /usr/lib/plasma-dbus-run-session-if-needed startplasma-x11 or dbus-launch --exit-with-session startplasma-x11.\n\n"
    },
    {
      "title": "Green screen",
      "level": 3,
      "content": "If the login dialog appears, but no desktop environment starts when you click OK, change param=Xorg to param=/usr/lib/Xorg in /etc/xrdp/sesman.ini.\n\n"
    },
    {
      "title": "loginctl or systemctl --user not working",
      "level": 3,
      "content": "Try commenting out all the references to systemd-home in /etc/pam.d/system-auth. See this issue.\n\n"
    },
    {
      "title": "Prompts for gnome-keyring or KDE Wallet",
      "level": 3,
      "content": "If you are prompted to login to gnome-keyring or [KDE Wallet] when your session starts, modify the file /etc/pam.d/xrdp-sesman as follows:\n\n```\n/etc/pam.d/xrdp-sesman\n```\n\n```\n#%PAM-1.0\nauth        include     system-remote-login\n-auth       optional    pam_gnome_keyring.so\n-auth       optional    pam_kwallet5.so\naccount     include     system-remote-login\npassword    include     system-remote-login\n-password   optional    pam_gnome_keyring.so    use_authtok\nsession     include     system-remote-login\n-session    optional    pam_gnome_keyring.so    auto_start\n-session    optional    pam_kwallet5.so         auto_start\n```\n\nThen, add etc/pam.d/xrdp-sesman (no leading slash) to NoUpgrade in /etc/pacman.conf. If you only use gnome-keyring it is not necessary to include the kwallet5 lines, and vice versa.\n\n"
    },
    {
      "title": "Prevent autostart items from starting",
      "level": 3,
      "content": "To prevent user defined ~/.config/autostart items from starting you can set the autostart directory param on the session in the ~/.xinitrc to use only the global /etc/xdg/autostart directory.\n\n```\nget_session(){\n    local dbus_args=(--sh-syntax)\n    case \"$SESSION\" in\n        awesome) dbus_args+=(awesome) ;;\n        bspwm) dbus_args+=(bspwm-session) ;;\n        budgie) dbus_args+=(budgie-desktop) ;;\n        cinnamon) dbus_args+=(cinnamon-session -a /etc/xdg/autostart) ;;\n```\n\n"
    },
    {
      "title": "No sound",
      "level": 3,
      "content": "If you are using pipewire or pulseaudio, check if your modules are installed. In AUR, it's pipewire-module-xrdp and pulseaudio-module-xrdp. Remember to logout and login for them to take effect\n\nThis could also be a symptom of an issue with loginctl, so try that fix above. The following error may be encountered in the system journal:\n\n```\nFailed to load module \"module-x11-publish\" (argument: \"display=:10.0 xauthority=\"): initialization failed.\n```\n\nThis is the result of systemd improperly starting PulseAudio. One workaround is to disable the user unit files pulseaudio.service and pulseaudio.socket either for your own user or for all users, and make PulseAudio start when needed by setting autospawn to yes in /etc/pulse/client.conf.\n\nIf sound still does not work, try manually starting PulseAudio with pulseaudio & in your ~/.xinitrc.\n\n"
    },
    {
      "title": "Two-finger scrolling is too fast",
      "level": 3,
      "content": "Use the xorg backend, make sure xorgxrdp is 0.9.19 or newer. Then add XRDP_XORG_TOUCHPAD_SCROLL_HACK=yes to the [SessionVariables] section of /etc/xrdp/sesman.ini.\n\nSee upstream issue #150 for details.\n\n"
    },
    {
      "title": "Restricted functionality within remote system",
      "level": 3,
      "content": "A user may not have the same access permissions when logged into a system remotely as the same user does when logged in locally. Additional configuration may be required of the polkit permissions policies to grant access, including to mounted drives or to control network connections.\n\n"
    },
    {
      "title": "Mounted drives",
      "level": 4,
      "content": "For remote access permissions to mounted drives see udisks#Permissions.\n\n"
    },
    {
      "title": "NetworkManager",
      "level": 4,
      "content": "For remote access permissions to NetworkManager see NetworkManager#Set up PolicyKit permissions.\n\n"
    },
    {
      "title": "H.264 codec",
      "level": 3,
      "content": "xrdp since 0.10.2 offers H.264 as the preferred codec. The default is turned for performance and may cause video quality degradation or sluggish, depending on the GPU. You can tune this by editing /etc/xrdp/gfx.toml. See man gfx.toml for the list of options. Usually, you could try preset=\"medium\" if video quality is not good, or order = [\"RFX\", \"H.264\"] if you are in a good network and H.264 is causing more latency.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- TigerVNC - VNC, an alternative to RDP, also used as backend here.\n- freerdp a rdesktop fork that supports RDP 7.1 features including network level authentication (NLA). It primarily consists of the xfreerdp client. In addition, the freerdp-shadow-cli command provides a quick and easy way to start an RDP server.\n\n"
    }
  ]
}