{
  "title": "9vx",
  "url": "https://wiki.archlinux.org/title/9vx",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "9vx is an implementation of the simple x86 virtual machine vx32 specifically designed for running real Plan9 on other host systems.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the vx32-gitAUR package.\n\n"
    },
    {
      "title": "A short tutorial",
      "level": 2,
      "content": "After installing 9vx:\n\n- Extract a Plan9 root file system (ISOs from historical releases[dead link 2025-04-06 ⓘ] (official Plan 9 website is archived), 9atom or 9front all should work) into your directory of choice \"/path/to/plan9\" (9vx defaults to the directory /usr/local/plan9vx)\n- make sure that /opt/vx32/bin is in your PATH\n- invoke \"9vx -r /path/to/plan9 -u glenda\" to start as user Glenda, a local system administrator user account which can be used for installing programs and changing system settings. If you run the official Plan9 root file system, you will here also get a small tutorial about how to use rio and acme.\n- invoke \"9vx -r /path/to/plan9\" to start as your user (at first run, write /sys/lib/newuser at the rc prompt to set up your environment).\n\n"
    },
    {
      "title": "Problems",
      "level": 2,
      "content": "Running Plan9 from a directory can be very handy, especially since you easily can move files into your virtual system from your host system. It does however come with a cost, which is related to user permissions. You will most likely run into issues where directories can not be created since the virtual Plan9 system lacks write permissions.\n\n"
    },
    {
      "title": "Installing Plan9 on a disk image",
      "level": 3,
      "content": "One alternative to overcome this is to install a Plan9 according to these instructions.\n\n"
    },
    {
      "title": "Putting the Plan9 root file system in an insecure directory",
      "level": 3,
      "content": "A simpler but less secure way to solve the issue can be to utilize\n\n```\nchmod -R 777 /path/to/plan9/root/\n```\n\nThis way, both user and glenda will be able to write to the plan9 root system and add directories.\n\n"
    },
    {
      "title": "Alternatives",
      "level": 2,
      "content": "Recent advances in 9front and possibly 9atom makes those distributions possible to install and boot under virtualbox. Things that may be needed to make them work:\n\n- Use the PIIX3 IDE controller\n- install support for USB v2.\n\nAlso, for the CWFS of 9front, you need to make a disk image of at least 12 GiB.\n\n"
    }
  ]
}