{
  "title": "Acer Aspire E11 Series",
  "url": "https://wiki.archlinux.org/title/Acer_Aspire_E11_Series",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nDevice | Working\nIntel graphics | Yes\nNetwork | Yes\nBroadcom wireless | Manual\nAtheros Wireless | Yes\nALSA | Yes\nTouchpad | Manual\nWebcam | Yes\nCard Reader | Yes\nPower management | No\n\nAspire E11 Series\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "- Should you wish to return to Windows 8.1 with Bing, it is imperative to #Create a recovery drive. The correct installation medium is only available to system manufacturers, and you will have to either use this recovery drive, or send the device back for repair to return to the original state.\n- The BIOS firmware in Legacy mode (including latest versions) has several bugs (inability to turn off or suspend the computer, kernel panics, etc). Use UEFI instead.\n\nPrior to installation, download and install the latest firmware update from Acer under Windows. Older versions of the firmware can only boot from the (black) USB 2.0 port.\n\nTo recover the Windows key at a later stage, run:\n\n```\n$ hexdump -C /sys/firmware/acpi/tables/MSDM\n```\n\nNote that this key is tied to the particular laptop model and unusable elsewhere. See also [1].\n\n"
    },
    {
      "title": "Create a recovery drive",
      "level": 3,
      "content": "A recovery drive can made with the preinstalled Acer eRecovery Management application. This requires a USB-attached flash drive or hard disk with at least 16 GB free space available, and presence of the C:/OEM directory. All present data on the target drive will be lost.\n\nChoose the option Create Factory Default Backup, select the partition Windows is installed on, and click start. Remove the drive afterwards - booting from the device will now start the recovery software. See [2] for more information.\n\n"
    },
    {
      "title": "Booting",
      "level": 3,
      "content": "The Acer E3-111 does not have an optical drive.\n\nBoth UEFI and Legacy (BIOS) boot are supported. To switch modes, press F2 at the boot splash screen to enter the EFI setup, then select the Boot tab. Alternatively, access the EFI setup by rebooting in Windows.\n\nDisable Secure Boot, then follow the installation guide. An Ethernet connection is recommended, as the needed wireless drivers are not included in the installation medium.\n\n- eMMC device names start with /dev/mmcblk instead of the typical /dev/sda.\n- Use the rootwait kernel parameter since the integrated flash storage is not available instantly after kernel startup.\n- Due to limited RAM, it is recommended to create a swap partition of at least 2 GB in size.\n- A UEFI boot entry may not appear upon booting the device. The solution is to copy the .efi file to the location Windows uses. See UEFI#UEFI boot loader does not show up in firmware menu for details.\n\n"
    },
    {
      "title": "Wireless",
      "level": 3,
      "content": "To use the Broadcom BCM43142 chipset is, install broadcom-wl, and load the module:\n\n```\n# modprobe wl\n```\n\nThe system will now recognize the interface as wlp2s0. See Broadcom wireless and Wireless for details.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "The E11 series include a Precision Touchpad, which supports a variety of touch gestures. To enable the touchpad, append the i8042.nopnp kernel parameter. See Touchpad Synaptics for configuration details.\n\n"
    },
    {
      "title": "Power Management",
      "level": 3,
      "content": "You may need to use the linux-lst kernel for full support.\n\n"
    },
    {
      "title": "Suspend and Hibernate",
      "level": 4,
      "content": "Suspend and Hibernate should work after following Power management/Suspend and hibernate.\n\n"
    },
    {
      "title": "GPU",
      "level": 3,
      "content": "See Intel graphics#AccelMethod.\n\n"
    },
    {
      "title": "Start up and shutdown freeze",
      "level": 3,
      "content": "If you have an issue where the computer freezes during start up and shutdown, requiring multiple reboots, try adding the following to /etc/modprobe.d/blacklist.conf\n\n```\nblacklist dw_dmac\nblacklist dw_dmac_core\n```\n\nSee also [3] [4]\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Disassembly Acer E11 (RAM, HDD upgrade)\n- Installing Linux on Acer E11-111 (ES1-111-C3NT)\n\n"
    }
  ]
}