{
  "title": "Acer C720",
  "url": "https://wiki.archlinux.org/title/Acer_C720",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The Acer C720 Chromebook (and newer Chromebooks in general) features a \"legacy boot\" mode that makes it easy to boot Linux and other operating systems. The legacy boot mode is provided by the SeaBIOS payload of Coreboot. SeaBIOS behaves like a traditional BIOS that boots into the MBR of a disk, and from there into your BIOS-compatible boot loaders.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Go to the Chrome OS devices page, read the Introduction and continue by following the Installation guide.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "For information on general Chromebook post installation configuration (hotkeys, power key handling ...) see the Post installation configuration on the Chrome OS devices page.\n\n"
    },
    {
      "title": "Touchpad Configuration",
      "level": 3,
      "content": "See the libinput article on how to install and setup your touchpad.\n\n"
    },
    {
      "title": "Improving WLAN and BT performance",
      "level": 3,
      "content": "The C720 comes with Atheros AR9462 WLAN and Bluetooth chip which is supported by the ath9k kernel module, the following kernel module parameters to the ath9k module can help to affect the performance, quality and power consumption of the chip.\n\n```\n/etc/modprobe.d/ath9k.conf\n```\n\n```\noptions ath9k bt_ant_diversity=1 ps_enable=0\n```\n\nDetails of possible settings are below.\n\n"
    },
    {
      "title": "Bluetooth coexistence",
      "level": 4,
      "content": "Both Bluetooth and WiFi can use 2.4 GHz, which can cause interference. You can enable Bluetooth coexistence to improve the performance of the card with the parameter btcoex_enable=1.\n\n"
    },
    {
      "title": "Power saving",
      "level": 4,
      "content": "You can enable power savings with the option ps_enable=1 to reduce power usage, though it has been suggested that enabling it might be related to system freezes and also to dropouts so if you encounter such issues then you might want to make sure it is disabled (ps_enable=0).\n\n"
    },
    {
      "title": "Improving signal quality",
      "level": 4,
      "content": "Enable antenna diversity with the option bt_ant_diversity=1 to improve the signal quality and boost performance. However, keep in mind that this disables the bluetooth interface and, as such, bluetooth coexistence must not be loaded at the same time.\n\n"
    },
    {
      "title": "Fixing decrease in bandwidth",
      "level": 4,
      "content": "If you are experiencing a decrease in bandwidth at seemingly random times try switching from hardware to software wireless encryption as explained in Wireless network configuration#ath9k.\n\n"
    },
    {
      "title": "Fix wakeup from suspend on lid close",
      "level": 3,
      "content": "When the lid of the C720 is closed, the top of the screen presses against the touchpad, instantly waking the computer from suspend. To disable wakeup by touchpad, create the following file:\n\n```\n/etc/tmpfiles.d/disable-touchpad-wakeup.conf\n```\n\n```\nw /proc/acpi/wakeup - - - - TPAD\n```\n\nTo check the current state:\n\n```\n# grep TPAD /proc/acpi/wakeup\n```\n\nAlternatively, it may be toggled manually by running:\n\n```\n# echo TPAD > /proc/acpi/wakeup\n```\n\nThis method does not persist after a reboot.\n\n"
    },
    {
      "title": "Lots of ehci errors in dmesg after resume",
      "level": 3,
      "content": "See Chrome OS devices#Fixing suspend. Additionally, [1], [2], [3], and [4] may be helpful.\n\nOne symptom may be that it cannot properly shut down or reboot.\n\n"
    },
    {
      "title": "Locating the Write-Protect Screw",
      "level": 2,
      "content": "- Remove the bottom panel of the laptop by removing the 12 visible screws and another one underneath the warranty sticker.\n- Separate the plastic starting at the back.\n- Remove completely the write-protect screw from the motherboard, which is labelled as #7 in this picture.\n\n"
    },
    {
      "title": "System freezes",
      "level": 3,
      "content": "See power saving section at Improving WLAN and BT performance.\n\nAdditionally see SSD#Troubleshooting if the system freezes are associated with hard drive errors in the system's journal.\n\n"
    },
    {
      "title": "Internal microphone not working",
      "level": 3,
      "content": "If your internal microphone is not working (for example, in Skype), select \"Microphone (unplugged)\" as your input source in the PulseAudio Volume Control. Your internal microphone should now work. [5]\n\nSee also Chrome OS devices#Fixing audio for another possible solution.\n\n"
    },
    {
      "title": "System shutdown on battery",
      "level": 3,
      "content": "If you are on battery and the system shutdown when you use the keyboard, it is probably a battery switch mulfunction (cover do not press it all time), labbeled #5 in this picture. It is a safety mechanism to prevent the Acer C720 from being powered by the battery while the cover is removed.\n\nYou can bypass this switch with a screw inserted in hole #6.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Chromium OS Acer C720 & C720P Developer Page\n- BBS topic\n- Unbricking with flashrom using the Raspberry Pi, requires SOIC clip, See GPIO matrix and pictures. also there is a BeagleBone method.\n- Configuration files with optimization tweaks for Haswell devices used by default in the GalliumOS Linux distribution.\n\n"
    }
  ]
}