{
  "title": "Advanced Linux Sound Architecture/Troubleshooting",
  "url": "https://wiki.archlinux.org/title/Advanced_Linux_Sound_Architecture/Troubleshooting",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The alsa-utils package contains the alsa-info.sh script, which can be used to gather detailed data on the ALSA state.\n\nSee also SoundcardTesting.\n\n"
    },
    {
      "title": "Output is muted after reboot",
      "level": 3,
      "content": "Run the following command:\n\n```\n# alsactl restore\n```\n\nIf the problem persists, verify that the Auto-Mute option in alsamixer(1) is set to Disabled.\n\n"
    },
    {
      "title": "Volume is too low",
      "level": 3,
      "content": "Run alsamixer and try to increase the value of the sliders, unmuting channels if necessary. Note that if you have many sliders, you may have to scroll to the right to see any missing sliders.\n\nIf all the sliders are maxed out, and the volume is still too low, you can try running the following script to reset your codec settings:\n\n```\n$ wget -O hda-analyzer.py https://git.alsa-project.org/?p=alsa.git;a=blob_plain;f=hda-analyzer/run.py\n```\n\nClose the analyzer, and when prompted as to whether you want to reset the codecs, say \"yes\".\n\nIf the volume is still too low, run alsamixer again: resetting the codecs may have caused new sliders to become enabled and some of them may be set to a low value.\n\n"
    },
    {
      "title": "Volume is still too low",
      "level": 3,
      "content": "If you are facing low volume even after maxing out your speakers/headphones, you can give the softvol plugin a try. Add the following to /etc/asound.conf.\n\n```\n/etc/asound.conf\n```\n\n```\npcm.!default {\n    type plug\n    slave.pcm \"softvol\"\n}\n\npcm.softvol {\n    type softvol\n    slave {\n        pcm \"dmix\"\n    }\n    control {\n        name \"Pre-Amp\"\n        card 0\n    }\n    min_dB -5.0\n    max_dB 20.0\n    resolution 6\n}\n```\n\nAfter the changes are loaded successfully, you will see a Pre-Amp section in alsamixer. You can adjust the levels there.\n\n- Setting a high value for Pre-Amp can cause sound distortion, so adjust it according to the level that suits you.\n- Some audio codecs may need to have settings adjusted in the HDA Analyzer (see #Volume is too low) in order to achieve proper volume without distortion. Checking the HP option under widget control in the Playback Switch (Node[0x14] PIN in the ALC892 codec, for instance) can sometimes improve audio quality and volume significantly.\n\n"
    },
    {
      "title": "Random lack of sound on startup",
      "level": 3,
      "content": "You can quickly test sound by running speaker-test. If there is no sound, you may see something similar to:\n\n```\nALSA lib pcm_dmix.c:1022:(snd_pcm_dmix_open) unable to open slave\nPlayback open error: -16\nDevice or resource busy\n```\n\nIf you have no sound on startup, this may be because your system has multiple sound cards, and their order may sometimes change on startup. If this is the case, try setting the default sound card.\n\nIf you use MPD and the above configuration tips do not work, try following https://mpd.wikia.com/wiki/Configuration#ALSA_MPD_software_volume_control.\n\n"
    },
    {
      "title": "No microphone input",
      "level": 3,
      "content": "In alsamixer(1), make sure that all the volume levels are up under recording, and that CAPTURE is toggled active on the microphone (e.g. Mic, Internal Mic) and/or on Capture (in alsamixer, select these items and press Space). Try making positive Mic Boost and raising Capture and Digital levels higher; this may make static or distortion, but then you can adjust them back down once you are hearing something when you record.\n\nAs the PulseAudio wrapper is shown as \"default\" in alsamixer, you may have to press F6 to select your actual sound card first. You may also need to enable and increase the volume of Line-in in the Playback section.\n\nTo test the microphone, run these commands (see arecord(1) for further information):\n\n```\n$ arecord --duration=5 --format=dat test-mic.wav\n$ aplay test-mic.wav\n```\n\nAlternatively, you can run this command:\n\n```\n$ arecord -vv --format=dat /dev/null\n```\n\nalongside alsamixer to easily identify channel which you should select and unmute.\n\nTo test a particular device, use the --device parameter followed by the hardware PCM name in the form hw:C,D for card C device D, or plughw:C,D for plugged hardware. For instance:\n\n```\n$ arecord -vvv --format=dat --device=plughw:0,0 /dev/null\n```\n\nIf all fails, you may want to eliminate hardware failure by testing the microphone with a different device.\n\nFor at least some computers, muting a microphone (MM) simply means its input does not go immediately to the speakers. It still receives input.\n\nSome programs use try to use OSS as the main input software. If you have enabled the snd_pcm_oss, snd_mixer_oss or snd_seq_oss kernel modules previously (they are not loaded by default), try unloading them.\n\nSee also:\n\n- #Wrong model autodetection\n- Record from mic\n\n"
    },
    {
      "title": "Setting the default microphone/capture device",
      "level": 3,
      "content": "Some applications (Pidgin, Adobe Flash) do not provide an option to change the capture device. It becomes a problem if your microphone is on a separate device (e.g. USB webcam or microphone) than your internal sound card. To change only the default capture device, leaving the default playback device as is, you can modify your ~/.asoundrc file to include the following:\n\n```\n~/.asoundrc\n```\n\n```\npcm.usb\n{\n    type hw\n    card U0x46d0x81d\n}\n\npcm.!default\n{\n    type asym\n    playback.pcm\n    {\n        type plug\n        slave.pcm \"dmix\"\n    }\n    capture.pcm\n    {\n        type plug\n        slave.pcm \"usb\"\n    }\n}\n```\n\nReplace U0x46d0x81d with your capture device's card name in ALSA. You can use arecord -L to list all the capture devices detected by ALSA.\n\n"
    },
    {
      "title": "Internal microphone not working",
      "level": 3,
      "content": "First make sure the volume is enabled under the Capture view in alsamixer. In some cases, the \"Internal Microphone\" is not displayed in the capture list available when pressing F4. If so, specifying the card number given by aplay -l to start alsamixer (for example alsamixer -c 0 ) can make it appear.\n\n"
    },
    {
      "title": "Crackling sound through mini-jack (headphones connector)",
      "level": 3,
      "content": "Following Advanced Linux Sound Architecture#Simultaneous output might lead to crackling sound through headphones or external speakers. This can be fixed by muting or setting the volume to 0% on Mic. Use alsamixer(1) or amixer(1):\n\n```\n$ amixer sset \"Mic\" 0%\n$ amixer sset \"Mic\" mute\n```\n\n"
    },
    {
      "title": "Popping sound after resuming from suspension",
      "level": 3,
      "content": "You might hear a popping sound after resuming the computer from suspension. This can be fixed by editing /etc/pm/sleep.d/90alsa and removing the line that says aplay -d 1 /dev/zero\n\n"
    },
    {
      "title": "Sound skipping during playback",
      "level": 3,
      "content": "Run alsamixer, and if channels exist for nonexistent output devices then disable them (e.g. alsamixer showing a center speaker but you not having one).\n\n"
    },
    {
      "title": "Poor sound quality or clipping",
      "level": 3,
      "content": "If you experience poor sound quality, try setting the PCM volume (in alsamixer) to a level such that gain is 0.\n\nIf snd_usb_audio driver has been loaded, you could try to enable softvol:\n\n```\n/etc/asound.conf\n```\n\n```\npcm.!default {\n    type plug\n    slave.pcm \"softvol\"\n}\npcm.dmixer {\n    type dmix\n    ipc_key 1024\n    slave {\n        pcm \"hw:0\"\n        period_size 4096\n        buffer_size 131072\n        rate 50000\n    }\n    bindings {\n        0 0\n        1 1\n    }\n}\npcm.dsnooper {\n    type dsnoop\n    ipc_key 1024\n    slave {\n        pcm \"hw:0\"\n        channels 2\n        period_size 4096\n        buffer_size 131072\n        rate 50000\n    }\n    bindings {\n        0 0\n        1 1\n        }\n}\npcm.softvol {\n  type softvol\n  slave { pcm \"dmixer\" }\n  control {\n    name \"Master\"\n    card 0\n  }\n}\nctl.!default {\n  type hw\n  card 0\n}\nctl.softvol {\n  type hw\n  card 0\n}\nctl.dmixer {\n  type hw\n  card 0\n}\n```\n\n"
    },
    {
      "title": "Pops when starting and stopping playback",
      "level": 3,
      "content": "Some modules (e.g. snd_hda_intel) can power off your sound card when it is not used. This might cause audible click noises—like a crack/pop/scratch—at each power-down/up depending on the device (sometimes even when moving the volume slider or opening and closing windows on some desktop environments).\n\nFor more information, see Power management#Audio and #Power saving.\n\n"
    },
    {
      "title": "HD Audio",
      "level": 3,
      "content": "For more information, see Module snd-hda-intel and the output of modinfo --field=parm snd_hda_intel | column --separator=':' --table.\n\nSee also Advanced Linux Sound Architecture#Driver configuration.\n\n"
    },
    {
      "title": "Power saving",
      "level": 4,
      "content": "Power saving is enabled by default and might cause the following issues:\n\n- #Pops when starting and stopping playback\n- PC speaker#The HD Audio power-saving mode mutes the PC speaker\n- VirtualBox/Install Arch Linux as a guest#Linux guests have slow/laggy audio\n\nTo completely disable the power-saving mode for the snd_hda_intel module, use the following kernel module parameters:\n\n```\n/etc/modprobe.d/alsa-base.conf\n```\n\n```\noptions snd_hda_intel power_save=0 power_save_controller=N\n```\n\n"
    },
    {
      "title": "Codec probing",
      "level": 4,
      "content": "A codec is a hardware component of an HD Audio sound card. One card might incorporate more than one codec, one codec might correspond to more than one ALSA device.\n\nA codec slot is a number (it begins from zero) identifying the codec on a given sound card. You can get the codec slot number from /proc/asound/cardi/codec#s file and /sys/class/sound/hwCiDs/ directory names—here i is a card index, and s is a codec slot.\n\nTo disable a codec—and subsequently all of the related ALSA devices—use the probe_mask option of the snd_hda_intel module.\n\n"
    },
    {
      "title": "Wrong model autodetection",
      "level": 4,
      "content": "Wrong model autodetection might cause the following issues:\n\n- #No microphone input\n- Microphone is not detected if it is plugged in a combined headset/microphone 4-pole 3.5 mm TRRS jack\n\n- No headphone output\n\nSee HD-Audio Codec-Specific Models for possible model strings for a given sound card chip.\n\nThe sound card chip can be found in:\n\n- alsamixer(1)—see Chip: in the upper-left corner,\n- output of grep 'Codec:' /proc/asound/card*/codec#*,\n- output of grep . /sys/class/sound/hwC?D?/chip_name,\n- /proc/asound/pcm file.\n\nTo force, use the model option of the snd_hda_intel module.\n\n"
    },
    {
      "title": "Message Signaled Interrupts",
      "level": 4,
      "content": "Whether Message Signaled Interrupts (MSI) should be enabled or not hardly depends on the hardware. In the case of wrong autodetection different kinds of bad things could happen:\n\n- erroneous disablement might lead to the sound card is not detected;\n- erroneous enablement might lead to poor audio quality (stuttering), or even kernel lockup.\n\nTo check the MSI capability status, run lspci -vv -nn -d ::0403 with root user privileges.\n\nMSI on HD Audio cards are controlled by the enable_msi option of the snd_hda_intel module.\n\n"
    },
    {
      "title": "DMA pointer",
      "level": 4,
      "content": "Click noises (crackling, popping) on input and/or output of an HD Audio card might be caused by DMA position problem. Try to change the position_fix option of the snd_hda_intel module.\n\n"
    },
    {
      "title": "Fix wrong audio pin mapping",
      "level": 4,
      "content": "If the mappings to your audio pins(plugs) do not correspond but ALSA works fine, you could try HDA Analyzer -- a pyGTK2 GUI for HD-audio control can be found at the ALSA wiki. Try tweaking the Widget Control section of the PIN nodes, to make microphones IN and headphone jacks OUT. Referring to the Config Defaults heading is a good idea.\n\n"
    },
    {
      "title": "Verifying output parameters",
      "level": 3,
      "content": "Check the contents of /proc/asound/cardX/pcmYp/subZ/hw_params, where X, Y, and Z are system dependent. In order to find this file, execute the following command while outputting anything via ALSA:\n\n```\n$ find /proc/asound/ -name hw_params | xargs -I FILE grep -v -l \"closed\" FILE | grep '/proc/asound/card./pcm.p/sub./hw_params'\n```\n\nIf nothing is playing there should be no results.\n\nHere is an example output for audio with a bit depth of 24 bits and a sampling frequency of 44.1 kilohertz:\n\n```\n$ cat /proc/asound/card1/pcm0p/sub0/hw_params\n```\n\n```\naccess: RW_INTERLEAVED\nformat: S24_3LE\nsubformat: STD\nchannels: 2\nrate: 44100 (44100/1)\nperiod_size: 5513\nbuffer_size: 22050\n```\n\nMore info is available in the ALSA documentation.\n\n"
    },
    {
      "title": "S/PDIF output does not work",
      "level": 3,
      "content": "S/PDIF (IEC958) utilizes two modes:\n\n- Audio mode is digital PCM signal, so the receiver just converts the data with digital-to-analog converter (DAC).\n\n- Non-audio mode is an encoded bitstream, so the receiver must decode the data first, and put it to DAC then. Dolby Digital and DTS Digital Surround are examples of encoded bitstream formats.\n\nALSA should detect appropriate mode automatically, but if it fails, you can force the mode with iecset(1) (on—audio, off—non-audio):\n\n```\n# iecset audio on\n# iecset audio off\n```\n\nFor more information, see DigitalOut.\n\n"
    },
    {
      "title": "HDMI",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with ALSA.** This article or section is a candidate for merging with ALSA.\n\nThis article or section is a candidate for merging with ALSA.\n\n"
    },
    {
      "title": "HDMI output does not work",
      "level": 4,
      "content": "The procedure described below can be used to test HDMI audio. Before proceeding, make sure you have enabled and unmuted the output with alsamixer.\n\nConnect your PC to the Display via HDMI cable and enable the display with xrandr.\n\nUse aplay -l to discover the card and device number. For example:\n\n```\n$ aplay -l\n```\n\n```\n**** List of PLAYBACK Hardware Devices ****\ncard 0: SB [HDA ATI SB], device 0: ALC892 Analog [ALC892 Analog]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 0: SB [HDA ATI SB], device 1: ALC892 Digital [ALC892 Digital]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 1: Generic [HD-Audio Generic], device 3: HDMI 0 [HDMI 0]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\n```\n\nSend sound to the device. Following the example in the previous step, you would send sound to card 1, device 3:\n\n```\n$ aplay -D plughw:1,3 /usr/share/sounds/alsa/Front_Center.wav\n```\n\nIf aplay does not output any errors, but still no sound is heard, \"reboot\" the receiver, monitor or tv set. Since the HDMI interface executes a handshake on connection, it might have noticed before that there was no audio stream embedded, and disabled audio decoding. If you are using a standalone window manager, you may need to have sound playing while plugging in the HDMI cable.\n\nmplay and other application could be configured to use special HDMI device as audio output. But flashplugin could only use default device. The following method is used to override default device. But you need to change it back when your TV is disconnected from HDMI port.\n\nIf the test is successful, create or edit your ~/.asoundrc file to set HDMI as the default audio device.\n\n```\n~/.asoundrc\n```\n\n```\npcm.!default {\n    type hw\n    card 1\n    device 3\n}\n```\n\nOr if the above configuration does not work try:\n\n```\n~/.asoundrc\n```\n\n```\ndefaults.pcm.card 1\ndefaults.pcm.device 3\ndefaults.ctl.card 1\n```\n\nOr if you alternatively succeed with\n\n```\n$ speaker-test -Dplug:hdmi\n```\n\nfor your HDMI or DisplayPort port the following configuration will work (successfully tested on Lenovo ThinkPad T430s):\n\n```\n~/.asoundrc\n```\n\n```\npcm.!default {\n    type plug\n    slave.pcm \"hdmi\"\n}\n```\n\n"
    },
    {
      "title": "HDMI 5.1 sound goes to wrong speakers",
      "level": 4,
      "content": "Sound can be redirected to the intended speakers using ALSA's remap function.\n\n```\n/etc/asound.conf\n```\n\n```\npcm.!hdmi-remap {\n    type asym\n    playback.pcm {\n        type plug\n        slave.pcm \"remap-surround51\"\n    }\n}\n\npcm.!remap-surround51 {\n    type route\n    slave.pcm \"hw:0,3\"\n    ttable {\n        0.0= 1\n        1.1= 1\n        2.4= 1\n        3.5= 1\n        4.2= 1\n        5.3= 1\n    }\n}\n```\n\n"
    },
    {
      "title": "SDL: No sound with SDL applications",
      "level": 3,
      "content": "If you get no sound using SDL based applications, try setting the environment variable SDL_AUDIODRIVER to alsa.\n\n"
    },
    {
      "title": "OpenAL: No sound in applications that use OpenAL",
      "level": 3,
      "content": "OpenAL defaults to PulseAudio. To instruct it to try ALSA first:\n\n```\n/etc/openal/alsoft.conf\n```\n\n```\ndrivers=alsa,pulse\n```\n\n"
    },
    {
      "title": "Others: Generic application problems",
      "level": 3,
      "content": "For other applications who insist on their own audio setup, e.g., XMMS or MPlayer, you would need to set their specific options.\n\nFor MPlayer or mpv, add the following line to the respective configuration file:\n\n```\nao=alsa\n```\n\nEg. for XMMS2, go into their options and make sure the sound driver is set to ALSA, not oss.\n\nTo do this in XMMS:\n\n- Open XMMS Options > Preferences. Choose the ALSA output plugin.\n\n- Options > Preferences.\n- Choose the ALSA output plugin.\n\nFor applications which do not provide a ALSA output, you can use aoss from the alsa-oss package. To use aoss, when you run the program, prefix it with aoss, e.g.:\n\n```\naoss realplay\n```\n\npcm.!default{ ... } doesnt work for me anymore. but this does:\n\n```\npcm.default pcm.dmixer\n```\n\n"
    },
    {
      "title": "Simultaneous playback problems",
      "level": 3,
      "content": "If you are having problems with simultaneous playback, and if PulseAudio is installed, its default configuration is set to \"hijack\" the soundcard. Some users of ALSA may not want to use PulseAudio and are quite content with their current ALSA settings. One fix is to edit /etc/asound.conf and comment out the following lines:\n\n```\n# Use PulseAudio by default\npcm.!default {\n    type pulse\n    fallback \"sysdefault\"\n    hint {\n        show on\n        description \"Default ALSA Output (currently PulseAudio Sound Server)\"\n    }\n}\n```\n\nCommenting the following out also may help:\n\n```\nctl.!default {\n    type pulse\n    fallback \"sysdefault\"\n}\n```\n\nThis may be a much simpler solution than completely uninstalling PulseAudio.\n\nEffectively, here is an example of a working /etc/asound.conf:\n\n```\npcm.dmixer {\n    type dmix\n    ipc_key 1024\n    ipc_key_add_uid 0\n    ipc_perm 0660\n}\npcm.dsp {\n    type plug\n    slave.pcm \"dmix\"\n}\n```\n\nNote: **not** \n\n"
    },
    {
      "title": "Removing old ALSA state file (asound.state)",
      "level": 3,
      "content": "The alsa-utils package provides alsa-store.service which automatically stores the current ALSA state to /var/lib/alsa/asound.state upon system shutdown. This can be problematic for users who are trying to reset their current ALSA state as the asound.state file will be recreated with the current state upon every shutdown (e.g., attempting to remove user-defined channels from the mixer). The alsa-store.service service may be temporarily disabled by creating the following empty file:\n\n```\n# mkdir -p /etc/alsa\n# touch /etc/alsa/state-daemon.conf\n```\n\nThe presence of state-daemon.conf prevents alsa-store.service from saving asound.state during shutdown. After disabling this service, the asound.state file may be removed as such:\n\n```\n# rm /var/lib/alsa/asound.state\n```\n\nAfter rebooting, the previous ALSA state should be lost and the current state should be reset to defaults. Re-enable alsa-store.service by deleting the condition file we created:\n\n```\n# rm /etc/alsa/state-daemon.conf\n```\n\nOn the next shutdown, the asound.state file should be recreated with ALSA defaults. The file may also be generated immediately using:\n\n```\n# alsactl store\n```\n\nIf you want to clean ALSA state without rebooting, you can use rmmod to remove the sound driver module, then manually delete the unwanted entries in asound.state, and then use modprobe to reinstall the sound driver module.\n\n"
    },
    {
      "title": "Problems with availability to only one user at a time",
      "level": 3,
      "content": "You might find that only one user can use the dmixer at a time. This is probably ok for most, but for those who run mpd as a separate user this poses a problem. When mpd is playing a normal user cannot play sounds though the dmixer. While it is quite possible to just run mpd under a user's login account, another solution has been found. Adding the line ipc_key_add_uid 0 to the pcm.dmixer block disables this locking. The following is a snippet from asound.conf, the rest is the same as above.\n\n```\n...\npcm.dmixer {\n    type dmix\n    ipc_key 1024\n    ipc_key_add_uid 0\n    ipc_perm 0660\nslave {\n ...\n```\n\n"
    },
    {
      "title": "Crackling/popping on Dell laptops",
      "level": 3,
      "content": "Check if you have i8kutilsAUR installed and if anything (e.g. i8kmon.service) is reading or writing to the interface exposed by the module, as i8kutils BIOS system calls block the kernel for a moment on some systems. See warning in Fan speed control#Dell laptops for more details.\n\n"
    }
  ]
}