{
  "title": "Allow a program to continue after logoff",
  "url": "https://wiki.archlinux.org/title/Allow_a_program_to_continue_after_logoff",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The systemd package is built not to kill user process on log out by default, see Systemd/User#Kill user processes on logout.\n\nThere are several ways to make a program continue after logoff:\n\n- use the nohup(1) GNU coreutil\n- use the disown Bash/Zsh shell builtin\n- use a terminal multiplexer, also allowing you to reattach to your detached session.\n\n"
    },
    {
      "title": "X applications",
      "level": 2,
      "content": "As xmove is dead, you probably want to use something else.\n\n"
    },
    {
      "title": "Secondary X server",
      "level": 3,
      "content": "Create a script with this content, and make it executable.\n\n```\n#!/bin/sh\n\nif [ $# -eq 0 ] ; then # check to see if arguments are given (color depth)\n    a=24        # default color depth\nelse\n    a=$1        # use given argument\nfi\n\nif [ $a -ne 8 -a $a -ne 16 -a $a -ne 24 ] ; then\n    echo \"Invalid color depth. Use 8, 16, or 24.\"\n    exit 1\nfi\n\nfor display in 0 1 2 3 4 5 ; do\n    if [ ! -f \"/tmp/.X$display-lock\" ] ; then\n        exec startx -- :$display -depth $a -quiet\n        exit 0\n    fi\ndone\n\necho \"No displays available.\"\nexit 1\n```\n\nExecuting this little script will start a new X server. Then you can simply start your application and lock the server with xlock -mode blank (you need the xlockmore package for using xlock(1)).\n\nDo not start your application in the first X server. If it is not already started, start the first and start a second one. Use the second one for your applications.\n\nThis is important because some features, like AGP mode, works only on one X server and other users of the computer will be annoyed if those feature will be lacking because you started a X server for your own purposes. So just use the second, the first will be full featured for everyone who need.\n\n"
    },
    {
      "title": "xpra",
      "level": 3,
      "content": "Xpra allows you to start X programs and leave them running after disconnecting to reconnect again at a later time. It is possible to start X programs on a remote machine, connect to the machine over ssh, disconnect and reconnect again while the programs continue running.\n\n"
    },
    {
      "title": "X2Go",
      "level": 3,
      "content": "X2Go supports suspending of sessions and reconnecting even from different client. While designed for remote access, it can be used even on localhost.\n\n"
    }
  ]
}