{
  "title": "Asenna",
  "url": "https://wiki.archlinux.org/title/Asenna",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Aiheeseen liittyen\n\n- Help:Browsing (Suomi)\n- Help:Style\n\nKoska suurin osa ArchWikistä sisältää viittauksia, joihin uudet Arch Linuxin (tai yleisesti GNU/Linux) käyttäjät voivat tarvita selvennystä, tämä sivu perusasioista luotiin niin artikkeleiden sekavuuden ja hämmennyksen kuin erilaisten asioiden toistuvuuden selventämiseksi ja korjaamiseksi.\n\n"
    },
    {
      "title": "Järjestys",
      "level": 2,
      "content": "Suurin osa artikkeleista ei keskity tarjoamaan yksityiskohtaista perehdytystä aiheeseen, tarkoittaa sitä että nämä artikkelit sen sijaan kirjoitetaan DRY eli älä toista itseäsi periaate, sillä ajatuksella että käyttäjät itse etsivät lisätietoa liittyen aiheeseen joka tukee artikkelissa olevaa materiaalia asioista joita käyttäjä ei vielä itse ymmärrä. Missä tämä on vain mahdollista, osoitetaan sellainen materiaali oikeaan lähteeseen linkillä. Katso #Formatointi lisätiedolle.\n\nTämän järjestelyn takia voi olla tarpeellista vilkaista useista lähteistä aiheeseen liittyvää materiaalia, jotta ArchWiki artikkeli olisi selkeämpi. Erityisesti käyttäjät, joille Arch (tai GNU/Linux) on uusi asia kokonaisuudessa, heidän oletetaan lukevan useampia artikkeleita täyden ymmärryksen takaamiseksi jopa loppuen lopuksi yksinkertaisistakin asioista. On erityisen tärkeää opiskella tukeva materiaali hyvin ennen kuin apua haetaan muilta käyttäjiltä, joka ei toisaalta ole kuoleman vakava virhe sekään.\n\n"
    },
    {
      "title": "Formatointi",
      "level": 2,
      "content": "- linkki johonkin osaan artikkelia: #Järjestys\n- linkki toiseen ArchWiki artikkeliin\n- linkki ulkopuoliselle sivulle\n- linkki man sivulle: intro(1)\n- man sivu, joka ei löydy suoraan verkosta: foo(1)\n- linkki paketille virallisissa pakettivarastoissa: foobar\n- linkki paketille AUR pakettivarastossa: foobarAUR\n\n"
    },
    {
      "title": "Tavallinen käyttäjä vai root",
      "level": 2,
      "content": "Jotkin komennot on kirjoitettu näin:\n\n```\n# mkinitcpio -p linux\n```\n\nToiset taas muulla alkuliitteellä:\n\n```\n$ makepkg -s\n```\n\nRisuaidan merkki (#) kertoo siitä että komento pitää suorittaa root käyttäjällä, kun taas dollari merkki ($) kertoo että komento tulisi suorittaa tavallisena käyttäjänä.\n\nHuomioitava poikkeus jota kannattaa varoa:\n\n```\n# Tämä alias ls:lle tekee listauksesta värillisen\nalias ls='ls --color=auto'\n```\n\nTässä esimerkissä, risuaitaa ympäröivä sisältö kertoo, ettei tätä tule suorittaa komentona. Sen sijaan se pitää muokata tiedostostoon, eli tässä yhteydessä risuaidalla merkitään kommentia. Kommentti voi toimia ohjeena käyttäjälle tai kuvailevana tekstinä mistäkin asetuksesta. Bash skriptien merkinnät kommenteille sattuvatkin samaan root PS1 kanssa.\n\nTarkemman tarkistelun jälkeen, \"pois antavat\" merkit sisältävät ison kirjaimen jota seuraa # merkki. Yleensä Unix komentoja ei kirjoiteta tällä tavalla ja usein ne ovat lyhenteitä englanninkielen sanoista (kuten esim. Copy joka kirjoitetaan cp).\n\nMutta kaikesta huolimatta, suurin osa artikkeleista tekee nämä erot selkeäksi lukijalle:\n\nLiitä polkuun ~/polku/kyseiseen/tiedostoon:\n\n```\n# Tämä alias ls:lle tekee listauksesta värillisen\nalias ls='ls --color=auto'\n```\n\n"
    },
    {
      "title": "Liitä, lisää, luo, muokkaa",
      "level": 2,
      "content": "Kun ohjeistetaan liittämään, lisäämään, luomaan tai muokkaamaan yhtä tai useampaa tiedostoa, jotain seuraavista tavoista tarkoitetaan käyttää.\n\nLuodakseen tai muokatakseen monirivisiä tiedostoja suositellaan käyttämään tekstin muokkaus ohjelmaa. Esimerkiksi nano komennon käyttö tiedoston /etc/bash.bashrc muokkaamiseen:\n\n```\n# nano /etc/bash.bashrc\n```\n\nYlikirjoittavan tiedoston merkkijonosta luomisen sijasta voi olla yksinkertaisempaa käyttää ulostulon uudelleen ohjaamista. Seuraavassa esimerkissä luodaan tai ylikirjoitetaan tiedoston sisältö /etc/hostname tekstillä myhostname.\n\n```\n# echo myhostname > /etc/hostname\n```\n\nUlostulon uudelleen ohjaaminen voidaan myös käyttää merkkijonon liittämiseen tiedostoon. Seuraavassa esimerkissä liitetään teksti [custom-repo] tiedostoon /etc/pacman.conf.\n\n```\n# echo \"[custom-repo]\" >> /etc/pacman.conf\n```\n\nKun polkujen luomista kysytään, käytä mkdir komentoa:\n\n```\n# mkdir /mnt/boot\n```\n\n"
    },
    {
      "title": "Tee suoritettava tiedosto",
      "level": 3,
      "content": "Tiedoston luomisen jälkeen, jos tämä tiedosto on tarkoitettu käytettäväksi skripitinä (joko manuaalisesti tai jonkin toisen ohjelman käskemänä) se pitää tehdä suoritettavaksi, esimerkiksi:\n\n```\n$ chmod +x skripti\n```\n\nKatso chmod lisätiedolle. Jotkin sovellukset kuten tiedostojenhallinta ohjelmat voivat antaa graafisen käyttäjäliittymän saman asian tekemiseen.\n\n"
    },
    {
      "title": "Lähde",
      "level": 2,
      "content": "Jotkin sovellukset, huomattavimpana komentorivi tulkit, käyttävät skriptejä näiden konfiguroinnille: niiden muokkaamisen jälkeen, ne joudutaan syöttäämään jotta muutokset tulevat käyttöön. Esimerkiksi bashin tapauksessa, tämä tehdään suorittamalla (source voidaan korvata myös .):\n\n```\n$ source ~/.bashrc\n```\n\nKun wiki pyytää muokkaamaan konfigurointi skripitiä, ohjeessa ei erityisesti mainita tiedoston syöttämisestä ja vain joissain harvoissa tapauksissa ohjeesta voidaan ohjata tähän osioon muistutus linkillä.\n\n"
    },
    {
      "title": "Pakettien asennus",
      "level": 2,
      "content": "Kun artikkeli pyytää käyttäjää asentamaan joitakin paketteja perinteisellä tavalla, siinä ei mainita tai anneta yksityiskohtaisia ohjeita asennusta varten. Sen sijaan artikkelissa mainitaan vain pakettien nimet, jotka olisi määränä asentaa.\n\nAlaosioissa alhaalla annetaan pieni yleiskatsaus tyypillisistä asennus menetelmistä riippuen paketin tyypistä.\n\n"
    },
    {
      "title": "Viralliset paketit",
      "level": 3,
      "content": "Paketeille virallisista pakettivarastoista kirjoitetaan jotain kuten:\n\nTämä tarkoittaa sitä, että joudutaan suorittamaan komento:\n\n```\n# pacman -S foobar\n```\n\nPacman artikkeli sisältää yksityiskohtaisen selityksen paketinhallinnasta Arch Linuxissa tehokkaasti.\n\n"
    },
    {
      "title": "Arch Käyttäjän Pakettivarasto",
      "level": 3,
      "content": "Paketeille Archin käyttäjäpakettivarastosta (AUR) kirjoitetaan jotain kuten:\n\nTämä tarkoittaa yleensä sitä, että joudutaan seuraamaan foobarAUR linkkiä, lataamaan PKGBUILD arkisto, purkamaan se, varmistetaan että paketti on oikea ja viimeinkin suoritetaan, kaikki samassa kansiossa:\n\n```\n$ makepkg -sri\n```\n\nArch User Repository artikkeli sisältää kaikki yksityiskohtaiset selitykset ja parhaat tavat AUR pakettien käsittelyyn.\n\n"
    },
    {
      "title": "systemd yksiköiden hallinta",
      "level": 2,
      "content": "Kun artikkelissa pyydetään käynnistämään, aktivoimaan, pysäyttämään tai käynnistämään uudelleen jotkin systemdn yksiköt (esim. palvelu), siinä ei kerrota tarkemmin ohjeita tämän suorittamiseen, mutta sen sijaan siellä voidaan kirjoittaa jotain kuten:\n\nTämä tarkoittaa sitä, että suoritetaan:\n\n```\n# systemctl start esimerkki.service\n```\n\nKäynnistä linkki johtaa systemd artikkeliin, joka sisältää kaikki yksityiskohtaiset ohjeet systemd yksiköiden käsittelyyn Arch Linuxissa tehokkaasti.\n\n"
    },
    {
      "title": "Järjestelmän laajuiset ja käyttäjäkohtaiset konfiguraatiot",
      "level": 2,
      "content": "On tärkeää muistaa, että on olemassa kaksi erilaista tapaa konfiguroida järjestelmä GNU/Linuxissa. Järjestelmän laajuinen konfiguraatio vaikuttaa kaikkiin käyttäjiin. Koska järjestelmän laajuiset asetukset yleensä löytyvät /etc polusta, root oikeudet tarvitaan näiden konfiguraatioiden asetteluun. Esimerkiksi Bash asetusten asettamista varten, jonka tekeminen vaikuttaa kaikkiin käyttäjiin, /etc/bash.bashrc pitäisi muokata.\n\nKäyttäjäkohtaisia konfiguraatiot vaikuttavat vain yhteen käyttäjään. Pistetiedostoja käytetään käyttäjäkohtaisen konfiguroinnin käsittelyyn. Esimerkiksi tiedosto ~/.bashrc on käyttäjäkohtainen tiedosto. Ideana on, että jokainen käyttäjä voi määrittää heidän omat asetukset, kuten aliakset, funktiot ja muut vuorovaikutteiset ominaisuudet kuten kehote, ilman että muille käyttäjille tehdään muutoksia.\n\n"
    },
    {
      "title": "Yleiset Komentorivitiedostot",
      "level": 3,
      "content": "Bash ja muut Bourne yhteensopivat komentotulkit, kuten Zsh, myös syöttävät tiedostoja riippuen siitä, mikäli komentotulkki on kirjautumis komentotulkki tai interaktiivinen komentotulkki. Katso Bash#Configuration files ja Zsh#Startup/Shutdown files lisätiedolle.\n\n"
    },
    {
      "title": "Valemuuttujat koodiesimerkeissä",
      "level": 2,
      "content": "Jotkin koodipalat voivat sisältää ns. valemuuttujia, jotka, kuten nimi kertoo, eivät todellisuudessa ole muuttujia joita käytetään koodissa. Sen sijaan ne ovat yleisinä paikanpitäjinä ja ne pitää manuaalisesti vaihtaa järjestelmäkohtaisilla konfiguraatio alkioilla ennen kuin koodi suoritetaan tai jäsennellään. Yleiset komentotulkit kuten bash ja zsh antavat mahdollisuuden täydentää tabulaattori painikkeella automaattisesti parametrejä yleisille komennoille kuten systemctl.\n\nTässä ne artikkelit jotka tottelevat Help:Style/Formatting and punctuation artikkelia, valemuuttujat on formatoituna kursiivina. Esimerkiksi:\n\n- Aktivoi dhcpcd@käyttöliittymän_nimi.service verkkokäyttöliittymälle tunnistettuna ip link komennon ulostulosta.\n\nTässä tapauksessa käyttöliittymän_nimi käytetään valemuuttujan paikanpitäjänä systemd template yksikössä. Kaikki systemd template yksiköt, tunnistat ne @ merkistä, tarvitsevät järjestelmäkohtaisen konfiguraation alkiolle argumenttina. Katso Systemd (Suomi)#Yksiköiden käyttö.\n\n- Komento dd if=tiedon_lähde of=/dev/sdX bs=sektorin_koko count=sektorin_numero seek=osan_alku_sektori voidaan suorittaa roottina tyhjentämää levyn osa erityisillä parametreilla.\n\nTässä tapauksessa valemuuttujia käytetään kuvaamaan parametreja, jotka joudutaan korvaamaan näille. Yksityiskohtia näiden keräämiselle on täsmennettynä osassa Securely wipe disk#Calculate blocks to wipe manually, mikä myös sisältää samaisen komennon.\n\nTiedosto tapauksessa, valemuuttujan liittäminen oikeissa konfiguraatio tiedostoissa voi rikkoa ohjelmia, jotka käyttävät näitä kyseisiä tiedostoja.\n\n"
    },
    {
      "title": "Ellipsit",
      "level": 3,
      "content": "Monissa tapauksissa ellipsit (...) eivät ole osana kyseisen tiedoston sisältöä tai koodin ulostuloa, ja sen sijaan edustavat pois jätettyä tai vaihtoehtoista tekstiä, joka ei ole oleellinen aiheeseen liittyen.\n\nEsimerkiksi HOOKS=\"... salakoodaa ... tiedostojärjestelmiä ...\" tai:\n\n```\n/etc/X11/xorg.conf.d/50-synaptics.conf\n```\n\n```\nSection \"InputClass\"\n    ...\n    Option      \"CircularScrolling\"          \"on\"\n    Option      \"CircScrollTrigger\"          \"0\"\n    ...\nEndSection\n```\n\nOle varuilla kumminkin, muutamissa tapauksissa, ellipsit voivat olla merkittävänä osana koodin syntaksia: tarkkaavaiset käyttäjät ovat kykeneviä helposti huomaammaan nämä tapaukset sisällöstä.\n\n"
    }
  ]
}