{
  "title": "ASUS Zenbook UX303",
  "url": "https://wiki.archlinux.org/title/ASUS_Zenbook_UX303",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (NVIDIA) | 10de:1341 | Yes\nGPU (Intel) | 8086:0a16 | Yes\nAudio | 8086:0a0c | Yes\nWi-Fi | 8086:08b1 | Yes\nBluetooth | 8087:07dc | Yes\nWebcam | 064e:9700 | Yes\n\nThis page contains instructions, tips, pointers, and links for installing and configuring Arch Linux on the ASUS Zenbook UX303 Ultrabook.\n\nThere is a lot a models but 2 main models, UX303LN with 2 graphics cards (Intel & NVIDIA) and UX303LA with only an Intel graphics card. The previous models UX32LN and UX32LA share a lot hardware with minor differences, e.g. the touchpad (Elantech).\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "The touchpad is a FocalTech model exposed through PS/2 at /sys/bus/acpi/devices/FLT0101:00, supported by Touchpad Synaptics and libinput. Check which one by running with grep -e \"using input driver \" /var/log/Xorg.0.log\n\nThe sensitivity settings may need to be adjusted, because of the large touchpad area. If the touchpad is not responsive, try changing these settings:\n\nIf you use Touchpad Synaptics,\n\n```\n/etc/X11/xorg.conf.d/50-synaptics.conf\n```\n\n```\nSection \"InputClass\"\n        ....\n\tOption \"FingerLow\" \"30\"\n\tOption \"FingerHigh\" \"35\"\nEndSection\n```\n\nIf you use libinput,\n\n```\n/etc/X11/xorg.conf.d/40-libinput.conf\n```\n\n```\nSection \"InputClass\"\n        ....\n\tOption \"AccelSpeed\" \"1\" # Recommended\n\tOption \"AccelProfile\" \"adaptive\" # Optional\nEndSection\n```\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "See Intel and NVIDIA for details. The secondary card is combined with the main graphics in a hybrid NVIDIA Optimus configuration. Bumblebee can be used to take advantage of the NVIDIA card.\n\n"
    },
    {
      "title": "QHD+ PenTile display",
      "level": 2,
      "content": "Some models include a 3200x1800 (faux-3200x1800 RG/BW PenTile) screen, which displays very tiny characters, and can make them difficult to read due to its incomplete subpixel matrix.\n\nSome environments and GUI toolkits may need adjustment: see HiDPI for possible fixes. Using 192 DPI or 2x scaling works well in most cases.\n\n"
    },
    {
      "title": "Suspend/resume",
      "level": 3,
      "content": "Suspend (Fn+F1) works out of the box with expected behavior.\n\nIf suspend fails sometimes (kernel crashes when trying to suspend), it might be due to a bios/kernel bug. Try blacklisting the kernel modules mei_me and mei meanwhile.\n\n"
    },
    {
      "title": "Battery",
      "level": 3,
      "content": "Battery has a design capacity of 4429mAh, and is able to provide just over 3 hours of autonomy under normal circumstances (average load of around 0.3 and Wi-Fi enabled, brightness lowered to mid-range) without serious power saving tweaks. Battery stops charging when it reaches near-full capacity on AC and acpi tool will show \"discharging at zero rate\" message. This behavior can be observed on a brand new battery. ACPI tools are able to correctly detect the battery state:\n\n- On AC power with the battery near full capacity:\n\n```\n$ acpi -i\n```\n\n```\nBattery 0: Discharging, 98%, discharging at zero rate - will never fully discharge.\nBattery 0: design capacity 4429 mAh, last full capacity 4076 mAh = 92%\n```\n\n- On AC power while the battery is charging:\n\n```\n$ acpi -i\n```\n\n```\nBattery 0: Charging, 94%, 00:11:53 until charged\nBattery 0: design capacity 4429 mAh, last full capacity 4110 mAh = 92%\n```\n\n- On battery power (while the battery is discharging):\n\n```\n$ acpi -i\n```\n\n```\nBattery 0: Discharging, 98%, 03:22:03 remaining\nBattery 0: design capacity 4429 mAh, last full capacity 4076 mAh = 92%\n```\n\nBattery life may depend on the type of LCD panel. The above values are shown for the model with QHD display.\n\nThere have been suggestions that \"discharging at zero rate\" while on AC is a battery calibration issue solvable by allowing the battery to fully discharge and then charging it back to full capacity.\n\nIt is also recommended to install laptop-mode-toolsAUR. On a UX303LB laptop (Broadwell) this increases battery life significantly. See Laptop Mode Tools for more details.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "If the sound card power-saving capabilities are enabled, you can experiment some annoying click sound right before a sound is played. See Power management#Audio.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "All function keys except the backlight and \"plane\" mode seem to work out of the box. To fix, add acpi_osi= as a kernel parameter and see Backlight.\n\n"
    },
    {
      "title": "USB 3.0",
      "level": 2,
      "content": "If the USB ports are only working with USB 2.0 devices, disable XHCI Pre-Boot Mode in the UEFI configuration, under Advanced > USB Configuration.\n\n"
    }
  ]
}