{
  "title": "ASUS X421IA",
  "url": "https://wiki.archlinux.org/title/ASUS_X421IA",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWireless |  | Yes\nAudio |  | Yes\nTouchpad |  | Yes\nFingerprint sensor |  | No\nCamera |  | Yes\nCard Reader |  | Yes\nBluetooth |  | Yes\n\nThis article contains information about running Linux on the laptop ASUS X421IA which are known as ASUS Vivobook S14 M433 in Malaysia. The laptop are almost fully functional on Linux out of the box, requiring a few tweaks to meet a user's basic needs.\n\n"
    },
    {
      "title": "Secure boot",
      "level": 3,
      "content": "In order to boot Arch (or any OS not supporting Secure Boot), enter the UEFI parameters by holding F2 (or ESC key and then selecting \"Firmware Setup\"), then navigate with the keyboard arrows to the \"Security\" tab and set \"Secure Boot\" to Off.\n\n"
    },
    {
      "title": "Fast startup",
      "level": 3,
      "content": "If you are planning to dual boot with Windows, it is advisable to disable Fast Startup in the UEFI menu at the \"Boot\" tab. For more information, see Fast Startup.\n\n"
    },
    {
      "title": "Battery charge threshold",
      "level": 3,
      "content": "See Laptop/ASUS#Battery charge threshold.\n\n"
    },
    {
      "title": "Limitation",
      "level": 2,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n"
    },
    {
      "title": "Suspend and Hibernation",
      "level": 3,
      "content": "Unfortunately, Suspend to RAM is not available in this model. The supported suspension methods are suspend to idle and hibernate. To wake from suspend, simply press any keyboard keys other than the power button. Note that suspend may not work consistently. See #Freezing issue.\n\n"
    },
    {
      "title": "Fingerprint sensor",
      "level": 3,
      "content": "The fingerprint sensor (available to some models) are too small to be able to be enrolled and used successfully.\n\n"
    },
    {
      "title": "Fan speed control",
      "level": 3,
      "content": "Full fan speed control is not supported in this laptop. Only pwm1_enable is available for the asus-nb-wmi driver which can be set to 2 for automatic and 0 for maximum fan speed (6000 RPM). See Fan speed control#ASUS laptops.\n\n"
    },
    {
      "title": "Freezing issue",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nUnder certain circumstances (such as gaming or resuming from suspend), the screen may freeze and the user are not able to do anything except doing a force reboot. Before proceeding, make sure that the kernel, AMDGPU, AMD microcode and BIOS is updated.\n\n"
    },
    {
      "title": "Gaming",
      "level": 4,
      "content": "```\nkernel: [drm:amdgpu_dm_atomic_commit_tail [amdgpu]] *ERROR* Waiting for fences timed out!\nkernel: [drm:amdgpu_job_timedout [amdgpu]] *ERROR* ring gfx timeout, but soft recovered\n```\n\nIf you encounter freezing and the above error log while gaming, try adding amdgpu.noretry=0 to the kernel parameters. See freedesktop issue.\n\n"
    },
    {
      "title": "Resuming from suspend",
      "level": 4,
      "content": "```\nkernel: amdgpu 0000:03:00.0: [drm:amdgpu_ib_ring_tests [amdgpu]] *ERROR* IB test failed on gfx\nkernel: [drm:process_one_work] *ERROR* ib ring test failed\n```\n\nIf you encounter freezing and the above error log while resuming from suspend (particularly when suspend time is longer), try adding amd_iommu=on iommu=pt to the kernel parameters. See kernel issue.\n\n"
    },
    {
      "title": "Backlight brightness cannot be restored at boot",
      "level": 3,
      "content": "```\nFailed to start Load/Save Screen Backlight Brightness of backlight:amdgpu_bl0\n```\n\nIf the backlight brightness cannot be restored at boot and is therefore always set to a value of 100% or (close to) 0%, you can add fbcon=nodefer as a workaround to the kernel parameters. See kernel issue.\n\n"
    },
    {
      "title": "Tips and tricks",
      "level": 2,
      "content": "There are a few ways that can be done to improve the battery life and performance of laptop. In order to achieve this, see:\n\n- BIOS update - It is generally recommended to update BIOS, as it usually brings performance, power-saving and security features.\n- Power Saving - List of general recommendations to increase battery life.\n- Improving performance - List of general recommendations to increase performance.\n- SSD - Tips and tricks for Solid State Drives.\n\n"
    }
  ]
}