{
  "title": "ASUS ROG Zephyrus Duo 15 GX550",
  "url": "https://wiki.archlinux.org/title/ASUS_ROG_Zephyrus_Duo_15_GX550",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTrackpad | PS/2 | Yes\nKeyboard | 0b05:1866 | Partial\nGPU (Intel) | 8086:9bc4 | Partial\nGPU (NVIDIA) | 10de:1ed3 | Partial\nEthernet | 10ec:8168 | Yes\nBluetooth | 8087:0026 | Yes\nAudio | 8086:06c8 | Partial\nWireless | 8086:06f0 | Yes\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "GX550 comes with a couple of different configurations, so please pay attention to your specific hardware while trying to install it.It comes with dual PCIe-SSDs configured with intel Rapid Storage Technology; i.e. RAID level 0 (Striping). Default operating system is Windows 10 installed in UEFI. Installing Arch will require a complete format / re-partitioning of the disks.\n\nThe NVIDIA graphics cards in this model currently does not seem to work with `nouveau` at all, which means there may be boot freeze's while trying to boot from the default ArchISO, which uses nouveau. best workaround for this would be to completely diable the nvidia gpu and use only intel graphics until installation is complete; or to build a custom archiso with nvidia binary drivers bundled instead off nouveau.\n\nOnce you have obtained a bootable copy of Arch, Start the installation with the following steps.\n\n1. Disable Intel Rapid Storage Technology and change SATA configuration to AHCI from the Asus UEFI BIOS.\n1. Boot from a \"Bootable Arch USB Device\" in UEFI mode.\n1. Format/Partition both SSDs on the device.\n1. Reboot to the \"Bootable Arch USB Device\".\n\nNow, proceed with the standard Installation guide.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "fwupd does not support this device yet.\n\n"
    },
    {
      "title": "Hardware",
      "level": 2,
      "content": "See [1] for a hardware probe of this device.\n\n"
    },
    {
      "title": "Screenpad",
      "level": 3,
      "content": "The Asus Screenpad gets recognized as a second monitor (with touch-enabled) by default. The Touch functionality will be uncalibrated by default and the touch-input is mapped to both the main monitor and screen pad. The Special Screenpad button on the keyboard does not work. Cannot adjust the brightness of Screenpad (Which is controlled via Software in Windows). Optionally try the instructions in this page for calibrating the Screenpad-touch.\n\n"
    },
    {
      "title": "Keyboard",
      "level": 3,
      "content": "Like many other Asus Laptop, this model features an Asus N-Key Custom RGB USB Keyboard.\n\nFor a better experience, use linux≥5.13.\n\nWith asusctl installed, most features and keys of the keyboard do work. However, The CPU-Fan-Profile RGB-Auro-Profiles Switching needs to be manually set up via hotkey scripts or it needs to be operated via command-line using the command asusctl. Try the command asusctl -h for details.\n\n"
    },
    {
      "title": "Function keys",
      "level": 3,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Untested | (Marked as Built-in Microphone ON-OFF Toggle for Windows)\nFn+F6 | Untested | Yes | CPU Fanspeed Control\nFn+F6 | Untested | Yes | Screencapture\nFn+F7 | Yes | Yes | XF86MonBrightnessDown\nFn+F8 | Yes | Yes | XF86MonBrightnessUp\nFn+F9 | Yes | Yes | KDE Switches to External screen\nFn+F10 | Yes | Yes | Enables/disables Touchpad\nFn+F11 | Yes | Yes | XF86Sleep Sleep / Screens Off\nFn+F12 | Yes | Yes | XF86RFKill Marked as Airplay Mode ON-OFF Toggle\nFn+ArrowUp | Yes | Yes | Keyboard RGB Brightness (Increase / ON)\nFn+ArrowDown | Yes | Yes | Keyboard RGB Brightness (Decrease / OFF)\nFn+ArrowLeft | Partial | Yes | Key is detected(KEY_PROG1:149) but no action assigned. (Marked Prev Keyboard RGB mode for Windows)\nFn+ArrowRight | Partial | Yes | Key is detected(KEY_PROG1:202) but no action assigned. (Marked Next Keyboard RGB mode for Windows)\n\n"
    },
    {
      "title": "Asus/ROG Special keys",
      "level": 3,
      "content": "Being an ROG series gaming laptop, this model also features some non-standard special keys on the keyboard, which are partially or fully incompatible as listed below.\n\nTable content:\nKey | Visible?1 | Marked?2 | Effect\nROG | Partial | Yes | Key is detected(KEY_PROG1:148) but no action assigned. (Opens Armorycrate App in Windows)\nPage:Arrow | No | Yes | Key is not detected. Toggles PageUp/PageDown mode and Arrow Keys mode\nNumPad:TouchPad | No | Yes | Key is not detected. Turns on Software/RGB Based NumPad on Trackpad in Windows.\n\n1. The key is visible to xev and similar tools\n1. The physical key has a symbol on it, which describes its function\n\n"
    },
    {
      "title": "Known Issues",
      "level": 2,
      "content": "- Earphone / Microphone ports do not work.\n- Keyboard: Keyboard/Power-button might not wake up the system if the device goes to sleep. Keep pressing the Power button for a while(~20 seconds) to turn off the system in this case.\n- USB-C/Thunderbolt: The port is detected and works in USB 3 mode.\n- On startup there is an error message while systemd fails to start thunderbolt.service.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Manufactorer Website for the Product: https://rog.asus.com/laptops/rog-zephyrus/rog-zephyrus-duo-15-series/\n- Specifications guide: https://rog.asus.com/laptops/rog-zephyrus/rog-zephyrus-duo-15-series/spec\n- Official User manual: https://dlcdnets.asus.com/pub/ASUS/GamingNB/GX550LWS/0409_E15995_GX550LXS_LWS_B.pdf\n- Now Deprecated ROG-Core Utility: https://github.com/flukejones/rog-core\n\n"
    }
  ]
}