{
  "title": "Backup Gmail with getmail",
  "url": "https://wiki.archlinux.org/title/Backup_Gmail_with_getmail",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is a candidate for merging with getmail.** This article or section is a candidate for merging with getmail.\n\nThis article or section is a candidate for merging with getmail.\n\nWe can use getmail to fully backup email messages from a Gmail account.\n\nEmails will be backed-up in Maildir format, meaning that each email will be a separate text file, readable with any email client, or even with a text editor.\n\n"
    },
    {
      "title": "Installing getmail",
      "level": 2,
      "content": "Install getmailAUR package.\n\n"
    },
    {
      "title": "Creating required files and folders",
      "level": 2,
      "content": "Getmail reads its configuration from ~/.getmail/getmailrc by default. Unfortunately this directory and file do not exist by default, so we need to create them.\n\n```\n$ mkdir ~/.getmail\n$ touch ~/.getmail/getmailrc\n$ chmod 700 ~/.getmail\n```\n\nWe also need to create the folder where the emails will be backed-up:\n\n```\n$ mkdir -p ~/bak/mail\n$ cd ~/bak/mail\n$ mkdir cur new tmp\n```\n\nFor this example ~/bak/mail was chosen , but it could just as well be ~/mail. The cur, new and tmp folders are required by the Maildir format and by getmail.\n\n"
    },
    {
      "title": "Configuring getmail",
      "level": 2,
      "content": "Edit the configuration file and add the entries below.\n\n```\n~/.getmail/getmailrc\n```\n\n```\n# More configuration options here:\n# http://pyropus.ca/software/getmail/configuration.html\n[retriever]\ntype = SimpleIMAPSSLRetriever\nserver = imap.gmail.com\nmailboxes = (\"Inbox\", \"[Gmail]/Sent Mail\") # optional - leave this line out to just grab the inbox\nusername = USER\npassword = PASS\n```\n\nThe retriever section tells getmail where to connect. It uses IMAP to connect to the server. For POP3 we can use the type SimplePOP3SSLRetriever, but we will also have to modify the server field. The mailbox which we backup will be All Mail.\n\nNote that Gmail was called Google Mail in some countries like Germany. Even if all GMail accounts are migrated to the new name, the IMAP-Server still assumes Google Mail as the mail box directory. The mailboxes variable must be set to [Google Mail] in those cases. Also, you might need to replace box labels by whatever GMail calls that directory in the language of your Google account.\n\nThe username and password fields need to be changed to your own.\n\n```\n[destination]\ntype = Maildir\npath = ~/bak/mail/\n```\n\nThe path field is the destination folder (which we created earlier) where the emails will be backed-up. All emails will be placed in 'new', and the cur and tmp folders will be left empty. This is normal, do not delete cur and tmp.\n\nThe options section is a bit longer:\n\n```\n[options]\nverbose = 2\nmessage_log = ~/.getmail/log\n```\n\nThis tells getmail to be very verbose and tell us the status of each message (whether it was backed-up successfully, total number of messages, etc). Also, everything will be logged to ~/.getmail/log.\n\n```\n# retrieve only new messages\n# if set to true it will re-download ALL messages every time!\nread_all = false\n```\n\n```\n# do not alter messages\ndelivered_to = false\nreceived = false\n```\n\nSetting delivered_to and received fields to false will prevent emails from being altered by getmail.\n\n"
    },
    {
      "title": "Running getmail and adding a cron job",
      "level": 2,
      "content": "Now if we run getmail it will backup all Gmail emails to ~/bak/mail, outputting its status along the way.\n\nWe want to periodically run getmail to backup our Gmail account, so we will add a cron job:\n\n```\n* * * * *   ID=getmail FREQ=1d getmail -q\n```\n\nThe -q parameter will run getmail in quiet mode and only report errors.\n\n"
    },
    {
      "title": "Migrating emails, importing old emails",
      "level": 2,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nBacking-up emails will suffice for most people, but if we want to migrate our emails to another account it gets a bit tricky. The appendmail script from http://bitbucket.org/wooptoo/appendmail[dead link 2020-12-20 ⓘ] can help us import emails to another account, be it Gmail or not. It can also be used to import old emails in our existing Gmail account.\n\nBasically it reads every email file from its 'import' folder and puts it on Gmail or another account.\n\nA direct link to download is http://bitbucket.org/wooptoo/appendmail/get/tip.zip[dead link 2020-12-20 ⓘ] It needs PHP to run, and you need to modify the username and password to yours.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "Depending on your Gmail security, you may be left with this error when running getmail:\n\n```\ngetmailrc: credential/login error ([ALERT] Please log in via your web browser: https://support.google.com/mail/accounts/bin/answer.py?answer=78754 (Failure))\n  0 messages (0 bytes) retrieved, 0 skipped\n```\n\nSince Gmail does not allow \"lesssecureapps\" anymore enable access for less secure apps you may want to turn on two-step-verification and then create a App password and put it as password into getmailrc (for POP3):\n\n```\n~/.getmail/getmailrc\n```\n\n```\ntype = SimplePOP3SSLRetriever\nserver = pop.gmail.com\nusername = USER@gmail.com\npassword = APPPASSWORD\nport = 995\n```\n\n"
    }
  ]
}