{
  "title": "Browsers",
  "url": "https://wiki.archlinux.org/title/Browsers",
  "sections": [
    {
      "title": "Network managers",
      "level": 3,
      "content": "See Network configuration#Network managers.\n\n"
    },
    {
      "title": "VPN clients",
      "level": 3,
      "content": "- GlobalProtect-openconnect — A GlobalProtect VPN client (GUI) for Linux, based on OpenConnect and built with Qt5, supports SAML auth mode.\n\n- Libreswan — A free software implementation of the most widely supported and standardized VPN protocol based on (\"IPsec\") and the Internet Key Exchange (\"IKE\").\n\n- Mullvad — A GUI client for the Mullvad VPN service\n\n- Nebula — A mesh VPN network\n\n- NetworkManager — Supports a variety of protocols (e.g. MS, Cisco, Fortinet) via a plugin system.\n\n- OpenConnect — Supports Cisco and Juniper VPNs.\n\n- Openswan — IPsec-based VPN Solution.\n\n- OpenVPN — To connect to OpenVPN VPNs.\n\n- PPTP Client — To connect to PPTP VPNs, like Microsoft VPNs (MPPE). (insecure)\n\n- RiseupVPN — A GUI client for the Riseup VPN service from riseup.net.\n\n- strongSwan — IPsec-based VPN Solution.\n\n- tinc — tinc is a free VPN daemon.\n\n- vopono — OpenVPN and Wireguard wrapper to launch applications with VPN tunnels in network namespaces.\n\n- vpnc — To connect to Cisco 3000 VPN Concentrators.\n\n- WireGuard — Next generation secure network tunnel.\n\n"
    },
    {
      "title": "Proxy servers",
      "level": 3,
      "content": "- Brook — Proxy focusing on strong encryption and being undetectable.\n\n- Clash — A rule-based tunnel in Go.\n\n- Dante — SOCKS server and SOCKS client, implementing RFC:1928 and related standards.\n\n- Geph — A modular Internet censorship circumvention system designed specifically to deal with national filtering.\n\n- hiddify — Multiplatform chain proxy client based on sing-boxAUR.\n\n- NaïveProxy — A Proxy using Chrome's network stack to camouflage traffic with strong censorship resistence and low detectablility.\n\n- Privoxy — Non-caching web proxy with advanced filtering capabilities for enhancing privacy, modifying web page data and HTTP headers, controlling access, and removing ads and other obnoxious Internet junk.\n\n- V2Ray — V2Ray is the core of Project V, which is a set of tools to help you build your own privacy network over the internet.\n\n- V2RayN — A GUI client for Windows, Linux and macOS, support xrayAUR and sing-boxAUR cores and others.\n\n- Nekoray — Multiplatform chain proxy client based on sing-boxAUR.\n\n- Shadowsocks — Secure socks5 proxy, designed to protect your Internet traffic.\n\n- Squid — Caching proxy for the Web supporting HTTP, HTTPS, FTP, and more.\n\n- Stunnel — A server and client to add and remove TLS encryption to TCP data flow.\n\n- Tinyproxy — Lightweight HTTP/HTTPS proxy daemon.\n\n- Trojan — An unidentifiable mechanism that helps you bypass GFW.\n\n- Varnish — High-performance HTTP accelerator.\n\n- Wireproxy — WireGuard client that exposes itself as a SOCKS5 proxy.\n\n- XX-Net — Easy to use web proxy tool.\n\n- Ziproxy — Forwarding (non-caching) compressing HTTP proxy server.\n\n"
    },
    {
      "title": "Anonymizing networks",
      "level": 3,
      "content": "- Arti — Rust implementation of the Tor anonymizing overlay network.\n\n- Freenet — An encrypted network without censorship.\n\n- GNUnet — Framework for secure peer-to-peer networking.\n\n- I2P — Distributed anonymous network.\n\n- Lantern — Peer-to-peer internet censorship circumvention software.\n\n- Lokinet — Anonymous, decentralized and IP based overlay network for the internet.\n\n- Tor — Anonymizing overlay network.\n\n"
    },
    {
      "title": "Network tunnels",
      "level": 3,
      "content": "- 6tunnel — Tunnels IPv6 connections for IPv4-only applications.\n\n- iodine — Tunnel IPv4 data through a DNS server.\n\n- isatapd — Creates and maintains an ISATAP tunnel (RFC:5214).\n\n- Ping Tunnel — A tool for reliably tunneling TCP connections over ICMP echo request and reply packets.\n\n- Tuntox — Tunnel TCP connections over the Tox protocol.\n\n"
    },
    {
      "title": "Deep packet inspection circumvention",
      "level": 3,
      "content": "Tools to avoid censorship, bandwidth throttle without anonymization. See Wikipedia:Deep packet inspection, Wikipedia:Internet censorship circumvention for an introduction to the topic.\n\n- Bypass DPI — A simple software using SOCKS5, written in C and targeted at Russian censorship.\n\n- Cloak — A pluggable transport that works alongside traditional proxy tools like OpenVPN, written in Go.\n\n- DPI Tunnel — An HTTP/transparent proxy, written in C++ and targeted at Russian censorship.\n\n- Green Tunnel — An anti-censorship utility using SOCKS5, written in nodejs and targeted at Iranian censorship.\n\n- SpoofDPI — A simple and fast tool using SOCKS5, written in Go.\n\n- zapret — A Netfilter queue mode or SOCKS5/transparent proxy, written in C and targeted at Russian censorship.\n\n"
    },
    {
      "title": "Web browsers",
      "level": 2,
      "content": "See also Wikipedia:Comparison of web browsers.\n\n"
    },
    {
      "title": "Console",
      "level": 3,
      "content": "- browsh — A fully-modern text-based browser. Runs as a frontend to headless Firefox.\n\n- Carbonyl — A Chromium based browser built to run in a terminal.\n\n- Chawan — A web browser for your terminal.\n\n- ELinks — Advanced and well-established feature-rich text mode web browser with mouse wheel scroll support, frames and tables, extensible with Lua & Guile (links fork).\n\n- Links — Graphics and text mode web browser. Includes a console version similar to Lynx.\n\n- Lynx — Text browser for the World Wide Web.\n\n- w3m — Pager/text-based web browser. It has vim-like keybindings, and is able to display images.\n\n"
    },
    {
      "title": "Gecko-based",
      "level": 4,
      "content": "See also Wikipedia:Gecko (software).\n\n- Firefox — Extensible browser from Mozilla based on Gecko with fast rendering.\n\n- SeaMonkey — Continuation of the Mozilla Internet Suite.\n\n- FireDragon — A fork of Floorp that includes KDE integration patches and custom branding for Garuda.\n\n- Floorp — Firefox-based browser with excellent privacy protection, developed by a community of students in Japan.\n\n- GNU IceCat — A customized build of Firefox ESR distributed by the GNU Project, stripped of non-free components and with additional privacy extensions. Release cycle may be delayed compared to Mozilla Firefox.\n\n- LibreWolf — A fork of Firefox, focused on privacy, security and freedom.\n\n- Mercury — Firefox fork with compiler optimizations and patches from Librewolf, Waterfox, and GNU IceCat.\n\n- Midori — Light, fast and secure browser.\n\n- Mullvad Browser — Privacy-focused web browser developed by Mullvad VPN and the Tor Project based on Firefox ESR.\n\n- Tor Browser Launcher — Securely and easily download, verify, install, and launch Tor Browser, a fork of Firefox ESR.\n\n- Waterfox — Fork of Mozilla Firefox featuring some privacy, usability, and speed enhancements.\n\n- Zen Browser — An experimental, privacy-focused and performance-optimized fork of Firefox with additional features, such as tab groups and a sidebar.\n\n"
    },
    {
      "title": "Blink-based",
      "level": 4,
      "content": "See also Wikipedia:Blink (web engine).\n\n- Chromium — Web browser developed by Google, the open source project behind Google Chrome.\n\n- Brave — Web browser with builtin ad- and tracker blocking.\n\n- Ungoogled Chromium — Modifications to Google Chromium for removing Google integration and enhancing privacy, control, and transparency\n\n- Thorium — Thorium develops a periodically synchronized fork of the Chromium browser, expanded with additional patches to optimize performance, improve usability and enhance security. According to the developers' tests Thorium is 8-40% ahead of the regular Chromium, mainly due to the inclusion of additional optimizations during compilation.\n\n- Cromite — Cromite is a Chromium fork based on Bromite (Currently unmaintained) with built-in support for ad blocking and an eye for privacy. See List of features.\n\n- Google Chrome — Proprietary web browser developed by Google.\n\n- Microsoft Edge — Proprietary web browser developed by Microsoft.\n\n- Opera — Proprietary browser developed by Opera Software.\n\n- Slimjet — Fast, smart and powerful proprietary browser based on Chromium.\n\n- Vivaldi — An advanced proprietary browser made with the power user in mind.\n\n- Yandex Browser — Proprietary browser that combines a minimal design with sophisticated technology to make the web faster, safer, and easier.\n\n- Angelfish — Web browser for Plasma Mobile. Part of kde-network.\n\n- Dooble — Colorful Web browser.\n\n- Eric — QtWebEngine-based HTML browser, part of the eric6 development toolset, can be launched with the eric6_browser command.\n\n- Falkon — Web browser based on QtWebEngine, written in Qt framework. Part of kde-network.\n\n- Fiery — A convergent web browser. Part of maui.\n\n- Konqueror — Web browser based on Qt toolkit and Qt WebEngine. Part of kde-network.\n\n- Liri Browser — A minimalistic material design web browser written for Liri.\n\n- Otter Browser — Browser aiming to recreate classic Opera (12.x) UI using Qt5.\n\n- qutebrowser — A keyboard-driven, vim-like browser based on PyQt5 and QtWebEngine.\n\n- Beaker — Peer-to-peer web browser with tools to create and host websites.\n\n- Catalyst — A minimal FOSS web browser with no data collection.\n\n- Franz — Messaging browser for WhatsApp, Facebook Messenger, Slack, Telegram and many other web services.\n\n- Hamsket — A GPL-licensed alternative to Franz, forked from the last open sources of Rambox.\n\n- Min — A fast, minimal browser that protects your privacy. It includes an interface designed to minimize distractions.\n\n- Vieb — Minimalist Electron-based browser with Vim-inspired keybindings and a built-in ad-blocker.\n\n"
    },
    {
      "title": "WebKitGTK-based",
      "level": 4,
      "content": "See also Wikipedia:WebKit.\n\nMost of these support ad-blocking via wyebadblock.\n\n- Badwolf — A minimalist privacy-focused browser.\n\n- Eolie — Simple web browser for GNOME.\n\n- GNOME Web — Browser which uses the WebKitGTK rendering engine. Part of gnome.\n\n- Luakit — Fast, small, webkit based browser framework extensible by Lua.\n\n- Nyxt — Keyboard-oriented, infinitely extensible browser designed for power users. It has familiar key-bindings (Emacs, VI, CUA) and features fuzzy searching between tabs, multiple selections, history as a tree and more.\n\n- surf — Lightweight WebKit-based browser, which follows the suckless philosophy (basically, the browser itself is a single C source file).\n\n- Surfer — Simple keyboard based web browser, written in C. It supports custom JS-scripts.\n\n- Tangram — Integration of web applications into the desktop, specifically GNOME.\n\n- Vimb — A Vim-like web browser written in C that is inspired by Pentadactyl and Vimprobable. It includes a manpage and a howto for common configurations. It supports custom JS-scripts, dark mode and handles geolocation requests.\n\n- wyeb — A vim-like web browser inspired by dwb and luakit with Adblock.\n\n"
    },
    {
      "title": "Goanna-based",
      "level": 4,
      "content": "See also Wikipedia:Goanna (software).\n\n- Pale Moon — A Firefox fork focussing on speed, with a pre-Firefox 29 interface. Uses Goanna layout engine, a fork of Gecko. Firefox add-ons may not be compatible. Without support for newer Firefox features such as WebExtensions, cache2, e10s, and OTMC. Many of the old 93,598 versions of 19,450 Firefox add-ons created by 14,274 developers over the past 15 years using XUL/XPCOM technology in the Classic Add-ons Archive still work.\n\n- Basilisk — A XUL-based web browser, similar in design to Firefox, aimed at providing a fully functional browsing experience with a classic interface.\n\n"
    },
    {
      "title": "Servo-based",
      "level": 4,
      "content": "- Servo — Web browser rendering engine written in Rust, with WebGL and WebGPU support, and adaptable to desktop, mobile, and embedded applications.\n\n- Verso — Experimental web browser based on Servo experimenting with multi-view and multi-window and building UI elements entirely from Servo.\n\n"
    },
    {
      "title": "Other",
      "level": 4,
      "content": "- Dillo — Small, fast graphical web browser built on FLTK. Uses its own layout engine.\n\n- Ladybird — Web browser built from scratch using the SerenityOS LibWeb engine.\n\n- Links — Graphics and text mode web browser. Includes a graphical X-window/framebuffer version with CSS, image rendering, pull-down menus. It can be launched with the xlinks -g command.\n\n- NetSurf — Featherweight browser written in C, notable for its slowly developing JavaScript support and fast rendering through its own layout engine.\n\n"
    },
    {
      "title": "Gemini browsers",
      "level": 3,
      "content": "See also Wikipedia:Gemini (protocol)#Software.\n\n- Amfora — Terminal browser for the Gemini protocol.\n\n- Bombabillo — Non-web client for the terminal, supporting Gopher, Gemini and much more.\n\n- Castor — Graphical client for the Gemini, Gopher, and Finger protocols, written in Rust with GTK.\n\n- Geopard — A graphical gemini client written in rust, using the gtk4 toolkit.\n\n- Kristall — Qt-based Gemini browser.\n\n- Lagrange — Desktop GUI client for browsing Gemini space, offering modern conveniences familiar from web browsers.\n\n- Telescope — w3m-like browser for Gemini.\n\n"
    },
    {
      "title": "Web servers",
      "level": 2,
      "content": "A web server serves HTML web pages and other files via HTTP to clients like web browsers. The major web servers can be interfaced with programs to serve dynamic content (web applications).\n\nSee also Category:Web server and Wikipedia:Comparison of web server software.\n\n- Apache HTTP Server — A high performance Unix-based HTTP server.\n\n- Caddy — HTTP/3 web server with automatic HTTPS.\n\n- Hiawatha — Secure and advanced web server.\n\n- Lighttpd — A secure, fast, compliant and very flexible web-server.\n\n- nginx — Lightweight HTTP server and IMAP/POP3 proxy server.\n\n- sthttpd — Supported fork of the thttpd web server.\n\n- Traefik — A modern reverse proxy and load balancer that makes deploying microservices easy.\n\n- yaws — Web server/framework written in Erlang.\n\n"
    },
    {
      "title": "Static web servers",
      "level": 3,
      "content": "- Apache Traffic Server — Fast, scalable and extensible HTTP/1.1 and HTTP/2 compliant caching proxy server.\n\n- darkhttpd — A small and secure static web server, written in C, does not support HTTPS or Auth.\n\n- miniserve — Rust alternative to darkhttpd with UTF-8, optional HTTP authentication, file uploading, and more.\n\n- quark — An extremely small and simple http get-only web server. It only serves static pages on a single host.\n\n- serve — Static file serving and directory listing.\n\n- Webfs — Simple and instant web server for mostly static content.\n\nThe Python standard library module http.server can also be used from the command-line.\n\n"
    },
    {
      "title": "Specialized web servers",
      "level": 3,
      "content": "- chezdav — WebDAV server that allows to share a particular directory.\n\n- Mongoose — Embedded web server library, supports WebSocket and MQTT.\n\n- OnionShare — Lets you securely and anonymously send and receive files. It works by starting a web server, making it accessible as a Tor onion service, and generating an unguessable web address so others can download files from you, or upload files to you.\n\n- Transfer More — A minimalist open-source upload HTTP server to store and share files temporarily, written in Crystal, and based on Kemal.\n\n- VServer — GTK application, which opens an http server in the selected folder and shares your files.\n\n- webhook — Small server for creating HTTP endpoints (hooks)\n\n- Woof — An ad-hoc single file webserver; Web Offer One File.\n\n"
    },
    {
      "title": "WSGI servers",
      "level": 3,
      "content": "- Gunicorn — A Python WSGI HTTP Server for UNIX.\n\n- uWSGI — A fast, self-healing and developer/sysadmin-friendly application container server written in C.\n\n- Waitress — A WSGI server for Python 3.\n\nApache also supports WSGI with mod_wsgi.\n\n"
    },
    {
      "title": "Performance testing",
      "level": 3,
      "content": "- http_load — A webserver performance testing tool, runs in a single process.\n\n- httperf — Can generate various HTTP workloads, written in C.\n\n- httping — A \"ping\"-like tool for HTTP requests\n\n- siege — An HTTP regression testing and benchmarking utility.\n\n- vegeta — HTTP load testing tool, written in Go.\n\n- Web Bench — Benchmarking tool, uses fork() for simulating multiple clients.\n\n"
    },
    {
      "title": "Download managers",
      "level": 3,
      "content": "See also Wikipedia:Comparison of download managers.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- aria2 — Lightweight download utility that supports HTTP/S, FTP, SFTP, BitTorrent and Metalink. It can run as a daemon controlled via a built-in JSON-RPC or XML-RPC interface.\n\n- Axel — Featherweight command line download accelerator sitting at under 250kB on disk. Supports HTTP/S and FTP.\n\n- cURL — A URL retrieval utility and library. Supports HTTP, FTP and SFTP.\n\n- Gtuber — Fetch media info from websites (bilibili, lbry, niconico, reddit, twitch, youtube). Includes a command-line downloader (gtuber-dl) and a GStreamer plugin, which is used automatically when you try playing video from website that Gtuber can handle in your GStreamer based application.\n\n- HTTPie — Human-friendly command-line HTTP client for the API era.\n\n- HTTrack — An easy-to-use offline browser utility. It allows you to download a World Wide Web site from the Internet to a local directory, building recursively all directories, getting HTML, images, and other files from the server to your computer.\n\n- LFTP — Sophisticated file transfer program. Supports HTTP, FTP, SFTP, FISH, and BitTorrent.\n\n- Plowshare — A set of command-line tools designed for managing file-sharing websites (aka Hosters).\n\n- RTMPDump — Download FLV videos through RTMP (Adobe's proprietary protocol for Flash video players)\n\n- snarf — Command-line URL retrieval tool. Supports HTTP and FTP.\n\n- Streamlink — Launch streams from various streaming services in a custom video player or save them to a file.\n\n- Streamripper — Records and splits streaming mp3 into tracks.\n\n- yewtube — Terminal-based YouTube player and downloader.\n\n- You-Get — Download media contents (videos, audios, images) from the Web.\n\n- youtube-dl — Download videos from YouTube and many other web sites.\n\n- youtube-viewer — Command line utility for viewing YouTube videos.\n\n- ytfzf — A POSIX script to find and watch youtube videos from the terminal.\n\n- yt-dlp — A youtube-dl fork with additional features and fixes.\n\n- Wget — A network utility to retrieve files from the Web. Supports HTTP and FTP.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- ClipGrab — Downloader and converter for YouTube, Vimeo and many other online video sites.\n\n- FatRat — Qt based download manager with support for HTTP, FTP, SFTP, BitTorrent and Metalink.\n\n- Forklift — Simple GUI for youtube-dl using PyGObject.\n\n- gtk-youtube-viewer — GTK utility for viewing YouTube videos. See optional dependencies for the GUI.\n\n- Gwget — Download manager for GNOME. Supports HTTP and FTP.\n\n- Gydl — GUI wrapper around the already existing youtube-dl program to download content from sites like YouTube.\n\n- Gyre — GTK3 downloader for videos from Coub.\n\n- JDownloader — Java-based downloader for one-click hosting sites.\n\n- KGet — Download manager for KDE. Supports HTTP, FTP, BitTorrent and Metalink. Part of kde-network.\n\n- MegaBasterd — Yet another unofficial MEGA downloader/uploader/streaming suite.\n\n- Motrix — Full-featured download manager that supports downloading HTTP, FTP, BitTorrent, Magnet, etc. Based on the Electron platform.\n\n- Persepolis — Graphical front-end for aria2 download manager with lots of features. Supports HTTP and FTP.\n\n- pyLoad — Downloader written in Python and designed to be extremely lightweight, easily extensible and fully manageable via web.\n\n- Steadyflow — Simple download manager for GNOME. Supports HTTP and FTP.\n\n- Streamtuner2 — Internet radio station and video browser. It simply lists stations in categories from different directories and launches your preferred media apps for playback.\n\n- uGet — GTK download manager featuring download classification and HTML import. Supports HTTP, FTP, BitTorrent, Metalink, YouTube and Mega.\n\n- Video Downloader — GTK application to download videos from websites like YouTube and many others (based on youtube-dl).\n\n- Xtreme Download Manager — Powerful tool to increase download speed up-to 500%. Supports HTTP and FTP. Video grabber works in a general way and is not limited to certain websites.\n\n- youtubedl-gui — Simple-to-use graphical interface for youtube-dl.\n\n"
    },
    {
      "title": "LAN file transfer",
      "level": 3,
      "content": "See also #LAN messengers.\n\n- LAN Share — Cross-platform local area network file transfer application, built using Qt GUI framework. It can be used to transfer a whole folder, one or more files, large or small immediately without any additional configuration.\n\n- LocalSend — Cross-platform app to securely share files and messages with nearby devices over the local network without needing an internet connection.\n\n- Magic Wormhole — Command-line tool wormhole to securely transfer data between computers.\n\n- NitroShare — Cross-platform network file transfer application, built using Qt GUI framework. It is designed to make transferring files from one device to another on the local network extremely simple.\n\n- Teleport — Native GTK3 application to effortlessly share files on the local network.\n\n- Warp — Securely send files to each other via the internet or local network by exchanging a word-based code. It uses the Magic Wormhole protocol.\n\n- Warpinator — GTK application to share files across the LAN.\n\n"
    },
    {
      "title": "Cloud storage servers",
      "level": 3,
      "content": "- Cozy — A personal cloud you can hack, host and delete.\n\n- Nextcloud — A cloud server to store your files centrally on a hardware controlled by you.\n\n- Pydio — Mature open source web application for file sharing and synchronization.\n\n- Seafile — An online file storage and collaboration tool with advanced support for file syncing, privacy protection and teamwork.\n\n"
    },
    {
      "title": "Cloud synchronization clients",
      "level": 3,
      "content": "- Some synchronization and backup programs provide direct support for some cloud-storage services.\n- Some FUSE filesystems provide a way to mount cloud-storage as a filesystem. Google Drive can be accessed also by gvfs-google for GVFS-based applications (like Nautilus), and by kio-gdrive for KIO-based applications (like Dolphin).\n- See Data-at-rest encryption#Cloud-storage optimized to achieve zero-knowledge (client-side transparent encryption) storage on any third-party cloud service.\n\n"
    },
    {
      "title": "Multi-protocol clients",
      "level": 4,
      "content": "- CloudCross — Synchronize local files and folders with many cloud providers. Mail.ru Cloud, Yandex Disk, Google Drive, OneDrive and Dropbox support is available.\n\n- Rclone — Multi-provider sync, copy, and mount client.\n\n- Rclone Browser — GUI client for Rclone.\n\n"
    },
    {
      "title": "Google Drive clients",
      "level": 4,
      "content": "- DriveSync — Command line utility that synchronizes your Google Drive files with a local folder on your machine.\n\n- gdrive — Command line utility for interacting with Google Drive.\n\n- Grive — Google Drive client with support for new Drive REST API and partial sync.\n\n- Insync — Unofficial proprietary Google Drive desktop client.\n\n- Google Drive OCamlFUSE — A FUSE filesystem for Google Drive, written in OCaml.\n\n"
    },
    {
      "title": "Other synchronization clients",
      "level": 4,
      "content": "- aws-cli — CLI for Amazon Web Services, including efficient file transfers to and from Amazon S3.\n\n- Backblaze B2 — Backblaze B2 open-source command-line client.\n\n- Baidu Netdisk — Proprietary client for cloud storage service launched by Baidu (formerly Baidu Cloud).\n\n- Cozy Drive — Desktop client for Cozy.\n\n- Dropbox — Proprietary desktop client for Dropbox.\n\n- Mega Sync Client — Proprietary (though source-available) desktop client to sync files with Mega.\n\n- Megatools — Unofficial CLI for Mega.\n\n- Nextcloud Client — Desktop client for Nextcloud.\n\n- Nutstore — Proprietary desktop client for Nutstore.\n\n- OneDrive — Unofficial CLI for OneDrive.\n\n- OneDrive — Fork of the unofficial CLI for OneDrive.\n\n- ownCloud Desktop Client — Desktop syncing client for ownCloud.\n\n- pCloud Drive — Proprietary desktop syncing client for pCloud. Based on the Electron platform.\n\n- PydioSync — Desktop client for Pydio.\n\n- S3cmd — Unofficial CLI for Amazon S3.\n\n- Seafile Client — GUI client for Seafile.\n\n- Versiobit — Desktop file sync client with versioning and end-to-end encryption.\n\n- SpiderOak One — Proprietary client for SpiderOak One.\n\n- Synology Drive — Proprietary GUI client to sync and share files between a centralized Synology NAS and multiple client computers.\n\n- Tresorit — Proprietary desktop syncing client for Tresorit.\n\n- Yandex Disk — Proprietary CLI for Yandex Disk.\n\n"
    },
    {
      "title": "FTP clients",
      "level": 4,
      "content": "See also Wikipedia:Comparison of FTP client software.\n\n- CurlFtpFS — is a filesystem for accessing FTP hosts based on FUSE and libcurl.\n\n- FileZilla — Fast and reliable FTP, FTPS and SFTP client.\n\n- ftp — Simple ftp client provided by GNU Inetutils\n\n- lftp — Sophisticated command line based FTP client\n\n- ncftp — A set of free application programs implementing FTP.\n\n- tnftp — FTP client with several advanced features for NetBSD.\n\nSome file managers like Dolphin, GNOME Files and Thunar also provide FTP functionality.\n\n"
    },
    {
      "title": "FTP servers",
      "level": 4,
      "content": "See also Wikipedia:List of FTP server software.\n\n- bftpd — Small, easy-to-configure FTP server\n\n- ftpd — Simple ftp server provided by GNU Inetutils\n\n- proFTPd — A secure and configurable FTP server\n\n- Pure-FTPd — Free (BSD-licensed), secure, production-quality and standard-compliant FTP server.\n\n- SSH — SFTP is a network protocol that provides file access, file transfer, and file management over any reliable data stream.\n\n- vsftpd — Lightweight, stable and secure FTP server for UNIX-like systems.\n\n"
    },
    {
      "title": "BitTorrent clients",
      "level": 3,
      "content": "Some download managers are also able to connect to the BitTorrent network: Aria2, LFTP, FatRat, KGet, MLDonkey, uGet.\n\nSee also Wikipedia:Comparison of BitTorrent clients.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- Ctorrent — CTorrent is a BitTorrent client implemented in C++ to be lightweight and quick.\n\n- Deluge — BitTorrent client with multiple user interfaces in a client/server model. This package includes a console client.\n\n- peerflix — Streaming torrent client for node.js.\n\n- rTorrent — Simple and lightweight ncurses BitTorrent client.\n\n- Transmission CLI — Simple and easy-to-use BitTorrent client with a daemon version and multiple front-ends. This package includes backend, daemon, command-line interface, and a Web UI interface.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Deluge (GTK interface) — User-friendly BitTorrent client written in Python using GTK.\n\n- Fragments — Easy to use BitTorrent client for the GNOME desktop environment.\n\n- FrostWire — Easy to use cloud downloader, BitTorrent client and media player.\n\n- Ktorrent — Feature-rich BitTorrent client for KDE. Part of kde-network.\n\n- Powder Player — Hybrid between a streaming BitTorrent client and a player. Based on the Electron platform.\n\n- qBittorrent — Open source (GPLv2) BitTorrent client with an integrated torrent search engine that strongly resembles µTorrent.\n\n- Tixati — Proprietary peer-to-peer file sharing program that uses the popular BitTorrent protocol.\n\n- Torrential — Simple torrent client for elementary OS.\n\n- Transmission — Simple and easy-to-use BitTorrent client with a daemon version and multiple front-ends.\n\n- Transmission Remote — GTK client for remote management of the Transmission BitTorrent client, using its HTTP RPC protocol.\n\n- Tremotesf — Qt client for remote management of the Transmission BitTorrent client, using its HTTP RPC protocol.\n\n- Tribler — 4th generation file sharing system BitTorrent client.\n\n- Vuze — Feature-rich BitTorrent client written in Java (formerly Azureus).\n\n- WebTorrent Desktop — Streaming BitTorrent application. Based on the Electron platform.\n\n"
    },
    {
      "title": "Other P2P networks",
      "level": 3,
      "content": "See also Wikipedia:Comparison of file-sharing applications.\n\n- aMule — Well-known eDonkey/Kad client with a daemon version and GTK, web, and CLI front-ends.\n\n- EiskaltDC++ — Direct Connect and ADC client.\n\n- gtk-gnutella — GTK server/client for the Gnutella peer-to-peer network.\n\n- KaMule — KDE graphical front-end for aMule.\n\n- LBRY — Browser and wallet for LBRY, the decentralized, user-controlled content marketplace. Based on the Electron platform.\n\n- lbt — Small set of command-line tools for LBRY.\n\n- MLDonkey — Multi-protocol P2P client that supports HTTP, FTP, BitTorrent, Direct Connect, eDonkey and FastTrack.\n\n- ncdc — Modern and lightweight Direct Connect and ADC client with a friendly ncurses interface.\n\n- Nicotine+ — A graphical client for the Soulseek P2P network.\n\n- Send Anywhere — Proprietary file sharing service where users can directly share digital content in real time. Based on the Electron platform.\n\n- IPFS — IPFS is a P2P Network capable of sharing and receiving files.\n\n"
    },
    {
      "title": "Pastebin services",
      "level": 3,
      "content": "See also Wikipedia:Pastebin.\n\nPastebin services are often used to quote text or images while collaborating and troubleshooting. Pastebin clients provide a convenient way to post from the command line.\n\nNote: **not** \n\n"
    },
    {
      "title": "Without a dedicated client",
      "level": 4,
      "content": "Some services can be used with more general command line tool, such as cURL. For extensions, such as line numbers, one can use more command line tools. Such as cat -n.\n\n- 0x0.st is a file hosting service. Usage examples are:\n\n```\n$ command | curl -F 'file=@-' 0x0.st\n```\n\n```\n$ curl -F 'file=@-' 0x0.st < file\n```\n\n- termbin.com works with nc.\n- paste.c-net.org accepts HTTP requests and works with nc.\n\n"
    },
    {
      "title": "Dedicated clients",
      "level": 4,
      "content": "- Fb-client — Client for the paste.xinu.at pastebin.\n\n- Gist — Command-line interface for the gist.github.com pastebin service.\n\n- imgur — A CLI client which can upload image to imgur.com image sharing service.\n\n- Pastebinit — Really small Python script that acts as a Pastebin client (see pastebinit -l for the list of servers).\n\n- ruby-haste — Client for hastebin.com.\n\n- Wgetpaste — Bash script that automates pasting to a number of pastebin services.\n\n"
    },
    {
      "title": "Email clients",
      "level": 3,
      "content": "See also Wikipedia:Comparison of email clients\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- aerc — Work in progress asynchronous email client.\n\n- alot — An experimental terminal MUA based on notmuch mail. It is written in python using the urwid toolkit.\n\n- Alpine — Fast, easy-to-use and Apache-licensed email client based on Pine.\n\n- S-nail — a mail processing system with a command syntax reminiscent of ed with lines replaced by messages. Provides the functionality of mailx.\n\n- mu/mu4e — Email indexer (mu) and client for emacs (mu4e). Xapian based for fast searches.\n\n- Mutt — Small but very powerful text-based mail client.\n\n- NeoMutt — Command line mail reader (or MUA). It is a fork of Mutt with added features.\n\n- nmh — A modular mail handling system.\n\n- notmuch — A fast mail indexer built on top of xapian.\n\n- sendemail — A lightweight command line SMTP email client written in Perl.\n\n- Sup — CLI mail client with very fast searching, tagging, threading and GMail like operation.\n\n- swaks — Swiss Army Knife SMTP; Command line SMTP testing, including TLS and AUTH, can be used to send emails.\n\n- Wanderlust — Email client and news reader for Emacs.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Balsa — Simple and light email client for GNOME.\n\n- Betterbird — Fork of thunderbird.\n\n- Claws Mail — Lightweight GTK-based email client and news reader.\n\n- ElectronMail — Unofficial desktop application for several end-to-end encrypted email providers (like ProtonMail, Tutanota). Based on the Electron platform.\n\n- Evolution — Mature and feature-rich e-mail client that is part of the GNOME project. Part of gnome-extra.\n\n- Geary — Simple desktop mail client built in Vala. Part of gnome-extra.\n\n- Kmail — Mature and feature-rich email client. Part of kde-pim.\n\n- Kube — Modern communication and collaboration client built with QtQuick.\n\n- Mailspring — Fork of Nylas Mail by one of the original authors. The paid \"Pro\" version requires a Mailspring ID and has extra features like snooze, send later. Based on the Electron platform.\n\n- SeaMonkey Mail & Newsgroups — Email client included in the SeaMonkey suite.\n\n- Thunderbird — Feature-rich email client from Mozilla written in GTK.\n\n- Tutanota — Email client for Tutanota mail service. Based on the Electron platform.\n\n- Viagee — It allows desktop mail actions, such as 'Send File as Email' or web 'mailto' links, to be handled by the Gmail web client.\n\n"
    },
    {
      "title": "Web-based",
      "level": 4,
      "content": "- Nextcloud Mail — An email webapp for NextCloud.\n\n- Roundcube — Browser-based multilingual IMAP client webapp with a native application-like user interface.\n\n- SquirrelMail — Webmail for Nuts!\n\n"
    },
    {
      "title": "Mail notifiers",
      "level": 3,
      "content": "- Ayatana Webmail — Webmail notifications and actions for any desktop.\n\n- Bubblemail — New and Unread mail notification service for local mailboxes, pop, imap, and gnome online accounts. A fork of Mailnag.\n\n- Gnubiff — Mail notification program that checks for mail and displays headers when new mail has arrived.\n\n- Mailnag — Extensible mail notification daemon.\n\n"
    },
    {
      "title": "Mail servers",
      "level": 3,
      "content": "See Mail server.\n\n- DavMail — POP/IMAP/SMTP/Caldav/Carddav/LDAP exchange gateway allowing users to use any mail/calendar client with an Exchange server.\n\n- Modoboa — A modular mail hosting and management platform, written in Python.\n\n"
    },
    {
      "title": "Mail retrieval agents",
      "level": 3,
      "content": "See also Wikipedia:Mail retrieval agent.\n\n- fdm — Program to fetch and deliver mail.\n\n- Fetchmail — A remote-mail retrieval utility.\n\n- getmail — A POP3/IMAP4 mail retriever with reliable Maildir and command delivery.\n\n- hydroxide — A third-party, open-source ProtonMail CardDAV, IMAP and SMTP bridge\n\n- imapsync — IMAP synchronisation, sync, copy or migration tool\n\n- isync — IMAP and MailDir mailbox synchronizer\n\n- mpop — A small, fast POP3 client suitable as a fetchmail replacement\n\n- vomit — Rust utility to sync between Maildir mailbox and IMAP mailbox\n\n- OfflineIMAP — Synchronizes emails between two repositories.\n\n"
    },
    {
      "title": "Instant messaging clients",
      "level": 3,
      "content": "See also Wikipedia:Comparison of instant messaging clients and Wikipedia:Comparison of VoIP software.\n\nThis section lists all client software with instant messaging support.\n\n"
    },
    {
      "title": "Multi-protocol clients",
      "level": 4,
      "content": "The number of networks supported by these clients is very large but they (like any multi-protocol clients) usually have very limited or no support for network-specific features.\n\n- BitlBee — IRC gateway to popular chat networks.\n\n- Finch — Ncurses-based chat client that uses libpurple and supports all its protocols (Bonjour, Gadu-Gadu, Groupwise, IRC, SIMPLE, XMPP, Zephyr).\n\n- WeeChat — Modular, lightweight ncurses-based IRC client. A variety of other protocols are supported through plugins.\n\n- Jitsi — Audio/video VoIP phone and instant messenger written in Java that supports protocols such as SIP, XMPP, IRC and many other useful features.\n\n- Lith — WeeChat Relay client, allowing to connect to a running WeeChat instance from anywhere.\n\n- Pidgin — Multi-protocol instant messaging client with audio support that uses libpurple and supports all its protocols (Bonjour, Gadu-Gadu, Groupwise, IRC, SIMPLE, XMPP, Zephyr).\n\n- Smuxi — Cross-platform IRC client that also supports XMPP.\n\n- Thunderbird — Feature-rich email client supports instant messaging and chat using IRC and XMPP.\n\n"
    },
    {
      "title": "IRC clients",
      "level": 4,
      "content": "See also Wikipedia:Comparison of Internet Relay Chat clients.\n\n- BitchX — Console-based IRC client developed from the popular ircII.\n\n- catgirl — TLS-only terminal IRC client.\n\n- ERC — Powerful, modular and extensible IRC client for Emacs.\n\n- ii — Featherweight IRC client, literally tail -f the conversation and echo back your replies to a file.\n\n- ircii — Oldest maintained IRC client which lays claim to being small and fast owing to its reduced feature set.\n\n- Irssi — Highly-configurable ncurses-based IRC client.\n\n- pork — Programmable, ncurses-based IRC client that mostly looks and feels like ircII.\n\n- ScrollZ — Advanced IRC client based on ircII.\n\n- senpai — An IRC client that works best with bouncers (e.g. soju-gitAUR): no logs are kept, history is fetched from the server via CHATHISTORY, networks are fetched from the server via bouncer-networks.\n\n- sic — Extremely simple IRC client, similar to ii.\n\n- tiny — an IRC client written in Rust with a clutter-free interface\n\n- ChatZilla — Clean, easy to use and highly extensible Internet Relay Chat (IRC) client, built on the Mozilla platform using XULRunner. Included in the SeaMonkey suite.\n\n- Halloy — An open-source IRC client written in Rust, with the iced GUI library.\n\n- HexChat — Fork of XChat for Linux and Windows.\n\n- Konversation — Qt-based IRC client for the KDE desktop. Part of kde-network.\n\n- KVIrc — Qt-based IRC client featuring extensive themes support.\n\n- Loqui — GTK IRC client.\n\n- LostIRC — Simple GTK IRC client with tab-autocompletion, multiple server support, logging and others.\n\n- Polari — Simple IRC client by the GNOME project. Part of gnome-extra.\n\n- Quassel — Modern, cross-platform, distributed IRC client.\n\n- Srain — Modern, beautiful IRC client written in GTK 3.\n\n- Thelounge — Modern self-hosted web IRC client\n\n"
    },
    {
      "title": "XMPP clients",
      "level": 4,
      "content": "See also Wikipedia:XMPP.\n\n- Freetalk — Console-based XMPP client.\n\n- jabber.el — Minimal XMPP client for Emacs.\n\n- MCabber — Small XMPP console client, includes features: SSL, PGP, MUC, OTR and UTF8.\n\n- Poezio — XMPP client with IRC feeling\n\n- Profanity — A console based XMPP client inspired by Irssi.\n\n- Converse.js — Web-based XMPP chat client written in JavaScript.\n\n- Dino — A modern, easy to use XMPP client, with PGP and OMEMO support.\n\n- Gajim — XMPP client with audio support written in Python using GTK.\n\n- Kaidan — A simple, user-friendly Jabber/XMPP client providing a modern user interface using Kirigami and QtQuick.\n\n- Libervia (Salut à Toi) — Web frontend for Salut à Toi, multi-purpose XMPP client\n\n- Nextcloud JavaScript XMPP Client — Chat app for Nextcloud with XMPP, end-to-end encryption, video calls, file transfer & group chat.\n\n- Psi — Qt-based XMPP client.\n\n- Spark — Cross-platform real-time XMPP collaboration client optimized for business and organizations.\n\n- Swift — XMPP client written in C++ with Qt and Swiften.\n\n- Tkabber — Easy to hack feature-rich XMPP client by the author of the ejabberd XMPP server.\n\n- Vacuum IM — Full-featured crossplatform XMPP client.\n\n"
    },
    {
      "title": "SIP clients",
      "level": 4,
      "content": "See also Wikipedia:List of SIP software#Clients.\n\n- Blink — State of the art, easy to use SIP client.\n\n- baresip — portable and modular SIP User-Agent with audio and video support.\n\n- Calls — Simple, elegant phone dialer and call handler for GNOME. It can be used with a cellular modem for plain old telephone calls as well as VoIP calls using the SIP protocol.\n\n- Jami — SIP-compatible softphone and instant messenger for the decentralized Jami network. Formerly known as Ring and SFLphone.\n\n- Linphone — VoIP phone application (SIP client) for communicating freely with people over the internet, with voice, video, and text instant messaging.\n\n- Twinkle — Qt softphone for VoIP and IM communication using SIP.\n\n- Zoiper — Proprietary SIP and IAX2 VoIP softphone\n\n"
    },
    {
      "title": "Matrix clients",
      "level": 4,
      "content": "See also Matrix and Matrix Clients.\n\n- Chatty — Simple to use SMS and Matrix messaging application.\n\n- Cinny — Cinny is a matrix client focusing primarily on simple, elegant and secure interface. The desktop app is made with Tauri.\n\n- Element — Glossy Matrix client with an emphasis on performance and usability. Web application and desktop application based on the Electron platform.\n\n- FluffyChat — Multi-platform Matrix client with a simple and clean UI written in Dart/Flutter.\n\n- Fractal — Matrix client for GNOME written in Rust.\n\n- Gomuks — Terminal Matrix client written in Go using mautrix and mauview.\n\n- iamb — A terminal-based Matrix client with Vim keybindings written in Rust.\n\n- Moment — A fancy, customizable, keyboard-operable Matrix chat client for encrypted and decentralized communication. Written in Qt/QML + Python with nio, fork of the now-abandoned Mirage.\n\n- Neochat — KDE client for the Matrix protocol. Part of kde-network.\n\n- nheko — Desktop client for the Matrix protocol.\n\n- Quaternion — Qt5-based IM client for the Matrix protocol.\n\n- QuickMedia — A rofi inspired native client for web services. Supports Matrix and several other sites.\n\n- SchildiChat — Matrix client based on Element with a more traditional instant messaging experience. Based on the Electron platform.\n\n- Spectral — Qt5-based Glossy cross-platform client for Matrix.\n\n- Syphon — Privacy-centric cross-platform Matrix client with E2EE support, currently in alpha.\n\n"
    },
    {
      "title": "Tox clients",
      "level": 4,
      "content": "See also Tox and comparison clients\n\n- ratox — FIFO based tox client.\n\n- Toxic — ncurses-based Tox client\n\n- Toxygen — Tox client written in pure Python3.\n\n- Venom — a modern Tox client for the GNU/Linux desktop\n\n- µTox — Lightweight Tox client.\n\n"
    },
    {
      "title": "LAN messengers",
      "level": 4,
      "content": "See also Avahi#Link-Local (Bonjour/Zeroconf) chat and Wikipedia:Comparison of LAN messengers.\n\n- BeeBEEP — Secure LAN Messenger.\n\n- iptux — LAN communication software, compatible with IP Messenger.\n\n"
    },
    {
      "title": "P2P messaging clients",
      "level": 4,
      "content": "See also Ring and Tox.\n\n- Briar — Briar is a messaging application designed for activists, journalists, and anyone else who needs a safe, easy and robust way to communicate.\n\n- Patchwork — Decentralized messaging and sharing application built on top of Secure Scuttlebutt (SSB). Based on the Electron platform.\n\n- Manyverse — Modern decentralized messaging and sharing application built on top of Secure Scuttlebutt (SSB).\n\n- RetroShare — Serverless encrypted instant messenger with filesharing, chatgroups, mail.\n\n- Ricochet — Anonymous peer-to-peer instant messaging system built on Tor hidden services.\n\n"
    },
    {
      "title": "Other IM clients",
      "level": 4,
      "content": "- Caprine — Unofficial Facebook Messenger app. Based on the Electron platform.\n\n- Chatterino — Chat client for Twitch chat.\n\n- Delta Chat — A privacy oriented chat application built on e-mail. Based on the Electron platform.\n\n- Discord — Proprietary all-in-one voice and text chat application for gamers that’s free and works on both your desktop and phone. Based on the Electron platform.\n\n- Flare — Unofficial Signal client based on GTK.\n\n- Gitter — Communication product for communities and teams on GitLab and GitHub.\n\n- Jitsi Meet — Desktop application for Jitsi Meet. Based on the Electron platform.\n\n- Kotatogram Desktop — Experimental fork of Telegram Desktop.\n\n- Matterhorn — Console client for the Mattermost chat system.\n\n- Mattermost Desktop — Desktop application for Mattermost. Based on the Electron platform.\n\n- Microsoft Teams — Official proprietary client for Microsoft Teams. Based on the Electron platform.\n\n- Mumble — Voice chat application similar to TeamSpeak.\n\n- Paper Plane — Chat over Telegram on a modern and elegant client.\n\n- QQ — Proprietary instant messaging software developed by Tencent (imitating ICQ).\n\n- Rocket.Chat Desktop — Desktop application for Rocket.Chat. Based on the Electron platform.\n\n- Ruqola — Rocket.Chat client for the KDE desktop.\n\n- Session Desktop — Onion routing based messenger. Based on the Electron platform.\n\n- Signal Desktop — Desktop application for Signal private messenger. Based on the Electron platform.\n\n- Skype — Popular but proprietary application for voice and video communication. Based on the Electron platform.\n\n- Slack — Proprietary Slack client for desktop. Based on the Electron platform.\n\n- teams-for-linux — Unofficial Microsoft Teams for Linux client. Based on the Electron platform.\n\n- TeamSpeak — Proprietary VoIP application with gamers as its target audience.\n\n- TeamTalk — Proprietary VoIP application with video chat, file and desktop sharing. Desktop sharing does not appear to be working in Linux though. AUR package is server only, but client is built in the make process.\n\n- Telegram Desktop — Official Telegram desktop client.\n\n- Viber — Proprietary cross-platform IM and VoIP software.\n\n- Wire — Modern, private messenger. Based on the Electron platform.\n\n- Zoom — Proprietary video conferencing, online meetings and group messaging application.\n\n- Zulip — Desktop client for Zulip group chat. Based on the Electron platform.\n\n"
    },
    {
      "title": "Instant messaging servers",
      "level": 3,
      "content": "See also Wikipedia:Comparison of instant messaging protocols.\n\n"
    },
    {
      "title": "IRC servers",
      "level": 4,
      "content": "- InspIRCd — A stable, modern and lightweight IRC daemon.\n\n- IRCD-Hybrid — A lightweight, high-performance internet relay chat daemon.\n\n- miniircd — A small and configuration free IRC server, suitable for private use.\n\n- ngIRCd — A free, portable and lightweight Internet Relay Chat server for small or private networks.\n\n- Ergo — A modern and simple to set up IRC server written in Go. Combines the features of an IRCd, a services framework, and a bouncer.\n\n- UnrealIRCd — Open Source IRC Server.\n\n- Solanum — Solanum is the upcoming IRCd for unified networks that is being worked on by a collaboration of Libera Chat and OFTC staff.\n\n"
    },
    {
      "title": "XMPP servers",
      "level": 4,
      "content": "- Prosody — An XMPP server written in the Lua programming language. Prosody is designed to be lightweight and highly extensible. It is licensed under a permissive MIT license.\n\n- Ejabberd — Robust, scalable and extensible XMPP Server written in Erlang\n\n- Jabberd2 — An XMPP server written in the C language and licensed under the GNU General Public License. It was inspired by jabberd14.\n\n- Openfire — An XMPP IM multiplatform server written in Java\n\n"
    },
    {
      "title": "SIP servers",
      "level": 4,
      "content": "See also Wikipedia:List of SIP software#Servers.\n\n- Asterisk — A complete PBX solution.\n\n- Kamailio — SIP server for large VoIP and real-time communication platforms.\n\n- openSIPS — SIP proxy/server for voice, video, IM, presence and any other SIP extensions.\n\n- Repro — An open-source, free SIP server.\n\n- Yate — Advanced, mature, flexible telephony server that is used for VoIP and fixed networks, and for traditional mobile operators and MVNOs.\n\n"
    },
    {
      "title": "Other IM servers",
      "level": 4,
      "content": "- Mattermost — Open source private cloud server, Slack-alternative.\n\n- Murmur — The voice chat application server for Mumble.\n\n- Nextcloud Talk — Video- and audio-conferencing app for Nextcloud.\n\n- Rocket.Chat — Web chat server, developed in JavaScript, using the Meteor fullstack framework.\n\n- Synapse — Reference homeserver for the Matrix protocol.\n\n- TeamSpeak Server — Proprietary VoIP conference server.\n\n- uMurmur — Minimalistic Mumble server.\n\n"
    },
    {
      "title": "Collaborative software",
      "level": 3,
      "content": "See also Wikipedia:Collaborative software.\n\n- SOGo — Groupware server built around OpenGroupware.org (OGo) and the SOPE application server.\n\n"
    },
    {
      "title": "Link shortening servers",
      "level": 3,
      "content": "- microbin — A tiny, self-contained, configurable paste bin and URL shortener written in Rust.\n\n- shlink — Self-proclaimed definitive self-hosted URL shortener.\n\n- YOURLS — A self-hosted link shortening service written in PHP.\n\n"
    },
    {
      "title": "News aggregators",
      "level": 3,
      "content": "Web feeds aggregators. Some email clients are also able to act as news aggregator: Claws Mail RSSyl plugin, Evolution, SeaMonkey Mail & Newsgroups, Thunderbird.\n\nSee also Wikipedia:Comparison of feed aggregators.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- Canto — Ncurses RSS aggregator.\n\n- Ditch The Bell — A highly configurable Linux-based desktop notifier for RSS/Atom feeds.\n\n- Gnus — Email, NNTP and RSS client for Emacs.\n\n- feed2imap-go — feed2imap reimplemented in Go that aggregating RSS/Atom/jsonfeed into folders of your IMAP mailbox.\n\n- Newsboat — Ncurses RSS aggregator with layout and keybinding similar to the Mutt email client.\n\n- Newsraft — Feed reader with ncurses user interface. It is greatly inspired by Newsboat and tries to be its lightweight counterpart.\n\n- Rawdog — \"RSS Aggregator Without Delusions Of Grandeur\" that parses RSS/CDF/Atom feeds into a static HTML page of articles in chronological order.\n\n- rss2email — Aggregating your RSS/Atom feed into your IMAP/Maildir mailbox as a cronjob.\n\n- sfeed — Crontab oriented shell-scriptable feed aggregator setup with an RSS/Atom parser utility plus a simple ncurses reader.\n\n- Snownews — Text mode RSS news reader.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Akregator — News aggregator for KDE, part of kde-pim.\n\n- Alligator — Kirigami-based RSS/Atom feed reader for mobile devices. Part of kde-network.\n\n- Feeds — An RSS/Atom feed reader for GNOME.\n\n- Fluent Reader — Modern desktop RSS reader built with React and Fluent UI. Based on the Electron platform.\n\n- HackUp — Read Hacker News from the desktop.\n\n- Liferea — GTK news aggregator for online news feeds and weblogs.\n\n- Newsflash — Modern feed reader designed for the GNOME desktop. The spiritual successor to FeedReader.\n\n- Raven — Simple desktop RSS reader made using VueJS. Based on the Electron platform.\n\n- RSS Guard — Very tiny RSS and ATOM news reader developed using Qt framework.\n\n- selfoss — The new multipurpose RSS reader, live stream, mashup, aggregation web application.\n\n- Tickr — GTK-based RSS Reader that displays feeds as a smooth scrolling line on your desktop, as known from TV stations.\n\n"
    },
    {
      "title": "Graphical, Web-based",
      "level": 4,
      "content": "- Nextcloud News — RSS/Atom feed reader for Nextcloud.\n\n- Tiny Tiny RSS — Web-based news feed (RSS/Atom) aggregator.\n\n"
    },
    {
      "title": "Podcast clients",
      "level": 3,
      "content": "Some media players are also able to act as podcast client: Amarok, Cantata, Clementine, Goggles Music Manager, Rhythmbox, VLC media player. git-annex can also function as podcatcher.\n\nSee also Wikipedia:List of podcatchers.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- castero — A TUI podcast client for the terminal.\n\n- castget — Simple, command-line RSS enclosure downloader, primarily intended for automatic, unattended downloading of podcasts.\n\n- gpo — Text mode interface of gPodder.\n\n- Greg — A command-line podcast aggregator.\n\n- pcd — A minimal podcast client written in go\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- CPod — Simple, beautiful podcast app. Based on the Electron platform.\n\n- gPodder — Podcast client and media aggregator (GTK interface).\n\n- Kasts — Convergent podcast application that looks good on desktop and mobile. Part of kde-multimedia.\n\n- Pocket Casts — Electron wrapper around the Pocket Casts web app with support for MPRIS (media controls).\n\n- Podcasts — Podcast client for the GNOME desktop written in Rust.\n\n- Vocal — Simple podcast client for the Modern Desktop (GTK).\n\n"
    },
    {
      "title": "Usenet newsreaders",
      "level": 3,
      "content": "Some email clients are also able to act as Usenet newsreader: Claws Mail, Evolution, NeoMutt, SeaMonkey Mail & Newsgroups, Sylpheed, Thunderbird.\n\nSee also: Wikipedia:List of Usenet newsreaders, Wikipedia:Comparison of Usenet newsreaders.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- nn — Alternative more user-friendly (curses-based) Usenet newsreader for UNIX.\n\n- slrn — Text-based news client.\n\n- tin — A cross-platform threaded NNTP and spool based UseNet newsreader.\n\n- trn — A text-based Threaded Usenet newsreader.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- NZBGet — Usenet binary downloader for .nzb files with web and CLI interface.\n\n- Pan — GTK Usenet newsreader that's good at both text and binaries.\n\n- SABnzbd — An open-source binary newsreader webapp written in Python.\n\n- XRN — Usenet newsreader for X Window System.\n\n"
    },
    {
      "title": "Microblogging clients",
      "level": 3,
      "content": "- Choqok — Microblogging client for KDE that supports Mastodon, Pump.io and GNU social.\n\n- Dianara — Pump.io client written in Qt.\n\n- Lemmy-UI — Official web app for lemmy.\n\n- Lemoa — Native Gtk client for Lemmy.\n\n- Liftoff — A mobile and desktop lemmy client written in flutter.\n\n- Mikutter — Simple, powerful Mastodon client using GTK and Ruby.\n\n- Pumpa — Pump.io client written in C++ and Qt.\n\n- Tokodon — Mastodon client for KDE. Part of kde-network.\n\n- Toot — CLI and TUI tool for interacting with Mastodon instances.\n\n- Tuba — GTK4 client for Mastodon.\n\n- Whalebird — Mastodon client application. Based on the Electron platform.\n\n"
    },
    {
      "title": "Blog engines",
      "level": 3,
      "content": "See also Wikipedia:Blog software and Wikipedia:List of content management systems.\n\n- Diaspora — A distributed privacy aware social network.\n\n- Drupal — A PHP-based content management platform.\n\n- Joomla — A php Content Management System (CMS) which enables you to build websites and powerful online applications.\n\n- Wordpress — Blog tool and publishing platform.\n\n"
    },
    {
      "title": "Static site generators",
      "level": 3,
      "content": "- Hexo — Fast, simple and powerful blog framework.\n\n- Hugo — Hugo is a static HTML and CSS website generator written in Go. It is optimized for speed, ease of use, and configurability.\n\n- Jekyll — Static blog engine, written in Ruby, which supports Markdown, textile and other formats.\n\n- Nikola — Static site generator written in Python, with incremental rebuilds and multiple markup formats.\n\n- Pelican — Static site generator, powered by Python.\n\n- Zola — An opinionated static site generator, written in Rust.\n\n"
    },
    {
      "title": "Gallery software",
      "level": 3,
      "content": "- fgallery — A static photo gallery generator with no frills that has a stylish, minimalist look.\n\n- jAlbum — A freeware cross-platform software for managing and creating digital photo albums or galleries.\n\n- jolly — A tool for statically generating galleries from images.\n\n- llgal — An easy and fast on-line gallery generator based on iGal.\n\n- thumbsup — A static web galleries for all your photos and videos.\n\n- Photoview — A photo gallery for self-hosted personal servers.\n\n- Piwigo — A web application to manage your collection of photos, and other medias.\n\n- revela — A static web image gallery generator.\n\n- Sigal — A simple static gallery generator.\n\n- ZenphotoCMS — A CMS for selfhosted, gallery focused websites.\n\n"
    },
    {
      "title": "Remote desktop",
      "level": 2,
      "content": "See also Wikipedia:Remote desktop software and Wikipedia:Comparison of remote desktop software.\n\nSee also Chrome Remote Desktop for a web browser based solution.\n\n"
    },
    {
      "title": "Remote desktop clients",
      "level": 3,
      "content": "- AnyDesk — Proprietary remote desktop software.\n\n- GNOME Connections — Remote desktop client for GNOME. Supports RDP and VNC. Part of gnome.\n\n- GVncViewer — Simple VNC Client on Gtk-VNC. Run with gvncviewer.\n\n- KRDC — Remote Desktop Client for KDE. Supports RDP and VNC. Part of kde-network.\n\n- Remmina — Remote desktop client written in GTK. Supports RDP, VNC, NX, XDMCP and SSH.\n\n- Remote Viewer — Simple remote display client. Supports SPICE and VNC.\n\n- RustDesk — A remote desktop software, open source, written in Rust.\n\n- Sunlogin Remote Control — Proprietary software that supports remote control of mobile devices, Windows, Mac, Linux and other systems. It uses its own proprietary protocol.\n\n- ToDesk — Proprietary remote desktop client that suits for remote teamwork. It uses its own proprietary protocol.\n\n- TeamViewer — Proprietary remote desktop client. It uses its own proprietary protocol.\n\n- vncviewer (TigerVNC) — VNC viewer for X.\n\n- Vinagre — Remote desktop viewer for GNOME. Supports RDP, VNC, SPICE and SSH.\n\n- xfreerdp — FreeRDP X11 client. Run with xfreerdp.\n\n- X2Go Client — A graphical client (Qt5) for the X2Go system that uses the NX technology protocol.\n\n"
    },
    {
      "title": "Remote desktop servers",
      "level": 3,
      "content": "- freerdp-shadow-cli — A utility for sharing an X display via RDP.\n\n- kmsvnc — A VNC server for DRM/KMS capable GNU/Linux devices.\n\n- KRdp — A limited RDP server for KDE.\n\n- Krfb — VNC server for KDE. Part of kde-network.\n\n- MeshCentral — Device management server for files, terminal access and remote desktop into Linux (X11), macOS and Windows.\n\n- NoMachine — Proprietary remote desktop server and client based on NX technology.\n\n- wayvnc — VNC server for wlroots based wayland compositors (such as sway).\n\n- x0vncserver (TigerVNC) — VNC Server for X displays.\n\n- x11vnc — VNC server for real X displays.\n\n- X2Go Server — An open source remote desktop software that uses the NX technology protocol.\n\n- Xpra — A multi-platform screen and application forwarding system.\n\n- Xrdp — A daemon that supports RDP. It uses Xvnc, X11rdp or xorgxrdp as a backend.\n\n"
    }
  ]
}