{
  "title": "Cairo dock",
  "url": "https://wiki.archlinux.org/title/Cairo_dock",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Cairo-Dock is a highly customizable dock written in C.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the cairo-dock package.\n\nThe core package provides only the strict minimum to run Cairo-Dock — to use applets, animations, views, effects and dialogs you will also need cairo-dock-plug-ins.\n\nYou can also try the development branch with cairo-dock-gitAUR.\n\n"
    },
    {
      "title": "Plugin dependencies",
      "level": 3,
      "content": "The applets in cairo-dock-plug-ins require quite a lot of dependencies, therefore all of them have been made optional not to bloat your system if you do not use a particular applet. Please refer to the optdepends list and install those you need.\n\n"
    },
    {
      "title": "Running the dock",
      "level": 3,
      "content": "Run the dock in the background:\n\n```\n$ cairo-dock &\n```\n\nThis will generate a startup message that will ask you to choose a backend for the current session (OpenGL or Cairo). There is an option to remember the choice and if not choosing to remember the choice, a startup message will be generated each time Cairo-Dock is run without backend options. To supress the startup message, you can specify which backend to use when running Cairo-Dock by specifying it as an option.\n\nRun the dock with OpenGL backend:\n\n```\n$ cairo-dock -o &\n```\n\nRun the dock with Cairo backend:\n\n```\n$ cairo-dock -c &\n```\n\n"
    },
    {
      "title": "Running the dock at startup",
      "level": 3,
      "content": "This depends on which desktop environment or window manager that is being used and which backend Cairo-Dock should be run with. The following section shows how to run Cairo-Dock at startup without forcing a backend.\n\n"
    },
    {
      "title": "Cairo-Dock method",
      "level": 4,
      "content": "Run Cairo-Dock and right-click the dock and go to Cairo-Dock > Launch Cairo-Dock on startup. The settings will be stored in ~/.config/autostart/ and sourced the next time you login.\n\n"
    },
    {
      "title": "Openbox/Fluxbox",
      "level": 4,
      "content": "Add the following to ~/.config/openbox/autostart or ~/.fluxbox/startup accordingly:\n\n```\ncairo-dock &\n```\n\n"
    },
    {
      "title": "Xfce",
      "level": 4,
      "content": "If you have xfce4-autostart-editor installed, simply run it and add an entry for Cairo-Dock. If you are not using a session manager you can add the following to ~/.config/xfce4/xinitrc or ~/Desktop/Autostart:\n\n```\ncairo-dock &\n```\n\n"
    },
    {
      "title": "GNOME",
      "level": 4,
      "content": "Add a Cairo-Dock entry to Startup Programs using\n\n```\n$ gnome-session-properties\n```\n\n"
    },
    {
      "title": "Configuring the dock",
      "level": 3,
      "content": "To configure the dock, right-click the dock and go to Cairo-Dock > Configure.\n\n"
    },
    {
      "title": "Two Cairo-Docks are running",
      "level": 3,
      "content": "This is most likely a result of saved sessions being runned at login. If you are using a desktop environment like GNOME, KDE or Xfce you need to disable automatic startup of sessions in your session manager settings. You may also need to delete the sessions cache:\n\n```\n$ rm ~/.cache/sessions/x*\n```\n\nIf you are not using a desktop environment with a session manager or choose to have Cairo-Dock startup by itself, you need to remove autostart files generated by Cairo-Dock:\n\n```\n$ rm ~/.config/autostart/cairo-dock*\n```\n\n"
    },
    {
      "title": "The background is black",
      "level": 3,
      "content": "This is most likely caused by not running a composite manager, like Xcompmgr. Cairo-Dock uses the transparency feature of the composite manager to display the dock, and without it the dock will be displayed with a black background. If you are using a desktop environment, simply enable the composite manager or desktop effects in the settings.\n\nAn alternative solution that does not require a composite manager is to enable fake transparency in Cairo-Dock. To do this, right-click the dock and go to Cairo-Dock > Configure > Advanced Mode > System > Composition. Then enable both Emulate composition with fake transparency and Make the config panel transparent.\n\n"
    },
    {
      "title": "Wifi plugin does not show the network strength",
      "level": 3,
      "content": "If you added the wifi plugin, and it is not showing the network strength, you have to certify that you have iwconfig installed (the plugin depends on it) and that you have permission to read the full output of iwconfig.\n\nInstall wireless_tools to get iwconfig.\n\nAnd to get the permission to read the full output of the iwconfig as a normal user (read more about Capabilities):\n\n```\n# setcap cap_net_raw,cap_net_admin=eip /usr/bin/iwconfig\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- glx-dock.org\n- Launchpad\n\n"
    }
  ]
}