{
  "title": "Chromebook Pixel 2",
  "url": "https://wiki.archlinux.org/title/Chromebook_Pixel_2",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThis page details installing Arch Linux on the Google Chromebook Pixel (2015). It is commonly referred to as the Chromebook Pixel 2, sometimes referred to by its codename Samus, and sometimes called the Chromebook Pixel LS (which stands for \"Ludicrous Speed\") when referring to the upgraded version with a Intel Core i7.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "1. Enable developer mode.\n1. Use the superuser shell in order to enable SeaBIOS.\n1. You have the option to Boot to SeaBIOS by default so you can boot without any keyboard shortcuts.\n1. Install Arch Linux.\n1. Continue reading below to correctly configure GRUB before rebooting.\n\n"
    },
    {
      "title": "GRUB",
      "level": 3,
      "content": "GRUB does not detect the correct video mode and does not display the menu by default. GRUB_GFXMODE is set to auto. Using vbeinfo, on the grub command line, it is detected at 1280x850x16. The options to display the menu are to either turn off GRUB_GFXMODE or set the correct display. In /etc/default/grub either,\n\n```\nGRUB_TERMINAL_OUTPUT=console\n```\n\nor,\n\n```\nGRUB_GFXMODE=1280x850x16\n```\n\nand then regenerate the configuration file.\n\nIf you forget to do this you can boot off the installation media again mount your disks and arch-chroot in.\n\n"
    },
    {
      "title": "Linux",
      "level": 2,
      "content": "Touchpad, touchscreen, and audio have been working in the vanilla Linux kernel since v4.9.\n\n"
    },
    {
      "title": "Suspend",
      "level": 3,
      "content": "Since kernel 5.x suspend seems to not work out-of-the-box anymore and instead shuts down when lid is closed. Install acpi and tpm2-tools, then create:\n\n```\n/etc/modprobe.d/suspend.conf\n```\n\n```\noptions tpm_tis force=1 interrupts=0\n```\n\nThis should make suspend work on lid close.\n\n"
    },
    {
      "title": "Audio, Brightness, and Touch",
      "level": 2,
      "content": "samus-scriptsAUR contains some helpful scripts for managing audio (e.g. switching between speaker and headphone output), setting screen backlight and keyboard LED brightness, and fixing the Atmel maXTouch bug (see #Unresolved Issues).\n\n"
    },
    {
      "title": "Audio scripts fail",
      "level": 3,
      "content": "If audio scripts from above do not work, create\n\n/etc/modprobe.d/audio.conf\n\nand make sure to install pulseaudio-alsa\n\n"
    },
    {
      "title": "Kernel 5.5 Audio Issues",
      "level": 3,
      "content": "After Linux Kernel 5.5, there is an extra kernel options to enable SST audio driver for bdw-rt5677 (Which is initially disabled after 5.5). Add the following switches in the kernel parameters to enable audio\n\n```\nsnd_intel_dspcfg.dsp_driver=2\n```\n\n"
    },
    {
      "title": "Enable pulseaudio-alsa without scripts",
      "level": 3,
      "content": "The hardware and driver mismatch the left and right channel, and it is defaultly muted. Just run alsamixer, and turn on the following switches will make audio works:\n\n```\nStereo DAC MIXL DAC1 R\nStereo DAC MIXR DAC1 L\n```\n\nThis switches will make all audio works, and enable the auto switch to headphone when connected.\n\n"
    },
    {
      "title": "Keyboard Bindings",
      "level": 2,
      "content": "xkeyboard-config 2.16-1 added a chromebook model that enables the Chrome OS style functions for the function keys. You can, for example, set this using localectl set-x11-keymap us chromebook. See the chromebook definition in /usr/share/X11/xkb/symbols/inet for the full mappings.\n\nThe search button acts as a Super_L key, which may be undesirable for keyboard layouts that make good use of this position. Using xmodmap, you can rebind this to whatever you would like. Example using Tab for a keyboard layout with six layers:\n\n```\n$ xmodmap -e \"keycode 133 = Tab Tab Tab Tab Tab Tab\"\n```\n\nAdd this to your .xinitrc to load at login.\n\n"
    },
    {
      "title": "Unresolved Issues",
      "level": 2,
      "content": "- xkeyboard-config provides a chromebook model which can be specified, for example, with localectl set-x11-keymap us chromebook but when using GNOME on Wayland the model is not recognized. The media keys still behave as function keys and setxkbmap -print -verbose 10 does not show the chromebook model being used.\n- Touchpad occasionally does not work after waking from sleep using linux 4.9-1+. If this happens, reloading the touchpad driver via # modprobe -r atmel_mxt_ts && modprobe atmel_mxt_ts usually restores touchpad functionality. This fix is also available as enable-touch from samus-scriptsAUR.\n\n```\n# modprobe -r atmel_mxt_ts && modprobe atmel_mxt_ts\n```\n\n"
    },
    {
      "title": "See Also",
      "level": 2,
      "content": "- Laptop Issues » Google Chromebook Pixel 2\n- Chromium OS Developer Information for Chromebook Pixel (2015)[dead link 2024-07-30 ⓘ]\n- tpm bug: systemctl suspend turns off computer\n\n"
    }
  ]
}