{
  "title": "Clevo P650RS",
  "url": "https://wiki.archlinux.org/title/Clevo_P650RS",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThe P650RS is a device by the Taiwanese OEM manufacturer Clevo. It is also sold as Sager NP8153-S and many other names. The hardware is configurable and includes an Intel Skylake Core i7, NVIDIA 1070M graphics, USB-C connectors, a fingerprint reader, mini DisplayPort as well as HDMI connections, and more.\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "The Clevo is available in switchable, and non-switchable configurations. In configurations with both integrated and discrete GPUs, the BIOS includes an an option (MSHYBRID) to disable the integrated card, rendering it the same as the dedicated GPU model.\n\n"
    },
    {
      "title": "Discrete only",
      "level": 3,
      "content": "Given this laptop has a mux, it does not require PRIME configuration to make use of the dedicated graphics card in full even though it should be possible. Installation should follow NVIDIA after setting and booting with DISCRETE BIOS option.\n\nUsing the NVIDIA proprietary driver (testing with 375.20) the backlight may not come back on after the display has gone to sleep. A workaround is to drop to console (e.g. Ctrl-Alt-F2) and then back to X.\n\n"
    },
    {
      "title": "Switchable / Optimus",
      "level": 3,
      "content": "Xorg may not work out of the box with a no screens found error.\n\nXorg selects the dGPU when in fact it is the integrated one that has the control of the screen. This is probably an issue only fixable with a BIOS update (testing against v1.05.03, it will not work).\n\nTo overcome this a xorg configuration file needs to be created telling xorg the correct address and driver combination. This can be done by creating (or adding the line with BusID in:\n\n```\n/etc/X11/xorg.conf.d/20-intel.conf\n```\n\n```\nSection \"Device\"\n        Identifier \"Intel Graphics\"\n        Driver     \"intel\"\n        BusID      \"PCI:x:x:x\"    # <<<< replace with correct address\nEndSection\n```\n\nDetails and further advice can be found in pages Intel graphics and Xorg.\n\nThis will yield a working setup, but the dGPU will not be useable at all and will still be on and consuming quite a lot of energy.\n\nTo enable the use of the dedicated graphics card see Bumblebee.\n\nAll DisplayPort and HDMI ports seem to be connected to the dGPU which involves extra steps to get them working.\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "Using switchable graphics and standard TLP configuration, this laptop should manage ~10-14W of static load. YMMV of course.\n\nThe dGPU cannot be turned off automatically as a function of being in use at this moment though (see #Switchable / Optimus). If left on, the system will take >20W on idle though.\n\n"
    },
    {
      "title": "Keyboard Backlight",
      "level": 2,
      "content": "For the white keyboard backlight, no special actions are required. However the RGB-backlit keyboard will not work out of the box.\n\nTo enable the Keyboard, the installation of the clevo-xsm-wmiAUR package is required.\n\nThe colors of the three sections can be controlled, after loading the kernel module, the special keys on the keyboard (Fn++, Fn+-, Fn+*, Fn+/) should work.\n\n"
    },
    {
      "title": "Wi-Fi",
      "level": 2,
      "content": "Wi-Fi seems to work well and coexist nicely with Bluetooth. Consider enabling antenna aggregation to take the most out of the hardware: iwlwifi.\n\nWhen using the clevo-xsm-wmiAUR package, the Fn+F11 combination to toggle air plane mode also works.\n\n"
    },
    {
      "title": "Webcam",
      "level": 2,
      "content": "As with the Clevo W840SU the webcam must be activated with Fn-F10 before it will show up in the device list. This survives a reboot.\n\n"
    }
  ]
}