{
  "title": "DANE",
  "url": "https://wiki.archlinux.org/title/DANE",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "DANE (DNS-based Authentication of Named Entities) is a protocol to allow X.509 certificates, commonly used for Transport Layer Security (TLS), to be bound to DNS names using Domain Name System Security Extensions (DNSSEC).\n\n"
    },
    {
      "title": "Resource record",
      "level": 2,
      "content": "TLSA resource record is an own type of DNS record. It consists of port number and protocol of the service secured by it. An example record for port 25 over tcp could look like _25._tcp.example.com IN TLSA 3 0 1 $DATA. The TLSA parameters 3 0 1 are explaining the data following it. The first number is the Certificate Usage Field, the second is the Selector Field and the third is named Matching Type Field.\n\nTable content:\nValue | Name | Description\n0 | PKIX trust anchor | Hash contains a public CA from the x509 tree by which your cert has to be signed\n1 | PKIX end entity | Hash contains your cert which also has to pass x509 validation\n2 | DANE trust anchor | Hash contains a private CA (unknown to the x509 tree) by which your cert has to be signed\n3 | DANE end entity | Hash contains your cert which is not matched against any other validation\n\nTable content:\nValue | Name | Description\n0 | cert | DATA is based on the full cert\n1 | SPKI | DATA is based on public key only\n\nTable content:\nValue | Name | Description\n0 | Full | DATA is the full cert or SPKI\n1 | sha256 | DATA is the sha256 hash of the cert or SPKI\n2 | sha512 | DATA is the sha512 hash of the cert or SPKI\n\nThe RR can also easily be generated with ldns-dane from ldns.\n\n"
    },
    {
      "title": "DANE supporting software",
      "level": 2,
      "content": "- Postfix\n- Exim > 4.85\n- Prosody (via prosody-mod-s2s-auth-daneAUR)\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- DANE Validator\n- Common implementation mistakes\n- Generate TLSA records online\n\n"
    }
  ]
}