{
  "title": "Database download",
  "url": "https://wiki.archlinux.org/title/Database_download",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Help:Reading\n\nThe official MediaWiki instance of the ArchWiki can be accessed online at https://wiki.archlinux.org with any web browser.\n\nNote that some translations are hosted externally under different domain names; see Help:i18n#Languages.\n\n"
    },
    {
      "title": "Searching",
      "level": 2,
      "content": "MediaWiki supports full text search; see the search box at the top of the page. The limitations of this feature is that it indexes only words longer than 3 characters. If you want to search for shorter words (1 to 3 characters), a known workaround is to use Google's sitesearch feature. Enter your search items in the form and it will automatically search within ArchWiki.\n\nOf course, you can do the same manually by appending site:wiki.archlinux.org to Google searches:\n\n```\nyour search terms site:wiki.archlinux.org\n```\n\nThis works fine, but it is not live. Google indexes the ArchWiki every 1 to 3 days.\n\n"
    },
    {
      "title": "How it works",
      "level": 3,
      "content": "- The article content is searched in its raw (wikitext) form - i.e., it searches the text that appears in the edit box when you click \"edit\", not the rendered page. This means that content coming from an included template will not be picked up, but the target of piped links will be. This also means that the \"#redirect\" directives will be searched as well so for redirected pages, they will be listed twice together with their redirects.\n- The search functionality can be considered to operate on whole words, separated by spaces or other punctuation marks. So if your search term includes the word 'book', the results will not include pages that only have the word 'books' or 'booklet'. And if your search term includes the term 'inter', the results will not include pages that only have the word 'international', but they may include pages that have the term 'inter-national'.\n- You can search for all words that begin with a prefix by adding * at the end of a word in your query. For example, book* will return results for book and books.\n- You can search for a phrase using double quotes. A phrase can be considered to consist of whole words, so the phrase 'Arch Linux' will not be found by a search for \"ch Lin\", but it will be found by a search for \"Arch Linux\".\n\nFor more information see Mediawikiwiki:Help:Searching.\n\n"
    },
    {
      "title": "Search engine bangs",
      "level": 3,
      "content": "Many search engines like Searx, DuckDuckGo, and others offer \"search bang\" feature to directly search the ArchWiki. After adding a supporting search engine as the default search engine of your web browser, you can directly type a query like this in your URL bar:\n\n```\n!archwiki your search terms\n```\n\nor, shorter\n\n```\n!aw your search terms\n```\n\n"
    },
    {
      "title": "Search engine shortcuts for Chromium-based browsers",
      "level": 3,
      "content": "1. Type in chrome://settings/searchEngines into the address bar. Click on \"Add\" under \"Site search\". Change chrome:// to your browser accordingly.\n1. In the \"Search engines\" field, name this entry, e.g. \"ArchWiki\".\n1. In the \"Shortcut\" field, type the text that will trigger this search engine in the address bar e.g. !aw\n1. In the \"URL with %s in place of query\" field enter https://wiki.archlinux.org/title/Special:Search/%s as the URL.\n1. Click the \"Add\" button. The address bar shortcut is now active.\n\n"
    },
    {
      "title": "Finding related articles",
      "level": 2,
      "content": "Every article on the ArchWiki is categorized. The categories of a page are displayed at the top. For example, this page is categorized with Category:Help. You can view the category hierarchy at the Table of contents.\n\nAdditionally, many articles directly link to related articles with a Related articles box at the top of the article.\n\n"
    },
    {
      "title": "Offline viewing",
      "level": 2,
      "content": "Arch Wiki can be downloaded for convenient offline use.\n\n"
    },
    {
      "title": "Packages",
      "level": 3,
      "content": "- arch-wiki-docs — Pages from ArchWiki optimized for offline browsing.\n\n- arch-wiki-lite — Arch-wiki-lite is designed to offer the smoothest possible experience for the poor person stuck without internet access or any way of starting a graphical web browser.\n\n- arch-wiki-man — The ArchWiki easily accessible and searchable as man pages.\n\n- wikiman — Offline search engine for manual pages, Arch Wiki, Gentoo Wiki and other documentation.\n\n- archwiki-offline — Simple script for offline Arch Wiki experience with preferred listing menus, enabling seamless offline page access.\n\n"
    },
    {
      "title": "Alternative",
      "level": 3,
      "content": "kiwix-desktop-gitAUR allow browsing the compressed zim format. The ArchWiki zim file can be downloaded from https://library.kiwix.org.\n\n"
    },
    {
      "title": "Alternative online viewers",
      "level": 2,
      "content": "- Wikicurses — A simple curses interface for MediaWiki sites such as ArchWiki or Wikipedia.\n\n"
    }
  ]
}