{
  "title": "Dell Latitude 7370",
  "url": "https://wiki.archlinux.org/title/Dell_Latitude_7370",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThese laptops are a part of the Latitude 13 7000 Series featuring Intel Skylake [1]. This series does have some relation to the Dell XPS 13 (2016) for general reference.\n\n"
    },
    {
      "title": "Dock",
      "level": 2,
      "content": "The TB15 Thunderbolt dock is no longer supported by DELL, and is no longer being sold [2]. The TB15 thunderbolt dock is still a work-in-progress for support, but the use of it is anecdotal [3][dead link 2023-09-16 ⓘ]. It seems to currently work best when plugged in before booting and avoiding any form of hot-plugging [4].\n\nThe TB15 has been replaced by the TB16 [5].\n\nAlternative, the WD15 seems to work as an alternative docking station [6].\n\n"
    },
    {
      "title": "Updating BIOS",
      "level": 2,
      "content": "Download the BIOS update from the DELL website and place it either at the root of a FAT-formatted USB disk, or within /boot on the hard drive (if using EFI). Reboot and hit F12 during startup, selecting \"BIOS Flash Update\". The simple file browser should see the executable, select it and allow the update to occur.\n\n"
    },
    {
      "title": "Card reader",
      "level": 2,
      "content": "The Broadcom reader \"should work\" via ccid and pcsclite, but requires an firmware/BIOS update that must be run in Windows [7][dead link 2023-04-23 ⓘ].\n\nSupporting documentation regarding the card reader: [8] [9].\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "There is a known issue where the touchpad is detected as \"ImPS/2 BYD TouchPad\", a patch is in the works [10].\n\n"
    },
    {
      "title": "Display",
      "level": 2,
      "content": "Due to being HiDPI it is also common to notice latency when using desktop environments like GNOME. Installing vulkan-intel appears to alleviate some of these issues.\n\n"
    },
    {
      "title": "DisplayLink",
      "level": 2,
      "content": "In order to connect to external projectors using an external dongle, you will need to configure DisplayLink.\n\n"
    },
    {
      "title": "Known issues",
      "level": 2,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\n"
    },
    {
      "title": "Suspend",
      "level": 3,
      "content": "It appears the system can get into a state in which suspend will stop working (system will suspend but upon attempt to resume will cold boot)[11]. Current resolution appears to be to perform a shutdown within the system and suspend should start working again. Newer BIOS versions also have improved this issue, though it can still occur.\n\n"
    },
    {
      "title": "No keyboard",
      "level": 3,
      "content": "It appears that on linux-mainlineAUR the system will boot without a keyboard. This can be resolved by adding i8042 to the MODULES array in mkinitcpio.conf.\n\n"
    }
  ]
}