{
  "title": "Dell Latitude 7490",
  "url": "https://wiki.archlinux.org/title/Dell_Latitude_7490",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU | 8086:5917 | Yes\nWebcam | 0bda:568c | Yes\nEthernet | 8086:15d7 | Yes\nBluetooth | 168c:003e | Yes\nSD-card reader | 10ec:525a | Yes\nAudio | 8086:9d71 | Yes\nWi-Fi | 168c:003e | Yes\nTPM |  | Untested\n\nThe Latitude 7490 is virtually identical to the Dell Latitude 7480 with the exception of an upgrade to Kabylake-R processors (8th gen).\n\n"
    },
    {
      "title": "What works",
      "level": 2,
      "content": "- Basic hardware (display, touchpad, trackpoint, keyboard, Wi-Fi, Ethernet, Bluetooth, audio, hibernation, etc.)\n- Keyboard backlight control\n- Screen backlight control\n- Fn/Hotkeys, including Fn-lock\n- Contact SmartCard reader\n- Qualcomm Snapdragon X7 LTE Modem\n- USB-C (connected to Android phone, was able to charge phone and read files)\n- USB-C power delivery\n- DisplayPort Alternate Mode for USB-C\n- USB-C Display port with D6000 docking station (triple screen with dual 4k works) + power delivery\n- Thunderbolt 3.0 (shows up in gnome-settings, works with Dell TB16 dock (Ethernet, DisplayPort @120hz, USB, power delivery, etc))\n\n"
    },
    {
      "title": "What does not work",
      "level": 2,
      "content": "- Fingerprint reader (tracked at https://gitlab.freedesktop.org/libfprint/libfprint/issues/88)\n- Presumably NFC\n\n"
    },
    {
      "title": "What was not tested",
      "level": 2,
      "content": "- Contactless SmartCard (probably works since it was detected by pcsc_scan\n- TPM 2.0 (There is an error in the output of dmesg, tpm tpm0: A TPM error (2314) occurred attempting the self test)\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Enables Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | Mute Microphone\nFn+F5 | Yes | Yes | Num Lock\nFn+F6 | Yes | Yes | Scroll Lock\nFn+F7 | No | No | Unobtrusive mode\nFn+F8 | Yes | Yes | Inputs Super+p\nFn+F9 | Yes | Yes | XF86Search\nFn+F10 | No | Yes | Enables/disables keyboard backlight\nFn+F11 | Yes | Yes | XF86MonBrightnessDown\nFn+F12 | Yes | Yes | XF86MonBrightnessUp\nFn+Print | Yes3 | Yes | XF86RFKill, will hard-block Wi-Fi and soft-block Bluetooth. Press again to disable\nFn+Ins | Yes3 | No | XF86Sleep\n\n1. The key is visible to xev and similar tools\n1. The physical key has a symbol on it, which describes its function\n1. systemd-logind handles this by default\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "Do not set control to auto for Bluetooth module (0cf3:e007), otherwise sound via Bluetooth headset may tear when Wi-Fi is actively used. If you have TLP, set USB_EXCLUDE_BTUSB to 1.\n\nIt helps in some cases, but with some devices (e.g. CMF Buds Pro) none of any troubleshooting tips helped. Sound is choppy and unstable all the time.\n\nBetter solution might be replacing Wi-Fi card, for example Intel Wi-Fi. Unlike thinkpads there is no device whitelist, so there will no difficulties with replacing network card.\n\n"
    },
    {
      "title": "BIOS Settings Overview",
      "level": 3,
      "content": "The \"BIOS Settings\" interface can be reached by pressing F2 during POST.\n\nThe BIOS settings page itself is GUI based, with black text on a white background. There is a panel taking approximately 20% of the screen on the left, containing various sub-categories of settings. The main panel takes 80% of the screen to the right, and contains the settings associated with each sub-category. The font is relatively large, and toggle switches will appear as light grey if set to 'off', and turn light blue if set to 'on'.\n\nThe GUI does not have any built-in screen reader or other accessibility settings, but due to its simple colour scheme, and relatively large text size, it should be somewhat accessible for partially sighted people using an external screen reader as an accessibility aid. However, it is a GUI-based interface with lots of available settings, and lots of visual clutter in text form. As such it is likely to be difficult to navigate for people with severe visual impairment or total blindness, who are using an external reader alone. It is possible to enable/disable \"Help Text\", and \"Advanced Setup\" using two toggle switches that appear in the top left corner of the screen; disabling them should help reduce this clutter and improve readability (but may also hide useful info/settings!).\n\nThere are \"Show all\" and \"Search\" functions available towards the top right of the screen, which can ease navigation considerably.\n\nThe BIOS can be updated through the \"One-Time Boot Menu\" (press F12 during POST).\n\n"
    },
    {
      "title": "BIOS Settings Navigation",
      "level": 3,
      "content": "The \"BIOS Settings\" interface can be navigated using a keyboard, or mouse - with mouse being the preferred mode. Keyboard navigation keys are as follows:\n\nTable content:\nKey | Effect\nUp | Moves to the previous field.\nDown | Moves to the next field.\nEnter | Selects a value in the selected field (if applicable) or follow the link in the field.\nSpace | Expands or collapses a drop-down list, if applicable.\nTab | Moves to the next focus area\nPageUp | Scrolls the currently selected view up.\nPageDown | Scrolls the currently selected view down.\nEsc | Moves to the previous page until you view the main screen. Pressing Esc in the main screen displays a message that prompts you to save any unsaved changes and restarts the system.\n\n"
    }
  ]
}