{
  "title": "Dell XPS 17 (9700)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_17_(9700)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) | 8086:9bc4 | Yes\nGPU (NVIDIA) | 10de:1f95 | Yes\nWi-Fi | 8086:06F0 | Yes\nBluetooth | 8087:0026 | Partial\nAudio | 8086:06c8 | Yes\nTouchpad | 04f3:311c | Yes\nWebcam | 0bda:5510 | Yes\nInfrared emitters |  | Yes\nAmbient light sensor | Unknown | Yes\nFingerprint sensor | 27c6:533c | Yes\nSD card reader | 10ec:5260 | Yes\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Before installing it is necessary to modify some UEFI Settings. They can be accessed by pressing the F12 key repeatedly when booting.\n\n- Change the SATA Mode from the default \"RAID\" to \"AHCI\". This will allow Linux to detect the NVMe SSD.\n- Disable Secure Boot to allow Linux to boot. This may be re-enabled at a later point. See Secure Boot#Using a signed boot loader\n- Disable Early Logo Display under Pre-boot Behaviour. This allows S1 sleep to function, as well as S3 sleep on some models. See #Power Management.\n\n"
    },
    {
      "title": "Dual Boot",
      "level": 3,
      "content": "Please note that changing from \"RAID\" to \"AHCI\" will break the default Windows installation and require a complete reinstall. The reinstall can be done through the Dell recovery in the BIOS.\n\nOnce reinstalled, Windows should boot normally in AHCI mode and without error. Then one can proceed with typical dual boot setup.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Dell provides firmware updates that can be installed automatically using fwupd (or one of its graphical frontends such as Gnome Software or KDE Discover).\n\nAlternatively, firmware updates can also be installed manually by downloading them from the support page and placing the .exe file on a FAT32 drive or the EFI system partition, then selecting the file in the BIOS update page after pressing F12 at boot time.\n\nIt is possible to install custom Secure Boot root keys in the BIOS and use them for Secure Boot with Linux.\n\n"
    },
    {
      "title": "Sleep",
      "level": 3,
      "content": "Like many modern laptops, traditional S1/S3 states are not supported and have been replaced by \"Modern Standby\". The ACPI configuration causes the system to suspend to idle by default s2idle which allows the CPU to dynamically enter power saving states. In order for the system to maintain residency in the lower sleep states, the SATA mode may need to be set to \"ACHI\" instead of the default \"RAID\". For models configured with a 2060 series NVIDIA GPU, the proprietary NVIDIA driver may yield lower power usage in sleep states since power management is not supported for the nouveau driver as of the time of writing.\n\nIf the system seems to have a high power usage when idling, see Power management/Suspend and hibernate#Changing suspend method. As of the time of writing, S3 sleep mode does not seem to work for models with NVIDIA GPUs when on battery power. Users of variants with no dedicated GPU report S3 sleep to be working.\n\n"
    },
    {
      "title": "Hibernation",
      "level": 3,
      "content": "For hibernation to work, you must turn off \"SMM Security Mitigation\" under Security in the BIOS setup. Otherwise the system may freeze when attempting to hibernate.\n\n"
    },
    {
      "title": "GPU",
      "level": 2,
      "content": "Using the integrated intel iGPU instead of the dedicated GPU can provide power savings. There are various methods for utilising NVIDIA Optimus, however using PRIME#PRIME render offload seems to have the best performance on the 9700.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "Bluetooth works out of the box, but sometimes tends to get stuck in a turned off mode after boot or after manually turning it off. Sometimes, this can be fixed by a simple restart of bluetooth.service, but frequently the only fix is to shut down the laptop and start it again.\n\n"
    },
    {
      "title": "Intel Killer AX1650s (i5 / i7 CPU models)",
      "level": 3,
      "content": "**Not sure if this is needed anymore... Test your Wi-Fi thoroughly before modifying this parameter. This may increase stability but reduce speeds.**\n\nWi-Fi may prompt you repeatedly for the Wi-Fi network password when connecting to a 5Ghz network. This has to do with the poor support of the 11n protocol. You can instruct the iwlwifi driver to not use the 11n protocol with its module parameters:\n\n```\n/etc/modprobe.d/iwlwifi-opt.conf\n```\n\n```\noptions iwlwifi 11n_disable=8\n```\n\nMore information on this problem can be found here: Network configuration/Wireless#iwlwifi and https://cachestocaches.com/2016/1/disabling-ubuntus-broken-wi-fi-driver/\n\n"
    },
    {
      "title": "Qualcomm Killer AX500s DBS (i9 CPU models)",
      "level": 3,
      "content": "Occasionally after turning Wi-Fi off, attempting to turn it back on will fail and the only fix seems to be a full reboot of the device. Sometimes removing and reinserting the driver kernel module `ath11k_pci` also works.\n\n"
    },
    {
      "title": "Fingerprint sensor",
      "level": 2,
      "content": "The fingerprint sensor can be used by installing the proprietary Ubuntu driver released by Dell and Goodix. This requires a different fork of libfprint libfprint-tod-gitAUR - available on the AUR and built from source from the upstream repo. This is a newer version intended for use only with touch-based sensors such as the one on the XPS.\n\nThe proprietary driver can be obtained from the AUR: libfprint-2-tod1-xps9300-binAUR. Alternatively, it can also be manually installed from the Dell repository by extracting the debian file and copying its contents.\n\nThe rest of the process is identical as that described on Fprint - just make sure not to install the version of libfprint on the main repo as it conflicts with libfprint-tod\n\n"
    },
    {
      "title": "Thunderbolt",
      "level": 2,
      "content": "The following thunderbolt devices have been tested:\n\nTable content:\nDevice | Working? | Comments\nDell WD19TB 130W | Yes | Dual 4k through USB-c does not work, dual 4k using the thunderbolt upstream port is temperamental\nDell TB16[dead link 2023-04-23 ⓘ] | Yes | –\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "This laptop requires Sound Open Firmware for the internal sound card to work.\n\n"
    },
    {
      "title": "Fan control",
      "level": 2,
      "content": "By default, fans are controlled by BIOS. Unfortunately even \"Quiet\" preset keeps fans spinning most of the time.\n\nTo change it, i8kmon from i8kutilsAUR can be used.\n\nDetails: Fan speed control#Dell laptops\n\n"
    },
    {
      "title": "BIOS Thermal Modes / Fan profiles",
      "level": 3,
      "content": "If you still decided to go with bios-driven fan control, you can switch thermal profiles like in Dell Power Manager from Windows. This is done within a terminal with the libsmbios package, or alternatively via plasma5-applets-plasma-pstateAUR[broken link: package not found]:\n\nTo find out what thermal mode is set type:\n\n```\n# smbios-thermal-ctl -g\n```\n\nTo find all available thermal modes type:\n\n```\n# smbios-thermal-ctl -i\n```\n\nAnd finally to set the desired thermal mode that you identified with the command before type:\n\n```\n# smbios-thermal-ctl --set-thermal-mode=THERMAL_MODE\n```\n\n- \"Quiet\" and \"Cool Bottom\" profiles limit CPU power to 11W (18W boost) and thus reduces overall system performance.\n- \"Balanced\" and \"Performance\" profiles remove this limit.\n- Thermal profile changes may not reliably alter the CPU power limit. When connected via Thunderbolt dock it appears to be worse.\n- In some circumstances after booting (particularly with \"Quiet\" profile), power may be limited to 10W.\n- Disconnecting and reconnecting power, changing thermal profile, or simply waiting may resolve these issues.\n\n"
    }
  ]
}