{
  "title": "Dell XPS 13 Plus (9320)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_13_Plus_(9320)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad | 04F3:31D1 | Yes\nKeyboard | 0001:0001 | Yes\nGPU | 8086:46a6 | Yes\nWebcam |  | No\nBluetooth | 8087:0033 | Yes\nAudio | 8086:51c8 | Yes\nWireless | 8086:51f0 | Yes\nFingerprint reader | 27c6:63bc | Yes\nTPM |  | Yes\n\n"
    },
    {
      "title": "Kernel selection",
      "level": 4,
      "content": "As of 4th Oct 2022, the linux-lts kernel (5.15.71-1-lts) seems to cause a few problems, including graphical glitches and crashes under gnome/wayland, amongst other things.\n\nIt is recommended to use linux kernel (> 5.18.14-arch1).\n\n"
    },
    {
      "title": "Cannot enter S0ix causing high power usage",
      "level": 4,
      "content": "As of 11th August 2022, there is a kernel bug in Intel VMD blocking CPU entering S0ix. This can be work around by switching from VMD to AHCI in BIOS settings. The S0ix residency can be verified by following Intel's guide.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "Audio (both speakers and microphone) works out of the box with Sound Open Firmware.\n\nIf you have added the i915 module to your /etc/mkinitcpio.conf file as a module to load early, you must also add audio modules and related files to the same configuration file, with the hooks and files section to read as follows:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nMODULES=(snd_soc_rt715_sdca snd_soc_rt1316_sdw snd_sof_pci_intel_tgl snd_hda_intel snd_soc_sof_sdw i915)\nFILES=(/lib/firmware/intel/sof/sof-adl.ri /lib/firmware/intel/sof-tplg/sof-adl-rt1316-l12-rt714-l0.tplg)\n```\n\n"
    },
    {
      "title": "Disks",
      "level": 3,
      "content": "Disks are recognized in RAID mode and in AHCI mode.\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 3,
      "content": "The fingerprint sensor setup and configuration process is identical as that described on Fprint. No special binaries or AUR packages are required to configure the fingerprint sensor.\n\n"
    },
    {
      "title": "Webcam",
      "level": 3,
      "content": "Works, but with proprietary userland, and workarounds needed to make use of it as a webcam in browsers. Some effort to get it working was listed here.\n\nRequired drivers can be found under intel-ipu6-dkms-gitAUR and intel-ipu6ep-camera-hal-gitAUR.\n\nAnother option would be using a collection of scripts and PKGBUILDs that should install everything needed for the webcam to work, which can be found as here.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Dell provides firmware updates that can be installed automatically using fwupd.\n\nIt is possible to install custom Secure Boot root keys in the BIOS and use them for Secure Boot with Linux.\n\n"
    },
    {
      "title": "Function Keys",
      "level": 2,
      "content": "The function keys is a backlit capacitive touch panel on this laptop model - a touchbar where you, by pressing the Fn key, can switch between either the traditional F1-F12 row, or a function key row. The default mode can be selected in the BIOS.\n\nTable content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Toggles Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86AudioMicMute\nFn+F5 | Yes | Yes | XF86AudioPlay\nFn+F6 | Yes | Yes | Toggle Keyboard Backlight Brightness 0%/50%/100%\nFn+F7 | Yes | Yes | XF86MonBrightnessDown\nFn+F8 | Yes | Yes | XF86MonBrightnessUp\nFn+F9 | Yes | Yes | Super+P3\nFn+F10 | Yes | Yes | PrintScreen\nFn+F11 | Yes | Yes | Home\nFn+F12 | Yes | Yes | End\nFn+F134 | Yes | Yes | Ins\nFn+Up | Yes | Yes | PageUp\nFn+Down | Yes | Yes | PageDown\nFn+Left | Yes | No | Home\nFn+Right | Yes | No | End\nFn+Ctrl | Yes | Yes | XF86MenuKB\nFn+B | Yes | No | Pause\nFn+S | Yes | No | Scroll Lock\nFn+R | Yes | No | SysRq\nFn+Ctrl+B | Yes | No | Break\n\n1. The key is visible to xev and similar tools.\n1. The physical key has a symbol on it, which describes its function.\n1. This appears to correspond to XF86Display?\n1. Ins appears in the space between F12 and Del; there is no alternate key.\n\n"
    },
    {
      "title": "Backlight",
      "level": 3,
      "content": "The backlight level of the touchbar is not controllable from software - it is set by the light sensor hardware built-in to the laptop. If you think the backlight level is too severe, you can force it to stay in the lowest setting by blacklisting the kernel modules responsible for initializing the backlight sensor:\n\n```\n$ cat /etc/modprobe.d/touchbar.conf\nblacklist intel_ishtp_hid\nblacklist intel_ishtp\nblacklist intel_ish_ipc\n```\n\n"
    },
    {
      "title": "BIOS Settings Overview",
      "level": 3,
      "content": "The \"BIOS Settings\" interface can be reached by pressing F2 during POST.\n\nThe BIOS settings page itself is GUI based, with black text on a white background. There is a panel taking approximately 20% of the screen on the left, containing various sub-categories of settings. The main panel takes 80% of the screen to the right, and contains the settings associated with each sub-category. The font is relatively large, and toggle switches will appear as light grey if set to 'off', and turn light blue if set to 'on'.\n\nThe GUI does not have any built-in screen reader or other accessibility settings, but due to its simple colour scheme, and relatively large text size, it should be somewhat accessible for partially sighted people using an external screen reader as an accessibility aid. However, it is a GUI-based interface with lots of available settings, and lots of visual clutter in text form. As such it is likely to be difficult to navigate for people with severe visual impairment or total blindness, who are using an external reader alone. It is possible to enable/disable \"Help Text\", and \"Advanced Setup\" using two toggle switches that appear in the top left corner of the screen; disabling them should help reduce this clutter and improve readability (but may also hide useful info/settings!).\n\nThere are \"Show all\" and \"Search\" functions available towards the top right of the screen, which can ease navigation considerably.\n\nThe BIOS can be updated through the \"One-Time Boot Menu\" (press F12 during POST).\n\n"
    },
    {
      "title": "BIOS Settings Navigation",
      "level": 3,
      "content": "The \"BIOS Settings\" interface can be navigated using a keyboard, or mouse - with mouse being the preferred mode. Keyboard navigation keys are as follows:\n\nTable content:\nKey | Effect\nUp | Moves to the previous field.\nDown | Moves to the next field.\nEnter | Selects a value in the selected field (if applicable) or follow the link in the field.\nSpace | Expands or collapses a drop-down list, if applicable.\nTab | Moves to the next focus area\nPageUp | Scrolls the currently selected view up.\nPageDown | Scrolls the currently selected view down.\nEsc | Moves to the previous page until you view the main screen. Pressing Esc in the main screen displays a message that prompts you to save any unsaved changes and restarts the system.\n\n"
    },
    {
      "title": "Diagnostics",
      "level": 2,
      "content": "Pressing F12 during POST starts the \"One-Time Boot Menu\" (if enabled in BIOS). There the diagnostic option can be found, which offers various thorough on-board tests.\n\nIf d is held while powering on, the \"Display panel built-in self-test\" (LCD-BIST) is initiated. The screen will cycle three times through solid colors before powering off again. This can be used to make sure all colors are displayed correctly without distortions and no dead pixels are present.\n\nThe \"Service LED\" is located just above the F6 and F7 function keys. It can emit white and amber light. Usually it shows the current power and battery state, but blinking can indicate an issue with the computer has been detected. Diagnostic codes for the blinking pattern can be found in the official service manual linked at the end of this article.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Setup and specifications guide: https://dl.dell.com/content/manual4700340-xps-13-plus-9320-xps-9320-setup-and-specifications.pdf\n- Official service manual: https://dl.dell.com/content/manual6046015-xps-13-plus-9320-xps-9320-service-manual.pdf\n\n"
    }
  ]
}