{
  "title": "Dell Inspiron 13 (5378)",
  "url": "https://wiki.archlinux.org/title/Dell_Inspiron_13_(5378)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU | 8086:5916 | Yes\nWireless | 0cf3:e007 | Yes\nBluetooth | 0cf3:e007 | Yes\nAudio | 8086:9d71 | Yes\nTouchpad | 0740:0006CB | Yes\nTouchscreen | 04f3:2494 | Yes\nWebcam | 0bda:58c2 | Yes\nInfrared Camera | Unknown | No\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Nearly everything works out of the box when the Installation guide is followed.\n\nIf the laptop cannot boot the Arch Linux installation medium, USB boot could be disabled; this can be fixed using the Enable Boot Support option under System Configuration/USB Configuration in the firmware. See #Firmware.\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "The Intel integrated graphics work well with the mesa OpenGL driver. Install mesa and, if desired, mesa-utils.\n\nThe i915 driver built into the kernel is reliable. The i915 kernel module should be loaded automatically as long as nomodeset is not set as a kernel parameter. See Intel graphics#Loading.\n\nThe Intel Vulkan drivers may cause issues with display managers such as lightdm or sddm if these are running in X: sometimes the machine will boot to a black screen with magenta stripes. These issues can be fixed by reverting to the i915 driver.\n\n"
    },
    {
      "title": "Touchscreen",
      "level": 2,
      "content": "The touchscreen works out of the box. See Tablet PC and Touchscreen for information on getting the most from your touchscreen.\n\n"
    },
    {
      "title": "Infrared camera",
      "level": 2,
      "content": "The Realtek infrared camera is optional and is not present in all Inspiron 13 (5378) models. It can be used for facial recognition software such as howdyAUR.\n\nHowdy has been tested and works on the Dell Inspiron 5379, which has the same IR camera model as the 5378.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The firmware is graphical and has a tightly-packed simple text menu (with expandable categories) on the left, with fairly small text. All the settable options are in a large pane on the right, again. Apply must be clicked to make any changes. Note that the touch screen and the touchpad work in the firmware, and the tabulation and arrow keys also allow cursoring around the different options and buttons. The Tab key alternates between three zones: the menu at the left, the settings pane at the right, and the Apply, Restore Settings, and Exit buttons. The arrow keys must then be used to cursor around the items within each of those zones.\n\nThe firmware contains many radio buttons and check boxes, but these are only in the right pane.\n\nAs of version 371, the UEFI firmware does not have a \"simple\" or \"classic\" switch that can be turned on.\n\nThe boot menu is simple text (not graphical) against a black background.\n\nSee the #Firmware section below for instructions to access the firmware.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "UEFI firmware and other device firmware is available through the Linux Vendor Firmware Service (LVFS), and can be installed using fwupd.\n\nThe boot menu can be accessed by pressing (spamming) F12 at boot, when the Dell logo first appears. This will bring up a text-only boot menu which will contains two headings (unless legacy/BIOS boot devices are available): UEFI Boot and Other Options. No keys need to be pressed to switch between headings. The BIOS Setup entry at the bottom. Cursor to this using the arrow keys and hit Enter to select it.\n\nThe firmware can be accessed directly by pressing (spamming) F2 at boot, when the Dell logo first appears. A message, Entering Setup, should appear when the system acknowledges the F2 keypress.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible? | Marked? | Effect\nFn+Esc | No | Yes | Toggles Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86AudioPrev\nFn+F5 | Yes | Yes | XF86AudioPlay\nFn+F6 | Yes | Yes | XF86AudioNext\nFn+F7 | No | No | None\nFn+F8 | Yes | Yes | Presses Super+P\nFn+F9 | Yes | Yes | XF86Search\nFn+F10 | No | Yes | Toggles keyboard backlight\nFn+F11 | Yes | Yes | XF86MonBrightnessDown\nFn+F12 | Yes | Yes | XF86MonBrightnessUp\nFn+PrtScr | Yes | Yes | XF86RFKill\nFn+Up | No | Yes | PgUp\nFn+Down | No | Yes | PgDn\nFn+Left | No | Yes | Home\nFn+Right | No | Yes | End\nFn+Ctrl (Right) | No | Yes | Menu\n\n"
    },
    {
      "title": "Fan control",
      "level": 2,
      "content": "The default fan settings allow the CPU to reach 70-85 °C before the fan speeds up. To make the laptop to run cooler, use i8kutilsAUR to manually set the fan start temperature. The BIOS seems to override fan control by default, so install dell-bios-fan-control-gitAUR to give control of the fan to the OS. Note that manually setting the fan profile has a drawback of not letting the fan reach full speed (6000 RPM BIOS control, 5000 RPM manual) since Dell did not publish documentation for the fan.\n\nThis model only has one fan, and it is identified as the right fan. Setting the left fan speed has no effect. A working fan profile using dell-bios-fan-control-gitAUR will look something like this:\n\n```\nset config(0)   {{- 0}  -1  50  -1  50}\nset config(1)   {{- 1}  45  65  45  65}\nset config(2)   {{- 2}  60  75  60  75}\nset config(3)   {{- 2}  70 128  70 128}\n```\n\nSee Fan speed control#Dell laptops for more information.\n\n"
    }
  ]
}