{
  "title": "Dell XPS 13 (2015)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_13_(2015)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nAudio | 8086:160c | Yes\nGPU | 8086:1616 | Yes\nWi-Fi | 14e4:43b1 | Yes\nBluetooth | 0a5c:216f | Yes\nTouchpad | 06cb:76ad | Yes\nWebcam | 0bda:5682 | Yes\nSD-card reader | 10ec:5249 | Yes\n\nThe 2015 Dell XPS 13 (9343) is the second-generation model of Dell's XPS 13 line. Like its predecessor, it has official Linux support courtesy of Dell's Project Sputnik team[1]. They target Ubuntu 14.04 LTS, but the improvements and support from the Sputnik team are generally applicable to all distributions.\n\nThe installation process for Arch Linux on the XPS 13 does not differ from any other PC. For installation help, please see the Installation guide and UEFI pages. This page covers the current status of hardware support on Arch, as well as post-installation recommendations.\n\nAs of kernel 4.1.3 (released July 2015), a patched kernel is no longer necessary. However, some manual configuration is still recommended to get the best experience.\n\n"
    },
    {
      "title": "Model differences",
      "level": 2,
      "content": "Although the XPS 13 is sold in a variety of configurations in most markets, those wanting to run Linux should pay special attention to display options (FHD or QHD+) and Wi-Fi adapter differences (Dell DW1560 or Intel 7265).\n\nUsers with QHD+ displays should use a DE/WM that properly supports HiDPI.\n\nRegarding the Wi-Fi adapter, both cards work in Arch Linux. If the Intel one works out-of-the-box thanks to mainline kernel support, the Dell DW1560 instead requires a proprietary kernel module that is not well-supported; further details are reported in the proper below section.\n\nThere are no exclusive hardware differences between the Developer Edition and the standard Windows edition, so this guide is equally applicable to both models.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "The latest UEFI update is A20 and it was released on 8th October 2019. With version A02 or newer, almost everything should work out-of-the-box and the kernel boot parameters that were used in conjunction with earlier UEFI versions are no longer necessary.\n\nThe upgrade is easy thanks to the UEFI implementation: place the update binary (the just downloaded .exe file) in the EFI system partition or on a USB flash drive, reboot, press F12 key in order to enter in the Boot Menu and then choose BIOS Update.\n\n"
    },
    {
      "title": "Screen and keyboard backlight",
      "level": 3,
      "content": "Backlight and its control work out-of-the-box:\n\n- The systemd-backlight.service takes care of both eDP panel and keyboard backlight (and any other external device) status, saving at shutdown and restoring their values at boot.\n- Hardware Function keys (Fn-F11 and Fn-F12 for screen backlight and Fn-F10 for keyboard backlight) work without any operation, as well.\n\n"
    },
    {
      "title": "Dynamic Backlight/Brightness Control (DBC)",
      "level": 4,
      "content": "You may notice that the screen looks dimmer than you expect or the screen overall brightness changes constantly. This behaviour is not a symptom of any monitor issue but a technology called Dynamic Backlight/Brightness Control (DBC), designed to save energy according to the content displayed on the screen.\n\nNote: **QHD+ models** \n\n"
    },
    {
      "title": "SSD",
      "level": 3,
      "content": "This laptop series comes with a SSD as storage device, connected via SATA. This technology needs some configuration in order to achieve the best operative conditions. See Solid State Drives for further information.\n\n"
    },
    {
      "title": "Wi-Fi",
      "level": 3,
      "content": "Most configurations sport the Dell DW1560 802.11ac adapter. This is based on the Broadcom BCM4352 chip which requires proprietary driver to work. Packages broadcom-wl and broadcom-wl-dkms provide it. In the former case remember to install the Linux kernel headers too (even if it is listed as an optional dependency of the dkms package, it is mandatory for having a working network). See the Broadcom wireless page for more details and/or assistance.\n\nSome higher-end models do not use the above-mentioned adapter, instead they use an Intel Wireless 7265 card which is supported by the mainline kernel.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 3,
      "content": "The Broadcom Bluetooth firmware is not available in the kernel (source), so you need to install bcm20702a1-firmwareAUR and reboot if you want to use Bluetooth.\n\nAlternatively, you can retrieve the firmware directly from the Windows driver by yourself. You need to extract the .cab file with cabextract and then convert it to a .hcd file with hex2hcd from bluez-utils:\n\n```\n$ cabextract 20662520_6c535fbfa9dca0d07ab069e8918896086e2af0a7.cab\n$ hex2hcd BCM20702A1_001.002.014.1443.1572.hex\n# mv BCM20702A1_001.002.014.1443.1572.hcd /lib/firmware/brcm/BCM20702A1-0a5c-216f.hcd\n# ln -rs /lib/firmware/brcm/BCM20702A1-0a5c-216f.hcd /lib/firmware/brcm/BCM20702A0-0a5c-216f.hcd\n```\n\nAfter reboot, the firmware is available for your Bluetooth interface.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "The sound chipset in this laptop, a Realtek ALC3263, is described as \"dual-mode\", meaning it supports both the HDA standard and the I2S standard. The embedded controller in the XPS 13 uses the ACPI _REV value provided by the OS itself to determine in which mode the sound chipset should be initialized in at boot.\n\n"
    },
    {
      "title": "HDA mode",
      "level": 4,
      "content": "With BIOS A02+ the sound card will be initialized in HDA mode by default.\n\nBy default, ALSA does not output sound to the PCH card but to the HDMI card. This can be changed by following ALSA#Set the default sound card. To set the proper order, create the following .conf file in /etc/modprobe.d/ [3]:\n\n```\n/etc/modprobe.d/alsa-base.conf\n```\n\n```\noptions snd_hda_intel index=1,0\n```\n\n"
    },
    {
      "title": "I2S mode",
      "level": 4,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nI2S support requires alsa-lib 1.1.0[4] or newer. (I2S support was broken in mainline kernel 4.5, and fixed in Arch kernel 4.5.2 and mainline 4.8FS#48936[5]).\n\nIn I2S mode, the built-in microphone is muted by default. To enable it you have to unmute the Mic item. Follow the instructions below in order to achieve the goal:\n\n- open alsamixer (an utility included in the alsa-utils package)\n- press F6 and select the broadwell-rt286 sound card\n- press F4 to switch to the Capture view and ensure that ADC0 has the CAPTURE label. If it does not, toggle over to it with your arrow keys and press the spacebar to turn it on CAPTURE\n- finally, toggle over to the Mic item and raise the volume to 100.\n\nNote: **Port** \n\nBy default Jack recognises four capture ports and is unusable because the transport is broken into short fragments with breaks between them. Limit input to two channels with -i2 on the command line or the corresponding option in qjackctl's advanced settings.\n\n"
    },
    {
      "title": "Function Keys",
      "level": 3,
      "content": "Here is a summary table about Function Keys you can use with this model:\n\nTable content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Enables Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86AudioPrev\nFn+F5 | Yes | Yes | XF86AudioPlay\nFn+F6 | Yes | Yes | XF86AudioNext\nFn+F8 | Yes | Yes | Switch internal/external display\nFn+F9 | Yes | Yes | XF86Search\nFn+F10 | No | Yes | Switch keyboard backlight intensity\nFn+F11 | Yes | Yes | XF86MonBrightnessDown\nFn+F12 | Yes | Yes | XF86MonBrightnessUp\nFn+Stamp | Yes | Yes | XF86RFKill\nFn+Insert | Yes | No | XF86Sleep\nFn+Super (Left) | Yes | No | Super (Right)\nFn+Ctrl (Right) | Yes | Yes | Menu\nFn+Left | Yes | Yes | Home\nFn+Up | Yes | Yes | Page Up\nFn+Down | Yes | Yes | Page Down\nFn+Ctrl (Right) | Yes | Yes | End\nFn+B | Yes | No | Pause\nFn+R | Yes | No | Print\nFn+S | Yes | No | Scroll Lock\nFn+A / D / E / F / G / T / Q / W | Yes | No | XF86Launch3\n\n1. The key is visible to xev and similar tools.\n1. The physical key has a symbol on it, which describes its function.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "With the latest BIOS, the touchpad should work out-of-the-box with either the synaptics or libinput drivers. The second is recommended over the former.\n\n"
    },
    {
      "title": "Synaptics driver",
      "level": 4,
      "content": "For more advanced settings with the Synaptics driver, see Touchpad Synaptics.\n\nIf the touchpad freezes when you use more than one finger, try enabling Clickpad mode with synclient Clickpad=1.\n\n"
    },
    {
      "title": "Libinput driver",
      "level": 4,
      "content": "For better multi-touch support, you can use xf86-input-libinput. The libinput driver supports nearly all button layouts out-of-the-box with few additional settings.\n\nRefer to the specific libinput page for more details.\n\nFor further configurable options (e.g. NaturalScrolling, MiddleEmulation), see libinput(1).\n\n"
    },
    {
      "title": "Powersaving",
      "level": 3,
      "content": "With kernel 4.6.5 and tlp, the idle power usage can reach ~2.3 W with the kernel parameter pcie_aspm=force enabled.\n\nYou may use powertop or powerstat-gitAUR to reproduce and check this behaviour by yourself.\n\nNote: **FBC** \n\n- With kernel 4.6+, frame-buffer compression (FBC) is enabled by default, so i915.enable_fbc is no longer needed.\n- Panel self refresh (PSR) causes the display to flicker, so it has been disabled by default as of kernel 4.9 [6].\n- i915.lvds_downclock=1 for LVDS downclock is no longer needed. According to IRC #intel-gfx, \"[...] there is a new auto-downclock for eDP panels in recent kernels and it is enabled by default if available, [...]\".\n- i915.enable_rc6=7 is useless on Broadwell (Gen8) systems because the deeper GPU power states that this option enables (RC6p and RC6pp) do not exist on Gen7+ hardware [7][8].\n\n"
    },
    {
      "title": "QHD+ model",
      "level": 4,
      "content": "An ICC profile is a binary file which contains precise data regarding the colour attributes of the monitor. It allows you to produce consistent and repeatable results for graphic and document. The following ICC profile is made with dispcalGUI ( displaycal) ArgyllCMS ( argyllcms) and a spectrophotometer for absolute colour accuracy; even if it is possible to achieve better results by calibrating your own monitor by yourself, in general this profile is definitively an improvement over the stock profile.\n\nThis profile has been made with the spectrophotometer's high resolution spectral mode, with white and black level drift compensation, the high quality ArgyllCMS switch and 3440 patches. Dynamic Brightness Control has been disabled and the monitor has been turned on for at least 30 minutes prior to start the calibration.\n\n- QHD+, D65, Gamma 2.2, max luminance.\n\n"
    },
    {
      "title": "Disable the touchscreen",
      "level": 3,
      "content": "This is an optional step and was tested 07.2019 using Gnome and Wayland. Find out which device it is:\n\n```\n$ libinput list-devices\n```\n\nScroll to find the right section (Something like ELAN Touchscreen) and find the line Kernel: /dev/input/event#. Use the event# for the next command:\n\n```\n$ udevadm info -a -p /sys/class/input/event#\n```\n\nFind an attribute that is most probably unique/distinct. For example ATTRS{name}==\"ELAN Touchscreen\" and create:\n\n```\n/etc/udev/rules.d/99-disable_touchscreen.rules\n```\n\n```\nKERNEL==\"event*\", ATTRS{name}==\"ELAN Touchscreen\", ENV{LIBINPUT_IGNORE_DEVICE}=\"1\"\n```\n\nThen check if it worked:\n\n```\n$ udevadm test /sys/class/input/event#\n```\n\nand search for:\n\n```\nLIBINPUT_IGNORE_DEVICE=1\n```\n\nIf this line is there (most probably within the last 3 lines) reboot and your touchscreen should be disabled.\n\n"
    },
    {
      "title": "Battery thresholds",
      "level": 3,
      "content": "BIOS allows to set thresholds both for charging and discharging. This is helpful to preserve battery health and reduce battery wear.\n\nEven if kernel driver does not expose any interface to control battery [9], a user-space interaction is still possible via libsmbios library or dell-command-configureAUR [10] proprietary tool.\n\nNote: **Battery Health Charging** \n\n"
    },
    {
      "title": "Random kernel hangs at boot",
      "level": 3,
      "content": "See here. This issue seems to affect only touchscreen model owners. The fix consists in removing keyboard from the HOOKS array in /etc/mkinitcpio.conf. If you need the keyboard at boot, edit the MODULES array as follows: MODULES=\"atkbd usbhid hid-generic\". You will have to regenerate the initramfs afterwards.\n\n"
    },
    {
      "title": "Sometimes the system fails to resume from suspend after closing and reopening the LID",
      "level": 3,
      "content": "Even if it has been reported as fixed upstream according to this kernel.org bug report, users still suffer of this problem (reported for both FullHD model with kernel 4.20.12 and the QHD+ model with kernel 4.18.6).\n\nOne more, following a comment in the above-mentioned bug report, you can work it around by blacklisting mei modules:\n\n```\n/etc/modprobe.d/blacklist.suspend-bug.conf\n```\n\n```\nblacklist mei\nblacklist mei_me\n```\n\n"
    },
    {
      "title": "Graphical artifacting/instability after S3 resume",
      "level": 3,
      "content": "If you encounter some artifacts and/or an unusable graphical environment after resuming from a suspend, you may want to switch your Intel graphics acceleration from SNA to UXA. Switching to UXA, however, will result in worse performance. Switching to xf86-video-modesetting (Glamor acceleration) should not decrease performance considerably,however it is still not known if will fix the resume issue.\n\n"
    },
    {
      "title": "Connection issues with Broadcom wireless",
      "level": 3,
      "content": "If wifi-menu and iwlist scan fail after driver installation and reboot, try disabling \"Wireless Switch\" control in the BIOS.\n\n"
    },
    {
      "title": "DE cannot connect Bluetooth devices",
      "level": 3,
      "content": "If the Bluetooth GUI cannot connect the device, try to use bluetoothctl to connect manually.\n\n"
    },
    {
      "title": "Loud cracks/noise during boot or audio playback",
      "level": 3,
      "content": "Some users have reported the above sound problems, as described here for example.\n\nDisabling audio powersafe may work for people using the HDA audio mode.\n\nHowever, it is still unknown how to solve this issue for the I2S audio mode.\n\nFor further reference, see the corresponding kernel bug entry.\n\n"
    },
    {
      "title": "Pink & green artifacts in video or webcam output",
      "level": 3,
      "content": "Update xf86-video-intel to latest version. This should fix the issue.\n\n"
    },
    {
      "title": "4K/60Hz with mini DisplayPort/HDMI Adapter",
      "level": 3,
      "content": "Even when using an active miniDP/HDMI Adapter that supports 4K/60Hz output, the display may not be recognized as supporting 60Hz. Only the 4K/30Hz mode may be detected and shown by xrandr. In this case, you can still add the 60Hz mode manually, using the reduced blinking modeline from cvt:\n\n```\ncvt -r 3840 2160 60\n# 3840x2160 59.97 Hz (CVT 8.29M9-R) hsync: 133.25 kHz; pclk: 533.00 MHz\nModeline \"3840x2160R\"  533.00  3840 3888 3920 4000  2160 2163 2168 2222 +hsync -vsync\n```\n\nWithout the -r flag that calculates the reduced blinking modeline, it may not work. Then proceed as described in xrandr#Adding undetected resolutions.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "General:\n\n- Collection of links and different configurations\n- Service Manual for Dell XPS 13 (9343)\n\nProject Sputnik:\n\n- Recent Fixes for XPS 13 developer edition\n- Update 2: Dell XPS 13 laptop, developer edition – Sputnik Gen 4\n- Update: Dell XPS 13 laptop, developer edition – Sputnik Gen 4\n- 4th gen Dell XPS 13 developer edition available!\n\n"
    }
  ]
}