{
  "title": "Diretrizes de pacotes KDE",
  "url": "https://wiki.archlinux.org/title/Diretrizes_de_pacotes_KDE",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "32-bit – CLR – CMake – Cross – DKMS – Eclipse – Electron – Fonte – Free Pascal – GNOME – Go – Haskell – Java – KDE – Kernel – Lisp – Meson – MinGW – Node.js – Nonfree – OCaml – Perl – PHP – Python – R – Ruby – Rust – Shell – VCS – Web – Wine\n\nOs pacotes do KDE no Arch Linux seguem um certo esquema.\n\n"
    },
    {
      "title": "Diretório de compilação",
      "level": 2,
      "content": "Uma boa maneira de compilar pacotes de CMake é compilar um diretório fora da raiz do projeto e executar o cmake a partir desse diretório. O PKGBUILD (Português) deve ficar assim:\n\n```\nprepare() {\n  mkdir -p build\n}\n\nbuild() {\n  cd build\n  cmake ../${pkgname}-${pkgver}\n}\n```\n\n"
    },
    {
      "title": "Prefixo de instalação",
      "level": 2,
      "content": "Cada pacote deve definir a variável CMAKE_INSTALL_PREFIX, mas também temos que respeitar as versões personalizadas do KDE, então use:\n\n```\n-DCMAKE_INSTALL_PREFIX=$(kde4-config --prefix)\n```\n\nou para KDE 5:\n\n```\n-DCMAKE_INSTALL_PREFIX=$(kf5-config --prefix)\n```\n\nQuando um pacote é movido para extra, essa linha deve ser alterada para:\n\n```\n-DCMAKE_INSTALL_PREFIX=/usr\n```\n\n"
    },
    {
      "title": "Tipo de compilação",
      "level": 2,
      "content": "Geralmente você não deve especificar o tipo de compilação; isso faz com que o CMake honre variáveis ambientais como CFLAGS, CPPFLAGS, etc. [1]\n\n"
    },
    {
      "title": "KDE4",
      "level": 3,
      "content": "Em sistemas onde ambos qt4AUR e qt5-base estão instalados, o qmake refere-se à versão 5.x, então force o cmake a usar o Qt4 desta maneira:\n\n```\nexport QT_SELECT=4\n```\n\nou usando essa opção em cmake:\n\n```\n-DQT_QMAKE_EXECUTABLE=/usr/bin/qmake-qt4\n```\n\n"
    },
    {
      "title": "KF5",
      "level": 3,
      "content": "As mesmas regras que para o KDE4, mas você precisa forçar o cmake a usar o Qt5 ao invés do Qt4:\n\n```\nexport QT_SELECT=5\n```\n\n"
    },
    {
      "title": "Módulo de Configuração do KDE",
      "level": 3,
      "content": "Pacotes de módulo de configuração do KDE devem ser nomeados kcm-módulo.\n\n"
    },
    {
      "title": "Widgets do Plasma",
      "level": 3,
      "content": "Os pacotes de widgets de Plasma (anteriormente Plasmoids) devem ser nomeados kdeplasma-applets-nome_widget para que sejam reconhecidos como pacotes relacionados ao KDE; isso também os distingue dos pacotes oficiais.\n\n"
    },
    {
      "title": "Executores",
      "level": 3,
      "content": "Os pacotes de corredores de plasma devem ser nomeados kdeplasma-runners-nome_do_runner para que sejam reconhecidos como pacotes relacionados ao KDE; isso também os distingue dos pacotes oficiais.\n\n"
    },
    {
      "title": "Menus de serviço",
      "level": 3,
      "content": "Os pacotes de menus de serviço devem ser nomeados kde-servicemenus-nome_do_serviço para que sejam reconhecidos como pacotes relacionados ao KDE.\n\n"
    },
    {
      "title": "Temas",
      "level": 3,
      "content": "Os pacotes de temas de plasma devem ser nomeados kdeplasma-themes-nome_do_tema para que sejam reconhecidos como pacotes relacionados ao KDE.\n\n"
    },
    {
      "title": "Widgets de plasma",
      "level": 3,
      "content": "Os pacotes de widgets de plasma (anteriormente Plasmoids) devem ser nomeados plasma5-applets-nome_do_widget para que sejam reconhecíveis como pacotes relacionados ao Plasma 5; isso também os distingue dos pacotes oficiais.\n\n"
    },
    {
      "title": "Executores",
      "level": 3,
      "content": "Os pacotes de corredores de plasma devem ser nomeados plasma5-runners-nome_do_runner para que sejam reconhecidos como pacotes relacionados ao Plasma 5; isso também os distingue dos pacotes oficiais.\n\n"
    },
    {
      "title": "Menus de serviço",
      "level": 3,
      "content": "Os pacotes de menus de serviço devem ser nomeados kf5-servicemenus-nome_do_serviço para que sejam reconhecidos como pacotes relacionados ao KF5\n\n"
    },
    {
      "title": "Temas",
      "level": 3,
      "content": "Os pacotes de temas de plasma devem ser nomeados plasma5-themes-nome_do_tema para que sejam reconhecidos como pacotes relacionados ao Plasma 5.\n\n"
    },
    {
      "title": "Instalação de arquivos de ícones e .desktop",
      "level": 2,
      "content": "Alguns softwares do KDE fornecem ícones em arquivos de hicolor icon theme e .desktop, os quais devem ser instalados via hooks do pacman. Evite usar comando de instalação para esses tipos de arquivos em arquivos .install, pois resultaria em desnecessária execução duplicada.\n\nO pacote qt4AUR já depende de xdg-utils, hicolor-icon-theme e desktop-file-utils, então se seu pacote depender do qt4AUR, nenhuma outra ação deve ser necessária (isto é, desnecessário adicionar esses pacotes ao vetor de depends).\n\n"
    }
  ]
}