{
  "title": "Diretrizes de Trusted User do AUR",
  "url": "https://wiki.archlinux.org/title/Diretrizes_de_Trusted_User_do_AUR",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Arch User Repository\n- DeveloperWiki:How to be a packager\n- DeveloperWiki:Building in a clean chroot\n- GnuPG\n- OpenPGP\n\nO Mantenedores de Pacote, ou Package Maintainers, são membros de uma equipe do Arch Linux encarregada de manter o AUR funcionando. Ele/Ela mantém pacotes populares (comunicando-se com o upstream e enviando-o patches quando necessário) e vota em assuntos administrativos. Um Mantenedor de Pacote é eleito de membros ativos da comunidade pelos atuais Mantenedores de Pacote em um processo democrático. Mantenedores de Pacote são os únicos membros que têm a última palavra na direção do AUR.\n\nOs Mantenedores de Pacote são governados usando as Package Maintainer bylaws (\"Estatuto dos Mantenedores de Pacote\")\n\n"
    },
    {
      "title": "Lista de tarefas para novos Mantenedores de Pacote",
      "level": 2,
      "content": "1. Ler este artigo de wiki por completo.\n1. Ler as Package Maintainer Bylaws.\n1. Certificar-se de que os detalhes da sua conta no AUR estejam atualizados.\n1. Pedir que um de seus patrocinadores (sponsors) lhe dê o status de Mantenedor de Pacote no AUR.\n1. Lembrar um bureaucrat de adicionar sua conta wiki ao grupo Arch Linux Package Maintainers\n1. Lembrar um administrador do BBS de alterar sua conta nos fóruns.\n1. Pedir a um de seus patrocinadores as chaves de #archlinux-staff e #archlinux-packaging e participar nos canais (isso não é obrigatório, mas é uma ótima forma de conhecer partes da equipe e colaborar). Se você precisar de um bouncer, peça ao heftig por um convite de Matrix. Se você quiser uma manta de @archlinux/package-maintainer/nome-de-usuário, peça aos nossos contatos de grupos para obter uma.\n1. Pedir a um de seus patrocinadores para criar um ticket no rastreador de problemas do repositório de infraestrutura (usando o modelo Onboarding) e forneça-os com as seguintes informações: Uma chave pública SSH. Se você não possuir uma, siga SSH keys#Generating an SSH key pair para criar uma. Um nome de usuário que será usado para sua conta SSO e para seu endereço de e-mail @archlinux.org (a ser criado). Seu nome completo. Seu endereço de e-mail (pessoal) e um ID de chave pública PGP válido para ele, que será usado para fornecer a senha inicial da interface do desenvolvedor (archweb) para você e que será vinculado a sua conta SSO (a ser criada). Se seu endereço de e-mail particular ou nome-de-usuário@archlinux.org (a ser criado) deve ser usado para as listas de e-mail não públicas e ter permissão para postar na lista de discussão arch-dev-public.\n1. Definir a senha para seu endereço de e-mail @archlinux.org seguindo DeveloperWiki:Staff Services#Email.\n1. Criar um par de chaves PGP para assinatura de pacote seguindo o fluxo de trabalho para adicionar uma nova chave de empacotador (usando seu novo endereço nome-de-usuário@archlinux.org como uid).\n1. Pedir a um de seus patrocinadores para criar um ticket no rastreador de problemas do repositório archlinux-keyring (usando o modelo New Packager Key) para ter sua chave PGP assinada por (pelo menos) três principais detentores de chaves.\n1. Instalar o pacote devtools.\n1. Configurar sua chave privada ssh para os servidores orion.archlinux.org e repos.archlinux.org.\n1. Testar a conexão SSH para nome-de-usuário@orion.archlinux.org (assim que você tiver permissões).\n1. Começar a contribuir!\n\n- Se você precisar de um bouncer, peça ao heftig por um convite de Matrix.\n- Se você quiser uma manta de @archlinux/package-maintainer/nome-de-usuário, peça aos nossos contatos de grupos para obter uma.\n\n- Uma chave pública SSH. Se você não possuir uma, siga SSH keys#Generating an SSH key pair para criar uma.\n- Um nome de usuário que será usado para sua conta SSO e para seu endereço de e-mail @archlinux.org (a ser criado).\n- Seu nome completo.\n- Seu endereço de e-mail (pessoal) e um ID de chave pública PGP válido para ele, que será usado para fornecer a senha inicial da interface do desenvolvedor (archweb) para você e que será vinculado a sua conta SSO (a ser criada).\n- Se seu endereço de e-mail particular ou nome-de-usuário@archlinux.org (a ser criado) deve ser usado para as listas de e-mail não públicas e ter permissão para postar na lista de discussão arch-dev-public.\n\n"
    },
    {
      "title": "O Mantenedor de Pacote e o AUR",
      "level": 2,
      "content": "Os Mantenedores de Pacote deveriam também fazer um esforço para verificar o envio de pacotes no AUR por códigos maliciosos e o correto seguimento dos padrões dos PKGBUILD. Em cerca de 80% dos casos, os PKGBUILDs no AUR são muito simples e podem ter rapidamente verificadas a sanidade e os códigos maliciosos pela equipe de Mantenedores de Pacote.\n\nOs Mantenedores de Pacote devem também verificar os PKGBUILDs por pequenos erros, sugerir correções e melhoras. O Mantenedor de Pacote deve se tentar certificar-se de que todos os pacotes sigam Arch Packaging Guidelines/Standards (Diretrizes/Padrões de Empacotamento do Arch) e ao fazer isso, compartilhar suas habilidades com outros criadores de pacotes em um esforço em criar um padrão de criação de pacotes por toda a distribuição.\n\nOs Mantenedores de Pacote também estão em uma posição de documentar práticas recomendadas.\n\n"
    },
    {
      "title": "Reescrevendo histórico Git",
      "level": 3,
      "content": "Em alguns casos, é necessário reescrever o histórico de um repositório do AUR, por exemplo, quando um usuário inadvertidamente usa seu nome legal em um commit publicado. Isso pode ser automatizado com git-filter-branch(1).\n\nPara realizar um push forçado para um novo histórico, encaminhe a variável de ambiente AUR_OVERWRITE=1 para o git-push(1).\n\nEm detalhes, isso inclui adicionar SendEnv AUR_OVERWRITE à sua configuração AUR SSH e definir o env var em seu comando push: AUR_OVERWRITE=1 git push --force. Veja [1] para detalhes.\n\nInstale git-filter-repo e execute:\n\n```\n$ git-filter-repo --name-callback 'return name.replace(b\"Nome antigo\", b\"Nome novo\")' --email-callback 'return email.replace(b\"antigo@email.com\", b\"novo@email.com\")'\n```\n\nAlternativamente, use git filter-branch --env-filter com as variáveis de ambiente GIT_AUTHOR_NAME, GIT_AUTHOR_EMAIL, GIT_COMMITTER_NAME e GIT_COMMITTER_EMAIL. Por exemplo:\n\n```\ngit filter-branch --env-filter '\nif test \"$GIT_AUTHOR_EMAIL\" = \"lepetit@prince.com\"; then\n  GIT_AUTHOR_EMAIL=user@users.noreply.github.com\nfi\nif test \"$GIT_AUTHOR_NAME\" = \"Antoine de Saint-Exupéry\"; then\n  GIT_AUTHOR_NAME=user\nfi'\n```\n\n"
    },
    {
      "title": "Lidando com requisições no AUR",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nOs Mantenedores de Pacote devem verificar periodicamente as requisições enviadas no AUR. Para isso existem algumas regras genéricas sobre o que verificar para cada tipo de requisição:\n\n- verifique se o pedido tem mais de 14 dias (a coluna de data fica vermelha na visão geral) (você não pode aceitá-lo antes disso de qualquer maneira)\n- verifique se não houve atualização do próprio pacote (commit ou release) feita nos últimos 14 dias\n- verifique se não houve comentário do mantenedor do pacote no AUR feito nos últimos 14 dias\n\nSe todos os pontos acima forem atendidos, você poderá aceitar a requisição para tornar órfão.\n\n"
    },
    {
      "title": "Regras para a entrada de pacotes no repositório extra",
      "level": 3,
      "content": "- Um pacote não pode já existir em qualquer um dos repositórios do Arch Linux. você deve tomar os cuidados necessários para se certificar que nenhum outro empacotador está no processo de promoção do mesmo pacote. Veja os comentários do pacote do AUR, leia os últimos títulos de assuntos no aur-general, pesquise em todos os projetos no rastreador de erro[link inativo 2024-01-13 ⓘ], faça um grep no git-log(1) e envie uma mensagem rápida para o canal IRC privado \"packaging\".\n- Wrappers do pacman, como uma exceção especial, nunca serão permitidos. Se desejar adicionar auxiliares do AUR, escreva um e-mail para arch-dev-public com a adição proposta e respeite as objeções fornecidas pelos membros da equipe.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n- Somente pacotes \"populares\" podem entrar no repositório, sendo definido pelo 1% de uso no pkgstats ou 10 votos no AUR.\n- Exceções automáticas a esta regra são: pacotes de internacionalização (i18n) pacotes de acessibilidade drivers dependências de pacotes que satisfazem a definição de populares, incluindo makedeps e optdeps pacotes que são parte de uma coleção e têm a intenção de ser distribuídos juntos, fornecendo uma parte da coleção satisfaz a definição de popular\n- Quaisquer adições não cobertas por nenhum dos critérios acima devem ser propostas na lista de discussão aur-general, explicando o motivo para a dispensa (ex.: pacote renomeado, novo pacote). O acordo de três outros Mantenedores de Pacote é necessário para que o pacote seja aceito na extra. Adições propostas por Mantenedores de Pacote com grande número de pacotes \"não-populares\" provavelmente serão rejeitadas.\n- Os Mantenedores de Pacote são incentivados a mover os pacotes mantidos do extra, se eles tiverem baixo uso. Nenhuma aplicação será necessária, apesar de que a renúncia de pacotes de Mantenedores de Pacote pode ser filtrada antes que ocorra adoção.\n- É uma boa prática sempre incrementar o pkgrel em 1 (em outras palavras, defina o para n + 1) ao promover um pacote do AUR. Isso é para facilitar atualizações automáticas para aqueles que já têm o pacote instalado, de forma que eles podem continuar a receber atualizações a partir do canal oficial. Um outro efeito positivo disto é que usuários não são avisados que sua cópia local é mais nova, como é o caso se um empacotador redefinir o pkgrel para 1.\n\n- pacotes de internacionalização (i18n)\n- pacotes de acessibilidade\n- drivers\n- dependências de pacotes que satisfazem a definição de populares, incluindo makedeps e optdeps\n- pacotes que são parte de uma coleção e têm a intenção de ser distribuídos juntos, fornecendo uma parte da coleção satisfaz a definição de popular\n\n"
    },
    {
      "title": "Acessando e atualizando o repositório",
      "level": 3,
      "content": "Veja o guia do empacotador.\n\n"
    },
    {
      "title": "Abandonando pacotes",
      "level": 3,
      "content": "Se um Mantenedor de Pacote não pode ou não quer mais manter um pacote, um aviso deve ser postado na Lista de Discussão do AUR, para que outro mantenedor de pacote possa mantê-lo. Um pacote pode ainda ser abandonado mesmo se nenhum outro Mantenedor de Pacote quiser mantê-lo, mas os Mantenedores de Pacote devem evitar de deixar muitos pacotes soltos (eles não deveriam manter mais do que possam dar conta). Se um pacote se tornou obsoleto ou não é mais usado, ele também pode ser completamente removido.\n\nSe um pacote foi removido completamente, o mesmo pode ser enviado novamente (do zero) para o AUR, onde um usuário normal pode manter o pacote ao invés de um Mantenedor de Pacote.\n\n"
    },
    {
      "title": "Movendo pacotes do AUR para extra",
      "level": 3,
      "content": "Siga os procedimentos normais para adição de um pacote ao extra usando as instruções do guia do empacotador, mas lembre-se de remover o pacote correspondente do AUR!\n\n"
    },
    {
      "title": "Movendo pacotes do extra para AUR",
      "level": 3,
      "content": "Remova o pacote usando as instruções do guia do empacotador e envie o seu tarball fonte para o AUR.\n\n"
    },
    {
      "title": "Movendo pacotes do extra-testing para extra",
      "level": 3,
      "content": "Mova o pacote do repositório extra-testing para o repositório extra usando as instruções do guia do empacotador.\n\n"
    },
    {
      "title": "Compilação remota no build.archlinux.org",
      "level": 3,
      "content": "Mantenedor de Pacote e Desenvolvedores podem se conectar ao build.archlinux.org via SSH para, entre outros, criar pacotes usando o devtools. Isso tem diversas vantagens sobre a configuração local:\n\n- Compilações são rápidas e a velocidade de rede é alta.\n- O ambiente precisa ser configurado apenas uma vez.\n- Seu sistema local não precisa ser Arch Linux.\n\nO processo é semelhante ao de uma configuração local com devtools. Seu GnuPG privado é necessário para assinar, mas você não quer enviá-lo por razões óbvias de segurança. Como tal, você precisará encaminhar o soquete de agente do GnuPG de sua máquina local para o servidor: isso permitirá que você assine pacotes no servidor de compilação sem comunicar sua chave. Isso também significa que precisamos desabilitar o agente no servidor antes de podermos executar qualquer coisa.\n\nPrimeiro, conecte-se ao servidor de compilação e desabilite-o:\n\n```\n$ ssh build.archlinux.org\n$ systemctl --user mask gpg-agent.service\n```\n\nCertifique-se de que o gpg-agent não esteja em execução (systemctl --user stop gpg-agent.service). Neste ponto, certifique-se de que não existem soquetes na pasta apontada por gpgconf --list-dir socketdir. Em caso afirmativo, remova-os ou efetue o logout e novamente. Se você tem um $GNUPGHOME personalizado (por exemplo, para movê-lo para ~/.config/gnupg), você precisará desmarcar isso, pois não é possível no gnupg definir o homedir sem configurar o socketdir. No servidor de compilação, StreamLocalBindUnlink yes está definido no sshd_config, então remover os soquetes manualmente no logout não é necessário.\n\nEnquanto as chaves privadas PGP permanecem em sua máquina local, as chaves públicas devem estar no servidor de compilação. Exportar sua chave público para o servidor de compilação, por exemplo da sua máquina local\n\n```\n$ scp ~/.gnupg/pubring.gpg build.archlinux.org:~/.gnupg/pubring.gpg\n```\n\nO SSH é necessário para fazer checkout e commit no repositório Git. Você pode configurar um novo par de chaves SSH no servidor (é altamente desencorajado colocar sua chave privada local no servidor por motivos de segurança) ou reutilizar as chaves locais por meio do encaminhamento de soquete. Se você optar por este último, certifique-se de desabilitar o ssh-agent no servidor de compilação se você o habilitou anteriormente (ele não está em execução por padrão).\n\nConfigure seu ambiente de compilação no servidor de compilação:\n\n```\n~/.makepkg.conf\n```\n\n```\nPACKAGER=\"John Doe <john@doe.example>\"\n## Opcional\nPKGDEST=\"/home/johndoe/packages\"\nSRCDEST=\"/home/johndoe/sources\"\nSRCPKGDEST=\"/home/johndoe/srcpackages\"\nLOGDEST=\"/home/johndoe/logs\"\n## Se sua chave PGP não é a padrão, especifique a impressão digital correta:\nGPGKEY=\"ABCD1234...\"\n```\n\nDesabilite o cache de senha com as seguintes configurações:\n\n```\ngpg-agent.conf\n```\n\n```\ndefault-cache-ttl 0\nmax-cache-ttl 0\n```\n\nComo desejaremos manter nosso agente GPG normal em execução com suas configurações atuais, executaremos outro agente GPG dedicado à tarefa em questão. Crie uma pasta ~/.gnupg-archlinux e crie uma ligação simbólica de ~/.gnupg, exceto ~/.gnupg/gpg-agent.conf. Configure o novo agente GPG:\n\n```\n~/.gnupg-archlinux\n```\n\n```\nextra-socket /home/doe/.gnupg-archlinux/S.gpg-agent.extra\ndefault-cache-ttl 0\nmax-cache-ttl 0\npinentry-program /usr/bin/pinentry-gtk-2\n```\n\nO gpg-agent-extra.socket será encaminhado para build.archlinux.org.\n\nInicie o agente dedicado com:\n\n```\n$ gpg-agent --homedir ~/.gnupg-archlinux --daemon\n```\n\nConecte-se com:\n\n```\n$ ssh -R $REMOTE_SSH_AUTH_SOCK:$SSH_AUTH_SOCK -R /run/user/$REMOTE_UID/gnupg/S.gpg-agent:/home/doe/.gnupg-archlinux/S.gpg-agent.extra build.archlinux.org\n```\n\nou, se estiver usando GnuPG como seu agente SSH, com:\n\n```\n$ ssh -R /run/user/REMOTE_UID/gnupg/S.gpg-agent.ssh:/run/user/LOCAL_UID/gnupg/S.gpg-agent.ssh -R /run/user/REMOTE_UID/gnupg/S.gpg-agent:/home/doe/.gnupg-archlinux/S.gpg-agent.extra build.archlinux.org\n```\n\nSubstitua REMOTE_UID e LOCAL_UID pelo seu identificador de usuário como retornado por id -u no servidor de compilação e localmente, respectivamente. Se estiver usando ssh-agent, substitua REMOTE_SSH_AUTH_SOCK pelo caminho para o soquete SSH no host remoto (pode ser qualquer coisa).\n\nVocê pode tornar o encaminhamento permanente para esse host. Por exemplo, com gpg-agent.ssh:\n\n```\n~/.ssh/config\n```\n\n```\nHost build.archlinux.org\n  RemoteForward /run/user/REMOTE_UID/gnupg/S.gpg-agent /run/user/LOCAL_UID/gnupg/S.gpg-agent.extra\n  RemoteForward /run/user/REMOTE_UID/gnupg/S.gpg-agent.ssh /run/user/LOCAL_UID/gnupg/S.gpg-agent.ssh\n```\n\nNovamente, substitua REMOTE_UID com o UID do servidor de compilação.\n\nA partir de então, o procedimento deve ser exatamente igual a uma compilação local:\n\n```\n$ ssh build.archlinux.org\n$ pkgctl repo clone existing-package\n$ ...\n```\n\n"
    },
    {
      "title": "Lista de TODO na renúncia de um Mantenedor de Pacote",
      "level": 2,
      "content": "Quando um Mantenedor de Pacote renuncia, a seguinte lista tem que ser seguida -- essas etapas não se aplicam quando um Mantenedor de Pacote renuncia sendo ainda um desenvolvedor.\n\n1. Todos os pacotes empacotados pelo TU retirado devem ser resignados (portanto, recompilados). Pacotes empacotados pelo retirado podem ser localizados no Archweb https://archlinux.org/packages/?sort=&q=&empacotador=$empacotador&flagged=, sendo empacotador o nome de usuário no Archweb.\n1. A conta do renunciado deve ser desabilitada no Archweb e adicionada ao grupo \"Retired Package maintainers\". O retirado deve ser removido dos \"Package Maintainers\" e as permissões de repositório devem ser reduzidas a zero.\n1. O acesso shell a nossos servidores deve ser desabilitado. (especialmente repos.archlinux.org, pkgbuild.com)\n1. A chave GPG deve ser removida e um novo pacote archlinux-keyring deve ser enviado para os repositórios. Crie um relatório de erro no projeto do chaveiro para remover as chaves dos Mantenedores de Pacote retirados.\n1. Remova o grupo de Mantenedor de Pacote de suas contas AUR.\n1. Um bureaucrat deve remover sua conta wiki do grupo Arch Linux Package Maintainers.\n1. Um administrador do BBS deve mudar sua conta nos fóruns.\n\n"
    }
  ]
}