{
  "title": "Discord",
  "url": "https://wiki.archlinux.org/title/Discord",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Slack\n\nDiscord is a proprietary, cross-platform, all-in-one voice and text chat application. Many open-source communities have official Discord servers as well. Discord can be used through a web browser or through the desktop application, which is made with Electron.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "You can use one of the following packages to install the desktop application for Discord:\n\n"
    },
    {
      "title": "Official applications",
      "level": 4,
      "content": "- Stable: discord\n- Testing: discord-ptbAUR\n- Nightly: discord-canaryAUR\n\nAlternatively, Discord is available as a Flatpak. This may fix some issues related to system libraries and improve performance in some cases, but needs some extra work to enable Rich Presence. See #Enabling rich presence on Flatpak.\n\n```\n$ flatpak install discord\n```\n\n"
    },
    {
      "title": "Official clients using system electron",
      "level": 4,
      "content": "Official clients, using the system provided electron for increased security and potentially better performance:\n\n- Stable: discord_arch_electronAUR\n- Nightly: discord-canary-electron-binAUR\n\n"
    },
    {
      "title": "Third-party clients",
      "level": 4,
      "content": "- Abaddon — An alternative Discord client made with C++/gtkmm with voice support.\n\n- discord-screenaudio — A custom discord client that supports streaming with audio on Linux.\n\n- Dissent — GTK4 Discord client in Go.\n\n- Legcord — A custom client designed to enhance your Discord experience while keeping everything lightweight.\n\n- Ripcord — A lightweight, proprietary desktop chat client for group-centric services like Slack and Discord built upon the Qt toolkit.\n\n- Vesktop — Vesktop is a cross platform desktop app aiming to give you a snappier Discord experience. Supports screencasting with audio.\n\n- WebCord — Wrapper for the web client that improves privacy and allows for screensharing on Wayland.\n\n"
    },
    {
      "title": "Command-line clients",
      "level": 3,
      "content": "There are numerous CLI-based third party clients on the AUR (and non-packaged ones on Github), although most are deprecated or broken. discordo is maintained and packaged on the AUR as discordo-gitAUR.\n\n"
    },
    {
      "title": "Chat client plugins",
      "level": 3,
      "content": "- purple-discord — Discord plugin for libpurple based messengers such as Pidgin\n\n- bitlbee-discord — Discord plugin for Bitlbee\n\n- weechat-discord — Discord plugin for WeeChat\n\n"
    },
    {
      "title": "Custom CSS & plugins",
      "level": 3,
      "content": "- BetterDiscord — A project which allows Discord to be modified to use custom CSS and plugins.\n\n- Discocss — A simple script that can inject custom CSS into Discord clients. To inject CSS into the discord-ptbAUR and discord-canaryAUR versions, replace any mentions of the discord folder with the version in use.\n\n- Replugged — A fork of Powercord, the lightweight discord client mod focused on simplicity and performance.\n\n- Vencord — A Discord client mod that loads entirely before Discord's boot—aiming to make it faster and more stable.\n\n"
    },
    {
      "title": "Overlay",
      "level": 3,
      "content": "For Linux clients, Discord does not support in-game overlay. discover-overlayAUR is an open-source GTK application that provides these functions. Discover works on X11 or wlroots environments. This is not compatible with third-party clients, due to relying on advanced RPC.\n\n"
    },
    {
      "title": "Utilities",
      "level": 3,
      "content": "- Chuncord — A command line tool to upload files to the Discord CDN in parts using webhooks\n\n"
    },
    {
      "title": "GNOME top bar icon",
      "level": 3,
      "content": "If you would like to have the icon on the top bar of GNOME, install the AppIndicator and KStatusNotifierItem Support extension and libappindicator-gtk3.\n\n"
    },
    {
      "title": "Discord asks for an update not yet available in the repository",
      "level": 3,
      "content": "Discord will refuse to launch if there is an update available, and the following message will be shown \"Must be your lucky day, there's a new update!\". If the updated version is not yet available in the official repos, you can build and install the updated package using the Arch build system.\n\nTo disable the update check, add the line \"SKIP_HOST_UPDATE\": true to ~/.config/discord/settings.json. If the file does not exist, create it and add the following:\n\n```\n~/.config/discord/settings.json\n```\n\n```\n{\n  \"SKIP_HOST_UPDATE\": true\n}\n```\n\nNote that if the file exists, you will need to add an extra comma after the WINDOW_BOUNDS object due to JSON requirements, i.e.:\n\n```\n{\n  \"IS_MAXIMIZED\": true,\n  \"IS_MINIMIZED\": false,\n  \"WINDOW_BOUNDS\": {\n    \"x\": 2240,\n    \"y\": 219,\n    \"width\": 1280,\n    \"height\": 720\n  },\n  \"SKIP_HOST_UPDATE\": true\n}\n```\n\nIn case the above method still asks for an update a quick temporary alternative is to extract the new discord-0.0.x.tar.gz file into e.g. /opt/discord-temporary/, change the name of the newly extracted discord.desktop, and symlink it into your ~/.local/share/applications/ folder, preferably also changing the Name inside the new discord.desktop file in order to differentiate it from your system discord client.\n\n"
    },
    {
      "title": "Start Discord minimized",
      "level": 3,
      "content": "Discord can be started minimized through the --start-minimized argument.\n\n"
    },
    {
      "title": "Microphone noise suppression",
      "level": 3,
      "content": "Discord now has noise suppression built in, with both a standard option and an AI-powered option provided by Krisp. You can also provide your own noise suppression on PipeWire by following PipeWire#Noise suppression for voice.\n\n"
    },
    {
      "title": "Screen sharing with audio",
      "level": 3,
      "content": "Discord now natively supports audio streaming on Linux, support was added in version 0.0.76.\n\n"
    },
    {
      "title": "Web RPC extensions",
      "level": 3,
      "content": "There are extensions available to show selected web activity in your Discord rich presence:\n\n- PreMiDAUR with appropriate browser extension.\n- discord-rpc-extension-binAUR with PreWrap or Mal-sync browser extensions.\n\n"
    },
    {
      "title": "Enabling developer tools",
      "level": 3,
      "content": "After a recent update, devtools were disabled by default on Discord for safety reasons. To re-enable them, add this to ~/.config/discord/settings.json:\n\n```\n\"DANGEROUS_ENABLE_DEVTOOLS_ONLY_ENABLE_IF_YOU_KNOW_WHAT_YOURE_DOING\": true\n```\n\n"
    },
    {
      "title": "Enabling text-to-speech",
      "level": 3,
      "content": "By default, text-to-speech is disabled in the Discord client. However, it can be enabled using the --enable-speech-dispatcher flag. This utilizes the speech-dispatcher daemon to output the speech.\n\n"
    },
    {
      "title": "Native Wayland rendering",
      "level": 3,
      "content": "Discord and other Electron apps by default use X11 and run through Xwayland on Wayland sessions, this can be changed. See Wayland#Electron.\n\n- Since the official Discord client does not use system Electron, it will not use flags in ~/.config/electron-flags.conf.\n- If you are using flatpak version, you will have to give Discord permission to use Wayland in Flatseal or Plasma settings, otherwise it will fail to launch. The same may apply for other flatpak apps.\n\n"
    },
    {
      "title": "Lagging when scrolling through your guilds",
      "level": 3,
      "content": "If you experience lags and stutters while scrolling through your guilds please ensure that your hardware acceleration is working correctly. You can do this by opening chrome://gpu in a Chromium based browser. If it is not working please check the chapter on Hardware video acceleration and try running Discord with some additional options:\n\n```\n$ discord --ignore-gpu-blocklist --disable-features=UseOzonePlatform --enable-features=VaapiVideoDecoder --use-gl=desktop --enable-gpu-rasterization --enable-zero-copy\n```\n\n"
    },
    {
      "title": "Crackling during voice calls",
      "level": 3,
      "content": "If you experience crackling sounds when in voice chat, try the steps outlined in PulseAudio/Troubleshooting#Troubleshooting buffer underruns (glitches, skips, crackling).\n\n"
    },
    {
      "title": "Screen sharing on Wayland",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nAs of version 0.0.17, the Screen Share feature does not work on Wayland, even when enabling Ozone for Wayland using /usr/bin/discord --enable-features=UseOzonePlatform --ozone-platform=wayland. See this Reddit post and the Discord bug report.\n\nPossible workarounds are:\n\n- If you also have X11 installed, you can fix this issue easily by setting the following environment variable: XDG_SESSION_TYPE=x11. If you installed Discord using Flatpak, you can use a Flatpak permission manager, like flatsealAUR, to set the same environment variable.\n- Using Discord in a browser that supports screen sharing like Firefox. The browser will prompt you to choose which window or screen to share by its native dialog.\n- XwaylandVideoBridge. See Wayland#Screencast Wayland windows with X11 applications.\n- using a virtual camera. See Open Broadcaster Software#Virtual camera output and Screen capture#Via a virtual webcam video feed.\n- Using a third party client (the usual warning about Discord's TOS applies, use at your own risk): webcordAUR fully supports screensharing on Wayland, however lacks features like rich presence as it bundles the web version of Discord. Vesktop, available as vesktop-binAUR.\n\n- webcordAUR fully supports screensharing on Wayland, however lacks features like rich presence as it bundles the web version of Discord.\n- Vesktop, available as vesktop-binAUR.\n\n"
    },
    {
      "title": "Enabling rich presence on Flatpak",
      "level": 3,
      "content": "When using the Flatpak version of Discord, Rich Presence will not work out of the box. To make it work, it is necessary to create a symlink from $XDG_RUNTIME_DIR/discord-ipc-0 to $XDG_RUNTIME_DIR/app/com.discordapp.Discord/discord-ipc-0. To create the symlink for the current user session, run:\n\n```\n$ ln -sf {app/com.discordapp.Discord,$XDG_RUNTIME_DIR}/discord-ipc-0\n```\n\nTo automatically create the symlink, systemd-tmpfiles can be used by adding the following line to a file with the .conf extension in ~/.config/user-tmpfiles.d/:\n\n```\nL %t/discord-ipc-0 - - - - app/com.discordapp.Discord/discord-ipc-0\n```\n\n"
    },
    {
      "title": "Discord becomes unresponsive during long calls",
      "level": 3,
      "content": "If Discord becomes unresponsive during long calls, try the --no-sandbox argument. You can also add the following to your .bashrc, or alias file for your shell:\n\n```\nalias discord='discord --no-sandbox'\n```\n\n"
    },
    {
      "title": "Discord freezes after getting pinged or messaged",
      "level": 3,
      "content": "If a message that would trigger a notification (pings, DMs, servers with notifications on, etc) causes the client to freeze, the client is failing to find a notification server. To fix it without installing a notifications server, disable Enable Desktop Notifications in the Notifications options.\n\n"
    },
    {
      "title": "Notification sounds do not work with PipeWire",
      "level": 3,
      "content": "See PipeWire#No notification sounds from Discord.\n\n"
    },
    {
      "title": "Emojis are not rendered correctly",
      "level": 3,
      "content": "If you encounter rendering issues regarding emojis (rendering as rectangles for example), discord-canary-electron-binAUR has the appropriate fonts as optional dependencies. You should install ttf-symbolaAUR, noto-fonts-cjk, and noto-fonts-emoji.\n\nttf-twemojiAUR is required for emoji to appear in channel names. Be sure to install 75-twemoji.conf to /etc/fonts/conf.d/, which doesn't happen by default.\n\n"
    },
    {
      "title": "Clicking link does not open the web browser",
      "level": 3,
      "content": "If clicking a link does not open a tab in your default web browser, you should install the xdg-utils optional dependency.\n\n"
    },
    {
      "title": "Blurry Discord icon in KDE Plasma system tray",
      "level": 3,
      "content": "You can attempt to fix this issue by installing libappindicator-gtk3 to replace libappindicator-gtk2, which is known to cause this issue.\n\n"
    },
    {
      "title": "Discord spams systemd journal",
      "level": 3,
      "content": "You may find that Discord creates a lot of messages in your journal in a format like:\n\n```\n(device_info_linux.cc:45): NumberOfDevices\n```\n\nTo disable the logging that causes this pollution: go to User Settings, select \"Voice & Video\", scroll to bottom of the screen and disable \"Debug Logging\".\n\n"
    },
    {
      "title": "No voice chat in a pure-ALSA environment",
      "level": 3,
      "content": "Discord’s desktop application relies on PulseAudio for voice chat and does not run on ALSA directly. Using apulse as a workaround is, in this case, deprecated. If you want to use Discord’s voice chat without PulseAudio or Pipewire, access Discord’s web client through a Chromium-based web browser. Alternatively, as a Chromium-based wrapper, Webcord works in pure-ALSA environments.\n\nIf you choose this route and are unable to unmute, i.e., to get permission to access your microphone, set it as default capture device in ~/.asoundrc. Also, in Discord, go to User Settings > Voice & Video > Input Device, and make sure Default is selected.\n\n"
    },
    {
      "title": "Notification badge is missing",
      "level": 3,
      "content": "Discord can display a badge showing the number of unread mentions on the taskbar icon. If the badge is not displayed, verify that the libunityAUR package is installed, as it is required for this feature to work.\n\nIf you are using KDE Plasma, you may need to manually set the environment variable XDG_CURRENT_DESKTOP=KDE5 before launching Discord.\n\n"
    },
    {
      "title": "Black screen on Wayland on NVIDIA proprietary driver",
      "level": 3,
      "content": "Discord on Wayland requires VA-API support, which the NVIDIA proprietary driver does not have. A translation layer such as libva-nvidia-driver can be used to get VA-API support.\n\n"
    },
    {
      "title": "Emotes are Squares",
      "level": 3,
      "content": "You need to install a font package that handles Emojis to get it to render properly.\n\n"
    },
    {
      "title": "Mic volume keeps lowering when Discord is active using Wireplumber",
      "level": 3,
      "content": "This can be fixed by removing some WirePlumber permissions to discord. Thanks to Martin Bartlett over on askubuntu.com for the solution.\n\n```\n~/.config/wireplumber/wireplumber.conf.d/99-stop-microphone-auto-adjust.conf\n```\n\n```\naccess.rules = [\n  {\n    matches = [\n      {\n        application.process.binary = discord\n      }\n    ]\n    actions = {\n      update-props = {\n        default_permissions = \"rx\"\n      }\n    }\n  }\n]\n```\n\nthen restart the whole audio stack.\n\n```\n$ systemctl --user restart wireplumber pipewire pipewire-pulse\n```\n\n"
    }
  ]
}