{
  "title": "Dispositivo de bloco",
  "url": "https://wiki.archlinux.org/title/Dispositivo_de_bloco",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Nomeação persistente de dispositivo de bloco\n\nFrom Wikipédia:\n\nNo Linux, eles estão no diretório /dev, de acordo com Filesystem Hierarchy Standard (padrão para sistema de arquivos hierárquico).\n\nNo Arch Linux, os nós de dispositivo são gerenciados pelo udev.\n\n"
    },
    {
      "title": "Dispositivos de bloco",
      "level": 2,
      "content": "Dispositivos de bloco fornecem acesso por buffer a dispositivos de hardware e permitem a leitura e escrita de qualquer tamanho e alinhamento.\n\n"
    },
    {
      "title": "Nomes de dispositivos de bloco",
      "level": 3,
      "content": "O início do nome do dispositivo especifica o subsistema de driver usado do kernel para operar o dispositivo de bloco.\n\n"
    },
    {
      "title": "SCSI",
      "level": 4,
      "content": "Dispositivos de armazenamento, como discos rígidos, SSDs e unidades flash, que possuem suporte a conexões de comando SCSI (SCSI, SAS, UASP), ATA (PATA, SATA) ou armazenamento em unidade USB são tratadas pelo subsistema de driver SCSI do kernel. Todas elas compartilham o mesmo esquema de nome.\n\nO nome desses dispositivos começa com sd. Ele é então seguido por uma letra minúscula começando de a para o primeiro dispositivo descoberto (sda), b para o segundo dispositivo descoberto (sdb) e assim por diante. As partições existentes em cada dispositivo serão listadas com o número que lhes é atribuído na tabela de partições, por exemplo, sda1 para a partição 1, sda2 para partição 2 e assim por diante.\n\nResumo:\n\n- /dev/sda - dispositivo a, o primeiro dispositivo descoberto.\n- /dev/sda1 - partição 1 no dispositivo a.\n- /dev/sde - dispositivo e, o quinto dispositivo descoberto.\n- /dev/sde7 - partition 7 on device e.\n\n"
    },
    {
      "title": "NVMe",
      "level": 4,
      "content": "O nome dos dispositivos de armazenamento, como SSDs, que estão conectados via NVM Express (NVMe) começa com nvme. É então seguido por um número iniciando em 0 para o controlador do dispositivo, nvme0 para o primeiro controlador NVMe descoberto, nvme1 para o segundo, e assim por diante. A próxima é a letra \"n\" e um número iniciando em 1 expressando o dispositivo em um controlador, ou seja, nvme0n1 para o primeiro dispositivo descoberto no primeiro controlador descoberto, nvme0n2 para o segundo dispositivo descoberto no primeiro controlador descoberto e assim por diante. As partições existentes em cada dispositivo serão listadas com a letra \"p\" e o número que lhes é atribuído na tabela de partições. Por exemplo, nvme0n1p para a partição com o número 1 no primeiro dispositivo descoberto no primeiro controlador descoberto, nvme0n1p2 para a partição 2, e assim por diante.\n\nResumo:\n\n- /dev/nvme0n1 - dispositivo 1 no controlador 0, o primeiro dispositivo descoberto no primeiro controlador descoberto.\n- /dev/nvme0n1p1 - partição 1 no dispositivo 1 no controlador 0.\n- /dev/nvme2n5 - dispositivo 5 no controlador 2, o quinto dispositivo descoberto no terceiro controlador descoberto.\n- /dev/nvme2n5p7 - partição 7 no dispositivo 5 no controlador 2.\n\n"
    },
    {
      "title": "MMC",
      "level": 4,
      "content": "Cartões SD, cartões MMC e dispositivos de armazenamento eMMC são manipulados pelo driver mmc do kernel e o nome desses dispositivos começa com mmcblk. É então seguido por um número iniciando em 0 para o dispositivo, ou seja, mmcblk0 para o primeiro dispositivo descoberto, mmcblk1 para o segundo dispositivo descoberto e assim por diante. As partições existentes em cada dispositivo serão listadas com a letra \"p\" e o número que lhes é atribuído na tabela de partições. A partição com o número 1 na tabela de partições seria mmcblk0p1, a partição com o número 2 seria mmcblk0p2, e assim por diante.\n\nResumo:\n\n- /dev/mmcblk0 - dispositivo 0, o primeiro dispositivo descoberto.\n- /dev/mmcblk0p1 - partição 1 no dispositivo 0.\n- /dev/mmcblk4 - dispositivo 4, o quinto dispositivo descoberto.\n- /dev/mmcblk4p7 - partição 7 no dispositivo 4.\n\n"
    },
    {
      "title": "Unidade de disco óptico SCSI",
      "level": 4,
      "content": "O nome de unidades de disco óptico (ODDs), que estão conectadas usando uma das interfaces suportadas pelo subsistema de driver SCSI, começa com sr. O nome é então seguido por um número iniciando em 0 para o dispositivo, isto é, sr0 para o primeiro dispositivo descoberto, sr1 para o segundo dispositivo descoberto e assim por diante.\n\nUdev também fornece /dev/cdrom que é um link simbólico para /dev/sr0. O nome sempre será cdrom independentemente do tipo de disco suportado ou a mídia inserida.\n\nResumo:\n\n- /dev/sr0 - unidade de disco óptico 0, a primeira unidade de disco óptico descoberta.\n- /dev/sr4 - unidade de disco óptico 4, a quinta unidade de disco óptico descoberta.\n- /dev/cdrom - um link simbólico para /dev/sr0.\n\n"
    },
    {
      "title": "lsblk",
      "level": 4,
      "content": "O pacote util-linux fornece o utilitário lsblk(8) para listar dispositivos de blocos, por exemplo:\n\n```\n$ lsblk -f\n```\n\n```\nNAME   FSTYPE   LABEL       UUID                                 MOUNTPOINT\nsda\n├─sda1 vfat                 C4DA-2C4D                            /boot\n├─sda2 swap                 5b1564b2-2e2c-452c-bcfa-d1f572ae99f2 [SWAP]\n└─sda3 ext4                 56adc99b-a61e-46af-aab7-a6d07e504652 /\n```\n\nNo exemplo acima, apenas um dispositivo está disponível (sda), e esse dispositivo tem três partições (sda1 para sda3), cada uma com um diferente sistema de arquivos.\n\n"
    },
    {
      "title": "wipefs",
      "level": 4,
      "content": "wipefs pode listar ou apagar assinaturas (strings mágicas) de sistema de arquivos, RAID ou tabela de partição do dispositivo especificado para tornar as assinaturas invisíveis para libblkid(3). Ele não apaga os sistemas de arquivos nem quaisquer outros dados do dispositivo.\n\nVeja wipefs(8) para mais informação.\n\nPor exemplo, para apagar todas as assinaturas do dispositivo /dev/sdb e criar um arquivo de assinatura backup ~/wipefs-sdb-posição.bak para cada assinatura:\n\n```\n# wipefs --all --backup /dev/sdb\n```\n\n"
    },
    {
      "title": "Pseudodispositivos",
      "level": 2,
      "content": "Nós de dispositivos que não têm um dispositivo físico.\n\n- /dev/random, veja random(4)\n- /dev/shm\n- /dev/null, /dev/zero, veja null(4)\n- /dev/full, veja full(4)\n- /dev/ttyX, sendo que X é um número\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Linux allocated devices — The Linux Kernel documentation\n- Gentoo:Device file\n\n"
    }
  ]
}