{
  "title": "Diğer dağıtımlarla karşılaştırıldığında Arch",
  "url": "https://wiki.archlinux.org/title/Di%C4%9Fer_da%C4%9F%C4%B1t%C4%B1mlarla_kar%C5%9F%C4%B1la%C5%9Ft%C4%B1r%C4%B1ld%C4%B1%C4%9F%C4%B1nda_Arch",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "İlgili makaleler\n\n- Arch Linux (Türkçe)\n- Arch-based distributions\n- Pacman/Rosetta\n- Arch is the best\n\nBu sayfa, Arch Linux ve diğer popüler GNU/Linux dağıtımları ve UNIX-benzeri işletim sistemleri arasındaki benzerlikleri göstermeyi amaçlar. Aşağıda verilmiş olan özetler Arch Linux'un sizin ihtiyaçlarınızı karşılayıp karşılamayacağına karar vermenize yardımcı olacak kısa açıklamalardır. Her ne kadar incelemeler ve tanımlamalar iş görse de karşılaştırmanın en iyi yolu dağıtımları test etmektir.\n\nDaha eksiksiz bir karşılaştırma için Wikipedia:Comparison of operating systems ve Wikipedia:Comparison of Linux distributions sayfalarına bakın.\n\nAşağıdaki bölümlerin tümünde, başka dağıtımlar ile sadece Arch Linux karşılaştırılmıştır. x86_64'den farklı mimarileri destekleyen topluluk dağıtımları (community ports) Arch-based distributions sayfasında listelenmiştir.\n\n"
    },
    {
      "title": "Kaynak temelli",
      "level": 2,
      "content": "Kaynak temelli dağıtımlar oldukça taşınabilirdir; tüm işletim sistemini ve uygulamaları, belli bir bilgisayar mimarisine veya kullanım alanına göre kontrol etme ve derleme avantajı sağlar; dezavantajı ise kaynaktan derlemenin zaman alan doğasıdır. Arch temeli ve tüm paketleri sadece x86_64 mimarisi için derlenirler.\n\n"
    },
    {
      "title": "CRUX",
      "level": 3,
      "content": "- CRUX, KISS (keep it simple stupid yani basit tut) prensibine odaklanan hafif bir dağıtımdır. CRUX, Judd Vinet'e Arch'ı yazma konusunda ilham vermiştir.\n- CRUX, BSD tipi başlangıç (init) betikleri kullanır, Arch ise systemd kullanır.\n- Arch yuvarlanan sürüm tipi bir sistem iken CRUX hemen hemen her yıl yeni sürüm yayınlar.\n- Her ikisi de ports benzeri bir sistem ile gelir ve yine ikisi de BSD gibi üzerine inşa edilebilecek bir temel ortam sağlar.\n- Arch, ikili (binary) sistem paketlerini yöneten ve Arch build system ile pürüzsüzce çalışan pacman ile ön plana çıkar. CRUX topluluk katılımlı bir sistem olan prt-get'i kullanır. Bu sistem, kendi ports sisteminin birleşimi ile bağımlılık çözünürlüğünü ele alır ancak tüm paketleri kaynaktan derler (fakat CRUX temel kurulumu ikili kod şeklindedir)\n- Hem Arch hem de CRUX resmî olarak sadece x86_64 mimarisini destekler.\n- Arch oldukça geniş ikili paket depolarına ve Arch User Repository'e sahiptir. CRUX ise, nispeten mütevazı topluluk depolarına ek olarak, daha az paket barındıran ve resmî olarak desteklenen bir ports sistemi sağlar.\n\n"
    },
    {
      "title": "LFS",
      "level": 3,
      "content": "- LFS, (veya Linux From Scratch yani Sıfırdan Linux) tamamen dokümantasyon amacıyla vardır. Kitap, kullanıcıya işlevsel bir GNU/Linux sistemi için minimal bir temel paket takımının kaynak kodunun nasıl edinilebileceğini, elle derlenebileceğini, yamalanabileceğini ve yapılandırılabileceğini anlatır. LFS olabildiğince minimaldir. Öğretici ve keyifli bir temel sistem kurulum ve kişiselleştirme süreci sağlar.\n- LFS herhangi bir çevrim içi depo sağlamaz; kaynaklar elle edinilir, derlenir ve make (paket yönetimi için birden fazla manuel yöntem bulunmaktadır ve LFS Hints'te bahsedilir) ile kurulur.\n- Arch, temel bir sistemde aynı paketleri, ek olarak systemd'yi, birkaç ekstra aracı ve hâlihazırda x86_64 için derlenmiş oldukça güçlü bir paket yöneticisi olan pacman'i sağlar. Arch temel sisteminin yanında, pacman ile kurulabilecek binlerce ikili paket ve Arch build system ile kullanılacak şekilde PKGBUILD yapım betikleri, Arch topluluğu ve geliştiricileri tarafından sağlanır ve bakımı yapılır. Arch aynı zamanda paketleri kişiselleştirmek ve elverişli bir şekilde inşa etmek için makepkg aracı ile gelir ve bu paketler pacman ile kurulabilir hâldedir.\n- Judd Vinet, Arch'ı temelden inşa etmiştir, sonrasında C ile pacman'i yazmıştır. Arch eskiden bazen mizahi olarak \"Güzel bir paket yöneticisi olan Linux\" şeklinde de tanımlanmıştır.\n\n"
    },
    {
      "title": "Gentoo/Funtoo Linux",
      "level": 3,
      "content": "- Hem Arch Linux hem de Gentoo Linux yuvarlanan sürüm sistemleridir, bu şekilde paketler yukarı akımda (upstream) yayınlandıktan kısa bir süre sonra dağıtımda da yayınlanırlar.\n- Gentoo paketleri ve temel sistemi kullanıcı tanımlı KULLANIM bayrakları doğrultusunda doğrudan kaynak kodundan inşa edilir. Arch paketleri kaynaktan inşa etmek için ports benzeri bir sistem sağlar. Ancak Arch temel sistemi, önceden inşa edilmiş x86_64 ikili programlar olarak kurulacak şekilde tasarlanmıştır. Bu iki özellik genellikle Arch'ın daha hızlı inşa edilebilmesini ve güncellenebilmesini, diğer yandan Gentoo'nun ise daha sistematik ve kişiselleştirilebilir olmasını sağlar.\n- Arch sadece x86_64'ü destekler, öbür yandan Gentoo resmî olarak x86 (i486/i686), x86_64, PPC/PPC64, SPARC, Alpha, ARM, MIPS, HPPA, S/390 ve Itanium mimarilerini destekler.\n- Gentoo'nun resmî paket ve sistem yönetim araçları, Arch'ınkilere kıyasla daha \"güçlü\" ve karışık olma eğilimindedir. Ve Gentoo'nun kalbi olan belli başlı özelliklerin (USE flags, SLOTs vb.) Arch Linux'ta doğrudan karşılığı bulunmamaktadır. Bu farklılıkların bazıları Arch'ın öncelik olarak ikili (binary) bir dağıtım olmasından kaynaklanır. Ancak Arch'ın mimari basitlik sağlamak ve gereksiz yere karmaşıklaştırmamak adına prensipli bir duruş sergilemesi gibi tasarım felsefesindeki farklılıklar da büyük rol oynar.\n- Arch'ın aksine Gentoo, resmî olarak hem systemd hem de OpenRC desteği sunmaktadır. Gentoo kullanıcıları, systemd'den memnunlar ise, Arch'ın diğer birçok yönüyle kendilerini genellikle rahat hissedeceklerdir.\n- Hem Gentoo hem de Arch kurulumları yalnızca temel bir sistem içerdiğinden, her ikisi son derece kişiselleştirilebilir olarak kabul edilir ve kullanıcının kararları ön plandadır.\n\n"
    },
    {
      "title": "GNU Guix Sistemi",
      "level": 3,
      "content": "- Arch'ın CRUX'tan ilham aldığı gibi GNU Guix System da NixOS'tan ilham almıştır.\n- Hem Arch Linux hem de Guix Sistemi yuvarlanan sürüm dağıtımlarıdır, bu şekilde paketlerin yukarı akımda (upstream) yayınlandıktan kısa bir süre sonra dağıtımda da erişilebilir olması sağlanır. Bununla birlikte Guix Sistemi öncelik olarak kaynak temelli bir dağıtımdır (Tabii önceden inşa edilmiş ikili paketler bulunur ve \"substitutes\" yani vekiller olarak adlandırılır) ancak Arch öncelik olarak ikili bir dağıtımdır.\n- Arch paket yöneticisi olarak pacman'i kullanır, oysaki Guix Sistemi başka dağıtımlarda olmayan deneysel paketleme özelliklerini destekleyen guix'i kullanır.\n- Arch sadece x86_64'ü destekler, Guix Sistem ise resmî olarak birçok mimariyi destekler.\n- Arch başlangıç sistemi olarak systemd'yi kullanır, Guix Sistemi ise GNU Shepherd adlı başlangıç sistemini kullanır.\n- Guix Sistemi, Dosya Sistemi Hiyerarşisi Standardı dahil geleneksel birçok Unix konsepti ile ters düşer. Örneğin, geleneksel dağıtımlarda dosyalar farklı birçok dizine dağıtılmış şekildedir, Guix Sistemi'nde ise /gnu/store/ dizinin altında bir yerde bulunurlar.\n- Arch nadiren özgür olmayan (genellikle sürücüler) yazılımlar sağlayabilir, ancak Guix Sistemi sadece özgür yazılım bulundurur ve Özgür Yazılım Vakfı standartlarına uygun bir dağıtımdır - tabii özgür olmayan yazılımlar sağlayan alternatif Guix depoları da bulunur\n- Arch, kullanıcıların yüklenen yazılım paketlerini doğrudan yapılandırmasını bekler, ancak Guix Sistemi, Scheme'de evrensel (global) sistem yapılandırmalarına teşvik eder. Bu şekilde yapılandırma dosyaları sırasıyla oluşturulur.\n\n"
    },
    {
      "title": "Genel",
      "level": 2,
      "content": "Bu dağıtımlar geniş bir avantajlar ve güçlü yanlar yelpazesi sunar ve pek çok kullanım amacına uygun hâle getirilebilir.\n\n"
    },
    {
      "title": "Debian",
      "level": 3,
      "content": "- Debian, daha büyük bir topluluğa sahip, en büyük üst akım Linux dağıtımıdır ve stable (kararlı), testing (deneme sürecinde), unstable (kararsız) dallarıyla, yüz binlerce pakete erişim sağlar. Erişilebilir Arch ikili (binary) paketlerinin sayısı daha azdır. Ancak AUR dahil edildiğinde paket sayıları karşılaştırılabilir düzeydedir.\n- Debian özgür yazılım konusunda daha şiddetli bir duruş sergiler ancak yine de özgür olmayan depolarına özgür olmayan yazılımları dahil eder. Arch ise GNU Vakfı'nın tanımı ile özgür olmayan paketler konusunda daha hoşgörülü ve kapsayıcıdır.\n- Debian \"dondurulmuş\" ve beş yıl boyunca desteklenen Stable (Kararlı) dalında sıkı sınamalara odaklanır. Arch paketleri ise Debian Stable'a kıyasla daha günceldir, Debian Testing'e ve Debian Unstable'a daha yakın bir tutum sergiler ve yayın planı düzenli değildir.\n- Debian alpha, arm, hppa, i386, x86_64, ia64, m68k, mips, mipsel, powerpc, s390 ve sparc gibi birçok mimariyi destekler; Arch ise sadece x86_64'ü destekler.\n- Arch, dış kaynaklardan, özel ve kurulabilir paketler inşa etmek için, ports benzeri paket inşa etme sistemi ile, daha elverişli bir destek sunar. Debian ise herhangi bir ports sistemi sunmaz ve geniş ikili paket depolarına güvenir.\n- Arch kurulum sistemi sadece minimal bir temel sunar ve sistem yapılandırması süresince oldukça şeffaf bir şekilde kullanıcı tarafından kullanılır, oysa Debian'ın metotları, önceden seçilmiş paket gruplarını indirmek için apt görevlerinin kullanılması gibi, daha otomatik olarak yapılandırmaya yönelik bir yaklaşım sergiler, tabii bunun yanında alternatif indirme metotları da sunar.\n- Arch, yazılım kütüphanelerini genellikle başlık dosyaları ile birlikte paketler, Debian'da ise başlık dosyalarının ayrıca indirilmesi gerekir.\n- Arch yamalamayı en az seviyede tutmaya çalışır, böylece yukarı akımın değerlendiremeyeceği sorunlardan kaçınmış olur; oysa Debian, paketleri daha geniş bir topluluk için daha özgürce yamalar.\n\n"
    },
    {
      "title": "Fedora",
      "level": 3,
      "content": "- Fedora Linux, Red Hat® Enterprise Linux'un yukarı akışlı (upstream), topluluk dağıtımıdır. Red Hat projenin ana sponsorudur, ancak binlerce bağımsız geliştirici de Fedora'ya katkıda bulunmaktadır. Paketler ve projeler Fedora'da yayınlanır, özgün testler ve kalite güvence süreçleri aracılığıyla bu özellikler CentOS Stream'e geçer ve neticede Red Hat Enterprise Linux'un bir sürümüne dahil edilir ve bazıları zamanla diğer dağıtımlar tarafından benimsenir. Arch'ın sabit bir sürümü yoktur ve diğer birçok dağıtım Arch Linux'u temel alsa bile (örneğin Steam Deck için SteamOS) başka bir dağıtım için bir dal olarak hizmet etmez.\n- Fedora paketleri, DNF paket yöneticisini ve RPM paket formatını kullanır. Arch, paketlerini yönetmek için pacman kullanır. Her iki projenin de birçok paketi, özellikle masaüstü ortamları, 'sade' ve özelleştirilmemiştir.\n- Fedora, özgür yazılıma olan adanmışlığı sebebiyle resmî depolarında özgür olmayan yazılımlar bulundurmayı reddeder, ancak üçüncü parti depolar bu tip paketler için müsaittir. Arch özgür olmayan yazılıma olan eğiliminde daha hoşgörülüdür ve muhakemeyi kullanıcıya bırakır.\n- Fedora, görsel arayüzlü Anaconda kurulum sihirbazını kullanır ve birçok kurulum yansıması sunar. Temel bir sistem kurulumundan tam teşekküllü bir masaüstü ortamına kadar tüm seçenekleri barındıran kurulum yansımaları bulunur. Ek olarak Fedora \"spin\"leri alternatif masaüstü ortamları ve mütevazı varsayılan paket yelpazeleri sağlar. Öte yandan Arch, minimal bir temel sistemi komut satırından kurmak üzere tasarlanmıştır, bu nedenle süreci kolaylaştırmak için basit betikler (script) sağlar.\n- Fedora, 6 aylık düzenli bir sürüm döngüsüne sahiptir, ancak DNF ile sürüm yükseltemlerini resmi olarak destekler. Arch, yuvarlanan sürüm modelinde bir sistemdir.\n- Arch bir ports sistemine sahipken Fedora'da bu özellik yoktur.\n- Hem Arch hem de Fedora deneyimli kullanıcıları ve geliştiricileri hedeflemektedir. Her iki proje de, kullanıcılarını projeye katkıda bulunmaya teşvik etmektedir.\n- Fedora, SELinux entegrasyonu, GCJ derlenmiş paketleri (Oracle'ın JRE'sine olan ihtiyacı ortadan kaldırmak için) ve Linux çekirdeğine oldukça fazla yukarı akış (upstream) katkısı ile önemli düzeyde topluluk takdiri kazanmıştır. Red Hat ve dolayısıyla Fedora geliştiricileri, diğer projelerle karşılaştırıldığında Linux çekirdek koduna en çok katkıda bulunan topluluktur.\n- Arch Linux ise, en kapsamlı ve tamamlanmış dağıtım wikisi olarak addedilen ArchWiki'yi sağlar. Fedora Wiki ise \"wiki\" kelimesinin tam anlamıyla hakkını vermek için ya da geliştiriciler, test ediciler ve kullanıcılar arasında bilgi alışverişi sağlamak için kullanılır. Arch'ınki gibi son kullanıcının faydası odaklı değildir. Fedora'nın wiki'si bir sorun izleyiciyi (issue tracker) veya kurumsal bir wikiyi andırır.\n\n"
    },
    {
      "title": "Slackware",
      "level": 3,
      "content": "- Slackware BSD tarzı init betikleri (script) kullanırken Arch systemd kullanır.\n- Arch; pacman ile, Slackware'in standart araçlarından farklı olarak, otomatik bağımlılık çözümü sunan ve daha otomatik sistem yükseltmelerine izin veren bir paket yönetim sistemi sağlar. Slackware kullanıcıları genellikle manuel bağımlılık çözümleme yöntemini tercih ederler ve bu sebeple derinlemesine sistem kontrolüne sahiptirler. Ek olarak muazzam düzeyde önceden yüklenmiş kütüphanelere ve bağımlılıklara sahiptir.\n- Arch sürekli yayın yapan bir sistemdir. Slackware sürüm döngüsü ise daha muhafazakardır ve kararlılığı ispatlanmış paketleri tercih eder. Arch bu açıdan daha yenilikçidir.\n- Arch Linux resmi depolarında binlerce ikili (binary) paket sunarken, Slackware resmi depoları daha mütevazıdır.\n- Arch, gerçek bir ports benzeri sistem olan Arch build system'i ve ayrıca kullanıcılar tarafından katkıda bulunulan çok geniş bir PKGBUILD koleksiyonu olan AUR'u sunmaktadır. Slackware, slackbuilds.org adresinde, benzer ancak daha küçük bir ports sistemi sunar. slackbuilds.org, Arch PKGBUILD'lerine benzer olan Slackbuilds'in yarı resmi bir deposudur. Slackware kullanıcıları, Arch'ın çoğu yönüyle genel anlamda rahat hissedeceklerdir.\n\n"
    },
    {
      "title": "Acemi dostu",
      "level": 2,
      "content": "Kimi zaman \"çaylak dağıtımları\" olarak da adlandırılan acemi dostu dağıtımlar birçok konuda benzerlik gösterir ancak Arch bu dağıtımlardan biraz daha farklıdır. Eğer GNU/Linux'u küçük bir temel sistem inşa ederek öğrenmek istiyorsanız, kurulum süreçleri karşılaştırıldığında daha az paket yüklendiği için, Arch daha iyi bir seçenek olabilir. Dağıtımlar arasındaki belirli farklılıklar aşağıda açıklanmıştır.\n\n"
    },
    {
      "title": "Ubuntu",
      "level": 3,
      "content": "- Ubuntu ticari olarak Canonical Ltd. tarafından desteklenen Debian temelli popüler bir dağıtımdır, Arch ise bağımsız olarak geliştirilmiş ve sil baştan inşa edilmiş bir sistemdir.\n- İki proje çok farklı amaçlara sahiptir ve hedef kullanıcı kitlesi de yine oldukça farklıdır. Arch, kendin yap metodunu tercih eden kullanıcılar için tasarlanmıştır, Ubuntu ise önceden yapılandırılmış bir sistem sağlar. Arch temel kurulumdan başlayarak daha basit bir tasarım sunar ve kullanıcının kendi spesifik ihtiyaçlarına göre kişiselleştirmesine dayanır. Birçok Arch kullanıcısı öncesinde Ubuntu ile başlayıp Arch'a geçiş yapmıştır.\n- Arch'ın geliştirilmesi topluluğun sağladığı desteğin ötesinde hiçbir kullanıcı arayüzüne yönelimli değildir. Buna ek olarak, Canonical'in ticarî doğası, Unity'nin Dash menüsüne reklamlar eklemek; Snap ve kapalı kaynaklı Snap Store'u geliştirmek, kullanmaya teşvik etmek ve entegre etmek; kullanıcıların verilerini toplamak gibi bazı tartışmalı kararlar almasına yol açmıştır. Arch hiçbir ticarî gündemi olmayan, topluluk tarafından sürdürülen ve bağımsız bir projedir.\n- Ubuntu 6 ayda bir birbirinden ayrık yayınlar yapar, Arch ise yuvarlanan sürüm tipi bir sistemdir.\n- Arch ports benzeri bir paket inşa etme sistemini ve kullanıcıların pacman paket yöneticisi için kaynak paketleri paylaşabildiği Arch User Repository'i (Arch Kullanıcı Deposu) sunar. Ubuntu ise daha karmaşık bir paket yöneticisi olan apt'yi ve Snap'i sunar ve Personal Package Archives (Kişisel Paket Arşivleri) ile ikili paketlerin tekrar dağıtımına olanak sağlar.\n- Bu iki dağıtımın toplulukları da birçok yönden farklıdır. Arch topluluğu daha küçüktür ve dağıtıma katkıda bulunmaları şiddetle teşvik edilir. Buna karşın Ubuntu topluluğu görece daha büyüktür ve geliştirmeye, paketlemeye ve depo bakımına aktif olarak katkıda bulunmayan daha fazla kullanıcı oranına tolerans gösterebilir.\n\n"
    },
    {
      "title": "Linux Mint",
      "level": 3,
      "content": "- Linux Mint, Ubuntu'nun bir çeşidi olarak doğmuş, sonrasında Debian'dan temel alınmış LMDE'yi (Linux Mint Debian Sürümü) eklemiştir. Öte yandan Arch bağımsız bir dağıtımdır, kendi inşa sistemine ve depolarına dayanır.\n- Mint sürdürülebilirliği kolaylaştırmak için 'MintTools' olarak adlandırılan çeşitli çizgesel (graphical) araçlarla gelir. Arch sadece pacman gibi basit komut satırı araçları sağlar ve sistem yönetimini kullanıcıya bırakır.\n- Mint'in yeni sürümleri, Ubuntu'dan yaklaşık bir ay sonra, her altı ayda bir yayınlanır. Her yeni sürümde Ubuntu LTS'in son sürümü temel alınır ve beş yıl boyunca desteklenir. LinuxMint Debian Sürümü'nde (LMDE) Debian Stable temel alınır ve sadece Mint paketleri ve güvenlik geliştirmeleri için güncelleme alır. Arch ise tamamı ile yuvarlanan sürüm mantığıyla çalışan bir dağıtımdır.\n\n"
    },
    {
      "title": "openSUSE",
      "level": 3,
      "content": "openSUSE, aslında SUSE Linux'tan türetilmiş bir dağıtımdır ve SUSE (SUSE Enterprise Linux'un yaratıcıları) tarafından desteklenmektedir. SUSE Enterprise Linux Desktop (SLED), openSUSE Tumbleweed temellidir ve openSUSE Leap ile benzer bir kod temeli paylaşmaktadır.\n\n- OpenSUSE Zypp paket yöneticisini (komut satırında zypper), RPM paket formatını ve RPM'in çokça sevilen YaST2 görsel arayüzlü yapılandırma aracını kullanır. Arch tar.zstd paketlerini yönetmek için pacman'i kullanır ve görsel arayüzlü bir yapılandırma aracı sunmaz.\n- openSUSE 2 farklı sürüm sunar: Leap, uzun vadeli destek sağlayan openSUSE sürümüdür ve aralıklı yayınlar sunar. Tumbleweed ise openSUSE'nin yuvarlanan sürümüdür.\n- Buna karşın Arch, kesin surette yuvarlanan sürüm modelini benimser ve uzun aralıklı yayınlar sunmaz. Bütün bir masaüstü ortamı yerine minimal ve temel bir sistem kurulumu sunar. Bu sebeple openSUSE; görsel arayüz (GUI) odaklı, otomatik olarak yapılandırılmış veya açılır açılmaz işlevsel ancak yine de her dağıtımdaki gibi kişiselleştirmeler sunan bir sistem isteyen kullanıcılar için uygun olabilir.\n\n- Leap, uzun vadeli destek sağlayan openSUSE sürümüdür ve aralıklı yayınlar sunar.\n- Tumbleweed ise openSUSE'nin yuvarlanan sürümüdür.\n\n"
    },
    {
      "title": "Mandriva/Mageia",
      "level": 3,
      "content": "Mandriva Linux (eskiden Mandrake Linux) 1998'de GNU'Linux'u herkes için daha kolay hâle getirmek amacı ile oluşturulmuştur; RPM temellidir ve urpmi paket yöneticisini kullanır. Mageia, eski Mandriva çalışanları tarafından, Mandriva'nın ticarî konumuna başkaldırma amacıyla oluşturulmuş, kar amacı gütmeyen ve topluluğa dayanan bir Mandriva çatalıdır. Arch, Mandriva veya Mageia'ya kıyasla daha kolay bir yaklaşım sergiler, metin tabanlı olup elle yapılandırmaya dayanır ve böylece orta veya ileri seviye kullanıcıları hedefler.\n\n"
    },
    {
      "title": "BSD'ler",
      "level": 2,
      "content": "- BSD'ler ortak bir köken paylaşır ve UC Berkeley'de yapılmış projeden miras kalmıştır. Özgürce dağıtılabilir ve ücretsiz bir UNIX sistemi oluşturma amacı güdülmüştür. GNU/Linux dağıtımları değil, UNIX benzeri işletim sistemleridir ve orijinal AT&T UNIX kodundan türemişlerdir.\n- Arch ve BSD'ler sıkıca entegre edilmiş temel sistem ve ports sistemi konseptlerini paylaşırlar. Yine de Arch gibi GNU/Linux dağıtımlarının aksine BSD'lerin çekirdekleri ve kullanıcı programları (kabuk, ls, cp, cat ve ps gibi temel araçlar gibi) birlikte tek bir kaynak deposunda geliştirilir.\n- BSD lisansı serbesttir. Aksine GPL, lisanslanan projelerin çeşitlerinin de aynı lisans ile yayınlanması gibi koşullar barındırır. Arch GPL ile yayınlanır.\n- BSD çeşitleri hakkında daha fazla bilgi edinmek için Wikipedia:Comparison of BSD operating systems makalesine bakın.\n\n"
    },
    {
      "title": "Ayrıca bakınız",
      "level": 2,
      "content": "- DistroWatch - Linux dağıtım haberleri ve incelemeleri\n\n"
    }
  ]
}