{
  "title": "DKMS",
  "url": "https://wiki.archlinux.org/title/DKMS",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From Wikipedia:\n\nThis means that a user does not have to wait for a company, project, or package maintainer to release a new version of the module. Since the introduction of pacman hooks, the rebuild of the modules is handled automatically when a kernel is upgraded.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dkms package and the headers for the target kernel/kernels. For example, for the default linux kernel this would be linux-headers. Other kernels have their own respective headers packages.\n\nA good number of modules that lie outside the kernel source tree have a DKMS variant; a few are hosted in the official repositories, most are found in the AUR.\n\n"
    },
    {
      "title": "Upgrades",
      "level": 2,
      "content": "Though the rebuild of the DKMS modules is usually seamless during a kernel upgrade, it may still happen that the rebuild fails. You should pay extra attention to the pacman output. This applies in particular if the system relies on the DKMS module to boot successfully and/or if you use DKMS with a custom kernel not in the official repositories.\n\nTo deal with changes in the kernel, fix bugs, or add necessary features consider upgrading the DKMS package before rebooting.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Usage for invoking DKMS manually.\n\nTab-completion is available by doing:\n\n```\n# source /usr/share/bash-completion/completions/dkms\n```\n\n"
    },
    {
      "title": "List modules",
      "level": 3,
      "content": "To list the current status of modules, versions and kernels within the tree:\n\n```\n# dkms status\n```\n\n"
    },
    {
      "title": "Rebuild modules",
      "level": 3,
      "content": "Rebuild all modules for the currently running kernel:\n\n```\n# dkms autoinstall\n```\n\nor for a specific kernel:\n\n```\n# dkms autoinstall -k 3.16.4-1-ARCH\n```\n\nTo build a specific module for the currently running kernel:\n\n```\n# dkms install -m nvidia -v 334.21\n```\n\nor simply:\n\n```\n# dkms install nvidia/334.21\n```\n\nTo build a module for all kernels:\n\n```\n# dkms install nvidia/334.21 --all\n```\n\n"
    },
    {
      "title": "Remove modules",
      "level": 3,
      "content": "To remove a module (old ones are not automatically removed):\n\n```\n# dkms remove -m nvidia -v 331.49 --all\n```\n\nor simply:\n\n```\n# dkms remove nvidia/331.49 --all\n```\n\nIf the package dkms is removed the information regarding previous module build files is lost. If this is the case, go through /usr/lib/modules/kernel_release and /var/lib/dkms/package_name and delete all files and directories no longer in use.\n\n"
    },
    {
      "title": "DKMS package creation",
      "level": 2,
      "content": "See DKMS package guidelines.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Linux Journal: Exploring Dynamic Kernel Module Support\n\n"
    }
  ]
}