{
  "title": "Doom",
  "url": "https://wiki.archlinux.org/title/Doom",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From Wikipedia:\n\nFollowing Doom's success, the source code for the Doom engine was released under GNU GPLv2 in 1997 by John Carmack (the original source code can be found at https://github.com/id-Software/DOOM). It now lives on in multiple ports, though you will still need to have a copy of the original game's data to play it and Doom 2 (also called the \"IWAD\").\n\n"
    },
    {
      "title": "Games/WADs",
      "level": 3,
      "content": "Also see List of games#Shooters (FPS, third person) for more Doom-related packages\n\n"
    },
    {
      "title": "Freedoom",
      "level": 4,
      "content": "Freedoom aims to be a completely free and open source reimagining of Doom. Install freedoomAUR.\n\n"
    },
    {
      "title": "Doom Shareware",
      "level": 4,
      "content": "The doom1-wadAUR package supplies the original Doom shareware IWAD.\n\n"
    },
    {
      "title": "GZDoom",
      "level": 4,
      "content": "An updated version of ZDoom, GZDoom is the go-to standard for compatibility with the most games based on the Doom engine. Install the gzdoomAUR package to install it.\n\n"
    },
    {
      "title": "Chocolate Doom",
      "level": 4,
      "content": "Chocolate Doom is a port that tries to be as historically-accurate to the original games as possible. Install chocolate-doomAUR.\n\n"
    },
    {
      "title": "DOOM Retro",
      "level": 4,
      "content": "DOOM Retro is based off of Chocolate Doom, but tailored to the project author's taste. Install doomretro.\n\n"
    },
    {
      "title": "Editors",
      "level": 3,
      "content": "There exist a number of editors to manipulate the data in Doom WADs in order to create maps, weapons, and even whole games using the Doom engine.\n\n"
    },
    {
      "title": "SLADE",
      "level": 4,
      "content": "SLADE is a WAD inspector, allowing users to see and modify the data lumps within, such as textures, sprites, scripts and info lumps. Install the sladeAUR package to install SLADE3.\n\n"
    },
    {
      "title": "Ultimate Doom Builder",
      "level": 4,
      "content": "Specifically a map editor, Ultimate Doom Builder is written in .NET, and is the de-facto standard for creating Doom maps. Install ultimate-doom-builder-gitAUR.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Most Doom maps and mods will require a Doom or Doom 2 IWAD to work.\n\n"
    },
    {
      "title": "GZDoom",
      "level": 3,
      "content": "The base GZDoom config file is located under ~/.config/gzdoom/gzdoom.ini.\n\nTo add the directory containing your IWADs so that GZDoom can see it, add the following to the config file underneath [IWADSearch.Directories]:\n\nPath=<path>,\n\nwhere <path> is the path to where your IWADs are.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "A good resource for troubleshooting GZDoom is the ZDoom Wiki. It also has good resources on mapping, scripting, and other information when creating for Doom.\n\n"
    }
  ]
}