{
  "title": "Dynamic disks",
  "url": "https://wiki.archlinux.org/title/Dynamic_disks",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Dynamic disks, enabled by the Logical Disk Manager (LDM), is a technology for Microsoft Windows that is similar to LVM and mdadm.\n\n"
    },
    {
      "title": "General consideration for Linux usage",
      "level": 2,
      "content": "In general it is not recommended to convert the disk drive to host your Linux into a dynamic disk. This is because:\n\n- In a dynamic disk, an entire disk is put in a one, big partition. (More precisely, a GPT dynamic disk will have one big partition for data and the other, one small metadata partition. An MBR dynamic disk has a sole partition. See How Dynamic Disks and Volumes Work in microsoft.com.)\n- To turn a disk to a dynamic disk, all existing partitions have to be recognized by Windows - Linux partitions (ext4, btrfs, lvm, you name it) are out!\n\nProbably the sole case you want to use dynamic disks is when you use RAID in Windows.\n\nDynamic disks cannot be used on removable disks, either.\n\n"
    },
    {
      "title": "Usual course",
      "level": 3,
      "content": "LVM and mdadm are the preferred tools under Arch Linux. However, if the system is being dual-booted with Windows, Windows will not be able to read these setups. The usual course then is to attempt to use fakeraid using dmraid or to use network storage. However, network storage retrieval will be capped to 1Gb/s (119MiB/s) and getting RAID drivers loaded on an existing Windows installation can be daunting (if not impossible) if the Windows OS partition is installed on a drive that is on the very controller that you want to switch from AHCI to RAID. Even if you have a spare AHCI controller card, your system may not have enough space to hold two Option ROMs.\n\n"
    },
    {
      "title": "Terminology",
      "level": 2,
      "content": "Read \"spanned volume\" of a dynamic disk as a \"logical volume\" in Linux LVM, and \"striped volume\" as RAID0.\n\n"
    },
    {
      "title": "Installing support for dynamic disks",
      "level": 2,
      "content": "Install the libldm package. Once installed, ldmtool can be used to query and mount dynamic disks.\n\n"
    },
    {
      "title": "Mandatory preparation",
      "level": 3,
      "content": "To create device mappers, simply do:\n\n```\n# ldmtool create all\n```\n\nThis populates /dev/mapper with volumes under LDM. Once this is done, they become accessible in a usual manner, say by:\n\n```\n# mount -t ntfs /dev/mapper/LDM volume /mnt/mountpoint\n```\n\n"
    },
    {
      "title": "Other commands",
      "level": 3,
      "content": "To find all disk groups:\n\n```\n# ldmtool scan\n```\n\nTo find what volumes a disk group contains:\n\n```\n# ldmtool show diskgroup diskgroup UUID\n```\n\nTo create individual device mappers:\n\n```\n# ldmtool create volume volume name\n```\n\nTo create device mappers for all volumes in a disk group:\n\n```\n# ldmtool create volume diskgroup UUID\n```\n\n"
    },
    {
      "title": "Systemd",
      "level": 2,
      "content": "To get dynamic disks to behave like filesystems natively supported by the Linux kernel, enable ldmtool.service.\n\nOnce this setup is complete, you can add entries to /etc/fstab that reference dynamic disk volumes and have those mounted like any other volume.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Basic and Dynamic Disks (Microsoft site)\n- Working with Basic and Dynamic Disks (Microsoft site)\n- wikipedia:Dynamic disk\n\n"
    }
  ]
}