{
  "title": "Enterprise wechat",
  "url": "https://wiki.archlinux.org/title/Enterprise_wechat",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Wine\n- Deepin-wine\n\nConnecting over a billion people around the world, WeChat is a free messaging and calling app available on iOS, Android, Windows, and MacOS.\n\nThis article introduces methods of installing WeChat on Arch Linux.\n\n"
    },
    {
      "title": "Native Linux version",
      "level": 2,
      "content": "Wechat has released an official new version for Linux, which supports Mini Programs, Moments, VoIP and more. It is provided by wechat-binAUR.\n\nwechatAUR provides optional sandbox support and other fixes for input method, HiDPI, background portal, hybrid GPU workarounds and more. Extra path can be exposed to the sandbox by environment variable bwBindPar.\n\nXMODIFIERS environment variable is required for this package to use input method, which currently supports Fcitx5, iBus and SCIM (untested). Consult the respective pages for their configuration.\n\nThere are unofficial Flatpak packages for Wechat: [1] and [2].\n\nwechat-universal-bwrapAUR is based on the now defunct wechat-uos-qt. Users can copy ~/Documents/xwechat_files into ~/.local/share/WeChat_Data/Documents if automatic migration fails.\n\n"
    },
    {
      "title": "Virtual machine",
      "level": 2,
      "content": "You can install Windows system in virtual machines such as VMware or VirtualBox to use WeChat.\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "The compatibility layer Wine can be used to run WeChat within Linux.\n\nIn addition, it is also provided by deepin-wine-wechatAUR[broken link: package not found] (without patch), which is a Wine container configured for Arch. The WeChat version is the latest official version.\n\n"
    },
    {
      "title": "From archlinuxcn repository",
      "level": 4,
      "content": "If the WeChat shadow window is displayed on top of other windows during use, you can try to use wine-for-wechat in the archlinuxcn repository. This version of Wine uses a patch for WeChat shadow windows.\n\nBesides, it is recommended to install, run, and configure WeChat using wine-wechat-setup. Note that WeChat installer needs to be downloaded manually.\n\n"
    },
    {
      "title": "Deepin-wine WeChat",
      "level": 4,
      "content": "Install the com.qq.weixin.deepinAUR package, or com.qq.weixin.sparkAUR from Spark Store. There are other deepin wine related packages such as com.qq.weixin.work.deepinAUR for Weixin Work. See Deepin-wine for detail.\n\n"
    },
    {
      "title": "Run in a container",
      "level": 4,
      "content": "docker-wechat run WeChat wine application in a Docker container.\n\n"
    },
    {
      "title": "HiDpi configuration",
      "level": 4,
      "content": "The font is very small on high dpi screen. To set wine dpi configuration:\n\n1. Open winecfg. Take deepin-wine-wechatAUR[broken link: package not found] as an example, change WINEPREFIX and deepin-wine6-stable accordingly:$ WINEPREFIX=~/.deepinwine/Deepin-WeChat/ deepin-wine6-stable winecfg\n1. Click on the Graphics tab, change Screen resolution to your actual dpi.\n1. Start Wechat, enable Adapt to system scale (设置-->通用设置-->适配系统缩放比例).\n\n```\n$ WINEPREFIX=~/.deepinwine/Deepin-WeChat/ deepin-wine6-stable winecfg\n```\n\n"
    },
    {
      "title": "Electron version for UOS",
      "level": 2,
      "content": "Note: **This article or section is being considered for removal.** This article or section is being considered for removal.\n\nThis article or section is being considered for removal.\n\nwechat-uosAUR[broken link: package not found] provide the old electron app released for UOS.\n\n"
    }
  ]
}