{
  "title": "F@H",
  "url": "https://wiki.archlinux.org/title/F@H",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nHelp scientists studying Alzheimer's, Huntington's, Parkinson's, and SARS-CoV-2 by simply running a piece of software on your computer. Add your computer to a network of millions of others around the world to form the world's largest distributed supercomputer.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the foldingathomeAUR package. In order to use your GPU for folding (highly recommended), you will need ocl-icd and the appropriate OpenCL package for your GPU. NVIDIA users can also use CUDA.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "start/enable fah-client.service to start the backend.\n\nThe Folding@home software is controlled via a web browser using Web Control, which is accessed at https://v8-4.foldingathome.org/[1]. Your local machine should appear under the \"Machines\" subpage. By pressing the settings cog icon you can change Account Settings, Scheduling, and Resource Usage.\n\nTo start folding, on the \"Machines\" page press \"Fold All\".\n\n"
    },
    {
      "title": "The terminal way",
      "level": 3,
      "content": "The current version of Folding@home does not support editing config through the terminal. You should use the Web Control accessible at https://v8-4.foldingathome.org/.\n\n"
    },
    {
      "title": "Account Settings",
      "level": 3,
      "content": "- Username: Choose the name for your Folding@home account. Since it does not have to be unique, others could have the same Username as you. If you wish to remain anonymous you can use the username \"Anonymous\".\n- Team: Choose which team you would like to join. (the Arch Linux team number is 45032)\n- Passkey: To uniquely identify you. Though not needed, it provides some measure of security. You can obtain a passkey from https://apps.foldingathome.org/passkey/create.[2]\n- Cause: Choose which cause you wish to donate to. By default uses \"any\".\n\n"
    },
    {
      "title": "Scheduling",
      "level": 3,
      "content": "- Only When Idle: Will only donate when the system is not being used.\n- While On Battery: Will donate even when the system is running on battery power.\n- Keep Awake: Will prevent the system from sleeping/hibernating while the machine is not on battery power.\n\n"
    },
    {
      "title": "Resource Usage",
      "level": 3,
      "content": "- CPUs: Choose the number of threads will be donated.\n- GPUs: Choose which GPUs should be used for folding.\n\n"
    },
    {
      "title": "Run f@h with limited privileges",
      "level": 3,
      "content": "The updated version of foldingathomeAUR package (>7.6.9) already runs as a limited user. It also installs a systemd user script that you can use, which users without root access can enable (you will still need video group access to be able to use the GPU).\n\n"
    },
    {
      "title": "Monitoring work-unit progress",
      "level": 2,
      "content": "There are several ways of monitoring the progress of your FAH clients, both on the command line and by GUI.\n\nFolding@home writes its log file to the data directory. By checking out a few last lines you can check its progress, e.g. tail -10 /var/log/foldingathome/log.txt.\n\nThe fahcontrolAUR software distributed by folding at home provides you with efficient means to control both local and remote hosts. Just add another client with the corresponding button \"Add\" and enter the name, IP address, port and password (if you set one) and hit save. The software should now try to establish a connection to the remote host and show you the progress in a separate client tab.\n\nFor checking NVIDIA GPU utilisation, core temperature and power usage, nvtop can be used. For AMD GPUs, use radeontop.\n\n"
    },
    {
      "title": "“Disabled” on AMDGPU",
      "level": 3,
      "content": "Navi 10 based GPUs and later suffer from ROCm conflicting with Folding@home's shipped libstdc++ library. In order to fix this, try to apply this temporary workaround[3]:\n\n- start Folding@home, and wait for the GPU to fail;\n\n- replace Folding@home's current core's libstdc++.so.6 by your system's own library, e.g., /usr/lib/libstdc++.so.6.\n\nThe fix will stop working when a new Folding@home core version is released: it will need to be reapplied.\n\nIf it's not working yet, try editing /etc/foldingathome/config.xml file to attempt to autoconfigure GPUs:\n\n```\n<gpu v='true'/>\n```\n\nIt if it's not working, you may wish to try using either rocm-opencl-runtime or opencl-amdAUR. Mesa OpenCL implementations are unlikely to work.\n\nIf you still receive errors that the GPU is disabled, check if opencl-clover-mesa and opencl-rusticl-mesa are installed and remove them so they do not conflict.\n\nIf it still does not work, make sure that there is only one vendor listed in /etc/OpenCL/vendors; Folding@home will not work correctly if there are multiple vendors.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Folding@home main site\n- Folding@home FAQ\n- Folding@home Configuration Guide[dead link 2025-01-19 ⓘ]\n- Arch Folding@home team page\n- Extended Arch team statistics in extremeoverclocking.com\n\n"
    }
  ]
}