{
  "title": "Flameshot",
  "url": "https://wiki.archlinux.org/title/Flameshot",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Screen capture\n\nFlameshot is a program for taking screenshots. It has an interactive GUI with controls to select the desired capture region, move and resize the capture window, make edits with common drawing tools (pencil, line, rectangle, circle, blur, undo/redo), and choose the output destination (copy to clipboard, save to disk, upload to Imgur, open with another program).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the flameshot package, or flameshot-gitAUR for the development version.\n\n"
    },
    {
      "title": "Sub-commands exit immediately with no output",
      "level": 3,
      "content": "You can start Flameshot as a background process at any time during your X session:\n\n```\n$ flameshot &\n```\n\n"
    },
    {
      "title": "No tray icon",
      "level": 3,
      "content": "There are probably other ways to do this. Here is just one way.\n\nInstall gnome-shell-extension-topicons-plusAUR\n\nThen in the gnome tweaks application (may also need to download if you do not have it installed):\n\n1. Click on the Extensions tab\n1. Enable \"Topicons plus\" so it moves the legacy tray icons to the top panel\n1. Done!\n\n"
    },
    {
      "title": "Flameshot does not use currently visible windows",
      "level": 3,
      "content": "You may encounter this issue if you have installed xf86-video-intel.\n\nSimply remove the xf86-video-intel package and make sure there is no dangling X11 configuration for the package under /etc/X11/xorg.conf.d/.\n\nThen reboot the system.\n\nThis was discussed in an issue on the Flameshot Github repository: https://github.com/flameshot-org/flameshot/issues/1677.\n\n"
    },
    {
      "title": "Flameshot selection area selects very slowly in Wayland",
      "level": 3,
      "content": "PR #2766 has made selecting an area to screenshot very slow. It's being tracked in issue #3039, with a potential fix in PR #3059. Another work around is to use version 12.1.0-1 which does not have this issue.\n\n"
    },
    {
      "title": "Flameshot starts with an error on Sway / wlroots",
      "level": 3,
      "content": "When trying to take a screenshot, Flameshot will display the following error:\n\n```\nflameshot: error: Unable to capture screen\nflameshot: error: Unable to capture screen\nqt.qpa.wayland: Wayland does not support QWindow::requestActivate()\nflameshot: info: Screenshot aborted.\n```\n\nFlameshot requires the following packages to be installed to work correctly on Wayland:\n\nxdg-desktop-portal xdg-desktop-portal-wlr grim\n\nOnce these are installed, you should be able to start Flameshot.\n\nMore information can be found on the Sway wiki page\n\n"
    },
    {
      "title": "Flameshot starts with an error on Gnome Wayland",
      "level": 3,
      "content": "When trying to take a screenshot the first time, Flameshot will request permissions and the Gnome portal will show a permission prompt. If permissions have been denied once, flameshot will never display the dialog again and display the following error:\n\n```\nflameshot: error: Unable to capture screen\nflameshot: error: Unable to capture screen\nflameshot: info: Screenshot aborted.\n```\n\nPermissions can be shown by the flatpak permissions command (note the no here):\n\n```\n$ flatpak permissions\nTable      Object     App Permissions Data\nscreenshot screenshot     no          0x00\n```\n\nTo reset the permission and ask again, run the following command (note the single quotes at the end relates to the empty \"App\" column, it may change if flatpak has a non-empty application ID):\n\n```\n$ flatpak permission-reset ''\nTable      Object     App Permissions Data\nscreenshot screenshot     no          0x00\n```\n\n"
    },
    {
      "title": "Flameshot does not work on all monitors of a multi-monitor setup in KDE Plasma on wayland",
      "level": 3,
      "content": "The flameshot overlay only shows on one of several monitors. A workaround has been suggested in the flameshot github repository.\n\nBasically, KDE plasma needs to be configured to overwrite the initial position of the flameshot overlay window in order for the flameshot overlay to show up on all connected monitors. For this, start the \"Window Rules\" application and create a new window rule with the following settings:\n\n- \"Window Class\": flameshot\n- \"Window Types\": normal window\n- \"Window Title\": Exact Match: flameshot\n- \"Position\": Force 0 0\n- \"Fullscreen\": Force No\n- \"Obey geometry restrictions\": Force Yes\n- \"Keep above other windows\": Force Yes\n\n"
    },
    {
      "title": "Flameshot does not work on all monitors of a multi-monitor setup in Sway",
      "level": 3,
      "content": "The flameshot overlay only shows on one of several monitors. A workaround has been suggested in the flameshot github repository.\n\nThe workaround consists of forcing the flameshot window/overlay to launch in floating mode and not in full screen, by adding the following line to your Sway configuration:\n\n```\nfor_window [app_id=\"flameshot\"] border pixel 0, floating enable, fullscreen disable, move absolute position 0 0\n```\n\nAlternatively, you can force Flameshot to run under xWayland with QT_QPA_PLATFORM=xcb flameshot gui but note that, while it fixes the multi-monitor issue, it breaks keyboard shortcuts so Flameshot have to be controlled entirely with the mouse.\n\n"
    },
    {
      "title": "Flameshot does not generate thumbnails in KDE Dolphin",
      "level": 3,
      "content": "When running Plasma 6, trying to save a picture using dolphin's file picker will show the directory with no thumbnails if other image files are present. Running flameshot in a terminal will show the reason.\n\n```\nkf.service.services: KServiceTypeTrader: serviceType \"ThumbCreator\" not found\n```\n\nInstalling kio5-extras solves this problem. [1][dead link 2025-03-15 ⓘ]\n\n"
    },
    {
      "title": "Global shortcuts do not work on Gnome Wayland",
      "level": 3,
      "content": "Create a wrapper script that sets the correct environment variable:\n\n```\ncat > $HOME/flameshot-gui <<EOF\n#!/bin/sh\nexport QT_QPA_PLATFORM=wayland\n/usr/bin/flameshot gui\nEOF\n\nchmod +x $HOME/flameshot-gui\n```\n\nOpen the Settings window, go to \"Keyboard\" > \"View and Customize Shortcuts\" > \"Custom Shortcuts\", and click the \"+\" button. Select the shortcut you want and enter the path to the wrapper script in the \"Command\" button.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official website\n- Claims that using dbus-launch fixes sub-command problems: xmonad, i3\n\n"
    }
  ]
}