{
  "title": "Fontes de console",
  "url": "https://wiki.archlinux.org/title/Fontes_de_console",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- /Configuração de teclado\n- Screen capture#Virtual console\n- Color output in console\n- getty\n\nDe acordo com Wikipédia:\n\nEste artigo descreve os conceitos básicos do console do Linux e como configurar a exibição da fonte. A configuração do teclado é descrita na subpágina /Configuração de teclado.\n\n"
    },
    {
      "title": "Implementação",
      "level": 2,
      "content": "O console, diferentemente da maioria dos serviços que interagem diretamente com os usuários, é implementado no kernel. Isso contrasta com o software de emulação de terminal, como o Xterm, que é implementado no espaço do usuário como um aplicativo normal. O console sempre fez parte dos kernels Linux lançados, mas sofreu mudanças em sua história, mais notavelmente a transição para o uso do framebuffer e suporte a Unicode.\n\nApesar de muitos aprimoramentos no console, sua total retrocompatibilidade com o hardware legado significa que ele é limitado em comparação com um emulador de terminal gráfico.\n\n"
    },
    {
      "title": "Consoles virtuais",
      "level": 3,
      "content": "O console é apresentado ao usuário como uma série de consoles virtuais. Estes dão a impressão de que vários terminais independentes estão sendo executados simultaneamente; cada console virtual pode ser conectado com diferentes usuários, executar seu próprio shell e ter suas próprias configurações de fonte. Os consoles virtuais usam um dispositivo /dev/ttyX, e você pode alternar entre eles pressionando Alt+Fx (onde x é igual ao número do console virtual, começando com 1) . O dispositivo /dev/console é automaticamente mapeado para o console virtual ativo.\n\nVeja também chvt(1), openvt(1) e deallocvt(1).\n\n"
    },
    {
      "title": "Modo de texto",
      "level": 3,
      "content": "Como o Linux começou originalmente como um kernel para hardware de PC, o console foi desenvolvido usando gráficos CGA/EGA/VGA padrão da IBM, que todos os PCs suportavam na época. Os gráficos operaram no modo de texto VGA, que fornece um display simples de 80x25 caracteres com 16 cores. Este modo legado é semelhante aos recursos dos terminais de texto dedicados, como a série DEC VT100. Ainda é possível inicializar no modo texto se o hardware do sistema suportar, mas quase todas as distribuições modernas (incluindo o Arch Linux) usam o console framebuffer.\n\n"
    },
    {
      "title": "Console framebuffer",
      "level": 3,
      "content": "Como o Linux foi portado para outras arquiteturas não-PC, foi necessária uma solução melhor, uma vez que outras arquiteturas não usam adaptadores gráficos compatíveis com VGA e podem não suportar modos de texto. O console framebuffer foi implementado para fornecer um console padrão em todas as plataformas e, portanto, apresenta a mesma interface no estilo VGA, independentemente do hardware gráfico subjacente. Como tal, o console do Linux não é um emulador de terminal, mas um terminal por si só. Ele usa o tipo de terminal linux e é amplamente compatível com o VT100.\n\n"
    },
    {
      "title": "Atalhos de teclado",
      "level": 2,
      "content": "Table content:\nAtalho de teclado | Descrição\nCtrl+Alt+Del | Reinicia o computador (especificado pelo link simbólico /usr/lib/systemd/system/ctrl-alt-del.target)\nAlt+F1, F2, F3, ... | Alterna para o nº console virtual\nAlt+ ← | Alterna para o console virtual anterior\nAlt+ → | Alterna para o próximo console virtual\nScroll Lock | Quando Scroll Lock está ativado, entrada/saída está travada\nShift+PgUp/PgDown | Rola o buffer de console para cima/para baixo\nCtrl+c | Encerra a tarefa atual\nCtrl+d | Insere um EOF (fim de arquivo)\nCtrl+z | Pausa a tarefa atual\n\nVeja também console_codes(4).\n\n"
    },
    {
      "title": "Fontes",
      "level": 2,
      "content": "Por padrão, o console virtual usa a fonte embutida no kernel com um conjunto de caracteres CP437[1], mas isso pode ser alterado facilmente.\n\nO console do Linux usa a codificação UTF-8 por padrão, mas como o framebuffer padrão compatível com VGA é usado, uma fonte do console é limitada a um padrão 256 ou 512 glifos. Se a fonte tiver mais de 256 glifos, o número de cores será reduzido de 16 para 8. Para atribuir o símbolo correto a ser exibido ao valor Unicode fornecido, é necessário um mapa de tradução especial, geralmente chamado de unimap. Atualmente, a maioria das fontes do console tem o unimap embutido; historicamente, tinha que ser carregado separadamente.\n\nO pacote kbd fornece ferramentas para alterar a fonte do console virtual e o mapeamento de fontes. As fontes disponíveis são salvas no diretório /usr/share/kbd/consolefonts/, aquelas que terminam com .psfu ou .psfu.gz possuem um mapa de tradução Unicode embutido.\n\nOs keymaps (mapas de teclado), a conexão entre a tecla pressionada e o caractere usado pelo computador, são encontrados nos subdiretórios de /usr/share/kbd/keymaps/, veja /Configuração de teclado para detalhes.\n\n"
    },
    {
      "title": "Visualizar alterações e alterações temporárias",
      "level": 3,
      "content": "```\n$ showconsolefont\n```\n\nmostra uma tabela de glifos ou letras de uma fonte.\n\nsetfont altera temporariamente a fonte se passado um nome de fonte (em /usr/share/kbd/consolefonts/) tal como\n\n```\n$ setfont lat2-16 -m 8859-2\n```\n\nOs nomes das fontes diferenciam maiúsculo de minúsculo. Com nenhum parâmetro, setfont retorna o console para a fonte padrão.\n\nEntão, para ter uma fonte 8x8 pequena, com aquela fonte instalada como visto abaixo, use, por exemplo:\n\n```\n$ setfont -h8 /usr/share/kbd/consolefonts/drdos8x8.psfu.gz\n```\n\nPara ter uma fonte maior, a fonte Terminus (terminus-font) está disponível em muitos tamanhos, tal como ter-132n que é maior.\n\n"
    },
    {
      "title": "Configuração persistente",
      "level": 3,
      "content": "A variável FONT em /etc/vconsole.conf é usado para definir a fonte na inicialização, de forma persistente para todos consoles. Veja vconsole.conf(5) para detalhes.\n\nPara exibir caracteres tais como Č, ž, đ, š or Ł, ę, ą, ś usando a fonte lat2-16.psfu.gz:\n\n```\n/etc/vconsole.conf\n```\n\n```\n...\nFONT=lat2-16\nFONT_MAP=8859-2\n```\n\nIsso significa que a segunda parte dos caracteres ISO/IEC 8859 é usada com tamanho 16. Você pode alterar o tamanho da fonte usando outros valores (por exemplo, lat2-08). Para as regiões determinadas pela especificação 8859, veja Wikipedia:ISO/IEC 8859#The parts of ISO/IEC 8859.\n\nPara usar a fonte especificada no early userspace, use o hook consolefont em /etc/mkinitcpio.conf. Veja Mkinitcpio#HOOKS para mais informações.\n\nSe as fontes parecerem não mudar na inicialização, ou mudarem apenas temporariamente, é mais provável que tenham sido reiniciadas quando o driver gráfico foi inicializado e o console foi mudado para o framebuffer. Para evitar isso, carregue seu driver de gráficos anteriormente. Veja por exemplo Kernel mode setting#Early KMS start, [3] ou outras maneiras de configurar seu framebuffer antes de /etc/vconsole.conf é aplicado.\n\n"
    },
    {
      "title": "Rolagem de texto",
      "level": 2,
      "content": "A rolagem de texto permite que o usuário volte e veja o texto que saiu da tela de um console de texto. Isso é possível graças a um buffer criado entre o adaptador de vídeo e o dispositivo de exibição chamado de buffer de rolagem (scrollback buffer, em inglês). Por padrão, as combinações de teclas de Shift+PageUp e Shift+PageDown rolam o buffer para cima e para baixo.\n\nSe a rolagem para cima não mostrar informações suficientes, você precisará expandir seu buffer de rolagem para reter mais resultados. Isso é feito ajustando o console de framebuffer do kernel (fbcon) com o parâmetro do kernel fbcon=scrollback:Nk sendo N o tamanho do buffer desejado em kilobytes. O tamanho padrão é 32k.\n\nSe isso não funcionar, o console de framebuffer pode não estar ativado corretamente. Verifique a documentação do console de framebuffer para outros parâmetros, por exemplo para alterar o driver do framebuffer.\n\n"
    },
    {
      "title": "HiDPI",
      "level": 2,
      "content": "Veja HiDPI#Linux console (tty).\n\n"
    },
    {
      "title": "Tons audíveis",
      "level": 2,
      "content": "Veja PC speaker#Beep.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- The TTY demystified – Linus Åkesson\n\n"
    }
  ]
}