{
  "title": "Framework Laptop",
  "url": "https://wiki.archlinux.org/title/Framework_Laptop",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\n- The page has been renamed to reflect the introduction of the 16\" model, but the page content would probably gain from being updated with that wording too.\n- The multiple tables from #Hardware look like they can be squashed into the generic table since everything is listed as working. #Expansion cards should be left as-is given the fact that more modules can be added over time.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWi-Fi |  | Yes\nAudio (Intel) | 8086:a0c8 | Yes\nAudio (AMD) | 1002:1640 | Yes\nTouchpad | 093a:0274 | Yes\nWebcam | 0bda:5634 | Yes\nFingerprint reader | 27c6:609c | Yes\nBluetooth |  | Yes\nTPM |  | Yes\nAmbient light sensor |  | Yes\n\nThis article covers the installation and configuration of Arch Linux on a Framework Laptop.\n\nFor a general overview of laptop-related articles and recommendations, see Laptop.\n\n"
    },
    {
      "title": "Hardware",
      "level": 2,
      "content": "Framework is intended to be a configurable and upgradeable laptop. The lists below is not intended to be an exhaustive list of all the hardware sold with the framework, but rather a list of tested components.\n\n"
    },
    {
      "title": "Wi-Fi/Bluetooth",
      "level": 3,
      "content": "Table content:\nDevice Name | PCI ID | Bluetooth USB ID | Working? | Bluetooth? | Notes\nAX200 | 8086:2723 | 8087:0029 | Yes | Yes | Pre-production units\nAX201 vPro |  |  | Untested | Untested | Professional Edition\nAX201 w/o vPro | 8086:a0f0 | 8087:0026 | Yes | Yes | Base/Performance Editions\nAX210 vPro | 8086:2725 | 8087:0032 | Yes | Yes | DIY Edition (Optional)\nAX210 w/o vPro | 8086:2725 | 8087:0032 | Yes | Yes | DIY Edition (Optional)\nAX411 vPro | 8086:51f0 | 8087:0033 | Yes | Yes | Not sold by Framework, but works\nBE200 | 8086:272b | 8087:0036 | Yes | Yes | Not sold by Framework, but works\nRZ608 / MediaTek MT7921K | --- | 0e8d:e608 | Yes | Yes | Not sold by Framework, known to work\nRZ616 / MediaTek MT7922 | 14c3:0616 | 0e8d:e616 | Yes | Yes | AMD edition\n\n"
    },
    {
      "title": "Wi-Fi performance on AMD edition",
      "level": 4,
      "content": "You will be limited to 802.11n (Wi-Fi 4) and 2.4GHz bands if you do not configure the regulatory domain.\n\nThere have been reports of Wi-Fi stability and throughput improvements when using iwd, either directly or as the NetworkManager backend.\n\nWi-Fi stability can be improved by disabling power saving mode as described in Network configuration/Wireless#mt7921.\n\n"
    },
    {
      "title": "Intel / i915",
      "level": 4,
      "content": "Table content:\nDevice Name | PCI ID | Working?\nTigerLake-LP GT2 [Iris Xe Graphics] | 8086:9a49 | Yes\nAlder Lake-P GT2 [Iris Xe Graphics] | 8086:46a6 | Yes\nMeteor Lake-P [Intel Arc Graphics] | 8086:7d55 | Yes\n\n"
    },
    {
      "title": "AMD / amdgpu",
      "level": 4,
      "content": "Table content:\nDevice Name | PCI ID | Working? | Notes\nAdvanced Micro Devices, Inc. [AMD/ATI] Phoenix1 | 1002:15bf | Yes | Needs BIOS 3.03 or newer\n\n"
    },
    {
      "title": "Expansion cards",
      "level": 3,
      "content": "Table content:\nCard Name | PCI/USB ID | Working? | Notes\nUSB-C | N/A | Yes | \nUSB-A | N/A | Yes | \nMicroSD | 090c:3350 | Yes | \nHDMI | 32ac:0002 | Yes | \nDisplayPort | 32ac:0003 | Yes | \nStorage 250GB | 13fe:6500 | Yes | \nStorage 1TB | 13fe:6500 | Yes | \nEthernet | 0bda:8156 | Yes | \nSD (full-size) | 32ac:0009 | Yes | Can cause booting issues if an empty SD-to-MicroSD adapter is inserted at boot time.\n\n"
    },
    {
      "title": "Headset jack",
      "level": 3,
      "content": "On Intel and AMD motherboards, when powersave activates and deactivates on the sound card, there is a small noisy popping sound or a buzzing sound.\n\nThe number of seconds after which, if there is no sound activity, the kernel puts the audio module into powersaving, therefore producing the pop or buzz noise, is stored in /sys/module/snd_hda_intel/parameters/power_save.\n\nYou can deactivate powersave for the sound card entirely by passing power_save=0 as a module option to snd_hda_intel, as described in Advanced Linux Sound Architecture/Troubleshooting#Power saving.\n\nIf you are using TLP, you can instead set the SOUND_POWER_SAVE_ variables in /etc/tlp.conf.\n\nMotherboards with an Intel Core 12th Gen and later use a different DAC, the Tempo 92HD95B[1], which can cause popping noises when playing back audio using the PipeWire audio server. This seems to happen because PipeWire incorrectly sets the bit depth for the device to 32-bit, while the card only supports 16, 20 & 24-bit [2].\n\nThe supported rates can be verified by probing /proc/asound/card0/codec#0:\n\n```\n$ cat /proc/asound/card0/codec\\#0\n```\n\n```\n...\nDefault PCM:\n    rates [0x560]: 44100 48000 96000 192000\n    bits [0xe]: 16 20 24\n    formats [0x1]: PCM\n...\n```\n\nThe current sample rate can be verified by probing /proc/asound/card0/pcm0p/sub0/hw_params while playing back audio:\n\n```\n$ cat /proc/asound/card0/pcm0p/sub0/hw_params\n```\n\n```\naccess: MMAP_INTERLEAVED\nformat: S32_LE\nsubformat: STD\nchannels: 2\nrate: 48000 (48000/1)\nperiod_size: 1024\nbuffer_size: 32768\n```\n\nThe solution is to force the use of 16-bit samples through WirePlumber, by creating the following config file [3]:\n\n```\n/etc/wireplumber/wireplumber.conf.d/51-fix-crackle.conf\n```\n\n```\nmonitor.alsa.rules = [\n  {\n    matches = [\n      {\n        node.name = \"alsa_output.pci-0000_00_1f.3.analog-stereo\"\n      }\n    ]\n    actions = {\n      update-props = {\n        audio.format = \"S16LE\",\n      }\n    }\n  }\n]\n```\n\n"
    },
    {
      "title": "Speakers",
      "level": 3,
      "content": "By default, the speakers do not sound very balanced (due to downward firing speakers), so you may want to use an equalizer to fix this. The recommended method is to install EasyEffects and use the official preset found here.\n\nAlternatively, you can use user-created profiles such as this one created by cab404.\n\n"
    },
    {
      "title": "Display",
      "level": 3,
      "content": "The Framework Laptop 13 can be configured with 2 different displays: a 2256x1504 TFT-LCD display [4] or a 2880x1920 display with rounded corners, both manufactured by BOE. They are uncalibrated from factory, giving a suboptimal default sRGB coverage. It is thus recommended to apply an ICC profile to have better color reproduction. [5]\n\n- Intel Framework 13 ICC color profile: https://www.notebookcheck.net/uploads/tx_nbc2/BOE_CQ_______NE135FBM_N41_01.icm\n- AMD Framework 13 ICC color profile: https://www.notebookcheck.net/uploads/tx_nbc2/BOE_CQ_______NE135FBM_N41_03.icm\n\n- Intel Core Ultra Framework 13 ICC color profile for the 2.8k display: https://www.notebookcheck.net/uploads/tx_nbc2/BOE0CB4.icm\n\n"
    },
    {
      "title": "HDMI audio output",
      "level": 3,
      "content": "On Intel 11thGen there is a problem where an HDMI TV or HDMI VideoProjector is recognized as an Audio Output Device but no sound is heard when playing music. The HDMI TV output sound correctly using a fresh installed Windows operating system. For correcting this issue you have to first install the sof-firmware package, then you have to pass dsp_driver=3 as a module option to snd_intel_dspcfg so it uses the SOF version instead of the legacy one.\n\n"
    },
    {
      "title": "BIOS updates",
      "level": 3,
      "content": "Updates are generally available as UEFI Shell updates from Framework directly. LVFS support is still in testing for some models.\n\nTable content:\nGeneration | Stable | Beta | LVFS | Notes\nIntel 11th Gen | 3.20 |  | 3.17(testing only) | There will be no LVFS release for 3.20 because it has an Intel CSME update. An UEFI Shell update method is available.\nIntel 12th Gen | 3.08 | 3.09 | 3.09(testing only) | Later batches come with 3.05 \"to resolve an in-factory specific issue\"[6]. Warning: After updating your BIOS to version 3.06 or 3.08, you cannot downgrade to version 3.04 or 3.05 as it will result in the left side ports to stop functioning properly.\nIntel 13th Gen | 3.07 |  | 3.07(testing only) | Windows updater and EFI Shell packages for 3.05 available. Announcement here: [7]\nIntel Core Ultra 1 | 3.04 |  | 3.04 | Announcement here: [8]\nAMD Ryzen 7040 | 3.07 |  | 3.07 | If you have a batch 1 or 2 device (of the first original Framework AMD release), make sure you upgrade to at least 3.03 first. It comes preinstalled on batch 3 and later. Newer AMD releases with the new 2.8k display batches should already contain latest BIOS firmware (Framework started counting again from batch 1).\nAMD Ryzen AI 300 | 3.03 |  | 3.03(testing only) | All initial batches should come with 3.03 preinstalled.\n\nThe BIOS can be updated by EFI shell script placed on a bootable USB flash drive. This firmware update method clears EFI bootloaders registered in NVRAM, so having a recovery disk or alternate method of reinstalling your bootloader(s) handy is recommended. If your bootloader installs itself as the EFI fallback at esp/EFI/BOOT/BOOTX64.EFI (systemd-boot will by default, GRUB will with GRUB#Default/fallback boot path), no recovery disk is necessary, but your bootloader may need to be reinstalled to restore its NVRAM entry.\n\nTo check which bios is currently installed without rebooting into the bios itself is possible with:\n\n```\n# dmidecode -s bios-version\n```\n\n"
    },
    {
      "title": "LVFS",
      "level": 4,
      "content": "Support for fwupd may require enabling the testing remote [9], which can be done by running:\n\n```\n$ fwupdmgr enable-remote lvfs-testing\n```\n\n- For AMD 7040 series laptops you should not enable testing remotes if you want to use only released BIOS updates and not those in beta testing [10][11].\n- 11th Gen Intel Mainboards with BIOS versions earlier than 3.17 only have in-memory capsule update support, not on-disk. To upgrade to newer versions with the support, add the following fwupd configuration changes, update to 3.17 or higher, and then revert the change after the BIOS is updated:\n\n```\n/etc/fwupd/fwupd.conf\n```\n\n```\n[uefi_capsule]\nDisableCapsuleUpdateOnDisk=true\n```\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 4,
      "content": "Framework has published a guide for Intel 13th Gen and AMD to upgrade the firmware to a known working version.\n\n"
    },
    {
      "title": "Secure Boot",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nOne can enroll custom keys into the Framework Laptop without any Option ROM concerns, or use the SHIM approach. See Secure Boot for details.\n\n"
    },
    {
      "title": "Suspend",
      "level": 3,
      "content": "On Intel boards, adding the kernel parameter acpi_osi=\"!Windows 2020\" fixes a regression in s2idle, making the keyboard backlight and power button correctly turn off when suspending, as well as decreasing battery drain in suspend to about 1%/hour[12].\n\nIf your system fails to wake up from suspend due to the SSD disconnecting, you can try putting nvme.noacpi=1 in your kernel parameters. This may also improve battery life in suspend, if your SSD has a bad ACPI implementation. This should only be used on Intel boards, as on AMD it will cause the issue, instead of fixing it.\n\nSee Power management/Suspend and hibernate#Changing suspend method if you want to use S3 sleep instead of s2idle.\n\n"
    },
    {
      "title": "Fn key after suspend",
      "level": 4,
      "content": "Some users on 11th-generation Intel boards report that after resuming from suspend, the Fn key and/or media keys no longer work. The workaround is to blacklist the cros_ec_lpcs module:\n\n```\n/etc/modprobe.d/cros_ec_lpcs.conf\n```\n\n```\nblacklist cros_ec_lpcs\n```\n\n"
    },
    {
      "title": "Suspend-then-hibernate on AMD version",
      "level": 4,
      "content": "Note: **This article or section is being considered for removal.** This article or section is being considered for removal.\n\nThis article or section is being considered for removal.\n\nFor AMD versions running kernel versions less than 6.7, systemd's suspend-then-hibernate will wake up after exactly 5 minutes (regular suspend works). Until the kernel patch [15] is merged, add the kernel parameter rtc_cmos.use_acpi_alarm=1 to use the proper wakeup mechanism.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "There are reports of the touchpad exhibiting issues (e.g. pointer does not move, two-finger scroll does not work, etc.) after waking from sleep. Disabling PS/2 mouse emulation under Advanced in the BIOS seems to resolve the issues[16].\n\n"
    },
    {
      "title": "Interact with system",
      "level": 3,
      "content": "You can interact with your system using framework-system-gitAUR.\n\nNote: On AMD boards, /dev/cros_ec won't be available for framework_tool to use without the following unmerged patchset (as of 6.6.4). If secure boot is not enabled, the tool can bypass the kernel and talk directly to the EC with the --driver portio option. With secure boot, the only way to use it will be by patching the kernel or waiting until those patches are merged (see this issue for details).\n\nOn 11th and 12th Gen Intel boards, you can also interact with the embedded controller using fw-ectool-gitAUR.\n\nNote: **Hardware damage caused by EC firmware modifications would not be covered under the Framework Limited Warranty.** \n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | Yes | Yes | Toggles Fn lock\nF1 | Yes | Yes | XF86AudioMute\nF2 | Yes | Yes | XF86AudioLowerVolume\nF3 | Yes | Yes | XF86AudioRaiseVolume\nF4 | Yes | Yes | XF86AudioPrev\nF5 | Yes | Yes | XF86AudioPlay\nF6 | Yes | Yes | XF86AudioNext\nF7 | Yes | Yes | XF86MonBrightnessDown\nF8 | Yes | Yes | XF86MonBrightnessUp\nF9 | Yes | Yes | Super_L+p\nF10 | Yes | Yes | XF86RFKill, soft blocks wlan and bluetooth\nF11 | Yes | Yes | Print\nF12 | Yes | Yes | XF86AudioMedia\nFn+Delete | Yes | Yes | Insert\nFn+Space | Yes | Yes | Controls the keyboard backlight\nFn+b | No | No | Control_L+Break\nFn+k | No | No | Scroll_Lock\nFn+p | No | No | Pause\nFn+Left | Yes | Yes | Home\nFn+Right | Yes | Yes | End\nFn+Up | Yes | Yes | Prior/PgUp\nFn+Down | Yes | Yes | Next/PgDn\n\n1. The key is visible to xev and similar tools.\n1. The physical key has a symbol on it, which describes its function.\n\n"
    },
    {
      "title": "Ambient light sensor",
      "level": 2,
      "content": "Should work out of the box, you can check by reading /sys/bus/iio/devices/iio\\:device0/in_illuminance_raw.\n\nOn GNOME, you need to install iio-sensor-proxy and restart the session (or reboot, just in case). Then run monitor-sensor to check if it is working.\n\nIf you do not use GNOME but still want automatic brightness control, check out illuminanced.\n\n"
    },
    {
      "title": "Fan speed control",
      "level": 2,
      "content": "You can force the fan speed to any value between 0 and 100 using this tool: https://gitlab.howett.net/DHowett/ectool (fw-ectool-gitAUR)\n\n```\n$ ectool --interface=lpc fanduty 1OO\n```\n\nto return to automatic mode use this command:\n\n```\n$ ectool --interface=lpc autofanctrl\n```\n\nIn the meantime: https://lore.kernel.org/chrome-platform/20231005160701.19987-1-dustin@howett.net/ for direct support of the EC chromium driver.\n\n"
    },
    {
      "title": "Battery control",
      "level": 2,
      "content": "Framework laptops have an embedded controller responsible for controlling a variety of functions (fans, battery, LEDs...). Settings for this EC can be changed with fw-ectool-gitAUR until patches are merged into the mainline kernel. Some of the exposed settings related to battery health care are:\n\n```\n# ectool chargecontrol idle\n```\n\n```\n# ectool chargecontrol normal lower upper\n```\n\nchargecontrol can be set to discharge, idle, and normal. Discharge makes the system use the energy from the battery, disabling the charger; normal allows setting lower and upper limits (the battery stays in discharge mode while the battery level is between the upper and lower limits, and starts charging when the level is below the lower limit); and idle allows the system to get all the energy from the charger, essentially leaving the battery unused and avoiding any wear. This is very useful for using the laptop as an always-plugged-in device. Setting lower = upper values automatically sets idle mode after reaching the target value, while using idle keeps the battery in idle mode at the current charge level.\n\nYou can check how much current is being withdrawn from or charged into the battery with:\n\n```\n# cat /sys/class/power_supply/BAT0/current_now\n```\n\nOr under Present current in:\n\n```\n# ectool battery\n```\n\nUsing:\n\n```\n# ectool fwchargelimit level\n```\n\nseems to do the same as setting the charge limit through BIOS, which tries to maintain the battery level at the set level but is constantly charging and discharging it (no idle mode is used in this mode).\n\nFinally, we can set a limit to the max current allowed for charging, thus enabling slow charging, with:\n\n```\n# ectool chargecurrentlimit mA\n```\n\nParameters set via ectool remains active until the laptop is powered off and unplugged for a few (10~) seconds, after which values go back to default.\n\n"
    },
    {
      "title": "Stuttering, flickering and periodic freeze",
      "level": 3,
      "content": "There are reports of stuttering, flickering and periodic freezes on the laptop. Disabling Panel Self-Refresh (as explained in Intel graphics#Screen flickering) has been reported to work. However it is helpful for battery life, so it should be left on if there are no issues.\n\nThis can also happen if you have installed xf86-video-intel instead of using modesetting, see the note at Intel graphics#Installation.\n\n"
    },
    {
      "title": "Two/three finger clicks",
      "level": 3,
      "content": "By default, the touchpad provides middle and right click by clicking on specific regions (bottom middle for middle click and bottom right corner for right click). To switch this two-finger click for right click and three-finger click for middle click, you will need to set the \"click method\" via libinput. First, find your \"Touchpad\" device name:\n\n```\n$ xinput\n```\n\nAnd then set the click method, where device is the name (or ID) found in the previous step:\n\n```\n$ xinput set-prop \"device\" \"libinput Click Method Enabled\" 0 1\n```\n\nTo make this persistent, put it in a startup script. Alternatively, if using X11, one can create a custom Xorg configuration file with the appropriate settings (see libinput#Via Xorg configuration file).\n\n"
    },
    {
      "title": "HiDPI settings",
      "level": 3,
      "content": "- For the 2256x1504 display using scaling factor 1,5 is suggested.\n- For the 2880x1920 (2.8K) display using scaling factor 2 is suggested.\n\nFor more details, see HiDPI.\n\n"
    },
    {
      "title": "Lowering fan noise",
      "level": 3,
      "content": "This applies to the Intel version only. AMD users should use power-profiles-daemon.\n\nThe handling of fans can be significantly improved by using the thermald service. Install the package and then you can Start and Enable the service via the thermald.service unit file.\n\n"
    },
    {
      "title": "Changing the brightness of the monitor does not work",
      "level": 3,
      "content": "See Backlight#xbacklight returns : No outputs have backlight property.\n\nFor Alder Lake CPUs a solution for using the backlight keys instead of the light sensor is to deactivate the ambient light sensor.\n\n```\n/etc/modprobe.d/framework-als-deactivate.conf\n```\n\n```\nblacklist hid_sensor_hub\n```\n\nReboot is required, the light sensor module will be deactivated and the backlight keys work.\n\n"
    },
    {
      "title": "Bootmanager flashing black screen and not loading operating system",
      "level": 3,
      "content": "If your Framework laptop loads the bootloader and can recognize the EFI system partition on your flash drive or m.2. drive, but cannot load your boot manager (it only flashes a black screen before returning to the bootloader), you must disable Secure Boot.\n\n1. Reboot holding F2. There is a bug in some versions of the BIOS that prevents the F2 key on the builtin laptop keyboard from being recognized during reboot or power up. The workaround is to connect an external USB keyboard to the laptop an hold the F2 key on the external keyboard while rebooting or powering up the laptop. After the laptop has entered the BIOS settings the builtin keyboard can be used and the external one can be disconnected.\n1. Go to the Security Tab\n1. Secure boot defaults to ON; disable it\n1. Save changes and restart\n\n"
    },
    {
      "title": "Intel Wi-Fi 6E AX210 reset / low throughput / \"Microcode SW error\"",
      "level": 3,
      "content": "Under high stress, Wi-Fi device restarts and network speeds become abysmally slow or non-responsive until disconnecting and reconnecting to Wi-Fi network.[17]\n\nThis issue has been observed by owners of other manufacturers' laptops (not just framework). [18]\n\nDisabling IEEE 802.11ax seems to be a suitable workaround for the time being. [19]\n\n```\n/etc/modprobe.d/iwlwifi.conf\n```\n\n```\noptions iwlwifi disable_11ax=Y\n```\n\nIntel is aware[20] of the issue and there is a patch[21] that fix slow tx after restart, and another[22] that address the SW error.\n\n"
    },
    {
      "title": "Fingerprint reader device disconnected error",
      "level": 3,
      "content": "When the fingerprint reader has been used to enroll a fingerprint on Windows, and you later attempt to use the reader under Linux without first unenrolling your print from within Windows, fprintd can fail to work. In this situation, upon enrolling with fprintd-enroll, the command will hang, as fprintd has crashed.\n\nThe best way to deal with this, if you still have access to Windows, is to boot back in and unenroll your fingerprint from there. If this is not possible, you can try a script posted by someone on the Framework laptop forums.\n\n"
    },
    {
      "title": "Low framerate or stuttering webcam",
      "level": 3,
      "content": "This issue can occur if the program displaying the webcam feed is using the YUYV 4:2:2 color format. Most GUI camera applications do not allow for configuring this. Some applications that will let you configure this include guvcview and obs-studio, and they also appear to work with the default configuration.\n\nYou can also open the webcam using vlc with:\n\n```\n$ vlc v4l2:///dev/video1 --v4l2-chroma MJPG\n```\n\nor mpv with:\n\n```\n$ mpv --cache=no --demuxer-lavf-format=video4linux2 --demuxer-lavf-o=video_size=1920x1080,input_format=mjpeg av://v4l2:/dev/video0\n```\n\n"
    },
    {
      "title": "12th gen Turbo-Boost on battery with tlp",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with TLP.** This article or section is a candidate for merging with TLP.\n\nThis article or section is a candidate for merging with TLP.\n\nBy default the 12th gen will not Turbo-Boost on battery if tlp is installed. This can configured in tlp's configuration.\n\n```\n/etc/tlp.conf\n```\n\n```\nCPU_ENERGY_PERF_POLICY_ON_AC=balance_performance\nCPU_ENERGY_PERF_POLICY_ON_BAT=balance_performance\n```\n\n"
    },
    {
      "title": "12th gen brightness and airplane mode keys",
      "level": 3,
      "content": "On the 12th gen motherboards there is a bug[dead link 2023-10-29 ⓘ] where ALS and the brightness up/down including the airplane mode keys conflict. In order to make the brightness and airplane mode keys work in the detriment of using the ambient light sensor, blacklist the hid_sensor_hub module.\n\n"
    },
    {
      "title": "Ethernet not working with tlp",
      "level": 3,
      "content": "By default tlp will power limit the framework ethernet adapter. This can be changed in tlp's configuration where 0bda:8156 is the ID of the framework ethernet adapter.\n\n```\n/etc/tlp.conf\n```\n\n```\nUSB_DENYLIST=\"0bda:8156\"\n```\n\n"
    },
    {
      "title": "(AMD) TLP is not advised for power management. PPD is recommended",
      "level": 3,
      "content": "Framework Laptop 13 AMD Ryzen 7040 Series configurations are advised to use power-profiles-daemon (PPD) instead of TLP, which is actively discouraged for this processor. For further discussion see this Framework community thread.\n\n"
    },
    {
      "title": "(AMD) Washed-out colors when using power-profiles-daemon in power-saver or balanced mode",
      "level": 3,
      "content": "PPD (from Linux 6.9 and PPD 0.20) makes use of ABM (Ambient Backlight Manager), which impacts display color realism in order to save energy when the device is not charging. For more information on configuring it check this Framework community thread.\n\nTo simply prevent PPD from adjusting this setting create a drop-in file for its systemd-unit with systemctl edit power-profiles-daemon.service --drop-in=disable_panel_powersavings and add the following lines to it:\n\n```\n[Service]\nExecStart=\nExecStart=/usr/lib/power-profiles-daemon --block-action=amdgpu_panel_power\n```\n\n"
    },
    {
      "title": "(AMD) Flickering, artifacts and a white screen when a second monitor is connected",
      "level": 3,
      "content": "Note: This issue should be resolved with the latest BIOS update\n\nWhen a second monitor is connected (possibly only with higher resolutions or refresh rates, and possibly only in Wayland), an issue can be triggered where graphical artifacts or a white image will appear, sometimes showing the original content in a flicker as screen content changes. This can be resolved by adding amdgpu.sg_display=0 as a kernel parameter.\n\n"
    },
    {
      "title": "(AMD) GPU Lockup during graphical load (system still accessible through ssh)",
      "level": 3,
      "content": "Note: This issue should be resolved with the latest BIOS update and linux-firmware package.\n\nA number of measures seemed to reduce the chances of this happening, and complete system stability was achieved by combining them. It's possible some or all of these won't be necessary as the kernel and firmware are updated.\n\n- Replacing the linux-firmware package with linux-firmware-gitAUR (make sure to check linux-firmware-gitAUR is newer than linux-firmware before doing this)\n- In the BIOS, set the iGPU Configuration to UMA_GAME_OPTIMIZED\n- Setting /sys/class/drm/card0/device/power_dpm_force_performance_level to high or low instead of auto (in tlp this can be achieved with RADEON_DPM_PERF_LEVEL_ON_AC=high and RADEON_DPM_PERF_LEVEL_ON_BAT=low)\n\nSince the use of TLP with an AMD CPU is not advised, setting the performance level depending on the presence of a power supply can be archived with a simple udev rule and a small script:\n\n```\n/etc/udev/rules.d/60-power-dpm-force-performance-level.rules\n```\n\n```\nSUBSYSTEM==\"power_supply\" RUN+=\"/usr/local/bin/set_dpm_perf_level.sh %E{POWER_SUPPLY_ONLINE}\"\n```\n\n```\n/usr/local/bin/set_dpm_perf_level.sh\n```\n\n```\n#!/bin/bash\n\n#default level\nDRM_PERF_LEVEL=low\n#evaluate argument passed by udev\nif [ \"$1\" = 1 ] ; then\n    DRM_PERF_LEVEL=high\nelse\n    DRM_PERF_LEVEL=low\nfi\n\n#set drm performance level\necho $DRM_PERF_LEVEL > /sys/class/drm/card1/device/power_dpm_force_performance_level\n```\n\n"
    },
    {
      "title": "(AMD) Flickering graphical corruption on a single monitor",
      "level": 3,
      "content": "Providing additional memory to the iGPU appears to fix this problem, as advised by Framework Support in this Community thread. Follow this guide from Framework to enable allocating more iGPU RAM from the BIOS.\n\n"
    },
    {
      "title": "(AMD) Unable to reconnect to Wi-Fi after hibernation with kernel 6.7",
      "level": 3,
      "content": "A bug was introduced in kernel version 6.7 that causes the Wi-Fi connection to not be recoverable after hibernation. A fix has already been proposed and should make it to version 6.8. Aside from patching the kernel or using the lts version one workaround is to use modprobe to remove and re-add the mt7921e module as described in this community thread.\n\n"
    },
    {
      "title": "\"Boot failed\" when booting the Arch installer",
      "level": 3,
      "content": "When trying to boot the official installer the BIOS might show the error \"${device} boot failed\". This is because the official installation image does not support Secure Boot (FS#53864) and secure boot is enabled by default. This can be resolved by disabling secure boot from the BIOS menu.\n\n"
    },
    {
      "title": "Docking stations",
      "level": 3,
      "content": "Check the USB-C/Thunderbolt Dock Megathread on the Framework community boards for up to date information on functioning docks.\n\n"
    },
    {
      "title": "External GPU",
      "level": 3,
      "content": "Table content:\nName | Model Number | Interface | Power Delivery? | eGPU? | Notes\nAKITO Node Pro Thunderbolt 3 | T3NP | USB-C | Yes | No | Errors with PCIe bus expansion for eGPU, 3.16.5 kernel, 3.07 firmware\nSonnet | eGPU 550 | USB-C | Yes | Yes | Tested in kernel 5.15 and above\nRazer | Core | USB-C | Yes | Yes | Tested in kernel 5.15 and above\nMantiz MZ-03 Saturn Pro eGPU V2 | MZ-03-EU-SG | USB-C | Yes | Yes | EU-edition, Potentially needs intel_iommu=on,Tested in kernel 5.15 and above 3.06 Firmware 3.10 and 12th gen framework\nTREBLEET Mini eGPU Enclosure | JHL7440 | USB-C | Yes | Yes | Tested in kernel 6.8.7 and above. Times out decrypting LUKS partition when cold booting, works when hot-plugged. Crashes WM when unplugged, kicks to DM login\nADT-Link UT3G | ASMedia ASM2464PDX | USB-C | No | Yes | Tested in kernel 6.6.52-1-lts and above. The eGPU works when plugged and does not crash the system when unplugged. Bandwidth seems to be limited to PCIe 4 x1 in both Arch and Windows on 12th gen.\n\nTimes out decrypting LUKS partition when cold booting, works when hot-plugged. Crashes WM when unplugged, kicks to DM login\n\nThe eGPU works when plugged and does not crash the system when unplugged.\n\nBandwidth seems to be limited to PCIe 4 x1 in both Arch and Windows on 12th gen.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Framework website\n- Framework community thread for Arch Linux\n- Framework community thread for battery life tuning\n\n"
    }
  ]
}