{
  "title": "Free Programs",
  "url": "https://wiki.archlinux.org/title/Free_Programs",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Core utilities\n- List of games\n\nThis article is a general list of applications sorted by category, as a reference for those looking for packages. Many sections are split between console and graphical applications. Applications listed in \"Console\" sections can have graphical front-ends, official ones are currently omitted.\n\n- Please consider installing the pkgstats package, which provides a timer that sends a list of the packages installed on your system, along with the architecture and the mirrors you use, to the Arch Linux developers in order to help them prioritize their efforts and make the distribution even better. The information is sent anonymously and cannot be used to identify you. You can view the collected data at the Statistics page. More information is available in this forum thread.\n- Daemon packages usually include the relevant systemd unit file to start; some packages even include different ones. After installation pacman -Qql package | grep -Fe .service -e .socket can be used to check and find the relevant one.\n\nThe content is split into the following subpages for individual categories (also accessible via the navigation bar at the top of the page and each subpage):\n\n- /Documents\n- /Internet\n- /Multimedia\n- /Science\n- /Security\n- /Utilities\n- /Other\n\n"
    },
    {
      "title": "Generic software lists",
      "level": 2,
      "content": "- Wikipedia:Portal:Free and open-source software\n- Wikipedia:List of free and open-source software packages\n- Wikipedia:List of GNU packages\n- AlternativeTo — Linux alternatives to popular applications\n- Awesome Linux Software — Collection of Linux applications and tools\n- Linux Alternative Project — Linux equivalents to Windows software\n- Linux Links Directory — Linux applications directory\n- Open Source Alternative — Alternatives to commercial software\n\n"
    },
    {
      "title": "Software lists of other distributions",
      "level": 2,
      "content": "- AppImageHub\n- Flathub\n- Snapcraft\n- Debian packages and screenshots\n- Fedora packages\n- Gentoo packages\n- openSUSE Software\n- Ubuntu packages\n\n"
    },
    {
      "title": "Specialized software lists",
      "level": 2,
      "content": "- awesome-linuxaudio — Software for audio/video/live production\n- awesome-selfhosted — Network services and web applications\n- awesome-shell — Command-line frameworks, toolkits and guides\n- awesome-sysadmin — Software for system administrators\n- GNOME applications\n- KDE Applications\n- Inconsolation — Lightweight and minimalist applications reviews\n- K.Mandla's blog — Console applications screenshots and reviews\n- Libre Projects — Open source hosted web services\n- LinApp — Commercial applications and games for Linux\n- PRISM Break — Software against mass surveillance\n- Privacy Tools — Knowledge and tools to protect your privacy against global mass surveillance\n\n"
    },
    {
      "title": "Software forges",
      "level": 2,
      "content": "From Wikipedia:\n\n- Codeberg\n- GitHub\n- GitLab\n- Launchpad\n- SourceHut\n\n"
    }
  ]
}