{
  "title": "Genfstab",
  "url": "https://wiki.archlinux.org/title/Genfstab",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is a candidate for merging with fstab#Tips and tricks.** This article or section is a candidate for merging with fstab#Tips and tricks.\n\nThis article or section is a candidate for merging with fstab#Tips and tricks.\n\nRelated articles\n\n- fstab\n- Persistent block device naming\n- File systems\n\ngenfstab is a Bash script that is used to automatically detect all mounts under a given mountpoint, its output can then be redirected into a file, usually /etc/fstab.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "It is present by default on Arch installation media and can be installed as part of the arch-install-scripts package on an already installed system.\n\nThere is also a stand alone fork of this tool that can be used on other distributions, you can find it here.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "You can get a list of your current mounts by using:\n\n```\n$ genfstab /\n```\n\nThe script supports finding mounts by kernel descriptor, device/partition label or device/partition UUID. It will output kernel descriptor by default (kernel descriptor being /dev/xxx), you can use -L, -t PARTLABEL, -U or -t PARTUUID for file system label, GPT partition label, file system UUID or GPT partition UUID respectively.\n\nThe more common usage scenario would be getting an fstab for a chroot, for this you would do something like the following:\n\n```\n# mount /dev/sda3 /mnt\n# mount --mkdir /dev/sda1 /mnt/efi\n```\n\n```\n$ genfstab -U /mnt\n```\n\n```\n# /dev/sda3\nUUID=185aebd2-ce76-47dd-baf4-5ad0a80fa963       /               ext4            rw,noatime      0 1\n\n# /dev/sda1\nUUID=E5C7-6DD7          /efi       vfat             rw,relatime,fmask=0077,dmask=0077,codepage=437,iocharset=ascii,shortname=mixed,utf8,errors=remount-ro   0 2\n```\n\nIn this case genfstab shows both mounts below the mountpoint /mnt and list them by device UUID.\n\nUsually you would want to redirect the output to a file, this can be achieved with the following:\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\n- Make sure you create a backup of your existing fstab before overwriting it.\n- Be mindful of where you are saving the fstab file, for example if you want to create it for a chroot then you do not want to overwrite the one on your main installation.\n\n"
    }
  ]
}