{
  "title": "Hamachi",
  "url": "https://wiki.archlinux.org/title/Hamachi",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Hamachi is a proprietary, commercial VPN software by LogMeIn, Inc. With Hamachi you can organize two or more computers with an Internet connection into their own virtual network for direct secure communication.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the logmein-hamachiAUR package.\n\nThe following GUI frontends for Hamachi are available:\n\n- haguichiAUR (Gtk3, Vala)\n- quamachiAUR (Qt5, Python)\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Hamachi is configured in /var/lib/logmein-hamachi/h2-engine-override.cfg (create that file if it does not exist). Unfortunately, it is not easy to find a comprehensive list of possible configuration options, so here are a few that you can use.\n\n"
    },
    {
      "title": "Using the hamachi command line tool as a regular user",
      "level": 3,
      "content": "In order to use the hamachi command line tool as a regular user, add the following line to the configuration file:\n\n```\n/var/lib/logmein-hamachi/h2-engine-override.cfg\n```\n\n```\nIpc.User username\n```\n\n"
    },
    {
      "title": "Automatically setting a custom nickname",
      "level": 3,
      "content": "Normally, Hamachi uses your system's hostname as the nickname that other Hamachi users will see. If you want to automatically set a custom nickname every time Hamachi starts, add the following line to the configuration file:\n\n```\nSetup.AutoNick YourNicknameHere\n```\n\nYou can also manually set a nickname using the hamachi command line tool:\n\n```\n# hamachi set-nick YourNicknameHere\n```\n\nHowever, this needs to be done every time Hamachi is (re-)started, so if you always want to use the same nickname, setting it automatically (as explained above) is probably easier.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Start logmein-hamachi.service.\n\nTo get a list of all the commands, run:\n\n```\n$ hamachi help\n```\n\nYou can set Hamachi to start at every boot by enabling logmein-hamachi.service.\n\n"
    }
  ]
}