{
  "title": "HP Chromebook 14",
  "url": "https://wiki.archlinux.org/title/HP_Chromebook_14",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThe HP Chromebook 14 (and newer chromebooks in general) features a \"legacy boot\" mode that makes it easy to boot Linux and other operating systems. The legacy boot mode is provided by the SeaBIOS payload of coreboot. SeaBIOS behaves like a traditional BIOS that boots into the GPT of a disk, and from there into your standard boot loaders like Syslinux and GRUB.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Go to the Chromebook page, read the Introduction and continue by following the Installation guide.\n\n"
    },
    {
      "title": "Post Installation Configuration",
      "level": 2,
      "content": "For information on general Chromebook post installation configuration (hotkeys, power key handling ...) see Post installation configuration on the Chromebook page.\n\n"
    },
    {
      "title": "Touchpad Configuration",
      "level": 3,
      "content": "Add the Xorg touchpad configuration below for better usability (higher sensitivity).\n\n```\n/etc/X11/xorg.conf.d/50-cros-touchpad.conf\n```\n\n```\nSection \"InputClass\"\n    Identifier      \"touchpad peppy cyapa\"\n    Driver          \"synaptics\"\n    MatchIsTouchpad \"on\"\n    MatchDevicePath \"/dev/input/event*\"\n    MatchProduct    \"cyapa\"\n    Option          \"FingerLow\" \"10\"\n    Option          \"FingerHigh\" \"10\"\nEndSection\n```\n\nReboot for the touchpad to become operational.\n\n"
    },
    {
      "title": "Keyboard Keymapping Fix",
      "level": 3,
      "content": "We will create a custom hwdb config file to bypass the default mapping in /usr/lib/udev/hwdb.d/60-keyboard.hwdb of the keys between escape and power so they will work as F1 to F10 and the search button as Super_L (aka Mod4.\n\nCreating the following configuration file:\n\n```\n/etc/udev/hwdb.d/90-chromebook-keyboard-fix.hwdb\n```\n\n```\n# Chromebook 14 fix\nevdev:atkbd:dmi:bvn*:bvr*:bd*:svnHewlett-Packard*:pnFalco:pvr*\n KEYBOARD_KEY_3b=f1\n KEYBOARD_KEY_3c=f2\n KEYBOARD_KEY_3d=f3\n KEYBOARD_KEY_3e=f4\n KEYBOARD_KEY_3f=f5\n KEYBOARD_KEY_40=f6\n KEYBOARD_KEY_41=f7\n KEYBOARD_KEY_42=f8\n KEYBOARD_KEY_43=f9\n KEYBOARD_KEY_44=f10\n KEYBOARD_KEY_db=leftmeta\n```\n\nThen follow the steps at Map scancodes to keycodes#Using udev.\n\n"
    },
    {
      "title": "Adding hotkeys back",
      "level": 3,
      "content": "Once you have applied the above fix you can set the function and arrow keys to act similar to how they are in ChromeOS using a modifier key. The example below uses Mod4 (Search on the chromebook's keyboard). This can be changed to Ctrl or Alt if you prefer.\n\nSee Chrome OS devices#Using Xbindkeys.\n\nTo make the change permanent, see Xbindkeys#Making changes permanent.\n\n"
    },
    {
      "title": "Locating the Write-Protect Screw",
      "level": 2,
      "content": "- Remove the visible screws and another 4 hidden screws under rubber stubs (not the rubber feet) at the bottom.\n- Flip the laptop right side up and use a thin blunt object to pry the keyboard surface from the bottom half.\n- The bios screw is located to the left of the fan, it can be recognized by the fact that the copper circle it sits on is split in half \"( )\" vs \"O\". The screw connects the two halves, making the bios unwritable.\n- Once this screw is removed, it is advisable to unplug the battery and plug it back in to ensure that the removal is recognized.\n\nSee disassembly pictures [1], [2] and the location of the write-protect screw.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- A HOWTO for replacing SSD\n- A log of how to replace ChromeOS with Arch Linux\n- Disassembly for replacing the screen\n- Disassembly instructions (official)\n\n"
    }
  ]
}