{
  "title": "HP ENVY TouchSmart 17-j113tx",
  "url": "https://wiki.archlinux.org/title/HP_ENVY_TouchSmart_17-j113tx",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) | 8086:0416 | Yes\nGPU (NVIDIA) | 10de:1292 | Yes\nAudio | 8086:8c20 | Yes\nTouchscreen | 0eef:a802 | Yes\nEthernet | 10ec:8168 | Yes\nWireless | 8086:08b1 | Yes\nBluetooth | 8087:07dc | Yes\nCard Reader | 10ec:5227 | Untested\nWebcam | 0bda:5775 | Yes\nFingerprint Sensor | 138a:0050 | Untested\n\nThis page applies to the HP ENVY TouchSmart 17-j113tx.\n\n"
    },
    {
      "title": "Touchscreen",
      "level": 2,
      "content": "The integrated display includes a Touchscreen.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "The laptop has integrated 4.1 speakers. Stereo sound works successfully from the front two speakers without intervention under ALSA.\n\nThe other speakers are not recognised or used by default; they can be mapped using the hdajackretask utility from the alsa-tools package, and it appears the correct combination is the same as for other contemporary HP ENVY models:\n\nTable content:\nPin ID | Override Mapping\n0x0d | Internal speaker\n0x0f | Internal speaker (Back)\n0x10 | Internal speaker (LFE)\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "The integrated numeric keypad is dual-function, and defaults to scrolling actions unless NumLock is enabled. There is no ScrollLock key and there is no indicator light for NumLock.\n\nThe integrated Function keys are also dual-function, and default to either system control actions or assigned Functions depending on what is configured in the Firmware Setup Utility (reversible at runtime by using the Fn key in combination). The system control actions are:\n\nTable content:\nKey(s) | Control Action | Status (assuming appropriate software)\nF1 | Super+F1 | No hardware action by default, but may trigger a software action (meant to be a 'Help' key under Windows).\nF2, F3 | Monitor Brightness Down/Up | Works for integrated display.\nF4 | Super+P | No hardware action by default, but may trigger a software action (meant to switch video output under Windows).\nF5 |  | Not captured (activates and deactivates the keyboard backlight, which appears to be hardware controlled).\nF6, F7, F8 | Volume Mute/Down/Up | Works, including the LED that shows when volume is muted.\nF9, F10, F11 | Media Previous/Play/Next | Works.\nF12 |  | Not captured (activates and deactivates Wireless LAN and Bluetooth transceivers, with a LED that changes depending on this state).\n\n"
    },
    {
      "title": "Fingerprint sensor",
      "level": 2,
      "content": "Currently not supported by Fprint, according to the project website. The libfprint-gitAUR package may offer some hope, but this has not (yet) been tested on this model.\n\n"
    }
  ]
}