{
  "title": "HP EliteBook 840 G1",
  "url": "https://wiki.archlinux.org/title/HP_EliteBook_840_G1",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) |  | Yes\nGPU (AMD) |  | Yes\nEthernet |  | Yes\nWireless |  | Yes\nBluetooth |  | Yes\nAudio |  | Yes\nTouchpad |  | Yes\nWebcam |  | Yes\nFingerprint reader |  | Yes\nMemory card reader |  | Yes\nSmart card reader |  | Yes\n\n"
    },
    {
      "title": "UEFI Setup",
      "level": 3,
      "content": "Even if UEFI, Arch Linux and (e.g.) GRUB are correctly configured and with the correct UEFI NVRAM variables set, the system will not boot from the HDD/SSD. The problem is that HP hard coded the paths for the OS boot manager in their UEFI boot manager to \\EFI\\Microsoft\\Boot\\bootmgfw.efi to boot Microsoft Windows, regardless of how the UEFI NVRAM variables are changed. There are two workarounds:\n\n"
    },
    {
      "title": "Using the \"Customized Boot\" path option (recommended)",
      "level": 4,
      "content": "The latest HP firmware allows defining a “Customized Boot” path in the UEFI pre-boot graphical environment. Select the “Customized Boot” option in the UEFI pre-boot graphical environment under “Boot Options” and set the path to your OS boot loader on the ESP (see EFI system partition), e.g.:\n\n\\EFI\\grub\\grubx64.efi\n\nAlways verify the correct path to the .efi file. Also, adjust the device boot order (also in the UEFI pre-boot graphical environment) to boot this entry first.\n\n"
    },
    {
      "title": "Change the OS boot loader path to match the hard coded path",
      "level": 4,
      "content": "Note: **This article or section is being considered for removal.** This article or section is being considered for removal.\n\nThis article or section is being considered for removal.\n\n- If you are trying to boot on a the mSATA port (m.2 SSD), this is the only working method.\n- This method is not recommended, as it will create conflicts in a dual boot setup with Microsoft Windows. Also, every time you install GRUB, you have to remember to copy it to the hard coded path.\n\nChange the UEFI application path of the OS boot loader to that hard coded path. On your EFI system partition; e.g. with esp being the EFI system partition mountpoint:\n\n```\n# mkdir -p esp/EFI/Microsoft/Boot\n# cp esp/EFI/grub/grubx64.efi esp/EFI/Microsoft/Boot/bootmgfw.efi\n```\n\nor\n\n```\n# mkdir -p esp/EFI/BOOT\n# cp esp/EFI/grub/grubx64.efi esp/EFI/BOOT/BOOTx64.EFI\n```\n\n"
    },
    {
      "title": "Encryption",
      "level": 3,
      "content": "This notebook supports HDD FDE (SED). The HDD/SSD can be locked by setting a password in the UEFI pre-boot graphical environment under the option \"DriveLock\" (this requires setting a password for the UEFI pre-boot graphical environment first). If you replace the HDD/SSD, make sure to get a compatible one to make use of this feature.\n\nOtherwise, see Disk encryption for software-based encryption.\n\n"
    },
    {
      "title": "AMD Graphics",
      "level": 3,
      "content": "In order to get the dedicated AMD graphics card to function properly, install AMDGPU first. Set the following kernel parameters: amdgpu.si_support=1 radeon.si_support=0.\n\nNow, any application run with DRI_PRIME (as described for using PRIME) is using the dedicated GPU.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "For HDMI Audio you need CONFIG_INTEL_IOMMU_DEFAULT_ON=n in your kernel config (see https://bugzilla.kernel.org/show_bug.cgi?id=61471). In some cases, you will need options snd-hda-intel enable=1,1,0 in /etc/modprobe.d/snd-hda-intel.conf. This will prevent freezes caused by hdmi audio cards conflicting.\n\n"
    },
    {
      "title": "Resume / wake on lid open",
      "level": 3,
      "content": "This feature needs to be enabled in the UEFI setup: Advanced > Built-in device options > Wake unit from sleep when lid is opened\n\n"
    },
    {
      "title": "Enable the microphone muting key",
      "level": 3,
      "content": "If your mute mic key (Fn+F8) does not work, you actually just need to remap this key manually.\n\nHere is an example of how you can do this by adding a custom mapping file:\n\n```\n/etc/udev/hwdb.d/61-hp-mic-mute-hotkey.hwdb\n```\n\n```\nevdev:atkbd:dmi:bvn*:bvr*:bd*:svnHewlett-Packard*:pn*EliteBook*:pvr*\n KEYBOARD_KEY_81=f20                          # Fn+F8 on Elitebook, map to F20\n```\n\nThen, you just need to regenerate and reload your hwdb.bin file:\n\n```\n# systemd-hwdb update\n# udevadm trigger\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Changing Boot Order on Dual Boot Windows 8 and Ubuntu\n\n- Setting GRUB as the default boot manager on a UEFI-based system\n\n- Activate mic mute function key, ubuntu 18.04, HP Elitebook 820\n\n"
    }
  ]
}