{
  "title": "HP ZBook Studio G3",
  "url": "https://wiki.archlinux.org/title/HP_ZBook_Studio_G3",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nThe HP Zbook Studio G3 is a workstation replacement laptop.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installation is generally pretty straight forward, however, there are some things to consider. Follow the general instructions of the Installation guide\n\n"
    },
    {
      "title": "Using hybrid graphics",
      "level": 3,
      "content": "Due to a kernel issue, use of nouveau or bbswitch may result in lockups. To prevent this, add acpi_osi=! acpi_osi=\"Windows 2009\" to your kernel command line (source, Kernel bug 156341).\n\n"
    },
    {
      "title": "Disabling Hybrid graphics",
      "level": 3,
      "content": "If you do not mind greatly reducing your battery life and would like to use the NVIDIA graphics by default, you can change Hybrid graphisc in the firmware setup.\n\nIn the BIOS settings, (which you enter by pressing Escape during boot) change the graphics mode from Auto/Hybrid to discrete.\n\n"
    },
    {
      "title": "Font size during installation",
      "level": 3,
      "content": "Due to the high screen resolution if this machine, you may want to change the font of your terminal during installation:\n\n```\n# setfont sun12x22\n```\n\n"
    },
    {
      "title": "Dual boot with Windows",
      "level": 3,
      "content": "This laptop usually comes preloaded with Windows 7. Although the laptop boots in UEFI mode, it appears as though the Windows boot loader is present in the MBR of the hard drive (there is no EFI system partition).\n\nIt may be wise to install Arch with an MBR boot loader if you wish to preserve the Windows installation.\n\n"
    },
    {
      "title": "X config",
      "level": 3,
      "content": "Install the NVIDIA driver. If you are using the system in discrete graphics mode, you may need to run nvidia-xconfig as root to be able to run X.\n\n"
    },
    {
      "title": "HiDPI configuration",
      "level": 3,
      "content": "If you are using a desktop environments such as gnome or KDE, they should have their own management tools. If you are using more power-user type window managers such as i3, you may need to add the following line in your .xinitrc file\n\n```\n~/.xinitrc\n```\n\n```\nxrdb -merge ~/.Xresources\nxrandr --output eDP-1 --dpi 288\nexec i3\n```\n\nThe name of the output device depends on the graphics adapter and driver. Use xrandr to find out the actual name.\n\n"
    },
    {
      "title": "Touchpad configuration",
      "level": 3,
      "content": "The touchpad may be \"hijacked\" by the i2c_hid device driver. Although the touchpad is working, its configuration is fixed to two buttons, two-finger natural scrolling and no tapping; Any changes with xinput or other tools will have no effect.\n\nTo prevent this you have to blacklist i2c_hid by adding the following lines to a *.conf file in /etc/modprobe.d (source):\n\n```\n/etc/modprobe.d/touchpad.conf\n```\n\n```\nblacklist i2c_hid\ninstall i2c_hid /bin/false\n```\n\nAfter a reboot (unloading i2c_hid, if possible, may be sufficient) the touchpad should be fully configurable libinput device.\n\n"
    },
    {
      "title": "Mute button LED indicator",
      "level": 3,
      "content": "To fix the mute button LED, create a file:\n\n```\n/etc/modprobe.d/alsa-base.conf\n```\n\n```\noptions snd-hda-intel model=mute-led-gpio\n```\n\n"
    }
  ]
}