{
  "title": "Hunspell",
  "url": "https://wiki.archlinux.org/title/Hunspell",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "This article covers spell checking and grammar checking software.\n\nExcept for special cases, all spell checkers have in common that they consist of two parts: the logic unit and the dictionary. Make sure to install both.\n\n"
    },
    {
      "title": "Spell checkers",
      "level": 2,
      "content": "- GNU Aspell — Spell checker designed to eventually replace ispell, see also aspell(1) and the info document.\n\n- Hunspell — Spell checker and morphological analyzer library and program, see also hunspell(1).\n\n- Nuspell — Spell checker library and program designed as a modern alternative to hunspell, see also nuspell(1).\n\n- Ispell — Interactive spell-checking program for Unix, see also ispell(1).\n\n"
    },
    {
      "title": "Language-specific",
      "level": 3,
      "content": "- Hspell — Hebrew spell-checker\n\n- Voikko — Finnish spelling and grammar checker, hyphenator and collection of related linguistic data\n\n"
    },
    {
      "title": "Enchant",
      "level": 3,
      "content": "Enchant is a wrapper library for generic spell checking, developed as part of AbiWord, supporting all above spell checkers apart from Ispell.\n\nEnchant is available as the enchant package. For its usage and ordering file, see enchant-2(1).\n\nEnchant is used by many applications through the following GTK libraries:\n\n- gspell — Flexible API to implement spell checking in GTK applications.\n\n- GtkSpell — Provides word-processor-style highlighting and replacement of misspelled words in a GtkTextView widget.\n\n"
    },
    {
      "title": "Applications",
      "level": 3,
      "content": "Firefox, Thunderbird, Chromium and LibreOffice can all use system-wide installed Hunspell dictionaries as well as dictionaries/other spell checkers installed through their own extension systems. See the following sections:\n\n- Firefox#Spell checking\n- Thunderbird#Spell checking\n- LibreOffice#Spell checking\n- AbiWord and Gedit use Enchant.\n- calligra spellchecking requires aspell\n\n"
    },
    {
      "title": "Grammar checkers",
      "level": 2,
      "content": "- LanguageTool — Open source language checker, written in Java.\n\n- Style and Diction — Diction identifies wordy and commonly misused phrases. Style analyses surface characteristics of a document.\n\n- TeXtidote — Language checker for LaTeX documents, relies on LanguageTool.\n\n"
    },
    {
      "title": "Applications",
      "level": 3,
      "content": "Firefox, Thunderbird, Chromium and LibreOffice all support grammar checking only through extensions. For LibreOffice, see LibreOffice#Grammar checking with LanguageTool.\n\nAbiWord has a built-in grammar checker, see AbiWord#Grammar checking.\n\n"
    }
  ]
}