{
  "title": "I18n",
  "url": "https://wiki.archlinux.org/title/I18n",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ArchWiki:Translation Team\n- International communities\n\nThis article serves as a comprehensive guideline for ArchWiki internationalization and localization.\n\n"
    },
    {
      "title": "Page titles",
      "level": 3,
      "content": "Non-English page titles must be of the form \"Title in English (Language)\" where \"Language\" is the localized spelling of said language. Note the space between the title and the language tag. For example: Installation guide (Nederlands). English titles should not include a language tag.\n\nAlso note that in case of sub-pages, the language tag shall be appended to each segment in the title path, so \"Title (Language)/Sub-page\" is wrong, while \"Title (Language)/Sub-page (Language)\" is correct. For example: systemd (Русский)/User (Русский). Using language tags on each segment enables proper operation of the superpage links, and in particular the last tag is added automatically in interlanguage links, plus it makes it more practical and safe for bots to detect the language of a page. \"Title/Sub-page (Language)\" was the previously accepted format, which is now obsolete but possibly still in use by some articles.\n\nThe root categories for every language are the only exception to this rule, as they must not repeat the language name in a suffix.\n\nSee #Languages for a list of languages and expected localized spellings.\n\nRationale:\n\n- English titles facilitate administration; all administrators understand English, but may not be multilingual. When browsing Special:RecentChanges and other special pages, admins need to know what is being edited without resorting to external translation programs.\n- Standardized article titles simplify inter-language linking.\n\n"
    },
    {
      "title": "Localized redirects",
      "level": 3,
      "content": "Localized titles can and should be created, but must redirect to the English-named article as described above. Redirect titles need not include language tags. For example: Guía oficial de Instalación redirects to Installation guide (Español). Note that this is however not possible for Category pages, since categorizing a page under a redirect will not list the page under the target category.\n\nRationale:\n\n- Localized titles improve navigability for international readers. Both the internal search feature and external search engines can utilize such redirects.\n- Useful redirects facilitate internal linking.\n\n"
    },
    {
      "title": "Interlanguage links",
      "level": 3,
      "content": "If an article exists in more than one language, please add interlanguage links at the top of each translation:\n\n```\n[[de:Title]]\n[[en:Title]]\n[[es:Title]]\n```\n\nSee #Languages for a list of the available language tags. See Help:Style#Interlanguage links for usage guidelines.\n\nRationale:\n\n- Including inter-language links at the beginning of an article allows international readers to promptly determine whether content is available in their language, and similarly allows translators to ascertain whether an article requires translation.\n\n"
    },
    {
      "title": "Finding articles with specific interlanguage links",
      "level": 4,
      "content": "In order to obtain a list of the articles with interlanguage links pointing to a specific title (language backlinks), use:\n\nhttps://wiki.archlinux.org/api.php?action=query&list=langbacklinks&lbllimit=500&lblprop=lltitle&lbllang=en&lbltitle=Main%20Page\n\nThis example looks for ([[en:Main Page]]), but for other links it is enough to change the value of lbllang and lbltitle.\n\nIf you want to obtain a list of the articles using interlanguage links of a specific language, just omit the lbltitle key:\n\nhttps://wiki.archlinux.org/api.php?action=query&list=langbacklinks&lbllimit=500&lblprop=lltitle&lbllang=de\n\nThis example uses German (de), but for the other languages it is enough to change the value of lbllang.\n\nNote that API queries are always limited, so if a language has more than 500 backlinks it will be necessary to continue the search adding the lblcontinue attribute that appears at the bottom of the list to the query string.\n\n"
    },
    {
      "title": "Languages",
      "level": 2,
      "content": "The following table lists all languages encountered on the wiki along with related links.\n\nTable content:\nEnglish name | Localized name | Subtag | Root category | External wiki\nArabic | العربية | ar | Category:العربية\nBangla | বাংলা | not configured | Category:বাংলা\nBosnian | Bosanski | bs | Category:Bosanski\nBulgarian | Български | bg | Category:Български\nCantonese | 粵語 | not configured | Category:粵語\nCatalan | Català | ca | Category:Català\nChinese (Classical) | 文言文 | not configured | Category:文言文\nChinese (Simplified) | 简体中文 | zh-hans | Category:简体中文 | https://wiki.archlinuxcn.org\nChinese (Traditional) | 正體中文 | zh-hant | Category:正體中文\nCroatian | Hrvatski | hr | Category:Hrvatski\nCzech | Čeština | cs | Category:Čeština\nDanish | Dansk | da | Category:Dansk\nDutch | Nederlands | nl | Category:Nederlands\nEnglish | English | en | Category:English\nEsperanto | Esperanto | not configured | Category:Esperanto\nFinnish | Suomi | fi | Category:Suomi\nFrench | Français | fr | Category:Français\nGerman | Deutsch | de | – | https://wiki.archlinux.de/\nGreek | Ελληνικά | el | Category:Ελληνικά\nHebrew | עברית | he | Category:עברית\nHungarian | Magyar | hu | Category:Magyar\nIndonesian | Bahasa Indonesia | id | Category:Bahasa Indonesia\nItalian | Italiano | it | Category:Italiano\nJapanese | 日本語 | ja | – | https://wiki.archlinux.jp/\nKorean | 한국어 | ko | Category:한국어\nLithuanian | Lietuvių | lt | Category:Lietuvių\nNorwegian (Bokmål) | Norsk Bokmål | not configured | Category:Norsk Bokmål\nPolish | Polski | pl | Category:Polski\nPortuguese | Português | pt | Category:Português\nRomanian | Română | not configured | Category:Română\nRussian | Русский | ru | Category:Русский\nSerbian | Српски (Srpski) | sr | Category:Српски\nSlovak | Slovenčina | sk | Category:Slovenčina\nSpanish | Español | es | Category:Español\nSwedish | Svenska | sv | Category:Svenska\nThai | ไทย | th | Category:ไทย\nTurkish | Türkçe | tr | Category:Türkçe\nUkrainian | Українська | uk | Category:Українська\nVietnamese | Tiếng Việt | not configured | – | https://archlinuxvn.tuxfamily.org/\n\nSubtags are treated case-insensitively by the MediaWiki backend. By convention, the interlanguage links on ArchWiki should use the lowercase form of the subtag. For information regarding subtags, please see:\n\n- https://www.iana.org/assignments/language-subtag-registry\n- https://tools.ietf.org/rfc/bcp/bcp47.txt\n- https://r12a.github.io/app-subtags/\n\n"
    },
    {
      "title": "Adding local interlanguage links",
      "level": 3,
      "content": "If you want interlanguage links to be enabled for a new language hosted in wiki.archlinux.org, please open a request in Help talk:I18n. Note that a minimum number of translated articles will be required by the administrators for the request to be fulfilled. The following checklist summarizes the steps needed to add a new language:\n\n1. Notify about the new language in Help talk:I18n. Make sure to include the information needed to fill out the #Languages table.\n1. Create a base language category under Category:Languages and add the translated articles to it or a subcategory.\n1. A maintainer should update the #Languages table.\n1. Translate at least Main page, Arch Linux, Installation guide and General recommendations.\n1. Initialize a translation of Table of contents: it will then be kept up to date with a bot, see below.\n1. An administrator should consider the request; a maintainer should then update the #Languages table accordingly.\n1. An administrator should add the language prefix to Special:Interwiki and update AbuseFilter/4 and AbuseFilter/13.\n1. Developers should update the respective ArchWiki:Bots to support the new language.\n\n"
    },
    {
      "title": "Adding external interlanguage links",
      "level": 3,
      "content": "If you want interlanguage links to be set for a new or existing language that has set up a separate wiki, please open a request in Help talk:I18n: the interlanguage links will be set as soon as possible!\n\n"
    },
    {
      "title": "Moving local languages to external wikis",
      "level": 3,
      "content": "Moving local languages to their own wikis is a very welcome and encouraged thing, which will get all the assistance that is needed. There are two possible procedures:\n\n- First move all the articles to the external wiki. Once done, update the interlanguage links to point to the new domain, then fix all their target titles with the new ones. Finally, either delete the local articles, or, upon authorization from the ArchWiki:Maintenance Team, redirect them to the external wiki using the interlanguage links.\n- Set up temporary interlanguage links (e.g. [[ja-temp:Title]]) and use them to redirect the various articles to the external wiki as they are moved one by one. Once the move is complete, point the regular interlanguage links (i.e. [[ja:Title]]) to the external wiki, and update them all with the new target titles. Next, either delete the local redirects, or, upon authorization from the ArchWiki:Maintenance Team, update them to use the regular interlanguage links. Finally, disable the temporary interlanguage links.\n\n"
    }
  ]
}