{
  "title": "Install Arch Linux on LVM",
  "url": "https://wiki.archlinux.org/title/Install_Arch_Linux_on_LVM",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- LVM\n- Installation guide\n\nYou should create your LVM Volumes between the partitioning and formatting steps of the installation procedure. Instead of directly formatting a partition to be your root file system, the file system will be created inside a logical volume (LV).\n\nQuick overview:\n\n- Install the required packages. (refer to LVM#Installation)\n- Create partition(s) where your physical volumes (PVs) will reside.\n- Create your PVs. If you have one disk it is best to just create one PV in one large partition. If you have multiple disks you can create partitions on each of them and create a PV on each partition.\n- Create your volume group (VG) and add all PVs to it.\n- Create logical volumes (LVs) inside that VG.\n- Continue with Installation guide#Format the partitions.\n- When you reach the Installation guide#Initramfs section in the Installation guide, add the lvm2 hook to /etc/mkinitcpio.conf (see below for details).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "You will follow along with the installation guide until you come to Installation guide#Partition the disks. At this point you will diverge and doing all your partitioning with LVM in mind.\n\n"
    },
    {
      "title": "Create partitions",
      "level": 3,
      "content": "First, partition your disks as required before configuring LVM.\n\nCreate the partitions:\n\n- If you use GUID Partition Table, set the partition type GUID to E6D6D379-F507-44C2-A23C-238F2A3DF928 (partition type Linux LVM in fdisk and 8e00 in gdisk).\n- If you use Master Boot Record partition table, set the partition type ID to 8e (partition type Linux LVM in fdisk).\n\n"
    },
    {
      "title": "Create physical volumes",
      "level": 3,
      "content": "To list all your devices capable of being used as a physical volume:\n\n```\n# lvmdiskscan\n```\n\nCreate a physical volume on them:\n\n```\n# pvcreate DEVICE\n```\n\nThis command creates a header on each device so it can be used for LVM. As defined in LVM#LVM building blocks, DEVICE can be any block device, e.g. a disk /dev/sda, a partition /dev/sda2 or a loop back device. For example:\n\n```\n# pvcreate /dev/sda2\n```\n\nYou can track created physical volumes with:\n\n```\n# pvdisplay\n```\n\nYou can also get summary information on physical volumes with:\n\n```\n# pvscan\n```\n\n"
    },
    {
      "title": "Create and extend your volume group",
      "level": 3,
      "content": "First you need to create a volume group on any one of the physical volumes:\n\n```\n# vgcreate volume_group physical_volume\n```\n\nFor example:\n\n```\n# vgcreate VolGroup00 /dev/sda2\n```\n\nSee lvm(8) for a list of valid characters for volume group names.\n\nExtending the volume group is just as easy:\n\n```\n# vgextend volume_group physical_volume\n```\n\nFor example, to add both sdb1 and sdc to your volume group:\n\n```\n# vgextend VolGroup00 /dev/sdb1\n# vgextend VolGroup00 /dev/sdc\n```\n\nYou can track how your volume group grows with:\n\n```\n# vgdisplay\n```\n\nThis is also what you would do if you wanted to add a disk to a RAID or mirror group with failed disks.\n\n"
    },
    {
      "title": "Combined creation of physical volumes and volume groups",
      "level": 4,
      "content": "LVM allows you to combine the creation of a volume group and the physical volumes in one easy step. For example, to create the group VolGroup00 with the three devices mentioned above, you can run:\n\n```\n# vgcreate VolGroup00 /dev/sda2 /dev/sdb1 /dev/sdc\n```\n\nThis command will first set up the three partitions as physical volumes (if necessary) and then create the volume group with the three volumes. The command will warn you if it detects an existing filesystem on any devices.\n\n"
    },
    {
      "title": "Create logical volumes",
      "level": 3,
      "content": "- If you wish to use snapshots, logical volume caching, thin provisioned logical volumes or RAID see LVM#Logical volumes.\n- If a logical volume will be formatted with ext4, leave at least 256 MiB free space in the volume group to allow using e2scrub(8). After creating the last volume with -l 100%FREE, this can be accomplished by reducing its size with lvreduce -L -256M volume_group/logical_volume.\n\nNow we need to create logical volumes on this volume group. You create a logical volume with the next command by specifying the new volume's name and size, and the volume group it will reside on:\n\n```\n# lvcreate -L size volume_group -n logical_volume\n```\n\nFor example:\n\n```\n# lvcreate -L 10G VolGroup00 -n lvolhome\n```\n\nThis will create a logical volume that you can access later with /dev/VolGroup00/lvolhome. Just like volume groups, you can use any name you want for your logical volume when creating it besides a few exceptions listed in lvm(8) ยง VALID_NAMES.\n\nYou can also specify one or more physical volumes to restrict where LVM allocates the data. For example, you may wish to create a logical volume for the root filesystem on your small SSD, and your home volume on a slower mechanical drive. Simply add the physical volume devices to the command line, for example:\n\n```\n# lvcreate -L 10G VolGroup00 -n lvolhome /dev/sdc1\n```\n\nTo use all the free space left in a volume group, use the next command:\n\n```\n# lvcreate -l 100%FREE  volume_group -n logical_volume\n```\n\nYou can track created logical volumes with:\n\n```\n# lvdisplay\n```\n\n"
    },
    {
      "title": "Format and mount logical volumes",
      "level": 3,
      "content": "Your logical volumes should now be located in /dev/YourVolumeGroupName/. If you cannot find them, use the next commands to bring up the module for creating device nodes and to make volume groups available:\n\n```\n# modprobe dm_mod\n# vgscan\n# vgchange -ay\n```\n\nNow you can format your logical volumes and mount them as normal partitions (see mount a file system for additional details):\n\n```\n# mkfs.fstype /dev/volume_group/logical_volume\n# mount /dev/volume_group/logical_volume /mountpoint\n```\n\nFor example:\n\n```\n# mkfs.ext4 /dev/VolGroup00/lvolhome\n# mount /dev/VolGroup00/lvolhome /home\n```\n\nNote: **not** \n\n"
    },
    {
      "title": "Configure the system",
      "level": 2,
      "content": "Make sure the lvm2 package is installed.\n\n"
    },
    {
      "title": "Adding mkinitcpio hooks",
      "level": 3,
      "content": "In case your root filesystem is on LVM, you will need to enable the appropriate mkinitcpio hooks, otherwise your system might not boot. Enable:\n\n- udev and lvm2 for the default busybox-based initramfs\n- systemd and lvm2 for systemd-based initramfs\n\nudev is there by default. Edit the file and insert lvm2 between block and filesystems like so:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=(base udev ... block lvm2 filesystems)\n```\n\nFor systemd based initramfs:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=(base systemd ... block lvm2 filesystems)\n```\n\nAfterwards, you can continue in normal installation instructions with the recreate the initramfs image step.\n\n"
    },
    {
      "title": "Kernel boot options",
      "level": 3,
      "content": "If the root file system resides in a logical volume, the root= kernel parameter must be pointed to the mapped device, e.g /dev/vg-name/lv-name.\n\n"
    }
  ]
}