{
  "title": "Internationalization/Chinese",
  "url": "https://wiki.archlinux.org/title/Internationalization/Chinese",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Localization/Simplified Chinese\n- Localization_(正體中文)/Chinese_(正體中文)\n\nThis article describes how to set up a Chinese language environment.\n\n"
    },
    {
      "title": "Fonts",
      "level": 2,
      "content": "- adobe source han fonts 思源字体 adobe-source-han-sans-cn-fonts - Simplified Chinese OpenType/CFF Sans fonts adobe-source-han-sans-tw-fonts - Traditional Chinese OpenType/CFF Sans fonts adobe-source-han-sans-hk-fonts - Hong Kong Chinese OpenType/CFF Sans fonts adobe-source-han-serif-cn-fonts - Simplified Chinese OpenType/CFF Serif fonts adobe-source-han-serif-tw-fonts - Traditional Chinese OpenType/CFF Serif fonts adobe-source-han-serif-hk-fonts - Hong Kong Chinese OpenType/CFF Serif fonts\n- noto Chinese fonts (include adobe source han fonts and other fonts) noto-fonts - Google Noto TTF fonts noto-fonts-cjk - Google Noto CJK fonts noto-fonts-emoji - Google Noto emoji fonts noto-fonts-scAUR - Noto CJK-SC fonts for Simplified Chinese noto-fonts-tcAUR - Noto CJK-TC fonts for Traditional Chinese\n- wqy fonts wqy-microhei - WenQuanYi Micro Hei font family (also known as Hei, Gothic or Dotum) is a sans-serif style derived from Droid Sans Fallback, it offers high quality CJK outline font and it is extremely compact (~5M). wqy-zenhei - Hei Ti Style (sans-serif) Chinese Outline font embedded with bitmapped Song Ti (also supporting Japanese (partial) and Korean characters). wqy-bitmapfont - Bitmapped Song Ti (serif) Chinese font.\n- arphic fonts ttf-arphic-ukai - Kaiti (brush stroke) Unicode font (enabling anti-aliasing is suggested) ttf-arphic-uming - Mingti (printed) Unicode font\n- opendesktop-fonts - New Sung font, previously is ttf-fireflysung package\n- ttf-hannom - Chinese and Vietnamese ttf fonts\n- Standard fonts of Traditional Chinese ttf-twAUR - Kai and Song traditional Chinese font from the Ministry of Education of Taiwan ttf-twcns-fontsAUR Chinese TrueType fonts by Ministry of Education of Taiwan government, supporting CNS11643 standard, including Kai and Sung fontface.\n- Windows Chinese fonts ttf-ms-win8-zh_cnAUR - windows8 simple Chinese fonts. ttf-ms-win8-zh_twAUR - windows8 traditional Chinese fonts. ttf-ms-win10-zh_cnAUR - windows10 simple Chinese fonts. ttf-ms-win10-zh_twAUR - windows10 traditional Chinese fonts. ttf-ms-win11-zh_cnAUR - windows11 simple Chinese fonts. ttf-ms-win11-zh_twAUR - windows11 traditional Chinese fonts.\n- ttf-i.bmingAUR - CJK serif font that emphasis on an old-style typeface.\n- ttf-sarasa-gothic - Sarasa Gothic, which is a CJK monospaced font based on Iosevka and Source Han Sans.\n\n- adobe-source-han-sans-cn-fonts - Simplified Chinese OpenType/CFF Sans fonts\n- adobe-source-han-sans-tw-fonts - Traditional Chinese OpenType/CFF Sans fonts\n- adobe-source-han-sans-hk-fonts - Hong Kong Chinese OpenType/CFF Sans fonts\n- adobe-source-han-serif-cn-fonts - Simplified Chinese OpenType/CFF Serif fonts\n- adobe-source-han-serif-tw-fonts - Traditional Chinese OpenType/CFF Serif fonts\n- adobe-source-han-serif-hk-fonts - Hong Kong Chinese OpenType/CFF Serif fonts\n\n- noto-fonts - Google Noto TTF fonts\n- noto-fonts-cjk - Google Noto CJK fonts\n- noto-fonts-emoji - Google Noto emoji fonts\n- noto-fonts-scAUR - Noto CJK-SC fonts for Simplified Chinese\n- noto-fonts-tcAUR - Noto CJK-TC fonts for Traditional Chinese\n\n- wqy-microhei - WenQuanYi Micro Hei font family (also known as Hei, Gothic or Dotum) is a sans-serif style derived from Droid Sans Fallback, it offers high quality CJK outline font and it is extremely compact (~5M).\n- wqy-zenhei - Hei Ti Style (sans-serif) Chinese Outline font embedded with bitmapped Song Ti (also supporting Japanese (partial) and Korean characters).\n- wqy-bitmapfont - Bitmapped Song Ti (serif) Chinese font.\n\n- ttf-arphic-ukai - Kaiti (brush stroke) Unicode font (enabling anti-aliasing is suggested)\n- ttf-arphic-uming - Mingti (printed) Unicode font\n\n- ttf-twAUR - Kai and Song traditional Chinese font from the Ministry of Education of Taiwan\n- ttf-twcns-fontsAUR Chinese TrueType fonts by Ministry of Education of Taiwan government, supporting CNS11643 standard, including Kai and Sung fontface.\n\n- ttf-ms-win8-zh_cnAUR - windows8 simple Chinese fonts.\n- ttf-ms-win8-zh_twAUR - windows8 traditional Chinese fonts.\n- ttf-ms-win10-zh_cnAUR - windows10 simple Chinese fonts.\n- ttf-ms-win10-zh_twAUR - windows10 traditional Chinese fonts.\n- ttf-ms-win11-zh_cnAUR - windows11 simple Chinese fonts.\n- ttf-ms-win11-zh_twAUR - windows11 traditional Chinese fonts.\n\n- Founder Type Fonts 方正字体 Founder Type Fonts\n- MiSans 小米字体 MiSans font\n\n- Founder Type Fonts\n\n- MiSans font\n\n"
    },
    {
      "title": "Input methods",
      "level": 2,
      "content": "See Input method#List of available input method editors\n\n"
    }
  ]
}