{
  "title": "Ipset",
  "url": "https://wiki.archlinux.org/title/Ipset",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Firewall\n- iptables\n\nipset is a companion application for the iptables Linux firewall. It allows you to setup rules to quickly and easily block a set of IP addresses, among other things.\n\nThe iptables successor nftables has a built-in infrastructure for using sets. The ipset-translate tool can be used to transform \"ipsets\" (for iptables) into nftables sets, see Moving from ipset to nftables for details.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the ipset package.\n\n"
    },
    {
      "title": "Blocking a list of networks",
      "level": 3,
      "content": "Start by creating a new \"set\" of network addresses. This creates a new \"hash\" set of \"net\" network addresses named \"myset\".\n\n```\n# ipset create myset hash:net\n```\n\nor\n\n```\n# ipset -N myset nethash\n```\n\nAdd any IP address that you would like to block to the set.\n\n```\n# ipset add myset 14.144.0.0/12\n# ipset add myset 27.8.0.0/13\n# ipset add myset 58.16.0.0/15\n# ipset add myset 1.1.1.0/24\n```\n\nFinally, configure iptables to block any address in that set. This command will add a rule to the top of the \"INPUT\" chain to \"-m\" match the set named \"myset\" from ipset (--match-set) when it is a \"src\" packet and \"DROP\", or block, it.\n\n```\n# iptables -I INPUT -m set --match-set myset src -j DROP\n```\n\n"
    },
    {
      "title": "Blocking a list of IP addresses",
      "level": 3,
      "content": "Start by creating a new \"set\" of ip addresses. This creates a new \"hash\" set of \"ip\" addresses named \"myset-ip\".\n\n```\n# ipset create myset-ip hash:ip\n```\n\nor\n\n```\n# ipset -N myset-ip iphash\n```\n\nAdd any IP address that you would like to block to the set.\n\n```\n# ipset add myset-ip 1.1.1.1\n# ipset add myset-ip 2.2.2.2\n```\n\nFinally, configure iptables to block any address in that set.\n\n```\n# iptables -I INPUT -m set --match-set myset-ip src -j DROP\n```\n\n"
    },
    {
      "title": "Making ipset persistent",
      "level": 3,
      "content": "The ipset you have created is stored in memory and will be gone after reboot. To make the ipset persistent you have to do the followings:\n\nFirst, save the ipset to /etc/ipset.conf:\n\n```\n# ipset save > /etc/ipset.conf\n```\n\nThen enable ipset.service, which works similarly to iptables.service for restoring iptables rules.\n\n"
    },
    {
      "title": "Blocking with PeerGuardian and other blocklists",
      "level": 3,
      "content": "The pg2ipset-gitAUR tool by the author of Maeyanie.com, coupled with the ipset-update.sh script, can be used with cron to automatically update various blocklists. Currently, by default, blocking of: country, tor exit node and Bluetack pg2 list are implemented.\n\n"
    },
    {
      "title": "Other commands",
      "level": 2,
      "content": "To view the sets:\n\n```\n# ipset list\n```\n\nor\n\n```\n# ipset -L\n```\n\nTo delete a set:\n\n```\n# ipset destroy myset\n```\n\nor\n\n```\n# ipset -X myset\n```\n\nTo delete all sets:\n\n```\n# ipset destroy\n```\n\nPlease see the ipset(8) for further information.\n\n"
    },
    {
      "title": "Optimization",
      "level": 2,
      "content": "The iprangeAUR tool can help to reduce entries in ipset.conf by merging adjacent ranges or eliminating overlapped ranges. This can improve the router/firewall performance if the table size is huge. This tool can also convert a list of hostnames to IPs.\n\nAlthough ipset is designed to be able to scale well, that does not mean infinitely. In particular, some nations have very large IP address spaces, which will cause geoblocking to be inefficient.\n\n"
    }
  ]
}