{
  "title": "Kernel Module Package Guidelines",
  "url": "https://wiki.archlinux.org/title/Kernel_Module_Package_Guidelines",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "32-bit – CLR – CMake – Cross – DKMS – Eclipse – Electron – Font – Free Pascal – GNOME – Go – Haskell – Java – KDE – Kernel modules – Lisp – Meson – MinGW – Node.js – Nonfree – OCaml – Perl – PHP – Python – R – Ruby – Rust - Security – Shell – VCS – Web – Wine\n\n"
    },
    {
      "title": "Package separation",
      "level": 2,
      "content": "Packages that contain kernel modules should be treated specially, to support users who wish to have more than one kernel installed on a system.\n\nWhen packaging software containing a kernel module and other non-module supporting files/utilities, it is important to separate the kernel modules from the supporting files.\n\n"
    },
    {
      "title": "Guidelines",
      "level": 3,
      "content": "When packaging such software (using the NVIDIA drivers as an example) the convention is:\n\n- create an nvidia package containing just the kernel modules built for the vanilla kernel\n- create an nvidia-utils package containing the supporting files\n- make sure nvidia depends on nvidia-utils (unless there is a good reason not to do so)\n- for another kernel like linux-mm, create nvidia-mm containing the kernel modules built against that kernel which provides nvidia and also depends on nvidia-utils\n- make sure nvidia depends on the kernel, for example:depends=('linux' 'nvidia-utils')\n\n```\ndepends=('linux' 'nvidia-utils')\n```\n\n"
    },
    {
      "title": "Rationale",
      "level": 3,
      "content": "While kernel modules built for different kernels always live in different directories and can peacefully coexist, the supporting files are expected to be found in one location. If one package contained module and supporting files, you would be unable to install the modules for more than one kernel because the supporting files in the packages would cause pacman file conflicts.\n\nThe separation of modules and accompanying files allows multiple kernel module packages to be installed for multiple kernels on the same system while sharing the supporting files among them in the expected location.\n\n"
    },
    {
      "title": "File placement",
      "level": 2,
      "content": "If a package includes a kernel module that is meant to override an existing module of the same name, such module should be placed in the /lib/modules/X.Y.Z-arch1-1/updates directory. When depmod is run, modules in this directory will take precedence.\n\n"
    }
  ]
}