{
  "title": "Leitura offline",
  "url": "https://wiki.archlinux.org/title/Leitura_offline",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Help:Leitura\n\nA instância oficial de MediaWiki do ArchWiki pode ser acessada em https://wiki.archlinux.org com qualquer navegador web.\n\nNote que algumas traduções estão hospedadas externamente sob nomes de domínio diferentes. Veja Help:i18n (Português)#Idiomas.\n\n"
    },
    {
      "title": "Pesquisa",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nO MediaWiki possui suporte a pesquisa de texto completo, veja a caixa de pesquisa no topo da página. As limitações desse recurso é que ele indexa apenas palavras com mais de 3 caracteres. Se você quiser procurar palavras mais curtas (de 1 a 3 caracteres), uma solução conhecida é usar o recurso sitesearch do Google. Digite seus itens de pesquisa no formulário e ele pesquisará automaticamente no ArchWiki.\n\nÉ claro, você pode fazer a mesma pesquisa manualmente anexando site:wiki.archlinux.org às pesquisas do Google:\n\n```\nseus termos de pesquisa site:wiki.archlinux.org\n```\n\nIsso funciona bem, mas não é em tempo real. O Google indexa o ArchWiki a cada 1 a 3 dias.\n\n"
    },
    {
      "title": "Bangs de mecanismos de busca",
      "level": 3,
      "content": "Muitos mecanismos de busca como Searx, DuckDuckGo e outros oferecem o recurso \"search bang\" para pesquisar diretamente no ArchWiki. Após adicionar um mecanismo de busca de suporte como o mecanismo de busca padrão do seu navegador, você pode digitar diretamente uma consulta como esta na sua barra de URL:\n\n```\n!archwiki seus termos de pesquisa\n```\n\nou a versão curta\n\n```\n!aw seus termos de pesquisa\n```\n\n"
    },
    {
      "title": "Atalhos de mecanismos de busca para navegadores baseados em Chromium",
      "level": 3,
      "content": "1. Digite chrome://settings/searchEngines na barra de endereço. Clique em \"Adicionar\" em \"Pesquisa no site\". Altere chrome:// para seu navegador conforme necessário.\n1. No campo \"Search engines\", nomeie esta entrada, por exemplo, \"ArchWiki\".\n1. No campo \"Shortcut\", digite o texto que acionará este mecanismo de busca na barra de endereço, por exemplo, !aw\n1. No campo \"URL com %s no lugar da consulta\", digite https://wiki.archlinux.org/title/Special:Search/%s como URL.\n1. Clique no botão \"Add\". O atalho da barra de endereço agora está ativo.\n\n"
    },
    {
      "title": "Localizando artigos relacionados",
      "level": 2,
      "content": "Todo artigo no ArchWiki é categorizado. As categorias de uma página são exibidas no topo. Por exemplo, esta página é categorizada com Category:Help (Português). Você pode ver a hierarquia de categorias na Tabela de conteúdo.\n\nAlém disso, muitos artigos vinculam diretamente a artigos relacionados com uma caixa Artigos relacionados na parte superior do artigo.\n\n"
    },
    {
      "title": "Visualização offline",
      "level": 2,
      "content": "Arch Wiki pode ser baixado para um conveniente uso offline.\n\n"
    },
    {
      "title": "Pacotes",
      "level": 3,
      "content": "- arch-wiki-docs — Páginas do ArchWiki otimizadas para navegação offline.\n\n- arch-wiki-lite — O Arch-wiki-lite foi projetado para oferecer a experiência mais suave possível para pessoas pobres que não têm acesso à Internet ou qualquer maneira de iniciar um navegador gráfico.\n\n- wikiman — Mecanismo de busca offline para páginas de manual, Arch Wiki, Gentoo Wiki e outras documentações.\n\n- wikiman — Mecanismo de pesquisa para páginas de manual, Arch Wiki, Gentoo Wiki e outras documentações.\n\n- archwiki-offline — Script simples para experiência offline do Arch Wiki com menus de listagem preferenciais, permitindo acesso contínuo à página offline.\n\n"
    },
    {
      "title": "Alternativas",
      "level": 3,
      "content": "kiwix-desktop-gitAUR permite navegar em um formato compactado em zim. O arquivo zim do ArchWiki pode ser baixado de https://library.kiwix.org.\n\n"
    },
    {
      "title": "Visualizadores online alternativos",
      "level": 2,
      "content": "- Wikicurses — Uma interface simples de curses para sites do MediaWiki, como o ArchWiki ou o Wikipédia.\n\n"
    }
  ]
}