{
  "title": "Lenovo ThinkPad P70",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_P70",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) |  | Yes\nGPU (Quadro M3000M) |  | Yes\nGPU (Quadro M4000M) |  | Yes\nEthernet |  | Yes\nWireless |  | Yes\nAudio |  | Yes\nTrackpad |  | Yes\nTrackpoint |  | Yes\nWebcam |  | Yes\nCard reader |  | untested\nBluetooth |  | untested\n\n"
    },
    {
      "title": "Preliminaries",
      "level": 2,
      "content": "1. Create a recovery device in Windows 10. It required a USB-only (no SD card, no optical media?) flash drive greater than 8 GB. Formatting FAT32 works.\n1. Update the BIOS. Lenovo provides a bootable, standalone \"BIOS Update CD\" to perform this update outside of Windows.\n1. Getting into the BIOS is difficult, so here are some instructions that seemed to work. The easiest way was through Windows 10.\n1. In the BIOS, you will want to disable UEFI Secure Boot, change the boot order to look at USB devices first, allow F12 to bypass the BIOS, and possibly enable the verbose mode because it is easier to press the appropriate buttons on time.\n\n"
    },
    {
      "title": "Keyboard",
      "level": 2,
      "content": "To control the keyboard backlight, you change the value using:\n\n```\n# echo 1 > /sys/class/leds/tpacpi::kbd_backlight/brightness\n```\n\nfor values 0–2.\n\n"
    },
    {
      "title": "Video",
      "level": 2,
      "content": "There is a BIOS option for turning off the Intel Integrated Graphics and only running the NVIDIA discrete card. While it is possible to get the console working with this configuration, there are no confirmed reports of X.org working in this setup.\n\n"
    },
    {
      "title": "External displays",
      "level": 3,
      "content": "DisplayPort over USB-C, HDMI, and Mini DisplayPort outputs all work using the above configuration with the proprietary Nvidia driver. HDMI has also been confirmed to work using Bumblebee and intel-virtual-output.\n\nLimited testing suggests that a maximum of 3 total displays from 2 output types may be used at one time. For example, two external DP/USB-C displays and the one internal display will achieve the maximum of three.\n\n"
    }
  ]
}