{
  "title": "Lenovo Yoga 9 14ITL5",
  "url": "https://wiki.archlinux.org/title/Lenovo_Yoga_9_14ITL5",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nTouchscreen |  | Yes\nStylus |  | Yes\nVideo | 8086:9a49 | Yes\nWebcam (Chicony) | 04f2:b61e | Yes\nBluetooth | 8087:0026 | Yes\nAudio | 8086:a0c8 | Yes\nWireless | 8086:a0f0 | Yes\nAccelerometer | 8086:a0fc | Yes\nTablet mode trigger |  | Yes\nFingerprint reader | 0bda:5812 | No\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Use F2 to enter BIOS. You must disable Secure Boot to be able to boot from the installation media. UEFI boot mode (OS Optimized Defaults) is working fine and can be used.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Support for firmware updates through fwupd is supported. But Lenovo so far only provides firmware updates for devices where Linux is officially supported (Thinkpad/ThinkCentre series). As this is not a device of these series, do not expect firmware updates through fwupd.\n\nFirmware updates through fwupd are supported (but unavailable) for the following components:\n\n- System firmware (Lenovo)\n- UEFI (Lenovo)\n- NVM Express Solid State Drive (Sandisk)\n\n"
    },
    {
      "title": "Suspend",
      "level": 2,
      "content": "Suspending to system sleep state S3 is not available on the Intel 11th gen mobile CPUs found in this laptop [1]. Forcibly suspending the device to S3 leads to it locking up. If this happens, you can restore your device to working order via a hard reset. To hard reset the Yoga 9, press the power button for at least 15 seconds.\n\nMore recent Linux kernels will instead detect and use system sleep state S0ix automatically. Depending on your specific hardware configuration you may experience fast battery drain when using S0ix. The likely cause is a bug in the firmware of the SSD (WDC PC SN730 SDBPNTY-1T00-1101, Firmware (fwupd): 11170001) that keeps it in the D0 state (fully on state). This keeps part of the platform in an inefficient S0ix state with some PCIe busses running on full power. To verify whether this bug impacts your specific setup, use the S0ixSelftestTool. Discussion around this bug and potential solutions can be found in Talk:Lenovo Yoga 9 14ITL5.\n\nIf you wish to eliminate battery drain, but still want to benefit from the fast wakeup times of S0ix, consider using Suspend then Hibernate (Power management/Suspend and hibernate#Hibernation). You can configure your machine to hibernate after sleeping in S0ix for a specific duration of time by configuring the lid close action to suspend-then-hibernate and tuning HibernateDelaySec.\n\n"
    },
    {
      "title": "Accelerometer",
      "level": 2,
      "content": "You must use iio-sensor-proxy-gitAUR instead of iio-sensor-proxy for the accelerometer to work. It is important to note, that the trigger for tablet mode does currently not work. At least within KDE you can enable automatic screen rotation only globally.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "This laptop requires Sound Open Firmware in order for the soundcard to work.\n\n"
    },
    {
      "title": "Thermals",
      "level": 2,
      "content": "It is recommended to enable OS Optimized Defaults in the BIOS settings. Enabling this option improves the thermal properties of the system tremendously. Without it, thermald will not throttle the system before it is near its critical temperature. You may want to select the appropriate cooling strategy in the BIOS (intelligent/performance/power saving).\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "Tools like tp_smapi or tpacpi-bat do not work with this device.\n\nTo set the Battery Conservation Mode see Laptop/Lenovo#Battery conservation mode.\n\n"
    },
    {
      "title": "Wireless devices",
      "level": 2,
      "content": "Rfkill reports two additional devices (ideapad_wlan, ideapad_bluetooth). Blocking or unblocking these devices has no effect. Instead use the devices:\n\n- phy0 for Wireless LAN\n- hci0 for Bluetooth\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Fn lock only locks for F1 to F12. The Ins and the PrintScreen buttons still require the use of Fn even with Fn lock enabled.\n\nThe keys Fn+Ins and Fn+PrintScreen only function with ideapad-wmi-fn-keys-dkms-gitAUR.\n\nTable content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Toggles Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86AudioMicMute\nFn+F5 | Yes | Yes | XF86MonBrightnessDown\nFn+F6 | Yes | Yes | XF86MonBrightnessUp\nFn+F7 | Yes | Yes | Super+p\nFn+F8 | Yes | Yes | XF86RFKill\nFn+F9 | Yes | Yes | Super+i\nFn+F10 | Yes | Yes | Super+l\nFn+F11 | Yes | Yes | Ctrl+Alt+Tab\nFn+F12 | Yes | Yes | XF86Calculator\n\"Star\" with 'S' | Yes4 | Yes | XF86Launch1\n\"Star\" with 'S' (long pressed) | Yes4 | Yes | XF86XK_Favorites\n\"Dashed circle\" with \"scissor\" | Yes4 | Yes | F14\nFn+Space | No | Yes | Cycles states of keyboard backlight\nFn+Up | Yes | Yes | PageUp (in xev Prior)\nFn+Down | Yes | Yes | PageDown (in xev Next)\nFn+Left | Yes | Yes | Home\nFn+Right | Yes | Yes | End\n\n1. The key is visible to xev and similar tools.\n1. The physical key has a symbol on it, which describes its function.\n1. systemd-logind handles this by default.\n1. Only with ideapad-wmi-fn-keys-dkms-gitAUR\n\n"
    },
    {
      "title": "Tablet Mode",
      "level": 2,
      "content": "Installing yoga-usage-mode-dkms-gitAUR will generate the necessary events to trigger tablet mode.\n\n"
    }
  ]
}