{
  "title": "Lenovo ThinkPad X1 Nano (Gen 2)",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_X1_Nano_(Gen_2)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nVideo |  | Yes\nWireless |  | Yes\nMobile broadband |  | No\nAudio |  | Yes\nTouchPad |  | Yes\nTrackPoint |  | Yes\nWebcam |  | Partial\nFingerprint reader |  | Yes\nBluetooth |  | Yes\nNFC |  | Untested\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "This laptop requires Sound Open Firmware in order for the sound card to work. With this firmware, microphone and speakers are fully operational.\n\nOn the headphone jack, a buzz/noise might be audible that even changes with different CPU usage. The fix is to install the alsa-tools package and then run\n\n```\nhda-verb /dev/snd/hwC0D0 0x1d SET_PIN_WIDGET_CONTROL 0x0\n```\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 2,
      "content": "The fingerprint reader works out of the box using fprintd. See Fprint.\n\n"
    },
    {
      "title": "Camera",
      "level": 2,
      "content": "For Tiger/Alder Lake platforms, Intel offers a more sophisticated smartphone-like integrated \"IPU6/MIPI\" camera that talks through their IPU chip. Linux support is currently hacky at best, having been developed on Chromebooks and with Intel/Dell/Ubuntu cobbling together support from the Windows driver. See these messages on the kernel mailing list for a discussion on the state of upstreaming a real API for these cameras.\n\nIt is supposedly possible to get it working in Arch.\n\nSee this forum post on getting the Alder lake IPU6 camera working in an XPS 13.\n\nThe specific camera model in the X1 Nano Gen2 is an OV2740[dead link 2024-10-12 ⓘ]\n\n"
    },
    {
      "title": "Powersaving",
      "level": 2,
      "content": "This laptop works nearly out of the box with tlp; however, the WWAN chip currently has issues with runtime power management and will prevent booting if runtime-pm is enabled for the device. To exclude it, modify the tlp configuration like:\n\n```\n/etc/tlp.conf\n```\n\n```\nRUNTIME_PM_DENYLIST=\"08:00.0\"\n```\n\n\"throttled\" works effectively for tightly monitoring CPU speeds and performance if so desired, and works around some firmware issues.\n\n"
    },
    {
      "title": "Performance modes",
      "level": 3,
      "content": "Lenovo supports 'platform-profiles' on newer kernels which can rather dramatically improve performance by decreasing throttling, or greatly improve battery life and thermals by lowering the CPU's power limit. These modes can result in over a 100% increase or decrease in CPU power draw.\n\nThe default mode is \"balanced\" however users can switch between these modes using the following keyboard shortcuts:\n\n- Fn+l - Low-power mode\n- Fn+m - Balanced mode (aka Medium)\n- Fn+h - Performance mode (aka High)\n\nThese modes can also be selected automatically by using tlp and the PLATFORM_PROFILE_ON_AC/BAT configuration fields.\n\nThe currently active mode can be checked with the following command:\n\n```\n# cat /sys/firmware/acpi/platform_profile\n```\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "UEFI firmware and other device firmware is available through the Linux Vendor Firmware Service (LVFS), and can be installed using fwupd.\n\nSecure boot works out of the box with custom keys from multiple tools, including sbctl.\n\n"
    },
    {
      "title": "Function Keys",
      "level": 2,
      "content": "In the firmware configuration it is possible to swap the Ctrl and Fn keys.\n\nSome of the function keys have keycodes with values that are too high to use in X, which truncates values past 248. In Wayland, these keys might be difficult to map but can be doable manually using the in your desktop environment by specifying the XF86 keysym by hand from the table below. For example, in Gnome you can use dconf-editor to modify entries in /org/gnome/settings-daemon/plugins/media-keys/ and other settings locations.\n\nTable content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Toggles Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86AudioMicMute\nFn+F5 | Yes | Yes | XF86MonBrightnessDown\nFn+F6 | Yes | Yes | XF86MonBrightnessUp\nFn+F7 | Yes | Yes | XF86Display\nFn+F8 | Yes | Yes | XF86WLAN\nFn+F9 | Wayland-only | Yes | XF86NotificationCenter\nFn+F10 | Wayland-only | Yes | XF86PickupPhone\nFn+F11 | Wayland-only | Yes | XF86HangupPhone\nFn+F12 | Yes | Yes | XF86Favorites\nFn+PrtSc | Wayland-only | Yes | XF86SelectiveScreenshot\nFn+Space | Yes | Yes | XF86SelectiveScreenshot\nFn+4 | Yes | No | XF86Sleep\nFn+Left | Yes | No | Home\nFn+Right | Yes | No | End\nFn+l | No | No | Switch to low power mode\nFn+m | No | No | Switch to balanced/medium power mode\nFn+h | No | No | Switch to performance/high power mode\n\n1. The key is visible to xev and similar tools. Wayland-only indicates the code can only be seen from a Wayland session.\n1. The physical key has a symbol on it, which describes its function.\n\n"
    }
  ]
}