{
  "title": "Lenovo ThinkPad P1",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_P1",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nLenovo ThinkPad P1 was released in 2018 and has up to Intel Core i7-8850H or Xeon E-2176M 6-core processor, up to 64 GB DDR4 RAM, and up to NVIDIA Quadro P2000 graphics.\n\n"
    },
    {
      "title": "Do not change to \"Discrete Graphics\" with BIOS v1.15",
      "level": 3,
      "content": "https://www.reddit.com/r/thinkpad/comments/a2g0k4/warning_do_not_change_from_hybrid_graphics_to/\n\nThis might potentially brick your device and require Lenovo to replace your motherboard. Apparently verified on BIOS v1.15 and still not resolved.\n\nYou will want to use BIOS v1.18 or newer. BIOS v1.17 (released Dec 24, 2018) originally fixed the issue for the mass majority; however, this version has been removed due to additional bricking issues that happen occasionally related to the Hybrid graphics options when changed.\n\n"
    },
    {
      "title": "Firmware update",
      "level": 3,
      "content": "Before installation, it is recommended that you boot into Windows 10 and use the preinstalled Lenovo Vantage software to install any necessary firmware updates, particularly this one.\n\n"
    },
    {
      "title": "Installation with hybrid graphics",
      "level": 3,
      "content": "Currently the live CD might not boot normally if your BIOS is configured to enable hybrid graphics. See NVIDIA Optimus for details. Two options are possible:\n\n- Disable hybrid graphics by changing your BIOS settings to \"Discrete only\" (Be careful, this might brick your latpop: #Do not change to \"Discrete Graphics\" with BIOS v1.15)\n- Alternatively, before booting into live CD, press e and add modprobe.blacklist=nouveau to your kernel parameters.\n\nIf you choose to use the second option, you might also want to include modprobe.blacklist=nouveau in your /boot/loader/entries/arch.conf.\n\n"
    },
    {
      "title": "HiDPI screen",
      "level": 3,
      "content": "Some configurations of ThinkPad P1 comes with a HiDPI screen. See HiDPI#Linux console (tty) for more details.\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "There are two difficulties with configuring graphics on ThinkPad P1: there is no \"integrated graphics only\" option in the BIOS, and the external display ports (HDMI, etc.) are wired into the NVIDIA chip. Depending on your needs, you might choose from the following options:\n\n"
    },
    {
      "title": "Discrete only",
      "level": 3,
      "content": "As the P1 is an hybrid device with both an integrated and discrete video card, the NVIDIA drivers have to be setup to use Optimus in order to properly work with external outputs and the integrated laptop screen. Setup NVIDIA Optimus as instructed in NVIDIA Optimus#Use NVIDIA graphics only. Note that this method will keep your NVIDIA graphics card always on, which might dramatically shorten your battery life.\n\n"
    },
    {
      "title": "Black screen after X starts with NVIDIA drivers",
      "level": 4,
      "content": "Even if using Optimus, the driver might anyway fail to detect the laptop screen using the auto-generated xorg.conf file and you might experience a black screen after X has been started. See NVIDIA Optimus#No screens found on a laptop/NVIDIA Optimus for more details.\n\nIf you are able to connect an external monitor and verify it works, you can inspect the xrandr -q output to verify only HDMI and Display Port outputs are actually detected. The tool should as well display only external video output connections.\n\nIn order to instruct the driver about the integrated laptop screen, the xorg.conf file has to be modified to add a \"ConnectedMonitor\" Option to the Section \"Device\" (see NVIDIA/Troubleshooting#Screen(s) found, but none have a usable configuration)\n\nUse the following as xorg.conf Section \"Device\"\n\n```\nSection \"Device\"\n      Identifier      \"nvidia\"\n      Driver         \"nvidia\"\n      VendorName     \"NVIDIA Corporation\"\n      BusId          \"1:0:0\"\n      Option         \"AllowEmptyInitialConfiguration\"\n      Option\t      \"ConnectedMonitor\" \"eDP\"\n      Option\t      \"CustomEDID\" \"eDP:/sys/class/drm/card0-eDP-1/edid\"\n      Option\t      \"IgnoreEDID\" \"false\"\n      Option\t      \"UseEDID\" \"true\" \n  EndSection\n```\n\nAfter re-starting X, the integrated screen output should show be now detected and properly usable.\n\nIf the laptop screen gets detected but xrandr fails to properly detect the available resolutions, remove the HorizSync and Vertrefresh options from Section \"Monitor\" and restart X\n\n"
    },
    {
      "title": "Hybrid graphics with Reverse PRIME",
      "level": 3,
      "content": "Set up Reverse PRIME to do the main rendering on the Intel chip, while still being able to use the external display outputs wired to the NVIDIA chip. Battery life should remain decent with this option.\n\n"
    },
    {
      "title": "Hybrid graphics with Bumblebee",
      "level": 3,
      "content": "See Bumblebee for detailed instructions. If Xorg refuses to start after setting up Bumblebee, try generating an Xorg configuration by running Xorg -configure and copy it to /etc/X11/xorg.conf.\n\nBecause Bumblebee normally disables the NVIDIA card, display outputs such as HDMI might not show up in xrandr -q. You may want to refer to Bumblebee's multi-monitor setup page.\n\n"
    },
    {
      "title": "Hybrid graphics with bbswitch only",
      "level": 3,
      "content": "This method requires manual switching between integrated and discrete graphics mode. Switching between them requires restarting all Xorg instances, although it does not require a restart.\n\nInstall the appropriate NVIDIA graphics drivers and bbswitch. Generate an Xorg configuration by running Xorg -configure and copy it to /etc/X11/xorg.conf.intel. You may also create /etc/X11/xorg.conf.nvidia, though it should not be necessary.\n\nAfter loading the module with\n\n```\n# modprobe bbswitch\n```\n\nyou can switch to discrete graphics with the following Bash function:\n\n```\ndiscrete() {\n    killall Xorg\n    modprobe nvidia_drm\n    modprobe nvidia_modeset\n    modprobe nvidia\n    tee /proc/acpi/bbswitch <<<ON\n    cp /etc/X11/xorg.conf.nvidia /etc/X11/xorg.conf\n}\n```\n\nAfter this, xrandr -q should correctly show HDMI-0 as one of the outputs. Running xrandr --auto will mirror the display on an external monitor. If you want to extend your display with a different DPI, adapt the following command to your needs:\n\n```\n$ xrandr --output HDMI-0 --scale 2x2 --right-of eDP-1-1\n```\n\nConversely, you can switch to integrated graphics this way:\n\n```\nintegrated() {\n    killall Xorg\n    rmmod nvidia_drm\n    rmmod nvidia_modeset\n    rmmod nvidia\n    tee /proc/acpi/bbswitch <<<OFF\n    cp /etc/X11/xorg.conf.intel /etc/X11/xorg.conf\n}\n```\n\nYou need to manually start your X session after switching.\n\nIf you are also running TLP, to prevent TLP from blocking system startup or shutdown, you should tell it to leave NVIDIA card alone by uncommenting the following line:\n\n```\n/etc/default/tlp\n```\n\n```\nRUNTIME_PM_DRIVER_DENYLIST=\"amdgpu nouveau nvidia radeon\"\n```\n\nYou may also want to refer to nvidia-xrun, which allows for running a separate X session with NVIDIA graphics.\n\n"
    },
    {
      "title": "xbacklight not adjusting screen brightness",
      "level": 3,
      "content": "Installing lightAUR should help.\n\n"
    },
    {
      "title": "System hangs on startup/shutdown",
      "level": 3,
      "content": "If you are using hybrid graphics, ensure that your TLP is correctly blacklisting NVIDIA drivers by uncommenting this line:\n\n```\n/etc/default/tlp\n```\n\n```\nRUNTIME_PM_DRIVER_DENYLIST=\"amdgpu nouveau nvidia radeon\"\n```\n\nAlso make sure that the NVIDIA card is turned on before shutdown by running:\n\n```\n# modprobe nvidia\n```\n\nYou can install systemd services to manage this automatically as as follows:\n\n```\n/etc/systemd/system/nvidia-enable-power-off.service\n```\n\n```\n[Unit]\nDescription=Enable NVIDIA card at shutdown\nDefaultDependencies=no\n\n[Service]\nType=oneshot\nExecStart=/bin/sh -c \"awk '{print $2}' /proc/acpi/bbswitch > /tmp/gpu_state && echo ON > /proc/acpi/bbswitch\"\n#ExecStart=/usr/bin/modprobe nvidia\n\n[Install]\nWantedBy=shutdown.target\nWantedBy=reboot.target\nWantedBy=hibernate.target\nWantedBy=suspend-then-hibernate.target\nWantedBy=sleep.target\nWantedBy=suspend.target\n```\n\nAnd a service to disable the card again at resume if it was originally off:\n\n```\n/etc/systemd/system/nvidia-disable-resume.service\n```\n\n```\n[Unit]\nDescription=Disable NVIDIA card at system resume\nDefaultDependencies=no\nAfter=sleep.target\nAfter=suspend.target\nAfter=suspend-then-hibernate.target\nAfter=hibernate.target\n\n[Service]\nType=oneshot\nExecStart=/bin/sh -c 'cat /tmp/gpu_state > /proc/acpi/bbswitch || echo OFF > /proc/acpi/bbswitch'\n#ExecStart=/usr/bin/rmmod nvidia\n\n[Install]\n#WantedBy=shutdown.target\n#WantedBy=reboot.target\nWantedBy=sleep.target\nWantedBy=suspend.target\nWantedBy=suspend-then-hibernate.target\nWantedBy=hibernate.target\n```\n\n"
    }
  ]
}