{
  "title": "Lenovo Yoga Slim 7 Pro X (14ARH7)",
  "url": "https://wiki.archlinux.org/title/Lenovo_Yoga_Slim_7_Pro_X_(14ARH7)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nGPU (AMD) | 1002:1640 | Yes\nGPU (NVIDIA) | 10de:25e2 | Yes\nWireless (MediaTek) | 14c3:0616 | Yes\n#Wireless (RealTek) | 10ec:b852 | Yes\nBluetooth | 0489:e0d8 | Yes\nAudio | 1022:15e3 | Yes\nMicrophone | 1022:15e2 | Yes\nTouchPad | 04f3:3202 | Yes\nWebcam | 30c9:0057 | Yes\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "See #Accessibility on how to change UEFI settings, disable Secure Boot and boot an Arch installation medium.\n\nIn order to boot the system in a working state (e.g. also from an installation medium), add module_blacklist=nouveau iommu=pt to the kernel parameters so that the system is stable and suspend works. Note that you still need kernel 5.20 or 6.0 to get the internal keyboard working and a patched kernel 6.0 to keep the keyboard working after resuming from suspend (see #Keyboard below).\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The UEFI firmware settings can be entered by pressing F2 repeatedly during boot.\n\n"
    },
    {
      "title": "Navigation",
      "level": 3,
      "content": "The interface can be fully navigated and controlled with a keyboard and mouse. Up and down arrow keys let the user choose categories, settings items within each category and values for settings. Left and right arrow keys let the user leave and enter a category, settings item or value picker. The enter key can also be used to enter a category or enter and leave an item's value picker. Settings can be saved and the system restarted by pressing F10.\n\n"
    },
    {
      "title": "Secure Boot",
      "level": 3,
      "content": "In order to boot an Arch installation medium, Secure Boot must be disabled in the UEFI settings. Once disabled, press F12 on the next boot to enter the boot device menu and select your Arch installation medium.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "This laptop is not supported by fwupd. You need a Windows installation in order to update UEFI.\n\n"
    },
    {
      "title": "Disabling Dedicated GPU",
      "level": 3,
      "content": "It is possible to disable the dedicated NVIDIA GeForce RTX 3050 Mobile GPU in UEFI by selecting the UMA Graphics option of the video mode setting. However, the AMDGPU driver is then not able to properly run the integrated Rembrandt Radeon 680M video adapter.\n\n"
    },
    {
      "title": "Video",
      "level": 2,
      "content": "The nouveau driver that is automatically loaded for the NVIDIA dedicated GPU causes system freezes. Disable it with\n\n```\nmodule_blacklist=nouveau\n```\n\nin your kernel parameters.\n\nThe NVIDIA drivers are untested.\n\nThe screen supports 10-bit color. To enable it for amdgpu driver, refer to AMDGPU#10-bit color\n\n"
    },
    {
      "title": "Wireless",
      "level": 2,
      "content": "The RealTek wireless adapter included in some models does not work out of the box, it needs the rtw89-dkms-gitAUR driver. Intel AX210 cards are compatible and do work out of the box with this computer.\n\n"
    },
    {
      "title": "Keyboard",
      "level": 2,
      "content": "The built-in keyboard does not work with kernels before 5.20. Linux 5.20 and 6.0 include a patch that fixes the keyboard on all AMD Zen systems.\n\nThe keyboard sometimes stops working when resuming from suspend. There is a kernel patch (bug report) for 6.0 to fix this.\n\n"
    },
    {
      "title": "Function Keys",
      "level": 3,
      "content": "Table content:\nKey | Visible? 1 | Marked? 2 | Effect\nFn+Esc | No | Yes | Toggles Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86AudioMicMute\nFn+F5 | Yes | Yes | XF86MonBrightnessDown\nFn+F6 | Yes | Yes | XF86MonBrightnessUp\nFn+F7 | Yes | Yes | ??\nFn+F8 | Yes | Yes | XF86RFKill 3\nFn+F9 | Yes | Yes | Super_L+i\nFn+F10 | Yes | Yes | Super_L+l\nFn+F11 | Yes | Yes | Control_L+Alt_L+Tab\nFn+F12 | Yes | Yes | XF86Calculator\nFn+Ins | No | Yes | ??\nFn+PrtSc | Yes | Yes | Super_L+Shift_L+s\nFn+Q | Yes | No | XF86Launch4\nFn+I | Yes | No | Insert\nFn+P | Yes | No | Pause\nFn+S | Yes | No | Print\nFn+K | Yes | No | Scroll_Lock\nFn+B | Yes | No | Break\nFn+Space | No | Yes | Cycles keyboard backlight brightness\nFn+Left | Yes | Yes | Home\nFn+Right | Yes | Yes | End\nFn+Up | Yes | Yes | PageUp\nFn+Down | Yes | Yes | PageDown\n\n1. The key is visible to xev and similar tools.\n1. The physical key has a symbol on it, which describes its function.\n1. Pressing Fn+F8 always hardware-toggles the Wifi and Bluetooth hardware and additionally releases an XF86RFKill keypress event.\n\n"
    },
    {
      "title": "REISUB",
      "level": 4,
      "content": "The \"magic\" SysRq key sequence REISUB can be sent with the following key-presses:\n\nPress Fn+Alt+R then release Fn while still holding Alt+R and press sequentially E, I, S, U, B.\n\n"
    },
    {
      "title": "CPU Performance Scaling",
      "level": 3,
      "content": "This laptop's AMD Ryzen 6000 series CPUs support the new AMD P-State performance scaling driver, which is driven by the amd_pstate kernel module. However, currently the generic acpi_cpufreq driver takes precedence when booting the linux kernel. In order to activate the amd_pstate module, the acpi_cpufreq module has to be blacklisted and the amd_pstate module has to be explicitly loaded.\n\n"
    },
    {
      "title": "System Performance Mode",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Laptop/Lenovo#Lenovo.** This article or section is a candidate for merging with Laptop/Lenovo#Lenovo.\n\nThis article or section is a candidate for merging with Laptop/Lenovo#Lenovo.\n\nThere are 3 modes available: Intelligent Cooling, Extreme Performance and Battery Saving. To toggle it, you need to call some ACPI methods.\n\nFirst install acpi_call (or acpi_call-lts for LTS kernel, acpi_call-dkms for other kernels) and load the kernel module:\n\n```\n# modprobe acpi_call\n```\n\nSet it to Intelligent Cooling mode:\n\n```\n# echo '\\_SB.PCI0.LPC0.EC0.VPC0.DYTC 0x000FB001' > /proc/acpi/call\n```\n\nSet it to Extreme Performance mode:\n\n```\n# echo '\\_SB.PCI0.LPC0.EC0.VPC0.DYTC 0x0012B001' > /proc/acpi/call\n```\n\nSet it to Battery Saving mode:\n\n```\n# echo '\\_SB.PCI0.LPC0.EC0.VPC0.DYTC 0x0013B001' > /proc/acpi/call\n```\n\nTo verify your setting:\n\n```\n# echo '\\_SB.PCI0.LPC0.EC0.SPMO' > /proc/acpi/call\n# cat /proc/acpi/call; printf '\\n'\n```\n\nAs a result you get the value for the bit SPMO (either 0x0, 0x1 or 0x2). To interpret the results the following table can be used:\n\nTable content:\nSPMO | Mode\n0x0 | Intelligent Cooling\n0x1 | Extreme Performance\n0x2 | Battery Saving\n\n"
    },
    {
      "title": "Suspend",
      "level": 3,
      "content": "Besides the aforementioned keyboard issues when resuming from suspend, the SSD controller stops working when resuming from suspend (bug report, (expected to land in kernel 6.1)1), rendering the system unusable. This can be fixed by adding\n\n```\niommu=pt\n```\n\nto the kernel parameters (works with kernel versions 5.x and 6.0).\n\n"
    },
    {
      "title": "Microphone",
      "level": 2,
      "content": "The integrated dual array microphone is driven by a separate audio coprocessor (AMD ACP6x). A kernel patch is currently necessary to enable a quirk in the respective module snd_soc_acp6x_mach (this patch is scheduled to be merged in kernel 6.1-rc1)2. If using PulseAudio, ALSA UCM probably has to be disabled.\n\n"
    },
    {
      "title": "References",
      "level": 2,
      "content": "1. https://bugzilla.kernel.org/show_bug.cgi?id=216438#c24\n1. https://bugzilla.kernel.org/show_bug.cgi?id=216299#c7\n\n"
    }
  ]
}