{
  "title": "Linee guida generali",
  "url": "https://wiki.archlinux.org/title/Linee_guida_generali",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "In aggiunta al codice di condotta, ognuno dei fora vede riassunte le proprie linee guida specifiche nelle sottosezioni seguenti.\n\n"
    },
    {
      "title": "Fora",
      "level": 2,
      "content": "Linee guida specifiche per i Fora di Arch\n\n"
    },
    {
      "title": "Pubblicare correttamente",
      "level": 3,
      "content": "- Scegliere dei soggetti chiari ed informativi. Ciò aumenta le probabilità che degli utenti più esperti rispondano, i quali conoscono quell'argomento specifico. Inoltre, rende l'argomento più semplice da referenziare e trovare mediante la ricerca sul forum per utenti futuri con simili problemi. Evitare inoltre l'uso di frasi estranee come [AIUTO!], [URGENTE], etc.\n- Uno sforzo sincero nell'utilizzo di modestia ed appropriatezza nel linguaggio e nella grammatica costituisce un segno di rispetto verso la comunità che sarà sinceramente apprezzato ed è piuttosto probabile che porterà a risposte positive. Evitare i cosiddetti \"textspeak\", \"netspeak\", \"leetspeak\" ed ogni altra forma del gergo di Internet.\n- Quando si pongono delle domande, fornire il maggior numero di informazioni possibili, inclusi i messaggi di errore, i dati emessei dal terminale, i logs, quale metodo è già stato provato, quale documentazione e ricerche sono state effettuate e i relativi files di configurazione.\n- Scegliere un solo argomento per discussione. È tipicamente sconsigliato pubblicare lunghe discussioni nelle sottosezioni per i problemi tecnici dei fora.\n- Pubblicate la vostra domanda soltanto in un sottoforum; scegliete il più rilevante e pubblicate lì.\n- Non postare tutoriali o \"Come Fare Per\": la Wiki è il luogo adatto alla documentazione, dove essa può essere mantenuta.\n- Quando si risponde ad una discussione esistente, leggere sempre il messaggio originale e cercare di fornire delle risposte pertinenti.\n- Infine, quando è stata trovata una soluzione, identificate la vostra discussione come risolta modificando il messaggio iniziale, preponendo l'etichetta [RISOLTA] al titolo nel campo \"Soggetto\".\n- Notate che dovreste evitare l'utilizzo di [CHIUSA], che è invece in uso nel sistema per definire una discussione non più accessibile per delle nuove risposte.\n- Se una discussione è definita come [RISOLTA], non rispondere affermando l'equivalente di \"Ho scoperto un problema simile...\"; aprite una discussione apposita e collegate a quella [RISOLTA], se pertinente.\n\n"
    },
    {
      "title": "Incollare immagini e codice",
      "level": 3,
      "content": "Fare uso dell'etichetta [code] quando si incollano dei frammenti di console. Utilizzare un client pastebin quando si pubblicano ingenti quantità di codice. Non utilizzare pastebin.com — è bloccato per alcuni utenti e conosciuto per risultare in problemi morbosi (JavaScript, pubblicità, formattazione errata, etc). Per gli utenti con locale diverso da quello Inglese: Preporre LC_ALL=C ai comandi eseguiti in modo da garantire che il risultato sia in inglese. Non pubblicare immagini a schermo intero; utilizzare invece i collegamenti alle immagini, con vignetta opzionale. Qualsiasi immagine con dimensioni superiori a 250x250px oppure più grande di 50 KiB verrà rimossa. Non pubblicare catture dello schermo dei risultati testuali della console; pubblicare il testo effettivo.\n\n"
    },
    {
      "title": "La vita è una strada a due corsie",
      "level": 3,
      "content": "Una semplice, eppure profonda e innegabile verità. Assicuratevi che la vostra discussione includa i dettagli e le informazioni che saranno utili ad altri. Condividete le vostre soluzioni con la comunità. Convidete anche i vostri fallimenti. Postare l'equivalente di \"Non importa, ho risolto.\" nelle vostre discussioni o cancellare i vostri post per motivi simili non solo è egoista ed inutile per la comunità, ma costituisce anche un effettivo spreco delle risorse e del tempo di tutti. Inoltre, ordinare che si venga aiutati o mostrarsi come impazienti e maleducati non è un comportamento accettabile. Arch è messa a disposizione da una comunità di volontari. Gli utenti di Arch sono incoraggiati a fare le proprie ricerche, fare uno sforzo, rispondere alla discussione, aiutare gli altri, coinvolgersi e contribuire alla comunità.\n\nNon siate un \"vampiro di aiuto\".\n\n"
    },
    {
      "title": "Richieste per la raccomandazione di prodotti",
      "level": 3,
      "content": "Le discussioni in cui vengono richiesti consigli per la raccomandazione di prodotti informatici non sono permesse. Questi argomenti, come la tecnologia da essi discussa, diventano velocemente obsoleti ed è improbabile che forniscano alcun beneficio alla comunità più ampia, nel lungo termine. Ci si aspetta che voi siate in grado di eseguire delle vostre ricerche e trarre delle proprie conclusioni su quale prodotto meglio soddisfa i vostri requisiti individuali.\n\n"
    },
    {
      "title": "Vecchie discussioni/\"necro-bumping\"",
      "level": 3,
      "content": "Fate la vostra parte per mantenere il forum ordinato. Poichè Arch viene documentato nella Wiki, rispondere nelle vecchie discussioni (\"necro-bumping\") non è solitamente tollerato sui subfora per i problemi tecnici, dato che può generare informazioni \"zombie\" disunite; i messaggi con dei dati non più rilevanti, vista la natura a rilascio continuo di Arch, in aggiunta a messaggi più recenti che riflettono le circostanze attuali.\n\nRegole generali:\n\n- Se avete domande, aprite una nuova discussione e collegatela alla vecchia, se è ancora rilevante. Potete anche segnalare la vechhia discussione, in modo tale che gli addetti possano chiuderla.\n- Se avete qualcosa da aggiungere e ritenete che l'informazione sia pertinente, ma più aggiornata, aprite una nuova discussione e collegatela a quella vecchia, se desiderate, ma cercate di evitare la duplicazione degli sforzi le informazioni pubblicando informazioni già presenti sulla Arch Wiki.\n- Se avete una soluzione versione-agnostica o corrispondente, il necro-bumping potrà forse essere appropriato quando la discussione non è più vecchia di uno o due anni.\n\n"
    },
    {
      "title": "Niente \"power-posting\"/messaggi vuoti",
      "level": 3,
      "content": "Il \"Power-posting\" è la pratica di postare messaggi vuoti o inutili. Non è consentito. Possono esserci due motivi per cui le persone ne fanno uso: per incrementare irragionevolmente il loro numero di messaggi o per supportare un'idea, come se fosse una votazione. Esempi di power-posting includono, ma non si limitano a, rispondere con \"+1\", \"lol\", \"anch'io\", \"sono d'accordo\" oppure \":)\".\n\nQuando si pubblica o si risponde ai messaggi, assicuratevi di avere qualcosa da dire. Questi messaggi vuoti creano disordine nelle discussioni e nella conversazione, invalidano la funzione di 'Mostrare I Messaggi Nuovi' e costituiscono uno spreco di banda rete e dello spazio del server.\n\nLe discussioni che degenerano in una serie di \"+1/-1\" o \"anch'io/sono d'accordo/non sono d'accordo\" verranno bloccate. Anche dei singoli power posts saranno cancellati.\n\n"
    },
    {
      "title": "Bumping",
      "level": 3,
      "content": "Postare una singola parola o un messaggio inutile (bumping) per attirare attenzione alla vostra discussione non è permesso. Fate le vostre ricerche, continuate coi tentativi di risoluzione del problema, pubblicate i risultati e siate pazienti con la comunità. Se le persone stanno leggendo la vostra discussione senza rispondere o offrire aiuto, potete provare a fornire più dettagli, o a chiedere di essere indirizzati verso la giusta direzione. Spesso, la ragione per cui i messaggi rimangono senza risposta è, per la maggior parte, l'aver specificato dettagli insufficenti proprio nel primo, oppure la palese disponibilità di soluzioni sulla Wiki, sul forum o sul Web, e che la comunità non ha intenzione di statare l'ovvio.\n\n"
    },
    {
      "title": "Cross-posting",
      "level": 3,
      "content": "Il Cross-posting è l'atto di postare più volte la stessa domanda in differenti sottosezione dei fora (ad esempio, pubblicaando sia in Angolo del newbbo che in Installazione), oppure pubblicare delle varianti leggermente diverse della domanda nella stessa sottosezione o in una diversa. Ciò costituisce uno spreco di risorse e non è permesso. Qualsiasi argomento \"cross-postato\" verrà immediatamente bloccato e selezionato per la cancellazione.\n\n"
    },
    {
      "title": "Dirottamento della discussione",
      "level": 3,
      "content": "La pratica del dirottamento di una discussione esistente è il processo di rispondere ad essa con un argomento completamente differente. Non è solitamente tollerato. È preferibile creare una nuova discussione se si ha un problema correlato ad uno simile pubblicato in precedenza, ma chiaramente diverso. Non sono neanche permessi quei messaggi che dirottano una discussione seria con conversazioni non rilevanti.\n\n"
    },
    {
      "title": "Polizza del cestino (selezionate per l'eliminazione)",
      "level": 3,
      "content": "Le discussioni che sono state bloccate/chiuse perchè già documentate o sulle bacheche o sulla Wiki, oppure perchè sono inconsistenti con le Usanze di Arch, verranno spostate nel cestino/troll-cestino. Dopo un periodo di cinque giorni, la discussione diverrà eligibile per l'eliminazione a discrezione degli addetti. Il Moderatore responsabile definirà chiaramente la discussione come \"Cestinata\" o \"Da eliminare\".\n\n"
    },
    {
      "title": "Liste di posta",
      "level": 2,
      "content": "Linee guida per le liste di posta. Controllare anche Stile della pubblicazione nelle liste di posta.\n\n"
    },
    {
      "title": "Top posting",
      "level": 3,
      "content": "Non vi sono mai ragioni valide per il top posting. Non fatene uso, per favore.\n\n"
    },
    {
      "title": "Citare",
      "level": 3,
      "content": "Citare soltanto gli elementi necessari da una email precedente. Le citazioni raggruppate gonfiano rapidamente le discussioni e riducono la leggibilità, incrementando simultaneamente il carico cognitivo sull'intera lista. Scartate tutto il materiale ridondante e rispondete solo a quello più rilevante che è stato citato.\n\n"
    },
    {
      "title": "Testo in chiaro",
      "level": 3,
      "content": "Il testo in chiaro è il predefinito in Unix ed email. L'HTML non è necessario e, per coloro che utilizzano client di linea di comando, non ben visto. Mantenere una lunghezza delle linee ragionevole: 72 caratteri è considerato lo standard per andare a capo.\n\nhttps://useplaintext.email/ fornisce istruzioni sulla configurazione dei client email per l'utilizzo del testo in chiaro.\n\n"
    },
    {
      "title": "Rispondete alla lista di posta",
      "level": 3,
      "content": "Quando rispondete alla discussione di una lista di posta, assicuratevi di rispondere alla lista di posta e non all'autore dell'email iniziale. La maggior parte dei client di email dovrebbero fornire una funzione \"rispondi alla lista di posta\" tra le opzioni di risposta. Altrimenti, inserite manualmente l'indirizzo email della lista di posta nel campo Destinatario.\n\nPer le liste di posta che non richiedono iscrizione, come arch-mirrors-announce e aur-requests, utilizzate rispondi a tutti e assicuratevi che la lista di posta sia tra i destinatari.\n\n"
    },
    {
      "title": "AUR",
      "level": 2,
      "content": "Le linee guida del Repository Utente di Arch sono disponibili a Linee guida per le proposte dell'AUR.\n\n"
    },
    {
      "title": "IRC",
      "level": 2,
      "content": "Tutti i canali IRC di Arch sono sulla rete IRC Libera Chat. Gli utenti su Libera Chat devono seguire la polizza della rete e le linee guida del canale di Libera Chat.\n\nLa lingua ufficiale del canale #archlinux è l'Inglese. Se avete bisogno di aiuto in un'altra lingua, cercate nei canali internazionali di Arch.\n\n- Il canale ufficiale per la community italiana è #archlinux-it.\n\n- L'argomento principale di #archlinux è supporto e discussione riguardanti Arch Linux. Le conversazioni generali su software o hardware sono permesse a patto che non interferiscano con l'argomento principale della discussione. Se vi viene chiesto di spostare qualcosa su di un altro canale o in privato, siete tenuti a farlo.\n- Leggere l'argomento del canale regolarmente usando /topic. Spesso contiene informazioni importanti.\n- È presente solo un bot del canale ufficiale: phrik. Non spammate i comandi del bot e limitate l'utilizzo a cose utili. Se volete portare un vostro bot in qualsiasi canale di Arch Linux, chiedete ad un operatore prima di farlo.\n- Non collegate i canali a nessun altra rete o mezzo senza permesso.\n- Non divulgate log pubblicamente senza il permesso di tutti i partecipanti.\n- Non inondate il canale con testo. Ciò include arte in ASCII, comandi dei bot e logs di errore. Usare un servizio di pastebin per condividere qualcosa lungo più di tre linee. program &> program-output.txt in combinazione con dei clients pastebin possono alleviare questo passo. Se si vuol provare i comandi dei bot oppure investigare la funzione di aiuto, farlo in una /query o /msg. Esempio: /query phrik help command.\n- Le auto-risposte nei canali o via messaggi privati non sono permesse, eccezion fatta per le risposte di assenza all'evidenziamento del nick in privato.\n- Non chiedete se qualcuno sia vivo o se usa il vostro software, chiedete direttamente senza troppi giri di parole.\n- Non ordinate di ricevere aiuto; chiedetelo. Aspettate pazientemente per qualche minuto prima di porre nuovamente le domande. La maggior parte delle domande trovano risposta da solo un altro utente, come voi.\n- Quando si chiede aiuto, rispondere sempre alle persone che vi chiedono più informazioni; se non conoscete la risposta, riferitelo.\n\n- Usare un servizio di pastebin per condividere qualcosa lungo più di tre linee. program &> program-output.txt in combinazione con dei clients pastebin possono alleviare questo passo.\n- Se si vuol provare i comandi dei bot oppure investigare la funzione di aiuto, farlo in una /query o /msg. Esempio: /query phrik help command.\n\n"
    },
    {
      "title": "Wiki",
      "level": 2,
      "content": "Le linee guida per la Wiki si trovano in ArchWiki:Contribuire.\n\n"
    },
    {
      "title": "Tracciatore dei problemi",
      "level": 2,
      "content": "Le linee guida per il tracciatore di problemi si trovano in Linee guida per la segnalazione dei problemi.\n\n"
    }
  ]
}