{
  "title": "Lista de aplicativos/Outros",
  "url": "https://wiki.archlinux.org/title/Lista_de_aplicativos/Outros",
  "sections": [
    {
      "title": "CalDAV/CardDAV servers",
      "level": 3,
      "content": "- Baïkal — A lightweight CalDAV+CardDAV server.\n\n- kcaldav — Simple, safe, minimal CalDAV server.\n\n- Radicale — Free and Open-Source CalDAV and CardDAV Server.\n\n- xandikos — A lightweight yet complete CardDAV/CalDAV server that backs onto a Git repository.\n\n"
    },
    {
      "title": "Personal information managers",
      "level": 3,
      "content": "These applications support time, task and contacts management.\n\n- Evolution — Personal information management application that provides integrated mail, calendaring and address book functionality. Part of gnome-extra.\n\n- Kontact — Integrated solution to your personal information management. Part of kde-pim.\n\n- Merkuro — Calendar and contact application that allows you to manage your tasks, events and contacts. Part of kde-pim.\n\n- Osmo — GTK personal organizer, which includes calendar, tasks manager and address book modules.\n\n- SeaMonkey Mail & Newsgroups with Lightning — Extension to SeaMonkey that provides calendar and task support.\n\n- Thunderbird — A fully featured E-mail client formerly developed by Mozilla.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- Calcurse — Text-based ncurses calendar and scheduling system (supports CalDAV)\n\n- ccal — A console program which writes a calendar together with Chinese calendar to standard output.\n\n- khal — Command-line (non-interactive) and ncurses (interactive) calendar system (supports CalDAV)\n\n- mail2rem — Small script for importing .ics calendars from Maildir to Remind calendar.\n\n- Pal — Very lightweight calendar with both interactive and non-interactive interfaces.\n\n- pcal — A tool to create pdf calendars from pcal input which can be exported by some calendar programs.\n\n- Remind — Highly sophisticated text-based calendaring and notification system.\n\n- When — Simple personal calendar program.\n\n- Wyrd — Text-based front-end to Remind, a calendar and alarm program used on UNIX and Linux computers.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Agenda — Calendar application built with MauiKit. Part of maui.\n\n- Calindori — Calendar application for Plasma Mobile.\n\n- chinese-calendar — Chinese traditional calendar for Ubuntu Kylin.\n\n- CoreTime — Very simple Clock/Calendar application which shows a clock, supports alarms, reminders, a stop watch and a timer. Part of C-Suite.\n\n- Deepin Calendar — Calendar application for Deepin.\n\n- etmtk (Event and Task Manager) — Simple application with a \"Getting Things Done!\" approach to handling events, tasks, activities, reminders and projects.\n\n- Gahshomar — Persian (Jalali/Farsi) calendar.\n\n- GNOME Calendar — Calendar application for GNOME. Part of gnome.\n\n- KAlarm — Personal alarm message, command and email scheduler, part of kde-pim.\n\n- Kongress — Companion application for conferences made by KDE. Part of kde-utilities.\n\n- KOrganizer — Calendar and scheduling program, part of kde-pim.\n\n- Merkuro Calendar — Calendar application using Akonadi that supports both local and online calendars: Nextcloud, Google Calendar, Outlook, Caldav and more. Part of kde-pim.\n\n- Nextcloud Calendar — Calendar app for Nextcloud.\n\n- Outspline — Extensible outliner with advanced time management features, supporting events with complex recurrence schemes.\n\n- TkRemind — Sophisticated calendar and alarm program.\n\n"
    },
    {
      "title": "Countdown timers and stopwatch",
      "level": 4,
      "content": "- arttime — Clock, timer, pattern-based time manager, ASCII art viewer. Set a one-off, multiple, repeating, pattern-based timers.\n\n- Chess Clock — Simple application to provide time control for over-the-board chess games.\n\n- GNOME Clocks — Clocks application for GNOME, including alarm, stopwatch and timer functionality. Part of gnome.\n\n- Hourglass — Simple time keeping application designed for elementary OS.\n\n- KClock — A convergent clock application for Plasma. It contains alarm, timer, stopwatch and timezone functionalities. Part of kde-utilities.\n\n- Kronometer — Stopwatch application for KDE.\n\n- KTeaTime — Handy timer for steeping tea. Part of kde-utilities.\n\n- pystopwatch — Stopwatch written in Python with a clock and two countdown functions that can minimize to the tray.\n\n- snore — A program like sleep, but with feedback.\n\n- termdown — Countdown timer and stopwatch in your terminal.\n\n"
    },
    {
      "title": "Break timers",
      "level": 4,
      "content": "- Break Timer — Keeps track of how much you are using the computer, and it reminds you to take regular breaks. Works only in GNOME.\n\n- RSI Break — Takes care of your health and regularly breaks your work to avoid repetitive strain injury (RSI).\n\n- Safe Eyes — Tool to reduce and prevent repetitive strain injury (RSI).\n\n- Work-break — Work and rest time balancer taking into account your current and today strain.\n\n- Workrave — Program that assists in the recovery and prevention of RSI on Xorg.\n\n"
    },
    {
      "title": "Pomodoro timers",
      "level": 4,
      "content": "See Wikipedia:Pomodoro Technique for an introduction.\n\n- flow — Pomodoro app that blocks distractions while you work.\n\n- Francis — App that uses the well-known pomodoro technique to help you get more productive. Part of kde-utilities.\n\n- Gnomato — Timer for the Pomodoro Technique.\n\n- Pilorama — Eye-candy timeboxing tool written in QML\n\n- Pomodoro — Time management utility for GNOME based on the Pomodoro Technique.\n\n- Pomodoro-Logger — Pomodoro timer and logger with Kanban board for task management and tracking.\n\n- potato-c — A minimal and efficient pomodoro timer with server-client structure.\n\n- Solanum — Pomodoro timer for the GNOME desktop.\n\n- Tomate — Timer for the Pomodoro Technique.\n\n- Tomighty — Desktop timer for the Pomodoro Technique.\n\n"
    },
    {
      "title": "Time trackers",
      "level": 3,
      "content": "- ActivityWatch — A self/local-hosted, cross-platform, client-server, privacy-focused active window tracker.\n\n- Hamster — Time tracking application that helps you to keep track on how much time you have spent during the day on activities you choose to track.\n\n- Kapow — Punch clock to track time spent on projects.\n\n- KTimeTracker — Todo management and time tracking application.\n\n- Tider — Lightweight time tracking application (GTK)\n\n- Timenaut — Time tracker that tracks active windows and lets you sort them into categories. Based on the Electron platform.\n\n- Timewarrior — A command-line time-tracking application.\n\n- Timetrack — Simple time-tracking app for GNOME.\n\n- Wakatime — Open source plugins for metrics about your programming with intuitive web-interface.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- c3 — A multi-platform TUI todo manager that extends calcurse's todo format to have a tree-like dependency structure, and even more!\n\n- dijo — Scriptable, curses-based, digital habit tracker\n\n- Taskbook — Tasks, boards and notes for the command-line habitat.\n\n- Taskell — A command-line kanban board/task manager.\n\n- Taskwarrior — Command-line To-do list application with support for lua customization and more.\n\n- todoman — Command-line To-do list manager (supports CalDAV)\n\n- Todo.txt — Small command-line To-do manager.\n\n- TuDu — Ncurses-based hierarchical To-do list manager with vim-like keybindings.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Agenda — Simple, fast, no-nonsense to-do (task) list for elementary OS.\n\n- Effitask — Graphical task manager, based on the Todo.txt format.\n\n- Endeavour — Personal task manager for GNOME. Part of gnome-extra.\n\n- Errands — Todo application for those who prefer simplicity.\n\n- Go For It! — Simple and stylish productivity app, featuring a to-do list, merged with a timer that keeps your focus on the current task. To-do lists are stored in the Todo.txt format.\n\n- GTG — Personal tasks and TODO list items organizer for GNOME inspired by the Getting Things Done (GTD) methodology.\n\n- Nextcloud Tasks — Tasks app for Nextcloud.\n\n- Planner — Task manager with Todoist support.\n\n- ptask — GTK task manager based on Taskwarrior.\n\n- sleek — todo.txt app with modern GUI. Based on the Electron platform.\n\n- TickTick — Is a simple and effective to-do list and task manager app with seamless cloud synchronization across all your devices\n\n- Zanshin — To-do management application for KDE. Part of kde-pim.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- Abook — Text-based contacts manager designed for use with mutt.\n\n- Khard — Command-line addressbook that is able to sync with CardDAV-servers.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Communicator — Integrated address book and dialer application features the search for and view of contacts, edit contact details, and make new contacts, favorites, and dialer pad. Part of maui.\n\n- GNOME Contacts — Contacts manager for GNOME. Part of gnome.\n\n- KAddressBook — Address book manager for KDE. Part of kde-pim.\n\n- LDAP Administration Tool — Browse LDAP-based directories and add/edit/delete entries contained within.\n\n- Merkuro Contacts — Address book using Akonadi. Part of kde-pim.\n\n- Nextcloud Contacts — Contacts app for Nextcloud.\n\n- phpLDAPadmin — LDAP client webapp. Its hierarchical tree-viewer and advanced search functionality make it intuitive to browse and administer your LDAP directory.\n\n- Thunderbird with CardBook extension — address book based on the CardDAV and vCard standards.\n\n"
    },
    {
      "title": "Financial management",
      "level": 3,
      "content": "See also Wikipedia:Comparison of accounting software.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- Beancount — A double-entry bookkeeping computer language that lets you define financial transaction records in a text file, read them in memory, generate a variety of reports from them, and provides a web interface.\n\n- esniper — Simple, lightweight tool for sniping eBay auctions.\n\n- hledger — An accounting program for tracking money, time, or any other commodity, using double-entry accounting and a simple, editable file format. hledger is inspired by and largely compatible with ledger.\n\n- Ledger — Ledger is a powerful, double-entry accounting system that is accessed from the UNIX command-line.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Eqonomize! — Cross-platform personal accounting software, with focus on efficiency and ease of use for the small household economy.\n\n- ERPNext — Free and open source Enterprise Resource Planning (ERP).\n\n- GnuCash — Financial application that implements a double-entry book-keeping system with features for small business accounting.\n\n- Grisbi — Personal finance system which manages third party, expenditure and receipt categories, as well as budgetary lines, financial years, and other information that makes it suitable for associations.\n\n- HomeBank — Easy to use finance manager that can analyse your personal finance in detail using powerful filtering tools and graphs.\n\n- KMyMoney — Personal finance manager that operates in a similar way to Microsoft Money. It supports different account types, categorisation of expenses and incomes, reconciliation of bank accounts and import/export to the “QIF” file format.\n\n- Kresus — Self-hosted personal finance management software. It automatically retrieves every day all your new bank transactions and lets you categorize them, study them through charts and establish a budget.\n\n- Manager — Proprietary accounting software for small business.\n\n- Money Manager EX — An easy-to-use personal finance suite\n\n- Odoo — Open source ERP system purely in Python. Previously known as OpenERP.\n\n- Skrooge — Personal finances manager for the KDE desktop.\n\n"
    },
    {
      "title": "Cryptocurrency",
      "level": 3,
      "content": "- Atomic Wallet — Manage your Bitcoin, Ethereum, XRP, Litecoin, XLM, and over 300 other coins and tokens.\n\n- Bitcoin Core — Connect to the Bitcoin P2P Network.\n\n- Cake Wallet — Multicurrency wallet.\n\n- Sparrow Wallet — Advanced Bitcoin client.\n\n- Coinomi — Securely store, manage and exchange Bitcoin, Ethereum, and more than 1,770 other blockchain assets.\n\n- Cointop — Terminal based application for tracking cryptocurrencies.\n\n- Electrum — Lightweight Bitcoin client.\n\n- Exodus — All-in-one proprietary application to secure, manage, and exchange blockchain assets. Based on the Electron platform.\n\n- Mist — Ethereum Dapp browser.\n\n- Monero — Monero wallet.\n\n- Feather Wallet — Lightweight Monero wallet.\n\n- Dogecoin Core — Dogecoin Core wallet, Allows you to connect to the Dogecoin P2P Network.\n\n"
    },
    {
      "title": "Project management",
      "level": 3,
      "content": "See also Wikipedia:Comparison of project management software.\n\n- Calligra Plan — Project management application, which is intended for managing moderately large projects with multiple resources.\n\n- GanttProject — Project scheduling application featuring gantt chart, resource management, calendaring.\n\n- Notion-app — A note-taking software and project management software that is used for note-taking, task management, project management, knowledge management, and personal knowledge management.\n\n- Planner — Project management application for GNOME.\n\n- ProjectLibre — Project management software alternative to Microsoft Project.\n\n- TaskJuggler — Modern and powerful project management tool. Its new approach to project planning and tracking is more flexible and superior to the commonly used Gantt chart editing tools.\n\n"
    },
    {
      "title": "Bookmark management",
      "level": 3,
      "content": "- KEditBookmarks — Bookmark organizer and editor. Part of kde-utilities.\n\n- Read It Later — Simple Wallabag client.\n\n"
    },
    {
      "title": "Recipe management",
      "level": 3,
      "content": "- Gourmand — Simple but powerful recipe-managing application.\n\n- Recipes — Recipe management application for GNOME. Part of gnome-extra.\n\n"
    },
    {
      "title": "Travel management",
      "level": 3,
      "content": "See also List of applications/Science#Navigation and routing.\n\n- Itinerary — Digital travel assistant with a priority on protecting your privacy. Part of kde-pim.\n\n"
    },
    {
      "title": "Health management",
      "level": 3,
      "content": "- Health — Health tracking app for the GNOME desktop.\n\n"
    },
    {
      "title": "Education",
      "level": 2,
      "content": "See also List of games#Education.\n\n- Artikulate — Pronunciation trainer that helps improving and perfecting a learner's pronunciation skills for a foreign language. Part of kde-education.\n\n- Fretboard — Look up guitar chords.\n\n- Kalm — Teach you different breathing techniques. Part of kde-utilities.\n\n- Moodle — Open-source software learning management system.\n\n- OpenBoard — Interactive whiteboard software for schools and universities.\n\n- Wike — Wikipedia reader for the GNOME desktop.\n\n- Wildcard — Provides a simple interface to test/practice regular expressions.\n\n"
    },
    {
      "title": "Flashcards",
      "level": 3,
      "content": "See also Wikipedia:List of flashcard software.\n\n- Anki — Intelligent spaced-repetition memory training program.\n\n- jVLT — Vocabulary learning tool.\n\n- KWordQuiz — Tool that gives you a powerful way to master new vocabularies. Part of kde-education.\n\n- Mnemosyne — Flash-card tool which optimizes your learning process.\n\n- Parley — Program to help you memorize things. It uses the spaced repetition learning method, also known as flash cards. Part of kde-education.\n\n- Pauker — Flash card based learning tool using shortterm and longterm memory training.\n\n- StudyFlash — Learn flashcards inside your terminal\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- Dvorak 7min — Simple ncurses-based typing tutor for those trying to become fluent with the Dvorak keyboard layout.\n\n- GNU Typist — Universal typing tutor.\n\n- psani-profi — Program that will teach you touchtyping (Czech).\n\n- Typespeed — Test your typing speed, and get your fingers' CPS.\n\n- typiskt — touchtype training in the terminal (Bash).\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Klavaro — Teaching touch typing that intends to be keyboard and language independent.\n\n- KTouch — Program to learn and practice touch typing. Part of kde-education.\n\n- TIPP10 — Intelligent touch typing tutor.\n\n- TypingTest — Typing test desktop program with a large amount of customization.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "See Accessibility for tips on operating the desktop and Category:Accessibility for all available articles. See also On-screen keyboards.\n\n"
    },
    {
      "title": "Speech synthesizers",
      "level": 3,
      "content": "See also Wikipedia:Comparison of speech synthesizers and listening comparison of the different engines.\n\n- Ekho — Chinese text-to-speech (TTS) software for Cantonese, Mandarin, Zhaoan Hakka, Tibetan, Ngangien and Korean.\n\n- eSpeak — Compact speech synthesizer for more than 50 languages.\n\n- eSpeak NG — Fork of eSpeak (due to inactivity of original maintainer).\n\n- Festival — General framework for building speech synthesis systems as well as including examples of various modules. As a whole it offers full text to speech.\n\n- Flite — Lightweight speech synthesis engine.\n\n- Gespeaker — GTK frontend for espeak. It allows you to play a text in many languages with settings for voice, pitch, volume and speed.\n\n- KMouth — Speech synthesizer frontend which enables persons that cannot speak to let their computer speak. Part of kde-accessibility.\n\n- MaryTTS — Multilingual text-to-speech synthesis platform written in Java.\n\n- MBROLA — Proprietary phonemes-to-audio program which supports more than 70 languages. Mbrola-voices can also be used with eSpeak.\n\n- Mimic — Text-to-speech voice synthesis from the Mycroft project (based on Flite).\n\n- Open JTalk — Japanese text-to-speech synthesis system.\n\n- Orca — Screen reader for individuals who are blind or visually impaired, using eSpeak (via Speech Dispatcher). Part of gnome.\n\n- piper — A fast, local neural text to speech system.\n\n- RHVoice — Cross-platform (including Android) text-to-speech from a blind Russian-speaking developer, based on HTS (ru, ka, uk, ky, tt, en, pt, eo)\n\n- SOPS — Provides a simple way to write custom plugins for screen reader Orca.\n\n- Speech dispatcher — Common interface to speech synthesis. It has backends for eSpeak, Festival, and a few other speech synthesizers.\n\n"
    },
    {
      "title": "Speech recognition",
      "level": 3,
      "content": "See also Wikipedia:Speech recognition software for Linux.\n\n- Julius — Large vocabulary continuous speech recognition engine.\n\n- Kaldi — Speech recognition toolkit.\n\n- Kaylee — Somewhat fancy voice command recognition program that performs actions when a user speaks loosely preset sentences.\n\n- Mycroft — Hackable voice assistant.\n\n- Numen — Voice control for handsfree computing\n\n- nerd-dictation — Light weight manually activated dictation using the VOSK-API\n\n"
    },
    {
      "title": "Screen magnifiers",
      "level": 3,
      "content": "- boomer — Zoomer application for Linux.\n\n- KMag — Small KDE utility to magnify a part of the screen. Part of kde-accessibility.\n\n- Magnus — Very simple desktop magnifier, showing the area around the mouse pointer in a separate window magnified two, three, four, or five times.\n\n- Virtual Magnifying Glass — Simple, customizable and easy-to-use screen magnification tool.\n\n- xzoom — Zoom, rotate and mirror area of X display.\n\n"
    },
    {
      "title": "On-screen annotation",
      "level": 3,
      "content": "- Gromit-MPX — Tool to make annotations on the screen.\n\n- Pylote — Tool to draw on the screen.\n\n- Screenkey — Tool to display pressed keys.\n\n- Show Me The Key — A screenkey alternative that works under Wayland via libinput\n\n"
    },
    {
      "title": "Mouse",
      "level": 3,
      "content": "- Easystroke — Use mouse gestures to initiate commands and hotkeys.\n\n- KMouseTool — Clicks the mouse whenever the mouse cursor pauses briefly. It was designed to help those with repetitive strain injuries, for whom pressing buttons hurts. Part of kde-accessibility.\n\n- Mousetweaks — Accessibility enhancements for pointing devices.\n\n"
    },
    {
      "title": "Display managers",
      "level": 2,
      "content": "See the main article: Display manager#List of display managers.\n\n"
    },
    {
      "title": "Desktop environments",
      "level": 2,
      "content": "See the main article: Desktop environment#List of desktop environments.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "See also List of applications/Utilities#Terminal multiplexers, which offer some of the functions of window managers for the console.\n\n- twin — Text-mode window manager.\n\n- Wmutils — A set of tools for X windows manipulation.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "See the main article: Window manager#List of window managers.\n\n"
    },
    {
      "title": "Composite managers",
      "level": 4,
      "content": "See the main article: Xorg#List of composite managers.\n\n"
    },
    {
      "title": "Wayland compositors",
      "level": 3,
      "content": "See the main article: Wayland#Compositors.\n\n"
    },
    {
      "title": "Window tilers",
      "level": 3,
      "content": "- QuickTile — Lightweight standalone alternative to Compiz Grid plugin.\n\n- wumwum — The Window Manager manager. It can turn emwh compliant window managers into a tiling window manager while retaining all initial functionalities.\n\n"
    },
    {
      "title": "Taskbars",
      "level": 3,
      "content": "See also Wikipedia:Taskbar.\n\n- Bmpanel — Lightweight, NETWM compliant panel.\n\n- Cairo-Dock — Highly customizable dock and launcher application.\n\n- CoreAction — Side bar with some handy gadgets like system loads, calendar, calculator, notes etc. Part of C-Suite.\n\n- Dash to Panel — A fully customizable icon taskbar for gnome-shell. Moves the dash into the GNOME main panel, similar to KDE Plasma and Windows 10.\n\n- eww — Elkowars Wacky Widgets is a standalone widget system made in Rust that allows you to implement your own, custom widgets in any window manager.\n\n- fbpanel — Lightweight, NETWM compliant desktop panel.\n\n- GNOME Panel — Panel included in the GNOME Flashback desktop.\n\n- Lemonbar — A featherweight bar based on XCB. Provides UTF-8 support, background and foreground colors, text alignment, and not much more.\n\n- LXPanel — Lightweight X11 desktop panel and part of the LXDE desktop.\n\n- MATE Panel — Panel included in the MATE desktop.\n\n- nwg-dock — GTK-based dock designed for the Sway window manager.\n\n- nwg-panel — GTK3-based panel for sway and Hyprland Wayland compositors.\n\n- Plank — Elegant, simple, clean dock from pantheon desktop environment.\n\n- Polybar — a fast and easy-to-use tool for creating status bars.\n\n- Tint2 — Simple panel/taskbar developed specifically for Openbox.\n\n- Vala Panel — Gtk3 panel for compositing window managers\n\n- Xfce Panel — Panel included in the Xfce desktop.\n\n- xmobar — A lightweight, text-based, status bar written in Haskell.\n\n- Waybar — A customizable taskbar for Wlroots-based Wayland compositors.\n\n- yambar — A modular and lightweight status panel for X11 and Wayland that goes to great lengths to be both CPU and battery efficient.\n\n"
    },
    {
      "title": "System tray",
      "level": 3,
      "content": "Desktop environments typically have their own system tray implementation. E.g. KDE ships with Plasma Panel and Xfce ships with xfce4-panel. For GNOME, see GNOME#AppIndicators/Top bar icons. For dwm, see systray patch.\n\n- AllTray — Dock other applications into the system tray (notification area).\n\n- Docker — Docking application which acts as a system tray.\n\n- KDocker — Dock any application in the system tray (notification area).\n\n- Stalonetray — Stand-alone freedesktop.org and KDE system tray (notification area) for Xorg. It has full XEMBED support and minimal dependencies: an X11 lib only. Stalonetray works with virtually any EWMH-compliant window manager.\n\n- Trayer — Lightweight GTK-based system tray (notification area).\n\n"
    },
    {
      "title": "Tray indicators",
      "level": 4,
      "content": "Desktop-independent tray indicators. Useful for window managers without built-in tray widgets:\n\n- cbatticon: battery\n- volumeicon: volume\n- pasystray: pulseaudio\n- sbxkb: keyboard layout\n- python-pystray: Python library for creating tray entries.\n- tktrayAUR: Tk extension to create system tray icons following XDG specifications.\n\n"
    },
    {
      "title": "Application launchers",
      "level": 3,
      "content": "See also Wikipedia:Comparison of desktop application launchers.\n\n- Albert — Sophisticated, plugin based standalone keyboard launcher.\n\n- Application Finder — Easy-to-use application launcher from Xfce.\n\n- Bashrun2 — Provides a different, barebones approach to a run dialog, using a specialized Bash session within a small xterm window.\n\n- bemenu — Lightweight dynamic menu inspired by dmenu. Works natively on Wayland.\n\n- Cartridges — Simple game launcher written in Python using GTK4 and Libadwaita.\n\n- dmenu — Fast and lightweight dynamic menu for X which is also useful as an application launcher.\n\n- dmenu-extended — Extension to dmenu for quickly opening files and folders.\n\n- dswitcher — dmenu-based window switcher that works regardless of workspace or minimization.\n\n- fuzzel — Application launcher for wlroots based Wayland compositors, similar to rofi's `drun` mode.\n\n- Gmrun — Lightweight GTK-based application launcher, with the ability to run programs inside a terminal and other handy features.\n\n- GNOME Games — GNOME application to browse your local video games library and to easily pick and play a game from it. Part of gnome-extra.\n\n- Gnome-Pie — Circular application launcher (pie menu) for Linux. It is made of several pies, each consisting of multiple slices.\n\n- higgins — Desktop agnostic application launcher, file finder, calculator and more. Plugin based and freely and easily extendable via user-written plugins\n\n- j4-dmenu-desktop — Very fast dmenu application launcher.\n\n- jgmenu — Simple, independent, contemporary-looking X11 menu, designed for scripting, ricing and tweaking.\n\n- Junction — Application chooser to open files and links.\n\n- Kupfer — Convenient command and access tool for the GNOME desktop that can launch applications, open documents and access different types of objects and act on them.\n\n- launch — Simple command for launching applications from a terminal emulator.\n\n- Launchy — Very popular cross-platform application launcher with a plugin-based system used to provide extra functionality.\n\n- Lighthouse — Simple scriptable popup dialog to run on X.\n\n- nwg-drawer — GTK-based application drawer designed for the Sway compositor.\n\n- nwg-menu — GTK-based application menu designed for the Sway compositor.\n\n- rofi — Popup window switcher roughly based on superswitcher, requiring only xlib and pango.\n\n- rlaunch — An extremely fast and light-weight dmenu-like application launcher written in Rust\n\n- Synapse — Semantic launcher written in Vala that you can use to start applications as well as find and access relevant documents and files by making use of the Zeitgeist engine.\n\n- Ulauncher — Modern and shiny launcher that provides fuzzy search, extensions, and themes\n\n- vonal — Modern customizable global menu with unlimiting plugin system written in Rust\n\n- wofi — GTK-based popup window switcher for Wayland compositors such as sway. Inspired by rofi.\n\n- wmenu — Dynamic menu for Sway and wlroots based Wayland compositors. Provides a Wayland-native dmenu replacement which maintains the look and feel of dmenu\n\n- yofi — Minimalistic menu for Wayland-based compositors.\n\n- tofi — Tiny dynamic menu, fast and simple dmenu/rofi replacement for Wayland compositors such as sway.\n\n"
    },
    {
      "title": "Application menu editors",
      "level": 3,
      "content": "- Alacarte — Add or remove applications from the main menu.\n\n- AppEditor — Edit application entries in the application menu.\n\n- Ezame — Desktop and menu file editor.\n\n- KMenuEdit — Edit one of the KDE application launchers. Part of plasma.\n\n- lxmed — Application menu editor written in Java.\n\n- MenuLibre — Advanced menu editor that provides modern features in a clean, easy-to-use interface.\n\n- Meow — Application menu editor written in Java.\n\n- Mozo — Change which applications are shown on the main menu.\n\n"
    },
    {
      "title": "Wallpaper setters",
      "level": 3,
      "content": "See also Wikipedia:Wallpaper (computing).\n\n- bgs — An extremely fast and small background setter for X based on imlib2.\n\n- feh — A lightweight and powerful image viewer that can also be used to manage the desktop wallpaper.\n\n- Fondo — Find a variety of the most beautiful wallpapers from Unsplash.com.\n\n- Hanabi — Live Wallpaper for GNOME.\n\n- Hidamari — Video wallpaper for Linux. Written in Python.\n\n- hsetroot — A tool to create compose wallpapers.\n\n- HydraPaper — GTK utility to set two different backgrounds for each monitor on GNOME.\n\n- Hyprpaper — Hyprpaper is a blazing fast wayland wallpaper utility with IPC controls.\n\n- LiveWallpaper — Animated 3D wallpapers.\n\n- mpvpaper — A video wallpaper program for wlroots based wayland compositors.\n\n- Nitrogen — A fast and lightweight desktop background browser and setter for X windows.\n\n- oguri — An animated wallpaper daemon for Wayland compositors.\n\n- pacwall — A live wallpaper that shows the dependency graph and status of installed packages.\n\n- pywal — Changes the wallpaper and creates matching colorschemes for various applications (rofi, i3, terminals)\n\n- swaybg — Wallpaper tool for Wayland compositors.\n\n- swww — Efficient animated wallpaper daemon for wayland, controlled at runtime.\n\n- Variety — Changes the wallpaper on a regular interval using user-specified or automatically downloaded images.\n\n- Xlivebg — A live wallpaper framework and collection of live wallpapers for the X window system.\n\n- xwallpaper — Minimalistic wallpaper setting utility for X.\n\n"
    },
    {
      "title": "Virtual desktop pagers",
      "level": 3,
      "content": "See also Wikipedia:Pager (GUI).\n\n- bbpager — Dockable pager for blackbox and other window managers.\n\n- fbpager — Virtual desktop pager for fluxbox.\n\n- IPager — A configurable pager with transparency, originally developed for Fluxbox.\n\n- Netwmpager — A NetWM/EWMH compatible pager.\n\n"
    },
    {
      "title": "Desktop widgets",
      "level": 3,
      "content": "- gDesklets — System for bringing mini programs (desklets) onto your desktop.\n\n- KRuler — Displays on screen a ruler measuring pixels. Part of kde-graphics.\n\n"
    },
    {
      "title": "Desktop notifications",
      "level": 3,
      "content": "See: Notification servers.\n\n"
    },
    {
      "title": "Clipboard managers",
      "level": 3,
      "content": "See Clipboard#Managers.\n\n"
    },
    {
      "title": "Logout UI",
      "level": 3,
      "content": "- clearine — Beautiful Logout UI for X11 window manager\n\n- nwg-bar — Configurable button bar for wlroots-based compositors.\n\n- oblogout — Openbox logout script\n\n- wlogout — Logout menu for wayland\n\n"
    },
    {
      "title": "Text-to-image models",
      "level": 4,
      "content": "- Stable Diffusion Web UI — Powerful web-based interface for Stable Diffusion, enabling high-quality image generation with customizable parameters.\n\n- Stable Diffusion C++ — Pure C/C++ implementation of Stable Diffusion for efficient inference on local machines.\n\n- StabilityMatrix — A versatile package manager for Stable Diffusion, simplifying model management and integration.\n\n"
    },
    {
      "title": "AI-powered image tools",
      "level": 4,
      "content": "- Krita AI Diffusion — An intuitive AI-powered plugin for Krita, enabling seamless image inpainting and outpainting with optional text prompts.\n\n- Upscayl — A free and open-source AI-based image upscaler, enhancing image resolution while preserving quality.\n\n"
    },
    {
      "title": "Comprehensive platforms",
      "level": 4,
      "content": "- AnythingLLM — An all-in-one AI application suite supporting Retrieval-Augmented Generation (RAG) and multi-agent workflows for Docker and desktop environments.\n\n- Lobe Chat — A modern, extensible chat framework for LLMs, supporting multiple AI providers, multi-modal interactions, and plugins.\n\n- SillyTavern — A feature-rich local interface for interacting with large language models (LLMs), generating images, and synthesizing speech.\n\n"
    },
    {
      "title": "Specialized clients",
      "level": 4,
      "content": "- AIOne — An all-in-one AI desktop app that provides access to ChatGPT, Gemini, and Claude (uses system-wide Electron).\n\n- Alpaca AI — A flexible client for Ollama, enabling local AI model usage and integration with third-party services like ChatGPT and Gemini.\n\n- Chatbox — A cross-platform desktop application for interacting with GPT-4 and GPT-3.5 models via the OpenAI API.\n\n- Claude Code — An agentic coding tool that lives in your terminal.\n\n- CodeGPT — A CLI written in Go language that writes git commit messages or does a code review brief for you using ChatGPT AI (gpt-4, gpt-3.5-turbo model) and automatically installs a git prepare-commit-msg hook.\n\n- Cursor — Write, edit, and chat about your code with GPT (AppImage version).\n\n- NextChat — A cross-platform ChatGPT client.\n\n- Open-GPT — A ChatGPT client using the OpenAI API.\n\n"
    },
    {
      "title": "Terminal-based tools",
      "level": 4,
      "content": "- AIChat — A versatile CLI tool for interacting with AI models, featuring REPL-like functionality, shell assistance, and support for multiple AI providers.\n\n- AIChat NG — An enhanced fork of AIChat with advanced features for terminal-based AI interactions.\n\n- ShellGPT — A productivity-focused CLI tool powered by OpenAI's ChatGPT, designed for efficient command-line workflows.\n\n"
    },
    {
      "title": "Large language models (LLMs)",
      "level": 4,
      "content": "- koboldcpp — A simple one-file way to run various GGML and GGUF models with a KoboldAI UI.\n\n- llama.cpp — A high-performance C/C++ port of Facebook's LLaMA model, optimized for local execution.\n\n- llamafile — Distribute and run LLMs with a single file.\n\n- LM Studio — A user-friendly interface for discovering, downloading, and running local LLMs.\n\n- Ollama — A streamlined tool for creating, running, and sharing large language models locally.\n\n"
    },
    {
      "title": "Integrated solutions",
      "level": 4,
      "content": "- GPT4All — A lightweight solution for running large language models locally on any device.\n\n- Jan — An easy-to-use platform for deploying and managing AI models directly on your PC.\n\n- Msty — A simple and intuitive interface for accessing both local and online AI models.\n\n"
    },
    {
      "title": "Speech and audio processing",
      "level": 3,
      "content": "- whisper.cpp — A C/C++ port of OpenAI's Whisper model for efficient speech recognition and transcription.\n\n"
    }
  ]
}