{
  "title": "Live Patching",
  "url": "https://wiki.archlinux.org/title/Live_Patching",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Kernel modules\n- Kernels/Compilation\n- Kexec\n\nKernel Live Patching (KLP) allows quick fixes to the kernel space without rebooting the whole system. Since version 4.0, related patches have been accepted [1][2][3], so one can configure their kernel to enable this feature. Generally, KLP is achieved by the following steps:\n\n1. Obtain the source tree of the running kernel\n1. Prepare the patch against the kernel\n1. Apply some tools (as follows) to help transform and load the patch\n\nSome projects provide the live patching utilities before KLP was officially supported, such as Oracle's ksplice, SuSE's #kGraft, and Red Hat's #kpatch. They implemented the KLP functionality in different ways. The minimalistic functional set of patches that entered the mainstream kernel were derived from kpatch and kGraft.\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "Install kpatchAUR for an appropriate kernel and kpatch-gitAUR for userspace tools.\n\nYou can also manually build a kernel that supports kpatch usage, by enabling CONFIG_LIVEPATCH, CONFIG_DEBUG_INFO, and CONFIG_KALLSYMS.\n\n"
    },
    {
      "title": "Usage",
      "level": 3,
      "content": "Once both packages are successfully built and after reboot, you may\n\n```\n$ export ROOTDIR=some/dir/aur/linux-kpatch/src/linux-x-y\n$ cd $ROOTDIR\n```\n\nAssume that you have done some modifications and have a patch some.patch (against the source tree after a makepkg -o, not the vanilla kernel of version x.y) in the working directory. Launch the kpatch utility,\n\n```\n$ kpatch-build -s $(pwd) -v $(pwd)/vmlinux some.patch\n```\n\nThis command involves two kernel builds, the original one and the patched one, so it may take a period of time to complete. After the build is over, there should be a kpatch-some.ko module in the same directory. And then,\n\n```\n# insmod kpatch-some.ko\n```\n\nshould do the trick.\n\nFor further information, please check the manpages or the GitHub repository.\n\n"
    },
    {
      "title": "kGraft",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nKGraft has not been tested in Arch environment.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- The kernel document of livepatch\n- wikipedia:Kpatch\n- wikipedia:KGraft\n- wikipedia:Ksplice\n\n"
    }
  ]
}