{
  "title": "Livestreamer",
  "url": "https://wiki.archlinux.org/title/Livestreamer",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Streamlink is a command-line utility written in Python which allows you to watch online video streams in popular video players, such as VLC, MPlayer or mpv; see Player compatibility for the full list.\n\nThis project was forked from Livestreamer, which is no longer maintained.\n\nSupport for various streaming services is provided by plugins, which can be easily added if needed. A lot of popular video streaming services are supported out of the box, including Dailymotion, Livestream, Twitch, UStream, YouTube Live and many more; see Plugins for the full list.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the streamlink package or streamlink-gitAUR.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "The package provides a streamlink command-line utility, which is quite easy to use:\n\n```\n$ streamlink -p your_player url stream\n```\n\n- your_player - name of executable of your media player, for example, vlc. You can also specify a full path if needed: /usr/bin/vlc. By default, VLC will be used if it can be found in its default location.\n- url - URL address of a stream. You can omit protocol (http://) for HTTP URLs.\n- stream - stream to play by given URL. Primarily, you can select the video quality with this option. Use best for highest and worst for lowest quality available. Specific plugins may have additional quality options.\n\nFor example:\n\n```\n$ streamlink -p mpv dailymotion.com/embed/video/x1b1h6o worst\n```\n\nSee streamlink(1) for the full list of available options.\n\nTo save a stream to your HDD\n\n```\n$ streamlink -o ~/$current_time.m2t \"STREAM URL\" best,high\n```\n\n"
    },
    {
      "title": "Twitch",
      "level": 3,
      "content": "```\n$ streamlink -p player twitch.tv/name_of_channel quality\n```\n\nFor example:\n\n```\n$ streamlink -p vlc twitch.tv/archlinux medium\n```\n\nAvailable stream qualities are: source, high, medium, low and mobile.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Streamlink repository on GitHub\n- Streamlink documentation\n\n"
    }
  ]
}