{
  "title": "LMMS",
  "url": "https://wiki.archlinux.org/title/LMMS",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nLMMS is a free cross-platform software which allows you to produce music with your computer. This covers creating melodies and beats, synthesizing and mixing sounds and arranging samples. You can have fun with your MIDI keyboard and much more – all in a user-friendly and modern interface. Furthermore LMMS comes with many ready-to-use instrument and effect plugins, presets and samples.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install lmms, or lmms-gitAUR for the development version. See [1] for release notes.\n\nAs always, if you want to use multiple audio applications simultaneously but your hardware does not natively support this, you will need either a usermode sound server, or to configure ALSA dmix.\n\n"
    },
    {
      "title": "MIDI and soundfonts",
      "level": 2,
      "content": "Depending on your setup and the installation method, you might need to manually setup a soundfont and Timidity.\n\nThen, you will need to edit the FluidSynth configuration file: /etc/conf.d/fluidsynth. For the audio driver, choose the sound server that you installed.\n\nStart the user service fluidsynth.service.\n\nWhen LMMS starts, it will prompt you with the settings. Go to the audio settings, choose the same interface that you set for FluidSynth, and restart LMMS if you made a switch.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "Some users are having troubles with drag-and-drop support on Wayland. To restore this functionality, you can try setting the environment variable QT_QPA_PLATFORM=xcb to let LMMS start in Xwayland.\n\n"
    }
  ]
}