{
  "title": "Man Page",
  "url": "https://wiki.archlinux.org/title/Man_Page",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Color output in console#man\n\nman pages—abbreviation for \"manual pages\"—are the form of documentation that is available on almost all UNIX-like operating systems, including Arch Linux. The command used to display them is man(1).\n\nIn spite of their scope, manual pages are designed to be self-contained documents, consequently limiting themselves to referring to other manual pages when discussing related subjects. This is in sharp contrast with the hyperlink-aware Info documents—GNU attempt at replacing the traditional manual page format.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "man-db implements man on Arch Linux, and less is the default pager used with man. mandoc can also be used.\n\nman-pages provides both the Linux and the POSIX.1 man pages [1].\n\nSome localized man pages are also available:\n\n- man-pages-cs for Czech\n- man-pages-da for Danish\n- man-pages-de for German\n- man-pages-el for Greek\n- man-pages-es for Spanish\n- man-pages-fi for Finnish\n- man-pages-fr for French\n- man-pages-hu for Hungarian\n- man-pages-id for Indonesian\n- man-pages-it for Italian\n- man-pages-jaAUR for Japanese\n- man-pages-mk for Macedonian\n- man-pages-nl for Dutch\n- man-pages-pl for Polish\n- man-pages-pt_br for Brazilian Portuguese\n- man-pages-ro for Romanian\n- man-pages-ru for Russian\n- man-pages-sr for Serbian\n- man-pages-sv for Swedish\n- man-pages-trAUR for Turkish\n- man-pages-uk for Ukrainian\n- man-pages-vi for Vietnamese\n- man-pages-zh_cn for Simplified Chinese\n- man-pages-zh_tw for Traditional Chinese\n\nYou can also search for all of the available localized man pages on the official repositories and on the AUR.\n\n"
    },
    {
      "title": "Accessing man pages",
      "level": 2,
      "content": "To read a man page, simply enter:\n\n```\n$ man page_name\n```\n\nManuals are sorted into several sections. Each section has an intro, such as intro(1), intro(2) and so on. For a full listing see man-pages(7) § Sections of the manual pages.\n\nMan pages are usually referred to by their name, followed by their section number in parentheses. Often there are multiple man pages of the same name, such as man(1) and man(7). In this case, give man the section number followed by the name of the man page, for example:\n\n```\n$ man 5 passwd\n```\n\nto read the man page on /etc/passwd, rather than the passwd utility.\n\nOr equivalently, the man page followed by the section number, separated by a period:\n\n```\n$ man passwd.5\n```\n\n"
    },
    {
      "title": "Searching manuals",
      "level": 2,
      "content": "Man pages can be searched when the exact name of a page is not known using any of the following equivalent commands:\n\n```\n$ man -k expression\n$ man --apropos expression\n$ apropos expression\n```\n\nexpression is interpreted as a regular expression by default.\n\nTo search for keywords in whole page texts, use the -K option instead.\n\nOne-line descriptions of man pages can be displayed using the whatis command. For example, for a brief description of the man page sections about ls, type:\n\n```\n$ whatis ls\n```\n\n```\nls (1p)              - list directory contents\nls (1)               - list directory contents\n```\n\n"
    },
    {
      "title": "Page width",
      "level": 2,
      "content": "The man page width is controlled by the MANWIDTH environment variable.\n\nIf the number of columns in the terminal is too small (e.g. the window width is narrow), the line breaks will be wrong. This can be very disturbing for reading. You can fix this by setting the MANWIDTH on man invocation. With Bash, that would be:\n\n```\n~/.bashrc\n```\n\n```\nman() {\n    local width=$(tput cols)\n    [ $width -gt $MANWIDTH ] && width=$MANWIDTH\n    env MANWIDTH=$width \\\n    man \"$@\"\n}\n```\n\n"
    },
    {
      "title": "Reading local man pages",
      "level": 2,
      "content": "You can use some applications to view man pages:\n\n- Emacs — The extensible and self-documenting editor can also be used to read man pages with the built-in M-x man command.\n\n- GNOME Help — Help viewer for GNOME. Part of gnome. It can show man pages via yelp man:<name> or the undocumented Ctrl+L keybinding from an existing window.\n\n- KHelpCenter — Application to show KDE Applications' documentation. Part of kde-system. Man pages are in UNIX manual pages or by running khelpcenter man:<name>.\n\n- Konqueror — KDE file manager and web browser. It can show man pages via man:<name>.\n\n- neovim — The editor can be used to read man pages using the built-in :Man name command, or configured as a man pager with export MANPAGER='nvim +Man!'. Supports highlighting and navigation between command-line flags, keywords, and other man pages. Automatically generates an outline using section headers, command-line flags, and keywords as entries (available via gO).\n\n- xman — Provides a categorized look at man pages.\n\nUsing browsers such as lynx and Firefox to view man pages allows users to reap info pages' main benefit of hyperlinked text. Alternatives include the following:\n\n"
    },
    {
      "title": "mandoc",
      "level": 4,
      "content": "Install the mandoc package. To convert a page, for example free(1):\n\n```\n$ mandoc -Thtml -Ostyle=style.css /usr/share/man/man1/free.1.gz > free.html\n```\n\nNow open the file called free.html in your favourite browser.\n\n"
    },
    {
      "title": "man2html",
      "level": 4,
      "content": "First, install man2html from the official repositories.\n\nNow, convert a man page:\n\n```\n$ man free | man2html -compress -cgiurl man$section/$title.$section$subsection.html > ~/man/free.html\n```\n\nAnother use for man2html is exporting to raw, printer-friendly text:\n\n```\n$ man free | man2html -bare > ~/free.txt\n```\n\n"
    },
    {
      "title": "man -H",
      "level": 4,
      "content": "The man-db implementation also has the ability to do this on its own:\n\n```\n$ man -H free\n```\n\nThis will read your BROWSER environment variable to determine the browser. You can override this by passing the binary to the -H option.\n\n"
    },
    {
      "title": "roffit",
      "level": 4,
      "content": "First install roffitAUR.\n\nTo convert a man page:\n\n```\n$ gunzip -c /usr/share/man/man1/free.1.gz | roffit > free.html\n```\n\n"
    },
    {
      "title": "Conversion to PDF",
      "level": 3,
      "content": "man pages have always been printable: they are written in troff(1), which is fundamentally a typesetting language. Therefore, you can easily convert man pages to any of the formats supported as output devices by groff, which is used by man-db. For a list of output devices, see the -T option in groff(1) (or mandoc(1) if you use the mandoc package).\n\nThis will produce a PDF file:\n\n```\n$ man -Tpdf manpage > filename\n```\n\nCaveats: Fonts are generally limited to Times at hardcoded sizes. Some man pages were specifically designed for terminal viewing, and will not look right in PS or PDF form.\n\n"
    },
    {
      "title": "Qman",
      "level": 3,
      "content": "For an alternative interface for reading manual pages, one that supports modern features such as hyperlinks and history, install qman-gitAUR. You can now use qman in the place of man:\n\n```\n$ qman ls    # Display the manual page for ls\n$ qman -k ls # Perform apropos on 'ls'\n```\n\nSee the project's GitHub page for more information.\n\n"
    },
    {
      "title": "Configuration (optional)",
      "level": 4,
      "content": "Qman's configuration file is located at ~/.config/qman.conf (user-specific) or /etc/xdg/qman.conf (system-wide).\n\nIf you are using a modern terminal that supports 256 colors and Unicode, you may want to use a custom configuration, to give the software a more modern look.\n\nBy default Qman opens hyperlinks and e-mail links using xdg-open. To override this, add the following to your configuration file:\n\n```\n[misc]\nbrowser_path=/path/to/your/browser\nmailer_path=/path/to/your/email/client\n```\n\n"
    },
    {
      "title": "Online man pages",
      "level": 2,
      "content": "- Arch Linux manual pages—contains man pages from Arch Linux packages. Used for man page links from the wiki. You can also use the !archman DuckDuckGo bang to search through the Arch manual pages directly.\n- man7.org—The Linux man-pages project. Upstream of the man-pages package. The online pages currently show an outdated version of man-pages (5.13, released in 2021).\n- manned.org—collection from various Linux distributions, BSD, etc., with multiple package versions.\n- linux.die.net\n- man.cx—Man pages extracted from Debian testing.\n- Debian man pages\n- Ubuntu man pages\n- DragonFlyBSD man pages\n- FreeBSD man pages\n- NetBSD man pages\n- OpenBSD man pages\n- Plan 9 Manual — Volume 1\n- Inferno Manual — Volume 1\n- The UNIX and Linux forums man page repository\n\nNote that while man-pages provides man pages for POSIX.1-2017 (see [2]), an official online reference also exists:\n\n- POSIX.1-2024\n- POSIX.1-2017\n\nThere is also a comparison table of the online databases.\n\n"
    },
    {
      "title": "Noteworthy man pages",
      "level": 2,
      "content": "Here follows a non-exhaustive list of noteworthy pages that might help you understand a lot of things more in-depth. Some of them might serve as a good reference (like the ASCII table).\n\n- ascii(7)\n- boot(7)\n- charsets(7)\n- chmod(1)\n- credentials(7)\n- fstab(5)\n- file-hierarchy(7)\n- systemd(1)\n- locale(1p), locale(5), locale(7)\n- printf(3)\n- proc(5)\n- regex(7)\n- signal(7)\n- term(5), term(7)\n- termcap(5)\n- terminfo(5)\n- utf-8(7)\n\nMore generally, have a look at category 7 (miscellaneous) pages:\n\n```\n$ man -s 7 -k \".*\"\n```\n\nArch Linux specific pages:\n\n- alpm-hooks(5)\n- libalpm(3)\n- makepkg(8)\n- makepkg.conf(5)\n- makepkg-template(1)\n- mkinitcpio(8)\n- pacman(8)\n- pacman.conf(5)\n- pacman-conf(8)\n- pacman-key(8)\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Gentoo:man page\n- Write The Fine Manual with pod2man\n- History of UNIX Manpages\n\n"
    }
  ]
}