{
  "title": "Moodle",
  "url": "https://wiki.archlinux.org/title/Moodle",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- MySQL\n- LAMP\n\nMoodle is a free and open-source e-learning software platform, written in PHP.\n\nThis article describes how to set up the Moodle server.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installation quick guide:\n\nBe aware a compatible PHP version is required.\n\nThere is also an AUR package moodleAUR for the installation.\n\nEither you can use this way:\n\nDownload the most current version of Moodle from https://download.moodle.org/ - this installation was done with 2.3.1+, and there may be minor changes to the install routine in later versions.\n\nUnzip it into /srv/http:\n\n```\n# tar xzvf moodle-latest-23.tgz -C /srv/http\n```\n\nMake it read/writeable by Apache:\n\n```\n# chown -R http:http /srv/http/moodle\n```\n\n"
    },
    {
      "title": "Preconfiguration",
      "level": 3,
      "content": "Some changes need to be made to the default setup so Moodle will work.\n\n"
    },
    {
      "title": "File access",
      "level": 4,
      "content": "Add /srv to /etc/php/php.ini:\n\n```\nopen_basedir = /srv/http/:/home/:/tmp/:/usr/share/pear/:/srv/\n```\n\nThis allows PHP to access the /srv/moodledata directory.BBS#80782\n\n"
    },
    {
      "title": "Create the MoodleData Directory",
      "level": 4,
      "content": "This needs to be readable and writeable by Apache:\n\n```\n# mkdir /srv/moodledata\n# chown http:http /srv/moodledata\n```\n\n"
    },
    {
      "title": "Configure PHP extension",
      "level": 4,
      "content": "Uncomment the following lines in /etc/php/php.ini (remove the semicolon from the start of the line):\n\n```\nextension=curl\nextension=gd\nextension=gettext\nextension=iconv\nextension=intl\nextension=mysqli\nextension=soap\nextension=xmlrpc\nextension=zip\n```\n\n"
    },
    {
      "title": "Restart Apache",
      "level": 4,
      "content": "You now need to restart Apache's httpd.service to make these changes current. Note that if you get any errors while installing Moodle, and make subsequent changes, you will need to restart Apache after each set of changes.\n\n"
    },
    {
      "title": "MariaDB",
      "level": 4,
      "content": "If you are using MariaDB and the moodle installer complains about the wrong version of MySQL, edit config.php in /srv/http/moodle\n\n```\n$CFG->dbtype    = 'mariadb'; \n$CFG->dblibrary = 'native';\n```\n\nYou will also need to create some tables so that Moodle can connect to it and modify it:\n\n```\nMariaDB[(none)] > CREATE USER 'moodleuser'@'localhost' IDENTIFIED BY 'yourpassword';\nMariaDB[(none)] > GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,CREATE TEMPORARY TABLES,DROP,INDEX,ALTER ON moodle.* TO 'moodleuser'@'localhost';\nMariaDB[(none)] > FLUSH PRIVILEGES;\nMariaDB[(none)] > exit;\n```\n\n"
    },
    {
      "title": "Configure a cron job",
      "level": 4,
      "content": "Per maintenance requirements, you need to configure a cron job to run regularly on your site.\n\nCheck Cron page to install a cron implementation. After that, edit your {{ic[/etc/crontab}} file and add the following:\n\n```\n* * * * *    /usr/bin/php /path/to/moodle/admin/cli/cron.php >/dev/null\n```\n\nChange the path to your Moodle installation directory.\n\n"
    },
    {
      "title": "Application configuration",
      "level": 3,
      "content": "Go to http://localhost/moodle/install.php - this starts the Moodle installer. There then follows a sequence of configuration screens, most of which should be left at the defaults:\n\n- Select the language\n- You should pass the first page of tests (PHP Settings).\n- Leave the default locations as they are. An error here is likely to be a data directory problem - check the directory exists, that it has the right ownership and that open_basedir in /etc/php/php.ini is set correctly.\n- On the MySQL Screen, enter the user (root) and that user's password in the screen. If you get an error here, go to the test.php created when you set up the LAMP stack and check mysql is working, and also check the passwords.\n- On the Environment screen, you should pass all the tests - if not the errors give you a clue what is missing - an uninstalled program or a failure to uncomment one of the lines in /etc/php/php.ini\n- If you are English, you do not need to download language packs.\n- If the config.php has failed - probably because of lack of write access to the moodle subdirectory - the most likely reason is the ownership of the /srv/http/moodle structure, which should be http:http - this was set earlier but you might have skipped that bit.\n- The remainder of the install should be automatic. It takes 2 or 3 minutes on my computer to set up all the SQL Databases and so on.\n- The final page allows you to set up the administrator user for Moodle. You need to enter a password, name and set the country as a bare minimum. Do not forget the password !\n\nHappy Moodling !\n\n"
    }
  ]
}