{
  "title": "Mozilla Firefox",
  "url": "https://wiki.archlinux.org/title/Mozilla_Firefox",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Firefox/Tweaks\n- Firefox/Profile on RAM\n- Firefox/Privacy\n- Browser extensions\n- Chromium\n\nFirefox is a popular open source graphical web browser from Mozilla.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the firefox package.\n\nOther alternatives include:\n\n- Firefox Developer Edition — for developers\n\n- Firefox Extended Support Release — long-term supported version\n\n- Firefox Beta — cutting-edge version\n\n- Firefox Nightly — nightly builds for testing (experimental features)\n\n- Firefox KDE — Version of Firefox that incorporates an OpenSUSE patch for better KDE integration than is possible through simple Firefox add-ons.\n\n- On top of the different Mozilla build channels, a number of forks exist with more or less special features; see List of applications/Internet#Gecko-based.\n\nA number of language packs are available for Firefox, other than the standard English. Language packs are usually named as firefox-i18n-languagecode (where languagecode can be any language code, such as de, ja, fr, etc.). For a list of available language packs, see firefox-i18n for firefox, firefox-developer-edition-i18n for firefox-developer-edition and firefox-nightly- for firefox-nightlyAUR.\n\n"
    },
    {
      "title": "Add-ons",
      "level": 2,
      "content": "Firefox is well known for its large library of add-ons which can be used to add new features or modify the behavior of existing features. Firefox's \"Add-ons Manager\" is used to manage installed add-ons or find new ones.\n\nFor instructions on how to install add-ons and a list of add-ons, see Browser extensions.\n\n"
    },
    {
      "title": "Adding search engines",
      "level": 3,
      "content": "Search engines may be added to Firefox by creating bookmarks:\n\n- Press the star on the address bar or Ctrl+d.\n- Right click on the bookmark you have created, then press Edit Bookmark...\n- Complete the URL field with search URLs. Complete the place of the query with %s. Complete the Keyword field with user-defined characters. Like this:\n\n```\nURL:\nhttps://duckduckgo.com/html/?q=%s\nKeyword:\nd\n```\n\nSearches are performed by pre-pending the search term with the keyword of the specified search engine: d archwiki will query DuckDuckGo using the search term archwiki\n\nSearch engines may also be added to Firefox through add-on extensions; see this page for a list of available search tools and engines.\n\nA very extensive list of search engines can be found at the Mycroft Project.\n\n"
    },
    {
      "title": "firefox-extension-arch-search",
      "level": 4,
      "content": "Install the firefox-extension-arch-searchAUR package to add Arch-specific searches (AUR, wiki, forum, packages, etc) to the Firefox search toolbar.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Firefox exposes a number of configuration options. To examine them, enter in the Firefox address bar:\n\n```\nabout:config\n```\n\nOnce set, these affect the user's current profile, and may be synchronized across all devices via Firefox Sync. Please note that only a subset of the about:config entries are synchronized by this method, and the exact subset may be found by searching for services.sync.prefs in about:config. Additional preferences and third party preferences may be synchronized by creating new boolean entries prepending the value with services.sync.prefs.sync. To synchronize the whitelist for the extension NoScript:\n\n```\nservices.sync.prefs.sync.capability.policy.maonoscript.sites\n```\n\nThe boolean noscript.sync.enabled must be set to true to synchronize the remainder of NoScript's preferences via Firefox Sync.\n\n"
    },
    {
      "title": "Settings storage",
      "level": 3,
      "content": "Firefox stores the configuration for a profile via a prefs.js in the profile folder, usually ~/.mozilla/firefox/xxxxxxxx.default/.\n\nFirefox also allows configuration for a profile via a user.js file: user.js kept also in the profile folder. A user.js configuration supersedes a prefs.js. The user.js configuration is only parsed at start-up of a profile. Hence, you can test changes via about:config and modify user.js at runtime accordingly. For a useful starting point, see e.g custom user.js which is targeted at privacy/security conscious users.\n\nOne drawback of the above approach is that it is not applied system-wide. Furthermore, this is not useful as a \"pre-configuration\", since the profile directory is created after first launch of the browser. You can, however, let firefox create a new profile and, after closing it again, copy the contents of an already created profile folder into it.\n\nSometimes, it may be desired to lock certain settings, a feature useful in widespread deployments of customized Firefox. In order to create a system-wide configuration, follow the steps outlined in Customizing Firefox Using AutoConfig:\n\n1. Create /usr/lib/firefox/defaults/pref/autoconfig.js:\n\n```\npref(\"general.config.filename\", \"firefox.cfg\");\npref(\"general.config.obscure_value\", 0);\n```\n\n2. Create /usr/lib/firefox/firefox.cfg (this stores the actual configuration):\n\n```\n//\n//...your settings...\n// e.g to disable Pocket, uncomment the following lines\n// lockPref(\"extensions.pocket.enabled\", false);\n// lockPref(\"browser.newtabpage.activity-stream.feeds.section.topstories\", false);\n```\n\nPlease note that the first line must contain exactly //. The syntax of the file is similar to that of user.js.\n\n"
    },
    {
      "title": "Multimedia playback",
      "level": 3,
      "content": "Firefox uses FFmpeg for playing multimedia inside HTML5 <audio> and <video> elements. Use https://cconcolato.github.io/media-mime-support/ to test video or https://hpr.dogphilosophy.net/test/ to test audio, to determine which formats are actually supported.\n\nFirefox uses PulseAudio for audio playback and capture. If PulseAudio is not installed, Firefox uses ALSA instead. Note that by default, Firefox blocks all media with sound from playing automatically [2].\n\n"
    },
    {
      "title": "HTML5 DRM/Widevine",
      "level": 4,
      "content": "Widevine is a digital rights management tool that Netflix, Amazon Prime Video, and others use to protect their video content. It can be enabled in Settings > General > Digital Rights Management (DRM) Content. If you visit a Widevine-enabled page when this setting is disabled, Firefox will display a prompt below the address bar asking for permission to install DRM. Approve this and then wait for the \"Downloading\" bar to disappear; now, you are able to watch videos from Widevine protected sites.\n\nFirefox can only play 720p video (or lower) with Widevine, due to not using hardware DRM playback. It is also required that the private mode browsing is disabled, for the window and in the Settings.\n\n"
    },
    {
      "title": "\"Open With\" extension",
      "level": 4,
      "content": "1. Install Open With add-on.\n1. Go to Add-ons > Open With > Preferences.\n1. Proceed with instructions to install a file in your system and test the installation.\n1. Click Add browser.\n1. In the dialog, write a name for this menu entry and command to start a video streaming capable player (e.g. /usr/bin/mpv). Optionally, add needed arguments to the player (e.g. you may want --force-window --ytdl for mpv).\n1. Right click on links or visit pages containing videos. Select newly created entry from Open With's menu and if the site is supported, the player will open as expected.\n\n1. Optionally, add needed arguments to the player (e.g. you may want --force-window --ytdl for mpv).\n\nThe same procedure can be used to associate video downloaders such as youtube-dl.\n\n"
    },
    {
      "title": "Hardware video acceleration",
      "level": 4,
      "content": "Hardware video acceleration via VA-API is available under Wayland [3] and Xorg [4] [5].\n\nTo enable VA-API in Firefox:\n\n1. Ensure that your video card is correctly configured for VA-API as described in Hardware video acceleration.\n1. Ensure WebRender is enabled by navigating to about:support and verifying the Compositing value is \"WebRender\". It is enabled by default in GNOME and other desktop environments [6]. Ensure you are not running \"Software WebRender\" as that will not work as of August 2021 [7]. If necessary, Hardware WebRender can be force enabled by setting gfx.webrender.all to true in about:config.\n1. VA-API is enabled by default for Intel GPUs [8] since Firefox 115, and for AMD GPUs [9] since Firefox 136. For other GPUs, set media.ffmpeg.vaapi.enabled to true in about:config.\n1. Optionally, to save power on multi-GPU systems (e.g. Ryzen 7000 series with IGP and GPU) and/or take advantage of more video codecs supported by a IGP/GPU: run Firefox with MOZ_DRM_DEVICE environment variable set to the preferred rendering device. (Available devices can be listed with stat /dev/dri/*).\n\n- Ensure you are not running \"Software WebRender\" as that will not work as of August 2021 [7].\n- If necessary, Hardware WebRender can be force enabled by setting gfx.webrender.all to true in about:config.\n\n- If hardware video acceleration is blocked with error code FEATURE_HARDWARE_VIDEO_DECODING_DISABLE or FEATURE_FAILURE_VIDEO_DECODING_TEST_FAILED in about:support, you can override it with media.hardware-video-decoding.force-enabled=true. See [10] for more information. Alternatively, you can install firefox-vaapiAUR.\n- While NVIDIA's proprietary driver does not support VA-API, newer versions support DMA-BUF. Using libva-nvidia-driver will allow for hardware video decoding on NVIDIA using CUDA. See the GitHub project for documentation on necessary environment variables and about:config changes.\n- Currently, Firefox's VA-API implementation can decode H.264/AVC, H.265/HEVC, VP8 & VP9, AV1 encoded video. AV1 support requires Firefox 98+ [11]. H.265/HEVC support requires Firefox 137+ [12].\n- Multi-GPU systems should automatically choose a suitable GPU for VA-API according to this solved issue.\n- AMDGPU users under linux-hardened may need to rebuild linux-hardened with CONFIG_CHECKPOINT_RESTORE=y due to mesa requiring the kcmp syscall. This may no longer be necessary due to this bug being solved.\n- Wayland sometimes interferes with hardware video decoding. If video briefly flickers when you go fullscreen, you may need to set widget.wayland.opaque-region.enabled=false in about:config.\n- If you are using nvidia-open or nvidia-open-dkms, nvidia-smi may show the VRAM usage by firefox is 0MB. This is normal and can be ignored. You can switch driver to nvidia or nvidia-dkms to fix it.\n\nVA-API usage can be verified by checking Firefox's VA-API logs. Run Firefox with the MOZ_LOG=\"FFmpegVideo:5\" environment variable and check in the log output that VA-API is enabled and used (search for the \"VA-API\" string) when playing a video for example. Pay attention to these logs as they might indicate that only one of the two possible compositors described before (WebRender or OpenGL) works with VA-API on your particular setup.\n\n"
    },
    {
      "title": "Spell checking",
      "level": 3,
      "content": "Firefox can use system-wide installed Hunspell dictionaries as well as dictionaries installed through its own extension system.\n\nTo enable spell checking for a specific language, right click on any text field and check the Check Spelling box. To select a language for spell checking, you have to right click again and select your language from the Languages sub-menu.\n\nIf your default language choice does not stick, see #Firefox does not remember default spell check language.\n\n"
    },
    {
      "title": "System-wide Hunspell dictionaries",
      "level": 4,
      "content": "Install Hunspell and its dictionaries for the languages you require.\n\n"
    },
    {
      "title": "Dictionaries as extensions",
      "level": 4,
      "content": "To get more languages, right click on any text field, click Add Dictionaries... and select the dictionary you want to install from the Dictionaries and Language Packs list.\n\n"
    },
    {
      "title": "XDG Desktop Portal integration",
      "level": 3,
      "content": "Starting with version 64, Firefox can optionally use XDG Desktop Portals to handle various desktop features, such as opening a file picker, or handling MIME types. Using Desktop Portals allows you to, for example, customize which program is invoked to display a dialog when you select files to upload on a webpage or when picking a download location using Save as.... See XDG Desktop Portal#List of backends and interfaces for a list of available backend options.\n\nFirefox has a number of independent settings for specifying whether each feature should be handled with a Desktop Portal request or whether to use the default GTK feature.\n\nEach setting can have the following values:\n\n- 0 – Never\n- 1 – Always\n- 2 – Auto (typically depends on whether Firefox is run from within Flatpak or whether the GDK_DEBUG=portals environment is set)\n\nThe settings are:\n\n- widget.use-xdg-desktop-portal.file-picker – Whether to use XDG portal for the file picker\n- widget.use-xdg-desktop-portal.mime-handler – Whether to use XDG portal for the mime handler\n- widget.use-xdg-desktop-portal.settings – Whether to try to use XDG portal for settings/look-and-feel information\n- widget.use-xdg-desktop-portal.location – Whether to use XDG portal for geolocation\n- widget.use-xdg-desktop-portal.open-uri – Whether to use XDG portal for opening to a file\n\n"
    },
    {
      "title": "KDE integration",
      "level": 3,
      "content": "- To apply KDE styles to GTK applications, including Firefox, see KDE#GTK application appearance.\n- To use the KDE file picker in Firefox 64 or newer, install xdg-desktop-portal and xdg-desktop-portal-kde, then set widget.use-xdg-desktop-portal.file-picker to 1 in about:config.\n- For integration with KDE MIME type system, proxy and file dialog, one can use firefox-kde-opensuseAUR variant from AUR with OpenSUSE’s patches applied. Alternatively, integration with MIME types can be achieved by creating a symbolic link to the MIME database ~/.config/mimeapps.list from the deprecated ~/.local/share/applications/mimeapps.list that is used by Firefox. See XDG MIME Applications#mimeapps.list.\n- Extensions/add-ons may provide additional integration, such as: Browser integration in Plasma: requires plasma-browser-integration and the Plasma Integration add-on.\n\n- Browser integration in Plasma: requires plasma-browser-integration and the Plasma Integration add-on.\n\n"
    },
    {
      "title": "GNOME integration",
      "level": 3,
      "content": "In order to use the GNOME file picker, you will need to install xdg-desktop-portal-gnome and change widget.use-xdg-desktop-portal.file-picker from 2 to 1 in about:config.\n\n"
    },
    {
      "title": "Listen (text to speech)",
      "level": 3,
      "content": "Firefox can perform Text to Speech synthesis for web pages.\n\n"
    },
    {
      "title": "Setup",
      "level": 4,
      "content": "TTS must be setup for the Listen icon to appear in the Reader view. Firefox uses Speech dispatcher which requires a speech synthesis engine. The currently recommended speech synthesis engine is Festival.\n\n"
    },
    {
      "title": "Usage",
      "level": 4,
      "content": "See the illustrated steps on Mozilla's website.\n\nThe Listen icon (a headphones icon) will only appear if you have performed all the configuration above, Speech Dispatcher is working, and you have started Firefox after you started the Festival server (you cannot start Firefox then Festival).\n\nFurthermore, sometimes a Festival server process may linger after you have tried to kill it, but will terminate after you shut down Firefox.\n\nFor common issues, see #Web Speech API has no voices and #Narrate/Listen icon missing in Reader Mode.\n\n"
    },
    {
      "title": "Using the festival-us voices",
      "level": 4,
      "content": "The voices in the package festival-us provide better quality audio than those in festival-english but they do not work in Firefox. They do not appear in the list of available voices in Firefox and when you open Reader view you will see error messages like this in the terminal output from the Festival server:\n\n```\nSIOD: unknown voice cmu_us_awb_cg\n```\n\nTo fix this you need to edit the following files:\n\n- /usr/share/festival/voices/us/cmu_us_awb_cg/festvox/cmu_us_awb_cg.scm\n- /usr/share/festival/voices/us/cmu_us_rms_cg/festvox/cmu_us_rms_cg.scm\n- /usr/share/festival/voices/us/cmu_us_slt_cg/festvox/cmu_us_slt_cg.scm\n\nFor each of these files you need to add some code to the second last line of code of each file, eg for cmu_us_awb_cg.scm add code before this line:\n\n```\n(provide 'cmu_us_awb_cg)\n```\n\nThe code you need to add to cmu_us_awb_cg.scm is below. You will need to change the voice name, gender, dialect and description as appropriate for the other two files.\n\n```\n(proclaim_voice\n 'cmu_us_awb_cg\n '((language english)\n   (gender male)\n   (dialect scottish)\n   (description \"This voice is Scottish\")))\n```\n\n"
    },
    {
      "title": "Tips and tricks",
      "level": 2,
      "content": "For general enhancements, see Firefox/Tweaks, and for privacy related enhancements, see Firefox/Privacy.\n\n"
    },
    {
      "title": "Dark themes",
      "level": 3,
      "content": "Firefox should respect your GTK theme settings and your OS-wide dark appearance settings (as in the Appearance section of GNOME's settings or KDE system settings). If the latter does not work, make sure to have a suitable xdg-desktop-portal package installed.\n\nStarting with Firefox 68, you can make all the Firefox interfaces and even other websites respect dark themes, irrespective of the system GTK theme and Firefox theme. To do this, set ui.systemUsesDarkTheme to 1 in about:config [13].\n\nAs of Firefox 100, further control of the dark theme of web pages that opt-in (using the CSS media query prefers-color-scheme) and Firefox's own in-content pages is possible with layout.css.prefers-color-scheme.content-override. Setting this to 3 will follow the browser theme, setting this to 2 will follow the system wide dark-mode preference (ui.systemUsesDarkTheme as above, which defaults to 0 if the user has not changed the dark-mode preference or if a system does not support a system-wide dark-mode preference), while 1 and 0 will always force light-mode and dark-mode respectively. This setting can also be accessed through the user settings of Firefox under General > Language and Appearance > Website appearance.\n\n"
    },
    {
      "title": "Frame rate",
      "level": 3,
      "content": "If Firefox is unable to automatically detect the right value, it will default to 60 fps. To manually correct this, set layout.frame_rate to the refresh rate of your monitor (e.g. 144 for 144 Hz).\n\n"
    },
    {
      "title": "Memory limit",
      "level": 3,
      "content": "To prevent pages from abusing memory (and possible OOM), we can use Firejail with the rlimit-as option.\n\n"
    },
    {
      "title": "New tabs position",
      "level": 3,
      "content": "To control where new tabs appears (relative or absolute), use browser.tabs.insertAfterCurrent and browser.tabs.insertRelatedAfterCurrent. See [14] for more information.\n\n"
    },
    {
      "title": "Screenshot of webpage",
      "level": 3,
      "content": "You can Take a Screenshot by either using the screenshots button that can be added to the toolbar from the customize screen in the Hamburger menu at More tools > Customize toolbar, by pressing Ctrl+Shift+s or by right-clicking on the webpage. See Firefox screenshots for more information, including on the telemetry data collection.\n\nYou can also use the screenshot button in the developer tools, which can be added through the developer tools Settings menu, under the Available Toolbox Buttons section. The settings for the developer tools are accessible through the three horizontal dots located at the top right of the developer tools pane.\n\n"
    },
    {
      "title": "Xwayland",
      "level": 3,
      "content": "Starting with version 121, Firefox defaults to Wayland instead of XWayland and does not require any configuration.\n\nYou can force Xwayland mode via an environment variable.\n\n```\n$ MOZ_ENABLE_WAYLAND=0 firefox\n```\n\nTo make this permanent, see Environment variables#Graphical environment and start Firefox via the desktop launcher like you normally would.\n\nTo verify that it worked, look for Window Protocol in about:support. The presence of x11 means you are running Firefox under Xorg display server, while xwayland means your system is running Wayland but executing Firefox as legacy X11 application.\n\n"
    },
    {
      "title": "Window manager rules",
      "level": 3,
      "content": "To be able to apply different configurations to Firefox windows, change the WM_CLASS string by using Firefox's --class option. Under Wayland, Firefox uses the --name option instead. You can then reference separate Firefox windows in your window manager by using the strings you set.\n\n"
    },
    {
      "title": "Profiles",
      "level": 3,
      "content": "To start new Firefox instances, multiple profiles are required. To create a new profile:\n\n```\n$ firefox [--new-instance] -P\n```\n\nClass can be specified when launching Firefox with a not-in-use profile:\n\n```\n$ firefox [--new-instance] -P profile_name --class=class_name\n```\n\nFirefox Profilemaker can be used to create a Firefox profile with the defaults you like.\n\n"
    },
    {
      "title": "Touchscreen gestures and pixel-perfect trackpad scrolling",
      "level": 3,
      "content": "See Firefox/Tweaks#Pixel-perfect trackpad scrolling, Firefox/Tweaks#Enable touchscreen gestures and Firefox/Tweaks#Smooth scrolling.\n\n"
    },
    {
      "title": "Multiple home pages",
      "level": 3,
      "content": "To have multiple tabs opened when starting Firefox, open a new window and then open the sites you want to have as \"home tabs\".\n\nNow go to Settings > Home and under Homepage and new windows click the Use Current Pages button.\n\nAlternatively, go directly to Settings > Home and now under Homepage and new windows set the first field to Custom URLs.. and enter the pages you want as new home pages in the following format:\n\n```\nhttps://url1.com|https://url2.com|https://url3.com\n```\n\n"
    },
    {
      "title": "View two pages side by side in the PDF viewer",
      "level": 3,
      "content": "To display two pages at once with the integrated PDF viewer, set pdfjs.spreadModeOnLoad to 1 in about:config.\n\n"
    },
    {
      "title": "Kiosk mode",
      "level": 3,
      "content": "Firefox supports kiosk mode that shows pages in full screen without browser chrome, context menus, and other features useful for typical desktop browsing. These can be seen on ATMs or information panels where users are not expected to interact with the rest of the system.\n\nTo use kiosk mode, start Firefox with:\n\n```\n$ firefox --kiosk url\n```\n\nThe startup page can be configured in the settings or supplied as a command-line parameter.\n\nIf you need printing, you can prevent Firefox from showing paper size configuration dialogs with:\n\n```\n$ firefox --kiosk --kiosk-printing url\n```\n\n"
    },
    {
      "title": "Compact mode",
      "level": 3,
      "content": "Starting with Firefox version 89, the compact mode density option was removed from the Customize panel [15], but you can still use compact density. To do this, set browser.uidensity to 1 in about:config.\n\nThe UI can be scaled down even further, see Firefox/Tweaks#Configure the DPI value but use values between 0 and 1 instead.\n\n"
    },
    {
      "title": "GNOME search provider",
      "level": 3,
      "content": "Firefox includes a search provider for GNOME Shell which exposes Firefox bookmarks and history to GNOME Shell search while Firefox is running. However, this provider is disabled by default; to enable it go to about:config and set browser.gnome-search-provider.enabled to true.\n\n"
    },
    {
      "title": "Custom date and time format in Library window",
      "level": 3,
      "content": "The date and time format used in the Library window (the window showing bookmarks, history and downloads, accessible via Ctrl+Shift+o and Ctrl+Shift+h) can be customized by setting intl.date_time.pattern_override.date_short, intl.date_time.pattern_override.time_short, and intl.date_time.pattern_override.connector_short in user.js or about:config. For example, to get a format similar to RFC:3339 (\"2022-12-31 22:49\"), set the three preferences to yyyy-MM-dd, HH:mm, and {1} {0} , respectively.\n\nSetting the LC_TIME environment variable to en_DK.UTF-8 only worked in old Firefox versions (perhaps 57 and earlier). Mozilla's bug report 1426907 contains further information.\n\n"
    },
    {
      "title": "Disable the Ctrl+q keybinding for shutting down Firefox",
      "level": 3,
      "content": "Create and set the option browser.quitShortcut.disabled to true in about:config.\n\n"
    },
    {
      "title": "Enable hybrid post-quantum key exchange",
      "level": 3,
      "content": "Firefox supports X25519Kyber768, a hybrid post-quantum key exchange for TLS 1.3. Since Firefox 132.0, it is enabled by default. To test that it is working you can visit this Cloudflare Research test page, which will tell you whether you are using a PQ-safe key exchange.\n\n"
    },
    {
      "title": "Disable cursor blinking",
      "level": 3,
      "content": "By default, Firefox enables cursor blinking. To stop the cursor from blinking, set ui.caretBlinkTime to 0 in about:config [16].\n\n"
    },
    {
      "title": "Troubleshoot Mode",
      "level": 3,
      "content": "The command line switch -safe-mode starts Firefox in Troubleshoot Mode, which disables extensions, themes, hardware acceleration, the JIT and some other features for this session.\n\nThis mode can also be enabled by pressing on the hamburger menu while Firefox is open, clicking Help, selecting Troubleshoot Mode and confirming this on the modal dialog that appears. Please note this will require a browser restart.\n\nThis mode was previously named Safe Mode until Firefox 88.\n\n"
    },
    {
      "title": "Firefox refresh",
      "level": 3,
      "content": "Some issues experienced by users in Firefox may be caused by profile issues, such as corruption.\n\nIf you have ruled out other causes, it may be worth trying a new Firefox profile for testing purposes to see if this will resolve your issue. More information on how to create a new profile and switch between profiles can be found on the Firefox support page.\n\nIf this resolves your issue, you should switch back to your original profile and consider refreshing your Firefox.\n\nRefreshing your profile will retain all browsing and download history, bookmarks, web form auto-fill data, cookies, personal dictionary and passwords, and will transfer them to a brand new profile without extensions, themes, extension data and preferences, among other data. A backup of your old profile will also be retained.\n\nTo refresh your profile, navigate to about:support, press Refresh Firefox and confirm this on the modal dialog that appears. about:support can also be accessed by pressing the Hamburger menu, selecting Help and then clicking More troubleshooting information.\n\nMore information on refreshing your Firefox, including further details about what is transferred to the new profile, can be found on the Firefox support page.\n\n"
    },
    {
      "title": "Hardware video acceleration issues",
      "level": 3,
      "content": "If you are having issues with hardware video acceleration in Firefox, e.g. in case of freezes or graphical corruption, start Firefox in Troubleshoot Mode for testing purposes to confirm that this is the issue. If this step resolves the issue, merely set media.ffmpeg.vaapi.enabled to false in about:config to disable hardware video acceleration, and restart Firefox.\n\n"
    },
    {
      "title": "Extension X does not work on some Mozilla owned domains",
      "level": 3,
      "content": "By default, extensions will not affect pages designated by extensions.webextensions.restrictedDomains. If this is not desired, this field can be cleared (special pages such as about:* will not be affected). Then create and set privacy.resistFingerprinting.block_mozAddonManager to true.\n\n"
    },
    {
      "title": "Firefox startup takes very long",
      "level": 3,
      "content": "If Firefox takes much longer to start up than other browsers, it may be due to lacking configuration of the localhost in /etc/hosts. See Network configuration#Local network hostname resolution on how to set it up.\n\nMisbehaving Firefox extensions, or too many extensions, may be another source of slow startup. This can be confirmed through the use of Troubleshoot Mode, which will disable extensions on restart.\n\nA further cause of slow start-up may be a profile issue, such as corruption. For more troubleshooting steps around your Firefox profile, see #Firefox refresh.\n\n"
    },
    {
      "title": "Font troubleshooting",
      "level": 3,
      "content": "See Font configuration.\n\nFirefox has a setting which determines how many replacements it will allow from Fontconfig. To allow it to use all your replacement rules, change gfx.font_rendering.fontconfig.max_generic_substitutions to 127 (the highest possible value).\n\nFirefox ships with the Twemoji Mozilla font. To use the system emoji font, set font.name-list.emoji to emoji in about:config. Additionally, to prevent the Mozilla font interfering with your system emoji font, change gfx.font_rendering.opentype_svg.enabled to false or remove /usr/lib/firefox/fonts/TwemojiMozilla.ttf (see also pacman#Skip files from being installed to system).\n\n"
    },
    {
      "title": "Setting an email client",
      "level": 3,
      "content": "Inside the browser, mailto links by default are opened by a web application such as Gmail or Yahoo Mail. To set an external email program, go to Settings > General > Applications and modify the action corresponding to the mailto content type; the file path will need to be designated (e.g. /usr/bin/kmail for Kmail).\n\nOutside the browser, mailto links are handled by the x-scheme-handler/mailto mime type, which can be easily configured with xdg-mime. See Default applications for details and alternatives.\n\n"
    },
    {
      "title": "File association",
      "level": 3,
      "content": "See Default applications.\n\n"
    },
    {
      "title": "Firefox keeps creating ~/Desktop even when this is not desired",
      "level": 3,
      "content": "Firefox uses ~/Desktop as the default place for download and upload files. To change it to another folder, set the XDG_DESKTOP_DIR option as explained in XDG user directories.\n\n"
    },
    {
      "title": "My downloads directory is full of files I do not remember saving",
      "level": 3,
      "content": "In Firefox version 98, the behavior of opening files in external programs was silently changed. Instead of downloading them into /tmp and giving that file location to the child process, Firefox now downloads the file as if you had chosen to save it, and then gives the child process the location of the file in your downloads directory. As a result, your downloads will be littered with files you only ever intended to open for viewing. This happens both when you select a program to use to open the file in a dialog and for file types you have configured to automatically open in a specific program. Notably this also happens for some file types that are opened internally in Firefox (such as PDF documents if the in-browser PDF.js viewer is enabled).\n\nDue to an oversight, the dialog prompting you for what to do with the file still describes the old choices (either open or save) while it is in reality always going to save the file. Since this behavior could realistically pose a security and privacy risk to certain users who expect the files to not be saved to disk, you might want to disable the new behavior.\n\nTo do this, create and set browser.download.start_downloads_in_tmp_dir to true in about:config.\n\nAlternatively, to prevent Firefox from automatically saving PDFs into the downloads directory while opening them in the in-browser viewer, set browser.download.open_pdf_attachments_inline to true in about:config.\n\n"
    },
    {
      "title": "Additional settings to consider",
      "level": 4,
      "content": "- browser.download.forbid_open_with: true (only ask whether to save or cancel in the file saving dialog, never ask to open with another program)\n- browser.download.always_ask_before_handling_new_types: true (same as Settings > General > Files and Applications > What should Firefox do with other files? > Ask whether to open or save files).\n- Set all known file types in Settings > General > Files and Applications to Always ask, with the possible exception of the ones set to be opened by Firefox itself.\n\n"
    },
    {
      "title": "Changes to userChrome.css and userContent.css are ignored",
      "level": 3,
      "content": "Set toolkit.legacyUserProfileCustomizations.stylesheets to true in about:config\n\n"
    },
    {
      "title": "Middle-click behavior",
      "level": 3,
      "content": "To autoscroll on middle-click (default for Windows browsers), you have two ways to enable this feature:\n\n- Go to Settings > General, look for the Browsing section and enable Use autoscrolling option.\n\n- Alternatively, set general.autoScroll to true in about:config.\n\nTo disable pasting from the clipboard (PRIMARY selection) when the middle mouse button is clicked, set middlemouse.paste to false in about:config.\n\nTo load the contents of the clipboard as a URL when the middle mouse button is clicked, middlemouse.contentLoadURL to true in about:config. This was the default behaviour prior to Firefox 57.\n\n"
    },
    {
      "title": "Backspace does not work as the 'Back' button",
      "level": 3,
      "content": "According to MozillaZine, the Backspace key was mapped based on which platform the browser was running on. As a compromise, this preference was created to allow the Backspace key to either go back/forward, scroll up/down a page, or do nothing.\n\nTo make Backspace go back one page in the tab's history and Shift+Backspace go forward, set browser.backspace_action to 0 in about:config.\n\nTo have the Backspace key scroll up one page and Shift+Backspace scroll down one page, set browser.backspace_action to 1. Setting this property to any other value will leave the key unmapped (Arch Linux defaults to 2; in other words, it is unmapped by default).\n\n"
    },
    {
      "title": "Firefox does not remember login information",
      "level": 3,
      "content": "It may be due to a corrupted cookies.sqlite file in Firefox's profile folder. In order to fix this, just rename or remove cookie.sqlite while Firefox is not running.\n\nOpen a terminal of choice and type the following:\n\n```\n$ rm -f ~/.mozilla/firefox/<profile id>.default/cookies.sqlite\n```\n\nThe profile id is a random 8 character string.\n\nRestart Firefox and see if it solved the problem.\n\nIf it did not work, check if there exists a cookies.sqlite.bak file that you could use to manually restore the cookies.\n\n"
    },
    {
      "title": "Cannot enter/leave fullscreen",
      "level": 3,
      "content": "If Firefox detects an EWMH/ICCCM compliant window manager, it will try to send a WM_STATE message to the root window to request Firefox be made to enter (or leave) full-screen mode (as defined by the window manager). Window managers are allowed to ignore it, but if they do, Firefox will assume the request got denied and propagate it to the end user which results in nothing happening. This may result in not being able to full screen a video. A general workaround is to set the full-screen-api.ignore-widgets to true in about:config.\n\nRelated bug reports: Bugzilla 1189622.\n\n"
    },
    {
      "title": "Scrollbar is not hidden/disabled when YouTube is fullscreen",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nThis can be fixed using a uBlock Origin filter. To add a filter, click the uBlock Origin extension icon > Three cogwheels (Open the dashboard) > My Filters. Then, add the following to the text field:\n\n```\nwww.youtube.com##ytd-app:style(overflow: hidden !important;)\n```\n\nAfter applying the changes and reloading the YouTube window, the filter will take effect. Note that you have to have cosmetic filtering enabled for this to work (the middle icon with the eye).\n\n"
    },
    {
      "title": "JavaScript context menu does not appear on some sites",
      "level": 3,
      "content": "You can try setting dom.w3c_touch_events.enabled to 0 in about:config.\n\n"
    },
    {
      "title": "Firefox does not remember default spell check language",
      "level": 3,
      "content": "The default spell checking language can be set as follows:\n\n1. Type about:config in the address bar.\n1. Set spellchecker.dictionary to your language of choice, for instance en_GB.\n1. Notice that the for dictionaries installed as a Firefox plugin the notation is en-GB, and for hunspell dictionaries the notation is en_GB.\n\nWhen you only have system wide dictionaries installed with hunspell, Firefox might not remember your default dictionary language settings. This can be fixed by having at least one dictionary installed as a Firefox plugin. Notice that now you will also have a tab Dictionaries in Add-ons. You may have to change the order of preferred language for displaying pages in about:preferences#general to make the spell check default to the language of the addon dictionary.\n\nRelated questions on the StackExchange platform: [17], [18], [19]\n\nRelated bug reports: Bugzilla 776028, Ubuntu bug 1026869\n\n"
    },
    {
      "title": "Firefox does not find system-wide Hunspell spell checking dictionaries",
      "level": 3,
      "content": "Ensure that the setting spellchecker.dictionary_path exists and is set to the path of the system's Hunspell dictionaries: /usr/share/hunspell.\n\n"
    },
    {
      "title": "Some MathML symbols are missing",
      "level": 3,
      "content": "You need some Math fonts, namely Latin Modern Math and STIX (see this MDN page: [20]), to display MathML correctly.\n\nIn Arch Linux, these fonts are provided by texlive-fontsextra, but they are not available to fontconfig by default. See TeX Live#Making fonts available to Fontconfig for details. You can also try other Math fonts. In case you encounter this bug [21], installing otf-latinmodern-math can help.\n\n"
    },
    {
      "title": "Videos load but do not play",
      "level": 3,
      "content": "This may be a PulseAudio issue. See the suggested fix in PulseAudio/Troubleshooting#Browsers (firefox) load videos but do no play.\n\n"
    },
    {
      "title": "Tearing when scrolling",
      "level": 3,
      "content": "Try disabling smooth scrolling in Settings > General > Browsing. Note that the pages will scroll jerkily.\n\n"
    },
    {
      "title": "Firefox WebRTC module cannot detect a microphone",
      "level": 3,
      "content": "WebRTC applications for instance Firefox WebRTC getUserMedia test page say that microphone cannot be found. Issue is reproducible for both ALSA or PulseAudio setup. Firefox debug logs show the following error:\n\n```\n$ NSPR_LOG_MODULES=MediaManager:5,GetUserMedia:5 firefox\n```\n\n```\n...\n[Unnamed thread 0x7fd7c0654340]: D/GetUserMedia  VoEHardware:GetRecordingDeviceName: Failed 1\n```\n\nYou can try setting media.navigator.audio.full_duplex property to false at about:config Firefox page and restart Firefox.\n\nThis can also help if you are using the PulseAudio module-echo-cancel and Firefox does not recognise the virtual echo canceling source.\n\n"
    },
    {
      "title": "WebRTC sharing indicator displays an XML parsing error",
      "level": 3,
      "content": "After agreeing to share a microphone or web camera, you may then see a window with a tan background and a red border in the top left corner on your primary window, displaying the following error message:\n\n```\nXML Parsing Error: no root element found\nLocation: chrome://browser/content/webrtcLegacyIndicator.xhtml\nLine Number: 1, Column 1:\n^\n```\n\nIf this is the case for you, performing the following steps should resolve the issue:\n\n1. Navigate to about:support.\n1. Click on the Clear Startup Cache button and agree to restart the browser.\n\nSee Mozilla's bug report for more information.\n\n"
    },
    {
      "title": "Cannot login with my Chinese account",
      "level": 3,
      "content": "Firefox provides a local service for Chinese users, with a local account totally different from the international one. Firefox installed with the firefox package uses the international account system by default, to change into the Chinese local service, you should install the add-on manager on this page, then you can login with your Chinese account now.\n\n"
    },
    {
      "title": "No audio on certain videos when using JACK and PulseAudio",
      "level": 3,
      "content": "If you are using JACK in combination with PulseAudio and cannot hear any sound on some videos, it could be because those videos have mono audio. This happens if your JACK setup uses more than just stereo, but you use normal headphones. To fix this, you simply have to connect the front-center port from the PulseAudio JACK Sink to both playback_1 and playback_2 ports of the system output.\n\nYou can also do this automatically using a script:\n\n```\njack-mono.sh\n```\n\n```\n#!/bin/sh\njack_connect \"PulseAudio JACK Sink:front-center\" \"system:playback_1\"\njack_connect \"PulseAudio JACK Sink:front-center\" \"system:playback_2\"\n```\n\nKeep in mind that the names for the sink and the ports might be different for you. You can check what your JACK setup looks like with a Patchbay like Catia from cadenceAUR.\n\n"
    },
    {
      "title": "Geolocation does not work",
      "level": 3,
      "content": "Recently, Google limited the use of its location service with Arch Linux, which causes the following error when geolocation is enabled on a website: Geolocation error: Unknown error acquiring position. Region-locked services such as Hulu may display a similar error indicating that your location could not be determined even though you have allowed location services for the site.\n\nSee FS#65241 for more details.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nTo avoid these problems, you can switch to use the Mozilla Location Service. In about:config change the geo.provider.network.url setting to:\n\n```\nhttps://location.services.mozilla.com/v1/geolocate?key=%MOZILLA_API_KEY%\n```\n\n"
    },
    {
      "title": "Right mouse button instantly clicks the first option in window managers",
      "level": 3,
      "content": "This problem has been observed in i3, bspwm and xmonad.\n\nTo fix it, navigate to about:config and change ui.context_menus.after_mouseup to true.\n\nSee [22]\n\n"
    },
    {
      "title": "Firefox window does not repaint after disabling or enabling compositing",
      "level": 3,
      "content": "Unset the environment variable MOZ_X11_EGL.\n\nRelated bug report: Bugzilla 1711039.\n\n"
    },
    {
      "title": "Firefox continuously asks to be set as default browser upon launch",
      "level": 3,
      "content": "There are a couple things you can try: if you are using a desktop environment, check if Firefox is set as the default browser in your system settings. If it is not, then set it, otherwise you can run the following xdg-settings(1) command, provided by the xdg-utils package, to query which browser is set as default on your system:\n\n```\n$ xdg-settings get default-web-browser\n```\n\nIf no value is returned or it is not Firefox, then run this command to set it:\n\n```\n$ xdg-settings set default-web-browser firefox.desktop\n```\n\nIf Firefox still asks to be set as the default browser, then it may be quieted if it is set to handle http and https URL schemes. To do so, run these xdg-mime(1) commands:\n\n```\n$ xdg-mime default firefox.desktop x-scheme-handler/http\n$ xdg-mime default firefox.desktop x-scheme-handler/https\n```\n\nIf those do not work either, check if you have set the environment variable GTK_USE_PORTAL (all values trigger the bug), in which case, unset it. Related bug report: Bugzilla 1516290. If that does not work or you did not set it, navigate Firefox to about:config, check if the variable widget.use-xdg-desktop-portal is set to true and, if so, set it to false.\n\nIf you wish to disable default browser check entirely, navigate Firefox to about:config and set browser.shell.checkDefaultBrowser to false.\n\n"
    },
    {
      "title": "Video stuttering",
      "level": 3,
      "content": "If you experience video stuttering and you notice that Firefox is only hitting one core at 100% when watching videos (especially higher resolution videos), this might help you.\n\nGo into about:config and search for dom.ipc.processCount and change dom.ipc.processCount.file from 1 to a higher number. An ad hoc method to find a good number is to increase it one at a time until you get good results, but 4 seems to be a good value.\n\n"
    },
    {
      "title": "Bengali font broken in some pages",
      "level": 3,
      "content": "In most cases, installing the noto-fonts and making Noto Sans Bengali as defaults in Fonts and Colors settings solves it. However, in some social media sites, Bengali fonts may still be broken. In those cases, Mozilla provides a detailed guide on how to see all the fonts gets loaded in a page. By using Page Inspector, find out all the fonts that are being loaded on that particular page. Removing fonts other than Noto Sans from the system will resolve the issue permanently.\n\nThere will be some fonts that have been installed as dependency of other package. For example, chromium installs ttf-liberation as dependency, which loads itself in some Firefox pages automatically and breaks Bengali fonts on those pages. To solve this issue, use the following rule in your font configuration:\n\n```\n$XDG_CONFIG_HOME/fontconfig/fonts.conf\n```\n\n```\n<match target=\"pattern\">\n <test qual=\"any\" name=\"family\"><string>Liberation</string></test>\n <edit mode=\"assign\" name=\"family\" binding=\"same\"><string>Noto Sans Bengali</string></edit>\n</match>\n```\n\n"
    },
    {
      "title": "Web Speech API has no voices",
      "level": 3,
      "content": "Firefox uses for text to speech (tts) speechd. You can use the command spd-say \"some test sentence\" to test if it reads the text or spd-say -L to get a list of the voices. If there are no voices, too, you can install some with the package espeak-ng. If they do not work out of the box, you maybe have to configure them. You can use the spd-conf command or edit the config file .config/speech-dispatcher/speechd.conf. There should be the following lines active (without # in front of it):\n\n```\nAddModule \"espeak-ng\"                \"sd_espeak-ng\" \"espeak-ng.conf\"\nDefaultModule espeak-ng\n```\n\n"
    },
    {
      "title": "Enable Speech Synthesis",
      "level": 4,
      "content": "Per https://developer.mozilla.org/en-US/docs/Web/API/Web_Speech_API/Using_the_Web_Speech_API, speech synthesis must be enabled (it is enabled by default). To enable, set media.webspeech.synth.enabled to true in about:config.\n\n"
    },
    {
      "title": "Disable Fingerprinting Protection",
      "level": 4,
      "content": "Per https://support.mozilla.org/en-US/kb/firefox-protection-against-fingerprinting, Fingerprinting Protection disables the WebSpeech API. If you enabled this option, you will need to disable it for the narrator to work. To disable fingerprinting protection, set privacy.resistFingerprinting to false in about:config.\n\n"
    },
    {
      "title": "Disable filter voices",
      "level": 4,
      "content": "If you do not see the narrator icon, try setting narrate.filter-voices to false in about:config.\n\nThis can be used to check whether speech-dispatcher works at all. If it helps, you may miss voices for the language of the article opened in reader mode (check spd-say -L). If you have voices for the reader article language installed, there may be some incorrect settings or defaults related to speech-dispatcher configuration.\n\n"
    },
    {
      "title": "File dialogs do not open when downloading files",
      "level": 3,
      "content": "If no file chooser is shown when downloading files, even with the option \"Always ask where to save files\" enabled in Firefox's settings, then you might not have both xdg-desktop-portal and a suitable implementation. Desktop environments usually provide an implementation, but if you are using a standalone window manager such as i3, then you may need to manually install one. Install xdg-desktop-portal and for example xdg-desktop-portal-gtk.\n\n"
    },
    {
      "title": "Notifications are not floating in tiling window managers or Wayland compositors",
      "level": 3,
      "content": "If you're using a tiling window manager or Wayland compositor, and the HTML notifications appear as normal Firefox windows instead of floating pop-ups, you need to install libnotify and make sure you have a working Desktop notifications server, such as mako.\n\n"
    },
    {
      "title": "DNIe certificate is not picked up after renewal from the card reader",
      "level": 3,
      "content": "After renewing the certificate in the card (Spanish DNIe) Firefox continues to use the previous certificate, allows to login but won't authenticate the users on any service. You need to clear the card cache\n\n```\n$ pkcs15-tool --clear-cache\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official website\n- Mozilla Foundation\n- MozillaWiki:Firefox\n- Wikipedia:Mozilla Firefox\n- Firefox Add-ons\n- Firefox themes\n- Mozilla's FTP\n- mozillaZine unofficial forums\n\n"
    }
  ]
}