{
  "title": "Music Player Daemon/Troubleshooting",
  "url": "https://wiki.archlinux.org/title/Music_Player_Daemon/Troubleshooting",
  "sections": [
    {
      "title": "Autodetection failed",
      "level": 3,
      "content": "During the start of MPD, it tries to auto detect your set-up and configure output and volume control accordingly. Though this mostly goes well, it will fail for some systems. It may help to tell MPD specifically what to use as output and mixer control. If you copied /etc/mpd.conf over from /etc/mpd.conf.example as mentioned above, you can simply uncomment:\n\nExample for alsa output type and ALSA mixer:\n\n```\naudio_output {\n\ttype\t\t\t\"alsa\"\n\tname\t\t\t\"My ALSA Device\"\n\tdevice\t\t\t\"hw:0,0\"\t# optional\n\tformat\t\t\t\"44100:16:2\"\t# optional\n\tmixer_type\t\t\"hardware\"\n\tmixer_device\t\t\"default\"\n\tmixer_control\t\t\"PCM\"\n}\n```\n\n```\n# chsh -s /bin/true mpd\n```\n\n"
    },
    {
      "title": "MPD hangs on first startup",
      "level": 3,
      "content": "This is a common error that's caused by corrupt mp3 tags. Here is an experimental way to solve this issue. Requirements:\n\n- kid3\n- easytag\n\nThis method is very tedious, especially with a huge database. Just as a baseline it took 2.5h to fix a 16GB database.\n\n"
    },
    {
      "title": "EasyTAG",
      "level": 4,
      "content": "The purpose of easytag here is that easytag detects the error in the tags, but like MPD it hangs and dies. The trick here is that easy tags actually tells you what file is causing the problem on the status bar. Before starting easytag make sure to have a terminal close to be ready to kill easy tag to avoid a hang. Once you are ready, on the tree view select the directory where all your music is located. By default easytag starts to search all subdirectories for mp3 files. Once you notice that easytag stopped scanning for songs, make note of the culprit and kill easytag.\n\n"
    },
    {
      "title": "Kid3",
      "level": 4,
      "content": "Here is where kid3 comes in handy. With kid3 go to the offending song and rewrite one of the tags. then save the file. This should force kid3 to rewrite the whole tag again fixing the problem with MPD and easy tag hanging.\n\nRepeat this procedure until your music library is done.\n\n"
    },
    {
      "title": "Cannot connect to mpd: host \"localhost\" not found: Temporary failure in name resolution",
      "level": 3,
      "content": "Cannot connect to MPD (with ncmpcpp), if you are disconnected from network. Solution is disable IPv6 or add line to /etc/hosts\n\n```\n::1 localhost.localdomain localhost\n```\n\n"
    },
    {
      "title": "Other issues when attempting to connect to mpd with a client",
      "level": 3,
      "content": "Some have reported being unable to access mpd with various clients, for example seeing errors like these:\n\n```\n$ ncmpcpp\nCannot connect to mpd: Connection closed by the server\n$ sonata\n2011-02-13 18:33:05  Connection lost while reading MPD hello\n2011-02-13 18:33:05  Not connected\n2011-02-13 18:33:05  Not connected\n```\n\nPlease see posts on ncmpcpp on the Arch Forums HERE and HERE. Also see FS#22071.\n\n"
    },
    {
      "title": "First fix",
      "level": 4,
      "content": "Check mpd.conf for a line like mpd.error and remove it. The mpd error file is deprecated and has been removed.\n\n"
    },
    {
      "title": "Second fix",
      "level": 4,
      "content": "If that does not help, add the following to mpd.conf:\n\n```\nbind_to_address \"127.0.0.1\"\n port \"6600\"\n```\n\nAfterwards, instruct your client to connect via 127.0.0.1. For example, add the following to the ncmpcpp configuration file:\n\n```\nmpd_host \"127.0.0.1\"\n mpd_port \"6600\"\n```\n\n"
    },
    {
      "title": "Binding to IPV6 before IPV4",
      "level": 3,
      "content": "If on startup, mpd displays the following message:\n\n```\nlisten: bind to '0.0.0.0:6600' failed: Address already in use (continuing anyway, because binding to '[::]:6600' succeeded)\n```\n\nit means mpd binds to the ipv6 interface before binding to ipv4. If you want to use your ipv4 interface, hardcode it in mpd.conf, like:\n\n```\nbind_to_address \"0.0.0.0\"\n```\n\nSeveral binds can also be specified, for example, to have mpd listen both to localhost and to the external IP of your network card:\n\n```\nbind_to_address \"127.0.0.1\"\nbind_to_address \"192.168.1.13\"\n```\n\n"
    },
    {
      "title": "daemon: cannot setgid for user \"mpd\": Operation not permitted",
      "level": 3,
      "content": "The error is stating that the user starting the process does not have permissions to become another user (mpd) which the configuration has told the process to run as.\n\nTo solve the issue, simply start mpd.service as the root user instead of starting a user unit.\n\n"
    },
    {
      "title": "daemon: fatal_error: Failed to set group NN: Operation not permitted",
      "level": 3,
      "content": "The error is stating that mpd cannot set the group. This is if you have set any other group in /etc/mpd.conf than the default: mpd. This is because of the default mpd.service file. It starts mpd as user mpd (and if no group specified with the default group of this user as stated in your /etc/passwd) and therefore mpd does not have any rights to change its group.\n\n"
    },
    {
      "title": "First fix",
      "level": 4,
      "content": "In /etc/mpd.conf comment out the group= part or change it to group=mpd\n\n"
    },
    {
      "title": "Second fix",
      "level": 4,
      "content": "Extend the unit mpd.service and add your desired group. E.g. run mpd with the group \"audio\":\n\n```\n/etc/systemd/system/mpd.service.d/group.conf\n```\n\n```\n[Service]\nGroup=audio\n```\n\n"
    },
    {
      "title": "Third fix",
      "level": 4,
      "content": "Change the default group of the user mpd in your /etc/passwd.\n\n"
    },
    {
      "title": "MPD & ALSA",
      "level": 3,
      "content": "Sometimes, when using other audio outputs, e.g: some web pages containing Flash applets, MPD is rendered unable to play (until it is restarted). The error comes up in mpd's log:\n\n```\nError opening alsa device \"hw:0,0\": Device or resource busy\n```\n\nReasons for this may be:\n\n- The sound card does not support hardware mixing (uses dmix plugin)\n- An application does not work with ALSA's default settings\n\nFor a detailed description, it is recommended to take a look at this link.\n\nThis problem may be solved by adding the following lines to mpd.conf:\n\n```\nmpd.conf\n```\n\n```\naudio_output {\n        type                    \"alsa\"\n        name                    \"Sound Card\"\n        options                 \"dev=dmixer\"\n        device                  \"plug:dmix\"\n}\n```\n\nTo make the changes have effect, restart mpd.service.\n\n"
    },
    {
      "title": "High CPU usage with ALSA",
      "level": 4,
      "content": "When using MPD with ALSA, users may experience MPD taking up lots of CPU (around 20-30%). This is caused by most sound cards supporting 48kHz and most music being 44.1kHz, thus forcing MPD to resample it. This operation takes lots of CPU cycles and results into high usage.\n\nFor most users the problem should be solved by telling MPD not to use resampling by adding auto_resample \"no\" into audio_output-part of /etc/mpd.conf.\n\n```\nmpd.conf\n```\n\n```\naudio_output {\n   type\t\t\t\"alsa\"\n   name\t\t\t\"My ALSA Device\"\n   auto_resample\t\"no\"\n}\n```\n\nAlthough it may not give as drastic a speedup, enabling mmap may still speed things up:\n\n```\nmpd.conf\n```\n\n```\naudio_output {\n   type\t\t\t\"alsa\"\n   name\t\t\t\"My ALSA Device\"\n   use_mmap\t\t\"yes\"\n}\n```\n\nSome users might also want to tell dmix to use 44kHz as well. More info about tuning performance of your MPD can be found on the MPD wiki\n\n"
    },
    {
      "title": "Playing audio files with different rate (works for EMU 0202/0204/0404)",
      "level": 4,
      "content": "To play audio files of different rate with automatic card rate change install pulseaudio and pulseaudio-alsa and keep using ALSA as output:\n\n```\nmpd.conf\n```\n\n```\naudio_output {\n    type          \"alsa\"\n    name          \"Emu 0202 USB\"\n    device        \"hw:2,0\"\n}\n```\n\n"
    },
    {
      "title": "Changing user",
      "level": 3,
      "content": "Changing the group that MPD runs as may result in errors like:\n\n```\noutput: Failed to open \"My ALSA Device\"\n```\n\n```\n[alsa]: Failed to open ALSA device \"default\": No such file or directory\n```\n\nor\n\n```\nplayer_thread: problems opening audio device while playing \"Song Name.mp3\"\n```\n\nThis is because the MPD users need to be part of the audio group to access sound devices under /dev/snd/. To fix it add user make the MPD user part of the audio group:\n\n```\n# gpasswd -a 'mpd' audio\n```\n\n"
    },
    {
      "title": "MPD includes music from hidden folders in database",
      "level": 3,
      "content": "MPD includes hidden folders in its database such as repetitive backups of music made by syncthing such as .stfolder. To correct for this, create a .mpdignore file in the same directory with a list of folders or files to ignore on each line as per the mpd documentation.\n\n"
    }
  ]
}