{
  "title": "Mutualism Arch",
  "url": "https://wiki.archlinux.org/title/Mutualism_Arch",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ArchWiki:Contributing\n- Frequently asked questions\n\nIn evolutionary biology, cooperation describes interactions where an individual pays a small cost to yield a larger benefit to one or more others. If this costly contribution is reciprocated, everyone involved can benefit tremendously. This principle also applies to proactive members of the Arch community wanting to get involved and contribute to their favorite Linux distribution. Their participation benefits not only the community member and their fellow Archers, but all users of free and open source software.\n\nThis article describes how both new and experienced Arch users can contribute to the community. Note that this is not an exhaustive list. Before contributing, please get accustomed with the Code of conduct.\n\n"
    },
    {
      "title": "Post on the forums",
      "level": 3,
      "content": "One of the easiest ways to get involved is participating in the Arch Linux Forums, which allows getting to know the community and help new users.\n\n"
    },
    {
      "title": "Improve this wiki",
      "level": 3,
      "content": "ArchWiki is a collaboratively maintained Arch Linux documentation. All users are encouraged to contribute.\n\n"
    },
    {
      "title": "Join the chatroom",
      "level": 3,
      "content": "You can help other users solve problems on the Arch IRC channels. It is of vital importance however, that you read the channel rules before participating. Further channels are available for specific topics.\n\n"
    },
    {
      "title": "Join the mailing lists",
      "level": 3,
      "content": "Join the discussion on one or more of the public mailing lists. Make sure to stay on topic as provided in the list description.\n\n"
    },
    {
      "title": "Artwork",
      "level": 3,
      "content": "Feel free to share wallpapers, splash screens, color palettes, widgets, themes, etc. with the community on the art subforum.\n\nSee also Arch Linux Art and Artwork.\n\n"
    },
    {
      "title": "Report installed packages",
      "level": 3,
      "content": "pkgstats provides a systemd timer that sends a list of the packages installed on your system, along with the architecture and the mirrors you use, to the Arch Linux developers in order to help them prioritize their efforts and make the distribution even better. The information is sent anonymously and cannot be used to identify you. You can view the collected data at the Statistics page. More information is available in this forum thread.\n\n"
    },
    {
      "title": "Fix and report bugs",
      "level": 3,
      "content": "Reporting and fixing bugs for Arch packages on GitLab is one of the possible ways to help the community.\n\nHowever, ineffective use can be counter-productive. Please read the Bug reporting guidelines and General guidelines#Packaging merge requests.\n\n"
    },
    {
      "title": "Inform about security issues",
      "level": 3,
      "content": "New vulnerabilities are found all the time. Help the Arch Security Team keep track of new vulnerabilities.\n\n"
    },
    {
      "title": "Help test packages",
      "level": 3,
      "content": "Packages on the testing repositories need to be tried out and signed off before they are promoted to the main repositories. Help the Arch Testing Team test new packages.\n\n"
    },
    {
      "title": "Request features",
      "level": 3,
      "content": "Request features for Arch packages on GitLab. Before doing so, read Bug reporting guidelines#Bug or feature?, to make sure it is a valid feature request, and General guidelines#Packaging merge requests.\n\nRequest features for AUR packages on the corresponding AUR package pages.\n\n"
    },
    {
      "title": "Create and adopt AUR packages",
      "level": 3,
      "content": "The Arch User Repository contains community-made package scripts, allowing users to easily install software not part of the official repositories. Popular packages get included into the extra repository.\n\n"
    },
    {
      "title": "Becoming a Package Maintainer",
      "level": 3,
      "content": "If you want to help maintain the AUR and packages in the extra repository, you can apply to become a Package Maintainer. See Package Maintainers#How do I become a Package Maintainer? for details.\n\n"
    },
    {
      "title": "Events",
      "level": 2,
      "content": "There are regular events open to the community for bugfixing, cleanup, and other activities.\n\n- AUR Cleanup Day\n- Bug Day\n\n"
    },
    {
      "title": "Software projects",
      "level": 2,
      "content": "The Arch Linux distribution comprises of many components and each of the projects can be contributed to individually.\n\nDiscussion around the various projects (unless noted otherwise) takes place on the arch-projects mailing list and in the #archlinux-projects IRC channel on the Libera Chat network.\n\nTable content:\nProject | Description | Languages | Maintainers | Additional links\nalpm | Project that works on specifications, Rust libraries and tools for Arch Linux Package Management | Rust | dvzrv, orhun | bugs, documentation, IRC irc.oftc.net#alpm\nalpm.rs | Rust bindings for libalpm | Rust | Morganamilo | bugs\narch-boxes | Virtual machine images | Bash | klausenbusk | bugs, IRC #archlinux-releng, arch-releng mailing list\narch-install-scripts | Useful scripts for installing Arch Linux | Bash | Foxboron | bugs\narch-rebuild-order | A CLI tool to determine the rebuild order of provided package(s) | Rust | jelle | bugs\narch-release-promotion | Promotion and synchronization of existing releases of a project in Arch Linux's GitLab instance | Python | dvzrv | bugs\narch-repro-status | CLI tool for querying the reproducibility status of the Arch Linux packages | Rust | orhun | bugs\narch-security-tracker | The security.archlinux.org CVE tracking platform and aids in publishing advisories | Python (Flask) | anthraxx | bugs, IRC #archlinux-security, Advisory mailing list\narch-signoff | Sign off Arch Linux test packages | Python | Jelle | bugs\narchinstall | Arch Linux official installer | Python | Torxed | bugs, Discord, documentation\narchivetools | A turnkey solution to snapshot Arch Linux packages repositories, ISOs images and bootstrap tarballs | Bash |  | bugs\narchiso | Scripts and configuration for building live media | bash | dvzrv, nl6720 | bugs, IRC #archlinux-releng, arch-releng mailing list\narchlinux-common-style | Arch Linux common CSS styles | SCSS, HTML, JavaScript | anthraxx, jelle | bugs\narchlinux-docker | Docker images | Bash | hashworks, sangy | bugs, docker hub, IRC #archlinux-releng, arch-releng mailing list\narchlinux-keyring | Arch Linux PGP keyring handling | Python | anthraxx, dvzrv | bugs\narchlinux-repro | Tools to rebuild Arch Linux packages | Python | Foxboron, Jelle, Coderobe | bugs\narchlinux-wsl | WSL images | Bash | Antiz | bugs, Arch Wiki, IRC #archlinux-releng, arch-releng mailing list\narchmanweb | The man.archlinux.org website | Python (Django) | Lahwaacz | bugs\narchweb | The archlinux.org website | Python (Django) | jelle | bugs\naurweb | The page and system for aur.archlinux.org | Python, HTML, MySQL | artafinde, lfleischer | bugs, IRC #archlinux-aurweb, aur-dev mailing list\nbugbuddy | Helper daemon that watches the incoming bug reports for Arch Linux and makes sure that the right people are assigned to them | Rust | anthraxx | bugs\nbuildbtw | A service for assisting Arch Linux staff with building new versions of packages | Rust | anthraxx, sven, raffomania | bugs, IRC #archlinux-buildbtw\ndbscripts | Scripts to release and manage packages into the repositories | Bash | Foxboron | bugs\ndevtools | Packaging tools for developers and packagers | Bash | Anthraxx, Foxboron, jelle, gromit | bugs\ngitlab-exporter | GitLab metrics exporter | Rust | Artafinde, orhun | bugs\ngluebuddy | A secure helper daemon that watches several aspects of the Arch Linux infrastructure and makes sure that certain conditions are met | Rust | anthraxx, jelle | bugs\ninfrastructure | Arch Linux infrastructure | Ansible, Bash, Python, Packer, Terraform, Zsh | anthraxx, foutrelis, freswa, heftig, jelle, klausenbusk, svenstaro, artafinde, gromit | bugs, IRC #archlinux-devops, arch-devops mailing list\nkeycloak-archlinux-theme | Keycloak Arch Linux theme | Java | Artafinde | bugs\nmkinitcpio | Initrd generator | Ash, Bash | Foxboron | bugs\nmkinitcpio-archiso | Mkinitcpio integration for archiso | Ash, Bash | dvzrv, nl6720 | bugs, IRC #archlinux-releng, arch-releng mailing list\nnamcap | Tool for checking binary packages and source PKGBUILDs for common packaging errors | Python | alerque, dvzrv, FFY00, kgizdov | bugs\nnetctl | Profile based systemd network management | Bash | jwitteveen | bugs\nneoasknot | Contribution landing page for Arch Linux | JavaScript, Svelte | polyzen | bugs, whatcanidofor.archlinux.org\npacman | Package Manager | Bash, C | Allan, agregory | bugs, IRC #archlinux-pacman, pacman-dev mailing list\npacman-contrib | Contribution scripts to pacman | Bash, C, Perl | Demize, Polyzen | bugs, IRC #pacman-contrib, pacman-contrib mailing list\npkgstats-cli | pkgstats client | Go | pierres | bugs, pkgstats.archlinux.de\npkgstats.archlinux.de | Arch Linux package statistics website | JavaScript, PHP, Vue | pierres | bugs, pkgstats.archlinux.de\npyalpm | alpm Python bindings | Python, C | Jelle | bugs\npytest-pacman | Pytest plugin for generating repository sync databases | Python | Jelle | bugs\nrebuilderd-website | Website for reproducible.archlinux.org | JavaScript | Jelle | bugs, reproducible-builds.org, Debian wiki, IRC #archlinux-reproducible\nreleng | Automation of release artifacts (installation medium, PXE boot) | Bash, Python | dvzrv | bugs, IRC #archlinux-releng, arch-releng mailing list\nrepod | Tooling to maintain binary package repositories for Linux distributions using the pacman package manager | Python | dvzrv | bugs, documentation\nsignstar | A secure enclave signing solution and tooling around it | Rust | dvzrv | bugs, documentation, IRC #archlinux-signstar\n\n"
    },
    {
      "title": "Donate money",
      "level": 2,
      "content": "You can find out how to help sustaining server costs on the official Arch Linux donate page.\n\n"
    },
    {
      "title": "Unofficial projects",
      "level": 2,
      "content": "Note: **not** \n\nArch's community maintains many projects. Feel free to include yours!\n\n"
    },
    {
      "title": "Groups",
      "level": 3,
      "content": "Arch-specific groups that you can engage in.\n\n"
    },
    {
      "title": "Software",
      "level": 3,
      "content": "Community-developed software that focuses on Arch Linux.\n\n"
    },
    {
      "title": "Becoming an Arch Developer",
      "level": 2,
      "content": "The main motivation for your work on Arch should be helping the whole community, and not simply trying to become an Arch developer by any means.\n\nUsually, new developers are picked by the existing developers as the workload increases. Sometimes they post a position and you can apply to fill it, but more often, they just invite somebody they know would be good at it and would fit in well with the rest of the team. Having a portfolio of Arch contributions is the best way to make it on the team.\n\nHere is a list of things that you may do in order to gain some \"popularity\" towards Arch's developers:\n\n- Establish a reputation as being helpful by offering assistance whenever possible.\n- Answer questions on the forum, IRC, and mailing lists.\n- Join the Package Maintainers to gain packaging experience to show your skills.\n- Submit packages to the AUR.\n- Join one of the offshoot projects that may be incorporated into Arch mainstream someday, or start your own.\n- Work on pacman, makepkg or other project (on GitLab) and submit patches to the bug tracker.\n- Traverse the bug tracker and fix existing bugs.\n- Find and submit new bugs.\n- Fix wiki errors, add new pages, clean up existing pages and make sure the procedures are up-to-date.\n- Submit translations.\n\n"
    }
  ]
}