{
  "title": "Nmap",
  "url": "https://wiki.archlinux.org/title/Nmap",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nFrom the official website:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the nmap package.\n\nNmap has a GUI called zenmapAUR that can be installed separately, but this article will cover only command-line usage.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "See nmap(1).\n\n"
    },
    {
      "title": "Specifying the target",
      "level": 3,
      "content": "There are a number of ways to tell Nmap the list of IP addresses to scan. The simplest form is to just pass the address or domain name:\n\n```\n$ nmap scanme.nmap.org\n$ nmap 74.207.244.221\n```\n\n"
    },
    {
      "title": "Specifying multiple targets",
      "level": 4,
      "content": "Using CIDR notation, for example to scan all 256 addresses beginning with 10.1.1:\n\n```\n$ nmap 10.1.1.0/24\n```\n\nUsing the dash, for example to scan 10.1.50.1, 10.1.51.1 and 10.1.52.1:\n\n```\n$ nmap 10.1.50-52.1\n```\n\nUsing commas (does what you expect):\n\n```\n$ nmap 10.1.50,51,52,57,59.1\n```\n\nAll combined:\n\n```\n$ nmap 10.1,2.50-52.1/30 10.1.1.1 10.1.1.2\n```\n\n"
    },
    {
      "title": "List scan",
      "level": 3,
      "content": "The list scan option (-sL) is useful for making sure that correct addresses are specified before doing the real scan:\n\n```\n$ nmap -sL 10.1,2.50-52.1/30 10.1.1.1 10.1.1.2\n```\n\nList scan simply prints the specified addresses without sending a single packet to the target.\n\n"
    },
    {
      "title": "Default options",
      "level": 3,
      "content": "If you specify only an IP address or domain name and no other options:\n\n```\n$ nmap 74.207.244.221\n```\n\nNmap will do the following:\n\n1. The IP address is reverse-DNS resolved to domain name, or vice-versa in case a domain name is specified (to disable, pass -n)\n1. Ping scanning using TCP ACK:80 and ICMP. This is equivalent to -PA -PE (to disable, pass -PN)\n1. Scans the host(s)'s top 1000 most popular ports. When running as root, SYN stealth scan is used. When running as user, connect scan is used.\n\n"
    },
    {
      "title": "Ping scan",
      "level": 2,
      "content": "Ping scanning (host discovery) is a technique for determining whether the specified computers are up and running. Nmap performs ping scan by default before port scan to avoid wasting time on hosts that are not even connected. To instruct Nmap to only perform ping scan:\n\n```\n$ nmap -sn 10.1.1.1/8\n```\n\nThis will cause Nmap to ping every one of the specified addresses and then report the list of hosts which did respond to the ping.\n\nNmap uses different kinds of ping packets when run with user or root privileges and when scanning the same or different subnets:\n\nTable content:\n | External IP | Local IP\nUser privileges | TCP SYN at ports 80 & 443 | TCP SYN at ports 80 & 443 and ARP\nRoot privileges | TCP SYN at ports 80 & 443 and IGMP | ARP\n\n"
    },
    {
      "title": "Ping scan types",
      "level": 3,
      "content": "Table content:\nOption | Ping scan type\n-Pn | Disable ping scan entirely\n-PS | TCP SYN (default at port 80)\n-PA | TCP ACK (default at port 80)\n-PU | UDP\n-PY | SCTP INIT\n-PE | ICMP Echo\n-PP | ICMP timestamp\n-PM | ICMP address mask\n-PO | Other IP protocol\n-PR | ARP scan\n\n-Pn is useful when the machine is heavily firewalled, TCP 80 and 443 ports and IGMP requests are blocked, but the IP address might still have a machine listening on other less common ports.\n\n"
    },
    {
      "title": "Port scan",
      "level": 2,
      "content": "There are 3 main states a port can be in:\n\n- open - there is a program listening and responding to requests on this port\n- closed - the host replies with an \"error: no program listening on this port\" reply to requests to this port\n- filtered - the host doesn't reply at all. This can be due to restrictive firewall rules, which \"drop\" a packet without sending a reply\n\nIn addition to these there are 3 more states that Nmap can classify a port. These are used when Nmap cannot reliably determine the state but suspects two of the three possible states:\n\n- open|closed (unfiltered) - the port is either open or closed\n- closed|filtered - the port is either closed or filtered\n- open|filtered - the port is either open or filtered\n\nBy default Nmap scans the 1000 most popular ports found in /usr/share/nmap/nmap-services. To specify a different number of common ports:\n\n```\n$ nmap --top-ports 1000 10.1.1.1\n```\n\nTo specify custom port numbers, use -p:\n\n```\n$ nmap -p -25,135-137 10.1.1.1\n```\n\nDashes and commas work just like in #Specifying the target. In addition, it is possible to specify all ports before/after given one by skipping the starting/ending port when using a dash. For example to scan all possible 65535 ports (except port number 0):\n\n```\n$ nmap -p -\n```\n\n"
    },
    {
      "title": "Scan types",
      "level": 3,
      "content": "Table content:\nOption | Port scan type\n-sP | Ping scan only\n-sS | TCP SYN (stealth) (Default as root)\n-sT | TCP connect (Default as user)\n-sA | TCP ACK\n-sF | TCP FIN\n-sX | TCP FIN, SYN, ACK\n-sW | TCP window\n-sM | TCP Maimon\n-sU | UDP scan\n-sI | Idle scan\n-b | FTP bounce scan\n-sO | Other IP protocol\n\n"
    },
    {
      "title": "iptables PSD module",
      "level": 3,
      "content": "PSD is an extension module of iptables. It is used on some linux-based commercial routers as well.\n\nIt has 4 parameters:\n\n- --psd-weight-threshold threshold, default value: 21\n\n- --psd-delay-threshold delay, default value: 300 (3 seconds)\n\n- --psd-lo-ports-weight weight, default value: 3\n\n- --psd-hi-ports-weight weight, default value: 1\n\nThe principle behind PSD is simple. If requests from a single IP have gained a value more than threshold in delay seconds, then the IP is classified as a port scanner. In a math expression:\n\n```\nlo_ports_weight * REQUESTS_LOW + hi_ports_weight * REQUESTS_HIGH >= threshold\n```\n\nwhere\n\n```\nREQUESTS_LOW = number of requests to privileged (0 to 1023) ports within last delay seconds\nREQUESTS_HI = number of requests to non-privileged (1024 to 65535) ports within last delay seconds\n```\n\nHere are some examples:\n\n- With default parameters, if at least 7 privileged ports are hit within 3 seconds, it is classified as a port scan.\n- With default parameters, if at least 21 non-privileged ports are hit withing 3 seconds, it is classified as a port scan.\n- With default parameters, if 4 privileged ports and 9 non-privileged ports are hit within 3 seconds, it is classified as a port scan, because 4*3 + 9*1 >= 21.\n\n"
    },
    {
      "title": "Avoiding detection",
      "level": 3,
      "content": "One of the simplest ways to avoid PSD is to simply scan slowly. For default values this parameter would suffice:\n\n```\n$ nmap --scan-delay 3.1 192.168.56.1\n```\n\nAnother interesing fact about PSD is that it does not detect a request as a port scan when the ack or rst flags are set (See the function is_portscan in xt_psd.c)\n\nAlso, if you are port scanning a host and the latter has an HTTP(S) service running on it, nmap will use Mozilla/5.0 (compatible; Nmap Scripting Engine; https://nmap.org/book/nse.html) as default user agent. Your action will thus be easily detected, especially if an administrator or a robot are taking measures if such an user agent appears in the logs. Hopefully, nmap allows us to change that string easily: just pass -script-args http.useragent=\"user agent you want\". Source\n\n"
    },
    {
      "title": "Limiting scan speed",
      "level": 3,
      "content": "Nmap scans are fast. While this is often a desirable feature, it can be counter-productive as well. For example when you want to test your system's firewall without disabling any activated flood detection rules, or when you want to run a long-term test for a specific port/service. The following options specify how fast Nmap sends packets.\n\nTo send a packet at most every 3.333 seconds:\n\n```\n$ nmap --max-rate 0.3 192.168.56.1\n```\n\nAlternatively, to send a packet every 3.1 seconds:\n\n```\n$ nmap --scan-delay 3.1 192.168.56.1\n```\n\nFor other timing and parallelization options, see nmap(1).\n\n"
    },
    {
      "title": "Specify targets input from a list file",
      "level": 3,
      "content": "Often it is necessary to scan a large number of non-adjacent addresses. Passing them on the command line is usually not convenient. For this reason Nmap supports input from a list file (-iL):\n\n```\naddresses.txt\n```\n\n```\n10.1.1.1 10.1.1.2 10.1.1-10.3\n10.3.1.3 10.3.1.50 10.3.2.55\n10.1.1.100\n...\n```\n\n```\n$ nmap -iL addresses.txt\n```\n\nAddresses in the file must be separated with a whitespace.\n\nAlternatively, Nmap can read the list from standard input (the - means standard input in many command-line programs):\n\n```\n$ echo \"10.1.1.1 10.1.1.2 10.1.1-10.3\" | nmap -iL -\n```\n\n"
    },
    {
      "title": "Specify targets to exclude from scan",
      "level": 3,
      "content": "```\n$ nmap 10.1.1.1-10 --exclude 10.1.1.5,7\n```\n\nThe same from a file:\n\n```\n$ nmap 10.1.1.1-10 --excludefile excludeaddr.txt\n```\n\n"
    },
    {
      "title": "Spoofing",
      "level": 3,
      "content": "To spoof source IP:\n\n```\n$ nmap -S 192.168.56.35 -e vboxnet0 192.168.56.11\n```\n\nTo spoof the source MAC address:\n\n```\n$ nmap --spoof-mac 01:02:03:04:05:06 192.168.56.11\n```\n\nTo spoof source port:\n\n```\n$ nmap --source-port 22 192.168.56.11\n```\n\n"
    },
    {
      "title": "Speeding up the scan",
      "level": 3,
      "content": "By default, Nmap performs DNS/reverse-DNS resolution on targets. To tell Nmap never do any DNS resolution, pass the -n option:\n\n```\n$ nmap -n 192.168.56.0/24\n```\n\nThis will speed the scan about 2 times.\n\n"
    },
    {
      "title": "Scan port number 0",
      "level": 3,
      "content": "By default port 0 is skipped from scans, even if -p - is specified. To scan it, it must be explicitly specified. For example to scan every possible port:\n\n```\n$ nmap -p 0-65535\n```\n\nRemember that this port number is invalid in RFC standards. However it can be used by malware and the like to avoid more naive port scanners.\n\n"
    },
    {
      "title": "File output formats",
      "level": 3,
      "content": "Nmap has built-in support for for file output alongside with terminal output:\n\n- -oN filename\n\n- -oX filename\n\n- -oG filename\n\n- -oA basefilename\n\nFor example to output to the terminal, to file and to XML file:\n\n```\n$ nmap -oN output.txt -oX output.xml scanme.nmap.org\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:Nmap\n- Official website\n- Nmap Network Scanning book\n\n"
    }
  ]
}