{
  "title": "Nodejs",
  "url": "https://wiki.archlinux.org/title/Nodejs",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nNode.js is a JavaScript runtime environment combined with useful libraries. Node.js uses Google V8 engine to execute code outside of the web browser. Due to its event-driven, non-blocking I/O model, it is suitable for real-time web applications.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the nodejs package. There are long-term support (LTS) releases, too:\n\n- nodejs-lts-jod—version 22.x\n- nodejs-lts-iron—version 20.x\n\n"
    },
    {
      "title": "Node Version Manager",
      "level": 3,
      "content": "It is not uncommon to need or desire to work in different versions of Node.js. A preferred method among Node.js users is to use Node Version Manager (nvm), which allows for cheap and easy alternative installs. You can set nvm up by adding this to your Command-line shell#Configuration files:\n\n```\n. /usr/share/nvm/init-nvm.sh\n```\n\nUsage is well documented on the project's GitHub but is as simple as:\n\n```\n$ nvm install 8.0\nDownloading and installing node v8.0.0...\n[..]\n\n$ nvm use 8.0\nNow using node v8.0.0 (npm v5.0.0)\n```\n\nIf you want to run nvm use automatically every time there is a .nvmrc file on the directory, add this in shell initialization files.\n\n"
    },
    {
      "title": "Node Packaged Modules",
      "level": 2,
      "content": "npm is the official package manager for Node.js. It can be installed with the npm package.\n\n"
    },
    {
      "title": "Installing packages",
      "level": 4,
      "content": "Note: **This article or section is being considered for removal.** This article or section is being considered for removal.\n\nThis article or section is being considered for removal.\n\nAny package can be installed using:\n\n```\n$ npm install packageName\n```\n\nThis command installs the package in the current directory under node_modules and executables under node_modules/.bin.\n\nFor a system-wide installation global switch -g can be used:\n\n```\n# npm -g install packageName\n```\n\nBy default this command installs the package under /usr/lib/node_modules/npm and requires root privileges to do so. (If using a secure umask like umask 0077, you will need to set up a permissive sudo umask for the package to be usable.)\n\nTo allow global package installations for the current user, set the npm_config_prefix environment variable. This is used by both npm and yarn.\n\n```\n~/.profile\n```\n\n```\nPATH=\"$HOME/.local/bin:$PATH\"\nexport npm_config_prefix=\"$HOME/.local\"\n```\n\nRe-login or source to update changes.\n\nYou can also specify the --prefix parameter for npm install. However, this is not recommended, since you will need to add it every time you install a global package.\n\n```\n$ npm -g install packageName --prefix ~/.local\n```\n\nAnother option is to set prefix field in $HOME/.npmrc. This achieves the same effect as using npm_config_prefix=\"$HOME/.local\" in one's .profile:\n\n```\n$ npm set prefix=\"$HOME/.local\"\n```\n\n"
    },
    {
      "title": "Updating packages",
      "level": 4,
      "content": "Updating packages is as simple as\n\n```\n$ npm update packageName\n```\n\nFor the case of globally installed packages (-g)\n\n```\n# npm update -g packageName\n```\n\nHowever, sometimes you may just wish to update all packages, either locally or globally. Leaving off the packageName npm will attempt to update all packages\n\n```\n$ npm update\n```\n\nor add the -g flag to update globally installed packages\n\n```\n# npm update -g\n```\n\n"
    },
    {
      "title": "Removing packages",
      "level": 4,
      "content": "To remove a package installed with the -g switch simply use:\n\n```\n# npm -g uninstall packageName\n```\n\nto remove a local package drop the switch and run:\n\n```\n$ npm uninstall packageName\n```\n\n"
    },
    {
      "title": "Listing packages",
      "level": 4,
      "content": "To show a tree view of the installed globally packages use:\n\n```\n$ npm -g list\n```\n\nThis tree is often quite deep. To only display the top level packages use:\n\n```\n$ npm -g list --depth=0\n```\n\nTo display obsolete packages that may need to be updated:\n\n```\n$ npm -g outdated\n```\n\n"
    },
    {
      "title": "Managing packages with pacman",
      "level": 3,
      "content": "Some Node.js packages can be found in Arch User Repository (AUR) with the name nodejs-package_name.\n\nSee the Node.js package guidelines for best practices in packaging Node.js packages for AUR.\n\n"
    },
    {
      "title": "npm help does not display documentation",
      "level": 3,
      "content": "Using npm help topic may not display the documentation for topic. Instead, use man npm-topic. For example:\n\n```\n$ npm help install\nTop hits for \"install\"\n...\n$ man npm-install\n... shows the documentation for the npm install subcommand\n```\n\nThis is a bug with Arch's npm package.\n\n"
    },
    {
      "title": "node-gyp errors",
      "level": 3,
      "content": "In case of errors like gyp WARN EACCES user \"root\" does not have permission to access the ... dir, --unsafe-perm option might help:\n\n```\n# npm install --unsafe-perm -g node-inspector\n```\n\n"
    },
    {
      "title": "Cannot find module ... errors",
      "level": 3,
      "content": "Since npm 5.x.x. package-lock.json file is generated along with the package.json file. Conflictions may arise when the two files refer to different package versions. A temporary method to solving this problem has been:\n\n```\n$ rm package-lock.json\n$ npm install\n```\n\nHowever, fixes were made after npm 5.1.0 or above. For further information, see: missing dependencies\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Node.js documentation\n- npm documentation\n- IRC channel #node.js on Libera Chat\n\n"
    }
  ]
}