{
  "title": "Noip",
  "url": "https://wiki.archlinux.org/title/Noip",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "According to Wikipedia:\n\nFor RFC2136 there is nsupdate(1) from bind. For dynamic DNS services there are several packages available, see #Update clients.\n\n"
    },
    {
      "title": "Router",
      "level": 2,
      "content": "If the device needing DDNS sits behind a router, you should first check if the router itself can update any DDNS services. Although the selection of services may be limited, there are several advantages to using the router: it will probably be easier to set up, will require little to no maintenance, and will have no downtime (if the router is down you will not have Internet anyway).\n\n"
    },
    {
      "title": "Update clients",
      "level": 2,
      "content": "Note that some dynamic DNS providers do not require a dedicated client and can be updated with cURL.\n\n"
    },
    {
      "title": "Multi-service clients",
      "level": 3,
      "content": "- ddclient — Update dynamic DNS entries for accounts on many dynamic DNS services.\n\n- inadyn — Dynamic DNS client with SSL/TLS support.\n\n- inadyn-mt — A small and simple dynamic DNS client based on inadyn.\n\n- ndyndns — Supports DynDNS and Namecheap.\n\n"
    },
    {
      "title": "Single-service clients",
      "level": 3,
      "content": "- duckdns — Update your DuckDNS.org entries from your computer with systemd.\n\n- hetzner_ddns — Dynamic DNS daemon for Hetzner DNS\n\n- noip — Dynamic DNS Client Updater for no-ip.com services.\n\n"
    },
    {
      "title": "ddclient",
      "level": 3,
      "content": "ddclient is compatible with many DDNS services and is the recommended tool for updating DDNS if your router is not an option. It includes systemd support.\n\nAfter installing, edit the configuration file /etc/ddclient/ddclient.conf to set up your DDNS provider (it includes many examples). Then enable and start ddclient.service.\n\nThe configuration can be tested by running ddclient with the -noquiet and -debug options:\n\n```\n# ddclient -daemon=0 -noquiet -debug\n```\n\nSome of the compatible services are listed below, but you can also check the examples and protocols for more.\n\nTable content:\nService | Configuration notes\nNow-DNS | example\nChangeIP | example\nDuck DNS | example\nFreeDNS | example\nNo-IP | Use protocol noip, server dynupdate.no-ip.com\nnsupdate.info | Use protocol dyndns2\nDyn DNS | example\nNamecheap | example\nDynu | example\n\n"
    },
    {
      "title": "Use an external website to determine IP address",
      "level": 4,
      "content": "If ddclient is unable to detect your IP address, you can configure ddclient to fetch your IP from an external webpage such as checkip.dyndns.org. This address is used by default when use=web is specified. It is also recommended to increase the check interval to avoid frequent requests to the IP check service:\n\n```\n/etc/ddclient/ddclient.conf\n```\n\n```\ndaemon=900\n# obtain IP address from web status page\nuse=web\n```\n\nAn alternative IP check service can be specified with the web key:\n\n```\n/etc/ddclient/ddclient.conf\n```\n\n```\ndaemon=900\n# obtain IP address from web status page\nuse=web, web=myonlineportal.net/checkip\n```\n\n"
    },
    {
      "title": "Use a local script to determine IPv6 address",
      "level": 4,
      "content": "ddclient often gets the wrong IPv6 address or none at all, but instead of an external website the IPv6 address can be determined locally. This script can be used:\n\n```\n/usr/local/bin/get-ip\n```\n\n```\n#!/bin/sh\nip -6 -o addr show scope global | awk -F '[ \\t]+|/' '$4 ~ /^[23]/ {print $4}'\n```\n\nTell ddclient to use the script:\n\n```\n/etc/ddclient/ddclient.conf\n```\n\n```\n# obtain IP address from script\nusev6=cmdv6,cmdv6='/usr/local/bin/get-ip'\n```\n\n"
    },
    {
      "title": "Use UPnP or NAT-PMP to determine external IPv4 address",
      "level": 4,
      "content": "If your router supports UPnP, install miniupnpc and use the external-ip utility:\n\n```\n/etc/ddclient/ddclient.conf\n```\n\n```\n# obtain IP address from script\nusev4=cmdv4,cmdv4='/usr/bin/external-ip'\n```\n\nFor NAT-PMP, install libnatpmp and create a script wrapping the natpmpc output.\n\n```\n/usr/local/bin/get-ip\n```\n\n```\n#!/bin/sh\nnatpmpc | grep -oP 'Public IP address : \\K\\S+'\n```\n\nMake the script executable and tell ddclient to use it:\n\n```\n/etc/ddclient/ddclient.conf\n```\n\n```\n# obtain IP address from script\nusev4=cmdv4,cmdv4='/usr/local/bin/get-ip'\n```\n\n"
    },
    {
      "title": "Other providers",
      "level": 2,
      "content": "Other DDNS providers are not compatible with ddclient so updating your IP with them may require a special tool or some custom scripting. Remember that if the service allows you to update your IP using the command line, you can automate the process using tools such as cron or systemd/Timers.\n\n"
    }
  ]
}