{
  "title": "Ntop",
  "url": "https://wiki.archlinux.org/title/Ntop",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is a candidate for moving to ntopng.** This article or section is a candidate for moving to ntopng.\n\nThis article or section is a candidate for moving to ntopng.\n\nntop is a network traffic probe based on libpcap, that offers RMON-like network traffic statistics accessible via a web browser.\n\nntop's final release was in 2012 and is currently unmaintained. It has been succeeded by ntopng (ntopngAUR).\n\n"
    },
    {
      "title": "Installation and configuration",
      "level": 2,
      "content": "Install the ntopAUR package. The first run of ntop, you must set the admin password:\n\n```\n# ntop\n```\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nNext, you need to edit the configuration file (/etc/conf.d/ntop) to adapt on your needs. Below is an example configuration, with the focus on the host to get as much as information from the hosts connections:\n\n```\n/etc/conf.d/ntop\n```\n\n```\n# Parameters to be passed to ntop.\nNTOP_ARGS=\"-K -W 2323 -i enp1s0,wlp2s0 -M -s -4 -6 -s -u ntop -c -r 30 --w3c -t 3 -a /var/log/ntop/http.log -O /var/log/ntop/ -q --skip-version-check 0\"\n\n# Location of the log file.\nNTOP_LOG=\"/var/log/ntop/ntop.log\"\n```\n\nBefore starting and possibly enabling the ntop service, you may have to edit its ntop command options:\n\n```\n/etc/systemd/system/ntop.d/options.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=/usr/bin/ntop options\n```\n\n"
    },
    {
      "title": "Web interface",
      "level": 3,
      "content": "To access ntop's web interface, enter http://127.0.0.1:3000/ into your web browser. To make changes to the server, you will need to enter your username (default = admin) and password.\n\nIf ntop is not just used locally on your machine, but network wide by multiple users, you would be better off by allowing SSL connections (https) only.\n\n```\n# ntop -W 4223\n```\n\nOn firefox, the self-signed certificat should be a problem. Page will not be shown like that.\n\nAdditional paramethers are allowed. Now direct our browser to https://127.0.0.1:4223/.\n\nYou can also provide ntop with your own SSL certificate. Simply put it in ntop's configuration directory and name it ntop-cert.pem\n\n```\n# cd /usr/share/ntop\n# openssl req -x509 -nodes -days 365 \n  \\-subj '/C=US/L=Portland/CN=swim' \n  \\-newkey rsa:1024 -keyout ntop-cert.pem -out ntop-cert.pem\n```\n\nInstead of make a self-signed certificat who will make your page unable to print on firefox, you should look at letsencrypt service. This service will make a free well recognized certificat for your domain. Then you will have to copy privkey.pem and fullchain.pem inside ntop-cert.pem:\n\n```\n# cat /etc/letsencrypt/live/<your domain>/privkey.pem /etc/letsencrypt/live/>your domain>/fullchain.pem > /usr/share/ntop/ntop-cert.pem\n```\n\nyou can also copy your private key in the same place.\n\n"
    },
    {
      "title": "Group and user",
      "level": 3,
      "content": "In order for the -u parameter to work properly and to make your ntop setup a bit more secure, you should create your own group and user for it.\n\n```\n# useradd -M -s /usr/bin/false ntop\n# passwd -l ntop\n```\n\n"
    },
    {
      "title": "**ERROR** RRD: Disabled - unable to create base directory (err 13, /var/lib/ntop/rrd)",
      "level": 3,
      "content": "Directory /var/lib/ntop/rrd/ may not exist. Create it and make sure it belongs to user nobody.\n\n"
    },
    {
      "title": "Please enable make sure that the ntop html/ directory is properly installed",
      "level": 3,
      "content": "If you receive this warning while trying to access the web interface, edit /etc/conf.d/ntop to include your IP and restart the daemon. For example:\n\n```\nNTOP_ARGS=\"-i enp1s0 -w 127.0.0.1:3000\"\n```\n\nThis is the IP you will use to access the web interface.\n\n"
    }
  ]
}