{
  "title": "OpenShift",
  "url": "https://wiki.archlinux.org/title/OpenShift",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "OpenShift is a Kubernetes distribution from Red Hat. It is a complex piece of software that bundles different pieces (monitoring, console-gui, authentication) together. The aim is to support containers in a productive environment with (paid) support by Red Hat.\n\n"
    },
    {
      "title": "Server",
      "level": 3,
      "content": "OKD is an open source alternative which can be used free of charge, see the upstream documentation.\n\nTo just try it out, it is possible to use a pre-configured instance at https://learn.openshift.com. Alternatively, install it in a non-production environment (see below).\n\n"
    },
    {
      "title": "OpenShift v4",
      "level": 4,
      "content": "Red Hat OpenShift Local can be used to install an OpenShift v4 cluster.\n\nThe installation is described in the Getting Started Guide[dead link 2025-01-22 ⓘ] (please check for correct version). The installation asks for sudo rights (maybe not needed?) and will install an openshift cluster using kvm/libvirt. Since Arch Linux is not natively supported by the setup procedure, make sure you have the prerequisites installed: libvirt, qemu-base, dnsmasq and networkmanager. It will add the current user to the libvirt group. One also needs a secret from cloud.redhat.com (account is needed) that can be obtained in the Red Hat Cloud Console.\n\nThe basic steps for installing crc on your computer:\n\n```\n#untar downloaded archive\ntar -xJf crc-linux-amd64.tar.xz\n#create a bin link so that future versions only need relinking, no new path\nln -s crc-linux-<VERSION>-amd64 bin\n#add bin folder to PATH and restart your terminal so that PATH is updated (or source config file)\n...\n#create base install of crc takes some minutes (will ask for secret)\ncrc setup\n#start openshift cluster\ncrc start\n#get credentials of openshift instance\ncrc console --credentials\n#open console in webbrowser\ncrc console\n```\n\n"
    },
    {
      "title": "Client",
      "level": 3,
      "content": "openshift-client-binAUR - Provides the oc command.\n\n"
    },
    {
      "title": "Troubleshoot network traffic of a container",
      "level": 3,
      "content": "In Kubernetes, each shares its network layer with other containers in the same pod. You can install a container with tcpdump in the same pod, and then use oc rsh to connect to the container and monitor the traffic.\n\nSee Using sidecars to analyze and debug network traffic in OpenShift for more details.\n\n"
    }
  ]
}