{
  "title": "Orthanc",
  "url": "https://wiki.archlinux.org/title/Orthanc",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Orthanc is a lightweight open-source standalone DICOM server which can be extended via its RESTful API and plugin mechanism allowing new modules to be developed. Orthanc is built on top of dcmtk. A Web viewer, a PostgreSQL database back-end, a MySQL database back-end, and a reference implementation of DICOMweb are currently freely available as plugins. [1]\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the orthancAUR package.\n\nThe latter will require dcmtk which is a collection of libraries and applications implementing large parts the DICOM standard.\n\nEach time the lib icu is updated, you will have to rebuild dcmtk, otherwise orthancAUR will complain.\n\nTo launch Orthanc, simply start/enable orthanc.service.\n\n- The DICOM files you upload to the Orthanc application are stored in /var/lib/orthanc/.\n- The JSON server configuration file is stored as /etc/webapps/orthanc/config.json.\n\n"
    },
    {
      "title": "Plugins",
      "level": 2,
      "content": "Orthanc is provided with a bunch of plugins, whose some of the official ones are packaged for Arch Linux as well.\n\n"
    },
    {
      "title": "Web viewer",
      "level": 3,
      "content": "This official plugin extends Orthanc with a Web viewer of medical images.[2]\n\nInstall orthanc-plugin-web-viewerAUR\n\nAdd the path to the lib in the Plugins node of the JSON server configuration\n\n```\n\"Plugins\" : [\n  \"/usr/share/orthanc/plugins/libOrthancWebViewer.so\",\n],\n```\n\nRestart the orthanc.service for the changes to take effect.\n\n"
    },
    {
      "title": "DICOMweb",
      "level": 3,
      "content": "This official plugin extends Orthanc with support of the DICOMweb protocols. More precisely, the plugin introduces a basic, reference implementation of WADO-URI, WADO-RS, QIDO-RS and STOW-RS, following DICOM PS3.18. The plugin simultaneously turns Orthanc into a DICOMweb server and into a DICOMweb client.[3]\n\nInstall orthanc-plugin-dicomwebAUR\n\nAdd the path to the lib in the Plugins node of the JSON server configuration\n\n```\n\"Plugins\" : [\n  \"/usr/share/orthanc/plugins/libOrthancDicomWeb.so\",\n],\n```\n\nRestart the orthanc.service for the changes to take effect.\n\n"
    }
  ]
}