{
  "title": "Package Maintainers",
  "url": "https://wiki.archlinux.org/title/Package_Maintainers",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Package Maintainers (previously called Trusted Users) are an official Arch Linux staff role. Package Maintainers fulfill the following tasks:\n\n- Maintain packages in the official repositories (aside from the core one).\n- Maintain, manage, and watch over the operation of the AUR.\n\nThe generic term \"package maintainer\" is also used to describe any person maintaining a package, regardless of the repository, as described in Arch terminology#Package maintainer.\n\n"
    },
    {
      "title": "How do I become a Package Maintainer?",
      "level": 2,
      "content": "The minimum requirements to becoming a Package Maintainer are as follows:\n\n- know basic shell scripting\n- maintain a few packages in AUR with clean, high-quality PKGBUILDs\n- basic community involvement (mailing list, forums, IRC)\n- proficiency with web search\n- a general idea of the kind of packages you want to maintain (basically, why do you want to become Package Maintainer?)\n\nEven though you could become a Package Maintainer by merely fulfilling those minimum requirements, the people judging you during the standard voting procedure might expect more from you. Such as:\n\n- involvement in the bug tracker (reporting, research, info)\n- patches for Arch projects\n- involvement in a few open-source projects (even if they are your own)\n\nIf you still feel up to becoming a Package Maintainer after reading these lines, the first step is to find two Package Maintainers who agree to sponsor you. Once sponsored, you should write a witty application signed with your GPG key to the aur-general mailing list.\n\nFor more information, see the Package Maintainer Bylaws and Package Maintainer guidelines.\n\n"
    },
    {
      "title": "Active Package Maintainers",
      "level": 2,
      "content": "See https://archlinux.org/people/package-maintainers/\n\n"
    },
    {
      "title": "Past Package Maintainers",
      "level": 2,
      "content": "See https://archlinux.org/people/package-maintainer-fellows/\n\n"
    }
  ]
}