{
  "title": "Packet Tracer",
  "url": "https://wiki.archlinux.org/title/Packet_Tracer",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- GNS3\n\nPacket Tracer is a network simulation and network simulation visualization program, that allows to experiment with Cisco network behavior on the CCNA level.\n\nPacket Tracer is an integral part of the Cisco Networking Academy, and provides authoring, assessment, and collaboration capabilities.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "- Understand if you have permission from Cisco Systems to use this software. If you do not meet eligibility, discontinue your progress and consider alternatives such as GNS3.\n- I am not a lawyer explanation: you have rights use Packet Tracer if you are a Network Academy student or alumni.\n\n"
    },
    {
      "title": "Download source package tarball",
      "level": 3,
      "content": "packettracerAUR can not be installed using automated methods (e.g. AUR helper) because the software's tarball must be downloaded first before building the package.\n\nSo, first acquire the build files for packettracerAUR package.\n\n"
    },
    {
      "title": "Download Packet Tracer deb package",
      "level": 3,
      "content": "It is time to download the Packet Tracer deb package distributed in Cisco's website so it can be used to build packettracerAUR for Arch Linux.\n\n1. Log into Cisco Networking Academy (Skills For All / NetAcad) using your Cisco Account. Register an account if you do not have it.\n1. Once in the Networking Academy portal, download the Packet Tracer from https://skillsforall.com/resources/lab-downloads. The downloaded filename should be something like Packet_Tracer822_amd64_signed.deb.\n1. Alternatively, if downloading from the legacy NetAcad portal at https://legacy.netacad.com/portal/resources/packet-tracer, the file will be named something like CiscoPacket_Tracer822_amd64_signed.deb. You must rename this file to Packet_Tracer822_amd64_signed.deb (exact filename will be printed out by the build script if not found) so it is recognized by the build script.\n1. Place the .deb file inside the folder where packettracerAUR's build files are located—that is the same folder where the PKGBUILD file is found.\n\n"
    },
    {
      "title": "Build and install",
      "level": 3,
      "content": "With all the build files and the deb file ready, time to build and install:\n\n1. Change the directory to where build files (e.g. PKGBUILD) are (if you are not in there already)\n1. Build the package; alternatively, build in a clean chroot\n1. Install the package.\n\n"
    },
    {
      "title": "Crashes under Wayland",
      "level": 3,
      "content": "If Packet Tracer crashes when started in a Wayland session, try running it with the QT_QPA_PLATFORM environment variable set to xcb. See Wayland#Qt for more details.\n\n"
    },
    {
      "title": "Wrong UI Size",
      "level": 3,
      "content": "If Packet Tracer renders the incorrect size, try modifying the QT_DEVICE_PIXEL_RATIO environment variable, and then either reboot or logout.\n\n"
    }
  ]
}