{
  "title": "PCSX-Reloaded",
  "url": "https://wiki.archlinux.org/title/PCSX-Reloaded",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "PCSX-Reloaded, also known as PCSXR, PCSXr or PCSX-r, is a plugin based console emulator built on top of the PSEmu Pro plugin interface, which allows playing Play Station 1 games on a PC.\n\nBeing a plugin based emulator allows more configurability, including setting screen resolutions and texture qualities higher than those supported by the original console.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "The last stable version was released 2015-09-25 and can be installed with the pcsxrAUR package. The pcsxr-gitAUR package allows the installation of the development version, the latest commit having taken place in 2017.\n\nNotice, however, that if you have a 64 bit machine and you choose to grab one of these versions, PCSXR will be compiled to 64 bit architecture, rendering it incompatible with the vast majority of the plugins, which are 32 bit only. If you intend to use any plugins other than the ones that come with the emulator, you should install the 32 bit package lib32-pcsxrAUR.\n\nAlternatively, an actively developed fork is available with the pcsx-redux-gitAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Upon the first launch PCSXR will create a hidden directory named .pcsxr into your home directory, where all the configurations, plugins, savedata and the console bios will be stored. Deleting this directory will reset PCSXR's configuration to its original state.\n\n"
    },
    {
      "title": "BIOS",
      "level": 3,
      "content": "The bios dump must be put into the ~/.pcsxr/bios/ directory. PCSXR can also emulate an internal bios, but it is not compatible with all games and presents issues. PCSXR provides an incomplete compatibility list.\n\n"
    },
    {
      "title": "Plugins",
      "level": 3,
      "content": "PCSXR already comes with a set of plugins that allows to play out-of-the-box, however, if you wish to install plugins for extra video/sound/joystick/configurability you will need to put the respective plugins and their configuration files at the ~/.pcsxr/plugins/ directory. Most of the Linux compatible plugins can be found at Pete's Domain.\n\nBe aware that some of the plugins will require lib32-gtkAUR to show their configuration interface.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Configure your Video, Sound, Controllers, CDROM and BIOS by going to Configuration > Plugins & Bios.\n\n"
    },
    {
      "title": "Playing",
      "level": 2,
      "content": "Run a game from CDROM by clicking File > Run CD or by pressing Ctrl+o.\n\nRun a game from an ISO or BIN file by clicking File > Run ISO or by pressing Ctrl+i.\n\nRun the Play Station BIOS and manage your memory cards and savedata by clicking File > Run BIOS or by pressing Ctrl+b.\n\n"
    },
    {
      "title": "Save states",
      "level": 3,
      "content": "PCSXR supports save states, which allows you to save your game progress in any moment, regardless of you being in a savepoint or not and without the need of attaching a new memory card.\n\nThere are 9 slots available for save states, meaning that for each different game you can have up to nine different states saved.\n\nSave a state by clicking Emulator > Save States and selecting a slot or by pressing Ctrl+Slot Number eg. Ctrl+1 for slot 1.\n\nLoad a state by clicking Emulator > Load States and selecting a state previously saved to a slot or by pressing Alt+Slot Number eg. Alt+1 for slot 1.\n\n"
    },
    {
      "title": "wrong ELF class: ELFCLASS32",
      "level": 3,
      "content": "You installed a 64 bit version of the emulator and is trying to run a 32 bit plugin. Install the lib32-pcsxrAUR package.\n\n"
    },
    {
      "title": "cfgPeteXGL2, cfgPeteMesaGL or cfgPeopsOSS not found",
      "level": 3,
      "content": "This issue happens because the latest Linux version of Pete's plugins do not provide the configuration files with them. To solve the problem go to Pete's GPU Plugins page and find the Linux GPU Configs section, download the configuration files - they will come all together in a .tar.gz file. Fetch the missing ones from the Gzip file and put them on the ~/.pcsxr/plugins/ folder and the problem will be solved.\n\n"
    },
    {
      "title": "PE.Op.S OSS Audio Driver outputs no sound",
      "level": 3,
      "content": "OSS is dated, use the SDL Sound 1.1.0 plugin that comes included with the emulator.\n\n"
    },
    {
      "title": "Audio crackling",
      "level": 3,
      "content": "Disable the system type (NTFS/PAL) auto-detection and manually set it to PAL in Configuration > CPU ... > System Type.\n\n"
    },
    {
      "title": "PCSXR segfaults when launching a game or the BIOS",
      "level": 3,
      "content": "Segfaults are confirmed to happen in computers that have an Intel HD Graphics 965 installed on them, but the bug is reportedly happening on AMD and NVIDIA powered PC's as well.\n\nOpen the file ~/.pcsxr/pcsxr.cfg and change the Cpu property's value from 0 to 1 to fix it.\n\nYou may also want to investigate the cause of the segfault by examining the Core dump with coredumpctl.\n\n"
    },
    {
      "title": "error while loading shared libraries: libgtk-1.2.so.0",
      "level": 3,
      "content": "Install lib32-gtkAUR.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:PCSX-Reloaded\n- Emulation General wiki - Playstation emulators\n\n"
    }
  ]
}