{
  "title": "Plex",
  "url": "https://wiki.archlinux.org/title/Plex",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Plex is a media player system and software suite consisting of many player applications for 10-foot user interfaces and an associated media server that organizes personal media stored on local devices. Integrated Plex Channels provide users with access to a growing number of online content providers such as YouTube, Vimeo, TEDTalks, and CNN among others. Plex also provides integration for cloud services including Dropbox, Box, Google Drive, or Copy.\n\nPlex for Linux is split into a closed-source server Plex Media Server, and an open-source client Plex Home Theater, a fork of the popular Kodi project.\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "Install plex-media-serverAUR (stable update channel) or plex-media-server-plexpassAUR (beta update channel). The latter is only available to Plex Pass subscribers and can provide early access to improvements and/or new functionalities, but also early access to potential bugs. Even though the beta update channel is typically quite stable, it is recommended to install the stable release unless you require specific early access content (release notes).\n\n"
    },
    {
      "title": "Configuration",
      "level": 3,
      "content": "Start/enable the plexmediaserver.service systemd unit.\n\nTo begin configuring the Plex Media Server, browse to http://localhost:32400/web/.\n\nTo configure Plex Media Server remotely, you can first create an SSH tunnel (setup can only be done from localhost)\n\n```\n$ ssh ip.address.of.server -L 8888:localhost:32400\n```\n\nand then browse to http://localhost:8888/web/.\n\nor if you are running apache, with a reverse proxy, by adding this configuration in httpd-vhosts.conf\n\n```\n<VirtualHost *:80>\n   ServerName ip.address.of.server\n   ProxyPass        / http://localhost:32400/\n   ProxyPassReverse / http://localhost:32400/\n </VirtualHost>\n```\n\n"
    },
    {
      "title": "Custom domain",
      "level": 4,
      "content": "Below an example server configuration is given for a reverse proxy using Nginx, including certificate configuration.\n\n```\n/etc/nginx/sites-available/domain.com.conf\n```\n\n```\nserver {\n    listen                  443 ssl http2;\n    listen                  [::]:443 ssl http2;\n    server_name             media.domain.com;\n\n    # SSL\n    ssl_certificate         /etc/letsencrypt/live/media.domain.com/fullchain.pem;\n    ssl_certificate_key     /etc/letsencrypt/live/media.domain.com/privkey.pem;\n    ssl_trusted_certificate /etc/letsencrypt/live/media.domain.com/chain.pem;\n\n    # logging\n    access_log              /var/log/nginx/media.domain.com.access.log;\n    error_log               /var/log/nginx/media.domain.com.error.log warn;\n\n    # reverse proxy\n    location / {\n        proxy_pass https://localhost:32400;\n        proxy_set_header Host $host;\n        proxy_set_header X-Real-IP $remote_addr;\n        proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;\n        proxy_set_header X-Forwarded-Proto $scheme;\n    }\n}\n\n# HTTP redirect\nserver {\n    listen      80;\n    listen      [::]:80;\n    server_name media.domain.com;\n    include     nginxconfig.io/letsencrypt.conf;\n\n    location / {\n        return 301 https://media.domain.com$request_uri;\n    }\n}\n```\n\n"
    },
    {
      "title": "Plugins",
      "level": 3,
      "content": "PMS can be expanded with additional plugins. For example, PMS can be used as an IPTV client with the IPTV plugin.\n\nPlugins can be installed inside /var/lib/plex/Plex Media Server/Plug-ins.\n\n"
    },
    {
      "title": "Plex Live TV and DVR",
      "level": 3,
      "content": "Plex live TV requires a plexpass.\n\nTo enable live TV viewing and DVR support with plex, you must have one of the supported tuners listed on the support page. PMS will automatically recognize any connected tuners.\n\nThe plex user needs to be part of the video group in order to access local tuners. This can be done by running usermod -a -G video plex\n\nTo enable IPTV support via m3u playlist install xTeVeAUR.\n\n"
    },
    {
      "title": "Hauppauge",
      "level": 4,
      "content": "The drivers for all Hauppauge tuners have been included in the Linux kernel for some time now (e.g. ~v4.7 for WinTV-DualHD), however the firmware isn’t loaded by default. Look for a kernel message: firmware file ‘dvb-demod-siXXXX-YY.fw’ not found by e.g. starting a tail with dmesg -w and enable/insert the (USB) tuner device. If missing, download the respective firmware file and copy it file to /lib/firmware/.\n\n"
    },
    {
      "title": "Security",
      "level": 3,
      "content": "It is recommended to store your media files outside of your home directory, as making it accessible to PMS would mean lowering its security. Having a separate /media or /mnt/media partition is a good setup for use with PMS.\n\nYou can further increase security via systemd, by editing plexmediaserver.service as follows:\n\n```\n/etc/systemd/system/plexmediaserver.service.d/restrict.conf\n```\n\n```\n[Service]\nReadOnlyPaths=/\nReadWritePaths=/var/lib/plex /tmp\n```\n\n"
    },
    {
      "title": "Resource management",
      "level": 3,
      "content": "Originally, PMS used ulimit to limit its allocated resources, however this is not compatible with running as a regular user. Instead, you can now set a maximum amount of memory via, again, systemd. For example, you can add:\n\n```\nMemoryMax=4G\n```\n\nto the file mentioned above.\n\n"
    },
    {
      "title": "Network",
      "level": 3,
      "content": "PMS and its DLNA server require several ports to be open:\n\n- Plex Media Server: TCP 32400\n- Plex DLNA Server: TCP 32469, UDP 1900\n- Network Discovery: UDP 32410, 32412, 32413, 32414\n- Bonjour/Avahi Network Discovery (legacy): UDP 5353\n\nA short example with iptables:\n\n```\n# iptables -A INPUT -p tcp -m multiport --dports 32400,32469 -j ACCEPT\n# iptables -A INPUT -p udp -m multiport --dports 1900,32410,32412,32413,32414 -j ACCEPT\n```\n\nIn order to connect to Plex through on a standard http port, this command can be used (for port 8080):\n\n```\n# iptables -t nat -A PREROUTING -p tcp --dport 8080 -j REDIRECT --to-port 32400\n```\n\nThen you can connect directly to http://yourplexaddress:8080 on this port\n\n"
    },
    {
      "title": "UFW Rule",
      "level": 4,
      "content": "If you use UFW and would like to create an App List entry for Plex, create/edit /etc/ufw/applications.d/plexmediaserver and ensure it contains the following content:\n\n```\n[plexmediaserver]\ntitle=Plex Media Server (Standard)\ndescription=The Plex Media Server\nports=32400/tcp|3005/tcp|5353/udp|8324/tcp|32410:32414/udp\n\n[plexmediaserver-dlna]\ntitle=Plex Media Server (DLNA)\ndescription=The Plex Media Server (additional DLNA capability only)\nports=1900/udp|32469/tcp\n\n[plexmediaserver-all]\ntitle=Plex Media Server (Standard + DLNA)\ndescription=The Plex Media Server (with additional DLNA capability)\nports=32400/tcp|3005/tcp|5353/udp|8324/tcp|32410:32414/udp|1900/udp|32469/tcp\n```\n\nOnce you have saved the file, reload the UFW application definitions with:\n\n```\n# ufw app update plexmediaserver\n```\n\nAnd then finally allow the Plex app with:\n\n```\n# ufw allow plexmediaserver-all\n```\n\n"
    },
    {
      "title": "Library Updates",
      "level": 3,
      "content": "Plex Media Server has a setting \"Update my library automatically\" which can detect new media files as they are downloaded to your library. But as your library grows, these updates might stop working reliably. To fix, you need to increase the number of files non-root users are allowed to subscribe to via inotify. Create the file /etc/sysctl.d/40-max-user-watches.conf\n\n```\n/etc/sysctl.d/40-max-user-watches.conf\n```\n\n```\nfs.inotify.max_user_watches=524288\n```\n\nand run\n\n```\n# sysctl --system\n```\n\nto apply without rebooting. Now plex should see any new files.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nLogs are located in /var/lib/plex/Plex Media Server/Logs.\n\nIn case there are no logs or they are not helpful, you might want to launch PMS manually to get some terminal output:\n\n```\n[plex]$ source /etc/conf.d/plexmediaserver\n[plex]$ export LD_LIBRARY_PATH=/usr/lib/plexmediaserver\n[plex]$ /usr/lib/plexmediaserver/Plex\\ Media\\ Server\n```\n\n"
    },
    {
      "title": "Plex's WebUI returns 404",
      "level": 4,
      "content": "There may be a situation when updating Plex's WebUI will return 404 Not Found. To fix this you just need to restart plexmediaserver.service.\n\n"
    },
    {
      "title": "Long-running stop job",
      "level": 4,
      "content": "When logging out, shutting down, or stopping plexmediaserver.service manually, it may take a long time to finish the systemd stop job. This is possibly due to a bug in the Plex Tuner Service.[1]\n\nIf you do not use Plex's DVR feature, you can prevent Plex Tuner Service from running. First, stop plexmediaserver.service, then rename the relevant executable:\n\n```\n# mv '/usr/lib/plexmediaserver/Plex Tuner Service' '/usr/lib/plexmediaserver/Plex Tuner Service.disabled'\n```\n\nFinally, start plexmediaserver.service again.\n\nTo avoid having to repeat these steps manually after each update, use the NoExtract array in /etc/pacman.conf to block the installation of this file.\n\n"
    },
    {
      "title": "Plex does not detect folder or external drive",
      "level": 4,
      "content": "In order for Plex to see folders, it needs to be given read and execute permissions. This is due to Plex being run as the user \"plex\" instead of your user. As such, it will not have access to your /home/ folder by default. The best practice is to put the media into a folder in the root folder (e.g. /PlexMedia/) or on an external drive. Then you have to give it read and execute permissions via the code below or by setting it via a file explorer.\n\n```\n# chmod -R 775 path/to/media/folder\n```\n\nIf not set already, set the owner/group to your username.\n\n```\n# chown yourusername:yourusername /mediafolder\n```\n\nIf you haven't explicitly set up a mounting configuration for your drives, your desktop environment (e.g. GNOME or KDE) might automatically mount it when you try accessing it via their file explorers. Plex won't be able to access the drive. This is because the desktop environment mounts it to your user (via FUSE), while Plex uses by default the \"plex\" user.\n\nYou will need to manually mount the drives for Plex to see them by setting the mount point. See Fstab for more details. You can also use a program such as KDE Partition Manager or GNOME Disks to set the partition's mount point. Be sure to give the external drive the correct user permissions.\n\n"
    },
    {
      "title": "Plex for Desktop",
      "level": 2,
      "content": "Plex Desktop is the current release of Plex's desktop media client. It has officially replaced Plex Home Theater (PHT) and Plex Media Player (PMP), and includes downloads for Plex Pass users. PMP reached its EOL in 2020, though it still retains a \"TV Mode\" (replaced by Plex HTPC). Keep in mind, Plex's desktop app is closed-source.\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "The plex-desktop package can be installed from Snap or the plex-desktopAUR package.\n\n"
    },
    {
      "title": "Kodi and PleXBMC",
      "level": 2,
      "content": "With the PleXBMC add-on, Kodi can be used as a replacement for PHT.\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "Install the kodi package, then follow the instructions at https://kodi.wiki/view/Add-on:PleXBMC.\n\n"
    }
  ]
}