{
  "title": "Raccomandazioni Generali",
  "url": "https://wiki.archlinux.org/title/Raccomandazioni_Generali",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articoli correlati\n\n- Frequently asked questions (Italiano)\n- Installation guide (Italiano)\n- List of applications (Italiano)\n\nQuesto documento è un indice annotato di articoli popolari e di informazioni importanti per migliorare e aggiungere funzionalità al sistema Arch installato. Si presume che i lettori abbiano letto e seguito la Guida all'installazione per ottenere un'installazione di Arch Linux di base. Aver letto e compreso i concetti spiegati in #Amministrazione del sistema e in #Gestione dei programmi è necessario per seguire le altre sezioni di questa pagina e gli altri articoli nella Wiki.\n\n"
    },
    {
      "title": "Amministrazione del sistema",
      "level": 2,
      "content": "Questa sezione tratta le procedure di amministrazione e la gestione del sistema. Si veda Utilità di base e Category:System administration (Italiano) per ulteriori informazioni.\n\n"
    },
    {
      "title": "Utenti e gruppi",
      "level": 3,
      "content": "Una nuova installazione vi lascia solo con l'account del superuser, meglio conosciuto come \"root\". Accedere come root per periodi di tempo prolungati, magari persino esponendolo via SSH su un server, non è sicuro. Dovreste invece creare e utilizzare un account non privilegiato (o più di uno) per la magior parte delle procedure, facendo uso dell'account di root solamente per l'amministrazione del sistema. Vedasi Users and groups#User management per i dettagli.\n\nGli utenti e i gruppi sono un meccanismo per il controllo degli accessi; gli amministratori possono modificare con precisione l'appartenenza e il possesso di un gruppo, per permettere o impedire l'accesso ad utenti e servizi alle risorse di sistema. Leggete l'articolo Utenti e gruppi per i dettagli e i potenziali rischi per la sicurezza.\n\n"
    },
    {
      "title": "Sicurezza",
      "level": 3,
      "content": "Leggete Sicurezza per delle raccomandazioni e procedure migliori sull'irrobustimento del sistema.\n\nPer un elenco di applicazioni che permettono di eseguire comandi o di aprire una shell interattiva come un altro utente (es. root), vedasi Lista delle applicazioni/Sicurezza#Sorpasso delle autorizzazioni.\n\n"
    },
    {
      "title": "Gestione dei servizi",
      "level": 3,
      "content": "Arch Linux utilizza systemd come processo init, che è un gestore del sistema e dei servizi per GNU/Linux. Per il mantenimento della vostra installazione di Arch Linux, impararne le basi è una buona idea.\n\nL'interazione consystemd si compie tramite il comando systemctl. Vedasi systemd (Italiano)#Utilizzo di base di systemctl per maggiori informazioni.\n\nÈ fornito anche un sistema per il log, con il comando journalctl. Vedasi systemd/Journal per maggiori informazioni.\n\n"
    },
    {
      "title": "Manutenzione del sistema",
      "level": 3,
      "content": "Arch è un sistema a rilascio continuo e ha un rapido ricambio dei programmi, perciò gli utenti devono trovare il tempo di compiere la Manutenzione del sistema.\n\n"
    },
    {
      "title": "Gestione dei programmi",
      "level": 2,
      "content": "Questa sezione contiene informazioni utili relative alla gestione dei programmi. Si veda Domande frequenti#Gestione pacchetti e Category:Package management (Italiano) per ulteriori informazioni.\n\nNote: **prima** \n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman è il gestore dei programmi (package manager) di Arch Linux: si incoraggia fortemente di familiarizzarci prima di leggere qualsiasi altro articolo.\n\nPer abilitare lo scaricamento di programmi in parallelo, vedasi pacman (Italiano)#Abilitare download paralleli.\n\nLeggete pacman/Suggerimenti e trucchetti per consigli su come migliorare la vostra interazione con pacman e con la gestione dei programmi in generale.\n\n"
    },
    {
      "title": "Repository",
      "level": 3,
      "content": "Leggete l'articolo Repository ufficiali per dettagli sull'obiettivo di ciascuna repository ufficialmente mantenuta.\n\nSe pianificate di utilizzare applicazioni a 32-bit, vorrete abilitare la repository multilib.\n\nL'articolo Repository non ufficiali degli utenti elenca altre repository non supportate.\n\nPotreste considerare l'installazione del servizio pkgstats.\n\n"
    },
    {
      "title": "Mirror",
      "level": 3,
      "content": "Visitate l'articolo Mirror per istruzioni su come trarre il massimo vantaggio dall'usare i mirror più veloci ed aggiornati delle repository ufficiali. Come spiegato nell'articolo, è buona abitudine controllare periodicamente la pagina Mirror Status per una lista di mirror che sono stati sincronizzati di recente. Ciò può essere automatizzato con Reflector.\n\n"
    },
    {
      "title": "Sistema di Compilazione di Arch",
      "level": 3,
      "content": "Ports è un sistema inizialmente utilizzato dalle distribuzioni BSD che consiste di script per la compilazione che risiedono in rami di cartelle sul sistema locale. In parole semplici, ogni port contiene uno script all'interno di una cartella il cui nome indica intuitivamente l'applicazione indipendente installabile.\n\nIl Sistema di Compilazione di Arch (Arch Build System) offre la stessa funzionalità attraverso script per la compilazione detti PKGBUILD, che contengono le informazioni necessarie per un certo software: controlli di integrità, indirizzo del progetto, versione, licenza e i istruzioni di compilazione. Questi PKGBUILD sono processati da makepkg, il programma che genera effettivamente i pacchetti che sono facilmente gestibili da pacman.\n\nOgni contenuto nei repository insieme a quelli presenti nell'AUR è soggetto alla ricompilazione con makepkg.\n\n"
    },
    {
      "title": "Repository degli Utenti di Arch",
      "level": 3,
      "content": "Mentre il Sistema di Compilazione di Arch permette di compilare software disponibile nei repositori ufficiali, Repository degli Utenti di Arch (Arch User Repository, o AUR) è l'equivalente per i contenuti presentati dagli utenti. Si tratta di un repository non supportato di script di compilazione a cui si può accedere mediante l'interfaccia Web o attraverso l'Interfaccia RPC Aurweb.\n\n"
    },
    {
      "title": "Fase di boot",
      "level": 2,
      "content": "Questa sezione contiene informazioni riguardanti il processo di boot (avvio). Una spiegazione del processo di boot di Arch si può trovare a Processo di boot di Arch. Vedasi Category:Boot process (Italiano) per maggiori informazioni.\n\n"
    },
    {
      "title": "Riconoscimento automatico dell'hardware",
      "level": 3,
      "content": "Durante il processo di boot, l'hardware dovrebbe essere riconosciuto automaticamente da udev. Una potenziale riduzione del tempo di avvio può essere ottenuta disabilitando il caricamento automatico dei moduli e specificando i moduli richiesti manualmente, come descritto in Modulo del kernel. Inoltre, Xorg dovrebbe essere in grado di determinare automaticamente i driver richiesti grazie a udev, ma gli utenti hanno anche l'opzione di configurare il server di X manualmente.\n\n"
    },
    {
      "title": "Microcodice",
      "level": 3,
      "content": "Il comportamento dei processori può malfunzionare, ed esso può essere corretto dal kernel aggiornando il microcodice durante l'avvio. Vedere Microcodice per i dettagli.\n\n"
    },
    {
      "title": "Mantenere i messaggi di boot",
      "level": 3,
      "content": "Una volta che appare la richiesta di autenticazione, i messaggi di boot vengono rimossi, privando gli utenti della possibilità di recuperare informazioni. Disabilitate la rimozione dei messaggi di boot per superare questa limitazione.\n\n"
    },
    {
      "title": "Attivare Num Lock",
      "level": 3,
      "content": "Num Lock è un pulsante interruttore trovato nella maggior parte delle tastiere. Per attivare l'assegnazione dei pulsanti numerica di Num Lock durante l'avvio del sistema, seguite Attivare numlock durante la fase di boot.\n\n"
    },
    {
      "title": "Interfaccia utente grafica",
      "level": 2,
      "content": "Questa sezione fornisce dell'orientamento per gli utenti che desiderano eseguire applicazioni grafiche sul loro sistema. Si veda Category:Graphical user interfaces (Italiano) per ulteriori risorse.\n\n"
    },
    {
      "title": "Server video",
      "level": 3,
      "content": "Xorg è l'implementazione grafica, open-source del Sistema di Finestre X (comunemente X11, o X). È un requisito per eseguire applicazioni con interfacce utente grafiche (GUI) e la maggior parte degli utenti vorranno installarlo.\n\nWayland è un protocollo di server video più recente, alternativo ed è disponibile l'implementazione di riferimento Weston.\n\n"
    },
    {
      "title": "Driver video",
      "level": 3,
      "content": "Il driver video modesetting preimpostato funzionerà con la maggior parte delle schede grafiche, ma le prestazioni possono essere migliorate e ulteriori funzionalità sfruttate installando il driver più appropriato per prodotti AMD o NVIDIA.\n\n"
    },
    {
      "title": "Ambienti del desktop",
      "level": 3,
      "content": "Nonostante il server video fornisca le fondamenta per costruire un ambiente grafico, possono essere ritenuti necessari dei componenti aggiuntivi per un'esperienza utente completa. Degli ambienti del desktop come KDE, GNOME, Xfce, Cinnamon e LXDE riuniscono assieme un'ampia gamma di applicazioni ben integrate come gestore delle finestre o compositor, pannello/barra delle applicazioni, gestore dei file, emulatore di terminale, editor di testo, icone e altre utilità. Gli utenti meno esperti potrebbero voler installare un ambiente del desktop per un ambiente più familiare. Consultate Category:Desktop environments (Italiano) per risorse aggiuntive.\n\n"
    },
    {
      "title": "Gestori delle finestre o compositor",
      "level": 3,
      "content": "Un intero ambiente del desktop fornisce un'interfaccia utente grafica completa e consistente, ma tende a consumare un gran quantitativo di risorse di sistema. Gli utenti che cercano di massimizzare le prestazioni o altrimenti di semplificare il proprio ambiente possono scegliere di installare solo un gestore delle finestre oppure un compositor e scegliere uno per uno gli extra desiderati. Utilizzando Xorg, la maggior parte degli ambienti del desktop permettono anche l'esecuzione di un gestore delle finestre alternativo. Gestori di finestre di tipo dinamico, impilato, e affiancato differiscono per il modo di gestire il posizionamento delle finestre.\n\n"
    },
    {
      "title": "Gestore degli schermi",
      "level": 3,
      "content": "La maggior parte degli ambienti del desktop includono un gestore degli schermi per lanciare l'ambiente grafico e gestire le autenticazioni degli utenti, automaticamente. Gli utenti che non posseggono un ambiente del desktop possono installarne uno separatamente. Altrimenti, potreste lanciare X all'autenticazione come semplice alternativa ad un gestore degli schermi.\n\n"
    },
    {
      "title": "Directory degli utenti",
      "level": 3,
      "content": "Directory degli utenti ben note, come Scaricati o Musica, sono create dal servizio dell'utente xdg-user-dirs-update.service, che è fornito da xdg-user-dirs ed abilitato per impostazione predefinita una volta eseguita l'installazione. Se il vostro ambiente del desktop o il vostro gestore delle finestre non ritorna il contenuto, potete installarlo ed eseguire manualmente xdg-user-dirs-update, come definito in Directory degli utenti di XDG#Creare delle directory predefinite.\n\n"
    },
    {
      "title": "Gestione dell'alimentazione",
      "level": 2,
      "content": "Questa sezione può essere utile ai possessori di computer portatili o altrimenti agli utenti in cerca di controlli per la gestione dell'alimentazione. Per approfondimenti si veda Category:Power management (Italiano).\n\nVedasi Gestione dell'alimentazione per una panoramica più generale.\n\n"
    },
    {
      "title": "Eventi ACPI",
      "level": 3,
      "content": "Gli utenti possono configurare le risposte del sistema ad eventi ACPI come la pressione del pulsante di spegnimento o la chiusura del coperchio di un portatile. Per il consigliato metodo che fa uso di systemd vedasi Power management#ACPI events. Per il vecchio metodo, vedasi acpid.\n\n"
    },
    {
      "title": "Regolazione della frequenza della CPU",
      "level": 3,
      "content": "I processori moderni possono ridurre la propria frequenza e voltaggio per ridurre temperatura e consumi energetici. Delle temperature più basse portano ad un sistema più silenzioso e ad una vita delle componenti hardware prolungata. Vedasi Regolazione della frequenza della CPU per dettagli.\n\n"
    },
    {
      "title": "Computer portatili",
      "level": 3,
      "content": "Per pagine dedicate alla computazione portatile, insieme a guide all'installazione specifiche per un determinato modello, si prega di seguire Category:Laptops (Italiano). Per una panoramica generale di articoli e raccomandazioni che concernono i computer portatili, vedasi Computer portatili.\n\n"
    },
    {
      "title": "Sospensione ed ibernazione",
      "level": 3,
      "content": "Vedasi l'articolo principale: Gestione dell'alimentazione/Sospensione ed ibernazione.\n\n"
    },
    {
      "title": "Audio/video",
      "level": 2,
      "content": "Category:Multimedia (Italiano) include ulteriori risorse sulle componenti multimediali.\n\n"
    },
    {
      "title": "Sistema audio",
      "level": 3,
      "content": "Alsa è un sistema audio del kernel che dovrebbe essere immediatamente funzionante (l'audio deve solo essere riattivato). I server audio come PipeWire e PulseAudio possono offrire funzionalità aggiuntive e supportare delle configurazioni audio più complesse.\n\nVedasi Audio professionale per dei requisiti audio avanzati.\n\n"
    },
    {
      "title": "Gestione delle reti",
      "level": 2,
      "content": "Questa sezione si limita ad illustrare piccole procedure per la gestione delle reti. Leggete Configurazione delle reti per una guida alla configurazione completa e Category:Networking (Italiano) per gli articoli correlati.\n\n"
    },
    {
      "title": "Sincronizzazione dell'orologio",
      "level": 3,
      "content": "Il Protocollo del Tempo di Rete (NTP) è un protocollo per sincronizzare gli orologi dei sistemi computazionali attraverso delle reti di dati a commutazione di pacchetto ed a latenza variabile. Vedasi Tempo di sistema#Sincronizzazione del tempo per delle implementazioni di tale protocollo.\n\n"
    },
    {
      "title": "Sicurezza del DNS",
      "level": 3,
      "content": "Per una migliore sicurezza durante la navigazione nel Web, i pagamenti online, la connessione a servizi SSH e impieghi simili, considerate l'utilizzo di: risolutori DNS abilitati per DNSSEC, che possono convalidare registri DNS certificati; un protocollo crittato come DNS attraverso TLS, DNS attraverso HTTPS oppure DNSCrypt. Vedasi Risoluzione del nome di dominio per dettagli.\n\n"
    },
    {
      "title": "Impostare un firewall",
      "level": 3,
      "content": "Un firewall fornisce un ulteriore strato di protezione oltre alla stack della gestione delle reti in GNU/Linux. Nonostante il kernel di Arch in dotazione riesca ad utilizzare iptables e nftables di Netfilter, nessuno dei due è attivato per impostazione predefinita. Impostare un qualche tipo di firewall è fortemente consigliato. Vedasi Category:Firewalls (Italiano) per le guide disponibili.\n\n"
    },
    {
      "title": "Condivisioni di rete",
      "level": 3,
      "content": "Per condividere dei file tra le macchine in una rete, seguite l'articolo NFS o SSHFS.\n\nUtilizzate Samba per unirvi ad una rete di Windows. Per configurare la macchina così che utilizzi Directory Attiva per l'autenticazione, leggete Integrazione di Directory Attiva.\n\nVedasi anche Category:Network sharing (Italiano).\n\n"
    },
    {
      "title": "Dispositivi di input",
      "level": 2,
      "content": "Questa sezione illustra consigli comuni per la configurazione dei dispositivi di input. Vedasi Category:Input devices (Italiano) per ulteriori informazioni.\n\n"
    },
    {
      "title": "Mappature della tastiera",
      "level": 3,
      "content": "Le tastiere diverse da quella Inglese, o altrimenti da quella standard, potrebbero funzionare per impostazione predefinita diversamente da come ci si aspetta. I passi necessari per configurare la mappatura dei tasti si diversificano nella console virtuale ed in Xorg; sono descritti rispettivamente in Console di Linux/Configurazione della tastiera ed in Xorg/Configurazione della tastiera.\n\n"
    },
    {
      "title": "Pulsanti del mouse",
      "level": 3,
      "content": "I possessori di mouse avanzati o inusuali potrebbero scoprire che non tutti i pulsanti del dispositivo vengono riconosciuti per impostazione predefinita, oppure potrebbero voler assegnare azioni differenti per pulsanti extra. Le istruzioni per far ciò possono essere trovare in Pulsanti del mouse.\n\n"
    },
    {
      "title": "Touchpad dei laptop",
      "level": 3,
      "content": "Gran parte dei pc portatili usa dispositivi di puntamento \"touchpad\" Synaptics o ALPS. Potete utilizzare sia il driver di input Synaptics che libinput per questi ed altri modelli di touchpad; si veda Touchpad Synaptics e libinput per l'installazione e i dettagli di configurazione.\n\n"
    },
    {
      "title": "TrackPoint",
      "level": 3,
      "content": "Vedasi l'articolo TrackPoint per configurare il vostro dispositivo TrackPoint.\n\n"
    },
    {
      "title": "Ottimizzazione",
      "level": 2,
      "content": "Questa sezione vuole riassumere gli aggiustamenti, gli strumenti e le opzioni disponibili utili a migliorare le prestazioni del sistema e delle applicazioni.\n\n"
    },
    {
      "title": "Confronto delle prestazioni",
      "level": 3,
      "content": "Con il confronto delle prestazioni, esse vengono misurate e i risultati sono comparati a quelli di un altro sistema o di uno standard di riferimento, attraverso una procedura unificata.\n\n"
    },
    {
      "title": "Migliorare le prestazioni",
      "level": 3,
      "content": "L'articolo Migliorare le prestazioni raccoglie informazioni, oltre ad essere un resoconto di base, sull'ottenere prestazioni superiori in Arch Linux.\n\n"
    },
    {
      "title": "Unità a stato solido",
      "level": 3,
      "content": "L'articolo Unità a stato solido ne tratta molti aspetti, incluso configurarli per massimizzarne i cicli vitali.\n\n"
    },
    {
      "title": "Servizi di sistema",
      "level": 2,
      "content": "Questa sezione è correlata a daemons.\n\n"
    },
    {
      "title": "Indice e ricerca dei file",
      "level": 3,
      "content": "Il comando locate è disponibile in gran parte delle distribuzioni per poter cercare velocemente i file. Arch Linux fornisce alcune alternative, vedasi locate per dettagli.\n\nI motori di ricerca del desktop offrono un servizio simile, mentre sono meglio integrati negli ambienti desktop.\n\n"
    },
    {
      "title": "Distribuzione della posta locale",
      "level": 3,
      "content": "Un'installazione di base non offre alcun mezzo per la sincronizzazione della posta elettronica. È disponibile un elenco di agenti con questo scopo nell'articolo Server di posta elettronica.\n\n"
    },
    {
      "title": "Stampa",
      "level": 3,
      "content": "CUPS è un sistema di stampa basato su degli standard ed open source, sviluppato da OpenPrinting per GNU/Linux. Vedasi Category:Printers (Italiano) per degli articoli dedicati a specifiche stampanti.\n\n"
    },
    {
      "title": "Aspetto",
      "level": 2,
      "content": "Questa sezione contiene aggiustamenti di \"delizia per gli occhi\" cercati di frequente per un'esperienza estetica piacevole su Arch. Per ulteriori informazioni, si veda Category:Eye candy (Italiano).\n\n"
    },
    {
      "title": "Caratteri",
      "level": 3,
      "content": "Potreste voler installare una selezione di caratteri TrueType, poichè in un sistema di base di Arch sono inclusi solamente dei caratteri di bitmap non ridimensionabili. Esistono varie famiglie di caratteri con scopo generale, che forniscono una copertura di Unicode elevata e persino compatibilità metrica con caratteri da altri sistemi operativi.\n\nTantissime informazioni sull'argomento possono essere trovate nelle pagine Caratteri e Configurazione dei caratteri.\n\nSe gli utenti passano molto tempo lavorando dalla console virtuale (cioè al di fuori di un server di X), essi potrebbero desiderare di cambiare il carattere della console per migliorare la leggibilità; si veda Console di Linux#Caratteri.\n\n"
    },
    {
      "title": "Temi GTK e Qt",
      "level": 3,
      "content": "Gran parte delle applicazioni per i sistemi GNU/Linux con un'interfaccia grafica si basano sul toolkit GTK o su Qt. Leggete quegli articoli e Aspetto uniforme per le applicazioni Qt e GTK per delle idee con cui migliorare l'aspetto dei vostri programmi installati; adattatelo a vostro piacimento.\n\n"
    },
    {
      "title": "Migliorie per la console",
      "level": 2,
      "content": "Questa sezione è dedicata a piccole modifiche per migliorare l'usabilità dei programmi per la linea di comando. Per ulteriori approfondimenti, si veda Category:Command-line shells (Italiano).\n\n"
    },
    {
      "title": "Miglioramenti del completamento tramite Tab",
      "level": 3,
      "content": "È consigliabile impostare correttamente il completamento tramite Tab esteso da subito, come spiegato nell'articolo della shell che avete scelto.\n\n"
    },
    {
      "title": "Alias",
      "level": 3,
      "content": "Definire un'alias per un comando, o per un gruppo di questi, è un modo per risparmiare del tempo quando si utilizza la console. Ciò risulta maggiormente utile per i compiti ripetitivi, che non necessitano di alterazioni significative ai loro parametri nell'intervallo tra le esecuzioni. Le alias per risparmiare tempo di uso comune si possono trovare in Bash#Alias, che sono anche facilmente portatili verso zsh.\n\n"
    },
    {
      "title": "Shell alternative",
      "level": 3,
      "content": "Bash è la shell installata per impostazione predefinita in un sistema Arch. Il supporto di installazione live, tuttavia, utilizza zsh con il contenuto aggiuntivo grml-zsh-config. Vedasi Shell a linea di comando#Elenco delle shell per ulteriori alternative.\n\n"
    },
    {
      "title": "Complementi per Bash",
      "level": 3,
      "content": "Un elenco di insiemi di comandi che includono varie impostazioni per Bash, la ricerca nella cronologia e Readline è disponibile alla voce Bash#Suggerimenti e trucchetti.\n\n"
    },
    {
      "title": "Output a colori",
      "level": 3,
      "content": "Questa sezione è spiegata in Colorare il contenuto in uscita nella console.\n\n"
    },
    {
      "title": "File compressi",
      "level": 3,
      "content": "I file compressi, o archivi, si incontrano di frequente su un sistema GNU/Linux. Tar è uno strumento di archiviazione tra i più comunemente usati e gli utenti dovrebbero avere una certa familiarità con la relativa sintassi (i contenuti di Arch Linux, per esempio, non sono altro che file tarball compressi con zstd). Si veda Archiviazione e compressione.\n\n"
    },
    {
      "title": "Richiesta della console",
      "level": 3,
      "content": "La richiesta della console (PS1) può essere ampiamente personalizzata. Si veda Bash/Personalizzazione della richiesta oppure Zsh#Richieste, se si si utilizza rispettivamente Bash o zsh.\n\n"
    },
    {
      "title": "Shell di Emacs",
      "level": 3,
      "content": "Emacs è noto per l'inclusione di opzioni che sorpassano le funzioni dei normali editor di testo, una di queste è la sostituzione completa della shell. Consultate Emacs#Problemi legati al contenuto in uscita a colori per una soluzione riguardante caratteri che possono risultare rovinati per via dell'output a colori.\n\n"
    },
    {
      "title": "Supporto per il mouse",
      "level": 3,
      "content": "Usare un mouse per le operazioni di copia e incolla nella console può essere preferibile alla tradizionale modalità di copia di GNU Screen. Fate riferimento a Mouse con funzione generale per delle direzioni comprensive. Notate come vi è già possibile farlo negli emulatori del terminale con gli appunti.\n\n"
    },
    {
      "title": "Gestione delle sessioni",
      "level": 3,
      "content": "Utilizzando dei multiplexer del terminale come tmux o GNU Screen, i programmi possono essere eseguiti in delle tab o dei pannelli, che possono essere divisi all'occorenza; così se l'utente dovesse arrestare l'emulatore di terminale, terminare X o chiudere la sessione, i programmi associati alla sessione continueranno ad essere eseguiti in secondo piano, finchè il server del multiplexer del terminale resta attivo. Per poter interagire di nuovo con i programmi è necessario riagganciarsi alla sessione.\n\n"
    }
  ]
}