{
  "title": "Recategorizing Pages",
  "url": "https://wiki.archlinux.org/title/Recategorizing_Pages",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Every article must be categorized: categories are displayed at the bottom of each article (or in a sidebar in the Timeless skin). This page will explain how to set page category, how to create missing categories pages and how to move a page to a different category. For the related style rules, see Help:Style.\n\nArticles and categories used as examples in this article are not real. If you want to practice moving while reading this page, find a real page you want to move.\n\n"
    },
    {
      "title": "Set page category",
      "level": 2,
      "content": "Click Edit at the top of the page. Add the following to the beginning of the text:\n\n```\n[[Category:Some Category]]\n```\n\nUse existing categories when possible: you can find the whole category tree at Table of contents. Only if there is no suitable category for your new article, do save the page with the non-existent category name, but then follow #Create new category page.\n\n"
    },
    {
      "title": "Create new category page",
      "level": 2,
      "content": "After you have saved the page, you will see a \"Category: Some Category\" link at the bottom of the article. If this category does not exist it will be highlighted in red. Click the red link to go to the newly created category.\n\nSet it to be a sub-category of an existing parent category:\n\n```\n[[Category:Parent Category]]\n```\n\nFinally save the category page.\n\nIf you think the new category needs a parent that does not exist yet either, please open a discussion in the new category's talk page instead of creating a whole new tree of categories by yourself.\n\n"
    },
    {
      "title": "Move a page into a different category",
      "level": 2,
      "content": "To move a page into a category, edit the page's [[Category:Some category]] line.\n\nFor example, let us move a fictional page \"ArchWiki Tutorial (Magyar)\" to an appropriate fictional category. (Moving to existing categories is basically the same as moving to non-existing categories.)\n\nClick Edit at the top of the page. Find the following line at the beginning of the text:\n\n```\n[[Category:Help]]\n```\n\nchange it to:\n\n```\n[[Category:Help (Magyar)]]\n```\n\nSave the page by clicking the Save changes button just below the edit box.\n\n"
    },
    {
      "title": "i18n category name",
      "level": 2,
      "content": "Category titles follow the same rules described in Help:i18n#Page titles, but note that they cannot take advantage of Help:i18n#Localized redirects simply because MediaWiki does not support them.\n\n"
    },
    {
      "title": "Category list",
      "level": 2,
      "content": "To find out more about ArchWiki categories:\n\n- Examine the Table of contents.\n- A full list of categories: Special:Categories\n- A list of uncategorized categories: Special:Uncategorizedcategories\n- A list of uncategorized articles: Special:Uncategorizedpages\n- A list of empty categories: Special:Unusedcategories\n\n"
    }
  ]
}