{
  "title": "Rescached",
  "url": "https://wiki.archlinux.org/title/Rescached",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Domain name resolution\n\nrescached is a daemon that caching internet name and address on local memory for speeding up DNS resolution.\n\nrescached is not a reimplementation of a DNS server like BIND. The primary goal of rescached is only to cache DNS queries and answers to minimize unneeded traffic to the outside network. It is intended for personal systems or serving a small group of users.\n\n"
    },
    {
      "title": "Features",
      "level": 2,
      "content": "List of current features,\n\n- Enable to handle request from UDP and TCP connections\n- Enable to forward request using UDP or TCP\n- Load and serve addresses and host names in /etc/hosts\n- Load and serve hosts formatted files inside directory /etc/rescached/hosts.d/\n- Blocking ads and/or malicious websites through host list in /etc/rescached/hosts.d/\n- Support loading and serving zone file format from /etc/rescached/zone.d/\n- Integration with openresolv\n- Support DNS over TLS (DoT) (RFC:7858)\n- Support DNS over HTTPS (DoH) (RFC:8484)\n\n"
    },
    {
      "title": "How cache in rescached works",
      "level": 2,
      "content": "Each DNS record in cache have the time last accessed field, which defined how the cache will be ordered in memory. The last queried host-name will be at the bottom of cache list, and the oldest queried host-name will at the top of cache list.\n\nThe following table illustrate list of caches in memory,\n\nTable content:\nAccessed At | Hostname\n2018-01-01 00:00:01 | kilabit.info\n2018-01-01 00:00:02 | archlinux.org\n... | ...\n2018-01-01 00:01:00 | wiki.archlinux.org\n\nEvery cache.prune_delay (let say every 5 minutes), rescached will try to pruning old records from cache. If the accessed-at value of record in cache is less than current-time + cache.threshold (remember that \"cache.threshold\" value must be negative) it will remove the record from cache.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the rescached-gitAUR package.\n\n"
    },
    {
      "title": "Post-installation configuration",
      "level": 2,
      "content": "The default configuration enables a direct start of the daemon.\n\nRescached configuration resides in /etc/rescached/rescached.cfg. Select entries to change are:\n\n- Set your parent DNS server\n\n- Set the cache prune delay and threshold\n\nAfter editing the configuration file, modify the resolv.conf file and replace the current set of resolver addresses with loopback address\n\n```\nnameserver 127.0.0.1\n```\n\nOther programs may overwrite this setting; see Domain name resolution#Overwriting of /etc/resolv.conf for details.\n\nFinally, enable and start rescached.service.\n\n"
    },
    {
      "title": "Integration with OpenResolv",
      "level": 2,
      "content": "Rescached can detect change on resolv.conf file generated by resolvconf. To use this feature set the file.resolvconf to /etc/rescached/resolv.conf in configuration file. In /etc/resolvconf.conf set either dnsmasq_resolv, pdnsd_resolv, or unbound_conf to point to the same file /etc/rescached/resolv.conf.\n\n"
    },
    {
      "title": "Web user interface",
      "level": 2,
      "content": "The rescached service provide a web user interface that can be accessed at http://127.0.0.1:5380. The following user interfaces are available on the latest release,\n\nThe front page allow user to monitor active caches, query the caches, and removing the caches.\n\nThe Environment page allow user to modify the rescached configuration on the fly.\n\nThe Hosts Blocks page allow user to enable or disable the external sources of hosts blocks list.\n\nThe Hosts.d page allow user to manage hosts file, creating new hosts file, create new record, or delete a record.\n\nThe Zone.d page allow user manage zone file, creating new zone file, adding or deleting new resource record in the zone file.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- For more information and configuration see rescached.cfg(5) once installed\n- Report bug and feature requests are preferred on the GitHub\n\n"
    }
  ]
}