{
  "title": "Retroarch",
  "url": "https://wiki.archlinux.org/title/Retroarch",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "RetroArch is the reference implementation of the libretro API. It is a modular front-end for video game system emulators, game engines, video games, media players and other applications that offers several uncommon technical features such as multi-pass shader support, real-time rewinding and video recording (using FFmpeg), it also features a gamepad-driven UI on top of a full-featured command-line interface.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the retroarch package or alternatively retroarch-gitAUR for the development version.\n\n- Install retroarch-assets-xmb to get the fonts and icons for the RetroArch GUI. You may also want to install retroarch-assets-ozone for a more desktop-friendly GUI.\n- Install retroarch-standalone-serviceAUR to get system user, system service and RetroArch configuration for standalone game-box. Then start and/or enable retroarch-standalone.service.\n- Install retroarch-steam-launcherAUR to map the retroarch in your PATH to the Steam installation of retroarch. This can be useful for using Steam features, such as cloud saves, with applications like emulationstation-deAUR which use retroarch from the PATH.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "RetroArch relies on separate libraries, called \"cores\", for most of its functionality. These can be downloaded per-user within RetroArch itself (via the libretro Buildbot) or you can install them system-wide with libretro or AUR.\n\nBy default RetroArch is configured to load the per-user cores that it downloads. Change your #Configuration if you install them elsewhere.\n\nThe command to run a particular core is\n\n```\n$ retroarch --libretro /path/to/some_core_libretro.so /path/to/rom\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "When you first run RetroArch it will create the user configuration file ~/.config/retroarch/retroarch.cfg.\n\nIf you install RetroArch components in your home-directory, you should specify local paths in the global configuration file for downloading cores. For example,\n\n```\n~/.config/retroarch/retroarch.cfg\n```\n\n```\nlibretro_directory = \"~/.config/retroarch/cores\"\nlibretro_info_path = \"~/.config/retroarch/cores/info\"\n```\n\nIf you install any RetroArch components system-wide with pacman, you should specify these in the global configuration file and include them in your user file. For example,\n\n```\n/etc/retroarch.cfg\n```\n\n```\n# for retroarch-assets-xmb\nassets_directory = \"/usr/share/retroarch/assets\"\n# for libretro-core-info\nlibretro_info_path = \"/usr/share/libretro/info\"\n# for libretro cores\nlibretro_directory = \"/usr/lib/libretro\"\n```\n\n```\n~/.config/retroarch/retroarch.cfg\n```\n\n```\n#include \"/etc/retroarch.cfg\"\n```\n\nNote: **and** \n\nIf you want to override your configuration (for example when running certain cores) you can use the --appendconfig /path/to/config command line option.\n\n"
    },
    {
      "title": "Enabling the \"Online Updater\"",
      "level": 3,
      "content": "If you prefer to install all RetroArch components with the built in updater instead of pacman, you can enable it with a configuration file:\n\n```\n~/.config/retroarch/retroarch.cfg\n```\n\n```\nmenu_show_core_updater = \"true\"\n```\n\n"
    },
    {
      "title": "Enabling \"SaveRAM Autosave Interval\"",
      "level": 3,
      "content": "By default, RetroArch only writes SRAM onto disk when it exits without error, which means that there is a risk of losing save data when using crash-prone cores. To change this behavior, open ~/.config/retroarch/retroarch.cfg and set autosave_interval to n.\n\n```\n~/.config/retroarch/retroarch.cfg\n```\n\n```\nautosave_interval = \"600\"\n```\n\nWith the example above, RetroArch will write SRAM changes onto disk every 600 seconds.\n\n"
    },
    {
      "title": "Filters and shaders",
      "level": 3,
      "content": "RetroArch can load CG shaders, which are considered old and deprecated, as well as GLSL and Slang shaders.[2] The shaders can be obtained and updated directly inside RetroArch using the Online Updater.\n\n"
    },
    {
      "title": "Reset settings to their default value",
      "level": 3,
      "content": "To reset a setting or keybind to its default value through the GUI, highlight it and press Start. To remove a button from a keybind, highlight the keybind and press Y.\n\n"
    },
    {
      "title": "No cores found",
      "level": 3,
      "content": "By default RetroArch searches for cores in ~/.config/retroarch/cores, which is where the Online Updater installs them. Cores installed with pacman are placed in /usr/lib/libretro and thus will not appear in RetroArch's GUI. You should choose one method of installing cores (pacman or the Online Updater) and change your configuration to match.\n\n"
    },
    {
      "title": "Input devices do not operate",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nYou may encounter problems if running on a CLI or a display server other than Xorg or if you use the udev input driver, because /dev/input nodes are limited to root-only access. Try adding your user to the input user group then logging in again.\n\nAlternatively, manually add a rule in /etc/udev/rules.d/99-evdev.rules, with KERNEL==\"event*\", NAME=\"input/%k\", MODE=\"666\" as its contents. Reload udev rules by running:\n\n```\n# udevadm control --reload-rules\n```\n\nIf rebooting the system or replugging the devices are not options, permissions may be forced using:\n\n```\n# chmod 666 /dev/input/event*\n```\n\n"
    },
    {
      "title": "Poor video performance",
      "level": 3,
      "content": "If poor video performance is met, RetroArch may be run on a separate thread by setting video_threaded = true in ~/.config/retroarch/retroarch.cfg.\n\nThis is, however, a solution that should be not be used if tweaking RetroArch's video resolution/refresh rate fixes the problem, as it makes perfect V-Sync impossible, and slightly increases latency.\n\n"
    },
    {
      "title": "Audio issues with ALSA",
      "level": 3,
      "content": "When using ALSA the audio_out_rate must match the system's default output rate, usually 48000.\n\n"
    },
    {
      "title": "Save data is lost whenever RetroArch crashes",
      "level": 3,
      "content": "See #Enabling \"SaveRAM Autosave Interval\".\n\n"
    },
    {
      "title": "Start game from playlist but reports 'No Items'",
      "level": 3,
      "content": "If RetroArch reports libretro core requires contents, but nothing provided, try to load game by manually choosing the path of the ROM from Main Menu > Load Content. It seems unreliable to start game from playlist.\n\nIt is necessary to force launch RetroArch in Xwayland.\n\n```\n$ WAYLAND_DISPLAY=\"\" retroarch\n```\n\nYou can check the log with --verbose option, there should be Found vulkan context: \"vk_x\" instead \"vk_wayland\"\n\n"
    },
    {
      "title": "BIOS files are missing or not accepted",
      "level": 3,
      "content": "Retroarchs cores are looking for BIOS files at the location set with the system_directory option in retroarch.cfg.\n\nThe GUI menu Settings > Directory > System/BIOS shows the directory as well.\n\nSome of the cores require the files directly in this directory. Other cores need a subdirectory within this directory with a specific name for their specific BIOS files. Some cores even look for their files in the same directory as the ROM file they try to run.\n\nEvery installed core provides information on needed files, their MD5 sums and the directory they need to be placed in. You can find this information in the GUI menu under Settings > Core > Manage Core. Choose a core here to get information on the needed BIOS files for this specific core. RetroArch describes them as \"firmware\" files on the core info pages.\n\nFurther in depth info on BIOS files for many of the supported cores can be found in the official documentation. [3]\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Website\n- RetroArch wiki on GitHub\n- Documentation for developers\n\n"
    }
  ]
}