{
  "title": "Saber",
  "url": "https://wiki.archlinux.org/title/Saber",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Xournal++\n\nSaber is an open source cross platform handwritten notes app licensed under GPLv3.0.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the saberAUR package, please read #Building for steps to successfully build the saber package.\n\n"
    },
    {
      "title": "Building",
      "level": 3,
      "content": "Due to complications with flutter, saber requires manual intervention to build the package.\n\nNote: **must** \n\n1. Install flutterAUR and rustup.\n1. Set the stable toolchain as the default, to prevent flutter throwing an error: $ rustup default stable\n1. Fix known flutter issues on Arch Linux: $ git config --global --add safe.directory /opt/flutter See User:Gromit/Flutter package guidelines#Ownership problems, or permission denial for more information.\n\n```\n$ rustup default stable\n```\n\n```\n$ git config --global --add safe.directory /opt/flutter\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Saber is a graphical User Interface (GUI), all configuration is done via the settings menu on the left sidebar.\n\n"
    },
    {
      "title": "Integration with nextcloud",
      "level": 3,
      "content": "Saber provides an integration with nextcloud to allow synchronisation of notes between multiple devices. It also provides redundancy which removes the worry of notes being lost due to device failure.\n\nBy default, Saber is configured to use saber's official instance provided by the upstream developer Adil Hanney.\n\n"
    },
    {
      "title": "Using the default nextcloud instance",
      "level": 4,
      "content": "- Register an account (if you have not done so already)\n- Open the Settings menu on the right toolbar (settings icon)\n- Click the Logged out widget at the top of the settings page, this will bring you to the Login page\n- Enter the email address and password you used when you registered your account, the encryption password should be a password unique to you, which will only be stored on your client, this is used as a key to encrypt and decrypt the notes you write for privacy, you must remember this otherwise you will not be able to decrypt your notes on other devices.\n\n"
    },
    {
      "title": "Using a third party nextcloud instance",
      "level": 4,
      "content": "Nextcloud has multiple providers which you can pick from, or use a provider which is not listed here.\n\nSaber's official nextcloud instance is stock and contains no modifications to the API, allowing you to use any provider which has not modified nextcloud's protocol.\n\nTo use a third party nextcloud provider, register an account on the corresponding web interface, and then follow the same login instructions in #Using the default nextcloud instance, ensure to check the I want to use a Custom Nextcloud Server box, and then enter the providers url in the Custom server URL box, otherwise you will not be able to authenticate.\n\n"
    },
    {
      "title": "Self hosting a nextcloud instance",
      "level": 4,
      "content": "If you would like to self host the nextcloud instance for saber, follow the installation guide Nextcloud#Installation and then the setup/configuration guide Nextcloud#Configuration.\n\nAfter your instance is setup, create yourself a user and follow the same login instructions in #Using the default nextcloud instance, ensure you check I want to use a Custom Nextcloud Server, and enter the url of your nextcloud instance in the Custom server URL box.\n\n"
    }
  ]
}