{
  "title": "Shairport",
  "url": "https://wiki.archlinux.org/title/Shairport",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Shairport Sync is an AirPlay audio player — it plays audio streamed from iTunes, iOS devices and third-party AirPlay sources such as ForkedDaapd and others. Audio played by a Shairport Sync-powered device stays synchronised with the source and hence with similar devices playing the same source. In this way, synchronised multi-room audio is possible without difficulty.\n\nShairport Sync does not support AirPlay video or photo streaming.\n\nShairport Sync is a fork of the original Shairport which was based on reverse-engineering Apple's key used in its AirPort Express. Be advised that this functionality may be removed at Apple's discretion.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the shairport-sync package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The configuration file can be found at /etc/shairport-sync.conf. It contains useful comments and configuration hints. More documentation is available in the README file.\n\n"
    },
    {
      "title": "Audio backend",
      "level": 3,
      "content": "Shairport Sync works well with PulseAudio, while the timing information is not as accurate as that of ALSA or sndio, it is often impractical to remove or disable PulseAudio. In that case, the pa backend can be used.[1]\n\nIf you would like to change the backend, check the list of output devices, e.g. by using tools from alsa-utils, and look at the raw audio device, like:\n\n```\n$ aplay -L\n```\n\n```\n...\nsysdefault:CARD=PCH\n    HDA Intel PCH, ALC269VC Analog\n    Default Audio Device\n...\n```\n\nThen add the device name:\n\n```\n/etc/shairport-sync.conf\n```\n\n```\n// These are parameters for the \"alsa\" audio back end.\n// For this section to be operative, Shairport Sync must be built with the following configuration flag:\n// --with-alsa\nalsa =\n{\n    output_device = \"sysdefault\";\n}\n```\n\n"
    },
    {
      "title": "Starting",
      "level": 3,
      "content": "Start/enable shairport-sync.service.\n\n"
    },
    {
      "title": "Daemon Setup",
      "level": 3,
      "content": "If you want to run shairport-sync as a daemon you will need to have a folder created in /run which is a tempfs by default in Arch Linux. To have a folder created automatically on boot create a tempfiles configuration file, for example:\n\n```\n/usr/lib/tmpfiles.d/shairport-sync.conf\n```\n\n```\nd /run/shairport-sync 0755 username group\n```\n\nyou can now use shairport-sync -d to run shairport-sync as a daemon, and shairport-sync -k to kill the daemon.\n\n"
    },
    {
      "title": "User service",
      "level": 2,
      "content": "According to the author, the PulseAudio backend with the default PulseAudio configuration can only work as a user service. As of 2022-01-27, it seems to just work as a system service with pulseaudio (pipewire-pulse) without modification, not needing the user service.\n\nTo run shairport-sync as user daemon, you can add it to the desktop environment autostart, or enable shairport-sync.service as a user unit.\n\nNext, edit shairport-sync.service and comment out the next lines:\n\n```\n[Unit]\n...\n#Requires=avahi-daemon.service\n#After=avahi-daemon.service\n...\n[Service]\n...\n#User=shairport-sync\n#Group=shairport-sync\n...\n```\n\nNow, you are ready to enable/start shairport-sync.service as user:\n\nTo obtain logs, use the journal or check the unit status.\n\n"
    }
  ]
}