{
  "title": "Swap criptografada",
  "url": "https://wiki.archlinux.org/title/Swap_criptografada",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Dependendo da necessidade, diferentes métodos podem ser usados para criptografar a partição swap. Uma configuração onde a partição swap é criptografada na inicialização oferece maior proteção dos dados, devido a evitar uma situação onde fragmentos de arquivos sensíveis colocados lá, e que não foram sobrescrevidos, estejam alcançáveis. No entanto, criptografar a swap em cada inicialização impossibilita a suspensão para o disco.\n\n"
    },
    {
      "title": "Sem suporte a suspender para o disco",
      "level": 2,
      "content": "Em sistemas onde suspender para o disco (hibernação) não é desejado, /etc/crypttab pode ser usado para abrir a partição swap com uma senha randômica com o modo plain do dm-crypt no tempo de inicialização. Ao desligar o sistema, a senha aleartória é descartada, fazendo os dados criptografados inacessíveis.\n\nPara habilitar esta funcionalidade, simplesmente descomente a linha que começa com swap no /etc/crypttab. Mude o parâmetro <dispositivo> para seu dispositivo swap. Por exemplo, deve parecer com:\n\n```\n/etc/crypttab\n```\n\n```\n# <name>  <device>    <password>     <options>\nswap      /dev/sdX#   /dev/urandom   swap,cipher=aes-xts-plain64,size=256\n```\n\nIsto vai mapear /dev/sdX# para /dev/mapper/swap e assim esta pode ser adicionada em /etc/fstab como uma swap normal. Se você tinha uma partição swap não criptografada antes, não se esqueça de desabilitá-la - ou reutilizar sua entrada do fstab ao mudar o dispositivo para /dev/mapper/swap. As opções padrão devem ser o suficiente para a maioria dos usuários. Para outras opções e uma explicação de cada coluna, veja crypttab(5) e também 2.3 do FAQ do cryptsetup.\n\nNote: **deletado** \n\n- Usar caminhos do by-id e by-path. No entanto, estes dois são sucetíveis a mudanças no hardware. Veja nomeação persistente de dispositivo de bloco#by-id e by-path.\n- Usar um nome do volume lógico do LVM.\n- Usar o método descrito em #UUID e LABEL. Labels e UUIDS não podem ser usados diretamente devido a criação e encriptação do dispositivo swap a cada inicialização com mkswap, veja o FAQ do cryptsetup.\n\nPara usar o nomeação persistente by-id, primeiro identifique o dispositivo swap:\n\n```\n# find -L /dev/disk -samefile /dev/sdX#\n```\n\n```\n/dev/disk/by-id/ata-WDC_WD2500BEVT-22ZCT0_WD-WXE908VF0470-partX\n/dev/disk/by-id/wwn-0x60015ee0000b237f-partX\n```\n\nEntão o use como uma referência persistente para a partição (se dois resultados são retornados como acima, use qualquer um deles):\n\n```\n/etc/crypttab\n```\n\n```\n# <name>  <device>                                                         <password>     <options>\nswap      /dev/disk/by-id/ata-WDC_WD2500BEVT-22ZCT0_WD-WXE908VF0470-partX  /dev/urandom   swap,cipher=aes-cbc-essiv:sha256,size=256\n```\n\nDepois de inicializar para ativar a swap criptografada, você vai notar que ao rodar swapon -s vai ser mostrado uma entrada arbitária para o dispositivo mapeado (exemplo, /dev/dm-1), enquanto o comando lsblk mostra crypt na coluna FSTYPE. Devido a cada inicialização ser criptografada novamente, o UUID de /dev/mapper/swap vai mudar toda vez.\n\n"
    },
    {
      "title": "UUID e LABEL",
      "level": 3,
      "content": "É perigoso usar a nomeação simples de dispositivos do kernel, como /dev/sdX# e /dev/disk/by-id/ata-SERIAL-partX, para criptografar a swap com o crypttab. Uma pequena mudança no nome dos dispositivos ou particionamento pode acarretar na perda de seus dados na próxima inicialização. O mesmo se você usar o PARTUUID e então usar esta partição para alguma outra coisa e se esquecer de remover a respectiva entrada do crypttab.\n\nÉ mais confiável identificar a partição correta ao dar um genuíno UUID ou LABEL. Por padrão isto não funciona devido ao dm-crypt e mkswap sobrescreverem qualquer coisa presente na partição, incluindo o UUID e LABEL. No entanto é possível especificar o início (offset) da swap. Isto permite criar um minúsculo e vazio sistema de arquivos com o objetivo de prover um UUID ou LABEL persistente para a encriptação da swap.\n\nCrie um sistema de arquivos, com uma LABEL de sua escolha:\n\n```\n# mkfs.ext2 -L cryptswap /dev/sdX# 1M\n```\n\nO parâmetro não usual depois do nome do dispositivo limita o tamanho do sistema de arquivos para 1 MiB, deixando espaço para a swap criptografada.\n\n```\n# blkid /dev/sdX#\n```\n\n```\n/dev/sdX#: LABEL=\"cryptswap\" UUID=\"b72c384e-bd3c-49aa-b7a7-a28ea81a2605\" TYPE=\"ext2\"\n```\n\nCom isso, /dev/sdX# agora pode facilmente ser identificada por ambos UUID ou LABEL, independente do nome do dispositivo ou até mesmo o número da partição que podem mudar no futuro. Modifique as entradas do /etc/crypttab e /etc/fstab:\n\n```\n/etc/crypttab\n```\n\n```\n# <name> <device>             <password>    <options>\nswap     LABEL=cryptswap      /dev/urandom  swap,offset=2048,cipher=aes-xts-plain64,size=512\n```\n\nObserve o offset: são 2048 setores de 512 bytes, então 1 MiB. Desta maneira a swap criptografada não vai afetar o LABEL/UUID do sistema de arquivos, e o alinhamento de dados vai funcionar também.\n\n```\n/etc/fstab\n```\n\n```\n# <filesystem>     <dir>  <type>  <options>  <dump>  <pass>\n/dev/mapper/swap   none   swap    defaults   0       0\n```\n\nAo usar esta configuração, o cryptswap vai somente usar a partição com o LABEL correspondente, independente do que o nome do dispositivo pode ser. Se você decidir formatar e usar a partição para outra coisa, o LABEL vai ser perdido, logo, na próxima inicialização nada deve ser sobrescrito.\n\n"
    },
    {
      "title": "Desabilitando hibernação nos ambientes desktop",
      "level": 3,
      "content": "Ambientes desktop podem não detectar automaticamente que a partição swap é randomicamente criptografada e não pode ser usada para suspender para o disco.\n\nXfce pode ser configurado para esconder seu botão de Hibernação ao executar este comando:\n\n```\n$ xfconf-query -c xfce4-session -np /shutdown/ShowHibernate -t bool -s false\n```\n\n"
    },
    {
      "title": "Com suporte a suspender para o disco",
      "level": 2,
      "content": "Para resumir depois de suspender o computador para o disco (hibernar), é necessário manter o espaço swap intacto. Por isso, tenha uma partição ou arquivo swap criptografada com LUKS, que pode ser guardada no disco ou colocada na inicialização.\n\nOs três seguintes métodos são alternativas que possibilitam suspender para o disco. Se você aplicar qualquer uma delas, entenda que dados críticos podem ter sido colocados na swap e potencialmente permanecer por um longo período de tempo (até que sejam sobrescritos). Para reduzir o risco, considere montar um sistema que criptografa a swap novamente, por exemplo, a cada vez que o sistema é desligado normalmente, junto com o método de sua escolha.\n\n"
    },
    {
      "title": "LVM dentro do LUKS",
      "level": 3,
      "content": "Se o swap está no grupo de volumes lógicos que é ativado no initramfs, simplesmente siga as instruções em Hibernação.\n\n"
    },
    {
      "title": "Usando uma partição swap",
      "level": 3,
      "content": "Para resumir de uma partição swap criptografada, esta deve ser aberta durante o initramfs.\n\n- Quando usar o initramfs padrão baseado no busybox com o hook encrypt, siga as instruções em #Hook do mkinitcpio.\n- Quando usar o initramfs baseado no systemd com o hook sd-encrypt, adicione os parâmetros adicionais do rd.luks para abrir a partição swap.\n\n"
    },
    {
      "title": "Hook do mkinitcpio",
      "level": 4,
      "content": "Se o swap está em um dispositivo diferente do sistema de arquivos da partição raiz, este não vai ser aberto pelo hook encrypt, o resume vai tomar lugar antes que o /etc/crypttab seja lido, por isso é necessário criar um hook e colocá-lo em /etc/mkinitcpio.conf para abrir o dispositivo swap criptografado com LUKS antes dessa situação.\n\nSe você deseja usar a partição que é atualmente usada pelo sistema, você vai ter que desativá-la primeiro:\n\n```\n# swapoff /dev/<dispositivo>\n```\n\nTenha certeza de remover qualquer linha em /etc/crypttab apontando para este dispositivo.\n\nSe você está usando uma partição swap existente, e esta está numa tabela de partição GPT, você vai precisar usar o gdisk para definir o atributo de partição 63 \"do not automount\" (\"não monte automaticamente\") nela. Isto vai prevenir o systemd-gpt-auto-generator de descobrir e habilitar a partição na inicialização.\n\nA seguinte configuração tem a desvantagem de inserir manualmente uma senha adicional para a partição swap toda vez que ligar o sistema.\n\nFormate o container criptografado para a partição swap, crie um espaço de chave para uma senha memorizável.\n\n```\n# cryptsetup luksFormat /dev/<dispositivo>\n```\n\nAbra a partição em /dev/mapper:\n\n```\n# cryptsetup open /dev/<dispositivo> dispositivoSwap\n```\n\nCrie o sistema de arquivos para a swap dentro da partição mapeada:\n\n```\n# mkswap /dev/mapper/dispositivoSwap\n```\n\nAgora faça um hook para abrir a swap na inicialização. Você pode instalar e configurar o mkinitcpio-openswapAUR, ou seguir as seguintes instruções. Crie um arquivo contendo o seguinte comando de abertura:\n\n```\n/etc/initcpio/hooks/openswap\n```\n\n```\nrun_hook ()\n{\n    cryptsetup open /dev/<dispositivo> dispositivoSwap\n}\n```\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nPara abrir o dispositivo swap ao digitar a senha ou\n\n```\n/etc/initcpio/hooks/openswap\n```\n\n```\nrun_hook ()\n{\n    ## opcional: Para evitar condição de corrida\n    x=0;\n    while [ ! -b /dev/mapper/<dispositivo-raiz> ] && [ $x -le 10 ]; do\n       x=$((x+1))\n       sleep .2\n    done\n    ## Fim do opcional\n\n    mkdir dispositivo_da_chave\n    mount /dev/mapper/<dispositivo-raiz> dispositivo_da_chave\n    cryptsetup open --key-file dispositivo_da_chave/<caminho-para-a-chave> /dev/<dispositivo> dispositivoSwap\n    umount dispositivo_da_chave\n}\n```\n\nPara abrir o dispositivo swap com uma keyfile do dispositivo raiz criptografado.\n\nEm alguns computadores, condições de corrida podem ocorrer quando o mkinitcpio tenta montar o dispositivo antes dele ser aberto e a enumeração de dispositivos ainda está incompleta. O bloco opcional vai atrasar o processo de inicialização em 2 segundos até que o dispositivo raiz esteja pronto para ser montado.\n\nCrie e edite o arquivo de configuração do hook:\n\n```\n/etc/initcpio/install/openswap\n```\n\n```\nbuild ()\n{\n   add_runscript\n}\nhelp ()\n{\ncat<<HELPEOF\n  Isto abre a partição swap criptografada /dev/<dispositivo> em /dev/mapper/dispositivoSwap\nHELPEOF\n}\n```\n\nAdicione o hook openswap no vetor HOOKS no /etc/mkinitcpio.conf, entre encrypt e filesystems. Não se esqueça de adicionar o hook resume depois de openswap\n\n```\nHOOKS=(... encrypt openswap resume filesystems ...)\n```\n\nGere novamente o initramfs.\n\nColoque a partição mapeada no /etc/fstab ao adicionar a seguinte linha:\n\n```\n/dev/mapper/dispositivoSwap swap swap defaults 0 0\n```\n\nConfigure seu sistema para resumir com o /dev/mapper/dispositivoSwap. Por exemplo, se você usa GRUB com suporte a hibernação do kernel, adicione o parâmetro do kernel resume=/dev/mapper/dispositivoSwap na variável GRUB_CMDLINE_LINUX_DEFAULT em /etc/default/grub. Uma linha do kernel com a raiz e swap criptografada pode parecer com isso:\n\n```\nkernel /vmlinuz-linux cryptdevice=/dev/sda2:raiz root=/dev/mapper/raiz resume=/dev/mapper/dispositivoSwap ro\n```\n\nNa inicialização, o hook openswap vai abrir a partição swap para que o kernel possa usá-la. Se você usar hooks especiais para resumir da hibernação, tenha certeza de que eles estão depois do openswap no vetor HOOKS. Note que devido ao initrd abrir a swap, não é necessário ter uma entrada para dispositivoSwap em /etc/crypttab.\n\n"
    },
    {
      "title": "Usando um arquivo swap",
      "level": 3,
      "content": "Um arquivo swap pode ser usado para reservar um espaço swap dentro de uma partição existente e isto também pode ser feito dentro de uma partição criptografada.\n\nSiga as instruções para criação do arquivo swap em Swap#Arquivo swap e configure a hibernação de acordo com Suspensão e hibernação#Adquirindo o offset de um arquivo swap.\n\n"
    },
    {
      "title": "Problemas conhecidos",
      "level": 2,
      "content": "- Stopped (with error) /dev/dm-1 nos logs. Veja a issue do systemd 1620.\n\n"
    }
  ]
}