{
  "title": "Teclado Ficihp K2",
  "url": "https://wiki.archlinux.org/title/Teclado_Ficihp_K2",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O Ficihp K2 (pronuncia-se em inglês \"Fitip\" com p mudo) é um teclado mecânico com tela de 12,6 polegadas (320 mm) 1920x515 e tela sensível ao toque na parte superior do teclado. O teclado também possui iluminação RGB em cada tecla. A programação do teclado parece ser independente do computador ao qual está conectado, pois as configurações podem ser modificadas sem a necessidade de software RGB (por exemplo, OpenRGB) no computador host.\n\n"
    },
    {
      "title": "Aplicação",
      "level": 2,
      "content": "A tela funciona bem. É ideal para quem precisa de um display de painel. No entanto, a tela sensível ao toque precisa ser calibrada. Algo que este artigo deveria discutir.\n\nOs usuários do Windows usam programas que possuem controles de edição removíveis na tela do teclado, enquanto outros usuários os usam para colocar seus reprodutores de música, feed de programas de bate-papo ou outros painéis de utilitários na tela menor.\n\n"
    },
    {
      "title": "Conexão",
      "level": 3,
      "content": "O teclado se conecta ao computador via cabo para: USB-C <-> USB-C ou USB-C <-> dois cabos USB-A e uma porta HDMI. A conexão USB-C se conecta ao teclado; no entanto, existem duas portas USB-A na borda superior deste teclado que atuam como uma conexão de passagem para dispositivos como um mouse.\n\n"
    },
    {
      "title": "Layout do teclado",
      "level": 3,
      "content": "O teclado possui 71 teclas com interruptores mecânicos azuis que podem ser substituídos. O layout do teclado não possui uma linha de teclas de função, mas há uma tecla Escape na linha numérica. A tecla Backtick/Tilde pode ser acessada mantendo pressionada a tecla Fn e pressionando Escape para o backtick. Adicionar Shift a esta sequência produzirá o til. A tecla Fn também é como as teclas numéricas (1-9 e 0, assim como + e as teclas =) atuam como F1 através das teclas F12.\n\nAlém disso, algumas das outras teclas F (embora não marcadas) podem controlar a reprodução de mídia em um reprodutor de mídia.\n\nAs teclas de seta estão no lado inferior direito, onde acima delas estão sete teclas utilitárias Ins, Del, Pause, Home, End, PgUp e PgDn.\n\n"
    },
    {
      "title": "Outros controles",
      "level": 3,
      "content": "Existem três botões na borda superior da tela para navegar pela exibição na tela deste dispositivo.\n\n"
    },
    {
      "title": "Exibição",
      "level": 3,
      "content": "Este teclado possui uma tela de 12,6 polegadas (320 mm) 1920x515 com uma tela sensível ao toque na parte superior do teclado. De acordo com a documentação em seu manual, ele suporta 45% da gama de cores e possui proporção de escala de 3:1 e taxa de atualização de 60 Hz.\n\n"
    },
    {
      "title": "Iluminação de fundo RGB",
      "level": 3,
      "content": "A iluminação RBG sob cada tecla é controlada usando Fn. A programação parece ser independente do dispositivo host, o que significa que um programa como OpenRGB provavelmente não terá a capacidade de manipular esse recurso.\n\n"
    },
    {
      "title": "Informações Técnicas",
      "level": 2,
      "content": "As informações sobre este dispositivo foram detectadas usando um computador que estava usando o gerenciador de janelas Sway usando sway-input e sway-output para detectar informações sobre o dispositivo.\n\nComo o dispositivo estava conectado a um dispositivo que não tinha uma porta USB-C disponível, ele foi conectado usando as duas portas USB-A e a porta HDMI.\n\n"
    },
    {
      "title": "Saída",
      "level": 3,
      "content": "Com a configuração 2 USB-A e HDMI, sway-output relatou que o dispositivo estava conectado a um dispositivo chamado HDMI-A-1. A marca era Unknown, o modelo foi listado como KEYBOARD e a listagem de série foi listada como KEYBOARD-1118.\n\n"
    },
    {
      "title": "Entrada",
      "level": 3,
      "content": "sway-input forneceu mais informações sobre este dispositivo, incluindo identificador, nome, fornecedor e número do produto.\n\nO identificador era 9282:3:USB_HID_Gaming_Keyboard. O nome do dispositivo era teclado para jogos USB HID. O ID do fornecedor foi listado como 9282 e o número do produto 3. O tipo foi listado como teclado.\n\nOutro dispositivo foi listado com um tipo de pointer. O identificador deste dispositivo foi listado como 9282:3:USB_HID_Gaming_Keyboard_Consumer_Control. Um terceiro dispositivo foi listado com o mesmo identificador, mas com um tipo de keyboard semelhante à primeira listagem, mas com o mesmo identificador do dispositivo apontador.\n\nOutro dispositivo listou seu identificador como 9282:3:USB_HID_Gaming_Keyboard_Mouse com um tipo de pointer.\n\nFinalmente, mais dois dispositivos com o identificador 10473:650:GigaDevice_GD32_custom_HID_in_FS_Mode_V1.06 listados como tipos touch e pointer. libinput relatou que cada um desses itens tinha uma calibration_matrix que provavelmente precisa ser mapeada para o tamanho da tela, pois inicialmente metade da tela não estava interagindo corretamente.\n\n"
    }
  ]
}