{
  "title": "Tomb",
  "url": "https://wiki.archlinux.org/title/Tomb",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Data-at-rest encryption\n- dm-crypt\n- TrueCrypt\n- Tcplay\n\nFrom the official website:\n\nTomb aims to be a really simple to use software to manage \"encrypted directories\", called tombs. A tomb can only be opened if you both have a keyfile and you know the password. It also has advanced features, like steganography.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install tombAUR or tomb-gitAUR.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Tomb is meant to be used from the console as a single, non-interactive script. it also provides tomb-open, which is a simple interactive script to help you create a tomb, open it, retrieve keys from USB.\n\nTombs are operated from a terminal commandline and require root access to the machine (or just sudo access to the script).\n\nTo create a 100 MiB tomb called \"secret\" do:\n\n```\n# tomb dig -s 100 secret.tomb\n# tomb forge secret.tomb.key\n# tomb lock secret.tomb -k secret.tomb.key\n```\n\nTo open it, do:\n\n```\n# tomb open secret.tomb -k secret.tomb.key\n```\n\nAnd after you are done:\n\n```\n# tomb close\n```\n\nFor more information see tomb -h and man tomb.\n\n"
    },
    {
      "title": "Advanced features",
      "level": 2,
      "content": "The advanced features are:\n\n- steganography to hide the key inside a jpeg/wav file.\n- bind hooks: can automatically apply a mount to a subdirectory inside a tomb with the --bind operation to one outside. Suppose, for example, you would like to encrypt your Documents directory. Then you can create a tomb which contains it (and others too, if you want) and create a simple configuration file inside the tomb itself. When you run tomb open it will automatically bind the directories into the right places. This way you will easily get an encrypted documents folder, browser profile, or maildir.\n- post hooks: commands that are run when the tomb is opened, or closed. You can imagine lot of things for this: open files inside the tomb, put your computer in a \"paranoid\" status (for example, disabling swap), etc.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- manpage (available as pdf also)\n- home page\n- quickstart\n\n"
    }
  ]
}