{
  "title": "Toshiba Satellite L300",
  "url": "https://wiki.archlinux.org/title/Toshiba_Satellite_L300",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU | 8086:2a02 | Yes\nWebcam | 04f2:b070 | Yes\nEthernet | 10ec:8136 | Yes\nSD-card reader |  | Yes\nAudio | 8086:284b | Yes\nWireless | 168c:002a | Yes\nPCMCIA |  | Untested\nModem |  | Untested\n\nThis document applies to the entire L300 series, in particular the L300-OG1 and L300-12K.\n\nIf your laptop is eligible to a BIOS update and has a version lower than v2.20 you probably have fan control problems and the Fn key and PC speaker might not work. See below for a method to upgrade your BIOS.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The appearance of the BIOS is pretty simple (blue or dark grey on a light grey background), so it might work well with OCR software. It is fully keyboard driven.\n\nThe BIOS is accessed with the F2 key, while F12 opens the boot device selection menu.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "This device uses a BIOS, it will not be supported by fwupd and does not provide Secure Boot.\n\n"
    },
    {
      "title": "BIOS Upgrade",
      "level": 3,
      "content": "Most of the L300 and L305 series laptops come with the InsydeH2O BIOS version 1.50. This BIOS might results in a dead Fn key and an improperly controlled fan depending on the exact laptop model (i.e the L300-OG1 needs the BIOS update from 1.50 to 2.20, but on the L300-12K everything is working on version 1.50). Get the fan working properly especially if you wish to use suspend and/or hibernate. The dead Fn key problem however is not a show stopper. The upgraded BIOS will also mean the PC speaker will start working. Ensure you get the correct file for your specific model: for example, the latest BIOS version (v2.20 since 2010) for the L300-OG1 is available from Dynabook Canada. Other models can be found starting at Dynabook global website, selecting the region it was sold in, going to the support section for discontinued products and entering either the serial number or choosing from the family/series/model drop-down menus.\n\nThis file is a Windows-only executable - it does not contain anything usable under DOS. Nor can this BIOS be flashed using the Linux flashrom application. There are only two ways to flash the ROM with that file:\n\n1. Run the file as an executable under a Microsoft Windows environment or,\n1. Use the undocumented \"brick\" repair method (below) proposed by Toshiba.\n\nAs the first method is straightforward it will not be discussed here. Below is the alternate method outlined for Linux-only users:\n\n1. the .exe file is a 7z compressed file. Use the command 7z e filename.exe to extract. You have to install 7zip first.\n1. the only important file is the .fd file. Rename that file to BIOS.fd\n1. copy the BIOS.fd file onto the root directory of a USB flash drive\n1. remove any inserted CD, the power cord, the battery, and the hard drive from your laptop\n1. insert the USB flash drive into a USB port on your laptop\n1. simultaneously hold down the Fn and F keys\n1. plug in the power cord to the laptop while still holding Fn+F\n1. press Power On button of laptop while still holding Fn+F\n1. USB flash drive light should start to flash. You may now release the Fn+F keys after a few seconds\n1. leave laptop for about 1 minute. The ROM is being flashed. Your laptop will eventually turn itself off and it may reboot.\n1. you may turn off laptop now if it has rebooted successfully. If it just turned itself off then continue...\n1. unplug power cord, remove USB flash drive, replace laptop hard drive and laptop battery. Re-plug power cord.\n1. reboot laptop and enter the BIOS setup using F2. You should see that it has successfully upgraded your BIOS.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | Yes | Yes | XF86AudioMute\nFn+F1 | Yes | Yes | XF86ScreenSaver\nFn+F2 | Yes | Yes | XF86Battery\nFn+F3 | Yes | Yes | XF86Sleep3\nFn+F4 | Yes | Yes | XF86Suspend3\nFn+F5 | Yes | Yes | XF86Display\nFn+F6 | Yes | Yes | XF86MonBrightnessDown\nFn+F7 | Yes | Yes | XF86MonBrightnessUp\nFn+F8 | Yes | Yes | XF86WLAN\nFn+F9 | No | Yes | See Touchpad Synaptics#Software toggle\nFn+F10 | See 4 | Yes | XF86Num_Lock4\nFn+F11 | See 4 | Yes | XF86Num_Lock4\nFn+F12 | Yes | Yes | XF86Scroll_Lock\nFn+1 | No | Yes | Marking looks like XF86ZoomOut, untested outside of twm.\nFn+2 | No | Yes | Marking looks like XF86ZoomIn, untested outside of twm.\n\n1. The key is visible to xev and similar tools\n1. The physical key has a symbol on it, which describes its function\n1. systemd-logind handles this by default\n1. Before sending XF86Num_Lock, toggles between secondary functions: either the numeric pad (9 to 0, /, *, -, +) or navigation keys (Home, Up, PageUp, Left, Right, End, Down, PageDown, Ins and Del) while lighting up the corresponding LED on the keyboard.\n\n"
    }
  ]
}