{
  "title": "Touhou",
  "url": "https://wiki.archlinux.org/title/Touhou",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Touhou Project is the name of a series of danmaku games (also known as \"bullet-hell shooters\")\n\nBullet-hell shooters is a genre of 2D shooters based on really complex patterns, which are beautiful and interesting to look at, and impiles great difficulty, memorizing patterns and fast player reaction.\n\nTouhou Project games are one of the most popular of this genre because, among other things, the in-game world is a giant universe, the music (at least the WAVs in the full version) is spectacular, and, if you have been on the internet for a while, you might stumble upon its curious fanbase, which has produced videos, music, manga (japanese comics) and even unofficial games.\n\nDespite the difficulty, they can be very addicting games.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "PC-98 games can be played using Linux-native X Neko Project II emulator (xnp2AUR).\n\nThe following packages only depend on Wine to run (and Timidity++ to play MIDI music). A python engine is under development to remove the wine dependency. They install the free trial versions. You can easily replace the trials with the full game if you have it.\n\nThese games have been packaged for your convenience:\n\n- Touhou 6: Embodiment of Scarlet Devil — th06-demo-wineAUR or th06-demo-pytouhouAUR\n- Touhou 7: Perfect Cherry Blossom — th07AUR\n- Touhou 8: Imperishable Night — th08AUR\n\nWe need help packaging more Touhou games for the AUR. This is a list of games that have free, downloadable trial editions to build off of:\n\n- Touhou 7.5: Immaterial and Missing Power\n- Touhou 9: Phantasmagoria of Flower View\n- Touhou 10: Mountain of Faith\n- Touhou 10.5: Scarlet Weather Rhapsody\n- Touhou 11: Subterranean Animism\n- Touhou 12: Undefined Fantastic Object\n- Touhou 13: Ten Desires\n- Touhou 13.5: Hopeless Masquerade.\n- Touhou 14: Double Dealing Character\n- Touhou 14.5: Urban Legend in Limbo\n- Touhou 15: Legacy of Lunatic Kingdom\n- Touhou 15.5: Antinomy of Common Flowers\n- Touhou 16: Hidden Star in Four Seasons\n- Touhou 17: Wily Beast and Weakest Creature\n- Touhou 18: Unconnected Marketeers\n\n"
    },
    {
      "title": "Python Engine",
      "level": 3,
      "content": "Linkmauve has made an experimental python engine to make the games more portable. It is definitely not stable, and is more of an outline for an engine than an actual one, but it is interesting nonetheless. See packages pytouhou-hgAUR and th06-demo-dataAUR.\n\n"
    },
    {
      "title": "Installing the full version",
      "level": 3,
      "content": "If you have the full version of either Imperishable Night or Perfect Cherry Blossom, you can place them in your home folder, or you can place them in the overlay so that they will work in the liveCD and also get installed to disk.\n\n1. Find the folder with the Touhou game files.\n1. Set your file manager to see hidden files/folders. (in Cherimoya's Dolphin file manager, just press Alt+. (the period key))\n1. Go to your \"Home\" folder and find the folders .th08 and/or .th07.\n1. Paste your game files right over the shortcuts in either .th08 or .th07\n1. Start your games normally. They will use the full version.\n\n"
    },
    {
      "title": "MIDI Music",
      "level": 3,
      "content": "If you are using the trial edition, they only include MIDI files. To play them, you will also need to install timidity++ along with some soundfonts (freepats-general-midi).\n\nNow add the following lines to the Timidity++ configuration file:\n\n```\n/etc/timidity++/timidity.cfg\n```\n\n```\ndir /usr/share/timidity/freepats\nsource /etc/timidity++/freepats/freepats.cfg\n```\n\nRemember to start the timidity.service user unit before playing.\n\n"
    },
    {
      "title": "Audio in Windows-era games",
      "level": 3,
      "content": "If you find that you have no audio in any of the Windows era or later games (Touhou 6 and later), make sure to install lib32-alsa-lib and lib32-alsa-plugins, and recheck your configuration in winecfg. In addition, set the audio in-game to \"WAV\" mode.\n\n"
    },
    {
      "title": "Steam version",
      "level": 2,
      "content": "You can find games available on Steam from this list.\n\n"
    },
    {
      "title": "thcrap",
      "level": 3,
      "content": "The Touhou Community Reliant Automatic Patcher (thcrap) is mainly developed to facilitate self-updating, multilingual translation of the Touhou Project games on Touhou Patch Center, but can theoretically be used for just about any other patch for these games, without going through that site.\n\nThe simplest way to launch Touhou games with thcrap is to use thcrap-steam-proton-wrapper script.\n\n- Download your purchased game from Steam.\n\n- Install thcrap-steam-proton-wrapper-gitAUR. For Flatpak version of Steam install com.valvesoftware.Steam.Utility.thcrap_steam_proton_wrapper from Flathub instead.\n- Change your Touhou game launch options. Right click your Touhou games in your Steam library, then click Properties. Under the General tab, change LAUNCH OPTIONS to\n\n```\nthcrap_proton -c en.js -- %command%\n```\n\nCheckout the manual to launch Touhou games with other languages.\n\n- First time launching the game, it will ask you to install thcrap.\n- After that, it will update thcrap and launch the game. When thcrap window show up, it's recommended you uncheck the Keep the updater running in background in the setting, so Steam could properly shutdown the game when you quit.\n\n"
    },
    {
      "title": "thprac",
      "level": 3,
      "content": "thprac is a tool for practicing. Add -p option will install and launch Touhou game with thprac.\n\n```\nthcrap_proton -p -c en.js -- %command%\n```\n\n"
    },
    {
      "title": "vpatch",
      "level": 3,
      "content": "Vsync patch reduces input delay (game responds more quickly when a button is pressed).\n\n- Download the patch from touhouwiki.\n\n- Copy vpatch.exe, vpatch.ini and vpatch_thxx.dll to your game directory ~/.local/share/Steam/steamapps/common/thxx/ (or ~/.var/app/com.valvesoftware.Steam/data/Steam/steamapps/common/thxx/ for Flatpak version of Steam).\n\n- Open vpatch.ini in the game directory with your favorite text editor. We are going to change windows size. For TH10 the default window is very small. First, set enabled = 1 under [Window] section. If using 4K display, set Width = 2667 and Height = 2000. If using 1080p display set Width = 1280 and Height = 960. Based on this tutorial. To fix the Th10 Marisa B 3.xx power bug, add BugFixTh10Power3 = 1 to [Option] section.\n\n- Make a backup of original Steam executable ~/.local/share/Steam/steamapps/common/thxx/thxx.exe. This is for convenience, you can always recover it using verify local data in Steam.\n\n- Replace the ~/.local/share/Steam/steamapps/common/thxx/thxx.exe with the one you legally obtained from original disk.\n\n- Change the Steam game launch option to\n\n```\nthcrap_proton -v -c en.js -- %command%\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:Touhou Project\n- Running Touhou Games in Linux\n- Wine PKGBUILD Guidelines\n- How to use thcrap (Touhou Community Reliant Automatic Patcher) on the Steam Deck\n- [WIN/LINUX] English Patch with ThCRAP, Plus V-Sync Patch, All From Within Steam\n\n"
    }
  ]
}