{
  "title": "Umask",
  "url": "https://wiki.archlinux.org/title/Umask",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- File permissions and attributes\n\nThe umask utility is used to control the file-creation mode mask, which determines the initial value of file permission bits for newly created files. The behaviour of this utility is standardized by POSIX and described in the POSIX Programmer's Manual. Because umask affects the current shell execution environment, it is usually implemented as built-in command of a shell.\n\n"
    },
    {
      "title": "Meaning of the mode mask",
      "level": 2,
      "content": "The mode mask contains the permission bits that should not be set on a newly created file, hence it is the logical complement of the permission bits set on a newly created file. If some bit in the mask is set to 1, the corresponding permission for the newly created file will be disabled. Hence the mask acts as a filter to strip away permission bits and helps with setting default access to files.\n\nThe resulting value for permission bits to be set on a newly created file is calculated using bitwise material nonimplication (also known as abjunction), which can be expressed in logical notation:\n\n```\nR: (D & (~M))\n```\n\nThat is, the resulting permissions R are the result of bitwise conjunction of default permissions D and the bitwise negation of file-creation mode mask M.\n\n- The default creation permissions are 777 for directories.\n- Since Linux does not allow a file to be created with execution permissions, the default creation permissions are only 666 for files.\n- Only the file permission bits of the mask are used under Linux - see umask(2). The suid, sgid and sticky bits of the mask are ignored.\n\nFor example, let us assume that the file-creation mode mask is 027. Here the bitwise representation of each digit represents:\n\n- 0 stands for the user permission bits not set on a newly created file\n- 2 stands for the group permission bits not set on a newly created file\n- 7 stands for the other permission bits not set on a newly created file\n\nWith the information provided by the table below this means that for a newly created file, for example owned by User1 user and Group1 group, User1 has all the possible permissions (octal value 7) for the newly created file, other users of the Group1 group do not have write permissions (octal value 5), and any other user does not have any permissions (octal value 0) to the newly created file. So with the 027 mask taken for this example, files will be created with 750 permissions.\n\nTable content:\nOctal | Binary | Meaning\n0 | 000 | no permissions\n1 | 001 | execute only\n2 | 010 | write only\n3 | 011 | write and execute\n4 | 100 | read only\n5 | 101 | read and execute\n6 | 110 | read and write\n7 | 111 | read, write and execute\n\n"
    },
    {
      "title": "Display the current mask value",
      "level": 2,
      "content": "To display the current mask, simply invoke umask without specifying any arguments. The default output style depends on implementation, but it is usually octal:\n\n```\n$ umask\n```\n\n```\n0027\n```\n\nWhen the -S option, standardized by POSIX, is used, the mask will be displayed using symbolic notation. However, the symbolic notation value will always be the logical complement of the octal value, i.e. the permission bits to be set on the newly created file:\n\n```\n$ umask -S\n```\n\n```\nu=rwx,g=rx,o=\n```\n\n"
    },
    {
      "title": "Set the mask value",
      "level": 2,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nYou can set the umask value through the umask command. The string specifying the mode mask follows the same syntactic rules as the mode argument of chmod (see the POSIX Programmer's Manual for details).\n\nSystem-wide umask value can be set in /etc/profile (e.g. /etc/profile.d/umask.sh) or in the default shell configuration files (e.g. /etc/bash.bashrc). Most Linux distributions, including Arch, set a umask default value of 022 at /etc/login.defs. One can also set umask with pam_umask.so but it may be overridden by /etc/profile or similar.\n\nIf you need to set a different value, you can either directly edit such file, thus affecting all users, or call umask from your shell's user configuration file, e.g. ~/.bashrc to only change your umask, however these changes will only take effect after the next login. To change your umask during your current session only, simply run umask and type your desired value. For example, running umask 077 will give you read and write permissions for new files, and read, write and execute permissions for new folders.\n\nAs mentioned by pam_umask(8) ยง DESCRIPTION, umask=value can also be used in the /etc/passwd section of the Users and groups#User database. See the discussion about setting UMASK in GECOS field\n\n"
    },
    {
      "title": "Set umask value for KDE / Plasma",
      "level": 3,
      "content": "Setting the umask value via /etc/profile does no longer work for KDE / Plasma sessions because these are started as systemd user units.\n\nThe umask value can be set via pam_umask.so or a systemd drop-in file:\n\n```\n/etc/systemd/system/user@.service.d/override.conf\n```\n\n```\n[Service]\nUMask=0002\n```\n\nUsing pam_umask.so allows to set the system-wide umask value for both, text console and graphical KDE sessions in one single place. Any changes in /etc/profile or systemd configuration can be omitted. Therefore, pam_umask.so needs to be enabled in a configuration file that is included by both, /etc/pam.d/login and /etc/pam.d/systemd-user.\n\nAdd the following line to /etc/pam.d/system-login:\n\n```\n# session    optional   pam_umask.so         umask=022\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- POSIX Programmer's Manual: umask (also available as umask(1p)) chmod (extended description) (also available as chmod(1p))\n- 027 umask: a compromise between security and simplicity\n\n- umask (also available as umask(1p))\n- chmod (extended description) (also available as chmod(1p))\n\n"
    }
  ]
}