{
  "title": "VirtualBox/Instalar Arch Linux como convidado",
  "url": "https://wiki.archlinux.org/title/VirtualBox/Instalar_Arch_Linux_como_convidado",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- VirtualBox\n\nEste artigo trata sobre a instalação do Arch Linux no VirtualBox.\n\nInicialize a mídia de instalação do Arch por meio de uma das unidades virtuais da máquina virtual. Em seguida, conclua a instalação de um sistema Arch básico, conforme explicado no Guia de instalação.\n\n"
    },
    {
      "title": "Instalação em modo EFI (opcional)",
      "level": 3,
      "content": "Habilitar EFI para Arch como convidado é opcional. Se você deseja instalar o Arch Linux no modo EFI dentro do VirtualBox, você deve alterar o modo de firmware da máquina virtual. Isso deve ser feito antes de instalar o Arch como convidado, alterar a opção posteriormente resultará em uma máquina não inicializável, a menos que a configuração seja revertida.\n\nPara habilitar EFI para uma máquina virtual usando a interface gráfica, abra as configurações da máquina virtual, escolha o item Sistema no painel à esquerda e a aba Placa-mãe no painel direito, e marque a caixa de seleção Habilitar EFI (sistemas especiais apenas).\n\nAlternativamente, o mesmo pode ser alcançado a partir da linha de comando usando VBoxManage:\n\n```\n$ VBoxManage modifyvm \"Nome da máquina virtual\" --firmware efi\n```\n\nefi vai definir o firmware da máquina virtual para EFI com número de bits correspondendo à CPU da máquina virtual. Para obter um número de bits EFI específico, defina o firmware para efi64 para EFI x86_64 ou efi32 para EFI IA32.\n\nApós selecionar o kernel no menu da mídia de instalação do Arch Linux, a mídia irá travar por um minuto ou dois e continuará a inicializar o kernel normalmente depois. Seja paciente.\n\n"
    },
    {
      "title": "Instalar os adicionais para convidado",
      "level": 3,
      "content": "As Adicionais para Convidado (Guest Additions) do VirtualBox fornecem drivers e aplicativos que otimizam o sistema operacional convidado, incluindo resolução de imagem aprimorada e melhor controle do mouse. Dentro do sistema convidado instalado, instale:\n\n- virtualbox-guest-utils para utilitários de convidados do VirtualBox com suporte a X\n- virtualbox-guest-utils-nox para utilitários de convidados do VirtualBox sem suporte a X\n\n- Você pode alternativamente instalar os adicionais para convidado com o ISO do pacote virtualbox-guest-iso, desde que você o tenha instalado no sistema hospedeiro. Para fazer isso, vá para o menu do dispositivo e clique em Inserir imagem de CD dos Adicionais para Convidado.\n- Para recompilar os módulos de kernel do vbox, execute rcvboxadd setup como root.\n\nOs adicionais para convidado em execução no seu convidado e o aplicativo VirtualBox em execução no seu hospedeiro devem ter versões correspondentes, caso contrário, os adicionais para convidado (como a área de transferência compartilhada) podem parar de funcionar. Se você atualizar seu convidado (por exemplo, pacman -Syu), verifique se o aplicativo do VirtualBox neste hospedeiro também é a versão mais recente. \"Verificar por atualizações\" na GUI do VirtualBox às vezes não é suficiente; verifique o site VirtualBox.org.\n\n"
    },
    {
      "title": "Carregar os módulos de kernel do VirtualBox",
      "level": 3,
      "content": "Para carregar os módulos automaticamente, habilite vboxservice.service para carregar os módulos e sincronizar a hora do sistema do convidado com o hospedeiro.\n\nPara carregar os módulos manualmente, digite:\n\n```\n# modprobe -a vboxguest vboxsf vboxvideo\n```\n\n"
    },
    {
      "title": "Definir a melhor resolução de framebuffer",
      "level": 3,
      "content": "Normalmente, após a instalação dos Adicionais para Convidado, um convidado Arch em tela cheia executando o X será definido para a melhor resolução para o seu monitor; no entanto, o framebuffer do console virtual será configurado para uma resolução padrão, geralmente menor, detectada pelo driver VESA personalizado do VirtualBox.\n\nPara usar os consoles virtuais na resolução ideal, o Arch precisa reconhecer essa resolução como válida, o que, por sua vez, exige que o VirtualBox passe essas informações para o sistema operacional convidado.\n\nPrimeiro, verifique se sua resolução desejada já não é reconhecida executando o comando (hwinfo precisa estar instalado):\n\n```\nhwinfo --framebuffer\n```\n\nSe a resolução ideal não aparecer, você precisará executar a ferramenta VBoxManage na máquina do hospedeiro e adicionar \"resoluções extras\" à sua máquina virtual (em um hospedeiro Windows, vá para o diretório de instalação do VirtualBox para encontrar VBoxManage.exe). Por exemplo:\n\n```\n$ VBoxManage setextradata \"Arch Linux\" \"CustomVideoMode1\" \"1360x768x24\"\n```\n\nOs parâmetros \"Arch Linux\" e \"1360x768x24\" no exemplo acima devem ser substituídos pelo nome da sua VM e pela resolução desejada do framebuffer. Aliás, este comando permite definir até 16 resoluções extras (\"CustomVideoMode1\" a \"CustomVideoMode16\").\n\nDepois, reinicie a máquina virtual e execute hwinfo --framebuffer mais uma vez para verificar se as novas resoluções foram reconhecidas pelo sistema convidado (o que não garante que todas elas funcionem, dependendo das limitações de hardware).\n\nFinalmente, adicione um parâmetro do kernel video=resolução para definir o framebuffer para uma nova resolução, por exemplo:\n\n```\nvideo=1360x768\n```\n\nAlém disso, você pode querer configurar seu gerenciador de boot para usar a mesma resolução. Se você usa GRUB, veja GRUB/Tips and tricks#Setting the framebuffer resolution.\n\n"
    },
    {
      "title": "Iniciar os serviços de convidados do VirtualBox",
      "level": 2,
      "content": "Após o passo de instalação bastante grande lidando com módulos de kernel do VirtualBox, agora você precisa iniciar os serviços de convidado. Os serviços de convidado são na verdade apenas um executável binário chamado VBoxClient que irá interagir com o seu Sistema de Janelas X. O VBoxClient gerencia os seguintes recursos:\n\n- área de transferência compartilhada e arrastar e soltar entre o hospedeiro e o convidado;\n- modo de janela seamless;\n- a exibição de convidado é automaticamente redimensionada de acordo com o tamanho da janela do convidado;\n- verificação da versão do hospedeiro VirtualBox\n\nTodos esses recursos podem ser ativados independentemente com seus flags dedicados:\n\n```\n$ VBoxClient --clipboard\n$ VBoxClient --draganddrop\n$ VBoxClient --seamless\n$ VBoxClient --checkhostversion\n$ VBoxClient --vmsvga\n```\n\nObserve que VBoxClient só pode ser chamado com um sinalizador por vez, cada chamada gerando um processo de serviço dedicado. Como um atalho, o script VBoxClient-all permite todos esses recursos.\n\nvirtualbox-guest-utils instala /etc/xdg/autostart/vboxclient.desktop que inicia VBoxClient-all ao iniciar a sessão. Se o seu ambiente de desktop ou gerenciador de janela não tiver suporte a XDG Autostart, você precisará configurar a inicialização automática -- veja Inicialização automática#Na inicialização de ambiente de desktop e Inicialização automática#Na inicialização do gerenciador de janela para mais detalhes.\n\nO VirtualBox também pode sincronizar o tempo entre o hospedeiro e o convidado, para isso, inicie/habilite o vboxservice.service.\n\nAgora, você deve ter um convidado Arch Linux. Observe que recursos como compartilhamento de área de transferência estão desabilitados por padrão no VirtualBox, e você precisará desabilitá-los nas configurações por VM se realmente quiser usá-los (p.ex., Configurações > Geral > Avançado > Área de Transferência Compartilhada).\n\n"
    },
    {
      "title": "Redimensionar automaticamente a tela do convidado",
      "level": 3,
      "content": "Esta opção irá alterar automaticamente a resolução do convidado Arch, sempre que a janela da máquina virtual for redimensionada. Esta opção está habilitada por padrão e na interface gráfica está localizada em Visualizar > Redimensionar Tela Automaticamente. Ao usar o KDE Plasma, na tela de login da GUI (Sessão) selecione Plasma (X11) em vez da sessão padrão Plasma (Wayland), que não funciona com redimensionamento automático.\n\n"
    },
    {
      "title": "Aceleração de hardware",
      "level": 3,
      "content": "A aceleração de hardware pode ser ativada nas opções do VirtualBox. O gerenciador de exibição GDM 3.16+ é conhecido por quebrar o suporte de aceleração de hardware. [1] Então, se você tiver problemas com a aceleração de hardware, experimente outro gerenciador de exibição (o lightdm parece funcionar bem). [2] [3]\n\nSe a aceleração de hardware não funcionar como esperado, tente alterar a opção Controladora Gráfica localizada na aba Tela nas opções Monitor das configurações da GUI. Parece que, dependendo do tipo de GPU do hospedeiro, nem todos as controladoras emuladas funcionam igualmente bem.\n\n"
    },
    {
      "title": "Habilitar pastas compartilhadas",
      "level": 3,
      "content": "Pastas compartilhadas são gerenciadas no hospedeiro, nas configurações da máquina virtual acessível através da GUI do VirtualBox, na aba Pastas Compartilhadas. Lá, Caminho da pasta, o nome do ponto de montagem identificado por Nome da pasta e opções como Apenas para Leitura, Montar Automaticamente e Tornar Permanente podem ser especificados. Esses parâmetros podem ser definidos com o utilitário de linha de comando VBoxManage. Consulte para mais detalhes.\n\nNão importa qual método você usará para montar sua pasta, todos os métodos requerem algumas etapas primeiro.\n\nPara evitar este problema, /sbin/mount.vboxsf: mounting failed with the error: No such device, certifique-se de que o módulo do kernel vboxsf esteja carregado corretamente. Deveria ser, já que ativamos todos os módulos do kernel do convidado anteriormente.\n\nDuas etapas adicionais são necessárias para que o ponto de montagem seja acessível a partir de usuários que não sejam root:\n\n- o pacote virtualbox-guest-utils criou um grupo vboxsf (feito em uma etapa anterior);\n- seu usuário deve estar no grupo de usuários vboxsf.\n\n"
    },
    {
      "title": "Montagem manual",
      "level": 4,
      "content": "Use o seguinte comando para montar sua pasta em seu convidado Arch Linux:\n\n```\n# mount -t vboxsf -o gid=vboxsf nome_da_pasta_compartilhada ponto_de_montagem_em_sistema_convidado\n```\n\nsendo que nome_da_pasta_compartilhada é o Nome da Pasta atribuído pelo hipervisor quando o compartilhamento foi criado.\n\nSe o usuário não estiver no grupo vboxsf, para dar acesso ao nosso ponto de montagem, podemos especificar as opções mount(8) uid= e gid= com os valores correspondentes do usuário. Estes valores podem ser obtidos do comando id executado contra este usuário. Por exemplo:\n\n```\n# mount -t vboxsf -o uid=1000,gid=1000 home /mnt\n```\n\n"
    },
    {
      "title": "Montagem automática",
      "level": 4,
      "content": "Para que o recurso de montagem automática funcione, você deve marcar a caixa de seleção de Montagem Automática na GUI ou usar o argumento opcional --automount com o comando VBoxManage sharedfolder.\n\nA pasta compartilhada agora deve aparecer como /media/sf_nome_da_pasta_compartilhada. Se os usuários não puderem acessar as pastas compartilhadas, verifique se /media tem permissões 755 ou é de propriedade do grupo vboxsf se estiver usando permissões 750. Atualmente, esse não é o padrão se o diretório /media for criada por vboxservice.service.\n\nVocê pode usar links simbólicos para ter um acesso mais conveniente e evitar de navegar naquele diretório, p.ex.:\n\n```\n$ ln -s /media/sf_nome_da_pasta_compartilhada ~/meus_documentos\n```\n\n"
    },
    {
      "title": "Montar na inicialização",
      "level": 3,
      "content": "Você pode montar seu diretório com fstab. No entanto, para evitar problemas de inicialização com o systemd, noauto,x-systemd.automount deve ser adicionado ao /etc/fstab. Dessa forma, as pastas compartilhadas são montadas somente quando esses pontos de montagem são acessados e não durante a inicialização. Isso pode evitar alguns problemas, especialmente se os adicionais para convidados não forem carregados ainda quando o systemd ler fstab e montar as partições.\n\n```\nnomePastaCompartilhada  /caminho/para/PontoMontagemNaMáquinaConvidado  vboxsf  uid=usuário,gid=grupo,rw,dmode=700,fmode=600,noauto,x-systemd.automount\n```\n\n- nomePastaCompartilhada: o valor do menu Configurações > Pastas Compartilhadas > Editar > Nome da Pasta da máquina virtual. Esse valor pode ser diferente do nome do nome real da pasta na máquina do hospedeiro. Para ver as Configurações da máquina virtual, vá para o aplicativo VirtualBox do sistema do hospedeiro, selecione a máquina virtual correspondente e clique em Configurações.\n- /caminho/para/PontoMontagemNaMáquinaConvidado: se não existir, esse diretório deve ser criado manualmente (por exemplo, usando mkdir).\n- dmode/fmode são permissões de diretório/arquivo para diretórios/arquivos dentro /caminho/para/PontoMontagemNaMáquinaConvidado.\n\nAté 2012-08-02, mount.vboxsf não possui suporte à opção nofail:\n\n```\ndesktop  /media/desktop  vboxsf  uid=user,gid=group,rw,dmode=700,fmode=600,nofail  0  0\n```\n\n"
    },
    {
      "title": "Acesso a porta serial pelo convidado",
      "level": 3,
      "content": "Veja Working with the serial console#Connect using a terminal emulator program.\n\n"
    },
    {
      "title": "Texto do terminal pequeno demais durante a instalação",
      "level": 3,
      "content": "No hospedeiro, VirtualBox Manager, defina the Fator de Escalonamento da tela para 2.00 ou 3.00.\n\n"
    },
    {
      "title": "Convidado trava após iniciar o Xorg",
      "level": 3,
      "content": "Drivers com defeito ou em falta podem fazer com que o convidado congele após iniciar o Xorg, veja por exemplo [4] e [5]. Tente desativar a aceleração 3D em Configurações > Monitor e verifique se todos os drivers Xorg estão instalados.\n\n"
    },
    {
      "title": "Modo tela cheia mostra uma tela branca",
      "level": 3,
      "content": "Em alguns gerenciadores de janelas (i3, awesome), o VirtualBox tem problemas com o modo de tela cheia corretamente devido à barra de sobreposição. Para solucionar esse problema, desative a opção Exibir em modos Tela-Cheia/Seamless em Configurações do convidado > Interface do usuário > Minibarra de Ferramentas. Veja o relatório de erros do upstream para mais informações.\n\nSe a tela do convidado ficar preta acima de um determinado tamanho (por exemplo, acima de 2048 pixels de largura), aumentar Configurações > Monitor > Tela > Memória de Vídeo pode ajudar.\n\n"
    },
    {
      "title": "Convidados Linux têm áudio lento/distorcido",
      "level": 3,
      "content": "O driver de áudio AC97 dentro do kernel Linux ocasionalmente adivinha as configurações erradas do relógio quando executado dentro do VirtualBox, levando a um áudio que está muito lento ou muito rápido. Para corrigir isso, crie um arquivo em /etc/modprobe.d/ com a seguinte linha:\n\n```\noptions snd-intel8x0 ac97_clock=48000\n```\n\n"
    },
    {
      "title": "Linux guests have slow/laggy audio",
      "level": 3,
      "content": "Em alguns casos, o áudio pode ter desempenho lento (por exemplo, atraso em relação ao vídeo ao transmitir vídeo online). Uma possível solução alternativa pode ser usar o controlador Intel HD Audio no VirtualBox e desativar sua economia de energia adicionando a seguinte linha em um arquivo em /etc/modprobe.d/ no sistema operacional convidado:\n\n```\noptions snd_hda_intel power_save=0 power_save_controller=N\n```\n\n"
    },
    {
      "title": "Arch: script pacstrap falhando",
      "level": 3,
      "content": "Se você usou pacstrap para também #Instalar os adicionais para convidado antes de executar uma primeira inicialização no novo convidado, você precisa umount -l /mnt/dev como root antes de usar pacstrap novamente; uma falha em fazer isso o tornará inutilizável.\n\n"
    },
    {
      "title": "Hospedeiro Windows: VERR_ACCESS_DENIED",
      "level": 3,
      "content": "Para acessar a imagem não tratada VMDK em um hospedeiro Windows, execute a GUI do VirtualBox como administrador.\n\n"
    },
    {
      "title": "Nenhuma aceleração 3D de hardware no convidado Arch Linux",
      "level": 3,
      "content": "O pacote virtualbox-guest-utils a partir da versão 5.2.16-2 não contém o arquivo VBoxEGL.so. Isso faz com que o convidado Arch Linux não tenha uma aceleração 3D adequada. Veja FS#49752.\n\nPara lidar com esse problema, aplique o conjunto de correções em FS#49752#comment152254. Algumas correções no conjunto de correções são necessárias para que funcione na versão 5.2.16-2.\n\n"
    },
    {
      "title": "Plasma redefine a resolução do convidado para 800×600",
      "level": 3,
      "content": "Veja KDE#Cannot change screen resolution when running in a virtual machine.\n\n"
    },
    {
      "title": "Tela preta com instalação mínima do Plasma-X11",
      "level": 3,
      "content": "Se você usou a instalação mínima do plasma-desktop em vez do plasma (que inclui suporte para Wayland), então provavelmente você terá uma tela preta com cursor após iniciar a sessão do Plasma-X11.\n\nPara corrigir isso, redimensione a janela do VirtualBox várias vezes e defina a resolução manualmente na própria janela do VirtualBox: Visualizar > Tela Virtual 1> Redimensionar para 1024x768 (ou outra resolução de sua preferência).\n\nEntão instale kscreen.\n\nAbra no inicializador do KDE Configurações do sistema > Inicialização e desligamento > Serviços de segundo plano, pare e desmarque KScreen2 e salve as configurações. O problema deve desaparecer para sempre.\n\n"
    }
  ]
}