{
  "title": "Vivaldi",
  "url": "https://wiki.archlinux.org/title/Vivaldi",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Chromium\n- Firefox\n\nVivaldi is a web browser from former Opera founder & team members, based on Chromium and focused on personalization aspects.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Vivaldi can be installed with vivaldi or vivaldi-snapshotAUR. Prebuilt packages can alternatively be found in the herecura unofficial repository. For differences between snapshot and stable versions, see this page.\n\nTo use Qt instead of GTK dialogs for file selections just install kdialog.\n\n"
    },
    {
      "title": "Extensions",
      "level": 2,
      "content": "Vivaldi is compatible with most of Chrome's extensions. These can be installed directly from the Chrome Web Store.\n\nNote: **proxy server** \n\nTo see which extensions are installed/enabled, type vivaldi://extensions in the address bar.\n\nSee also Wikipedia:Google Chrome Extension.\n\n"
    },
    {
      "title": "Media playback",
      "level": 2,
      "content": "To enable proprietary media (H264, AAC, etc.) playback support:\n\n- install vivaldi-ffmpeg-codecs or vivaldi-snapshot-ffmpeg-codecsAUR\n- start Vivaldi fresh (after update or fresh install), close Vivaldi and restart again\n- use the vivaldi-update-ffmpeg-hookAUR\n\n"
    },
    {
      "title": "Making flags persistent",
      "level": 2,
      "content": "You can put your flags in a vivaldi-stable.conf file under $HOME/.config/ (or under $XDG_CONFIG_HOME if you have configured that environment variable).\n\nNo special syntax is used; flags are defined as if they were written in a terminal.\n\n- The arguments are split on whitespace and shell quoting rules apply, but no further parsing is performed.\n- Flags can be placed in separate lines for readability, but this is not required.\n\nBelow is an example vivaldi-stable.conf file that disables hardware media keys for the browser:\n\n```\n~/.config/vivaldi-stable.conf\n```\n\n```\n--disable-features=HardwareMediaKeyHandling\n```\n\nThe vivaldi-snapshotAUR package can get its flags set with the vivaldi-snapshot.conf file.\n\n"
    },
    {
      "title": "Modding",
      "level": 2,
      "content": "Vivaldi has modding capabilities through its window.html (pre Vivaldi 6.2: browser.html) file.\n\nThe file can be found at: /opt/vivaldi/resources/vivaldi/window.html\n\nAnother way to find the window.html path is through the Executable Path section at vivaldi://about/.\n\nYou can also use vivaldi-autoinject-custom-js-uiAUR. It can help you manage mods: add or remove them from window.html, and redo changes at vivaldi updates. For usage, visit the project page.\n\n"
    },
    {
      "title": "Transfer your profile to snapshot version",
      "level": 3,
      "content": "If you switched to snapshot version because of lacking features of stable version, you want to also use your user profile. Copy the ~/.config/vivaldi/Default to ~/.config/vivaldi-snapshot/Default.\n\n"
    },
    {
      "title": "Google search suggestions",
      "level": 3,
      "content": "Vivaldi cannot be shipped with enabled suggestions for google search. The user must manually add the suggestion url https://www.google.com/complete/search?client=chrome&q=%s in search settings.\n\n"
    },
    {
      "title": "Native Wayland support",
      "level": 3,
      "content": "Go to chrome://flags page, then search wayland. You will see the Preferred Ozone platform setting. Set it to auto. The default one is \"X11\". \"Auto\" selects Wayland if possible, X11 otherwise.\n\n"
    },
    {
      "title": "Keep picture-in-picture window above other windows",
      "level": 3,
      "content": "When viewing some video, you can press the picture-in-picture button to detach it to a separate window. By default this window is not kept above others and it is inconvenient. To fix it in KDE, create a window rule to keep it above others. See KDE#Using window rules.\n\n"
    },
    {
      "title": "Chromium page",
      "level": 3,
      "content": "Some troubleshooting is common for Vivaldi and Chromium, such as for example, force enabling hardware acceleration. For such, consult the Chromium#Troubleshooting.\n\n"
    },
    {
      "title": "Certificates management",
      "level": 3,
      "content": "Currently (Vivaldi 6.2.3105.54 (Stable channel)), the certificates management setting is missing. To workaround that, manually type the address chrome://settings/certificates. Note, that the address will be changed to vivaldi://settings/certificates, but you cannot type it in the first place (otherwise you will see vivaldi settings where cert management it is missing). See here for more details.\n\n"
    }
  ]
}