{
  "title": "Xcursorgen",
  "url": "https://wiki.archlinux.org/title/Xcursorgen",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "xcursorgen is a tool that allows for creation of cursor files to be used with Xorg. A cursor can be created from PNG files.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the xorg-xcursorgen package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "By default, the user has to supply two files to xcursorgen:\n\n- a square image file saved as PNG\n- a configuration\n\nxcursorgen takes two arguments: the configuration file and an output path.\n\nThe configuration file must at least contain the following, space-delimited values:\n\n- image size in pixels\n- hotx: the x coordinate of the pointer tip\n- hoty: the y coordinate of the pointer tip\n- file name\n\nSuppose there is an image file named red.png of 32x32 pixels. Save this configuration file alongside:\n\n```\nred.cursor\n```\n\n```\n32 2 4 red.png\n```\n\nand run:\n\n```\n$ xcursorgen red.cursor default\n```\n\nThis will create the cursor as default which can later on be used with Xorg. The pointer tip is located in the upper left.\n\n"
    },
    {
      "title": "Animated cursors",
      "level": 3,
      "content": "Animated cursors are created from multiple image files. For animated cursors copy the configuration line for each image file and specify a delay in milliseconds for each frame:\n\n```\nanim.cursor\n```\n\n```\n32 2 4 anim01.png 50\n32 2 4 anim02.png 50\n32 2 4 anim03.png 50\n32 2 4 anim04.png 50\n```\n\n"
    },
    {
      "title": "Installing created cursor files",
      "level": 2,
      "content": "If only some cursors of an already existing cursor theme should be changed, create a custom directory in ~/.local/share/icons/. Create this file inside the folder:\n\n```\nindex.theme\n```\n\n```\n[Icon Theme]\nName = name\nComment = comment\nExample = default\nInherits = the_old_cursor_theme\n```\n\nNote that the name has to be the same as the directory name.\n\nNext, copy the cursor file created from xcursorgen into a subdirectory cursors, e.g.:\n\n```\nRedCursors/\n|── cursors\n|   |── default\n|   └── xterm\n└── index.theme\n```\n\nNow, configure your system to use this newly created cursor theme. Note that most applications have to be restarted to use the new cursor theme.\n\nFor more information, refer to Cursor themes#Manually.\n\n"
    }
  ]
}