{
  "title": "Xephyr",
  "url": "https://wiki.archlinux.org/title/Xephyr",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nXephyr is a nested X server that runs as an X application.\n\nThis may be useful to workaround a badly written application. For example, Supermicro servers may be controlled with a java ipmi kvm viewer application. While the server is rebooting, the application frequently recreates its window and steals focus from your current window. This happens several times per minute, and makes your work impossible. It is not obvious how to make a window rule that prevents such application's window from gaining focus when created, because focus must be given when launched for the first time. Using Xephyr allows you to keep these window recreations inside a separate window, which does not steal focus from your currently opened window(s).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install xorg-server-xephyr.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "If you wish to run a nested X window, you will need to specify a new display:\n\n```\n$ Xephyr -br -ac -noreset -screen 800x600 :1\n```\n\nThis will launch a new Xephyr window with a DISPLAY of \":1\". In order to launch an application in that window, you would need to specify that display:\n\n```\n$ DISPLAY=:1 xterm\n```\n\n"
    },
    {
      "title": "Launching window managers",
      "level": 3,
      "content": "If you want to launch a specific WM, spectrwm for example, you would type:\n\n```\n$ DISPLAY=:1 spectrwm\n```\n\nYou can also launch Xephyr with your xinitrc using startx:\n\n```\n$ startx -- /usr/bin/Xephyr :1\n```\n\n"
    },
    {
      "title": "Grabbing and un-grabbing user input",
      "level": 3,
      "content": "Pressing Ctrl+Shift should lock/unlock your mouse pointer and your keystrokes inside Xephyr window exclusively if possible.\n\n"
    },
    {
      "title": "Sending Alt+Tab",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nIf using KDE, create a window rule to ignore global shortcuts. Then you can use Alt+Tab inside Xephyr.\n\n"
    },
    {
      "title": "Tips and tricks",
      "level": 2,
      "content": "Other examples for situations where Xephyr can be useful are:\n\n1. A testing environment for an X application, or feature, in which the tester would like to keep working in their usual X environment, yet defending the other applications from failures of the application under test.\n1. OpenSSH#Remote emphasize 3 settings in the sshd server configuration file for OpenSSH#X11 forwarding (over ssh). 2 of these, out of 3, are the default settings. When the ssh client can not influence the ssh server administrator to set the 3rd one, X11Forwarding, to yes, Forwarding X11 over ssh uses Xephyr as a work around to be installed in the ssh client machine.\n\n"
    }
  ]
}