{
  "title": "Xsettingsd",
  "url": "https://wiki.archlinux.org/title/Xsettingsd",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- X resources\n- Window manager\n\nXsettingsd is a lightweight xsettings daemon which provides settings to Xorg applications via the XSETTINGS specification.\n\nSome desktop environments (such as Plasma by default, or a custom one) do not include this. In such environments running an xsettings daemon is necessary for some applications (most notably GTK–, Java– and Wine–based) to use the selected theme, cursor, font, and other settings.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install xsettingsd or xsettingsd-gitAUR.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "xsettingsd(1) contains just brief intro, see README for details.\n\nAn example configuration to X FreeType font rendering (you can use your preferred config file path):\n\n```\n~/.config/xsettingsd/xsettingsd.conf\n```\n\n```\nXft/Antialias   1\nXft/DPI         98304\nXft/Hinting     1\nXft/HintStyle   \"hintfull\"\nXft/lcdfilter   \"lcddefault\"\nXft/RGBA        \"rgb\"\n```\n\n- Xft/DPI is your DPI multiplied by 1024.\n- Fonts with your real DPI (like 94*1024) might look better than with artificial (like 96*1024) one, but you may encounter glitches (e.g. no borders on pop-up tips) in your application.\n- Although X resources and xsettings parameter names may look similar, they all are case-sensitive. E.g. you should put Xft.dpi: 96 in ~/.Xresources and Xft/DPI 98304 in ~/.xsettingsd.conf.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Start the user unit xsettingsd.service.\n\nThis unit is static, so it cannot be enabled directly. You can autostart it (or xsettingsd binary) on Xorg, desktop environment or window manager startup.\n\nThe unit is configured as PartOf the graphical-session.target, so it stops (restarts) when graphical-session.target is stopped (restarted), see systemd.unit(5) § [UNIT] SECTION OPTIONS and systemd.special(7) § Special Passive User Units.\n\n"
    },
    {
      "title": "Unable to open connection to X server",
      "level": 3,
      "content": "Check that DISPLAY and XAUTHORITY environment variables are set.\n\nIf you are starting the systemd unit, check that systemctl --user import-environment DISPLAY XAUTHORITY was executed (it can be done by /etc/X11/xinit/xinitrc.d/50-systemd-user.sh invoked from your ~/.xinitrc).\n\n"
    }
  ]
}