{
  "title": ".NET Core (Português)",
  "url": "https://wiki.archlinux.org/title/.NET_Core_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": ".NET Core é um novo framework de software FOSS da Microsoft para C#, Visual Basic e F#. Ele é projetado para ser multiplataforma, modular e apto para aplicativos modernos, em oposição ao seu predecessor, o .NET Framework.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Se você deseja apenas executar aplicativos gerenciados pelo .NET Core, instale o pacote dotnet-runtime.\n\nPara compilar aplicativos com .NET Core, instale dotnet-sdk também.\n\nA Microsoft recomenda usar Visual Studio Code, sua IDE FOSS baseada no Electron, para compilar & depurar aplicativos .NET Core.\n\n"
    },
    {
      "title": "Instalar várias versões",
      "level": 3,
      "content": "Você pode instalar várias versões do .NET Core SDK ou do tempo de execução lado a lado usando o script dotnet-install.sh fornecido pelo .NET Foundation. Você pode encontrar a documentação do script aqui.\n\nPor exemplo, esse comando instalaria a versão atual encontrada no canal atual Current em /opt/dotnet:\n\n```\n# ./dotnet-install.sh --install-dir /opt/dotnet -channel Current -version latest\n```\n\nVocê pode querer simular a primeira instalação usando a opção -Dryrun.\n\nUma vez instalado, você pode verificar os SDKs disponíveis:\n\n```\n$ dotnet --list-sdks\n2.2.108 [/opt/dotnet/sdk]\n3.0.100 [/opt/dotnet/sdk]\n$ dotnet --version\n3.0.100\n```\n\n"
    },
    {
      "title": "Telemetria",
      "level": 2,
      "content": "Telemetria está habilitada por padrão, mas pode ser desabilitada definindo a variável de ambiente DOTNET_CLI_TELEMETRY_OPTOUT=1.\n\n"
    },
    {
      "title": "Não foi possível encontrar nenhuma versão compatível do framework",
      "level": 3,
      "content": "Se você receber o seguinte erro ao tentar executar um projeto recém-criado, não precisará mais definir uma variável DOTNET_ROOT, conforme descrito nas soluções de vários problemas do github. O pacote dotnet do Arch (a partir de 3.1) o instala no local recomendado pela Microsoft de /usr/share/dotnet.\n\n```\n$ dotnet run\n```\n\n```\nIt was not possible to find any compatible framework version\nThe framework 'Microsoft.AspNetCore.App', version '3.1.0' was not found.\n  - No frameworks were found.\n\nYou can resolve the problem by installing the specified framework and/or SDK.\n\nThe specified framework can be found at:\n  - https://aka.ms/dotnet-core-applaunch?framework=Microsoft.AspNetCore.App&framework_version=3.1.0&arch=x64&rid=arch-x64\n```\n\nIsso é causado porque o tempo de execução é enviado como um pacote separado no Arch. Você só precisa garantir que o pacote aspnet-runtime também esteja instalado.\n\n"
    },
    {
      "title": "Erro \"the required library libhostfxr.so could not be found\"",
      "level": 3,
      "content": "Algumas das ferramentas do SDK dotnet (por exemplo, libman, dotnet-watch etc.) podem esperar que você tenha a variável de ambiente DOTNET_ROOT pré-configurada. Se não for, um erro como este pode ser observado: [1]\n\n```\nA fatal error occurred, the required library libhostfxr.so could not be found.\nIf this is a self-contained application, that library should exist in [/home/my_user/.dotnet/tools/.store/microsoft.web.librarymanager.cli/1.0.172/microsoft.web.librarymanager.cli/1.0.172/tools/netcoreapp2.1/any/].\nIf this is a framework-dependent application, install the runtime in the default location [/usr/share/dotnet] or use the DOTNET_ROOT environment variable to specify the runtime location.\n```\n\nA solução é exportar manualmente DOTNET_ROOT no seu shell:\n\n```\n~/.bashrc\n```\n\n```\nexport DOTNET_ROOT=/opt/dotnet\n```\n\n"
    },
    {
      "title": "O SDK especificado não pôde ser encontrado",
      "level": 3,
      "content": "Acredita-se que isso seja causado por um conflito entre as bibliotecas SDK de Mono e MSBuild e as do dotnet core. Para corrigir isso, exporte o caminho manualmente no seu shell (substituindo o número da versão conforme necessário), por exemplo:\n\n```\n~/.bashrc\n```\n\n```\nexport MSBuildSDKsPath=$( echo /usr/share/dotnet/sdk/3.*/Sdks );\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Site do .NET Core\n- A Fundação .NET\n- Navegador de API do .NET\n\n"
    }
  ]
}