{
  "title": "64-bit FAQ (العربية)",
  "url": "https://wiki.archlinux.org/title/64-bit_FAQ_(%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nمقالات ذات صلة\n\n- Arch terminology\n- Arch User Repository#Frequently asked questions\n- General troubleshooting\n\n"
    },
    {
      "title": "ما هي توزيعة آرتش لينُكس؟",
      "level": 3,
      "content": "قم بالاطلاع على مقالة آرتش لينُكس.\n\n"
    },
    {
      "title": "ما الأسباب التي تجعلني لا استخدام آرتش لينُكس؟",
      "level": 3,
      "content": "قد لا ترغب باستخدام آرتش في حال كنت:\n\n- لا تملك القدرة أو الوقت أو الرغبة في استخدام توزيعة جنو/لينُكس تعمل بمبدأ 'افعلها بنفسك'.\n- تريد الحصول على توزيعة تدعم معماريات أخرى غير x86_64.\n- تتخذ موقفاً رافضاً لاستخدام توزيعة توفر فقط برمجيات حرَّة بالمفهوم الذي نصَّ عليه مشروع جنو.\n- تعتقد بأنَّ نظام التشغيل يجب أن يُعِدَ نفسه بنفسه، ويكون جاهز مباشرةً بعد تثبيته، وأن يتضمن بيئة سطح مكتب وطقم برمجيات متكامل إفتراضياً.\n- لا ترغب بتوزيعة جنو/لينُكس متدحرجة.\n- مرتاحاً مع نظام التشغيل الذي تستخدمه حالياً.\n\n"
    },
    {
      "title": "لم قد أريد استعمال آرتش؟",
      "level": 3,
      "content": "لأن ارتش هو الأفضل.\n\n"
    },
    {
      "title": "ما المعماريات التي تدعمها توزيعة آرتش؟",
      "level": 3,
      "content": "لا تدعم آرتش سوى الأجهزة بمعماريّة x86_64 (والتي تدعى أحياناً بـ amd64). أوُقِفَ دعم معماريّة i686 في تشرين الثاني من عام 2017 [١]. أقرأ قسم #هل يمكنني الانتقال من معماريّة i686 إلى معماريّة x86_64 بدون إعادة تثبيت النظام؟ إن كنت تملك جهازاً يعمل بإصدار آرتش ذو معماريّة i686 ولكن معالجك قادر على تشغيل الأنظمة بمعماريّة x86_64. إن كان جهازك لا يستطيع تشغيل الأنظمة بمعماريّة x86_64 فيمكنك التفكير باستخدام توزيعة آرتش لينُكس 32.\n\n"
    },
    {
      "title": "هل تدعم آرتش المعالجات بمعماريّة ARM؟",
      "level": 3,
      "content": "لا، ولكن مشروع آرتش لينُكس ARM يوفر نسخ من توزيعة آرتش لينُكس لعدة منصات ARM. طالع [٢][dead link 2024-01-13 ⓘ].\n\n"
    },
    {
      "title": "هل تتبع آرتش التسلسل الهرمي القياسي لنظام الملفات المطروح من قبل مؤسسة لينُكس؟",
      "level": 3,
      "content": "تتبع توزيعة آرتش لينُكس التسلسل الهرمي لنظام الملفات (Linux Foundation's Filesystem Hierarchy Standard) لأنظمة التشغيل التي تستخدم مدير الخدمات سيستم دي. طالع file-hierarchy(7) للحصول على شرح لكل دليل ودلالته. تعد الملفات في الدليل /bin و /sbin و /usr/sbin روابط لينة (symbolic links) للملفات في الدليل /usr/bin، كما الملفات في الدليل /lib و /lib64 هي روابط لينة للملفات في الدليل /usr/lib.\n\n"
    },
    {
      "title": "أنا مستخدم مبتدئ لأنظمة جنو/لينُكس، هل تنصحني باستخدام آرتش؟",
      "level": 3,
      "content": "إن كنت جديداً وتريد استخدام آرتش فيجب أن تكون مستعداً لاستثمار وقت لا بأس به في تعلم نظام جديد، ويجب أن تكون متقبلاً أنَّ توزيعة آرتش تتبنى مبدأ افعلها بنفسك، أي أنَّ المُستخدِم هو من يقوم بتجميع النظام بنفسه.\n\nننصحك بالقيام ببحث متعمق في مُحرِّك البحث جوجل قبل السؤال، أو في المنتدى وفي التوثيقات الممتازة الموجودة في موسوعة آرتش. فهذه المصادر متاحة لك لسبب، بحيث يقضي آلاف المتطوعين عشرات الساعات في تجميع هذه المعلومات القيّمة لك.\n\n"
    },
    {
      "title": "هل تم تصميم توزيعة آرتش لتعمل كنظام للمُخدّم أم لسطح مكتب أم لمحطة عمل؟",
      "level": 3,
      "content": "لم يتم تصميم آرتش ﻷي نوع معين من الاستخدام بل تم تصميمه لنوع معين من المستخدمين. تستهدف آرتش المستخدمين المتقدمين الذين يجدون المتعة في طبيعة آرتش القائمة على مبدأ \"افعلها بنفسك\" والمستخدمين الذين يستثمرونه لتجهيز نظام تشغيل بما يتوافق مع احتياجاتهم. وبالتالي يمكن استخدام آرتش لأي غرض كان، فالعديد يستخدمون آرتش على أسطح مكاتبهم ومنصة العمل الخاصة بهم سوياً، وبالطبع فإن مُخدّم موقع archlinux.org يعمل على توزيعة آرتش.\n\n"
    },
    {
      "title": "أنا حقاً معجب بآرتش باستثناء ميزة فلانية يجب على فريق التطوير أن يضيفها",
      "level": 3,
      "content": "قم بالانخراط في مجتمع آرتش وقم بمشاركة برمجياتك وحلولك مع المجتمع. وفي حال اعتبره أعضاء المجتمع وفريق التطوير حلاً جيداً فمن الممكن أن يتم دمجه مع آرتش، فبالنهاية مجتمع آرتش يزدهر بالمساهمة ومشاركة البرمجيات والأدوات.\n\n"
    },
    {
      "title": "متى سيتوفر الإصدار الجديد من آرتش؟",
      "level": 3,
      "content": "إصدارات توزيعة آرتش هي بيئة حيّة للتثبيت أو الصيانة، تتضمن الحزم الموجودة في المجموعة base وبعض الحزم الأخرى. تصدر الإصدارات عادةً في النصف الأوّل من كل شهر.\n\n"
    },
    {
      "title": "هل توزيعة آرتش مستقرة؟ وهل ستواجهني انهيارات متكررة؟",
      "level": 3,
      "content": "المُستخدِم هو من يحدد استقرار نظامه المُتدحرِج. فالمستخدم هو من يقرر وقت التحديث ودمج التغييرات عندما يحتاجها، ويستطيع بالطبع أن يطلب المساعدة من المجتمع متى احتاج لها. الفرق بين آرتش وبقيّة التوزيعات أنَّ آرتش توزيعة تُكرِّس مبدأ 'افعلها بنفسك' تكريساً تاماً. نذكر أيضاً أنَّ التبليغ عن الانهيارات يعتبر مضيعة للوقت لأنَّ التعديل على التطبيقات ليس من مسؤوليات مطوري آرتش.\n\nطالع مقالة صيانة النظام للحصول على بعض النصائح لكيفيّة الحفاظ على استقرار توزيعة آرتش قدر الإمكان.\n\n"
    },
    {
      "title": "مشروع آرتش يحتاج إلى المزيد من الانتشار (أي الإعلانات)",
      "level": 3,
      "content": "آرتش يحصد الكثير من الانتشار كما هو ودون حملات دعائيّة، فهدف مشروع آرتش لينكس ليس أن يصبح كبيراً بل أن يحصد نمو طبيعي ومُستدام بين فئة المُستخدمين المُستهدفة.\n\n"
    },
    {
      "title": "مشروع آرتش يحتاج إلى المزيد من المطورين",
      "level": 3,
      "content": "ربما هذا صحيح، لا تتردد في التطوّع وتقديم جزء من وقتك، قم بزيارة المنتديات و قنوات IRC والقوائم البريدية للتعرُّف على الأمور التي يجب القيام بها، فالاشتراك في منتديات المجتمع وسيلة جيدة للبدء.\n\n"
    },
    {
      "title": "لماذا الإنترنت على جهازي بطيء جداً مقارنةً مع الأنظمة الأخرى؟",
      "level": 3,
      "content": "هل شبكتك مُعدة بشكل صحيح؟ ألقِ نظرة على مقالة إعداد الشبكة للمزيد من المعلومات.\n\nعليك الانتباه أيضاً إلى أنَّ تقنيّة التلاعب بالبيانات لا تأتي مفعلة في آرتش لينُكس تلقائياً، فإذا استخدم برنامج ما اتصال الإنترنت الخاص بك بكامل سرعته - بغض النظر ما إذا كان عن طريق إتصال P2P أو إتصال client-server تقليدي - فمن الممكن جداً أن تواجه البرامج الأخرى تأخيرات أو رسائل انتهاء المهلة أثناء الاتصال، ولتفادي هذه الإشكاليات يمكن استعمال الجدران الناريّة مثل شوروول (Shorewall) أو فورمور (Vuurmuur)، كما تتوفر برمجيات ساكنة (static scripts) لحزمة iproute2 (مثل هذا) والتي تسمح بتنظيم الاتصالات على الشبكة.\n\n"
    },
    {
      "title": "لماذا يستهلك آرتش كل الذاكرة العشوائيّة على جهازي؟",
      "level": 3,
      "content": "أساساً الذاكرة الغير مستخدمة هي ذاكرة ضائعة.\n\nالعديد من المستخدمين الجدد يلاحظون أنَّ نواة لينُكس تتعامل مع الذاكرة العشوائيّة بشكل مختلف عمّا اعتادوا عليه. بما أنَّ النفاذ إلى البيانات المخزنة في الذاكرة العشوائيّة أسرع بكثير من النفاذ إلى الأقراص الصلبة، تقوم النواة بتحديد البيانات المُستخدمة مؤخراً وتخزنها في الذاكرة العشوائية بشكل مؤقت، ولا يتم مسح هذه البيانات إلا عندما تمتلئ الذاكرة ويحتاج النظام إلى تخزين بيانات جديدة عليها.\n\nولتوضيح هذا الالتباس سنضرب المثال التالي باستخدام أشهر أمر في مراقبة الذاكرة وهو الأمر free:\n\n```\n$ free -h\n```\n\n```\ntotal        used        free      shared  buff/cache   available\nMem:           2.8G        1.1G        283M        224M        1.4G        1.2G\nSwap:          3.0G        881M        2.1G\n```\n\nمن المهم ملاحظة الفرق بين الذاكرة المتوافرة (active) والحرَّة (free).\n\nفي المثال السابق، يملك الحاسوب ذاكرة عشوائيّة مقدارها 2.8 غيغابايت يظهر أنَّه يستهلك معظمها، ولا يوجد سوى مقدار 283 ميغابايت من الذاكرة حُر. بالرغم من ذلك يتوافر مقدار 1.4 غيغابايت من الذاكرة في خانة \"buff/cache\" (مُخزنة مؤقتاً) ولاتزال هناك 1.2 غيغابايت متوافرة لبدء تطبيقات جديدة وبدون استخدام قسم السواب (swap). أقرأ دليل البرمجيّة عبر الأمر man free(1) للمزيد من التفاصيل.\n\nما هي المحصلة من كل هذه الأمور؟ المحصلة هي الأداء العالي.\n\nقم بالاطلاع على هذه المقالة الرائعة أو هذا الموقع المختص بتوضيح هذه الأمور: https://www.linuxatemyram.com/.\n\n"
    },
    {
      "title": "أين اختفت كل مساحة جهازي الخالية؟",
      "level": 3,
      "content": "الجواب على هذا السؤال يعتمد على نظامك، هناك بعض الأدوات الجيدة التي قد تساعدك في العثور على الجواب.\n\n"
    },
    {
      "title": "لقد وجدت خطأً في الحزمة \"س\"، ما الذي يجب أن أفعله؟",
      "level": 3,
      "content": "في البداية يجب أن تعرف ما إذا كان فريق آرتش قادراً على إصلاح هذا الخطأ أم لا، ففي بعض الأحيان لا يستطيع فريق آرتش إصلاحه (على سبيل المثال، انهيارات متصفح فَيرفُكس يجب أن يتعامل معها فريق موزيلا) وفي هذه الحال يسمى خطأًً منبعياً (أي خطأ من الحزمة نفسها ولا علاقة لآرتش به)، أما إذا كان الخطأ من آرتش فهناك عدة خطوات يمكنك اتباعها:\n\n1. ابحث في المنتديات للحصول على مزيد من المعلومات حول الخطأ ولكي تعرف ما إذا كان أحد غيرك قد لاحظه.\n1. قم بالتبليغ عن الخطأ وإرفاق معلومات مفصلة في موقع: https://bugs.archlinux.org.\n1. إذا كنت ترغب فقم بكتابة موضوع في المنتدى تشرح فيه المشكلة وما إذا كنت قد أبلغت عنها أم لا، فهذا الأمر سيساعد في منع الكثير من الناس من التبليغ عن الخطأ نفسه مرَّة أخرى.\n\n"
    },
    {
      "title": "يجب على حزم آرتش أن تستخدم تسمية فريدة، فالتسميات الحاليّة طويلة جداً ومربكة",
      "level": 3,
      "content": "تم مناقشة هذا الأمر على القائمة البريديّة الخاصة بآرتش. البعض اقترح اللاحقة .pac، لكن في الوقت الراهن لا توجد أي خطة لتغيير صيغة الحزم، وقد قال توبياس كيسليش، أحد مطوري آرتش: \"الحزمة عبارة عن ملف تار مضغوط بصيغة [xz]! ويمكن فتحه أو فحصه أو تعديله باستخدام أي تطبيق قادر على التعامل مع الملفات المضغوطة، كما أن أغلب التطبيقات تتعرف تلقائياً وبشكل صحيح على صيغته\".\n\n"
    },
    {
      "title": "يفتقر مدير الحزم باكمان إلى مكتبة تُمكّن التطبيقات الأخرى من الوصول إلى معلومات الحزم",
      "level": 3,
      "content": "منذ الإصدار رقم 3.0.0 أصبح مدير الحزم باكمان واجهة لمكتبة libalpm (\"مكتبة إدارة حزم آرتش لينُكس\")، تُمكّن هذه المكتبة الآخرين من برمجة واجهات بديلة (على سبيل المثال برمجة واجهة رسوميّة بدلاً من النصيّة).\n\n"
    },
    {
      "title": "مدير الحزم باكمان يحتاج إلى الميزة \"س\"",
      "level": 3,
      "content": "إن كنت تظن أنَّ الفكرة تستحق العناء يمكنك البدأ بمناقشة الأمر في القائمة البريديّة لمطوري باكمان والتحقق أيضاً في مُبلِغ العلل مما إذا كانت هناك طلبات مشابهة على هذه الميزة.\n\nغير أنَّ أفضل طريقة للحصول على ميزة في باكمان أو آرتش لينُكس عموماً هي أن تقوم بصناعتها بنفسك. قد يتم قبول الشيفرة البرمجيّة أو الرقعة أو قد لا يتم قبولها رسمياً، لكن ربما سيُقدِّر المستخدمون الآخرون جهدك وسيقومون بتجربة ومشاركة ما قمت بصنعه.\n\n"
    },
    {
      "title": "لقد قمت للتو بتثبيت الحزمة \"س\"، كيف يمكنني تشغيلها؟",
      "level": 3,
      "content": "إذا كنت تستخدم بيئة سطح مكتب مثل كدي أو جنوم فيجب على البرنامج أن يظهر تلقائياً في قائمة البرامج، أما إذا كنت تحاول تشغيل البرنامج من الطرفيّة ولكنك لا تذكر اسمه تماماً فقم بتنفيذ:\n\n```\n$ pacman -Qlq package_name | grep bin\n```\n\n"
    },
    {
      "title": "لماذا لا توجد سوى نسخة واحدة من كل مكتبة مشتركة في المستودعات الرسمية؟",
      "level": 3,
      "content": "هناك العديد من التوزيعات مثل ديبيان توفر نسخ مختلفة من نفس المكتبة، مثلاً: libfoo1 libfoo2 libfoo3، لكن في هذا الحالة من المحتمل أن يتم الحصول على تطبيقات تم بناؤها على نسخ أخرى من libfoo مثبتة على النظام نفسه.\n\nعلى خلاف ديبيان فإن آرتش توزيعة دائمة التحديث وتعتمد مبدأ الإصدار المتدحرج، والسمة الأكثر وضوحاً في التوزيعة دائمة التحديث هي توفر أحدث النسخ من البرامج في المستودعات، وفي حال توزيعة مثل آرتش فهذا يعني أيضاً أنه فقط النسخة الأخيرة من الحزم يصلها الدعم رسمياً، وهذا الأمر يُمكّن المشرفين على الحزم من قضاء وقت أكبر في التأكد من أن النسخ الجديدة تعمل بكفاءة، كما أنه حالما يُصدِر مطور مكتبة مشتركة ما نسخة جديدة منها فإنها تُضاف إلى المستودعات ويتم إعادة بناء الحزم المرتبطة بالمكتبة لكي تتوافق معها.\n\n"
    },
    {
      "title": "ماذا لو قمت بترقية شاملة لحزم النظام وكان هناك تحديث لمكتبة مشتركة فقط بدون وجود تحديث للتطبيقات التي تعتمد عليها؟",
      "level": 3,
      "content": "من المستحيل حدوث شيء كهذا. لنفترض أنَّ هناك تطبيق يسمى foobaz موجود في المستودعات الرسميّة، وبُنيت تحديثات جديدة لمكتبة اسمها libbaz، فسيُحدَث هذا التطبيق تلقائياً مع مكتبته. حتى وإن لم تنجح عملية البناء، سيكون في الحزمة foobaz مسرود إصدار الاعتمادية (المكتبة) التي يحتاجها (وليكن مثلاً libbaz 1.5)، وبالتالي سيتم حذفه بواسطة مدير الحزم باكمان خلال تحديث libbaz نتيجة حدوث تضاربات.\n\nإذا كان تطبيق foobaz حزمة بنيتها بنفسك وثبتّها من مستودع مستخدمي آرتش (AUR) فعليك محاولة إعادة بناء foobaz اعتماداً على الإصدار الجديد من libbaz. يجدر عليك الإبلاغ عن المشكلة إذا ما فشل التحديث إلى مطوري foobaz.\n\n"
    },
    {
      "title": "هل من الممكن أن يتواجد تحديث رئيسي للنواة في المستودع دون أن يتوفر تحديث لكل حزم التعريفات المرتبطة بها؟",
      "level": 3,
      "content": "لا هذا غير ممكن، فالتحديثات الرئيسية للنواة (مثال: تحديث نواة لينُكس من الإصدار 1-3.5.0 إلى 1-3.6.0) تكون دائماً مصحوبة بعملية إعادة بناء لكل حزم التعريفات المدعومة من النواة. ولكن إذا كانت إحدى حزم التعريفات غير المدعومة من النواة، مثل حزمة (على سبيل المثال من AUR) مثبتة لديك فمن الممكن أن يسبب تحديث النواة أضراراً في نظامك في حال لم تقم بإعادة بناء الحزمة لتتوافق مع النواة الجديدة. المستخدمون هم المسؤولون عن تحديث أي حزمة تعريفات غير مدعومة على أجهزتهم.\n\n"
    },
    {
      "title": "ما الذي يجب القيام به قبل الترقية؟",
      "level": 3,
      "content": "طالع مقالة صيانة النظام.\n\n"
    },
    {
      "title": "صدر تحديث جديد للحزمة الفلانية، ولكن باكمان يقول أنَّ جميع حزم النظام محدثة لآخر إصداراتها!",
      "level": 3,
      "content": "لا تتم مزامنة مرايا مدير الحزم باكمان على الفور. لذلك قد يأخذ وصول التحديث إليك ما يربو على 24 ساعة. ليس بيدك سوى الانتظار أو محاولة استخدام مرايا جديدة. يُمكن أن يساعدك موقع حالة المرايا على معرفة المرايا المُحدثة والمتزامنة مع تحديثات الحزم اﻷخيرة.\n\n"
    },
    {
      "title": "صدر تحديث جديد من المنبع للمشروع \"س\". كم سيستغرق وصول هذا التحديث إلى آرتش؟",
      "level": 3,
      "content": "يتم إصدار تحديثات الحزم حالما تكون جاهزة. يمكن أن يستغرق ذلك بضعة ساعات إذا ما كان التحديث المنبعي عبارة عن إصلاح بسيط لبعض العلل ويمكن أن يستغرق الأمر عدة أسابيع إذا كان تحديث كبير على مجموعة كبيرة من الحزم الرئيسيّة. يعتمد مقدار الوقت المُستغرَق في جلب التحديثات من المنبع إلى آرتش على عدد الحزم المُحدثة وعدد مشرفي الحزم المُتفرغين. وقد تقضي بعض الحزم أيضاً بعض الوقت في المستودع التجريبي مما يؤدي إلى إطالة مدّة وصولها إلى المُستخدمين. يبذل مشرفي الحزم قصارى جهدهم لإيصال التحديثات المُستقرة بأسرع وقت إلى المستودعات. إذا وجدت حزمة في المستودعات الرسميّة ليست بآخر إصداراتها يرجى التوجّه إلى موقع الحزم وتعليمها على أنَّها كذلك.\n\n"
    },
    {
      "title": "آرتش يحتاج إلى مُثبّت ذو واجهة رسومية",
      "level": 3,
      "content": "بما أن عملية التثبيت لا تحدث كثيراً (إقرأ ما تبقى من هذه المقالة لمعرفة المزيد عن مفهوم الإصدار المتدحرج) فهي لا تشكل أولويّة كبيرة لدى المطورين أو المستخدمين. تم تحديث دليل التثبيت من قبل متطوعينا ليتضمن إرشادات شاملة لعمليّة التثبيت من سطر الأوامر (ألق نظرة عليه!).\n\n"
    },
    {
      "title": "لقد ثبّتُ آرتش، وأنا الآن لا أجد سوى الصدفة! ماذا يجب أن أفعل؟",
      "level": 3,
      "content": "طالع مقالة نصائح عامة.\n\n"
    },
    {
      "title": "ما هي بيئة سطح المكتب أو مدير النوافذ الذي يجب أن استعمله؟",
      "level": 3,
      "content": "بما أنَّ هناك الكثير منهم، قم باختيار الأنسب لاحتياجاتك. ألق نظرة على مقالة بيئة سطح المكتب و مدير النوافذ.\n\n"
    },
    {
      "title": "ما الذي يجعل توزيعة آرتش فريدةً عن باقي التوزيعات التي تشابهها في طريقة التثبيت؟",
      "level": 3,
      "content": "طالع مقالة مقارنة آرتش مع توزيعات أخرى.\n\n"
    },
    {
      "title": "كيف يمكنني معرفة إذا كان معالجي متوافق مع معمارية x86_64؟",
      "level": 3,
      "content": "إذا كان معالجك متوافق مع معماريّة x86_64 ستجد العلم lm في الملف proc/cpuinfo/. يمكنك استخدام أمر كهذا:\n\n```\n$ grep -w lm /proc/cpuinfo\n```\n\nسيساعد استخدام CPU-Z، في نظام ويندوز، على تحديد ما إذا كان معالجك متوافق مع معماريّة 64bit أم لا. معالجات AMD من النوع \"AMD64\" أو معالجات إنتل من النوع \"EM64T\" ينبغي أن تكون متوافقة مع معماريّة x86_64.\n\n"
    },
    {
      "title": "لماذا معماريّة 64bit؟",
      "level": 3,
      "content": "لأنَّهأً أسرع في معظم الظروف وهي أيضاً أأمن لوجود نظام التحديد العشوائي لأماكن الذاكرة (ALSR). إن كان حاسوبك يملك ذاكرة عشوائيّة أكثر من 4GB فقط الأنظمة بمعماريّة 64 ستتمكن من استغلالها بالكامل.\n\n"
    },
    {
      "title": "هل يمكنني الانتقال من معماريّة i686 إلى معماريّة x86_64 بدون إعادة تثبيت النظام؟",
      "level": 3,
      "content": "لا، لا يمكنك ذلك. جميع الحزم يجب أن يُعاد تثبيتها وإعدادها (إن لزم إعادة إعدادها) لتتوافق مع المعماريّة الجديدة. بالرغم من ذلك، ليس من الضروري إعادة تقسيم أو إعادة تهيئة القرص الصلب خلال عمليّة التثبيت، فمن الممكن ترحيل جميع بياناتك القديمة. يوجد موضوع حول ذلك في المنتدى يقوم بعنونة الخطوات اللازمة للانتقال من معماريّة 32 إلى 64 بدون خسارة إي إعدادات أو بيانات من خلال الاستعانة بقرص صلب خارجي.\n\nيمكنك أيضاً تشغيل نسخة حية بمعماريّة 64 ووصْل (mount) القرص ونسخ جميع الأشياء التي تريد الاحتفاظ بها والتي ليست ملفات تنفيذيّة ومن ثم تثبيت النظام.\n\nاطّلع على مقالة التنقل بين المعماريات للمزيد من المعلومات.\n\n"
    }
  ]
}