{
  "title": "AbiWord (Español)",
  "url": "https://wiki.archlinux.org/title/AbiWord_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-02-09** \n\nAbiWord es un procesador de textos que ofrece una alternativa más liviana que LibreOffice Writer y OpenOffice Writer, mientras que al mismo tiempo proporciona una gran funcionalidad. AbiWord admite muchos tipos de documentos estándar, como documentos ODF, documentos Microsoft Word, documentos WordPerfect, documentos Rich Text Format y páginas web HTML.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete abiword. Es posible que desee instalar diccionarios si desea realizar una revisión ortográfica, el cual puede ser proporcionado por el paquete aspell-es para el idioma español.\n\nPara solucionar los problemas del cursor pequeño y el texto desalineado, instale o ttf-liberation o ttf-ms-fontsAUR y gnu-free-fonts.\n\n"
    },
    {
      "title": "Directorio de configuración del usuario",
      "level": 2,
      "content": "Desde la versión 3.0, AbiWord utiliza la carpeta ~/.config/abiword para almacenar los archivos del usuario.\n\nLas versiones anteriores de AbiWord utilizaban ~/.config/AbiSuite, y, si se encuentra al iniciarse, se le cambiará automáticamente el nombre en consecuencia. Si tanto ~/.config/AbiSuite como ~/.config/abiword no existen , AbiWord no la creará.\n\n"
    },
    {
      "title": "Plantillas",
      "level": 2,
      "content": "AbiWord proporciona un sistema de plantillas que permite acelerar la escritura de documentos comunes. Las plantillas se proporcionan como archivos .awt, para AbiWord Template.\n\nLos archivos de plantillas se buscan dentro de las carpetas /usr/share/abiword-3.0/templates y ~/.config/abiword/templates.\n\n"
    },
    {
      "title": "Usar las plantillas",
      "level": 3,
      "content": "En un nuevo documento, seleccione Archivo > Nuevo utilizando una plantilla..., luego, en el cuadro de diálogo \"Nuevo documento\", seleccione una de las plantillas que se encuentran listadas, o haga clic en \"Abrir\" para navegar por sus archivos en busca de un archivo AbiWord (no necesariamente un archivo .awt).\n\n"
    },
    {
      "title": "Crear o cambiar plantillas",
      "level": 3,
      "content": "AbiWord le permite crear sus propios archivos de plantilla, con el estilo, texto, tablas, etc. deseados.\n\nPara crear/cambiar un archivo de plantilla, simplemente abra un documento nuevo/existente y realice los cambios deseados al archivo. Luego, use la opción del menú \"Guardar como\" para nombrarlo como desee, con .awt como extensión (por ejemplo, foobar.awt) y guárdelo en ~/.config/abiword/templates. Ahora, puede acceder a su nueva plantilla en Archivo > Nuevo utilizando una plantilla... por su nombre de archivo (foobar.awt en el ejemplo dado).\n\n"
    },
    {
      "title": "Comprobación de gramática",
      "level": 2,
      "content": "Habilite la revisión gramatical desde Editar > Preferencias > Corrección ortográfica > Verificación automática de gramática.\n\n"
    },
    {
      "title": "Cambiar los atajos de teclado",
      "level": 2,
      "content": "Puede cambiar los atajos de teclado predeterminados en AbiWord usando KeyBindings.\n\nPara establecer los atajos de teclado, edite ~/.config/abiword/profile y, dentro de la etiqueta AbiPreferences, agregue los KeyBindings deseados. Por ejemplo, puede agregar KeyBindings=\"viEdit\" o KeyBindings=\"emacs\".\n\n"
    },
    {
      "title": "Fuentes LaTeX",
      "level": 2,
      "content": "El paquete abiword viene con una función que le permite al usuario insertar códigos LaTeX en un documento. Para que se muestren correctamente los símbolos matemáticos, vea Fonts (Español)#Matemáticas.\n\n"
    }
  ]
}