{
  "title": "AbiWord (한국어)",
  "url": "https://wiki.archlinux.org/title/AbiWord_(%ED%95%9C%EA%B5%AD%EC%96%B4)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "AbiWord is a word processor that provides a lighter alternative for LibreOffice Writer and OpenOffice Writer, while at the same time providing great functionality. AbiWord supports many standard document types, such as ODF documents, Microsoft Word documents, WordPerfect documents, Rich Text Format documents and HTML web pages.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the abiword package.\n\nAbiWord can use multiple spell checking dictionaries, see Language checking.\n\nTo fix tiny cursor and misaligned text issues, install either ttf-liberation or ttf-ms-fontsAUR and gnu-free-fonts.\n\n"
    },
    {
      "title": "Templates",
      "level": 2,
      "content": "AbiWord provides a template system that enables to speed up writing common documents. Templates are provided as .awt files, for AbiWord Template.\n\nTemplate files are searched inside of /usr/share/abiword-3.0/templates and ~/.config/abiword/templates folders.\n\n"
    },
    {
      "title": "Using templates",
      "level": 3,
      "content": "In a new document, choose File > New using Template..., then, in the \"New Document\" dialog, select one of the templates found and listed, or click \"Open\" to browse your files for an AbiWord file (not necessarily a .awt file).\n\n"
    },
    {
      "title": "Creating or changing templates",
      "level": 3,
      "content": "AbiWord allows to make your own template files, with the desired style, text, tables etc.\n\nIn order to create/change a template file, simply open a new/existent document, and make the desired changes to this file. Then, use \"Save As\" menu option to name it as you want, with .awt as extension (e.g. foobar.awt) and save it in ~/.config/abiword/templates folder. Now, your new template can be accessed in File > New using Template... by its filename (foobar.awt in the given example).\n\n"
    },
    {
      "title": "Mail Merge",
      "level": 3,
      "content": "You can create a CSV file with your data to be used, and run Abiword from the command line against a template to directly render your final files. See this guide for more details.\n\n"
    },
    {
      "title": "Grammar checking",
      "level": 2,
      "content": "Enable grammar checking from Edit > Preferences > Spell Checking > Automatic grammar checking.\n\n"
    },
    {
      "title": "Change keybindings",
      "level": 2,
      "content": "You can change the default keyboard bindings in AbiWord using KeyBindings.\n\nIn order to set keybindings, edit ~/.config/abiword/profile and, inside the AbiPreferences tag, add the desired KeyBindings. For instance, you can add KeyBindings=\"viEdit\" or KeyBindings=\"emacs\"\n\n"
    },
    {
      "title": "LaTeX fonts",
      "level": 2,
      "content": "The package abiword comes with a function which allows user to insert LaTeX codes in a document. To display mathematics symbols properly, install a font which provides them: see Fonts#Math.\n\n"
    }
  ]
}