{
  "title": "AboutWiki (Русский)",
  "url": "https://wiki.archlinux.org/title/AboutWiki_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Help:Редактирование\n- Help:Стиль\n- Help:Чтение\n\nArchWiki это способ создания документации сообществом. Вся документация сделана людьми и для людей.\n\n"
    },
    {
      "title": "Цели",
      "level": 2,
      "content": "Основной целью ArchWiki является предоставление сообществу пользователей Arch Linux наиболее полной и доступной документации в вебе. Это всемирный проект со множеством участников со всех уголков земного шара. Wiki охватывает все принципы Arch Linux, в частности, простоту. ArchWiki постоянно развивается и процветает благодаря сотрудничеству; всегда есть возможности для совершенствования.\n\n"
    },
    {
      "title": "Сравнение",
      "level": 3,
      "content": "Одна из главных целей ArchWiki охватить все аспекты компьютерного использования Arch Linux. От медиацентра до управления корпоративными сетями — всё, чего можно достичь с помощью Arch Linux, входит в тематику ArchWiki.\n\n"
    },
    {
      "title": "Доступность",
      "level": 3,
      "content": "Основная цель ArchWiki грандиозна и для ее достижения необходимо огромное количество материалов; ArchWiki должна предоставлять простой и интуитивно понятный способ доступа к своей информации. Это непростая задача, но такие качества, как изобретательность и воображение, присущие философии Arch, доведут дело до конца.\n\nПакет arch-wiki-docs предоставляет пользователям возможность загрузить копию содержимого ArchWiki себе на компьютер. Смотрите обсуждение на форуме для более подробной информации.\n\n"
    },
    {
      "title": "Как это все работает",
      "level": 2,
      "content": "Поддержкой Arch Wiki занимаются Maintenance Team и тысячи участников. Пользователи редактируют и размещают статьи, предлагая читателям лучшее из документации Arch Linux. Контент создаётся сообществом для сообщества; большинство статей написаны более чем одним человеком и представляют собой накопленные знания множества людей, которые поддерживают статьи в актуальном состоянии, исправляя ошибки и дополняя содержимое ArchWiki.\n\n"
    },
    {
      "title": "Как вы можете помочь",
      "level": 2,
      "content": "ArchWiki поддерживается добровольцами. Их никогда не бывает слишком много и помощь всегда необходима. Если вы чувствуете, что можете помочь в редактировании wiki - рассмотрите возможность потратить немного своего времени и энергии в целях поддержания сообщества.\n\nСмотрите статью ArchWiki:Внесение вклада для того, чтобы узнать, как вы можете помочь.\n\n"
    },
    {
      "title": "Ранняя история",
      "level": 2,
      "content": "- 2004-01-11 || Был объявлен первоначальный википодобный способ размещения документации на форумах, основанный на специальной учётной записи пользователя, доступной для использования всем.\n- 2004-02-03 || Первое прослеживаемое предложение вики-документации для Arch Linux было сделано на форумах.\n- 2004-02-27 || Анонсирована первая вики, основанная на PhpWiki.\n- 2005-06-05 ||Предложена миграция на MediaWiki.\n- 2005-07-08 || ArchWiki установлена на базе MediaWiki.\n- 2005-07-11 || Первая правка на Wiki, сделанная в статье ArchWiki:General disclaimer.\n- 2005-07-11 || Первая правка в основном пространстве имён, сделанная в статье Main page.\n- 2005-07-18 || На форумах было объявлено о новой Wiki: таким образом началась миграция ранее существовавших статей из PhpWiki.\n\n"
    },
    {
      "title": "Контакты",
      "level": 2,
      "content": "Список координаторов ArchWiki можно найти на странице Maintenance Team.\n\n"
    },
    {
      "title": "Благодарности",
      "level": 2,
      "content": "- Хостинг любезно предоставлен командой Arch Linux\n- Реализовано на платформе MediaWiki\n- Большое спасибо всем участникам и людям, которые нас поддерживают!\n\n"
    }
  ]
}