{
  "title": "AboutWiki (Indonesia)",
  "url": "https://wiki.archlinux.org/title/AboutWiki_(Indonesia)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Help:Editing\n- Help:Style\n- Help:Reading\n\nArchWiki adalah sebuah dokumentasi tentang Archlinux yang dibuat oleh dan untuk komunitas itu sendiri.\n\n"
    },
    {
      "title": "Tujuan",
      "level": 2,
      "content": "Tujuan utama dari ArchWiki adalah untuk menyediakan dokumentasi untuk komunitas pengguna Arch Linux yang paling komprehensif dan yang paling dapat diakses di web. Ini adalah proyek multi-nasional dengan banyak kontributor yang tersebar di seluruh penjuru dunia. Wiki ini mencakup prinsip Arch yang menjunjung konsepkesederhanaan.ArchWiki terus berkembang dan tumbuh subur dengan kolaborasi serta akan selalu disempurnakan.\n\n"
    },
    {
      "title": "Komprehensif",
      "level": 3,
      "content": "Salah satu target utama ArchWiki adalah menjangkau semua aspek penggunaan komputer dengan Archlinux. Dari pusat media hingga pengelolaan jaringan perusahaan, semuanya dapat dilakukan dengan bantuan ArchWiki.\n\n"
    },
    {
      "title": "Mudah Diakses",
      "level": 3,
      "content": "Tujuan utama dari ArchWiki memang muluk, sehingga ribuan artikel sangat dibutuhkan; ArchWiki seharusnya dapat menawarkan cara yang sederhana dan intuitif dalam mengakses semua informasi. Ini bukan tugas yang mudah, namun kecerdikan dan imajinasi Arch yang khas akan menyanggupinya.\n\nPaket arch-wiki-docs yang tersedia di repository [community] menawarkan kemampuan untuk dapat mengunduh salinan konten ArchWiki kepada pengguna. Lihat forum diskusi ini untuk info lebih lanjut.\n\n"
    },
    {
      "title": "Bagaimana cara kerjanya?",
      "level": 2,
      "content": "ArchWiki dikelola oleh beberapa administrators dan beribu kontributor.Pengguna mengubah dan mengatur sedemikian rupa artikel yang ada agar dapat menjadikannya sebagai sumber referensi terbaik untuk Archlinux.Sebagian besar artikel yang ada tidak dibuat secara individu,melainkan artikel yang sudah diedit berkali-kali oleh banyak orang guna melakukan perbaikan,penyempurnaan serta pembaruan artikel agar sesuai dengan keadaan.\n\n"
    },
    {
      "title": "Bagaimana Anda bisa membantu?",
      "level": 2,
      "content": "ArchWiki dikelola oleh para sukarelawan.Tidak ada istilah 'terlalu banyak relawan' karena setiap bantuan selalu diterima.Jika Anda merasa mampu menyempurnakan ArchWiki,maka luangkanlah waktu Anda untuk melakukannya sehingga komunitas Archlinux semakin berkembang.\n\nSilahkan lihat ArchWiki:Tasks untuk mengetahui bagaimana cara berkontribusi.\n\n"
    },
    {
      "title": "Contacts",
      "level": 2,
      "content": "Lihat ArchWiki:Administrators untuk daftar koordinator ArchWiki.\n\n"
    },
    {
      "title": "Thanks",
      "level": 2,
      "content": "- Hosting is graciously provided by the Arch Linux team\n\n- Powered by MediaWiki\n\n- Thanks to all our contributors and supporters!\n\n"
    }
  ]
}