{
  "title": "AboutWiki (Magyar)",
  "url": "https://wiki.archlinux.org/title/AboutWiki_(Magyar)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Help:Editing\n- Help:Reading\n\nAz Archwiki egy közösségi dokumentációs oldal. Tartalmát a közösség tagjai készítik a közösség többi tagja számára.\n\n"
    },
    {
      "title": "Célok",
      "level": 2,
      "content": "Az Archwiki elsődleges célja, hogy a legátfogóbb és legkönyebben hozzáférhető webes dokumentációt nyújtsa az Arch Linux közösség tagjai számára. Ez egy világméretű projekt, melyhez a világ minden részéről vannak hozzájárulók. Természetesen az „egyszerűséget”, ami az Az Arch Módszer egy fontos eleme, ez a wiki is követi. A hozzájárulásoknak köszönhetően az Archwiki folyamatosan növekszik.\n\n"
    },
    {
      "title": "Átfogó",
      "level": 3,
      "content": "Az Archwiki egyik legfontosabb célkitűzése, hogy minden Arch Linux-szal megvalósítható dologról tartalmazzon információt. Legyen az egy médiacenter létrehozása, vagy hálózatkezelés, bármi, ami az Arch Linux-szal kivitelezhető, az az Archwiki érdeklődési területébe tartozik.\n\n"
    },
    {
      "title": "Elérhető",
      "level": 3,
      "content": "Az Archwiki célja elsőre grandiózusnak tűnhet, és így megvalósításához cikkek ezreire van szükség, de ennek ellenére olyan módon kell az információt közölnie, hogy az mindenki számára könnyen elérhető és érthető legyen. Ez nem egyszerű feladat, de az Arch zsenialitás és leleményesség segíthet megoldani.\n\nAz arch-wiki-docs csomag formájában, ami a [community] tárolóból elérhető, bárki letöltheti az ArchWiki tartalmát. Látogass el ebbe a fórumtopicba a részletekért.\n\n"
    },
    {
      "title": "Hogyan működik?",
      "level": 2,
      "content": "Az Archwikit számos adminisztrátor és hozzájárulók ezrei tartják karban. A felhasználók szerkesztik és rendszerezik az oldalakat, hogy az olvasók számára a legjobb Arch Linux dokumentációt nyújtsák. A cikkek nagy részét nem egy ember írja, hanem az emberek azon egyre halmozódó igényének megtestesülése, hogy a téves információkat helyesbítsék, az elavult oldalakat naprakésszé tegyék, vagy hogy tovább növeljék az Archwiki által lefedett információk halmazát.\n\n"
    },
    {
      "title": "Hogyan segíthetek?",
      "level": 2,
      "content": "Az Archwikit önkéntesek működtetik. A karbantartók mindig kevesen vannak, így segítségre mindig szükség van. Ha képesnek érzed magad arra, hogy wiki oldalakat szerkessz, akkor fontold meg, hogy a szabadidőd egy részét rászánd arra, hogy a közösséget segítsd!\n\nLátogasd meg a Vegyél részt benne! oldal Wiki fejezetét, ha szeretnéd tudni, hogyan segíthetsz! Az Archwikin durván az alábbi kategóriákra lehet felosztani a feladatokat:\n\n"
    },
    {
      "title": "Technikai karbantartás",
      "level": 3,
      "content": "Jelenleg ez jelenti a legnagyobb prolémát, ugyanis kevés a technikai karbantartónk, így ezen a téren szívesen veszünk minden hozzájárulást. Keresd fel Rasat-t vagy Dusty-t, ha adminisztrátori jogokat szeretnél, vagy javításokkal szeretnél segíteni! Grafikusok szintén az adminokat keressék!\n\n"
    },
    {
      "title": "Tartalomkezelés",
      "level": 3,
      "content": "A wiki karbantartói számára az egyik legnagyobb feladattá a cikkek rendszerezése és kategorizálása vált, főleg a Kategória Fa létrehozása és fejlesztése miatt.\n\n"
    },
    {
      "title": "Tartalom szerkesztése",
      "level": 3,
      "content": "A tartalmak szerkesztése, ellenőrzése és frissítése egy wikin állandó feladat. Ha segíteni szeretnél, akkor regisztrálj, és tegyél hozzá te is! A részletekért látogass el ide: Help:Editing.\n\n"
    },
    {
      "title": "Tartalom létrehozása",
      "level": 3,
      "content": "Ha tartalmat szeretnél létrehozni keresd fel az adminok vagy rendszergazdák egyikét! Mindig tartsd a szemed előtt az Archwiki filozófiáját és gondolkozz el azon is, vajon másoknak mire lehet szüksége (nézd meg például a Kérések listáját ötletekért)! Mint már korábban említésre került, a wiki elég tág célt fogalmazott meg magának. Nézd meg Segítség kategóriát is tartalom létrehozásáról szóló cikkekért!\n\n"
    },
    {
      "title": "Ötletelés („Brainstorming”)",
      "level": 3,
      "content": "Ha nem vagy biztos benne, hogyan kezdj neki, vagy épp furának tartod, hogy mások munkájába belepiszkálj, akkor segíthetsz azzal is, ha megosztod másokkal ötleteidet. Javaslatokat tehetsz az Arch Linux Fórum Forum & Wiki discussion szekciójában.\n\n"
    },
    {
      "title": "Kapcsolat",
      "level": 2,
      "content": "Nézd meg a Kontaktok listáját az Archwiki koordinátorainak listájáért.\n\n"
    },
    {
      "title": "Köszönet",
      "level": 2,
      "content": "- A tárhely nagylelkű felajánlója az Arch Linux csapat\n\n- Az Archwikit MediaWiki motor hajtja\n\n- Köszönettel tartozunk az összes hozzájárulónak és támogatónak!\n\n"
    }
  ]
}