{
  "title": "AboutWiki (Italiano)",
  "url": "https://wiki.archlinux.org/title/AboutWiki_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articoli correlati\n\n- Help:Editing (Italiano)\n- Help:Style (Italiano)\n- Help:Reading\n\nQuest'articolo è una panoramica generale sull'ArchWiki, che risponde alle classiche domande \"Chi?\", \"Cosa?\", \"Perchè?\", e \"Come?\".\n\n"
    },
    {
      "title": "Obiettivi",
      "level": 2,
      "content": "L'obiettivo principale dell'Archwiki è quello di fornire alla comunità di utenti Arch Linux la più completa e accessibile documentazione sul web. E' un progetto di scala mondiale che vanta partecipanti provenienti da tutti gli angoli del mondo. Il wiki è assolutamente conforme alla The Arch Way con particolare riferimento alla \"semplicità\". ArchWiki è constantemente in fase di evoluzione; inoltre, c'è sempre spazio per migliorare.\n\n"
    },
    {
      "title": "Documentazione Completa",
      "level": 3,
      "content": "Uno degli obiettivi primari dell'ArchWiki è quello di coprire \"tutti\" gli aspetti che si possano incontrare nell'uso di un computer tramite Arch Linux. Dai media center alla gestione di reti aziendali, qualsiasi cosa si possa fare con Arch Linux rientra nell'obiettivo di ArchWiki.\n\n"
    },
    {
      "title": "Documentazione Accessibile",
      "level": 3,
      "content": "L'obiettivo primario dell'ArchWiki è di proporzioni enormi, e migliaia di articoli potrebbero essere necessari a raggiungerlo; ArchWiki nonostante ciò deve fornire una strada semplice ed intuitiva per accedere a tutte queste informazioni. Non è un obiettivo facile da raggiungere, ma la tipica ingenuità e semplicità di Arch deve prevalere.\n\n"
    },
    {
      "title": "Come Funziona",
      "level": 2,
      "content": "ArchWiki è mantenuta da molti amministratori e operatori e da migliaia di contributori. Gli utenti possono modificare e organizzare gli articoli in modo da offire agli utenti il meglio della documentazione Arch Linux. I contenuti sono creati dalla comunità per la comunità: la maggior parte degli articoli non sono scritti da una sola persona, ma rappresentano un contributo cumulativo di molte persone che hanno lavorato sull'impaginazione degli articoli, hanno corretto eventuali errori, hanno aggiornato le informazioni, e continuano a migliorare i contenuti dell'ArchWiki.\n\n"
    },
    {
      "title": "Come contribuire",
      "level": 2,
      "content": "ArchWiki è mantenuto da volontari. Questi non sono mai troppi e l'aiuto è sempre ben accetto. Se vi sentite in grado di modificare le pagine wiki, una donazione del vostro tempo e della vostra energia è sempre benvenuta. In particolare, per le pagine italiane sono ben accetti dei traduttori. Vedere ArchWiki:Contributing (Italiano) per scoprire i modi in cui potete contribuire. I compiti sull'Archwiki si possono vagamente suddividere nei seguenti:\n\n"
    },
    {
      "title": "Manutenzione Tecnica",
      "level": 3,
      "content": "Attualmente stiamo affrontando alcune piccole difficoltà nella parte tecnica dell'ArchWiki. Siamo a corto di personale tecnico, e un aiuto in quest'area è particolarmente benvenuto. Chiedete a Rasat od a Dusty se volete ottenere privilegi amministrativi o se volete contribuire a risolvere queste magagne tecniche. Artisti grafici sono inoltre invitati a contattare gli amministratori.\n\n"
    },
    {
      "title": "Gestione dei contenuti",
      "level": 3,
      "content": "Ordinamento, categorizzazione, spostamento degli articoli nelle sezioni appropriate del wiki sono diventati alcuni dei compiti più importanti per i mantainer impegnati nella realizzazione e miglioramento dell'ArchWiki Category Tree (per vedere il nuovo albero delle categorie, vedere la sezione Italiano).\n\n"
    },
    {
      "title": "Modifica dei contenuti",
      "level": 3,
      "content": "La modifica, il controllo, gli aggiornamenti dei contenuti sono dei compiti senza fine in qualsiasi wiki. Se volete aiutare, registratevi al wiki e iniziate a contribuire!\n\n"
    },
    {
      "title": "Creazione di nuovi contenuti",
      "level": 3,
      "content": "Parlate con uno degli amministratori e operatori di sistema per coordinare la creazione di nuovi contenuti. Assicuratevi di capire la filosofia dell'ArchWiki e pensate a cosa gli altri vorrebbero trovare in una pagina del wiki stesso (vedere la pagina Requests per delle idee). Come anticipato, gli obiettivi del wiki sono piuttosto estesi. Controllate la categoria d'aiuto per degli articoli guida su come creare nuovi contenuti.\n\n"
    },
    {
      "title": "Brainstorming",
      "level": 3,
      "content": "Se non siete sicuri da dove iniziare, o vi mette un po' a disagio modificare il lavoro degli altri, potete anche solo contribuire con nuove idee e suggerimenti nella sezione Wiki[link interrotto 2020-08-06] del Forum Italiano di Arch Linux[link interrotto 2022-09-23] o nella sezione Forum & Wiki discussion del Forum Internazionale.\n\n"
    },
    {
      "title": "Contatti",
      "level": 2,
      "content": "Dare un'occhiata alla ContactList per una lista dei coordinatori dell'ArchWiki.\n\n"
    },
    {
      "title": "Ringraziamenti",
      "level": 2,
      "content": "- L'Hosting è gentilmente fornito dal team di Arch Linux\n\n- Powered by MediaWiki\n\n- Un ringraziamento a tutti i contributors ed ai supporters!\n\n"
    }
  ]
}