{
  "title": "Adb (Español)",
  "url": "https://wiki.archlinux.org/title/Adb_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-11-08** \n\nEl puente de depurado de Android (ADB, siglas en ingles) es una herramienta de terminal que se usa para instalar, desinstalar, depurar aplicaciones, transferir archivos y acceso al dispositivo.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "ADB hace parte de los paquetes SDK de Android y del paquete android-tools.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Esta sección se refiere a lo que generalmente se conoce como ADB (Android Debug Bridge), si existe alguna referencia a ADB es simplemente la versión en ingles.\n\n"
    },
    {
      "title": "Conectar dispositivo",
      "level": 3,
      "content": "- En algunos dispositivos, puede ser necesario activar la opción de transferencia de datos (MTP), antes que el puente de depurado funcione. Otros dispositivos requieren el modo PTP para que funcione.\n- Las reglas de udev para muchos dispositivos vienen configuradas con el paquete libmtp, así que si lo tiene instalado los siguientes pasos puede que no sean necesarios.\n- Asegúrese que su cable de USB funciona para recargar batería y para transferencia de datos. Bastantes cables de USB que vienen con el dispositivo no tienen el pin para transferencia de datos.\n\nPara conectar a un dispositivo o teléfono mediante el puente de depurado es necesario:\n\n1. Instalar el paquete android-tools. Adicionalmente, es recomendable instalar el paquete android-udev si desea conectar el dispositivo con la entrada apropiada en /dev/.\n1. conecte el dispositivo de Android con el cable USB al computador.\n1. Habilite depurado por USB en el dispositivo: Android Jelly Bean (4.2) y nuevos: en Configuración > Acerca del dispositivo clic Numero de compilación 7 veces hasta que vea una notificación que se ha vuelto programador. Después vaya a Configuración > Opciones de programador > Depuración en Android y active esta opción. El dispositivo preguntara para aceptar el computador con la huella digital pertinente, permitir de manera permanente copiara el archivo $HOME/.android/adbkey.pub en la carpeta /data/misc/adb/adb_keys del dispositivo. Versiones anterioes: generalmente se activa en Configuración > Aplicaciones > Desarrollo > Depurado en Android. Reinicie el teléfono después de activar esta opción para asegurarse que el depurado esta habilitado.\n\n- Android Jelly Bean (4.2) y nuevos: en Configuración > Acerca del dispositivo clic Numero de compilación 7 veces hasta que vea una notificación que se ha vuelto programador. Después vaya a Configuración > Opciones de programador > Depuración en Android y active esta opción. El dispositivo preguntara para aceptar el computador con la huella digital pertinente, permitir de manera permanente copiara el archivo $HOME/.android/adbkey.pub en la carpeta /data/misc/adb/adb_keys del dispositivo.\n- Versiones anterioes: generalmente se activa en Configuración > Aplicaciones > Desarrollo > Depurado en Android. Reinicie el teléfono después de activar esta opción para asegurarse que el depurado esta habilitado.\n\nSi el puente reconoce su dispositivo, o el comando adb devices muestra \"device\" y no \"unauthorized\", o es visible desde el su entorno de desarrollo; la conexión funciona. De lo contrario vea las instrucciones en la parte inferior.\n\n"
    },
    {
      "title": "Descubrimiento de dispositivos",
      "level": 3,
      "content": "Cada dispositivo de Android tiene una identificación USB de manera vendor/product. Por ejemplo un HTC Evo es:\n\n```\nvendor id: 0bb4\nproduct id: 0c8d\n```\n\nConecte su dispositivo y ejecute:\n\n```\n$ lsusb\n```\n\nDebe mostrar algo parecido:\n\n```\nBus 002 Device 006: ID 0bb4:0c8d High Tech Computer Corp.\n```\n\n"
    },
    {
      "title": "Agregar reglas de udev",
      "level": 3,
      "content": "Use las reglas del paquete android-udev o android-udev-gitAUR, instale manualmente desde desarrollador Android, o use la siguiente plantilla para sus reglas udev, simplemente reemplace [VENDOR ID] y [PRODUCT ID] con los necesarios. Copie estas reglas en el archivo /etc/udev/rules.d/51-android.rules:\n\n```\n/etc/udev/rules.d/51-android.rules\n```\n\n```\nSUBSYSTEM==\"usb\", ATTR{idVendor}==\"[VENDOR ID]\", MODE=\"0660\", GROUP=\"adbusers\"\nSUBSYSTEM==\"usb\",ATTR{idVendor}==\"[VENDOR ID]\",ATTR{idProduct}==\"[PRODUCT ID]\",SYMLINK+=\"android_adb\"\nSUBSYSTEM==\"usb\",ATTR{idVendor}==\"[VENDOR ID]\",ATTR{idProduct}==\"[PRODUCT ID]\",SYMLINK+=\"android_fastboot\"\n```\n\nDespués, cargue nuevamente las reglas udev ejecutando:\n\n```\n# udevadm control --reload-rules\n```\n\nAsegúrese que su usuario es miembro del grupo adbusers para acceder dispositivos adb.\n\n"
    },
    {
      "title": "Configuración del puente",
      "level": 3,
      "content": "en lugar de usar reglas de udev, es posible crear/editar ~/.android/adb_usb.ini. El cual contiene una lista de identificaciones de vendor.\n\n```\n~/.android/adb_usb.ini\n```\n\n```\n0x27e8\n```\n\n"
    },
    {
      "title": "Descubrimiento de dispositivo",
      "level": 3,
      "content": "Después de instalar las reglas udev, desconecte y re-conecte su dispositivo a la computadora:\n\nAhora ejecute:\n\n```\n$ adb devices\n```\n\nDeberá ver un resultado similar:\n\n```\nList of devices attached \nHT07VHL00676    device\n```\n\n"
    },
    {
      "title": "Transferencia de archivos",
      "level": 3,
      "content": "Es posible usar puente para transferir archivos entre la computadora y el dispositivo Android. Para transferir archivos al dispositivo use:\n\n```\n$ adb push <archivo-a-copiar> <donde-copiar>\n```\n\nPara transferir archivos desde el dispositivo use:\n\n```\n$ adb pull <archivo-requerido> <donde-copiar>\n```\n\nVéase #Herramientas basadas en el puente.\n\n"
    },
    {
      "title": "Herramientas basadas en el puente",
      "level": 2,
      "content": "- adbfs-rootless disponible como adbfs-rootless-gitAUR – sistema de archivos FUSE sobre el puente\n- adb-sync disponible como adb-sync-gitAUR – Herramienta para sincronizar archivos entre compuutadora y dispositivo Android que usa el puente de depurado.\n- AndroidScreencast disponible como androidscreencast-binAUR – vea y controle su dispositivo Android desde su PC.\n\n"
    }
  ]
}