{
  "title": "Advanced Linux Sound Architecture (Español)",
  "url": "https://wiki.archlinux.org/title/Advanced_Linux_Sound_Architecture_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artículos relacionados\n\n- Sound system (Español)\n- Disable PC speaker beep (Español)\n\nNote: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nLa Arquitectura Avanzada para el Sonido en Linux (conocido con el acrónimo ALSA) es un componente del kernel destinado a sustituir el original Open Sound System (Open OSSv3) para proporcionar controladores de dispositivos para las tarjetas de sonido. Además de los controladores de dispositivos de sonido, ALSA también pone a disposición una amplia biblioteca en el espacio de usuario para los desarrolladores de aplicaciones que quieran utilizar las funciones del controlador mediante un API de alto nivel con una interacción directa con los controladores del kernel.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "ALSA está incluido en el kernel de Arch por defecto como un conjunto de módulos, por lo que no es necesaria su instalación explícitamente. Pero necesita de firmware para poder reconocer el dispositivo de sonido en computadoras portátiles, tales son: alsa-firmware y sof-firmware\n\nudev explorará automáticamente el hardware en el arranque, cargando el módulo del kernel correcto para la tarjeta de sonido encontrada. Por lo tanto, el sonido debería estar funcionando desde el inicio, pero, ha de tener en cuenta que su configuración viene, por defecto, con todos los canales de audio silenciados.\n\nLos usuarios con un inicio de sesión local (en una terminal virtual o un gestor de pantalla) tienen habilitados los permisos para reproducir sonido y cambiar los niveles del mezclador. Para permitir esto en un inicio de sesión remoto, el usuario tiene que ser añadido al grupo de audio. La calidad de miembro del grupo de audio también permite el acceso directo a los dispositivos, lo que puede conducir a que se graben exclusivamente las salidas de las aplicaciones (rompiendo el software de mezcla) y frustrar el rápido intercambio entre usuarios, y multisede. Por lo tanto, la adición de un usuario al grupo de audio no es recomendable, a menos que se necesite específicamente [1].\n\n"
    },
    {
      "title": "Utilidades en el espacio de usuario",
      "level": 3,
      "content": "Instale el paquete alsa-utils que contienen la herrameinta alsamixer para el espacio de usuario, que permite la configuración de los dispositivos de sonido desde la consola o terminal. Instale también el paquete alsa-plugins si desea remuestreo en alta calidad, upmixing/downmixing y otras características avanzadas.\n\nSi desea que las aplicaciones de OSS funcionen mediante dmix (software de mezcla), instale también el paquete alsa-oss. Cargue los módulos del kernel snd_seq_oss, snd_pcm_oss y snd_mixer_oss para activar los módulos de emulación de OSS.\n\n"
    },
    {
      "title": "Abrir los canales de audio",
      "level": 2,
      "content": "La versión actual de ALSA se instala con todos los canales silenciados por defecto. Será necesario revertir manualmente el enmudecimiento de los canales.\n\nLo más cómodo es utilizar la interfaz gráfica alsamixer para hacer esto:\n\n```\n$ alsamixer\n```\n\nComo alternativa, puede usar amixer desde la línea de comandos:\n\n```\n$ amixer sset Master unmute\n```\n\nLa etiqueta MM, por debajo de un canal, indica que el canal está silenciado, y 00 indica que está abierto.\n\nEl procedimiento a seguir es el siguiente:\n\nDesplácese hasta los canales Master y PCM con las teclas ← y →, y retire el silencio pulsando la tecla m. Utilice la tecla ↑ para aumentar el volumen y obtener un «dB gain» con valor 0. El valor «gain» se puede encontrar en la parte superior izquierda junto al campo Item:. Los valores más altos de «gain» producirán sonido distorsionado.\n\nPara obtener un verdadero sonido envolvente (surround) 5.1 o 7.1 es probable que tenga que activar otros canales como Front, Surround, Center, LFE (subwoofer) y Side (estos son los nombres de los canales para el módulo Intel HD Audio, y pueden variar según el hardware). Tenga en cuenta que esto no se logrará automáticamente con Upmix para las fuentes de sonido estéreo (como, por ejemplo, la música). Con el fin de lograrlo, consulte Upmixing/Downmixing.\n\nSalga de alsamixer pulsando Esc.\n\n- Algunas tarjetas necesitan tener el canal de salida digital silenciado/apagado para poder escuchar el sonido analógico. Para la LS Soundblaster Audigy es necesario silenciar el canal IEC958.\n- Algunas máquinas, (como la Thinkpad T61), tienen un canal speaker (altavoz) que debe ser activado y ajustado también.\n- Algunas máquinas (como Dell E6400) también pueden requerir que el silencio sea desactivado en los canales Front y Headphone y ajustados\n\nSe puede ahora comprobar si el sonido funciona:\n\n```\n$ speaker-test -c 2\n```\n\nModifique el valor -c para ajustar la configuración de los altavoces. Por ejemplo, use -c 8 para 7.1:\n\n```\n$ speaker-test -c 8\n```\n\nSi esto no funciona, vaya a configuración o consulte la sección sobre solución de problemas.\n\nEl paquete alsa-utils incluye alsa-restore.service y alsa-store.service, que están preconfigurados para hacer funcionar el arranque y la parada, respectivamente.\n\n"
    },
    {
      "title": "Sin sonido en virtualbox",
      "level": 3,
      "content": "Si tiene problemas con virtualbox, el siguiente comando puede ser de ayuda:\n\n```\n$ alsactl init\n```\n\n```\nFound hardware: \"ICH\" \"SigmaTel STAC9700,83,84\" \"AC97a:83847600\" \"0x8086\" \"0x0000\"\nHardware is initialized using a generic method\n```\n\nPuede que tenga que activar la salida de ALSA en su software de audio también.\n\n"
    },
    {
      "title": "Establecer la tarjeta de sonido predeterminada",
      "level": 3,
      "content": "Si sus tarjetas de sonido cambian de orden durante el arranque, puede especificar el orden de las mismas en el archivo /etc/modprobe.d/modprobe.conf (se sugiere el archivo /etc/modprobe.d/alsa-base.conf). Por ejemplo, si desea que el tarjeta de sonido «mia» se cargue primero, colóquele el valor #0:\n\n```\n/etc/modprobe.d/alsa-base.conf\n```\n\n```\noptions snd slots=snd_mia,snd_hda_intel\noptions snd_mia index=0\noptions snd_hda_intel index=1\n```\n\nUtilice $ lsmod | grep snd para obtener una lista de dispositivos. Esta configuración asume que tiene una tarjeta de sonido «mia» usando snd_mia, y una tarjeta «snd-hda-intel» (es decir, integrada) usando snd_hda_intel.\n\nTambién puede proporcionar un índice de -2 para indicarle a ALSA que nunca use una tarjeta como la primera. Distribuciones como Linux Mint y Ubuntu utilizan la siguiente configuración para evitar que USB y de otros tipos de controladores «extraños» obtengan el índice 0:\n\n```\n/etc/modprobe.d/alsa-base.conf\n```\n\n```\noptions bt87x index=-2\noptions cx88_alsa index=-2\noptions saa7134-alsa index=-2\noptions snd-atiixp-modem index=-2\noptions snd-intel8x0m index=-2\noptions snd-via82xx-modem index=-2\noptions snd-usb-audio index=-2\noptions snd-usb-caiaq index=-2\noptions snd-usb-ua101 index=-2\noptions snd-usb-us122l index=-2\noptions snd-usb-usx2y index=-2\n# Keep snd-pcsp from being loaded as first soundcard\noptions snd-pcsp index=-2\n# Keep snd-usb-audio from beeing loaded as first soundcard\noptions snd-usb-audio index=-2\n```\n\nEstos cambios requieren un reinicio del sistema, para que surtan efectos.\n\n"
    },
    {
      "title": "Seleccionar el PCM por defecto a través de la variable de entorno",
      "level": 4,
      "content": "En el archivo de configuración, preferentemente el global, agregue:\n\n```\npcm.!default {\n   type plug\n   slave.pcm {\n     @func getenv\n     vars [ ALSAPCM ]\n     default \"hw:Audigy2\"\n   }\n }\n```\n\nEs necesario sustituir la línea «default» con el nombre de la tarjeta (en el ejemplo es Audigy2). Se pueden obtener los nombres con aplay -l o también puede utilizar los PCM como surround51. Pero si se necesita utilizar el micrófono es una buena idea seleccionar PCM full-duplex por defecto.\n\nAhora se pueden comenzar los programas seleccionando la tarjeta de sonido con solo cambiar la variable de entorno ALSAPCM. Funciona muy bien para todos los programas que no permiten seleccionar la tarjeta, para los demás asegúrese de que mantener la tarjeta predeterminada. Por ejemplo, asumiendo que escribió un PCM downmix llamado mix51to20 se puede utilizar el mismo con mplayer usando la línea de órdenes ALSAPCM=mix51to20 mplayer example_6_channel.wav\n\n"
    },
    {
      "title": "Método alternativo",
      "level": 4,
      "content": "En primer lugar, tendrá que averiguar la identificación de la tarjeta y del dispositivo que desea establecer como predeterminados, ejecutando aplay -l:\n\n```\n$ aplay -l\n```\n\n```\n**** List of PLAYBACK Hardware Devices ****\ncard 0: Intel [HDA Intel], device 0: CONEXANT Analog [CONEXANT Analog]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 0: Intel [HDA Intel], device 1: Conexant Digital [Conexant Digital]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 1: JamLab [JamLab], device 0: USB Audio [USB Audio]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 2: Audio [Altec Lansing XT1 - USB Audio], device 0: USB Audio [USB Audio]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\n```\n\nPor ejemplo, la última entrada de esta lista tiene el ID de la tarjeta 2 y el ID de dispositivo 0. Para establecer esta tarjeta como la predeterminada, puede utilizar el archivo que afecta a todo el sistema /etc/asound.conf o el archivo específico del usuario ~/.asoundrc. Puede que tenga que crear el archivo si no existe. A continuación, inserte las siguientes opciones con el id correspondiente del dispositivo y de la tarjeta.\n\n```\npcm.!default {\n\ttype hw\n\tcard 2\n}\n\nctl.!default {\n\ttype hw           \n\tcard 2\n}\n```\n\nLas opciones 'pcm' afectan a la tarjeta y al dispositivo que se pueden utilizar para la reproducción de audio, mientras que la opción 'ctl' afecta a la tarjeta que es utilizada por la utilidades de control como alsamixer.\n\nLos cambios entrarán en vigor tan pronto se (re)inicie una aplicación (mplayer, etc.). También puede probar con una orden como aplay:\n\n```\naplay -D default <your_favourite_sound.wav>\n```\n\nSi recibe un error acerca de la configuración de asound, compruebe upstream documentation para conocer posibles cambios en el formato del archivo de configuración.\n\n"
    },
    {
      "title": "Asegurarse de que los módulos de sonido se cargan",
      "level": 3,
      "content": "Es de suponer que udev detectará automáticamente el sonido correctamente. Puede verificar que esto ha ocurrido así con la orden siguiente:\n\n```\n$ lsmod | grep '^snd' | column -t\n```\n\n```\nsnd_hda_codec_hdmi     22378   4\nsnd_hda_codec_realtek  294191  1\nsnd_hda_intel          21738   1\nsnd_hda_codec          73739   3  snd_hda_codec_hdmi,snd_hda_codec_realtek,snd_hda_intel\nsnd_hwdep              6134    1  snd_hda_codec\nsnd_pcm                71032   3  snd_hda_codec_hdmi,snd_hda_intel,snd_hda_codec\nsnd_timer              18992   1  snd_pcm\nsnd                    55132   9  snd_hda_codec_hdmi,snd_hda_codec_realtek,snd_hda_intel,snd_hda_codec,snd_hwdep,snd_pcm,snd_timer\nsnd_page_alloc         7017    2  snd_hda_intel,snd_pcm\n```\n\nSi el resultado es similar, los controladores de sonido han sido reconocidos automáticamente con éxito.\n\nTambién puede ser que desee comprobar el directorio /dev/snd/ para verificar que los archivos de dispositivos son los correctos:\n\n```\n$ ls -l /dev/snd\n```\n\n```\ntotal 0\ncrw-rw----  1 root audio 116,  0 Apr  8 14:17 controlC0\ncrw-rw----  1 root audio 116, 32 Apr  8 14:17 controlC1\ncrw-rw----  1 root audio 116, 24 Apr  8 14:17 pcmC0D0c\ncrw-rw----  1 root audio 116, 16 Apr  8 14:17 pcmC0D0p\ncrw-rw----  1 root audio 116, 25 Apr  8 14:17 pcmC0D1c\ncrw-rw----  1 root audio 116, 56 Apr  8 14:17 pcmC1D0c\ncrw-rw----  1 root audio 116, 48 Apr  8 14:17 pcmC1D0p\ncrw-rw----  1 root audio 116,  1 Apr  8 14:17 seq\ncrw-rw----  1 root audio 116, 33 Apr  8 14:17 timer\n```\n\nSi tiene presente, por lo menos, los dispositivos controlC0 y pcmC0D0p o similares, entonces los módulos de sonido han sido detectados y cargados correctamente.\n\nSi este no es el caso, sus módulos de sonido no se han detectado correctamente. Para solucionar esto, pruebe intentando cargar los módulos manualmente:\n\n- Localice el módulo de la tarjeta de sonido: ALSA Soundcard Matrix. El módulo contendrá el prefijo 'snd-' (por ejemplo: snd-via82xx).\n- Cargue el módulo.\n- Verifique que los archivos del dispositivo en /dev/snd tienen una salida razonable (véase más arriba) y/o compruebelo con alsamixer o amixer.\n- Configure snd-NAME-OF-MODULE y snd-pcm-oss para cargar al arranque.\n\n"
    },
    {
      "title": "Conseguir salida SPDIF",
      "level": 3,
      "content": "(De los foros de Gentoo)\n\n- En el control del volumen de GNOME, en la pestaña Opciones, cambie IEC958 a PCM. Esta opción puede estar habilitada en las preferencias.\n- Si no tiene instalado el control del volumen de GNOME: Edite /var/lib/alsa/asound.state. En este archivo alsasound guarda la configuración de mixer. Encuentre una línea que dice: 'IEC958 Playback Switch'. Cerca de ella se encuentra una línea que dice value:false. Cambie el valor a value:true. Ahora busque esta línea: 'IEC958 Playback AC97-SPSA'. Cambie su valor a 0. Reinicie ALSA.\n\n- Edite /var/lib/alsa/asound.state. En este archivo alsasound guarda la configuración de mixer.\n- Encuentre una línea que dice: 'IEC958 Playback Switch'. Cerca de ella se encuentra una línea que dice value:false. Cambie el valor a value:true.\n- Ahora busque esta línea: 'IEC958 Playback AC97-SPSA'. Cambie su valor a 0.\n- Reinicie ALSA.\n\nOtra forma alternativa para activar la salida SPDIF automáticamente al iniciar sesión (probado en SoundBlaster Audigy):\n\n- Añada las siguientes líneas a /etc/rc.local:\n\n```\n# Use COAX-digital output\n amixer set 'IEC958 Optical' 100 unmute\n amixer set 'Audigy Analog/Digital Output Jack' on\n```\n\nSe puede ver el nombre de la salida digital de la tarjeta con:\n\n```\n$ amixer scontrols\n```\n\n"
    },
    {
      "title": "Usar AlsaEqual (proporciona la interfaz gráfica)",
      "level": 4,
      "content": "Instale alsaequalAUR desde AUR.\n\nDespués de instalar el paquete, introduzca lo siguiente en el archivo de configuración de ALSA (~/.asoundrc o /etc/asound.conf):\n\n```\nctl.equal {\n type equal;\n}\n\npcm.plugequal {\n  type equal;\n  # Modifique la línea de abajo si\n  # desea utilizar la tarjeta de sonido 0.\n  #slave.pcm \"plughw:0,0\";\n  #por defecto funcionará con más de una fuente simultáneamente:\n  slave.pcm \"plug:dmix\";\n}\n#pcm.equal {\n  # Si no desea que el ecualizador utilice la\n  # tarjeta de sonido predeterminada comente la siguiente\n  # línea y descomente la línea anterior. (Puede\n  # elegirlo como dispositivo de salida al usar\n  # otras aplicaciones específicas, por ejemplo, mpg123 -a equal 06.Back_In_Black.mp3)\npcm.!default {\n  type plug;\n  slave.pcm plugequal;\n}\n```\n\nY ya está listo para cambiar su ecualizador con la orden:\n\n```\n$ alsamixer -D equal\n```\n\nTenga en cuenta que el archivo de configuración es diferente para cada usuario (mientras no se especifique otra cosa) que se guarda en ~/.alsaequal.bin. Así que si desea utilizar AlsaEqual con mpd u otro software que se ejecute bajo un usuario diferente, se puede configurar mediante la orden:\n\n```\n# su mpd -c 'alsamixer -D equal'\n```\n\nO, por ejemplo, se puede hacer un enlace simbólico a .alsaequal.bin en el directorio home de aquel usuario.\n\nInstale alsaequal-mgr desde los repositorios de Xyne o desde alsaequal-mgrAUR.\n\nConfigure el ecualizador como de costumbre con:\n\n```\n$ alsamixer -D equal\n```\n\nCuando esté satisfecho con el estado, puede darle un nombre («foo» en este ejemplo) y guardarlo:\n\n```\n$ alsaequal-mgr save foo\n```\n\nEl estado «foo», entonces se puede restaurar en un momento posterior con:\n\n```\n$ alsaequal-mgr load foo\n```\n\nDe esta forma puede crear diferentes estados de ecualizador para juegos, películas, géneros musicales, aplicaciones de VoIP, etc. y volver a cargarlos cuando sea necesario.\n\nConsulte la página del proyecto y los consejos de ayuda para más opciones.\n\n"
    },
    {
      "title": "Usar mbeq",
      "level": 4,
      "content": "Instale los paquetes alsa-plugins, ladspa y swh-plugins si aún no los tiene.\n\n- Si no ha creado el archivo ~/.asoundrc o /etc/asound.conf, a continuación, cree cualquiera de ellos y añada lo siguiente:\n\n```\n/etc/asound.conf\n```\n\n```\npcm.eq {\n  type ladspa\n\n  # La salida del EQ puede ir directamente a un dispositivo de hardware\n  # (si usted tiene un mezclador de hardware, por ejemplo SBLive/Audigy) o puede ir\n  # para el mezclador de software que se muestra aquí.\n  #slave.pcm \"plughw:0,0\"\n  slave.pcm \"plug:dmix\"\n\n  # A veces es posible que necesite especificar la ruta de los plugins,\n  # especialmente si acaba de instalarlos. Una vez que haya iniciado sesión\n  # salir/reiniciar no debería ser necesario, pero sí, si se producen errores\n  # por no poder encontrar los plugins, intente eliminando el comentario de estos.\n  #path \"/usr/lib/ladspa\"\n\n  plugins [\n    {\n      label mbeq\n      id 1197\n      input {\n        #este ajuste se puede hacer aquí, por ejemplo; edite a su gusto\n        #bandas: 50Hz, 100Hz, 220Hz, 156hz, 311hz, 440hz, 622hz, 880hz, 1250hz, 1750Hz, 25000hz,\n        #50000hz, 10000Hz, 20000Hz\n        controls [ -5 -5 -5 -5 -5 -10 -20 -15 -10 -10 -10 -10 -10 -3 -2 ]\n      }\n    }\n  ]\n }\n\n # Redirigir el dispositivo predeterminado para pasar por el EQ - es posible que desee hacer esto.\n # haga esto último, una vez que esté seguro de que todo está funcionando. De lo contrario todos\n # sus programas de audio se romperán/bloquearán si algo ha ido mal.\n\n pcm.!default {\n  type plug\n  slave.pcm \"eq\"\n }\n\n # Redirigir la emulación OSS a través del EQ también (con programas que corren a través de \"AOSS\")\n\n pcm.dsp0 {\n  type plug\n  slave.pcm \"eq\"\n }\n```\n\n- Ahora todo debe ir bien (en su defecto, pregunte en el foro).\n\n"
    },
    {
      "title": "Remuestreo de alta calidad",
      "level": 2,
      "content": "Cuando el software de mezcla está habilitado, ALSA se ve obligado a volver a muestrear (remuestrear) todo en la misma frecuencia (48000 por defecto cuando se admite). Dmix utiliza un algoritmo de remuestreo pobre que produce una pérdida notable de la calidad de sonido.\n\nInstale alsa-plugins y libsamplerate.\n\nCambie el convertidor de frecuencia por defecto a libsamplerate:\n\n```\n/etc/asound.conf\n```\n\n```\ndefaults.pcm.rate_converter \"samplerate_best\"\n```\n\no\n\n```\n~/.asoundrc\n```\n\n```\ndefaults.pcm.rate_converter \"samplerate_best\"\n```\n\nsamplerate_best ofrece mejor calidad de sonido, pero se necesita una CPU decente para poder usarlo, ya que requiere una gran cantidad de ciclos de CPU en tiempo real para el remuestreo. Existen otros algoritmos disponibles (samplerate, etc.), pero no proporcionan una gran mejora respecto al remuestreador por defecto.\n\n"
    },
    {
      "title": "Upmixing",
      "level": 3,
      "content": "A fin de que una fuente de audio estéreo, como música, pueda ser capaz de ocupar todas las salidas de un sistema de sonido 5.1 o 7.1, es necesario utilizar upmixing. En el pasado este proceso resultaba difícil y propenso a errores, pero a día de hoy existen plugins que hacen fácil esta tarea. Por lo tanto, instale alsa-plugins.\n\nA continuación, añada lo siguiente al archivo de configuración de ALSA de su elección (ya sea /etc/asound.conf o ~/.asoundrc):\n\n```\npcm.upmix71 {\n    type upmix\n    slave.pcm \"surround71\"\n    delay 15\n    channels 8\n}\n```\n\nPuede cambiar fácilmente este ejemplo de upmixing 7.1 a 5.1 o 4.0.\n\nEsto agrega un nuevo pcm que se puede utilizar por upmixing. Si desea que todas las fuentes de audio pasen por este pcm, agréguelo como predeterminado debajo de la definición anterior, así:\n\n```\npcm.!default \"plug:upmix71\"\n```\n\nEl plugin permite automáticamente múltiples fuentes de sonido para trabajar a través de él sin problemas, de modo que este ajuste por defecto es, en realidad, una elección segura. Si esto no funciona, pruebe configurar su propio dmixer, para efectuar upmixing del canal PCM, así:\n\n```\npcm.dmix6 {\n    type asym\n    playback.pcm {\n        type dmix\n        ipc_key 567829\n        slave {\n            pcm \"hw:0,0\"\n            channels 6\n        }\n    }\n}\n```\n\ny usar «dmix6» en lugar de «surround71». Si experimenta problemas de sonido, como saltos o distorsiones, puede aumentar el buffer_size (a 32768, por ejemplo) o utilizar un remuestreador de alta calidad.\n\n"
    },
    {
      "title": "Downmixing",
      "level": 3,
      "content": "Si se quiere efectuar downmixing (pasar las fuentes de downmix a estéreo), por ejemplo, desea escuchar una película con sonido 5.1 en un equipo de música con salida estéreo, es necesario utilizar el plugin vdownmix, incluido en el paquete alsa-plugins.\n\nUna vez más, en el archivo de configuración, añada lo siguiente:\n\n```\npcm.!surround51 {\n    type vdownmix\n    slave.pcm \"default\"\n}\npcm.!surround40 {\n    type vdownmix\n    slave.pcm \"default\"\n}\n```\n\n"
    },
    {
      "title": "Mezclar con software (dmix)",
      "level": 3,
      "content": "Si eso no funciona automáticamente, sin embargo, es cuestión simplemente de crear un archivo .asoundrc (o modificar el existente) en el directorio personal, con el siguiente contenido:\n\n```\npcm.dsp {\n    type plug\n    slave.pcm \"dmix\"\n}\n```\n\nEsto debería habilitar dmix (software de mezcla) y permitir el acceso simultáneo de más de una aplicación para hacer uso de la tarjeta de sonido.\n\nPara una salida de sonido digital como S/PDIF, el paquete ALSA todavía no habilita dmix por defecto. Así, la configuración dmix anteriormente citada se puede usar para habilitar dmix para dispositivos con salida S/PDIF.\n\nConsulte el apartado sobre solución de problemas para los problemas más comunes y sus soluciones.\n\n"
    },
    {
      "title": "Soporte",
      "level": 4,
      "content": "Si tiene un chipset de audio que soporte mezclar con hardware, entonces no se requiere configuración. Casi todos los chipsets de sonido incorporados no son compatibles con el hardware de mezcla y requieren que la mezcla se haga con software (véase más arriba). Muchas tarjetas de sonido no tienen soporte para la mezcla con hardware y las que tienen mejor soporte en Linux son las siguientes:\n\n- Creative SoundBlaster Live! (modelo 5.1)\n- Creative SoundBlaster Audigy (algunos modelos)\n- Creative SoundBlaster Audidy 2 (modelos ZS)\n- Creative SoundBlaster Audigy 4 (modelos Pro)\n\nNote: **no** \n\n- Las variantes de la gama baja de las tarjetas anteriores (Audigy SE, Audigy 2 NX, SoundBlaster Live! de 24 bits y SoundBlaster Live! 7.1) no proporcionan soporte de hardware de mezcla, las cuales usan otros chips.\n- Una excepción es el chip integrado VIA8237 que soporta hardware de mezcla de 4-stream. Sin embargo, en algunas placas base solo 3 funcionan (el cuarto no produce ningún sonido), o se rompe recién se inicia. Incluso si funciona, la calidad no es buena en comparación con otras soluciones.\n\n"
    },
    {
      "title": "Arreglos",
      "level": 4,
      "content": "Si está usando Arch 64-bit y la tarjeta Intel Corporation 82801I (ICH9 Family) HD Audio Controller (rev 02), se puede obtener sonido para que funcione con «Enemy Territory» haciendo lo siguiente:\n\n```\necho \"et.x86 0 0 direct\" > /proc/asound/card0/pcm0p/oss\necho \"et.x86 0 0 disable\" > /proc/asound/card0/pcm0c/oss\n```\n\n"
    },
    {
      "title": "Sonido con saltos durante el uso de Dynamic Frequency Scaling",
      "level": 3,
      "content": "Algunas combinaciones de determinados drivers ALSA y chipsets pueden causar saltos en el audio de todas las fuentes cuando se utiliza en combinación con un regulador de frecuencia de la CPU de escalamiento dinámico como ondemand o conservative. En la actualidad, la solución es volver al gobernador performance.\n\nConsulte la CPU frequency scaling para obtener más información.\n\n"
    },
    {
      "title": "Problemas con la disponibilidad del software de mezcla por solo un usuario a la vez",
      "level": 3,
      "content": "Puede suceder que solo un usuario puede utilizar el dmixer a la vez. Esto probablemente pueda andar bien para la mayoría de los usuarios cuando solo ellos utilizan su máquina, pero para los que corren mpd en una máquina con usuarios distintos plantea un problema. Cuando mpd está corriendo, otro usuario normal no puede reproducir sonidos mediante dmixer. Aunque es posible solucionarlo corriendo mpd en la cuenta de inicio de sesión del usuario habilitado, otra solución es factible. Añada la línea ipc_key_add_uid 0 al bloque pcm.dmixer para desactivar esta limitación. El siguiente es un fragmento del código de asound.conf, el resto es lo mismo que el anterior.\n\n```\n...\npcm.dmixer {\n type dmix\n ipc_key 1024\n ipc_key_add_uid 0\n ipc_perm 0660\nslave {\n...\n```\n\n"
    },
    {
      "title": "Problemas de reproducción simultánea",
      "level": 3,
      "content": "Si está teniendo problemas de reproducción simultánea, y si PulseAudio se ha instalado (por ejemplo, utilizando GNOME), su configuración por defecto está ajustada para «secuestrar» a favor de pulseadio la tarjeta de sonido. Algunos usuarios de ALSA no desean utilizar PulseAudio y están bastante satisfechos con su actual configuración de ALSA. Una solución para resolver el problema es editar /etc/asound.conf y comentar las siguientes líneas:\n\n```\n# Use PulseAudio by default\n#pcm.!default {\n#  type pulse\n#  fallback \"sysdefault\"\n#  hint {\n#    show on\n#    description \"Default ALSA Output (currently PulseAudio Sound Server)\"\n#  }\n#}\n```\n\nComentando lo siguiente también puede resulta útil:\n\n```\n#ctl.!default {\n#  type pulse\n#  fallback \"sysdefault\"\n#}\n```\n\nEsta puede ser una solución mucho más simple que desinstalar por completo PulseAudio.\n\nEfectivamente, este es un ejemplo de un archivo /etc/asound.conf funcionando correctamente:\n\n```\npcm.dmixer {\n        type dmix\n        ipc_key 1024\n        ipc_key_add_uid 0\n        ipc_perm 0660\n}\npcm.dsp {\n        type plug\n        slave.pcm \"dmix\"\n}\n```\n\n"
    },
    {
      "title": "Ausencia de sonido al azar en el inicio",
      "level": 3,
      "content": "Se puede probar rápidamente el sonido mediante la ejecución de speaker-test. Si no hay sonido, el mensaje de error podría ser algo como:\n\n```\nALSA lib pcm_dmix.c:1022:(snd_pcm_dmix_open) unable to open slave\n Playback open error: -16\n Device or resource busy\n```\n\nSi no tiene sonido aleatoriamente en el arranque, puede deberse a que el sistema tiene varias tarjetas de sonido, y su orden puede, a veces, cambiar al inicio. Si este es el caso, trate de configurar la tarjeta de sonido predefinida\n\nSi utiliza mpd y los consejos de configuración anteriores no funcionan para usted, intente leyendo esto en su lugar.\n\n"
    },
    {
      "title": "Timidity",
      "level": 4,
      "content": "Timidity puede ser la causa de la falta de audio. Pruebe a ejecutar:\n\n```\n$ systemctl status timidity\n```\n\nSi esto falla, pruebe # killall -9 timidity. Si esto resuelve el problema, debe desactivar el demonio timidity para que no se inicie al arranque.\n\n"
    },
    {
      "title": "Problemas específicos de algunos programas",
      "level": 3,
      "content": "Algunos programas definen por sí su propia configuración de audio, por ejemplo, XMMS o Mplayer, con lo cual tendría que configurar sus opciones específicas.\n\nPara mplayer, abra ~/.mplayer/config (o /etc/mplayer/mplayer.conf para el ajuste global) y añada la siguiente línea:\n\n```\nao=alsa\n```\n\nPara XMMS/Beep Media Player, entre en sus opciones y asegúrese de que el controlador de sonido está ajustado a ALSA y no, a OSS.\n\nPara hacer esto en XMMS:\n\n- Abra XMMS Opciones → Preferencias. Elija el plugin de salida de Alsa.\n\n- Opciones → Preferencias.\n- Elija el plugin de salida de Alsa.\n\nPara las aplicaciones que no proporcionan compatibilidad con ALSA, puede usar AOSS desde el paquete alsa-oss. Para utilizar aoss, se ejecuta el programa, anteponiendo el prefijo aoss, por ejemplo:\n\n```\naoss realplay\n```\n\npcm.!default{ ... } parece que no funciona más, pruebe en su lugar:\n\n```\npcm.default pcm.dmixer\n```\n\n"
    },
    {
      "title": "Configurar los modelos",
      "level": 3,
      "content": "Aunque Alsa detecta la tarjeta de sonido a través de la BIOS, a veces puede no ser capaz de reconocer el tipo de modelo. El chip de la tarjeta de sonido puede ser encontrado en alsamixer (por ejemplo ALC662) y el modelo se puede ajustar en /etc/modprobe.d/modprobe.conf o /etc/modprobe .d/sound.conf. Por ejemplo:\n\n```\noptions snd-hda-intel model=MODEL\n```\n\nHay otras opciones, según el modelo. Para la mayoría de los casos, Alsa lo hará de manera automática, por defecto. Si desea ver más opciones de configuración específica para su tarjeta de sonido, eche un vistazo a la Lista de Tarjetas de sonido Alsa, localice su modelo, a continuación, pinche en Detalles, a continuación, busque la sección «Setting up modprobe ...». Introduzca esos valores en el archivo /etc/modprobe.d/modprobe.conf. Por ejemplo, para una tarjeta de audio Intel AC97:\n\n```\n# ALSA portion\nalias char-major-116 snd\nalias snd-card-0 snd-intel8x0\n# module options should go here\n\n# OSS/Free portion\nalias char-major-14 soundcore\nalias sound-slot-0 snd-card-0\n\n# card #1\nalias sound-service-0-0 snd-mixer-oss\nalias sound-service-0-1 snd-seq-oss\nalias sound-service-0-3 snd-pcm-oss\nalias sound-service-0-8 snd-seq-oss\nalias sound-service-0-12 snd-pcm-oss\n```\n\n"
    },
    {
      "title": "Audio en conflicto con altavoz interno del PC",
      "level": 3,
      "content": "Si está seguro de que nada está silenciado, que los controladores están instalados correctamente y que el volumen es el correcto, pero todavía no se oye nada, entonces trate de añadir la siguiente línea a /etc/modprobe.d/modprobe.conf:\n\n```\noptions snd-NAME-OF-MODULE ac97_quirk=0\n```\n\nLa solución anterior se ha observado que funciona con via82xx\n\n```\noptions snd-NAME-OF-MODULE ac97_quirk=1\n```\n\nLa solución anterior se ha informado que funciona con snd_intel8x0\n\n"
    },
    {
      "title": "Sin entrada en el micrófono",
      "level": 3,
      "content": "En alsamixer, asegúrese de que todos los niveles del volumen, en la sección grabación, están activados, y que la modalidad CAPTURE del micrófono está activa (por ejemplo, Mic, -micrófono interno-) y/o sobre capture (en alsamixer, seleccione estos elementos en el primer espacio). Pruebe poner Mic Boost en positivo y aumentar al máximo los niveles de Capture y Digital; esto no produce sonido o lo produce distorsionado, pero entonces podrá ajustar los niveles hacia abajo hasta oir algo cuando se graba.\n\nEn la medida que pulseaudio se muestra como «default» en alsamixer, puede ser necesario presionar F6 para seleccionar la propia tarjeta de sonido en primer lugar. También puede ser necesario activar y aumentar el volumen de Line-in (Línea de entrada) en la sección Playblack (reproducción).\n\nPara probar el micrófono, ejecute estas órdenes (consulte la página del manual de arecord para más información):\n\n```\narecord -d 5 test-mic.wav\n aplay test-mic.wav\n```\n\nSi todo falla, es posible que desee descartar un fallo de hardware, probando el micrófono con un dispositivo diferente.\n\nEn algunos ordenadores, silenciar un micrófono (MM) significa simplemente que su entrada no va de inmediato a los altavoces. Todavía recibe la entrada.\n\nMuchos portátiles Dell necesitan «-dmic», que se añade al nombre del modelo en /etc/modprobe.d/modprobe.conf:\n\n```\noptions snd-hda-intel model=dell-m6-dmic\n```\n\nAlgunos programas intenta utilizar OSS como software de entrada principal. Si tiene inicialmente activados los módulos del kernel snd_pcm_oss, snd_mixer_oss o snd_seq_oss (no se cargan de forma predeterminada), pruebe entonces evitar cargarlos.\n\nConsulte también:\n\n- https://www.alsa-project.org/main/index.php/SoundcardTesting\n- https://alsa.opensrc.org/Record_from_mic\n\n"
    },
    {
      "title": "Configuración predeterminada de Micrófono/Dispositivo de captura",
      "level": 3,
      "content": "Algunas aplicaciones (Pidgin, Adobe Flash) no ofrecen una opción para cambiar el dispositivo de captura. Se convierte en un problema si el micrófono está en un dispositivo separado (por ejemplo, webcam USB o micrófono) de la tarjeta de sonido interna. Para cambiar solo el dispositivo de captura predeterminado, dejando el dispositivo de reproducción predeterminado como está, puede editar el archivo ~/.asoundrc para incluir lo siguiente:\n\n```\npcm.usb\n{\n    type hw\n    card U0x46d0x81d\n}\n\npcm.!default\n{\n    type asym\n    playback.pcm\n    {\n        type plug\n        slave.pcm \"dmix\"\n    }\n    capture.pcm\n    {\n        type plug\n        slave.pcm \"usb\"\n    }\n}\n```\n\nReemplace «U0x46d0x81d» con el nombre de la tarjeta del dispositivo de captura en ALSA. Es posible utilizar la orden arecord -L para listar todos los dispositivos de captura detectados por ALSA.\n\n"
    },
    {
      "title": "El micrófono interno no funciona",
      "level": 3,
      "content": "En primer lugar, asegúrese en alsamixer, de que todos los niveles del volumen en la sección de grabación, están activados. Para obtener un nuevo ajuste del volumen llamado Capture que registre el micrófono interno, vuelva a añadir una nueva opción al archivo /etc/sound.conf y recargue el módulo snd-*. Por ejemplo, para snd-hda-intel, añada:\n\n```\noptions snd-hda-intel enable_msi=1\n```\n\nRecargando el módulo (como se indica abajo), activará el nuevo ajuste del volumen de grabación (Capture) y luego pruebe.\n\n```\n# rmmod snd-hda-intel && modprobe snd-hda-intel\n```\n\n"
    },
    {
      "title": "Sin sonido con tarjeta de sonido Intel integrada",
      "level": 3,
      "content": "Puede haber un problema con dos módulos cargados en conflicto, a saber snd_intel8x0 y snd_intel8x0m. En este caso, introduzca en blacklist snd_intel8x0m:\n\n```\n/etc/modprobe.d/modprobe.conf\n```\n\n```\nblacklist snd_intel8x0m\n```\n\nDeshabilitar el canal «External Amplifier» en alsamixer o amixer también puede ayudar. Consulte la wiki de ALSA.\n\nActivar el sonido en la configuración de «Mix» en el mezclador puede ayudar, también.\n\n"
    },
    {
      "title": "Sin sonido en auriculares con tarjeta de sonido Intel integrada",
      "level": 3,
      "content": "Si tiene un portatil con Intel Corporation 82801 I (ICH9 Family) HD Audio Controller, puede que tenga que añadir esta línea a modprobe o sound.conf:\n\n```\noptions snd-hda-intel model=$model\n```\n\nDonde $model es cualquiera de los siguientes modelos (por orden de posibilidad de funcionar, no por mérito):\n\n- dell-vostro\n- olpc-xo-1_5\n- laptop\n- dell-m6\n- laptop-hpsense\n\nPuede ver todos los modelos disponibles en la documentación del kernel. Por ejemplo aquí, pero compruebe que se trata de la versión correcta de ese documento para su versión del kernel.\n\nUna lista de modelos disponibles también está recogida aquí. Para conocer el nombre de su chip debe escribir la siguiente orden (con el asterisco * que permite adaptarse a las peculiaridades de sus archivos). Tenga en cuenta que algunos chips podrían haber cambiado de nombre y no corresponderse directamente a los que están disponibles en el archivo.\n\n```\ncat /proc/asound/card*/codec* | grep Codec\n```\n\nTenga en cuenta, por último, que hay una alta probabilidad de que ninguno de los dispositivos de entrada (todos los micrófonos internos y externos) funcionen si decide hacer esto, por lo que o funcionarán los auriculares o el micrófono. Por favor, informe a ALSA si se ve afectado por este error.\n\nPor otro lado, si tiene problemas con las señales acústicas (pcspkr):\n\n```\noptions snd-hda-intel model=$model enable=1 index=0\n```\n\n"
    },
    {
      "title": "Sin sonido cuando se instala la tarjeta de vídeo con S/PDIF",
      "level": 3,
      "content": "Localice los módulos disponibles y su orden:\n\n```\n$ cat /proc/asound/modules\n0 snd_hda_intel\n1 snd_ca0106\n```\n\nDesactive el códec de audio de la tarjeta de vídeo en /etc/modprobe.d/modprobe.conf:\n\n```\n# /etc/modprobe.d/modprobe.conf\n#\ninstall snd_hda_intel /bin/false\n```\n\nSi ambos dispositivos utilizan el mismo módulo, entonces podría utilizar el parámetro *enable* del módulo snd-hda-intel, el cual es una matriz booleana que permite activar/desactivar la tarjeta de sonido deseada.\n\nPor ejemplo:\n\n```\noptions snd-hda-intel enable=1,0\n```\n\nLo siguiente da la lista de las tarjetas:\n\n```\ncat /proc/asound/cards\n```\n\n"
    },
    {
      "title": "Calidad de audio deficiente",
      "level": 3,
      "content": "Si la calidad de sonido es pobre, intente ajustar el volumen de PCM (en alsamixer) a un nivel tal que gain sea 0.\n\nSi se ha cargado el controlador snd-usb-audio, puede intentar habilitar softvol en el archivo /etc/asound.conf. He aquí un ejemplo de configuración para el primer dispositivo de audio:\n\n```\npcm.!default {\n   type plug\n   slave.pcm \"softvol\"\n }\n pcm.dmixer {\n      type dmix\n      ipc_key 1024\n      slave {\n          pcm \"hw:0\"\n          period_time 0\n          period_size 4096\n          buffer_size 131072\n          rate 50000\n      }\n      bindings {\n          0 0\n          1 1\n      }\n }\n pcm.dsnooper {\n      type dsnoop\n      ipc_key 1024\n      slave {\n          pcm \"hw:0\"\n          channels 2\n          period_time 0\n          period_size 4096\n          buffer_size 131072\n          rate 50000\n      }\n      bindings {\n          0 0\n          1 1\n      }\n }\n pcm.softvol {\n      type softvol\n      slave { pcm \"dmixer\" }\n      control {\n          name \"Master\"\n          card 0\n      }\n }\n ctl.!default {\n   type hw\n   card 0\n }\n ctl.softvol {\n   type hw\n   card 0\n }\n ctl.dmixer {\n   type hw\n   card 0\n }\n```\n\n"
    },
    {
      "title": "Crepiteos al iniciar y detener la reproducción",
      "level": 3,
      "content": "Algunos módulos (como snd-ac97-codec y snd-hda-intel) pueden apagar la tarjeta de sonido cuando no está en uso. Esto puede provocar un ruido audible (como un crack/pop/crepiteos) al encender/apagar su tarjeta de sonido. A veces, puede ocurrir, incluso, cuando se mueve el control deslizante del volumen, o las ventanas se abren y cierran (KDE4). Si encuentra este sonido molesto, puede ejecutar modinfo snd-MY-MODULE, y buscar una opción que regule o desactive esta función.\n\nEjemplo: para desactivar el modo de ahorro de energía utilizando snd-hda-intel para evitar las distorsiones y resolver el problema de sonido de los altavoces, añada en /etc/modprobe.d/modprobe.conf\n\n```\n[options snd-hda-intel power_save=0]\n```\n\no\n\n```\n[options snd-hda-intel power_save=0 power_save_controller=N]\n```\n\nTambién puede probar con modprobe snd_hda_intel power_save=0 antes.\n\nPuede que sea necesario también activar el canal 'Line' de alsa para que esto funcione. Cualquier valor puede servir (que no sea '0' o algo muy alto).\n\nEjemplo: en una tarjeta integrada VIA VT1708S (utilizando el módulo snd-hda-intel) estas distorsiones seguían presentes a pesar de haber ajustado el parámetro 'power_save' a 0. Activando el canal 'Line' y estableciendo el valor '1' se resolvió el problema.\n\nFuente: https://docs.kernel.org/sound/designs/powersave.html\n\nSi utiliza un ordenador portátil, pm-utils cambiará power_save de nuevo a 1 cuando se utiliza la batería, incluso si se desactiva el ahorro de energía en /etc/modprobe.d. Para solucionar este problema, desactive esta opción para pm-utils mediante la desactivación del script que realiza el cambio:\n\n```\n# chmod -x /usr/lib/pm-utils/power.d/intel-audio-powersave\n```\n\n"
    },
    {
      "title": "La salida S/PDIF no funciona",
      "level": 3,
      "content": "Si la salida digital óptica/coaxial de la placa base/tarjeta de sonido no funciona o ha dejado de funcionar, y en alsamixer los correspondientes canales de sonido están activados, pruebe lo siguiente:\n\n```\n# iecset audio on\n```\n\nTambién puede poner esta orden en un servicio de systemd activado, ya que a veces puede dejar de funcionar después de un reinicio.\n\n"
    },
    {
      "title": "La salida HDMI no funciona",
      "level": 3,
      "content": "El procedimiento descrito a continuación se puede utilizar para una prueba de audio HDMI. Antes de continuar, asegúrese de que ha activado y quitado el silencio de la salida con alsamixer.\n\nConecte el PC a la pantalla mediante un cable HDMI y active la pantalla con una herramienta como xrandr o arandr. Por ejemplo:\n\n```\n$ xrandr # list outputs\n$ xrandr --output DVI-D_1 --mode 1024x768 --right-of PANEL # enable output\n```\n\nUtilice la orden aplay -l para descubrir el número de la tarjeta y del dispositivo. Por ejemplo:\n\n```\n$ aplay -l\n```\n\n```\n**** List of PLAYBACK Hardware Devices ****\n card 0: SB [HDA ATI SB], device 0: ALC892 Analog [ALC892 Analog]\n   Subdevices: 1/1\n   Subdevice #0: subdevice #0\n card 0: SB [HDA ATI SB], device 1: ALC892 Digital [ALC892 Digital]\n   Subdevices: 1/1\n   Subdevice #0: subdevice #0\n card 1: Generic [HD-Audio Generic], device 3: HDMI 0 [HDMI 0]\n   Subdevices: 1/1\n   Subdevice #0: subdevice #0\n```\n\nAhora que tenemos la información del dispositivo HDMI, haga una prueba. En el siguiente ejemplo, 1 es el número de tarjeta y 3 es el número de dispositivo.\n\n```\n$ aplay -D plughw:1,3 /usr/share/sounds/alsa/Front_Center.wav\n```\n\nSi «aplay» no emite ningún error, pero aún no hay ningún sonido, «reinicie» el receptor, monitor o televisor. Desde la interfaz HDMI revise rigurosamente la conexión, dado que podría haber informado anteriormente de que no había flujo de audio y haber deshabilitado así la decodificación de audio.En particular, si está usando un gestor de ventanas independiente (distinto al de Gnome o KDE), puede que tenga un poco de reproducción de sonido mientras enchufa el cable HDMI.\n\nSi la prueba tiene éxito, cree o modifique el archivo ~/.asoundrc para establecer HDMI como el dispositivo de audio predeterminado.\n\n```\n~/.asoundrc\n```\n\n```\npcm.!default {\n  type hw\n  card 1\n  device 3\n}\n```\n\nO si la configuración de arriba no funciona, pruebe esto:\n\n```\n~/.asoundrc\n```\n\n```\ndefaults.pcm.card 1\ndefaults.pcm.device 3\ndefaults.ctl.card 1\n```\n\n"
    },
    {
      "title": "La salida multicanal PCM de HDMI no funciona (Intel)",
      "level": 3,
      "content": "En Linux 3.1 la salida multicanal PCM a través de HDMI con una tarjeta Intel (Intel Eaglelake, IbexPeak/Ironlake,SandyBridge/CougarPoint y IvyBridge/PantherPoint) aún no está soportada. El apoyo está siendo desarrollado actualmente y se espera que esté disponible para Linux 3.2. Para hacer que funcione en Linux 3.1 es necesario aplicar los siguientes parches:\n\n- drm: support routines for HDMI/DP ELD\n- drm/i915: pass ELD to HDMI/DP audio driver\n\n"
    },
    {
      "title": "HP TX2500",
      "level": 3,
      "content": "Agregue estas dos líneas en /etc/modprobe.d/modprobe.conf:\n\n```\noptions snd-cmipci mpu_port=0x330 fm_port=0x388\noptions snd-hda-intel index=0 model=toshiba position_fix=1\n```\n\n```\noptions snd-hda-intel model=hp (funciona para tx2000cto)\n```\n\n"
    },
    {
      "title": "Salto de sonido durante la reproducción MP3",
      "level": 3,
      "content": "Si tiene saltos de sonido al reproducir archivos MP3 y tiene más de dos altavoces conectados al ordenador (es decir, dos o más sistema de altavoces), ejecute alsamixer y desactive los canales para los altavoces que NO tiene (es decir, deshabilite, por ejemplo, el canal del altavoz central si no se dispone de un altavoz central).\n\n"
    },
    {
      "title": "Auriculares USB y tarjetas de sonido externas USB",
      "level": 3,
      "content": "Si está usando un auricular USB con ALSA puede probar a usar asoundconfAUR (actualmente solo disponible en AUR) para ajustar el auricular como salida de sonido principal. Antes de proseguir, asegúrese de tener el módulo usb audio habilitado (modprobe snd-usb-audio).\n\n```\n# asoundconf is-active\n# asoundconf list\n# asoundconf set-default-card <tarjeta-de-sonido elegida>\n```\n\n"
    },
    {
      "title": "Sonido crepitante con dispositivos USB",
      "level": 4,
      "content": "Si usted experimenta crepiteos o crujidos en dispositivos USB, puede intentar ajustar el snd-usb-audio para una latencia mínima.\n\nAgregue lo siguiente a su /etc/modprobe.d/modprobe.conf:\n\n```\noptions snd-usb-audio nrpacks=1\n```\n\nFuente: https://alsa.opensrc.org/Usb-audio#Tuning_USB_devices_for_minimal_latencies\n\n"
    },
    {
      "title": "Conexión hot-plugging de una tarjeta de sonido USB",
      "level": 4,
      "content": "Con el fin de configurar automáticamente una tarjeta de sonido USB como dispositivo de salida principal, cuando la tarjeta está conectada, puede utilizar las siguientes reglas udev (por ejemplo, añadir las dos líneas siguientes a /etc/udev/rules.d/00-local.rules y reiniciar).\n\n```\nKERNEL==\"pcmC[D0-9cp]*\", ACTION==\"add\", PROGRAM=\"/bin/sh -c 'K=%k; K=$${K#pcmC}; K=$${K%%D*}; echo defaults.ctl.card $$K > /etc/asound.conf; echo defaults.pcm.card $$K >>/etc/asound.conf'\"\nKERNEL==\"pcmC[D0-9cp]*\", ACTION==\"remove\", PROGRAM=\"/bin/sh -c 'echo defaults.ctl.card 0 > /etc/asound.conf; echo defaults.pcm.card 0 >>/etc/asound.conf'\"\n```\n\n"
    },
    {
      "title": "Error 'Unkown hardware' después de una actualización del Kernel",
      "level": 3,
      "content": "Los siguientes mensajes pueden aparecer durante la puesta en marcha de ALSA después de la actualización del kernel:\n\n```\nUnknown hardware \"foo\" \"bar\" ...\nHardware is initialized using a guess method\n/usr/sbin/alsactl: set_control:nnnn:failed to obtain info for control #mm (No such file or directory)\n```\n\no\n\n```\nFound hardware: \"HDA-Intel\" \"VIA VT1705\" \"HDA:11064397,18490397,00100000\" \"0x1849\" \"0x0397\"\nHardware is initialized using a generic method\n/usr/sbin/alsactl: set_control:1328: failed to obtain info for control #1 (No such file or directory)\n/usr/sbin/alsactl: set_control:1328: failed to obtain info for control #2 (No such file or directory)\n/usr/sbin/alsactl: set_control:1328: failed to obtain info for control #25 (No such file or directory)\n/usr/sbin/alsactl: set_control:1328: failed to obtain info for control #26 (No such file or directory)\n```\n\nSimplemente guarde las configuraciones del mixer de ALSA otra vez (como root):\n\n```\n# alsactl -f /var/lib/alsa/asound.state store\n```\n\nPuede ser necesario configurar de nuevo ALSA con alsamixer.\n\n"
    },
    {
      "title": "HDA Analyzer",
      "level": 3,
      "content": "Si las asignaciones de los pin (conectores) de audio no se corresponden con ALSA, pero este funciona bien, puede probar con HDA Analyzer -una interfaz gráfica de usuario pyGTK2 para el control de audio HD, que se puede encontrar en la wiki de ALSA-. Trate de configurar la sección de Control Widget para gestionar los PIN, ajustando IN para micrófonos y AUT para auriculares. Puede ser buena idea hacer referencia a los valores por defecto (Config Defaults).\n\n- El script se ejecuta de tal manera que es incompatible con python3 (que es el actualmente proporcionado por Arch Linux) pero, no obstante, trate de usarlo.Para solucionar este problema, abra «run.py», encuentre todas las entradas de «python» (2 entradas - una en la primera línea, y la segunda en la última línea) y reemplácelas todas por «python2».\n- El script requiere acceso de root, pero no funciona a través de su/sudo. Ejecútelo mediante kdesu o gksu.\n\n"
    },
    {
      "title": "ALSA con SDL",
      "level": 3,
      "content": "Si no se obtiene ningún sonido a través de SDL, y ALSA no puede ser seleccionado desde la configuración de la aplicación, pruebe a establecer la variable de entorno SDL_AUDIODRIVER a «alsa».\n\n```\n# export SDL_AUDIODRIVER=alsa\n```\n\n"
    },
    {
      "title": "Alternativa al sonido bajo",
      "level": 3,
      "content": "Si se obtiene un sonido bajo, incluso después usar al máximo sus altavoces/auriculares, puede intentar solucionar el problema probando el plugin softvol. Agregue lo siguiente a /etc/asound.conf.\n\n```\npcm.!default {\n      type plug\n      slave.pcm \"softvol\"\n  }\n\npcm.softvol {\n    type softvol\n    slave {\n        pcm \"dmix\"\n    }\n    control {\n        name \"Pre-Amp\"\n        card 0\n    }\n    min_dB -5.0\n    max_dB 20.0\n    resolution 6\n}\n```\n\nDespués que los cambios se carguen correctamente, aparecerá una nueva sección Pre-Amp en alsamixer. Puede ajustar los niveles desde allí.\n\n- Establecer un valor alto para Pre-Amp puede causar distorsión del sonido, por lo que ajustelo de acuerdo al nivel más adecuado.\n- Algunos códecs de audio pueden necesitar ajustes en el HDA Analyzer (véase arriba) a fin de lograr un volumen adecuado y sin distorsión. Comprobar la opción HP con el control del widget en el interruptor del Playback (Node[0x14] PIN en el códec ALC892, por ejemplo) puede, a veces, mejorar la calidad del audio y del volumen significativamente.\n\n"
    },
    {
      "title": "Sonido abrupto después de reanudar la suspensión",
      "level": 3,
      "content": "Se puede escuchar un sonido a modo de estallido después de reanudar el equipo desde la suspensión. Esto se puede solucionar editando /etc/pm/sleep.d/90alsa y eliminado la línea que dice aplay -d 1 /dev/zero\n\n"
    },
    {
      "title": "Silencio después de reiniciar",
      "level": 3,
      "content": "Tras el arranque, el ajuste de sonido establecido con alsamixer no permanece. Talvez se pueda restablecerlo con la orden sudo alsactl restore. Compruebe el estado del indicador Auto-Mute en alsamixer: ajuste Enabled a Disabled.\n\n"
    },
    {
      "title": "Configuraciones de ejemplo",
      "level": 2,
      "content": "Consulte Advanced Linux Sound Architecture/Example Configurations.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Advanced ALSA module configuration\n- Unofficial ALSA Wiki\n- HOWTO: Compile driver from svn\n\n"
    }
  ]
}