{
  "title": "Advanced Linux Sound Architecture (Français)",
  "url": "https://wiki.archlinux.org/title/Advanced_Linux_Sound_Architecture_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ALSA configuration examples\n- ALSA troubleshooting\n- Sound system\n- PC speaker\n- PulseAudio (Français)\n- Open Sound System\n- List of applications/Multimedia#Volume control\n\nAdvanced Linux Sound Architecture (ALSA) fournit des pilotes de cartes son pilotés par le noyau. Il remplace le système original Open Sound System (OSS).\n\nOutre les pilotes de périphériques sonores, ALSA fournit également une bibliothèque pilotée par l'espace utilisateur pour les développeurs d'applications. Ceux-ci peuvent alors utiliser ces pilotes ALSA pour le développement d'API de haut niveau. Cela permet une interaction directe (noyau) avec les périphériques sonores par le biais des bibliothèques ALSA.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "ALSA est un ensemble de modules intégrés au noyau Linux. Par conséquent, une installation manuelle n'est pas nécessaire.\n\nudev détectera automatiquement votre matériel et sélectionnera les pilotes nécessaires au démarrage, par conséquent, votre son devrait déjà fonctionner. Cependant, il se peut que votre son soit initialement coupé. Si c'est le cas, consultez #Réactiver les canaux.\n\n"
    },
    {
      "title": "Privilèges de l'utilisateur",
      "level": 3,
      "content": "Habituellement, les utilisateurs locaux ont la permission de lire le son et de modifier les niveaux du mixeur.\n\nPour permettre aux utilisateurs distants d'utiliser ALSA, vous devez ajouter ces utilisateurs au groupe audio, mais cela n'est pas recommandé par défaut (consultez la note ci-dessous).\n\nNote: **pas** \n\n"
    },
    {
      "title": "Utilitaires ALSA",
      "level": 3,
      "content": "Installez le paquet alsa-utils. Il contient (entre autre) les utilitaires alsamixer(1) et amixer(1). amixer est une commande shell permettant de modifier les paramètres audio, tandis que alsamixer fournit une interface plus intuitive basée sur ncurses pour la configuration des périphériques audio.\n\nSi vous avez besoin du rééchantillonnage de haute qualité, installez le paquet alsa-plugins pour activer upmixing/downmixing et d'autres fonctionnalités avancées.\n\n"
    },
    {
      "title": "Compatibilité OSS",
      "level": 3,
      "content": "ALSA a la capacité d'intercepter les appels OSS et de les réacheminer à travers ALSA. Cette couche d'émulation est utile, par exemple, pour les anciennes applications qui essaient d'ouvrir /dev/dsp et d'y écrire directement des données sonores. Sans OSS ou la bibliothèque d'émulation, /dev/dsp sera absent, et l'application ne produira aucun son.\n\nSi vous voulez que les applications OSS fonctionnent avec dmix, installez également le paquet alsa-oss. Chargez ensuite les modules du noyau snd-seq-oss, snd-pcm-oss et snd-mixer-oss pour activer l'émulation OSS.\n\n"
    },
    {
      "title": "Compatibilité avec PulseAudio",
      "level": 3,
      "content": "apulseAUR vous permet d'utiliser ALSA pour les applications qui ne prennent en charge que PulseAudio pour le son. L'utilisation est simple :\n\n```\n$ apulse yourapplication\n```\n\n"
    },
    {
      "title": "ALSA et systemd",
      "level": 3,
      "content": "Le paquet alsa-utils est livré avec les fichiers de configuration de l'unité systemd alsa-restore.service et alsa-state.service par défaut.\n\nIls sont automatiquement installés et activés lors de l'installation (via le lien symbolique fourni par le paquet vers sound.target). Les options sont les suivantes :\n\n- alsa-restore.service Lit /var/lib/alsa/asound.state au démarrage et écrit les valeurs mises à jour à l'arrêt, à condition que /etc/alsa/state-daemon.conf n'existe pas. Comme /etc/alsa/state-daemon.conf n'est pas créé sans une action consciente de l'utilisateur, c'est la méthode par défaut.\n- alsa-state.service (Re-)Démarre alsactl en mode daemon pour suivre en permanence, et faire persister, les changements de volume, à condition que l'utilisateur ait consciemment créé /etc/alsa/state-daemon.conf.\n\nÉvidemment, les deux méthodes s'excluent mutuellement. Vous pouvez opter pour l'une des deux approches en fonction de vos besoins. Pour modifier ces unités, consultez Systemd (Français)#Modifier les unités fournies. Vous pouvez vérifier leur état en utilisant systemctl.\n\nPour plus d'informations, consultez alsactl(1).\n\n"
    },
    {
      "title": "Microprogramme ALSA",
      "level": 3,
      "content": "Le paquet alsa-firmware contient le microprogramme qui peut être requis pour certaines cartes son (par exemple, une Creative SB0400 Audigy2).\n\nsof-firmware et alsa-ucm-conf sont nécessaires pour quelques modèles d'ordinateurs portables plus récents (fin 2019/2020) qui implémentent leurs pilotes avec un microprogramme fourni par le projet Sound Open Firmware.\n\n"
    },
    {
      "title": "Réactiver les canaux",
      "level": 2,
      "content": "Par défaut, ALSA a mis tous les canaux en sourdine. Ceux-ci doivent être réactivés manuellement.\n\n"
    },
    {
      "title": "Réactiver le son avec amixer",
      "level": 3,
      "content": "Réactiver le volume principal de la carte son peut être fait en utilisant amixer :\n\n```\n$ amixer sset Master unmute\n$ amixer sset Speaker unmute (haut-parleur désactivé)\n$ amixer sset Headphone unmute (désactivation du casque)\n```\n\n"
    },
    {
      "title": "Réactiver le son avec alsamixer",
      "level": 3,
      "content": "Réactiver la carte son peut être fait en utilisant alsamixer :\n\n```\n$ alsamixer\n```\n\nL'étiquette MM sous un canal indique que le canal est coupé, et OO indique qu'il est ouvert.\n\nFaites défiler les canaux Master et PCM avec les touches ← et → et réactivez-les en appuyant sur la touche m.\n\nUtilisez la touche ↑ pour augmenter le volume et obtenir une valeur de 0 dB de gain. Le gain se trouve en haut à gauche à côté du champ Item:.\n\n"
    },
    {
      "title": "Réactiver le son 5.1/7.1",
      "level": 3,
      "content": "Pour obtenir un son 5.1 ou 7.1 surround complet, vous devrez probablement réactiver d'autres canaux tels que Front, Surround, Center, LFE, LFE (subwoofer) et LFE. (Il s'agit de noms de canaux avec Intel HD Audio, ils peuvent varier selon le matériel utilisé).\n\n"
    },
    {
      "title": "Activer le microphone",
      "level": 3,
      "content": "Pour activer votre microphone, passez à l'onglet Capture avec F4 et activez un canal avec Space. Consultez Advanced Linux Sound Architecture/Troubleshooting#Microphone si le microphone ne fonctionne pas.\n\n"
    },
    {
      "title": "Testez vos modifications",
      "level": 3,
      "content": "Ensuite, testez pour consulter si le son fonctionne :\n\n```\n$ speaker-test -c 2\n```\n\nChangez -c pour l'adapter à votre configuration de haut-parleurs. Utilisez -c 8 pour 7.1, par exemple :\n\n```\n$ speaker-test -c 8\n```\n\nSi l'audio est envoyé vers le mauvais périphérique, essayez de le spécifier manuellement avec l'argument -D.\n\n```\n$ speaker-test -D default:PCH -c 8\n```\n\n-D accepte les noms de canaux PCM comme valeurs, qui peuvent être récupérés en exécutant la commande suivante :\n\n```\n$ aplay -L | grep :CARD\n```\n\n```\ndefault:CARD=PCH # 'default:PCH' est le nom du canal PCM pour -D\nsysdefault:CARD=PCH\nfront:CARD=PCH,DEV=0\nsurround21:CARD=PCH,DEV=0\nsurround40:CARD=PCH,DEV=0\nsurround41:CARD=PCH,DEV=0\nsurround50:CARD=PCH,DEV=0\nsurround51:CARD=PCH,DEV=0\nsurround71:CARD=PCH,DEV=0\n```\n\nSi cela ne fonctionne pas, consultez la section #Configuration ou la page Advanced Linux Sound Architecture/Troubleshooting.\n\n"
    },
    {
      "title": "Notes supplémentaires",
      "level": 3,
      "content": "- Si votre système possède plus d'une carte son, vous pouvez passer de l'une à l'autre en appuyant sur F6.\n\n- Pour certaines cartes, la sortie numérique doit être coupée ou désactivée afin d'entendre le son analogique. Pour la Soundblaster Audigy LS, mettez en sourdine le canal marqué IEC958.\n\n- Certaines machines (comme le Thinkpad T61) possèdent un canal Speaker qui doit également être réactivé et réglé.\n\n- Certaines machines (comme un Dell E6400) peuvent également nécessiter que les canaux Front et Headphone soient réactivés et réglés.\n\n- Si vos réglages de volume semblent perdus après un redémarrage, essayez d'exécuter alsamixer en tant que root.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Le fichier de configuration système est /etc/asound.conf, et le fichier de configuration par utilisateur est ~/.asoundrc.\n\n"
    },
    {
      "title": "Syntaxe de base",
      "level": 3,
      "content": "Les fichiers de configuration ALSA suivent une syntaxe simple consistant en des affectations hiérarchiques de valeurs aux paramètres (clés). La syntaxe est également présentée dans [2].\n\n"
    },
    {
      "title": "Assignations et séparateurs",
      "level": 4,
      "content": "Les affectations définissent la valeur d'une clé donnée. Il existe différents types et styles d'affectation.\n\n```\nSimple assignment\n```\n\n```\n# This is a comment. Everything after the '#' symbol to the end of the line will be ignored by ALSA.\nkey = value # Equal signs are usually left out, since space can also be used as a separator.\n\nkey value # Equivalent to the example above.\n```\n\nLes séparateurs sont utilisés pour indiquer le début et la fin d'une affectation, mais l'utilisation de virgules ou d'espaces est également possible.\n\n```\nSeparators\n```\n\n```\n# The following three assignments are equivalent.\nkey value0; key valueN;\nkey value0, key valueN,\nkey value0 key valueN\n\nkey\nvalue0\n\tkey\nvalueN\n```\n\nLes affectations composées utilisent des accolades comme séparateurs.\n\n```\nCompound assignment\n```\n\n```\nkey {\tsubkey0 value0;\n\tsubkeyN valueN;\t}\n\nkey.subkey0 value0; # Equivalent to the example above.\nkey.subkeyN valueN;\n```\n\nPour faciliter la lecture, il est recommandé d'utiliser le premier style pour les définitions comprenant plus de trois clés.\n\nLes définitions de tableaux utilisent des parenthèses comme séparateurs.\n\n```\nSingle array\n```\n\n```\nkey [\t\"value0\";\n\t\"valueN\";\t]\n\nkey.0 \"value0\"; # Equivalent to the example above\nkey.N \"valueN\";\n```\n\nTout dépend des préférences de l'utilisateur en ce qui concerne les différents styles de configuration, mais il faut éviter de mélanger différents styles. Vous trouverez de plus amples informations sur la configuration de base dans [3].\n\n"
    },
    {
      "title": "Types de données",
      "level": 4,
      "content": "ALSA utilise différents types de données pour les valeurs des paramètres, qui doivent être définis dans le fichier de configuration de l'utilisateur. Certaines clés acceptent plusieurs types de données, alors que la plupart ne le font pas. Une liste des options de configuration et de leurs exigences respectives en matière de types de données pour les plugins PCM se trouve dans [4].\n\n"
    },
    {
      "title": "Modes d'opération",
      "level": 4,
      "content": "Il existe différents modes d'opération pour l'analyse des nœuds, le mode par défaut étant la fusion et la création. Si le mode d'opération est soit merge/create soit merge, la vérification du type est effectuée. Seules les affectations de même type peuvent être fusionnées, les chaînes de caractères ne peuvent donc pas être fusionnées avec des entiers. Essayer de définir une affectation simple dans le mode d'opération par défaut à un composé (et vice versa) ne fonctionnera pas non plus.\n\nPréfixes des modes d'opération :\n\n- \"+\" -- fusionner et créer\n- \"-\" -- fusionner\n- \"?\" -- ne pas remplacer\n- \"!\" -- remplacer\n\n```\nOperation modes\n```\n\n```\n# Merge/create - If a node does not exist, it is created. If it does exist and types match,\n# subkeyN is merged into key.\nkey.subkeyN valueN;\n\n# Merge/create - Equivalent to above\nkey.+subkeyN valueN;\n\n# Merge - Node key.subkeyN must already exist and must have same data type\nkey.-subkeyN valueN;\n\n# No override - Ignore new assignment if key.subkeyN node already exists\nkey.?subkeyN valueN;\n\n# Override - Removes subkeyN and all keys below it, then creates node key.subkeyN\nkey.!subkeyN valueN;\n```\n\nUtiliser le mode d'opération override, quand c'est fait correctement, est généralement sûr, cependant il faut garder à l'esprit qu'il peut y avoir d'autres clés nécessaires dans un noeud pour un bon fonctionnement.\n\nNote: **n'utilisez pas !pcm.key** \n\nEn supposant que le noeud \"defaults\" est défini dans /usr/share/alsa/alsa.conf, où \"defaults.pcm.card\" et sa contrepartie \"ctl\" ont pour valeur \"0\" (type integer), l'utilisateur veut définir le périphérique pcm et de contrôle par défaut sur la (troisième) carte son \"2\" ou \"SB\" pour une carte son Azalia.\n\n```\nDefaults node\n```\n\n```\ndefaults.ctl.card 2; # Sets default device and control to third card (counting begins with 0).\ndefaults.pcm.card 2; # This does not change the data type.\n\ndefaults.ctl.+card 2; # Equivalent to above.\ndefaults.pcm.+card 2;\n\ndefaults.ctl.-card 2; # Same effect on a default setup, however if defaults node was removed or\ndefaults.pcm.-card 2; # type has been changed merge operation mode will result in no changes.\n\ndefaults.pcm.?card 2; # This does nothing, since this assignment already exists.\ndefaults.ctl.?card 2;\n\ndefaults.pcm.!card \"SB\"; # The override operation mode is necessary here, because of\ndefaults.ctl.!card \"SB\"; # different value types.\n```\n\nL'utilisation des guillemets doubles ici définit automatiquement le type de données des valeurs comme étant une chaîne de caractères, donc dans l'exemple ci-dessus, la définition de defaults.pcm.!card \"2\" aurait pour résultat de conserver le dernier périphérique par défaut, dans ce cas la carte 0. L'utilisation des guillemets doubles pour les chaînes de caractères n'est pas obligatoire tant qu'aucun caractère spécial n'est utilisé, ce qui idéalement ne devrait jamais être le cas. Cela peut ne pas être pertinent dans d'autres affectations.\n\n"
    },
    {
      "title": "Emboîtement",
      "level": 4,
      "content": "Parfois, il peut être utile et même plus facile de lire en utilisant l'imbrication dans la configuration.\n\n```\nNesting PCM plugins\n```\n\n```\npcm.azalia {\ttype hw; card 0\t}\npcm.!default {\ttype plug; slave.pcm \"azalia\"\t}\n\n# is equivalent to\n\npcm.!default {\ttype plug; slave.pcm {\ttype hw; card 0;\t}\t}\n\n# which is also equivalent to\n\npcm.!default.type plug;\npcm.default.slave.pcm.type hw;\npcm.default.slave.pcm.card 0;\n```\n\n"
    },
    {
      "title": "Inclure les fichiers de configuration",
      "level": 4,
      "content": "```\nInclude other configuration files\n```\n\n```\n</path/to/configuration-file> # Include a configuration file\n<confdir:/path/to/configuration-file> # Reference to a global configuration directory\n```\n\n"
    },
    {
      "title": "Réglage de la carte son par défaut via le nœud defaults",
      "level": 4,
      "content": "Pour mettre en pratique le exemple précédent concernant defaults.pcm.card et defaults.pcm. device en pratique, en supposant que nous avons 2 cartes avec les indices 0 et 1 respectivement et que nous souhaitons simplement changer la carte par défaut pour l'indice 1, conduirait à la configuration suivante dans /etc/asound.conf ou dans ~/.asoundrc spécifique à l'utilisateur pour changer à la fois la carte de lecture et la carte de contrôle du mixeur.\n\n```\ndefaults.pcm.card 1\ndefaults.ctl.card 1\n```\n\n"
    },
    {
      "title": "Configuration de l'ordre des index via les options du module du noyau",
      "level": 4,
      "content": "Si l'ordre de vos cartes son change au démarrage, vous pouvez spécifier leur ordre dans tout fichier se terminant par .conf dans /etc/modprobe.d (/etc/modprobe.d/alsa-base.conf est suggéré). Par exemple, si vous voulez que votre carte son mia soit #0 :\n\n```\n/etc/modprobe.d/alsa-base.conf\n```\n\n```\noptions snd_mia index=0\noptions snd_hda_intel index=1\n```\n\nUtilisez $ cat /proc/asound/modules pour obtenir les modules sonores chargés et leur ordre. Cette liste est généralement tout ce qui est nécessaire pour l'ordre de chargement. Utilisez $ lsmod | grep snd pour obtenir une liste des périphériques et modules. Cette configuration suppose que vous avez une carte son mia utilisant snd_mia et une carte (par exemple embarquée) utilisant snd_hda_intel.\n\nVous pouvez également fournir un index de -2 pour demander à ALSA de ne jamais utiliser une carte comme carte principale. Les distributions telles que Linux Mint et Ubuntu utilisent les paramètres suivants pour éviter que les pilotes USB et autres pilotes \"anormaux\" obtiennent l'index 0 :\n\n```\n/etc/modprobe.d/alsa-base.conf\n```\n\n```\noptions bt87x index=-2\noptions cx88_alsa index=-2\noptions saa7134-alsa index=-2\noptions snd-atiixp-modem index=-2\noptions snd-intel8x0m index=-2\noptions snd-via82xx-modem index=-2\noptions snd-usb-caiaq index=-2\noptions snd-usb-ua101 index=-2\noptions snd-usb-us122l index=-2\noptions snd-usb-usx2y index=-2\noptions snd-pcsp index=-2\noptions snd-usb-audio index=-2\n```\n\nCes modifications nécessitent un redémarrage du système.\n\nConsultez également [5].\n\n"
    },
    {
      "title": "Sélectionner le PCM par défaut via la variable d'environnement",
      "level": 4,
      "content": "Il est probablement suffisant de définir ALSA_CARD comme le nom du périphérique. D'abord, obtenez les noms avec aplay -l, puis définissez ALSA_CARD sur le nom qui vient après les deux points et avant la parenthèse ; par exemple, si vous avez\n\n```\ncard 1 : HDMI [HDA ATI HDMI], device 3 : HDMI 0 [HDMI 0]\n```\n\nalors définissez ALSA_CARD=HDMI.\n\nD'autres variables sont également vérifiées dans la configuration globale par défaut /usr/share/alsa/alsa.conf. En y recherchant les constructions de la forme vars [ ... ], on obtient le tableau suivant :\n\nTable content:\n | Nom de la variable | Utilisé par\n1 | ALSA_CARD | pcm.default , pcm.hw , pcm.plughw , ctl.sysdefault , ctl.hw , rawmidi.default , rawmidi.hw , hwdep.hw\n2 | ALSA_CTL_CARD | ctl.sysdefault , ctl.hw\n3 | ALSA_HWDEP_CARD | hwdep.default , hwdep.hw\n4 | ALSA_HWDEP_DEVICE | hwdep.default , hwdep.hw\n5 | ALSA_PCM_CARD | pcm.default , pcm.hw , pcm.plughw\n6 | ALSA_PCM_DEVICE | pcm.hw , pcm.plughw\n7 | ALSA_RAWMIDI_CARD | rawmidi.default , rawmidi.hw\n8 | ALSA_RAWMIDI_DEVICE | rawmidi.default , rawmidi.hw\n\nVous pouvez également modifier ce comportement dans votre propre fichier de configuration, de préférence le fichier global (/etc/asound.conf). Ajoutez :\n\n```\npcm.!default {\n   type plug\n   esclave.pcm {\n       @func getenv\n       vars [ ALSAPCM ]\n       default \"hw:Audigy2\"\n   }\n}\n```\n\nDans ce cas également, remplacez Audigy2 par le nom de votre appareil. Vous pouvez obtenir les noms avec aplay -l ou vous pouvez également utiliser des PCM comme surround51. Mais si vous avez besoin d'utiliser le microphone, c'est une bonne idée de sélectionner le PCM full-duplex par défaut.\n\nMaintenant vous pouvez sélectionner la carte son au démarrage des programmes en changeant simplement la variable d'environnement ALSAPCM. Cela fonctionne bien pour tous les programmes qui ne permettent pas de sélectionner la carte, pour les autres assurez-vous de garder la carte par défaut. Par exemple, si vous avez écrit un downmix PCM appelé mix51to20, vous pouvez l'utiliser avec mplayer en utilisant la ligne de commande ALSAPCM=mix51to20 mplayer exemple_6_canal.wav.\n\n"
    },
    {
      "title": "Méthode alternative",
      "level": 4,
      "content": "Tout d'abord, vous devez trouver la carte et l'identifiant du périphérique que vous souhaitez définir comme valeur par défaut :\n\n```\n$ aplay -l\n```\n\n```\n**** List of PLAYBACK Hardware Devices ****\ncard 0: Intel [HDA Intel], device 0: CONEXANT Analog [CONEXANT Analog]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 0: Intel [HDA Intel], device 1: Conexant Digital [Conexant Digital]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 1: JamLab [JamLab], device 0: USB Audio [USB Audio]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 2: Audio [Altec Lansing XT1 - USB Audio], device 0: USB Audio [USB Audio]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\n```\n\nPar exemple, la dernière entrée de cette liste a l'ID de carte 2 et l'ID de périphérique 0. Pour définir cette carte par défaut, vous pouvez utiliser le fichier système /etc/asound.conf ou le fichier utilisateur ~/.asoundrc. Vous devrez peut-être créer le fichier s'il n'existe pas. Insérez ensuite les options suivantes avec la carte correspondante.\n\n```\npcm.!default {\n   type hw\n   card 2\n\n\nctl.!default {\n   type hw\n   card 2\n}\n```\n\nDans la plupart des cas, il est recommandé d'utiliser des noms de cartes son plutôt que des références numériques. Les noms de cartes sont plus faciles à comprendre, et permettent également de surmonter le problème de l'ordre de démarrage. Par conséquent, l'exemple suivant serait correct pour l'exemple ci-dessus.\n\n```\npcm.!default {\n   type hw\n   card Audio\n}\n\nctl.!default {\n   type hw\n   card Audio\n}\n```\n\nPour obtenir les noms des cartes ALSA valides, utilisez aplay :\n\n```\n$ aplay -l | awk -F \\ : '/,/{print $2}' | awk '{print $1}' | uniq\n```\n\n```\nPCH\n```\n\nVous pouvez également utiliser cat, qui peut renvoyer des périphériques inutilisés :\n\n```\n$ cat /proc/asound/card*/id\n```\n\n```\nPCH\nThinkPadEC\n```\n\nLes options 'pcm' affectent la carte et le périphérique qui seront utilisés pour la lecture audio tandis que l'option 'ctl' affecte la carte utilisée par les utilitaires de contrôle comme alsamixer.\n\nLes changements devraient prendre effet dès que vous (re)lancez une application (MPlayer etc.). Vous pouvez aussi tester avec une commande comme aplay.\n\n```\n$ aplay -D default:PCH your_favourite_sound.wav\n```\n\nSi vous recevez une erreur concernant la configuration de votre asound, vérifiez dans la upstream documentation les éventuelles modifications du format du fichier de configuration.\n\n"
    },
    {
      "title": "Vérifier que les modules sonores corrects sont chargés",
      "level": 3,
      "content": "Vous pouvez supposer que udev autodétectera correctement votre son. Vous pouvez le vérifier avec la commande :\n\n```\n$ lsmod | grep '^snd' | column -t\n```\n\n```\nsnd_hda_codec_hdmi     22378   4\nsnd_hda_codec_realtek  294191  1\nsnd_hda_intel          21738   1\nsnd_hda_codec          73739   3  snd_hda_codec_hdmi,snd_hda_codec_realtek,snd_hda_intel\nsnd_hwdep              6134    1  snd_hda_codec\nsnd_pcm                71032   3  snd_hda_codec_hdmi,snd_hda_intel,snd_hda_codec\nsnd_timer              18992   1  snd_pcm\nsnd                    55132   9  snd_hda_codec_hdmi,snd_hda_codec_realtek,snd_hda_intel,snd_hda_codec,snd_hwdep,snd_pcm,snd_timer\nsnd_page_alloc         7017    2  snd_hda_intel,snd_pcm\n```\n\nSi la sortie est similaire, vos pilotes de son ont été autodétectés avec succès.\n\nVous pouvez également vérifier que le répertoire /dev/snd/ contient les bons fichiers de périphériques :\n\n```\n$ ls -l /dev/snd\n```\n\n```\ntotal 0\ncrw-rw---- 1 root audio 116, 0 Apr 8 14:17 controlC0\ncrw-rw---- 1 root audio 116, 32 Apr 8 14:17 controlC1\ncrw-rw---- 1 root audio 116, 24 Avr 8 14:17 pcmC0D0c\ncrw-rw---- 1 root audio 116, 16 Avr 8 14:17 pcmC0D0p\ncrw-rw---- 1 root audio 116, 25 Avr 8 14:17 pcmC0D1c\ncrw-rw---- 1 root audio 116, 56 Avr 8 14:17 pcmC1D0c\ncrw-rw---- 1 root audio 116, 48 Avr 8 14:17 pcmC1D0p\ncrw-rw---- 1 root audio 116, 1 Apr 8 14:17 seq\ncrw-rw---- 1 root audio 116, 33 Apr 8 14:17 timer\n```\n\nSi vous avez au moins les périphériques controlC0 et pcmC0D0p ou similaire, alors vos modules de sons ont été détectés et chargés correctement.\n\nSi ce n'est pas le cas, vos modules de sons n'ont pas été détectés correctement. Pour résoudre ce problème, vous pouvez essayer de charger les modules manuellement :\n\n- Localisez le module correspondant à votre carte son : ALSA Soundcard Matrix. Le module sera préfixé par 'snd-' (par exemple : snd-via82xx).\n- Chargez le module.\n- Vérifiez les fichiers de périphériques dans /dev/snd. (consultez ci-dessus) et/ou essayez si alsamixer ou amixer ont une sortie raisonnable.\n- Configurez snd-NAME-OF-MODULE et snd-pcm-oss pour être chargés au démarrage.\n\n"
    },
    {
      "title": "Obtenir une sortie S/PDIF",
      "level": 3,
      "content": "S/PDIF est une interface audio numérique souvent utilisée pour connecter un ordinateur à un amplificateur numérique (tel qu'un home cinéma avec un son surround 5.1/7.1).\n\nEn fonction du shell que vous utilisez, ajoutez la ligne suivante au fichier de configuration de votre shell :\n\n```\namixer -c 0 cset name='IEC958 Playback Switch' on\n```\n\nVous pouvez consulter le nom de la sortie numérique de votre carte avec :\n\n```\n$ amixer scontrols\n```\n\n"
    },
    {
      "title": "Utilisation d'ALSAEqual (fournit une interface utilisateur)",
      "level": 4,
      "content": "Installez le paquet alsaequalAUR.\n\nAprès avoir installé le paquet, ajoutez ce qui suit à votre fichier de configuration ALSA :\n\n```\n/etc/asound.conf\n```\n\n```\nctl.equal {\n    type equal;\n}\n\npcm.plugequal {\n    type equal;\n    # Modify the line below if you do not\n    # want to use sound card 0.\n    #slave.pcm \"plughw:0,0\";\n    # by default we want to play from more sources at time:\n    slave.pcm \"plug:dmix\";\n}\n\n# pcm.equal {\n# If you do not want the equalizer to be your\n# default soundcard comment the following\n# line and uncomment the above line. (You can\n# choose it as the output device by addressing\n# it with specific apps,eg mpg123 -a equal 06.Back_In_Black.mp3)\npcm.!default {\n    type plug;\n    slave.pcm plugequal;\n}\n```\n\nEt vous êtes prêt à changer votre égaliseur en utilisant la commande\n\n```\n$ alsamixer -D equal\n```\n\nNotez que le fichier de configuration est différent pour chaque utilisateur (sauf indication contraire) ; il est enregistré dans ~/.alsaequal.bin. Donc si vous voulez utiliser ALSAEqual avec mpd ou un autre logiciel fonctionnant sous un autre utilisateur, vous pouvez le configurer en utilisant\n\n```\n$ su mpd -c 'alsamixer -D equal'\n```\n\nou par exemple, vous pouvez créer un lien symbolique vers votre .alsaequal.bin dans son répertoire personnel.\n\nInstallez le paquet alsaequal-mgrAUR.\n\nConfigurez l'égaliseur comme d'habitude avec\n\n```\n$ alsamixer -D equal\n```\n\nLorsque vous êtes satisfait de l'état, vous pouvez lui donner un nom (\"foo\" dans cet exemple) et le sauvegarder :\n\n```\n$ alsaequal-mgr save foo\n```\n\nL'état \"foo\" peut ensuite être restauré ultérieurement avec\n\n```\n$ alsaequal-mgr load foo\n```\n\nCependant, ceci ne restaure que ~/.alsaequal.bin. Vous devez alors mettre à jour l'égaliseur par alsamixer -D equal.\n\nVous pouvez donc créer différents états d'égaliseur pour les jeux, les films, les genres musicaux, les applications de VoIP, etc. et les recharger si nécessaire.\n\nConsultez la [page du projet https://xyne.dev/projects/alsaequal-mgr/] et le message d'aide pour plus d'options.\n\n"
    },
    {
      "title": "Utilisation de mbeq",
      "level": 4,
      "content": "mbeq est un égaliseur graphique multibande assez typique. [6]\n\nInstallez les paquets alsa-plugins, ladspa et swh-plugins si vous ne les avez pas déjà.\n\nSi vous n'avez pas encore créé un fichier ~/.asoundrc ou /etc/asound.conf, créez l'un ou l'autre et insérez ce qui suit :\n\n```\n/etc/asound.conf\n```\n\n```\npcm.eq {\n    type ladspa\n\n    # The output from the EQ can either go direct to a hardware device\n    # (if you have a hardware mixer, e.g. SBLive/Audigy) or it can go\n    # to the software mixer shown here.\n    #slave.pcm \"plughw:0,0\"\n    slave.pcm \"plug:dmix\"\n\n    # Sometimes you may need to specify the path to the plugins,\n    # especially if you have just installed them.  Once you have logged\n    # out/restarted this should not be necessary, but if you get errors\n    # about being unable to find plugins, try uncommenting this.\n    #path \"/usr/lib/ladspa\"\n\n    plugins [\n    {\n        label mbeq\n        id 1197\n        input {\n            # The following setting is just an example, edit to your own taste:\n            # bands: 50hz, 100hz, 156hz, 220hz, 311hz, 440hz, 622hz, 880hz, 1250hz, 1750hz, 25000hz,\n            # 50000hz, 10000hz, 20000hz\n            controls [ -5 -5 -5 -5 -5 -10 -20 -15 -10 -10 -10 -10 -10 -3 -2 ]\n            }\n        }\n    ]\n}\n\n# Redirect the default device to go via the EQ - you may want to do\n# this last, once you are sure everything is working.  Otherwise all\n# your audio programs will break/crash if something has gone wrong.\npcm.!default {\n    type plug\n    slave.pcm \"eq\"\n}\n\n# Redirect the OSS emulation through the EQ too (when programs are running through \"aoss\")\npcm.dsp0 {\n    type plug\n    slave.pcm \"eq\"\n}\n```\n\n"
    },
    {
      "title": "Rééchantillonnage de haute qualité",
      "level": 2,
      "content": "Lorsque le mixage logiciel est activé, ALSA est obligé de tout rééchantillonner à la même fréquence (48 kHz par défaut lorsqu'il est pris en charge). Par défaut, il essaiera d'utiliser le convertisseur speexrate pour le faire, et se rabattra sur une interpolation linéaire de basse qualité s'il n'est pas disponible [7]. Ainsi, si vous obtenez une mauvaise qualité sonore à cause d'un mauvais rééchantillonnage, le problème peut être résolu en installant simplement le paquet alsa-plugins.\n\nPour un rééchantillonnage de qualité encore supérieure, vous pouvez modifier le convertisseur de taux par défaut en speexrate_medium ou speexrate_best. Les deux sont suffisamment performants pour que, dans la pratique, le choix de l'un ou l'autre n'ait pas d'importance. L'utilisation du meilleur convertisseur ne vaut généralement pas les cycles CPU supplémentaires qu'il requiert.\n\nPour changer le convertisseur par défaut, placez le contenu suivant dans votre ~/.asoundrc ou /etc/asound.conf :\n\n```\n/etc/asound.conf\n```\n\n```\ndefaults.pcm.rate_converter \"speexrate_medium\"\n```\n\n- Il est également possible d'utiliser les convertisseurs libsamplerate, qui sont environ deux fois moins rapides que les convertisseurs speexrate mais ne permettent pas d'obtenir une qualité beaucoup plus élevée. Consultez discussion[broken link: invalid section].\n- Il est également possible d'utiliser des rééchantillonneurs lavcrate [8] qui utilisent FFmpeg. Avec des tailles de filtre de lavcrate_faster:4 lavcrate_fast:8 lavcrate:16 lavcrate_high:32 lavcrate_higher:64. Les deux dernières options correspondent respectivement aux rééchantillonneurs de basse et moyenne qualité de Kodi.\n- Certaines applications (comme MPlayer et ses forks) font leur propre rééchantillonnage par défaut parce que certains pilotes ALSA ont un rapport de délai incorrect lorsque le rééchantillonnage est activé (ce qui entraîne une désynchronisation AV), donc changer ce paramètre n'aura aucun effet à moins que vous ne les configuriez pour utiliser le rééchantillonnage ALSA.\n\n"
    },
    {
      "title": "Upmixing",
      "level": 3,
      "content": "Pour que des sources stéréo comme la musique puissent saturer un système sonore 5.1 ou 7.1, vous devez utiliser l'upmixing. Dans les temps plus sombres, cette opération était délicate et source d'erreurs, mais aujourd'hui, il existe des plugins qui permettent de s'acquitter facilement de cette tâche. Nous utiliserons le plugin upmix, inclus dans le paquet alsa-plugins.\n\nEnsuite, ajoutez ce qui suit au fichier de configuration ALSA de votre choix (soit /etc/asound.conf ou ~/.asoundrc) :\n\n```\npcm.upmix71 {\n   type upmix\n   slave.pcm \"surround71\n   delay 15\n   channels 8\n}\n```\n\nVous pouvez facilement modifier cet exemple pour le mixage ascendant 7.1 en 5.1 ou 4.0.\n\nL'exemple suivant ajoute un nouveau canal PCM que vous pouvez utiliser pour le mixage ascendant. Si vous voulez que toutes les sources sonores passent par ce canal, ajoutez-le par défaut en dessous de la définition précédente, comme suit\n\n```\npcm.!default \"plug:upmix71\"\n```\n\nLe plugin permet automatiquement à plusieurs sources de passer par ce canal sans problème, donc le définir par défaut est un choix sûr. Si cela ne fonctionne pas, vous devez configurer votre propre dmixer pour le PCM upmixing comme ceci :\n\n```\npcm.dmix6 {\n   type asym\n   playback.pcm {\n       type dmix\n       ipc_key 567829\n       slave {\n           pcm \"hw:0,0\n           canaux 6\n       }\n   }\n}\n```\n\net utilisez \"dmix6\" au lieu de \"surround71\". Si vous rencontrez des sauts ou un son déformé, envisagez d'augmenter la taille du tampon (à 32768, par exemple) ou utilisez un rééchantillonneur de haute qualité.\n\n"
    },
    {
      "title": "Downmixing",
      "level": 3,
      "content": "Si vous voulez downmixer des sources en stéréo parce que vous voulez, par exemple, regarder un film avec un son 5.1 sur un système stéréo, utilisez le plugin vdownmix, inclus dans le paquet alsa-plugins.\n\nEncore une fois, dans votre fichier de configuration, ajoutez ceci :\n\n```\npcm.!surround51 {\n   type vdownmix\n   slave.pcm \"default\n}\npcm.!surround40 {\n   type vdownmix\n   slave.pcm \"par défaut\n}\n```\n\n"
    },
    {
      "title": "Dmix",
      "level": 2,
      "content": "Le mixage permet à plusieurs applications de produire du son en même temps. La plupart des cartes son dédiées prennent en charge le mixage matériel, qui est pris en charge par défaut s'il est disponible. Les cartes son intégrées à la carte mère (telles que Intel HD Audio), ne prennent généralement pas en charge le mixage matériel. Sur ces cartes, le mixage logiciel est effectué par un plugin ALSA appelé dmix. Cette fonction est activée automatiquement si le mixage matériel n'est pas disponible.\n\nPour activer manuellement dmix, ajoutez ce qui suit à votre fichier de configuration ALSA :\n\n```\n/etc/asound.conf\n```\n\n```\npcm.dsp {\n    type plug\n    slave.pcm \"dmix\"\n}\n```\n\n"
    },
    {
      "title": "Désactivation de l'auto-mute au démarrage",
      "level": 3,
      "content": "Le mode Auto-Mute peut être configuré au démarrage avec amixer. Par exemple, pour le désactiver :\n\n```\n# amixer -c 0 sset \"Auto-Mute Mode\" Disabled\n```\n\nIl est également possible d'utiliser l'interface graphique via alsamixer. Afin de sauvegarder les modifications, utilisez :\n\n```\n# alsactl store\n```\n\nou\n\n```\n# alsactl daemon\n```\n\nConsultez ALSA et Systemd.\n\n"
    },
    {
      "title": "Connexion à chaud d'une carte son USB",
      "level": 3,
      "content": "Consultez Writing Udev rules for ALSA.\n\n"
    },
    {
      "title": "Sortie simultanée",
      "level": 3,
      "content": "Il se peut que vous souhaitiez diffuser de la musique simultanément sur des haut-parleurs externes connectés via un mini jack et sur des haut-parleurs internes. Pour ce faire, il suffit de réactiver l'élément Auto-Mute en utilisant alsamixer ou amixer :\n\n```\n$ amixer sset \"Auto-Mute\" unmute\n```\n\npuis réactiver d'autres éléments nécessaires, tels que Casque, Haut-parleur, Haut-parleur de basses...\n\n"
    },
    {
      "title": "Contrôle du volume au clavier",
      "level": 3,
      "content": "Mappez les commandes suivantes à vos touches de volume : XF86AudioRaiseVolume, XF86AudioLowerVolume, XF86AudioMute.\n\nPour augmenter le volume :\n\n```\namixer set Master 5%+\n```\n\nPour baisser le volume :\n\n```\namixer set Master 5%-\n```\n\nPour activer/désactiver le volume :\n\n```\namixer set Master toggle\n```\n\n"
    },
    {
      "title": "Dispositif sonore virtuel utilisant snd-aloop",
      "level": 3,
      "content": "Vous pourriez vouloir une alternative jack pour créer un dispositif d'enregistrement ou de lecture virtuel afin de mélanger différentes sources, en utilisant le module snd-aloop :\n\n```\nmodprobe snd-aloop\n```\n\nListez vos nouveaux périphériques virtuels en utilisant :\n\n```\naplay -l\n```\n\nVous pouvez maintenant par exemple utiliser ffmpeg :\n\n```\nffmpeg -f alsa -i hw:1,1,0 -f alsa -i hw:1,1,1 -filter_complex amerge output.mp3\n```\n\nDans la phrase hw:R,W,N, R est le numéro de périphérique de votre carte virtuelle. W doit être réglé sur 1 pour les périphériques d'enregistrement, ou 0 pour la lecture. N est votre périphérique secondaire. Vous pouvez utiliser tous les périphériques virtuels disponibles et lire/arrêter en utilisant des applications comme mplayer :\n\n```\nmplayer -ao alsa:device=hw=1,0,0 fileA\nmplayer -ao alsa:device=hw=1,0,1 fileB\n```\n\nUne autre chose que vous pourriez faire avec cette approche, est d'utiliser festival pour générer une voix dans un flux d'enregistrement en utilisant un script comme celui-ci :\n\n```\n#!/bin/sh\necho \"$1\"|iconv -f utf-8 -t iso-8859-1| text2wave > \"_tmp_.wav\" ;\nmplayer -ao alsa:device=hw=2,0,0 \"_tmp.wav\" ;\nrm \"_tmp.wav\" ;\n```\n\n"
    },
    {
      "title": "Récupération de l'état du pilote",
      "level": 4,
      "content": "Le paquet alsa-utils contient également la commande alsa-info.sh, qui peut être utilisée pour recueillir des données détaillées sur le pilote ALSA et l'état de l'espace utilisateur.\n\nConsultez ALSA bug tracking pour plus d'informations.\n\n"
    },
    {
      "title": "Reconfiguration des ports d'entrée/sortie",
      "level": 4,
      "content": "Le paquet alsa-tools contient l'outil hdajackretask, qui peut être utilisé (sur les cartes Intel HDA) pour reconfigurer les ports d'entrée/sortie de la carte son ; par exemple, pour transformer une prise de microphone en prise de casque.\n\n"
    },
    {
      "title": "Réinitialisation des codecs",
      "level": 4,
      "content": "Le pilote ALSA peut reconfigurer complètement les codecs attachés (les parties du système de son qui traitent réellement les flux audio), en faisant :\n\n```\n# echo 1 > /sys/class/sound/card/reconfig\n```\n\nAvant de faire cela, tous les processus utilisant le pilote ALSA (comme Pulseaudio ou JACK) doivent être arrêtés.\n\n"
    },
    {
      "title": "Détecter correctement le microphone branché dans un jack 3,5 mm (TRRS) à 4 broches",
      "level": 3,
      "content": "Sur certains ordinateurs portables modernes, vous pouvez avoir une prise casque 3,5 mm combinée, au lieu de deux prises séparées, qui peuvent ne pas être correctement détectées par défaut. Pour qu'ALSA détecte correctement l'état du plug-in sur votre prise 3.5mm, vous pouvez mettre la ligne suivante dans votre /etc/modprobe.d/alsa-base.conf :\n\n```\noptions snd_hda_intel index=0 model=your_model_setting\n```\n\nPour une liste complète des options à placer dans your_model_setting, consultez HD-Audio Codec-Specific Models ou sa source située à /usr/lib/modules/$(uname -r)/build/Documentation/sound/hd-audio/models.rst. (fourni par le paquet linux-docs).\n\nTesté avec le Gigabyte Aero15 2017 (modèle P65), avec ALC255 et le modèle défini à dell-headset-multi.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- ALSA wiki\n- Asoundrc\n- Documentation des plugins ALSA\n- Wiki ALSA non-officiel\n- Configuration avancée des modules ALSA.\n- HOWTO : compiler le pilote depuis svn\n- Un regard attentif sur ALSA : Introduction au concept ALSA\n- Notes sur l'utilisation d'ALSA sous Linux.\n\n"
    }
  ]
}