{
  "title": "Advanced Format (Español)",
  "url": "https://wiki.archlinux.org/title/Advanced_Format_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-10-30** \n\nEl formato avanzado es un término genérico que pertenece a cualquier formato de sector de disco utilizado para almacenar datos sobre discos magnéticos en unidades de disco duro (HDD) que utiliza sectores de 4 kilobytes en lugar de los tradicionales sectores de 512 bytes. La idea principal detrás del uso de sectores de 4096 bytes es aumentar la densidad de bits en cada pista reduciendo el número de espacios que contienen información Sync/DAM (memoria de acceso directo) y ECC (código de corrección de errores) entre sectores de datos. El formato anterior daba una eficiencia de formato del 88.7%, mientras que el formato avanzado da como resultado una eficiencia de formato del 97.3%.\n\nHay dos tipos de unidades de formato avanzado (siglas en inglés AF):\n\n- Unidades de formato avanzado, marcadas con un logotipo naranja «AF»: internamente, utilizan sectores 4k, pero proporcionan una capa de emulación para compatibilidad con sistemas operativos que carecen de soporte para ellos.\n- Unidades nativas de formato avanzado 4k, marcadas con un logotipo azul «4Kn»\": requieren soporte del sistema operativo (Windows 8+ o Linux 2.6.31+). Debido a que no necesitan una capa de traducción, son más baratos, sin embargo, pueden ser incompatibles con las herramientas antiguas.\n\n"
    },
    {
      "title": "Cómo determinar si HDD emplea un sector de 4k",
      "level": 2,
      "content": "El tamaño del sector físico y lógico del disco duro /dev/sdX se puede determinar leyendo las siguientes entradas de sysfs:\n\n```\n$ cat /sys/class/block/sdX/queue/physical_block_size\n$ cat /sys/class/block/sdX/queue/logical_block_size\n```\n\nLas unidades con una capa de traducción (ver arriba) generalmente informarán un tamaño de bloque lógico de 512 (para compatibilidad con versiones anteriores) y un tamaño de bloque físico de 4096 (lo que indica que son unidades AF).\n\nLas herramientas que informa del sector físico de una unidad (siempre que la unidad lo informe —al kernel— correctamente) incluyen:\n\n- smartmontools a partir de 5.41: smartctl -a /dev/sdX | grep 'Sector Size:'\n- hdparm a partir de 9.12: hdparm -I /dev/sdX | grep 'Physical Sector size:'\n\nTenga en cuenta que ambos funcionan incluso para discos conectados por USB (si el puente USB admite SAT conocida como SCSI/ATA Translation (SAT), ANSI INCITS 431-2007).\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Western Digital’s Advanced Format: The 4K Sector Transition Begins\n- White paper entitled \"Advanced Format Technology.\"\n- El fallo al alinear HDD se traduce en un pobre rendimiento de lectura/escritura. Véase este artículo para ejemplos específicos.\n\n"
    }
  ]
}