{
  "title": "Agregando un Administrador de sesión (KDM, GDM, ó XDM) (Español)",
  "url": "https://wiki.archlinux.org/title/Agregando_un_Administrador_de_sesi%C3%B3n_(KDM,_GDM,_%C3%B3_XDM)_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-07** \n\nArtículos relacionados\n\n- Iniciar X al iniciar sesión\n\nUn gestor de pantalla, o gestor de inicio de sesión, es típicamente una interfaz gráfica de usuario que se muestra al final del proceso de arranque en lugar del shell por defecto. Hay varias implementaciones de gestores de pantalla, al igual que hay varios tipos de gestores de ventanas y entornos de escritorio. Normalmente hay una cierta cantidad de personalización y tematización disponible para cada uno.\n\n"
    },
    {
      "title": "Consola",
      "level": 3,
      "content": "- CDM — Gestor de inicio de sesión escrito en Bash.\n\n- Console TDM — Extensión para xinit escrito en puro Bash.\n\n- nodm — Gestor de pantalla para inicios de sesión automáticos, sin mantenimiento desde 2017.\n\n- Ly — Gestor de pantalla TUI (tipo ncurses) para Linux y BSD. Soporta sesiones X y Wayland.\n\n- tbsm — Un lanzador de aplicaciones o de sesiones bash. Soporta X y Wayland.\n\n- emptty — Un sencillo gestor de pantallas CLI en TTY con soporte para X y Wayland.\n\n- loginx — Una combinación de getty/login/xinit con una interfaz de usuario curses amigable.\n\n"
    },
    {
      "title": "Gráficos",
      "level": 3,
      "content": "- Entrance — Gestor de pantalla de Enlightenment.\n\n- GDM — Gestor de pantalla de GNOME.\n\n- LightDM — Gestor de pantalla multiescritorio, puede usar varios front-ends escritos en cualquier toolkit.\n\n- LXDM — Gestor de pantalla de LXDE. Puede utilizarse independientemente del entorno de escritorio LXDE.\n\n- SDDM — Gestor de pantalla basado en QML y sucesor de KDM; recomendado para Plasma y LXQt.\n\n- XDM — Gestor de pantalla X con soporte para XDMCP, selector de host.\n\n"
    },
    {
      "title": "Daemons de inicio de sesión",
      "level": 3,
      "content": "- greetd — Daemon de inicio de sesión que admite tanto la bienvenida por consola como de manera gráfica.\n\n"
    },
    {
      "title": "Cargar el gestor de pantalla",
      "level": 2,
      "content": "Para habilitar el inicio de sesión gráfico, habilite el servicio systemd apropiado. Por ejemplo, para SDDM, active sddm.service.\n\nEsto debería funcionar sin necesidad de configuración. Si no es así, puede que tenga que restablecer un enlace simbólico personalizado default.target para que apunte al graphical.target por defecto. Véase Systemd (Español)#Cambiar el target predeterminado para arrancar.\n\nDespués de habilitar SDDM, debe establecerse un enlace simbólico display-manager.service en /etc/systemd/system/. Es posible que tenga que utilizar --force para anular los enlaces simbólicos antiguos.\n\n```\n$ file /etc/systemd/system/display-manager.service\n```\n\n```\n/etc/systemd/system/display-manager.service: symbolic link to /usr/lib/systemd/system/sddm.service\n```\n\n"
    },
    {
      "title": "Usar systemd-logind",
      "level": 3,
      "content": "Para comprobar el estado de su sesión de usuario, puede usar loginctl. Todas las acciones de polkit como suspender el sistema o montar discos externos funcionarán sin necesidad de configuración.\n\n```\n$ loginctl show-session $XDG_SESSION_ID\n```\n\n"
    },
    {
      "title": "Configuración de la sesión",
      "level": 2,
      "content": "Muchos gestores de pantalla leen las sesiones disponibles del directorio /usr/share/xsessions/. Contiene archivos de entrada de escritorio estándares para cada uno de los entornos de escritorio o gestores de ventanas. Algunos gestores de pantalla utilizan un directorio separado /usr/share/wayland-sessions/ para listar las sesiones específicas de Wayland.\n\nPara añadir/eliminar entradas a la lista de sesiones de su gestor de pantalla, cree/elimine los archivos .desktop en /usr/share/xsessions/ como desee. Un archivo .desktop típico tendrá un aspecto similar a:\n\n```\n[Desktop Entry]\nName=Openbox\nComment=Log in using the Openbox window manager (without a session manager)\nExec=/usr/bin/openbox-session\nTryExec=/usr/bin/openbox-session\nIcon=openbox.png\nType=Application\n```\n\n"
    },
    {
      "title": "Ejecutar ~/.xinitrc como una sesión",
      "level": 3,
      "content": "La instalación de xinit-xsessionAUR proporciona una opción para ejecutar su xinitrc como una sesión. Simplemente establezca xinitrc como sesión en la configuración de su gestor de pantalla y asegúrese de que el archivo ~/.xinitrc es ejecutable.\n\n"
    },
    {
      "title": "Iniciar aplicaciones sin un gestor de ventanas",
      "level": 3,
      "content": "También es posible lanzar una aplicación sin ninguna decoración, escritorio o gestor de ventanas. Por ejemplo, para lanzar google-chromeAUR cree un archivo web-browser.desktop en /usr/share/xsessions/ tal que así:\n\n```\n[Desktop Entry]\nName=Web Browser\nComment=Use a web browser as your session\nExec=/usr/bin/google-chrome --auto-launch-at-startup\nTryExec=/usr/bin/google-chrome --auto-launch-at-startup\nIcon=google-chrome\nType=Application\n```\n\nEn este caso, una vez que inicie sesión, la aplicación establecida con Exec será lanzada inmediatamente. Cuando cierre la aplicación, volverá al gestor de inicio de sesión (igual que al cerrar la sesión de un entorno de escritorio o gestor de ventanas normal).\n\nEs importante recordar que la mayoría de las aplicaciones gráficas no están pensadas para ser lanzadas de esta manera y puede que tenga que hacer ajustes manuales o sufrir limitaciones (no hay un gestor de ventanas, así que no espere poder mover o redimensionar ninguna ventana, incluyendo los diálogos; sin embargo, puede ser capaz de establecer la geometría de la ventana en los archivos de configuración de la aplicación).\n\nVéase también Xinit (Español)#Iniciar aplicaciones sin un gestor de ventanas.\n\n"
    },
    {
      "title": "Inicio automático",
      "level": 3,
      "content": "La mayoría de los gestores de pantalla tienen como fuente /etc/xprofile, ~/.xprofile y /etc/X11/xinit/xinitrc.d/. Para más detalles, véase xprofile.\n\n"
    },
    {
      "title": "Establecer el idioma para la sesión de usuario",
      "level": 3,
      "content": "Para los gestores de pantalla que utilizan AccountsService, el locale para la sesión de usuario puede establecerse editando:\n\n```\n/var/lib/AccountsService/users/$USER\n```\n\n```\n[User]\nLanguage=su_locale\n```\n\ndonde su_locale es un valor como, por ejemplo, es_ES.UTF-8.\n\nDe manera alternativa, puede conseguirlo usando D-Bus: busctl call org.freedesktop.Accounts /org/freedesktop/Accounts/User$UID org.freedesktop.Accounts.User SetLanguage s su_locale\n\nCierre sesión y vuelva a entrar para que los cambios surtan efecto.\n\n"
    }
  ]
}