{
  "title": "AIDE",
  "url": "https://wiki.archlinux.org/title/AIDE",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Advanced Intrusion Detection Environment (AIDE) is a host-based intrusion detection system (HIDS) for checking the integrity of files. It does this by creating a baseline database of files on an initial run, and then checks this database against the system on subsequent runs. File properties that can be checked against include inode, permissions, modification time, file contents, etc.\n\nAIDE only does file integrity checks. It does not check for rootkits or parse logfiles for suspicious activity, like some other HIDS (such as OSSEC) do. For these features, you can use an additional HIDS (see [1] for a possibly biased comparison), or use standalone rootkit scanners (rkhunter, chkrootkit) and log monitoring solutions (logwatch, logcheck).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "You can install the aideAUR package, or you can instead install aide-selinuxAUR if you want to use it in a system with SELinux and Audit framework enabled.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The default configuration file at /etc/aide.conf has defaults based on Fedora and is heavily commented. If you want to change the rules, see aide.conf(5) and the AIDE Manual for further documentation.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "To check your configuration, use aide -D.\n\nTo initialize the database, use aide -i or aideinit. Depending on your configuration and system, this command can take a while to complete.\n\nYou can check the system against the baseline database using aide -C, or update the baseline db using aide -u.\n\nFor more info, see aide(1).\n\n"
    },
    {
      "title": "Cron",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nAIDE can be run manually if desired, but you may want to run it automatically instead. How you set this up will depend on your cron daemon and MUA (if email notification is desired).\n\nIf cron is set up to automatically mail all job output, it can be as simple as\n\n```\n#!/bin/bash -e\n```\n\n```\n# these should be the same as what's defined in /etc/aide.conf\ndatabase=/var/lib/aide/aide.db.gz\ndatabase_out=/var/lib/aide/aide.db.new.gz\n\nif [ ! -f \"$database\" ]; then\n        echo \"$database not found\" >&2\n        exit 1\nfi\n\naide -u || true\n\nmv $database $database.back\nmv $database_out $database\n```\n\nFor examples of more complicated cron scripts see [2] or [3].\n\n"
    },
    {
      "title": "Security",
      "level": 3,
      "content": "Since the database is stored on the root filesystem, attackers can easily modify it to cover their tracks if they compromise your system. You may want to copy the database to offline, read-only media and perform checks against this copy periodically.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- AIDE manual\n- Gentoo:Security Handbook/Intrusion detection\n- Samhain Labs - file integrity checkers\n\n"
    }
  ]
}