{
  "title": "Alacritty (Русский)",
  "url": "https://wiki.archlinux.org/title/Alacritty_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Alacritty — простой, аппаратно-ускоренный эмулятор терминала, написанный на Rust. Он поддерживает прокрутку, 24-битные цвета (TrueColor), копирование/вставку текста, переход по гиперссылкам и пользовательские сочетания клавиш.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет alacritty или версию для разработчиков — alacritty-gitAUR.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Alacritty ищет конфигурационный файл по следующим путям, в указанном порядке:\n\n- $XDG_CONFIG_HOME/alacritty/alacritty.yml\n- $XDG_CONFIG_HOME/alacritty.yml\n- $HOME/.config/alacritty/alacritty.yml\n- $HOME/.alacritty.yml\n\nСкопируйте шаблон файла конфигурации из /usr/share/doc/alacritty/example/alacritty.yml в один из приведённых путей и раскомментируйте настройки, которые желаете изменить. Большая часть настроек применится, как только вы сохраните файл.\n\n"
    },
    {
      "title": "Цвета",
      "level": 3,
      "content": "Смотрите вики проекта для получения списка доступных цветовых схем. Если понравившаяся цветовая схема есть в списке, то вставьте приведённый код в ваш конфигурационный файл.\n\n"
    },
    {
      "title": "Шрифт",
      "level": 3,
      "content": "Если вы не хотите использовать шрифт, установленный в системе по умолчанию, то можете указать другой, изменив следующие строки:\n\n```\nfont:\n  normal:\n    family: monospace\n    style: Regular\n\n  bold:\n    family: monospace\n    style: Bold\n\n  italic:\n    family: monospace\n    style: Italic\n\n  bold_italic:\n    family: monospace\n    style: Bold Italic\n\n  size: 11\n```\n\nЗамените monospace на имя шрифта, полученное в качестве вывода следующей команды:\n\n```\n$ fc-list : family style\n```\n\nОбратите внимание, что некоторые шрифты не предоставляют стиль Italic, а используют вместо этого Oblique.\n\n"
    },
    {
      "title": "Запуск нового экземпляра в том же каталоге",
      "level": 3,
      "content": "Добавьте следующие строки в ваш файл конфигурации, чтобы запускать новый экземпляр Alacritty в текущей рабочей директории при нажатии Ctrl+Shift+Enter:\n\n```\nkey_bindings:\n  - { key: Return,   mods: Control|Shift, action: SpawnNewInstance }\n```\n\n"
    },
    {
      "title": "\"пользователь@хост:каталог\" в заголовочной панели окна",
      "level": 3,
      "content": "Заголовочная панель окна показывает \"Alacritty\", в отличие от других эмуляторов терминала для Arch, которые по умолчанию показывают \"пользователь@хост:каталог\"\n\nЧтобы применить поведение Arch по умолчанию ко всем своим пользователям в Alacritty, отредактируйте ваш файл /etc/bash.bashrc.\n\nНайдите выражение \"case\", которое устанавливает $PROMPT_COMMAND для других терминалов:\n\n```\ncase ${TERM} in\n\n  xterm*|rxvt*|Eterm|aterm|kterm|gnome*)\n     PROMPT_COMMAND=${PROMPT_COMMAND:+$PROMPT_COMMAND; }'printf \"\\033]0;%s@%s:%s\\007\" \"${USER}\" \"${HOSTNAME%%.*}\" \"${PWD/#$HOME/\\~}\"'\n\n    ;;\n  screen*)\n    PROMPT_COMMAND=${PROMPT_COMMAND:+$PROMPT_COMMAND; }'printf \"\\033_%s@%s:%s\\033\\\\\" \"${USER}\" \"${HOSTNAME%%.*}\" \"${PWD/#$HOME/\\~}\"'\n    ;;\nesac\n```\n\nЗатем отредактируйте строчку xterm*|rxvt*|Eterm|aterm|kterm|gnome*), добавив в неё alacritty, чтобы получилось xterm*|rxvt*|Eterm|alacritty|aterm|kterm|gnome*).\n\n"
    },
    {
      "title": "Режим Vi и копирование/вставка",
      "level": 3,
      "content": "Режим Vi позволяет перемещаться внутри окна Alacritty и использовать прокрутку при помощи клавиатуры. По умолчанию можно переключить этот режим, нажав Ctrl+Shift+Space. Для копирования можно либо использовать мышку, чтобы выбрать текст, и нажать Ctrl+Shift+c, либо войти в режим Vi, начать выделение с помощью v, перемещать его с помощью hjkl, как в vim, и скопировать выделенный текст с помощью y. Для вставки нажмите Ctrl+Shift+v. Чтобы скопировать/вставить в/из буфер(а) обмена X, можно использовать выделение мышкой для копирования и нажатие средней кнопки мыши для вставки.\n\n"
    },
    {
      "title": "Регулярные выражения-подсказки",
      "level": 3,
      "content": "Регулярные выражения-подсказки можно использовать для нахождения текста в видимой части терминала и передачи его в другие приложения. После активации подходящие фрагменты текста подсвечиваются с помощью \"подсказок\" согласно настроенному словарю и доступны пользователю для выделения с помощью клавиатуры.\n\nПо умолчанию Alacritty предоставляет подсказки для URL с помощью сочетания клавиш Ctrl+Shift+U и открывает их с помощью xdg-open. Подробности по настройке см. в разделе hints: в alacritty.yml.\n\n"
    },
    {
      "title": "Мышь некорректно работает в Vim",
      "level": 3,
      "content": "Добавьте ttymouse=sgr в .vimrc или перейдите на Neovim. Кроме того, см. эту проблему.\n\n"
    },
    {
      "title": "Прозрачные границы в dwm",
      "level": 3,
      "content": "При использовании dwm границы alacritty становятся прозрачными. Добавление следующей строки в dwm.c в каталоге с исходным кодом dwm и повторная компиляция решают проблему.\n\n```\nif (!XftColorAllocName(...))\n    die(\"error, cannot allocate color '%s'\", clrname); /* Найдите эту строку */\ndest->pixel |= 0xff << 24; /* Добавьте эту строку */\n```\n\n"
    },
    {
      "title": "Функционал терминала недоступен в удалённых сеансах",
      "level": 3,
      "content": "При подключении к удалённой системе из Alacritty, например с помощью SSH, в ней может не быть записи для Alacritty в базе данных terminfo (/usr/share/terminfo/a/alacritty*). В таком случае, интерактивные функции терминала работать не будут. Это можно исправить, скопировав информацию об Alacritty на удалённый сервер, как описано здесь.\n\nНа локальном устройстве, используя Alacritty:\n\n```\n$ infocmp > alacritty.terminfo  # Экспорт информации об Alacritty\n$ scp alacritty.terminfo user@remote-host:~/  # Можно использовать любой способ копирования на удалённое устройство\n```\n\nНа удалённом устройстве, в папке, куда был скопирован alacritty.terminfo:\n\n```\n$ tic -x alacritty.terminfo  # импорт для текущего пользователя\n$ rm alacritty.terminfo  # теперь файл можно удалить\n```\n\nВ качестве альтернативы, можно изменить значение TERM в конфигурации на xterm-256color вместо установленного по умолчанию alacritty:\n\n```\nenv:\n  TERM: xterm-256color\n```\n\n"
    },
    {
      "title": "Требует оборудование с поддержкой GLSL 3.30",
      "level": 3,
      "content": "Можно заставить Alacritty использовать программную отрисовку, если запустить его с переменной окружения LIBGL_ALWAYS_SOFTWARE=1 [1]:\n\n```\n$ LIBGL_ALWAYS_SOFTWARE=1 alacritty\n```\n\n"
    },
    {
      "title": "Нет заголовка окна на Wayland GNOME",
      "level": 3,
      "content": "При использовании Wayland GNOME заголовок окна может быть пустым и содержать странные иконки. Смотрите https://github.com/alacritty/alacritty/issues/4739 для подробностей.\n\nЭто можно обойти, если запустить Alacritty через Xwayland вместо нативного Wayland, прописав пустую переменную окружения WAYLAND_DISPLAY.\n\n"
    },
    {
      "title": "Разные размеры шрифтов на нескольких мониторах",
      "level": 3,
      "content": "По умолчанию, Alacritty пытается масштабировать шрифты до подходящих размеров на каждом мониторе на основании Device pixel ratio. При некоторых конфигурациях с несколькими мониторами, это может приводить к сильно различающимся физическим размерам [2], [3].\n\nЧтобы просмотреть текущее соотношение пикселей на каждом мониторе, выполните alacritty -v, перемещайте по очереди дочернее окно на каждый монитор и обращайте внимание на значение Device pixel ratio, отображающееся в родительском окне.\n\nЗадание постоянного соотношения пикселей с помощью переменной окружения WINIT_X11_SCALE_FACTOR может исправить проблему с разными размерами шрифтов:\n\n```\n$ WINIT_X11_SCALE_FACTOR=1.66 alacritty\n```\n\n"
    }
  ]
}