{
  "title": "Alacritty (Português)",
  "url": "https://wiki.archlinux.org/title/Alacritty_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O Alacritty é um emulador de terminal simples, acelerado por GPU, escrito em Rust. Ele suporta rolagem, truecolor, copiar/colar, cliques em URLs e combinações de teclas personalizadas.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote alacritty ou, a versão de desenvolvimento alacritty-gitAUR.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "O Alacritty procura um arquivo de configuração nos seguintes locais nesta ordem:\n\n- $XDG_CONFIG_HOME/alacritty/alacritty.yml\n- $XDG_CONFIG_HOME/alacritty.yml\n- $HOME/.config/alacritty/alacritty.yml\n- $HOME/.alacritty.yml\n\nCopie o arquivo de configuração de exemplo em /usr/share/doc/alacritty/example/alacritty.yml para um desses lugares e remova o comentário das configurações que deseja alterar. A maioria das configurações entra em vigor assim que você salva o arquivo.\n\n"
    },
    {
      "title": "Cores",
      "level": 3,
      "content": "Veja o Esquema de cores para obter uma lista dos esquemas de cores disponíveis. Se o seu esquema de cores preferido estiver na lista, cole o código fornecido no seu arquivo de configuração.\n\n"
    },
    {
      "title": "Fontes",
      "level": 3,
      "content": "Se você não quiser usar a fonte padrão do seu sistema, poderá especificar uma fonte diferente alterando as seguintes linhas:\n\n```\nfont:\n  normal:\n    family: monospace\n    style: Regular\n\n  bold:\n    family: monospace\n    style: Bold\n\n  italic:\n    family: monospace\n    style: Italic\n\n  bold_italic:\n    family: monospace\n    style: Bold Italic\n```\n\nSubstitua monospace com um nome de fonte da saída:\n\n```\n$ fc-list : family style\n```\n\nObserve que algumas fontes não fornecem um estilo Italic, e sim um estilo Oblique.\n\n"
    },
    {
      "title": "Gerar nova instância no mesmo diretório",
      "level": 3,
      "content": "Adicione as seguintes linhas ao seu arquivo de configuração para gerar uma nova instância do Alacritty no diretório de trabalho atual pressionando Ctrl+Shift+Enter:\n\n```\nkey_bindings:\n  - { key: Return,   mods: Control|Shift, action: SpawnNewInstance }\n```\n\n"
    },
    {
      "title": "\"user@host:cwd\" na barra de título da janela",
      "level": 3,
      "content": "A barra de título da janela mostra \"Alacritty\" diferente de outros emuladores de terminal no Arch, que por padrão mostram \"user@host:cwd\".\n\nSe você deseja que o comportamento padrão do Arch se aplique a todos os usuários no Alacritty, edite seu arquivo /etc/bash.bashrc.\n\nEncontre as instruções de caso que definem o $PROMPT_COMMAND para outros terminais:\n\n```\ncase ${TERM} in\n```\n\n```\nxterm*|rxvt*|Eterm|aterm|kterm|gnome*)\n     PROMPT_COMMAND=${PROMPT_COMMAND:+$PROMPT_COMMAND; }'printf \"\\033]0;%s@%s:%s\\007\" \"${USER}\" \"${HOSTNAME%%.*}\" \"${PWD/#$HOME/\\~}\"'\n```\n\n```\n;;\n  screen*)\n    PROMPT_COMMAND=${PROMPT_COMMAND:+$PROMPT_COMMAND; }'printf \"\\033_%s@%s:%s\\033\\\\\" \"${USER}\" \"${HOSTNAME%%.*}\" \"${PWD/#$HOME/\\~}\"'\n    ;;\nesac\n```\n\nDepois edite a linha xterm*|rxvt*|Eterm|aterm|kterm|gnome*) para adicionar alacritty para que ele leia xterm*|rxvt*|Eterm|alacritty|aterm|kterm|gnome*).\n\n"
    },
    {
      "title": "Modo Vi e Copiar/Colar",
      "level": 3,
      "content": "O modo vi permite mover-se pela janela de exibição Alacritty e rolar para trás usando o teclado. Por padrão, você pode alternar usando Ctrl+Shift+Space. Para copiar, você pode usar um mouse para selecionar e pressionar Ctrl+Shift+c ou entre no modo Vi, inicie uma seleção usando v, mover-se com hjkl como no vim, e copie a seleção com y. Para colar, pressione Ctrl+Shift+v. Para copiar/colar para / da área de transferência do X, você pode usar uma seleção do mouse para copiar e um clique do meio do mouse para colar.\n\n"
    },
    {
      "title": "O mouse não está funcionando corretamente no Vim",
      "level": 3,
      "content": "Adicone ttymouse=sgr no seu .vimrc ou mude para o Neovim. Veja também este assunto.\n\n"
    },
    {
      "title": "Borda transparente no dwm",
      "level": 3,
      "content": "Com o dwm, as bordas do alacritty tornam-se transparentes. Adicionando esta linha ao arquivo drw.c no diretório de origem do dwm e recompilando corrige esse problema.\n\n```\nif (!XftColorAllocName)...\n     die(\"error, cannot allocate color '%s'\", clrname); /* Find this line */\n dest->pixel |= 0xff << 24; /* Add this line */\n```\n\n"
    }
  ]
}