{
  "title": "Alacritty (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Alacritty_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Alacritty Rust ile yazılmış, GPU hızlandırılmış uçbirim öyküncüsüdür. Geçmiş, 24-bit renk, kopyala/yapıştır, URL'lere tıklama ve özel tuş atamalarını destekler.\n\n"
    },
    {
      "title": "Kurulum",
      "level": 2,
      "content": "alacritty paketini kurun veya geliştirme sürümü için alacritty-gitAUR paketini kurun.\n\n"
    },
    {
      "title": "Yapılandırma",
      "level": 2,
      "content": "Alacritty yapılandırma dosyasını sırasıyla şu yerlerde arar:\n\n- $XDG_CONFIG_HOME/alacritty/alacritty.toml\n- $XDG_CONFIG_HOME/alacritty.toml\n- $HOME/.config/alacritty/alacritty.toml\n- $HOME/.alacritty.toml\n\n0.13.0 sürümünden önce YAML yapılandırma dosyası kullanılırdı. Eski YAML yapılandırma dosyaları alacritty migrate komutu ile TOML'e dönüştürülebilir. Ancak bu otomatik dönüştürme yorum satırlanının siler.\n\nAlacritty varsayılan olarak bir yapılandırma dosyası içermez. Yapılandırma seçenekleri projenin ana sayfasında bulunabilir. Eğer live_config_reload seçeneği etkin ise (varsayılandır) çoğu seçenek dosya kayıt edilir edilmez etkisini gösterir.\n\n"
    },
    {
      "title": "Renkler",
      "level": 3,
      "content": "Var olan renk şemalarına alacritty-theme deposundan bakabilirsiniz. İsteğiniz şema listede ise verilen kodu yapılandırma dosyanıza yapıştırınız.\n\n"
    },
    {
      "title": "Yazı tipi",
      "level": 3,
      "content": "Eğer sistemin varsayılan yazı tipini kullanmak istemiyorsanız bu satırları değiştirerek farklı bir yazı tipi kullanabilirsiniz:\n\n```\n[font]\nsize = 12.0\n\n[font.bold]\nfamily = \"monospace\"\nstyle = \"Bold\"\n\n[font.bold_italic]\nfamily = \"monospace\"\nstyle = \"Bold Italic\"\n\n[font.italic]\nfamily = \"monospace\"\nstyle = \"Italic\"\n\n[font.normal]\nfamily = \"monospace\"\nstyle = \"Regular\"\n```\n\nmonospace kısmını istediğiniz yazı tipi ile değiştirin.\n\nBazı fontların Italic yerine Oblique kullandığını unutmayın.\n\n"
    },
    {
      "title": "Aynı dizinde yeni pencere açmak",
      "level": 3,
      "content": "Ctrl+Shift+Enter tuşlarını basarak yeni bir Alacritty penceresi açmak için yapılandırma dosyanıza bu satırları ekleyin:\n\n```\n[keyboard]\nbindings = [\n   { key = \"Return\", mods = \"Control|Shift\", action = \"SpawnNewInstance\" }\n]\n```\n\n"
    },
    {
      "title": "Vi modu ve kopyala/yapıştır",
      "level": 3,
      "content": "Vi modu Alacritty'nin sanal görüntü alanınında klavye ile gezmenizi ve geriye bakabilmenizi sağlar. Varsayılan olarak Ctrl+Shift+Space ile açıp kapatabilirsiniz. Kopyalamak için fare ile seçip Ctrl+Shift+c'e basabilir veya Vi moduna girip v ile seçim başlatıp, vim'deki gibi hjkl ile hareket edip y ile seçimi kopyalayabilirsiniz. Yapıştırmak için Ctrl+Shift+v'e basınız. X'in panosundan kopyalayıp yapıştırmak için fare ile seçip orta fare tuşuyla yapıştırabilirsiniz.\n\n"
    },
    {
      "title": "İpuçları",
      "level": 3,
      "content": "Uçbirim ipuçları uçbirimin görünür kısmındaki hiperlinkleri veya metinleri bulmaınzı ve diğer uygulamalara vermenizi sağlar. Varsayılan olarak Alacritty Ctrl+Shift+O kısayolu ile URL ipuçları sunar ve xdg-open ile onları açar. Ek bilgi için Alacritty TOML yapılandırma el kitabının HINTS bölümüne bakabilirsiniz.\n\nÖrneğin, filename.rs:line:character dosya ipuçlarını (örn. my_crate/src/server.rs:181:49) tıklanabilir ve Visual Studio Code ile açılacak şekilde ayarlamak için Alacritty TOML yapılandırmasına şu bölüm eklenebilir:\n\n```\nalacritty.toml\n```\n\n```\n[[hints.enabled]]\nregex = \"[^ ]+\\\\.rs:\\\\d+:\\\\d+\"\ncommand = { program = \"code\", args = [ \"--goto\" ] }\nmouse = { enabled = true }\n```\n\nÇok sayıda [[hints.enabled]] bölümlerinden eklenerek çok sayıda regex tabanlı ipuçları eklenebilir.\n\n"
    },
    {
      "title": "Vim'de mouse düzgün çalışmıyor",
      "level": 3,
      "content": ".vimrc dosyanıza ttymouse=sgr ekleyin veya Neovim kullanın. Ayrıca bu soruna bakınız.\n\n"
    },
    {
      "title": "dwm'de saydam kenarlar",
      "level": 3,
      "content": "dwm'de Alacritty'nin kenarları saydam olur. Aşağıdaki satırı dwm kaynak klasöründe bulunan drw.c dosyasına ekleyip yeniden derlemek bu sorunu çözer:\n\n```\nif (!XftColorAllocName(...))\n    die(\"error, cannot allocate color '%s'\", clrname); /* Find this line */\ndest->pixel |= 0xff << 24; /* Add this line */\n```\n\n"
    },
    {
      "title": "Uzak kabuklarda uçbirim özellikleri mevcut değil",
      "level": 3,
      "content": "Alacritty uçbiriminde bir uzak sisteme bağlanıldığında, örneğin SSH üzerinden, sistemin terminfo veritabanında Alacritty için bir girişi olmaması olasıdır.(/usr/share/terminfo/a/alacritty*). Dolayısıyla bütün interaktif uç birim özellikleri çalışmaz. Bu Alacritty için olan terminfo'yu uzak sisteme termite#Terminal issues with SSH'de anlatıldığı gibi kopyalarak çözülebilir.\n\nYerel sistemde, Alacritty kullanarak:\n\n```\n$ infocmp > alacritty.terminfo  # export Alacritty's Terminfo\n$ scp alacritty.terminfo user@remote-host:~/  # or any other method to copy to the remote host\n```\n\nUzak sistemde, alacritty.terminfo'nun kopyalandığı klasörde:\n\n```\n$ tic -x alacritty.terminfo  # import Terminfo for current user\n$ rm alacritty.terminfo  # optional: remove Terminfo file\n```\n\nBu da yukarıdaki işlemin tek satırlık hali:\n\n```\n$ infocmp | ssh \"$user@$host\" 'tic -x /dev/stdin'\n```\n\nAlternatif olarak, TERM'in değerini varsayılan alacritty yerine xterm-256color'e ayarlayabilirsiniz.\n\n```\n[env]\nTERM = \"xterm-256color\"\n```\n\n"
    },
    {
      "title": "Wayland GNOME'da pencere başlık çubuğu kayıp",
      "level": 3,
      "content": "Wayland GNOME kullanırken pencere başlık çubuğu boş ve garip simgeler içerir. Ek bilgi için https://github.com/alacritty/alacritty/issues/4739 sayfasına bakınız.\n\nBuna bir çözüm WAYLAND_DISPLAY ortam değişkenini boşa ayarlayarak Alacritty'yi Wayland yerine Xwayland ile başlatmaktır.\n\n"
    }
  ]
}