{
  "title": "Alias (Español)",
  "url": "https://wiki.archlinux.org/title/Alias_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-15** \n\nArtículos relacionados\n\n- Bash/Funciones\n- Bash/Personalización del indicador\n- Variables de entorno\n- Readline\n- Fortune\n- Pkgfile\n- Intérprete de línea de órdenes\n\nBash (Bourne-again Shell) es un intérprete de línea de órdenes/lenguaje de programación por el proyecto GNU. Su nombre alude a su predecesor, el intérprete de línea de órdenes Bourne, que ha estado en desuso desde hace mucho tiempo. Bash se puede ejecutar en la mayoría de los sistemas operativos similares a UNIX, incluido GNU/Linux.\n\nBash es el intérprete de línea de órdenes predeterminado en Arch Linux.\n\n"
    },
    {
      "title": "Invocación",
      "level": 2,
      "content": "El comportamiento de Bash se puede alterar dependiendo de como se invoca. A continuación se describen distintos modos.\n\nSi Bash es iniciado por login en un TTY, por un demonio SSH, o por algo similar, se considera un intérprete de línea de órdenes de inicio de sesión. Este modo también se puede activar mediante la opción de línea de órdenes -l/--login.\n\nBash se considera un intérprete de línea de órdenes interactivo cuando su entrada estándar y de error están conectadas a un terminal (por ejemplo, cuando se ejecuta en un emulador de terminal), y no se inicia con la opción -c o con argumentos no opcionales (por ejemplo, bash script). Todos los intérpretes de línea de órdenes interactivos cargan /etc/bash.bashrc y ~/.bashrc, mientras que los intérpretes de línea de órdenes interactivos de inicio de sesion también cargan /etc/profile y { {ic|~/.bash_profile}}.\n\n"
    },
    {
      "title": "Archivos de configuración",
      "level": 3,
      "content": "Bash intentará ejecutar un conjunto de archivos de inicio dependiendo de cómo se invocó. Véase la sección Archivos de inicio de Bash del manual de GNU Bash para obtener una descripción completa.\n\nTable content:\nArchivo | Descripción | Intérprete de inicio de sesión (véase notas) | Intérprete interactivo sin inicio de sesión\n/etc/profile | Carga las configuraciones de la aplicación en /etc/profile.d/*.sh y /etc/bash.bashrc. | Sí | No\n~/.bash_profile | Por usuario, después de /etc/profile. Si este archivo no existe, ~/.bash_login y ~/.profile son comprobados en ese orden. El archivo de estructura /etc/skel/.bash_profile también carga ~/.bashrc. | Sí | No\n~/.bash_logout | Por usuario, después de salir de un intérprete de línea de órdenes de inicio de sesión. | Sí | No\n/etc/bash.bash_logout | Depende de la opción de compilación -DSYS_BASH_LOGOUT=\"/etc/bash.bash_logout\". Después de salir de un intérprete de línea de órdenes de inicio de sesión. | Sí | No\n/etc/bash.bashrc | Depende de la opción de compilación -DSYS_BASHRC=\"/etc/bash.bashrc\". Carga /usr/share/bash-completion/bash_completion. | No | Sí\n~/.bashrc | Por usuario, después de /etc/bash.bashrc. | No | Sí\n\nNote: **no** \n\n- Los intérpretes de línea de órdenes de inicio de sesión pueden ser no interactivos cuando se llaman con el argumento --login.\n- Mientras que los intérpretes de línea de órdenes interactivos que no son de inicio de sesión no cargan ~/.bash_profile, aún heredan el entorno de su proceso principal (que puede ser un intérprete de línea de órdenes de inicio de sesión). Véase sobre procesos, entornos y herencia para obtener más información.\n\n"
    },
    {
      "title": "Variables del intérprete de línea de órdenes y de entorno",
      "level": 3,
      "content": "El comportamiento de Bash y los programas ejecutados por él puede verse influido por una serie de variables de entorno. Las variables de entorno se utilizan para almacenar valores útiles, como los directorios de búsqueda de órdenes, o qué navegador utilizar. Cuando se inicia un nuevo intérprete de línea de órdenes o un script, hereda las variables de su padre (el proceso que lo lanza), por lo que comienza con un conjunto interno de variables del intérprete de línea de órdenes [1].\n\nEstas variables del intérprete de línea de órdenes en Bash se pueden exportar para convertirse en variables de entorno:\n\n```\nVARIABLE=contenido\nexport VARIABLE\n```\n\no con un atajo\n\n```\nexport VARIABLE=contenido\n```\n\nLas variables de entorno se colocan convencionalmente en ~/.profile o /etc/profile para que otras intérpretes de línea de órdenes compatibles con Bourne puedan utilizarlas.\n\nVéase Variables de entorno para más información en general.\n\n"
    },
    {
      "title": "Línea de órdenes",
      "level": 2,
      "content": "La línea de órdenes Bash es administrada por la biblioteca separada llamada Readline. Readline proporciona los estilos de accesos directos de emacs y vi para interactuar con la línea de órdenes, es decir, moverse hacia adelante y atrás en la base de palabras, eliminar palabras, etc. También es responsabilidad de Readline el administrar historial de órdenes de entrada. Por último, pero no menos importante, le permite crear macros.\n\n"
    },
    {
      "title": "Completar con tabulador",
      "level": 3,
      "content": "Completar con tabulador es la opción para completar automáticamente las órdenes escritas presionando Tabulador (habilitada de manera predeterminada).\n\nNote: **(del traductor):** \n\n"
    },
    {
      "title": "Pulsación única del tabulador",
      "level": 4,
      "content": "Puede requerirse hasta tres pulsaciones de tabulador para mostrar todas las terminaciones posibles para una orden. Para reducir el número necesario de pulsaciones de tabulador, véase Readline (Español)#Completado más rápido.\n\n"
    },
    {
      "title": "Órdenes comunes y opciones",
      "level": 4,
      "content": "De forma predeterminada, Bash solo completa con tabulador órdenes, nombres de archivo y variables. El paquete bash-completion lo extiende añadiendo opciones de completado más especializadas para las órdenes comunes y sus opciones, que se pueden habilitar mediante la obtención de /usr/share/bash-completion/bash_completion (que ya se obtuvo en /etc/bash.bashrc de Arch). Con bash-completion, las opciones de completado normales (tales como $ ls file.*<tab><tab>) se comportarán de manera distinta; sin embargo, se pueden volver a habilitar con $ compopt -o bashdefault programa (véase [2] y [3] para más detalles).\n\n"
    },
    {
      "title": "Personalizar por órdenes",
      "level": 4,
      "content": "De forma predeterminada, Bash solo completa los nombres de archivo que siguen a una orden. Puede cambiarlo para completar los nombres de las órdenes utilizando complete -c:\n\n```\n~/.bashrc\n```\n\n```\ncomplete -c man which\n```\n\no completar los nombres de las órdenes y los nombres de archivos con -cf:\n\n```\ncomplete -cf sudo\n```\n\nVéase la página del manual de Bash para más opciones de completado.\n\n"
    },
    {
      "title": "Completado del historial",
      "level": 4,
      "content": "Puede enlazar las teclas de flecha arriba y abajo para buscar en el historial de Bash (véase: Readline (Español)#Historial y Sintaxis del archivo Init de Readline):\n\n```\n~/.bashrc\n```\n\n```\nbind '\"\\e[A\": history-search-backward'\n bind '\"\\e[B\": history-search-forward'\n```\n\no que afecte a todos los programas de readline:\n\n```\n~/.inputrc\n```\n\n```\n\"\\e[A\": history-search-backward\n\"\\e[B\": history-search-forward\n```\n\n"
    },
    {
      "title": "Historial más corto",
      "level": 4,
      "content": "La variable HISTCONTROL puede evitar que ciertas órdenes se registren en el historial. Por ejemplo, para detener el registro de órdenes idénticas y repetidas\n\n```\n~/.bashrc\n```\n\n```\nexport HISTCONTROL=ignoredups\n```\n\no configúrelo en erasedups para asegurarse de que el historial de Bash solo contenga una copia de cada orden (independientemente de su ordenación). Véase la página del manual de Bash para más opciones.\n\n"
    },
    {
      "title": "Desactivar historial",
      "level": 4,
      "content": "Para desactivar el historial de bash solo temporalmente:\n\n```\n$ set +o history\n```\n\nLas órdenes introducidas ​​ahora no se registrarán en $HISTFILE.\n\nPor ejemplo, ahora puede convertir en hash contraseñas mediante printf secret | sha256sum, u oculta la utilización de GPG como gpg -eaF secret-pubkey.asc y su secreto no se escribirá en el disco.\n\nPara activar el historial:\n\n```\n$ set -o history\n```\n\nPara desactivar todo el historial de bash:\n\n```\n~/.bashrc or /etc/profile\n```\n\n```\nexport HISTSIZE=0\n```\n\n... y sólo para asegurarse, destruya su antiguo archivo de historial para siempre:\n\n```\n$ wipe -i -l2 -x4 -p4 \"$HISTFILE\"\n $ ln -sv /dev/null \"$HISTFILE\"\n```\n\n"
    },
    {
      "title": "Imitación de la capacidad de ejecutar la ayuda como Zsh",
      "level": 3,
      "content": "Zsh puede invocar el manual para la orden que precede al cursor presionando Alt+h. Un comportamiento similar se obtiene en Bash utilizando este enlace Readline:\n\n```\n~/.bashrc\n```\n\n```\nrun-help() { help \"$READLINE_LINE\" 2>/dev/null || man \"$READLINE_LINE\"; }\nbind -m vi-insert -x '\"\\eh\": run-help'\nbind -m emacs -x     '\"\\eh\": run-help'\n```\n\nEsto asume que está utilizando el (predeterminado) modo de edición Emacs.\n\n"
    },
    {
      "title": "Alias",
      "level": 2,
      "content": "alias es una orden que permite reemplazar una palabra con otra cadena. A menudo se usa para abreviar una orden del sistema o para añadir argumentos predeterminados a una orden que se utiliza regularmente.\n\nLos alias personales se almacenan preferiblemente en ~/.bashrc, y los alias de todo el sistema (que afectan a todos los usuarios) pertenecen a /etc/bash.bashrc. Véase [4] para obtener ejemplos de alias.\n\nPara las funciones, véase Bash/Funciones.\n\n"
    },
    {
      "title": "Personalización del indicador",
      "level": 3,
      "content": "Véase Bach/Personalización del indicador.\n\n"
    },
    {
      "title": "No se encontró la orden",
      "level": 3,
      "content": "pkgfile incluye un hook de \"No se encontró la orden\" que buscará automáticamente en los repositorios oficiales, al ingresar una orden no reconocida.\n\nNecesita cargar el hook para activarlo, por ejemplo:\n\n```\n~/.bashrc\n```\n\n```\nsource /usr/share/doc/pkgfile/command-not-found.bash\n```\n\nLuego, cuando intente ejecutar una orden que no esté disponible se mostrará la siguiente información:\n\n```\n$ abiword\n```\n\n```\nabiword may be found in the following packages:\n  extra/abiword 3.0.1-2\t/usr/bin/abiword\n```\n\n"
    },
    {
      "title": "Desactivar Control+z en el terminal",
      "level": 3,
      "content": "Puede desactivar la función Control+z (detiene/cierra su aplicación) envolviendo su orden de la siguiente forma:\n\n```\n#!/bin/bash\ntrap \"\" 20\nadom\n```\n\nAhora, cuando presione accidentalmente Control+z en adomAUR en lugar de Mayúsculas+z no pasará nada porque se ignorará Control+z.\n\n"
    },
    {
      "title": "Borrar la pantalla después de cerrar la sesión",
      "level": 3,
      "content": "Para borrar la pantalla después de cerrar la sesión en un terminal virtual:\n\n```\n~/.bash_logout\n```\n\n```\nclear\nreset\n```\n\n"
    },
    {
      "title": "Auto \"cd\" al introducir solo una ruta",
      "level": 3,
      "content": "Bash puede añadir automáticamente cd al introducir solo una ruta en el intérprete de línea de órdenes. Por ejemplo:\n\n```\n$ /etc\n```\n\n```\nbash: /etc: Es un directorio\n```\n\nPero después de añadir una línea al archivo .bashrc:\n\n```\n~/.bashrc\n```\n\n```\n...\nshopt -s autocd\n...\n```\n\nObtiene:\n\n```\n[user@host ~]$ /etc\ncd /etc\n[user@host etc]$\n```\n\n"
    },
    {
      "title": "Autojump",
      "level": 3,
      "content": "autojump-gitAUR permite navegar por el sistema de archivos buscando cadenas en una base de datos con las rutas más visitadas del usuario.\n\nDespués de la instalación, /etc/profile.d/autojump.bash debe ser cargado para comenzar a utilizar la aplicación.\n\n"
    },
    {
      "title": "Impedir la sobreescritura de archivos",
      "level": 3,
      "content": "Para la sesión actual, para no permitir que los archivos regulares existentes se sobrescriban mediante la redirección de la salida del intérprete de línea de órdenes:\n\n```\n$ set -o noclobber\n```\n\nEsto es idéntico a set -C.\n\nPara hacer los cambios persistentes para su usuario:\n\n```\n~/.bashrc\n```\n\n```\n...\nset -o noclobber\n```\n\nPara sobrescribir manualmente un archivo mientras noclobber está establecido:\n\n```\n$ echo \"output\" >| file.txt\n```\n\n"
    },
    {
      "title": "Ajuste de línea al redimensionar la ventana",
      "level": 3,
      "content": "Al redimensionar un emulador de terminal, Bash puede no recibir la señal de redimensionamiento. Esto hará que el texto escrito no se ajuste correctamente y se superponga en el indicador. La opción checkwinsize del intérprete de línea de órdenes comprueba el tamaño de la ventana después de cada orden y, si es necesario, actualiza los valores de LÍNEAS y COLUMNAS.\n\n```\n~/.bashrc\n```\n\n```\nshopt -s checkwinsize\n```\n\n"
    },
    {
      "title": "Intérprete de línea de órdenes sale incluso si ignoreeof está definido",
      "level": 3,
      "content": "Si ha configurado la opción ignoreeof y se encuentra que al presionar repetidamente ctrl-d hace que se cierre el intérprete de línea de órdenes, es porque esta opción solo permite 10 invocaciones consecutivas de esta combinación de teclas (o 10 caracteres EOF consecutivos, para ser precisos), antes de salir del intérprete de línea de órdenes.\n\nPara permitir valores más altos, tiene que utilizar la variable IGNOREEOF.\n\nPor ejemplo:\n\n```\nexport IGNOREEOF=100\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Wikipedia:es:Bash\n- Manual de referencia de Bash, o /usr/share/doc/bash/bashref.html\n- Sintaxis del archivo Init de Readline\n- El intérprete de línea de órdenes Bourne-Again - El capitulo tercero de La arquitectura de las aplicaciones de código abierto\n- Shellcheck - Compruebe los scripts de bash en busca de errores comunes (basado en shellcheck)\n- PS1 generator - genera su indicador de bash en .bashrc/PS1 con una interfaz de arrastrar y soltar\n- Órdenes aún más útiles en .bashrc\n\n"
    },
    {
      "title": "Tutoriales",
      "level": 3,
      "content": "- Wiki de Greg\n- GregsWiki:BashGuide\n- GregsWiki:BashFAQ\n- Quote Tutorial\n\n"
    },
    {
      "title": "Comunidad",
      "level": 3,
      "content": "- Un canal de IRC activo y amistoso para Bash\n\n"
    },
    {
      "title": "Ejemplos",
      "level": 3,
      "content": "- Cómo cambiar el título de un xterm\n\n"
    }
  ]
}