{
  "title": "Amarok (Español)",
  "url": "https://wiki.archlinux.org/title/Amarok_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-04-10** \n\nAmarok es un reproductor y organizador de música para Linux con una interfaz Qt intuitiva que se integra muy bien con KDE.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete amarokAUR.\n\nAmarok depende ahora de Phonon, así que tendrá que tener un back-end seleccionado para ello. Vea KDE (Español)#Phonon. Podría necesitar instalar unos pocos códecs para uso del back-end seleccionado.\n\n"
    },
    {
      "title": "Integración con GNOME",
      "level": 3,
      "content": "Vea Vista uniforme para aplicaciones Qt y GTK para la integración visual de la GUI principal.\n\n"
    },
    {
      "title": "Scripts y applets",
      "level": 3,
      "content": "Los nuevos scripts y applets pueden ser encontrados ya sea directo de Amarok (Herramientas > Manejador de Script > Obtener más Scripts) o en store.kde.org.\n\n"
    },
    {
      "title": "Barra de estado anímico",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nLa barra de estado anímico es una característica que cambia la barra desplazamiento de progreso estándar en una barra de desplazamiento de progreso de colores dependiendo del esatado de ánimo de la canción.\n\nInstale moodbarAUR desde AUR.\n\nDespués vaya a Configuración > Configure Amarok y seleccione \"Muestre moodbar en la barra de progreso\".\n\nDesde 2010 Amarok 2 no genera moodfiles, puede ya sea intentar seguir éste tutorial para crear los propios u obtener Amarok1 de AUR y dejar que genere todos los archivos .mood por usted. Para la solución de Amarok1 vaya a Ajustes > Configurar Amarok, y en la pestaña general seleccione las casillas \"use moods\" y \"almacene archivos de datos moods con música\".\n\n"
    },
    {
      "title": "SHOUTcast",
      "level": 2,
      "content": "Para obtener SHOUTcast use el script \"servicio SHOUTcast\". Inicie Amarok, vaya a Herramientas > Administrador de Script > Obtener Más Scripts, busque SHOUTcast instalar Servicio SHOUTcast, reinicie Amarok. Así ya lo tiene en contexto \"Internet\".\n\nVéase también: ¿Cómo puedo usar Amarok para transmitir mi propia estación de radio?, el cual recomienda Internet DJ Console, disponible en AUR (idjcAUR).\n\n"
    },
    {
      "title": "Transmisión Ampache/MP3",
      "level": 2,
      "content": "Si está transmitiendo MP3s directamente o con el plugin Ampache, no será capaz de buscar en pistas si no está usando e backend GStreamer. Instale los paquetes necesarios: phonon-qt4-gstreamerAUR phonon-qt5-gstreamer gst-libav. Después vaya a Amarok en Ajustes > Configurar Amarok > Playback > Configurar Phonon > tab Backend. Aquí haga GStreamer el backend preferido.\n\n"
    },
    {
      "title": "Base de Datos de la colección",
      "level": 2,
      "content": "Amarok 2.x puede usar Sqlite (default) o MySQL para almacenar la base de datos de colección. Los usuarios con colecciones grandes y con requerimentos de desempeño más demandantes podrían preferir usar MySQL.\n\n"
    },
    {
      "title": "MySQL",
      "level": 3,
      "content": "Para una configuración básica de MySQL refiera a la página MariaDB.\n\nCuando use Amarok con MySQL necesita crear un usuario MySQL que pueda accesar la base de datos. Para hacer uso, ingrese lo siguiente:\n\n```\n# mysql -p -u root\n# CREATE DATABASE amarokdb;\n# USE amarokdb;\n# GRANT ALL ON amarokdb.* TO amarokuser@localhost IDENTIFIED BY 'password-user';\n# FLUSH PRIVILEGES;\n# quit\n```\n\nEsto crea una base de datos llamada 'amarokdb' y un usuario de nombre 'amarokuser' con contraseña 'password-user' quien puede acceder a dicha base de datos desde localhost. Si desea conectarse a la base de datos de su computadora desde una computadora diferente, cambie la línea a\n\n```\n# GRANT ALL ON amarok.* TO amarokuser@'%' IDENTIFIED BY  'password-user';\n```\n\nPara configurar amarok para que use MySQL, entre a la pantalla Congfigurar Amarok, escoja Base de Datos y marque \"use base de datos MySQL externa\". Entre al servidor (usualmente \"localhost\" si está local, en caso contrario el box remoto), el nombre de usuario (\"amarokuser\" en éste ejemplo) y la contraseña de usuario escojida. No olvide seleccionar la ruta de su colección de música.\n\n"
    },
    {
      "title": "Reproducción de CD de Audio",
      "level": 2,
      "content": "Si no está usando KDE como su Entorno de Escritorio, Amarok podría no tener las utilidades que necesita para reproducir CDs de Audio. Instale audiocd-kio para obtener ésta funcionalidad.\n\n"
    },
    {
      "title": "Firefly/Daap share",
      "level": 2,
      "content": "Para hacer visible Daap shares en Amarok habilite el plugin \"DAAP Collection\" en los ajustes de Amarok.\n\nInstale nss-mdns y complete la línea de hosts en /etc/nsswitch.conf para que se vea:\n\n```\nhosts: files mdns4_minimal [NOTFOUND=return] nis dns mdns4\n```\n\nInicie el servicio systemd avahi-daemon.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "List of applications (Español)/Multimedia (Español)#Reproductores de audio\n\n"
    }
  ]
}