{
  "title": "Amarok (Français)",
  "url": "https://wiki.archlinux.org/title/Amarok_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Amarok est un lecteur et organisateur de musique pour Linux avec une interface Qt intuitive qui s'intègre très bien à KDE.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet amarokAUR.\n\nAmarok dépend maintenant de Phonon, vous devrez donc avoir un back-end fonctionnel sélectionné pour lui. Consultez KDE#Phonon. Vous pouvez également avoir besoin d'installer quelques codecs pour l'utilisation du back-end choisi.\n\n"
    },
    {
      "title": "Intégration avec GNOME",
      "level": 3,
      "content": "Consultez Uniform look for Qt and GTK applications pour l'intégration visuelle de l'interface graphique principale.\n\n"
    },
    {
      "title": "Scripts et applets",
      "level": 3,
      "content": "Les nouveaux scripts et applets peuvent être trouvés directement dans Amarok (Outils > Gestionnaire de scripts > Obtenir plus de scripts) ou sur store.kde.org.\n\n"
    },
    {
      "title": "Moodbar",
      "level": 3,
      "content": "La «moodbar» est une fonctionnalité qui transforme votre barre de progression standard en une barre de progression colorée en fonction de l'humeur de votre morceau.\n\nInstallez moodbarAUR.\n\nPuis allez dans Paramètres > Configurer Amarok et cochez \"Afficher la barre d'humeur dans le curseur de progression\".\n\nComme Amarok 2 ne génère pas de fichiers d'ambiance, vous pouvez suivre ce tutoriel pour les créer vous-même.\n\n"
    },
    {
      "title": "SHOUTcast",
      "level": 2,
      "content": "Pour obtenir SHOUTcast, utilisez le script \"SHOUTcast service\". Démarrez Amarok, allez dans Outils > Gestionnaire de scripts > Obtenir plus de scripts, cherchez SHOUTcast, installez Shoutcast Service, redémarrez Amarok. Ensuite vous l'avez dans le contexte \"Internet\".\n\nConsultez aussi : How can I use Amarok to stream to my own radio station ?, qui recommande Internet DJ Console, disponible dans l'AUR (idjcAUR).\n\n"
    },
    {
      "title": "Streaming Ampache/MP3",
      "level": 2,
      "content": "Si vous diffusez des MP3 directement ou avec le plugin Ampache, vous ne pouvez pas rechercher les pistes si vous n'utilisez pas le backend GStreamer. Installez les paquets nécessaires : phonon-qt4-gstreamerAUR phonon-qt5-gstreamer gst-libav. Puis allez dans Amarok dans Settings > Configure Amarok > Playback > Configure Phonon > onglet Backend. Ici, faites de GStreamer le backend préféré\n\n"
    },
    {
      "title": "Base de données de collection",
      "level": 2,
      "content": "Amarok 2.x peut utiliser Sqlite (par défaut) ou MySQL pour stocker la base de données de la collection. Les utilisateurs avec de grandes collections et des exigences de performance plus élevées peuvent préférer utiliser MySQL.\n\n"
    },
    {
      "title": "MySQL",
      "level": 3,
      "content": "Pour la configuration de base de MySQL, reportez-vous à la page MariaDB.\n\nLorsque vous utilisez Amarok avec MySQL, vous devez créer un utilisateur MySQL qui peut accéder à la base de données. Pour ce faire, entrez ce qui suit :\n\n```\n# mysql -p -u root\n# CREATE DATABASE amarokdb;\n# USE amarokdb;\n# GRANT ALL ON amarokdb.* TO amarokuser@localhost IDENTIFIED BY 'password-user';\n# FLUSH PRIVILEGES;\n# quit\n```\n\nCeci crée une base de données appelée 'amarokdb' et un utilisateur avec le nom 'amarokuser' avec le mot de passe 'password-user' qui peut accéder à cette base de données depuis localhost. Si vous voulez vous connecter à votre base de données depuis un autre ordinateur, changez la ligne en\n\n```\n# GRANT ALL ON amarok.* TO amarokuser@'%' IDENTIFIED BY  'password-user';\n```\n\nPour configurer Amarok afin d'utiliser MySQL, entrez dans l'écran Configurer Amarok, choisissez Base de données et cochez \"utiliser une base de données MySQL externe\". Entrez le serveur (généralement \"localhost\" si vous êtes sur votre machine locale, sinon le nom de la machine distante), le nom d'utilisateur (\"amarokuser\" dans cet exemple) et votre mot de passe utilisateur. N'oubliez pas de sélectionner le chemin d'accès à votre collection de musique.\n\n"
    },
    {
      "title": "Lecture de CD audio",
      "level": 2,
      "content": "Si vous n'utilisez pas KDE comme environnement de bureau, Amarok peut ne pas disposer des utilitaires nécessaires à la lecture de CD audio. Installez audiocd-kio pour obtenir cette fonctionnalité.\n\n"
    },
    {
      "title": "Partage Firefly/Daap",
      "level": 2,
      "content": "Pour rendre les partages Daap visibles dans Amarok, activez le plugin \"DAAP Collection\" dans les paramètres d'Amarok.\n\nInstallez nss-mdns et complétez la ligne hosts dans /etc/nsswitch.conf pour qu'elle ressemble à ceci :\n\n```\nhosts : files mdns4_minimal [NOTFOUND=return] nis dns mdns4\n```\n\nDémarrez le service avahi-daemon.service.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "List of applications/Multimedia#Audio players\n\n"
    }
  ]
}