{
  "title": "Amateur Radio (日本語)",
  "url": "https://wiki.archlinux.org/title/Amateur_Radio_(%E6%97%A5%E6%9C%AC%E8%AA%9E)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "関連記事\n\n- GNU Radio\n- RTL-SDR\n\nアマチュア無線ファン (ハム無線従事者または\"ハム\"とも) は無線通信の黎明期から実験と発展の最前線を担ってきました。電磁スペクトルの広範囲の周波数で、多種多様な通信方式が使われています。このページでは AUR に入っているアマチュア無線関連のソフトウェアをリストアップしています。単独で動作するソフトウェアもあれば、無線機の接続を必要とするデジタル通信アプリケーションもありますし、中にはコンピュータのサウンドカードを使えるものもあり様々です。インターフェイスとなるハードウェアはメーカーから購入することも、または自作することもできます。\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 一般情報\n- 2 ソフトウェアリスト 2.1 AX.25 2.2 WSJT 2.3 WSPR 2.4 Xastir 2.5 デジタルボイス 2.6 解析ツール 2.7 ロギング 2.8 ツール 2.9 モールス信号の練習 2.10 その他\n\n- 2.1 AX.25\n- 2.2 WSJT\n- 2.3 WSPR\n- 2.4 Xastir\n- 2.5 デジタルボイス\n- 2.6 解析ツール\n- 2.7 ロギング\n- 2.8 ツール\n- 2.9 モールス信号の練習\n- 2.10 その他\n\n"
    },
    {
      "title": "一般情報",
      "level": 2,
      "content": "以下のプログラムの多くは送信機の周波数をあわせるのにシリアルポートへのアクセスを必要とします (例: /dev/ttyS0)。そのため、ユーザーを uucp グループに追加しなくてはなりません。ユーザーを uucp グループに追加するには root で次のコマンドを実行します:\n\n```\n# gpasswd -a username uucp\n```\n\nそれから一度ログオフして、ログインしなおしてください。\n\n"
    },
    {
      "title": "ソフトウェアリスト",
      "level": 2,
      "content": "- Hamlib — ハードウェアと無線制御プログラム間のインターフェイスを提供します。無線のコントロールや他のハードウェア (ロギングやデジタルモードなど) を使いやすくするためのソフトウェアレイヤーでありスタンドアロンのアプリケーションではありません。\n\n- Soundmodem — 標準的な PC サウンドカードを様々な AX.25 通信モードが利用できるパケット通信モデムのように使えるように Tom Sailer (HB9JNX/AE4WA) によって書かれました。ハードウェアやアプリケーションによりますがデータレートは9600ボーまで高くできます。Soundmodem はシリアルポートの KISS モデムまたは AX.25 ネットワークデバイスとして使うことが可能です。soundmodem を MKISS ネットワークデバイスとして使うには、MKISS モジュールを組み込んでカーネルをリビルドする必要があります。詳しくは Xastir wiki を見て下さい。\n\n```\n# soundmodem\n```\n\n```\n# chmod 666 /dev/soundmodem0\n```\n\n- Grig — Hamlib ベースのシンプルな制御プログラム\n\n- gMFSK — 多数のデジタルモードをサポートするユーザーインターフェイス。ロギングに hamlib と xlog を使います。\n\n- lysdr — 細かいカスタマイズができる無線インターフェイス\n\n- linrad — SM5BSZ によるソフトウェア無線\n\n- quisk — N2ADR によるソフトウェア無線\n\n- owx — Wouxun 無線機をプログラミングするためのコマンドラインユーティリティ\n\n- fldigi — W1HKJ によって開発された様々なデジタル通信モードが使える人気の GUI\n\n- libfap — APRS パケットパーサー\n\n- aprx — 軽量な APRS デジピーターと i-Gate インターフェイス\n\n- xdx — ネットワーククライアント\n\n- qsstv — 低速度走査テレビジョン\n\n- linpsk — PSK31\n\n- psk31lx — PSK31 で PulseAudio を使用\n\n- twpsk — サウンドカードを用いる PSK31 プログラム\n\n- xpsk31 — PSK31 で GTK+ による GUI を使用\n\n"
    },
    {
      "title": "AX.25",
      "level": 3,
      "content": "AX.25 — パケット通信ネットワークで広く使われているデータリンク層プロトコル。コネクション型 (例: キーボードからキーボードへの通信, 電子掲示板へのアクセス, DX クラスタ) とコネクションレス型 (例: APRS) の両方が使えます。Linux カーネルは AX.25 ネットワークをネイティブでサポートしています。詳しくは こちらのガイド を参照。以下のソフトウェアが AUR でインストールできます:\n\n- ax25-appsAUR\n- ax25-toolsAUR\n- libax25AUR\n- nodeAUR\n\n"
    },
    {
      "title": "WSJT",
      "level": 3,
      "content": "WSJT (Weak Signal Communication by K1JT) — 流星散乱, 電離層散乱, VHF/UHF 帯のEME (月面反射通信), HF 帯の空間波伝播などに最適なプロトコルなどの機能を提供します。WSJT はノーベル物理学賞を受賞したジョゼフ・テイラー (コールサインは K1JT) によって開発されました。流星によって発生した電離電子による一瞬の電波信号の反射をデコードすることができ、最小可聴値以下の 10 dB の信号を解読できます。WSJT は K1JT によって率いられているプログラマーチームによって活発に開発されています。WSJT (と関連プログラムの WSPR) を configure するときは $ ./configure --enable-g95 と $ ./configure --enable-gfortran のどちらかを選べます。どちらかで問題が発生する場合、PKGBUILD を編集してもう片方の configure を使ってみてください。WSJT はシリアルポートへのアクセス権限を必要とします。上記の一般情報セクションを見てください。\n\n"
    },
    {
      "title": "WSPR",
      "level": 3,
      "content": "WSPR (Weak Signal Propagation Reporter, pronounced whisper) — enables the probing of propagation paths on the amateur radio bands using low power transmissions. It was introduced in 2008 by K1JT following the success and widespread adoption of WSJT by the amateur radio community. Stations with Internet access can automatically upload their reception reports to a central database called WSPRnet, which includes a mapping facility\n\n"
    },
    {
      "title": "Xastir",
      "level": 3,
      "content": "Xastir — X Amateur Station and Information Reporting の略。アマチュア無線によるリアルタイムの位置情報デジタル通信システムである APRS で使用します。Xastir は APRS のフル機能のクライアントとして使うことができるオープンソースプログラムです。現在は開発途上です。高い柔軟性を持っており様々な方法で設定ができます。例えば、インターネット接続が可能であれば無線機器がなくても評価することができます。xastir.org の wiki には機能と設定について豊富な情報が揃っています。festival パッケージをインストールすることで発音機能を利用できます。festival-en や festival-english などの音声パッケージが必要です。使用するときは xastir をビルドする前に festival をインストールしてください。xastir プログラムを起動する前に festival を起動することで発声機能が正しく機能します: $ festival --server。もしくはスクリプトを書いて起動を自動化することもできます。メディアプレイヤーなど他のプログラムで同時にサウンドにアクセスすると問題が発声します。PKGBUILD は自動的に 850 kB の .wav ファイルをダウンロードして次のディレクトリに配置します: /usr/share/xastir/sounds/。festival を必要としない北アメリカの英語話者による音声アラームの録音があります。設定メニューの音声再生コマンド `play' は機能しない場合があります。代わりに `aplay' を試してみてください。\n\n"
    },
    {
      "title": "デジタルボイス",
      "level": 3,
      "content": "FreeDV — HF 無線用のデジタルボイスモードです。フリーでオープンな Codec2 音声コーデックを使って、短波無線通信にうってつけの効率的なナローバンド・低ビットレートの音声通信を実現します。FreeDV モードを使い始めるのに必要なのは FreeDV の GUI アプリケーションを動かしているコンピュータに SSB 無線機を接続することだけです。FreeDV と Codec2 はどちらも Arch Linux では AUR からインストールできます。FreeDV を使うには両方が必要です。\n\n"
    },
    {
      "title": "解析ツール",
      "level": 3,
      "content": "- gpredictAUR – リアルタイムの衛生追跡・軌道予測アプリケーション\n- hamsolarAUR – Small desktop display of the current solar indices\n- splatAUR – rf signal propagation, loss, and terrain analysis\n- sunclockAUR – Useful for predicting grayline propagation paths\n- xnec2cAUR – 電磁アンテナモデラー\n\n"
    },
    {
      "title": "ロギング",
      "level": 3,
      "content": "- cqrlog-binAUR – 人気の Linux ロギングプログラム\n- fdlogAUR – a Field Day Logger with networked nodes\n- klogAUR – Linux / KDE 向けのアマチュア無線ロギングプログラム\n- qleAUR – QSO Logger and log Editor for amateur radio operators written in Perl\n- tlfAUR – a console mode networked logging and contest program\n- trustedqslAUR – QSL application for ARRL's Logbook of the World\n- xlogAUR – アマチュア無線家のためのロギングプログラム。\n- yfklogAUR – *nix オペレーティングシステム用の汎用アマチュア無線ログブック。\n- yfktestAUR – ハム無線コンテスト用のログブックプログラム。\n\n"
    },
    {
      "title": "ツール",
      "level": 3,
      "content": "- ctyAUR – package contains databases of entities (countries), prefixes and callsigns that are used by amateur radio logging software.\n- dxccAUR – ハム無線のコールサインの ARRL DXCC エンティティを確認する小さなプログラム\n\n"
    },
    {
      "title": "モールス信号の練習",
      "level": 3,
      "content": "- aldoAUR\n- cutecwAUR\n- ebook2cwAUR\n- gtkmmorseAUR\n- kochmorseAUR\n- qrqAUR\n- unixcwAUR\n\n"
    },
    {
      "title": "その他",
      "level": 3,
      "content": "- cwircAUR – IRC でモールス信号を送信・受信\n\n"
    }
  ]
}