{
  "title": "Anything-sync-daemon (Русский)",
  "url": "https://wiki.archlinux.org/title/Anything-sync-daemon_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Profile-sync-daemon (Русский)\n\nanything-sync-daemon (asd) — небольшой псевдо-демон, предназначенный для переноса указанных пользователем каталогов (которые здесь и далее называются целями синхронизации) в tmpfs (ОЗУ) и их периодической синхронизации с постоянным хранилищем (HDD/SSD). Это достигается с помощью bind-монтирования и использования rsync для поддержания синхронизации между копией в tmpfs и резервными копиями в постоянном хранилище. Кроме того, в asd реализованы некоторые функции восстановления после сбоев.\n\nЦели и преимущества asd:\n\n1. Простота в использовании\n1. Уменьшение износа физических дисков\n1. Улучшение скорости работы\n\nЦели синхронизации переносятся с помощью asd в tmpfs (ОЗУ), соответственно связанные с ними операции ввода-вывода перенаправляются в оперативную память. Таким образом, уменьшается износ физического диска, повышается отказоустойчивость и скорость работы: время доступа к оперативной памяти составляет порядка наносекунд, в то время как время доступа к обычному жёсткому диску примерно в 1,000,000 раз выше и составляет порядка миллисекунд.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет anything-sync-daemon.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Настройка asd выполняется через файл /etc/asd.conf, который предоставляется пакетом.\n\n- Как минимум, определите цели синхронизации, которыми будет управлять asd, в массиве WHATTOSYNC. Синтаксис приведён ниже.\n- Опционально раскомментируйте и укажите расположение tmpfs в переменной VOLATILE.\n- Опционально включите использование overlayfs для улучшения скорости синхронизации и уменьшения количества необходимой памяти. Обратите внимание, что эта опция требует, чтобы ваше ядро было настроено на использование модуля ядра 'overlay'. Смотрите раздел #Режим overlayfs ниже, чтобы узнать подробности.\n\nПример:\n\n```\nWHATTOSYNC=('/var/lib/monitorix' '/srv/http' '/foo/bar')\n```\n\nили\n\n```\nWHATTOSYNC=(\n'/var/lib/monitorix'\n'/srv/http'\n'/foo/bar'\n)\n```\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Запустите/включите службу asd.service. Также есть systemd-таймер, который запускает копирование данных из памяти на диск каждый час. Таймер запускается автоматически вместе со службой asd.service, так что запускать его вручную не нужно.\n\n"
    },
    {
      "title": "Проверка конфигурации",
      "level": 3,
      "content": "Команда asd parse покажет, что именно asd будет делать, основываясь на конфигурации в /etc/asd.conf, а также выведет прочую полезную информацию.\n\n"
    },
    {
      "title": "Установка частоты синхронизации",
      "level": 3,
      "content": "По умолчанию таймер настроен на синхронизацию с интервалом в один час. Пользователь может легко установить другой желаемый интервал, отредактировав файл юнита. В примере ниже создаётся drop-in файл, в котором таймер установлен на синхронизацию с интервалом в 10 минут (строка с пустым значением OnUnitActiveSec используется для удаления старого значения перед добавлением нового [1]):\n\n```\n/etc/systemd/system/asd-resync.timer.d/frequency.conf\n```\n\n```\n[Unit]\nDescription=Timer for Anything-sync-daemon - 10min\n\n[Timer]\nOnUnitActiveSec=\nOnUnitActiveSec=10min\n```\n\nСмотрите systemd.timer(5) для получения дополнительной информации о настройке таймеров.\n\n"
    },
    {
      "title": "Режим overlayfs",
      "level": 3,
      "content": "Overlayfs — это простая файловая система, которая доступна в ядре Linux с версии 3.18.0. Начиная с версии 5.54, asd может использовать overlayfs, чтобы уменьшить потребление памяти в tmpfs и ускорить операции синхронизации с диском. Особенность метода в том, что overlayfs записывает только изменённые данные, а не цель синхронизации целиком. Те же функции восстановления, которые использует asd в своём режиме по умолчанию, также активны при работе в режиме overlayfs. Чтобы включить режим overlayfs, раскомментируйте строку USE_OVERLAYFS=\"yes\" в файле /etc/asd.conf и затем перезапустите демон.\n\n"
    },
    {
      "title": "Снимки",
      "level": 3,
      "content": "Если случился сбой системы — скорее всего, \"последняя целая\" резервная копия целей синхронизации всё ещё в сохранности в файловой системе. При перезапуске asd (например, при перезагрузке системы) он выполняет проверку своего состояния. Если есть какие-то проблемы, asd создаст снимок \"последней целой\" резервной копии, прежде чем вернуть её на место. Обратите внимание, что, поскольку asd пытается уменьшить использование диска, он никогда не \"копирует\" содержимое каталога полностью, а просто использует жёсткие ссылки на предыдущие файлы. А во время шага rsync он создаёт новые файлы так, что предыдущие жёсткие ссылки остаются нетронутыми. Поэтому попытка изменить каталог в то время, когда asd пытается выполнить резервное копирование, может оставить каталог в повреждённом состоянии.\n\nНайти снимок можно в том же каталоге, что и цель синхронизации, и он будет содержать отметку даты и времени, которая соответствует времени, когда был сделан снимок. Например, для цели синхронизации /foo/bar это будет /foo/.bar-backup_asd-crashrecovery-20141221_070112.tar.zstd — конечно, отметка времени у вас будет своя.\n\nЧтобы восстановить данные из снимка:\n\n- Остановите службу asd.service.\n- Убедитесь, что нет каталогов, которые создаёт asd. Если есть, значит asd не был завершён корректно по другим причинам.\n- Переместите \"плохую\" копию цели синхронизации куда-нибудь (не удаляйте ничего просто так).\n- Распакуйте архив снимка в нужное место.\n\nПример для /foo/bar:\n\n```\n$ cd /foo\n$ mv bar bar-bad\n$ tar -xvf .bar-backup_asd-crashrecovery-20141221_070112.tar.zstd\n```\n\n"
    },
    {
      "title": "Удаление всех снимков с помощью режима чистки",
      "level": 4,
      "content": "Команда asd clean удалит ВСЕ резервные копии. Запускайте этот режим, только если вы уверены, что собранные резервные копии больше не понадобятся.\n\n"
    },
    {
      "title": "Поддержка",
      "level": 2,
      "content": "Пишите в тему на форуме (англ.) для комментариев и прочих обсуждений.\n\n"
    }
  ]
}