{
  "title": "APE+CUE Splitting",
  "url": "https://wiki.archlinux.org/title/APE%2BCUE_Splitting",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "This article describes how to split audio files using CUE metadata.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "To split audio files you need shntoolAUR. To split CD images in ISO or raw format you need bchunk.\n\nThe WAV format is supported natively for both input and output. To decode or encode files in other format you need an appropriate decoder. For example: flac, mac, or wavpack.\n\nTo tag audio files you need extra tools, such as cuetools, mp3info, or vorbis-tools. Alternatively, kid3 can be used for more advanced tagging needs, including importing from the MusicBrainz database for example.\n\n"
    },
    {
      "title": "Splitting",
      "level": 2,
      "content": "To split an audio file accompanied by a CUE sheet into tracks in .wav format, use the shnsplit command:\n\n```\n$ shnsplit -f file.cue file.wav\n```\n\nTo split .bin file with CUE sheet into tracks in .wav format:\n\n```\n$ bchunk -v -w file.bin file.cue out\n```\n\nFormat for output file names can be specified with the -t option (%p for performer, %a for album, %t for title, and %n for track number):\n\n```\n$ shnsplit -f file.cue -t \"%n %t\" file.wav\n```\n\nshnsplit supports on-the-fly encoding to many lossless formats (see shntool(1) for the full list). For example to encode split tracks in the FLAC format:\n\n```\n$ shnsplit -f file.cue -o flac file.flac\n```\n\nEncoding options, including the encoder itself, can be specified with the -o parameter (see shntool(1) for details):\n\n```\n$ shnsplit -f file.cue -o \"flac flac -s -8 -o %f -\" file.flac\n```\n\nThe formats supported by shntool and default encoder options can be view with the shntool -a command. If the desired format is not supported by shntool, it can be specified manually. For example, to encode split tracks directly into the Ogg Vorbis format:\n\n```\n$ shnsplit -f file.cue -o \"cust ext=ogg oggenc -b 192 -o %f -\" file.ape\n```\n\nThis process can be applied to any other encoder, such as opusenc(1) or lame(1), by specifying standard input (usually -) as the source and %f as the destination. See the encoder's man page for details.\n\n"
    },
    {
      "title": "Tagging",
      "level": 2,
      "content": "You will need cuetools to use cuetag.sh.\n\nTo copy the metadata from a CUE sheet to the split files you can use:\n\n```\n$ cuetag.sh file.cue *.mp3\n```\n\nor if you need to select only certain files:\n\n```\n$ cuetag.sh file.cue track01.mp3 track02.mp3 track03.mp3 track04.mp3\n```\n\ncuetag.sh supports id3 tags for .mp3 files and vorbis tags for .ogg and .flac files.\n\n"
    },
    {
      "title": "Alternatives",
      "level": 2,
      "content": "- This is a script that splits and converts files to tagged FLAC: https://bbs.archlinux.org/viewtopic.php?id=75774.\n- You may also use flaconAUR or flacon-gitAUR, a graphical Qt program that splits, converts and tags album audio files into song audio files. It also features automatic character set detection for CUE files.\n- To avoid quality loss from transcoding mp3 files, mp3splt-gtkAUR or mp3spltAUR may be used to directly split mp3 files either manually or automatically with a provided cuesheet. Batch mode processing is also available.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- What is APE?\n- What is CUE?\n- Rip Audio CDs\n\n"
    }
  ]
}