{
  "title": "Arch Linux (Català)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(Catal%C3%A0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nArch Linux és una distribució GNU/Linux x86-64 de propòsit general i desenvolupada independentment que vol posar a la disposició dels usuaris l'última versió estable de la majoria de programari mitjançant el model de llançament continu (rolling-release). La instal·lació per defecte és un sistema base mínim, que és configurat per l'usuari per a afegir només quelcom intencionalment necessari.\n\n"
    },
    {
      "title": "Senzillesa",
      "level": 3,
      "content": "Arch Linux defineix la senzillesa com a sense addicions o modificacions innecessàries. El sistema posa a disposició de l'usuari el programari tal com el publica el desenvolupador original (upstream) amb el mínim de canvis específics a la distribució (downstream): s'eviten els canvis no acceptats al upstream, i els canvis al downstream d'Arch són gairebé exclusivament solucions a errors que la propera publicació de l'autor original inclourà.\n\nSeguint la mateixa filosofia, Arch inclou els fitxers de configuració del upstream amb canvis limitats a ajustaments específics a la distribució, com és ajustar la ruta a alguns fitxers del sistema. No s'afegeix cap automatització, com activar un servei només perquè el paquet corresponent s'ha instal·lat. Els paquets només es divideixen si existeixen raons de pes per a fer-ho, com per estalviar espai en disc en alguns casos de gran desaprofitament. No es donen eines de configuració gràfica (GUI) de forma oficial, animant els usuaris a configurar el seu sistema des de la terminal i un editor de text.\n\n"
    },
    {
      "title": "Modernitat",
      "level": 3,
      "content": "Arch Linux té com a objectiu mantenir l'última versió estable publicada del seu programari sempre que es pugui evitar (dintre dels límits raonables) la fallida sistemàtica dels paquets. El sistema es basa en el model rolling-release, que permet instal·lar el sistema un únic cop i gaudir d'actualitzacions contínues.\n\nArch incorpora moltes de les característiques mes novedoses disponibles per als usuaris de GNU/Linux, incloent-hi el sistema d'inici systemd, sistemes de fitxers moderns, LVM2, RAID basat en programari, suport per a udev i initcpio (mitjançant mkinitcpio, a més dels últims kernels disponibles.\n\n"
    },
    {
      "title": "Pragmatisme",
      "level": 3,
      "content": "Arch és una distribució més pragmàtica que no ideològica. Els principis presentats aquí només són guies útils. Al final, les decisions de disseny es prenen tenint en compte cada cas seguint el consens dels desenvolupadors. El més important és l'anàlisi tècnica basada en proves i el debat, i no les polítiques o l'opinió popular.\n\nLa gran majoria de paquets i build scripts en els diversos repositoris d'Arch Linux ofereixen opcions gratuïtes i de codi obert per a aquells que ho prefereixen, a més de programari propietari per a qui posa la funcionalitat per davant de la ideologia.\n\n"
    },
    {
      "title": "Centrada en l'usuari",
      "level": 3,
      "content": "Mentre que moltes distribucions GNU/Linux intenten ser més amigables a l'usuari, Arch Linux sempre ha estat, i sempre serà, centrada en l'usuari. La distribució té l'objectiu de complir amb les necessitats d'aquells que hi contribueixen, en comptes d'intentar complaure el màxim d'usuaris possible. El sistema és orientat a l'usuari experimentat de GNU/Linux, o a qualsevol persona amb l'actitud de fes-ho tu mateix disposada a llegir la documentació, i resoldre els seus propis problemes.\n\nS'anima a participar i a contribuir a la distribució a tots els usuaris. Es valora molt informar i ajudar a resoldre errors, i s'agraeixen molt els canvis per a millorar paquets o els projectes base: els desenvolupadors d'Arch són voluntaris i els contribuïdors actius acostumen a acabar formant part d'aquest equip. Els Archers tenen la llibertat de contribuir paquets a l'Arch User Repository, millorar la documentació a l'ArchWiki, posar la seva ajuda tècnica a disposició dels altres o simplement intercanviar opinions als fòrums, a les llistes de correu, o als canals IRC. Arch Linux és el sistema operatiu escollit per moltes persones arreu del món i existeixen múltiples comunitats internacionals que ofereixen ajuda i documentació en molts idiomes diferents.\n\n"
    },
    {
      "title": "Versatilitat",
      "level": 3,
      "content": "Arch Linux és una distribució de propòsit general. Després de la instal·lació, l'únic que s'ofereix és un entorn de consola de comandes; en comptes d'eliminar paquets innecessaris o indesitjats, l'usuari pot construir un sistema personalitzat escollint entre milers de paquets d'alta qualitat disponibles als repositoris oficials per a l'arquitectura x86-64.\n\nArch segueix el model rolling-release amb l'ajuda de pacman, un gestor de paquets lleuger, senzill i ràpid que permet actualitzar el sistema contínuament amb una comanda. Arch també ofereix l'Arch Build System, un sistema similar a ports que permet construir i instal·lar paquets des de la font amb facilitat, que també es pot sincronitzar amb una comanda. A més, l'Arch User Repository conté milers i milers de scripts PKGBUILD per a compilar paquets instal·lables des de la font utilitzant l'aplicació makepkg. També és fàcil per als usuaris crear i mantenir els seus propis repositoris personalitzats.\n\n"
    },
    {
      "title": "Història",
      "level": 2,
      "content": "La comunitat d'Arch ha crescut i madurat fins a convertir-se en una de les distribucions Linux més populars i influents, mostra d'això són l'atenció i les valoracions rebudes al llarg dels anys.\n\nEls desenvolupadors d'Arch encara són voluntaris a temps parcial que no reben cap compensació econòmica per la seva labor, i no hi ha cap pla de monetitzar Arch Linux, així que seguirà sent gratis en tots els sentits de la paraula. Aquells que vulguin conèixer més detalls sobre la història del desenvolupament d'Arch poden explorar l'entrada d'Arch a l'Internet Wayback Machine i l'arxiu de notícies d'Arch Linux.\n\n"
    },
    {
      "title": "Els primers anys",
      "level": 3,
      "content": "Judd Vinet, un programador canadenc i guitarrista ocasional, va començar a desenvolupar Arch Linux a principis del 2001. La primera publicació formal, Arch Linux 0.1, va ser lliurada l'11 de març del 2002. Inspirat per l'elegant simplicitat de Slackware, BSD, PLD Linux i CRUX, i igualment decebut amb la seva falta de gestió de paquets (en aquell moment), Vinet va construir la seva pròpia distribució sota principis similars als de les distribucions anteriors. Però, també va escriure un programa de gestió de paquets anomenat pacman, per gestionar la instal·lació, eliminació, i actualització dels paquets de forma automàtica.\n\n"
    },
    {
      "title": "Els següents anys",
      "level": 3,
      "content": "La comunitat Arch va créixer constantment, com demostra aquesta gràfica de publicacions al fòrum, usuaris, i informes d'error. A més, des dels primers dies era coneguda com a una comunitat oberta, amigable, i útil.\n\n"
    },
    {
      "title": "Naixement de l'ArchWiki",
      "level": 3,
      "content": "El 8 de juliol del 2005 es configura per primer cop al motor MediaWiki.\n\n"
    },
    {
      "title": "L'alba de l'època d'A. Griffin",
      "level": 3,
      "content": "A finals del 2007, Judd Vinet es va retirar de la participació activa com a desenvolupador d'Arch, i a poc a poc va transferir el control al programador americà Aaron Griffin, també conegut com a Phrakture.\n\n"
    },
    {
      "title": "Arch Install Scripts",
      "level": 3,
      "content": "La imatge d'instal·lació publicada el 15 de juliol del 2005 va desestimar el Arch Installation Framework (AIF), basat en menús, en favor dels Arch Install Scripts (arch-install-scripts).\n\n"
    },
    {
      "title": "L'era de systemd",
      "level": 3,
      "content": "Entre el 2012 i el 2013 el sistema d'inici tradicional System V va ser substituït per systemd.[1][2][3][4]\n\n"
    },
    {
      "title": "Fi del suport a i686",
      "level": 3,
      "content": "El 25 de gener del 2017 es va anunciar que s'abandonaria el suport a l'arquitectura i686, a causa de la decaiguda de la seva popularitat entre els desenvolupadors i la comunitat. Tots els paquets per a i686 es van eliminar dels servidors abans d'acabar el 2017.\n\n"
    },
    {
      "title": "Revisió del rol de Líder de Projecte i elecció",
      "level": 3,
      "content": "A principis del 2020, l'equip d'Arch Linux va dissenyar un nou procés per a determinar futurs líders, documentat a DeveloperWiki:Project Leader.\n\nQuan Aaron Griffin va decidir deixar el seu rol, es va organitzar una votació per escollir a una nova persona per a substituir-lo, i els resultats van ser publicats el 24 de febrer del 2020, fent l'elecció de Levente Polyak oficial.\n\n"
    }
  ]
}