{
  "title": "ArchWiki Tutorial (Italiano)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_Tutorial_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **The translation of this article or section does not reflect the original text.** The translation of this article or section does not reflect the original text.\n\nThe translation of this article or section does not reflect the original text.\n\n"
    },
    {
      "title": "Registrazione ed accesso",
      "level": 2,
      "content": "Si possono leggere le pagine senza creare un account o loggarsi. Per creare una account (gratuito), basta cliccare il collegamento \"create an account or log in\" sul lato in alto a destra di questa pagina. Basta un solo login per tutti i documenti del wiki.\n\n"
    },
    {
      "title": "Editare",
      "level": 2,
      "content": "Come tutti i wiki, può essere editata ogni pagina non protetta. I cambiamenti sono visibili immediatamente. Basta cliccare edit che si trova in alto su ogni pagina.\n\nSpiegare il motivo delle modifiche nel box \"Summary\" che si trova tra la fine della pagina di modifica e i pulsante \"Save Page\" e \"Show preview\"\n\nUtilizzare il bottone [[Help:Show preview|show preview] per vedere se la formattazione è soddisfacente prima di salvare. Ricordarsi di salvare l'anteprima prima di uscire.\n\nSe si è eseguito il login, si può indicare una modifica come minor spuntando la casella This is a minor edit per fare in modo che gli altri sappiano che ciò che avete modificato non è qualcosa di sostanziale.\n\nPer provare a modificare, aprire una nuova finestra e andare a sandbox (è un area dedicata alle ai test di editing), cliccare su edit. Aggiungere qualcosa e cliccare \"Save page\"\n\n"
    },
    {
      "title": "Aggiungere una nuova pagina",
      "level": 2,
      "content": "Per aggiungere una nuova pagina ad una nuova categoria basta semplicemente:\n\n1. \"Editare\" una pagina con il nuovo titolo semplicemente andando su https://wiki.archlinux.org/title/My_new_page\n1. Aggiungere una categoria con il tag [[Category:la categoria scelta]] all'inizio della pagina.\n\n"
    },
    {
      "title": "Layout",
      "level": 2,
      "content": "Sebbene il contenuto della pagine wiki vari da topic a topic, la linea generale raccomanda di mantenere la consistenza tra gli articoli. Questo sotto è un buon esempio di come organizzare un articolo:\n\n- Introduzione -- Un riassunto sul tema dell'articolo\n- Installazione -- Se necessario, le istruzioni su come installare il software\n- Configurazione -- Se necessario, come configurare il software installato\n- Risoluzione dei problemi -- Domande frequenti riguardanti il software\n- Tips & Tricks -- Se necessario, suggerimenti o trucchi avanzati sull'utilizzo del software\n- Altre Risorse -- Il posto per indicare ulteriori riferimenti\n\nOk, ogni sottotitolo può \"e deve\" essere messo \"sotto\" ognuno di questi titoli. Guardare Capitoli e Sottocapitoli più in basso.\n\n"
    },
    {
      "title": "Formattazione",
      "level": 2,
      "content": "Molta della formattazione del testo viene fatta attraverso i wiki markup, quindi non occorre imparare HTML.\n\n"
    },
    {
      "title": "Grassetto e Corsivo",
      "level": 3,
      "content": "Grassetto e Corsivo si ottengono mettendo la parola o la frase tra apostrofi(') multipli:\n\n- con ''corsivo'' si ottiene corsivo. (2 apostrofi all'inizio e alla fine della parola)\n- con '''grassetto''' si ottiene grassetto. (3 apostrofi all'inizio e alla fine della parola)\n- con '''''grassetto e corsivo''''' si ottiene bolded italics. (2 + 3 = 5 apostrofi all'inizio e alla fine della parola)\n\n"
    },
    {
      "title": "Titoli e sottotitoli",
      "level": 3,
      "content": "I titoli e i sottotitoli rappresentano un modo semplice per organizzare un articolo. Se si possono distinguere due o più argomenti distinti questi possono essere separati con l'inserimento dei titoli per ogni sezione.\n\nI Titoli possono essere creati così come segue:\n\n- =Titolo di Primo livello= (1 segno uguale)\n- ==Sottotitolo== (2 segni uguale)\n- ===Un ulteriore livello sotto=== (3 segni uguale)\n- ====Un ulteriore livello sotto==== (4 segni uguale)\n- =====Un ulteriore livello sotto===== (5 segni uguale)\n\nSe un articolo ha almeno tre titoli, viene generata automaticamente una tabella dei contenuti (TOC). Se non si vuole usare una TOC, bisogna inserire un\n\n```\n__NOTOC__ nell'articolo.\n```\n\nSi provi a creare qualche titolo nel sandbox e a vedere l'effetto della TOC.\n\n"
    },
    {
      "title": "Indentare",
      "level": 3,
      "content": "Per indentare il testo, mettere i due punti (:) all'inizio della riga. Più due punti si mettono, più il testo sarà indentato. Un newline (la pressione di Enter or Return) indica la fine del paragrafo indentato.\n\nPer Esempio:\n\n```\nQuesto è allineato tutto a destra.\n:Questo è indentato leggermente.\n::Questo è più indentato.\n```\n\nviene mostrato come: Questo è allineato tutto a destra.\n\n"
    },
    {
      "title": "Elenco puntato",
      "level": 3,
      "content": "Per inserire un punto si usa l'asterisco (*). Come per quando si indenta, più asterischi davanti al paragrafo rappresentano più livello di indentazione.\n\nUn breve esempio:\n\n```\n*Primo elemento della lista\n*Secondo elemento della lista\n**Sub-list elemento sotto al secondo\n*Non è divertente?\n```\n\nChe viene mostrato come:\n\n- Primo elemento della lista\n- Secondo elemento della lista Sub-list elemento sotto al secondo\n- Non è divertente?\n\n- Sub-list elemento sotto al secondo\n\n"
    },
    {
      "title": "Liste numerate",
      "level": 3,
      "content": "Si possono creare inoltre delle liste numerate. Per queste va usato il cancelletto (#). Usando più cancelletti # si avrà l'effetto di indentazione.\n\nEsempio:\n\n```\n#Primo elemento \n#Secondo elemento \n##Sub-item sotto il secondo elemento \n#Terzo elemento\n```\n\nChe viene mostrato come:\n\n1. Primo elemento\n1. Secondo elemento Sub-item sotto il secondo elemento\n1. Terzo elemento\n\n1. Sub-item sotto il secondo elemento\n\n"
    },
    {
      "title": "Codice",
      "level": 3,
      "content": "Per aggiungere del codice al wiki basta anteporre ad ogni riga uno spazio bianco.\n\n"
    },
    {
      "title": "Collegamenti",
      "level": 2,
      "content": "I collegamenti sono importanti nelle pagine wiki per aiutare i lettori a visitare il sito.\n\n"
    },
    {
      "title": "Collegamenti interni",
      "level": 3,
      "content": "Ci si può riferire alle pagine del wiki usando i collegamenti interni. Si possono aggiungere collegamenti a titoli già esistenti ed anche a titoli che voi pensate possano esistere in futuro.\n\nPer inserire un link ad un'altra pagina dello stesso wiki basterà inserire il titolo tra le doppie parentesi quadre.\n\nPer esempio, se si vuole creare un link alla pagina \"Wikia\", basterà inserire:\n\n```\n[[Wikia]]\n```\n\nSe si volesse indicare il link con delle parole diverse da quelle del titolo dell'articolo a cui si punta, si può aggiungere un nome alternativo dopo una pipe \"|\". (SHIFT + BACKSLASH).\n\nPer esempio, se si vuole creare un link a Arch Linux, ma si vuole visualizzare \"home page\" basterà scrivere:\n\n```\nAndate all' [[Arch Linux|home page]]...\n```\n\nche viene visualizzato come:\n\nQuando si vuole usare il plurale di un titolo di un articolo (o aggiungere qualche suffisso) per un link, si possono aggiungere le lettere extra fuori dalle parentesi quadre.\n\nPer esempio, si può scrivere:\n\n```\nAdd questions to the Arch Linux for [[quiz]]zes.\n```\n\nche viene visualizzato come:\n\n"
    },
    {
      "title": "Collegamenti a sezioni di un documento",
      "level": 4,
      "content": "Per creare un collegamento ad una sezione di un documento basta aggiungere un cancelletto # seguito dal titolo della sezione.\n\n```\n[[ArchWiki_Tutorial_(Italiano)#Collegamenti_a_sezioni_di_un_documento|Sezioni]]\n```\n\nverrà mostrato come Sezioni.\n\n"
    },
    {
      "title": "Collegamenti a traduzioni",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nArchWiki permette di scrivere gli articoli in più linguaggi. Il \"soggetto\" deve essere lo stesso per ogni lingua, questo aiuta a collegare le stesse pagine che esistono nei vai linguaggi. Se un articolo esiste in più di un linguaggio, ArchWiki ha un \"i18n-box\", che va aggiungo all'articolo, che contiene il link allo stesso articolo ma in un'altra lingua.\n\nPer aggiungere questo i18n-box ad un articolo, basta mettere all'inizio dell'articolo:\n\n```\n{{i18n_links_start}}\n{{i18n_entry|Deutsch|German Title of the Article}}\n{{i18n_entry|Français|French Title of the Article}}\n{{i18n_links_end}}\n```\n\nSe il titolo è uguale per tutti allora il titolo sarà differenziato come segue\n\n```\nTitolo (Lingua)\n```\n\nPer esempio:\n\n```\nGnome\nGnome (Deutsch)\nGnome (Français)\nGnome (Italiano)\n```\n\n"
    },
    {
      "title": "Collegamenti esterni",
      "level": 3,
      "content": "Se si vuole mostrare un collegamento ad un sito fuori dai wiki, basterà inserire l' URL completo della pagina da collegare.\n\n```\nhttps://www.google.com/\n```\n\nSe si volesse mostrare un testo diverso dall'URL per il collegamento basterà mettere l'URL tra parentesi quadre e indicare il nome alternativo separato da uno spazio (non una pipe). Quindi se si vuole un link come Il motore di ricerca Google , basterà scrivere:\n\n```\n[http://www.google.com/ Il motore di ricerca Google]\n```\n\n"
    },
    {
      "title": "Redirects",
      "level": 2,
      "content": "Per re-direzionare in maniera automatica da una pagina ad un altra basta inserire #REDIRECT e inserire tra parentesi il nome della pagina dove si vuole passare in automatico.\n\nPer esempio si potrebbe re-direzionare da \"Cats\" a \"Cat\":\n\n```\n#REDIRECT [[Cat]]\n```\n\nIn questo modo chiunque inserisce una delle due versioni nel box di ricerca arriverà automaticamente a \"Cat\".\n\n"
    },
    {
      "title": "Richieste",
      "level": 2,
      "content": "Volete una guida per qualcosa? Volete sapere qualcosa? Basterà mettere una richiesta nella pagina wiki Requests!\n\n"
    },
    {
      "title": "Le variabili Wiki e i templates",
      "level": 2,
      "content": "Si usa {{SITENAME}} per indicare il documento wiki corrente. Se si scrive, {{SITENAME}} in questo sito verrà visualizzato ArchWiki.\n\nSi possono creare anche dei template personalizzati. Dopo aver creato la pagina Template:XXX, basterà usare il comando {{XXX}} che ne includerà il contenuto nella pagina corrente. Quindi, se si ha qualcosa che va incluso in molte pagine, allora si dovrà utilizzare un template.\n\n"
    },
    {
      "title": "Pagine di discussione",
      "level": 2,
      "content": "Le pagine di discussione servono a comunicare con gli altri utenti dell' Arch Wiki.\n\nPer commentare ogni pagine basterà andare sulla pagina e cliccare sul tab \"discussion\" in cima alla pagina. Aggiungere un nuovo commento alla fine, o sotto al commento al quale si vuole rispondere.\n\nFirmare il proprio commento digitando ~~~~ per inserire il proprio username e la data.\n\nSi utilizza indenting per formattare una discussione. Si usa indentare di un livello in più la propria risposta rispetto al commento al quale si va a rispondere.\n\nProvare editando talk page of the sandbox.\n\n"
    },
    {
      "title": "Pagina utente",
      "level": 3,
      "content": "Ognuno ha una pagina utente, dove ogni persona può lasciare un messaggio pubblico. Se qualcuno ci lascia un messaggio, si vedrà una nota \"You have new messages\" con un collegamento alla propria pagina utente.\n\nSi potrà rispondere al messaggio nella pagina utente della persona o nella propria pagina sotto al messaggio originale. Se si risponde nella pagina utente della persona che vi ha lasciato il commento, essa riceverà una notifica.\n\n"
    },
    {
      "title": "Categorie speciali",
      "level": 2,
      "content": "Esistono delle categorie speciale che aiutano a lavorare con ArchWiki.\n\n"
    },
    {
      "title": "L'articolo non è finito per essere usato",
      "level": 3,
      "content": "La Categoria Stub[link interrotto 2020-08-06] contiene tutti gli articoli che sono marcati con il flag\n\n```\n{{stub}}\n```\n\n. Le ragioni per cui questi articoli si trovano nella categoria stub sono:\n\n- che sono troppo corti\n- non spiegano nulla\n- contengono parti non finite\n\n"
    },
    {
      "title": "Gli articoli non sono tradotti",
      "level": 3,
      "content": "La Categoria \"Translation Requested\"[link interrotto 2020-08-06] contiene tutti gli articoli che sono marcati con il flag\n\n```\n{{translateme}}\n```\n\n. Le ragioni per cui gli articoli si devono trovare in questa particolare categoria sono:\n\n- parte di essi non sono nel linguaggio in cui dovrebbero essere\n- il contenuto non è tutto tradotto ma semplicemente copiato dall'inglese o altra lingua\n- la pagina originale è stata aggiornata e mancano delle parti alla traduzione.\n\n"
    },
    {
      "title": "Gli articoli che contengono delle informazioni confuse o potenzialmente sbagliate",
      "level": 3,
      "content": "La Categoria \"Accuracy Disputes\"[link interrotto 2020-08-06] contiene tutti gli articoli che sono marcati con il flag\n\n```\n{{accuracy}}\n```\n\n. Le ragioni per cui gli articoli si devono trovare in questa particolare categoria sono:\n\n- gli utenti si sono accorti di informazioni potenzialmente sbagliate o confuse e stanno discutendo per correggerle\n- la pagina contiene delle informazioni non aggiornate.\n\nQuesto flag è spiegato in dettaglio nell'articolo Accuracy_dispute.\n\n"
    },
    {
      "title": "Richieste",
      "level": 4,
      "content": "Scrivete le richieste qui!\n\nRichieste\n\nRichieste di traduzione\n\n"
    }
  ]
}