{
  "title": "Arch Linux (Română)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(Rom%C3%A2n%C4%83)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux este o distribuție GNU/Linux dezvoltată independent, cu scop general, pentru arhitectura x86-64 care se străduiește să furnizeze ultimele versiuni stabile a majorității software-ului, urmărind un model rolling-release. Instalarea implicită este un sistem minimalistic de bază, configurat de utilizator pentru a adăuga numai ce este necesar.\n\n"
    },
    {
      "title": "Simplitate",
      "level": 3,
      "content": "Arch Linux definește simplitatea ca fără adăugări sau modificări inutile. Acesta dă software-ul așa cum dezvoltatorii lui originali l-au lansat (upstream), cu modificări minime specifice distribuției (downstream): patch-urile neacceptate de upstream sunt evitate, iar pachetele downstream ale Arch constau aproape numai în bugfix-urile backportate care sunt depășite de următoarea versiune a proiectului.\n\nÎntr-o manieră similară, Arch aduce fișierele de configurare prevăzute de upstream cu schimbări limitate la problemele specifice distribuției, ca ajustarea căilor sistemului de fișiere. Nu adaugă funcții de automatizare ca și activarea unui serviciu numai pentru că pachetul a fost instalat. Pachetele sunt împărțite numai atunci când există avantaje convingătoare, cum ar fi economisirea spațiului de stocare în cazuri deosebit de rele de deșeuri. Utilități de configurare GUI nu sunt furnizate oficial, încurajând utilizatorii să facă majoritatea configurărilor cu un shell și un editor de text.\n\n"
    },
    {
      "title": "Modernitate",
      "level": 3,
      "content": "Arch Linux se străduiește să mențină ultimele versiuni stabile ale software-ului său, atât timp cât se poate evita în mod rezonabil ruperea sistemică a pachetelor. Este bazat după un sistem rolling-release, care permite să se instaleze o singură dată și să aibă upgrade-uri continue.\n\nArch incorporează multe din funcțiile noi disponibile utilizatorilor GNU/Linux, incluzând sistemul de init systemd, fișiere de sistem moderne, LVM2, RAID software, suport pentru udev și initcpio (cu mkinitcpio), precum și cele mai noi kernel-uri disponibile.\n\n"
    },
    {
      "title": "Pragmatism",
      "level": 3,
      "content": "Arch este mai degrabă o distribuție pragmatică decât una ideologică. Principiile de aici sunt doar orientări utile. În cele din urmă, deciziile de design sunt luate de la caz la caz, prin consensul dezvoltatorilor. Analiza tehnică și dezbaterea bazată pe dovezi sunt ceea ce contează, nu politica sau opinia populară.\n\nNumărul mare de pachete și scripturi de build în variatele arhive Arch Linux oferă software ”free and open source” (software liber și cu sursa deschisă) pentru cei care îl preferă, precum și software ”proprietary” pentru cei care preferă funcționalitatea mai mult decât ideologia.\n\n"
    },
    {
      "title": "Centralitatea utilizatorului",
      "level": 3,
      "content": "În timp ce multe distribuții GNU/Linux încearcă să fie mai ușor de utilizat (user friendly), Arch Linux a fost, și va rămâne mereu centrat pe utilizator (user-centric). Distribuția este destinată să răspundă nevoilor celor care contribuie la aceasta, decât să încerce să fie atractivă pentru cât mai multi utilizatori. Este destinată utilizatorului de GNU/Linux priceput, sau oricărui utilizator cu o atitudine do-it-yourself care este dispus să citească documentarea și să își rezolve singur problemele.\n\nToți utilizatorii sunt încurajați să participe și să contribuie la distribuție. Este foarte apreciată raportarea și repararea de bug-uri și patch-urile care îmbunătățesc pachetele sau proiectele de bază: Dezvoltatorii de la Arch sunt voluntari și contributorii activi vor începe să facă parte din acea echipă. Arch-erii pot contribui liber pachete în Arch User Repository, îmbunătății documentația ArchWiki, furniza asistență tehnică, sau doar să facă schimb de opinii în forum-uri, listele de e-mail-uri, sau Canalele IRC. Arch Linux este sistemul de operare pe care mulți oameni din jurul globului îl aleg, și există mai multe comunități internaționale care oferă ajutor și furnizează documentație în multe limbi diferite.\n\n"
    },
    {
      "title": "Versatilitate",
      "level": 3,
      "content": "Arch Linux este o distribuție cu scop general. La instalare este furnizat numai un mediu command-line: decât ca utilizatorul să șteargă pachete nedorite sau care nu sunt necesare, utilizatorului îi este oferită posibilitatea să își construiască propriul sistem personalizat, alegând dintre miile de pachete de calitate mare furnizate în arhivele oficiale pentru arhitectura x86-64.\n\nArch se folosește de pacman, un mannager de pachete ușor, simplu și rapid care permite actualizarea întregului sistem cu numai o singură comandă. Arch furnizează de asemenea și Arch build system, un sistem ca-și-ports (ports-like) care face instalarea și build-ul pachetelor din sursă ușor, care poate fi, de asemenea, sincronizat cu o singură comandă. În plus, Arch User Repository-ul conține mii de scripturi PKGBUILD contribuite de către comunitate pentru compilarea pachetelor instalabile din cod sursă, folosind makepkg. Este de asemenea posibil ca utilizatori să facă build și să își mențină propriile arhive personalizate cu ușurință.\n\n"
    },
    {
      "title": "Istorie",
      "level": 2,
      "content": "Comunitatea Arch a crescut și s-a maturizat, astfel devenind una dintre cele mai populare și influente distribuții de Linux, mărturisită și de atenția și review-urile primite de-a lungul anilor.\n\nDezvoltatorii Arch rămân voluntari neplătiți cu jumătate de normă, și nu există nicio perspectivă ca Arch Linux să devină monetizat, așa că va rămâne \"free\" în toate sensurile cuvântului (gratis/liber). Cei curioși să citească în mai mult detaliu despre istoria dezvoltării Arch pot să parcurgă intrarea Arch în Internet Archive Wayback Machine și Arhivele de știri Arch Linux.\n\n"
    },
    {
      "title": "Primii ani",
      "level": 3,
      "content": "Judd Vinet, un programator canadian și un chitarist ocazional a început să dezvolte Arch Linux la începutul anului 2001. Primul release al acestuia, Arch Linux 0.1, a fost lansat pe data de 11 martie 2002. Inspirat de simplitatea a Slackware, BSD, PLD Linux și CRUX, dar totuși dezamăgit de lipsa lor de gestionare a pachetelor la acea vreme, Vinett și-a construit propria distribuție cu principii similare ca cele ale acelor distribuții. Dar, a și scris un program de gestionare a pachetelor numit pacman, care să gestioneze automat instalarea, ștergerea și actualizarea pachetelor.\n\n"
    },
    {
      "title": "Anii de mijloc",
      "level": 3,
      "content": "Comunitatea Arch de la început a crscut constant, ca dovadă acest chart a postărilor pe forum, utilizatori și bug-uri raportate. În plus, din primele ei zile era cunoscută ca o comunitate deschisă, prietenoasă și utilă.\n\n"
    },
    {
      "title": "Crearea ArchWiki",
      "level": 3,
      "content": "Pe data de 08.07.2005, ArchWiki-ul a fost creat pentru prima dată pe engine-ul MediaWiki.\n\n"
    },
    {
      "title": "Zorii perioadei lui A. Griffin",
      "level": 3,
      "content": "La finalul anului 2007, Judd Vinett s-a retras din participarea activă ca un dezvoltator Arch, și a transferat ușor frâiele programatorului american Aaron Griffin, cunoscut și ca Phrakture.\n\n"
    },
    {
      "title": "Scripturi de instalare Arch",
      "level": 3,
      "content": "Imaginea de instalare din 15.07.2012 a renunțat la meniul Arch Installation Framework (AIF) în favoarea a Arch Install Scripts (arch-install-scripts).\n\n"
    },
    {
      "title": "Era systemd",
      "level": 3,
      "content": "Între 2012 și 2013, sistemul tradițional de init System V a fost înlocuit de systemd. [1][2][3][4]\n\n"
    },
    {
      "title": "Renunțarea la suportul pentru i686",
      "level": 3,
      "content": "Pe data de 25.01.2017 a fost anunțat că suportul pentru arhitectura i686 va fi eliminat treptat datorită popularității acesteia scazute printre dezvoltatori și în comunitate. La sfârșitul lui noiembrie, 2017 toate pachetele i686 au fost șterse din mirror-uri.\n\n"
    },
    {
      "title": "Revizuirea rolului șefului de proiect și a alegerilor",
      "level": 3,
      "content": "La începutul anului 2020, într-un efort de echipă, staff-ul Arch Linux a conceput un nou proces pentru determinarea noilor lideri, documentat în DeveloperWiki:Project Leader.\n\nCum Aaron Griffin a decis să renunțe la rolul său, un sondaj a fost făcut ca să se aleagă o nouă persoană care să îl înlocuiască, și pe data de 24.02.2020, rezultatele au fost publicate, făcând alegerea lui Levente Polyak oficială.\n\n"
    }
  ]
}