{
  "title": "ArchLinux:About (Português)",
  "url": "https://wiki.archlinux.org/title/ArchLinux:About_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O Arch Linux é uma distribuição GNU/Linux x86_64 de uso geral desenvolvida independentemente que se empenha em fornecer as últimas versões estáveis da maioria dos softwares seguindo um modelo de lançamento contínuo (rolling-release). A instalação padrão é um sistema base mínimo, configurado pelo usuário para adicionar apenas o que é propositalmente necessário.\n\n"
    },
    {
      "title": "Simplicidade",
      "level": 3,
      "content": "O Arch Linux define simplicidade como sem adições ou modificações desnecessárias. Ele provê softwares conforme lançado pelos desenvolvedores originais (upstream) com alterações mínimas específicas da distribuição (downstream): patches não aceitos pelo upstream são evitados, e patches de downstream do Arch consistem quase totalmente em correções de erros de backport que são obsoletos pelo próximo lançamento do projeto.\n\nDe uma forma similar, Arch provê os arquivos de configurações fornecidos pelo upstream com alterações limitadas a questões específicas de distribuição, como ajustar caminhos de arquivos de sistema. Ele não adiciona recursos de automação como habilitar um serviço apenas porque o pacote foi instalado. Pacotes só são divididos quando houver vantagens interessantes, tal como economizar espaço em disco em casos em que haja grande desperdício. Utilitários de configuração GUI não são oficialmente fornecidos, incentivando usuários a realizar a maioria da configuração de sistema a partir do shell ou um editor de texto.\n\n"
    },
    {
      "title": "Modernidade",
      "level": 3,
      "content": "O Arch Linux se empenha em oferecer as últimas versões estáveis de seus pacotes, desde que a quebra sistemática de pacotes possa razoavelmente ser evitada. Ele é baseado em um sistema de rolling-release, que permite uma única instalação e upgrades contínuos.\n\nO Arch incorpora muitas das mais novas funcionalidades disponíveis para os usuários do GNU/Linux, incluindo o sistema de inicialização systemd, sistemas de arquivos modernos, LVM2, RAID via software, suporte ao udev e initcpio (com mkinitcpio), bem como os últimos kernels.\n\n"
    },
    {
      "title": "Pragmatismo",
      "level": 3,
      "content": "Arch é uma distribuição pragmática, em vez de uma ideológica. Os princípios aqui são apenas diretrizes úteis. Em última análise, decisões de design são feitas caso a caso pelo consenso de desenvolvedores. Análise técnica baseada em evidências e debate são o que importam, não a política ou a opinião popular.\n\nO grande número de pacotes e scripts de compilação nos vários repositórios do Arch Linux oferem software livre e de código aberto para aqueles que o preferem, assim como pacotes de software proprietário para aqueles que adotam funcionalidade sobre ideologia.\n\n"
    },
    {
      "title": "Centrado no usuário",
      "level": 3,
      "content": "Enquanto muitas distribuições GNU/Linux tentam ser mais user-friendly, o Arch Linux sempre foi e sempre será user-centric. O Arch Linux tem a intenção de preencher as necessidades daqueles contribuindo para ele em vez de tentar agradar a maior quantidade de usuários possível. Ele é direcionado para o usuário GNU/Linux avançado ou a qualquer outro com uma atividade \"faça você mesmo\" que esteja interessado em ler a documentação e resolver seus próprios problemas.\n\nTodos os usuários são incentivados a participar e contribuir com a distribuição. Relatar e ajudar a corrigir falhas é muito valioso e patches que aprimorem pacotes ou os projetos centrais são muito bem-vindos: desenvolvedores do Arch são voluntários e contribuidores ativos frequentemente se verão se tornando parte da equipe. Archers podem contribuir livremente com pacotes para o Arch User Repository, melhorar a documentação da ArchWiki, fornecer assistência técnica para outros ou apenas trocar opiniões nos fóruns, listas de discussões ou canais IRC. Arch Linux é o sistema operacional de escolha para muitos pacotes pelo mundo, e há várias comunidades internacionais que oferecem ajuda e fornecem documentação em muitos idiomas diferentes.\n\n"
    },
    {
      "title": "Versatilidade",
      "level": 3,
      "content": "Arch Linux é uma distribuição de propósito geral. Na instalação, apenas um ambiente de linha de comando é fornecido: em vez de separar pacotes desnecessários e indesejados, o usuário tem a capacidade de construir um sistema personalizado escolhendo entre milhares de pacotes de alta qualidade fornecidos nos repositórios oficiais para a arquitetura x86-64.\n\nArch é um modelo rolling-release apoiado pelo pacman, um gerenciador de pacotes leve, simples e rápido que permite atualizar continuamente todo o sistema com apenas um comando. O Arch também fornece o sistema de compilação do Arch, um sistema tipo ports para facilitar a compilação e instalação de pacotes a partir do código-fonte, que também pode ser sincronizado com um comando. Além disso, o Arch User Repository contém muitos milhares de scripts PKGBUILD contribuídos pela comunidade para compilar pacotes instaláveis a partir da fonte usando o script makepkg. Também é possível para usuários compilar e manter seus próprios repositórios personalizados com facilidade.\n\n"
    },
    {
      "title": "História",
      "level": 2,
      "content": "A comunidade do Arch cresceu e amadureceu para se tornar uma das mais populares e influenciadoras distribuições Linux, também atestado pela atenção e análise recebida ao longo dos anos.\n\nOs desenvolvedores do Arch continuam a ser voluntários não-pagos e de meio expediente, e não existem expectativas de monetizar o Arch Linux, de modo que ele continuará a ser livre e gratuito. Aqueles curiosos para ler mais detalhes sobre a história do desenvolvimento do Arch podem navegar na entrada sobre o Arch na Internet Archive Wayback Machine.\n\n"
    },
    {
      "title": "Os primeiros anos",
      "level": 3,
      "content": "Judd Vinet, um programador canadense e guitarrista ocasional, começou a desenvolver o Arch Linux no começo de 2001. Seu primeiro lançamento formal, Arch Linux 0.1, foi em 11 de março de 2002. Inspirado pela elegante simplicidade do Slackware, BSD, PLD Linux e CRUX, mas desapontado com a falta de gerenciamento de pacotes na época, Vinet construiu sua própria distribuição com princípios similares àquelas distros. No entanto, ele também escreveu um gerenciador de programas chamado pacman, para manipular automaticamente a resolução de dependências, instalação, remoção e atualizações de pacotes.\n\n"
    },
    {
      "title": "Os anos intermediários",
      "level": 3,
      "content": "A comunidade inicial do Arch cresceu firmemente, como evidenciado por esse gráfico do número de postagens no fórum, usuários e relatórios de bugs. Além disso, foi, desde seus primeiros dias, conhecida como uma comunidade aberta, amigável e prestativa.\n\n"
    },
    {
      "title": "Nascimento da ArchWiki",
      "level": 3,
      "content": "Em 08/07/2005 a ArchWiki foi configurada pela primeira vez no mecanismo MediaWiki.\n\n"
    },
    {
      "title": "O alvorecer da era A. Griffin",
      "level": 3,
      "content": "No fim de 2007, Judd Vinet se afastou da participação ativa como desenvolvedor do Arch, e transferiu tranquilamente o reinado para o programador americano Aaron Griffin, também conhecido como Phrakture.\n\n"
    },
    {
      "title": "Arch Install Scripts",
      "level": 3,
      "content": "O lançamento da imagem de instalação, em 15/07/2012, descontinuou o sistema de menus Arch Installation Framework (AIF) em favor dos Arch Install Scripts (arch-install-scripts).\n\n"
    },
    {
      "title": "A era do systemd",
      "level": 3,
      "content": "Entre 2012 e 2013, o tradicional sistema de inicialização System V foi substituído pelo systemd.[1][2][3][4]\n\n"
    },
    {
      "title": "Fim do suporte a i686",
      "level": 3,
      "content": "Em 25/01/2017, foi anunciado que o suporte para a arquitetura i686 seria encerrado devido à decrescente popularidade entre os desenvolvedores e a comunidade. No fim de novembro de 2017, todos os pacotes i686 foram removidos dos mirrors.\n\n"
    },
    {
      "title": "Revisão do papel de Líder de Projeto e eleição",
      "level": 3,
      "content": "No início de 2020, em um esforço coletivo, a equipe do Arch Linux desenvolveu um novo processo para determinar futuros líderes, documentado em DeveloperWiki:Project Leader.\n\nComo Aaron Griffin decidiu deixar o cargo, uma votação foi realizada para eleger uma nova pessoa para substituí-lo e, em 24/02/2020, seus resultados foram publicados, oficializando a eleição de Levente Polyak.\n\n"
    },
    {
      "title": "A era do GitLab",
      "level": 3,
      "content": "Em maio de 2023, o Arch Linux migrou sua infraestrutura de empacotamento para o GitLab. Além de mudanças e inovações internas, isso também resultou na divisão do repositório testing em core-testing e extra-testing, o repositório staging em core-staging e extra-staging e, finalmente, community foi mesclado em extra. Leia mais detalhes no blog do GitLab.\n\nVários meses depois, em novembro de 2023, o antigo rastreador de bugs (Flyspray) foi migrado para o GitLab e seus recursos de colaboração (problemas e solicitações de mesclagem) foram abertos ao público. Por motivos de arquivamento, haverá uma cópia estática do antigo rastreador de bugs para que os links (por exemplo, o FS#56716 escolhido aleatoriamente) ainda sejam válidos.\n\n"
    }
  ]
}