{
  "title": "ArchWiki Translation Team (Nederlands)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_Translation_Team_(Nederlands)",
  "sections": [
    {
      "title": "Vertaal een pagina",
      "level": 2,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\n1. Als je niet bekend bent met het schrijven of veranderen van artikels, zie Help:Editing.\n1. Zie Help:i18n voor een uitvoerige leiddraad over vertalingen in ArchWiki.\n1. Login om pagina's te kunnen veranderen.\n1. Kies een artikel dat je wil vertalen. Dit kan een willekeurige pagina zijn. Neem bijvoorbeeld dit artikel: ArchWiki Translation Team (Nederlands).\n1. Klik \"Edit\" bovenaan op de pagina.\n1. Je hebt een simpele tekstverwerker ter beschikking. Voeg een verwijzing toe voor de nieuwe taal, een zogenaamde interwiki link. In ons voorbeeld is dit [[nl:ArchWiki Translation Team]]. Zie Help:i18n#Interlanguage links.\n1. Kopieer de volledige inhoud van het artikel.\n1. Klik \"Save\" om de pagina op te slaan.\n1. De nieuwe verwijzing is zichtbaar in de linker hoek. Klik erop, en zij zal je leiden naar ArchWiki Translation Team (Taal), waar Taal de taalnaam is van de nieuwe vertaling.\n1. Als het artikel nog niet bestaat, maak het aan door bovenaan op \"Create\" te klikken.\n1. Plak de artikelinhoud die je in een vorige stap gekopieerd hebt.\n1. Wijzig de \"Category\" links naar hun vertaalde versies. Verander bijvoorbeeld [[Category:ArchWiki]] in [[Category:ArchWiki (Taal)]]. Zie verder Help:Category.\n1. Verander de interwiki link op de nieuwe pagina zo, dat hij naar de oorspronkelijke pagina wijst. Bijvoorbeed [[nl:ArchWiki Translation Team]] naar [[en:ArchWiki:Translation Team]].\n1. Vertaal nu de artikelinhoud, schrijf een edit summary zoals translate [[ArchWiki Translation Team]], en druk op \"Save\".\n1. Als er andere vertalingen voor het artikel bestaan, voeg de juiste interwiki links toe.\n1. Onderaan zie je alle categorieën waarin de pagina zich bevindt. Kijk na dat er geen onbestaande, of \"rode\" categorieën bestaan. Anders maak deze aan zoals je een normaal artikel aanmaakt.\n1. (optioneel) Maak een andere pagina aan, b.v ArchWiki Vertaalteam, and voeg als enige inhoud #REDIRECT [[ArchWiki_Translation_Team_(''Taal'')]] toe.\n\n"
    },
    {
      "title": "Templates",
      "level": 2,
      "content": "There are no Dutch templates.\n\n"
    }
  ]
}