{
  "title": "ArchWiki (Català)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_(Catal%C3%A0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles relacionats\n\n- Ajuda:Edició\n- Ajuda:Estil\n- Ajuda:Lectura\n\nAquest article es una visió general sobre l'ArchWiki, responent a les preguntes \"Qui?\", \"Que?\", \"Perque?\", i \"Com?\".\n\n"
    },
    {
      "title": "Objectius",
      "level": 2,
      "content": "L'objectiu principal de l'ArchWiki és posar a disposició de la comunitat d'usuaris d'Arch Linux la documentació més completa i més accessible a la web. Aquest és un projecte global amb molts participants d'arreu del món. La wiki segueix tots els principis d'Arch Linux, sobretot respectant el de simplicitat. L'ArchWiki evoluciona de forma constant i prospera gràcies a la col·laboració; sempre hi ha marge de millora.\n\n"
    },
    {
      "title": "Completa",
      "level": 3,
      "content": "Un dels objectius principals de l'ArchWiki és cobrir tots els aspectes de la computació relacionats amb l'ús d'Arch Linux. Des d'un centre multimèdia fins a la gestió de xarxes corporatives, qualsevol cosa que Arch Linux pugui fer està a l'abast de l'ArchWiki.\n\n"
    },
    {
      "title": "Accessible",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nLa meta principal de l'ArchWiki pot ser grandiosa, i es requereixen milers d'articles; l'ArchWiki ha d'oferir una manera simple i intuïtiva d'accedir a tota aquesta informació. Aquesta no és una tasca senzilla, però l'enginy i imaginació típica d'Arch preval.\n\nEl paquet oficial arch-wiki-docs ofereix als usuaris la possibilitat de descarregar una còpia del contingut de l'ArchWiki. Vegeu aquesta discussió al fòrum per a més detalls.\n\n"
    },
    {
      "title": "Com funciona",
      "level": 2,
      "content": "El manteniment de l'Arch Wiki és gràcies a l'Equip de Manteniment oficial i a milers de contribuïdors. Els usuaris editen i organitzen articles per a oferir als lectors la millor documentació d'Arch Linux. Els continguts són creats per la comunitat, per a la comunitat: la majoria d'articles no són escrits per una única persona, sinó que representen l'esforç acumulat de moltes que corregeixen informació errònia, actualitzen articles vells, i fan tot el possible per a seguir millorant els continguts de l'ArchWiki.\n\n"
    },
    {
      "title": "Com podeu ajudar",
      "level": 2,
      "content": "L'ArchWiki és mantinguda per voluntaris. Mai hi ha massa contribuïdors, i sempre es necessita ajuda. Si us sentiu capaços d'editar (o traduir) pàgines de la wiki, considereu donar part del vostre temps i energia a la comunitat.\n\nSi us plau, vegeu ArchWiki:Contributing (Català) per a descobrir de quines maneres podeu contribuir.\n\n"
    },
    {
      "title": "Història dels inicis",
      "level": 2,
      "content": "- 11-01-2004 || S'anuncia una forma primitiva similar a una wiki de contribuir documentació als fòrums, basada en un compte d'usuari obert.\n- 03-02-2004 || La primera proposta coneguda de crear una documentació en format wiki per a Arch Linux es publica als fòrums.\n- 27-02-2004 || S'anuncia als fòrums una primera wiki basada en PhpWiki.\n- 05-06-2005 || Es proposa la migració a l'actual instal·lació de MediaWiki.\n- 08-07-2005 || Es configura l'ArchWiki a MediaWiki.\n- 11-07-2005 || Primera edició, feta a l'article ArchWiki:General disclaimer.\n- 11-07-2005 || Primera edició a l'espai de noms Main, feta a la pàgina principal.\n- 18-07-2005 || S'anuncia als fòrums la nova instal·lació: llavors comença la migració dels articles ja existents de la versió PhpWiki.\n\n"
    },
    {
      "title": "Contactes",
      "level": 2,
      "content": "Vegeu ArchWiki:Maintenance Team (Català) per a una llista de coordinadors de l'ArchWiki.\n\n"
    },
    {
      "title": "Agraïments",
      "level": 2,
      "content": "- L'equip d'Arch Linux ofereix amablement l'allotjament\n- Amb tecnologia de MediaWiki\n- Gràcies a tots els nostres contribuïdors i seguidors!\n\n"
    }
  ]
}