{
  "title": "Arch Linux (हिन्दी)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(%E0%A4%B9%E0%A4%BF%E0%A4%A8%E0%A5%8D%E0%A4%A6%E0%A5%80)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "आर्क लिनक्स एक स्वतंत्र रूप से विकसित, x86-64 सामान्य उद्देश्य GNU/लिनक्स वितरण है जो रोलिंग-रिलीज मॉडल का पालन करके अधिकांश सॉफ्टवेयर के नवीनतम स्थिर संस्करण प्रदान करने का प्रयास करता है। डिफ़ॉल्ट इंस्टॉलेशन एक न्यूनतम आधार प्रणाली है, जिसे उपयोगकर्ता द्वारा केवल जानबूझकर आवश्यक जोड़ने के लिए कॉन्फ़िगर किया गया है।\n\n"
    },
    {
      "title": "सादगी",
      "level": 3,
      "content": "आर्क लिनक्स सादगी को अनावश्यक परिवर्धन या संशोधनों के बिना के रूप में परिभाषित करता है। यह मूल डेवलपर्स द्वारा जारी किए गए सॉफ्टवेयर को जहाजों (अपस्ट्रीम) न्यूनतम वितरण-विशिष्ट (डाउनस्ट्रीम) परिवर्तनों के साथ: अपस्ट्रीम द्वारा स्वीकार नहीं किए गए पैच से बचा जाता है, और आर्क के डाउनस्ट्रीम पैच में लगभग पूरी तरह से बैकपोर्टेड बग फिक्स होते हैं जो परियोजना की अगली रिलीज से अप्रचलित हैं।\n\nइसी तरह, आर्क सिस्टम फ़ाइल पथों को समायोजित करने जैसे वितरण-विशिष्ट मुद्दों तक सीमित परिवर्तनों के साथ अपस्ट्रीम द्वारा प्रदान की गई विन्यास फ़ाइलों को जहाजों। यह स्वचालन सुविधाओं को इस तरह के एक सेवा को सक्षम करने के रूप में सिर्फ इसलिए कि पैकेज स्थापित किया गया था नहीं जोड़ता है । पैकेज केवल विभाजित कर रहे है जब संमोहक लाभ मौजूद हैं, जैसे कचरे के विशेष रूप से बुरे मामलों में डिस्क अंतरिक्ष को बचाने के लिए । जीयूआई कॉन्फ़िगरेशन उपयोगिताओं को आधिकारिक तौर पर प्रदान नहीं किया जाता है, उपयोगकर्ताओं को शेल और टेक्स्ट एडिटर से अधिकांश सिस्टम कॉन्फ़िगरेशन करने के लिए प्रोत्साहित करता है।\n\n"
    },
    {
      "title": "आधुनिकता",
      "level": 3,
      "content": "आर्क लिनक्स अपने सॉफ्टवेयर के नवीनतम स्थिर रिलीज संस्करणों को बनाए रखने का प्रयास करता है जब तक कि प्रणालीगत पैकेज टूटना से यथोचित रूप से बचा जा सकता है। यह एक रोलिंग-रिलीज सिस्टम पर आधारित है, जो निरंतर उन्नयन के साथ एक बार स्थापना की अनुमति देता है।\n\nआर्क में जीएनयू/लिनक्स उपयोगकर्ताओं के लिए उपलब्ध कई नई विशेषताओं को शामिल किया गया है, जिनमें systemd इनिट सिस्टम, आधुनिक file systems, एलवीएम2, सॉफ्टवेयर RAID, यूदेव समर्थन और इनिटपियो (mkinitcpio के साथ), साथ ही नवीनतम उपलब्ध गुठली शामिल हैं।\n\n"
    },
    {
      "title": "यथार्थवादिता",
      "level": 3,
      "content": "आर्क एक वैचारिक के बजाय एक व्यावहारिक वितरण है। यहां सिद्धांत केवल उपयोगी दिशा-निर्देश हैं। अंततः, डिजाइन निर्णय डेवलपर आम सहमति के माध्यम से केस-बाय-केस आधार पर किए जाते हैं। सबूत आधारित तकनीकी विश्लेषण और बहस क्या बात है, राजनीति या लोकप्रिय राय नहीं है।\n\nविभिन्न आर्क लिनक्स भंडारों में बड़ी संख्या में पैकेज और बिल्ड स्क्रिप्ट उन लोगों के लिए मुफ्त और ओपन सोर्स सॉफ्टवेयर प्रदान करते हैं जो इसे पसंद करते हैं, साथ ही विचारधारा पर कार्यक्षमता को गले लगाने वालों के लिए मालिकाना सॉफ्टवेयर पैकेज भी प्रदान करते हैं।\n\n"
    },
    {
      "title": "उपयोगकर्ता केंद्रीयता",
      "level": 3,
      "content": "जबकि कई जीएनयू/लिनक्स वितरण अधिक उपयोगकर्ता के अनुकूल होने का प्रयास करते हैं, आर्क लिनक्स हमेशा से रहा है, और हमेशा उपयोगकर्ता केंद्रित रहेगा। वितरण के लिए यह योगदान उन लोगों की जरूरतों को भरने के बजाय संभव के रूप में कई उपयोगकर्ताओं के लिए अपील करने की कोशिश कर रहा है। यह कुशल जीएनयू/लिनक्स उपयोगकर्ता, या एक क्या यह अपने आप को रवैया है जो प्रलेखन पढ़ने के लिए तैयार है, और अपनी समस्याओं को हल करने के साथ किसी पर लक्षित है।\n\nसभी उपयोगकर्ताओं को भागीदारी के लिए प्रोत्साहित किया जाता है और वितरण में योगदान। कीड़े रिपोर्टिंग और ठीक करने में मदद अत्यधिक मूल्यवान है और संकुल या कोर परियोजनाओं में सुधार पैच बहुत सराहना कर रहे हैं: आर्क के डेवलपर्स स्वयंसेवक हैं और सक्रिय योगदानकर्ता अक्सर खुद को उस टीम का हिस्सा बनते हुए पाएंगे। 'तीरंदाज' आर्क उपयोगकर्ता भंडार के लिए स्वतंत्र रूप से संकुल का योगदान कर सकते हैं, [मुख्य पृष्ठ में सुधार| आर्चविकी प्रलेखन]], दूसरों को तकनीकी सहायता प्रदान करें या मंचों, मेलिंग सूचियों, या आईआरसी चैनल में राय का आदान-प्रदान करें। आर्क लिनक्स दुनिया भर के कई लोगों के लिए पसंद की ऑपरेटिंग प्रणाली है, और कई अंतरराष्ट्रीय समुदाय मौजूद हैं जो कई अलग-अलग भाषाओं में मदद और दस्तावेज प्रदान करते हैं।\n\n"
    },
    {
      "title": "बहुमुखी प्रतिभा",
      "level": 3,
      "content": "आर्क लिनक्स एक सामान्य उद्देश्य वितरण है। स्थापना पर, केवल एक कमांड-लाइन वातावरण प्रदान किया जाता है: अननीत और अवांछित पैकेजों को फाड़ने के बजाय, उपयोगकर्ता को x86-64 वास्तुकला के लिए आधिकारिक भंडार में प्रदान किए गए हजारों उच्च गुणवत्ता वाले पैकेजों के बीच चयन करके एक कस्टम सिस्टम बनाने की क्षमता की पेशकश की जाती है।\n\nआर्क पैकमैन, एक हल्के, सरल और तेजी से पैकेज प्रबंधक है कि एक आदेश के साथ पूरे सिस्टम को अपग्रेड करने की अनुमति देता है द्वारा समर्थित है । आर्क आर्क बिल्ड सिस्टम, एक बंदरगाहों जैसी प्रणाली भी प्रदान करता है ताकि स्रोत से पैकेज बनाना और स्थापित करना आसान हो सके, जिसे एक कमांड के साथ सिंक्रोनाइज्ड भी किया जा सकता है। इसके अलावा, आर्क उपयोगकर्ता भंडार में मेकपक्ल एप्लिकेशन का उपयोग करके स्रोत से इंस्टॉल करने योग्य पैकेजों को संकलित करने के लिए समुदाय-योगदान पीकेजीबीयूआईएलडी स्क्रिप्ट के कई हजारों शामिल हैं। उपयोगकर्ताओं के लिए आसानी से अपने स्वयं के कस्टम भंडार का निर्माण और रखरखाव करना भी संभव है।\n\n"
    },
    {
      "title": "इतिहास",
      "level": 2,
      "content": "आर्क समुदाय सबसे लोकप्रिय और प्रभावशाली लिनक्स वितरणों में से एक बनने के लिए विकसित और परिपक्व हो गया है, जिसे वर्षों से प्राप्त ध्यान और समीक्षा से भी प्रमाणित किया गया है।\n\nआर्क डेवलपर्स अवैतनिक, अंशकालिक स्वयंसेवक बने रहते हैं, और आर्क लिनक्स के मुद्रीकरण की कोई संभावना नहीं है, इसलिए यह शब्द के सभी अर्थों में मुक्त रहेगा। आर्क के विकास इतिहास के बारे में अधिक विस्तार से जानने के इच्छुक लोग इंटरनेट आर्काइव वेबैक मशीन और आर्क लिनक्स न्यूज आर्काइव में आर्क प्रविष्टि को ब्राउज़ कर सकते हैं।\n\n"
    },
    {
      "title": "शुरूआती साल",
      "level": 3,
      "content": "कनाडा के प्रोग्रामर और सामयिक गिटारवादक जुड विनेट ने 2001 की शुरुआत में आर्क लिनक्स विकसित करना शुरू किया। इसकी पहली औपचारिक रिलीज, आर्क लिनक्स 0.1, 11 मार्च 2002 को हुई थी। स्लैकवेयर, बीएसडी, पीएलडी लिनक्स और सीआरयूएक्स की सुरुचिपूर्ण सादगी से प्रेरित, और फिर भी उस समय पैकेज प्रबंधन की कमी से निराश होकर, विनेट ने उन डिस्ट्रो के समान सिद्धांतों पर अपना वितरण बनाया। लेकिन, उन्होंने पैकेज इंस्टालेशन, रिमूवल और अपग्रेड को स्वचालित रूप से संभालने के लिए पैकमैन नामक एक पैकेज मैनेजमेंट प्रोग्राम भी लिखा।\n\n"
    },
    {
      "title": "मध्य वर्ष",
      "level": 3,
      "content": "प्रारंभिक आर्क समुदाय लगातार बढ़ता गया, जैसा कि फोरम पोस्ट, उपयोगकर्ताओं और बग रिपोर्ट के इस चार्ट से पता चलता है। इसके अलावा, यह अपने शुरुआती दिनों से एक खुले, मैत्रीपूर्ण और मददगार समुदाय के रूप में जाना जाता था।\n\n"
    },
    {
      "title": "आर्कविकी का जन्म",
      "level": 3,
      "content": "08-07-2005 को आर्कविकि को पहली बार मीडियाविकि इंजन पर स्थापित किया गया था।\n\n"
    },
    {
      "title": "ए. ग्रिफिन की उम्र की शुरुआत",
      "level": 3,
      "content": "2007 के अंत में, जुड विनेट एक आर्क डेवलपर के रूप में सक्रिय भागीदारी से सेवानिवृत्त हुए, और सुचारू रूप से बागडोर अमेरिकी प्रोग्रामर आरोन ग्रिफिन को हस्तांतरित कर दी गई, जिसे फ्रैक्चर के नाम से भी जाना जाता है।\n\n"
    },
    {
      "title": "आर्क इंस्टाल स्क्रिप्ट",
      "level": 3,
      "content": "स्थापना छवि के 2012-07-15 के रिलीज ने आर्क इंस्टाल स्क्रिप्ट्स (arch-install-scripts) के पक्ष में मेनू-चालित आर्क इंस्टालेशन फ्रेमवर्क (एआईएफ) को हटा दिया।\n\n"
    },
    {
      "title": "सिस्टमड युग",
      "level": 3,
      "content": "2012 और 2013 के बीच पारंपरिक सिस्टम वी इनिट सिस्टम को सिस्टमड द्वारा बदल दिया गया था।[1][2][3][4]\n\n"
    },
    {
      "title": "I686 समर्थन की गिरावट",
      "level": 3,
      "content": "2017-01-25 को यह घोषित था कि डेवलपर्स और समुदाय के बीच इसकी घटती लोकप्रियता के कारण i686 आर्किटेक्चर के लिए समर्थन को चरणबद्ध रूप से समाप्त कर दिया जाएगा . नवंबर 2017 के अंत तक, सभी i686 पैकेज मिरर से हटा दिए गए थे।\n\n"
    },
    {
      "title": "प्रोजेक्ट लीडर की भूमिका और चुनाव की समीक्षा",
      "level": 3,
      "content": "2020 की शुरुआत में, एक टीम प्रयास में, आर्क लिनक्स के कर्मचारियों ने DeveloperWiki:Project Leader में प्रलेखित, भविष्य के नेताओं को निर्धारित करने के लिए एक नई प्रक्रिया तैयार की।\n\nजैसा कि आरोन ग्रिफिन ने अपनी भूमिका से हटने का फैसला किया था, उन्हें बदलने के लिए एक नए व्यक्ति को चुनने के लिए एक सर्वेक्षण किया गया था, और 2020-02-24 को इसके परिणाम प्रकाशित, लेवेंटे पोलाक के चुनाव को आधिकारिक बनाते हुए।\n\n"
    }
  ]
}