{
  "title": "ArchWiki Translation Team (Polski)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_Translation_Team_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Tłumaczenie tego artykułu lub sekcji nie odzwierciedla oryginalnego tekstu.** Tłumaczenie tego artykułu lub sekcji nie odzwierciedla oryginalnego tekstu.\n\nTłumaczenie tego artykułu lub sekcji nie odzwierciedla oryginalnego tekstu.\n\n"
    },
    {
      "title": "Stwórz nową stronę i jej tłumaczenie",
      "level": 2,
      "content": "1. Jeśli nie wiesz jak edytować strony wiki, przeczytaj Help:Editing (Polski).\n1. Przeczytaj Help:i18n. Strona zawiera wskazówki do internacjonalizacji i lokalizacji ArchWiki.\n1. Zaloguj się, aby edytować wiki.\n1. Wybierz stronę do przetłumaczenia. Możesz użyć funkcji losującej stronę. Dla przykładu wybierzmy Moja Strona.\n1. Idź do wybranej strony i z poziomego meny u góry wybierz przycisk edytuj .\n1. Skopiuj cały tekst źródłowy strony.\n1. Potem odwiedź stronę Moja Strona (język) poprzez wpisanie następującego linku w Twojej przeglądarce: https://wiki.archlinux.org/index.php/Moja_Strona_(język), gdzie język jest nazwą języka.\n1. W przypadki języka polskiego, wpisujemy Polski.\n1. Ponieważ strona nie istnieje, utwórz nowa stronę wybierając utwórz w poziomym menu u góry ekranu.\n1. Ukaże się Wam prosty editor WYSWIG. Tutaj możesz wkleić skopiowane wcześniej tekst źródłowy.\n1. Następnie przetłumacz stronę, sprawdź dokładnie i zapisz.\n1. Jeśli chcemy stworzyć stronę ArchWiki ale ze zlokalizowaną nazwą odwiedź https://wiki.archlinux.org/index.php/Zlokalizowana nazwa przetłumaczonej strony.\n1. Stwórz nową stronę i wrzuć tam ten kod: #REDIRECT [[Moja_Strona_(język)]]\n\n```\n#REDIRECT [[Moja_Strona_(język)]]\n```\n\nNa przykład: Stworzyłem tą ArchWiki Translation Team (Polski) stronę, wrzuciłem do niej tłumaczenie tej strony ArchWiki Translation Team i dodałem stronę Zespół tłumaczy ArchWiki z przetłumaczonym tytułem, która tylko przekierowuje.\n\n"
    }
  ]
}