{
  "title": "ArchWiki (Português)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Help:Edição\n- Help:Estilo\n- Help:Leitura\n\nEsse artigo é uma visão geral do ArchWiki, respondendo as perguntas \"Quem?\", \"O que?\", \"Por que?\" e \"Como?\".\n\n"
    },
    {
      "title": "Objetivos",
      "level": 2,
      "content": "O objetivo primário do ArchWiki é fornecer à comunidade de usuários do Arch Linux a documentação mais compreensiva e mais acessível da web. Esse é um projeto mundial com muitos participantes de todos os cantos do globo. O wiki abraça todos os princípios do Arch Linux, em especial com respeito à simplicidade. ArchWiki está constantemente evoluindo e prospera com a colaboração; há sempre espaço para melhoria.\n\n"
    },
    {
      "title": "Compreensivo",
      "level": 3,
      "content": "Um dos objetivos primários do ArchWiki é cobrir todos os aspectos de computação usando Arch Linux. De centro de mídia ao gerenciamento de redes corporativas, qualquer coisa que o Arch Linux possa alcançar está dentro do escopo do ArchWiki.\n\n"
    },
    {
      "title": "Acessível",
      "level": 3,
      "content": "O objetivo primário do ArchWiki pode ser grandioso e milhares de artigos são exigidos; ArchWiki deve oferecer uma forma simples e intuitiva de acessar todas as informações. Isso não é uma tarefa simples, mas normalmente a ingenuidade de imaginação do Arch vai prevalecer.\n\nO pacote oficial arch-wiki-docs oferece aos usuários a habilidade de baixar uma cópia do conteúdo do ArchWiki. Veja essa discussão de fórum para detalhes.\n\n"
    },
    {
      "title": "Como ele funciona",
      "level": 2,
      "content": "ArchWiki é mantido pela Equipe de Manutenção oficial e milhares de contribuidores. Os usuários editam e organizam artigos para oferecer aos leitores o melhor em documentação do Arch Linux. Os conteúdos são criados pela comunidade, para a comunidade: a maioria dos artigos não são escritos por uma única pessoa, mas representa um esforço cumulativo de muitas pessoas que corrigem informações errôneas, atualizam artigos desatualizados ou então continuam melhorando os conteúdos do ArchWiki.\n\n"
    },
    {
      "title": "Como eu posso ajudar",
      "level": 2,
      "content": "ArchWiki é mantido por voluntários. Contribuidores nunca são numerosos demais e ajuda é sempre necessária. Se você achar ser capaz de editar páginas wiki, considere doar um pouco de seu tempo e energia para a comunidade.\n\nPor favor, veja ArchWiki:Contribuindo para descobrir formas de contribuir.\n\n"
    },
    {
      "title": "História antiga",
      "level": 2,
      "content": "- 2004-01-11 || Uma forma inicial tipo wiki de contribuição de documentação para os fóruns foi anunciada, baseada em uma conta de usuário aberta.\n- 2004-02-03 || A primeira proposta rastreável de uma documentação wiki para o Arch Linux foi feita nos fóruns.\n- 2004-02-27 || O primeiro wiki baseado no PhpWiki foi anunciado nos fóruns.\n- 2005-06-05 || A migração para a instalação atual do MediaWiki foi proposto.\n- 2005-07-08 || O ArchWiki foi configurado no MediaWiki.\n- 2005-07-11 || Primeira edição, feita para o artigo ArchWiki:General disclaimer.\n- 2005-07-11 || Primeira edição no espaço de nome Main, feita para a Página principal.\n- 2005-07-18 || A nova instalação foi anunciada nos fóruns: a migração dos artigos preexistentes da versão PhpWiki então começo.\n\n"
    },
    {
      "title": "Contatos",
      "level": 2,
      "content": "Veja ArchWiki:Equipe de Manutenção para uma lista de coordenadores do ArchWiki.\n\n"
    },
    {
      "title": "Agradecimentos",
      "level": 2,
      "content": "- Hospedagem é graciosamente fornecido pela equipe do Arch Linux\n- Plataforma de MediaWiki\n- Obrigado a todos os nossos contribuidores e apoiadores!\n\n"
    }
  ]
}