{
  "title": "ArchWiki (Suomi)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_(Suomi)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Aiheeseen liittyen\n\n- Help:Editing\n- Help:Style\n- Help:Reading (Suomi)\n\nTämä artikkeli on yleiskatsaus ArchWiki:stä vastaten kysymyksiin \"kuka?\", \"mitä?\", \"miksi?\" ja \"miten?\".\n\n"
    },
    {
      "title": "Tavoitteet",
      "level": 2,
      "content": "Tärkein tavoite ArchWikillä on tarjota Arch Linux käyttäjäyhteisö kaikkein ymmärrettävimmällä helpoimmin saatavilla dokumentaatiolla verkossa. Tämä on maailmanlaajuinen projekti valtavalla määrällä osallistujia eripuolilla maailmaa. Wiki ylistää kaikkia Arch Linux periaatteita, erityisesti yksinkertaisuutta. ArchWiki kehittyy jatkuvasti ja menestyy parhaiten yhteistyöllä; aina on tilaa parannuksille.\n\n"
    },
    {
      "title": "Ymmärrettävä",
      "level": 3,
      "content": "Yksi tärkeimmistä tavotteista ArchWikillä on kattaa kaikki puolet tietojenkäsittelystä käytettäessä Arch Linuxia. Media keskuksesta yritysverkon hallintaa, mitä vain mitä Arch Linux voi saavuttaa on mahdollista myös löytää ArchWikin laajasta skaalasta.\n\n"
    },
    {
      "title": "Saavutettava",
      "level": 3,
      "content": "Tärkein ArchWikin tavoite voi olla suuruisa ja sen saavuttamiseksi vaaditaan tuhansia artikkeleita; ArchWikin täytyy tarjota yksinkertainen ja intuitiivinen tapa päästä käsiksi kaikkeen tietoon. Tämä ei ole yksinkertainen tehtävä, mutta tyypillinen Arch kekseliäisyys ja kuvitteelisuus saa sen taipumaan.\n\nVirallinen arch-wiki-docs paketti antaa käyttäjälle mahdollisuuden ladata kopion ArchWikin sisällöstä. Katso tämä foorumikeskustelu tarkempien yksityiskohtien varalle.\n\n"
    },
    {
      "title": "Miten se toimii",
      "level": 2,
      "content": "ArchWikiä pitää yllä ylläpito ryhmä ja tuhannet osalliset. Osalliset muokkaavat ja organisoivat artikkeleita jotta lukialla on paras saatavilla oleva Arch Linux dokumentaatio. Sisällön luo yhteisö itse itselleen: suurin osa artikkeleista ei ole yhden ihmisen kirjoittamia, mutta onkin yhteistyön tulos useiden käyttäjien lisäyksiä ja korjauksia tai vain päivittelyitä.\n\n"
    },
    {
      "title": "Miten voit auttaa",
      "level": 2,
      "content": "ArchWikiä pidetään yllä vapaaehtoistyöllä. Osallisia ei ikinä ole liikaa ja apua aina tarvitaan. Jos tunnet itsesi kyvylliseksi muokkaamaan wiki-sivuja, harkitse oman aikasi lahjoittamista ja energian käyttöä laajan yhteisön hyväksi.\n\nKäy katsomassa ArchWiki:Contributing ja löydä itsellesi sopiva tapa auttaa ArchWikin yhteisöä.\n\n"
    },
    {
      "title": "Lyhyt historia",
      "level": 2,
      "content": "- 2004-01-11 || Ensimmäinen wiki-tyyppinen julkaisu avoimella käyttäjällä.\n- 2004-02-03 || Ensimmäinen jäljitetty julkinen ehdotus wiki dokumentaatiolle Arch Linuxista foorumeilla.\n- 2004-02-27 || Ensimmäinen wiki perustuen PhpWiki julkaistiin foorumeilla.\n- 2005-06-05 || Nykyiseen muotoonsa yhdistetty MediaWiki asennus ehdotettu.\n- 2005-07-08 || ArchWiki pystytettiin MediaWikiin.\n- 2005-07-11 || Ensimmäinen muokkaus tehtynä ArchWiki:General disclaimer artikkeliin.\n- 2005-07-11 || Ensimmäinen muokkaus pääosaan, tehty sivulle Main page.\n- 2005-07-18 || Uusi asennus julkaistu foorumeilla: valmiiksi olemassa olevien artikkeleiden muutto PhpWikistä aloitettiin.\n\n"
    },
    {
      "title": "Yhteystiedot",
      "level": 2,
      "content": "Katso ArchWiki:Maintenance Team lista ArchWiki koordinaattoreista.\n\n"
    },
    {
      "title": "Kiitokset",
      "level": 2,
      "content": "- Isännöinnin tarjoaa Arch Linux ryhmä\n- Mahdollistaa MediaWiki\n- Suuri kiitos kaikille osallisille ja tukijoille!\n\n"
    }
  ]
}