{
  "title": "Arch Linux (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux, bağımsız bir şekilde geliştirilmiş, x86-64, genel kullanıma uygun bir GNU/Linux dağıtımıdır. Arch, yuvarlanan sürüm modelini takip ederek birçok yazılımın en güncel ve stabil sürümlerini sunmaya gayret eder. Varsayılan kurulum temel ve minimal bir sistem sağlar, sonrasında kullanıcı, amacına yönelik diğer şeyleri ekler.\n\n"
    },
    {
      "title": "Yalınlık (Sadelik)",
      "level": 3,
      "content": "Arch Linux, sadeliği \"gereksiz eklemeler ve değişikliklerin olmaması\" şeklinde tanımlar. Yazılımlar kullanıcıya geliştiricilerinin yayınladığı şekli ile (upstream) sunulur, dağıtıma özgü (aşağı akım yani downstream) değişiklikler oldukça azdır: güncel kodda (upstream) kabul edilmemiş yamalardan kaçınılır. Arch'ın aşağı akım (downstream) yamalarının neredeyse tamamı güncel koddan alınan (backport) ve projenin sonraki sürümünde kullanılmayacak olan hata düzeltmelerinden ibarettir.\n\nBenzer bir şekilde Arch, güncel kod tarafından sağlanan yapılandırma dosyalarını, sistem dosya yollarını ayarlamak gibi dağıtıma özgü sorunları düzeltmekle sınırlı olacak şekilde temin eder. Örneğin bir paket indirildiği için bir servisi etkinleştirmek gibi otomasyon sağlayan özellikler eklemez. Paketler, çok ciddi avantajlar, örneğin disk alanı gibi ciddi bir kaynak ziyanı, söz konusu olduğunda bölünürler. GUI (grafiksel kullanıcı arayüzü) ile yapılandırmaya yardımcı olan araçlar resmî olarak sağlanmaz; bu şekilde kullanıcılar, sistem yapılandırmalarının çoğunu metin düzenleyici ve kabuk (shell) üzerinden yapmaya teşvik edilirler.\n\n"
    },
    {
      "title": "Çağdaşlık",
      "level": 3,
      "content": "Arch Linux, sistemsel paket bozulmaları makul surette önlenebildiği sürece yazılımlarının en güncel ve stabil sürümlerini idame ettirmeye gayret eder. Yuvarlanan sürüm temelli bir sistem olması sebebiyle bir kez indirip devamlı güncelleme alma olanağı sağlar.\n\nArch, GNU/Linux kullanıcılarının yararlanabileceği birçok yeni özelliği içerir. Bunlara başlatma (init) sistemi olarak systemd, modern dosya sistemleri, LVM2, yazılımsal RAID, udev desteği, initcpio (mkinitcpio ile) ve mevcut en güncel çekirdekler de dahildir.\n\n"
    },
    {
      "title": "İşlevselcilik",
      "level": 3,
      "content": "Arch belli bir ideoloji üzerine ortaya çıkmış dağıtımların aksine işlevselliğe dayalı bir dağıtımdır. Bahsedilen ilkeler ise sadece işlevsel önerilerdir. En nihayetinde tasarım kararları, her biri ayrı ayrı değerlendirilecek şekilde, geliştirici oy birliği ile verilir.\n\nÇeşitli Arch Linux depolarındaki birçok paket ve yapım betikleri (build script), tercih edenler için özgür ve açık kaynak kodlu yazılımlar sunmakla birlikte, işlevselliği ideolojiye tercih edenler için özel mülk yazılım paketleri de sunar.\n\n"
    },
    {
      "title": "Kullanıcı merkeziyetçilik",
      "level": 3,
      "content": "Çoğu GNU/Linux dağıtımı daha kullanıcı dostu olmaya çabalarken, Arch Linux hep kullanıcı merkeziyetçi olmuştur ve öyle kalmaya devam edecektir. Arch, olabildiğince çok kullanıcıyı kendine çekmeye çalışmak yerine, ona katkıda bulunanların ihtiyaçlarını karşılamayı hedeflemektedir. Hedeflenen kitle, uzman GNU/Linux kullanıcıları veya kendin yap tutumuna sahip, gerekli dokümanları okuyup kendi sorunlarını çözebilecek kullanıcılardır.\n\nTüm kullanıcıların dağıtıma katkıda bulunması teşvik edilir. Hataların (bugs) bildirilmesi ve çözülmesine yardım edilmesi oldukça kıymetlidir, paketleri veya çekirdek (core) projeleri iyileştiren yamalar takdir edilir: Arch geliştiricileri gönüllülerden oluşur ve aktif olarak katkıda bulunan kişiler genellikle kendilerini takımın bir parçası olarak bulurlar. Archerlar özgürce Arch User Repository'e paket katkısında bulunabilir, ArchWiki dokümantasyonunu iyileştirebilir; forumlarda, posta listesinde veya IRC kanallarında başkalarına teknik destek sağlayabilirler veya fikir alışverişinde bulunabilirler. Arch Linux dünya çapında birçok kullanıcı tarafından tercih edilen bir işletim sistemidir. Birçok farklı dilde dokümantasyon sağlayan ve yardımda bulunan birçok uluslararası topluluğa sahiptir.\n\n"
    },
    {
      "title": "Çok yönlülük",
      "level": 3,
      "content": "Arch Linux her amaca uygun bir dağıtımdır. Kurulum akabinde sadece komut satırı ortamı sağlanır; istenmeyen ve gereksiz paketleri silmekle uğraşmak yerine kullanıcalara, resmî depolar tarafından sunulan ve x86-64 mimarisine uygun yüksek kaliteli binlerce paket ile kendi sistemlerini kurabilme imkânı sunulur.\n\nArch'ın yuvarlanan sürüm modeli pacman ile desteklenir; pacman, hafif, basit ve hızlı bir paket yöneticisidir ve tüm sistemi tek bir komut ile sürekli olarak güncelleme olanağı sağlar. Arch aynı zamanda paketleri kaynaktan derlemeyi ve kurmayı kolaylaştırmak için ports benzeri bir sistem olan Arch Yapım Sistemi'ni sunar. Bu sistem de aynı şekilde tek bir komut ile senkronize edilebilir. Ek olarak, Arch User Repository topluluk tarafından sağlanan kurulabilir paketleri makepkg ile kaynaktan derlemek için binlerce PKGBUILD betiği sağlar. Kullanıcılar aynı zamanda kolayca kendi özel depolarını oluşturup idame ettirebilirler.\n\n"
    },
    {
      "title": "Geçmiş",
      "level": 2,
      "content": "Arch topluluğu büyüyüp olgunlaşmış, en popüler ve etkili Linux dağıtımlarından biri hâline gelmiştir ve yıllar içinde aldığı ilgi ve inceleme de bu konumunu ispatlamıştır.\n\nArch geliştiricleri, bazı istisnalar dışında, maaş ödenmeyen, yarı zamanlı katılımcılardır ve Arch Linux üzerinden gelir elde etmek gibi bir beklentileri yoktur, bu yüzden özgür ve ücretsiz kalacaktır. Arch'ın geliştirilme tarihi hakkında detayları incelemeye meraklı olanlar Internet Archive Wayback Machine'de Arch girdisi ve Arch Linux Haber Arşivi sayfalarını gözden geçirebilir.\n\n"
    },
    {
      "title": "İlk yıllar",
      "level": 3,
      "content": "Judd Vinet, Kanadalı yazılımcı ve ara sıra gitarist, 2002'nin başlarında Arch Linux'u geliştirmeye başlamıştır. İlk resmî yayını Arch Linux 0.1'dir ve 11 Mart 2002'de çıkmıştır. Slackware'in, BSD'nin, PLD Linux'un ve CRUX'un zarif basitliğinden ilham almış ve buna rağmen o zamanlarki paket yönetimi yoksunluğu sebebiyle hayal kırıklığına uğramış olan Vinet, bu dağıtımlar ile benzer ilkelere sahip yeni bir dağıtım oluşturmuştur. Aynı zamanda paketlerin kurulumunu, kaldırılmasını, güncellenmesini ve bağımlılık çözümlenmesini otomatik olarak ele alan pacman adında bir paket yöneticisi yazmıştır.\n\n"
    },
    {
      "title": "Ara yıllar",
      "level": 3,
      "content": "İlk Arch topluluğu forum başlıklarına, kullanıcılara ve hata bildirilerine dair bu grafikte de görülebileceği gibi sabit bir şekilde büyümüştür. Dahası, ilk günlerinden beri açık, arkadaşça ve yardımsever bir topluluk şeklinde anılmıştır.\n\n"
    },
    {
      "title": "ArchWiki'nin doğuşu",
      "level": 3,
      "content": "8.07.2005'te ArchWiki ilk olarak MediaWiki motoru üzerine kurulmuştur.\n\n"
    },
    {
      "title": "A. Griffin döneminin başlangıcı",
      "level": 3,
      "content": "2007'nin sonlarında, Judd Vinet, Arch geliştiricisi olarak aktif katılımda bulunmayı bırakmış ve dizginleri Amerikan yazılımcı, Phrakture olarak da bilinen Aaron Griffin'e sorunsuz bir şekilde transfer etmiştir.\n\n"
    },
    {
      "title": "Arch Kurulum Betikleri",
      "level": 3,
      "content": "15.07.2012'de yayınlanan kurulum imajı, menü temelli Arch Installation Framework (AIF)'ten desteğini çekmiş ve Arch Kurulum Betikleri'ni (arch-install-scripts) kullanmaya başlamıştır.\n\n"
    },
    {
      "title": "systemd dönemi",
      "level": 3,
      "content": "2012-2013 arasında geleneksel System V başlangıç sistemi systemd ile değiştirilmiştir.[1][2][3][4]\n\n"
    },
    {
      "title": "i686 desteğinin çekilmesi",
      "level": 3,
      "content": "25.01.2017'de geliştiriciler arasında ve toplulukta azalan popülaritesi sebebiyle i686 mimarisinden desteğin çekileceği duyurulmuştur. Kasım 2017'nin sonunda tüm i686 paketleri yansımalardan kaldırılmıştır.\n\n"
    },
    {
      "title": "Proje Lideri rolünün gözden geçirilmesi ve seçim",
      "level": 3,
      "content": "2020'nin başında, takım gayretiyle, Arch Linux ekibinin gelecek liderlerini belirleme sürecine başlanmıştır. Bu süreç DeveloperWiki:Project Leader sayfasında belgelenmiştir.\n\nAaron Griffin'in görevinden istifa etmeye karar vermesinden sonra, yeni birinin başa gelmesi için oylama yapılmıştır ve 24.02.2020'de sonuçlar yayınlanmış olup Levente Polyak yetkili olarak seçilmiştir.\n\n"
    },
    {
      "title": "GitLab dönemi",
      "level": 3,
      "content": "2023 Mayıs ayında, Arch Linux paketleme altyapısını GitLab'a taşıdı. Dahili değişiklikler ve yenilikler bir yana, bu değişiklik testing deposunun core-testing ve extra-testing şeklinde, staging deposunun ise core-staging ve extra-staging şeklinde bölünmesi ile sonuçlandı. Son olarak community deposu extra deposu ile birleştirildi. Konu hakkında daha fazla ayrıntı için GitLab blog yazısını okuyun.\n\nAylar sonra, 2023 Kasım ayında, eski hata takipçisi (Flyspray), GitLab'e taşındı ve birlikte çalışma imkanları (hata bildirimleri ve kod katkıları) halka açıldı. Arşivleme amacıyla eski hata takipçisinin statik bir kopyası bulunmaktadır, bu şekilde bazı hata bağlantıları (örneğin FS#56716) da geçerliliğini korur.\n\n"
    }
  ]
}