{
  "title": "Arch Linux (Polski)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux jest niezależnie rozwijaną dystrybucją GNU/Linux x86-64 ogólnego zastosowania, która stara się dostarczać najnowsze stabilne wersje większości oprogramowania poprzez utrzymywanie modelu rolling-release. Domyślna instalacja jest minimalną podstawą systemu operacyjnego skonfigurowaną przez użytkownika, tak aby dodać tylko to, co jest od niego celowo wymagane.\n\n"
    },
    {
      "title": "Prostota",
      "level": 3,
      "content": "Arch Linux opisuje prostotę jako bez zbędnych dodatków i modyfikacji. Arch dostarczany jest z oprogramowaniem takie jakie zostało wydane przez ich oryginalnych twórców (upstream) z minimalnymi zależnymi od dystrybucji (downstream) zmianami: łatki nie akceptowane przez upstream są unikane, a łatki downstream składają się prawie w całości z backportowanych bug fixów, które są przestarzałe w następnym wydaniu projektu.\n\nW podobnej odsłonie Arch dostarcza pliki konfiguracyjne zapewnione przez upstream ze zmianami ograniczonymi jedynie do problemów zależnych od dystrybucji, np. poprawy ścieżek plików systemowych. Arch nie dodaje automatycznych funkcji tj. uruchamianie serwisu od razu po jego zainstalowaniu. Pakiety są podzielone tylko gdy jest to bardzo korzystne, np. oszczędzanie miejsca na dysku w szczególnie złych przypadkach zmarnowania pamięci. Arch nie posiada graficznych narzędzi konfiguracji, aby zachęcić użytkowników do dokonywania większości konfiguracji systemu z poziomu powłoki lub poprzez używanie edytora tekstowego.\n\n"
    },
    {
      "title": "Nowoczesność",
      "level": 3,
      "content": "Arch Linux stara się zapewnić najnowsze stabilne wydanie wersji oprogramowania, gdy tylko jest pewność, że nie mają one złego wpływu na działanie reszty systemu. Arch bazuje na systemie typu rolling-release, który pozwala na jedną instalację z dalszymi aktualizacjami.\n\n"
    },
    {
      "title": "Pragmatyzm",
      "level": 3,
      "content": "Arch jest raczej pragmatyczną dystrybucją niż ideologiczną. Zasady są jedynie przydatnymi wskazówkami. Decyzje projektu są podejmowane indywidualnie w oparciu o konsensus deweloperów. Techniczna analiza oparta o dowody oraz debaty są tym czym się liczą, a nie polityka czy popularna opinia.\n\nDuża liczba pakietów i skryptów budowania w różnych repozytoriach Arch Linux oferują darmowe i otwartoźródłowe oprogramowanie, dla tych, którzy wolą wolność, jak również zastrzeżone oprogramowanie dla tych, którzy popierają funkcjonalność nad ideologię.\n\n"
    },
    {
      "title": "Skupienie na użytkowniku",
      "level": 3,
      "content": "Mając na uwadze to, że większość dystrybucji GNU/Linux próbuje być bardziej przyjaznym dla użytkownika, Arch Linux zawsze był i powinien zostać skupiony na użytkowniku. Arch zamierzony jest do spełniania potrzeb tych, których wnoszą w niego wkład zamiast przyciągać jak najwięcej użytkowników jak to możliwe. Przeznaczony jest dla biegłego użytkownika GNU/Linux lub każdego z postawą zrób-to-sam, który jest chętny do przeczytania dokumentacji i rozwiązywania swoich własnych problemów.\n\nWszyscy użytkownicy zachęcani są do wzięcia udziału i wnoszenia wkładu do dystrybucji. Zgłaszanie oraz pomaganie w naprawach bugów jest wysoce doceniane oraz łatki poprawiające pakiety lub projekty rdzenia są bardzo cenione: Deweloperzy Archa są wolontariuszami i aktywnymi współpracownikami oraz zdają sobie sprawę z bycia częścią drużyny. Archerzy mogą wolno dostarczać pakiety do Repozytorium Użytkowników Archa, ulepszyć dokumentację ArchWiki, dostarczać techniczne wsparcie dla innych lub wymieniać się opiniami na forum, listach mailowych lub kanałach IRC. Arch Linux jest wyborem systemu operacyjnego przez wiele osób na całym się świecie oraz istnieje kilka międzynarodowych społeczności oferujące pomoc oraz zapewniają dokumentację w wielu różnych językach.\n\n"
    },
    {
      "title": "Wszechstronność",
      "level": 3,
      "content": "Arch Linux jest dystrybucją ogólnego zastosowania. Od instalacji zapewnione jest jedynie środowisko wiersza poleceń; zamiast instalowania niepotrzebnych i niechcianych pakietów, użytkownik ma możliwość zbudowania niestandardowego systemu spośród tysięcy wysokiej jakości pakietów dostępnych w oficjalnych repozytoriach dla architektury x86-64 .\n\nArch jest modelem rolling-release wspieranym przez pacman, lekki, prosty i szybki menedżer pakietów, pozwalający na nieprzerwane aktualizowanie całego systemu jedną komendą. Arch również dostarcza system budowania Archa - system ułatwiający budowanie oraz instalowanie pakietów ze źródła, który również mogą być synchonizowane jedną komendą. Dodatkowo, Repozytorium Użytkowników Archa zawiera tysiące wniesione przez społeczność skrypty PKGBUILD do kompilacji instalowalnych pakietów ze źródła przez użycie aplikacji makepkg. Poza tym, użytkownicy mogą z łatwością tworzyć swoje własne repozytoria.\n\n"
    },
    {
      "title": "Historia",
      "level": 2,
      "content": "Społeczność Arch rozrosła się o dojrzała do zostania jedną z najbardziej popularnych i influencyjnych dystrybucji Linuksa, o czym świadczy uwaga i recenzja otrzymywana przez lata.\n\nDeweloperzy Archa są bezpłatynymi, niepełnoetatowymi wolontariuszami. Arch Linux nie powstał z myślą na zarabianie, ale jako wolny i darmowy system. Dla ciekawych historii rozwoju Archa można przejrzeć wpis Archa na Internet Archive Wayback Machine oraz Archiwum Nowości Arch Linux.\n\n"
    },
    {
      "title": "Wczesne lata",
      "level": 3,
      "content": "Judd Vinet, kanadyjski programista i okazjonalny gitarzysta zaczął pracować nad Arch Linux w 2001. Jego pierwsze formalne wydanie, Arch Linux 0.1, ukazało się 11 marca 2002. Inspirowany przez elegancką prostotę Slackware, BSD, PLD Linux i CRUX oraz zawiedziony brakiem sposobu zarządzania pakietów w ubiegłym czasie, Vinet zbudował swoją własną dystrybucję na podobnych zasadach do powyższych dystrybucji. Ale napisał również program zarządzania pakietami o nazwie pacman, żeby automatycznie obsługiwał rozwiązywania zależności pakietów, instalacje, usuwanie oraz aktualizacje.\n\n"
    },
    {
      "title": "Środkowe lata",
      "level": 3,
      "content": "Wczesna społeczność Archa rosła stabilnie jak udowadnia ten wykres postów na forum. użytkowników oraz zgłoszeń błędów. Ponadto, początkowo znana było jako otwarta, przejazna oraz pomocna społeczność.\n\n"
    },
    {
      "title": "Narodziny ArchWiki",
      "level": 3,
      "content": "Od 2005-07-08 zaczęła funkcjonować ArchWiki założona na silniku MediaWiki.\n\n"
    },
    {
      "title": "Świt wieku A. Griffin",
      "level": 3,
      "content": "W 2007 roku, Judd Vinet odszedł od aktywnego uczestniczenia jako deweloper Archa i płynnie przeniósł stery w ręce amerykańskiego programisty Aaron'a Griffin'a, znanego również jako Phrakture.\n\n"
    },
    {
      "title": "Arch Install Scripts",
      "level": 3,
      "content": "Wydanie medium instalacyjnego z 2012-07-15 wycofało napędzane przez menu Arch Installation Framework (AIF) na rzecz Arch Install Scripts (arch-install-scripts).\n\n"
    },
    {
      "title": "Era systemd",
      "level": 3,
      "content": "Pomiędzy 2012, a 2013 rokiem tradycyjny init - System V został zastąpiony przez systemd. [1][2][3][4]\n\n"
    },
    {
      "title": "Koniec wsparcia i686",
      "level": 3,
      "content": "25 stycznia 2017 roku zostało ogłoszone, że wsparcie architektury i686 zostanie zakończone ze względu na malejącą popularność wśród deweloperów i społeczności. Pod koniec listopada 2017, wszystkie pakiety i686 zostały usunięte z mirrorów.\n\n"
    },
    {
      "title": "Lider Projektu",
      "level": 3,
      "content": "Na początku 2020 roku zespół Arch Linux opracował nowy sposób określania przyszłych liderów udokumentowany w DeveloperWiki:Project Leader.\n\nJako że, Aaron Griffin zdecydował zejść ze swojej roli, przeprowadzono głosowanie, które miało zadecydować wybór nowej osoby na jego miejsce. 24 lutego 2020 wyniki głosowania zostały opublikowane i sprawiły, że nowym liderem został Levente Polyak.\n\n"
    },
    {
      "title": "Era GitLab",
      "level": 3,
      "content": "W maju 2023 roku Arch Linux przeniósł swoją infrastrukturę pakowania do GitLab. Oprócz wewnętrznych zmian i innowacji, spowodowało to również podział repozytorium testing na core-testing i extra-testing, repozytorium staging na core-staging i extra-staging, a wreszcie community zostało połączone w extra. Więcej szczegółów można znaleźć na blogu na GitLab.\n\nKilka miesięcy później, w listopadzie 2023 roku, stary tracker błędów (Flyspray) został przeniesiony do GitLab, a jego funkcje współpracy (zgłoszenia i prośby o scalenie) zostały otwarte dla publiczności. Ze względów archiwizacyjnych zostanie zachowana statyczna kopia starego bug trackera, aby linki (na przykład losowo wybrany FS#56716) były nadal aktualne.\n\n"
    }
  ]
}