{
  "title": "Arch Linux (العربية)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "آرش لينكس هو توزيعة مستقلة، لمعمارية x86-64، عامة الغرض، ويعمل بنظام GNU/Linux، يسعى لتوفير أحدث الإصدارات الثابتة لمعظم البرمجيات عن طريق اتباع نموذج الإصدار المستمر rolling-release. التثبيت الافتراضي هو نظام أساسي بحد أدنى من المواصفات، يتم تكوينه من قبل المستخدم لإضافة ما هو مطلوب فقط.\n\n"
    },
    {
      "title": "البساطة",
      "level": 3,
      "content": "تعرف آرش لينكس البساطة على أنها \"بدون إضافات أو تعديلات غير ضرورية\". يتم شحن البرمجيات كما يتم إصدارها من قبل المطورين الأصليين (المصدر) مع تغييرات توزيعية دنيا (تحتية): يتم تجنب الباتشات التي لم يتم قبولها من قبل المصدر، وتتكون معظم باتشات آرش التحتية تقريبًا من إصلاحات الأخطاء التي تم توقيتها بواسطة الإصدار التالي للمشروع.\n\nبنفس الطريقة، يتم شحن ملفات التكوين configuration files المقدمة من قبل المصدر بتغييرات محدودة لمشاكل تتعلق بالتوزيعة مثل ضبط مسارات ملف النظام. لا يتم إضافة ميزات الأتمتة مثل تمكين الخدمة فقط لأن الحزمة تم تثبيتها. يتم تقسيم الحزم فقط عندما تكون هناك مزايا مقنعة، مثل توفير مساحة القرص في حالات سيئة جدًا من الهدر. لا يتم توفير أدوات تكوين رسومية بشكل رسمي، مما يشجع المستخدمين على أداء معظم تكوين النظام من خلال واجهة الشاشة shell ومحرر النصوص.\n\n"
    },
    {
      "title": "الحداثة",
      "level": 3,
      "content": "تسعى آرش لينكس للحفاظ على أحدث إصدارات البرامج الثابتة طالما يمكن تجنب كسر الحزم بشكل معقول. يستند إلى نظام إصدار مستمر، مما يتيح التثبيت مرة واحدة مع التحديثات المستمرة.\n\nتضم آرش العديد من الميزات الجديدة المتاحة لمستخدمي GNU/Linux، بما في ذلك نظام التشغيل systemd، وأنظمة الملفات الحديثة، LVM2، RAID البرمجيات، دعم udev وinitcpio (مع mkinitcpio)، بالإضافة إلى أحدث النوى المتاحة.\n\n"
    },
    {
      "title": "الواقعية",
      "level": 3,
      "content": "آرش هو توزيعة واقعية عملية وليس توزيعة أيديولوجية متعصبة. المبادئ هنا هي إرشادات مفيدة فقط. في النهاية، يتم اتخاذ قرارات التصميم حالة بحالة من خلال اتفاق المطورين. التحليل الفني القائم على الأدلة والنقاش هو ما يهم، ليس السياسة أو الرأي الأكثر شعبية.\n\nيقدم العدد الكبير من الحزم وسكربتات البناء في مختلف مستودعات آرش لينكس برمجيات مجانية ومفتوحة المصدر لأولئك الذين يفضلونها، وكذلك حزم البرمجيات الخاصة بالمنافع لأولئك الذين يتقبلون الوظائف فوق الأيديولوجيا.\n\n"
    },
    {
      "title": "تركيز المستخدم",
      "level": 3,
      "content": "في حين أن العديد من توزيعات GNU/Linux تحاول أن تكون أكثر \"سهولة للاستخدام\"، فإن آرش لينكس كان دائمًا، وسيظل دائمًا \"محورًا على المستخدم\". تهدف التوزيعة إلى تلبية احتياجات أولئك الذين يساهمون فيه، بدلاً من محاولة جذب أكبر عدد ممكن من المستخدمين. يستهدف المستخدم الماهر في GNU/Linux، أو أي شخص لديه مبدء \"افعل ذلك بنفسك do-it-yourself\" الذي يكون على استعداد لقراءة الوثائق وحل مشاكله بنفسه.\n\nيتم تشجيع جميع المستخدمين على المشاركة والمساهمة في التوزيعة. إبلاغ الأخطاء ومساعدة في حل الأخطاء يُقدر بشدة، وتقديم التصحيحات التي تحسن الحزم أو الأساس المشاريع تُقدر كثيرًا: المطورون في آرش هم متطوعون والمساهمون النشطون غالبًا ما سيجدون أنفسهم يصبحون جزءًا من تلك الفرق. يمكن لـ \"آرتشرز Archers\" المساهمة بحرية في تقديم الحزم إلى Arch User Repository، تحسين الوثائق في ArchWiki، تقديم المساعدة الفنية للآخرين أو تبادل الآراء فقط في المنتديات، القوائم البريدية، أو IRC channels. آرش لينكس هو نظام التشغيل الأساسي للعديد من الأشخاص في جميع أنحاء العالم، وهناك العديد من المجتمعات الدولية التي تقدم المساعدة وتوفر الوثائق بلغات مختلفة.\n\n"
    },
    {
      "title": "التنوع",
      "level": 3,
      "content": "آرش لينكس هو توزيعة عامة. عند التثبيت، يتم توفير بيئة سطر أوامر فقط؛ بدلاً من إزالة الحزم غير المطلوبة وغير المرغوب فيها، يتم تقديم القدرة على بناء نظام مخصص عن طريق اختيار بين الآلاف من الحزم ذات الجودة العالية المقدمة في المستودعات الرسمية للمعمارية x86-64.\n\nآرش هو نموذج إصدار مستمر يدعمه باكمان، وهو مدير حزم خفيف وبسيط وسريع يسمح بترقية النظام بأكمله بشكل مستمر بأمر واحد. كما يوفر آرش أيضًا نظام بناء آرش، وهو نظام مشابه للمنافذ لتسهيل بناء وتثبيت الحزم من المصدر، والذي يمكن مزامنته أيضًا بأمر واحد. بالإضافة إلى ذلك، يحتوي \"مستودع المستخدم آرش\" على العديد من آلاف السكربتات PKGBUILD المساهمة من قبل المجتمع لتجميع الحزم التي يمكن تثبيتها من المصدر باستخدام تطبيق makepkg. كما أنه من الممكن للمستخدمين بناء وصيانة مستودعاتهم المخصصة بسهولة.\n\n"
    },
    {
      "title": "التاريخ",
      "level": 2,
      "content": "نمى ونضج مجتمع آرش ليصبح واحد من أكثر توزيعات لينكس شهرة وتأثيرًا، كما يشهد عليها الاهتمام والمراجعات التي تلقاها على مر السنين.\n\nيظل مطورو آرش غير مدفوعين، ومتطوعين بدوام جزئي، ولا توجد احتمالات لتحويل آرش لينكس إلى مصدر للربح، لذا ستبقى حرة في بكل معنى للكلمة. يمكن لأولئك الفضوليين الاطلاع على المزيد من التفاصيل حول تاريخ تطوير آرش من خلال تصفح مدخل آرش في آرشيف وايباك وأرشيف أخبار آرش لينكس.\n\n"
    },
    {
      "title": "السنوات الأولى",
      "level": 3,
      "content": "بدأ جاد فينيت، مبرمج كندي وعازف غيتار بالمناسبة، في تطوير آرش لينكس في بداية عام 2001. أصدرت أول إصدار رسمي له، آرش لينكس 0.1، في 11 مارس 2002. مستوحاة من البساطة الأنيقة لـ Slackware و BSD و PLD Linux و CRUX، ومع ذلك كان يشعر بخيبة أمل من عدم وجود إدارة حزم في ذلك الوقت، بنى فينيت توزيعه الخاص على مبادئ مماثلة لتلك التوزيعات. لكنه أيضًا كتب برنامج إدارة حزم يسمى باكمان، للتعامل تلقائيًا مع تسوية الاعتمادية، والتثبيت، والإزالة، والترقيات.\n\n"
    },
    {
      "title": "السنوات الوسطى",
      "level": 3,
      "content": "نما مجتمع آرش المبكر بثبات، كما يشير إليه مخطط المشاركات في المنتدى، والمستخدمين، والتقارير عن الأخطاء. علاوة على ذلك، كان معروفًا منذ أيامه الأولى كمجتمع مفتوح، وودود، ومفيد.\n\n"
    },
    {
      "title": "ميلاد ويكي آرش",
      "level": 3,
      "content": "في 08-07-2005 أُنشأت ويكي آرش لأول مرة على محرك ميدياويكي.\n\n"
    },
    {
      "title": "فجر عصر A. Griffin",
      "level": 3,
      "content": "في أواخر عام 2007، اعتزل جاد فينيت المشاركة الفعالة كمطور آرش، وأحال بسلاسة الزمام إلى المبرمج الأمريكي آرون جريفين، المعروف أيضًا باسم فراكتور.\n\n"
    },
    {
      "title": "سكربتات تثبيت آرش",
      "level": 3,
      "content": "في 15-07-2012، تم إيقاف إطار تثبيت آرش الموجه بالقوائم (AIF) لصالح سكربتات تثبيت آرش (arch-install-scripts).\n\n"
    },
    {
      "title": "عصر systemd",
      "level": 3,
      "content": "بين عامي 2012 و 2013، تم استبدال نظام التشغيل الأصلي للنظام (System V init system) بنظام systemd. [١][٢][٣][٤].\n\n"
    },
    {
      "title": "إسقاط دعم i686",
      "level": 3,
      "content": "في 25-01-2017 تم الإعلان عن خطة تدريجية لإسقاط دعم معمارية i686 بسبب تناقص شعبيتها بين المطورين والمجتمع. بحلول نهاية نوفمبر 2017، تمت إزالة جميع الحزم i686 من المرايا mirrors.\n\n"
    },
    {
      "title": "مراجعة دور قائد المشروع والانتخابات",
      "level": 3,
      "content": "في بداية عام 2020، في جهد جماعي، وضع موظفو آرش لينكس عملية جديدة لتحديد القادة المستقبليين، موثقة في DeveloperWiki:Project Leader.\n\nنظرًا لأن آرون جريفين قرر الاستقالة من دوره، تم إجراء استفتاء لانتخاب شخص جديد ليحل محله، وفي 24-02-2020 نشرت نتائجه، مما يجعل انتخاب ليفينتي بولياك رسميًا.\n\n"
    },
    {
      "title": "عصر GitLab",
      "level": 3,
      "content": "في مايو 2023، قامت آرش لينكس بترحيل بنيتها الخاصة بالتحزيم packaging إلى GitLab. بالإضافة إلى التغييرات والابتكارات الداخلية، أدى ذلك أيضًا إلى تقسيم مستودع \"الاختبار\" إلى \"core-testing\" و\"extra-testing\"، ومستودع \"staging\" إلى \"core-staging\" و\"extra-staging\"، وأخيرًا تم دمج \"community\" في \"extra\". اقرأ المزيد من التفاصيل على مدونة GitLab.\n\nبعد عدة أشهر، في نوفمبر 2023، تمت هجرة المتتبع القديم (Flyspray) إلى GitLab وفتح ميزات التعاون الخاصة به (المشاكل issues وطلبات الاندماج merge requests) للجمهور. لأسباب الأرشفة ستكون هناك نسخة ثابتة من المتتبع القديم بحيث تظل الروابط (على سبيل المثال، FS#56716) سارية.\n\n"
    }
  ]
}