{
  "title": "Arch Linux (فارسی)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(%D9%81%D8%A7%D8%B1%D8%B3%DB%8C)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "توزیع آرچ لینوکس به صورت مستقل توسعه یافته و برای معماری x86-64 طراحی شده است. این توزیع عمومی گنو/لینوکس با پیروی از مدل انتشار غلتان، تلاش می‌کند تا جدیدترین نسخه‌های پایدار اکثر نرم‌افزارها را فراهم کند. نصب پیش‌فرض این توزیع شامل یک سیستم پایه حداقلی است که توسط خود کاربر برای افزودن موارد مورد نیاز، پیکربندی می‌شود.\n\n"
    },
    {
      "title": "سادگی",
      "level": 3,
      "content": "آرچ لینوکس سادگی را به معنای «بدون اضافات یا تغییرات غیرضروری» تعریف می‌کند. نرم‌افزارها به همان شکلی که توسط توسعه‌دهندگان اصلی (upstream) منتشر شده‌اند، با حداقل تغییرات اختصاصی توزیع (downstream) ارائه می‌شوند: پچ‌هایی که توسط توسعه‌دهندگان اصلی پذیرفته نمی‌شوند، اجتناب می‌شود و پچ‌های اختصاصی آرچ تقریبا به‌طور کامل از اصلاحات رفع اشکال با برگرداندن به نسخه قبلی تشکیل شده‌اند که با نسخه بعدی پروژه قدیمی می‌شوند.\n\nبه‌طور مشابه، آرچ فایل‌های پیکربندی ارائه شده توسط توسعه‌دهندگان اصلی را با تغییرات محدود به مسائل اختصاصی توزیع مانند تنظیم مسیرهای فایل سیستم ارائه می‌دهد. این توزیع ویژگی‌های خودکاری مانند فعال کردن یک سرویس تنها به دلیل نصب بسته را اضافه نمی‌کند. بسته‌ها تنها در مواردی که مزایای قانع‌کننده‌ای وجود دارد، مانند صرفه‌جویی در فضای دیسک در موارد به‌خصوص شدید از اتلاف، تقسیم می‌شوند. ابزارهای پیکربندی گرافیکی به‌طور رسمی ارائه نمی‌شوند و کاربران تشویق می‌شوند تا بیشتر پیکربندی سیستم را از طریق shell و یک ویرایشگر متنی انجام دهند.\n\n"
    },
    {
      "title": "مدرنیته",
      "level": 3,
      "content": "آرچ لینوکس تلاش می‌کند تا آخرین نسخه‌های پایدار نرم‌افزارهای خود را حفظ کند و از خرابی‌های سیستمی بسته‌ها به حداقل ممکن جلوگیری کند. این توزیع بر اساس سیستم انتشار غلتان ساخته شده است که امکان یک بار نصب با ارتقاء مداوم را فراهم می‌کند.\n\nآرچ شامل بسیاری از ویژگی‌های جدید موجود برای کاربران گنو/لینوکس است، از جمله سیستم init systemd، فایل سیستم‌های مدرن، LVM2، RAID نرم‌افزاری، پشتیبانی از udev و initcpio (با mkinitcpio)، و همچنین آخرین نسخه‌های کرنل موجود.\n\n"
    },
    {
      "title": "عمل‌گرایی",
      "level": 3,
      "content": "آرچ یک توزیع عمل‌گرا است نه ایدئولوژیک. اصول آن تنها راهنماهای مفید هستند. در نهایت، تصمیمات طراحی به صورت موردی و از طریق توافق توسعه‌دهندگان انجام می‌شود. تحلیل فنی مبتنی بر شواهد و بحث‌ها مهم هستند، نه سیاست یا نظر عمومی.\n\nتعداد زیادی از بسته‌ها و اسکریپت‌های ساخت در مخازن مختلف آرچ لینوکس نرم‌افزارهای آزاد و متن‌باز را برای کسانی که آن را ترجیح می‌دهند، و همچنین بسته‌های نرم‌افزاری اختصاصی را برای کسانی که عملکرد را بر ایدئولوژی ترجیح می‌دهند، ارائه می‌دهند.\n\n"
    },
    {
      "title": "تمرکز بر کاربران",
      "level": 3,
      "content": "در حالی که بسیاری از توزیع‌های گنو/لینوکس تلاش می‌کنند تا بیشتر «کاربرپسند» باشند، آرچ لینوکس همواره «کاربرمحور» بوده و خواهد ماند. این توزیع برای پاسخگویی به نیازهای کسانی که به آن کمک می‌کنند طراحی شده است، نه به منظور جلب توجه هرچه بیشتر کاربران. این توزیع برای کاربران حرفه‌ای گنو/لینوکس یا هر کسی با روحیه \"خودت انجام بده\" که مایل به خواندن مستندات و حل مشکلات خود باشد، هدف‌گذاری شده است.\n\nهمه کاربران تشویق می‌شوند که مشارکت کنند و به توزیع کمک کنند. گزارش و کمک به رفع اشکالات بسیار مورد ارزش است و پچ‌هایی که بسته‌ها یا پروژه‌های اصلی را بهبود می‌بخشند بسیار تقدیر می‌شوند: توسعه‌دهندگان آرچ داوطلب هستند و مشارکت‌کنندگان فعال اغلب خود را به عنوان بخشی از تیم می‌بینند. کاربران می‌توانند به صورت آزادانه بسته‌ها را به مخزن کاربران آرچ اضافه کنند، مستندات آرچ ویکی را بهبود بخشند، به دیگران کمک فنی کنند یا در انجمن‌ها، forums, فهرست‌های پستی یا کانال‌های IRC به تبادل نظر بپردازند. آرچ لینوکس سیستم‌عامل انتخابی بسیاری از مردم در سراسر جهان است و چندین اجتماع بین‌المللی وجود دارند که در کمک و ارائه مستندات به زبان‌های مختلف مشارکت می‌کنند.\n\n"
    },
    {
      "title": "چند منظوره بودن",
      "level": 3,
      "content": "آرچ لینوکس یک توزیع عمومی است. پس از نصب، تنها یک محیط خط فرمان ارائه می‌شود؛ به جای حذف بسته‌های غیرضروری و ناخواسته، به کاربر این امکان داده می‌شود تا یک سیستم سفارشی بسازد با انتخاب از میان هزاران بسته با کیفیت بالا که در مخازن رسمی برای معماری x86-64 ارائه شده‌اند.\n\nآرچ از مدل انتشار غلتان پشتیبانی می‌کند که توسط pacman پشتیبانی می‌شود، یک مدیر بسته سبک، ساده و سریع که امکان ارتقاء مداوم کل سیستم با یک فرمان را فراهم می‌کند. آرچ همچنین سیستم ساخت آرچ را فراهم می‌کند، یک سیستم مانند پورت که ساخت و نصب بسته‌ها از منبع را آسان می‌کند و با یک فرمان قابل همگام‌سازی است. علاوه بر این، مخزن کاربران آرچ حاوی هزاران اسکریپت PKGBUILD مشارکت‌کنندگان اجتماع برای کامپایل بسته‌های قابل نصب از منبع با استفاده از برنامه makepkg است. همچنین امکان ساخت و نگهداری مخازن سفارشی توسط کاربران با سهولت وجود دارد.\n\n"
    },
    {
      "title": "تاریخچه",
      "level": 2,
      "content": "اجتماع آرچ به مرور زمان رشد کرده و به یکی از محبوب‌ترین و تاثیرگذارترین توزیع‌های لینوکس تبدیل شده است که توجه و بررسی‌های زیادی را در طول سال‌ها دریافت کرده است.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nتوسعه‌دهندگان آرچ همچنان داوطلبان بدون حقوق و پاره‌وقت هستند و هیچ چشم‌اندازی برای پولی‌سازی آرچ لینوکس وجود ندارد، بنابراین این توزیع در تمامی معانی کلمه رایگان/آزاد خواهد ماند.\n\nافرادی که مایل به بررسی جزئیات بیشتر درباره تاریخچه توسعه آرچ هستند، می‌تواننددر بایگانی اینترنت Wayback Machine و بایگانی اخبار آرچ لینوکس را مرور کنند.\n\n"
    },
    {
      "title": "سال‌های اولیه",
      "level": 3,
      "content": "جاد وینت، یک برنامه‌نویس کانادایی و گیتاریست گهگاهی، توسعه آرچ لینوکس را در اواخر سال ۱۳۷۹ آغاز کرد. اولین نسخه رسمی آن، Arch Linux 0.1، در تاریخ ۲۰ اسفند ۱۳۸۰ منتشر شد. با الهام از سادگی زیبا Slackware، BSD، PLD Linux و CRUX، و با این وجود ناامید از عدم وجود مدیریت بسته در آن زمان، Vinet توزیع خود را بر اساس اصول مشابه آن توزیع‌ها ساخت. اما، او همچنین یک برنامه مدیریت بسته به نام pacman نوشت که به‌طور خودکار به مدیریت وابستگی‌های بسته، نصب، حذف و ارتقاء بسته‌ها می‌پرداخت.\n\n"
    },
    {
      "title": "سال‌های میانی",
      "level": 3,
      "content": "اجتماع آرچ از ابتدا به‌طور پیوسته رشد کرد، که این رشد در این نمودار از پست‌های انجمن، کاربران و گزارش‌های اشکال قابل مشاهده است. علاوه بر این، از روزهای اولیه خود به عنوان یک اجتماع باز، دوستانه و مفید شناخته می‌شد.\n\n"
    },
    {
      "title": "تولد آرچ ویکی",
      "level": 3,
      "content": "در تاریخ ۱۷ تیر ۱۳۸۴، آرچ ویکی برای اولین بار بر روی موتور MediaWiki راه‌اندازی شد.\n\n"
    },
    {
      "title": "آغاز دوران آرون گریفین",
      "level": 3,
      "content": "در مهر مال سال ۱۳۸۶، جاد وینت از مشارکت فعال به عنوان یک توسعه‌دهنده آرچ بازنشسته شد و به آرامی کنترل پروژه را به برنامه‌نویس آمریکایی، آرون گریفین، معروف به Phrakture منتقل کرد.\n\n"
    },
    {
      "title": "اسکریپت‌های نصب آرچ",
      "level": 3,
      "content": "در انتشار تصویر نصب ۲۵ تیر ۱۳۹۱، چارچوب نصب مبتنی بر منو «Arch Installation Framework» (AIF) کنار گذاشته شد و به جای آن از «Arch Install Scripts» (arch-install-scripts) استفاده شد.\n\n"
    },
    {
      "title": "دوره systemd",
      "level": 3,
      "content": "بین سال‌های 2012 و 2013، سیستم init سنتی System V با systemd جایگزین شد.[1][2][3][4]\n\n"
    },
    {
      "title": "کنار گذاشتن پشتیبانی از i686",
      "level": 3,
      "content": "در تاریخ ۶ بهمن ۱۳۹۵، اعلام شد که پشتیبانی از معماری i686 به دلیل کاهش محبوبیت آن در میان توسعه‌دهندگان و اجتماع به تدریج کنار گذاشته خواهد شد. تا پایان آذر ماه ۱۳۹۶، همه بسته‌های i686 از میرور‌ها حذف شدند.\n\n"
    },
    {
      "title": "بررسی نقش رهبر پروژه و انتخابات",
      "level": 3,
      "content": "در اواخر سال ۱۳۹۸، با تلاش گروهی، کارکنان آرچ لینوکس یک فرآیند جدید برای تعیین رهبران آینده طراحی کردند که در DeveloperWiki:Project Leader مستند شده است.\n\nاز آنجایی که آرون گریفین تصمیم گرفته بود از سمت خود کناره گیری کند، نظرسنجی برای انتخاب فرد جدیدی برای جایگزینی او برگزار شد و در تاریخ ۵ اسفند ۱۳۹۸ نتایج آن منتشر شد و انتخاب لونته پولیاک رسمی شد.\n\n"
    },
    {
      "title": "دوران گیت‌لب",
      "level": 3,
      "content": "در اردیبهشت ماه ۱۴۰۲، آرچ لینوکس زیرساخت packaging خود را به گیت‌لب مهاجرت داد. علاوه بر تغییرات و نوآوری‌های داخلی، این امر همچنین منجر به تقسیم مخزن testing به core-testing و extra-testing، مخزن staging به core-staging و extra-staging و در نهایت ادغام community در extra شد. جزئیات بیشتر را در وبلاگ گیت‌لب بخوانید.\n\nچند ماه بعد، در آبان ۱۴۰۲، سیستم ردیابی باگ قدیمی (Flyspray) به گیت‌لب مهاجرت کرد و ویژگی‌های همکاری آن (ایشوها و درخواست‌های ادغام) برای عموم آزاد شد. به دلایل بایگانی، یک کپی استاتیک از سیستم ردیابی باگ قدیمی وجود خواهد داشت تا لینک‌ها (به عنوان مثال FS#56716 که به صورت تصادفی انتخاب شده است) همچنان معتبر باشند.\n\n"
    }
  ]
}