{
  "title": "Archinstall (Português)",
  "url": "https://wiki.archlinux.org/title/Archinstall_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "archinstall é uma biblioteca auxiliar para instalar o Arch Linux. Ele é empacotado com diferentes instaladores pré-configurados, como um instalador \"guiado\".\n\nEste documento não discute o uso do archinstall como uma biblioteca Python; para isso, veja a documentação oficial[link inativo 2024-01-13 ⓘ].\n\n- archinstall armazena todas as senhas de criptografia de usuário e de disco (secundário) em texto simples. [1] [2]\n- archinstall oferece padrões diferentes do processo normal de instalação. Ao usar um sistema instalado com archinstall, mencione isso nas solicitações de suporte e forneça /var/log/archinstall/install.log.\n\n"
    },
    {
      "title": "Executando o instalador",
      "level": 2,
      "content": "Primeiro, adquira e inicialize a mídia live conforme descrito em Guia de instalação#Pré-instalação. O pacote archinstall faz parte da mídia live e pode ser executado diretamente:\n\n```\n# archinstall\n```\n\nO instalador guiado irá realizar (consultar) as seguintes etapas:\n\n1. configurar o locale;\n1. selecionar os mirrors;\n1. particionar os discos;\n1. formatar as partições;\n1. habilitar criptografia de disco (opcional);\n1. definir o hostname;\n1. definir a senha do usuário root;\n1. instalar um gerenciador de boot.\n\nPacotes adicionais podem ser instalados ao especificá-los depois da mensagem Write additional packages to install (\"Escreva pacotes adicionais para instalar\").\n\nUma vez que a instalação foi concluída, um texto verde deve aparecer dizendo que é seguro reiniciar, que é também o comando que você usa para reiniciar.\n\n"
    },
    {
      "title": "Perfis",
      "level": 3,
      "content": "archinstall inclui perfis (profiles), ou conjuntos de pacotes, e opções pré-configuradas que podem ser instaladas junto ao sistema base.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- python-archinstall: guided[link inativo 2024-01-13 ⓘ]\n\n"
    }
  ]
}