{
  "title": "Arch IRC kanály",
  "url": "https://wiki.archlinux.org/title/Arch_IRC_kan%C3%A1ly",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Související články\n\n- ArchWiki:IRC\n- Mezinárodní komunity\n- phrik\n\nK využití Internet Relay Chatu (IRC), potřebujete IRC klient. Živé instalační prostředí poskytuje Irssi klient.\n\nOčekáváme od Vás, že se seznámíte s pravidly chování a pravidly kanálů, než se připojíte. Pro seznam běžně užívaných zkratek vizte Arch terminologii.\n\n"
    },
    {
      "title": "Hlavní kanály",
      "level": 2,
      "content": "Tato část popisuje #archlinux, hlavní Arch Linux IRC kanál pro podporu, a #archliniux-offtopic, hlavní kanál pro otevřenou diskuzi; oba kanály jsou dostupné na Libera Chat síti. Vizte https://archlinux.org/news/move-of-official-irc-channels-to-liberachat/\n\nHlavní téma pro #archlinux jsou obecná diskuze a podpora týkající se Arch Linuxu.\n\n"
    },
    {
      "title": "Registrace",
      "level": 3,
      "content": "Abychom omezili spamování, #archlinux a #archlinux-offtopic mají kanálový režim nastaven na +r a +q $~a. To znamená, že se musíte identifikovat pomocí NickServ, abyste se připojili k těmto kanálům a mohli zasílat zprávy. Pokud nejste zaregistrování a identifikováni, budete přesměrováni na #archlinux-unregistered.\n\nAbyste se zaregistrovali přes NickServ, řiďte se podle Libera Chat FAQ a také NickServ HELP po připojení k irc.libera.chat':\n\n```\n/query NickServ HELP REGISTER\n/query NickServ HELP IDENTIFY\n```\n\nNote: **#libera** \n\n- Pokud /query nic nedělá na Vašem klientu, můžete zkusit použít buď /quote NickServ příkaz, nebo /msg NickServ příkaz.\n- Některé IRC klienty mají potíže s takzvaným souběhem; snaží se samovolně připojit do kanálů ještě před identifikací pomocí NickServ. Abyste tuto potíž vyřešili, musíte povolit SASL. Zkonzultujte dokumentaci svého IRC klientu nebo se podívejte na Libera Chat SASL stránku k nalezení instrukcí, jak povolit SASL.\n- Můžete získat seznam lidí, již Vám pomohou, příkazem /msg ChanServ FLAGS #archlinux; můžete se také připojit do #libera a zeptat se tam.\n\n"
    },
    {
      "title": "Operátoři kanálů",
      "level": 3,
      "content": "Arch operátoři jsou \"ops\" v #archlinux i #archlinux-offtopic. Vizte seznam níže nebo zadejte /msg phrik listops na Libera Chatu.\n\nPokud z nějakého důvodu potřebujete pomoc operátora, nebojte se použít /query nebo nám napsat pomocí /msg. Zde je seznam operátorů platný od 2021-09-24:\n\n- alad\n- amcrae\n- BrainDamage\n- gehidore / man\n- grawity\n- heftig\n- jelle\n- MrElendig / Mion\n- Namarrgon\n- tigrmesh / tigr\n- wonder / ioni\n\n"
    },
    {
      "title": "Libera Chat skupinové kontakty",
      "level": 3,
      "content": "Skupinové kontakty řeší záležitosti mezi Libera Chat a Arch Linux personálem a Arch Linux uživateli. To zahrnuje i správce kanálů v #archlinux-* jmenném prostoru na Libera Chat síti a přiřazování archlinux/* \"hostmask\". Poznamenejte, že výhradně Arch Linux personál může využít \"hostmask\".\n\n- wonder / ioni\n- fukawi2\n- anthraxx\n- dvzrv\n- Namarrgon\n\n"
    },
    {
      "title": "Kolaborativní debugging",
      "level": 2,
      "content": "Když žádáte o pomoc na IRC pomocném kanálu (jako třeba #archlinux), není vhodné vkládat žurnály do kanálu; může Vám za to být uzamknut účet. Místo toho užijte pastebinu. Můžete použít phrik factoid !paste, abyste viděli, které pastebiny jsou přijatelné. Přijatelné pastebiny často nevyžadují povolení JavaScriptu. Některé vyžadují povolený JavaScript pro vkládání z webového prohlížeče, jež jsou stále přijatelné, neboť to neovlivňuje čtenáře pastebinu. Neměly by zobrazovat reklamy nebo jiný rozptylující obsah a neměly by potřebovat přihlášení. Vynikající pastebiny poskytují způsob jak vypsat výstup pomocí pipingu.\n\nPříkladný seznam přijatelných pastebinů:\n\n- https://0x0.st - podporuje vkládaní libovolného souborového typu. Může mít trochu rozbitou MIME typovou detekci.\n- https://paste.rs - podporuje vkládaní obrázků, ale MIME typ bude vypnutý.\n- https://bpa.st - dobré pro lidi, kteří chtějí grafické rozhraní.\n- http://ix.io - pouze http. Často užívané, ale hlavně užitečné při debugování SSL chyb (pro které není možné využít https pastebiny).\n\n"
    },
    {
      "title": "Používání IRC",
      "level": 3,
      "content": "{{Warning (Čeština)|Poznamenejte, že všichni lidé, na které narazíte v Arch IRC kanálech, jsou dobrovolníci. Chovejte se k nim hezky, chcete-li od nich pomoc.}\n\nKdyž se připojíte do kanálu, není potřeba pozdravit. Popište potíž a ujistěte se, že jste ji popsali dostatečně a poskytnuli vhodné žurnály. Též pomůže, pokud vyhledáte všechny chybové hlášky ještě před žádáním o pomoc, abyste nemrhali ničím časem. Také se může vyplatit vyhledat danou potíž na vhodném sledovači chyb pro daný software. Čím důkladněji popíšete svou potíž, tím rychleji Vám někdo pomůže.\n\nPokud Vaše potíž nebo otázka se spíše týká konkrétního softwaru, zkuste se připojit na IRC kanál pro daný software. Spíše se Vám dostane dobré odpovědi tam.\n\n"
    },
    {
      "title": "Vypište chybové hlášky do souboru",
      "level": 3,
      "content": "Občas není možné pipnout výstup do pastebinu přímo a měl by se vypsat prvně do souboru.\n\n```\n$ application &> application-output.txt\n```\n\nToto je užitečné pro vkládaní žurnálu, které obsahují osobní údaje; třeba sériová čísla ve výstupu smartctl, která musí být ručně smazána.\n\n"
    },
    {
      "title": "Ostatní kanály",
      "level": 2,
      "content": "Velikost naší komunity vedla k tvorbě několika IRC kanálů. Chcete-li vidět výpis všech kanálů na irc.libera.chat, jež obsahují archlinux ve svém jméně, užijte příkazu /query alis LIST *archlinux*.\n\nTable content:\nKanál | Téma\n#archlinux-aur | AUR obecná diskuze\n#archlinux-aurweb | aurweb vývojová diskuze\n#archlinux-bugs | Diskuze ohledně chyb\n#archlinux-classroom | Projekt, jenž vyvíjí a pořádá přednášky pro Arch Linux komunitu\n#archlinux-conf | ArchConf organizace a diskuze\n#archlinux-devops | Diskuze týkající se vnitřní infrastruktury a vývojové operace Arch Linuxu\n#archlinux-multilib | Diskuze ohledně Arch Linux Multilib projektu a vytváření balíčků\n#archlinux-newbie | Prostor pro učení se novým věcem a pro kladení otázek bez strachu z pranýřování\n#archlinux-pacman | Diskuze a vývoj Pacmana\n#archlinux-proaudio | Diskuze ohledně profesionálního audia na Arch Linuxu\n#archlinux-projects | Diskuze pro vývoj projektů (mkinitcpio, abs, dbscripts, devtools...)\n#archlinux-releng | Arch Linux \"Release Engineering\" diskuze (arch-boxes, archiso, archlinux-docker a releng)\n#archlinux-reproducible | Diskuzní kanál pro vytváření sestavitelných systémů\n#archlinux-security | Diskuze týkající se bezpečnostních chyb v Arch balíčcích\n#archlinux-testing | Diskuzní kanál týkající se testování repozitářů\n#archlinux-wiki | Diskuze ohledně ArchWiki, článků z ní a Arch Linux Fórech\n#archlinux-women | Projektová diskuze pro programy/události, jež mají pobídnout ženy ke přispívání k Arch Linuxu a poskytnout ženám prostor se socializovat. Převážně v angličtině.\n\n"
    },
    {
      "title": "Mezinárodní IRC kanály",
      "level": 3,
      "content": "Mezinárodní diskuze jsou dostupné v následujících kanálech, jež též naleznete na irc.libera.chat IRC síti (pokud není zmíněno jinak).\n\nTable content:\nKanál | Komunita\n#archlinux-br | Brazilská\n#archlinux-cn | Čínská; též na irc.oftc.net#arch-cn\n#archlinux-cz | Česká\n#archlinux-de | Německá\n#archlinux-dk | Dánská\n#archlinux-es | Španělská\n#archlinux-fr | Francouzská\n#archlinux-mx | Mexická\n#archlinux-nordics | Skandinávské: Dánská, Finská, Norská a Švédská\n#archlinux-pl | Polská\n#archlinux-pt | Portugalská\n#archlinux-ro | Rumunská\n#archlinux-tr | Turecká\n#archlinux-ua | Ukrajinská\n\n"
    }
  ]
}