{
  "title": "Archinstall (Français)",
  "url": "https://wiki.archlinux.org/title/Archinstall_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "archinstall est une bibliothèque logicielle qui vise à simplifier l'installation d'Arch Linux. Elles est empaquetée avec plusieurs installateurs pré-configurés tel que l'installateur guidé.\n\nCette page ne documente pas l'utilisation de archinstall en tant que bibliothèque Python; consultez la documentation officielle[dead link 2024-01-13 ⓘ] pour cela.\n\nNote: **expérimental** \n\nNote: **expérimentale** \n\n"
    },
    {
      "title": "Utiliser l'installateur",
      "level": 2,
      "content": "Tout d'abord il faut récupérer et démarrer l'environnement live avec la procédure décrite dans la préparation à l'installation. Le paquet archinstall étant inclut dans cette image il peut directement être lancé comme suit:\n\n```\n# archinstall\n```\n\nL'installateur guidé va suivre les étapes suivantes:\n\n1. Configuration des locales;\n1. Sélection du miroir;\n1. Partitionnement des disques;\n1. Formatage des partitions;\n1. Mise en place du chiffrement des disques (optionnel);\n1. Définition du nom de l'ordinateur (hostname);\n1. Définition du mot de passe de l'utilisateur root;\n1. Installation d'un chargeur d'amorçage (limité à systemd-boot (en) pour les systèmes UEFI et GRUB pour ceux avec un BIOS).\n\nDes paquets supplémentaires peuvent être installés en écrivant leur nom quand cela est demandé: Write additional packages to install.\n\nUne fois l'installation terminée, un texte en vert apparaît, indiquant qu'il est possible de redémarrer. Cela se fait avec:\n\n```\n# reboot\n```\n\n"
    },
    {
      "title": "Profils",
      "level": 3,
      "content": "archinstall inclut des profils, ce sont des groupes de paquets pré-configurés qui peuvent être installés en plus du système de base.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- python-archinstall: guided (en)[dead link 2024-01-13 ⓘ]\n\n"
    }
  ]
}