{
  "title": "Arch Linux (Čeština)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(%C4%8Ce%C5%A1tina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch GNU/Linux je nezávisle vyvíjená obecná x86-64 GNU/Linux distribuce, jejíž cílem je poskytovat nejnovější stabilní verze většiny softwaru skrz \"rolling-release\" model, v němž se systém často aktualizuje. Základní instalace je pouze minimální systém, aby uživatel mohl přidat pouze to, co opravdu potřebuje.\n\n"
    },
    {
      "title": "Jednoduchost",
      "level": 3,
      "content": "Arch GNU/Linux popisuje jednoduchost jako bez zbytečných přídavků či zmeň. Poskytuje software tak, jak byl vydán původními výrobci (upstream) s minimálními změnami, jež se týkají distribuce (downstream změny): vyhýbáme se aktualizacím, které nejsou přijaty upstream; naše downstream aktualizace se skládají převážné z backportovaných oprav chyb, které budou nepotřebné po novém vydání daného projektu.\n\nStejně tak Arch poskytuje konfigurační soubory; změny se týkají distribučních záležitostí (jako třeba upravování cest k souborům). Neupravuje chod programů například povolováním některých služeb, jen protože daný balíček byl nainstalován. Balíčky se oddělují jen tehdy, jsou-li k mání značné výhody (třeba výrazné uvolnění místa na úložišti). Konfigurační utility s grafickým rozhraním nejsou oficiálně poskytovány, abychom donutili uživatele naučit se zacházet se systémovou konfigurací a textovým editorem.\n\n"
    },
    {
      "title": "Novodobost",
      "level": 3,
      "content": "Arch GNU/Linux se snaží poskytovat nejnovější stabilní vydání softwaru, dokud je možné se vyvarovat systémovým poruchám týkajícím se správy balíčků. Je založen na rolling release systému, jenž umožňuje jednorázovou instalaci s nepřetržitými aktualizacemi.\n\nArch zahrnuje mnohé nové funkce dostupné pro GNU/Linux uživatele, jako jsou systemd inicializační systém, novodobé souborové systémy, LVM2, softwarový RAID, udev podporu a initcpio (s mkinitcpio) a též nejnovější dostupné kernely.\n\n"
    },
    {
      "title": "Věcnost",
      "level": 3,
      "content": "Arch je spíše věcná distribuce než ideologická. Zásady zde jsou jenom užitečná doporučení. Konečná rozhodnutí se zakládají na jednotlivých případech a shodách vývojářů. Technická analýza založená na skutečnostech a rozpravách jsou na čem záleží, ne politika nebo lidový názor.\n\nObrovské množství balíčků a sestavovacích skriptů v různých Arch GNU/Linux repozitářích nabízí svobodný software pro ty, kteří jej upřednosťují, ale také balíčky proprietárního softwaru pro ty, kteří chtějí praktický software a nezajímá je ideologie.\n\n"
    },
    {
      "title": "Založeno na uživatelích",
      "level": 3,
      "content": "Zatímco mnohé GNU/Linux distribuce se snaží být user-friendly (přístupné uživatelům), Arch GNU/Linux vždy byl a zůstane user-centric (založen na práci uživatelů). Tato distribuce naplňuje potřeby těch, kteří jí přispívají vývojem, místo toho, aby upřednosťovala potřeby většiny. Je určena pro zkušeného GNU/Linux uživatele nebo kohokoliv, kdo se nezdráhá se něčemu naučit a nebojí se dokumentací.\n\nVšichni uživatelé jsou vítáni zúčastnit se vývoje distribuce. Hlášení a opravování chyb si vysoce ceníme. Aktualizací, které zlepšují balíčky nebo zásadní projekty, si též vážíme: Arch vývojáři jsou dobrovolníci a aktivní účastníci se mohou stát součástí týmu. Archisté mohou volně přispívat balíčky do Arch Uživatelského Repozitáře, vylepšovat ArchWiki dokumentaci, poskytovat technickou podporu jiným či si promluvit o svých názorech na fórech, mailovacích seznamech nebo IRC kanálech. Arch GNU/Linux je volba pro mnoho lidí po celém světě. Existuje několik mezinárodních komunit, jež nabízí dokumentaci v mnoha jazycích.\n\n"
    },
    {
      "title": "Víceúčelovost",
      "level": 3,
      "content": "Arch GNU/Linux je všestranná distribuce. Po instalaci poskytuje pouze prostředí s příkazovou řádkou; místo toho, abyste pracně odstraňovali nepotřebné či nechtěné balíčky, nabízí se Vám možnost si stvořit vlastní systém z tisíců dostupných balíčků v oficiálních repozitářích pro x86-64 architekturu.\n\nArch je založen na rolling-release modelu přes pacman, nenáročný rychlý správce balíčků, jenž umožňuje aktualizaci celého systému jedním příkazem. Arch též poskytuje Arch build system, systém založený na ports, aby bylo jednoduché sestavovat a instalovat balíčky přímo ze zdrojového kódu; ty též mohou být sladěny jedním příkazem. Také Arch Uživatelský Repozitář obsahuje tisíce komunitou poskytnutých PKGBUILD skriptů pro kompilování instalovatelných balíčků ze zdrojového kódu přes makepkg aplikaci. Uživatelé si též mohou jednoduše sestavit a udržovat vlastní repozitáře.\n\n"
    },
    {
      "title": "Minulost",
      "level": 2,
      "content": "Arch komunita vyrostla a stala se jednou z nejpopulárnějších a nejvlivnějších distribucích GNU/Linuxu. To potvrzují recenze, jež jsme napříč roky obdrželi.\n\nArch vývojáři jsou neplacení dobrovolníci a zpeněžnění ani nezvažujeme, tudíž Arch zůstane bezplatný a svobodný. Máte-li zájem se dozvědět více o vývojové minulosti Arch GNU/Linuxu, prohlídněte si záznamy v Internet Archive Wayback Machine a články v Arch Linux News Archives.\n\n"
    },
    {
      "title": "Ranná léta",
      "level": 3,
      "content": "Judd Vinet, kanadský programátor a občasně i kytarista, počal vývoj Arch GNU/Linuxu na počátku 2001. První oficiální vydání, tedy Arch Linux 0.1, bylo 11. března 2002. Jsa inspirován jednoduchostí Slackwaru, BSD, PLD Linuxu a CRUX leč současně zklamán jejich nedostatkem spravování balíčků, Vinet stvořil svou vlastní distribuci založenou na obdobných zásadách. Též sepsal správce balíčků, jejž pojmenoval pacman a jenž se postaral o instalaci, mazání či aktualizaci balíčků.\n\n"
    },
    {
      "title": "Střední léta",
      "level": 3,
      "content": "Ranná Arch komunita jistě rostla, jak je prokázáno tímto grafem příspěvků na fóru. Již od počátku byla známa jako otevřená, přátelská a nápomocná komunita.\n\n"
    },
    {
      "title": "Zrození ArchWiki",
      "level": 3,
      "content": "Dne 08-07-2005 byla ArchWiki poprvé vytvořena na MediaWike enginu.\n\n"
    },
    {
      "title": "Nástup A. Griffina",
      "level": 3,
      "content": "Ke konci 2007 Judd Vinet se přestal aktivně účastnit Arch vývoje a předal otěže americkému programátorovi Aaronu Griffinovi (též znám jako Phrakture).\n\n"
    },
    {
      "title": "Arch Instalační Skripty",
      "level": 3,
      "content": "15-07-2012 vydání instalačního obrazu se zbavilo Arch Installation Frameworku (AIF) a nahradilo jej Arch Instalačními Skripty (arch-install-scripts).\n\n"
    },
    {
      "title": "Systemd éra",
      "level": 3,
      "content": "Mezi 2012 a 2013 tradiční System V inicializační systém byl nahrazen systemd. [1][2][3][4]\n\n"
    },
    {
      "title": "Ukončení podpory pro i686",
      "level": 3,
      "content": "Dne 25-01-2017 bylo oznámeno, že se přestane podporovat i686 kvůli upadající popularitě napříč vývojáři a komunitou. Ke konci listopadu 2017 všechny i686 balíčky byly odstraněny ze zrcadel.\n\n"
    },
    {
      "title": "Přemítání o roli Projektového Vůdce a hlasování",
      "level": 3,
      "content": "Na počátku 2020 Arch GNU/Linux sbor smyslel nový postup pro rozhodování o budoucích vůdcích (jak je dokumentováno v DeveloperWiki:Project Leader.\n\nJelikož Aaron Griffin se rozhodnul sejít ze své role, hlasovalo se o nového vůdce. Dne 24-02-2020 byly vyhlášeny výsledky a Levente Polyak se oficiálně stal novým vůdcem projektu.\n\n"
    }
  ]
}