{
  "title": "ArchWiki Translation Team/Contributing (Español)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_Translation_Team/Contributing_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artículos relacionados\n\n- Equipo\n- Coordinación\n- Glosario\n- Guía de estilo\n- Páginas de ayuda\n\nEl objetivo de este documento es recopilar en una sola fuente todas aquellas herramientas básicas necesarias a la hora de abordar la tarea de editar la Wiki, en general, y de realizar traducciones, en particular.\n\n"
    },
    {
      "title": "Consideraciones generales",
      "level": 2,
      "content": "Se puede contribuir de múltiples formas, desde la realización de #Tareas básicas hasta #Tareas avanzadas.\n\nPara mantener la coherencia de las traducciones, se ha elaborado un glosario de términos para unificar la traducción de los mismos y una guía de estilo para homegeneizar la estructura de los artículos.\n\nLos traductores automáticos pueden ser utilizados para una primera aproximación, pero nunca como único recurso. Algunos resultados de estos traductores pueden no ser adecuados, es por ello que el criterio del traductor siempre debe prevalecer para revisarlos y, en caso necesario, efectuar las correcciones para que la traducción sea lo más fiel posible con la idea que el texto original quiere transmitir.\n\nSi tiene dudas a la hora de realizar cualquier tarea, siempre puede acudir a un miembro del equipo en activo, bien enviando un correo electrónico, bien dejando una nota en la página de Discusión.\n\n"
    },
    {
      "title": "Tareas básicas",
      "level": 2,
      "content": "Tareas en la que cualquier usuario con nociones mínimas sobre la edición de artículos pueden realizar.\n\n"
    },
    {
      "title": "Corregir errores ortográficos y/o gramaticales",
      "level": 3,
      "content": "Edite el artículo o sección donde se encuentre dichos errores ortográficos/gramaticales y efectuar las correcciones.\n\nIntroduzca \"corrección ortográfica\" (o similar) en el campo \"Resumen\" y marque \"Esta es una edición menor\", antes de guardar los cambios.\n\n"
    },
    {
      "title": "Etiquetar traducciones con problemas",
      "level": 3,
      "content": "Las plantillas para indicar que una traducción debe ser actualizada o traducida son Template:Bad translation (Español) y Template:Translateme (Español). respectivamente\n\n"
    },
    {
      "title": "Traducciones desactualizadas",
      "level": 4,
      "content": "Es posible que algunos artículos se encuentren desactualizados, es decir, que la versión original haya sufrido cambios en su redacción y que estos no se hayan visto reflejados en la versión traducida. Si alguna traducción se encuentra en dicho estado debe ser etiquetada con la plantilla Template:Bad translation (Español) para su posterior actualización.\n\nIntroduzca \"añadida etiqueta Bad translation\" (o similar) en el campo \"Resumen\", antes de guardar los cambios.\n\n"
    },
    {
      "title": "Traducciones incompletas",
      "level": 4,
      "content": "Podemos encontrarnos con artículos cuyo título esté localizado en español pero su contenido (o parte de él) aún esté en inglés. Estos artículos deben etiquetarse con la plantilla Template:Translateme (Español).\n\nIntroduzca \"añadida etiqueta Translateme\" (o similar) en el campo \"Resumen\", antes de guardar los cambios.\n\n"
    },
    {
      "title": "Enlaces a categorías",
      "level": 4,
      "content": "Los artículos pueden ser cambiados de categoría, pertenecer a una nueva o dejar de pertenecer a otra. No son cambios que ocurran con frecuencia, pero se debe revisar de vez en cuando con el objetivo de detectar y corregir dichos cambios. El listado de categorías a las que pertenece un artículo puede consultarse al final del mismo. Si descubre que las categorías a las que pertenece la traducción no son las mismas que las del artículo original en inglés, puede actualizar las categorías en ese momento.\n\nPara ello copie las categorías que deban añadirse y/o modificarse del artículo original al artículo traducido, respetando el orden del documento original.\n\nAl final de todas las categorías que se han añadido y/o modificado debe aparecer \" (Español)\". Para la categoría [[Category:Help]], debería ser [[Category:Help (Español)]].\n\nIntroduzca \"corrección de categoría(s)\" en el campo \"Resumen\" antes de guardar los cambios.\n\n"
    },
    {
      "title": "Enlaces a artículos/secciones/paquetes marcados como rotos",
      "level": 4,
      "content": "La Wiki de Arch dispone de sistemas automatizados (bots) que se encargan de algunas tareas básicas de mantenimiento, entre las que se encuentran la localización de enlaces rotos a páginas, secciones, paquetes o grupos de paquetes. Estos sistemas automáticos marcan los artículos afectados mediante la utilización de plantillas para tal efecto.\n\nTable content:\nPlantilla | Listado | Utilización\nTemplate:Broken section link (Español) | [1] | Marca enlaces rotos a artículos y secciones internos de ArchWiki.\nTemplate:Dead link (Español) | [2] | Marca enlaces rotos a vínculos externos a ArchWiki.\nTemplate:Broken package link (Español) | [3] | Marca enlaces rotos a paquetes y grupos de paquetes de ArchLinux o AUR.\n\nVéase el artículo original para comprobar el destino correcto del enlace roto. Si el motivo del enlace roto se debe a que el artículo original ha cambiado sustancialmente, marque el artículo traducido como desactualizado o incompleto, según sea el caso.\n\n"
    },
    {
      "title": "Enlace a artículos/secciones originales, traducidos posteriormente",
      "level": 4,
      "content": "Durante el proceso de traducción, puede ocurrir que existan enlaces a páginas de las que no hay disponible una versión traducida al español, por lo que se deben mantener a la página original. Cuando se realiza la traducción de la página destinataria del enlace que antes no disponía de versión al español, se deben redirigir dichos enlaces al artículo/sección traducidos.\n\nPara realizar esta corrección, en la página del artículo original pulse sobre \"Lo que enlaza aquí\" (en el apartado \"Herramientas\" de la columna izquierda), busque los artículos en español del listado resultante y corrija dichos enlaces.\n\n"
    },
    {
      "title": "Mantener las tablas",
      "level": 3,
      "content": "Existen dos tablas sobre los artículos presentes en ArchWiki para realizar el seguimiento y mantenimiento de las traducciones:\n\n- Una donde se relacionan todos los artículos traducidos (acompañada de una serie de datos tales como fecha de revisión, prioridad y observaciones).\n- Otra donde se intentan recoger todos los títulos localizados al español (artículos \"inexistentes\") correspondientes a los artículos en versión inglesa que no cuentan aún con una traducción al español.\n\n"
    },
    {
      "title": "Incluir artículos en las tablas",
      "level": 4,
      "content": "```\n|-\n| [[nombre del artículo original (Español)]]\n| {{Grey|4}}\n| {{C|{{ic|--}}}}\n|\n```\n\n```\n|-\n| [[nombre del artículo original (Español)]]\n| {{Grey|4}}\n| [[nombre del artículo original|Artículo original]]\n|\n```\n\n"
    },
    {
      "title": "Cambiar la prioridad de un artículo",
      "level": 4,
      "content": "Si durante la consulta de la tabla de traducciones, considera claramente que la prioridad asignada a un artículo no es la que le corresponde, modifique la tabla para realizar el cambio de prioridad, respetando el color asignado al mismo mediante la plantilla correspondiente. En caso de tener dudas, puede abrir una discusión al respecto.\n\n"
    },
    {
      "title": "Gestionar los artículos redirigidos o archivados",
      "level": 4,
      "content": "Los artículos que hayan sido redirigidos, cuyos antiguos títulos estén presentes en la tabla de traducciones, deben ser:\n\n- renombrados, por el título del artículo de destino de la redirección, si este no existe en la tabla de traducciones; o,\n- eliminados, si el título del artículo de destino de la redirección ya existe en la tabla de traducciones.\n\nLos artículos archivados deben ser eliminados de la tabla de traducciones o de la tabla de artículos sin traducir.\n\n"
    },
    {
      "title": "Tareas avanzadas",
      "level": 2,
      "content": "En estas tareas es indispensable la utilización de la plantilla Template:TranslationStatus (Español), la cual facilita enormemente el trabajo tanto del traductor original, como de aquellos que posteriormente adopten su mantenimiento o simplemente deseen actualizar el artículo.\n\n"
    },
    {
      "title": "Nueva traducción",
      "level": 3,
      "content": "- leer la guía de estilo y la ayuda sobre localización;\n- adquirir conocimientos sobre la edición de artículos;\n- conocer las plantillas más relevantes y su utilización.\n\nNote: **no** \n\nLe recomendamos que empiece con artículos de poca extensión y baja prioridad. Conforme vaya obteniendo confianza y experiencia, le animamos a que elija traducciones más extensas y prioritarias.\n\nEs aconsejable que, previamente, avise al resto de los miembros del equipo que está realizando la tarea. Para ello, en la tabla de traducciones, utilice el campo \"Observaciones\" del artículo a traducir y escriba \"En fase de traducción por <su_usuario>\" (o similar). De esta forma se evita que otro traductor realice esta tarea en el artículo al mismo tiempo, con la pérdida de esfuerzos que ello puede conllevar. Véase #Incluir artículos en las tablas para añadir el nuevo artículo en la tabla de traducciones, si fuera necesario.\n\nPara realizar esta tarea, siga los pasos siguientes:\n\n- Modifique el artículo original y cree el enlace interlingüístico español, añadiendo la siguiente línea y respetando el orden alfabético: [[es:título del artículo original]]\n\nNote: **no llevan** \n\n- Conforme a la nueva directriz establecida en Help:i18n (sección Help:i18n#Interlanguage links, revisada el 21 de agosto de 2019), en el caso de títulos con subpáginas, los enlaces interlingüísticos se añadirán en todos los segmentos de la ruta del título, salvo en el último segmento, generándose después automáticamente la etiqueta del idioma en ese último segmento al crear la página. Por ejemplo, en la página Help:Style/Formatting and punctuation, el enlace interlinguístico español que tendríamos que añadirle quedaría así: [[es:Help:Style (Español)/Formatting and punctuation]], y el título resultante de la página al hacer clic sobre dicho enlace, quedaría así: Help:Style (Español)/Formatting and punctuation (Español). Dicho de otro modo, si queremos localizar el título de las subpáginas de una traducción, la etiqueta de idioma debe añadirse a cada segmento en la ruta del título original (Help:i18n (Español)#Títulos de los artículos).\n- Recuerde que los títulos en inglés no llevan etiqueta de idioma.\n\n- Seleccione todo el texto y cópielo al portapapeles (lo necesitará más adelante). En el campo \"Resumen\", escriba \"add Spanish interlanguage link\" (o similar), antes de guardar los cambios.\n\n- En la sección \"En otros idiomas\" del artículo original (generalmente situado en la parte izquierda de la pantalla) aparecerá el enlace \"Español\". Haga clic en él y se le abrirá una nueva página, en la misma seleccione \"Crear\" en la parte superior. En el campo de texto pegue el contenido del portapapeles (texto del artículo original).\n\n- En el nuevo artículo a traducir cambie el enlace interlingüístico español por el inglés, es decir [[es:título del artículo original]] deberá modificarse por [[en:título del artículo original]]. Recuerde eliminar del enlace interlingüístico inglés la etiqueta de idioma (Español), si el enlace interlingüístico español lo llevase (en los títulos con subpáginas).\n\n- Todos los enlaces de las categorías en el nuevo artículo a traducir deben ser localizados, añadiendo al final de las mismas \" (Español)\". Por ejemplo [[Category:ArchWiki]] deberá modificarse por [[Category:ArchWiki (Español)]].\n\n- Añada las plantillas TranslationStatus (con el ID del artículo original) y Translateme justo después de los enlaces interlingüísticos en el nuevo documento a traducir, indicando el motivo \"Sin traducir\" para la última plantilla.{{Translateme (Español)|Sin traducir}}{{TranslationStatus (Español)|título del artículo original|fecha de revisión|ID del artículo original}}\n\n```\n{{Translateme (Español)|Sin traducir}}{{TranslationStatus (Español)|título del artículo original|fecha de revisión|ID del artículo original}}\n```\n\n- Durante la traducción, elimine las plantillas innecesarias y modifique las plantillas restantes por su versión en español. Ayúdese del glosario para unificar la traducción de palabras con el resto de artículos.\n\n- Una vez finalizado el trabajo elimine la plantilla Translateme. Modifique la tabla de traducciones con la nueva fecha de revisión del artículo traducido y elimine el comentario del campo \"Observaciones\" donde se informaba que estaba en fase de traducción.\n\nVéase #Enlace a artículos/secciones originales, traducidos posteriormente para corregir los enlaces relacionados con esta traducción existentes en otros artículos.\n\n"
    },
    {
      "title": "Actualizar traducción",
      "level": 3,
      "content": "Si el artículo dispone de la plantilla TranslationStatus, puede ayudarse del resultado del enlace qué \"ha cambiado\". Una vez realizada la tarea de mantenimiento, se debe actualizar la fecha de revisión del artículo en la tabla de traducciones y en la plantilla TranslationStatus, así como el ID asociado en la misma.\n\nSi no es el traductor original del artículo, le recomendamos que consulte #Nueva traducción y compruebe que todos los pasos se realizaron correctamente en dicho artículo.\n\n"
    },
    {
      "title": "Cómo obtener el ID de la plantilla TranslationStatus",
      "level": 3,
      "content": "Para obtener el ID para la plantilla Template:TranslationStatus (Español) de, p.ej. Installation guide (Español):\n\n- Vaya al artículo original Installation guide.\n- Haga clic sobre \"Enlace permanente\", presente en la columna izquierda de la página bajo la sección \"Herramientas\".\n- El número que aparece al final de la URL (...oldid=585451) es el ID que debemos utilizar en la plantilla, quedando tal que así:\n\n```\n{{TranslationStatus (Español)|Installation guide|2019-10-14|585451}}\n```\n\n"
    },
    {
      "title": "Especial referencia a las plantillas",
      "level": 2,
      "content": "Las plantillas son una parte fundamental de la edición en una Wiki. Algunas de ellas son #De uso exclusivo en artículos originales en inglés, otras son #De uso exclusivo en artículos traducidos, y otras pueden ser #De uso general. Véase Help:Template (Español) para más detalles.\n\n"
    },
    {
      "title": "De uso exclusivo en artículos originales",
      "level": 3,
      "content": "Estas plantillas facilitan el mantenimiento de los artículos originales y al no existir una versión en español de las mismas, los traductores no deben incluirlas en sus trabajos. Es por ello que deben ser eliminadas durante el proceso de traducción.\n\n- Template:Accuracy\n- Template:Expansion\n- Template:Merge\n- Template:Move\n- Template:Laptop style\n- Template:Out of date\n- Template:Redirect\n- Template:Remove\n- Template:Style\n\nPara más información sobre esto, véase el artículo original.\n\n"
    },
    {
      "title": "De uso exclusivo en artículos traducidos",
      "level": 3,
      "content": "Estas plantillas son parte de las herramientas que disponen los traductores para desarrollar su labor.\n\n- Template:Bad translation (Español)\n- Template:Translateme (Español)\n- Template:TranslationStatus (Español)\n\n"
    },
    {
      "title": "De uso general",
      "level": 3,
      "content": "Son plantillas que pueden aparecer en ambos documentos, pero el traductor debe asegurarse de emplear la versión en español, así que debe cambiarlas a medida que las vaya encontrando en los artículos.\n\nTable content:\nPlantilla original en inglés | Versión en español\nPlantillas relativas a los artículos\nTemplate:Related articles start | Template:Related articles start (Español)\nTemplate:Related | Template:Related2 (solo si se considera conveniente o necesario traducir el título)\nTemplate:Unsupported | –\nTemplate:Yes | Template:Yes (Español)\nTemplate:No | Template:No\nTemplate:Tip | Template:Tip (Español)\nTemplate:Note | Template:Note (Español)\nTemplate:Warning | Template:Warning (Español)\nTemplate:Dead link | Template:Dead link (Español)\nTemplate:Broken package link | Template:Broken package link (Español)\nTemplate:Broken section link | Template:Broken section link (Español)\nPlantillas sobre el estado de la traducción\nTemplate:Bad translation | Template:Bad translation (Español)\nTemplate:Translateme | Template:Translateme (Español)\nTemplate:TranslationStatus | Template:TranslationStatus (Español)\nPlantillas de navegación\nTemplate:Laptops table header | Template:Laptops table header (Español)\nTemplate:Laptops navigation | Template:Laptops navigation (Español)\nTemplate:List of applications navigation | Template:List of applications navigation (Español)\nTemplate:Package guidelines | –\nPlantillas especiales\nTemplate:Cat main | Template:Cat main (Español)\nTemplate:Template | Template:Template (Español)\nTemplate:META Error | –\nTemplate:META Unexplained Status Template | –\nTemplate:Comment | Template:Comment (Español)\nTemplate:Committed identity | –\nTemplate:Unsigned | –\n\nSi en la página a traducir aparecen las plantillas Template:Broken package link, Template:Broken section link o Template:Dead link no copie estas plantillas en la traducción. Lo que procede en estos casos en corregir dichos enlaces en el texto original, y luego copiarlos y/o traducirlos en la traducción, o, en su defecto, omitir toda la oración o sección relacionada con dichos enlaces.\n\nPara más información sobre esto, véase el artículo original.\n\n"
    }
  ]
}