{
  "title": "Arch Linux (Slovenščina)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(Sloven%C5%A1%C4%8Dina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux je neodvisno razvita splošna distribucija GNU/Linuxa za računalnike, ki delujejo na osnovi x86-64 procesorske arhitekture. Prizadeva si zagotoviti najnovejše stabilne različice večine programske opreme po modelu tekočih izdaj. Privzeta namestitev vsebuje le minimalni osnovni sistem, kateremu uporabnik sam dodaja le tisto, kar potrebuje.\n\n"
    },
    {
      "title": "Preprostost",
      "level": 3,
      "content": "Arch Linux opredeljuje preprostost kot brez nepotrebnih dodatkov ali sprememb. Uporablja programsko opremo, kot so jo izdali prvotni razvijalci (upstream), s čim manj distribuciji-specifičnih sprememb (downstream). Popravkom, ki jih ne sprejme upstream, zato načeloma ni, Archovi popravki downstream pa so skoraj v celoti sestavljeni iz popravkov napak v trenutni izdaji upstream različic, ki so običajno zastareli že z naslednjo različico.\n\nNa podoben način Arch distribuira konfiguracijske datoteke, ki jih je zagotovil upstream, s spremembami, omejenimi na spremembe, značilne za distribucijo, kot je prilagajanje poti do sistemskih datotek. Ne dodaja funkcij za avtomatizacijo, kot je omogočanje priloženih systemd storitev samo zato, ker je bil paket nameščen. Paketi se razdelijo na manjše le, če obstajajo prepričljive prednosti, na primer zaradi večjega prihranka prostora na disku. Grafičnih konfiguracijskih orodij v privzeti namestitvi ni, kar spodbuja uporabnike, da večino konfiguracije sistema opravijo z uporabo lupine in urejevalnika besedila.\n\n"
    },
    {
      "title": "Sodobnost",
      "level": 3,
      "content": "Arch Linux si prizadeva vzdrževati najnovejše stabilne različice svoje programske opreme, dokler se je mogoče izogniti sistematskim težavam zaradi posodobitev le-teh, znotraj zdravega razuma. Temelji na sistemu tekočih izdaj (ang. rolling release), ki omogoča enkratno namestitev s stalnimi nadgradnjami.\n\nArch vključuje številne novejše funkcije, ki so na voljo uporabnikom GNU/Linuxa, vključno s sistemom init systemd, sodobnimi datotečnimi sistemi, LVM2, programskim RAID, podporo udev in initcpio (z mkinitcpio) ter najnovejšimi razpoložljivimi Linux jedri.\n\n"
    },
    {
      "title": "Pragmatizem",
      "level": 3,
      "content": "Arh je bolj pragmatična kot ideološka distribucija. Načela, ki so tu navedena, so le koristne smernice. Konec koncev se odločitve o zasnovi sprejemajo od primera do primera s soglasjem razvijalcev. Pomembni sta tehnična analiza in razprava, ki temeljita na dokazih, in ne politika ali splošno mnenje.\n\nVeliko število paketov in skript za sestavljanje v različnih repozitorijih sistema Arch Linux ponuja brezplačno in odprtokodno programsko opremo za tiste, ki jo imajo raje, ter lastniške programske pakete za tiste, ki jim je funkcionalnost pomembnejša od ideologije.\n\n"
    },
    {
      "title": "Osrednost uporabnika",
      "level": 3,
      "content": "Medtem ko si mnoge distribucije GNU/Linuxa prizadevajo biti bolj uporabniku prijazne, je Arch Linux vedno bil in bo ostal uporabniško usmerjen. Namen distribucije je izpolniti potrebe tistih, ki prispevajo k njej, in ne poskušati pritegniti čim več uporabnikov. Namenjena je izkušenim uporabnikom GNU/Linuxa, pa tudi vsakomur, ki je pripravljen prebrati dokumentacijo in sam reševati svoje probleme.\n\nVse uporabnike spodbujamo, da prispevajo k distribuciji. Poročanje in pomoč pri odpravljanju napak [1] sta zelo cenjena, popravki, ki izboljšujejo pakete ali jedro projektov [2], pa so zelo dobrodošli. Razvijalci Archa so prostovoljci, kar pomeni, da se lahko aktiven uporabnik kar hitro znajde kot del te ekipe. Archerji lahko prosto prispevajo pakete v Arch User Repository, izboljšajo ArchWiki dokumentacijo, nudijo tehnično pomoč drugim ali le izmenjujejo mnenja na forumih, poštnih seznamih ali IRC kanalih. Arch Linux je operacijski sistem izbire za številne ljudje po vsem svetu, zato obstaja več mednarodnih skupnosti, ki nudijo pomoč in dokumentacijo v različnih jezikih.\n\n"
    },
    {
      "title": "Vsestranskost",
      "level": 3,
      "content": "Arch Linux je splošno-namenska distribucija. Ob namestitvi je na voljo le okolje ukazne vrstice; namesto da bi uporabnik moral odstranjevati nepotrebne in nezaželene pakete, mu je ponujena možnost, da sestavi sistem po meri z izbiro med več tisoč visokokakovostnimi paketi, ki so na voljo v uradnih repozitorijih.\n\nNa Archu se paketi nameščajo ter posodabljajo s programom pacman, ki je lahek, preprost in hiter upravitelj paketov. Arch ponuja tudi Arch build system, podoben sistemu ports, ki omogoča enostavno sestavljanje in nameščanje paketov iz izvorne kode, ki jih je tudi mogoče preprosto posodabljati. Poleg tega je v Arch User Repository več tisoč skript PKGBUILD, ki jih je prispevala skupnost za sestavljanje namestljivih paketov iz izvorne kode z uporabo programa makepkg. Prav tako lahko uporabniki z lahkoto sestavljajo ter vzdržujejo svoje lastne repozitorije po meri.\n\n"
    },
    {
      "title": "Zgodovina",
      "level": 2,
      "content": "Arch je zrasel v eno izmed najbolj priljubljenih in vplivnih distribucij Linuxa, o čemer pričajo tudi recenzije, ki jih je prejel v preteklih letih.\n\nRazvijalci Archa ostajajo neplačani prostovoljci, samega projekta pa ni mogoče monetizirati, zato bo Arch Linux ostal brezplačen in svoboden v vseh pomenih besede. Tisti, ki jih zanima več podrobnosti o zgodovini razvoja Archa, lahko pregledajo Arch na Internet Archive Wayback Machine in Arch Linux News Archives.\n\n"
    },
    {
      "title": "Zgodnja leta",
      "level": 3,
      "content": "Kanadski programer in občasni kitarist Judd Vinet je začel razvijati Arch Linux v začetku leta 2001. Njegova prva uradna izdaja, Arch Linux 0.1, je izšla 11. marca 2002. Vineta je navdihnila elegantna preprostost distribucij Slackware, BSD, PLD Linux in CRUX, bil pa je razočaran nad pomanjkljivim upravljanjem paketov, zato je svojo distribucijo zgradil po podobnih načelih, kot so jih upoštevale te distribucije. Poleg tega je napisal tudi program za upravljanje paketov, imenovan pacman, ki samodejno skrbi za nameščanje, odstranjevanje in nadgrajevanje paketov.\n\n"
    },
    {
      "title": "Srednja leta",
      "level": 3,
      "content": "Zgodnja skupnost Archa je stalno rasla, kar dokazuje ta tabela objav na forumu, uporabnikov in poročil hroščev. Poleg tega je bila že od svojih začetkov znana kot odprta, prijazna in koristna skupnost.\n\n"
    },
    {
      "title": "Rojstvo ArchWiki",
      "level": 3,
      "content": "8. julija 2005 je bil vzpostavljen ArchWiki, na podlagi MediaWiki.\n\n"
    },
    {
      "title": "Začetek dobe Aarona Griffina",
      "level": 3,
      "content": "Konec leta 2007 se je Judd Vinet upokojil kot Arch razvijalec in gladko predal vajeti ameriškemu programerju Aaronu Griffinu, znanemu tudi kot Phrakture.\n\n"
    },
    {
      "title": "Arch Install Scripts",
      "level": 3,
      "content": "Namestitvene slike 15. julija 2012 je bila prva, ki ni več uporabljala programa Arch Installation Framework (AIF), ki je deloval preko menijev, v prid Arch Install Scripts (arch-install-scripts).\n\n"
    },
    {
      "title": "Systemd obdobje",
      "level": 3,
      "content": "Med letoma 2012 in 2013 je starejši System V init sistem zamenjal systemd.[3][4][5][6]\n\n"
    },
    {
      "title": "Opustitev podpore i686",
      "level": 3,
      "content": "25. januarja 2017 je bilo objavljeno, da bo podpora za arhitekturo i686 postopoma ukinjena zaradi njene vedno manjše priljubljenosti med razvijalci ter skupnostjo. Do konca novembra 2017 so bili vsi i686 paketi odstranjeni iz zrcalnih repozitorijev.\n\n"
    },
    {
      "title": "Pregled vloge vodje projekta ter volitve",
      "level": 3,
      "content": "V začetku leta 2020 je osebje sistema Arch Linux s skupnimi močmi oblikovalo nov postopek za določanje prihodnjih vodij, ki je dokumentiran v DeveloperWiki:Project Leader.\n\nKer se je Aaron Griffin odločil odstopiti, je bila izvedena anketa za izvolitev nove osebe, ki bi ga nadomestila. 24. 2. 2020 so bili rezultati ankete objavljeni, s čimer je bila izvolitev Leventeja Polyaka uradna.\n\n"
    }
  ]
}