{
  "title": "ArchWiki Tutorial (Português)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_Tutorial_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- ArchWiki:Bots\n- Help:Discussão\n- Help:Modelo\n\nArchWiki funciona com MediaWiki, um pacote software livre de wiki escrito em PHP, originalmente desenhado para usar no Wikipédia. Ajuda mais profunda pode ser localizada em Help:Conteúdo no MediaWiki e Ajuda:Página principal no Wikipédia.\n\nEsse é um pequeno tutorial sobre edição do ArchWiki. Antes de editar ou criar páginas, usuários são encorajados a se familiarizar com o tom geral, layout e estilo dos artigos existentes. Um esforço deve ser feito para manter um nível de consistência por todo o wiki. Veja ArchWiki:Contribuindo, Help:Estilo e Help:Leitura para uma visão geral das convenções comuns. Para experimentar com edição, por favor use o sandbox. Para uma visão geral de marcação wiki, veja Help:Folha de dicas.\n\n"
    },
    {
      "title": "Criando uma conta",
      "level": 2,
      "content": "Antes de registrar-se, familiarize-se com nosso Código de conduta. Para poder editar artigos do ArchWiki, você deve criar uma conta ArchWiki e confirmar o endereço de e-mail usado para registro. Responder à pergunta do captcha requer um ambiente Arch Linux atualizado: usuários que não sejam do Arch são bem-vindos para contribuir para o wiki e para responder a pergunta eles podem, por exemplo, inicializar em um sistema Arch live com a imagem de instalação mais recente, usar pacman-staticAUR (binários pré-compilados estão disponíveis) ou simplesmente usar uma imagem contêiner usando ferramentas como o Docker.\n\nUma vez que você tenha uma conta, autentique-se em Special:UserLogin.\n\n"
    },
    {
      "title": "Editando",
      "level": 2,
      "content": "Para começar a editar uma página, clique na aba Edit source no topo da página. Como alternativa, os usuários podem editar uma seção específica de um artigo clicando no link edit source à direita do título da seção. A página Editing Nome da página ou Editing Nome da página (section) será exibida, que consiste nos seguintes elementos:\n\n- Barra de ferramentas de edição (opcional)\n- Caixa de edição\n- Caixa de resumo da edição\n- Links Save changes ou Save page, Show preview, Show changes e Cancel\n\nA caixa de edição conterá o wikitext (o código-fonte editável a partir do qual o servidor produz a página web) para a revisão atual da página ou seção. Para realizar uma edição:\n\n1. Modifique o wikitext conforme necessário (veja #Formatando abaixo para detalhes).\n1. Explique, em inglês, a edição na caixa de Resumo (ex.: \"fixed typo\" ou \"added info on xyz\"). Nota: Todas as edições devem estar acompanhadas por um resumo descritivo para facilitar revisão por outros usuários. Veja ArchWiki:Contributing (Português)#As 3 regras fundamentais para mais informações.\n1. Use o botão Show preview para facilitar revisão e verificar a formatação antes de salvar.\n1. Marque a edição como menor marcando a caixa This is a minor edit se a edição for superficial e indiscutível.\n1. Salve as alterações clicando Save changes. Se não estiver satisfeito, clique Cancel em vez disso (ou repita o processo até ficar satisfeito).\n\nNote: **não** \n\n"
    },
    {
      "title": "Revertendo edições",
      "level": 3,
      "content": "Se uma página foi editada incorretamente, os procedimentos a seguir descrevem como fazer para reverter um artigo para uma versão anterior. Para reverter uma única edição:\n\n1. Clique na aba View history no topo da página a ser modificada (ao lado da aba Edit source). Uma lista de revisões é exibida.\n1. Clique no link undo à direita da edição indesejada. Uma previsão da edição é exibida, mostrar a revisão atual na esquerda e o texto a ser salvo à direita.\n1. Escreva o motivo pelo qual você está desfazendo essa edição no campo de resumo de edição.\n1. Se estiver satisfeito, clique no botão Save changes embaixo da página.\n\nA página wiki deve agora estar de volta em seu estado original.\n\nOcasionalmente, é necessário reverter diversas últimas edições de uma só vez. Para reverter um artigo para uma versão anterior:\n\n1. Clique na aba View history no topo da página a ser modificada (ao lado da aba Edit source). Uma lista de revisões é exibida.\n1. Veja a revisão desejada (i.e. a última versão boa) clicando na marca de tempo apropriada. Aquela revisão será exibida.\n1. Clique na aba Edit source no topo da página. Um aviso é exibido: Warning: You are editing an out-of-date revision of this page. If you save it, any changes made since this revision will be lost.\n1. Escreva a marca de tempo da revisão (exibida no topo da página) e um motivo pelo qual você está revertendo o estado de uma página no campo de resumo de edição.\n1. Se estiver satisfeito, simplesmente clique no botão Save changes para reverter para essa versão.\n\nNote: **lost** \n\n- Evite combinar um desfazimento com uma edição. Reverta a edição primeiro e, então, faça alterações adicionais; não edite a previsão de revisão.\n- Considere usar um resumo de edição especialmente detalhado e verboso ao realizar um desfazimento para evitar longas discussões.\n\n"
    },
    {
      "title": "Criando páginas",
      "level": 2,
      "content": "Antes de criar uma nova página, por favor considere o seguinte:\n\n- Seu tópico é relevante para o Arch Linux? Artigos irrelevantes ou inúteis serão excluídos.\n- Seu tópico é de interesse de outros? Considere não apenas o que você deseja escrever sobre, mas também o que outros podem querer ler. Notas pessoais pertencem a sua página de usuário.\n- Seu tópico compensa uma nova página? Pesquise no wiki por artigos similares. Se eles existirem, considere melhorar ou adicionar uma seção a um artigo existente.\n- Sua contribuição será significante? Evite criar esboços a menos que planeje expandi-los em pouco depois.\n\nCriar uma nova página exige seleção de um título descritivo e uma categoria apropriada.\n\nPor favor, leia Help:Diretrizes para nomenclatura de artigos e Help:Estilo#Título para recomendação de nomenclatura de artigo. Não inclua \"Arch Linux\" ou variações nos títulos de páginas. Esse é o wiki do Arch Linux; presume-se que os artigos estarão relacionados para o Arch Linux (ex.: \"Installing Openbox\"; não \"Installing Openbox in Arch Linux\").\n\nVisite a Tabela de conteúdo para ajudar a escolher uma categoria apropriada. Artigos podem pertencer a múltiplas categorias, desde que uma categoria não seja mãe de outra (veja Help:Estilo#Categorias).\n\nPara adicionar uma nova página a algumas categorias (digamos \"My new page\" a \"Some category\") você precisaria:\n\n1. Crie uma página com seu novo título navegando para https://wiki.archlinux.org/title/My_new_page (lembre-se de substituir \"My_new_page\" com o título desejado!)\n1. Adicione [[Category:Alguma categoria]] no topo de sua página\n\nNeste estágio, o novo artigo ainda é considerado um órfão. Para completar o trabalho, gaste um tempo extra para vincular ao novo artigo de outros: isso vai melhorar sua visibilidade e encorajar mais usuários a contribuir para ela. Candidatos prováveis são artigos sobre software relacionado, páginas de visão mais genéricas ou até mesmo listas mais simples como Lista de aplicativos.\n\nEm alguns casos, pode fazer sentido criar uma subpágina, ou seja, um filho de outra página: os títulos das subpáginas são separados do título da superpágina com os símbolos \"/\" (barra). Isso geralmente é útil para preparar rascunhos na própria página de usuário, por exemplo https://wiki.archlinux.org/title/User:MySelf/My_new_subpage.\n\n"
    },
    {
      "title": "Formatando",
      "level": 2,
      "content": "Formatação de texto é acompanhado com marcação wiki sempre que possível; aprender HTML não é necessário. Vários modelos também estão disponíveis para tarefas comuns de formatação; veja Help:Modelo para informações sobre modelos. O Help:Folha de dicas resume a maior das opções de formatação comum.\n\n"
    },
    {
      "title": "Títulos e subtítulos",
      "level": 3,
      "content": "Usar os Títulos e subtítulo é uma maneira fácil de melhorar a organização do artigo. Caso perceba que dois ou mais tópicos podem ser discutidos, é melhor dividi-los inserindo um título para cada sessão. Veja Help:Estilo#Títulos de seção e Help:Uso efetivo de cabeçalhos para informações de estilo.\n\nTítulos devem iniciar do segundo nível e podem ser criados assim:\n\n```\n== Título de segundo nível ==\n\n=== Título de terceiro nível ===\n\n==== Título de quarto nível ====\n\n===== Título de quinto nível =====\n\n====== Título de sexto nível ======\n```\n\nSe um artigo possuir mais de três títulos será gerado automaticamente uma tabela de conteúdo (TOC). Se isso não for desejado, coloque __NOTOC__ no artigo. Tente criar alguns títulos em Sandbox e veja o que acontece na TOC.\n\n"
    },
    {
      "title": "Quebras de linha",
      "level": 3,
      "content": "Uma linha vazia é usada para iniciar um novo parágrafo enquanto uma quebra de linha tem nenhum efeito em parágrafos regulares.\n\nA tag HTML <br> pode ser usada para inserir manualmente quebras de linha, mas devem ser evitadas. Uma quebra manual deve estar justificada com outros elementos de formatação, tais como listas.\n\nTable content:\nwikitext | renderização\nEssa sentença está quebrada em três linhas. | Essa sentença está quebrada em três linhas.\nEsse é o parágrafo número um. Esse é o parágrafo número dois. | Esse é o parágrafo número um. Esse é o parágrafo número dois.\n* Esse ponto <br> expande múltiplas linhas * Esse ponto termina a lista | Esse ponto expande múltiplas linhas Esse ponto termina a lista\n\n```\nEssa sentença\nestá quebrada em\ntrês linhas.\n```\n\nEssa sentença está quebrada em três linhas.\n\n```\nEsse é o parágrafo número um.\n\nEsse é o parágrafo número dois.\n```\n\nEsse é o parágrafo número um.\n\nEsse é o parágrafo número dois.\n\n```\n* Esse ponto <br> expande múltiplas linhas\n* Esse ponto\ntermina a lista\n```\n\n- Esse ponto expande múltiplas linhas\n- Esse ponto\n\ntermina a lista\n\nVeja Help:Estilo/Espaço em branco para informações sobre uso adequado de caracteres de espaço em branco.\n\n"
    },
    {
      "title": "Negrito e itálico",
      "level": 3,
      "content": "Negrito e itálicos são adicionados ao cercar a palavra ou frase com dois, três ou cinco apóstrofes ('):\n\nTable content:\nwikitext | renderização\n''itálico'' | itálico\n'''negrito''' | negrito\n'''''negrito e itálico''''' | negrito e itálico\n\n''itálico''\n\nitálico\n\n'''negrito'''\n\nnegrito\n\n'''''negrito e itálico'''''\n\nnegrito e itálico\n\n"
    },
    {
      "title": "Tachado",
      "level": 3,
      "content": "Use texto tachado para mostrar que o texto já foi resolvido ou não mais possui relevância.\n\nTable content:\nwikitext | renderização\n<s>Texto tachado</s> | Texto tachado\n\n```\n<s>Texto tachado</s>\n```\n\nTexto tachado\n\n"
    },
    {
      "title": "Listas",
      "level": 3,
      "content": "Lembre-se de que a sintaxe wiki não oferece suporte a itens de lista multilinha; toda caractere de nova linha termina a definição do item de lista. Para iniciar uma nova linha dentro de um item de lista, use a tag <br>. Para inserir um bloco de código multilinha dentro de um item de lista, use Template:bc e escape o conteúdo usando tags <nowiki>. Veja também Help:Estilo/Espaço em branco e Help:Modelo.\n\n"
    },
    {
      "title": "Lista de marcadores",
      "level": 4,
      "content": "Marcadores não possuem uma ordem aparente de itens.\n\nPara inserir um marcador, use um asterisco (*). Múltiplos *s vão aumentar o nível de recuo.\n\nTable content:\nwikitext | renderização\n* Primeiro Item * Segundo Item ** Uma sublista no segundo item * Isso não é divertido? | Primeiro Item Segundo Item Uma sublista no segundo item Isso não é divertido?\n\n```\n* Primeiro Item\n* Segundo Item\n** Uma sublista no segundo item\n* Isso não é divertido?\n```\n\n- Primeiro Item\n- Segundo Item Uma sublista no segundo item\n- Isso não é divertido?\n\n- Uma sublista no segundo item\n\n"
    },
    {
      "title": "Listas numeradas",
      "level": 4,
      "content": "Listas numeradas introduzem numeração e, portanto, ordenam os itens de lista. Em geral, você deve usar listas não ordenadas desde que a ordem na qual os itens aparecem não é a preocupação principal.\n\nPara criar listas numeradas, use o símbolo de cerquilha (#). Múltiplos #s vão aumentar o nível de recuo.\n\nTable content:\nwikitext | renderização\n# Primeiro Item # Segundo Item ## Subitem # Terceiro Item | Primeiro Item Segundo Item Subitem Terceiro Item\n# Primeiro Item # Segundo Item ## Subitem # Terceiro Item | Primeiro Item Segundo Item Subitem Terceiro Item\n\n```\n# Primeiro Item\n# Segundo Item\n## Subitem\n# Terceiro Item\n```\n\n1. Primeiro Item\n1. Segundo Item Subitem\n1. Terceiro Item\n\n1. Subitem\n\n```\n# Primeiro Item\n# Segundo Item\n## Subitem\n# Terceiro Item\n```\n\n1. Primeiro Item\n1. Segundo Item Subitem\n1. Terceiro Item\n\n- Subitem\n\n"
    },
    {
      "title": "Listas de definição",
      "level": 4,
      "content": "Listas de definição são definidas iniciando com um ponto e vírgula (;) e por dois pontos (:) após o termo.\n\nTable content:\nwikitext | renderização\nListas de definição: ; Teclado: Dispositivo com botões ou teclas ; Mouse: Dispositivo de apontamento para entrada bidimensional ou ; Teclado : Dispositivo com botões ou teclas ; Mouse : Dispositivo de apontamento para entrada bidimensional | Listas de definição: Teclado Dispositivo com botões ou teclas Mouse Dispositivo de apontamento para entrada bidimensional ou Teclado Dispositivo com botões ou teclas Mouse Dispositivo de apontamento para entrada bidimensional\nUse dois pontos adicionais se um termo possuir múltiplas definições: ; Termo : Primeira definição : Segunda definição | Use dois pontos adicionais se um termo possuir múltiplas definições: Termo Primeira definição Segunda definição\n\n```\nListas de definição:\n; Teclado: Dispositivo com botões ou teclas\n; Mouse: Dispositivo de apontamento para entrada bidimensional\nou\n; Teclado\n: Dispositivo com botões ou teclas\n; Mouse\n: Dispositivo de apontamento para entrada bidimensional\n```\n\nListas de definição:\n\nou\n\n```\nUse dois pontos adicionais se um termo possuir múltiplas definições:\n; Termo\n: Primeira definição\n: Segunda definição\n```\n\nUse dois pontos adicionais se um termo possuir múltiplas definições:\n\nListas de definição não devem ser simplesmente usadas para formatação, veja exemplos do W3.\n\n"
    },
    {
      "title": "Bloco de código em itens de lista",
      "level": 4,
      "content": "Um exemplo com código de bloco em listas:\n\nTable content:\nwikitext | renderização\n# Primeiro item # Segundo item: {{bc|<nowiki> código1 código2 código3 </nowiki>}} # Terceiro item | Primeiro item Segundo item: código1 código2 código3 Terceiro item\n\n```\n# Primeiro item \n# Segundo item: {{bc|<nowiki>\ncódigo1\ncódigo2\ncódigo3\n</nowiki>}}\n# Terceiro item\n```\n\n1. Primeiro item\n1. Segundo item: código1 código2 código3\n1. Terceiro item\n\n```\ncódigo1\ncódigo2\ncódigo3\n```\n\n"
    },
    {
      "title": "Recuo",
      "level": 3,
      "content": "Para recuar um texto, coloque dois pontos (:) no começo da linha. Quanto mais dois pontos se coloca maior será a distância da margem. Uma nova linha marca o fim do parágrafo recuado.\n\nTable content:\nwikitext | renderização\nAqui está alinhado totalmente à esquerda :Aqui está levemente identado ::Aqui está um pouco mais | Aqui está alinhado totalmente à esquerda Aqui está levemente identado Aqui está um pouco mais\n\n```\n:Aqui está levemente identado\n::Aqui está um pouco mais\n```\n\nAqui está alinhado totalmente à esquerda\n\n"
    },
    {
      "title": "Código",
      "level": 3,
      "content": "Para adicionar códigos ao wiki, use um dos modelos de formatação de código. Alternativamente, simplesmente inicie cada linha com um único caractere de espaço em branco. Por exemplo:\n\n```\n$ echo Olá Mundo\n```\n\nVeja também Help:Estilo#Formatação de código.\n\n"
    },
    {
      "title": "Tabelas",
      "level": 3,
      "content": "Usado com efetividade, tabelas podem ajudar a organizar e resumir conjuntos de dados. Para sintaxe e formatação avançada de tabelas, veja Ajuda:Guia de edição/Usar tabelas.\n\nTable content:\nwikitext | renderização\n{| class=\"wikitable\" |+ Dados tabulares ! Distro !! Cor |- | Arch || Azul |- | Gentoo || Roxo |- | Ubuntu || Laranja |} | Dados tabulares Distro Color Arch Azul Gentoo Roxo Ubuntu Laranja | Distro | Color | Arch | Azul | Gentoo | Roxo | Ubuntu | Laranja\nDistro | Color\nArch | Azul\nGentoo | Roxo\nUbuntu | Laranja\n{| class=\"wikitable\" ! Sistema de arquivos !! Tamanho !! Usado !! Disponível !! %Uso !! Montado em |- | rootfs || 922G || 463G || 413G || 53% || / |- | /dev || 1.9G || 0 || 1.9G || 0% || /dev |} | Sistema de arquivos Tamanho Usado Disponível %Uso Montado em rootfs 922G 463G 413G 53% / /dev 1.9G 0 1.9G 0% /dev | Sistema de arquivos | Tamanho | Usado | Disponível | %Uso | Montado em | rootfs | 922G | 463G | 413G | 53% | / | /dev | 1.9G | 0 | 1.9G | 0% | /dev\nSistema de arquivos | Tamanho | Usado | Disponível | %Uso | Montado em\nrootfs | 922G | 463G | 413G | 53% | /\n/dev | 1.9G | 0 | 1.9G | 0% | /dev\n\n```\n{| class=\"wikitable\"\n|+ Dados tabulares\n! Distro !! Cor\n|-\n| Arch || Azul\n|-\n| Gentoo || Roxo\n|-\n| Ubuntu || Laranja\n|}\n```\n\nTable content:\nDistro | Color\nArch | Azul\nGentoo | Roxo\nUbuntu | Laranja\n\n```\n{| class=\"wikitable\"\n! Sistema de arquivos !! Tamanho !! Usado !! Disponível !! %Uso !! Montado em\n|-\n| rootfs || 922G || 463G || 413G || 53% || /\n|-\n| /dev || 1.9G || 0 || 1.9G || 0% || /dev\n|}\n```\n\nTable content:\nSistema de arquivos | Tamanho | Usado | Disponível | %Uso | Montado em\nrootfs | 922G | 463G | 413G | 53% | /\n/dev | 1.9G | 0 | 1.9G | 0% | /dev\n\n"
    },
    {
      "title": "Links",
      "level": 2,
      "content": "Os links são essenciais para ajudar os leitores a navegar pelo site. Em geral, editores devem se assegurar de que todos os artigos contenham links de saída para outros artigos (evite páginas sem saída e estejam referenciados por links de entrada de outros artigos (a página especial what links here pode ser usado para exibir páginas afluentes, ou seja, links para a página consultada). Veja também Help:Estilo/Formatação e pontuação#Primeiras instâncias.\n\n"
    },
    {
      "title": "Links internos",
      "level": 3,
      "content": "É possível fazer inúmeras referências recíprocas entre as páginas deste wiki. Para fazer um link para uma outra parte da página de um mesmo wiki, coloque o título envolto por dois colchetes.\n\nPor exemplo, se você deseja fazer um link para, digamos, o artigo pacman (Português), use:\n\n```\n[[pacman (Português)]]\n```\n\nSe você quiser usar palavras diferentes do título do artigo como o texto do link, você pode usar um rótulo após o símbolo pipe (\"|\") para fornecer um texto alternativo.\n\nPor exemplo:\n\n```\nO [[ArchWiki:Sobre|ArchWiki]] é a fonte de documentação principal do Arch Linux.\n```\n\n...é renderizada assim:\n\nQuando você deseja usar o plural de um título de artigo (ou adicionar qualquer outro sufixo) para seu link, você pode adicionar as letras extras diretamente fora dos colchetes.\n\nPor exemplo:\n\n```\nmakepkg é usado em conjunto com os [[PKGBUILD (Português)|PKGBUILD]]s.\n```\n\n...é renderizado assim:\n\n"
    },
    {
      "title": "Links de seção",
      "level": 4,
      "content": "Para criar um link para uma seção de um documento, basta adicionar um # seguido pelo título da seção.\n\nPor exemplo:\n\n```\n[[Help:Edição#Links de seção]]\n```\n\n...é renderizado assim:\n\n"
    },
    {
      "title": "Truque do pipe",
      "level": 4,
      "content": "Em alguns casos, é possível usar o truque de pipe para salvar escrevendo o rótulo dos links de wiki. Os casos mais importantes usáveis no ArchWiki são:\n\n1. Em títulos de artigo, ele permite ocultar o sufixo do idioma. Por exemplo, [[Main page (Português)|]] vira Main page.\n1. Em links para espaços de nome diferentes ou wiki, o truque de pipe oculta o prefixo. Por exemplo, [[ArchWiki:Sobre|]] vira Sobre e [[wikipedia:Help:Pipe trick|]] vira Help:Pipe trick.\n\nQuando a página é salva, o truque de pipe criará automaticamente o rótulo para o link e alterará o wikitext conforme adequado.\n\n"
    },
    {
      "title": "Links interlíngua",
      "level": 3,
      "content": "Veja Help:i18n (Português)#Links interlínguas\n\n"
    },
    {
      "title": "Links interwiki",
      "level": 3,
      "content": "Os tão conhecidos links interwiki podem ser usados para facilmente fazer um link para artigos em outros Wikis externos, como, por exemplo, o Wikipédia. A sintaxe para esse tipo de link é o nome do wiki seguido por dois pontos e o artigo ao qual você deseja vincular envolto por duas duplas de colchetes.\n\nSe você deseja criar um link para o artigo Wikipedia:Arch Linux, você pode usar o seguinte:\n\n```\n[[Wikipedia:Arch Linux]]\n```\n\nOu você pode criar um link seguido por pipe com um rótulo de link para artigo do Wikipédia sobre o Arch Linux:\n\n```\n[[Wikipedia:Arch Linux|artigo do Wikipédia sobre o Arch Linux]]\n```\n\nVeja: mw:Help:Links/pt-br#Links interwiki\n\nA lista de todos os links interwiki disponíveis no ArchWiki pode ser vista em Special:Interwiki ou a API.\n\nNote: resulta em Wikipedia:pt:Arch Linux.\n\n```\n[[Wikipedia:pt:Arch Linux]]\n```\n\nresulta em Wikipedia:pt:Arch Linux.\n\n"
    },
    {
      "title": "Links externos",
      "level": 3,
      "content": "Se você deseja vincular a um site externo, apenas digite a URL completa para a página a qual você deseja.\n\n```\nhttps://archlinux.org/\n```\n\nGeralmente é mais útil fornecer ao link um rótulo alternativo em vez de exibir a URL. Diferentemente de #Links internos, links externos com um rótulo uma única dupla de colchetes e a URL alvo são separadas por um espaço (e não um pipe). Por exemplo, para o link aparecer como Arch Linux, basta digitar:\n\n```\n[https://archlinux.org/ Arch Linux]\n```\n\nTambém é possível gerar um rótulo autonumerado simplesmente envolvendo a URL com uma única dupla de colchetes. Geralmente, é preferível usar frases como \"veja aqui\". Para produzir uma frase \"veja [1]\", no qual o número vai variar dependendo da ordem do link na página, basta digitar:\n\n```\nveja [https://archlinux.org/]\n```\n\n- Ao vincular as outras páginas do ArchWiki (i.e. os links iniciam com https://wiki.archlinux.org/), use #Links internos. Ao vincular para páginas do Wikipédia (i.e. as páginas iniciam com https://en.wikipedia.org/), use #Links interwiki.\n- Ao criar links para problemas em gitlab.archlinux.org, use Template:Issue.\n- Ao vincular a pacotes ou grupos de pacotes, use o modelo apropriado em vez disso. Veja Help:Style#Instruções de gerenciamento de pacote.\n\n"
    },
    {
      "title": "Redirecionamentos",
      "level": 2,
      "content": "Para redirecionar automaticamente de uma página para outra, adicione #redirect e um link interno (para a página, a qual deve ser redirecionada) no começo de uma página.\n\nPor exemplo, pode poderia redirecionar \"Pinguins\" para \"Pinguim\":\n\n```\n#redirect [[Pinguim]]\n```\n\nDessa forma, qualquer pessoa digitando qualquer uma das opções na caixa de pesquisa vai automaticamente acessar \"Pinguim\".\n\nRedirecionamentos também permitem manter rastro do motivo pelo qual links são feitos (ex.: agrupá-los em páginas WhatLinksHere) e permitem rápida atualização de fragmentos de links em caso de renomeio de seções. Como uma desvantagem, redirecionamentos não mostram no navegador o link da página alvo.\n\nAntes de criar um redirecionamento, você pode realizar uma pesquisa para verificar existentes compatíveis. Por exemplo, Xorg.\n\nVeja também Help:Estilo#Páginas de redirecionamento e Help:Procedimentos#Lidar com páginas de discussão após redirecionar uma página para outra.\n\n- Redirecionamentos não devem apontar para outros sites.\n- Redirecionamentos não funcionam para páginas de categoria.\n- Redirecionamentos são resolvidas internamento pelo servidor e não deixará mais lento para abrir um artigo.\n- Redirecionar uma página existente para outra pode criar redirecionamentos duplos: veja Help:Procedimentos#Corrigir redirecionamentos duplos para corrigi-los.\n\n"
    },
    {
      "title": "Variáveis, palavras mágicas e modelos do Wiki",
      "level": 2,
      "content": "MediaWiki reconhece certas strings especiais dentro de um artigo que alteram comportamentos padrões. Por exemplo, adicionar a palavra __NOTOC__ em qualquer lugar em um artigo vai evitar a criação de uma tabela de conteúdo. De forma similar, a palavra __TOC__ pode ser usada para alterar a posição padrão da tabela de conteúdo. Veja Help:Magic words para detalhes.\n\nModelos e variáveis são porções predefinidas de wikitext que pode ser inserido para auxiliar na formatação de conteúdo.\n\nVariáveis são definidas pelo sistema e podem ser usadas para exibir informações sobre a página atual, wiki ou data. Por exemplo, use {{SITENAME}} para exibir o nome do site do wiki (aqui é exibido como \"ArchWiki\"). Para definir um cabeçalho de título alternativo para a página atual, outra variável wiki pode ser usada: {{DISPLAYTITLE:Novo título}}. (Mas é muito restrita: você só pode alterar a primeira letra para minúsculo e substituir espaços com sublinhados — string de título normalizado deve corresponder ao nome real da página, do contrário não vai funcionar; use o modelo {{Lowercase title}} para exibir a primeira letra de título em minúsculo).\n\nModelos (Templates), por outro lado, são definidos por usuário. O conteúdo de qualquer página pode ser incluída em outra página ao adicionar {{Espaço de Nome:Nome Página}} para um artigo, mas isso raramente é usado com páginas foram do espaço de nome Template. (Se o espaço de nome é omitido, Template é presumido.) Por exemplo, Template:Note, que pode ser incluído em um artigo com o seguinte wikitext:\n\n```\n{{Note|Isso é uma nota.}}\n```\n\n...é renderizado como:\n\nPara páginas em português, prefira usar modelos em português. Por exemplo, em vez de Template:Tip, use Template:Dica:\n\nVeja Help:Modelo para mais informações e uma lista de modelos disponíveis, como Template:Tip ou Template:Warning.\n\n"
    }
  ]
}