{
  "title": "ArchWiki Translation Team",
  "url": "https://wiki.archlinux.org/title/ArchWiki_Translation_Team",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nRelated articles\n\n- Help:i18n\n- International communities\n\n"
    },
    {
      "title": "Create a new page and its translation",
      "level": 2,
      "content": "Note: **Make sure to proofread everything if you use it.** \n\n"
    },
    {
      "title": "Choose a page to translate",
      "level": 3,
      "content": "You can find pages to translate through below methods:\n\n- Search for the pages you are most familiar with, check if they are already translated.\n- Start from most important pages such as Installation guide, Main page or General recommendations, read through them and open pages directly linked by them. Check if they are translated.\n- Check the pages with most revisions.\n- Or use the random page function to find untranslated pages.\n\nLet us take this very page as an example: ArchWiki Translation Team.\n\n"
    },
    {
      "title": "Determine the new page title",
      "level": 3,
      "content": "Page titles of all i18n pages should follow Help:i18n#Page titles. If you are not familiar with the exact rule, you can use below method to get the page name:\n\n1. At the top of the English page, click the Edit tab in the horizontal menu.\n1. Add an interlanguage link for the language you are going to create, but do not save the page yet.\n1. Preview the page with the new interlanguage link.\n1. Visit the interlanguage link you have just created which will lead you to ArchWiki Translation Team (Language) (open new tab, do not close preview page), where \"Language\" is the language name associated with the translation you are about to create. Note: If you have Show preview without reloading the page checked in Special:Preferences#mw-prefsection-editing-preview, the interlanguage link will not appear in the preview.\n1. Since the new page does not exist, create it by clicking on Create in the horizontal menu.\n\n"
    },
    {
      "title": "Translate content",
      "level": 3,
      "content": "1. Copy entire source code of the English page.\n1. You will be shown a simple text editor. Paste here the source code of the page you copied earlier.\n1. Localize the Category links. For example, change [[Category:ArchWiki]] to [[Category:ArchWiki (Language)]]. See Help:Category for more information.\n1. Add an interlanguage link to the article from which you are translating. If you added an interlanguage link to the new page before copying the source code of the English page, remove it from the source code of the new page.\n1. Translate the copied page text and save everything, also adding a proper edit summary such as translate [[ArchWiki Translation Team]].\n1. At the top of the translated page, there is a list of categories the page is included in. Check that all these categories exist, i.e. the links should not be red. Otherwise create all missing categories following the red links - categories are created the same way as regular pages.\n1. Add Template:TranslationStatus to the translated page. For usage, see Template:TranslationStatus#Usage.\n1. (optional) Create another page, e.g. Translated title of ArchWiki Translation Team, whose title will be a localized version of ArchWiki Translation Team (Language). Enter #redirect [[ArchWiki Translation Team (Language)]] as its only content and save it.\n\n"
    },
    {
      "title": "Add interlanguage link",
      "level": 3,
      "content": "Return to the English page. Add Help:i18n#Interlanguage links and save it this time. If the page is protected, leave a request in its talk page instead. A maintainer will add the interlanguage link for you.\n\n"
    },
    {
      "title": "Maintaining translations",
      "level": 2,
      "content": "Use Template:TranslationStatus to make it easier keeping track of any untranslated new changes.\n\nSpecial attention should be paid to important articles such as the Installation guide, Arch Linux and similar. English typo fixes, which are not part of e.g a command or its output, do not have to apply to your translation can usually be safely ignored.\n\nTranslations of new content do not have to happen immediately. Since reverts can happen quite frequently, you are free to wait before translating potentially low quality or dubious edits to not spend time on something that will be undone eventually.\n\n"
    },
    {
      "title": "Dealing with old translations",
      "level": 3,
      "content": "Unfortunately, there are many outdated or insufficient translations. If you find any of these, flag them with either Template:Translateme or Template:Bad translation if they have not been flagged yet. The former is used on translations which are not yet critically outdated. Change Template:Translateme to Template:Bad translation if the translation has become critically outdated.\n\nIf a bad translation has been flagged for a while, preferably 6-12 months, but no one updated it, you may redirect it to the English article. You may redirect translations without flagging first when they:\n\n- Contain dangerous information (includes but is not limited to destructive commands or wrong/missing security-related instructions).\n- Have been obviously abandoned since its creation (which has to be at least 2 years ago, to give translators plenty of time). You may ignore later minor edits not related to the translation (bot edits, changing categories, fixing grammar and so on) to determine if a translation has been abandoned.\n- Are ancient (last translated over 5 years ago and is significantly out of sync with the English page).\n\n- You may ignore later minor edits not related to the translation (bot edits, changing categories, fixing grammar and so on) to determine if a translation has been abandoned.\n\nThis does only partially apply to small articles where only the English version is rarely updated. If the translation is fine but only contains e.g one critically outdated command, fix it instead of redirecting.\n\n"
    },
    {
      "title": "Templates that can be translated",
      "level": 2,
      "content": "The following table lists all templates that may be translated. Translations of this section should add a column to the table linking their translated templates in their preferred usage form (possibly using Template redirects).\n\nTable content:\nEnglish template\nArticle templates\nTemplate:Related articles start\nTemplate:Unsupported\nTemplate:Yes\nTemplate:No\nTemplate:Tip\nTemplate:Note\nTemplate:Warning\nTemplate:Dead link\nTemplate:Broken package link\nTemplate:Broken section link\nTranslation status templates\nTemplate:Bad translation\nTemplate:Translateme\nTemplate:TranslationStatus\nNavigation templates\nTemplate:Laptops table header\nTemplate:Laptops navigation\nTemplate:List of applications navigation\nTemplate:Package guidelines\nSpecial templates\nTemplate:Cat main\nTemplate:Template\nTemplate:META Error\nTemplate:META Unexplained Status Template\nTemplate:Comment\nTemplate:Committed identity\nTemplate:Unsigned\n\n"
    },
    {
      "title": "Templates that should be omitted from translations",
      "level": 2,
      "content": "When page or section is flagged with Template:Accuracy, Template:Style, Template:Archive, Template:Remove or Template:Out of date — do not translate pages/sections in question until offending issues have been fixed and template removed.\n\nIf you see Template:Expansion, Template:Merge, Template:Move or Template:Redirect you can safely translate the page, but do not copy these templates over to the translated article.\n\nIf you see Template:Broken package link, Template:Broken section link or Template:Dead link, do not copy those templates over to the translated article. Either fix them in original text, then copy and/or translate fixed links, or omit whole sentence or section concerning them when translating.\n\n"
    },
    {
      "title": "Page list",
      "level": 2,
      "content": "List here articles that only exist in non-English languages, or that exist in English but are either not fully translated, or are in a worse state than the non-English version. Keep alphabetical order.\n\nTable content:\nPage | Language | Notes\nAlfis (Русский) | Russian | \nApache OpenMeetings (Русский) | Russian | \nLocalization (正體中文)/Traditional Chinese (正體中文) | Chinese (Traditional) | \nKubeadm (Français) | Français | \n\n"
    }
  ]
}