{
  "title": "Archinstall (Español)",
  "url": "https://wiki.archlinux.org/title/Archinstall_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "archinstall es una librería auxiliar que automatiza la instalación de Arch Linux. Está empaquetada con diferentes instaladores pre-configurados, como un instalador \"guiado\".\n\nEste documento no trata sobre el uso de archinstall como una librería de Python; revise la documentación oficial para eso.\n\n- La manera recomendada de instalar Arch Linux continúa siendo seguir la guía de instalación.\n- archinstall almacena todas las contraseñas de usuario y de cifrado de discos (secundarios) en texto plano [1]\n- archinstall proporciona diferentes valores por defecto en comparación con el proceso de instalación regular. Cuando utilice un sistema instalado con archinstall, por favor, menciónelo en las solicitudes de soporte y proporcione el archivo /var/log/archinstall/install.log.\n\n"
    },
    {
      "title": "Ejecutando el instalador",
      "level": 2,
      "content": "Primero, adquiera y arranque el entorno live conforme a como se indica en la guía de pre-instalación. El paquete archinstall hace parte del medio vivo y puede ser ejecutado directamente:\n\n```\n# archinstall\n```\n\nEl instalador guiado le solicitará que introduzca datos en varios pasos, descritos en la documentación oficial.\n\nPuede instalar paquetes adicionales especificándolos después del campo Write additional packages to install (\"Escriba paquetes adicionales para instalar\").\n\nUna vez se complete la instalación, un texto verde debería aparecer indicando que es seguro reiniciar (reboot) el sistema, el cual es, a su vez, el comando que debe utilizar para reiniciar.\n\n"
    },
    {
      "title": "Perfiles",
      "level": 3,
      "content": "archinstall incluye perfiles, o conjuntos de paquetes y opciones pre-configuradas que pueden ser instaladas junto al sistema operativo base.\n\n"
    },
    {
      "title": "Vea también",
      "level": 2,
      "content": "- python-archinstall: guided\n\n"
    }
  ]
}