{
  "title": "Arch compared to other distributions (Čeština)",
  "url": "https://wiki.archlinux.org/title/Arch_compared_to_other_distributions_(%C4%8Ce%C5%A1tina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Související články\n\n- Arch Linux\n- Arch-based distributions\n- Pacman/Rosetta\n- Arch is the best\n\nTato stránka se pokouší zvýraznit rozdíly mezi Arch GNU/Linux a jinými známými GNU/Linux distribucemi (včetně UNIXových operačních systémů). Souhrny, jež následují, jsou krátké popisy, které pomáhají uživateli se rozhodnout, zdali Arch GNU/Linux jim bude vyhovovat. Zatímco recenze a popisy mohou být užitečné, vlastní zkušenosti jsou bezpochyby nejlepší způsob, jak porovnávat distribuce.\n\nPro důkladnější porovnání, vizte Wikipedie:Porovnání operačních systémů a Wikipedie:Porovnání Linuxových distribucí.\n\nS ostatními distribucemi srovnáváme pouze Arch. Komunitní obdoby, jež podporují jiné architektury než x86_64, mohou být nalezeny v Distribuce založené na Archi.\n\n"
    },
    {
      "title": "Zdrojově založené (\"Source-based\") distribuce",
      "level": 2,
      "content": "Zdrojově založené distribuce jsou přenosné; můžete spravovat a kompilovat celý operační systém a aplikace pro vícero architektur a typů využití, zato musíte obětovat svůj čas, neboť kompilování je časově náročné. Arch a všechny jeho balíčky jsou pouze zkompilovány pro x86_64 architekturu.\n\n"
    },
    {
      "title": "CRUX",
      "level": 3,
      "content": "- CRUX je nenáročná distribuce, jež se řídí KISS principem. CRUX podnítil Judda Vineta, aby stvořil Arch.\n- CRUX užívá inicializační skripty užívané BSD, zatímco Arch používá systemd.\n- Zatímco Arch užívá rolling-release systému, CRUX vydává aktualizace ročně.\n- Obojí poskytuje portsové systémy a podobně jako *BSD nabízí pouze základní prostředí, z něhož si sestavujete vlastní systém.\n- Arch poskytuje pacmana, jenž spravuje binární systémové balíčky a spolupracuje s Arch Sestavovacím Systémem. CRUX používá komunitou založený systém nazývaný prt-get, jenž v kombinaci se svým vlastním ports systémem řeší závislosti balíčků, ale sestavuje všechny balíčky ze zdrojového kódu (nicméně samotná CRUX základní instalace je binární)\n- Jak Arch, tak CRUX oficiálně podporují výhradně x86_64 architekturu.\n- Arch poskytuje obrovskou škálu repozitářů pro binární balíčky a také Arch Uživatelský Repozitář. CRUX nabízí méně náročný oficiálně podporovaný ports systém spolu se slušným komunitním repozitářem.\n\n"
    },
    {
      "title": "LFS",
      "level": 3,
      "content": "- LFS (neboli Linux From Scratch) existuje pouze jako dokumentace. Kniha popisuje, jak získat potřebný zdrojový kód pro minimální základ pro provozuschopný GNU/Linux systém, a jak jej ručně kompilovat, spravovat a nastavovat od základu. LFS je nejmenší možná podoba GNU/Linux systému a též výjimečný výukový zdroj pro sestavování a nastavování základního systému.\n- LFS neposkytuje žádné online repozitáře; zdroje si musíte obstarávat ručně, zkompilovat a nainstalovat pomocí make. (Existuje několik metod, jak spravovat balíčky, a jsou všechny zmíněny v LFS Hints kategorii).\n- Základní instalace Arche nabízí stejné balíčky a navíc systemd, několik dodatečných nástrojů a mocný správce balíčků pacman; to vše již zkompilované pro x86_64 architekturu. Společně s tímto základním systémem Arch komunita a vývojáři poskytují a spravují několik tisíců binárních balíčků instalovatelných skrz pacman a také PKGBUILD sestavovací skripty pro užití společně s Arch Sestavovacím Systémem. Pacman také nabízí makepkg nástroj pro obšírné sestavování a upravování balíčků.\n- Judd Vinet sestavil Arch z ničeho a pak přepsal pacmana do C. Někdy se Arch distribuce popisuje jako \"Linux, ale s vynikajícím správcem balíčků.\"\n\n"
    },
    {
      "title": "Gentoo/Funtoo Linux",
      "level": 3,
      "content": "- Arch GNU/Linux i Gentoo GNU/Linux jsou rolling-release systémy; balíčky jsou téměř hned dostupné po upstream vydání.\n- Gentoo balíčky a základní systém jsou sestaveny přímo ze zdrojového kódu podle uživatelem zadaných USE flags. Arch poskytuje portsový systém pro sestavování balíčku ze zdroje, nicméně základ Arche byl smýšlený jako předem sestavený x86_64 binár. Toto činí Arch rychlejším pro sestavování a aktualizace, zato Gentoo nabízí větší škálu systémového nastavení.\n- Arch pouze podporuje x86_64, kdežto Gentoo oficiálně podporuje x86 (i486/i686), x86_64, PPC/PPC64, SPARC, Alpha, ARM, MIPS, HPPA, S/390 a Itanium architektury.\n- Nástroje, jichž užívá Gentoo pro správu systému a balíčků, jsou spíše náročnější a \"mocnější\" než ty poskytnuté Archem a některé vymoženosti, jež tvoří základ Gentoo (USE flags, SLOTs, atd.), bychom vůbec nenalezli na Arch GNU/Linuxu. To je částečně kvůli skutečnosti, že Arch je binární distribuce, nicméně rozdíly ve filozofii též hrají podstatnou roli; Arch spíš upřednostňuje jednoduchost a vyhýbá se přílišnému zasahování do systému.\n- Jelikož Gentoo i Arch instalace pouze nabízí základní systém, oba jsou považovány za zvlášť nastavitelné. Pokud Gentoo uživatelům nevadí systemd, byli by spokojeni ve většině ohledech s Archem.\n\n"
    },
    {
      "title": "GNU Guix System",
      "level": 3,
      "content": "- GNU Guix Systém je inspirovaný NixOS] podobným způsobem jako Arch je inspirovaný CRUX\n- Jak Arch GNU/Linux, tak Guix Systém jsou rolling-release distribuce; balíčky jsou přístupné distribuci brzy po upstream vydání. Guix Systém je nicméně zdrojově založená distribuce (přestože jsou k mání binární verze a jsou zvané \"náhrady\"), zatímco Arch je převážně binární distribuce.\n- Arch využívá pacman jako správce balíčků, zatímco Guix Systém používá guix, jenž podporuje pokusné způsoby tvoření balíčků, jež nejsou dostupné v jiných distribucích.\n- Arch pouze skýtá x86_64 vydání, zatímco Guix Systém oficiálně podporuje několik architektur.\n- Arch poskytuje systemd jako inicializační systém, zatímco Guix Systém využívá [GNU Shepherd.\n- Guix Systém rozbíjí mnoho tradičních Unix myšlenek, včetně Filesystem Hierarchy Standard. Například mnoho souborů, jež jsou na tradičních distribucích rozděleny do několika rozdílných adresářů, se na Guix Systému nachází někde pod /gnu/store/.\n- Arch může občasně skýtat nesvobodný software (často jako ovladače), zatímco Guix Systém poskytuje výhradně svobodný software a je podporován Free Software Foundation - nicméně jiné repozitáře nabízí nesvobodný software pro Guix jsou k mání.\n- Arch předpokládá, že si uživatel sám nastaví nainstalované softwarové balíčky, ale Guix Systém doporučuje globální konfiguraci v Scheme, jenž inicializuje konfigurační soubory.\n\n"
    },
    {
      "title": "Obecné",
      "level": 2,
      "content": "Tyto distribuce skýtají širokou škálu výhod a vymožeností, jež umožňují využít systém libovolně pro většinu potřeb.\n\n"
    },
    {
      "title": "Debian",
      "level": 3,
      "content": "- Debian je největší upstream GNU/Linux distribuce s obrovskou komunitou a poskytuje stabilní, testovací a nestabilní branche. Nabízí přes 148 000 balíčků. Počet dostupných Arch binárních balíčků je mírnější. Nicméně pokud užíváte AUR, počty jsou srovnatelné.\n- Debian svérázně podporuje svobodný software, nicméně stále nabízí nesvobodný software ve svých nesvobodných repozitářích. Arch je volnější a nabízí nesvobodný software.\n- Debian se věnuje přísnému testování stabilní větve, jež je \"zmrazena\" a podporována až pět let. Arch balíčky jsou současnější než Debian Stable; lze je spíše srovnat s Debian Testing a Unstable větvemi. Je nutné podotknout, že Arch balíčky nemají žádný harmonogram.\n- Debian je dostupný pro mnoho architektur, včetně alpha, arm, hppa, i386, x86_64, ia64, m68k, mips, mipsel, powerpc, s390 a sparc, zatímco Arch je dostupný pouze pro x86_64.\n- Arch poskytuje širší podporu pro sestavování instalovatelných balíčků z jiných zdrojů pomocí portsového sestavovacího systému. Debian neskýtá portsový systém; spoléhá se místo toho na své obrovské repozitáře binárů.\n- Arch instalační systém nabízí pouze minimální základ, jenž je uživateli přístupný při konfiguraci systému, zatímco metody Debianu, jako například užití apt tasks k instalaci předvybraných skupin balíčků, poskytují samovolný postup a také několik jiných způsobů instalace.\n- Arch většinou zabaluje softwarové knihovny spolu s jejich header soubory, zatímco na Debianu se musí stahovat zvlášť.\n- Arch udržuje patchování na minimu; tím se vyhýbá potížím, které upstream nemůže zhodnotit, kdežto Debian opravuje svoje balíčky volně pro širší publikum.\n\n"
    },
    {
      "title": "Fedora",
      "level": 3,
      "content": "- Fedora je komunitou vyvíjená ale podnikově podporována Red Hat; často se prezentuje jako \"testbed release\" systém. Fedora balíčky a projekty se přesouvají do RHEL a některé z nich mohou být časem užity v jiných distribucích. Arch nemá žádná pevná vydání a není testovací větví pro žádnou distribuci.\n- Fedora balíčky používají RPM formát s DNF správcem balíčků. Arch užívá pacmana pro správu svých balíčků.\n- Fedora odmítá skýtat nesvobodný software ve svých oficiálních repozitářích, jelikož jsou odhodláni podporovat svobodný software, nicméně repozitáře třetích stran jsou dostupné pro nesvobodné balíčky. Arch je volnější ve svém přístupu k nesvobodnému softwaru; ponechává rozhodnutí na uživateli.\n- Fedora poskytuje mnoho instalačních způsobů včetně grafického instalátoru a textového. Fedora \"spins\" též nabízí jiné množiny plochových prostředí, z nichž si uživatel může vybrat, a každá obsahuje slušný počet základních balíčků. Arch místo toho poskytuje pouze několik skriptů pro zjednodušení instalačního procesu pro minimální základní systém.\n- Fedora má harmonogram pro nová vydání, ale i oficiálně podporuje aktualizace systému skrz FedUp nástroj. Arch je rolling-release systém.\n- Arch poskytuje portsový systém, kdežto Fedora nikoliv.\n- Arch i Fedora jsou distribuce určené pro zkušené uživatele a vývojáře. Oboje pobízí uživatele, aby přispěli vývoji projektu.\n- Fedora je vyznávaná komunitou pro integraci SELinux, GCJ kompilovaných balíčků (aby nebyly potřeba Oracle JRE) a pro podstatné přispívání upstreamu; Red Hat, a tudíž i Fedora vývojáři, přispívají ze všech distribucí největší procento kódu Linuxovému jádru.\n- Arch GNU/Linux poskytuje široce uznávanou wiki. Fedora wiki je užívaná v původním významu slova \"wiki\"; využívá se pro rychlé dorozumívání mezi vývojáři, testery a uživateli. Není určena pro ostatní jako zdroj skutečností na rozdíl od Arch wiki. Fedora wiki se podobá spíše systému řízení požadavků nebo podnikové wiki.\n\n"
    },
    {
      "title": "Slackware",
      "level": 3,
      "content": "- Slackware využívá inicializační skripty inspirované BSD, kdežto Arch používá systemd.\n- Arch poskytuje správu balíčků v pacmanovi, jenž na rozdíl od standardních nástrojů na Slackwaru, samovolně řeší závislosti balíčků a umožňuje i tak aktualizovat systém. Slackware uživatelé většinou upřednostňují svou ruční metodu řešení závislostí a přitom praví, jakou vládu nad systémem jim to poskytuje. Také mají rádi výjimečnou zásobu předinstalovaných knihoven a závislostí.\n- Arch je rolling-release systém. Slackware se považuje za více konzervativní; dává přednost ověřeným stabilním balíčkům. Arch je víc bleeding-edge v tomto ohledu.\n- Arch GNU/Linux poskytuje několik tisíců binárních balíčků ve svých oficiálních repozitářích, zatímco oficiální repozitáře Slackwaru jsou menší.\n- Arch nabízí Arch Sestavovací Systém, portsový systém, a také AUR, obrovský sbor PKGBUILDů tvořenými uživateli. Slackware nabízí podobný ale jednodušší systém na slackbuilds.org; je to polooficiální repozitář Slackbuildů, jež jsou podobné Arch PKGBUILDům. Slackware uživatelé obvykle nebudou mít problémy s vlastnostmi Arch GNU/Linuxu.\n\n"
    },
    {
      "title": "Distribuce pro začátečníky",
      "level": 2,
      "content": "Distribuce pro začátečníky sdílí mnoho podobností; Arch se samozřejmě trochu liší. Arch může být lepší volba, chcete-li se naučit zacházet s GNU/Linux; musíte si sestavit vlastní systém z malého základu, jelikož základní instalace Arche poskytuje jen málo balíčků. Rozdíly mezi distribucemi jsou popsány níže.\n\n"
    },
    {
      "title": "Ubuntu",
      "level": 3,
      "content": "- Ubuntu je známá distribuce založena na Debianu, jež je peněžně podporována Canonical Ltd., zatímco Arch je nezávisle vyvíjený systém sestavený od nuly.\n- Tyto dva projekty mají velmi odlišné cíle a jsou cílené na jiné uživatele. Arch je zamýšlen pro uživatele, již upřednostňují udělej-si-to-sám přístup, zatímco Ubuntu skýtá přednastavený systém. Arch představuje jednodušší systém, jenž se spoléhá na uživatele, aby jej učinil vhodným svým potřebám. Mnozí Arch uživatelé prvně užívali Ubuntu distribuce a až později přešli na Arch.\n- Arch vývoj neupřednostňuje jedno určené rozhraní; všechno si určuje komunita. Navíc peněžní původ Canonicalu vedl k pochybným rozhodnutím; přidání reklam do Dash menu prostředí Unity nebo sbírání údajů o uživatelích. Arch je nezávislý projekt řízený komunitou bez kterýchkoli peněžních zájmů.\n- Ubuntu poskytuje nová vydání každých 6 měsíců, kdežto Arch je rolling-release systém.\n- Arch nabízí portsový sestavovací systém a Arch Uživatelský Repozitář, kam uživatelé mohou sdílet svoje balíčky pro správce balíčků pacman. Ubuntu využívá složitějšího apt a povoluje sdílení binárních balíčků skrz \"Personal Package Archives.\n- Komunity těchto dvou distribucí se v některých ohledech liší. Arch komunita je mnohem menší a pobízí uživatele, aby přispívali distribuci; komunita Ubuntu je na druhou stranu poměrně velká a mohou si dovolit větší poměr uživatelů, kteří nikdy nepřispějí k vývoji ani údržbě.\n\n"
    },
    {
      "title": "Linux Mint",
      "level": 3,
      "content": "- Linux Mint se zrodil jakožto obdoba Ubuntu a později stvořil LMDE (Linux Mint Debian Edition), jehož základ tvoří Debian; Arch je nezávislá distribuce, jež je závislá pouze na svém vlastním sestavovacím systému a svých repozitářích.\n- Mint skýtá několik grafických nástrojů pro snazší údržbu zvané MintTools. Arch nabízí jenom jednoduché nástroje určené pro příkazovou řádku jako pacman a ponechává správu systému uživateli.\n- Nová vydání Mintu se poskytují každých šest měsíců asi o měsíc pozadu proti Ubuntu. Každé vydání je založeno na nejnovějším Ubbuntu LTS a je podporováno pět let. Linux Mint Debian Edition (LMDE) je založeno na Debian Stable a dostává aktualizace pomocí Mint balíčků a bezpečnostních aktualizací. Arch je místo toho rolling-release distribuce.\n\n"
    },
    {
      "title": "openSUSE",
      "level": 3,
      "content": "openSUSE je založeno na RPM balíčkovém tvaru a svém dobře uznávaném YaST2 grafickém konfiguračním nástroji. Arch neskýtá tyto vymoženosti. openSUSE proto může být vhodnější pro uživatele, již upřednostňují prostředí s grafickými rozhraními, mimovolným nastavováním nebo očekávají plnou provozuschopnost systému hned po instalaci, která neomezuje hlubší nastavování systému.\n\n"
    },
    {
      "title": "Mandriva/Mageia",
      "level": 3,
      "content": "Mandriva Linux (původně znám jako Mandrake Linux) byl stvořen v 1998 s cílem učinit GNU/Linux přístupným všem; je založen na RPM a užívá urpmni správce balíčků. Mageia je obdoba Mandrivy stvořená jedním z Mandriva zaměstnanců, jenž oponoval peněžnímu přístupu původní distribuce, neboť to původně měl být neziskový komunitní projekt. Arch má jednodušší přístup než Mandriva nebo Mageia, jelikož předpokládá, že uživatelé jej budou spravovat ručně, a je určen pro pokročilejší uživatele.\n\n"
    },
    {
      "title": "BSD distribuce",
      "level": 2,
      "content": "- BSD sdílí stejný původ jako Arch a je tvořen UC Berkeley jakožto svobodný UNIX systém. Nejsou to distribuce GNU/Linuxu, nýbrž samostatné UNIX operační systémy inspirovány původním AT&T UNIX kódem.\n- Arch a BSD sdílí stejnou myšlenku řádně integrovaného základního a portového systému. Nicméně na rozdíl od GNU/Linux distribucí jako Arch, BSD jádra a programy v uživatelském prostoru (jako například shell a základní utility jako ls, cp, cat a ps) jsou vyvíjeny pohromadě v jednom zdrojovém repozitáři.\n- BSD licence je permisivní na rozdíl od GPL, jež obsahuje omezení, že odvozená díla musí být vydána pod stejnou nebo shodnou licencí. Arch je vydán pod GPL.\n- Chcete-li se dozvědět více o BSD obdobách, vizte porovnání BSD operačních systémů.\n\n"
    },
    {
      "title": "Vizte též",
      "level": 2,
      "content": "- DistroWatch - Novinky o Linux distribucích a recenze.\n\n"
    }
  ]
}