{
  "title": "Arch Linux (Bahasa Indonesia)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(Bahasa_Indonesia)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux merupakan distribusi Linux yang dikembangkan secara independen dan bersandar pada arsitektur CPU x86-64 yang umum digunakan, serta senantiasa berjuang untuk menyediakan versi stabil paling mutakhir bagi semua piranti lunak dengan model rilis bergulir. Umumnya, instalasi yang digunakan adalah sistem paling minimal, lalu dikonfigurasikan oleh pengguna sehingga hanya fungsi penting saja yang ada, menurut masing-masing pengguna.\n\n"
    },
    {
      "title": "Kesederhanaan",
      "level": 3,
      "content": "Arch Linux mendefinisikan kesederhanaan sebagai tidak ada tambahan ataupun modifikasi yang tidak perlu. Sehingga piranti lunak dirilis berdasarkan apa yang pembuat aslinya inginkan walaupun ada modifikasi yang sangat minim supaya dapat berjalan di Arch Linux. Contohnya adalah modifikasi (umumnya berbentuk berkas patch) untuk memperbaiki error yang belum disetujui oleh pembuat/pengurus piranti lunak.\n\nDengan kata lain, Arch menyediakan berkas konfigurasi berdasarkan pembuat atau pengurus asli piranti lunak dengan tambahan berupa perubahan yang spesifik pada Arch, seperti mengatur path menuju suatu berkas di sistem supaya tidak error. Maka, konfigurasi tersebut tidak boleh menambah fitur otomasi seperti menyalakan layanan (atau \"service\" dalam bahasa inggris) hanya karena paket piranti lunak yang diunduh baru saja terpasang. Pengguna harus menyalakannya sendiri. Selain itu, paket piranti lunak hanya boleh dibelah menjadi paket terpisah saat ada manfaat tertentu, contohnya hemat ruang penyimpanan yang signifikan. Program konfigurasi grafis tidak disediakan secara resmi, supaya pengguna terbiasa untuk menggunakan shell dan editor teks sederhana.\n\n"
    },
    {
      "title": "Modernitas",
      "level": 3,
      "content": "Arch Linux berjuang untuk menjaga versi piranti lunak terbaru tetap stabil, namun harus terhindar dari cacat sistemik. Dikarenakan distribusi ini berdasarkan sistem rilis bergulir, supaya dalam sekali pemasangan bisa diperbaharui terus-menerus.\n\nArch mengayomi banyak fitur terkini yang hadir untuk pengguna GNU/Linux, termasuk penginisiasi sistem seperti systemd, sistem berkas modern, LVM2, RAID berbasis piranti lunak, dukungan udev, dan initcpio (dengan mkinitcpio), serta kernel terkini.\n\n"
    },
    {
      "title": "Pragmatisme",
      "level": 3,
      "content": "Arch adalah distribusi Linux yang pragmatis, bukan idealis. Prinsip ini berlaku sebagai panduan. Sehingga, keputusan dibuat berdasarkan kasus-kasus yang dialami oleh para pembuat dan pengurus piranti lunak. Analisis teknis berdasarkan bukti dan perdebatannya merupakan hal yang perhatikan, bukannya politik atau opini populer.\n\nSebagian besar paket piranti lunak dan build script dalam repo Arch Linux menawarkan piranti lunak terbuka bagi siapapun yang berminat, sebagaimana piranti lunak yang tertutup untuk pengguna yang membutuhkan fungsionalitasnya dibandingkan idealisme keterbukaan.\n\n"
    },
    {
      "title": "Terpusat pada pengguna",
      "level": 3,
      "content": "Sebagian besar distribusi GNU/Linux berusaha menjadi ramah pengguna, Arch Linux juga demikian, dan senantiasa selalu menjadi ramah pengguna. Distribusi ini ditujukan untuk mengisi kebutuhan bagi siapapun yang berkontribusi, daripada untuk menarik perhatian semua pengguna sebanyak mungkin. Maka, ini ditargetkan untuk pengguna GNU/Linux yang sudah mahir, atau siapapun yang memiliki sikap mandiri yang berkenan untuk membaca dokumentasi serta ingin berusaha menyelesaikan masalahnya sendiri.\n\nSemua pengguna dianjurkan untuk berpartisipasi dan berkontribusi kepada distribusi ini. Walaupun pengguna umumnya memiliki sikap mandiri, dalam komunitas ini menyongkong sikap gotong-royong karena pada dasarnya distribusi ini dari pengguna untuk pengguna. Melaporkan dan membantu membenahi masalah merupakan upaya yang sangat dihargai serta pemutakhiran paket apalagi kontribusi di proyek inti sangat diapresiasi. Karena pengurus Arch adalah voluntir dan kontributor aktif yang seringkali meluangkan waktunya untuk menjadi bagian dari tim. Archers (masyarakat Arch Linux) boleh berkontribusi mengumpulkan paket piranti lunak ke Arch User Repository, memutakhirkan dokumentasi di ArchWiki, menyediakan bantuan teknis kepada sesama pengguna, atau sekedar berbagi pendapat di forum, mailing list, atau Internet Relay Chat. Arch Linux adalah sistem operasi pilihan bagi banyak orang di bumi, dan telah hadir komunitas internasional yang menawarkan bantuan dan menyediakan dokumentasi dalam banyak bahasa.\n\n"
    },
    {
      "title": "Keserbagunaan",
      "level": 3,
      "content": "Arch Linux adalah distribusi serba guna. Semenjak pemasangan, hanya menyediakan tampilan command-line saja daripada memasang banyak hal lalu dihapus satu per satu. Pengguna dipersilahkan untuk membuat sistem terkustomisasi dengan memilih beberapa paket piranti lunak berkualitas yang disediakan oleh official repositories untuk arsitektur x86-64.\n\nArch bermodel rilis-bergulir yang didukung dengan pacman, yaitu pengelola paket piranti lunak yang ringan, sederhana, dan cepat untuk memperbaharui sistem terus-menerus hanya dengan satu perintah. Arch juga menyediakan Arch build system yang mempermudah proses pembuatan dan pemasangan paket piranti lunak langsung dari sumber programnya, yang juga hanya dengan satu perintah. Sebagai tambahan, Arch User Repository mengandung banyak paket usulan dari komunitas berupa skrip PKGBUILD untuk membangun program langsung dari sumbernya dengan bantuan aplikasi makepkg. Dengan ini, pengguna dapat dengan mudahnya membuat dan mengurus repositorinya sendiri.\n\n"
    },
    {
      "title": "Sejarah",
      "level": 2,
      "content": "Komunitas Arch tumbuh dan berkembang menjadi salah satu distribusi populer dan berpengaruh, serta disaksikan oleh banyak perhatian dan ulasan bertahun-tahun.\n\nPembuat dan pengurus Arch tidak dibayar, voluntir paruh waktu, dan tidak ada rencana untuk memonetasi Arch Linux. Jadi, Arch akan selalu gratis. Bagi yang penasaran terhadap detil sejarah pengembangan Arch dapat menelusuri Arch di arsip internet Wayback Machine dan arsip berita Arch Linux.\n\n"
    },
    {
      "title": "Tahun-tahun awal",
      "level": 3,
      "content": "Judd Vinet, seorang programmer dari Kanada yang kadang menjadi gitaris, telah memulai pembuatan Arch Linux pada awal tahun 2001. Versi resmi pertama kali adalah Arch Linux 0.1 yang dirilis pada 11 Maret 2002.\n\n"
    },
    {
      "title": "Tahun pertengahan",
      "level": 3,
      "content": "Komunitas awal Arch berkembang stabil, yang mana disaksikan oleh grafik postingan forum, pengguna, dan laporan bug. Selebihnya, era itu diketahui sebagai sebuah komunitas yang terbuka, bersahabat, dan saling membantu.\n\n"
    },
    {
      "title": "Lahirnya situs ArchWiki",
      "level": 3,
      "content": "Pada 8 Juli 2005, ArchWiki pertama kali dibangun dengan MediaWiki engine.\n\n"
    },
    {
      "title": "Terbitnya Era A. Griffin",
      "level": 3,
      "content": "Di akhir 2007, Judd Vinet pensiun dari partisipasinya sebagai pengurus Arch, dan dengan resmi pindah kepemimpinan ke penulis program komputer dari Amerika, bernama Aaron Griffin, yang umumnya dikenal sebagai Phrakture.\n\n"
    },
    {
      "title": "Skrip Pemasang Arch",
      "level": 3,
      "content": "Pada rilis 2012-07-15, skrip pemasang berbasis menu yang sudah tidak berlaku lagi, yaitu Arch Installation Framework (AIF) sebagai pengganti skrip pemasang Arch (arch-install-scripts).\n\n"
    },
    {
      "title": "Era systemd",
      "level": 3,
      "content": "Di antara 2012 dan 2013, sistem inisiator tradisional (System V) digantikan oleh systemd.[1][2][3][4]\n\n"
    },
    {
      "title": "Pemberhentian dukungan i686",
      "level": 3,
      "content": "Pada 2017-01-25, telah diumumkan bahwa dukungan arsitektur CPU i686 dihentikan karena kurangnya popularitas pada pengurus dan komunitas. Pada akhir November 2017, semua paket piranti lunak dengan arsitektur i686 dihapus dari semua duplikat server.\n\n"
    },
    {
      "title": "Tinjauan Seleksi Pemimpin",
      "level": 3,
      "content": "Pada awal 2020, tim staff Arch Linux merancang sebuah proses baru untuk menentukan pemimpin baru. Sudah terdokumentasi di DeveloperWiki:Project Leader.\n\nSetelah Aaron Griffin mengundurkan diri dalam posisinya, pemilu diadakan untuk memilih penggantinya, dan pada 2020-02-24 hasilnya telah dipublikasikan. Maka, Levente Polyak terpilih sebagai pemimpin yang sah.\n\n"
    },
    {
      "title": "Era GitLab",
      "level": 3,
      "content": "Pada Mei 2023, Arch Linux telah bermigrasi dari infrastruktur paket piranti lunak yang ada menjadi GitLab. Selain perubahan internal dan inovasi baru, hal ini menyebabkan pemecahan repositori testing menjadi core-testing dan extra-testing, repositori staging menjadi core-staging dan extra-staging, serta akhirnya community bergabung ke dalam extra. Untuk detailnya, pelajari lebih lanjut di GitLab blog.\n\nBeberapa bulan kemudian, pada November 2023, bug tracker lama yaitu (Flyspray) telah termigrasikan ke dalam GitLab serta fitur kolaborasinya (bagian issues dan merge request) telah dibuka untuk publik. Untuk alasan pengarsipan, ada salinan statis dari bug tracker lama supaya link yang lama tetap bisa diklik.\n\n"
    }
  ]
}