{
  "title": "ArchWiki Translation Team/Style (Español)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_Translation_Team/Style_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artículos relacionados\n\n- Equipo\n- Colaboración\n- Coordinación\n- Glosario\n- Páginas de ayuda\n\n«La regla de oro para toda traducción es, a mi juicio, decir todo lo que dice el original, no decir nada que el original no diga, y decirlo todo con la corrección y naturalidad que permita la lengua a la que se traduce» — Valentín García Yebra\n\n"
    },
    {
      "title": "Introducción",
      "level": 2,
      "content": "Una guía de estilo es un conjunto de indicaciones, especificaciones y glosarios propios sobre cómo redactar y, en nuestro caso, traducir documentos.\n\nA continuación se indica una recopilación de normas de estilo comunes en la traducción procedente de distintas fuentes. Esta guía no pretende ser exhaustiva ni dar soluciones únicas, sino proporcionar unas recomendaciones para un uso neutral de la lengua española bajo cierta unidad de estilo.\n\n"
    },
    {
      "title": "Lecturas altamente recomendadas",
      "level": 3,
      "content": "A fin de tener una comprensión coherente de esta guía, debe conocer una serie de conceptos y convenciones que vienen proporcionados con la lectura de los siguientes artículos:\n\n- Para conocer las reglas de edición véase Help:Editing (Español).\n- Para conocer la estructura de los artículos véase Help:Style (Español).\n- Para conocer las reglas de marcado frecuentemente usadas del lenguaje wikitexto véase Help:Cheatsheet (Español) y Help:Template (Español).\n\n"
    },
    {
      "title": "Documentación adicional",
      "level": 3,
      "content": "Con el fin de que nuestro trabajo esté de acuerdo con las normas que definen nuestra lengua, se hace muy recomendable tener a mano los recursos que ofrece la RAE.\n\nEn especial puede consultar:\n\n- Ortografía de la Lengua Española (2010)\n- Nueva Gramática de la Lengua Española (Manual) (2009)\n- Diccionario Panhispánico de dudas (2005)\n- Diccionario de la Lengua Española (2001), 23.ª Edición\n\n"
    },
    {
      "title": "Reglas ortográficas",
      "level": 2,
      "content": "Las reglas contenidas en esta sección siguen las normas y recomendaciones académicas de la lengua (RAE) que reconocemos como la máxima autoridad en esta materia. Se recogen algunas de las reglas ortográficas que se usan con más frecuencia y aquellas otras que han supuesto alguna novedad respecto a lo indicado en la última edición (2010) de la Ortografía de la Lengua Española (en adelante OLE). También se pretende arrojar luz sobre aquellas grafías que planteen dudas, siguiendo a tal efecto las recomendaciones del Diccionario Panhispánico de Dudas (2005) (en adelante DPD).\n\n- Los signos simples son aquellos que no tienen apertura y cierre, sino solamente cierre, esto es, el punto (.), coma (,), dos puntos (:), punto y coma (;) y puntos suspensivos (…), se escriben siempre pegados a la palabra que les precede y con un espacio que los separa de la palabra o signo que los sigue.\n- El punto (.):\n\n- la primera palabra que siga a un punto siempre se escribirá en mayúsculas (excepto si es un punto de abreviatura);\n- el punto siempre se coloca después (nunca delante) de un signo de cierre de comillas, paréntesis, corchetes o rayas (OLE, 2010, p. 301);\n- no se escribe punto ni en los años ([✔]1999, [✖]1.999) ni en la numeración de páginas (pág. 1023);\n- tampoco se escribe punto tras los signos de interrogación, exclamación y puntos suspensivos.\n\n- El punto y coma (;):\n\n- el punto y coma separa unidades con sentido autónomo, ya sean grupos de palabras u oraciones completas, que a menudo incluyen sus propias comas;\n- la primera palabra que siga a un punto y coma (;) siempre se escribirá en minúsculas (excepto si se trata de un nombre propio);\n- se recomienda emplear este signo en los siguientes dos casos: en enumeraciones y ante conectores, como «sin embargo», «así pues», «en definitiva», «por otra parte», «por tanto», …,\n\n- Los dos puntos (:), como regla general, después de los dos puntos se escribirá en minúscula cuando enuncien una enumeración, salvo que introduzca una cita o fórmulas de saludo (OLE, 2010, p. 399).\n- Los puntos suspensivos (…) son siempre tres y solamente tres (OLE, 2010, p. 399). Se escriben pegados a la palabra o signo que los precede y con un espacio que los separa de la palabra que les sigue. Si van seguidos de otro signo de puntuación, no se pondrá este espacio y se escribirán pegados al signo que los sigue.\n\n- Los signos dobles son aquellos que tienen dos partes, una de apertura y una de cierre, esto es, la interrogación (¿?), exclamación (¡!), paréntesis (()), corchetes ([]) y llaves ({}), y deben ponerse obligatoriamente los de apertura al igual que los de cierre.\n- Los signos dobles deben ir pegados al texto que encierran, y separados por un espacio antes del signo de apertura y después del signo de cierre de las palabras que los rodean. Si tras el signo de cierre hay otro signo de puntuación simple, no se dejará espacio entre ambos.\n- Los signos de cierre de exclamación (!) e interrogación (?), nunca van seguidos de un punto (.), ya que ellos mismos pueden terminar una frase. En este caso la primera palabra que los siga, debe ir en mayúsculas, al igual que ocurre con el punto.\n- Respecto a las comillas, existen tres tipos: las latinas o españolas, denominadas angulares (« »), las inglesas ( \" ) y las simples ( ' ).\n\n- Se preferirá el uso de las comillas latinas o españolas (Alt+z → « / Alt+x → ») aunque también pueden usarse las comillas inglesas ( \" ), ambas son válidas. El diccionario panhispánico de dudas (2005), respecto a las comillas dice: «En los textos impresos, se recomienda utilizar en primera instancia las comillas angulares (« »), reservando los otros tipos para cuando deban entrecomillarse partes de un texto ya entrecomillado. En este caso, las comillas simples se emplearán en último lugar».\n- Deben ir pegadas al texto que encierran, y separadas por un espacio antes y después de las palabras que las rodean. Si tras la comilla de cierre hay otro signo de puntuación simple o de cierre, no se dejará espacio entre ellos.\n\n- Utilice el guion ordinario de su teclado (-) para separar palabras compuestas, en los casos que lo lleven, o para separar un rango de fechas, números, etc. (por ejemplo: «Desde los años 1998-2000»)\n\n- Se usa siempre en pareja (excepto para introducir un diálogo en estilo directo). Es un signo ortográfico cuya longitud de trazo (—) impide confundirlo tipográficamente con el guion corto (-). Se emplea para encerrar un inciso, es decir, una frase auxiliar en un texto —como puede ver en este mismo ejemplo— sin interrumpir el flujo principal de lectura, sin espacio de separación entre la primera y la última letra de este. La raya equivale al paréntesis.\n- Para colocar el signo ortográfico de la raya, puede utilizar la siguiente entidad HTML: &mdash;\n\n- Utilice «etc.» o «…» (puntos suspensivos), pero no ambos en la misma enumeración, pues es redundancia innecesaria (OLE, 1999, p. 68 y OLE, 2010, p. 397). Los puntos suspensivos (…) nunca van seguidos de un punto, en cambio etc. siempre va seguida de un punto al ser una abreviatura.\n\n- Se ha eliminado la tilde en el adverbio «solo» (aunque sí es admisible) y en los pronombres demostrativos («este, ese, aquel…»), incluso en casos de posible ambigüedad, salvo cuando existe riesgo de anfibología.\n- También se suprime la tilde en la conjunción disyuntiva «o» escrita entre cifras (por ejemplo, 1 o 2).\n- La abreviatura de una palabra acentuada conserva la tilde (las abreviaturas terminan, casi sin excepción, con punto).\n\n- Se escribe con mayúscula inicial únicamente la primera palabra de la cabecera de cualquier sección (excepto los nombres propios —nombres de personas o nombres geográficos—, y el nombre de las publicaciones periódicas y de las colecciones) (OLE, 2010, p. 488). Cuando se trate de la traducción al español de un título en inglés, «para el uso de las mayúsculas, se seguirá el uso ortográfico de la lengua en la que se da la información» (norma UNE 50104: 1994). Por tanto, el uso de la mayúscula en todos los sustantivos y adjetivos que forman parte del encabezado de las secciones es un anglicismo ortográfico que debe evitarse.\n- El empleo de la mayúscula no exime de poner tilde cuando le corresponda.\n- Se escriben con minúscula los días de la semana y los meses.\n- Las voces del inglés no adaptadas al español y utilizadas en nuestra lengua respetarán su ortografía original.\n\n- En español se admiten las palabras compuestas sin necesidad de poner entre ellas un guion. Es muy frecuente que en inglés nos encontremos con términos como «Sub-Categories», «Re-install», etc. En español se deberían traducir por «Subcategorías» y «Reinstalar». Únicamente es admisible el uso del guion en las palabras compuestas en casos muy especiales y que es difícil que se presenten, pues se trata de palabras compuestas de dos adjetivos o dos gentilicios. Por ejemplo: teórico-práctico, hispano-luso, etc.\n- Los compuestos formados por palabras que terminan en -e antepuestas a otras que comienzan con e-, se pueden escribir tanto con -ee como con -e, aunque el uso del término simplificado resulte minoritario, de momento (por ejemplo, se puede escritir tanto reemplazar, reestructurar, reelegir, como remplazar, restructurar, relegir), salvo con aquellas palabras entre las que existan problemas de diferente significado (por ejemplo, reemitir -«volver a enviar»-, con respecto a remitir -«enviar, diferir, perder intensidad»-). La simplificación es la tendencia histórica, como lo demuestran palabras como «sobrescribir», hoy escritas solo en esta forma.\n\n- Se forman, por lo general, con las iniciales de la expresión que abrevian.\n- Las siglas escritas en mayúscula no llevan nunca tilde.\n- Se escriben sin puntos ni espacios blancos de separación\n- Su plural se recomienda mantenerlas invariable en la escritura y acompañarlas de algún determinante: varias ONG (sin añadir –s ni mayúscula ni minúscula: *ONGS, *ONGs). En la pronunciación oral sí se leen como plural: [oenejés] (OLE, 2010, p. 583). En cambio, sí pluralizan como cualquier otra palabra los acrónimos: ovni / ovnis.\n- Las siglas que no se pueden leer secuencialmente (DVD, DNI, etc.) deben escribirse siempre en mayúsculas. En cambio, los acrónimos (esto es, aquel tipo de sigla que puede leerse con naturalidad en español sílaba a sílaba) se pueden escribir en minúscula: Unicef.\n\n- Las abreviaturas se forman con parte de la palabra y una palabra puede tener más de una abreviatura, y casi siempre terminan en punto abreviativo: para página, por ejemplo, se usan p. y pág.\n- Si incluyen una vocal acentuada en la palabra de origen, mantienen la tilde (teléf., de teléfono; pról., de prólogo).\n- En las abreviaturas con más de un elemento, tras el punto abreviativo se deja un espacio (se escribe EE. UU. y no EE.UU.); si la abreviatura lleva una parte volada, el punto se coloca antes de esta (n.º, no nº. ni nº).\n- Cuando tienen más de una letra, generalmente se pluralizan añadiendo una ese (pág. – págs.); si constan de una sola letra, esta se suele duplicar (p. – pp.).\n\n- Los símbolos son abreviaciones de carácter científico-técnico y están constituidos por letras o por signos convencionales (DPD).\n- La mayoría han sido creados por organismos de normalización y tienen validez internacional: kg, Ag, Fe, cm, %, &, $, @, etc.\n- No van seguidos por un punto abreviativo: en lugar de 3 kg., lo adecuado es 3 kg, sin punto.\n- No tienen plural, por lo que lo apropiado es escribir 3 kg, en lugar de 3 kgs.\n- Cuando se escriba una cifra seguida de un símbolo, lo apropiado es dejar un espacio intermedio: 3 kg, no 3kg.\n- Se escriben con mayúscula o minúscula, según los casos. Por ejemplo, van con mayúscula los puntos cardinales (S, de Sur; SE, de Sureste), así como la inicial de los elementos químicos (O, de oxígeno; Br, de bromo; Cl, de cloro), mientras que se escriben con minúscula muchas unidades de medida: g (gramo), ha (hectárea), mm (milímetro), etc.\n\n"
    },
    {
      "title": "Últimas novedades",
      "level": 3,
      "content": "¿Pos- o Post-? Se trata de un prefijo procedente del latín que significa «detrás de» o «después de». Se recomienda emplear el prefijo pos- frente a post-: posdata, posoperatorio, salvo que la palabra empiece por ese (s-): postsimbolismo y no possimbolismo (OLE, 2010, p.187).\n\nLos prefijos deben escribirse unidos a la palabra que acompañan cuando esta es solo una palabra: exmarido, antivirus, supermodelo, etc. En cambio, se escribe separado con guion cuando la siguiente palabra comience por mayúscula (pro-África) o sea un número (sub-21) o una sigla (anti-OTAN); y separado sin guion cuando la base léxica consta de varias palabras (ex primer ministro, pro derechos humanos) (OLE, 2010, pp.531-538). Lo mismo cabe decir si se combinan varios prefijos (antiposmodernista, ex vice primer ministro).\n\nLos préstamos y neologismos que adaptan su grafía y fonética al castellano se acentúan siguiendo las reglas de acentuación generales, aunque no llevaran tilde en la lengua de origen. Por ejemplo:\n\n- caché, como adjetivo invariable (memoria caché) o como sustantivo femenino (DPD 2005).\n- códec, acrónimo de cod[ificador] + dec[odificador].\n- módem, acrónimo de mo[dulator] + dem[odulator].\n\n"
    },
    {
      "title": "Reglas de estilo",
      "level": 2,
      "content": "A continuación se ofrecen algunas reglas generales de estilo con el fin de unificar la redacción y la estructura de los textos a traducir:\n\n"
    },
    {
      "title": "Traducción correcta, bien estructurada y fluida",
      "level": 3,
      "content": "El objetivo es crear una traducción correcta, bien estructurada y fluida, tanto como lo permita nuestro idioma. Dada la variedad de países de habla hispana y las diferentes maneras de expresarse, la traducción debe ser neutra, en el sentido de que sea válida para cualquier país o zona.\n\nEscriba en un español formal y objetivo que pueda ser comprendido por todos los hispanohablantes. El destinatario es la comunidad hispana en su conjunto, por tanto evite expresiones específicas de su zona que puedan ser malinterpretadas o incomprendidas por otros lectores.\n\nCuide la ortografía y la gramática, evitando errores en los acentos, leísmos, laísmos, ceceos, seseos, etc.\n\nEl tratamiento adecuado para dirigirse al lector es la tercera persona del singular, sin embargo no debe utilizarse la palabra «usted». En todo caso, si no es posible omitir la referencia, debería usarse «el usuario». Evita el uso de la primera y segunda persona y no utilice el tuteo o el voseo para dirigirse a él. Utilice el neutro para incluir todos los géneros.\n\nEvite las expresiones coloquiales (tod@s, xD, etc.). No utilice la primera persona ni incluya comentarios personales en los artículos, existe la página de discusión para ese propósito.\n\nEvite abreviaturas innecesarias de las palabras. En lugar de «repo», «distro» y «config», es preferible «repositorio», «distribución» y «configuración». Recuerde que las abreviaturas se acentúan y terminan en punto.\n\n"
    },
    {
      "title": "Lenguaje sencillo, claro y sin tecnicismos",
      "level": 3,
      "content": "Utilice un lenguaje sencillo, claro y sin tecnicismos, excepto cuando sea estrictamente necesario utilizar términos técnicos exigidos para describir procedimientos o ejecución de líneas de órdenes. La idea es proporcionar traducciones cercanas al usuario final no técnico de modo que pueda entender el concepto al menos a un nivel básico, conservando a la vez suficiente información y precisión para el usuario técnico.\n\nCon criterio general, se deben traducir todos los términos con equivalente en castellano.\n\nPara aquellos términos que no tenga un equivalente difundido en castellano, la opción preferente será también traducirlos al español. No obstante, cuando la traducción pueda producir ambigüedad, especialmente para los usuarios más técnicos acostumbrados al término anglosajón, a criterio del traductor, podrá incluirse el término original entre paréntesis a modo de aclaración, con tipografía diferenciada (cursiva).\n\nNo deben traducirse términos que hacen referencia a variables, nombres de programas, etc. No obstante, a criterio del traductor, podrá incluirse una traducción entre paréntesis a modo de aclaración cuando esto redunde en una mejor comprensión del texto.\n\nLos términos o frases que sean intraducibles y deban dejarse en inglés se marcarán como tales, esto es, entre comillas, paréntesis, con tipografía diferente como cursiva, etc.\n\n"
    },
    {
      "title": "Expresar la idea del autor",
      "level": 3,
      "content": "La finalidad de la labor traductora es la de expresar la idea del autor en una forma que resulte sencilla de comprender para el lector final no técnico.\n\nEl traductor debe permanecer lo más fiel posible al espíritu y al sentido del mensaje a traducir, es decir, se preferirán las traducciones literales «solo» cuando reproduzcan lo expresado por el autor en un cotexto comprensible para el destinatario.\n\nSin embargo, a veces el texto original está escrito con expresiones específicas del idioma de origen, por lo que en estos casos no es acertada la traducción literal dado que puede no expresar lo que realmente está queriendo decir el autor original. No tema expresar la misma idea con sus propias palabras o con sus propias construcciones gramaticales. Esto dará un aspecto al texto menos rígido y más amigable.\n\nA veces las frases traducidas al español son más largas que las del original porque necesitan más artículos y pronombres. No se deben acortar.\n\nOtras veces en inglés se suelen poner varias oraciones cortas separadas por puntos y seguido, pero en español se pueden unir empleando conjunciones como: «y, o, que, pero, sin embargo, sino, aunque, dado que, a fin de que, por tanto, a pesar de, pues, siempre que, es decir, ya que, …».\n\nEn otras ocasiones, las frases traducidas al español son más cortas que el original, pues en inglés se han de repetir los sustantivos cuando en español se pueden emplear los pronombre posesivos (mi, tu) y los pronombres relativos (que, el cual, cuyo, cuantos).\n\n"
    },
    {
      "title": "Traducción de algunas expresiones inglesas",
      "level": 3,
      "content": "Las formas verbales inglesas terminadas en «-ing» que se suelen usar en los títulos, epígrafes y opciones, no siempre equivalen a los gerundios españoles (propio de las expresiones que indican acciones que se están realizando —lo cual se dará raras veces—: «updating» → «actualizando».). Para la traducción de apartados se debe utilizar el sustantivo (o el verbo infinitivo, que en español funciona como un sustantivo), no el gerundio: «installing from Hard Disk» → «intalación/instalar desde el disco duro».\n\nEn inglés los títulos se suelen escribir con la primera letra de cada palabra en mayúscula. En español solo se escribe con mayúscula la primera letra del título (a no ser que haya un nombre propio, que se escribirá con mayúscula inicial). Los títulos escritos completamente en mayúsculas deben quedarse en mayúsculas.\n\nHay que tener especial cautela al traducir los infinitivos e imperativos. En inglés ambas formas se expresan igual, lo cual puede llevar a confusión. En español, las órdenes siempre se expresan en imperativo, nunca en infinitivo.\n\nLos pronombres posesivos en inglés no se tienen, necesariamente, que traducirse por el correspondiente pronombre posesivo en español. Se entiende, pero un hispanoparlante no hablaría así, por ejemplo, en lugar de «su sistema» para traducir «your system», debería utilizarse «el sistema».\n\nEl tiempo futuro tan frecuente en inglés admite una traducción a tiempo presente, más común en español.\n\nEn inglés es muy frecuente el uso de la voz pasiva. Sin embargo, si se traduce literalmente se obtienen, en muchas ocasiones, frases impropias en español. Se ha de poner en reflexivo y presente (por ejemplo: «This list is maintained by the Admin» → «Esta lista la mantiene el administrador», en vez de «Esta lista es mantenida por el administrador»).\n\nEl inglés suele utilizar la yuxtaposición de sustantivos para formar cadenas de complementos. Recordemos que en español no se suele hacer eso y que en la mayoría de los casos es incorrecto: «User data folder» → «Carpeta de datos de usuario».\n\nEn español se coloca primero el nombre y después el adjetivo, cuando en inglés se hace al revés.\n\nAunque en inglés no se anteponga el artículo al nombre, en español sí se hace: «Display image» → «Mostrar la imagen».\n\nEl inglés acostumbra a utilizar las formas modales del tipo «debería de», «podría», «asegúrese de», etc., que en español, casi siempre son expresiones superfluas. Se debe sustituir dichas expresiones por el imperativo en tercera persona (por ejemplo, «Make sure you fill in all the fields…» → «Rellene todos los campos…», en vez de «Asegúrese de rellenar todos los campos…»).\n\nEn inglés es usual encontrar estructuras de cortesía. En general, estas no deben traducirse pues no aportan nada nuevo ni esencial y su carga de formalidad se expresa en español por otros medios. «Please, insert a blank disc.» → «Introduzca un disco en blanco.».\n\nCuidado con las palabras que se escriben parecido, pero que no significan lo mismo, que habitualmente se traducen a anglicismos no admitidos, lo que se conoce como falsos amigos (para conocer más sobre el tema, veáse lista de falsos amigos).\n\nAl contrario que en inglés, en español los decimales se marcan con una coma y los miles con un punto ([✔]120.870,5 [✖]120,870.5).\n\nLas siglas deben escribirse en español siempre que exista una sigla equivalente («U.S.A.» → «EE. UU.»).\n\nLos nombres de las teclas en español son diferentes a las del inglés y deben traducirse («Backspace» → «Retroceso», «Enter» → «Intro»).\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Asociación de academias de la lengua española, con enlaces a las distintas academias de cada país.\n- Diccionario multilenguaje de WordReference\n- Errores habituales de Spanglish contiene una lista de errores de traducción comunes, «falsos amigos» o traducciones al «spanglish» (de Ángel Álvarez).\n- Fundación del español urgente — Fundéu BBVA\n- Glosario básico inglés-español (de Rafael Fernández Calvo).\n- Glosario de Informática e Internet (Varios).\n- Glosario de informática inglés-español del proyecto ORCA.\n- Glosario de KDE\n- Lenguaje wikitexto\n\n"
    },
    {
      "title": "Referencias",
      "level": 2,
      "content": "1. ArchWiki: Help\n1. Diccionario panhispánico de dudas de la RAE.\n1. Guía de estilo de GNOME\n1. Guía de estilo de openSUSE\n1. Guía de estilo de Ubuntu\n1. Normas correspondientes a las traducciones de GNU\n1. Normas generales del equipo de traducción de KDE\n1. Ortografía de la lengua española de la RAE (2010)\n1. Reglas de estilo para la traducción de ImpressCMS\n1. Reglas de traducción de la wiki de Mandriva\n1. Wikilengua del español de Fundéu BBVA\n1. Wikipedia: manual de estilo\n\n"
    }
  ]
}