{
  "title": "ArchWiki (Español)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-09-28** \n\nArtículos relacionados\n\n- Ayuda:Edición\n- Ayuda:Estilo\n- Ayuda:Lectura\n\nEste artículo proporciona una visión general de ArchWiki, respondiendo a las preguntas «¿Quién?», «¿Qué?», «¿Por qué?» y «¿Cómo?».\n\n"
    },
    {
      "title": "Objetivos",
      "level": 2,
      "content": "El objetivo principal de ArchWiki es proveer a la comunidad de usuarios de Arch Linux de la documentación mas completa y accesible en la web. Este es un proyecto mundial con participantes de todos los rincones del globo. La wiki abraza todos los principios de Arch Linux, en particular con respecto a la simplicidad. ArchWiki está evolucionando constantemente y prospera con la colaboración; siempre hay espacio para mejorar.\n\n"
    },
    {
      "title": "Completa",
      "level": 3,
      "content": "Uno de los objetivos principales de ArchWiki es cubrir todos los aspectos del uso del ordenador mediante Arch Linux. Desde un centro multimedia hasta la administración de redes corporativas, todo lo que puede lograr Arch Linux está dentro del campo de la ArchWiki.\n\n"
    },
    {
      "title": "Accesible",
      "level": 3,
      "content": "El objetivo principal de ArchWiki es de enormes proporciones y se necesitan miles de artículos para lograrlo; ArchWiki tiene que ofrecer, de una manera intuitiva y simple, la forma de obtener toda esa información. Esta no es una tarea sencilla, pero el ingenio y la imaginación típica de Arch prevalecerán.\n\nEl paquete oficial arch-wiki-docs ofrece a los usuarios la posibilidad de descargar una copia del contenido de ArchWiki. Véase esta discusión del foro para más detalles.\n\n"
    },
    {
      "title": "Cómo funciona",
      "level": 2,
      "content": "ArchWiki está mantenida por el equipo de mantenimiento oficial y miles de colaboradores. Los usuarios editan y organizan artículos para ofrecer a los lectores lo mejor en documentación de Arch Linux. Los contenidos son creados por la comunidad, para la comunidad: la mayoría de los artículos no están escritos por una sola persona, sino que representan el esfuerzo colectivo de muchas personas que corrigen información errónea, actualizan artículos y mejoran los contenidos de ArchWiki.\n\n"
    },
    {
      "title": "Cómo puede ayudar",
      "level": 2,
      "content": "ArchWiki está mantenida por voluntarios. Los contribuyentes nunca son suficientes y toda ayuda es bien recibida. Si se siente capaz de editar páginas wiki, considere la posibilidad de donar un poco de su tiempo y energía a la comunidad.\n\nVéase cómo colaborar para descubrir algunas formas de contribuir.\n\n"
    },
    {
      "title": "Historia temprana",
      "level": 2,
      "content": "- 2004-01-11 || Se anunció una especie de wiki inicial para contribuir con la documentación de los foros, basada en una cuenta abierta de usuario.\n- 2004-02-03 || La primera propuesta rastreable de una documentación wiki para Arch Linux se realizó en los foros.\n- 2004-02-27 || Un primer wiki basado en PhpWiki fue anunciado en los foros.\n- 2005-06-05 || Se propuso la migración a la instalación actual de MediaWiki.\n- 2005-07-08 || ArchWiki se configuró en MediaWiki.\n- 2005-07-11 || Primera edición, hecha al artículo ArchWiki:General disclaimer.\n- 2005-07-11 || Primera edición en el espacio de nombres principal, hecha a la página principal.\n- 2005-07-18 || La nueva instalación se anunció en los foros: así comenzó la migración de los artículos preexistentes de la versión PhpWiki.\n\n"
    },
    {
      "title": "Contactos",
      "level": 2,
      "content": "Véase Equipo de mantenimiento para obtener una lista de los coordinadores de ArchWiki.\n\n"
    },
    {
      "title": "Agradecimientos",
      "level": 2,
      "content": "- El equipo de Arch Linux provee gentilmente el alojamiento\n\n- Powered by MediaWiki\n\n- ¡Gracias a todos nuestros colaboradores y seguidores!\n\n"
    }
  ]
}