{
  "title": "Arch compared to other distributions (Bosanski)",
  "url": "https://wiki.archlinux.org/title/Arch_compared_to_other_distributions_(Bosanski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Arch Linux (Bosanski)\n- Arch based distributions\n- Pacman/Rosetta\n\nOva stranica upoređuje Arch Linux i druge popularne GNU/Linux distribucije i UNIX-like operativne sisteme. Ono što je u nastavku je kratak opis koji može pomoći pri odluci da li je Arch Linux pravi odabir za tebe. Iako review-ovi i opisi mogu biti od pomoci, iskustvo sa samim operativnim sistemom je najbolja mjera.\n\nZa kompletnije poređenje, vidi w:Comparison of operating systems i w:Comparison of Linux distributions.\n\nU nastavku je jedino Arch Linux upoređen sa drugim distribucijama. Community portovi koji podržavaju arhitekture mimo x86_64 mogu biti pronađene na Arch-based distributions.\n\n"
    },
    {
      "title": "Source-based",
      "level": 2,
      "content": "Source-based distribucije su jako portabilne, dajući prednost kontroliranja i kompajliranja cijelog OS-a i aplikacija za određenu arhitekturu i svrhu, sa manom utroška vremena u kompajliranju. Arch base i svi paketi su kompajlirani samo za x86_64 arhitekturu.\n\n"
    },
    {
      "title": "CRUX",
      "level": 3,
      "content": "- CRUX je lightweight distrubucija koja se fokusira na KISS princip. CRUX je inspirisao Judd Vineta da kreira Arch.\n- CRUX koristi init skripte u stilu BSD-a, dok Arch koristi systemd.\n- Dok Arch korist rolling release sistem, CRUX je manje više na godišnjem nivou.\n- Oba dolaze sa port-like sistemima i kao i *BSD, oba imaju bazno okruženje nad kojim se dalje radi.\n- Arch koristi pacman, koji handla binary sistemske pakete i radi besprijekorno sa Arch build system-om. CRUX koristi community sistem nazvan prt-get, koji u kombinaciji sa svojim port sistemom handla rezoluciju dependency-a, ali builda sve pakete iz source (iako je CRUX base installation binary )\n- I Arch i CRUX oficijalno podržavaju samo x86_64 arhitekturu.\n- Arch ima veliki set binary paketa kao i Arch User Repository. CRUX pruža manju verziju oficijalno podržani port sistem u dodatku sa community repository-ima.\n\n"
    },
    {
      "title": "LFS",
      "level": 3,
      "content": "- LFS (LFS) postoji kao dokumentacija. Knjiga uči korisnika kako da dobije source code za minimalan set paketa za funkcionalan GNU/Linux sistem i kako manuelno kompajlirati, patchovati i konfigurisati od početka. LFS je minimalan i nudi odličan i edukacijski proces buildanja i prilagođavanja baznog sistema.\n- LFS pruža online repository; source-vi se preuzimaju manuelno, kompajliraju i instaliraju sa make. (Nekoliko metoda paket menadžmenta postoji, navedeno je u LFS Hints).\n- Arch ima iste pakete, plus systemd, nekoliko dodatnih alata i moćni pacman paket menadžer kao svoj bazni sistem, već kompajlirano za x86_64. Zajedno sa minimalnim Arch baznim sistemom, Arch community i developeri omogućavaju i održavaju više hiljada binarnih paketa koji se mogu instalirati sa pacman-om, kao i PKGBUILD skripte za Arch build system.\n\nArch također uključuje makepkg alat za buildanja i customiziranje .pkg.tar.xz paketa, kojima se može upravljati sa pacmanom.\n\n- Judd Vinet je napravio Arch od početka i onda napisao pacman u C programskom jeziku. Historički, Arch je često opisivan humoristički kao \"Linux, with a nice package manager.\" (Linux, sa finim paket menadžerom)\n\n"
    },
    {
      "title": "Gentoo/Funtoo Linux",
      "level": 3,
      "content": "- Oba Arch Linux i Gentoo Linux su rolling release sistemi, pravljeći pakete dostupnim distribuciji kratko vrijeme nakon releasanog upstreama.\n- Gentoo paketi i bazni sistem su buildani direktno iz source code-a na osnovu korisničko definisane USE flags. Arch omogućava port-like sistem za buildanje paketa iz source code, ali je Arch bazni sistem dizajniran da bude instaliran kao prebuildan x86_64 binary. Generalno, ovo čini Arch bržim da se builda i updateuje i omogućava Gentoo da bude više sistematski customiziran.\n- Arch samo podržava x86_64 dok Gentoo oficijalno podržava x86 (i486/i686), x86_64, PPC/PCC64, SPARC, Alpha, ARM, MIPS, HPPA, S/390 i Itanium arhitekture.\n- Gentoo-ovi oficijalni paketski i sistemsko menadžmentski alati su uglavnom kompleksni i \"moćniji\" nego što je to slučaj sa Arch Linuxom, i neki feature koji su u srcu Gentoo-a (USE flags, SLOTs, itd.) nemaju ekvivalente u Arch Linuxu. Razlog nekim od tih je u tome sto je Arch primarno binary distribucija, ali razlike u design filozofija također igra veliku uloguv gdje Arch zauzima principijalniji stav vezano za arhitekturalnu jednostavnost i izbjegavanja pretjeranog inžinjeringa.\n- Zato jer oba i Gentoo i Arch instalacije samo uključuju bazni sistem, oba se smatraju kao operativni sistem koji se mogu jako customizirati. Ako su upoznati sa systemd, Gentoo korisnici će generalno lako preći na Arch linux.\n\n"
    },
    {
      "title": "Generalno",
      "level": 2,
      "content": "Ove distribucije pružaju širok spektar prednosti i snaga i mogu biti napravljene da služe većini upotreba operativnog sistema.\n\n"
    },
    {
      "title": "Debian",
      "level": 3,
      "content": "- Debian je najveća upstream Linux distribucija sa većim community-em i ima stabilne, test i nestabilne branchove, koja pruža više od 43,000 paketa. Broj dostupnih Arch binarnih paketa je skromniji. Ukoliko se uključi AUR, poprilično je isto.\n- Debian ima žestok stav za besplatan software, ali i dalje uključuje software koji se plaća. Arch je blaži i, prema tome, sveobuhvatniji u vezi s \"neslobodnim paketima\" kako je definirano u GNU.\n- Debian se fokusira na stroga ispitivanja stabilne branche, koja je \"zaleđena\" i podržana do pet godina. Arch paketi su noviji nego Debian stable, gdje su više ekvivalent debian testing i unstable branch-ovima i nema fixni release raspored.\n- Debian je dostupan za različite arhitekture, uključujući alpha, arm, hppa, i386, x86_64, ia64, m68k, mips, mipsel, powerpc, s390 i sparc. Arch je x86_64 samo.\n- Arch pruža slobodniju podršku za buildanje custom, instalabilnih paketa sa vanjskih izvora, sa port-like paket build sistemom. Debian ne pruža port sistem, već uzda se u svoje velike binary repositorye.\n- Arch instalacijski sistem samo pruža minimalni bazni sistem, dok Debianove metode, poput apt tasks za instaliranje unaprijed odabranih grupa paketa, pružaju više automatsko konfigurisani pristup kao i nekoliko alternativnih metoda instalacije.\n- Arch generalno pakuje library-e zajedno sa njihovim header fajlovima, gdje Debian header fajlovi moraju biti posebno download-ovani.\n- Arch čuva patching na minimumu, i tako izbjegava probleme koje upstream ne može da pregleda, gdje su Debian patchevi više slobodni za šire mase.\n\n"
    },
    {
      "title": "Fedora",
      "level": 3,
      "content": "- Fedora je razvijend od strane community-a, a sa druge strane podržan od strane Red Hat-a; često je predstavljen kao test release sistem. Fedora paketi i projekti migriraju to RHEL i neki budu prihvaćeni do strane drugih distribucija. Arch nema fixne release-ove i ne služi kao testni branch za drugu distribuciju.\n- Fedora paketi koriste RPM format sa DNF paket menadžerom. Arch koristi pacman da upravlja tar.xz paketima.\n- Fedora odbija da uključi nebesplatni software unutar svojih repository-a radi privrženosti open source-u, iako su third-party repository-i dostupni za takve pakete. Arch je blaži u odnosi prema nebesplatnom software-u, ostavljajući izbor korisniku.\n- Fedora nudi više različitih instalacijskih opcija uključujući grafički instaler kao i minimalnu opciju. Fedora \"spins\" također nude alternativni asortiman desktop okruženja za odabir, svaki sa svojim asortimanom defaultnih paketa. Arch, s druge strane, samo nudi nekoliko skripti namjenjenih za olakšavanje procesa instalacije minimalnog baznog sistema.\n- Fedora ima zakazani release ciklus, ali oficijalno podržava diskretne verzije upgrade-a sa FedUp alatom. Arch is rolling-release sistem.\n- Arch ima port sistem, dok Fedora nema.\n- Arch i Fedora su ciljani za iskusne korisnike i developere. Oba podstiču korisnike da doprinose developmentu projekta.\n- Fedora je zaradila više prepoznavanja unutar community-a radi integracije SELinux-a, GCJ kompajliranih paketa (da se ukloni potreba za Oracle-ovim JRE) i profilnu upstream kontribuciju.; Red Hat i Fedora developeri najviše doprinose Linux kernel kodu u poređenju sa drugim distribucijama.\n- Arch Linux ima najdetaljniju wiki što je opće poznato. Fedora wiki se koristi u originalnom značenju riječi \"wiki\", ili način da se razmijene informacije između developera, testera i korisnika rapidno. Nije namijenjeno da bude baza znanja za krajnjeg korisnika kao što je to slučaj sa Arch Linux-om. Fedorin wiki podsjeća na tracker issue-a ili korporativni wiki.\n\n"
    },
    {
      "title": "Slackware",
      "level": 3,
      "content": "- Slackware koristi init skripte poput BSD-a, dok Arch koristi systemd.\n- Arch pruža paket menadžment u pacman, koji za razliku od Slackware standardnih alata, pruža automatsku rezoluciju dependency-a i omogućava za više automatizirani sistemski upgrade. Slackware korisnici obično preferiraju njihovu manuelno metode rješavanja dependency-a, iskorištavajući kontrolu koju im sistem pruža, kao i Slackware-ove unaprijed instalirane library-e i dependency-e.\n- Arch je rolling-release sistem, Slackware je konzervativniji gdje preferira stabilne pakete. Arch je više bleeding-edge u ovom aspektu.\n- Arch Linux pruža hiljade binarnih paketa unutar oficijalnih repository-a, dok su Slackware repository skromniji.\n- Arch pruža Arch build system, sistem nalik na portove i AUR, veliku kolekciju PKGBUILD skripti od strane korisnika. Slackware pruža sličnu stvari, ali manji sistem na slackbuilds.org koji je polu oficijalni repository Slackbuild-ova, koji su ekvivalent PKGBUILD-ovima. Slackware korisnici će se lako snaći na Arch Linuxu.\n\n"
    },
    {
      "title": "Za početnike",
      "level": 2,
      "content": "Nekada nazivane \"newbie distribucije\", namjenjene za početnike distribucije dijele puno sličnosti; Arch Linux je dosta različit od njih. Arch je možda bolji izbor ako želiš naučiti o GNU/Linuxu pravljeći sistem od male baze jer instalacija Arch Linuxa instalira samo nekoliko paketa. Specifične razlike između distribucije su opisane ispod.\n\n"
    },
    {
      "title": "Ubuntu",
      "level": 3,
      "content": "- Ubuntu je popularna distribucija bazirana na Debianu komercijalno sponzorisana od strane Canonical Ltd., dok je Arch nezavisno razvijeni sistem od početka.\n- Ubuntu i Arch imaju različite ciljeve i ciljane su na različite grupe korisnika. Arch je dizajniran za korisnike sa željom za do-it-yourself pristupom, dok Ubuntu pruža prekonfigurisani sistem. Arch predstavlja jednostavniji dizajn od bazne instalacije pa na dalje, oslanjajući se na korisnika da ga customizira po svojoj želji. Veliki broj Arch korisnika su krenuli sa Ubuntu-om i migrirali na Arch.\n- Arch development nije orijentisan niti prema jednom korisničkom interfejsu mimo onoga što community podržava. Dalje, komercijalna priroda Canonicala ih je odvela do nekih kontroverznih odluka, poput reklama u Dash meni i kolekciju korisničkih podataka. Arch je nezavisan, community-driven projekat bez komercijalne agende.\n- Ubuntu pušta diskretne relase-ove svakih 6 mjeseci, dok je Arch rolling-release sistem.\n- Arch pruža build sistem nalik na portove i Arch User Repository gdje korisnici mogu dijeliti source pakete za pacman paket menadžera. Ubuntu koristi kompleksniji apt i omogućava redistribuciju binarnih paketa preko Personal Package Archives].\n- Čak dva community-a se razlikuju. Arch community je puno manji i ohrabruju se da doprinose Arch projektima. S druge strane, Ubuntu community je relativno velik i zbog toga može trpiti veći procenat korisnika koji ne doprinose developmentu, pravljenju paketa ili održavanje repository-a.\n\n"
    },
    {
      "title": "Linux Mint",
      "level": 3,
      "content": "- Linux Mint je nastao kao Ubuntu derivat i kasnije dodao LDME (Linux Mint Debian Edition) koja je bazirana na #Debian-u. S druge strane, Arch je nezavisna distribucija koja se oslanja na svoj build sistem i repository-e.\n- Mint uključuje nekoliko grafičkih alata za lakše nadgledanje, nazivane MintTools(Mint alati). Arch samo pruža CLI alate poput pacman-a i ostavlja menadžment sistema korisniku.\n- Mint uglavnom dolazi sa Cinnamon-om ili MATE-om za GUI i alternativno KDE ili Xfce4.\n- Nove verzije Minta se puštaju svakih 6 mjeseci, oko mjesec dana iza Ubuntu-a. Svaki release je bazirano na najnovijem Ubuntu LTS i podržan je 5 godina. Linux Mint Debian Edition (LDME) je baziran na Debian Stable i samo dobija update-e za Mint pakete i sigurnosne update. Arch je u potpunosti rolling-release distribucija.\n\n"
    },
    {
      "title": "openSUSE",
      "level": 3,
      "content": "openSUSE je centralisan oko RPM paket formata i svog dobro GUI konfiguracijskog alata YaST2. Arch nema takvu opciju. Radi toga openSUSE može biti biti prikladniji za korisnike koji žele okruženje koje se fokusira na GUI, automatsku konfiguraciju ili očekivanu funkcionalnost out of the box, dok s druge strane dozvoljava duboku customizaciju.\n\n"
    },
    {
      "title": "Mandriva/Mageia",
      "level": 3,
      "content": "Mandriva Linux (prije Mandrake Linux) je kreiran 1998 sa ciljem pravljenja GNU/Linux lakim za svakoga; RPM baziran i koristi urpmi paket menadžer. Mageia je fork Mandrive kreiran od strane nekadašnjeg zaposlenika Mandriva-e koji se protivi komercijalnoj poziciji Mandriva-e tako što je neprofitna i community-driven projekat. Arch ima jednostavniji pristup od Mandriva-e i od Mageia-e, time što je text-based i oslanja se na manuelnu konfiguraciju, i cljan je srednje i napredne korisnike.\n\n"
    },
    {
      "title": "BSD-ovi",
      "level": 2,
      "content": "- BSD-ovi dijele zajedničko porijeklo, dolaze direktno od posla na UC Berkeley da se kreira besplatno distribuirajuci, besplatan UNIX sistem. Oni nisu GNU/Linux distribucija, nego više sistem nalik na UNIX, nastali direktno iz originalnog AT&T UNIX koda.\n- Arch i BSD-ovi dijelete koncept usko integrisanog baznog i sistema portova. S druge strane, za razliku od GNU/Linux distribucija poput Arch-a, BSD-ov kernel i userland programi (poput shell-a i core alata poput ls, cp, cat i ps) su razvijeni zajedno u jednom source repository-u.\n- BSD licenca je popustljiva u poređenju sa GPL koja govori da derivativi moraju biti pod istom licencom. Arch koristi GPL.\n- Da saznaš više o BSD varijantama, vidi Komparacija BSD operativnih sistema.\n\n"
    },
    {
      "title": "Vidi također",
      "level": 2,
      "content": "- DistroWatch - Novosti i review-ovi o Linux distribucijama\n- The Live CD List - Lista image-a Live operativnih sistema\n\n"
    }
  ]
}