{
  "title": "ArchWiki Translation Team (العربية)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_Translation_Team_(%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: ** بتصرف ** \n\n"
    },
    {
      "title": "اصنع صفحة جديدة مع ترجمتها",
      "level": 2,
      "content": "1. إذا كنت ﻻ تعرف كيف تعدّل صفحات ويكي ، اقرأ مساعدة:التعديل.\n1. اقرأ Help:i18n و التي تحتوي على الإرشادات المفصّلة لتدويل وتعريب آرتش-ويكي.\n1. سجّل دخولك لتستطيع تعديل آرتش-ويكي.\n1. اختر صفحة لترجمتها، يمكنك أن تستعمل صفحة عشوائية.\n1. اضغط edit من القائمة اﻷفقية للصفحة التي اخترتها.\n1. ضف interlanguage link الذي سيُظهر رابط في الجهة اليسرى من الصفحة ليشير إلى صفحة الترجمة التي ستصنعها (شاهد : Help:i18n#Interlanguage links).\n1. انسخ الشفرة المصدرية بالكامل.\n1. احفظ الصفحة مع رابط interlanguage الجديد بالضغط على زر Save page أسفل الصفحة.\n1. قم بزيارة رابط interlanguage الذي قمت بصنعه و هو \"العربية\" (في هذه الحالة) في الجهة اليسرى من الصفحة و الذي سيقودك الى صفحة بعنوان (العربية) عنوان_الصفحة_اﻷصلية_التي _تترجم_منها.\n1. بما أنَّ الصفحة الجديدة غير موجودة ، فقم بصنعها بالضغط على كلمة create في القائمة الأفقية أعلى الصفحة.\n1. الصق الشفرة المصدرية التي قمت بنسخها سابقاً.\n1. بدّل التصنيف Category إلى تصنيف باللغة العربية، قد يكون التصنيف موجود أو غير موجود، فإذا كان غير موجود فيمكنك التعرف على كيفية صنع تصنيف جديد أو نقله وتعديله من مساعدة:تصنيف.\n1. بدّل رابط interlanguage الذي صنعته مسبقاً ليشير إلى اللغة العربية و اجعله يشير إلى اللغة في المقالة اﻷصلية و ذلك لكي تضع رابط اللغة اﻷصلية في الجهة اليمنى من صفحتك المترجمة مع بقية روابط اللغات اﻷخرى.\n1. الآن ترجم النص الى اللغة العربية و احفظ الصفحة المترجمة الجديدة.\n1. ضِف رابط interlanguage لكل صفحات التراجم للمقالة التي ترجمتها إن وجدت لكي يظهر رابط اللغة العربية في الجهة اليمنى فيها كلها.\n1. الآن يجب أن تصنع صفحة باسم عربي و تضيف لها شفرة إعادة التوجيه .. لفعل ذلك : ضع الرابط التالي في شريط العنوان في المتصفح:\n\nhttps://wiki.archlinux.org/index.php/Localized name of translated page\n\nطبعاً مع استبدال Localized name of translated page باسم الصفحة الذي تريده باللغة العربية. و الآن ادخل:\n\n#REDIRECT [[Some_Page_(العربية)]]\n\nكمحتوى وحيد فيها مع الانتباه إلى استبدال some_page بعنوان صفحتك المترجمة.\n\n"
    }
  ]
}