{
  "title": "Arch Linux (Suomi)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(Suomi)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux on itsenäisesti kehitetty, x86-64-arkkitehtuurin yleisen käytön GNU/Linux-jakelu, joka pyrkii tarjoamaan viimeisimmät versiot useimmista ohjelmistoista seuraamalla rullaavan julkaisun mallia. Oletusasennus on minimaalinen perusasennus, jonka käyttäjä räätälöi lisäämällä vain mitä itse tarvitsee.\n\n"
    },
    {
      "title": "Yksinkertaisuus",
      "level": 3,
      "content": "Arch Linux määrittää yksinkertaisuuden samana kuin ilman ylimääräisiä lisäosia tai muutoksia. Se toimittaa ohjelmiston sellaisena kuin sen ovat alkuperäiset kehittäjät julkaisseet (ylävirrassa) mahdollisimman vähillä jakelukohtaisilla (alavirta) muutoksilla: ylävirran ei-hyväksymiä paikkauksia vältetään, ja Archin alavirtapaikkaukset koostuvat melkein kokonaan takaportitetuista bugikorjauksista, jotka ovat vanhentuneet projektin seuraavan julkaisun myötä.\n\nSamalla tavoin Arch toimittaa ylävirran tarjoamat asetustiedostot muutoksilla, jotka rajoittuvat jakelukohtaisiin vikoihin, kuten järjestelmän tiedostopolkujen säätämiseen. Se ei lisää automaatio-ominaisuuksia, kuten palveluiden ottamista käyttöön vain, koska paketti asennettiin. Paketit pilkotaan, jos varteenotettavia etuja on, kuten levytilan säästäminen erityisen huonoissa jätetilanteissa. GUI-määritystyökaluja ei ole virallisesti tarjolla, rohkaisten käyttäjiä tekemään suurimman osan järjestelmän säädöistä komentoriviltä ja tekstinmuokkaimella.\n\n"
    },
    {
      "title": "Nykyaikaisuus",
      "level": 3,
      "content": "Arch Linux pyrkii pitämään uusimman stabiilin julkaistun version softastaan niin kauan kuin systeeminen paketin murtuvuus voidaan järkevästi välttää. Se perustuu rolling-release järjestelmään, eli jokainen asennus saa jatkuvasti päivityksiä, kun niitä on saatavilla ns. \"uusinta uutta\".\n\nArch sisältää monia uusimmista toiminnoista saatavilla GNU/Linux käyttäjille, mukaanlukien systemd:n init systeemi, modernit tiedosto järjestelmät file systems, LVM2, softan RAID, udev tuen and initcpio:n (mkinitcpio kanssa) ja myös uusimman saatavilla olevan kernelin.\n\n"
    },
    {
      "title": "Pragmaattisuus",
      "level": 3,
      "content": "Arch on enemmän pragmaattinen distribuutio kuin ideologinen. Periaatteet täällä toimivat vain hyödyllisinä ohjekirjan ohjeina. Pohjimmiltaan kaikki suunnitteluun liittyvät päätökset tehdä tapauskohtaisesti kehittäjän päätöksestä. Todisteisiin perustuva tekninen analyysi ja väitökset merkitsevät kun taas poliittinen agenda tai yleinen mielipide eivät.\n\nSuurin osa paketeista ja build-skripteistä useissa Arch Linux pakettivarastoissa tarjoavat ilmaisia ja avoimen lädekoodin ohjelmia heille, jotka näitä suosivat, kuin myös suljettuun lähdekoodiin perustuvia ohjelma paketteja heille, jotka välittävät enemmän toiminnallisuudesta kuin ideologiasta.\n\n"
    },
    {
      "title": "Käyttäjäkeskeisyys",
      "level": 3,
      "content": "Siinä missä monet muut GNU/Linux jakelut yrittävät olla käyttäjä ystävällisempiä, Arch Linux on aina ollut ja tuleekin aina olemaan käyttäjä keskeinen. Jakeluna Arch on tarkoitettu täyttämään osallisina olevien tavoitteet ja tälläinen suureen joukkoon vetoaminen onkin tavotteista pienin. Arch on tarkoitettu taitavalle ja osaavalle GNU/Linux käyttäjälle tai kellevain do-it-yourself-asenteen omaavalle, joka osaa taipua dokumentaation lukemiseen ja omien ongelmien ratkomiseen.\n\nKaikkia käyttäjiä kehotetaan osallistumaan ja kantamaan kortensa kekoon. Raportointi ja bugien korjailu on hyvin arvostettavaa sekä muutokset pakettien parantelua varten tai itse ydinprojekteja varten on erittäin arvostettavaa: Archin kehittäjät ovat vapaaehtoisia ja aktiiviset osallistujat usein löytävät itsensä osana ryhmää. Archerit voivat vapaasti olla osallisina eri paketeissa Arch User Repository:ssa, parantelemassa ArchWikin dokumentaatiota, antamalla teknistä tukea sitä tarvitseville tai vain antamalla oman mielipiteensä foorumeilla, postituslistalla, tai IRC kanavilla. Arch Linux on monien ihmisten valinta käyttöjärjestelmänä ympäri maailmaa ja siksi onkin olemassa monia kansainvälisiä yhteisöjä jotka tarjoavat apua ja tuovat dokumentaatiota muillekkin kielille.\n\n"
    },
    {
      "title": "Monipuolisuus",
      "level": 3,
      "content": "Arch Linux on yleiskäyttöinen jakelu. Asennuksen yhteydessä tarjotaan vain ainoastaan komentorivi ympäristö: ennemmin kuin repiä itse tarpeettomia paketteja pois, voi käyttäjä muokata alusta alkaen käyttöjärjestelmän itselleen oman maun mukaisesti virallisen pakettilähteen tuhansista korkealaatuisista paketeista x86-64 arkkitehtuurille.\n\nArchia tukee pacman, kevyt, yksinkertainen ja nopea paketinhallintajärjestelmä, joka antaa käyttäjälle mahdollisuuden päivittää koko järjestelmä yhdellä komennolla. Arch myös tarjoaa Archin koontijärjestelmän, ABS, BSD:n ports-tyyppinen järjestelmä, joka helpottaa pakettien kokoamista ja asentelua lähteestä, joka sitten pystytään myös synkronoimaan yhdellä komennolla. Lisäksi, Arch User Repository sisältää tuhansia yhteisön keskuudessa tehtyjä PKGBUILD -skriptejä asennettavien pakettien kääntämiseen lähteestä käyttäen makepkg -ohjelmaa. Käyttäjien on myös mahdollista koota ja ylläpitää heidän omia pakettilähteitä helposti.\n\n"
    },
    {
      "title": "Historia",
      "level": 2,
      "content": "Arch yhteisö on kasvanut yhdeksi suosituimmista ja vaikutusvaltaisimmista Linux jakeluista, jota myös todistaa vuosien aikana saatu huomio sekä arvostelu.\n\nArch kehittäjät tekevät työtä ilmaiseks osa-aikaisina vapaaehtoistyöntekijöinä ja Arch Linuxia ei voi millään tavalla myydä rahaksi, joten se pysyy ilmaisena sanan joka tarkoituksessa. He joita Archin kehityshistoria kiinnostaa eniten voivat selailla Archin loggauksia Internet Archive Wayback Machine:ssa sekä myös Arch Linuxin uutisarkistossa.\n\n"
    },
    {
      "title": "Varhaiset vuodet",
      "level": 3,
      "content": "Judd Vinet, Kanadalainen ohjelmoitsia sekä toisinaan myös kitaristi, aloitti Arch Linuxin kehittämisen vuoden 2001 alusta. Sen ensimmäinen virallinen julkaisu, Arch Linux 0.1, oli 11. maaliskuuta 2002. Hienostuneen yksinkertaisten käyttöjärjestelmien kuten Slackwaren, BSD:n, PLD Linuxin ja CRUX:in inspiroimana sekä pettymyksen tuottaaneen liittyen paketinhallintajärjestelmiin siihen aikaan, Vinet kokosi hänen oman jakelun perustuen samoihin periaatteisiin kuten nuo edellä mainitut. Sillä poikkeuksella tosin, että hän myös kirjoitti paketinhallintajärjestelmä ohjelman nimeltä pacman, automaattisesti käsittelemään pakettien asennuksia, poistamista ja päivittelyä.\n\n"
    },
    {
      "title": "Keskivuodet",
      "level": 3,
      "content": "Varhainen Arch-yhteisö kasvoi vakaasti, kuten tämä kaavio foorumipostauksista, käyttäjistä ja bugiraporteista kertoo. Lisäksi, varhaisina päivinä se tunnettiin avoimena, ystävällisenä, ja avuliaana yhteisönä.\n\n"
    },
    {
      "title": "ArchWikin syntymä",
      "level": 3,
      "content": "2005-07-08 ArchWiki oli ensimmäisen kerran pystytetty MediaWiki-alustalle.\n\n"
    },
    {
      "title": "A. Griffinin ajan alku",
      "level": 3,
      "content": "Vuoden 2007 lopussa, Judd Vinet eläköityi aktiivisesta osallistumisestaan Arch-kehittäjänä, ja siirsi pehmeästi ohjakset amerikkalaiselle ohjelmoijalle Aaron Griffinille, joka tunnetaan myös nimellä Phrakture.\n\n"
    },
    {
      "title": "Arch-asennusskriptit",
      "level": 3,
      "content": "Asennuslevykuvan julkaisu 2012-07-15 poisti käytöstä valikkokäyttöisen Arch Installation Framework (AIF) -työkalun Arch-asennusskriptien suosiossa (arch-install-scripts).\n\n"
    },
    {
      "title": "systemd-aika",
      "level": 3,
      "content": "Vuosien 2012 ja 2013 välillä perinteisen System V init -järjestelmän korvasi systemd.[1][2][3][4]\n\n"
    },
    {
      "title": "i686-tuen loppuminen",
      "level": 3,
      "content": "2017-01-25 ilmoitettiin, että tuki i686-arkkitehtuurille aiotaan lopettaa sen vähäisen suosion takia. Marraskuun 2017 loppuun mennessä kaikki i686-paketit oli poistettu peileistä.\n\n"
    },
    {
      "title": "Projektin johtajan roolin selonteko ja virkaanastuminen",
      "level": 3,
      "content": "2020 alussa, Arch Linuxin henkilöstön ryhmäponnisteluna, suunniteltiin uusi prosessi jonka tavoitteena on tulevaisuudessa päättää uusi johtaja, kuten dokumentoitu täällä.\n\nAaron Griffinin päätöksestä pudota johtajan paikalta, pidettiin äänestys jonka perusteella sitten valittiin uusi johtaja. 24. helmikuuta 2020 tulokset julkaistiin, tehden Levente Polyakista virallisesti uuden johtohenkilön.\n\n"
    }
  ]
}