{
  "title": "Arch terminology (Dansk)",
  "url": "https://wiki.archlinux.org/title/Arch_terminology_(Dansk)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nFormålet med denne side er at give klarhed over de mest almindelige begreber som bruges af Arch Linux fælleskabet. Tilføj eller rediger gerne i artiklen. Men brug hver sektions rediger knap. Hvis du gerne til tilføje en sektion, skal det indsættes i alfabetisk rækkefølge.\n\n"
    },
    {
      "title": "ABS",
      "level": 2,
      "content": "ABS står for Arch build system og kan blive brugt til:\n\n- Oprette nye pakker til programmer som ikke har nogle pakker endnu\n- Tilpasse/redigere eksisterende pakker til at passe dine behov: Aktivere/Deaktivere build-time muligheder Tilføje kilde ændringer via patches\n- Gen-bygge hele dit system ved hjælp af dine compiler flag, \"à la Gentoo\"\n- Få kernel moduler til at virke med din tilpasset kernel\n\n- Aktivere/Deaktivere build-time muligheder\n- Tilføje kilde ændringer via patches\n\nABS er ikke nødvendig for at bruge Arch Linux, men den kan være nyttig.\n\n"
    },
    {
      "title": "Arch Linux",
      "level": 2,
      "content": "Arch bør betegnes som:\n\n- Arch Linux\n- Arch (Linux underforstået)\n- archlinux (UNIX navn)\n\nArchlinux, ArchLinux, archLinux, aRcHlInUx, osv. er alle underlige og mere underlige mutationer.\n\nOfficielt, bliver 'Arch' i \"Arch Linux\" udtalt /ɑːrtʃ/ som en \"archer\"/bueskytte, eller \"archnemesis/ærkefjende\", ikke som i \"ark\" eller \"ærkeengel\".\n\n"
    },
    {
      "title": "Arch Linux Archive",
      "level": 2,
      "content": "Arch Linux Archive (a.k.a ALA), tidligere kendt som Arch Linux Rollback Machine (a.k.a ARM), gemmer officielle repositories snapshots, ISO billeder og bootstrap tarballs igennem tiden.\n\n"
    },
    {
      "title": "AUR",
      "level": 2,
      "content": "The Arch User Repository (AUR) is a community-driven repository for Arch users. It contains package descriptions (PKGBUILDs) that allow you to compile a package from source with makepkg and then install it via pacman. The AUR was created to organize and share new packages from the community and to help expedite popular packages' inclusion into the extra repository.\n\nA good number of new packages that enter the official repositories start in the AUR. In the AUR, users are able to contribute their own package builds (PKGBUILD and related files). The AUR community has the ability to vote for or against packages in the AUR. If a package becomes popular enough — provided it has a compatible license and good packaging technique — it may be entered into the extra repository (directly accessible by pacman or the ABS).\n\nYou can access the Arch Linux User Community Repository here.\n\n"
    },
    {
      "title": "bbs",
      "level": 2,
      "content": "Bulletin board system, men i Arch's tilfælde, er det blot support forummet som findes here.\n\n"
    },
    {
      "title": "community/[community]",
      "level": 2,
      "content": "community repository var hvor for-bygget pakker blev gjort tilgængelig af Trusted Users. Størstedelen af pakkerne i community kom fra AUR. Siden Git migrationen, er den blevet lagt sammen med extra.\n\n"
    },
    {
      "title": "core/[core]",
      "level": 2,
      "content": "core repository indeholder de nødvendige pakker til et Arch Linux system. core har alt der skal bruges til at få et kommando-linje system op at køre.\n\n"
    },
    {
      "title": "custom/user repository",
      "level": 2,
      "content": "Alle kan lave et repository og ligge det online til andre brugere. For at lave et repository, skal du bruge en række pakker og en pacman-kompatibel database fil til dine pakker. Læg dine filer online og alle kan gøre brug af dit repository ved at tilføje det som en almindelig repository.\n\nSe Custom local repository.\n\n"
    },
    {
      "title": "Udviklere",
      "level": 2,
      "content": "Halv-guder som arbejder på at forbedre Arch uden finansiel støtte. Udviklere er kun overgået af vores guder, Judd Vinet og Aaron Griffin, som igen er overgået af tacos.\n\n"
    },
    {
      "title": "extra/[extra]",
      "level": 2,
      "content": "Arch's core repository ret strømlinet, men vi supplerer det med et større og mere komplet extra repository. Dette repository vokser konstant ved hjælp af pakker, der indsendes fra vores stærke fællesskab. Det er her, man finder desktop environments, window managers og almindelige programmer.\n\n"
    },
    {
      "title": "initramfs",
      "level": 2,
      "content": "Se mkinitcpio.\n\n"
    },
    {
      "title": "initrd",
      "level": 2,
      "content": "Forældet. Bruges i dag ofte som et synonym for initramfs.\n\n"
    },
    {
      "title": "KISS",
      "level": 2,
      "content": "Forkortelse af Keep It Simple, Stupid. Enkelthed er et hovedprincip Arch Linux forsøger at opnå.\n\n"
    },
    {
      "title": "makepkg",
      "level": 2,
      "content": "makepkg will build packages for you. makepkg will read the metadata required from a PKGBUILD file. All it needs is a build-capable Linux platform, curl, and some build scripts. The advantage to a script-based build is that you only really do the work once. Once you have the build script for a package, you just need to run makepkg and it will do the rest: download and validate source files, check dependencies, configure the build time settings, build the package, install the package into a temporary root, make customization, generate meta-info, and package the whole thing up for pacman to use.\n\n"
    },
    {
      "title": "namcap",
      "level": 2,
      "content": "namcap is a package analysis utility that looks for problems with Arch Linux packages or their PKGBUILD files. It can apply rules to the file list, the files themselves, or individual PKGBUILD files.\n\nRules return lists of messages. Each message can be one of three types: error, warning, or information (think of them as notes or comments). Errors (designated by 'E:') are things that namcap is very sure are wrong and need to be fixed. Warnings (designated by 'W:') are things that namcap thinks should be changed but if you know what you are doing then you can leave them. Information (designated 'I:') are only shown when you use the info argument. Information messages give information that might be helpful but is not anything that needs changing.\n\n"
    },
    {
      "title": "Pakke",
      "level": 2,
      "content": "Se pacman#Installing packages.\n\n"
    },
    {
      "title": "Package maintainer",
      "level": 2,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nThe role of a package maintainer is to update packages as new versions become available upstream and to field support questions relating to bugs in said packages. The term applies to:\n\n- Developers who maintain packages in the official repositories (core in particular).\n- Trusted Users who maintain packages in the extra repository.\n- All users who maintain PKGBUILDs in the AUR.\n\nThe maintainer of a package is the person currently responsible for the package. Previous maintainers should be listed as contributors in the PKGBUILD along with others who have contributed to the package.\n\n"
    },
    {
      "title": "pacman",
      "level": 2,
      "content": "Se pacman.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 2,
      "content": "PKGBUILDs er små scripts som bliver brugt til at bygge Arch Linux pakker. Se Creating packages for flere detaljer.\n\n"
    },
    {
      "title": "repository/repo",
      "level": 2,
      "content": "Et repository har pre-compileret pakker af en eller (normalt) flere PKGBUILDer. Official repositories er delt ind i flere dele for lettere vedligehold. Pacman bruger disse repositories til at søge efter pakker og installere dem. Et repository kan være lokal (eks. på din egen computer) eller fra afstand (eks. pakkerne bliver downloaded før de installeres).\n\n"
    },
    {
      "title": "RTFM",
      "level": 2,
      "content": "RTFM stands for \"Read The Friendly Manual\". This simple message is replied to a lot of new Linux/Arch users who ask about the functionality of a program when it is clearly defined in the program's manual.\n\nIt is often used when a user fails to make any attempt to find a solution to the problem themselves. If someone tells you this, they are not trying to offend you; they are just frustrated with your lack of effort.\n\nThe best thing to do if you are told to do this is to read the manual page. To read the program manual page for a particular program named PROGRAM-NAME, type this at the command line: man PROGRAM-NAME.\n\nIf you do not find the answer to your question in the program manual, there are more ways to find the answer. You can:\n\n- search the wiki\n- search the forum\n- search the mailing lists\n- search the web\n\n"
    },
    {
      "title": "Testing repositories",
      "level": 2,
      "content": "De er repositories hvor større pakker/updateringer til pakker ligger før de bliver frigivet til hoved repositories, så de kan blive testet for fejl og upgraderings problemer kan blive fundet. De er deaktiveret fra som standard men kan blive aktiveret i /etc/pacman.conf.\n\n"
    },
    {
      "title": "The Arch Way",
      "level": 2,
      "content": "Den uofficielle betegnelse, der traditionelt bruges til at henvise til Arch Linux Principper.\n\n"
    },
    {
      "title": "TU, Trusted User",
      "level": 2,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nA trusted user is someone who maintains the AUR and the extra repository. Trusted Users may move a package into the extra repository if it has been voted as popular. TUs are appointed by a majority vote by the existing TUs.\n\nTrusted users follow the AUR Trusted User guidelines and TU by-laws\n\n"
    },
    {
      "title": "wiki",
      "level": 2,
      "content": "Vores wiki er stedet hvor man kan finde dokumentation om Arch Linux. Alle kan bidrage til dokumentationen.\n\n"
    }
  ]
}