{
  "title": "Arch Linux (Français)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux est une distribution GNU/Linux polyvalente pour l'architecture x86-64, développée de manière indépendante, qui s'efforce de fournir les dernières versions stables de la plupart des logiciels en suivant un modèle de publication continue (rolling release). L'installation par défaut est un système de base minimal, configuré par l'utilisateur pour n'ajouter que ce qui répond à ses besoins.\n\n"
    },
    {
      "title": "Simplicité",
      "level": 3,
      "content": "Arch Linux définit la simplicité par sans ajouts ou modifications inutiles. Elle livre les logiciels tels qu'ils ont été publiés par les développeurs d'origine en amont (upstream) avec un minimum de changements spécifiques à la distribution en aval (downstream) : les correctifs non acceptés par les développeurs en amont sont évités, et les correctifs en aval d'Arch consistent presque entièrement en des corrections de bogues rétro-portées qui sont rendus obsolètes dès la prochaine version du projet.\n\n"
    },
    {
      "title": "Modernité",
      "level": 3,
      "content": "Arch Linux s'efforce de maintenir les dernières versions stables de ses logiciels tant que la casse des paquets du système peut être raisonnablement évitée. Il est basé sur un système rolling-release, qui permet une installation unique avec des mises à jour continues.\n\nArch incorpore beaucoup des nouvelles fonctionnalités disponibles pour les utilisateurs de GNU/Linux, y compris le système init systemd, les systèmes de fichiers modernes, LVM2, le RAID logiciel, la prise en charge d'udev et initcpio (avec mkinitcpio), ainsi que les derniers noyaux disponibles.\n\n"
    },
    {
      "title": "Pragmatisme",
      "level": 3,
      "content": "Arch est une distribution pragmatique plus qu'idéologique. Les principes énoncés ici ne sont utiles qu'en tant que guides. Les décisions de conception sont prises au cas par cas par consensus des développeurs. L'analyse technique basée sur du factuel et les échanges sont ce qui compte, pas la politique ou l'opinion populaire.\n\nLe grand nombre de paquets et de scripts de compilation dans les différents dépôts d'Arch Linux offrent des logiciels libres pour ceux qui les préfèrent, ainsi que des paquets de logiciels propriétaires pour ceux qui privilégient la fonctionnalité à l'idéologie.\n\n"
    },
    {
      "title": "Centrée sur l'utilisateur",
      "level": 3,
      "content": "Tandis que de nombreuses distributions GNU/Linux tentent d'être plus conviviales, Arch Linux a toujours été, et restera toujours centrée sur l'utilisateur. Elle est destinée à répondre aux besoins de ceux qui y contribuent, plutôt que d'essayer d'attirer le plus grand nombre. Elle est destinée à l'utilisateur compétent de GNU/Linux ou à toute personne ayant une attitude de bricoleur et disposée à lire la documentation et à résoudre ses propres problèmes.\n\nTous les utilisateurs sont encouragés à participer et à contribuer à la distribution. Signaler et aider à corriger les bugs est très apprécié et les patchs améliorant les paquets ou les projets principaux sont très appréciés : Les développeurs d'Arch sont des volontaires et les contributeurs actifs se retrouveront souvent à faire partie de cette équipe. Les Archers peuvent librement contribuer aux paquets dans AUR, améliorer la documentation ArchWiki, fournir une assistance technique aux autres ou simplement échanger des opinions dans les Canaux IRC Arch ainsi que le forum international, le forum francophone ou les mailing lists. Arch Linux est le système d'exploitation de choix pour de nombreuses personnes à travers le monde.\n\n"
    },
    {
      "title": "Versatilité",
      "level": 3,
      "content": "Arch Linux est une distribution polyvalente. Lors de l'installation, seul un environnement en ligne de commande est fourni ; plutôt que de devoir purger les paquets inutiles et indésirables, l'utilisateur a la possibilité de construire un système personnalisé en choisissant parmi des milliers de paquets de haute qualité fournis dans les dépôts officiels pour l'architecture x86-64.\n\nArch suit un modèle de «rolling release» accompagnée par pacman, un gestionnaire de paquets léger, simple et rapide qui permet de mettre continuellement à jour le système entier avec une seule commande. Arch fournit également le Arch build system, un système de type ports pour faciliter la construction et l'installation de paquets à partir des sources, qui peuvent également être synchronisés avec une commande. De plus, le Arch User Repository contient plusieurs milliers de scripts PKGBUILD contribués par la communauté pour compiler des paquets installables à partir des sources en utilisant l'application makepkg. Il est également possible pour les utilisateurs de construire et de maintenir leurs propres dépôts personnalisés facilement.\n\n"
    },
    {
      "title": "Historique",
      "level": 2,
      "content": "La communauté Arch s'est développée et a mûri pour devenir l'une des distributions Linux les plus populaires et les plus influentes, comme en témoigne également les intérêts et critiques reçus au fil des années.\n\nLes développeurs d'Arch restent des volontaires à temps partiel, non rémunérés, et il n'y a aucune perspective de monétisation d'Arch Linux, qui restera donc libre dans tous les sens du terme. Les personnes curieuses d'obtenir plus de détails sur l'histoire du développement d'Arch peuvent parcourir le site d'Arch dans l'Internet Archive Wayback Machine et Les archives des nouvelles d'Arch Linux.\n\n"
    },
    {
      "title": "Les premières années",
      "level": 3,
      "content": "Judd Vinet, un programmeur canadien et guitariste amateur, a commencé à développer Arch Linux au début de l'année 2001. Sa première version officielle, Arch Linux 0.1, a été publiée le 11 mars 2002. Inspiré par l'élégante simplicité de Slackware, BSD, PLD Linux et CRUX mais pourtant déçu par leur manque de gestion de paquets à l'époque, Vinet a construit sa propre distribution sur des principes similaires et a également créé un gestionnaire de paquets nommé pacman, pour gérer automatiquement l'installation, la suppression et les mises à jour des paquets.\n\n"
    },
    {
      "title": "Les années intermédiaires",
      "level": 3,
      "content": "La communauté d'Arch s'est développée de façon régulière, comme le montre ce tableau des messages du forum, des utilisateurs et des rapports de bogues. De plus, elle était dès ses premiers jours connue comme une communauté ouverte, amicale et serviable.\n\n"
    },
    {
      "title": "Naissance de l'ArchWiki",
      "level": 3,
      "content": "Le 8 juillet 2008, l'ArchWiki a été installé sur le moteur MediaWiki.\n\n"
    },
    {
      "title": "L'aube de l'âge d'A. Griffin",
      "level": 3,
      "content": "Fin 2007, Judd Vinet s'est retiré de la participation active en tant que développeur d'Arch, et a transféré en douceur les rênes au développeur américain Aaron Griffin, également connu sous le nom de Phrakture.\n\n"
    },
    {
      "title": "Scripts d'installation d'Arch",
      "level": 3,
      "content": "La version 2012-07-15 de l'image d'installation a rendu obsolète le menu Arch Installation Framework (AIF) en faveur des Arch Install Scripts (arch-install-scripts).\n\n"
    },
    {
      "title": "L'ère de systemd",
      "level": 3,
      "content": "Entre 2012 et 2013, le système d'initialisation traditionnel System V a été remplacé par systemd. [1] [2] [3] [4]\n\n"
    },
    {
      "title": "Abandon de la prise en charge d'i686",
      "level": 3,
      "content": "Le 25 janvier 2017, il a été annoncé que la prise en charge de l'architecture i686 serait progressivement abandonnée en raison de sa popularité décroissante auprès des développeurs et de la communauté. À la fin du mois de novembre 2017, tous les paquets i686 ont été retirés des miroirs.\n\n"
    },
    {
      "title": "Révision du rôle du chef de projet et élection",
      "level": 3,
      "content": "Au début de 2020, grâce à un travail d'équipe, les dirigeants d'Arch Linux a conçu un nouveau processus pour déterminer les futurs chefs du projet, documenté dans DeveloperWiki:Project Leader.\n\nComme Aaron Griffin a décidé de se retirer de son poste, un sondage a été organisé pour élire une nouvelle personne pour le remplacer, et le 24 février 2020 les résultats ont été publiés, rendant l'élection de Levente Polyak officielle.\n\n"
    },
    {
      "title": "L'ère GitLab",
      "level": 3,
      "content": "En Mai 2023, Arch Linux a migré son infrastructure d'empaquetage vers GitLab. Outre les changements et innovations internes, cela a également entraîné la division du dépôt testing en core-testing et extra-testing, le dépôt staging en core-staging et extra-staging, et enfin community a été fusionné dans extra. Pour plus de détails, consultez le blog de GitLab.\n\nPlusieurs mois plus tard, en November 2023, l'ancien bug tracker (Flyspray) a été migré vers GitLab et ses fonctionnalités de collaboration (issues et merge requests) ont été ouvertes au public. Pour des raisons d'archivage, il y aura une copie statique de l'ancien bug tracker afin que les liens (par exemple celui choisi au hasard FS#56716) soient toujours valides.\n\n"
    }
  ]
}