{
  "title": "Arch Linux AMIs for Amazon Web Services (Español)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_AMIs_for_Amazon_Web_Services_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-02-09** \n\n"
    },
    {
      "title": "Imágenes AMI de Uplink Labs",
      "level": 3,
      "content": "Uplink Labs crea nuevas imágenes aproximadamente dos veces al mes. Las imágenes se compilan para varias regiones y cubren las siguientes configuraciones:\n\n- ebs hvm x86_64 lts\n- s3 hvm x86_64 lts\n- ebs hvm x86_64 stable\n- s3 hvm x86_64 stable\n\nLos enlaces de las AMIs y más información se encuentra disponible en https://www.uplinklabs.net/projects/arch-linux-on-ec2/.\n\n"
    },
    {
      "title": "Otras AMIs",
      "level": 3,
      "content": "Las AMIs públicas, en funcionamiento y verificadas de arch linux se encuentran a continuación\n\n```\nAMI          Store Build   Release     Kernel Last verified\nami-07be766e  EBS  64 bit  2011-04-15  3.0+   2012-01-14    \nami-19be7670  EBS  64 bit  2011-11-18  3.0+   2012-01-14    \nami-26e8144f  EBS  32 bit  2011-04-15  2.6    2012-01-14    \nami-38e81451  EBS  32 bit  2011-04-15  2.6    2012-01-14\n```\n\nEstas AMIs se expiden con kernels de Arch linux que se arrancan mediante PV-GRUB.\n\n(2012-01-14) Las AMIs de 64 bits fallaron sistemáticamente en el arranque en las instancias Micro en us-east-1a y us-east-1d. En us-east-1b y us-east-1c, las AMIs ocasionalmente no arrancan. Detenga e inicie la instancia para reasignarle una máquina aleatoria en estos casos.\n\nEsto puede ser un problema asociado a que Amazon ejecuta diferentes versiones de Xen en diferentes máquinas / zonas de disponibilidad más antiguas.\n\n"
    },
    {
      "title": "Compilar AMIs de Arch",
      "level": 2,
      "content": "linux-ec2AUR[enlace roto: package not found] disponible en AUR compila el kernel de Arch linux para AWS con los módulos Xen habilitados y el parche XSAVE aplicado.\n\nLa página web de Uplink Labs mencionada anteriormente también contiene un manual sobre el proceso de compilación.\n\n"
    }
  ]
}