{
  "title": "Arch User Repository (Français)",
  "url": "https://wiki.archlinux.org/title/Arch_User_Repository_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nRelated articles\n\n- makepkg (Français)\n- pacman (Français)\n- PKGBUILD (Français)\n- .SRCINFO\n- Aurweb RPC interface\n- AUR submission guidelines\n- AUR Trusted User Guidelines\n- Official repositories (Français)\n- Arch Build System (Français)\n- Creating packages\n- AUR helpers (Français)\n\nLe dépôt des utilisateurs d'Arch (Arch User Repository) est un dépôt communautaire pour les utilisateurs d'Arch. Il contient des descriptions de paquets (PKGBUILDs) qui vous permettent de compiler un paquet à partir des sources avec makepkg puis de l'installer via pacman. L'AUR a été créé pour organiser et partager les nouveaux paquets de la communauté et pour aider à accélérer l'inclusion des paquets populaires dans le dépôt \"extra\". Ce document explique comment les utilisateurs peuvent accéder à l'AUR et l'utiliser.\n\nUn grand nombre de nouveaux paquets qui entrent dans les dépôts officiels commencent dans l'AUR. Dans l'AUR, les utilisateurs peuvent contribuer à la construction de leurs propres paquets (PKGBUILD et fichiers associés). La communauté AUR a la possibilité de voter pour des paquets dans l'AUR. Si un paquet devient suffisamment populaire — à condition qu'il ait une licence compatible et une bonne technique d'empaquetage — il peut être placé dans le dépôt extra (directement accessible par pacman ou abs).\n\n"
    },
    {
      "title": "Pour commencer",
      "level": 2,
      "content": "Les utilisateurs peuvent rechercher et télécharger des PKGBUILDs à partir de l'interface Web de l'AUR. Ces PKGBUILDs peuvent être construits en paquets installables en utilisant makepkg, puis installés en utilisant pacman.\n\n- Assurez-vous que le méta-paquet base-devel est installé dans son intégralité (pacman -S --need base-devel).\n- Parcourez la #FAQ pour trouver les réponses aux questions les plus courantes.\n- Vous pouvez souhaiter ajuster /etc/makepkg.conf pour optimiser le processus de construction sur votre système avant de construire des paquets à partir de l'AUR. Une amélioration significative des temps de construction des paquets peut être réalisée sur des systèmes avec des processeurs multi-cœurs en ajustant la variable MAKEFLAGS, en utilisant plusieurs cœurs pour la compression, ou en utilisant un algorithme de compression différent. Les utilisateurs peuvent également activer les optimisations du compilateur spécifiques au matériel via la variable CFLAGS. Consultez Makepkg (Français)#Trucs et astuces pour plus d'informations.\n\nIl est également possible d'interagir avec l'AUR par SSH : tapez ssh aur@aur.archlinux.org help pour obtenir une liste des commandes disponibles.\n\n"
    },
    {
      "title": "Historique",
      "level": 2,
      "content": "Au début, il y avait ftp://ftp.archlinux.org/incoming, et les gens contribuaient en téléversant simplement le PKGBUILD, les fichiers supplémentaires nécessaires, et le paquet construit lui-même sur le serveur. Le paquet et les fichiers associés y restaient jusqu'à ce qu'un mainteneur de paquets consulte le programme et l'adopte.\n\nC'est alors que sont nés les dépôts d'utilisateurs de confiance. Certaines personnes de la communauté ont été autorisées à héberger leurs propres dépôts pour que tout le monde puisse les utiliser. L'AUR s'est développé sur cette base, dans le but de le rendre à la fois plus flexible et plus utilisable. En fait, les mainteneurs de l'AUR sont toujours appelés TUs (Trusted Users).\n\nEntre le 2015-06-08 et le 2015-08-08, l'AUR est passé de la version 3.5.1 à 4.0.0, introduisant l'utilisation de dépôts Git pour la publication des PKGBUILD. Les paquets existants ont été abandonnés à moins que leurs responsables ne les aient fait migrer manuellement vers la nouvelle infrastructure.\n\n"
    },
    {
      "title": "Dépôts Git pour les paquets AUR3",
      "level": 3,
      "content": "L'archive AUR Archive sur GitHub contient un dépôt pour chaque paquet de l'AUR 3 au moment de la migration. Il est également possible d'utiliser le dépôt aur3-mirror qui fournit la même chose.\n\n"
    },
    {
      "title": "Installation et mise à jour des paquets",
      "level": 2,
      "content": "L'installation de paquets à partir de l'AUR est un processus relativement simple. Essentiellement :\n\n1. Acquérir les fichiers de construction, y compris le PKGBUILD et éventuellement d'autres fichiers nécessaires, comme les unités et les correctifs systemd (souvent pas le code réel).\n1. Vérifier que le PKGBUILD et les fichiers qui l'accompagnent ne sont pas malveillants ou indignes de confiance.\n1. Exécuter makepkg dans le répertoire où les fichiers sont enregistrés. Ceci va télécharger le code, le compiler et l'empaqueter.\n1. Exécuter pacman -U package_file pour installer le paquet sur votre système.\n\n"
    },
    {
      "title": "Prérequis",
      "level": 3,
      "content": "Assurez-vous d'abord que les outils nécessaires sont présents en installant base-devel, ce méta-paquet inclut make et d'autres outils nécessaires à la compilation à partir des sources dans ses dépendances.\n\nChoisissez ensuite un répertoire de compilation approprié. Un répertoire de compilation est simplement un répertoire où le paquet sera créé ou \"construit\" et peut être n'importe quel répertoire. Les exemples des sections suivantes utiliseront ~/builds comme répertoire de construction.\n\n"
    },
    {
      "title": "Récupérer les fichiers de compilation",
      "level": 3,
      "content": "Localisez le paquet dans l'AUR. Pour ce faire, utilisez le champ de recherche en haut de la page d'accueil de AUR. En cliquant sur le nom de l'application dans la liste de recherche, une page d'information sur le paquet s'affiche. Lisez la description pour confirmer qu'il s'agit bien du paquet souhaité, notez la date de la dernière mise à jour du paquet et lisez les commentaires éventuels.\n\nIl existe plusieurs méthodes pour obtenir les fichiers de compilation d'un paquet :\n\n- Cloner son dépôt git, marqué \"Git Clone URL\" dans les \"Détails du paquet\" sur sa page AUR. C'est la méthode préférée, dont l'avantage est que vous pouvez facilement obtenir des mises à jour du paquet via git pull.\n\n```\n$ git clone ssh://aur@aur.archlinux.org/nom_du_paquet.git\n```\n\n- Télécharger un instantané, soit en cliquant sur le lien \"Download snapshot\" sous \"Package Actions\" sur le côté droit de sa page AUR, soit dans un terminal :\n\n```\n$ curl -L -O ssh://aur@aur.archlinux.org//cgit/aur.git/snapshot/nom_du_paquet.tar.gz\n```\n\n- Utilisez le miroir en lecture seule archlinux/aur sur GitHub, où chaque paquet est situé dans une branche. Il est recommandé de ne cloner qu'une seule branche (le dépôt entier est trop gros et les performances seraient dégradées). Vous pouvez le faire avec l'une des deux méthodes suivantes: Utiliser git clone --single-branch: $ git clone --branch branch_name/package_name --single-branch https://github.com/archlinux/aur Faire un clone partiel de ce dépôt (git clone --depth=1) en ajoutant les branches selectivement:\n\n- Utiliser git clone --single-branch: $ git clone --branch branch_name/package_name --single-branch https://github.com/archlinux/aur\n- Faire un clone partiel de ce dépôt (git clone --depth=1) en ajoutant les branches selectivement:\n\n```\n$ git clone --branch branch_name/package_name --single-branch https://github.com/archlinux/aur\n```\n\n```\n$ git clone --depth=1 https://github.com/archlinux/aur; cd aur$ git remote set-branches --add origin package_name$ git fetch$ git checkout package_name\n```\n\n"
    },
    {
      "title": "Récupérer une clé publique PGP si nécessaire",
      "level": 3,
      "content": "Vérifiez si un fichier de signature sous la forme .sig ou .asc fait partie du tableau source de PKGBUILD. Si c'est le cas, récupérez une des clés publiques listées dans le tableau de PKGBUILD validpgpkeys. Reportez-vous à Makepkg (Français)#Vérification des signatures pour plus d'informations.\n\n"
    },
    {
      "title": "Construire le paquet",
      "level": 3,
      "content": "Changez de répertoire pour atteindre le répertoire contenant le PKGBUILD du paquet.\n\n```\n$ cd nom_du_paquet\n```\n\nAffichez le contenu de tous les fichiers fournis. Par exemple, pour utiliser le pager less pour afficher PKGBUILD, faites :\n\n```\n$ less PKGBUILD\n```\n\n- Pour voir les changements depuis la dernière livraison git, vous pouvez utiliser git show.\n- Pour voir les changements depuis le dernier commit en utilisant vimdiff, faites git difftool @~..@ vimdiff. L'avantage de vimdiff est que vous visualisez le contenu complet de chaque fichier avec des indicateurs sur ce qui a changé.\n\nCréez le paquet. Après avoir confirmé manuellement le contenu des fichiers, exécutez makepkg en tant qu'utilisateur normal. Quelques paramètres utiles :\n\n- -s/--syncdeps résout et installe automatiquement toutes les dépendances avec pacman avant la construction. Si le paquet dépend d'autres paquets AUR, vous devrez d'abord les installer manuellement.\n- -i/--install installe le paquet s'il est construit avec succès. Cela vous permet de sauter l'étape suivante qui est généralement effectuée manuellement.\n- -r/--rmdeps supprime les dépendances après la construction, car elles ne sont plus nécessaires. Cependant, ces dépendances peuvent avoir besoin d'être réinstallées lors de la prochaine mise à jour du paquet.\n- -c/--clean nettoie les fichiers de construction temporaires après la construction, car ils ne sont plus nécessaires. Ces fichiers ne sont généralement nécessaires que pour déboguer le processus de construction.\n\n"
    },
    {
      "title": "Installer le paquet",
      "level": 3,
      "content": "Le paquet peut maintenant être installé avec pacman :\n\n```\n# pacman -U nom_du_paquet-version-architecture.pkg.tar.zst\n```\n\n- Si vous avez modifié votre PKGEXT dans makepkg.conf, le nom du fichier du paquet peut être légèrement différent.\n- L'exemple ci-dessus n'est qu'un bref résumé du processus de construction. Il est fortement recommandé de lire les articles makepkg et ABS pour plus de détails.\n\n"
    },
    {
      "title": "Mise à jour des paquets",
      "level": 3,
      "content": "Dans le répertoire contenant le PKGBUILD du paquet, vous devez d'abord mettre à jour les fichiers et les modifications en utilisant la commande\n\n```\n$ git pull\n```\n\npuis suivre les instructions de construction et d'installation précédentes.\n\n"
    },
    {
      "title": "Suspension",
      "level": 3,
      "content": "Lors de la modification d'un utilisateur en tant qu'utilisateur de confiance, le champ Suspendu peut être défini, ce qui suspend l'utilisateur cible. Quand un utilisateur est suspendu, il ne peut pas:\n\n- Se connecter à https://aur.archlinux.org\n- Recevoir des notifications\n- Interagir avec l'interface git\n\n"
    },
    {
      "title": "Inactivité",
      "level": 3,
      "content": "Lors de la modification de votre propre compte ou d'un autre en tant qu'utilisateur de confiance, le champ Inactif peut être défini. Les comptes inactifs sont utilisés pour deux raisons :\n\n- Afficher la date à laquelle une personne a été marquée inactive sur la page de son compte.\n- Générer un compte courant des utilisateurs de confiance actifs en fonction de leur inactivité pour les nouvelles propositions.\n\n"
    },
    {
      "title": "Commenter les paquets",
      "level": 3,
      "content": "L'interface Web de l'AUR dispose d'une fonction de commentaires qui permet aux utilisateurs de faire des suggestions et de donner leur avis sur les améliorations à apporter au contributeur du PKGBUILD.\n\nPython-Markdown fournit une syntaxe de base Markdown pour formater les commentaires.\n\n- Cette implémentation présente quelques différences occasionnelles avec les règles syntaxiques officielles.\n- Les hashs de commit vers le dépôt Git du paquet et les références aux tickets Flyspray sont convertis en liens automatiquement.\n- Les longs commentaires sont réduits et peuvent être développés à la demande.\n\n"
    },
    {
      "title": "Voter pour les paquets",
      "level": 3,
      "content": "L'une des activités les plus faciles pour tous les utilisateurs d'Arch est de parcourir la liste des paquets de l'AUR et de voter pour leurs paquets préférés en utilisant l'interface en ligne. Tous les paquets peuvent être adoptés par une TU pour être inclus dans le dépôt \"extra\" et le nombre de votes est l'une des considérations de ce processus ; il est dans l'intérêt de tous de voter !\n\nInscrivez-vous sur le site de l'AUR pour obtenir une option \"Votez pour ce paquet\" lorsque vous parcourez les paquets. Après s'être inscrit, il est également possible de voter depuis la ligne de commande avec aurvoteAUR[broken link: package not found], aurvote-gitAUR[broken link: package not found] ou aur-auto-vote-gitAUR.\n\nAlternativement, si vous avez configuré l'autentification par ssh, vous pouvez voter directement depuis la ligne de commande en utilisant votre clé ssh. Cela signifie que vous n'aurez pas besoin d'enregistrer ou de taper votre mot de passe AUR.\n\n```\n$ ssh aur@aur.archlinux.org vote nom_du_paquet\n```\n\n"
    },
    {
      "title": "Signaler les paquets périmés",
      "level": 3,
      "content": "Tout d'abord, vous devez marquer le paquet out-of-date en indiquant les raisons pour lesquelles le paquet est périmé, de préférence en incluant des liens vers l'annonce de la version ou la nouvelle archive.\n\nVous devez également essayer de contacter directement le responsable par courrier électronique. S'il n'y a pas de réponse du responsable après deux semaines, vous pouvez déposer une demande d'orphelinage. Consultez AUR submission guidelines#Requests pour plus de détails.\n\n"
    },
    {
      "title": "Déboguer le processus de construction du paquet",
      "level": 2,
      "content": "1. Assurez-vous que votre environnement de construction est à jour par mettant à jour avant de construire quoi que ce soit.\n1. Assurez-vous que base-devel est installé.\n1. Utilisez l'option -s avec makepkg pour vérifier et installer toutes les dépendances nécessaires avant de lancer le processus de construction.\n1. Essayez la configuration par défaut de makepkg.\n1. Consultez Makepkg (Français)#Dépannage pour les problèmes courants.\n\nSi vous avez des problèmes pour construire un paquet, lisez d'abord son PKGBUILD et les commentaires sur sa page AUR.\n\nIl est possible qu'un PKGBUILD soit cassé pour tout le monde. Si vous ne parvenez pas à le résoudre seul, signalez-le au responsable (par exemple en postant les erreurs que vous obtenez dans les commentaires de la page AUR). Vous pouvez également demander de l'aide sur le forum international AUR Issues, Discussion & PKGBUILD Requests.\n\nLa raison n'est peut-être pas si banale que cela. Les CFLAGS, LDFLAGS et MAKEFLAGS personnalisés peuvent provoquer des échecs. Pour éviter les problèmes causés par la configuration particulière de votre système, construisez les paquets dans un «chroot» vierge. Si le processus de construction échoue toujours dans un chroot propre, le problème provient probablement de PKGBUILD.\n\nConsultez Creating packages#Checking package sanity à propos de l'utilisation de namcap. Si vous souhaitez faire examiner un PKGBUILD, postez-le sur la liste de diffusion aur-general mailing list afin d'obtenir les commentaires des TU et des autres membres de l'AUR, ou sur le forum international Creating & Modifying Packages. Vous pouvez également demander de l'aide sur les canaux IRC.\n\n"
    },
    {
      "title": "Soumettre des paquets",
      "level": 2,
      "content": "Les utilisateurs peuvent partager des PKGBUILDs en utilisant le dépôt des utilisateurs d'Arch. Consultez les directives de soumission à l'AUR (en) pour plus de détails.\n\n"
    },
    {
      "title": "Traduction de l'interface Web",
      "level": 2,
      "content": "Consultez i18n.txt dans l'arborescence des sources de l'AUR pour obtenir des informations sur la création et la maintenance de la traduction de l'interface Web de l'AUR.\n\n"
    },
    {
      "title": "Quels types de paquets sont autorisés sur l'AUR ?",
      "level": 3,
      "content": "Les paquets sur l'AUR sont simplement des \"scripts de construction\", c'est-à-dire des recettes pour construire des binaires pour pacman. Dans la plupart des cas, tout est permis, sous réserve des guides d'utilité et de périmètre, tant que vous êtes en conformité avec les conditions de licence du contenu. Pour les autres cas, lorsqu'il est mentionné que \"vous ne pouvez pas faire de lien\" vers des téléchargements, c'est-à-dire des contenus qui ne sont pas re-distribuables, vous ne pouvez utiliser que le nom du fichier lui-même comme source. Cela signifie et exige que les utilisateurs aient déjà la source restreinte dans le répertoire de construction avant de construire le paquet. En cas de doute, demandez.\n\n"
    },
    {
      "title": "Comment puis-je voter pour des paquets dans l'AUR ?",
      "level": 3,
      "content": "Consultez #Voter pour les paquets.\n\n"
    },
    {
      "title": "Qu'est-ce qu'un utilisateur de confiance (Trusted User / TU) ?",
      "level": 3,
      "content": "Un Trusted User, abrégé TU, est une personne choisie pour superviser l'AUR et le dépôt \"extra\". Ce sont eux qui maintiennent les PKGBUILDs populaires dans extra et qui font fonctionner l'AUR.\n\n"
    },
    {
      "title": "Quelle est la différence entre le dépôt de l'utilisateur d'Arch et le dépôt \"extra\" ?",
      "level": 3,
      "content": "Le dépôt des utilisateurs d'Arch est l'endroit où sont stockés tous les PKGBUILDs que les utilisateurs soumettent, et doit être construit manuellement avec makepkg. Lorsque les PKGBUILDs reçoivent suffisamment d'intérêt de la part de la communauté et le soutien d'une TU, ils sont déplacés dans le dépôt \"extra\" (maintenu par les TU), où les paquets binaires peuvent être installés avec pacman.\n\n"
    },
    {
      "title": "Foo dans l'AUR est périmé ; que dois-je faire ?",
      "level": 3,
      "content": "Consultez #Signaler les paquets périmés.\n\nEn attendant, vous pouvez essayer de mettre à jour le paquet vous-même en modifiant le PKGBUILD localement. Parfois, les mises à jour ne nécessitent pas de modifications du processus de construction ou d'empaquetage, auquel cas la simple mise à jour du tableau pkgver ou source est suffisante.\n\n"
    },
    {
      "title": "Foo dans l'AUR ne compile pas lorsque j'exécute makepkg ; que dois-je faire ?",
      "level": 3,
      "content": "Vous manquez probablement quelque chose de trivial; consultez #Déboguer le processus de construction du paquet.\n\n"
    },
    {
      "title": "ERREUR : Une ou plusieurs signatures PGP n'ont pas pu être vérifiées ; que dois-je faire ?",
      "level": 3,
      "content": "Il est fort probable que vous n'ayez pas la ou les clés publiques requises dans votre trousseau de clés personnel pour vérifier les fichiers téléchargés. Consultez Makepkg (Français)#Vérification des signatures pour plus de détails.\n\n"
    },
    {
      "title": "Comment créer un PKGBUILD ?",
      "level": 3,
      "content": "Consultez les Règles de soumission, puis consultez l'article anglais concernant la création de paquets.\n\n"
    },
    {
      "title": "J'ai un PKGBUILD que je voudrais soumettre ; quelqu'un peut-il le consulter pour voir s'il y a des erreurs ?",
      "level": 3,
      "content": "Il y a plusieurs canaux disponibles pour soumettre votre paquet pour examen ; consultez #Déboguer le processus de construction du paquet.\n\n"
    },
    {
      "title": "Comment passer un PKGBUILD dans le dépôt \"extra\" ?",
      "level": 3,
      "content": "Habituellement, au moins 10 votes sont nécessaires pour que quelque chose passe dans le dépôt \"extra\". Cependant, si un TU veut prendre en charge un paquet, il sera souvent trouvé dans le dépôt.\n\nAtteindre le minimum requis de votes n'est pas la seule condition; il doit y avoir un TU qui souhaite maintenir le paquet. Les TU ne sont pas obligées de déplacer un paquet dans le dépôt extra même s'il a des milliers de votes.\n\nHabituellement, lorsqu'un paquet très populaire reste dans l'AUR, c'est pour les raisons suivantes :\n\n- Arch Linux possède déjà une autre version d'un paquet dans ses dépôts.\n- Sa licence interdit la redistribution\n- Il aide à récupérer les PKGBUILDs soumis par les utilisateurs. Les assistants d'AUR sont non pris en charge par définition.\n\nConsultez également Rules for Packages Entering the extra Repo.\n\n"
    },
    {
      "title": "Comment puis-je accélérer les processus de construction répétés ?",
      "level": 3,
      "content": "Consultez Makepkg (Français)#Améliorer les temps de compilation.\n\n"
    },
    {
      "title": "Quelle est la différence entre les paquets foo et foo-git ?",
      "level": 3,
      "content": "De nombreux paquets AUR existent en version \"stable\" et en version de développement \"instable\". Les paquets de développement ont généralement un suffixe indiquant leur Système de contrôle de version et ne sont pas destinés à une utilisation régulière, mais peuvent offrir de nouvelles fonctionnalités ou des corrections de bogues. Étant donné que ces paquets ne téléchargent que la dernière source disponible lorsque vous exécutez makepkg, leur pkgver() dans l'AUR ne reflète pas les changements en amont. De même, ces paquets ne peuvent pas effectuer une somme de contrôle d'authenticité sur les source.\n\nConsultez également System maintenance (Français)#Utiliser des paquets logiciels éprouvés.\n\n"
    },
    {
      "title": "Pourquoi foo a-t-il disparu de l'AUR ?",
      "level": 3,
      "content": "Il est possible que le paquet ait été adopté par une TU et se trouve maintenant dans le dépôt \"extra\".\n\nLes paquets peuvent être supprimés s'ils ne remplissaient pas les règles de soumission. Consultez les aur-requests archives pour connaître la raison de la suppression.\n\nSi le paquet existait dans AUR3, il n'a peut-être pas été migré vers AUR4. Consultez les #Dépôts Git pour les paquets AUR3 où ils sont conservés.\n\n"
    },
    {
      "title": "Comment puis-je savoir si un de mes paquets installés a disparu d'AUR ?",
      "level": 3,
      "content": "Le moyen le plus simple est de vérifier l'état HTTP de la page AUR du paquet :\n\n```\n$ comm -23 <(pacman -Qqm | sort) <(curl https://aur.archlinux.org/packages.gz | gzip -cd | sort)\n```\n\n"
    },
    {
      "title": "Comment puis-je obtenir une liste de tous les paquets AUR ?",
      "level": 3,
      "content": "- https://aur.archlinux.org/packages.gz\n- Utilisez aurpkglist de python3-aurAUR.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Interface Web AUR\n- Liste de diffusion AUR\n\n"
    }
  ]
}