{
  "title": "Arch compared to other distributions (Français)",
  "url": "https://wiki.archlinux.org/title/Arch_compared_to_other_distributions_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Arch Linux (Français)\n- Arch based distributions\n- Pacman/Rosetta\n- Arch is the best\n\nCette page cherche à comparer Arch Linux, d'autres distributions GNU/Linux populaires et des systèmes d'exploitations de type UNIX. Les résumés suivants sont de brèves descriptions pour aider dans leur décision les personnes cherchant à savoir si Arch Linux répondra à leurs besoins. Bien que les analyses et les descriptions soient utiles, l'expérience de première main est invariablement la meilleur façon de comparer des distributions.\n\nPour une comparaison plus complète, voir Comparaison des systèmes d'exploitation et Comparaison des distributions Linux.\n\nDans tout ce qui suit, seul Arch Linux est comparé aux autres distributions. Les ports communautaires qui prennent en charge des architectures autres que x86_64 peuvent être trouvés listés parmi les distributions basées sur Arch.\n\n"
    },
    {
      "title": "Distributions «Sources»",
      "level": 2,
      "content": "Les distributions basées sur les sources sont hautement portables, offrant l'avantage de contrôler et de compiler l'ensemble du système d'exploitation et des applications pour une architecture de machine et un schéma d'utilisation particuliers, avec l'inconvénient de la nature chronophage de la compilation des sources. La base Arch et tous les paquets sont uniquement compilés pour l'architecture x86_64.\n\n"
    },
    {
      "title": "CRUX",
      "level": 3,
      "content": "- CRUX est une distribution légère qui se concentre sur le principe de KISS. CRUX a inspiré Judd Vinet pour la création d'Arch.\n- CRUX utilise des scripts d'initialisation de style BSD, alors qu'Arch utilise systemd.\n- Alors qu'Arch utilise un système de version continue, CRUX a des versions plus ou moins annuelles.\n- Les deux sont livrés avec des systèmes de type port et, comme les *BSD, fournissent un environnement de base sur lequel on peut construire.\n- Arch fournit pacman, qui gère les paquets du système binaire et fonctionne de manière transparente avec le Arch Build System. CRUX utilise un système fourni par la communauté appelé prt-get, qui, en combinaison avec son propre système de ports, gère la résolution des dépendances, mais construit tous les paquets à partir des sources (bien que l'installation de base de CRUX soit binaire).\n- Arch et CRUX ne prennent officiellement en charge que l'architecture x86_64.\n- Arch propose un large éventail de dépôts de paquets binaires ainsi que le Arch User Repository. CRUX fournit un système de ports officiels plus réduit en plus d'un dépôt communautaire plus modeste.\n\n"
    },
    {
      "title": "LFS",
      "level": 3,
      "content": "- LFS, (ou Linux From Scratch) existe que comme documentation. Le livre explique à l'utilisateur comment obtenir le code source d'un ensemble minimal de paquets de base pour un système GNU/Linux fonctionnel, et comment le compiler, le patcher et le configurer manuellement à partir de zéro. LFS est aussi minimal que possible et offre un processus excellent et éducatif de construction et de personnalisation d'un système de base.\n- LFS ne fournit aucun dépôt en ligne ; les sources sont obtenues manuellement, compilées et installées avec make. (Plusieurs méthodes manuelles de gestion des paquets existent, et sont mentionnées dans les LFS Hints).\n- Arch fournit ces mêmes paquets, ajoute systemd, quelques outils supplémentaires et le puissant gestionnaire de paquets pacman comme système de base, déjà compilé pour x86_64. En plus du système de base minimal d'Arch, la communauté Arch et les développeurs fournissent et maintiennent plusieurs milliers de paquets binaires installables via pacman ainsi que des scripts de construction PKGBUILD à utiliser avec le Arch Build System. Arch inclut également l'outil makepkg pour construire ou personnaliser rapidement des paquets, facilement installables par pacman.\n- Judd Vinet a construit Arch à partir de rien, et a ensuite écrit pacman en C. Historiquement, Arch a parfois été décrit avec humour comme \"Linux, avec un bon gestionnaire de paquets\".\n\n"
    },
    {
      "title": "Gentoo/Funtoo Linux",
      "level": 3,
      "content": "- Arch Linux et Gentoo Linux sont tous deux des systèmes de publication continue, rendant les paquets disponibles pour la distribution peu de temps après leur publication en amont.\n- Les paquets et le système de base de Gentoo sont construits directement à partir du code source en fonction des USE flags spécifiés par l'utilisateur. Arch fournit un système semblable aux ports pour construire les paquets à partir des sources, bien que le système de base d'Arch soit conçu pour être installé en tant que binaire x86_64 pré-construit. Cela rend généralement Arch plus rapide à construire et à mettre à jour, et permet à Gentoo d'être plus personnalisable au niveau du système.\n- Arch ne prends en charge que x86_64 alors que Gentoo prends en charge officiellement les architectures x86 (i486/i686), x86_64, PPC/PPC64, SPARC, Alpha, ARM, MIPS, HPPA, S/390 et Itanium.\n- Les outils officiels de gestion des paquets et du système de Gentoo ont tendance à être plutôt plus complexes et \"puissants\" que ceux fournis par Arch, et certaines fonctionnalités qui sont au cœur même de Gentoo (USE flags, SLOTs, etc.) n'ont pas d'équivalent direct sur Arch Linux. Cela est dû en partie au fait qu'Arch est principalement une distribution binaire, mais les différences dans les philosophie de conception jouent également un rôle important, Arch adoptant une position de principe en faveur de la simplicité architecturale et évitant la sur-ingénierie.\n- Comme les installations de Gentoo et d'Arch ne comprennent qu'un système de base, elles sont toutes deux considérées comme hautement personnalisables. S'ils sont à l'aise avec systemd, les utilisateurs de Gentoo seront aussi généralement à l'aise avec la plupart des autres aspects d'Arch.\n\n"
    },
    {
      "title": "GNU Guix System",
      "level": 3,
      "content": "- GNU Guix System a été inspiré par NixOS d'une manière similaire à celle dont Arch a été inspiré par CRUX.\n- Arch Linux et Guix System sont toutes les deux des distributions rolling release, rendant les paquets disponibles pour la distribution peu de temps après leur publication en amont. Guix System est cependant principalement une distribution basée sur les sources (bien que des binaires pré-construits existent et sont appelés \"substitutes\"), alors qu'Arch est principalement une distribution binaire.\n- Arch utilise pacman comme gestionnaire de paquets, alors que Guix System utilise guix, qui prends en charge des fonctionnalités expérimentales d'empaquetage non présent dans les autres distributions.\n- Arch ne prends en charge que x86_64, alors que Guix System fournit officiellement plusieurs architectures.\n- Arch utilise systemd comme système init, alors que Guix System utilise le GNU Shepherd.\n- Le Guix System rompt avec de nombreux concepts traditionnels d'Unix, y compris la Filesystem Hierarchy Standard. Par exemple, de nombreux fichiers qui dans les distributions traditionnelles sont répartis dans différents répertoires, dans le Guix System seront situés quelque part sous /gnu/store/.\n- Arch peut occasionnellement fournir des logiciels non-libres (souvent des pilotes), alors que Guix System ne fournit que des logiciels libres et est approuvé par la Free Software Foundation. - bien qu'il existe des dépôts alternatifs qui fournissent des logiciels non-libres pour Guix [1].\n- Arch attend de l'utilisateur qu'il configure directement les logiciels installés, alors que le système Guix encourage une configuration globale du système en Scheme, qui à son tour instancie les fichiers de configuration.\n\n"
    },
    {
      "title": "Distributions «Générales»",
      "level": 2,
      "content": "Ces distributions offrent un large éventail d'avantages et de points forts, et peuvent être adaptées à la plupart des utilisations du système d'exploitation.\n\n"
    },
    {
      "title": "Debian",
      "level": 3,
      "content": "- Debian est la plus grande distribution Linux en amont, avec une communauté plus importante et les branches stable (Stable), test (Testing) et instable (Unstable), offrant plus de 148 000 paquets. Le nombre de paquets binaires disponibles pour Arch est plus modeste. Cependant, en incluant l'AUR, les quantités sont comparables.\n- Debian a une position plus véhémente sur les logiciels libres mais inclut toujours des logiciels non libres dans ses dépôts non libres. Arch est plus indulgent, et donc inclusif, concernant les \"paquets non libres\" tels que définis par GNU.\n- Debian se concentre sur les tests rigoureux de la branche Stable, qui est \"gelée\" et prise en charge jusqu'à cinq ans. Les paquets Arch sont plus récents que ceux de Debian Stable, étant plus comparables aux branches Debian Testing et Unstable, et n'ont pas de calendrier de publication fixe.\n- Debian est disponible pour de nombreuses architectures, y compris alpha, arm, hppa, i386, x86_64, ia64, m68k, mips, mipsel, powerpc, s390 et sparc, alors qu'Arch est uniquement x86_64.\n- Arch fournit un système plus rapide pour construire des paquets personnalisés et installables à partir de sources extérieures, avec un système de construction de paquets semblable à celui des ports. Debian n'offre pas de système de ports, s'appuyant plutôt sur ses grands dépôts de binaires.\n- Le système d'installation d'Arch n'offre qu'une base minimale, exposée de manière transparente pendant la configuration du système, alors que les méthodes de Debian, comme l'utilisation des \"tâches\" d'apt pour installer des groupes de paquets présélectionnés, offrent une approche plus automatiquement configurée ainsi que plusieurs méthodes alternatives d'installation.\n- Arch empaquette généralement les bibliothèques logicielles avec leurs fichiers d'en-tête, alors que dans Debian les fichiers d'en-tête doivent être téléchargés séparément.\n- Arch maintient les correctifs au minimum, évitant ainsi les problèmes que les développeurs en amont ne sont pas en mesure d'examiner, alors que Debian corrige ses paquets plus librement pour un public plus large.\n\n"
    },
    {
      "title": "Fedora",
      "level": 3,
      "content": "- Fedora est développée de façon communautaire, tout en étant soutenue par Red Hat ; elle est souvent présenté comme un système «ballon d'essai». Les paquets et projets migrent lentement de Fedora à RHEL. Arch n'a pas de notion de «version», et n'est pas la branche de test d'une autre distribution.\n- Les paquets Fedora utilisent le format RPM avec le gestionnaire de paquets DNF. Arch utilise pacman pour gérer ses paquets.\n- Fedora refuse d'inclure des logiciels propriétaires dans ses dépôts officiels en raison de son attachement au logiciel libre, bien que des dépôts tiers soient disponibles pour de tels paquets. Arch est plus indulgente en ce qui concerne les logiciels propriétaires, laissant cette question à la discrétion de l'utilisateur.\n- Fedora offre de nombreuses options d'installation, y compris un installateur graphique ainsi qu'une option minimale. Les spins Fedora fournissent également des assortiments alternatifs d'environnements de bureau parmi lesquels choisir, chacun avec un assortiment modeste de paquets par défaut. Arch, en revanche, ne fournit que quelques scripts destinés à faciliter le processus d'installation d'un système de base minimal.\n- * Fedora suit un cycle de publication planifié, mais prends en charge officiellement les mises à jour de versions individuelles avec l'outil FedUp. Arch est un système en «rolling-release».\n- Arch fournit un système de ports (ABS), alors que Fedora n'en dispose pas.\n- Arch comme Fedora ciblent des utilisateurs et développeurs expérimentés. Le deux encouragent fortement leurs utilisateurs à contribuer au développement du projet.\n- Fedora a gagné la reconnaissance de la communauté par l'intégration de SELinux, la suppression des dépendances au JRE d'Oracle par les paquets GCJ, leurs contributions prolifiques en amont. Les développeurs de Red Hat et par extension de Fedora sont ceux qui contribuent le plus en pourcentage au code du noyau Linux, comparé à tout autre projet.\n- Arch Linux fournit le wiki qui est généralement considéré comme la plus complète et exhaustive des documentation d'une distribution. Le wiki Fedora est plus utilisé au sens original du terme «wiki», un moyen d'échange rapide d'information entre développeurs, testeurs et utilisateurs. Il n'a pas pour cible la diffusion de la connaissance à l'utilisateur final.\n\n"
    },
    {
      "title": "Slackware",
      "level": 3,
      "content": "- Slackware utilise des scripts d'initialisation de style BSD, alors que Arch utilise systemd.\n- Arch fournit un système de gestion des paquets avec pacman qui, contrairement aux outils standards de Slackware, offre une résolution automatique des dépendances et permet des mises à jour plus automatisées du système. Les utilisateurs de Slackware préfèrent généralement leur méthode de résolution manuelle des dépendances, citant le niveau de contrôle du système qu'elle leur accorde, ainsi que l'excellente offre de Slackware en matière de bibliothèques et de dépendances préinstallées.\n- Arch est un système en rolling-release. Slackware est considéré comme plus conservateur dans son cycle de publication, préférant les paquets stables et éprouvés. Arch est plus bleeding-edge à cet égard.\n- Arch Linux fournit plusieurs milliers de paquets binaires dans ses dépôts officiels, alors que les dépôts officiels de Slackware sont plus modestes.\n- Arch offre le Arch Build System, un véritable système de ports et aussi le AUR, une très grande collection de PKGBUILDs contribués par les utilisateurs. Slackware offre un système similaire, bien que plus fin, sur slackbuilds.org qui est un dépôt semi-officiel de Slackbuilds, qui sont analogues aux PKGBUILDs d'Arch. Les utilisateurs de Slackware seront généralement assez à l'aise avec la plupart des aspects d'Arch.\n\n"
    },
    {
      "title": "Distributions «Grand Public»",
      "level": 2,
      "content": "Parfois appelées distributions pour débutants, ces dernières partagent beaucoup de similitudes, bien qu'Arch soit assez différente d'elles. Arch peut être un meilleur choix si vous voulez apprendre à connaître GNU/Linux en partant d'une petite base, car une installation d'Arch installe peu de paquets en comparaison. Les différences spécifiques entre les distributions sont décrites ci-dessous.\n\n"
    },
    {
      "title": "Ubuntu",
      "level": 3,
      "content": "- https://www.ubuntu.com/ Ubuntu] est une distribution populaire basée sur Debian et sponsorisée commercialement par Canonical Ltd, tandis qu'Arch est un système développé indépendamment et construit de zéro.\n- Les deux projets ont des objectifs très différents et s'adressent à une base d'utilisateurs différente. Arch est conçu pour les utilisateurs qui souhaitent une approche de type do-it-yourself, alors qu'Ubuntu fournit un système préconfiguré. Arch présente un design plus simple à partir de l'installation de base, en comptant sur l'utilisateur pour le personnaliser selon ses besoins spécifiques. De nombreux utilisateurs d'Arch ont commencé sur Ubuntu et ont finalement migré vers Arch.\n- Le développement d'Arch n'est pas orienté vers une interface utilisateur particulière, au-delà de ce que sa communauté prend en charge. De plus, la nature commerciale de Canonical l'a conduit à prendre des décisions controversées, comme l'inclusion de publicités dans le menu Dash d'Unity et la collecte de données sur les utilisateurs. Arch est un projet indépendant, dirigé par la communauté et sans but commercial.\n- Ubuntu passe d'une version distincte à une autre tous les 6 mois, alors qu'Arch est un système à version continue.\n- Arch offre un système de construction de paquets de type ports et le Arch User Repository, où les utilisateurs peuvent partager les paquets sources pour le gestionnaire de paquets pacman. Ubuntu utilise le système plus complexe apt et permet la redistribution de paquets binaires via Personal Package Archives.\n- Les deux communautés diffèrent également sur certains points. La communauté Arch est beaucoup plus petite et est fortement encouragée à contribuer à la distribution. En revanche, la communauté Ubuntu est relativement importante et peut donc tolérer un pourcentage beaucoup plus élevé d'utilisateurs qui ne contribuent pas activement au développement, à l'empaquetage ou à la maintenance des dépôts.\n\n"
    },
    {
      "title": "Linux Mint",
      "level": 3,
      "content": "- Linux Mint est née comme une dérivée d'Ubuntu, auquel s'est ajouté plus tard la LMDE (Linux Mint Debian Edition) qui s'est elle basée sur Debian. Arch est de son côté une distribution indépendante qui s'appuie sur son propre système de construction et ses dépots.\n- Mint inclut plusieurs outils graphiques pour faciliter la maintenance, appelés MintTools. Arch ne fournit que des outils simples en ligne de commande comme pacman et laisse la gestion du système à l'utilisateur.\n- De nouvelles versions de Mint sont publiées tous les six mois, environ un mois après Ubuntu. Chaque version est basée sur la plus récente Ubuntu LTS et reste prise en charge pendant cinq ans. Linux Mint Debian Edition (LMDE) est basé sur Debian Stable et ne reçoit que les mises à jour des paquets Mint et les mises à jour de sécurité. Arch est au contraire une distribution complète de type rolling-release.\n\n"
    },
    {
      "title": "openSUSE",
      "level": 3,
      "content": "Suse est construite autour de son outil de configuration graphique très réputé YaST2 ainsi que le format de paquets RPM. Pour la plupart des utilisateurs, il couvre l'ensemble de leurs besoins. Arch n'offre pas une telle facilité, car cela irait à l'encontre du principe KISS. Arch n'offre pas une telle possibilité. openSUSE, pourra donc être plus approprié pour les utilisateurs qui veulent un environnement plus orienté vers une interface graphique, une configuration automatique, ou des fonctionnalités incluses immédiatement à l'installation tout en permettant une personnalisation en profondeur.\n\n"
    },
    {
      "title": "Mandriva/Mageia",
      "level": 3,
      "content": "Mandriva Linux (anciennement Mandrake Linux) a été créée en 1998 dans le but de rendre GNU/Linux facile à utiliser pour tous ; elle est basée sur RPM et utilise le gestionnaire de paquets urpmi. Mageia est un fork de Mandriva créé par d'anciens employés de Mandriva qui s'oppose à la position commerciale de sa distribution mère, étant un projet à but non lucratif et dirigé par la communauté. Arch adopte une approche plus simple que Mandriva ou Mageia, étant basé sur du texte et reposant sur une configuration plus manuelle, elle est destiné aux utilisateurs intermédiaires à avancés.\n\n"
    },
    {
      "title": "Les BSD",
      "level": 2,
      "content": "- Les BSD ont une origine commune et descendent directement du travail effectué à l'UC Berkeley pour produire un système UNIX gratuit et librement redistribuable. Ce ne sont pas des distributions GNU/Linux, mais plutôt des systèmes d'exploitation de type UNIX, et dérivés du code UNIX original d'AT&T.\n- Arch et les BSDs partagent le concept d'un système de base et de ports étroitement intégrés. Cependant, contrairement aux distributions GNU/Linux telles qu'Arch, le noyau et les programmes utilisateurs des BSDs (tels que l'interpréteur de commandes et les utilitaires de base comme ls, cp, cat, et ps) sont développés ensemble dans un seul dépôt de sources.\n- La licence BSD est permissive, contrairement à la GPL, qui stipule que les dérivés doivent être publiés sous la même licence. Arch est publié sous la GPL.\n- Pour en savoir plus sur les variantes de BSD, voir Wikipedia:Comparison of BSD operating systems.\n\n"
    },
    {
      "title": "À consulter également",
      "level": 2,
      "content": "- DistroWatch - Nouvelles et critiques des distributions de Linux.\n\n"
    }
  ]
}