{
  "title": "Arch Linux (Ελληνικά)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(%CE%95%CE%BB%CE%BB%CE%B7%CE%BD%CE%B9%CE%BA%CE%AC)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **H μετάφραση του άρθρου ή τμήματος αυτού, δεν αντικατοπτρίζει το αρχικό κείμενο.** H μετάφραση του άρθρου ή τμήματος αυτού, δεν αντικατοπτρίζει το αρχικό κείμενο.\n\nH μετάφραση του άρθρου ή τμήματος αυτού, δεν αντικατοπτρίζει το αρχικό κείμενο.\n\nΤο Arch Linux είναι μια ανεξάρτητα ανεπτυγμένη x86_64 διανομή γενικής χρήσης, που προσπαθεί να παρέχει τις τελευταίες σταθερές εκδόσεις των περισσότερων προγραμμάτων, βασισμένη στο μοντέλο αναβαθμίσεων rolling-release. Η προεπιλεγμένη εγκατάσταση παρέχει ένα μινιμαλιστικό, βασικό σύστημα, το οποίο μπορεί να παραμετροποιηθεί από τον χρήστη ώστε να προσθέσει εκείνος ό,τι χρειάζεται.\n\n"
    },
    {
      "title": "Απλότητα",
      "level": 3,
      "content": "Το Arch Linux ορίζει την απλότητα ως χωρίς περιττές προσθήκες ή αλλαγές. Παρέχει το λογισμικό όπως εκείνο διανέμεται από τους προγραμματιστές του (upstream) με ελάχιστες συγκεκριμένες για το Arch Linux αλλαγές (downstream): τα patches που δεν γίνονται δεκτά από το upstream αποφεύγονται, και τα downstream patches συνήθως περιλαμβάνουν αποκλειστικά διορθώσεις λαθών (bug fixes).\n\nΜε παρόμοιο τρόπο, τα Arch παρέχουν τα αρχεία ρυθμίσεων που παρέχουν και οι αρχικοί προγραμματιστές, με ελάχιστες αλλαγές που αφορούν συγκεκριμένα το Arch Linux, όπως η αλλαγή του μονοπατιού που θα αποθηκευτεί ένα αρχείο. Δεν αυτοματοποιεί λειτουργίες όπως η ενεργοποίηση μιας υπηρεσίας απλώς επειδή εγκαταστάθηκε το αντίστοιχο πακέτο. Ένα πακέτο διαχωρίζεται σε μικρότερα μόνο όταν πράγματι προσφέρει κάποιο πλεονέκτημα, όπως η εξοικονόμηση χώρου στον δίσκο. Δεν προσφέρεται επίσημα κάποιο γραφικό πρόγραμμα που να βοηθά στην διαχείριση του συστήματος, ενθαρρύνοντας τον χρήστη να παραμετροποιήσει το σύστημά του μέσω της γραμμής εντολών κι ενός κειμενογράφου.\n\n"
    },
    {
      "title": "Μοντερνισμός",
      "level": 3,
      "content": "Τα Arch Linux προσπαθεί να συντηρεί την τελευταία σταθερή έκδοση των προγραμμάτων που διανέμει, εφ' όσον αυτό μπορεί να γίνει χωρίς να σπάσει το σύστημα (package breakage). Είναι βασισμένο σε ένα σύστημα συνεχούς αναβάθμισης (rolling-release), που επιτρέπει σε ένα σύστημα που θα εγκατασταθεί μία φορά να λαμβάνει αναβαθμίσεις συνεχόμενα.\n\nΤο Arch ενσωματώνει πολλά από τα καινούρια χαρακτηριστικά που υπάρχουν διαθέσιμες σε χρήστες του GNU/Linux, συμπεριλαμβάνοντας το systemd init system, μοντέρνα συστήματα αρχείων, LVM2, software RAID, υποστήριξη udev και initcpio (μεσω του mkinitcpio), όπως επίσης και τους τελευταίους διαθέσιμους πυρήνες.\n\n"
    },
    {
      "title": "Πραγματισμός",
      "level": 3,
      "content": "Το Arch είναι μια πρακτική διανομή παρά μια ιδεολογική. Οι αρχές εδώ είναι μόνο χρήσιμες οδηγίες. Τελικά, οι αποφάσεις σχεδιασμού λαμβάνονται κατά περίπτωση μέσω της συναίνεσης των προγραμματιστών. Η τεχνική ανάλυση και η συζήτηση που βασίζεται σε στοιχεία είναι αυτό που έχει σημασία, όχι η πολιτική ή η δημοφιλής γνώμη.\n\nΟ μεγάλος αριθμός πακέτων και script build στα διάφορα αποθετήρια του Arch Linux προσφέρει ελεύθερο και ανοιχτού κώδικα λογισμικό για όσους το προτιμούν, καθώς και ιδιόκτητα πακέτα λογισμικού για όσους ασπάζονται τη λειτουργικότητα και όχι την ιδεολογία.\n\n"
    },
    {
      "title": "Χρηστοκεντρικότητα",
      "level": 3,
      "content": "Ενώ οι περισσότερες διανομές του GNU/Linux στοχεύουν στο να είναι εύχρηστες, το Arch Linux θέτει στο επίκεντρο τον χρήστη και θα συνεχίσει να το κάνει. Η διανομή σκοπεύει να εξυπηρετήσει τις ανάγκες αυτών που συνεισφέρουν σε αυτή, αντί να προσπαθεί να προσελκύσει όσους περισσότερους χρήστες γίνεται. Στοχεύει στον χρήστη που έχει εντριβή με το GNU/Linux, ή οποιονδήποτε με την νοοτροπία \"φτιάξ' το μόνος σου\" που είναι πρόθυμος να διαβάσει την τεκμηρίωση και να λύσει τα προβλήματά του μόνος του.\n\nΌλοι οι χρήστες ενθαρρύνονται να συμμετάσχουν και να συνεισφέρουν στη διανομή. Δίνεται μεγάλη αξία στην αναφορά και στην βοήθεια διόρθωσης προβλημάτων, και τα patches που βελτιώνουν πακέτα των core projects εκτιμώνται πολύ: οι προγραμματιστές του Arch είναι εθελοντές, κι όσοι συνεισφέρουν συχνά θα νιώσουν σαν να γίνονται μέλη της ομάδας αυτής. Οι χρήστες του Arch μπορούν να συνεισφέρουν ελέυθερα πακέτα στο Arch User Repository, να βελτιώσουν την τεκμηρίωση στο ArchWiki, να προσφέρουν βοήθεια τεχνικής φύσης σε άλλους, ή απλώς να ανταλλάξουν απόψεις στο forum, στις λίστες ηλεκτρονικού ταχυδρομείου, ή στα κανάλια του IRC. Το Arch είναι το λειτουργικό σύστημα που επιλέγουν να χρησιμοποιήσουν πολλοί άνθρωποι από όλο τον κόσμο, και υπάρχουν πολλές διεθνείς κοινότητες που προσφέρουν βοήθεια και τεκμηρίωση σε πολλές διαφορετικές γλώσσες.\n\n"
    },
    {
      "title": "Προσαρμοστικότητα",
      "level": 3,
      "content": "Το Arch Linux είναι μια διανομή γενικής χρήσης. Κατά την εγκατάσταση, παρέχεται μόνο ένα περιβάλλον γραμμής εντολών: αντί ο χρήστης να διαχωρίζει τα περιττά και ανεπιθύμητα πακέτα, προσφέρεται στον χρήστη η δυνατότητα να δημιουργήσει ένα προσαρμοσμένο σύστημα επιλέγοντας ανάμεσα σε χιλιάδες πακέτα υψηλής ποιότητας που παρέχονται στα επίσημα αποθετήρια για την αρχιτεκτονική x86-64\n\nΤο Arch υποστηρίζεται από το pacman, έναν ελαφρύ, απλό και γρήγορο διαχειριστή πακέτων που επιτρέπει την αναβάθμιση ολόκληρου του συστήματος με μία εντολή. Το Arch παρέχει επίσης το Arch build system, ένα σύστημα port-like για να διευκολύνει τη δημιουργία και εγκατάσταση πακέτων από πηγαίο κώδικα, τα οποία μπορούν επίσης να συγχρονιστούν με μία εντολή. Επιπλέον, το Arch User Repository περιέχει πολλές χιλιάδες ακόμη scripts PKGBUILD που συνεισφέρουν η κοινότητα για τη μεταγλώττιση πακέτων με δυνατότητα εγκατάστασης από τον πηγαίο κώδικα χρησιμοποιώντας την εφαρμογή makepkg. Είναι επίσης δυνατό για τους χρήστες να δημιουργήσουν και να διατηρήσουν τα δικά τους προσαρμοσμένα αποθετήρια με ευκολία.\n\n"
    },
    {
      "title": "Ιστορία",
      "level": 2,
      "content": "Δείτε Arch Linux#History.\n\n"
    }
  ]
}