{
  "title": "Arch Linux (Svenska)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(Svenska)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux är ett oberoende utvecklat, x86-64 general-purpose GNU/Linux-distribution som strävar efter att tillhandahålla de senaste stabila versionerna av de flesta programvaror genom att följa en rullande utgåvemodell. Standardinstallationen är ett minimalt bassystem, konfigurerat av användaren för att bara lägga till det som avsiktligt krävs.\n\n"
    },
    {
      "title": "Enkelhet",
      "level": 3,
      "content": "Arch Linux definierar enkelhet som Utan onödiga tillägg eller modifikationer. Det släpper programvara som släppts av de ursprungliga utvecklarna (uppströms) med minimala distributionsspecifika (nedströms) ändringar: korrigeringar som inte accepteras av uppströms undviks och Archs nedströms-patcher består nästan helt av backportade buggfixar som är föråldrade av projektets nästa utgåva.\n\nPå ett liknande sätt skickar Arch med konfigurationsfilerna som tillhandahålls av uppströms med ändringar begränsade till distributionsspecifika frågor som att justera systemfilvägarna. Det lägger inte till automatiseringsfunktioner som att aktivera en tjänst bara för att paketet installerades. Paket splittras bara när det finns övertygande fördelar, som att spara diskutrymme i särskilt slösaktiga fall. GUI-konfigurationsverktyg tillhandahålls inte officiellt, vilket uppmuntrar användare att utföra de flesta systemkonfigurationer från terminalen och en textredigerare.\n\n"
    },
    {
      "title": "Modernitet",
      "level": 3,
      "content": "Arch Linux strävar efter att upprätthålla de senaste stabila versionerna av sin programvara så länge systemiskt paket-bräckage rimligen kan undvikas. Det är baseras på ett rullande utgåvemodells-system, vilket möjliggör en engångsinstallation med kontinuerliga uppgraderingar.\n\nArch innehåller många av de nyare funktionerna som är tillgängliga för GNU/Linux-användare, inklusive systemd-init-systemet, moderna filsystem, LVM2, programvaru-RAID, udev-stöd och initcpio (med mkinitcpio), samt de senast tillgängliga kärnorna.\n\n"
    },
    {
      "title": "Pragmatism",
      "level": 3,
      "content": "Arch är en pragmatisk distribution snarare än en ideologisk. Principerna här är bara användbara riktlinjer. I slutändan fattas designbeslut från fall till fall genom utvecklarens samförstånd. Bevisbaserad teknisk analys och debatt är viktig, inte politik eller populär åsikt.\n\nDet stora antalet paket och buildskript i de olika Arch Linux-arkiven erbjuder gratis programvara med öppen källkod för dem som föredrar det, samt egna programvarupaket för dem som omfamnar funktionalitet framför ideologi.\n\n"
    },
    {
      "title": "Användarcentralitet",
      "level": 3,
      "content": "Medan många GNU/Linux-distributioner försöker vara mer användarvänliga har Arch Linux alltid varit och kommer alltid att förbli användarcentrerat. Distributionen är avsedd att fylla behoven hos de som bidrar till den, snarare än att försöka tilltala så många användare som möjligt. Det riktar sig till den skickliga GNU/Linux-användaren eller någon med en gör-det-själv-attityd som är villig att läsa dokumentationen och lösa sina egna problem.\n\nAlla användare uppmuntras att delta och bidra till distributionen. Rapportering och hjälp med att åtgärda buggar är mycket uppskattat och patcher som förbättrar paket eller kärnprojekt är mycket uppskattade: Archs utvecklare är volontärer och aktiva bidragsgivare kommer ofta att bli en del av det teamet. Archare kan fritt bidra med paket till Arch User Repository't, förbättra ArchWiki-dokumentation, ge teknisk hjälp till andra eller bara utbyta åsikter i forumen, e-postlistorna, eller IRC-kanalerna. Arch Linux är valet av operativsystem för många människor runt om i världen, och det finns flera internationella gemenskaper som erbjuder hjälp och tillhandahåller dokumentation på många olika språk.\n\n"
    },
    {
      "title": "Mångsidighet",
      "level": 3,
      "content": "Arch Linux är en general-purpose distribution. Vid installationen tillhandahålls endast en kommandoradsmiljö: snarare än att riva ut onödiga och oönskade paket, erbjuds användaren möjligheten att bygga ett anpassat system genom att välja bland tusentals högkvalitativa paket som tillhandahålls i de officiella arkiven för x86-64-arkitekturen.\n\nArch stöds av pacman, en lätt, enkel och snabb pakethanterare som gör det möjligt att uppgradera hela systemet med ett kommando. Arch tillhandahåller också Arch build systemet, ett portliknande system som gör det enkelt att bygga och installera paket från källkod, som också kan synkroniseras med ett kommando. Dessutom innehåller Arch User Repository många tusen fler gemenskaps-bidragna PKGBUILD-skript för att kompilera installerbara paket från källkod med makepkg-applikationen. Det är också möjligt för användare att enkelt bygga och underhålla egna egna arkiv.\n\n"
    },
    {
      "title": "Historia",
      "level": 2,
      "content": "Arch-gemenskapen har vuxit och mognat till att bli en av de mest populära och inflytelserika Linux-distributionerna, vilket också vittnade om den uppmärksamhet och granskning det fått genom åren.\n\nArch-utvecklare förblir obetalda, deltidsvolontärer, och det finns inga möjligheter att tjäna pengar på Arch Linux, så det kommer att förbli gratis i alla avseenden av ordet. De som är nyfikna på att läsa mer detaljer om Archs utvecklingshistoria kan bläddra i Arch-posten i Internet Archive Wayback Machine och Arch Linux's Nyhetsarkiv.\n\n"
    },
    {
      "title": "De tidiga åren",
      "level": 3,
      "content": "Judd Vinet, en kanadensisk programmerare och enstaka gitarrist, började utveckla Arch Linux tidigt 2001. Dess första formella utgåva, Arch Linux 0.1, var den 11 mars 2002. Inspirerad av den eleganta enkelheten hos Slackware, BSD, PLD Linux och CRUX, och ändå besviken över deras brist på pakethantering vid den tiden, byggde Vinet sin egen distribution på liknande principer som dessa distros. Men han skrev också ett pakethanteringsprogram som heter pacman, för att automatiskt hantera paketinstallation, borttagning och uppgraderingar.\n\n"
    },
    {
      "title": "Mellanåren",
      "level": 3,
      "content": "Den tidiga Arch-gemenskapen växte stadigt, vilket framgår i detta diagram över foruminlägg, användare och felrapporter. Dessutom var det redan från början känt som en öppen, vänlig och hjälpsam gemenskap.\n\n"
    },
    {
      "title": "Födelse av ArchWiki",
      "level": 3,
      "content": "Den 2005-07-08 startades ArchWiki först på MediaWiki-motorn.\n\n"
    },
    {
      "title": "Gryningen av A. Griffin-åldern",
      "level": 3,
      "content": "I slutet av 2007 pensionerade Judd Vinet sig från aktivt deltagande som en Arch-utvecklare och förde smidigt över tyglarna till den amerikanska programmeraren Aaron Griffin, även känd som Phrakture.\n\n"
    },
    {
      "title": "Arch Install Scripts",
      "level": 3,
      "content": "2012-07-15-utgåvan av installationsbilden avskrev det menystyrda Arch Installation Framework (AIF) till förmån för Arch Install Scripts (arch-install-scripts).\n\n"
    },
    {
      "title": "Systemd-eran",
      "level": 3,
      "content": "Mellan 2012 och 2013 ersattes det traditionella System V init-systemet med systemd. [1][2][3][4]\n\n"
    },
    {
      "title": "Tapp av i686-stöd",
      "level": 3,
      "content": "2017-01-25 tillkännagavs att stödet för i686-arkitekturen skulle avvecklas på grund av dess minskande popularitet bland utvecklarna och gemenskapen. I slutet av november 2017 togs alla i686-paket bort från speglarna.\n\n"
    },
    {
      "title": "Granskning av projektledarens roll och val",
      "level": 3,
      "content": "I början av 2020 utformade Arch Linux-personalen i ett teamarbete en ny process för att bestämma framtida ledare, dokumenterad i DeveloperWiki:Project Leader.\n\nEftersom Aaron Griffin hade bestämt sig för att lämna sin roll, hölls en omröstning för att välja en ny person att ersätta honom, och den 2020-02-24 publicerades dess resultat, vilket gjorde valet av Levente Polyak officiellt.\n\n"
    }
  ]
}