{
  "title": "Arch Linux (한국어)",
  "url": "https://wiki.archlinux.org/title/Arch_Linux_(%ED%95%9C%EA%B5%AD%EC%96%B4)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "아치 리눅스는 롤링 릴리스 모델을 따라 대부분의 소프트웨어의 안정적인 최신 버전을 제공하기 위해 노력하는 독립적으로 개발된 x86-64 범용 GNU/Linux 배포판입니다. 기본 설치는 사용자가 의도적으로 필요한 것만 추가하도록 구성한 최소한의 기본 시스템입니다.\n\n"
    },
    {
      "title": "단순성",
      "level": 3,
      "content": "아치 리눅스는 단순성을 '불필요한 추가나 수정이 없는 것'으로 정의합니다. 이 배포판은 배포판별(다운스트림) 변경을 최소화하여 원래 개발자(업스트림)가 릴리스한 대로 소프트웨어를 배포합니다: 업스트림에서 승인되지 않은 패치는 피하고, 아치의 다운스트림 패치는 거의 전적으로 프로젝트의 다음 릴리스에서 폐기되는 백포트된 버그 수정으로 구성됩니다.\n\n비슷한 방식으로 아치는 업스트림에서 제공하는 구성 파일을 시스템 파일 경로 조정과 같은 배포별 문제로 제한된 변경 사항과 함께 제공합니다. 단순히 패키지가 설치되었다는 이유로 서비스 활성화와 같은 자동화 기능을 추가하지 않습니다. 패키지는 특히 낭비가 심한 디스크 공간을 절약하는 등 강력한 이점이 있는 경우에만 분할됩니다. GUI 구성 유틸리티는 공식적으로 제공되지 않으므로 사용자는 대부분의 시스템 구성을 셸과 텍스트 편집기에서 수행하도록 권장합니다.\n\n"
    },
    {
      "title": "최신성",
      "level": 3,
      "content": "아치 리눅스는 시스템 패키지 파손을 합리적으로 피할 수 있는 한 소프트웨어의 최신 안정 릴리스 버전을 유지하기 위해 노력합니다. 이는 롤링 릴리스 시스템을 기반으로 하며, 한 번 설치하면 지속적으로 업그레이드할 수 있습니다.\n\nArch는 최신 커널뿐만 아니라 systemd 초기화 시스템, 최신 파일 시스템, LVM2, 소프트웨어 RAID, udev 지원 및 initcpio(mkinitcpio 포함) 등 GNU/Linux 사용자에게 제공되는 많은 새로운 기능을 통합하고 있습니다.\n\n"
    },
    {
      "title": "실용주의",
      "level": 3,
      "content": "아치는 이념적 분포라기보다는 실용적 분포입니다. 여기서의 원칙은 유용한 가이드라인일 뿐입니다. 궁극적으로 디자인 결정은 개발자의 합의를 통해 사례별로 이루어집니다. 중요한 것은 정치나 대중의 의견이 아니라 증거에 기반한 기술적 분석과 토론입니다.\n\n다양한 아치 리눅스 리포지토리에 있는 수많은 패키지와 빌드 스크립트는 이를 선호하는 사람들을 위한 무료 오픈 소스 소프트웨어와 이념보다 기능을 중시하는 사람들을 위한 독점 소프트웨어 패키지를 제공합니다.\n\n"
    },
    {
      "title": "사용자 중심성",
      "level": 3,
      "content": "많은 GNU/리눅스 배포판이 보다 '사용자 친화적'이 되려고 노력하는 반면, 아치 리눅스는 항상 '사용자 중심'이었고 앞으로도 그럴 것입니다. 이 배포판은 가능한 한 많은 사용자에게 어필하려고 하기보다는 배포판에 기여하는 사람들의 요구를 충족시키기 위한 것입니다. 이 배포판은 능숙한 GNU/Linux 사용자 또는 문서를 읽고 스스로 문제를 해결하려는 태도를 가진 사람을 대상으로 합니다.\n\n모든 사용자는 참여하기를 통해 배포에 기여하는 것이 좋습니다. 버그를 신고하고 수정하는 것은 매우 중요하며, 패키지나 핵심 프로젝트를 개선하는 패치는 큰 도움이 됩니다: 아치의 개발자는 자원 봉사자이며, 적극적인 기여자는 종종 그 팀의 일원이 될 수 있습니다. 아처는 아치 유저 저장소에 패키지를 자유롭게 기여하고, 아치위키 문서를 개선하고, 다른 사람에게 기술 지원을 제공하거나 포럼, 메일링 리스트 또는 IRC 채널에서 의견을 교환할 수 있습니다. 아치 리눅스는 전 세계 많은 사람들이 선택하는 운영체제이며, 여러 국제 커뮤니티가 존재하여 다양한 언어로 도움을 제공하고 문서를 제공합니다.\n\n"
    },
    {
      "title": "역사",
      "level": 2,
      "content": "아치 커뮤니티는 성장하고 성숙하여 가장 인기 있고 영향력 있는 리눅스 배포판 중 하나가 되었으며, 이는 수년 동안 받은 주의 및 리뷰에서도 증명됩니다.\n\n아치 개발자는 무보수 파트타임 자원 봉사자로 남아 있으며, 아치 리눅스를 수익화할 계획이 없기 때문에 모든 의미에서 무료 배포판으로 유지될 것입니다. Arch의 개발 역사에 대해 더 자세히 알고 싶으신 분은 인터넷 아카이브 웨이백 머신의 Arch 항목과 Arch Linux 뉴스 아카이브를 찾아보실 수 있습니다.\n\n"
    },
    {
      "title": "초기",
      "level": 3,
      "content": "캐나다의 프로그래머이자 가끔 기타리스트로 활동하던 주드 비네트는 2001년 초에 아치 리눅스를 개발하기 시작했습니다. 첫 번째 공식 릴리스인 아치 리눅스 0.1은 2002년 3월 11일에 출시되었습니다. [1] Slackware, BSD, PLD Linux 및 CRUX의 우아한 단순성에 영감을 받았지만 당시 패키지 관리가 부족했던 것에 실망한 비넷은 이러한 배포판과 유사한 원칙에 따라 자신만의 배포판을 만들었습니다. 그러나 그는 패키지 종속성 해결, 설치, 제거, 업그레이드를 자동으로 처리하기 위해 pacman이라는 패키지 관리 프로그램도 만들었습니다.\n\n"
    },
    {
      "title": "중기",
      "level": 3,
      "content": "초기 아치 커뮤니티는 포럼 게시물, 사용자 및 버그 보고 차트에서 알 수 있듯이 꾸준히 성장했습니다. 또한 초기부터 개방적이고 친절하며 도움이 되는 커뮤니티로 알려져 있었습니다.\n\n"
    },
    {
      "title": "아치위키의 탄생",
      "level": 3,
      "content": "2005-07-08에 아치위키가 처음 미디어위키 엔진을 사용하여 설정되었습니다.\n\n"
    },
    {
      "title": "A. 그리핀 시대의 개막",
      "level": 3,
      "content": "2007년 말, 주드 비넷은 아치 개발자로서의 활동에서 은퇴하고 [2] 미국인 프로그래머인 아론 그리핀에게 고삐를 넘겨주었습니다(일명 프락처).\n\n"
    },
    {
      "title": "아치 설치 스크립트",
      "level": 3,
      "content": "2012-07-15 릴리즈의 설치 이미지에서 메뉴 중심의 아치 설치 프레임워크(AIF)가 사용되지 않고 아치 설치 스크립트(arch-install-scripts)를 대신 사용하였습니다.\n\n"
    },
    {
      "title": "systemd 시대",
      "level": 3,
      "content": "2012년부터 2013년 사이에 기존의 System V init 시스템이 systemd로 대체되었습니다.[3][4][5][6]\n\n"
    },
    {
      "title": "i686 지원 중단",
      "level": 3,
      "content": "2017년 1월 25일에 발표에 따르면 개발자와 커뮤니티의 인기가 감소함에 따라 i686 아키텍처에 대한 지원이 단계적으로 중단될 것이라고 합니다. 2017년 11월 말 [7]에 모든 i686 패키지가 미러에서 제거되었습니다.\n\n"
    },
    {
      "title": "프로젝트 리더 역할과 선출에 대한 검토",
      "level": 3,
      "content": "2020년 초, 아치 리눅스 직원들은 DeveloperWiki:Project Leader에 문서화된 미래의 리더를 결정하기 위한 새로운 프로세스를 고안했습니다.\n\n아론 그리핀이 자신의 역할에서 물러나기로 결정함에 따라, 그를 대신할 새로운 인물을 선출하기 위한 투표가 진행되었고, 2020년 2월 24일에 게시된 결과를 통해 레벤테 폴락의 선출이 공식화되었습니다.\n\n"
    },
    {
      "title": "GitLab 시대",
      "level": 3,
      "content": "2023년 5월에 아치 리눅스는 패키징 인프라를 GitLab으로 마이그레이션했습니다. 내부적인 변화와 혁신 외에도 '테스트' 저장소를 '코어 테스트'와 '추가 테스트'로, '스테이징' 저장소를 '코어 스테이징'과 '추가 스테이징'으로 분리하고, 마지막으로 '커뮤니티'를 '추가'로 병합하는 결과를 가져왔습니다. 자세한 내용은 GitLab 블로그에서 확인하세요.\n\n몇 달 후인 2023년 11월에 이전 버그 트래커(Flyspray)가 GitLab으로 마이그레이션되었으며, 협업 기능(이슈 및 병합 요청)이 공개되었습니다. 아카이빙을 위해 이전 버그 트래커의 정적 복사본이 유지되므로 링크(예: 무작위로 선택된 FS#56716)는 계속 유효합니다.\n\n"
    }
  ]
}