{
  "title": "ArchWiki Çeviri Ekibi",
  "url": "https://wiki.archlinux.org/title/ArchWiki_%C3%87eviri_Ekibi",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Bu makalede ArchWiki'de çeviri yaparken işinize yarayabilecek ipuçları, bazı kurallar ve araçlar ele alınmıştır. Ek olarak çeviriler hakkında bilgi alışverişi sağlamak amacıyla kurmuş olduğumuz Telegram grubumuza katılmanızı şiddetle tavsiye ederiz.\n\n"
    },
    {
      "title": "Çeviri yapmak ve çeviri sürdürülebilirliği",
      "level": 2,
      "content": "Tüm kullanıcılar, koruma altında olan bazı sayfalar dışında, istedikleri sayfayı çevirmekte ve değişiklik yapmakta özgürdürler. Ancak çevirmenlerin, genelgeçer bazı yönergeleri ve tavsiyeleri takip etmesi, ilgili sayfaların sürdürülebilirliği açısından fayda sağlayacaktır.\n\nÇevirmenlerin;\n\n1. ArchWiki, Wikimedia motoru üzerine kuruludur, bu sebeple Vikimetin biçimleme diline aşina olması beklenir. Özellikle ilk defa vikimetin yazacak olanların, sayfa çevirmeye başlamadan önce ArchWiki:Sandbox veya kendi kullanıcı sayfalarında pratik yapmaları tavsiye edilir.\n1. Günlük İngilizce kelimeler dışında, çoğu bilişim ve Linux terimlerini mümkün olduğunca tutarlı bir şeklide çevirmesi beklenir. Maalesef çeviri yaparken, Türkçe bilişim terimlerindeki yetersizlik sebebiyle tam karşılığı olmayan kelimeler ile karşılaşabilirsiniz. Böyle durumlarda kelime bilgisinden ziyade teknik bilgi kurtarıcı nitelik taşımaktadır.\n1. Öncelikli olarak Arch Linux kurulumu için en gerekli olan (ör. Kurulum rehberi, Yardım:Okuma) makalelerden başlayarak, sonrasında bu makalelere bağlı olan diğer makaleleri çevirmesi tavsiye edilir. Daha fazlası için #Çevrilebilecek ve çevrilmekte olan makaleler bölümüne bakın.\n\nEğer tüm bu sayılan maddeler konusunda kendinizi yeterli hissediyorsanız yeni bir sayfa oluşturarak çeviriye başlayabilirsiniz.\n\n"
    },
    {
      "title": "Yeni bir sayfa oluşturup çevirisini yapma",
      "level": 3,
      "content": "Aşağıdaki yönergeleri okurken, viki dilinizi Türkçe olarak ayarladığınız varsayılır. Viki dilini değiştirmek için sağ üstteki kullanıcı menüsünden Preferences>User profile>Internationalisation>Language bölümüne gidin ve tr - Türkçe seçip Save ile kaydedin.\n\n1. Seçtiğiniz sayfanın üstündeki düzenleme butonuna tıklayın.\n1. Sayfanın en üstünde, varsa diğer dillerin altına Türkçe dillerarası bağlantıyı ekleyin. Örneğin bu sayfa için [[tr:ArchWiki:Translation Team]] kullanılabilirdi.\n1. Makalenin kaynak kodunun tamamını kopyalayın.\n1. Yaptığınız değişikliği ön izleyin ve hatasız olduğundan emin olduğunuzda kaydedin.\n1. Soldaki diller menüsünden Türkçe seçeneğine tıklayarak çevrilecek sayfaya gidin. Bu sayfada makalenin ismi ve yanında (Türkçe) yazacaktır; ArchWiki:Translation Team (Türkçe) gibi.\n1. Sayfa daha oluşturulmadığı için yukarıdaki yatay menüdeki \"Oluştur\" butonuna tıklayın Eğer sayfa bulunuyor ancak çevirinin kötülüğü sebebiyle İngilizce makaleye yönlendirilmişse, revizyon geçmişine bakarak silinmiş olan makalede nelerin eksik olduğuna dair bilgi edinebilir ve halihazırda çevrilmiş bazı parçaları kurtararak zaman kazanabilirsiniz.\n1. Basit bir metin düzenleyicisi ile karşılaşacaksınız. Buraya İngilizce sayfadan kopyaladığınız kaynak kodunu yapıştırın.\n1. Kategori bağlantılarını Türkçe hale getirin. Örneğin [[Category:ArchWiki]] şeklinde bir kategoriyi [[Category:ArchWiki (Türkçe)]] şeklinde değiştirmek gibi.\n1. Makalenin başındaki tr ile başlayan dillerarası bağlantıyı en veya hangi dilden çeviriyor iseniz o dilin dil koduyla değiştirin.\n1. Kopyaladığınız sayfayı çevirip her şeyi kaydedin, ayrıca özet kısmına uygun bir değişiklik özeti girmeniz önerilir. Çevirisinden emin olamadığınız bölümler var ise diğer çevirmenlere sormaktan çekinmeyiniz.\n1. Çevrilen sayfaların en altında, sayfanın dahil olduğu kategorilerin listesi bulunur. Bu kategorilerin yazı rengi kırmızı olmamalıdır, eğer öyleyse ilgili kategoriyi normal bir sayfa oluşturur gibi oluşturabilirsiniz.\n1. Sayfanızı ön izleyin ve her şeyden emin olduğunuzda kaydedin.\n1. Sayfaya Template:TranslationStatus (Türkçe) şablonunu ekleyin. Nasıl kullanıldığına dair bilgi için: Template:TranslationStatus (Türkçe)#Kullanım.\n1. (tercihen) Sayfanın isminin tam anlamıyla çevirisi olan (örneğin bu sayfa için ArchWiki Çeviri Ekibi) bir sayfa oluşturun. İçerisine asıl çevrilmiş sayfaya yönlendirecek şekilde şekilde şunu ekleyin #redirect [[Çevrilmiş sayfanın İngilizce ismi (Türkçe)]] ve kaydedin.\n\n1. Eğer sayfa bulunuyor ancak çevirinin kötülüğü sebebiyle İngilizce makaleye yönlendirilmişse, revizyon geçmişine bakarak silinmiş olan makalede nelerin eksik olduğuna dair bilgi edinebilir ve halihazırda çevrilmiş bazı parçaları kurtararak zaman kazanabilirsiniz.\n\n1. Çevirisinden emin olamadığınız bölümler var ise diğer çevirmenlere sormaktan çekinmeyiniz.\n\n"
    },
    {
      "title": "Çevrilmiş sayfaların devamlılığını sağlama",
      "level": 3,
      "content": "Template:TranslationStatus (Türkçe) şablonunu kullanarak orijinal makalede yapılan değişikliklerin takip edilmesi kolaylaştırılabilir, bu yüzden çevirdiğiniz her makaleye eklemeniz çevirilerin takibi için çok önemlidir.\n\nTercihen çeviri geçmişi olan veya İngilizceye hâkim olan herkesin çeviri yapması ekibimiz tarafından desteklenir. Ancak çevirmekte zorlandığınızda, çeviriden emin olamadığınızda veya başka türlü bir zorlukla karşılaştığınızda yardım almakta veya beklemekte özgürsünüz.\n\n"
    },
    {
      "title": "Eski çeviriler",
      "level": 4,
      "content": "Yetersiz ve eski çeviriler ile karşılaştığınızda öncelikli olarak o sayfaları çevirebilir veya Template:Translateme (Türkçe) ve Template:Bad translation (Türkçe) şablonlarını sayfanın başına ekleyebilirsiniz.\n\nEğer kötü çeviri olarak işaretlenmiş bir sayfa 6-12 ay içerisinde güncellenmemiş ise sayfayı temizleyip İngilizce sayfasına yönlendirebilirsiniz. Tehlikeli bilgiler barındıran sayfaları (sisteme zarar verecek veya güvenlik açığı yaratacak türden bilgiler) ve 5 seneden fazladır etkileşim görülmemiş sayfaları da şablon eklemeden direkt olarak yönlendirebilirsiniz.\n\n"
    },
    {
      "title": "Çevrilebilecek ve çevrilmekte olan makaleler",
      "level": 3,
      "content": "Çevirmenlerin sadece aşağıdaki makaleleri çevirmesi gibi bir zorunluluk bulunmamaktadır. Ancak Arch Linux kurulumu için temel bilgiler barındırmaları sebebiyle öncelik verilmesi çoğunluğun yararına olacaktır.\n\nEğer aşağıdaki makalelerden herhangi birini çeviriyorsanız Telegram grubumuzu haberdar edebilir veya bağımsız hareket etmek istiyorsanız bu makaleyi düzenleyip Notlar kısmına kullanıcı adınızı ve çevirmekte olduğunuza dair bir cümle ekleyebilirsiniz. 60 gün içerisinde hala çevrilmemiş olan makalelerin yanına, makalenin tekrar çevrilebileceğine ve Boşta olduğuna dair bir not eklenecektir ancak çevirmekte olan kişinin ismi kaldırılmayacaktır.\n\nAşağıdaki makaleler Kurulum rehberi'ne bağlı makalelerdir ve bu sebepten aralarından birini seçmeniz tavsiye edilir. Ancak bu makaleler dışında herhangi bir makaleyi de çevirebilir ve aşağıdaki listede belirtebilirsiniz.\n\nTable content:\nMakaleler | Durum | Çeviren\nAdvanced Linux Sound Architecture | Boşta | \nArch boot process | Boşta | \nArchinstall | Çevriliyor | User:Anonim-kun\nBroadcom wireless | Boşta | \nEFI system partition | Boşta | \nExt4 | Boşta | \nFile systems | Boşta | \nFstab | Boşta | \nGRUB | Çevriliyor | User:Wise\nGnuPG | Boşta | \nHiDPI | Boşta | \nInstall Arch Linux on LVM | Boşta | \nKernel | Boşta | \nKernel parameters | Boşta | \nKeyboard shortcuts | Boşta | \nLinux console/Keyboard configuration | Çevriliyor | User:Asolime\nMobile broadband modem | Boşta | \nNetwork configuration | Boşta | \nNetwork configuration/Wireless | Boşta | \nOptical disc drive | Boşta | \nPartitioning | Boşta | \nPreboot Execution Environment | Boşta | \nRAID | Boşta | \nSwap | Çevriliyor | User:Dybdeskarphet\nSystem time | Boşta | \nSystemd-networkd | Boşta | \nSystemd-resolved | Boşta | \nUnified Extensible Firmware Interface | Boşta | \nUnified Extensible Firmware Interface/Secure Boot | Boşta | \nUsers and groups | Boşta | \nZsh | Boşta | \niwd | Boşta | \ndm-crypt | Boşta | \nmkinitcpio | Boşta | \n\n"
    },
    {
      "title": "Çevrilmiş sayfalar",
      "level": 2,
      "content": "Table content:\nMakaleler | Durum | Kontrol eden (veya ilk çeviren) | Notlar\nAdvanced Format (Türkçe) | Tamamı çevrilmiş | User:Tcreeper | \nAlacritty (Türkçe) | Tamamı çevrilmiş | User:Tcreeper | Muhtemelen terk edilmiş\nArch Linux (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nArch compared to other distributions (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nChroot (Türkçe) | Tamamı çevrilmiş | User:Mutoyoru | \nDevice file (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nDiscord (Türkçe) | Tamamı çevrilmiş | User:Anonim-kun | \nDolphin (Türkçe) | Tamamı çevrilmiş | User:Tcreeper | Muhtemelen terk edilmiş\nFrequently asked questions (Türkçe) | Tamamı çevrilmiş | User:Mutoyoru | \nFsck | Tamamı çevrilmiş | User:Talu\nGeneral recommendations (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nHelp:Reading (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nInstall Arch Linux with accessibility options (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nInstallation guide (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nLenovo V15 G2-ALC (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nLinux console (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nMain page (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nMirrors (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nNano (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nNetwork tools (Türkçe) | Tamamı çevrilmiş | User:Mutoyoru | \nOpenRC (Türkçe) | Tamamı çevrilmiş | User:4Chaffenel | \nParted (Türkçe) | Tamamı çevrilmiş | User:Tcreeper | \nReflector (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nSyslinux (Türkçe) | Tamamı çevrilmiş | User:Asolime | \nSystemd-timesyncd (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nUSB flash installation medium (Türkçe) | Tamamı çevrilmiş | User:Dybdeskarphet | \nfdisk (Türkçe) | Tamamı çevrilmiş | User:Asolime | \nVim (Türkçe) | Tamamı çevrilmiş | User:Talu |  | \nLocale (Türkçe) | Tamamı çevrilmiş | User:13mqn | \n\n"
    },
    {
      "title": "Kullanabileceğiniz araçlar",
      "level": 2,
      "content": "- DeepL - İnanılmaz bir çeviri aracı, diğer çeviri araçlarına kıyasla 6 kata kadar daha tutarlı çeviri yapabiliyor. Uzun çevirilerde oldukça zaman kazandırmaktadır.\n- Tureng - Oldukça kapsamlı bir Türkçe-İngilizce çevrim içi sözlük. Bir kelimenin kullanıldığı alana göre hangi anlama gelebileceğini görebilirsiniz. Özellikle kelimelerin Bilgisayar ve Teknik gibi kategorilerindeki anlamları çevirilerinize yardımcı olabilir.\n- TSE Bilişim Sözlüğü - Güncel ve en anlaşılır kullanımları tercih etmeniz önerilse de TSE'nin bu sözlüğünü de kullanabilirsiniz.\n- türkçeyaz - An itibarı ile kullanıma kapalı, Türkçe yazım denetleyici. Çevirdiğiniz makaleleri birçok yönden denetlemenize ve düzenlemenize yardımcı olur. 10.000 karakter sınırı olmasından dolayı uzun makalelerinizi parça parça denetlemeniz gerekebilir.\n- Online Turkish Deasciifier[dead link 2025-04-06 ⓘ] - Türkçe klavyesi olmayan kullanıcıların türkçe yazabilmesi için güzel bir internet sitesi ayrıca tarayıcı eklentileri de mevcut.\n\n"
    }
  ]
}