{
  "title": "Arch compared to other distributions (Українська)",
  "url": "https://wiki.archlinux.org/title/Arch_compared_to_other_distributions_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nНа цій сторінці Arch linux будуть порівнювати з іншими популярними GNU/Linux дистрибутивами, а також Unix-схожих операційних систем. Ця сторінка допоможе користувачам зробити для себе резюме про Arch Linux, та інши дистрибутиви, та зрозуміти, чи потрібен їм Arch Linux. Хоча, ми рекомендуємо вам самім використати хоча б один з тих дистрибутивів, котрі будуть приведені на цій сторінці, та обрати для себе, що краще.\n\n"
    },
    {
      "title": "Source-Base",
      "level": 2,
      "content": "Дистрибутиви котрі приведені в цій частині статті, потербують самостійного налаштування та встановлення. Більшість з них має велику кількість підтримуємих архітектур. Arch Linux підтримує тільки x86.64 архітектуру\n\n"
    },
    {
      "title": "CRUX",
      "level": 3,
      "content": "- CRUX це лігковісний дистрибутив Linux, котрий фокусується на терминології KISS. Дистрибутивом CRUX надихався Judd Vinet, котрий створив Arch Linux.\n- CRUX використовує систему ініцілізації схожу з BSD. В той час як Arch Linux використовує systemd.\n- Arch Linux використовує roling-release вітку оновлень. В той час, поки оновлення CRUX може розроблюватись роками.\n- Обидві системи можуть бути портовані, а також, схожі з *BSD, також обивдва створюють базове середовище, над котрим потім можна будувати інші. Так, це базова консоль.\n- Arch використовує пакетний менеджер pacman, з бінарною системою пакетів, та працює завдяки Arch build system. CRUX використовує суспільку систему викліків prt-get, який у поєднані з власною системою портів, вирішення залежностей хендлів, але побудівля пакетів відбувається з їх вихідного коду.\n- Arch та CRUX підтримують x86.64 архітектуру.\n- Arch має досить масивні репозиторії пакетів, разом із чималеньким Arch User Repository. CRUX забезпечкує багато стиснутих, та злегшених пакетів, офіційною системою портів, на порівняння з пакетами від спільноти.\n\n"
    },
    {
      "title": "LFS",
      "level": 3,
      "content": "- LFS (або Linux From Scratch) це онлайн документація. Документація дає інформацію про те, як вам самим зібрати свій особистий, Linux-дистрибутив, налаштувати усі пакети, та як зібрати це усе в повноційну систему. LFS це мінімальний опис того, як вам зібрати особисту систему, він чипляє тільки найважливіші моменти в цьому процесі.\n- LFS немає своїх онлайн репозиторіїв, усе треба встановлювати через відкритий код та команди make(Звісно LFS дозволяє вам зробити свої репозиторії, але це теж тяжка праця).\n- Arch забезпечує досить великий репозиторій, плюс systemd, дає великий набір інструментів для роботи пакетного менеджера pacman, в базі системи (Оновлювати, перевстановлювати, і тд), котрі сумісні з x86.64 архітектури. Разом із мінімальною базовою системою, суспільство Arch, розробляє велику кількість бінарних пакетів, для установки через pacman та разом з PKGBUILD ситемою будування котра використовує Arch build system. Arch також дозволяє використовувати makepkg для побудування, та налаштування пакетів, для встановлення через pacman.\n- Judd Vinet використовував LFS для побудування Arch, та написав pacman на мові програмування С. Історично Arch та його пакетний менеджер називали \"Linux з приємним пакетним менеджером\" (Досить велика доля правди в ціх словах)\n\n"
    },
    {
      "title": "Gentoo/Funtoo Linux",
      "level": 3,
      "content": "- Arch разом із Gentoo Linux використовують rolling release вітку оновлень, оновлюючи усі пакети до останіх версій, та додають нові.\n- Пакети в Gentoo треба самостійно будувати з початкового коду використовуючи специфічні USE flag. В свою чергу пакетний менеджер pacman дає одразу побудовані бінарніки x86.64 для встановлення. Це робить Arch більш швидким в процесі побудування пакетів, але при цьому Gentoo стає більш гнучким.\n- Arch підтримує тільки x86.64 архітектури, в той час як Gentoo підтримує x86 (i486/i686), x86_64, PPC/PPC64, SPARC, Alpha, ARM, MIPS, HPPA, S/390 та Itanium архітектури.\n- Офіційний пакетний менеджер в Gentoo є більш комплексним та потужним, на відрізниці від Arch, також немає такої кількості параметрів, як Gentoo з його (Use flags, https://wiki.gentoo.org/wiki/Handbook:X86/Working/Portage#Terminology SLOTs і тд), котрі не мають прямий еквівалент Arch Linux. Чатково кажучи що Arch - це двійковий дистрибутив, але має відмінності у Філосовському Дизайні, котрий також грає велику роль, Arch бере багато принципів в архітектурі, та програмному інженерінгу.\n\n"
    },
    {
      "title": "GNU Guix System",
      "level": 3,
      "content": "- GNU Guix System надихався NixOS, так само як і Arch надихався CRUX\n- В обох вони використовую rolling release вітку оновлень тим самим за короткий час ви отримуєте нові версії пакетів, але при цьому в Guix System знаходяться лише пакети з вихідним кодом, в той час як Arch дозволює також бінарні пакети.\n- Arch використовує пакетний менеджер pacman, в той час як Guix System використовує guix, з підтримкою Експерементальних Пакетних Можливостей, що не привітнюють в інших дистрибутивах.\n- Arch підтримує x86.64 архітектура, коли Guix System офіційно підтримує several архітектури.\n- Arch використовує systemd, коли Guix System використовує GNU Shepherd.\n- Guix System ламає основні принципи Unix-подібних систем, наприклад Filesystem Hierarchy Standard. Поки директорії файлів в інших дистрибутивах розділені по категоріям, в Guix System вони знаходяться за шляхом /gnu/store/.\n- Arch підтримує невільні пакети та драйвера, в той час як Guix System може тільки вільні пакети, котрі мають ліцензію від Free Software Foundation - але в Guix можна під'єднати невільні репозиторії\n- Arch пропонує встановлювати систему завдяки пакетам, в той час як Guix системи пропонують конфигураційну систему Scheme яка в свою чергу створює файли конфігурації\n\n"
    },
    {
      "title": "Основні",
      "level": 2,
      "content": "В цьому розділі представлені дистрибутиви з широким діапазоном використання, і на їх базі створюють інші системи.\n\n"
    },
    {
      "title": "Debian",
      "level": 3,
      "content": "- Debian це один з найпопулярнішіх, та стабільних Linux дистрибутивів, в нього велика спільнота, та має stable, testing, та unstable вітки. В нього бульше ніж 148 000 Пакетів. Має меншу кількість бінарних пакетів ніж Arch. Звісно якщо не брати врахунок AUR та його аналоги для Debian.\n- Debian знаходиться в списку \"Вільного Програмного Забезпечення\", але все ж таки має невільні програми та репозиторії. В той час як Arch також має невільні програми, він був викреслений зі списку та названий \"Невільним\" ліцензією GNU.\n- Debian фокусується на стабільності, тому усі пакети перевіряються у вітці testing, а потім додаються до стабільної вітки, а підтримуються вони П'ять років. Arch постійно оновлює свої пакети, і майже ніколи не перевіряє їх на стабільність, а усі проблеми будуть вирішуватися після випуску оновлення.\n- Debian працює на таких архітектурах, як alpha, arm, hppa, i386, x86_64, ia64, m68k, mips, mipsel, powerpc, s390, та sparc, в той час як Arch, тільки x86.64.\n- Arch дає змогу користувачам створювати свої пакети, схожі на порти. Debian в свою чергу не пропонує систему портів, замість цього каже встановлювати зі своїх бінарних репозиторіїв\n- Arch під час встановлення, встановлює тільки мінімальну базову систему, в той час як в Debian є метод apt tasks котрий самойстійно встановить, та сконфігурує усю систему за вас.\n- Arch втсановлює тільки основні бібліотеки для програми та системи, котрі потім можна спокійно видалити, в той час як пакети Debian, тягнуть за собою велику купу непотрібних бібліотек, котрі не можна спокійно видалити.\n- Arch пакує файли та бібліотеки разом із заголовками файлів. В той час як Debian пропонує завантажувати заголовки окремо.\n\n"
    },
    {
      "title": "Fedora",
      "level": 3,
      "content": "- Fedora це дистрибутив котрий розробляє спільнота, та фінансується офіційно компанією \"Red Hat\". Федора зроблена для тестування нових функцій та можливостей тих, чи інших пакетів, котрі потім потрапляють у корпоративну \"Red Hat Enterprise Linux\". Arch не є середою для тестування нових функцій, котрі потім потрапляють в інші дистрибутиви.\n- Fedora за умовчання використовує пакетний менеджер RPM формат DNF пакетного менеджера. Arch використовує менеджер пакетів pacman.\n- Fedora також викреслює усі не вільні програми зі свого офіційного репозиторія, дозволюючи завантажувати тільки вільне програмне забезпечення. Arch дозволяє завантажувати, та встановлювати не вільні програми, що не подобається \"Фонду Вільного Програмного Забезпечення\".\n- Fedora має багато варіацій встановлення системи, починаючи від повного робочого оточення, закінчуючи мінімальною базою Fedora. Також є така річь як \"spins\" котрі дають можливість встановити інші робочі оточення. Arch дає тільки мінімально базову систему, котру треба встановити використвоючі спеціальні утіліти.\n- Fedora оновлюється за спеціальним графіком, і її версії можна встановлювати через FedUp. Arch це rolling-release дистрибутив, тобто версії не мають конкретної дати виходу.\n- Arch має систиму портів, в той час як Fedora, ні.\n- Обидва Arch та Fedora мають найсвіжіщі версії пакетів. Також обидва заохочують користувачів робити внесок у проєкт.\n- Fedora заробила велику репутацію серед суспільства, після внесення SELinux та GCJ (що прибрала потрібність у Oracle JRE), та жорстко профілюється Red Hat, в Fedora розробляють велику кількість доповнень, програм, та навіть ядро Linux.\n- Arch Linux має обширну wiki, котру роблять самі користувачи. Fedora зберігає основну концепцію wiki, даючи інформацію як для звичайних людей, та і для розробників, та тестувальників. Це не мається на увазі що wiki схожа на Arch. Вона має в собі багато невільного, та корпороційного сенса wiki.\n\n"
    }
  ]
}