{
  "title": "ArchWiki Tutorial (Español)",
  "url": "https://wiki.archlinux.org/title/ArchWiki_Tutorial_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-04** \n\nArtículos relacionados\n\n- ArchWiki\n- Ayuda:Trucos\n- Ayuda:Estilo\n- Ayuda:Lectura\n- Ayuda:Plantilla\n- Ayuda:Discusión\n- ArchWiki:Sandbox\n- ArchWiki:Bots\n\nArchWiki está basado en MediaWiki, un paquete de software wiki libre escrito en PHP, originariamente para su uso en Wikipedia. Se puede encontrar información más detallada en mw:Help:Contents/es Help:Contents de MediaWiki y en Ayuda:Contenidos de Wikipedia.\n\nEste es un breve tutorial sobre cómo editar en ArchWiki. Antes de editar o crear páginas, se recomienda a los usuarios familiarizarse con el tono general, el diseño y el estilo de los artículos existentes. Se debe hacer un esfuerzo para mantener un nivel de coherencia en toda la wiki. Véase ArchWiki:Contributing (Español), Ayuda:Estilo y Ayuda:Lectura para obtener una descripción general de las convenciones comunes. Para experimentar con la edición, utilice sandbox. Para obtener una descripción general del marcado de wiki, consulte Ayuda:Trucos.\n\n"
    },
    {
      "title": "Crear una cuenta",
      "level": 2,
      "content": "Debe crear una cuenta de ArchWiki antes de poder editar artículos de ArchWiki; para responder a la pregunta de captcha requiere un entorno actualizado de Arch Linux: los usuarios que no utilicen Arch son bienvenidos a contribuir con la wiki, y para responder a sus preguntas, puede, por ejemplo, iniciarse en un sistema Arch live con la última imagen de instalación, utilice pacman-staticAUR (los binarios precompilados están disponibles) o simplemente use una imagen de contenedor utilizando herramientas como Docker.\n\nUna vez que tenga una cuenta, inicie sesión desde Special:UserLogin.\n\n"
    },
    {
      "title": "Edición",
      "level": 2,
      "content": "Para comenzar a editar una página, haga clic en la pestaña editar en la parte superior de la página. Alternativamente, los usuarios pueden editar una sección específica de un artículo haciendo clic en el enlace editar a la derecha del encabezado de la sección. Se mostrará la página Edición, que consta de los siguientes elementos:\n\n- Barra de herramientas de edición (opcional)\n- Caja de edición\n- Caja de resumen de edición\n- Enlaces Save changes o Save page, Show preview, Show changes, y Cancel\n\nLa caja de edición contendrá el wikitexto (esto es, el código fuente editable del cual el servidor genera la página web) para la revisión actual de la página o sección. Para realizar una edición:\n\n1. Modifique la wikitexto conforme lo que considere necesario (vea #Formato para más detalles).\n1. Explique el motivo de la edición en la caja Resumen (por ejemplo, \"corregir ortografía\" o \"información adicional sobre xyz\" (consulte Help:Edit summary para más detalles). Nota: Todas las ediciones deben ir acompañadas de un breve resumen descriptivo. Véase Las 3 reglas fundamentales para obtener más información.\n1. Utilice el botón Show preview para facilitar la corrección de pruebas y verificar el formato antes de guardar.\n1. Señale la edición como menor, marcando la casilla This is a minor edit si considera que la edición es superficial o indiscutible.\n1. Guarde los cambios haciendo clic en Save changes. Si no queda satisfecho, haga clic en Cancel, en su lugar (o repita el proceso hasta que esté satisfecho).\n\nNote: **no** \n\n"
    },
    {
      "title": "Revertir ediciones",
      "level": 3,
      "content": "Si una página ha sido editada incorrectamente, los procedimientos siguientes describen cómo revertir un artículo a una versión anterior. Para revertir a la edición inmediatamente anterior:\n\n1. Haga clic en la pestaña View history en la parte superior de la página para modificar (al lado de la pestaña Edit). Se listará un historial de revisiones en la pantalla.\n1. Haga clic en el enlace undo a la derecha de la edición. Una vista previa de la edición muestra la versión actual en la izquierda y el texto que se guardó en la derecha.\n1. Escriba la razón por la que está deshaciendo esta edición en la caja de resumen de edición.\n1. Si está conforme, haga clic en el botón Save changes en la parte inferior de la página, y la versión anterior (la de la derecha) será restablecida.\n\nLa página del wiki debería estar de nuevo en su estado original.\n\nEn ocasiones, puede ser necesario revertir a una edición retrocediendo varias ediciones anteriores a la vez. Para volver un artículo a una versión más antigua:\n\n1. Haga clic en la pestaña View history situada en la parte superior de la página que va a modificar (al lado derecho de la pestaña Edit). Se mostrará una lista de revisiones en pantalla.\n1. Busque la revisión deseada (es decir, la última versión buena) haciendo clic en la marca de fecha apropiada. Dicha versión se mostrará.\n1. Haga clic en la pestaña Edit en la parte superior de la página. Se muestra una advertencia: Warning: You are editing an out-of-date revision of this page. If you save it, any changes made since this revision will be lost.\n1. Escriba la marca de tiempo de la revisión (que se muestra en la parte superior de la página) y una razón por la que está revertiendo el estado de la página en la caja de resumen de edición.\n1. Si está satisfecho, basta con hacer clic en Save changes para restablecer esta versión.\n\nNote: **lost** \n\n- Evite combinar simultáneamente deshacer y editar. Revierta la edición en primer lugar, y, a continuación, realice los cambios adicionales. La vista previa no modifica la revisión.\n- Considere la posibilidad de utilizar un resumen de edición especialmente detallado y verboso al realizar una operación de deshacer para evitar debates prolongados.\n\n"
    },
    {
      "title": "Creación de páginas",
      "level": 2,
      "content": "Antes de crear una nueva página, por favor tenga en cuenta las siguientes consideraciones:\n\n- ¿Es su tema relevante para Arch Linux? Los artículos irrelevantes o poco útiles serán eliminados.\n- ¿Es su tema de interés para los demás? Considere no solo lo que desea escribir, sino también lo que otros pueden querer leer. Las notas personales tienen su sitio en su página de usuario.\n- ¿Es su tema digno de una nueva página? Busque en la wiki artículos similares. Si existen, estudie la posibilidad de mejorarla o añadir una sección en el artículo ya existente.\n- ¿Su contribución será significativa? Evite la creación de notas a menos que planee expandirlas en un futuro.\n\nLa creación de una nueva página requiere la selección de un título descriptivo y una categoría adecuada.\n\nPor favor, lea Directrices para titular artículos y Abreviar nombres de los artículos para obtener asesoramiento sobre los nombres de los artículos. No incluya \"Arch Linux\" o variaciones en los títulos de página. Este es el wiki Arch Linux, se presume que los artículos estarán relacionados con Arch Linux. (Por ejemplo, \"Instalación de Openbox\", no \"Instalación de Openbox en Arch Linux\").\n\nVisite la Tabla de contenidos para ayudarle a elegir la categoría adecuada. Los artículos pueden pertenecer a varias categorías, siempre que una categoría no sea ya la principal de la otra (véase Help:Style (Español)#Categorías).\n\nPara crear una página nueva debemos, como hemos dicho antes, seguir dos pasos: titularla y agregarla a una categoría (por ejemplo \"Mi nueva página\" a \"Alguna categoría\"), del modo siguiente:\n\n1. Crearemos una página escribiendo en la barra de navegación del navegador: https://wiki.archlinux.org/title/My_new_page, donde \"Mi nueva página\" es el título elegido para su nueva página (advierta que: primero, el título debe estar en inglés y, segundo, no hay espacios en blanco, los cuales se rellenan con guiones bajos).\n1. Añada [[Category:alguna categoría]] a la parte superior de la página.\n\nEn esta etapa, el nuevo artículo todavía se considera un artículo huérfano. Para completar el trabajo, tómese un poco más de tiempo para enlazar otros artículos con el nuevo: esto mejorará su visibilidad y alentará a más usuarios a contribuir. Los posibles candidatos son artículos sobre software relacionado, páginas de información general más genéricas o incluso listas simples como List of applications (Español).\n\nEn algunos casos, puede tener sentido crear una subpágina, es decir, una página secundaria de otra página: los títulos de las subpáginas están separados del título de la superpágina con símbolos \"/\" (barra oblicua). Esto suele ser útil para preparar borradores en la propia página de usuario, por ejemplo https://wiki.archlinux.org/title/User:Myself/My_new_subpage.\n\n"
    },
    {
      "title": "Formato",
      "level": 2,
      "content": "El formato del texto se logra con lenguaje wiki siempre que sea posible; el uso y conocimiento del lenguaje HTML no es necesario. También están disponibles diversas plantillas (templates) para tareas comunes de formato, véase Help:Template (Español) para obtener información acerca de las mismas. El artículo Help:Cheatsheet (Español) resume las opciones de formato más comunes.\n\n"
    },
    {
      "title": "Títulos y subtítulos",
      "level": 3,
      "content": "Los títulos y subtítulos son una manera fácil de mejorar la estructura de un artículo. Si un tema es susceptible de dividirse en varias partes, se puede organizar un artículo insertando un título para cada sección. Consulte Help:Style (Español)#Títulos de las secciones y Help:Effective use of headers (Español) para información sobre el estilo.\n\nLos encabezados (o títulos) deben partir del segundo nivel, y pueden crearse de la siguiente manera:\n\n```\n== Segundo nivel de encabezado ==\n\n=== Tercer nivel de encabezado ===\n\n==== Cuarto nivel de encabezado ====\n\n===== Quinto nivel de encabezado =====\n\n====== Sexto nivel de encabezado ======\n```\n\nSi un artículo tiene, al menos, cuatro encabezados, se generará automáticamente un índice o tabla de contenidos (TOC). Si no desea que dicha tabla se visualice en el artículo, coloque __NOTOC__ en el artículo al editarlo. Trate de crear algunas entradas en Sandbox y ver el efecto sobre la TOC.\n\n"
    },
    {
      "title": "Saltos de línea",
      "level": 3,
      "content": "Una línea en blanco se utiliza para iniciar un nuevo párrafo, mientras que si, durante la edición, se rompe una línea, sin espacio entre ambas, no producirá ningún efecto en la continuidad de la oración al visualizarla.\n\nEl código HTML proporciona la etiqueta <br> con la que se puede insertar manualmente los saltos de línea, pero se debe evitar. Una ruptura manual puede ser realizada con otros elementos de formato, como las listas.\n\nTable content:\nwikitexto | visualización\nEsta declaración se divide en tres líneas. | Esta declaración se divide en tres líneas.\nEste es el párrafo número uno. Este es el párrafo número dos. | Este es el párrafo número uno. Este es el párrafo número dos.\n* Esta frase <br> se rompe en dos líneas * Esta frase termina la lista | Esta frase se rompe en dos líneas Esta frase termina la lista\n\n```\nEsta declaración\nse divide en\ntres líneas.\n```\n\nEsta declaración se divide en tres líneas.\n\n```\nEste es el párrafo número uno.\n\nEste es el párrafo número dos.\n```\n\nEste es el párrafo número uno.\n\nEste es el párrafo número dos.\n\n```\n* Esta frase  <br>  se rompe en dos líneas\n* Esta frase\ntermina la lista\n```\n\n- Esta frase se rompe en dos líneas\n- Esta frase\n\ntermina la lista\n\nConsulte Help:Style/White space (Español) para obtener información sobre el uso de líneas en blanco.\n\n"
    },
    {
      "title": "Texto en negrita y/o cursiva",
      "level": 3,
      "content": "El texto en cursiva, negrita (o ambas) se consigue agregando alrededor de una palabra o frase dos, tres o cinco apóstrofes ('), respectivamente:\n\nTable content:\nwikitexto | visualización\n''texto en cursiva'' | texto en cursiva\n'''texto en negrita''' | texto en negrita\n'''''texto en cursiva y negrita''''' | texto en cursiva y negrita\n\n''texto en cursiva''\n\ntexto en cursiva\n\n'''texto en negrita'''\n\ntexto en negrita\n\n'''''texto en cursiva y negrita'''''\n\ntexto en cursiva y negrita\n\n"
    },
    {
      "title": "Texto tachado",
      "level": 3,
      "content": "Utilice texto tachado para indicar que el texto ya no se aplica o no tiene relevancia.\n\nTable content:\nwikitexto | visualización\n<s>texto tachado</s> | texto tachado\n\n```\n<s>texto tachado</s>\n```\n\ntexto tachado\n\n"
    },
    {
      "title": "Texto subrayado",
      "level": 4,
      "content": "Utilice texto subrayado para resaltar una o varias palabras de una oración sobre las que haya que reparar o darles un cierto énfasis.\n\nTable content:\nwikitexto | visualización\n<u>texto subrayado</u> | texto subrayado\n\n```\n<u>texto subrayado</u>\n```\n\ntexto subrayado\n\n"
    },
    {
      "title": "Texto centrado",
      "level": 4,
      "content": "El centrado del texto se consigue insertando la palabra o frase en cuestión entre las etiquetas HTML <center>.\n\nTable content:\nwikitexto | visualización\n<center> texto centrado </center> | texto centrado\n\n```\n<center> texto centrado </center>\n```\n\n"
    },
    {
      "title": "Listas",
      "level": 3,
      "content": "Recuerde que la sintaxis wiki no permite elementos de listas multilínea; cada carácter de la nueva línea termina la definición del elemento de la lista. Para iniciar una nueva línea dentro de un elemento de la lista, utilice la etiqueta <br>. Para introducir un bloque de código de varias líneas dentro de un elemento de la lista, utilice Template:bc y termine el contenido utilizando las etiquetas <nowiki>. Véase también Help:Style/White space (Español) y Help:Template (Español).\n\n"
    },
    {
      "title": "Listas con viñetas",
      "level": 4,
      "content": "Las viñetas no aportan ningún orden aparente de elementos.\n\nPara insertar una viñeta, use un asterisco (*). Multiples asteriscos consecutivos * aumentarán la profundidad de sangrado.\n\nTable content:\nwikitexto | visualización\n* Primer elemento * Segundo elemento ** Sublista dentro del segundo elemento * Tercer elemento | Primer elemento Segundo elemento Sublista dentro del segundo elemento Tercer elemento\n\n```\n* Primer elemento\n* Segundo elemento\n** Sublista dentro del segundo elemento\n* Tercer elemento\n```\n\n- Primer elemento\n- Segundo elemento Sublista dentro del segundo elemento\n- Tercer elemento\n\n- Sublista dentro del segundo elemento\n\n"
    },
    {
      "title": "Listas numeradas",
      "level": 4,
      "content": "Las listas numeradas introducen una numeración correlativa y de esa manera ordenan los elementos de una lista. En general, deberían utilizarse para un listado aleatorio de elementos, de modo que el orden en el que aparezcan los elementos no sea el principal objetivo.\n\nPara crear listas numeradas, utilice o bien números o bien el símbolo almohadilla (#). Multiples símbolos # consecutivos aumentarán la profundidad del sangrado y el inicio de una nueva numeración.\n\nTable content:\nwikitexto | visualización\n# Primer elemento # Segundo elemento ## Sub-item dentro del segundo elemento # Tercer elemento | Primer elemento Segundo elemento Sub-item dentro del segundo elemento Tercer elemento\n# Primer elemento # Segundo elemento #* Subnivel dentro del segundo elemento # Tercer elemento | Primer elemento Segundo elemento Subnivel dentro del segundo elemento Tercer elemento\n\n```\n# Primer elemento\n# Segundo elemento\n## Sub-item dentro del segundo elemento\n# Tercer elemento\n```\n\n1. Primer elemento\n1. Segundo elemento Sub-item dentro del segundo elemento\n1. Tercer elemento\n\n1. Sub-item dentro del segundo elemento\n\n```\n# Primer elemento\n# Segundo elemento\n#* Subnivel dentro del segundo elemento\n# Tercer elemento\n```\n\n1. Primer elemento\n1. Segundo elemento Subnivel dentro del segundo elemento\n1. Tercer elemento\n\n- Subnivel dentro del segundo elemento\n\n"
    },
    {
      "title": "Listas de definiciones",
      "level": 4,
      "content": "Las listas de definiciones se crean con un punto y coma inicial (;) y dos puntos (:) después del término a definir.\n\nTable content:\nwikitexto | visualización\nListas de definiciones: ; Teclado: Dispositivo de entrada con botones o teclas ; Ratón: Dispositivo apuntador de entrada bidimensional o ; Teclado : Dispositivo de entrada con botones o teclas ; Ratón : Dispositivo apuntador de entrada bidimensional | Listas de definiciones: Teclado Dispositivo de entrada con botones o teclas Ratón Dispositivo apuntador de entrada bidimensional o Teclado Dispositivo de entrada con botones o teclas Ratón Dispositivo apuntador de entrada bidimensional\nUtilice dos puntos adicionales si la definición tiene múltiples definiciones: ; Término : Primera definición : Segunda definición | Utilice dos puntos adicionales si la definición tiene múltiples definiciones: Término Primera definición Segunda definición\n\n```\nListas de definiciones:\n; Teclado: Dispositivo de entrada con botones o teclas\n; Ratón: Dispositivo apuntador de entrada bidimensional\no\n; Teclado\n: Dispositivo de entrada con botones o teclas\n; Ratón\n: Dispositivo apuntador de entrada bidimensional\n```\n\nListas de definiciones:\n\no\n\n```\nUtilice dos puntos adicionales si la definición tiene múltiples definiciones:\n; Término\n: Primera definición\n: Segunda definición\n```\n\nUtilice dos puntos adicionales si la definición tiene múltiples definiciones:\n\nLas listas de definiciones no deben ser utilizadas simplemente para dar formato al texto, vea W3's ejemplos.\n\n"
    },
    {
      "title": "Texto sangrado",
      "level": 3,
      "content": "Para sangrar un texto, coloque dos puntos (:) al principio de la línea. Con cada dos puntos más, se sangrará aún más el texto. Una nueva línea marcará el final del párrafo con sangría.\n\nTable content:\nwikitexto | visualización\nEste texto no está sangrado en absoluto. : Este está un poco sangrado. :: Este lo está un poco más. | Este texto no está sangrado en absoluto. Este está un poco sangrado. Este lo está un poco más.\n\n```\nEste texto no está sangrado en absoluto.\n: Este está un poco sangrado.\n:: Este lo está un poco más.\n```\n\nEste texto no está sangrado en absoluto.\n\n"
    },
    {
      "title": "Código",
      "level": 3,
      "content": "Para agregar código a la wiki, utilice una de las plantillas de formato del código. Como alternativa, para enmarcar una línea de código, simplemente comience cada línea precedida de un espacio en blanco, por ejemplo:\n\n```\n$ echo Hello World\n```\n\nConsulte Help:Style (Español)#Formato del código.\n\n"
    },
    {
      "title": "Tablas",
      "level": 3,
      "content": "Utilizadas con eficacia las tablas pueden ayudar a organizar y resumir relaciones de datos. Para conocer la sintaxis avanzada del formato de tablas consulte Ayuda:Tablas.\n\nTable content:\nwikitexto | representación\n{| class=\"wikitable\" |+ Tabla de datos ! Distro !! Color |- | Arch || Azul |- | Gentoo || Púrpura |- | Ubuntu || Naranja |} | Tabla de datos Distro Color Arch Azul Gentoo Púrpura Ubuntu Naranja | Distro | Color | Arch | Azul | Gentoo | Púrpura | Ubuntu | Naranja\nDistro | Color\nArch | Azul\nGentoo | Púrpura\nUbuntu | Naranja\n{| class=\"wikitable\" ! Sistema de archivos!! Tamaño !! Usado !! Disponible !! %Usado !! Montado en |- | rootfs || 922G || 463G || 413G || 53% || / |- | /dev || 1.9G || 0 || 1.9G || 0% || /dev |} | Sistema de archivos Tamaño Usado Disponible %Usado Montado en rootfs 922G 463G 413G 53% / /dev 1.9G 0 1.9G 0% /dev | Sistema de archivos | Tamaño | Usado | Disponible | %Usado | Montado en | rootfs | 922G | 463G | 413G | 53% | / | /dev | 1.9G | 0 | 1.9G | 0% | /dev\nSistema de archivos | Tamaño | Usado | Disponible | %Usado | Montado en\nrootfs | 922G | 463G | 413G | 53% | /\n/dev | 1.9G | 0 | 1.9G | 0% | /dev\n\n```\n{| class=\"wikitable\"\n|+ Tabla de datos\n! Distro !! Color\n|-\n| Arch || Azul\n|-\n| Gentoo || Púrpura\n|-\n| Ubuntu || Naranja\n|}\n```\n\nTable content:\nDistro | Color\nArch | Azul\nGentoo | Púrpura\nUbuntu | Naranja\n\n```\n{| class=\"wikitable\"\n! Sistema de archivos!! Tamaño !! Usado !! Disponible !! %Usado !! Montado en\n|-\n| rootfs || 922G || 463G || 413G || 53% || /\n|-\n| /dev || 1.9G || 0 || 1.9G || 0% || /dev\n|}\n```\n\nTable content:\nSistema de archivos | Tamaño | Usado | Disponible | %Usado | Montado en\nrootfs | 922G | 463G | 413G | 53% | /\n/dev | 1.9G | 0 | 1.9G | 0% | /dev\n\n"
    },
    {
      "title": "Enlaces",
      "level": 2,
      "content": "Los enlaces son esenciales para ayudar a los lectores a navegar por el sitio. En general, los editores deben asegurarse de que cada artículo contiene enlaces salientes a otros artículos (evite las páginas sin salida) y haga referencia a enlaces entrantes de otros artículos (la página especial lo que enlaza aquí se puede utilizar para mostrar los enlaces entrantes). Vea también Help:Style/Formatting and punctuation (Español)#Primeras instancias.\n\n"
    },
    {
      "title": "Enlaces internos",
      "level": 3,
      "content": "Se puede hacer extensivamente una referencia cruzada de las páginas wiki usando enlaces internos. Puede agregar vínculos a los títulos existentes, y también a títulos que creemos deberían existir en el futuro.\n\nPara crear un enlace a otra página de la misma wiki, solo hay que poner el título entre dobles corchetes.\n\nPor ejemplo, si se desea hacer un enlace con el artículo pacman (Español), utilice:\n\n```\n[[pacman (Español)]]\n```\n\nSi quiere usar otras palabras distintas de las del título del artículo enlazado, puede agregar un texto alternativo después de la barra vertical (\"|\") separadora.\n\nPor ejemplo:\n\n```\n[[ArchWiki:About (Español)|ArchWiki]] es la fuente principal de documentación de Arch Linux.\n```\n\n...se vería así:\n\nSi desea utilizar el plural del título de un artículo (o añadir cualquier otro sufijo) para el enlace, puede agregar las letras adicionales directamente fuera de los corchetes.\n\nPor ejemplo:\n\n```\nmakepkg se utiliza en combinación con [[PKGBUILD (Español)|PKGBUILD]].\n```\n\n...se vería así:\n\n"
    },
    {
      "title": "Enlaces a las secciones de un documento",
      "level": 4,
      "content": "Para crear un enlace a una sección de un artículo, basta con añadir el símbolo # seguido de la sección a la que se dirige.\n\nPor ejemplo:\n\n```\n[[Help:Editing (Español)#Enlaces a las secciones de un documento]]\n```\n\n...se vería así:\n\n"
    },
    {
      "title": "Truco de la barra vertical",
      "level": 4,
      "content": "En algunos casos, es posible usar el truco de la barra vertical para guardar la escritura de la etiqueta de los enlaces wiki. Los casos más importantes utilizables en ArchWiki son:\n\n1. En títulos de artículos, permite ocultar el sufijo del idioma. Por ejemplo, [[Main page (Česky)|]] se convierte en Main page.\n1. En enlaces a diferentes espacios de nombres o wiki, el truco de la tubería oculta el prefijo. Por ejemplo, [[ArchWiki:About (Español)|]] se convierte en About y [[Wikipedia:Help:Pipe trick|]] en Help:Pipe trick.\n\nCuando se guarda la página, el truco de la tubería generará automáticamente la etiqueta del enlace y cambiará el wikitexto en consecuencia.\n\n"
    },
    {
      "title": "Enlaces interlingüísticos",
      "level": 3,
      "content": "Véase Help:i18n (Español)#Enlaces interlingüísticos\n\n"
    },
    {
      "title": "Enlaces interwikis",
      "level": 3,
      "content": "Los llamados enlaces interwiki pueden ser utilizados para conectar fácilmente los artículos con otras Wikis externas, como por ejemplo Wikipedia. La sintaxis para este tipo de enlaces consiste en el nombre de la wiki seguido de dos puntos y el título del artículo con el que se desea establecer el vínculo, insertándolo todo en dobles corchetes.\n\nSi desea acceder al artículo Wikipedia:Arch Linux se puede utilizar lo siguiente:\n\n```\n[[Wikipedia:Arch Linux]]\n```\n\nO bien, puede crear el mismo enlace con una etiqueta alternativa (con el uso de la barra vertical separadora —|—), como Artículo de Wikipedia sobre Arch Linux:\n\n```\n[[Wikipedia:Arch Linux|Artículo de Wikipedia sobre Arch Linux]]\n```\n\nConsulte: mw:Help:Links#Interwiki links\n\nLa lista de todos los enlaces interwiki disponibles en ArchWiki se puede se pueden ver en Special:Interwiki and a través de la API.\n\nNote: cuyo resultado será: Wikipedia:es:Arch Linux.\n\n```\n[[Wikipedia:es:Arch Linux]]\n```\n\ncuyo resultado será: Wikipedia:es:Arch Linux.\n\n"
    },
    {
      "title": "Enlaces externos",
      "level": 3,
      "content": "Si desea enlazar a un sitio externo, solo tiene que escribir la URL completa de la página con la que desea establecer el vínculo.\n\n```\nhttp://archlinux.org/\n```\n\nA menudo es más útil hacer que el enlace muestre un nombre distinto al de la dirección URL, lo cual se puede conseguir poniento entre corchetes (no dobles corchetes, solo uno en cada extremo), la URL seguida del título alternativo, separando ambos con un espacio en blanco (no con una barra vertical). De modo que si se quiere que el enlace aparezca como Arch Linux, escriba:\n\n```\n[http://archlinux.org/ Arch Linux]\n```\n\nTambién es posible generar una etiqueta autonumerada simplemente encerrando la URL entre corchetes individuales. Esto a menudo se prefiere a frases como \"véase aquí\". Para producir una frase \"véase [2]\", donde el número variará dependiendo del orden del enlace en la página, simplemente escriba:\n\n```\nvéase [https://archlinux.org/]\n```\n\n"
    },
    {
      "title": "Redirecciones",
      "level": 2,
      "content": "Para redirigir automáticamente una página a otra, agregue #REDIRECT e inserte, entre dobles corchetes, el nombre de la página a donde se quiere pasar automáticamente.\n\nPor ejemplo, puede redirigir de \"Penguins\" a \"Penguin\":\n\n```\n#redirect [[Penguin]]\n```\n\nPor lo tanto, cualquiera de las versiones que se escriba en el cuadro de búsqueda automáticamente irá a \"Penguin\".\n\nLos redireccionamientos también permiten hacer un seguimiento del motivo por el que se crean los enlaces, por ejemplo, agruparlos en páginas WhatLinksHere, y actualizar rápidamente los fragmentos del enlace en caso de que se renombren las secciones. Como una desventaja, los redireccionamientos no muestran el último objetivo de enlace en el navegador.\n\nAntes de crear un redireccionamiento, puede realizar una búsqueda para verificar si existen otras compatibles. Por ejemplo, Xorg.\n\nVéase también Help:Style (Español)#Páginas de redirección y Help:Procedures (Español)#Tratamiento de las páginas de discusión después de redirigir una página a otra.\n\n- Los redireccionamientos no deben apuntar a otros sitios.\n- Los redireccionamientos no funcionan para las páginas de categorías.\n- Los redireccionamientos se resuelven internamente por el servidor y no harán que sea más lento abrir un artículo.\n- Redirigir una página existente a otra puede crear dobles redireccionamientos: consulte Help:Procedures (Español)#Corregir redirecciones dobles para corregirlos.\n\n"
    },
    {
      "title": "Las variables Wiki, magic words y las plantillas",
      "level": 2,
      "content": "MediaWiki reconoce ciertas cadenas especiales dentro de un artículo que alteran el comportamiento estándar. Por ejemplo, la adición de la palabra __NOTOC__ en cualquier parte de un artículo evita la generación de una tabla de contenido. Del mismo modo, la palabra __TOC__ puede ser usada para alterar la posición por defecto de la tabla de contenido. Consulte mw:Help:Magic words para más detalles.\n\nLas plantillas (templates) y las variables son fragmentos predefinidos de wikitexto que se pueden insertar en un artículo para ayudar a dar formato al contenido.\n\nLas variables son definidas por el sistema y se pueden utilizar para mostrar información sobre la página actual, la wiki, o una fecha. Por ejemplo, utilice {{SITENAME}} para mostrar el nombre del sitio wiki (que, en este wiki, es: ArchWiki). Para establecer una cabecera de título alternativo para la página actual, existe esta variable wiki: {{DISPLAYTITLE:Título Nuevo}} (Pero está muy restringido: solo se le permite cambiar la primera letra a minúsculas y reemplazar los espacios con guiones bajos: la cadena de título normalizada debe coincidir con el nombre de la página real; de lo contrario, no funcionará; use {{Lowercase title}} para mostrar la primera letra del título en minúsculas).\n\nLas plantillas, por otra parte, son definidas por el usuario. El contenido de cualquier página pueden ser incluido en otra página añadiendo {{Namespace:Nombre de la página}} para un artículo, pero esto rara vez se utilizan con páginas fuera del espacio de nombres de la Plantilla. (Si se omite el espacio de nombres, se asume la Plantilla) Por ejemplo, Template:Note (Español), se puede incluir en un artículo con el wikitexto siguiente:\n\n```\n{{Note (Español)|Esto es una nota.}}\n```\n\n...se vería así:\n\nConsulte Help:Template (Español) para más información y una lista de plantillas disponibles como Template:Tip (Español) o Template:Warning (Español).\n\n"
    }
  ]
}