{
  "title": "Arch Compared to Other Distributions (Suomi)",
  "url": "https://wiki.archlinux.org/title/Arch_Compared_to_Other_Distributions_(Suomi)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nAiheeseen liittyen\n\n- Arch Linux (Suomi)\n- Arch based distributions\n- Pacman (Suomi)/Rosetta (Suomi)\n\nTämä sivu kiteyttää joitakin yhtäläisyyksiä ja eroja Arch Linuxin ja muiden GNU/Linux jakeluiden tai UNIXin kaltaistaisten käyttöjärjestelmien välillä. Huomioi, että paras tapa verrata Archia muihin jakeluihin on asentaa ja kokeilla muita jakeluita itse. Archilla on mahtava käyttäjäyhteisö, joka on aina valmis auttamaan uutta käyttäjää. Alla oleva yhteenveto on tarkoitettu antamaan sinulle tarpeeksi tietoa päättääksesi onko Arch Linux sinulle sopiva.\n\n"
    },
    {
      "title": "Lähdekoodipohjaiset",
      "level": 2,
      "content": "Lähdekoodipohjaiset jakelut ovat erittäin alustariippumattomia antaen hyödyn siitä, että käyttöjärjestelmä on käännetty juuri kyseenomaiselle alustalle. Haittapuolina voidaan mainita koodin kääntämiseen kuluva aika. Archin pohja ja kaikki paketit ovat optimoituja i686 ja x86-64 arkkitehtuureille tarjoten potentiaalisen suorituskykyedun i386/i486/i586 jakeluihin nähden.\n\n"
    },
    {
      "title": "CRUX",
      "level": 3,
      "content": "- K: Perustuuko Arch CRUXiin?\n- V: Ei. Arch on itsenäisesti kehitetty ja se ei perustu mihinkään toiseen GNU/Linux jakeluun.\n\nArch Linuxin perustaja, Judd Vinet, käytti CRUX ennen kuin hän loi Archin. Arch on CRUXin ideoiden inspiroimana rakennettu tyhjästä johon sitten C -ohjelmointikielellä koodattu pacman lisättiin. Molemmat jakavat jotain periaatteita; esimerkiksi molemmat ovat arkkitehtuurioptimoija, minimalistisia, P.S.S.T. Molemmat tulevat ports-kaltaisen systeemillä, käyttävät *BSD-tyylisiä aloitusskriptejä ja (kuten *BSD) molemmat tarjoavat minimaalisen perusympäristön jota käyttäjät voivat laajentaa. Archissa on pacman joka hallitsee binääri-pohjaiset paketit ja toimii saumattomasti ABSin kanssa, Archin ports-kaltainen systeemi. CRUX käyttää järjestelmää nimeltä prt-get, joka sen oman ports-järjestelmän kanssa hoitaa riippuvuuksien hallinnan mutta kääntää kaikki paketit suoraan lähdekoodista. Arch tukee virallisesti x86-64 ja i686 arkkitehtuureja mutta CRUX vain i686.\n\n"
    },
    {
      "title": "Gentoo/Funtoo Linux",
      "level": 3,
      "content": "Koska Arch asennus on binäärinen, on se paljon nopeampi suorittaa, kuin lähdekoodipohjaisen Gentoon asennus. Sekä Gentoo että Arch tarjovat binääri- että lähdekoodipohjaisia paketteja, mutta Gentoon perusasennus on lähdekoodipohjainen kun taas Arch on binääripohjainen. Molemmat käyttävät 'liukuvaa julkaisua' Archin PKGBUILD:it ovat laajalti nähty helpommiksi ja nopeammiksi tehdä kuin Gentoon ebuildit. Gentoo tarjoaa tukea x86, ppc, sparc, alpha, amd64, mips, hppa ja itanium alustoille, kun Arch tarjoaa vain i686 ja x86-64 alustoille (käyttäjäpohjainen i586-sivuprojekti on tekeillä). Ei ole olemassa dokumentoitua todistetta, että Gentoo olisi yhtään nopeampi kuin Arch ja päinvastoin. Archin suunnittelun lähtökohdat ovat enemmän keskittyneitä yksinkertaisuuteen ja minimalistisuuteen kun taas Gentoo keskittyy globaalisti koko koodin käännös jokaisen yksityiskohdan hallintaan. Molemmat jakelut sallivat kattavan kustomoinnin joten Gentoon käyttäjät tuntevat itsensä kotoisaksi käyttäessään Archia.\n\n"
    },
    {
      "title": "Yleiset",
      "level": 2,
      "content": "Nämä jakelut tarjoavat laajalti hyötyjä ja vahvuuksia, ja voidaan tehdä palvelemaan useimpia käyttöjärjestelmätarpeita.\n\n"
    },
    {
      "title": "Debian",
      "level": 3,
      "content": "- Debian on suurin upstream-Linux-jakelu, jolla on suurempi yhteisö ja stable-, testing- ja unstable-haarat, tarjoten yli 148 000 pakettia. Archille saatavilla oleva binääripakettien määrä on kohtuullisempi. AUR lukuun ottaen määrät ovat kuitenkin liki yhtäläiset.\n- Debianilla on kiivaampi asenne vapaata ohjelmistoa kohtaan, mutta sisältää silti ei-vapaata ohjelmistoa ei-vapaissa varastoissaan. Arch on lempeämpi ja löyhempi GNU:n määrittelemän ei-vapaan ohjelmiston käytäntöjen suhteen.\n- Debian keskittyy Stable-haaran tiukkaan testaamiseen, mikä \"jäädytetään\" ja tuetaan jopa viiden vuoden ajan. Arch-paketit ovat uudempia kuin Debian Stablen, ollen verrattampi Debian Testing- ja Unstable-haaroihin, eikä Archilla ole kiinteää julkaisuaikataulua.\n- Debian on saatavilla monille arkkitehtuureille, mm. alpha, arm, hppa, i386, x86_64, ia64, m68k, mips, mipsel, powerpc, s390, and sparc, kun taas Arch on ainoastaan x86_64:lle.\n- Arch tarjoaa tarkoituksenmukaisemman tuen mukautettujen, asennettavien pakettejen kokoamiseen ulkoisista lähteistä, ports-tapaisella paketinkokoamisjärjestelmällä. Debian ei tarjoa ports-järjestelmää, ollen sen sijaan riippuvainen suurista binäärivarastoistaan.\n- Archin asennusjärjestelmä tarjoaa vain minimaalisen pohjan, ollen läpinäkyvä järjestelmän määrityksen aikana, kun taas Debianin tavat, kuten apt-työkalun tehtävät asentaa valmiiksi valittuja pakettiryhmiä tarjoavat automaattisesti määritellyn lähestymistavan kuin myös useita vaihtoehtoisia asennustapoja.\n- Arch yleensä paketoi ohjelmistokirjastot yhteen otsikkotiedostojen kanssa, kun taas Debianin otsikkotiedostot täytyy ladata erikseen.\n- Arch pitää paikkauksen minimissään, välttäen näin ongelmat, joita ylävirta ei kykene selvittämään, kun taas Debian paikkaa pakettinsa vapaammiin suuremmalle yleisölle.\n\n"
    },
    {
      "title": "Fedora",
      "level": 3,
      "content": "- Fedora on yhteisön kehittämä, vaikka onkin Red Hat -yhtiön tukema. Fedoraa kuvataan usein testijulkaisujärjestelmänä. Fedoran paketit ja projektit sulautuvat RHEL:ään ja jotkin lopulta päätyvät muihin jakeluihin. Archilla ei ole kiinteitä julkaisuja eikä se toimi testihaarana muille jakeluille.\n- Fedora-paketit käyttävät RPM-formaattia DNF-paketinhallintaohjelman kanssa. Arch käyttää pacman-ohjelmaa pakettien hallintaan.\n- Fedora kieltäytyy sisällyttämästä ei-vapaata ohjelmistoa virallisiin varastoihinsa johtuen omistautumisestaan vapaalle ohjelmistolle, vaikka kolmannen osapuolen varastot ovat saatavilla kyseisille paketeille. Arch suhtautuu lempeämmin vapaaseen ohjelmistoon, jättäen arviointikyvyn käyttäjälle.\n- Fedora tarjoaa monia asennusvaihtoehtoja, mukaan lukien graafisen asennusohjelman kuin myös minimaalisen vaihtoehdon. Fedoran muunnelmat tarjoavat myös vaihtoehtoisen lajitelman työpöytäympäristöjä joista valita, joissa jokaisessa on kohtuullinen määrä esiasennettuja paketteja. Arch tarjoaa sen sijaan vain muutaman skriptin, joilla voi helpottaa minimaalista perusasennusprosessia.\n- Fedoralla on aikataulutettu julkaisusykli, mutta tukee virallisesti erillisiä versiopäivityksiä FedUp-työkalun avulla. Arch on rullaavan julkaisun järjestelmä.\n- Archissa on ports-järjestelmä, kun taas Fedorassa ei ole.\n- Sekä Arch että Fedora ovat suunnattu kokeneille käyttäjille ja kehittäjille. Molemmat rohkaisevat käyttäjiään osallistumaan projektin kehittämiseen.\n- Fedora on saanut paljon yhteisön arvostusta SELinuxin integroinnista, GCJ-käännetyistä paketeista (poistamaan tarve Oraclen JRE:lle), ja hedelmällisestä ylävirran avustuksesta; Red Hat ja näin ollen Fedoran kehittäjät lisänä muodostavat suuremman osan Linux-kernelin koodin kehitystyöstä kuin mikään muu projekti.\n- Arch Linux tarjoaa sen, mikä on laajalti katsottu olevan kaikkein kokonaisvaltaisin jakelun wiki. Fedora-wikiä käytetään sanan \"wiki\" alkuperäisessä merkityksessään, tai tavassa vaihtaa nopeasti tietoa kehittäjien, testaajien ja käyttäjien kesken. Sitä ei ole tarkoitettu Arch Wikin kaltaiseksi loppukäyttäjän tietopankiksi. Fedoran wiki muistuttaa vianseurantatyökalua tai yrityksen wikiä.\n\n"
    },
    {
      "title": "Slackware",
      "level": 3,
      "content": "Slackware ja Arch ovat melko samanlaisia siinä että molemmat ovat yksinkertaisia jakeluita jotka keskittyvät eleganttiin ja minimalistisuuteen. Slackware on kuuluisa muokkaamattomista paketeistaan aina ytimestä saakka. Arch tyypillisesti paikkaa paketteja hieman (vähenevässä määrin ajan kuluessa). Molemmat käyttävät BSD-tyylisiä käynnistysskriptejä. Arch tarjoo paketin hallintaan pacmanin joka toisin kuin Slackwaren perustyökalut, tarjoaa automaattisen riippuvuuksien hallinnan ja sallii helpot järjestelmän päivitykset. Slackwaren käyttäjät tyypillisesti suosivat manuaalista riippuvuuksien ratkomista vannoen sen tuoman järjestelmän hallinnan puoleen. Arch on liukuvaa julkaisua käyttäjä järjestelmä. Slackware on maltillisempi julkasuidensa suhteen suosien vakaiksi todettuja paketteja. Arch on 'tuoreempi' näin ollen. Arch tukee i686 ja x86_64 kun taas Slackware on tehty pyörimään i486 järjestelmissä. Molemmissa on saatavilla ports-kaltainen järjestelmä normaalien paketinhallinta ohjelmien lisäksi, - (epävirallinen) Slackbuild järjestelmä on erittäin samanlainen Arch Build System:in (ABS) vaikka jälkimmäinen onkin automaattisempi. Arch on erittäin hyvä järjestelmä Slackwaren käyttäjille jotka tahtovat automaattisen riippuvuuksien ratkonnan ja uudempia paketteja.\n\n"
    },
    {
      "title": "Ubuntu",
      "level": 3,
      "content": "Ubuntu on erittäin suosittu Debian-pohjainen jakelu joka on Canonical Ltd. sponsoroima, kun taas Arch on itsenäisesti kehitetty järjestelmä joka on rakennettu alusta asti itse. Archilla on yksinkertaisempi perusta kuin Ubuntulla. Jos haluat kääntää oman ytimesi, kokeilet kehityksen kärjessä olevia CVS:n kautta jaettavia projekteja tai käännät ohjelmia lähdekoodista niin Arch on paremmin suunnattu sinulle. Jos halut järjestelmän joka toimii suoraan ilman mitään ylimääräistä säätämistä Ubuntu on parempi vaihtoehto sinulle. Arch on minimalistisempi jo asennuksesta lähtien luottaen käyttäjän taitoihin kustomoida järjestelmä heidän tarpeihinsa sopivaksi. Yleisesti, kehittäjät ja säätäjät tuntevat itsensä kotoisammaksi Archin äärellä kuin Ubuntun. Monet entiset Ubuntun käyttäjät ovat siirtyneet käyttämään Archia.\n\n"
    },
    {
      "title": "openSUSE",
      "level": 3,
      "content": "openSUSE keskittyy RPM-pakettiformaatin ja sen arvostetun YaST2:n, graafisen asetustyökalun ympärille. Arch ei tarjoa samanlaisia puitteita. openSUSE voi näin ollen olla soveliaampi käyttäjille, jotka haluavat enemmän graafiseen käyttöliittymään pohjautuvan ympäristön, automaattisen määrityksen tai valmista toimivuutta heti asennuksen jälkeen, mutta silti mahdollistaen räätälöitävyyttä.\n\n"
    },
    {
      "title": "Mandriva/Mageia",
      "level": 3,
      "content": "Mandriva Linux (entinen Mandrake Linux) luotiin 1998 tavoitteena luoda GNU/Linux jota kaikkien on helppo käyttää. Se on RPM-pohjainen ja käyttää urpmi paketin hallintaa. Taas, Archilla on yksinkertaisempi lähtökohta, luottaen manuaaliseen konfigurointiin ja on suunnattu osaavammille käyttäjille.\n\n"
    },
    {
      "title": "BSDt",
      "level": 2,
      "content": "Archilla on ehkä enemmän yhtäläisyyksiä eri BSD:n kanssa suunnittelu näkökannan puolesta kuin muilla GNU/Linux jakeluilla. BSDt juontavat juurensa Berkeley UNIXsta. Siksi *BSDn eivät ole GNU/Linux jakeluita vaan UNIX-kaltaisia käyttöjärjestelmiä.\n\n"
    },
    {
      "title": "Katso myös",
      "level": 2,
      "content": "- DistroWatch - Uutisia ja arvosteluita Linux-jakeluista\n- The Live CD List - Luettelo Live-käyttöjärjestelmäkuvista\n\n"
    }
  ]
}