{
  "title": "Article Naming Guidelines (Español)",
  "url": "https://wiki.archlinux.org/title/Article_Naming_Guidelines_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-10-30** \n\nArtículos relacionados\n\n- Ayuda:Uso efectivo de encabezados\n- Ayuda:Escribir introducciones de artículos\n- Ayuda:Edición\n- Ayuda:Estilo\n- Ayuda:i18n\n\nTitular un artículo es una de las tareas más importantes para los escritores y editores de la wiki. Este artículo es una guía sobre cómo elegir nombres apropiados para el artículo y también presentar a los escritores y editores de ArchWiki algunas cuestiones a tener en cuenta al nombrar sus artículos.\n\n"
    },
    {
      "title": "Acerca de los nombres de los artículos",
      "level": 2,
      "content": "Los nombres de los artículos tienen dos finalidades. Ellos son los identificadores del contenido wiki en el sitio ArchWiki. Además, son los medios por los que los lectores identifican el contenido. Por lo tanto, el nombre de un artículo tiene que ser único y descriptivo.\n\nA veces, los nombres de los artículos reflejan el tipo de contenido del artículo y también ofrecen información adicional como el idioma en que fue escrito el artículo.\n\n"
    },
    {
      "title": "Títulos descriptivos",
      "level": 2,
      "content": "Los títulos deben ser lo más específico posible y deben reflejar el alcance del artículo.\n\nLos proyectos de documentación rara vez son como las opiniones comúnmente vistas sobre software/hardware en los diarios y sitios de noticias. La documentación normalmente se lee cuando surge algún problema o se ha de cumplir alguna otra necesidad específica. Por lo tanto, la rápida identificación de las necesidades y la pronta solución es de suma importancia. Para mejorar la legibilidad y un acceso más rápido a la información, los nombres de artículos (y, por lo tanto, sus títulos) debe ser lo más descriptivos y específicos como lo permita el ámbito del artículo.\n\n"
    },
    {
      "title": "Ejemplo",
      "level": 3,
      "content": "Títulos como Aumentar Pacman pueden ser engañosos para la mayoría de los lectores. Algunos de los lectores pueden estar tratando de aumentar algunos aspecto de pacman y ese aspecto puede no ser necesariamente el tema descrito en el artículo. Por lo tanto, el nombre del artículo debe ser lo más específico posible, sin ser demasiado largo para poder encontrarlo rápidamente. Este artículo puede ser renombrado para leer Cómo mejorar la velocidad de descarga de pacman utilizando wget, snarf y lftp.\n\n"
    },
    {
      "title": "Tener en cuenta la mejora del artículo",
      "level": 2,
      "content": "Los nombres deben ser lo suficientemente generales como para permitir la futura mejora de los contenidos del artículo.\n\nCon el fin de dejar espacio para futuras modificaciones y mejoras, el nombre de un artículo, a veces, necesita ser menos específico. Por supuesto, hacer identificaciones del artículo menos específico por el simple hecho de acortar, no es una buena idea. Por otro lado, si usted cree que ha cubierto todas las áreas y que no mejorarán el alcance del artículo futuras ediciones, haga el nombre de su artículo lo más específico posible.\n\n"
    },
    {
      "title": "Ejemplo",
      "level": 3,
      "content": "Volvamos al ejemplo anterior. El nuevo título del artículo es «Cómo mejorar la velocidad de descarga de pacman utilizando wget, snarf y lftp». Sin embargo, algún día, pueden surgir nuevos gestores de descarga que sustituyan o se conviertan en una alternativa a wget, snarf y/o lftp. Esto exige un título más genérico, algo así como: «Cómo mejorar la velocidad de descarga de pacman utilizando gestores de descarga alternativos».\n\n"
    },
    {
      "title": "Acortar nombres de los artículos",
      "level": 2,
      "content": "Los títulos deben ser tan cortos como sea posible.\n\nHacer títulos cortos para los artículos es importante con el fin de permitir la exploración rápida de los listados de artículos. Muchas personas usan esa técnica de navegación al leer wikis, por lo que no quieren perder su tiempo escribiendo nombres de artículos de extensión kilométrica. Además, los títulos más cortos tienden a sonar más profesional.\n\nPara este artículo, vamos a utilizar este título como ejemplo: «Cómo mejorar la velocidad de descargas de pacman utilizando gestores de descarga alternativos».\n\nVamos a desarrollar algunas técnicas que nos ayudarán a acortar el título. Probablemente hay muchas más técnicas de las que se aplican a este ejemplo en particular, pero aún así conseguiremos una aproximación al concepto de edición de títulos.\n\n"
    },
    {
      "title": "Evitar el uso de fórmulas interrogativas",
      "level": 3,
      "content": "En lugar de escribir: «Cómo mejorar», simplemente ponga «Mejorar».\n\nAhora comparemos las dos:\n\n- «Cómo mejorar la velocidad de descargas de pacman» utilizando gestores de descarga alternativos.\n- «Mejorar la velocidad de descargas de pacman» utilizando gestores de descarga alternativos.\n\n"
    },
    {
      "title": "Reformular partes largas",
      "level": 3,
      "content": "El texto «Mejorar la velocidad de descargas de pacman» es bastante largo. En su lugar, vamos a decir Acelerar las descargas de pacman\n\nAhora comparemos:\n\n- «Mejorar la velocidad de descargas de pacman» utilizando gestores de descarga alternativos\n- «Acelerar las descargas de pacman» utilizando gestores de descarga alternativos.\n\n"
    },
    {
      "title": "Evitar palabras rebuscadas",
      "level": 3,
      "content": "Las palabras rebuscadas (como «alternativa» en nuestro ejemplo) no son solo elitistas, sino que se utilizan con menos frecuencia que las palabras ordinarias y lo son por que tienden a ser más largas. Es sabido que las palabras que se utilizan regularmente, en la mayoría de los casos, son más cortas, por lo que tiene que tratar de encontrar una palabra más común para alternativa.\n\nEn vez de decir«'alternativa», se puede decir otros.\n\nCompare las dos versiones:\n\n- «Acelerar las descargas de pacman utilizando gestores de descargas alternativos».\n- «Acelerar las descargas de pacman utilizando otros gestores de descargas».\n\n"
    },
    {
      "title": "Evitar expresiones técnicas formales",
      "level": 3,
      "content": "Esto puede estar mal visto por algunos de los usuarios más técnicamente orientados, pero a la mayoría de la gente no le importa en absoluto. Evite términos técnicos si esto proporciona nombres de artículos más cortos.\n\nEn vez de decir «gestores de descargas», se puede decir «downloaders».\n\nCompare:\n\n- «Acelerar las descargas de pacman utilizando otros gestores de descargas»\n- «Acelerar las descargas de pacman utilizando otros downloaders»\n\n"
    },
    {
      "title": "Revisar el resultado",
      "level": 3,
      "content": "No se emocione demasiado todavía. Aún tenemos que revisar los dos títulos y ver si transmiten el mismo significado.\n\n- «Cómo mejorar la velocidad de descarga de pacman utilizando gestores de descarga alternativos»\n- «Acelerar las descargas de pacman mediante otros downloaders»\n\nVemos que el resultado final es un nombre de artículo mucho más corto, pero ¿qué pasa con su significado?. En principio, ciertamente parece que hemos hecho un buen trabajo. Pero ahora tenemos un problema diferente. pacman no es un programa de descarga, sin embargo, tanto la expresión «los gestores de descarga alternativos» como «otros downloaders» implícitamente están dando a entender que pacman es un programa de descarga, y eso no es lo que queremos. Tenemos que cambiar el significado diciendo «downloaders externos».\n\nCompare:\n\n- «Cómo mejorar la velocidad de descarga de pacman utilizando gestores de descarga alternativos»\n- «Acelerar las descargas de pacman mediante otros downloaders»\n- «Acelerar las descargas de pacman mediante otros downloaders externos»\n\n"
    },
    {
      "title": "Artículos multilengua",
      "level": 2,
      "content": "Los títulos que no estén en inglés están obligados a tener un identificador del idioma.\n\nPara facilitar la administración y los enlaces interlingüísticos, los artículos cuyo contenido no esté en inglés deben utilizar títulos con el formato «Título en inglés (Idioma)» donde «Idioma» es el nombre nativo de dicho idioma. La redirección con un título traducido puede y debe ser añadida para mayor conveniencia. Véase la sección sobre internacionalización para más detalles.\n\n"
    },
    {
      "title": "Ejemplo",
      "level": 3,
      "content": "Por ejemplo, si se tiene un artículo llamado pacman, en la traducción al español quedaría pacman (Español), la traducción al coreano pacman (한국어) y la traducción Serbia pacman (Српски).\n\n"
    }
  ]
}