{
  "title": "Article Naming Guidelines (Русский)",
  "url": "https://wiki.archlinux.org/title/Article_Naming_Guidelines_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Help:Effective use of headers\n- Help:Writing article introductions\n- Help:Редактирование\n- Help:Стиль\n- Help:i18n (Русский)\n\nВыбор хорошего имени для статьи — одна из наиболее важных задач для авторов статей и редакторов ArchWiki. На этой странице представлено полное руководство по выбору названий для статей, а также упомянуты некоторые сопутствующие проблемы, о которых следует помнить.\n\n"
    },
    {
      "title": "О названиях статей",
      "level": 2,
      "content": "Названия статей служат двум целям.\n\nВо первых, название идентифицирует страницу на wiki-сайте. Во-вторых, по названию читатель определяет, что содержится в статье. Поэтому названия статей должны быть уникальными и достаточно точными, чтобы соответствовать их содержимому.\n\nТакже названия статей могут отражать тип их содержимого, а также содержать дополнительную информацию — например, язык, на котором они написаны.\n\n"
    },
    {
      "title": "Описательное название",
      "level": 2,
      "content": "Названия должны быть как можно более конкретными и точно отражать смысловую суть статьи.\n\nПроекты документации редко похожи на обзоры программного или аппаратного обеспечения, которые можно часто увидеть в газетах и на новостных сайтах. К документации обращаются обычно тогда, когда возникают какие-то проблемы или конкретные потребности. Следовательно, быстрое определение этих нужд и предоставление решения имеют первостепенное значение. Для улучшения читаемости и получения быстрого доступа к информации названия статей (и, следовательно, их заголовки) должны быть настолько описательными и конкретными, насколько позволяет содержимое статьи.\n\n"
    },
    {
      "title": "Пример",
      "level": 3,
      "content": "Заголовки вида \"Ускорение pacman\" могут вводить в заблуждение читателей. Некоторые читатели станут искать, как ускорить какой-либо аспект в pacman, и конкретно этот аспект не обязательно может быть описан в статье. Поэтому названия статей должны быть как можно более конкретными, но при этом не должны быть слишком длинными. Такая статья может быть переименована в \"Как улучшить скорость скачивания в pacman с использованием wget, snarf и lftp\".\n\n"
    },
    {
      "title": "Пространство для расширения статьи",
      "level": 2,
      "content": "Названия должны быть достаточно общими, чтобы предоставить возможность для будущего улучшения содержимого статьи.\n\nС другой стороны, чтобы предоставить свободное пространство для будущего улучшения и расширения статьи, название статьи должно быть не настолько конкретным. Тем не менее, обобщение названия лишь ради уменьшения его длины не является хорошей идеей.\n\nЕсли вы считаете, что фундамент статьи уже полностью сформирован, и будущие правки не смогут изменить ее основную суть, делайте название статьи как можно более конкретным.\n\n"
    },
    {
      "title": "Пример",
      "level": 3,
      "content": "Давайте вернемся к предыдущему примеру. Сейчас название статьи звучит так: \"Как улучшить скорость скачивания в pacman с использованием wget, snarf и lftp\". Однако, в какой-то день могут появиться новые менеджеры загрузки, которые заменят или станут альтернативой для wget, snarf или lftp. Это требует более общего названия, такого, как, например: \"Как улучшить скорость скачивания pacman с использованием альтернативных менеджеров загрузки\".\n\n"
    },
    {
      "title": "Короткое название статьи",
      "level": 2,
      "content": "Названия должны быть как можно более короткими.\n\nИспользование коротких названий статей важно для обеспечения быстрого поиска статьи из списка. Многие люди переходят между статьями по ссылкам, когда читают wiki, так что не стоит обманывать их ожидания, указывая название статьи, которое далеко от ее фактического содержимого. Также более короткое название звучит более профессионально.\n\nЗдесь и далее мы будем использовать следующее название в качестве примера: \"Как улучшить скорость скачивания pacman с использованием альтернативных менеджеров загрузки\".\n\nМы охватим несколько методов, которые помогут нам укоротить название. Есть множество других методов, которые нельзя применить к этому конкретному примеру, но вы будете понимать принципы улучшения заголовков.\n\n"
    },
    {
      "title": "Избегайте вопросительной формы",
      "level": 3,
      "content": "Вместо \"Как улучшить\" скажите просто: \"Улучшение\".\n\nСравните:\n\n- \"Как улучшить скорость скачивания pacman с использованием альтернативных менеджеров загрузки\"\n- \"Улучшение скорости скачивания pacman с использованием альтернативных менеджеров загрузки\"\n\n"
    },
    {
      "title": "Перефразирование длинных частей",
      "level": 3,
      "content": "Текст \"Улучшение скорости загрузки pacman\" довольно длинный. Вместо этого мы скажем \"Ускорение загрузки pacman\".\n\nТеперь сравните:\n\n- \"Улучшение скорости загрузки pacman с использованием альтернативных менеджеров загрузки\"\n- \"Ускорение загрузки pacman с использованием альтернативных менеджеров загрузки\"\n\n"
    },
    {
      "title": "Избегайте причудливых слов",
      "level": 3,
      "content": "Причудливые слова (такие, как \"альтернативный\" в нашем примере) не просто причудливы; они используются гораздо реже обычных слов, и, таким образом, имеют тенденцию быть длиннее. Хорошо известно, что слова, используемые постоянно, по нескольким причинам короче. Старайтесь заменять такие слова на более простые, если это не вредит смыслу.\n\nВместо \"альтернативный\" вы можете сказать \"другой\".\n\nСравните:\n\n- \"Ускорение скорости загрузки pacman с использованием альтернативных менеджеров загрузки\"\n- \"Ускорение скорости загрузки pacman с использованием других менеджеров загрузки\"\n\n"
    },
    {
      "title": "Уход от формальных технических выражений",
      "level": 3,
      "content": "Это может быть не одобрено некоторыми более технически ориентированными пользователями, но большинство людей не будет против. Избегайте технических терминов, если это позволит сделать ваши названия статей короче.\n\nВместо \"менеджеры загрузки\" вы можете сказать \"загрузчики\".\n\nСравните:\n\n- \"Ускорение скорости загрузки pacman с использованием других менеджеров загрузки\"\n- \"Ускорение скорости загрузки pacman с использованием других загрузчиков\"\n\n"
    },
    {
      "title": "Посмотрим на результат",
      "level": 3,
      "content": "Все еще не слишком хорошо. Нам необходимо посмотреть на оба заголовка и убедиться, что они связаны одним и тем же значением.\n\n- \"Как улучшить скорость скачивания pacman с использованием альтернативных менеджеров загрузки\"\n- \"Ускорение скорости загрузки pacman с использованием других загрузчиков\"\n\nХорошо, мы видим, что конечный результат является более коротким названием для статьи, но что насчет смысла? Да, конечно, кажется, мы проделали хорошую работу, но теперь у нас появилась другая проблема. pacman не является загрузчиком, а выражения \"альтернативные менеджеры загрузки\" и \"другие загрузчики\" подразумевают обратное. Это не то, что нам нужно. Мы можем исправить ситуацию, сказав, например, \"внешние загрузчики\".\n\nСравните:\n\n- \"Как улучшить скорость скачивания pacman с использованием альтернативных менеджеров загрузки\"\n- \"Ускорение загрузки pacman с использованием других загрузчиков\"\n- \"Ускорение загрузки pacman с использованием внешних загрузчиков\"\n\n"
    },
    {
      "title": "Многоязычные статьи",
      "level": 2,
      "content": "Не-английские названия требуются для языковых идентификаторов.\n\nЧтобы способствовать организации статей на сайте и удобству поддержки межъязыковых ссылок, не-английские статьи должны использовать заголовки вида \"Заголовок на Английском (Язык)\", где \"Язык\" — название этого языка на нем самом. Перенаправление с локализованным заголовком может (и должно) быть добавлено для удобства. Более подробно смотрите на странице Help:i18n (Русский).\n\n"
    },
    {
      "title": "Пример",
      "level": 3,
      "content": "Например, если у вас есть статья, названная pacman, вы назовете русский перевод pacman (Русский), а сербский перевод — pacman (Српски).\n\n"
    }
  ]
}