{
  "title": "ASUS Zenbook UM3402YAR",
  "url": "https://wiki.archlinux.org/title/ASUS_Zenbook_UM3402YAR",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nGPU | 1002:15e7 | Yes\nWebcam | 3277:0010 | Yes\nAudio (HDMI) | 1002:1637 | Yes\nAudio (Speakers) | 1022:15e3 | Yes\nBluetooth | 1002:15e7 | Yes\nWireless | 13d3:3568 | Yes\nFingerprint | 11c7a:0587 | No\nTPM | 1002:15e7 | Yes\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install per the Installation guide. The default Arch installer does not support Secure Boot so you will have to disable it before performing the installation. If you want to dual boot with Windows you will need to configure UEFI Shim or similar to allow Secure Boot to be re-enabled and Windows to boot without additional steps to unlock Bitlocker drive encryption.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The ASUS firmware is accessed via F2 at boot. It is a graphical interface that can be navigated by mouse or keyboard. It is graphical and not text based.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Enables Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86MonBrightnessDown\nFn+F5 | Yes | Yes | XF86MonBrightnessUp\nFn+F6 | Yes | Yes | XF86TouchpadToggle\nFn+F7 | No | Yes | Keyboard backlight cycle\nFn+F8 | No | Yes | Monitor select\nFn+F9 | Yes | Yes | XF86AudioMicMute\nFn+F10 | No | Yes | XF86WebCam\nFn+F11 | No | Yes | Screenshot\nFn+F12 | Yes | Yes | XF86Launch1\nFn+Del | Yes | Yes | Insert\nFn+Right_Ctrl | Yes | Yes | Menu\nFn+k | Yes | No | Scroll_Lock\nFn+b | Yes | No | Pause\nFn+Up | Yes | No | Prior\nFn+Down | Yes | No | Next\nFn+Left | Yes | No | Home\nFn+Right | Yes | No | End\n\n1. The key is visible to xev and similar tools\n1. The physical key has a symbol on it, which describes its function\n\n"
    },
    {
      "title": "Numpad 2.0",
      "level": 2,
      "content": "See asus-numpad and follow the instructions. UM3402YAR's Numpad corresponds to M433IA layout.\n\nInstall asus-numpadAUR, configure it then enable/start the asus-numpad.service.\n\n"
    },
    {
      "title": "Fan control",
      "level": 2,
      "content": "The UM3402YA laptop series do not have kernel modules to control fan profiles. EC registers are the way to control the fan level, where it also affects CPU performance and thermal throttling prevention depending on which fan pre-configured profiles the end-user writes to the registry (ASUS AIPT).\n\nEach laptop model might have different registry and hexadecimal values. Therefore, the best way to know the fan registry and the values to the registry which represents the fan profiles, is by installing nbfc on a windows machine and using the monitor tool supplied, in a terminal with administrator permissions:\n\n```\n> ec-probe monitor\n```\n\nWhile monitoring the changes using ec-probe for the fan registry, have MyASUS open and change the fan profile within it until you see a pattern change for a certain registry, in the ec-probe terminal window and the values corresponding to it. Once you found the registry, take notes of the hexadecimal values for each fan profile selected via MyASUS.\n\nTo read a registry's value:\n\n```\n> ec-probe read 0x61\n```\n\nOn a UM3402YAR laptop with the 0x61 registry related to the fan profile, and a 0x00 hexadecimal value for setting the standard profile, the following should be written to the found registry:\n\n```\n> ec-probe write 0x61 0x00\n```\n\nYou can now boot to your Linux operating system, and safely write the hexadecimal values to the registry as desired using the nbfc's EC probing tool.\n\nThe following were the fan profile hexadecimals for the 0x61 registry on a UM3402YAR laptop:\n\nTable content:\nFan Profile | Hexadecimal\nSilent Mode | 0x01\nStandard Mode | 0x00\nPerformance Mode | 0x02\n\n"
    }
  ]
}