{
  "title": "Audacious (Русский)",
  "url": "https://wiki.archlinux.org/title/Audacious_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Audacious — свободный и продвинутый аудиоплеер. Он сосредоточен на качестве звука и поддерживает большое количество форматов аудио. Легко расширяется с помощью сторонних плагинов.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет audacious.\n\n"
    },
    {
      "title": "Плагин AMIDI (проигрыватель MIDI)",
      "level": 4,
      "content": "Для воспроизведения MIDI и RMI файлов необходимо установить пакет fluidsynth и файлы звуковых шрифтов (банков инструментов): freepats-general-midi и soundfont-fluid. Настройка fluidsynth не требуется, но для дополнительной функциональности смотрите инструкции в статье FluidSynth.\n\nПосле этого плагин будет включен, но нужно ещё подключить к нему файлы звуковых шрифтов. Откройте настройки плагина (Файл → Настройки ... → Модули → Ввод → Плагин AMIDI (проигрыватель MIDI) → нажмите иконку с шестерёнкой) и добавьте файлы шрифтов (расширение .sf2). Они располагаются в каталоге /usr/share/soundfonts/.\n\n"
    },
    {
      "title": "Audtool",
      "level": 3,
      "content": "Audacious имеет мощный инструмент управления Audtool, с помощью которого можно получить информацию из плеера или управлять им.\n\nНапример, чтобы получить текущее название песни или исполнителя, введите следующую команду:\n\n```\n$ audtool current-song\n$ audtool current-song-tuple-data artist\n```\n\nЕсть также функции для управления воспроизведением, эквалайзером, списком воспроизведения и главным окном программы. Весь список возможностей смотрите в audtool(1).\n\n"
    },
    {
      "title": "Winamp",
      "level": 3,
      "content": "Чтобы добавить классический скин Winamp в Audacious, просто скопируйте его в каталог ~/.local/share/audacious/Skins/ (только для вашего пользователя) или в /usr/share/audacious/Skins/ (для всех пользователей), после чего выберите «Интерфейс классического Winamp» в настройках внешнего вида и выберите нужный скин в выпадающем списке «Скин» ниже.\n\n"
    },
    {
      "title": "Запускается Audacious вместо файлового менеджера",
      "level": 3,
      "content": "См. File manager functionality (Русский)#Каталоги не открываются в файловом менеджере.\n\n"
    },
    {
      "title": "Проблемы с MP3",
      "level": 3,
      "content": "Установите mpg123.\n\n"
    },
    {
      "title": "Ссылки",
      "level": 2,
      "content": "- Официальный сайт Audacious\n\n"
    }
  ]
}