{
  "title": "Audacious (Français)",
  "url": "https://wiki.archlinux.org/title/Audacious_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Audacious est un lecteur audio basé sur GTK+. Il vise à pourvoir une bonne qualité audio et prends en charge une grande variété de codecs audio tout en restant assez léger. Il est facilement extensible via l'ajout de plugins.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Vous pouvez installer le paquet audacious avec Pacman.\n\n"
    },
    {
      "title": "AMIDI-Plug (MIDI Player)",
      "level": 4,
      "content": "Pour jouer les fichiers MIDI et RMI, il est nécessaire d'installer le paquet fluidsynth,ainsi que les bibliothèques de sons (sound fonts) freepats-general-midi et soundfont-fluid. Aucune configuration particulière n'est requise par fluidsynth package, mais pour des fonctionnalités additionnelles, consultez la page FluidSynth (anglais)\n\nÀ la suite de cela, le plugin sera activé. Et vous pourrez ajouter les bibliothèques de son dans le panneau de configuration configuration (Fichier, Paramètres ..., Panneaux Plugins, Onglet Input, sélectionnez AMIDI-Plug (MIDI Player)) et ajoutez les bibliothèques de son ((Extension .sf2 situées dans /usr/share/soundfonts/) dans la boite de dialogue, une après l'autre.\n\n"
    },
    {
      "title": "Audtool",
      "level": 3,
      "content": "Audacious est fourni avec un puissant outil de management appelé Audtool. Il peut être utilisé pour récupérer des informations ou pour contrôler le lecteur.\n\nPar exemple, pour récupérer les informations à propos du titre ou de l'artiste, utilisez la commande suivante :\n\n```\naudtool current-song\naudtool curretn-song-tuple-data artist\n```\n\nIl existe de nombreuses autres fonctions, pour contrôler le playback, manipuler la playlist ou la fenêtre principale, etc. Pour la liste complète des options voir audtool --help et audtool(1).\n\n"
    },
    {
      "title": "Winamp",
      "level": 3,
      "content": "Audacious propose actuellement deux interfaces:\n\n- Une interface classique Winamp\n- Une interface Qt\n\nIl est possible de basculer de l'une à l'autre de ces interfaces dans Audacious.\n\nAjouter des thèmes Winamp pour Audacious est très simple. Il suffit de copier le fichier de thème (.zip, .tgz., .tar.gz, ou .tar.bz2) soit dans ~/.local/share/audacious/Skins, ce qui n'affectera que l'utilisateur, soit dans /usr/share/audacious/Skins, ce qui affectera tous les utilisateurs, puis de chercher et sélectionner le thème voulu dans Préférences -> Thèmes. Il est également possible de déposer le fichier thème directement au sein de la liste des thèmes disponibles.\n\n"
    },
    {
      "title": "Audacious démarre à la place de mon navigateur de fichiers",
      "level": 3,
      "content": "Voir File manager functionality#Directories are not opened in the file manager.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Audacious official site\n\n"
    }
  ]
}