{
  "title": "Audacious (Español)",
  "url": "https://wiki.archlinux.org/title/Audacious_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-13** \n\nAudacious es un avanzado reproductor de audio gratuito. Se centra en la calidad del audio y soporta una amplia variedad de códecs de audio, además de ser fácilmente ampliable mediante plugins de terceros.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete audacious. Para permitir el soporte de CDs de audio, instale libcdio.\n\n"
    },
    {
      "title": "AMIDI-Plug (Reproductor MIDI)",
      "level": 4,
      "content": "Para reproducir archivos MIDI y RMI, es necesario instalar el paquete fluidsynth, y también instalar los archivos de fuentes de audio, tanto freepats-general-midi como soundfont-fluid. No se requiere ninguna otra configuración en el paquete fluidsynth, pero para conocer funciones adicionales, véase FluidSynth.\n\nPosteriormente, el plugin se habilitará, y en el panel de configuración del plugin (Archivo, Configuración ..., panel de Plugins, pestaña Entrada, seleccione AMIDI-Plug (MIDI Player)) añada los archivos de fuentes de sonido instalados de uno en uno (Extensión .sf2) al cuadro de diálogo SoundFont, que se encuentran en /usr/share/soundfonts/.\n\n"
    },
    {
      "title": "Audtool",
      "level": 3,
      "content": "Audacious incluye una potente herramienta de gestión llamada Audtool que puede utilizarse para conseguir información o para controlar el reproductor.\n\nPor ejemplo, para conocer el título o el artista de la canción actual, ejecute las siguientes órdenes:\n\n```\n$ audtool current-song\n$ audtool current-song-tuple-data artist\n```\n\nTambién existen funciones para controlar la reproducción, manipular la lista de reproducción, el ecualizador y la ventana principal. Ejecute audtool --help para conocer la lista completa de opciones.\n\n"
    },
    {
      "title": "Winamp",
      "level": 3,
      "content": "Para añadir los temas (skins) clásicos de Winamp a Audacious, basta con copiarlos en ~/.local/share/audacious/Skins/ (sólo para el usuario) o /usr/share/audacious/Skins/ (para todo el sistema), y luego seleccionarlos en la pestaña Interfaz con temas en Preferencias. También puede arrastrar el archivo directamente a la lista de temas disponibles.\n\n"
    },
    {
      "title": "Audacious se inicia en vez del gestor de archivos",
      "level": 3,
      "content": "Véase File manager functionality#Directories are not opened in the file manager.\n\n"
    },
    {
      "title": "Problemas con el MP3",
      "level": 3,
      "content": "Instale el paquete mpg123.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página web de Audacious\n\n"
    }
  ]
}