{
  "title": "AUR helpers (Français)",
  "url": "https://wiki.archlinux.org/title/AUR_helpers_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **pas prises en charge** \n\nLes assistants AUR automatisent l'utilisation du Dépôt des utilisateurs d'Arch. En particulier, ils peuvent automatiser les tâches suivantes :\n\n- recherche de paquets publiés sur l'AUR ;\n- résolution des dépendances entre les paquets AUR ;\n- récupération et construction des paquets AUR ;\n- récupération de contenus web, comme les commentaires des utilisateurs ;\n- soumission de paquets AUR.\n\nPacman ne gère que les mises à jour des paquets préconstruits dans ses dépôts. Les paquets AUR sont redistribués sous forme de PKGBUILDs et nécessitent un assistant AUR pour automatiser le processus de reconstruction. Cependant, gardez à l'esprit qu'une reconstruction d'un paquet peut être nécessaire lorsque les dépendances de sa bibliothèque partagée sont mises à jour et pas seulement lorsque le paquet lui-même est mis à jour.\n\n"
    },
    {
      "title": "Légende",
      "level": 2,
      "content": "Les colonnes #Tableaux de comparaison ont la signification suivante :\n\n- Plusieurs paquets à partir de la même base de paquets, sans reconstruire ou réinstaller plusieurs fois, comme clionAUR.\n- Diviser les paquets qui dépendent d'un paquet de la même base de paquets, comme jellyfinAUR[broken link: package not found].\n- Diviser les paquets indépendamment, comme python-pyalsaaudioAUR et python2-pyalsaaudioAUR[broken link: package not found].\n\n- Facultatif signifie qu'une fonctionnalité est disponible, mais uniquement via un argument de ligne de commande ou une option de configuration.\n- Partiel signifie qu'une fonctionnalité n'est pas complètement implémentée, ou qu'elle s'écarte partiellement des critères donnés.\n\n"
    },
    {
      "title": "Recherche et téléchargement",
      "level": 3,
      "content": "Table content:\nNom | Écrit en | Examen des fichiers | Vue différentielle | Clone Git | Analyseur fiable | Solveur fiable | Complétion de shell | Spécificité\nauracle-gitAUR | C++ | Oui | Non | Oui | Oui | Oui | bash | impression de l'ordre de construction\npbgetAUR | Python | Oui | Non | Oui | Oui | – | – | –\nrepoctlAUR | Go | Oui | Non | Non | Oui | – | zsh | dépôt local\nyaahAUR | Bash | Oui | Non | Optionnel | Oui | – | bash | –\n\n"
    },
    {
      "title": "Recherche et construction",
      "level": 3,
      "content": "Table content:\nNom | Écrit en | Examen du fichier | Vue différentielle | Clone Git | Analyseur fiable | Solveur fiable | Diviser les paquets | Complétion de shell | Spécificité\naurutilsAUR | Bash | Oui | Oui | Oui | Oui | Oui | Oui | bash, zsh | dépôt local, application de correctifs locaux, signature de paquet, chroot propre}\nbauerbillAUR | Python | Oui | Non | Oui | Oui | Oui | Oui | bash, zsh | bb-wrapper pour l'habillage de pacman, la gestion de la confiance\nPKGBUILDerAUR | Python | Non | Non | Oui | Oui | Oui | Partiel | – | pb pour l'emballage de pacman\nruaAUR | Rust | Oui | Oui | Oui | Oui | Oui | Oui | bash, zsh, fish | application locale de patch, bubblewrap, inspection .pkg.tar\n\n"
    },
    {
      "title": "Surcouches de Pacman",
      "level": 3,
      "content": "Table content:\nNom | Écrit en | Examen du fichier | Vue différentielle | Clone Git | Analyseur fiable | Solveur fiable | Diviser les paquets | Paramètres non sécurisés | Complétion de shell | Spécificité\nauraAUR | Haskell | Non | Partiel | Oui | Oui | Oui | Oui | – | bash, fish, zsh | –\npacaurAUR | Bash | Oui | Oui | Oui | Oui | Oui | Oui | --ask | bash, zsh | –\npakkuAUR | Nim | Oui | Oui | Oui | Oui | Oui | Oui | -Sy | bash, zsh | –\nparuAUR | Rust | Oui | Oui | Oui | Oui | Oui | Oui | -Sy--ask | bash, fish, zsh | local repository, clean chroot\npikaurAUR | Python | Oui | Oui | Oui | Oui | Oui | Oui | -Sy | bash, fish, zsh | dynamic users\ntrizenAUR | Perl | Oui | Oui | Oui | Oui | Oui | Partiel | – | bash, fish, zsh | –\nyayAUR | Go | Oui | Oui | Oui | Oui | Oui | Oui | -Sy--ask | bash, fish, zsh | –\n\n"
    },
    {
      "title": "Graphique",
      "level": 2,
      "content": "- Argon — Surcouche GTK 3 de pacman écrite en Python.\n\n- Cylon — TUI, surcouche de pacman écrite en Bash.\n\n- Kalu — Systray, icône de notification utilisant libalpm et PolicyKit, avec dispositif de mise à jour optionnel\n\n- Octopi — Surcouche Qt 5 de pacman écrite en C++.\n\n- Pacseek — Une interface utilisateur en terminal pour rechercher et installer des paquets Arch Linux.\n\n- Pamac — Gestionnaire de paquet indépendant en GTK3 utilisant libalpm(3) et écrit en Vala.\n\n- Pakku GUI — Frontend GTK 3 pour pakku écrit en Python.\n\n- PkgBrowser — Navigateur Qt 5 en lecture seule pour les paquets des dépôts et AUR écrit en Python.\n\n- Yup — Surcouche TUI en Curses de pacman écrite en Go.\n\n"
    },
    {
      "title": "Maintenance",
      "level": 2,
      "content": "- aur-out-of-date — Utilise les API de l'hébergeur pour vérifier si les paquets AUR ont été modifiés en amont.\n\n- aurpublish — Script d'aide pour gérer et télécharger des paquets AUR à l'aide de git-subtree(1). Utilise githooks(5) pour vérifier l'intégrité du PKGBUILD, générer automatiquement des .SRCINFO et créer un modèle de message de commit.\n\n- devtools — Construire les paquets dans un environnement propre (conteneur systemd-nspawn) pour garantir leur exactitude. Une surcouche est fournie par aurutilsAUR, clean-chroot-managerAUR et paruAUR.\n\n- pkgbuild-watch — Recherche les changements sur les pages web en amont.\n\n- pkgoutofdate — Parse l'URL source des PKGBUILDs et essaie de trouver les nouvelles versions des paquets en incrémentant le numéro de version et en envoyant des requêtes au serveur web.\n\n"
    },
    {
      "title": "Autres",
      "level": 2,
      "content": "- aur-talk — Recherche et affichage des commentaires AUR.\n\n- aurvote-utils — Un ensemble d'utilitaires pour la gestion des votes AUR.\n\n- haskell-aur — Bibliothèque Haskell pour accéder à l'interface RPC d'Aurweb.\n\n- package-query — Outil d'interrogation de libalpm(3) et de l'AUR.\n\n- python3-aur — Modules et utilitaires auxiliaires de Python 3 permettant d'accéder aux informations sur les paquets AUR et d'automatiser les interactions avec l'AUR.\n\n- raur — Bibliothèque Rust pour accéder à l'interface Aurweb RPC.\n\n"
    }
  ]
}