{
  "title": "AUR (Русский)",
  "url": "https://wiki.archlinux.org/title/AUR_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- makepkg (Русский)\n- pacman (Русский)\n- PKGBUILD (Русский)\n- .SRCINFO (Русский)\n- Aurweb RPC interface\n- AUR submission guidelines (Русский)\n- Package Maintainer guidelines\n- Официальные репозитории\n- Система сборки Arch\n- Создание пакетов\n- Инструменты для работы с AUR\n- AUR Cleanup Day\n\nПользовательский репозиторий Arch (Arch User Repository, AUR) — поддерживаемое сообществом хранилище программ для пользователей Arch. Содержит описания пакетов (файлы PKGBUILD), которые позволяют скомпилировать пакет из исходников утилитой makepkg и затем установить его с помощью pacman. AUR был создан с целью организации совместного доступа к новым пакетам, которые были созданы сообществом, а также чтобы ускорить добавление популярных пакетов в репозиторий extra. В статье описано, как получить доступ к AUR и как с ним работать.\n\nМногие пакеты, в настоящее время находящиеся в официальных репозиториях, когда-то начинали свой путь в AUR. В AUR пользователи могут добавлять собственные сборки пакетов (PKGBUILD и другие необходимые файлы). Сообщество может голосовать за понравившиеся пакеты. Если пакет стал популярным, распространяется под подходящей лицензией и собирается без излишних сложностей, то он может быть перенесён в репозиторий extra (доступный напрямую с помощью pacman или системы сборки Arch).\n\n"
    },
    {
      "title": "Приступая к работе",
      "level": 2,
      "content": "Искать и скачивать файлы PKGBUILD можно через веб-интерфейс AUR. Эти файлы позволяют собрать устанавливаемый пакет утилитой makepkg и установить его в систему с помощью pacman.\n\n- Установите мета-пакет base-devel.\n- Просмотрите раздел #Часто задаваемые вопросы.\n- Перед сборкой пакетов из AUR имеет смысл внести изменения в файл /etc/makepkg.conf, чтобы оптимизировать процесс сборки под вашу систему. На системах с многоядерным процессором можно добиться значительного ускорения сборки с помощью переменной MAKEFLAGS, использованием нескольких ядер при сжатии или выбором нестандартного алгоритма сжатия. Аппаратно-зависимые оптимизации компилятора можно включить переменной CFLAGS. Подробнее см. makepkg#Советы и рекомендации.\n\nЕсли вы настроили аутентификацию в AUR через SSH, то можно использовать его для доступа к AUR: команда ssh aur@aur.archlinux.org help выведет список доступных команд.\n\n"
    },
    {
      "title": "Установка и обновление пакетов",
      "level": 2,
      "content": "Установка пакетов из AUR относительно проста:\n\n1. Скачайте файлы сборки, включая PKGBUILD и, возможно, другие необходимые файлы вроде юнитов systemd и патчей (но, чаще всего, не сам исходный код).\n1. Убедитесь, что PKGBUILD и прочие файлы не являются вредоносными или ненадёжными.\n1. Выполните makepkg в каталоге с сохранёнными файлами. Эта команда загрузит исходный код, скомпилирует его и создаст пакет.\n1. Выполните pacman -U файл_пакета, чтобы установить пакет в систему.\n\n"
    },
    {
      "title": "Подготовка",
      "level": 3,
      "content": "Прежде всего убедитесь, что в системе установлены необходимые инструменты: установите мета-пакет base-devel. В него входят make и некоторые другие инструменты, необходимые для компиляции из исходников.\n\nЗатем выберите подходящий каталог сборки. Каталог сборки — это просто место, в котором пакет будет «собран» из исходников. Им может быть любой каталог в системе. В примерах ниже в качестве каталога сборки используется ~/builds.\n\n"
    },
    {
      "title": "Получение файлов",
      "level": 3,
      "content": "Найдите пакет в AUR. Это можно сделать поиском на главной странице AUR (текстовое поле вверху). После перехода по одной из ссылок из списка результатов откроется страница информации о выбранном пакете. Прочтите описание, убедитесь, что это то, что вы искали; обратите внимание на дату последнего обновления пакета и прочтите комментарии.\n\nСуществует несколько способов получить необходимые файлы пакета:\n\n- Склонировать git-репозиторий, указанный в графе «URL для git clone» в разделе «Информация о пакете». Это предпочтительный метод, поскольку он позволяет получать обновления файлов пакета с помощью git pull:\n\n```\n$ git clone https://aur.archlinux.org/имя_пакета.git\n```\n\n- Загрузить снимок (snapshot) с помощью ссылки «Загрузить снимок» под заголовком «Действия над пакетом» справа или командой:\n\n```\n$ curl -L -O https://aur.archlinux.org/cgit/aur.git/snapshot/имя_пакета.tar.gz\n```\n\n- Использовать зеркало archlinux/aur на GitHub, в котором каждый пакет находится в отдельной ветке. Рекомендуется клонировать только одну выбранную вами ветку (весь репозиторий слишком большой и клонироваться целиком будет очень медленно). Это можно сделать двумя способами: использовать git clone --single-branch: $ git clone --branch имя_пакета --single-branch https://github.com/archlinux/aur.git выполнить частичное клонирование репозитория (git clone --depth=1) и выборочно добавить ветки:\n\n- использовать git clone --single-branch: $ git clone --branch имя_пакета --single-branch https://github.com/archlinux/aur.git\n- выполнить частичное клонирование репозитория (git clone --depth=1) и выборочно добавить ветки:\n\n```\n$ git clone --branch имя_пакета --single-branch https://github.com/archlinux/aur.git\n```\n\n```\n$ git clone --depth=1 https://github.com/archlinux/aur.git; cd aur$ git remote set-branches --add origin имя_пакета$ git fetch$ git checkout имя_пакета\n```\n\n"
    },
    {
      "title": "Получение открытого ключа PGP (при необходимости)",
      "level": 3,
      "content": "Проверьте массив source в файле PKGBUILD на предмет наличия в нём файла подписи (суффикс .sig или .asc), и, если таковой присутствует, получите любой открытый ключ из массива validpgpkeys. Подробнее см. makepkg#Проверка цифровых подписей.\n\n"
    },
    {
      "title": "Сборка пакета",
      "level": 3,
      "content": "Перейдите в каталог, содержащий PKGBUILD пакета:\n\n```\n$ cd имя_пакета\n```\n\nПросмотрите содержимое всех предоставленных файлов. Например, для просмотра PKGBUILD с помощью less выполните:\n\n```\n$ less PKGBUILD\n```\n\n- Для просмотра изменений с момента последнего коммита выполните git show.\n- Для просмотра изменений с момента последнего коммита с помощью vimdiff выполните git difftool @~..@ --tool=vimdiff. Преимущество vimdiff в том, что можно увидеть полное содержимое каждого файла с отметками в местах изменений.\n\nСоберите пакет. После ручной проверки содержимого файлов запустите makepkg от имени обычного пользователя. Некоторые полезные флаги:\n\n- -s/--syncdeps — при помощи pacman перед сборкой проверить зависимости и установить недостающие. Если пакет завит от пакетов из AUR, их необходимо установить вручную до сборки.\n- -i/--install — установить пакет после успешной сборки. Позволяет пропустить шаг по ручной установке.\n- -r/--rmdeps — удалить зависимости, необходимые только для сборки, так как они больше не требуются. Учтите, что они могут потребоваться при переустановке или обновлении пакета.\n- -c/--clean — удалить временные файлы после сборки, так как они больше не требуются. Эти файлы обычно необходимы только для отладки процесса сборки.\n\n"
    },
    {
      "title": "Установка пакета",
      "level": 3,
      "content": "После сборки можно установить пакет с помощью pacman:\n\n```\n# pacman -U имя_пакета-версия-архитектура.pkg.tar.zst\n```\n\nNote: **Настоятельно** \n\n- Если вы изменяли PKGEXT в makepkg.conf, то имя пакета может отличаться.\n- Пример выше даёт лишь краткое описание процесса сборки пакета. Настоятельно рекомендуется прочесть статьи makepkg и Система сборки Arch, в которых представлена более подробная информация.\n\n"
    },
    {
      "title": "Переход на новую версию пакета",
      "level": 3,
      "content": "Когда в AUR появляется новая версия пакета, для его установки в каталоге с PKGBUILD пакета сначала обновите файлы командой\n\n```\n$ git pull\n```\n\nпосле чего повторите процесс сборки и установки, описанный выше.\n\n"
    },
    {
      "title": "Обновление пакетов",
      "level": 3,
      "content": "AUR не имеет официальной поддержки, поэтому pacman не обновляет пакеты из AUR автоматически — это ваша задача. После установки обновлений из официальных репозиториев вам также нужно обновить (пересобрать и переустановить) все AUR-пакеты, зависящие от библиотек из обновившихся пакетов, — даже если в AUR не появлялось новых версий.\n\n"
    },
    {
      "title": "Приостановленная",
      "level": 3,
      "content": "Учётные записи могут быть приостановлены (suspended) сопровождающими пакетов или разработчиками. У приостановленных учётных записей теряется возможность:\n\n- входить на https://aur.archlinux.org;\n- получать уведомления;\n- взаимодействовать с интерфейсом git.\n\n"
    },
    {
      "title": "Неактивная",
      "level": 3,
      "content": "Вы можете отметить свою учётную запись как неактивную (inactive). Сопровождающие пакетов и разработчики также могут отмечать неактивными другие учётные записи. Это используется для двух вещей:\n\n- для отображения даты, когда кто-то был отмечен неактивным, на странице его учётной записи;\n- для подсчёта активных сопровождающих пакетов на основе их неактивности.\n\n"
    },
    {
      "title": "Комментарии к пакету",
      "level": 3,
      "content": "Веб-интерфейс AUR имеет возможность комментирования, благодаря которой пользователи могут сообщить мэйнтейнеру PKGBUILD о предложениях и улучшениях.\n\nPython-Markdown предоставляет базовый Markdown-синтаксис для форматирования комментариев.\n\n- Эта реализация иногда имеет некоторые отличия от официальных правил синтаксиса.\n- Хеши коммитов Git-репозиториев пакетов и ссылки на Flyspray карты преобразуются в ссылки автоматически.\n- Длинные комментарии сворачиваются и могут быть показаны по требованию.\n\n"
    },
    {
      "title": "Голосование",
      "level": 3,
      "content": "Одним из самых простых действий для всех пользователей Arch Linux является обзор AUR и голосование за понравившиеся пакеты. Каждый пакет может быть принят кем-нибудь из сопровождающих пакетов в репозиторий extra. Количество голосов — один из важных критериев, поэтому в интересах пользователей активное голосование за пакеты.\n\nЗарегистрируйтесь на сайте AUR, чтобы появилась возможность «Проголосовать за пакет» при просмотре пакета. После регистрации также можно проголосовать за пакет из командной строки при помощи aur-auto-vote-gitAUR.\n\nКроме того, если настроена аутентификация в AUR через SSH, можно проголосовать из командной строки с использованием ssh-ключа. Это означает, что не придётся сохранять или вводить пароль от AUR.\n\n```\n$ ssh aur@aur.archlinux.org vote имя_пакета\n```\n\n"
    },
    {
      "title": "Устаревшие пакеты",
      "level": 3,
      "content": "Используйте Пометить пакет как устаревший для установки соответствующего флага. Укажите причину, по которой вы сочли пакет устаревшим, лучше всего — указав ссылку на объявление о релизе или его tarball.\n\nТакже можно попробовать связаться с сопроводителем по email. Если ответа не последует в течение двух недель, можно отправить запрос Сделать сиротой для данного пакета. Смотрите AUR submission guidelines (Русский)#Запросы для дополнительной информации.\n\n"
    },
    {
      "title": "Отладка процесса сборки пакета",
      "level": 2,
      "content": "1. Убедитесь, что ваше сборочное окружение обновлено, прежде чем собирать что-либо.\n1. Убедитесь, что мета-пакет base-devel установлен.\n1. Используйте опцию -s с командой makepkg, чтобы проверить и установить все необходимые зависимости перед сборкой.\n1. Попробуйте стандартную конфигурацию makepkg.\n1. Смотрите Makepkg (Русский)#Решение проблем по часто возникающим проблемам.\n\nЕсли у вас проблемы со сборкой пакета, первым делом почитайте PKGBUILD и комментарии на странице AUR.\n\nВполне может оказаться, что PKGBUILD сломан для всех. Если вы не можете разобраться сами, сообщите сопроводителю пакета (например, текст ошибки в комментарии на странице AUR). Также можно поискать помощь на форуме в разделе AUR Issues, Discussion & PKGBUILD Requests.\n\nПричина может оказаться очень нетривиальной. Нестандартные CFLAGS, LDFLAGS и MAKEFLAGS могут вызывать проблемы. Чтобы избежать проблем, которые могут быть вызваны специфичным окружением, собирайте пакеты в clean chroot. Если сборка не получается даже в clean chroot, тогда проблема скорее всего в самом PKGBUILD.\n\nСмотрите Создание пакетов#Проверка целостности пакета об использовании namcap. Если вы хотите получить ревью PKGBUILD, отправьте его в aur-general mailing list или на форум в раздел Creating & Modifying Packages. Также можно попросить помощь в IRC-канале #archlinux-aur на Libera Chat.\n\n"
    },
    {
      "title": "Отправка пакетов",
      "level": 2,
      "content": "При помощи AUR пользователи могут распространять свои файлы PKGBUILD. Инструкции и правила публикации описаны в статье AUR submission guidelines (Русский).\n\n"
    },
    {
      "title": "Перевод веб-интерфейса",
      "level": 2,
      "content": "Информацию о создании и поддержке перевода веб-интерфейса AUR смотрите в файле i18n.txt в дереве исходных текстов AUR.\n\n"
    },
    {
      "title": "История",
      "level": 2,
      "content": "В начале времён был лишь FTP-сервер ftp://ftp.archlinux.org/incoming, на который люди загружали свои файлы PKGBUILD, другие необходимые файлы и сами собранные пакеты. Пакет и связанные с ним файлы хранились на сервере, ожидая проверки доверенными пользователями (Trusted Users, ныне это сопровождающие пакетов — Package Maintainers) и добавления в официальный репозиторий.\n\nПозднее некоторым участникам сообщества было разрешено содержать собственные репозитории с общим доступом. Так появились репозитории доверенных пользователей (Trusted User Repositories). AUR был создан как развитие этой идеи, чтобы сделать систему более гибкой и удобной. Сопровождающие AUR часто упоминались как доверенные пользователи (Trusted Users, TU), пока роль не была переименована в сопровождающих пакетов (Package Maintainers).\n\nМежду 2015-06-08 и 2015-08-08 состоялся переход AUR с версии 3.5.1 на 4.0.0, что было связано с началом использования Git-репозиториев для публикации файлов PKGBUILD. Существовавшие на тот момент пакеты были частично перенесены в новую инфраструктуру их сопроводителями.\n\n"
    },
    {
      "title": "Git-репозитории с пакетами AUR3",
      "level": 3,
      "content": "Архив AUR на GitHub содержит все пакеты AUR3 на момент миграции. Также существует репозиторий aur3-mirror с аналогичным содержанием.\n\n"
    },
    {
      "title": "Какие типы пакетов разрешены в AUR?",
      "level": 3,
      "content": "Пакеты AUR — это просто «скрипты сборки» исполняемых файлов для последующей упаковки полученных бинарных файлов в пакет и установки при помощи pacman. Обычно разрешено всё, что удовлетворяет принципам полезности, инструкциям и лицензионным требованиям программного обеспечения. Но в некоторых случаях прямо указано, что запрещено создавать ссылки на скачивание, например, когда контент запрещён к распространению, вы можете использовать лишь само имя файла в качестве исходника. Это означает, что пользователь должен самостоятельно озаботиться в получении таких файлов. Если вы сомневаетесь в правовых аспектах, лучше сначала спросить.\n\n"
    },
    {
      "title": "Как я могу голосовать за пакеты в AUR?",
      "level": 3,
      "content": "Смотрите #Голосование.\n\n"
    },
    {
      "title": "Кто такие сопровождающие пакетов?",
      "level": 3,
      "content": "Этот термин может обозначать как официальную роль Arch Linux, дающую доступ к публикации пакетов в официальных репозиториях (Package Maintainer), так и просто людей, поддерживающих файлы PKGBUILD в AUR. Смотрите Arch terminology#Package maintainer.\n\n"
    },
    {
      "title": "В чём разница между AUR и репозиторием extra?",
      "level": 3,
      "content": "Arch User Repository — это место, где хранятся все файлы PKGBUILD, присланные пользователями. Сами пакеты должны быть собраны вручную при помощи makepkg. Когда файлы PKGBUILD набирают достаточный интерес со стороны сообщества и поддержку от сопровождающего пакетов, они перемещаются в репозиторий extra (поддерживаемый сопровождающими пакетов), содержащий собранные пакеты, которые уже можно напрямую установить при помощи pacman.\n\n"
    },
    {
      "title": "Пакет из AUR устарел, что я могу сделать?",
      "level": 3,
      "content": "Смотрите #Устаревшие пакеты.\n\nВ то же время вы можете попробовать обновить пакет самостоятельно, отредактировав PKGBUILD локально. Иногда обновления не требуют изменений в процессе сборки или создания пакета, в этом случае достаточно просто обновить pkgver или массив source.\n\n"
    },
    {
      "title": "Пакет foo из AUR не собирается, когда я запускаю makepkg; что мне делать?",
      "level": 3,
      "content": "Возможно, вы упускаете что-то тривиальное; смотрите #Отладка процесса сборки пакета.\n\n"
    },
    {
      "title": "ОШИБКА: Одна или больше PGP-подписей не могут быть проверены! Что мне делать?",
      "level": 3,
      "content": "Скорее всего, у вас нет необходимого открытого ключа (ключей) в вашей личной связке ключей для проверки скачанных файлов. Смотрите makepkg (Русский)#Проверка цифровых подписей.\n\n"
    },
    {
      "title": "Как создать PKGBUILD?",
      "level": 3,
      "content": "Смотрите статьи AUR submission guidelines (Русский)#Правила отправки пакетов и Создание пакетов.\n\n"
    },
    {
      "title": "У меня есть PKGBUILD, который я хочу опубликовать; кто-нибудь может проверить его на наличие ошибок?",
      "level": 3,
      "content": "Существует несколько каналов, по которым можно отправить свой пакет на проверку; смотрите #Отладка процесса сборки пакета.\n\n"
    },
    {
      "title": "Что необходимо для перемещения PKGBUILD в репозиторий extra?",
      "level": 3,
      "content": "Обычно необходимо как минимум 10 голосов для того, чтобы пакет мог быть перемещён в extra. Однако, если сопровождающий пакетов захочет поддерживать пакет, он скорее всего сделает это сразу.\n\nПолучение пакетом минимально необходимого количества голосов — не единственное требование: у кого-либо из сопровождающих пакетов должно появиться желание поддерживать этот пакет. Сопровождающие пакетов не обязаны перемещать пакет в репозиторий extra, даже если он имеет тысячи голосов.\n\nВ большинстве случаев очень популярные пакеты остаются в AUR по одной или нескольким из следующих причин:\n\n- в репозиториях Arch Linux уже содержится другая версия пакета;\n- прямое распространение запрещено лицензией;\n- пакет предназначен для AUR (например, это инструмент для работы с AUR).\n\nСмотрите также правила добавления пакетов в репозиторий extra.\n\n"
    },
    {
      "title": "Как ускорить повторную сборку?",
      "level": 3,
      "content": "Смотрите makepkg (Русский)#Сокращение времени сборки.\n\n"
    },
    {
      "title": "В чём разница между пакетами foo и foo-git?",
      "level": 3,
      "content": "Многие пакеты AUR выпускаются в виде «стабильных» версий и «нестабильных», находящихся в процессе разработки. Пакеты разработки обычно имеют суффикс, обозначающий их систему контроля версий, и не предназначены для обычного использования, но могут содержать новые возможности или исправления ошибок. Поскольку эти пакеты скачивают только последние доступные исходные тексты при выполнении makepkg, их pkgver() в AUR не отражает изменения из апстрима. По той же причине эти пакеты не могут выполнять проверку подлинности для любого источника VCS.\n\n"
    },
    {
      "title": "Почему пакет пропал из AUR?",
      "level": 3,
      "content": "Возможно, пакет был принят сопровождающим пакетов и теперь находится в репозитории extra.\n\nПакет мог быть удалён, если он не удовлетворял правилам отправки пакетов. Для уточнения причины удаления смотрите архив aur-requests.\n\n"
    },
    {
      "title": "Как узнать, пропал ли из AUR какой-либо из установленных мной пакетов?",
      "level": 3,
      "content": "Самый простой способ — проверить HTTP-статус страницы пакета AUR:\n\n```\n$ comm -23 <(pacman -Qqm | sort) <(curl https://aur.archlinux.org/packages.gz | gzip -cd | sort)\n```\n\n"
    },
    {
      "title": "Как получить список всех пакетов AUR?",
      "level": 3,
      "content": "- https://aur.archlinux.org/packages.gz\n- Используйте aurpkglist из python3-aurAUR\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Веб-интерфейс AUR\n- Почтовая рассылка AUR\n\n"
    }
  ]
}