{
  "title": "AUR submission guidelines (Português)",
  "url": "https://wiki.archlinux.org/title/AUR_submission_guidelines_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Padrões de empacotamento do Arch\n- Diretrizes de Mantenedor de Pacote\n\nOs usuários podem compartilhar scripts de PKGBUILD usando o Arch User Repository. Ele não contém nenhum pacote binário, mas permite que os usuários carreguem PKGBUILDs que podem ser baixados por outras pessoas. Estes PKGBUILDs são completamente não oficiais e não foram cuidadosamente avaliados, por isso devem ser usados por sua conta e risco.\n\n"
    },
    {
      "title": "Enviando pacotes",
      "level": 2,
      "content": "Se você de alguma forma esta incerto sobre um pacote ou o processo de compilação/envio mesmo após ler essa seção duas vezes, envie o PKGBUILD à lista de discussão do AUR, o fórum do AUR nos fóruns do Arch ou peça em nosso canal IRC por uma revisão pública antes de adicioná-lo ao AUR.\n\n"
    },
    {
      "title": "Regras de envio",
      "level": 3,
      "content": "Ao enviar um pacote para o AUR, observe as seguintes regras:\n\nOs PKGBUILDs enviados não devem compilar aplicativos já presentes em qualquer um dos repositórios oficiais binários sob nenhuma circunstância. Verifique a base de dados de pacotes oficial pelo pacote. Se qualquer versão dele existir, não envie o pacote. Se o pacote oficial estiver desatualizado, sinalize-o como tal. Se o pacote oficial está quebrado ou faltando algum recurso, por favor, envie um relatório de erros.\n\n- Verifique no AUR se o pacote já existe. Se ela estiver atualmente atualizada, as alterações podem ser enviadas em um comentário para a atenção do mantenedor. Se não for mantido ou o mantenedor não responder, o pacote poderá ser adotado e atualizado conforme necessário. Não crie pacotes duplicados.\n\n- Certifique-se de que o pacote que você deseja enviar é útil. Alguém mais vai querer usar este pacote? É extremamente especializado? Se mais do que algumas pessoas acham este pacote útil, é apropriado para envio.\n\n- Não use replaces em um PKGBUILD no AUR a menos que o pacote seja renomeado, por exemplo, quando Ethereal se tornou Wireshark. Se o pacote for uma versão alternativa de um pacote já existente, use conflicts (e provides se esse pacote for requerido por outras pessoas). A principal diferença é: após a sincronização (-Sy), o pacman imediatamente deseja substituir um pacote 'ofensivo' instalado ao encontrar um pacote com o replaces correspondente em qualquer lugar em seus repositórios; o conflicts, por outro lado, só é avaliado na instalação do pacote, que geralmente é o comportamento desejado, porque é menos invasivo.\n\n- Pacotes que compilam a partir de um sistema de versão de controle e não são atrelados a uma versão específica precisam ter um sufixo apropriado, -git para git e assim por diantes. Veja Diretrizes de pacotes VCS#Nomenclatura de pacote for a full list.\n\n- Pacotes que usam deliverables pré-compilados quando os fontes estão disponíveis, devem usar o sufixo -bin. Uma exceção a isso com Java. O AUR não deve conter o tarball binário criado pelo makepkg, nem deve conter a lista de arquivos.\n\n- Pacotes que compilam a partir do código-fonte usando uma versão específica não usam um sufixo.\n\n- Por favor, adicione uma linha de comentário no topo do arquivo PKGBUILD contendo informações sobre os atuais mantenedores e contribuidores anteriores, respeitando o seguinte formato. Lembre-se de disfarçar o seu e-mail para proteger contra spam. Linhas adicionais são opcionais.\n\n```\n# Maintainer: Seu Nome <endereço at domínio dot tld>\n```\n\n```\n# Maintainer: Seu Nome <endereço at domínio dot tld>\n# Maintainer: Nome do Outro Mantenedor <endereço at domínio dot tld>\n# Contributor: Nome do Mantenedor Anterior <endereço at domínio dot tld>\n# Contributor: Nome do Criador do Pacote <endereço at domínio dot tld>\n```\n\n"
    },
    {
      "title": "Autenticação",
      "level": 3,
      "content": "Para acesso de escrita para o AUR, você precisar ter um par de chaves SSH. O conteúdo da chave pública precisa ser copiada para seu perfil em Minha conta e a chave privada correspondente configurada para o endereço aur.archlinux.org. Por exemplo:\n\n```\n~/.ssh/config\n```\n\n```\nHost aur.archlinux.org\n  IdentityFile ~/.ssh/aur\n  User aur\n```\n\nVocê deve criar um novo par de chaves em vez de usar um existente, de forma que você possa seletivamente revogar as chaves caso algo aconteça:\n\n```\n$ ssh-keygen -f ~/.ssh/aur\n```\n\n"
    },
    {
      "title": "Criando repositórios de pacote",
      "level": 3,
      "content": "Se você está criando um novo pacote do zero, estabeleça um repositório Git local e um remoto no AUR clonando o pkgbase desejado. Se o pacote ainda não existir, o seguinte aviso é esperado:\n\n```\n$ git -c init.defaultbranch=master clone ssh://aur@aur.archlinux.org/pkgbase.git\n```\n\n```\nCloning into 'pkgbase'...\nwarning: You appear to have cloned an empty repository.\nChecking connectivity... done.\n```\n\nSe você já tem um pacote, inicialize-o como um repositório Git, se ainda não for um:\n\n```\n$ git -c init.defaultBranch=master init\n```\n\ne adicione um remoto do AUR:\n\n```\n$ git remote add rótulo ssh://aur@aur.archlinux.org/pkgbase.git\n```\n\nEntão, faça um fetch deste remoto para inicializá-lo no AUR.\n\n"
    },
    {
      "title": "Publicando novo conteúdo de pacote",
      "level": 3,
      "content": "Ao lançar uma nova versão do software empacotado, atualize as variáveis pkgver ou pkgrel para notificar todos os usuários que uma atualização é necessária. Não atualize esses valores se apenas pequenas alterações no PKGBUILD, como a correção de um erro de digitação, estiverem sendo publicadas.\n\nNão meramente faça commits de atualizações de pkgver para pacotes VCS. Eles não são considerados desatualizados quando o upstream tem novos commits. Só faça um novo commit quando outras alterações forem introduzidas, tal como alteração no processo de compilação.\n\nLembre-se de gerar .SRCINFO sempre que os metadados do PKGBUILD forem alterados, como as atualizações do pkgver(); caso contrário, o AUR não mostrará números de versão atualizados.\n\nPara enviar ou atualizar um pacote, adicione pelo menos o PKGBUILD e .SRCINFO, e quaisquer arquivos auxiliares novos ou modificados (tal como arquivos .install ou arquivos fontes locais, como patches; Faça commit deles com uma mensagem de commit significativa e, finalmente, faça um push das alterações para o AUR.\n\nPor exemplo:\n\n```\n$ makepkg --printsrcinfo > .SRCINFO\n$ git add PKGBUILD .SRCINFO\n$ git commit -m \"mensagem útil de commit\"\n$ git push\n```\n\n- Se o .SRCINFO não foi incluído no seu último commit, adicione-o alterando seu último commit com git commit --amend de forma que o AUR permita seu push.\n- O AUR só permite fazer push para o branch master. Se seu branch local tiver outro nome, renomeie-o e faça o push novamente.\n\n"
    },
    {
      "title": "Mantendo pacotes",
      "level": 2,
      "content": "- Verifique os feedback e comentários de outros usuários e tente incorporar quaisquer melhorias que eles sugerirem; considere isso um processo de aprendizado!\n- Por favor, não envie um comentário contendo a versão toda vez que você atualizar o pacote. Isso deixa a seção de comentário usável para o conteúdo valioso mencionado acima.\n- Por favor, não apenas envie e depois esqueça dos pacotes! É trabalho do mantenedor manter o pacote, verificando atualizações e melhorando o PKGBUILD.\n- Se você não deseja continuar mantendo o pacote por algum motivo, basta tornar órfão o pacote usando a interface web AUR e/ou publique uma mensagem na Lista de Discussão do AUR. Se todos os mantenedores de um pacote AUR o abandonarem, ele se tornará um pacote \"órfão\".\n- Automação é uma ferramenta valiosa para mantenedores, mas ela não pode substituir a intervenção manual (por exemplo, projetos pode alterar licença, adicionar ou remover dependências e outras alterações notáveis mesmo para lançamentos \"menores\"). Atualizações automatizadas de PKGBUILD são usadas a seu próprio risco e quaisquer contas com defeito e seus pacotes poderão ser removidos sem aviso prévio.\n\n"
    },
    {
      "title": "Requisições",
      "level": 2,
      "content": "As requisições de exclusão, de mesclagem e de tornar órfão podem ser criadas clicando no link \"Enviar requisições\" em \"Ações do pacote\" no lado direito. Isso despacha e-mails de notificação para o mantenedor do pacote atual e para a lista de discussão aur-requests para discussão. Os Mantenedores de Pacote aceitarão ou rejeitarão a requisição.\n\n"
    },
    {
      "title": "Exclusão",
      "level": 3,
      "content": "Solicitação para deslistar um pkgbase do AUR. É necessária uma breve nota explicando o motivo da exclusão, bem como detalhes justificadores (como quando um pacote é fornecido por outro pacote, se você é o mantenedor, ele é renomeado e o proprietário original concorda, etc).\n\n- Não é suficiente explicar por que um pacote pode ser excluído apenas em seus comentários: assim que o mantenedor do pacote entra em ação, o único lugar onde tal informação pode ser obtida é na lista de discussão aur-requests.\n- Solicitações de exclusão podem ser rejeitadas; nesse caso, se você for o mantenedor, provavelmente será aconselhado a abandonar o pacote para permitir a adoção por outro mantenedor.\n- Depois que um pacote é \"excluído\", seu repositório git permanece disponível para clonagem.\n\n"
    },
    {
      "title": "Mesclagem",
      "level": 3,
      "content": "Solicitação para excluir um pkgbase e transferir seus votos e comentários para outro pkgbase. O nome do pacote no qual será mesclado é obrigatório.\n\n"
    },
    {
      "title": "Tornar órfão",
      "level": 3,
      "content": "Solicitação para que um pkgbase seja retirado do mantenedor atual (disown, como usado em inglês). Estas solicitações serão atendidas após duas semanas se o atual mantenedor não reagir. A exceção é se um pacote foi sinalizado como desatualizado há pelo menos 180 dias; solicitações para tornar órfão são então automaticamente aceitas.\n\n"
    }
  ]
}