{
  "title": "Backlight (Русский)",
  "url": "https://wiki.archlinux.org/title/Backlight_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Контролировать яркость экрана может оказаться непросто. На некоторых компьютерах нет физического переключателя, а программные решения могут не работать как положено. Тем не менее, как правило, можно найти работающий способ для вашего оборудования. Цель этой статьи — обобщить все возможные способы регулировки подсветки.\n\nСуществует много способов управлять яркостью монитора, экрана ноутбука или встроенной экранной панели (как в iMac). В соответствии с этими обсуждениями[устаревшая ссылка 2024-10-12 ⓘ] и этой страницей на Ubuntu Wiki можно разделить способы управления на следующие категории:\n\n- яркость управляется горячей клавишей, определённой производителем, и нет интерфейса для того, чтобы ОС могла настраивать яркость;\n- яркость можно контролировать через ACPI, через графический драйвер или драйвер платформы. В этом случае управление подсветкой доступно пользователю через /sys/class/backlight, который может использоваться утилитами настройки;\n- яркость можно контролировать посредством аппаратного регистра с помощью setpci.\n\n"
    },
    {
      "title": "ACPI",
      "level": 3,
      "content": "Яркость подсветки экрана регулируется установкой уровня питания светодиодов или катодов. Зачастую уровень питания можно контролировать с помощью ACPI модуля ядра для видео. Интерфейс к этому модулю доступен через sysfs(5) в /sys/class/backlight/.\n\nИмя каталога зависит от модели видеокарты.\n\n```\n$ ls /sys/class/backlight/\n```\n\n```\nacpi_video0\n```\n\nВ данном случае подсветкой управляет видеокарта ATI. В случае с картой Intel каталог будет называться intel_backlight. В следующих примерах используется acpi_video0. Если вы используете карту Intel, просто замените в примерах acpi_video0 на intel_backlight.\n\nКаталог содержит следующие файлы и подкаталоги:\n\n```\n$ ls /sys/class/backlight/acpi_video0/\n```\n\n```\nactual_brightness  brightness         max_brightness     subsystem/    uevent\nbl_power           device/            power/             type\n```\n\nМаксимальную яркость можно прочитать из файла max_brightness, и она обычно равна 15.\n\n```\n$ cat /sys/class/backlight/acpi_video0/max_brightness\n```\n\n```\n15\n```\n\nЯркость можно изменить путём записи числа в файл brightness. Установить яркость выше максимальной не получится.\n\n```\n# echo 5 > /sys/class/backlight/acpi_video0/brightness\n```\n\nПо умолчанию только root может менять яркость таким способом. Чтобы управлять яркостью могли пользователи из группы video, можно использовать правило udev (для применения может понадобиться перезагрузка):\n\n```\n/etc/udev/rules.d/backlight.rules\n```\n\n```\nACTION==\"add\", SUBSYSTEM==\"backlight\", RUN+=\"/bin/chgrp video $sys$devpath/brightness\", RUN+=\"/bin/chmod g+w $sys$devpath/brightness\"\n```\n\n"
    },
    {
      "title": "Параметры ядра",
      "level": 4,
      "content": "Иногда ACPI не работает должным образом из-за различных реализаций материнских плат и особенностей ACPI, что может приводить, например, к некорректным уведомлениям о яркости. Этому могут быть подвержены некоторые ноутбуки с двойной графикой (например, дискретная видеокарта NVIDIA/AMD вместе с интегрированной Intel/AMD). Кроме того, иногда для ACPI может быть необходимо зарегистрировать свою собственную подсветку acpi_video0, даже если уже существует другая (например, intel_backlight), что может быть достигнуто добавлением следующих параметров ядра:\n\n```\nacpi_backlight=video\nacpi_backlight=vendor\nacpi_backlight=native\n```\n\n- На ноутбуках NVIDIA Optimus параметр ядра nomodeset может препятствовать регулировке подсветки.\n- На ноутбуках Asus вам может также понадобиться загрузить модуль ядра asus-nb-wmi.\n- Отключение legacy-загрузки на Dell XPS13 приводит к невозможности изменить подсветку.\n- В Linux 6.1 подсистема подсветки была переработана. Если после обновления подсветка не работает, сперва попробуйте удалить существующий параметр ядра acpi_backlight. На некоторых ноутбуках Optimus можно попробовать загрузиться с параметром acpi_backlight=nvidia_wmi_ec.\n\n"
    },
    {
      "title": "Правило udev",
      "level": 4,
      "content": "Если доступен интерфейс ACPI, уровень подсветки может быть установлен во время загрузки с помощью правила udev:\n\n```\n/etc/udev/rules.d/81-backlight.rules\n```\n\n```\n# Установить уровень подсветки равным 8\nSUBSYSTEM==\"backlight\", ACTION==\"add\", KERNEL==\"acpi_video0\", ATTR{brightness}=\"8\"\n```\n\n"
    },
    {
      "title": "setpci",
      "level": 3,
      "content": "В некоторых случаях (например, Intel Mobile 945GME [1]) можно задать регистр видеокарты для регулировки подсветки. Это означает регулировку подсветки путём непосредственного манипулирования оборудованием, что может быть рискованно и, как правило, не является хорошей идеей. Не все видеокарты поддерживают этот метод.\n\nПри использовании этого метода сперва используйте lspci, чтобы узнать, где находится ваша видеокарта.\n\n```\n# setpci -s 00:02.0 F4.B=0\n```\n\n"
    },
    {
      "title": "Внешние мониторы",
      "level": 3,
      "content": "DDC/CI (Display Data Channel Command Interface — командный интерфейс обмена данными между компьютером и монитором) может использоваться для связи с внешними мониторами, реализующими стандарт MCCS (Monitor Control Command Set) по шине I2C. DDC может контролировать яркость, контрастность, входы и т.д. на поддерживаемых мониторах. Настройки, доступные с панели OSD (экранное меню), также могут управляться через DDC. Может понадобиться загрузить модуль ядра i2c-dev, если устройства /dev/i2c-* отсутствуют.\n\nДля получения или изменения яркости можно использовать ddcutil:\n\n```\n# ddcutil capabilities | grep \"Feature: 10\"\n```\n\n```\nFeature: 10 (Brightness)\n```\n\n```\n# ddcutil getvcp 10\n```\n\n```\nVCP code 0x10 (Brightness                    ): current value =    60, max value =   100\n```\n\n```\n# ddcutil setvcp 10 70\n```\n\nТакже можно использовать ddcci-driver-linux-dkmsAUR для добавления внешних мониторов в sysfs. После установки этого пакета и загрузки модуля ядра ddcci можно будет использовать любую утилиту настройки.\n\n- Одновременное использование ddcci и i2c-dev может привести к конфликтам ресурсов и появлению ошибок вроде Device or resource busy.\n- Для проприетарного драйвера NVIDIA может понадобиться добавить Option \"RegistryDwords\" \"RMUseSwI2c=0x01; RMI2cSpeed=100\" в секцию Device в настройках Xorg или параметр модуля ядра NVreg_RegistryDwords=RMUseSwI2c=0x01;RMI2cSpeed=100 для модуля nvidia. [2] [3]\n- ddcutil может не работать с некоторыми возможностями VCP, если на мониторе включена функция, которая уже автоматически их настраивает (например, Dynamic Contrast Ratio или BenQ Eye Care).\n- Чтобы упростить настройку горячих клавиш для управления яркостью, может быть удобно предоставить доступ обычному пользователю к соответствующим устройствам I2C. Для этого создайте группу i2c и настройте udev на назначение этой группы устройствам I2C. [4]\n- Пакет ddcutil предоставляет файл /usr/share/ddcutil/data/90-nvidia-i2c.conf, который можно скопировать в /etc/X11/xorg.conf.d/ вместо ручной настройки Xorg. Также он предоставляет правила udev /usr/share/ddcutil/data/60-ddcutil-i2c.rules и /usr/share/ddcutil/data/60-ddcutil-usb.rules.\n\n"
    },
    {
      "title": "Выключение подсветки",
      "level": 2,
      "content": "Выключение подсветки (например, при закрытии крышки ноутбука) может быть полезно для сохранения заряда батареи. Выполните следующую команду:\n\n```\n$ xset dpms force off\n```\n\nПодсветка должна включиться снова при движении мыши или вводе с клавиатуры. Также можно использовать xset s.\n\nЕсли предыдущая команда не работает, есть шанс, что vbetool заработает. Однако имейте в виду, что в этом случае снова активировать подсветку нужно вручную. Выполните:\n\n```\n$ vbetool dpms off\n```\n\nЧтобы снова включить подсветку:\n\n```\n$ vbetool dpms on\n```\n\nНапример, это можно использовать при закрытии крышки ноутбука с помощью acpid.\n\n"
    },
    {
      "title": "Сохранение и восстановление",
      "level": 2,
      "content": "Пакет systemd предоставляет «static» службу systemd-backlight@.service, которая включена по умолчанию. Она сохраняет яркость подсветки во время выключения ПК и восстанавливает при включении. Эта служба использует метод ACPI, описанный в разделе #ACPI, создавая службы для каждого каталога, найденного в /sys/class/backlight/. Например, если есть каталог acpi_video0, она создаст службу systemd-backlight@backlight:acpi_video0.service. Если вы используете другие методы установки яркости во время загрузки, рекомендуется отключить systemd-backlight путём добавления параметра ядра systemd.restore_state=0. Смотрите systemd-backlight@.service(8) для более подробной информации.\n\nКроме того, утилиты brilloAUR и lightAUR поддерживают функцию сохранения и восстановления. Эти две утилиты могут быть более полезны, если вы хотите сохранять яркость для отдельных пользователей, однако для этого не предусмотрено никаких юнитов systemd.\n\n"
    },
    {
      "title": "Утилиты настройки",
      "level": 2,
      "content": "Table content:\nПакет | Управление подсветкой клавиатуры | Реагирование на освещённость | Язык | Лицензия | Примечания\nacpilightAUR | Да | Нет | Python3 | GPL 3.0 или новее | Предоставляет исполняемый файл «xbacklight»\nbacklight_controlAUR | Нет | Нет | C | MIT | Очень маленькая и простая программа. Поддерживает относительную регулировку.\nblightAUR | Да | Нет | Python3 | ISC | Использует интерфейс logind. Работает только с локальными пользователями, но не требует suid или группы video.\nbrightdAUR | Нет | Нет | C | GPL 2.0 | Затемняет экран при неактивности.\nbrightnessctl | Да | Нет | C | MIT | -\nbrilloAUR | Да | Нет | C | GPL 3.0 | Поддерживает плавную и относительную регулировку.\nclightAUR | Да | Да | C | GPL 3.0 или новее | Управляет температурой экрана (только Xorg) и плавно снижает яркость по истечении времени. Поддержка датчиков освещённости [5]. Позволяет превратить веб-камеру в датчик освещённости.\nenlighten-gitAUR | Да | Нет | C | GPL 3.0 или новее | -\nillum-gitAUR | Нет | Нет | C | AGPL 3.0 | Реагирует на нажатие клавиш.\nlightAUR | Да | Нет | C | GPL 3.0 | Нет зависимостей. Не зависит от X-сервера.\nluxAUR | Нет | Нет | Shell | MIT | -\nmacbook-lighterAUR | Да | Да | Bash | GPL | Консольный интерфейс управления подсветкой экрана/клавиатуры Macbook и автоматическая регулировка в зависимости от освещённости.\nwlr-brightness-gitAUR | Нет | Нет | C | MIT | Также поддерживает новые OLED-дисплеи, которым требуется настройка гаммы. Использует wlroots.\nwlumaAUR | Да | Да | Rust | ISC | Автоматическая регулировка яркости в зависимости от содержимого экрана и освещённости. Можно использовать веб-камеру или время для имитации датчика освещённости. Поддержка клавиатур и внешних мониторов. Использует wlroots.\nybacklightAUR | Нет | Нет | Perl | GPL 2.0 | Небольшой Perl-скрипт, похожий на xbacklight, но использующий драйверы sysfs.\nxbacklight-notifyAUR | Нет | Нет | C | MIT | Простой демон уведомлений для X11 (считывает RandR-свойство backlight)\nacpi-backlight-notifyAUR | Нет | Нет | C | MIT | Простой демон уведомлений для интерфейса ACPI (считывает /sys/class/backlight/)\n\n"
    },
    {
      "title": "xbacklight",
      "level": 3,
      "content": "Яркость может быть установлена с помощью пакета xorg-xbacklight.\n\n- xbacklight работает только с Intel. Другие драйверы не поддерживают RandR-свойство backlight.\n- xbacklight в настоящий момент не работает с драйвером modesetting [6].\n\nЧтобы установить яркость в 50% от максимальной:\n\n```\n$ xbacklight -set 50\n```\n\nПриращения могут использоваться вместо абсолютных значений, например, для увеличения или уменьшения яркости на 10%:\n\n```\n$ xbacklight -inc 10\n$ xbacklight -dec 10\n```\n\nЕсли вы получаете ошибку «No outputs have backlight property», это потому, что xrandr/xbacklight не выбирает правильный каталог в /sys/class/backlight. Вы можете указать каталог, задав опцию Backlight в разделе Device в файле /etc/X11/xorg.conf.d/20-video.conf. Например, если имя каталога intel_backlight и используется драйвер Intel, раздел Device может выглядеть так:\n\n```\n/etc/X11/xorg.conf.d/20-intel.conf\n```\n\n```\nSection \"Device\"\n    Identifier  \"Intel Graphics\"\n    Driver      \"intel\"\n    Option      \"Backlight\"  \"intel_backlight\"\nEndSection\n```\n\nСмотрите FS#27677 и https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=651741 для подробностей.\n\nЕсли у вас включена функция Intel Fastboot, может возникнуть ошибка No outputs have backlight property. В этом случае попытка применить описанный выше метод может привести к сбою Xorg при запуске. Чтобы решить проблему, Fastboot следует отключить. Известно, что он вызывает проблемы с управлением яркостью.\n\n"
    },
    {
      "title": "light",
      "level": 3,
      "content": "Установите lightAUR и добавьте своего пользователя в группу video.\n\nУвеличение яркости на 5 процентов:\n\n```\n$ light -A 5\n```\n\nУменьшение яркости на 5 процентов:\n\n```\n$ light -U 5\n```\n\nУстановка яркости на 100 процентов:\n\n```\n$ light -S 100\n```\n\n"
    },
    {
      "title": "Использование DBus с GNOME",
      "level": 3,
      "content": "Яркость также можно регулировать с помощью настроек gnome. При использовании этого метода изменения отражаются в интерфейсе gnome.\n\n```\n$ gdbus call --session --dest org.gnome.SettingsDaemon.Power --object-path /org/gnome/SettingsDaemon/Power --method org.freedesktop.DBus.Properties.Set org.gnome.SettingsDaemon.Power.Screen Brightness \"<int32 50>\"\n```\n\nПошаговое изменение яркости (для контроля с клавиатуры) также может быть реализовано этим методом.\n\n```\n$ gdbus call --session --dest org.gnome.SettingsDaemon.Power --object-path /org/gnome/SettingsDaemon/Power --method org.gnome.SettingsDaemon.Power.Screen.StepUp\n$ gdbus call --session --dest org.gnome.SettingsDaemon.Power --object-path /org/gnome/SettingsDaemon/Power --method org.gnome.SettingsDaemon.Power.Screen.StepDown\n```\n\n"
    },
    {
      "title": "Использование DBus с KDE",
      "level": 3,
      "content": "Смотрите https://userbase.kde.org/KDE_Connect/Tutorials/Useful_commands#Brightness_settings.\n\n"
    },
    {
      "title": "Цветовая коррекция",
      "level": 2,
      "content": "Цветокоррекция не меняет яркость подсветки, а просто меняет LUT, то есть не влияет на время работы от батареи. Тем не менее, она может быть полезна, когда управление подсветкой недоступно (на настольных ПК или ноутбуках с OLED-экранами).\n\n- Clight — Пользовательская утилита-демон, предназначенная для полного управления вашим дисплеем. Она может управлять температурой изображения в зависимости от текущего времени суток подобно redshift. Она пытается использовать geoclue для получения местоположения пользователя, если в файле настроек не заданы широта и долгота. Она также поддерживает фиксированное время восхода и захода солнца.\n\n- icc-brightness — Управление яркостью OLED-дисплеев путём применения цветовых профилей ICC.\n\n- Monica — Инструмент для калибровки монитора. Работает как фронтенд к xgamma для изменения гамма-коррекции.\n\n- Redshift — Инструмент для настройки цветовой температуры. Регулирует цветовую температуру изображения в зависимости от окружения. Это может снизить нагрузку на глаза, если вы работаете по ночам. Вдохновлён программой f.lux.\n\n- xcalib — Лёгкий загрузчик параметров калибровки монитора. Может загружать ICC-профиль монитора для совместного использования в настольных приложениях.\n\n- xgamma — Настройка гамма-коррекции монитора.\n\n"
    },
    {
      "title": "Wayland",
      "level": 3,
      "content": "Redshift не поддерживает Wayland (но есть форк redshift-wayland-gitAUR[ссылка недействительна: package not found]). Можно применить нужную температуру в tty перед запуском композитора. Например:\n\n```\n$ redshift -m drm -PO 3000\n```\n\nНекоторые композиторы позволяют применять цветокоррекцию во время работы:\n\n- Для GNOME можно использовать встроенный ночной свет.\n- Для KDE можно использовать встроенную ночную цветовую схему.\n- Для Sway и других композиторов на основе wlroots, а также для Orbital можно использовать gammastep (форк Redshift), clightAUR, wlsunset-gitAUR или wl-gammarelayAUR.\n\n"
    },
    {
      "title": "Xorg: настройка воспринимаемой яркости с помощью xrandr",
      "level": 3,
      "content": "Можно использовать xrandr для изменения воспринимаемой яркости.\n\nДля установки воспринимаемой яркости выше максимального уровня (действуют вышеупомянутые предостережения для NVIDIA):\n\n```\n$ xrandr --output название_вывода --brightness 2\n```\n\nЭто должно примерно вдвое увеличить яркость изображения. Это приведёт к снижению качества цвета в пользу яркости, тем не менее оно особенно подходит для ситуаций, когда окружающий свет очень яркий (например, солнечный свет).\n\nЭто также можно использовать для уменьшения воспринимаемой яркости в тёмной комнате, указав значение меньше 1 (например, 0.5). Это полезно, когда нет возможности регулировать подсветку (например, на настольном компьютере).\n\nОпределить название вывода подключенного устройства можно такой командой:\n\n```\n$ xrandr | grep -w connected | cut -f '1' -d ' '\n```\n\nДля удобства можно сделать псевдоним:\n\n```\n$ alias b='echo -e \"Введите яркость:\\n\"; read val; xrandr --output название_вывода --brightness \"${val}\"'\n```\n\nЧтобы автоматически запускать xrandr при изменении файла, содержащего информацию о яркости подсветки, можно использовать oled_shmoledAUR:\n\n```\n$ oled_shmoled название_вывода\n```\n\n"
    },
    {
      "title": "NVIDIA settings",
      "level": 3,
      "content": "Пользователи проприетарных драйверов NVIDIA могут менять яркость дисплея с помощью утилиты nvidia-settings в разделе «X Server Color Correction». Однако имейте в виду, что это не имеет ничего общего с подсветкой (Интенсивность), она всего лишь регулирует цветность. (Уменьшение яркости таким образом не является энергоэффективным. Используйте его в последнюю очередь, если все другие варианты не срабатывают; увеличение яркости портит цвета на экране полностью, по аналогии с засвеченностью фотографий.)\n\n"
    },
    {
      "title": "Частота ШИМ-модуляции подсветки (только для Intel i915)",
      "level": 3,
      "content": "Известно, что на ноутбуках со светодиодной подсветкой иногда мерцает экран. Это объясняется тем, что наиболее эффективным способом управления яркостью подсветки светодиодов является быстрое включение и выключение светодиодов, изменяя время их свечения.\n\nОднако частота переключения, так называемая частота ШИМ (широтно-импульсная модуляция) может быть недостаточно высокой, чтобы глаз воспринимал её как непрерывное свечение, и вместо этого видно мерцание. Это вызывает у некоторых людей такие симптомы, как головные боли и усталость глаз.\n\nЕсли у вас графический адаптер Intel i915, то возможно настроить частоту ШИМ, чтобы устранить мерцание.\n\nПериод ШИМ (обратно пропорциональный частоте) записывается в 2 старших байта регистра 0xC8254 (если вы используете чипсет Intel GM45, вместо этого используйте адрес 0x61254). Чтобы манипулировать значениями регистров, установите пакет intel-gpu-tools.\n\nЧтобы увеличить частоту, период должен быть уменьшен. Например:\n\n```\n# intel_reg read 0xC8254\n```\n\n```\n0xC8254 : 0x12281228\n```\n\nЗатем, чтобы удвоить частоту ШИМ, разделите 2 старших байта (4 шестнадцатеричные цифры) на 2 и запишите полученное значение, сохраняя нижние байты неизменными:\n\n```\n# intel_reg write 0xC8254 0x09141228\n```\n\nВы можете использовать онлайн-калькулятор для расчета желаемого значения https://devbraindom.blogspot.com/2013/03/eliminate-led-screen-flicker-with-intel.html[устаревшая ссылка 2025-03-15 ⓘ]\n\nЧтобы установить новую частоту автоматически, попробуйте написать правило udev или установить intelpwm-udevAUR.\n\n"
    },
    {
      "title": "Инвертированная яркость (только для Intel i915)",
      "level": 3,
      "content": "Симптомы:\n\n- после установки xf86-video-intel systemd-backlight.service выключает подсветку во время загрузки возможное решение: маскировать systemd-backlight.service\n- переключение с X на другую виртуальную консоль выключает подсветку\n- кнопки регулировки подсветки инвертированы (то есть увеличение яркости делает экран темнее)\n\n- возможное решение: маскировать systemd-backlight.service\n\nЭта проблема может быть решена добавлением i915.invert_brightness=1 в список параметров ядра.\n\n"
    },
    {
      "title": "Не работает управление яркостью панели eDP (только для Intel i915)",
      "level": 3,
      "content": "Embedded Display Port (eDP) v1.2 добавил новый протокол управления панелью дисплея для подсветки и других элементов управления, который работает через канал AUX [7]\n\nПо умолчанию драйвер i915 пытается использовать ШИМ для управления яркостью подсветки, что может не сработать.\n\nЧтобы менять подсветку путём записи в регистры DPCD по каналу AUX, пропишите параметр ядра i915.enable_dpcd_backlight=1.\n\n"
    },
    {
      "title": "sysfs редактируется, но яркость не меняется",
      "level": 3,
      "content": "На некоторых системах клавиши изменения яркости корректно меняют значения интерфейса acpi в /sys/class/backlight/acpi_video0/actual_brightness, но яркость экрана не изменяется. Апплеты яркости в средах рабочего стола тоже могут показывать изменения без реального влияния на яркость.\n\nЕсли вы протестировали рекомендуемые параметры ядра и только xbacklight работает, то, возможно, вы столкнулись с несовместимостью между вашим BIOS и драйвером ядра.\n\nВ этом случае единственное решение — дождаться исправления от производителя BIOS или драйвера видеокарты.\n\nОбходной путь — использовать inotify для запуска xbacklight после каждого изменения значения /sys/class/backlight/acpi_video0/actual_brightness.\n\nСперва установите inotify-tools. Затем создайте скрипт, который будет запускаться при каждом включении с помощью автозагрузки.\n\n```\n/usr/local/bin/xbacklightmon\n```\n\n```\n#!/bin/sh\n\npath=/sys/class/backlight/acpi_video0\n\nluminance() {\n    read -r level < \"$path\"/actual_brightness\n    factor=$(printf \"$max\" | awk '{print 100/$1}')\n    printf \"$level $factor\" | awk '{print int($1*$2)}'\n}\n\nread -r max < \"$path\"/max_brightness\n\nxbacklight -set \"$(luminance)\"\n\ninotifywait -me modify --format '' \"$path\"/actual_brightness | while read; do\n    xbacklight -set \"$(luminance)\"\ndone\n```\n\n"
    },
    {
      "title": "Не работает управление подсветкой в MATE",
      "level": 3,
      "content": "Убедитесь, что установлен пакет mate-power-manager.\n\n"
    },
    {
      "title": "Не работают клавиши управления подсветкой в Xfce",
      "level": 3,
      "content": "В Xfce4 за обработку клавиш управления подсветкой отвечает Менеджер питания.\n\nИногда параметр «Обрабатывать кнопки яркости экрана» может оказаться отключен по умолчанию.\n\nЧтобы включить их обработку, откройте настройки менеджера питания и включите соответствующий параметр:\n\n```\n$ xfce4-power-manager -c\n```\n\n"
    },
    {
      "title": "xbacklight выдаёт: No outputs have backlight property",
      "level": 3,
      "content": "Иногда, в зависимости от установленной видеокарты, xbacklight из пакета xorg-xbacklight может выдать сообщение «No outputs have backlight property». Пакет acpilightAUR предоставляет альтернативную реализацию xbacklight, которая может оказаться рабочей.\n\n"
    },
    {
      "title": "На драйвере amdgpu после перезагрузки подсветка всегда имеет максимальную яркость",
      "level": 3,
      "content": "Из-за бага в драйвере amdgpu значение actual_brightness подсветки сообщается как 16-битное целое число, которое находится за пределами 8-битного диапазона, указанного в max_brightness. Это приводит к тому, что служба systemd-backlight при загрузке пытается установить слишком большое значение, которое в итоге уменьшается до максимальной яркости (255).\n\nПока баг не исправлен, одним из возможных обходных путей является преобразование сохранённой яркости в пределы правильного диапазона перед её установкой. Это можно сделать с помощью скрипта и юнита службы:\n\n```\nfix-brightness.sh\n```\n\n```\n#!/bin/bash\n\n# Адаптируйте эту строку под ваше оборудование\nBRIGHTNESS_FILE=\"/var/lib/systemd/backlight/pci-0000:04:00.0:backlight:amdgpu_bl0\"\nBRIGHTNESS=$(cat \"$BRIGHTNESS_FILE\")\nBRIGHTNESS=$(($BRIGHTNESS*255/65535))\nBRIGHTNESS=${BRIGHTNESS/.*} # преобразование в целое число на всякий случай\necho $BRIGHTNESS > \"$BRIGHTNESS_FILE\"\n```\n\n```\nfix-brightness.service\n```\n\n```\n[Unit]\nDescription=Convert 16-bit brightness values to 8-bit before systemd-backlight applies it\nBefore=systemd-backlight@backlight:amdgpu_bl0.service\n\n[Service]\nType=oneshot\nExecStart=путь/к/fix-brightness.sh\n\n[Install]\nWantedBy=multi-user.target\n```\n\nНа некоторых системах уровень подсветки, о котором сообщает драйвер, находится в правильном диапазоне [0, 255], но systemd всё равно не может восстановить правильное значение. Вероятно, это связано с гонкой в ядре. В этом случае преобразование уровня яркости не поможет, так как он уже находится в правильном диапазоне. Вместо этого в качестве обходного пути можно сохранить уровень яркости в systemd перед выключением. Этого можно добиться с помощью следующего скрипта и юнита службы:\n\n```\nfix-brightness.sh\n```\n\n```\n#!/bin/sh\n\n# Уровень подсветки с точки зрения systemd (измените при необходимости)\nreadonly SYSTEMD_BACKLIGHT_FILE='/var/lib/systemd/backlight/pci-0000:04:00.0:backlight:amdgpu_bl0'\n\n# Уровень подсветки из драйвера AMDGPU\nreadonly AMDGPU_BACKLIGHT_FILE='/sys/class/backlight/amdgpu_bl0/brightness'\n\n# Читаем текущее значение из драйвера и применяем его в systemd\nreadonly AMDGPU_BACKLIGHT_VALUE=$(cat \"$AMDGPU_BACKLIGHT_FILE\")\necho \"$AMDGPU_BACKLIGHT_VALUE\" > \"$SYSTEMD_BACKLIGHT_FILE\"\n```\n\n```\nfix-brightness.service\n```\n\n```\n[Unit]\nDescription=Save brightness value from AMDGPU\nDefaultDependencies=no\nAfter=final.target\n\n[Service]\nType=oneshot\nExecStart=путь/к/fix-brightness.sh\n\n[Install]\nWantedBy=final.target\n```\n\n"
    },
    {
      "title": "Сохранение яркости <5% при перезагрузке",
      "level": 3,
      "content": "Согласно systemd-backlight@.service(8), если свойство udev ID_BACKLIGHT_CLAMP не установлено в false, минимальное допустимое значение сохраняемой яркости — 1 или 5% от максимальной яркости, в зависимости от того, что больше. Это ограничение будет снято, когда ядро позволит надёжно устанавливать в пользовательском пространстве значение яркости, не приводящее к выключению дисплея.\n\nЧтобы яркость <5% сохранялась при перезагрузке, создайте правило udev:\n\n```\n/etc/udev/rules.d/99-backlight_clamp.rules\n```\n\n```\n# Разрешить сохранять яркость <5% при перезагрузке\nSUBSYSTEM==\"backlight\", ENV{ID_BACKLIGHT_CLAMP}=\"0\"\n```\n\n"
    }
  ]
}