{
  "title": "Badblocks (Português)",
  "url": "https://wiki.archlinux.org/title/Badblocks_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "badblocks é um programa para testar dispositivos de armazenamento para blocos defeituosos (em inglês, bad blocks).\n\nNo caso de um HDD, todo o setor deve ser aposentado. Um setor é uma subdivisão de uma faixa em um dispositivo de armazenamento e setores que se tornaram ruins não podem ser usados porque ficaram danificados permanentemente (um setor defeituoso pode ter efeitos adversos variando de alterar uma letra em um arquivo de texto para causar um programa binário tem uma falha de segmentação).\n\nS.M.A.R.T. (Self-Monitoring, Analysis, and Reporting Technology) é um recurso de hardware presente em quase todos os HDD ainda em uso hoje em dia e em alguns casos pode automaticamente \"aposentar\" defeituosos setores de HDD. De qualquer forma, S.M.A.R.T. espera apenas passivamente por erros, enquanto os blocos defeituosos escrevem padrões simples para cada bloco de um dispositivo e, em seguida, os lê e verifica procurando por áreas danificadas. (Assim como o memtest86* faz com a RAM.)\n\nIsso pode ser feito em um modo de gravação (write-mode) destrutivo que efetivamente apaga o dispositivo (faça backup!) ou em modos não-destrutivos de leitura-gravação (backup aconselhável também!) e somente leitura.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote e2fsprogs.\n\nVeja badblocks(8) para o uso.\n\n"
    },
    {
      "title": "Fidelidade do dispositivo de armazenamento",
      "level": 2,
      "content": "Embora não exista uma regra firme, é comum pensar que uma nova unidade deve ter zero setores defeituosos. Com o passar do tempo, setores defeituosos se desenvolverão e, embora possam ser definidos para o sistema de arquivos para que sejam evitados, o uso contínuo da unidade geralmente resultará na formação de setores defeituosos adicionais e normalmente é o prenúncio de sua eventual morte. A substituição do dispositivo é recomendada.\n\n"
    },
    {
      "title": "Comparações com outros programas",
      "level": 2,
      "content": "Prática recomendada típica para testar um dispositivo de armazenamento para setores defeituosos é usar o programa de teste do fabricante. A maioria dos fabricantes possui programas que fazem isso. O principal motivo para isso é que os fabricantes geralmente têm seus padrões embutidos nos programas de teste que lhe dirão se a unidade precisa ser substituída ou não. A ressalva aqui é que alguns programas de teste de fabricantes não imprimem resultados de teste completos e permitem que um certo número de setores defeituosos diga apenas se eles passam ou não. Os programas de fabricantes, no entanto, são geralmente mais rápidos do que os badblocks, por vezes, uma quantidade razoável.\n\n"
    },
    {
      "title": "Testando por setores ruins",
      "level": 2,
      "content": "Para testar setores defeituosos no Linux, o programa badblocks é normalmente usado. badblocks tem vários modos diferentes para detectar setores defeituosos.\n\n"
    },
    {
      "title": "Teste de leitura-gravação (aviso:destrutivo)",
      "level": 3,
      "content": "Este teste é principalmente para testar novas unidades e é um teste de leitura/gravação. À medida que o padrão é gravado em todos os blocos acessíveis, o dispositivo obtém efetivamente apagado. O padrão é um teste extensivo com quatro passagens usando quatro padrões diferentes: 0xaa (10101010), 0x55 (01010101), 0xff (11111111) e 0x00 (00000000). Para alguns dispositivos, isso levará alguns dias para ser concluído.\n\n```\n# badblocks -wsv /dev/dispositivo\n```\n\n```\nChecking for bad blocks in read-write mode\nFrom block 0 to 488386583\nTesting with pattern 0xaa: done\nReading and comparing: done\nTesting with pattern 0x55: done\nReading and comparing: done\nTesting with pattern 0xff: 22.93% done, 4:09:55 elapsed. (0/0/0 errors)\n[...]\nTesting with pattern 0x00: done\nReading and comparing: done\nPass completed, 0 bad blocks found. (0/0/0 errors)\n```\n\nOpções:\n\nOpções adicionais que você pode considerar:\n\n"
    },
    {
      "title": "Defina padrão de teste específico",
      "level": 4,
      "content": "Da página man: \"O padrão_de_teste pode ser um valor numérico entre 0 e um ULONG_MAX-1 inclusive [...].\"\n\nPode-se fazer com que blocos defeituosos sejam repetidamente gravados com um único \"padrão aleatório\" com a opção -t random.\n\n```\n# badblocks -wsv -t random /dev/dispositivo\n```\n\n```\nChecking for bad blocks in read-write mode\nFrom block 0 to 488386583\nTesting with random pattern: done\nReading and comparing: done\nPass completed, 0 bad blocks found. (0/0/0 errors)\n```\n\n"
    },
    {
      "title": "Teste de leitura-gravação (não-destrutivo)",
      "level": 3,
      "content": "Este teste foi projetado para dispositivos com dados já existentes. Um teste de leitura-gravação não destrutivo faz um backup do conteúdo original de um setor antes de testar com um único padrão aleatório e, em seguida, restaura o conteúdo do backup. Este é um teste de passagem única e é útil como um teste de manutenção geral.\n\n```\n# badblocks -nsv /dev/dispositivo\n```\n\n```\nChecking for bad blocks in non-destructive read-write mode\nFrom block 0 to 488386583\nChecking for bad blocks (non-destructive read-write test)\nTesting with random pattern: done\nPass completed, 0 bad blocks found. (0/0/0 errors)\n```\n\nA opção -n significa um teste de leitura-gravação não destrutivo.\n\n"
    },
    {
      "title": "Faça o sistema de arquivos incorporar setores ruins",
      "level": 2,
      "content": "Para não usar setores defeituosos, eles devem ser conhecidos pelo sistema de arquivos.\n\n"
    },
    {
      "title": "Durante a verificação de sistema de arquivos",
      "level": 3,
      "content": "A incorporação de setores defeituosos pode ser feita usando o utilitário de verificação do sistema de arquivos (fsck). Pode-se dizer ao fsck para usar badblocks durante um teste. Para fazer um teste leitura-gravação (não destrutivo) e ter os setores defeituosos tornados conhecidos para o sistema de arquivos:\n\n```\n# fsck -vcck /dev/dispositivo-PARTIÇÃO\n```\n\nA opção -cc fala para executar fsck no modo de teste não-destrutivo, o -v diz ao fsck para mostre sua saída, e a opção -k preserva setores defeituosos antigos que foram detectados.\n\nPara fazer um teste somente leitura (não recomendado):\n\n```\n# fsck -vck /dev/dispositivo-PARTIÇÃO\n```\n\n"
    },
    {
      "title": "Antes da criação do sistema de arquivos",
      "level": 3,
      "content": "Como alternativa, isso pode ser feito antes da criação do sistema de arquivos.\n\nSe badblocks for executado sem a opção -o, os setores defeituosos serão impressos apenas no stdout.\n\nExemplo de saída para erros de leitura no começo do disco:\n\n```\n# badblocks -wsv /dev/dispositivo\n```\n\n```\n[...]\nTesting with pattern 0xff: done\nReading and comparing:\n[...]\n37584\n37585 0.84% done, 7:31:08 elapsed. (0/0/527405 errors)\n37586\n[...]\ndone\nTesting with pattern 0x00:\nReading and comparing:\n[...]\n37584\n37585\n[...]\ndone\nPass completed, 527405 bad blocks found. (0/0/527405 errors)\n```\n\nPara passar confortavelmente a saída de erro de badblocks para o sistema de arquivos, deve-se gravar em um arquivo.\n\n```\n# badblocks -wsv -o /root/badblocks.txt /dev/dispositivo\n```\n\n```\nChecking for bad blocks in read-write mode\nFrom block 0 to 488386583\nTesting with pattern 0xaa: done\nReading and comparing:   6.36% done, 0:51 elapsed. (0/0/14713 errors)\n[...]\nTesting with pattern 0x00: done\nReading and comparing: done\nPass completed, 527405 bad blocks found. (0/0/527405 errors)\n```\n\nEntão, (re)crie o sistema de arquivos com a informação:\n\n```\n# mkfs.tipo-sistema-de-arquivos -l /root/badblocks.txt /dev/dispositivo\n```\n\n"
    },
    {
      "title": "Ext4",
      "level": 4,
      "content": "Da página de manual mke2fs(8):\n\nEntão, o método recomendado é usar:\n\n```\n# mkfs.ext4 -c /dev/dispositivo\n```\n\nUse -cc para fazer um teste de leitura-gravação de blocos defeituosos.\n\n"
    },
    {
      "title": "Tamanho do bloco",
      "level": 4,
      "content": "Primeiramente, encontre o tamanho de bloco do sistema de arquivos. Por exemplo, para sistemas de arquivos ext#:\n\n```\n# dumpe2fs /dev/dispositivo-PARTIÇÃO | grep 'Block size'\n```\n\nAlimente isso ao badblocks:\n\n```\n# badblocks -b tamanho de bloco\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Meu disco rígido tem setores defeituosos ou está desenvolvendo setores defeituosos ao longo do tempo (em inglês)\n\n"
    }
  ]
}