{
  "title": "Beginners' guide (Български)",
  "url": "https://wiki.archlinux.org/title/Beginners%27_guide_(%D0%91%D1%8A%D0%BB%D0%B3%D0%B0%D1%80%D1%81%D0%BA%D0%B8)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nТази страница е ръководство за исталирането на Arch Linux от “живия“ диск зареден от официалния инсталационен образ. Преди инсталиране е препорачително да погледнете често задаваните въпроси. За нормите използвани в този документ вижте Help:Reading. В частност , примери форматирани с курсив трябва да бъдат заменени.\n\nЗа по обстойни иструкции вижте съответните ArchWiki страници или man page ръководства на самите програми, връзки и за двете от които са налични на тази страница. При нужда от помощ може да се обърнете към чат-а или да оставите своите въпроси във форума.\n\nArch Linux би трябвало да работи на всяка x86_64 съвместима машина с поне 512 MB RAM. Основна инсталация с всички пакети от група base може да заеме по-малко от 800 MB of дисково пространство. Тъй като инсталационният процес трябва да вземе пакети от външни хранилища, това ръководство приема, че е налична работеща интернет връзка.\n\n"
    },
    {
      "title": "Преди инсталацията",
      "level": 2,
      "content": "Ще откриете инсталационния диск и съпътстващите го GnuPG подписи на Download страницата.\n\n"
    },
    {
      "title": "Проверете подписите",
      "level": 3,
      "content": "Преди да използвате диска е препоръчително да проверите подписите му, особено когато е свален от HTTP mirror, изтеглянията от който могат да бъдат променени.\n\nНа система с инсталиран GnuPG, го направете сваляйки PGP signature (под Checksums) в папката с ISO файла, и потвърждавайки го с gpg --keyserver pgp.mit.edu --keyserver-options auto-key-retrieve --verify archlinux-<версия>-x86_64.iso.sig.\n\nКато алтернатива, изпълнете pacman-key -v archlinux-<version>-x86_64.iso.sig от съществуваща Arch Linux инсталация като root.\n\n- Самият подпис може да бъде манипулиран ако е свален от mirror, от колкото от archlinux.org като отгоре. В този случай, потвърдете че публичният ключ, който се използва да се декодира подписа, е подписан от друг, достоверен ключ. Командата gpg ще ви даде отпечатъка на публичният ключ.\n- Друг начин да се потвърди автентичността на подписа е да се потвърди че отпечатъка на публичният ключ е същият като този използван от разработчикът на Arch Linux който е подписал ISO файлът. Вижте Wikipedia:Public-key_cryptography за повече информация за процесът с публични ключове за удостоверяване на ключове.\n\n"
    },
    {
      "title": "Включете живата среда",
      "level": 3,
      "content": "„Живата“ среда може да бъде включена от USB флашка, компакт диск или по мрежа с PXE. За други инсталационни начини, вижте Category:Installation process.\n\n- За да изберете носителя с Arch, вероятно трябва да натиснете клавиш по време на автоматичения тест при включване. Погледнете ръководството на дънната платка на компютъра Ви за повече информация.\n- Щом се появи менюто на Arch, изберете Boot Arch Linux и натиснете Enter за да влезете в инсталационната среда.\n- Вижте README.bootparams за списък с boot параметри, и x86_64 за списък с включените пакети.\n\nЩе бъдете логнати в първата виртуална конзола като root потребител със Zsh шел.\n\nЗа да смените с друга конзола — например, за да видите това ръководство с ELinks по време на инсталацията — натиснете клавишната комбинация Alt+стрелка. За да редактирате конфигурационни файлове, използвайте nano, vi или vim.\n\n"
    },
    {
      "title": "Изберете клавиатурна подредба",
      "level": 3,
      "content": "Първоначално избраната конзолна клавиатурна подредба е US. Други достъпни оформления могат да бъдат изброени с:\n\n```\n# ls /usr/share/kbd/keymaps/**/*.map.gz\n```\n\nЗа да промените клавиатурата добавете името на файла ѝ към loadkeys(1), пропускайки пътя и разширението. Например, за да изберете германска клавиатурна подредба:\n\n```\n# loadkeys de-latin1\n```\n\nКонзолните шрифтове се намират в /usr/share/kbd/consolefonts/ и се избират със setfont(8).\n\n"
    },
    {
      "title": "Проверете boot режима",
      "level": 3,
      "content": "Ако е избран UEFI режим на UEFI дънна платка, Archiso ще включи Arch Linux чрез systemd-boot. За да проверите това, проверете efivars директорията:\n\n```\n# ls /sys/firmware/efi/efivars\n```\n\nАко директорията не съществува, системата може да зареди в BIOS или CSM режим. Проверете ръководството на дънната ви платка за детайли.\n\n"
    },
    {
      "title": "Свързване с интернет",
      "level": 3,
      "content": "Инсталационният образ включва dhcpcd за жична връзка при включване. Връзката може да бъде потвърдена с ping:\n\n```\n# ping archlinux.org\n```\n\nАко връзка не е достъпна, stop dhcpcd със systemctl stop dhcpcd@interface където interface може да бъде tab-completed. Продължете с настройването на мрежата според Network configuration.\n\n"
    },
    {
      "title": "Обновяване на системния часовник",
      "level": 3,
      "content": "Използвайте timedatectl(1) за да се уверите, че системният часовник е точен:\n\n```\n# timedatectl set-ntp true\n```\n\nЗа да проверите състоянието на услугата, използвайте timedatectl status.\n\n"
    },
    {
      "title": "Разделяне на дялове",
      "level": 3,
      "content": "Разпознатите от системата твърдите дискове са показани като /dev/sda или /dev/nvme0n1 (block устройства). За да ги видите използвайте lsblk или fdisk.\n\n```\n# fdisk -l\n```\n\nРезултати завършващи на rom, loop или airoot могат да бъдат игнорирани.\n\nСледните дялове са необходими за избраното устройство:\n\n- Един дял за root директорията /.\n- Ако UEFI е включено, и системен дял.\n\nЗа да промените таблицата на дяловете, използвайте fdisk или parted.\n\n```\n# fdisk /dev/sda\n```\n\nВижте Partitioning за повече информация.\n\n"
    },
    {
      "title": "Форматиране на дяловете",
      "level": 3,
      "content": "Щом дяловете са създадени, всеки трябва да бъде форматиран в съответната файлова система. Например, за да форматирате дяла root на /dev/sda1 с ext4, използвайте:\n\n```\n# mkfs.ext4 /dev/sda1\n```\n\nАко създадохте дял за swap (например /dev/sda3), включете го с mkswap:\n\n```\n# mkswap /dev/sda3\n# swapon /dev/sda3\n```\n\nВижте Създаване на файлова система за детайли.\n\n"
    },
    {
      "title": "Включване на файловите системи",
      "level": 3,
      "content": "Включете файловата система на дяла root към /mnt, например:\n\n```\n# mount /dev/sda1 /mnt\n```\n\nСъздайте точки на качване за други дялове и ги включете подобаващо:\n\n```\n# mkdir /mnt/boot\n# mount /dev/sda2 /mnt/boot\n```\n\ngenfstab(8) ще открие качени файлови системи и суап място.\n\n"
    },
    {
      "title": "Избиране на източник",
      "level": 3,
      "content": "Исталационните пакети трябва да бъдат изтеглени от mirror сървъри, които са описани в /etc/pacman.d/mirrorlist. На “живата“ система, всички източници са включени и подредени по скорост и времето необходимо за синхронизирането им, когато е бил създаден инсталационният образ.\n\nКолкото по-високо в списъка е източник, толкова по-скоро ще бъде използван при сваляне на пакет. Вероятно бихте искали да редактирате файла, като преместите географски по-близките източници най-горе в списъка, въпреки че и други фактори могат да повлият.\n\nПо-късно този файл ще бъде копиран от pacstrap, затова е добре да ги подредите правилно.\n\n"
    },
    {
      "title": "Инсталиране на основни пакети",
      "level": 3,
      "content": "Използвайте скрипта pacstrap(8) за да инсталирате групата base пакети:\n\n```\n# pacstrap /mnt base\n```\n\nТази група не включва всичко налично на “живата“ инсталация, като btrfs-progs или определени безжични фърмуеари; вижте включените пакети за сравнение.\n\nЗа да инсталирате пакети и други групи като base-devel, добавете имената им след pacstrap (разделени с интервал) или с индивидуални pacman команди след стъпката #Chroot.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Генерирайте fstab файл (използвайте -U или -L за UUID или надпис):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nСлед това проверете съдържанието на изходящия файл в /mnt/etc/fstab и редактирайте в случай на грешка.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Change root в новата система:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Времева зона",
      "level": 3,
      "content": "Настройте времевата зона с:\n\n```\n# ln -sf /usr/share/zoneinfo/Region/City /etc/localtime\n```\n\nИзползвайте hwclock(8) за да създадете /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nТази команда очаква часовника на устройството да бъде UTC. Вижте System time#Time standard за детайли.\n\n"
    },
    {
      "title": "Локализиране",
      "level": 3,
      "content": "Махнете # пред en_US.UTF-8 UTF-8, както и от други нужни локализации в /etc/locale.gen и ги създайте с командата:\n\n```\n# locale-gen\n```\n\nНастройте променливата LANG в locale.conf(5), например:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_US.UTF-8\n```\n\nАко сте променили подредбата на конзолната клавиатура, може да направите промените постоянни във vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=de-latin1\n```\n\n"
    },
    {
      "title": "Настройване на мрежи",
      "level": 3,
      "content": "Създайте hostname файла:\n\n```\n/etc/hostname\n```\n\n```\nмоето-хост-име\n```\n\nДобавете го и в hosts(5) файла:\n\n```\n/etc/hosts\n```\n\n```\n127.0.0.1\tlocalhost\n::1\t\tlocalhost\n127.0.1.1\tмоето-хост-име.localdomain\tмоето-хост-име\n```\n\nАко системата е с постоянен IP адрес, то той трябва да бъде използван вместо 127.0.1.1.\n\nЗавършете мрежовото настройване на току що инсталираната среда.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Съдаването на нов initramfs обикновено не е необходимо, защото mkinitcpio е бил задействан от инсталирането на пакета linux при извършването на pacstrap скрипта.\n\nПри специални случаи, променете mkinitcpio.conf(5) файла и създайте initramfs образ с командата:\n\n```\n# mkinitcpio -p linux\n```\n\n"
    },
    {
      "title": "Root парола",
      "level": 3,
      "content": "Създайте root парола с:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Boot loader",
      "level": 3,
      "content": "Linux-съвместим boot loader трябва да бъде инталиран за да включите Arch Linux. Вижте Arch boot process#Boot loader за да изберете някой от предоставените.\n\nАко разполагате с Intel или AMD процесор, включете microcode обновления.\n\n"
    },
    {
      "title": "Рестартиране",
      "level": 2,
      "content": "Напуснете chroot средата като напишете exit или като натиснете Ctrl+D.\n\nСъщо така може да изключите всички дялове с umount -R /mnt: това позволява да забележите \"заети\" дялове, ако има такива и да намерите причината за това с командата fuser(1).\n\nНакрая рестартирайте машината като напишете reboot: всеки все още включен дял ще бъде автоматично изключен от systemd. Не забравяйте да извадите инсталационния носител, след което се впишете в новата система с root потребителя.\n\n"
    },
    {
      "title": "След инсталиране",
      "level": 2,
      "content": "Вижте основни препоръки за насоки в поддръжка и след инсталационни ръководства (като включване на графична среда, звук или тъчпад).\n\nЗа списък с програми, които биха ви заинтересовали, вижте List of applications.\n\n"
    }
  ]
}