{
  "title": "Beginners' Guide/Post-Installation (Ελληνικά)",
  "url": "https://wiki.archlinux.org/title/Beginners%27_Guide/Post-Installation_(%CE%95%CE%BB%CE%BB%CE%B7%CE%BD%CE%B9%CE%BA%CE%AC)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Αυτό το άρθρο χρειάζεται μετάφραση.** Αυτό το άρθρο χρειάζεται μετάφραση.\n\nΑυτό το άρθρο χρειάζεται μετάφραση.\n\nΑυτό το άρθρο θα σας οδηγήσει στη διαδικασία εγκατάστασης του Arch Linux χρησιμοποιώντας το επίσημο iso αρχείο. Πριν την εγκατάσταση, προτείνεται να συμβουλευτείτε το FAQ.\n\nΤο Arch wiki το οποίο διατηρείται από την κοινότητα είναι μία πολύ καλή πηγή και θα πρέπει να είναι το πρώτο που συμβουλεύεστε. Το κανάλι στο IRC (ircs://irc.libera.chat/archlinux), και τα forums είναι επίσης διαθέσιμα αν η απάντηση δεν μπορεί να βρεθεί αλλού. Επίσης, καλό είναι να βλέπετε και τις man σελίδες για όποια εντολή δεν ξέρετε καλά· αυτό μπορεί να γίνει καλώντας την man εντολή.\n\n"
    },
    {
      "title": "Αποκτήστε το iso εγκατάστασης",
      "level": 3,
      "content": "Επισκεφθείτε τη σελίδα λήψης και, ανάλογα με τον τρόπο με τον οποίο θέλετε να εκκινήσετε, αποκτήστε το αρχείο ISO ή μια <<εικόνα>> netboot και την αντίστοιχη υπογραφή GnuPG.\n\n"
    },
    {
      "title": "Επαλήθευση υπογραφής",
      "level": 3,
      "content": "Συνιστάται να επαληθεύσετε την υπογραφή του iso πριν από τη χρήση, ειδικά κατά τη λήψη από ένα καθρέφτη HTTP, όπου οι λήψεις είναι συνήθως επιρρεπείς σε υποκλοπή και επιδίδουν κακόβουλα iso.\n\nΣε ένα σύστημα με εγκατεστημένο το GnuPG, μπορείτε να επαληθεύσετε κατεβάζοντας την υπογραφή PGP (στην ενότητα Checksums στη σελίδα λήψης) στον κατάλογο ISO και επαληθεύστε με την εντολή:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nΕναλλακτικά, από μια υπάρχουσα εγκατάσταση Arch Linux εκτελέστε:\n\n```\n$ pacman-key -v archlinux-version-x86_64.iso.sig\n```\n\n- Η ίδια η υπογραφή θα μπορούσε να παραποιηθεί εάν ληφθεί από έναν αλλον ιστότοπο καθρέφτη (mirror site), αντί από το archlinux.org όπως παραπάνω. Σε αυτήν την περίπτωση, βεβαιωθείτε ότι το δημόσιο κλειδί, το οποίο χρησιμοποιείται για την αποκωδικοποίηση της υπογραφής, είναι υπογεγραμμένο από άλλο, αξιόπιστο κλειδί. Η εντολή gpg θα εμφανίσει το αποτύπωμα του δημόσιου κλειδιού.\n- Μια άλλη μέθοδος για την επαλήθευση της αυθεντικότητας της υπογραφής είναι να διασφαλιστεί ότι το αποτύπωμα του δημόσιου κλειδιού είναι ίδιο με το αποτύπωμα του κλειδιού του προγραμματιστή Arch Linux που υπέγραψε το ISO- αρχείο. Ανατρέξτε στο Wikipedia:Public-key cryptography για περισσότερες πληροφορίες σχετικά με τη διαδικασία δημόσιου κλειδιού για τον έλεγχο ταυτότητας κλειδιών.\n\n"
    },
    {
      "title": "Προετοιμασία μέσου εγκατάστασης",
      "level": 3,
      "content": "Το iso εγκατάστασης μπορεί να εκκινήσει στον υπολιγιστή προορισμού μέσω USB flash drive, optical disc ή δίκτυου με PXE: ακολουθήστε το κατάλληλο άρθρο για να προετοιμάσετε ένα μέσο εγκατάστασης από το επιλεγμένο iso.\n\n"
    },
    {
      "title": "Εκκίνηση του <<ζωντανού>> (live) συστήματος",
      "level": 3,
      "content": "1. Υποδείξτε την τρέχουσα συσκευή εκκίνησης προς αυτήν που διαθέτει το μέσο εγκατάστασης Arch Linux. Συνήθως επιτυγχάνεται πατώντας ένα πλήκτρο κατά τη φάση POST, όπως υποδεικνύεται στην οθόνη splash. Ανατρέξτε στο εγχειρίδιο της μητρικής πλακέτας σας για λεπτομέρειες.\n1. Όταν εμφανιστεί το μενού φόρτωσης εκκίνησης του μέσου εγκατάστασης, επιλέξτε Arch Linux install medium και πατήστε Enter για να εισέλθετε στο περιβάλλον εγκατάστασης.Συμβουλή: Η εικόνα εγκατάστασης χρησιμοποιεί systemd-boot για εκκίνηση σε λειτουργία UEFI και syslinux για εκκίνηση σε λειτουργία BIOS. Ανατρέξτε στο README.bootparams για μία λίστα boot parameters.\n1. Θα συνδεθείτε στην πρώτη virtual console ως χρήστης root και θα εμφανιστεί το shell prompt Zsh.\n\nΓια να μεταβείτε σε διαφορετική κονσόλα — για παράδειγμα, για να δείτε αυτόν τον οδηγό με το Lynx παράλληλα με την εγκατάσταση — χρησιμοποιήστε το Alt + arrow shortcut. Για επεξεργαστείτε αρχεία διαμόρφωσης, mcedit(1), nano και vim είναι διαθέσιμα. Ανατρέξτε στο package.x86_64 για μια λίστα με τα πακέτα που περιλαμβάνονται στο μέσο εγκατάστασης.\n\n"
    },
    {
      "title": "Ορισμός διάταξης πληκτρολογίου",
      "level": 3,
      "content": "Το προεπιλεγμένο console keymap είναι US. Οι διαθέσιμες διατάξεις μπορούν να απαριθμηθουν με την εντολή:\n\n```\n# localectl list-keymaps\n```\n\nΓια να τροποποιήσετε τη διάταξη, προσθέστε ένα αντίστοιχο όνομα αρχείου στο loadkeys(1), παραλείποντας τη διαδρομή και την επέκταση αρχείου. Για παράδειγμα, για να ορίσετε μια διάταξη πληκτρολογίου German, χρησιμοποιήστε την παρακάτω εντολή:\n\n```\n# loadkeys de-latin1\n```\n\nΤα Console fonts βρίσκονται στο /usr/share/kbd/consolefonts/ και μπορούν επίσης να ρυθμιστούν με το setfont(8), παραλείποντας το μονοπάτι και την επέκταση αρχείου. Για παράδειγμα, για την χρησιμοποίηση μίας από τις μεγαλύτερες γραμματοσειρές, κατάλληλη για οθόνες HiDPI, εκτελέστε την ακόλουθη εντολή:\n\n```\n# setfont ter-132b\n```\n\n"
    },
    {
      "title": "Επαλήθευση της λειτουργίας εκκίνησης",
      "level": 3,
      "content": "Για να επαληθεύσετε τη λειτουργία εκκίνησης, ελέγξτε το UEFI bitness με την εντολή:\n\n```\n# cat /sys/firmware/efi/fw_platform_size\n```\n\nΕάν η εντολή επιστρέφει τον αριθμό 64, τότε το σύστημα εκκινείται σε λειτουργία UEFI και είναι 64-bit x64 UEFI. Εάν η εντολή δίνει τον αριθμό 32, το σύστημα εκκινείται σε λειτουργία UEFI, και ειδικότερα 32-bit IA32 UEFI. Αν και αυτή η λειτουργία υποστηρίζεται, ίσως περιορίσει τις δυνατότητες επιλογής boot loader, μόνο σε systemd-boot.\n\nΣε περίπτωση που ο κατάλογος δεν υπάρχει, το σύστημα ίσως να εκκινεί σε BIOS (ή CSM). Εάν το σύστημα δεν ξεκίνησε στη λειτουργία που θέλετε (UEFI vs BIOS), ανατρέξτε στο εγχειρίδιο της μητρικής πλακέτας.\n\n"
    },
    {
      "title": "Σύνδεση στο διαδίκτυο",
      "level": 3,
      "content": "Για να ρυθμίσετε μια σύνδεση δικτύου, ακολουθήστε τα παρακάτω βήματα:\n\n- Βεβαιωθείτε ότι το network interface σας εμφανίζεται και είναι ενεργοποιημένο, για παράδειγμα με ip-link(8): # ip link\n- Για ασύρματα, βεβαιωθείτε ότι η ασύρματη κάρτα δεν είναι αποκλεισμένη με rfkill.\n- Σύνδεση στο δίκτυο: Ethernet — συνδέστε το καλώδιο. Wi-Fi — έλεγχος ταυτότητας στο ασύρματο δίκτυο χρησιμοποιώντας το iwctl.\n- Διαμορφώστε τη σύνδεση δικτύου σας: DHCP: η δυναμική διεύθυνση IP και η εκχώρηση διακομιστή DNS (παρέχονται από systemd-networkd και systemd-resolved) θα πρέπει να είναι έτοιμα για χρήση για τα wired και ασύρματο interfaces δικτύου.\n- Η σύνδεση μπορεί να επαληθευτεί με την εντολή ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernet — συνδέστε το καλώδιο.\n- Wi-Fi — έλεγχος ταυτότητας στο ασύρματο δίκτυο χρησιμοποιώντας το iwctl.\n\n- DHCP: η δυναμική διεύθυνση IP και η εκχώρηση διακομιστή DNS (παρέχονται από systemd-networkd και systemd-resolved) θα πρέπει να είναι έτοιμα για χρήση για τα wired και ασύρματο interfaces δικτύου.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Ενημέρωση του ρολογιού συστήματος",
      "level": 3,
      "content": "Σε live περιβάλλον, το systemd-timesyncd είναι ενεργοποιημένο ως προεπιλογή και η ώρα θα συγχρονιστεί αυτόματα όταν το σύστημα συνδεθεί με το διαδίκτυο.\n\nΧρησιμοποιήστε το timedatectl(1) για να βεβαιωθείτε ότι το ρολόι συστήματος είναι ακριβές:\n\n```\n# timedatectl\n```\n\nΓια να ελέγξετε την κατάσταση του service , χρησιμοποιήστε το timedatectl status.\n\n"
    },
    {
      "title": "Διαμόρφωση δίσκων (Partitioning)",
      "level": 3,
      "content": "Όταν αναγνωρίζονται από το live σύστημα, οι δίσκοι εκχωρούνται σε block device όπως για παραδειγμα /dev/sda, /dev/nvme0n1 ή /dev/mmcblk0. Για να προσδιορίσετε αυτές τις συσκευές, χρησιμοποιήστε lsblk ή fdisk.\n\n```\n# fdisk -l\n```\n\nΤα αποτελέσματα με κατάληξη σε rom, loop ή airootfs μπορούν να αγνοηθούν. Συσκευές mmcblk* με κατάληξη σε rpbm, boot0 και boot1 μπορούν να αγνοηθούν.\n\nΤα ακόλουθα partitions απαιτούνται για μια επιλεγμένη συσκευή:\n\n- Ένα partition για το root directory /.\n- Για εκκίνηση σε λειτουργία UEFI: EFI system partition.\n\nΕάν θέλετε να δημιουργήσετε stacked block devices για LVM, system encryption ή RAID, κάντε το τώρα.\n\n"
    },
    {
      "title": "Παράδειγμα διατάξεων",
      "level": 4,
      "content": "Table content:\nMount point | Partition | Partition type | Προτεινόμενο μέγεθος\n/mnt | /dev/sdX1 | Linux | Υπόλοιπος χώρος συσκευής\n[SWAP] | /dev/sdX2 | Linux swap | Περισσότερα από 512 MiB\n\nTable content:\nMount point | Partition | Partition type | Suggested size\n/mnt/boot ή /mnt/efi | /dev/sdX1 | EFI system partition | Τουλάχιστον 300 MiB. Αν εγκατασταθούν πολλαπλοί πυρήνες, τότε όχι λιγότερο από 1 GiB.\n/mnt | /dev/sdX2 | Linux x86-64 root (/) | Υπόποιπος χώρος συστευής\n[SWAP] | /dev/sdX3 | Linux swap | Περισσότερα από 512 MiB\n\nΔείτε επίσης Partitioning#Example layouts.\n\n- Χρησιμοποιήστε το fdisk ή το parted για να τροποποιήσετε τα partition tables, για παράδειγμα fdisk /dev/sdX.\n- Ο χώρος Swap μπορεί να ρυθμιστεί σε swap file για file systems που το υποστηρίζουν.\n\n"
    },
    {
      "title": "Διαμόρφωση των partitions",
      "level": 3,
      "content": "Μόλις δημιουργηθούν τα partitions, το καθένα πρέπει να διαμορφοθεί με ένα κατάλληλο file system. Για παράδειγμα, εάν το root partition είναι στο /dev/sdX1 και θα περιέχει το σύστημα αρχείων Ext4, εκτελέστε:\n\n```\n# mkfs.ext4 /dev/sdX1\n```\n\nΕάν δημιουργήσατε partition για swap, αρχικοποιήστε το με mkswap(8):\n\n```\n# mkswap /dev/sdX2\n# swapon /dev/sdX2\n```\n\nΔείτε File systems#Create a file system για λεπτομέρειες.\n\n"
    },
    {
      "title": "Προσάρτηση των partitions",
      "level": 3,
      "content": "Mount το root partition στο /mnt. Για παράδειγμα, εάν ο τόμος root είναι /dev/\"root_partition\":\n\n```\n# mount /dev/root_partition /mnt\n```\n\nΔημιουργήστε τυχόν υπόλοιπα σημεία προσάρτησης (όπως /mnt/efi) χρησιμοποιώντας το mkdir(1) και προσαρτήστε τα αντίστοιχα partition.\n\nΤο genfstab(8) θα εντοπίσει αργότερα τα προσαρτημένα partitions και το swap.\n\n"
    },
    {
      "title": "Επιλογή των mirrors",
      "level": 3,
      "content": "Τα πακέτα που πρόκειται να εγκατασταθούν πρέπει να ληφθούν από mirror servers, τα οποία ορίζονται στο /etc/pacman.d/mirrorlist. Στο live σύστημα, μετά τη σύνδεση στο Διαδίκτυο, το reflector ενημερώνει τη λίστα καθρεφτών επιλέγοντας 70 πιο πρόσφατα συγχρονισμένα HTTPS mirrors και ταξινομώντας τους με τον ρυθμό λήψης. /etc/systemd/system/reflector.service\n\nΌσο υψηλότερα τοποθετείται ένα mirror στη λίστα, τόσο μεγαλύτερη προτεραιότητα δίνεται κατά τη λήψη ενός πακέτου. Μπορεί να θέλετε να ελέγξετε το αρχείο για να δείτε εάν είναι ικανοποιητικό. Εάν δεν είναι, επεξεργαστείτε το αρχείο ανάλογα και μετακινήστε τους γεωγραφικά πιο κοντινούς καθρέφτες στην κορυφή της λίστας, αν και πρέπει να ληφθούν υπόψη και άλλα κριτήρια.\n\nΑυτό το αρχείο θα αντιγραφεί αργότερα στο νέο σύστημα από το pacstrap, οπότε αξίζει να γίνει σωστό.\n\n"
    },
    {
      "title": "Εγκατάσταση <<ζωτικών>> πακέτων",
      "level": 3,
      "content": "Χρησιμοποιήστε το pacstrap(8) script για να εγκαταστήσετε τα πακέτα base, Linux kernel και firmware για κοινό υλικό:\n\n```\n# pacstrap -K /mnt base linux linux-firmware\n```\n\n- Μπορείτε να αντικαταστήσετε το linux με ένα πακέτο kernel της επιλογής σας, ή θα μπορούσατε να το παραλείψετε εντελώς κατά την εγκατάσταση σε container.\n- Θα μπορούσατε να παραλείψετε την εγκατάσταση του πακέτου firmware κατά την εγκατάσταση σε εικονική μηχανή ή container.\n\nΤο πακέτο base δεν περιλαμβάνει όλα τα εργαλεία από τη ζωντανή εγκατάσταση, επομένως η εγκατάσταση άλλων πακέτων μπορεί να είναι απαραίτητη για ένα πλήρως λειτουργικό βασικό σύστημα. Συγκεκριμένα, σκεφτείτε να εγκαταστήσετε:\n\n- userpace βοηθητικά προγράμματα για τη διαχείριση των file systems που θα χρησιμοποιηθούν στο σύστημα,\n- βοηθητικά προγράμματα για πρόσβαση σε partitions RAID ή LVM,\n- συγκεκριμένο firmware για άλλες συσκευές που δεν περιλαμβάνονται στο linux-firmware,\n- απαραίτητο λογισμικό για networking,\n- ένα text editor,\n- πακέτα για πρόσβαση στα εγχειρίαδια man και info: man-db, man-pages και texinfo.\n\nΓια να εγκαταστησετε άλλα πακέτα ή ομάδες πακέτων, προσθέστε τα ονόματα στην εντολή \"pacstrap\" παραπάνω (διαχωρισμένο με κενό διάστημα) ή χρησιμοποιήστε το pacman ενώ chroot στο νέο σύστημα. Για σύγκριση, τα πακέτα που είναι διαθέσιμα στο ζωντανό σύστημα μπορείτε να βρείτε στο package.x86_64.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Δημιουργήστε ένα αρχείο fstab (χρησιμοποιήστε το -U ή το -L για να ορίσετε σύμφωνα με UUID ή ετικέτες, αντίστοιχα):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nΕλέγξτε το αρχείο /mnt/etc/fstab που προκύπτει και επεξεργαστείτε το σε περίπτωση σφαλμάτων.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Change root στο καινουργιο σύστημα:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Ζώνη ώρας",
      "level": 3,
      "content": "Ορίστε το ζώνη ώρας:\n\n```\n# ln -sf /usr/share/zoneinfo/Region/City /etc/localtime\n```\n\nΕκτελέστε το hwclock(8) για να δημιουργήσετε /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nΑυτή η εντολή προϋποθέτει ότι το ρολόι υλικού έχει ρυθμιστεί σε UTC. Για λεπτομέρειες, ανατρέξτε στο System time#Time standard.\n\n"
    },
    {
      "title": "Localization",
      "level": 3,
      "content": "Επεξεργαστείτε το /etc/locale.gen και αφαιρέστε το σχόλιο (uncomment) από το en_US.UTF-8 UTF-8 και άλλα απαραίτητα locales. Δημιουργήστε τις τοπικές ρυθμίσεις εκτελώντας:\n\n```\n# locale-gen\n```\n\nΔημιουργήστε το αρχείο locale.conf(5) και set the LANG variable ανάλογα:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_US.UTF-8\n```\n\nΕάν ορίσετε τη διάταξη πληκτρολογίου, κάντε τις αλλαγές μόνιμες στο vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=de-latin1\n```\n\n"
    },
    {
      "title": "Network configuration",
      "level": 3,
      "content": "Δημιουργήστε το αρχείο hostname:\n\n```\n/etc/hostname\n```\n\n```\nmyhostname\n```\n\nΠροσθέστε αντίστοιχες καταχωρήσεις στο hosts(5):\n\n```\n/etc/hosts\n```\n\n```\n127.0.0.1\tlocalhost\n::1\t\tlocalhost\n127.0.1.1\tmyhostname.localdomain\tmyhostname\n```\n\nΕάν το σύστημα έχει μόνιμη διεύθυνση IP, θα πρέπει να χρησιμοποιείται αντί για 127.0.1.1.\n\nΟλοκληρώστε το network configuration για το πρόσφατα εγκατεστημένο περιβάλλον, που περιλαμβάνει την εγκατάσταση του προτιμώμενου λογισμικού network management.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Η δημιουργία ενός νέου initramfs συνήθως δεν απαιτείται, επειδή το mkinitcpio εκτελέστηκε κατά την εγκατάσταση του πακέτου kernel με το pacstrap.\n\nΓια LVM, system encryption ή RAID, τροποποιήστε το mkinitcpio.conf(5) και αναδημιουργήστε την \"εικόνα\" initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Root password",
      "level": 3,
      "content": "Ορίστε password για τον root (χρήστη):\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Εγκατάσταση του bootloader",
      "level": 2,
      "content": "Επιλέξτε και εγκαταστήστε έναν boot loader που μπορεί να ξεκινήσει το Linux. Εάν διαθέτετε CPU Intel ή AMD, ενεργοποιήστε επιπλέον τις ενημερώσεις microcode.\n\n"
    },
    {
      "title": "Reboot",
      "level": 2,
      "content": "Βγείτε από το περιβάλλον chroot πληκτρολογώντας exit ή πατώντας Ctrl + d.\n\nΠροαιρετικά, αποπροσαρτήστε με μη αυτόματο τρόπο όλα τα partitions με umount -R /mnt: αυτό επιτρέπει να παρατηρήσετε τυχόν \"απασχολημένα\" partitions και να εντοπίσετε την αιτία με το fuser(1).\n\nΤέλος, επανεκκινήστε τον υπολογιστή πληκτρολογώντας reboot: τυχόν partitions που είναι ακόμα τοποθετημένα θα αποσυνδεθούν αυτόματα από το \"systemd\". Θυμηθείτε να καταργήσετε το μέσο εγκατάστασης και μετά να συνδεθείτε στο νέο σύστημα με τον λογαριασμό root.\n\n"
    },
    {
      "title": "Μετά την εγκατάσταση",
      "level": 2,
      "content": "Ανατρέξτε στο General recommendations (Ελληνικά) για οδηγίες διαχείρισης συστήματος και post-installation οδηγίες (όπως ρύθμιση γραφικής διεπαφής χρήστη, ήχου ή επιφάνειας αφής(touchpad)).\n\nΓια μια λίστα εφαρμογών που μπορεί να σας ενδιαφέρουν, δείτε List of applications.\n\n"
    },
    {
      "title": "Διαμόρφωση του pacman",
      "level": 2,
      "content": "Επεξεργαστείτε το /etc/pacman.conf και διαμορφώστε τις επιλογές του pacman, ενεργοποιώντας επίσης όσα repositories χρειάζεστε.\n\nΔείτε το pacman (Ελληνικά) και το Official repositories για λεπτομέρειες.\n\n"
    },
    {
      "title": "Ενημέρωση συστήματος",
      "level": 2,
      "content": "Σε αυτό το σημείο πρέπει να ενημερώσετε το σύστημά σας.\n\nΔείτε το Upgrading packages για οδηγίες.\n\n"
    },
    {
      "title": "Προσθήκη χρήστη",
      "level": 2,
      "content": "Τέλος, προσθέστε έναν κανονικό χρήστη όπως περιγράφεται στο User management.\n\n"
    }
  ]
}