{
  "title": "Block device (Español)",
  "url": "https://wiki.archlinux.org/title/Block_device_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-08** \n\nArtículos relacionados\n\n- Nombrado de dispositivo de bloque persistente\n\nDe Wikipedia:\n\nEn Linux están en el directorio /dev, de acuerdo con el Estándar de jerarquía del sistema de archivos.\n\nEn Arch Linux los nodos del dispositivo son gestionados por udev.\n\n"
    },
    {
      "title": "Dispositivos de bloque",
      "level": 2,
      "content": "Un dispositivo de bloque es un archivo especial que proporciona acceso en búfer a un dispositivo de hardware. Para obtener una descripción detallada y una comparación de los dispositivos del sistema de archivos virtual, véase Wikipedia:es:Archivo de dispositivo#Dispositivos orientados a bloques.\n\n"
    },
    {
      "title": "Nombres de dispositivos de bloque",
      "level": 3,
      "content": "El comienzo del nombre del dispositivo especifica el subsistema del controlador utilizado por el kernel para operar el dispositivo de bloque.\n\n"
    },
    {
      "title": "SCSI",
      "level": 4,
      "content": "Los dispositivos de almacenamiento, como discos duros, SSD y unidades USB, que soporten las órdenes SCSI (SCSI, SAS, UASP), ATA (PATA, SATA) o USB de almacenamiento masivo son gestionados por el subsistema SCSI del kernel. Todos ellos comparten el mismo esquema de nombres.\n\nEl nombre de estos dispositivos comienza con sd. Luego le sigue una letra minúscula que comienza en a para el primer dispositivo descubierto (sda), b para el segundo dispositivo descubierto (sdb ), y así sucesivamente. Las particiones existentes en cada dispositivo se mostrarán con el número que le es asignado en la tabla de particiones, por ejemplo sda1 para la partición (1), sda2 para la partición (2), y así sucesivamente.\n\nResumen:\n\n- /dev/sda - dispositivo a, el primer dispositivo descubierto.\n- /dev/sda1 - partición 1 en el dispositivo a.\n- /dev/sde - dispositivo e, el quinto dispositivo descubierto.\n- /dev/sde7 - partición 7 en el dispositivo e.\n\n"
    },
    {
      "title": "NVMe",
      "level": 4,
      "content": "El nombre de los dispositivos de almacenamiento, como los SSDs, que son conectados través de NVM Express (NVMe) comienza con nvme. Luego le sigue un número comenzando desde 0 para el controlador del dispositivo, nvme0 para el primer controlador NVMe descubierto, nvme1 para el segundo y así sucesivamente. Lo siguiente es la letra \"n\" y un número que comienza desde 1 que expresa el dispositivo en un controlador, es decir, nvme0n1 para el primer dispositivo descubierto en el primer controlador descubierto, nvme0n2 para el segundo dispositivo descubierto en el primer controlador descubierto, y así sucesivamente. Las particiones existentes en cada dispositivo se mostrarán con la letra \"p\" y el número que le es asignado en la tabla de particiones. Por ejemplo, nvme0n1p1 para la partición con el número 1 en el primer dispositivo descubierto en el primer controlador descubierto, nvme0n1p2 para la partición 2, y así sucesivamente.\n\nResumen:\n\n- /dev/nvme0n1 - dispositivo 1 en el controlador 0, el primer dispositivo descubierto en el primer controlador descubierto.\n- /dev/nvme0n1p1 - partición 1 en el dispositivo 1 en el controlador 0.\n- /dev/nvme2n5 - dispositivo 5 en el controlador 2, el quinto dispositivo descubierto en el tercer controlador descubierto.\n- /dev/nvme2n5p7 - partición 7 en el dispositivo 5 en el controlador 2.\n\n"
    },
    {
      "title": "MMC",
      "level": 4,
      "content": "Las tarjetas SD y los dispositivos de almacenamiento eMMC son gestionados por el controlador mmc del kernel y nombra estos dispositivos empezando por mmcblk. Luego le sigue un número que comienza desde 0 para el dispositivo, es decir, mmcblk0 para el primer dispositivo descubierto, mmcblk1 para el segundo dispositivo descubierto, y así sucesivamente. Las particiones existentes en cada dispositivo se mostrarán con la letra \"p\" y el número que le es asignado en la tabla de particiones. La partición con el número 1 en la tabla de particiones sería mmcblk0p1, la partición con el número 2 sería mmcblk0p2, y así sucesivamente.\n\nResumen:\n\n- /dev/mmcblk0 - dispositivo 0, el primer dispositivo descubierto.\n- /dev/mmcblk0p1 - partición 1 en el dispositivo 0.\n- /dev/mmcblk4 - dispositivo 4, el quinto dispositivo descubierto.\n- /dev/mmcblk4p7 - partición 7 en el dispositivo 4.\n\n"
    },
    {
      "title": "Unidad de disco óptico SCSI",
      "level": 4,
      "content": "El nombre de unidades de disco óptico (ODDs), que se conecta utilizando una de las interfaces compatibles con el subsistema del controlador SCSI, comienza con sr. El nombre va seguido de un número que comienza desde 0 para el dispositivo, es decir. sr0 para el primer dispositivo descubierto, sr1 para el segundo dispositivo descubierto, y así sucesivamente.\n\nUdev también proporciona /dev/cdrom que es un enlace simbólico a /dev/sr0. El nombre siempre será cdrom independientemente de los tipos de disco admitidos en la unidad o del medio insertado.\n\nResumen:\n\n- /dev/sr0 - unidad de disco óptico 0, la primera unidad de disco óptico descubierta.\n- /dev/sr4 - unidad de disco óptico 4, la quinta unidad de disco óptico descubierta.\n- /dev/cdrom - un enlace simbólico a /dev/sr0.\n\n"
    },
    {
      "title": "lsblk",
      "level": 4,
      "content": "El paquete util-linux proporciona la utilidad lsblk(8) que lista los dispositivos de bloque, por ejemplo:\n\n```\n$ lsblk -f\n```\n\n```\nNAME   FSTYPE   LABEL       UUID                                 MOUNTPOINT\nsda\n├─sda1 vfat                 C4DA-2C4D                            /boot\n├─sda2 swap                 5b1564b2-2e2c-452c-bcfa-d1f572ae99f2 [SWAP]\n└─sda3 ext4                 56adc99b-a61e-46af-aab7-a6d07e504652 /\n```\n\nEn el ejemplo anterior, solo hay un dispositivo disponible (sda), y ese dispositivo tiene tres particiones (de sda1 a sda3), cada uno con un sistema de archivos diferente.\n\n"
    },
    {
      "title": "wipefs",
      "level": 4,
      "content": "wipefs puede listar o borrar las firmas de sistemas de archivos, RAID o la tabla de particiones (cadenas mágicas) del dispositivo especificado para hacer las firmas invisibles para libblkid(3). No borra los sistemas de archivos ni los datos del dispositivo.\n\nVéase wipefs(8) para más información.\n\nPor ejemplo, para borrar todas las firmas del dispositivo /dev/sdb y crear un archivo con la copia de seguridad de la firma ~/wipefs-sdb-offset.bak por cada firma:\n\n```\n# wipefs --all --backup /dev/sdb\n```\n\n"
    },
    {
      "title": "Pseudo-dispositivos",
      "level": 2,
      "content": "Son nodos de dispositivo que no tienen dispositivo físico.\n\n- /dev/random, véase random(4)\n- /dev/shm\n- /dev/null, /dev/zero, véase null(4)\n- /dev/full, véase full(4)\n- /dev/ttyX, donde X es un número\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Dispositivos asignados de Linux — La documentación del kernel de Linux\n- Gentoo:Device file\n\n"
    }
  ]
}