{
  "title": "Bluetooth мышь",
  "url": "https://wiki.archlinux.org/title/Bluetooth_%D0%BC%D1%8B%D1%88%D1%8C",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Bluetooth (Русский)\n- Mouse polling rate\n\nЭта статья описывает настройку Bluetooth-мышей и решение связанных с ними проблем. Информация базируется на основной статье Bluetooth, и предполагается, что вы уже изучили её.\n\n"
    },
    {
      "title": "Скорость прокрутки на Apple Magic Mouse",
      "level": 3,
      "content": "Если прокрутка слишком медленная, попробуйте\n\n```\n# modprobe -r hid_magicmouse\n# modprobe hid_magicmouse scroll_acceleration=1 scroll_speed=55\n```\n\nМожно установить значение от 0 до 63.\n\nКогда вы найдёте подходящее вам значение, можно сделать это изменение постоянным в /etc/modprobe.d/\n\n```\n/etc/modprobe.d/hid_magicmouse.conf\n```\n\n```\noptions hid_magicmouse scroll_acceleration=1 scroll_speed=55\n```\n\n"
    },
    {
      "title": "Щелчок средней кнопкой на Apple Magic Mouse",
      "level": 3,
      "content": "Если вы считаете, что средний щелчок слишком привередлив, вы можете отключить его\n\n```\n# modprobe -r hid_magicmouse\n# modprobe hid_magicmouse emulate_3button=0\n```\n\nМожно сделать это изменение постоянным в /etc/modprobe.d/\n\n```\n/etc/modprobe.d/hid_magicmouse.conf\n```\n\n```\noptions hid_magicmouse emulate_3button=0\n```\n\n"
    },
    {
      "title": "Сопряжение мыши и двойная загрузка",
      "level": 3,
      "content": "При использовании нескольких операционным систем вам придётся настраивать сопряжение с мышью каждый раз снова и снова при переходе в другую ОС. Это связано с тем, что при сопряжении Bluetooth-служба генерирует уникальный набор ключей сопряжения.\n\nВо-первых, ваш компьютер хранит MAC-адрес устройства Bluetooth и ключ сопряжения. Во-вторых, ваше Bluetooth-устройство хранит MAC-адрес компьютера и соответствующий ключ. Это обычно работает нормально, но MAC-адрес вашего Bluetooth-порта одинаковый во всех ОС (он прописан на аппаратном уровне), а при сопряжении каждый раз генерируется новый ключ. Этот ключ перезаписывает старый, хранящийся на Bluetooth-устройстве. Windows перезаписывает Linux-ключ и наоборот.\n\nВы можете перенести ключи сопряжения из другой системы в Linux; смотрите Bluetooth (Русский)#Сопряжение при двойной загрузке.\n\nЕсли у вас устройство Bluetooth LE, используйте этот Python-скрипт, слегка адаптированный для Arch (оригинальное обсуждение [1]).\n\n"
    },
    {
      "title": "Тормоза мыши",
      "level": 3,
      "content": "Если вы наблюдаете тормоза мыши, вы можете попробовать увеличить частоту опроса. Смотрите Mouse polling rate для дополнительной информации.\n\nМожно попробовать установить минимальную/максимальную задержку для мыши в BlueZ [2]:\n\nПопробуйте изменить файл /var/lib/bluetooth/mac-адрес-адаптера/mac-адрес-мыши/info, добавив туда следующие строки:\n\n```\n[ConnectionParameters]\nMinInterval=6\nMaxInterval=9\nLatency=44\nTimeout=216\n```\n\nТакже можно использовать hcitool (из пакета bluez-deprecated-tools) для изменения параметров задержки:\n\n```\n# HANDLE=\"$(hcitool con | grep '<mac-адрес мыши>' | awk '{print $5}')\"  # get the device handle\n# hcitool lecup --handle $HANDLE --latency 0 --min 6 --max 8\n```\n\nЭто применится только для текущего соединения; после переподключения мыши команду нужно будет выполнить снова.\n\nЕщё можно попробовать изменить настройки задержки через debugfs. Смотрите /sys/kernel/debug/bluetooth/hci0/conn_{latency,{min,max}_interval} .\n\nThis example will solve the lag problems, but you must un pair and pair the mouse:\n\n```\n# echo 0 > /sys/kernel/debug/bluetooth/hci0/conn_latency\n# echo 6 > /sys/kernel/debug/bluetooth/hci0/conn_min_interval\n# echo 7 > /sys/kernel/debug/bluetooth/hci0/conn_max_interval\n```\n\n"
    },
    {
      "title": "Проблемы с USB-адаптером Bluetooth",
      "level": 3,
      "content": "Если у вас проблемы с адаптером USB, можете попробовать выполнить:\n\n```\n# modprobe -v rfcomm\n```\n\nСейчас вы должны получить устройство hci0 с помощью команды:\n\n```\n# hcitool dev\n```\n\nИногда устройство не активируется автоматически. Попробуйте поднять интерфейс с помощью:\n\n```\n# hciconfig hci0 up\n```\n\nи выполнить поиск устройств, как описано выше.\n\n"
    },
    {
      "title": "Мышь постоянно отключается",
      "level": 3,
      "content": "Если мышь перестаёт работать, но снова работает после перезапуска Bluetooth, или постоянно засыпает через несколько секунд неактивности (что случается как минимум с некоторыми модулями Dell XPS 13 [3]), вам может понадобиться отключить автоматическую приостановку USB для выбранного устройства.\n\nПроблема также может быть в таймауте устройства и настройках HID. Смотрите #Проблемы с Thinkpad Bluetooth Laser Mouse.\n\nЕсли у вас Logitech, проблема может быть решена процедурой, описанной в разделе #Проблемы с Logitech BLE мышами (M557, M590, M720, Anywhere 2 и т. д.).\n\n"
    },
    {
      "title": "Проблемы с Thinkpad Bluetooth Laser Mouse",
      "level": 3,
      "content": "Если у вас Thinkpad Bluetooth Laser Mouse подключается и быстро (спустя несколько миллисекунд) отключается каждые несколько секунд (когда вы её двигаете или нажимаете кнопку), попробуйте выполнить сопряжения с кодом 0000 вместо сопряжения без кода.\n\nЕсли это не помогло, проблема может быть в настройках таймаута устройства. Измените/создайте файл /etc/bluetooth/input.conf и пропишите в нём следующие изменения:\n\n```\n# Configuration file for the input service\n# This section contains options which are not specific to any\n# particular interface\n[General]\n\n# Set idle timeout (in minutes) before the connection will\n# be disconnect (defaults to 0 for no timeout)\nIdleTimeout=0\n\n#Enable HID protocol handling in userspace input profile\n#Defaults to false(hidp handled in hidp kernel module)\nUserspaceHID=true\n```\n\nЭти изменения предотвратят таймаут устройства, чтобы оно оставалось подключенным. Вторая настройка включает userspace обработку HID. Перезапустите службу bluetooth.service для тестирования изменений. Ещё может понадобиться перезагрузиться и провести повторое сопряжение с устройством.\n\n"
    },
    {
      "title": "Проблемы с Kensington Expert Wireless Trackball",
      "level": 3,
      "content": "Kensington Expert Wireless Trackball имеет частоту опроса по умолчанию в районе 200мс, что создаёт ощутимые задержки. Для исправления добавьте или измените раздел [ConnectionParameters] в файле /var/lib/bluetooth/mac-адрес-адаптера/mac-адрес-мыши/info как показано выше; уменьшите задержку или вообще установите её в 0.\n\n"
    },
    {
      "title": "Проблемы с Logitech BLE мышами (M557, M590, M720, Anywhere 2 и т. д.)",
      "level": 3,
      "content": "Иногда сопряжение проходит успешно, но мышь не двигается. Устройство нужно добавить в доверенные и разблокировать. Сперва откройте терминал и выполните bluetoothctl\n\n1. Отключите bluetooth: [bluetooth] # power off\n1. Включите bluetooth: [bluetooth] # power on\n1. Выведите список доступных устройств bluetooth, скопируйте device ID мыши XX:XX:XX:XX:XX:XX: [bluetooth] # scan on\n1. Удалите сопряжение, если оно уже есть: [bluetooth] # remove XX:XX:XX:XX:XX:XX\n1. Переведите устройство в режим сопряжения (обычно долгим нажатием на кнопку, или сочетанием клавиш на некоторых клавиатурах). Его обнаружит и выведет scan. Device ID может измениться (немного), так что скопируйте device ID, который покажет scan.\n1. Добавьте в доверенные ваше устройство: [bluetooth] # trust XX:XX:XX:XX:XX:XX\n1. Выполните сопряжение с компьютером: [bluetooth] # pair XX:XX:XX:XX:XX:XX\n1. Соедините компьютер с мышью: [bluetooth] # connect XX:XX:XX:XX:XX:XX\n1. Разблокируйте управление устройством: [M585/M590] # unblock\n1. Выключите и включите bluetooth.\n\n```\n[bluetooth] # power off\n```\n\n```\n[bluetooth] # power on\n```\n\n```\n[bluetooth] # scan on\n```\n\n```\n[bluetooth] # remove XX:XX:XX:XX:XX:XX\n```\n\n```\n[bluetooth] # trust XX:XX:XX:XX:XX:XX\n```\n\n```\n[bluetooth] # pair XX:XX:XX:XX:XX:XX\n```\n\n```\n[bluetooth] # connect XX:XX:XX:XX:XX:XX\n```\n\n```\n[M585/M590] # unblock\n```\n\nЕсли мышь не работает напрямую, выключите и снова включите её.\n\nИногда бывает нужно загрузить модуль ядра uhid.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- BlueZ settings storage\n\n"
    }
  ]
}