{
  "title": "Bluetooth keyboard (Русский)",
  "url": "https://wiki.archlinux.org/title/Bluetooth_keyboard_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "В этой статье описан метод подключения Bluetooth HID клавиатуры. Используется bluez версии 5.\n\n"
    },
    {
      "title": "Сопряжение",
      "level": 2,
      "content": "Войдите на нужный компьютер с проводной клавиатурой или через ssh.\n\nВ первую очередь убедитесь, что Bluetooth-контроллер определился:\n\n```\n# lsusb\n```\n\n```\nBus 001 Device 004: ID 0a12:0001 Cambridge Silicon Radio, Ltd Bluetooth Dongle (HCI mode)\nBus 001 Device 003: ID 0424:ec00 Standard Microsystems Corp. SMSC9512/9514 Fast Ethernet Adapter\nBus 001 Device 002: ID 0424:9512 Standard Microsystems Corp. LAN9500 Ethernet 10/100 Adapter / SMSC9512/9514 Hub\nBus 001 Device 001: ID 1d6b:0002 Linux Foundation 2.0 root hub\n```\n\nПриведённый выше вывод получен на Raspberry-Pi revision 'B' с archlinux-arm и Bluetooth-донглом Keysonic.\n\nПомните три вещи:\n\n- Между Bluetooth-устройством (клавиатурой) и контроллером (донглом) сопряжение настраивается один раз.\n- Bluetooth-контроллер необходимо включать после каждой загрузки.\n- Контроллеру необходимо указывать подключение к клавиатуре после каждой загрузки.\n\nСопряжение — однократный процесс, который достаточно выполнить один раз. Бывают Bluetooth-клавиатуры, продаваемые вместе с донглом и заранее настроенным сопряжением, но так не у всех. Мы используем команду bluetoothctl из пакета bluez-utils для сопряжения нашего донгла и клавиатуры.\n\nВключение может быть выполнено через bluetoothctl или автоматически в /etc/bluetooth/main.conf (см. ниже).\n\nАналогично подключение может быть выполнено через bluetoothctl или hcitool, последний более полезен для написания скриптов.\n\nИспользуем bluetoothctl для сопряжения. Запустите команду для получения приглашения [bluetooth]#.\n\n```\n# bluetoothctl\n```\n\n```\n[bluetooth]#\n```\n\nНаходясь в bluetoothctl, включите контроллер:\n\n```\n[bluetooth]# power on\n```\n\n```\nChanging power on succeeded\n[CHG] Controller 06:05:04:03:02:01 Powered: yes\n```\n\nЗатем сообщите bluetoothctl, что мы ищем только клавиатуры, и сделайте это агентом по умолчанию:\n\n```\n[bluetooth]# agent KeyboardOnly\n```\n\n```\nAgent registered\n```\n\n```\n[bluetooth]# default-agent\n```\n\n```\nDefault agent request successful\n```\n\nДалее переведите ваш контроллер (локальный донгл) в режим сопряжения (pairable):\n\n```\n[bluetooth]# pairable on\n```\n\n```\nChanging pairable on succeeded\n```\n\nТеперь переведите вашу клавиатуру в активный режим, когда она может быть обнаружена и сопряжена. Некоторые клавиатуры имеют специальную кнопку для этого, некоторые требуют нажать специальную комбинацию клавиш — читайте документацию к вашей клавиатуре. Имейте в виду, что время, в течение которого будет доступно обнаружение, ограничено, обычно около 30 секунд или пары минут в зависимости от устройства.\n\nДалее попросите контроллер найти подходящее устройство:\n\n```\n[bluetooth]# scan on\n```\n\n```\nDiscovery started\n[CHG] Controller 06:05:04:03:02:01 Discovering: yes\n```\n\nПосле нескольких секунд адрес вашей клавиатуры должен быть найден. Строка может повторяться снова и снова, но это не мешает вводить новые команды.\n\nТеперь выполните собственно сопряжение. Используемый адрес это MAC-адрес вашей Bluetooth-клавиатуры:\n\n```\n[bluetooth]# pair 01:02:03:04:05:06\n```\n\n```\nPairing successful\n```\n\nТеперь сделайте это устройство доверенным (это позволит ему самостоятельно устанавливать соединение). Аналогично, используемый адрес это MAC-адрес вашей Bluetooth-клавиатуры:\n\n```\n[bluetooth]# trust 01:02:03:04:05:06\n```\n\n```\nTrusted\n```\n\nНаконец, подключитесь к устройству (клавиатуре). Аналогично, используемый адрес это MAC-адрес вашей Bluetooth-клавиатуры:\n\n```\n[bluetooth]# connect 01:02:03:04:05:06\n```\n\n```\nConnection successful\n```\n\nГотово. Теперь можно выйти из bluetoothctl:\n\n```\n[bluetooth]# quit\n```\n\nТеперь внешнее устройство (клавиатура) и USB-донгл сопряжены навсегда, пока вы самостоятельно не удалите сопряжение.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "В первую очередь убедитесь, что сам Bluetooth-контроллер определился и работает; смотрите основную статью Bluetooth (Русский).\n\n"
    },
    {
      "title": "Ошибка: hci0 ACL packet for unknown connection handle 4",
      "level": 3,
      "content": "- Попробуйте выполнить сброс командой hciconfig hci0 reset\n\n"
    },
    {
      "title": "Xorg",
      "level": 2,
      "content": "Устройство добавляется как /dev/input/event* и Xorg должен увидеть его автоматически, если вы не отключили такую возможность.\n\n"
    }
  ]
}