{
  "title": "Blueman (Español)",
  "url": "https://wiki.archlinux.org/title/Blueman_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2025-03-28** \n\nBlueman es un completo gestor de Bluetooth escrito en Python que utiliza GTK.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale blueman o blueman-gitAUR para la versión de desarrollo.\n\nAsegúrese de activar la unidad Bluetooth e iniciar Blueman con blueman-applet. Se puede inciar un panel de configuración gráfica con blueman-manager.\n\n"
    },
    {
      "title": "Inicio automático",
      "level": 3,
      "content": "Se debería haber creado el siguiente archivo de inicio automático : /etc/xdg/autostart/blueman.desktop. Esto significa que Blueman debería iniciarse automáticamente con la mayoría de los entornos de escritorio sin intervención manual. Consulte el artículo para su entorno de escritorio o administrador de ventanas, así como el artículo inicio automático para obtener más información sobre el inicio automático.\n\n"
    },
    {
      "title": "Permisos",
      "level": 3,
      "content": "Para recibir archivos, recuerde hacer clic derecho en el Ícono de la bandeja de Blueman > Servicios locales > Transferencia > Recepción de archivos (Object Push) y marcar la casilla Aceptar archivos de dispositivos confiables.\n\nPara poder gestionar dispositivos, es posible que deba añadir su usuario al grupo lp, si no de lo contrario, podría recibir el siguiente error al conectarse a un dispositivo: DBusFailedError: No such file or directory. Esto se debe a que el usuario debe estar autorizado para comunicarse con el demonio Bluetooth a través de D-Bus - el grupo lp se especifica en /etc/dbus-1/system.d/bluetooth.conf. Para obtener información de cómo añadir un usuario a un grupo, Vea Users and groups (Español)#Otros ejemplos de administración de usuarios.\n\nDesde la versión 2.0.6 la documentación oficial recomienda crear reglas polkit para evitar que los agentes de contraseña polkit pidan la contraseña en cada arranque, como usuario root añada las siguientes reglas polkit:\n\n```\n/etc/polkit-1/rules.d/51-blueman.rules\n```\n\n```\n/* Allow users in wheel group to use blueman feature requiring root without authentication */\npolkit.addRule(function(action, subject) {\n    if ((action.id == \"org.blueman.network.setup\" ||\n         action.id == \"org.blueman.dhcp.client\" ||\n         action.id == \"org.blueman.rfkill.setstate\" ||\n         action.id == \"org.blueman.pppd.pppconnect\") &&\n        subject.isInGroup(\"wheel\")) {\n\n        return polkit.Result.YES;\n    }\n});\n```\n\nTenga en cuenta que los usuarios deben pertenecer al grupo wheel.\n\n"
    },
    {
      "title": "Montar dispositivos Bluetooth",
      "level": 3,
      "content": "Las siguientes instrucciones describen un método para utilizar diferentes administradores de archivos con Blueman. Los ejemplos de esta sección se centran en Thunar. Si utiliza un administrador de archivos diferente, sustituya thunar por el nombre del administrador que esté utilizando.\n\n```\nobex_thunar.sh\n```\n\n```\n#!/bin/bash\n[ ! -d ~/Bluetooth ] && mkdir ~/Bluetooth   \nfusermount -u ~/Bluetooth\nobexfs -b $1 ~/Bluetooth\nthunar ~/Bluetooth\n```\n\nAhora debe mover el script a una ubicación adecuada (por ejemplo; /usr/local/bin). A continuación, márquelo como ejecutable.\n\nEl último paso es cambiar la línea en el Icono de la bandeja de Blueman > Servicios locales > Transferencia > Avanzado a obex_thunar.sh %d.\n\n"
    },
    {
      "title": "Blueman y PulseAudio",
      "level": 3,
      "content": "Los usuarios que quieran utilizar PulseAudio con auriculares Bluetooth, además de instalar pulseaudio-bluetooth, pueden activar el plugin PulseAudio de Blueman. Esto cargará automáticamente el módulo Bluetooth de PulseAudio una vez conectado el dispositivo de audio y reproduce todo el audio a través de los auriculares Bluetooth. Para más información, vea Bluetooth headset.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "La configuración se realiza con dconf (gsettings o dconf-editor) en /org/blueman.\n\n"
    },
    {
      "title": "Desactivar el encendido automático",
      "level": 3,
      "content": "Blueman activa automáticamente el adaptador Bluetooth (rfkill unblock bluetooth) cuando se producen determinados eventos (en el arranque, se abre la tapa del portátil, ...). Esto se puede desactivar con auto-power-on en org.blueman.plugins.powermanager:\n\n```\n$ gsettings set org.blueman.plugins.powermanager auto-power-on false\n```\n\n"
    },
    {
      "title": "Recibir notificaciones a través de un demonio de notificación",
      "level": 3,
      "content": "Blueman puede enviar notificaciones a través de un demonio de notificación (por ejemplo dunst) si está presente. En caso de no haber disponible un demonio de notificación, blueman utiliza una alternativa basada en ventanas. Este comportamiento se puede configurar activando la opción notification-daemon en org.blueman.general\n\n```\n$ gsettings set org.blueman.general notification-daemon true\n```\n\n"
    },
    {
      "title": "No se detectaron adaptadores",
      "level": 3,
      "content": "Si el applet o gestor de Bluetooth no muestra ni detecta ningún adaptador Bluetooth, es posible que su tarjeta inalámbrica esté bloqueada. Intente desbloquearla usando rfkill.\n\n"
    },
    {
      "title": "No se pueden recibir archivos",
      "level": 3,
      "content": "Si no puede enviar ni recibir archivos y se produce un error de excepción en python-dbus similar o idéntico a process org.bluez.obex exited with status 1 se recomienda iniciar el servicio obexd-service manualmente desde /usr/lib/bluetooth/obexd y comprobar si funciona. Dado que los permisos predeterminados son 755, es posible iniciar el demonio desde una cuenta de usuario.\n\nEmpiece con esta línea:\n\n```\n# /usr/lib/bluetooth/obexd -n\n```\n\nDeje abierto el terminal donde se ejecuta el comando y compruebe si el envío de archivos funciona. Compruebe si realmente recibe el archivo. Puede añadir el comando en el inicio automático para no tener que iniciar el servicio manualmente cada vez. El inicio automático de su entorno de escritorio debería poder ejecutar el programa una vez que inicie sesión. Cierre la sesión y vuélvala a iniciar, ahora debería poder recibir archivos sin ejecutar la línea manualmente.\n\nSi el error persiste u ocurre otro, intente utilizar ObexFTP para transferir archivos en su lugar.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Desarrollo de Blueman, en GitHub.\n\n"
    }
  ]
}