{
  "title": "Bluetooth наушники",
  "url": "https://wiki.archlinux.org/title/Bluetooth_%D0%BD%D0%B0%D1%83%D1%88%D0%BD%D0%B8%D0%BA%D0%B8",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Bluetooth (Русский)\n\nЕсть три аудиосистемы Bluetooth:\n\n- A2DP (advanced audio distribution) обеспечивает стереовывод (sink), подходящий для музыки, обычно без источника (source). A2DP может использовать различные кодеки. Стандартный SBC имеет не самое высокое качество, но гораздо более качественные открытые альтернативы (LDAC, AptX) получили широкое распространение. AVRCP используется поверх A2DP для управления воспроизведением.\n- HFP/HSP (hands-free/headset) обеспечивает монофонический вывод для голоса и источник. HFP работает поверх HSP.\n- LE Audio — аудиостандарт с низким энергопотреблением, представленный в 2020 году. Стандартным кодеком является LC3.\n\n- A2DP может использовать различные кодеки. Стандартный SBC имеет не самое высокое качество, но гораздо более качественные открытые альтернативы (LDAC, AptX) получили широкое распространение.\n- AVRCP используется поверх A2DP для управления воспроизведением.\n\nЯдро, BlueZ 5 и PipeWire поддерживают все три профиля. Более старые звуковые серверы, такие как PulseAudio и ALSA, поддерживают только A2DP и HFP/HSP. Хотя Bluetooth печально известен своей ненадёжностью[1], многие его реализации получили значительные улучшения, что улучшило ситуацию на хорошо зарекомендовавшем себя оборудовании, таком как Bluetooth-чипы Intel.\n\n"
    },
    {
      "title": "Наушники через PipeWire",
      "level": 2,
      "content": "PipeWire выступает прямой заменой PulseAudio и даёт лёгкий способ установки Bluetooth-наушников. Он имеет поддержку A2DP-профилей из коробки с использованием кодеков SBC/SBC-XQ, AptX, LDAC или AAC, а также HFP/HSP.\n\nУстановите пакет pipewire-pulse (который заменяет pulseaudio и pulseaudio-bluetooth).\n\nДемон запустится автоматически как пользовательская служба. Используйте pavucontrol или настройки вашей среды рабочего стола для конфигурации. Подробности есть в разделе PipeWire (Русский)#Устройства Bluetooth.\n\n"
    },
    {
      "title": "Высокая громкость звука из-за синхронизации между наушниками и PipeWire",
      "level": 4,
      "content": "Начиная с версии 0.3.26, PipeWire использует «аппаратную громкость» для связи громкости наушников с системой, что делает невозможным изменение одной громкости независимо от другой. На некоторых устройствах это может привести к тому, что минимально возможная громкость будет некомфортно громкой, а шаг регулировки громкости будет слишком большим. Это можно отключить через WirePlumber или Pipewire Media Session.\n\nСоздайте или отредактируйте файл настроек /etc/wireplumber/wireplumber.conf.d/80-bluez-properties.conf (общесистемный) или ~/.config/wireplumber/wireplumber.conf.d/80-bluez-properties.conf (для отдельного пользователя), прописав в нём следующее:\n\n```\nmonitor.bluez.properties = {\n  bluez5.enable-hw-volume = false\n}\n```\n\nПерезапустите PipeWire и WirePlumber для применения изменений.\n\nСоздайте каталог /etc/pipewire/media-session.d/ (общесистемный) или ~/.config/pipewire/media-session.d/ (для отдельного пользователя), скопируйте в него файл /usr/share/pipewire/media-session.d/bluez-monitor.conf и отредактируйте копию, добавив строку:\n\n```\nbluez5.enable-hw-volume = false\n```\n\nПерезапустите службы PipeWire для применения изменений.\n\n"
    },
    {
      "title": "Наушники через Bluez5/PulseAudio",
      "level": 2,
      "content": "Установите пакеты pulseaudio-alsa, pulseaudio-bluetooth и bluez-utils — последний предоставляет инструмент bluetoothctl.\n\n"
    },
    {
      "title": "Настройка через командную строку",
      "level": 3,
      "content": "Запустите службу bluetooth.service.\n\nМы будем использовать утилиту командной строки bluetoothctl для сопряжения и подключения. Более подробное описание и решение проблем смотрите в основной статье Bluetooth (Русский). Запустите эту утилиту:\n\n```\n$ bluetoothctl\n```\n\nВы попадёте в её командную строку. В ней введите:\n\n```\n[bluetooth]# power on\n[bluetooth]# agent on\n[bluetooth]# default-agent\n[bluetooth]# scan on\n```\n\nТеперь переведите ваши наушники в режим сопряжения, и компьютер вскоре должен обнаружить их. Например,\n\n```\n[NEW] Device 00:1D:43:6D:03:26 Lasmex LBT10\n```\n\nпоказывает устройство с названием «Lasmex LBT10» и MAC-адресом «00:1D:43:6D:03:26». Мы будем использовать этот MAC-адрес для сопряжения:\n\n```\n[bluetooth]# pair 00:1D:43:6D:03:26\n```\n\nПосле сопряжения нужно явно подключить устройство (если это не работает, попробуйте команду trust перед попыткой подключения):\n\n```\n[bluetooth]# connect 00:1D:43:6D:03:26\n```\n\nЕсли возникает ошибка org.bluez.Error.Failed, попробуйте ещё раз, предварительно завершив демон PulseAudio:\n\n```\n$ pulseaudio -k\n[bluetooth]# connect 00:1D:43:6D:03:26\n```\n\nНаконец, если вы хотите автоматически подключаться к этому устройству в будущем:\n\n```\n[bluetooth]# trust 00:1D:43:6D:03:26\n```\n\nЕсли всё работает корректно, вы увидите отдельное устройство вывода в PulseAudio.\n\nТеперь можно направить любое аудио на это устройство на вкладках «Проигрывание» и «Запись» в pavucontrol.\n\nТеперь вы можете остановить сканирование и выйти из программы:\n\n```\n[bluetooth]# scan off\n[bluetooth]# exit\n```\n\n"
    },
    {
      "title": "Автоподключение",
      "level": 4,
      "content": "Чтобы наушники автоматически подключались, нужно включить PulseAudio-модуль switch-on-connect. Добавьте следующие строки в /etc/pulse/default.pa:\n\n```\n/etc/pulse/default.pa\n```\n\n```\n### Automatically switch to newly-connected devices\nload-module module-switch-on-connect\n```\n\n"
    },
    {
      "title": "Настройка через GNOME Bluetooth",
      "level": 3,
      "content": "Вы можете использовать графический фронтенд GNOME Bluetooth для лёгкой настройки наушников.\n\nСперва убедитесь, что служба bluetooth.service запущена.\n\nОткройте GNOME Bluetooth и активируйте bluetooth. После сканирования устройств вы можете подключиться к наушникам, выбрав их в списке устройств. Вы можете получить доступ к настройкам звука из меню устройства. После подключения устройства в настройках звука должен появиться новый аудиовывод.\n\n"
    },
    {
      "title": "LDAC/aptX",
      "level": 3,
      "content": "Кодеки LDAC/aptX поддерживаются с PulseAudio 15.0. Вы можете проверить используемый кодек с помощью команды:\n\n```\n$ pactl list | grep a2dp_codec\n```\n\n"
    },
    {
      "title": "Плохой звук / Постоянный шум / «Мутный» звук",
      "level": 4,
      "content": "Плохое качество звука скорее всего связано с тем, что не выбран правильный профиль. Смотрите #Переключение между HSP/HFP и A2DP для решения проблемы.\n\nЕсли вы подозреваете, что плохое качество звука связано с плохим соединением bluetooth, можно попробовать переключиться на кодек с более низким битрейтом и более низким качеством звука, например SBC или aptX, с помощью pactl:\n\n```\n$ pactl send-message /card/bluez_card.XX_XX_XX_XX_XX_XX/bluez switch-codec '\"sbc\"'\n```\n\nСписок доступных кодеков можно посмотреть командой:\n\n```\n$ pactl send-message /card/bluez_card.XX_XX_XX_XX_XX_XX/bluez list-codecs\n```\n\n"
    },
    {
      "title": "Профиль выбран, но наушники неактивны и звук не может быть перенаправлен",
      "level": 4,
      "content": "Это меню обманчиво доступно ещё до подключения устройства; пока оно не подключено, это меню не будет иметь никакого эффекта. Кажется, меню создаётся сразу после определения устройства.\n\nЗапустите bluetoothctl как root и подключите устройство вручную.\n\n"
    },
    {
      "title": "Сопряжение не удаётся с ошибкой AuthenticationFailed",
      "level": 4,
      "content": "Попробуйте включить или отключить SSPMode:\n\n```\n# btmgmt ssp off\n```\n\nили\n\n```\n# btmgmt ssp on\n```\n\nМожет понадобиться выключить Bluetooth на время выполнения этой команды.\n\n"
    },
    {
      "title": "Сопряжение работает, но соединение не удаётся",
      "level": 4,
      "content": "Вы можете увидеть такую ошибку в bluetoothctl:\n\n```\n[bluetooth]# connect 00:1D:43:6D:03:26\nAttempting to connect to 00:1D:43:6D:03:26\nFailed to connect: org.bluez.Error.Failed\n```\n\nДля изучения проверьте статус bluetooth.service или гляньте журнал:\n\n```\n# journalctl -n 20\n```\n\nТам может оказаться примерно такое сообщение:\n\n```\nbluetoothd[5556]: a2dp-sink profile connect failed for 00:1D:43:6D:03:26: Protocol not available\n```\n\nЭто может быть из-за того, что пакет pulseaudio-bluetooth не установлен. Установите его и затем перезапустите PulseAudio.\n\nЭто также может быть из-за проблем с правами доступа, особенно если запуск PulseAudio от root решает проблему. Добавьте своего пользователя в группу lp и перезапустите PulseAudio. Смотрите /etc/dbus-1/system.d/bluetooth.conf для справки.\n\nЕсли перезапуск PulseAudio не помогает, возможно, требуется загрузить module-bluetooth-discover.\n\n```\n# pactl load-module module-bluetooth-discover\n```\n\nТакую же команду load-module можно добавить в /etc/pulse/default.pa.\n\nЕсли всё равно не работает или ваш PulseAudio общесистемный, также загрузите эти модули (опять же, их можно прописать в default.pa или system.pa):\n\n```\nmodule-bluetooth-policy\nmodule-bluez5-device\nmodule-bluez5-discover\n```\n\nЕщё может оказаться, что у владельца /var/lib/bluetooth/ нет доступа на запись. В таком случае проблема может решиться повторным сопряжением, но после перезагрузки всё опять перестанет работать. Возвращение прав на запись поможет:\n\n```\n# chmod -R u+w /var/lib/bluetooth\n```\n\n"
    },
    {
      "title": "Соединение работает, но в звуке постоянные артефакты",
      "level": 4,
      "content": "Это скорее всего связано с тем, что Bluetooth и Wi-Fi используют один и тот же чип, одну и ту же антенну и, возможно, диапазон (2.4 ГГц). Хотя это работает без проблем в Windows, в Linux это не так.\n\nВозможным решением является переключение вашей Wi-Fi сети на 5 ГГц, чтобы больше не возникало интерференции. Если карта/роутер не поддерживают этот диапазон, попробуйте обновить драйвера/прошивку Wi-Fi.\n\nЕсли сделать это невозможно, менее эффективным решением будет настройка размера фрагмента и задержки на выводе PulseAudio, через которые можно попытаться скомпенсировать интерференцию. Нужно выбирать разумные значения, так как эти изменения могут привести к рассинхронизации звука (например, при проигрывании видео). Для изменения задержки на порту bluetooth-наушников (например, 125000 микросекунд в данном примере):\n\n```\n$ pactl set-port-latency-offset <bluez_card> headset-output 125000\n```\n\nгде идентификатор карты можно узнать с помощью\n\n```\n$ pacmd list-sinks | grep -Eo 'bluez_card[^>]*'\n```\n\nРазмер фрагмента можно установить в файле /etc/pulse/daemon.conf, изменения применятся после перезапуска PulseAudio (подробнее смотрите PulseAudio/Решение проблем#Определение номера фрагмента по умолчанию и размера буфера в PulseAudio).\n\nИногда может помочь добавление options ath9k btcoex_enable=1 в файл /etc/modprobe.d/ath9k.conf (с соответствующим адаптером bluetooth):\n\n```\n/etc/modprobe.d/ath9k.conf\n```\n\n```\n# possibly fix for sound glitches\noptions ath9k btcoex_enable=1\n```\n\nПосле этого перезагрузитесь.\n\n"
    },
    {
      "title": "Соединение работает, но не получается воспроизвести звук",
      "level": 4,
      "content": "Поищите в системном журнале такие сообщения:\n\n```\nbluetoothd[5556]: Endpoint registered: sender=:1.83 path=/MediaEndpoint/A2DPSource\nbluetoothd[5556]: Endpoint registered: sender=:1.83 path=/MediaEndpoint/A2DPSink\n```\n\nЕсли подобные сообщения есть, можно продолжить изучать конфигурацию PulseAudio. Если нет, то убедитесь, что соединение успешно.\n\nПри использовании GDM запускается другой экземпляр PulseAudio, который «захватывает» ваши bluetooth-соединения. Это можно предотвратить, замаскировав сокет pulseaudio для пользователя GDM:\n\n```\n# mkdir -p  /var/lib/gdm/.config/systemd/user\n# ln -s /dev/null  /var/lib/gdm/.config/systemd/user/pulseaudio.socket\n```\n\nПри следующей перезагрузке второй экземпляр PulseAudio запускаться не будет.\n\nТакже может оказаться, что bluez неправильно определяет наушники как не поддерживающие a2dp. В таком случае найдите индекс bluetooth-устройства:\n\n```\n$ pacmd ls\n```\n\nСреди вывода должен быть раздел, связанный с bluetooth-наушниками, выглядящий примерно так:\n\n```\n$ pacmd ls\n```\n\n```\nindex: 2\n        name: <bluez_card.XX_XX_XX_XX_XX_XX>\n        driver: <module-bluez5-device.c>\n        owner module: 27\n        properties:\n                device.description = \"SONY MDR-100ABN\"\n                device.string = \"XX:XX:XX:XX:XX:XX\"\n                device.api = \"bluez\"\n                device.class = \"sound\"\n                ...\n```\n\nДля ручного выбора профиля выполните\n\n```\n$ pacmd set-card-profile 2 a2dp_sink\n```\n\nгде 2 это индекс устройства, полученный через pacmd ls.\n\n"
    },
    {
      "title": "Соединение работает, но устройство не отображается среди устройств вывода PulseAudio",
      "level": 4,
      "content": "Если наушники успешно подключаются (в чём можно убедиться через bluetoothctl), но не отображаются среди устройств вывода или ввода в pavucontrol, попробуйте добавить следующую политику в файл настроек /etc/bluetooth/main.conf:\n\n```\n/etc/bluetooth/main.conf\n```\n\n```\n[General]\nEnable=Control,Gateway,Headset,Media,Sink,Socket,Source\n```\n\nНекоторые пользователи сообщали, что это решает проблему.\n\n"
    },
    {
      "title": "Соединение работает, звук играет, а после неактивности заикается",
      "level": 4,
      "content": "Если наушники играют звук нормально до ухода в режим ожидания, а после возобновления он начинает заикаться (например, если звук был приостановлен или ничего не воспроизводилось какое-то время), попробуйте отключить автоматическую приостановку источника/вывода в PulseAudio.\n\nНекоторые пользователи сообщают об огромных задержках или даже отсутствии звука, когда Bluetooth-соединение не отправляет никаких данных. Это из-за модуля module-suspend-on-idle, который автоматически приостанавливает неактивные источники/выводы.\n\nЧтобы отключить загрузку этого модуля, закомментируйте эту строку в используемом файле конфигурации (~/.config/pulse/default.pa или /etc/pulse/default.pa):\n\n```\n~/.config/pulse/default.pa\n```\n\n```\n### Automatically suspend sinks/sources that become idle for too long\n#load-module module-suspend-on-idle\n```\n\nПерезапустите PulseAudio для применения изменений.\n\n"
    },
    {
      "title": "UUIDs has unsupported type",
      "level": 4,
      "content": "В процессе сопряжения вы можете увидеть в bluetoothctl такой вывод:\n\n```\n[CHG] Device 00:1D:43:6D:03:26 UUIDs has unsupported type\n```\n\nЭто сообщение очень частое и может быть проигнорировано.\n\n"
    },
    {
      "title": "Компьютер показывает устройство как сопряжённое, но это не распознаётся устройством",
      "level": 4,
      "content": "Это может быть из-за того, что устройство не поддерживает Bluetooth LE для сопряжения.\n\nПопробуйте прописать настройку ControllerMode = bredr в файле /etc/bluetooth/main.conf. Смотрите [2].\n\n"
    },
    {
      "title": "Устройство подключается и затем отключается спустя мгновение",
      "level": 4,
      "content": "Если вы видите в журнале подобные сообщения и устройство не может подключиться или отключается вскоре после подключения:\n\n```\nbluetoothd: Unable to get connect data for Headset Voice gateway: getpeername: Transport endpoint is not connected (107)\nbluetoothd: connect error: Connection refused (111)\n```\n\nЭто может быть из-за того, что вы уже настроили сопряжение с этим устройством в другой операционной системе с тем же Bluetooth-адаптером (например, в случае двойной загрузки). Некоторые устройства не могут обрабатывать несколько сопряжений с одним и тем же MAC-адресом. Смотрите Bluetooth (Русский)#Сопряжение при двойной загрузке для настройки сопряжения в обеих ОС.\n\nЕсли другая ОС вас уже не интересует, можно просто выполнить сопряжение заново. Сперва удалите существующее сопряжение:\n\n```\n$ bluetoothctl\n[bluetooth]# devices\nDevice XX:XX:XX:XX:XX:XX My Device\n[bluetooth]# remove XX:XX:XX:XX:XX:XX\n```\n\nЗатем перезапустите bluetooth.service, включите bluetooth-адаптер, сделайте своё устройство видимым, пересканируйте устройства и выполните сопряжение с вашим устройством (смотрите основную статью). В зависимости от вашего менеджера Bluetooth может понадобиться выполнить полную перезагрузку для переподключения устройств.\n\n"
    },
    {
      "title": "В Apple AirPods маленькая громкость",
      "level": 4,
      "content": "Создайте drop-in файл для службы bluetooth.service со следующим содержимым:\n\n```\n/etc/systemd/system/bluetooth.service.d/noplugin-avrc.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=/usr/lib/bluetooth/bluetoothd --noplugin=avrcp\n```\n\nЗатем выполните daemon-reload, перезапустите службу bluetooth.service и переподключите наушники.\n\nКроме того, для AirPods Pro отключите пространственный звук и включите моно в настройках вашего iPhone.\n\nЭто также может решить проблемы с некоторыми устройствами, которыми нельзя управлять через AVRCP.\n\n"
    },
    {
      "title": "Apple AirPods Pro работает с PulseAudio как вывод A2DP, но не как HSP/HFP",
      "level": 4,
      "content": "Если AirPods Pro работает, но не может использовать HSP/HFP (в pavucontrol на вкладке Конфигурация обычно отображается как недоступный), попробуйте перейти на pipewire-pulse.\n\nПереход на pipewire-pulse (и перезапуск компьютера или соответствующих пользовательских служб) должен включить HSP/HFP, но также может отключить A2DP (при выборе этого профиля в pavucontrol он мгновенно отключается). Если у вас появилась такая проблема, попробуйте удалить/переименовать папку /var/lib/bluetooth:\n\n```\n# mv /var/lib/bluetooth /var/lib/bluetooth.bak\n```\n\nПосле этого проведите повторное сопряжение с AirPods Pro (и другими устройствами). После этого все конфигурации (HSP/HFP и A2DP) должны быть снова доступны в pavucontrol и pacmd.\n\n"
    },
    {
      "title": "Проблема с HSP: источник и вывод bluetooth созданы, но звук не передаётся",
      "level": 4,
      "content": "У вас может отсутствовать прошивка или SCO (аудио протокол HSP и HFP) роутинг может быть неправильным. Смотрите [3] — прошивка для BCM20702 может быть установлена через пакет bcm20702a1-firmwareAUR или bcm20702b0-firmwareAUR.\n\n"
    },
    {
      "title": "Error: Failed to start discovery org.bluez.Error.InProgress",
      "level": 4,
      "content": "Если наушники обнаруживаются, но подключение не проходит с ошибкой «Failed to start discovery org.bluez.Error.InProgress», установите bluez-deprecated-tools и выполните\n\n```\n$ hciconfig hciX up\n$ hciconfig hciX reset\n```\n\nгде X — это идентификатор bluetooth-устройства вашего компьютера (обычно 0).\n\nТеперь подключение должно работать как описано в разделе #Настройка через командную строку.\n\n"
    },
    {
      "title": "Высокая громкость звука из-за синхронизации между наушниками и PulseAudio",
      "level": 4,
      "content": "Начиная с PulseAudio 15, «Absolute Volume» связывает друг с другом громкости звука в наушниках и в PulseAudio, делая невозможным их изменение отдельно друг от друга. На некоторых наушниках, например на Hoco W25, это может привести к раздражающей громкости. Чтобы отключить «Absolute Volume», отредактируйте файл /etc/pulse/default.pa, изменив строку\n\n```\nload-module module-bluetooth-discover\n```\n\nна\n\n```\nload-module module-bluetooth-discover avrcp_absolute_volume=false\n```\n\n"
    },
    {
      "title": "Переключение между HSP/HFP и A2DP",
      "level": 2,
      "content": "Это можно сделать с помощью следующей команды, где номер_карты можно узнать с помощью команды pacmd list-cards.\n\n```\n$ pacmd set-card-profile номер_карты a2dp_sink\n```\n\nИмейте в виду, что разные профили могут иметь разную громкость, и вам может понадобиться увеличить громкость нового профиля, чтобы появился звук.\n\nДля автоматического переключения с A2DP на HSP при включении записи можно добавить auto_switch=2 к load-module module-bluetooth-policy в файле /etc/pulse/default.pa.\n\nПодробнее о профилях смотрите документацию PulseAudio.\n\n"
    },
    {
      "title": "Проблема с интерфейсом Socket",
      "level": 4,
      "content": "Если PulseAudio не может переключить профиль на A2DP с bluez 4.1+ и PulseAudio 3.0+, можно попробовать отключить интерфейс Socket в файле /etc/bluetooth/main.conf путём удаления строки Enable=Socket и добавления Disable=Socket.\n\n"
    },
    {
      "title": "Недоступен профиль вывода A2DP",
      "level": 4,
      "content": "Когда профиль вывода A2DP недоступен, становится невозможно переключиться на A2DP вывод в настройках PulseAudio или он вообще не отображается в списке. Это можно проверить с помощью pactl:\n\n```\n$ pactl list | grep -C2 A2DP\n     Profiles:\n             headset_head_unit: Headset Head Unit (HSP/HFP) (sinks: 1, sources: 1, priority: 30, available: yes)\n             a2dp_sink: High Fidelity Playback (A2DP Sink) (sinks: 1, sources: 0, priority: 40, available: no)\n             off: Off (sinks: 0, sources: 0, priority: 0, available: yes)\n        Active Profile: headset_head_unit\n```\n\nПопытка ручного изменения профиля через pacmd также окончится неудачей.\n\n```\n$ pacmd set-card-profile bluez_card.C4_45_67_09_12_00 a2dp_sink\nFailed to set card profile to 'a2dp_sink'.\n```\n\nЭто известная проблема PulseAudio с версии 10.0 при подключении Bluetooth-наушников через Bluedevil или другой фронтенд BlueZ. Смотрите связанный баг-репорт.\n\nЭта проблема также случается после сопряжения на некоторых Bluetooth-контроллерах (например, 0a12:0001, Cambridge Silicon Radio), которые по умолчанию включают службу Handsfree или Headset - HS и не позволяют переключиться на A2DP.\n\nВозможные решения:\n\n- На некоторых наушниках помогает нажатие кнопок управления громкостью и воспроизведением, после чего профиль A2DP становится доступным.\n- Если вы используете нестандартное ядро, попробуйте linux или linux-lts.\n- Может оказаться, что подключение наушников через bluetoothctl из пакета bluez-utils делает профиль A2DP доступным. Можно автоматизировать это каждый раз при подключении bluetooth: fix-bt-a2dpAUR (детальное описание).\n\n```\n[bluetooth]# connect MAC_адрес_наушников\n```\n\n- Ручное переключение на Bluetooth-службу AudioSink может сделать профиль A2DP и A2DP-вывод в PulseAudio доступным. Это можно сделать через blueman-manager из пакета blueman или путём регистрации UUID службы AudioSink через bluetoothctl.\n\n```\n$ bluetoothctl\n[bluetooth]# menu gatt\n[bluetooth]# register-service 0000110b-0000-1000-8000-00805f9b34fb\n[bluetooth]# quit\n```\n\n- Отключите профиль Headset\n\n```\n/etc/bluetooth/main.conf\n```\n\n```\n[General]\nDisable=Headset\n```\n\n- Включите поддержку MultiProfile. Это может помочь для наушников, которые поддерживают как A2DP, так и Headset.\n\n```\n/etc/bluetooth/main.conf\n```\n\n```\n[General]\nMultiProfile=multiple\n```\n\n- Иногда никакой из предыдущих шагов не помогает. Возможно, вы безрезультатно пытались перезагрузить и выключить Bluetooth, а затем снова включить его. В таком случае попробуйте перезапустить службу bluetooth.service.\n- На некоторых моделях наушников с возможностью управления звуком профиль A2DP необходимо включить, нажав кнопку «Воспроизведение / Пауза».\n\n"
    },
    {
      "title": "Gnome с GDM",
      "level": 4,
      "content": "Эта инструкция протестирована с Gnome 3.24.2 и PulseAudio 10.0, но может быть полезна и для других версий.\n\nЕсли PulseAudio не удаётся изменить профиль на A2DP при использовании GNOME с GDM, нужно запретить GDM запуск его собственного экземпляра PulseAudio:\n\n- Предотвратите запуск сервера клиентами PulseAudio, если он не запущен, с помощью добавления этих строк:\n\n```\n/var/lib/gdm/.config/pulse/client.conf\n```\n\n```\nautospawn = no\ndaemon-binary = /bin/true\n```\n\n- Предотвратите запуск PulseAudio через socket-активацию в systemd:\n\n```\n$ sudo -ugdm mkdir -p /var/lib/gdm/.config/systemd/user\n$ sudo -ugdm ln -s /dev/null /var/lib/gdm/.config/systemd/user/pulseaudio.socket\n```\n\n- Перезагрузитесь и проверьте, что нет процесса PulseAudio, запущенного пользователем gdm:\n\n```\n$ pgrep -u gdm pulseaudio\n```\n\nОбсуждение этой проблемы и другие варианты решения можно почитать на форуме: [4] и [5]. Также можно попробовать fix-bt-a2dpAUR.\n\n"
    },
    {
      "title": "HFP не работает с PulseAudio",
      "level": 3,
      "content": "Наушники с поддержкой только HFP могут не заработать со стандартной конфигурацией PulseAudio. Соответствующие профили есть, но они недоступны:\n\n```\nbluetoothctl info\n```\n\n```\nUUID: Audio Sink                (0000110b-0000-1000-8000-00805f9b34fb)\nUUID: A/V Remote Control Target (0000110c-0000-1000-8000-00805f9b34fb)\nUUID: A/V Remote Control        (0000110e-0000-1000-8000-00805f9b34fb)\nUUID: Handsfree                 (0000111e-0000-1000-8000-00805f9b34fb)\n```\n\n```\npactl list\n```\n\n```\n...\nProfiles:\n      ...\n      headset_head_unit: Headset Head Unit (HSP/HFP) (sinks: 1, sources: 1, priority: 30, available: no)\n```\n\nДля решения проблемы обновите PulseAudio и BlueZ до последних версий. Затем установите пакеты ofonoAUR и phonesimAUR и создайте поддельный модем как описано здесь [7]:\n\n- Создайте /etc/ofono/phonesim.conf:\n\n```\n[phonesim]\nAddress=127.0.0.1\nDriver=phonesim\nPort=12345\n```\n\n- Запустите от имени своего пользователя:\n\n```\n$ phonesim -p 12345 /usr/share/phonesim/default.xml &\n```\n\n- Запустите и включите службу ofono.service.\n\n- Включите модем:\n\n```\n$ dbus-send --print-reply --system --dest=org.ofono /phonesim org.ofono.Modem.SetProperty string:\"Powered\" variant:boolean:true\n```\n\n- Активируйте модем:\n\n```\n$ dbus-send --print-reply --system --dest=org.ofono /phonesim org.ofono.Modem.SetProperty string:\"Online\" variant:boolean:true\n```\n\n- Для проверки результата используйте команды тестирования из пакета ofonoAUR, находящиеся в каталоге /usr/lib/ofono/test/. Для включения, активации и тестирования модема можно использовать:\n\n```\n$ /usr/lib/ofono/test/enable-modem /phonesim\n$ /usr/lib/ofono/test/online-modem /phonesim\n$ /usr/lib/ofono/test/list-modems\n```\n\nВывод для соответствующего модема должен выглядеть примерно так:\n\n```\n...\n[ /phonesim ]\n  Online = 1\n  Powered = 1\n  Lockdown = 0\n  Emergency = 0\n  Manufacturer = MeeGo\n  ...\n```\n\n- Наконец, перезапустите PulseAudio и переподключите наушники. Теперь HFP должен стать доступен:\n\n```\nheadset_head_unit: Headset Head Unit (HSP/HFP) (sinks: 1, sources: 1, priority: 30, available: yes)\n```\n\n"
    },
    {
      "title": "Отключение автоматического перехода наушников на HSP/HFP в PulseAudio",
      "level": 3,
      "content": "При использовании наушников, поддерживающих несколько профилей, некоторые приложения автоматически переключают их на профиль HSP/HFP. Если вас это не устраивает, можно отключить это добавлением параметра auto_switch=false к модулю bluetooth-policy:\n\n```\n/etc/pulse/default.pa\n```\n\n```\nload-module module-bluetooth-policy auto_switch=false\n```\n\n"
    },
    {
      "title": "Отключение профиля HSP/HFP в PipeWire",
      "level": 3,
      "content": "В отличие от PulseAudio, PipeWire не переключается между A2DP и HSP/HFP автоматически в ответ на события ввода. Однако вместо того, чтобы включать автоматическое переключение на профиль HSP/HFP (с более низким качеством звука) при сбое A2DP, вы можете предпочесть отключить первый вообще. Для этого измените настройки как показано ниже.\n\n```\n/etc/wireplumber/wireplumber.conf.d/51-mitigate-annoying-profile-switch.conf (или ~/.config/wireplumber/wireplumber.conf.d/51-mitigate-annoying-profile-switch.conf)\n```\n\n```\n## В WirePlumber есть ошибка, из-за которой некоторые приложения провоцируют переключение на профиль гарнитуры\n## --\n## Сообщения в баг-трекере: #634, #645, #630, #629, #613\n## --\n## Эта конфигурация решает проблему путём полного отключения переключения и поддержки HFP\n## Использовать её имеет смысл, только если вы не планируете использовать микрофон вашей гарнитуры\n\nwireplumber.settings = {\n  ## Использовать ли профиль гарнитуры при наличии входного потока.\n  ## --\n  ## Пока что отключено, так как вызывает проблемы, описанные в примечании выше\n  bluetooth.autoswitch-to-headset-profile = false\n}\n\nmonitor.bluez.properties = {\n  ## Включенные роли (по умолчанию: [ a2dp_sink a2dp_source bap_sink bap_source hfp_hf hfp_ag ])\n  ##\n  ## Некоторые наушники (Sony WH-1000XM3) не работают, когда роли\n  ## hsp_ag и hfp_ag включены одновременно, так что по умолчанию включаем только HFP.\n  ##\n  ## Поддерживаемые роли: hsp_hs (HSP Headset),\n  ##                      hsp_ag (HSP Audio Gateway),\n  ##                      hfp_hf (HFP Hands-Free),\n  ##                      hfp_ag (HFP Audio Gateway)\n  ##                      a2dp_sink (A2DP Audio Sink)\n  ##                      a2dp_source (A2DP Audio Source)\n  ##                      bap_sink (LE Audio Basic Audio Profile Sink)\n  ##                      bap_source (LE Audio Basic Audio Profile Source)\n  ## --\n  ## Оставляем только A2DP по описанным выше причинам\n  bluez5.roles = [ a2dp_sink a2dp_source ]\n}\n```\n\nДанное решение было предложено в баг-трекере WirePlumber.\n\n"
    },
    {
      "title": "Альтернатива: A2DP duplex channel",
      "level": 3,
      "content": "FastStream, AptX LL и «Opus 05 Pro» (специфично для pipewire) имеют «duplex» канал, который позволяет отправлять звук с микрофона без необходимости переключаться HSP/HFP и мириться с ухудшением качества звука. Эту функцию поддерживает PipeWire, но не PulseAudio. Поддержка автоматическая при обнаружении функции. Взаимодействие с существующим переключателем профилей (WirePlumber) неизвестно.\n\n"
    },
    {
      "title": "Советы и рекомендации",
      "level": 2,
      "content": "Применимы и к PipeWire, и к PulseAudio.\n\n"
    },
    {
      "title": "Уровень заряда батареи",
      "level": 3,
      "content": "Чтобы получать данные о текущем уровне заряда батареи наушников в upower, нужно включить экспериментальные функции D-Bus в настройках BlueZ, как описано в разделе Bluetooth (Русский)#Включение экспериментальных функций.\n\n"
    },
    {
      "title": "Мультимедийные кнопки",
      "level": 3,
      "content": "Для использования мультимедийных кнопок они могут быть перенаправлены в MPRIS, где их подхватят плееры, поддерживающие MPRIS для управления. Подробнее смотрите MPRIS#Bluetooth.\n\n"
    },
    {
      "title": "Мультимедийные кнопки AVRCP",
      "level": 3,
      "content": "Если на наушниках слишком чувствительное сенсорное управление, вы можете захотеть отключить его. Это можно сделать через параметр inhibited в sysfs, соответствующий устройству AVRCP, например, /sys/devices/virtual/input/input877/inhibited. Найти правильное устройство можно по его имени: например, в файле /sys/devices/virtual/input/input877/name может быть записано что-то вроде «Soundcore Life P3 (AVRCP)». Запишите 1 в файл inhibited для отключения или 0 для включения. Изменения применяются на лету, переподключение или перезагрузка чего-либо не требуется.\n\nЭтот параметр будет сбрасываться при переподключении устройства, поэтому, чтобы сделать изменение постоянным, можно создать правило udev:\n\n```\nSUBSYSTEM==\"input\" ATTR{name}==\"Soundcore Life P3 (AVRCP)\" ATTR{inhibited}=\"1\"\n```\n\n"
    }
  ]
}