{
  "title": "Bluetooth (Español)",
  "url": "https://wiki.archlinux.org/title/Bluetooth_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **La traducción de este artículo o sección no refleja el texto original.** La traducción de este artículo o sección no refleja el texto original.\n\nLa traducción de este artículo o sección no refleja el texto original.\n\nBluetooth es un protocolo estándar para comunicación inalámbrica de corta distancia en teléfonos móviles, computadores portátiles y otros equipos electrónicos. En Linux la implementación mas conocida del protocolo Bluetooth es BlueZ.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "1. Instale el paquete bluez, el cual contiene el protocolo de Bluetooth.\n1. Instale el paquete bluez-utils, el cual provee la utilidad bluetoothctl. Alternativamente, puede instalar bluez-utils-compatAUR[enlace roto: package not found], el cual contiene las herramientas obsoletas de BlueZ.\n1. El controlador genérico de Bluetooth es el módulo del kernel btusb. Verifique si el modulo ha sido cargado en su sistema. En caso de que no lo sea cargue el módulo de manera manual.\n1. Active / active inicio automático de la unidad de systemd bluetooth.service.\n\n- Por defecto el demonio de bluetooth solo ofrecerá dispositivos a usuarios que son miembros del grupo lp. Asegúrese de agregar su usuario a este grupo si desea conectarse. Es posible cambiar el grupo que se requiere en el archivo /etc/dbus-1/system.d/bluetooth.conf.\n- Algunos adaptadores de bluetooth están combinados con una tarjeta de Wi-Fi (v.g. Intel Centrino[enlace roto 2023-05-06]). Estos requieren que la tarjeta Wi-Fi sea activada (normalmente hay alguna combinación de teclas en el teclado) para que el adaptador de bluetooth le sea visible al kernel.\n- Algunos adaptadores de bluetooth (v.g. Broadcom) entran en conflicto con con el adaptador de red, así que es necesario que el dispositivo de blueetooth se conecte antes del inicio del servicio de red.\n- Algunas herramientas como hcitool o hciconfig han sido abandonadas por los desarrolladores originales, y no son incluidas en el paquete bluez-utils. Ya que estas herramientas no serán mantenidas, se recomienda que los scripts sean actualizados evitando su uso. Si de todas maneras se desea usarlas, instale el paquete bluez-utils-compatAUR[enlace roto: package not found]. Vea el reporte FS#53110 y the Bluez mailing list para más información.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- bluetoothctl — Asociar un dispositivo desde la terminal es una de las opciones mas simples y robustas para establecer una conexion.\n\n"
    },
    {
      "title": "Gráfica",
      "level": 4,
      "content": "GNOME Bluetooth es la herramienta de bluetooth de GNOME (Español). El paquete gnome-bluetooth provee el motor del programa, gnome-shell provee una miniaplicación para monitorear el estatus, y gnome-control-center provee el GUI para la configuración y se puede ver en el panel principal de configuración o desde la terminal con el comando gnome-control-center bluetooth. Es posible lanzar el comando bluetooth-sendto directamente para enviar archivos a un dispositivo remoto.\n\nPara recibir archivos, abra el panel de configuración de Bluetooth; solo se puede recibir mientras que el panel de Bluetooth este abierto.\n\nBluedevil la herramienta de Bluetooth de KDE (Español). Instale el paquete bluedevil (KDE Plasma 5).\n\nSi no hay un icono visible en Dolphin y en la bandeja de herramientas, se puede activar en las opciones de bandeja de herramientas o agregue un widget. Es posible configurar Bluedevil y detectar dispositivos Bluetooth haciendo clic en el icono. Una interfaz también esta disponible en el panel de configuración de KDE.\n\nBlueberry es una alternativa a la interfaz de Bluetooth de GNOME. Se puede instalar con el paquete blueberry. Provee una herramienta de configuración (blueberry), y una mini aplicación en la bandeja de herramientas (blueberry-tray).\n\nBlueman es un gestor completo de Bluetooth. Provee una interfaz grafica de configuración blueman-manager y una mini aplicación blueman-applet para la bandeja de herramientas. Vea Blueman para mas detalles.\n\nOtra opción, en lugar de usar los paquetes de KDE o GNOME, es ObexFS. Este permite montar teléfonos móviles que son tratados como cualquier otro sistema de ficheros.\n\nInstale obexfsAUR[enlace roto: package not found] y monte teléfonos soportados ejecutando:\n\n```\n$ obexfs -b MAC_dispositivo /puntodemontaje\n```\n\nUna vez finalizado, desmonte el dispositivo con el comando:\n\n```\n$ fusermount -u /puntodemontaje\n```\n\nPara mas información en las opciones de montaje vea http://dev.zuckschwerdt.org/openobex/wiki/ObexFs\n\nNote: **no** \n\nSi su dispositivo es compatible con el servicio de ObexFTP pero no desea montar el dispositivo, se pueden transferir o recibir archivos usando el comando obexftp.\n\nPara enviar un archivo a un dispositivo ejecute:\n\n```\n$ obexftp -b MAC_dispositivo -p /ruta/al/archivo\n```\n\nPara extraer un archivo de un dispositivo ejecute:\n\n```\n$ obexftp -b MAC_dispositivo -g nombredearchivo\n```\n\nPara dispositivos que no son compatibles con el servicio de ObexFTP, verifique si Obex Object Push es compatible.\n\n```\n# sdptool browse XX:XX:XX:XX:XX:XX\n```\n\nLea la respuesta y busque Obex Object Push. Recuerde el canal para este servicio. Si es compatible, se puede usar ussp-pushAUR[enlace roto: package not found] para enviar archivos a ese dispositivo:\n\n```\n# ussp-push XX:XX:XX:XX:XX:XX@Canal Archivo nombre_en_el_destino\n```\n\n"
    },
    {
      "title": "Asociación",
      "level": 2,
      "content": "Asociar un dispositivo desde una terminal es una de las opciones mas simples y confiables. El procedimiento exacto depende de los dispositivos específicos y su funcionalidad. La siguiente guía es un bosquejo general de la asociación de un dispositivo usando /usr/bin/bluetoothctl:\n\nComience con el comando bluetoothctl en una terminal. Teclee help para una lista de comandos disponibles.\n\n- Posiblemente seleccione un controlador tecleando select dirección MAC.\n- Encienda la energía del controlador tecleando power on. Por defecto esta apagado y se apagara de nuevo en cada reinicio, vea Encendido automatico despues de reiniciar.\n- Teclee devices para obtener la dirección MAC del dispositivo con el que se quiere asociar.\n- Entre en el modo de descubrimiento de dispositivos tecleando scan on, si el dispositivo requerido aun no esta en la lista.\n- Encienda el agente con agent on, o seleccione el agente: al presionar tabulador dos veces después de agent se vera una lista de agentes disponibles.\n- Teclee pair dirección MAC para ejecutar la asociación (completado con tabulador también funciona).\n- Si se usa un dispositivo sin PIN, es necesariamente agregar el dispositivo a la lista de dispositivos confiables antes de conectarse. Teclee trust dirección MAC para hacerlo.\n- Finalmente, use el comando connect dirección MAC para establecer una conexión.\n\nUna sesión de ejemplo puede verse de la siguiente manera:\n\n```\n# bluetoothctl \n[NEW] Controller 00:10:20:30:40:50 pi [default]\n[bluetooth]# agent on \nAgent registered\n[bluetooth]# default-agent \nDefault agent request successful\n[bluetooth]# power on\nChanging power on succeeded\n[CHG] Controller 00:10:20:30:40:50 Powered: yes\n[bluetooth]# scan on\nDiscovery started\n[CHG] Controller 00:10:20:30:40:50 Discovering: yes\n[NEW] Device 00:12:34:56:78:90 myLino\n[CHG] Device 00:12:34:56:78:90 LegacyPairing: yes\n[bluetooth]# pair 00:12:34:56:78:90\nAttempting to pair with 00:12:34:56:78:90\n[CHG] Device 00:12:34:56:78:90 Connected: yes\n[CHG] Device 00:12:34:56:78:90 Connected: no\n[CHG] Device 00:12:34:56:78:90 Connected: yes\nRequest PIN code\n[agent] Enter PIN code: 1234\n[CHG] Device 00:12:34:56:78:90 Paired: yes\nPairing successful\n[CHG] Device 00:12:34:56:78:90 Connected: no\n[bluetooth]# connect 00:12:34:56:78:90\nAttempting to connect to 00:12:34:56:78:90\n[CHG] Device 00:12:34:56:78:90 Connected: yes\nConnection successful\n```\n\n"
    },
    {
      "title": "Inicio automático después de reiniciar",
      "level": 3,
      "content": "Por defecto, los adaptadores de bluetooth no se inician después de reiniciar el computador. El metodo antiguo usando hciconfig hci0 up es obsoleto, vea release note. Ahora solo es necesario agregar la linea AutoEnable=true en el archivo /etc/bluetooth/main.conf al final de la seccion de [Policy]:\n\n```\n/etc/bluetooth/main.conf\n```\n\n```\n[Policy]\nAutoEnable=true\n```\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "Para poder usar equipo de audio como parlantes o audífonos con Bluetooth, es necesario instalar el paquete adicional pulseaudio-bluetooth.\n\nVea la pagina Bluetooth headset (ingles) para mas información acerca de audio con Bluetooth en audífonos.\n\n"
    },
    {
      "title": "Usar parlantes como audífonos de Bluetooth",
      "level": 3,
      "content": "Para habilitar que el sistema sea detectado como un A2DP sink (v.g. al reproducir música desde un móvil por los parlantes del computador), agregue lo siguiente al archivo /etc/bluetooth/audio.conf (cree el archivo si es necesario):\n\n```\n[General]\nEnable=Source\n```\n\nMas información en:\n\n- https://gist.github.com/joergschiller/1673341\n- http://www.lightofdawn.org/blog/?viewDetailed=00031\n\n"
    }
  ]
}