{
  "title": "Bootchart (Italiano)",
  "url": "https://wiki.archlinux.org/title/Bootchart_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Bootchart is a handy tool used for profiling the Linux boot sequence, generally used for making your computer boot faster. It consists of the bootchartd daemon, which records and renders a chart of profiling data.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the bootchartAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "To make use of bootchart, you have to either set it as the init process in your boot loader. Note that if you start bootchartd manually, you have to stop it manually too. In general, be extra careful with this step.\n\n"
    },
    {
      "title": "Boot loader setup",
      "level": 3,
      "content": "This generally involves making a copy of the boot option you want to profile and adding init=/usr/bin/bootchartd to it. See kernel parameters for instructions. When started from the boot loader, bootchart will stop when you get to the login prompt.\n\n"
    },
    {
      "title": "Generating a chart",
      "level": 2,
      "content": "Generating a bootchart involves running bootchart-render in a folder to which you have write access. This will generate a bootchart.png image with your chart. You will have to have a Java runtime installed and properly set up before you can do this.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 3,
      "content": "Bootchart-render cannot generate a bootchart.png image and shows the error message:\n\n```\n/var/log/bootchart.tgz not found\n```\n\nIt mostly means that bootchartd was unable to detect when the booting process was finished. This can happen when you are using different login manager than GDM such as SLiM or entrance. You have to open /usr/bin/bootchartd script and append those applications to exit_proc variable, for example:\n\n```\n# The processes we have to wait for\nlocal exit_proc=\"gdmgreeter gdm-binary slim\"\n```\n\nIf you are using no login manager, edit the exit_proc variable in this way:\n\n```\n# The processes we have to wait for\nlocal exit_proc=\"login\"\n```\n\n"
    },
    {
      "title": "Boot in 5 seconds",
      "level": 4,
      "content": "LWN Article on fast booting netbooks\n\nThis article is really awesome and along with a bunch of bootcharts provides some tips on how to boot faster. Some of those improvements are beyond reach of the ordinary user though (patching X.org, kernel, etc.).\n\n"
    },
    {
      "title": "Boot loader setup",
      "level": 4,
      "content": "This generally involves making a copy of the boot option you want to profile and adding initcall_debug printk.time=y init=/usr/bin/bootchartd2 to it. See kernel parameters for instructions. When started from the boot loader, bootchart2 will stop after either a default 120 seconds, or when you get to the login prompt (as opposite). Note that Bootchart2-git can also be run as a systemd service, as described in Improve boot performance#Using bootchart2\n\n"
    },
    {
      "title": "bootchart2.service",
      "level": 4,
      "content": "The bootchart2AUR package from AUR comes with an undocumented systemd service. After you have installed bootchart2, enable bootchart2.service.\n\nYou can visualize the results by opening /var/log/bootchart.png, or if you would like more features by launching:\n\n```\n$ pybootchartgui -i\n```\n\nRead the bootchart2 documentation for further details on using this version of Bootchart.\n\n"
    },
    {
      "title": "Configure Bootchart2",
      "level": 4,
      "content": "Bootchart2 configuration file can be adjusted:\n\n```\n/etc/bootchartd2.conf\n```\n\n```\nEXIT_PROC=\"xterm konsole gnome-terminal metacity mutter compiz ldm icewm-session enlightenment\"\n```\n\nIt can also be left empty for logging to be stopped manually rather than at a predetermined program start.\n\n"
    },
    {
      "title": "Generating a chart",
      "level": 3,
      "content": "Is as straightforward with Bootchart2 as it is with Bootchart Legacy: After bootup, run\n\n```\n$ pybootchartgui -i\n```\n\nto get an interactive chart rendering tool. See Gentoo:Bootchart2 for more information.\n\n"
    }
  ]
}