{
  "title": "Broadcom wireless (Português)",
  "url": "https://wiki.archlinux.org/title/Broadcom_wireless_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Wireless\n\nEste artigo detalha como instalar e configurar um dispositivo de rede sem fio Broadcom.\n\n"
    },
    {
      "title": "Histórico",
      "level": 2,
      "content": "A Broadcom tem um histórico notável com seu suporte a dispositivos Wi-Fi relacionados ao GNU/Linux. Durante boa parte do seu histórico inicial, os dispositivos da Broadcom eram totalmente incompatíveis ou exigiam que o usuário mexesse no firmware. O conjunto limitado de dispositivos sem fio que eram suportados era feito por um driver de engenharia reversa. O driver b43 de engenharia reversa foi introduzido no kernel 2.6.24.\n\nEm agosto de 2008, a Broadcom lançou o driver 802.11 Linux STA com suporte oficial a dispositivos sem fio da Broadcom no GNU/Linux. Este é um driver licenciado restritivamente e não funciona com ESSIDs ocultos, mas a Broadcom prometeu trabalhar para uma abordagem mais aberta no futuro.\n\nEm setembro de 2010, a Broadcom lançou um driver totalmente código aberto. O driver brcm80211 foi introduzido no kernel 2.6.37 e no kernel 2.6.39 foi subdividido nos drivers brcmsmac e brcmfmac.\n\nOs tipos de drivers disponíveis são:\n\nTable content:\nDriver | Descrição\nbrcm80211 | Versão de driver de kernel principal (recomendada)\nb43 | Versão de driver de kernel por engenharia reversa\nbroadcom-wl | Driver da Broadcom com licença restrita\n\n"
    },
    {
      "title": "Seleção de drivers",
      "level": 2,
      "content": "Para saber quais drivers podem ser operados no dispositivo de rede sem fio Broadcom do computador, será preciso detectar o ID do dispositivo e o nome do chipset. Cruze-os com a lista de dispositivos suportados pelos de drivers brcm80211[link inativo 2024-10-12 ⓘ] e b43[link inativo 2024-10-12 ⓘ].\n\n```\n$ lspci -vnn -d 14e4:\n```\n\n"
    },
    {
      "title": "brcm80211",
      "level": 3,
      "content": "O kernel contém dois drivers código abertos embutidos: brcmfmac para FullMAC nativo e brcmsmac para SoftMAC baseado em mac80211. Eles devem ser carregados automaticamente ao inicializar.\n\nNote: **brcmfmac** \n\n- brcmfmac possui suporte a chipsets mais novos, e possui suporte a modo AP, modo P2P ou criptografia de hardware.\n- brcmsmac possui suporte apenas a chipsets antigos como BCM4313, BCM43224, BCM43225.\n\n"
    },
    {
      "title": "b43",
      "level": 3,
      "content": "Dois drivers de código aberto de engenharia reversa são integrados ao kernel: b43 e b43legacy. O b43 possui suporte aos chipsets Broadcom mais recentes, enquanto o driver b43legacy possui suporte apenas aos primeiros chipsets BCM4301 e BCM4306 rev.2. Para evitar a detecção errônea do chipset da sua placa WiFi, basta adicionar à lista negra o driver não utilizado.\n\nAmbos os drivers exigem que o firmware não livre funcione. Instale b43-firmwareAUR ou b43-firmware-classicAUR.\n\nNote: **b43-firmware** \n\n- BCM4306 rev.3, BCM4311, BCM4312 and BCM4318 rev.2 foram relatados como tendo problemas com b43-firmware. Use b43-firmware-classicAUR para essas placas.\n- BCM4331 foi relatado como tendo problemas com b43-firmware-classic. Use b43-firmwareAUR para essa placa.\n\n"
    },
    {
      "title": "broadcom-wl",
      "level": 3,
      "content": "Existem duas variantes do driver licenciado restrito:\n\n- a variante comum: broadcom-wl\n- a variante DKMS: broadcom-wl-dkms\n\n- é agnóstico a kernel. Significa que ela possui suporte a diferentes kernels que você possa usar (e.g. linux-ckAUR).\n- é agnóstica a lançamento de kernel também. Ela será recompilada automaticamente após cada atualização de kernel ou nova instalação. Se você usa broadcom-wl ou outra variante dependente de lançamento de kernel (p.ex., broadcom-wl-ckAUR[link quebrado: package not found]), pode acontecer de atualizações do kernel atrapalharem o funcionamento da rede sem fim de tempo em tempo até que o pacote seja sincronizado novamente.\n- vai precisar do pacote linux-headers para o(s) kernel(s) instalado(s) para compilar o módulo. Esses pacotes são opcionais para o pacote DKMS e precisarão ser instalados manualmente.\n\n"
    },
    {
      "title": "Instalação offline",
      "level": 4,
      "content": "Uma conexão com a Internet é a maneira ideal de instalar o driver broadcom-wl; muitos laptops mais novos com placas Broadcom dispensam portas Ethernet, portanto, um adaptador Ethernet USB ou Android tethering pode ser útil. Se você não tiver nenhum dos dois, será necessário primeiro instalar o grupo base-devel durante a instalação. Em seguida, use outro computador conectado à Internet para fazer o download do linux-headers e o tarball do driver do AUR e instale-os nessa ordem.\n\n"
    },
    {
      "title": "Manualmente",
      "level": 4,
      "content": "Instale o driver apropriado para sua arquitetura de sistema no site da Broadcom. Depois disso, para evitar colisões de driver/módulo com módulos semelhantes e disponibilizar o driver, faça:\n\n```\n# rmmod b43\n# rmmod ssb\n# modprobe wl\n```\n\nO módulo wl deve carregar automaticamente lib80211 ou lib80211_crypt_tkip; do contrário, eles terão que ser carregados manualmente.\n\nSe o driver não funcionar neste momento, talvez seja necessário atualizar as dependências:\n\n```\n# depmod -a\n```\n\nPara fazer com que o módulo seja carregado na inicialização, consulte Módulos de kernel. É recomendando a você adicionar à lista negra os módulos conflitantes.\n\n"
    },
    {
      "title": "Configurando broadcom-wl no modo monitor",
      "level": 3,
      "content": "O modo de monitor é usado para capturar quadros 802.11 pelo ar. Isso pode ser útil para diagnosticar problemas em uma rede ou testar a segurança da sua rede sem fio. Frequentemente, o modo de monitor é necessário para capturar certos quadros para teste de penetração sem fio, mas pode ser antiético ou até ilegal capturar quadros em qualquer rede que você não possua, gerencie ou tenha permissão para realizar testes de penetração.\n\nPara definir broadcom-wl no modo de monitor, você deve definir 1 para /proc/brcm_monitor0:\n\n```\n# echo 1 > /proc/brcm_monitor0\n```\n\nEle irá criar uma nova interface de rede chamada prism0.\n\nPara trabalhar no modo monitor, use essa interface de rede recém-criada.\n\n"
    },
    {
      "title": "Dispositivo inacessível após atualização do kernel",
      "level": 3,
      "content": "Desde o kernel 3.3.1, o módulo bcma foi introduzido. Se estiver usando um driver brcm80211, certifique-se de que ele não esteja em lista negra. Deve ser negado se usar um driver b43.\n\nSe você estiver usando broadcom-wl, desinstale e reinstale-o após atualizar seu kernel, ou alterne para o pacote broadcom-wl-dkms.\n\n"
    },
    {
      "title": "Dispositivo com driver broadcom-wl são funcionando ou não sendo mostrado",
      "level": 3,
      "content": "Certifique-se de que os módulos corretos estão na lista negra e, ocasionalmente, pode ser necessário colocar os drivers brcm80211 na lista negra, caso tenham sido acidentalmente detectados antes de o driver wl ser carregado. Além disso, atualize as dependências dos módulos com depmod -a, verifique a interface sem fio com ip addr, os upgrades de kernel exigirão uma atualização do pacote não-DKMS.\n\n"
    },
    {
      "title": "Interfaces trocadas com broadcom-wl",
      "level": 3,
      "content": "Os usuários do driver broadcom-wl podem achar que suas interfaces Ethernet e Wi-Fi foram trocadas. Consulte Configuração de rede#Interfaces de rede para uma resposta.\n\n"
    },
    {
      "title": "Interface está sendo mostrada, mas não permite conexões",
      "level": 3,
      "content": "Acrescente ao final o seguinte parâmetro do kernel:\n\n```\nb43.allhwsupport=1\n```\n\n"
    },
    {
      "title": "Suprimindo mensagens de console",
      "level": 3,
      "content": "Você pode continuamente obter algumas mensagens verbosas e irritantes durante a inicialização, semelhante a\n\n```\nphy0: brcms_ops_bss_info_changed: arp filtering: enabled true, count 0 (implement)\nphy0: brcms_ops_bss_info_changed: qos enabled: false (implement)\nphy0: brcms_ops_bss_info_changed: arp filtering: enabled true, count 1 (implement)\nenabled, active\n```\n\nPara desabilitar essas mensagens, aumente o nível de log das mensagens impressas que chegam ao console - consulte Inicialização silenciosa#sysctl.\n\n"
    },
    {
      "title": "Dispositivo BCM43241 não detectado",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nEste dispositivo não será exibido com lspci nem lsusb; ainda não há solução conhecida. Por favor, remova esta seção quando for resolvido.\n\n"
    },
    {
      "title": "Conexão está instável com alguns roteadores",
      "level": 3,
      "content": "Se nenhum outra abordagem ajudar, instale linux-lts ou use uma versão anterior.\n\n"
    },
    {
      "title": "Nenhum 5GHz para dispositivos BCM4360 (14e4:43a0) / BCM43602 (14e4:43ba)",
      "level": 3,
      "content": "O problema parece estar vinculado a um problema de canal, pelo menos nos Estados Unidos. Alterar o canal sem fio para um número de canal inferior (como 40 ou, se seu roteador mostra MHz em vez de números de canais, como 5200 MHz ou 5280 MHz) parece permitir a conexão a bandas de 5GHz.\n\n"
    },
    {
      "title": "Dispositivo funciona de forma intermitente",
      "level": 3,
      "content": "Em alguns casos (p.ex., usando BCM4331 e b43-firmwareAUR), a conexão Wi-Fi funciona de forma intermitente. Uma forma de corrigir isso é verificar se a placa está hard-blocked ou soft-blocked pelo kernel e, se estiver, desbloqueá-la com rfkill.\n\n"
    }
  ]
}