{
  "title": "Bspwm/Example configurations (Русский)",
  "url": "https://wiki.archlinux.org/title/Bspwm/Example_configurations_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Bspwm/Примеры настроек\n- Оконный менеджер\n- Сравнение тайловых оконных менеджеров\n\nbspwm тайловый оконный менеджер представляющий окна как слои двоичного дерева. Также поддерживает EWMH и несколько мониторов. Настраивается и управляется с помощью сообщений.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите bspwm и sxhkd, или разрабатываемую версию: bspwm-gitAUR и sxhkd-gitAUR. Sxhkd простой демон горячих клавиш X, использующий для связи bspc с bspwm, он также запускает выбранные вами приложения.\n\nДля запуска bspwm при входе в систему, добавьте следующие строки в ~/.xinitrc или ~/.xprofile (в зависимости от того, как вы запускаете X / ваш менеджер дисплея):\n\n```\nsxhkd &\nexec bspwm\n```\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Пример настроек находится в /usr/share/doc/bspwm/examples/ и на GitHub.\n\nВажно: Создайте ваше переменное окружение $XDG_CONFIG_HOME правильно, иначе bspwmrc не будет найден. Это можно сделать путём добавления XDG_CONFIG_HOME=\"$HOME/.config\" и экспорта XDG_CONFIG_HOME в ваш ~/.profile.\n\nСоздайте ~/.config/bspwm/ и ~/.config/sxhkd/, затем скопируйте /usr/share/doc/bspwm/examples/bspwmrc в ~/.config/bspwm/ и /usr/share/doc/bspwm/examples/sxhkdrc в ~/.config/sxhkd/. Сделайте bspwmrc выполняемым chmod +x ~/.config/bspwm/bspwmrc.\n\nЭти два файла, в которых вы будете устанавливать соответственно настройки wm (оконного менеджера) и горячих клавиш. В качестве примера, смотрите bspwm/Example configurations.\n\nДокументацию для bspwm можно посмотреть выполнив bspwm(1).\n\nТакже есть документация для sxhkd, выполните sxhkd(1).\n\n"
    },
    {
      "title": "Примечание для установки нескольких мониторов",
      "level": 3,
      "content": "Пример настройки bspwmrc, для десяти рабочих столов на одном мониторе:\n\n```\nbspc monitor -d I II III IV V VI VII VIII IX X\n```\n\nВам нужно будет изменить эту строку и добавить для каждого монитора, например:\n\n```\nbspc monitor DVI-I-1 -d I II III IV\nbspc monitor DVI-I-2 -d V VI VII\nbspc monitor DP-1 -d VIII IX X\n```\n\nВы можете использовать запросы `xrandr -q` или `bspc query -M` чтобы узнать имя монитора.\n\nВ примере выше, было сохранено общее количество рабочих столов, - десять. Это связано с тем, что к каждому рабочему столу можно обратиться с помощью 'super + {1-9,0}' в sxhkdrc.\n\n"
    },
    {
      "title": "Правила",
      "level": 3,
      "content": "Есть два способа установить правила для окна (rules) (по состоянию на cd97a32).\n\nВо-первых, с помощью встроенной команды правила, как показано в примере bspwmrc:\n\n```\nbspc rule -a Gimp desktop=^8 follow=on state=floating\nbspc rule -a Chromium desktop=^2\nbspc rule -a mplayer2 state=floating\nbspc rule -a Kupfer.py focus=on\nbspc rule -a Screenkey manage=off\n```\n\nВторой вариант заключается в использовании внешней команды правил. Этот вариант более сложный, но может позволить вам разрабатывать более сложные правила для окна. Смотрите команды правил в этих примерах.\n\nЕсли какое-то окно, не ведёт себя в соответствии с вашими правилами, проверьте имя класса программы. Это можно сделать запустив xprop | grep WM_CLASS чтобы убедиться, что вы используете правильную строку.\n\n"
    },
    {
      "title": "Панели",
      "level": 3,
      "content": "Пример панели для lemonbarAUR есть в каталоге examples на странице GitHub. Вы также можете получить некоторые идеи из страници Wiki lemonbar. Панель будет запускаться командой panel & в вашем bspwmrc. Проверьте дополнительные зависимости пакета bspwm которые могут потребоваться.\n\nДля отображения информации о системе на строке состояния, вы можете использовать различные системные вызовы. Этот пример покажет вам как изменить panel , чтобы получить статус громкости на панели:\n\n```\npanel_volume()\n{\n        volStatus=$(amixer get Master | tail -n 1 | cut -d '[' -f 4 | sed 's/].*//g')\n        volLevel=$(amixer get Master | tail -n 1 | cut -d '[' -f 2 | sed 's/%.*//g')\n        # is alsa muted or not muted?\n        if [ \"$volStatus\" == \"on\" ]\n        then\n                echo \"%{Fyellowgreen} $volLevel %{F-}\"\n        else\n                # If it is muted, make the font red\n                echo \"%{Findianred} $volLevel %{F-}\"\n        fi\n}\n```\n\nДалее, мы должны убедиться, что она вызывается и отправляет в $PANEL_FIFO:\n\n```\nwhile true; do\necho \"S\" \"$(panel_volume) $(panel_clock) > \"$PANEL_FIFO\"\n        sleep 1s\ndone &\n```\n\n"
    },
    {
      "title": "Блокнот",
      "level": 3,
      "content": "Вы можете эмулировать блокнот (как в i3) путем добавления ярлыка для этой команды:\n\n```\nxdotool search --onlyvisible --classname scratchpad windowunmap \\\n|| xdotool search --classname scratchpad windowmap \\\n|| st -c scratchpad -g 1000x400+460 &\n```\n\nи добавив это правило:\n\n```\nbspc rule -a scratchpad sticky=on state=floating\n```\n\nСмотрите также [1] и [2][устаревшая ссылка 2024-01-13 ⓘ].\n\nДля блокнота, который может использовать любой тип окна без предопределенных правил, смотрите: [3]\n\nДля более сложных скриптов блокнота, которые поддерживают множество терминалов \"из коробки\", имеют флаги, делают при необходимости запуск сессии tmuxinator / tmux, превращают любое окно в блокнот на лету, автоматически меняют размер блокнота соответствующему монитору, смотрите tdrop-gitAUR.\n\n"
    },
    {
      "title": "Различные настройки монитора для различных машин",
      "level": 3,
      "content": "Так как bspwmrc это сценарий оболочки, он позволяет делать такие вещи:\n\n```\n#! /bin/sh\n\n if [[ $(hostname) == 'myhost' ]]; then\n     bspc monitor eDP1 -d I II III IV V VI VII VIII IX X\n elif [[ $(hostname) == 'otherhost' ]]; then\n     bspc monitor VGA-0 -d I II III IV V\n     bspc monitor VGA-1 -d VI VII VIII IX X\n elif [[ $(hostname) == 'yetanotherhost' ]]; then\n     bspc monitor DVI-I-3 -d VI VII VIII IX X\n     bspc monitor DVI-I-2 -d I II III IV V\n fi\n```\n\n"
    },
    {
      "title": "Помогите! У меня пустой экран и мои горячие клавиши не работают!",
      "level": 3,
      "content": "Есть несколько способов уладить это. Во-первых, пустой экран это хорошо. Это означает, что bspwm работает.\n\nДля начала убедитесь что в вашем xinitrc есть эти строки\n\n```\nsxhkd &\nexec bspwm\n```\n\nАмперсанд имеет важное значение. Далее, попробуйте вызвать терминал в вашем xinitrc, чтобы увидеть, получите ли вы его правильное положение. Он должен появиться несколько \"по центру\" на экране. Для этого используйте этот .xinitrc:\n\n```\nsxhkd &\nurxvt &\nexec bspwm\n```\n\nЕсли ничего не отображается, это означает, что вы, вероятно, забыли установить urxvt. Если он оказался вверху, но не по центру экрана, или занимает большую часть экрана, это означает, что BSPWM не начал работу должным образом. Убедитесь что вы выполнили chmod +x ~/.config/bspwm/bspwmrc .\n\nДалее, введите в этом запустившемся терминале pidof sxhkd. Команда покажет число. Если этого не произойдет, это означает, что sxhd не работает. Выполните sxhkd -c ~/.config/sxhkd/sxhkdrc . Кроме того, можно попробовать изменить клавишу Super на другую, например Alt в вашем sxhkdrc и посмотреть, поможет ли это. Другой распространенной проблемой является копирование текста из файла примеров, вместо физического копирования файла. Копирование / вставка кода обычно приводит к проблемам отступов, к которые sxhkd может быть чувствительным.\n\n"
    },
    {
      "title": "Размер окна больше самого приложения!",
      "level": 3,
      "content": "Это может произойти, если вы используете приложения GTK3, обычно это происходит с диалоговыми окнами. Для решения проблемы необходимо создать или добавить ниже в файле темы GTK3 (~/.config/gtk-3.0/gtk.css).\n\n```\n.window-frame, .window-frame:backdrop {\n  box-shadow: 0 0 0 black;\n  border-style: none;\n  margin: 0;\n  border-radius: 0;\n}\n    \n.titlebar {\n  border-radius: 0;\n}\n```\n\n(источник: Bspwm forum thread)\n\n"
    },
    {
      "title": "Проблемы с приложениями Java",
      "level": 3,
      "content": "Если у вас есть проблемы, например окно приложения Java не меняет размер, или меню закрывается после щелчка, смотрите Java#Gray window, applications not resizing with WM, menus immediately closing.\n\n"
    },
    {
      "title": "Проблемы, связанные с использованием назначения клавиш fish",
      "level": 3,
      "content": "Если вы используете fish, вы обнаружите, что не можете переключаться между рабочими столами. Это происходит потому что bspc's использует символ ^ несовместимый с fish. Вы можете это исправить, сказав sxhkd использовать bash для выполнения команд:\n\n```\n$ set -U SXHKD_SHELL /usr/bin/bash\n```\n\nВ качестве альтернативы, символ ^ может быть символом обратной косой черты в файле sxhkdrc.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Mailing List: bspwm at librelist.com.\n- #bspwm - IRC channel at irc.libera.chat\n- https://bbs.archlinux.org/viewtopic.php?id=149444 - Arch BBS thread\n- https://github.com/baskerville/bspwm - GitHub project\n- https://github.com/windelicato/dotfiles/wiki/bspwm-for-dummies - earsplit's \"bspwm for dummies\"\n\n"
    }
  ]
}