{
  "title": "Bspwm (Español)",
  "url": "https://wiki.archlinux.org/title/Bspwm_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artículos relacionados\n\n- bspwm/Example configurations\n- Gestor de ventanas\n- Comparison of tiling window managers\n\nNote: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nbspwm es un gestor de ventanas tipo mosaico que organiza las ventanas en un árbol binario completo. Tiene soporte para EWMH y múltiples monitores, y se configura y controla a través de mensajes.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale bspwm y sxhkd, o las versiones en desarrollo: bspwm-gitAUR y sxhkd-gitAUR. sxhkd es un simple servicio de combinaciones de teclas usables dentro de X, requerido para comunicarse con bspwm y lanzar aplicaciones a elección.\n\nPara comenzar bspwm al iniciar sesión, añada lo siguiente a ~/.xinitrc o ~/.xprofile (dependiendo de cómo ha escogido iniciar X):\n\n```\nsxhkd &\nexec bspwm\n```\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Puede encontrar ejemplos de configuración en /usr/share/doc/bspwm/examples/ y en GitHub.\n\nCree los directorios ~/.config/bspwm/ y ~/.config/sxhkd/, y luego copie /usr/share/doc/bspwm/examples/bspwmrc a ~/.config/bspwm/ y /usr/share/doc/bspwm/examples/sxhkdrc a ~/.config/sxhkd/. En estos dos archivos se definirán las configuraciones y las combinaciones de teclas, respectivamente. Por último, haga que el archivo bspwmrc sea ejecutable, con chmod +x ~/.config/bspwm/bspwmrc.\n\nLas opciones de configuración para cada archivo se encuentran enlistadas y descritas en bspwm(1) y sxhkd(1).\n\n"
    },
    {
      "title": "Para múltiples monitores",
      "level": 3,
      "content": "El ejemplo de bspwmrc configura diez escritorios para un sólo monitor:\n\n```\nbspc monitor -d I II III IV V VI VII VIII IX X\n```\n\nEsa línea tendría que ser dividida para cada monitor:\n\n```\nbspc monitor DVI-I-1 -d I II III IV\nbspc monitor DVI-I-2 -d V VI VII\nbspc monitor DP-1 -d VIII IX X\n```\n\nPara averiguar el nombre de sus monitores, puede escribir xrandr -q o bspc query -M en su terminal.\n\nEn el ejemplo anterior, el número total de escritorios fue limitado a diez. Esto es para que cada escritorio pueda ser invocado con 'super + {1-9,0}', de acuerdo a al ejemplo de sxhkdrc. La tecla de inicio de Windows es denominada universalmente como 'super', y es la más utilizada en el ejemplo de sxhkdrc.\n\n"
    },
    {
      "title": "Reglas",
      "level": 3,
      "content": "Hay dos formas de definir reglas para el comportamiento de ventanas (a partir de cd97a32).\n\nLa primera consiste en usar el comando de regla integrado (bspc), como se muestra en el ejemplo de bspwmrc:\n\n```\nbspc rule -a Gimp desktop=^8 follow=on state=floating\nbspc rule -a Chromium desktop=^2\nbspc rule -a mplayer2 state=floating\nbspc rule -a Kupfer.py focus=on\nbspc rule -a Screenkey manage=off\n```\n\nLa segunda opción consiste en usar un comando de regla externo. Esto es más complejo, pero permite diseñar reglas más específicas. Vea estos ejemplos.\n\nSi alguna ventana desobedece a bspwmrc, asegúrese de que la regla correspondiente invoque al programa con el sinónimo ejecutable de su nombre oficial. Puede averiguar dicho sinónimo, ejecutando: xprop | grep WM_CLASS (requiere tener xorg-xprop instalado).\n\n"
    },
    {
      "title": "Paneles",
      "level": 3,
      "content": "Aparte de los ejemplos de bspwmrc y de sxhkdrc, en la carpeta examples se encuentra un ejemplo para integrar un panel lemonbarAUR. Para aprender más acerca de su uso, visite nuestra entrada de lemonbar. Revise las dependencias opcionales que pueda necesitar para su configuración deseada.\n\nEl panel se ejecuta incluyendo la línea panel & en su bspwmrc.\n\nPara visualizar información del sistema en la barra de estado, se puede usar diversas llamadas al sistema. El siguiente ejemplo le enseñará a conseguir que su panel muestre el estado del volumen de audio:\n\n```\npanel_volume()\n{\n        volStatus=$(amixer get Master | tail -n 1 | cut -d '[' -f 4 | sed 's/].*//g')\n        volLevel=$(amixer get Master | tail -n 1 | cut -d '[' -f 2 | sed 's/%.*//g')\n        # ¿está alsa en mute o no?:\n        if [ \"$volStatus\" == \"on\" ]\n        then\n                echo \"%{Fyellowgreen} $volLevel %{F-}\"\n        else\n                # si está en mute, que la fuente sea roja:\n                echo \"%{Findianred} $volLevel %{F-}\"\n        fi\n}\n```\n\nLuego, verificaremos que es invocado y redirigido a $PANEL_FIFO:\n\n```\nwhile true; do\necho \"S\" \"$(panel_volume) $(panel_clock) > \"$PANEL_FIFO\"\n        sleep 1s\ndone &\n```\n\n"
    },
    {
      "title": "Scratchpad",
      "level": 3,
      "content": "Se puede emular un scratchpad (un terminal invocado en cualquier lugar del escritorio para ejecutar un comando específico), añadiendo una combinación de teclas para su invocación con xdotool:\n\n```\nxdotool search --onlyvisible --classname scratchpad windowunmap \\\n|| xdotool search --classname scratchpad windowmap \\\n|| st -c scratchpad -g 1000x400+460 &\n```\n\ny añadiendo esta regla:\n\n```\nbspc rule -a scratchpad sticky=on state=floating\n```\n\nVéase [1] y [2][enlace roto 2024-01-13].\n\nPara un scratchpad que prescinda de reglas pre-definidas, véase: [3]\n\nPara un scratchpad con más sofisticación de comportamiento, instale tdrop-gitAUR.\n\n"
    },
    {
      "title": "bspwmrc como script",
      "level": 3,
      "content": "Dado que bspwmrc es un script (guión de comandos), usted puede hacer con él cosas como éstas:\n\nConfiguraciones diferentes para cada monitor:\n\n```\n#! /bin/sh\n\n if [[ $(hostname) == 'myhost' ]]; then\n     bspc monitor eDP1 -d I II III IV V VI VII VIII IX X\n elif [[ $(hostname) == 'otherhost' ]]; then\n     bspc monitor VGA-0 -d I II III IV V\n     bspc monitor VGA-1 -d VI VII VIII IX X\n elif [[ $(hostname) == 'yetanotherhost' ]]; then\n     bspc monitor DVI-I-3 -d VI VII VIII IX X\n     bspc monitor DVI-I-2 -d I II III IV V\n fi\n```\n\nQue todas las ventanas sean flotantes:\n\n```\n#!/bin/bash\n\n # change the desktop number here\n FLOATING_DESKTOP_ID=$(bspc query -D -d '^3')\n\n bspc subscribe node_manage | while read -a msg ; do\n    desk_id=${msg[2]}\n    wid=${msg[3]}\n    [ \"$FLOATING_DESKTOP_ID\" = \"$desk_id\" ] && bspc node \"$wid\" -t floating\n done\n```\n\n(fuente)\n\n"
    },
    {
      "title": "Aparece una pantalla negra y las combinaciones de teclas no funcionan",
      "level": 3,
      "content": "Primero que todo, una pantalla negra significa que bspwm está funcionando. Respecto a las combinaciones de teclas, verifique que usted haya seguido los pasos correctamente. Si lo había hecho así, entonces incluya la ejecución de un emulador de terminal en ~/.xinitrc:\n\n```\nsxhkd &\n[su terminal de preferencia] &\nexec bspwm\n```\n\nHabiendo iniciado X con startx, usted tendrá su emulador de terminal dispuesto. Ahora, tipee pidof sxhkd. Si el comando no devuelve un número, inténtelo de nuevo asociando sxhkd con sxhkdrc explícitamente, ejecutando pidof sxhkd -c ~/.config/sxhkd/sxhkdrc.\n\nTambién puede intentar cambiando la tecla 'super' por 'Alt', en sxhkdrc.\n\n"
    },
    {
      "title": "Una aplicación no ocupa todo el espacio de su ventana",
      "level": 3,
      "content": "Esto puede pasar si está usando aplicaciones GTK3, y especialmente en el caso de los cuadros de diálogo. Si se trata de eso, añada lo siguiente a ~/.config/gtk-3.0/gtk.css:\n\n```\n.window-frame, .window-frame:backdrop {\n  box-shadow: 0 0 0 black;\n  border-style: none;\n  margin: 0;\n  border-radius: 0;\n}\n    \n.titlebar {\n  border-radius: 0;\n}\n```\n\n(fuente: foro de bspwm)\n\n"
    },
    {
      "title": "Problemas con aplicaciones Java",
      "level": 3,
      "content": "Si, por ejemplo, las aplicaciones Java no pueden cambiar de tamaño o sus menús se cierran espontáneamente, véase Java#Gray window, applications not resizing with WM, menus immediately closing.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Mailing List: bspwm en librelist.com.\n- #bspwm - canal IRC en irc.libera.chat\n- https://bbs.archlinux.org/viewtopic.php?id=149444 - Tema en el foro Arch BBS\n- https://github.com/baskerville/bspwm - GitHub\n- https://github.com/windelicato/dotfiles/wiki/bspwm-for-dummies - Un \"bspwm para tontos\"\n\n"
    }
  ]
}