{
  "title": "Budgie (Čeština)",
  "url": "https://wiki.archlinux.org/title/Budgie_(%C4%8Ce%C5%A1tina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nSouvisející články\n\n- Desktop environment\n- Display manager (Česky)\n- Window manager\n- GTK+\n\nBudgie je výchozím pracovním prostředím operačního systému Solus. Kromě moderního vzhledu, může prostředí Budgie navozovat pocit práce jako v desktopovém prostředí GNOME 2.\n\nV tuto chvíli je prostředí Budgie intenzivně vyvíjeno, takže se můžete setkat s menšími chybami spolu s tím, jak jsou přidávány nové funkce v průběhu vývoje.\n\n"
    },
    {
      "title": "Instalace",
      "level": 2,
      "content": "Nainstalujte balíček budgie-desktop pro získání nejnovějšího stabilního vydání, případně budgie-desktop-gitAUR pro vývojovou verzi z GITu. Je doporučeno nainstalovat také doporučené závislosti pro získání mnohem komplexnějšího desktopového prostředí. Není na škodu doinstalovat celou skupinu balíčků gnome, které jsou standardně součástí prostředí GNOME.\n\n"
    },
    {
      "title": "Spuštění",
      "level": 3,
      "content": "Vyberte sezení Budgie Desktop ve Vašem oblíbeném správci přihlášení, nebo upravte nastavení v souboru xinitrc pro zahrnutí prostředí Budgie po spuštění:\n\n```\n~/.xinitrc\n```\n\n```\nexport XDG_CURRENT_DESKTOP=Budgie:GNOME\nexec budgie-desktop\n```\n\n"
    },
    {
      "title": "Práce s prostředím",
      "level": 2,
      "content": "Můžete sledovat oznamovací zprávy, upravovat hlasitost, změnit si vzhled a přizpůsobit si celkově prostředí dle Vašich potřeb pomocí postranního panelu pojmenovaného \"Raven\". Do panelu se lze dostat po stisknutí kláves Super+N nebo kliknutím na stavový aplet v hlavním panelu.\n\n"
    },
    {
      "title": "Více informací",
      "level": 2,
      "content": "- Oficiální stránka projektu Solus\n- Oficiální GIT repozitář projektu Solus\n\n"
    }
  ]
}