{
  "title": "Budgie (Português)",
  "url": "https://wiki.archlinux.org/title/Budgie_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Ambiente de desktop\n- Gerenciador de exibição\n- Gerenciador de janela\n- GTK\n\nO Budgie é o desktop padrão do Solus Operating System, escrito do zero. Além de um design mais moderno, o Budgie pode emular a aparência da área de trabalho do GNOME 2.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote budgie-desktop para a versão estável ou budgie-desktop-gitAUR para a versão de desenvolvimento. É recomendado instalar suas dependências opcionais também para obter um ambiente de desktop mais completo. É recomendado também instalar o grupo gnome, que contém os aplicativos necessários para a experiência padrão do GNOME.\n\n"
    },
    {
      "title": "Iniciando",
      "level": 2,
      "content": "Escolha a sessão Budgie Desktop de um gerenciador de exibição de sua escolha, ou modifique xinitrc para incluir o Budgie Desktop:\n\n```\n~/.xinitrc\n```\n\n```\nexport XDG_CURRENT_DESKTOP=Budgie:GNOME\nexec budgie-desktop\n```\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Você pode ver as mensagens de notificação, definir o volume e modificar a aparência da área de trabalho com a barra lateral chamada \"Raven\". A seção \"Notificações\" pode ser acessada com Super+N e a seção \"Applets\" pode ser acessada com Super+A ou clicando no applet Indicador de Status.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "A configuração do Budgie Desktop é feita através da barra lateral e as alterações nas configurações do sistema são feitas através do gnome-control-center\n\n"
    },
    {
      "title": "Mudando o botão de layout",
      "level": 3,
      "content": "O layout do botão da janela pode ser alterado usando dconf, dconf-editor ou gsettings.\n\nPor exemplo:\n\n```\ngsettings set com.solus-project.budgie-wm button-layout 'close,minimize,maximize:appmenu'\ngsettings set com.solus-project.budgie-helper.workarounds fix-button-layout 'close,minimize,maximize:menu'\n```\n\n"
    },
    {
      "title": "Habilitar tela de bloqueio",
      "level": 3,
      "content": "Para habilitar a tela de bloqueio após um certo período de inatividade, instale gnome-screensaverAUR[link quebrado: package not found].\n\n"
    },
    {
      "title": "Use um window manager diferente",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nÉ possível usar um gerenciador de janela alternativo com o Budgie. Defina um Sessão GNOME personalizada que substitua budgie-wm por outro gerenciador de janela ou autostart meu-wm --replace onde meu-wm é o nome do executável do gerenciador de janelas que você deseja usar.\n\n"
    },
    {
      "title": "Veja Também",
      "level": 2,
      "content": "- Wikipedia:Budgie (desktop environment)\n- Site oficial do Budgie Desktop\n- Repositório git oficial para o desenvolvimento do Budgie\n\n"
    }
  ]
}