{
  "title": "Budgie (Español)",
  "url": "https://wiki.archlinux.org/title/Budgie_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-12-12** \n\nArtículos relacionados\n\n- Entornos de escritorio\n- Gestor de pantallas\n- Gestor de ventanas\n- GTK+\n\nBudgie es el escritorio predeterminado de Solus Operating System, escrito desde cero. Además de un diseño más moderno, Budgie puede emular la apariencia y la sensación del escritorio GNOME 2.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete budgie-desktop para la última versión estable o budgie-desktop-gitAUR para el git master actual. También se recomienda instalar las dependencias opcionales para obtener un entorno de escritorio aún más completo. Así mismo, también se recomienda instalar el grupo de paquetes gnome, que contiene las aplicaciones necesarias para una experiencia estándar de GNOME.\n\n"
    },
    {
      "title": "Puesta en marcha",
      "level": 2,
      "content": "Elija la sesión Budgie Desktop en el gestor de pantallas de su elección, o modifique xinitrc para incluir Budgie Desktop:\n\n```\n~/.xinitrc\n```\n\n```\nexport XDG_CURRENT_DESKTOP=Budgie:GNOME\nexec budgie-desktop\n```\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Puede ver los mensajes de notificación, configurar el volumen y modificar la apariencia y sensación del escritorio con la barra lateral llamada \"Raven\". Se puede acceder a ella con la combinación Super+N o haciendo clic en el applet de indicador de estado.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "La configuración de Budgie Desktop se realiza a través de la barra lateral, y los cambios en la configuración del sistema se realizan a través de gnome-control-center\n\n"
    },
    {
      "title": "Cambiar la distribución de los botones",
      "level": 3,
      "content": "La distribución de los botones de las ventanas se pueden cambiar utilizando dconf, dconf-editor o gsettings.\n\nPor ejemplo:\n\n```\ngsettings set com.solus-project.budgie-wm button-layout 'close,minimize,maximize:appmenu'\ngsettings set com.solus-project.budgie-helper.workarounds fix-button-layout 'close,minimize,maximize:menu'\n```\n\n"
    },
    {
      "title": "Usar un gestor de ventanas distinto",
      "level": 3,
      "content": "Es posible utilizar un gestor de ventanas alternativo con Budgie. O bien defina una sesión personalizada de GNOME que reemplaze a budgie-wm con otro gestor de ventanas o bien autoinicie my-wm --replace donde my-wm es el nombre ejecutable del gestor de ventanas que desea usar.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Wikipedia:Budgie (entorno de escritorio)\n- Página web oficial de Budgie Desktop\n- Repositorios oficiales de git para el desarrollo de Solus\n\n"
    }
  ]
}