{
  "title": "Budgie (Русский)",
  "url": "https://wiki.archlinux.org/title/Budgie_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Среда рабочего стола\n- Экранный менеджер\n- Оконный менеджер\n- GTK (Русский)\n\nBudgie — среда рабочего стола, в прошлом — проект, разрабатываемый в рамках Solus, ставший независимым под управлением организации Buddies of Budgie в январе 2022 года. Она использует GTK 3 для виджетов и написана на C и Vala. На момент релиза версии Budgie 10 доступен только сеанс Xorg.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите группу пакетов budgie, чтобы установить все основные компоненты рабочего стола. Пакеты также могут быть установлены по отдельности — используйте пакет budgie-desktop для последней стабильной версии или budgie-desktop-gitAUR для текущего git main. Также параллельно могут быть установлены budgie-screensaver для поддержки блокировки рабочего стола и budgie-control-center для модификации системных настроек. Следующие пакеты опциональны, однако добавляют дополнительные функции в рабочий стол:\n\n- budgie-desktop-view: Официальная реализация иконок рабочего стола\n- budgie-backgrounds: Официальный набор стандартных фонов рабочего стола\n- network-manager-applet: Управление сетью из панели\n- materia-gtk-theme или arc-gtk-themeAUR: Рекомендованные темы GTK\n- papirus-icon-theme: Тема иконок по умолчанию\n\nДополнительные апплеты, разработанные командой Ubuntu Budgie доступны в пакете budgie-extras - однако имейте в виду, что этот пакет также модифицирует уже имеющиеся функции и может создать проблемы.\n\n"
    },
    {
      "title": "Запуск",
      "level": 2,
      "content": "Выберите сеанс Budgie Desktop в экранном менеджере или измените xinitrc, добавив Budgie Desktop:\n\n```\n~/.xinitrc\n```\n\n```\nexport XDG_CURRENT_DESKTOP=Budgie:GNOME\nexec budgie-desktop\n```\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Вы можете видеть уведомления, устанавливать системную громкость и громкость для приложений, просматривать календарь, и просмотреть проигрываемые видео и музыку при помощи боковой панели под названием \"Raven\". Доступ к разделу \"Уведомления\" осуществляется нажатием Super+n или щелчком по апплету \"Уведомления\". Доступ к разделу \"Апплеты\" может быть получен нажатием Super+a. Raven также можно открыть нажатием на апплет \"Raven Trigger\", после чего он откроется на последней выбранной панели.\n\n"
    },
    {
      "title": "Темы",
      "level": 2,
      "content": "Budgie использует GTK 3 для своих элементов интерфейса, и таким образом, поддерживается многими темами GTK. Budgie также предоставляет встроенную тему, которая применяется только к собственным элементам, таким как панели и Raven, и может быть настроена в настройках рабочего стола Budgie. Темы иконок и курсоров настраиваются там же.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Настройка рабочего стола Budgie выполняется при помощи встроенного приложения \"Настройки рабочего стола Budgie\", а изменения в системные настройки выполняются через budgie-control-center.\n\n"
    },
    {
      "title": "Изменение раскладки кнопок",
      "level": 3,
      "content": "Изменить раскладку кнопок на окнах можно при помощи dconf, dconf-editor или gsettings.\n\nНапример:\n\n```\n$ gsettings set com.solus-project.budgie-wm button-layout 'close,minimize,maximize:appmenu'\n$ gsettings set com.solus-project.budgie-helper.workarounds fix-button-layout 'close,minimize,maximize:menu'\n```\n\n"
    },
    {
      "title": "Использование иного менеджера окон",
      "level": 3,
      "content": "Budgie не поддерживает использование другого оконного менеджера.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Wikipedia:Budgie (desktop environment)\n- Official Budgie Desktop website\n- Official git repositories for Budgie development\n\n"
    }
  ]
}