{
  "title": "C (Español)",
  "url": "https://wiki.archlinux.org/title/C_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-15** \n\nEl kernel Linux y las herramientas de usuario GNU están escritos principalmente en C.\n\nArch Linux utiliza la Biblioteca de C de GNU (glibc) como la biblioteca estándar de C; es una dependencia del meta paquete base.\n\nPuede utilizar toolchain de GNU o LLVM toolchain para desarrollar software en C, C++ u Objective-C.\n\n"
    },
    {
      "title": "Herramientas útiles",
      "level": 2,
      "content": "- Valgrind — Herramienta para ayudar a encontrar problemas de gestión de memoria en los programas.\n\n- distcc — Front-end de compilación distribuida de GCC.\n\n- rr — Herramienta ligera de grabación y depuración determinística para C/C++, utiliza GDB.\n\n"
    },
    {
      "title": "Analizadores de código estático",
      "level": 3,
      "content": "- Cppcheck — Una herramienta para el análisis de código estático de C/C++.\n\n- Splint — Una herramienta para verificar de forma estática los programas de C en busca de vulnerabilidades de seguridad y errores de programación.\n\n- Clang tiene el analizador estático scan-build.\n\n"
    },
    {
      "title": "Compiladores alternativos",
      "level": 2,
      "content": "- TCC — Compilador C diminuto, dice ser más rápido que GCC.\n\n- ACK — Amsterdam Compiler Kit.\n\n- PCC — Compilador portátil de C.\n\n- SDCC — Compilador de ANSI C retargettable.\n\nVéase también Wikipedia:List of compilers#C compilers.\n\n"
    },
    {
      "title": "Implementaciones de libc alternativas",
      "level": 2,
      "content": "- dietlibc — Un libc optimizado para tamaños pequeños\n\n- musl — Implementación ligera de la biblioteca estándar de C.\n\n"
    },
    {
      "title": "Bibliotecas",
      "level": 2,
      "content": "- FFmpeg - incluye libav, la biblioteca de audio y vídeo (no debe confundirse con la bifurcación FFmpeg del mismo nombre).\n- GLib — Biblioteca de sistema de bajo nivel por GNOME, incluye GObject y GIO.\n\n- GStreamer – estructura multimedia basado en tuberías\n\nVéase también:\n\n- Archiving and compression (Español)#Bibliotecas de compresión\n- Wikipedia:Category:C (programming language) libraries\n- Listado de bibliotecas C de código abierto\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página del manual: sección 2 para las llamadas del sistema\n- Página del manual: sectión 3 para las funciones de la biblioteca\n- GCC y Make – Compilando, enlazando y construyendo aplicaciones C/C++\n- SEI CERT C Coding Standard\n- #C canal IRC\n\n"
    }
  ]
}