{
  "title": "Character encoding (Русский)",
  "url": "https://wiki.archlinux.org/title/Character_encoding_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Локали\n- Метод ввода\n\nКодировка задаёт соответствие между байтами и человекочитаемыми символами. Самой распространённой кодировкой является UTF-8. [1]\n\n"
    },
    {
      "title": "Терминал",
      "level": 3,
      "content": "В большинстве терминалов UTF-8 используется по умолчанию. Однако некоторые терминалы (например, gnome-terminal, rxvt-unicode) нужно запускать в окружении с локалью UTF-8, то есть установленная вами локаль должна оканчиваться на .UTF-8; смотрите раздел Локали#Установка локали.\n\n- xterm — запустите с параметром -u8 или пропишите ресурс X xterm*utf8: 2.\n\n"
    },
    {
      "title": "Вставка символов Юникода",
      "level": 3,
      "content": "Смотрите List of applications/Utilities#Text input.\n\n- В LibreOffice есть встроенная таблица символов (Вставка > Специальные символы), которая также показывает код выбранного символа.\n- Клавиша Compose: можно настроить XCompose для ввода специальных символов.\n- AltGr позволяет получить доступ к дополнительным рядам со специальными символами, а также управляющими символами вроде ZWNJ и RTL mark.\n\n"
    },
    {
      "title": "Кодировка URL",
      "level": 2,
      "content": "В ссылках (URI) можно использовать только некоторые ASCII-символы; для остальных символов применяется процентное кодирование, из-за которого ссылки могут становиться длинными и нечитаемыми.\n\nFirefox умеет выполнять декодирование при копировании ссылки из адресной строки — для этого включите browser.urlbar.decodeURLsOnCopy через about:config. Также можно просто добавить пробел перед ссылкой, и тогда она скопируется в декодированном виде. В Chromium аналогичных способов нет, но можно выделить часть ссылки после https:// и скопировать только её.\n\nВ командной строке можно использовать python для декодирования ссылки:\n\n```\n$ python3 -c \"import sys; from urllib.parse import unquote; print(unquote(sys.stdin.read().strip()))\"\n```\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Проблемы с кодировками обычно возникают, когда две программы обмениваются данными в разных кодировках, и из-за неправильной интерпретации передаваемых байтов возникают кракозябры.\n\n"
    },
    {
      "title": "Неправильная кодировка архива",
      "level": 3,
      "content": "В старых версиях Windows (XP, Vista, 7) Проводник создавал zip-архивы с использованием системной («ANSI») кодировки, зависящей от языка системы. Так как zip-архивы не хранят информацию о кодировке, при распаковке придётся указывать правильную кодировку вручную.\n\nДля распаковки можно использовать unzip, который собирается в Arch с патчем, добавляющим поддержку указания кодировки. Например, для распаковки архива с использованием кодировки CP1251 (кириллица) можно использовать такую команду:\n\n```\n$ unzip -O CP1251 файл.zip\n```\n\nЕсли вы не знаете правильную кодировку, используйте опцию -l, чтобы посмотреть список файлов без распаковки, и пробуйте разные кодировки, пока имена файлов не станут читаемыми:\n\n```\n$ unzip -lO CP866 файл.zip\n```\n\nЯпонские версии Windows создают zip-архивы с кодировкой Shift-JIS (SJIS):\n\n```\n$ unzip -O shift-jis nihongo.zip\n```\n\nКитайские версии Windows создают zip-архивы с кодировкой GBK:\n\n```\n$ unzip -O gbk файл.zip\n```\n\nТакже есть unzip-natspecAUR, который автоматически выбирает кодировку, соответствующую текущей локали.\n\n"
    },
    {
      "title": "Неправильная кодировка имени файла",
      "level": 3,
      "content": "Если у вас есть файл, имя которого хранится в файловой системе не в кодировке UTF-8, можно использовать convmv для переименования файла одновременно с перекодированием его имени:\n\n```\n$ convmv -f ИСХОДНАЯ_КОДИРОВКА -t UTF-8 --nosmart файл\n```\n\nСкорее всего вы не сможете ввести правильное имя файла вручную, потому что файловые менеджеры будут показывать знаки вопроса или квадраты; выполните команду ls в каталоге с проблемным файлом — она покажет имя файла в экранированном виде, которое вы сможете использовать в вашей командной оболочке.\n\nПо умолчанию convmv только показывает, что будет сделано, без фактического переименования. Когда вы подберёте правильную кодировку (для кириллицы скорее всего CP1251), добавьте опцию --notest, чтобы выполнить переименование.\n\nПо умолчанию convmv пропускает имена файлов, которые хранятся в файловой системе уже в кодировке UTF-8. Опция --nosmart позволяет принудительно выполнять перекодирование даже для таких файлов.\n\nКоманда convmv --list покажет список всех поддерживаемых кодировок.\n\n"
    },
    {
      "title": "Неправильная кодировка содержимого файла",
      "level": 3,
      "content": "Для перекодирования содержимого файла можно использовать iconv:\n\n```\n$ iconv -f ИСХОДНАЯ_КОДИРОВКА -t UTF-8 -o новый-файл исходный-файл\n```\n\n-f задаёт кодировку, в которой находится исходный файл, -t — кодировку, в которую его нужно перекодировать, а -o — имя перекодированного файла, который будет создан. Список доступных кодировок можно посмотреть командой iconv -l.\n\n"
    },
    {
      "title": "Vim",
      "level": 4,
      "content": "Если используется UTF-8 локаль, при открытии файлов в других кодировках могут появляться кракозябры. Для решения можно прописать запасные кодировки в vimrc:\n\n```\nset fileencodings=utf8,cp936,gb18030,big5\n```\n\nИли можно явно задать :set fileencoding=ansi. Vim выполнит перекодирование через iconv автоматически. Смотрите :h charset-conversion.\n\n"
    },
    {
      "title": "Неправильная кодировка ID3 в файлах MP3",
      "level": 3,
      "content": "Можно выполнить перекодирование через python-mutagen или mp3unicode:\n\n```\n$ mid3iconv -e ИСХОДНАЯ_КОДИРОВКА XXX.mp3\n```\n\nЕсли вносить изменения в файл нежелательно, можно изменить поведение плеера. Например, для плееров, которые используют бэкенд GStreamer (Rhythmbox, Totem), можно указать переменную окружения, прописав в ней список нужных кодировок через двоеточие:\n\n```\nexport GST_ID3_TAG_ENCODING=CP1251:GBK:UTF-8:GB18030\n```\n\nВ плеере Quod Libet откройте Файл > Расширения > Расширенные настройки (или Файл > Настройки > Расширенное в более новой версии quodlibet-gitAUR), нажмите Я знаю, что делаю! и пропишите список нужных кодировок через пробел в поле ID3 encodings. Или можно вручную отредактировать файл настроек:\n\n```\n~/.config/quodlibet/config\n```\n\n```\n...\n[editing]\nid3encoding = cp1251\n...\n```\n\n"
    },
    {
      "title": "Неправильная кодировка при монтировании",
      "level": 3,
      "content": "Параметр монтирования iocharset позволяет указать кодировку, в которой будут выводиться имена файлов. Его можно прописать в файле fstab. Пример для локали, использующей кодировку UTF-8:\n\n```\n/etc/fstab\n```\n\n```\n...\n/dev/sdxx /media/win ntfs defaults,iocharset=utf8 0 0\n```\n\nДля локали GBK:\n\n```\n/etc/fstab\n```\n\n```\n...\n/dev/sdxx /media/win ntfs defaults,iocharset=cp936 0 0\n...\n```\n\n"
    },
    {
      "title": "Неправильная кодировка Samba",
      "level": 3,
      "content": "При использовании Arch в качестве сервера Samba для решения проблем с кодировками у Windows-клиентов может понадобиться добавить в /etc/samba/smb.conf:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n...\nunix charset=gb2312\n...\n```\n\n"
    },
    {
      "title": "Неправильная кодировка FTP",
      "level": 3,
      "content": "Если вы используете UTF-8 локаль, файл, скачанный с FTP-сервера, не использующего Юникод, может оказаться с кракозябрами в имени. Для lftp решить проблему можно путём добавления таких настроек:\n\n```\n.lftp/rc\n```\n\n```\n...\nset ftp:charset \"gbk\"\nset file:charset \"UTF-8\"\n...\n```\n\nДля gftp:\n\n```\n.gftp/gftprc\n```\n\n```\n...\nremote_charsets=gb2312\n...\n```\n\nОднако имя загруженного файла по-прежнему с кракозябрами. Для решения можно пропатчить gftp: https://www.teatime.com.tw/%7Etommy/linux/gftp_remote_charsets.patch\n\n"
    }
  ]
}