{
  "title": "Chroot (Français)",
  "url": "https://wiki.archlinux.org/title/Chroot_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- PRoot\n- Linux Containers\n- systemd-nspawn\n- DeveloperWiki:Building in a clean chroot\n\nUn chroot est une opération qui modifie le répertoire racine apparent pour le processus en cours d'exécution et ses enfants. Un programme qui est exécuté dans un tel environnement modifié ne peut pas accéder aux fichiers et aux commandes en dehors de l'arborescence des répertoires de l'environnement. Cet environnement modifié est appelé chroot jail (prison «chroot»).\n\n"
    },
    {
      "title": "Raisonnement",
      "level": 2,
      "content": "Le changement de racine est généralement effectué pour effectuer la maintenance du système sur des systèmes où il n'est plus possible de démarrer et/ou de se connecter. Des exemples courants sont :\n\n- Réinstaller le chargeur d'amorçage.\n- Reconstruction de l'image initramfs.\n- Mise à jour ou rétrogradation de paquets.\n- Réinitialisation d'un mot de passe oublié.\n- Construction de paquets dans un chroot propre.\n\nConsultez également Wikipedia:Chroot#Limitations.\n\n"
    },
    {
      "title": "Pré-requis",
      "level": 2,
      "content": "Afin d'utiliser chroot, vous avez besoin d'une autre installation sous Linux ou d'un autre support d'installation (de n'importe quelle distribution), avec :\n\n- Les privilèges root (voir #Sans privilèges root pour les alternatives).\n- Le même jeu d'instructions que le système dans lequel vous allez chrooter. L'architecture de l'environnement actuel peut être trouvée avec : uname -m (par exemple, i686 ou x86_64).\n- Charger les modules du noyau qui sont nécessaires dans l'environnement chroot.\n- Swap activé si nécessaire : # swapon /dev/sdxY\n- Une connexion Internet fonctionnelle si nécessaire.\n\n```\n# swapon /dev/sdxY\n```\n\n"
    },
    {
      "title": "Préparer le nouvel emplacement de la racine",
      "level": 2,
      "content": "La cible du chroot doit être un répertoire qui contient une hiérarchie de système de fichiers.\n\nDans le guide d'installation, ce répertoire est /mnt. Pour une installation existante, vous devez monter vous-même les partitions existantes dans /mnt :\n\nExécutez lsblk et notez la disposition des partitions de votre installation. Ce sera généralement quelque chose comme /dev/sdXY ou si vous avez un lecteur NVMe /dev/nvme0nXpY.\n\nMontez le système de fichiers :\n\n1. mount /dev/sdXY' /mnt\n\nSi vous avez une partition système EFI et que vous devez y apporter des modifications (par exemple, mettre à jour les images vmlinuz ou initramfs) :\n\n1. mount /dev/sd'XZ /mnt/esp\n\nSi vous avez des partitions distinctes, montez-les également.\n\nDans les exemples suivants, /chemin/vers/la/nouvelle/racine est le répertoire où réside la nouvelle racine (par exemple /mnt).\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "- Certains outils systemd tels que hostnamectl, localectl et timedatectl ne peuvent pas être utilisés dans un chroot, car ils nécessitent une connexion dbus active. [1]\n- Le système de fichiers qui servira de nouvelle racine (/) à votre chroot doit être accessible (c'est-à-dire déchiffré, monté).\n\nIl y a deux options principales pour utiliser chroot, décrites ci-dessous.\n\n"
    },
    {
      "title": "Avec arch-chroot",
      "level": 3,
      "content": "Le script bash arch-chroot fait partie du paquet arch-install-scripts. arch-chroot est une surcouche de chroot(1), assurant que les fonctionnalités importantes sont disponibles, par exemple le montage de /dev, /proc et d'autres systèmes de fichiers API, ou l'exposition de /etc/resolv.conf au chroot.\n\n"
    },
    {
      "title": "Entrer un chroot",
      "level": 4,
      "content": "Lancez arch-chroot avec le nouveau répertoire racine comme premier argument :\n\n```\n# arch-chroot /chemin/vers/la/nouvelle/racine\n```\n\nVous pouvez maintenant effectuer la plupart des opérations disponibles dans votre installation existante. Certaines tâches qui nécessitent le D-Bus ne fonctionneront pas comme indiqué dans #Utilisation.\n\n"
    },
    {
      "title": "Quitter un chroot",
      "level": 4,
      "content": "Pour quitter le chroot, utilisez :\n\n```\n# exit\n```\n\n"
    },
    {
      "title": "Exécuter une seule commande et quitter",
      "level": 4,
      "content": "Pour exécuter une commande depuis le chroot et sortir à nouveau, ajoutez la commande à la fin de la ligne :\n\n```\n# arch-chroot /chemin/vers/la/nouvelle/racine ma-commande\n```\n\nPar exemple, pour exécuter mkinitcpio -p linux pour un chroot situé à /mnt/arch, faites :\n\n```\n# arch-chroot /mnt/arch mkinitcpio -p linux\n```\n\n"
    },
    {
      "title": "Avec chroot",
      "level": 3,
      "content": "Tout d'abord, montez les systèmes de fichiers temporaires de l'API :\n\n```\n# cd /chemin/vers/la/nouvelle/racine\n# mount -t proc /proc proc/\n# mount -t sysfs /sys sys/\n# mount --rbind /dev dev/\n```\n\nEt optionnellement :\n\n```\n# mount --rbind /run run/\n```\n\nSi vous utilisez un système UEFI, vous aurez également besoin d'accéder aux variables EFI. Sinon, lors de l'installation de GRUB, vous recevrez un message similaire à : UEFI variables not supported on this machine :\n\n```\n# mount --rbind /sys/firmware/efi/efivars sys/firmware/efi/efivars/\n```\n\nEnsuite, afin d'utiliser une connexion internet dans l'environnement chroot, copiez les détails du DNS :\n\n```\n# cp /etc/resolv.conf etc/resolv.conf\n```\n\nEnfin, pour changer la racine en /chemin/vers/la/nouvelle/racine en utilisant un shell bash :\n\n```\n# chroot /chemin/vers/la/nouvelle/racine /bin/bash\n```\n\n- chroot : cannot run command '/usr/bin/bash' : Exec format error, il est probable que les architectures de l'environnement hôte et de l'environnement chroot ne correspondent pas.\n- chroot : '/usr/bin/bash' : permission denied, remontez avec la permission d'exécuter : mount -o remount,exec /chemin/vers/la/nouvelle/racine. Si cette vérification n'a pas aidé, alors assurez-vous que les composants de base du nouvel environnement sont intacts (si c'est une racine Arch, essayez paccheck --root=/chemin/vers/la/nouvelle/racine --files --file-properties --md5sum glibc filesystem, de pacutils).\n\n- Si cette vérification n'a pas aidé, alors assurez-vous que les composants de base du nouvel environnement sont intacts (si c'est une racine Arch, essayez paccheck --root=/chemin/vers/la/nouvelle/racine --files --file-properties --md5sum glibc filesystem, de pacutils).\n\nAprès le chrootage, il peut être nécessaire de charger la configuration locale de bash :\n\n```\n# source /etc/profile\n# source ~/.bashrc\n```\n\n```\n# export PS1=\"(chroot) $PS1\"\n```\n\nLorsque vous avez terminé avec le chroot, vous pouvez le quitter via :\n\n```\n# exit\n```\n\nPuis démontez les systèmes de fichiers temporaires :\n\n```\n# cd /\n# umount --recursive /chemin/vers/la/nouvelle/racine\n```\n\n"
    },
    {
      "title": "Exécuter des applications graphiques à partir de chroot",
      "level": 2,
      "content": "Si un serveur X est exécuté sur votre système, vous pouvez lancer des applications graphiques à partir de l'environnement chroot.\n\nPour permettre à l'environnement chroot de se connecter à un serveur X, ouvrez un terminal virtuel à l'intérieur du serveur X (c'est-à-dire à l'intérieur du bureau de l'utilisateur qui est actuellement connecté), puis exécutez la commande xhost, qui donne la permission à quiconque de se connecter au serveur X de l'utilisateur (consultez également Xhost) :\n\n```\n$ xhost +local :\n```\n\nEnsuite, pour diriger les applications vers le serveur X à partir du chroot, définissez la variable d'environnement DISPLAY à l'intérieur du chroot pour qu'elle corresponde à la variable DISPLAY de l'utilisateur propriétaire du serveur X. Ainsi, par exemple, exécutez :\n\n```\n$ echo $DISPLAY\n```\n\nen tant qu'utilisateur propriétaire du serveur X pour consulter la valeur de DISPLAY. Si la valeur est \":0\" (par exemple), exécutez la commande suivante dans l'environnement chroot :\n\n```\n# export DISPLAY=:0\n```\n\n"
    },
    {
      "title": "Sans privilèges root",
      "level": 2,
      "content": "Chroot nécessite des privilèges root, ce qui peut ne pas être souhaitable ou possible pour l'utilisateur dans certaines situations. Il existe cependant plusieurs façons de simuler un comportement de type chroot en utilisant des implémentations alternatives.\n\n"
    },
    {
      "title": "PRoot",
      "level": 3,
      "content": "PRoot peut être utilisé pour changer le répertoire racine apparent et utiliser mount --bind sans les privilèges de root. Ceci est utile pour confiner des applications à un seul répertoire ou pour exécuter des programmes construits pour une architecture de CPU différente, mais il y a des limitations dues au fait que tous les fichiers appartiennent à l'utilisateur du système hôte. PRoot fournit un argument --root-id qui peut être utilisé comme une solution de contournement pour certaines de ces limitations d'une manière similaire (bien que plus limitée) à fakeroot.\n\n"
    },
    {
      "title": "Fakechroot",
      "level": 3,
      "content": "fakechroot est une bibliothèque «shim» (cale) qui intercepte l'appel chroot et simule les résultats. Elle peut être utilisée en conjonction avec fakeroot pour simuler un chroot comme un utilisateur normal.\n\n```\n$ fakechroot fakeroot chroot ~/my-chroot bash\n```\n\n"
    },
    {
      "title": "Unshare",
      "level": 3,
      "content": "Unshare, qui fait partie de util-linux, peut être utilisé pour créer un nouvel espace de noms du noyau. Cela fonctionne avec la commande chroot habituelle. Par exemple :\n\n```\n$ unshare --map-root-user chroot ~/namespace /bin/sh\n```\n\n"
    },
    {
      "title": "arch-chroot: /chemin/vers/la/nouvelle/racine is not a mountpoint. This may have undesirable side effects.",
      "level": 3,
      "content": "Lors de l'exécution de arch-chroot /chemin/vers/la/nouvelle/racine, un avertissement est émis :\n\n```\n==> WARNING: /chemin/vers/la/nouvelle/racine is not a mountpoint. This may have undesirable side effects.\n```\n\nConsultez arch-chroot(8) pour une explication et un exemple d'utilisation de bind mounting pour faire du répertoire chroot un point de montage.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Chroot de base\n\n"
    }
  ]
}