{
  "title": "Cmus (Português)",
  "url": "https://wiki.archlinux.org/title/Cmus_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "cmus (C* MUsic Player) é um reprodutor de áudio de console pequeno, rápido e poderoso que suporta a maioria dos principais formatos de áudio. Vários recursos incluem reprodução contínua, suporte a ReplayGain, streaming de MP3 e Ogg, filtragem ao vivo, inicialização instantânea, atalhos de teclado personalizáveis e vinculações de teclas padrão no estilo vi.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote cmus ou cmus-gitAUR para a versão de desenvolvimento.\n\nVeja as dependências opcionais para codecs disponíveis e plugins de saída (instalados podem ser listados com cmus --plugins).\n\n"
    },
    {
      "title": "Usando o cmus com ALSA",
      "level": 3,
      "content": "Instale o pacote alsa-lib.\n\nAo usar cmus com ALSA, a configuração padrão não permite reproduzir música. O que você pode encontrar ao tentar iniciar o cmus é uma linha terminal em branco, sem saída alguma. Para corrigi-lo, crie um novo arquivo de configuração e defina as seguintes variáveis:\n\n```\n~/.config/cmus/rc\n```\n\n```\nset output_plugin=alsa\nset dsp.alsa.device=default\nset mixer.alsa.device=default\nset mixer.alsa.channel=Master\n```\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Veja cmus(1), cmus-tutorial(7) e cmus-remote(1).\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Para configurar o cmus, consulte cmus(1).\n\n"
    },
    {
      "title": "Controle remoto",
      "level": 3,
      "content": "Cmus pode ser controlado externamente através de um unix-socket com cmus-remote. Isso facilita o controle da reprodução por meio de um aplicativo externo ou vinculação de teclas.\n\nUm tal uso deste recurso é controlar a reprodução no Cmus com os eventos do teclado XF86. O script a seguir quando executado iniciará o Cmus em um terminal xterm se ele não estiver em execução, caso contrário, ele alternará entre reproduzir / pausar:\n\n```\n#!/bin/sh\n\nif ! pgrep -x cmus ; then\n  xterm -e cmus\nelse\n  cmus-remote -u\nfi\n```\n\nCopie o código acima em um arquivo ~/bin/cplay e faça-o executável.\n\nPara usar o cmus-remote no Openbox, consulte Openbox#rc.xml.\n\n"
    },
    {
      "title": "Scrobbling de áudio",
      "level": 2,
      "content": "O cmus não oferece suporte a scrobbling de áudio, mas existem soluções de terceiros. Instale cmusfmAUR para scrobbling no Last.fm ou Libre.fm. Para a configuração inicial, execute cmusfm init e siga o link para executar a autenticação.\n\nPor padrão, o cmusfm funciona com o serviço Last.fm. No entanto, é possível alterar esse comportamento modificando as opções service-api-url e service-auth-url no arquivo de configuração (~/.config/cmus/cmusfm.conf). Posteriormente, deve-se reinicializar o cmusfm cmusfm init para se autenticar com o novo serviço de scrobbling. Para usar o Libre.fm como um serviço de scrobbling, deve-se usar a configuração da seguinte maneira:\n\n```\n~/.config/cmus/cmusfm.conf\n```\n\n```\nservice-api-url = \"https://libre.fm/2.0/\"\nservice-auth-url = \"https://libre.fm/api/auth\"\n```\n\nO próximo passo é definir o cmusfm como programa de status para o cmus. Execute o comando na janela principal do cmus :set status_display_program=cmusfm.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Git Repository\n- Website\n- User submitted scripts\n\n"
    }
  ]
}