{
  "title": "CMYK support in The GIMP",
  "url": "https://wiki.archlinux.org/title/CMYK_support_in_The_GIMP",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ICC profiles\n\nNote: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article will show how to enable rudimentary CMYK support in Gimp using the Separate and Separate+ plug-ins, and explain how to use color proof filter to soft-proof your images. It will also cover more general topics on CMYK colors and desktop publishing (DTP).\n\n"
    },
    {
      "title": "Before you read",
      "level": 2,
      "content": "Before you install the Separate or Separate+ plug-in for Gimp, you need to know if you really need it.\n\nThere has been much debate about the merits of using Gimp. Most of the heated discussions revolve around the fact that Gimp does not support CMYK mode. However, you have to understand that the topic is more important to DTP professionals than other users (photographers, web artists, home users).\n\nCMYK color model (or CMYK mode) is used mostly by DTP professionals that need to output images intended for commercial printing. For an average home user or even professional photographers, support for separating images using CMYK color is not necessary.\n\nEven when you see Cyan, Magenta, Yellow, and Black cartridges in your ink-jet or color laser printer, it does not mean that you need to feed it a CMYK file. In fact, most of them actually accept only RGB images or convert CMYK images to RGB internally.\n\n"
    },
    {
      "title": "Limitations",
      "level": 2,
      "content": "Using the methods below has some limitations in comparison to proprietary tools. Namely, Separate+ and its predecessors have no support for GCR (Grey Component Replacement) and UCR (Undercolor Removal). Also, Separate plugin (not Separate+) has no support for clipping path, and there is no support for opening CMYK files in either Separate or Separate+.\n\nWhile undercolor removal is supported by Scribus, grey component replacement is not supported by any graphical tool on Linux as of this writing.\n\n"
    },
    {
      "title": "What you will need",
      "level": 3,
      "content": "You will need Gimp (of course), either Separate or Separate+ plugins, and ICC profiles. All of this can be installed from AUR.\n\n"
    },
    {
      "title": "About CMYK color model",
      "level": 2,
      "content": "If you are not interested in the theory, you may skip straight to the heading on CMYK color support in GIMP.\n\nFirst off, the proper name for CMYK mode, as it is commonly known, is CMYK color model. It is called a color model, because it represents a standard way of describing colors.\n\nThe color model is also called a subtractive color model, as opposed to additive (that is RGB) color model. Words additive and subtractive suggest that light, which is essential for perception of color, is either added or subtracted before it reaches the eye. The choice of primary colors is based on belief that the combination of Red, Green, and Blue (for RGB) or Cyan, Magenta, Yellow (for CMYK) produce the greatest range visible colors.\n\nSubtraction of light occurs when an ink absorbs part of the light that falls on it. The rest is reflected and reaches our eyes. Different inks absorb different parts of the light's spectrum, and the combination of C-M-Y inks yields the greatest range of different colors.\n\nIdeally, subtraction of all light, that is when Cyan, Magenta, and Yellow are mixed together at their full density, we should get black (i.e., no light reflected, fully absorbed by ink). However, this is usually not true in the real world because the inks are semi-transparent and the white paper below reflects some of the light. The use of additional Black ink in printing (K in CMYK stands for Key, or blacK) is due to this fact. It adds the necessary density to the image and makes black a black.\n\nWhen printing an image on a commercial press, it needs to be printed one primary (or Black) at a time. Therefore the original (usually a digital RGB image, or a printed photograph) needs to be separated into Cyan, Magenta, Yellow, and Black components.\n\nThe lack of support for this kind of separation made Gimp unattractive to DTP professionals.\n\n"
    },
    {
      "title": "About ICC color profiles",
      "level": 2,
      "content": "Since reproduction of both RGB and CMYK colors are specific to the device (or inks) used to produce images, a concept of color-spaces was invented. Color-spaces formulate the relationship of physical color and the color model that we use to describe them. Those relationships (functions) can be packaged as a file in the form of ICC profiles.\n\nThe ICC profiles are used to describe the way colors are reproduced in a system, be it a monitor, a scanner, or a printing press. When separating images for press, we use the source profile (the color-space of the image to be separated) and the target profile (the color-space of the printing press the image is intended for).\n\nWhen it comes to the printing press, standarization of ink and paper combination have allowed organizations to produce profiles that should match a print condition you are looking for. Organizations working on it include the European Color Initiative (ECI), the GRACoL/SWOP working group in the US, and the ISO with its ISO 12647-2. If you are not sure about which profile to use, you should contact your printer.\n\n"
    },
    {
      "title": "About CMYK color and Gimp",
      "level": 2,
      "content": "Gimp still lacks full CMYK color model support. The ability to separate and then edit an image in CMYK mode is still a long way down the list of features to be added. However, there is a plug-in called Separate that offers a partial solution to the problem.\n\nSeparate plugin has following abilities:\n\n- separate a RGB image\n- color management (using ICC profiles and lcms)\n- soft-proofing colors\n- attach ICC profiles to separated image files\n\nSeparate+ plug-in has the same features as Separate, but it also has:\n\n- ability to convert from one RGB profile to another\n- duotone support\n\nGimp itself offers a smaller set of CMYK-related functions:\n\n- display of CMYK values when using color picker\n- soft-proofing colors via Display Filters (not recommended)\n- soft-proofing colors via color management settings\n\n"
    },
    {
      "title": "Separate plug-in for Gimp",
      "level": 3,
      "content": "Once you have obtained the source tarball, you can unpack it using the usual tar command:\n\n```\n$ tar xvf separate-version.tar.gz\n```\n\nwhere version would be the version of Separate plug-in (0.1 at the time of this writing).\n\nCopy a file called separate (located inside the extracted separate directory) into Gimp's plug-in directory:\n\n```\n$ cp separate/separate /usr/lib/gimp/version/plug-ins/\n```\n\nwhere version would be the major version number of Gimp (2.0 at the time of this writing).\n\nWhen you start Gimp the Separate will be recognized and reachable through Image > Separate menu.\n\n"
    },
    {
      "title": "Separate+ plug-in",
      "level": 3,
      "content": "To install manually, get the zip file from Sourceforge.jp download page, unpack it and issue the following commands:\n\n```\n$ make\n# make install\n```\n\nWhen you start Gimp the Separate+ will be reachable through Image > Separate menu.\n\n"
    },
    {
      "title": "Install ICC profiles",
      "level": 3,
      "content": "If you are using the Separate plug-in package from AUR, you already have the profiles installed. However, if you built Separate yourself, or you are using Separate+, you will need to install ICC profiles.\n\n"
    },
    {
      "title": "Installing from AUR",
      "level": 4,
      "content": "To install ICC profiles from AUR, you need to install eci-iccAUR and/or icc-adobeAUR.\n\n"
    },
    {
      "title": "Install manually",
      "level": 4,
      "content": "Before you download and install profiles manually, you need to know that the standard location for ICC profiles is /usr/share/color/icc. You have to create this directory and copy any profiles there. Another standard location is ~/.color/icc.\n\nYou can obtain ICC profiles from Adobe and ECI.\n\nExtract the downloaded zip file(s) and copy the contents of CMYK and RGB directories into one of the directories we have mentioned above.\n\n"
    },
    {
      "title": "Separating a RGB image",
      "level": 2,
      "content": "Open an image in Gimp. From the Image menu, open the Separate sub-menu and pick Separate (to Colour).\n\nChoose a source (RGB) and destination (target, CMYK) profile and click OK.\n\nThis will open another window with the CMYK color version. You can see that there are 5 layers total.\n\nPick Save... (or Export... in Separate+) from the Separate sub-menu and save the file in TIFF format with an attached (embedded) ICC profile.\n\nYou can only separate flattened images, so it is recommended that you save a new copy of the image before you create the CMYK TIFF.\n\n"
    },
    {
      "title": "Working on a separated image",
      "level": 2,
      "content": "If you want to work on a separated image you need to be intimately familiar with the way CMYK images work. If you look at Gimp's Layers window after separating an image, you will witness the ingenious way in which the separation is done. However, editing the image is not as simple as with proprietary software like Adobe's Photoshop.\n\nBasically, you need to work with grayscale values of each primary color (plus Black). All the tools are available, but you only get apply them layer by layer and in grayscale.\n\n"
    },
    {
      "title": "Soft-proofing with Display Filters",
      "level": 2,
      "content": "Given the circumstances, the best way to create a solid CMYK image would be to work in RGB mode, but enable soft-proofing. Soft-proofing is the method of adjusting the on-screen display of colors to match the final print. In the newer versions of The GIMP, soft-proofing is made possible via Display Filters.\n\nGo to the View menu and pick Display Filters... option. From the list of available filters, pick Color Proof (at the bottom in The GIMP version 2.2.13). Click on the right arrow button between the two lists and the Color Proof filter will be placed into the list of active filters. Click on it (the one in the active filters list) and you will get a few options below.\n\nAlthough this seems very convenient, experience has proven that this is not a reliable method of soft-proofing. Instead of soft-proofing using the display filter, you are advised to properly configure Gimp's color management system and enable the Print simulation mode.\n\n"
    },
    {
      "title": "Intent",
      "level": 3,
      "content": "The color proof (rendering) intent can be one of the following:\n\n- perceptual\n- relative colorimetric\n- saturation\n- absolute colorimetric\n\nPerceptual and relative colorimetric are most common.\n\nPerceptual compresses or expands the full color range of source color-space into the full color range of target color-space.\n\nRelative colorimetric intent adjusts the white (white point) of source space and then adjusts the rest of the source colors accordingly. Source colors outside the target space are mapped to closest reproducible colors. In some software, this is also called proof intent.\n\nSaturation intent keeps the saturation of the source colors even if the colors get distorted in the target space. This intent is still considered experimental and you may get unexpected (if not undesirable) results.\n\nAbsolute colorimetric leaves overlap of source and target space intact and maps source colors outside the target space are mapped to closest reproducible colors.\n\n"
    },
    {
      "title": "Profile",
      "level": 3,
      "content": "For color proofing, we usually use the profile of the device that image is to be printed on (see above). For testing purposes, you may use any of the Adobe profiles mentioned above.\n\n"
    },
    {
      "title": "Soft-proofing with the plugin's proof function",
      "level": 2,
      "content": "Separate itself offers a way of soft-proofing color. This method of soft-proofing is not dynamic: it does not update as you edit the image, but acts more like a one-time preview. However, it is far more accurate than The GIMP's soft-proofing using Color Proof display filter. Basically, the proof function converts the image to RGB space using absolute colorimetric intent. It is supposed to offer a side-by-side match to the printed copy.\n\nTo soft-proof with Separate's proof function, you first separate an image and then pick Proof from Separate sub-menu. Source profile is your minitor's RGB profile (see ICC profiles). The destination profile is the ICC profile of a your image will be output to.\n\nClick OK and you will be presented with an RGB image of how the printed image would look like.\n\nSeparate+ acts the same way as Separate.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- About CMYK color model (Wikipedia)\n- About color in general (Wikipedia)\n- International Color Consortium (ICC home page)\n- About color management (Wikipedia)\n- Introduction to ICC color profile format (ICC home page)\n- Gimp Color Management for DTP (Foxbunny's Journal)\n- Color Management: Color Space Conversion (Cambridge in Color)\n- Grey Component Removal (Color Rendering Intent)\n- Undercolor Removal (Color Rendering Intent)\n\nRelated software:\n\n- Gimp (v2.0 and above)\n- lcms (v1.15)\n- Separate plugin (v0.10 and above)\n- Separate+ plugin\n- cmyktool is a standalone program for soft-proofing in CMYK which may be useful if you need to send CMYK to a printer (especially where you want to tweak pure black to avoid halos)\n\n"
    }
  ]
}