{
  "title": "Cockpit (Русский)",
  "url": "https://wiki.archlinux.org/title/Cockpit_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Cockpit — инструмент администрирования Linux через браузер, спонсируемый компанией Red Hat.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет cockpit. Проверьте опциональные зависимости, чтобы узнать, какие пакеты необходимы для управления сетевыми подключениями, пакетами и жёсткими дисками.\n\nДля получения дополнительных возможностей установите один из следующих пакетов:\n\n- cockpit-machines для управления виртуальными машинами с помощью libvirt\n- cockpit-podman для управления контейнерами Podman (заменяет устаревший cockpit-docker)\n- cockpit-storaged для мониторинга и настройки хранилищ, дисков и точек монтирования\n- cockpit-packagekit для работы с системными пакетами\n- networkmanager для управления сетью\n- firewalld для управления межсетевым экраном\n- udisks2 для управления хранилищем\n- pcp для чтения метрик PCP и загрузки архивов PCP\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Запустите/включите cockpit.socket для запуска Cockpit [1].\n\nПерейдите по адресу https://localhost:9090/ в веб-браузере, чтобы использовать Cockpit. Для входа используйте свою учётную запись Linux и пароль.\n\n"
    },
    {
      "title": "TLS-сертификат",
      "level": 3,
      "content": "По умолчанию Cockpit использует самоподписанный TLS-сертификат. Чтобы использовать нужный вам сертификат, поместите его с суффиксом .cert и соответствующий закрытый ключ с суффиксом .key в каталог /etc/cockpit/ws-certs.d/. Cockpit будет использовать последний файл *.cert в этой папке в алфавитном порядке; по умолчанию будет использоваться 0-self-signed.cert. Сертификаты и ключи должны быть доступны для чтения пользователю cockpit-ws. Перезапустите cockpit.service для применения. Смотрите страницу в официальной документации для получения дополнительной информации.\n\n"
    },
    {
      "title": "Ограничить сетевой доступ к интерфейсу только локальным адресом",
      "level": 3,
      "content": "По умолчанию Cockpit прослушивает все сетевые интерфейсы (0.0.0.0) на порту 9090. Для повышения безопасности можно использовать только определённый интерфейс или изменить порт.\n\nНапример, чтобы интерфейс прослушивал только локальный адрес, создайте следующий файл:\n\n```\n/etc/systemd/system/cockpit.socket.d/listen.conf\n```\n\n```\n[Socket]\nListenStream=\nListenStream=127.0.0.1:9090\nFreeBind=yes\n```\n\nСмотрите документацию для более подробной информации.\n\n"
    },
    {
      "title": "Скрытие приветствия в консоли",
      "level": 3,
      "content": "При входе в систему через TTY или SSH Cockpit отображает сообщение с информацией о себе. Чтобы отключить его, pam_motd(8) рекомендует создать символическую ссылку, но простое удаление файлов тоже работает:\n\n```\n# rm /etc/motd.d/cockpit /etc/issue.d/cockpit.issue\n```\n\nОбновление пакета cockpit вернёт эти файлы на место, поэтому, чтобы предотвратить это, можно добавить правило NoExtract.\n\n"
    }
  ]
}