{
  "title": "Cockpit",
  "url": "https://wiki.archlinux.org/title/Cockpit",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Cockpit is a browser-based administration tool for Linux, sponsored by Red Hat.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the cockpit package. Check the optional dependencies to see what packages are required to manage network connections, packages and hard disks.\n\nFor additional features, install one of the following packages:\n\n- cockpit-machines for managing virtual machines using libvirt\n- cockpit-podman for managing Podman containers (replaces the deprecated cockpit-docker)\n- cockpit-storaged for configuring and monitoring storage, disks and mounts on the system.\n- cockpit-packagekit for managing system packages.\n- networkmanager for managing Networking.\n- firewalld for managing the Firewall using the Cockpit in Networking.\n- udisks2 for managing Storage.\n- pcp for reading PCP metrics and loading PCP archives.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Start/enable the cockpit.socket unit to start Cockpit [1].\n\nVisit https://localhost:9090/ in a web browser to use Cockpit. Log in with your Linux account and password.\n\n"
    },
    {
      "title": "TLS certificate",
      "level": 3,
      "content": "By default, Cockpit uses a self-signed TLS certificate. To use a proper certificate, put a certificate with suffix .cert and a corresponding key with suffix .key in the /etc/cockpit/ws-certs.d/ directory. Cockpit will use the last *.cert file in that folder, in alphabetical order, falling back on 0-self-signed.cert. The cert and key have to be readable by the cockpit-ws user. Restart cockpit.service to apply. See the page in the official docs for more information.\n\n"
    },
    {
      "title": "Limit network access to the interface to local address only",
      "level": 3,
      "content": "By default, Cockpit listen on all network interfaces (0.0.0.0) on port 9090, for security reasons, one may want to limit the exposition of the interface to a specific one only or change the default port.\n\nFor example, for the interface to listen only on the local address, create the following file:\n\n```\n/etc/systemd/system/cockpit.socket.d/listen.conf\n```\n\n```\n[Socket]\nListenStream=\nListenStream=127.0.0.1:9090\nFreeBind=yes\n```\n\nSee the page in the official docs for more information.\n\n"
    },
    {
      "title": "Hide login MOTD",
      "level": 3,
      "content": "By default, Cockpit shows a MOTD on either TTY login or SSH. pam_motd(8) recommends creating a symbolic link to hide these messages, but simply removing the files will also work:\n\n```\n# rm /etc/motd.d/cockpit /etc/issue.d/cockpit.issue\n```\n\nTo avoid pacman re-creating the original files when cockpit is upgraded, create a NoExtract rule.\n\n"
    }
  ]
}