{
  "title": "Codecs and containers (Français)",
  "url": "https://wiki.archlinux.org/title/Codecs_and_containers_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Optical disc drive#Playback\n- GStreamer\n- ffmpeg\n\nSource Wikipedia, Codec :\n\nEn général, les codecs sont utilisés par les applications multimédia pour coder ou décoder des flux audio ou vidéo. Pour pouvoir lire des flux encodés, les utilisateurs doivent s'assurer qu'un codec approprié est installé.\n\nCet article ne traite que des codecs et des backends d'applications ; consultez List of applications/Multimedia pour obtenir une liste de lecteurs multimédias (MPlayer, mpv et VLC sont des choix populaires).\n\n"
    },
    {
      "title": "Prérequis",
      "level": 2,
      "content": "La lecture d'un contenu multimédia nécessite deux éléments :\n\n- Un lecteur multimédia adéquat\n- Le codec approprié\n\nIl n'est pas toujours nécessaire d'installer explicitement les codecs si vous avez installé un lecteur multimédia. Par exemple, MPlayer intègre un grand nombre de codecs en tant que dépendances, ainsi que des codecs intégrés.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "Consultez également Wikipedia:Comparison of audio coding formats.\n\n"
    },
    {
      "title": "Codecs audio sans perte (lossless)",
      "level": 4,
      "content": "- Apple Lossless (ALAC) — Codec de compression audio sans perte développé par Apple et déployé sur toutes ses plates-formes et appareils.\n\n- FLAC — Codec audio libre sans perte.\n\n- WavPack — Format de compression audio sans perte qui possède également un hybrid mode.\n\n"
    },
    {
      "title": "Codecs audio avec pertes (lossy)",
      "level": 4,
      "content": "Table content:\nFormat | Encodeur | Décodeur\nAAC | #AAC\nATSC A/52 | aftenAUR | a52dec\nCELT | celtAUR\nMPEG-1 |  |  | libmad\nMP3 | lame\nMusepack (MPC) | – 1 | libmpcdec\nOpus | opus\nVorbis | libvorbis\nSpeech codecs\nAMR | opencore-amr\nSpeex | speex\n\n1. mppenc n'est pas empaqueté.\n\n- CELT — Codec audio avec pertes ouvert et libre de droits, optimisé pour une faible latence.\n\n- LAME — Encodeur MP3 et analyseur graphique d'images.\n\n- liba52 — Bibliothèque gratuite pour le décodage de flux ATSC A/52 (Dolby Digital) (avec perte).\n\n- libdca — Bibliothèque libre pour le décodage des flux DTS Coherent Acoustics.\n\n- MAD — Décodeur audio MPEG de haute qualité.\n\n- Musepack (MPC) — Codec audio open-source avec perte, conçu pour une compression transparente.\n\n- opencore-amr — Mise en œuvre à code source ouvert du codec vocal AMR (Adaptive Multi Rate).\n\n- Opus — Codec audio ouvert, libre de droits et avec perte, conçu pour l'encodage de la parole et de l'audio en général et pour une faible latence.\n\n- Speex — Format de compression audio sans brevet, avec perte, conçu pour la parole.\n\n- Vorbis — Codec audio ouvert, sans brevet et avec pertes.\n\nSelon Wikipedia:\n\n- FAAC — Proprietary AAC audio encoder.\n\n- FAAD2 — ISO AAC audio decoder.\n\n- Fraunhofer FDK AAC — OpenCORE Framework implementation Advanced Audio Coding (AAC) encoder. Modified library of Fraunhofer AAC decoder and encoder.\n\n- Nero AAC — Nero AAC reference quality MPEG-4 and 3GPP audio codec. (déprécié)\n\n"
    },
    {
      "title": "Codecs d'image",
      "level": 3,
      "content": "- JasPer — Mise en oeuvre logicielle du codec spécifié dans le nouveau standard JPEG-2000 Part-1.\n\n- OpenJPEG — Codec JPEG 2000 open-source.\n\n- WebP — Format d'image utilisant la compression avec et sans perte. Il est actuellement développé par Google.\n\n- AV1 Image File Format (AVIF) — Format d'image basé sur le codec vidéo AV1.\n\n- High Efficiency Image File Format (HEIF) — Format d'image basé sur le codec vidéo HEVC. Souvent dans un conteneur HEIC.\n\n"
    },
    {
      "title": "Codecs vidéo",
      "level": 3,
      "content": "Consultez également Wikipedia:Comparison of video codecs.\n\nTable content:\nFormat | Bibliothèques de codecs\nAV1 | aom, dav1d (décodage), rav1e (encodage), svt-av1\nAVS2 | davs2AUR (décodage)\nDaala | daala-gitAUR (décodage)\nDirac | schroedinger\nDV | libdv\nH.265 | x265, x265-hgAUR[broken link: package not found]\nlibde265, libde265-gitAUR\nH.264 | x264, x264-gitAUR\nMPEG-1 | libmpeg2 (décodage)\nMPEG-2\nMPEG-4 | Xvid (xvidcore)\nTheora (xvidcore) | libtheora\nVP8, VP9 | libvpx, libvpx-gitAUR\n\n- AV1 — AOMedia Video 1 (AV1) est un codec qui succède à VP9 de Google, Daala de Mozilla, Thor de Cisco. aom est l'implémentation de référence pour l'encodage et le décodage. dav1d est le décodeur axé sur la performance. rav1e est l'encodeur axé sur la performance. La plupart des benchmarks montrent de meilleures performances avec svt-av1 qu'avec rav1e.\n\n- Daala — Codec vidéo de recherche en cours de développement par la fondation Xiph.Org et sponsorisé par la fondation Mozilla. L'objectif du projet est de fournir un format de média numérique libre à mettre en œuvre, à utiliser et à distribuer, ainsi qu'une mise en œuvre de référence avec des performances techniques supérieures à celles du h.265.\n\n- libde265 — implémentation open source du codec vidéo h.265.\n\n- libdv — Le codec DV Quasar (libdv) est un codec logiciel pour la vidéo DV.\n\n- libmpeg2 — Bibliothèque pour le décodage des flux vidéo MPEG-1 et MPEG-2.\n\n- Schrödinger — Format de compression vidéo avancé et libre de droits conçu pour un large éventail d'utilisations, de la diffusion de contenu Web basse résolution à la diffusion HD et au-delà, en passant par le montage en studio quasi sans perte.\n\n- Theora — Codec vidéo ouvert développé par le Xiph.org.\n\n- VP9 — Format vidéo ouvert de haute qualité pour le web, disponible gratuitement pour tous. Version améliorée du codec précédent VP8\n\n- x264 — Bibliothèque gratuite pour l'encodage des flux vidéo H264/AVC.\n\n- x265 — Projet open-source et bibliothèque d'application gratuite pour l'encodage de flux vidéo au format H.265/High Efficiency Video Coding (HEVC).\n\n- Xvid — Codec vidéo MPEG-4 open-source.\n\n"
    },
    {
      "title": "Outils de format de conteneur",
      "level": 2,
      "content": "Consultez également Wikipedia:Comparison of video container formats.\n\n- MKVToolNix — Ensemble d'outils pour créer, éditer et inspecter les fichiers Matroska.\n\n- MP4Joiner — Une collection d'outils GUI pour manipuler les fichiers MP4 (MP4Joiner, MP4Splitter).\n\n- OGMtools — Information, extraction ou création pour les flux multimédia OGG.\n\n"
    },
    {
      "title": "GStreamer",
      "level": 3,
      "content": "De https://gstreamer.freedesktop.org/ :\n\nSimplement, GStreamer est un backend ou framework utilisé par de nombreuses applications média. Consultez l'article GStreamer.\n\n"
    },
    {
      "title": "xine",
      "level": 3,
      "content": "De https://sourceforge.net/projects/xine/ :\n\nComme alternative à GStreamer, de nombreux lecteurs multimédia peuvent être configurés pour utiliser le backend xine fourni par xine-lib.\n\nNotez que le projet xine lui-même fournit un lecteur vidéo compétent, xine-ui.\n\n"
    },
    {
      "title": "libavcodec",
      "level": 3,
      "content": "libavcodec fait partie du projet FFmpeg. Il comprend un grand nombre de codecs vidéo et audio. Les codecs libavcodec sont inclus dans les lecteurs multimédias tels que MPlayer et VLC, vous n'aurez donc peut-être pas besoin d'installer le paquet ffmpeg lui-même.\n\n"
    },
    {
      "title": "Pas de H264, mpg4 ou Musepack (.mpc) dans le lecteur Totem",
      "level": 3,
      "content": "Si vous rencontrez l'avertissement \"The H264 plugin is missing\" avec le lecteur multimédia Totem, installez gst-libav.\n\n"
    },
    {
      "title": "Pas de H264 dans le lecteur Parole",
      "level": 3,
      "content": "Si vous rencontrez l'avertissement \"Parole needs H.264 decoder to play this file\" avec le lecteur multimédia Parole, installez gst-libav.\n\n"
    }
  ]
}