{
  "title": "Codecs (Русский)",
  "url": "https://wiki.archlinux.org/title/Codecs_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Optical disc drive#Playback\n- GStreamer\n- ffmpeg\n\nFrom Wikipedia, \"a codec is a device or computer program capable of encoding and/or decoding a digital data stream or signal.\"\n\nIn general, codecs are utilized by multimedia applications to encode or decode audio or video streams. In order to play encoded streams, users must ensure an appropriate codec is installed.\n\nThis article deals only with codecs and application backends; see List of applications/Multimedia for a list of media players (MPlayer, mpv and VLC are popular choices).\n\n"
    },
    {
      "title": "Requirements",
      "level": 2,
      "content": "Playing multimedia content requires two components:\n\n- A capable media player\n- The appropriate codec\n\nIt is not always necessary to explicitly install codecs if you have installed a media player. For example, MPlayer pulls in a large number of codecs as dependencies, and also has codecs built in.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "See also Wikipedia:Comparison of audio coding formats.\n\n"
    },
    {
      "title": "Lossless audio codecs",
      "level": 4,
      "content": "- Apple Lossless (ALAC) — A lossless audio compression codec developed by Apple and deployed on all of its platforms and devices.\n\n- FLAC — Free Lossless Audio Codec.\n\n- WavPack — Lossless audio compression format that also has a lossy hybrid mode.\n\n"
    },
    {
      "title": "Lossy audio codecs",
      "level": 4,
      "content": "Table content:\nFormat | Encode | Decode\nAAC | #AAC\nATSC A/52 | aftenAUR | a52dec\nCELT | celtAUR\nMPEG-1 |  |  | libmad\nMP3 | lame\nMusepack (MPC) | – 1 | libmpcdec\nOpus | opus\nVorbis | libvorbis\nSpeech codecs\nAMR | opencore-amr\nSpeex | speex\n\n1. mppenc is not packaged.\n\n- CELT — Open, royalty-free lossy audio codec, optimized for low latency.\n\n- LAME — MP3 encoder and graphical frame analyzer.\n\n- liba52 — Free library for decoding ATSC A/52 (Dolby Digital) streams (lossy).\n\n- libdca — Free library for decoding DTS Coherent Acoustics streams.\n\n- MAD — High-quality MPEG audio decoder.\n\n- Musepack (MPC) — Open source lossy audio codec, designed for transparency.\n\n- opencore-amr — Open source implementation of the Adaptive Multi Rate (AMR) speech codec.\n\n- Opus — Open, royalty-free, lossy audio codec, designed for speech and general audio coding and low latency.\n\n- Speex — Patent-free, lossy audio compression format designed for speech.\n\n- Vorbis — Open, patent-free, lossy audio codec.\n\nFrom Wikipedia:\n\n- FAAC — Proprietary AAC audio encoder.\n\n- FAAD2 — ISO AAC audio decoder.\n\n- Fraunhofer FDK AAC — OpenCORE Framework implementation Advanced Audio Coding (AAC) encoder. Modified library of Fraunhofer AAC decoder and encoder.\n\n- Nero AAC — Nero AAC reference quality MPEG-4 and 3GPP audio codec. (deprecated)\n\n"
    },
    {
      "title": "Image codecs",
      "level": 3,
      "content": "- JasPer — Software-based implementation of the codec specified in the emerging JPEG-2000 Part-1 standard.\n\n- OpenJPEG — Open source JPEG 2000 codec.\n\n- WebP — An image format employing both lossy and lossless compression. It is currently developed by Google.\n\n- AV1 Image File Format (AVIF) — Image format based on the AV1 video codec.\n\n- High Efficiency Image File Format (HEIF) — Image format based on the HEVC video codec. Often in a HEIC container.\n\n- JPEG XL — Royalty-free image format developed by the Joint Photographic Experts Group which aims for broad usage, capable of re-encoding JPEGs while avoiding generation loss.\n\n"
    },
    {
      "title": "Video codecs",
      "level": 3,
      "content": "See also Wikipedia:Comparison of video codecs.\n\nTable content:\nFormat | Codec Libraries\nAV1 | aom, dav1d (decode), rav1e (encode), svt-av1\nAVS2 | davs2AUR (decode)\nDaala | daala-gitAUR\nDirac | schroedinger\nDV | libdv\nH.265 | x265\nlibde265\nH.264 | x264\nMPEG-1 | libmpeg2 (decode)\nMPEG-2\nMPEG-4 | Xvid (xvidcore)\nTheora | libtheora\nVP8, VP9 | libvpx\n\n- AV1 — AOMedia Video 1 (AV1) is a successor codec to Google's VP9, Mozilla's Daala, Cisco's Thor. aom is the reference implementation of both encoding and decoding. dav1d is the performance focused decoder. rav1e is performance focused encoder. Most benchmark show better performances with svt-av1 than rav1e.\n\n- Daala — Research video codec under development by the Xiph.Org Foundation and sponsored by the Mozilla Foundation. The goal of the project is to provide a free to implement, use and distribute digital media format and reference implementation with technical performance superior to h.265.\n\n- libde265 — Open source implementation of the h.265 video codec.\n\n- libdv — The Quasar DV codec (libdv) is a software codec for DV video.\n\n- libmpeg2 — Library for decoding MPEG-1 and MPEG-2 video streams.\n\n- Schrödinger — Advanced royalty-free video compression format designed for a wide range of uses, from delivering low-resolution web content to broadcasting HD and beyond, to near-lossless studio editing.\n\n- Theora — Open video codec developed by the Xiph.org.\n\n- VP9 — High-quality, open video format for the web that's freely available to everyone. Improved version of earlier VP8 codec.\n\n- x264 — Free library for encoding H264/AVC video streams.\n\n- x265 — Open-source project and free application library for encoding video streams into the H.265/High Efficiency Video Coding (HEVC) format.\n\n- Xvid — Open source MPEG-4 video codec.\n\n"
    },
    {
      "title": "Container format tools",
      "level": 2,
      "content": "See also Wikipedia:Comparison of video container formats.\n\n- MKVToolNix — Set of tools to create, edit and inspect Matroska files.\n\n- MP4Joiner — A collection of GUI tools to manipulate MP4 files (MP4Joiner, MP4Splitter).\n\n- OGMtools — Information, extraction or creation for OGG media streams.\n\n"
    },
    {
      "title": "GStreamer",
      "level": 3,
      "content": "From https://gstreamer.freedesktop.org/:\n\nSimply, GStreamer is a backend or framework utilized by many media applications. See GStreamer article.\n\n"
    },
    {
      "title": "xine",
      "level": 3,
      "content": "From https://sourceforge.net/projects/xine/:\n\nAs an alternative to GStreamer, many media players can be configured to utilize the xine backend provided by xine-lib.\n\nNote that the xine project itself provides a capable video player, xine-ui.\n\n"
    },
    {
      "title": "libavcodec",
      "level": 3,
      "content": "libavcodec is part of the FFmpeg project. It includes a large number of video and audio codecs. The libavcodec codecs are included with media players such as MPlayer and VLC, so you may not need to install the ffmpeg package itself.\n\n"
    },
    {
      "title": "No H264, mpg4 or Musepack (.mpc) in Totem Player",
      "level": 3,
      "content": "If you see the \"The H264 plugin is missing\" warning with Totem media player, install gst-libav.\n\n"
    },
    {
      "title": "No H264 in Parole Player",
      "level": 3,
      "content": "If you see the \"Parole needs H.264 decoder to play this file\" warning with Parole media player, install gst-libav.\n\n"
    }
  ]
}