{
  "title": "Common Codecs (Español)",
  "url": "https://wiki.archlinux.org/title/Common_Codecs_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-15** \n\nArtículos relacionados\n\n- Reproducir DVD\n- GStreamer\n- ffmpeg\n\nDesde wikipedia: «un códec es un dispositivo o programa informático capaz de codificar y/o decodificar un flujo de datos o señal digitales.»\n\nEn general, los codecs son utilizados por aplicaciones multimedia para codificar o decodificar transmisiones de audio o vídeo. Para reproducir transmisiones codificadas, los usuarios deben asegurarse de que esté instalado un códec apropiado.\n\nEste artículo trata solo con codecs y backends de aplicaciones; véase la lista de aplicaciones multimedia para obtener una lista de reproductores multimedia (MPlayer, mpv y VLC son ​​opciones populares).\n\n"
    },
    {
      "title": "Requisitos",
      "level": 2,
      "content": "Para reproducir un contenido multimedia se requieren dos elementos:\n\n- Un reproductor multimedia\n- El códec adecuado\n\nNo siempre es necesario instalar codecs explícitamente si tiene instalado un reproductor multimedia. Por ejemplo, MPlayer extrae una gran cantidad de codecs como dependencias y también tiene codecs integrados.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "Véase también Comparación de formatos de codificación de audio.\n\n"
    },
    {
      "title": "Codecs de audio sin pérdida",
      "level": 4,
      "content": "- Apple Lossless (ALAC) — Un códec de compresión de audio sin pérdida desarrollado por Apple e implementado en todas sus plataformas y dispositivos.\n\n- FLAC — Codec libre de audio sin pérdida.\n\n- WavPack — Formato de compresión de audio sin pérdida que también tiene un modo híbrido con pérdida.\n\n"
    },
    {
      "title": "Codecs de audio con pérdida",
      "level": 4,
      "content": "Table content:\nFormato | Codifica | Decodifica\nAAC | #AAC\nATSC A/52 | aftenAUR | a52dec\nCELT | celtAUR\nMPEG-1 |  |  | libmad\nMP3 | lame\nMusepack (MPC) | –1) | libmpcdec\nOpus | opus\nVorbis | libvorbis\nSpeech codecs\nAMR | opencore-amr\nSpeex | speex\n\n1. mppenc no está empaquetado.\n\n- CELT — Códec de audio de compresión con pérdida, libre de regalías, optimizado para baja latencia.\n\n- LAME — Codificador MP3 y analizador gráfico de tramas.\n\n- liba52 — Biblioteca libre para la decodificación de secuencias ATSC A/52 (Dolby Digital).\n\n- libdca — Biblioteca libre para decodificar secuencias DTS Coherent Acoustics.\n\n- MAD — Decodificador de audio MPEG de alta calidad.\n\n- Musepack — Códec de audio de compresión con pérdida de código abierto, diseñado para transparencia.\n\n- opencore-amr — Implementación de código abierto del códec de voz Adaptive Multi Rate (AMR).\n\n- Opus — Códec de audio abierto, libre de regalías y de compresión con pérdida, diseñado para la codificación de voz y audio en general y baja latencia.\n\n- Speex — Formato de compresión de audio de compresión con pérdida y sin patentes diseñado para voz.\n\n- Vorbis — Códec de audio abierto, libre de patentes y de compresión con pérdida.\n\n"
    },
    {
      "title": "AAC",
      "level": 4,
      "content": "De Wikipedia:\n\n- FAAC — Codificador de audio AAC propietario.\n\n- FAAD2 — Decodificador de audio ISO AAC.\n\n- Fraunhofer FDK AAC — Implementación del codificador OpenCORE Framework de Codificación de Audio Avanzado (AAC). Biblioteca modificada del de/codificador Fraunhofer AAC.\n\n- Nero AAC — Códec de audio MPEG-4 y 3GPP de calidad de Nero AAC. (obsoleto)\n\n"
    },
    {
      "title": "Codecs de imagen",
      "level": 3,
      "content": "- JasPer — Implementación basada en software del códec especificado en el estándar emergente JPEG-2000 Part-1.\n\n- OpenJPEG — Open source JPEG 2000 codec.\n\n- WebP — Un formato de imagen que emplea compresión con y sin pérdida. Actualmente es desarrollado por Google.\n\n"
    },
    {
      "title": "Codecs de vídeo",
      "level": 3,
      "content": "Véase también Wikipedia:Comparison of video codecs.\n\nTable content:\nFormato | Bibliotecas de codificación\nAV1 | aom, dav1d (decodifica), rav1e (codifica), svt-av1\nAVS2 | davs2AUR (decodifica)\nDaala | daala-gitAUR\nDirac | schroedinger\nDV | libdv\nH.265 | x265, x265-hgAUR[enlace roto: package not found]\nlibde265, libde265-gitAUR\nH.264 | x264, x264-gitAUR\nMPEG-1 | libmpeg2 (decode)\nMPEG-2\nMPEG-4 | Xvid (xvidcore)\nTheora | libtheora\nVP8, VP9 | libvpx, libvpx-gitAUR\n\n- AV1 — AOMedia Video 1 (AV1) es el códec sucesor de VP9 de Google, Daala de Mozilla, Thor de Cisco. aom es la implementación de referencia de codificación y decodificación. dav1d es el decodificador centrado en el rendimiento. rav1e es un codificador centrado en el rendimiento. La mayoría de los puntos de referencia muestran mejores rendimientos con svt-av1 que con rav1e.\n\n- Daala — Códec de vídeo de investigación en desarrollo por la Fundación Xiph.Org y patrocinado por la Fundación Mozilla. El objetivo del proyecto es proporcionar un formato de medios digitales de referencia de implementación, uso y distribución libre con un rendimiento técnico superior a h.265.\n\n- libde265 — Implementación de código abierto del códec de vídeo h.265.\n\n- libdv — El códec Quasar DV (libdv) es un códec por software para vídeo DV.\n\n- libmpeg2 — Biblioteca para decodificar secuencias de vídeo MPEG-1 y MPEG-2.\n\n- Schrödinger — Formato avanzado de compresión de vídeo sin regalías diseñado para una amplia gama de usos, desde la entrega de contenido web de baja resolución hasta la transmisión de HD y más allá, la edición de estudio casi sin pérdidas.\n\n- Theora — Códec de vídeo libre desarrollado por Xiph.org.\n\n- VP9 — Formato de vídeo abierto y de alta calidad para la web que está disponible libremente para todos. Versión mejorada de anterior códec VP8.\n\n- x264 — Biblioteca libre para la codificación de secuencias de vídeo H264/AVC.\n\n- x265 — Proyecto de código abierto y biblioteca de aplicaciones libres para la codificación de secuencias de vídeo en el formato H.265/Codificación de video de alta eficiencia (HEVC).\n\n- XviD — Códec de vídeo de código abierto MPEG-4.\n\n"
    },
    {
      "title": "Herramientas de formato contenedor",
      "level": 2,
      "content": "Véase también Wikipedia:Comparison of video container formats.\n\n- MKVToolNix — Conjunto de herramientas para crear, editar e inspeccionar archivos Matroska.\n\n- MP4Joiner — Una colección de herramientas GUI para manipular archivos MP4 (MP4Joiner, MP4Splitter).\n\n- OGMtools — Información, extracción o creación de flujos de medios OGG.\n\n"
    },
    {
      "title": "GStreamer",
      "level": 3,
      "content": "De https://gstreamer.freedesktop.org/:\n\nSimplemente, GStreamer es un back-end o framework utilizado por muchas aplicaciones de medios. Véase el artículo GStreamer.\n\n"
    },
    {
      "title": "xine",
      "level": 3,
      "content": "De https://sourceforge.net/projects/xine/:\n\nComo alternativa a GStreamer, muchos reproductores de medios pueden configurarse para utilizar el back-end xine proporcionado por xine-lib.\n\nTenga en cuenta que el proyecto xine en sí mismo proporciona un reproductor de vídeo propio, xine-ui.\n\n"
    },
    {
      "title": "libavcodec",
      "level": 3,
      "content": "libavcodec es parte del proyecto FFmpeg. Incluye una gran cantidad de codecs de vídeo y audio. Los codecs de libavcodec se incluyen con reproductores multimedia como MPlayer y VLC, por lo que es posible que no necesite instalar el paquete ffmpeg.\n\n"
    },
    {
      "title": "Sin H264, mpg4 o Musepack (.mpc) en Totem Player",
      "level": 3,
      "content": "Si observa la advertencia \"The H264 plugin is missing\" (No se encuentra el complemento H264) con el reproductor multimedia Totem, instale gst-libav.\n\n"
    },
    {
      "title": "Sin H264 en el reproductor Parole",
      "level": 3,
      "content": "Si ves la advertencia \"Parole needs H.264 decoder to play this file\" (El reproductor Parole necesita el decodificador H.264 para reproducir este archivo) con el reproductor multimedia Parole, instale gst-libav.\n\n"
    }
  ]
}