{
  "title": "Common Lisp (Español)",
  "url": "https://wiki.archlinux.org/title/Common_Lisp_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-19** \n\nCommon Lisp Es un lenguaje multiparadigma altamente dinámico que enfatiza la interactividad y el rendimiento.\n\n"
    },
    {
      "title": "Implementaciones",
      "level": 2,
      "content": "Existem várias implementações disponíveis:\n\n- ABCL — Armed Bear Common Lisp\n\n- CCL — Clozure Common Lisp\n\n- CLISP — ANSI Común Intérprete Lisp, compilador y depurador\n\n- CMUCL — CMU Common Lisp\n\n- ECL — ceceo común incrustable\n\n- SBCL — Ceceo común de Steel Bank\n\nSBCL presenta un compilador de generación de código nativo altamente optimizado con orígenes que se remontan a principios de la década de 1990. Conocido por su derivación precisa de tipos y su estricto cumplimiento con el estándar ANSI, es particularmente adecuado para programación científica y de propósito general. SBCL es una bifurcación de CMUCL. CMUCL es una implementación solo posix que se desarrolló originalmente en Carnegie Mellon. Por otro lado, ECL y CLISP ofrecen una buena capacidad de incrustación e integración con C. Clozure es una implementación basada en Open Macintosh Common Lisp. Es conocido por sus rápidos tiempos de compilación. ABCL ejecuta la máquina virtual Java.\n\n"
    },
    {
      "title": "Quicklisp",
      "level": 2,
      "content": "Quicklisp (quicklisp) Es un administrador de paquetes escrito en common lisp para cargar bibliotecas comunes de lisp. Funciona en todas las principales implementaciones de common lisp y es la opción dominante para mantener paquetes de common lisp dentro de la comunidad de common lisp.\n\n"
    },
    {
      "title": "SLIME",
      "level": 2,
      "content": "Para conocer la experiencia interactiva por la que Common Lisp es conocido, consultar slime.\n\n"
    },
    {
      "title": "vea también",
      "level": 2,
      "content": "- Wikipedia:Common_Lisp\n- Common Lisp Wiki\n- Online Specification / Hyperspec\n\n"
    }
  ]
}