{
  "title": "Como usar un mouse en la consola (Español)",
  "url": "https://wiki.archlinux.org/title/Como_usar_un_mouse_en_la_consola_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-06** \n\nGPM, abreviatura de General Purpose Mouse, es un daemon que proporciona soporte de ratón para las consolas virtuales Linux.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete gpm. Para la compatibilidad con el panel táctil en un ordenador portátil, véase Laptop (Español)#Panel táctil.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "El parámetro -m precede a la declaración del ratón que se va a utilizar. El parámetro -t precede al tipo de ratón. Para obtener una lista de los tipos disponibles para la opción -t, ejecute gpm con -t help.\n\n```\n# gpm -m /dev/input/mice -t help\n```\n\nEl paquete gpm debe iniciarse con algunos parámetros. Estos parámetros se pueden registrar creando el archivo /etc/conf.d/gpm, o ser usados cuando se ejecuta gpm directamente. gpm.service incluye los parámetros para ratones USB (ExecStart=/usr/bin/gpm -m /dev/input/mice -t imps2).\n\nObviamente, debe editarse, preferiblemente de manera amigable con systemd, si existe otro tipo de ratón, y si se utiliza el servicio.\n\n- Para ratones PS/2, los parámetros son: -m /dev/psaux -t ps2\n- Y los IBM Trackpoints necesitan: -m /dev/input/mice -t ps2\n\n```\n-m /dev/psaux -t ps2\n```\n\n```\n-m /dev/input/mice -t ps2\n```\n\nUna vez que se haya encontrado una configuración adecuada, inicie y active gpm.service.\n\nPara obtener más información, véase gpm(8).\n\n"
    },
    {
      "title": "QEMU o VirtualBox",
      "level": 3,
      "content": "El mouse predeterminado emulado por QEMU y VirtualBox tiene algunos problemas graves tanto en gpm como en x con el posicionamiento y el clic. La posición se desincroniza con el host, por lo que hay áreas sobre las que no se puede pasar el cursor sin salir y volver a entrar repetidamente en la ventana. Los clics se registran en una ubicación diferente a la que mostraba el cursor.\n\nTanto QEMU como VirtualBox resuelven este problema al proporcionar emulación para una tableta USB, lo que brinda un posicionamiento absoluto. (libvirt utiliza esto automáticamente).\n\nSin embargo, gpm solo sabe cómo utilizar el ratón emulado en modo de posicionamiento relativo, por lo que estos problemas persisten. Intentar utilizar otros tipos mediante -t no logrará que funcione correctamente.\n\ngpm-vmAUR incluye una petición de modificación (pull request) de varios años para añade soporte de tableta USB para VirtualBox (que también funciona bajo QEMU) y modifica gpm.service para utilizarlo de forma predeterminada.\n\nEs posible que deba cambiar el evento que se utiliza. (Dar a gpm el -m /dev/input/mice original no funcionará.) Por defecto:\n\n```\n/etc/gpm-vm.conf\n```\n\n```\nevent=\"/dev/input/event2\"\n```\n\nPuede determinar el evento a utilizar instalando evtest y ejecutando:\n\n```\n# evtest\n```\n\n```\n...\n/dev/input/event2:      QEMU QEMU USB Tablet\n...\n```\n\nSi necesita dar opciones adicionales a gpm, puede configurar additional_args en /etc/gpm-vm.conf.\n\nUna vez que se haya encontrado una configuración adecuada, inicie y active gpm.service.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Gentoo:GPM\n- consolationAUR Alternativa basada en libinput\n\n"
    }
  ]
}