{
  "title": "Compton (Русский)",
  "url": "https://wiki.archlinux.org/title/Compton_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "picom — это автономный композитор для Xorg, предназначенный для использования с оконными менеджерами, которые не предоставляют функцию композитинга. picom — это форк compton, который является форком xcompmgr-dana, который является форком xcompmgr.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет picom или пакет picom-gitAUR для разрабатываемой версии.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Настройки по умолчанию расположены в /etc/xdg/picom.conf. Для изменения они могут быть скопированы в ~/.config/picom/picom.conf или ~/.config/picom.conf.\n\nЧтобы использовать другой файл настройки, используйте следующую команду:\n\n```\n$ picom --config path/to/picom.conf\n```\n\nДля более подробной информации обратитесь к picom(1) § CONFIGURATION FILES.\n\n"
    },
    {
      "title": "Отключение теней для отдельных окон",
      "level": 3,
      "content": "Опция shadow-exclude может отключить тени для окон, если это необходимо. Для отключенных в данный момент окон смотрите [1].\n\nДля отключения теней для меню добавьте следующие строки в wintypes в picom.conf:\n\n```\n# menu        = { shadow = false; };\ndropdown_menu = { shadow = false; };\npopup_menu    = { shadow = false; };\nutility       = { shadow = false; };\n```\n\nДругие значения WINDOW_TYPE, которые могут быть использованы, описаны в стандарте EWMH: unknown, desktop, dock, toolbar, menu, utility, splash, dialog, normal, dropdown_menu, popup_menu, tooltip, notification, combo, и dnd.\n\n"
    },
    {
      "title": "Прозрачность",
      "level": 3,
      "content": "Для установки непрозрачности (а фактически прозрачности) для окон в фокусе и нет (для примера эмуляторы терминала) добавьте следующее в picom.conf:\n\n```\nopacity-rule = [\n  \"90:class_g = 'URxvt' && focused\",\n  \"60:class_g = 'URxvt' && !focused\"\n];\n```\n\nСмотрите также #Окна во вкладках (тени и прозрачность).\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "picom может быть запущен или остановлен вручную во время сессии или быть добавлен в автозагрузку в качестве фонового процесса для сессий. Существует несколько дополнительных аргументов, которые могут быть использованы для настройки предоставляемых композитных эффектов. Они включают в себя:\n\n- -b: Запустить как фоновый процесс для сессии (Например, при автозапуске для оконных менеджеров по типу Openbox)\n- -c: Включить эффекты теней\n- -C: Отключить тени для панелей и доков (устаревшая опция, используйте #Отключение теней для отдельных окон)\n- -G: Отключить тени для окон приложений и объектов Drag-And-Drop (устаревшая опция, используйте #Отключение теней для отдельных окон)\n- --config: Использовать указанный конфигурационный файл\n\nИмеется множество других опций, включая установку таймингов, управление дисплеями, прозрачность меню, границ окон и неактивных меню. Смотрите picom(1).\n\nЧтобы вручную активировать композитные эффекты в текущей сессии, используйте следующую команду:\n\n```\n$ picom &\n```\n\nДля автозапуска picom в качестве фонового процесса для сессии можно использовать аргумент -b (может вызвать зависание дисплея):\n\n```\n$ picom -b\n```\n\nПример, где используются дополнительные аргументы, которые требуют указания значений:\n\n```\n$ picom -cfF -o 0.38 -O 200 -I 200 -t 0 -l 0 -r 3 -D2 -m 0.88\n```\n\n"
    },
    {
      "title": "Многомониторная конфигурация",
      "level": 2,
      "content": "Если используется многомониторная конфигурация без xinerama - что означает, что X-сервер был запущен больше чем с одним монитором - в таком случае picom стартует по умолчанию только на одном мониторе. Он может быть запущен на всех мониторах при использовании переменной окружения DISPLAY. Для примера, запуск на нулевом дисплее X в фоне:\n\n```\nDISPLAY=\":0\" picom -b\n```\n\nПриведённая выше команда должна сработать для всех мониторов. Если это не произошло, можно попробовать старый метод с указанием каждого монитора вручную:\n\n```\nseq 0 3 | xargs -l1 -I@ picom -b -d :0.@\n```\n\n"
    },
    {
      "title": "Оттенки серого",
      "level": 2,
      "content": "Можно преобразовать вид окон в оттенки серого при помощи шейдеров.\n\nКак гласит picom(1), начните с редактирования шейдера по умолчанию из исходников picom.\n\n```\n/path/to/shader/file.glsl\n```\n\n```\n#version 330\n\nin vec2 texcoord;\nuniform sampler2D tex;\nuniform float opacity;\n\nvec4 default_post_processing(vec4 c);\n\nvec4 window_shader() {\n\tvec2 texsize = textureSize(tex, 0);\n\tvec4 color = texture2D(tex, texcoord / texsize, 0);\n\n\tcolor = vec4(vec3(0.2126 * color.r + 0.7152 * color.g + 0.0722 * color.b) * opacity, color.a * opacity);\n\n\treturn default_post_processing(color);\n}\n```\n\nЗатем запустите picom, указав путь к шейдеру. Также, скорее всего, нужно будет использовать бекенд glx.\n\n```\n$ picom --backend glx --window-shader-fg /path/to/shader/file.glsl\n```\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Последние версии picom имеют некоторые проблемы с ускорением DRI2, при этом наблюдалось сильное мерцание экрана (баг picom, баг mesa). Эта проблема была решена, но всё ещё может возникнуть у некоторых пользователей. С DRI3 такой проблемы нет.\n\nИспользование эффектов композитинга иногда может вызывать проблемы, такие как визуальные глюки при неправильной настройке для использования с другими приложениями и программами.\n\n"
    },
    {
      "title": "Conky",
      "level": 3,
      "content": "Чтобы отключить тени для окон Conky, добавьте следующее в ~/.conkyrc:\n\n```\nown_window_class conky\n```\n\nВ случае, если это решение ломается с эффектом размытия, вы можете попробовать добавить следующее в ~/.conkyrc:\n\n```\nown_window_type= 'desktop'\n```\n\n"
    },
    {
      "title": "dwm и dmenu",
      "level": 3,
      "content": "Панель статуса dwm не обнаруживается какими-либо функциями picom для автоматического исключения элементов оконного менеджера. Ни dwm, ни dmenu не имеют статического id окна. Если вы хотите исключить их из прозрачности неактивного окна (или чего-то другого), вы должны либо пропатчить класс окна в исходном коде каждого из них, либо исключить их по менее точным атрибутам. Следующий пример со статусом dwm сверху, который позволяет получить разрешение, не зависящее от исключения местоположения:\n\n```\n$ picom <any other arguments> --focus-exclude \"x = 0 && y = 0 && override_redirect = true\"\n```\n\nИначе, можно использовать файл конфигурации:\n\n```\nfocus-exclude = \"x = 0 && y = 0 && override_redirect = true\";\n```\n\nСудя по всему, свойство \"override redirect\" ложно для большинства окон — наличие этого свойства в правиле исключения позволяет не исключать другие окна, нарисованные в левом верхнем углу (для примера, когда панель статуса dwm скрыта, x0 y0 будет соответствовать тому, что находится в основном стеке dwm).\n\n"
    },
    {
      "title": "Firefox",
      "level": 3,
      "content": "Смотрите #Отключение теней для отдельных окон.\n\nЧтобы отключить тени для элементов Firefox, добавьте следующее в shadow-exclude в picom.conf:\n\n```\n\"class_g = 'firefox' && argb\",\n```\n\nСмотрите [2] для подробностей.\n\n"
    },
    {
      "title": "slock",
      "level": 3,
      "content": "Когда включена прозрачность для неактивных окон (аргумент -i при запуске команды), могут быть некоторые проблемы при использовании slock. Одно из решений — смена значения прозрачности на 0.2. Для примера, аргументы picom при запуске его командой:\n\n```\n$ picom <any other arguments> -i 0.2\n```\n\nИли при использовании конфигурационного файла:\n\n```\ninactive-dim = 0.2;\n```\n\nВ качестве альтернативы, вы можете попробовать исключить slock по id окна или исключить все окна без имени.\n\nИсключить все окна без имени можно, используя следующие опции picom:\n\n```\n$ picom <other arguments> --focus-exclude \"! name~=''\"\n```\n\nУзнать id окна slock можно при помощи команды:\n\n```\n$ xwininfo & slock\n```\n\nБыстро нажмите в любом месте экрана (перед выходом из slock) и введите ваш пароль для разблокировки. Вы должны увидеть id окна в выводе:\n\n```\nxwininfo: Window id: 0x1800001 (has no name)\n```\n\nВозьмите полученный id и исключите его при помощи:\n\n```\n$ picom <any other arguments> --focus-exclude 'id = 0x1800001'\n```\n\nИли при использовании конфигурационного файла:\n\n```\nfocus-exclude = \"id = 0x1800001\";\n```\n\n"
    },
    {
      "title": "Мерцание",
      "level": 3,
      "content": "Проявляется в полностью развёрнутых окнах (в сессиях без каких-либо панелей) с picom.conf по умолчанию и устраняется следующей опцией:\n\n```\nunredir-if-possible = false;\n```\n\nСмотрите [3] для подробностей.\n\n"
    },
    {
      "title": "Разрыв картинки в полноэкранном режиме",
      "level": 3,
      "content": "Если вы встретили разрыв картинки в полноэкранном режиме при воспроизведении видео, смотрите #Мерцание.\n\n"
    },
    {
      "title": "Задержка при использовании xft-шрифтов",
      "level": 3,
      "content": "Если вы столкнулись с сильной задержкой при использовании Xft-fonts в приложениях по типу xterm или urxvt попробуйте следующие опции:\n\n```\n--xrender-sync --xrender-sync-fence\n```\n\nили бекенд xrender.\n\nСмотрите [4] для подробностей.\n\n"
    },
    {
      "title": "Окна во вкладках (тени и прозрачность)",
      "level": 3,
      "content": "Когда окна с прозрачностью находятся во вкладочном режиме, нижележащие окна остаются видимыми из-за прозрачности. Также каждое окно во вкладках рисует свою собственную тень, что в итоге приводит к множественным теням.\n\nУстранение проблемы множественной тени производится правкой уже существующего списка исключения теней:\n\n```\n\"_NET_WM_STATE@:32a *= '_NET_WM_STATE_HIDDEN'\"\n```\n\nОтрисовка нижележащих окон может быть отключена добавлением следующий строк в picom.conf:\n\n```\nopacity-rule = [\n  \"95:class_g = 'URxvt' && !_NET_WM_STATE@:32a\",\n  \"0:_NET_WM_STATE@[0]:32a *= '_NET_WM_STATE_HIDDEN'\",\n  \"0:_NET_WM_STATE@[1]:32a *= '_NET_WM_STATE_HIDDEN'\",\n  \"0:_NET_WM_STATE@[2]:32a *= '_NET_WM_STATE_HIDDEN'\",\n  \"0:_NET_WM_STATE@[3]:32a *= '_NET_WM_STATE_HIDDEN'\",\n  \"0:_NET_WM_STATE@[4]:32a *= '_NET_WM_STATE_HIDDEN'\"\n];\n```\n\nУчтите, что URxvt - это имя класса Xorg вашего терминала. Измените его, если используете другой терминал. Вы можете узнать класс окна при помощи команды xprop WM_CLASS и нажатия на нужное окно.\n\nСмотрите [5] для подробностей.\n\n"
    },
    {
      "title": "Невозможно изменить цвет фона при помощи xsetroot",
      "level": 3,
      "content": "В данный момент, picom несовместим с опцией -solid у xsetroot, обходное решение - использование hsetroot для установки цвета фона:\n\n```\n$ hsetroot -solid '#000000'\n```\n\nСмотрите [7] для подробностей.\n\n"
    },
    {
      "title": "Разрыв экрана на проприетарных драйверах NVIDIA",
      "level": 3,
      "content": "Попробуйте добавить следующее в picom.conf:\n\n```\nvsync = true;\n```\n\n"
    },
    {
      "title": "Задержка с проприетарными драйверами NVIDIA и FullCompositionPipeline",
      "level": 3,
      "content": "Попробуйте запустить picom с:\n\n```\n--backend xrender\n```\n\nили добавьте\n\n```\nbackend = \"xrender\";\n```\n\nв ваш picom.conf.\n\nСмотрите [8] для подробностей.\n\nДругим способом уменьшить лаг при использовании бекенда glx является отключение опции \"allow flipping\" [9] в параметрах nvidia (OpenGL section). Также это можно сделать из командной строки:\n\n```\n$ nvidia-settings -a 'AllowFlipping=0'\n```\n\nЧтобы загрузить настройки после перезагрузки (смотрите статью Автозапуск), выполните\n\n```\n$ nvidia-settings --load-config-only\n```\n\n"
    },
    {
      "title": "Утечка памяти в Xorg с проприетарными драйверами NVIDIA",
      "level": 3,
      "content": "Смотрите #Задержка с проприетарными драйверами NVIDIA и FullCompositionPipeline.\n\n"
    },
    {
      "title": "Slock после засыпания",
      "level": 3,
      "content": "При использовании сервиса systemd для активации slock во время засыпания или гибернации, экран может оказаться разблокированным на несколько секунд после возобновления работы. Чтобы это предотвратить, отключите угасание окон:\n\n```\n$ picom --no-fading-openclose\n```\n\n"
    },
    {
      "title": "Совместный доступ к экрану",
      "level": 3,
      "content": "Наложения теней совместного доступа к экрану и теней всплывающих окон Zoom Meetings можно избежать добавления следующего в shadow-exclude.\n\n```\nshadow-exclude = [\n  \"name = 'cpt_frame_xcb_window'\",\n  \"class_g ?= 'zoom'\",\n];\n```\n\nРазмытый совместный доступ к экрану можно отключить, добавив Zoom Meetings в blur-background-exclude\n\n```\nblur-background-exclude = [\n  \"class_g ?= 'zoom'\",\n];\n```\n\nДля Microsoft Teams красная граница вокруг разделяемого контента реализована с использованием почти полностью прозрачного окна. Включенное размытие делает невозможной работу и должно быть отключено при помощи:\n\n```\nshadow-exclude = [\n  \"name = 'rect-overlay'\",\n];\n\nblur-background-exclude = [\n  \"name = 'rect-overlay'\",\n];\n```\n\n"
    },
    {
      "title": "Отключение эффекта затухания окна при переключении между рабочими пространствами",
      "level": 3,
      "content": "Добавление флагов --fade-in-step=1 --fade-out-step=1 --fade-delta=0 может отключить затухание окон и эффект затухания при переключении на другое \"рабочее место\". [10]\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Howto: Using Compton for tear-free compositing on XFCE or LXDE\n\n"
    }
  ]
}