{
  "title": "Compiz (Français)",
  "url": "https://wiki.archlinux.org/title/Compiz_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Compiz/Configuration\n- Window manager (Français)\n- Desktop environment\n- Xfce (Français)\n- MATE (Français)\n\nSelon Wikipedia :\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Il y a deux versions de Compiz disponibles, la série 0.8 qui est écrite en C et la série 0.9 qui est une réécriture complète de Compiz en C++. Les deux séries sont activement développées. Compiz 0.9 est développé par les mainteneurs de Compiz sur Launchpad tandis que Compiz 0.8 est développé par le projet Compiz Reloaded sur GitLab. Les deux séries ne peuvent pas être installées côte à côte.\n\n"
    },
    {
      "title": "Série 0.9",
      "level": 3,
      "content": "- Compiz — Gestionnaire de fenêtres composites OpenGL avec CCSM, plugins et décorateur de fenêtres GTK.\n\n"
    },
    {
      "title": "Série 0.8",
      "level": 3,
      "content": "Nécessaire :\n\n- Compiz Core — Gestionnaire de fenêtres composites OpenGL.\n\nFortement recommandé :\n\n- CompizConfig Settings Manager — Gestionnaire de paramètres graphiques pour Compiz.\n\n- Compiz Fusion Plugins Main — Collection principale de plugins pour Compiz.\n\n- Compiz Fusion Plugins Extra — Collection de plugins supplémentaires pour Compiz.\n\nFacultatif :\n\n- Compiz Fusion Plugins Experimental — Des plugins Compiz expérimentaux (connus sous le nom de Plugins non pris en charge avant la version 0.8.12).\n\n"
    },
    {
      "title": "Extras",
      "level": 3,
      "content": "- Emerald — Un décorateur de fenêtre autonome pour Compiz.\n\n- Emerald Themes — Thèmes supplémentaires pour le décorateur de fenêtres Emerald.\n\n- Fusion Icon — Un applet de la barre d'état système permettant de lancer Compiz et de changer de gestionnaire de fenêtres et de décorateur à la volée.\n\n- Compiz Manager — Un script enveloppant pour démarrer Compiz.\n\n- Simple CCSM — Gestionnaire graphique simplifié des paramètres pour Compiz 0.8.\n\n"
    },
    {
      "title": "Activation des plugins importants",
      "level": 3,
      "content": "Avant de démarrer Compiz, vous devez activer certains plugins pour obtenir un comportement de base du gestionnaire de fenêtres, sinon vous ne pourrez pas faire glisser, redimensionner ou fermer les fenêtres. Les plugins importants sont listés ci-dessous :\n\n- Window Decoration - fournit les bordures de fenêtres, consultez #Décoration des fenêtres.\n- Move Window - déplacer la fenêtre.\n- Resize Window - redimensionnement de la fenêtre.\n- Place Windows - configure les options de placement des fenêtres.\n- Application Switcher - fournit une transition avec Alt+Tab - il existe de nombreux plugins alternatifs de transition entre application, par exemple : Shift Switcher, Static Application Switcher et plus encore. Ils n'utilisent pas tous le raccourci clavier Alt+Tab.\n\nPour pouvoir passer à différents vues, vous devez activer l'un des éléments suivants :\n\n- Desktop Cube & Rotate Cube - fournit le cube tournant avec chaque côté étant un bureau différente.\n- Desktop Wall - les fenêtres sont disposées les unes à côté des autres - l'animation est similaire à l'animation de changement d'espace de travail dans Cinnamon et GNOME Shell.\n- Expo - crée une vue de toutes les fenêtres et fenêtres lorsque la souris est déplacée dans le coin supérieur gauche - ce plugin peut être utilisé seul ou en conjonction avec l'un des deux plugins précédents.\n\n"
    },
    {
      "title": "Décoration des fenêtres",
      "level": 4,
      "content": "Le décorateur de fenêtres est le programme qui fournit des fenêtres avec des bordures. Contrairement aux gestionnaires de fenêtres tels que Kwin ou Xfwm qui ne fournissent qu'un seul décorateur, les utilisateurs de Compiz ont le choix entre trois : GTK Window Decorator, KDE Window Decorator et Emerald. Le GTK Window Decorator et le KDE Window Decorator sont inclus dans le code source de Compiz et peuvent être compilés en option lors de la construction de Compiz. Emerald, d'autre part, est un décorateur séparé et autonome. Le plugin Window Decoration dans CCSM doit être coché, sinon aucun décorateur de fenêtre ne sera lancé.\n\nLe décorateur de fenêtre qui sera lancé est spécifié sous CCSM -> Effets -> Décoration de fenêtre -> Commande. La commande par défaut est compiz-decorator qui est un script qui va essayer de localiser les exécutables emerald et gtk-window-decorator (et aussi l'exécutable kde4-window-decorator si vous utilisez Compiz 0.9). Il lancera alors le premier décorateur qu'il trouvera, selon l'ordre de recherche et les conditions (telles que la détection de session) spécifiées dans le script. Notez que le script fourni par Compiz 0.8 diffère significativement de celui fourni par Compiz 0.9, le comportement peut donc être différent.\n\nLa commande compiz-decorator peut être remplacée par l'un des exécutables listés ci-dessus. Si vous trouvez que votre décorateur préféré n'est pas lancé, essayez d'ajouter le paramètre --replace à la commande, par exemple : emerald --replace.\n\n"
    },
    {
      "title": "Démarrage de Compiz",
      "level": 3,
      "content": "Vous pouvez démarrer Compiz en utilisant la commande suivante :\n\n```\n$ compiz --replace\n```\n\nConsultez compiz --help pour plus d'options.\n\n"
    },
    {
      "title": "Fusion Icon",
      "level": 4,
      "content": "Pour démarrer Compiz en utilisant Fusion Icon, exécutez la commande ci-dessous :\n\n```\n$ fusion-icon\n```\n\nPour s'assurer que fusion-icon lance Compiz, faites un clic droit sur l'icône dans le panneau et allez dans select window manager. Choisissez Compiz s'il n'est pas déjà sélectionné.\n\n"
    },
    {
      "title": "Démarrage automatique de Compiz dans un environnement de bureau",
      "level": 3,
      "content": "Consultez Desktop environment#Use a different window manager.\n\n"
    },
    {
      "title": "Démarrer la session avec un gestionnaire d'affichage",
      "level": 3,
      "content": "Une session autonome de Compiz peut être lancée à partir d'un gestionnaire d'affichage. Pour la plupart des gestionnaires d'affichage - LightDM par exemple - tout ce qui est nécessaire est de créer un fichier .desktop dans /usr/share/xsessions qui exécute compiz (avec des options de ligne de commande si nécessaire) ou fusion-icon. Consultez l'article correspondant à votre gestionnaire d'affichage. Consultez Desktop entries pour des informations sur la création d'un fichier .desktop.\n\n"
    },
    {
      "title": "Démarrage automatique de programmes lors de l'utilisation d'un gestionnaire d'affichage",
      "level": 4,
      "content": "Une façon de démarrer des programmes avec votre session Compiz, lorsqu'elle est lancée à partir d'un gestionnaire d'affichage, est d'utiliser un fichier xprofile. Une autre option est que le fichier .desktop dans /usr/share/xsessions n'exécute pas directement compiz mais exécute un script qui démarre les programmes que vous souhaitez lancer et démarre également Compiz.\n\n"
    },
    {
      "title": "Démarrer la session avec startx",
      "level": 3,
      "content": "Une session Compiz peut être démarrée avec startx. Définissez soit compiz soit fusion-icon dans votre fichier .xinitrc. Consultez l'article xinitrc pour plus de détails.\n\n"
    },
    {
      "title": "Autoriser les utilisateurs à arrêter/redémarrer",
      "level": 3,
      "content": "Consultez Allow users to shutdown#Using systemd-logind : vous pouvez assigner un raccourci clavier aux commandes systemctl en utilisant le plugin Commands dans CCSM.\n\n"
    },
    {
      "title": "Rétablir le gestionnaire de fenêtres natif",
      "level": 3,
      "content": "Vous pouvez revenir au gestionnaire de fenêtres par défaut de votre environnement de bureau avec la commande suivante :\n\n```\nwm_name --replace\n```\n\nen utilisant par exemple kwin, metacity ou xfwm4 au lieu de wm_name.\n\n"
    },
    {
      "title": "Activation de la boîte de dialogue d'exécution Alt+F2",
      "level": 3,
      "content": "Activez le plugin Gnome Compatibility dans CCSM.\n\nIl y a deux façons d'activer la boîte de dialogue d'exécution de MATE Panel dans Compiz. Vous pouvez soit :\n\n- Activer le plugin MATE Compatibility dans CCSM (utilisez le plugin Gnome Compatibility pour les anciennes versions de Compiz qui n'ont pas le plugin MATE).\n- Utilisez la commande ci-dessous avec la combinaison de touches Alt+F2 en utilisant le plugin Commands de CCSM.\n\n```\nmate-panel --run-dialog\n```\n\nUtilisez la commande ci-dessous avec la combinaison de touches Alt+F2 à l'aide du plugin Commands de CCSM.\n\n```\nlxpanelctl run\n```\n\nLorsque Compiz est utilisé dans une session Xfce, le dialogue d'exécution (fourni par xfce4-appfinder) devrait fonctionner sans intervention. Si vous utilisez Xfce Appfinder dans une session Compiz autonome, utilisez la commande ci-dessous à la combinaison de touches Alt+F2 en utilisant le plugin Commands de CCSM.\n\n```\nxfce4-appfinder --collapsed\n```\n\nUtilisez la commande d'une Boîte de dialogue de votre choix avec la combinaison de touches Alt+F2 à l'aide du plugin Commandes de CCSM.\n\n"
    },
    {
      "title": "Supprimer la barre de titre des fenêtres maximisées",
      "level": 3,
      "content": "Lancez CCSM et accédez au plugin Décoration de fenêtre. Ensuite, dans le champ Décoration des fenêtres, changez any en !state=maxvert. [3]\n\n"
    },
    {
      "title": "Cartes ATI",
      "level": 4,
      "content": "Un problème possible avec GLX_EXT_texture_from_pixmap sur les cartes ATI est que la carte ne peut effectuer le rendu qu'indirectement. Si c'est le cas, vous devez passer l'option à votre libgl comme indiqué ci-dessous :\n\n```\nLIBGL_ALWAYS_INDIRECT=1 compiz --replace &\n```\n\n"
    },
    {
      "title": "Puces Intel",
      "level": 4,
      "content": "Utilisez la commande suivante pour démarrer Compiz (cette commande doit être utilisée à chaque fois).\n\n```\nLIBGL_ALWAYS_INDIRECT=true compiz --replace --sm-disable &\n```\n\n"
    },
    {
      "title": "Compiz démarre sans bordures de fenêtre avec les pilotes binaires NVIDIA",
      "level": 3,
      "content": "Tout d'abord, assurez-vous que les paramètres de votre décorateur de fenêtre sont correctement configurés - consultez #Décoration des fenêtres. Si les bordures de fenêtres ne chargent toujours pas, essayez d'ajouter Option \"AddARGBGLXVisuals\" \"True\" et Option \"DisableGLXRootClipping\" \"True\" à votre section \"Screen\" dans /etc/X11/xorg.conf.d/20-nvidia.conf. Si les bordures de fenêtres ne se chargent toujours pas et que vous avez utilisé d'autres options ailleurs dans /etc/X11/xorg.conf.d/, essayez de les commenter et d'utiliser uniquement les options ARGBGLXVisuals et GLXRootClipping mentionnées ci-dessus.\n\n"
    },
    {
      "title": "Écran vide lors de la reprise de la suspension à la marche avec les pilotes binaires NVIDIA",
      "level": 3,
      "content": "Si vous obtenez un écran vide avec un curseur réactif lors de la reprise, essayez de désactiver la synchronisation avec vblank. Pour ce faire, ouvrez CCSM, accédez au plugin OpenGL et décochez l'option Sync to VBlank.\n\n"
    },
    {
      "title": "Mauvaises performances des cartes graphiques performantes",
      "level": 3,
      "content": "Puces NVIDIA et Intel : Si tout est configuré correctement mais que vous avez toujours de mauvaises performances avec certains effets, essayez de désactiver CCSM > Options générales > Paramètres d'affichage > Détecter le taux de rafraîchissement et choisissez plutôt une valeur manuellement.\n\nPuces NVIDIA uniquement : Le taux de rafraîchissement inadéquat avec Détecter le taux de rafraîchissement peut être dû à une option appelée DynamicTwinView qui est activée par défaut et qui joue un rôle dans la transmission précise du taux de rafraîchissement maximum que votre carte et votre écran prennent en charge. Vous pouvez désactiver DynamicTwinView en ajoutant la ligne suivante à la section \"Device\" ou \"Screen\" de votre /etc/X11/xorg.conf.d/20-nvidia.conf, puis en redémarrant votre ordinateur :\n\n```\nOption \"DynamicTwinView\" \"False\"\n```\n\n"
    },
    {
      "title": "Scintillement d'écran avec une carte NVIDIA",
      "level": 3,
      "content": "Pour corriger ce comportement, créez le fichier ci-dessous :\n\n```\n/etc/modprobe.d/nvidia.conf\n```\n\n```\noptions nvidia NVreg_RegistryDwords=\"PerfLevelSrc=0x2222\"\n```\n\n"
    },
    {
      "title": "Tearing vidéo",
      "level": 3,
      "content": "Si vous rencontrez des problèmes de Tearing (déchirement) vidéo lorsque vous utilisez Compiz, essayez d'activer le plugin Workarounds dans CCSM. Une fois activé, assurez-vous que les options suivantes sont activées dans Workarounds : Force complete redraw on initial damage, Force full screen redraws (buffer swap) on repaint.\n\nSi vous utilisez une puce Intel et que la solution ci-dessus ne résout pas le problème de déchirement vidéo, consultez Intel graphics (Français)#Tearing.\n\nConsultez également #Mauvaises performances des cartes graphiques performantes.\n\n"
    },
    {
      "title": "Fusion Icon ne parvient pas à démarrer",
      "level": 3,
      "content": "Si vous obtenez une sortie comme celle-ci à partir de la ligne de commande :\n\n```\n$ fusion-icon\n```\n\n```\n* Detected Session: gnome\n* Searching for installed applications...\nTraceback (most recent call last):\n  File \"/usr/bin/fusion-icon\", line 57, in <module>\n    from FusionIcon.interface import choose_interface\n  File \"/usr/lib/python2.5/site-packages/FusionIcon/interface.py\", line 23, in <module>\n    import start\n  File \"/usr/lib/python2.5/site-packages/FusionIcon/start.py\", line 36, in <module>\n    config.check()\n  File \"/usr/lib/python2.5/site-packages/FusionIcon/util.py\", line 362, in check\n    os.makedirs(self.config_folder)\n  File \"/usr/lib/python2.5/os.py\", line 172, in makedirs\n    mkdir(name, mode)\nOSError: [Errno 13] Permission denied: '/home/andy/.config/compiz'\n```\n\nle problème vient de la permission sur ~/.config/compiz/. Pour le résoudre, utilisez :\n\n```\n# chown -R username /home/username/.config/compiz/\n```\n\n"
    },
    {
      "title": "Le raccourci clavier Alt+F4 ne fonctionne pas (Xfce)",
      "level": 3,
      "content": "Si Compiz remplace Xfwm4 lors de la connexion, cela peut rendre le raccourci clavier Alt+F4 non fonctionnel. Pour éviter ce problème, assurez-vous que seul Compiz est lancé à la connexion - consultez Xfce#Use a different window manager.\n\n"
    },
    {
      "title": "Emerald se bloque lors de la sélection d'un thème",
      "level": 3,
      "content": "Vous pouvez constater qu'Emerald se bloque lors de la sélection de certains thèmes (en particulier les thèmes qui utilisent le moteur hérité). Si cela se produit, sélectionnez un autre thème dans le gestionnaire de thèmes Emerald, puis exécutez la commande emerald --replace.\n\n"
    },
    {
      "title": "Pas de sonnerie système lorsque Compiz est en cours d'exécution",
      "level": 3,
      "content": "Vous pouvez constater que la sonnerie du système (comme le son de goutte à goutte joué en appuyant sur l'espacement arrière au début d'une ligne dans le terminal GNOME ou MATE) ne se déclenche pas si Compiz est en cours d'exécution. Consultez le rapport de bogue en amont suivant [4].\n\nLes utilisateurs de PulseAudio, comme solution de contournement, peuvent forcer PulseAudio à gérer la sonnerie du système, consultez PulseAudio#X11 Bell Events.\n\n"
    },
    {
      "title": "Compiz se bloque lors de l'activation du plugin de compatibilité Gnome (backend GSettings)",
      "level": 3,
      "content": "Si vous utilisez le backend GSettings, vous pouvez constater que Compiz se bloque si vous essayez d'activer le plugin Compatibilité Gnome. Afin d'activer ce plugin tout en utilisant le backend GSettings, vous devez ouvrir CCSM et naviguer dans Preferences. Sous l'en-tête Intégration, décochez la case intitulée Activer l'intégration dans l'environnement de bureau. Après avoir décoché cette option, vous devriez pouvoir activer le plugin Gnome Compatibility.\n\n"
    },
    {
      "title": "Les fenêtres perdent le focus lorsqu'elles ne sont pas réduites",
      "level": 3,
      "content": "Vous pouvez constater que certaines fenêtres (comme une fenêtre Chromium) perdent le focus lorsqu'elles ne sont pas réduites. Consultez le rapport de bogue en amont. Une solution possible est d'activer l'option Conserver les aperçus des fenêtres minimisées, située dans le plugin Solutions de contournement.\n\n"
    },
    {
      "title": "Les fenêtres popout sont décalées lorsque Compiz est en cours d'exécution",
      "level": 3,
      "content": "Vous pouvez constater que les fenêtres contextuelles des panneaux placés en bas de l'écran sont décalées de quelques pixels, de sorte que la fenêtre semble flotter au-dessus du panneau. Ce problème est connu pour affecter Xfce et KDE et peut également affecter d'autres bureaux. Vous trouverez ci-dessous une liste de solutions de contournement qui peuvent résoudre certains cas.\n\n- Placez le panneau en haut de l'écran plutôt qu'en bas - cela devrait fonctionner dans la plupart des cas.\n- Désactiver le plugin Place Windows - cela fonctionne pour le plugin Xfce Whisker Menu mais peut ne pas fonctionner ailleurs.\n- Utilisez le placement fixe de la fenêtre pour déterminer la position de la fenêtre. Cela peut être défini à partir du plugin Place Windows. Par exemple, pour le Whisker Menu, spécifiez que la fenêtre avec le titre Whisker Menu doit apparaître à (-1, -1).\n\nPour plus d'informations, consultez le rapport de bogue en amont suivant [5].\n\n"
    },
    {
      "title": "La transition Alt-Tab n'a pas d'arrière-plan (Emerald)",
      "level": 3,
      "content": "Vous pouvez constater que la transition Alt-Tab (fourni par les plugins staticswitcher ou switcher) a un arrière-plan complètement transparent lorsque vous utilisez également Emerald. Cela peut rendre difficile la différenciation des vignettes de fenêtre du fond du bureau derrière elles. À partir de Compiz 0.9.12 (révision 3975), une solution de contournement est disponible. Dans CCSM, naviguez vers Application Switcher ou Static Application Switcher selon le plugin que vous utilisez. Dans le premier cas, les paramètres d'Arrière-plan se trouvent dans Général et dans le second cas, les paramètres se trouvent sous Apparence. Une fois que vous avez trouvé les paramètres, assurez-vous que la case Définir la couleur de l'arrière-plan est cochée. La couleur par défaut est un gris foncé qui peut être modifié de manière facultative.\n\nVous pouvez également utiliser le GTK Window Decorator au lieu d'Emerald ou utiliser un autre sélecteur de fenêtre, par exemple le sélecteur shift. Notez que même si vous utilisez le décorateur de fenêtres GTK, vous pouvez toujours changer la couleur de fond comme décrit ci-dessus.\n\n"
    },
    {
      "title": "Curseur de la souris invisible ou en forme de X au démarrage",
      "level": 3,
      "content": "Consultez Cursor themes#Change X shaped default cursor.\n\n"
    },
    {
      "title": "Les plugins de Compiz 0.8 ne sont pas présents dans Compiz 0.9",
      "level": 3,
      "content": "Certains plugins qui étaient populaires dans Compiz 0.8 ont été désactivés dans Compiz 0.9.8 et plus afin de compléter la prise en charge de OpenGL ES. Quelques-uns des plugins désactivés ont depuis été réactivés ; par exemple, le plugin Animations Add-On a été réactivé dans la version 0.9.13.0 de Compiz. D'autres plugins actuellement désactivés qui reçoivent des correctifs pour ce problème pourraient bien être réactivés dans les prochaines versions. Pour plus d'informations, consultez les notes de version pour Compiz 0.9.8.\n\nDe même, Compiz Plugins Unsupported (un paquet qui inclut des plugins tels que Atlantis) n'est pas disponible dans les versions récentes de Compiz 0.9. Il n'a pas été développé pour la série Compiz 0.9 depuis Compiz 0.9.5 et ne compilent plus.\n\n"
    },
    {
      "title": "Compiz se bloque lors de l'activation du plugin D-Bus",
      "level": 3,
      "content": "Le plugin D-Bus provoque un crash de Compiz s'il est activé en conjonction avec certains autres plugins tels que le plugin Cube. Consultez le rapport de bogue amont suivant [6].\n\n"
    },
    {
      "title": "Problèmes liés aux boutons de l'espace de travail et des fenêtres",
      "level": 3,
      "content": "Seules quelques barres des tâches sont compatibles avec les viewports de Compiz. Les panneaux et docks incompatibles peuvent présenter des problèmes tels que l'affichage de tous les boutons de fenêtre dans tous les espaces de travail ou le pager de l'espace de travail peut n'afficher qu'un seul espace de travail disponible. Les panneaux listés ci-dessous sont connus pour être compatibles :\n\n- xfce4-panel (partielle, consultez #Problèmes liés au panneau Xfce)\n- mate-panel\n- gnome-panel\n- cairo-dock\n\n"
    },
    {
      "title": "Consulter aussi",
      "level": 2,
      "content": "- Compiz dans Launchpad\n- Compiz dans GitHub\n- Compiz Home, y compris le wiki et le forum (le site web et le wiki ne sont pas maintenus)\n- Troubleshooting - Compiz Wiki, (le wiki n'est pas maintenu)\n\n"
    }
  ]
}