{
  "title": "Comparison of tiling window managers (Español)",
  "url": "https://wiki.archlinux.org/title/Comparison_of_tiling_window_managers_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Este artículo provee una comparación insesgada de los más populares gestores de ventanas de mosaico (a diferencia de gestores de ventanas flotantes).\n\n"
    },
    {
      "title": "Tabla de comparación",
      "level": 2,
      "content": "La siguiente tabla lista los más populares gestores de ventanas de mosaico junto con características notables, dándole a los lectores una rápida sinopsis.\n\nTable content:\nGestor de ventanas | Escrito en | Configurado con | Estilo de gestión | Soporte de la bandeja de sistema | Recarga sobre la marcha | Barras de información | Composición | Disposiciones por defecto | Uso de pixel | Control externo | Librería | Comportamiento de múltiples (n) monitores | Obediencia a ICCCM/EWMH | Mantenimiento\nAwesome | C | Lua | Dinámico | Preconstruido | Sí | Preconstruido, imágenes y texto | Externa | max, nh-stack (e invertido), nv-stack (e invertido), free | Bordes variables, títulos h-tab opcionales | dbus (si habilitado) | XCB | n-etiquetas (espacios de trabajo). 9 por defecto están habilitadas. Ejemplo | Sí | Activo\nbspwm | C | Cualquiera | Híbrido | Ninguno | Sí | Puede escribir el estado interno a una tubería | Externa | v-split, h-split | Bordes variables | via bspc | XCB | Monitores mantienen escritorios | Sí | Activo\ndwm | C | C (recompilar) | Dinámico | Parches opcionales | Opcional | Preconstruido, lee del nombre de la ventana raíz | Externa | v-stack, max |  | via dwmfifo | Xlib | n regiones, 9 espacios de trabajo fijos a cada region | No | Activo\nFrankenWM | C | C (recompilar) | Dinámico | Ninguno | No | No, imprime información a salida estándar, lo que puede ser fácilmente parseado y mostrado por un monitor o panel externo (dzen2, conky, etc) | Externa | v-stack (e invertido) h-stack (e invertido), v/h-stack dual, grid, fibonacci (vh-stack), rows, columns, max, free | Bordes variables |  | XCB |  | No | Activo\nherbstluftwm | C++ | Texto | Manual | Ninguno | Sí |  |  | rows, columns | bordes 1-pix | comandos via herbstclient | Xlib | n regiones, 9 espacios de trabajo visibles en cualquier región |  | Activo\ni3 | C | Texto | Manual | i3bar | Sí (Disposición es preservada) | texto entubado a i3bar (se puede usar i3status/conky y otros) | Externa | tree, v-split, h-split, stacked, tabbed, max, puede ser anidado infinitamente | Ninguno, 1-pix or 2-pix, barras de título opcionales, puede ocultar orillas de bordes | comandos via ipc (o i3-msg, que usan ipc) | XCB | n regiones | Sí | Activo\nLeftWM | Rust | RON (ajustes de usuario) / Cualquiera (temas) | Dinámico | Ninguno | Sí | Sí, muchas opciones mediante el sistema de temas | Externa | v-stack, columns, rows | Variable basado en el tema | soporta _NET_ACTIVE_WINDOW y enviar comandos a una tubería nombrada | Xlib | Espacios de trabajo y monitores no están atados. Muchos espacios de trabajo por monitor o muchos monitores por espacio de trabajo | Sí | Activo\nNotion | C, Lua | Lua, compatible configs de Ion3 | Manual | trayion, stalonetray | Sí | configurable | ? | h-tab, max | Bordes y barras de título/pestañas configurables | EWMH, scripts de Lua arbitrarios que tienen acceso a una extensa API interna | Xlib | n espacios de trabajo en cada monitor. Soporta cambios de topología en la marcha |  | Activo\nqtile | Python | Python | Dinámico | Sí | Sí | Sí | Externa | tree, v-split, h-split, stacked, tabbed, max | Sin borders, pero personalizable | Ganchos, modo servidor | XCB |  |  | Activo\nRatpoison | C | Texto | Manual | Ninguno | Sí | Sí | Externa | max |  |  |  |  | No | Activo\nSnapwm | C | Texto recargable | Dinámico | Ninguno | Sí | Preconstruido, lee del nombre de la ventana raíz | Externa | nVertical, Fullscreen, nHorizontal, Grid, Center Stacking | Bordes variables, sin títulos |  | Xlib | Número de escritorios distribuido uniformemente entre monitores |  | Activo\nSpectrwm | C | Texto | Dinámico | Ninguno | Sí | Preconstruido, lee de un script de usuario | No | nv-stack, nh-stack, max | bordes 1-pix, sin títulos |  | XCB | n regiones, 10 espacios de trabajo visibles en cada región | No | Activo\nStumpwm | Lisp | Lisp | Manual | Ninguno | Sí | Sí | No |  |  |  | Xlib |  | No | Activo\nxmonad | Haskell | Haskell | Dinámico | Ninguno | Sí | No | Sí, con xmonad-contrib y un gestor externo | nv-stack, nh-stack, max | Bordes variables, sin títulos | via XMonad-Hooks-ServerMode | Xlib | n regiones, 9 espacios de trabajo visibles en cada región | Sí / ? | Activo\nGestor de ventanas | Escrito en | Configurado con | Estilo de gestión | Soporte de la bandeja de sistema | Recarga sobre la marcha | Barras de información | Composición | Disposiciones por defecto | Uso de pixel | Control externo | Librería | Comportamiento de múltiples (n) monitores | Obediencia a ICCCM/EWMH | Mantenimiento\n\n"
    },
    {
      "title": "Estilo de gestión",
      "level": 3,
      "content": "Gestión dinámica enfatiza la gestión automática de disposiciones de ventanas para velocidad y simplicidad. Gestión manual enfatiza el ajuste manual de la disposición y el tamaño con potencialmente un control más preciso, al costo de un mayor tiempo gastado moviendo y ajustando el tamaño de ventanas.\n\n"
    },
    {
      "title": "Disposiciones",
      "level": 3,
      "content": "En varios gestores de ventanas de mosaico aparecen un gran número de disposiciones comunes, aunque la terminología varía levemente.\n\n- max: una ventana mostrada en pantalla completa (con o sin una barra de estado, título y bordes). También conocido como: monocle (dwm, monsterwm).\n- h-stack: Área maestra en la mitad superior, otras ventanas se apilan horizontalmente en la mitad inferior. El área maestra puede ser redimensionable. Puede ser invertida de arriba a abajo (wmfs). También conocido como: bottom stack (dwm), bstack(monsterwm).\n- v-stack: Área maestra en la mitad derecha, otras ventanas se apilan verticalmente en la mitad izquierda. El área maestra puede ser redimensionable. Puede ser invertida de izquierda a derecha (wmfs). También conocido como: tile (dwm, monsterwm).\n- nh-stack: h-stack permitiendo >=1 ventanas en área maestra. También conocido como: nbstack (dwm)\n- nv-stack: v-stack permitiendo >=1 ventanas en área maestra. También conocido como: ntile (dwm)\n- mirror-h: nh-stack con pilas sobre y debajo del área maestra\n- mirror-v: nv-stack con pilas a la izquierda y derecha del área maestra\n- h-tab: una ventana mostrada en pantalla completa con todos los títulos de ventanas mostrados horizontalmente (como pestañas de navegador)\n- v-tab: una ventana mostrada en pantalla completa con todos los títulos de ventanas mostrados verticalmente. También conocido como: stack (wmii).\n- h-split: una tecla divide la ventana actual horizontalmente creando espacio para otra\n- v-split: una tecla divide la ventana actual verticalmente creando espacio para otra\n- columns: estilo de disposición manual lo que trata a ventanas como perteneciendo a columnas verticales\n- rows: estilo de disposición manual lo que trata a ventanas como perteneciendo a columnas horizontales\n- grid: posiciones de ventanas y tamaños basados en una grid NxM regular. Puede ser automático (como en wmfs, monsterwm) o manual (como en Subtle).\n\n"
    },
    {
      "title": "Atajos de teclado",
      "level": 3,
      "content": "Gestores de ventanas de mosaico son usualmente diseñados para ser usados solamente con el teclado o con el teclado y el ratón. Esto es por velocidad (alcanzar y mover el ratón es lento) y facilidad de uso. Atajos de teclado sensatos son cruciales para hacer un flujo de trabajo rápido y eficiente. Algunos ajustes son mejores que otros, pero generalmente las teclas pueden ser revinculadas como el usuario desee.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- List of tiling Wayland compositors\n- Comparison of extensible window managers compara gestores de ventanas \"extensibles\" con scripting, como xmonad y Sawfish.\n\n"
    }
  ]
}