{
  "title": "Comparison of tiling window managers (Italiano)",
  "url": "https://wiki.archlinux.org/title/Comparison_of_tiling_window_managers_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Questo articolo fornisce un paragone imparziale dei gestori delle finestre affiancati più popolari (al contrario dei gestori delle finestre fluttuanti).\n\n"
    },
    {
      "title": "Tabella di paragone",
      "level": 2,
      "content": "La tabella seguente elenca i gestori delle finestre affiancati più popolari assieme alle funzionalità più prominenti, offrendo ai lettori una veloce panoramica.\n\nTable content:\nGestore delle Finestre | Scritto in | Configurato con | Stile di gestione | Supporto del vassoio di sistema | Ri-caricamento al volo | Barre informative | Compositing | Piani predefiniti | Utilizzo dei pixel | Controllo esterno | Libreria | Comportamento con schermi multipli (n) | Aderente a ICCCM/EWMH | Manutenzione\nAwesome | C | Lua | Dinamico | Incorporato | Sì | Incorporato, immagini e testo | Esterno | massimo, nh-stack (ed inverti), nv-stack (ed inverti), libero | Bordi variabili, titoli h-tab opzionali | dbus (se abilitato) | XCB | n-tags (aree di lavoro). 9 sono abilitati per pre-impostazione. Esempio | Sì | Attivo\nbspwm | C | Qualsiasi | Ibrido | Nessuno | Sì | Può scrivere lo stato interno ad un FIFO | Esterno | v-split, h-split | Bordi variabili | via bspc | XCB | Gli Schermi posseggono i Desktop | Sì | Attivo\ndwm | C | C (ricompilazione) | Dinamico | Miglioria opzionale | Opzionale | Incorporate, legge dal nome della finestra radice | Esterno | v-stack, massimo |  | via dwmfifo | Xlib | n regioni, 9 aree di lavoro fissate ad ogni regione | No | Attivo\nechinus | C | Testo | Dinamico | Nessuno | Sì | ouricoAUR | Esterno | v-stack, b-stack, massimo | Bordi variabili, titoli opzionali |  | Xlib |  | Sì | Abbandonato\neuclid-wm | C | Testo | Ibrido | Nessuno | Sì | Esterno (dzen) |  | linee, colonne | Bordi di 1-pix |  | Xlib |  |  | Dormiente\nFrankenWM | C | C (ricompilazione) | Dinamico | Nessuno | No | No, invia informazioni a stdout, che possono essere facilmente processate e mostrate da uno schermo o da un pannello esterni (dzen2, conky, etc) | Esterno | v-stack (ed inverti), h-stack (ed inverti), dual-v/h-stack, griglia, fibonacci (vh-stack), linee, colonne, massimo, libero | Bordi variabili |  | XCB |  | No | Attivo\nherbstluftwm | C++ | Testo | Manuale | Nessuno | Sì |  |  | linee, colonne | Bordi di 1-pix | comandi via herbstclient | Xlib | n regioni, 9 aree di lavoro visibili in qualsiasi regione |  | Attivo\ni3 | C | Testo | Manuale | i3bar | Sì (il Piano è conservato) | testo collegato a i3bar (i3status/conky ed altri possono essre utilizzati) | Esterno | rami, v-split, h-split, impilato, strisce di tab, massimo, può essere inserito infinitamente | Nessuno, 1-pix o 2-pix, barre del titolo opzionali, può nascondere i bordi dei limiti | comandi via ipc (o i3-msg, che utilizza ipc) | XCB | n regioni | Sì | Attivo\nLeftWM | Rust | toml (configurazioni dell'utente) / Qualsiasi (temi) | Dinamico | Nessuno | Sì | Sì, molte opzioni tramite il sistema dei temi | Esterno | v-stack, colonne, linee | Varia basato sul tema | supporta _NET_ACTIVE_WINDOW e inviare comandi ad un pipe con nome | Xlib | Le aree di lavoro e gli schermi non sono legati. Molte aree di lavoro per schermo o molti schermi per area di lavoro | Sì | Attivo\nNotion | C, Lua | Lua, compatibile con le configurazioni di Ion3 | Manuale | trayion, stalonetray | Sì | configurabile | ? | h-tab, massimo | Bordi configurabili e barre del titolo/tabs | EWMH, script Lua arbitrari che possono accedere alla API interna ricca | Xlib | n aree di lavoro su ogni schermo. Supporta modifiche alla topologia fatte al volo |  | Attivo\nqtile | Python | Python | Dinamico | SÌ | SÌ | SÌ | Esterno | rami, v-split, h-split, stacked, strisce di tab, massimo | Nessun bordo, comunque personalizzabile | Ganci, modalità Server | XCB |  |  | Attivo\nRatpoison | C | Testo | Manuale | Nessuno | SÌ | SÌ | Esterno | massimo |  |  |  |  | No | Attivo\nSnapwm | C | Testo ricaricabile | Dinamico | Nessuno | SÌ | Incorporate, legge dal nome della finestra radice | Esterno | nVertical, Schermo intero, nHorizontal, Griglia, Centro Impilato | Bordi variabili, nessun titolo |  | Xlib | Il numero dei desktop è distribuito equamente tra gli schermi |  | Attivo\nSpectrwm | C | Testo | Dinamico | Nessuno | SÌ | Incorporate, legge dagli script dell'utente | No | nv-stack, nh-stack, massimo | Bordi 1-pix, nessun titolo |  | XCB | n regioni, 10 aree di lavoro visibili in qualsiasi regione | No | Attivo\nStumpwm | Lisp | Lisp | Manuale | Nessuno | SÌ | SÌ | No |  |  |  | Xlib |  | No | Attivo\nWingo | Go | Testo | Dinamico | Nessuno | SÌ | No | Esterno | fluttuante, nv-stack, nh-stack, massimo | barre del titolo nel fluttuante, bordi stretti nell'affiancato | via wingo-cmd o socket di UNIX in qualsiasi linguaggio di programmazione | X Go Binding | n regioni, aree di lavoro visibili in qualsiasi regione | SÌ | Dormiente\nxmonad | Haskell | Haskell | Dinamico | Nessuno | SÌ | No | Sì, con xmonad-contrib ed un gestore esterno | nv-stack, nh-stack, massimo | Bordi variabili, nessun titolo | via XMonad-Hooks-ServerMode | Xlib | n regioni, 9 aree di lavoro visibili in qualsiasi regione | SÌ / ? | Attivo\nGestore delle Finestre | Scritto in | Configurato con | Stile di gestione | Supporto del vassoio di sistema | Ri-caricamento al volo | Barre informative | Compositing | Piani predefiniti | Utilizzo dei pixel | Controllo esterno | Libreria | Comportamento con schermi multipli (n) | Aderente a ICCCM/EWMH | Manutenzione\n\n"
    },
    {
      "title": "Stile di gestione",
      "level": 3,
      "content": "La gestione dinamica enfatizza, per velocità e semplicità, quella automatica dei piani delle finestre. La gestione manuale enfatizza la regolazione manuale del piano e della grandezza, potenzialmente con un controllo più preciso, al costo di maggiore tempo speso muovendo e ridimensionando le finestre.\n\n"
    },
    {
      "title": "Piani",
      "level": 3,
      "content": "Un buon numero di tipi di piano comuni appaiono in diversi gestori delle finestre affiancati, tuttavia la terminologia varia un pò.\n\n- massimo: una finestra mostrata a schermo intero (con o senza barra di stato, titolo e bordi). In altre parole: monocolo (dwm, monsterwm).\n- h-stack: area principale nella metà superiore, le altre finestre si impilano orizzontalmente nella metà inferiore. L'area principale può essere ridimensionata. Può venire invertita sopra-sotto (wmfs). In altre parole: pila inferiore (dwm), bstack (mosterwm).\n- v-stack: area principale nella metà sinistra, le altre finestre si impilano verticalmente nella metà destra. L'area principale può essere ridimensionata. Può venire invertita sinistra-destra (wmfs). In altre parole: piastrella (dwm, monsterwm).\n- nh-stack: h-stack che permette >=1 finestre nell'area principale. In altre parole: nbstack (dwm)\n- nv-stack: v-stack che permette >=1 finestre nell'area principale. In altre parole: ntile (dwm)\n- mirror-h: nh-stack con pile sopra e sotto l'area principale\n- mirror-v: nv-stack con pile alla destra ed alla sinistra dell'area principale\n- h-tab: una finestra mostrata a schermo intero con tutti i titoli delle finestre visualizzati orizzontalmente (come le tab di un navigatore Web)\n- v-tab: una finestra mostrata a schermo intero con tutti i titoli delle finestre visualizzati verticalmente. In altre parole: pila (wmii).\n- h-split: un'associazione di tasti separa la finestra corrente orizzontalmente, facendo spazio per un'altra\n- v-split: un'associazione di tasti separa la finestra corrente verticalmente, facendo spazio per un'altra\n- colonne: stile del piano manuale che considera le finestre come appartenenti a colonne verticali\n- linee: stile del piano manuale che considera le finestre come appartenenti a linee orizzontali\n- griglia: le posizioni e le grandezze delle finestre basate su una griglia NxM regolare. Può essere automatico (come wmfs, monsterwm) o manuale (come Subtle).\n\n"
    },
    {
      "title": "Associazioni di tasti",
      "level": 3,
      "content": "Di solito, i gestori delle finestre affiancati sono progettati per essere utilizzati interamente con la tastiera oppure con tastiera e mouse. Ciò è per velocità (raggiungere e muovere un mouse è lento) e facilità d'uso. Delle associazioni di tasti sensate sono cruciali per rendere il flusso di lavoro veloce ed efficente. Alcune selezioni predefinite sono meglio di altre, ma generalmente i tasti possono essere ri-associati a discrezione dell'utente.\n\n"
    },
    {
      "title": "Fonti esterne",
      "level": 2,
      "content": "- Paragone dei gestori delle finestre estensibili compara gestori delle finestre \"estensibili\" per mezzo di script, come xmonad e Sawfish.\n\n"
    }
  ]
}