{
  "title": "Compilações reproduzíveis",
  "url": "https://wiki.archlinux.org/title/Compila%C3%A7%C3%B5es_reproduz%C3%ADveis",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O Arch Linux está atualmente trabalhando para tornar todos os pacotes reproduzíveis. Isso permite que usuários e pesquisadores verifiquem os pacotes distribuídos do Arch Linux. Para a definição exata de compilações reproduzíveis e seus benefícios, dê uma olhada no site do projeto.\n\n"
    },
    {
      "title": "Repositório vs. recompilação",
      "level": 3,
      "content": "Uma instância experimental rebuilderd foi configurada em nossa própria infraestrutura com uma página de status. O Rebuilderd recompila nossos pacotes de repositório e verifica se eles são idênticos bit a bit. Se eles não forem reproduzíveis, há um bug no conjunto de ferramentas, o pacote não é reproduzível ou o pacote não foi construído corretamente.\n\nUma lista de problemas conhecidos está localizada em /Status.\n\n"
    },
    {
      "title": "Recompilação vs. outra recompilação com variações",
      "level": 3,
      "content": "O projeto Reproducible Builds recompila pacotes do Arch Linux e os compara com outra recompilação em um ambiente diferente. O status do pacote e variações do ambiente estão listadas na página dedicada do Arch Linux.\n\n"
    },
    {
      "title": "Ferramental",
      "level": 3,
      "content": "Ajude a corrigir bugs e adicionar recursos ao repro.\n\n"
    },
    {
      "title": "Executando uma instância de Rebuilder",
      "level": 3,
      "content": "A Configuração do rebuilderd para compilar pacotes do Arch Linux ajuda a verificar de forma independente os pacotes dos repositórios.\n\n"
    },
    {
      "title": "Verificando pacotes com repro e encontrando problemas",
      "level": 3,
      "content": "Uma ótima maneira de ajudar é encontrar um pacote não reproduzível e descobrir como ele pode ser reproduzido.\n\n- Baixe um pacote Arch Linux ou obtenha um do Arch Linux Archive\n- Execute repro no pacote baixado ou em um pacote do cache do pacman. Idealmente com repro -d para obter a saída do difoscope. Por exemplo, repro -d /var/cache/pacman/pkg/curl-7.73.0-1-x86_64.pkg.tar.zst\n- Investigue se é um problema com o empacotamento do Arch Linux ou do upstream, problemas podem ser adicionados na página de status. Mais informações podem ser encontradas no site Reproducible Builds[link inativo 2022-09-23 ⓘ].\n\n"
    },
    {
      "title": "Trabalhar em problemas na infraestrutura de tests.reproducible-builds.org",
      "level": 3,
      "content": "Os usuários do Arch podem ajudar a contribuir para os problemas do Reproducible Build consultando o ambiente de reprodução contínua. Existem vários problemas que podem ser resolvidos:\n\n- FTBS (falha ao compilar a partir da fonte): reproduza a falha de compilação localmente e crie um relatório de bug se o pacote não puder ser compilado a partir de um chroot limpo (extra-x86_64-build ou multilib-build).\n- Falha ao baixar fontes, reproduzir o problema (makepkg -o -d) e criar um relatório de bug no rastreador de erros do Arch.\n- Falha ao reproduzir. Localmente você pode reproduzir pacotes usando reprotest. Observe que nem todas as variações podem ser usadas. Para testes simples relacionados ao tempo: $ reprotest --variations '+time' 'sudo extra-x86_64-build' '*.pkg.tar.zst'\n\n```\n$ reprotest --variations '+time' 'sudo extra-x86_64-build' '*.pkg.tar.zst'\n```\n\nPode haver várias razões para um pacote não ser reproduzível, mas antes de investigar dê uma olhada no repositório upstream ou o status reprodutível no Debian.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\n- Falha ao executar testes, essas falhas estão fortemente no ambiente de teste. Provavelmente devido a LANG=C estar definido e o Arch não oferecer suporte a LANG=C.UTF-8.\n\nSe você estiver interessado no código que executa o ambiente de reprodução contínua, o primeiro código de compilação começa aqui em salsa\n\n"
    },
    {
      "title": "Verificação de GPG",
      "level": 3,
      "content": "Existe um possível cenário de reconstrução em que as chaves GPG não serão verificadas, pois o empacotador foi removido do chaveiro ou revogado, pois usamos o chaveiro mais recente e um pacote no arquivo que precisamos ser assinado por uma chave revogada que não podemos verificar e a compilação falhará.\n\n"
    },
    {
      "title": "Contato",
      "level": 2,
      "content": "- #archlinux-reproducible — Canal principal para o progresso de compilações reproduzíveis no Arch Linux\n\n"
    }
  ]
}