{
  "title": "Conky (Русский)",
  "url": "https://wiki.archlinux.org/title/Conky_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Conky/Tips and tricks\n- Lm_sensors\n- Hddtemp\n\nNote: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nConky is a system monitor software for the X Window System (Wayland support is a work in progress). It is available for GNU/Linux and FreeBSD. It is free software released under the terms of the GPL license. Conky is able to monitor many system variables including CPU, memory, swap, disk space, temperature, top, upload, download, system messages, and much more. It is extremely configurable, however, the configuration can be a little hard to understand. Conky is a fork of torsmo.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the conky package. There are also alternative packages you can install with extra compile options enabled:\n\n- conky-cliAUR - conky without X11 dependencies\n- conky-lua-nvAUR - with both Lua and Nvidia support\n\nSome built in variables in conky require additional packages to be installed in order to be utilized, for example mpd for music. As for hard drive temperature, see lm_sensors#S.M.A.R.T. drive temperature. From Conky's point of view, drivetemp can be used as a replacement for the hddtemp package and variable by using its hwmon variable.\n\nAdditional utility:\n\n- Conky Manager — Theme manager for Conky widgets. It provides options to start/stop, browse and edit Conky themes installed on the system.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The configuration file can be located in one of the following paths (the first one found will be used):\n\n- ~/.config/conky/conky.conf\n- ~/.conkyrc\n- /etc/conky/conky.conf\n\nIf none of these files exist, conky will use the default built-in configuration, which you can print out with:\n\n```\n$ conky --print-config\n```\n\nFurthermore, you can create a default configuration file with the following command:\n\n```\n$ mkdir -p ~/.config/conky && conky --print-config > ~/.config/conky/conky.conf\n```\n\nIf you prefer to have a configuration dotfile in home, you can create a file elsewhere and tell conky to use it using arguments.\n\nFor example to tell conky to use a dotfile located in the user's home directory:\n\n```\n$ conky --config=~/.conky.conf\n```\n\nAdditional example configuration files are available in the upstream wiki article.\n\nWhen editing your configuration file while conky is running, conky will update with the new changes every time you write to the file.\n\nSee the SourceForge page for a complete reference for all Conky objects/variables; these are also listed in conky(1).\n\n"
    },
    {
      "title": "Dual screen",
      "level": 3,
      "content": "When using a dual screen configuration, you will need to play with a few options to place your conky window where you want it on the desktop.\n\nBy adjusting gap_x, let us say you are running a 1680x1050 pixels resolution and you want the window on middle top of your left monitor, you will use:\n\n```\nalignment = 'top_left',\ngap_x = 840,\n```\n\nThe alignment option is self-explanatory, the gap_X is the distance, in pixels, from the left border of your screen.\n\nxinerama_head is an alternative useful option, the following will place the conky window at the top right of the second screen:\n\n```\nalignment = 'top_right',\nxinerama_head = 2,\n```\n\n"
    },
    {
      "title": "Fonts",
      "level": 2,
      "content": "For displaying Unicode pictures and emoji with conky you will need a font that supports this and then configure conky to use the font with the Unicode you want to display. For example:\n\n```\n${font Symbola:size=48}☺${font}\n```\n\n"
    },
    {
      "title": "Symbolic fonts",
      "level": 3,
      "content": "Symbolic fonts are also very commonly used in more decorated conky configurations, some of the more popular ones include;\n\n- otf-font-awesome\n- ttf-pizzadude-bulletsAUR - PizzaDude Bullet's font\n- ttf-weather-iconsAUR - Erik flowers weather icon font with 222 glyphs\n\n"
    },
    {
      "title": "Autostart",
      "level": 2,
      "content": "There are several different ways to start Conky automatically, as outlined in Autostarting.\n\nConky has a configuration setting which will tell it to fork to the background. This may be desirable for some autostarting setups.\n\nIn conky.conf:\n\n```\nconky.config = {\n    background = true,\n}\n```\n\nIf you use a graphical desktop environment and wish to use a conky.desktop file for autostarting, use the following:\n\n```\n~/.config/autostart/conky.desktop\n```\n\n```\n[Desktop Entry]\nType=Application\nName=conky\nExec=conky --daemonize --pause=5\nStartupNotify=false\nTerminal=false\n```\n\nThe pause=5 parameter delays conky's drawing for 5 seconds at startup to make sure that the desktop had time to load and is up.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "These are known issues people have with conky and their solutions.\n\n"
    },
    {
      "title": "Conky starts and does not display anything on the screen",
      "level": 3,
      "content": "First check for syntax errors in your configuration file's text variable. Then double check that your user has permission to run every command inside your configuration file and that all needed packages are installed.\n\n"
    },
    {
      "title": "Do not minimize on Show Desktop",
      "level": 3,
      "content": "Using Compiz: If the 'Show Desktop' button or key-binding minimizes Conky along with all other windows, start the Compiz configuration settings manager, go to \"General Options\" and uncheck the \"Hide Skip Taskbar Windows\" option.\n\nUsing XFCE: If clicking the desktop hides Conky, add own_window_hints = 'undecorated,below,sticky,skip_taskbar,skip_pager', inside conky.conf.\n\nFor the other Desktop environments/WM: Try editing conky.conf and adding/changing the following line:\n\n```\nown_window_type = 'override',\n```\n\nor\n\n```\nown_window_type = 'desktop',\n```\n\nRefer to conky(1) man page for the exact differences. But the latter option enables you to snap windows to conkys border using resize key-binds in e.g. Openbox, which the first one does not.\n\n"
    },
    {
      "title": "Integrate with GNOME Shell",
      "level": 3,
      "content": "Some have experienced problems with conky showing up under GNOME.\n\nAdd these lines to conky.conf:\n\n```\nown_window = true,\nown_window_type = 'desktop',\n```\n\n"
    },
    {
      "title": "Prevent flickering",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nConky needs Double Buffer Extension (DBE) support from the X server to prevent flickering because it cannot update the window fast enough without it. It can be enabled with Xorg in /etc/X11/xorg.conf with Load \"dbe\" line in \"Module\" section. The xorg.conf file has been replaced (1.8.x patch upwards) by /etc/X11/xorg.conf.d which contains the particular configuration files. DBE is loaded automatically as long as it is present within /usr/lib/xorg/modules. The list of loaded modules can be checked with grep LoadModule /var/log/Xorg.0.log.\n\nTo enable double buffering, add the double_buffer option to conky.conf:\n\n```\nconky.config = {\n     double_buffer = true,\n }\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official website\n- Official Conky variables for configuration\n- Official Conky objects\n- Conky Configs on arch forums\n- FAQ\n\n"
    }
  ]
}