{
  "title": "Conky (Français)",
  "url": "https://wiki.archlinux.org/title/Conky_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Conky/Tips_and_tricks\n- Lm_sensors\n- Hddtemp (Français)\n\nConky est un moniteur système pour le système X Window. Il est disponible pour GNU/Linux et FreeBSD. C'est un logiciel libre publié sous les termes de la licence GPL. Conky est capable de surveiller de nombreuses variables système, notamment le processeur, la mémoire, le swap, l'espace disque, la température, le top, le téléchargement, les messages système, et bien plus encore. Il est extrêmement configurable, cependant, la configuration peut être un peu difficile à comprendre. Conky est un fork de torsmo.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet conky. Il existe également des paquets alternatifs que vous pouvez installer depuis AUR avec des options de compilation supplémentaires activées :\n\n- conky-cliAUR - conky sans dépendances à X11\n- conky-luaAUR[broken link: package not found] - avec prise en charge de Lua\n- conky-lua-nvAUR - avec prise en charge de Lua et de Nvidia\n\nCertaines variables intégrées dans conky nécessitent l'installation de paquets supplémentaires pour pouvoir être utilisées, par exemple Hddtemp pour la température du disque dur et mpd pour la musique.\n\nUtilitaires supplémentaires :\n\n- Conky Manager — Le gestionnaire de thèmes pour les widgets Conky. Il fournit des options pour démarrer/arrêter, parcourir et modifier les thèmes Conky installés sur le système.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Par défaut, conky utilise un fichier de configuration situé à ~/.config/conky/conky.conf. Vous pouvez imprimer un exemple de configuration avec :\n\n```\n$ conky --print-config\n```\n\nDe plus, vous pouvez créer un fichier de configuration par défaut avec la commande suivante :\n\n```\n$ mkdir -p ~/.config/conky && conky --print-config > ~/.config/conky/conky.conf\n```\n\nSi vous préférez avoir un fichier de configuration «dotfile» dans votre répertoire utilisateur, vous pouvez créer un fichier ailleurs et dire à conky de l'utiliser en utilisant des arguments.\n\nPar exemple, pour dire à conky d'utiliser un fichier point situé dans le répertoire personnel de l'utilisateur :\n\n```\n$ conky --config=~/.conky.conf\n```\n\nDes exemples supplémentaires de fichiers de configuration sont disponibles dans l'article wiki en amont.\n\nSi vous modifiez votre fichier de configuration pendant que conky est en cours d'exécution, conky sera mis à jour avec les nouvelles modifications à chaque fois que vous écrirez dans le fichier.\n\nConsultez la page SourceForge page pour une référence complète de tous les objets/variables de Conky ; ceux-ci sont également listés dans conky(1).\n\n"
    },
    {
      "title": "Double écran",
      "level": 3,
      "content": "Lorsque vous utilisez une configuration à double écran, vous devrez jouer avec quelques options pour placer votre fenêtre conky où vous le souhaitez sur le bureau.\n\nEn ajustant gap_x, disons que vous utilisez une résolution de 1680x1050 pixels et que vous voulez que la fenêtre se trouve au milieu en haut de votre moniteur gauche, vous utiliserez :\n\n```\nalignment = 'top_left',\ngap_x = 840,\n```\n\nL'option alignment est explicite, l'option gap_X est la distance, en pixels, du bord gauche de votre écran.\n\nL'option xinerama_head est une autre option utile, la suivante placera la fenêtre conky en haut à droite du deuxième écran :\n\n```\nalignment = 'top_right',\nxinerama_head = 2,\n```\n\n"
    },
    {
      "title": "Modification de la syntaxe du fichier de configuration",
      "level": 3,
      "content": "Depuis Conky 1.10, les fichiers de configuration ont été écrits avec une nouvelle syntaxe Lua, comme ceci :\n\n```\nconky.config = {\n   -- Les commentaires commencent par un double tiret\n   bool_value = true,\n   string_value = 'foo',\n   int_value = 42,\n }\n conky.text = [[\n $variable\n ${variable évaluée}\n ]]\n```\n\nCertains exemples ci-dessous peuvent encore utiliser l'ancienne syntaxe, qui ressemble à ceci :\n\n```\nbool_value yes\n valeur_chaîne 'foo\n int_value 42\n```\n\nUn script Lua est disponible pour convertir l'ancienne syntaxe en la nouvelle syntaxe Lua sur le dépôt GitHub.\n\n"
    },
    {
      "title": "Polices",
      "level": 2,
      "content": "Pour afficher des images et des emoji Unicode avec conky, vous aurez besoin d'une police qui prend en charge cette fonction, puis vous devrez configurer conky pour qu'il utilise la police avec l'Unicode que vous souhaitez afficher. Par exemple :\n\n```\n${font Symbola:size=48}☺${font}\n```\n\n"
    },
    {
      "title": "Polices de symboles",
      "level": 3,
      "content": "Les polices de symboles sont aussi très couramment utilisées dans des configurations de conky plus décorées, certaines des plus populaires incluent ;\n\n- otf-font-awesome\n- ttf-pizzadude-bulletsAUR - La police de PizzaDude Bullet\n- ttf-weather-iconsAUR - Police d'Erik flowers avec des icônes de la météo avec 222 glyphes\n\n"
    },
    {
      "title": "Démarrage automatique",
      "level": 2,
      "content": "Il y a plusieurs façons différentes de démarrer Conky automatiquement, comme indiqué dans \"Autostarting\". Choisissez celle qui fonctionne le mieux pour votre gestionnaire de fenêtre/environnement de bureau.\n\nConky a un paramètre de configuration qui lui indique de passer en arrière-plan. Cela peut être souhaitable pour certaines configurations de démarrage automatique.\n\nDans conky.conf :\n\n```\nconky.config = {\n    background = true,\n}\n```\n\nSi vous utilisez un environnement de bureau graphique et souhaitez utiliser un fichier conky.desktop pour le démarrage automatique, utilisez ce qui suit :\n\n```\n~/.config/autostart/conky.desktop\n```\n\n```\n[Desktop Entry]\nType=Application\nName=conky\nExec=conky --daemonize --pause=5\nStartupNotify=false\nTerminal=false\n```\n\nLe paramètre pause=5 retarde le dessin de conky de 5 secondes au démarrage pour s'assurer que le bureau a eu le temps de se charger et est en place.\n\n"
    },
    {
      "title": "Dépannage",
      "level": 2,
      "content": "Voici les problèmes connus que les gens rencontrent avec Conky et leurs solutions.\n\n"
    },
    {
      "title": "Conky démarre et n'affiche rien à l'écran",
      "level": 3,
      "content": "Vérifiez d'abord s'il y a des erreurs de syntaxe dans la variable texte de votre fichier de configuration. Vérifiez ensuite que votre utilisateur a la permission d'exécuter toutes les commandes de votre fichier de configuration et que tous les paquets nécessaires sont installés.\n\n"
    },
    {
      "title": "Transparence",
      "level": 3,
      "content": "Conky prend en charge deux types de transparence différents. La pseudo-transparence et la transparence réelle qui nécessite l'installation et l'exécution d'un composite manager. Si vous activez la transparence réelle et que vous n'avez pas de gestionnaire de composite en cours d'exécution, votre conky ne sera pas transparent en alpha avec la transparence activée pour les polices et les images ainsi que l'arrière-plan.\n\n"
    },
    {
      "title": "Pseudo-transparence",
      "level": 4,
      "content": "La pseudo-transparence est activée par défaut dans conky. La pseudo-transparence fonctionne en copiant l'image d'arrière-plan de la fenêtre racine et en utilisant la section correspondante comme arrière-plan pour conky. Certains gestionnaires de fenêtres définissent le fond d'écran à un niveau supérieur à celui de la fenêtre racine, ce qui peut faire que conky ait un fond gris. Pour résoudre ce problème, vous devez le régler manuellement. Un exemple avec feh est :\n\nDans ~/.xinitrc :\n\n```\nsleep 1 && feh --bg-center ~/background.png &\n```\n\n"
    },
    {
      "title": "Activer la transparence réelle",
      "level": 4,
      "content": "Pour activer la transparence réelle, vous devez avoir un composite manager en cours d'exécution et les lignes suivantes ajoutées à .conkyrc dans le tableau conky.config :\n\n```\nconky.config = {\n    own_window = true,\n    own_window_transparent = true,\n    own_window_argb_visual = true,\n    own_window_type = 'desktop',\n }\n```\n\nSi le type de fenêtre \"desktop\" ne fonctionne pas, essayez de le changer en normal. Si cela ne fonctionne pas, essayez les autres options : dock, panel, ou override.\n\n"
    },
    {
      "title": "Semi-transparence",
      "level": 4,
      "content": "Pour obtenir une semi-transparence en mode de transparence réelle, la configuration suivante doit être utilisée dans le fichier de configuration de conky :\n\n```\nconky.config = {\n    own_window = true,\n    own_window_transparent = false,\n    own_window_argb_visual = true,\n    own_window_argb_value = 90,\n    own_window_type = 'desktop',\n }\n```\n\nPour réduire la transparence de la fenêtre conky, on peut augmenter la valeur de own_window_argb_value vers 255.\n\n"
    },
    {
      "title": "Ne pas minimiser lors de l'affichage du bureau",
      "level": 3,
      "content": "Avec Compiz : Si le bouton ou le raccourci clavier 'Show Desktop' minimise Conky avec toutes les autres fenêtres, démarrez le gestionnaire des paramètres de configuration de Compiz, allez dans \"Options générales\" et décochez l'option \"Hide Skip Taskbar Windows\".\n\nAvec XFCE : Si un clic sur le bureau masque Conky, ajoutez own_window_hints = 'undecorated,below,sticky,skip_taskbar,skip_pager', dans conky.conf.\n\nAvec les autres Environnements de bureau/WM : Essayez d'éditer conky.conf et d'ajouter/modifier la ligne suivante :\n\n```\nown_window_type = 'override',\n```\n\nou\n\n```\nown_window_type = 'desktop',\n```\n\nConsultez la man page de conky(1) pour les différences exactes. Mais la dernière option vous permet d'accrocher des fenêtres à la bordure de conky en utilisant des touches de redimensionnement dans Openbox, ce que la première ne permet pas.\n\n"
    },
    {
      "title": "Intégration avec GNOME Shell",
      "level": 3,
      "content": "Certains ont rencontré des problèmes pour que conky s'affiche sous GNOME.\n\nAjoutez ces lignes à conky.conf :\n\n```\nown_window = true,\nown_window_type = 'desktop',\n```\n\n"
    },
    {
      "title": "Empêcher le scintillement",
      "level": 3,
      "content": "Conky a besoin de la prise en charge de Double Buffer Extension (DBE) par le serveur X pour éviter le scintillement, car il ne peut pas mettre à jour la fenêtre assez rapidement sans cela. Il peut être activé avec Xorg dans /etc/X11/xorg.conf avec la ligne Load \"dbe\" dans la section \"Module\". Le fichier xorg.conf a été remplacé (à partir du patch 1.8.x) par /etc/X11/xorg.conf.d qui contient les fichiers de configuration particuliers. DBE est chargé automatiquement tant qu'il est présent dans /usr/lib/xorg/modules. La liste des modules chargés peut être vérifiée avec grep LoadModule /var/log/Xorg.0.log.\n\nPour activer le double buffering, ajoutez l'option double_buffer à conky.conf :\n\n```\nconky.config = {\n     double_buffer = true,\n }\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Site web officiel\n- Variables officielles de configuration de Conky.\n- Objets officiels de Conky\n- Configs Conky sur les forums arch\n- FAQ\n\n"
    }
  ]
}