{
  "title": "Console mouse support (Русский)",
  "url": "https://wiki.archlinux.org/title/Console_mouse_support_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GPM (General Purpose Mouse) — демон, позволяющий использовать мышь в виртуальных терминалах Linux.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет gpm. Для поддержки тачпада на ноутбуке вам, вероятно, понадобится дополнительно установить xf86-input-synaptics.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "С помощью опции -m определяется файл устройства мыши. Опция -t используется для указания типа мыши. Чтобы отобразить список возможных вариантов для опции -t, запустите gpm с параметром -t help:\n\n```\n# gpm -m /dev/input/mice -t help\n```\n\nДля запуска демона gpm необходимо указать некоторые опции. Их можно прописать в файле /etc/conf.d/gpm, или использовать при прямом запуске gpm. С 2016 года файл gpm.service для systemd содержит опции для USB-мышей.\n\n```\n/usr/lib/systemd/system/gpm.service\n```\n\n```\nExecStart=/usr/bin/gpm -m /dev/input/mice -t imps2\n```\n\nКонечно, это нужно изменить (желательно как принято в systemd), если используется другой тип мыши и gpm запускается как systemd-служба.\n\n- Для PS/2 мышей опции такие:\n\n```\n-m /dev/psaux -t ps2\n```\n\n- И трекпоинта IBM:\n\n```\n-m /dev/input/mice -t ps2\n```\n\nПосле настройки запустите и включите службу gpm.service.\n\nБолее подробную информацию вы можете получить на странице справочного руководства gpm (8).\n\n"
    },
    {
      "title": "QEMU или VirtualBox",
      "level": 3,
      "content": "Со стандартной мышью, которую эмулируют QEMU и VirtualBox, есть некоторые проблемы и в gpm, и в X при позиционировании и кликах. Положение курсора не синхронизировано с хостом, так что в виртуальном экране есть области, в которые трудно попасть. Клики срабатывают не там, где отображается курсор.\n\nИ QEMU, и VirtualBox позволяют решить эту проблему с помощью эмуляции USB-планшета, который имеет абсолютное позиционирование. (libvirt использует это автоматически.)\n\nОднако gpm умеет использовать виртуальную мышь только в относительном режиме, поэтому проблемы остаются. Использование других типов мышей в опции -t тоже не помогает.\n\nПакет gpm-vmAUR включает в себя старый пулл-реквест, добавляющий поддержку USB-планшетов для VirtualBox (в QEMU тоже работает) и прописывает его использование по умолчанию в gpm.service.\n\nВам может понадобиться изменить используемое event-устройство (стандартный -m /dev/input/mice не сработает). По умолчанию:\n\n```\n/etc/gpm-vm.conf\n```\n\n```\nevent=\"/dev/input/event2\"\n```\n\nВы можете определить нужный event, установив evtest и выполнив:\n\n```\n# evtest\n```\n\n```\n...\n/dev/input/event2:      QEMU QEMU USB Tablet\n...\n```\n\nЕсли нужно прописать дополнительные опции для gpm, их можно указать в опции additional_args в файле /etc/gpm-vm.conf.\n\nПосле настройки запустите и включите службу gpm.service.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Gentoo:GPM\n- consolationAUR — альтернатива, основанная на libinput\n\n"
    }
  ]
}