{
  "title": "Console fonts (Español)",
  "url": "https://wiki.archlinux.org/title/Console_fonts_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-02-22** \n\nArtículos relacionados\n\n- Consola de Linux console/Configuración de teclado\n- Screen capture#Virtual console\n- Color output in console\n- getty\n\nSegún Wikipedia:\n\nEste artículo describe los conceptos básicos de la consola de Linux y cómo configurar la visualización del tipo de letra. La configuración del teclado se describe en la subpágina Linux console/Keyboard configuration.\n\n"
    },
    {
      "title": "Implementación",
      "level": 2,
      "content": "La consola, a diferencia de la mayoría de los servicios que interactúan directamente con los usuarios, se implementa en el kernel. Esto contrasta con el software de emulación de terminal, como Xterm, que se implementa en el espacio del usuario como una aplicación normal. La consola siempre ha sido parte de los kernel de Linux liberados, pero ha sufrido cambios en su historia, especialmente la transición al uso de framebuffer y soporte para Unicode.\n\nA pesar de las muchas mejoras en la consola, su compatibilidad con versiones anteriores de hardware heredado significa que es limitada en comparación con un emulador de terminal gráfico.\n\n"
    },
    {
      "title": "Consolas virtuales",
      "level": 3,
      "content": "La consola se presenta al usuario como una serie de consolas virtuales. Estas dan la impresión de que varios terminales independientes se ejecutan simultáneamente. Cada consola virtual puede iniciar sesión con diferentes usuarios, ejecutar su propio intérprete de órdenes y tener su propia configuración de tipografía. Cada una de las consolas virtuales utiliza un dispositivo /dev/ttyX, y se puede alternar entre ellas presionando Alt+Fx (donde x es igual al número de la consola virtual, comenzando con 1). El dispositivo /dev/console se asigna automáticamente a la consola virtual activa.\n\nVéase también chvt(1), openvt(1) y deallocvt(1).\n\n"
    },
    {
      "title": "Modo texto",
      "level": 3,
      "content": "Dado que Linux originalmente comenzó como un kernel para hardware de PC, la consola se desarrolló utilizando gráficos estándar CGA/EGA/VGA de IBM, que todos los PC admitían en ese momento. Los gráficos funcionan en modo de texto VGA, que proporciona una pantalla simple de 80x25 caracteres con 16 colores. Este modo heredado es similar a las capacidades de los terminales de texto dedicados, como la serie DEC VT100. Todavía es posible arrancar en modo texto si el hardware del sistema lo admite, pero casi todas las distribuciones modernas (incluida Arch Linux) utilizan la consola framebuffer.\n\n"
    },
    {
      "title": "Consola framebuffer",
      "level": 3,
      "content": "Como Linux fue portado a otras arquitecturas que no eran de PC, se requirió una mejor solución, ya que otras arquitecturas no usaban adaptadores gráficos compatibles con VGA y era posible que no admitieran modos de texto. La consola framebuffer se implementó para proporcionar una consola estándar en todas las plataformas y, por lo tanto, presenta la misma interfaz de estilo VGA independientemente del hardware gráfico subyacente. Como tal, la consola de Linux no es un emulador de terminal, sino un terminal en sí mismo. Utiliza el tipo de terminal linux, y es ampliamente compatible con VT100.\n\n"
    },
    {
      "title": "Atajos del teclado",
      "level": 2,
      "content": "Table content:\nAtajos del teclado | Descripción\nCtrl+Alt+Del | Reinicia el equipo (especificado por el enlace simbólico /usr/lib/systemd/system/ctrl-alt-del.target)\nAlt+F1, F2, F3, ... | Alterna a la consola virtual «n» (número)\nAlt+ ← | Cambia a la consola virtual anterior\nAlt+ → | Cambia a la consola virtual siguiente\nScroll Lock | Cuando el bloqueo de desplazamiento está activado, la entrada/salida está bloqueada\nShift+PgUp/PgDown | Desplaza el búfer de la consola hacia arriba/abajo\nCtrl+c | Mata la tarea actual\nCtrl+d | Inserta un EOF (fin de archivo)\nCtrl+z | Pausa la tarea actual\n\nVéase también console_codes(4).\n\n"
    },
    {
      "title": "Tipografías",
      "level": 2,
      "content": "De forma predeterminada, la consola virtual utiliza la fuente incorporada del kernel con un conjunto de caracteres CP437,[1] pero esto se puede cambiar fácilmente.\n\nLa consola de Linux usa la codificación UTF-8 de forma predeterminada, pero debido a que se usa el framebuffer compatible con VGA estándar, la fuente tipográfica de la consola está limitada a un glifo estándar de 256 o 512. Si la fuente tipográfica tiene más de 256 glifos, la cantidad de colores se reduce de 16 a 8. Para asignar el símbolo correcto para que se muestre al valor Unicode dado, se necesita un mapa de traducción especial, a menudo llamado unimap. Hoy en día, la mayoría de las fuentes tipográficas de la consola tienen incorporado unimap; históricamente, tuvo que cargarse por separado.\n\nEl paquete kbd proporciona herramientas para cambiar el tipo de letra de la consola virtual y la asignación de fuentes tipográficas. Las fuentes tipográficas disponibles se guardan en el directorio /usr/share/kbd/consolefonts/, las que terminan en .psfu or .psfu.gz tienen un mapa de traducción Unicode incorporado.\n\nLos mapas de teclas («keymaps»), esto es la conexión entre la tecla presionada y el carácter utilizado por el ordenador, se encuentran en los subdirectorios de /usr/share/kbd/keymaps/, consulte Linux console/Keyboard configuration para obtener más detalles.\n\n"
    },
    {
      "title": "Vista previa y cambios temporales",
      "level": 3,
      "content": "```\n$ showconsolefont\n```\n\nmuestra una tabla de glifos o letras de una tipografía.\n\nsetfont cambia temporalmente la fuente tipográfica si se pasa un nombre de tipo de letra (en /usr/share/kbd/consolefonts/) como\n\n```\n$ setfont lat2-16 -m 8859-2\n```\n\nLos nombres de las fuentes tipográficas distinguen entre mayúsculas y minúsculas. Sin ningún parámetro, setfont devuelve la consola al tipo de letra predeterminado.\n\nEntonces, para tener una fuente tipográfica 8x8 pequeña, con ese tipo de letra instalado, como se ve a continuación, utilice, por ejemplo:\n\n```\n$ setfont -h8 /usr/share/kbd/consolefonts/drdos8x8.psfu.gz\n```\n\nPara tener una fuente tipográfica más grande, el tipo de letra Terminus (terminus-font) está disponible en muchos tamaños, como ter-132n que es grande.\n\n"
    },
    {
      "title": "Configuración permanente",
      "level": 3,
      "content": "La variable FONT en /etc/vconsole.conf se usa para configurar la fuente tipográfica en el arranque, de forma permanente para todas las consolas. Vea vconsole.conf(5) para más detalles.\n\nPara mostrar caracteres como Č, ž, đ, š or Ł, ę, ą, ś utilizando la fuente lat2-16.psfu.gz:\n\n```\n/etc/vconsole.conf\n```\n\n```\n...\nFONT=lat2-16\nFONT_MAP=8859-2\n```\n\nSignifica que la segunda parte de los caracteres ISO/IEC 8859 se utiliza con el tamaño 16. Puede cambiar el tamaño de fuente tipográfica utilizando otros valores (por ejemplo, lat2-08). Para las regiones determinadas por la especificación 8859, mire la Wikipedia:ISO/IEC 8859#The parts of ISO/IEC 8859.\n\nPara usar la fuente tipográfica especificada en el espacio de usuario inicial, use el hookconsolefont en /etc/mkinitcpio.conf. Vea Mkinitcpio#HOOKS para más información.\n\nSi parece que las fuentes tipográficas no cambian en el arranque, o cambian solo temporalmente, lo más probable es que se restablecieron cuando se inicializó el controlador gráfico y la consola se cambió a framebuffer. Para evitar esto, cargue su controlador gráfico antes. Consulte, por ejemplo, Kernel mode setting#Early KMS start, [3] u otras formas de configurar su framebuffer antes de aplicar /etc/vconsole.conf.\n\n"
    },
    {
      "title": "HiDPI",
      "level": 3,
      "content": "Consulte HiDPI#Linux console (tty).\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- The TTY demystified – Linus Åkesson\n\n"
    }
  ]
}