{
  "title": "Core utility (Español)",
  "url": "https://wiki.archlinux.org/title/Core_utility_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-03** \n\nArtículos relacionados\n\n- Intérprete de línea de órdenes\n- Usuarios y grupos\n- systemd\n- pacman\n- Recomendaciones generales\n\nLas utilidades principales son las herramientas básicas y fundamentales de un sistema GNU/Linux. Este artículo proporciona una visión general e incompleta de ellos, vincula su documentación y describe alternativas útiles. El alcance de este artículo incluye, pero no se limita, a GNU coreutils. La mayoría de los servicios básicos son herramientas tradicionales Unix y muchos fueron estandarizados por POSIX pero se han seguido desarrollado para proporcionar más funciones.\n\nLa mayoría de las interfaces de línea de órdenes están documentadas en las páginas del manual, las utilidades del Proyecto GNU están documentadas principalmente en los manuales de información, algunos intérpretes de línea de órdenes proporcionan una orden help para las órdenes incorporadas de la línea de órdenes. Además, la mayoría de las utilidades imprimen su uso cuando se ejecutan con el indicador --help.\n\n"
    },
    {
      "title": "Esenciales",
      "level": 2,
      "content": "La siguiente tabla lista algunas utilidades importantes las cuales los usuarios de Arch Linux deben estar familiarizados. Véase también intro(1).\n\nTable content:\nPaquete | Utilidad | Descripción | Documentación | Alternativas\nincluido en la línea de órdenes | cd | cambia de directorio | cd(1p)\nGNU coreutils | ls | lista el directorio | ls(1), info | tree, #Alternativas a ls\ncat | concatena archivos a la salida estándar | cat(1), info | tac(1), bat\nmkdir | crea un directorio | mkdir(1), info\nrmdir | elimina un directorio vacío | rmdir(1), info\nrm | elimina archivos o directorios | rm(1), info | shred\ncp | copia archivos o directorios | cp(1), info | #Alternativas a cp\nmv | mueve archivos o directorios | mv(1), info\nln | crea enlaces duros o simbólicos | ln(1), info\nchown | cambia el usuario y grupo del archivo | chown(1), info | chgrp(1)\nchmod | cambia los permisos del archivo | chmod(1), info\ndd | convierte y copia un archivo | dd(1), info\ndf | informa del espacio disponible en disco del sistema de archivo | df(1), info\nGNU tar | tar | archivador tar | tar(1), info | archivadores\nGNU less | less | paginador de terminal | less(1) | terminal pagers\nGNU findutils | find | busca archivos o directorios | find(1), info, GregsWiki | #Alternativas a find\nGNU diffutils | diff | compara archivos línea por línea | diff(1), info | #Alternativas a diff\nGNU grep | grep | imprime las línea que coinciden con un patrón | grep(1), info | #Alternativas a grep\nGNU sed | sed | editor de secuencias (stream editor) | sed(1), info, one-liners\nGNU gawk | awk | lenguaje de escaneo y procesamiento de patrones | gawk(1), info | nawk, mawkAUR\nutil-linux | dmesg | imprime o controla el búfer del anillo del kernel | dmesg(1) | systemd journal\nlsblk | lista los dispositivos de bloques | lsblk(8)\nmount | monta un sistema de archivos | mount(8)\numount | desmonta un sistema de archivos | umount(8)\nsu | substitute user | su(1) | sudo, opendoas\nkill | finaliza un proceso | kill(1) | pkill(1), killall(1)\nprocps-ng | pgrep | buscar procesos por nombre o atributos | pgrep(1) | pidof(1)\nps | muestra información sobre los procesos | ps(1) | top(1), htop\nfree | muestra la cantidad de memoria libre y utilizada | free(1)\n\n"
    },
    {
      "title": "Previniendo la pérdida de datos",
      "level": 3,
      "content": "rm, mv, cp y las redirecciones de la línea de órdenes eliminan o sobrescriben archivos sin preguntar. rm, mv, y cp son compatibles con el indicador -i para avisar al usuario antes de cada eliminación / sobreescritura. A algunos usuarios les gusta habilitar el indicador -i de forma predeterminada utilizando alias. Confiar en estas opciones de las línea de órdenes puede ser peligroso porque te acostumbra a ellas, lo que da como resultado la posible pérdida de datos cuando utiliza otro sistema o usuario que no tiene dicho indicador. La mejor forma de evitar la pérdida de datos es crear copias de seguridad.\n\n"
    },
    {
      "title": "No esenciales",
      "level": 2,
      "content": "Esta tabla enumera las utilidades principales que a menudo son útiles.\n\nTable content:\nPaquete | Utilidad | Descripción | Documentación | Alternativas\nincluidos en la línea de órdenes | alias | define o muestra los alias | alias(1p)\ntype | imprime el tipo de una orden | type(1p) | which(1)\ntime | temporiza una orden | time(1p)\nGNU coreutils | tee | lee de la entrada estándar y escribe en la salida estándar y archivos | tee(1), info\nmktemp | crea un archivo o directorio temporal | mktemp(1), info\ncut | imprime partes seleccionadas de líneas | cut(1), info\ntr | traduce o elimina caracteres | tr(1), info\nod | vuelca archivos en octal y otros formatos | od(1), info | hexdump(1), xxd(1) de vim\nsort | ordena lineas | sort(1), info\nuniq | informa u omite líneas repetidas | uniq(1), info\ncomm | compara dos archivos ordenados línea por línea | comm(1), info\nhead | vuelca la primera parte de los archivos | head(1), info\ntail | vuelca la última parte de los archivos, o sigue los archivos | tail(1), info\nwc | imprime el recuento de líneas nuevas, palabras y bytes | wc(1), info\nGNU binutils | strings | imprime caracteres imprimibles en archivos binarios | strings(1), info\nGNU glibc | iconv | convierte codificaciones de caracteres | iconv(1) | recode\nfile | file | estima el tipo de archivo | file(1)\n\nEl paquete moreutils proporciona herramientas útiles como sponge(1) que no se encuentran en GNU coreutils.\n\n"
    },
    {
      "title": "Alternativas",
      "level": 2,
      "content": "La alternativa a las utilidades principales son proporcionadas por BusyBox, Heirloom Toolchest, 9base, sbase-gitAUR y ubase-gitAUR.\n\n"
    },
    {
      "title": "Alternativas a cp",
      "level": 3,
      "content": "La utilización de rsync (Español)#Como alternativa de cp/mv le permite reanudar una transferencia fallida, mostrar el estado de la transferencia, omitir archivos ya existentes y asegurarse de la integridad de los archivos de destino utilizando sumas de verificación.\n\n"
    },
    {
      "title": "Alternativas a ls",
      "level": 3,
      "content": "- broot — Una nueva forma de ver y navegar arboles de directorios.\n\n- exa — Otro reemplazo de ls con soporte para colores, vista de árbol, integración de git y otras características. También escrito en Rust.\n\n- lsd — Moderno ls con muchos colores bonitos e iconos increíbles.\n\n"
    },
    {
      "title": "Alternativas a find",
      "level": 3,
      "content": "- fd — Alternativa simple, rápida y sencilla de find. Ignora los archivos ocultos y .gitignore por defecto.\n\n- plocate — Un locate mucho más rápido.\n\nPara buscadores de archivos en modo gráfico, véase List of applications/Utilities#File searching.\n\n"
    },
    {
      "title": "Alternativas a diff",
      "level": 3,
      "content": "Mientras que diffutils no proporciona una comparación (diff) de palabras, muchos otros programas lo hacen:\n\n- git diff puede hacer una comparación de palabras con --color-words, utilizando --no-index también se puede usar para archivos fuera de la estructura de trabajo de Git.\n- dwdiff — Una interfaz de comparación de palabras para el programa diff; admite colores.\n\n- GNU wdiff — Una implementación para palabras de GNU diff; no admite colores.\n\n- cwdiff — Un envoltorio de wdiff de GNU que colorea el resultado.\n\n- icdiff — Una herramienta diff coloreada escrita en Python. \"Improved color diff\" está destinado a complementar el uso normal de diff.\n\nVéase también List of applications/Utilities#Comparison, diff, merge.\n\n"
    },
    {
      "title": "Alternativas a grep",
      "level": 3,
      "content": "- mgrep — Un grep multilínea.\n\n- pdfgrep — Una herramienta para buscar texto en archivos PDF.\n\n- ripgrep-all — Busca en texto plano y también en PDFs, E-Books, documentos Office, zip, tar.gz.\n\n"
    },
    {
      "title": "Buscadores de código",
      "level": 4,
      "content": "Las siguientes tres herramientas tienen como objetivo reemplazar grep para la búsqueda de código. Realizan búsquedas recursivas de manera predeterminada, omiten archivos binarios y respetan .gitignore.\n\n- ack — Un reemplazo de grep basado en Perl, dirigido a programadores con grandes estructuras de código fuente heterogéneo.\n\n- ripgrep (rg) — Una herramienta de búsqueda que combina las capacidades de ag con la velocidad de grep.\n\n- La herramienta de búsqueda de código Silver Searcher (ag) — similar a Ack, pero más rápida.\n\n"
    },
    {
      "title": "Filtros interactivos",
      "level": 4,
      "content": "- fzf — Buscador difuso de línea de órdenes de propósito general, potenciado por find por defecto.\n\n- fzy — Un selector de texto difuso simple y rápido con un algoritmo de puntuación avanzado.\n\n- peco — Herramienta de filtrado interactivo simplista.\n\n- percol — Añade algo del filtrado interactivo al concepto de conducto (pipe) tradicional del intérprete de línea de órdenes de UNIX.\n\n- skim — Buscador difuso escrito en Rust, similar a fzf.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Documentación de GNU Coreutils\n- Utilidades POSIX\n\n"
    }
  ]
}