{
  "title": "CrossOver (Français)",
  "url": "https://wiki.archlinux.org/title/CrossOver_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "CrossOver est la version payante et commercialisée de Wine qui offre une assistance plus complète aux utilisateurs finaux. Elle comprend des scripts, des correctifs, une interface graphique (GUI) et des logiciels tiers qui ne seront peut-être jamais acceptés dans le projet Wine. Cette combinaison facilite considérablement l'exécution des programmes Windows pour les personnes qui n'ont pas une solide maîtrise technique.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Pour l'installation, cet article vous suggère la version d'essai de crossoverAUR disponible dans AUR.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "S'ils sont installés par un seul utilisateur, les binaires de CrossOver seront situés dans ~/cxoffice. Les applications Windows et les fichiers de configuration seront placés au format ~/.cxoffice.\n\nS'ils sont installés avec des privilèges root et par plusieurs sessions, les binaires de CrossOver seront situés dans /opt/cxoffice. Les bouteilles (le nom d'un préfixe de Wine est un jeu de mot) de chaque utilisateur seront placées dans ~/.cxoffice.\n\nCertains environnements de bureau comme KDE peuvent avoir des entrées de menu placées automatiquement dans le cadre du processus d'installation.\n\nLes programmes installés seront disponible dans un nouveau sous-menu appelé Applications Windows.\n\n"
    },
    {
      "title": "Dépannage",
      "level": 2,
      "content": "Il y a également un moyen de générer un fichier journal pour vous aider à traquer les erreurs qui peuvent vous empêcher d'exécuter votre/vos application(s) Windows. Dans les menus CrossOver > Exécuter une commande Windows > Options de débogage cliquez sur le signe \"+\" pour développer les options. Cliquez sur la case à cocher \"Créer un fichier journal\". Entrez la commande que vous utiliseriez pour exécuter votre application Windows dans la zone de texte \"Commande\". Vous pouvez utiliser le bouton de navigation si vous n'êtes pas sûr de ce que vous devez entrer, pour naviguer vers votre application Windows. CrossOver vous demandera de choisir un emplacement pour enregistrer le fichier journal. Choisissez votre emplacement et appuyez sur la touche Entrée pour que CrossOver y génère le fichier journal.\n\nBien que la bibliothèque libSM.so n'apparaisse pas dans la liste des bibliothèques manquantes de cxdiag, elle apparaît dans le fichier journal. La bibliothèque appartient au paquet libsm. Si vous avez des difficultés à faire fonctionner votre application, vérifiez l'état de son installation.\n\n"
    }
  ]
}