{
  "title": "CUPS (Français)",
  "url": "https://wiki.archlinux.org/title/CUPS_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- CUPS/Printer sharing\n- CUPS/Printer-specific problems\n- CUPS/Troubleshooting\n- Samba\n- LPRng\n\nCUPS est le système d'impression open source basé sur des standards, développé par OpenPrinting pour Linux® et autres systèmes d'exploitation de type Unix®.\n\nArch Linux fournit le fork OpenPrinting de CUPS, pas le fork Apple de CUPS.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet cups.\n\nEn option, installez le paquet cups-pdf si vous avez l'intention d'\"imprimer\" dans un document PDF. Par défaut, les fichiers PDF sont stockés dans /var/spool/cups-pdf/nom d'utilisateur/. L'emplacement peut être modifié dans /etc/cups/cups-pdf.conf.\n\nPuis activez et démarrez cups.service ou alternativement utilisez l'activation par socket pour ne démarrer CUPS que lorsqu'un programme veut utiliser le service.\n\n"
    },
    {
      "title": "Activation par socket",
      "level": 3,
      "content": "cups fournit une unité cups.socket. Si cups.socket est activé (et cups.service est désactivé), systemd ne démarrera pas CUPS immédiatement ; il écoutera simplement les sockets appropriés. Ensuite, chaque fois qu'un programme tentera de se connecter à l'un de ces sockets CUPS, systemd lancera cups.service et transmettra de manière transparente le contrôle de ces ports au processus CUPS.\n\n"
    },
    {
      "title": "Étapes d'impression",
      "level": 3,
      "content": "Il est important de savoir comment CUPS fonctionne si l'on veut résoudre des problèmes connexes :\n\n1. Une application envoie un fichier PDF à CUPS lorsque l'option 'imprimer' a été sélectionnée (si l'application envoie un autre format, il est d'abord converti en PDF).\n1. CUPS examine ensuite le fichier PPD (fichier de description de l'imprimante) de l'imprimante et détermine les filtres qu'il doit utiliser pour convertir le fichier PDF dans un langage que l'imprimante comprend (comme PJL, PCL, bitmap ou PDF natif).\n1. Le filtre convertit le fichier PDF dans un format compris par l'imprimante.\n1. Puis il est envoyé au back-end. Par exemple, si l'imprimante est connectée à un port USB, elle utilise le back-end USB.\n\n"
    },
    {
      "title": "Interfaces de connexion",
      "level": 2,
      "content": "Les étapes supplémentaires pour la détection de l'imprimante sont listées ci-dessous pour les différentes interfaces de connexion.\n\n"
    },
    {
      "title": "USB",
      "level": 3,
      "content": "Pour consulter si votre imprimante USB est détectée, assurez-vous que le paquet usbutils est installé, puis :\n\n```\n$ lsusb\n```\n\n```\n(...)\nBus 001 Device 007 : ID 03f0:1004 Hewlett-Packard DeskJet 970c/970cse\n```\n\n"
    },
    {
      "title": "Port parallèle",
      "level": 3,
      "content": "Pour utiliser une imprimante par port parallèle, les modules du noyau lp, parport et parport_pc sont nécessaires.\n\n```\n# dmesg | grep -i parport\n```\n\n```\nparport0 : Imprimante, Hewlett-Packard HP LaserJet 2100 Series\nlp0 : utilise parport0 (interrogation)\n```\n\n"
    },
    {
      "title": "Réseau",
      "level": 3,
      "content": "Pour découvrir, utiliser des imprimantes découvertes ou partager des imprimantes à l'aide de DNS-SD/mDNS, configurez résolution des noms d'hôtes .local avec Avahi et redémarrez cups.service.\n\nPour partager des imprimantes avec Samba, par exemple si le système doit être un serveur d'impression pour les clients Windows, le paquet samba sera nécessaire.\n\n"
    },
    {
      "title": "Pilotes d'imprimante",
      "level": 2,
      "content": "Les pilotes d'une imprimante peuvent provenir de n'importe quelle source indiquée ci-dessous. Consultez CUPS/Printer-specific problems pour une liste incomplète de pilotes que d'autres ont réussi à faire fonctionner.\n\nPour piloter une imprimante, CUPS a besoin d'un fichier PPD et, pour la plupart des imprimantes, de quelques filtres. Pour plus de détails sur la façon dont CUPS utilise les PPDs et les filtres, consultez [1].\n\nLa Liste d'imprimantes OpenPrinting fournit des recommandations de pilotes pour de nombreuses imprimantes. Elle fournit également des fichiers PPD pour chaque imprimante, mais la plupart sont disponibles via foomatic ou le paquet de pilotes recommandé.\n\nLorsqu'un fichier PPD est fourni à CUPS, le serveur CUPS régénère les fichiers PPD et les enregistre dans /etc/cups/ppd/.\n\nPour tester s'ils fonctionnent avant de créer un PKGBUILD, les fichiers PPD peuvent être ajoutés manuellement à /usr/share/cups/model, le pilote devrait être disponible après le prochain redémarrage du service cups.\n\n"
    },
    {
      "title": "CUPS",
      "level": 3,
      "content": "CUPS prend en charge les imprimantes AirPrint et IPP Everywhere.\n\n"
    },
    {
      "title": "Filtres OpenPrinting CUPS",
      "level": 3,
      "content": "Le groupe de travail OpenPrinting de la Fondation Linux fournit cups-filters. Ce sont des back-ends, des filtres et d'autres binaires qui faisaient autrefois partie de CUPS mais qui ont été abandonnés par le projet. Ils sont disponibles dans le paquet cups-filters qui est une dépendance de cups.\n\nLes imprimantes non-PDF nécessitent l'installation de ghostscript. Pour les imprimantes PostScript, gsfonts peut également être nécessaire.\n\n"
    },
    {
      "title": "Foomatic",
      "level": 3,
      "content": "Le groupe de travail OpenPrinting de la Fondation Linux foomatic fournit des PPD pour de nombreux pilotes d'imprimante, libres ou non. Pour plus d'informations sur ce que fait foomatic, consultez Foomatic du point de vue du développeur.\n\nPour utiliser foomatic, installez foomatic-db-engine et au moins un des éléments suivants :\n\n- foomatic-db - une collection de fichiers XML utilisés par foomatic-db-engine pour générer des fichiers PPD.\n- foomatic-db-ppds - fichiers PPD pré-construits.\n- foomatic-db-nonfree - une collection de fichiers XML provenant de fabricants d'imprimantes sous licences non-libres utilisés par foomatic-db-engine pour générer des fichiers PPD.\n- foomatic-db-nonfree-ppds - fichiers PPD pré-construits sous des licences non-libres.\n\nLes PPD de foomatic peuvent nécessiter des filtres supplémentaires, tels que min12xxwAUR.\n\n"
    },
    {
      "title": "Gutenprint",
      "level": 3,
      "content": "Le Gutenprint project fournit des pilotes pour les imprimantes Canon, Epson, Lexmark, Sony, Olympus et PCL à utiliser avec CUPS et GIMP.\n\nInstallez gutenprint et foomatic-db-gutenprint-ppds.\n\n"
    },
    {
      "title": "Pilotes spécifiques aux fabricants",
      "level": 3,
      "content": "De nombreux fabricants d'imprimantes fournissent leurs propres pilotes Linux. Ceux-ci sont souvent disponibles dans les dépôts officiels d'Arch ou dans l'AUR.\n\nCertains de ces pilotes sont décrits plus en détail dans CUPS/Printer-specific problems.\n\n"
    },
    {
      "title": "URI de l'imprimante",
      "level": 2,
      "content": "Vous trouverez ci-dessous des étapes supplémentaires pour générer manuellement l'URI si nécessaire. Certaines imprimantes ou pilotes peuvent nécessiter un URI spécial, comme décrit dans CUPS/Printer-specific problems.\n\n"
    },
    {
      "title": "USB",
      "level": 3,
      "content": "CUPS devrait être capable de générer automatiquement un URI pour les imprimantes USB, par exemple usb://HP/DESKJET%20940C?serial=CN16E6C364BH.\n\nSi ce n'est pas le cas, consultez CUPS/Troubleshooting#USB printers pour connaître les étapes de dépannage.\n\n"
    },
    {
      "title": "Port parallèle",
      "level": 3,
      "content": "L'URI doit être de la forme parallel:device. Par exemple, si l'imprimante est connectée sur /dev/lp0, utilisez parallel:/dev/lp0. Si vous utilisez un adaptateur USB vers port parallèle, utilisez parallel:/dev/usb/lp0 comme URI de l'imprimante.\n\n"
    },
    {
      "title": "Réseau",
      "level": 3,
      "content": "Si vous avez configuré Avahi comme dans #Réseau, CUPS devrait détecter l'URI de l'imprimante. Vous pouvez également utiliser avahi-discover pour trouver le nom de votre imprimante et son adresse (par exemple, BRN30055C6B4C7A.local/10.10.0.155:631).\n\nL'URI peut également être généré manuellement, sans utiliser Avahi. Une liste des schémas URI disponibles pour les imprimantes en réseau est disponible dans la documentation CUPS. Comme les détails exacts des URI diffèrent selon les imprimantes, consultez le manuel de l'imprimante ou CUPS/Printer-specific problems.\n\nL'URI pour les imprimantes sur les partages SMB est décrit dans la page de manuel smbspool(8).\n\nNote: Par exemple, smb://BEN-DESKTOP/HP Color LaserJet CP1510 series PCL6 devient smb://BEN-DESKTOP/HP%20Color%20LaserJet%20CP1510%20series%20PCL6.\n\nPar exemple, smb://BEN-DESKTOP/HP Color LaserJet CP1510 series PCL6 devient smb://BEN-DESKTOP/HP%20Color%20LaserJet%20CP1510%20series%20PCL6.\n\nLa chaîne de caractères peut être obtenue en exécutant la commande suivante :\n\n```\n$ python -c 'from urllib.parse import quote ; print(\"smb://\" + quote(\"BEN-DESKTOP/HP Color LaserJet CP1510 series PCL6\"))\n```\n\nLes serveurs d'impression CUPS distants sont accessibles via une URI de la forme ipp://hostname:631/printers/queue_name. Consultez CUPS/Printer sharing#Printer sharing pour plus de détails sur la configuration du serveur d'impression distant.\n\nConsultez CUPS/Troubleshooting#Networking issues pour d'autres problèmes et solutions.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "CUPS peut être entièrement contrôlé en utilisant les outils CLI lp* et cups*. Sinon, l'#Interface Web ou l'une des nombreuses #Interfaces graphiques peut être utilisée.\n\n- Le nom de la queue (file d'attente) est un nom court mais descriptif utilisé sur le système pour identifier la queue. Ce nom ne doit pas contenir d'espaces ou de caractères spéciaux. Par exemple, une file d'attente d'impression correspondant à une HP LaserJet 5P pourrait être nommée \"hpljet5p\". Plus d'une file d'attente peut être associée à chaque imprimante physique.\n- L'emplacement est une description de l'emplacement physique de l'imprimante (par exemple \"chambre\", ou \"cuisine\"). Ceci permet de faciliter la gestion de plusieurs imprimantes.\n- La description est une description complète de la file d'attente d'impression. Une utilisation courante est le nom complet de l'imprimante (comme \"HP LaserJet 5P\").\n\n"
    },
    {
      "title": "Outils CLI",
      "level": 3,
      "content": "Consultez documentation locale CUPS pour plus d'informations sur les outils de la ligne de commande.\n\nUtilisez SNMP pour trouver un URI :\n\n```\n$ /usr/lib/cups/backend/snmp ip_address\n```\n\n"
    },
    {
      "title": "lp*",
      "level": 4,
      "content": "L'utilitaire lpinfo liste les périphériques avec le paramètre -v, et les modèles avec le paramètre -m.\n\nL'utilitaire lpadmin crée une nouvelle file d'attente avec -p queue_name. Le paramètre -E ajouté à -p active et accepte les travaux sur l'imprimante. L'indicateur -v spécifie l'URI du périphérique, l'indicateur -m spécifie le modèle ou le fichier PPD à utiliser. Vous pouvez également utiliser le paramètre -x pour supprimer une imprimante (lisez au préalable la section ci-dessous).\n\nExemples :\n\n```\n# lpadmin -p HP_DESKJET_940C -E -v \"usb://HP/DESKJET%20940C?serial=CN16E6C364BH\" -m drv:///HP/hp-deskjet_940c.ppd.gz\n```\n\nPour une file d'attente sans pilote (Apple AirPrint ou IPP Everywhere) :\n\n```\n# lpadmin -p AirPrint -E -v \"ipp://10.0.1.25/ipp/print\" -m everywhere\n```\n\nPour une file d'attente brute ; sans PPD ni filtre :\n\n```\n# lpadmin -p SHARED_PRINTER -m raw\n```\n\nEn spécifiant un PPD au lieu d'un modèle :\n\n```\n# lpadmin -p Test_Printer -E -v \"ipp://10.0.1.3/ipp/print\" -m pxlmono.ppd\n```\n\n- Lorsque vous spécifiez le PPD, utilisez uniquement le nom du fichier et non le chemin complet (par exemple, pxlmono.ppd au lieu de /usr/share/ppd/cupsfilters/pxlmono.ppd). Le chemin complet peut également être utilisé avec le paramètre de ligne de commande -P.\n- En 2021, de nombreuses imprimantes récentes prennent en charge l'impression sans pilote et lorsque vous spécifiez -m partout, comme dans le deuxième exemple ci-dessus, l'imprimante sera définie et un fichier .ppd sera créé dans /etc/cups/ppd/ en interrogeant l'imprimante sur le réseau.\n\nL'utilitaire lpq vérifie la file d'attente. Ajoutez le paramètre -a pour vérifier toutes les files d'attente.\n\nL'utilitaire lprm efface la file d'attente. Ajoutez un - pour supprimer toutes les entrées au lieu de seulement la dernière par défaut.\n\nL'utilitaire lpr imprime. Utilisez -# N pour imprimer le fichier N fois, utilisez le paramètre -p pour ajouter un en-tête.\n\nExemples d'impressions de test avec lpr :\n\n```\n$ lpr /usr/share/cups/data/testprint\n$ echo 'Hello, world!' | lpr -p\n```\n\nL'utilitaire lpstat, utilisé avec le paramètre -s, vérifie l'état. Le paramètre -p permet de spécifier la file d'attente à vérifier.\n\nL'utilitaire lpoptions utilise le même paramètre -p queue_name que lpadmin montré ci-dessus. Avec le paramètre -l, il liste les options. Le paramètre -d définit l'imprimante par défaut avec l'argument queue_name. Le paramètre -o définit les options à une valeur :\n\n```\n$ lpoptions -p HP_DESKJET_940C -o PageSize=A4\n$ lpoptions -p HP_DESKJET_940C -o cupsIPPSupplies=true -o Duplex=DuplexNoTumble\n```\n\n"
    },
    {
      "title": "cups*",
      "level": 4,
      "content": "Les utilitaires cupsaccept, cupsdisable, cupsenable et cupsreject exécutent ce pour quoi ils sont nommé en anglais. Respectivement : paramétrer l'imprimante pour accepter des travaux, désactiver une imprimante, activer une imprimante, paramétrer l'imprimante pour rejeter toutes les tâches entrantes.\n\nPour illustrer leur utilisation, nous allons supprimer proprement une imprimante :\n\n```\n# cupsreject queue_name\n# cupsdisable queue_name\n# lpadmin -x queue_name\n```\n\n"
    },
    {
      "title": "encre",
      "level": 4,
      "content": "Installez inkAUR pour visualiser les niveaux d'encre.\n\nAjoutez votre utilisateur au groupe d'utilisateurs lp supplémentaire, déconnectez-vous et reconnectez-vous.\n\nPour obtenir des informations sur l'utilisation, exécutez ink sans options.\n\n"
    },
    {
      "title": "Interface Web",
      "level": 3,
      "content": "Le serveur CUPS peut être entièrement administré via l'interface Web, disponible sur http://localhost:631/.\n\nPour effectuer des tâches administratives à partir de l'interface web, une authentification est nécessaire ; consultez #Permissions.\n\nAllez sur la page Administration.\n\nAllez sur la page Imprimantes, et sélectionnez une file d'attente à modifier.\n\nAllez à la page Imprimantes, et sélectionnez une file d'attente.\n\n"
    },
    {
      "title": "Interfaces graphiques",
      "level": 3,
      "content": "Si votre utilisateur ne dispose pas de privilèges suffisants pour administrer CUPS, les applications demanderont le mot de passe root lors de leur démarrage. Pour donner aux utilisateurs des privilèges d'administration sans avoir besoin de l'accès root, consultez #Configuration.\n\n- Deepin Print Manager — Interface de configuration de l'imprimante pour le bureau Deepin.\n\n- GtkLP — Interface GTK pour CUPS.\n\n- print-manager — Outil de gestion des travaux d'impression et des imprimantes (KDE).\n\n- system-config-printer — Outil de configuration de l'imprimante et applet d'état GTK.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "La configuration du serveur CUPS se trouve dans /etc/cups/cupsd.conf et /etc/cups/cups-files.conf. (consultez cupsd.conf(5) et cups-files.conf(5)). Après avoir modifié l'un ou l'autre de ces fichiers, redémarrez cups.service pour appliquer les changements. La configuration par défaut est suffisante pour la plupart des utilisateurs.\n\n"
    },
    {
      "title": "Permissions",
      "level": 3,
      "content": "Les groupes d'utilisateurs ayant des privilèges d'administration d'imprimante sont définis dans SystemGroup dans le fichier /etc/cups/cups-files.conf. Les groupes sys, root et wheel sont utilisés par défaut.\n\nLes programmes d'aide CUPS sont exécutés sous l'utilisateur et le groupe cups. Cela permet aux programmes d'aide d'accéder aux périphériques d'impression et de lire les fichiers de configuration dans /etc/cups/, qui appartiennent au groupe cups.\n\n"
    },
    {
      "title": "Format de papier par défaut",
      "level": 3,
      "content": "cups est compilé avec la prise en charge de libpaper et libpaper utilise par défaut le format de papier Letter (appelé PageSize dans lpoptions). Pour éviter d'avoir à changer la taille du papier pour chaque file d'impression que vous ajoutez, modifiez /etc/papersize et définissez le format de papier par défaut de votre système. Consultez paper(1).\n\n"
    },
    {
      "title": "Fichiers journaux",
      "level": 3,
      "content": "Par défaut, tous les journaux sont envoyés vers des fichiers dans /var/log/cups/. En changeant les valeurs des directives AccessLog, ErrorLog, et PageLog dans /etc/cups/cups-files.conf en syslog, CUPS peut être amené à envoyer les journaux dans le journal de systemd à la place. Consultez Fedora:Changes/CupsJournalLogging pour des informations sur le changement proposé à l'origine.\n\n"
    },
    {
      "title": "cups-browsed",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nCUPS peut utiliser la navigation Avahi pour découvrir des imprimantes partagées inconnues sur votre réseau. Cela peut être utile dans les grandes installations où le serveur est inconnu. Pour utiliser cette fonctionnalité, configurez résolution du nom d'hôte .local et démarrez avahi-daemon.service et cups-browsed.service. Les travaux sont envoyés directement à l'imprimante sans aucun traitement, de sorte que les files d'attente créées peuvent ne pas fonctionner, mais les imprimantes sans pilote telles que celles prenant en charge IPP Everywhere ou AirPrint devraient fonctionner d'emblée.\n\n- La recherche d'imprimantes réseau peut augmenter considérablement le temps de démarrage de votre ordinateur.\n- cups-browsed.service n'est nécessaire que pour ajouter et supprimer dynamiquement des imprimantes lorsqu'elles apparaissent et disparaissent d'un réseau. Il n'est pas nécessaire si vous souhaitez simplement ajouter une imprimante réseau prenant en charge le DNS-SD/mDNS à CUPS.\n\n"
    },
    {
      "title": "Serveurs d'impression et administration à distance",
      "level": 3,
      "content": "Consultez CUPS/Printer sharing et CUPS/Printer sharing#Remote administration.\n\n"
    },
    {
      "title": "Autoriser l'authentification de l'administrateur via PolicyKit",
      "level": 3,
      "content": "PolicyKit peut être configuré pour permettre aux utilisateurs de configurer les imprimantes à l'aide d'une interface graphique sans le mot de passe administrateur.\n\nVoici un exemple qui permet aux membres du groupe d'utilisateurs wheel d'administrer les imprimantes sans mot de passe :\n\n```\n/etc/polkit-1/rules.d/49-allow-passwordless-printer-admin.rules\n```\n\n```\npolkit.addRule(function(action, subject) { \n    si (action.id == \"org.opensuse.cupspkhelper.mechanism.all-edit\" && \n        subject.isInGroup(\"wheel\")){ \n        return polkit.Result.YES ; \n    } \n}) ;\n```\n\n"
    },
    {
      "title": "Sans serveur CUPS local",
      "level": 3,
      "content": "CUPS peut être configuré pour se connecter directement à des serveurs d'impression distants au lieu d'exécuter un serveur d'impression local. Cela nécessite l'installation du paquet libcups. Certaines applications nécessiteront toujours le paquet cups pour l'impression.\n\nPour utiliser un serveur CUPS distant, définissez la variable d'environnement CUPS_SERVER à printerserver.mydomain:port. Par exemple, si vous souhaitez utiliser un serveur d'impression différent pour une seule instance de Firefox (remplacez printserver.mydomain:port par le nom/port de votre serveur d'impression) :\n\n```\n$ CUPS_SERVER=printserver.mydomain:port firefox\n```\n\nPour rendre cette configuration permanente, créez le fichier de configuration /etc/cups/client.conf et ajoutez-y le nom d'hôte du serveur CUPS distant :\n\n```\nServerName server\n```\n\nVous pouvez également spécifier un port personnalisé :\n\n```\nServerName server:port\n```\n\nConsultez [4] pour plus de détails.\n\n"
    },
    {
      "title": "Dépannage",
      "level": 2,
      "content": "Consultez l'article anglais CUPS/Troubleshooting.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Documentation officielle de CUPS, installée localement\n- Wikipedia:CUPS\n- Page d'accueil OpenPrinting\n- Guide d'impression d'OpenSuSE Concepts - explique une impression de A à Z.\n- «OpenSuSE CUPS in a Nutshell» - un rapide aperçu de CUPS\n- Gentoo:Printing\n- portail de l'impression de Debian - guides techniques détaillés\n- Portail de l'impression de Debian - une vue de base du système d'impression CUPS.\n- Liste de diffusion CUPS[dead link 2024-11-05 ⓘ]\n- Liste de diffusion CUPS (fork d'Apple)\n- Suivi des problèmes de CUPS.\n- Suivi des problèmes de CUPS (fork d'Apple)\n\n"
    }
  ]
}