{
  "title": "CUPS (Русский)",
  "url": "https://wiki.archlinux.org/title/CUPS_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- CUPS/Совместное использование принтеров\n- CUPS/Принтероспецифичные проблемы\n- CUPS/Решение проблем\n- Samba (Русский)\n- LPRng\n\nCUPS - это стандартная система печати с открытым исходным кодом, разработанная Apple Inc. для MacOS® и других UNIX®-подобных операционных систем.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет cups.\n\nЕсли вы намерены \"распечатать\" в документ PDF, тогда вам необходимо установить пакет cups-pdf. По умолчанию файлы PDF хранятся в /var/spool/cups-pdf/имя_пользователя. Местоположение можно изменить в /etc/cups/cups-pdf.conf.\n\nВключите и запустите службу cups.service.\n\n"
    },
    {
      "title": "Сокет-активация",
      "level": 3,
      "content": "cups предоставляет юнит cups.socket. Если сокет cups.socket включен (а служба cups.service отключена), systemd не будет запускать CUPS сразу, а просто будет слушать соответствующие сокеты. Затем всякий раз, когда программа пытается обратиться к одному из этих сокетов, systemd будет запускать службу cups.service и прозрачно передавать управление этими портами процессу CUPS.\n\nТаким образом, CUPS запускается только тогда, когда программа хочет его использовать.\n\n"
    },
    {
      "title": "Интерфейсы подключения",
      "level": 2,
      "content": "Дополнительные шаги для обнаружения принтера приведены ниже для различных интерфейсов подключения.\n\n- Вспомогательные программы CUPS запускаются с использованием пользователя и группы cups. Это позволяет им получать доступ к файлам принтера и читать файлы конфигурации в /etc/cups/, которые принадлежат группе cups.\n- До cups версии 2.2.6-2, вместо группы cups использовалась группа lp. После обновления файлы в /etc/cups должны принадлежать группе cups, а в файле /etc/cups/cups-files.conf должно быть прописано User 209 и Group 209.\n\n"
    },
    {
      "title": "USB",
      "level": 3,
      "content": "Чтобы узнать, обнаружен ли ваш USB-принтер (должен быть установлен пакет usbutils), запустите\n\n```\n$ lsusb\n```\n\n```\n(...)\nBus 001 Device 007: ID 03f0:1004 Hewlett-Packard DeskJet 970c/970cse\n```\n\n"
    },
    {
      "title": "Параллельный порт",
      "level": 3,
      "content": "Чтобы использовать принтер с параллельным портом, требуются модули ядра lp, parport и parport_pc.\n\n```\n# dmesg | grep -i parport\n```\n\n```\nparport0: Printer, Hewlett-Packard HP LaserJet 2100 Series\n lp0: using parport0 (polling)\n```\n\n"
    },
    {
      "title": "Cеть",
      "level": 3,
      "content": "Чтобы обнаружить или предоставить общий доступ к принтерам с помощью DNS-SD/mDNS, настройте разрешение имени узла .local через Avahi и перезапустите службу cups.service.\n\nДля предоставления общего доступа к принтерам с помощью Samba, например, если система должна быть сервером печати для клиентов Windows, необходим пакет samba.\n\n"
    },
    {
      "title": "Драйверы принтеров",
      "level": 2,
      "content": "Драйверы для принтеров можно получить из любого из источников, приведенных ниже. Смотрите CUPS/Принтероспецифичные проблемы для неполного списка драйверов, которые работают.\n\nДля управления принтером CUPS требуется файл PPD, а для большинства принтеров - некоторые фильтры. Подробнее о том, как CUPS использует PPD и фильтры, смотрите на [1].\n\nСписок принтеров OpenPrinting содержит рекомендации для драйверов для многих принтеров. Он также поставляет файлы PPD для каждого принтера, но большинство из них доступны через foomatic или рекомендованный пакет драйверов.\n\nКогда файлы PPD предоставляются CUPS, тогда сервер CUPS будет регенерировать файлы PPD и сохранять их в /etc/cups/ppd/.\n\n"
    },
    {
      "title": "CUPS",
      "level": 3,
      "content": "CUPS обеспечивает поддержку принтеров AirPrint и IPP Everywhere.\n\n"
    },
    {
      "title": "Фильтры OpenPrinting CUPS",
      "level": 3,
      "content": "Рабочая группа OpenPrinting в Linux Foundation предоставляет cups-filters. Это бэкэнды, фильтры и другие двоичные файлы, которые когда-то были частью CUPS, но больше не поддерживаются Apple. Они доступны в пакете cups-filters, который является зависимостью для cups.\n\nДля принтеров Non-PostScript требуется установить ghostscript. Для ghostscript также может потребоваться gsfonts.\n\n"
    },
    {
      "title": "Foomatic",
      "level": 3,
      "content": "Рабочая группа foomatic в OpenPrinting в Linux Foundation предоставляет PPD для многих драйверов принтеров, как свободных, так и проприетарных. Для получения дополнительной информации о том, что делает foomatic, смотрите Обзор foomatic от разработчиков.\n\nЧтобы использовать foomatic, установите foomatic-db-engine и по крайней мере один из пакетов:\n\n- foomatic-db - коллекция файлов XML, используемая foomatic-db-engine для генерации файлов PPD.\n- foomatic-db-ppds - прекомпилированные файлы PPD.\n- foomatic-db-nonfree - коллекция файлов XML под несвободными лицензиями от производителей принтеров, используемая foomatic-db-engine для генерации файлов PPD.\n- foomatic-db-nonfree-ppds - прекомпилированные файлы PPD под несвободными лицензиями.\n\nДля PPD foomatic могут потребоваться дополнительные фильтры, такие как min12xxwAUR.\n\n"
    },
    {
      "title": "Gutenprint",
      "level": 3,
      "content": "Проект Gutenprint предоставляет драйвера для Canon, Epson, Lexmark, Sony, Olympus, и принтеров PCL для использования с CUPS и GIMP.\n\nУстановите gutenprint и foomatic-db-gutenprint-ppds.\n\n"
    },
    {
      "title": "Специфические для производителя драйвера",
      "level": 3,
      "content": "Многие производители принтеров поставляют свои собственные драйверы Linux. Они часто доступны в официальных хранилищах Arch или в AUR.\n\nНекоторые из этих драйверов описаны более подробно в CUPS/Принтероспецифичные проблемы.\n\n"
    },
    {
      "title": "URI принтера",
      "level": 2,
      "content": "Ниже перечислены дополнительные шаги для ручного создания URI, если это необходимо. Для некоторых принтеров или драйверов нужны особые URI, описанные в CUPS/Принтероспецифичные проблемы.\n\n"
    },
    {
      "title": "USB",
      "level": 3,
      "content": "CUPS должен иметь возможность автоматически генерировать URI для USB-принтеров, например usb://HP/DESKJET%20940C?serial=CN16E6C364BH.\n\nЕсли этого не происходит, смотрите CUPS/Решение проблем#USB-принтеры для получения информации об устранении неполадок.\n\n"
    },
    {
      "title": "Параллельный порт",
      "level": 3,
      "content": "URI должен иметь вид parallel:device. Например, если принтер подключен к /dev/lp0, используйте parallel:/dev/lp0. Если вы используете адаптер USB для параллельного порта, используйте parallel:/dev/usb/lp0 в качестве URI принтера.\n\n"
    },
    {
      "title": "Сеть",
      "level": 3,
      "content": "Если вы настроили Avahi, как в #Сеть, CUPS должен определить URI принтера. Вы также можете использовать avahi-discover, чтобы найти имя вашего принтера и его адрес (например, BRN30055C6B4C7A.local/10.10.0.155:631).\n\nURI также можно создать вручную, не используя Avahi. Список доступных схем URI для сетевых принтеров доступен в документации CUPS. Поскольку точные данные URI отличаются между принтерами, проверьте руководство принтера или CUPS/Принтероспецифичные проблемы.\n\nURI для сетевых принтеров SMB описаны на справочной странице smbspool(8).\n\nК удаленным серверам печати CUPS можно получить доступ через URI формы ipp://hostname:631/printers/queue_name. Подробнее о настройке удаленного сервера печати смотрите CUPS/Printer sharing#Sharing via Internet Printing Protocol.\n\nСмотрите CUPS/Решение проблем#Проблемы с сетью для получения дополнительной информации о проблемах и их решений.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "CUPS можно полностью контролировать с помощью инструментов командной строки (CLI) из пакетов lp* и cups*. В качестве альтернативы можно использовать #Веб интерфейс или одно из нескольких #Приложения с GUI.\n\n- Имя принтера - короткое, но описательное имя, используемое в системе для идентификации принтера. Это имя не должно содержать пробелов или специальных символов. Например, принтер, соответствующий HP LaserJet 5P, может быть назван \"hpljet5p\". С каждым физическим принтером можно связать более одной очереди.\n- Расположение - это описание физического расположения принтера (например, \"спальня\", или \"кухня\"). Это помогает поддерживать несколько принтеров.\n- Описание - полное описание принтера. Обычно используется полное имя принтера (например, \"HP LaserJet 5P\").\n\n"
    },
    {
      "title": "Инструменты CLI",
      "level": 3,
      "content": "Смотрите локальную документацию CUPS для получения дополнительных сведений об инструментах командной строки.\n\nNote: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\n```\n# lpinfo -v\n$ /usr/lib/cups/backend/snmp ip_address # Используйте SNMP для поиска URI\n```\n\n```\n$ lpinfo -m\n```\n\n```\n# lpadmin -p имя принтера -E -v uri -m model\n```\n\nИмя принтера зависит от тебя. Например:\n\n```\n# lpadmin -p HP_DESKJET_940C -E -v \"usb://HP/DESKJET%20940C?serial=CN16E6C364BH\" -m drv:///HP/hp-deskjet_940c.ppd.gz\n# lpadmin -p AirPrint -E -v \"ipp://10.0.1.25/ipp/print\" -m everywhere    # Принтеры без драйверов (Apple AirPrint или IPP Everywhere)\n# lpadmin -p SHARED_PRINTER -m raw    # Необработанный принтер; нет PPD или фильтра\t\n# lpadmin -p Test_Printer -E -v \"ipp://10.0.1.3/ipp/print\" -m pxlmono.ppd    # Указание PPD вместо модели\n```\n\n```\n$ lpoptions -d имя принтера\n```\n\n```\n$ lpoptions -p имя принтера -l # Список параметров\n$ lpoptions -p имя принтера -o option=value # Установка параметра\n```\n\nНапример:\n\n```\n$ lpoptions -p HP_DESKJET_940C -o PageSize=A4\n```\n\n```\n$ lpstat -s\n$ lpstat -p имя принтера\n```\n\n```\n# cupsdisable имя принтера\n```\n\n```\n# cupsenable имя принтера\n```\n\n```\n# cupsaccept имя принтера\n```\n\nСначала настройте принтер для отклонения всех входящих записей:\n\n```\n# cupsreject имя принтера\n```\n\nЗатем отключите его.\n\n```\n# cupsdisable имя принтера\n```\n\nНаконец, удалите его.\n\n```\n# lpadmin -x имя принтера\n```\n\n```\n$ lpr файл\n$ lpr -# 17 файл            # распечатать файл 17 раз\n$ echo 'Привет, мир!' | lpr -p # распечатать результат команды. Переключатель -p добавляет заголовок.\n```\n\n```\n$ lpq\n$ lpq -a # во всех очередях\n```\n\n```\n# lprm   # удаляет только последнюю запись\n# lprm - # удаляет все записи\n```\n\n"
    },
    {
      "title": "Веб интерфейс",
      "level": 3,
      "content": "Сервером CUPS можно полностью управлять через веб-интерфейс, доступный по адресу http://localhost:631/.\n\nДля выполнения административных задач требуется аутентификация веб-интерфейса. Аутентифицируйте себя либо как root, либо убедитесь, что ваш пользователь входит в группу с полномочиями управления принтерами, для получения дополнительной информации смотрите #Настройка.\n\nПерейдите на вкладку Администрирование.\n\nПерейдите на вкладку Принтеры и выберите принтер для изменения.\n\nПерейдите на вкладку Принтеры и выберите принтер.\n\n"
    },
    {
      "title": "Приложения с GUI",
      "level": 3,
      "content": "Если у вашего пользователя нет достаточных привилегий для администрирования CUPS, приложения будут запрашивать пароль root при запуске. Чтобы предоставить пользователям права администратора без необходимости доступа root, смотрите #Настройка.\n\n- GtkLP — Интерфейс GTK+ для CUPS.\n\n- print-manager — Инструмент для управления заданиями печати и принтерами (KDE).\n\n- system-config-printer — Инструмент настройки принтера GTK+ и апплет состояния (GNOME и другие).\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Настройки сервера CUPS находятся в /etc/cups/cupsd.conf и /etc/cups/cups-files.conf (смотрите cupsd.conf(5) и cups-files.conf(5)). После редактирования любого из этих файлов, перезапустите cups.service, чтобы применить произведенные изменения. Настройки по умолчанию подходят для большинства пользователей.\n\nГруппы с правами администрирования принтера определены в SystemGroup в /etc/cups/cups-files.conf. Группы sys и root используется по умолчанию.\n\nПакет cups собран с поддержкой libpaper и значением по умолчанию для формата бумаги Письмо для файла libpaper. Чтобы избежать необходимости изменять размер бумаги для каждого принтера, отредактируйте /etc/papersize и задайте размер бумаги по умолчанию для вашей системы. Для получения дополнительной информации смотрите paper(1).\n\nПо умолчанию все журналы отправляются в файлы в /var/log/cups/. Изменив значения директив AccessLog, ErrorLog и PageLog в /etc/cups/cups-files.conf на syslog, то CUPS сможет отправлять логи в журнал systemd. Смотрите вики-страницу fedora для получения информации об исходном предлагаемом изменении.\n\n"
    },
    {
      "title": "cups-browsed",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nCUPS может использовать Avahi для обнаружения неизвестных общих принтеров в вашей сети. Это может быть полезно в крупных сетях, где сервер неизвестен. Чтобы использовать эту функцию, настройте разрешение .local hostname и запустите службы avahi-daemon.service и cups-browsed.service. Задания отправляются непосредственно на принтер без какой-либо обработки, поэтому созданные очереди могут не работать, однако для принтеров, не требущих драйверов, такие как те, которые поддерживают IPP Everywhere или AirPrint все должно работать из коробки.\n\n- Поиск сетевых принтеров может значительно увеличить время, необходимое для загрузки вашего компьютера.\n- Служба cups-browsed.service необходима только для динамического добавления и удаления принтеров, когда они появляются и исчезают из сети. Она не требуется, если вы просто хотите добавить сетевой принтер с поддержкой DNS-SD/mDNS в CUPS.\n\n"
    },
    {
      "title": "Серверы печати и удаленное администрирование",
      "level": 3,
      "content": "Для получения дополнительной информации смотрите CUPS/Совместное использование принтеров и CUPS/Printer sharing#Remote administration.\n\n"
    },
    {
      "title": "Разрешение аутентификации администратора через PolicyKit",
      "level": 3,
      "content": "PolicyKit можно настроить так, чтобы пользователи могли настраивать принтеры с помощью графического интерфейса без пароля администратора.\n\nВот пример, который позволяет членам группы wheel управлять принтерами без пароля:\n\n```\n/etc/polkit-1/rules.d/49-allow-passwordless-printer-admin.rules\n```\n\n```\npolkit.addRule(function(action, subject) { \n    if (action.id == \"org.opensuse.cupspkhelper.mechanism.all-edit\" && \n        subject.isInGroup(\"wheel\")){ \n        return polkit.Result.YES; \n    } \n});\n```\n\n"
    },
    {
      "title": "Без локального сервера CUPS",
      "level": 3,
      "content": "CUPS можно настроить для прямого подключения к удаленным серверам принтеров вместо запуска локального сервера печати. Для этого потребуется установить пакет libcups. Некоторым приложениям по-прежнему потребуется пакет cups для печати.\n\nЧтобы использовать удаленный сервер CUPS, установите переменную окружения CUPS_SERVER в printerserver.mydomain:port. Например, если вы хотите использовать другой сервер печати для одного экземпляра Firefox (замените printserver.mydomain:port на имя/порт своего сервера печати):\n\n```\n$ CUPS_SERVER=printserver.mydomain:port firefox\n```\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Для получения дополнительной информации смотрите CUPS/Решение проблем.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальная документация CUPS documentation, локальная установка\n- Википедия:Common UNIX Printing System\n- Домашняя страница OpenPrinting[устаревшая ссылка 2022-09-17 ⓘ]\n- Руководство по печати OpenSuSE Concepts - объясняет полный рабочий процесс печати\n- OpenSuSE CUPS в двух словах - быстрый обзор CUPS\n- Руководство по печати Gentoo\n- Портал печати Debian - подробные технические руководства\n- Обзор печати Debian - основной вид системы печати CUPS\n\n"
    }
  ]
}