{
  "title": "CUPS/Решение проблем",
  "url": "https://wiki.archlinux.org/title/CUPS/%D0%A0%D0%B5%D1%88%D0%B5%D0%BD%D0%B8%D0%B5_%D0%BF%D1%80%D0%BE%D0%B1%D0%BB%D0%B5%D0%BC",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- CUPS (Русский)\n- CUPS/Принтероспецифичные проблемы\n\nВ этой статье рассматриваются все неспецифические (то есть не связанные с каким-либо одним принтером) проблемы CUPS и драйверов принтеров (но не проблемы, связанные с совместным использованием принтеров), включая методы определения точной природы проблемы и решения выявленной проблемы.\n\n"
    },
    {
      "title": "Введение",
      "level": 2,
      "content": "Наилучший способ борьбы с неисправностями - это выставить 'LogLevel' в файле /etc/cups/cupsd.conf на:\n\n```\nLogLevel debug\n```\n\nА потом посмотреть вывод из файла /var/log/cups/error_log например так:\n\n```\n# tail -n 100 -f /var/log/cups/error_log\n```\n\nСимволы слева от вывода означают следующее:\n\n- D=Debug(отладка)\n- E=Error(ошибка)\n- I=Information(информация)\n- И так далее\n\nСледующие файлы также могут быть полезны:\n\n- /var/log/cups/page_log - каждый раз при успешной печати, пишет новую запись\n- /var/log/cups/access_log - записывает всю активность на cupsd http1.1 сервере\n\nТакже, если вы хотите решить свои проблемы, важно понимать, как вообще работает CUPS. Вот краткая информация об этом:\n\n1. Когда вы жмёте 'печать' приложение отправляет .ps-файл (PostScript, язык-скрипт, который описывает, как выглядит страница) в систему CUPS (так происходит в большинстве программ).\n1. CUPS смотрит на PPD-файл (файл описания принтера) и находит, фильтры которые ему нужно использовать для преобразования .ps-файла в файл, который понимает ваш принтер (например, PJL,PCL). Обычно для этого ему требуется ghostscript.\n1. GhostScript принимает ввод и решает, какие фильтры ему использовать, потом применяет их и преобразовывает .ps-файл в формат, который понимает принтер.\n1. Затем файл передается бэкенду. Например, если у вас принтер подключен к usb порту, то используется usb бэкенд\n\nРаспечатайте документ и посмотрите error_log, чтобы получить более подробное и правильное представление об процессе печати.\n\n"
    },
    {
      "title": "Проблемы, возникающие в результате обновлений",
      "level": 2,
      "content": "Проблемы возникшие после обновления CUPS и сопутствующего ему набора программ\n\n"
    },
    {
      "title": "CUPS останавливается",
      "level": 3,
      "content": "Существует вероятность, что для правильной работы в обновленной версии понадобится новый файл конфигурации. Например, получение сообщения \"404 - page not found\" при попытке входа в панель управления CUPS через localhost:631.\n\nДля того, чтобы воспользоваться новым конфигом, скопируйте /etc/cups/cupsd.conf.default в /etc/cups/cupsd.conf (при необходимости сделайте резервную копию старого конфига) и, чтобы новые настройки вступили в силу, перезапустите CUPS.\n\n"
    },
    {
      "title": "Для всех заданий - \"остановлено\"",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nЕсли для всех отправленных на печать заданий установился статус \"остановлено\" (\"stopped\"), - удалите принтер и установите его заново. Для этого войдите в веб-интерфейс CUPS, перейдите Принтеры > Удалить Принтер.\n\nДля проверки настроек принтера перейдите во вкладку Принтеры, затем скопируйте отображаемую информацию. Далее нажмите на Администрирование. В выпадающем списке кликните Изменить принтер, перейдите к следующей странице(ам), и так далее.\n\n"
    },
    {
      "title": "Для всех заданий - \"Принтер не отвечает\"",
      "level": 3,
      "content": "Для сетевых принтеров, поскольку CUPS подключается через URI, необходимо убедиться, что в DNS настроен доступ к принтерам по IP. Например, если принтер подключен следующим образом:\n\n```\nlpd://BRN_020554/BINARY_P1\n```\n\nто имя хоста 'BRN_020554' должно соответствовать IP принтера, управляемого сервером CUPS. Если используется Avahi, убедитесь, что разрешение имени хоста Avahi работает.\n\nАльтернативно, замените имя хоста, используемое в URI, IP-адресом принтера.\n\n"
    },
    {
      "title": "Версия PPD не совместима с gutenprint",
      "level": 3,
      "content": "Запустите:\n\n```\n# /usr/bin/cups-genppdupdate\n```\n\nИ перезагрузите CUPS (будет выведено соответствующее сообщение после установки gutenprint).\n\n"
    },
    {
      "title": "Не удается найти принтер",
      "level": 3,
      "content": "Даже если CUPS обнаруживает сетевые принтеры, вы все равно можете получить ошибку \"Не удается найти принтер\" (\"Unable to locate printer\") при попытке распечатать что-либо. Чтобы решить эту проблему, включите .разрешение локального имени хоста Avahi. Для получения дополнительной информации смотрите CUPS (Русский)#Сеть.\n\nЭта проблема может возникать и при использовании файрвола (межсетевой экран, брандмауэр). Возможно, вам придется отключить его или установить корректные правила. Если вы используете system-config-printer для обнаружения сетевых принтеров, тогда он сделает все это автоматически.\n\n"
    },
    {
      "title": "Старый сервер CUPS",
      "level": 3,
      "content": "Начиная с версии CUPS 1.6, клиент по умолчанию использует IPP 2.0. Если сервер использует CUPS <= 1.5 / IPP <= 1.1, клиент не будет автоматически понижать версию протокола и, следовательно, не может связаться с сервером. Обходным путем является добавление опции version=1.1, описанной в Таблице 2. Опции URI IPP.\n\n"
    },
    {
      "title": "Общий принтер работает локально, но удаленный компьютер не печатает",
      "level": 3,
      "content": "Это вызвано тем, что задание на печать отправляется через фильтр дважды, один раз на локальном компьютере и один раз на удаленном. Смотрите также предупреждение на главной странице CUPS.\n\n"
    },
    {
      "title": "Не удается найти файл PPD",
      "level": 3,
      "content": "```\n/var/log/cups/error_log\n```\n\n```\nCannot connect to remote printer ipp://HP079676.local\ncopy_model: empty PPD file\n```\n\nУбедитесь, что Avahi настроен правильно. В частности, проверьте, что nss-mdns установлен и настроен в /etc/nsswitch.conf.\n\n"
    },
    {
      "title": "Конфликт с SANE",
      "level": 3,
      "content": "Если у вас также запущен SANE, возможно, что он конфликтует с CUPS. Чтобы исправить это, создайте правило Udev, обозначающее устройство как совпадающее с libsane:\n\n```\n/etc/udev/rules.d/99-printer.rules\n```\n\n```\nATTRS{idVendor}==\"vendor id(код производителя)\", ATTRS{idProduct}==\"product id(код продукта)\", MODE=\"0664\", GROUP=\"lp\", ENV{libsane_matched}=\"yes\"\n```\n\n"
    },
    {
      "title": "Конфликт с usblp",
      "level": 3,
      "content": "Доступ к USB-принтерам можно получить двумя способами: модулем ядра usblp и libusb. Первый - это классический способ. Это просто: данные отправляются на принтер, записывая их в файл устройства в виде простого последовательного потока данных. Чтение одного и того же файла устройства позволяет использовать двунаправленный доступ, по крайней мере, для таких вещей, как считывание уровней чернил, статуса или информации о возможностях принтера (PJL). Он работает очень хорошо для простых принтеров, но для многофункциональных устройств (принтер/сканер) он не подходит, и производители, такие как HP, поставляют свои собственные бэкенды. Источник: здесь[устаревшая ссылка 2024-11-05 ⓘ].\n\nЕсли у вас возникли проблемы с работой USB-принтера, вы можете попробовать запрет загрузки для модуля ядра usblp:\n\n```\n/etc/modprobe.d/blacklistusblp.conf\n```\n\n```\nblacklist usblp\n```\n\nПользователям кастомного ядра может потребоваться вручную загрузить модуль ядра usbcore, прежде чем продолжить.\n\nПосле установки модулей подключите принтер и проверьте, обнаружило ли его ядро, выполнив следующие действия:\n\n```\n# journalctl -e\n```\n\nили\n\n```\n# dmesg\n```\n\nЕсли вы используете usblp, вывод должен указывать на то, что принтер был обнаружен следующим образом:\n\n```\nFeb 19 20:17:11 kernel: printer.c: usblp0: USB Bidirectional\nprinter dev 2 if 0 alt 0 proto 2 vid 0x04E8 pid 0x300E\nFeb 19 20:17:11 kernel: usb.c: usblp driver claimed interface cfef3920\nFeb 19 20:17:11 kernel: printer.c: v0.13: USB Printer Device Class driver\n```\n\nЕсли вы запретили загрузку usblp, вы увидите что-то вроде:\n\n```\nusb 3-2: new full speed USB device using uhci_hcd and address 3\nusb 3-2: configuration #1 chosen from 1 choice\n```\n\n"
    },
    {
      "title": "USB autosuspend",
      "level": 3,
      "content": "Ядро Linux автоматически приостанавливает USB-устройства, когда есть поддержка драйверов и устройства не используются. Это может сэкономить электроэнергию, но некоторые USB-принтеры считают, что они не подключены, когда ядро приостанавливает USB-порт, предотвращая печать. Это можно устранить, отключив autosuspend для конкретного устройства, для получения дополнительной информации смотрите Power management#USB autosuspend.\n\n"
    },
    {
      "title": "Плохие разрешения",
      "level": 3,
      "content": "Проверьте разрешения USB-порта принтера. Получите номер шины (BUSID) и устройства (DEVID) от lsusb:\n\n```\nlsusb\n```\n\n```\nBus <BUSID> Device <DEVID>: ID <PRINTERID>:<VENDOR> Hewlett-Packard DeskJet D1360\n```\n\nПроверьте владельца, просмотрев devfs:\n\n```\n# ls -l /dev/bus/usb/<BUSID>/<DEVID>\n```\n\nДемон cups запускается от пользователя \"cups\" и относится к группе \"lp\", поэтому либо этому пользователю, либо группе требуется доступ на чтение и запись в USB-устройство. Если вы считаете, что разрешения выглядят неправильно, вы можете временно изменить группу и разрешение:\n\n```\n# chgrp lp /dev/bus/usb/<BUSID>/<DEVID>\n# chmod 664 /dev/bus/usb/<BUSID>/<DEVID>\n```\n\nЗатем проверьте, может ли cups теперь видеть устройство USB правильно.\n\nЧтобы сделать постоянное изменение разрешения, которое будет запускаться автоматически при каждом запуске компьютера, добавьте следующую строку.\n\n```\n/etc/udev/rules.d/10-local.rules\n```\n\n```\nSUBSYSTEM==\"usb\", ATTRS{idVendor}==\"<VENDOR>\", ATTRS{idProduct}==\"<PRINTERID>\", GROUP:=\"lp\", MODE:=\"0664\"\n```\n\nПосле редактирования перезагрузите правила udev этой командой:\n\n```\n# udevadm control --reload-rules\n```\n\nКаждая система может отличаться, поэтому обратитесь к вики-странице udev (Русский)#Список атрибутов устройства.\n\n"
    },
    {
      "title": "Проблемы с HP",
      "level": 2,
      "content": "Смотрите также CUPS/Принтероспецифичные проблемы#HP.\n\n"
    },
    {
      "title": "CUPS: \"/usr/lib/cups/backend/hp failed\"",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nУбедитесь, что dbus установлен и запущен. Если ошибка повторяется, попробуйте запустить avahi-daemon.\n\nПопробуйте добавить принтер в качестве сетевого принтера, используя протокол http:// .\n\n"
    },
    {
      "title": "CUPS: \"Печать завершена\", но принтер не печатает.",
      "level": 3,
      "content": "Это происходит на принтерах HP, когда вы выбираете (старый) драйвер hpijs (например, для Deskjet D1600 series). Вместо этого используйте драйвер hpcups.\n\nНекоторые принтеры HP требуют, чтобы их прошивка загружалась с компьютера при каждом включении принтера. Вы можете столкнуться с этой проблемой, если есть проблема с udev (или аналогом), и правило загрузки прошивки никогда не запускается. В качестве обходного пути вы можете вручную загрузить прошивку на принтер. Убедитесь, что принтер подключен и включен, затем выполните\n\n```\nhp-firmware -n\n```\n\n"
    },
    {
      "title": "CUPS: '\"foomatic-rip\" not available/stopped with status 3'",
      "level": 3,
      "content": "Если, во время использования принтера HP, задания появляются в очереди, но все завершаются со статусом 'остановлен' ('stopped'), а в /var/log/cups/error_log возникает одно из следующих сообщений об ошибках:\n\n```\nFilter \"foomatic-rip\" for printer printer_name not available: No such file or director\n```\n\nили:\n\n```\nPID pid (/usr/lib/cups/filter/foomatic-rip) stopped with status 3!\n```\n\nубедитесь, что hplip установлен.\n\n"
    },
    {
      "title": "CUPS: \"Filter failed\"",
      "level": 3,
      "content": "Ошибка \"filter failed\" может быть вызвана некоторым количеством причин. Журнал ошибок CUPS (по умолчанию /var/log/cups/error_log) должен записывать, какой фильтр не удалось загрузить и почему.\n\n"
    },
    {
      "title": "Отсутствует ghostscript",
      "level": 4,
      "content": "Установите ghostscript (/usr/lib/cups/filter/gstoraster нуждается в его запуске).\n\n"
    },
    {
      "title": "Отсутствует foomatic-db",
      "level": 4,
      "content": "Установите foomatic-db и foomatic-db-ppds. Это помогает в некоторых случаях.\n\n"
    },
    {
      "title": "Avahi не включен",
      "level": 4,
      "content": "Запустите и включите службу avahi-daemon.\n\n"
    },
    {
      "title": "Устаревший плагин",
      "level": 4,
      "content": "Эта ошибка может указывать на то, что плагин устарел (версия несовместима) и может произойти после обновления системы, возможно, появится сообщение Plugin error в журнале (логе). Если вы установили hplip-pluginAUR, вам нужно обновить пакет, иначе перезапустите hp-setup -i, чтобы установить последнюю версию плагина.\n\n"
    },
    {
      "title": "Устаревшая конфигурация принтера",
      "level": 4,
      "content": "Начиная с hplip-pluginAUR версии 3.17.11 hpijs больше не доступен. Если у вас есть принтеры, использующие hpijs, они не будут печатать. Необходимо перенастроить их и выбрать вместо этого новый драйвер hpcups.\n\nВы можете проверить, если это ваш случай, посмотрев в error_log cups`а:\n\n```\n$ grep hpijs /var/log/cups/error_log\n```\n\n```\n...\n D [09/Jan/2018:14:32:58 +0000] [Job 97] sh: hpijs: command not found\n ...\n```\n\n"
    },
    {
      "title": "CUPS: печатает только пустую страницу и страницу с сообщением об ошибке на HP LaserJet",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nСуществует ошибка, которая приводит к сбою CUPS при печати изображений на HP LaserJet (в моем случае 3380). Ошибки были зафиксированы и исправлены в Ubuntu. Первая страница пуста, вторая страница содержит следующее сообщение об ошибке:\n\n```\nERROR:\n invalidaccess\n OFFENDING COMMAND:\n filter\n STACK:\n /SubFileDecode\n endstream\n ...\n```\n\nЧтобы устранить проблему, выполните следующую команду как суперпользователь (root):\n\n```\n# lpadmin -p printer -o pdftops-renderer-default=pdftops\n```\n\n"
    },
    {
      "title": "HPLIP 3.13: Плагин установлен, но HP Device Manager жалуется на его отсутствие",
      "level": 3,
      "content": "Возможно, проблема связана с изменением прав доступа файла, которое было внесено в /var/lib/hp/hplip.state. Чтобы исправить проблему, достаточно простых команд chmod 644 /var/lib/hp/hplip.state и chmod 755 /var/lib/hp. Для получения дополнительной информации, пожалуйста, прочитайте эту ссылку.\n\n"
    },
    {
      "title": "hp-toolbox: \"Unable to communicate with device\"",
      "level": 3,
      "content": "```\n# hp-toolbox\n# error: Unable to communicate with device (code=12): hp:/usb/printer id\n```\n\n"
    },
    {
      "title": "Разрешение проблемы",
      "level": 4,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nМожет потребоваться добавить пользователя в группы lp и sys.\n\n"
    },
    {
      "title": "Виртуальный CDROM у принтеров",
      "level": 4,
      "content": "Это также может быть вызвано принтерами, такими как P1102, которые предоставляют виртуальный привод CD-ROM для драйверов MS Windows. Появляется lp dev, а затем исчезает. В этом случае попробуйте пакеты usb-modeswitch и usb-modeswitch-data, что позволяет отключить \"Smart Drive\" (правила udev, включенные в указанные пакеты).\n\n"
    },
    {
      "title": "Сетевые принтеры",
      "level": 4,
      "content": "Это также может происходить с сетевыми принтерами, использующими динамические имена хостов, если avahi-daemon не запущен. Другая причина заключается в том, что hp-setup не удалось найти принтер, потому что IP-адрес принтера изменился из-за DHCP. Если это так, подумайте о добавлении резервирования DHCP для принтера в конфигурации сервера DHCP.\n\n"
    },
    {
      "title": "hp-setup просит указать PPD-файл для обнаруженного принтера",
      "level": 3,
      "content": "Кроме того, при выборе файла PPD в графическом режиме hp-setup поле не обновляется и сообщение об ошибке не отображается.\n\nИли, если вы используете интерактивный (консольный) режим, можно столкнуться с чем-то похожим на это даже при введении правильного пути к файлу ppd:\n\n```\nPlease enter the full filesystem path to the PPD file to use (q=quit) :/usr/share/ppd/HP/hp-deskjet_2050_j510_series.ppd.gz\n Traceback (most recent call last):\n   File \"/usr/bin/hp-setup\", line 536, in <module>\n     desc = nickname_pat.search(nickname).group(1)\n TypeError: cannot use a string pattern on a bytes-like object\n```\n\nРешение заключается в установке и запуске cups перед запуском hp-setup.\n\n"
    },
    {
      "title": "hp-setup: \"Qt/PyQt 4 initialization failed\"",
      "level": 3,
      "content": "Установите пакет python-pyqt4AUR[ссылка недействительна: package not found], который дополнительно требуется (optdepend) для hplip. Альтернативно вы можете запустить hp-setup с интерфейсом командной строки с помощью флага -i.\n\n"
    },
    {
      "title": "hp-setup: находит принтер автоматически, но сразу после этого сообщает \"Unable to communicate with device\" при печати тестовой страницы",
      "level": 3,
      "content": "Это, по крайней мере, происходит с hplip 3.13.5-2 у принтера HP Officejet 6500A через локальное сетевое соединение. Чтобы решить проблему, укажите IP-адрес принтера HP для hp-setup, чтобы обнаружить принтер.\n\n"
    },
    {
      "title": "hp-setup: \"KeyError: 'family-class'\"",
      "level": 3,
      "content": "Если при добавлении принтера в пользовательском интерфейсе он не работает, или вы получили KeyError: 'family-class' от hp-setup, возможно потребуется обновить вручную /usr/share/hplip/data/models/models.dat.\n\nПроверьте определен ли раздел family-class=Undefined для вашего принтера. Если нет, добавьте это:\n\n```\n/usr/share/hplip/data/models/models.dat\n```\n\n```\n[hp_laserjet_pro_mfp_m225dw]\t\n...\nfamily-class=Undefined\n```\n\n"
    },
    {
      "title": "Низкий уровень чернил",
      "level": 4,
      "content": "При низком уровне чернил некоторые принтеры зависают со статусом \"Рендеринг завершен\" (\"Rendering completed\"), и, если это сетевой принтер, принтер может даже стать недоступным для CUPS, несмотря на то, что он правильно подключен к сети. Замена картриджа (картриджей) с низким уровнем чернил в этом случае вернет принтер в статус \"Готов\" (\"Ready\") и, если он - сетевой принтер, то он станет снова доступным для CUPS.\n\n"
    },
    {
      "title": "Завершение печати из-за ошибок авторизации",
      "level": 3,
      "content": "Если удаленный принтер запрашивает аутентификацию, CUPS автоматически добавит директиву AuthInfoRequired для принтера в /etc/cups/printers.conf. Однако некоторые графические приложения (например, некоторые версии LibreOffice [1]) не имеют возможности запрашивать учетные данные, поэтому печать завершилась с ошибкой. Чтобы исправить это, укажите требуемое имя пользователя и пароль в URI. Для получения дополнительной информации смотрите [2], [3].\n\n"
    },
    {
      "title": "Unknown supported format: application/postscript",
      "level": 3,
      "content": "(Не найдена поддержка формата: application/postscript)\n\nЗакомментируйте строки:\n\n```\napplication/octet-stream        application/vnd.cups-raw        0      -\n```\n\nв /etc/cups/mime.convs и:\n\n```\napplication/octet-stream\n```\n\nв /etc/cups/mime.types.\n\n"
    },
    {
      "title": "Ошибка задания для печати (Print-Job) client-error-document-format-not-supported",
      "level": 3,
      "content": "Попробуйте установить пакет foomatic и используйте драйвер foomatic.\n\n"
    },
    {
      "title": "Не удается получить список драйверов принтера",
      "level": 3,
      "content": "(Также применимо к ошибке \"-1 не поддерживается!\")\n\nПопробуйте удалить драйверы Foomatic или обратитесь к CUPS/Принтероспецифичные проблемы#HPLIP для обходного пути.\n\n"
    },
    {
      "title": "lp: Error - Scheduler Not Responding",
      "level": 3,
      "content": "Если вы получите эту ошибку, убедитесь, что CUPS запущен, переменная окружения CUPS_SERVER не установлена и /etc/cups/client.conf корректный.\n\n"
    },
    {
      "title": "Сообщение об ошибке: \"Using invalid Host\"",
      "level": 3,
      "content": "Попробуйте добавить ServerAlias * в /etc/cups/cupsd.conf.\n\n"
    },
    {
      "title": "Не удается отправить на печать из LibreOffice",
      "level": 3,
      "content": "Если вы можете распечатать тестовую страницу с веб-интерфейса CUPS, но не из LibreOffice, попробуйте установить пакет a2ps.\n\n"
    },
    {
      "title": "Вывод принтера сдвинут",
      "level": 3,
      "content": "По-видимому, это связано с неправильным размером страницы, установленным в CUPS.\n\n"
    },
    {
      "title": "Принтер не работает (приостановлен - \"Paused\") после ошибки",
      "level": 3,
      "content": "Когда во время печати возникает ошибка, принтер в CUPS может перестать отвечать на запросы. lpq сообщает, что принтер is not ready (не готов), его можно активировать с помощью cupsenable. В веб-интерфейсе CUPS принтер отображается как приостановлен - \"Paused\", его можно возобновить с помощью Восстановить печать.\n\nЧтобы CUPS автоматически активировал принтер, измените политику ошибок с стандартной настройки Останавливать принтер (stop-printer) на Повторить задание (retry-this-job).\n\n"
    },
    {
      "title": "Samsung: URF ERROR - Incomplete Session by time out",
      "level": 3,
      "content": "Эта ошибка обычно возникает при печати файлов по сети через IPP на принтерах Samsung и решается с помощью пакета samsung-unified-driverAUR.\n\n"
    },
    {
      "title": "Brother: Принтер печатает несколько копий",
      "level": 3,
      "content": "Иногда принтер печатает несколько копий документа (например, MFC-9330CDW напечатал 10 копий). Решение заключается в обновлении прошивки принтера.\n\n"
    },
    {
      "title": "Обычный пользователь не может изменять настройки принтера или удалять определенные задания",
      "level": 3,
      "content": "Если обычный пользователь должен иметь возможность изменять настройки принтеров или управлять очередью принтера, пользователь может быть добавлен в группу sys.\n\n"
    }
  ]
}