{
  "title": "CUPS (Русский)/Printer sharing (Русский)",
  "url": "https://wiki.archlinux.org/title/CUPS_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)/Printer_sharing_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Samba (Русский)\n- CUPS (Русский)\n\nЭта статья содержит инструкции по совместному использованию принтеров между системами, будь то между двумя системами GNU/Linux или между системой GNU/Linux и Microsoft Windows.\n\n"
    },
    {
      "title": "Создание класса для нескольких принтеров",
      "level": 2,
      "content": "'Класс' в CUPS имеет значение группы. Когда у вас есть несколько принтеров, подключенных к одному серверу CUPS, вы можете захотеть их сбалансировать (задания на печать автоматически помещаются в очередь для разных принтеров). Это также дает преимущество в том, что пользователи на удаленной машине работают с одним 'принтером'. Что особенно полезно, когда один принтер вышел из строя, вы просто исключаете его из класса, но для конечных пользователей ничего не изменится - печать заданий, поставленных на другой принтер сервером CUPS, продолжает обрабатываться. Создание и управление классами можно выполнять из веб-интерфейса CUPS.\n\n"
    },
    {
      "title": "Внутри систем GNU/Linux",
      "level": 2,
      "content": "Сервер можно настраивать с помощью веб-интерфейса или путем ручного редактирования файла /etc/cups/cupsd.conf. Смотрите статью CUPS (Русский) для настройки клиента.\n\n"
    },
    {
      "title": "Использование веб-интерфейса",
      "level": 3,
      "content": "Для доступа к странице администрирования CUPS, откройте в браузере адрес: http://localhost:631.\n\nВ верхней части находится вкладка Администрирование - кликните по ней, нажмите на кнопку добавления принтера, при этом будут автоматически определены подключенные принтеры. Если этого не произойдет, отключите принтер и подключите его снова.\n\nПосле создания принтера зайдите в раздел Сервер и установите флажок напротив \"Разрешить совместный доступ к принтерам, подключенным к этой системе\". После клика по Сохранить, сервер будет перезапущен автоматически.\n\nДля более детальной настройки вы можете отредактировать файл /etc/cups/cupsd.conf, нажав кнопку \"Редактировать конфигурационный файл\". Для получения дополнительной информации смотрите #Ручная настройка.\n\n"
    },
    {
      "title": "Ручная настройка",
      "level": 3,
      "content": "На сервере (тот, который управляет и подсоединён к принтеру) разрешите доступ к серверу, изменив строчки с тэгом Location. Например:\n\n```\n/etc/cups/cupsd.conf\n```\n\n```\n<Location />\n    Order allow,deny\n    Allow localhost\n    Allow 192.168.0.*\n</Location>\n...\n```\n\nТакже убедитесь, что серверу для адресации доступен IP-адрес клиента:\n\n```\n/etc/cups/cupsd.conf\n```\n\n```\n...\nListen <hostname>:631\n...\n```\n\nЕсть другие возможности для настройки, включая автоматические способы, которые детально описаны в Использование сетевых принтеров и cupsd.conf(5).\n\nПосле внесения каких-либо изменений перезапустите службу org.cups.cupsd.\n\nЕсли CUPS запускается с помощью активации сокета, создайте drop-in сниппет для org.cups.cupsd.socket, чтобы активация сокета работала и с удаленными подключениями:\n\n```\n/etc/systemd/system/org.cups.cupsd.socket.d/override.conf\n```\n\n```\n[Socket]\nListenStream=631\n```\n\n"
    },
    {
      "title": "Включение обнаружения",
      "level": 3,
      "content": "Чтобы включить отображение (обнаружение) общего принтера, необходимо установить Avahi и запустить его на сервере. Если вам не нужно обнаружения принтера, тогда Avahi не требуется ни на сервере, ни на клиенте.\n\nЧтобы включить отображение, выберите Показывать общие принтеры, подключенные к этой системе в веб-интерфейсе, или вручную включите Browsing и введите BrowseAddress:\n\n```\n/etc/cups/cupsd.conf\n```\n\n```\n...\nBrowsing On\nBrowseAddress 192.168.0.*:631\n...\n```\n\nзатем перезапустите службу org.cups.cupsd.\n\nОбратите внимание, что \"обнаружение\" на сервере - другая вещь по сравнению с \"обнаружением\" на удаленном сетевом хосте. На сервере печати cupsd предоставляет поддержку протокола DNS-SD, который транслируется avahi-daemon. Служба cups-browsed не нужна на сервере печати за исключением, если будет транслироваться старый протокол CUPS'а, или если сервер печати также будет \"обнаруживать\" другие сетевые принтеры. На удаленном сетевом хосте служба cups-browsed требуется для \"обнаружения\" сетевой трансляции служб печати, а также запущенная служба cups-browsed будет автоматически запускать cupsd.\n\nСлужба org.cups.cupsd.service запускается автоматически при подключении USB-принтера, но это может быть не так для других типов подключений. Если cupsd не запущен, тогда avahi-daemon не транслирует службу печати, поэтому в этом случае service-файл юнита systemd должен быть изменен при запуске во время загрузки, а затем служба снова должна быть \"включена/установлена\" с новой зависимостью. Чтобы сделать это, отредактируйте раздел файла службы [Install], добавив зависимость WantedBy=default.target, а затем включите и запустите службу org.cups.cupsd.service.\n\n"
    },
    {
      "title": "Сервер Linux - клиент Windows",
      "level": 3,
      "content": "Общий доступ для клиентов Windows может быть достигнут, используя #Общий доступ с помощью Bonjour, #Общий доступ с помощью IPP или #Общий доступ с помощью Samba.\n\nПосле настройки сервера установите драйвера для принтера на компьютере под управлением Windows. Если принтер сервера CUPS настроен на использование собственных драйверов вместо raw (raw - когда cups просто передает на принтер полученное задание для печати без какой-либо обработки), вы можете просто выбрать общий драйвер postscript для клиента Windows (например, 'HP Color LaserJet 8500 PS' либо 'Xerox DocuTech 135 PS2', либо 'Microsoft PS Class driver').\n\n"
    },
    {
      "title": "Общий доступ с помощью Bonjour",
      "level": 4,
      "content": "Службы печати Bonjour позволяет клиентам Windows легко подключаться к серверам печати Unix с включенным обнаружением.\n\n"
    },
    {
      "title": "Общий доступ с помощью IPP",
      "level": 4,
      "content": "Internet Printing Protocol является широко поддерживаемым стандартом среди операционных систем, который также прост в настройке. Он имеет функцию переадресации портов, туннелирования и т.д.\n\nСначала, настройте сервер как описано в разделе #Внутри систем GNU/Linux.\n\nНа компьютере с Windows, перейдите в Панель управления > Просмотр устройств и принтеров и выберите в контекстном меню 'Добавить принтер'. Если у вас Windows 10, нажмите кнопку \"Принтер, который я хочу, не указан\". Далее, выберите 'Выбрать общий принтер по имени' и тип расположения принтера:\n\n```\nhttp://hostname:631/printers/printer_name\n```\n\n(Где hostname - это имя хоста или IP-адрес сервера GNU/Linux, а printer_name - это имя подключенного принтера. Вы также можете использовать полное доменное имя сервера, если оно есть, но вам может потребоваться установить ServerAlias my_fully_qualified_domain_name в /etc/cups/cupsd.conf, чтобы это заработало).\n\nNote: **исключения** \n\n- Диалоговое окно 'Добавить принтер' в Windows предлагает формат http://computername/printers/printername/.printer, который Windows не примет. Вместо этого используйте синтаксис, предложенный выше.\n- Если вы используете прокси, тщательно проверяйте все использованные прокси исключения. Неправильная настройка здесь может привести к невозможности добавления принтера до следующей перезагрузки, даже если вы отключите прокси-сервер после этого (по крайней мере, в Windows 7).\n\n"
    },
    {
      "title": "Общий доступ с помощью Samba",
      "level": 4,
      "content": "Samba - реализация протокола обмена файлами Windows и принтерами, даже самых старых.\n\nОбратите внимание, что общий доступ с помощью Samba обычно более сложный для настройки и сопровождения.\n\nДля настройки Samba на сервере Linux, отредактируйте файл /etc/samba/smb.conf, это даст возможность предоставить общий доступ к принтерам. Файл smb.conf может содержать примерно следующее:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\nworkgroup=Heroes\nserver string=Arch Linux Print Server\nsecurity=user\n\n[printers]\n    comment=All Printers\n    path=/var/spool/samba\n    browseable=yes\n    # разрешите это, чтобы пользователь 'гостевой учетной записи' мог пользоваться печатью.\n    guest ok=no\n    writable=no\n    printable=yes\n    create mode=0700\n    write list=@adm root ваше_имя_пользователя\n```\n\nЭтого должно быть достаточно для организации совместного доступа, но все-таки рекомендуется добавить для принтера отдельную запись:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[ML1250]\n    comment=Samsung ML-1250 Laser Printer\n    printer=ml1250\n    path=/var/spool/samba\n    printing=cups\n    printable=yes\n    printer admin=@admin root ваше_имя_пользователя\n    user client driver=yes\n    # разрешите это, чтобы пользователь 'гостевой учетной записи' мог пользоваться печатью.\n    guest ok=no\n    writable=no\n    write list=@adm root ваше_имя_пользователя\n    valid users=@adm root ваше_имя_пользователя\n```\n\nУчтите, что при таких настройках, должна существовать учетная запись с правами доступа к принтеру. Для публичного принтера установите guest ok в yes, и удалите строку valid users. Для добавления учетных записей, создайте действующую учетную запись GNU/Linux, а затем установите на Samba-сервере пароль. Например:\n\n```\n# useradd ваше_имя_пользователя\n# smbpasswd -a ваше_имя_пользователя\n```\n\nЗатем перезапустите демон Samba:\n\nЕстественно, имеется множество дополнительных настроек сервера печати Samba, поэтому, для получения дополнительной информации, следует обратиться к справочной документации Samba и CUPS. Образцы и примеры можно посмотреть в файле smb.conf.example.\n\n"
    },
    {
      "title": "Сервер Windows - клиент Linux",
      "level": 3,
      "content": "Note: Например:\n\nНапример:\n\nsmb://BEN-DESKTOP/HP Color LaserJet CP1510 series PCL6\n\nстанет:\n\nsmb://BEN-DESKTOP/HP%20Color%20LaserJet%20CP1510%20series%20PCL6\n\nТакая строка может быть получена в результате выполнения следующей команды:\n\n```\n$ python -c 'from urllib.parse import quote; print(\"smb://\" + quote(\"BEN-DESKTOP/HP Color LaserJet CP1510 series PCL6\"))'\n```\n\n"
    },
    {
      "title": "Общий доступ с помощью LPD",
      "level": 4,
      "content": "В Windows 7, 8 и 10 имеется интегрированный LPD-сервер, то, возможно, будет намного проще использовать именно его, поскольку не придется для клиента устанавливать Samba, а на сервере - можно будет обойтись без сложных настроек. Это можно включить в разделе Службы печати и документов, находящего в Панель управления -> Программы -> Включение или отключение компонентов Windows. В свойствах принтера должен быть включен общий доступ. Используйте общее имя без особых символов, таких как пробел, запятые и др.\n\nЗатем, принтер можно будет добавить в CUPS просто выбрав протокол LPD. Адресс принтера будет выглядеть следующим образом:\n\n```\n# lpd://windowspc/имя_общего_принтера\n```\n\nПеред добавлением вам, скорее всего, понадобиться установить для своей модели принтера соответствующий драйвер. Драйвера Generic PostScript или RAW тоже должны работать.\n\n"
    },
    {
      "title": "Общий доступ с помощью IPP",
      "level": 4,
      "content": "Как и в предыдущем случае, для организации общего доступа к принтерам протокол IPP является предпочтительным, но он работает только с версиями Windows Server. Версия Windows Server (например Server 2016) включаюет поддержку IPP (функции \"Службы печати и документов\", служба \"Интернет-печати\"). Клиентские версии (например, Windows 10) включают поддержку только клиента IPP и не поддерживают совместный доступ через IPP.\n\n"
    },
    {
      "title": "Общий доступ с помощью Samba",
      "level": 4,
      "content": "Гораздо проще использовать стандартные возможности Windows по предоставлению общего доступа к принтерам с помощью Samba. Ручная настройка практически не требуется и все можно выполнить через бэкенд CUPS. Однако, как было замечено выше, в Windows могут возникнуть проблемы с аутентификацией и ограничением доступа.\n\nНа стороне сервера необходимо разрешить общий доступ к принтеру и убедится, что клиентские машины имеют к этому принтеру доступ.\n\nВ следующем разделе будут описаны настройки клиента с обоими (cupsd и smbd) запущенными демонами.\n\nSamba CUPS бэк-енд должен быть включен по умолчанию, но если этого не происходит - введите следующую команду и перезапустите CUPS.\n\n```\n# ln -s $(which smbspool) /usr/lib/cups/backend/smb\n```\n\nЗатем, просто зайдите в веб-интерфейс CUPS и добавьте новый принтер. В качестве устройства выберите \"Windows Printer via SAMBA\".\n\nДля местоположения устройства, выберите:\n\n```\nsmb://имя_пользователя:пароль@имя_хоста/имя_принтера\n```\n\nИли, если пароля нет:\n\n```\nsmb://имя_пользователя@имя_хоста/имя_принтера\n```\n\nУбедитесь, что пользователь действительно имеет доступ к принтеру на компьютере Windows, и выберите соответствующие драйверы. Если компьютер находится в домене, убедитесь, что в имени пользователя присутствует домен:\n\n```\nsmb://имя_пользователя:пароль@домен/имя_хоста/имя_принтера\n```\n\nПри ручной настройке: остановите демон CUPS и добавьте свой принтер в /etc/cups/printers.conf, который, к примеру, может выглядеть так:\n\n```\n/etc/cups/printers.conf\n```\n\n```\n<DefaultPrinter MyPrinter>\nAuthInfoRequired username,password\nInfo My printer via SAMBA\nLocation In my Office\nMakeModel Samsung ML-1250 - CUPS+Gutenprint v5.2.7        # <= для получения списка доступных моделей запустить 'lpinfo -m'\nDeviceURI smb://username:password@hostname/printer_name   # <= URI сервера, выбирать согласно описания в предыдущем разделе\nState Idle\nType 4\nAccepting Yes\nShared No\nJobSheets none none\nQuotaPeriod 0\nPageLimit 0\nKLimit 0\nAllowUser yourusername                                    # <= не забудьте изменить это\nOpPolicy default\nErrorPolicy stop-printer\n</Printer>\n```\n\nПерезапустите демон CUPS и распечатайте тестовую страницу.\n\nИногда имя хоста Windows (усеченно) меньше предстоящего точного URI устройства (расположение устройства) (Sometimes Windows is a little less than forthcoming about exact device URIs (device locations)). Если возникли проблемы с указанием правильного расположения устройства в CUPS, выполните следующую команду, чтобы вывести список всех общих ресурсов, доступных для определенного имени пользователя windows:\n\n```\n$ smbtree -U имя_пользователя_windows\n```\n\nВ этом списке будет отображаться только общие URI для определенного имени пользователя Windows в локальной подсети локальной сети, если Samba настроен и работает правильно. Команда должна вернуть что-то вроде этого:\n\n```\nWORKGROUP\n\t\\\\REGULATOR-PC   \t\t\n\t\t\\\\REGULATOR-PC\\Z              \t\n\t\t\\\\REGULATOR-PC\\Public         \t\n\t\t\\\\REGULATOR-PC\\print$         \tPrinter Drivers\n\t\t\\\\REGULATOR-PC\\G              \t\n\t\t\\\\REGULATOR-PC\\EPSON Stylus CX8400 Series\tEPSON Stylus CX8400 Series\n```\n\nЗдесь требуется первая часть последней строки - ресурс, соответствующий описанию принтера. Поэтому для печати на принтер EPSON Stylus введите:\n\n```\nsmb://имя_пользователя:пароль@REGULATOR-PC/EPSON%20Stylus%20CX8400%20Series\n```\n\nкак URI в CUPS.\n\n"
    },
    {
      "title": "Удаленное управление",
      "level": 2,
      "content": "Однажды сервер настроенный, как описано в #Внутри систем GNU/Linux, может также быть настроенным так, чтобы им можно было управлять удаленно. Добавьте разрешенные хосты в блок <Location /admin> в /etc/cups/cupsd.conf, используя тот же синтаксис, что и в #Ручная настройка. Обратите внимание, что доступны три уровня доступа:\n\n```\n<Location />           #доступ к серверу\n<Location /admin>\t#доступ к страницам администратора\n<Location /admin/conf>\t#доступ к файлам конфигурации\n```\n\nЧтобы дать удаленным хостам доступ к одному из этих уровней, добавьте оператор Allow в этот уровень. Оператор Allow может принимать одну или несколько форм, перечисленных ниже:\n\n```\nAllow from all\nAllow from host.domain.com\nAllow from *.domain.com\nAllow from ip-address\nAllow from ip-address/netmask\nAllow from @LOCAL\n```\n\nОтрицательный оператор также может быть использован. Например, чтобы предоставить полный доступ ко всем хостам на локальных сетевых интерфейсах, отредактируйте /etc/cups/cupsd.conf:\n\n```\n# Ограничить доступ к серверу...\n# По умолчанию возможны только локальные подключения\n<Location />\n   Order allow,deny\n   Allow from @LOCAL\n</Location>\n\n# Ограничить доступ к страницам администратора...\n<Location /admin>\n   Order allow,deny\n   Allow from @LOCAL\n</Location>\n\n# Ограничить доступ к файлам конфигурации...\n<Location /admin/conf>\n   AuthType Basic\n   Require user @SYSTEM\n   Order allow,deny\n   Allow from @LOCAL\n</Location>\n```\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nВам также может потребоваться добавить:\n\n```\nDefaultEncryption Never\n```\n\nЭто должно помочь избежать ошибки: 426 - Upgrade Required when using the CUPS web interface from a remote machine.\n\n"
    },
    {
      "title": "Kerberos",
      "level": 3,
      "content": "Kerberos может использоваться для аутентификации пользователей, обращающихся к удаленному серверу CUPS. Это предполагает, что на вашем компьютере есть keytab, и ему понадобится билет для \"HTTP\". Вместо этого http://localhost:631 вы должны использовать https://host.example.co.uk:631 т.к. требуется шифрование для auth (следовательно, https), и требуется полное имя хоста, чтобы Kerberos/Negotiate могли работать. Кроме того, сервер должен быть настроен в /etc/cups/cupsd.conf, чтобы использовать DefaultAuthType Negotiate.\n\nЕсли вы используете поддержку NSS в Samba winbind, вы можете добавить имя группы AD в /etc/cups/cups-files.conf - в следующем примере sysadmin может быть группой AD:\n\n```\nSystemGroup sys root sysadmin\n```\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Общие советы по устранению неполадок смотрите в CUPS/Решение проблем.\n\n"
    },
    {
      "title": "Не удается отправить на печать из приложений GTK",
      "level": 3,
      "content": "Если ты получил сообщение getting printer information failed (ошибка получения информации о принтере), когда пытался отправить на печать из приложения GTK, тогда добавь эту строку в свой /etc/hosts:\n\n```\n# serverip \tsome.name.org \tServersHostname\n```\n\n"
    },
    {
      "title": "Ошибки разрешений в Windows",
      "level": 3,
      "content": "Некоторые пользователи исправили ошибки 'NT_STATUS_ACCESS_DENIED' (Windows клиенты), используя несколько иной синтаксис:\n\n```\nsmb://рабочая_группа/имя_пользователя:пароль@имя_хоста/имя_принтера\n```\n\n"
    },
    {
      "title": "Другие операционные системы",
      "level": 2,
      "content": "Более подробную информацию о взаимодействии CUPS с другими системами печати можно найти в руководстве CUPS, например, на http://localhost:631/help/network.html\n\n"
    }
  ]
}