{
  "title": "CURL (Русский)",
  "url": "https://wiki.archlinux.org/title/CURL_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "cURL — инструмент командной строки и библиотека для передачи данных с URL-адресов. Команда поддерживает многие протоколы, включая HTTP, HTTPS, FTP, SCP и SFTP. Он также разработан для использования без взаимодействия пользователя, как в скриптах.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет curl.\n\n"
    },
    {
      "title": "Скачивание",
      "level": 3,
      "content": "Частое использование cURL — это скачивание ресурса к определённому файлу:\n\n```\n$ curl -o название файла URL\n```\n\nЕсли URL содержит название файла, Вы можете сохранить ресурс прямо к файлу с тем же названием:\n\n```\n$ curl -O URL\n```\n\nАналогично Вы можете использовать -J для принятия подсказок от HTTP-сервера (из заголовка Content-Disposition) для названия файла. В сочетании с -O curl будет использовать название файла, предоставленное в URL, если HTTP-сервер не возвращает подсказку на имя файла в его ответе.\n\nАльтернативно Вы можете вывести ресурс в stdout, опустив параметры вывода:\n\n```\n$ curl URL\n```\n\n"
    },
    {
      "title": "POST HTTP",
      "level": 3,
      "content": "Вы можете использовать cURL для создания POST HTTP-запросов:\n\n```\n$ curl -d 'тело запроса' URL\n```\n\nЕсли тело запроса не может быть вставлено в командную строку, cURL может его прочитать с файла:\n\n```\n$ curl -d @название файла URL\n```\n\nИногда Вам понадобиться указать пользовательское значение для заголовка Content-Type (по умолчанию значение cURL — application/x-www-form-urlencoded). Вы можете это сделать с помощью -H. Например, если Вы хотите сделать POST-запрос с JSON-телом:\n\n```\n$ curl -d 'json-тело' -H 'Content-Type: application/json' URL\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Wikipedia:ru:cURL\n- Everything curl — расширенное руководство по использованию cURL\n- curl(1)\n\n"
    }
  ]
}