{
  "title": "D (Español)",
  "url": "https://wiki.archlinux.org/title/D_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-12** \n\nDe Wikipedia: D (lenguaje de programación)\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Para programar en D necesita dos cosas: un compilador de D y una librería. La forma más sencilla de comenzar rápidamente es instalar el grupo de paquetes dlang-dmd. Proporcionará el compilador oficial (dmd), la librería estándar libphobos y dtools, una colección de pequeñas herramientas de desarrollo.\n\n"
    },
    {
      "title": "Probando la instalación",
      "level": 2,
      "content": "Para asegurarse de que todo está instalado y configurado correctamente, un simple Hello World debería ser suficiente.\n\n```\nimport std.stdio;\n\nvoid main() {\n   string yourName = \"archer\";\n   writefln(\"Hello %s!\", yourName);\n}\n```\n\nPegue el código en un archivo, llámelo hello.d y ejecute:\n\n```\n$ dmd hello.d\n```\n\nen el mismo directorio que el archivo. Entonces debería poder ejecutar el programa con:\n\n```\n$ ./hello\n```\n\nTambién puede ejecutar\n\n```\n$ dmd -run hello.d\n```\n\nque simplemente compilará y ejecutará sin dejar ningún archivo de objeto en el directorio.\n\n"
    },
    {
      "title": "Consideraciones",
      "level": 2,
      "content": "Sin embargo, hay distintas opciones posibles con respecto al compilador que elija. La implementación de referencia es dmd, pero gcc-d (interfaz D para GCC) y ldc (LLVM D Compiler) también son populares.\n\nA partir de abril de 2017 el backend de dmd ahora es FOSS (Boost-licensed). Los 3 compiladores comparten el mismo código de front-end y, por lo tanto, tienen soporte casi idéntico para las características del lenguaje (asumiendo la misma versión de front-end).\n\n"
    },
    {
      "title": "Librerías y enlaces útiles",
      "level": 2,
      "content": "- DDT - Complemento \"Eclipse\" para la gestión de proyectos y código en D\n- Mono-D - MonoDevelop complemento para la programación en D\n- QtD - enlaces Qt para D\n- GtkD - Un wrapper GTK orientado a objetos para D\n- Derelict - Enlaces para librerías multimedia, enfocadas hacia el desarrollo de juegos\n- Deimos - Proyecto que alberga muchos enlaces a diferentes librerías de C\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Phobos GitHub repository\n- The D Programming Language - Página web oficial de D\n- Planet D - Una colección de blogs sobre D\n- D Wiki\n\n"
    }
  ]
}