{
  "title": "D (Português)",
  "url": "https://wiki.archlinux.org/title/D_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "De Wikipedia:D (programming language):\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Para programar em D, você precisará de duas coisas - um compilador D e uma biblioteca. A maneira mais fácil de começar rapidamente é instalar o grupo de pacotes dlang-dmd. Ele fornecerá o compilador oficial (dmd), a biblioteca padrão libphobos e o dtools, uma coleção de pequenas ferramentas de desenvolvimento.\n\n"
    },
    {
      "title": "Testando a instalação",
      "level": 2,
      "content": "Para garantir que tudo esteja instalado e configurado corretamente, um programa simples de \"Olá mundo\" deve ser suficiente.\n\n```\nimport std.stdio;\n\nvoid main() {\n   string seuNome = \"archer\";\n   writefln(\"Olá, %s!\", seuNome);\n}\n```\n\nCole o código em um arquivo, nomeie-o como hello.d e execute:\n\n```\n$ dmd hello.d\n```\n\nno mesmo diretório que o arquivo. Você deve ser capaz de executar o programa com:\n\n```\n$ ./hello\n```\n\nVocê também pode executar\n\n```\n$ dmd -run hello.d\n```\n\nque simplesmente compila e executa sem deixar nenhum arquivo de objeto no diretório.\n\n"
    },
    {
      "title": "Considerações",
      "level": 2,
      "content": "No entanto, existem opções possíveis em relação ao compilador escolhido. A implementação de referência é o dmd, mas ldc (LLVM D Compiler) também está disponível.\n\nA partir de abril de 2017 , o back-end do dmd agora é FOSS (licenciado pelo Boost). Todos os compiladores compartilham o mesmo código de front-end e, portanto, têm suporte quase idêntico aos recursos da linguagem (assumindo a mesma versão de front-end).\n\n"
    },
    {
      "title": "Bibliotecas e bindings úteis",
      "level": 2,
      "content": "- DDT - Plugin do Eclipse para projeto e gerenciamento de código em D\n- Mono-D - Complemento de MonoDevelop para programar em D\n- QtD - Bindings Qt para D\n- GtkD - Uma interface GTK orientada a objeto para D\n- Derelict - Bindings para bibliotecas de multimídias, com foco em desenvolvimento de jogo\n- Deimos - Um projeto que engloba vários bindings para diferentes bibliotecas C\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Repositório GitHub do Phobos\n- The D Programming Language - A página oficial do D\n- Planet D - Uma coleção de blogs sobre D\n\n"
    }
  ]
}