{
  "title": "Dark mode switching (Русский)",
  "url": "https://wiki.archlinux.org/title/Dark_mode_switching_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Приятно иметь возможность переключения между светлой и тёмной темой. Существуют варианты переключения по заходу солнца или по сочетанию клавиш.\n\nПереключение тем может быть произведено как для запущенных программ (возможно, требуется работа демона), так и для программ ещё не запущенных. В статье рассматривается переключение для запущенных программ.\n\nДля переключения требуется поддержка от приложения или использование приложением GTK или Qt.\n\n"
    },
    {
      "title": "Инструменты",
      "level": 2,
      "content": "- darkman — Инструмент, позволяющий автоматизировать переход в тёмную тему на закате и возврат к светлой теме на восходе. Он позволяет разместить drop-in скрипты, которые будут автоматически выполняться в нужное время.\n\n- Yin-Yang — Другой инструмент с похожими возможностями, однако запуск произвольных скриптов ещё не поддерживается.\n\n"
    },
    {
      "title": "GTK",
      "level": 3,
      "content": "Для переключения между светлым и тёмным вариантами нужно менять используемую тему.\n\nБольшинство тем GTK имеют тёмный вариант, обычно они обозначены суффиксом -dark. Например, стандартная тема для GTK называется Adwaita, а тёмный вариант называется Adwaita-dark.\n\nЧтобы постоянно использовать только тёмный вариант, смотрите GTK (Русский)#Вариант тёмной темы.\n\nЧтобы мгновенно сменить тему уже работающих приложений, требуется или демон, предоставляющий xsettings spec, или gsettings. Для окружений, работающих в Xorg нужен демон xsettings. Для Wayland нужен gsettings.\n\n"
    },
    {
      "title": "Демон xsettings",
      "level": 4,
      "content": "xsettings нужен для сеансов Xorg.\n\nДемон xsettings для Xfce — xfsettingsd, доступен в пакете xfce4-settings.\n\nПолучить текущую используемую тему:\n\n```\n$ xfconf-query -c xsettings -p /Net/ThemeName\n```\n\nУстановить тему:\n\n```\n$ xfconf-query -c xsettings -p /Net/ThemeName -s \"new-theme\"\n```\n\nИзменения применяются мгновенно и влияют на все приложения, использующие GTK.\n\n"
    },
    {
      "title": "gsettings",
      "level": 4,
      "content": "gsettings нужен для сеансов Wayland.\n\nПолучить текущую используемую тему:\n\n```\n$ gsettings get org.gnome.desktop.interface gtk-theme\n```\n\nУстановить тему:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme \"new-theme\"\n```\n\nИзменения применяются мгновенно и влияют на все приложения, использующие GTK.\n\n"
    },
    {
      "title": "Qt",
      "level": 3,
      "content": "Qt имеет механизм поддержки тем, похожий на GTK.\n\nОдин из вариантов — использовать GTK для стилизации Qt-приложений. Тогда изменение темы GTK повлияет и на Qt-приложения тоже.\n\nДругой способ — использовать родную тему Qt, например adwaita-qt5AUR. Для переключения тем смотрите Qt (Русский)#Настройка приложений Qt 5 в средах, отличных от KDE Plasma.\n\n"
    },
    {
      "title": "Xfce",
      "level": 3,
      "content": "Смена темы в Xfce происходит похожим образом через xsettingsd, который распространяется в виде пакета xfce4-settings.\n\n"
    },
    {
      "title": "Firefox",
      "level": 3,
      "content": "Firefox автоматически подхватывает текущую тему GTK и адаптирует свой интерфейс. Смотрите раздел Firefox (Русский)#Тёмные темы, чтобы узнать больше.\n\nДля изменения темы веб-страниц в магазине расширений Firefox рекомендуется расширение Dark Reader.\n\n"
    },
    {
      "title": "Thunderbird",
      "level": 3,
      "content": "Thunderbird применяет текущую тему GTK, но рекомендуются некоторые самостоятельные действия.\n\nСмотрите Thunderbird (Русский)#Установка темы.\n\n"
    },
    {
      "title": "Visual Studio Code",
      "level": 3,
      "content": "Для Visual Studio Code может пригодиться этот скрипт.\n\n"
    },
    {
      "title": "Alacritty",
      "level": 3,
      "content": "Alacritty поддерживает множество тем. Примеры конфигурации можно найти на странице color schemes на вики в GitHub репозитории проекта. Например, известная в IDEA тема Darkula есть в разделе Dracula на этой же странице.\n\nЧтобы быстро сменить тему, требуется определить указатель для каждой цветовой схемы. Например, укажите &black после названия. После этого просто выполните colors: *black. Изменение в файле конфигурации применится мгновенно и затронет все запущенные экземпляры. Если нет, то, возможно, понадобится прописать live_config_reload: true.\n\nГраницы окна и тайтлбар подчиняются теме GTK, но можно форсировать собственное поведение, установив настроку gtk_theme_variant в положение None.\n\n"
    }
  ]
}