{
  "title": "DAViCal",
  "url": "https://wiki.archlinux.org/title/DAViCal",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Radicale\n\nDAViCal is a server implementing the CalDAV and CardDAV protocol. It is solely a server, with minimal direct user interaction, instead relying on using CalDav clients, such as Apple's iCal.app, iOS (iPhone, iPad, iPod), Thunderbird with Sunbird, or Evolution.\n\n"
    },
    {
      "title": "Installing pre-requisites",
      "level": 3,
      "content": "DAViCal is written in PHP and uses the PostgreSQL database as its backend to store the calendar information. Currently it only supports PostgreSQL, but there is work to support other databases as well.\n\nInstall davicalAUR, postgresql, php, and php-pgsql.\n\nThe installation directories are defined by Web application package guidelines and are slightly different than upstream documentation (/usr/share/webapps/davical and /etc/webapps/davical).\n\nDAViCal is a web application, and therefore you need a web server set up as well. Here Nginx will be assumed, but DAViCal can run on nearly any web server (some may stop processing requests when they see the CalDAV HTTP headers, and therefore DAViCal will not be able to see them).\n\n"
    },
    {
      "title": "Preparing PostgreSQL",
      "level": 3,
      "content": "First of all, you should set up PostgreSQL so it can start up by following PostgreSQL#Installation.\n\nDAViCal requires two independent accounts to be set up, one for accessing the database from the web application, which will be limited in power, and another that will be used for administrating the DAViCal related tables.\n\nIn order to do so, you will need to edit /var/lib/postgres/data/pg_hba.conf:\n\nAdd the following lines:\n\n```\nlocal   davical         davical_app                             trust\n   local   davical         davical_dba                             trust\n```\n\nMake sure that you have a 'root' role in your database. If you do not, create it by becoming the postgres user as described on PostgreSQL page and execute the following:\n\n```\n$ createuser -s -U postgres --interactive\n$ Enter name of role to add: root\n```\n\nPrepare database by running create-database.sh script as root:\n\n```\n# /usr/share/webapps/davical/dba/create-database.sh\n```\n\nThen run createdb as root:\n\n```\n# createdb\n```\n\nIf your PostgreSQL server is on a remote host, use DAViCal PostgreSQL_Config instead of the instructions above.\n\n"
    }
  ]
}