{
  "title": "DDNet (Português)",
  "url": "https://wiki.archlinux.org/title/DDNet_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "DDNet, como é popularmente conhecido, é um jogo de plataforma de rolagem lateral, apresentando armamento e uma jogabilidade cooperativa, e é um mod de Teeworlds. O nome do jogo vem de \"Dummy Drag Race Network\", já que foi baseado no DDRace.\n\nDo site oficial ddnet.tw (tradução nossa):\n\nVocê controla um tee, um personagem 2D em forma de bola, usando seu teclado e mouse para atirar, enganchar e pular para interagir com outros jogadores e o ambiente no mapa com a linha de chegada como alvo.\n\nO jogo funciona em um modelo cliente-servidor, onde o usuário joga usando um cliente que se conecta a um servidor local ou remoto. Como o DDNet tem servidores oficiais, você provavelmente só iniciará o Cliente e jogará online.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale ddnetAUR. Alternativamente, você pode instalar sua versão de desenvolvimento ddnet-gitAUR.\n\n"
    },
    {
      "title": "Skins opcionais",
      "level": 3,
      "content": "Instale ddnet-skinsAUR[link quebrado: package not found].\n\nEste pacote fornece todos os skins do DDNet Skin Database (banco de dados de skins do DDNet) para o seu cliente, então você pode escolher entre muitos skins para jogar com um tee extravagante. No entanto, isso não afetará nada na jogabilidade.\n\nEstes skins são instalados em /usr/share/ddnet/data/skins/.\n\nObserve que outros jogadores só verão o skin escolhida se também tiverem ele instalado e, do contrário, verão o skin padrão amarelada. Portanto, isso pode acontecer com as skins deste pacote ou qualquer outra skin que você modificar ou criar.\n\n"
    },
    {
      "title": "Mapas offline",
      "level": 3,
      "content": "Instale ddnet-maps-gitAUR.\n\nEste pacote fornece todos os mapas jogáveis do repositório ddnet-maps com arquivos de configuração padrão para executar um servidor DDNet offline. Assim, uma vez instalado, facilita a execução de um servidor offline.\n\nTer esses mapas offline é benéfico para o cliente e para o servidor:\n\n- Os clientes não precisarão baixar os mapas já instalados por este pacote. Apenas novas versões de mapas instalados (raramente acontece) ou novos mapas serão baixados para o diretório do usuário (Veja #Arquivo e diretório para configurações de usuário.\n- Os servidores podem usar os mapas e arquivos de configuração fornecidos para serem executados sem que o administrador do servidor tenha que perder tempo criando configurações para eles; veja #Servidor para mais informações.\n\n"
    },
    {
      "title": "Jogar",
      "level": 2,
      "content": "Para jogar DDNet, execute o comando\n\n```\n$ DDNet\n```\n\nou execute o arquivo .desktop fornecido no pacote (por exemplo, no GNOME, procure por \"ddnet\" no panorama de atividades)\n\nÉ muito simples — todas as configurações do usuário (seleção de skin, vídeo, controles etc.) podem ser feitas a partir da GUI do cliente DDNet.\n\nNenhuma configuração de servidor é necessária; se você deseja configurar um servidor local, consulte #Servidor.\n\nAlém disso, algumas ferramentas extras — das quais você provavelmente não precisará — estão disponíveis em /usr/lib/ddnet/tools/. Veja #Ferramentas extras.\n\n"
    },
    {
      "title": "Tipos de jogo",
      "level": 3,
      "content": "Tipos de jogos (também conhecidos como modos de jogo, \"gametypes\" ou \"game types\") são maneiras diferentes de jogar jogos do tipo Teeworlds (DDNet incluído!) E maneiras diferentes de explorar seus recursos (por exemplo, física, armas matam ou simplesmente empurram outros jogadores, etc.).\n\nNo painel principal do cliente DDNet, várias instâncias do servidor são listadas (não apenas DDNet), cada uma é iniciada com apenas um tipo de jogo. Para jogar um tipo de jogo, você deve entrar na instância do servidor que tem o tipo de jogo desejado (por exemplo, você deseja jogar \"ctf\", você deve procurar e entrar em uma instância do servidor \"ctf\")\n\nVeja abaixo uma lista não exaustiva com o nome e uma explicação dos tipos de jogos que podem ser encontrados nos servidores oficiais da DDNet (embora existam muitos mais).\n\n"
    },
    {
      "title": "Tipos de jogo DDNet",
      "level": 4,
      "content": "Estes são os tipos de jogo oficiais do DDNet, mantidos pelo DDNet. Isso significa que os mapas desses tipos de jogos são armazenados e disponibilizados no repositório de mapas da DDNet. Isso também significa que a equipe de teste executa alguns testes antes de os mapas serem adicionados ao repositório e publicados.\n\nAlguns deles podem exigir uso do DDNet Client devido aos recursos (por exemplo, \"tee\" dummy, formação de equipes, combinações de teclas específicas) que este cliente fornece, mas outros podem ser jogados com outros clientes, como Teeworlds.\n\nO objetivo desses mapas, salvo quando mencionado de outra forma abaixo, é superar obstáculos e outras dificuldades do mapa, enquanto se ajudam mutuamente, a fim de alcançar a linha de chegada do mapa.\n\nEste conjunto de tipos de jogos consiste em:\n\n- novice – Os mapas colaborativos mais fáceis podem ser encontrados aqui. Os novatos devem começar aqui.\n- moderate – Mapas colaborativos de nível moderado para usuários mais experientes.\n- brutal – Mapas colaborativos difíceis para usuários muito experientes.\n- insane – Mapas colaborativos incrivelmente difíceis para usuários incrivelmente experientes.\n- solo – Jogue sozinho o mapa inteiro, sem nenhum dummy ou qualquer interação física com os usuários (mas você pode conversar com outros jogadores)\n- ddmax – Mapas de DDracemaX, um dos primeiros mod de corrida e muito popular. Este projeto foi descontinuado, então DDNet adotou[1] seus mapas e os disponibilizou nos servidores oficiais. Veja [2] para mais informações sobre este tipo de jogo.\n- dummy – Mova seu dummy até a linha de chegada, de forma colaborativa ou solo, dependendo do mapa.\n- oldschool – Alguns mapas antigos para deixar os jogadores de longa data nostálgicos.\n- race – Alcance a linha de chegada o mais rápido que puder em uma corrida solo.\n\n"
    },
    {
      "title": "Tipos de jogo vanilla",
      "level": 4,
      "content": "Os tipo de jogos chamados de vanilla são os primeiros, e foram criados em Teeworlds, e que o DDNet tem suporte. Este conjunto de tipos de jogos inclui:\n\n- dm (deathmatch) – O objetivo é matar o máximo possível de jogadores até atingir o limite de portes ou de tempo. A partida termina assim que uma das condições é atingida, e o vencedor é o jogador que acumulou o maior número de mortes.\n- tdm (team deathmatch) – Igual ao Deathmatch acima, exceto que os jogadores são organizados em duas equipes, com cada equipe tendo sua própria contagem de mortes.\n- ctf (capture the flag) – Baseado no famoso \"pique bandeira\", duas equipes têm, cada uma, uma bandeira (vermelha para equipe vermelha e azul para equipe azul) e o objetivo é capturar a bandeira da outra equipe, localizada na \"base\" da equipe, e trazê-la com segurança de volta para sua própria base até atingir uma determinada pontuação ou o tempo acaba. Mate o inimigo para evitar que sua bandeira seja capturada ou para levar a bandeira de volta à base de seu time.\n\n"
    },
    {
      "title": "Tipo de jogo blocker",
      "level": 4,
      "content": "Blocker tem como único objetivo bloquear outros jogadores, o que significa brincar jogando em áreas congeladas. Não há pontuação ou limite de tempo neste tipo de jogo, ou pelo menos não importa.\n\nObserve que embora seja esperado ser bloquear outros neste tipo de jogo blocker, o mesmo não se aplica a #Tipos de jogo DDNet — neste último caso é rude e você provavelmente será banido por votação de outros.\n\n"
    },
    {
      "title": "Tipos de jogo tipo FNG",
      "level": 4,
      "content": "Tipos notáveis: fng (descontinuado, incompátível), openfng (tópico), fng2 (fonte).\n\nNesse tipo de jogo, os jogadores são divididos em 2 times e o objetivo é ganhar fazendo mais pontos. Você marcará pontos ao acertar o jogador com um martelo ou arma laser (as únicas armas disponíveis), o que causará o congelamento, e lançá-los me estacas.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "As configurações são armazenadas em arquivos de texto simples no diretório inicial do usuário e podem ser aplicadas nas opções da GUI ou no console incorporado. Veja mais informações abaixo sobre este tópico.\n\n"
    },
    {
      "title": "Arquivo e diretório para configurações de usuário",
      "level": 3,
      "content": "O diretório $HOME/.teeworlds/ armazena a configuração do usuário, demos (vídeos de jogo gravados), capturas de tela, mapas baixados e outros conteúdos do usuário.\n\nO arquivo de configuração settings_ddnet.cfg é onde a configuração do usuário é armazenada, em um formato de texto simples em uma sintaxe apropriada. Este arquivo é carregado pelo cliente DDNet na inicialização e atualizado ao sair. Portanto, você não precisa definir suas configurações manualmente no arquivo de configuração. Para todas as configurações de cliente com suporte, consulte Client Settings.\n\nO subdiretório downloadmaps/ armazenará mapas baixados em tempo de execução pelo cliente DDNet ao se conectar a instâncias do servidor, se os mapas ainda não estiverem disponíveis.\n\n"
    },
    {
      "title": "Servidor",
      "level": 2,
      "content": "Embora um servidor DDNet local não seja necessário para jogar DDNet (Veja #Jogar), pode-se querer executá-lo para jogar sem conexão com a Internet, evitando alta latência (\"ping\" na interface do jogo) dos servidores na Internet, simplesmente deseja testar recursos, etc.\n\nPara mais informações, veja Server Features, Server Settings, Server Commands e muito mais em DDNet Forums (todos em inglês).\n\n"
    },
    {
      "title": "Servidor por meio de serviço de systemd",
      "level": 3,
      "content": "Os pacotes de DDNet fornecem o arquivo unit ddnet-server.service de systemd para facilmente iniciar, parar etc. a instância de servidor.\n\nEste arquivo unit executa a instância de servidor como o usuário de sistema ddnet a partir de sua própria pasta pessoal /var/lib/ddnet/ como diretório de trabalho, tendo mensagens log disponíveis no arquivo /var/lib/ddnet/autoexec_server.log e via a linha de comando journactl -u ddnet-server do journal do systemd.\n\n"
    },
    {
      "title": "Suporte a MySQL",
      "level": 3,
      "content": "DDNet fornece suporte MySQL para armazenar registros obtidos no servidor, porém não está habilitado por padrão.\n\nPara habilitar o suporte MySQL ao usar ddnetAUR ou ddnet-gitAUR, simplesmente edite o PKGBUILD definindo a variável _enable_mysql para 1, e as dependências adequadas serão adicionadas e os sinalizadores adequados serão habilitados.\n\nCaso você esteja compilando DDNet manualmente (isto é, sem usar os pacotes acima), certifique-se de:\n\n- instalar as dependência de tempo de compilação boost e as dependências de tempo de execução mariadb-libs e mysql-connector-c++AUR;\n- anexar -DMYSQL=ON à linha de comando do cmake.\n\n"
    },
    {
      "title": "Executando um servidor com ddnet-maps-git",
      "level": 3,
      "content": "ddnet-maps-gitAUR fornece mapas e configurações de servidor que permitem a execução de um servidor sem outras configurações. Para ter o servidor ativo:\n\n1. Instale ddnet-maps-gitAUR\n1. Inicie/habilite ddnet-server.service\n\nSua instância de servidor local agora deve estar disponível e visível na guia \"LAN\" do Cliente DDNet.\n\n"
    },
    {
      "title": "Ferramentas extras",
      "level": 2,
      "content": "Esta seção lista e descreve algumas ferramentas que, embora a maioria não precise delas, podem ser úteis para, por exemplo, mapeadores. Algumas dessas ferramentas são desenvolvidas pela equipe de desenvolvimento do DDNet, mas outras ferramentas foram herdadas do Teeworlds ao criar um fork do seu código-fonte no início.\n\nAs ferramentas abaixo são fornecidas em /usr/lib/ddnet/ pelos pacotes DDNet.\n\n"
    },
    {
      "title": "config_retrieve",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/config_retrieve arquivomapa.map\n```\n\nRecupera a configuração incorporada no arquivo de mapa DDNet e armazena em um .cfg com o mesmo nome de arquivo (por exemplo, \"Kobra 4.map\" retorna \"Kobra 4.cfg\")\n\nDisponível desde DDNet versão 9.0.\n\n"
    },
    {
      "title": "config_store",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/config_store arquivomapa.map\n```\n\nArmazena um arquivo de configuração de mapa no arquivo de mapa. Os arquivos de configuração e de mapa devem ter o mesmo nome de arquivo no mesmo diretório, caso contrário, a operação falhará.\n\nDisponível desde DDNet versão 9.0.\n\n"
    },
    {
      "title": "crapnet",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/crapnet\n```\n\nTesta a conexão definindo uma conexão cliente-servidor localmente e executando ping entre eles. Relata pacotes perdidos com mensagem dropped packet e sucessos com cfg = número, sendo que número varia de 0 a 2.\n\n"
    },
    {
      "title": "dilate",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/dilate arquivoimagem1 [arquivoimagem2 ... ]\n```\n\nÉ uma ferramenta gráfica, útil principalmente para mapeadores. Ela cuida das áreas transparentes para evitar contornos em preto/branco ao redor de suas imagens no jogo, evitando assim problemas de mesclagem e mipmap. Veja Edge padding (\"Preenchimento de borda\") para mais informações.\n\n"
    },
    {
      "title": "dummy_map",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/dummy_map\n```\n\nCria um pequeno mapa vazio fictício para ser usado para iniciar um servidor. Veja [3] para mais informações.\n\n"
    },
    {
      "title": "fake_server",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/fake_server\n```\n\nCria um servidor fictício para teste.\n\n"
    },
    {
      "title": "map_convert_07",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/map_convert_07 arquivomapaorigem.map arquivomapadestino.map\n```\n\nTorna arquivomapadestino.map compatível com Teeworlds versão 7.x que de outra forma seria compatível apenas com Teeworlds versão 6.x. Se for bem-sucedido, ele cria um mapa de destino compatível com 07 válido; caso contrário, ele retorna o seguinte:\n\n- uma mensagem de uso, se argumentos incorretos forem fornecidos\n- failed to open source map se ocorrer um erro ao abrir o mapa de origem\n- failed to open destination map se ocorrer um erro ao abrir o mapa de destino\n- error loading storage se falhar em abrir o armazenamento por algum motivo\n- failed to open image file se ocorrer um erro ao abrir uma imagem PNG\n- invalid image format se o PNG estiver incorretamente formatado\n\nDisponível desde o DDNet versão 12.9.\n\n"
    },
    {
      "title": "map_diff",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/map_diff arquivomapa1.map arquivomapa2.map\n```\n\nCompara dois arquivos de mapa, relatando um dos seguintes:\n\n- sem saída comparativa (mapas são iguais)\n- different layer numbers, se um mapa tem mais camadas do que o outro\n- different tile layers, se o número de camadas for o mesmo, mas pelo menos uma camada for diferente\n- por fim, as posições de índice e sinalizadores que divergem.\n\nSe houver nenhuma diferença entre os mapas, retorna 0; do contrário, retorna 1.\n\n"
    },
    {
      "title": "map_extract",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/map_extract arquivomapa.map [diretório]\n```\n\nExtrai conteúdo de arquivomapa.map para o diretório. Se o argumento opcional diretório não for fornecido, extrai para o diretório atual.\n\n"
    },
    {
      "title": "map_replace_image",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/map_replace_image arquivomapa1.map arquivomapa2.map nomeimagem arquivoimagem\n```\n\nSubstitui a imagem nomeimagem atualmente dentro do mapa com nome de arquivo arquivoimagem1.map com a imagem de caminho de arquivo arquivoimagem e salva isso no mapa com nome de arquivo arquivomapa2.map.\n\n- Ambos nomes de arquivos de mapa devem ser relativos à pasta de usuário padrão do DDNet\n- Nome do caminho de arquivo de imagem pode ser absoluto, ou relativo à posição atual\n\n"
    },
    {
      "title": "map_resave",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/map_resave arquivomapa.map arquivoimagem\n```\n\nAtualizar o arquivo de mapa arquivomapa.map com o arquivo fornecido arquivoimagem.\n\nO erro de status 255 é retornado se 1) um número de argumentos diferente de 2 foi fornecido, 2) se o arquivomapa.map não é válido ou 3) se arquivoimagem não é um arquivo de imagem válido (por exemplo, é um arquivo texto); do contrário, retorna 0.\n\n"
    },
    {
      "title": "packetgen",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/packetgen\n```\n\nGera pacotes de rede para localhost na porta padrão (8303) para testar a comunicação com uma instância de servidor local.\n\n"
    },
    {
      "title": "tileset_borderadd",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/tileset_borderadd tileset1 [tileset2 ...]\n```\n\nÉ uma ferramenta gráfica, útil principalmente para mapeadores. Ela corrige problemas de mesclagem, semelhantes a #dilate, mas se aplica apenas a arquivos de tileset (\"conjuntos de blocos\"). Ele espera, como entrada, tilesets com um tamanho de 960x960 pixels com 60x60 blocos. Depois de aplicar a operação borderadd, a imagem será de 1024x1024 com blocos 64x64 com uma borda de 2px.\n\nRetorna 255 com uma mensagem de uso se menos de 1 argumento for fornecido, retorna 1 se a imagem não for uma imagem RGBA (ou seja, arquivo de tileset inválido) e retorna 0 para operação bem-sucedida.\n\n"
    },
    {
      "title": "tileset_borderfix",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/tileset_borderfix tileset1 [tileset2 ...]\n```\n\nAssim como #tileset_borderadd, esta é uma ferramenta gráfica, útil principalmente para mapeadores, que corrige problemas de mesclagem de tilesets. Porém, esta ferramenta espera, como entrada, tilesets com um tamanho de 1024x1024 pixels e não produz imagens de saída tão boas quanto tileset_borderadd. Por exemplo, ela não adiciona uma borda de 2px.\n\nRetorna 255 com uma mensagem de uso se menos de 1 argumento for fornecido, retorna 1 se a imagem não for uma imagem RGBA (ou seja, arquivo de tileset inválido) e retorna 0 para operação bem-sucedida.\n\n"
    },
    {
      "title": "tileset_borderrem",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/tileset_borderrem tileset1 [tileset2 ...]\n```\n\nEsta é uma ferramenta gráfica, útil principalmente para mapeadores. Ela faz a operação inversa de #tileset_borderadd e #tileset_borderset, isto é, ela remove a borda de tilesets.\n\nRetorna 255 com uma mensagem de uso se menos de 1 argumento for fornecido, retorna 1 se a imagem não for uma imagem RGBA (ou seja, arquivo de tileset inválido) e retorna 0 para operação bem-sucedida.\n\n"
    },
    {
      "title": "tileset_borderset",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/tileset_borderset tileset1 [tileset2 ...]\n```\n\nEsta é uma ferramenta gráfica, útil principalmente para mapeadores. Ela faz praticamente o mesmo que #tileset_borderadd, mas espera imagens 1024x1024 em vez de 960x960, e a borda é feita na hora. Então, cada bloco 60x60 deve ser colocada dentro de um bloco 64x64.\n\nRetorna 255 com uma mensagem de uso se menos de 1 argumento for fornecido, retorna 1 se a imagem não for uma imagem RGBA (ou seja, arquivo de tileset inválido) e retorna 0 para operação bem-sucedida.\n\n"
    },
    {
      "title": "unicode_confusables",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/unicode_confusables string1 string2\n```\n\nCompara string1 com string2 e relata se elas são \"confundíveis\", ou seja, se os caracteres são \"iguais\" e podem causar confusão. Para que isso funcione, os personagens com acentos ou outras coisas ao seu redor são considerados \"confundíveis\" com o personagem base. Portanto, aa e aá são confundíveis (á foi considerado como a), enquanto aa e ab não são.\n\nSe forem confundíveis, retorna not_confusable=0; caso contrário, retorna not_confusable=1.\n\nDisponível desde DDNet versão 10.3.5. Desde DDNet versão 12.9, tem suporte a Unicode 12.0 e o nome da ferramenta foi renomeado de confusables para unicode_confusables.\n\n"
    },
    {
      "title": "uuid",
      "level": 3,
      "content": "```\n$ /usr/lib/ddnet/uuid nome\n```\n\nExibe o uuid para o nome fornecido.\n\nO sistema uuid foi implementado para ser facilmente estendido por autores independentes sem colisões, algo que o sistema antigo — com números inteiros crescentes — não permitia. Isso funciona para mensagens do motor e do jogo, itens de instantâneos e eventos.\n\nSai com status de erro 255 se nome não for fornecido.\n\nDisponível desde DDNet 10.6.1\n\n"
    },
    {
      "title": "Compilação falhou, MYSQL_CPPCONN_INCLUDEDIR e MYSQL_CPPCONN_LIBRARY não encontrados",
      "level": 3,
      "content": "Problema:\n\nA compilação falha e a seguinte mensagem é exibida:\n\n```\nCMake Error: The following variables are used in this project, but they are set to NOTFOUND.\nPlease set them or make sure they are set and tested correctly in the CMake files:\n/build/ddnet/src/DDNet-11.1.9/MYSQL_CPPCONN_INCLUDEDIR\n   used as include directory in directory /build/ddnet/src/DDNet-11.1.9\n   [...]\n   used as include directory in directory /build/ddnet/src/DDNet-11.1.9\nMYSQL_CPPCONN_LIBRARY\n    linked by target \"DDNet-Server\" in directory /build/ddnet/src/DDNet-11.1.9\n\n-- Configuring incomplete, errors occurred!\nSee also \"/build/ddnet/src/build/CMakeFiles/CMakeOutput.log\".\nSee also \"/build/ddnet/src/build/CMakeFiles/CMakeError.log\".\n```\n\nSolução:\n\nSignifica que sua linha de comando do cmake tem o sinalizador -DMYSQL=ON definido, você tem o pacote mariadb-libs instalado, mas mysql-connector-c++AUR está faltando.\n\nInstale mysql-connector-c++AUR para compilar com suporte MySQL ou remova -DMYSQL=ON (ou desative com -DMYSQL=OFF) para compilar sem ele.\n\n"
    },
    {
      "title": "Compilação falhou, arquivo boost/shared_ptr.hpp inexistente",
      "level": 3,
      "content": "Problema:\n\nA compilação falha e a seguinte mensagem é exibida:\n\n```\n[ 38%] Building CXX object CMakeFiles/DDNet-Server.dir/src/engine/server/server.cpp.o\nIn file included from /build/ddnet/src/DDNet-11.1.9/src/engine/server/sql_server.h:4,\n                 from /build/ddnet/src/DDNet-11.1.9/src/engine/server/sql_connector.h:4,\n                 from /build/ddnet/src/DDNet-11.1.9/src/engine/server/server.h:28,\n                 from /build/ddnet/src/DDNet-11.1.9/src/engine/server/server.cpp:40:\n/usr/include/mysql_connection.h:31:10: fatal error: boost/shared_ptr.hpp: No such file or directory\n #include <boost/shared_ptr.hpp>\n          ^14:06, 19 June 2018 (UTC)14:06, 19 June 2018 (UTC)14:06, 19 June 2018 (UTC)14:06, 19 June 2018 (UTC)~\ncompilation terminated.\nmake[2]: *** [CMakeFiles/DDNet-Server.dir/build.make:116: CMakeFiles/DDNet-Server.dir/src/engine/server/server.cpp.o] Error 1\nmake[1]: *** [CMakeFiles/Makefile2:281: CMakeFiles/DDNet-Server.dir/all] Error 2\nmake: *** [Makefile:152: all] Error 2\n```\n\nSolução:\n\nSignifica que sua linha de comando do cmake tem o sinalizador -DMYSQL=ON definido, você tem os pacotes mariadb-libs e mysql-connector-c++AUR instalados, mas boost está faltando.\n\nInstale boost para compilar com suporte MySQL ou remova -DMYSQL=ON (ou desative com -DMYSQL=OFF) para compilar sem ele.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Site oficial do DDNet\n- Fórum do DDNet\n- Wiki do DDNet\n- Repositório de código-fonte do DDNet\n- A história do DDNet (inglês)\n- Tutoriais e outros links úteis (inglês)\n\n"
    }
  ]
}