{
  "title": "DDNet",
  "url": "https://wiki.archlinux.org/title/DDNet",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "DDNet, as it is popularly known, is a sidescrolling platform game, featuring weaponry and a cooperative gameplay, and is a mod of Teeworlds. The game name comes from Dummy Drag Race Network, as it was based in DDRace.\n\nFrom the official website ddnet.org:\n\nYou control a tee, a ball-shaped 2D character, using your keyboard and mouse to shoot, grapple hook and jump around to interact with other players and the environment in the map with the finish line as target.\n\nThe game works in a client–server model, where the user plays using a Client which connects to a local or remote Server. Since DDNet has official servers, you most likely will only start the Client and play online.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install ddnetAUR. Alternatively, you can install its development version ddnet-gitAUR.\n\n"
    },
    {
      "title": "Play",
      "level": 2,
      "content": "To play DDNet, run the command\n\n```\n$ DDNet\n```\n\nor run the .desktop file provided in the package (e.g. in GNOME, search for \"ddnet\" in its Activities Overview)\n\nIt is very straightforward – all user configuration (skin selection, video, controls etc.) can be done from the GUI of the DDNet Client.\n\nNo server setup is required; if you want to set up a local server, see #Server.\n\nAlso, some extra tools – which you probably will not need – are available in /usr/lib/ddnet/tools/. See #Extra tools.\n\n"
    },
    {
      "title": "Gametypes",
      "level": 3,
      "content": "Gametypes (a.k.a game types or game modes) are different ways of playing Teeworlds-like games (DDNet included!), and different ways of exploring its resources (e.g. physics, weapons kill or just push other players, etc.).\n\nIn the main dashboard of DDNet Client, several server instances are listed (not only DDNet's), each one is launched with only one gametype. In order to play a gametype, you have to join the server instance that has the desired gametype (e.g. you want to play \"ctf\", you have to look for and join a \"ctf\" server instance)\n\nSee below a non-exhaustive list with name and an explanation of gametypes that can be found in DDNet official servers (although there are a lot more).\n\n"
    },
    {
      "title": "DDNet gametypes",
      "level": 4,
      "content": "These are the official DDNet gametypes, which DDNet maintains. That means these gametypes' maps are stored and made available in DDNet's maps repository. It also means that the Test Staff runs some test before the maps being added to the repository and published.\n\nSome of these might require DDNet Client due to features (e.g. dummy tee, teaming, specific key bindings) that this client provides, but other could be played with other clients, like Teeworlds.\n\nThe goal of these maps, unless mentioned otherwise below, is to overcome obstacules and other difficulties of the map, while helping each other, in order to reach the finish line of map.\n\nThis set of gametypes consists of:\n\n- novice – The easiest collaborative maps can be found here. Newcomers should start here.\n- moderate – Moderate-level collaborative maps for more experienced users.\n- brutal – Hard collaborative maps for very experienced users.\n- insane – Insanely hard collaborative maps for insanely experienced users.\n- solo – Play alone the whole map, without any a dummy or any physical interaction with users (you can chat with other players, though)\n- ddmax – Maps from DDracemaX, one of the first race mod and very popular one. This project discontinued, so DDNet adopted[1] its maps and made available in official servers. See [2] for info of this gametype.\n- dummy – Move your dummy to the finish line, collaboratively or solo depending on the map.\n- oldschool – Some old maps to make long-time players nostalgic.\n- race – Reach the finish line as fast as you can in a solo run.\n\n"
    },
    {
      "title": "Vanilla gametypes",
      "level": 4,
      "content": "The so-called vanilla gametypes are the first ones, and were created in Teeworlds, and which DDNet supports. This set of gametypes include:\n\n- dm (deathmatch) – The goal is to kill as many players as possible until you reach the death or time limit. The match is over as soon as one of the conditions is met, and the winner is the player that accumulated the greatest number of kills.\n- tdm (team deathmatch) – Same as Deathmatch above, except that the players are organized into two teams, with each team having its own kill count.\n- ctf (capture the flag) – Two teams each have a flag (red for red team and blue for blue team) and the objective is to capture the other team's flag, located at the team's \"base,\" and bring it safely back to their own base until reach a certain score or the time runs out. Kill the enemy to avoid having your flag captured or to get the flag back to your team's base.\n\n"
    },
    {
      "title": "Blocker gametype",
      "level": 4,
      "content": "Blocker has as only target to block other players, which means to fool around throwing into freeze areas. There is no score or time limit in this type of game, or at least it does not matter.\n\nPlease notice that while being a blocker is expected in the blocker gametype, the same does not apply to #DDNet gametypes – in this last case it is rude and you most likely will be banned by vote of others.\n\n"
    },
    {
      "title": "FNG-like gametypes",
      "level": 4,
      "content": "Types noteworthy: fng (discontinued, incompatible), openfng (thread), fng2 (source).\n\nIn this gametype, the players are divided in 2 teams and the target is to win by making more points. You will points by hitting the player with hammer or laser gun (the only weapons available), which will cause freeze, and to throwing into the spikes.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Configurations are stored in plain text files in the user's home directory and can be applied in the GUI options or in the embedded console. See more information below on this topic.\n\n"
    },
    {
      "title": "File and directory for user settings",
      "level": 3,
      "content": "The directory $HOME/.teeworlds/ stores user configuration, demos, screenshots downloaded maps and other user contents.\n\nsettings_ddnet.cfg is where user's configuration is stored, in a simple text format in a proper syntax. This file is loaded by the Client on startup, and updated when exiting. Therefore, you are not required to set your settings manually in the configuration file. For all supported client settings, see Client Settings.\n\nThe subdirectory downloadedmaps/ will store maps downloaded in runtime by DDNet Client when connecting to server instances, if the maps are not available already.\n\n"
    },
    {
      "title": "Optional skins",
      "level": 3,
      "content": "You can choose between many skins to play with a fancy tee char. However, this will not affect anything in the gameplay.\n\nDDNet features automatic, on-demand download of tee skins. To use this feature make sure to have enabled Settings > Tee > Download skins.\n\nAlternatively, skins can be manually download from the DDNet Skin Database and manually placed at ~/.teewords/downloadedskins to be recognized by the DDNet Client.\n\n"
    },
    {
      "title": "Optional offline maps",
      "level": 3,
      "content": "When playing DDNet, maps are downloaded on demand (i.e. whenever you enter join a server with a map that hasn't been downloaded yet).\n\nHowever, there are scenarios where need to have all DDNet maps available:\n\n- To play without Internet connection, using a local server\n- To serve a DDNet Server for a LAN play with friends, which local time records.\n\nTo have all playable DDNet maps available offline, install ddnet-maps-gitAUR.\n\n"
    },
    {
      "title": "Server",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nAlthough a local DDNet server is not required for playing DDNet (See #Play), one may want to run it for playing without Internet connection, want to avoid high latency (\"ping\" in the game interface) of servers on the Internet, simply want to test features, etc.\n\nThere are two methods for starting a DDNet server: via the client's main menu and via systemd service.\n\nFor more info, see Server Features, Server Settings, Server Commands, and much more in DDNet Forums.\n\n"
    },
    {
      "title": "Server via the client's main menu",
      "level": 3,
      "content": "On DDNet client startup, press Run server button. Now press Play button and browse the LAN tab for your local server.\n\nThis is the easiest option for playing by yourself (with your dummy) or for testing a map that you created/edited.\n\n"
    },
    {
      "title": "Server via systemd service",
      "level": 3,
      "content": "Start (optionally, enable as well) ddnet-server.service systemd unit file. Now, in the DDNet Client, press Play button and browse the LAN tab for your local server.\n\nThis unit file runs the server instance as the system user ddnet from its home folder /var/lib/ddnet/ as working directory, having log messages available in /var/lib/ddnet/autoexec_server.log file and via systemd journal command-line journactl -u ddnet-server.\n\nThis option is could be better for playing with friends or running a server-only instance global wide, as it excludes the need for firing up the DDNet Client.\n\n"
    },
    {
      "title": "MySQL support",
      "level": 3,
      "content": "The DDNet packages have MySQL/MariaDB support enabled. This allows you store records achieved in a local server.\n\nIn case you want to disable MySQL support on buildtime, edit the DDNet package's PKGBUILD by setting the -DMYSQL to OFF, and remove the dependency mariadb-libs.\n\n"
    },
    {
      "title": "Extra tools",
      "level": 2,
      "content": "DDNet packages comes with command-line tools that can be used for the propose of debugging (mostly used when developing DDNet) and mapping (mostly used when creating or improving maps for DDNet).\n\nThese tools are available in /usr/lib/ddnet/ in the DDNet packages.\n\nSee Extra tools in DDNet Wiki for a list and description of these tools.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- DDNet official website\n- DDNet Forum\n- DDNet Wiki\n- DDNet source code repository\n- The History of DDNet\n- Tutorials and other useful links\n\n"
    }
  ]
}