{
  "title": "Deepin Desktop Environment (Polski)",
  "url": "https://wiki.archlinux.org/title/Deepin_Desktop_Environment_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nPowiązane artykuły\n\n- Desktop environment\n- GNOME (Polski)\n- LightDM\n\nDDE (Deepin Desktop Environment) jest domyślnym środowiskiem graficznym stworzonym na potrzeby dystrybucji Linux Deepin.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Aby uzyskać podstawowe środowisko graficzne, należy zainstalować grupę deepin. Pobierze ona i skonfiguruje wszystkie wymagane elementy.\n\n```\n# pacman -S deepin\n```\n\nGrupa deepin-extra zawiera dodatkowe aplikacje dostępne do instalacji w każdej chwili w celu uzupełnienia funkcjonalności środowiska podstawowego.\n\nW celu użycia zintegrowanej w środowisko Deepin obsługi sieci, pakiet networkmanager jest wymagany, a usługa NetworkManager.serviceSystemd#Using units musi być włączona i uruchomiona.\n\n"
    },
    {
      "title": "Poprzez menadżer logowania",
      "level": 3,
      "content": "Aby użyć domyślnego dla Deepina menadżera lightdm musisz zmodyfikować plik konfiguracyjny w sekcji [Seat:*] w następujący sposób:.\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[Seat:*]\n...\ngreeter-session=lightdm-deepin-greeter\n```\n\nUwaga - użytkownik(wykluczając konto administratora - root) musi dysponować własnym katalogiem home.\n\n"
    },
    {
      "title": "Brak tła po powrocie ze stanu wstrzymania",
      "level": 3,
      "content": "Ze względu na to jak sterowniki NVIDIA przechowują FBO [1], zdarza się, że po powrocie ze stanu wstrzymania tło nagle znika, zostawiając tylko białe pole. Błąd wydaje się na naprawiony w środowisku graficznym Gnome. Deepin jednak dalej cierpi na ową przypadłość.\n\nMożliwym obejściem problemu jest restartowanie menadżera okien za każdym razem gdy komputer powraca ze stanu wstrzymania. Aby to zrobić należy stworzyć następującą usługę w systemd:\n\n```\n/etc/systemd/system/resume@.service\n```\n\n```\n[Unit]\nDescription=User resume actions\nAfter=suspend.target\n\n[Service]\nUser=%I\nType=simple\nExecStart=/usr/bin/deepin-wm-restart.sh\n\n[Install]\nWantedBy=suspend.target\n```\n\nKtóry z kolei uruchamia następujący skrypt:\n\n```\n/usr/bin/deepin-wm-restart.sh\n```\n\n```\n#!/bin/bash\nexport DISPLAY=:0\ndeepin-wm --replace\n```\n\nGdy oba te pliki zostaną stworzone w odpowiednich ścieżkach (nazwy plików i ścieżki podane są w nagłówkach), w celu automatyzacji całego procesu należy wykonać następujące komendy:\n\n```\n# chmod +x /usr/bin/deepin-wm-restart.sh\n# systemctl enable resume@nazwa_użytkownika\n# systemctl start resume@nazwa_użytkownika\n```\n\nPierwsza komenda sprawia, że skrypt, który właśnie stworzyłeś dostaje prawa do uruchamiania się jako plik wykonywalny. Druga upewnia się, że usługa zawsze startuje razem z systemem, ostatnia zaś uruchamia usługę w tej chwili w celu uniknięcia restartu komputera, można ją pominąć, wtedy jednak restart komputera jest wymagany.\n\n"
    },
    {
      "title": "Raportowanie błędów",
      "level": 2,
      "content": "Każdy błąd związany bezpośrednio ze środowiskiem Deepin powinien być raportowany w tym miejscu. Dzięki temu developerzy Deepin mają wgląd do sprawy i naprawią problem najszybciej jak to tylko możliwe.\n\n"
    }
  ]
}