{
  "title": "Deepin Desktop Environment (Русский)",
  "url": "https://wiki.archlinux.org/title/Deepin_Desktop_Environment_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Среда рабочего стола\n- GNOME (Русский)\n- LightDM (Русский)\n\nDDE (Deepin Desktop Environment) является средой рабочего стола по-умолчанию для дистрибутива Linux Deepin.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Чтобы получить минимальный интерфейс рабочего стола, установите группу пакетов deepin. Она включает в себя все основные компоненты.\n\nГруппа пакетов deepin-extra содержит некоторые дополнительные приложения, необходимые для более удобной работы.\n\nЧтобы иметь возможность использовать встроенную поддержку управления сетью, необходимо установить пакет networkmanager, и запустить, включить службу NetworkManager.service.\n\n"
    },
    {
      "title": "Запуск Deepin Desktop Environment",
      "level": 2,
      "content": "По-умолчанию Deepin рассчитан на работу с экранным менеджером lightdm.\n\nЧтобы использовать оригинальный экран приветствия для Deepin в lightdm, вам необходимо изменить конфигурационный файл следующим образом:\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[Seat:*]\n...\ngreeter-session=lightdm-deepin-greeter\n```\n\nДля корректной работы экрана приветствия должна существовать хотя бы одна домашняя папка.\n\n"
    },
    {
      "title": "Отсутствие изображение на рабочем столе после пробуждения",
      "level": 3,
      "content": "Из-за особенностей хранения FBO (Framebuffer Object) драйверами NVIDIA [1], иногда после пробуждения отображается только белый экран и, возможно, небольшой цветовой шум. Баг исправлен в репозитории GNOME, но в Deepin он всё ещё наблюдается.\n\nВозможным решением проблемы может быть перезапуск оконного менеджера каждый раз после пробуждения компьютера из приостановленного состояния. Этого можно достигнуть, создав следующую службу systemd:\n\n```\n/etc/systemd/system/resume@.service\n```\n\n```\n[Unit]\nDescription=User resume actions\nAfter=suspend.target\n\n[Service]\nUser=%I\nType=simple\nExecStart=/usr/bin/deepin-wm-restart.sh\n\n[Install]\nWantedBy=suspend.target\n```\n\nДанная служба должна выполнять следующий скрипт:\n\n```\n/usr/bin/deepin-wm-restart.sh\n```\n\n```\n#!/bin/bash\nexport DISPLAY=:0\ndeepin-wm --replace\n```\n\nКогда вы поместите описанные файлы в нужные каталоги, запустите сценарий следующими командами:\n\n```\n# chmod +x /usr/bin/deepin-wm-restart.sh\n# systemctl enable resume@user\n# systemctl start resume@user\n```\n\nПервая команда делает скрипт, созданный вами, исполняемым, вторая помещает службу в автозапуск при загрузке системы, а последняя сразу запускает эту службу, таким образом, вы можете обойтись без перезагрузки системы.\n\n"
    },
    {
      "title": "Сообщение об ошибках",
      "level": 2,
      "content": "При возникновении каких-либо ошибок в работе, их подробное описание и шаги по вопспроизведению можно оставить тут.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Сайт русского сообщества Deepin\n- Telegram-канал официального сообщества Deepin\n- Telegram-канал русского сообщества Deepin\n\n"
    }
  ]
}