{
  "title": "Deepin Desktop Environment (Português)",
  "url": "https://wiki.archlinux.org/title/Deepin_Desktop_Environment_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Desktop environment (Português)\n- GNOME (Português)\n- LightDM\n\nO Deepin Desktop Environment (DDE) é o Desktop environment (Português) do deepin Distribuição Linux. É desenhado por Wuhan Deepin Technology Co.,Ltd. deepin é uma distribuição Linux dedicada a fornecer um sistema bonito, fácil de usar, seguro e confiável para usuários globais. deepin é um sistema operacional GNU / Linux de código aberto, baseado no kernel Linux e principalmente em aplicativos de desktop, com suporte para laptops, desktops e all-in-one. O DDE é composto de Ambiente de Trabalho, Gerenciador de Janelas profundo, Centro de Controle, Iniciador e Dock.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Para obter uma interface de área de trabalho mínima, você pode começar pelo grupo instale deepin. Isso puxará todos os componentes básicos.\n\nO grupo deepin-extra contém alguns aplicativos extras para um ambiente de área de trabalho mais completo.\n\nPara poder usar a administração de rede integrada, o pacote networkmanager é necessário, e o NetworkManager.service deve ser iniciado e habilitado.\n\n"
    },
    {
      "title": "Por meio do gerenciador de exibição",
      "level": 3,
      "content": "Para usar o saudador lightdm padrão do DDE, você deve modificar o arquivo de configuração no [Seat:*] seção, para indicar :.\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[Seat:*]\n...\ngreeter-session=lightdm-deepin-greeter\n```\n\nObserve que um diretório home válido deve existir para um usuário diferente de root para que o saudador funcione.\n\n"
    },
    {
      "title": "Por meio do xinit",
      "level": 3,
      "content": "Para usar Deepin via Xinit (Português), você precisará adicionar o seguinte ao seu arquivo .xinitrc.\n\n```\n~/.xinitrc\n```\n\n```\nexec startdde\n```\n\n"
    },
    {
      "title": "Problemas conhecidos",
      "level": 2,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n"
    },
    {
      "title": "Personalize o comportamento de gestos do touchpad",
      "level": 3,
      "content": "Deepin não suporta oficialmente a personalização dos comportamentos de gestos, mas é possível alterar manualmente editando o arquivo de configuração. Diretório do arquivo de configuração:\n\n```\n/usr/share/dde-daemon/gesture.json\n```\n\nSe você deseja desativar a atividade de gesto específica. Defina \"Action\" como \"none\". Por exemplo:\n\n```\n{\n       \"Name\": \"tap\",\n       \"Direction\": \"none\",\n       \"Fingers\": 3,\n       \"Action\": {\n           \"Type\": \"built-in\",\n           \"Action\": \"none\"\n       }\n   }\n```\n\nReinicie ou faça login novamente após editar o arquivo.\n\n"
    },
    {
      "title": "Alterar sons de profundidade padrão",
      "level": 3,
      "content": "Embora isso não seja oficialmente suportado, é possível alterar ou até mesmo remover os sons padrão que são usados pelo Deepin (ex. Som de login). Basta substituir os sons no diretório:\n\n```\n/usr/share/sounds/deepin/stereo\n```\n\nNota: Se você simplesmente deseja desabilitar totalmente os efeitos sonoros, isso pode ser feito nas configurações de sistema do Deepin (seção de som).\n\n"
    },
    {
      "title": "Sem fundo após sair do modo de espera",
      "level": 3,
      "content": "Devido à forma como o driver NVIDIA armazena seus FBOs [2], acontece que, depois de sair do modo de espera, o fundo desaparece repentinamente, deixando apenas uma tela branca com possivelmente algum ruído de cor. O bug parece ter sido corrigido no upstream do GNOME, mas o ambiente de desktop Deepin ainda o tem.\n\nUma possível solução alternativa seria reiniciar o gerenciador de janelas sempre que o computador sair da suspensão. Uma maneira de fazer isso seria criando o seguinte serviço systemd\n\n```\n/etc/systemd/system/resume@.service\n```\n\n```\n[Unit]\nDescription=User resume actions\nAfter=suspend.target\n\n[Service]\nUser=%I\nType=simple\nExecStart=/usr/bin/deepin-wm-restart.sh\n\n[Install]\nWantedBy=suspend.target\n```\n\nIsso executa o seguinte script\n\n```\n/usr/bin/deepin-wm-restart.sh\n```\n\n```\n#!/bin/bash\nexport DISPLAY=:0\ndeepin-wm --replace\n```\n\nUma vez que esses dois arquivos são criados nos diretórios corretos, para habilitar o script, é suficiente executar estes comandos:\n\n```\n# chmod +x /usr/bin/deepin-wm-restart.sh\n# systemctl enable resume@user\n# systemctl start resume@user\n```\n\nO primeiro comando torna o script que você criou executável, o segundo garante que o serviço sempre inicie na inicialização e o último inicia o serviço imediatamente para que você possa testar a solução alternativa sem precisar reiniciar o sistema.\n\n"
    },
    {
      "title": "Rede sem fio não conecta",
      "level": 3,
      "content": "O NetworkManager define o endereço MAC gerado aleatoriamente. Isso já estava ativado por padrão, para desativá-lo, adicione as seguintes linhas ao arquivo de configuração do NetworkManager.\n\n```\n/etc/NetworkManager/NetworkManager.conf\n```\n\n```\n[device]\nwifi.scan-rand-mac-address=no\n```\n\n"
    },
    {
      "title": "O menu Bluetooth não aparece/funciona",
      "level": 3,
      "content": "Habilite o bluetooth.service. Este serviço não é habilitado por padrão.\n\n```\n# systemctl enable bluetooth.service\n# systemctl start bluetooth.service\n```\n\n"
    },
    {
      "title": "Relatório de bug",
      "level": 2,
      "content": "Quaisquer bugs relacionados ao empacotamento do Arch devem ser relatados no rastreador de bug.\n\nQualquer bug relacionado ao upstream deve ser relatado aqui. Todos os desenvolvedores do Deepin verão os relatórios de bug e os resolverão o mais rápido possível.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Página oficial do Wiki\n- Wikipedia artigo\n- deepin Github\n\n"
    }
  ]
}