{
  "title": "Deepin Desktop Environment",
  "url": "https://wiki.archlinux.org/title/Deepin_Desktop_Environment",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- GNOME\n- LightDM\n\nThe Deepin Desktop Environment (DDE) is the desktop environment of the deepin Linux distribution. It is designed by the Wuhan Deepin Technology Co.,Ltd. deepin is a Linux distribution devoted to providing a beautiful, easy to use, safe and reliable system for global users. deepin is an open source GNU/Linux operating system, based on Linux kernel and mainly on desktop applications, supporting laptops, desktops, and all-in-ones. The DDE is comprised of the Desktop Environment, deepin Window Manager, Control Center, Launcher and Dock.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install deepin and deepin-kwin for the basic components for a minimal desktop interface.\n\nOptionally, also install deepin-extra for some extra applications for a more complete desktop environment.\n\n"
    },
    {
      "title": "Via a display manager",
      "level": 3,
      "content": "LightDM is the default display manager for DDE, and it will installed as dependency. Simply enable lightdm.service to use it.\n\n"
    },
    {
      "title": "Via xinit",
      "level": 3,
      "content": "To use Deepin via xinit, you will need to add the following to your .xinitrc file.\n\n```\n~/.xinitrc\n```\n\n```\nexec startdde\n```\n\n"
    },
    {
      "title": "Known issues",
      "level": 2,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n"
    },
    {
      "title": "Networking",
      "level": 3,
      "content": "NetworkManager is integrated in DDE network administration and is installed together. Enable NetworkManager.service to use it.\n\n"
    },
    {
      "title": "Customize touchpad gesture behavior",
      "level": 3,
      "content": "Deepin does not officially support customizing the gesture behaviors, but it is possible to manually change this by editing the configuration file /usr/share/dde-daemon/gesture.json.\n\nFor instance, if you want to disable tapping gesture activity, set its action to none:\n\n```\n/usr/share/dde-daemon/gesture.json\n```\n\n```\n[\n    ...\n    {\n        \"Name\": \"tap\",\n        \"Direction\": \"none\",\n        \"Fingers\": 3,\n        \"Action\": {\n            \"Type\": \"built-in\",\n            \"Action\": \"none\"\n        }\n    },\n    ...\n]\n```\n\nTo apply the changes, reboot your system or log off and log in again.\n\n"
    },
    {
      "title": "Changing default deepin sounds",
      "level": 3,
      "content": "While this is not officially supported, it is possible to change or even remove the default sounds that are used by Deepin (ex. login sound). Simply replace the sounds in the directory:\n\n```\n/usr/share/sounds/deepin/stereo\n```\n\nNote: If you simply want to disable the sound effects entirely, it can be done from Deepin's system settings (sound section).\n\n"
    },
    {
      "title": "Changing system language",
      "level": 3,
      "content": "The envioronment varaiable LANG of deepin can be affected by ~/.dde_env, and it has the highest procedence at the moment, the /etc/locale.conf and $XDG_HOME/.config/locale.conf will be ignored if this file exists:\n\n```\n~/.dde_env\n```\n\n```\n# DDE user env file, bash script\nexport LANG=\"zh_CN.UTF-8\";\nexport LANGUAGE=\"\";\n```\n\n"
    },
    {
      "title": "No background after resuming from standby",
      "level": 3,
      "content": "Because of the way the NVIDIA driver stores its FBOs [2], it happens that after resuming from standby the background suddenly disappears, leaving only a white screen with possibly some color noise on it. The bug appears to be fixed in GNOME upstream, but the Deepin desktop environment still has it.\n\nA possible workaround would be restarting the window manager every time the computer resumes from suspension. A way to do that would be to create the following systemd service\n\n```\n/etc/systemd/system/resume@.service\n```\n\n```\n[Unit]\nDescription=User resume actions\nAfter=suspend.target\n\n[Service]\nUser=%I\nType=simple\nExecStart=/usr/bin/deepin-wm-restart.sh\n\n[Install]\nWantedBy=suspend.target\n```\n\nThat executes the following script\n\n```\n/usr/bin/deepin-wm-restart.sh\n```\n\n```\n#!/bin/bash\nexport DISPLAY=:0\ndeepin-wm --replace\n```\n\nOnce those two files are created in the correct directories, make the script executable and start/enable resume@user\n\n"
    },
    {
      "title": "Wireless network does not connect",
      "level": 3,
      "content": "NetworkManager sets the MAC address generated randomly. This was already enabled by default, to disable it add the following lines to the NetworkManager configuration file.\n\n```\n/etc/NetworkManager/NetworkManager.conf\n```\n\n```\n[device]\nwifi.scan-rand-mac-address=no\n```\n\n"
    },
    {
      "title": "Bluetooth Menu does not show up / work",
      "level": 3,
      "content": "Start/enable bluetooth.service. This service is not enabled by default.\n\n"
    },
    {
      "title": "Window shortcuts does not work in dual boot",
      "level": 3,
      "content": "When home directory is shared in dual boot, ~/.config/kglobalaccels can lead to strange shortcut behavior and we can try renaming this file to another name.\n\n"
    },
    {
      "title": "Bug reporting",
      "level": 2,
      "content": "Any bugs related to Arch packaging should be reported in the bug tracker.\n\nAny upstream related bugs should be reported here. All the Deepin developers will see the bug reports and solve them as soon as possible.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Wiki page\n- Wikipedia article\n- deepin Github\n\n"
    }
  ]
}