{
  "title": "Dell XPS 13 (9380)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_13_(9380)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU |  | Yes\nWireless |  | Yes\nBluetooth |  | Yes\nAudio |  | Yes\nTouchpad |  | Yes\nWebcam |  | Yes\nInfrared |  | Yes\nThunderbolt |  | Yes\nFingerprint sensor |  | No\n\nThe Dell XPS 13 Early 2019 (9380) is the sixth-generation model of the XPS 13 line. The laptop was released in January 2019 in both a standard edition with Windows installed as well as a Developer Edition with Ubuntu 18.04 installed. There are only minor hardware differences between them, mostly in regards to the mainboard microchip manufacturers. According to Dell the fingerprint reader is not present on the Linux variant. Just like the older versions (9333, 9343, 9350, and 9360) it is available in different hardware configurations as well.\n\nThe installation process for Arch on the XPS 13 does not differ from any other PC. For installation help, please see the Installation guide and UEFI. This page covers the current status of hardware support on Arch, as well as post-installation recommendations.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Before installing it is necessary to modify some UEFI Settings. They can be accessed by pressing the F2 key repeatedly when booting.\n\n- Change the SATA Mode from the default \"RAID\" to \"AHCI\". This will allow Linux to detect the NVMe SSD. If dual booting with an existing Windows installation, Windows will not boot after the change but this can be fixed without a re-installation.\n- Disable Secure Boot.\n- To boot from a USB device attached via the USB-C to USB-A adapter included in the box, you will need to enable Thunderbolt boot. Once enabled, F12 on boot will enter the boot menu.\n\nIt is also possible to use the right USB-C port directly without any UEFI adjustment.\n\nBooting and installing from a micro SD card is also possible, as long as SD Card and SD Card Boot are both enabled in the UEFI setup.\n\n"
    },
    {
      "title": "Content Adaptive Brightness Control",
      "level": 2,
      "content": "In the XPS 13 the display panels (both FHD and 4K UHD) come with Content Adaptive Brightness Control (usually referred to as CABC or DBC, sometimes also as \"EcoPower\") enabled by default. While disabling required flashing the display firmware in previous generations, DBC can now be disabled in recent BIOS versions in the Video section. To test if DBS is enabled, go to this test page.\n\n"
    },
    {
      "title": "Display",
      "level": 2,
      "content": "The video should work with the i915 driver of the current linux kernel. Consult Intel graphics for a detailed installation and configuration guide as well as for Intel graphics#Troubleshooting.\n\nIf you installed xf86-video-intel and experienced hanging/freezing when launching Xorg, or when launching applications with GPU Acceleration (such as kitty and alacritty), try uninstalling xf86-video-intel and let Xorg fallback to modesetting driver.\n\nWhen using modesetting driver, Backlight#xbacklight may produce No outputs have backlight property. Replacing xorg-xbacklight with acpilightAUR fixes the problem.\n\nIf you have the 4K (3840x2160) model, also check out HiDPI for UI scaling configurations.\n\nNote that the enable_psr=1 kernel parameter appears not to work properly, at least on the touchscreen model.\n\n"
    },
    {
      "title": "Wi-Fi",
      "level": 2,
      "content": "The Wi-Fi adapter contains a Qualcomm Atheros QCA6174 module. It should work out of the box with the ath10k_pci driver in recent linux kernels.\n\nFor any Wi-Fi issues here is a guideline provided by Dell to install the latest Killer wireless drivers.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "Dell provides firmware updates via Linux Vendor Firmware Service (LVFS). Refer to Flashing BIOS from Linux#fwupd for additional information. A package is readily available at fwupd. Updates are provided for the Thunderbolt controller as well. There is an issue where the Thunderbolt version number is detected as 00.00 after re-flashing (currently being investigated).\n\nAlternatively, for the BIOS update, you can simply copy the .exe file from the Dell Support page to any FAT32 drive (even the boot partition seems to work). Then boot into the \"BIOS Flash Update\" utility by hitting F12 at boot time.\n\nDell has also released updates to the SSD firmware, but these can only be updated from Windows, not from Linux.\n\n"
    },
    {
      "title": "USB Type-C ports",
      "level": 2,
      "content": "The 9380 has only three Type-C ports (and no other ports, just an audio jack). Two of these (on the left side) support Thunderbolt 3. There is no power jack. A 45 W USB Type-C charger is included in the box. Any of the three Type-C ports can be used for charging. Since the laptop has no USB-A ports, one Dell-branded Type-C to A adapter is included.\n\nAlso all three Type-C ports support DisplayPort alternate mode. It is taken care of by the firmware, so it will work even with older kernels that do not otherwise support it. To the operating system it appears as if the laptop had two DisplayPort connectors (in addition to the embedded DP that the internal screen uses). So far I have tested the following adapters. All of these will appear to the operating system as if you plugged something into one of the DP connectors.\n\nBut sometime the USB Type-C port is stopped working unreasonably. You might find a temporary solution here: [1] Shutdown the system, unplug everything and wait for 5 minutes and the boot again.\n\n- [2] (USB Type-C is stopped working).\n- [3] XPS 13-9380 (Thunderbolt 3/USB Type-C port not working).\n- [4] (Dell XPS 13 9380 Thunderbolt 3 (USB Type-C) stopped work).\n\n"
    }
  ]
}