{
  "title": "Dell XPS 13 (9333)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_13_(9333)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installation largely runs smoothly. See below for potential problems.\n\n"
    },
    {
      "title": "BIOS and USB drives",
      "level": 4,
      "content": "It is possible to boot a EFI Arch image. However the XPS' BIOS (tested with BIOS version A04 / XPS 13 9333 circa early 2014) will print \"operation system not found\" [sic] when using a GPT formatted USB drive. Hence a dd-copied bit-for-bit image of the arch dual ISO will not boot. A workaround is to format the USB drive to VFAT with a bootable MBR as described in USB flash installation medium#BIOS and UEFI. This still allows you to boot in EFI mode (just press F12 during boot - you should find that even after disabling all legacy boot options you can select the arch EFI image) and continue with the install.\n\nYou may need to use dosfslabel (from dosfstools) to give the USB drive FAT partition a label that is searched for on boot by the arch ISO (e.g. dosfslabel /dev/sdX1 ARCH_201408) in order for the partition to be mounted properly.\n\n"
    },
    {
      "title": "Screen corruption",
      "level": 4,
      "content": "If the screen corrupts, append nomodeset to the kernel parameters. There may be issues with the cord of the external optical drive, possibly specific to the device.\n\n"
    },
    {
      "title": "Partitioning",
      "level": 3,
      "content": "On recent Haswell editions, a full new GPT and ESP work correctly with no boot problems. Remember to swap the system into full EFI boot in the 'BIOS'.\n\nOn older XPS 13 models there is an MBR with all four partitions already used. Additionally, if you delete any of the partitions, the boot process will break. Therefore, a dual-boot with Windows is impossible on this machine, although only Arch is probably fine. One solution could be booting from a permanent USB installation. However, this has caveats too. See the #BIOS and USB drives.\n\n"
    },
    {
      "title": "No sound from headphone out",
      "level": 3,
      "content": "The kernel module snd-hda-intel is loaded automatically, but the model auto-detection seems to leave the system with a non-functional headphone out - there is no sound when headphones are inserted although they are detected and the speakers work. Use model=dell-headset-multi as explained in Advanced Linux Sound Architecture/Troubleshooting#Wrong model autodetection.\n\n"
    },
    {
      "title": "No sound from built-in speakers",
      "level": 3,
      "content": "The HDMI output is occasionally detected as the default soundcard on the Haswell XPS 13. Since both use snd-hda-intel we need to specify the vid and pid of each card. To do this, run lspci -nn | grep -i audio - the last set of numbers in braces is the vid and pid of each card.\n\nAdd this to your alsa-base.conf file in modprobe.d:\n\n```\n/etc/modprobe.d/alsa-base.conf\n```\n\n```\n# Intel Corporation Haswell-ULT HD Audio Controller\noptions snd-hda-intel index=0 model=auto vid=8086 pid=0a0c\n# Intel Corporation 8 Series HD Audio Controller\noptions snd-hda-intel index=1 model=auto vid=8086 pid=9c20\n```\n\n"
    },
    {
      "title": "Turn off beep sound",
      "level": 3,
      "content": "See PC speaker#Disabling the PC speaker.\n\n"
    }
  ]
}