{
  "title": "Dell XPS 13 (9315) (Español)",
  "url": "https://wiki.archlinux.org/title/Dell_XPS_13_(9315)_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nDispositivo | ID CPI/USB | ¿Funciona?\nInalámbrico |  | Sí\nBluetooth |  | Sí\nAudio |  | Sí\nTouchpad |  | Untested\nWebcam |  | No\nWebcam infrarroja |  | No\nSensor de huella dactilar | 27c6:63ac | Sí\nSensor de luz ambiente |  | Sí\n\nEdición Dell XPS 2022.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "En algunas unidades, la unidad NVMe está configurada para funcionar en modo RAID de forma predeterminada. Esto puede hacer que el cargador de arranque no encuentre tu disco de arranque. Para solucionar esto, presiona F2 para ingresar a la UEFI de Dell. Ve a Almacenamiento, Operación NVMe y asegúrate de que esté seleccionado el modo \"Seleccionar AHCI/NVMe\". Todos los demás sistemas operativos instalados antes de cambiar esta configuración deben reinstalarse después de cambiarla.\n\nPara arrancar correctamente el medio de instalación, deberás desactivar Arranque Seguro.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "Esta laptop requiere el firmware sof-firmware para que la tarjeta de sonido funcione.\n\n"
    },
    {
      "title": "Sensor de huella dactilar",
      "level": 2,
      "content": "El sensor de huella dactilar se puede utilizar instalando el controlador propietario de Ubuntu lanzado por Dell y Goodix. Esto requiere una versión diferente de libfprint, libfprint-tod-gitAUR. Esta es una versión más nueva destinada a ser utilizada solo con sensores de huellas como el de el XPS.\n\nEl controlador propietario está disponible como libfprint-2-tod1-xps9300-binAUR. Alternativamente, también se puede instalar manualmente desde el repositorio de Dell extrayendo el archivo Debian y copiando su contenido.\n\nEl resto del proceso es idéntico al descrito en fprint: solo asegúrate de no instalar la versión de libfprint en los repositorios oficiales, ya que entra en conflicto con libfprint-tod-git.\n\n"
    },
    {
      "title": "Sensor de luz ambiental",
      "level": 2,
      "content": "Instala iio-sensor-proxy para habilitar el brillo automático en Gnome.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Controlador de cámara y huella dactilar para Ubuntu 20.04 LTS\n\n"
    }
  ]
}