{
  "title": "Depuração - Obtendo Rastros",
  "url": "https://wiki.archlinux.org/title/Depura%C3%A7%C3%A3o_-_Obtendo_Rastros",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Solução de problemas gerais\n- Diretrizes de relatórios de erro\n- Step-by-step debugging guide\n\nEsse artigo visa ajudar na criação de um pacote de depuração do Arch e usá-lo para fornecer informações de rastro e depuração para relatar bugs de software para desenvolvedores.\n\nNormalmente, os arquivos executáveis têm símbolos removidos (strip) de contexto legível por humanos para torná-los menores. Além disso, as informações de depuração aprimoradas geralmente não são adicionadas ao executável em primeiro lugar, o que reduz drasticamente a qualidade do rastreamento. Portanto, antes de obter rastreamentos com informações de depuração, é necessário recompilar o pacote sem remover e com informações de depuração.\n\n"
    },
    {
      "title": "Nomes de pacotes",
      "level": 2,
      "content": "A primeira coisa a fazer é obter os nomes dos pacotes que precisam ser recompilados.\n\nAo procurar por mensagens de depuração, como, por exemplo, usando gdb em um despejo de núcleo:\n\n```\n[...]\nBacktrace was generated from '/usr/bin/epiphany'\n\n(no debugging symbols found)\nUsing host libthread_db library \"/lib/libthread_db.so.1\".\n(no debugging symbols found)\n[Thread debugging using libthread_db enabled]\n[New Thread -1241265952 (LWP 12630)]\n(no debugging symbols found)\n0xb7f25410 in __kernel_vsyscall ()\n#0  0xb7f25410 in __kernel_vsyscall ()\n#1  0xb741b45b in ?? () from /lib/libpthread.so.0\n[...]\n```\n\n?? mostra onde a informação de depuração está faltando, assim como o nome da biblioteca ou executável que chamou a função. Similarmente, quando (no debugging symbols found) aparece, você deve procurar pelos nomes de arquivos mencionados. Por exemplo, com pacman:\n\n```\n$ pacman -Qo /lib/libthread_db.so.1\n/lib/libthread_db.so.1 pertence a glibc 2.5-8\n```\n\nO pacote é chamado glibc na versão 2.5-8. Repita essa etapa para todo pacote que precisa de depuração.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 2,
      "content": "Para compilar um pacote a partir do fonte, o arquivo PKGBUILD file é necessário. Veja ABS (Português) para pacotes nos repositórios oficiais, e AUR (Português)#Obtendo arquivos de compilação para pacotes no AUR.\n\n"
    },
    {
      "title": "Configurações de compilação",
      "level": 2,
      "content": "Neste estágio, você pode modificar o arquivo de configuração global do makepkg se você for usá-lo apenas para propósito de depuração. Nos demais casos, você deve modificar o arquivo PKGBUILD do pacote apenas para cada pacote que você gostaria de recompilar.\n\n"
    },
    {
      "title": "Geral",
      "level": 3,
      "content": "Desde o pacman 4.1, /etc/makepkg.conf possui flags de depuração de compilação em DEBUG_CFLAGS e DEBUG_CXXFLAGS. Para usá-las, habilite a opção do makepkg debug e desabilite strip.\n\n```\nOPTIONS+=(debug !strip)\n```\n\nEstas configurações vão forçar a compilação com símbolos de depuração e vai desabilitar a remoção deles dos executáveis. Para aplicar essa configuração a um único pacote, modifique o PKGBUILD:\n\n```\noptions=(debug !strip)\n```\n\nAlternativamente, você pode colocar as informações de depuração em um pacote separado habilitando debug e strip, símbolos de depuração serão então removidos do pacote principal e colocados, junto com seus arquivos fontes para ajudar a analisá-los no depurador, em um pacote separado foo-debug.\n\nNote que certos pacotes como glibc são removidos. Verifique o PKGBUILD para seções como:\n\n```\nstrip $STRIP_BINARIES usr/bin/{gencat,getconf,getent,iconv,iconvconfig} \\\n                      usr/bin/{ldconfig,locale,localedef,nscd,makedb} \\\n                      usr/bin/{pcprofiledump,pldd,rpcgen,sln,sprof} \\\n                      usr/lib/getconf/*\n\nstrip $STRIP_STATIC usr/lib/*.a\n\nstrip $STRIP_SHARED usr/lib/{libanl,libBrokenLocale,libcidn,libcrypt}-*.so \\\n                    usr/lib/libnss_{compat,db,dns,files,hesiod,nis,nisplus}-*.so \\\n                    usr/lib/{libdl,libm,libnsl,libresolv,librt,libutil}-*.so \\\n                    usr/lib/{libmemusage,libpcprofile,libSegFault}.so \\\n                    usr/lib/{audit,gconv}/*.so\n```\n\nE, então, remova onde apropriado.\n\n"
    },
    {
      "title": "dhcpcd",
      "level": 3,
      "content": "Lembre-se de passar o sinalizador --debug para o script configure ao compilar dhcpcd.\n\n"
    },
    {
      "title": "Compilando e instalando o pacote",
      "level": 2,
      "content": "Compile o pacote a partir do fonte usando makepkg no diretório do PKGBUILD. Isso pode levar algum tempo:\n\n```\n$ makepkg\n```\n\nEntão, instale o pacote compilado:\n\n```\n# pacman -U glibc-2.26-1-x86_64.pkg.tar.gz\n```\n\n"
    },
    {
      "title": "Obtendo o rastro",
      "level": 2,
      "content": "O backtrace real (ou rastro de pilha) pode agora ser obtido por meio de, p.ex. gdb, o GNU Debugger. Execute-o através de:\n\n```\n# gdb /caminho/para/arquivo\n```\n\nou:\n\n```\n# gdb\n(gdb) exec /caminho/para/arquivo\n```\n\nO caminho é opcional, se já definido na variável $PATH.\n\nEntão, dentro do gdb, digite run seguido por quaisquer argumentos que você deseje que o programa inicie com, p.ex.:\n\n```\n(gdb) run --no-daemon --verbose\n```\n\npara iniciar a execução do arquivo. Faça o que for necessário para evocar o erro. Para registrar log, digite as linhas:\n\n```\n(gdb) set logging file rastro.log\n(gdb) set logging on\n```\n\ne então:\n\n```\n(gdb) thread apply all bt full\n```\n\npara emitir o rastro para rastro.log no diretório no qual gdb foi iniciado. Para sair, digite:\n\n```\n(gdb) set logging off\n(gdb) quit\n```\n\n```\n# gdb /usr/bin/python\n(gdb) run <aplicativo em python>\n```\n\nVocê também pode depurar um aplicativo em execução, p.ex.:\n\n```\n# gdb --pid=$(pidof firefox)\n (gdb) continue\n```\n\nPara depurar um aplicativo que já travou, você vai querer usar o gdb despejo de núcleo.\n\n"
    },
    {
      "title": "Conclusão",
      "level": 2,
      "content": "Use o rastro de pilha completo para informar os desenvolvedores de um erro que você descobriu. Isso será muito apreciado por eles e ajudará a melhorar o seu programa favorito\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Debian Wiki - Como obter um backtrace\n- Gentoo Wiki - Backtraces with Gentoo\n- Fedora - StackTraces\n- GNOME - Getting Stack Traces\n- mini-introdução ao gdb\n\n"
    }
  ]
}