{
  "title": "Desktop environment (Italiano)",
  "url": "https://wiki.archlinux.org/title/Desktop_environment_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articoli correlati\n\n- Comparison of desktop environments\n- Category:Freedesktop.org\n\nUn ambiente desktop (in inglese 'desktop environment' o 'DE') è un'implementazione della cosiddetta metafora della scrivania composta da un insieme di programmi che condividono un'interfaccia utente grafica (GUI) comune.\n\n"
    },
    {
      "title": "Panoramica",
      "level": 2,
      "content": "Un ambiente desktop unisce diversi componenti allo scopo di fornire i comuni elementi tipici di un'interfaccia utente grafica quali icone, barre degli strumenti, immagini di sfondo e widget per il desktop. Inoltre la maggior parte degli ambienti desktop include una serie di applicazioni e strumenti integrati. In particolare, gli ambienti desktop forniscono il proprio window manager, il quale può tuttavia di norma essere sostituito con un altro window manager compatibile.\n\nL'utente è libero configurare il proprio ambiente GUI in diversi modi. Gli ambienti desktop si limitano a mettere a disposizione strumenti completi e pratici a tal fine. È importante notare che gli utenti sono liberi di utilizzare diverse combinazioni di applicazioni di vari ambienti desktop. Ad esempio, un utente KDE può installare ed eseguire applicazioni GNOME come il browser web Epiphany, qualora lo dovesse preferire al browser web Konqueror, predefinito di KDE. Uno degli svantaggi insiti in questo approccio è dato da fatto che molte delle applicazioni fornite dagli ambienti desktop sono largamente dipendenti dalle librerie su cui questi sono basati. Di conseguenza, per installare applicazioni facenti parte di diversi ambienti desktop sarà necessario installare un numero maggiore di dipendenze. Gli utenti che desiderano limitare lo spazio occupato sul disco evitano nella maggior parte dei casi queste configurazioni ibride, o scelgono alternative che dipendano da un numero limitato di librerie esterne.\n\nInoltre, le applicazioni fornite da un ambiente desktop tendono a integrarsi meglio nei propri ambienti nativi. A un livello esterno, l'utilizzo più ambienti con diversi widget toolkit produrrà delle discrepanze visive (vale a dire interfacce con icone e stili di widget diversi). In termini di usabilità, gli ambienti ibridi potrebbero presentare differenze in termini di funzionalità (ad es. clic singolo o clic doppio sulle icone; funzionalità drag-and-drop) con potenziali elementi di confusione e comportamenti imprevisti.\n\n"
    },
    {
      "title": "Ufficialmente supportati",
      "level": 3,
      "content": "- Budgie — Budgie è un ambiente desktop progettato per l'utente moderno, con una particolare attenzione rivolta alla semplicità e all'eleganza.\n\n- Cinnamon — Cinnamon ha l'obiettivo di fornire un'esperienza utente di tipo tradizionale. Cinnamon è un fork di GNOME 3.\n\n- Cutefish — Cutefish è un ambiente desktop nuovo e moderno.\n\n- Deepin — L'interfaccia desktop e le applicazioni Deepin offrono un design intuitivo ed elegante, e rendono operazioni quali navigare, condividere, effettuare ricerche ecc. semplicemente divertenti.\n\n- Enlightenment — La shell desktop Enlightenment offre un window manager efficiente basato sulle librerie Enlightenment Foundation, oltre ad altri componenti essenziali di un ambiente desktop quali un file manager, icone per il desktop e widget. Supporta l'utilizzo di temi conservando al contempo ottimi livelli di prestazioni sia con componenti hardware datati che nei dispositivi embedded.\n\n- GNOME — L'ambiente desktop GNOME è un desktop dal look attraente e intuitivo, dotato una sessione moderna (GNOME) e di una classica (GNOME Classic).\n\n- GNOME Flashback — GNOME Flashback è una shell per GNOME 3 inizialmente nota come GNOME fallback mode. La struttura del desktop e la tecnologia alla sua base sono simili a quelle utilizzate in GNOME 2.\n\n- KDE Plasma — L'ambiente desktop KDE Plasma è un ambiente di lavoro familiare. Plasma mette a disposizione tutti gli strumenti necessari per un'esperienza desktop moderna e che permettono di essere immediatamente produttivi.\n\n- LXDE — Lightweight X11 Desktop Environment è un ambiente desktop veloce ed efficiente in termini di consumi energetici. Offre un'interfaccia moderna, supporto multi-lingua, scorciatoie standard per la tastiera e caratteristiche aggiuntive quali la navigazione tra i file mediante l'utilizzo di tab. Progettato per essere prima di tutto leggero, LXDE si contraddistingue per un impiego ridotto di risorse CPU e RAM rispetto ad altri ambienti.\n\n- LXQt — LXQt è il port Qt e la prossima versione di LXDE, l'ambente Lightweight Desktop Environment. È il risultato della fusione dei due progetti LXDE-Qt e Razor-qt: un ambiente desktop leggero, modulare, straordinariamente veloce e facile da utilizzare.\n\n- MATE — Mate offre agli utenti Linux un ambiente desktop dal look attraente basato su metafore di tipo tradizionale. Il progetto MATE ha avuto inizio come fork di GNOME 2, ma la versione attuale è basata su GTK 3.\n\n- Sugar — La piattaforma di apprendimento Sugar è un ambiente desktop composto da attività concepite per accompagnare i bambini di età compresa tra 5 e 12 anni nei processi di apprendimento grazie a elementi multimediali interattivi. Sugar è l'elemento centrale di uno sforzo congiunto a livello mondiale finalizzato a offrire a ogni bambino la possibilità di accedere a un'istruzione di qualità. È attualmente utilizzato da quasi un milione di bambini in tutto il mondo, in 40 diversi paesi e in 25 lingue. Sugar mette a disposizione gli strumenti necessari per aiutare le persone a condurre una vita appagante, offrendo loro la possibilità di accedere a un'istruzione di qualità, attualmente negata a molti.\n\n- UKUI — UKUI è un ambiente desktop Linux leggero, sviluppato sulla base delle librerie GTK e Qt. UKUI è l'ambiente desktop di default per Ubuntu kylin.\n\n- Xfce — Xfce incarna la filosofia UNIX tradizionale, basata su modularità e riusabilità. È costituito da una serie di componenti che offrono la piena funzionalità che ci si può aspettare da un moderno ambiente desktop, il tutto rimanendo un ambiente relativamente leggero. Questi componenti sono pacchettizzati separatamente, e possono pertanto essere selezionati individualmente per creare il proprio ambiente di lavoro personale ottimizzato.\n\n"
    },
    {
      "title": "Non ufficialmente supportati",
      "level": 3,
      "content": "- CDE — Common Desktop Environment è un ambiente desktop per Unix e OpenVMS, basato sul widget toolkit Motif. Era parte dello UNIX98 Workstation Product Standard, ed è stato a lungo il desktop Unix \"classico\" associato con le workstation Unix commerciali. Pur essendo un ambiente legato al passato, continua a essere mantenuto in vita con supporto anche per i sistemi Linux.\n\n- COSMIC — COSMIC è un ambiente desktop basato su Rust creato da System76 per Pop!_OS, ispirandosi a GNOME, altro ambiente desktop molto personalizzabile. La prima versione non è ancora stata ultimata, quindi è prevedibile la presenza di bug e di app incomplete.\n\n- EDE — Equinox Desktop Environment è un ambiente desktop progettato per essere semplice, estremamente leggero e veloce.\n\n- KDE 1 — adattato per funzionare nei sistemi moderni. Nonostante si tratti di un progetto rivolto principalmente ai nostalgici, risulta ora funzionante e può essere utilizzato per le operazioni quotidiane. Nell'AUR è inoltre presente un numero crescente di applicazioni KDE 1.\n\n- Liri — Liri è un ambiente desktop con funzioni e design moderni. Liri è la fusione dei progetti Hawaii, Papyros e Liri. Altamente sperimentale.\n\n- Lumina — Lumina è un ambiente desktop leggero scritto in Qt 5 per FreeBSD, che utilizza Fluxbox come window manager.\n\n- Moksha — Si tratta di un fork di Enlightenment attualmente utilizzato come ambiente desktop di default nella distribuzione Bodhi Linux, basata su Ubuntu.\n\n- Pantheon — Pantheon è l'ambiente desktop originariamente creato per la distribuzione elementary OS. È scritto da zero utilizzando Vala e il toolkit GTK3. In termini di usabilità e aspetto, questo desktop presenta alcune somiglianze con GNOME Shell e macOS.\n\n- PaperDE — Ambiente desktop realizzato sulla base di Qt/Wayland e wayfire.\n\n- Phosh — Phosh è una shell di interfaccia utente Wayland basata su GNOME, utile sui dispositivi mobile.\n\n- Plasma Mobile — Plasma Mobile è un ambiente desktop specifico per i dispositivi mobile, realizzato sulla base dello stack KDE Plasma e di Wayland.\n\n- theDesk — theDesk è un ambiente desktop la cui finalità è offrire il massimo grado di trasparenza possibile. Utilizza Qt 5 come widget toolkit e KWin come window manager.\n\n- Trinity — Il progetto Trinity Desktop Environment (TDE) è un ambiente desktop per sistemi operativi Unix-like il cui obiettivo principale è riproporre lo stile di computing di KDE 3.5.\n\n- Maui Shell — Maui Shell è una shell basata sul principio di convergenza tra computer desktop, tablet e telefoni cellulari.\n\n"
    },
    {
      "title": "Ambienti personalizzati",
      "level": 2,
      "content": "Gli ambienti desktop rappresentano il modo più semplice per installare un ambiente grafico \"completo\". Tuttavia, gli utenti hanno a disposizione diverse opzioni per creare e personalizzare in libertà il proprio ambiente grafico, nel caso nessuno degli ambienti desktop più diffusi dovesse soddisfare le loro esigenze. In generale, per creare un ambiente personalizzato è necessario selezionare un window manager o un compositor, una barra delle applicazioni e una serie di applicazioni (una selezione minima include di norma un emulatore di terminale, un file manager e un editor di testo) che siano adatti alle proprie esigenze.\n\nGli altri componenti normalmente forniti dagli ambienti desktop sono:\n\n- Desktop compositor (Xorg)\n- Notification daemon\n- Display manager\n- Screen locker\n- Application launcher\n- Audio control\n- Backlight control\n- Media control\n- Polkit authentication agent\n- Power management\n- Screen capture\n- Screen temperature\n- Wallpaper setter\n- Logout dialogue\n- Default applications\n\n"
    },
    {
      "title": "Utilizzo di un altro window manager",
      "level": 3,
      "content": "Se l'ambiente desktop possiede il proprio articolo, vedere la relativa sezione Utilizzo di un altro window manager, in caso contrario consultare la documentazione ufficiale.\n\n- Budgie#Use a different window manager\n- Cinnamon#Use a different window manager\n- GNOME#Use a different window manager\n- KDE#Use a different window manager\n- LXDE#Use a different window manager\n- LXQt#Use a different window manager\n- MATE#Use a different window manager\n- Xfce#Use a different window manager\n\n"
    }
  ]
}