{
  "title": "Desktop environment (Русский)",
  "url": "https://wiki.archlinux.org/title/Desktop_environment_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Сравнение сред рабочего стола\n- Category:Freedesktop.org (Русский)\n\nСреда рабочего стола (DE) — реализация метафоры рабочего стола, состоящая из набора программ, объединённых общим графическим интерфейсом (GUI).\n\n"
    },
    {
      "title": "Обзор",
      "level": 2,
      "content": "Среда рабочего стола объединяет различные компоненты для предоставления базовых элементов графического интерфейса, например, значков, панелей, обоев и виджетов рабочего стола. Также большинство сред включает в себя интегрированный набор программ и утилит. Что самое важное, среды рабочего стола предоставляют свой собственный оконный менеджер, который обычно можно заменить совместимым вариантом.\n\nПользователю даётся возможность настраивать графический интерфейс разными путями. Как правило, среды рабочего стола предоставляют для этого готовые и удобные средства. Следует отметить, что пользователи могут комбинировать и одновременно запускать приложения, написанные для разных сред. Так, пользователь KDE может устанавливать и запускать приложения GNOME, например, веб-браузер Epiphany, если он нравится больше, чем Konqueror от KDE. Однако такой подход имеет и недостаток: многие графические приложения тесно связаны с тем или иным набором библиотек, которые входят в состав «родной» среды. В результате установка множества «неродных» приложений потребует установки большего количества зависимостей. Пользователи, которым нужно экономить место на диске, обычно избегают подобных смешанных окружений или выбирают альтернативные программы, которые зависят от небольшого числа внешних библиотек.\n\nКроме того, приложения в родной среде выглядят более единообразно и лучше в неё интегрируются. Приложения, написанные с использованием разных библиотек компонентов интерфейса, могут выглядеть несогласованно (использовать разные наборы иконок и стили оформления компонентов) и вести себя по-разному (например, использовать одиночный щелчок по значку вместо двойного или иметь другое поведение drag-and-drop), что может создавать путаницу или непредсказуемое поведение.\n\n"
    },
    {
      "title": "Официально поддерживаемые",
      "level": 3,
      "content": "- Budgie — Среда рабочего стола, рассчитанная на современного пользователя, где основное внимание уделяется простоте и элегантности.\n\n- Cinnamon — Cinnamon стремится предоставить пользователю более привычную и традиционную среду. Cinnamon — форк GNOME 3.\n\n- Cutefish — Новая и современная среда рабочего стола.\n\n- Deepin Desktop Environment — Интерфейс и приложения Deepin отличаются интуитивно понятным и элегантным дизайном. Перемещения, обмен, поиск и другие возможности теперь вызывают только удовольствие.\n\n- Enlightenment — Enlightenment предоставляет эффективный менеджер окон, основанный на библиотеках Enlightenment Foundation, а также другие необходимые компоненты вроде файлового менеджера, значков и виджетов. Он поддерживает темы и его можно запускать на устаревших компьютерах и встраиваемых устройствах.\n\n- GNOME — Популярная и интуитивная среда рабочего стола, которая поддерживает современный (GNOME) и классический (GNOME Classic) режимы.\n\n- GNOME Flashback — Оболочка для GNOME 3, которая изначально использовалась в нём для режима совместимости. Рабочий стол и технологии похожи на GNOME 2.\n\n- KDE Plasma — Хорошо известная рабочая среда. Она предоставляет все необходимые современному пользователю средства, тем самым обеспечивая продуктивность с самого начала.\n\n- LXDE — Лёгкая, быстрая и энергосберегающая среда рабочего стола для X11. Она предлагает современный интерфейс, поддержку различных языков, стандартные сочетания клавиш и дополнительные возможности, например, использование файлового менеджера со вкладками. При этом LXDE старается тратить меньше ресурсов процессора и оперативной памяти, чем другие окружения.\n\n- LXQt — Порт LXDE на Qt. LXQt объединяет проекты LXDE-Qt и Razor-qt, предоставляя легковесную, модульную, быструю и интуитивную среду рабочего стола.\n\n- MATE — Интуитивный, привлекательный и традиционный рабочий стол. Изначально MATE был форком GNOME 2, но на данный момент использует GTK 3.\n\n- Pantheon — Среда рабочего стола, изначально созданная для дистрибутива elementary OS. Она написана с нуля на основе Vala и GTK3, а внешний вид и удобство напоминают собой GNOME Shell и macOS.\n\n- Phosh — Wayland-оболочка для мобильных устройств, основанная на GNOME.\n\n- Sugar — The Sugar Learning Platform — окружение, состоящее из Комнат (Activities), которые разработаны для помощи в совместном обучении детей 5-12 лет с помощью мультимедийных приложений. Sugar направлен на предоставление детям по всему миру возможности получить качественное образование — на данный момент проект используется примерно миллионом детей на 25 языках в более чем 40 странах. Sugar даёт возможность помочь людям жить полноценной жизнью благодаря доступу к качественному образованию, которого сейчас так не хватает многим.\n\n- UKUI — Легковесная среда рабочего стола для Linux, использующая GTK и Qt. Также UKUI поставляется в качестве стандартной среды рабочего стола в Ubuntu Kylin.\n\n- Xfce — Xfce следует традиционной философии UNIX, основываясь на принципах модульности и повторного использования. Данная среда состоит из множества компонентов, составляющих полноценное современное рабочее окружение, при этом оставаясь относительно лёгкой. Эти компоненты распределены по разным пакетам, поэтому вы можете выбрать только нужные, чтобы создать оптимальное рабочее окружение.\n\n"
    },
    {
      "title": "Неофициально поддерживаемые",
      "level": 3,
      "content": "- CDE — Common Desktop Environment — среда рабочего стола для Unix и OpenVMS, основанная на Motif — библиотеке для создания графических интерфейсов. CDE входила в состав UNIX98 Workstation Product Standard и долгое время считалась «классической» средой рабочего стола среди коммерческих Unix-систем. Несмотря на то, что она устарела, её поддержка продолжается до сих пор, а также заявлена поддержка Linux.\n\n- COSMIC — Среда рабочего стола, написанная на Rust, созданная компанией System76 для Pop! OS и вдохновлённая сильно кастомизированным GNOME.\n\n- EDE — Equinox Desktop Environment — простая, быстрая и исключительно лёгкая среда рабочего стола.\n\n- KDE 1 — Первая версия K Desktop Environment, адаптированная для работы на современных системах. В основном для ностальгирующих, но может применяться и для повседневного использования. Также в AUR растёт количество приложений KDE 1.\n\n- Liri — Среда рабочего стола с современными возможностями и дизайном. Проект объединяет Hawaii, Papyros и Liri Project. Экспериментальная.\n\n- Lumina — Лёгкая среда рабочего стола для FreeBSD, написанная на Qt 5 и использующая Fluxbox в качестве оконного менеджера.\n\n- Maui Shell — Конвергентная оболочка для настольных компьютеров, планшетов и телефонов.\n\n- Moksha — Форк Enlightenment, используемый в качестве среды рабочего стола по умолчанию в дистрибутиве Bodhi Linux, основанном на Ubuntu.\n\n- PaperDE — Среда рабочего стола на основе Qt и Wayland-композитора Wayfire.\n\n- plainDE — Лёгкая среда рабочего стола для GNU/Linux, написанная на Qt. На данный момент включает в себя панель и центр управления.\n\n- Plasma Mobile — Среда для мобильных устройств, основанная на стеке KDE Plasma и Wayland.\n\n- theDesk — Среда рабочего стола, старающаяся быть как можно более прозрачной. В ней используются фреймворк Qt 5 и оконный менеджер KWin.\n\n- Trinity — Trinity Desktop Environment (TDE) — среда рабочего стола для Unix-подобных ОС, сохраняющая общий стиль неподдерживаемой в настоящее время среды KDE 3.5.\n\n"
    },
    {
      "title": "Создание персонализированной среды",
      "level": 2,
      "content": "Установка среды рабочего стола представляет собой наиболее простой способ получить полноценное графическое окружение. Однако пользователь может создать и персонализировать своё графическое окружение, если существующие не отвечают каким-либо требованиям. В общих чертах, создание своего окружения включает в себя выбор подходящих оконного менеджера для Xorg или композитора для Wayland, панели задач и набора программ (который, как минимум, обычно состоит из эмулятора терминала, файлового менеджера и текстового редактора).\n\nНиже приведён список программ, которые также обычно входят в состав сред рабочего стола.\n\n- Композитный менеджер (Xorg)\n- Демон уведомлений\n- Экранный менеджер\n- Блокировщик экрана\n- Средство запуска приложений\n- Управление звуком\n- Управление подсветкой\n- Управление плеером\n- Агент аутентификации Polkit\n- Управление питанием\n- Создание скриншотов\n- Цветовая коррекция\n- Менеджер обоев рабочего стола\n- Диалог завершения работы\n- Приложения по умолчанию\n\n"
    },
    {
      "title": "Использование стороннего оконного менеджера",
      "level": 3,
      "content": "Смотрите раздел об использовании стороннего менеджера в статье об интересующей вас среде рабочего стола или же обратитесь к официальной документации.\n\n- Budgie (Русский)#Использование иного менеджера окон\n- Cinnamon#Use a different window manager\n- GNOME (Русский)#Использование стороннего оконного менеджера\n- KDE (Русский)#Использование альтернативного оконного менеджера\n- LXDE (Русский)#Замена оконного менеджера\n- LXQt (Русский)#Использование другого менеджера окон\n- MATE#Use a different window manager\n- Xfce (Русский)#Использовать сторонний оконный менеджер\n\n"
    }
  ]
}