{
  "title": "Desktop environment (Українська)",
  "url": "https://wiki.archlinux.org/title/Desktop_environment_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Повʼязані статті\n\n- Comparison of desktop environments\n- Category:Freedesktop.org\n\nСтільниця (робочий стіл, середовище стільниці, англ. Desktop environment, DE) — це симуляція справжнього робочого столу зроблена з кількох програм, які мають спільний графічний інтерфейс (GUI).\n\n"
    },
    {
      "title": "Загальний огляд",
      "level": 2,
      "content": "Середовища стільниці складаються з багатьох елементів: значків, шпалер, панелей та віджетів. Окрім цього, до їх складу також входять різні пов'язані програми та інструменти. І, що важливіше, вони мають власну систему управління вікнами. Хоча, іноді, вони використовують просто підходящі загальні віконні системи.\n\nКористувачі можуть вільно налагоджувати графічну оболонку так, як їм заманеться. Середовище стільниці — це простий засіб що допомагає працювати з комп'ютером. В разі чого, користувачі можуть поєднувати програми з різних середовищ. Наприклад, користувачі KDE можуть користуватись програмами призначеними для GNOME, як-от веб переглядачем Epiphany замість вбудованого в KDE браузера Konqueror. Проблема такого підходу: багато програм залежать від бібліотек-складових стільниць. А значить, якщо установлювати програми з різних середовищ, то у вас буде значно більше встановлених залежностей. Якщо ви турбуєтесь про те, скільки пам'яті на диску займає ваша система, то уникайте змішування різних програм та надавайте перевагу тим, що менш залежать від зовнішніх бібліотек.\n\nБільше того, програми, переважно, добре поєднуються лише зі своїми рідними середовищами. Змішані середовища використовують різні графічні набори а тому виглядають неоднорідно (мають різні значки та стилі). Та й особливості використання в ним можуть відрізнятись (треба клацати на значки двічі чи один раз; чи можна їх перетягувати). А значить, ви будете плутатись коли користуватиметесь ними.\n\n"
    },
    {
      "title": "З офіційною підтримкою",
      "level": 3,
      "content": "- Budgie — стільниця, націлена на сучасного користувача, її цілі — простота й елегантність.\n\n- Cinnamon — намагається передати відчуття традиційних інтерфейсів. Проєкт Cinnamon походить від GNOME 3.\n\n- Cutefish — це нове та сучасне середовище стільниці.\n\n- Deepin — програми середовища Deepin мають простий та зрозумілий дизайн. Робота з ними легка і приносить задоволення.\n\n- Enlightenment — The Enlightenment desktop shell provides an efficient window manager based on the Enlightenment Foundation Libraries along with other essential desktop components like a file manager, desktop icons and widgets. It supports themes, while still being capable of performing on older hardware or embedded devices.\n\n- GNOME — приваблива і зрозуміла система. Існує у двох варіантах: сучасний (GNOME) та класичний (GNOME Classic).\n\n- GNOME Flashback — це оболонка для GNOME 3 яка спершу називалась GNOME fallback mode (запасний режим GNOME). Принцип роботи схожий до такого в GNOME 2.\n\n- KDE Plasma — має всім знайомий формат. Plasma має все необхідне для сучасного користувача прямо зі старту.\n\n- LXDE — легкий робочий стіл для X11. Швидкий та енергоефективний. Має новітній інтерфейс, підтримку багатьох мов, стандартні гарячі клавіші та додаткові можливості, як-от вкладки переглядача файлів. Принципово націлений на оптимізацію. LXDE старається менше навантажувати ЦП та оперативку.\n\n- LXQt — це Qt версія LXDE, легкого середовища стільнці. Утворений в результаті об'єднання проєктів LXDE-Qt та Razor-qt. Отриманий результат: легка, розподілена, блискавично-швидка та привітлива системи.\n\n- MATE — зрозумілий та привабливий інтерфейс для користувачів Linux що звикли до традиційного стилю систем. MATE починався як одна з версій GNOME 2. Зараз вона використовує GTK 3.\n\n- Sugar — це навчальна платформа, яка покликана допомогти дітям від 5 до 12 років навчатися разом. Sugar — це ключова частина всесвітнього руху, що бореться за те, щоб кожна дитина могла отримати освіту. Наразі нею користується більше мільйона дітей, що спілкуються понад 25-ма мовами та живуть в понад 40-ка країнах світу. Sugar дає людям можливість отримати пристойне життя через освіту, доступу до якої багато людей не має.\n\n- UKUI — легка Linux стільниця, що працює на основі як GTK так і Qt. UKUI це стільниця за замовчуванням в Ubuntu kylin.\n\n- Xfce — розробляється згідно філософії UNIX: на принципах повторного використання та модульності. Він складається з багатьох частин які разом складають повноцінну систему яка має всі необхідні можливості, при цьому залишаючись легкою. Вони постачаються окремо а тому, ви можете вибрати, які компоненти вам потрібні та зібрати систему під себе.\n\n"
    },
    {
      "title": "Неофіційні",
      "level": 3,
      "content": "- CDE — поширена стільниця на базі Motif для Unix і OpenVMS. Вона була однією з вимог стандарту UNIX98 Workstation Product Standard, та асоціювалась з „класичним“ виглядом комерційних Unix ПК. Хоч вона й дещо застаріла, її працездатність все ще підтримують, в тому числі й на Linux.\n\n- EDE — система, спроєктована, щоб бути надзвичайно швидкою та зрозумілою.\n\n- KDE 1 — „портована“ на нові платформи. В першу чергу з ностальгічних причин. Все ж, вона придатна для щоденного використання а число програм для KDE 1 в AUR тільки росте.\n\n- Liri — стільниця з сучасним дизайном. Liri це об'єднання проєктів Hawaii, Papyros та Liri. Дуже експериментальна система.\n\n- Lumina — це легка система написана на Qt 5 для FreeBSD яка використовує Fluxbox для управління вікнами.\n\n- Moksha — відділився від Enlightenment. Наразі використовується в Bodhi Linux що походить від Ubuntu.\n\n- Pantheon — була створена насамперед для elementary OS. Написана з нуля на Vala та GTK3. Націлена на зручність та привабливий зовнішній вигляд. Чимось схожа до GNOME та macOS.\n\n- PaperDE — стільниця, сконструйована на основі Qt/Wayland та wayfire.\n\n- Phosh — оболонка для Wayland що походить від GNOME. Підійде для телефонів\n\n- theDesk — намагається бути настільки простою, наскільки це можливо. Використовує Qt 5 та систему управління вікнами KWin.\n\n- Trinity — це проєкт, який ставить собі за мету зберегти відчуття KDE 3.5 для операційних систем Unix.\n\n"
    },
    {
      "title": "Саморобні",
      "level": 2,
      "content": "Перевага готової стільниці — її можна відразу використовувати, без додаткових налаштувань. Все ж, користувачі мають право налагоджувати свій комп'ютер так, як їм заманеться. Якщо комусь не підходить жодна з наявних стільниць, то він може зібрати свою. Переважно, для цього потрібно вибрати: систему управління вікнами або композитор, панель та інші програми. При мінімалістичному підході достатньо терміналу, переглядача файлів, і текстового редактора.\n\nІнші частини, які можуть знадобитись:\n\n- Композитор (Xorg)\n- Систему повідомлень\n- Екран входу\n- Блокувальник екрану\n- Меню запуску програм\n- Управління звуком\n- Управління яскравістю екрану\n- Управління медіа\n- Система авторизації\n- Управління батареєю\n- Запис екрану\n- Тон кольорів екрану\n- Екранні шпалери\n- Меню виходу\n- Управління програмами за замовчуванням\n\n"
    },
    {
      "title": "Заміна менеджера вікон",
      "level": 3,
      "content": "Якщо є стаття про стільницю, подивіться там розділ Use a different window manager. Або ж перегляньте офіційну документацію.\n\n- Budgie#Use a different window manager\n- Cinnamon#Use a different window manager\n- GNOME#Use a different window manager\n- KDE#Use a different window manager\n- LXDE#Use a different window manager\n- LXQt#Use a different window manager\n- MATE#Use a different window manager\n- Xfce#Use a different window manager\n\n"
    }
  ]
}