{
  "title": "Developer (Català)",
  "url": "https://wiki.archlinux.org/title/Developer_(Catal%C3%A0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "L'ArchWiki distingeix entre dos tipus de grups per definir nivells d'accés i rols d'usuari de forma independent. Comparat amb la convenció, popular a altres projectes MediaWiki, on cada rol es representa amb un grup amb el seu propi conjunt de drets, aquest enfocament és més flexible, permetent ajustar amb precisió el nivell d'accés de cada usuari independentment dels seus rols.\n\n"
    },
    {
      "title": "Nivells d'accés",
      "level": 2,
      "content": "Els nivells d'accés són grups amb un conjunt de drets atorgats no buit: el seu propòsit és definir els permisos que els usuaris tenen a la wiki.\n\nEls següents nivells d'accés són assignats automàticament per MediaWiki:\n\n- user és el grup per defecte per a tots els usuaris, i atorga els permisos bàsics de lectura i escriptura.\n- autoconfirmed és un grup assignat als usuaris amb un mínim de 20 edicions i 3 dies d'antiguitat [1]. Abans d'arribar a aquests llindars, les accions dels usuaris estan subjectes a algunes limitacions amb l'objectiu d'evitar atacs de contingut brossa.\n\nEls següents nivells d'accés poden ser assignats manualment per un bureaucrat. Els membres d'alguns rols específics poden sol·licitar de forma temporal o permanent l'assignació d'aquests nivells, per exemple, en adquirir-se o canviar-se un rol, o per atendre a necessitats individuals degudament justificades. Les assignacions permanents són possibles només després de la discussió interna i aprovació per part dels Administradors.\n\n- privilegedés un grup orientat als membres de confiança de la comunitat, amb l'objectiu de permetre editar la majoria de pàgines protegides, com les que es troben en l'espai de noms DeveloperWiki.\n- cosysop és un grup orientat als usuaris als quals se'ls ha confiat contribuir en el manteniment de la wiki. També poden editar la majoria de pàgines protegides.\n- sysop és un grup orientat als usuaris de gran confiança responsables de les tasques administratives crítiques de la wiki, com l'eliminació de pàgines o el bloqueig d'usuaris, i, per tant, requereix la demostració d'un coneixement extensiu de l'organització de la wiki. També tenen tots els drets dels grups checkuser, interface-admin i supress, creats automàticament per MediaWiki.\n- bureaucrat és un grup assignat als operadors de sistema que poden atorgar nivells d'accés i rols a altres usuaris.\n- bot és un grup per als ArchWiki:Bots.\n\n"
    },
    {
      "title": "Rols",
      "level": 2,
      "content": "Els rols són grups amb un conjunt buit de drets atorgats: el seu propòsit és clarificar la funció dels usuaris de la wiki a la comunitat Arch. En general, no s'eliminen els rols dels usuaris que es tornen inactius. Els Administradors es reserven el dret a variar per a cada usuari els nivells d'accés per defecte de cada rol.\n\n- Maintainers (maintainer) és un grup orientat als membres de l'equip de manteniment de l'ArchWiki. A tots els mantenidors se'ls hi assigna el nivell d'accés cosysop per defecte. Als mantenidors amb el nivell d'accés sysop se'ls diu Administradors. També hi ha un grup anomenat Administrator fellows (administrator_fellow) per als Administradors retirats.\n- Translators (translator) és un grup orientat als membres més actius d'un Equip de Traducció de l'ArchWiki o traductors individuals.\n- Arch Linux Developers (archdev) és un grup orientat als Desenvolupadors d'Arch.\n- ⧼group-archtu⧽ (archtu) és un grup orientat als Usuaris de Confiança d'Arch.\n- Arch Linux Support Staff (archstaff) és un grup orientat als usuaris amb altres rols a la comunitat d'Arch Linux: L'Equip de Testatge d'Arch s'assegura que els paquets pujats als repositoris testing són funcionals. L'Equip de Seguretat d'Arch fa el seguiment dels problemes de seguretat dels paquets a security.archlinux.org. Els moderadors del fòrum moderen els Fòrums d'Arch Linux Els operadors dels canals IRC moderen els Canals IRC principals.\n\n- A tots els mantenidors se'ls hi assigna el nivell d'accés cosysop per defecte. Als mantenidors amb el nivell d'accés sysop se'ls diu Administradors. També hi ha un grup anomenat Administrator fellows (administrator_fellow) per als Administradors retirats.\n\n- L'Equip de Testatge d'Arch s'assegura que els paquets pujats als repositoris testing són funcionals.\n- L'Equip de Seguretat d'Arch fa el seguiment dels problemes de seguretat dels paquets a security.archlinux.org.\n- Els moderadors del fòrum moderen els Fòrums d'Arch Linux\n- Els operadors dels canals IRC moderen els Canals IRC principals.\n\n"
    },
    {
      "title": "Vegeu també",
      "level": 2,
      "content": "- Pull request original\n\n"
    }
  ]
}