{
  "title": "Device file (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Device_file_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "İlgili makaleler\n\n- Persistent block device naming\n\nİngilizce Vikipedi'den:\n\nTekil Hiyerarşik Klasör Yapısı'na göre Linux'ta bu dosyalar /dev dizinindedir.\n\nArch Linux'ta ise aygıt düğümleri udev tarafından yönetilir.\n\n"
    },
    {
      "title": "Blok aygıtlar",
      "level": 2,
      "content": "Blok aygıt, donanıma, arabelleklenen erişim sağlayan özel bir dosyadır. Daha ayrıntılı bir açıklama ve sanal dosya sistemi aygıtlarının karşılaştırması için Wikipedia:Device file#Block devices İngilizce Vikipedi makalesine bakın.\n\n"
    },
    {
      "title": "Blok aygıt isimleri",
      "level": 3,
      "content": "Aygıt isminin başlangıcı, çekirdeğin blok aygıtları yönetmek için kullandığı sürücü alt sistemini belirtir.\n\n"
    },
    {
      "title": "SCSI",
      "level": 4,
      "content": "Sabit diskler, SSD'ler ve flaş sürücüler gibi SCSI komutunu destekleyen depolama aygıtlarının (SCSI, SAS, UASP), ATA'ların (PATA, SATA) veya USB büyük depolama aygıtlarının bağlantıları çekirdeğin SCSI sürücü alt sistemi ile yürütülmektedir. Tüm hepsi aynı isimlendirme şemasını paylaşır.\n\nBu aygıtların ismi sd ile başlar. Ardından ise ilk keşfedilen aygıt (sda) a'dan başlayacak şekilde küçük harfler eklenir. Sonrasında ikinci keşfedilen aygıt için b harfi atanır ve isimlendirme bu şekilde devam eder.\n\nÖrnekler:\n\n- /dev/sda - aygıt a, ilk keşfedilen aygıt.\n- /dev/sde - aygıt e, beşinci keşfedilen aygıt.\n\n"
    },
    {
      "title": "NVMe",
      "level": 4,
      "content": "NVM Express (NVMe) ile bağlantısı kurulan depolama aygıtlarının (örneğin SSD'ler) isimleri nvme ile başlar. Ardından aygıt denetçisi için 0'dan başlayacak şekilde bir sayı verilir (ilk keşfedilen NVMe denetçisi için nvme0, ikincisi için nvme1 olacak şekilde). Sonrasında \"n\" harfi ve 1 ile başlayacak şekilde bir sayı gelir. Bu sayı denetçideki ad alanını belirtir. Örneğin ilk keşfedilen denetçideki ilk keşfedilen ad alanı için nvme0n1, ilk keşfedilen denetçideki ikinci keşfedilen ad alanı için nvme0n2.\n\nÖrnekler:\n\n- /dev/nvme0n1 - 0. denetçideki 1. aygıt, ilk keşfedilen denetçideki ilk keşfedilen aygıt.\n- /dev/nvme2n5 - 2. denetçideki 5. aygıt, üçüncü keşfedilen denetçideki beşinci keşfedilen aygıt.\n\n"
    },
    {
      "title": "MMC",
      "level": 4,
      "content": "SD kartlar, MMC kartlar ve eMMC depolama aygıtları, çekirdeğin mmc sürücüsü ile yönetilir ve bu aygıtların isimleri mmcblk ile başlar. Ardından aygıtı belirten 0 ile başlayacak şekilde bir sayı ile devam eder, örneğin ilk keşfedilen aygıt mmcblk0, ikinci keşfedilen aygıt mmcblk1 olacak şekilde isimlendirilir.\n\nÖrnekler:\n\n- /dev/mmcblk0 - 0. aygıt, ilk keşfedilen aygıt.\n- /dev/mmcblk4 - 4. aygıt, beşinci keşfedilen aygıt.\n\n"
    },
    {
      "title": "SCSI optik disk sürücüsü",
      "level": 4,
      "content": "SCSI sürücü alt sistemi tarafından desteklenen bir arabirim ile bağlanmış olan optik disk sürücülerinin (ODD'ler) isimleri sr ile başlar. Sonrasında 0'dan başlayacak şekilde bir sayı eklenir, örneğin ilk keşfedilen aygıt için sr0, ikinci keşfedilen aygıt için sr1 olacak şekilde devam eder.\n\nEk olarak Udev, /dev/sr0 aygıtına sembolik bağlantı olan /dev/cdrom aygıtını sağlar. Bu aygıtın ismi, sürücünün desteklediği disk tipi veya takılmış olan medya aygıtından bağımsız olarak her zaman cdrom olarak kalır.\n\nÖrnekler:\n\n- /dev/sr0 - 0. optik disk sürücüsü, ilk keşfedilen optik disk sürücüsü.\n- /dev/sr4 - 4. optik disk sürücüsü, beşinci keşfedilen disk sürücüsü.\n- /dev/cdrom - /dev/sr0'a sembolik bağlantı.\n\n"
    },
    {
      "title": "virtio-blk",
      "level": 4,
      "content": "virtio blok aygıt arabirimine (virtio-blk) bağlı olan sürücülerin isimleri vd ile başlar ve ardından ilk algılanan aygıt a ile başlayacak şekilde (vda)bir küçük harfle devam eder. İkinci aygıt ise b harfi ile devam eder (vdb) ve isimlendirme alfabetik bir şekilde yapılmış olur.\n\nÖrnekler:\n\n- /dev/vda - aygıt a, ilk keşfedilen aygıt.\n- /dev/vde - aygıt e, beşinci keşfedilen aygıt.\n\n"
    },
    {
      "title": "Bölümlendirme",
      "level": 4,
      "content": "Bölüm aygıt isimleri, sürücü aygıtının ismi ve bölüme bölümlendirme tablosunda atanan sayının birleşiminden oluşur, yani /dev/aygıtbölüm şeklinde bir isimlendirmeye sahip olur. Aygıt ismi sayı ile biten sürücüler için sürücü ismi ve bölüm sırası \"p\" harfi ile ayrılır, yani /dev/sürücüpbölüm şeklinde.\n\nÖrnekler:\n\n- /dev/sda1 - /dev/sda'daki 1. bölüm.\n- /dev/nvme2n5p3 - /dev/nvme2n5'deki 3. bölüm\n- /dev/mmcblk3p4 - /dev/mmcblk3'teki 4. bölüm.\n- /dev/vda1 - /dev/vda'daki 1. bölüm.\n- /dev/loop0p2 - /dev/loop0'daki 2. bölüm\n\n"
    },
    {
      "title": "lsblk",
      "level": 4,
      "content": "util-linux paketi, blok aygıtları listeleyen lsblk(8) aracını sağlar, örneğin:\n\n```\n$ lsblk --fs\n```\n\n```\nNAME   FSTYPE   LABEL       UUID                                 MOUNTPOINT\nsda\n├─sda1 vfat                 C4DA-2C4D                            /boot\n├─sda2 swap                 5b1564b2-2e2c-452c-bcfa-d1f572ae99f2 [SWAP]\n└─sda3 ext4                 56adc99b-a61e-46af-aab7-a6d07e504652 /\n```\n\nYukarıdaki örnekte sadece bir aygıt (sda) kullanılabilir hâldedir, bu aygıt üç bölümden oluşmaktadır (sda1'den sda3'e) ve hepsi farklı bir dosya sistemine sahiptir.\n\n-o/--output seçeneği ile çıktısı verilecek olan aktif sütunların listesini belirtebilirsiniz.\n\n```\n# lsblk --output NAME,PTTYPE,PARTLABEL,FSTYPE,FSVER,LABEL,FSSIZE,FSAVAIL,FSUSE%,MOUNTPOINTS\n```\n\n```\nNAME             PTTYPE PARTLABEL       FSTYPE      FSVER LABEL          FSSIZE FSAVAIL FSUSE% MOUNTPOINTS\nsda              gpt                                                                           \n└─sda1           gpt    cryptdata1      crypto_LUKS 2                                          \n  └─data1                               btrfs             data1            7.3T    2.3T    68% /mnt/data\nsdb              gpt                                                                           \n└─sdb1           gpt    cryptdata2      crypto_LUKS 2                                          \n  └─data2                               btrfs             data1                                \nsdc              gpt                                                                           \n└─sdc1           gpt    cappdata        crypto_LUKS 2                                          \n  └─appdata                             ext4        1.0   appdata          3.6T    3.4T     0% /mnt/appdata\nsdd              gpt                                                                           \n└─sdd1           gpt    cappdata_backup crypto_LUKS 2                                          \n  └─appdata_back                        ext4        1.0   appdata_backup                       \nnvme1n1          gpt                                                                           \n├─nvme1n1p1      gpt    BACKUP_EFI      vfat        FAT32 EFI                4G    3.9G     2% /boot\n├─nvme1n1p2      gpt    backup_swap                                                            \n├─nvme1n1p3      gpt    csys1           crypto_LUKS 2                                          \n│ └─sys1                                btrfs             arch1                                \n└─nvme1n1p4      gpt    cext1           crypto_LUKS 2                                          \n  └─ext1                                btrfs             ext0fs                               \nnvme0n1          gpt                                                                           \n├─nvme0n1p1      gpt    EFI             vfat        FAT32 EFI                                  \n├─nvme0n1p2      gpt    cswap                                                                  \n├─nvme0n1p3      gpt    csys0           crypto_LUKS 2     sys0parent                           \n│ └─sys0                                btrfs             arch0             60G   56.2G     3% /\n└─nvme0n1p4      gpt    cext0           crypto_LUKS 2                                          \n  └─ext0                                btrfs             ext0fs         389.2G  388.1G     0% /home\n```\n\nYukarıdaki örnekte -f/--fs seçeneğinin sunduğu sütunlardan temel alınmıştır, UUID sütunu çıkarılıp birden fazla diski tanımlamada işe yarayan bölüm etiketi ve disk boyutu sütunları eklenmiştir. lsblk --help komutu ile desteklenen tüm sütunların listesini görebilirsiniz.\n\n"
    },
    {
      "title": "wipefs",
      "level": 4,
      "content": "wipefs dosya sistemlerini, RAID'leri veya bölümlendirme tablosu imzalarını (sihirli dizgiler veya magic strings) belirlediğiniz bir aygıttan libblkid(3) paketine görünmez hâle getirmek için silebilirsiniz veya bu bilgileri listeleyebilirsiniz. Bu işlem aygıttan, dosya sistemlerinin kendisini veya herhangi bir veriyi silmez.\n\nDaha fazla bilgi için wipefs(8) dokümanına bakın.\n\nÖrneğin /dev/sdb aygıtından tüm imzaları silmek ve ~/wipefs-sdb-offset.bak dosyasında her bir imzanın yedeğini oluşturmak için:\n\n```\n# wipefs --all --backup /dev/sdb\n```\n\n"
    },
    {
      "title": "Sahte aygıtlar",
      "level": 2,
      "content": "Herhangi bir fiziksel aygıta bağlı olmayan aygıt düğümleri.\n\n- /dev/random, bkz. random(4)\n- /dev/shm\n- /dev/null, /dev/zero, bkz. null(4)\n- /dev/full, bkz. full(4)\n- /dev/ttyX, X sayı olacak şekilde\n\n"
    },
    {
      "title": "Ayrıca bakınız",
      "level": 2,
      "content": "- Linux allocated devices — The Linux Kernel documentation\n- Gentoo:Device file\n\n"
    }
  ]
}