{
  "title": "Dhcpd (Русский)",
  "url": "https://wiki.archlinux.org/title/Dhcpd_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- dhcpcd (Русский)\n\ndhcpd — реализация DHCP-сервера от Internet Systems Consortium. Может использоваться, к примеру, на машине, играющей роль маршрутизатора в локальной сети.\n\nNote: **(server)** \n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет dhcp.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "dhcpd предоставляет два файла юнитов, dhcpd4.service и dhcpd6.service, с помощью которых можно управлять демоном. Демоны запускаются на всех сетевых интерфейсах для IPv4 и IPv6 соответственно. Альтернативный вариант описан в разделе #Запуск на одном сетевом интерфейсе.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Присвойте статический адрес IPv4 тому сетевому интерфейсу, для которого вы хотите запустить DHCP-сервер (в примерах будет использоваться eth0). Обратите внимание, что у двух различных сетевых интерфейсов на одной машине не должны полностью совпадать первые три октета адреса.\n\n```\n# ip link set up dev eth0\n# ip addr add 139.96.30.100/24 dev eth0 # произвольный адрес для примера\n```\n\n- 192.168/16 (подсеть 192.168.0.0, маска подсети 255.255.0.0)\n- 172.16/12 (подсеть 172.16.0.0, маска подсети 255.240.0.0)\n- 10/8 (для больших сетей; подсеть 10.0.0.0, маска подсети 255.0.0.0)\n\nАвтоматическое назначение статического IP при загрузке системы описано в статье Настройка сети#Статический IP-адрес.\n\nСтандартный файл настроек, dhcpd.conf, содержит много незакомментированных примеров, поэтому следует переместить его в другое место, например\n\n```\n# cp /etc/dhcpd.conf /etc/dhcpd.conf.example\n```\n\nи создать на его месте новый.\n\nМинимальная конфигурация может выглядеть следующим образом:\n\n```\n/etc/dhcpd.conf\n```\n\n```\noption domain-name-servers 8.8.8.8, 8.8.8.4;\noption subnet-mask 255.255.255.0;\noption routers 139.96.30.100;\nsubnet 139.96.30.0 netmask 255.255.255.0 {\n  range 139.96.30.150 139.96.30.250;\n}\n```\n\nЕсли необходимо выдать фиксированный IP-адрес конкретному устройству, можно также указать настройки для отдельного хоста:\n\n```\n/etc/dhcpd.conf\n```\n\n```\noption domain-name-servers 8.8.8.8, 8.8.4.4;\noption subnet-mask 255.255.255.0;\noption routers 139.96.30.100;\nsubnet 139.96.30.0 netmask 255.255.255.0 {\n  range 139.96.30.150 139.96.30.250;\n}\nhost macbookpro{\n  hardware ethernet 70:56:81:22:33:44;\n  fixed-address 139.96.30.199;\n}\n```\n\nОпция domain-name-servers содержит адреса DNS-серверов, которые передаются клиентам. В данном примере используются публичные DNS-сервера Google. Если в вашей подсети уже есть DNS-серверы (например, предоставленные провайдером), следует указать их. Если на компьютере уже настроен собственный DNS-сервер, то укажите его адрес (139.96.30.100 в нашем примере).\n\nОпции subnet-mask и routers содержат маску подсети и список маршрутизаторов в этой подсети, соответственно. В большинстве случаев для небольших сетей подойдет маска 255.255.255.0, а в качестве маршрутизатора используется та же машина, на которой настроен DHCP-сервер.\n\nБлоки subnet содержат настройки для отдельных подсетей, которые сопоставляются сетевым интерфейсам, на которых запущен dhcpd. В примере определена одна подсеть 139.96.30.0/24 за интерфейсом eth0, для которой задан диапазон IP-адресов. Подключаемым клиентам будут присваиваться адреса из этого диапазона.\n\n"
    },
    {
      "title": "Запуск на одном сетевом интерфейсе",
      "level": 3,
      "content": "Если ваш компьютер уже является частью одной или нескольких сетей, может возникнуть ситуация, когда адреса будут выдаваться в том числе и компьютерам из другой сети. Это можно исправить либо настройками dhcpd, либо запуском в качестве демона с помощью systemctl.\n\n"
    },
    {
      "title": "Настройки dhcpd",
      "level": 4,
      "content": "Чтобы исключить конкретный интерфейс, в файле настроек создайте пустой блок subnet для этого интерфейса:\n\n```\n/etc/dhcpd.conf\n```\n\n```\n# Исключить DHCP из демилитаризованной зоны (192.168.2.0/24)\nsubnet 192.168.2.0 netmask 255.255.255.0 {\n}\n```\n\n"
    },
    {
      "title": "Файл службы",
      "level": 4,
      "content": "В \"комплекте поставки\" dhcpd не предусмотрен юнит для запуска на одном интерфейсе, поэтому придётся создать его самостоятельно. Сначала скопируйте существующую службу:\n\n```\n# cp /usr/lib/systemd/system/dhcpd4.service /etc/systemd/system/dhcpd4@.service\n```\n\nЗатем отредактируйте строку ExecStart, добавив в неё спецификатор интерфейса:\n\n```\n/etc/systemd/system/dhcpd4@.service\n```\n\n```\n...\n[Service]\n...\nExecStart=/usr/bin/dhcpd -4 -q -cf /etc/dhcpd.conf -pf /run/dhcpd4/dhcpd.pid %I\n...\n```\n\nЭто юнит-шаблон, который привязывает процесс к определённому интерфейсу, например — dhcpd4@eth0.service. Здесь eth0 — название сетевого интерфейса; узнать интерфейсы вашей системы можно командой ip link.\n\n"
    },
    {
      "title": "Использование для PXE",
      "level": 3,
      "content": "Настройка для PXE выполняется следующими двумя параметрами:\n\n```\n/etc/dhcpd.conf\n```\n\n```\nnext-server 192.168.0.2;\nfilename \"/pxelinux.0\";\n```\n\nЭти строки можно указать как в блоке subnet, так и в настройках отдельного хоста host. next-server представляет собой адрес TFTP-сервера, а filename — имя образа для загрузки. Подробнее см. PXE.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Документация ISC DHCP\n\n"
    }
  ]
}