{
  "title": "Dhcpcd (Русский)",
  "url": "https://wiki.archlinux.org/title/Dhcpcd_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Настройка сети\n- Настройка беспроводной сети\n- dhcpd (Русский)\n\ndhcpcd — DHCP- и DHCPv6-клиент. В настоящий момент является наиболее полнофункциональным DHCP-клиентом с открытым исходным кодом. Подробнее о возможностях см. домашнюю страницу проекта.\n\nNote: **client** \n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет dhcpcd.\n\ndhcpcd-uiAUR — GTK-интерфейс для dhcpcd; в качестве альтернативы можно использовать wpa_supplicant. Среди возможностей — диалог настройки и выбор кодовой фразы для беспроводной сети.\n\ndhcpcd-ui-patchedAUR[ссылка недействительна: package not found] — улучшенная версия dhcpcd-uiAUR. AppIndicator вместо GtkStatusIcon, поддержка gtk3, иконка трея для KDE.\n\n"
    },
    {
      "title": "Запуск",
      "level": 2,
      "content": "Запустите/включите службу dhcpcd.service. Этот демон работает одновременно для всех сетевых интерфейсов.\n\nЕсли необходим демон для одного конкретного интерфейса, запустите/включите юнит-шаблон dhcpcd@интерфейс.service. Узнать имена имеющихся в системе сетевых интерфейсов можно по рекомендациям в Настройка сети#Обнаружение сетевых интерфейсов.\n\nРекомендуется использовать юниты-шаблоны; подробнее см. #dhcpcd и сетевые интерфейсы systemd. В результате запуска любой из служб интерфейсу присваивается динамический IP-адрес. Привязка статического адреса рассмотрена в разделе #Статический профиль.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Основной файл настроек — /etc/dhcpcd.conf. Некоторые полезные опции описаны ниже, подробнее см. dhcpcd.conf(5).\n\n"
    },
    {
      "title": "Статические маршруты",
      "level": 3,
      "content": "Если необходимо создать статический маршрут на клиентской машине, добавьте его в файл /etc/dhcpcd.exit-hook. Ниже приведён пример хук-скрипта, который добавляет маршрут к VPN-подсети 10.11.12.0/24 через шлюз на адресе 192.168.192.5:\n\n```\n/etc/dhcpcd.exit-hook\n```\n\n```\nip route add 10.11.12.0/24 via 192.168.192.5\n```\n\nВ этом файле можно указать несколько машрутов одновременно.\n\n"
    },
    {
      "title": "Идентификатор DHCP-клиента",
      "level": 3,
      "content": "Сервер опознаёт DHCP-клиент по одному из следующих идентификаторов:\n\n1. Имя хоста.\n1. MAC-адрес сетевого интерфейса, с которого устанавливается соединение.\n1. Identity Association ID (IAID), который представляет из себя некую абстракцию для удобства работы с различными настройками и/или интерфейсами в пределах конкретного хоста.\n1. DHCP Unique Identifier (DUID).\n\nБолее подробное описание можно найти в RFC 3315.\n\nВ зависимости от настроек DHCP-сервера те или иные параметры являются (не)обязательными в запросе на аренду адреса.\n\nЕсли dhcpcd с настройками по умолчанию не получает IP-адрес, то можно использовать следующие опции в файле dhcpcd.conf:\n\n- hostname — отправить серверу имя хоста, указанное в файле /etc/hostname.\n- clientid — отправить серверу MAC-адрес хоста.\n- iaid интерфейс — вычислить IAID и отправить серверу. Опция указывается в блоке соответствующего интерфейса (начинается с interface интерфейс, см. [1]). Применяется редко, чаще используется следующая вариант.\n- duid — отправить серверу комбинацию DUID и IAID.\n\nЗначение DUID задаётся в файле /var/lib/dhcpcd/duid. Чтобы DHCP-аренда завершилась успешно, DUID должен быть уникален в пределах системы и применяться ко всем интерфейсам, в то время как IAID задаётся для каждого сетевого интерфейса по отдельности (см. RFC 4361).\n\nОтдельно необходимо упомянуть о сетях с динамическим DNS — убедитесь, что все три идентификатора являются уникальными. Если DNS-сервер получит два одинаковых DUID (например, в виртуальной машине уникальны имя хоста и MAC, но DUID такой же, как и у основной системы), то второй запрос удалит предыдущий из соответствующей DNS-записи.\n\n"
    },
    {
      "title": "Статический профиль",
      "level": 3,
      "content": "Смысл параметров объясняется в статье Настройка сети. Чаще всего используются: название сетевого интерфейса, IP-адрес хоста, а также адреса сервера имён и маршрутизатора/шлюза.\n\nНастройки статического профиля хранятся в файле /etc/dhcpcd.conf:\n\n```\n/etc/dhcpcd.conf\n```\n\n```\ninterface eth0\nstatic ip_address=192.168.0.10/24\t\nstatic routers=192.168.0.1\nstatic domain_name_servers=192.168.0.1 8.8.8.8\n```\n\nВозможны и более сложные конфигурации, например, с параметром arping. Подробнее см. dhcpcd.conf(5).\n\n"
    },
    {
      "title": "Резервный профиль",
      "level": 4,
      "content": "Помимо статического профиля можно создать также запасной профиль на случай, если запрос DHCP-аренды завершится неудачно. Это особенно полезно для headless-систем, когда статический профиль выступает в качестве профиля \"режима восстановления\", чтобы гарантировать доступ к машине в любой ситуации.\n\nВ примере ниже сначала настраивается профиль static_eth0 для адреса 192.168.1.23, с шлюзом и сервером имён 192.168.1.1; затем профиль объявляется резервным для интерфейса eth0.\n\n```\n/etc/dhcpcd.conf\n```\n\n```\n# настройки статического профиля\nprofile static_eth0\nstatic ip_address=192.168.1.23/24\nstatic routers=192.168.1.1\nstatic domain_name_servers=192.168.1.1\n\n# резервный профиль для интерфейса eth0\ninterface eth0\nfallback static_eth0\n```\n\n"
    },
    {
      "title": "Хуки",
      "level": 2,
      "content": "dhcpcd исполняет сценарии из каталога /usr/lib/dhcpcd/dhcpcd-hooks/ в лексическом порядке. Подробнее см. dhcpcd.conf(5) и dhcpcd-run-hooks(8).\n\nNote: **всех** \n\n- Сценарий можно отключить параметром nohook.\n- Параметр env позволяет задать переменную окружения для всех хуков одновременно. Например, чтобы hostname-хук всегда устанавливал имя хоста, добавьте строку env force_hostname=YES.\n\n"
    },
    {
      "title": "10-wpa_supplicant",
      "level": 3,
      "content": "Создайте символическую ссылку, чтобы хук заработал. Ссылка гарантирует, что даже после обновления пакета будет использоваться последняя версия хука:\n\n```\n# ln -s /usr/share/dhcpcd/hooks/10-wpa_supplicant /usr/lib/dhcpcd/dhcpcd-hooks/\n```\n\nХук 10-wpa_supplicant автоматически запускает wpa_supplicant для беспроводного интерфейса, если:\n\n- отсутствует процесс wpa_supplicant, который уже слушает данный интерфейс.\n- существует файл настроек для wpa_supplicant. По умолчанию dhcpcd проверяет следующие файлы в указанном порядке:\n\n```\n/etc/wpa_supplicant/wpa_supplicant-интерфейс.conf\n/etc/wpa_supplicant/wpa_supplicant.conf\n/etc/wpa_supplicant-интерфейс.conf\n/etc/wpa_supplicant.conf\n```\n\nМожно также добавить свой файл настроек параметром env wpa_supplicant_conf=путь_к_файлу_нестроек в файле /etc/dhcpcd.conf.\n\nЕсли вы предпочитаете управлять беспроводными соединениями непосредственно через wpa_supplicant, хук может создавать нежелательные помехи в работе. Например, если вы остановите wpa_supplicant, хук может снова включить интерфейс. Кроме того, при использовании netctl-auto, wpa_supplicant запускается автоматически с настройками из файла /run/network/wpa_supplicant_интерфейс.conf, поэтому запускать его ещё раз хуком не нужно — во время загрузки это может привести к ошибкам при парсинге файла /etc/wpa_supplicant/wpa_supplicant.conf, который содержит стандартные настройки по умолчанию.\n\nЧтобы отключить хук, удалите созданную ранее символическую ссылку или добавьте строку nohook wpa_supplicant в файл dhcpcd.conf.\n\n"
    },
    {
      "title": "Отключение ARP-зондирования для ускорения DHCP",
      "level": 3,
      "content": "В dhcpcd реализованы рекомендации из стандарта DHCP (RFC 2131) о проверке факта выдачи IP-адреса посредством ARP. В домашних сетях эта возможность по сути бесполезна, поэтому можно сэкономить 5 секунд для каждого соединения, добавив следующую строку в /etc/dhcpcd.conf:\n\n```\nnoarp\n```\n\nТого же можно добиться опцией --noarp при запуске dhcpcd. ARP-зондирование будет отключено и соединения в DHCP-сетях станут создаваться быстрее.\n\n"
    },
    {
      "title": "Удаление DHCP-аренды",
      "level": 3,
      "content": "Файл /var/lib/dhcpcd/интерфейс.lease содержит текущую аренду, выданную интерфейсу DHCP-сервером. В случае беспроводного интерфейса файл будет называться /var/lib/dhcpcd/интерфейс-ssid.lease, где ssid — название беспроводной сети. Время предоставления аренды определяется по параметру файла mtime (время последнего изменения). Информация о последней аренде нужна, чтобы заправшивать один и тот же IP-адрес при каждой аренде — при условии, конечно, что он не был выдан другой машине на момент запроса. Если такое поведение DHCP-клиента вам не нужно, просто удалите данный файл.\n\nЕсли после удаления файла DHCP-сервер продолжает выдавать тот же IP-адрес, причина может быть в том, что он настроен опознавать клиентские машины по идентификатору DUID (см. #Идентификатор DHCP-клиента). Чтобы это проверить, остановите dhcpcd и удалите/переименуйте файл /var/lib/dhcpcd/duid. dhcpcd сгенерирует новый при следующем запуске.\n\nИмейте в виду, что DUID — постоянный идентификатор машины, он не меняется при перезагрузках и даже в случае смены сетевых интерфейсов. Если при переносе системы на другой компьютер скопировать файл /var/lib/dhcpcd/duid, то DHCP-сервер опознает машину как предыдущую.\n\n"
    },
    {
      "title": "Разные IP-адреса на машине с несколькими ОС",
      "level": 3,
      "content": "Если на вашей машине помимо Arch установлена OS X или Windows и вы хотите, чтобы IP-адреса в этих операционных системах были разные, то необходимо в каждой ОС задать отдельный DUID.\n\nВ Windows (после XP) DUID хранится в ключе реестра\n\n```\n\\HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Tcpip6\\Parameters\\Dhcpv6DUID\n```\n\nВ OS X он доступен непосредственно в Network\\adapter\\dhcp preferences panel.\n\nЕсли вы используете DHCP-сервер dnsmasq, разные DUID можно настроить правилами dhcp-host= в настройках.\n\n"
    },
    {
      "title": "/etc/resolv.conf",
      "level": 3,
      "content": "Если работает resolvconf, то вся DNS-информация будет пересылаться ему. В противном случае dhcpcd внесёт некоторые изменения в файл /etc/resolv.conf.\n\nЧтобы предотвратить перезапись файла /etc/resolv.conf, отключите хук /usr/lib/dhcpcd/dhcpcd-hooks/20-resolv.conf. Для этого добавьте следующую строку в конец файла /etc/dhcpcd.conf:\n\n```\nnohook resolv.conf\n```\n\nВ качестве альтернативы можно создать файл /etc/resolv.conf.head со списком необходимых DNS-серверов. dhcpcd вставит этот файл в начало /etc/resolv.conf.\n\nТакже можно настроить dhcpcd на постоянное использование одних и тех же DNS-серверов. Добавьте следующую строку в /etc/dhcpcd.conf, заменив ip_адреса_dns_серверов списком разделённых пробелами адресов:\n\n```\nstatic domain_name_servers=ip_адреса_dns_серверов\n```\n\nНапример, DNS-сервера Google:\n\n```\nstatic domain_name_servers=8.8.8.8 8.8.4.4\n```\n\n"
    },
    {
      "title": "Client ID",
      "level": 3,
      "content": "Если вы работаете в DHCPv4-сети с фильтрацией Client ID по MAC-адресам, возможно, придётся изменить строку\n\n```\n/etc/dhcpcd.conf\n```\n\n```\n# Связка DUID + IAID (DHCPv6) по RFC4361. \nduid\n```\n\nна\n\n```\n/etc/dhcpcd.conf\n```\n\n```\n# Client ID на основе аппаратного адреса интерфейса (DHCPv4).\nclientid\n```\n\nВ противном случае вы не получите аренду, поскольку сервер не распознает DHCPv6-идентификатор. Подробнее см. RFC 4361.\n\n"
    },
    {
      "title": "Отказ от IP-адреса",
      "level": 3,
      "content": "В некоторых ситуациях, например, когда два маршрутизатора соединены через VPN, могут возникнуть проблемы при неправильном присвоении IP-адреса. В этом случае необходимо сначала отказаться от IP-адреса\n\n```\n# dhcpcd -k\n```\n\nпосле чего запросить новый:\n\n```\n# dhcpcd\n```\n\nВозможно, эти две команды придётся повторить несколько раз.\n\n"
    },
    {
      "title": "Проблемы с нестандартными маршрутизаторами",
      "level": 3,
      "content": "Некоторые (нестандартные) маршрутизаторы не смогут устанавливать соединения, если не закомментирована строка\n\n```\nrequire dhcp_server_identifier\n```\n\nв файле /etc/dhcpcd.conf. Если в сети несколько DHCP-серверов (что встречается редко), то указанная проблема не проявляется; подробнее см. здесь.\n\n"
    },
    {
      "title": "dhcpcd и сетевые интерфейсы systemd",
      "level": 3,
      "content": "Удобство службы dhcpcd.service заключается в том, что она включается не для конкретного указанного интерфейса, а для всех интерфейсов сразу. С другой стороны, это может создать ситуацию гонок при загрузке, если systemd-udevd попытается присвоить предсказуемые имена интерфейсам:\n\n```\nerror changing net interface name wlan0 to wlp4s0: Device or resource busy\"\n```\n\nЧтобы этого избежать, следует запускать dhcpcd для отдельных интерфейсов как описано в разделе #Запуск. Следует помнить, однако, что юнит-шаблон не поддерживает \"горячее подключение\" проводных соединений и завершится неудачно, если сетевой кабель не воткнут. Обходное решение описано в разделе #Отмена тайм-аута.\n\nКроме того, можно использовать параметры denyinterfaces и allowinterfaces в файле dhcpcd.conf(5), чтобы запретить dhcpcd выполнять привязку к интерфейсам, имена которых установлены ядром, а не udev:\n\n```\ndenyinterfaces wlan* eth*\n```\n\n"
    },
    {
      "title": "Отмена тайм-аута",
      "level": 3,
      "content": "Если dhcpcd был запущен для отдельного интерфейса и не получил аренду в течение 30 секунд после запуска (например, сервер не работает или кабель не воткнут), он завершится с ошибкой.\n\nЧтобы dhcpcd ожидал бесконечно при каждом запуске, отредактируйте юнит, установив параметр timeout в значение 0:\n\n```\n/etc/systemd/system/dhcpcd@.service.d/timeout.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=/usr/bin/dhcpcd -w -q -t 0 %I\n```\n\nЧтобы dhcpcd ожидал аренду вообще всегда, настройте перезапуск юнита после завершения работы:\n\n```\n/etc/systemd/system/dhcpcd@.service.d/dhcpcdrestart.conf\n```\n\n```\n[Service]\nRestart=always\n```\n\n"
    },
    {
      "title": "Медленная загрузка из-за dhcpcd@.service",
      "level": 3,
      "content": "По умолчанию служба dhcpcd@.service ожидает выдачи IP-адреса перед переходом в фоновый режим (флаг -w команды dhcpcd). Если юнит включён, то загрузка системы может затянуться из-за ожидания IP-адреса. Чтобы это исправить, создайте drop-in файл юнита следующего содержания:\n\n```\n/etc/systemd/system/dhcpcd@.service.d/no-wait.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=/usr/bin/dhcpcd -b -q %I\n```\n\nСм. также FS#49685.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- dhcpcd(8)\n- dhcpcd.conf(5)\n\n"
    }
  ]
}