{
  "title": "Dhcpd (Português)",
  "url": "https://wiki.archlinux.org/title/Dhcpd_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- dhcpcd\n\nO dhcpd é o servidor DHCP da Internet Systems Consortium. Ele é útil, por exemplo, em uma máquina agindo como um roteador em uma rede local.\n\nNote: **(server)** \n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote dhcp, disponível nos repositórios oficiais.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "dhcpd inclui dois arquivos unit dhcpd4.service e dhcpd6.service, que podem ser usados para controlar o daemon. Eles iniciam o daemon em todas as interfaces de rede para IPv4 e IPv6, respectivamente. Veja #Ouvindo apenas em uma interface para uma alternativa.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Atribua um endereço IPv4 estático para a interface que você deseja usar (em nossos exemplos, usaremos eth0). Os 3 primeiros bytes deste endereço não podem ser exatamente o mesmo que os de outra interface.\n\n```\n# ip link set up dev eth0\n# ip addr add 139.96.30.100/24 dev eth0 # endereço arbitrário\n```\n\n- 192.168/16 (sub-rede 192.168.0.0, máscara de rede 255.255.0.0)\n- 172.16/12 (sub-rede 172.16.0.0, máscara de rede 255.240.0.0)\n- 10/8 (para redes grandes; sub-rede 10.0.0.0, máscara de rede 255.0.0.0)\n\nPara ter seu IP estático atribuído na inicialização, veja Configuração de rede#Endereço IP estático.\n\nO dhcpd.conf padrão contém muitos exemplos descomentados, então mude-o:\n\n```\n# cp /etc/dhcpd.conf /etc/dhcpd.conf.example\n```\n\nO arquivo de configuração mínimo pode se parecer com:\n\n```\n/etc/dhcpd.conf\n```\n\n```\noption domain-name-servers 8.8.8.8, 8.8.4.4;\noption subnet-mask 255.255.255.0;\noption routers 139.96.30.100;\nsubnet 139.96.30.0 netmask 255.255.255.0 {\n  range 139.96.30.150 139.96.30.250;\n}\n```\n\nSe você precisar fornecer um endereço IP fixo para um dispositivo único específico, você pode usar a seguinte sintaxe:\n\n```\n/etc/dhcpd.conf\n```\n\n```\noption domain-name-servers 8.8.8.8, 8.8.4.4;\noption subnet-mask 255.255.255.0;\noption routers 139.96.30.100;\nsubnet 139.96.30.0 netmask 255.255.255.0 {\n  range 139.96.30.150 139.96.30.250;\n\n  host macbookpro{\n   hardware ethernet 70:56:81:22:33:44;\n   fixed-address 139.96.30.199;\n  }\n}\n```\n\nA opção domain-name-servers contém endereços de servidores DNS que são fornecidos aos clientes. No nosso exemplo, estamos usando os servidores DNS públicos do Google. Se você conhece um servidor DNS local (por exemplo, fornecido pelo seu provedor de internet), você deve usá-lo. Se você configurou seu próprio DNS em uma máquina local, use seu endereço em sua sub-rede (por exemplo, g. 139.96.30.100 em nosso exemplo).\n\nsubnet-mask e routers define uma máscara de sub-rede e uma lista de roteadores disponíveis na sub-rede. Na maioria dos casos, para pequenas redes, você pode usar 255.255.255.0 como uma máscara e especificar um endereço IP da máquina em que você está configurando o servidor DHCP como roteador.\n\nsubnet define opções para sub-redes separadas, que são mapeadas para as interfaces de rede nas quais dhcpd está sendo executado. No nosso exemplo, esta é uma sub-rede 139.96.30.0/24 para interface única eth0, para a qual definimos o intervalo de endereços IP disponíveis. Os endereços desse intervalo serão atribuídos aos clientes conectados.\n\n"
    },
    {
      "title": "Ouvindo apenas em uma interface",
      "level": 3,
      "content": "Se o seu computador já faz parte de uma ou várias redes, pode ser um problema se seu computador começar a dar endereços IP para máquinas das outras redes. Isso pode ser feito configurando dhcpd ou iniciando como um daemon com systemctl.\n\n"
    },
    {
      "title": "Configurando dhcpd",
      "level": 4,
      "content": "Para excluir uma interface, você deve criar uma declaração vazia para a sub-rede que será configurada nessa interface.\n\nIsso é feito editando o arquivo de configuração (por exemplo):\n\n```\n/etc/dhcpd.conf\n```\n\n```\n# Nenhum serviço DHCP na rede DMZ (192.168.2.0/24)\nsubnet 192.168.2.0 netmask 255.255.255.0 {\n}\n```\n\n"
    },
    {
      "title": "Arquivo de serviço",
      "level": 4,
      "content": "Não há arquivos .service fornecidos por padrão para usar dhcpd apenas em uma interface, então você precisa criar um:\n\n```\n/etc/systemd/system/dhcpd4@.service\n```\n\n```\n[Unit]\nDescription=IPv4 DHCP server on %I\nWants=network.target\nAfter=network.target\n\n[Service]\nType=forking\nPIDFile=/run/dhcpd4.pid\nExecStart=/usr/bin/dhcpd -4 -q -pf /run/dhcpd4.pid %I\nKillSignal=SIGINT\n\n[Install]\nWantedBy=multi-user.target\n```\n\nEsse é um modelo de unit, que vincula-o a uma interface específica, por exemplo dhcpd4@eth0.service, sendoeth0 uma interface mostrada com ip link.\n\nÀs vezes, queremos esperar que a rede seja configurada, neste caso, a solução é fazer o serviço aguardar a network-online.target em vez de network.target:\n\n```\n/etc/systemd/system/dhcpd4@.service\n```\n\n```\n[Unit]\nWants=network-online.target\nAfter=network-online.target\n```\n\nPara que isso funcione, devemos habilitar outro serviço para que funcione:\n\n```\n# systemctl enable systemd-networkd-wait-online\n```\n\n"
    },
    {
      "title": "Usar para PXE",
      "level": 3,
      "content": "A configuração de PXE é feita com as duas opções a seguir:\n\n```\n/etc/dhcpd.conf\n```\n\n```\nnext-server 192.168.0.2;\nfilename \"/pxelinux.0\";\n```\n\nEssa seção pode tanto ser uma subnet inteira ou apenas uma definição de host. next-server é o IP do servidor TFTP e filename é o nome de arquivo da imagem para inicializar. Para mais informações, veja PXE.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Documentação de DHCO do ISC\n\n"
    }
  ]
}