{
  "title": "Digital Cameras (Italiano)",
  "url": "https://wiki.archlinux.org/title/Digital_Cameras_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Libgphoto2 is the core library designed to allow access to digital cameras by external (front-end) programs, such as digiKam and gPhoto2. List of officially supported cameras is available on the official website (though more may work).\n\nThis article documents the configuration of libgphoto2 to access digital cameras. Some digital cameras will mount as normal USB storage devices and may not require the use of libgphoto2.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the libgphoto2 package, and optionally gphoto2 to have a command line interface.\n\n"
    },
    {
      "title": "Mount",
      "level": 3,
      "content": "- gphotofs — Fuse module to mount camera as a filesystem.\n\n- gvfs-gphoto2 — GPhoto2 backend for GVfs to mount camera as a filesystem from a file manager that supports GVfs such as GNOME Files, Nemo, PCManFM and Thunar. Part of gnome.\n\n- Kamera — KDE integration for gPhoto2 cameras. Provides a configuration tool and a KIO worker to read and write to camera devices. Part of kde-graphics.\n\n"
    },
    {
      "title": "Frontend applications",
      "level": 3,
      "content": "- Darktable — Utility to organize and develop raw images.\n\n- digiKam — Digital photo management application for KDE.\n\n- Entangle — Provides a graphical interface for “tethered shooting”, aka taking photographs with a digital camera completely controlled from the computer.\n\n- gThumb — Image browser and viewer for GNOME.\n\n- GTKam — Graphical GTK 2 front-end to gPhoto2.\n\n- Pantheon Photos — Image viewer for Pantheon.\n\n- Rapid Photo Downloader — Download photos and videos from cameras, memory cards and portable storage devices.\n\n- Rawstudio — An open source raw-image converter written in GTK. Supports tethered shooting with gPhoto2.\n\n- Shotwell — Digital photo organizer designed for GNOME.\n\n"
    },
    {
      "title": "GPhoto2 usage",
      "level": 2,
      "content": "GPhoto2 is a command line client for libgphoto2. GPhoto2 allows access to the libgphoto2 library from a terminal or from a script shell to perform any camera operation that can be done. This is the main user interface.\n\nGPhoto2 also provides convenient debugging features for camera driver developers.\n\nQuick Commands\n\n- gphoto2 --list-ports\n- gphoto2 --auto-detect\n- gphoto2 --abilities\n- gphoto2 --summary\n- gphoto2 --list-files\n- gphoto2 --get-all-files\n- gphoto2 --capture-image-and-download\n- gphoto2 --set-config datetime=now - sets the camera to the current time\n\nFor advanced file manipulation, use\n\n- gphoto2 --shell\n\n"
    },
    {
      "title": "Example usage with GVfs",
      "level": 3,
      "content": "Auto detect the connected camera and list the required port:\n\n```\n$ gphoto2 --auto-detect\n```\n\n```\nModel                          Port\n----------------------------------------------------------\nCanon Digital IXUS 980 IS      usb:006,011\n```\n\nNow open your favorite file manager and enter the address with the found port detail gphoto2://[usb:006,011]. File manager functionality#Mounting will use gvfs to get the camera mounted and manageable with the file manager.\n\n"
    },
    {
      "title": "Permission issues",
      "level": 3,
      "content": "Users with a local session have permissions granted for cameras using ACLs. See General troubleshooting#Session permissions if it does not work.\n\n"
    },
    {
      "title": "Claimed device",
      "level": 3,
      "content": "Your system might automatically mount the camera as a file system and then some gphoto2 commands output the error message \"cannot claim device\". In this case unmount the camera using your file browser or run:\n\n```\n$ gio mount -s gphoto2\n```\n\n"
    }
  ]
}