{
  "title": "Diretrizes de pacotes de aplicativos da Web",
  "url": "https://wiki.archlinux.org/title/Diretrizes_de_pacotes_de_aplicativos_da_Web",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "32-bit – CLR – CMake – Cross – DKMS – Eclipse – Electron – Fonte – Free Pascal – GNOME – Go – Haskell – Java – KDE – Kernel – Lisp – Meson – MinGW – Node.js – Nonfree – OCaml – Perl – PHP – Python – R – Ruby – Rust – Shell – VCS – Web – Wine\n\nEssa página descreve como empacotar aplicativos web.\n\n"
    },
    {
      "title": "Usuário separado",
      "level": 2,
      "content": "Por motivos de segurança, cada aplicativo web deve ser executado como um usuário separado (sem privilégios) (p.ex., $pkgname).\n\nConsulta as páginas man systemd-sysusers(8), sysusers.d(5), systemd-tmpfiles(8) e tmpfiles.d(5) para detalhes sobre como criar usuários com propriedade de arquivos e pastas para aquele usuário em um pacote.\n\n"
    },
    {
      "title": "Estrutura de diretórios",
      "level": 2,
      "content": "O layout segue o FHS.\n\n- /usr/share/webapps/$pkgname: O diretório de dados do aplicativo detém os arquivos do aplicativo web. Arquivos são de propriedade do root e são, portanto, somente-leitura pelo usuário e grupo do aplicativo $pkgname.\n\n- /etc/webapps/$pkgname: O diretório de configuração do aplicativo detém arquivos de configuração para o aplicativo (por link simbólico para o diretório de dados). Os arquivos localizados aqui têm que ir para vetor backup e são de propriedade do usuário e grupo $pkgname.\n\nNote: **devem ser protegidos** \n\n- /run/$pkgname: O diretório de runtime do aplicativo (de propriedade do usuário e grupo $pkgname). Ele pode ser usado para soquetes (p.ex., em configurações facilitando ativação de soquete).\n\n- /var/cache/$pkgname: O diretório de cache do aplicativo (de propriedade do usuário e do grupo $pkgname). Ele (ou subpastas nele) é vinculado ao diretório de dados para aplicativos que requerem diretórios de cache que podem ser escritos.\n\n- /var/lib/$pkgname: O armazenamento persistente do aplicativo (de propriedade do usuário e grupo $pkgname). Ele (ou subpastas nele) é vinculado ao diretório de dados para aplicativos que exigem diretórios de armazenamento persistentes.\n\n"
    }
  ]
}