{
  "title": "Disable PC speaker beep (Русский)",
  "url": "https://wiki.archlinux.org/title/Disable_PC_speaker_beep_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Модули ядра\n- Advanced Linux Sound Architecture (Русский)\n\nНачиная с первых IBM PC, большинство компьютеров имеют встроенный динамик (PC speaker, «пищалка»), который может издавать звуковые сигналы. Этот динамик не способен обеспечить высокое качество звука и лишь используется для обратной связи в виде звуковых сигналов. Некоторые программы, например, веб-браузеры, редакторы и терминалы, могут издавать звуковые сигналы, которые могут как нравиться, так и не нравиться пользователю. Поэтому данная статья описывает, как настроить или даже отключить такие звуковые сигналы.\n\nДля случаев, когда нет звуковой карты или динамиков, и требуется простое аудио оповещение, смотрите раздел #Beep.\n\n"
    },
    {
      "title": "Механизм",
      "level": 2,
      "content": "Динамик ПК обычно представляет собой физическое устройство, подключаемое к разъёму для передней панели на материнской плате. Некоторые производители плат вообще не комплектуют их динамиком, а у некоторых динамик может быть припаян прямо на плате. На ноутбуках обычно нет такого динамика, а звуковой сигнал выводится на обычные внутренние динамики ноутбука. В некоторых случаях звуковой сигнал подаётся на обычный выход (колонки, наушники) звуковой карты и может оказаться неожиданно громким.\n\nОбычно BIOS при загрузке издаёт один короткий звуковой сигнал во время POST. В более современных моделях материнских плат звуковой сигнал POST отсутствует ради более быстрой загрузки в ОС. BIOS обычно позволяет включить или выключить звуковые сигналы POST, но не позволяет полностью отключить встроенный динамик.\n\nПосле загрузки Linux и модуля ядра pcspkr встроенный динамик может использоваться окружением, вызываться пользователем вручную и в некоторой степени настраиваться. Поскольку он управляется напрямую процессором, а также в силу того, что он предназначен только для воспроизведения звуковых сигналов, его нельзя использовать для воспроизведения аудиофайлов. Но если очень хочется, то можно вместо модуля pcspkr попробовать snd-pcsp-dkmsAUR, который реализует примитивный аудиовывод.\n\n"
    },
    {
      "title": "Отключение PC Speaker",
      "level": 2,
      "content": "Отключение конкретного источника звука, в то время, когда остальные продолжают работать, возможно только в том случае, если мы может определить какая часть окружения сгенерировала конкретный звук. Это позволяет выборочно настраивать звуки. Пожалуйста, размещайте свои примеры настроек и конфигураций, которые могут оказаться полезными для других пользователей.\n\n"
    },
    {
      "title": "Физически",
      "level": 3,
      "content": "После удаления встроенного динамика система не сможет издавать звуковые сигналы. На некоторых платах можно физически отсоединить динамик от неё. Некоторые производители устанавливают джампер для его отключения.\n\n"
    },
    {
      "title": "Глобально",
      "level": 3,
      "content": "PC speaker может быть отключен выгрузкой модулей ядра pcspkr и snd_pcsp:\n\n```\n# rmmod pcspkr\n# rmmod snd_pcsp\n```\n\nПомещение в чёрный список модулей pcspkr и snd_pcsp предотвратит их загрузку через udev при загрузке системы. Создайте такой файл:\n\n```\n/etc/modprobe.d/nobeep.conf\n```\n\n```\nblacklist pcspkr\nblacklist snd_pcsp\n```\n\nРазмещение в чёрном списке в командной строке ядра — ещё один способ добиться похожего эффекта. Просто добавьте module_blacklist=pcspkr,snd_pcsp в параметры ядра в настройках вашего загрузчика.\n\n"
    },
    {
      "title": "Терминал",
      "level": 3,
      "content": "Вы можете добавить эту команду в /etc/profile или в отдельный файл вроде /etc/profile.d/disable-beep.sh:\n\n```\nsetterm -blength 0\n```\n\nДругой способ - это раскомментировать или добавить строку в /etc/inputrc или ~/.inputrc:\n\n```\nset bell-style none\n```\n\n"
    },
    {
      "title": "Less",
      "level": 4,
      "content": "Для отключения PC speaker при использовании утилиты less, вы можете запустить её с параметром less -q, чтобы заглушить PC speaker по достижении конца постраничного вывода, или less -Q чтобы отключить повсеместно. Для получения справки, выполните man -P \"less -Q\" или настройте переменные окружения $MANPAGER или $PAGER.\n\nТакже, вы можете добавить следующие строки в ваш .bashrc:\n\n```\nalias less='less -Q'\nalias man='man -P \"less -Q\"'\n```\n\n"
    },
    {
      "title": "Xorg",
      "level": 3,
      "content": "```\n$ xset -b\n```\n\nМожно добавить эту команду в файл запуска, например /etc/xprofile, чтобы сделать её постоянной; смотрите статью xprofile (Русский).\n\n"
    },
    {
      "title": "ALSA",
      "level": 3,
      "content": "Для большинства звуковых карт PC speaker отображается как канал ALSA, и может называться как PC Speaker, PC Beep, или Beep. Чтобы заглушить динамик, воспользуйтесь alsamixer или amixer.\n\n```\n$ amixer set 'PC Speaker' 0% mute\n```\n\nДля включения звука обратитесь к странице руководства Advanced Linux Sound Architecture#Unmuting the channels.\n\n"
    },
    {
      "title": "GNOME",
      "level": 3,
      "content": "При использовании GSettings:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences audible-bell false\n```\n\n"
    },
    {
      "title": "KDE Plasma",
      "level": 3,
      "content": "Настроить звуковые сигналы можно через Параметры системы > Специальные возможности > Сигнал.\n\n"
    },
    {
      "title": "Cinnamon",
      "level": 3,
      "content": "В Cinnamon, похоже, используется звук «падающей капли». Для его отключения измените в gsettings(1):\n\n```\n$ gsettings set org.cinnamon.desktop.wm.preferences audible-bell false\n```\n\n"
    },
    {
      "title": "GTK",
      "level": 3,
      "content": "Добавьте следующую строку в ~/.gtkrc-2.0:\n\n```\ngtk-error-bell = 0\n```\n\nДобавьте такую же строку в секцию [Settings] файла $XDG_CONFIG_HOME/gtk-3.0/settings.ini:\n\n```\n[Settings]\ngtk-error-bell = 0\n```\n\nПодробно это рассмотрено в Gnome Developer Handbook.\n\n"
    },
    {
      "title": "PulseAudio",
      "level": 3,
      "content": "В качестве реакции на X11 bell events можно воспроизводить звук через PulseAudio; смотрите PulseAudio (Русский)#Сигналы событий X11.\n\n"
    },
    {
      "title": "Beep",
      "level": 2,
      "content": "Пользователь может запустить короткий звуковой сигнал, когда он работает в виртуальной консоли; смотрите Wikipedia:Bell character#Usage.\n\nBeep - это улучшенная программа для подачи звукового сигнала посредством PC speaker. Она может оказаться востребована в ситуациях, когда звуковая карта отсутствует или нет доступных динамиков, но требуется простое звуковое уведомление.\n\n"
    },
    {
      "title": "Установка",
      "level": 3,
      "content": "Установите пакет beep.\n\nВозможно, вам потребуется включить звук канала PC speaker в ALSA.\n\n"
    },
    {
      "title": "Запуск от имени обычного пользователя",
      "level": 3,
      "content": "Для управления встроенным динамиком beep использует /dev/input/by-path/platform-pcspkr-event-spkr. Чтобы получить к нему доступ как обычный пользователь (не root), нужно задать соответствующие разрешения. Создайте файл /etc/udev/rules.d/70-pcspkr-beep.rules с таким правилом:\n\n```\nACTION==\"add\", SUBSYSTEM==\"input\", ATTRS{name}==\"PC Speaker\", ENV{DEVNAME}!=\"\", TAG+=\"uaccess\"\n```\n\nЭто позволит любому пользователю, работающему в активной в данный момент виртуальной консоли, использовать PC speaker.\n\nДругой вариант — создать новую группу пользователей (например, beep) с соответствующим правилом для установки нужных разрешений на файл устройства:\n\n```\nACTION==\"add\", SUBSYSTEM==\"input\", ATTRS{name}==\"PC Speaker\", ENV{DEVNAME}!=\"\", GROUP=\"beep\", MODE=\"0620\"\n```\n\nТогда любой пользователь, входящий в группу beep, сможет управлять динамиком.\n\nЧтобы принудительно перезагрузить правила и применить новые права без перезагрузки, выполните:\n\n```\n# udevadm control --reload && rmmod pcspkr && modprobe pcspkr\n```\n\n"
    },
    {
      "title": "Советы и рекомендации",
      "level": 3,
      "content": "В то время, как большинство пользователей устраивает звуковой сигнал по умолчанию, некоторые, возможно, захотят его слегка изменить. Следующий пример позволит сделать звуковой сигнал выше и короче, и повторит два раза.\n\n```\n# beep -f 5000 -l 50 -r 2\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- xset(1), setterm(1), bash(1)\n- https://github.com/NaWer/beep и https://github.com/ShaneMcC/beeps — репозитории, в которых собраны bash-скрипты, воспроизводящие различную музыку с помощью beep\n\n"
    }
  ]
}