{
  "title": "Discord (Русский)",
  "url": "https://wiki.archlinux.org/title/Discord_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Discord — это проприетарное, кросс-платформенное приложение всё-в-одном для текстового и голосового чата. У многих сообществ открытого исходного кода есть свои официальные Discord-серверы. Discord можно использовать либо через веб-браузер, либо через настольное приложение, созданное с помощью Electron.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Вы можете использовать один из следующих пакетов, чтобы установить настольное приложение Discord:\n\n"
    },
    {
      "title": "Официальные приложения",
      "level": 4,
      "content": "- Стабильная версия: discord\n- Бета-версия: discord-ptbAUR\n- Ежедневная версия: discord-canaryAUR\n\n"
    },
    {
      "title": "Официальные клиенты, использующие системный electron",
      "level": 4,
      "content": "Официальные клиенты, использующие данный системой electron для улучшенной защиты и потенциальной производительности:\n\n- Стабильная версия: discord_arch_electronAUR\n- Ежедневная версия: discord-canary-electron-binAUR\n\n"
    },
    {
      "title": "Сторонние клиенты",
      "level": 4,
      "content": "- Abaddon — Альтернативный Discord-клиент, созданный с помощью C++/gtkmm.\n\n- discord-screenaudio — Пользовательский Discord-клиент, поддерживающий демонстрацию экрана с аудио на Linux.\n\n- Fast-Discord — Новый Discord-клиент, созданный на C++ и Qt.\n\n- gtkcord4 — Discord-клиент GTK4 на Go.\n\n- Ripcord — Легковесный, проприетарный, настольный чат-клиент для услуг, ориентированных на группы наподобие Slack и Discord на базе наборов инструментов Qt.\n\n- WebCord — Оболочка для веб-клиента, улучшающий конфиденциальность и позволяющий демонстрацию экрана на Wayland.\n\n- VenCord — Модификация клиента Discord, загружающаяся полностью до загрузки Discord — с целью сделать его быстрее и стабильнее.\n\n"
    },
    {
      "title": "Клиенты для терминала",
      "level": 3,
      "content": "Существуют неоднократные сторонние клиенты на базе CLI на AUR (и неупакованные на Github), однако многие из них устаревшие или сломанные. discordo поддерживается и упаковывается на AUR как discordo-gitAUR.\n\n"
    },
    {
      "title": "Плагины для чат-клиентов",
      "level": 3,
      "content": "- purple-discord — Плагин Discord для мессенджеров на базе libpurple вроде Pidgin\n\n- bitlbee-discord — Плагин Discord для Bitlbee\n\n- weechat-discord — Плагин Discord для WeeChat\n\n"
    },
    {
      "title": "Пользовательский CSS и плагины",
      "level": 3,
      "content": "- BetterDiscord — Проект, позволяющий Discord быть модифицированным для использования пользовательского CSS и плагинов.\n\n- Discocss — Простой скрипт, позволяющий добавление пользовательского CSS в Discord-клиенты. Для добавления CSS в версии discord-ptbAUR и discord-canaryAUR, замените все упоминания папки discord с использованной версией.\n\n- Replugged — Вилка Powercord, легковесной модификации discord-клиента с вниманием на простоту и производительность.\n\n"
    },
    {
      "title": "Оверлей",
      "level": 3,
      "content": "Для клиентов Linux Discord не поддерижвает внутриигровой оверлей. discover-overlayAUR — это GTK-приложение с открытым исходным кодом, предоставляющее данные функции. Discover работает в средах X11 или wlroots.\n\n"
    },
    {
      "title": "Утилиты",
      "level": 3,
      "content": "- Chuncord — Инструмент для терминала для загрузки файлов в CDN Discord по частям, используя вебхуки.\n\n"
    },
    {
      "title": "Значок верхней панели GNOME",
      "level": 3,
      "content": "Если Вы хотите значок в верхней панели GNOME, установите расширение для поддержки AppIndicator и KStatusNotifierItem и libappindicator-gtk3.\n\n"
    },
    {
      "title": "Discord просит обновление, ещё недоступное в репозитории",
      "level": 3,
      "content": "Если доступно обновление, Discord откажется запускаться, и покажется следующее сообщение: «Must be your lucky day, there's a new update!». Если обновлённая версия ещё не доступна в официальных репозиториях, Вы можете собрать и установить обновлённый пакет, используя систему сборки Arch.\n\nДля отключения проверки обновлений добавьте следующее в файл ~/.config/discord/settings.json:\n\n```\n~/.config/discord/settings.json\n```\n\n```\n\"SKIP_HOST_UPDATE\": true\n```\n\n"
    },
    {
      "title": "Запускать Discord в свёрнутом виде",
      "level": 3,
      "content": "Discord можно запустить минимизированно через параметр --start-minimized.\n\n"
    },
    {
      "title": "Подавление шума микрофона",
      "level": 3,
      "content": "У Discord есть встроенное подавление шума со стандартным вариантом и вариантом с использованием искуственного интеллекта, предоставлемым Krisp. Вы также можете предоставить своё подавление шума на PipeWire, следовав PipeWire (Русский)#Шумоподавление для голоса.\n\n"
    },
    {
      "title": "Демонстрация экрана со звуком",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nДемонстрация экрана с аудио официально не поддерживается на Linux. Одна из альтернатив для этого — направить аудио приложение в Ваш микрофон:\n\n- Для PulseAudio следуйте PulseAudio/Examples#Remapping select audio sources для получения источника Monitor of для программы для демонстрации, который может быть использован для другого экземпляра Discord, работающего в браузере.\n\nДругой подход — использование модифицированного клиента, который предоставит аудио в стрим Discord вместо его миксирования с микрофоном:\n\n- Для PipeWire, текущий обходной путь и скорее всего самый лёгкий способ использовать демонстрацию экрана с аудио — использовать discord-screenaudioAUR.\n\n"
    },
    {
      "title": "Включение инструментов разработчика",
      "level": 3,
      "content": "После недавнего обновления, инструменты разработчика были отключены по умолчанию в Discord по причинам безопасности. Для их повторного включения добавьте это в ~/.config/discord/settings.json:\n\n```\n\"DANGEROUS_ENABLE_DEVTOOLS_ONLY_ENABLE_IF_YOU_KNOW_WHAT_YOURE_DOING\": true\n```\n\n"
    },
    {
      "title": "Включение преобразования текста в речь",
      "level": 3,
      "content": "По умолчанию преобразование текста в речь отключено в клиенте Discord. Однако оно можеть быть включено, используя флаг --enable-speech-dispatcher. Он использует speech-dispatcher для вывода речи.\n\n"
    },
    {
      "title": "Лаг при перелистывании гильдий",
      "level": 3,
      "content": "Если вы испытываете лаг и заикания при перелистывании списка серверов, убедитесь в том, что Ваше аппаратное ускорение корректно работает. Вы можете это сделать, открыв chrome://gpu в любом браузере на базе Chromium. Если оно не работает, посмотрите раздел аппаратного ускорения и попробуйте выполнить Discord с этими дополнительными параметрами:\n\n```\n$ discord --ignore-gpu-blocklist --disable-features=UseOzonePlatform --enable-features=VaapiVideoDecoder --use-gl=desktop --enable-gpu-rasterization --enable-zero-copy\n```\n\n"
    },
    {
      "title": "Потрескивания во время голосовых звонков",
      "level": 3,
      "content": "Если Вы испытываете потрескивания во время голосовых звонков, попробуйте выполнить шаги в PulseAudio/Решение проблем#Глюки, пропуски или потрескивания.\n\n"
    },
    {
      "title": "Демонстрация экрана на Wayland",
      "level": 3,
      "content": "Начиная с версии 0.0.17, функция демонстрации экрана не работает на Wayland, даже после включения Ozone для Wayland, используя /usr/bin/discord --enable-features=UseOzonePlatform --ozone-platform=wayland. См. этот Reddit-пост и сообщение об ошибке Discord.\n\nКак обходной путь можно использоваться webcordAUR, полностью поддерживающий демонстрацию экрана на Wayland, однако испытывает недостатки функций вроде rich presence, т. к. он упаковывает веб-версию Discord. Можно также использовать саму веб-версию.\n\nЕщё одна альтернатива — использование виртуальной камеры. См. Open Broadcaster Software#Virtual camera output и ru:Screen capture#С помощью виртуальной камеры.\n\nДругая альтернатива — XwaylandVideoBridge. См. Wayland#Screencast Wayland windows with X11 applications.\n\n"
    },
    {
      "title": "Включение rich presence на Flatpak",
      "level": 3,
      "content": "При использовании Flatpak-версии Discord, Rich Presence не будет работать из коробки. Для того, чтобы он работал необходимо создать симлинк из $XDG_RUNTIME_DIR/discord-ipc-0 в $XDG_RUNTIME_DIR/app/com.discordapp.Discord/discord-ipc-0. Чтобы создать симлинк для текущей сессии пользователя, выполните:\n\n```\n$ ln -sf {app/com.discordapp.Discord,$XDG_RUNTIME_DIR}/discord-ipc-0\n```\n\nДля автоматического создания симлинка можно использовать systemd-tmpfiles, добавив следующую строку в файл с расширением .conf в ~/.config/user-tmpfiles.d/:\n\n```\nL %t/discord-ipc-0 - - - - app/com.discordapp.Discord/discord-ipc-0\n```\n\n"
    },
    {
      "title": "Discord становится неотзывчивым во время длинных звонков",
      "level": 3,
      "content": "Если Discord становится неотзывчивым во время длинных звонков, попробуйте параметр --no-sandbox. Вы также можете добавить следующее в Ваш .bashrc или файл алиасов для Вашей оболочки:\n\n```\nalias discord='discord --no-sandbox'\n```\n\n"
    },
    {
      "title": "Discord зависает после получения пинга или сообщения",
      "level": 3,
      "content": "Если сообщение, вызывающее уведомление (пинги, личные сообщения, серверы с включенными уведомлениями, т. д.) заставляют клиент висеть, клиент не может найти сервер уведомлений. Для исправления проблемы без установки сервера уведомлений отключите Включить уведомления на рабочем столе в настройках Уведомлений.\n\n"
    },
    {
      "title": "Звуки уведомлений не работают с PipeWire",
      "level": 3,
      "content": "См. PipeWire (Русский)#Нет звуков уведомлений в Discord.\n\n"
    },
    {
      "title": "Эмодзи некорректно визуализируются",
      "level": 3,
      "content": "Если Вы испытываете проблемы с отрисовкой по поводу эмодзи (например, отрисовываются квадраты вместо эмодзи), в discord-canary-electron-binAUR есть нужные шрифты как необязательные зависимости. Вы должны установить ttf-symbolaAUR, noto-fonts-cjk и noto-fonts-emoji.\n\nttf-twemojiAUR необходим для отображения эмодзи в названиях каналов. Не забудьте установить 75-twemoji.conf в /etc/fonts/conf.d/, что не происходит по умолчанию.\n\n"
    },
    {
      "title": "Нажатие на ссылку не открывает браузер",
      "level": 3,
      "content": "Если нажатие на ссылку не открывает вкладку в Вашем веб-браузере по умолчанию, Вы должны установить необязательную зависимость xdg-utils.\n\n"
    },
    {
      "title": "Синхронизация с компьютером не работает",
      "level": 3,
      "content": "Discord разбирает следующий файл, чтобы найти, какую тему применить:\n\n```\n$HOME/.config/gtk-3.0/settings.ini\n```\n\nи он ищет эти определённые строки:\n\n```\n[Settings]\ngtk-theme-name=Adwaita-dark\n```\n\nЕсли Вы смените тему с Adwaita-dark на Adwaita, то Discord автоматически сменится на светлую тему, и наоборот.\n\nОбратите внимание, что Discord поддерживает только пару популярных тем, так что если оно не работает с Вашей темой (в этом примере с темой Materia), «грязным» исправлением будет вставить следующее в Ваш файл settings.ini:\n\n```\n[Settings]\ngtk-theme-name=Adwaita-dark\ngtk-theme-name=Materia-dark\n```\n\nПорядок определений важен, т. к. GTK будет использовать второе определение переменной (в данном случае Materia-dark), но Discord всё же успешно обнаружит, что Вы используете тёмную тему, предоставив Adwaita-dark в первом определении переменной GTK-темы.\n\n"
    },
    {
      "title": "Мыльный значок Discord в системном трее KDE Plasma",
      "level": 3,
      "content": "Вы можете попробовать исправить данную проблему, установив libappindicator-gtk3 для того, чтобы заменить libappindicator-gtk2, что является частью проблемы.\n\n"
    },
    {
      "title": "Discord спамит в журнал systemd",
      "level": 3,
      "content": "Вы можете узнать, что Discord создаёт очень много сообщений в Вашем журнале в формате вроде:\n\n```\n(device_info_linux.cc:45): количество устройств\n```\n\nДля отключения логов, из-за которых это происходит: перейдите в настройки, выберите «Голос и видео», пролистайте до низа экрана и отключите «Ведение журнала отладки».\n\n"
    },
    {
      "title": "Нет голосового чата в среде pure-ALSA",
      "level": 3,
      "content": "Настольное приложение Discord зависит от PulseAudio для голосового чата и не выполняется непосредственно на ALSA. Использование apulse[ссылка недействительна: раздел не найден] как обходной путь в данном случае устарело. Если Вы хотите использовать голосовой чат Discord без PulseAudio или Pipewire, получите доступ к веб-клиенту Discord через веб-браузер на базе Chromium. В качестве альтернативы, как Chromium-оболочка, Webcord работает в средах pure-ALSA.\n\nЕсли Вы выбрали этот путь и не можете отключить звук, например, чтобы получить доступ к микрофону, задайте его как устройство захвата по умолчанию в ~/.asoundrc. Также в Discord зайдите в Настройки пользователя > Голос и видео > Устройство ввода и убедитесь в том, что выбрано Default.\n\n"
    },
    {
      "title": "Notification badge is missing",
      "level": 3,
      "content": "Note: **Эта статья или раздел нуждается в переводе** Эта статья или раздел нуждается в переводе\n\nЭта статья или раздел нуждается в переводе\n\nDiscord can display a badge showing the number of unread mentions on the taskbar icon. If the badge is not displayed, verify that the libunityAUR package is installed, as it is required for this feature to work.\n\n"
    },
    {
      "title": "Чёрный экран на Wayland на проприетарном драйвере NVIDIA",
      "level": 3,
      "content": "Discord на Wayland требует поддержку VA-API, которого нет в проприетарном драйвере NVIDIA. Переводной слой вроде libva-nvidia-driver может быть использован для получения поддержки VA-API.\n\n"
    }
  ]
}