{
  "title": "Discord (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Discord_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "İlgili makaleler\n\n- Slack\n\nDiscord kapalı kaynak kodlu, çoklu platform desteğine sahip, sesli ve yazılı sohbet uygulamasıdır. Açık kaynak davasına gönül vermiş toplulukların birçoğunun resmi Discord sunucuları vardır. Discord bir web tarayıcısı aracılığıyla veya Electron ile yazılmış masaüstü uygulaması aracılığıyla kullanılabilir.\n\n"
    },
    {
      "title": "Kurulum",
      "level": 2,
      "content": "Discord'un masaüstü uygulamasını yüklemek için aşağıdaki paketlerden birini kullanabilirsiniz:\n\n"
    },
    {
      "title": "Resmi uygulamalar",
      "level": 4,
      "content": "- Stable: discord\n- Testing: discord-ptbAUR\n- Nightly: discord-canaryAUR\n\nAlternatif olarak, Discord Flatpak paketi olarak da mevcuttur. Bu paket, sistem kütüphanelerine dair sorunları çözebilir ve bazı durumlarda performans iyileştirmesi sağlayabilir, lakin Rich Presence'i etkinleştirmek için ekstra çaba istiyor. Bknz: #Flatpak'te Rich Presence'i etkinleştirmek.\n\n```\n$ flatpak install discord\n```\n\n"
    },
    {
      "title": "Sistem electron'unu kullanan resmi istemciler",
      "level": 4,
      "content": "Olası performans ve güvenlik artışı için sistem electron'unu kullanan resmi istemciler:\n\n- Stable: discord_arch_electronAUR\n- Nightly: discord-canary-electron-binAUR\n\n"
    },
    {
      "title": "Üçüncü taraf istemciler",
      "level": 4,
      "content": "- Abaddon — C++/gtkmm ile yazılmış sesli konuşma desteğine sahip alternatif bir Discord istemcisi.\n\n- discord-screenaudio — Linux'da sesli ekran paylaşımını destekleyen gayriresmi Discord istemcisi.\n\n- Dissent — Go ile yazılmış GTK4 Discord istemcisi\n\n- Legcord — Olabildiğince her şeyi hafif tutup aynı zamanda Discord deneyimini iyileştirmek adına yazılmış istemci.\n\n- Ripcord — Qt araç seti üzerine yazılmış, Discord ve Slack gibi grup bazlı servisler için yazılmış, hafif, kapalı kaynak kodlu sohbet uygulaması.\n\n- Vesktop — Vesktop çoklu platform desteğine sahip, daha hafif bir Discord deneyimi sunmayı amaçlayan masaüstü uygulamasıdır. Ayrıca sesli ekran paylaşımını da destekliyor.\n\n- WebCord — Web istemcisi için sarmalayıcı. Wayland'de ekran paylaşımı desteği ve gelişmiş güvenlik sağlıyor.\n\n"
    },
    {
      "title": "Komut Satırı istemcileri",
      "level": 3,
      "content": "AUR'da (ve Github'da paketlenmemiş) çok sayıda Komut satırı tabanlı üçüncü taraf istemci vardır, ancak çoğu kullanımdan kaldırılmış veya bozuktur. discordo AUR üzerinde discordo-gitAUR olarak paketlenir ve bakımı yapılır.\n\n"
    },
    {
      "title": "Sohbet istemcisi eklentileri",
      "level": 3,
      "content": "- purple-discord — Pidgin\n\n- bitlbee-discord — Bitlbee\n\n- weechat-discord — WeeChat\n\n"
    },
    {
      "title": "Özel CSS ve eklentiler",
      "level": 3,
      "content": "- BetterDiscord — Discord istemcisinin özel CSS ve eklentiler kullanmasına olanak sağlamak adına modifikasyonlar içeren proje.\n\n- Discocss — Discord istemcilerine özel CSS'ler enjekte edebilen basit bir betik.discord-ptbAUR ve discord-canaryAUR sürümlerine özel CSS enjekte etmek için discord klasörünü içeren satırları kullanılan sürüm ile değiştirin.\n\n- Replugged — Basitlik ve performans'a odaklanmış hafif bir Discord istemcisi olan, Powercord'un çatalı.\n\n- VenCord — Discord açılmadan önce yüklenen, Discord'u daha hızlı ve stabil hale getirmeyi amaçlayan istemci modifikasyonu.\n\n"
    },
    {
      "title": "Oyun arayüzü",
      "level": 3,
      "content": "Discord'un Linux istemcileri oyun arayüzünü desteklemiyor. Açık kaynak kodlu GTK uygulaması olan discover-overlayAUR bu eksikleri gidermeyi amaçlıyor. Discover x11 ve wlroots ortamlarında çalışmaktadır.\n\n"
    },
    {
      "title": "Yardımcı programlar",
      "level": 3,
      "content": "- Chuncord — Discord CDN'e, webhookları kullanarak parça parça dosya yüklemek için komut satırı aracı.\n\n"
    },
    {
      "title": "GNOME üst çubuk simgesi",
      "level": 3,
      "content": "Simgenin GNOME üst çubuğunda olmasını istiyorsanız AppIndicator and KStatusNotifierItem Support extension'ı ve libappindicator-gtk3 yükleyiniz.\n\n"
    },
    {
      "title": "Discord repoda olmayan güncellemeyi yüklemeye çalışıyor",
      "level": 3,
      "content": "Eğer bir yüklenmemiş bir güncelleme mevcutsa, Discord açılmayacak ve şu mesajı gösterecektir \"Şanslı günündesin! Yeni bir güncelleme var\". Eğer güncellenmiş sürüm resmi repolarda mevcut değilse, Arch build system'i kullanarak paketi kendiniz derleyip(build daha duzgun ceviri bulunacak), güncellenmiş paketi yükleyebilirsiniz.\n\nGüncelleme denetimini devre dışı bırakmak için, ~/.config/discord/settings.json'a şunu ekleyin:\n\n```\n~/.config/discord/settings.json\n```\n\n```\n\"SKIP_HOST_UPDATE\": true\n```\n\nJSON gereksinimleri nedeniyle WINDOW_BOUNDS nesnesinden sonra fazladan bir virgül eklemeniz gerektiğini unutmayın, örn:\n\n```\n{\n  \"IS_MAXIMIZED\": true,\n  \"IS_MINIMIZED\": false,\n  \"WINDOW_BOUNDS\": {\n    \"x\": 2240,\n    \"y\": 219,\n    \"width\": 1280,\n    \"height\": 720\n  },\n  \"SKIP_HOST_UPDATE\": true\n}\n```\n\n"
    },
    {
      "title": "Discord'u küçültülmüş olarak başlatmak",
      "level": 3,
      "content": "Discord --start-minimized argümanı ile küçültülmüş olarak başlatılabilir.\n\n"
    },
    {
      "title": "Mikrofon gürültü azaltma",
      "level": 3,
      "content": "Discord artık hem standart hem de Krisp'in yapay zeka tabanlı gürültü azaltıcısı ile dahili bir şekilde gürültü azaltma özelliğine sahiptir. PipeWire'da PipeWire#Noise suppression for voice sayfasını takip ederek kendi gürültü azaltıcınızı kullanabilirsiniz.\n\n"
    },
    {
      "title": "Sesli ekran paylaşımı",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nLinux'da resmi bir şekilde sesli ekran paylaşımı bulunmamaktadır.. Başka bir seçenek ise, uygulamanın sesini mikrofonunuz üzerinden yönlendirmek:\n\n- PulseAudio için, PulseAudio/Examples#Remapping select audio sources'ı takip ederek paylaşılacak program için, tarayıcıda çalışan Discord web istemcisi için giriş aygıtı olarak kullanılabilecek bir Monitor of kaynağı elde edin.\n- PipeWire'da , sesli ekran paylaşımından yararlanmanın en basit çözümü discord-screenaudioAUR paketini kullanmaktır.\n\n"
    },
    {
      "title": "Web RPC Eklentileri",
      "level": 3,
      "content": "Seçili web aktivitelerini, Discord rich presence'inizde göstermenize olanak sağlayan birkaç eklenti mevcut:\n\n- PreMiDAUR için gerekli tarayıcı eklentisini kurduktan sonra Web RPC'i kullanabilirsiniz.\n- discord-rpc-extension-binAUR için PreWrap veya Mal-sync tarayıcı eklentilerini kurup Web RPC'i kullanabilirsiniz.\n\n"
    },
    {
      "title": "Geliştirici Araçlarını etkinleştirmek",
      "level": 3,
      "content": "Yakın zamanda gelen bir güncellemeden sonra, güvenlik sebeplerinden ötürü Discord'un geliştirici araçları varsayılan olarak devre dışı bırakıldı. Yeniden etkinleştirmek için alttaki satırı ~/.config/discord/settings.json dosyasına ekleyin:\n\n```\n\"DANGEROUS_ENABLE_DEVTOOLS_ONLY_ENABLE_IF_YOU_KNOW_WHAT_YOURE_DOING\": true\n```\n\n"
    },
    {
      "title": "Metin Okuma özelliğini etkinleştirmek",
      "level": 3,
      "content": "Metin Okuma özelliği varsayılan olarak devre dışıdır. --enable-speech-dispatcher bayrağı ile tekrardan aktifleştirilebilir, bu bayrak speech-dispatcher arka plan servisinin ses çıktısı alabilmesine olanak sağlar.\n\n"
    },
    {
      "title": "Sunucularda gezinirken takılma problemleri",
      "level": 3,
      "content": "Sunucularda gezinirken kasmalar ve takılmalar yaşıyorsanız lütfen donanım ivmesinin açık olduğundan emin olun. Chromium tabanlı tarayıcılarda chrome://gpu sayfasını açarak donanım ivmesinin çalışıp çalışmadığını kontrol edebilirsiniz. Bu sayfada da, donanım ivmesi çalışmıyor olarak gözüküyorsa, şu sayfayı Hardware video acceleration inceleyebilir ve buna göre Discord'u birkaç ek parametre ile açmayı deneyebilirsiniz:\n\n```\n$ discord --ignore-gpu-blocklist --disable-features=UseOzonePlatform --enable-features=VaapiVideoDecoder --use-gl=desktop --enable-gpu-rasterization --enable-zero-copy\n```\n\n"
    },
    {
      "title": "Sesli sohbette cızırtı problemi",
      "level": 3,
      "content": "Eğer sesli sohbette cızırtılar ile karşılaşıyorsanız, PulseAudio/Troubleshooting#Troubleshooting buffer underruns (glitches, skips, crackling)'da belirtilen adımları deneyin.\n\n"
    },
    {
      "title": "Wayland'de ekran paylaşımı",
      "level": 3,
      "content": "Versiyon 0.0.17 itibarı ile Ekran Paylaşma özelliği, Wayland'de Ozone'u da etkinleştirseniz çalışmıyor: /usr/bin/discord --enable-features=UseOzonePlatform --ozone-platform=wayland Şu Reddit postunu ve Discord bug raporunu inceleyiniz.\n\nOlası çözüm yolları:\n\n- Firefox gibi ekran paylaşımını destekleyen bir tarayıcıda Discord kullanmak. Tarayıcı, kendi diyalog kutusu ile hangi pencerenin veya ekranın paylaşılacağını seçmenizi isteyecektir.\n- XwaylandVideoBridge. Bknz: Wayland#Screencast Wayland windows with X11 applications.\n- sanal kamera kullanmak. Bknz: Open Broadcaster Software#Virtual camera output ve Screen capture#Via a virtual webcam video feed.\n- Üçüncü taraf istemci kullanmak (Her zamanki uyarımız burada da geçerli, Discord'un Hizmet Şartları burada da geçerli.): webcordAUR Wayland'de ekran paylaşımını destekliyor, Lakin Discord'un web sürümünü kullandığı için rich presence gibi özelliklerden mahrum. Vesktop, AUR paketi vesktop-binAUR olarak mevcut.\n\n- webcordAUR Wayland'de ekran paylaşımını destekliyor, Lakin Discord'un web sürümünü kullandığı için rich presence gibi özelliklerden mahrum.\n- Vesktop, AUR paketi vesktop-binAUR olarak mevcut.\n\n"
    },
    {
      "title": "Flatpak'te Rich Presence'i etkinleştirmek",
      "level": 3,
      "content": "Discord'un Flatpak sürümünde ne yazık ki Rich Presence kendiliğinden çalışmayacak. When using the Flatpak version of Discord, Çalışmasını sağlamak adına $XDG_RUNTIME_DIR/discord-ipc-0'den $XDG_RUNTIME_DIR/app/com.discordapp.Discord/discord-ipc-0'e symlink oluşturmak zorundayız. Peki şuanki kullanıcı oturumumuz için, gerekli symlink'ı nasıl oluşturabiliriz ? İşte bu komutu çalıştırarak :\n\n```\n$ ln -sf {app/com.discordapp.Discord,$XDG_RUNTIME_DIR}/discord-ipc-0\n```\n\nsystemd-tmpfiles'in symlink oluşturma işlemini otomatik bir şekilde halletmesi için, ~/.config/user-tmpfiles.d/'da .conf uzantısına sahip bir dosyaya şu satırı girmeniz yeterli:\n\n```\nL %t/discord-ipc-0 - - - - app/com.discordapp.Discord/discord-ipc-0\n```\n\n"
    },
    {
      "title": "Discord uzun süren aramalarda yanıt vermemeye başlıyor",
      "level": 3,
      "content": "Eğer Discord uzun aramalar esnasında yanıt vermemeye başlıyorsa --no-sandbox bayrağı ile tekrar çalıştırmayı deneyin. Ayrıca bunu .bashrc veya kabuğunuzun(shell) takma ad(alias) dosyasına ekleyebilirsiniz:\n\n```\nalias discord='discord --no-sandbox'\n```\n\n"
    },
    {
      "title": "Bahsetmeler veya Mesajlar Discord'u donduruyor",
      "level": 3,
      "content": "Bildirim sistemini tetikleyen (bahsetmeler, mesajlar, henüz susturulmamış sunucular vs.) iletiler istemcinin donmasına yol açıyorsa, istemci sisteminizde bir Bildirim Sunucusu bulamıyordur. Bu sorunu bildirim sunucusu yüklemeden çözmek için, ayarlardan Masaüstü Bildirimlerini Etkinleştir seçeneğini devre dışı bırakmanız yeterli.\n\n"
    },
    {
      "title": "Pipewire'da bildirim sesi almıyorum",
      "level": 3,
      "content": "Bknz: PipeWire#No notification sounds from Discord.\n\n"
    },
    {
      "title": "Emojiler düzgünce işlenmiyor",
      "level": 3,
      "content": "Emoji işlenme problemleri (emojilerin kare olarak gözükmesi gibi) ile karşılaşıyor iseniz, discord-canary-electron-binAUR paketi uygun olan fontlara, isteğe bağlı bağımlılıklar altında sahip. ttf-symbolaAUR, noto-fonts-cjk ve noto-fonts-emoji paketlerini yüklemelisiniz.\n\nttf-twemojiAUR ise kanal isimlerindeki emojilerin gözükmesi için gerekli. 75-twemoji.conf dosyasını /etc/fonts/conf.d/'a yüklemeyi unutmayın çünkü varsayılan senaryoda otomatik olarak yüklenmiyor.\n\n"
    },
    {
      "title": "Linklere tıklıyorum ama tarayıcımda açılmıyorlar",
      "level": 3,
      "content": "Eğer linke tıkladıktan sonra varsayılan tarayıcınız açılmıyorsa, isteğe bağlı bağımlılık olan xdg-utils'i yüklemelisiniz.\n\n"
    },
    {
      "title": "Discord simgesi KDE sistem tepsisinde bulanık gözüküyor",
      "level": 3,
      "content": "Sorunun kaynağı olarak bilinen libappindicator-gtk2 paketinin yerini doldurması için libappindicator-gtk3 yüklemeyi deneyebilirsiniz.\n\n"
    },
    {
      "title": "Discord systemd journal'ını spamliyor",
      "level": 3,
      "content": "Discord'un şu tarz mesajlarla journal'ınızı(günlük) şişirdiğini görmüş olabilirsiniz:\n\n```\n(device_info_linux.cc:45): NumberOfDevices\n```\n\nBu bilgi ve görüntü kirliliğinden şu şekilde kurtulabilirsiniz: Kullanıcı ayarlarını açın, oradan \"Ses ve Görüntü\" kısmını seçip en alta kadar inin, orada \"Hata Ayıklama Günlüğü\" seçeneği var onu kapatın ve ta da! sorun çözüldü.\n\n"
    },
    {
      "title": "Sistemimde sadece ALSA var ve sesli sohbete giremiyorum",
      "level": 3,
      "content": "Discord'un uygulaması sesli sohbet için PulseAudio'u kullanır ve direkt bir şekilde ALSA'da çalışmaz. apulse'yi geçici bir çözüm olarak kullanmak da artık geçerli bir yol değil. PulseAudio veya Pipewire yüklemeden sesli sohbeti kullanmak istiyorsanız ya Chromium tabanlı tarayıcıda Discord Web'i kullanacaksınız ya da Chromium tabanlı bir sarmalayıcı olduğu için Webcord'u kullanacaksınız.\n\nYol olarak yukarıdakilerden birini seçtiyseniz ve kendinizi sağırlaştıramamak gibi gibi problemleriniz varsa, mikrofonunuza erişim izni vermek için, mikrofonu ~/.asoundrc'da Varsayılan capture device olarak ayarlayın. Ayrıca, Kullanıcı Ayarlarına girip sırası ile > Ses ve Görüntü > Giriş Aygıtı sekmesine giderek Defaultun seçili olduğundan emin olun.\n\n"
    },
    {
      "title": "Bildirim rozeti gözükmüyor",
      "level": 3,
      "content": "Discord görev çubuğu simgesinde okunmamış bahsedilmelerin ve mesajların sayısını içeren bir rozet gösterir. Eğer bu rozet gözükmüyor ise rozetin çalışması için gerekli olan libunityAUR paketinin yüklü olduğundan emin olun.\n\n"
    },
    {
      "title": "Wayland'de NVIDIA'nın özel mülk sürücüsünü kullanıyor ve siyah ekran alıyorum",
      "level": 3,
      "content": "Discord Wayland istemcisinde, NVIDIA'nın özel mülk sürücüsünde bulunmayan VA-API desteğine ihtiyaç duyuyor. VA-API desteği alabilmek için şu tarz libva-nvidia-driver çeviri katmanları kullanılabilir.\n\n"
    },
    {
      "title": "Emojiler kare şeklinde gözüküyor",
      "level": 3,
      "content": "Emojileri düzgünce görüntüleyebilmek için bir font paketi yüklemelisiniz.\n\n"
    }
  ]
}