{
  "title": "Disk cloning (Español)",
  "url": "https://wiki.archlinux.org/title/Disk_cloning_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-09-22** \n\nArtículos relacionados\n\n- Synchronization and backup programs\n- System maintenance (Español)#Realizar copias de respaldo\n- System backup (Español)\n\nLa clonación de disco es el proceso por el cual se obtiene una imagen de una partición o de un disco duro completo. Esto puede ser útil para copiar la unidad a otros equipos y para propósitos de copias de respaldo y de recuperación.\n\n"
    },
    {
      "title": "Utilizar dd",
      "level": 2,
      "content": "Vea dd (Español)#Clonación y restauración de discos.\n\n"
    },
    {
      "title": "Utilizar ddrescue",
      "level": 2,
      "content": "ddrescue es una herramienta diseñada para clonar y recuperar datos. Copia datos de un archivo o dispositivo de bloque (disco duro, cdrom, etc.) a otro, tratando de rescatar primero las partes buenas para el caso de errores de lectura, con el fin de maximizar los datos recuperados.\n\nPara clonar una unidad defectuosa o agonizante, ejecute dos veces ddrescue. En la primera ronda, se copia cada bloque sin error de lectura y registra los errores en rescue.log.\n\n```\n# ddrescue -f -n /dev/sdX /dev/sdY rescue.log\n```\n\ndonde X y Y son las letras de las particiones deseadas de los dispositivos de bloques.\n\nEn la segunda ronda, copia solo los bloques defectuosos e intenta leerlos 3 veces desde la fuente antes de desistir.\n\n```\n# ddrescue -d -f -r3 /dev/sdX /dev/sdY rescue.log\n```\n\nAhora se puede verificar si el sistema de archivos está dañado y montar la nueva unidad.\n\n```\n# fsck -f /dev/sdY\n```\n\n"
    },
    {
      "title": "Utilizar e2image",
      "level": 3,
      "content": "e2image es una herramienta incluida en e2fsprogs con fines de depuración. Se puede usar para copiar particiones ext2, ext3 y ext4 de manera eficiente al realizar copias solo de los bloques usados. Tenga en cuenta que esto solo funciona para los sistemas de archivos ext2, ext3 y ext4, y los bloques no utilizados no se copian, por lo que puede que esta herramienta no le sea útil si lo que espera es recuperar archivos eliminados.\n\nPara clonar una partición desde el disco físico /dev/sda, partición 1, al disco físico /dev/sdb, partición 1, con e2image, ejecute:\n\n```\n# e2image -ra -p /dev/sda1 /dev/sdb1\n```\n\n"
    },
    {
      "title": "Software de clonación de disco",
      "level": 2,
      "content": "Estas aplicaciones permiten realizar fácilmente copias de seguridad de sistemas de archivos completos y recuperación en caso de falla, generalmente en forma de un CD Live o unidad USB. Contienen imágenes completas del sistema realizadas en uno o más momentos específicos en el tiempo y se utilizan con frecuencia para registrar configuraciones buenas conocidas. Vea Wikipedia:Comparison of disk cloning software para su comparación.\n\nVéase también Synchronization and backup programs para ver otras aplicaciones que pueden tomar instantáneas completas del sistema, entre otras funciones.\n\n- Arch Backup — Un script básico de copia de seguridad con una configuración simple: Método de compresión configurable. Múltiples objetivos de respaldo.\n\n- Método de compresión configurable.\n- Múltiples objetivos de respaldo.\n\n- Clonezilla — Una solución de recuperación ante desastres, clonación de discos, creación e implementación de imágenes: Arranca desde CD Live, unidad flash USB o servidor PXE. Admite ext2, ext3, ext4, reiserfs, reiser4, xfs, jfs, btrfs, FAT32, NTFS, HFS+ y otros. Utiliza Partclone (predeterminado), Partimage (opcional), ntfsclone (opcional) o dd para crear imágenes o clonar una partición. Servidor de multidifusión para restaurar varias máquinas a la vez. Incluido en los medios de instalación de Arch Linux.\n\n- Arranca desde CD Live, unidad flash USB o servidor PXE.\n- Admite ext2, ext3, ext4, reiserfs, reiser4, xfs, jfs, btrfs, FAT32, NTFS, HFS+ y otros.\n- Utiliza Partclone (predeterminado), Partimage (opcional), ntfsclone (opcional) o dd para crear imágenes o clonar una partición.\n- Servidor de multidifusión para restaurar varias máquinas a la vez.\n- Incluido en los medios de instalación de Arch Linux.\n\n- Deepin Clone — Herramienta de Deepin para hacer copias de seguridad y restauración. Permite clonar, realizar copias de seguridad y restaurar discos o particiones.\n\n- FSArchiver — Una herramienta segura y flexible de copia de seguridad y despliegue de sistemas de archivos: Soporte para atributos básicos de archivo (permisos, propietario, ...). Soporte para múltiples sistemas de archivos por compresión. Soporte para atributos extendidos (son utilizados por SELinux). Soporte para atributos básicos del sistema de archivos (etiqueta, uuid, tamaño de bloque) para todos los sistemas de archivos Linux. Soporte para sistemas de archivos NTFS (capacidad para crear clones flexibles de particiones de Windows). Realiza suma de comprobación de todo lo que está escrito en el archivo (encabezados, bloques de datos, archivos completos). Posibilidad de restaurar un archivo que está dañado (solo omitirá el archivo actual). Compresión multihilo lzo, gzip, bzip2, lzma. Soporte para dividir archivos grandes en varios archivos con un tamaño máximo fijo. Cifrado del archivo usando una contraseña. Basado en blowfish de libcrypto de OpenSSL. Soporte de copia de seguridad de un sistema de archivos raíz montado (opción -A). Se puede encontrar en el System Rescue CD.\n\n- Soporte para atributos básicos de archivo (permisos, propietario, ...).\n- Soporte para múltiples sistemas de archivos por compresión.\n- Soporte para atributos extendidos (son utilizados por SELinux).\n- Soporte para atributos básicos del sistema de archivos (etiqueta, uuid, tamaño de bloque) para todos los sistemas de archivos Linux.\n- Soporte para sistemas de archivos NTFS (capacidad para crear clones flexibles de particiones de Windows).\n- Realiza suma de comprobación de todo lo que está escrito en el archivo (encabezados, bloques de datos, archivos completos).\n- Posibilidad de restaurar un archivo que está dañado (solo omitirá el archivo actual).\n- Compresión multihilo lzo, gzip, bzip2, lzma.\n- Soporte para dividir archivos grandes en varios archivos con un tamaño máximo fijo.\n- Cifrado del archivo usando una contraseña. Basado en blowfish de libcrypto de OpenSSL.\n- Soporte de copia de seguridad de un sistema de archivos raíz montado (opción -A).\n- Se puede encontrar en el System Rescue CD.\n\n- Mondo Rescue — Una solución de recuperación ante desastres para crear medios de respaldo que pueden usarse para volver a implementar el sistema dañado: Realiza copias de seguridad basadas en imágenes, compatibles con Linux/Windows. La tasa de compresión es ajustable. Puede respaldar sistemas live (sin tener que detenerlo). Puede dividir la imagen en varios archivos. Admite el arranque en un CD Live para realizar una restauración completa. Puede realizar copias de seguridad/restaurar a través de NFS, desde CD, unidades de cinta y otros medios. Puede verificar las copias de seguridad.\n\n- Realiza copias de seguridad basadas en imágenes, compatibles con Linux/Windows.\n- La tasa de compresión es ajustable.\n- Puede respaldar sistemas live (sin tener que detenerlo).\n- Puede dividir la imagen en varios archivos.\n- Admite el arranque en un CD Live para realizar una restauración completa.\n- Puede realizar copias de seguridad/restaurar a través de NFS, desde CD, unidades de cinta y otros medios.\n- Puede verificar las copias de seguridad.\n\n- Partclone — Una herramienta que se puede usar para hacer una copia de seguridad y restaurar una partición, considerando solo los bloques usados: Admite ext2, ext3, ext4, hfs+, reiserfs, reiser4, btrfs, vmfs3, vmfs5, xfs, jfs, ufs, ntfs, fat(12/16/32), exfat. Soporta compresión. Opcionalmente, se puede usar una interfaz ncurses.\n\n- Admite ext2, ext3, ext4, hfs+, reiserfs, reiser4, btrfs, vmfs3, vmfs5, xfs, jfs, ufs, ntfs, fat(12/16/32), exfat.\n- Soporta compresión.\n- Opcionalmente, se puede usar una interfaz ncurses.\n\n- Partimage — Una utilidad de clonación de disco ncurses para entornos Linux/UNIX. Tiene un CD live. Admite los sistemas de archivos más populares en Linux, Windows y Mac OS. Compresión. Guarda en múltiples CD o DVD o en una red usando Samba/NFS. El desarrollo se detuvo a favor de FSArchiver.p\n\n- Tiene un CD live.\n- Admite los sistemas de archivos más populares en Linux, Windows y Mac OS.\n- Compresión.\n- Guarda en múltiples CD o DVD o en una red usando Samba/NFS.\n- El desarrollo se detuvo a favor de FSArchiver.p\n\n- J7Z — GUI para Linux en Java que intenta simplificar la compresión de datos y la copia de seguridad. Puede crear archivos 7z, BZip2, Zip, GZip, Tar: Actualiza archivos existentes rápidamente. Realiza copia de seguridad de múltiples carpetas en una ubicación de almacenamiento. Crea o extrae archivos protegidos. Disminuya el esfuerzo mediante el uso de archivar perfiles y listas.\n\n- Actualiza archivos existentes rápidamente.\n- Realiza copia de seguridad de múltiples carpetas en una ubicación de almacenamiento.\n- Crea o extrae archivos protegidos.\n- Disminuya el esfuerzo mediante el uso de archivar perfiles y listas.\n\n- Redo Backup and Recovery — Una aplicación de respaldo y recuperación ante desastres que se ejecuta desde una imagen de CD de Linux arrancable: Es capaz de realizar copias de seguridad y recuperación de particiones de disco. Utiliza xPUD y Partclone para el backend.\n\n- Es capaz de realizar copias de seguridad y recuperación de particiones de disco.\n- Utiliza xPUD y Partclone para el backend.\n\n- System Tar & Restore — Realiza copia de seguridad y restauración del sistema usando tar o transfiriéndolo con rsync: Interfaces GUI y CLI interfaces. Crea empaquetados .tar.gz , .tar.bz2 , .tar.xz o .tar Soporta encriptación openssl/gpg. Utiliza rsync para transferir un sistema en ejecución. Compatible con Grub2, Syslinux, EFISTUB/efibootmgr y Systemd/bootctl.\n\n- Interfaces GUI y CLI interfaces.\n- Crea empaquetados .tar.gz , .tar.bz2 , .tar.xz o .tar\n- Soporta encriptación openssl/gpg.\n- Utiliza rsync para transferir un sistema en ejecución.\n- Compatible con Grub2, Syslinux, EFISTUB/efibootmgr y Systemd/bootctl.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Lista de software de clonación de disco\n- Hilo del foro Arch Linux\n\n"
    }
  ]
}