{
  "title": "Display manager (Português)",
  "url": "https://wiki.archlinux.org/title/Display_manager_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Iniciar X no login\n\nUm gerenciador de exibição, ou gerenciador de login, é tipicamente uma interface gráfica de usuário que é exibida no final do processo de inicialização no lugar do shell padrão. Há várias implementações de gerenciadores de exibição, assim como existem vários tipos de gerenciadores de janela e ambientes de desktop. Geralmente, há uma certa quantidade de personalização e mudança de tema disponível com cada um.\n\n"
    },
    {
      "title": "Console",
      "level": 3,
      "content": "- CDM — ultra-minimalista, ainda gerenciador de login completo escrito em bash\n\n- Console TDM — Extensão para xinit escrita em puro Bash.\n\n- nodm — Gerenciador de exibição minimalista para logins automáticos.\n\n- Ly — Gerenciador de exibição experimental para ncurses.\n\n- tbsm — Uma sessão bash ou lançador de aplicativos, com suporte a sessões X e Wayland.\n\n"
    },
    {
      "title": "Gráficos",
      "level": 3,
      "content": "- GDM — Gerenciador de exibição do GNOME.\n\n- LightDM — Gerente de exibição para vários desktops, pode usar vários front-ends escritos em qualquer kit de ferramentas.\n\n- LXDM — Gerenciador de exibição do LXDE. Pode ser usado independentemente do ambiente de desktop LXDE.\n\n- SDDM — Gerenciador de exibição baseado no QML e sucessor do KDM; recomendado para Plasma e LXQt.\n\n- XDM — Gerenciador de exibição X com suporte a XDMCP, seletor de host.\n\n"
    },
    {
      "title": "Carregando o gerenciador de exibição",
      "level": 2,
      "content": "Para ativar o login gráfico, habilite o serviço systemd apropriado. Por exemplo, para SDDM, habilite sddm.service.\n\nIsso deve funcionar sem configurações extras. Caso contrário, talvez seja necessário redefinir um link simbólico personalizado default.target para apontar para o graphical.target padrão. Veja systemd (Português)#Alterar target padrão para inicializar.\n\nDepois de habilitar o SDDM, um link simbólico display-manager.service deve ser configurado em /etc/systemd/system/. Você pode precisar usar --force para substituir os links simbólicos antigos.\n\n```\n$ file /etc/systemd/system/display-manager.service\n```\n\n```\n/etc/systemd/system/display-manager.service: symbolic link to /usr/lib/systemd/system/sddm.service\n```\n\n"
    },
    {
      "title": "Usando systemd-logind",
      "level": 3,
      "content": "Para verificar o status da sua sessão de usuário, você pode usar o loginctl. Todas as ações do polkit, como suspender o sistema ou montar unidades externas, funcionarão imediatamente.\n\n```\n$ loginctl show-session $XDG_SESSION_ID\n```\n\n"
    },
    {
      "title": "Configuração de sessão",
      "level": 2,
      "content": "Muitos gerenciadores de exibição leem sessões disponíveis do diretório /usr/share/xsessions/. Ele contém arquivos de entrada de desktop padrão para cada DM/WM.\n\nPara adicionar/remover entradas à sua lista de sessões do gerenciador de exibição; crie/remova os arquivos .desktop em /usr/share/xsessions/ conforme desejado. Um arquivo .desktop comum se parecerá com:\n\n```\n[Desktop Entry]\nName=Openbox\nComment=Log in using the Openbox window manager (without a session manager)\nExec=/usr/bin/openbox-session\nTryExec=/usr/bin/openbox-session\nIcon=openbox.png\nType=Application\n```\n\n"
    },
    {
      "title": "Executar ~/.xinitrc como uma sessão",
      "level": 3,
      "content": "Instalar xinit-xsessionAUR vai fornecer uma opção para executar seu xinitrc como uma sessão. Basta definir xinitrc como a sessão nas configurações do gerenciador de exibição e se certificar de que o arquivo ~/.xinitrc é um executável.\n\n"
    },
    {
      "title": "Iniciando aplicativos sem um gerenciador de janela",
      "level": 3,
      "content": "Você também pode iniciar um aplicativo sem qualquer gerenciamento de janela, área de trabalho ou de decoração. Por exemplo, para iniciar o google-chromeAUR crie um arquivo web-browser.desktop em /usr/share/xsessions/ desta forma:\n\n```\n[Desktop Entry]\nName=Web Browser\nComment=Use a web browser as your session\nExec=/usr/bin/google-chrome --auto-launch-at-startup\nTryExec=/usr/bin/google-chrome --auto-launch-at-startup\nIcon=google-chrome\nType=Application\n```\n\nNesse caso, quando você fizer o login, o aplicativo configurado com Exec será iniciado imediatamente. Quando você fechar o aplicativo, você será levado de volta ao gerenciador de login (o mesmo que fazer logout de um DE/WM normal).\n\nÉ importante lembrar que a maioria dos aplicativos gráficos não é destinada a ser iniciada dessa forma e você pode ter ajustes manuais para fazer ou limitações para viver com (não há gerenciador de janela, portanto, não espere conseguir mover ou redimensionar qualquer janela, incluindo diálogos; no entanto, você pode ser capaz de definir a geometria da janela nos arquivos de configuração do aplicativo).\n\nVeja também #Inicializando aplicativos sem um gerenciador de janela.\n\n"
    },
    {
      "title": "Iniciando automaticamente",
      "level": 3,
      "content": "A maioria dos gerenciadores de exibição carregam /etc/xprofile, ~/.xprofile e /etc/X11/xinit/xinitrc.d/. Para mais detalhes, veja xprofile.\n\n"
    },
    {
      "title": "Definir o idioma para sessão de usuário",
      "level": 3,
      "content": "Para gerenciadores de exibição que usam AccountsService o locale para a sessão de usuário pode ser definido editando:\n\n```\n/var/lib/AccountsService/users/$USER\n```\n\n```\n[User]\nLanguage=seu_locale\n```\n\nsendo seu_locale um valor como pt_BR.UTF-8.\n\nFaça logout e, então, volte novamente para as alterações terem efeito.\n\n"
    }
  ]
}