{
  "title": "Distrobox (Português)",
  "url": "https://wiki.archlinux.org/title/Distrobox_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O Distrobox é uma camada de encapsulamento de contêineres que permite ao usuário instalar versões containerizadas do Linux diferentes do host, proporcionando uma integração estreita com o host e permitindo o uso de binários projetados para uma distribuição em outra.\n\nO Distrobox não é um gerenciador de contêineres e depende do Podman ou Docker para criar contêineres.\n\nDa documentação do Distrobox:\n\n"
    },
    {
      "title": "Implicações de segurança",
      "level": 2,
      "content": "O objetivo principal do Distrobox não é focar no sandboxing dos contêineres do host (o que seria impossível devido à natureza da integração estreita do projeto) e, como tal, os contêineres executados dentro do Distrobox terão acesso total à sua pasta home e a alguns outros locais.\n\nÉ recomendado usar o Podman ao invés do Docker, já que por padrão o Docker executará contêineres como root e contêineres rootful terão acesso irrestrito ao sistema de arquivos do host. O Docker sem root atualmente não funciona, mas está sendo desenvolvido.\n\nSandboxing é possível, veja #Modo unsharing para detalhes.\n\n"
    },
    {
      "title": "Com acesso root",
      "level": 3,
      "content": "Primeiro, siga a página para Podman (Português) ou Docker e verifique se você consegue instalar e executar um contêiner Hello World.\n\nInstale o distrobox ou distrobox-gitAUR\n\n"
    },
    {
      "title": "Sem acesso root/sistema de arquivos imutável",
      "level": 3,
      "content": "É possível instalar o Distrobox na sua pasta home se você não tiver acesso root ao sistema ou se estiver usando uma distro imutável. Isso requer o uso de um pipe curl-to-sh, que é um método de instalação não suportado devido ao risco de segurança.\n\nVocê pode encontrar instruções na página de documentação do Distrobox\n\n"
    },
    {
      "title": "Desinstalando",
      "level": 4,
      "content": "O Distrobox fornece um script de desinstalação para instalações sem root, necessário apenas se você instalou sem root. Se instalou via Pacman, então deve desinstalar da maneira usual.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "- Ao longo da seção seguinte, nome é uma variável e pode ser o que você quiser. Em todos os casos, substitua nome pelo nome real que escolher\n- Para a lista completa de opções suportadas em qualquer subcategoria, use --help, por exemplo, para ver todas as opções de criação use distrobox create --help\n- Uma lista completa de distribuições suportadas, junto com os nomes de suas imagens, pode ser encontrada em https://distrobox.it/compatibility/#containers-distros\n- Para técnicas de uso mais avançadas, consulte a página de Documentação do Distrobox em https://distrobox.it/usage/usage/\n\nPara criar um novo contêiner, execute o seguinte:\n\n```\n$ distrobox create -n nome\n```\n\nPara listar contêineres instalados, execute o seguinte:\n\n```\n$ distrobox list\n```\n\nPara interagir com um contêiner instalado, execute o seguinte:\n\n```\n$ distrobox enter nome\n```\n\nou você pode enviar um comando diretamente para um contêiner com:\n\n```\n$ distrobox enter nome -- comando-a-executar\n```\n\nPara parar um contêiner em execução, execute o seguinte:\n\n```\n$ distrobox stop nome\n```\n\nPara excluir um contêiner, execute o seguinte:\n\n```\n$ distrobox rm nome\n```\n\nPara instalar uma distribuição específica em um contêiner, execute o seguinte (neste exemplo, Ubuntu):\n\n```\n$ distrobox create --image ubuntu:22.04\n```\n\nAs instalações podem ser totalmente personalizadas da seguinte forma (neste exemplo, um contêiner chamado teste executando Gentoo com acesso root):\n\n```\n$ distrobox create -i docker.io/gentoo/stage3:latest -n teste --root\n```\n\nSe você precisar que seu contêiner tenha acesso root ao host, recomenda-se usar a flag --root em vez de sudo distrobox.\n\n"
    },
    {
      "title": "Modo unsharing",
      "level": 3,
      "content": "O Distrobox agora permite que os usuários unshare certos locais em seu sistema de arquivos. No seu modo padrão, os seguintes compartilhamentos são criados, devsysfs, ipc, netns, process, $HOME e Acesso a Aplicativos.\n\nAgora você pode escolher unshare alguns desses usando os comandos listados abaixo ao criar um novo contêiner:\n\nTable content:\nCompartilhamento | Comando | Uso\ndevsysfs | --unshare-devsysfs | Não compartilhar dispositivos e diretórios sysfs do host.\nipc | --unshare-ipc | Não compartilhar o namespace ipc com o host.\nnetns | --unshare-netns | Não compartilhar o namespace de rede com o host.\nprocess | --unshare-process | Não compartilhar o namespace de processos com o host.\nAll | --unshare-all | Ativar todas as flags de unshare.\n\nNão compartilhar $HOME e Acesso a Aplicativos não é possível, pois são obrigatórios e sem eles o Distrobox não seria capaz de operar.\n\nNote: **não ser uma sandbox completa** \n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "É possível configurar o Distrobox de duas maneiras, com um arquivo de configuração ou usando variáveis de ambiente.\n\n"
    },
    {
      "title": "Arquivo de configuração",
      "level": 3,
      "content": "O Distrobox verifica os seguintes locais para arquivos de configuração, do menos ao mais importante:\n\n- /usr/share/distrobox/distrobox.conf\n- /usr/etc/distrobox/distrobox.conf\n- /etc/distrobox/distrobox.conf\n- ~/.config/distrobox/distrobox.conf\n- ~/.distroboxrc\n\nUm exemplo de arquivo de configuração é o seguinte:\n\n```\ncontainer_always_pull=\"1\"\ncontainer_generate_entry=0\ncontainer_manager=\"docker\"\ncontainer_image_default=\"registry.opensuse.org/opensuse/toolbox:latest\"\ncontainer_name_default=\"nome-teste-1\"\ncontainer_user_custom_home=\"$HOME/.local/share/container-home-test\"\ncontainer_init_hook=\"~/.local/distrobox/a_custom_default_init_hook.sh\"\ncontainer_pre_init_hook=\"~/a_custom_default_pre_init_hook.sh\"\nnon_interactive=\"1\"\nskip_workdir=\"0\"\n```\n\n"
    },
    {
      "title": "Variáveis de ambiente",
      "level": 3,
      "content": "As seguintes variáveis estão disponíveis e devem ser definidas usando variáveis por usuário:\n\n```\nDBX_CONTAINER_ALWAYS_PULL\nDBX_CONTAINER_CUSTOM_HOME\nDBX_CONTAINER_IMAGE\nDBX_CONTAINER_MANAGER\nDBX_CONTAINER_NAME\nDBX_CONTAINER_ENTRY\nDBX_NON_INTERACTIVE\nDBX_SKIP_WORKDIR\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Página do GitHub do Projeto\n- Página de documentação do projeto\n\n"
    }
  ]
}