{
  "title": "DKMS (Português)",
  "url": "https://wiki.archlinux.org/title/DKMS_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Da Wikipédia:\n\nIsto significa que o usuário não precisa esperar que uma companhia, projeto ou mantenedor de pacotes lancem uma nova versão do módulo. Desde a introdução dos hooks do pacman, a recompilação de módulos do kernel é automaticamente providenciada quando um kernel é atualizado.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote dkms e o header para o kernel (ou kernels, se mais de um estiver instalado). Por exemplo, para o kernel padrão linux este deverá ser linux-headers. Outros kernels têm seus respectivos headers.\n\nUm bom número de módulos que residem fora da árvore do kernel tem sua variante para DKMS; alguns deles estão em repositórios oficiais, outros são encontrados no AUR.\n\n"
    },
    {
      "title": "Atualizações",
      "level": 2,
      "content": "Apesar da recompilação de módulos DKMS ser comumente discreta durante uma atualização de kernel, pode ocorrer da recompilação falhar. Você deve prestar uma atenção extra nas saídas do pacman. Isto se aplica em particular se o sistema depende do módulo DKMS para inicializar e/ou se você usar um kernel personalizado que não esteja nos repositórios oficiais.\n\nPara lidar com alterações no kernel, correções de bugs ou adicionar recursos necessários extra, considere atualizar o pacote DKMS antes de reinicializar o sistema.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Utilização para invocar DKMS manualmente.\n\nÉ possível usar autocompletar fazendo:\n\n```\n# source /usr/share/bash-completion/completions/dkms\n```\n\n"
    },
    {
      "title": "Listar módulos",
      "level": 3,
      "content": "Para listar a situação atual dos módulos, versões e kernels em árvore:\n\n```\n# dkms status\n```\n\n"
    },
    {
      "title": "Recompilar módulos",
      "level": 3,
      "content": "Recompilar todos os módulos para o kernel atualmente em execução:\n\n```\n# dkms autoinstall\n```\n\nou para um kernel específico:\n\n```\n# dkms autoinstall -k 3.16.4-1-ARCH\n```\n\nPara compilar um módulo específico para o kernel atualmente em execução:\n\n```\n# dkms install -m nvidia -v 334.21\n```\n\nou simplesmente:\n\n```\n# dkms install nvidia/334.21\n```\n\nPara compilar um módulo para todos os kernels:\n\n```\n# dkms install nvidia/334.21 --all\n```\n\n"
    },
    {
      "title": "Remover módulos",
      "level": 3,
      "content": "Para remover um módulo (antigos que não foram automaticamente removidos):\n\n```\n# dkms remove -m nvidia -v 331.49 --all\n```\n\nou simplesmente:\n\n```\n# dkms remove nvidia/331.49 --all\n```\n\nSe o pacote dkms é removido, a informação pertinente a arquivos de compilação de módulos anteriores é perdida. Se é este o caso, navegue por /usr/lib/modules/kernel_release e /var/lib/dkms/package_name e remova todos os arquivos e diretórios que não estiverem mais em uso.\n\n"
    },
    {
      "title": "Criação de pacote DKMS",
      "level": 2,
      "content": "Veja DKMS package guidelines (Português).\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Linux Journal: Exploring Dynamic Kernel Module Support\n\n"
    }
  ]
}