{
  "title": "DKMS (Español)",
  "url": "https://wiki.archlinux.org/title/DKMS_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "De Wikipedia:\n\nEsto significa que un usuario no tiene que esperar a que una empresa, proyecto o mantenedor de paquetes publique una nueva versión del módulo. Desde la introducción de pacman hooks, la reconstrucción de los módulos se realiza automáticamente cuando se actualiza un kernel.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete dkms y los headers del kernel/kernels. Por ejemplo, para el kernel linux por defecto sería linux-headers. Otros kernels tienen sus propios paquetes de headers.\n\nUn buen número de módulos que se encuentran fuera del árbol de fuentes del kernel tienen una variante DKMS; unos pocos están alojados en los repositorios oficiales, la mayoría se encuentran en AUR.\n\n"
    },
    {
      "title": "Actualizaciones",
      "level": 2,
      "content": "Aunque la reconstrucción de los módulos DKMS suele realizarse sin problemas durante una actualización del kernel, puede ocurrir que la reconstrucción falle. Debe prestar atención a la salida de pacman. Esto se aplica en particular si el sistema depende del módulo DKMS para arrancar correctamente y/o si utiliza DKMS con un kernel personalizado que no está en los repositorios oficiales.\n\nPara hacer frente a los cambios en el kernel, corregir errores o añadir funciones necesarias, considere la posibilidad de actualizar el paquete DKMS antes de reiniciar.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Uso para invocar DKMS manualmente.\n\nEl auto-completado está disponible utilizando:\n\n```\n# source /usr/share/bash-completion/completions/dkms\n```\n\n"
    },
    {
      "title": "Listar módulos",
      "level": 3,
      "content": "Para listar el estado actual de los módulos, versiones y kernels dentro del árbol:\n\n```\n# dkms status\n```\n\n"
    },
    {
      "title": "Reconstruir módulos",
      "level": 3,
      "content": "Reconstruir todos los módulos para el kernel que se está ejecutando actualmente:\n\n```\n# dkms autoinstall\n```\n\no para un núcleo específico:\n\n```\n# dkms autoinstall -k 6.6.19-1-ARCH\n```\n\nPara crear un módulo específico para el kernel que se está ejecutando actualmente:\n\n```\n# dkms install -m nvidia -v 550.54.14\n```\n\no simplemente\n\n```\n# dkms install nvidia/550.54.14\n```\n\nPara crear un módulo para todos los kernels:\n\n```\n# dkms install nvidia/550.54.14 --all\n```\n\n"
    },
    {
      "title": "Eliminar módulos",
      "level": 3,
      "content": "Para eliminar un módulo (los antiguos no se eliminan automáticamente):\n\n```\n# dkms remove -m nvidia -v 550.54.14 --all\n```\n\no simplemente:\n\n```\n# dkms remove nvidia/550.54.14 --all\n```\n\nSi se elimina el paquete dkms se pierde la información relativa a los ficheros de construcción de módulos anteriores. Si este es el caso, vaya a través de /usr/lib/modules/kernel_release y /var/lib/dkms/nombre_del_paquete y elimine todos los archivos y directorios que ya no estén en uso.\n\n"
    },
    {
      "title": "Creación de paquetes DKMS",
      "level": 2,
      "content": "Vea DKMS package guidelines.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Linux Journal: Exploring Dynamic Kernel Module Support\n\n"
    }
  ]
}