{
  "title": "Dm-crypt (Español)",
  "url": "https://wiki.archlinux.org/title/Dm-crypt_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-09-18** \n\nArtículos relacionados\n\n- Disk encryption (Español)\n- Removing system encryption (Español)\n\ndm-crypt es el mapeador de dispositivos del kernel de Linux con el soporte crypto. De Wikipedia:dm-crypt, es:\n\n"
    },
    {
      "title": "Escenarios comunes",
      "level": 2,
      "content": "Esta sección presenta los escenarios más comunes para emplear dm-crypt con el fin de cifrar un sistema o los puntos de montajes de sistemas de archivos individuales. Los escenarios descritos remiten a otras subpáginas para su desarrollo. Este documento se entiende, por tanto, como punto de partida para familiarizarse con las diferentes prácticas en los procedimientos de cifrado. Los escenarios se entrecruzan con las otras subpáginas cuando es necesario.\n\nConsulte Dm-crypt (Español)/Encrypting a non-root file system (Español) si desea cifrar un dispositivo que no se utiliza para arrancar un sistema, como puede ser una partición o un dispositivo loop.\n\nConsulte Dm-crypt (Español)/Encrypting an entire system (Español) si desea cifrar el sistema completo, en especial una partición raíz. En este caso hay varios escenarios posibles, incluyendo la utilización de dm-crypt con la extensión LUKS, la modalidad de cifrado plain y el cifrado más LVM.\n\n"
    },
    {
      "title": "Preparar la unidad",
      "level": 2,
      "content": "Dm-crypt (Español)/Drive preparation (Español) se ocupará de operaciones tales como borrar con seguridad un dispositivo y particionarlo.\n\n"
    },
    {
      "title": "Cifrar un dispositivo",
      "level": 2,
      "content": "Dm-crypt (Español)/Device encryption (Español) explicará cómo utilizar manualmente dm-crypt para cifrar un sistema con la orden cryptsetup. Se presentan ejemplos de las opciones de cifrado con dm-crypt, acompañados con la creación de archivo de claves, órdenes específicas de LUKS para la gestión de claves, así como para la creación de copias de respaldo y restauración.\n\n"
    },
    {
      "title": "Configurar el sistema",
      "level": 2,
      "content": "Dm-crypt/System configuration ilustrará sobre cómo configurar mkinitcpio, el gestor de arranque y el archivo crypttab durante el cifrado del sistema.\n\n"
    },
    {
      "title": "Cifrar el espacio de intercambio",
      "level": 2,
      "content": "Dm-crypt (Español)/Swap encryption (Español) versará sobre cómo añadir una partición de intercambio a un sistema cifrado, si se necesita. La partición de intercambio puede estar cifrada para proteger los datos de intercambio expuestos del sistema. Esta parte detalla métodos con y sin soporte para suspender-en-disco.\n\n"
    },
    {
      "title": "Especialidades",
      "level": 2,
      "content": "Dm-crypt (Español)/Specialties (Español) tratará sobre operaciones especiales como proteger la partición de arranque no cifrada, utilizar archivos de claves cifrados con GPG o OpenSSL, un método para arrancar y desbloquear a través de la red, otro para configurar discard/TRIM para un disco SSD y secciones que se ocupan del hook encrypt y múltiples discos.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- dm-crypt - La página principal del proyecto.\n- cryptsetup - La página principal de LUKS y FAQ - el principal y más importante recurso de ayuda.\n- Repositorio de cryptsetup y el archivo release.\n\n"
    }
  ]
}