{
  "title": "Dm-crypt (Polski)",
  "url": "https://wiki.archlinux.org/title/Dm-crypt_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Powiązane artykuły\n\n- Szyfrowanie dysku\n- Removing System Encryption\n\nZ projektu cryptsetup wiki:\n\n"
    },
    {
      "title": "Typowy scenariusz",
      "level": 2,
      "content": "W tej części przedstawiono powszechne scenariusze zastosowania \"dm-crypt\" do szyfrowania systemu lub poszczególnych punktów instalacji systemu plików. Jest to punkt wyjścia do zapoznania się z różnymi praktycznymi procedurami szyfrowania. W razie potrzeby scenariusze łączą się z innymi podstronami.\n\nZobacz dm-crypt (Polski)/Encrypting a non-root file system (Polski) jeśli chcesz zaszyfrować urządzenie, które nie jest używane do uruchamiania systemu, takie jak partycja lub loop device.\n\nZobacz dm-crypt (Polski)/Encrypting an entire system (Polski) jeśli chcesz zaszyfrować cały system, w szczególności partycję root. Uwzględniono kilka scenariuszy, w tym wykorzystanie \"dm-crypt\" z rozszerzeniem \"LUKS\", szyfrowanie i szyfrowanie w trybie \"zwykłym\" oraz \"LVM\".\n\n"
    },
    {
      "title": "Przygotowywanie dysku",
      "level": 2,
      "content": "dm-crypt (Polski)/Drive preparation (Polski) dotyczy operacji takich jak dm-crypt (Polski)/Drive preparation (Polski)#Bezpieczne usuwanie danych z dysku twardego i dm-crypt specyficzne punkty do jego partycjonowania.\n\n"
    },
    {
      "title": "Szyfrowanie urządzenia",
      "level": 2,
      "content": "dm-crypt (Polski)/Device encryption (Polski) obejmuje sposób ręcznego wykorzystania dm-crypt do szyfrowania systemu za pomocą komendy cryptsetup. Obejmuje przykłady opcji szyfrowania z dm-crypt, zajmuje się tworzeniem plików kluczy, poleceń LUKS dotyczących zarządzania kluczami oraz tworzenia kopii zapasowych i przywracania.\n\n"
    },
    {
      "title": "Konfiguracja systemu",
      "level": 2,
      "content": "dm-crypt/System configuration ilustruje, jak skonfigurować mkinitcpio, boot loader i crypttab plik podczas szyfrowania systemu.\n\n"
    },
    {
      "title": "Szyfrowanie partycji swap",
      "level": 2,
      "content": "dm-crypt (Polski)/Swap encryption (Polski) obejmuje sposób dodania partycji wymiany do systemu szyfrowanego, jeśli jest to wymagane. Partycja wymiany musi być również zaszyfrowana, aby chronić dane wymieniane przez system. Ta część opisuje metody without i with suspend-to-disk support.\n\n"
    },
    {
      "title": "Operacje specjalne",
      "level": 2,
      "content": "dm-crypt (Polski)/Specialties (Polski) zajmuje się operacjami specjalnymi, zabezpieczenie niezaszyfrowanej partycji rozruchowej, przy użyciu zaszyfrowanych plików kluczy GPG lub OpenSSL, metoda uruchamiania i odblokowywania za pośrednictwem sieci, inna dla konfiguracja discard/TRIM dla SSD, i sekcje dotyczące Szyfrowanie hook i wiele dysków.\n\n"
    },
    {
      "title": "Zobacz też",
      "level": 2,
      "content": "- dm-crypt - Strona główna projektu.\n- cryptsetup - Strona główna LUKS i FAQ - główne źródło informacji.\n- cryptsetup repository i archiwum release .\n- DOXBOX - Wspiera odblokowywanie przestrzeni zaszyfrowanych LUKS w Microsoft Windows.\n\n"
    }
  ]
}