{
  "title": "Dm-crypt (Українська)/Swap encryption (Українська)",
  "url": "https://wiki.archlinux.org/title/Dm-crypt_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)/Swap_encryption_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Залежно від вимог, можуть використовуватися різні методи для шифрування розділу swap, які описані нижче. Налаштування, при якому шифрування свопу повторно ініціалізується під час перезавантаження (з новим шифром), забезпечує більш високий захист даних, оскільки дозволяє уникнути чутливих фрагментів файлів, які, можливо, були досить давно записані у своп і збереглись без перезапису. Однак повторне шифрування свопу, як правило, також забороняє використання функції призупинення на диск.\n\n"
    },
    {
      "title": "Без підтримки функції призупинення на диск",
      "level": 2,
      "content": "У системах, де призупинення роботи на диск (сплячий режим) не є бажаною функцією, /etc/crypttab можна налаштувати для розшифровки розділу підкачки випадковим паролем із простим dm-crypt під час завантаження. Випадковий пароль відкидається під час вимкнення, залишаючи позаду лише зашифровані, недоступні дані в пристрої обміну. Щоб увімкнути цю функцію, просто розкоментуйте рядок, що починається з swap, у /etc/crypttab. Змініть параметр <device> на ім’я вашого пристрою підкачки. Наприклад, це буде виглядати приблизно так:\n\n```\n/etc/crypttab\n```\n\n```\n# <name>  <device>     <password>     <options>\nswap      /dev/sdX#    /dev/urandom   swap,cipher=aes-xts-plain64,size=256\n```\n\nЦе відобразить /dev/sdX# у /dev/mapper/swap як розділ підкачки, який можна додати в /etc/fstab як звичайний своп. Якщо у вас раніше був незашифрований розділ підкачки, не забудьте його відключити, або повторно використати його fstab запис, змінивши device на /dev/mapper/swap. Опцій за замовчуванням має бути достатньо для більшості використань. Інші варіанти та пояснення кожного стовпця наведено у crypttab(5), а також point cryptsetup FAQ 2.3.\n\nNote: **видалено** \n\n- Використовуйте шляхи by-id та by-path. Однак вони обидва сприйнятливі до апаратних змін. Див. Persistent block device naming#by-id and by-path.\n- Використовуйте ім'я логічного тому LVM.\n- Використовуйте метод, описаний у #UUID і LABEL. Мітки та UUIDS не можна використовувати безпосередньо через рекреацію та повторне шифрування пристрою підкачки при кожному завантаженні за допомогою mkswap, див. cryptsetup FAQ.\n\nЩоб використовувати постійне іменування пристрою by-id замість простого іменування ядра, спочатку визначте пристрій підкачки:\n\n```\n# find -L /dev/disk -samefile /dev/sdaX\n```\n\n```\n/dev/disk/by-id/ata-WDC_WD2500BEVT-22ZCT0_WD-WXE908VF0470-partX\n/dev/disk/by-id/wwn-0x60015ee0000b237f-partX\n```\n\nПотім використовуйте як постійне посилання, наприклад для розділу /dev/sdX# (якщо повертаються два результати, як зазначено вище, виберіть один із них):\n\n```\n/etc/crypttab\n```\n\n```\n# <name> <device>                                                        <password>    <options>\nswap     /dev/disk/by-id/ata-WDC_WD2500BEVT-22ZCT0_WD-WXE908VF0470-partX /dev/urandom  swap,cipher=aes-cbc-essiv:sha256,size=256\n```\n\nЗауважите, що після перезавантаження і активації зашифрованого розділу підкачки, запуск для нього swapon -s показує довільний запис для відображення пристрою (наприклад, /dev/dm-1), тоді як команда lsblk показує crypt у стовпці FSTYPE. Завдяки новому шифруванню при кожному завантаженні, UUID для /dev/mapper/swap буде змінюватися кожного разу.\n\n"
    },
    {
      "title": "UUID і LABEL",
      "level": 3,
      "content": "Небезпечно використовувати crypttab розділ підкачки з простими іменами пристроїв ядра, такими як /dev/sdX# або навіть /dev/disk/by-id/ata-SERIAL-partX. Незначна зміна назв пристроїв або макета розділів та /etc/crypttab побачить ваші цінні дані, які будуть відформатовані під час наступного завантаження. Те саме, якщо ви використовуєте PARTUUID, а потім вирішите використовувати цей розділ для чогось іншого, не видаляючи спочатку запис crypttab.\n\nНадійніше визначити правильний розділ, надавши йому справжній UUID або LABEL. За замовчуванням це не працює, оскільки dm-crypt та mkswap просто перезаписують будь-який вміст у цьому розділі, який також видаляє UUID та LABEL; однак можна вказати зміщення підкачки. Це дозволяє створити дуже маленьку, порожню, неправдиву файлову систему, яка не має жодної іншої мети, окрім забезпечення постійного UUID або LABEL для шифрування свопа.\n\nСтворіть файлову систему з міткою на ваш вибір:\n\n```\n# mkfs.ext2 -L cryptswap /dev/sdX# 1M\n```\n\nНезвичний параметр після імені пристрою обмежує розмір файлової системи до 1 Мб, залишаючи за собою місце для зашифрованого свопу.\n\n```\n# blkid /dev/sdX#\n```\n\n```\n/dev/sdX#: LABEL=\"cryptswap\" UUID=\"b72c384e-bd3c-49aa-b7a7-a28ea81a2605\" TYPE=\"ext2\"\n```\n\nЗавдяки цьому /dev/sdX# тепер легко можна ідентифікувати за допомогою UUID або LABEL, незалежно від того, як в майбутньому може змінитися назва пристрою або навіть номер розділу. Залишились лише відредагувати записи /etc/crypttab та /etc/fstab:\n\n```\n/etc/crypttab\n```\n\n```\n# <name> <device>         <password>    <options>\nswap     LABEL=cryptswap  /dev/urandom  swap,offset=2048,cipher=aes-xts-plain64,size=512\n```\n\nЗверніть увагу на зміщення: це 2048 секторів по 512 байт, отже, 1 Мб. Таким чином зашифрований своп не вплине на LABEL/UUID файлової системи, вирівнювання даних також працює.\n\n```\n/etc/fstab\n```\n\n```\n# <filesystem>    <dir>  <type>  <options>  <dump>  <pass>\n/dev/mapper/swap  none   swap    defaults   0       0\n```\n\nВикористовуючи це налаштування, криптосвоп намагатиметься використовувати лише розділ із відповідною міткою, незалежно від імені пристрою. Якщо ви вирішите використовувати розділ для чогось іншого, відформатувавши його, мітка cryptswap також буде втрачена, тому кріптосвоп не перезапише його під час наступного завантаження.\n\n"
    },
    {
      "title": "Вимкнення режиму глибокого сну в робочих середовищах",
      "level": 3,
      "content": "Середовища робочого столу не можуть автоматично виявити, що розділ підкачки зашифрований випадковим ключем і не може використовуватися для призупинення на диск.\n\nXfce можна налаштувати на приховування своєї кнопки Hibernate, виконавши цю команду:\n\n```\n$ xfconf-query -c xfce4-session -np /shutdown/ShowHibernate -t bool -s false\n```\n\n"
    },
    {
      "title": "З підтримкою призупинення на диск",
      "level": 2,
      "content": "Щоб мати змогу відновити роботу після призупинення роботи комп’ютера на диск (сплячого режиму), потрібно зберегти своп простір цілим. Отже, потрібно мати раніше існуючий розділ або файл підкачки LUKS, який можна зберігати на диску або вводити вручну під час запуску.\n\nНаступні три методи є альтернативами налаштування зашифрованого своп з підтримкою призупинення на диск. Якщо ви застосовуєте будь-який із них, пам’ятайте, що критичні дані, які система замінює, можуть потенційно залишатися в свопі протягом тривалого періоду (тобто доки він не буде перезаписаний). Щоб зменшити цей ризик, розгляньте можливість встановлення системного завдання, яке повторно шифрує своп, наприклад кожного разу, коли система переходить у звичайне відключення, разом із вибраним методом.\n\n"
    },
    {
      "title": "LVM на LUKS",
      "level": 3,
      "content": "Якщо том підкачки знаходиться у групі томів, яка активується в initramfs, просто дотримуйтесь інструкцій у Power management/Suspend and hibernate#Hibernation.\n\n"
    },
    {
      "title": "Використання розділу підкачки",
      "level": 3,
      "content": "Щоб відновити роботу із зашифрованого розділу підкачки, зашифрований розділ потрібно розблокувати в initramfs.\n\n- При використанні initramfs на основі busybox( це за замовчуванням) застосуйте виверт encrypt, дотримуйтесь інструкцій у #Виверт mkinitcpio.\n- Коли ж використовуєте initramfs на основі systemd з mkinitcpio вивертом sd-encrypt, просто вкажіть додаткові параметри ядра rd.luks, щоб розблокувати розділ підкачки.\n\n"
    },
    {
      "title": "Виверт mkinitcpio",
      "level": 4,
      "content": "Якщо пристрій підкачки знаходиться на пристрої, відмінному від пристрою кореневої файлової системи, він не буде відкритий вивертом encrypt, тобто відновлення повинно відбутися до того, як /etc/crypttab може бути використаний, тому потрібно створити виверт у /etc/mkinitcpio.conf, щоб відкрити своп пристрій LUKS перед відновленням.\n\nЯкщо ви хочете послуговуватись розділом, який зараз використовується системою, спочатку його потрібно відключити:\n\n```\n# swapoff /dev/<device>\n```\n\nТакож не забудьте видалити будь-який рядок із /etc/crypttab, що вказує на цей пристрій.\n\nЯкщо ви повторно використовуєте існуючий своп partition, і якщо розділ знаходиться в таблиці розділів GPT, вам потрібно буде використовувати gdisk, щоб встановити на ньому атрибут розділу 63 \"не монтувати автоматично \"partition attribute 63 \"do not automount\". Це не дозволить systemd-gpt-auto-generator виявити та ввімкнути розділ під час завантаження.\n\nНаступна установка має недолік, оскільки при кожному завантаженні потрібно додатково вручну вставляти парольну фразу для розділу підкачки.\n\nЩоб відформатувати зашифрований контейнер для розділу підкачки, створіть набір ключів для запам’ятовуваної користувачем парольної фрази.\n\n```\n# cryptsetup luksFormat /dev/<device>\n```\n\nВідкрийте розділ у /dev/mapper:\n\n```\n# cryptsetup open /dev/<device> swapDevice\n```\n\nСтворіть файлову систему підкачки всередині відображеного розділу:\n\n```\n# mkswap /dev/mapper/swapDevice\n```\n\nТепер вам потрібно створити виверт, щоб відкрити підкачку під час завантаження. Ви можете встановити install та налаштувати пакет mkinitcpio-openswapAUR, або слідувати наступним інструкціям. Створіть файл хука, що містить команду відкриття вашого пристрою підкачки:\n\n```\n/etc/initcpio/hooks/openswap\n```\n\n```\nrun_hook ()\n{\n    cryptsetup open /dev/<device> swapDevice\n}\n```\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nшляхом введення пароля під час завантаження або:\n\n```\n/etc/initcpio/hooks/openswap\n```\n\n```\nrun_hook ()\n{\n    ## Optional: To avoid race conditions\n    x=0;\n    while [ ! -b /dev/mapper/<root-device> ] && [ $x -le 10 ]; do\n       x=$((x+1))\n       sleep .2\n    done\n    ## End of optional\n\n    mkdir crypto_key_device\n    mount /dev/mapper/<root-device> crypto_key_device\n    cryptsetup open --key-file crypto_key_device/<path-to-the-key> /dev/<device> swapDevice\n    umount crypto_key_device\n}\n```\n\nшляхом завантаження файлу із зашифрованного кореневого пристрою.\n\nНа деяких комп’ютерах можуть виникати умови, що призводять до перегонів , коли mkinitcpio намагається встановити пристрій перед процесом дешифрування та завершенням переліку пристроїв. Коментований блок Optional затримає процес завантаження на 2 секунди, поки кореневий пристрій не буде готовий до монтування.\n\nПотім створіть і відредагуйте файл налаштування виверта:\n\n```\n/etc/initcpio/install/openswap\n```\n\n```\nbuild ()\n{\n   add_runscript\n}\nhelp ()\n{\ncat<<HELPEOF\n  This opens the swap encrypted partition /dev/<device> in /dev/mapper/swapDevice\nHELPEOF\n}\n```\n\nДодайте виверт openswap в рядок HOOKS в /etc/mkinitcpio.conf, перед filesystem, але після encrypt. Не забудьте додати виверт resume після openswap.\n\n```\nHOOKS=(... encrypt openswap resume filesystems ...)\n```\n\nПерегенеруйте initramfs Regenerate the initramfs.\n\nДодайте відображений розділ до /etc/fstab, доповнивши таким рядком:\n\n```\n/dev/mapper/swapDevice swap swap defaults 0 0\n```\n\nНалаштуйте свою систему на відновлення з /dev/mapper/swapDevice. Наприклад, якщо ви використовуєте GRUB з підтримкою ядром сплячого режиму, додайте параметр ядра resume=/dev/mapper/swapDevice до GRUB, додавши його до GRUB_CMDLINE_LINUX_DEFAULT змінна в /etc/default/grub. Рядок grub.cfg для ядра із зашифрованими кореневим та своп розділами може виглядати так:\n\n```\nkernel /vmlinuz-linux cryptdevice=/dev/sda2:rootDevice root=/dev/mapper/rootDevice resume=/dev/mapper/swapDevice ro\n```\n\nПід час завантаження виверт openswap відкриє розділ підкачки, щоб відновлення ядра могло використовувати його. Якщо ви використовуєте спеціальні виверти для виходу з режиму глибокого сну, переконайтеся, що вони розміщені після openswap у масиві HOOKS. Зверніть увагу, що через відкриття розділу підкачки у initrd не має потреби вносити запис про swapDevice у /etc/crypttab в цьому випадку.\n\n"
    },
    {
      "title": "Використання файла підкачки",
      "level": 3,
      "content": "Файл свопу може бути використаний для резервування місця підкачки в межах існуючого розділу, а також може бути встановлений всередині зашифрованого розділу блочного пристрою.\n\nДотримуйтесь інструкцій щодо створення файлів підкачки у Swap#Swap file та налаштуйте сплячий режим відповідно до Power management/Suspend and hibernate#Acquire swap file offset.\n\n"
    },
    {
      "title": "Відомі проблеми",
      "level": 2,
      "content": "- Stopped (with error) /dev/dm-1 in logs. See systemd issue 1620.\n\n"
    }
  ]
}