{
  "title": "Dmenu (Русский)",
  "url": "https://wiki.archlinux.org/title/Dmenu_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- List of applications/Other#Application launchers\n\ndmenu — быстрое и лёгкое динамическое меню для X. dmenu читает произвольный текст со стандартного ввода и создаёт меню с отдельным пунктом для каждой прочитанной строки. Затем пользователь может выбрать нужный пункт, используя клавиши со стрелками или вводя часть имени, после чего соответствующая строка будет напечатана в стандартный вывод. dmenu_run — обёртка, поставляемая с dmenu и позволяющая использовать его в качестве утилиты запуска приложений.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет dmenu или dmenu-gitAUR, если хотите использовать нестабильную версию.\n\nСуществуют различные исправленные варианты, расширяющие функциональность dmenu.\n\ndmenu можно запустить следующим образом:\n\n```\n$ dmenu_run\n```\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Теперь необходимо назначить команду dmenu_run на сочетание клавиш. Это можно сделать с помощью настройки оконного менеджера, среды рабочего стола или же с помощью программы, подобной xbindkeys. Смотрите статью Дополнительные клавиши для получения дополнительной информации.\n\n"
    },
    {
      "title": "Отображение пользовательских пунктов меню",
      "level": 3,
      "content": "Пользовательские пункты должны быть разделены символом новой строки (\\n) и переданы на стандартный ввод dmenu, например:\n\n```\n$ echo -e \"первое\\nвторое\\nтретье\" | dmenu\n```\n\n"
    },
    {
      "title": "Добавление пунктов меню вручную",
      "level": 3,
      "content": "dmenu ищет исполняемые файлы в каталогах, определённых с помощью переменной окружения $PATH. О том, как изменить переменную $PATH, смотрите статью Переменные окружения.\n\n"
    },
    {
      "title": "Шрифты",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\ndmenu может отображать шрифты с помощью логического описания X шрифта, используя инструмент xfontsel, который предоставляется пакетом xorg-xfontsel. В этом примере dmenu будет запускаться с использованием terminus-font:\n\n```\n$ dmenu_run -fn \"-xos4-terminus-medium-r-*-*-14-*\"\n```\n\nЕсли используется dmenu с поддержкой XFT, синтаксис аналогичен:\n\n```\n$ dmenu_run -fn 'Droid Sans Mono-9'\n```\n\n"
    },
    {
      "title": "Поддержка псевдонимов оболочки",
      "level": 3,
      "content": "dmenu не поддерживает псевдонимы оболочки. Чтобы dmenu распознал псевдонимы, установите пакет dmenu-recent-aliases-gitAUR из AUR и запустите dmenu_run_aliases. Ваши псевдонимы должны находиться в ~/.bash_aliases или ~/.zsh_aliases, чтобы dmenu_run_aliases мог их распознать.\n\n"
    },
    {
      "title": "Локаль не поддерживается",
      "level": 3,
      "content": "Запуск dmenu_run приводит к следующему сообщению об ошибке:\n\n```\n$ dmenu_run\n```\n\n```\nno locale support\n```\n\nУбедитесь, что переменная окружения LANG установлена правильно. Для получения дополнительной информации смотрите статью Локали#Решение проблем.\n\n"
    },
    {
      "title": "Отсутствующие пункты меню",
      "level": 3,
      "content": "Если dmenu не отображает определённые пункты, возможно, был повреждён кеш. Удалите кеш и перезапустите dmenu.\n\n```\n$ rm ~/.dmenu_cache\n$ rm ~/.cache/dmenu_run\n```\n\nОбратите внимание, что, скорее всего, будет только один файл кеша в зависимости от того, установлена ли переменная $XDG_CACHE_HOME. Посмотрите содержимое /usr/bin/dmenu_run для получения дополнительной информации.\n\n"
    },
    {
      "title": "Переменные окружения",
      "level": 3,
      "content": "Переменные окружения, необходимые приложениям, должны быть добавлены в /etc/environment.\n\n"
    },
    {
      "title": "Текущее окно теряет фокус",
      "level": 3,
      "content": "Ошибка в dmenu 4.9 приводит к тому, что при открытии dmenu окно теряет фокус и не восстанавливает его после закрытия dmenu. Также иногда только что запущенная программа не получает фокус. Это можно исправить, откатившись до dmenu 4.8. Смотрите обсуждение здесь.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- dmenu — официальный сайт dmenu.\n- Dmenu Hacking thread — тема на форуме Arch Linux, посвящённая исследованию dmenu. Также доступна коллекция скриптов.\n\n"
    }
  ]
}