{
  "title": "Dmenu",
  "url": "https://wiki.archlinux.org/title/Dmenu",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- List of applications/Other#Application launchers\n\ndmenu is a fast and lightweight dynamic menu for X. It reads arbitrary text from stdin, and creates a menu with one item for each line. The user can then select an item, through the arrow keys or typing a part of the name, and the line is printed to stdout. dmenu_run is a wrapper that ships with the dmenu distribution that allows its use as an application launcher.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dmenu package, or dmenu-gitAUR for the development version.\n\nVarious patched variants exist which extend dmenu's default functionality.\n\nYou may run dmenu with:\n\n```\n$ dmenu_run\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Now, you will want to attach the dmenu_run command to a keystroke combination. This can be done either via your window manager or desktop environment configuration, or with a program like xbindkeys. See the Hotkeys article for more information.\n\n"
    },
    {
      "title": "Displaying custom items",
      "level": 3,
      "content": "Custom items will be shown by separating them with a new line (\\n) and piping them into dmenu. For example:\n\n```\n$ echo -e \"first\\nsecond\\nthird\" | dmenu\n```\n\n"
    },
    {
      "title": "Manually adding items",
      "level": 3,
      "content": "dmenu will look for executables in the directories defined in your $PATH. For information on modifying your $PATH see environment variables.\n\n"
    },
    {
      "title": "Fonts",
      "level": 3,
      "content": "dmenu can display fonts using XFT. This example will run dmenu using ttf-droid:\n\n```\n$ dmenu_run -fn 'Droid Sans Mono-9'\n```\n\n"
    },
    {
      "title": "Support for shell aliases",
      "level": 3,
      "content": "dmenu does not support shell aliases. To have dmenu recognize your aliases, install the dmenu-recent-aliases-gitAUR package and run dmenu-recent-aliases. Your aliases must be in ~/.bash_aliases to be recognized by dmenu-recent-aliases.\n\n"
    },
    {
      "title": "Support for history",
      "level": 3,
      "content": "To sort commands by recency, download dmenu_run_history to your $PATH and use dmenu_run_history instead of dmenu_run.\n\n"
    },
    {
      "title": "Taking input using dmenu",
      "level": 3,
      "content": "Inside a script (e.g. launched from a shortcut), getting user input is sometimes required. We can use dmenu for this, by passing it an EOF: the selection field will be empty and dmenu can take user input.\n\nSince reading /dev/null will return an EOF, this can simply be done by the following command:\n\n```\n$ dmenu < /dev/null\n```\n\n"
    },
    {
      "title": "Embedding in current terminal",
      "level": 3,
      "content": "Dmenu can be embeded inside any window using the -w id option.\n\nTo embed it inside the currenctly active window (like for example the terminal it is being run from), use xdo to get its id:\n\n```\n$ echo hello | dmenu -w $(xdo id)\n```\n\n"
    },
    {
      "title": "No locale support",
      "level": 3,
      "content": "Running dmenu_run results in the following error message:\n\n```\n$ dmenu_run\n```\n\n```\nno locale support\n```\n\nMake sure that the environment variable LANG is correctly set. See the following for more information: Locale#Troubleshooting\n\n"
    },
    {
      "title": "Missing menu entries",
      "level": 3,
      "content": "If certain entries are missing from dmenu, the cache may be malformed. Delete it and restart dmenu.\n\n```\n$ rm ~/.dmenu_cache\n$ rm ~/.cache/dmenu_run\n```\n\nNote that there will most likely be only one cache file, depending on if $XDG_CACHE_HOME is set. See the contents of /usr/bin/dmenu_run for more information.\n\n"
    },
    {
      "title": "Environment variables",
      "level": 3,
      "content": "Environment variables needed for applications should instead be added to /etc/environment.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- dmenu – The official dmenu website\n- Dmenu Hacking thread – Dmenu hacking thread in Arch Linux forum. An overview of scripts is provided in the dmenu_scripts collection.\n\n"
    }
  ]
}