{
  "title": "Dmenu (Português)",
  "url": "https://wiki.archlinux.org/title/Dmenu_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- List of applications/Other#Application launchers\n\nO dmenu é um menu dinâmico rápido e leve para o X. Ele lê texto arbitrário do stdin (entrada padrão) e cria um menu com um item para cada linha. O usuário pode selecionar um item, através das teclas de seta ou digitando uma parte do nome, e a linha é impressa em stdout. dmenu_run é um wrapper enviado com a distribuição do dmenu que permite seu uso como lançador de aplicativos.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote dmenu, ou dmenu-gitAUR para a versão de desenvolvimento.\n\nExistem várias variantes corrigidas que ampliam a funcionalidade padrão do dmenu.\n\nVocê pode executar dmenu com:\n\n```\n$ dmenu_run\n```\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Agora, você desejará anexar o comando dmenu_run para uma combinação de teclas. Isso pode ser feito através do gerenciador de janelas, da configuração do ambiente de área de trabalho ou com um programa como xbindkeys. Veja o artigo Hotkeys para mais informações.\n\n"
    },
    {
      "title": "Exibindo itens personalizados",
      "level": 3,
      "content": "Os itens personalizados serão mostrados separando-os com uma nova linha (\\n) e encadear (\"|\") para dmenu. Por exemplo:\n\n```\n$ echo -e \"first\\nsecond\\nthird\" | dmenu\n```\n\n"
    },
    {
      "title": "Adicionando itens manualmente",
      "level": 3,
      "content": "O dmenu procurará executáveis nos diretórios definidos no seu $PATH. Para obter informações sobre como modificar seu $PATH veja Environment variables.\n\n"
    },
    {
      "title": "Fontes",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nO dmenu pode exibir fontes usando o X logical font description conforme encontrado usando a ferramenta xfontsel,que é fornecida por xorg-xfontsel. Este exemplo irá executar o dmenu usando o terminus-font:\n\n```\n$ dmenu_run -fn \"-xos4-terminus-medium-r-*-*-14-*\"\n```\n\nA sintaxe é semelhante se estiver usando o dmenu uma variante corrigida com suporte a XFT.\n\n```\n$ dmenu_run -fn 'Droid Sans Mono-9'\n```\n\n"
    },
    {
      "title": "Suporte para aliases do shell",
      "level": 3,
      "content": "O dmenu não tem suporte shell aliases. Para odmenu reconhecer seus aliases, instale o pacote dmenu-recent-aliases-gitAUR do AUR e execute dmenu-recent-aliases. Seus aliases devem estar em ~/.bash_aliases para ser reconhecido por dmenu-recent-aliases.\n\n"
    },
    {
      "title": "Nenhum suporte local",
      "level": 3,
      "content": "Execute dmenu_run resulta na seguinte mensagem de erro:\n\n```\n$ dmenu_run\n```\n\n```\nno locale support\n```\n\nVerifique se a variável de ambiente LANG está definida corretamente. Consulte essa página para obter mais informações: Locale: Solução de problemas\n\n"
    },
    {
      "title": "Entradas de menu ausentes",
      "level": 3,
      "content": "Se algumas entradas estiverem faltando no dmenu, o cache pode estar malformado. Exclua e reinicie dmenu.\n\n```\n$ rm ~/.dmenu_cache\n$ rm ~/.cache/dmenu_run\n```\n\nObserve que provavelmente haverá apenas um arquivo de cache, dependendo se o $XDG_CACHE_HOME está definido. Veja o conteúdo de /usr/bin/dmenu_run Para mais informações.\n\n"
    },
    {
      "title": "Variáveis de ambiente",
      "level": 3,
      "content": "As variáveis de ambiente necessárias para aplicativos devem ser adicionadas ao /etc/environment.\n\n"
    },
    {
      "title": "A janela atual perde o foco",
      "level": 3,
      "content": "O bug no dmenu 4.9, a janela atual perde o foco quando o dmenu é aberto e não recupera o foco quando é fechada. Também pode acontecer que um programa recém-lançado não ganhe foco. Você pode corrigir isso fazendo o upgrade para o dmenu 5.0. Veja essa issue ticket para uma discussão.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- dmenu – O site oficial do dmenu\n- Dmenu Hacking thread – Dmenu hacking thread no fórum Arch Linux. Uma visão geral dos scripts é fornecida no dmenu_scripts collection.\n\n"
    }
  ]
}