{
  "title": "Dmenu (Español)",
  "url": "https://wiki.archlinux.org/title/Dmenu_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-11-23** \n\nArtículos relacionados\n\n- List of applications (Español)/Other (Español)#Lanzadores de aplicaciones\n\ndmenues un lanzador de menú rápido, dinámico y ligero para X. Lee texto arbitrario desde stdin, y crea un menú con un ítem por cada linea. El usuario puede entonces seleccionar un ítem, a través de las flechas de teclado o escribiendo parte del nombre, y la linea es escrita a stdout. dmenu_run es un wrapper que viene con la distribución de dmenu que permite su uso como lanzador de aplicaciones.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete dmenu, o dmenu-gitAUR para la versión en desarrollo.\n\nExisten varias variantes parcheadas que extienden la funcionalidad por defecto de dmenu.\n\nPuede ejecutar dmenu con:\n\n```\n$ dmenu_run\n```\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Ahora, querrá anclar el comando dmenu_run a una combinación de teclas. Esto puede hacerse vía su gestor de ventanas o la configuración de su entorno de escritorio, o con un programa como xbindkeys. Vea el artículo Hotkeys para obtener más información.\n\n"
    },
    {
      "title": "Mostrar ítems personalizados",
      "level": 3,
      "content": "Los ítems personalizados serán mostrados al separarlos con una nueva linea (\\n) y direccionadolos hacia dmenu. Por ejemplo:\n\n```\n$ echo -e \"primero\\nsegundo\\ntercero\" | dmenu\n```\n\n"
    },
    {
      "title": "Añadiendo ítems manualmente",
      "level": 3,
      "content": "dmenu buscará ejecutables en los directorios definidos en su $PATH. Para información acerca de modificar su $PATH vea Variables de entorno.\n\n"
    },
    {
      "title": "Fuentes",
      "level": 3,
      "content": "dmenu puede mostrar fuentes usando XLFD como se encuentra usando la herramienta xfontsel, la cual es proveída por xorg-xfontsel. Este ejemplo ejecutará dmenu usando terminus-font:\n\n```\n$ dmenu_run -fn \"-xos4-terminus-medium-r-*-*-14-*\"\n```\n\nLa sintaxis es similar si se usa una variante de dmenu parcheada con soporte XFT.\n\n```\n$ dmenu_run -fn 'Droid Sans Mono-9'\n```\n\n"
    },
    {
      "title": "Soporte para alias de shell",
      "level": 3,
      "content": "dmenu no soporta alias de shell. Para que dmenu reconozca sus alias, instale el paquete dmenu-recent-aliases-gitAUR desde el AUR y ejecute dmenu-recent-aliases. Sus alias deben estar en ~/.bash_aliases para ser reconocidos por dmenu-recent-aliases.\n\n"
    },
    {
      "title": "Soporte para historial",
      "level": 3,
      "content": "Para ordenar los comandos por recencia, descarge dmenu_run_history a su $PATH y use dmenu_run_history en vez de dmenu_run.\n\n"
    },
    {
      "title": "No locale support",
      "level": 3,
      "content": "Ejecutando dmenu_run resulta en el siguiente mensaje de error:\n\n```\n$ dmenu_run\n```\n\n```\nno locale support\n```\n\nAsegurese de que la variable de entorno LANG esta definida correctamente. Vea lo siguiente para mas información: Locale#Troubleshooting.\n\n"
    },
    {
      "title": "Entradas del menú faltantes",
      "level": 3,
      "content": "Si ciertas entradas del menú faltan en dmenu, el cache podría estar malformado. Eliminelo y reinicie dmenu.\n\n```\n$ rm ~/.dmenu_cache\n$ rm ~/.cache/dmenu_run\n```\n\nTome en cuenta que lo mas común es que solo haya un archivo de cache, dependiendo si $XDG_CACHE_HOME esta definido. Vea los contenidos de /usr/bin/dmenu_run para mas información.\n\n"
    },
    {
      "title": "Variables de entorno",
      "level": 3,
      "content": "Las variables de entorno requeridas por las aplicaciones deberían ser agregadas a /etc/environment.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- dmenu – Sitio oficial de dmenu\n- Dmenu Hacking thread – Hilo de hackeo de dmenu en el Arch Linux forum. Un conjunto de scripts es proveído en dmenu_scripts collection.\n\n"
    }
  ]
}