{
  "title": "Dnsmasq (Español)",
  "url": "https://wiki.archlinux.org/title/Dnsmasq_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-11-06** \n\nArtículos relacionados\n\n- Domain name resolution\n\ndnsmasq proporciona un servidor DNS, un servidor DHCP con soporte para DHCPv6 y PXE, y un servidor TFTP. Está diseñado para ser liviano y consumir poco, adecuado para enrutadores y cortafuegos con recursos limitados. dnsmasq también se puede configurar para almacenar en caché las consultas a DNS con el fin mejorar las velocidades de búsqueda de DNS de los sitios visitados con anterioridad.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete dnsmasq.\n\n"
    },
    {
      "title": "Iniciar el demonio",
      "level": 2,
      "content": "Inicie/active el servicio dnsmasq.service.\n\nPara ver si dnsmasq se inició correctamente, consulte el «journal» de systemd:\n\n```\n# journalctl -u dnsmasq.service\n```\n\nLa red también deberá reiniciarse para que el cliente DHCP pueda crear un nuevo archivo /etc/resolv.conf.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Para configurar dnsmasq, necesita editar /etc/dnsmasq.conf. El archivo contiene extensos comentarios que explican sus opciones. Para todas las opciones disponibles, consulte dnsmasq(8).\n\n```\nport=0\n```\n\n```\n$ dnsmasq --test\n```\n\n"
    },
    {
      "title": "Servidor DNS",
      "level": 3,
      "content": "Para configurar dnsmasq como un demonio para el almacenamiento de DNS en un solo equipo, especifique una directiva listen-address, añadiendo la dirección IP del equipo local:\n\n```\nlisten-address=::1,127.0.0.1\n```\n\nPara utilizar este equipo con el fin de que su dirección IP de LAN escuche otros equipos en la red. Se recomienda utilizar una IP LAN estática en este caso. Por ejemplo:\n\n```\nlisten-address=::1,127.0.0.1,192.168.1.1\n```\n\nEstablezca el número de nombres de dominio almacenables en caché con la opción cache-size=size (el valor predeterminado es 150):\n\n```\ncache-size=1000\n```\n\nPara validar con DNSSEC cargue los anclajes de confianza de DNSSEC proporcionados por el paquete dnsmasq y configure la opción dnssec:\n\n```\nconf-file=/usr/share/dnsmasq/trust-anchors.conf\ndnssec\n```\n\nConsulte dnsmasq(8) para ver más opciones que quizás pueda querer usar.\n\n"
    },
    {
      "title": "Archivo de direcciones DNS y de reenvío",
      "level": 4,
      "content": "Después de configurar dnsmasq, necesita añadir las direcciones del equipo local como los únicos servidores de nombres en /etc/resolv.conf. Esto hace que todas las consultas se envíen a dnsmasq.\n\nComo dnsmasq no es un servidor DNS recursivo, debe configurar el reenvío a un servidor DNS externo. Esto se puede hacer automáticamente usando openresolv o especificando manualmente la dirección del servidor DNS en la configuración de dnsmasq.\n\nSi su administrador de red admite resolvconf, en lugar de modificar directamente /etc/resolv.conf, puede utilizar openresolv para generar archivos de configuración para dnsmasq. [1]\n\nEdite /etc/resolvconf.conf y añada las direcciones de loopback como servidores de nombres, y configure openresolv para escribir la configuración de dnsmasq:\n\n```\n/etc/resolvconf.conf\n```\n\n```\n# Utilizar el servidor de nombre local\nname_servers=\"::1 127.0.0.1\"\n\n# Escribir los archivos de configuración extendida y de resolución de dnsmasq\ndnsmasq_conf=/etc/dnsmasq-openresolv.conf\ndnsmasq_resolv=/etc/dnsmasq-resolv.conf\n```\n\nEjecute resolvconf -u para que se creen los archivos de configuración. Si los archivos no existen dnsmasq.service no podrá iniciarse.\n\nEdite el archivo de configuración de dnsmasq para usar la configuración generada de openresolv:\n\n```\n# Leer la configuración generada por openresolv\nconf-file=/etc/dnsmasq-openresolv.conf\nresolv-file=/etc/dnsmasq-resolv.conf\n```\n\nPrimero debe establecer las direcciones del servidor local como los únicos servidores de nombres en /etc/resolv.conf:\n\n```\n/etc/resolv.conf\n```\n\n```\nnameserver ::1\nnameserver 127.0.0.1\n```\n\nConsulte Domain name resolution#Overwriting of /etc/resolv.conf sobre cómo proteger el archivo /etc/resolv.conf de ser modificado.\n\nLas direcciones del servidor DNS ascendente deben especificarse en el archivo de configuración de dnsmasq como server=server_address. También añada no-resolv para que dnsmasq no lea innecesariamente /etc/resolv.conf, que solo contiene las direcciones del equipo local.\n\n```\nno-resolv\n\n# Servidores de nombres de Google, por ejemplo\nserver=8.8.8.8\nserver=8.8.4.4\n```\n\nAhora las consultas DNS se resolverán con dnsmasq, solo se verificará si los servidores externos no pueden responder a la consulta desde su caché.\n\n"
    },
    {
      "title": "Añadir un dominio personalizado",
      "level": 4,
      "content": "Es posible agregar un dominio personalizado a los equipos de nuestra red (local):\n\n```\nlocal=/lan/\ndomain=lan\n```\n\nEn este ejemplo, es posible enviar un ping a un servidor/dispositivo (por ejemplo, definido en el archivo /etc/hosts como hostname.Lan.\n\nDescomente expand-hosts para añadir el dominio personalizado a las entradas del equipo:\n\n```\nexpand-hosts\n```\n\nSin esta configuración, deberá añadir el dominio a las entradas de /etc/hosts.\n\n"
    },
    {
      "title": "Prueba",
      "level": 4,
      "content": "Para realizar una prueba de velocidad de búsqueda, elija un sitio web que no se haya visitado desde que se inició dnsmasq (drill es parte del paquete ldns):\n\n```\n$ drill archlinux.org | grep \"Query time\"\n```\n\nAl ejecutar nuevamente la orden, se usará la IP del DNS almacenada en la caché y se obtendrá un tiempo de búsqueda más rápido si dnsmasq está configurado correctamente:\n\n```\n$ drill archlinux.org | grep \"Query time\"\n```\n\n```\n;; Query time: 18 msec\n```\n\n```\n$ drill archlinux.org | grep \"Query time\"\n```\n\n```\n;; Query time: 2 msec\n```\n\nPara comprobar si la validación de DNSSEC funciona, consulte DNSSEC#Testing.\n\n"
    },
    {
      "title": "Servidor DHCP",
      "level": 3,
      "content": "De manera predeterminada, dnsmasq tiene la funcionalidad DHCP desactivada; si desea usarla, debe activarla. Aquí están las configuraciones importantes:\n\n```\n# Solo escucha la interfaz LAN de los enrutadores.\n# Al hacerlo, se abre el puerto 53 para tcp/udp (para localhost)\n# y el 67 para udp (para el resto):\ninterface=<LAN-NIC>\n\n# dnsmasq abrirá el puerto 53 tcp/udp y el puerto 67 udp (para el resto)\n# para ayudar con las interfaces dinámicas (asignación de ip dinámicas).\n# Dnsmasq descartará el resto de solicitudes,\n# aunque al sistema «paranoid» le gustaría cerrarlos\n# y dejar al kernel manejarlas:\nbind-interfaces\n\n# Opcionalmente, establecer un nombre de dominio.\ndomain=example.com\n\n# Establecer la puerta de enlace predeterminada.\ndhcp-option=3,0.0.0.0\n\n# Establecer servidores DNS para anunciar\ndhcp-option=6,0.0.0.0\n\n# Si su servidor dnsmasq también está haciendo el enrutamiento para su red,\n# puede usar la opción 121 para forzar una ruta estática.\n# x.x.x.x es la LAN de destino, yy es la notación CIDR (generalmente /24),\n# y z.z.z.z es el host que hará el enrutamiento.\ndhcp-option=121,x.x.x.x/yy,z.z.z.z\n\n# Rango dinámico de direcciones IP para poner a disposición\n# de la interfaz LAN del equipo y el tiempo de «lease».\n# Lo ideal es establecer el tiempo de «lease» en 5 m solo al principio\n# para probar que todo funciona bien antes de establecer registros más largos.\ndhcp-range=192.168.111.50,192.168.111.100,12h\n\n# Proporcionar contratos de «lease» de DHCP para IPv6 a través de Router Advertisements (RAs) para la máscara de subred aaaa:bbbb:cccc:dddd::/64\ndhcp-range=aaaa:bbbb:cccc:dddd::,ra-only,infinite\n\n# Si desea que dnsmasq asigne direcciones IP estáticas a algunos clientes,\n# vincule las interfaces LAN de los equipos.\n# Direcciones MAC:\ndhcp-host=aa:bb:cc:dd:ee:ff,192.168.111.50\ndhcp-host=aa:bb:cc:ff:dd:ee,192.168.111.51\n```\n\nConsulte dnsmasq(8) para conocer más detalles.\n\n"
    },
    {
      "title": "Prueba",
      "level": 4,
      "content": "Desde un equipo que está conectado al que tiene dnsmasq, configúrelo para utilizar DHCP para la asignación automática de direcciones IP, luego intente iniciar sesión normalmente en la red.\n\nSi inspecciona el archivo /var/lib/misc/dnsmasq.leases en el servidor, debería poder ver su asignación.\n\n"
    },
    {
      "title": "Servidor TFTP",
      "level": 3,
      "content": "dnsmasq tiene un servidor TFTP incorporado.\n\nPara utilizarlo, cree un directorio para la raíz de TFTP (por ejemplo /srv/tftp) para colocar los archivos transferibles.\n\nPara mayor seguridad, se recomienda utilizar el modo seguro TFTP de dnsmasq. En modo seguro, solo los archivos propiedad del usuario dnsmasq pasarán a través de TFTP. Necesitará hacer chown a la raís de TFTP y a todos los archivos para que pertenezcan al usuario dnsmasq a fin de que pueda usar esta característica.\n\nActive TFTP:\n\n```\nenable-tftp\ntftp-root=/srv/tftp\ntftp-secure\n```\n\nConsulte dnsmasq(8) para más opciones.\n\n"
    },
    {
      "title": "Servidor PXE",
      "level": 3,
      "content": "PXE requiere servidores DHCP y TFTP, ambas funciones pueden ser provistas por dnsmasq.\n\n```\ninterface=enp0s0\nbind-dynamic\ndhcp-range=192.168.0.1,proxy\n```\n\n1. configurar #Servidor TFTP y #Servidor DHCP;\n1. copiar y configurar un gestor de arranque compatible con PXE (por ejemplo, PXELINUX) sobre la raíz TFTP;\n1. active PXE en /etc/dnsmasq.conf:\n\n- Las rutas de archivos son relativas a la raíz TFTP\n- Si el archivo tiene un sufijo de .0, debe excluir el sufijo en las opciones de pxe-service\n\nPara enviar simplemente un archivo:\n\n```\ndhcp-boot=lpxelinux.0\n```\n\nPara enviar un archivo dependiendo de la arquitectura del cliente:\n\n```\npxe-service=x86PC, \"PXELINUX (BIOS)\", \"bios/lpxelinux\"\npxe-service=X86-64_EFI, \"PXELINUX (EFI)\", \"efi64/syslinux.efi\"\n```\n\n```\ndhcp-match=set:efi-x86_64,option:client-arch,7\ndhcp-match=set:efi-x86_64,option:client-arch,9\ndhcp-match=set:efi-x86,option:client-arch,6\ndhcp-match=set:bios,option:client-arch,0\ndhcp-boot=tag:efi-x86_64,\"efi64/syslinux.efi\"\ndhcp-boot=tag:efi-x86,\"efi32/syslinux.efi\"\ndhcp-boot=tag:bios,\"bios/lpxelinux.0\"\n```\n\nConsulte dnsmasq(8) para conocer más opciones.\n\nEl resto depende del gestor de arranque.\n\n"
    },
    {
      "title": "Impedir que OpenDNS redirija las consultas de Google",
      "level": 3,
      "content": "Para evitar que OpenDNS redirija todas las consultas de Google a su propio servidor de búsqueda, añada a /etc/dnsmasq.conf:\n\n```\nserver=/www.google.com/<ISP DNS IP>\n```\n\n"
    },
    {
      "title": "Anular direcciones",
      "level": 3,
      "content": "En algunos casos, como cuando esté operando un portal cautivo, puede ser útil resolver nombres de dominios específicos en un conjunto de direcciones codificadas. Esto se hace con la configuración address:\n\n```\naddress=/example.com/1.2.3.4\n```\n\nAdemás, es posible devolver una dirección específica para todos los nombres de dominio que no son contestados desde /etc/hosts o DHCP utilizando un comodín especial:\n\n```\naddress=/#/1.2.3.4\n```\n\n"
    },
    {
      "title": "Tener más de una instancia",
      "level": 3,
      "content": "Si queremos que dos o más servidores dnsmasq funcionen por interfaz(ces).\n\n"
    },
    {
      "title": "Estático",
      "level": 4,
      "content": "Para hacer esto de forma estática, servidor por interfaz, utilice las opciones interface y bind-interface. Esto obliga a dnsmasq a iniciarse en segundo lugar.\n\n"
    },
    {
      "title": "Dinámico",
      "level": 4,
      "content": "En este caso, podemos excluir por interfaz y enlazar cualquier otra:\n\n```\nexcept-interface=lo\nbind-dynamic\n```\n\n"
    },
    {
      "title": "Lista negra de dominios",
      "level": 3,
      "content": "Para poner en la lista negra dominios, es decir, responder consultas para ellos con NXDOMAIN, utilice la opción address sin especificar la dirección IP:\n\n```\naddress=/blacklisted.example/\naddress=/another.blacklisted.example/\n```\n\nPara facilitar su uso, coloque la lista negra en un archivo separado, por ejemplo /etc/dnsmasq.d/blacklist.conf y cárguelo desde /etc/dnsmasq.conf con conf-file=/etc/dnsmasq.d/blacklist.conf o conf-dir=conf-dir=/etc/dnsmasq.d/,*.conf.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Caching Nameserver using dnsmasq, and a few other tips and tricks.\n\n"
    }
  ]
}