{
  "title": "DNSSEC (Español)",
  "url": "https://wiki.archlinux.org/title/DNSSEC_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-11-06** \n\nArtículos relacionados\n\n- Unbound#DNSSEC validation\n\nDel artículo de Wikipedia sobre DNSSEC:\n\n"
    },
    {
      "title": "Instalación",
      "level": 3,
      "content": "La herramienta drill se puede utilizar para la validación básica de DNSSEC. Para utilizar drill, instale el paquete ldns.\n\nPara otras herramientas disponibles vea Domain name resolution#Lookup utilities.\n\n"
    },
    {
      "title": "Consulta con validación de DNSSEC",
      "level": 3,
      "content": "Luego, para consultar la validación con DNSSEC, utilice el parámetro -D:\n\n```\n$ drill -D ejemplo.com\n```\n\n"
    },
    {
      "title": "Comprobación",
      "level": 3,
      "content": "Como prueba, utilice los siguientes dominios, añadiendo el parámetro -T, que rastreará desde los servidores base hasta el dominio que se está resolviendo:\n\n```\n$ drill -DT sigfail.verteiltesysteme.net\n```\n\nEl resultado debe terminar con las siguientes líneas, lo que indica que la firma DNSSEC es falsa:\n\n```\n[B] sigfail.verteiltesysteme.net.       60      IN      A       134.91.78.139\n;; Error: Bogus DNSSEC signature\n;;[S] self sig OK; [B] bogus; [T] trusted\n```\n\nAhora, para probar una firma confiable:\n\n```\n$ drill -DT sigok.verteiltesysteme.net\n```\n\nEl resultado debe terminar con las siguientes líneas, lo que indica que la firma es de confianza:\n\n```\n[T] sigok.verteiltesysteme.net. 60      IN      A       134.91.78.139\n;;[S] self sig OK; [B] bogus; [T] trusted\n```\n\n"
    },
    {
      "title": "Instalar un servidor de resolución de validación de DNSSEC",
      "level": 2,
      "content": "Para utilizar DNSSEC en todo el sistema, puede usar un servicio de resolución que sea capaz de validar registros DNSSEC, de modo que todas las búsquedas de DNS pasen por dicho servicio de resolución. Consulte Domain name resolution#DNS servers para conocer las opciones disponibles. Tenga en cuenta que cada una requiere opciones específicas para activar su función de validación DNSSEC.\n\nSi intenta visitar un sitio con una dirección IP falsa (spoofed), el sistema de resolución de validación le impedirá recibir los datos del DNS no válidos y su navegador (u otra aplicación) recibirá el aviso de que no existe dicho servidor. Dado que todas las búsquedas de DNS pasarán por el sistema de resolución de validación, no necesitará un software que tenga compatibilidad con DNSSEC incorporada al usar esta opción.\n\n"
    },
    {
      "title": "Activar DNSSEC en un software específico",
      "level": 2,
      "content": "Si elige no #Instalar un servidor de resolución de validación de DNSSEC, necesitará utilizar un software que tenga incorporado soporte de DNSSEC para aprovechar sus funciones. A menudo, esto significa que deberá parchear el software usted mismo. Puede encontrar una lista de varias aplicaciones parcheadas aquí. Además, algunos navegadores web tienen extensiones o complementos que se pueden instalar para implementar DNSSEC sin parchear el programa.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- DNSSEC Resolver Test — prueba simple para ver si tiene DNSSEC implementado en su equipo.\n- DNSSEC-Tools\n- DNSSEC Visualizer — herramienta para visualizar el estado de una zona DNS.\n- Red Hat: Securing DNS Traffic with DNSSEC — artículo completo sobre la implementación de DNSSEC con unbound. Tenga en cuenta que algunas herramientas son específicas de Red Hat y no se encuentran en Arch Linux.\n- Wikipedia:Domain Name System Security Extensions\n\n"
    }
  ]
}