{
  "title": "DNSSEC (Português)",
  "url": "https://wiki.archlinux.org/title/DNSSEC_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Unbound#DNSSEC validation\n\nDo artigo do Wikipédia sobre o DNSSEC:\n\n"
    },
    {
      "title": "Instalação",
      "level": 3,
      "content": "A ferramenta drill pode ser usada para validação básica de DNSSEC. Para usar o drill, instale o pacote ldns.\n\nPara outras ferramentas disponíveis, veja Resolução de nome de domínio#Utilitários de pesquisa.\n\n"
    },
    {
      "title": "Consulta com validação DNSSEC",
      "level": 3,
      "content": "Então, para consultar com validação DNSSEC, use a opção -D:\n\n```\n$ drill -D exemplo.com\n```\n\n"
    },
    {
      "title": "Testando",
      "level": 3,
      "content": "Como um teste, use os seguintes domínios, adicionando a opção -T, que rastreia dos servidores raiz descendo até o domínio sendo resolvido:\n\n```\n$ drill -DT sigfail.verteiltesysteme.net\n```\n\nO resultado deve terminar com as seguintes linhas, indicando que a assinatura DNSSEC é falsa (bogus):\n\n```\n[B] sigfail.verteiltesysteme.net.       60      IN      A       134.91.78.139\n;; Error: Bogus DNSSEC signature\n;;[S] self sig OK; [B] bogus; [T] trusted\n```\n\nAgora, para testar uma assinatura confiável:\n\n```\n$ drill -DT sigok.verteiltesysteme.net\n```\n\nO resultado deve terminar com as seguintes linhas, indicando que a assinatura é confiável:\n\n```\n[T] sigok.verteiltesysteme.net. 60      IN      A       134.91.78.139\n;;[S] self sig OK; [B] bogus; [T] trusted\n```\n\n"
    },
    {
      "title": "Instalar um resolvedor de validação de DNSSEC",
      "level": 2,
      "content": "Para usar o DNSSEC em todo o sistema, você pode usar um resolvedor de DNS que seja capaz de validar registros de DNSSEC, para que todas as pesquisas de DNS passem por ele. Veja Resolução de nome de domínio#Servidores DNS para as opções disponíveis. Observe que cada um requer opções específicas para ativar seu recurso de validação do DNSSEC.\n\nSe você tentar visitar um site com um endereço IP falso (spoofed), o resolvedor de validação impedirá que você receba os dados DNS inválidos e seu navegador (ou outro aplicativo) será informado de que não existe esse host. Como todas as pesquisas de DNS passam pelo resolvedor de validação, você não precisa de um software que tenha suporte a DNSSEC integrado ao usar essa opção.\n\n"
    },
    {
      "title": "Habilitar DNSSEC em um software específico",
      "level": 2,
      "content": "Se você optar por não #Instalar um resolvedor de validação de DNSSEC, será necessário usar o software que possui suporte a DNSSEC integrado para usar seus recursos. Muitas vezes isso significa que você deve corrigir o software sozinho. Uma lista de vários aplicativos corrigidos é encontrada aqui. Além disso, alguns navegadores web têm extensões ou complementos que podem ser instalados para implementar o DNSSEC sem corrigir o programa.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- DNSSEC Resolver Test - um teste simples para ver se você tem DNSSEC implementado em sua máquina.\n- DNSSEC-Tools\n- DNSSEC Visualizer - uma ferramenta para visualizar o status de uma zona de DNS.\n- Red Hat: Securing DNS Traffic with DNSSEC - Artigo completo sobre a implementação do DNSSEC com unbound. Note que algumas ferramentas são específicas do Red Hat e não são encontradas no Arch Linux.\n- DNSSEC no Wikipedia em inglês e em português\n\n"
    }
  ]
}