{
  "title": "Doas (Русский)",
  "url": "https://wiki.archlinux.org/title/Doas_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Пользователи и группы\n- sudo (Русский)\n- Список приложений/Безопасность#Повышение привилегий\n\nOpenDoas — Linux-порт команды doas из OpenBSD, которая известна тем, что имеет значительно меньший размер по сравнению с sudo. Как и sudo, doas используется для выполнения команд от имени других пользователей.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет opendoas.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Для запуска doas от имени обычного пользователя требуется предварительная #Настройка.\n\nДля использования doas просто добавьте doas и пробел перед нужной командой:\n\n```\n$ doas команда\n```\n\nПример запуска pacman:\n\n```\n$ doas pacman -Syu\n```\n\nЗапуск интерактивной оболочки от имени другого пользователя (если не указан -u user по умолчанию root):\n\n```\n$ doas -su user\n```\n\nВход от имени другого пользователя требуется для некоторых команд, смотрите Sudo#Login shell.\n\nСмотрите doas(1) для более подробной информации.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Вместе с doas устанавливается модуль PAM, но по умолчанию для него нет конфигурации или примеров.\n\nЧтобы разрешить членам группы wheel выполнять команды от имени других пользователей, создайте файл настроек со следующим содержимым:\n\n```\n/etc/doas.conf\n```\n\n```\npermit setenv {PATH=/usr/local/bin:/usr/local/sbin:/usr/bin:/usr/sbin} :wheel\n```\n\n- В конце файла обязательно должна быть пустая строка.\n- Параметр setenv позволяет обойти issue, возникающую из-за происхождения OpenDoas BSD, где дополнительные системные пакеты хранятся в /usr/local/bin. В Linux /usr/local/bin обычно используется для переопределения исполняемых файлов, поэтому он стоит перед /usr/bin, который содержит исполняемые файлы из пакетов.\n\nВладелец и группа файла /etc/doas.conf должны быть 0, права доступа к файлу должны быть установлены на 0400:\n\n```\n# chown -c root:root /etc/doas.conf\n# chmod -c 0400 /etc/doas.conf\n```\n\nДля проверки синтаксиса файла /etc/doas.conf выполните команду:\n\n```\n# if doas -C /etc/doas.conf; then echo \"config ok\"; else echo \"config error\"; fi\n```\n\nЧтобы разрешить членам группы plugdev запускать smartctl от имени root без запроса пароля:\n\n```\n/etc/doas.conf\n```\n\n```\npermit nopass :plugdev as root cmd /usr/bin/smartctl\n```\n\nБазовый синтаксис файла /etc/doas.conf выглядит так:\n\n```\npermit|deny [опции] личность [as цель] [cmd команда [аргументы ...]]\n```\n\nПоследнее совпадающее правило определяет выполняемое действие, поэтому правила должны быть упорядочены соответствующим образом.\n\nСмотрите doas.conf(5) для более подробной информации.\n\n"
    },
    {
      "title": "Запоминание",
      "level": 3,
      "content": "doas имеет функцию запоминания: после успешной аутентификации пользователя в течение некоторого времени ему больше не будет предлагаться вводить пароль. По умолчанию она отключена, включить её можно с помощью опции persist:\n\n```\n/etc/doas.conf\n```\n\n```\npermit persist setenv {PATH=/usr/local/bin:/usr/local/sbin:/usr/bin:/usr/sbin} :wheel\n```\n\nВыполнение doas -L очищает сохраненную аутентификацию до истечения автоматического таймаута.\n\n"
    },
    {
      "title": "Плавный переход от sudo к doas",
      "level": 3,
      "content": "Для плавного перехода от sudo к doas и для сохранения совместимости можно добавить:\n\n```\nalias sudo='doas'\nalias sudoedit='doas rnano'\n```\n\nИли сделать символическую ссылку (sudoedit(8) не предоставляется):\n\n```\n# ln -s $(which doas) /usr/bin/sudo\n```\n\nДругой способ - установить doas-sudo-shimAUR, который эмулирует несколько вариантов sudo.\n\n```\n/etc/doas.conf\n```\n\n```\npermit setenv { XAUTHORITY LANG LC_ALL } :wheel\n```\n\n"
    },
    {
      "title": "Автодополнение в bash",
      "level": 3,
      "content": "По умолчанию Bash использует автодополнение по Tab только для файлов и каталогов внутри текущего или указанного каталога. Чтобы указать Bash заполнять аргументы, как если бы они были отдельными командами (также используя настройки автодополнения других команд), можно добавить следующее в пользовательский .bashrc или в общесистемный /etc/bash.bashrc:\n\n```\n~/.bashrc\n```\n\n```\ncomplete -cf doas\n```\n\nЕсли установлен bash-completion, то вместо этого можно использовать следующее, чтобы обеспечить дополнительное автодополнение для требуемой команды:\n\n```\n~/.bashrc\n```\n\n```\ncomplete -F _command doas\n```\n\n"
    }
  ]
}