{
  "title": "Dolphin (Español)",
  "url": "https://wiki.archlinux.org/title/Dolphin_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2025-02-10** \n\nArtículos relacionados\n\n- File manager functionality (Español)\n- KDE (Español)\n- udisks\n\nDolphin es el administrador de archivos por defecto de KDE. Para el emulador de vídeojuego de consola, vea Emulador Dolphin.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete dolphin.\n\nPara la versión de control y soporte de Dropbox, instale dolphin-plugins. Para habilitar el plugin pertinente vaya a Control > Configurar Dolphin... > Servicios.\n\n"
    },
    {
      "title": "Comparar archivos",
      "level": 3,
      "content": "El cuadro de diálogo Comparar archivos depende de kompare. Alternativamente, puede comparar archivos en cualquier herramienta de diferencias (como meld) seleccionando dos archivos, clic derecho, seleccione abrir con, y luego la herramienta de diferencias.\n\n"
    },
    {
      "title": "Previsualización de archivos",
      "level": 3,
      "content": "- kdegraphics-thumbnailers: Imágenes, PDFs y archivos de Blender\n- kimageformats: Archivos Gimp .xcf y archivos *.heic (con libheif)\n- qt6-imageformats: Archivos *.webp, *.tiff, *.tga, *.jp2\n- resvgAUR: Miniaturas de imágenes SVG rápidas y precisas\n- kdesdk-thumbnailers: Plugins para las miniaturas de sistema\n- ffmpegthumbs: Archivos de vídeo (Basado en ffmpeg)\n- raw-thumbnailerAUR: Archivos .raw\n- taglib : Archivos de audio\n- kde-thumbnailer-apkAUR: Paquetes de Aplicación Android\n- icoutils : Archivos *.ico y *.cur como así también iconos dentro de archivos *.exe\n\n"
    },
    {
      "title": "Un solo clic para abrir carpetas/archivos",
      "level": 3,
      "content": "Para configurar la activación de elementos con un solo clic, debe instalar y ejecutar qt6ct desde la terminal, que luego le dará la opción de habilitar 'con un solo clic' (y cambiar el tema, etc.) desde la pestaña 'Interfaz'.\n\nSi usa el motor de temas Kvantum - use Kvantum Manager > Configurar el tema activo > Miscelánea > Comportamiento de click.\n\n"
    },
    {
      "title": "Cambiar el emulador de terminal predeterminado",
      "level": 3,
      "content": "Dolphin, así como otras aplicaciones de KDE, usa konsole por defecto. Para cambiar el emulador de terminal predeterminado, ejecute kcmshell6 componentchooser y elija su emulador de terminal o escriba el comando correspondiente en el campo de selección de la ventana emergente Otro.... (La segunda opción crea nuevas desktop entries (Español) locales para cada comando añadido.)\n\nPor ejemplo, para ejecutar tmux en alacritty dentro de Dolphin, use el comando alacritty -e tmux luego de seleccionar Otro....\n\nLa configuración también se puede cambiar directamente modificando el archivo de configuración ~/.config/kdeglobals. Por ejemplo, para usar alacritty añada en la sección [General]:\n\n```\nTerminalApplication=alacritty\nTerminalService=Alacritty.desktop\n```\n\nDonde TerminalApplication es un comando y TerminalService una entrada de escritorio (TerminalService parece ser opcional). Tenga en cuenta que esto no afecta a la terminal dentro de la ventana de Dolphin (abierta con F4).\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nPara cambiar la ventana de terminal interna de Dolphin vaya a Teclado > Atajos y elija su terminal preferida. Establezca la combinación de teclas en Ctrl+Alt+T, reemplazando así el acceso directo de Konsole. Tenga en cuenta que las terminales abiertas de esta manera podrían no usar el color de fondo especificado en el archivo de configuración de la terminal, pero por lo demás deberían ser idénticas a una instancia iniciada en una ventana.\n\n"
    },
    {
      "title": "KIO slaves",
      "level": 3,
      "content": "Dolphin usa KIO slaves para acceso a la red, papelera y otras funciones, a diferencia de los administradores de archivos GTK (Español) que usan GVFS. Los protocolos disponibles se muestran en la barra de ubicación (modo editable) [1]. Para tenerlos más a mano, haga clic derecho en el espacio de trabajo y seleccione \"Añadir a lugares\".\n\nPuede instalar manualmente KIO slaves. Por ejemplo, para explorar su Google Drive en Dolphin instale kio-gdrive.\n\n"
    },
    {
      "title": "Vista CDs de audio",
      "level": 3,
      "content": "El soporte para CDs de audio es provisto por la extensión audiocd-kio.\n\n"
    },
    {
      "title": "Nombre de dispositivos mostrados como \"X GiB Harddrive\"",
      "level": 3,
      "content": "Al crear una etiqueta de sistema, o etiqueta de partición, y Dplphin mostrará ésta etiquta en la lista de dispositivos en lugar del tamaño. Vea Persistent block device naming#by-label.\n\n"
    },
    {
      "title": "Fuentes transparentes",
      "level": 3,
      "content": "Las fuentes en marcos de selección pueden llegar a ser transparentes cuando usen Estilos GTK+ Qt. Los estilos Qt nativos como Cleanlooks y Oxygen no son afectados.\n\n"
    },
    {
      "title": "Bloqueos en compartición SMB montada",
      "level": 3,
      "content": "Vea Samba#Unable to overwrite files.\n\n"
    },
    {
      "title": "Iconos sin mostrarse",
      "level": 3,
      "content": "Si los iconos no se están mostrando en Dolphin, y aparece un error similar a \"Pixmap es un Pixmap nulo\" en la consola, pruebe poniendo ésta línea en su ~/.profile\n\n```\n[ \"$XDG_CURRENT_DESKTOP\" = \"KDE\" ] || [ \"$XDG_CURRENT_DESKTOP\" = \"GNOME\" ] || export QT_QPA_PLATFORMTHEME=\"qt5ct\"\n```\n\n"
    },
    {
      "title": "Colores de fondo incompatibles en vista de carpeta",
      "level": 3,
      "content": "Cuando se ejecuta Dolphin en algo diferente de Plasma, es posible que el color de fondo en panel de la vista de carpeta no coincida con el tema Qt de sistema. Esto es debido a que Dolphin lee el color de fondo de vista de carpeta desde la sección [Colors:View] en ~/.config/kdeglobals. Cambie la siguiente línea a los valores R,G,B que prefiera:\n\n```\n~/.config/kdeglobals\n```\n\n```\n...\n[Colors:View]\nBackgroundNormal=23,24,24\n...\n```\n\nAlternativamente, use Alternatively, use kvantum para administrar sus temas Qt5. Para instrucciones de uso vea la página de inicio de proyecto Kvantum\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Wikipedia:Dolphin (file manager)\n- KDE userbase: Dolphin\n- Dolphin Handbook[enlace roto 2024-01-13]\n\n"
    }
  ]
}