{
  "title": "Dolphin (Français)",
  "url": "https://wiki.archlinux.org/title/Dolphin_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- File manager functionality\n- KDE (Français)\n- udisks\n\nDolphin est le gestionnaire de fichiers par défaut de KDE. Pour l'émulateur de console de jeux vidéo, voir Dolphin emulator.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet dolphin.\n\nPour le contrôle de version et le support de Dropbox, installez dolphin-plugins. Pour activer le plugin approprié, allez dans Configurer > Configurer Dolphin.... > Menu contextuel.\n\n"
    },
    {
      "title": "Comparer les fichiers",
      "level": 3,
      "content": "Le dialogue Comparer les fichiers dépend de kompare. Alternativement, vous pouvez comparer des fichiers dans n'importe quel outil de comparaison (tel que meld) en sélectionnant deux fichiers, en faisant un clic droit, en sélectionnant ouvrir avec, et ensuite l'outil de comparaison.\n\n"
    },
    {
      "title": "Prévisualisation des fichiers",
      "level": 3,
      "content": "- kdegraphics-thumbnailers : Fichiers images, PDFs et fichiers d'application Blender.\n- kimageformats : Fichiers .xcf de Gimp.\n- qt5-imageformats : fichiers .webp, .tiff, .tga, .jp2.\n- resvgAUR : Vignettes d'images SVG rapides et précises\n- kdesdk-thumbnailers : Plugins pour le système de vignettes\n- ffmpegthumbs : Fichiers vidéo (basés sur ffmpeg)\n- raw-thumbnailerAUR : fichiers .raw.\n- taglib : Fichiers audio\n- kde-thumbnailer-apkAUR : Fichiers Android package\n\nActivez l'affichage de l'aperçu du type de fichier requis dans Configurer > Configurer Dolphin.... > Général > Aperçus.\n\nPour activer les vignettes d'images heif/heic, modifiez /usr/share/kservices5/imagethumbnail.desktop en ajoutant image/heif; à la ligne qui commence par MimeType=.\n\nNotez que les vignettes heif/heic seront activées par défaut sur les versions de kio-extras postérieures à 21.12 (voir le lien vers ce rapport de bug pour plus d'explications).\n\n"
    },
    {
      "title": "Visualisation des CD audio",
      "level": 3,
      "content": "La prise en charge des CD audio est assurée par l'extension kio audiocd-kio.\n\n"
    },
    {
      "title": "Simple clic pour ouvrir les dossiers/fichiers",
      "level": 3,
      "content": "Pour configurer le Single-Click pour ouvrir des éléments, vous devez installer et exécuter \"qt5ct\" à partir du terminal, qui vous donnera ensuite la possibilité d'activer le Single-Click (et de changer le thème, etc.) à partir de l'onglet 'Interface'.\n\n"
    },
    {
      "title": "Ouvrir le terminal",
      "level": 3,
      "content": "Dolphin et d'autres applications KDE utilisent konsole par défaut. Pour changer l'émulateur de terminal par défaut, exécutez kcmshell5 componentchooser et sélectionnez Émulateur de terminal > Autre....\n\nSi vous préférez lancer tmux avec un émulateur de terminal dans Dolphin, tapez simplement terminalname -e tmux après avoir sélectionné Autre....\n\nCertains utilisateurs n'auront pas le module installé. Au lieu de cela, le terminal par défaut peut être changé en modifiant la configuration de kdeglobals ~/.config/kdeglobals, et en ajoutant TerminalApplication=terminalname sous l'onglet [General]. Notez, il est probable que cette méthode ne fera pas que la fenêtre interne du terminal Dolphin (ouverte avec F4) utilise le terminal spécifié dans la configuration kdeglobals.\n\n"
    },
    {
      "title": "Esclaves KIO",
      "level": 3,
      "content": "Dolphin utilise des esclaves KIO pour l'accès au réseau, la corbeille et d'autres fonctionnalités, contrairement aux gestionnaires de fichiers GTK qui utilisent GVFS. Les protocoles disponibles sont affichés dans la barre d'emplacement (mode éditable) [1][dead link 2024-01-13 ⓘ]. Pour les mettre rapidement en signet, cliquez avec le bouton droit de la souris dans l'espace de travail, et sélectionnez \"Ajouter aux emplacements\".\n\nVous pouvez installer des esclaves KIO manuellement. Par exemple, pour parcourir votre Google Drive dans Dolphin, installez kio-gdrive.\n\nDolphin offre un support étendu pour l'étiquetage des fichiers. Vous pouvez ajouter des étiquettes à un fichier en cliquant dessus avec le bouton droit de la souris et en sélectionnant \"Attribuer des étiquettes\". Vous pouvez voir les étiquettes d'un fichier dans le menu Propriétés, ou dans le panneau d'information (s'il est visible).\n\nSi Baloo est activé, Dolphin affichera également une liste de toutes les étiquettes indexées dans le panneau Lieux, et vous pouvez rechercher des fichiers par leurs étiquettes.\n\nDolphin utilise les user.xdg.tags extended attribute(en) pour stocker les étiquettes directement avec chaque fichier. Baloo indexe ces étiquettes dans sa propre base de données pour permettre une recherche rapide, et maintient une liste de toutes les étiquettes connues.\n\n"
    },
    {
      "title": "Cacher \"lost+found\" et autres fichiers/dossiers personnalisés",
      "level": 3,
      "content": "Les fichiers/dossiers ne commençant pas par . peuvent être cachés en créant le fichier .hidden avec les noms de fichiers (un par ligne).\n\n"
    },
    {
      "title": "Noms de périphériques affichés comme \"X GiB Harddrive\"",
      "level": 3,
      "content": "Créez une étiquette de système de fichiers, ou une étiquette de partition, et Dolphin affichera cette étiquette dans la liste des périphériques au lieu de la taille. Voir Persistent block device naming (Français)#by-label.\n\n"
    },
    {
      "title": "Déplacer des fichiers dans la corbeille prend du temps sur les disques externes",
      "level": 3,
      "content": "Pour déplacer des fichiers dans la corbeille, il est nécessaire que l'utilisateur ait des droits d'accès exclusifs à la corbeille. Le raisonnement est que vous ne voulez pas que les autres puissent voir ce que vous avez supprimé. Pour cela, un dossier tel que .Trash-1000 est créé sur le disque externe, avec le mode de permission 700.\n\nSi les permissions d'accès correctes ne peuvent être définies, dolphin (contrairement à GNOME) déplacera les fichiers dans la corbeille du répertoire personnel, ce qui prend du temps.\n\nPour monter les clés USB / disques durs externes, Dolphin utilise Udisks. FAT32 / EXFAT / NTFS ne supportent pas la permission de fichier UNIX, udisk les monte par défaut avec le mode 755. Pour configurer udisks afin de monter ces disques avec le mode 700, jetez un coup d'oeil au fichier /etc/udisks2/mount_options.conf.example. Copiez le fichier (le nom doit se terminer par .conf), décommentez la partie concernée et ajoutez pour les trois systèmes de fichiers aux lignes avec xyz_defaults les options fmask=177,dmask=077.\n\n(Informations de base : [2], [3])\n\n"
    },
    {
      "title": "Polices transparentes",
      "level": 3,
      "content": "Les polices dans les cadres de sélection peuvent devenir transparentes lors de l'utilisation de GTK Qt style. Les styles Qt natifs tels que Cleanlooks et Oxygen ne sont pas affectés.\n\n"
    },
    {
      "title": "Crash sur un partage SMB monté",
      "level": 3,
      "content": "Voir Samba#Unable to overwrite files.\n\n"
    },
    {
      "title": "Icônes non affichées",
      "level": 3,
      "content": "Si les icônes ne s'affichent pas dans Dolphin, installez et exécutez qt5ct, choisissez un thème d'icône dans l'onglet Thème d'icône, et Appliquez.\n\nSi les icônes ne sont toujours pas affichées dans Dolphin, définissez la variable QT_QPA_PLATFORMTHEME à qt5ct dans votre xprofile. Alternativement, démarrez Dolphin avec le paramètre du thème de la plateforme :\n\n```\n$ dolphin --platformtheme qt5ct\n```\n\nAssurez-vous également d'installer et d'hériter d'un thème d'icône de repli comme hicolor ou Adwaita lorsque vous utilisez un thème d'icône peu commun et incomplet.\n\n"
    },
    {
      "title": "Les icônes sont trop grandes",
      "level": 3,
      "content": "Si les icônes sont trop grandes sur Dolphin dans un environnement autre que KDE, démarrez-le avec :\n\n```\nXDG_CURRENT_DESKTOP=KDE KDE_SESSION_VERSION=5 QT_AUTO_SCREEN_SCALE_FACTOR=0 dolphin\n```\n\n"
    },
    {
      "title": "Couleurs d'arrière-plan de la vue des dossiers mal assorties",
      "level": 3,
      "content": "Lorsque vous exécutez Dolphin sous quelque chose d'autre que Plasma, il est possible que la couleur d'arrière-plan dans le panneau d'affichage des dossiers ne corresponde pas au thème Qt du système. C'est parce que Dolphin lit la couleur de fond de la vue dossier à partir de la section [Colors:View] dans ~/.config/kdeglobals. Changez la ligne suivante pour la valeur RVB que vous préférez (elle peut être donnée sous la forme #RRGGBB ou R,G,B) :\n\n```\n~/.config/kdeglobals\n```\n\n```\n...\n[Colors:View]\nBackgroundNormal=#2E2E2E\n...\n```\n\nSi vous obtenez une bordure bleue autour du panneau de visualisation du dossier (si vous êtes en vue fractionnée, elle sera seulement autour du panneau focalisé), vous pouvez vous en débarrasser en appliquant la feuille de style fusion-fixes.qss via l'application qt5ct. Cette réponse décrit ce qu'il faut faire pour que le thème sombre adwaita fonctionne pour dolphin sous Gnome.\n\nAlternativement, utilisez kvantum pour gérer votre thème Qt5. Pour des instructions sur l'utilisation, voir la page d'accueil du projet Kvantum.\n\n"
    },
    {
      "title": "Le profil Zsh ne se charge pas dans le terminal intégré",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nSi votre profil zsh ne se charge pas, essayez de modifier votre profil actuel. Faites un clic droit sur le terminal intégré puis Editer le profil actuel... et modifiez la commande de lancement en /bin/zsh --login.\n\n"
    },
    {
      "title": "Les applications GTK n'utilisent pas Dolphin",
      "level": 3,
      "content": "Voir Uniform look for Qt and GTK applications#Consistent file dialog under KDE Plasma.\n\n"
    },
    {
      "title": "Impossible d'installer un plugin de menu contextuel",
      "level": 3,
      "content": "Lorsque vous allez dans le menu Dolphin Configurer > Configurer Dolphin > Menu contextuel > Télécharger de nouveaux services et que vous essayez d'installer un service, vous obtenez ce message d'erreur :\n\n```\n/usr/bin/servicemenuinstaller : error while loading shared libraries : libpackagekitqt5.so.1 : cannot open shared object file : No such file or directory\n```\n\nCeci peut être résolu en installant packagekit-qt5. Puis redémarrez Dolphin.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Wikipedia:fr:Dolphin (logiciel)\n- KDE userbase : Dolphin\n- Manuel Dolphin[dead link 2024-01-13 ⓘ]\n\n"
    }
  ]
}