{
  "title": "Dolphin (Česky)",
  "url": "https://wiki.archlinux.org/title/Dolphin_(%C4%8Cesky)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- File manager functionality\n- KDE\n- udisks\n\nDolphin is the default file manager of KDE. For the video game console emulator, see Dolphin emulator.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the dolphin package.\n\n"
    },
    {
      "title": "Extensions",
      "level": 3,
      "content": "- dolphin-plugins: Adds Git, Mercurial and Dropbox support.\n- kompare: Adds the Compare files dialog. (Alternatively, select two files: {right click} > Open With > {your diff tool}.)\n- audiocd-kio: Adds audio CD support.\n- kio-gdrive: Adds Google Drive support (see #KIO slaves)\n- baloo: extends tagging support (see #File tagging)\n\n"
    },
    {
      "title": "File previews",
      "level": 3,
      "content": "- kdegraphics-thumbnailers: Image files, PDFs and Blender *.blend files\n- kimageformats: Gimp *.xcf files, *.heic files (with libheif)\n- qt6-imageformats: *.webp, *.tiff, *.tga, *.jp2 files\n- resvgAUR: Fast and accurate SVG image thumbnails\n- kdesdk-thumbnailers: Plugins for the thumbnailing system\n- ffmpegthumbs: Video files (based on ffmpeg)\n- raw-thumbnailerAUR: *.raw files\n- taglib : Audio files\n- kde-thumbnailer-apkAUR: Android package files\n- icoutils : *.ico, *.cur files and embedded *.exe icons\n- libappimage : Embedded *.AppImage icons\n\nNote: **off** \n\n"
    },
    {
      "title": "Single click to open folders/files",
      "level": 3,
      "content": "To configure Single-Click to open items, you need to install and run qt6ct from the terminal, which will then give you the option to enable Single-Click (and change the theme etc.) from the 'Interface' tab.\n\nIf you use Kvantum theme engine - use kvantum manager > Configure Active Theme > Miscellaneous > Click behavior.\n\n"
    },
    {
      "title": "Change the default terminal emulator",
      "level": 3,
      "content": "Dolphin and other KDE applications use konsole by default. To change the default terminal emulator, run kcmshell6 componentchooser and select your Terminal Emulator or write the launch command into the selection field in the Other... popup. (The second option will create a new local desktop entry for this command.)\n\nFor example, to launch tmux in alacritty inside Dolphin, type alacritty -e tmux after selecting Other....\n\nThe setting can also be directly changed by modifying the configuration file ~/.config/kdeglobals. For example, to use alacritty add in the [General] section:\n\n```\nTerminalApplication=alacritty\nTerminalService=Alacritty.desktop\n```\n\nWhere TerminalApplication takes a command and TerminalService a desktop entry (TerminalService seems to be optional). Note, that this does not influence the terminal within the dolphin window (opened with F4).\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nTo change the internal Dolphin terminal window go to Keyboard > Shortcuts and choose your preferred terminal and set the Launch shortcut to Ctrl+Alt+T, overriding Konsole's shortcut. Note that terminals opened this way might not follow the background color as specified in the terminal's configuration file, but otherwise should be identical to an instance launched in a window.\n\n"
    },
    {
      "title": "KIO slaves",
      "level": 3,
      "content": "Dolphin uses KIO slaves for network access, trash and other functionality, unlike GTK file managers which use GVFS. Available protocols are shown in the location bar (editable mode) [1]. To quickly bookmark them, right-click in the workspace, and select \"Add to Places\".\n\nYou can install KIO slaves manually. For example, to browse your Google Drive in Dolphin, install kio-gdrive.\n\n"
    },
    {
      "title": "File tagging",
      "level": 3,
      "content": "Dolphin provides extensive support for file tagging. Add tags to a file by right-clicking the file and selecting Assign Tags. Tags on a file can be viewed in the Properties menu or in the Information panel.\n\nDolphin uses the user.xdg.tags extended attribute to store tags directly along with each file. Baloo indexes these tags into its own database to allow for faster searching and maintains a list of all known tags. Activate Baloo to show a list of all indexed tags within the Places panel and make searching for files by their tags possible.\n\n"
    },
    {
      "title": "Hiding custom files/directories",
      "level": 3,
      "content": "Files/directories can be hidden by creating a .hidden file (in the same directory) that contains the names of the files/directories that should be hidden (one per line).\n\n"
    },
    {
      "title": "Creating custom service menus",
      "level": 3,
      "content": "Custom service menu entries can be added to dolphin with special *.desktop files in one of the following Paths (see [2]):\n\n- ~/.local/share/kio/servicemenus/\n- /usr/share/kio/servicemenus/\n\nNote: **must** \n\n```\ngamemode.desktop\n```\n\n```\n[Desktop Entry]\nType=Service\nMimeType=application/*;\nActions=runWithGamemode\n\n[Desktop Action runWithGamemode]\nName=Run with Gamemode\nName[de]=Mit Gamemode ausführen\nIcon=input-gaming\nExec=gamemoderun %u\n```\n\nThis adds a Run with Gamemode menu item on all application mime types.\n\n"
    },
    {
      "title": "Device names shown as \"X GiB Harddrive\"",
      "level": 3,
      "content": "Create a filesystem label, or a partition label, and Dolphin will show this label in the device list instead of the size. See Persistent block device naming#by-label.\n\n"
    },
    {
      "title": "Moving files into trash takes long on external drives",
      "level": 3,
      "content": "For moving files into the Trash, it is required that the user has exclusive access rights to the Trash. The rationale being that you do not want that others can see what you deleted. For that, a folder such as .Trash-1000/ is created on the external drive, with permission mode 700.\n\nIf the correct access permissions cannot be set, dolphin will (unlike GNOME) move the files to the trash in the home directory, which takes time.\n\nTo mount USB-Sticks / external HDDs, Dolphin uses Udisks. FAT32 / EXFAT / NTFS do not support UNIX file permission, udisk mounts them by default with mode 755. To configure udisks to mount these drives with mode 700, have a look at the file /etc/udisks2/mount_options.conf.example. Copy the file (the name should end with .conf), uncomment the relevant part and add for the three filesystems to the lines with xyz_defaults the options fmask=177,dmask=077.\n\n(Background information: [3], [4])\n\n"
    },
    {
      "title": "Transparent fonts",
      "level": 3,
      "content": "Fonts in selection frames may become transparent when using the GTK Qt style. Native Qt styles such as Cleanlooks and Oxygen are unaffected.\n\n"
    },
    {
      "title": "Crashes on mounted SMB share",
      "level": 3,
      "content": "See Samba#Unable to overwrite files.\n\n"
    },
    {
      "title": "Icons not showing",
      "level": 3,
      "content": "If icons are not displayed in Dolphin, install and run qt6ct, choose one icon theme at the Icon Theme tab, and Apply.\n\nIf icons are still not displayed in Dolphin, set the QT_QPA_PLATFORMTHEME variable to qt6ct in your xprofile. Alternatively, start Dolphin with the platform theme flag:\n\n```\n$ dolphin --platformtheme qt6ct\n```\n\nAlso make sure to install and inherit a fallback icon theme like hicolor or Adwaita when you are using an uncommon, incomplete icon theme.\n\n"
    },
    {
      "title": "Icons are too big",
      "level": 3,
      "content": "If icons are too big on Dolphin outside of a KDE environment, start it with:\n\n```\nXDG_CURRENT_DESKTOP=KDE KDE_SESSION_VERSION=6 QT_AUTO_SCREEN_SCALE_FACTOR=0 dolphin\n```\n\n"
    },
    {
      "title": "Mismatched folder view background colors",
      "level": 3,
      "content": "When running Dolphin under something other than Plasma, it is possible the background color in the folder view pane will not match the system Qt theme. This is because Dolphin reads the folder view's background color from the [Colors:View] section in ~/.config/kdeglobals. Change the following line to the RGB value you prefer (it may be given in the form #RRGGBB or R,G,B):\n\n```\n~/.config/kdeglobals\n```\n\n```\n...\n[Colors:View]\nBackgroundNormal=#2E2E2E\n...\n```\n\nIf you get a blue border around the folder view pane (if you are in split view it will only be around the focused pane), you may get rid of it by applying the fusion-fixes.qss style sheet via the qt6ct app. This answer describes what to do to get the adwaita dark theme working for dolphin under Gnome.\n\nAlternatively, use kvantum to manage your Qt6 theming. For instructions on usage see the Kvantum project homepage.\n\n"
    },
    {
      "title": "Zsh profile not loading in integrated terminal",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nIf your zsh profile is not loading, try editing your current profile. Right-click on the integrated terminal then Edit Current Profile... and edit the launch command to /bin/zsh --login\n\n"
    },
    {
      "title": "GTK applications are not using Dolphin",
      "level": 3,
      "content": "See Uniform look for Qt and GTK applications#Consistent file dialog under KDE Plasma.\n\n"
    },
    {
      "title": "Unable to install any context menu plugins",
      "level": 3,
      "content": "When you go to Dolphin menu Settings > Configure Dolphin > Context Menu > Download New Services and try to install any service, you get this error message:\n\n```\n/usr/bin/servicemenuinstaller: error while loading shared libraries: libpackagekitqt6.so.1: cannot open shared object file: No such file or directory\n```\n\nThis can be solved by installing packagekit-qt6. Then restart Dolphin.\n\n"
    },
    {
      "title": "Dolphin can't find applications (when running under another Window Manager)",
      "level": 3,
      "content": "This can be resolved by installing the archlinux-xdg-menu package and running:\n\n```\n$ XDG_MENU_PREFIX=arch- kbuildsycoca6 --noincremental\n```\n\nThis updates the KService desktop-file system configuration cache (see kbuildsycoca6(8)), which many KDE-applications rely on for selecting desktop entries. The --noincremental argument is optional. XDG_MENU_PREFIX is needed, because archlinux-xdg-menu creates a XDG Desktop Menu with an arch- prefix (see xdg-menu).\n\nThe XDG Desktop Menu files can be found in /etc/xdg/menus/*-applications.menu.\n\nNormally, kbuildsycoca6 does not need to be installed as it is part of the kservice package, which is a dependency of dolphin.\n\nNote: **not** \n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia:Dolphin (file manager)\n- KDE userbase: Dolphin\n- The Dolphin Handbook\n\n"
    }
  ]
}