{
  "title": "DOSBox (Español)",
  "url": "https://wiki.archlinux.org/title/DOSBox_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-01-05** \n\nDOSBox es un emulador de DOS para ordenadores x86 que permite ejecutar juegos o programas antiguos DOS.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete dosbox.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "No es necesaria una configuración inicial. Sin embargo, el manual oficial de DOSBox menciona un archivo de configuración llamado dosbox.conf. Por defecto, ese archivo se encuentra en su carpeta ~/.dosbox.\n\nTambién puede crear un nuevo archivo de configuración por cada aplicación copiando dosbox.conf de ~/.dosbox al directorio donde reside la aplicación de DOS y modificando la configuración en consecuencia. También puede crear un archivo de configuración automáticamente: simplemente ejecute dosbox sin ningún parámetro dentro de la carpeta de su aplicación deseada:\n\n```\n$ dosbox\n```\n\nLuego, en la pantalla DOS, escriba:\n\n```\nZ:\\> config -wc dosbox.conf\n```\n\nEl archivo de configuración dosbox.conf se guardará en el directorio actual. Realize los cambios que desee dependiendo de la configuración que necesite.\n\nLas opciones de configuración se detallan en la wiki oficial de DosBox.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Una sencilla forma de ejecutar DOSBox es colocar su juego de DOS (o sus archivos de configuración) en un directorio y luego ejecutar dosbox con la ruta del directorio adjunta. Por ejemplo:\n\n```\n$ dosbox ./nombre_carpeta/\n```\n\nAhora debería tener una pantalla DOS cuyo directorio de trabajo es el especificado anteriormente. Desde allí, puede ejecutar los programas que desee:\n\n```\nC:\\> SETUP.EXE\n```\n\n"
    },
    {
      "title": "Liberar el puntero del ratón de DOSBox",
      "level": 3,
      "content": "Si DOSBox captura el puntero de su ratón, use Ctrl+F10 para liberarlo.\n\n"
    },
    {
      "title": "Reproducir música en juegos DOS",
      "level": 3,
      "content": "Para reproducir música, algunos juegos de DOS requieren un sintetizador MIDI el cual DOSBox no emula. Sin embargo, DOSBox puede usar uno si es que hay alguno disponible. Se puede usar un sintetizador de software como FluidSynth o Timidity si su ordenador no tiene un sintetizador de hardware.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página web oficial de DOSBox\n- DOSGames.com - gran repositorio de juegos DOS.\n- Abandonia - gran repositorio de juegos antiguos y abandonados de DOS.\n\n"
    }
  ]
}