{
  "title": "Dosbox (Polski)",
  "url": "https://wiki.archlinux.org/title/Dosbox_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "DOSBox to emulator x86 PC DOS do uruchamiania starych gier lub programów DOS.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiet dosbox.\n\n"
    },
    {
      "title": "Konfiguracja",
      "level": 2,
      "content": "Nie jest potrzebna początkowa konfiguracja, jednak oficjalny podręcznik DOSBox odnosi się do pliku konfiguracyjnego o nazwie dosbox.conf. Domyślnie ten plik znajduje się w twoim folderze ~/.dosbox.\n\nMożesz także utworzyć nowy plik konfiguracyjny dla każdej aplikacji, kopiując plik dosbox.conf z ~/.dosbox do katalogu, w którym znajduje się Twoja aplikacja DOS i odpowiednio modyfikując ustawienia. Możesz także utworzyć plik konfiguracyjny automatycznie: po prostu uruchom dosbox bez żadnych parametrów w folderze żądanej aplikacji:\n\n```\n$ dosbox\n```\n\nNastępnie w wierszu poleceń DOS wpisz:\n\n```\nZ:\\> config -wc dosbox.conf\n```\n\nPlik konfiguracyjny dosbox.conf zostanie zapisany w bieżącym katalogu. Zmień dowolne ustawienia, których potrzebujesz.\n\nOpcje konfiguracji są opisane w oficjalnej wiki DOSBox.\n\n"
    },
    {
      "title": "Używanie",
      "level": 2,
      "content": "Prostym sposobem na uruchomienie DOSBox jest umieszczenie gry DOS (lub jej plików instalacyjnych) w katalogu, a następnie uruchomienie dosbox z dołączoną ścieżką katalogu. Na przykład:\n\n```\n$ dosbox ./game-folder/\n```\n\nPowinieneś teraz mieć znak zachęty DOS, którego katalog roboczy jest podany powyżej. Stamtąd możesz wykonać żądane programy:\n\n```\nC:\\> SETUP.EXE\n```\n\n"
    },
    {
      "title": "Free DOSBox focus",
      "level": 3,
      "content": "If DOSBox traps your focus, use Ctrl+F10 to free it.\n\n"
    },
    {
      "title": "Odtwarzaj muzykę w grach DOS",
      "level": 3,
      "content": "Do odtwarzania muzyki niektóre gry DOS wymagają syntezatora MIDI, którego DOSBox nie emuluje. Jednak DOSBox może go użyć, jeśli jest dostępny. Syntezator programowy, taki jak FluidSynth lub Timidity, może być używany, jeśli komputer nie jest wyposażony w syntezator sprzętowy.\n\n"
    },
    {
      "title": "Zobacz też",
      "level": 2,
      "content": "- Oficjalna strona DOSBox\n- DOSGames.com - duże repozytorium gier DOS.\n- Abandonia - duże repozytorium starych i porzuconych gier DOS.\n\n"
    }
  ]
}