{
  "title": "DOSBox (Русский)",
  "url": "https://wiki.archlinux.org/title/DOSBox_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "DOSBox — эмулятор ПК со встроенным окружением DOS, предназначенный для запуска старых DOS-игр и программ.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет dosbox.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Никакой начальной конфигурации не требуется, однако официальное руководство DOSBox ссылается на конфигурационный файл dosbox.conf. По умолчанию он находится в директории ~/.dosbox.\n\nВы можете создавать новый файл конфигурации для каждого приложения, копируя dosbox.conf из ~/.dosbox в каталог с DOS-приложением и изменяя настройки соответствующим образом. Также возможно автоматическое создание файла конфигурации — для этого запустите dosbox без параметров в директории с необходимым приложением:\n\n```\n$ dosbox\n```\n\nИ затем выполните следующую команду в командной строке DOS:\n\n```\nZ:\\> config -wc dosbox.conf\n```\n\nКонфигурационный файл dosbox.conf сохранится в текущем каталоге, где вы можете настроить необходимые параметры.\n\nВсе доступные параметры описаны на официальном вики-ресурсе DOSBox.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Поместите игру в требуемый каталог, а затем запустите dosbox с именем этого каталога:\n\n```\n$ dosbox ./game-folder/\n```\n\nТеперь у вас появится командная строка DOS с указанным выше рабочим каталогом, откуда вы можете выполнить нужные программы:\n\n```\nC:\\> SETUP.EXE\n```\n\n"
    },
    {
      "title": "Освобождение фокуса указателя",
      "level": 3,
      "content": "Если DOSBox захватил фокус указателя, нажмите Ctrl+F10, чтобы освободить его.\n\n"
    },
    {
      "title": "Воспроизведение музыки в играх",
      "level": 3,
      "content": "Для воспроизведения музыки в некоторых играх для DOS требуется MIDI-синтезатор, который DOSBox не эмулирует. Однако DOSBox может использовать существующий. Если же на вашем компьютере нет аппаратного синтезатора, воспользуйтесь программным, например, FluidSynth или Timidity.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальный веб-сайт DOSBox\n- DOSGames.com — большой репозиторий DOS-игр.\n- Abandonia — большой репозиторий старых и заброшенных DOS-игр.\n\n"
    }
  ]
}