{
  "title": "Dotpac (Русский)",
  "url": "https://wiki.archlinux.org/title/Dotpac_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "При удалении пакета pacman сохраняет его файл настроек в виде резервной копии с суффиксом .pacsave. Аналогично, при обновлении пакета pacman сохраняет новый файл настроек с суффиксом .pacnew, если его содержимое отличается от существующего файла настроек. pacman уведомляет пользователя о создании таких файлов.\n\n"
    },
    {
      "title": "Почему эти файлы создаются",
      "level": 2,
      "content": "Файл .pacnew обычно создаётся во время обновления пакета (pacman -Syu, pacman -Su или pacman -U) во избежание перезаписи существующего файла, в который пользователь внёс изменения. Следующее сообщение в выводе pacman говорит от создании такого файла:\n\n```\nwarning: /etc/pam.d/usermod installed as /etc/pam.d/usermod.pacnew\n```\n\nФайл .pacsave создаётся во время удаления (pacman -R) или обновления (когда необходимо сперва удалить предыдущую версию) пакета. Если в базе данных pacman имеется запись о создании резервной копии какого-либо файла, то создаётся файл .pacsave. В этом случае pacman выводит следующее сообщение:\n\n```\nwarning: /etc/pam.d/usermod saved as /etc/pam.d/usermod.pacsave\n```\n\nФайлы .pacnew и .pacsave лучше всего обрабатывать вручную сразу после обновлений или удаления пакетов. Наличие в системе неправильных файлов настроек может привести к ошибкам в работе программ или даже к полной невозможности их запуска.\n\n"
    },
    {
      "title": "Резервные копии файлов пакета",
      "level": 2,
      "content": "Файлы, для которых необходимо создавать резервные копии при удалении или обновлении, перечисляются в файле PKGBUILD пакета. Например, PKGBUILD пакета pulseaudio содержит следующую строку:\n\n```\nbackup=(etc/pulse/{daemon.conf,default.pa,system.pa})\n```\n\nПосле установки пакета список таких файлов можно получить из базы данных командой pacman -Qii пакет.\n\nАльтернативный способ предотвращения перезаписи файлов при обновлении пакетов описан в статье pacman#Запрет на обновление файлов.\n\n"
    },
    {
      "title": ".pacnew",
      "level": 3,
      "content": "Для каждого указанного в параметре backup файла обновляемого пакета pacman сравнивает контрольные суммы MD5 оригинальной версии файла, текущей, а также той, что должна быть установлена при обновлении. Если текущий файл в файловой системе был изменен и не соответствует оригинальной версии, pacman не может определить, как правильно объединить все изменения с новой версией файла. По этой причине он сохраняет новую версию с расширением .pacnew и оставляет измененную версию нетронутой.\n\nВарианты сравнения контрольных сумм MD5:\n\n"
    },
    {
      "title": ".pacsave",
      "level": 3,
      "content": "Если при удалении пакета обнаруживается, что оригинальная версия backup-файла была изменена пользователем, то файл сохраняется с суффиксом .pacsave и остаётся в файловой системе.\n\n"
    },
    {
      "title": "Поиск файлов .pac*",
      "level": 2,
      "content": "Pacman не имеет функциональности для работы с файлами .pacnew, поэтому их необходимо обрабатывать вручную, как описано в следующем разделе. Перед этим необходимо определить местонахождение этих файлов. При обновлении или удалении большого количества пакетов файлы .pac* можно пропустить или не заметить. Найти все файлы .pac* можно одним из следующих способов:\n\n- Поиск по каталогу /etc, в котором хранится большинство глобальных конфигурационных файлов: $ find /etc -regextype posix-extended -regex \".+\\.pac(new|save)\" 2> /dev/null Замените /etc на /, чтобы выполнить поиск по всему диску. Для ускорения процесса можно выборочно исключить некоторые каталоги.\n- Используйте утилиту locate, если она установлена. Сначала обновите базу данных: # updatedb Затем: $ locate --existing --regex \"\\.pac(new|save)$\"\n- Используйте лог pacman: $ grep --extended-regexp \"pac(new|save)\" /var/log/pacman.log Обратите внимание, что в логе не содержится информации о том, какие файлы в настоящий момент находятся в системе, а какие уже удалены. Команда выведет список всех файлов .pac*, которые когда-либо существовали в системе. Чтобы ограничить вывод последними десятью файлами, перенаправьте его в утилиту tail.\n\n```\n$ find /etc -regextype posix-extended -regex \".+\\.pac(new|save)\" 2> /dev/null\n```\n\n```\n# updatedb\n```\n\n```\n$ locate --existing --regex \"\\.pac(new|save)$\"\n```\n\n```\n$ grep --extended-regexp \"pac(new|save)\" /var/log/pacman.log\n```\n\n"
    },
    {
      "title": "pacdiff",
      "level": 3,
      "content": "Утилита pacdiff из пакета pacman-contrib выполняет поиск файлов .pacnew и .pacsave, после чего предлагает выбор из применимых к ним действиям. По умолчанию использует vimdiff, другой редактор можно задать в переменной окружения DIFFPROG=ваш_редактор pacdiff. Список утилит для сравнения файлов можно найти в статье List of applications/Utilities#Comparison, diff, merge.\n\n"
    },
    {
      "title": "Сторонние утилиты",
      "level": 3,
      "content": "В AUR можно найти несколько программ от сторонних разработчиков, предлагающий различный уровень автоматизации при работе с файлами .pac*:\n\n- dotpac — простой интерактивный скрипт с текстовым интерфейсом на основе ncurses. Не имеет возможностей ручного или автоматического объединения.\n\n- etc-update — порт утилиты etc-update из Gentoo, предоставляющей простой интерфейс командной строки для интерактивного редактирования, просмотра и объединения изменений, в том числе автоматического (для незначительных изменений, например, комментариев).\n\n- p3wm — трёхвариантное объединение файлов .pacnew. Может автоматически объединять простые изменения. При возникновении конфликта использует vimdiff, meld или kdiff3.\n\n- pacnews-git — простой скрипт, нацеленный на поиск всех файлов .pacnew и их последующее редактирование при помощи vimdiff\n\n- pacfiles-mode — расширение Emacs для работы с файлами .pacnew, доступен на странице melpa.\n\n- pacdiff-pacman-hook-git — хук pacman для автоматического запуска pacdiff.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Форум Arch Linux: Работа с файлами .pacnew\n\n"
    }
  ]
}