{
  "title": "Downgrade (Português)",
  "url": "https://wiki.archlinux.org/title/Downgrade_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Arch Build System\n- makepkg\n- pacman\n- Arch Linux Archive\n\nAntes de fazer o downgrade de um ou mais pacotes, considere o porquê de você desejar fazê-lo. Se é por causa de um erro, pesquise no rastreador de erros por tarefas existentes. Se não houver, adicione uma nova tarefa; é melhor corrigir erros, ou pelo menos avisar outros usuários sobre possíveis problemas.\n\n- Fazer downgrade de um pacote pode exigir que se faça downgrade de suas dependências também. Quando o número dos pacotes para se fazer downgrade é grande demais, considere usar um snapshot. Veja Arch Linux Archive (Português)#Como restaurar todos os pacotes para uma data específica.\n- Tenha cuidado com alterações a arquivos de configuração e scritps. Por agora, pacman pode tratar disso, desde que nós não ignoremos as travas de segurança.\n- Se fazer um downgrade involve uma alteração de soname, todas as dependências podem precisar de downgrade ou recompilação também.\n\n"
    },
    {
      "title": "Usando o cache do pacman",
      "level": 3,
      "content": "Se um pacote foi instalado em um estágio anterior, e o cache do pacman não foi limpado, instale uma versão anterior do /var/cache/pacman/pkg/.\n\nEsse processo vai remover o pacote atual e instalar a versão anterior. Alteração nas dependências será tratada, mas o pacman não tratará de conflitos de versão. Se uma biblioteca ou outro pacote precisar de um downgrade com os pacotes, por favor esteja ciente de que você mesmo terá que fazer downgrade deste pacote também.\n\n```\n# pacman -U file:///var/cache/pacman/pkg/pacote-versão_antiga.pkg.tar.tipo\n```\n\nObserve que tipo será xz para compilações de pacotes antigas e zst para aquelas seguindo a alteração de 2020.\n\nUma vez o pacote seja revertido, adicione-o temporariamente para a seção IgnorePkg do pacman.conf, até a dificuldade com o pacote atualizado ser resolvida.\n\n"
    },
    {
      "title": "Fazendo downgrade do kernel",
      "level": 3,
      "content": "Em caso de problema com um novo kernel, é possível fazer downgrade dos pacotes de Linux para as últimas que estejam funcionando #Usando o cache do pacman. Vá para o diretório /var/cache/pacman/pkg e faça downgrade de pelo menos linux, linux-headers e qualquer módulo do kernel. Por exemplo:\n\n```\n# pacman -U file://linux-4.15.8-1-x86_64.pkg.tar.xz file://linux-headers-4.15.8-1-x86_64.pkg.tar.xz file://virtualbox-host-modules-arch-5.2.8-4-x86_64.pkg.tar.xz\n```\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Arch Linux Archive",
      "level": 3,
      "content": "O Arch Linux Archive é um snapshot diário dos repositórios oficiais. Ele pode ser usado para instalar uma versão anterior de um pacote ou restaurar o sistema para uma data anterior.\n\n"
    },
    {
      "title": "Recompilar o pacote",
      "level": 3,
      "content": "Se o pacote está indisponível, localize o PKGBUILD correto e recompile-o com makepkg.\n\nPara pacotes dos repositórios oficiais, obtenha o PKGBUILD com ABS e altere a versão do software. Alternativamente, localize o pacote no site de pacotes, clique \"View Changes\" e navegue na versão desejada. Os arquivos necessários pode ser baixados do diretório de forma que o pacote pode ser recompilado.\n\nVeja também Arch build system (Português)#Usando a ferramenta pkgctl.\n\nPacotes antigos do AUR podem ser compilados fazendo checkout de um commit antigo no repositório Git do pacote do AUR. Para PKGBUILDs do AUR pré-2015, veja Arch User Repository (Português)#Repositórios Git para pacotes AUR3.\n\n"
    },
    {
      "title": "Automação",
      "level": 3,
      "content": "- downgrade — Um script Bash para fazer downgrade de um ou vários pacotes, usando o cache do pacman ou o Arch Rollback Machine. Veja downgrade(8) para detalhes.\n\n"
    },
    {
      "title": "Retornar do [testing]",
      "level": 2,
      "content": "Veja Repositórios oficiais#Desabilitando repositórios de teste.\n\n"
    }
  ]
}