{
  "title": "Downgrading packages (Español)",
  "url": "https://wiki.archlinux.org/title/Downgrading_packages_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-07-20** \n\nArtículos relacionados\n\n- Arch Build System\n- pacman\n- Arch Linux Archive\n\nAntes de desactualizar uno o varios paquetes, considere por qué desea hacerlo. Si se debe a un error, busque en rastreador de errores las tareas existentes. Si no hay ninguna, agregue un nueva tarea; es mejor corregir los errores, o al menos advertir a otros usuarios de posibles problemas.\n\n- La desactualización de un paquete puede requerir que sus dependencias también sean desactualizadas. Cuando el número de paquetes a desactualizar es grande, considere usar una instantánea. Ver Cómo restaurar todos los paquetes a una fecha específica..\n- Tenga cuidado con los cambios en los archivos de configuración y scripts. Por ahora, pacman se encargará de esto por nosotros, siempre y cuando no eludamos sus medidas de seguridad.\n- Si la desactualización implica un cambio de nombre, toda dependencia puede necesitar ser desactualizada o también reconstruida .\n\n"
    },
    {
      "title": "Usando la caché de pacman",
      "level": 3,
      "content": "Si un paquete se instaló anteriormente, y la caché de pacman no se ha limpiado, instale una versión anterior de /var/cache/pacman/pkg/.\n\nEste proceso eliminará el paquete actual e instalará la versión anterior. Los cambios de dependencia serán gestionados, pero pacman no gestionará conflictos de versión. Si una librería u otro paquete necesita ser desactualizado con los paquetes, por favor tenga en cuenta que usted también tendrá que desactualizarlo.\n\n```\n# pacman -U /var/cache/pacman/pkg/package-old_version.pkg.tar.xz\n```\n\nUna vez revertido el paquete, añádalo temporalmente al archivo IgnorePkg section de pacman.conf, hasta que se resuelva el problema con el paquete actualizado.\n\n"
    },
    {
      "title": "Desactualizando el kernel",
      "level": 3,
      "content": "En caso de problemas con un nuevo kernel, los paquetes de Linux pueden ser desactualizados a los últimos que funcionen #Usando la caché de pacman. Vaya al directorio /var/cache/pacman/pkg y desactualice al menos linux, linux-headers y cualquier módulo del núcleo. Por ejemplo:\n\n```\n# pacman -U linux-4.15.8-1-x86_64.pkg.tar.xz linux-headers-4.15.8-1-x86_64.pkg.tar.xz virtualbox-host-modules-arch-5.2.8-4-x86_64.pkg.tar.xz\n```\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Archivo Arch Linux",
      "level": 3,
      "content": "El Arch Linux Archive es una instantánea diaria de los repositorios oficiales. Puede usarse para instalar una versión anterior de un paquete, o restaurar el sistema a una fecha anterior.\n\n"
    },
    {
      "title": "Reconstrucción del paquete",
      "level": 3,
      "content": "Si el paquete no está disponible, busque el PKGBUILD correcto y reconstrúyalo con makepkg.\n\nPara los paquetes de los repositorios oficiales, recupere el PKGBUILD con ABS y cambie la versión del software. Alternativamente, busque el paquete en el sitio web Paquetes, haga clic en \"Ver cambios\" y navegue hasta la versión deseada. Los archivos están disponibles a través de una instantánea .tar.gz y a través de la vista Árbol.\n\nConsulte también Descargar una versión anterior de un paquete.\n\nLos paquetes antiguos de AUR pueden construirse revisando un compromiso antiguo en el repositorio de GIT del paquete AUR. Para los PKGBUILD anteriores a 2015 AUR3 PKGBUILDs, consulte los Arch User Repository#Git repositories for AUR3 packages.\n\n"
    },
    {
      "title": "Automatización",
      "level": 3,
      "content": "- downgrade — Un script Bash para desactualizar uno (o varios) paquetes, utilizando el caché pacman o el Arch Linux Archive. Vea downgrade(8) para más detalles.\n\n"
    },
    {
      "title": "Volver de [testing]",
      "level": 2,
      "content": "Ver Official repositories#Disabling testing repositories.\n\n"
    }
  ]
}