{
  "title": "Drupal (Italiano)",
  "url": "https://wiki.archlinux.org/title/Drupal_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "\"Drupal è una piattaforma software di Content Management System (CMS), modulare, scritta in linguaggio PHP e distribuita sotto licenza GNU GPL, ovvero un programma che girando lato server permette la creazione e distribuzione di complessi siti web dinamici.\" - Wikipedia\n\nQuesto documento descrive come impostare Drupal e configurare Apache, MySQL o PostgreSQL, PHP, e Postfix. Questo documento presuppone che si abbiano server già impostati quali LAMP(Linux, Apache, MySQL, PHP), LAPP(Linux, Apache, PostgreSQL, PHP) o LASP(Linux, Apache, SQLite, PHP).\n\n"
    },
    {
      "title": "Installazione",
      "level": 2,
      "content": "Installare il pacchetto drupal.\n\n"
    },
    {
      "title": "PHP",
      "level": 3,
      "content": "Modificare il file /etc/php/php.ini:\n\n- Per abilitare il supporto alla manipolazione di immagini decommentare la riga extension=gd\n\nPer il supporto di un database abilitare un' estensione PDO per quel database:\n\n- Per abilitare il supporto di SQLite decommentare la riga extension=pdo_sqlite\n- Per abilitare il supporto di MySQL decommentare la riga extension=pdo_mysql\n- Per abilitare il supporto di PostgreSQL decommentare la riga extension=pdo_pgsql\n\nNel caso in cui l'avvio di Apache fallisca con un errore nel trovare php_admin_value, seguire queste istruzioni:\n\nInstallare il pacchetto php-apache .\n\nNel file /etc/httpd/conf/httpd.conf commentare la riga:\n\n```\n#LoadModule mpm_event_module modules/mod_mpm_event.so\n```\n\ne decommentare la riga:\n\n```\nLoadModule mpm_prefork_module modules/mod_mpm_prefork.so\n```\n\nAlla fine della lista LoadModule, aggiungere:\n\n```\nLoadModule php7_module modules/libphp7.so\nAddHandler php7-script .php\n```\n\nAlla fine della lista Include, aggiungere:\n\n```\nInclude conf/extra/php7_module.conf\n```\n\nRiavviare httpd.service con systemd.\n\nNel caso in cui l'avvio di Apache fallisca con un errore nel trovare open_basedir, seguire queste istruzioni:\n\nNel file /etc/php/php.ini, decommentare e completare la riga open_basedir:\n\n```\nopen_basedir = /etc/webapps\n```\n\n"
    },
    {
      "title": "Apache",
      "level": 3,
      "content": "Copiare il file di esempio di configurazione Apache:\n\n```\n# cp /etc/webapps/drupal/apache.example.conf /etc/httpd/conf/extra/drupal.conf\n```\n\nEd includerlo in fondo al file /etc/httpd/conf/httpd.conf:\n\n```\nInclude conf/extra/drupal.conf\n```\n\nNel file /etc/httpd/conf/httpd.conf, decommentare anche la riga LoadModule rewrite_module modules/mod_rewrite.so.\n\n"
    },
    {
      "title": "Drupal",
      "level": 3,
      "content": "Modificare il file /usr/share/webapps/drupal/.htaccess e sostituire Require all denied con Require all granted.\n\nInfine, riavviare Apache (httpd.service). È ora possibile accedere all'installazione di Drupal: http://localhost/drupal .\n\n"
    },
    {
      "title": "Drush",
      "level": 3,
      "content": "Drush è un' interfaccia a riga di comando e di scripting Unix per Drupal. Drush è provvisto di diversi comandi utili per interagire con codice come moduli/temi/profili. Inoltre, esegue update.php, query di sql, migrazioni di DataBase e utilità varie, come la pulizia della cache. Drush può essere integrato con CommandFile di terze parti. Può essere installato tramite il pacchetto drushAUR[broken link: package not found] .\n\n"
    },
    {
      "title": "Drupalconsole",
      "level": 3,
      "content": "Drupalconsole è uno strumento da riga di comando per generare codice boilerplate, interagire con Drupal 8 e per il debug. Può essere installato con il pacchetto drupalconsoleAUR\n\n"
    },
    {
      "title": "PHP-Codesniffer-Drupal",
      "level": 3,
      "content": "PHP-Codesniffer-Drupal controlla il codice Drupal rispetto agli standard di codifica. Può essere installato con il pacchetto php-codesniffer-drupalAUR.\n\n"
    },
    {
      "title": "Invio di Mail",
      "level": 3,
      "content": "Drupal necessita di MTA compatibili con Sendmail, come Sendmail, Postfix o Exim se si ha intenzione di mandare mail da locale. In alternativa ci sono diverse soluzioni per inviare mail tramite server esterni attraverso SMTP o altri mezzi, come SMTP o PHPMailer. Usare la pagina di ricerca per trovare altre alternative.\n\n"
    },
    {
      "title": "Programmazione con Cron",
      "level": 3,
      "content": "Drupal consiglia di far avviare l'esecuzione dei compiti di Cron ogni ora. Cron può essere eseguito dal browser visitando http://localhost/drupal/cron . È anche possibile eseguire cron tramite script copiando il il file apposito dalla cartelletta \"scripts\" in /etc/cron.hourly e rendendolo eseguibile.\n\n"
    },
    {
      "title": "Avanzamento del caricamento non abilitato",
      "level": 3,
      "content": "Ad installazione effettuata, è possibile ricevere il seguente messaggio nello Status Report:\n\n```\nYour server is capable of displaying file upload progress, but does not have the required libraries. It is recommended to install the PECL uploadprogress library (preferred) or to install APC.\n```\n\nPer prima cosa, installare il pacchetto php-pearAUR . In seguito, usare il comando pecl per scaricare, compilare ed installare la libreria in automatico:\n\n```\n# pecl install uploadprogress\n```\n\nInfine, aggiungere al file /etc/php/php.ini:\n\n```\nextension=uploadprogress\n```\n\nRiavviare Apache.\n\n"
    },
    {
      "title": "Vedi anche",
      "level": 2,
      "content": "- Documentazione Ufficiale di Drupal[link interrotto 2025-04-05]\n- Semplice guida per l'installazione di Drupal su Xampp[link interrotto 2025-04-05]\n\n"
    }
  ]
}