{
  "title": "Drupal (Español)",
  "url": "https://wiki.archlinux.org/title/Drupal_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-01-02** \n\nArtículos relacionados\n\n- LAMP\n- LAPP\n- LASP\n- MySQL\n- PostgreSQL\n- SQLite\n- Sendmail\n- Postfix\n- Exim\n\nDe Wikipedia:\n\nEste artículo describe cómo configurar Drupal y Apache, MySQL o PostgreSQL, PHP y Postfix para trabajar con él. Se da por hecho que tiene algún tipo de servidor LAMP (Linux, Apache, MySQL, PHP), LAPP (Linux, Apache, PostgreSQL, PHP) o LASP (Linux, Apache, SQLite, PHP) ya configurado.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete drupal.\n\n"
    },
    {
      "title": "PHP",
      "level": 3,
      "content": "Edite /etc/php/php.ini:\n\n- Para habilitar el soporte para la manipulación de imágenes, descomente la línea extension=gd\n\nPara el soporte de bases de datos, habilite una extensión PDO para su base de datos\n\n- Para habilitar el soporte para SQLite, descomente la línea extension=pdo_sqlite\n- Para habilitar el soporte para MySQL, descomente la línea extension=pdo_mysql\n- Para habilitar el soporte para PostgreSQL, descomente la línea extension=pdo_pgsql\n\nApache fallará al intentar iniciarse y mostrará un error al encontrar php_admin_value. A continuación se detalla la solución a este problema:\n\nInstale el paquete php-apache.\n\nEn /etc/httpd/conf/httpd.conf, comente la línea:\n\n```\n#LoadModule mpm_event_module modules/mod_mpm_event.so\n```\n\ny descomente la línea:\n\n```\nLoadModule mpm_prefork_module modules/mod_mpm_prefork.so\n```\n\nColoque esto al final de la lista LoadModule:\n\n```\nLoadModule php7_module modules/libphp7.so\nAddHandler php7-script .php\n```\n\nColoque esto al final de la lista Include:\n\n```\nInclude conf/extra/php7_module.conf\n```\n\nReinicie httpd.service usando systemd.\n\nApache fallará al intentar iniciarse y mostrará un error al encontrar open_basedir. A continuación se detalla la solución a este problema:\n\nEn /etc/php/php.ini, descomente y añada el sufijo open_basedir para que tenga este aspecto:\n\n```\nopen_basedir = /etc/webapps\n```\n\n"
    },
    {
      "title": "Apache",
      "level": 3,
      "content": "Copie el ejemplo del archivo de configuración de Apache:\n\n```\n# cp /etc/webapps/drupal/apache.example.conf /etc/httpd/conf/extra/drupal.conf\n```\n\nE inclúyalo en la parte inferior de /etc/httpd/conf/httpd.conf:\n\n```\nInclude conf/extra/drupal.conf\n```\n\nEn /etc/httpd/conf/httpd.conf, descomente también la línea LoadModule rewrite_module modules/mod_rewrite.so.\n\n"
    },
    {
      "title": "Drupal",
      "level": 3,
      "content": "Edite /usr/share/webapps/drupal/.htaccess y reemplace Require all denied por Require all granted.\n\nFinalmente, reinicie Apache (httpd.service). Ahora puede acceder a la instalación de Drupal en http://localhost/drupal .\n\n"
    },
    {
      "title": "Drush",
      "level": 3,
      "content": "Drush es un shell de línea de comandos y una interfaz de scripting Unix para Drupal. El núcleo Drush se suministra con una gran cantidad de comandos útiles para interactuar con el código, como módulos/temas/perfiles. Del mismo modo, ejecuta update.php, ejecuta consultas de sql y migraciones de base de datos, y otras utilidades como ejecutar Cron o borrar la caché. Drush se puede ampliar por archivos de comandos de terceros. Se puede instalar con el paquete drushAUR[enlace roto: package not found].\n\n"
    },
    {
      "title": "Drupalconsole",
      "level": 3,
      "content": "Drupalconsole es una herramienta CLI para generar código cliché, interactuar y depurar Drupal 8. Se puede instalar con el paquete drupalconsoleAUR.\n\n"
    },
    {
      "title": "PHP-Codesniffer-Drupal",
      "level": 3,
      "content": "PHP-Codesniffer-Drupal revisa su código Drupal contra los estándares de codificación y otras mejores prácticas. Se puede instalar con el paquete php-codesniffer-drupalAUR.\n\n"
    },
    {
      "title": "Enviar correos",
      "level": 3,
      "content": "Drupal necesita un MTA compatible con Sendmail como por ejemplo Sendmail, Postfix o Exim si planea enviar correos desde su configuración local. Alternativamente, existen múltiples soluciones para enviar correos mediante servidores de correo externos a través de SMTP u otros medios como SMTP o PHPMailer. Utilice la página de búsqueda para encontrar más posibilidades.\n\n"
    },
    {
      "title": "Programación con Cron",
      "level": 3,
      "content": "Drupal recomienda ejecutar los trabajos Cron a cada hora. Cron puede ejecutarse desde el navegador web visitando http://localhost/drupal/cron. También es posible ejecutar Cron a través de un script copiando el archivo apropiado de la carpeta \"scripts\" a /etc/cron.hourly y haciéndolo ejecutable.\n\n"
    },
    {
      "title": "El progreso de la subida no está habilitado",
      "level": 3,
      "content": "Tras una correcta instalación, podría ver el siguiente mensaje en el informe de estado:\n\n```\nYour server is capable of displaying file upload progress, but does not have the required libraries. It is recommended to install the PECL uploadprogress library (preferred) or to install APC.\n```\n\nPrimero, instale el paquete php-pearAUR. A continuación, utilize la orden pecl para descargar, compilar e instalar automáticamente la librería:\n\n```\n# pecl install uploadprogress\n```\n\nFinalmente, agregue lo siguiente a /etc/php/php.ini\n\n```\nextension=uploadprogress\n```\n\nReinicie Apache.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Documentación oficial de Drupal[enlace roto 2025-04-05]\n- Guía simple para instalar Drupal en Xampp[enlace roto 2025-04-05]\n\n"
    }
  ]
}