{
  "title": "Drupal (Српски)",
  "url": "https://wiki.archlinux.org/title/Drupal_(%D0%A1%D1%80%D0%BF%D1%81%D0%BA%D0%B8)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- LAMP\n- LAPP\n- LASP\n- MySQL\n- PostgreSQL\n- SQLite\n- Sendmail\n- PostFix\n- Exim\n\n\"Drupal is a free and open source content management system (CMS) and Content Management framework (CMF) written in PHP and distributed under the GNU General Public License.\" - Wikipedia\n\nThis article describes how to setup Drupal and configure Apache HTTP Server, MySQL or PostgreSQL, PHP, and Postfix to work with it. It is assumed that you have some sort of LAMP (Linux, Apache, MySQL, PHP), LAPP (Linux, Apache, PostgreSQL, PHP) or LASP (Linux, Apache, SQLite, PHP) server already setup.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the drupal package.\n\n"
    },
    {
      "title": "PHP",
      "level": 3,
      "content": "Edit /etc/php/php.ini:\n\n- To enable support for image manipulation uncomment the line extension=gd\n\nFor database support enable a PDO extension for your database\n\n- To enable support for SQLite uncomment the line extension=pdo_sqlite\n- To enable support for MySQL uncomment the line extension=pdo_mysql\n- To enable support for PostgreSQL uncomment the line extension=pdo_pgsql\n\nApache will fail to start with an error finding php_admin_value, below fixes this:\n\nInstall the php-apache package.\n\nIn /etc/httpd/conf/httpd.conf, comment the line:\n\n```\n#LoadModule mpm_event_module modules/mod_mpm_event.so\n```\n\nand uncomment the line:\n\n```\nLoadModule mpm_prefork_module modules/mod_mpm_prefork.so\n```\n\nPlace this at the end of the LoadModule list:\n\n```\nLoadModule php7_module modules/libphp7.so\nAddHandler php7-script .php\n```\n\nPlace this at the end of the Include list:\n\n```\nInclude conf/extra/php7_module.conf\n```\n\nRestart httpd.service using systemd.\n\nApache will fail to start with an error finding open_basedir, below fixes this:\n\nIn /etc/php/php.ini, uncomment and suffix open_basedir to look like this:\n\n```\nopen_basedir = /etc/webapps\n```\n\n"
    },
    {
      "title": "Apache",
      "level": 3,
      "content": "Copy the example Apache configuration file:\n\n```\n# cp /etc/webapps/drupal/apache.example.conf /etc/httpd/conf/extra/drupal.conf\n```\n\nAnd include it at the bottom of /etc/httpd/conf/httpd.conf:\n\n```\nInclude conf/extra/drupal.conf\n```\n\nIn /etc/httpd/conf/httpd.conf, also uncomment the LoadModule rewrite_module modules/mod_rewrite.so line.\n\n"
    },
    {
      "title": "Drupal",
      "level": 3,
      "content": "Edit /usr/share/webapps/drupal/.htaccess and replace Require all denied by Require all granted.\n\nFinally, restart Apache (httpd.service). You can now access the Drupal installation at http://localhost/drupal .\n\n"
    },
    {
      "title": "Drush",
      "level": 3,
      "content": "Drush is a command line shell and Unix scripting interface for Drupal. Drush core ships with lots of useful commands for interacting with code like modules/themes/profiles. Similarly, it runs update.php, executes sql queries and DB migrations, and misc utilities like run cron or clear cache. Drush can be extended by 3rd party commandfiles. It can be installed with the drush-launcherAUR package.\n\n"
    },
    {
      "title": "Drupalconsole",
      "level": 3,
      "content": "Drupalconsole is a CLI tool to generate boilerplate code, interact and debug Drupal 8. It can be installed with the drupalconsoleAUR package.\n\n"
    },
    {
      "title": "PHP-Codesniffer-Drupal",
      "level": 3,
      "content": "PHP-Codesniffer-Drupal checks your Drupal code against coding standards and other best practices. It can be installed with the php-codesniffer-drupalAUR package.\n\n"
    },
    {
      "title": "Sending Mail",
      "level": 3,
      "content": "Drupal needs a Sendmail-compatible MTA like Sendmail, Postfix or Exim if you plan to send mail from your local setup. Alternatively there are multiple solutions to send mail via external mail servers through SMTP or other means like SMTP or PHPMailer. Use the search page to find more possibilities.\n\n"
    },
    {
      "title": "Scheduling with Cron",
      "level": 3,
      "content": "Drupal recommends running cron jobs hourly. Cron can be executed from the browser by visiting http://localhost/drupal/cron. It is also possible to run cron via script by copying the appropriate file from the \"scripts\" folder into /etc/cron.hourly and making it executable.\n\n"
    },
    {
      "title": "Upload progress not enabled",
      "level": 3,
      "content": "Upon successful installation you may see the following message in the Status Report:\n\n```\nYour server is capable of displaying file upload progress, but does not have the required libraries. It is recommended to install the PECL uploadprogress library (preferred) or to install APC.\n```\n\nFirst, install the php-pearAUR package. Next, use the pecl command to automatically download, compile and install the library:\n\n```\n# pecl install uploadprogress\n```\n\nFinally, add to /etc/php/php.ini\n\n```\nextension=uploadprogress\n```\n\nRestart Apache.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Drupal documentation[dead link 2025-04-05 ⓘ]\n- Simple guide to install Drupal on Xampp[dead link 2025-04-05 ⓘ]\n\n"
    }
  ]
}