{
  "title": "Dual boot with Windows (Français)",
  "url": "https://wiki.archlinux.org/title/Dual_boot_with_Windows_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Cet article détaille différentes méthodes pour assurer la coexistence de Arch et Windows.\n\n"
    },
    {
      "title": "Limitations de Windows UEFI par rapport au BIOS",
      "level": 3,
      "content": "Microsoft impose des limitations quant au mode de démarrage et au style de partitionnement du microprogramme qui peuvent être pris en charge en fonction de la version de Windows utilisée :\n\n- Windows XP à la fois x86 32-bit et x86_64 (également appelé x64) (RTM et tous les Service Packs) ne prennent pas en charge le démarrage en mode UEFI (IA32 ou x86_64) à partir de n'importe quel disque (MBR ou GPT) OU en mode BIOS à partir d'un disque GPT. Elles ne prennent en charge que le démarrage en mode BIOS et uniquement à partir d'un disque MBR.\n- Windows Vista ou 7 en version x86 32-bit (RTM et tous les Service Packs) prennent en charge le démarrage en mode BIOS à partir de disques MBR uniquement, et non à partir de disques GPT. Elles ne prennent pas en charge le démarrage UEFI x86_64 ou IA32 (x86 32 bits). Elles ne prennent en charge que le démarrage en mode BIOS et uniquement à partir d'un disque MBR.\n- Windows Vista RTM x86_64 (uniquement la version RTM) prend en charge le démarrage en mode BIOS à partir de disques MBR uniquement, et non à partir de disques GPT. Elle ne prend pas en charge le démarrage UEFI x86_64 ou IA32 (x86 32 bits). Elle ne prend en charge que le démarrage en mode BIOS et uniquement à partir d'un disque MBR.\n- Windows Vista (SP1 et supérieur, pas RTM) et Windows 7 x86_64 prennent en charge le démarrage en mode UEFI x86_64 à partir d'un disque GPT uniquement, OU en mode BIOS à partir d'un disque MBR uniquement. Elles ne prennent pas en charge le démarrage UEFI en mode IA32 (x86 32 bits) à partir d'un disque GPT/MBR, le démarrage UEFI en mode x86_64 à partir d'un disque MBR, ou le démarrage BIOS à partir d'un disque GPT.\n- Windows 8, 8.1 et 10 en x86 32-bit prennent en charge le démarrage en mode IA32 UEFI depuis un disque GPT uniquement, OU en mode BIOS depuis un disque MBR uniquement. Elles ne prennent pas en charge le démarrage UEFI x86_64 à partir d'un disque GPT/MBR, le démarrage UEFI x86_64 à partir d'un disque MBR, ou le démarrage BIOS à partir d'un disque GPT. Sur le marché, les seuls systèmes connus pour être livrés avec IA32 (U)EFI sont certains vieux Macs Intel (modèles pré-2010 ?) et les tablettes Windows Intel Atom System-on-Chip (Clover trail et Bay Trail). dans lesquels il démarre UNIQUEMENT en mode IA32 UEFI et UNIQUEMENT depuis un disque GPT.\n- Windows 8, 8.1 et 10 en x86_64 prennent en charge le démarrage en mode UEFI x86_64 à partir d'un disque GPT uniquement, OU en mode BIOS à partir d'un disque MBR uniquement. Elles ne prennent pas en charge le démarrage UEFI en mode IA32, le démarrage UEFI en mode x86_64 à partir d'un disque MBR ou le démarrage BIOS à partir d'un disque GPT.\n- Windows 11 ne prends en charge que le démarrage sur des systèmes x86_64 avec un UEFI depuis un disque GPT.\n\nDans le cas des systèmes préinstallés :\n\n- Tous les systèmes préinstallés avec Windows XP, Vista ou 7 32-bit, indépendamment du niveau de Service Pack, du bitness, de l'édition (SKU) ou de la présence d'un UEFI dans le firmware, démarrent en mode BIOS/MBR par défaut.\n- La plupart des systèmes préinstallés avec Windows 7 x86_64, quel que soit le niveau de Service Pack, le nombre de bits ou l'édition (SKU), démarrent en mode BIOS/MBR par défaut. Très peu de systèmes récents préinstallés avec Windows 7 sont connus pour démarrer en mode UEFI/GPT x86_64 par défaut.\n- TOUS les systèmes préinstallés avec Windows 8/8.1, 10 et 11 démarrent en mode UEFI/GPT. Jusqu'à Windows 10, le bitness du firmware correspond au bitness de Windows, c'est-à-dire que Windows x86_64 démarre en mode UEFI x86_64 et Windows 32-bit démarre en mode UEFI IA32.\n\nLa meilleure façon de détecter le mode de démarrage de Windows est de faire ce qui suit [1] :\n\n- Démarrez dans Windows\n- Appuyez sur les touches Win+R pour lancer la boîte de dialogue Exécuter.\n- Dans la boîte de dialogue Exécuter, tapez msinfo32.exe et appuyez sur Entrée.\n- Dans la fenêtre Informations système, sélectionnez Résumé du système sur la gauche et vérifiez la valeur de l'élément Mode BIOS sur la droite.\n- Si la valeur est UEFI, Windows démarre en mode UEFI/GPT. Si la valeur est Legacy, Windows démarre en mode BIOS/MBR.\n\nEn général, Windows impose le type de partitionnement en fonction du mode de microprogramme utilisé, c'est-à-dire que si Windows est démarré en mode UEFI, il ne peut être installé que sur un disque GPT. Si Windows est démarré en mode Legacy BIOS, il ne peut être installé que sur un disque MBR. Il s'agit d'une limitation imposée par le programme d'installation de Windows et, depuis avril 2014, il n'existe aucun moyen officiellement pris en charge (par Microsoft) d'installer Windows en configuration UEFI/MBR ou BIOS/GPT. Ainsi, Windows ne prend en charge que les configurations de démarrage UEFI/GPT ou BIOS/MBR.\n\nUne telle limitation n'est pas appliquée par le noyau Linux, mais peut dépendre du chargeur d'amorçage utilisé et/ou de la façon dont le chargeur d'amorçage est configuré. La limitation de Windows doit être prise en compte si l'utilisateur souhaite amorcer Windows et Linux à partir du même disque, car la procédure d'installation du chargeur d'amorçage dépend du type de microprogramme et de la configuration du partitionnement du disque. Dans le cas où Windows et Linux s'amorcent à partir du même disque, il est conseillé de suivre la méthode utilisée par Windows, c'est-à-dire d'opter pour un démarrage UEFI/GPT ou BIOS/MBR. Consultez https://support.microsoft.com/kb/2581408 pour plus d'informations.\n\n"
    },
    {
      "title": "Limitations du support d'installation",
      "level": 3,
      "content": "Les tablettes avec un processeur Intel Atom System-on-Chip (Clover Trail et Bay Trail) ne disposent que d'un UEFI IA32 sans couche de compatibilité avec un BIOS (CSM) (contrairement à la plupart des systèmes UEFI x86_64), en raison des directives Microsoft Connected Standby pour les OEMs. En raison de l'absence de prise en charge du BIOS dans ces systèmes et de l'absence de démarrage UEFI 32 bits dans l'ISO d'installation officielle d'Arch (FS#53182), le support d'installation officiel ne peut pas démarrer sur ces systèmes. Consultez Unified Extensible Firmware Interface#UEFI firmware bitness pour plus d'informations et les solutions de contournement disponibles.\n\n"
    },
    {
      "title": "Limites du chargeur d'amorçage UEFI par rapport au BIOS",
      "level": 3,
      "content": "La plupart des chargeurs d'amorçage linux installés pour un type de firmware ne peuvent pas lancer ou enchaîner les chargeurs d'amorçage de l'autre type de firmware. C'est-à-dire que si Arch est installé en mode UEFI/GPT ou UEFI/MBR sur un disque et que Windows est installé en mode BIOS/MBR sur un autre disque, le chargeur d'amorçage UEFI utilisé par Arch ne peut pas chaîner le Windows installé en BIOS sur l'autre disque. De même, si Arch est installé en mode BIOS/MBR ou BIOS/GPT sur un disque et que Windows est installé en mode UEFI/GPT sur un autre disque, le chargeur d'amorçage BIOS utilisé par Arch ne peut pas charger en chaîne le Windows installé en mode UEFI sur l'autre disque.\n\nLes seules exceptions à cela sont GRUB dans les Macs d'Apple pour lesquels GRUB en mode UEFI peut démarrer le système d'exploitation installé dans le BIOS via la commande appleloader (ne fonctionne pas dans les systèmes non-Apple), et rEFInd qui prends en charge techniquement le démarrage des systèmes d'exploitation BIOS depuis les systèmes UEFI, mais ne fonctionne pas toujours dans les systèmes UEFI non-Apple selon son auteur Rod Smith.\n\nCependant, si Arch est installé en BIOS/GPT sur un disque et que Windows est installé en mode BIOS/MBR sur un autre disque, alors le chargeur d'amorçage BIOS utilisé par Arch PEUT démarrer Windows sur l'autre disque, si le chargeur d'amorçage lui-même a la capacité de charger en chaîne depuis un autre disque.\n\nWindows Setup crée une partition système EFI de 100 MiB (sauf pour les disques natifs Advanced Format 4K où il crée une partition de 300 MiB), l'utilisation de plusieurs noyaux est donc limitée. Les solutions de contournement incluent :\n\n- Montez l'ESP sur /efi et utilisez un chargeur d'amorçage qui possède des pilotes de système de fichiers et est capable de lancer des noyaux résidant sur d'autres partitions.\n- Etendez la partition système EFI, typiquement soit en diminuant la taille de la partition Recovery, soit en déplaçant la partition Windows (Les UUIDs changeront).\n- Sauvegarder et supprimer les polices inutiles dans esp/EFI/Microsoft/Boot/Fonts/ [2].\n- Sauvegarde et suppression des répertoires de langues inutiles dans esp/EFI/Microsoft/Boot/. (par exemple, pour ne garder que en-US).\n\n"
    },
    {
      "title": "UEFI Secure Boot",
      "level": 3,
      "content": "Tous les systèmes Windows 8/8.1, 10 et 11 préinstallés démarrent par défaut en mode UEFI/GPT et ont l'amorçage sécurisé UEFI activé par défaut. Ceci est imposé par Microsoft pour tous les systèmes préinstallés par les OEM.\n\nLes supports d'installation d'Arch Linux ne prennent pas encore en charge Secure Boot. Consultez Secure Boot#Booting an installation medium.\n\nIl est conseillé de désactiver manuellement l'amorçage sécurisé UEFI dans la configuration du firmware avant de tenter de démarrer Arch Linux. Windows 8/8.1, 10 et 11 DEVRAIT continuer à démarrer correctement même si l'amorçage sécurisé est désactivé. Le seul problème concernant la désactivation du support de l'amorçage sécurisé UEFI est qu'il faut un accès physique au système pour désactiver l'option d'amorçage sécurisé dans la configuration du microprogramme, car Microsoft a explicitement interdit la présence de toute méthode permettant de désactiver l'amorçage sécurisé à distance ou par programmation (à partir du système d'exploitation) dans tous les systèmes préinstallés Windows 8/8.1 et supérieurs.\n\n- Si Windows utilise Bitlocker et stocke la clé dans le TPM pour un déverrouillage automatique au démarrage, il ne démarre pas lorsque Secure Boot est désactivé et affiche un écran de récupération Bitlocker. Ce n'est pas permanent cependant, et vous pouvez facilement redémarrer Windows en réactivant simplement Secure Boot.\n- Sur Windows 11, la désactivation de Secure Boot empêche Windows Hello, WSM (Windows Subsystem for Android) et Windows Updates de fonctionner\n\n"
    },
    {
      "title": "Démarrage rapide et hibernation",
      "level": 3,
      "content": "Deux OS peuvent être mis en hibernation, vous pouvez mettre Windows en hibernation et démarrer Linux (ou un autre OS), ou vous pouvez mettre Linux en hibernation et démarrer Windows, ou mettre les deux OS en hibernation.\n\nPour la même raison, si vous partagez une partition système EFI entre Windows et Linux, la partition système EFI peut être endommagée si vous mettez en hibernation Windows (ou si vous vous arrêtez avec le démarrage rapide activé) puis démarrez Linux, ou si vous mettez Linux en hibernation puis démarrez Windows.\n\nntfs-3g a ajouté un garde-fou pour empêcher le montage en lecture-écriture de systèmes de fichiers NTFS en hibernation, mais le pilote NTFS du noyau Linux ne dispose pas d'une telle protection.\n\nWindows ne peut pas lire les systèmes de fichiers tels que ext4 par défaut qui sont couramment utilisés pour Linux. Il n'est pas nécessaire de tenir compte de ces systèmes de fichiers, sauf si vous installez un pilote Windows pour eux.\n\n"
    },
    {
      "title": "Paramètres de Windows",
      "level": 4,
      "content": "Le démarrage rapide est une fonctionnalité de Windows 8 et des versions ultérieures qui met l'ordinateur en hibernation plutôt que de l'éteindre réellement afin d'accélérer les temps de démarrage.\n\nIl existe plusieurs options concernant les paramètres Windows pour le démarrage rapide et l'hibernation, qui sont abordées dans les sections suivantes.\n\n- Désactiver le démarrage rapide et l'hibernation.\n- désactiver le démarrage rapide et activer l'hibernation\n- activer le démarrage rapide et activer l'hibernation.\n\nLa procédure de désactivation du démarrage rapide est décrite dans des tutoriels pour Windows 8, Windows 10 et Windows 11. Dans tous les cas, si vous désactivez un paramètre, veillez à désactiver ce paramètre puis à éteindre Windows, avant d'installer Linux ; notez que le redémarrage n'est pas suffisant.\n\nIl s'agit de l'option la plus sûre, et elle est recommandée si vous n'êtes pas sûr du problème, car elle nécessite le moins de vigilance de la part de l'utilisateur lors du redémarrage d'un système d'exploitation vers l'autre. Vous pouvez partager la même partition système EFI entre Windows et Linux.\n\nCette option nécessite une prise de conscience de l'utilisateur lors du redémarrage d'un système d'exploitation vers l'autre. Si vous voulez démarrer Linux pendant que Windows est en hibernation, ce qui est un cas d'utilisation courant, alors\n\n- vous devez utiliser une partition système EFI (ESP) distincte pour Windows et Linux, et vous assurer que Windows ne monte pas l'ESP utilisée pour Linux. Comme il ne peut y avoir qu'un seul ESP par lecteur, l'ESP utilisé pour Linux doit être situé sur un lecteur différent de celui utilisé pour Windows. Dans ce cas, Windows et Linux peuvent toujours être installés sur le même lecteur dans des partitions différentes, si vous placez l'ESP utilisé par linux sur un autre lecteur que la partition racine de Linux.\n- vous ne pouvez pas monter en lecture-écriture un système de fichiers dans Linux, qui est monté par Windows alors que Windows est en hibernation. Vous devriez être extrêmement prudent à ce sujet, et aussi considérer le comportement de Automount.\n- Si vous fermez complètement Windows, plutôt que d'hiberner, vous pouvez monter le système de fichiers en lecture-écriture.\n\nLes mêmes considérations s'appliquent que dans le cas \"Désactiver le démarrage rapide et activer l'hibernation\", mais comme Windows ne peut pas être arrêté complètement, mais seulement mis en hibernation, vous ne pouvez jamais monter en lecture-écriture un système de fichiers qui a été monté par Windows pendant que Windows est en hibernation.\n\n"
    },
    {
      "title": "Limitations des noms de fichiers sous Windows",
      "level": 3,
      "content": "Windows est limité à des chemins de fichiers plus courts que 260 caractères.\n\nWindows interdit également certains caractères dans les noms de fichiers pour des raisons qui remontent au DOS :\n\n- < (inférieur)\n- > (supérieur)\n- : (deux-points)\n- \" (guillemet double droit)\n- / (slash)\n- \\ (anti-slash)\n- | (séparateur vertical ou pipe)\n- ? (point d'interrogation)\n- * (astérisque)\n\nIl s'agit de limitations de Windows et non de NTFS : tout autre système d'exploitation utilisant la partition NTFS fonctionnera correctement. Windows ne détectera pas ces fichiers et l'exécution de chkdsk entraînera très probablement leur suppression. Cela peut entraîner une perte potentielle de données.\n\nNTFS-3G applique les restrictions de Windows aux nouveaux noms de fichiers par le biais de l'option windows_names : ntfs-3g(8) § Windows_Filename_Compatibility (consultez fstab).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "La manière recommandée de configurer un système à double démarrage Linux/Windows est d'installer d'abord Windows, en utilisant seulement une partie du disque pour ses partitions. Lorsque vous avez terminé l'installation de Windows, démarrez dans l'environnement d'installation de Linux où vous pouvez créer et redimensionner les partitions pour Linux tout en laissant les partitions Windows existantes intactes. L'installation de Windows créera la partition système EFI qui pourra être utilisée par votre chargeur d'amorçage Linux.\n\n"
    },
    {
      "title": "Systèmes BIOS",
      "level": 4,
      "content": "Vous pouvez utiliser n'importe quel chargeur d'amorçage BIOS prenant en charge le multi-boot.\n\nCette section explique comment : installer un chargeur d'amorçage de Linux sur une partition au lieu de la MBR ; copier ce chargeur d'amorçage sur une partition lisible par le chargeur d'amorçage de Windows ; utiliser le chargeur d'amorçage de Windows pour démarrer ladite copie du chargeur d'amorçage de Linux.\n\n- Lorsque vous installez le chargeur d'amorçage, installez-le sur votre partition /boot plutôt que sur le MBR. Pour plus de détails sur cette opération avec GRUB, consultez GRUB/Tips and tricks#Install to partition or partitionless disk, pour Syslinux, consultez la note à Syslinux#Manually, pour LILO consultez LILO#Install to partition or partitionless disk.\n\n- Faites une copie du VBR : dd if=/dev/disk of=/path/to/linux.bin bs=512 count=1 où /dev/disk est le chemin de la partition sur laquelle votre chargeur d'amorçage est installé et /path/to/ est le système de fichier monté sur lequel vous voulez que la copie soit lisible par le chargeur d'amorçage de Windows.\n\n```\ndd if=/dev/disk of=/path/to/linux.bin bs=512 count=1\n```\n\n- Sous Windows, le fichier linux.bin devrait maintenant être accessible. Exécutez cmd avec les privilèges d'administrateur (naviguez vers Démarrer > Tous les programmes > Accessoires, faites un clic droit sur Command Prompt et sélectionnez Exécuter en tant qu'administrateur) : bcdedit /create /d \"Linux\" /application BOOTSECTOR BCDEdit renverra un UUID pour cette entrée. Il sera désigné par UUID dans les étapes suivantes. bcdedit /set UUID device partition=c : (ou la lettre du lecteur sur lequel linux.bin est conservé) bcdedit /set UUID path \\path\\to\\linux.bin bcdedit /displayorder UUID (ordre d'affichage) /addlast bcdedit /timeout 30\n\n```\nbcdedit /create /d \"Linux\" /application BOOTSECTOR\n```\n\n```\nbcdedit /set UUID device partition=c : (ou la lettre du lecteur sur lequel linux.bin est conservé) \nbcdedit /set UUID path \\path\\to\\linux.bin  \nbcdedit /displayorder UUID (ordre d'affichage) /addlast  \nbcdedit /timeout 30\n```\n\nAu redémarrage, Windows et Linux devraient maintenant s'afficher dans le chargeur d'amorçage de Windows.\n\nPour plus de détails, consultez https://www.iceflatline.com/2009/09/how-to-dual-boot-windows-7-and-linux-using-bcdedit/.\n\n"
    },
    {
      "title": "Systèmes UEFI",
      "level": 4,
      "content": "Si Windows est déjà installé, il aura déjà créé certaines partitions sur un disque formaté en GPT :\n\n- une partition Windows Recovery Environment, généralement d'une taille de 499 MiB, contenant les fichiers nécessaires au démarrage de Windows (c'est-à-dire l'équivalent de /boot de Linux),\n- une partition système EFI avec un système de fichiers FAT32,\n- une Microsoft Reserved Partition, généralement d'une taille de 128 MiB,\n- une partition de données de base Microsoft avec un système de fichiers NTFS, qui correspond à C:,\n- potentiellement des partitions de récupération et de sauvegarde du système et/ou des partitions de données secondaires (correspondant souvent à D: et suivants).\n\nÀ l'aide de l'utilitaire Gestion des disques de Windows, vérifiez comment les partitions sont étiquetées et quel type est signalé. Cela vous aidera à comprendre quelles partitions sont essentielles pour Windows, et quelles autres vous pourriez réutiliser. L'utilitaire Gestion des disques de Windows peut également être utilisé pour réduire les partitions Windows (NTFS) afin de libérer de l'espace disque pour des partitions supplémentaires pour Linux.\n\nVous pouvez ensuite procéder au partitionnement, en fonction de vos besoins.\n\nNotez qu'une partition système EFI supplémentaire ne doit pas être créée, car elle pourrait empêcher Windows de démarrer. Il suffit de monter la partition existante.\n\nLe chargeur d'amorçage doit prendre en charge le chargement en chaîne d'autres applications EFI pour faire du dual boot Windows / Linux.\n\nLes ordinateurs livrés avec des versions plus récentes de Windows ont souvent Secure Boot activé. Vous devrez prendre des mesures supplémentaires pour désactiver l'amorçage sécurisé ou pour rendre votre support d'installation compatible avec l'amorçage sécurisé (consultez ci-dessus et la page liée).\n\n"
    },
    {
      "title": "Linux avant Windows",
      "level": 3,
      "content": "Même si la manière recommandée de configurer un système à double démarrage Linux/Windows est d'installer d'abord Windows, il est possible de faire l'inverse. Contrairement à l'installation de Windows avant Linux, vous devrez mettre de côté une partition pour Windows, disons 40 Go ou plus, à l'avance. Vous pouvez aussi disposer d'un espace disque non partitionné, ou créer et redimensionner des partitions pour Windows à partir de l'installation de Linux, avant de lancer l'installation de Windows.\n\n"
    },
    {
      "title": "Microprogramme UEFI",
      "level": 4,
      "content": "Windows utilisera la partition système EFI déjà existante. Contrairement à ce qui a été déclaré plus tôt, il n'est pas clair si une seule partition pour Windows, sans l'environnement de récupération Windows et sans partition réservée Microsoft, ne fera pas l'affaire.\n\nVoici un aperçu, en supposant que Secure Boot est désactivé dans le firmware.\n\n1. Démarrer l'installation de Windows. Veillez à ce qu'elle n'utilise que la partition réservée, mais sinon laissez-la faire son travail comme s'il n'y avait pas d'installation Linux.\n1. Suivez la section #Démarrage rapide et hibernation.\n1. Corrigez la possibilité de charger Linux au démarrage, peut-être en suivant la section #Impossible de démarrer Linux après avoir installé Windows. Il a déjà été mentionné dans #Systèmes UEFI que certains gestionnaires de démarrage Linux détectent automatiquement le Windows Boot Manager. Même si les installations Windows les plus récentes disposent d'une option de redémarrage avancé, à partir de laquelle vous pouvez démarrer sur Linux, il est conseillé d'avoir d'autres moyens de démarrer sur Linux, tels qu'un support d'installation d'Arch ou un live CD.\n\nCe qui suit suppose que GRUB est utilisé comme chargeur d'amorçage (bien que le processus soit probablement similaire pour d'autres chargeurs d'amorçage) et que Windows 10 sera installé sur un périphérique de type bloc formaté en GPT avec une partition système EFI existante (consultez la section \"Partition système\" dans la documentation Microsoft pour plus d'informations).\n\nCréez avec le programme gdisk sur le périphérique de type bloc les trois nouvelles partitions suivantes. Consultez [5] pour obtenir des tailles de partition plus précises.\n\nTable content:\nTaille minimale | Code | Nom | Système de fichiers\n16 MB | 0C01 | Microsoft reserved | N/A\n~40 GB | 0700 | Données de base Microsoft | NTFS\n300 MB | 2700 | Windows RE | NTFS\n\nCréez des systèmes de fichiers NTFS sur les nouvelles partitions Microsoft basic data et Windows RE (recovery) en utilisant le programme mkntfs du package ntfs-3g.\n\nRedémarrez le système dans un support d'installation de Windows 10. Lorsque vous êtes invité à installer, sélectionnez l'option d'installation personnalisée et installez Windows sur la partition de données de base Microsoft créée précédemment. Cela devrait également installer les fichiers Microsoft EFI dans la partition EFI.\n\nAprès l'installation (la configuration et la connexion à Windows ne sont pas nécessaires), redémarrez sous Linux et générez une configuration GRUB pour que le gestionnaire de démarrage Windows soit disponible dans le menu GRUB au prochain démarrage.\n\n"
    },
    {
      "title": "Impossible de créer une nouvelle partition ou de localiser une partition existante",
      "level": 4,
      "content": "Consultez #Limitations de Windows UEFI par rapport au BIOS.\n\n"
    },
    {
      "title": "Impossible de démarrer Linux après avoir installé Windows",
      "level": 4,
      "content": "Consultez Unified Extensible Firmware Interface#Windows changes boot order.\n\n"
    },
    {
      "title": "Restauration d'un enregistrement de démarrage Windows",
      "level": 4,
      "content": "Par convention (et pour faciliter l'installation), Windows est généralement installé sur la première partition et installe sa table de partition et la référence à son chargeur d'amorçage sur le premier secteur de cette partition. Si vous installez accidentellement un chargeur d'amorçage comme GRUB sur la partition Windows ou si vous endommagez l'enregistrement d'amorçage d'une autre manière, vous devrez utiliser un utilitaire pour le réparer. Microsoft inclut un utilitaire de réparation du secteur de démarrage FIXBOOT et un utilitaire de réparation du MBR appelé FIXMBR sur ses disques de récupération, ou parfois sur ses disques d'installation. En utilisant cette méthode, vous pouvez fixer la référence du secteur d'amorçage de la première partition au fichier du chargeur d'amorçage et fixer la référence du MBR à la première partition, respectivement. Après avoir fait cela, vous devrez réinstaller GRUB sur le MBR comme cela était prévu à l'origine (c'est-à-dire que le chargeur d'amorçage GRUB peut être affecté à la chaîne du chargeur d'amorçage Windows).\n\nSi vous souhaitez revenir à l'utilisation de Windows, vous pouvez utiliser la commande FIXBOOT qui enchaîne le MBR au secteur de démarrage de la première partition pour restaurer le chargement normal et automatique du système d'exploitation Windows.\n\nIl convient de noter qu'il existe un utilitaire Linux appelé ms-sys (paquet ms-sysAUR dans AUR) qui peut installer des MBR. Cependant, cet utilitaire n'est actuellement capable d'écrire de nouveaux MBR (tous les systèmes d'exploitation et de fichiers sont pris en charge) et des secteurs d'amorçage (alias boot record ; équivalent à l'utilisation de FIXBOOT) que pour les systèmes de fichiers FAT. La plupart des LiveCDs n'ont pas cet utilitaire par défaut, il faudra donc l'installer d'abord, ou vous pouvez regarder un CD de secours qui l'a, comme Parted Magic.\n\nTout d'abord, écrivez à nouveau l'information de partition (table) par :\n\n```\n# ms-sys --partition /dev/sda1\n```\n\nEnsuite, écrivez un MBR Windows 2000/XP/2003 :\n\n```\n# ms-sys --mbr /dev/sda # Options de lecture pour les différentes versions\n```\n\nEnsuite, écrivez le nouveau secteur de démarrage (boot record) :\n\n```\n# ms-sys -(1-6) # Lire les options pour découvrir le type d'enregistrement FAT correct\n```\n\nms-sys peut également écrire les MBR de Windows 98, ME, Vista et 7, consultez ms-sys -h.\n\n"
    },
    {
      "title": "La partition système EFI créée par Windows Setup est trop petite",
      "level": 4,
      "content": "Windows Setup crée une partition système EFI de 100 MiB (sauf pour les disques Advanced Format 4K natifs où il crée une partition système EFI de 100 MiB). 4K natifs où il crée une ESP de 300 MiB). Cette partition est généralement trop petite pour contenir tout ce dont vous avez besoin. Vous pouvez essayer différents outils pour redimensionner cette partition, mais il y a généralement d'autres partitions dans le chemin, ce qui rend la tâche, pour le moins, difficile. Une option est d'utiliser le média d'installation d'Arch pour créer une seule partition système EFI de la taille de votre choix avant d'installer Windows sur le disque. L'installation de Windows utilisera la partition système EFI que vous avez créée au lieu de créer la sienne.\n\n"
    },
    {
      "title": "Standard de temps",
      "level": 2,
      "content": "- Recommandé : Réglez Arch Linux et Windows pour utiliser UTC, en suivant System time (Français)#UTC dans Microsoft Windows. Certaines versions de Windows ramènent l'horloge matérielle à l'heure locale si elles sont configurées pour synchroniser l'heure en ligne. Ce problème semble être résolu dans Windows 10.\n- Non recommandé : Réglez Arch Linux sur localtime et désactivez tous les daemons de synchronisation du temps. Cela laissera Windows s'occuper des corrections de l'horloge matérielle et vous devrez vous rappeler de démarrer Windows au moins deux fois par an (au printemps et à l'automne) lorsque l'heure d'été ou d'hiver s'applique. Ne demandez donc pas sur les forums pourquoi l'horloge a une heure de retard ou d'avance si vous passez habituellement des jours ou des semaines sans démarrer dans Windows.\n\n"
    },
    {
      "title": "Appairage Bluetooth",
      "level": 2,
      "content": "Lorsqu'il s'agit de coupler des périphériques Bluetooth avec les installations Linux et Windows, les deux systèmes ont la même adresse MAC, mais utilisent des clés d'appairage différentes générées pendant le processus de couplage. Il en résulte que le périphérique ne peut pas se connecter à une installation, après avoir été apparié avec l'autre. Pour permettre à un périphérique de se connecter à l'une ou l'autre installation sans avoir à se ré-appairer, suivez la procédure Bluetooth#Dual boot pairing.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Démarrer Windows à partir d'un raccourci du bureau\n- Démarrage unique de la partition Windows à partir d'un raccourci du bureau\n- Utilitaire de gravure de Windows 7/8/8.1/10 ISO sur clé USB pour Linux (MBR/GPT, BIOS/UEFI, FAT32/NTFS)\n\n"
    }
  ]
}