{
  "title": "Dunst (Polski)",
  "url": "https://wiki.archlinux.org/title/Dunst_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nPowiązane artykuły\n\n- Desktop Notifications (Polski)\n\nDunst jest lekkim zamiennikiem dla notification-daemons dostarczanym przez większość środowisk graficznych.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiet dunst. Nie ma potrzeby żeby startować lub uruchamiać dunst; jest automatycznie uruchamiany przez systemd kiedy programy wysyłają powiadomienia programy przez dbus.\n\nPrzykładowy plik konfiguracyjny można znaleść w /usr/share/dunst/dunstrc. Skopiuj ten plik do ~/.config/dunst/dunstrc i zedytuj go do swoich potrzeb.\n\n"
    },
    {
      "title": "Wygląd",
      "level": 2,
      "content": "Dunst pozwala na używanie markapu htmla w powiadomieniach. Niektórymi przykładami jest pogrubienie, kursywa, przekreślenie i podkreślenie. Dla pełnego odniesienia zobacz [1][dead link 2024-07-30 ⓘ]. HTML może być usunięty z powiadomień jeżeli markup jest ustawiony na none.\n\nThe formatting of the notification can be specified. Options are as follows:\n\n```\n%a  appname\n%s  summary\n%b  body\n%i  iconname (including its path)\n%I  iconname (without its path)\n%p  progress value if set ([  0%] to [100%]) or nothing\n```\n\nThese can be used in conjunction with HTML markup. For example the format can be set to <b>%s</b>\\n%b for a bolded notification summary, a newline and the body unformatted.\n\n"
    },
    {
      "title": "Paczki ikon",
      "level": 3,
      "content": "Ikony są ustawione w opcji icon_path. Ikony statusów i urządzeń są potrzebne. Domyślnie Dunst szuka ikon gnome-icon-themeAUR. Dla przykładu żeby użyć adwaita-icon-theme (sukcesor gnome-icon-theme), użyj wzamian:\n\n```\nicon_path = /usr/share/icons/Adwaita/16x16/status/:/usr/share/icons/Adwaita/16x16/devices/\n```\n\n"
    },
    {
      "title": "Skróty klawiszowe",
      "level": 2,
      "content": "Można ustawić progi nieaktywności, aby powiadomienie pozostało na ekranie, jeśli użytkownik jest nieaktywny dłużej niż ten próg.\n\nŻeby zamknąć zanim czas upłynie użyj Control+Space. Jeżeli kilka powiadomień jest na ekranie Control+Shift+Spacja zamknie je wszystkie.\n\nList historii może być sprawdzona używając Control+Grawis (grawis oznacza `). Menu kontekstowe może być otwarte używając Control+Shift+Kropka. Menu kontekstowe używa dmenu żeby odfiltrować URLe i otworzyć je w twojej przeglądarce. Domyślna przeglądarka może być ustawiona w pliku konfiguracyjnym w ten sposób:\n\n```\nbrowser = /usr/bin/chromium\n```\n\n"
    },
    {
      "title": "Skryptowanie",
      "level": 2,
      "content": "Dunst może być skonfigurowany żeby uruchamiać skrypty bazując na treści powiadomienia. Tu jest przykład używając dunsta żeby uruchomić skrypt kiedy pidgin wysyła wiadomość:\n\n```\n[signed_on]\n   appname = Pidgin\n   summary = \"*signed on*\"\n   urgency = low\n   script = do_something.sh\n```\n\n"
    },
    {
      "title": "Naprawianie problemów",
      "level": 2,
      "content": "Kiedy używamy dunsta bez menadżera wyświetlania, wartość środowiska DISPLAY może być nie ustawiona poprawnie.[2]\n\nŻeby to naprawić, dodaj poniższą rzecz do swojego .xinitrc\n\n```\nsystemctl --user import-environment DISPLAY\n```\n\n"
    }
  ]
}