{
  "title": "Duply (Español)",
  "url": "https://wiki.archlinux.org/title/Duply_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-12** \n\nDe duply.net:\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Duply está disponible como paquete duplyAUR en el AUR.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Para ver un resumen de cómo usar Duply ejecute duply usage.\n\nLo primero que hay que hacer es crear un perfil. Ejecute duply my_profile create para crear un perfil llamado my_profile. Luego configure el perfil usando el archivo ~/.duply/mi_perfil/conf.\n\nEjecute la orden duply my_profile backup para realizar copias de seguridad y duply my_profile restore restore_directory para restaurar una vez se complete la configuración.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Configure GPG_KEY para cifrar y firmar la copia de seguridad con una clave GPG. Configure GPG_PW con la frase de contraseña GPG. Véase #Sin frase de contraseña GPG para más detalles sobre la solicitud de la frase de contraseña GPG. Establezca TARGET para el destino de la copia de seguridad. Establezca SOURCE para la ubicación base de la copia de seguridad. Véase el archivo conf para conocer más información sobre otras configuraciones de copias de seguridad de Duply.\n\nHe aquí un ejemplo:\n\n```\n~/.duply/my_profile/conf\n```\n\n```\nGPG_KEY='72AD0468'\nGPG_PW='password'\nTARGET='file://my_profile_backup'\nSOURCE='/tmp/important_files'\n```\n\nAhora ejecute duply my_profile backup para realizar una copia de seguridad de todo lo que hay en /tmp/important_files. La primera vez que se ejecute duply my_profile backup se pedirá al usuario la contraseña GPG para poder exportar la clave y guardarla. Posteriormente, Duply debería ejecutarse sin pedir una frase de contraseña.\n\nPara excluir ciertos archivos a la hora de realizar una copia de seguridad, véase ~/.duply/my_profile/exclude.\n\n```\n~/.duply/my_profile/exclude\n```\n\n```\n# Backup everything except this directory\n- **/less_important_files\n```\n\no bien\n\n```\n~/.duply/my_profile/exclude\n```\n\n```\n# Individual files\n+ /tmp/important_files/file1\n+ /tmp/important_files/file2\n\n# Exclude cache inside directory\n- /tmp/important_files/directory/cache\n+ /tmp/important_files/directory\n\n# Exclude everything else\n- **\n```\n\nLa exclusión de Duplicity requiere ** para que coincida con el directorio base.\n\n"
    },
    {
      "title": "Sin frase de contraseña GPG",
      "level": 3,
      "content": "Debido a un bug en Duply, Duplicity pedirá una frase de contraseña GPG a pesar de estar disponible en el gpg-agent. Simplemente pulsando return cuando aparezca el prompt, este funcionará ya que la frase de contraseña no es necesaria para usar la clave (si la clave está almacenada en caché), o se añade la línea DUPL_PARAMS=\"$DUPL_PARAMS --use-agent\" al archivo conf.\n\n```\n~/.duply/my_profile/conf\n```\n\n```\n# Turn on --use-agent option no matter what\nDUPL_PARAMS=\"$DUPL_PARAMS --use-agent\"\n```\n\n"
    },
    {
      "title": "No es posible firmar al usar la versión 2.1.0 o posterior de GPG",
      "level": 3,
      "content": "Debido a los cambios en las últimas versiones de GPG, este mensaje puede aparecer durante el proceso de copia de seguridad:\n\n```\nduply gpg: signing failed: Inappropriate ioctl for device\n```\n\nEsto puede arreglarse descomentando la sección GPG_OPTS del archivo conf de Duply y añadiendo el argumento --pinentry-mode loopback:\n\n```\n~/.duply/my_profile/conf OR /etc/duply/my_profile/conf (if running as root)\n```\n\n```\nGPG_OPTS='--pinentry-mode loopback'\n```\n\n"
    },
    {
      "title": "Realizar una copia de seguridad de la configuración",
      "level": 2,
      "content": "Es importante hacer una copia de seguridad de la configuración de su perfil para poder recuperar la copia de seguridad. Una forma de hacerlo automáticamente es añadir un script post que guarde el perfil en un tar después de un backup. Por ejemplo:\n\n```\n~/.duply/my_profile/post\n```\n\n```\n#!/bin/bash\n\nprofile_name=$(basename $CONFDIR)\n\ntime=$(date +%s)\nbackup_file=\"$HOME/.duply/duply-$profile_name-\"$time\".tar.gz\"\n\n# Archive the profile in the ~/.duply directory.\ntar -zcvf $backup_file -C $HOME/.duply $profile_name\nchmod 600 $backup_file\n```\n\nCopie el archivo *.tar.gz a una ubicación de almacenamiento segura como LastPass, KeePass, Bitwarden o un disco duro USB sin conexión. Otra opción es archivar el perfil en un papel como código QR (duply_qr-gitAUR). El archivo de configuración debería ser accesible incluso si se pierde el acceso al ordenador del que se hace la copia de seguridad, ya que el objetivo de la copia de seguridad es que pueda recuperarse incluso si el ordenador se pierde o se destruye.\n\n"
    }
  ]
}