{
  "title": "Dynamic Kernel Module Support (Français)",
  "url": "https://wiki.archlinux.org/title/Dynamic_Kernel_Module_Support_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Traduit de Wikipedia :\n\nCela signifie qu'un utilisateur n'a pas à attendre qu'une entreprise, un projet ou un mainteneur de paquet publie une nouvelle version du module. Depuis l'introduction des pacman hooks, la reconstruction des modules est gérée automatiquement lorsqu'un noyau est mis à jour.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet dkms et les en-têtes pour le ou les noyaux cibles. Par exemple, pour le noyau linux par défaut, ce sera linux-headers. Les autres noyaux ont leurs propres paquets d'en-têtes respectifs.\n\nUn bon nombre de modules qui se trouvent en dehors de l'arbre des sources du noyau ont une variante de DKMS ; quelques-uns sont hébergés dans les dépôts officiels, la plupart se trouvent dans AUR.\n\n"
    },
    {
      "title": "Mises à jour",
      "level": 2,
      "content": "Bien que la reconstruction des modules DKMS soit généralement transparente lors d'une mise à jour du noyau, il peut arriver que la reconstruction échoue. Vous devez prêter une attention particulière à la sortie de pacman. Cela s'applique en particulier si le système dépend du module DKMS pour démarrer correctement et/ou si vous utilisez DKMS avec un noyau personnalisé qui ne se trouve pas dans les dépôts officiels.\n\nPour faire face aux changements du noyau, corriger les bogues ou ajouter des fonctionnalités nécessaires, pensez à mettre à jour le paquet DKMS avant de redémarrer.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "Utilisation pour invoquer DKMS manuellement.\n\nLa complétion par tabulation est disponible en faisant :\n\n```\n# source /usr/share/bash-completion/completions/dkms\n```\n\n"
    },
    {
      "title": "Liste des modules",
      "level": 3,
      "content": "Pour lister l'état actuel des modules, versions et noyaux dans l'arbre :\n\n```\n# dkms status\n```\n\n"
    },
    {
      "title": "Reconstruction des modules",
      "level": 3,
      "content": "Reconstruire tous les modules pour le noyau en cours d'exécution :\n\n```\n# dkms autoinstall\n```\n\nou pour un noyau spécifique :\n\n```\n# dkms autoinstall -k 3.16.4-1-ARCH\n```\n\nPour construire un module spécifique pour le noyau en cours d'exécution :\n\n```\n# dkms install -m nvidia -v 334.21\n```\n\nou simplement :\n\n```\n# dkms install nvidia/334.21\n```\n\nPour construire un module pour tous les noyaux :\n\n```\n# dkms install nvidia/334.21 --all\n```\n\n"
    },
    {
      "title": "Supprimer des modules",
      "level": 3,
      "content": "Pour supprimer un module (les anciens modules ne sont pas automatiquement supprimés) :\n\n```\n# dkms remove -m nvidia -v 331.49 --all\n```\n\nou simplement :\n\n```\n# dkms remove nvidia/331.49 --all\n```\n\nSi le paquet dkms est supprimé, les informations concernant les fichiers de construction des modules précédents sont perdues. Si c'est le cas, parcourez /usr/lib/modules/kernel_release et /var/lib/dkms/package_name et supprimez tous les fichiers et répertoires qui ne sont plus utilisés.\n\n"
    },
    {
      "title": "Création de paquets DKMS",
      "level": 2,
      "content": "Consultez les Directives pour les paquets DKMS.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Linux Journal : Exploration de la prise en charge des modules dynamiques du noyau.\n\n"
    }
  ]
}