{
  "title": "E17 (Español)",
  "url": "https://wiki.archlinux.org/title/E17_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nNote: **2019-02-13** \n\nArtículos relacionados\n\n- Entorno de escritorio\n- Gestor de pantalla\n- Gestor de ventanas\n\n"
    },
    {
      "title": "Enlightenment",
      "level": 2,
      "content": "Consta tanto del gestor de ventanas Enlightenment como de Enlightenment Foundation Libraries (EFL), que proporcionan características adicionales de entorno de escritorio, como, por ejemplo, un toolkit, un lienzo de objetos y objetos abstractos. Ha estado en desarrollo desde 2005, pero en febrero de 2011 las principales EFLs vieron su primera versión estable 1.0.\n\n"
    },
    {
      "title": "Instalación",
      "level": 3,
      "content": "Instale el paquete enlightenment.\n\nTambién es posible que desee instalar algunas aplicaciones basadas en EFL que se integra bien con Enlightenment:\n\n- ecrire - Editor de texto Ecrire\n- ephoto - Visor de imágenes Ephoto[enlace roto 2025-03-15]\n- evisum - Administrador de tareas Evisum\n- rage - Reproductor de vídeo Rage\n- terminology - Emulador de terminal Terminology\n\nLos PKGBUILDs de desarrollo que descargan e instalan el último código de desarrollo están disponibles como enlightenment-gitAUR y sus dependencias.\n\nLas siguientes son aplicaciones basadas en EFL, la mayoría en una etapa temprana de desarrollo y aún no publicadas:\n\n- econnmanAUR - Una interfaz de usuario basada en EFL para el gestor de red ConnMan\n- ediAUR[enlace roto: package not found] - Un IDE basado en EFL\n- enjoy-gitAUR[enlace roto: package not found] - Reproductor de música\n- eperiodiqueAUR - Visor de tablas periódicas Eperiodique\n- epourAUR[enlace roto: package not found] - Cliente torrent basado en EFL\n- epymc-gitAUR - E Python Media Center\n- eruler-gitAUR - Regla de pantalla y herramientas de medición Eruler\n\n"
    },
    {
      "title": "Iniciar Enlightenment",
      "level": 3,
      "content": "Simplemente elija la sesión Enlightenment de su gestor de pantalla favorito o configure xinitrc para iniciarla desde la consola.\n\n"
    },
    {
      "title": "Entrance",
      "level": 4,
      "content": "Enlightenment tiene un nuevo gestor de pantalla llamado Entrance, que se proporciona con el paquete entrance-gitAUR. Entrance es bastante sofisticado y su configuración está controlada por /etc/entrance/entrance.conf. Se puede utilizar activando entrance.service.\n\n"
    },
    {
      "title": "Iniciar Enlightenment manualmente",
      "level": 4,
      "content": "Si prefiere iniciar Enlightenment manualmente desde la consola, agregue la siguiente línea a su archivo ~/.xinitrc:\n\n```\n~/.xinitrc\n```\n\n```\nexec enlightenment_start\n```\n\nPosteriormente, se puede iniciar Enlightenment ejecutando startx. Véase xinitrc para obtener más detalles.\n\nPara probar el compositor experimental Wayland, ejecute enlightenment_start en un tty.\n\n"
    },
    {
      "title": "Configuración",
      "level": 3,
      "content": "Enlightenment tiene un sofisticado sistema de configuración al que se puede acceder desde el submenú Configuración del menú principal.\n\n"
    },
    {
      "title": "Redes",
      "level": 4,
      "content": "ConnMan\n\nEl administrador de red preferido de Enlightenment es ConnMan que se puede instalar desde el paquete connman. Siga las instrucciones de ConnMan para llevar a cabo la configuración.\n\nPara la configuración extendida, también puede instalar Econnman (disponible en el AUR como econnmanAUR o econnman-gitAUR) y sus dependencias asociadas.\n\nAgregar el gadget ConnMan al estante\n\n1. Vaya a Configuración -> Extensiones -> Módulos\n1. En Sistema\n1. Administrador de conexiones\n1. Cárguelo (primero selecciónelo y luego presione Cargar).\n1. Haga clic derecho en el estante en la parte inferior de la pantalla.\n1. Vaya a Estante -> Contenidos\n1. Luego, simplemente desplácese hacia abajo y seleccione ConnMan.\n1. Finalmente, haga clic en Añadir.\n\nNetworkManager\n\nTambién puede utilizar networkmanager para gestionar sus conexiones de red, véase NetworkManager para obtener más información.\n\nSin embargo, tenga en cuenta que el applet necesitará el soporte de Appindicator para mostrarse en la bandeja del sistema de Enlightenment. Véase NetworkManager#Appindicator. Como alternativa al uso del applet, NetworkManager incluye las interfaces CLI y TUI para la configuración de la red, véase NetworkManager#Usage.\n\n"
    },
    {
      "title": "Agente Polkit",
      "level": 4,
      "content": "Enlightenment no se expide con un agente de autentificación gráfico polkit. Si desea acceder a algunas acciones con privilegios (por ejemplo, montar un sistema de archivos en un dispositivo del sistema), debe instalar uno e iniciarlo automáticamente. Para ello, debe ir a Panel de preferencias > Aplicaciones > Aplicaciones al inicio > Sistema y añadirlo. Hay un agente de autenticación basado en EFL disponible en el AUR, polkit-efl-gitAUR[enlace roto: package not found].\n\n"
    },
    {
      "title": "Integración con GNOME Keyring",
      "level": 4,
      "content": "Es posible utilizar gnome-keyring en Enlightenment. Sin embargo, se necesita hacer un pequeño truco para que funcione a pleno rendimiento. Primero, debe decirle a Enlightenment que inicie automáticamente gnome-keyring. Para ello, debe ir a Panel de preferencias > Aplicaciones > Aplicaciones al inicio > Sistema y añadir Certificados y almacenamiento de claves, Agente de claves GPG, Agente de claves SSH y Servicio de almacenamiento de secretos. Después, debe editar el archivo ~/.pam_environment y agregar lo siguiente:\n\n```\n#Set gnome-keyring as the ssh authentication agent\n      SSH_AUTH_SOCK=/run/user/${UID}/keyring/ssh\n```\n\nEste \"truco\" se usa para anular la configuración automática de la variable \"enlightenment-start\" desde \"ssh-agent\" a gnome-keyring.\n\nVéase más información sobre este tema en el artículo GNOME Keyring.\n\n"
    },
    {
      "title": "Bandeja del sistema",
      "level": 4,
      "content": "Enlightenment es compatible con una bandeja del sistema, pero no está habilitada de forma predeterminada. Para habilitar la bandeja del sistema, abra el menú principal de Enlightenment, navegue hasta el submenú Preferencias y haga clic en la opción Módulos. Desplácese hacia abajo hasta que vea la opción Systray. Resalte esa opción y haga clic en Cargar. Ahora que el módulo se ha cargado, se puede agregar al estante. Haga clic derecho en el estante al que desea agregar Systray, resalte el submenú Estante y haga clic en la opción Contenidos. Desplácese hacia abajo hasta que vea Systray. Resalte esa opción y haga clic en el botón Añadir.\n\n"
    },
    {
      "title": "Notificaciones",
      "level": 4,
      "content": "Enlightenment proporciona un servidor de notificaciones a través de su extensión de Notificaciones.\n\n- Las notificaciones se pueden mostrar en cualquier esquina de la \"pantalla\" como se describe a continuación\n- Las reglas de pantalla disponibles son Pantalla principal, Pantalla actual, Todas las pantallas y Xinerama\n- Las notificaciones se pueden filtrar según la urgencia (baja, normal o crítica en cualquier combinación)\n- Se puede establecer un tiempo de espera de notificación predeterminado y se puede aplicar opcionalmente para todas las notificaciones\n- El servidor de notificaciones también puede ignorar opcionalmente las solicitudes de reemplazo de ID\n\n"
    },
    {
      "title": "Temas",
      "level": 3,
      "content": "Se pueden encontrar más temas para personalizar el aspecto de Enlightenment en:\n\n- extra.enlightenment.org[enlace roto 2024-10-12]\n- enlightenment-themes.org\n- relighted.c0n.de para el tema predeterminado en 200 colores diferentes\n- git.enlightenment.org (git clone el tema que le guste, ejecute 'make' y terminará con un archivo de tema .edj)\n- packages.bodhilinux.com tiene una buena colección (deberá extraer el archivo .edj del .deb; bsdtar hará esto y es parte de la instalación base de Arch Linux). Un buen catálogo puede verse en su wiki.\n- exchange.enlightenment.org (archivado)\n\nPuede instalar los temas (que vienen en formato .edj) usando el cuadro de diálogo de configuración del tema o moviéndolos a ~/.e/e/themes.\n\n"
    },
    {
      "title": "GTK+",
      "level": 4,
      "content": "Para modificar el tema GTK+, vaya a Preferencias > Todo > Apariencia > Tema de las aplicaciones.\n\n"
    },
    {
      "title": "Módulos y Gadgets",
      "level": 3,
      "content": "Muchos módulos proporcionan gadgets que se pueden agregar a su escritorio o a un estante. Algunos módulos (como, por ejemplo, CPUFreq) solo proporcionan un Gadget único, mientras que otros (como, por ejemplo, Composite) proporcionan características adicionales sin ningún gadget. Tenga en cuenta que ciertos gadgets, como Systray, solo se pueden agregar a un estante, mientras que otros, como Moon, solo se pueden cargar en el escritorio.\n\n"
    },
    {
      "title": "Módulos \"Extra\"",
      "level": 4,
      "content": "Además de los módulos aquí descritos, se pueden encontrar más módulos \"extra\" en e-modules-extra-gitAUR.\n\nScale Windows\n\nEl módulo Scale Windows, que requiere que la composición esté habilitada, agrega varias características. El efecto Scale Windows reduce todas las ventanas abiertas y las pone a la vista. Esto se conoce como \"Mission Control\" en macOS. El efecto aleja el zoom y muestra todos los escritorios como una pared, como el plugin compiz expo. Ambos pueden agregarse al escritorio como un gadget o asignarse a un atajo de teclado, a un atajo de ratón o a un atajo de borde (de pantalla).\n\nA algunas personas les gusta cambiar la asignación de teclas predeterminada de selección de ventanas ALT + Tab para usar Scale Windows para seleccionar ventanas. Para cambiar esta configuración, vaya a Menú > Preferencias > Panel de preferencias > Entrada > Atajos de teclado. Desde aquí, puede establecer cualquier combinación de teclas que desee.\n\nPara reemplazar el atajo de teclado de selección de ventanas por Scale Windows, desplácese por el panel izquierdo hasta que encuentre la sección ALT y luego busque y seleccione ALT + Tab. Luego, desplácese por el panel derecho en busca de la sección \"Scale Windows\" y elija o bien Seleccionar siguiente o Seleccionar siguiente (todo) dependiendo de si desea ver las ventanas solo desde el escritorio actual o desde todos los escritorios. Haga clic en Aplicar para guardar los cambios.\n\nDisponible en upstream git.\n\n"
    },
    {
      "title": "Atajos de teclado predeterminados",
      "level": 3,
      "content": "Table content:\nMayus + F10 | Maximizar verticalmente\nCtrl + Menú | Mostrar menú de clientes\nAlt + Escape | Mostrar lanzador \"Everything\" (aplicaciones, ventanas, etc.)\nWin + Izquierda | Maximizar izquierda\nWin + Derecha | Maximizar derecha\nAlt + Mayus + F10 | Maximizar horizontalmente\nAlt + Mayus + Izquierda | Voltear escritorio a la izquierda\nAlt + Mayus + Derecha | Voltear escritorio a la derecha\nCtrl + Alt + D | Mostrar escritorio\nCtrl + Alt + F | Alternar pantalla completa\nCtrl + Alt + I | Alternar modo minimizado\nCtrl + Alt + K | Matar ventana\nCtrl + Alt + L | Bloquear escritorio\nCtrl + Alt + N | Maximizar ventana\nCtrl + Alt + R | Alternar \"Enrollar arriba\"\nCtrl + Alt + W | Menú de ventana\nCtrl + Alt + X | Cerrar ventana\nCtrl + Alt + Abajo | Bajar una ventana\nCtrl + Alt + Arriba | Elevar una ventana\nCtrl + Alt + Izquierda | Voltear el escritorio linealmente a la izquierda\nCtrl + Alt + Derecha | Voltear el escritorio linealmente a la derecha\nCtrl + Alt + Supr | Controles del sistema\nCtrl + Alt + Insert | Ejecutar la terminal por defecto\n\n"
    },
    {
      "title": "Solución de problemas",
      "level": 3,
      "content": "Si encuentra algún comportamiento inesperado, puede probar varias cosas:\n\n1. intente ver si se da el mismo comportamiento con el tema predeterminado\n1. deshabilite cualquier módulo de terceros que pueda tener instalado\n1. haga una copia de seguridad del archivo ~/.e y después elimínelo (por ejemplo, mv ~/.e ~/.e.copia)\n\nSi está seguro de haber encontrado un error, repórtelo directamente a la fuente.\n\n"
    },
    {
      "title": "Composición",
      "level": 4,
      "content": "Cuando sea necesario restablecer la configuración y no se pueda acceder a la ventana de preferencias, los ajustes del compositor se pueden restablecer mediante el atajo de teclado Ctrl + Alt + Mayus + Inicio.\n\n"
    },
    {
      "title": "Las fuentes son ilegibles",
      "level": 4,
      "content": "Si las fuentes son demasiado pequeñas y su pantalla es ilegible, asegúrese de que los paquetes de fuentes correctos se encuentran instalados. Por ejemplo, ttf-dejavu y ttf-bitstream-vera son candidatos válidos.\n\nPuede configurar el escalado de las fuentes en Preferencias > Panel de preferencias > Apariencia > Escalado.\n\n"
    },
    {
      "title": "El brillo siempre está atenuado",
      "level": 4,
      "content": "Es posible que Enlightenment disminuya habitualmente el brillo al 30% al cerrar sesión y solo lo restaurará al 100% cuando inicie sesión con otra sesión de Enlightenment. Esto es especialmente problemático cuando se utiliza otro entorno de escritorio junto con Enlightenment, ya que el brillo no se restaurará automáticamente a su nivel normal cuando se utilize ese entorno de escritorio. Para solucionar este problema, abra el Panel de preferencias de Enlightenment y, en la pestaña Apariencia, haga clic en la opción Composición. Marque la casilla No atenuar retroiluminación y haga clic en Aplicar.\n\n"
    },
    {
      "title": "El tema del cursor es inconsistente",
      "level": 4,
      "content": "Es posible que el tema del cursor para el escritorio sea distinto al utilizado en otras aplicaciones como Firefox. Esto se debe a que las aplicaciones de escritorio usan temas de cursor de Xorg mientras que Enlightenment tiene su propia colección de temas de cursor. Por consistencia, puede configurar Enlightenment para usar siempre el tema del cursor de Xorg. Para ello, abra el Panel de preferencias de Enlightenment y haga clic en la pestaña Entrada. Haga clic en la opción Ratón. Cambie el tema de Enlightenment a X y haga clic en Aplicar. Ahora debería observar que el mismo tema del cursor se usa en todas partes. Si el tema del cursor de Xorg no es siempre consistente, véase Cursor themes (Español)#Especificación XDG.\n\n"
    },
    {
      "title": "Imágenes de fondo",
      "level": 4,
      "content": "Tiene que copiar los fondos de pantalla deseados a la carpeta ~/.e/e/backgrounds/\n\nAl hacer clic con el botón central o derecho del ratón en cualquier parte del escritorio tendrá acceso a la configuración; seleccione /Desktop/Backgrounds/.\n\nCualquier nueva imagen copiada a la carpeta ~/.e/e/backgrounds/ hará que la lista de fondos disponibles se actualize automáticamente. Seleccione el fondo de pantalla que desee en el menú desplegable. Dentro de las pestañas apropiadas en la configuración global, puede aplicar ajustes como: mosaico, rellenar, etc.\n\n"
    },
    {
      "title": "Enlightenment DR16",
      "level": 2,
      "content": "Enlightenment, Development Release 16 se lanzó por primera vez en el año 2000 y alcanzó la versión 1.0 en el 2009. Originalmente, DR16 representaba la versión 0.16 del proyecto Enlightenment. Lo puede encontrar actualmente como \"Enlightenment16\" en los repositorios de Arch, aunque todavía está en desarrollo a día de hoy, siendo actualizado regularmente por su mantenedor Kim 'kwo' Woelders. Con composición, sombras y transparencias, E16 mantuvo toda la velocidad que presidió su fundación por el autor original Carsten \"Rasterman\" Haitzler, pero con un refinamiento actualizado.\n\n"
    },
    {
      "title": "Instalar E16",
      "level": 3,
      "content": "Instale enlightenment16AUR.\n\nVéase /usr/share/doc/e16/e16.html para documentación más detallada.\n\n"
    },
    {
      "title": "Configuración básica",
      "level": 3,
      "content": "La mayoría de los archivos de configuración de E16 se encuentran en ~/.e16 y están basados en texto, por lo que se pueden editar a voluntad. Eso también incluye los menús.\n\nLas teclas de acceso directo se pueden modificar a mano o con el software e16keyedit que se proporciona como código fuente en la página sourceforge del proyecto e16. Tenga en cuenta que el archivo de los accesos directos del teclado no se crea en ~/.e16 de forma predeterminada. Puede copiar la versión empaquetada a su directorio de inicio si desea realizar cambios:\n\n```\n$ cp /usr/share/e16/config/bindings.cfg ~/.e16\n```\n\n"
    },
    {
      "title": "Iniciar/reiniciar/detener scripts",
      "level": 4,
      "content": "Cree una carpeta Init, una carpeta Start y una carpeta Stop en su directorio ~/.e16: cualquier script .sh que se encuentre allí se ejecutará o bien al inicio (de la carpeta Init), o en cada reinicio (de la carpeta Start) , o en el apagado (de la carpeta Stop); siempre que lo permita a través del botón central del ratón / preferencias / sesión / <habilitar scripts> y los haga ejecutables con chmod +x suscript.sh. Los ejemplos típicos incluyen el inicio de pulseaudio o su applet de administrador de red favorito.\n\n"
    },
    {
      "title": "Compositor",
      "level": 4,
      "content": "Las sombras, los efectos de transparencia et al se pueden encontrar accediendo con el botón central/derecho del ratón / Preferencias, Composición.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página web de Enlightenment\n- Documentación de desarollo de Enlightenment\n- Recurso de descarga de DR16\n- Lista de correos de los usuarios de Enlightenment\n- Lista de correos de los desarrolladores de Enlightenment\n- ircs://irc.libera.chat/e\n\n"
    }
  ]
}