{
  "title": "Echinus (Español)",
  "url": "https://wiki.archlinux.org/title/Echinus_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-06** \n\nArtículos relacionados\n\n- dmenu\n- Gestores de ventanas\n\nechinus es un gestor de ventanas flotantes y de mosaico simple y liviano para X11. Comenzó como una bifurcación dwm con una configuración más sencilla, echinus se convirtió en un gestor de ventanas de reparentalización con todas las funciones con soporte EWMH.\n\nA diferencia de dwm, echinus no necesita volver a compilarse después de realizar cambios en la configuración. Es compatible con Xft (freetype) y tiene la opción de barras de título configurables.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale echinusAUR. También puede instalar ouricoAUR, una barra de tareas EWMH liviana, diseñada originalmente para echinus (también en AUR), y dmenu.\n\nDespués de instalar con éxito, copie todos los archivos de /etc/xdg/echinus a ~/.echinus (para el usuario).\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "echinus se configura en un archivo de texto simple, en formato Xresources: ~/.echinus/echinusrc. Los detalles de todas las opciones de configuración se encuentran en /usr/share/doc/echinus/README. Una sección de un archivo de configuración de muestra tal que así:\n\n```\nEchinus*selected.border: #404040\nEchinus*selected.button: #d3d7cf\nEchinus*selected.bg: #262626\nEchinus*selected.fg: #d3d7cf\n```\n\n"
    },
    {
      "title": "Reglas",
      "level": 3,
      "content": "Las reglas se pueden configurar para generar aplicaciones en etiquetas específicas. La siguiente regla, por ejemplo, abriría Firefox en la etiqueta \"web\":\n\n```\nEchinus*rule0: firefox.* web 0 1\n```\n\nAbrir aplicaciones en un terminal requiere que establezcas explícitamente la etiqueta -title al generarlas para que echinus pueda administrarlas:\n\n```\nEchinus*spawn0: CA + m = urxvtc -title mutt -e mutt\n```\n\nDe manera similar, al generar dmenu, deberá declarar las propiedades requeridas, así:\n\n```\nEchinus*spawn1: Menu = dmenu_run -fn \"-*-dina-medium-r-*-*-*-100-*-*-*-*-*-*\" -nb \"#1A1A1A\" -nf \"#696969\" -sb \"#1A1A1A\" -sf \"#D3D7Cf\"\n```\n\n"
    },
    {
      "title": "Iniciar echinus",
      "level": 2,
      "content": "Para iniciar echinus con startx o el gestor de inicio de sesión SLiM, simplemente añada lo siguiente a ~/.xinitrc:\n\n```\nexec echinus\n```\n\n"
    },
    {
      "title": "Utilizar echinus",
      "level": 2,
      "content": "Después de realizar cambios en echinusrc, puede volver a cargar la configuración sin volver a compilar reiniciando echinus, con Alt + Mayús + q. Esta combinación de teclas, y cualquier otra, se puede personalizar para adaptarse a sus preferencias o memoria muscular.\n\nMás detalles para manipular ventanas están en la página de manual y en README.\n\n"
    },
    {
      "title": "Paneles y paginadores",
      "level": 3,
      "content": "echinus es compatible con algunas partes de EWMH; se sabe que las siguientes funcionan:\n\n- tint2\n- fbpanel\n- ipager[enlace roto 2025-03-15]\n- ouricoAUR\n\n"
    },
    {
      "title": "Recursos",
      "level": 2,
      "content": "- Sitio web de echinus\n- Repositorio GitHub\n\n"
    },
    {
      "title": "Capturas de pantalla",
      "level": 3,
      "content": "- https://www.flickr.com/photos/jasonwryan/5270660692/lightbox/\n- http://plhk.ru/gallery/echinus-0.4.6.png\n- http://plhk.ru/gallery/profont.png\n- http://plhk.ru/gallery/echinus027.png\n\n"
    }
  ]
}