{
  "title": "Eclipse (Español)",
  "url": "https://wiki.archlinux.org/title/Eclipse_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-10-05** \n\nEclipse es un proyecto de la comunidad de código abierto, que tiene como objetivo proporcionar una plataforma de desarrollo universal. El proyecto Eclipse es ampliamente conocido por su entorno de desarrollo integrado multiplataforma (IDE). Los paquetes de Arch Linux (y esta guía) se relacionan específicamente con el IDE.\n\nEl IDE de Eclipse está escrito principalmente en Java, pero se puede usar para desarrollar aplicaciones en varios lenguajes, incluidos Java, C/C++, PHP, Perl y Python. El IDE también puede proporcionar soporte de subversión y administración de tareas.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale uno de los siguientes paquetes:\n\n- eclipse-jeeAUR[enlace roto: package not found] para Desarrolladores Java EE\n- eclipse-javaAUR[enlace roto: package not found] para Desarrolladores Java\n- eclipse-cppAUR[enlace roto: package not found] para Desarrolladores C/C++\n- eclipse-phpAUR[enlace roto: package not found] para Desarrolladores PHP\n- eclipse-javascriptAUR[enlace roto: package not found] para Desarrolladores JavaScript\n\nNo puede instalar múltiples de estos al mismo tiempo ya que entran en conflicto, ver FS#45577: elija el paquete que más se ajusta a sus necesidades, y luego agregue soporte para cualquier idioma adicional requerido a través de #Complementos.\n\n"
    },
    {
      "title": "Complementos",
      "level": 2,
      "content": "Muchos complementos se instalan fácilmente usando pacman (ver Eclipse plugin package guidelines (Español) para mayor información). Esto también los mantendrá actualizados. Alternativamente, puede elegir entre Eclipse Marketplace o la terminal Administrador de complementos.\n\n"
    },
    {
      "title": "Agregar el sitio de actualización predeterminado",
      "level": 3,
      "content": "Asegúrese de verificar que el sitio de actualización predeterminado para su versión de Eclipse esté configurado para que las dependencias del complemento puedan instalarse automáticamente. La versión más reciente de Eclipse es Photon y el sitio de actualización predeterminado es: https://download.eclipse.org/releases/photon. Vaya a Ayuda> Instalar nuevo software> Agregar, complete el nombre para luego identificar fácilmente el sitio de actualización, por ejemplo, Photon Software Repository, y complete la ubicación con la url.\n\n"
    },
    {
      "title": "Eclipse Marketplace",
      "level": 3,
      "content": "Para usar Eclipse Marketplace, instálelo primero: vaya a Ayuda> Instalar nuevo software> Cambiar al sitio de actualización predeterminado> Herramientas de propósito general> Cliente de Marketplace. Reinicie Eclipse y estará disponible en Ayuda > Eclipse Marketplace.\n\n"
    },
    {
      "title": "Administrador de complementos",
      "level": 3,
      "content": "Utilice el administrador de complementos de Eclipse para descargar e instalar complementos desde sus repositorios originales: en este caso debe encontrar el repositorio necesario en el sitio web del complemento, luego vaya a Ayuda> Instalar nuevo software..., ingrese el repositorio en el campo Trabajar con , seleccione el complemento para instalar de la lista a continuación y siga las instrucciones.\n\n- Si instala complementos con el administrador de complementos de Eclipse, se le recomienda iniciar Eclipse como root: de esta manera los complementos se instalarán en /usr/lib/eclipse/plugins/; si los instaló como usuario normal, se almacenarán en una carpeta de versión dependiente dentro de ~/.eclipse/, y, después de actualizar Eclipse, ya no serían reconocidos\n- No use Eclipse como root para su trabajo diario.\n\n"
    },
    {
      "title": "Actualizaciones a través del administrador de complementos",
      "level": 4,
      "content": "Ejecute Eclipse y seleccione Ayuda> Buscar actualizaciones . Si los ha instalado como root como se recomienda en la sección anterior, debe ejecutar Eclipse como root.\n\nPara que los complementos se actualicen, debe verificar que sus repositorios de actualización estén habilitados en Ventana> Preferencias> Instalar / Actualizar> Sitios de software disponibles : puede encontrar los repositorios de cada plugin en el sitio web del proyecto respectivo. Para agregar, editar, eliminar ... los repositorios solo usan los botones a la derecha del panel Sitios de software disponibles . Para Eclipse 4.5 (Marte), verifique que haya habilitado este repositorio:\n\n```\nhttps://download.eclipse.org/releases/mars\n```\n\nPara recibir notificaciones de actualización, vaya a Ventana> Preferencias> Instalar / Actualizar> Actualizaciones automáticas . Si desea recibir notificaciones de plugins instalados como root, se debe ejecutar Eclipse como root, vaya a Ventana> Preferencias> Instalar / Actualizar> Sitios disponibles sobre software , seleccionar los repositorios relacionados con los plugins instalados y Exportar' ', luego ejecutar Eclipse como usuario normal e \"Importarlos\" en el mismo panel.\n\n"
    },
    {
      "title": "Lista de complementos",
      "level": 3,
      "content": "- AVR — complemento de microcontrolador AVR.\n\n- Aptana — soporte HTML5/CSS3/JavaScript/Ruby/Rails/PHP/Pydev/Django. También disponible como aplicación independiente.\n\n- IvyDE — administrador de dependencias IvyDE.\n\n- Markdown — editor de complementos para Eclipse Markdown.\n\n- PyDev — soporte Python (Español).\n\n- Subclipse — soporte Subversion (Español).\n\n- Subversive — Soporte alternativo de Subversion.\n\n- TestNG — soporte TestNG.\n\n- TeXlipse — soporte TeX Live (Español).\n\n- Checkstyle — Soporte de Eclipse Checkstyle.\n\n"
    },
    {
      "title": "Habilitar la integración de javadoc",
      "level": 2,
      "content": "¿Desea ver las entradas de la API al colocar el puntero del mouse sobre los métodos estándar de Java?\n\n"
    },
    {
      "title": "Versión en linea",
      "level": 3,
      "content": "Si tiene acceso constante a Internet en su máquina, puede usar la documentación en línea:\n\n1. Vaya a Ventana> Preferencias , luego vaya a Java> JRE instalados .\n1. Debería haber uno llamado \"java\" con el tipo \"VM estándar\". Seleccione esto y haga clic en Editar .\n1. Seleccione el elemento /opt/java/jre/lib/rt.jar en \"Bibliotecas de sistema de JRE:\", luego haga clic en \"Ubicación de Javadoc ...\".\n1. Ingrese \"https://docs.oracle.com/javase/8/docs/api/\" en el campo de texto \"Ruta de ubicación de Javadoc:\".\n\n"
    },
    {
      "title": "Versión fuera de línea",
      "level": 3,
      "content": "Puede almacenar la documentación localmente instalando el paquete openjdk8-doc. Eclipse puede encontrar los javadocs automáticamente. Si eso no funciona, configure la ubicación de Javadoc para rt.jar en file:/usr/share/doc/java8-openjdk/api.\n\n"
    },
    {
      "title": "Ctrl+X cierra Eclipse",
      "level": 3,
      "content": "Parte de este error. Solo busque en ~/workspace/.metadata/.plugins/org.eclipse.e4.workbench/workbench.xmi y elimine la combinación incorrecta de Ctrl + X. Por lo general, es el primero.\n\n"
    },
    {
      "title": "Tema oscuro",
      "level": 3,
      "content": "Eclipse proporciona un tema oscuro que se puede habilitar en Ventana> Preferencias> General> Apariencia y seleccionando el tema \"Oscuro\". El tema oscuro usa sus propios colores en lugar de los colores del tema GTK, si prefiere respetar completamente la configuración de color GTK, quite o mueva a la subcarpeta de respaldo todos los archivos .css de /usr/share/eclipse/plugins/org.eclipse.ui.themes_1.0.0.xxxx/css/.\n\n"
    },
    {
      "title": "Cambiar el tamaño de fuente del título predeterminado de la ventana",
      "level": 3,
      "content": "No puede cambiar el tamaño de la fuente del título de la ventana con las preferencias de Eclipse, debe editar los archivos .css del tema real. Tenga en cuenta que tendrá que volver a hacer esto cuando actualice Eclipse. Están ubicados debajo\n\n```\n/usr/share/eclipse/plugins/org.eclipse.platform_4.3.<su número de versión>/css\n```\n\nAbra el archivo apropiado con su editor de texto, es decir, e4_default_gtk.css si está utilizando el \"tema GTK\". Busque .MPartStack y cambie el tamaño de la fuente al tamaño deseado.\n\n```\n.MPartStack {\n       font-size: 9;\n       swt-simple: false;\n       swt-mru-visible: false;\n}\n```\n\n"
    },
    {
      "title": "Deshabilitar GTK+ 3",
      "level": 3,
      "content": "Cuando la interfaz de usuario SWT GTK + 3 tiene errores y, a veces, no se puede utilizar, puede intentar desactivar el uso de GTK + 3 con SWT_GTK3 = 0 Environment variables (Español) cuando se inicia eclipse:\n\nOtra opción para lograr el mismo efecto es agregar lo siguiente a /usr/lib/eclipse/eclipse.ini.\n\n```\n--launcher.GTK_version\n2\n```\n\nEsas dos líneas se deben agregar 'antes de' :\n\n```\n--launcher.appendVmargs\n```\n\n"
    },
    {
      "title": "Freshplayerplugin",
      "level": 3,
      "content": "Eclipse no es compatible con freshplayerpluginAUR. Ver https://github.com/i-rinat/freshplayerplugin/issues/298.\n\n"
    },
    {
      "title": "Eclipse 4.6 no puede abrir marketplace adecuadamente",
      "level": 3,
      "content": "Ver este error. Puede seguir los dos pasos siguientes para solucionarlo:\n\n```\neclipse -consoleLog -application org.eclipse.equinox.p2.director -uninstallIU org.apache.httpcomponents.httpclient/4.3.6.v201411290715\ncd /usr/lib/eclipse/ && sudo rm plugins/org.apache.httpcomponents.httpclient_4.3.6.v201411290715.jar\n```\n\n"
    },
    {
      "title": "Mostrar en el Explorador del sistema no funciona",
      "level": 3,
      "content": "Ver ésta guía. Ir a 'Ventana' > 'Preferencias' > 'General' > 'Área de trabajo' y cambie el explorador del sistema de ejecución de comandos. Como usuario de Xfce, puede cambiarlo a thunar $ {selected_resource_uri} para abrir la carpeta seleccionada con thunar.\n\n"
    },
    {
      "title": "Muestra problemas en Wayland",
      "level": 3,
      "content": "Al ejecutar Eclipse en Wayland, puede encontrar problemas de renderizado, como un tiempo de respuesta lento a los eventos del mouse o ventanas de diálogo cortadas (informe de errores [1]). Una solución posible para este problema es forzar a Eclipse a ejecutar bajo Xwayland.\n\nCon el superusuario, abrir el archivo /usr/bin/eclipse y anexar esta línea antes de la línea exec:\n\n```\nexport GDK_BACKEND=x11\n```\n\nEsto forzará la ejecución de Eclipse en Xwayland.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- ¿Cómo usar Subversion con Eclipse?\n\n"
    }
  ]
}