{
  "title": "Eclipse (Português)",
  "url": "https://wiki.archlinux.org/title/Eclipse_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Eclipse é um projeto comunitário de código aberto, que visa fornecer uma plataforma de desenvolvimento universal. O projeto Eclipse é mais conhecido por seu IDE (ambiente de desenvolvimento integrado) multiplataforma. Os pacotes do Arch Linux (e este guia) estão relacionados especificamente ao IDE.\n\nO Eclipse IDE é amplamente escrito em Java, mas pode ser usado para desenvolver aplicativos em várias linguagens, incluindo Java, C / C++, PHP, Perl, Rust e Python. O IDE também pode fornecer suporte ao subversion e gerenciamento de tarefas.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale um dos seguintes pacotes:\n\n- eclipse-jeeAUR[link quebrado: package not found] para desenvolvedores Java EE\n- eclipse-javaAUR[link quebrado: package not found] para desenvolvedores Java\n- eclipse-cppAUR[link quebrado: package not found] para desenvolvedores C/C++\n- eclipse-phpAUR[link quebrado: package not found] para desenvolvedores PHP\n- eclipse-javascriptAUR[link quebrado: package not found] para JavaScript e desenvolvedores Web\n- eclipse-rustAUR[link quebrado: package not found] para desenvolvedores Rust\n\nVocê não pode instalar vários deles ao mesmo tempo, pois eles conflitam, consulte FS#45577: escolha o pacote acima do qual atenda imediatamente às suas necessidades e adicione suporte para os idiomas adicionais necessários através #Plugins.\n\n"
    },
    {
      "title": "Plugins",
      "level": 2,
      "content": "Muitos plugins são facilmente instalados usando pacman (veja Diretrizes de pacotes de plugin do Eclipse para mais informações). Isso também os manterá atualizados. Como alternativa, você pode escolher o Eclipse Marketplace ou o gerenciador de plugins interno.\n\n"
    },
    {
      "title": "Adicionar o site de atualização padrão",
      "level": 3,
      "content": "Certifique-se de verificar se o site de atualização padrão para sua versão do Eclipse está configurado para que as dependências do plugin possam ser instaladas automaticamente. A versão mais atual do Eclipse é o Photon e o site de atualização padrão é: https://download.eclipse.org/releases/photon. Vá para Help > Install New Software > Add, preencha o nome para identificar facilmente o site de atualização posteriormente - por exemplo, Photon Software Repository - e preencha o local com o URL.\n\n"
    },
    {
      "title": "Eclipse Marketplace",
      "level": 3,
      "content": "Para usar o Eclipse Marketplace, instale primeiro: vá para Help > Install new software > Switch to the default update site > General Purpose Tools > Marketplace Client. Reinicie o Eclipse e ele estará disponível em Help > Eclipse Marketplace.\n\n"
    },
    {
      "title": "Gerenciador de plugins",
      "level": 3,
      "content": "Use o gerenciador de plugins do Eclipse para baixar e instalar plugins de seus repositórios originais: nesse caso, você precisa encontrar o repositório necessário no site do plugin e, em seguida, vá para Help > Install New Software..., insira o repositório no campo Work with, selecione o plug-in para instalar na lista abaixo e siga as instruções.\n\n- Se você instalar plug-ins com o gerenciador de plug-ins do Eclipse, é recomendável iniciar o Eclipse como root: dessa maneira, os plug-ins serão instalados em /usr/lib/eclipse/plugins/; se você os instalasse como usuário normal, eles seriam armazenados em uma pasta dependente da versão dentro ~/.eclipse/, e, após o upgrade do Eclipse, eles não seriam mais reconhecidos.\n- Não use o Eclipse como root para o seu trabalho diário.\n\n"
    },
    {
      "title": "Atualizações via gerenciador de plugins",
      "level": 4,
      "content": "Abra o Eclipse e vá em Help > Check for Updates. Se você os instalou como root, conforme recomendado na seção acima, precisará executar o Eclipse como root.\n\nPara que os plug-ins sejam atualizados, verifique se os repositórios de atualização estão ativados em Window > Preferences > Install/Update > Available Software Sites: você pode encontrar os repositórios de cada plug-in no respectivo site do projeto. Para adicionar, editar, remover ... repositórios, basta usar os botões à direita do painel Available Software Sites. Para o Eclipse 4.5 (Mars), verifique se você ativou este repositório:\n\n```\nhttps://download.eclipse.org/releases/mars\n```\n\nPara receber notificações de atualização, vá para Window > Preferences > Install/Update > Automatic Updates. Se você deseja receber notificações para plug-ins instalados como root, execute o Eclipse como root, vá para Window > Preferences > Install/Update > Available Software Sites, selecione os repositórios relacionados aos plugins instalados e Export eles, execute o Eclipse como usuário normal e Import eles no mesmo painel.\n\n"
    },
    {
      "title": "Lista de plugins",
      "level": 3,
      "content": "- AVR — Plugin microcontrolador AVR.\n\n- Aptana — Suporte a HTML5/CSS3/JavaScript/Ruby/Rails/PHP/Pydev/Django. Também disponível como aplicativo independente.\n\n- IvyDE — Gerenciador de dependências IvyDE.\n\n- Markdown — Plugin editor de Markdown para Eclipse.\n\n- PyDev — Suporte a Python.\n\n- Subclipse — Suporte a Subversion.\n\n- Subversive — Suporte alternativo a Subversion.\n\n- TestNG — Suporte a TestNG support.\n\n- TeXlipse — Suporte a LaTeX.\n\n- Checkstyle — Suporte a Eclipse Checkstyle.\n\n"
    },
    {
      "title": "Ativar integração javadoc",
      "level": 2,
      "content": "Deseja ver as entradas da API ao passar o mouse sobre os métodos Java padrão?\n\n"
    },
    {
      "title": "Versão online",
      "level": 3,
      "content": "Se você tiver acesso constante à Internet em sua máquina, poderá usar a documentação on-line:\n\n1. Vá para Window > Preferences, então vá para Java > Installed JREs.\n1. Deve haver um chamado \"java\" com o tipo \"Standard VM\". Selecione e clique em Edit.\n1. Selecione o item em /usr/lib/jvm/java-8-openjdka/jre/lib/rt.jar em \"JRE system libraries:\" e clique em Javadoc Location....\n1. Digite \"https://docs.oracle.com/javase/8/docs/api/\" no campo de texto \"Javadoc location path:\".\n\n"
    },
    {
      "title": "Versão offline",
      "level": 3,
      "content": "Você pode armazenar a documentação localmente instalando o pacote openjdk8-doc. O Eclipse pode encontrar os javadocs automaticamente. Se isso não funcionar, configure o local do Javadoc para rt.jar para file:/usr/share/doc/java8-openjdk/api.\n\n"
    },
    {
      "title": "Ctrl+X fecha Eclipse",
      "level": 3,
      "content": "Isso é parte deste bug. Basta procurar em ~/workspace/.metadata/.plugins/org.eclipse.e4.workbench/workbench.xmi e excluir a combinação Ctrl+X errada. Geralmente é o primeiro.\n\n"
    },
    {
      "title": "Tema escuro",
      "level": 3,
      "content": "O Eclipse fornece um tema Escuro que pode ser ativado em Window > Preferences > General > Appearance e selecione o tema Dark.\n\nO tema escuro usa suas próprias cores, e não as cores do tema GTK, se você preferir respeitar totalmente as configurações de cores GTK, remova ou mova para a subpasta de backup todos os arquivos .css de /usr/lib/eclipse/plugins/org.eclipse.ui.themes_versão/css/, substituindo versão com o número de versão apropriado.\n\n"
    },
    {
      "title": "Alterar tamanho da fonte do título da janela padrão",
      "level": 3,
      "content": "Não é possível alterar o tamanho da fonte do título da janela usando as preferências do Eclipse; você deve editar os arquivos .css do tema. Estes estão localizados no diretório /usr/lib/eclipse/plugins/org.eclipse.themes_versão/css/, sendo versão o número da versão do tema.\n\nUse um editor de texto para editar o arquivo apropriado, ou seja, e4_default_gtk.css se você estiver usando o tema GTK.\n\nNeste arquivo, pesquise por .MPartStack e altere o tamanho da fonte para o tamanho desejado:\n\n```\n.MPartStack {\n       font-size: 9;\n       swt-simple: false;\n       swt-mru-visible: false;\n}\n```\n\n"
    },
    {
      "title": "Desativar GTK 3",
      "level": 3,
      "content": "Se a interface do usuário do SWT GTK 3 apresentar erros ou ficar inutilizável, ela pode ser desativada anexando a variável de ambiente SWT_GTK3=0 ao iniciar o Eclipse:\n\n```\nSWT_GTK3=0 eclipse\n```\n\nOutra opção para obter o mesmo efeito é adicionar o seguinte ao arquivo ini do Eclipse, antes de --launcher.appendVmargs::\n\n```\n/usr/lib/eclipse/eclipse.ini\n```\n\n```\n--launcher.GTK_version\n2\n```\n\n"
    },
    {
      "title": "Freshplayerplugin",
      "level": 3,
      "content": "Eclipse não é compatível com freshplayerpluginAUR. Veja https://github.com/i-rinat/freshplayerplugin/issues/298.\n\n"
    },
    {
      "title": "Eclipse 4.6 não pode abrir a propriedade marketplace",
      "level": 3,
      "content": "Veja this bug. Você pode seguir duas etapas para corrigi-lo:\n\n```\neclipse -consoleLog -application org.eclipse.equinox.p2.director -uninstallIU org.apache.httpcomponents.httpclient/4.3.6.v201411290715\ncd /usr/lib/eclipse/ && sudo rm plugins/org.apache.httpcomponents.httpclient_4.3.6.v201411290715.jar\n```\n\n"
    },
    {
      "title": "Mostrar no System Explorer não funciona",
      "level": 3,
      "content": "Veja esse guia this. Vá para Window > Preferences > General > Workspace e altere o comando ativando o system explorer. Como usuário do Xfce, você pode alterá-lo para thunar ${selected_resource_uri} para abrir a pasta selecionada com thunar.\n\n"
    },
    {
      "title": "Exibir problemas em Wayland",
      "level": 3,
      "content": "Ao executar o Eclipse em Wayland, você pode encontrar problemas de renderização, como tempo de resposta lento a eventos do mouse ou janelas de diálogo cortadas (Bug report [1]). Uma solução possível para esse problema é forçar o Eclipse a executar no Xwayland.\n\nCom o superusuário, abra o arquivo /usr/bin/eclipse e anexe esta linha antes da linha exec:\n\n```\nexport GDK_BACKEND=x11\n```\n\nIsso forçará a execução do Eclipse no Xwayland.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Como usar o Subversion com o Eclipse (inglês)\n\n"
    }
  ]
}