{
  "title": "Effective Use of Headers",
  "url": "https://wiki.archlinux.org/title/Effective_Use_of_Headers",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Help:Article naming guidelines\n- Help:Writing article introductions\n- Help:Editing\n- Help:Style\n\nThis article was written to assist wiki writers and editors in creating effective articles and expand the ArchWiki readers' experience.\n\nYou are not required to know how to edit a wiki page in order to follow this article. This page is a more general style guide, rather than a technical editing HOWTO.\n\n"
    },
    {
      "title": "About article headers",
      "level": 2,
      "content": "Headers mark the start of a new section. Sections may be organized in a tree form with some sections nested within other sections. To reflect the section structure, headers may be formatted differently. Sections and corresponding headers are divided into levels depending on their place relative to other sections.\n\n"
    },
    {
      "title": "Terms used in this article",
      "level": 3,
      "content": "A section that is contained within another section is said to be of a lower level than its container (or parent). Therefore the parent is of a higher level.\n\nEach header with the text spanning to the next header of the same level is called a heading.\n\nHeadings have numbers that describe their level in the tree. Higher level headings have lower numbers, and vice versa. For example, the article's title on ArchWiki is heading level 1.\n\n"
    },
    {
      "title": "Use of headers and headings",
      "level": 3,
      "content": "Headers and headings serve a couple of important purposes:\n\n- they slow readers down for better absorption of information\n- they group parts of the article into logical units\n- they mark important pieces of text\n\n"
    },
    {
      "title": "Slowing down the reader",
      "level": 4,
      "content": "When presenting your topic to readers, you must know that it takes some time to read even through shortest articles. A header may serve as a buffer to slow down the reader before reading the following section. This slow-down allows the reader to think about the content and prepare themself for the following text.\n\n"
    },
    {
      "title": "Grouping paragraphs into subtopics",
      "level": 4,
      "content": "Most of the time, your article will not treat just one topic, and you will need to visit some more or less related topics in order to explain and expand your main topic. Such visits may be confusing when a reader is trying to scan through the article. Therefore, you need to signal for such deviations.\n\n"
    },
    {
      "title": "Marking important parts",
      "level": 4,
      "content": "Sometimes, readers just want to look through the table of contents (TOC) in order to identify parts of the article that are of special interest. They may also do so by looking at the headers themselves. In both cases, clearly defined headers serve the purpose of quick identification of important sections of your article. Moreover, TOC is created by automatically listing the headings in your article.\n\n"
    },
    {
      "title": "About heading levels",
      "level": 2,
      "content": "There are some important things to note when talking about heading levels.\n\n"
    },
    {
      "title": "Headings of the same level should have equal significance",
      "level": 3,
      "content": "This may sound self-explanatory, but it is not quite as straightforward as it seems. Consider this example:\n\n- Introduction\n- Step 1: Installing X\n- Step 2: Editing keyboard settings\n- Step 3: Editing mouse settings\n- Step 4: Editing display settings\n- Step 5: Adding fglrx options\n- Step 6: Starting X\n- Conclusions\n\nIf you carefully analyze this list, you will notice that steps 2 to 4 are actually of less significance than steps 1 and 6, and that step 5 is of least significance. This is not to say that all those steps have more or less text than the others. It is the conceptual significance that is important.\n\nTo amend this, we will modify the headings like so:\n\n- Introduction\n- Step 1: Installing X\n- Step 2: Configuring X Step 2a: Editing keyboard settings Step 2b: Editing mouse settings Step 2c: Editing display settings Step 2c-1: Adding fglrx options\n- Step 3: Starting X\n- Conclusions\n\n- Step 2a: Editing keyboard settings\n- Step 2b: Editing mouse settings\n- Step 2c: Editing display settings Step 2c-1: Adding fglrx options\n\n- Step 2c-1: Adding fglrx options\n\nAs you can see, we have merged steps 2 to 4 into a single heading titled Configuring X, and divided the heading into 3 subheadings. Also, we have attached the step 5 to step 2c, and turned it into a subheading.\n\n"
    },
    {
      "title": "Top level headings should always be of highest level",
      "level": 3,
      "content": "This may also sound like common sense, but there is one little problem. The headers have formatting style associated with them. Many people use those associated formatting rules to manipulate how their article looks. This in turns yield a broken heading structure.\n\nLet us take a look at this example:\n\n- Introduction\n- Step 1\n- Step 2\n- Step 3 Conclusion\n\n- Conclusion\n\nThe author of the article thought level 1 headings was too large for such an unimportant section like Conclusion and it would be a better idea to use level 2 headings. This results in a heading structure that has the last section one level below the other sections. The correct structure would be:\n\n- Introduction\n- Step 1\n- Step 2\n- Step 3\n- Conclusion\n\nThe conclusion is now in line with the rest of the article.\n\n"
    },
    {
      "title": "Types of heading structures",
      "level": 2,
      "content": "Based on the number of levels used and their purpose, heading structure may be divided into following categories:\n\n1. Single-level structure\n1. False multi-level structure\n1. Multi-level structure\n\n"
    },
    {
      "title": "Single-level structure",
      "level": 3,
      "content": "When writing an article, the most straightforward way is to divide it into steps. Those steps may not necessarily be real steps, something that readers need to take. They may be steps that a writer takes in developing his article. In any case, those steps follow one another and are arranged in a single-level structure.\n\nA typical setup of this kind may look like this:\n\n- Introduction\n- Step 1: doing this or the other\n- Step 2: cleaning up\n- Step 3: troubleshooting\n- Further reading\n\nThis is what a simple 3-step HOWTO with introduction and references may look.\n\n"
    },
    {
      "title": "False multi-level structure",
      "level": 3,
      "content": "Sometimes, there is a need to deviate from the simple and flowing single-level structure.\n\n"
    },
    {
      "title": "Side-note",
      "level": 4,
      "content": "Usually, you need to deviate shortly from the main flow to elaborate on something.\n\n- Introduction\n- Step 1: doing this or the other Notes on configuring XYZ\n- Step 2: cleaning up\n- Step 3: troubleshooting\n- Further reading\n\n- Notes on configuring XYZ\n\nConsider this an alternative to adding notes and comments via the Note template.\n\n"
    },
    {
      "title": "Mark auxiliary information",
      "level": 4,
      "content": "Maybe you want to add a marker to some important part that acts as a additional argument to main discussion, or enhances the main discussion in some other way.\n\n- Introduction\n- Step 1: doing this or the other Here is the sample code\n- Step 2: cleaning up Here is the sample code\n- Step 3: troubleshooting Here is the sample code\n- Further reading\n\n- Here is the sample code\n\n- Here is the sample code\n\n- Here is the sample code\n\n"
    },
    {
      "title": "Multi-level structure",
      "level": 3,
      "content": "Multi-level structure is typical of longer, more in-depth articles. However, it may also be effectively used in shorter HOWTOs.\n\nHere are some cases when a multi-level structure may come in handy.\n\n"
    },
    {
      "title": "Group arguments together",
      "level": 4,
      "content": "Subheadings can be to main headings what headings are to the entire article.\n\nAn example:\n\n- Introduction\n- Step 1: doing this or the other\n- Step 2: cleaning up First do this Then do that You're done!\n- Step 3: troubleshooting\n- Further reading\n\n- First do this\n- Then do that\n- You're done!\n\n"
    },
    {
      "title": "Alternative arguments",
      "level": 4,
      "content": "Sometimes, you need to give your readers a few different angles on a subject.\n\nFor example:\n\n- Introduction\n- Step 1: doing this or the other This is one way to do it This is another way to do it\n- Step 2: cleaning up\n- Step 3: troubleshooting\n- Further reading\n\n- This is one way to do it\n- This is another way to do it\n\n"
    },
    {
      "title": "Contradictory argument",
      "level": 4,
      "content": "If you need to talk about opposing arguments, you may give each party a subheading of its own.\n\nFor instance:\n\n- Introduction\n- Step 1: doing this or the other You want this There are reasons for not wanting this, though\n- Step 2: cleaning up\n- Step 3: troubleshooting\n- Further reading\n\n- You want this\n- There are reasons for not wanting this, though\n\n"
    },
    {
      "title": "The header text",
      "level": 2,
      "content": "We will summarize some of the key points here, and if you want a more detailed account, you may read Help:Article naming guidelines. The rules listed here apply to both header texts and article names.\n\n- Header texts should be as specific as possible, and they should reflect the heading's scope\n- Header texts should be general enough to allow for future enhancement of headings\n- Header texts should be as short as possible (also see Help:Article naming guidelines)\n\n"
    },
    {
      "title": "Formatting",
      "level": 2,
      "content": "As we already noted, it is crucial not to abuse header formatting styles to beautify your articles. If you do not like what you see, contact the admins or sysops and ask for their opinion, or offer to fix the situation in a manner that would not compromise the heading structures.\n\nTo mark some text as a heading, two or more equal signs (==) must be used.\n\nNote: **reserved** \n\nHere is the code for marking headers:\n\n```\n== Header level 2 ==\n\n=== Header level 3 ===\n\n==== Header level 4 ====\n\n===== Header level 5 =====\n\n====== Header level 6 ======\n```\n\nIf you want to see how these are formatted, you may use the Sandbox. For the related style conventions, see Help:Style#Section headings.\n\n"
    }
  ]
}