{
  "title": "Elinks (Português)",
  "url": "https://wiki.archlinux.org/title/Elinks_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "ELinks é um navegador web (HTTP/FTP/...) avançado e bem estabelecido, rico em funcionalidades e à base de texto. O ELinks pode renderizar tanto frames como tabelas, é altamente personalizável e pode ser estendido através de scripts em Lua ou Guile. Este possui separadores e algum suporte básico para CSS.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote elinks.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Veja elinks(1).\n\nNavegar na web com um navegador de texto é mais ou menos o mesmo que com um navegador gráfico, apenas sem as 'distrações'. Depois de abrir o elinks, pode premir g e escrever a página Web que pretende aceder. Depois pode navegar na página usando as setas do teclado para navegar linha a linha, a barra de espaço para saltar uma página, ou as teclas j e k para saltar de link para link.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "O ELinks fornece dois menus, acessíveis através do ELinks, para personalizar opções e atalhos de teclado, respetivamente.\n\nÉ recomendado usar estas ferramentas ao invés de editar manualmente os ficheiros de configuração (que são colocados em ~/.elinks). Esta forma é muito mais fácil e segura.\n\nA tecla o abre o gerenciador de opções e a tecla k o gerenciador de atalhos de teclado.\n\n"
    },
    {
      "title": "Definindo manipuladores de URL",
      "level": 3,
      "content": "O ELinks é capaz de usar programas externos para várias tarefas,\n\nDefinir manipuladores de URLs através do menu de opções pode ser um pouco confuso no início.\n\nPara fazer isso, vá até o gerenciador de opções e navegue até MIME. Todos os submenus têm páginas de informação para o ajudar.\n\nEste é um dos poucos casos em que pode ser mais fácil editar o ficheiro de configuração à mão.\n\nPor exemplo, para que o ELinks abra automaticamente o seu visualizador de imagens quando clicar num ficheiro JPEG, pode adicionar o seguinte ao seu ficheiro ~/.elinks/elinks.conf,\n\n```\n~/.elinks/elinks.conf\n```\n\n```\nset mime.extension.jpg=\"image/jpeg\"\nset mime.extension.jpeg=\"image/jpeg\"\nset mime.extension.png=\"image/png\"\nset mime.extension.gif=\"image/gif\"\nset mime.extension.bmp=\"image/bmp\"\n\nset mime.handler.image_viewer.unix.ask = 1\nset mime.handler.image_viewer.unix-xwin.ask = 0\n\nset mime.handler.image_viewer.unix.block = 1\nset mime.handler.image_viewer.unix-xwin.block = 0\n\nset mime.handler.image_viewer.unix.program = \"pictureviewer %\"\nset mime.handler.image_viewer.unix-xwin.program = \"pictureviewer %\"\n\nset mime.type.image.jpg = \"image_viewer\"\nset mime.type.image.jpeg = \"image_viewer\"\nset mime.type.image.png = \"image_viewer\"\nset mime.type.image.gif = \"image_viewer\"\nset mime.type.image.bmp = \"image_viewer\"\n```\n\nO ELinks não suporta SOCKS diretamente. Alternativamente, pode invocar o ELinks através do torify elinks, ou instalar o pacote privoxy para encaminhamento para o proxy SOCKS do Tor, primeiro adicionando a seguinte linha ao seu /etc/privoxy/config:\n\n```\nforward-socks5 / localhost:9050 .\n```\n\nReiniciar privoxy.service, então insira as seguintes linhas em seu ~/.elinks/elinks.conf:\n\n```\nset protocol.http.proxy.host = \"127.0.0.1:8118\"\nset protocol.https.proxy.host = \"127.0.0.1:8118\"\n```\n\nNote: **9050** \n\n"
    },
    {
      "title": "Passando URL's para comandos externos",
      "level": 3,
      "content": "Você pode definir comandos para os quais o ELinks passará o URL atual.\n\nPara fazer isso, vá no menu de opções, navegue em Documento, e então em Passagem de URI. Depois prima a para adicionar um novo nome de comando. Depois, navega até ao novo nome do comando e prime e para o editar. Escreve o nome do comando, dá enter e guarde.\n\nAssumindo que o comando \"tab-external-command\" está mapeado para KEY, sempre que pressionar KEY, aparecerá um menu com os seus comandos. Seleccione o que pretende, e o ELinks passa o URL atual para esse comando.\n\n"
    },
    {
      "title": "Salvando o link para a área de transferência do X",
      "level": 4,
      "content": "```\necho -n %c | xclip -i\n```\n\n"
    },
    {
      "title": "Passando links do YouTube através de um player externo",
      "level": 4,
      "content": "Para links estritamente do YouTube, mpv tem suporte embutido. Basta usar o seguinte comando:\n\n```\nmpv %c\n```\n\nPara uma abordagem mais geral que pode lidar com muitos sites 'tube', você precisará de youtube-dlAUR. Então adicione o seguinte comando,\n\n```\nyoutube-dl -o - %c | mplayer -\n```\n\n"
    },
    {
      "title": "O ELinks congela constantemente",
      "level": 3,
      "content": "Por defeito, sempre que inicia o ELinks está a ligar-se a uma instância existente. Assim, se essa instância congelar, todas as instâncias atuais e futuras também congelarão.\n\nVocê pode evitar que o ELinks se conecte a uma instância existente iniciando-o desta forma:\n\n```\n$ elinks -no-connect\n```\n\nSe isto acontecer muitas vezes, você pode considerar tornar esta a sua inicialização padrão, criando uma alias na shell:\n\n```\nalias elinks=\"elinks -no-connect\"\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Site oficial\n- Howto: Use o elinks como um profissional\n\n"
    }
  ]
}