{
  "title": "ELinks (Français)",
  "url": "https://wiki.archlinux.org/title/ELinks_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "ELinks est un navigateur web en mode texte (HTTP/FTP/...) avancé et bien établi, riche en fonctionnalités. ELinks peut rendre à la fois des cadres et des tableaux, est hautement personnalisable et peut être étendu par des scripts Lua ou Guile. Il comporte des onglets et prend en charge les CSS.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet elinks.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "Consultez elinks(1).\n\n"
    },
    {
      "title": "Navigation",
      "level": 3,
      "content": "La navigation sur le web avec un navigateur texte est plus ou moins la même qu'avec un navigateur graphique, mais sans les \"distractions\". Une fois que vous avez lancé elinks, vous pouvez appuyer sur g et taper la page Web que vous souhaitez obtenir. Vous pouvez ensuite naviguer dans la page en utilisant les touches fléchées pour naviguer par ligne, la barre d'espacement pour naviguer par page, ou les touches j et k pour naviguer par lien.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "ELinks fournit deux menus, accessibles par ELinks, pour personnaliser respectivement les options et les raccourcis clavier.\n\nIl est recommandé d'utiliser ces outils plutôt que d'éditer manuellement les fichiers de configuration (qui sont placés dans ~/.elinks). C'est à la fois beaucoup plus facile et plus sûr de cette manière.\n\nPar défaut, la touche o ouvre le gestionnaire d'options et la touche k le gestionnaire de keybind.\n\n"
    },
    {
      "title": "Définir des gestionnaires d'URL",
      "level": 3,
      "content": "ELinks est capable d'utiliser des programmes externes pour diverses tâches.\n\nDéfinir des URL-handlers par le biais du menu option peut être un peu déroutant au début, mais une fois que vous l'avez compris, c'est très bien.\n\nPour ce faire, allez dans le gestionnaire d'options et naviguez jusqu'à MIME. Tous les sous-menus ont des pages Info pour vous aider.\n\nC'est l'un des rares cas où il peut être plus facile de modifier le fichier de configuration.\n\nPar exemple, pour que ELinks lance automatiquement votre visionneuse d'images lorsque vous cliquez sur un fichier JPEG, vous pouvez ajouter ce qui suit à votre fichier ~/.elinks/elinks.conf,\n\n```\n~/.elinks/elinks.conf\n```\n\n```\nset mime.extension.jpg=\"image/jpeg\"\nset mime.extension.jpeg=\"image/jpeg\"\nset mime.extension.png=\"image/png\"\nset mime.extension.gif=\"image/gif\"\nset mime.extension.bmp=\"image/bmp\"\n\nset mime.handler.image_viewer.unix.ask = 1\nset mime.handler.image_viewer.unix-xwin.ask = 0\n\nset mime.handler.image_viewer.unix.block = 1\nset mime.handler.image_viewer.unix-xwin.block = 0\n\nset mime.handler.image_viewer.unix.program = \"pictureviewer %\"\nset mime.handler.image_viewer.unix-xwin.program = \"pictureviewer %\"\n\nset mime.type.image.jpg = \"image_viewer\"\nset mime.type.image.jpeg = \"image_viewer\"\nset mime.type.image.png = \"image_viewer\"\nset mime.type.image.gif = \"image_viewer\"\nset mime.type.image.bmp = \"image_viewer\"\n```\n\n"
    },
    {
      "title": "Utilisation de Tor",
      "level": 3,
      "content": "ELinks ne prend pas en charge SOCKS directement. Les alternatives sont soit d'invoquer ELinks via torify elinks, soit d'installer le paquet privoxy pour la redirection vers le proxy SOCKS de Tor, en ajoutant la ligne suivante à votre /etc/privoxy/config :\n\n```\nforward-socks5 / localhost:9050 .\n```\n\nRedémarrez privoxy.service, puis ajoutez les lignes suivantes à votre ~/.elinks/elinks.conf :\n\n```\nset protocol.http.proxy.host = \"127.0.0.1:8118\"\nset protocol.https.proxy.host = \"127.0.0.1:8118\"\n```\n\n"
    },
    {
      "title": "Passer des URLs à des commandes externes",
      "level": 3,
      "content": "Vous pouvez définir des commandes auxquelles ELinks transmettra l'URL courante.\n\nPour ce faire, allez dans le menu des options, naviguez sous Document, puis vers URI-passing. Appuyez ensuite sur a pour ajouter un nouveau nom de commande. Ensuite, naviguez jusqu'au nom de la nouvelle commande et appuyez sur e pour l'éditer. Tapez le nom de la commande, entrez et enregistrez.\n\nEn supposant que la commande \"tab-external-command\" est affectée à KEY, chaque fois que vous appuyez sur KEY, un menu contenant vos commandes apparaîtra. Sélectionnez celle que vous voulez, et ELinks transmet l'URL actuelle à cette commande.\n\n"
    },
    {
      "title": "Enregistrement du lien dans le presse-papiers de X",
      "level": 4,
      "content": "```\necho -n %c | xclip -i\n```\n\n"
    },
    {
      "title": "Passage de liens YouTube par un lecteur externe",
      "level": 4,
      "content": "Pour les liens strictement YouTube, mpv prend en charge le lecteur externe. Il suffit d'utiliser ce qui suit :\n\n```\nmpv %c\n```\n\nPour une approche plus générale qui peut gérer de nombreux sites 'tube', vous aurez besoin de youtube-dlAUR. Ajoutez alors la commande suivante,\n\n```\nyoutube-dl -o - %c | mplayer -\n```\n\n"
    },
    {
      "title": "ELinks s'est figé et je ne peux pas le démarrer sans qu'il se fige à nouveau",
      "level": 3,
      "content": "Par défaut, chaque fois que vous démarrez ELinks, vous vous connectez à une instance existante. Ainsi, si cette instance se fige, toutes les instances actuelles et futures se figeront également.\n\nVous pouvez empêcher ELinks de se connecter à une instance existante en le démarrant de la manière suivante :\n\n```\n$ elinks -no-connect\n```\n\nSi cela se produit souvent, vous pouvez envisager de faire de ce démarrage par défaut en créant un alias dans votre shell :\n\n```\nalias elinks=\"elinks -no-connect\"\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Site web officiel\n- Howto : Utiliser elinks comme un pro\n\n"
    }
  ]
}