{
  "title": "Elinks (Español)",
  "url": "https://wiki.archlinux.org/title/Elinks_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-11-04** \n\nELinks es un navegador web avanzado y bien establecido de modo de texto rico en funciones (HTTP/FTP/...). ELinks puede representar tanto frames como tablas, es altamente personalizable y puede ampliarse mediante scripts de Lua o Guile. Cuenta con pestañas y algo de soporte para CSS.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete elinks.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Vea elinks(1).\n\n"
    },
    {
      "title": "Navegación",
      "level": 3,
      "content": "Navegar por la web con un navegador de texto es más o menos lo mismo que un navegador gráfico, solo que sin «distracciones». Una vez que haya comenzado elinks, puede presionar g y escribir la página web que desea solicitar. Luego puede navegar por la página con las teclas de flecha para navegar por línea, la barra espaciadora para navegar por páginas o las teclas j y k para navegar por enlaces.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "ELinks proporciona dos menús, accesibles a través de ELinks, para personalizar opciones y combinaciones de teclas respectivamente.\n\nSe recomienda utilizar estas herramientas en lugar de editar manualmente los archivos de configuración (que se colocan en ~/.elinks) Es mucho más fácil y seguro de esta manera.\n\nPor defecto, la tecla o abre el administrador de opciones y la tecla k el administrador de teclas.\n\n"
    },
    {
      "title": "Definir manejadores de URL",
      "level": 3,
      "content": "ELinks es capaz de usar programas externos para diversas tareas.\n\nDefinir manejadores de URL a través del menú de opciones puede ser un poco confuso al principio, pero una vez que lo domine, le resultará fácil.\n\nPara hacer esto, vaya al administrador de opciones y navegue hasta MIME. Todos los submenús tienen páginas Info para ayudarlo.\n\nEste es uno de los pocos casos en los que podría ser más fácil editar el archivo conf.\n\nPor ejemplo, para hacer que ELinks inicie automáticamente su visor de imágenes cuando haga clic en un archivo jpeg, puede añadir lo siguiente a su archivo ~/.elinks/elinks.conf:\n\n```\n~/.elinks/elinks.conf\n```\n\n```\nset mime.extension.jpg=\"image/jpeg\"\nset mime.extension.jpeg=\"image/jpeg\"\nset mime.extension.png=\"image/png\"\nset mime.extension.gif=\"image/gif\"\nset mime.extension.bmp=\"image/bmp\"\n\nset mime.handler.image_viewer.unix.ask = 1\nset mime.handler.image_viewer.unix-xwin.ask = 0\n \nset mime.handler.image_viewer.unix.block = 1\nset mime.handler.image_viewer.unix-xwin.block = 0 \n \nset mime.handler.image_viewer.unix.program = \"pictureviewer %\"\nset mime.handler.image_viewer.unix-xwin.program = \"pictureviewer %\"\n\nset mime.type.image.jpg = \"image_viewer\"\nset mime.type.image.jpeg = \"image_viewer\"\nset mime.type.image.png = \"image_viewer\"\nset mime.type.image.gif = \"image_viewer\"\nset mime.type.image.bmp = \"image_viewer\"\n```\n\n"
    },
    {
      "title": "Utilización de Tor",
      "level": 3,
      "content": "ELinks no es compatible con SOCKS directamente. Las alternativas son invocar ELinks a través detorify elinks, o instalar el paquete privoxy para reenviarlo al proxy SOCKS de Tor. Añada primero la siguiente línea a su archivo de configuración /etc/privoxy/config:\n\n```\nforward-socks5 / localhost:9050 .\n```\n\nReinicie privoxy.service, luego ingrese las siguientes líneas al archivo ~/.elinks/elinks.conf:\n\n```\nset protocol.http.proxy.host = \"127.0.0.1:8118\"\nset protocol.https.proxy.host = \"127.0.0.1:8118\"\n```\n\nNote: **9050** \n\n"
    },
    {
      "title": "Pasar URL a órdenes externas",
      "level": 3,
      "content": "Puede definir órdenes que ELinks pasará a la URL actual.\n\nPara hacer esto, vaya al menú de opciones, navegue a Document, luego a URI-passing. Luego presione a para agregar un nuevo nombre de la orden. Luego navegue hasta el nuevo nombre de la orden y presione e para editar. Escriba el nombre de la orden, ingrese y guarde.\n\nAsumiendo que la orden «tab-external-command» está asignada a KEY, cada vez que presione KEY, un menú que contiene sus órdenes aparecerá. Seleccione la que desee y ELinks pasará la URL actual a esa orden.\n\n"
    },
    {
      "title": "Guardar enlace al portapapeles X",
      "level": 4,
      "content": "```\necho -n %c | xclip -i\n```\n\n"
    },
    {
      "title": "Pasar enlaces de YouTube a través de un reproductor externo",
      "level": 4,
      "content": "Para enlaces estrictamente de YouTube, mpv tiene soporte incorporado. Basta utilizar lo siguiente:\n\n```\nmpv %c\n```\n\nPara un enfoque más general que pueda manejar muchos sitios «tube», necesitará youtube-dlAUR. Luego añada la siguiente orden:\n\n```\nyoutube-dl -o - %c | mplayer -\n```\n\n"
    },
    {
      "title": "ELinks se congeló y no puede iniciarse sin que se congele nuevamente",
      "level": 3,
      "content": "Por defecto, cada vez que ELinks se inicia, este se conecta a una instancia existente. Por lo tanto, si esa instancia se congela, todas las instancias actuales y futuras también se congelarán.\n\nPuede evitar que ELinks se conecte a una instancia existente al iniciarlo, procediendo así:\n\n```\n$ elinks -no-connect\n```\n\nSi esto sucede mucho, puede considerar hacer de este su inicio predeterminado, creando un alias en su intérprete de órdenes:\n\n```\nalias elinks=\"elinks -no-connect\"\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Sitio web oficial\n- Howto: utilizar elinks como un profesional\n\n"
    }
  ]
}