{
  "title": "Emacs (Português)",
  "url": "https://wiki.archlinux.org/title/Emacs_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artigo ou esta seção precisa de tradução.** Este artigo ou esta seção precisa de tradução.\n\nEste artigo ou esta seção precisa de tradução.\n\nEmacs é um editor de visualização auto-documentado e em tempo-real, customizável e extensível. No núcleo do Emacs está um interpretador Emacs Lisp, a linguagem em que a maioria da funcionalidade built-in e das extensões do Emacs estão implementadas. O GNU Emacs usa o GTK como o seu toolkit do X, contudo, funciona igualmente bem dentro de um ambiente CLI.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nPara a versão estável do GNU Emacs, instala o pacote emacs. Variantes incluem:\n\n- emacs25-gitAUR[link quebrado: package not found] - Ramo de manutenção do GNU Emacs versão 25.\n- emacs26-gitAUR[link quebrado: package not found] - Ramo de manutenção do GNU Emacs versão 26.\n- emacs27-gitAUR[link quebrado: package not found] - Ramo de manutenção do GNU Emacs versão 27.\n- emacs28-gitAUR[link quebrado: package not found]: Desde Abril de 2022, o GNU Emacs 28.1 inclui suporte para compilação nativa que foi fundido upstream. Este ramo está configurado para rastrear o desenvolvimento do próximo lançamento menor do Emacs 28.\n- emacs-nativecomp[link quebrado: replaced by emacs]: GNU Emacs com compilação nativa ativada.\n- emacs-gitAUR: Ramo de desenvolvimento do GNU Emacs. Desde Junho de 2021 inclui suporte a compilação nativa fundido do ramo feature/native-comp do GNU Emacs.\n- emacs29-gitAUR: Ramo do GNU Emacs 29 de desenvolvimento do GNU Emacs.\n- emacs-nox: GNU Emacs sem suporte ao X11 para uso num terminal. Esta variante tem limitações, incluindo menos cores, menos funcionalidades para lidar com fontes (mudança de tamanho ao vivo, vários tamanhos num só documento, etc) e limitações com funcionalidades avançadas como o Speedbar ou o GUD (o ambiente de depuração). É também mais lento ao lidar com faces complexas (a aparência visual do texto no GNU Emacs).\n- emacs-nox-24bitAUR[link quebrado: package not found] - Sem suporte ao X11 remendado para coloração de 24bit.\n- emacs-gtk2AUR[link quebrado: package not found] - Sem suporte ao GTK2.\n- emacs-xwidgetsAUR[link quebrado: package not found] - Sem suporte ao xwidgets.\n- emacs-pgtk-gitAUR - Com suporte ao pgtk.\n- emacs-pretestAUR - Versão de pré-teste.\n- emacs-muse - Ambiente de publicação para o Emacs.\n- emacs-gcc-wayland-devel-binAUR[link quebrado: package not found] - GNU Emacs. Ramo de desenvolvimento native-comp e ramo pgtk combinado, servido como um binário.\n- guile-emacs-gitAUR[link quebrado: package not found] - Ramo do GNU Emacs que substitui o próprio motor EmacsLisp do Emacs com o do Guile.\n- emacs-lucidAUR - Versão toolkit do Lucid.\n- emacs-lucid-gitAUR - Versão toolkit do Lucid. Versão Git.\n\n"
    },
    {
      "title": "Forks",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nNote: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\n- emacs-pgtk-native-comp-gitAUR[link quebrado: package not found] ou emacs-native-comp-gitAUR ou emacs-native-comp-git-enhancedAUR[link quebrado: package not found]: Um fork não-oficial combinando o ramo de desenvolvimento do GNU Emacs (incluindo compilação nativa) com o novo motor de renderização PGTK.\n- emacs-ngAUR - Uma nova abordagem ao Emacs - Incluindo TypeScript, Threading, Async I/O e WebRender.\n- emacs-ng-gitAUR - Uma nova abordagem ao Emacs - Incluindo TypeScript, Threading, Async I/O e WebRender. Versão Git.\n- mg - Micro GNU Emacs\n- qemacsAUR Quick Emacs\n- qemacs-gitAUR - QEmacs (Quick Emacs) é um editor muito pequeno com uma aparência e sensação de Emacs, realce de sintaxe, UTF-8, modo dired com janela de pré-visualização e muitas outras funcionalidades.\n- texmacsAUR - Editor de texto científico e gratuito, inspirado pelo TeX e GNU Emacs. Editor WYSIWYG, fontes-TeX e interface-CAS (Giac, GTybalt, Macaulay 2, Maxima, Octave, Pari, Qcl, R e Yacas) num só.\n- sxemacs-gitAUR - Um derivativo do xemacs - checkout do git.\n- uemacs-gitAUR - MicroEMACS/PK 4.0.15 customizado pelo Linus Torvalds.\n- femto-emacs-gitAUR - Clone do emacs muito pequeno com configuração em FemtoLisp.\n\n"
    },
    {
      "title": "Executando o Emacs",
      "level": 2,
      "content": "Antes de lançar o emacs, tu deves saber como fechá-lo (principalmente se o executares num terminal): usa a sequência de teclas Ctrl+xCtrl+c.\n\nPara iniciar o Emacs executa:\n\n```\n$ emacs\n```\n\nou para usá-lo numa consola:\n\n```\n$ emacs -nw\n```\n\nou para carregamento rápido (sem .emacs) e editar dentro do CLI:\n\n```\n$ emacs -Q -nw\n```\n\nSe instalaste a versão nox, 'emacs' e 'emacs -nw' fazem o mesmo.\n\nUm nome de ficheiro pode ser dado para abrir aquele ficheiro imediatamente:\n\n```\n$ emacs filename.txt\n```\n\n"
    },
    {
      "title": "Sem cores",
      "level": 3,
      "content": "Por omissão o Emacs inicia-se com um tema de cor mostrando as hiperligações em azul escuro. Para iniciar o Emacs num terminal de texto sem qualquer esquema ou tema de cor:\n\n```\n$ emacs -nw --color=no\n```\n\n"
    }
  ]
}