{
  "title": "Emacs (Español)",
  "url": "https://wiki.archlinux.org/title/Emacs_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2024-09-03** \n\nEmacs es un editor de pantalla en tiempo real, extensible, personalizable y auto documentado. En el núcleo de Emacs se encuentra un intérprete de Emacs Lisp, el lenguaje en el que se implementa la mayor parte de la funcionalidad incorporada las extensiones de Emacs. GNU Emacs utiliza GTK como su conjunto de herramientas X, aunque funciona igualmente bien en un entorno de interfaz de línea de comandos (CLI).\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Install uno de los siguientes paquetes:\n\n- emacs - versión estable,\n- emacs-nativecomp[enlace roto: replaced by emacs] - con compilación nativa habilitada,\n- emacs-nox - sin soporte X11,\n- emacs-wayland - con compilación nativa y PGTK habilitado.\n\nSe pueden buscar otras variantes, como ejemplo emacs-gitAUR proporciona la rama de desarrollo de GNU Emacs.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Antes de iniciar emacs, debes saber cómo cerrarlo (especialmente si lo ejecutas en un terminal); usa el Ctrl+x o Ctrl+C en la terminal.\n\nPara iniciar Emacs ejecuta:\n\n```\n$ emacs\n```\n\no, para usarlo desde la consola:\n\n```\n$ emacs -nw\n```\n\no, para carga rápida (sin .emacs) y edición dentro de CLI:\n\n```\n$ emacs -Q -nw\n```\n\nSi instaló la versión nox, emacs y emacs -nw serán iguales.\n\nTambién se puede proporcionar un nombre de archivo para abrir ese archivo inmediatamente:\n\n```\n$ emacs nombre_fichero.txt\n```\n\n"
    },
    {
      "title": "Sin colores",
      "level": 3,
      "content": "De forma predeterminada, Emacs comienza con un tema de color que muestra hipervínculos en azul oscuro. Para iniciar Emacs en un terminal de texto sin ningún tema o esquema de color:\n\n```\n$ emacs -nw --color=no\n```\n\nEsto hará que todo el texto aparezca con el color de primer plano de la terminal: normalmente de color blanco sobre fondo negro o texto negro sobre fondo blanco.\n\n"
    },
    {
      "title": "Como un demonio",
      "level": 3,
      "content": "Para evitar recargar el archivo de configuración de Emacs cada vez que se inicia Emacs, puede ejecutar Emacs como un demonio:\n\n```\n$ emacs --daemon\n```\n\nLuego puede conectarse al demonio ejecutando:\n\n```\n$ emacsclient -nc\n```\n\nLo cual crea un nuevo marco -c (use -t si prefieres usarlo en el terminal) y no acapara la terminal -n (--no-wait). Tenga en cuenta que algunos programas como Mutt o Git (para mensajes de confirmación) espera a que finalice el editor, por lo que no puede utilizar el parámetro -n. Si su editor predeterminado está configurado para usarlo, tendrá que especificar un editor alternativo (p. ej. emasclient -a \"\" -t) para esos programas.\n\n"
    },
    {
      "title": "Como unidad systemd",
      "level": 3,
      "content": "Se incluye una unidad systemd en Emacs 26.1. La unidad se instala con Emacs, pero debe estar habilitada como una unidad de usuario (no para todo el sistema) después de instalar Emacs.\n\nUna vez iniciado el servicio, Emacs está listo.\n\nSi desea poder iniciar marcos gráficos de emacs a través de emacsclient en Wayland, se necesita un fragmento directo específico, como se muestra en EmacsWiki.\n\nTenga en cuenta que las unidades de usuario de systemd no heredan las variables de entorno de un shell de inicio de sesión (como ~/.bash_profile). Consulte Systemd/User#Environment variables para obtener más información.\n\nSi inicia emacs como un demonio, es posible que desee configurar las variables de entorno VISUAL y EDITOR en emacsclient para que los programas que inicien un editor utilicen emacsclient en lugar de iniciar una nueva instancia completa del editor. Los programas que utilizan un editor externo incluyen programas de correo electrónico (para editar el mensaje), Git (para editar el mensaje de confirmación) y less (el comando v para editar el archivo mostrado). No utilice la opción -n (--nowait) para emacsclient, ya que los programas normalmente esperan que la edición finalice cuando se cierra el editor.\n\nTambién se recomienda cambiar cualquier entrada del menú de inicio de la GUI (o equivalente) para que Emacs apunte a emacsclient en lugar de emacs, de modo que se utilice el demonio de emacs en lugar de iniciar un nuevo proceso de emacs.\n\n"
    },
    {
      "title": "Obteniendo ayuda",
      "level": 2,
      "content": "Emacs tiene un tutorial incorporado al que se puede acceder haciendo clic en el primer enlace en la pantalla de inicio y seleccionando Help>Emacs Tutorial en el menú o presionando C-h t.\n\nPara leer el tutorial en un idioma que no sea inglés, use el comando Alt x e ingrese help-with-tutorial-spec-language\n\nEmacs se autodocumenta por diseño. De este modo, se dispone de una gran cantidad de información para determinar, por ejemplo, el nombre de un comando específico o su combinación de teclas. Vea todos los enlaces de ayuda contextual con C-h C-h.\n\nEmacs también incluye un conjunto de tarjetas de referencia, útiles tanto para principiantes como para expertos, consulte /usr/share/emacs/versión/etc/refcards/.\n\n"
    },
    {
      "title": "Manuales",
      "level": 3,
      "content": "Si realmente quieres dominar Emacs, la fuente de documentación más recomendada siguen siendo los manuales oficiales:\n\n- Emacs: el manual de usuario completo de Emacs.\n- Preguntas frecuentes sobre Emacs.\n- Introducción a Emacs Lisp: si nunca antes has utilizado ningún lenguaje de programación.\n- Elisp: si ya estás familiarizado con algún lenguaje de programación.\n\nPuede acceder a ellos como archivos PDF desde GNU.org o directamente desde el propio Emacs gracias al lector de 'información' integrado: C-h i . Presione m para elegir un libro.\n\nAlgunos usuarios prefieren leer libros usando 'info' debido a sus convenientes atajos, sus párrafos se adaptan al ancho de la ventana y la fuente se adapta a la resolución actual de la pantalla. A algunos les resulta menos irritante para los ojos. Finalmente, puedes copiar fácilmente el contenido del libro a cualquier buffer de Emacs, e incluso puedes ejecutar fragmentos de código Lisp directamente desde los ejemplos.\n\nQuizás quieras leer el libro Info para saber más al respecto: C-h i m info RET. Presione ? mientras está en el modo de información para obtener una lista rápida de atajos.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Una de las principales características de Emacs es su extensibilidad y facilidad de configuración. Emacs tiene un motor de personalización incorporado. Puede hacer M-x personalizar que muestra una lista de opciones de personalización. Para saber cómo utilizar esta interfaz, consulte el nodo de información de Fácil personalización: (info '(emacs) Fácil personalización'). Puede configurar aperturas de personalización solo para una sesión de Emacs o guardarlas en un archivo de configuración para que se guarden en todas las sesiones de Emacs. Tenga en cuenta que esto es lo que hace la interfaz de personalización si selecciona Aplicar y guardar.\n\nCuando se inicia Emacs, normalmente intenta cargar un programa Lisp desde un archivo de inicialización, o archivo de inicio para abreviar. Este archivo, si existe, especifica cómo inicializar Emacs por usted. Emacs busca su archivo de inicio en /.emacs, /.emacs.el,/.emacs.d/init.el, o /.config/emacs/init.el. Consulte el nodo de información Archivo de inicio para obtener más información: (info '(emacs) Archivo de inicio')\n\n"
    },
    {
      "title": "TRAMP",
      "level": 3,
      "content": "TRAMP (Transparent Remote Access, Multiple Protocols|Acceso remoto transparente, protocolos múltiples) es una extensión que, como su nombre indica, proporciona acceso transparente a archivos remotos a través de varios protocolos. Cuando se le solicite un nombre de archivo, al ingresar un formulario específico se invocará TRAMP. Algunos ejemplos:\n\nPara solicitar la contraseña de root antes de abrir /etc/hosts con permisos de root:\n\n```\nC-x C-f /sudo::/etc/hosts\n```\n\nPara conectarse a 'hostremoto' como 'tu' a través de SSH y abrir el archivo ~/example.txt:\n\n```\nC-x C-f /ssh:you@remotehost:~/example.txt\n```\n\nLa ruta de TRAMP suele tener el formato '/[protocolo]:[[usuario@]host]:<archivo>'.\n\nPara conectarse a 'myhost' como 'tú' y editar /etc/hosts con sudo:\n\n```\n/ssh:tu@hostremoto|sudo:hostremoto:/etc/hosts\n```\n\nTRAMP admite mucho más de lo que los ejemplos anteriores podrían indicar. Para obtener más información, consulte el manual de información de TRAMP, que se distribuye con Emacs.\n\n"
    },
    {
      "title": "Usando Emacs como git mergetool",
      "level": 3,
      "content": "De forma predeterminada, Git brinda soporte para usar el modo Emerge de Emacs como herramienta de combinación. Sin embargo, es posible que prefiera el modo Ediff. Desafortunadamente, Git no admite este modo por razones técnicas. Todavía hay una manera de usarlo evaluando algún código elisp al llamar a emacs.\n\n```\n.gitconfig\n```\n\n```\n[mergetool.ediff]\n    cmd = emacs --eval \\\" (progn (defun ediff-write-merge-buffer () (let ((file ediff-merge-store-file)) (set-buffer ediff-buffer-C) (write-region (point-min) (point-max) file) (message \\\\\\\"Merge buffer saved in: %s\\\\\\\" file) (set-buffer-modified-p nil) (sit-for 1))) (setq ediff-quit-hook 'kill-emacs ediff-quit-merge-hook 'ediff-write-merge-buffer) (ediff-merge-files-with-ancestor \\\\\\\"$LOCAL\\\\\\\" \\\\\\\"$REMOTE\\\\\\\" \\\\\\\"$BASE\\\\\\\" nil \\\\\\\"$MERGED\\\\\\\"))\\\"\n    \n[merge]\n\ttool = ediff\n```\n\nTenga en cuenta que el comando debe estar en una sola línea.\n\nEn el ejemplo anterior, lanzamos una nueva instancia de Emacs. Es posible que desee utilizar emacsclient para un inicio más rápido; Sin embargo, no se recomienda, ya que la llamada de Ediff no es realmente limpia: podría alterar su sesión actual de Emacs.\n\nSi desea un inicio instantáneo, puede utilizar el parámetro -q. Si desea iniciar Emacs rápidamente y al mismo tiempo conservar al menos una parte de su configuración, puede llamar a Emacs con\n\n```\nemacs -q -l ~/.emacs-light\n```\n\ndonde el archivo de configuración ligera carga solo lo que necesitas para Ediff.\n\nConsulte kerneltrap.org y stackoverflow para obtener más detalles sobre este truco y el problema de Ediff.\n\n"
    },
    {
      "title": "Usar Bloq Mayús como tecla de control",
      "level": 3,
      "content": "A algunos usuarios les gusta este comportamiento para evitar el llamado \"emacs pinky\". Si quieres probarlo en X, simplemente ejecuta\n\n```\n$ setxkbmap -option 'ctrl:nocaps'\n```\n\nAlternativamente, para intercambiar estas claves, ejecute\n\n```\n$ setxkbmap -option 'ctrl:swapcaps'\n```\n\nPara configurar esto de forma permanente, considere agregarlo a su archivo .xinitrc.\n\nAhora, si alguna vez necesita escribir en mayúsculas una región, simplemente use la combinación de teclas predeterminada C-x C-u, que llama a la función upcase-region.\n\nConsulte [1] para conocer un enfoque alternativo.\n\nSi le falta la función Bloq Mayús, asígnela como \"Shift\" al mismo tiempo.\n\n```\n$ setxkbmap -option \"shift:both_capslock\"\n```\n\nAlgunos entornos de escritorio incluyen herramientas gráficas para simplificar las reasignaciones de teclado. Por ejemplo, en Plasma 5 abra Configuración del sistema y haga clic en Dispositivos de entrada. Seleccione Teclado y en la pestaña Avanzado encontrará la configuración Comportamiento de Bloq Mayús bajo el cual puede seleccionar Bloq Mayús también es Ctrl.\n\n"
    },
    {
      "title": "Multiplexación de emacs y emacsclient",
      "level": 3,
      "content": "Abrir un nuevo archivo en la misma emacs-session requiere el uso de emacsclient. El comando emacs se puede empaquetar para hacer el trabajo más inteligente de abrir el archivo si la sesión existe.\n\nPara iniciar la sesión necesita start-server. Este fragmento creará un servidor en la primera sesión de emacs. Agregue esto a su archivo de configuración emacs.\n\n```\n.emacs or .emacs.d/init.el\n```\n\n```\n(require 'server)\n(unless (server-running-p)\n  (server-start))\n```\n\nEl método de alias de Shell no es adecuado para esto ya que también necesita pasar variables o iniciar su propia sesión independiente. Agregue esto al .bashrc o cualquier archivo rc de su shell. Esto hará que su comando emacs se comporte como emacsclient si se pasa el argumento.\n\n```\nfunction emacs {\n    if [[ $# -eq 0 ]]; then\n        /usr/bin/emacs # \"emacs\" is function, will cause recursion\n        return\n    fi\n    args=($*)\n    for ((i=0; i <= ${#args}; i++)); do\n        local a=${args[i]}\n        # NOTE: -c for creating new frame\n        if [[ ${a:0:1} == '-' && ${a} != '-c' && ${a} != '--' ]]; then\n            /usr/bin/emacs ${args[*]}\n            return\n        fi\n    done\n    setsid emacsclient -n -a /usr/bin/emacs ${args[*]}\n}\n```\n\nSi desea ejecutarlo en una nueva sesión, simplemente haga emacs file -.\n\n"
    },
    {
      "title": "Múltiples configuraciones",
      "level": 3,
      "content": "Puede usar varias configuraciones y decirle a Emacs que cargue una u otra.\n\nPor ejemplo, definamos dos archivos de configuración.\n\n```\n.emacs\n```\n\n```\n(load \"~/.emacs.d/main\" nil t)\n(load \"~/.emacs.d/functions\" nil t)\n(load \"~/.emacs.d/modes\" nil t)\n(load \"~/.emacs.d/plugins\" nil t)\n(load \"~/.emacs.d/theme\" nil t)\n```\n\nEsta es la configuración completa que cargamos para el demonio. Pero el archivo plugins es enorme y tarda en cargarse. Si queremos generar una nueva instancia de Emacs que no necesite las funciones de plugins, puede resultar engorroso cargarla cada vez a largo plazo.\n\n```\n.emacs-light\n```\n\n```\n(load \"~/.emacs.d/main\" nil t)\n(load \"~/.emacs.d/functions\" nil t)\n(load \"~/.emacs.d/modes\" nil t)\n(load \"~/.emacs.d/theme\" nil t)\n```\n\nY ahora lanzamos Emacs con\n\n```\nemacs -q -l ~/.emacs-light\n```\n\nPuede crear un alias para facilitar la llamada.\n\n"
    },
    {
      "title": "Variables locales y personalizadas",
      "level": 3,
      "content": "Puede definir variables en su archivo de configuración que luego pueden modificarse localmente para un archivo.\n\n```\n(defcustom my-compiler \"gcc\" \"Some documentation\")\n```\n\nAhora, en cualquier archivo, puede definir variables locales de dos maneras; consulte el manual para obtener detalles completos\n\n- Usando M-x add-file-local-variable-prop-line, que agrega una línea comentada al principio similar a:\n\n```\n// -*- mi-compilador:g++; modo:c++ -*-\n```\n\n- O puedes usar M-x add-file-local-variable para agregar líneas cerca del final del archivo:\n\n```\n// Variables locales:\n// mi-compilador: g++\n// modo: c++\n// Fin:\n```\n\nTenga en cuenta que para que los valores surtan efecto, deberá llamar a M-x revert-buffer.\n\nLas variables personalizadas se consideran inseguras de forma predeterminada. Si intenta abrir un archivo que contiene variables locales que redefinen variables personalizadas, Emacs le pedirá confirmación.\n\nPuede declarar la variable como segura, eliminando así el mensaje de confirmación de Emacs. Debe especificar un predicado que cualquier valor nuevo debe verificar para que pueda considerarse seguro.\n\n```\n(defcustom mi-compilador \"gcc\" \"Alguna documentación\" :safe 'stringp)\n```\n\nEn el ejemplo anterior, si intenta establecer más de una cadena, Emacs lo considerará inseguro.\n\n"
    },
    {
      "title": "Colores y tema personalizados",
      "level": 3,
      "content": "Los colores se pueden personalizar fácilmente utilizando la función face.\n\n```\n(set-face-background  'region                 \"color-17\")\n(set-face-foreground  'region                 \"white\")\n(set-face-bold-p      'font-lock-builtin-face t )\n```\n\nPuedes dejar que Emacs te diga el nombre del face donde está el punto. Utilice la función customizer-face para eso. La instalación le mostrará cómo configurar colores, negrita, subrayado, etc.\n\nEmacs en consola puede manejar 256 colores, pero tendrás que usar un terminal apropiado para eso. Por ejemplo, URxvt admite 256 colores. Puede utilizar list-colors-display para obtener una lista completa de los colores admitidos. Esto depende en gran medida del terminal.\n\nVer también:\n\n- https://www.emacswiki.org/emacs/ColorThemes\n- https://www.gnu.org/software/emacs/manual/html_node/emacs/Custom-Themes.html\n\n"
    },
    {
      "title": "Compatibilidad con SyncTeX",
      "level": 3,
      "content": "Emacs es un potente editor LaTeX. Esto se debe principalmente al hecho de que puedes adaptar o crear un modo LaTeX que mejor se adapte a tus necesidades.\n\nAún así, puede haber algunos desafíos, como la compatibilidad con SyncTeX. Primero debes asegurarte de que tu distribución TeX lo tenga. Si instaló TeX Live manualmente, es posible que necesite instalar el paquete synctex.\n\n```\n# umask 022 && tlmgr install synctex\n```\n\nLa compatibilidad con SyncTeX depende del espectador. Aquí usaremos Zathura como ejemplo, por lo que es necesario adaptar el código si desea utilizar otro visor de PDF.\n\n```\n(defcustom tex-my-viewer \"zathura --fork -s -x \\\"emacsclient --eval '(progn (switch-to-buffer  (file-name-nondirectory \\\"'\\\"'\\\"%{input}\\\"'\\\"'\\\")) (goto-line %{line}))'\\\"\" \n  \"PDF Viewer for TeX documents. You may want to fork the viewer\nso that it detects when the same document is launched twice, and\npersists when Emacs gets closed.\n\nSimple command:\n\n  zathura --fork\n\nWe can use\n\n  emacsclient --eval '(progn (switch-to-buffer  (file-name-nondirectory \\\"%{input}\\\")) (goto-line %{line}))'\n\nto reverse-search a pdf using SyncTeX. Note that the quotes and double-quotes matter and must be escaped appropriately.\"\n:safe 'stringp)\n```\n\nAquí definimos nuestra variable personalizada. Si está utilizando el modo LaTeX predeterminado de AucTeX o Emacs, deberá configurar el visor en consecuencia.\n\nAhora abra un archivo fuente LaTeX con Emacs, compile el documento e inicie el visor. Zathura aparecerá. Si presiona Ctrl+Clic izquierdo Emacs debería colocar el punto en la posición correspondiente.\n\n"
    },
    {
      "title": "Resaltado de sintaxis para archivos systemd",
      "level": 3,
      "content": "Puede utilizar systemd-mode.\n\nAlternativamente, puede simplemente decirle a emacs que coloree los archivos systemd (servicios, temporizador, etc.), agregando esto a su archivo de inicio:\n\n```\n(add-to-list 'auto-mode-alist '(\"\\\\.service\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.timer\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.target\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.mount\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.automount\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.slice\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.socket\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.path\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.netdev\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.network\\\\'\" . conf-unix-mode))\n (add-to-list 'auto-mode-alist '(\"\\\\.link\\\\'\" . conf-unix-mode))\n```\n\n"
    },
    {
      "title": "Soporte de portapapeles para emacs-nox",
      "level": 3,
      "content": "Para usar el portapapeles Xorg en emacs-nox, Instala xclip y agregue la siguiente función a /.emacs [2]\n\n```\n;; use xclip to copy/paste in emacs-nox\n(unless window-system\n  (when (getenv \"DISPLAY\")\n    (defun xclip-cut-function (text &optional push)\n      (with-temp-buffer\n\t(insert text)\n\t(call-process-region (point-min) (point-max) \"xclip\" nil 0 nil \"-i\" \"-selection\" \"clipboard\")))\n    (defun xclip-paste-function()\n      (let ((xclip-output (shell-command-to-string \"xclip -o -selection clipboard\")))\n\t(unless (string= (car kill-ring) xclip-output)\n\t  xclip-output )))\n    (setq interprogram-cut-function 'xclip-cut-function)\n    (setq interprogram-paste-function 'xclip-paste-function)\n    ))\n```\n\nNote: Ver también mwheel.el[enlace roto 2024-11-05].\n\n```\n;; xterm mouse support\n(require 'mouse)\n(xterm-mouse-mode t)\n```\n\nVer también mwheel.el[enlace roto 2024-11-05].\n\n"
    },
    {
      "title": "Paquetes",
      "level": 2,
      "content": "La funcionalidad de Emacs se puede extender con paquetes de terceros. El administrador de paquetes incorporado package.el es la forma oficialmente compatible de hacerlo, aunque hay varios otros gerentes de paquetes escritos por miembros de la comunidad Emacs. package.el se basa en la variable package-archives para encontrar paquetes. Por defecto, esto incluye el Emacs Lips Package Archive (ELPA). M-X List-Packages creará un búfer que enumera todos los paquetes que emacs conoce. El manual ((info '(emacs) Packages')[enlace roto 2024-01-13]) contiene mucha más información.\n\nSe pueden agregar archivos de paquetes de terceros. El más utilizado de estos es Melpa.\n\nUna serie de extensiones populares están disponibles como paquetes en los repositorios oficiales, y más aún, a través del AUR. El nombre de tales paquetes generalmente tiene un 'emacs-' prefix (por ejemplo, emacs-lua-mode), aunque no siempre (por ejemplo, auctexAUR).\n\nAlgunos paquetes pueden requerir que realice cambios en su archivo de configuración para activarlos para que sus características estén disponibles durante una sesión de emacs. Por ejemplo, si instala auctexAUR, deberá agregar\n\n```\n(load \"auctex.el\" nil t t)\n(load \"preview-latex.el\" nil t t)\n```\n\na su archivo de configuración. Para otros paquetes deben hacerle saber, a emacs, cómo activarlos en la sección de comentarios de su código fuente.\n\n"
    },
    {
      "title": "Fallo en inicio de EMACS con mensaje de error 'Undefined color: \"WINDOW_FOREGROUND\"'",
      "level": 3,
      "content": "Debe instalar el paquete mcpp o el paquete gcc. El preprocesador C cpp se utiliza para preprocesar X recursos por Xrdb. Si un preprocesador C no está instalado en el sistema, XRDB omita silenciosamente el preprocesador C y el símbolo Window_foreground no se expande a un código de color hexadecimal.\n\n"
    },
    {
      "title": "EMACS Systemd El servicio no se inicia cuando se usa GCCEMACS",
      "level": 3,
      "content": "Al usar GCCEMACS (la rama emacs-native-comp o pgtk-nativecomp) e intentando iniciar un servicio systemd para ello, un mensaje de error informando que un .eln no se encontró que se pueda registrar:\n\n```\n$ journalctl --user -xb -g eln\n```\n\n```\nemacs[7507]: emacs: ../native-lisp/28.0.50-x86_64-pc-linux-gnu-fc9c33938bf279333039c28064d363e8/lisp-mode-410874a46ab8852855281f021ca61fe7-1738806322de892570d69dfc55b437c2.eln: cannot open shared object file: No such file or directory\n```\n\nComo una solución alternativa, editar la línea WorkingDirectory de emacs.service en la sección [servicio].\n\n```\nemacs.service\n```\n\n```\n[Service]\n...\nWorkingDirectory=/usr/lib/emacs/28.0.50/x86_64-pc-linux-gnu/\n...\n```\n\n"
    },
    {
      "title": "Problemas en salida de los colores",
      "level": 3,
      "content": "Por defecto, el shell Emacs mostrará secuencias de escape en bruto utilizadas para imprimir colores. En otras palabras, mostrará símbolos extraños en lugar de la salida del color deseado.\n\nIncluyendo lo siguiente en /.emacs modifica el problema:\n\n```\n(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)\n```\n\n"
    },
    {
      "title": "Problemas que muestran caracteres en X windows",
      "level": 3,
      "content": "Si cuando comienzas emacs en X Windows, todos los personajes de la ventana principal son cajas blancas con bordes negros (los que ve si intentas ver caracteres para los que no tienes la fuente correcta instalada), debes instalar xorg-fonts-75dpi y/o xorg-fonts-100dpi y reiniciar X Windows.\n\n"
    },
    {
      "title": "Inicio lento",
      "level": 3,
      "content": "Los tiempos de inicio lentos a menudo son causados por una de estas dos cosas.\n\nPara determinar cuál podría ser, ejecute emacs con:\n\n```\n$ emacs -q\n```\n\n- Los errores, particularmente en /etc/hosts, a menudo darán como resultado un retraso de más de 5 segundos al comenzar las emacs. Consulte 'Establezca el nombre de host' en la Guía de configuración de red para obtener información.\n- Es posible que debas monitorear cualquier paquete de red enviado desde su ordenador (usando un programa como Wireshark) para ver si hay algún comportamiento extraño.\n- Una forma simple de buscar la causa es hacer comentarios (es decir, líneas de prefijo con ';') secciones sospechosas de sus /.emacs (o /.emacs.d /init.el) Luego comience emacs nuevamente para ver si hay algún cambio. Tenga en cuenta el uso de 'require' y 'load' pueden ralentizar el inicio hacia abajo, especialmente cuando se usa con extensiones más grandes. Por regla general, solo debería usarse cuando su objetivo es: necesario una vez que comience emacs o proporcionan poco más que 'autoloads' para una extensión. De lo contrario, use la función 'Autoloads' directamente. Por ejemplo, en lugar de: (require 'cualquier cosa) que pueda usar: (autoload 'anything \"anything\" \"select anything\"' t)\n\n```\n(require 'cualquier cosa)\n```\n\n```\n(autoload 'anything \"anything\" \"select anything\"' t)\n```\n\n"
    },
    {
      "title": "No puede abrir el archivo de carga: ...",
      "level": 3,
      "content": "La causa más común de este error es la variable de \"ruta de carga\" que no incluye la ruta al directorio dentro del cual se encuentra la extensión. Para resolver esto, agregue la ruta apropiada a la lista que se buscará antes de intentar cargar la extensión:\n\n```\n(add-to-list 'load-path \"/path/to/directory/\")\n```\n\nAl intentar usar paquetes para extensiones y emacs se ha configurado con un prefijo que no sea /usr, la ruta de carga deberá actualizarse. Coloque lo siguiente en /.emacs antes de las instrucciones proporcionadas por el paquete:\n\n```\n(add-to-list 'load-path \"/usr/share/emacs/site-lisp\")\n```\n\nSi compila emacs a mano, tenga en cuenta que el prefijo predeterminado es /usr/local.\n\n"
    },
    {
      "title": "Problema de acento muerto: '<dead-acute> is undefined'",
      "level": 3,
      "content": "Al buscar sobre este error en Google, encontramos este enlace: https://lists.gnu.org/archive/html/help-gnu-emacs/2009-05/msg00167.html explicando el problema. La forma normal de usar las teclas de acento no funciona como se esperaba. Intentar acentuar una palabra como 'fiancé' producirá el mensaje anterior.\n\nUna forma de resolverlo es simplemente colocar la línea a continuación en su archivo de inicio, /.emacs:\n\n```\n(require 'iso-transl)\n```\n\nY no, no es un error, sino una característica de las nuevas versiones de Emacs. Al leer los mensajes posteriores al respecto en la lista de correo, lo encontramos [3]:\n\n"
    },
    {
      "title": "C-M-% y algunos otros enlaces no funcionan en emacs NOX",
      "level": 3,
      "content": "Esto se debe a que los terminales son más limitados que Xorg. Sin embargo, algunos terminales pueden manejar más enlaces que otras. Dos soluciones:\n\n- O use la versión gráfica,\n- o cambiar el enlace a uno compatible.\n\nEjemplo:\n\n```\n.emacs\n```\n\n```\n(global-set-key (kbd \"C-M-y\") 'query-replace-regexp)\n```\n\n"
    },
    {
      "title": "Emacs Hangs",
      "level": 3,
      "content": "Debido a su naturaleza única, muchas operaciones bloquean emacs. Esto podría suceder de algunas maneras. Por ejemplo, los emacs pueden estar esperando la entrada de usted (por ejemplo, ha abierto el minibuffer en un cuadro pero está tratando de trabajar en otro). Alternativamente, los emacs podrían estar ejecutando un código que simplemente lleva un tiempo terminar o tal vez te has encontrado con un error. Hay varias formas de tratar de desbloquear los emacs sin matar el proceso de emacs.\n\n- Intenta presionar C-g. Dependiendo de lo que esté haciendo Emacs, es posible que deba presionarlo varias veces.\n- Intenta presionar ESC ESC ESC.\n- Desde otro terminal, ejecutar killall -SIGUSR2 emacs\n\n"
    },
    {
      "title": "EMACS-Nox: La salida se vuelve desordenada",
      "level": 3,
      "content": "Cuando se trabaja en una terminal, el color, la sangría o cualquier cosa relacionada con la salida puede volverse una locura. Esto es (¿probablemente?) Porque Emacs recibió un carácter especial en algún momento que puede entrar en conflicto con la terminal actual. Si esto sucede, puede hacer M-X Redraw-Display, que redibujará la pantalla del terminal. Si este problema ocurre con frecuencia, es posible que desee vincular el comando a una clave, p.ej. Al poner algo como:\n\n```\n(global-set-key (kbd \"<f7>\") 'redraw-display)\n```\n\nen su archivo .emacs.\n\nLos emacs gráficos no sufren de este problema.\n\n"
    },
    {
      "title": "Números escapados extraños (UTF-8) que se muestran en el terminal emacs",
      "level": 3,
      "content": "Exporte estos valores en su .Bashrc o .zshrc:\n\n```\n$ ~/.bashrc or ~/.zshrc\n```\n\n```\nexport LANG\\='en_US.UTF-8'\nexport LC_ALL\\=\"en_US.UTF-8\"\nexport TERM\\=xterm-256color\n```\n\nPuede ser una fuente de errores, ya que en las distribuciones de Linux los valores correctos usan UTF en minúsculas (por ejemplo, en_us.utf-8)\n\nPara ver todos los locales disponibles, use locale -a.\n\n"
    },
    {
      "title": "Shift + Las teclas de flecha no funcionan en emacs dentro de tmux",
      "level": 3,
      "content": "Habilitar xterm-keys en su configuración tmux:\n\n```\n~/.tmux.conf\n```\n\n```\nsetw -g xterm-keys on\n```\n\nDebido a que esto romperá otras combinaciones clave, coloque lo siguiente en su configuración de emacs.\n\n```\n~/.emacs\n```\n\n```\n(defadvice terminal-init-screen\n  ;; The advice is named `tmux', and is run before `terminal-init-screen' runs.\n  (before tmux activate)\n  ;; Docstring. This describes the advice and is made available inside emacs;\n  ;; for example when doing C-h f terminal-init-screen RET\n  \"Apply xterm keymap, allowing use of keys passed through tmux.\"\n  ;; This is the elisp code that is run before `terminal-init-screen'.\n  (if (getenv \"TMUX\")\n    (let ((map (copy-keymap xterm-function-map)))\n    (set-keymap-parent map (keymap-parent input-decode-map))\n(set-keymap-parent input-decode-map map))))\n```\n\nConsulte tmux FAQ Para más detalles.\n\n"
    },
    {
      "title": "El cambio de tamaño de la ventana inadecuada en kde",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with KDE.** This article or section is a candidate for merging with KDE.\n\nThis article or section is a candidate for merging with KDE.\n\nLos usuarios de KDE pueden observar que la ventana EMACS no cambia de tamaño correctamente, sino que la parte redimensionada es transparente y los clics del mouse se envían a la ventana subyacente. Para corregir este comportamiento, cambie el tema GTK3 de KDE a algo más que Oxygen-GTK. Por ejemplo, use el tema Emacs que se incluye con gtk3.\n\nPara obligar a los emacs a maximizar completamente en KDE, haga clic en el icono de emacs en la barra de título y seleccione Más acciones > Configuración de ventana especial. Luego, en la pestaña Tamaño y posición, seleccione Obedecer las restricciones de geometría, elija Force en el menú desplegable y seleccione no en los botones de radio a la derecha.\n\n"
    },
    {
      "title": "Alternativas",
      "level": 2,
      "content": "Existen numerosas implementaciones 'más pequeñas' de EMAC. GNU/Emacs es probablemente el más popular. Aquí se enumerarán algunas alternativas compatibles con emacs livianos:\n\n- mg — Implementación ligera de emacs escritos en C. Tenga en cuenta que no admite UTF-8.\n\n- Zile — \"Zile es emacs con pérdida\", un clon liviano escrito para ser lo más similar posible a las emacs. Zile no tiene soporte UTF-8.\n\n- uemacs — A \"Micro-emacs\" versión personalizada por Linus Torvalds.\n\n- emacs-ng — Un nuevo enfoque para los emacs - Incluyendo TypeScript, Threading, Async I/O, y WebRender.\n\n- qemacs — \"Quick Emacs\", Ased en el intérprete Lisp de EMACS, pero tiene una base de código más pequeña y una interfaz de usuario simplificada.\n\n- sxemacs — Una bifurcación de Xemacs.\n\n- jove — La propia versión de Emacs de Jonathan es un editor de emacs sin Lisp.\n\n"
    },
    {
      "title": "Distribuciones Emacs",
      "level": 3,
      "content": "- Spacemacs - Una distribución de emacs impulsada por la comunidad: el mejor editor no es ni emacs ni vim, ¡son emacs * y * vim!\n- Doom Emacs - Un marco de emacs para el terco hacker marciano\n- Witchmacs - La distribución de emacs más guapa.\n- Yukimacs - Una configuración GNU/Emacs construida desde cero (sin Spacemacs o Doom Emacs), muy inspirada en las Emacs y Witchmacs del tío Dave.\n\nM: Starter Kits\n\n"
    },
    {
      "title": "Ver también",
      "level": 2,
      "content": "- GNU Emacs home page\n- GNU Emacs manual\n- Emacs Wiki\n- WikEmacs - una wiki de emacs más legible pero menos completa\n- Introducción útil a los emacs y sus atajos\n- La Iglesia de Emacs (a través de Google Drive)\n- Tarjeta de referencia oficial\n- EXWM, el administrador de ventanas Emacs X\n\n"
    }
  ]
}