{
  "title": "EncFS (Español)",
  "url": "https://wiki.archlinux.org/title/EncFS_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-08-06** \n\nArtículos relacionados\n\n- Data-at-rest encryption (Español)\n\nEncFS es un sistema de archivos criptográfico apilable ejecutado en el espacio de usuario similar a eCryptfs, y tiene como objetivo asegurar los datos con las mínimas complicaciones. Utiliza FUSE para montar un directorio encriptado en otro directorio especificado por el usuario. No utiliza un sistema loopback como algunos otros sistemas comparables como TrueCrypt y dm-crypt.\n\nDefinitivamente EncFS es el software más simple si desea probar el cifrado de disco en Linux.\n\nEsto tiene una serie de ventajas y desventajas en comparación con otros sistemas. En primer lugar, no requiere ningún privilegio de root para implementarlo; cualquier usuario puede crear un repositorio de archivos cifrados. En segundo lugar, no necesita crear un único archivo ni un sistema de archivos dentro de ese; funciona en el sistema de archivos existente sin modificaciones.\n\nSin embargo, esto implica algunas desventajas; debido a que los archivos cifrados no se almacenan en su propio archivo, alguien que tuviere acceso al sistema (a pesar del cifrado) podría ver la estructura de los directorios subyacentes, la cantidad de archivos, sus tamaños y cuándo se modificaron. Sin embargo, no podrían ver los contenidos.\n\nEste método de asegurar los datos en particular, obviamente no es perfecto, pero hay situaciones en las que es útil.\n\nPara obtener más detalles sobre EncFS en comparación con otras soluciones de cifrado de disco, consulte Data-at-rest encryption (Español)#Cuadro comparativo.\n\n"
    },
    {
      "title": "Comparación con eCryptFS",
      "level": 2,
      "content": "ECryptfs se implementa en el espacio del kernel y, por lo tanto, es un poco más difícil de configurar. Con este método se deben recordar varias opciones de cifrado (algoritmo de cifrado usado, tipo de clave, etc.). No es el caso con EncFS, porque este almacena la información de metadatos de cifrado en un archivo de configuración por directorio (.encfs6.xml). Por lo tanto, no tiene que recordar nada (excepto la frase de contraseña).\n\nEl rendimiento de ambos depende del tipo de actividad del disco. Si bien eCryptFS puede funcionar más rápido en algunos casos porque hay menos sobrecarga por el contexto en el que opera (entre el kernel y el espacio de usuario). EncFS tiene ventajas en otros aspectos, porque los metadatos de cifrado están centralizados y no almacenados en los encabezados de los archivos individuales. Para obtener más información, el proyecto EncFS proporciona ejemplos de referencia.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete encfs.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Para crear un repositorio seguro, escriba la orden siguiente:\n\n```\n$ encfs ~/.cifrado ~/original\n```\n\nTenga en cuenta que se deben utilizar rutas absolutas. Esta orden vendrá seguida por un mensaje preguntándole sobre si desea optar por las opciones predeterminadas o por una configuración experta. La configuración predeterminada es bastante segura. La experta permite especificar algoritmos y otras opciones. Después de ingresar una clave para el cifrado, se creará y montará el sistema de archivos codificado. Los archivos codificados se almacenarán, en este ejemplo, en ~/.cifrado, y sus versiones no cifradas en ~/original.\n\nPara desmontar el sistema de archivos, escriba:\n\n```\n$ fusermount -u ~/nombre\n```\n\nPara volver a montar el sistema de archivos, emita la primera orden e ingrese la clave utilizada para codificarlo. Una vez ingresada la clave, el sistema de archivos se volverá a montar.\n\n"
    },
    {
      "title": "Cambiar la contraseña",
      "level": 3,
      "content": "Para cambiar la contraseña de un directorio cifrado por EncFS se puede usar la siguiente orden:\n\n```\n$ encfsctl passwd ~/.nombre\n```\n\nEn este ejemplo, ~/.nombre es la ruta al directorio que contiene los archivos codificados. El programa le pedirá su contraseña actual y luego podrá establecer una nueva.\n\n"
    },
    {
      "title": "Gnome Encfs Manager",
      "level": 3,
      "content": "Gnome Encfs Manager es un administrador y montador de encfs fácil de usar, con una configuración predefinida, con soporte para Gnome Keyring, con un menú de bandeja inspirado en Cryptkeeper pero usando la API AppIndicator y otras características propias.\n\nTiene disponible tanto el paquete gnome-encfs-manager-binAUR como el más actualizado gnome-encfs-manager-bzrAUR.\n\n"
    },
    {
      "title": "Montar utilizando gnome-encfs",
      "level": 3,
      "content": "gnome-encfs integra las carpetas EncFS en el escritorio de GNOME, almacenando sus contraseñas en el depósito de claves y, opcionalmente, montándo dichas carpetas al iniciar sesión utilizando el mecanismo de inicio automático de GNOME. Este método tiene la ventaja de que se puede montar y automatizar, y la contraseña no tiene que ser la misma que su contraseña de usuario.\n\n"
    },
    {
      "title": "Montar utilizando el icono CryptKeeper",
      "level": 3,
      "content": "Aplicación bastante simple, basta instalar cryptkeeperAUR y añadirla a su sesión X.\n\n"
    },
    {
      "title": "Montar utilizando encfsui",
      "level": 3,
      "content": "El script de bash encfsui proporciona una interfaz gráfica de usuario simple diseñada con zenity, creada en torno de la utilidad de línea de órdenes de EncFS, para montar y desmontar un directorio cifrado. Incluye un lanzador de escritorio. Instálelo con encfsuiAUR.\n\n"
    },
    {
      "title": "Montar con fstab",
      "level": 3,
      "content": "Añadir una entrada en /etc/fstab le permitirá montar el volumen encfs con un simple mount /ruta/destino y luego se le pedirá su contraseña.\n\n```\n/etc/fstab\n```\n\n```\nencfs#/ruta/a/datos/encfs  /mnt/decrypted  fuse  noauto,user  0  0\n```\n\nLa opción noauto evita el intento de montar el volumen en el arranque, lo que podría retrasar el proceso de arranque mientras el sistema espera que se ingrese una contraseña. Se puede omitir user si se quiere que solo el usuario root pueda montar el volumen.\n\n"
    },
    {
      "title": "Montar al iniciar sesión utilizando pam_encfs",
      "level": 3,
      "content": "Instale pam_encfsAUR. Véase también:\n\n- https://wiki.edubuntu.org/EncryptedHomeFolder\n- https://code.google.com/p/pam-encfs/\n\n"
    },
    {
      "title": "Contraseña única",
      "level": 4,
      "content": "Note: **contraseña segura** \n\n"
    },
    {
      "title": "/etc/pam.d/",
      "level": 4,
      "content": "Tenga en cuenta que cuando utilice el parámetro try_first_pass en pam_unix.so, deberá configurar EncFS para que use la misma contraseña que está utilizando para iniciar sesión (o viceversa) y bastará ingresar una única contraseña. Sin este parámetro, deberá ingresar dos contraseñas.\n\nColoque la línea encfs en /etc/pam.d/system-login como sigue:\n\n```\n...\nauth       sufficient pam_encfs.so\n...\n```\n\nEn esta sección se explica cómo hacer que encfs se monte automáticamente cuando inicie sesión con un terminal virtual.\n\nEdite el archivo /etc/pam.d/login:\n\n```\n#%PAM-1.0\n\nauth\t\trequired\tpam_securetty.so\nauth\t\trequisite\tpam_nologin.so\nauth\t\tsufficient\tpam_encfs.so\nauth\t\trequired\tpam_unix.so nullok try_first_pass\n#auth\t\trequired\tpam_unix.so nullok\nauth\t\trequired\tpam_tally.so onerr=succeed file=/var/log/faillog\n# use this to lockout accounts for 10 minutes after 3 failed attempts\n#auth\t\trequired\tpam_tally.so deny=2 unlock_time=600 onerr=succeed file=/var/log/faillog\naccount\t\trequired\tpam_access.so\naccount\t\trequired\tpam_time.so\naccount\t\trequired\tpam_unix.so\n#password\trequired\tpam_cracklib.so difok=2 minlen=8 dcredit=2 ocredit=2 retry=3\n#password\trequired\tpam_unix.so md5 shadow use_authtok\nsession\t\trequired\tpam_unix.so\nsession\t\trequired\tpam_env.so\nsession\t\trequired\tpam_motd.so\nsession\t\trequired\tpam_limits.so\nsession\t\toptional\tpam_mail.so dir=/var/spool/mail standard\nsession\t\toptional\tpam_lastlog.so\nsession\t\toptional\tpam_loginuid.so\n-session\toptional\tpam_ck_connector.so nox11\n#Automatic unmount (optional):\n#session\trequired\tpam_encfs.so\n```\n\nEsta sección explica cómo hacer que encfs se monte automáticamente al iniciar sesión con GDM (GNOME Display Manager).\n\nEdite el archivo /etc/pam.d/gdm-password.\n\nInserte (no sobrescriba) lo siguiente en la parte inferior de gdm-password:\n\n```\n#%PAM-1.0\nauth            requisite       pam_nologin.so\nauth            required        pam_env.so\nauth            sufficient      pam_encfs.so\nauth            required        pam_unix.so try_first_pass\nauth            optional        pam_gnome_keyring.so\naccount         required        pam_unix.so\nsession         required        pam_limits.so\nsession         required        pam_unix.so\nsession         optional        pam_gnome_keyring.so auto_start\npassword        required        pam_unix.so\nsession         required        pam_encfs.so\n```\n\nGuarde y salga.\n\nEdite /etc/security/pam_encfs.conf:\n\nRecomendado: comente la línea:\n\n```\nencfs_default --idle=1\n```\n\nEste indicador desmontará su carpeta cifrada después de 1 minuto de inactividad. No obstante, si la carpeta se ha montando automáticamente al iniciar sesión, probablemente deseará mantenerla montada durante el tiempo que esté conectado.\n\nEn la parte inferior, comente las entradas de demostración existentes y añada:\n\n```\n#USERNAME       SOURCE                                  TARGET PATH                 ENCFS Options           FUSE Options\nfoo             /home/foo/EncryptedFolder             /home/foo/DecryptedFolder       -v                    allow_other\n```\n\nAdemás, si ve la línea de abajo, elimine allow_root de las opciones. De lo contrario, entrará en conflicto con allow_other definido anteriormente.\n\n```\nfuse_default allow_root,nonempty\n```\n\nA continuación, edite /etc/fuse.conf y descomente:\n\n```\nuser_allow_other\n```\n\nPara probar su configuración, abra una nueva terminal virtual (por ejemplo con Ctrl+Alt+F4) e inicie sesión. Debería comprobar que pam monta con éxito su carpeta EncFS.\n\n"
    },
    {
      "title": "Montar al iniciar sesión utilizando pam_mount",
      "level": 3,
      "content": "Instale y configure pam_mount como se explica en su página wiki. Los montajes de EncFS se pueden especificar en el archivo de configuración de pam_mount de la siguiente manera:\n\n```\n/etc/security/pam_mount.conf.xml\n```\n\n```\n<volume fstype=\"fuse\" path=\"encfs#/ruta/a/datos/cifrados/con/encfs\" mountpoint=\"/ruta/a/puntodemontaje/de/datos/descifrados\" options=\"nonempty\" />\n```\n\nLos montajes de EncFS deben tener la misma contraseña que su cuenta de usuario. La opción nonempty hace posible montar el sistema de archivos cifrados incluso cuando el punto de montaje no está vacío. Puede eliminar esta opción si este no es el comportamiento deseado.\n\nEs posible montar múltiples carpetas EncFS al iniciar sesión especificando múltiples entradas <volume> consecutivas en el archivo de configuración.\n\n"
    },
    {
      "title": "Montar cuando se inserta una unidad USB con carpetas EncFS utilizando fsniper",
      "level": 3,
      "content": "Este es un método simple para montar automáticamente encfs (solicitando contraseña) cuando se inserta una unidad USB con una o más carpetas cifradas con EncFS en su raíz. Usaremos fsniperAUR (sistema de archivos que explora utilizando el demonio inotify) y git (para pedir contraseñas binarias).\n\nPara conocer más, consulte https://github.com/Harvie/Programs/tree/master/bash/encfs/automount (última versión de los archivos utilizados en #Cómo hacerlo).\n\n"
    },
    {
      "title": "Cómo hacerlo",
      "level": 4,
      "content": "1. Necesitará un montaje automático de USB que funcione para esto, como lo hace Thunar o Gnome Files. 2. Cree una carpeta cifrada en su unidad extraible, por ejemplo: encfs /media/USB/somename /media/USB/somename.plain (y ​​luego desmonte todo). 3. Cree un archivo en su unidad local ~/.config/fsniper/config:\n\n```\nwatch {\n\t/etc/ {\n\t\tmtab {\n\t\t\t# %% is replaced with the filename of the new file\n\t\t\thandler = encfs-automount.sh %%;\n\t\t}\n\t}\n}\n```\n\n4. Instale el script de ayuda:\n\n```\n#!/bin/sh\n#\t~/.config/fsniper/scripts/encfs-automount.sh\n# Quick & dirty script for automounting EncFS USB drives\n# TODO:\n#  - Unmounting!!!\n#\nASKPASS=\"/usr/lib/git-core/git-gui--askpass\"\n\nlock=/tmp/fsniper_encfs.lock\nlpid=$(cat \"$lock\" 2>/dev/null) &&\nps \"$lpid\" | grep \"$lpid\" >/dev/null && {\n\techo \"Another instance of fsniper_encfs is running\"\n\texit;\n}\necho $BASHPID > \"$lock\";\nsleep 2;\n\necho\necho ==== EncFS automount script for fsniper ====\n\nlist_mounts() {\n\tcat /proc/mounts | cut -d ' ' -f 2\n}\n\nlist_mounts | while read mount; do\n\tconfig=\"$mount\"'/*/.encfs*';\n\techo Looking for \"$config\"\n\tconfig=\"$(echo $config)\"\n\t[ -r \"$config\" ] && {\n\t\tcyphertext=\"$(dirname \"$config\")\";\n\t\tplaintext=\"$cyphertext\".plain\n\t\techo Found config: \"$config\";\n\t\techo Trying to mount: \"$cyphertext to $plaintext\";\n\t\tlist_mounts | grep \"$plaintext\" >/dev/null && {\n\t\t\techo Already mounted: \"$plaintext\"\n\t\t} || {\n\t\t\techo Will mount \"$cyphertext to $plaintext\"\n\t\t\t\"$ASKPASS\" \"EncFS $cyphertext to $plaintext\" | encfs --stdinpass \"$cyphertext\" \"$plaintext\"\n\t\t}\n\t}\ndone\necho\n\nrm \"$lock\" 2>/dev/null\n```\n\n5. Asegúrese de que /usr/lib/git-core/git-gui--askpass funciona (es por eso que necesita el paquete git, aunque también podría reajustar el script de ayuda). 6. Pruebe fsniper --log-to-stdout en la terminal (la petición de contraseña debe aparecer cuando se inserte la unidad USB). 7. Agregue fsniper --daemon a su sesión. 8. No olvide desmontar encfs antes de quitar la unidad extraible.\n\n"
    },
    {
      "title": "Copia de seguridad del directorio cifrado",
      "level": 3,
      "content": "Se puede hacer una copia de seguridad de un directorio cifrado y restaurarlo en otra ubicación. Esto es posible porque el archivo de configuración con las opciones de cifrado/metadatos se almacena en el propio directorio en texto sin formato en el archivo oculto .encfs6.xml. Esto no compromete la seguridad, porque la contraseña no está en él.\n\nSin embargo, si, por ejemplo, almacena la copia de seguridad en una ubicación remota (por ejemplo, en la nube) o en un dispositivo portátil, puede sentirse incómodo al respecto. En este caso, tampoco es un problema mover manualmente el archivo oculto fuera del directorio antes de crear la copia de seguridad. Incluso puede moverlo permanentemente y aún montar y acceder a los archivos cifrados, si pasa su ubicación a encfs a través de la variable de entorno ENCFS6_CONFIG. Para el ejemplo anterior dado en #Utilización:\n\n```\n$ mv ~/.nombre/.encfs6.xml ~/.\n$ ENCFS6_CONFIG=~/.encfs6.xml encfs ~/.nombre ~/nombre\n```\n\n"
    },
    {
      "title": "Copia de seguridad del directorio de texto sin formato",
      "level": 3,
      "content": "El siguiente ejemplo supone que desea crear una copia de seguridad cifrada del directorio de texto sin formato existente ~/mythesis que contiene el archivo thesis.txt.\n\nPrimero, creamos la copia de seguridad cifrada del directorio de texto sin formato existente:\n\n```\n$ encfs --reverse ~/mythesis /tmp/thesisbackup\n```\n\nTenga en cuenta que en este caso el orden del directorio se invierte respecto al uso normal. El uso de la opción --reverse tiene dos efectos: en primer lugar, el archivo de configuración ahora se almacena en el directorio de texto sin formato y /tmp/thesisbackup solo lo contiene en forma cifrada. En segundo lugar, los archivos en /tmp/thesisbackup no son persistentes. Se eliminarán una vez que se desmonte (no, esto no se debe al uso del punto de montaje en /tmp).\n\nEn segundo lugar, ahora es el momento de copiar los archivos cifrados en la ubicación deseada antes de desmontar nuevamente el directorio temporal encfs:\n\n```\n$ cp -R /tmp/thesisbackup/* /mnt/usbstick/\n$ fusermount -u /tmp/thesisbackup\n```\n\ny hecho.\n\nPara restaurar (o ver) la copia de seguridad, necesitamos acceso a las opciones de cifrado en texto sin formato, que debe pasarse a encfs con la variable de entorno ENCFS6_CONFIG (utilizamos un directorio diferente para no estropear el archivo ~/mythesis existente):\n\n```\n$ ENCFS6_CONFIG=~/mythesis/.encfs6.xml encfs ~/mnt/usbstick/thesisbackup ~/restoremythesis\n```\n\nSi ahora lista el contenido restaurado, contendrá dos archivos:\n\n```\n$ ls -la ~/restoremythesis\n... \n-rw-r--r--  1 student student    1078  3. Jan 12:33 .encfs6.xml\n-rw-r--r--  1 student student      42  3. Jan 12:33 thesis.txt\n...\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- EncFS - página de inicio del proyecto.\n- Auditoría de seguridad de EncFS por Taylor Hornby (14 de enero de 2014).\n\n"
    }
  ]
}