{
  "title": "Equipe de Segurança do Arch",
  "url": "https://wiki.archlinux.org/title/Equipe_de_Seguran%C3%A7a_do_Arch",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "A Equipe de Segurança do Arch é um grupo de voluntários cujo objetivo é rastrear problemas de segurança com pacotes do Arch Linux. Todos os problemas são rastreados no rastreador de segurança do Arch Linux. A equipe era conhecida como Arch CVE Monitoring Team (em português, Equipe de Monitoramento do Arch CVE).\n\n"
    },
    {
      "title": "Missão",
      "level": 2,
      "content": "A missão da Equipe de Segurança do Arch de é contribuir para a melhoria da segurança do Arch Linux.\n\nO dever mais importante da equipe é encontrar e rastrear os problemas atribuídos a Vulnerabilidades e Exposições Comuns (CVE). Um CVE é público, é identificado por um ID único do formulário CVE-AAAA-número.\n\nEles publicam ASAs (Arch Linux Security Advisory, que significa \"Comunicado de Segurança do Arch Linux\"), que é um aviso específico do Arch disseminado para os usuários do Arch. Os ASAs estão programados no rastreador para revisão por pares e precisam de duas confirmações dos membros da equipe antes de serem publicados.\n\nO rastreador de segurança do Arch Linux é uma plataforma usada pela Equipe de Segurança do Arch para rastrear pacotes, adicionar CVEs e gerar texto de comunicados.\n\n- Um Arch Linux Vulnerability Group (AVG) é um grupo de CVEs relacionados a um conjunto de pacotes dentro do mesmo pkgbase.\n- Pacotes qualificados para um comunicado devem ser parte do repositório core, extra, ou multilib.\n\n"
    },
    {
      "title": "Contribuir",
      "level": 2,
      "content": "Para se envolver na identificação das vulnerabilidades, é recomendado:\n\n- Seguir o canal IRC #archlinux-security. É o principal meio de comunicação para relatar e discutir CVEs, pacotes afetados e a primeira versão corrigida do pacote.\n- Para ser avisado antecipadamente sobre novos problemas, pode-se monitorar as #Listas de discussão recomendadas para novos CVEs, junto com outras fontes, se necessário.\n- Encorajamos os voluntários a examinar os avisos por erros, perguntas ou comentários e relatar no canal do IRC.\n- Inscrever-se nas listas de discussão arch-security e oss-security.\n- Fazer commit de código para o projeto arch-security-tracker (GitHub) é uma ótima forma de contribuir para a equipe.\n- As distribuições derivadas que dependem dos repositórios de pacotes do Arch Linux são incentivadas a contribuir. Isso ajuda a segurança de todos os usuários.\n\n"
    },
    {
      "title": "Procedimento",
      "level": 2,
      "content": "O procedimento a seguir sempre que uma vulnerabilidade de segurança foi encontrada em um software empacotado nos repositórios oficiais do Arch Linux é o seguinte:\n\n"
    },
    {
      "title": "Fase de investigação e compartilhamento de informações",
      "level": 3,
      "content": "- Entre em contato com um membro da Equipe de Segurança do Arch por meio de seu canal preferido para garantir que o problema foi levado ao conhecimento da equipe.\n- Para substanciar a via mecanismos de pesquisa. Se você precisar de ajuda para investigar o problema de segurança, peça orientação ou suporte no canal do IRC.\n\n"
    },
    {
      "title": "Situação do upstream e relatório de erros",
      "level": 3,
      "content": "Duas situações podem acontecer:\n\n- Se o upstream liberar uma nova versão que corrige o problema, o membro da equipe de segurança deve sinalizar o pacote desatualizado. Se o pacote não foi atualizado após um longo período, um relatório de erro deve ser arquivado sobre a vulnerabilidade. Se este for um problema de segurança crítico, um relatório de erro deve ser preenchido imediatamente após sinalizar o pacote como desatualizado.\n- Se não houver nenhum release upstream disponível, um relatório de erro deve ser preenchido, incluindo os patches para mitigação. As seguintes informações devem ser fornecidas no relatório de erros: Descrição sobre o problema de segurança e seu impacto Links para os CVE-IDs e (upstream) relatório Se nenhum lançamento estiver disponível, links para patches do upstream (ou anexos) que mitigam o problema\n\n- Se o pacote não foi atualizado após um longo período, um relatório de erro deve ser arquivado sobre a vulnerabilidade.\n- Se este for um problema de segurança crítico, um relatório de erro deve ser preenchido imediatamente após sinalizar o pacote como desatualizado.\n\n- Descrição sobre o problema de segurança e seu impacto\n- Links para os CVE-IDs e (upstream) relatório\n- Se nenhum lançamento estiver disponível, links para patches do upstream (ou anexos) que mitigam o problema\n\n"
    },
    {
      "title": "Rastreamento e publicação",
      "level": 3,
      "content": "As seguintes tarefas devem ser executadas pelos membros da equipe:\n\n- Um membro da equipe criará um comunicado no rastreador de segurança e adicionará os CVEs para rastreamento.\n- Um membro da equipe com acesso a arch-security gerará um ASA do rastreador e o publicará.\n\n"
    },
    {
      "title": "Listas de discussão",
      "level": 3,
      "content": "Considere também seguir as listas de discussão para pacotes específicos, como LibreOffice, X.org, Puppetlabs, ISC, etc.\n\n1. full-disclosure, que pode ser traduzido para \"divulgação responsável\" ou literalmente \"revelação total\", é a prática de publicação de aálise de vulnerabilidades de software o mais cedo possível, tornando-a acessível para ciência das pessoas e facilitando sua correção.\n\n"
    },
    {
      "title": "Outras distribuições",
      "level": 3,
      "content": "Recursos de outras distribuições (para procurar por CVE, patch, comentários etc.):\n\n"
    },
    {
      "title": "Outros",
      "level": 3,
      "content": "O NVD e o Mitre não preenchem necessariamente sua entrada no CVE imediatamente após a atribuição, portanto, isso nem sempre é relevante para o Arch. Os campos CVE-ID e \"Data Entry Created\" não têm significado particular. CVE são atribuídos pelas Autoridades de Numeração CVE (CNA) e cada CNA obtém blocos CVE de Mitre quando necessário/solicitado, portanto, o ID CVE não está vinculado à data de atribuição. O campo \"Date Entry Created\" geralmente indica apenas quando o bloco CVE foi dado ao CNA, nada mais.\n\n"
    },
    {
      "title": "Mais",
      "level": 3,
      "content": "Para mais recursos, veja o Open Source Software Security Wiki do OpenWall.\n\n"
    },
    {
      "title": "Membros da equipe",
      "level": 2,
      "content": "Veja Arch Security Team para a relação dos atuais membros da Equipe de Segurança do Arch.\n\n"
    }
  ]
}