{
  "title": "Equinox Desktop Environment",
  "url": "https://wiki.archlinux.org/title/Equinox_Desktop_Environment",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n\nThe Equinox Desktop Environment (EDE) is a desktop environment designed to be simple, extremely light-weight and fast.\n\nIt primarily offers the most basic things: A window manager (PekWM is used by default), a simple GUI including a panel, a daemon watching removable media and a notification daemon. Other than that there is not much more than some configuration programs, a calculator, etc. Beginning with version 2.0, EDE follows the FreeDesktop.org guidelines.\n\nUnlike any other desktop environment, EDE is based upon the FLTK toolkit. It is especially fit for systems with little RAM or for users who want to completely customize their system and need a GUI that is not already bloated with functions and applications.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "EDE can be installed with the edeAUR package.\n\n"
    },
    {
      "title": "Starting the DE",
      "level": 2,
      "content": "To bring up EDE you can either use a display manager or use startx. If you choose the later, just write the following to the .xinitrc of your user:\n\n```\nexec startede\n```\n\n"
    },
    {
      "title": "Applications",
      "level": 2,
      "content": "Since EDE is a bare-bone DE, you will have to add even the most common applications like a file manager or an editor yourself. You have the freedom of choice.\n\nDue to the nature of the DE, it obviously makes sense to install light-weight software. There are however not that many FLTK applications available so you will likely have to relay on a second toolkit like GTK for example.\n\n"
    },
    {
      "title": "Some recommendations",
      "level": 3,
      "content": "- File manager: PCManFM\n- Browser: Dillo\n- Editor: Leafpad\n- Terminal emulator: Xterm\n\n"
    }
  ]
}