{
  "title": "Evilwm (Italiano)",
  "url": "https://wiki.archlinux.org/title/Evilwm_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Window manager\n\nevilwm is a minimalist window manager for the X Window system. It is minimalist in that it omits unnecessary stuff like window decorations and icons. But it is very usable in that it provides good keyboard control with repositioning and maximize toggles, solid window drags, snap-to-border support, and virtual desktops. Its installed binary size is only 0.07 MB.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the evilwmAUR package.\n\n"
    },
    {
      "title": "Starting",
      "level": 2,
      "content": "Run evilwm with xinit.\n\nevilwm does not control the desktop background or mouse cursor, so you may want to use xsetroot(1).\n\n"
    },
    {
      "title": "Startup options",
      "level": 3,
      "content": "evilwm can read options via command line switches. Some examples:\n\n- -fg color (Frame color of currently active window)\n- -bw n (Width of window borders in pixels)\n- -term term (Specifies a program to run when spawning a new terminal; default is xterm)\n- -snap n (enables snap-to-border support and specifies the proximity in pixels to snap to)\n- -mask1 modifier (override the default Ctrl+Alt keyboard modifiers)\n- -nosoliddrag (draw a window outline while moving or resizing, rather than drawing the entire window)\n\nA full list of the evilwm options can be found in evilwm(1) § OPTIONS.\n\nBy default, evilwm draws a one pixel gold border around the currenly active window. An example of the use of switches to change this would be a ~/.xinitrc file such as:\n\n```\nexec evilwm -snap 10 -bw 2 -fg red\n```\n\nThis would enable\n\n- snapping to a border within 10 pixels,\n- a border width of 2 pixels,\n- red for the currently active window border.\n\nFrom evilwm(1) § OPTIONS:\n\n"
    },
    {
      "title": "Using evilwm",
      "level": 2,
      "content": "After starting evilwm you will see nothing but a mouse cursor and a black background (or other background if you specified it as above). To open a terminal, use the key combination Ctrl+Alt+Enter. Programs can then be run from the terminal using executable &.\n\n"
    },
    {
      "title": "Keyboard controls",
      "level": 3,
      "content": "Using the keyboard combination of Ctrl+Alt plus a third key gives you these functions:\n\n- Enter – spawns new terminal\n- Escape – Deletes current window\n- Insert – Lowers current window\n- h,j,k,l – Move window left, down, up, right 16 pixels\n- y,u,b,n – Move window to top-left, top-right, bottom-left, bottom-right corner\n- i – Show information about current window\n- = – Maximize current window vertically (toggle)\n- x – Maximize current window full-screen (toggle)\n\n"
    },
    {
      "title": "Mouse controls",
      "level": 3,
      "content": "By holding down the Alt key, you can perform these functions with the mouse:\n\n- Button 1 – Move window\n- Button 2 – Resize window\n- Button 3 – Lower window\n\n"
    },
    {
      "title": "Virtual desktops",
      "level": 3,
      "content": "Using the keyboard combination of Ctrl+Alt plus a third key gives you these virtual desktop functions:\n\n- 1–8 – Switch virtual desktop\n- Left – Previous virtual desktop\n- Right – Next virtual desktop\n- f – Fix or unfix current window\n\nTo move a window from one virtual desktop to another, fix it, switch desktop, then unfix it. Alt+Tab can also be used to cycle through windows on the current desktop.\n\n"
    },
    {
      "title": "Horizontal window maximize",
      "level": 3,
      "content": "The key combination of Ctrl+Alt+= will maximize a window vertically. To maximize a window horizontally, use Ctrl+Alt+= to maximize it vertically, then Ctrl+Alt+x to maximize it horizontally (as opposed to just using Ctrl+Alt+x to maximize it full-screen).\n\n"
    },
    {
      "title": "Exit evilwm by ending a program",
      "level": 3,
      "content": "By default, evilwm has no quit option. To exit, simply kill X with Ctrl+Alt+Backspace. If you wish, you can exit evilwm by closing a specific program. Instead of using exec evilwm in your ~/.xinitrc file, you can transfer exec to another program. Killing this program will then exit evilwm. For example:\n\n```\n~/.xinitrc\n```\n\n```\n#!/bin/sh\n\nevilwm -snap 10 -bw 2 -fg red &\nexec xclock\n```\n\n"
    },
    {
      "title": "Resize windows using the keyboard",
      "level": 3,
      "content": "Although not mentioned in the man-page, you can resize windows with the keyboard as well as the mouse. Using the same key-combinations for moving a window, just add the Shift key to the mix to resize a window.\n\nCtrl+Alt+Shift: h,j,k,l - Resize window smaller horizontally, larger vertically, smaller vertically, larger horizontally\n\n"
    },
    {
      "title": "Keybindings",
      "level": 3,
      "content": "You can make life easier by using xbindkeys to run commands in evilwm. See Xbindkeys for more details.\n\n"
    },
    {
      "title": "evilwm does not start",
      "level": 3,
      "content": "When you run evilwm, Xorg presents error messages in the log file and/or on the screen and exits. The messages may vary from system to system. Commonly, xorg-fonts-100dpi or xorg-fonts-75dpi is missing. Install either font to solve the problem.\n\nSee the following forum thread.\n\n"
    },
    {
      "title": "Missing fonts.dir",
      "level": 3,
      "content": "If the default /etc/X11/xinit/xinitrc successfully starts Twm but your ~/.xinitrc fails to start evilwm and .local/share/xorg/Xorg.0.log contains a warning about a missing or invalid file fonts.dir in /usr/share/fonts/misc/, follow the advice below the warning and run\n\n```\n$ mkfontdir /usr/share/fonts/misc/\n```\n\nto create that file.\n\nSee also Fonts#Older applications\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official website of evilwm\n\n"
    }
  ]
}