{
  "title": "Exaile (Italiano)",
  "url": "https://wiki.archlinux.org/title/Exaile_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nExaile[link interrotto 2025-01-19] è un gestore e riproduttore musicale per GTK scritto in Python. Permette il recupero automatico di copertine, di testi, il riconoscimento di canzoni; inoltre fornisce il supporto per molti riproduttori musicali portatili, radio su internet come shoutcast e playlist di tablature.\n\n"
    },
    {
      "title": "Installazione",
      "level": 2,
      "content": "Installare il pacchetto exaileAUR.\n\nSe si utilizza ALSA e si vuole utilizzare alsasink invece che quello di default, installare gstreamer0.10-base-pluginsAUR, disponibile nelle Official repositories. Questo dovrebbe risolvere il problema se non si sente alcun suono dopo l'installazione ed anche quando si prova a riprodurre da diverse fonti contemporaneamente.\n\n"
    },
    {
      "title": "Riproduzione CD audio",
      "level": 3,
      "content": "Exaile necessita di python-cddb per riprodurre cd audio. Il pacchetto corretto per questo è cddb-pyAUR.\n\n"
    },
    {
      "title": "Abilitazione di tasti multimediali indipendentemente da DE/WM",
      "level": 2,
      "content": "Prima di tutto, eseguire xev ed ottenere i keycode per i tasti \"Previous\", \"Next\", \"Play\", \"Stop\", e \"Mute\". Creare poi un file di testo ed aggiungere righe seguendo questo formato: keycode 173 = XF86AudioPrev. Sostituire il keycode (173) con il proprio keycode per il tasto \"Previous\". Ripetere il processo per gli altri tasti, sostituendo \"Prev\" con \"Next\", \"Play\", \"Stop\", e \"Mute\".\n\nIn seguito, modificare il file ~/.xinitrc aggiungendo la riga xmodmap <nome_file> prima del comando 'exec' (se è presente) per il DE/WM, dove <nome_file> è il percorso al file di testo appena creato.\n\nInfine, in Exaile, andare su Edit > Preferences > Plugins ed abilitare il plugin XKeys. Dopo il riavvio, i tasti multimediali dovrebbero funzionare.\n\n"
    },
    {
      "title": "Barra di Avanzamento bloccata a 0:00",
      "level": 3,
      "content": "Prima di tutto, assicurarsi che non ci siano problemi con la propria sound architecture (ALSA, OSS, etc.). E che il playback sink su Exaile sia impostato correttamente. Si provi prima ad impostarlo sulla modalità automatica.\n\nSe si sta provando a riprodurre un file MP3, si provi a riprodurre un audio in formato diverso, come .ogg o .flac.\n\n"
    },
    {
      "title": "\"Playback error encountered! Configured audiosink bin0 is not working\"",
      "level": 3,
      "content": "Se si riscontra un errore con questo messaggio, oppure \"Configured audiosink bin1 is not working\" (o con un altro numero dopo 'bin'), può essere che Flash stia bloccando l'utilizzo di ALSA da parte di Exaile. Può essere sistemato dando il comando:\n\n```\nkillall npviewer.bin\n```\n\nIn alcuni casi (ad esempio se è appena terminata la riproduzione di un video su YouTube), Flash potrebbe star bloccando ALSA anche se il processo 'npviewer.bin' non è in esecuzione. In quel caso, aggiornare la pagina in questione se presente un'estensione del browser che blocca Flash dovrebbe risolvere il problema.\n\n"
    },
    {
      "title": "Il plugin \"Last.fm Loved Tracks\" non funziona",
      "level": 3,
      "content": "Quando viene avviato da console, Exaile rilascia un avvertimento su riga di comando:\n\n```\nWARNING : Error while connecting to Last.fm network: 'module' object has no attribute 'LastFMNetwork'\n```\n\nÈ necessario installare il pacchetto python-pylast.\n\n"
    },
    {
      "title": "\"Playback error encountered! No suitable plugins found\"",
      "level": 3,
      "content": "Installare tutti i pacchetti plugin elencati nell'articolo GStreamer e riprovare.\n\n"
    },
    {
      "title": "Riproduzione da SMB Share",
      "level": 3,
      "content": "Sfortunatamente, Exaile non supporta il protocollo smb.\n\n"
    }
  ]
}