{
  "title": "Fan speed control (Français)",
  "url": "https://wiki.archlinux.org/title/Fan_speed_control_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Lm_sensors\n- Undervolting CPU\n- CPU frequency scaling (Français)\n\nLe contrôle des ventilateurs peut apporter de nombreux avantages à votre système, comme un fonctionnement plus silencieux et une économie d'énergie en arrêtant complètement les ventilateurs lorsque la charge du processeur est faible.\n\n"
    },
    {
      "title": "Vue d'ensemble",
      "level": 2,
      "content": "Il existe plusieurs solutions fonctionnelles pour le contrôle des ventilateurs, tant pour les ordinateurs de bureau que pour les ordinateurs portables. En fonction de vos besoins :\n\n- Fancontrol (lm-sensors) — Script (écrit en Bash) pour configurer la vitesse des ventilateurs. Plus adapté aux ordinateurs de bureau et portables, où les contrôles de ventilateurs sont disponibles via sysfs(5).\n- NoteBook Fan Control (NBFC) — Solution multiplateforme pour le contrôle des ventilateurs des ordinateurs portables, écrite en C# et fonctionnant avec le runtime Mono. Convient surtout aux ordinateurs portables les plus récents, non pris en charge par Fancontrol.\n- Portables Dell — Daemon de contrôle de ventilateur alternatif pour certains ordinateurs portables Dell.\n- Portables ThinkPad — Configuration des ventilateurs pour certains ordinateurs portables ThinkPad.\n- Portables ASUS — Configuration de certains ordinateurs portables ASUS pour Fancontrol ou le contrôle manuel.\n- fan2go-gitAUR — Une alternative à Fancontrol indépendante des chemins des périphériques.\n- iswAUR — Configuration des ventilateurs pour certains ordinateurs portables MSI.\n\n"
    },
    {
      "title": "Fancontrol (lm-sensors)",
      "level": 2,
      "content": "fancontrol est une partie de lm_sensors, qui peut être utilisée pour contrôler la vitesse des ventilateurs du CPU/du boîtier.\n\nLa prise en charge des cartes mères plus récentes peut ne pas être encore dans le noyau Linux. Consultez le tableau officiel des périphériques pris en charge par lm-sensors[dead link 2024-10-12 ⓘ] pour voir si des pilotes expérimentaux sont disponibles pour ces cartes mères.\n\n"
    },
    {
      "title": "lm-sensors",
      "level": 3,
      "content": "La première chose à faire est d'exécuter\n\n```\n# sensors-detect\n```\n\nCela détectera tous les capteurs présents et ils seront utilisés pour le fancontrol. Après cela, exécutez ce qui suit pour vérifier s'il a détecté les capteurs correctement :\n\n```\n$ sensors\n```\n\n```\ncoretemp-isa-0000\nAdaptateur : Adaptateur ISA\nCore 0 : +29.0°C (high = +76.0°C, crit = +100.0°C)\n...\nit8718-isa-0290\nAdaptateur : Adaptateur ISA\nVcc : +1,14 V (min = +0,00 V, max = +4,08 V)\nVTT : +2,08 V (min = +0,00 V, max = +4,08 V)\n+3,3V : +3,33 V (min = +0,00 V, max = +4,08 V)\nNB Vcore :    +0,03 V (min = +0,00 V, max = +4,08 V)\nVDRAM :       +2,13 V (min = +0,00 V, max = +4,08 V)\nventilateur1 : 690 RPM (min = 10 RPM)\ntemp1 : +37.5°C (low = +129.5°C, high = +129.5°C) sensor = thermistor\ntemp2 : +25.0°C (low = +127.0°C, high = +127.0°C) capteur = diode thermique\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 3,
      "content": "Une fois les capteurs correctement configurés, utilisez pwmconfig(8) pour tester et configurer le contrôle de la vitesse du ventilateur. En suivant le guide, vous devriez créer /etc/fancontrol, un fichier de configuration personnalisé. Dans le guide, les réponses par défaut sont entre parenthèses si vous appuyez sur entrée sans rien taper. Entrez y pour oui, n pour non.\n\n```\n# pwmconfig\n```\n\n"
    },
    {
      "title": "Ajustement",
      "level": 4,
      "content": "Certains utilisateurs peuvent vouloir modifier manuellement le fichier de configuration après avoir exécuté pwmconfig avec les privilèges root, généralement pour corriger quelque chose. Pour modifier manuellement le fichier de configuration /etc/fancontrol, consultez fancontrol(8) pour les définitions des variables.\n\nLes utilisateurs rencontreront probablement les problèmes de chemin d'accès à hwmon comme indiqué ci-dessus dans #Fancontrol (lm-sensors). Consultez #Les chemins des périphériques ont changé dans /etc/fancontrol pour plus d'informations.\n\n"
    },
    {
      "title": "Exécution de Fancontrol",
      "level": 3,
      "content": "Essayez d'exécuter fancontrol :\n\n```\n# fancontrol\n```\n\nUne installation correctement configurée ne produira pas d'erreurs et prendra le contrôle des ventilateurs du système. Les utilisateurs devraient entendre les ventilateurs du système démarrer peu après l'exécution de cette commande. La commande fancontrol peut également être exécutée en démarrant/activant fancontrol.service.\n\nPour une interface graphique non officielle, installez. fancontrol-guiAUR ou fancontrol-kcmAUR[broken link: package not found].\n\n"
    },
    {
      "title": "Fancontrol cesse de fonctionner après des cycles de suspension-réveil",
      "level": 3,
      "content": "Malheureusement, fancontrol ne fonctionne pas après une suspension. Conformément au bug reporté, vous devez redémarrer fancontrol après une suspension. Ceci peut être réalisé automatiquement par un hook systemd (en).\n\n"
    },
    {
      "title": "NBFC",
      "level": 2,
      "content": "NBFC est une solution multiplateforme de contrôle des ventilateurs pour les ordinateurs portables. Il est livré avec un système de configuration puissant, qui permet de l'adapter à de nombreux modèles d'ordinateurs portables, y compris certains des plus récents.\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "NBFC peut être installé avec nbfcAUR ou nbfc-gitAUR. Pensez à démarrer/activer nbfc.service.\n\n"
    },
    {
      "title": "Configuration",
      "level": 3,
      "content": "NBFC est livré avec des profils prédéfinis. Vous pouvez les trouver dans le répertoire /opt/nbfc/Configs/. Lorsque vous les appliquez, utilisez le nom exact du profil sans extension de fichier (par exemple, some profile.xml devient \"some profile\").\n\nVérifiez s'il y a quelque chose que NBFC peut recommander :\n\n```\n$ nbfc config -r\n```\n\nS'il y a au moins un modèle, essayez d'appliquer ce profil et consultez comment les vitesses des ventilateurs sont gérées. Par exemple :\n\n```\n$ nbfc config -a \"Asus Zenbook UX430UA\"\n```\n\nNote: Si la solution ci-dessus ne vous a pas aidé, essayez d'ajouter ec_sys.write_support=1 aux paramètres du noyau.\n\n```\n# mv /opt/nbfc/Plugins/StagWare.Plugins.ECSysLinux.dll /opt/nbfc/Plugins/StagWare.Plugins.ECSysLinux.dll.old\n```\n\nSi la solution ci-dessus ne vous a pas aidé, essayez d'ajouter ec_sys.write_support=1 aux paramètres du noyau.\n\nS'il n'y a pas de modèles recommandés, allez sur NBFC git repository ou /opt/nbfc/Configs/ et vérifiez s'il existe des modèles similaires disponibles chez le même fabricant. Par exemple pour un Asus Zenbook UX430UQ, la configuration Asus Zenbook UX430UA ne fonctionnait pas bien (ventilateurs complètement arrêtés tout le temps), mais Asus Zenbook UX410UQ fonctionnait parfaitement.\n\nExécutez nbfc pour consulter toutes les options. Plus d'informations sur la configuration sont disponibles sur le wiki des développeurs.\n\n"
    },
    {
      "title": "NBFC-Linux",
      "level": 2,
      "content": "NBFC-Linux est une implémentation légère de NBFC, écrite en C. Elle ne dépend pas du framework Mono. Elle peut être installée avec nbfc-linuxAUR ou nbfc-linux-gitAUR.\n\n"
    },
    {
      "title": "Portables Dell",
      "level": 2,
      "content": "i8kutils est un daemon permettant de configurer la vitesse du ventilateur en fonction de la température du CPU sur certains ordinateurs portables Dell Inspiron et Latitude. Il utilise l'interface /proc/i8k fournie par le pilote i8k (un alias pour dell_smm_hwmon). Les résultats varieront en fonction du modèle exact de l'ordinateur portable.\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "i8kutilsAUR est le paquet principal pour contrôler la vitesse du ventilateur. En outre, vous pouvez vouloir installer les éléments suivants :\n\n- acpi - doit être installé pour utiliser i8kmon.\n- tcl - doit être installé afin d'exécuter i8kmon en tant que service d'arrière-plan (en utilisant l'option --daemon).\n- tk - doit être installé en même temps que tcl pour fonctionner comme applet de bureau X11.\n- dell-bios-fan-control-gitAUR - recommandé si votre BIOS outrepasse le contrôle du ventilateur.\n\n"
    },
    {
      "title": "Configuration",
      "level": 3,
      "content": "Les points de température auxquels le ventilateur change de vitesse peuvent être ajustés dans le même fichier de configuration. Seules trois vitesses de ventilateur sont prises en charge (haute, basse et arrêt). Recherchez une section similaire à la suivante :\n\n```\nset config(0) {{0 0} -1 55 -1 55}\nset config(1) {{1 1}  45 75 45 75}\nset config(2) {{2 2} 65 128 65 128}\n```\n\nCet exemple fait démarrer le ventilateur à faible vitesse lorsque la température du CPU atteint 55 °C, et le fait passer à la vitesse élevée à 75 °C. Le ventilateur repasse en vitesse lente lorsque la température descend à 65 °C, et s'arrête complètement à 45 °C.\n\n"
    },
    {
      "title": "Installation en tant que service",
      "level": 3,
      "content": "i8kmon peut être lancé automatiquement en démarrant/activant. i8kmon.service.\n\n"
    },
    {
      "title": "Contrôle du ventilateur par le BIOS",
      "level": 3,
      "content": "Certains ordinateurs portables plus récents ont un contrôle de ventilateur par le BIOS en place qui remplacera le contrôle de ventilateur au niveau du système d'exploitation. Pour tester si c'est le cas, exécutez i8kmon en mode verbeux dans une ligne de commande, assurez-vous que le CPU est inactif, puis consultez si le ventilateur est éteint ou réduit en conséquence.\n\nSi le contrôle du ventilateur du BIOS est en place, vous pouvez essayer d'utiliser dell-bios-fan-control-gitAUR :\n\nPour activer le contrôle des ventilateurs du BIOS :\n\n```\n# dell-bios-fan-control 1\n```\n\nPour désactiver le contrôle du ventilateur par le BIOS :\n\n```\n# dell-bios-fan-control 0\n```\n\nLe contrôle du ventilateur du BIOS peut être automatiquement désactivé en démarrant/activant. dell-bios-fan-control.service.\n\n"
    },
    {
      "title": "Portables ThinkPad",
      "level": 2,
      "content": "Parmi les daemons de contrôle des ventilateurs figurent simpfand-gitAUR et thinkfanAUR (recommandé).\n\n"
    },
    {
      "title": "Installation",
      "level": 3,
      "content": "Installez thinkfanAUR ou thinkfan-gitAUR. Optionnellement, mais recommandé, installez lm_sensors. Ensuite, jetez un oeil aux fichiers :\n\n```\n# pacman -Ql thinkfan\n```\n\nNotez que le paquet thinkfan installe /usr/lib/modprobe.d/thinkpad_acpi.conf, qui contient\n\n```\noptions thinkpad_acpi fan_control=1\n```\n\nLe contrôle du ventilateur est donc activé par défaut.\n\nMaintenant, chargez le module :\n\n```\n# modprobe thinkpad_acpi\n# cat /proc/acpi/ibm/fan\n```\n\nVous devriez consulter que le niveau du ventilateur est \"auto\" par défaut, mais vous pouvez envoyer une commande level dans le même fichier pour contrôler la vitesse du ventilateur manuellement :\n\n```\n# echo level 1 > /proc/acpi/ibm/fan\n```\n\nTable content:\nNiveau | Effet\n0 | off\n2 | basse vitesse\n4 | vitesse moyenne\n7 | vitesse maximale\nauto | par défaut - automatique\nfull-speed | vitesse maximale réelle\n\nLe daemon thinkfan le fera automatiquement.\n\n\"7\" n'est pas la même chose que \"full-speed\". \"7\" est la vitesse maximale régulée. full-speed est la vitesse maximale non régulée.\n\nEnfin, activez thinkfan.service.\n\nPour configurer les seuils de température, vous devrez copier le fichier de configuration exemple (/usr/share/doc/thinkfan/examples/thinkfan.yaml) dans /etc/thinkfan.conf, et le modifier à votre goût. Ce fichier spécifie les capteurs à lire, et l'interface à utiliser pour contrôler le ventilateur. Certains systèmes ont /proc/acpi/ibm/fan et /proc/acpi/ibm/thermal disponibles ; sur d'autres, vous devrez spécifier quelque chose comme :\n\n```\nhwmon /sys/devices/virtual/thermal/thermal_zone0/temp\n```\n\npour utiliser les capteurs génériques hwmon au lieu des capteurs spécifiques au thinkpad.\n\n"
    },
    {
      "title": "Exécution",
      "level": 3,
      "content": "Vous pouvez d'abord tester votre configuration en exécutant thinkfan manuellement (en tant que root) :\n\n```\n# thinkfan -n\n```\n\net consultez comment il réagit au niveau de charge des autres programmes que vous avez en cours d'exécution.\n\nLorsque vous l'avez configuré correctement, démarrez/activez thinkfan.service.\n\n"
    },
    {
      "title": "Portables ASUS",
      "level": 2,
      "content": "Ce sujet couvrira la configuration des pilotes sur les ordinateurs portables ASUS pour Fancontrol (lm-sensors).\n\n"
    },
    {
      "title": "Modules du noyau",
      "level": 3,
      "content": "Dans les fichiers de configuration, nous allons utiliser les chemins complets des fichiers sysfs (par exemple /sys/devices/platform/asus-nb-wmi/hwmon/hwmon[[:print :]]*/pwm1). Ceci est dû au fait que hwmon1 pourrait se transformer en n'importe quel autre numéro après le redémarrage. Fancontrol (lm-sensors) est écrit en Bash, donc utiliser ces chemins dans le fichier de configuration est tout à fait acceptable. Vous pouvez trouver des exemples complets de fichiers de configuration /etc/fancontrol à la page ASUS N550JV#Fan control.\n\n"
    },
    {
      "title": "asus-nb-wmi",
      "level": 4,
      "content": "asus-nb-wmi est un module du noyau, qui est inclus dans le noyau Linux et est chargé automatiquement sur les ordinateurs portables ASUS. Il ne permet de contrôler qu'un seul ventilateur et s'il y a un deuxième ventilateur, vous n'aurez aucun contrôle sur celui-ci. Notez que la mise en liste noire de ce module empêchera le rétro-éclairage du clavier de fonctionner.\n\nVous trouverez ci-dessous les commandes pour le contrôler. Vérifiez si vous avez un contrôle sur votre ventilateur :\n\n```\n# echo 255 > /sys/devices/platform/asus-nb-wmi/hwmon/hwmon[[:print :]]*/pwm1 # Vitesse complète du ventilateur (Valeur : 255)\n# echo 0 > /sys/devices/platform/asus-nb-wmi/hwmon/hwmon[[:print :]]*/pwm1 # Le ventilateur est arrêté (Valeur : 0)\n# echo 2 > /sys/devices/platform/asus-nb-wmi/hwmon/hwmon[[:print :]]*/pwm1_enable # Change le mode de ventilation en automatique\n# echo 1 > /sys/devices/platform/asus-nb-wmi/hwmon/hwmon[[:print :]]*/pwm1_enable # Change le mode de ventilation en manuel\n# echo 0 > /sys/devices/platform/asus-nb-wmi/hwmon/hwmon[[:print :]]*/pwm1_enable # Change le mode du ventilateur à pleine vitesse\n```\n\nSi vous avez pu modifier la vitesse du ventilateur avec les commandes ci-dessus, continuez avec #Générer le fichier de configuration avec pwmconfig.\n\n"
    },
    {
      "title": "asus_fan",
      "level": 4,
      "content": "asus_fan est un module du noyau, qui permet de contrôler les deux ventilateurs sur certains anciens ordinateurs portables ASUS. Il ne fonctionne pas avec les modèles les plus récents.\n\nInstallez le module du noyau asus-fan-dkms-gitAUR (qui utilise DKMS), fournissant asus_fan :\n\n```\n# modprobe asus_fan\n```\n\nVérifiez si vous avez un contrôle sur les deux ventilateurs :\n\n```\n# echo 255 > /sys/devices/platform/asus_fan/hwmon/hwmon[[:print :]]*/pwm1 # Vitesse complète du ventilateur du CPU (Valeur : 255)\n# echo 0 > /sys/devices/platform/asus_fan/hwmon/hwmon[[:print :]]*/pwm1 # Le ventilateur du CPU est arrêté (Valeur : 0)\n# echo 255 > /sys/devices/platform/asus_fan/hwmon/hwmon[[:print :]]*/pwm2 # Vitesse du ventilateur du GFX complet (Valeur : 255)\n# echo 0 > /sys/devices/platform/asus_fan/hwmon/hwmon[[:print :]]*/pwm2 # Le ventilateur du GFX est arrêté (Valeur : 0)\n# echo 2 > /sys/devices/platform/asus_fan/hwmon/hwmon[[:print :]]*/pwm1_enable # Change le mode de ventilation du CPU en automatique\n# echo 1 > /sys/devices/platform/asus_fan/hwmon/hwmon[[:print :]]*/pwm1_enable # Change le mode de ventilation du CPU en manuel\n# echo 2 > /sys/devices/platform/asus_fan/hwmon/hwmon[[:print :]]*/pwm2_enable # Change le mode de ventilation du GFX en automatique\n# echo 1 > /sys/devices/platform/asus_fan/hwmon/hwmon[[:print :]]*/pwm2_enable # Change le mode de ventilation du GFX en manuel\n# cat /sys/devices/platform/asus_fan/hwmon/hwmon[[:print :]]*/temp1_input # Affiche la température du GFX (sera toujours 0 lorsque le GFX est désactivé/non utilisé)\n```\n\nSi tout fonctionne, vous pouvez charger ce module noyau au démarrage (en) :\n\n```\n/etc/modules-load.d/asus_fan.conf\n```\n\n```\nasus_fan\n```\n\nContinuez avec #Générer le fichier de configuration avec pwmconfig.\n\n"
    },
    {
      "title": "Générer le fichier de configuration avec pwmconfig",
      "level": 3,
      "content": "Si vous obtenez une erreur There are no working fan sensors, all readings are 0 lors de la génération du fichier de configuration avec pwmconfig, ouvrez la première console et exécutez :\n\n```\n# watch -n 1 \"echo 2 > /sys/devices/platform/kernel_module/hwmon/hwmon[[:print :]]*/pwm1_enable\"\n```\n\nSi vous utilisez le module noyau asus_fan et que vous avez un 2ème ventilateur, dans la deuxième console :\n\n```\n# watch -n 1 \"echo 2 > /sys/devices/platform/kernel_module/hwmon/hwmon[[:print :]]*/pwm'2_enable\"\n```\n\nEt enfin, dans la troisième console :\n\n```\n# pwmconfig\n```\n\nUne fois que vous avez terminé et que le fichier de configuration est généré, vous devez arrêter les première et deuxième consoles. Continuez avec #Fancontrol (lm-sensors). Une fois le fichier de configuration généré, vous devrez peut-être remplacer manuellement les valeurs PWM par les chemins complets de sysfs tels qu'ils sont utilisés dans ces étapes, car les valeurs des numéros hwmon peuvent changer après un redémarrage.\n\n"
    },
    {
      "title": "Méthode alternative utilisant les registres EC",
      "level": 3,
      "content": "Si les méthodes ci-dessus ne fonctionnent pas pour vous, une méthode alternative consiste à écrire directement dans certains registres du contrôleur embarqué (EC). À l'aide de l'outil EC-Probe tool, vous pouvez régler le mode de ventilation sur l'un des trois modes de vitesse de ventilation, à condition que votre modèle offre cette fonctionnalité sous Windows.\n\nDans le modèle ASUS FX504GD, le réglage de la vitesse du ventilateur sur l'un des trois modes utilise les valeurs de registre suivantes :\n\n```\n# ec_probe write 0x5e 0x80 # mode silencieux\n# ec_probe write 0x5e 0x40 # mode balance\n# ec_probe write 0x5e 0xC0 # mode performance\n```\n\nIci nous écrivons dans le registre 0x5e qui est responsable du réglage du mode de vitesse du ventilateur.\n\nSi ces valeurs ne vous conviennent pas, exécutez l'outil ec-probe en mode moniteur sous Windows et essayez d'identifier quel registre de l'EC change de valeur lorsque vous passez d'un mode de vitesse de ventilateur à un autre.\n\n"
    },
    {
      "title": "Configuration de la politique d'accélération thermique",
      "level": 3,
      "content": "Au lieu de contrôler manuellement la vitesse du ventilateur en utilisant asus-nb-wmi, il est également possible de définir la thermal throttling policy pour avoir une politique de contrôle du ventilateur plus ou moins agressive. Les valeurs possibles sont les suivantes : 0 (par défaut), 1 (suralimentation) et 2 (silencieux).\n\n```\n# echo number > /sys/devices/platform/asus-nb-wmi/hwmon/hwmon[[:print :]]*/throttle_thermal_policy\n```\n\n"
    },
    {
      "title": "Modes de contrôle des ventilateurs sur certains ordinateurs portables de la série TUF",
      "level": 3,
      "content": "Sur certains ordinateurs portables ASUS de la série TUF, les modes de contrôle des performances et des ventilateurs peuvent être modifiés en utilisant Fn+F5. Le mode actuel peut être visualisé en exécutant la commande suivante :\n\n```\n$ cat /sys/devices/platform/asus-nb-wmi/fan_boost_mode\n```\n\nVous pouvez voir la valeur changer lorsque vous appuyez sur Fn+F5. 0 correspond au \"Mode normal\", 1 au \"Mode performance\", 2 est très probablement le \"Mode silencieux\". [2] Il est également possible d'écrire ces valeurs dans le fichier fan_boost_mode en tant que root et d'obtenir l'effet désiré.\n\nCeci a été testé sur les modèles ASUS TUF FX504GE et ASUS TUF FX504GD et s'est avéré fonctionner.\n\n"
    },
    {
      "title": "Contrôle du ventilateur AMDGPU par sysfs",
      "level": 2,
      "content": "Le pilote du noyau AMDGPU offre un contrôle du ventilateur pour les cartes graphiques via hwmon dans sysfs.\n\n"
    },
    {
      "title": "Configuration du contrôle manuel",
      "level": 3,
      "content": "Pour passer du contrôle automatique au contrôle manuel du ventilateur, exécutez\n\n```\n# echo \"1\" > /sys/class/drm/card0/device/hwmon/hwmon0/pwm1_enable\n```\n\nRéglez la vitesse du ventilateur à, par exemple, 50 % (100 % correspondent à 255 cycles PWM, calculez donc le pourcentage de vitesse du ventilateur souhaité en multipliant sa valeur par 2,55) :\n\n```\n# echo \"128\" > /sys/class/drm/card0/device/hwmon/hwmon0/pwm1\n```\n\nPour revenir au contrôle automatique des ventilateurs, exécutez\n\n```\n# echo \"2\" > /sys/class/drm/card0/device/hwmon/hwmon0/pwm1_enable\n```\n\n"
    },
    {
      "title": "amdgpu-fan",
      "level": 3,
      "content": "Le paquet amdgpu-fanAUR est un contrôleur de ventilateur automatisé pour les cartes vidéo compatibles AMDGPU écrit en Python. Il utilise une \"matrice de vitesse\" pour faire correspondre la fréquence des ventilateurs avec la température du GPU, par exemple :\n\n```\nmatrice_de_vitesse :  # -[temp(*C), speed(0-100%)]\n- [0, 0]\n- [40, 30]\n- [60, 50]\n- [80, 100]\n```\n\nLancez le service de contrôle du ventilateur en démarrant/activant amdgpu-fan.service.\n\n"
    },
    {
      "title": "amdfand-bin",
      "level": 3,
      "content": "Le paquet amdfand-binAUR est une alternative native à amdgpu-fanAUR. Lancez le service de contrôle des ventilateurs en démarrant/activant amdfand.service.\n\nPour cet outil, il existe également des interfaces graphiques : amdguid-glow-binAUR (Xorg) et amdguid-wayland-binAUR (Wayland). Avant de lancer le client, activez et démarrez amdgui-helper.service.\n\n"
    },
    {
      "title": "Script fancurve",
      "level": 3,
      "content": "Non seulement le contrôle des ventilateurs est offert via hwmon dans sysfs, mais aussi la lecture de la température du GPU :\n\n```\ncat /sys/class/drm/card0/device/hwmon/hwmon0/temp1_input\n```\n\nCela donne la température du GPU en °C + trois zéros, par exemple 33000 pour 33°C.\n\nLe script bash amdgpu-fancontrol de grmat offre un contrôle entièrement automatique du ventilateur en utilisant la fonctionnalité sysfs hwmon décrite. Il permet également d'ajuster confortablement les assignations de cycles de température/PWM de la courbe de ventilation et une hystérésis en offrant des champs de configuration abstraits en haut du script.\n\nPour des raisons de sécurité, le script règle à nouveau le contrôle des ventilateurs sur auto lors de l'arrêt. Cela peut provoquer la rotation des ventilateurs, ce qui peut être contourné au prix de la sécurité en définissant set_fanmode 1 dans la section function reset_on_fail.\n\n"
    },
    {
      "title": "Configuration du script fancurve",
      "level": 4,
      "content": "Pour démarrer le script, il est recommandé de le faire via le système init systemd. De cette façon, la sortie verbeuse du script peut être lue via journalctl/systemctl status. À cette fin, un fichier unitaire .service est déjà inclus dans le dépôt GitHub.\n\nIl peut également être nécessaire de redémarrer le script via un root-resume.service après une hibernation afin de le faire fonctionner à nouveau automatiquement et correctement :\n\n```\n/etc/systemd/system/root-resume.service\n```\n\n```\n[Unit]\nDescription=Local system resume actions\nAfter=suspend.target\n\n[Service]\nType=simple\nExecStart=/usr/bin/systemctl restart amdgpu-fancontrol.service\n\n[Install]\nWantedBy=suspend.target\n```\n\n"
    },
    {
      "title": "Augmenter le diviseur du ventilateur pour les capteurs",
      "level": 3,
      "content": "Si sensors n'affiche pas le régime du ventilateur du CPU, il peut être nécessaire de changer le diviseur du ventilateur.\n\nLa première ligne de la sortie de sensors est le chipset utilisé par la carte mère pour la lecture des températures et des tensions.\n\nCréez un fichier dans /etc/sensors.d/ :\n\n```\n/etc/sensors.d/fan-speed-control.conf\n```\n\n```\n}\nchip 'coretemp-isa-*\"\nset fan \"X_div 4\n```\n\nRemplacer coretemp-isa- par le nom du chipset et X par le numéro du ventilateur du CPU à modifier.\n\nSauvegardez le fichier, et exécutez-le en tant que root :\n\n```\n# sensors -s\n```\n\nce qui rechargera les fichiers de configuration.\n\nExécutez sensors à nouveau, et vérifiez s'il y a une lecture du RPM. Si ce n'est pas le cas, augmentez le diviseur à 8, 16 ou 32. Tout dépendra de votre matériel.\n\n"
    },
    {
      "title": "Les chemins des périphériques ont changé dans /etc/fancontrol",
      "level": 3,
      "content": "Les liens symboliques hwmon énumérés situés dans /sys/class/hwmon/ peuvent varier dans l'ordre car les modules du noyau ne sont pas chargés dans un ordre cohérent par démarrage. De ce fait, fancontrol peut ne pas fonctionner correctement. L'erreur est \"Configuration appears to be outdated, please run pwmconfig again\". Bogue en amont.\n\n"
    },
    {
      "title": "Solution",
      "level": 4,
      "content": "Dans /etc/conf.d/lm_sensors, il y a 2 tableaux qui listent tous les modules détectés lorsque vous exécutez sensors-detect. Ils sont chargés par fancontrol. Si le fichier n'existe pas, exécutez sensors-detect en tant que root, en acceptant les valeurs par défaut. Ouvrez (ou créez) /etc/modules-load.d/modules.conf. Récupérez tous les modules listés à partir des 2 variables dans /etc/conf.d/lm_sensors/ et placez-les dans le fichier /etc/modules-load.d/modules.conf, un module par ligne. Les spécifier de cette manière devrait créer un ordre défini pour le chargement des modules, ce qui devrait permettre aux chemins de hwmon de rester où ils sont et de ne pas changer d'ordre à chaque démarrage. Si cela ne fonctionne pas, je vous recommande fortement de trouver un autre programme pour contrôler vos ventilateurs. Si vous n'en trouvez pas, vous pouvez essayer d'utiliser la solution alternative ci-dessous.\n\n"
    },
    {
      "title": "Solution alternative : chemins absolus",
      "level": 4,
      "content": "L'utilisation de chemins de fichiers absolus dans fancontrol ne fonctionne pas par défaut, car son script d'aide pwmconfig est programmé pour n'utiliser que les chemins hwmon pour obtenir les fichiers. Pour cela, il détecte si le chemin hwmon fourni dans son fichier de configuration /etc/fancontrol n'a pas changé, et utilise les variables DEVNAME et DEVPATH pour déterminer ce changement. Si vos chemins hwmon changent constamment, cela empêchera fancontrol de fonctionner quoi que vous fassiez. Cependant, il est possible de contourner ce problème. Ouvrez /usr/bin/fancontrol, et commentez cette partie du script :\n\n```\nif ! ValidateDevices \"$DEVPATH\" \"$DEVNAME\"\n alors\n     echo \"La configuration semble être périmée, veuillez exécuter pwmconfig à nouveau\". >&2\n     exit 1\n fi\n```\n\n- En faisant cela, fancontrol peut écrire dans les fichiers que vous lui avez donnés dans le fichier de configuration, quel que soit le fichier. Cela peut corrompre les fichiers si vous fournissez le mauvais chemin. Assurez-vous que vous utilisez le chemin correct pour vos fichiers.\n- Une autre chose à noter est que si vous utilisez cette solution de contournement, l'utilisation de pwmconfig pour créer à nouveau votre script écrasera tous les chemins absolus que vous avez configurés. Par conséquent, il est préférable de changer manuellement les anciens chemins en nouveaux chemins si nécessaire au lieu d'utiliser pwmconfig.\n\nLa mise en commentaire de cet élément devrait effectivement ignorer les contrôles de validation de hwmon. Vous pouvez également ignorer les variables DEVNAME et DEVPATH dans le fichier de configuration. Après cela, remplacez tous les chemins de hwmon dans les autres variables par son chemin absolu. Pour plus de facilité, réexécutez pwmconfig avec les privilèges de l'utilisateur root pour rafraîchir les périphériques hwmon. Les chemins de hwmon dans le fichier de configuration devraient maintenant pointer vers les chemins absolus corrects. Pour chaque chemin hwmon, exécutez la commande suivante (où N est l'énumération du chemin hwmon) :\n\n```\n$ readlink -f /sys/class/hwmon/hwmonN/device\n```\n\nCela vous donnera le chemin absolu du périphérique.\n\nPar exemple, un fichier /etc/fancontrol liste FCTEMPS comme ceci :\n\n```\nFCTEMPS=hwmon2/pwm1=hwmon3/temp1_input\n```\n\nL'exécution de readlink -f /sys/class/hwmon/hwmon3/device peut, par exemple, produire /sys/devices/platform/coretemp.0/. cd dans ce répertoire. Si vous consultez un répertoire /hwmon/hwmonN/, vous devez le faire dans votre fichier de configuration fancontrol pour remplacer le chemin hwmonN. A partir de l'exemple précédent :\n\n```\n# AVANT\nFCTEMPS=hwmon2/pwm1=hwmon3/temp1_input\n# APRÈS\nFCTEMPS=hwmon2/pwm1=/sys/devices/platform/coretemp.0/hwmon/[[:print :]]*/temp1_input\n```\n\nEssentiellement, vous devez remplacer le chemin hwmon par le chemin absolu, concaténé avec /hwmon/[[:print :]]*/ afin que bash puisse attraper le nom hwmon énuméré au hasard.\n\nSi vous ne consultez pas le répertoire /hwmon/hwmonN/, vous n'avez pas à vous en soucier. Cela signifie que les fichiers de température se trouvent à la racine du répertoire de l'appareil. Remplacez simplement hwmonN/ par le chemin absolu du fichier. Par exemple :\n\n```\n#AVANT\nFCTEMPS=hwmon2/pwm1=hwmon3/temp1_input\n#APRÈS\nFCTEMPS=hwmon2/pwm1=/sys/devices/platform/coretemp.0/temp1_input\n```\n\nAprès avoir remplacé tous les chemins, fancontrol devrait fonctionner correctement.\n\n"
    }
  ]
}