{
  "title": "FAQ (Suomi)",
  "url": "https://wiki.archlinux.org/title/FAQ_(Suomi)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Tämän artikkelin käännös ei vastaa alkuperäistä tekstiä.** Tämän artikkelin käännös ei vastaa alkuperäistä tekstiä.\n\nTämän artikkelin käännös ei vastaa alkuperäistä tekstiä.\n\n"
    },
    {
      "title": "Mikä on Arch Linux?",
      "level": 3,
      "content": "Katso Arch Linux -artikkeli.\n\n"
    },
    {
      "title": "Miksi en haluaisi käyttää Archia?",
      "level": 3,
      "content": "Et ehkä halua käyttää Archia, jos:\n\n- sinulla ei ole kykyä/aikaa/halua 'tee-se-itse' GNU/Linux-jakelulle.\n- tarvitset tukea muulle arkkitehtuurille kuin x86_64:lle.\n- pidät tiukkaa linjaa käyttämällä jakelua, joka tarjoaa vain GNUn määrittelemää vapaata ohjelmistoa.\n- olet sitä mieltä, että käyttöjärjestelmän pitäisi säätää asetukset itse, toimia heti asennuksen jälkeen, ja sisältää kokonaisen valikoiman esiasennettuja sovelluksia ja työpöytäympäristön jo asennusmedialla.\n- et halua rullaavan julkaisun GNU/Linux-jakelua.\n- olet tyytyväinen nykyiseen käyttöjärjestelmääsi.\n\n"
    },
    {
      "title": "Mitä arkkitehtuureita Arch tukee?",
      "level": 3,
      "content": "Arch tukee ainoastaan x86_64 (joskus nimellä amd64) -arkkitehtuuria. Tuki i686:lle lopetettiin marraskuussa 2017 [1].\n\ni686-arkkitehtuurille ja ARM-prosessoreille on olemassa epävirallisia käännöksiä [2] ja [3], joista kullakin on omat yhteisökanavat. [4][dead link 2024-01-13 ⓘ]\n\n"
    },
    {
      "title": "Noudattaako Arch Linux Foundationin tiedostojärjestelmän hierarkiastandardia (FHS)?",
      "level": 3,
      "content": "Arch Linux noudattaa tiedostojärjestelmän hierarkiaa käyttöjärjestelmille, jotka käyttävät systemd-palvelunhallintaohjelmaa. Katso file-hierarchy(7) selitys joka hakemistosta nimityksineen. Erityisesti, /bin, /sbin, ja /usr/sbin ovat symbolisia linkkejä hakemistolle /usr/bin, ja /lib ja /lib64 ovat symbolisia linkkejä hakemistolle /usr/lib.\n\n"
    },
    {
      "title": "Olen täysin GNU/Linux -aloittelija. Pitäisikö minun käyttää Archia?",
      "level": 3,
      "content": "A) Tämä kysymys on herättänyt paljon keskustelua. Arch on suunnattu kokeneemmille GNU/Linux -käyttäjille, mutta joidenkin mielestä Arch ei ole huono paikka lähteä liikkeelle. Jos olet aloittelija joka haluaisi käyttää Archia, ymmärrä että sinun täytyy oppia ja hyväksyä Archin olevan pitkälti tee-se-itse -jakelu jonka käyttäjä itse kokoaa ja jota hallitsee. Ennen lisäkysymysten esittämistä tee oma tutkimuksesi googlaamalla, Wikiä tutkimalla, keskustelupalstalta etsimällä ja vanhat FAQ:t lukemalla. Näin tehtyäsi tulet pärjäämään hyvin. Yritä myös muistaa että kovin moni ei jaksa vastata uudelleen ja uudelleen samoihin peruskysymyksiin; syyttä ei tätäkään tietolähdettä kirjoitettu ja saatettu luettavaksi.\n\n"
    },
    {
      "title": "Milloin uusi julkaisu tulee saataville?",
      "level": 3,
      "content": "A) Arch Linuxin julkaisut tapahtuvat samaan aikaan isompien kernelpäivitysten kanssa. Ne ovat kuitenkin lähinnä /core-pakettivaraston tilannevedoksia ja asennusskriptin ominaisuuspäivityksiä. Rolling release -mallin ansiosta jokainen Arch Linux -järjestelmä pysyy ajan tasalla ja kehityksen kärjessä yhdellä komennolla.\n\nTästä syystä uudet julkaisut eivät ole erityisen tärkeitä Arch-maailmassa, sillä rolling release -järjestelmä tekee uusista julkaisuista vanhentuneita heti pakettien päivittyessä uusiin versioihin. Jos etsit tapaa päivittää uusimpaan Arch Linux -julkaisuun, sinun ei tarvitse asentaa mitään uudestaan. Sinun tarvitsee vain ajaa pacman -Syu -komento, ja järjestelmäsi on pian identtinen ihkauuden asennuksen kanssa.\n\nSamasta syystä uudet Arch Linux -julkaisut eivät yleensä ole täynnä uusia ja jännittäviä ominaisuuksia. Kaikki uusi ja jännittävä julkaistaan tarvittaessa samalla kun pakettivaraston paketteja päivitetään, ja voidaan asentaa järjestelmään komennolla pacman -Syu.\n\n"
    },
    {
      "title": "Arch tarvitsee enemmän julkisuutta (ts. mainontaa)",
      "level": 3,
      "content": "Arch saa nykyiselläänkin varsin paljon julkisuutta. Arch Linuxin päämäärä ei ole kasvaa suureksi, vaan tarjota elegantti, minimalistinen ja kehityksen kärjessä oleva ohjelmistokokonaisuus joka keskittyy yksinkertaisuuteen ja koodin oikeellisuuteen. Kasvua tapahtuu luonnostaan kohdekäyttäjien keskuudessa. Kasvun pakottaminen tulisi aiheuttamaan ongelmia.\n\nSamaan tapaan kehitysmalli ei rajoita luonnollista kasvua. Enemmän käyttäjiä merkitsee enemmän kehittäjiä työskentelemään Arch Linuxin parissa. Tämä saattaa aiheuttaa joitain hallinnollisia ongelmia projektin huipulla, mutta niistä huolehditaan sitä mukaa kun niitä ilmestyy.\n\n"
    },
    {
      "title": "Arch tarvitsee enemmän kehittäjiä",
      "level": 3,
      "content": "Tämä on mahdollista. Voit liittyä vapaaehtoiseksi jäseneksi Arch Linux-yhteisön hyväksi. Vilkaise foorumia, IRC-kanavaa tai sähköpostilistoja saadaksesi selville asioita joiden tiimoilta apu kelpaisi. Ja ainahan voit olla avuksi myös Wikin kautta kirjoittamalla tai kääntämällä lisää artikkeleita.\n\n"
    },
    {
      "title": "Miksi internet on hitaampi verrattuna muihin käyttöjärjestelmiin?",
      "level": 3,
      "content": "Ennen lisäkysymyksiä on syytä tarkastaa verkkoasetukset. Tuplatarkasta tiedostot /etc/rc.conf, /etc/host sekä /etc/resolv.conf. Lisätietoja tässä vaiheessa valitettavasti suomenkielisestä Wikistä ei löydy.\n\n"
    },
    {
      "title": "Löysin virheen paketista X. Mitä minun pitäisi tehdä?",
      "level": 3,
      "content": "Ensinnäkin sinun tulee varmistaa että virhe on Arch-lähtöinen eikä sovelluskohtainen. Mikäli olet varma että bugi on Archissa, voit toimia esimerkiksi seuraavasti:\n\n1. Selaa foorumilta onko joku toinenkin huomannut saman virheen.\n1. Ilmoita asiasta paketin ylläpitäjälle. Tämän saat selville esimerkiksi \"pacman -Qi <paketin nimi>\"-komennolla.\n1. Lähetä yksityiskohtainen selonteko bugista osoitteessa https://bugs.archlinux.org.\n1. Voit myös kirjoittaa foorumille viestin bugista ja sen yksityiskohdista, sekä sen että olet jo tehnyt bugiraportin. Tämä edesauttaa muita mahdollisesti ongelmaan törmääviä.\n\n"
    },
    {
      "title": "Arch-paketit tarvitsevat yhtenäisen nimeämiskäytännön. \".pkg.tar.gz\" ja \".pkg.tar.xz\" ovat liian pitkiä ja/tai sekavia",
      "level": 3,
      "content": "A) Tästä on ollut jo puhetta sähköpostilistan puolella, ja jotkut ehdottivat .pac-päätettä. Tällä hetkellä ei ole kuitenkaan suunnitelmissa muuttaa pakettien tiedostopäätettä. Kysymys on kuitenkin vain vanhasta kunnon gzipatusta tar-pallosta jota monet ohjelmat ymmärtävä mikäli tiedostoja haluaa tutkia tai muokata. Miksi vaihtaa pääte?\n\n"
    },
    {
      "title": "Pacman tarvitsee kirjaston jotta muut ohjelmat pääsevät helposti käsiksi pakettien tietoihin",
      "level": 3,
      "content": "A) Version 3.0.0 jälkeen pacman on ollut käyttöliittymä libalpm (Arch Linux Package Management)-kirjastolle. Kirjasto sallii sille ohjelmoitavan esimerkiksi graafisen käyttöliittymän ilman pacmanin osallisuutta.\n\n"
    },
    {
      "title": "Pacman tarvitsee Ominaisuuden X!",
      "level": 3,
      "content": "A) Archin kantavaan filosofiaan kuuluu ajatus yksinkertaisuuden arvostamisesta, näinollen ns. tarpeettomia ominaisuuksia pyritään välttämään Archin ydinohjelmistoissa. Mikäli koet että ideasi on niin hyvä ja kätevä että sillä olisi mahdollisuus edistää filosofian mukaista kehitystä, voit ilman muuta keskustella aiheesta Arch Linuxin foorumissa.\n\nKaikenkaikkiaan yksinkertaisin keino saada haluttu ominaisuus Arch Linuxiin - tai sen ydinkomponentteihin - on toteuttaa se itse. Ei tietenkään voida luvata että kehittämäsi ominaisuus hyväksyttäisiin virallisesti. Puhumattakaan että se hyväksyttäisiin osaksi jakelua. Voit olla kuitenkin varma että lukuisat muut Archin käyttäjät tulevat arvostamaan tekemääsi työtä tuli siitä virallinen ominaisuus tai ei.\n\n"
    },
    {
      "title": "Miksi virallisissa varastoissa on vain yksi versio jokaista jaettua kirjastoa?",
      "level": 3,
      "content": "Useat jakelut, kuten Debian, sisältää erilaisia versioita jaetuista kirjastoista paketoituna eri paketeilla: libfoo1, libfoo2, libfoo3 ja niin edelleen. Tällä tavalla on mahdollista pitää sovelluksia käännettynä eri libfoo versioita vasten samassa järjestelmässä.\n\nArch virallisesti tukee vain uusinta vakaata versiota paketeista. Pudottamalla tuen vanhentuneille ohjelmille, pakettien ylläpitäjät voivat keskittyä uusimman version päivittämiseen ja sen vakauden varmistamiseen. Niin pian kun uusi jaettu kirjasto tulee saataville ylävirrasta, se lisätään pakettivarastoihin ja paketit joihin tällä on vaikutusta uudelleen kootaan käyttämään uutta versiota.\n\n"
    },
    {
      "title": "Arch tarvitsee asennusohjelman. Ehkä jopa graafisen sellaisen?",
      "level": 3,
      "content": "Tällainen asia on aina kiinni henkilökohtaisesta näkemyksestä. Tässä tapauksessa on parempi yrittää oivaltaa Arch Linuxin yksinkertainen ja kevyt lähestymisfilosofia ja tulla toimeen nykyisenkaltaisen asennusohjelman kanssa. Ja koska kysymyksessä on rolling release-jakelu ei asennusohjelmaan törmätä vasta kun käyttäjä vapaaehtoisesti haluaa asentaa Archin uudelleen ns. puhtaalta pöydältä.\n\n"
    },
    {
      "title": "Miksi 64-bittinen?",
      "level": 3,
      "content": "Muistirekisteriin saa tällöin enemmän avaruutta, eli enemmän välimuistia sekä nopeampi & tehokkaampi prosessori, joissa yleenä on enemmän kuin yksi ydin. Välimuistia saa ainakin 64 Gt käyttöön ja nykyprosessoreissa on nykyään ainakin neljä prosessoriydintä.\n\n"
    }
  ]
}