{
  "title": "Fdisk (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Fdisk_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- File systems\n- gdisk\n- GNU Parted\n- Partitioning\n- dd\n\nutil-linux fdisk bir sabit diskteki bölüm tablolarını ve bölümleri oluşturan ve değiştiren diyalog odaklı bir komut satırı yardımcı programıdır. Sabit diskler bölümlere ayrılır ve bu bölümler bölüm tablosunda tanımlanır.\n\nBu makale fdisk(8) ve onunla ilgili olan fdisk(8) yardımcı programını kapsamaktadır.\n\n"
    },
    {
      "title": "Kurulum",
      "level": 2,
      "content": "fdisk ve ilgili araçlar util-linux paketi tarafından sağlanır ve bu paket base meta paketi'nin bir bağımlılığıdır.\n\n"
    },
    {
      "title": "Bölümleri listeleme",
      "level": 2,
      "content": "Bir blok aygıt üzerindeki bölüm tablolarını ve bölümleri listelemek için, aygıtın /dev/sda, /dev/nvme0n1, /dev/mmcblk0, vb. gibi bir ad olduğu aşağıdaki komutu çalıştırabilirsiniz:\n\n```\n# fdisk -l /dev/sda\n```\n\n"
    },
    {
      "title": "Bölümleme tablosunu yedekleme ve geri yükleme",
      "level": 2,
      "content": "Bir sabit diskte değişiklik yapmadan önce, sürücünün bölümleme tablosunu ve bölümleme düzenini yedeklemek isteyebilirsiniz. Aynı bölüm düzenini çok sayıda sürücüye kopyalamak için de bir yedekleme kullanabilirsiniz.\n\nHem GPT hem de MBR için cihazınızın bölüm düzenini -d/--dump seçeneği ile bir dosyaya kaydetmek için sfdisk kullanabilirsiniz. Aşağıdaki komutu /dev/sda aygıtı için çalıştırabilirsiniz:\n\n```\n# sfdisk -d /dev/sda > sda.dump\n```\n\nDosya, 1 GiB boyutunda tek bir ext4 bölümü için aşağıdaki gibi görünmelidir:\n\n```\nsda.dump\n```\n\n```\nlabel: gpt\nlabel-id: AAAAAAAA-BBBB-CCCC-DDDD-EEEEEEEEEEEE\ndevice: /dev/sda\nunit: sectors\nfirst-lba: 34\nlast-lba: 1048576\nsector-size: 512\n\n/dev/sda1 : start=2048, size=1048576, type=0FC63DAF-8483-4772-8E79-3D69D8477DE4, uuid=BBF1CD36-9262-463E-A4FB-81E32C12BDE7\n```\n\nBu düzeni daha sonra geri yüklemek için çalıştırabilirsiniz:\n\n```\n# sfdisk /dev/sda < sda.dump\n```\n\n"
    },
    {
      "title": "Bir bölümleme tablosu ve bölümü oluşturma",
      "level": 2,
      "content": "Bir diski bölümlemenin ilk adımı bir bölümleme tablosu oluşturmaktır. Bundan sonra, gerçek bölümler istenen bölümleme şeması'na göre oluşturulur. MBR ya da GPT kullanıp kullanmayacağınıza karar vermek için bölümleme tablosu makalesine bakın.\n\nBaşlamadan önce, mevcut bölüm tablonuzu ve şemanızı yedeklemek isteyebilirsiniz.\n\nfdisk, tüm Advanced Format HDD'ler ve hepsi olmasa da SSD'lerin büyük çoğunluğu ile uyumlu olması gereken 2048 512 baytlık sektör (1 MiB) blok boyutu tabanında bölüm hizalamasını otomatik olarak gerçekleştirir. Bu, varsayılan ayarların size uygun hizalamayı sağlayacağı anlamına gelir.\n\nfdisk kullanmak için, programı değiştirmek/düzenlemek istediğiniz blok aygıtın adıyla çalıştırın. Bu örnekte /dev/sda kullanılmıştır:\n\n```\n# fdisk /dev/sda\n```\n\nBu, komutları yazabileceğiniz fdisk diyaloğunu açar.\n\n"
    },
    {
      "title": "Yeni tablo oluşturma",
      "level": 3,
      "content": "- Bölümleme yapmadan önce NVMe sürücülerinizin ve Advanced Format sabit disk sürücülerinizin en uygun mantıksal sektör boyutu kullandığını kontrol edin.\n- Bir SSD'yi bölümlemeden önce SSD bellek hücrelerini temizlemeyi düşünün.\n\nYeni bir bölümleme tablosu oluşturmak ve mevcut tüm bölümleme verilerini temizlemek için GUID Bölümleme Tablosu (GPT) için komut satırına g veya MBR bölümleme tablosu için o yazın. İhtiyacınız olan tablo zaten oluşturulmuşsa bu adımı atlayabilirsiniz.\n\n"
    },
    {
      "title": "Bölüm oluşturma",
      "level": 3,
      "content": "n komutuyla yeni bir bölüm oluşturun. Bir MBR bölüm türü, bölüm numarası, başlangıç sektörü ve bitiş sektörü girmelisiniz.\n\n"
    },
    {
      "title": "Bölüm türü",
      "level": 4,
      "content": "MBR kullanırken, fdisk MBR bölümleme türünü soracaktır. Bunu belirtin, birincil bir bölüm oluşturmak için p veya genişletilmiş bir bölüm oluşturmak için e yazın. Dört adede kadar birincil bölüm olabilir.\n\nfdisk bölüm türünü sormaz ve varsayılan olarak 'Linux dosya sistemi' kullanır. Bölüm türünü daha sonra değiştirebilirsiniz.\n\n"
    },
    {
      "title": "Bölüm numarası",
      "level": 4,
      "content": "Bölüm numarası bir bölüme atanan numaradır, örneğin /dev/sda diski üzerindeki 1 numaralı bir bölüm /dev/sda1, /dev/nvme0n1 için /dev/nvme0n1p1 ve /dev/mmcblk0 için /dev/mmcblk0p1 olacaktır. Adlandırma şeması hakkında ayrıntılar için Device file#Partition'a bakınız. Bölüm numaraları her zaman diskteki bölümlerin sırası ile eşleşmeyebilir, bu durumda bölümler sıralanmış olabilirler.\n\nfdisk tarafından önerilen varsayılan numaranın seçilmesi tavsiye edilir.\n\n"
    },
    {
      "title": "İlk ve son sektör",
      "level": 4,
      "content": "İlk sektör, sektör numaraları kullanılarak mutlak terimlerle belirtilmelidir. Son sektör, sektör numaralarındaki mutlak konum kullanılarak veya kibibayt (K), mebibayt (M), gibibayt (G), tebibayt (T) veya pebibayt (P) cinsinden ölçülen konumlar olarak belirtilebilir;\n\nSon sektörün konumu şu şekilde belirtilebilir:\n\n- diskin başlangıcından itibaren mutlak terimler. Örneğin, ilk sektör olarak 40M diskin başlangıcından itibaren 40 MiB'lık bir konumu belirtir.\n- Boyutun önüne +boyut veya -boyut koyulan terimler. Örneğin, başlangıç sektöründen 2 GiB sonra bir nokta belirtmek için +2G veya mevcut son sektörden 200 MiB önce bir nokta belirtmek için -200M.\n\nHiçbir girdi olmadan Enter tuşuna basıldığında, ilk sektör için mevcut en büyük bloğun başlangıcı ve son sektör için aynı bloğun sonu olan varsayılan değer belirlenir.\n\n- Bölümleme yaparken, bir bölümün ilk sektörü için varsayılan değeri takip etmek her zaman iyi bir fikirdir. Ayrıca, bölüm boyutlarını +boyut{M,G,T,P} gösterimiyle belirttiğinizden ve 1 MiB'den küçük boyutlar kullanmadığınızdan emin olun. Bu tür bölümler her zaman aygıt özelliklerine göre hizalanacaktır.\n- EFI sistem bölümü EFI System bölüm türünü gerektirir.\n- GRUB, BIOS tabanlı bir sistemde GPT bölümlü bir diske GRUB yüklerken BIOS boot bölüm türüne sahip bir BIOS önyükleme bölümünü gerektirir.\n\nİstediğiniz bölümlere sahip olana kadar bu prosedürü tekrarlayın.\n\n"
    },
    {
      "title": "Bölüm türünü değiştirme",
      "level": 3,
      "content": "Her bölüm bir tür ile ilişkilendirilir. MBR bölüm IDlerini kullanır; GPT bölüm türü GUIDlerini kullanır.\n\nBir bölümün türünü değiştirmek için t tuşuna basın. Varsayılan, Linux dosya sistemi, çoğu kullanım için uygun olmalıdır.\n\n- fdisk'in dahili kod listesini göstermek için L tuşuna basın.\n- GPT kullanırken, systemd-gpt-auto-generator bunları otomatik olarak bağlayabildiğinden Bölüm Spesifikasyonu'nu takip etmeniz tavsiye edilir. Yani, kök bölüm için Linux root (x86-64), takas bölümü için Linux swap, ev bölümü için Linux home vb. kullanın.\n\n"
    },
    {
      "title": "MBR bölümünü önyüklenebilir hale getirme",
      "level": 3,
      "content": "Bir MBR bölümünü a yazarak önyüklenebilir bir hale getirebilirsiniz.\n\n"
    },
    {
      "title": "Değişiklikleri diske yazma",
      "level": 3,
      "content": "Tabloyu diske yazın ve w komutu ile çıkın.\n\n"
    },
    {
      "title": "Bölüm taşıma",
      "level": 2,
      "content": "Bir bölümü taşımak için, bölümün taşınacağı yerde boş alan olması gerekir. Gerekirse, bölümlerinizi ve üzerlerindeki dosya sistemlerini küçülterek yer açabilirsiniz. bölüm küçültmeye bakınız. Bir bölümün yerini değiştirmek için:\n\n```\n# echo '+sektör,' | sfdisk --move-data aygıt -N numara\n```\n\nBurada sektör bölümün taşınacağı sektör sayısı (+ bölümün ileriye taşınacağını gösterir), aygıt bölümü tutan aygıt ve numara bölüm numarasıdır. Diskinizin ortasına ya da başına yeni bir bölüm eklerseniz, büyük ihtimalle bölümleri yeniden numaralandırmak isteyebilirsiniz. #Bölüm sıralama'ya veya fdiskin \"ekstra işlevsellik\" moduna bakınız.\n\n"
    },
    {
      "title": "Bölüm sıralama",
      "level": 3,
      "content": "Bu, iki bölüm arasındaki boşlukta yeni bir bölüm oluşturulduğunda veya bir bölüm silindiğinde geçerlidir. Bu örnekte /dev/sda kullanılmıştır.\n\n```\n# sfdisk -r /dev/sda\n```\n\nBölümleri sıraladıktan sonra, kalıcı blok aygıt adlandırmayı kullanmıyorsanız, /etc/fstab ve/veya /etc/crypttab yapılandırma dosyalarını ayarlamanız gerekebilir.\n\n"
    },
    {
      "title": "Ayrıca bakınız",
      "level": 2,
      "content": "- Linux'ta fdisk ile bölümleri yönetme (İngilizce)\n\n"
    }
  ]
}