{
  "title": "Fdisk (Español)",
  "url": "https://wiki.archlinux.org/title/Fdisk_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-12** \n\nArtículos relacionados\n\n- Sistemas de archivos\n- gdisk\n- GNU Parted\n- Particionar\n- dd\n\nutil-linux fdiskes una utilidad de línea de órdenes dirigida por diálogos que crea y manipula las tablas de particiones y las particiones en un disco duro. Los discos duros se dividen en particiones y esta división se describe en la tabla de particiones.\n\nEste artículo cubre fdisk(8) y su utilidad relacionada sfdisk(8).\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "fdisk y sus utilidades asociadas son proporcionadas por el paquete util-linux, que es una dependencia del meta paquete base.\n\n"
    },
    {
      "title": "Listar las particiones",
      "level": 2,
      "content": "Para listar las tablas de particiones y las particiones en un dispositivo (por ejemplo /dev/sda), puede ejecutar lo siguiente:\n\n```\n# fdisk -l /dev/sda\n```\n\n"
    },
    {
      "title": "Copia de seguridad y restauración de la tabla de particiones",
      "level": 2,
      "content": "Antes de realizar cambios en un disco duro, es posible que quiera realizar una copia de seguridad de la tabla de particiones y el esquema de partición de la unidad. También puede utilizar una copia de seguridad para copiar el mismo diseño de partición en múltiples unidades.\n\nTanto para GPT como para MBR puede utilizar sfdisk para guardar el diseño de partición de su dispositivo en un archivo con la opción -d/--dump. Ejecute la siguiente orden para el dispositivo /dev/sda:\n\n```\n# sfdisk -d /dev/sda > sda.dump\n```\n\nEl archivo debería tener este aspecto para una única partición ext4 con un tamaño de 1 GiB:\n\n```\nsda.dump\n```\n\n```\nlabel: gpt\nlabel-id: AAAAAAAA-BBBB-CCCC-DDDD-EEEEEEEEEEEE\ndevice: /dev/sda\nunit: sectors\nfirst-lba: 34\nlast-lba: 1048576\n\n/dev/sda1 : start=2048, size=1048576, type=0FC63DAF-8483-4772-8E79-3D69D8477DE4, uuid=BBF1CD36-9262-463E-A4FB-81E32C12BDE7\n```\n\nPara restaurar posteriormente este diseño puede ejecutar:\n\n```\n# sfdisk /dev/sda < sda.dump\n```\n\n"
    },
    {
      "title": "Crear una tabla de particiones y las particiones",
      "level": 2,
      "content": "El primer paso para particionar un disco es crear una tabla de particiones. Después de eso, las particiones reales se crean de acuerdo con el esquema de partición deseado. Véase el artículo tabla de particiones para ayudarle a decidir si utilizar MBR o GPT.\n\nAntes de comenzar, es posible que desee realizar una copia de seguridad de su actual tabla de particiones y esquema.\n\nLas versiones recientes de fdisk han abandonado el obsoleto sistema de utilizar cilindros como unidad de visualización predeterminada, así como la compatibilidad con MS-DOS de forma predeterminada. fdisk alinea automáticamente todas las particiones a 2048 sectores, o 1 MiB, que debería funcionar para todos los tamaños de EBS que se sabe que son utilizados por los fabricantes de SSD. Esto significa que la configuración predeterminada le dará una alineación adecuada.\n\nInicie fdisk contra su disco como superusuario. En este ejemplo estamos utilizando /dev/sda:\n\n```\n# fdisk /dev/sda\n```\n\nEsto abre el diálogo de fdisk donde puede escribir las órdenes.\n\n"
    },
    {
      "title": "Crear nueva tabla",
      "level": 3,
      "content": "Para crear una nueva tabla de particiones y borrar todos los datos de la partición actual escriba o en el indicador de una tabla de particiones MBR o g para una Tabla de particiones GUID (GPT). Omita este paso si la tabla que necesita ya se ha creado.\n\n"
    },
    {
      "title": "Crear particiones",
      "level": 3,
      "content": "Cree una nueva partición con la orden n. Introduzca un tipo de partición, un número de partición, un sector inicial y un sector final.\n\nCuando se le solicite, especifique el tipo de partición, escriba p para crear una partición primaria o e para crear una extendida. Puede haber hasta cuatro particiones primarias.\n\nEl primer sector debe especificarse en términos absolutos utilizando números de sector. El último sector se puede especificar utilizando la posición absoluta en sectores o mediante el símbolo + para especificar una posición relativa al sector de inicio medido en sectores, kibibytes (K), mebibytes (M), gibibytes (G), tebibytes (T), o pebibytes (P); por ejemplo, si define +2G como el último sector, especificará un punto 2GiB después del sector de inicio. Al presionar la tecla Intro sin entrada, se especifica el valor predeterminado, que es el inicio del bloque más grande disponible para el sector de inicio y el final del mismo bloque para el sector de final.\n\nNote: Véase los artículos respectivos para conocer las consideraciones sobre el tamaño y la ubicación de estas particiones.\n\n- Cuando se particiona, siempre es una buena idea seguir los valores predeterminados para los sectores de inicio y final de la partición. Además, especifique los tamaños de partición con la notación +<tamaño>{M,G,...}. Dichas particiones siempre se alinean de acuerdo con las propiedades del dispositivo.\n- En un disco con una tabla de partición MBR, deje al menos 33 512-byte sectores (16.5 KiB) de espacio libre sin particionar al final del disco para permitir la conversión entre MBR y GPT.\n- La partición del sistema EFI requiere el tipo EFI System.\n- GRUB requiere una partición de arranque BIOS con el tipo BIOS boot al instalar GRUB en un disco particionado con GPT.\n- Se recomienda utilizar Linux swap para cualquier partición como espacio de intercambio, ya que systemd lo montará automáticamente.\n\nVéase los artículos respectivos para conocer las consideraciones sobre el tamaño y la ubicación de estas particiones.\n\nRepita este procedimiento hasta que tenga las particiones que desee.\n\n"
    },
    {
      "title": "Listar los tipos de particiones",
      "level": 3,
      "content": "Pulse l para listar los tipos de partición disponibles.\n\n"
    },
    {
      "title": "Cambiar el tipo de partición",
      "level": 3,
      "content": "Cada partición está asociada con un tipo. Pulse t para cambiar el tipo de partición. El predeterminado, Linux filesystem, debería estar bien para la mayoría de los casos.\n\n"
    },
    {
      "title": "Hacer una partición de arranque",
      "level": 3,
      "content": "Puede hacer que la partición sea de arranque pulsando a.\n\n"
    },
    {
      "title": "Escribir cambios en el disco",
      "level": 3,
      "content": "Escriba la tabla en el disco y salga mediante la orden w.\n\n"
    },
    {
      "title": "Mover particiones",
      "level": 2,
      "content": "Para mover una partición, debe tener espacio libre disponible donde se moverá la partición. Si es necesario, puede hacer espacio reduciendo sus particiones y los sistemas de archivos en ellas. Véase Reducir particiones. Para reubicar una partición:\n\n```\n# echo '+sectores,' | sfdisk --move-data dispositivo -N número\n```\n\nDonde sectores es el número de sectores para mover la partición (+ indica moverla hacia adelante), {{ic|dispositivo} } es el dispositivo que contiene la partición, y número es el número de partición. Tenga en cuenta que si añade una nueva partición en el medio o al comienzo de su disco, es probable que desee volver a numerar las particiones. Véase #Ordenar particiones o el modo \"funcionalidad adicional\" de fdisk.\n\n"
    },
    {
      "title": "Ordenar particiones",
      "level": 3,
      "content": "Esto se aplica cuando se crea una nueva partición en el espacio entre dos particiones o se elimina una partición. Se utiliza /dev/sda en este ejemplo.\n\n```\n# sfdisk -r /dev/sda\n```\n\nDespués de ordenar las particiones si no está utilizando la nomenclatura de dispositivo de bloque persistente, es posible que deba ajustar los archivos de configuración /etc/fstab y/o /etc/crypttab.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Particionando manual su disco duro con fdisk\n\n"
    }
  ]
}