{
  "title": "Fdisk (Русский)",
  "url": "https://wiki.archlinux.org/title/Fdisk_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Файловые системы\n- GPT fdisk (Русский)\n- Parted (Русский)\n- Разметка диска\n\nfdisk из пакета util-linux - интерактивная консольная утилита, которая может создать таблицу разделов и разделы на жестком диске и управлять ими. В таблице разделов описано разбиение жесткого диска на разделы.\n\nЭта статья объясняет fdisk(8) и связанную с ней утилиту sfdisk(8).\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "fdisk и связанные с ним утилиты входят в состав пакета util-linux, который является частью мета-пакета base.\n\n"
    },
    {
      "title": "Список разделов",
      "level": 2,
      "content": "Чтобы просмотреть таблицы разделов и разделы на блочном устройстве, вы можете запустить fdisk, указав устройство (например: /dev/sda), /dev/nvme0n1, /dev/mmcblk0, и т.д.):\n\n```\n# fdisk -l /dev/sda\n```\n\n"
    },
    {
      "title": "Резервное копирование и восстановление таблицы разделов",
      "level": 2,
      "content": "Вы можете захотеть сделать резервное копирование таблицы разделов и схемы разделов диска перед их изменениями. Вы также можете использовать резервное копирование для копирования одинаковых разметок разделов на другие диски.\n\nВы можете использовать sfdisk для таблиц разделов GPT и MBR, чтобы сохранить разметку разделов вашего устройства в файл с параметром -d/--dump. Выполните следующую команду для устройства /dev/sda:\n\n```\n# sfdisk -d /dev/sda > sda.dump\n```\n\nФайл должен выглядеть примерно так для одного раздела ext4 размером 1 ГиБ:\n\n```\nsda.dump\n```\n\n```\nlabel: gpt\nlabel-id: AAAAAAAA-BBBB-CCCC-DDDD-EEEEEEEEEEEE\ndevice: /dev/sda\nunit: sectors\nfirst-lba: 34\nlast-lba: 1048576\n\n/dev/sda1 : start=2048, size=1048576, type=0FC63DAF-8483-4772-8E79-3D69D8477DE4, uuid=BBF1CD36-9262-463E-A4FB-81E32C12BDE7\n```\n\nЧтобы позже восстановить эту разметку, вы можете выполнить:\n\n```\n# sfdisk /dev/sda < sda.dump\n```\n\n"
    },
    {
      "title": "Создание таблицы разделов и самих разделов",
      "level": 2,
      "content": "Первый шаг в разметке диска — создание таблицы разделов. После этого создаются собственно разделы в соответствии с желаемой схемой разметки. Смотрите статью Разметка диска, чтобы решить, что выбрать для использования: MBR или GPT.\n\nПеред началом вы можете сделать резервную копию вашей текущей таблицы разделов и схемы.\n\nВ недавних версиях fdisk отказались от устаревшей системы использования цилиндров в качестве стандартной единицы измерения, как и от совместимости с MS-DOS по умолчанию. fdisk автоматически выполняет выравнивание по 2048 512-байтовым секторам (1 МиБ), что должно быть совместимо со всеми расширенными форматами HDD и подавляющим большинством SSD. Это означает, что с настройками по умолчанию вы получите правильное выравнивание.\n\nЧтобы использовать fdisk, запустите программу с именем блочного устройства, которое вы хотите изменить. В этом примере используется /dev/sda:\n\n```\n# fdisk /dev/sda\n```\n\nЭто откроет интерактивный режим fdisk, где вы можете вводить команды.\n\n"
    },
    {
      "title": "Создание новой таблицы",
      "level": 3,
      "content": "Чтобы создать новую таблицу разделов и удалить всю текущую информацию о разделах, введите o для таблицы разделов MBR или g для таблицы разделов GUID (GPT). Пропустите эти шаги, если необходимая таблица уже была создана.\n\n"
    },
    {
      "title": "Создание разделов",
      "level": 3,
      "content": "Создайте новый раздел с помощью команды n. Вам нужно будет ввести тип раздела, номер раздела, начальный сектор и конечный сектор.\n\n"
    },
    {
      "title": "Тип раздела",
      "level": 4,
      "content": "При исплоьзовании MBR fdisk спросит тип раздела. Введите p для создания первичного раздела или e для создания расширенного. Может быть до четырёх основных разделов.\n\nfidsk не спрашивает ID типа раздела и по умолчанию использует 'Linux filesystem'; вы сможете изменить его позже.\n\n"
    },
    {
      "title": "Номер раздела",
      "level": 4,
      "content": "Номер раздела — это номер, присвоенный разделу, например, раздел с номером 1 на диске /dev/sda будет /dev/sda1. Номера разделов могут не совпадать с реальным порядком разделов на диске, в этом случае их можно отсортировать.\n\nРекомендуется использовать номер по умолчанию, который предложит fdisk.\n\n"
    },
    {
      "title": "Первый и последний сектор",
      "level": 4,
      "content": "Первый сектор должен быть указан в абсолютном выражении с использованием номеров секторов. Последний сектор может быть задан с использованием абсолютного положения в секторах или в виде позиций, измеряемых в кибибайтах (K), мебибайтах (M), гибибайтах (G), тебибайтах (T) или пебибайтах (P).\n\nПозиция последнего сектора может быть задана в:\n\n- в абсолютном выражении от начала диска. Например, 40M в качестве первого сектора указывает позицию 40 МиБ от начала диска.\n- в относительном выражении, предваряя размер символами +размер или -размер. Например, +2G указывает на позицию через 2 ГиБ после начального сектора, а -200M указывает на позицию 200 МиБ перед последним доступным сектором.\n\nНажатие Enter без ввода значения использует значение по умолчанию, которое является началом самого большого доступного блока для первого сектора и концом того же блока для последнего сектора.\n\n- При разметке всегда рекомендуется использовать значения по умолчанию для первого и последнего секторов раздела. Кроме того, стоит указывать относительные размеры разделов с помощью нотации +размер{M,G,T,P} и не использовать разделы меньше 1 МиБ. Такие разделы всегда будут выровнены в соответствии со свойствами устройства.\n- На диске MBR оставьте неразмеченными как минимум 33 512-байтовых сектора (16,5 КиБ) в конце диска на случай, если вам понадобится преобразовать MBR в GPT.\n- Системный раздел EFI требует тип EFI System.\n- GRUB требует раздел загрузки BIOS с типом BIOS boot при установке GRUB на диск с разметкой GPT.\n- Рекомендуется использовать Linux swap для любого раздела подкачки, так как systemd будет автоматически монтировать его.\n\nПовторяйте эту процедуру, пока не получите желаемые разделы.\n\n"
    },
    {
      "title": "Изменение типа раздела",
      "level": 3,
      "content": "У каждого раздела есть определённый тип. MBR использует partition ID; GPT использует GUID типов разделов.\n\nНажмите t, чтобы изменить идентификатор типа раздела. Используемое по умолчанию значение Linux filesystem должно быть подходящим для большинства случаев.\n\n- Введите L для просмотра списка внутренних кодов fdisk.\n- При использовании GPT рекомендуется следовать Discoverable Partitions Specification, поскольку systemd-gpt-auto-generator(8) будет монтировать их автоматически.\n\n"
    },
    {
      "title": "Загрузочный раздел",
      "level": 3,
      "content": "Вы можете отметить раздел как загрузочный, введя a.\n\n"
    },
    {
      "title": "Запись изменений на диск",
      "level": 3,
      "content": "Для записи новой таблицы на диск и выхода используйте команду w.\n\n"
    },
    {
      "title": "Перемещение разделов",
      "level": 2,
      "content": "Чтобы переместить раздел, необходимо иметь свободное пространство в том месте, куда будет перемещён раздел. При необходимости можно освободить место, уменьшив разделы и файловые системы на них. Смотрите Parted (Русский)#Сжатие разделов. Чтобы переместить раздел:\n\n```\n# echo '+секторы,' | sfdisk --move-data устройство -N номер\n```\n\nГде секторы — количество секторов для перемещения раздела (+ означает перемещение вперёд), устройство — устройство, на котором находится раздел, а номер — номер раздела. Обратите внимание, что если вы добавляете новый раздел в середине или в начале диска, вам, скорее всего, потребуется изменить нумерацию разделов. Смотрите #Сортировка разделов или режим \"extra functionality\" в fdisk.\n\n"
    },
    {
      "title": "Сортировка разделов",
      "level": 3,
      "content": "В ситуации, когда, например, новый раздел создаётся между двумя существующими или раздел удаляется, нумерация разделов может перестать соответствовать их реальному расположению на диске, и для исправления можно выполнить сортировку. В этом примере используется /dev/sda.\n\n```\n# sfdisk -r /dev/sda\n```\n\nЕсли вы не используете постоянные имена для блочных устройств, то вам может понадобиться обновить файлы конфигурации, в которых используется нумерация разделов, в частности /etc/fstab и/или /etc/crypttab.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Managing partitions in Linux with fdisk\n\n"
    }
  ]
}