{
  "title": "Feh (Español)",
  "url": "https://wiki.archlinux.org/title/Feh_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-11-23** \n\nArtículos relacionados\n\n- Nitrogen (Español)\n- sxiv\n\nfeh es un potente y ligero visor de imágenes que también puede ser utilizado para gestionar el fondo de pantalla para aquellos gestores de ventanas que carecen de tal opción.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete feh.\n\n"
    },
    {
      "title": "Modo de uso",
      "level": 2,
      "content": "feh es altamente configurable. Para obtener una lista completa de opciones, ejecute feh --help o véase la pagina de man feh(1).\n\n"
    },
    {
      "title": "Navegador de imágenes",
      "level": 3,
      "content": "Para visualizar rápidamente las imágenes contenidas en un directorio específico, puede ejecutar feh con los siguientes argumentos:\n\n```\n$ feh -g 640x480 -d -S filename /ruta/al/archivo-de-imagen\n```\n\n- La opción -g fuerza a que las imágenes aparezcan con un tamaño no mayor a 640x480\n- La opción -d obtiene el nombre del archivo\n- La opción -S filename ordena las imágenes por nombre de archivo\n\nEsto es tan sólo un ejemplo y hay muchas más opciones disponibles, si más flexibilidad es deseada.\n\n"
    },
    {
      "title": "Establecer fondo de pantalla",
      "level": 3,
      "content": "feh se puede utilizar para establecer el fondo de pantalla, por ejemplo, para los gestores de ventanas que carecen de esta característica como Openbox, Fluxbox, y xmonad.\n\nEl siguiente comando es un ejemplo de como establecer el fondo de pantalla inicial:\n\n```\n$ feh --bg-scale /ruta/al/archivo-de-imagen\n```\n\nOtras opciones de ajuste incluyen:\n\n```\n--bg-tile IMAGEN\n--bg-center IMAGEN\n--bg-max IMAGEN\n--bg-fill IMAGEN\n```\n\nPara restaurar el fondo de pantalla en la siguiente sesión, añada lo siguiente a su archivo de arranque gráfico (p.ej. ~/.xinitrc, ~/.config/openbox/autostart, etc.):\n\n```\n~/.fehbg &\n```\n\nPara cambiar el el fondo de pantalla, edite el archivo ~/.fehbg, que ha sido creado al ejecutar el comando feh --bg-scale /ruta/al/archivo-de-imagen mencionado anteriormente.\n\nEs posible deshabilitar explícitamente la creación del archivo ~/.fehbg, al pasar la opción --no-fehbg.\n\nPara establecer diferentes imágenes para diferentes monitores, se deben pasar tantos archivos de imágenes como monitores disponibles. Así, el comando para dos monitores sería:\n\n```\n$ feh --bg-center /ruta/para/imagen-primer-monitor /ruta/para/imagen-segundo-monitor\n```\n\n"
    },
    {
      "title": "Abrir imágenes SVG",
      "level": 3,
      "content": "```\n$ feh --conversion-timeout 1 archivo.svg\n```\n\nNótese que esto requiere el paquete imagemagick.\n\n"
    },
    {
      "title": "Fondo de pantalla aleatorio",
      "level": 3,
      "content": "Puede hacer que feh seleccione un fondo de pantalla aleatoriamente pasando la opción --randomize, junto con una de las opciones --bg-foo. Por ejemplo:\n\n```\n$ feh --bg-fill --randomize ~/.fondosDePantalla/*\n```\n\nEl comando anterior le ordena a feh que liste los archivos en el directorio ~/.fondosDePantalla/ de manera aleatoria y establezca los fondos de pantalla para todos los escritorios a cualquier imagen que este al frente de la lista aleatoria (una imagen única para cada escritorio). Puede hacer esto recursivamente, si tiene sus fondos divididos en subcarpetas:\n\n```\n$ feh --recursive --bg-fill --randomize ~/.fondosDePantalla\n```\n\nPara mostrar un fondo de pantalla diferente desde ~/.fondosDePantalla cada sesión, agregue lo siguiente a su archivo .xinitrc:\n\n```\n$ feh --bg-max --randomize ~/.fondosDePantalla/* &\n```\n\nOtra forma de establecer un fondo de pantalla aleatorio en cada sesión xorg es editando su ~/.fehbg a lo siguiente:\n\n```\n$HOME/.fehbg\n```\n\n```\nfeh --bg-max --no-fehbg --randomize ~/.fondosDePantalla/*\n```\n\n"
    }
  ]
}