{
  "title": "Feh (Français)",
  "url": "https://wiki.archlinux.org/title/Feh_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Nitrogen (Français)\n- sxiv\n\nPour citer et traduire Wikipedia: \"feh est une visionneuse d'images légère destinée principalement aux utilisateurs d'interfaces en ligne de commande. Contrairement à la plupart des visionneuses d'images graphiques, feh n'a pas d'éléments de contrôle graphique (à l'exception d'un affichage optionnel du nom du fichier), ce qui lui permet d'être utilisé pour afficher des images d'arrière-plan sur des systèmes utilisant le système de fenêtres X.\"\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet feh.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "feh est hautement configurable. Pour une liste complète des options, exécutez feh --help ou consultez la page de manuel de feh(1).\n\n"
    },
    {
      "title": "Parcourir les images",
      "level": 3,
      "content": "Pour parcourir rapidement les images dans un répertoire spécifique, vous pouvez lancer feh avec les arguments suivants :\n\n```\n$ feh -g 640x480 -d -S filename /path/to/directory\n```\n\n- L'option -g force les images à ne pas apparaître plus grandes que 640x480.\n- L'option -d affiche le nom du fichier.\n- L'option -S filename trie les images par nom de fichier.\n\nCeci n'est qu'un exemple ; il existe de nombreuses autres options disponibles si vous souhaitez plus de flexibilité.\n\n"
    },
    {
      "title": "Définir le fond d'écran",
      "level": 3,
      "content": "feh peut être utilisé pour définir le papier peint du bureau, par exemple pour les gestionnaires de fenêtres ne disposant pas de cette fonctionnalité comme Openbox, Fluxbox et xmonad.\n\nLa commande suivante est un exemple de la façon de définir le fond d'écran initial :\n\n```\n$ feh --bg-scale /chemin/vers/image.extension\n```\n\nD'autres options de mise à l'échelle sont disponibles :\n\n```\n--bg-tile FICHIER\n--bg-center FICHIER\n--bg-max FICHIER\n--bg-fill FICHIER\n```\n\nPour restaurer l'arrière-plan lors de la prochaine session, ajoutez ce qui suit à votre fichier de démarrage (par exemple, ~/.xinitrc, ~/.config/openbox/autostart, etc :)\n\n```\n~/.fehbg &\n```\n\nPour modifier l'image de fond, éditez le fichier ~/.fehbg qui est créé après l'exécution de la commande feh --bg-scale /chemin/vers/image.extension mentionnée ci-dessus.\n\nOn peut explicitement désactiver la création de ~/.fehbg, en passant l'option --no-fehbg.\n\nPour configurer différents fonds d'écran pour différents moniteurs, il faut passer autant de chemins de fichiers que de moniteurs disponibles. Par exemple, pour une configuration à deux moniteurs, ce serait :\n\n```\n$ feh --bg-center chemin/vers/fichier/pour/premier/moniteur chemin/vers/fichier/pour/second/moniteur\n```\n\n"
    },
    {
      "title": "Ouvrir des images SVG",
      "level": 3,
      "content": "```\n$ feh --conversion-timeout 1 fichier.svg\n```\n\nNotez que cela nécessite le paquet imagemagick.\n\n"
    },
    {
      "title": "Image de fond aléatoire",
      "level": 3,
      "content": "Vous pouvez demander à feh de définir un fond d'écran aléatoire en utilisant l'option --randomize avec l'une des options --bg-foo, par exemple :\n\n```\n$ feh --bg-fill --randomize ~/.wallpaper/*\n```\n\nLa commande ci-dessus demande à feh de randomiser la liste des fichiers du répertoire ~/.wallpaper/ et de définir les arrière-plans de tous les bureaux disponibles avec les images qui se trouvent en tête de la liste aléatoire (une image unique pour chaque bureau). Vous pouvez également effectuer cette opération de manière récursive, si vos fonds d'écran sont répartis dans des sous-dossiers :\n\n```\n$ feh --recursive --bg-fill --randomize ~/.wallpaper\n```\n\nPour définir un fond d'écran aléatoire différent à partir de ~/.wallpaper à chaque session, ajoutez ce qui suit à votre .xinitrc :\n\n```\n$ feh --bg-max --randomize ~/.wallpaper/* &\n```\n\nUne autre façon de définir un fond d'écran aléatoire à chaque session xorg est de modifier votre .fehbg comme suit.\n\n```\n$HOME/.fehbg\n```\n\n```\nfeh --bg-max --no-fehbg --randomize ~/.wallpaper/*\n```\n\n"
    },
    {
      "title": "Utilisation dans une tâche Cron",
      "level": 3,
      "content": "Pour utiliser feh dans une tâche cron pour obtenir des fonds d'écran aléatoires, vous devez spécifier la variable d'environnement DISPLAY :\n\n```\nDISPLAY=:0 feh --bg-max --randomize ~/.wallpaper/*\n```\n\nNotez que certains gestionnaires d'affichage comme sddm peuvent ne pas enregistrer le fichier XAUTHORITY dans ~/.Xauthority à l'endroit où feh s'attend à ce qu'il soit, ce qui fait que cronjob affichera un message d'erreur : \"Autorisation requise, mais aucun protocole d'autorisation spécifié\".\n\n"
    }
  ]
}