{
  "title": "Feh (Polski)",
  "url": "https://wiki.archlinux.org/title/Feh_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Nitrogen\n- sxiv\n\nfeh jest lekkim oraz potężnym narzędziem do wyświetlania obrazów, który może także służyć do zarządzania tapetami pulpitu dla menedżerów okien, które nie posiadają takiej funkcji.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiet feh.\n\n"
    },
    {
      "title": "Sposób Użycia",
      "level": 2,
      "content": "Feh jest mocno dostosowywalny. W celu uzyskania pełnej listy opcji wykonaj polecenie feh --help lub spójrz na stronę dokumentacji feh(1).\n\n"
    },
    {
      "title": "Przeglądanie obrazów",
      "level": 3,
      "content": "Aby szybko przejrzeć obrazy w danym katalogu, możesz uruchomić feh z następującymi argumentami:\n\n```\n$ feh -g 640x480 -d -S filename /ścieżka/do/katalogu\n```\n\n- Flaga -g zmusza obrazy do ukazywania się w rozdzielczości nie większej niż 640x480\n- Flaga -d wypisuje nazwę pliku\n- Flaga -S filename sortuje pliki ze względu na nazwę pliku\n\nTo jest tylko jeden przykład; dostępnych jest wiele więcej opcji, które pozwalają na większe dostosowanie do twoich potrzeb.\n\nJeżeli przeglądasz zdjęcia z aparatu, które posiadają dane EXIF, przydatną opcją jest --auto-rotate, która automatycznie obróci zdjęcie po wykryciu orientacji. Ta opcja nie ma ingerencji w sam plik.\n\n"
    },
    {
      "title": "Ustawianie tapety",
      "level": 3,
      "content": "feh może być wykorzystywane w celu ustawienia tapety pulpitu, przy używaniu menedżerów okien bez opcji zmiany tła pulpitu. (Przykładami takich menedżerów są: Openbox, Fluxbox i xmonad).\n\nPoniższa komenda jest przykładem ustawienia tła pulpitu:\n\n```\n$ feh --bg-scale /ścieżka/do/pliku\n```\n\nInnymi opcjami skalowania obrazu są:\n\n```\n--bg-tile PLIK\n--bg-center PLIK\n--bg-max PLIK\n--bg-fill PLIK\n```\n\nAby przywrócić tło w kolejnej sesji, dodaj poniższą linijkę do twojego pliku rozruchowego (np. ~/.xinitrc, ~/.config/openbox/autostart, itd.):\n\n```\n~/.fehbg *\n```\n\nAby zmienić tło, zedytuj plik ~/.fehbg, który zostaje utworzony po wykonaniu komendy feh --bg-scale /ścieżka/do/pliku ukazanej powyżej.\n\nOpcja --no-fehbg sprawia, że plik ~/.fehbg nie zostanie utworzony po wykonaniu komendy.\n\n"
    },
    {
      "title": "Tapety na wielu monitorach",
      "level": 4,
      "content": "W celu ustawienia różnych tapet na wielu monitorach, przy wykonywaniu komendy feh określ tyle plików, ile jest monitorów. Na przykład, dla dwóch monitorów to będzie:\n\n```\n$ feh --bg-center ścieżka/do/tapety/pierwszego/monitora ścieżka/do/tapety/drugiego/monitora\n```\n\n"
    },
    {
      "title": "Otwieranie obrazów SVG",
      "level": 3,
      "content": "```\n$ feh --conversion-timeout 1 plik.svg\n```\n\nZwróć uwagę, że taka akcja wymaga pakietu imagemagick.\n\n"
    },
    {
      "title": "Losowa tapeta",
      "level": 3,
      "content": "Możesz sprawić, aby feh ustawiał losową tapetę używając opcji --randomize razem z jedną z opcji typu --bg-foo, na przykład:\n\n```\n$ feh --bg-fill --randomize ~/.wallpaper/*\n```\n\nPowyższa komenda mówi feh, aby wylosował piliki z plików dostępnych w katalogu ~/.wallpaper/ i ustawił je jako tapety dla wszystkich dostępnych monitorów (po jednym losowym pliku na monitor). Możesz także wykonać to rekursywnie, jeżeli masz tapety podzielone na pod-foldery:\n\n```\n$ feh --recursive --bg-fill --randomize ~/.wallpaper\n```\n\nAby losować tapety w każdej nowej sesji, dodaj poniższą linię do twojego pliku .xinitrc:\n\n```\n$ feh --bg-max --randomize ~/.wallpaper/* &\n```\n\nKolejnym sposobem na ustawienie losowej tapety dla każdej sesji Xorg jest edycja pliku .fehbg jak poniżej.\n\n```\n$HOME/.fehbg\n```\n\n```\n}}\nfeh --bg-max --no-fehbg --randomize ~/.wallpaper/*\n```\n\n"
    },
    {
      "title": "Wykorzystywanie procesów Cron",
      "level": 3,
      "content": "Aby używać Feh w procesie Cron, w celu losowania tapet, musisz określić zmienną środowiskową DISPLAY:\n\n```\n$ DISPLAY=:0 feh --bg-max --randomize ~/.wallpaper/*\n```\n\n"
    }
  ]
}