{
  "title": "Feh (Русский)",
  "url": "https://wiki.archlinux.org/title/Feh_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Nitrogen (Русский)\n- sxiv\n\nfeh — это лёгкий и мощный просмотрщик изображений, который также может управлять фоном рабочего стола для оконных менеджеров, не умеющих делать это самостоятельно.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет feh.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Feh имеет множество настроек. Для получения полного списка опций выполните feh --help или смотрите feh(1).\n\n"
    },
    {
      "title": "Как просмотрщик изображений",
      "level": 3,
      "content": "Чтобы быстро просматривать изображения в определенном каталоге, вы можете запустить feh со следующими параметрами:\n\n```\n$ feh -g 640x480 -d -S filename /path/to/directory\n```\n\n- Ключ -g используется для просмотра изображений в разрешении 640x480\n- Ключ -d отображает имя файла\n- Ключ -S filename сортирует изображения по их названию\n\nЭто всего лишь один пример; есть много других вариантов для большей гибкости.\n\nЕсли вы просматриваете фотографии с современной камеры с данными EXIF, можно использовать параметр --auto-rotate для автоматического поворота изображений. Это не изменяет файл.\n\n"
    },
    {
      "title": "Как менеджер фона рабочего стола",
      "level": 3,
      "content": "feh может управлять обоями рабочего стола при использовании оконных менеджеров, не имеющих такой функции, таких как Openbox, Fluxbox и xmonad.\n\nЭта команда является примером для установки фона рабочего стола:\n\n```\n$ feh --bg-scale /path/to/image.file\n```\n\nДругие варианты опций:\n\n```\n--bg-tile ФАЙЛ\n--bg-center ФАЙЛ\n--bg-max ФАЙЛ\n--bg-fill ФАЙЛ\n```\n\nДля восстановления фона при следующем входе добавьте команду в автозагрузку (например ~/.xinitrc, ~/.config/openbox/autostart.sh, и т.д.):\n\n```\nsh ~/.fehbg &\n```\n\nЧтобы изменить фоновое изображение, измените ~/.fehbg, который будет создан после выполнения команды feh --bg-scale /path/to/image.file упомянутой выше.\n\nМожно отключить создание файла ~/.fehbg с помощью опции --no-fehbg.\n\nДля установки разных фонов на разных мониторах укажите столько же файлов, сколько у вас мониторов. Например для двух:\n\n```\n$ feh --bg-center путь/к/файлу/для/первого/монитора путь/к/файлу/для/второго/монитора\n```\n\n"
    },
    {
      "title": "Просмотр SVG изображений",
      "level": 3,
      "content": "```\n$ feh --conversion-timeout 1 file.svg\n```\n\nОбратите внимание, что для этого нужке imagemagick.\n\n"
    },
    {
      "title": "Случайный фон рабочего стола",
      "level": 3,
      "content": "Вы можете заставить feh ставить случайные обои используя опцию --randomize с одной из --bg-foo опцией, пример:\n\n```\n$ feh --randomize --bg-fill ~/.wallpaper/*\n```\n\nКоманда выше говорит feh'у перемешать список файлов в каталоге ~/.wallpaper/ и установить фоны для всех доступных рабочих столов. В этом случае берется первое изображение из перемешанного списка (одно уникальное изображение на каждый рабочий стол). Вы также можете сделать это рекурсивно, если ваш каталог с обоями содержит подкаталоги:\n\n```\n$ feh --recursive --randomize --bg-fill ~/.wallpaper\n```\n\nЧтобы получать для каждой сессии разные случайные обои из ~/.wallpaper, добавьте следующее в ваш .xinitrc:\n\n```\n$ feh --bg-max --randomize ~/.wallpaper/* &\n```\n\nДругой способ устанавливать случайные обои для каждой x.org сессии - отредактируйте ваш .fehbg, как показано ниже:\n\n```\n$HOME/.fehbg\n```\n\n```\nfeh --bg-max --randomize --no-fehbg ~/.wallpaper/*\n```\n\n"
    },
    {
      "title": "Использование в cron",
      "level": 3,
      "content": "Если вы решили использовать cron для периодической смены обоев на случайные, необходимо указывать переменную окружения DISPLAY:\n\n```\n$ DISPLAY=:0 feh --bg-max --randomize ~/.wallpaper/*\n```\n\n"
    }
  ]
}