{
  "title": "Filesystem Hierarchy Standard (Русский)",
  "url": "https://wiki.archlinux.org/title/Filesystem_Hierarchy_Standard_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Глоссарий\n- Arch User Repository (Русский)#Часто задаваемые вопросы\n- Устранение часто встречающихся неполадок\n\n"
    },
    {
      "title": "Что такое Arch Linux?",
      "level": 3,
      "content": "Смотрите статью Arch Linux.\n\n"
    },
    {
      "title": "Почему не стоит использовать Arch?",
      "level": 3,
      "content": "Вам может не подойти Arch Linux, если:\n\n- у вас нет возможности/времени/желания использовать дистрибутив \"сделай сам\".\n- вам нужна поддержка архитектуры, несовместимой с x86_64.\n- вы занимаете решительную позицию использовать только те дистрибутивы, в состав которых входит исключительно свободное (в определении GNU) ПО.\n- вы считаете, что операционная система должна настраивать себя самостоятельно, работать \"из коробки\" и изначально включать в себя рабочее окружение и типичный набор ПО.\n- вам не нужен дистрибутив с плавающей системой релизов и поддержка наиболее свежих версий программ.\n- вы довольны вашей текущей операционной системой.\n\n"
    },
    {
      "title": "Почему стоит использовать Arch?",
      "level": 3,
      "content": "Потому что Арч — лучший.\n\n"
    },
    {
      "title": "Какие архитектуры поддерживает Arch?",
      "level": 3,
      "content": "Arch поддерживает только архитектуру x86_64 (также известную как amd64). Поддержка i686 прекращена в ноябре 2017 [1].\n\nЕсть неофициальные порты для i686 [2] и ARM [3], каждый со своим собственным сообществом. [4][устаревшая ссылка 2024-01-13 ⓘ]\n\n"
    },
    {
      "title": "Следует ли Arch стандарту иерархии файловой системы (FHS)?",
      "level": 3,
      "content": "Arch Linux следует иерархии файловой системы ОС, использующей менеджер служб systemd. См. file-hierarchy(7) для получения информации о назначении каждой директории. В частности, /bin, /sbin и /usr/sbin — символические ссылки на /usr/bin, а /lib и /lib64 — символические ссылки на /usr/lib.\n\n"
    },
    {
      "title": "Я полный новичок в GNU/Linux. Стоит ли мне использовать Arch?",
      "level": 3,
      "content": "Если вы новичок и желаете использовать Arch, имейте в виду, что вам придется набраться терпения и потратить значительное время на постройку и освоение новой системы, а также принять тот факт, что в основе Arch лежит принцип \"сделай сам\" (\"Do It Yourself\"). Именно пользователь собирает систему из компонентов и определяет то, какой она должна быть.\n\nПеред тем, как попросить помощи, попробуйте самостоятельно разобраться в проблеме. Скорее всего ответ на любой вопрос вы сможете найти, поискав на официальном форуме, а также воспользовавшись превосходной документацией, размещенной здесь, в Arch Wiki. Помните, что есть причины, по которым эта информация сделана доступной для вас в первую очередь. Много тысяч часов добровольного труда не просто так было потрачено на создание и развитие этих ресурсов.\n\nРекомендуем вам начать с руководства по установке. Смотрите также Arch terminology#RTFM.\n\n"
    },
    {
      "title": "Создан ли Arch для использования на сервере? На настольном ПК? На рабочей станции?",
      "level": 3,
      "content": "Arch не спроектирован для удовлетворения конкретной потребности. Вместо этого, он создан для определенного типа пользователей.\n\nArch нацелен на опытных пользователей, которым нравится его подход \"сделай сам\", и которые могут настроить систему для удовлетворения своих собственных нужд. Таким образом, в руках такого пользователя Arch может быть использован практически для любых задач. Многие успешно используют Arch одновременно и для настольных ПК, и для рабочих станций. И, конечно, archlinux.org, aur.archlinux.org и почти вся инфраструктура Arch работает на Arch.\n\n"
    },
    {
      "title": "Мне действительно нравится Arch, но разработчикам следует реализовать в нем функцию X!",
      "level": 3,
      "content": "Присоединяйтесь, внесите свой вклад в виде программного кода или решений. Если он будет хорошо принят сообществом и командой разработчиков, возможно он войдет в состав дистрибутива. Сообщество Arch развивается прежде всего за счет внесения участниками своего вклада в проект, а также обмена своими наработками и инструментами.\n\n"
    },
    {
      "title": "Когда будет выпущен новый релиз?",
      "level": 3,
      "content": "Релизы Arch Linux представляют собой просто установочные образы для установки и восстановления системы, которые включают в себя мета-пакет base и несколько других пакетов. Обычно новые релизы появляются в первой половине каждого месяца.\n\n"
    },
    {
      "title": "Является ли Arch Linux стабильным дистрибутивом? Или мне ждать регулярных проблем?",
      "level": 3,
      "content": "Именно пользователь отвечает за стабильность своей собственной системы. Пользователь сам решает, когда выполнять обновление, и сам вносит необходимые изменения. Если пользователь обращается к сообществу за помощью, чаще всего ее предоставляют достаточно быстро. Отличие Arch от большинства других дистрибутивов в том, что Arch наиболее строго следует принципу \"сделай сам\". Жалобы на поломки в программах, скорее всего, мало помогут: ошибки в исходном коде программ не входят в зону ответственности разработчиков Arch.\n\nЕсли вы хотите сделать свою систему настолько стабильной, насколько это возможно, прочтите статью Повышение стабильности системы.\n\n"
    },
    {
      "title": "Arch нужно больше освещения в прессе (рекламы)",
      "level": 3,
      "content": "Arch и так получает достаточно внимания от прессы. Цель Arch Linux не в разрастании проекта, а в предоставлении элегантного, минималистичного дистрибутива с плавающей системой релизов, сконцентрированного на простоте и корректности кода. Органичный и устойчивый рост базы пользователей происходит естественным образом.\n\n"
    },
    {
      "title": "Arch нуждается в большем количестве разработчиков",
      "level": 3,
      "content": "Возможно. Не стесняйтесь пожертвовать свое собственное время! Посещайте форумы, IRC-каналы и списки рассылки Arch Linux, чтобы найти интересную задачу, которая требует решения. Смотрите также статью Принять участие.\n\n"
    },
    {
      "title": "Arch нуждается в инсталляторе. Может быть, в графическом?",
      "level": 3,
      "content": "Раньше Arch имел текстовый инсталлятор, именуемый Arch Installation Framework (AIF). После ухода последнего сопровождающего он был объявлен устаревшим, и вместо него теперь используется arch-install-scripts.\n\nС 1 апреля 2021 года Arch снова имеет инсталлятор archinstall.\n\n"
    },
    {
      "title": "Я установил Arch, и теперь я в командной оболочке. Что теперь?",
      "level": 3,
      "content": "Советы по дальнейшей настройке системы вы найдете в статье Основные рекомендации.\n\n"
    },
    {
      "title": "Какую среду рабочего стола и оконный менеджер мне использовать?",
      "level": 3,
      "content": "Так как доступных решений множество, выбирайте то, что вам больше нравится и лучше подходит под ваши потребности. В этом вам помогут статьи Окружение рабочего стола и Оконный менеджер.\n\n"
    },
    {
      "title": "Что выделяет Arch среди других минималистичных дистрибутивов?",
      "level": 3,
      "content": "Смотрите Arch в сравнении с другими дистрибутивами.\n\n"
    },
    {
      "title": "Обслуживание системы",
      "level": 2,
      "content": "Смотрите также Обслуживание системы.\n\n"
    },
    {
      "title": "Почему у меня такой медленный интернет по сравнению с другими системами?",
      "level": 3,
      "content": "Правильно ли у вас настроена сеть? Посмотрите статью Настройка сети.\n\nОбратите также внимание, что Arch Linux по умолчанию не производит шейпинг трафика. Таким образом, если какая-нибудь программа использует весь предоставленный канал связи, независимо от того, используется ли пиринговое соединение или обычное соединение клиент-сервер, остальные программы могут быть значительно ограничены в использовании канала, что приведет к появлению заметных задержек в работе. Шейпинг можно обеспечить с помощью межсетевого экрана, например, Shorewall или Vuurmuur; также существуют статические скрипты для iproute2 (например, эта производная от Wondershaper), которые обеспечивают шейпинг на сетевом уровне.\n\n"
    },
    {
      "title": "Почему Arch использует всю мою оперативную память?",
      "level": 3,
      "content": "Вообще говоря, неиспользуемая память — бесполезная память. Хорошо, если она используется.\n\nМногие начинающие пользователи обращают внимание на то, что ядро Linux непривычно для них обращается с оперативной памятью. Так как доступ к данным в оперативной памяти осуществляется намного быстрее, чем к данным на дисковом накопителе, ядро кэширует в памяти данные, к которым недавно был произведен доступ. Кэш очищается только при нехватке свободной памяти для новых данных.\n\nМы можем увидеть различие с помощью команды free:\n\n```\n$ free -h\n```\n\n```\ntotal        used        free      shared  buff/cache   available\nMem:          2.8Gi       1.1Gi       283Mi       224Mi       1.4Gi       1.2Gi\nSwap:         3.0Gi       881Mi       2.1Gi\n```\n\nОбратине внимание на разницу между \"free\" и \"available\". В примере выше, ноутбук с 2.8 ГиБ памяти на вид использует большую ее часть, и только 283 МиБ свободны. Однако, 1,4 ГиБ из них помечены как \"buff/cache\". А 1.2 ГиБ памяти доступны для запуска новых приложений без использования подкачки. Смотрите подробнее man-страницу free(1). Что это дает в результате? Высокую производительность!\n\nЕсли вам стало интересно, прочтите эту замечательную статью. Существует также веб-сайт, посвященный заблуждениям, связанным с этой особенностью Linux: https://www.linuxatemyram.com/. (Перевод на русский язык: Linux съел мою память![устаревшая ссылка 2024-03-03 ⓘ])\n\n"
    },
    {
      "title": "Куда делось все свободное место на диске?",
      "level": 3,
      "content": "Ответ на этот вопрос зависит от вашей системы. Существует множество хороших утилит, которые смогут помочь вам его найти.\n\n"
    },
    {
      "title": "Управление пакетами",
      "level": 2,
      "content": "Смотрите статьи pacman, pacman/Советы и приёмы и Официальные репозитории для более подробной информации.\n\n"
    },
    {
      "title": "Я нашел ошибку в пакете X. Что мне делать?",
      "level": 3,
      "content": "Первым делом вам следует выяснить, может ли эта ошибка быть исправлена командой разработчиков Arch. Иногда это не так (например, в периодическом падении веб-браузера Mozilla, скорее всего, виноваты разработчики из команды Mozilla); это называется ошибка в исходнике (upstream error). Если проблема специфична именно для Arch Linux, вот несколько шагов, которые вы можете предпринять:\n\n1. Поищите о проблеме на форумах. Посмотрите, сталкивался ли еще кто-нибудь с подобной проблемой.\n1. Отправьте отчет об ошибке с подробной информацией на https://bugs.archlinux.org.\n1. При желании вы также можете описать проблему на форуме (не забудьте указать ссылку на отчет об ошибке). Это поможет избежать появления дублированных отчетов об одной и той же ошибке.\n\n"
    },
    {
      "title": "Пакеты Arch должны использовать другое расширение для файлов. \".pkg.tar.zst\" слишком длинное и запутанное",
      "level": 3,
      "content": "Это уже обсуждалось в списках почтовых рассылок Arch. Кто-то предлагал расширение .pac для пакетов. Несмотря на все это, на данный момент никаких планов на изменение расширений для файлов пакетов нет. Как отметил разработчик Arch Тобиас Кислих (Tobias Kieslich):\n\n"
    },
    {
      "title": "Pacman нуждается в библиотеке для предоставления другим приложениям доступа к информации о пакетах",
      "level": 3,
      "content": "Pacman является фронтендом к libalpm(3) — библиотеке управления пакетами Arch. Данная библиотека дает возможность создания альтернативных фронтендов — в том числе, к примеру, графических оболочек.\n\n"
    },
    {
      "title": "В pacman нужна возможность X!",
      "level": 3,
      "content": "Если у вас есть хорошая идея, вы можете обсудить ее в pacman-dev. Также проверьте https://bugs.archlinux.org/index.php?project=3[устаревшая ссылка 2024-01-13 ⓘ] для просмотра существующих идей.\n\nОднако, лучшим способом добавить новую возможность в pacman или Arch Linux является ее самостоятельная реализация. Подготовленный вами патч или код может быть, а может и не быть официально принят, но, возможно, кому-нибудь из пользователей понравится идея, и вам помогут в ее доведении до законченного состояния.\n\n"
    },
    {
      "title": "Я установил пакет X. Как его теперь запустить?",
      "level": 3,
      "content": "Если вы используете окружение рабочего стола вроде KDE или GNOME, программа должна автоматически появиться в меню. Если вы пытаетесь запустить программу из консоли и не знаете имя исполняемого файла, используйте команду\n\n```\n$ pacman -Qlq имя_пакета | grep /usr/bin/\n```\n\n"
    },
    {
      "title": "Почему в репозиториях есть только одна версия каждой библиотеки?",
      "level": 3,
      "content": "Некоторые дистрибутивы, такие как Debian, имеют несколько версий пакетов с разделяемыми библиотеками: libfoo1, libfoo2, libfoo3 и так далее. В этом случае становится возможным одновременно использовать приложения, скомпилированные с поддержкой разных версий библиотеки libfoo, установленных в одной системе.\n\nВ случае такого дистрибутива как Arch, официально поддерживаются только последние стабильные версии пакетов. Не обремененные необходимостью поддержки устаревшего ПО разработчики пакетов имеют в распоряжении больше времени для проверки самых свежих версий программ. Как только выходит новая версия библиотеки, она тут же добавляется в репозитории, и все зависящие от нее пакеты пересобираются.\n\n"
    },
    {
      "title": "Что если я запущу полное обновление и обновится только библиотека, но не приложение, которое от нее зависит?",
      "level": 3,
      "content": "Подобный сценарий вообще не должен случиться. Предположим, что приложение foobaz находится в одном из официальных репозиториев и успешно собирается с новой версией библиотеки libbaz — тогда оно будет обновлено вместе с libbaz. Если, однако, оно не собирается, пакет foobaz будет иметь версионную зависимость (например, libbaz 1.5) и будет удален при обновлении libbaz по причине конфликта.\n\nЕсли пакет foobaz вы скачали из AUR и собрали самостоятельно, вам следует попытаться пересобрать foobaz с новой версией libbaz. Если сборка завершится неудачей, отправьте отчет об ошибке разработчикам foobaz.\n\n"
    },
    {
      "title": "Может ли произойти обновление ядра, при котором некоторые пакеты драйверов не будут обновлены?",
      "level": 3,
      "content": "Нет, подобная ситуация невозможна. Крупные обновления ядра (например, linux 3.5.0-1 до linux 3.6.0-1) всегда сопровождаются пересборкой всех зависимых от ядра пакетов. В то же время, если у вас есть неподдерживаемый пакет, например, из AUR, то обновление ядра приведет к неработоспособности этого пакета, что может быть исправлено его ручной пересборкой. Помните, что пользователи сами отвечают за обновление неподдерживаемых пакетов.\n\n"
    },
    {
      "title": "Что нужно сделать перед полным обновлением системы?",
      "level": 3,
      "content": "Смотрите Обслуживание системы#Обновление системы.\n\n"
    },
    {
      "title": "Появилось обновление пакета, но pacman говорит, что система уже обновлена",
      "level": 3,
      "content": "Зеркала pacman синхронизируются не сразу. Может потребоваться до 24 часов, прежде чем обновления станет для вас доступно. Вам остаётся только подождать или выбрать другое зеркало. MirrorStatus поможет вам выбрать самое актуальное зеркало.\n\n"
    },
    {
      "title": "Проект X выпустил новую версию. Когда в Arch появится пакет с новой версией?",
      "level": 3,
      "content": "Обновления пакетов выпускаются по готовности. Конкретное время может быть как несколько часов, если это небольшое обновление с исправлениями ошибок, так и несколько недель, если это крупное обновление, затрагивающее большое число пакетов. Это зависит от конкретного пакета и наличия времени у сопровождающих. Кроме того, некоторые пакеты некоторое время лежат в репозитории testing. Сопровождающие стараются работать быстро, чтобы стабильно обновлять репозитории. Если вы обнаружили, что какой-то пакет в официальных репозиториях устарел, можно открыть страницу пакета на https://archlinux.org/packages/ и отметить его устаревшим (\"Flag Package Out-of-Date\").\n\n"
    },
    {
      "title": "Если мне нужна более старая версия установленной библиотеки, могу ли я просто сделать символическую ссылку на новую версию?",
      "level": 3,
      "content": "Если вам повезёт, это может сработать на какое-то время. Тем не менее, это неправильное решение, потому что:\n\n- Библиотеки не обновляют свои версии просто так — API/API почти наверняка изменится (в том числе что-то может быть удалено), и повлияют ли эти изменения на использование — вопрос удачи.\n- Менеджер пакетов не будет отслеживать вашу символическую ссылку. Новички, которые пытаются хакнуть системные файлы, получают большой риск внесения нежелательных изменений, которые они не смогут диагностировать и исправить, от чего помогает защититься менеджер пакетов.\n- Альтернатива в виде помещения старого файла библиотеки в файловую систему также не отслеживается. Про его существование можно случайно забыть, при этом в нём могут остаться проблемы безопасности, которые могут быть уже исправлены в более новых версиях библиотеки.\n\nВместо этого лучше используйте или самостоятельно создайте compat-пакет с требуемой версией библиотеки.\n\n"
    },
    {
      "title": "Как узнать, является ли мой процессор x86_64 совместимым?",
      "level": 3,
      "content": "Если ваш процессор является x86_64-совместимым, у вас будет присутствовать флаг lm (long mode) в /proc/cpuinfo. Например,\n\n```\n$ grep -w lm /proc/cpuinfo\n```\n\nПользователи Windows могут определить, является ли процессор x86_64-совместимым с помощью бесплатной утилиты CPU-Z. Процессоры с набором команд \"AMD64\" (для AMD) или \"EM64T\" (для Intel) должны быть совместимы с x86_64-релизами и бинарными пакетами.\n\n"
    },
    {
      "title": "Почему 64 бита?",
      "level": 3,
      "content": "В большинстве случаев, это более быстрая работа системы. Кроме того, по своей природе более безопасная, благодаря рандомизации размещения адресного пространства (ASLR) в комбинации с позиционно-независимым кодом (PIC) и NX Bit, которые недоступны в стандартном i686-ядре из-за отключённого PAE. Если ваш компьютер оснащён более, чем 4 ГБ оперативной памяти, только 64-битная ОС сможет полностью задействовать этот объём.\n\nПрограммисты также склонны меньше уделять внимания \"устаревшей\" 32-битной архитектуре, так как \"новые\" процессоры обычно поддерживают 64-битные расширения.\n\nСуществует намного больше доводов, чтобы избегать использования 32-битной архитектуры. Но для ядра, пространства пользователя и отдельных программ количество вещей, которые 64-битная архитектура сейчас делает лучше такое, что составление этого списка просто не имеет смысла.\n\n"
    }
  ]
}