{
  "title": "Firefox/Profile on RAM (Русский)",
  "url": "https://wiki.archlinux.org/title/Firefox/Profile_on_RAM_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Предположим, что есть свободная память, тогда, поместив кэш или полный профиль Firefox в оперативную память, мы получим значительные преимущества. Несмотря на то что выберите, частичный перенос является улучшением сам по себе, а последний может сделать Firefox ещё более отзывчивым, по сравнению со стандартной конфигурацией. Полученные преимущества:\n\n- уменьшение дисковых операций чтения/записи;\n- повышенная отзывчивость;\n- многие операции в Firefox, такие как быстрый поиск и история запросов, происходят почти мгновенно.\n\nДля этого мы можем использовать tmpfs.\n\nПоскольку данные, помещённые в оперативную память, не сохраняются после выключения компьютера, нам понадобится сценарий, отвечающий за синхронизацию с диском перед завершением работы системы, если желательно сохранить данные (что, скорее всего, актуально в случае перемещения профиля). С другой стороны, перемещение только кэша является быстрым, менее полным решением, которое немного ускорит работу, но кэш Firefox при каждой перезагрузке будет очищен.\n\nNote: **отдельно** \n\n"
    },
    {
      "title": "Размещение кэша только в оперативной памяти",
      "level": 2,
      "content": "Когда загружаются страницы, они могут быть помещены в кэше, так что их не нужно загружать для повторного отображения. Также кэшируется электронная почта и новости, сообщения и вложения. Firefox может быть настроен на использование в качестве кэш-памяти только оперативной памяти. Файлы настроек, закладки, расширения и т.д. будут записаны на диск, как обычно. Для этого:\n\n- откройте в адреснойстроке about:config\n- установите browser.cache.disk.enable на \"false\" (двойным щелчком по строке)\n- проверьте что значение browser.cache.memory.enable установлено в \"true\" (значение по умолчанию)\n- добавьте запись (щелчёк правой кнопкой мышки->Создать->Целое) browser.cache.memory.capacity и установите размер в KB который вы хотите запасти, или в -1 для автоматического определения размера кэша. (Пропуск этого шага имеет тот же эффект, что и установка в значение -1.)\n\nОсновными недостатками этого метода является то, что содержание недавно просмотренных веб-страниц потеряется, если работа браузера завершена аварийно, либо после перезагрузки, и что параметры должны быть настроены для каждого пользователя индивидуально.\n\nИзбежание первого недостатка заключается в том, чтобы использовать anything-sync-daemon или аналогичный периодический скрипт синхронизации, так что кэш будет копироваться на диск регулярно.\n\n"
    },
    {
      "title": "Размещение профиля в оперативной памяти с помощью инструментов",
      "level": 2,
      "content": "Перенесите профиль браузера в tmpfs для глобального улучшения отклика браузера. Ещё одним преимуществом является снижение числа операций ввода-вывода, из которых накопители SSD извлекут максимум выгоды.\n\nИспользуйте активные скрипты управления для максимальной надёжности и простоты использования. Некоторые доступны в AUR.\n\n- profile-sync-daemon - для получения дополнительной информации обратитесь к статье wiki Profile-sync-daemon;\n- firefox-syncAUR - достаточно для пользователя с одним профилем; использует скрипт и службу systemd, аналогичные приведённым ниже.\n\n"
    },
    {
      "title": "Прежде чем начать",
      "level": 3,
      "content": "Сделайте резервную копию для быстрого восстановления на случай проблем. Замените xyz.default на название вашего профиля и используйте tar для создания резервной копии:\n\n```\n$ tar zcvfp ~/firefox_profile_backup.tar.gz ~/.mozilla/firefox/xyz.default\n```\n\n"
    },
    {
      "title": "Скрипт",
      "level": 3,
      "content": "Адаптирован из verot.net Ускорение Firefox с помощью tmpfs\n\nСкрипт сначала переместит профиль Firefox на новое статическое место, создаст подкаталог в /dev/shm, и мягкую ссылку, а затем заполнит его содержимым профиля. Замените выделенную секцию. Единственное значение которое необходимо изменить, опять же xyz.default.\n\nУбедитесь, что установлен rsync, и создайте файл:\n\n```\n~/.local/bin/firefox-sync.sh\n```\n\n```\n#!/bin/sh\n\nstatic=static-$1\nlink=$1\nvolatile=/dev/shm/firefox-$1-$USER\n\nIFS=\nset -efu\n\ncd ~/.mozilla/firefox\n\nif [ ! -r $volatile ]; then\n\tmkdir -m0700 $volatile\nfi\n\nif [ \"$(readlink $link)\" != \"$volatile\" ]; then\n\tmv $link $static\n\tln -s $volatile $link\nfi\n\nif [ -e $link/.unpacked ]; then\n\trsync -av --delete --exclude .unpacked ./$link/ ./$static/\nelse\n\trsync -av ./$static/ ./$link/\n\ttouch $link/.unpacked\nfi\n```\n\nСделайте этот файл исполняемым и выполните следующие команды, чтобы закрыть Firefox и протестировать скрипт:\n\n```\n$ killall firefox firefox-bin\n$ ls ~/.mozilla/firefox/\n$ ~/.local/bin/firefox-sync.sh xyz.default\n```\n\nЗапустите Firefox еще раз, чтобы оценить результаты. Во второй раз запустится скрипт, он сохранит профиль из RAM путем копирования его обратно на диск.\n\n"
    },
    {
      "title": "Автоматизация",
      "level": 3,
      "content": "Если вы забудете синхронизировать профиль, то это может привести к плохим последствиям. Так что будет логично автоматизировать действия.\n\n"
    },
    {
      "title": "systemd",
      "level": 4,
      "content": "Создайте следующий файл:\n\n```\n~/.config/systemd/user/firefox-profile@.service\n```\n\n```\n[Unit]\nDescription=Firefox profile memory cache\n\n[Install]\nWantedBy=default.target\n\n[Service]\nType=oneshot\nRemainAfterExit=yes\nExecStart=%h/.local/bin/firefox-sync.sh %i\nExecStop=%h/.local/bin/firefox-sync.sh %i\n```\n\nЗатем выполните daemon-reload для пользовательского экземпляра systemd и запустите/включите пользовательскую службу firefox-profile@xyz.default.service.\n\n"
    },
    {
      "title": "Задание cron",
      "level": 4,
      "content": "Действуйте пользовательским cron используя таблицу crontab:\n\n```\n$ crontab -e\n```\n\nДобавьте строку, чтобы запускать сценарий каждые 30 минут,\n\n```\n*/30 * * * * ~/.local/bin/firefox-sync.sh xyz.default\n```\n\nили добавьте следующую, чтоб выполнять каждые 2 часа:\n\n```\n0 */2 * * * ~/.local/bin/firefox-sync.sh xyz.default\n```\n\n"
    },
    {
      "title": "Синхронизация при входе/выходе",
      "level": 4,
      "content": "Используя bash, добавьте скрипты в файлы входа/выхода:\n\n```\n$ echo 'bash -c \"~/.local/bin/firefox-sync.sh xyz.default > /dev/null &\"' | tee -a ~/.bash_logout ~/.bash_login\n```\n\nДля zsh используйте ~/.zlogin и ~/.zlogout:\n\n```\n$ echo 'bash -c \"~/.local/bin/firefox-sync.sh xyz.default > /dev/null &\"' | tee -a ~/.zlog{in,out}\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- tmpfs (Русский)\n\n"
    }
  ]
}