{
  "title": "Firefox (Русский)",
  "url": "https://wiki.archlinux.org/title/Firefox_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Плагины для браузеров\n- Firefox/Tweaks\n- Профиль Firefox в ОЗУ\n- Firefox/Privacy\n- Chromium (Русский)\n\nFirefox — популярный графический веб-браузер с открытым исходным кодом, разрабатываемый Mozilla.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет firefox.\n\nАльтернативы:\n\n- Firefox Developer Edition — для разработчиков\n\n- Firefox Extended Support Release — версия с длительным сроком поддержки\n\n- Firefox Beta — бета-версия\n\n- Firefox Nightly — ночные сборки для тестирования экспериментальных возможностей\n\n- Firefox KDE — версия с патчем от OpenSUSE для лучшей интеграции с KDE, чем это возможно сделать с помощью простых дополнений для Firefox.\n\n- Кроме указанных выше каналов распространения Mozilla, существуют также форки со своими особенностями. Смотрите List of applications/Internet#Gecko-based.\n\nКроме языка по умолчанию, английского, для Firefox также доступен ряд языковых пакетов. Обычно они называются firefox-i18n-languagecode (где languagecode может быть любым кодом языка, например, ru, de, ja, fr и так далее). Для получения списка доступных языковых пакетов смотрите firefox-i18n для firefox, firefox-developer-edition-i18n для firefox-developer-edition и firefox-nightly- для firefox-nightlyAUR.\n\n"
    },
    {
      "title": "Дополнения",
      "level": 2,
      "content": "Firefox известен большой библиотекой дополнений, которые используются для добавления новых возможностей или изменения существующих. Управлять дополнениями, а также находить новые, можно с помощью инструмента \"Дополнения\" в Firefox.\n\nИнформация об установке дополнений, а также список некоторых дополнений есть в статье Расширения для браузеров.\n\n"
    },
    {
      "title": "Добавление поисковых движков",
      "level": 3,
      "content": "Поисковые движки можно добавить посредством создания закладки:\n\n- Нажмите на значок звёздочки в адресной строке или сочетание клавиш Ctrl+d, чтобы создать закладку.\n- На созданной вами закладке нажмите правую кнопку мыши и в появившемся меню выберите Изменить закладку...\n- В поле Адрес впишите %s в том месте, куда должен подставляться поисковый запрос. Заполните Ключевое слово, по которому можно будет быстро выполнять поиск в этом поисковом движке прямо из адресной строки. Например:\n\n```\nАдрес:\nhttps://duckduckgo.com/html/?q=%s\nКлючевое слово:\nd\n```\n\nДля выполнения поиска через адресную строку впишите в неё указанное ключевое слово и затем через пробел поисковый запрос. В данном примере запрос d archwiki приведёт к поиску слова archwiki в DuckDuckGo.\n\nТакже поисковые движки можно добавить с помощью обычных дополнений. Смотрите эту страницу для получения списка доступных средств и поисковых движков.\n\nБольшой список поисковых движков можно найти на сайте Mycroft Project (англ.).\n\n"
    },
    {
      "title": "firefox-extension-arch-search",
      "level": 4,
      "content": "Установите пакет firefox-extension-arch-searchAUR, чтобы добавить специфичные для Arch движки поиска (AUR, wiki, форум и т.д.).\n\n"
    },
    {
      "title": "Плагины",
      "level": 2,
      "content": "Поддержка всех плагинов, в том числе Flash Player, была удалена в Firefox 85.[2][3]\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "В Firefox довольно много параметров конфигурации браузера. Чтобы просмотреть их, введите в адресную строку:\n\n```\nabout:config\n```\n\nИзменения вступают в силу для текущего профиля пользователя и могут синхронизироваться между устройствами с помощью Firefox Sync. Обратите внимание, что таким образом синхронизируется только часть всех параметров about:config; полный список синхронизируемых параметров можно узнать, введя в поиск services.sync.prefs. Дополнительные и сторонние параметры (например, дополнений) можно вручную добавить в синхронизацию, создав новый параметр типа boolean с названием, начинающимся с services.sync.prefs.sync. Например, для синхронизации белого списка дополнения NoScript, добавьте следующий параметр:\n\n```\nservices.sync.prefs.sync.capability.policy.maonoscript.sites\n```\n\nПараметр noscript.sync.enabled должен иметь значение true для синхронизации остальных настроек NoScript через Firefox Sync.\n\n"
    },
    {
      "title": "Расположение настроек",
      "level": 3,
      "content": "Firefox хранит конфигурацию профиля в файле prefs.js в папке профиля, обычно ~/.mozilla/firefox/xxxxxxxx.default/.\n\nТакже Firefox позволяет хранить конфигурацию профиля в файле user.js: user.js в папке профиля. Настройки в файле user.js имеют приоритет над настройками в файле prefs.js. Конфигурация user.js считывается только при запуске профиля, так что вы можете проверить изменения через about:config и соответствующим образом изменить user.js во время работы браузера. Пример файла, который ориентирован на увеличение безопасности и приватности пользователя, доступен в данном репозитории.\n\nНедостаток такого подхода в том, что параметры не применяются сразу для всей системы. Более того, его нельзя использовать для предварительной конфигурации, так как папка профиля создаётся только после первого запуска браузера. С другой стороны, можно запустить firefox для создания профиля, закрыть его и скопировать содержимое уже созданного профиля в новую папку.\n\nИногда необходимо заблокировать некоторые параметры, например, при установке модифицированной версии Firefox на большое количество устройств. Чтобы создать конфигурацию для всей системы, выполните шаги, описанные в статье Модификация Firefox с помощью AutoConfig:\n\n1. Создайте /usr/lib/firefox/defaults/pref/autoconfig.js:\n\n```\npref(\"general.config.filename\", \"firefox.cfg\");\npref(\"general.config.obscure_value\", 0);\n```\n\n2. Создайте /usr/lib/firefox/firefox.cfg (в котором будет храниться сама конфигурация):\n\n```\n//\n//...ваши настройки...\n// например, раскомментируйте параметр ниже для отключения Pocket\n// lockPref(\"extensions.pocket.enabled\", false);\n// lockPref(\"browser.newtabpage.activity-stream.feeds.section.topstories\", false);\n```\n\nОбратите внимание, что первая строка должна содержать именно //. Синтаксис данного файла похож на синтаксис user.js.\n\n"
    },
    {
      "title": "Воспроизведение медиаконтента",
      "level": 3,
      "content": "В Firefox используется FFmpeg для воспроизведения медиаконтента в HTML5-элементах <audio> и <video>. Перейдите на страницу видео-теста или страницу аудио-теста (англ.) для проверки поддерживаемых форматов.\n\nВ Firefox используется PulseAudio при захвате и воспроизведении аудио. Если PulseAudio не установлен, то используется ALSA.\n\n"
    },
    {
      "title": "HTML5 DRM/Widevine",
      "level": 4,
      "content": "Widevine — это инструмент управления цифровыми правами, который Netflix, Amazon Prime Video и другие компании используют для защиты своего видеоконтента. Его можно включить в разделе Настройки > Основные > Содержимое использующее технические средства защиты авторских прав (DRM). Если вы посетите страницу с Widevine-контентом, когда эта настройка отключена, Firefox отобразит запрос на разрешение установки DRM под адресной строкой. Подтвердите его, а затем дождитесь исчезновения строки \"Загрузка\"; после этого вы можете смотреть видео с сайтов, защищённых Widevine.\n\nFirefox может воспроизводить только видео 720p (или ниже) с Widevine, поскольку не использует аппаратное воспроизведение DRM. Также необходимо, чтобы приватный режим просмотра был отключен, как в окне, так и в Настройках.\n\n"
    },
    {
      "title": "Дополнение \"Open With\"",
      "level": 4,
      "content": "1. Установите дополнение Open With.\n1. Перейдите в Дополнения > Open With > Preferences.\n1. Следуйте инструкциям по установке файла в систему, после чего проверьте его доступность.\n1. Нажмите Add browser.\n1. В диалоге укажите название для данной записи в меню и команду для запуска видеоплеера с поддержкой потокового вещания (например, /usr/bin/mpv). По необходимости добавьте аргументы для плеера (например, --force-window --ytdl для mpv)\n1. Нажмите правой кнопкой мыши на ссылке с видео или перейдите на его страницу. Выберите добавленную запись из меню Open With и если сайт поддерживается, откроется плеер с данным видео.\n\n1. По необходимости добавьте аргументы для плеера (например, --force-window --ytdl для mpv)\n\nТаким же образом можно добавить запись с youtube-dl для загрузки видео.\n\n"
    },
    {
      "title": "Аппаратное ускорение видео",
      "level": 4,
      "content": "Аппаратное ускорение видео с использованием VA-API доступно как в Xorg (Русский) [4] [5], так и в Wayland [6].\n\nПеред проверкой поддержки VA-API в Firefox убедитесь, что выполнены следующие действия:\n\n1. Установлен корректный драйвер VA-API для используемой видеокарты и проверена его работоспособность; смотрите Аппаратное ускорение видео.\n1. WebRender включен. Откройте страницу about:support и посмотрите Композитинг. Он включен по умолчанию в GNOME и других средах рабочего стола [7]. Убедитесь, что используется не программный WebRender, так как по состоянию на 2021 год с ним ускорение не работало [8]. При необходимости можно принудительно включить аппаратно ускоренный WebRender путём переключения настройки gfx.webrender.all на значение true.\n1. Параметру media.ffmpeg.vaapi.enabled задано значение true в about:config.\n1. При использовании Wayland Firefox должен запускаться в режиме Wayland.\n\n- Убедитесь, что используется не программный WebRender, так как по состоянию на 2021 год с ним ускорение не работало [8].\n- При необходимости можно принудительно включить аппаратно ускоренный WebRender путём переключения настройки gfx.webrender.all на значение true.\n\n- Хотя проприетарный драйвер NVIDIA не поддерживает VA-API, новые его версии поддерживают DMA-BUF. Использование libva-nvidia-driver позволит осуществлять аппаратное декодирование видео на NVIDIA с помощью CUDA. Инструкция по настройке есть в репозитории на GitHub.\n- В настоящее время реализация VA-API в Firefox может декодировать H.264/AVC, VP8 и VP9, AV1. Для поддержки AV1 требуется FireFox 98 или новее [9].\n- Как сказано в этом сообщении, на системах с несколькими видеокартами подходящий GPU для VA-API должен выбираться автоматически.\n- Пользователям AMDGPU под linux-hardened может потребоваться пересобрать linux-hardened с параметром CONFIG_CHECKPOINT_RESTORE=y из-за того, что mesa требует системный вызов kcmp. Это может больше не потребоваться в связи с решением этой ошибки.\n\nОпределить статус VA-API можно, запустив Firefox с переменной окружения MOZ_LOG=\"PlatformDecoderModule:5\" и проверив лог, в котором будет сказано о статусе и использовании VA-API. К примеру, проверьте строки с содержанием \"VA-API\" при проигрывании видео на YouTube. Обратите внимание на эти логи, так как в них также может быть сказано о поддержке только одного из двух методов аппаратно-ускоренного композитинга (WebRender или OpenGL) с помощью VA-API в вашей системе.\n\n"
    },
    {
      "title": "Проверка орфографии",
      "level": 3,
      "content": "Firefox поддерживает использование общесистемных словарей Hunspell, а также словарей, установленных в качестве расширений.\n\nЧтобы включить проверку правописания для определённого языка, нажмите правой кнопкой мыши на любом текстовом поле и отметьте галочкой пункт Проверка орфографии. Для выбора языка, снова нажмите ПКМ и выберите необходимый язык из подменю Языки.\n\nЕсли выбор языка по умолчанию не сохраняется, см. раздел #Firefox не запоминает язык проверки орфографии по умолчанию.\n\n"
    },
    {
      "title": "Общесистемные словари Hunspell",
      "level": 4,
      "content": "Установите Hunspell и словари необходимых языков.\n\n"
    },
    {
      "title": "Словари-расширения",
      "level": 4,
      "content": "Чтобы добавить больше языков, нажмите правой кнопкой мыши на любом текстовом поле, выберите Добавить словари... и загрузите необходимые словари со списка словарей и языковых пакетов.\n\n"
    },
    {
      "title": "Интеграция с KDE",
      "level": 3,
      "content": "- Чтобы задать внешний вид KDE GTK-приложениям (в том числе Firefox), установите breeze-gtk и kde-gtk-config. После чего перейдите в Параметры системы > Внешний вид > Оформление приложений > Настроить оформление приложений GNOME/GTK и выберите тему 'Breeze'.\n- Чтобы использовать диалоги выбора файлов и печати KDE в Firefox 64 и новее, установите пакеты xdg-desktop-portal и xdg-desktop-portal-kde, после чего выполните один из этих вариантов: На странице about:config установите значение widget.use-xdg-desktop-portal.mime-handler в 1. Также нужно изменить widget.use-xdg-desktop-portal.file-picker с 2 на 1. Запустите Firefox с переменной окружения GTK_USE_PORTAL=1.\n- Для интеграции с системой MIME-типов KDE и диалогом выбора файлов можно воспользоваться firefox-kde-opensuseAUR, сборкой Firefox с патчами от OpenSUSE. В качестве альтернативы можно создать символическую ссылку на базу данных MIME ~/.config/mimeapps.list из устаревшей базы данных ~/.local/share/applications/mimeapps.list, используемой Firefox. См. XDG MIME Applications (Русский)#mimeapps.list.\n- Также существуют расширения для дополнительной интеграции, например: Интеграция браузера с Plasma. Необходимо установить plasma-browser-integration и дополнение Plasma Integration.\n\n- На странице about:config установите значение widget.use-xdg-desktop-portal.mime-handler в 1. Также нужно изменить widget.use-xdg-desktop-portal.file-picker с 2 на 1.\n- Запустите Firefox с переменной окружения GTK_USE_PORTAL=1.\n\n- Интеграция браузера с Plasma. Необходимо установить plasma-browser-integration и дополнение Plasma Integration.\n\n"
    },
    {
      "title": "Преобразование текста в речь",
      "level": 3,
      "content": "Firefox может преобразовывать текст веб-страниц в речь. Для этого используется Speech Dispatcher, поэтому сначала установите пакет speech-dispatcher. Кроме того, Speech Dispatcher требует наличия движка синтеза речи. Рекомендуемый в настоящее время движок — Festival; для его установки следуйте инструкциям из раздела Festival (Русский)#Установка.\n\nПосле установки пакета настройте и протестируйте Festival. Затем настройте и протестируйте Speech Dispatcher.\n\nВ Firefox перейдите в Вид для чтения и нажмите кнопку Прослушать слева.\n\nЕсли для страницы доступен Вид для чтения, в правой части адресной строки появится значок страницы. Для перехода в Вид для чтения нажмите на этот значок.\n\nДля решения проблем смотрите раздел #Web Speech API не имеет голосов.\n\n"
    },
    {
      "title": "Советы и рекомендации",
      "level": 2,
      "content": "Для получения информации об общих улучшениях и улучшениях безопасности смотрите статьи Firefox/Tweaks и Firefox/Privacy соответственно.\n\n"
    },
    {
      "title": "Тёмные темы",
      "level": 3,
      "content": "Firefox должен использовать настройки темы GTK и параметры тёмной темы, указанные в настройках системы (как в разделе \"Внешний вид\" настроек GNOME или системных настроек KDE). Если это не работает, убедитесь, что установлен подходящий пакет xdg-desktop-portal.\n\nНачиная с Firefox 68, интерфейсу Firefox и даже другим сайтам можно задать приоритет использования тёмной темы независимо от темы Firefox и системной темы GTK. Задайте параметру ui.systemUsesDarkTheme значение 1 на странице about:config [10].\n\nНачиная с Firefox 100, можно управлять темой веб-страниц, использующих prefers-color-scheme, и внутренних страниц Firefox с помощью параметра layout.css.prefers-color-scheme.content-override. При значении 3 будет использоваться тема браузера, при значении 2 будет использоваться тема системы (если существует вышеупомянутый параметр ui.systemUsesDarkTheme, то будет использоваться его значение), а 1 и 0 включают светлую и тёмную темы соответственно. Также можно изменить этот параметр через настройки Firefox в разделе Основные > Язык и внешний вид > Внешний вид сайтов.\n\n"
    },
    {
      "title": "Частота смены кадров",
      "level": 3,
      "content": "Если Firefox не может определить корректное значение автоматически, то частота смены кадров будет равняться 60. Задайте параметру layout.frame_rate частоту смены кадров используемого монитора (например, 144 для монитора с частотой 144 Гц), чтобы изменить данное поведение вручную.\n\n"
    },
    {
      "title": "Ограничение использования памяти",
      "level": 3,
      "content": "Воспользуйтесь Firejail с параметром rlimit-as, чтобы предотвратить слишком большое потребление памяти веб-страницами (и возможную нехватку памяти).\n\n"
    },
    {
      "title": "Расположение новых вкладок",
      "level": 3,
      "content": "Используйте параметры browser.tabs.insertAfterCurrent и browser.tabs.insertRelatedAfterCurrent, чтобы настроить расположение новых вкладок (относительное или абсолютное). См. [11] для получения более подробной информации.\n\n"
    },
    {
      "title": "Скриншот страницы",
      "level": 3,
      "content": "Сделать скриншот можно кнопкой, которую можно добавить на панель инструментов (меню Другие инструменты > Настройка панели инструментов), нажатием Ctrl+Shift+s или щёлкнув правой кнопкой мыши по странице и выбрав соответствующий пункт меню. Смотрите [12] для получения более подробной информации.\n\nВ качестве альтернативы можно воспользоваться кнопкой для создания скриншота в инструментах разработчика. Чтобы добавить кнопку, выберите пункт Параметры в меню инструментов разработчика (кнопка с тремя горизонтальными точками) и поставьте галочку в разделе Доступные кнопки инструментов.\n\n"
    },
    {
      "title": "Wayland",
      "level": 3,
      "content": "Последние версии Firefox можно запустить в режиме Wayland с помощью переменной окружения.\n\n```\n$ MOZ_ENABLE_WAYLAND=1 firefox\n```\n\nЧтобы сделать данное изменение постоянным, смотрите Переменные окружения#Графические приложения и запускайте Firefox с помощью ярлыка (как обычно).\n\nЧтобы проверить, что это сработало, посмотрите строку Протокол управления окнами на странице about:support — там должно быть написано wayland. Если там написано x11 — значит Firefox работает в Xorg, а значение xwayland означает, что у вас используется Wayland, но Firefox запустился как legacy X11 приложение.\n\nЕсли вам приходится постоянно переключаться между Wayland и X.org, можно добавить условие в скрипт, запускаемый оболочкой входа, например в ~/.bash_profile для Bash:\n\n```\nif [ \"$XDG_SESSION_TYPE\" == \"wayland\" ]; then\n    export MOZ_ENABLE_WAYLAND=1\nfi\n```\n\n"
    },
    {
      "title": "Правила оконного менеджера",
      "level": 3,
      "content": "Измените значение строки WM_CLASS на желаемое с использованием аргумента --class для применения разных настроек к окнам Firefox.\n\n"
    },
    {
      "title": "Профили",
      "level": 3,
      "content": "Для запуска новых копий Firefox необходимо создать несколько профилей:\n\n```\n$ firefox [--new-instance] -P\n```\n\nКласс окна указывается при запуске Firefox с неиспользуемым профилем:\n\n```\n$ firefox [--new-instance] -P profile_name --class=class_name\n```\n\nМожно использовать Firefox Profilemaker для создания профиля Firefox с настройками по умолчанию, которые вам нравятся.\n\n"
    },
    {
      "title": "Сенсорные жесты и точная прокрутка на тачпаде",
      "level": 3,
      "content": "Задайте переменную окружения MOZ_USE_XINPUT2=1 перед запуском Firefox для включения сенсорных жестов (например, прокрутки и масштабирования) и (\"один в один\") точной прокрутки на тачпаде (что заметно в GTK3-приложениях, например, Nautilus). В Wayland достаточно просто использовать MOZ_ENABLE_WAYLAND=1.\n\nКинетическая прокрутка ощущается нечётко на Wayland из-за https://bugzilla.mozilla.org/show_bug.cgi?id=1568722, и её можно отключить, зайдя на страницу about:config и выключив apz.gtk.kinetic_scroll.enabled. Однако это затруднит прокрутку к началу и концу длинных страниц.\n\n"
    },
    {
      "title": "Несколько домашних страниц",
      "level": 3,
      "content": "Чтобы при запуске Firefox открывалось несколько вкладок, откройте новое окно, а затем откройте сайты, которые вы хотите иметь в качестве «домашних вкладок».\n\nТеперь перейдите в Настройки > Начало, в разделе Домашняя страница и новые окна выберите пункт Мой URL... и нажмите кнопку Использовать текущие страницы.\n\nТакже можно вписать адреса страниц вручную в таком формате:\n\n```\nhttps://url1.com|https://url2.com|https://url3.com\n```\n\n"
    },
    {
      "title": "Отображение двух страниц бок о бок в просмотрщике PDF",
      "level": 3,
      "content": "Чтобы просмотрщик PDF отображал по две страницы вместо одной, задайте параметру pdfjs.spreadModeOnLoad значение 1 на странице about:config.\n\n"
    },
    {
      "title": "Режим киоска",
      "level": 3,
      "content": "Firefox поддерживает режим киоска, который показывает страницы в полноэкранном режиме без интерфейса браузера, контекстных меню и других функций, полезных для типичного использования на рабочем столе. Такой режим используется, например, на банкоматах или информационных панелях, где пользователи не должны взаимодействовать с остальной частью системы.\n\nЧтобы использовать режим киоска, запустите Firefox с такими аргументами:\n\n```\n$ firefox --kiosk url\n```\n\nНачальная страница может быть настроена в настройках или задана в качестве параметра командной строки.\n\nЕсли вам нужна печать, вы можете запретить Firefox показывать диалоговые окна настройки размера бумаги с помощью аргумента:\n\n```\n$ firefox --kiosk --kiosk-printing url\n```\n\n"
    },
    {
      "title": "Компактный режим",
      "level": 3,
      "content": "Начиная с Firefox 89, опция включения компактного режима была удалена из панели настройки [13], но вы всё ещё можете включить компактный режим, установив параметр browser.uidensity на 1 на странице about:config.\n\n"
    },
    {
      "title": "Безопасный режим",
      "level": 3,
      "content": "Аргумент командной строки -safe-mode запускает Firefox в Безопасном режиме, который отключает расширения, темы, аппаратное ускорение, JIT и некоторые другие функции для данного сеанса.\n\nЭтот режим также можно включить в запущенном Firefox, нажав на кнопку главного меню, выбрав Справка > Безопасный режим и подтвердив это в появившемся модальном диалоге. Обратите внимание, что для этого потребуется перезапуск браузера.\n\n"
    },
    {
      "title": "Очистка Firefox",
      "level": 3,
      "content": "Некоторые проблемы, с которыми сталкиваются пользователи Firefox, могут быть вызваны проблемами с профилем, например, его повреждением.\n\nЕсли вы исключили другие причины, возможно, стоит попробовать новый профиль Firefox в тестовых целях, чтобы узнать, решит ли это вашу проблему. Более подробная информация о том, как создать новый профиль и переключаться между профилями, есть на странице поддержки Firefox.\n\nЕсли это решит вашу проблему, тогда вам нужно вернуться к исходному профилю и очистить его.\n\nОчистка профиля сохранит всю историю просмотров и загрузок, закладки, данные автозаполнения веб-форм, файлы cookie, личный словарь и пароли и перенесёт их в совершенно новый профиль без расширений, тем, данных расширений и предпочтений, а также других данных. Резервная копия старого профиля также будет сохранена.\n\nЧтобы очистить профиль, откройте about:support, нажмите Очистить Firefox и подтвердите это в появившемся модальном диалоге. Также можно открыть about:support через кнопку главного меню, выбрав пункт Справка > Информация для решения проблем.\n\nБолее подробная информация об очистке Firefox, в том числе подробности о том, что переносится в новый профиль, есть на странице поддержки Firefox.\n\n"
    },
    {
      "title": "Проблемы с аппаратным ускорением видео",
      "level": 3,
      "content": "Если у вас возникли проблемы с аппаратным ускорением видео в Firefox, например, зависание или искажение графики, запустите Firefox в Безопасном режиме для тестирования, чтобы убедиться, что проблема именно в этом. Если это решит проблему, просто установите media.ffmpeg.vaapi.enabled в false на странице about:config, чтобы отключить аппаратное ускорение видео, и перезапустите Firefox.\n\n"
    },
    {
      "title": "Расширения не работают на некоторых доменах Mozilla",
      "level": 3,
      "content": "По умолчанию расширения не затрагивают страницы, определённые параметром extensions.webextensions.restrictedDomains. Чтобы изменить данное поведение, оставьте значение параметра пустым (специальные страницы, например, about:*, не будут затронуты). Затем создайте параметр privacy.resistFingerprinting.block_mozAddonManager со значением true.\n\n"
    },
    {
      "title": "Запуск Firefox занимает много времени",
      "level": 3,
      "content": "Firefox может загружаться дольше, чем другие браузеры, если в файле /etc/hosts отсутствует localhost. Смотрите раздел Настройка сети#Разрешение имён в локальной сети для получения информации о настройке.\n\nНекорректно работающие расширения Firefox или слишком большое количество расширений также могут замедлять запуск. Проверить это можно с помощью запуска в Безопасном режиме, который отключает расширения.\n\nЕщё одной причиной медленного запуска может быть проблема с профилем, например, его повреждение. В таком случае может помочь #Очистка Firefox.\n\n"
    },
    {
      "title": "Исправление шрифтов",
      "level": 3,
      "content": "См. Настройка шрифтов.\n\nFirefox использует отдельный параметр, определяющий количество замен из fontconfig. Задайте параметру gfx.font_rendering.fontconfig.max_generic_substitutions значение 127 (максимальное число), чтобы разрешить использование всех правил замены.\n\nFirefox поставляется со шрифтом Twemoji Mozilla. Чтобы использовать системный шрифт emoji, установите значение font.name-list.emoji на emoji на странице about:config. Кроме того, чтобы шрифт Mozilla не мешал системному шрифту emoji, измените gfx.font_rendering.opentype_svg.enabled на false или удалите /usr/lib/firefox/fonts/TwemojiMozilla.ttf (смотрите также pacman (Русский)#Запрет на установку файлов).\n\n"
    },
    {
      "title": "Выбор клиента электронной почты",
      "level": 3,
      "content": "По умолчанию Firefox открывает ссылки mailto веб-приложением, таким как Gmail или Yahoo Mail. Чтобы выбрать другой клиент, перейдите в Настройки > Основные > Приложения и в столбце Действие для mailto укажите абсолютный путь к исполняемому файлу клиента электронной почты (например, /usr/bin/kmail для KMail).\n\nВне браузера, ссылки mailto обрабатываются MIME-типом x-scheme-handler/mailto, который можно легко настроить с помощью xdg-mime. См. статью Приложения по умолчанию для получения более подробной информации.\n\n"
    },
    {
      "title": "Ассоциации файлов",
      "level": 3,
      "content": "Смотрите Приложения по умолчанию.\n\n"
    },
    {
      "title": "Firefox самопроизвольно создаёт директорию ~/Desktop",
      "level": 3,
      "content": "Firefox использует директорию ~/Desktop для скачиваемых и загружаемых файлов по умолчанию. Настройте параметр XDG_DESKTOP_DIR, как описано в статье XDG user directories (Русский), чтобы сменить директорию.\n\n"
    },
    {
      "title": "Не применяются изменения в файлах userChrome.css и userContent.css",
      "level": 3,
      "content": "Задайте параметру toolkit.legacyUserProfileCustomizations.stylesheets значение true на странице about:config\n\n"
    },
    {
      "title": "Поведение при нажатии средней кнопки мыши",
      "level": 3,
      "content": "Задайте параметру middlemouse.contentLoadURL или middlemouse.paste значение true в about:config, чтобы использовать среднюю кнопку мыши для вставки содержимого буфера обмена, как это принято в UNIX-подобных операционных системах. Опция middlemouse.contentLoadURL была включена по умолчанию до Firefox 57.\n\nЗадайте параметру general.autoScroll значение true, чтобы использовать среднюю кнопку мыши для прокрутки (стандартное поведение для браузеров в Windows).\n\n"
    },
    {
      "title": "Клавиша Backspace не выполняет функцию \"Назад\"",
      "level": 3,
      "content": "Согласно MozillaZine, действие клавиши Backspace задавалось в зависимости от ОС, в которой выполнялся браузер. В качестве компромисса был создан параметр, позволяющий игнорировать нажатие Backspace или использовать его для перехода на следующую/предыдущую страницу или для прокрутки страницы вверх/вниз.\n\nЗадайте параметру browser.backspace_action значение 0 в about:config, чтобы использовать Backspace для перехода на одну страницу назад и Shift+Backspace на страницу вперёд в истории вкладки.\n\nЗадайте параметру browser.backspace_action значение 1, чтобы использовать клавишу Backspace для прокрутки на одну страницу вверх и Shift+Backspace на страницу вниз. В случае с какими-либо другими значениями нажатия клавиши будут игнорироваться (в Arch Linux по умолчанию используется 2, т.е. действие не назначено).\n\n"
    },
    {
      "title": "Firefox не запоминает авторизацию на сайте",
      "level": 3,
      "content": "Это может быть вызвано повреждённым файлом cookies.sqlite в профиле Firefox. Переименуйте или удалите cookie.sqlite, предварительно закрыв Firefox, чтобы исправить проблему.\n\nОткройте терминал и введите следующее:\n\n```\n$ rm -f ~/.mozilla/firefox/<id профиля>.default/cookies.sqlite\n```\n\nID профиля — случайно сгенерированная строка из 8 символов.\n\nПерезапустите Firefox и проверьте, помогло ли это решить проблему.\n\nЕсли это не помогло, проверьте, существует ли файл cookies.sqlite.bak, который можно использовать для восстановления cookies вручную.\n\n"
    },
    {
      "title": "Невозможно войти в полноэкранный режим или выйти из него",
      "level": 3,
      "content": "Если Firefox обнаруживает оконный менеджер, совместимый со спецификацией EWMH/ICCCM, Firefox попытается отправить корневому окну сообщение WM_STATE с запросом на вход в полноэкранный режим или выход из него (согласно определению оконного менеджера). Спецификация позволяет оконным менеджерам игнорировать данные сообщения, но в таком случае Firefox посчитает, что запрос был отклонён и передаст его конечному пользователю, что не приведёт к какому-либо результату, а также может помешать открытию видео в полноэкранном режиме. Временное решение заключается в задании параметру full-screen-api.ignore-widgets значения true на странице about:config.\n\nСоответствующий отчёт об ошибке: Bugzilla 1189622.\n\n"
    },
    {
      "title": "Контекстное меню JavaScript не отображается на некоторых сайтах",
      "level": 3,
      "content": "Попробуйте задать параметру dom.w3c_touch_events.enabled значение 0 в about:config.\n\n"
    },
    {
      "title": "Firefox не запоминает язык проверки орфографии по умолчанию",
      "level": 3,
      "content": "Язык проверки орфографии по умолчанию задаётся следующим образом:\n\n1. Введите about:config в адресной строке.\n1. Задайте параметру spellchecker.dictionary необходимый язык, например, en_GB.\n1. Заметьте, что в случае со словарями, установленными с помощью плагинов Firefox, следует указывать en-GB, а в случае со словарями hunspell — en_GB.\n\nFirefox может не запоминать язык по умолчанию, если установлены только системные словари hunspell. Это исправляется установкой хотя бы одного словаря в виде Firefox-плагина. Также после этого на странице Дополнения и темы появится вкладка Словари. Кроме того, может потребоваться изменить порядок предпочитаемых языков для отображения веб-страниц в about:preferences#general, чтобы язык проверки орфографии по умолчанию соответствовал языку словаря из дополнения.\n\nСвязанные вопросы на StackExchange: [14], [15], [16]\n\nСоответствующие отчёты об ошибках: Bugzilla 776028, Ubuntu bug 1026869\n\n"
    },
    {
      "title": "Не отображаются некоторые символы MathML",
      "level": 3,
      "content": "Необходимо установить шрифты Latin Modern Math и STIX (см. страницу MDN: [17]) для корректного отображения MathML.\n\nВ Arch Linux данные шрифты содержатся в пакетах texlive-basic и texlive-fontsextra, но недоступны fontconfig по умолчанию. См. TeX Live#Making fonts available to Fontconfig для получения более подробной информации. Также можно попробовать другие математические шрифты. Если вы столкнулись с этой ошибкой [18], может помочь установка otf-latinmodern-math.\n\n"
    },
    {
      "title": "Видео загружается, но не воспроизводится",
      "level": 3,
      "content": "Это может быть проблема с PulseAudio. Попробуйте перезапустить его с помощью команд pulseaudio --kill и pulseaudio --start или вообще заменить его на PipeWire.\n\n"
    },
    {
      "title": "Разрыв изображения во время скроллинга",
      "level": 3,
      "content": "Попробуйте отключить плавную прокрутку в Настройках > Просмотр сайтов.\n\n"
    },
    {
      "title": "WebRTC-модуль Firefox не обнаруживает микрофон",
      "level": 3,
      "content": "WebRTC-приложения, например, тестовая страница Firefox WebRTC getUserMedia, сообщают, что не могут обнаружить микрофон. Проблема воспроизводится как с ALSA, так и с PulseAudio, а логи отладки Firefox показывают следующую ошибку:\n\n```\n$ NSPR_LOG_MODULES=MediaManager:5,GetUserMedia:5 firefox\n```\n\n```\n...\n[Unnamed thread 0x7fd7c0654340]: D/GetUserMedia  VoEHardware:GetRecordingDeviceName: Failed 1\n```\n\nПопробуйте задать параметру media.navigator.audio.full_duplex значение false на странице about:config и перезапустить Firefox.\n\nТакже это может помочь в случае, когда Firefox не обнаруживает виртуальный источник эхоподавления при использовании module-echo-cancel в PulseAudio.\n\n"
    },
    {
      "title": "Индикатор WebRTC отображает ошибку разбора XML",
      "level": 3,
      "content": "После согласия на использование микрофона или веб-камеры вы можете увидеть окно с загорелым фоном и красной рамкой в левом верхнем углу вашего основного окна, в котором отображается следующее сообщение об ошибке:\n\n```\nXML Parsing Error: no root element found\nLocation: chrome://browser/content/webrtcLegacyIndicator.xhtml\nLine Number: 1, Column 1:\n^\n```\n\nВ таком случае выполнение следующих действий поможет решить проблему:\n\n1. Откройте страницу about:support.\n1. Нажмите на кнопку Очистить кэш запуска и согласитесь перезапустить браузер.\n\nПодробности в сообщении об ошибке.\n\n"
    },
    {
      "title": "Не получается авторизоваться с китайским аккаунтом",
      "level": 3,
      "content": "Firefox предоставляет локальный сервис китайским пользователям, в котором используется совершенно другой, локальный, аккаунт вместо интернационального. Firefox, установленный с помощью пакета firefox, по умолчанию использует интернациональную систему аккаунтов, а для её изменения на китайскую потребуется установить менеджер дополнений с данной страницы, после чего можно будет авторизоваться, используя китайский аккаунт.\n\n"
    },
    {
      "title": "Некоторые видео воспроизводятся без звука при использовании JACK и PulseAudio",
      "level": 3,
      "content": "Если JACK используется в сочетании с PulseAudio и некоторые видео воспроизводятся без звука, это может быть вызвано тем, что видео содержит моноканальный звук. В свою очередь, это случается, когда JACK настроен на объёмный звук, но используются обычные наушники. В таком случае необходимо подключить порт front-center из PulseAudio JACK Sink к портам playback_1 и playback_2 системного вывода.\n\nТакже это можно автоматизировать с помощью скрипта:\n\n```\njack-mono.sh\n```\n\n```\n#!/bin/sh\njack_connect \"PulseAudio JACK Sink:front-center\" \"system:playback_1\"\njack_connect \"PulseAudio JACK Sink:front-center\" \"system:playback_2\"\n```\n\nИмейте ввиду, что названия PulseAudio JACK Sink и портов могут отличаться от примеров. Также увидеть текущую настройку JACK можно с помощью такой патч-панели, как Catia из cadenceAUR.\n\n"
    },
    {
      "title": "Не работает геолокация",
      "level": 3,
      "content": "Недавно в Google ограничили использование службы определения местоположения для Arch Linux, из-за чего появляется следующая ошибка на сайтах, использующих геолокацию: \"Geolocation error: Unknown error acquiring position\". Сервисы с привязкой к региону, такие как Hulu, могут отображать подобную ошибку, указывая, что ваше местоположение не может быть определено, даже если вы разрешили сервисы определения местоположения для сайта.\n\nВо избежание данной проблемы можно использовать Mozilla Location Service. Замените содержание параметра geo.provider.network.url в about:config на следующее:\n\n```\nhttps://location.services.mozilla.com/v1/geolocate?key=%MOZILLA_API_KEY%\n```\n\nСм. FS#65241 для получения более подробной информации.\n\n"
    },
    {
      "title": "Правая кнопка мыши автоматически выбирает первый пункт меню",
      "level": 3,
      "content": "Данная проблема была замечена при использовании i3, bspwm и xmonad.\n\nДля решения перейдите на страницу about:config и задайте значение true параметру ui.context_menus.after_mouseup.\n\nСм. [19] (англ.) для получения более подробной информации.\n\n"
    },
    {
      "title": "Окно Firefox не перерисовывается после отключения или включения композитинга",
      "level": 3,
      "content": "Уберите переменную окружения MOZ_X11_EGL.\n\nСообщение об ошибке: Bugzilla 1711039.\n\n"
    },
    {
      "title": "Firefox постоянно просит установить его в качестве браузера по умолчанию при запуске",
      "level": 3,
      "content": "Можно попробовать несколько способов: если вы используете среду рабочего стола, проверьте, выбран ли Firefox в качестве браузера по умолчанию в настройках системы. Если нет, то выберите его, в противном случае вы можете выполнить следующую команду xdg-settings(1) из пакета xdg-utils, чтобы узнать, какой браузер установлен по умолчанию в вашей системе:\n\n```\n$ xdg-settings get default-web-browser\n```\n\nЕсли значение отсутствует или это не Firefox, выполните эту команду, чтобы выбрать его:\n\n```\n$ xdg-settings set default-web-browser firefox.desktop\n```\n\nЕсли Firefox по-прежнему просит установить его в качестве браузера по умолчанию, то его можно успокоить, если настроить его на обработку схем URL http и https. Для этого выполните следующие команды xdg-mime(1):\n\n```\n$ xdg-mime default firefox.desktop x-scheme-handler/http\n$ xdg-mime default firefox.desktop x-scheme-handler/https\n```\n\nЕсли всё это не помогает, проверьте, установлена ли у вас переменная окружения GTK_USE_PORTAL (любые значения приводят к проявлению ошибки), в этом случае уберите её. Сообщение об ошибке: Bugzilla 1516290. Если это не помогло или этой переменной никогда не было, откройте about:config, проверьте, имеет ли параметр widget.use-xdg-desktop-portal значение true и, если да, измените на false.\n\nЕсли вы хотите полностью отключить проверку браузера по умолчанию, на странице about:config установите browser.shell.checkDefaultBrowser в false.\n\n"
    },
    {
      "title": "Видео дёргается",
      "level": 3,
      "content": "Если у вас возникают дёргания или заикания при просмотре видео и вы замечаете, что Firefox задействует только одно ядро на 100% при просмотре видео (особенно видео высокого разрешения), это может вам помочь.\n\nНа странице about:config введите в поиск dom.ipc.processCount и измените dom.ipc.processCount.file с 1 на большее число. Увеличивайте это значение по единице за раз до получения хороших результатов, но 4 кажется хорошим значением.\n\n"
    },
    {
      "title": "Бенгальский шрифт отображается некорректно на некоторых страницах",
      "level": 3,
      "content": "В большинстве случаев установка noto-fonts и установка Noto Sans Bengali в качестве по умолчанию в разделе Шрифты настроек решает проблему. Однако в некоторых социальных сетях с бенгальскими шрифтами всё ещё могут быть проблемы. В таких случаях Mozilla предоставляет подробное руководство о том, как увидеть все шрифты, загруженные на странице. С помощью Инспектора найдите все шрифты, которые загружаются на данной странице. Удаление из системы шрифтов, отличных от Noto Sans, навсегда решит проблему.\n\nЕсть некоторые шрифты, которые были установлены в качестве зависимости другого пакета. Например, chromium устанавливает ttf-liberation в качестве зависимости, который автоматически загружается на некоторые страницы Firefox и ломает бенгальские шрифты на этих страницах. Чтобы решить эту проблему, используйте следующее правило в настройках шрифтов:\n\n```\n$XDG_CONFIG_HOME/fontconfig/fonts.conf\n```\n\n```\n<match target=\"pattern\">\n <test qual=\"any\" name=\"family\"><string>Liberation</string></test>\n <edit mode=\"assign\" name=\"family\" binding=\"same\"><string>Noto Sans Bengali</string></edit>\n</match>\n```\n\n"
    },
    {
      "title": "Web Speech API не имеет голосов",
      "level": 3,
      "content": "Для преобразования текста в речь (tts) Firefox использует speechd. Попробуйте команду spd-say \"какой-нибудь текст\" для проверки, читает ли он текст, или spd-say -L, чтобы посмотреть список голосов. Если голоса отсутствуют, вы можете установить их с помощью пакета espeak-ng. Если они не работают из коробки, возможно, нужно их настроить. Вы можете использовать команду spd-conf или отредактировать файл настроек .config/speech-dispatcher/speechd.conf. Там должны быть активны следующие строки (без # перед ними):\n\n```\nAddModule \"espeak-ng\"                \"sd_espeak-ng\" \"espeak-ng.conf\"\nDefaultModule espeak-ng\n```\n\n"
    },
    {
      "title": "Включите синтез речи",
      "level": 4,
      "content": "Согласно https://developer.mozilla.org/ru/docs/Web/API/Web_Speech_API/Using_the_Web_Speech_API, синтез речи должен быть включен (по умолчанию он включен). Для включения установите параметр media.webspeech.synth.enabled в значение true на странице about:config.\n\n"
    },
    {
      "title": "Отключите защиту от фингерпринтинга",
      "level": 4,
      "content": "Согласно https://support.mozilla.org/ru/kb/zashita-firefox-ot-sborshikov-cifrovyh-otpechatkov, защита от сборки цифровых отпечатков (фингерпринтинга) отключает WebSpeech API. Если вы включили эту опцию, нужно отключить её, чтобы прослушивание работало. Для отключения защиты задайте параметру privacy.resistFingerprinting значение false на странице about:config.\n\n"
    },
    {
      "title": "Отключите фильтрацию голосов",
      "level": 4,
      "content": "Если вы не видите значок прослушивания, попробуйте изменить narrate.filter-voices на false на странице about:config.\n\nЭто можно использовать для проверки того, работает speech-dispatcher вообще. Если это поможет, вероятно, вам не хватает голосов для языка статьи, открытой в Виде для чтения (проверьте spd-say -L). Если у вас установлены голоса для языка статьи, возможно, есть какие-то неправильные настройки или значения по умолчанию, связанные с конфигурацией speech-dispatcher.\n\n"
    },
    {
      "title": "При скачивании файла не появляется окно для выбора места сохранения",
      "level": 3,
      "content": "Если при скачивании файлов не отображается окно для выбора места сохранения даже при включенной опции Всегда выдавать запрос на сохранение файлов в настройках Firefox, то, возможно, у вас нет ни xdg-desktop-portal, ни подходящей реализации. Обычно среды рабочего стола предоставляют реализацию, но если вы используете отдельно работающий оконный менеджер, такой как i3, то вам может потребоваться установить его вручную. Установите пакеты xdg-desktop-portal и, например, xdg-desktop-portal-gtk.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальный веб-сайт\n- Mozilla Foundation\n- MozillaWiki:Firefox\n- Wikipedia:ru:Mozilla Firefox\n- Дополнения для Firefox\n- Темы для Firefox\n- FTP Mozilla\n- mozillaZine — неофициальный форум\n\n"
    }
  ]
}