{
  "title": "Firewall/Nat de alto rendimiento con iptables y VLANs e iproute2 (Español)",
  "url": "https://wiki.archlinux.org/title/Firewall/Nat_de_alto_rendimiento_con_iptables_y_VLANs_e_iproute2_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Imaginemos esta situación: tenemos más de dos redes separadas por un protocolo Lan Virtual (IEEE 802.1q) o VLAN, las cuales nos llegan a través de un conmutador inteligente/manejable en una línea troncal 10/100/1000 MB HD/FD (naturalmente lo mejor sería 1000 MB FD).\n\nEsta página nos introduce la forma de crear un Firewall/Nat de alto rendimiento con iptables, VLAN e iproute2. Entonces se podrá compartir Internet con un gran número de equipos y seguir manteniendo un buen rendimiento.\n\n"
    },
    {
      "title": "Soporte de VLAN",
      "level": 2,
      "content": "En primer lugar, crearemos una subred, como se indica en la página VLAN.\n\n"
    },
    {
      "title": "El NAT round robin",
      "level": 3,
      "content": "Supongamos que tenemos una IP 200.AAA.BBB.6 y nuestro gateway es 200.AAA.BBB.1. Sin ningun problema podemos poner estos parámetros por defecto en nuestra configuracion. No va a afectar para nada a nuestro firewall.\n\nPartimos del supuesto de que tenemos 3 grupos de 10 IP publicas cada uno... Con esto, vamos a definir lo siguiente en el comienzo de nuestro script de firewall:\n\n```\nGr1='200.AAA.CCC.10-200.AAA.CCC.20'\nGr2='200.AAA.DDD.10-200.AAA.DDD.20'\nGr3='200.AAA.EEE.10-200.AAA.EEE.20'\n```\n\nY las siguientes líneas importantes son:\n\n```\niptables -t nat -A POSTROUTING -s 192.168.0.0/21  -j SNAT --to $Gr1 #ACCESS VLAN 10\niptables -t nat -A POSTROUTING -s 192.168.8.0/21  -j SNAT --to $Gr2 #ACCESS VLAN 20\niptables -t nat -A POSTROUTING -s 192.168.15.0/21  -j SNAT --to $Gr1 #ACCESS VLAN 30\n.... etc\n```\n\nPodemos repetir los grupos de acceso, subdividir las redes, etc. Iptables hace de forma automática round robin sobre Gr1, Gr2 y Gr3 por defecto, sin que sea necesaria modificación ulterior.\n\nNo es necesario crear tarjetas virtuales (alias) para cada IP en cada grupo.\n\nEs importante que cada router real (router BGP) conozca a cada grupo y lo difunda a través de BGP (o similar) a los router «vecinos».\n\n"
    },
    {
      "title": "Sugerencias",
      "level": 3,
      "content": "Para acelerar algunos puertos podemos poner lo siguiente en la cabeza de nuestra cadena FORWARD:\n\n```\niptables -A FORWARD -m state --state ESTABLISHED,RELATED -j ACCEPT\niptables -A FORWARD -p icmp -o eth0 -j ACCEPT\niptables -A FORWARD -p tcp -m multiport --dports 80,443,110,53 -j ACCEPT  # FAST FAST FAST \niptables -A FORWARD -p udp  --dport 53 -j ACCEPT\n```\n\nEsto significa:\n\n- Los paquetes de tráfico solo pasaran 1 regla si estos son de una conexion establecida.\n- Los paquetes de tráfico solo pasaran 2 reglas si son un PING o similar.\n- Los paquetes solo pasaran 3 reglas si son http, correo o similar.\n- Y por ultimo los paquetes de DNS van a pasar 3 o 4 reglas máximo antes de salir.\n\nLos virus de los clientes pueden matar el trafico de nuestro firewall, y no vamos a necesitar compartir conversaciones con windows, asi que las bloqueamos...\n\n```\n#VIRUS\niptables -A FORWARD -p tcp --dport 135:139 -j DROP\niptables -A FORWARD -p tcp --dport 445 -j DROP\niptables -A FORWARD -p udp --dport 135:139 -j DROP\niptables -A FORWARD -p udp --dport 445 -j DROP\n```\n\n...si se puede, antes de que lleguen a nuestra máquina.\n\n"
    },
    {
      "title": "Alto Rendimiento",
      "level": 2,
      "content": "Llegamos a la parte que realmente importa de este documento.\n\nEn nuestra carrera por obtener un gran número de host pasando a través de nuestra máquina, olvidamos algunas cosas:\n\n1. Que tenemos solo una tarjeta para, potencialmente, más de 8000 direcciones físicas (MAC). ¡La memoria compartida de la tarjeta no está preparada para esto!\n1. Por defecto, iptables tampoco está preparado para trabajar con este gran número de conexiones simultáneas.\n\nAsi que...\n\nPara el primer problema... la solución es esta: aumentar el umbral de memoria para los vecinos.\n\nEscriba esto y lea:\n\n```\n# cat /proc/sys/net/ipv4/neigh/default/gc_thresh1 \n128\n# cat /proc/sys/net/ipv4/neigh/default/gc_thresh2 \n512\n# cat /proc/sys/net/ipv4/neigh/default/gc_thresh3 \n1024\n```\n\nLo siguiente es poner este resultado en /etc/sysctl.d/99-sysctl.conf::\n\n```\nnet.ipv4.neigh.default.gc_thresh1 = 512\nnet.ipv4.neigh.default.gc_thresh2 = 1024\nnet.ipv4.neigh.default.gc_thresh3 = 2048\n```\n\nY ejecutar syscrtl -p para aumentar la memoria al doble (no es necesario reiniciar). ¡Con esto eliminaremos los errores relativos a la tarjeta!\n\nPara la siguiente parte necesitaremos algún conocimiento sobre buckets, conntracks y hashsize (la manera de cómo iptables maneja las conecciones NAT). Existe un buen documento acerca de esto aquí. ¡Léalo! Algunas cosas han cambiado desde que IPtables se conoce ahora como Netfiler.\n\nEn resumen:\n\nEscriba esto en la sección MODULES:\n\n```\nMODULES=(8021q 'nf_conntrack hashsize=1048576' nf_conntrack_ftp \n                               ...y otros nf_stuff ...)\n```\n\nLo último es solo para evitar algunos de los problemas que podríamos tener con conexiones ftp (esto ya no es necesario, pero lo mantenemos por si acaso). La seccion 'nf_conntrack hashsize=1048576' incrementa el numero hashsize (incrementa la memoria del kernel destinada a las conecciones de NAT) (necesita reiniciar o recargar el módulo :-) escriba dmesg | grep conntrack antes y después, para ver los cambios).\n\nLo siguiente es poner algo similar en el archivo /etc/sysctl.d/99-sysctl.conf:\n\n```\n...\nnet.netfilter.nf_conntrack_max = 1048576\n...\n```\n\nY nuevamente ejecutamos la orden sysctl --system.\n\nEn mi caso, es el mismo número, esto significa que tengo una conexion por bucket. No necesito más. Por defecto NetFilter maneja una relación de 1:8, es decir, 8 conexiones por bucket (creo, no recuerdo bien).\n\nEn nuestro caso hemos llegado a tener mas de 600.000 conexiones simultáneas con 2 targetas de 1 GB. Se puede ver este numero con la siguiente orden:\n\n```\n# cat /proc/sys/net/netfilter/nf_conntrack_count\n```\n\nY se puede poner en un agente snmp para poder graficarlo en algún servidor MRTG/cacti.\n\n"
    },
    {
      "title": "Iproute2",
      "level": 2,
      "content": "¡Tenemos 3 grandes accesos a Internet! Esto se debe a que se trata de tres grupos de IP de clase C (relativo a algunas restricciones de BGP). Asi es que tenemos 3 traficos entrantes que podemos manejar, ¡pero solo uno de salida!, nuestro gateway principal. Esto podría fácilmente ocupar nuestro ancho de banda de salida. Asi que hay que separarlo.\n\nPrimero, añadimos algunas tablas en el archivo /etc/iproute2/rt_tables:\n\n```\n# echo 200 PRO_1 >> /etc/iproute2/rt_tables\n# echo 205 PRO_2 >> /etc/iproute2/rt_tables\n# echo 210 PRO_3 >> /etc/iproute2/rt_tables\n```\n\nPuede ser menos, o más, depende del tráfico.\n\nSegundo, debemos dar un gateway por defecto a cada tabla:\n\n```\n# ip route add default via 200.aaa.bbb.2 table PRO_1\n# ip route add default via 200.aaa.bbb.3 table PRO_2\n# ip route add default via 200.aaa.bbb.4 table PRO_3\n```\n\nEs recomendable, pero no necesario (solo para obtener respuestas de pings o cosas similares), poner las redes locales y sus interfaces a cada tabla. Si no ponemos las siguientes líneas no obtendremos respuesta de ping en la red local, pero seguiremos teniendo conexión:\n\n```\n# ip route add 192.168.0.0/21 via 192.168.0.1 table PRO_1\n# ip route add 192.168.8.0/21 via 192.168.8.1 table PRO_1\n# ip route add 192.168.15.0/21 via 192.168.15.1 table PRO_1\n...\nsame PRO_2, same PRO_3\n```\n\nY, la última operación, es darle la orden a los paquetes entrantes:\n\n```\n# ip rule add from 192.168.0.0/21 table PRO_1\n...\n...\n```\n\nUna vez más, podemos jugar con PRO_X, e, incluso, podemos jugar con la máscara y submáscara. Por ejemplo, si solo le queremos dar a una clase C acceso por la tabla PRO_3:\n\n```\n# ip rule add from 192.168.1.0/24 table PRO_3\n```\n\nHay que colocar esto antes de <NET>/21.\n\n"
    }
  ]
}