{
  "title": "Flatpak (Español)",
  "url": "https://wiki.archlinux.org/title/Flatpak_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-03-14** \n\nArtículos relacionados\n\n- Snap\n- bubblewrap\n\nDel README del proyecto: \"Flatpak es un sistema de compilación, distribución y ejecución de aplicaciones de escritorio aisladas en Linux.\"\n\nDe flatpak(1):\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete flatpak.\n\n"
    },
    {
      "title": "Añadir un repositorio",
      "level": 3,
      "content": "Para añadir un repositorio remoto de flatpak haga:\n\n```\n$ flatpak remote-add nombre ubicación\n```\n\nDonde nombre es el nombre para el nuevo remoto y ubicación es la ruta o URL del repositorio.\n\nPor ejemplo para añadir el repositorio Flathub oficial:\n\n```\n$ flatpak remote-add --if-not-exists flathub https://dl.flathub.org/repo/flathub.flatpakrepo\n```\n\n"
    },
    {
      "title": "Eliminar un repositorio",
      "level": 3,
      "content": "Para eliminar un repositorio remoto de flatpak haga:\n\n```\n$ flatpak remote-delete nombre\n```\n\nDonde nombre es el nombre del repositorio remoto a eliminar.\n\n"
    },
    {
      "title": "Listar repositorios",
      "level": 3,
      "content": "Para listar todos los repositorios agregados haga:\n\n```\n$ flatpak remotes\n```\n\n"
    },
    {
      "title": "Búsqueda de un tiempo de ejecución o aplicación remota",
      "level": 3,
      "content": "Antes de poder buscar un tiempo de ejecución o aplicación en un repositorio recién agregado, necesitamos recuparar los datos del flujo de aplicaciones para ello:\n\n```\n$ flatpak update\n```\n\n```\nLooking for updates...\nUpdating appstream data for remote name\n```\n\nAhora podemos proceder a buscar un paquete con flatpak search nombre-del-paquete, e.j. para buscar el paquete libreoffice con el flathub remoto configurado:\n\n```\n$ flatpak search libreoffice\n```\n\n```\nApplication ID              Version Branch Remotes Description                       \norg.libreoffice.LibreOffice         stable flathub The LibreOffice productivity suite\n```\n\n"
    },
    {
      "title": "Listar todos los tiempos de ejecución y aplicaciones disponibles",
      "level": 3,
      "content": "Para listar todas los tiempos de ejecución y aplicaciones en un repositorio remoto llamado remoto haga:\n\n```\n$ flatpak remote-ls remoto\n```\n\n"
    },
    {
      "title": "Instalar un tiempo de ejecución o aplicación",
      "level": 3,
      "content": "Para instalar un tiempo de ejecución o aplicación haga:\n\n```\n$ flatpak install remoto nombre\n```\n\nDonde remoto es el nombre del repositorio remoto, y nombre es el nombre de la aplicación o tiempo de ejecución a instalar.\n\n"
    },
    {
      "title": "Listar los tiempos de ejecución y aplicaciones instaladas",
      "level": 3,
      "content": "Para listar tiempos de ejecución y aplicaciones instaladas haga:\n\n```\n$ flatpak list\n```\n\n"
    },
    {
      "title": "Ejecutar aplicaciones",
      "level": 3,
      "content": "Las aplicaciones flatpak también pueden ser ejecutadas desde la línea de órdenes:\n\n```\n$ flatpak run nombre\n```\n\n"
    },
    {
      "title": "Actualizar un tiempo de ejecución o aplicación",
      "level": 3,
      "content": "Para actualizar un tiempo de ejecución o aplicación llamada nombre haga:\n\n```\n$ flatpak update nombre\n```\n\n"
    },
    {
      "title": "Desinstalar un tiempo de ejecución o aplicación",
      "level": 3,
      "content": "Para desinstalar un tiempo de ejecución o aplicación llamada nombre haga:\n\n```\n$ flatpak uninstall nombre\n```\n\n"
    },
    {
      "title": "Añadiendo archivos .desktop de Flatpak a su menú",
      "level": 3,
      "content": "Flatpak espera que los manejadores de ventana respeten la variable de entorno XDG_DATA_DIRS para descubrir aplicaciones. Esto puede requerir reiniciar la sesión o el lanzador podría no admitirlo. En caso de que puede editar la lista de directorios escaneados, agréguelos a esta:\n\n```\n~/.local/share/flatpak/exports/share/applications\n/var/lib/flatpak/exports/share/applications\n```\n\nEs sabido que ésto es necesario en Awesome.\n\n"
    },
    {
      "title": "Visualizando permisos de aislamiento de aplicación",
      "level": 3,
      "content": "Las aplicaciones Flatpak vienen con reglas de aislamiento predefinidas que definen los recursos y rutas del sistema de archivos que la aplicación tiene permitido acceder. Para ver los permisos específicos de aplicación haga:\n\n```\n$ flatpak info --show-permissions nombre\n```\n\nLa referencia de los nombres de permisos de aislamiento puede encontrase en la documentación oficial flatpak[enlace roto 2024-07-30].\n\n"
    },
    {
      "title": "Anulando permisos de aislamiento de aplicaciones",
      "level": 3,
      "content": "Si encuentra que los permisos predefinidos de la aplicación son demasiado laxos o demasiado restrictivos puede cambiar cualquier cosa que desee usando la órden flatpak override.\n\nPor ejemplo:\n\n```\nflatpak override --nofilesystem=home nombre\n```\n\nÉsto evitará el acceso de la aplicación a su carpeta de inicio.\n\nCada tipo de permiso como dipositivo, sistema de archivo o socket tiene una opción de línea de órden que permite ése permiso en particular y una opción separada que lo niega. Por ejemplo, en caso de acceso a dipositivo --device=device_name permite el acceso, --nodevice=device_name niega el permiso para acceder al dispositivo.\n\nPara todos los comandos de tipos de permisos consulte la página del manual: flatpak-override(1)\n\nLas anulaciones de permisos se pueden restablecer a los valores predeterminados con la órden:\n\n```\n$ flatpak override --reset nombre\n```\n\n"
    },
    {
      "title": "Creación de un tiempo de ejecución base personalizado",
      "level": 2,
      "content": "Puede crear un tiempo de ejecución personalizado basada en Arch y SDK base para Flatpak usando pacman. Así puede utilizarlo para compilar y empaquetar aplicaciones. Esto es una alternativa para uso personal para los tiempos de ejecución por defecto org.freedesktop.BasePlatform y org.freedesktop.BaseSdk.\n\nAdemás de flatpak, necesita tener instalado fakeroot y para el soporte de los enganches de pacman también fakechroot.\n\nPrimero, empiece creando un directorio para compilar el tiempo de ejecución y las posibles aplicaciones.\n\n```\n$ mkdir myflatpakbuilddir\n$ cd myflatpakbuilddir\n```\n\nEnseguida puede preparar un directorio para compilar la plataforma base del tiempo de ejecución. Los subdirectorios del archivo contendrán lo que después será el directorio /usr en el aislamiento de proceso. Por lo tanto tendrá que crear enlaces simbólicos para que las rutas predeterminadas /usr/share etc. puedans ser accesadas desde Arch en la ruta habitual.\n\n```\n$ mkdir -p myruntime/files/var/lib/pacman\n$ touch myruntime/files/.ref\n$ ln -s /usr/usr/share myruntime/files/share\n$ ln -s /usr/usr/include myruntime/files/include\n$ ln -s /usr/usr/local myruntime/files/local\n```\n\nHaga que las fuentes de su OS estén disponibles para el tiempo de ejecución de Arch:\n\n```\n$ mkdir -p myruntime/files/usr/share/fonts\n$ ln -s /run/host/fonts myruntime/files/usr/share/fonts/flatpakhostfonts\n```\n\nNecesita y posiblemente desee adaptar su pacman.conf antes de instalar los paquetes en el tiempo de ejecución. Copie /etc/pacman.conf en su directorio de compilación y después haga los cambios siguientes:\n\n- Elimine la opción CheckSpace de tal modo que pacman no se quejará de los errores al encontrar sistema de archivo raíz para verificar espacio de disco.\n- Elimine cualquier repositorio personalizado no deseado y las configuraciones IgnorePkg, IgnoreGroup, NoUpgrade y NoExtract que son necesarias solo en el sistema host.\n\nAhora instale los paquetes para el tiempo de ejecución:\n\n```\n$ fakechroot fakeroot pacman -Syu --root myruntime/files --dbpath myruntime/files/var/lib/pacman --config pacman.conf base\n$ mv pacman.conf myruntime/files/etc/pacman.conf\n```\n\nConfigure los locales para usarlas editando myruntime/files/etc/locale.gen. Luego regenere los locales de los tiempos de ejecución.\n\n```\n$ fakechroot chroot myruntime/files locale-gen\n```\n\nEl SDK base se puede crear desde el tiempo de ejecución base con aplicaciones adicionales necesarias para crear paquetes y ejecución de pacman.\n\n```\n$ cp -r myruntime mysdk\n$ fakechroot fakeroot pacman -S --root mysdk/files --dbpath mysdk/files/var/lib/pacman --config mysdk/files/etc/pacman.conf base-devel fakeroot fakechroot --needed\n```\n\nInserte metadatos acerca del tiempo de ejecución y SDK.\n\n```\nmyruntime/metadata\n```\n\n```\n[Runtime]\nname=org.mydomain.BasePlatform\nruntime=org.mydomain.BasePlatform/x86_64/2016-06-26\nsdk=org.mydomain.BaseSdk/x86_64/2016-06-26\n```\n\n```\nmysdk/metadata\n```\n\n```\n[Runtime]\nname=org.mydomain.BaseSdk\nruntime=org.mydomain.BasePlatform/x86_64/2016-06-26\nsdk=org.mydomain.BaseSdk/x86_64/2016-06-26\n```\n\nAgregue el tiempo de ejecución base y el SDK al repositorio local en el directorio actual. Probablemete desee darles los mensajes de confirmación adecuados como “Mi tiempo de ejecución base de Arch” and “Mi SDK base de Arch”.\n\n```\n$ ostree init --mode archive-z2 --repo=.\n$ EDITOR=\"nano -w\" ostree commit -b runtime/org.mydomain.BasePlatform/x86_64/2016-06-26 --tree=dir=myruntime\n$ EDITOR=\"nano -w\" ostree commit -b runtime/org.mydomain.BaseSdk/x86_64/2016-06-26 --tree=dir=mysdk\n$ ostree summary -u\n```\n\nInstale el tiempo de ejecución y SDK.\n\n```\n$ flatpak remote-add --user --no-gpg-verify myarchos file://$(pwd)\n$ flatpak install --user myarchos org.mydomain.BasePlatform 2016-06-26\n$ flatpak install --user myarchos org.mydomain.BaseSdk 2016-06-26\n```\n\n"
    },
    {
      "title": "Creación de aplicaciones con pacman",
      "level": 3,
      "content": "Como alternativa para crear aplicaciones de la manera usual, podemo usar pacman para crear una versión en contenedor de los paquetes regulares de Arch. Tenga en cuenta que /usr es de solo lectura al crear apps, por lo que no podemos usar los paquetes de Arch mientras se compila una apliación. Para crear una aplicación real con pacman, podemos\n\n- usar pacman para crear tiempo de ejecución que contenga todas las dependencias\n- y compilar la aplicación nosotros mismos de la manera usual o quizás usando pacman con un PKGBUILD personalizado adaptado a Flatpak quien utiliza --prefix=/app para el script configure,\n\no podemos\n\n- usar pacman para crear un tiempo de ejecución que contenga la aplicación instalada con pacman\n- y crear una aplicación ficticia para lanzarla.\n\nPara hacer lo último, primero cree un tiempo de ejecución usando pacman como ésta para gedit. El tiempo de ejecución primero es inicializado y preparado para usarse con pacman.\n\n```\n$ flatpak build-init -w geditruntime org.mydomain.geditruntime org.mydomain.BaseSdk org.mydomain.BasePlatform 2016-06-26\n$ flatpak build geditruntime sed -i \"s/^#Server/Server/g\" /etc/pacman.d/mirrorlist\n$ flatpak build geditruntime ln -s /usr/var/lib /var/lib\n$ flatpak build geditruntime fakeroot pacman-key --init\n$ flatpak build geditruntime fakeroot pacman-key --populate archlinux\n```\n\nDespués de que el paquete es instalado. La conexión de red del host debe estar disponible para pacman.\n\n```\n$ flatpak build --share=network geditruntime fakechroot fakeroot pacman --root /usr -S gedit\n```\n\nPuede probar la instalación antes de finalizar el tiempo de ejecución (sin un aislamiento apropiado).\n\n```\n$ flatpak build --socket=x11 geditruntime gedit\n```\n\nAhora finalize la creación del tiempo de ejecución y expórtelo al nuevo repositorio local. Las claves GnuPG de pacman tienen permisos que pueden interferir y necesitan ser eliminadas primero.\n\n```\n$ flatpak build geditruntime rm -r /etc/pacman.d/gnupg\n$ flatpak build-finish geditruntime\n$ sed -i \"s/\\[Application\\]/\\[Runtime\\]/;s/runtime=org.mydomain.BasePlatform/runtime=org.mydomain.geditruntime/\" geditruntime/metadata\n$ flatpak build-export -r geditrepo geditruntime\n```\n\nLuego cree una aplicación ficticia.\n\n```\n$ flatpak build-init geditapp org.gnome.gedit org.mydomain.BaseSdk org.mydomain.geditruntime\n```\n\nAhora termine la aplicación ficticia. Puede afinar los permisos de acceso de la aplicación cuando se aisle dando opciones adicionales al finalizar la compilación. Para posibles opciones véase documentation de Flatpak y los Archivos de manifiesto de GNOME.\n\n```\n$ flatpak build-finish geditapp --socket=x11 [possibly other options] --command=gedit\n$ flatpak build-export geditrepo geditapp\n```\n\nInstálela junto con el tiempo de ejecución.\n\n```\n$ flatpak --user remote-add --no-gpg-verify geditrepo geditrepo\n$ flatpak install --user geditrepo org.mydomain.geditruntime\n$ flatpak install --user geditrepo org.gnome.gedit\n$ flatpak run org.gnome.gedit\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Sitio oficial\n- Wiki oficial de Github\n- Página de Wikipedia\n- Aplicaciones Aisladas de Gnome\n- Tiempos de ejecución y Aplicaciones de Prueba de KDE\n\n"
    }
  ]
}