{
  "title": "Fluxbox (Français)",
  "url": "https://wiki.archlinux.org/title/Fluxbox_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Window manager (Français)\n\nFluxbox est un gestionnaire de fenêtres pour X11. Il est basé sur le code (maintenant abandonné) de Blackbox 0.61.1, mais avec des améliorations significatives et un développement continu. Fluxbox fournit un certain nombre de fonctionnalités de gestion de fenêtres telles que des onglets ou le regroupement et dispose de centaines de styles (thèmes). Toute la configuration de Fluxbox est stockée dans des fichiers en texte simple, cependant certains paramètres sont exposés graphiquement dans le menu de configuration.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet fluxbox.\n\n"
    },
    {
      "title": "Démarrage",
      "level": 2,
      "content": "Lancez startfluxbox avec xinit.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Les fichiers de configuration de Fluxbox pour l'ensemble du système se trouvent dans /usr/share/fluxbox tandis que les fichiers de configuration des utilisateurs se trouvent dans ~/.fluxbox :\n\n- init - le fichier de configuration principal des ressources Fluxbox. Consultez Editing the init file[dead link 2023-04-23 ⓘ].\n- menu - la configuration du menu de Fluxbox. Consultez ci-dessous et Editing the menu file[dead link 2023-04-23 ⓘ].\n- keys - le fichier de raccourcis clavier (hotkeys) de Fluxbox. Consultez ci-dessous et Keyboard shortcuts[dead link 2023-04-23 ⓘ].\n- startup - l'endroit où lancer les applications de démarrage mais consultez ci-dessous pour .xinitrc et aussi Editing the startup file[dead link 2023-04-23 ⓘ].\n- overlay - un fichier de configuration pour remplacer les éléments des styles. Consultez Style overlay[dead link 2023-04-23 ⓘ].\n- apps - un fichier de configuration pour se souvenir de la configuration des fenêtres de certaines applications. Consultez Editing the apps file[dead link 2023-04-23 ⓘ].\n- windowmenu - un fichier de configuration pour modifier le menu de la fenêtre lui-même : Voir Editing the windowmenu[dead link 2023-04-23 ⓘ].\n\n"
    },
    {
      "title": "Menus",
      "level": 3,
      "content": "Le menu racine de Fluxbox est défini dans ~/.fluxbox/menu et il est accessible par un clic droit sur le bureau. Comme avec d'autres gestionnaires de fenêtres légers, Fluxbox ne met pas automatiquement à jour son menu lorsque vous installez de nouvelles applications. Par conséquent, le menu devra être régénéré lorsque de nouvelles applications sont installées/désinstallées.\n\nLa syntaxe de base pour faire apparaître un élément de menu est la suivante :\n\n```\n[exec] (nom) {commande} <chemin vers l'icône>\n```\n\n...où \"nom\" est le texte que vous souhaitez voir apparaître pour cet élément de menu et \"commande\" est l'emplacement du binaire, par ex :\n\n```\n[exec] (Navigateur Firefox) {/usr/bin/firefox} <chemin vers l'icône de Firefox>\n```\n\nNotez que le \"<chemin vers l'icône>\" est facultatif. Si vous voulez créer un sous-menu, la syntaxe est la suivante :\n\n```\n[submenu] (Nom)\n...\n...\n[end]\n```\n\nLorsque vous avez terminé l'édition, enregistrez le fichier et quittez. Il n'est pas nécessaire de redémarrer Fluxbox. Pour plus d'informations, lisez modifier le menu de Fluxbox[dead link 2023-04-23 ⓘ].\n\n"
    },
    {
      "title": "Génération automatique de menu",
      "level": 4,
      "content": "Certains programmes peuvent générer soit un menu racine Fluxbox complet, soit un sous-menu d'applications installées qui peut être inclus manuellement dans une définition de menu racine existante. Ces programmes sont décrits ci-dessous.\n\nIl existe une commande intégrée fournie avec Fluxbox :\n\n```\n$ fluxbox-generate_menu\n```\n\nCette commande génère automatiquement un fichier ~/.fluxbox/menu basé sur vos programmes installés. Cependant, le menu qu'elle génère ne sera pas aussi complet que celui généré par MenuMaker.\n\nMenuMaker est un outil puissant qui crée des menus basés sur XML pour une variété de gestionnaires de fenêtres, y compris Fluxbox. MenuMaker recherchera les programmes exécutables sur votre ordinateur et créera un menu basé sur les résultats. Il peut être configuré pour exclure les applications historiques sous X, GNOME, KDE ou Xfce si vous le souhaitez.\n\nInstallez menumaker, puis vous pouvez générer un menu complet et écraser celui par défaut en exécutant :\n\n```\n$ mmaker -f FluxBox\n```\n\nVous pouvez éviter de remplir votre menu avec des applications basées sur le terminal telles que alsamixer en ajoutant les commutateurs suivants avec la commande mmaker : --no-legacy et --no-debian. Par exemple :\n\n```\n$ mmaker -f --no-legacy --no-debian FluxBox\n```\n\nPour consulter d'autres options de MenuMaker :\n\n```\n$ mmaker --help\n```\n\nVous pouvez également générer un menu en utilisant Xdg-menu. Consultez la section Xdg-menu#FluxBox.\n\n"
    },
    {
      "title": "Autres menus",
      "level": 4,
      "content": "En plus du menu racine, Fluxbox fournit également les menus suivants :\n\n- Menu Espaces de travail : clic moyen sur le bureau.\n- Menu Configuration : situé dans la section \"Fluxbox\" du menu \"Root\".\n- Menu fenêtre : clic droit sur la barre de titre de n'importe quelle fenêtre, ou sur sa barre si elle est réduite. Peut être modifié. Consultez la page de manuel Fluxbox-menu.\n- Menu de la barre d'outils : clic droit sur une partie vide de la barre d'outils. On le trouve également sous forme de sous-menu dans le menu de configuration.\n- Menu des fentes : se trouve comme un sous-menu dans le menu de configuration.\n\n"
    },
    {
      "title": "Raccourcis clavier",
      "level": 4,
      "content": "Le fichier de raccourcis de Fluxbox se trouve à ~/.fluxbox/keys. La touche Contrôle est représentée par Control. Mod1 correspond à la touche Alt et Mod4 correspond à Super (ce n'est pas une touche standard mais la plupart des utilisateurs font correspondre Super à la touche Win).\n\n"
    },
    {
      "title": "Définir la disposition du clavier avec Fluxbox",
      "level": 4,
      "content": "Il suffit d'ajouter la ligne suivante à ~/.fluxbox/startup :\n\n```\nsetxkbmap us -variant intl & # pour avoir un clavier us avec des caractères spéciaux activés (comme éóíáú)\n```\n\nAu lieu de 'us', vous pouvez également passer votre code de langue et supprimer l'option de variante (ex. : 'us_intl', qui fonctionne comme la commande ci-dessus dans certaines configurations). Consultez setxkbmap(1) pour plus d'options.\n\nPour intégrer une fonction d'aide dans votre menu, ajoutez simplement dans ~/.fluxbox/menu :\n\n```\n[submenu] (Keyboard)\n      [exec] (normal) {setxkbmap us}\n      [exec] (international) {setxkbmap us -variant intl}\n[end]\n```\n\n"
    },
    {
      "title": "Gestionnaire de presse-papiers pour Fluxbox",
      "level": 4,
      "content": "Vous pouvez utiliser n'importe quel gestionnaire de presse-papiers avec Fluxbox. Le paquet parcellite fonctionne très bien avec Fluxbox. Installez simplement parcellite et ajoutez les commandes pour démarrer parcellite au démarrage de Fluxbox en ajoutant ce qui suit dans ~/.fluxbox/startup avant l'appel à exec fluxbox :\n\n```\n## gestionnaire de presse-papiers\nclipmgr=$(type -p parcellite)\n[ -x \"$clipmgr\" ] && \"$clipmgr\" &\n```\n\n"
    },
    {
      "title": "Espaces de travail",
      "level": 3,
      "content": "Fluxbox dispose par défaut de quatre espaces de travail. Ceux-ci sont accessibles en utilisant les raccourcis Ctrl+F1-F4, ou en utilisant le bouton gauche de la souris pour cliquer sur les flèches de la barre d'outils. Vous pouvez également accéder aux espaces de travail en cliquant avec le bouton central de la souris sur le bureau, ce qui fait apparaître le menu des espaces de travail.\n\n"
    },
    {
      "title": "Tabulation et regroupement",
      "level": 3,
      "content": "Avec au moins deux fenêtres visibles sur votre bureau, utilisez Ctrl+clic gauche sur l'onglet supérieur d'une fenêtre et faites-le glisser dans l'autre fenêtre ouverte. Les deux fenêtres seront maintenant regroupées avec des onglets de fenêtre dans la barre d'onglets supérieure de la fenêtre. Vous pouvez maintenant effectuer une opération sur la fenêtre qui affectera l'ensemble du \"groupe\" de fenêtres. Pour inverser le regroupement, utilisez Ctrl+clic gauche sur un onglet et faites-le glisser vers un espace vide sur le bureau.\n\n"
    },
    {
      "title": "Démarrage automatique",
      "level": 3,
      "content": "Fluxbox fournit une fonctionnalité de démarrage automatique des applications. Le fichier ~/.fluxbox/startup est un script pour le démarrage automatique des applications ainsi que pour le démarrage de Fluxbox lui-même. Le symbole # indique un commentaire. Assurez-vous que toutes les lignes démarrant des applications viennent avant l'appel pour démarrer Fluxbox lui-même. Sinon, ces lignes ne seront pas atteintes avant la fin de Fluxbox lui-même.\n\n"
    },
    {
      "title": "Fond d'écran",
      "level": 3,
      "content": "Fluxbox fournit un script enveloppant fbsetbg qui peut aider à définir le fond d'écran. Veuillez vous référer au Fluxbox wiki[dead link 2023-04-23 ⓘ] pour plus de détails. Alternativement, vous pouvez utiliser un configurateur de fond d'écran tel que feh ou Nitrogen indépendamment si vous le souhaitez. Consultez ci-dessous.\n\n"
    },
    {
      "title": "Échanger plusieurs fonds d'écran facilement",
      "level": 4,
      "content": "Placez le sous-menu suivant dans votre menu Fluxbox :\n\n```\n[submenu] (Backgrounds)\n[wallpapers] (~/.fluxbox/backgrounds) {feh --bg-scale}\n[wallpapers] (/usr/share/fluxbox/backgrounds) {feh --bg-scale}\n[end]\n```\n\nPlacez ensuite vos images d'arrière-plan dans ~/.fluxbox/backgrounds ou tout autre répertoire que vous spécifiez, elles apparaîtront alors de la même manière que vos styles.\n\nIl en va de même pour un fond d'écran double sur un système sans 'xinerama' (NVidia TwinView par exemple) :\n\n```\n[submenu] (Backgrounds)\n[wallpapers] (/path/to/your/backgrounds) {feh --bg-scale --no-xinerama }\n[end]\n```\n\n"
    },
    {
      "title": "Utilisation de feh avec Fluxbox",
      "level": 4,
      "content": "Installez feh.\n\nPour être sûr que Fluxbox chargera le fond d'écran feh la prochaine fois, démarrez :\n\n1. Rendez .fehbg exécutable\n\n2. Puis ajoutez (ou modifiez) la ligne suivante au fichier ~/.fluxbox/init :\n\n```\nsession.screen0.rootCommand :\t~/.fehbg\n```\n\n3. ou ajoutez (ou modifiez) la ligne suivante au fichier ~/.fluxbox/startup :\n\n```\n~/.fehbg\n```\n\n"
    },
    {
      "title": "Thèmes",
      "level": 3,
      "content": "Pour installer un thème Fluxbox, extrayez le fichier d'archive du thème dans un répertoire de styles. Les répertoires par défaut sont :\n\n- Global - /usr/share/fluxbox/styles\n- Utilisateur seulement - ~/.fluxbox/styles\n\nLe paquet fluxmod-stylesAUR contient un certain nombre de styles Fluxbox provenant du site (aujourd'hui disparu) fluxmod.dk.\n\nPour créer vos propres styles Fluxbox, veuillez vous référer à fluxbox-style(5)[dead link 2025-01-19 ⓘ], Fluxbox/Style guide et tenr.de Fluxbox style guide[dead link 2023-07-30 ⓘ].\n\nSi vous utilisez mmaker -f FluxBox pour créer vos menus, vous ne consulterez pas la sélection du menu des styles après avoir installé les styles. Pour corriger cela, ajoutez ce qui suit à ~/.fluxbox/menu après l'élément de menu restart :\n\n```\n[submenu] (Styles du système) {Choisir un style...}\n                     [stylesdir] (/usr/share/fluxbox/styles)\n                       [end]\n               [submenu] (Styles de l'utilisateur) {Choisissez un style...}\n                     [stylesdir] (~/.fluxbox/styles)\n                       [fin]\n```\n\n"
    },
    {
      "title": "La fente",
      "level": 3,
      "content": "Certains gestionnaires de fenêtres, tels que Fluxbox, Window Maker et Openbox, ont une \"fente\". Il s'agit d'un dock pour toute application qui peut être \"dockable\". Une application placée dans le «dock» est ancrée et apparaît sur chaque espace de travail. Elle ne peut pas être déplacée librement et n'est pas influencée par une quelconque manipulation des fenêtres. Il s'agit essentiellement d'un petit widget. Les applications ancrées qui sont utiles dans une telle situation sont généralement des horloges, des moniteurs système, des applications météorologiques, etc… Consultez dockapps.net pour voir quelles applications de dock sont disponibles.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Fluxbox sur Github\n- wiki Fluxbox\n- Gentoo:Fluxbox\n- Themes for Fluxbox\n- Page de manuel de Fluxbox fluxbox(1). (ainsi que des pages de manuel de Fluxbox connexes, telles que fluxbox-keys)\n- Narada's Fluxbox Guide (en anglais)\n- Captures d'écran de Fluxbox pour Arch Linux\n\n"
    }
  ]
}