{
  "title": "Fonts (Українська)",
  "url": "https://wiki.archlinux.org/title/Fonts_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Цю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.** Цю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.\n\nЦю стаття чи розділ ще не перекладено. Дивіться також Команда перекладу ArchWiki українською.\n\nПовʼязані статті\n\n- Font configuration\n- List of applications/Utilities#Font viewers\n- Java Runtime Environment fonts\n- Linux console#Fonts\n- Java Runtime Environment fonts\n- Metric-compatible fonts\n- Microsoft fonts\n\nЗ Вікіпедії: Комп'ю́терні шрифти́ — це сукупність графічних символів, що зберігаються в пам'яті комп'ютера у вигляді растрових точок чи векторних зображень.\n\nМайте на увазі, що деякі шрифти можуть бути захищені авторським прввом, а їх використання — обмеженим законом.\n\n"
    },
    {
      "title": "Види шрифтів",
      "level": 2,
      "content": "Зараз, більшість комп'ютерних шрифтів це або растрові, або векторні шрифти.\n\n"
    },
    {
      "title": "Формати файлів растрових шрифтів",
      "level": 3,
      "content": "- Bitmap Distribution Format (BDF) від Adobe\n- Portable Compiled Format (PCF) від Xorg\n- PC Screen Font (PSF) використовується ядром в консолі, Xorg не підтримує цей формат (Unicode PSF шрифти мають розширення psfu)\n- OpenType bitmap fonts (OTB), [1]\n\nThese formats can also be gzipped. See #Растрові for the available bitmap fonts.\n\n"
    },
    {
      "title": "Формати файлів растрових шрифтів",
      "level": 3,
      "content": "- PostScript fonts від Adobe: буває в різних варіянтах, як от Printer Font ASCII (PFA) або Printer Font Binary (PFB)\n- TrueType від Apple та Microsoft (розширення: ttf)\n- OpenType від Microsoft, створений на основі TrueType (розширення: otf, ttf)\n\nВ більшості випадків різницею між TrueType та OpenType можна знехтувати.\n\n"
    },
    {
      "title": "Інші формати",
      "level": 3,
      "content": "Так повелося, що TeX та його супутня програма Metafont, вакористовують власний спосіб відображення тексту. Серед ферматів, які використовують ці дві програми є: *pk, *gf, mf та vf. Сучасні версії можуть працювати й з TrueType та OpenType.\n\nFontForge (fontforge) — це програма для створення шрифтів. Вона може зберігати їх у своєму внутрішньому форматі — sfd, spline font database.\n\nSVG зображення мають спеціальний формат опису шрифтів.\n\n"
    },
    {
      "title": "Встановлення",
      "level": 2,
      "content": "There are various methods for installing fonts. Встановлювати шрифти можна різними способами.\n\n"
    },
    {
      "title": "Pacman",
      "level": 3,
      "content": "Через pacman можна встановлювати як шрифти, так і цілі шрифтові набори.\n\nЗнайти наявні шрифти можна якщо надіслати запит до бази даних (шукати слова font або ttf).\n\n"
    },
    {
      "title": "Створення пакунків",
      "level": 3,
      "content": "Ви можете керувати шрифтами за допомогою pacman. Для цього потрібно створити пакунок Arch Linux. Потім ним можна поділитися із загалом в AUR. Щоби дізнатися, як правильно оформити пакунок зі шрифтами, прочитайте поради щодо створення пакунків шрифтів..\n\nДізнатися назву сімейства шрифту, можна за допомогою команди fc-query. Наприклад: fc-query -f '%{family[0]}\\n' /шлях/до/файлу. Інструкцію до її використання можна почитати в FcPatternFormat(3).\n\n"
    },
    {
      "title": "Встановлення вручну",
      "level": 3,
      "content": "Найкращий спосіб керування сторонніми шрифтами описаний в розділі #Створення пакунків. Таким чином ви матимете змогу прибирати чи оновлювати їх через pacman.\n\nАбо ж, ви можете встановлювати шрифти власноруч:\n\n- Щоби встановити лише для себе, помістіть їх у теку ~/.local/share/fonts/. Здебільшого, цього буде достатньо. Хіба що ви будете запускати графічні програми від імені інших користувачів. Раніше використовувалась тека ~/.fonts/ — більше ні.\n- Щоб установити шрифт для всіх користувачів, помістіть його у теку /usr/local/share/fonts/. Якщо теки немає, створіть її; mkdir -p /usr/local/share/fonts. У теці /usr/share/fonts/ знаходяться шрифти, встановлені через pacman. Краще туди не лізти.\n\n- Здебільшого, цього буде достатньо. Хіба що ви будете запускати графічні програми від імені інших користувачів.\n- Раніше використовувалась тека ~/.fonts/ — більше ні.\n\n- Якщо теки немає, створіть її; mkdir -p /usr/local/share/fonts.\n- У теці /usr/share/fonts/ знаходяться шрифти, встановлені через pacman. Краще туди не лізти.\n\nВи можете впорядковувати теку так, як вам заманеться. Наприклад, можна тримати кожен шрифт в окремій теці. Теки зі шрифтами переглядаються рекурсивно, тому вкладені файли не будуть пропущені.\n\nОсь приклад того, як можна впорядкувати теку зі шрифтами:\n\n```\n/usr/local/share/fonts/\n├── otf\n│   └── SourceCodeVariable\n│       ├── SourceCodeVariable-Italic.otf\n│       └── SourceCodeVariable-Roman.otf\n└── ttf\n    ├── AnonymousPro\n    │   ├── Anonymous-Pro-B.ttf\n    │   ├── Anonymous-Pro-I.ttf\n    │   └── Anonymous-Pro.ttf\n    └── CascadiaCode\n        ├── CascadiaCode-Bold.ttf\n        ├── CascadiaCode-Light.ttf\n        └── CascadiaCode-Regular.ttf\n```\n\nТакож, необхідно, щоб усі користувачі мали доступ до читання цих файлів. Файли повинні мати принаймні chmod 444 а теки — 555.\n\nЯкщо ви хочете, щоб Xserver завантажував шрифти напряму (а не з допомогою font server), новостворені теки зі шрифтами потрібно додати до списку FontPath. Цей список знаходиться у розділі Files вашого файлу налаштувань Xorg (/etc/X11/xorg.conf або /etc/xorg.conf). Дізнайтеся більше в розділі #Застарілі програми.\n\nЗрештою, потрібно оновити кеш fontconfig-у (зазвичай цього робити не потрібно адже програми, що використовують бібліотеку fontconfig роблять це самі):\n\n```\n$ fc-cache\n```\n\n"
    },
    {
      "title": "Застарілі програми",
      "level": 3,
      "content": "Якщо ваша програма не використовує fontconfig (як от програми GTK 1.x та xfontsel), то вам потрібно створити покажчик тек зі шрифтами:\n\n```\n$ mkfontscale\n$ mkfontdir\n```\n\nЩоби включити до списку більше однієї теки водночас:\n\n```\n$ for dir in /тека/перша/ /тека/друга/; do xset +fp $dir; done && xset fp rehash\n```\n\nЯкщо ж шрифти були встановлені в інші теки всередині, наприклад, /usr/share/fonts, то:\n\n```\n$ for dir in * ; do if [  -d  \"$dir\"  ]; then cd \"$dir\";xset +fp \"$PWD\" ;mkfontscale; mkfontdir;cd .. ;fi; done && xset fp rehash\n```\n\nЯкщо, раптом, X сервер не зміг завантажити всіх шрифтів, то вам потрібно пересканувати всі файли з fonts.dir:\n\n```\n# xset +fp /usr/share/fonts/misc # Повідомити серверу X про нові теки\n# xset fp rehash                # Перепросканувати їх\n```\n\nЩоб перевірити, чи певний шрифт був включений до списку:\n\n```\n$ xlsfonts | grep назва-шрифту\n```\n\nВсе це можна зробити на загально-системному рівні у файлах /etc/X11/xorg.conf або /etc/X11/xorg.conf.d.\n\nНижче наведений приклад розділу з файлу /etc/X11/xorg.conf. Можете скласти власний список шляхів.\n\n```\n# Цим, ви повідомите X.Org про теки зі шрифтами\nSection \"Files\"\n    FontPath    \"/usr/share/fonts/100dpi\"\n    FontPath    \"/usr/share/fonts/75dpi\"\n    FontPath    \"/usr/share/fonts/cantarell\"\n    FontPath    \"/usr/share/fonts/cyrillic\"\n    FontPath    \"/usr/share/fonts/encodings\"\n    FontPath    \"/usr/share/fonts/misc\"\n    FontPath    \"/usr/share/fonts/truetype\"\n    FontPath    \"/usr/share/fonts/TTF\"\n    FontPath    \"/usr/share/fonts/util\"\nEndSection\n```\n\n"
    },
    {
      "title": "Попередження від Pango",
      "level": 3,
      "content": "Якщо ваша системи використовує Pango то вона спробує читати з fontconfig щоб зрозуміти, звідки брати файли шрифтів.\n\n```\n(process:5741): Pango-WARNING **: failed to choose a font, expect ugly output. engine-type='PangoRenderFc', script='common'\n(process:5741): Pango-WARNING **: failed to choose a font, expect ugly output. engine-type='PangoRenderFc', script='latin'\n```\n\nЯкщо ви отримали схожу помилку та/або бачите прямокутнички замість символів у програмах то значить, вам потрібно оновити кеш шрифтів. У наведеному прикладі використовується шрифт ttf-liberation, для наочності. Його потрібно установити як пакунок та запустити команду як root:\n\n```\n# fc-cache\n```\n\n```\n/usr/share/fonts: caching, new cache contents: 0 fonts, 3 dirs\n/usr/share/fonts/TTF: caching, new cache contents: 16 fonts, 0 dirs\n/usr/share/fonts/encodings: caching, new cache contents: 0 fonts, 1 dirs\n/usr/share/fonts/encodings/large: caching, new cache contents: 0 fonts, 0 dirs\n/usr/share/fonts/util: caching, new cache contents: 0 fonts, 0 dirs\n/var/cache/fontconfig: cleaning cache directory\nfc-cache: succeeded\n```\n\nЩоб перевірити, чи шрифт встановлений:\n\n```\n$ fc-match\n```\n\n```\nLiberationMono-Regular.ttf: \"Liberation Mono\" \"Regular\"\n```\n\n"
    },
    {
      "title": "Пакунки шрифтів",
      "level": 2,
      "content": "У цьому списку наведені пакунки як із офіційних сховищ, так і з AUR. Шрифти, які підтримують Unicode мають позначку „Unicode“.\n\n"
    },
    {
      "title": "Растрові",
      "level": 3,
      "content": "- Стандартний 8×16\n- Berry (pcf-spectrum-berryAUR) – 8px\n- Dina (dina-fontAUR) – 6pt, 8pt, 9pt, 10pt, моноширинний, створений на основі Proggy\n- Efont (efont-unicode-bdfAUR) – 10px, 12px, 14px, 16px, 24px, є в нормальному, жирному та курсивному варіянтах\n- Gohu (gohufontAUR) – 11px, 14px, нормальний та жирний\n- Kissinger 2 – 8×16, 16×16 (конкурент Unifont)\n- Lime (artwiz-fontsAUR)\n- ProFont (ttf-profont-iixAUR) – 10px, 11px, 12px, 15px, 17px, 22px, 29px, лише нормальний\n- Proggy (proggyfontsAUR) – має різні варіянти\n- Tamsyn (tamsyn-fontAUR)\n- Tewi (bdf-tewi-gitAUR)\n- Unifont – 8×16, 16×16 (має найбільше покриття Unicode-у серед усіх шрифтів) (bdf-unifontAUR)\n\nТі, що працюють з Pango 1.44 і новішими версіями:\n\n- ProFont (profont-otbAUR) – OpenType Bitmap (OTB) варіянт шрифту ProFont\n- Misc Fixed xorg-fonts-misc-otbAUR\n- Gohufont (gohufont-otbAUR)\n- Cozette (cozette-otbAUR)\n- Terminus (terminus-font)\n- Більше OTB шрифтів є на AUR\n\n"
    },
    {
      "title": "Набори шрифтів",
      "level": 4,
      "content": "Пакунки, із базовим набором шрифтів:\n\n- Bitstream Vera (ttf-bitstream-vera) – містить моноширинні шрифти а також шрифти з та без зарубок. Шрифт Bitstream Vera Sans може заміняти Verdana.\n- Croscore fonts (ttf-croscore) – шрифти-замінники для Helvetica, Times, Courier, і Georgia – Arimo, Tinos, Cousine i Gelasio. Використовуються в Chrome OS\n- DejaVu fonts (ttf-dejavu) – Bitstream Vera зі збільшеним покриттям Unicode\n- Droid (ttf-droid) – стандартний шрифт у старих версіях Android. Містить багато символів Unicode. В тому числі азійські ієрогліфи. Проте не містить емоджі та графічні символи\n- GNU FreeFont (gnu-free-fonts) – містить моноширинні шрифти а також шрифти з та без зарубок. більшість символів латинки знаходяться в шрифтах URW Ghostscript (серед них: Nimbus Roman, Nimbus Sans), має непогане покриття Unicode але без азійських ієрогліфів\n- IBM Plex (ttf-ibm-plex) – з засічками, без засічок, стиснуті, та моноширинні із курсивом\n- Input (ttf-input) – шрифти для коду від DJR & Font Bureau\n- Liberation fonts (ttf-liberation) – шрифти-замінники для Helvetica, Times, і Courier\n- Linux Libertine (ttf-linux-libertine) – шрифти з засічками (Libertine) та без них (Biolinum) що мають велике покриття Unicode\n- Libertinus Fonts (otf-libertinus) – форки Linux Libertine та Linux Biolinum із розширеною підтримкою математики. Див. #Math.\n- Microsoft fonts (ttf-ms-win11AUR) – шрифти з Windows 11 (потрібен інсталятор Windows 11)\n- Noto fonts (noto-fonts) – шрифти від Google з повним покриттям Unicode. (Якщо встановити ще й окремі залежні пакунки з емоджі та азійськими ієрогліфами)\n\nПакунки без базового набору:\n\n- B612[мертве посилання 2025-04-05 ⓘ] (ttf-b612AUR) – сімейство вільних шрифтів (без засічок та моноширинних) від Airbus, створені для зручності читання на авіаційних панелях\n- Ghostscript (gsfonts) – The Ghostscript fonts donated by URW, includes clones of Helvetica, Times, Courier, and others. GNU FreeFont (gnu-free-fonts) and TeX Gyre fonts (tex-gyre-fonts) are both partially based on the Ghostscript fonts\n- Luxi fonts (font-bh-ttfAUR) – шрифт для X.Org. Схожі на Lucida\n- Roboto (ttf-roboto) – стандартний шрифт у новіших версіях Android\n- TeX Gyre fonts (tex-gyre-fonts) – шрифти-замінники для Helvetica, Times, і Courier від польської асоціації GUST користувачів TeX. Вони також мають власні шрифти для математичних формул. Див. #Math.\n- Ubuntu font family (ttf-ubuntu-font-family)\n\nСтарі пакунки зі шрифтами від Microsoft:\n\n- Microsoft fonts (ttf-ms-fontsAUR) – Andalé Mono, Courier New, Arial, Arial Black, Comic Sans, Impact, Lucida Sans, Microsoft Sans Serif, Trebuchet, Verdana, Georgia, Times New Roman\n- Vista fonts (ttf-vista-fontsAUR) – Consolas, Calibri, Candara, Corbel, Cambria, Constantia\n\n"
    },
    {
      "title": "Моноширинні",
      "level": 4,
      "content": "Шрифти з лігатурами для програмування позначені символом ⟶ . Інші моноширинні шрифти можна знайти в розділах #Растрові і #Набори шрифтів.\n\n- Anonymous Pro (ttf-anonymous-pro, є в пакунку ttf-google-fonts-gitAUR)\n- Cascadia Code (ttf-cascadia-code) ⟶ – створений спеціально для Windows Terminal. Microsoft випустили шрифт під ліцензією Open Font License.\n- Courier Prime (ttf-courier-primeAUR) – шрифт-замінник Courier. Має вільну ліцензію\n- Envy Code R (ttf-envy-code-rAUR) – шрифт для програмістів\n- Fantasque Sans Mono (ttf-fantasque-sans-mono, otf-fantasque-sans-mono)\n- Fira Mono (ttf-fira-mono, otf-fira-mono) – шрифт для маленьких екранів. Розроблений Mozilla для Firefox OS\n- Fira Code (ttf-fira-code) ⟶ – Fira Mono але з лігатурами\n- Hack (ttf-hack) - вільний моноширинний шрифт. Це шрифт за замовчуванням в KDE Plasma\n- Hasklig (otf-haskligAUR) - шрифт для коду, з лігатурами\n- Hermit (otf-hermit) - від програміста для програмістів\n- Inconsolata (ttf-inconsolata, з пакунку ttf-google-fonts-gitAUR) – шрифт для програмного коду. Творці надихались Consolas та Letter Gothic\n- Inconsolata-g (ttf-inconsolata-gAUR) – змінений для комфорту кодерів\n- Iosevka (ttc-iosevka) ⟶ – легкий шрифт з- та без засічок розроблений на основі Pragmata Pro, M+ і PF DIN Mono. Його основне призначення — відображення програмного коду. Шрифт підтримує лігатури та понад 2000 латинських, грецьких, кириличних та псевдографічних символів\n- JetBrains Mono (ttf-jetbrains-mono) ⟶ – вільний шрифт від JetBrains\n- Lilex (ttf-lilexAUR) ⟶ – Free and open-source modern programming font containing a set of ligatures for common programming multi-character combinations\n- Lucida Typewriter (included in package jreAUR)\n- Menlo (ttf-mesloAUR) – покращена версія шрифту Menlo Regular, розробленого Apple для OS X, зі збільшеним проміжком між рядками\n- Monaco (ttf-monacoAUR) – пропрієтарний шрифт, розроблений Apple для OS X\n- Monofur (ttf-monofur)\n- Mononoki (ttf-mononokiAUR) – шрифт для програмування\n- Roboto Mono (ttf-roboto-mono) – Based on Roboto (ttf-roboto)\n- Source Code Pro (adobe-source-code-pro-fonts, міститься в ttf-google-fonts-gitAUR)\n- Comic Mono (ttf-comic-mono-gitAUR) A legible monospace font… the very typeface you’ve been trained to recognize since childhood, ergo Comic Sans\n\nКорисні сайти:\n\n- список шрифтів Тревора Ловінґа\n- Slant: Який шрифт найкращий для програмування?\n- Stack Overflow: рекомендовані шрифти для програмістів\n- програмні шрифти - перевірка\n- порівняння шрифтів для програмування\n- шрифт від Typogram\n\n"
    },
    {
      "title": "Sans-serif",
      "level": 4,
      "content": "- Andika (ttf-andikaAUR)\n- Cantarell (cantarell-fonts) – Default font supplied with GNOME, it is required by the GNOME and GTK 3 related packages\n- DMCA Sans Serif (ttf-dmcasansserifAUR) – General purpose sans serif font metric-compatible with Microsoft Consolas\n- Fira Sans (ttf-fira-sans, otf-fira-sans) – Sans serif font designed by Erik Spiekermann for Mozilla and the Firefox OS. Fira Mono and Fira Code are monospaced companions of Fira Sans (see #Моноширинні).\n- FreeSans (gnu-free-fonts) – Visually similar to Helvetica but metrically different, see #Набори шрифтів\n- Inter (inter-font) – A geometric neo-grotesque font designed for user interfaces\n- Jost* (otf-jostAUR) – An open-source typeface based on Futura\n- Liberation Sans (ttf-liberation) – Metric-compatible with Helvetica but visually distinct, see #Набори шрифтів\n- Montserrat (otf-montserrat) – An open source font that shares similarities with Gotham and Proxima Nova\n- Nunito (ttf-nunito) – An open source font with rounded terminal, hence shares similarities with Gotham Rounded and Proxima Soft\n- Open Sans (ttf-opensans) – Sans serif font commissioned by Google, based on Droid sans but slightly wider\n- PT Sans (ttf-google-fonts-gitAUR) – 3 major variations: normal, narrow, and caption - Unicode: Latin, Cyrillic\n- Source Sans (adobe-source-sans-fonts) – Open source sans serif font from Adobe with a design based on News Gothic and Franklin Gothic\n- Tahoma (Wine Replacement) (ttf-tahomaAUR) – Open source substitute for Tahoma developed by the Wine project. It was created because many Windows applications expected Tahoma to be available.\n\n"
    },
    {
      "title": "Serif",
      "level": 4,
      "content": "- Bitstream Charter (ttf-bitstream-charterAUR, otf-bitstream-charterAUR) – Originally a commercial font designed by Matthew Carter. A version was released under a free license and later converted to modern formats (provided as the aforementioned packages).\n- Bodoni* (otf-bodoniAUR) – An open-source Bodoni revival\n- Crimson (otf-crimson) – An open-source font that shares similarities with Minion\n- EB Garamond (ebgaramond-otfAUR) – An open-source Garamond revival, the aforementioned package is the version developed by Octavio Pardo\n- FreeSerif (gnu-free-fonts) – Visually similar to Times New Roman but metrically different, see #Набори шрифтів\n- Gentium (ttf-gentium-plus) – Unicode, comprehensive support for Latin, Greek, Cyrillic, International Phonetic Alphabet (IPA) characters\n- Heuristica (ttf-heuristicaAUR) – Based on a version of Utopia that was released under a free license\n- Liberation Serif (ttf-liberation) – Metric-compatible with Times New Roman but visually distinct, see #Набори шрифтів\n- Libre Baskerville (ttf-librebaskervilleAUR) – An open-source Baskerville revival designed by Impallari Type\n- Libre Caslon (otf-libre-caslonAUR) – An open-source Caslon revival designed by Impallari Type\n- Linux Libertine (ttf-linux-libertine) – Developed as a substitute of Times New Roman, but different both visually and metrically (the metric differences are more notable for italic and bold fonts). Its fork Libertinus Fonts (otf-libertinus) is the version that is under active development.\n- TeX Gyre Termes (tex-gyre-fonts) – Visually similar to Times New Roman (but there are some minor metric differences), see #Набори шрифтів\n- Tinos (ttf-croscore) – Metric-compatible with Times New Roman but visually distinct (and looks similar to Liberation Serif), see #Набори шрифтів\n\n"
    },
    {
      "title": "Handwriting",
      "level": 4,
      "content": "- ttf-nothingyoucoulddoAUR – Handwriting of a photographer\n- ttf-indieflowerAUR – Handwriting sans-serif font with bubbly and rounded edges\n- ttf-pacificoAUR – Brush script handwriting font which was inspired by the 1950s American surf culture and expanded to Cyrillic\n- otf-londrinaAUR – Handwriting font inspired from the streets of Sao Paulo, Brazil\n- otf-teslaAUR – Script font based on a reconstruction of Nikola Tesla's handwriting\n- ttf-architects-daughterAUR – Font incorporating the graphic, squared look of architectural writing and the natural feel of daily handwriting\n\n"
    },
    {
      "title": "Unsorted",
      "level": 4,
      "content": "- all-repository-fontsAUR – Meta package for all fonts in the official repositories\n- ttf-cheapskateAUR – Font collection from dustismo.com\n- ttf-google-fonts-gitAUR – A huge collection of free fonts (including Ubuntu, Inconsolata, Roboto, etc.) Note: Your font dialog might get very long as more than 100 fonts will be added.\n- ttf-junicode – Junius font containing almost complete medieval Latin script glyphs\n- ttf-mph-2b-damaseAUR – Covers full plane 1 and several scripts\n- xorg-fonts-type1 – IBM Courier and Adobe Utopia sets of PostScript fonts\n\n"
    },
    {
      "title": "Ancient Scripts",
      "level": 4,
      "content": "- ttf-ancient-fontsAUR – Font containing Unicode symbols for Aegean, Egyptian, Cuneiform, Anatolian, Maya, and Analecta scripts\n\n"
    },
    {
      "title": "Arabic",
      "level": 4,
      "content": "See Localization/Arabic#Fonts.\n\n"
    },
    {
      "title": "Bengali",
      "level": 4,
      "content": "Read Localization/Bengali#Fonts for details.\n\n"
    },
    {
      "title": "Braille",
      "level": 4,
      "content": "- ttf-ubrailleAUR – Font containing Unicode symbols for braille\n\n"
    },
    {
      "title": "Chinese, Japanese, Korean, Vietnamese",
      "level": 4,
      "content": "Adobe Source Han fonts and Noto CJK fonts have identical glyphs and metrics, but with different branding since the project was commissioned by both Adobe and Google.\n\nBoth collections comprehensively support Simplified Chinese, Traditional Chinese, Japanese, and Korean, with a consistent design and look. Noto Sans CJK fonts lack localized menu names, that are not required, but may make fonts more user-friendly for customers whose native language is that of the target language of the font.\n\n- Adobe Source Han fonts Source Han Sans (adobe-source-han-sans-otc-fonts) Source Han Serif (adobe-source-han-serif-otc-fonts)\n- Noto CJK fonts (noto-fonts-cjk) – Includes both Noto Sans CJK and Noto Serif CJK\n\n- Source Han Sans (adobe-source-han-sans-otc-fonts)\n- Source Han Serif (adobe-source-han-serif-otc-fonts)\n\nSee Localization/Chinese#Fonts.\n\nSee Localization/Japanese#Fonts.\n\nSee Localization/Korean#Fonts.\n\n- ttf-hannom – Vietnamese TrueType font for chữ Nôm characters\n\n"
    },
    {
      "title": "Cyrillic",
      "level": 4,
      "content": "See also #Латинка.\n\n- ttf-paratypeAUR – Font family by ParaType: sans, serif, mono, extended cyrillic and latin, OFL license\n- otf-russkopisAUR – A free OpenType cursive font for Cyrillic script\n\n"
    },
    {
      "title": "Greek",
      "level": 4,
      "content": "Almost all Unicode fonts contain the Greek character set (polytonic included). Some additional font packages, which might not contain the complete Unicode set but utilize high quality Greek (and Latin, of course) typefaces are:\n\n- otf-gfsAUR – Selection of OpenType fonts from the Greek Font Society\n- ttf-mgopenAUR – Professional TrueType fonts from Magenta\n- ttf-sbl-greekAUR – SBL Greek, created by the Society of Biblical Literature (SBL)\n- ttf-sbl-biblitAUR – SBL BibLit, includes characters from both SBL Greek and SBL Hebrew\n\n"
    },
    {
      "title": "Hebrew",
      "level": 4,
      "content": "- opensiddur-hebrew-fontsAUR – Large collection of Open-source licensed Hebrew fonts. There are also few Latin, Greek, Cyrillic, Arabic, and Amharic.\n- culmusAUR – Nice collection of free Hebrew fonts\n- alefbetAUR – 2 Hebrew fonts (at the moment): the commonly used \"David Libre\", and the handwriting font \"Gveret Levin\"\n- ttf-ms-fontsAUR – contains Arial and other fonts\n- ttf-sbl-hebrewAUR – SBL Hebrew, created by the Society of Biblical Literature (SBL)\n- ttf-sbl-biblitAUR – SBL BibLit, includes characters from both SBL Hebrew and SBL Greek\n\n- Cousine (ttf-croscore) – part of the Chrome OS Core Fonts\n- Everson Mono (ttf-everson-monoAUR) – is lighter and a bit looser than Courier, with wide range of supported Unicode blocks\n- FreeMono (gnu-free-fonts) – part of the GNU FreeFont\n\n"
    },
    {
      "title": "Indic",
      "level": 4,
      "content": "See Localization/Indic#Fonts.\n\n"
    },
    {
      "title": "Khmer",
      "level": 4,
      "content": "- ttf-khmer – Font covering glyphs for Khmer language\n- Hanuman[мертве посилання 2025-03-15 ⓘ] (ttf-google-fonts-gitAUR)\n\n"
    },
    {
      "title": "Mongolic and Tungusic",
      "level": 4,
      "content": "- ttf-abkaiAUR – Fonts for Sibe, Manchu and Daur scripts (incomplete, currently in development)\n\n"
    },
    {
      "title": "Persian",
      "level": 4,
      "content": "- persian-fontsAUR – Meta package for installing all Persian fonts in AUR\n- borna-fontsAUR – Borna Rayaneh Co. Persian B font series\n- iran-nastaliq-fontsAUR – A free Unicode calligraphic Persian font\n- iranian-fontsAUR – Iranian-Sans and Iranian-Serif Persian font family\n- ir-standard-fontsAUR – Iran Supreme Council of Information and Communication Technology (SCICT) standard Persian fonts\n- persian-hm-ftx-fontsAUR – A Persian font series derived from X Series 2, Metafont and FarsiTeX fonts with Kashida feature\n- persian-hm-xs2-fontsAUR – A Persian font series derived from X Series 2 fonts with Kashida feature\n- gandom-fontsAUR, parastoo-fontsAUR, sahel-fontsAUR, samim-fontsAUR, shabnam-fontsAUR, tanha-fontsAUR, vazirmatn-fontsAUR, vazir-code-fontsAUR – Beautiful Persian fonts made by Saber RastiKerdar\n- ttf-yasAUR – The Yas Persian font series (with hollow zero)\n- ttf-x2AUR – Free fonts with support for Persian, Arabic, Urdu, Pashto, Dari, Uzbek, Kurdish, Uighur, old Turkish (Ottoman) and modern Turkish (Roman)\n\n"
    },
    {
      "title": "Tai–Kadai",
      "level": 4,
      "content": "- fonts-tlwgAUR – Collection of scalable Thai fonts\n- ttf-google-thaiAUR – High-quality Thai fonts from Google and new improvement for Thai National Fonts\n- ttf-laoAUR – Lao TTF font (Phetsarath_OT)\n\n"
    },
    {
      "title": "Tibeto-Burman",
      "level": 4,
      "content": "- ttf-tibetan-machine – Tibetan Machine TTFont\n- ttf-sil-padaukAUR – Unicode font that supports the many diverse languages that use the Myanmar script\n\n"
    },
    {
      "title": "Emoji and symbols",
      "level": 3,
      "content": "A section of the Unicode standard is designated for pictographic characters called \"emoji\".\n\nEmoji fonts come in different formats: CBDT/CBLC (Google), SBIX (Apple), COLR/CPAL (Microsoft), SVG (Mozilla/Adobe).\n\nEmojis should work out of the box once you have at least one emoji font installed of a supported format. However, some of the emoji fonts encode their glyphs as large fixed-size bitmaps and thus, for the purpose of displaying at the intended size, rely on bitmap font downscaling, which is enabled by default.\n\nEmoji font fallback according to the standard requires extra code to handle emoji.\n\nFor the discovery and input of Emoji see List of applications/Utilities#Text input.\n\nTable content:\nSoftware | CBDT/CBLC | SBIX | COLR/CPAL | SVG | Emoji font fallback\nFreeType | Yes | Yes | Yes | No | –\nChromium | FreeType | – | Yes\nFirefox | FreeType | Yes | No, see Firefox#Font troubleshooting for workaround.\nPango | FreeType | – | Yes\nQt | FreeType | – | No [2] [3] [4]\nWebKitGTK | FreeType | – | Yes\n\nCBDT/CBLC:\n\n- noto-fonts-emoji – Google's open-source Emoji 15.1\n- ttf-joypixelsAUR – EmojiOne creator's proprietary Emoji 15.0\n- ttf-twemojiAUR – Twitter's open-source Emoji 15.0\n\nSVG:\n\n- Font Awesome (ttf-font-awesome) – The iconic SVG font\n- otf-openmojiAUR – German University of Design in Schwäbisch Gmünd open-source Emoji 15.0\n- ttf-twemoji-colorAUR – Twitter's open-source Emoji 14.0\n\nOutline only:\n\n- ttf-symbolaAUR – provides many Unicode symbols, including emoji\n\nKaomoji are sometimes referred to as \"Japanese emoticons\" and are composed of characters from various character sets, including CJK and Indic fonts. For example, the following set of packages covers most of existing kaomoji: gnu-free-fonts, ttf-arphic-uming, and ttf-indic-otf.\n\nTeranoptia (ttf-teranoptia-furiaeAUR) – is a typeface without letters (an illustrative font), a peculiar contraption that allows you to imagine chimeric creatures just by typing letters with your keyboard.\n\n"
    },
    {
      "title": "Math",
      "level": 3,
      "content": "- Computer Modern (ttf-cm-unicodeAUR, otf-cm-unicodeAUR)\n- Computer Modern (otf-latin-modern, otf-latinmodern-math) – Improved version used in LaTeX\n- Libertinus Math (otf-libertinus) – A math font based on Libertinus Serif which is a fork of Linux Libertine (ttf-linux-libertine)\n- STIX fonts (otf-stixAUR) – STIX is designed to be a royalty-free alternative that resembles Times New Roman. The current version is called STIX Two and includes a math companion named STIX Two Math.\n- TeX Gyre math fonts (tex-gyre-math-fontsAUR) – Math companions of TeX Gyre fonts (see #Набори шрифтів). Notably, TeX Gyre Termes Math is a math companion of Times New Roman.\n\nAdditionally, texlive-basic and texlive-fontsextra contain many math fonts such as Latin Modern Math and STIX fonts. See TeX Live#Making fonts available to Fontconfig for configuration.\n\n"
    },
    {
      "title": "Other operating system fonts",
      "level": 3,
      "content": "- ttf-mac-fontsAUR - Apple MacOS TrueType fonts\n\n"
    },
    {
      "title": "Fallback font order",
      "level": 2,
      "content": "Fontconfig automatically chooses a font that matches the current requirement. That is to say, if one is looking at a window containing English and Chinese for example, it will switch to another font for the Chinese text if the default one does not support it.\n\nFontconfig lets every user configure the order they want via $XDG_CONFIG_HOME/fontconfig/fonts.conf. If you want a particular Chinese font to be selected after your favorite Serif font, your file would look like this:\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n<alias>\n   <family>serif</family>\n   <prefer>\n     <family>Your favorite Latin Serif font name</family>\n     <family>Your Chinese font name</family>\n   </prefer>\n </alias>\n</fontconfig>\n```\n\n- If you use a Chinese locale, set LC_LANG to und to make this work. Otherwise both English and Chinese text will be rendered in the Chinese font.\n- After changing the configuration run fc-match -a monospace | head to verify your fallback font is set correctly.\n\nYou can add a section for sans-serif and monospace as well. For more information, have a look at the fontconfig manual.\n\nSee also Font configuration#Set default or fallback fonts.\n\n"
    },
    {
      "title": "Font alias",
      "level": 2,
      "content": "There are several font aliases which represent other fonts in order that applications may use similar fonts. The most common aliases are: serif for a font of the serif type (e.g. DejaVu Serif); sans-serif for a font of the sans-serif type (e.g. DejaVu Sans); and monospace for a monospaced font (e.g. DejaVu Sans Mono). However, the fonts which these aliases represent may vary and the relationship is often not shown in font management tools, such as those found in KDE and other desktop environments.\n\nTo reverse an alias and find which font it is representing, run:\n\n```\n$ fc-match monospace\n```\n\n```\nDejaVuSansMono.ttf: \"DejaVu Sans Mono\" \"Book\"\n```\n\nIn this case, DejaVuSansMono.ttf is the font represented by the monospace alias.\n\n"
    },
    {
      "title": "List all installed fonts",
      "level": 3,
      "content": "You can use the following command to list all installed Fontconfig fonts that are available on your system.\n\n```\n$ fc-list\n```\n\n"
    },
    {
      "title": "List installed fonts for a particular language",
      "level": 3,
      "content": "Applications and browsers select and display fonts depending upon fontconfig preferences and available font glyph for Unicode text. To list installed fonts for a particular language, issue a command fc-list :lang=\"two letter language code\". For instance, to list installed Arabic fonts or fonts supporting Arabic glyph:\n\n```\n$ fc-list -f '%{file}\\n' :lang=ar\n```\n\n```\n/usr/share/fonts/TTF/FreeMono.ttf\n/usr/share/fonts/TTF/DejaVuSansCondensed.ttf\n/usr/share/fonts/truetype/custom/DroidKufi-Bold.ttf\n/usr/share/fonts/TTF/DejaVuSansMono.ttf\n/usr/share/fonts/TTF/FreeSerif.ttf\n```\n\n"
    },
    {
      "title": "List installed fonts for a particular Unicode character",
      "level": 3,
      "content": "To search for monospace fonts supporting a particular Unicode codepoint:\n\n```\n$ fc-match -s monospace:charset=1F4A9\n```\n\n"
    },
    {
      "title": "Application-specific font cache",
      "level": 3,
      "content": "Matplotlib (python-matplotlib) uses its own font cache, so after updating fonts, be sure to remove ~/.matplotlib/fontList.cache, ~/.cache/matplotlib/fontList.cache, ~/.sage/matplotlib-1.2.1/fontList.cache, etc. so it will regenerate its cache and find the new fonts [6].\n\n"
    },
    {
      "title": "Bidirectional text support",
      "level": 3,
      "content": "See Bidirectional text for troubleshooting problems related to RTL languages.\n\n"
    },
    {
      "title": "Braille font not displaying correctly inside terminals",
      "level": 3,
      "content": "If braille characters in terminals exhibit rendering issues, try installing a braille font and uninstalling gnu-free-fonts.\n\n"
    },
    {
      "title": "Emacs",
      "level": 4,
      "content": "Emacs calculates sizes differently than standard Linux desktop applications, and Emacs packages do not all use the same config format, so if points or raw pixel size doesn't work, try using the other value.\n\n"
    },
    {
      "title": "Visual Studio Code",
      "level": 4,
      "content": "Change the setting Editor: Experimental Whitespace Rendering from \"svg\" to \"font\" if your monospace fonts have problems scaling certain characters correctly. This is known to help with \"Terminus (TTF)\" and \"IBM 3270\" fonts.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- State of Text Rendering\n- Font Library — Fonts under free licenses\n\n"
    }
  ]
}