{
  "title": "Font configuration (Español)",
  "url": "https://wiki.archlinux.org/title/Font_configuration_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-05-31** \n\nArtículos relacionados\n\n- Font configuration/Examples\n- Fuentes\n- Metric-compatible fonts\n- Microsoft fonts\n- Java Runtime Environment fonts\n- X Logical Font Description\n\nFontconfig es una biblioteca diseñada para proporcionar una lista de fuentes disponibles para las aplicaciones, y también para configurar cómo representa las fuentes. La biblioteca FreeType representa las fuentes, basada en esta configuración. La representación de fuentes freetype2 en Arch Linux incluye el intérprete bytecode (BCI) activado para una representación mejor de las fuentes, especialmente en los monitores LCD. Vea #Configuración de FontConfig y Configuración de FontConfig/Ejemplos (en inglés).\n\nAunque Fontconfig se utiliza a menudo en los Unix modernos y en los sistemas operativos Unix-like, algunas aplicaciones confían en el método original para seleccionar fuentes y mostrarlas, la descripción de la fuente lógica X (en inglés).\n\n"
    },
    {
      "title": "Path de fuentes",
      "level": 2,
      "content": "Para que las aplicaciones reconozcan las fuentes tienen que estar catalogadas para un acceso fácil y rápido.\n\nEl path de fuente reconocido inicialmente por Fontconfig son: /usr/share/fonts/, ~/.local/share/fonts (y ~/.fonts/, en desuso). Fontconfig escaneará estos directorios recursivamente. Para una organización e instalación fácil está recomendado utilizar estas rutas cuando se añaden fuentes.\n\nPara ver una lista de fuentes reconocidas por Fontconfig:\n\n```\n$ fc-list : file\n```\n\nVea fc-list(1) para más formatos de salida.\n\nComprobar path de fuentes reconocidas por Xorg revisando su log:\n\n```\n$ grep /fonts ~/.local/share/xorg/Xorg.0.log\n```\n\n- También puedes comprobar la lista de path de fuentes reconocida por Xorg utilizando el comando xset q.\n- Utilice /var/log/Xorg.0.log si Xorg se está ejecutando con privilegios de root\n\nTenga en cuenta que Xorg no busca recursivamente a través del directorio /usr/share/fonts/ como lo hace Fontconfig. Para añadir una ruta, todo el path tiene que utilizarse:\n\n```\nSection \"Files\"\n    FontPath     \"/usr/share/fonts/local/\"\nEndSection\n```\n\nSi quiere que el path de fuentes se establezca en base de cada usuario, puede añadir y quitar rutas por defecto añadiendo las siguientes lineas a ~/.xinitrc:\n\n```\nxset +fp /usr/share/fonts/local/           # Antepone un path personalizado a la lista de Xorg.\nxset -fp /usr/share/fonts/sucky_fonts/     # Elimina una fuente específica del path de Xorg.\n```\n\nPara ver una lista de fuentes Xorg reconocidas utilice xlsfonts, del paquete xorg-xlsfonts.\n\n"
    },
    {
      "title": "Configuración de FontConfig",
      "level": 2,
      "content": "La documentación de fontconfig se encuentra en la página del manual fonts-conf(5).\n\nLa configuración se puede hacer por usuario via $XDG_CONFIG_HOME/fontconfig/fonts.conf, y globalmente con /etc/fonts/local.conf. Las configuraciones por usuario tienen prioridad sobre la configuración global. Ambos archivos utilizan la misma sintaxis.\n\nFontconfig reúne toda su configuración en un archivo principal (/etc/fonts/fonts.conf). Este archivo se reemplaza durante las actualizaciones y no se debe editar. Las aplicaciones compatibles con fontconfig obtienen este archivo para conocer las fuentes disponibles y saber cómo se procesan. Reiniciando simplemente las aplicaciones es suficiente para cargar la nueva configuración. Este archivo es un conjunto de reglas de la configuración global (/etc/fonts/local.conf), la configuración presente en /etc/fonts/conf.d/, y el archivo de configuración del usuario ($XDG_CONFIG_HOME/fontconfig/fonts.conf). fc-cache se puede utilizar para reconstruir la configuración de fontconfig, aunque los cambios solo serán visibles para las aplicaciones lanzadas a partir de ese momento.\n\nLos archivos de configuración utiliza el formato XML y necesita estas cabeceras:\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"urn:fontconfig:fonts.dtd\">\n<fontconfig>\n\n  <!-- Los ajustes van aquí -->\n\n</fontconfig>\n```\n\nLos ejemplos de configuración en este artículo omite estas etiquetas.\n\n"
    },
    {
      "title": "Ajustes predeterminados",
      "level": 3,
      "content": "Los ajustes predeterminados están instalados en el directorio /usr/share/fontconfig/conf.avail. Se pueden activar creando enlaces simbólicos a los archivos de configuración del usuario o globalmente o a ambos, como se describe en /etc/fonts/conf.d/README. Estos ajustes sobrescribirán los ajustes correspondientes en sus respectivos archivos de configuración.\n\nPor ejemplo, para activar el renderizado sub-pixel RGB globalmente:\n\n```\n$ cd /etc/fonts/conf.d\n# ln -s /usr/share/fontconfig/conf.avail/10-sub-pixel-rgb.conf\n```\n\nPara hacer lo mismo pero con la configuración del usuario:\n\n```\n$ mkdir $XDG_CONFIG_HOME/fontconfig/conf.d\n$ ln -s /usr/share/fontconfig/conf.avail/10-sub-pixel-rgb.conf $XDG_CONFIG_HOME/fontconfig/conf.d\n```\n\n"
    },
    {
      "title": "Anti-aliasing",
      "level": 3,
      "content": "La renderización de fuentes (en inglés) convierte los datos vectoriales de la fuente a un mapa de bits para poder mostrarla. El resultado puede parecer dentado debido al aliasing. La técnica conocida como anti-aliasing (en inglés) puede utilizarse para aumentar aparentemente la resolución de los bordes de las fuentes. Anti-aliasing está activado por defecto. Para desactivarlo:\n\n```\n<match target=\"font\">\n    <edit name=\"antialias\" mode=\"assign\">\n      <bool>false</bool>\n    </edit>\n  </match>\n```\n\n"
    },
    {
      "title": "Optimización",
      "level": 3,
      "content": "Hinting (en inglés) (optimización de la renderización) es el uso de instrucciones matemáticas para ajustar el contorno de la fuente de forma que se alinee a una cuadricula rasterizada ( es decir la cuadrícula de píxeles de la pantalla). Este efecto hace que la fuente sea más nítida y por lo tanto más legible. Las fuentes se alinean sin optimizarse cuando las pantallas tienen alrededor de 300 ppp.\n\n"
    },
    {
      "title": "Intérprete Byte-Code (BCI)",
      "level": 4,
      "content": "Utilizando las optimizaciones del BCI las instrucciones en las fuentes TrueType se representan acorde con el intérprete FreeTypes. La optimización está activada por defecto. Para desactivarla:\n\n```\n<match target=\"font\">\n    <edit name=\"hinting\" mode=\"assign\">\n      <bool>false</bool>\n    </edit>\n  </match>\n```\n\n"
    },
    {
      "title": "Auto-optimizado",
      "level": 4,
      "content": "El auto-optimizado intenta optimizar automáticamente y obvia toda la información de optimización. Originalmente era la que estaba por defecto porque las fuentes TrueType2 estaban patentadas pero ahora esas patentes expiraron y esa es la pequeña razón para utilizarla. Funciona mejor con fuentes que no tienen información de optimización o que dicha información este defectuosa, pero sobre-optimiza fuentes con una información de optimización válida. Generalmente las fuentes son del último tipo y auto-optimizado no es útil. El auto-optimizado está desactivado por defecto. Para activarlo:\n\n```\n<match target=\"font\">\n    <edit name=\"autohint\" mode=\"assign\">\n      <bool>true</bool>\n    </edit>\n  </match>\n```\n\n"
    },
    {
      "title": "Estilo de optimización",
      "level": 4,
      "content": "El estilo de optimizado (hintstyle) es la cantidad de remodelado de fuentes que se utiliza para alinearla a la cuadricula. Los valores de optimización son: hintnone, hintslight, hintmedium, y hintfull. hintslight hará la fuente más borrosa para alinearla a la cuadrícula pero con una mejor conservación de la forma de la fuente (vea [2]), mientras hintfull la hará más nítida para que se alinee bien a la cuadrícula pero se pierde bastante la forma de la fuente. hintslight usa solo el auto-optimizado en un modo vertical a favor de la información nativa de las fuentes no-CFF (.otf).\n\nhintslight es la configuración por defecto. Para cambiarla:\n\n```\n<match target=\"font\">\n    <edit name=\"hintstyle\" mode=\"assign\">\n      <const>hintnone</const>\n    </edit>\n  </match>\n```\n\n"
    },
    {
      "title": "Alineamiento de píxeles",
      "level": 3,
      "content": "Muchos monitores fabricados hoy en día utilizan las especificaciones rojo, verde, azul (RGB, red, green, blue). Fontconfig necesita conocer su tipo de monitor para poder mostrar las fuentes correctamente. Los monitores son: RGB (más común), BGR, V-RGB (vertical), or V-BGR. Un test del monitor se puede encontrar aquí.\n\n```\n<match target=\"font\">\n    <edit name=\"rgba\" mode=\"assign\">\n      <const>rgb</const>\n    </edit>\n  </match>\n```\n\nNote: **RGB** \n\n"
    },
    {
      "title": "Representación subpixel",
      "level": 3,
      "content": "La representación subpixel es una técnica para mejorar la nitidez de las fuentes triplicando la resilución horizontal (o vertical) a través del uso de los subpixel. En los sistemas Windows, esta técnica se llama \"ClearType\".\n\nFreeType implementa su propio renderizador optimizado LCD llamado Harmony. Con esta tecnología de renderizado LCD, el resultado no requiere ningún filtro LCD adicional, no como renderizador subpixel patentado de Microsoft ClearType donde se recomienda un filtro LCD. Vea abajo la sección cómo activar el filtro LCD y sus beneficios.\n\nEl renderizador subpixel ClearType está protegido por las patentes de Microsoft y desactivado por defecto en Arch Linux. Para habilitarlo, tiene que recompilar freetype2 y definir la macro FT_CONFIG_OPTION_SUBPIXEL_RENDERING, o utilizar p.ej. el paquete del AUR freetype2-cleartypeAUR[enlace roto: package not found].\n\n"
    },
    {
      "title": "Filtro LCD",
      "level": 4,
      "content": "Cuando utilize el renderizador subpixel ClearType, debe de activar el filtro LCD, que está diseñado para reducir la franja de color. Está descrito en Filtrar LCD (en inglés) en la referencia de la API FreeType 2. Las diferentes opciones están descritas en FT_LcdFilter, y están ilustradas en la página test de filtros LCD.\n\nEl filtro lcddefault será suficiente para la mayoría de los usuarios. Otros filtros están disponibles y se pueden utilizar en situaciones especiales: lcdlight; un filtro ligero ideales para fuentes que se ven demasiado borrosas o negrita, lcdlegacy, el filtro original Cairo; y lcdnone para desactivarlo completamente.\n\n```\n<match target=\"font\">\n    <edit name=\"lcdfilter\" mode=\"assign\">\n      <const>lcddefault</const>\n    </edit>\n  </match>\n```\n\n"
    },
    {
      "title": "Especificaciones avanzadas del filtro LCD",
      "level": 4,
      "content": "Si los filtros LCD incluidos no le resultan satisfactorios, es posible retocar el renderizador de fuentes de forma muy específica construyendo un paquete freetype2 personalizado y modificar los filtros codificados. El sistema de construcción de Arch se puede utilizar para construir e instalar paquetes desde código fuente.\n\nRevise el PKGBUILD de freetype2 y descargue/extraiga los archivos.\n\nPara activar el renderizado subpixel edite el archivo src/freetype-VERSION/include/freetype/config/ftoption.h y descomente la macro FT_CONFIG_OPTION_SUBPIXEL_RENDERING.\n\nDespués, edite el archivo src/freetype-VERSION/src/base/ftlcdfil.c y busque la definición de la constante default_filter[5]:\n\n```\nstatic const FT_Byte  default_filter[5] =\n    { 0x10, 0x40, 0x70, 0x40, 0x10 };\n```\n\nEsta constante define un filtro que suaviza el glifo renderizado. Modifiquelo tanto como sea necesario. (referencia: lista de discusión freetype (en inglés)) Guarde el archivo, construyalo e instale el paquete personalizado:\n\n```\n$ makepkg -e\n# pacman -Rd freetype2\n# pacman -U freetype2-VERSION-ARCH.pkg.tar.xz\n```\n\nReinicie X. El filtro lcddefault debe renderizar las fuentes de forma diferente.\n\n"
    },
    {
      "title": "Ajustes específicos para ciertas fuentes o estilos de fuente",
      "level": 3,
      "content": "Auto-hinter utiliza métodos sofisticados para renderizar fuentes, pero a veces hace que las fuentes sean demasiado grandes. Afortunadamente, una solución es desactivar autohinter para fuentes en negritas mientras que para el resto sige activado:\n\n```\n...\n<match target=\"font\">\n    <test name=\"weight\" compare=\"more\">\n        <const>medium</const>\n    </test>\n    <edit name=\"autohint\" mode=\"assign\">\n        <bool>false</bool>\n    </edit>\n</match>\n...\n```\n\nAlgunas fuentes puede que no se vean bien con el hinting BCI. Se puede desactivar para estas fuentes:\n\n```\n...\n <match target=\"font\">\n    <test name=\"family\" qual=\"any\">\n        <string>My Font</string>\n    </test>\n    <edit name=\"hinting\" mode=\"assign\">\n        <bool>false</bool>\n    </edit>\n</match>\n...\n```\n\n"
    },
    {
      "title": "Reemplazar o establecer las fuentes por defecto",
      "level": 3,
      "content": "La forma más fiable de hacer esto es añadir un fragmento XML similar al que hay abajo. Utilizar el atributo \"Unión (binding)\" le dará mejores resultados, por ejemplo, en Firefox cuando no quiera cambiar las propiedades de la fuente que se está reemplazando. Esto hará que Ubuntu se use en vez de Georgia:\n\n```\n...\n<match target=\"pattern\">\n  <test qual=\"any\" name=\"family\"><string>Georgia</string></test>\n  <edit name=\"family\" mode=\"assign\" binding=\"same\"><string>Ubuntu</string></edit>\n</match>\n...\n```\n\nEl enfoque alternativo es establecer la fuente \"preferida\", pero esto solo funciona si la fuente original no está en el sistema, en este caso se sustituirá el valor especificado:\n\n```\n...\n<!-- Reemplazando Helvetica con Bitstream Vera Sans Mono -->\n<!-- Nota, debe existir un alias para Helvetica en los archivos de configuración por defecto -->\n<alias>\n    <family>Helvetica</family>\n    <prefer>\n        <family>Bitstream Vera Sans Mono</family>\n    </prefer>\n</alias>\n...\n```\n\n"
    },
    {
      "title": "Lista blanca y lista negra de fuentes",
      "level": 3,
      "content": "El elemento <selectfont> se usa en conjunto con los elementos <acceptfont> y <rejectfont> para seleccionar las fuentes en las listas blanca y negra y resolver las coincidencias y solicitudes. El más simple y el más típico caso es rechazar una fuente que necesita instalarse, sin embargo coincide con una fuente genérica que puede causar problemas en las interfaces de las aplicaciones.\n\nPrimero obtenga el nombre de la familia de la fuente:\n\n```\n$ fc-scan .fonts/lklug.ttf --format='%{family}\\n'\n```\n\n```\nLKLUG\n```\n\nDespués utilice ese nombre de la familia en la estrofa <rejectfont>:\n\n```\n<selectfont>\n    <rejectfont>\n        <pattern>\n            <patelt name=\"family\" >\n                <string>LKLUG</string>\n            </patelt>\n        </pattern>\n    </rejectfont>\n</selectfont>\n```\n\nNormalmente cuando ambos elementos se combinan, <rejectfont> se usa primero de una forma general para rechazar un gran grupo (como todo un directorio), después <acceptfont> se utiliza para poner en la lista blanca fuentes especificas que están en el gran grupo de la lista negra.\n\n```\n<selectfont>\n    <rejectfont>\n        <glob>/usr/share/fonts/OTF/*</glob>\n    </rejectfont>\n    <acceptfont>\n        <pattern>\n            <patelt name=\"family\" >\n                <string>Monaco</string>\n            </patelt>\n        </pattern>\n    </acceptfont>\n</selectfont>\n```\n\n"
    },
    {
      "title": "Desactivar fuentes bitmap",
      "level": 3,
      "content": "Las fuentes mapa de bits (bitmap) se utilizan a veces como alternativa de una fuente que falta, puede hacer que el texto se represente pixelado o muy grande. Utilice el ajuste predeterminado 70-no-bitmaps.conf para desactivar este comportamiento.\n\nPara desactivar bitmap incrustado para todas las fuentes:\n\n```\n~/.config/fontconfig/conf.d/20-no-embedded.conf\n```\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"urn:fontconfig:fonts.dtd\">\n<fontconfig>\n  <match target=\"font\">\n    <edit name=\"embeddedbitmap\" mode=\"assign\">\n      <bool>false</bool>\n    </edit>\n  </match>\n</fontconfig>\n```\n\nPara desactivar bitmap incrustado para una fuente específica:\n\n```\n<match target=\"font\">\n  <test qual=\"any\" name=\"family\">\n    <string>Monaco</string>\n  </test>\n  <edit name=\"embeddedbitmap\">\n    <bool>false</bool>\n  </edit>\n</match>\n```\n\n"
    },
    {
      "title": "Desactivar escalado de fuentes bitmap",
      "level": 3,
      "content": "Para desactivar el escalado de las fuentes bitmap (lo que a veces los emborrona), elimine /etc/fonts/conf.d/10-scale-bitmap-fonts.conf.\n\n"
    },
    {
      "title": "Crear estilos negrita e itálica para fuentes incompletas",
      "level": 3,
      "content": "FreeType tiene la habilidad de crear automáticamente los estilos itálica y negrita para fuentes que no los tienen, pero solo si la aplicación lo requiere. Los programas raramente envían estas peticiones, esta sección cubre la generación forzada de los estilos faltantes.\n\nEmpiece editando /usr/share/fonts/fonts.cache-1 como se explica abajo. Guarde una copia de la modificación en otro archivo porque la actualización de fuentes con fc-cache sobrescribirá /usr/share/fonts/fonts.cache-1.\n\nAsumiendo que la fuente Dupree está instalada:\n\n```\n\"dupree.ttf\" 0 \"Dupree:style=Regular:slant=0:weight=80:width=100:foundry=unknown:index=0:outline=True:etc...\n```\n\nDuplique la linea, cambie style=Regular a style=Bold o cualquier otro estilo. Cambie también slant=0 a slant=100 para itálica, weight=80 a weight=200 para negrita, o combinelas para negrita e itálica:\n\n```\n\"dupree.ttf\" 0 \"Dupree:style=Bold Italic:slant=100:weight=200:width=100:foundry=unknown:index=0:outline=True:etc...\n```\n\nAhora añada las modificaciones necesarias a $XDG_CONFIG_HOME/fontconfig/fonts.conf:\n\n```\n...\n<match target=\"font\">\n    <test name=\"family\" qual=\"any\">\n        <string>Dupree</string>\n         <!-- otras fuentes aqui .... -->\n     </test>\n     <test name=\"weight\" compare=\"more_eq\"><int>140</int></test>\n     <edit name=\"embolden\" mode=\"assign\"><bool>true</bool></edit>\n</match>\n\n<match target=\"font\">\n    <test name=\"family\" qual=\"any\">\n        <string>Dupree</string>\n        <!-- otras fuentes aqui .... -->\n    </test>\n    <test name=\"slant\" compare=\"more_eq\"><int>80</int></test>\n    <edit name=\"matrix\" mode=\"assign\">\n        <times>\n            <name>matrix</name>\n                <matrix>\n                    <double>1</double><double>0.2</double>\n                    <double>0</double><double>1</double>\n                </matrix>\n        </times>\n    </edit>\n</match>\n...\n```\n\n"
    },
    {
      "title": "Cambiar prioridad de las reglas",
      "level": 3,
      "content": "Fontconfig procesa archivos de /etc/fonts/conf.d en un orden numérico. Esto activa reglas o archivos que se anulan unos a otros, pero a menudo confunde a los usuarios cobre cual es el último archivo que se analiza.\n\nPara garantizar que los ajustes personales tienen preferencia sobre cualquier regla, cambie el orden:\n\n```\n# cd /etc/fonts/conf.d\n# mv 50-user.conf 99-user.conf\n```\n\nEste cambio parece innecesario para la mayoría de los casos, porque el usuario tiene suficiente control por defecto para establecer sus propias preferencias, hinting y propiedades antialiasing, alias de nuevas fuentes para generar familias de fuentes, etc.\n\n"
    },
    {
      "title": "Consultar la configuración actual",
      "level": 3,
      "content": "Para ver qué ajustes están aplicandose, utilize fc-match --verbose. p.ej.\n\n```\n$ fc-match --verbose Sans\n```\n\n```\nfamily: \"DejaVu Sans\"(s)\nhintstyle: 3(i)(s)\nhinting: True(s)\n...\n```\n\nBusque el significado de los números en fonts-conf(5) P.ej. 'hintstyle: 3' significa 'hintfull'.\n\n"
    },
    {
      "title": "Aplicaciones sin soporte fontconfig",
      "level": 2,
      "content": "Algunas aplicaciones como URxvt ignoran los ajustes fontconfig. Puede abordarlo utilizando ~/.Xresources, pero no es tan flexible como fontconfig. Por Ejemplo (vea Configuración de FontConfig para las explicaciones de las opciones):\n\n```\n~/.Xresources\n```\n\n```\nXft.autohint: 0\nXft.lcdfilter: lcddefault\nXft.hintstyle: hintslight\nXft.hinting: 1\nXft.antialias: 1\nXft.rgba: rgb\n```\n\nAsegúrese que los ajustes se cargan apropiadamente cuando X se inicia con xrdb -q (vea X resources (en inglés) para más información).\n\n"
    },
    {
      "title": "Obligar fuente de emoticonos",
      "level": 3,
      "content": "Algunos programas como Firefox y Chromium tienen problemas con la representación de emoticonos [3] [4]. Para obligar la representación de los emoticonos de cualquier forma cree una fuente de emoticonos de último recurso predeterminada para su aplicación, para habilitarla vea #Ajustes predeterminados.\n\nPara otras aplicaciones o fuente Emoji favorita reemplace \"firefox\" y \"Noto Color Emoji\" respectivamente:\n\n```\n/etc/fonts/conf.avail/55-emoji-prepend.conf\n```\n\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE fontconfig SYSTEM \"urn:fontconfig:fonts.dtd\">\n<fontconfig>\n  <match>\n    <test name=\"prgname\">\n     <string>firefox</string>\n    </test>\n    <edit name=\"family\" mode=\"prepend\" binding=\"weak\">\n      <string></nowiki>Noto Color Emoji</string>\n    </edit>\n  </match>\n</fontconfig>\n```\n\n"
    },
    {
      "title": "Fuentes distorsionadas",
      "level": 3,
      "content": "Si las fuentes de forma inesperada se ven grandes o pequeñas, mal proporcionadas o simplemente mal renderizadas, fontconfig puede estar utilizando unos ppp incorrectos.\n\nFontconfig debe ser capaz de detectar los parámetros ppp que Xorg server descubre. Puede comprobar automáticamente los ppp descubiertos con xdpyinfo (proporcionado por el paquete xorg-xdpyinfo):\n\n```\n$ xdpyinfo | grep dots\n```\n\n```\nresolution:    102x102 dots per inch\n```\n\nSi los ppp que se detectan son incorrectos (usualmente debido a un EDID del monitor incorrecto) puede especificar manualmente la configuración de Xorg, vea Tamaño de la pantalla y DPI. Esta es la solución recomendada, pero puede que no funcione con controladores buggy.\n\nFontconfig por defecto irá a la variable Xft.dpi si está establecida. Xft.dpi lo establecen normalmente los entornos de escritorio (generalmente los ajustes ppp de Xorg) o manualmente en ~/.Xdefaults o ~/.Xresources. Utilice xrdb para consultar el valor:\n\n```\n$ xrdb -query | grep dpi\n```\n\n```\nXft.dpi:\t102\n```\n\nAquellos que todavía tienen problemas pueden volver manualmente a la configuración ppp utilizada por fontconfig:\n\n```\n...\n<match target=\"pattern\">\n   <edit name=\"dpi\" mode=\"assign\"><double>102</double></edit>\n</match>\n...\n```\n\n"
    },
    {
      "title": "Calibri, Cambria, Monaco, etc. no se representan apropiadamente",
      "level": 3,
      "content": "Algunas fuentes escalables tienen versiones bitmap incrustados que se representan en su lugar, principalmente en los tamaños pequeños. Utilizar Fuentes compatibles con la métrica (en inglés) como sustituto puede mejorar la representación en estos casos.\n\nTambién puede forzar que se utilice fuentes escalables para todos los tamaños con deshabilitar bitmap incrustado, sacrificando alguna calidad de renderizado.\n\n"
    },
    {
      "title": "Applicaciones que ignoran hinting",
      "level": 3,
      "content": "Algunas aplicaciones o entornos de escritorio pueden anular la configuración hinting de fontconfig y anti-aliasing por defecto. Esto puede ocurrir con GNOME 3, por ejemplo mientras utiliza aplicaciones Qt como vlc o smplayer. Utilice la configuración del programa específico de la aplicación para estos casos. Para GNOME, pruebe gnome-tweaks.\n\n"
    },
    {
      "title": "Aplicaciones no recogen hinting de la configuración de GNOME",
      "level": 3,
      "content": "Por ejemplo, en GNOME a veces ocurre que Firefox aplica hinting completo en vez del valor \"ninguno\" en los ajustes de GNOME, que termina con unas fuentes afiladas y ampliadas. En este caso tendría que añadir ajustes hinting al archivo fonts.conf:\n\n```\n<?xml version='1.0'?>\n<!DOCTYPE fontconfig SYSTEM 'urn:fontconfig:fonts.dtd'>\t\n<fontconfig>\n <match target=\"font\">\n  <edit mode=\"assign\" name=\"hinting\">\n   <bool>false</bool>\n  </edit>\n </match>\n</fontconfig>\n```\n\nEn este ejemplo, hinting se establece a \"escala de grises\".\n\n"
    },
    {
      "title": "Hinting incorrecto en aplicaciones GTK",
      "level": 3,
      "content": "En algunos entorno de escritorios, especialemente fuera de GNOME y Plasma, algunas aplicaciones GTK no pueden leer apropiadamente la configuración de las fuentes. Para solucionarlo instale xsettingsd o xsettingsd-gitAUR y ejecutelo en cada inicio del sistema. Vea también Xsettingsd y la wiki de xsettingsd para más información. Esto se puede configurar con la siguiente habitual configuracion:\n\n```\n~/.xsettingsd\n```\n\n```\nXft/Hinting 1\nXft/HintStyle \"hintslight\"\nXft/Antialias 1\nXft/RGBA \"rgb\"\n```\n\nSi esto no funciona en otras aplicaciones puede probar con la instalacion de xorg-xrdb y proveer la siguiente configuración:\n\n```\n~/.Xresources\n```\n\n```\nXft.hinting: 1\nXft.hintstyle: hintslight\nXft.antialias: 1\nXft.rgba: rgb\n```\n\nDespués puede ejecutar el script xrdb -merge ~/.Xresources en cada inicio del sistema para aplicar las opciones. Vea también X resources y #Aplicaciones sin soporte fontconfig.\n\n"
    },
    {
      "title": "Problema con la fuente Helvetica en PDFs generados",
      "level": 3,
      "content": "En el siguiente comando\n\n```\nfc-match helvetica\n```\n\nproduce\n\n```\nhelvR12-ISO8859-1.pcf.gz: \"Helvetica\" \"Regular\"\n```\n\nentonces la fuente bitamp proporcionada por xorg-fonts-75dpi es probable que se incruste dentro del PDF generado por \"Imprimir a un archivo\" o \"Exportar\" en varias aplicaciones. La fuente bitmap probablemente estaba instalada como consecuencia de instalar el grupo de la familia xorg (que normalmente NO se recomienda). Para solucionar el problema de la fuente pixelada, puede desinstalar el paquete. Instalar gsfonts (Type 1) o tex-gyre-fonts (OpenType) para una adecuada sustitución libre de Helvetica (y otras fuentes basadas en PostScript/PDF).\n\nPuede experimentar problemas similares cuando abra un PDF que requiera Helvetica pero no la tiene incrustada para ver.\n\n"
    },
    {
      "title": "FreeType rompe fuentes Bitmap",
      "level": 3,
      "content": "Algunos usuarios están reportando problemas (FS#52502) con las fuentes bitmap tienen nombres cambiados después de actualizar freetype2 a la versión 2.7.1, creando havok en emuladores de terminal y otros muchos programas como dwmAUR o dmenu utilizando como fuentes alternativas otras fuentes diferentes. Esto se causó por los cambios del formato de la familia de fuentes PCF, que como se describe en notas de la versión [5]. Usuarios que han realizado la transición del antiguo formato podrían crear un alias de fuente para resolver los problemas, como la solución que se describe en [6], dada aquí también:\n\nAsuma que queremos crear un alias para terminus-font, que se renombró de Terminus a xos4 Terminus en la anterior actualización de freetype2 descrita previamente:\n\n- Crea un archivo de configuración en /etc/fonts/conf.avail/ para el alias de fuente:\n\n```\n/etc/fonts/conf.avail/33-TerminusPCFFont.conf\n```\n\n```\n<?xml version=\"1.0\"?>\n <!DOCTYPE fontconfig SYSTEM \"urn:fontconfig:fonts.dtd\">\n <fontconfig>\n     <alias>\n         <family>Terminus</family>\n         <prefer><family>xos4 Terminus</family></prefer>\n         <default><family>fixed</family></default>\n     </alias>\n </fontconfig>\n```\n\n- Crea un enlace simbólico hacia el directorio /etc/fonts/conf.d. En nuestro ejemplo deberíamos enlazarlo así: ln -s /etc/fonts/conf.avail/33-TerminusPCFFont.conf /etc/fonts/conf.d para hacer que los cambios sean permanentes.\n\nTodo debería funcionar como lo hacía antes de la actualización, el alias de fuente no debería surtir efecto, pero asegúrese de que recarga .Xresources o reinicia el servidor de la pantalla antes de que los programas afectados puedan utilizar el alias.\n\n"
    },
    {
      "title": "Los subrayados no se renderizan con Dejavu Monospace",
      "level": 3,
      "content": "Desde Pango 1.44 los carácteres subrayados desaparecen en ciertos tamaños de fuente cuando se utiliza DejaVu Sans Mono. Una forma de evitar el problema es utilizar Liberation Mono como fuente monoespaciada. Vea #Reemplazar o establecer las fuentes por defecto.\n\n"
    },
    {
      "title": "Depurar fuentes FreeType",
      "level": 3,
      "content": "freetype2-demos proporciona herramientas para depurar las configuraciones de fuentes FreeType. ftview es una GUI en la cual puede retocar los ajustes de renderizado con una previsualización en vivo. Por ejemplo:\n\n```\n$ ftview -e unic -d 1024x768x24 -r 96 10 /usr/share/fonts/noto/NotoSans-Regular.ttf\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Fontconfig Wikipedia\n- Fuentes en X11R6.8.2 - Información oficial de la fuente Xorg\n- FreeType 2 visión general\n- Hilo de la representación de fuentes Gentoo\n- hinting leve\n- Referencia a la API de FreeType 2: Controlar módulos FreeType\n\n"
    }
  ]
}