{
  "title": "Font Configuration (Русский)",
  "url": "https://wiki.archlinux.org/title/Font_Configuration_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Настройка шрифтов/Примеры\n- Шрифты\n- Metric-compatible fonts\n- Шрифты Microsoft\n- Шрифты окружения Java Runtime\n- X Logical Font Description\n\nFontconfig — это библиотека, разработанная для предоставления списка доступных шрифтов приложениям, а также для настройки того, как шрифты будут отображаться. Библиотека FreeType рендерит шрифты, основываясь на этих настройках. Пакет freetype2 включает в себя интерпретатор байткода (BCI) для более качественного рендеринга шрифтов, особенно на ЖК-мониторах. Смотрите #Настройка Fontconfig и Настройка шрифтов/Примеры.\n\nХотя Fontconfig является стандартом в современном Linux, некоторые приложения полагаются на оригинальный способ выбора и отображения шрифтов, в X Logical Font Description.\n\n"
    },
    {
      "title": "Пути шрифтов",
      "level": 2,
      "content": "Шрифты, которые будут известны приложениям, должны быть каталогизированы для лёгкого и быстрого доступа.\n\nПути шрифтов, которые Fontconfig использует по умолчанию: /usr/share/fonts/, ~/.local/share/fonts (а также ~/.fonts/ — устаревший). Fontconfig будет сканировать эти каталоги рекурсивно. Для простоты организации и установки рекомендуется использовать эти пути шрифтов, когда добавляете шрифты.\n\nЧтобы увидеть список шрифтов, о которых знает Fontconfig:\n\n```\n$ fc-list ':' file\n```\n\nДоступные форматы вывода описаны в fc-list(1).\n\nПроверьте известные пути шрифтов Xorg, посмотрев свой журнал:\n\n```\n$ grep /fonts ~/.local/share/xorg/Xorg.0.log\n```\n\n- Вы также можете проверить список путей шрифтов, о которых знает Xorg, с помощью команды xset q.\n- Используйте /var/log/Xorg.0.log если Xorg запускается с правами суперпользователя.\n\nИмейте в виду, что Xorg не ищет рекурсивно в каталоге /usr/share/fonts/ как это делает Fontconfig. Чтобы добавить путь, нужно указать полный путь:\n\n```\nSection \"Files\"\n    FontPath     \"/usr/share/fonts/local/\"\nEndSection\n```\n\nТо, как Xorg считывает настройки, описано в разделе Xorg (Русский)#Настройка. Если вы хотите установить пути шрифтов на уровне пользователя, вы можете добавлять и удалять пути шрифтов по умолчанию, добавив следующую строку(и) в ~/.xinitrc:\n\n```\nxset +fp /usr/share/fonts/local/           # Добавляет путь шрифтов в список известных путей шрифтов Xorg'а\nxset -fp /usr/share/fonts/sucky_fonts/     # Удаляет указанный путь шрифта из списка известных путей шрифтов Xorg'а\n```\n\nЧтобы увидеть список шрифтов, о которых знает Xorg, используйте xlsfonts из пакета xorg-xlsfonts.\n\n"
    },
    {
      "title": "Настройка Fontconfig",
      "level": 2,
      "content": "Документация fontconfig доступна в fonts-conf(5).\n\nНастройка может быть сделана для каждого пользователя отдельно, с помощью $XDG_CONFIG_HOME/fontconfig/fonts.conf (обычно это $HOME/.config/fontconfig/fonts.conf), и на глобальном уровне с помощью /etc/fonts/local.conf. Оба эти файла используют один и тот же синтаксис.\n\n- Предустановка 50-user.conf должна быть включена, чтобы пользовательская конфигурация вступила в силу, а предустановка 51-local.conf предназначена для глобальной конфигурации. Включение предустановок описано в разделе #Предварительные установки.\n- Файлы настроек и каталоги: ~/.fonts.conf/, ~/.fonts.conf.d/ и ~/.fontconfig/*.cache-* являются устаревшими и не будут по умолчанию считываться в будущих версиях пакета. Новые пути — $XDG_CONFIG_HOME/fontconfig/fonts.conf, $XDG_CONFIG_HOME/fontconfig/conf.d/NN-name.conf и $XDG_CACHE_HOME/fontconfig/*.cache-* соответственно. Если используется второе расположение, убедитесь в правильном названии файла (где NN состоит из двух цифр, как 00, 10, или 99).\n\nFontconfig собирает все свои настройки в центральном файле (/etc/fonts/fonts.conf). Этот файл перезаписывается в ходе обновления fontconfig, поэтому не следует редактировать его напрямую. Fontconfig-совместимые приложения читают этот файл, чтобы узнать о доступных шрифтах и как они будут отображены. Этот файл представляет собой конгломерат из правил глобальных настроек (/etc/fonts/local.conf), настроенных предустановок в /etc/fonts/conf.d/ и пользовательского файла настроек ($XDG_CONFIG_HOME/fontconfig/fonts.conf). Можно пересобрать настройки fontconfig с помощью fc-cache, но изменения будут применены только для вновь запущенных приложений.\n\nФайлы настроек Fontconfig используют формат XML и обязательный заголовок:\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"urn:fontconfig:fonts.dtd\">\n<fontconfig>\n\n  <!-- поместите настройки сюда -->\n\n</fontconfig>\n```\n\nВ примерах, представленных далее в статье, эти теги опущены для краткости.\n\n"
    },
    {
      "title": "Предварительные установки",
      "level": 3,
      "content": "Предустановки (presets) есть в каталоге /usr/share/fontconfig/conf.avail. Они могут быть включены созданием символической ссылки на них, глобально или для отдельных пользователей, как описано в /etc/fonts/conf.d/README. Эти предустановки переопределят соответствие параметров в соответствующих файлах настроек.\n\nНапример, для включения sub-pixel (суб-пиксельного) RGB отображения глобально:\n\n```\n$ cd /etc/fonts/conf.d\n# ln -s /usr/share/fontconfig/conf.avail/10-sub-pixel-rgb.conf\n```\n\nТоже самое, но для отдельного пользователя:\n\n```\n$ mkdir $XDG_CONFIG_HOME/fontconfig/conf.d\n$ ln -s /usr/share/fontconfig/conf.avail/10-sub-pixel-rgb.conf $XDG_CONFIG_HOME/fontconfig/conf.d\n```\n\n"
    },
    {
      "title": "Сглаживание",
      "level": 3,
      "content": "Растеризация шрифтов преобразует векторные данные шрифта в растровые для отображения на экране. В результате могут появиться ступеньки/зубцы из-за наложения (алиасинга). Чтобы линии воспринимались более гладкими, используют сглаживание (anti-aliasing). Сглаживание включено по умолчанию. Для того, чтобы отключить его:\n\n```\n<match target=\"font\">\n    <edit name=\"antialias\" mode=\"assign\">\n      <bool>false</bool>\n    </edit>\n  </match>\n```\n\n"
    },
    {
      "title": "Хинтинг",
      "level": 3,
      "content": "Хинтинг — это использование математических инструкций для настройки отображения контура шрифта так, чтобы он был на одной линии с растровой сеткой (то есть пиксельной сеткой экрана). Ожидаемый эффект — сделать шрифты на вид более чёткими, чтобы они были более читабельные. Шрифты выравниваются правильно без хинтинга, когда экран имеет 300 DPI. Доступно два типа хинтинга.\n\n"
    },
    {
      "title": "Интерпретатор байт-кода (Byte-Code Interpreter, BCI)",
      "level": 4,
      "content": "При использовании хинтинга BCI инструкции в шрифтах TrueType рендерятся в соответствии с интерпретатором FreeType. Хинтинг BCI прекрасно работает со шрифтами с хорошими инструкциями хинтинга. По умолчанию хинтинг включен. Для его отключения:\n\n```\n<match target=\"font\">\n    <edit name=\"hinting\" mode=\"assign\">\n      <bool>false</bool>\n    </edit>\n  </match>\n```\n\nNote: **40** \n\n- 35 для классического режима (эмулирует Windows 98),\n- 38 для режима «Infinality» (высоконастраиваемый рендеринг, считается медленным и устаревшим),\n- 40 для minimal mode (урезанный Infinality, используется по умолчанию).\n\n"
    },
    {
      "title": "Autohinter (Авто Хинтинг)",
      "level": 4,
      "content": "Autohinter пытается сделать автоматический хинтинг и игнорирует существующую информацию хинтинга. Раньше он использовался по умолчанию, поскольку шрифты TrueType2 были защищены патентами, но теперь срок патентов истёк и использовать Autohinter нет большого смысла. Он может лучше работать со шрифтами, которые поломанные или не содержат информацию по хинтингу, но это будет не оптимально для шрифтов с хорошей информацией хинтинга. К распространённым шрифтам Autohinter в дальейшем не будет полезным. По умолчанию автохинтинг отключен. Чтобы его включить:\n\n```\n<match target=\"font\">\n    <edit name=\"autohint\" mode=\"assign\">\n      <bool>true</bool>\n    </edit>\n  </match>\n```\n\n"
    },
    {
      "title": "Hintstyle (Стиль Хинтинга)",
      "level": 4,
      "content": "Hintstyle — количество изменений шрифта для выравнивания по пиксельной сетке. Значения хинтинга: hintnone (без хинтинга), hintslight (лёгкий хинтинг), hintmedium (средний хинтинг), и hintfull (полный хинтинг). hintslight делает шрифт более нечётким, но лучше сохраняет форму шрифта (смотрите [2]), в то время как hintfull сделает шрифт чётким и хорошо выровняет его по пиксельной сетке, но больше потеряет форму шрифта. hintslight неявно использует autohinter в режиме только по вертикали в пользу информации о родном шрифте для шрифтов не-CFF (.otf).\n\nПо умолчанию используется hintslight. Для того, чтобы изменить его:\n\n```\n<match target=\"font\">\n    <edit name=\"hintstyle\" mode=\"assign\">\n      <const>hintnone</const>\n    </edit>\n  </match>\n```\n\n"
    },
    {
      "title": "Расположение пикселей",
      "level": 3,
      "content": "Большинство современных мониторов использует спецификацию RGB (Red, Green, Blue — Красный, Зелёный, Синий). Fontconfig'у нужно знать тип монитора, чтобы иметь возможность отображать шрифты правильно. Мониторы могут быть: RGB (наиболее распространенный), BGR, V-RGB (вертикальный), или даже V-BGR. Тест монитора можно найти здесь.\n\n```\n<match target=\"font\">\n    <edit name=\"rgba\" mode=\"assign\">\n      <const>rgb</const>\n    </edit>\n  </match>\n```\n\nNote: **RGB** \n\nОтсутствует поддержка необычных субпиксельных раскладок, таких как «Pentile» и «RGBY», которые иногда встречаются на экранах телевизоров и мобильных устройств. Для таких устройств лучше отказаться от субпиксельного рендеринга и полагаться на обычное сглаживание.\n\n"
    },
    {
      "title": "Субпиксельное отображение",
      "level": 3,
      "content": "Субпиксельный рендеринг — это техника улучшения чёткости рендеринга шрифтов путём утроения горизонтального (или вертикального) разрешения за счёт использования субпикселей. На машинах Windows эта техника называется ClearType.\n\nFreeType2 предоставляет два различных типа субпиксельного рендеринга, называемых Harmony и ClearType (FT_CONFIG_OPTION_SUBPIXEL_RENDERING) [3]. Начиная с FreeType 2.10.3, в Arch Linux по умолчанию используется ClearType [4].\n\nПри включении субпиксельного рендеринга ClearType рекомендуется использовать ЖК-фильтр. Субпиксельный рендеринг Harmony не требует установки ЖК-фильтра и при геометрии LCD по умолчанию эквивалентен ClearType с фильтром lcdlight [5]. Как включить ЖК-фильтр и какие он имеет преимущества, описано в следующем разделе.\n\n"
    },
    {
      "title": "LCD filter (ЖК-фильтр)",
      "level": 4,
      "content": "При использовании субпиксельного отображения ClearType необходимо включить ЖК-фильтр, который предназначен для снижения цветной окантовки. Это описано в разделе LCD filtering в справке по FreeType 2 API. Различные варианты описаны в разделе FT_LcdFilter и проиллюстрированы на этой странице теста ЖК-фильтра.\n\nФильтр lcddefault будет работать для большинства пользователей. Другие доступные фильтры, которые могут использоваться в особых случаях: lcdlight; фильтр идеально подходит для шрифтов, которые выглядят слишком жирными или нечеткими, lcdlegacy, оригинальный фильтр Cairo; и lcdnone чтобы отключить его полностью.\n\n```\n<match target=\"font\">\n    <edit name=\"lcdfilter\" mode=\"assign\">\n      <const>lcddefault</const>\n    </edit>\n  </match>\n```\n\n"
    },
    {
      "title": "Расширенная спецификация ЖК-фильтра (LCD filter)",
      "level": 4,
      "content": "Если встроенные ЖК-фильтры не устраивают, можно настроить отображение шрифта очень специфично путём создания пользовательского пакета freetype2 и модификации жёстко закодированных фильтров. Для создания и установки пакетов из исходников можно использовать систему сборки Arch.\n\nСкачайте PKGBUILD для пакета freetype2 и получите файлы сборки, как описано в разделе Система сборки Arch#Получение PKGBUILD.\n\nВключите субпиксельный рендеринг ClearType путём редактирования файла src/freetype-VERSION/include/freetype/config/ftoption.h, раскомментировав в нём макрос FT_CONFIG_OPTION_SUBPIXEL_RENDERING.\n\nОтредактируйте файл src/freetype-VERSION/src/base/ftlcdfil.c и найдите определённые константы default_filter[5]:\n\n```\nstatic const FT_Byte  default_filter[5] =\n    { 0x10, 0x40, 0x70, 0x40, 0x10 };\n```\n\nЭта константа определяет низкочастотный фильтр, применяемый к отображаемому символу. Измените его как требуется (смотрите freetype list discussion). Сохраните файл, соберите и установите пользовательский пакет:\n\n```\n$ makepkg --noextract\n# pacman --remove --nodeps freetype2\n# pacman --upgrade freetype2-VERSION-ARCH.pkg.tar.zstd\n```\n\nПерезапустите X. Теперь фильтр lcddefault должен отобразить шрифты по-другому.\n\n"
    },
    {
      "title": "Пользовательские настройки для определённых шрифтов или стилей шрифтов",
      "level": 3,
      "content": "Авто хинтинг использует сложные методы для отображения шрифтов, но часто делает жирные шрифты слишком широкими. К счастью, решение может быть найдено в отключении авто хинтинга для жирных шрифтов, оставляя авто хинтинг для остальных:\n\n```\n...\n<match target=\"font\">\n    <test name=\"weight\" compare=\"more\">\n        <const>medium</const>\n    </test>\n    <edit name=\"autohint\" mode=\"assign\">\n        <bool>false</bool>\n    </edit>\n</match>\n...\n```\n\nНекоторые шрифты могут плохо выглядеть с хинтингом BCI. Его можно отключить только для этих шрифтов:\n\n```\n...\n<match target=\"font\">\n    <test name=\"family\" qual=\"any\">\n        <string>My Font</string>\n    </test>\n    <edit name=\"hinting\" mode=\"assign\">\n        <bool>false</bool>\n    </edit>\n</match>\n...\n```\n\n"
    },
    {
      "title": "Match",
      "level": 4,
      "content": "Надёжный способ сделать это — добавить фрагмент XML, похожий на тот, как показано ниже. Использование атрибута «binding» (связывания) в примере ниже приведёт к использованию шрифта Gentium в тех местах, где предполагалось использование Georgia:\n\n```\n...\n<match target=\"pattern\">\n  <test qual=\"any\" name=\"family\" compare=\"eq\"><string>Georgia</string></test>\n  <edit name=\"family\" mode=\"assign\" binding=\"same\"><string>Gentium Book Plus</string></edit>\n</match>\n...\n```\n\nВ этом примере атрибут «compare» может иметь значение «eq» (то есть точно равен Georgia), «contains» (например, будет соответствовать Georgia или Georgia Pro) или другие значения. [6]\n\n"
    },
    {
      "title": "Alias",
      "level": 4,
      "content": "Альтернативный подход состоит в установке «предпочтительного» шрифта. Шрифты, соответствующие элементу <family>, редактируются для добавления списка <prefer> семейств перед соответствующим <family>. В следующем примере при вызове шрифта Helvetica будет использоваться Bitstream Vera Sans:\n\n```\n...\n<alias>\n    <family>Helvetica</family>\n    <prefer>\n        <family>Bitstream Vera Sans</family>\n    </prefer>\n</alias>\n...\n```\n\n<alias> также может использоваться для указания резервных шрифтов, когда некоторые глифы отсутствуют. Например, многие версии Helvetica Neue не содержат греческих символов. Пользователь может установить Helvetica Neue и использовать его для латинских символов, а для греческих использовать FreeSans благодаря его сходству с Helvetica. Однако тот же пользователь может установить другой шрифт Noto Sans в качестве шрифта sans-serif по умолчанию. Это можно сделать следующим образом:\n\n```\n...\n<alias>\n    <family>Helvetica Neue LT Pro</family>\n    <prefer>\n        <family>Helvetica Neue LT Pro</family>\n        <family>FreeSans</family>\n    </prefer>\n</alias>\n...\n```\n\nЭто не требуется, если устраивает использование шрифта по умолчанию для отсутствующих глифов.\n\n"
    },
    {
      "title": "Белый список и чёрный список шрифтов",
      "level": 3,
      "content": "Элемент <selectfont> используется в сочетании с элементами <acceptfont> и <rejectfont> — белого списка или чёрного списка шрифтов, используемых для составлении списка и match-тестов. Самый простой и наиболее типичный случай его использования — для отклонения одного шрифта, который должен быть установлен, однако попадает под match-тест для стандартного шрифта и тем самым вызывает проблемы в пользовательских интерфейсах.\n\nСначала получите имя Family (семейства) как указано в самом шрифте:\n\n```\n$ fc-scan .fonts/lklug.ttf --format='%{family}\\n'\n```\n\n```\nLKLUG\n```\n\nЗатем используйте это имя Family в строфе <rejectfont>:\n\n```\n<selectfont>\n    <rejectfont>\n        <pattern>\n            <patelt name=\"family\" >\n                <string>LKLUG</string>\n            </patelt>\n        </pattern>\n    </rejectfont>\n</selectfont>\n```\n\nОбычно, когда оба элемента объединены, <rejectfont> сначала используется в более общем согласовании glob для reject (отклонения) большой группы (таких, как целый каталог), затем после него используется <acceptfont> белый список отдельных шрифтов из большой группы чёрного списка.\n\n```\n<selectfont>\n    <rejectfont>\n        <glob>/usr/share/fonts/OTF/*</glob>\n    </rejectfont>\n    <acceptfont>\n        <pattern>\n            <patelt name=\"family\" >\n                <string>Monaco</string>\n            </patelt>\n        </pattern>\n    </acceptfont>\n</selectfont>\n```\n\n"
    },
    {
      "title": "Отключение растровых шрифтов",
      "level": 3,
      "content": "Чтобы отключить растровые шрифты (которые иногда используются в качестве резервных, из-за чего текст может выглядеть некрасиво), используйте предварительную установку 70-no-bitmaps.conf.\n\nЧтобы отключить встроенные растровые шрифты у всех шрифтов:\n\n```\n~/.config/fontconfig/conf.d/20-no-embedded.conf\n```\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"urn:fontconfig:fonts.dtd\">\n<fontconfig>\n  <match target=\"font\">\n    <edit name=\"embeddedbitmap\" mode=\"assign\">\n      <bool>false</bool>\n    </edit>\n  </match>\n</fontconfig>\n```\n\nЧтобы отключить встроенные растровые шрифты для определённого шрифта:\n\n```\n<match target=\"font\">\n  <test qual=\"any\" name=\"family\">\n    <string>Monaco</string>\n  </test>\n  <edit name=\"embeddedbitmap\">\n    <bool>false</bool>\n  </edit>\n</match>\n```\n\n"
    },
    {
      "title": "Отключить масштабирование растровых шрифтов",
      "level": 3,
      "content": "Чтобы отключить масштабирование растровых шрифтов (которое часто делает их размытыми), удалите /etc/fonts/conf.d/10-scale-bitmap-fonts.conf. Имейте в виду, что это может нарушить масштабирование шрифтов эмодзи, таких как Segoe UI Emoji, сделав их огромными.\n\n"
    },
    {
      "title": "Создать стили для жирных и курсивных «некомплектных» шрифтов",
      "level": 3,
      "content": "FreeType имеет возможность автоматически создавать italic (курсивные) и bold (жирные) стили для шрифтов, которые не имеют их, но только если это явно требуется приложению. Данные программы редко отправляют эти запросы. В этом разделе охватывается принуждение «вручную» генерировать отсутствующие стили.\n\nНачните с редактирования /usr/share/fonts/fonts.cache-1 как описано ниже. Храните изменённую копию в другом файле, поскольку обновление шрифтов с помощью fc-cache будет перезаписывать /usr/share/fonts/fonts.cache-1.\n\nПредположим, что шрифт Dupree установлен:\n\n```\n\"dupree.ttf\" 0 \"Dupree:style=Regular:slant=0:weight=80:width=100:foundry=unknown:index=0:outline=True:итд...\n```\n\nПродублируйте строку, измените style=Regular на style=Bold или любой другой стиль. Также измените slant=0 на slant=100 для italic (курсива), weight=80 на weight=200 для bold (жирного), или объедините их для bold italic (жирного курсива):\n\n```\n\"dupree.ttf\" 0 \"Dupree:style=Bold Italic:slant=100:weight=200:width=100:foundry=unknown:index=0:outline=True:итд...\n```\n\nТеперь добавьте необходимые изменения в $XDG_CONFIG_HOME/fontconfig/fonts.conf:\n\n```\n...\n<match target=\"font\">\n    <test name=\"family\" qual=\"any\">\n        <string>Dupree</string>\n         <!-- другие шрифты .... -->\n     </test>\n     <test name=\"weight\" compare=\"more_eq\"><int>140</int></test>\n     <edit name=\"embolden\" mode=\"assign\"><bool>true</bool></edit>\n</match>\n\n<match target=\"font\">\n    <test name=\"family\" qual=\"any\">\n        <string>Dupree</string>\n        <!-- другие шрифты .... -->\n    </test>\n    <test name=\"slant\" compare=\"more_eq\"><int>80</int></test>\n    <edit name=\"matrix\" mode=\"assign\">\n        <times>\n            <name>matrix</name>\n                <matrix>\n                    <double>1</double><double>0.2</double>\n                    <double>0</double><double>1</double>\n                </matrix>\n        </times>\n    </edit>\n</match>\n...\n```\n\n"
    },
    {
      "title": "Приоритет правил",
      "level": 3,
      "content": "Fontconfig обрабатывает файлы /etc/fonts/conf.d в числовом порядке. Таким образом, правила из файлов 01-aaa.conf и 02-bbb.conf имеют такой же эффект, как если бы один файл 01-aaabbb.conf содержал в себе сначала правила из 01-aaa, а затем правила из 02-bbb.\n\nОбычно это означает, что файлы с меньшим префиксом будут иметь больший приоритет. Однако синтаксис fontconfig гибок и позволяет новому правилу иметь приоритет над существующим. Поэтому рекомендуется выполнить #Запрос текущих настроек, чтобы проверить результат взаимодействия правил.\n\n"
    },
    {
      "title": "Запрос текущих настроек",
      "level": 3,
      "content": "Чтобы узнать, какие настройки вступили в силу, используйте fc-match --verbose. К примеру:\n\n```\n$ fc-match --verbose Sans\n```\n\n```\nfamily: \"DejaVu Sans\"(s)\nhintstyle: 3(i)(s)\nhinting: True(s)\n...\n```\n\nПосмотрите значения чисел в fonts-conf(5). Например. 'hintstyle: 3' означает 'hintfull'\n\n"
    },
    {
      "title": "Приложения без поддержки fontconfig",
      "level": 2,
      "content": "Некоторые приложения, например URxvt, игнорируют настройки fontconfig. Вы можете обойти эту проблему с помощью ~/.Xresources, но он не настолько гибкий как fontconfig. Пример (объяснение параметров есть в разделе #Настройка Fontconfig):\n\n```\n~/.Xresources\n```\n\n```\nXft.autohint: 0\nXft.lcdfilter: lcddefault\nXft.hintstyle: hintslight\nXft.hinting: 1\nXft.antialias: 1\nXft.rgba: rgb\n```\n\nУбедитесь, что настройки загружаются должным образом при запуске X, с помощью команды xrdb -q (для получения дополнительной информации смотрите статью Ресурсы Х).\n\n"
    },
    {
      "title": "Искажённые шрифты",
      "level": 3,
      "content": "Инструкции по работе с дисплеями с высоким или смешанным DPI есть в статье HiDPI (Русский): использование DPI, не соответствующего реальному значению, может привести к нечёткому отображению шрифтов.\n\n"
    },
    {
      "title": "Calibri, Cambria, Monaco, и т. д. не отображаются правильно",
      "level": 3,
      "content": "Некоторые масштабируемые шрифты имеют встроенные растровые версии, которые обычно рендерятся при маленьких размерах. В этом случае использование метрически совместимых шрифтов в качестве замены может улучшить отображение.\n\nТакже можно включить обязательное использование масштабируемых шрифтов для всех размеров путём отключения встроенных растровых шрифтов, немного жертвуя качеством рендеринга.\n\n"
    },
    {
      "title": "Приложения переопределяют hinting",
      "level": 3,
      "content": "Некоторые приложения или среды рабочего стола могут переопределять используемые по умолчанию настройки fontconfig, такие как хинтинг и сглаживание. Это может случиться с GNOME 3, например когда вы используете приложения Qt, как vlc или smplayer. В таких случаях используйте специальную программу для применения настроек. Для GNOME попробуйте gnome-tweaks.\n\n"
    },
    {
      "title": "Приложения не используют hinting из настроек DE",
      "level": 3,
      "content": "Например, в GNOME иногда случается, что Firefox применяет полный хинтинг (full hinting) даже если он установлен на \"none\" в настройках GNOME, что в результате приводит к резким и широким шрифтам. В этом случае вам придётся добавить настройку хинтинга в ваш файл fonts.conf:\n\n```\n<?xml version='1.0'?>\n<!DOCTYPE fontconfig SYSTEM 'urn:fontconfig:fonts.dtd'>\n<fontconfig>\n <match target=\"font\">\n  <edit mode=\"assign\" name=\"hinting\">\n   <bool>false</bool>\n  </edit>\n </match>\n</fontconfig>\n```\n\nВ этом примере хинтинг установлен на \"grayscale\".\n\n"
    },
    {
      "title": "Неправильный hinting в приложениях GTK",
      "level": 3,
      "content": "В некоторых средах рабочего стола, в частности за пределами GNOME и Plasma, некоторые приложения GTK не считывают настройки шрифта корректно. Для решения проблемы установите xsettingsd или xsettingsd-gitAUR и запускайте его при каждом запуске системы. Подробности можно почитать в стате Xsettingsd (Русский) и в xsettingsd wiki. Он может быть настроен следующей общей конфигурацией:\n\n```\n~/.xsettingsd\n```\n\n```\nXft/Hinting 1\nXft/HintStyle \"hintslight\"\nXft/Antialias 1\nXft/RGBA \"rgb\"\n```\n\nЕсли в каких-то приложениях это тоже не работает, попробуйте установить xorg-xrdb и прописать следующие настройки:\n\n```\n~/.Xresources\n```\n\n```\nXft.hinting: 1\nXft.hintstyle: hintslight\nXft.antialias: 1\nXft.rgba: rgb\n```\n\nПосле этого запускайте скрипт xrdb -merge ~/.Xresources при каждой загрузке системы для применения настроек. Смотрите также X resources (Русский) и #Приложения без поддержки fontconfig.\n\n"
    },
    {
      "title": "Хинтинг в приложениях GTK4",
      "level": 3,
      "content": "Программы GTK4 и libadwaita игнорируют настройки хинтинга. Чтобы исправить ситуацию, создайте или измените следующую конфигурацию:\n\n```\n~/.config/gtk-4.0/settings.ini\n```\n\n```\n[Settings]\ngtk-hint-font-metrics=true\n```\n\nСмотрите также GTK documentation and GTK issue 3787.\n\n"
    },
    {
      "title": "Проблема со шрифтом Helvetica в сгенерированных файлах PDF",
      "level": 3,
      "content": "Если следующая команда\n\n```\nfc-match helvetica\n```\n\nвыдаёт\n\n```\nhelvR12-ISO8859-1.pcf.gz: \"Helvetica\" \"Regular\"\n```\n\nто, скорее всего, растровый шрифт, предоставляемый пакетом xorg-fonts-75dpi, будет встроен в PDF-файлы, создаваемые с помощью функций «Печать в файл» или «Экспорт» в различных приложениях. Вероятно, растровый шрифт был установлен как следствие установки всей группы xorg (что обычно НЕ рекомендуется). Для решения проблемы вы можете удалить пакет. Установите gsfonts (Type 1) или tex-gyre-fonts (OpenType) для соответствующей свободной замены Helvetica (и других базовых шрифтов PostScript/PDF).\n\nТакже эта проблема может появиться и при открытии PDF-файла, которому требуется Helvetica, но не имеющего встроенного шрифта для просмотра.\n\n"
    },
    {
      "title": "Отсутствует подчёркивание со шрифтом DejaVu Monospace",
      "level": 3,
      "content": "Начиная с Pango 1.44, символы подчеркивания исчезают при определённых размерах шрифта DejaVu Sans Mono. Обходным решением является использование Liberation Mono в качестве моноширинного шрифта, смотрите #Установка шрифтов по умолчанию или резервных шрифтов.\n\n"
    },
    {
      "title": "Отладка шрифтов FreeType",
      "level": 3,
      "content": "freetype2-demos предоставляет инструменты для отладки конфигурации шрифтов FreeType. ftview — это графический интерфейс, в котором можно настроить параметры рендеринга шрифтов с предварительным просмотром в реальном времени. Например:\n\n```\n$ ftview -e unic -d 1024x768x24 -r 96 10 /usr/share/fonts/noto/NotoSans-Regular.ttf\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Wikipedia:Fontconfig\n- Fonts in X11R6.8.2 - Официальная информация по шрифтам Xorg (Англ.)\n- обзор FreeType 2 (Англ.)\n- Дискуссия Gentoo об отображении шрифтов (Англ.)\n- On slight hinting\n- FreeType 2 API Reference: Controlling FreeType Modules\n\n"
    }
  ]
}