{
  "title": "Font package guidelines (Português)",
  "url": "https://wiki.archlinux.org/title/Font_package_guidelines_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "32-bit – CLR – CMake – Cross – DKMS – Eclipse – Electron – Fonte – Free Pascal – GNOME – Go – Haskell – Java – KDE – Kernel – Lisp – Meson – MinGW – Node.js – Nonfree – OCaml – Perl – PHP – Python – R – Ruby – Rust – Shell – VCS – Web – Wine\n\nEste documento cobre diretrizes e padrões propostos para empacotar PKGBUILDs para Fontes.\n\n"
    },
    {
      "title": "Nomenclatura do pacote",
      "level": 3,
      "content": "- Fontes TTF: ttf-nomedafonte\n- Fontes OTF: otf-nomedafonte\n\nSe a fonte é uma fonte variável, adicione o sufixo -variable.\n\n"
    },
    {
      "title": "Descrição do pacote",
      "level": 3,
      "content": "A descrição do pacote deve conter pelo menos a palavra font e que tipo de fonte é: sans-serif, serif ou monospace.\n\n"
    },
    {
      "title": "Arquitetura",
      "level": 3,
      "content": "Fontes não independem da arquitetura. Use arch=(any).\n\n"
    },
    {
      "title": "Dependências",
      "level": 3,
      "content": "As fontes não dependem de nada. Muitos pacotes nos repositórios, no entanto, incluem fontconfig e xorg-mkfontscale como dependências. Isso era necessário quando os pacotes de fontes precisavam usar scripts de instalação para atualizar o cache da fonte – muito trabalho duplicado agora realizado por hooks do pacman. Se você instalar o fontconfig ou o xorg-mkfontscale, todas as fontes existentes em /usr/share/fonts/ serão armazenadas em cache, tornando desnecessário forçar as pessoas a usar fontconfig ou mkfontscale.\n\n"
    },
    {
      "title": "Fornece",
      "level": 3,
      "content": "Muitos aplicativos contam com o pacote virtual ttf-font. Se sua família de fontes atender aos critérios, adicione provides=('ttf-font').\n\n"
    },
    {
      "title": "Fonte",
      "level": 3,
      "content": "Veja se uma fonte está disponível nas seguintes fontes nesta ordem:\n\n- uma plataforma de hospedagem de código como o GitHub ou um site oficial\n- Google Fonts: https://fonts.google.com/download?family=''Nome''\n- Font Squirrel, FontSpace, Font Library, 1001 Free Fonts, DaFont\n\n"
    },
    {
      "title": "Pacote",
      "level": 2,
      "content": "O seguinte trecho é um exemplo para uma fonte OTF sob a OFL (SIL Open Font License). Se a fonte contiver muitos arquivos, considere usar $pkgname em vez de OTF para o diretório de destino:\n\n```\npackage() {\n  install -Dm644 -t \"$pkgdir/usr/share/fonts/OTF\" \"caminho/da/fonte/*.otf\"\n  install -Dm644 -t \"$pkgdir/usr/share/licenses/$pkgname\" \"caminho/da/licença/OFL.txt\"\n}\n```\n\n"
    },
    {
      "title": "Exemplos de pacotes",
      "level": 2,
      "content": "- ttf-merriweather-sansAUR – baixa arquivos de uma consolidação específica do GitHub porque o upstream não fornece versões\n- otf-commissionerAUR – pacote dividido com versão em OTF, TTF e variável\n\n"
    }
  ]
}