{
  "title": "Fonts (Italiano)",
  "url": "https://wiki.archlinux.org/title/Fonts_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Font configuration\n- List of applications/Utilities#Font viewers\n- List of applications/Multimedia#Font editors\n- Java Runtime Environment fonts\n- Linux console#Fonts\n- Metric-compatible fonts\n- Microsoft fonts\n\nFrom Wikipedia:Computer font:\n\nNote that certain font licenses may impose some legal limitations.\n\n"
    },
    {
      "title": "Font formats",
      "level": 2,
      "content": "Most computer fonts used today are in either bitmap or outline data formats.\n\n"
    },
    {
      "title": "Bitmap formats",
      "level": 3,
      "content": "- Bitmap Distribution Format (BDF) by Adobe\n- OpenType Bitmap Fonts (OTB)\n- PC Screen Font (PSF) used by the Kernel for console fonts, not supported by Xorg (for Unicode PSF files the extension is psfu)\n- Portable Compiled Format (PCF) by Xorg\n\nThese formats can also be gzipped. See #Bitmap for the available bitmap fonts.\n\n"
    },
    {
      "title": "Outline formats",
      "level": 3,
      "content": "- PostScript fonts by Adobe – has various formats, e.g: Printer Font ASCII (PFA) and Printer Font Binary (PFB)\n- TrueType by Apple and Microsoft (file extension: ttf)\n- OpenType by Microsoft, built on TrueType (file extensions: otf, ttf)\n\nFor most purposes, the technical differences between TrueType and OpenType can be ignored.\n\n"
    },
    {
      "title": "Other formats",
      "level": 3,
      "content": "The font editing application FontForge (fontforge) can store fonts in its native text-based format—Spline Font Database (.sfd).\n\nThe typesetting application TeX Live and its companion font software Metafont traditionally renders characters using its own methods. Some file extensions used for fonts from these two programs are *pk, *gf, mf and vf. Modern versions can also use TrueType and OpenType fonts.\n\nThe SVG format also has its own font description method.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "There are various methods for installing fonts.\n\n"
    },
    {
      "title": "Pacman",
      "level": 3,
      "content": "Fonts and font collections in the enabled repositories can be installed using pacman.\n\nAvailable fonts may be found by querying packages (e.g. for font or ttf).\n\n"
    },
    {
      "title": "Creating a package",
      "level": 3,
      "content": "You should give pacman the ability to manage your fonts, which is done by creating an Arch package. These can also be shared with the community in the AUR. The packages to install fonts are particularly similar; see Font packaging guidelines.\n\nThe family name of a font file can be acquired with the use of fc-query for example: fc-query -f '%{family[0]}\\n' /path/to/file. The formatting is described in FcPatternFormat(3).\n\n"
    },
    {
      "title": "Manual installation",
      "level": 3,
      "content": "The recommended way of adding fonts that are not in the repositories of your system is described in #Creating a package. This gives pacman the ability to remove or update them at a later time.\n\nAlternatively, fonts can be installed manually:\n\n- For a single user, install fonts to ~/.local/share/fonts/. In many cases this suffices, unless you run graphical applications as other users. In the past ~/.fonts/ was used, but is now deprecated.\n- For system-wide (all users) installation, place your fonts under /usr/local/share/fonts/. You may need to create the directory first: mkdir -p /usr/local/share/fonts. /usr/share/fonts/ is under the purview of the package manager, and should not be modified manually.\n\n- In many cases this suffices, unless you run graphical applications as other users.\n- In the past ~/.fonts/ was used, but is now deprecated.\n\n- You may need to create the directory first: mkdir -p /usr/local/share/fonts.\n- /usr/share/fonts/ is under the purview of the package manager, and should not be modified manually.\n\nThe creation of a subdirectory structure is up to the user, and varies among Linux distributions. For clarity, it is good to keep each font in its own directory. Fontconfig will search its default paths recursively, ensuring nested files get picked up.\n\nAn example structure might be:\n\n```\n/usr/local/share/fonts/\n├── otf\n│   └── SourceCodeVariable\n│       ├── SourceCodeVariable-Italic.otf\n│       └── SourceCodeVariable-Roman.otf\n└── ttf\n    ├── AnonymousPro\n    │   ├── Anonymous-Pro-B.ttf\n    │   ├── Anonymous-Pro-I.ttf\n    │   └── Anonymous-Pro.ttf\n    └── CascadiaCode\n        ├── CascadiaCode-Bold.ttf\n        ├── CascadiaCode-Light.ttf\n        └── CascadiaCode-Regular.ttf\n```\n\nThe font files need to have sufficient read permissions for all users, i.e. at least chmod 444 for files, and 555 for directories.\n\nFor the Xserver to load fonts directly (as opposed to the use of a font server), the directory for your newly added font must be added with a FontPath entry. This entry is located in the Files section of your Xorg configuration file (e.g. /etc/X11/xorg.conf or /etc/xorg.conf). See #Older applications for more detail.\n\nFinally, update the Fontconfig cache (usually unnecessary as software using the Fontconfig library does this):\n\n```\n$ fc-cache\n```\n\n"
    },
    {
      "title": "Older applications",
      "level": 3,
      "content": "With older applications that do not support Fontconfig (e.g. GTK 1.x applications, and xfontsel) the index will need to be created in the font directory:\n\n```\n$ mkfontscale\n$ mkfontdir\n```\n\nOr to include more than one folder with one command:\n\n```\n$ for dir in /font/dir1/ /font/dir2/; do xset +fp $dir; done && xset fp rehash\n```\n\nOr if fonts were installed in a different sub-folders under the e.g. /usr/share/fonts:\n\n```\n$ for dir in * ; do if [  -d  \"$dir\"  ]; then cd \"$dir\";xset +fp \"$PWD\" ;mkfontscale; mkfontdir;cd .. ;fi; done && xset fp rehash\n```\n\nAt times the X server may fail to load the fonts directory and you will need to rescan all the fonts.dir files:\n\n```\n# xset +fp /usr/share/fonts/misc # Inform the X server of new directories\n# xset fp rehash                # Forces a new rescan\n```\n\nTo check that the font(s) is included:\n\n```\n$ xlsfonts | grep fontname\n```\n\nThis can also be set globally in /etc/X11/xorg.conf or /etc/X11/xorg.conf.d.\n\nHere is an example of the section that must be added to /etc/X11/xorg.conf. Add or remove paths based on your particular font requirements.\n\n```\n# Let X.Org know about the custom font directories\nSection \"Files\"\n    FontPath    \"/usr/share/fonts/100dpi\"\n    FontPath    \"/usr/share/fonts/75dpi\"\n    FontPath    \"/usr/share/fonts/cantarell\"\n    FontPath    \"/usr/share/fonts/cyrillic\"\n    FontPath    \"/usr/share/fonts/encodings\"\n    FontPath    \"/usr/share/fonts/misc\"\n    FontPath    \"/usr/share/fonts/truetype\"\n    FontPath    \"/usr/share/fonts/TTF\"\n    FontPath    \"/usr/share/fonts/util\"\nEndSection\n```\n\n"
    },
    {
      "title": "Pango warnings",
      "level": 3,
      "content": "When Pango is in use on your system it will read from Fontconfig to sort out where to source fonts.\n\n```\n(process:5741): Pango-WARNING **: failed to choose a font, expect ugly output. engine-type='PangoRenderFc', script='common'\n(process:5741): Pango-WARNING **: failed to choose a font, expect ugly output. engine-type='PangoRenderFc', script='latin'\n```\n\nIf you are seeing errors similar to this and/or seeing blocks instead of characters in your application then you need to add fonts and update the font cache. This example uses the ttf-liberation fonts to illustrate the solution (after successful installation of the package) and runs as root to enable them system-wide.\n\n```\n# fc-cache\n```\n\n```\n/usr/share/fonts: caching, new cache contents: 0 fonts, 3 dirs\n/usr/share/fonts/TTF: caching, new cache contents: 16 fonts, 0 dirs\n/usr/share/fonts/encodings: caching, new cache contents: 0 fonts, 1 dirs\n/usr/share/fonts/encodings/large: caching, new cache contents: 0 fonts, 0 dirs\n/usr/share/fonts/util: caching, new cache contents: 0 fonts, 0 dirs\n/var/cache/fontconfig: cleaning cache directory\nfc-cache: succeeded\n```\n\nYou can test for a default font being set like so:\n\n```\n$ fc-match\n```\n\n```\nLiberationMono-Regular.ttf: \"Liberation Mono\" \"Regular\"\n```\n\n"
    },
    {
      "title": "Font packages",
      "level": 2,
      "content": "This is a selective list that includes many font packages from the AUR along with those in the official repositories.\n\n"
    },
    {
      "title": "Bitmap",
      "level": 3,
      "content": "- Default 8×16\n- Berry (pcf-spectrum-berryAUR) – 8px\n- Dina (dina-fontAUR) – 6pt, 8pt, 9pt, 10pt, monospaced, based on Proggy\n- Efont (efont-unicode-bdfAUR) – 10px, 12px, 14px, 16px, 24px, normal, bold and italic\n- GNU Unifont (bdf-unifontAUR) – 8×16, 16×16 (most extensive Unicode coverage of any font)\n- Gohu (gohufontAUR) – 11px, 14px, normal and bold\n- Kissinger 2 – 8×16, 16×16 (Unifont competitor)\n- Lime (artwiz-fontsAUR)\n- ProFont (ttf-profont-iixAUR) – 10px, 11px, 12px, 15px, 17px, 22px, 29px, normal\n- Proggy (proggyfontsAUR) – Has different variants\n- Tamsyn (tamsyn-fontAUR)\n- Tewi (bdf-tewi-gitAUR)\n\nWorks with Pango 1.44 and later:\n\n- Cozette (cozette-otbAUR)\n- Gohufont (gohufont-otbAUR)\n- Misc Fixed (xorg-fonts-misc-otbAUR)\n- ProFont (profont-otbAUR) – OpenType Bitmap (OTB) variant of ProFont\n- Terminus (terminus-font)\n- More OTB fonts on the AUR\n\n"
    },
    {
      "title": "Families",
      "level": 4,
      "content": "Packages providing a base font set:\n\n- Bitstream Vera (ttf-bitstream-vera) – Includes sans-serif, serif, and monospaced fonts. Bitstream Vera Sans is metrically compatible with Verdana.\n- Croscore fonts (ttf-croscore) – Metric-compatible fonts for Helvetica, Times, Courier and Georgia — named Arimo, Tinos, Cousine and Gelasio respectively, shipped with Chrome OS\n- DejaVu fonts (ttf-dejavu) – Bitstream Vera modified for greater Unicode coverage\n- Droid (ttf-droid) – Default font for older Android versions with wide Unicode coverage including CJK but not symbols and emojis\n- GNU FreeFont (gnu-free-fonts) – Includes three fonts — FreeSans, FreeSerif and FreeMono — that are clones of Helvetica, Times, and Courier respectively. Most Latin characters are from URW Ghostscript fonts (e.g., Nimbus Roman, Nimbus Sans), non-Latin characters come from many sources with good Unicode coverage, but do not include CJK.\n- IBM Plex (ttf-ibm-plex) – Serif, sans-serif, condensed sans-serif and monospace with true italics\n- Input (ttf-input) – Fonts for code from DJR & Font Bureau\n- Liberation fonts (ttf-liberation) – Metric-compatible fonts for Helvetica, Times, and Courier, but are visually different\n- Libertinus Fonts (otf-libertinus) – Forks of Linux Libertine and Linux Biolinum, with extended math support, see #Math\n- Microsoft fonts (ttf-ms-win11AUR) – Windows 11 fonts (Windows 11 installation or installation medium needed)\n- Noto fonts (noto-fonts) – Google font family with full Unicode coverage if installed with its emoji and CJK optional dependencies\n\nPackages not providing a base font set:\n\n- B612 (ttf-b612AUR) – Open-source font family (sans and mono) sponsored by Airbus, designed for comfort of reading on aircraft cockpit screens\n- Ghostscript (gsfonts) – The Ghostscript fonts donated by URW, includes clones of Helvetica, Times, Courier, and others. GNU FreeFont (gnu-free-fonts) and TeX Gyre fonts (tex-gyre-fonts) are both partially based on the Ghostscript fonts\n- Luxi fonts (font-bh-ttfAUR) – X.Org font family similar to Lucida\n- Roboto (ttf-roboto) – Default font for newer Android versions where it is complemented by Noto fonts for languages not supported like CJK\n- TeX Gyre fonts (tex-gyre-fonts) – Created by the Polish GUST association of TeX users, mostly based on URW Ghostscript fonts, includes clones of Helvetica, Times, Courier, and others. Some have their own math companion fonts, see #Math.\n- Ubuntu font family (ttf-ubuntu-font-family)\n\nLegacy Microsoft font packages:\n\n- Microsoft fonts (ttf-ms-fontsAUR) – Andalé Mono, Courier New, Arial, Arial Black, Comic Sans, Impact, Lucida Sans, Microsoft Sans Serif, Trebuchet, Verdana, Georgia, Times New Roman\n- Vista fonts (ttf-vista-fontsAUR) – Consolas, Calibri, Candara, Corbel, Cambria, Constantia\n\n"
    },
    {
      "title": "Monospaced",
      "level": 4,
      "content": "Fonts supporting \"programming ligatures\" (e.g., the display of the \"->\" sequence as a double-width \"⟶\" glyph) are identified below with a ⟶ sign. For more monospaced fonts, also see #Bitmap and #Families.\n\n- Anonymous Pro (ttf-anonymous-pro, included in ttf-google-fonts-gitAUR)\n- Cascadia Code (ttf-cascadia-code) ⟶ – Designed to enhance the look of the Windows Terminal, with programming ligatures, released by Microsoft under the Open Font License\n- Courier Prime (ttf-courier-primeAUR) – Courier alternative which has been supplemented by a sans serif font and a version optimized for programming, released under the Open Font License\n- Envy Code R (ttf-envy-code-rAUR) – Font designed for programmers\n- Fantasque Sans Mono (ttf-fantasque-sans-mono, otf-fantasque-sans-mono)\n- Fira Mono (ttf-fira-mono, otf-fira-mono) – Font optimized for small screens and adopted by Mozilla for the Firefox OS\n- Fira Code (ttf-fira-code) ⟶ – Extension of Fira Mono with programming ligatures for common programming multi-character combinations\n- Hack (ttf-hack) - Open-source monospaced font, used as the default in KDE Plasma\n- Hasklig (otf-haskligAUR) - A code font with monospaced ligatures\n- Hermit (otf-hermit) - A font for programmers, by a programmer\n- Inconsolata (ttf-inconsolata, included in ttf-google-fonts-gitAUR) – Designed for source code listing, inspired by Consolas and Letter Gothic\n- Inconsolata-g (ttf-inconsolata-gAUR) – Adds some programmer-friendly modifications\n- Iosevka (ttc-iosevka) ⟶ – Slender sans-serif and slab-serif typeface inspired by Pragmata Pro, M+ and PF DIN Mono, designed to be the ideal font for programming; it supports programming ligatures and over 2000 latin, greek, cyrillic, phonetic and PowerLine glyphs\n- JetBrains Mono (ttf-jetbrains-mono) ⟶ – Free and open-source font developed by JetBrains\n- Lilex (ttf-lilexAUR) ⟶ – Free and open-source modern programming font containing a set of ligatures for common programming multi-character combinations\n- Lucida Typewriter (included in package jreAUR)\n- Menlo (ttf-mesloAUR) – Customized version of Apple's Menlo Regular font for OS X with larger vertical gap spacing\n- Monaco (ttf-monacoAUR) – Proprietary font designed by Apple for OS X\n- Monofur (ttf-monofur)\n- Mononoki (ttf-mononokiAUR) – A font for programming and code review\n- Roboto Mono (ttf-roboto-mono) – Based on Roboto (ttf-roboto)\n- Source Code Pro (adobe-source-code-pro-fonts, included in ttf-google-fonts-gitAUR)\n- Comic Mono (ttf-comic-mono-gitAUR) A legible monospace font… the very typeface you’ve been trained to recognize since childhood, ergo Comic Sans\n\nRelevant websites:\n\n- Trevor Lowing's font list\n- Slant: What are the best programming fonts?\n- Stack Overflow: Recommended fonts for programming\n- Programming Fonts - Test Drive\n- Programming Fonts Compare\n- Coding Font by Typogram\n\n"
    },
    {
      "title": "Sans-serif",
      "level": 4,
      "content": "- Andika (ttf-andikaAUR)\n- Cantarell (cantarell-fonts) – Default font supplied with GNOME, it is required by the GNOME and GTK 3 related packages\n- DMCA Sans Serif (ttf-dmcasansserifAUR) – General purpose sans serif font metric-compatible with Microsoft Consolas\n- Fira Sans (ttf-fira-sans, otf-fira-sans) – Sans serif font designed by Erik Spiekermann for Mozilla and the Firefox OS. Fira Mono and Fira Code are monospaced companions of Fira Sans (see #Monospaced).\n- FreeSans (gnu-free-fonts) – Visually similar to Helvetica but metrically different, see #Families\n- Inter (inter-font) – A geometric neo-grotesque font designed for user interfaces\n- Jost* (otf-jostAUR) – An open-source typeface based on Futura\n- Liberation Sans (ttf-liberation) – Metric-compatible with Helvetica but visually distinct, see #Families\n- Montserrat (otf-montserrat) – An open-source font that shares similarities with Gotham and Proxima Nova\n- Nunito (ttf-nunito) – An open-source font with rounded terminal, hence shares similarities with Gotham Rounded and Proxima Soft\n- Open Sans (ttf-opensans) – Sans serif font commissioned by Google, based on Droid sans but slightly wider\n- PT Sans (ttf-google-fonts-gitAUR) – 3 major variations: normal, narrow, and caption - Unicode: Latin, Cyrillic\n- Source Sans (adobe-source-sans-fonts) – Open-source sans serif font from Adobe with a design based on News Gothic and Franklin Gothic\n- Tahoma (Wine Replacement) (ttf-tahomaAUR) – Open-source substitute for Tahoma developed by the Wine project. It was created because many Windows applications expected Tahoma to be available.\n\n"
    },
    {
      "title": "Serif",
      "level": 4,
      "content": "- Bitstream Charter (ttf-bitstream-charterAUR, otf-bitstream-charterAUR) – Originally a commercial font designed by Matthew Carter. A version was released under a free license and later converted to modern formats (provided as the aforementioned packages).\n- Bodoni* (otf-bodoniAUR) – An open-source Bodoni revival\n- Crimson (otf-crimson) – An open-source font that shares similarities with Minion\n- EB Garamond (ebgaramond-otfAUR) – An open-source Garamond revival, the aforementioned package is the version developed by Octavio Pardo\n- FreeSerif (gnu-free-fonts) – Visually similar to Times New Roman but metrically different, see #Families\n- Gentium (ttf-gentium-plus) – Unicode, comprehensive support for Latin, Greek, Cyrillic, International Phonetic Alphabet (IPA) characters\n- Heuristica (ttf-heuristicaAUR) – Based on a version of Utopia that was released under a free license\n- Liberation Serif (ttf-liberation) – Metric-compatible with Times New Roman but visually distinct, see #Families\n- Libre Baskerville (ttf-librebaskervilleAUR) – An open-source Baskerville revival designed by Impallari Type\n- BaskervilleF (otf-baskervillefAUR) – A PDF-optimized serif font, fork of Libre Baskerville, with added Bold Italic style\n- Libre Caslon (otf-libre-caslonAUR) – An open-source Caslon revival designed by Impallari Type\n- Linux Libertine (ttf-linux-libertine) – Developed as a substitute of Times New Roman, but different both visually and metrically (the metric differences are more notable for italic and bold fonts). Its fork Libertinus Fonts (otf-libertinus) is the version that is under active development.\n- TeX Gyre Termes (tex-gyre-fonts) – Visually similar to Times New Roman (but there are some minor metric differences), see #Families\n- Tinos (ttf-croscore) – Metric-compatible with Times New Roman but visually distinct (and looks similar to Liberation Serif), see #Families\n\n"
    },
    {
      "title": "Handwriting",
      "level": 4,
      "content": "- ttf-nothingyoucoulddoAUR – Handwriting of a photographer\n- ttf-indieflowerAUR – Handwriting sans-serif font with bubbly and rounded edges\n- ttf-pacificoAUR – Brush script handwriting font which was inspired by the 1950s American surf culture and expanded to Cyrillic\n- otf-londrinaAUR – Handwriting font inspired from the streets of Sao Paulo, Brazil\n- otf-teslaAUR – Script font based on a reconstruction of Nikola Tesla's handwriting\n- ttf-architects-daughterAUR – Font incorporating the graphic, squared look of architectural writing and the natural feel of daily handwriting\n\n"
    },
    {
      "title": "Unsorted",
      "level": 4,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\n- all-repository-fontsAUR – Meta package for all fonts in the official repositories\n- ttf-cheapskateAUR – Font collection from dustismo.com\n- ttf-google-fonts-gitAUR – A huge collection of free fonts (including Ubuntu, Inconsolata, Roboto, etc.) Note: Your font dialog might get very long as more than 100 fonts will be added.\n- ttf-junicode – Junius font containing almost complete medieval Latin script glyphs\n- ttf-mph-2b-damaseAUR – Covers full plane 1 and several scripts\n- ttf-opendyslexicAUR – OpenDyslexic font for readers with dyslexia\n- xorg-fonts-type1 – IBM Courier and Adobe Utopia sets of PostScript fonts\n\n"
    },
    {
      "title": "Ancient Scripts",
      "level": 4,
      "content": "- ttf-ancient-fontsAUR – Font containing Unicode symbols for Aegean, Egyptian, Cuneiform, Anatolian, Maya, and Analecta scripts\n\n"
    },
    {
      "title": "Arabic",
      "level": 4,
      "content": "See Localization/Arabic#Fonts.\n\n"
    },
    {
      "title": "Bengali",
      "level": 4,
      "content": "Read Localization/Bengali#Fonts for details.\n\n"
    },
    {
      "title": "Braille",
      "level": 4,
      "content": "- ttf-ubrailleAUR – Font containing Unicode symbols for braille\n\n"
    },
    {
      "title": "Chinese, Japanese, Korean, Vietnamese",
      "level": 4,
      "content": "Adobe Source Han fonts and Noto CJK fonts have identical glyphs and metrics, but with different branding since the project was commissioned by both Adobe and Google.\n\nBoth collections comprehensively support Simplified Chinese, Traditional Chinese, Japanese, and Korean, with a consistent design and look. Noto Sans CJK fonts lack localized menu names, that are not required, but may make fonts more user-friendly for customers whose native language is that of the target language of the font.\n\n- Adobe Source Han fonts Source Han Sans (adobe-source-han-sans-otc-fonts) Source Han Serif (adobe-source-han-serif-otc-fonts)\n- Noto CJK fonts (noto-fonts-cjk) – Includes both Noto Sans CJK and Noto Serif CJK\n\n- Source Han Sans (adobe-source-han-sans-otc-fonts)\n- Source Han Serif (adobe-source-han-serif-otc-fonts)\n\nSee Localization/Chinese#Fonts.\n\nSee Localization/Japanese#Fonts.\n\nSee Localization/Korean#Fonts.\n\n- ttf-hannom – Vietnamese TrueType font for chữ Nôm characters\n\n"
    },
    {
      "title": "Cyrillic",
      "level": 4,
      "content": "See also #Latin script.\n\n- ttf-paratypeAUR – Font family by ParaType: sans, serif, mono, extended cyrillic and latin, OFL license\n- otf-russkopisAUR – A free OpenType cursive font for Cyrillic script\n\n"
    },
    {
      "title": "Greek",
      "level": 4,
      "content": "Almost all Unicode fonts contain the Greek character set (polytonic included). Some additional font packages, which might not contain the complete Unicode set but utilize high quality Greek (and Latin, of course) typefaces are:\n\n- otf-gfsAUR – Selection of OpenType fonts from the Greek Font Society\n- ttf-mgopenAUR – Professional TrueType fonts from Magenta\n- ttf-sbl-greekAUR – SBL Greek, created by the Society of Biblical Literature (SBL)\n- ttf-sbl-biblitAUR – SBL BibLit, includes characters from both SBL Greek and SBL Hebrew\n\n"
    },
    {
      "title": "Hebrew",
      "level": 4,
      "content": "- opensiddur-hebrew-fontsAUR – Large collection of Open-source licensed Hebrew fonts. There are also few Latin, Greek, Cyrillic, Arabic, and Amharic.\n- culmusAUR – Nice collection of free Hebrew fonts\n- alefbetAUR – 4 Hebrew fonts (at the moment): the commonly used \"David Libre\", the handwriting font \"Gveret Levin\", \"Varela Round\" and \"open-sans\"\n- ttf-ms-fontsAUR – contains Arial and other fonts\n- ttf-sbl-hebrewAUR – SBL Hebrew, created by the Society of Biblical Literature (SBL)\n- ttf-sbl-biblitAUR – SBL BibLit, includes characters from both SBL Hebrew and SBL Greek\n\n- Cousine (ttf-croscore) – part of the Chrome OS Core Fonts\n- Everson Mono (ttf-everson-monoAUR) – is lighter and a bit looser than Courier, with wide range of supported Unicode blocks\n- FreeMono (gnu-free-fonts) – part of the GNU FreeFont\n\n"
    },
    {
      "title": "Indic",
      "level": 4,
      "content": "See Localization/Indic#Fonts.\n\n"
    },
    {
      "title": "Khmer",
      "level": 4,
      "content": "- ttf-khmer – Font covering glyphs for Khmer language\n- Hanuman (ttf-google-fonts-gitAUR)\n\n"
    },
    {
      "title": "Mongolic and Tungusic",
      "level": 4,
      "content": "- ttf-abkaiAUR – Fonts for Sibe, Manchu and Daur scripts (incomplete, currently in development)\n\n"
    },
    {
      "title": "Persian",
      "level": 4,
      "content": "Arabic fonts like ttf-scheherazade-new also cover Persian letters. A list of Arabic fonts can be checked in Localization/Arabic#Fonts.\n\n- persian-fontsAUR – Meta package for installing all Persian fonts in AUR\n- borna-fontsAUR – Borna Rayaneh Co. Persian B font series\n- iran-nastaliq-fontsAUR – A free Unicode calligraphic Persian font\n- iranian-fontsAUR – Iranian-Sans and Iranian-Serif Persian font family\n- ir-standard-fontsAUR – Iran Supreme Council of Information and Communication Technology (SCICT) standard Persian fonts\n- persian-hm-ftx-fontsAUR – A Persian font series derived from X Series 2, Metafont and FarsiTeX fonts with Kashida feature\n- persian-hm-xs2-fontsAUR – A Persian font series derived from X Series 2 fonts with Kashida feature\n- gandom-fontsAUR, parastoo-fontsAUR, sahel-fontsAUR, samim-fontsAUR, shabnam-fontsAUR, tanha-fontsAUR, vazirmatn-fontsAUR, vazir-code-fontsAUR – Beautiful Persian fonts made by Saber RastiKerdar\n- ttf-yasAUR – The Yas Persian font series (with hollow zero)\n- ttf-x2AUR – Free fonts with support for Persian, Arabic, Urdu, Pashto, Dari, Uzbek, Kurdish, Uighur, old Turkish (Ottoman) and modern Turkish (Roman)\n\n"
    },
    {
      "title": "Tai–Kadai",
      "level": 4,
      "content": "- fonts-tlwgAUR – Collection of scalable Thai fonts\n- ttf-google-thaiAUR – High-quality Thai fonts from Google and new improvement for Thai National Fonts\n- ttf-laoAUR – Lao TTF font (Phetsarath_OT)\n\n"
    },
    {
      "title": "Tibeto-Burman",
      "level": 4,
      "content": "- ttf-tibetan-machine – Tibetan Machine TTFont\n- ttf-sil-padaukAUR – Unicode font that supports the many diverse languages that use the Myanmar script\n\n"
    },
    {
      "title": "Emoji and symbols",
      "level": 3,
      "content": "A section of the Unicode standard is designated for pictographic characters called \"emoji\".\n\nEmoji fonts come in different formats: CBDT/CBLC (Google), SBIX (Apple), COLR/CPAL (Microsoft), SVG (Mozilla/Adobe).\n\nEmojis should work out of the box once you have at least one emoji font installed of a supported format. However, some of the emoji fonts encode their glyphs as large fixed-size bitmaps and thus, for the purpose of displaying at the intended size, rely on bitmap font downscaling, which is enabled by default.\n\nEmoji font fallback according to the standard requires extra code to handle emoji.\n\nFor the discovery and input of Emoji see List of applications/Utilities#Text input.\n\nTable content:\nSoftware | CBDT/CBLC | SBIX | COLR/CPAL | SVG | Emoji font fallback\nFreeType | Yes | Yes | Yes | No | –\nChromium | FreeType | – | Yes\nFirefox | FreeType | Yes | No, see Firefox#Font troubleshooting for workaround.\nPango | FreeType | – | Yes\nQt | FreeType | – | No [1] [2] [3]\nWebKitGTK | FreeType | – | Yes\n\n- Font Awesome (ttf-font-awesome) – the iconic SVG font\n- JoyPixels (ttf-joypixelsAUR) – formerly EmojiOne, part of Emoji as a Service, proprietary\n- Nerd Fonts (nerd-fonts) – developer targeted fonts patched with a high number of icons\n- Noto Color Emoji (noto-fonts-emoji) – Google open-source emoji font, color\n- Noto Emoji (ttf-noto-emoji-monochromeAUR) – Google open-source emoji font, black and white\n- OpenMoji (otf-openmojiAUR) – German University of Design in Schwäbisch Gmünd open-source emoji\n- Symbola[dead link 2025-03-15 ⓘ] (ttf-symbola-freeAUR) – part of Unicode Fonts for Ancient Scripts; version 9 was the last free version, current version is licensed as \"pay for any use\"\n- Twemoji (Twitter Emoji) (ttf-twemojiAUR) – emoji for everyone, originally created by Twitter\n- Twitter Color Emoji (ttf-twemoji-colorAUR) – SVG-OpenType (SVGinOT) font built from the Twemoji artwork; this font also contains black and white emoji, and the original Twemoji font contains color emoji too\n\nKaomoji are sometimes referred to as \"Japanese emoticons\" and are composed of characters from various character sets, including CJK and Indic fonts. The following set of packages covers most of existing kaomoji:\n\n- gnu-free-fonts\n- ttf-arphic-uming\n- ttf-indic-otf\n\nTeranoptia (ttf-teranoptia-furiaeAUR) – is a typeface without letters (an illustrative font), a peculiar contraption that allows you to imagine chimeric creatures just by typing letters with your keyboard.\n\n"
    },
    {
      "title": "Math",
      "level": 3,
      "content": "- Computer Modern (ttf-cm-unicodeAUR, otf-cm-unicodeAUR)\n- Computer Modern (otf-latin-modern, otf-latinmodern-math) – Improved version used in LaTeX\n- Libertinus Math (otf-libertinus) – A math font based on Libertinus Serif which is a fork of Linux Libertine (ttf-linux-libertine)\n- STIX fonts (otf-stixAUR) – STIX is designed to be a royalty-free alternative that resembles Times New Roman. The current version is called STIX Two and includes a math companion named STIX Two Math.\n- TeX Gyre math fonts (tex-gyre-math-fontsAUR) – Math companions of TeX Gyre fonts (see #Families). Notably, TeX Gyre Termes Math is a math companion of Times New Roman.\n\nAdditionally, texlive-basic and texlive-fontsextra contain many math fonts such as Latin Modern Math and STIX fonts. See TeX Live#Making fonts available to Fontconfig for configuration.\n\n"
    },
    {
      "title": "Other operating system fonts",
      "level": 3,
      "content": "- ttf-mac-fontsAUR - Apple MacOS TrueType fonts\n\n"
    },
    {
      "title": "Font alias",
      "level": 2,
      "content": "Note: **This article or section is a candidate for merging with Fontconfig.** This article or section is a candidate for merging with Fontconfig.\n\nThis article or section is a candidate for merging with Fontconfig.\n\nThere are several font aliases which represent other fonts in order that applications may use similar fonts. The most common aliases are: serif for a font of the serif type (e.g. DejaVu Serif); sans-serif for a font of the sans-serif type (e.g. DejaVu Sans); and monospace for a monospaced font (e.g. DejaVu Sans Mono). However, the fonts which these aliases represent may vary and the relationship is often not shown in font management tools, such as those found in KDE Plasma and other desktop environments.\n\nTo reverse an alias and find which font it is representing, run:\n\n```\n$ fc-match monospace\n```\n\n```\nDejaVuSansMono.ttf: \"DejaVu Sans Mono\" \"Book\"\n```\n\nIn this case, DejaVuSansMono.ttf is the font represented by the monospace alias.\n\n"
    },
    {
      "title": "Fallback font order",
      "level": 2,
      "content": "Note: **This article or section is a candidate for merging with Fontconfig.** This article or section is a candidate for merging with Fontconfig.\n\nThis article or section is a candidate for merging with Fontconfig.\n\nFontconfig automatically chooses a font that matches the current requirement. That is to say, if one is looking at a window containing English and Chinese for example, it will switch to another font for the Chinese text if the default one does not support it.\n\nFontconfig lets every user configure the order they want via $XDG_CONFIG_HOME/fontconfig/fonts.conf. If you want a particular Chinese font to be selected after your favorite Serif font, your file would look like this:\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n<alias>\n   <family>serif</family>\n   <prefer>\n     <family>Your favorite Latin Serif font name</family>\n     <family>Your Chinese font name</family>\n   </prefer>\n </alias>\n</fontconfig>\n```\n\n- If you use a Chinese locale, set LC_LANG to und to make this work. Otherwise both English and Chinese text will be rendered in the Chinese font.\n- If you want to see a list of fonts against ambiguous patterns (i.e. which might not match exactly) such as a generic family names, you can use fc-match --sort or fc-match --all.\n- fc-match --sort does not show a font if its Unicode coverage is provided by already shown font, see fc-match(1) and FcFontSort(3).\n- After changing the configuration run fc-match --all serif | head to verify your fallback font is set correctly.\n\nYou can add a section for sans-serif and monospace as well.\n\nFor more information, have a look at the Fontconfig manual. See also Font configuration#Set default or fallback fonts.\n\n"
    },
    {
      "title": "List installed fonts for a particular language",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Fontconfig.** This article or section is a candidate for merging with Fontconfig.\n\nThis article or section is a candidate for merging with Fontconfig.\n\nApplications select and display fonts depending upon Fontconfig preferences and available font glyphs for Unicode text. To list installed fonts for a particular language, issue a command fc-list :lang=\"two letter language code\". For instance, to list installed Arabic fonts or fonts supporting Arabic glyphs:\n\n```\n$ fc-list -f '%{file}\\n' :lang=ar\n```\n\n```\n/usr/share/fonts/TTF/FreeMono.ttf\n/usr/share/fonts/TTF/DejaVuSansCondensed.ttf\n/usr/share/fonts/truetype/custom/DroidKufi-Bold.ttf\n/usr/share/fonts/TTF/DejaVuSansMono.ttf\n/usr/share/fonts/TTF/FreeSerif.ttf\n```\n\n"
    },
    {
      "title": "List installed fonts for a particular Unicode character",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Fontconfig.** This article or section is a candidate for merging with Fontconfig.\n\nThis article or section is a candidate for merging with Fontconfig.\n\nTo list all fonts supporting a particular Unicode codepoint—black upwards equilateral arrowhead (⮝) in this case:\n\n```\n$ fc-list :charset=2B9D\n```\n\nfc-list does not normalize requests, it is going to list fonts which exactly matches. It is not suitable for generic family names (like monospace) and other ambiguous patterns. To search for monospaced fonts supporting a particular Unicode codepoint you could try the following:\n\n```\n$ fc-match --sort monospace:charset=2B9D | head\n```\n\nbut you have to interpret the result on your own. fc-match by its nature does not guarantee that fonts in the output list are monospaced, nor that they contain the codepoint in question at all.\n\n"
    },
    {
      "title": "Application-specific font cache",
      "level": 3,
      "content": "Matplotlib (python-matplotlib) uses its own font cache, so after updating fonts, be sure to remove ~/.matplotlib/fontList.cache, ~/.cache/matplotlib/fontList.cache, ~/.sage/matplotlib-1.2.1/fontList.cache, etc. so it will regenerate its cache and find the new fonts [5].\n\n"
    },
    {
      "title": "Bidirectional text support",
      "level": 3,
      "content": "See Bidirectional text for troubleshooting problems related to RTL languages.\n\n"
    },
    {
      "title": "Braille font not displaying correctly inside terminals",
      "level": 3,
      "content": "If braille characters in terminals exhibit rendering issues, try installing a braille font and uninstalling gnu-free-fonts.\n\n"
    },
    {
      "title": "Emacs",
      "level": 4,
      "content": "Emacs calculates sizes differently than standard Linux desktop applications, and Emacs packages do not all use the same config format, so if points or raw pixel size doesn't work, try using the other value.\n\n"
    },
    {
      "title": "Visual Studio Code",
      "level": 4,
      "content": "Change the setting Editor: Experimental Whitespace Rendering from \"svg\" to \"font\" if your monospace fonts have problems scaling certain characters correctly. This is known to help with \"Terminus (TTF)\" and \"IBM 3270\" fonts.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- State of Text Rendering\n- Font Library — Fonts under free licenses\n\n"
    }
  ]
}