{
  "title": "Fonts (Español)",
  "url": "https://wiki.archlinux.org/title/Fonts_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-05-31** \n\nArtículos relacionados\n\n- Configuración de fuentes\n- Linux console#Fonts\n- Java Runtime Environment fonts\n- Metric-compatible fonts\n- Microsoft fonts\n\nDe Fuentes del ordenador (En ingles): \"Una tipografía del ordenador (o fuente) es un archivo de datos electrónicos que contiene un conjunto de glifos, caracteres, o símbolos como dingbats.\"\n\nNote que ciertas licencias de fuentes pueden imponer ciertas limitaciones legales.\n\n"
    },
    {
      "title": "Formatos de fuente",
      "level": 2,
      "content": "Muchos ordenadores que usan fuentes hoy en día están en un formato mapa de bits (bitmap) o en formato contorno (outline).\n\n"
    },
    {
      "title": "Formato bitmap",
      "level": 3,
      "content": "- Distribución del formato mapa de bits (inglés) (BDF) por Adobe.\n- Formato compilado portable (inglés) (PCF) por Xorg.\n- Fuentes de pantalla PC (PSF) usado por el Kernel para las fuentes de la consola, no soportada por Xorg (la extension de los archivos Unicode PSF es psfu)\n\nEstos formatos también pueden estar comprimidos. Vea #Bitmap para ver las fuentes bitmap disponibles.\n\n"
    },
    {
      "title": "Formato de contorno",
      "level": 3,
      "content": "- Fuentes PostScript por Adobe – con varios formatos, por ejemplo: Fuente ASCII de impresora (PFA) y fuente binaria de impresora (PFB)\n- TrueType por Apple y Microsoft (extensión: ttf)\n- OpenType por Microsoft, construido sobre TrueType (extensiones: otf, ttf)\n\nPara la mayoría de casos, la diferencia técnica entre TrueType y OpenType puede ignorarse.\n\n"
    },
    {
      "title": "Otros Formatos",
      "level": 3,
      "content": "La aplicación de composición TeX y su software complementario, Metafuente, tradicionalmente renderiza caracteres utilizando sus propios métodos. Algunas de estas extensiones utilizadas desde estos dos programas que son *pk, *gf, mf y vf. Las versiones modernas también pueden utilizar fuentes TrueType y OpenType.\n\nFontForge (fontforge), un editor de fuentes, puede guardar fuentes en su propio formato basado en texto, sfd, base de datos de fuentes spline (spline font database).\n\nEl formato SGV tiene también su propio método para describir fuentes.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Hay varios métodos para instalar fuentes.\n\n"
    },
    {
      "title": "Pacman",
      "level": 3,
      "content": "Fuentes y colecciones de fuentes se pueden instalar con pacman en repositorios habilitados.\n\nLas fuentes disponibles se pueden encontrar buscando paquetes (Por ej. font o ttf).\n\n"
    },
    {
      "title": "Crear un paquete",
      "level": 3,
      "content": "Debería dejar a pacman la habilidad de manejar sus fuentes, que se hace creando un paquete de Arch. Este se puede compartir con la comunidad a través del AUR. Los paquetes para instalar fuentes son particularmente similares. Vea guia de empaquetación de fuentes (en inglés).\n\nEl nombre de familia de un archivo de fuente se puede adquirir utilizando fc-query por ejemplo: fc-query -f '%{family[0]}\\n' /path/to/file. El formato se describe en FcPatternFormat(3).\n\n"
    },
    {
      "title": "Instalación manual",
      "level": 3,
      "content": "La forma recomendada para añadir fuentes al sistema que no están en los repositorios está descrito en #Crear un paquete. Esto le da a pacman la habilidad de quitar o actualizar después de un tiempo. De todas formas las fuentes también se pueden instalar manualmente.\n\nPara instalar fuentes en todo el sistema (disponible para todos los usuarios), mueve la carpeta al directorio /usr/share/fonts. Todos los usuarios tienen que poder leer el archivo, utilice chmod para establecer los permisos correctos (es decir al menos 0444 para archivos y 0555 para carpetas). Para instalar las fuentes solo para un único usuario, utilice ~/.local/share/fonts/ (~/.fonts/ está obsoleto).\n\nPara cargar las fuentes directamente en Xserver (lo contrario a utilizar un servidor de fuentes) el directorio recientemente añadido tiene que incluirse en la entrada FontPath. Esta entrada se localiza en la sección Archivos de su archivo de configuración Xorg (por ej. /etc/X11/xorg.conf o /etc/xorg.conf). vea #Aplicaciones antiguas para más detalles.\n\nDespués actualice la cache de fuente de fontconfig: (normalmente no es necesario ya que la librería de fontconfig lo hace)\n\n```\n$ fc-cache\n```\n\n"
    },
    {
      "title": "Aplicaciones antiguas",
      "level": 3,
      "content": "Con aplicaciones antiguas que no soportan fontconfig (por ej. Aplicaciones GTK 1.x, y xfontsel) se necesita crear el índice en el directorio de la fuente:\n\n```\n$ mkfontscale\n$ mkfontdir\n```\n\nO incluir más de una carpeta con un comando:\n\n```\n$ for dir in /font/dir1/ /font/dir2/; do xset +fp $dir; done && xset fp rehash\n```\n\nO si la fuente está instalado en una sub-carpeta diferente dentro de por ej. /usr/share/fonts:\n\n```\n$ for dir in * ; do if [  -d  \"$dir\"  ]; then cd \"$dir\";xset +fp \"$PWD\" ;mkfontscale; mkfontdir;cd .. ;fi; done && xset fp rehash\n```\n\nPuede que a veces el servidor X puede fallar al cargar el directorio de las fuentes y necesites volver a escanear todos los archivos de fonts.dir:\n\n```\n# xset +fp /usr/share/fonts/misc # Informa al servidor X de los nuevos directorios\n# xset fp rehash                # Fuerza un escaneo nuevo\n```\n\nPara comprobar que la o las fuentes están incluidas:\n\n```\n$ xlsfonts | grep fontname\n```\n\nTambién puede establecerse globalmente en /etc/X11/xorg.conf o /etc/X11/xorg.conf.d.\n\nAquí hay un ejemplo de la sección que ha de ser añadida a /etc/X11/xorg.conf. Añada o quite paths basado en los particulares requisitos de su fuente.\n\n```\n# Deje que X.Org conozca los directorios personalizados de fuente\nSection \"Files\"\n    FontPath    \"/usr/share/fonts/100dpi\"\n    FontPath    \"/usr/share/fonts/75dpi\"\n    FontPath    \"/usr/share/fonts/cantarell\"\n    FontPath    \"/usr/share/fonts/cyrillic\"\n    FontPath    \"/usr/share/fonts/encodings\"\n    FontPath    \"/usr/share/fonts/misc\"\n    FontPath    \"/usr/share/fonts/truetype\"\n    FontPath    \"/usr/share/fonts/TTF\"\n    FontPath    \"/usr/share/fonts/util\"\nEndSection\n```\n\n"
    },
    {
      "title": "Advertencias sobre Pango",
      "level": 3,
      "content": "Cuando Pango se está utilizando en su sistema él leerá desde fontconfig para saber de donde obtener las fuentes.\n\n```\n(process:5741): Pango-WARNING **: failed to choose a font, expect ugly output. engine-type='PangoRenderFc', script='common'\n(process:5741): Pango-WARNING **: failed to choose a font, expect ugly output. engine-type='PangoRenderFc', script='latin'\n```\n\nSi usted ha visto errores similares y/o vee bloques en vez de caracteres en su aplicación necesita añadir las fuentes y actualizar font cache. En este ejemplo se utiliza la fuente ttf-liberation para mostrar la solución (después de una instalación exitosa del paquete) y ejecute como root para habilitarlo para todos los usuarios.\n\n```\n# fc-cache\n```\n\n```\n/usr/share/fonts: caching, new cache contents: 0 fonts, 3 dirs\n/usr/share/fonts/TTF: caching, new cache contents: 16 fonts, 0 dirs\n/usr/share/fonts/encodings: caching, new cache contents: 0 fonts, 1 dirs\n/usr/share/fonts/encodings/large: caching, new cache contents: 0 fonts, 0 dirs\n/usr/share/fonts/util: caching, new cache contents: 0 fonts, 0 dirs\n/var/cache/fontconfig: cleaning cache directory\nfc-cache: succeeded\n```\n\nPuedes comprobar si una fuente por defecto está configurada como tal:\n\n```\n$ fc-match\n```\n\n```\nLiberationMono-Regular.ttf: \"Liberation Mono\" \"Regular\"\n```\n\n"
    },
    {
      "title": "Paquetes de fuente",
      "level": 2,
      "content": "Esta es una lista selectiva que incluye muchos paquetes de fuentes del AUR junto con los repositorios oficiales. Las fuentes que tiene soporte Unicode están estiquetadas con \"Unicode\", vea el proyecto o la Wikipedia para más detalles.\n\nEl script Archfonts Python se puede utilizar para generar una visión general de todas las fuentes TTF encontradas en los repositorios oficiales / AUR (la generación de la imagen está hecha utilizando ttf2pngAUR).\n\n"
    },
    {
      "title": "Bitmap",
      "level": 3,
      "content": "- Por defecto 8x16.\n- Berry (pcf-spectrum-berryAUR) - 8px.\n- Dina (dina-fontAUR) – 6pt, 8pt, 9pt, 10pt, mono espaciado , basada en Proggy.\n- Efont (efont-unicode-bdfAUR) – 10px, 12px, 14px, 16px, 24px, normal, negrita y itálica.\n- Gohu (gohufontAUR) – 11px, 14px, normal y negrita.\n- Lime (artwiz-fontsAUR).\n- ProFont (ttf-profont-iixAUR) – 10px, 11px, 12px, 15px, 17px, 22px, 29px, normal.\n- Proggy (proggyfontsAUR) – tiene diferentes variantes.\n- Tamsyn (tamsyn-fontAUR).\n- Terminus (terminus-font).\n- Tewi (bdf-tewi-gitAUR).\n- Unifont (Covetura Unicode más extensa que cualquier fuente) (bdf-unifontAUR).\n\nFuncionan con pango 1.44:\n\n- Terminus (terminus-font)\n- ProFont (profont-otbAUR) - OpenType Bitmap (OTB) variante de ProFont.\n- Misc Fijo xorg-fonts-misc-otbAUR.\n- Más otb fuentes en el AUR.\n\n"
    },
    {
      "title": "Familias",
      "level": 4,
      "content": "- Luxi fonts (font-bh-ttfAUR) – Fuentes Luxi X.Org.\n- Bitstream Vera (ttf-bitstream-vera) – serif, sans-serif, y mono espaciada.\n- Courier Prime (ttf-courier-primeAUR) – Fuente alternativa Courier optimizada para las pantallas.\n- Croscore fonts (ttf-croscore) – Sustituto de Google para Arial de Window, Times New Roman, y Courier New.\n- DejaVu (ttf-dejavu) – Bitstream Vera modificado para una mayor cobertura de Unicode.\n- Droid (ttf-droid) – Fuente por defecto de las versiones antiguas de Android.\n- Roboto (ttf-roboto) – Fuente por defecto de las versiones nuevas de Android.\n- Google Noto (noto-fonts) – Unicode\n- Liberation fonts (ttf-liberation) – Fuente libre compatible con la métrica que sustituye las fuentes Arial, Arial Narrow, Times New Roman y Courier New encontradas en Windows y productos de Microsoft Office.\n- IBM Plex (ttf-ibm-plex) – serif, sans-serif, sans-serif condensada y monoespaciada con cursiva real.\n- Ubuntu (ttf-ubuntu-font-family)\n- Microsoft fonts (ttf-ms-win10AUR) – Fuentes de Windows 10.\n\nPaquetes de fuentes licenciadas por Microsoft:\n\n- Microsoft fonts (ttf-ms-fontsAUR) – Andalé Mono, Courier New, Arial, Arial Black, Comic Sans, Impact, Lucida Sans, Microsoft Sans Serif, Trebuchet, Verdana, Georgia, Times New Roman\n- Vista fonts (ttf-vista-fontsAUR) – Consolas, Calibri, Candara, Corbel, Cambria, Constantia\n\n"
    },
    {
      "title": "Mono espacio",
      "level": 4,
      "content": "Para más fuentes mono espaciada vea #Bitmap y #Familias.\n\n- Anonymous Pro (ttf-anonymous-pro, incluido en ttf-google-fonts-gitAUR).\n- Cascadia Code (ttf-cascadia-code) – con ligaduras de programación.\n- Envy Code R (ttf-envy-code-rAUR).\n- Fantasque Sans Mono (ttf-fantasque-sans-mono, otf-fantasque-sans-mono).\n- Fira Mono (ttf-fira-mono, otf-fira-mono) – diseñado para Firefox OS.\n- Fira Code (ttf-fira-code) – con ligaduras de programación.\n- FreeMono (gnu-free-fonts) - Unicode.\n- Hack (ttf-hack) - fuente mono espaciada de código abierto, utilizada por defecto en KDE Plasma.\n- Inconsolata (ttf-inconsolata, incluida en ttf-google-fonts-gitAUR) - inspirado por Consolas.\n- Inconsolata-g (ttf-inconsolata-gAUR) - añade algunas modificaciones familiares para el programador.\n- Iosevka (ttf-iosevkaAUR) – Un esbelto tipo de letra sans-serif y slab-serif inspirado por Pragmata Pro, M+ y PF DIN Mono, diseñado para ser la fuente ideal para programar. Soporta ligaduras de programación y alrededor de 2000 glifos latinos, griegos, cirílicos, fonéticos y PowerLine.\n- Lucida Typewriter (incluida en el paquete jreAUR).\n- Menlo (derivado: ttf-mesloAUR) - fuente mono espaciada por defecto de OS X.\n- Monaco (ttf-monacoAUR) - fuente propietaria diseñada por Apple para OS X.\n- Monofur (ttf-monofur)\n- Mononoki (ttf-mononokiAUR)\n- Source Code Pro (adobe-source-code-pro-fonts incluido en ttf-google-fonts-gitAUR)\n\nWebs relevantes:\n\n- Dan Benjamin's Top 10 fuentes de programación.\n- Lista de fuentes de Trevor Lowing .\n- Slant: ¿Cuales son las mejores fuentes de programación?.\n- Stack Overflow: Fuentes recomendadas para programar.\n- Fuentes de programación - Pruebe Drive.\n- Fuentes de programación Compare.\n\n"
    },
    {
      "title": "Sans-serif",
      "level": 4,
      "content": "- Andika (ttf-andikaAUR).\n- FreeSans (gnu-free-fonts) - Unicode.\n- Inter UI (inter-font) – diseñada para las interfaces de usuario.\n- Jost* (otf-jostAUR) - Tipo de letra de código abierto basado en Futura.\n- Linux Biolinum (ttf-linux-libertine) – sustituto libre para Times New Roman.\n- PT Sans (ttf-google-fonts-gitAUR) - tres pricipales variantes: normal, estrecho, y subtítulo - Unicode: latín, cirílico.\n- Source Sans (adobe-source-sans-fonts)\n- Tahoma (ttf-tahomaAUR)\n\n"
    },
    {
      "title": "Serif",
      "level": 4,
      "content": "- Bodoni* (otf-bodoniAUR) - Regreso de la fuente Bodoni de código abierto.\n- EB Garamond (ebgaramond-otfAUR) - Regreso de la fuente Garamond de código abierto.\n- FreeSerif (gnu-free-fonts) - Unicode.\n- Gentium (ttf-gentium-plus) - Unicode: latín, griego cirílico, hebreo.\n- Linux Libertine (ttf-linux-libertine) - Unicode: latín, griego cirílico, hebreo.\n\n"
    },
    {
      "title": "Sin clasificación",
      "level": 4,
      "content": "- ttf-cheapskateAUR - Coleccion de fuentes de dustismo.com.\n- ttf-junicode - Fuente Junius que contiene casi todos los script y glifos medivales.\n- ttf-mph-2b-damaseAUR - Cubre el primer plano completo y muchos scripts.\n- xorg-fonts-type1 - Conjuntos IBM Courier y Adobe Utopia del tipo de letra PostScript.\n- all-repository-fontsAUR - Meta paquete para todas las fuentes de los repositorios oficiales.\n- ttf-google-fonts-gitAUR - una enorme colección de fuentes libres (incluye Ubuntu, Inconsolata, Roboto, etc.) - Nota: Su diálogo de fuentes puede ser muy grande ya que se añadirán más de cien fuentes.\n\n"
    },
    {
      "title": "Escritura antigua",
      "level": 4,
      "content": "- ttf-ancient-fontsAUR - Fuentes que contienen simbolos Unicode para las escrituras egeo, egipcio, cuneiforme, anatolian, maya y analecta.\n\n"
    },
    {
      "title": "Árabe",
      "level": 4,
      "content": "- ttf-amiriAUR - Un tipo de letra clásico en Naskh, estilo pionero de Amiria Press.\n- ttf-arabeyes-fontsAUR - Colección de fuentes árabes libres.\n- ttf-qurancomplex-fontsAUR - Fuentes de El complejo de impresión del gran Corán Rey Fahd en al-Madinah al-Munawwarah.\n- ttf-sil-lateefAUR - Fuente árabe Unicode desde SIL SIL.\n- ttf-scheherazade-new - Fuente árabe Unicode desde SIL. (Alternativa de la fuente árabe tradicional).\n\n"
    },
    {
      "title": "Braille",
      "level": 4,
      "content": "- ttf-ubrailleAUR - Fuente que contiene símbolos Unicode para el braille.\n\n"
    },
    {
      "title": "Chino, japonés, coreano, vietnamita",
      "level": 4,
      "content": "- Fuentes Adobe Source Han - Una gran colección de fuentes con un soporte comprensible de chino simplificado, chino tradicional, japones, y coreano, con un diseño y aspecto consistente. adobe-source-han-sans-otc-fonts - Sans fonts. adobe-source-han-serif-otc-fonts - Serif fonts.\n\n- adobe-source-han-sans-otc-fonts - Sans fonts.\n- adobe-source-han-serif-otc-fonts - Serif fonts.\n\n- noto-fonts-cjk - Otra gran colección de fuentes con un soporte comprensible de chino simplificado, chino tradicional, japones, y coreano, con un diseño y aspecto consistente. Actualmente es una versión renombrada de adobe-source-han-sans-otc-fonts.\n\nVea Localization (Español)/Chinese (Español)#Fuentes.\n\nVea Localization/Japanese#Fonts.\n\nVea Localization/Korean#Fonts.\n\n- ttf-hannom - Fuente vietnamita TrueType font para los caracteres chữ Nôm.\n\n"
    },
    {
      "title": "Cirílico",
      "level": 4,
      "content": "Vea también #Escritura latina\n\n- ttf-paratypeAUR - Familia de fuente por ParaType: sans, serif, mono, cirílico extendido y latín, licencia OFL.\n- otf-russkopisAUR - Una fuente libre cursiva OpenType para la escritura cirílica.\n\n"
    },
    {
      "title": "Griego",
      "level": 4,
      "content": "Casi todas las fuentes Unicode contienen el conjunto de caracteres griegos (politónico incluido). Estas fuentes adicionales puede que no tengan el conjunto completo de caracteres Unicode pero utiliza una gran calidad en los caracteres griegos (y en el latín, por supuesto).\n\n- otf-gfsAUR - Selección de fuentes de OpenType de la sociedad griega de fuentes.\n- ttf-mgopenAUR - Fuentes profesionales TrueType por Magenta.\n\n"
    },
    {
      "title": "Hebreo",
      "level": 4,
      "content": "- opensiddur-hebrew-fontsAUR - Gran colección de fuentes hebreas con licencia de código abierto.\n- culmusAUR - Una buena colección de fuentes hebreas de código abierto. También hay algunas fuentes latinas, griegas, cirílicas, arábicas y amáricos.\n\n"
    },
    {
      "title": "Índico",
      "level": 4,
      "content": "Vea Localization/Indic#Fonts.\n\n"
    },
    {
      "title": "Camboyano",
      "level": 4,
      "content": "- ttf-khmer - Fuente que cubre los glifos del lenguaje camboyano.\n- Hanuman[enlace roto 2025-03-15] (ttf-google-fonts-gitAUR)\n\n"
    },
    {
      "title": "Mongol y tunguses",
      "level": 4,
      "content": "- ttf-abkaiAUR - Fuentes para las escrituras sibe, smnchu y daur (incompleto, aún en desarrollo).\n\n"
    },
    {
      "title": "Persa",
      "level": 4,
      "content": "- persian-fontsAUR - Meta-paquete para instalar todas las fuentes persas del AUR.\n- borna-fontsAUR - Serie de fuentes persa B Borna Rayaneh Co..\n- iran-nastaliq-fontsAUR - Fuente caligráfica libre Unicode persa.\n- iranian-fontsAUR - Familia Iranian-Sans e Iranian-Serif de fuentes persa.\n- ir-standard-fontsAUR - Fuentes persas estándar del Consejo Supremo de Tecnologías de la Información y la Comunicación de Irán (SCICT).\n- persian-hm-ftx-fontsAUR - Series de fuentes persa derivado de X Series 2, Metafont y Fuentes FarsiTeX con la característica kashida.\n- persian-hm-xs2-fontsAUR - Series de fuentes persa derivado de X Series 2 con la característica kashida.\n- gandom-fontsAUR, parastoo-fontsAUR, sahel-fontsAUR, samim-fontsAUR, shabnam-fontsAUR, tanha-fontsAUR, vazirmatn-fontsAUR, vazir-code-fontsAUR - Bonitas fuentes persa hecho por Saber RastiKerdar.\n- ttf-yasAUR - Serie de fuente persa Yas (con hueco cero).\n- ttf-x2AUR - Fuentes libres con soporte para persa, árabe, urdu, pashto, dari, uzbeko, kurdo, uigur, turco antiguo (otomano) y turco moderno (romano).\n\n"
    },
    {
      "title": "Tai–Kadai",
      "level": 4,
      "content": "- fonts-tlwgAUR - Colección de fuentes escalables tailandesas.\n- ttf-laoAUR - Fuente TTF Lao (Phetsarath_OT)\n\n"
    },
    {
      "title": "Tibeto-Burman",
      "level": 4,
      "content": "- ttf-tibetan-machine - Fuente TTF Tibetan Machine.\n- ttf-sil-padaukAUR - Fuente Unicode que admite las numerosas y diversas lenguas que utilizan la escritura de Myanmar.\n\n"
    },
    {
      "title": "Emoji y símbolos",
      "level": 3,
      "content": "Las fuentes Emoji vienen en diferentes formatos: CBDT/CBLC (Google), SBIX (Apple), COLR/CPAL (Microsoft), SVG (Mozilla/Adobe).\n\nLos emojis deben funcionar sin ninguna configuración adicional si tiene al menos una fuente emoji, de los formatos soportados, instalada. Sin embargo la representación de emojis (en inglés), de acuerdo con los requisitos estandar, requiere de un código adicional para manejarlos. Para obligar el uso de la fuente emoji vea Font configuration (Español)#Obligar fuente de emoticonos.\n\nTable content:\nSoftware | CBDT/CBLC | SBIX | COLR/CPAL | SVG | Representación | Vea también\nFreetype | Sí | Sí | Sí | No | – | –\nPango | Freetype | Sí | [1]\nWebKitGTK | Freetype | Sí | –\nQt | Freetype | No | –\nChromium | Freetype | Siguiente versión | –\nFirefox | Freetype | Sí | No | Firefox#Font troubleshooting\n\nCBDT/CBLC:\n\n- noto-fonts-emoji — Emoji 12.1 de código abierto de Google.\n- ttf-joypixelsAUR — Emoji 12.1 propietario del creador EmojiOne.\n- ttf-twemojiAUR — Emoji 13.0 de código abierto de Twitter.\n\nSVG:\n\n- otf-openmojiAUR — Emoji 12.1. de código abierto de la universidad de diseño de Alemania Schwäbisch Gmünd.\n- ttf-twemoji-colorAUR — Emoji 12.0 de código abierto de Twitter.\n\nContorno solo:\n\n- ttf-symbolaAUR — proporciona muchos símbolos Unicode, incluido emoji.\n\nKaomoji a veces como \"emoticonos japoneses\" están compuestos por caracteres de varios conjuntos, incluido CJK y fuentes índicas. Por ejemplo, estos paquetes proporcionan muchos kaomoji existentes: gnu-free-fonts, ttf-arphic-uming, y ttf-indic-otf.\n\n"
    },
    {
      "title": "Matemáticas",
      "level": 3,
      "content": "- ttf-cm-unicodeAUR, otf-cm-unicodeAUR - Computación moderna (inglés) (de la fama de TeX).\n- otf-latin-modern, otf-latinmodern-math - Versión mejorada de fuentes computacionales modernas usadas en LaTeX.\n- otf-stixAUR - Versión independiente, una de las más recientes de STIX.\n\ntexlive-basic y texlive-fontsextra contiene muchas fuentes matemáticas como la matemática moderna latina y STIX Fonts. Vea Hacer que las fuentes estén disponibles en Fontconfig (en inglés) para la configuración.\n\n"
    },
    {
      "title": "Fuentes de otros sistemas operativos",
      "level": 3,
      "content": "- ttf-mac-fontsAUR - Fuentes de TrueType Apple MacOS.\n\nVea Fuentes métricamente compatibles (inglés), que muestra las alternativas para las Fuentes de Microsoft (inglés).\n\n"
    },
    {
      "title": "Orden de fuentes alternativas",
      "level": 2,
      "content": "Automáticamente fontconfig selecciona una fuente que cumpla con los requisitos de ese momento. Es decir, que si una ventana contiene inglés y chino, fontconfig cambiará de fuente para el chino si la que está por defecto no lo soporta.\n\nFontconfig permite que cada usuario configure el orden a través de $XDG_CONFIG_HOME/fontconfig/fonts.conf. Si prefiere que una fuente particular se seleccione antes que su fuente Serif favorita, el archivo queda así:\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n<alias>\n   <family>serif</family>\n   <prefer>\n     <family>El nombre de su fuente serif favorita</family>\n     <family>El nombre de su fuente china</family>\n   </prefer>\n </alias>\n</fontconfig>\n```\n\nTambién se puede añadir una sección para sans-serif y monospace. Para más información. eche un vistazo al manual de fontconfig.\n\nVea también Establecer o reemplazar las fuentes por defecto.\n\n"
    },
    {
      "title": "Alias de fuente",
      "level": 2,
      "content": "Hay varios alias de fuentes que representa a otras fuentes con la intención de que las aplicaciones utilicen fuentes similares. Los alias más comunes son: serif para las fuentes de tipo serif (p.ej. DejaVu Serif); sans-serif para las fuentes del tipo sans-serif (p.ej. DejaVu Sans); y monospace para las fuentes mono-espaciadas (p.ej. DejaVu Sans Mono). Sin embargo, el aspecto de las fuentes que representan puede variar y la relación no se observa en las herramientas de gestión de fuentes, como las que se encuentran en KDE y otros entornos de escritorio.\n\nPara invertir un alias y encontrar qué fuente es la que representa, ejecute:\n\n```\n$ fc-match monospace\n```\n\n```\nDejaVuSansMono.ttf: \"DejaVu Sans Mono\" \"Book\"\n```\n\nEn este caso, DejaVuSansMono.ttf es la fuente representada por el alias de monospace.\n\n"
    },
    {
      "title": "Listar todas las fuentes instaladas",
      "level": 3,
      "content": "Puede utilizar el siguiente comando para listar todas las fuentes instaladas fontconfig que están disponibles en su sistema.\n\n```\n$ fc-list\n```\n\n"
    },
    {
      "title": "Listar las fuentes instaladas de un lenguaje particular",
      "level": 3,
      "content": "Las aplicaciones y navegadores selecciona y muestra fuentes dependiendo de la configuración de fontconfig y de los glifos disponibles para el texto Unicode. Para listar las fuentes instaladas de un lenguaje particular, ejecute fc-list :lang=\"\"two letter language code\"\". Por ejemplo, para listar las fuentes árabes o las que soportan glifos árabes instaladas:\n\n```\n$ fc-list -f '%{file}\\n' :lang=ar\n```\n\n```\n/usr/share/fonts/TTF/FreeMono.ttf\n/usr/share/fonts/TTF/DejaVuSansCondensed.ttf\n/usr/share/fonts/truetype/custom/DroidKufi-Bold.ttf\n/usr/share/fonts/TTF/DejaVuSansMono.ttf\n/usr/share/fonts/TTF/FreeSerif.ttf\n```\n\n"
    },
    {
      "title": "Listar las fuentes instaladas de un caracter Unicode particular",
      "level": 3,
      "content": "Para buscar fuentes monoespaciadas que soporten un punto de código en particular:\n\n```\n$ fc-match -s monospace:charset=1F4A9\n```\n\n"
    },
    {
      "title": "Establecer la fuente del terminal sobre la marcha",
      "level": 3,
      "content": "Para los emuladores de terminal que usan X resources, p.ej. xterm o rxvt-unicode, las fuentes se pueden establecer utilizando secuencias de escape. Especificamente, echo -e \"\\033]710;$font\\007\" para cambier la fuente normal (*font en ~/.Xresources), y reemplazarla 710 con 711, 712, y 713 para cambiar las fuentes *boldFont, *italicFont, y *boldItalicFont, respectivamente.\n\n"
    },
    {
      "title": "Caché específico de fuente de una aplicación",
      "level": 3,
      "content": "Matplotlib (python-matplotlib o python2-matplotlibAUR[enlace roto: package not found]) usa su propia cache de fuente, así que después de actualizar las fuentes, asegúrese de eliminar ~/.matplotlib/fontList.cache, ~/.cache/matplotlib/fontList.cache, ~/.sage/matplotlib-1.2.1/fontList.cache, etc. Así regenerará su caché de fuente y encontrará las nuevas fuentes [2].\n\n"
    },
    {
      "title": "Texto bidireccional en el terminal",
      "level": 3,
      "content": "Ejecute BiCon (bicon-gitAUR) para conseguir mostrar correctamente el texto arábico y hebreo dentro del terminal.\n\n"
    },
    {
      "title": "Vea también",
      "level": 2,
      "content": "- Estado de la representación de texto\n- Biblioteca de fuentes - Fuentes con licencia libre.\n- Fuentes en screenshots.debian.net\n\n"
    }
  ]
}