{
  "title": "Fortune (Português)",
  "url": "https://wiki.archlinux.org/title/Fortune_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- arte ASCII\n\nfortune é um programa simples que exibe frases aleatórias comoventes, inspiradoras, tolas ou maliciosas de um banco de dados de citações. O utilitário de linha de comando fortune faz parte do pacote fortune-mod.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale fortune-mod ou fortune-mod-gitAUR[link quebrado: package not found].\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "- Linha de comando em um terminal:\n\n```\n$ fortune\nIt is Texas law that when two trains meet each other at a railroad crossing,\neach shall come to a full stop, and neither shall proceed until the other has gone.\n```\n\n- Para exibir uma citação aleatória ao iniciar um terminal interativo, adicione o comando fortune ao arquivo de configuração rc do seu shell preferido:\n\n```\n#!/bin/bash\n# ~/.bashrc\nfortune\n```\n\n```\n#!/bin/dash\n# ~/.dashrc\nfortune\n```\n\n- Para exibir uma citação aleatória ao fazer login em um terminal de login, adicione o comando fortune ao arquivo de configuração do perfil do seu shell preferido:\n\n```\n#!/bin/mksh\n# ~/.profile\nfortune\n```\n\n"
    },
    {
      "title": "Criando arquivos personalizados",
      "level": 3,
      "content": "Para criar um arquivo personalizado, você deve primeiro criar um arquivo contendo as citações. Entre cada citação, você deve adicionar uma linha contendo apenas o caractere %. Salve esse arquivo usando o nome que desejar, por exemplo minhas_citacoes. Em seguida, execute strfile minhas_citacoes em um terminal, para permitir o acesso aleatório das aspas. Agora você pode acessar as citações executando fortune minhas_citacoes em um terminal. Para que este comando funcione, você deve estar no mesmo diretório que os arquivos minhas_citacoes e minhas_citacoes.dat. Se você deseja que suas cotações sejam acessíveis apenas executando o comando fortune, mova ambos arquivos para o diretório /usr/share/fortune/. Se você quiser fazer alterações no seu arquivo, repita desde o início.\n\n"
    },
    {
      "title": "Cowsay",
      "level": 3,
      "content": "Veja Arte ASCII#Cowsay.\n\n"
    },
    {
      "title": "Ponysay",
      "level": 3,
      "content": "Veja Arte ASCII#Ponysay.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Página do projeto fortune-mod no GitHub\n\n"
    }
  ]
}