{
  "title": "Fortune",
  "url": "https://wiki.archlinux.org/title/Fortune",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ASCII art\n\nfortune is a simple program that displays random poignant, inspirational, silly or snide phrases from a database of quotations. The fortune command-line utility is part of the fortune-mod package.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install fortune-mod. Alternatively install misfortune, a fortune-mod clone written in haskell.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Command-line in a terminal:\n\n```\n$ fortune\nIt is Texas law that when two trains meet each other at a railroad crossing,\neach shall come to a full stop, and neither shall proceed until the other has gone.\n```\n\nTo display a random quote when launching an interactive terminal, add the fortune command to the rc configuration file of your preferred shell, for example:\n\n```\n~/.bashrc\n```\n\n```\n#!/bin/bash\nfortune\n```\n\n"
    },
    {
      "title": "Creating custom files",
      "level": 3,
      "content": "In order to create a custom file, you must first create a file containing the quotes. Between each quote you must add a line containing only the % character. Save this file using whatever name you want, for example myquotes. Then, run strfile myquotes in a terminal, in order to enable random access of the quotes. You can now access the quotes by executing fortune myquotes in a terminal. For this command to work you must be on the same directory as the myquotes and myquotes.dat files. If you want your quotes to be accessible by just running the fortune command, you must move both files into the /usr/share/fortune/ directory. If you want to make any changes to your file, repeat from the start.\n\n"
    },
    {
      "title": "Cowsay",
      "level": 3,
      "content": "See ASCII art#Cowsay.\n\n"
    },
    {
      "title": "Ponysay",
      "level": 3,
      "content": "See ASCII art#Ponysay.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- fortune-mod GitHub project page\n\n"
    }
  ]
}