{
  "title": "Forum Etiquette (Português)",
  "url": "https://wiki.archlinux.org/title/Forum_Etiquette_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Além do código de conduta, cada um dos foros tem suas próprias diretrizes específicas resumidas nas subseções a seguir.\n\n"
    },
    {
      "title": "Fóruns",
      "level": 2,
      "content": "Diretrizes específicas para o fórum do Arch.\n\n"
    },
    {
      "title": "Como publicar",
      "level": 3,
      "content": "- Busque por assuntos claros e informativos. Desta forma mais atenção pode ser atraída por usuários experientes que desejam ajudar e possuem conhecimento neste tópico em particular. Isto também torna o tópico de fácil referência e de fácil busca no fórum para problemas similares. Além disso, evite extravagâncias em frases como [AJUDA!]. [URGENTE!], etc.lib\n- Uma busca sincera na utilização de linguagem apropriada, modesta e com gramática correta, é o sinal evidente de respeito pelos membros da comunidade e certamente será apreciado, incitando respostas positivas. Evite usar termos \"textspeak\", \"netspeak\", \"leetspeak\" e outros tipos de gírias de internet.\n- Quando criar perguntas, acrescente o máximo de informação que puder, incluindo mensagens de erro, saída de terminal, logs, procedimento executado durante o acontecimento, quais documentações você utilizou como base e arquivos de configuração pertinentes.\n- Escolha apenas um assunto por discussão. Tópicos longos são desencorajados nos subfóruns técnicos.\n- Poste sua questão em apenas um subfórum. Busque o de maior relevância antes de criar o tópico.\n- Não publique tutoriais ou \"como fazer\": documentação no wiki, no qual ele pode ser mantido.\n- Quando for responder a um tópico existente, sempre leia a postagem original com o objetivo de manter o foco no assunto inicial.\n- Finalmente, quando uma solução é encontrada marque o tópico como resolvido(solved) sempre adicionando a marcação [SOLVED] ao título original.\n- Note que você deve evitar utilizar a marcação [CLOSED], que é utilizada pelo sistema para marcar tópicos que não estão mais acessíveis para novas postagens.\n- Caso um tópico seja marcado como [SOLVED], não responda com equivalentes do tipo \"Eu estou tendo o mesmo problema...\"; Inicie um novo tópico e faça referência ao já resolvido caso seja relevante.\n\n"
    },
    {
      "title": "Colando imagens e código",
      "level": 3,
      "content": "Use a tag [code] quando colando pedaços de informação do console. Use clientes pastebin quando for postar grandes quantias de código. Não use pastebin.com—ele é bloqueado por alguns usuários e tem um histórico de problemas irritantes (JavaScript, propagandas, formatação ruim, etc). Para usuários de localização não-inglesa: Prefixe o LC_ALL=C para postar comandos de forma que a saída será em inglês. Não poste imagens de tela cheia; ao invés disto utilize thumbnails. Quaisquer imagens com resolução maior que 250×250px e maior que 50 KiB de tamanho serão removidas. Não publique capturas de tela de saída de tela; publique o texto.\n\n"
    },
    {
      "title": "A vida é uma via de mão dupla",
      "level": 3,
      "content": "Uma simples e irrefutável verdade. Tenha a certeza de que seus tópicos incluem detalhes e informações que outros acharão útil. Compartilhe os seus achados com a comunidade. Compartilhe também suas falhas. Postagens do tipo \"Deixa pra lá, corrigi - Nevermind, I fixed it\" em seus tópicos ou deletar suas próprias postagens por razões similares enquadra não apenas egoísmo e má utilização da comunidade, mas uma completa perda de tempo por todas pessoas e recursos envolvidos. Demandar ajuda e demonstrar impaciência rude para a resolução de algo também é indesejado aqui. O Arch é constituído por uma comunidade de voluntários. O Arch enfatiza e encoraja as pessoas a fazer pesquisas, tentativas, comentários de volta ao tópico, ajudar os outros e contribuir com a comunidade.\n\nNão seja um \"vampiro de ajuda\".\n\n"
    },
    {
      "title": "Requisições de recomendação de produtos",
      "level": 3,
      "content": "Tópicos que buscam informar sobre recomendações de produtos de informática são desencorajados. Tais tópicos, assim como a tecnologia que neles é discutida, tornam-se obsoletos de forma rápida e não trazem benefícios para a comunidade de uma forma ampla. Você deve tirar suas próprias conclusões e ser sagaz o suficiente para buscar suas conclusões sobre qual produto melhor se encaixa em suas necessidades.\n\n"
    },
    {
      "title": "Tópicos antigos/\"ressurreição de tópicos\"",
      "level": 3,
      "content": "Faça sua parte para manter o fórum organizado. Como o wiki é onde o Arch está documentado, postar em tópicos antigos (\"ressuscitar\" ou \"necrobumping\") é desencorajado na seção de problemas técnicos, pois pode potencialmente trazer a tona informação \"zumbi\"; postagens desatualizadas contem informações que não são mais relevantes devido a natureza rolling release do Arch, sendo mais adequado buscas em postagens mais recentes. E além do mais, páginas de suporte técnico devem permanecer sucintas, e múltiplas páginas de informação devem ser evitadas.\n\nRegra geral:\n\n- Se você possui uma pergunta, inicie um novo tópico e referencie um antigo se relevante. Você também pode relatar o tópico antigo para que a equipe possa fechá-lo.\n- Se você possui algo a adicionar e julga que a informação é relacionada porém mais atualizada, inicie um novo tópico e relacione o antigo se desejado, porém, evite a duplicação de esforços postando informação que já está catalogada na Wiki do Arch\n- Se você possui uma solução que é agnóstica a versão do software, a ressurreição de tópico pode ser apropriado se o tópico não tiver mais que um ou dois anos.\n\n"
    },
    {
      "title": "Proibição de tópicos vazios/power-posting",
      "level": 3,
      "content": "Power-posting é melhor descrito como a postagem de mensagens vazias ou sem conteúdo significativo. Isto não é tolerado. As pessoas fazem isto por dois motivos aparentes: aumentar o contador de postagens de forma sem sentido, ou arrebatar o suporte de outros a ideias que estão para ser votadas. Exemplos de power-posting incluem, porém não estão limitados a, respostas com \"+1\", \"lol\", \"eu também\", \"Concordo\" ou \":)\".\n\nQuando postar respostas a mensagens, certifique-se que tem algo a acrescentar. Estas postagens vazias tumultuam discussões, invalidam a função 'Mostrar novas postagens', e gastam banda e espaço no servidor.\n\nTópicos que caem na série do \"+1/-1\", \"eu também/concordo/discordo\" serão trancados. \"Power posts\" podem deletados sem prévio aviso.\n\n"
    },
    {
      "title": "Bumping",
      "level": 3,
      "content": "Postar uma única palavra sem significado para atrair a atenção de um tópico não é permitido. Faça sua própria pesquisa, continue no troubleshooting, poste os resultados e seja paciente com a comunidade. Se as pessoas leem seu tópico sem responder oferecendo ajuda, você pode tentar fornecer maiores detalhes, ou questionar a direção que você deve seguir. Geralmente a razão pela qual postagens permanecem sem resposta é por conta dos detalhes esparsos na postagem original, ou, a disponibilidade de soluções óbvias na wiki, em outras partes do fórum ou na internet, e a comunidade não possui a vontade de apontar o óbvio.\n\n"
    },
    {
      "title": "Publicação cruzada",
      "level": 3,
      "content": "É o tipo de postagem onde a mesma pergunta é feita em diferentes subfóruns (por exemplo, postando no \"Newbie Corner\" e em \"Installation\"). Figura desperdício de recursos e não é permitido. Qualquer tópico que seja enquadrado como postagem cruzada será imediatamente trancado ou deletado.\n\n"
    },
    {
      "title": "Espoliação (Hijacking) de tópicos",
      "level": 3,
      "content": "Este processo consiste em responde um tópico existente com um outro assunto diferente. Este tipo de atitude é desencorajada. É preferível que se inicie um novo tópico caso você tenha um problema que é relacionado a um problema já postado mas que claramente difere. Postar desta forma insere off-topic, que é tolerado porém geralmente desencorajado, dentro de tópicos sérios.\n\n"
    },
    {
      "title": "Política da caixa de lixo (marked for deletion)",
      "level": 3,
      "content": "Quaisquer tópicos que estão trancados/fechados por conterem informação já documentada na Wiki ou por inconsistência com as políticas do fórum e filosofias do Arch poderão ir para o caixote de lixo(Dust/troll-bin). Após um período de cinco dias, tópicos lá depositados serão elegíveis para exclusão a critério da equipe. O Moderador responsável irá claramente marcar tais tópicos como \"Binned\" ou \"For deletion\".\n\n"
    },
    {
      "title": "Listas de discussão",
      "level": 2,
      "content": "Diretrizes para as listas de discussão. Veja também o estilo de publicação da lista de discussão.\n\n"
    },
    {
      "title": "Top posting",
      "level": 3,
      "content": "Nunca há desculpa para top posting. Não faça isso.\n\n"
    },
    {
      "title": "Citação",
      "level": 3,
      "content": "Cite apenas os elementos necessários de um e-mail anterior. Citar blocos inteiros rapidamente abarrota discussões e reduz a legibilidade ao mesmo tempo que aumenta a carga cognitiva em toda a lista. Apague todo o material redundante e responda apenas o material citando apenas o material necessário.\n\n"
    },
    {
      "title": "Texto simples",
      "level": 3,
      "content": "Texto simples é o padrão de Unix e de e-mail. HTML é desnecessário e, para aqueles usando clientes de linha de comando, indesejável. Por favor, mantenha o comprimento das linhas em tamanho razoável: 72 caracteres é considerado o padrão.\n\nhttps://useplaintext.email/ fornece instruções para configurar clientes de e-mail para usar texto simples.\n\n"
    },
    {
      "title": "Responder à lista de discussão",
      "level": 3,
      "content": "Ao responder a um tópico da lista de e-mails, certifique-se de responder à lista de e-mails em vez do autor do e-mail original. A maioria dos clientes de e-mail deve fornecer um recurso de \"resposta à lista de discussão\" entre as opções de resposta. Caso contrário, insira manualmente o endereço de e-mail da lista de discussão no campo Para.\n\nPara listas de discussão que não exigem se inscrever, como arch-mirrors-announce e aur-requests, use responder a todos e certifique-se de que a lista de discussão esteja entre os destinatários.\n\n"
    },
    {
      "title": "AUR",
      "level": 2,
      "content": "Diretrizes para o Arch User Repository podem ser encontradas nas diretrizes de envio ao AUR.\n\n"
    },
    {
      "title": "IRC",
      "level": 2,
      "content": "Todos canais IRC do Arch estão na rede irc do Libera Chat. Usuários do Libera Chat devem seguir a política da rede e diretrizes do canal do Libera Chat.\n\nO idioma oficial do canal #archlinux é o inglês. Se você precisar de ajuda em outro idioma, pesquise pelos canais internacionais do arch.\n\n- O tópico principal do #archlinux é para suporte para e discussão sobre o Arch Linux. Conversa geral sobre software e hardware é permitida desde que não interfira no tópico principal da discussão. Se lhe for solicitado levar alguma conversa para outro canal ou mensagem privada, você deveria fazê-lo.\n\n- Leia o tópico do canal regularmente com /topic. Ele geralmente contém informações importantes.\n- Há apenas um bot oficial de canal: phrik. Não faça spam com os comandos do bot e limite seu uso a coisas que são úteis. Se você deseja trazer seu próprio bot para qualquer canal do Arch Linux, peça aos operadores antes de fazê-lo.\n- Não crie pontes para outros canais de qualquer outra rede ou mídia sem permissão.\n- Não publique logs para o público sem permissão de todos os participantes.\n- Não inunde (flood) o canal com texto. Isso inclui arte ASCII, comando de bot e erros de log. Use um paste bin para compartilhar alguma coisa maior que três linhas. programa &> programa-output.txt em combinação com clientes pastebin pode facilitar essa etapa. Se você deseja tentar comandos de bot ou olhar a função de ajuda, faça-o em um /query ou /msg. Exemplo: /query phrik help comando.\n- Resposta automática no canal ou em mensagem privada não é permitido com uma única exceção para respostas de ausência como realces do apelido em uma mensagem privada.\n- Não pergunte se alguém está vivo ou se usa o software, apenas faça sua pergunta.\n- Não exija ajuda; peça. Espere pacientemente por alguns minutos antes de reexpor suas perguntas. A maioria das perguntas são respondidas por outro apenas usuário, como você.\n- Ao pedir por ajuda, sempre responda à pessoa para lhe pediu por mais informações, se você não sabe a resposta, fale isso.\n\n- Use um paste bin para compartilhar alguma coisa maior que três linhas. programa &> programa-output.txt em combinação com clientes pastebin pode facilitar essa etapa.\n- Se você deseja tentar comandos de bot ou olhar a função de ajuda, faça-o em um /query ou /msg. Exemplo: /query phrik help comando.\n\n"
    },
    {
      "title": "Wiki",
      "level": 2,
      "content": "Diretrizes para o wiki podem ser encontradas em ArchWiki:Contribuindo.\n\n"
    },
    {
      "title": "GitLab",
      "level": 2,
      "content": "Diretrizes para relatar problemas no espaço de nomes GitLab archlinux/packaging/packages podem ser encontradas em Diretrizes de relatórios de erro.\n\n"
    },
    {
      "title": "Solicitações de mesclagem de pacotes",
      "level": 3,
      "content": "As diretrizes a seguir se aplicam ao enviar solicitações de mesclagem para projetos no espaço de nomes GitLab archlinux/packaging/packages.\n\n- Faça commits descritivos e descrições detalhadas de solicitações de mesclagem: mantê-los claros e concisos facilita o processamento.\n- Teste suas alterações antes de enviar e enviar: Verifique se o pacote compila corretamente (em um chroot limpo) e se o problema que você está abordando foi resolvido corretamente.\n- Não crie solicitações de mesclagem para atualizações triviais de pacotes: use o recurso Sinalizar pacote desatualizado no site de pacotes do Arch. Simplesmente atualizar no pkgver geralmente não é o que impede que uma nova versão seja empacotada.\n- Não faça alterações em variáveis/arquivos relacionados à versão (pkgver, pkgrel, .SRCINFO): solicitações de mesclagem devem ser unidades de alterações em vez de unidades de versões. A decisão de lançar alterações deve ser deixada nas mãos dos mantenedores do pacote. Uma exceção a isso seria uma solicitação de mesclagem aberta com o objetivo de resolver uma atualização de pacote que é difícil de fazer triagem (por exemplo, atualizações que exigem correção ou alterações nas funções de compilação/empacotamento , veja o ponto anterior).\n\n"
    }
  ]
}