{
  "title": "Forum etiquette (日本語)",
  "url": "https://wiki.archlinux.org/title/Forum_etiquette_(%E6%97%A5%E6%9C%AC%E8%AA%9E)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux コミュニティは Arch Linux を支えて高め合うという目的を持った技術コミュニティです。\n\nArch Linux はコミュニティによって運営されているディストリビューションです。開発者やサポートスタッフ、Arch Linux に関わる全ての人が自分の時間を使ってコミュニティに参加しているのは、必要に応じてカスタマイズできるミニマルなベースシステムを作りたいという思いを共有しているからです。このページに書かれている「行動規範」は何年もの月日によって築かれたものであり、高い SN 比・自給自足・学習や貢献への積極性が特徴の機能的なサポートシステムであるコミュニティの精神を反映しています。\n\n以下の原則・指針に従うことはコミュニティに対して敬意を払うというだけなく、他の Arch Linux ユーザーと互いに有益な交流を始めるきっかけにもなります。\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 コモンセンス\n- 2 行動規範 2.1 リスペクト 2.1.1 他のユーザーのリスペクト 2.1.2 他のオペレーティングシステムやプロジェクトのリスペクト 2.1.3 スタッフに敬意を 2.1.4 荒らしの禁止 2.1.5 煽り行為の禁止 2.1.6 責任感を持つこと 2.1.7 メンバーのアカウント 2.2 適法性 2.2.1 犯罪教唆 2.2.2 スパム/宣伝/勧誘 2.3 正確性 2.3.1 Arch Linux ディストリビューションのサポートオンリー 2.3.2 個人的なトピック/暴言 2.3.3 物議を醸すようなトピック 2.3.4 益のない議論 (\"bikeshed\") 2.4 自由\n- 3 ガイドライン 3.1 フォーラム 3.1.1 投稿方法 3.1.2 絵やコードの貼り付け 3.1.3 この世は持ちつ持たれつ 3.1.4 プロダクトの推薦文のリクエスト 3.1.5 古いスレッド/\"Necro-Bumping\" 3.1.6 パワーポスト/内容のない投稿の禁止 3.1.7 スレッド上げ 3.1.8 クロスポスト 3.1.9 スレッドの乗っ取り 3.1.10 Dustbin ポリシー (Marked for Deletion) 3.2 メーリングリスト 3.2.1 トップポスティング 3.2.2 引用 3.2.3 プレーンテキスト 3.3 AUR 3.4 IRC 3.5 Wiki 3.6 バグトラッカー\n- 4 執行\n- 5 スタッフの連絡先\n\n- 2.1 リスペクト 2.1.1 他のユーザーのリスペクト 2.1.2 他のオペレーティングシステムやプロジェクトのリスペクト 2.1.3 スタッフに敬意を 2.1.4 荒らしの禁止 2.1.5 煽り行為の禁止 2.1.6 責任感を持つこと 2.1.7 メンバーのアカウント\n- 2.2 適法性 2.2.1 犯罪教唆 2.2.2 スパム/宣伝/勧誘\n- 2.3 正確性 2.3.1 Arch Linux ディストリビューションのサポートオンリー 2.3.2 個人的なトピック/暴言 2.3.3 物議を醸すようなトピック 2.3.4 益のない議論 (\"bikeshed\")\n- 2.4 自由\n\n- 2.1.1 他のユーザーのリスペクト\n- 2.1.2 他のオペレーティングシステムやプロジェクトのリスペクト\n- 2.1.3 スタッフに敬意を\n- 2.1.4 荒らしの禁止\n- 2.1.5 煽り行為の禁止\n- 2.1.6 責任感を持つこと\n- 2.1.7 メンバーのアカウント\n\n- 2.2.1 犯罪教唆\n- 2.2.2 スパム/宣伝/勧誘\n\n- 2.3.1 Arch Linux ディストリビューションのサポートオンリー\n- 2.3.2 個人的なトピック/暴言\n- 2.3.3 物議を醸すようなトピック\n- 2.3.4 益のない議論 (\"bikeshed\")\n\n- 3.1 フォーラム 3.1.1 投稿方法 3.1.2 絵やコードの貼り付け 3.1.3 この世は持ちつ持たれつ 3.1.4 プロダクトの推薦文のリクエスト 3.1.5 古いスレッド/\"Necro-Bumping\" 3.1.6 パワーポスト/内容のない投稿の禁止 3.1.7 スレッド上げ 3.1.8 クロスポスト 3.1.9 スレッドの乗っ取り 3.1.10 Dustbin ポリシー (Marked for Deletion)\n- 3.2 メーリングリスト 3.2.1 トップポスティング 3.2.2 引用 3.2.3 プレーンテキスト\n- 3.3 AUR\n- 3.4 IRC\n- 3.5 Wiki\n- 3.6 バグトラッカー\n\n- 3.1.1 投稿方法\n- 3.1.2 絵やコードの貼り付け\n- 3.1.3 この世は持ちつ持たれつ\n- 3.1.4 プロダクトの推薦文のリクエスト\n- 3.1.5 古いスレッド/\"Necro-Bumping\"\n- 3.1.6 パワーポスト/内容のない投稿の禁止\n- 3.1.7 スレッド上げ\n- 3.1.8 クロスポスト\n- 3.1.9 スレッドの乗っ取り\n- 3.1.10 Dustbin ポリシー (Marked for Deletion)\n\n- 3.2.1 トップポスティング\n- 3.2.2 引用\n- 3.2.3 プレーンテキスト\n\n"
    },
    {
      "title": "コモンセンス",
      "level": 2,
      "content": "- Arch Linux を使うことを選んだそのときから、あなたは歓迎され、Arch Linux の原則を信奉することが推奨されます。\n- 助けを求めるときは、マニュアルを読んで、自分で検索してから、助けを求めたいことについての詳細な情報を提供してください。\n- 助言をするときは、できる限り辛抱強く思いやりをもってお願いします。\n\nArch はボランティアによるコミュニティです。バランスの取れた自由と制約の複雑なパターンや、そのようなルールを解釈して管理するための時間、リソースや人員を提供するよりも、全員の利益のために受け入れるシンプルな原則を選択しました。したがって、一つの訓戒にこのドキュメントの全てを凝縮させることができます:\n\n積極的に貢献して、仲間達やコミュニティに利益をもたらすよう努めましょう。\n\n"
    },
    {
      "title": "行動規範",
      "level": 2,
      "content": "Arch Linux コミュニティで他者と触れ合うときの最低限の基準は4つのジャンルに絞ることができます。それに加えてフォーラム, Wiki, IRC, メーリングリスト, AUR, バグトラッカーには個別のガイドラインが存在します。\n\n"
    },
    {
      "title": "他のユーザーのリスペクト",
      "level": 4,
      "content": "Arch Linux は他者を重んじる開放的なコミュニティです。反社会的・攻撃的な言動には厳しくあたります。要するに、自分に対してと同じように他人にも接しましょう。たとえ意見が合わなくても、他人を敬うことを忘れずに。異議を唱えるときは、人格攻撃を行うよりも、意見や主張に対して反論するようにしてください。\n\n"
    },
    {
      "title": "他のオペレーティングシステムやプロジェクトのリスペクト",
      "level": 4,
      "content": "他の GNU/Linux ディストリビューション、他のオペレーティングシステム、そしてそのユーザーの悪口を言うのは禁止です。Arch チームは無償で時間と労力を割いて Arch Linux ディストリビューション、ドキュメント、フォーラムを運営しています。他のディストリビューションやオペレーティングシステムのユーザーとコミュニティにもどうぞ敬意を払って下さい。意見や見聞、持論はいつでも歓迎しますが、非生産的な中傷はお断りです。\n\n"
    },
    {
      "title": "スタッフに敬意を",
      "level": 4,
      "content": "サポートスタッフ は筋の通った判断ができると見込まれて選ばれており、最終的な決断を下す権限を持っています。Arch Linux は民主主義で運営されるわけではないことに注意してください。スタッフは誰にとっても平和的な解決がされるように日夜努力していますが、同時に大多数の人のために平和と規則を守らせる責任を負っています。したがって、決断によっては全ての人を満足させることができないこともあります。健康的なコミュニティと環境を守るために何卒よろしくお願いします。\n\n"
    },
    {
      "title": "荒らしの禁止",
      "level": 4,
      "content": "\"荒らし\"とは、攻撃的な内容の投稿をわざとすることで、フォーラムの自由を悪用して故意にスレッドを混乱させたり、物議を醸したり、人を挑発したり、注意を惹きつける人のことです。荒らしという言葉は動詞としても使われることもあり、そういった内容を投稿する行為を示し、また、名詞としてはその内容自体を示します。\n\n荒らしは欺瞞的な行為であり、暗に人を侮辱したり、威圧したり、扇動することでサディスト的な愉悦を得るために敵意の遠回しな表現を頻繁に使います。場を荒らそうという企みを気づかせないように自らを守るような言葉を注意深く選ぶことで、矛先をコミュニティに向けて、誤解を生じさせるような言動がされることもあります。荒らし行為は厳しく取り締まられます。\n\n"
    },
    {
      "title": "煽り行為の禁止",
      "level": 4,
      "content": "フレーム（炎上）とは最も一般的な定義で、誰かに対して否定的で、不躾な、悪口のコメントを向けることです。必然的に、同じような、あるいはもっと酷い返答がなされて、最終的には罵詈雑言の応酬と化します。(たとえ Arch のチームに入っていても) 炎上に加担するメンバーは許されません。個人攻撃に訴えることや、嫌味な言葉や人を見下したような言葉を使うことはしないでください。議論は生産的ですが、口論は破壊的です。\n\n"
    },
    {
      "title": "責任感を持つこと",
      "level": 4,
      "content": "対人関係の問題が起こった場合は、懐を深くして、あなたの行動や意図が、実際にそうかそのように受け取られたかに関わらず、その問題に多少なりとも寄与している可能性があるということを考えてください。Arch Linux のユーザーは自覚を高め、仲間と平和に保つことが推奨されます。自分の行動について責任を持つことが平和的な和解への第一歩です。\n\n"
    },
    {
      "title": "メンバーのアカウント",
      "level": 4,
      "content": "フォーラム等へのメンバー登録は一人一アカウントまでとなっています。複数のアカウントを作成することはリソースの無駄遣いです。さらに、荒らし行為として判断される可能性もあります。\n\nいかなる形でも自作自演やなりすましは厳しく禁止されています。\n\n"
    },
    {
      "title": "犯罪教唆",
      "level": 4,
      "content": "このコミュニティでは 犯罪教唆 は御法度です。\"犯罪の教唆\"とは\"能動的または暗に、他者に非合法または違法な行為を教える、またはそのような行為をすることを手助けする、扇動する、先導する、揶揄する\"ことを意味します。\n\n従って、いかなる形でも犯罪教唆のような投稿、あるいは犯罪に繋がる、または説明するリンクを投稿してはいけません。次のような行為を促す情報やリンクを投稿することが教唆になりますが、それだけに限定はされません: 違法薬物の使用、窃盗、ネットワークの侵入、悪意のあるコードの作成、ソフトウェアの不正複製、著作権や特許で保護されている資料の不正利用、いわゆる「割れ」 (Warez) やそのようなコンテンツの torrent やリンクを提供しているサイトも対象です。法律に従って違法な投稿は真っ先に削除・対処されます。\n\n"
    },
    {
      "title": "スパム/宣伝/勧誘",
      "level": 4,
      "content": "スパムは禁止されています。スパムを見つけたらスタッフに報告してください。スパムを投稿したアカウントと関連する IP アドレスはアクセス制限を受けます。スパムによる投稿に返事を書かないでください。スパムを消すのに必要な作業が増えてしまいます。\n\nArch (のプロジェクトやコミュニティ) または GNU/Linux/FOSS に関連する公表は基本的に問題ありません。ウェブサイトやブログの宣伝、営利的なプロモーション活動は完全に禁止されており、早急に阻止されます。FOSS に関連していようとあるまいと、あなたの発行物/主張を宣伝するためだけに登録することは、コミュニティを使い捨て扱いするのに等しく、許されません。投稿する内容が妥当かどうか確信が持てない場合は、投稿する前にサポートスタッフに連絡してください。また、スパマーたちは短い/不明瞭なリンクを投稿することでリンクが適当かどうかコミュニティによって判断されるのを故意に妨害するテクニックを使っていることを覚えましょう。故に、リンクを投稿するときは飛び先をはっきりさせるようお願いします。\n\n"
    },
    {
      "title": "正確性",
      "level": 3,
      "content": "Arch Linux コミュニティの価値は技術的に正確であることにつきます。手助けをしようと思ったときは、できる限り情報を正確・完全にすることに気を配ってください。Arch コミュニティが何を求めているのかはエリック・レイモンド （Eric Steven Raymond) が書いた 賢い質問のしかた を読めばわかります。\n\nこのカテゴリの他の考慮事項は以下を含みます:\n\n"
    },
    {
      "title": "Arch Linux ディストリビューションのサポートオンリー",
      "level": 4,
      "content": "Arch ベースの他のディストリビューションは別のパッケージ、パッケージバージョン、リポジトリを使っており、システム設定をこちらからはわからない形でカスタマイズしています。Arch Linux コミュニティ側からそのようなプロジェクトのサポートを全てするというのは不可能です。コミュニティによる技術サポートは Arch Linux ディストリビューションと Arch User Repository にだけ適用されます。派生ディストリビューションなどの Arch Linux 以外のオペレーティングシステムについての問題に関するスレッドや、サポートのリクエストは厳格に禁じられており、スレッドは閉じられます。\n\n"
    },
    {
      "title": "個人的なトピック/暴言",
      "level": 4,
      "content": "暴言や愚痴は認められません。この種の投稿をするときはブログなどの個人的なウェブページの方が適しており、Arch コミュニティでは求められていません。公的な投稿は、全てのメンバーにとってオープンで生産的、かつ意味のあるものであるべきです。他のオペレーティングシステムやプロジェクトのリスペクトも見てください。\n\n"
    },
    {
      "title": "物議を醸すようなトピック",
      "level": 4,
      "content": "\"荒らし\"あるいは\"釣り\"とされる話題の明示的なリストは存在しませんが、往来から、宗教・スポーツ・民族・ナショナリズムそして政治に係わる投稿は例外なく削除されています。したがって、Arch コミュニティではこのような不和を生じさせる話題は特に避けるようにしてください！はい、フォーラムスタッフは政治などの問題は人間生来の問題だと認識しています。しかしながら、ここは GNU/Linux ディストリビューションのコミュニティであり、そのような論評や、また、それによって生み出される混乱を作るための場所ではありません。\n\n"
    },
    {
      "title": "益のない議論 (\"bikeshed\")",
      "level": 4,
      "content": "\"Arch のシステムと方法論には問題がある、それについて議論するべきだ\"というようなスレッドは無駄かつ扇動的ということが何度も証明されています (しばしば 自転車置き場の議論 と呼ばれます)。通常、サポートスタッフによる警告の後、削除されます。Arch は Do It Yourself のコミュニティです。システムの問題を認識したのであれば、上手く行くような解決法を考えて、実装し、それから投稿してください。\n\nさらに、Arch Linux の開発チームによって使用されている手段について疑問や議論を投げかけるようなことは厳重に監視され、役に立たないまたは生産的でないと判断された場合は削除されます。刺々しい、非生産的な批判もまた御呼びではありません。\n\nArch の開発について疑問があるのであれば、トピックに具体的な質問を記載して、返答に対しては広い心で受け取るようにお願いします。可能であれば、解決方法または部分的な解決方法を提供してください。他人に何かして欲しいとお願いするよりも、コードやパッチを投稿して議論を求める方が常に実用的です。\n\n"
    },
    {
      "title": "自由",
      "level": 3,
      "content": "独立性 は抑圧的な権威に邪魔されていない状態ですが、自由 は自己決定を示す能力です。したがって、特定の自由を楽しむためには、私たち全員が少しの独立性を犠牲にしなければなりません。他人への手助けや提案、アイデアや意見の自由で開かれた交換は、コミュニティ上で高い価値を与えられており、また、推奨されていますが、コミュニティのメンバーに与えられている自由は無制限ではないことに留意してください。相対的な自由です。あくまで、Arch Linux ディストリビューション全体と共に、上記のガイドラインや方針の枠内でのみ自由は認められています。この枠組みによって同時に課せられる制約は合理的です。従って、それらによって自由が抑えられることや許容されないことへの不満は根拠薄弱と言わざるを得ません。物理法則は物体や力を支配していますが、物理法則に縛られることに文句を言う人はいないのと同じです。それよりも、物理法則を理解することが重要なのであり、それが私たちの幸福・繁栄に繋がります。同様に、Arch コミュニティの高い水準がガイドラインには反映されており、コミュニティの公益と保護のためにコミュニティの自由を規定しています。他人に対する博愛精神を育て、Arch Way を大事に考える心で和をもって尊しとなすことがフォーラムに真の自由を実現する鍵なのです。ガイドラインを守ることで、他者の自由を侵害したり自分自身を悩ますことなく、貢献したいという衝動を満たすことができます。我々の自由は、美徳によって導かれるときにのみ、その完全な表現を持っています。つまり、上述の規則に従ってガイドラインを受け入れることは、混沌としたやり方によって無秩序、他の抑圧的、有害で悪い結果になることから開放して、コミュニティ全体に利益をもたらします。\n\n"
    },
    {
      "title": "ガイドライン",
      "level": 2,
      "content": "行動規範に加えて、フォーラムなどには独自のガイドラインがあります。\n\n"
    },
    {
      "title": "フォーラム",
      "level": 3,
      "content": "フォーラムに特有のガイドラインです。\n\n"
    },
    {
      "title": "投稿方法",
      "level": 4,
      "content": "- わかりやすく、意味のあるタイトルを採択するようにしてください。そうすれば問題のトピックについて知見を有する経験豊かなユーザーから情報がもたらされる可能性が高くなるでしょう。また、タイトルをわかりやすくることは、将来同じような問題で他のユーザーが参考にしたりフォーラム検索しやすくなります。さらに、「助けて！」や「緊急」などの主題と関係ないフレーズは使わないようにしてください。\n- 謙虚で適切な言葉と語法を使用しようと誠意を尽くすことはコミュニティへの敬意の表れとして好ましく思われ、積極的な反応が得られるでしょう。一部のネット上でしか通じない省略語やハッカー語などのインターネットスラング (いわゆる \"textspeak\", \"netspeak\", \"leetspeak\") を使うのは控えて下さい。\n- 質問を投稿するときは、エラーメッセージやターミナルの出力、ログ、試行したコマンド、ドキュメントを検索して見つけたことや試してみた検索語句、問題と関連する設定ファイルなど、できるかぎり多くの情報を提供するようにしてください。\n- 一つのスレッドでは一つの話題を扱うようにしてください。技術的な問題を取り扱うサブフォーラムでスレッドが長くなるのは良いことではありません。\n- 質問を投稿するのはどれか一つのサブフォーラムに絞って下さい。最も適切なサブフォーラムを選択して、投稿しましょう。\n- チュートリアルや\"ハウツー\"を投稿しないでください。ドキュメントはメンテナンスできるように wiki にあるべきです。\n- 既存のスレッドに返信を書くときは、元の投稿を読んで、初めの話題から外れていかないように注意してください。\n- 最後に、解決方法が見つかったら、最初の投稿を編集して\"タイトル\"の前に [解決済み] と付け加えるようにしてください。[閉鎖] を使ってはいけません。これはシステムによって新しい投稿ができないようにされたスレッドを示すために使われます。\n- [解決済み] と付けられたスレッドに、「同じような問題を抱えています...」というような返信をしないでください。新しいスレッドを作成して、必要であれば [解決済み] のスレッドへのリンクを書いて下さい。\n\n"
    },
    {
      "title": "絵やコードの貼り付け",
      "level": 4,
      "content": "コンソールの出力の一部を貼り付けるときは [code] タグを使って下さい。大量のコードを投稿するときは Pastebin クライアントを使用します。pastebin.com を使わないでください。ユーザーによってはブロックされていて、迷惑な問題の歴史があります(JavaScript・広告・不十分なフォーマット等)。ロケールを英語以外に設定しているユーザーは、コマンドの前に LC_ALL=C を付けて実行してください。出力が英語になります。フルスクリーンの画像は投稿しないでください、代わりに画像へのリンクを使って、任意でサムネイルを使いましょう。解像度が 250×250px 以上の画像やサイズが 50KiB 以上の画像は削除されます。テキスト出力のスクリーンショットを投稿してはいけません。素のテキストを投稿してください。\n\n"
    },
    {
      "title": "この世は持ちつ持たれつ",
      "level": 4,
      "content": "単純ですが、深い意味を持つ、否定しがたい真実です。投稿したスレッドには他人から見て役に立つ情報を記載するよう心掛けましょう。あなたが見つけたことはコミュニティと共有するべきです。失敗もまた共有しましょう。「もういい、解決した」などとスレッドに投稿したり、同じような理由で自分の投稿を削除することは、コミュニティからみると自分勝手で無益なだけでなく、リソースやみんなの時間の全くの浪費でもあります。また、当然のこととして助けを要求したり、助けをゆっくりと待てずにすぐ癇癪を起こすのはここでは望ましくありません。Arch はボランティアのコミュニティによって成り立っています。Arch ユーザーは、自分である程度調査を行い、努力をしてみて、スレッドに事後報告をして、他人への手助けをし、議論に参加し、そしてコミュニティに貢献することを強く推奨します。\n\n\"help vampire\" になったらおしまいです。\n\n"
    },
    {
      "title": "プロダクトの推薦文のリクエスト",
      "level": 4,
      "content": "推薦されるコンピュータ製品のアドバイスを求めるようなスレッドは止められます。そこで議論されるテクノロジーなどのトピックは、すぐに時代遅れのものとなり、長持ちするような利益はコミュニティにもたらさないのが常です。自分で調査して自分で結論を出して自分でどの製品が一番相応しいか答えを出せるはずです。\n\n"
    },
    {
      "title": "古いスレッド/\"Necro-Bumping\"",
      "level": 4,
      "content": "いつもきれいにフォーラムを使用していただきありがとうございます。wiki には Arch のドキュメントがあるため、技術的な問題を扱うサブフォーラムにおいて古いスレッドに投稿すること、\"necrobumping\" は基本的に推奨されません。支離滅裂な\"ゾンビ\"情報になってしまう可能性があるためです。Arch はローリングリリースであり、古くなった投稿とデータは現況を反映した新しい投稿と混ぜるべきではありません。\n\n経験則:\n\n- 質問がある場合、新しいスレッドを作成して、もし関連する古いスレッドがある場合、そのスレッドへのリンクを記述してください。スタッフがスレッドを閉じられるように、古いスレッドを報告することもできます。\n- 関連する情報に追加すること、判断するところがあり、それが最新情報であるなら、新しいスレッドを作成して必要であれば古いスレッドへのリンクを書いてください。ただし、既に ArchWiki に書かれている情報を投稿して重複させるようなことは止めてください。\n- バージョンが一致する、または先のバージョンから変わってない場合に解決方法が見つかったときは、古い(1〜2年以内の)スレッドに投稿することは適切かもしれません。\n\n"
    },
    {
      "title": "パワーポスト/内容のない投稿の禁止",
      "level": 4,
      "content": "パワーポストは空の意味のないメッセージを投稿する行為です。このような行為は禁止されています。パワーポストを行う理由は2つ考えられます: 投稿数を無為に増やしたい、または、投稿に対する賛意を (まるで投票するかのように) 表したい、ということです。パワーポストの例としては以下のような返信があります (これだけに限定されるものではありません): \"+1\", \"lol\", \"me too\", \"I agree\", \":)\"。\n\nメッセージを投稿したり返信するときは、ちゃんと中身をもたせるようにしてください。内容のない投稿はスレッドや議論をかき乱し、'Show New Posts' 機能が上手く機能しなくなり、さらに帯域とサーバー容量の無駄でもあります。\n\n\"+1/-1\" や \"私も/賛成/反対\" などばかり並ぶようになったスレッドはロックされます。個々のパワーポストも削除されることになるでしょう。\n\n"
    },
    {
      "title": "スレッド上げ",
      "level": 4,
      "content": "一単語を投稿したり中身のないメッセージを投稿することでスレッドに注意を惹きつけるような行為 (bumping) は許されません。自分で調査を行って、トラブルシューティングをし、調査結果を投稿してください。コミュニティから返答がないことにいちいち腹を立てるのはやめましょう。あなたのスレッドが読まれているのに返答や助けが返ってこない場合、さらに詳しい情報を提供したり、自分の行っている調査の方向性が間違っていないか尋ねて下さい。投稿に対して答えが返ってこないのは大抵、元の投稿にほとんど情報がなくて助けをかけることができないか、あるいは wiki やフォーラム、ウェブ上にはっきりと解決法が載っているため、そんな明白なことをわざわざコミュニティが教えるのは不本意だからです。\n\n"
    },
    {
      "title": "クロスポスト",
      "level": 4,
      "content": "クロスポストとは別々のサブフォーラムに同じ質問を何回も投稿する(例えば、初心者コーナーとインストールサブフォーラムの双方に投稿する)ことや、同じまたは別のサブフォーラムに似たような質問を投稿することです。クロスポストはリソースの無駄であり許されません。クロスポストされたトピックはすぐにロックまたは削除されます。\n\n"
    },
    {
      "title": "スレッドの乗っ取り",
      "level": 4,
      "content": "既存のスレッドを別のトピックで埋めることをスレッドハイジャックと言います。ハイジャックはしないでください。投稿されている問題と関連するような問題を抱えていても、その問題がハッキリと別の問題であるならば、新しいスレッドを作成するほうが良いでしょう。オフトピックの議論に関するスレッドを乗っ取るようなことも止めて下さい。\n\n"
    },
    {
      "title": "Dustbin ポリシー (Marked for Deletion)",
      "level": 4,
      "content": "既に掲示板や Wiki に情報が載っている、あるいは Arch Way と相容れないなどの理由でスレッドがロック・クローズされるとゴミ箱に移動されます。5日間の猶予の後、スレッドはスタッフによる削除の対象になります。モデレータがスレッドに \"Binned\" あるいは \"For deletion\" などと分かりやすいように印を付けます。\n\n"
    },
    {
      "title": "メーリングリスト",
      "level": 3,
      "content": "メーリングリストのガイドラインです。メーリングリストの投稿形式 も参照してください。\n\n"
    },
    {
      "title": "トップポスティング",
      "level": 4,
      "content": "トップポスティング (返信元のメッセージを下にコピーしてから返信すること) は禁止です。\n\n"
    },
    {
      "title": "引用",
      "level": 4,
      "content": "メールの中の必要な部分だけを引用してください。引用の多用はスレッドを肥大化させ読むのが苦痛になります。重複は避けて適当な引用部にだけ返信してください。\n\n"
    },
    {
      "title": "プレーンテキスト",
      "level": 4,
      "content": "Unix におけるメールの標準形式はプレーンテキストです。HTML は不必要ですし、コマンドラインクライアントを使用している場合、読めません。一行の長さはあまり長くしないでください: 72文字で改行するのがデフォルトと考えて良いでしょう。\n\n"
    },
    {
      "title": "AUR",
      "level": 3,
      "content": "Arch User Repository のガイドラインは AUR#パッケージの共有にあります。\n\n"
    },
    {
      "title": "IRC",
      "level": 3,
      "content": "Arch Linux の IRC チャンネルは全て freenode の irc ネットワーク上に存在します。freenode のユーザーは freenode の ネットワークポリシー と チャンネルガイドライン に従う必要があります。\n\n#archlinux チャンネルの公式言語は英語です。他の言語でヘルプが必要な場合、国際的な arch チャンネルを使ってください。\n\n- #archlinux のメイントピックは Arch Linux に関するサポートと議論です。ソフトウェアやハードウェアに関する雑談はメイントピックに差し障りがないかぎりで許可されています。他のチャンネルやプライベートメッセージを使うように言われたときは素直に従ってください。\n- /topic を使って定期的にチャンネルトピックを読んでみてください。重要な情報が書かれていることがあります。\n- 公式のチャンネルボットは phrik!~archbot@archlinux/bot/phrik だけです。ボットコマンドの多用は禁止です。Arch Linux チャンネルにボットを参加させたい場合、オペレーターの指示に従ってください。\n- チャンネルをあなたの発言で埋めてはいけません。アスキーアートやボットコマンド、エラーログなどが該当します。 3行以上のテキストを貼り付けたいときは pastebin を使ってください。program &> program-output.txt と pastebin クライアントを組み合わせると簡単に使用できます。 ボットコマンドやヘルプ機能を試したいときは、/query や /msg を使ってください。例: /query phrik help command。\n- チャンネルやプライベートメッセージにおける自動返答は許可されていません。離席中にプライベートメッセージで呼びかけられたときに返答することだけが例外的に許可されています。\n- 誰何してはいけません。質問だけを投げましょう。\n- 助けを要求してはいけません。請願してください。同じ質問をすぐに繰り返してはいけません。質問に答えるのは基本的に'他人'です。\n- 助けを求めるときは、詳しい情報を要求された場合に必ず返事をしてください。答えがまだ分からないのであれば、そう言ってください。\n\n- 3行以上のテキストを貼り付けたいときは pastebin を使ってください。program &> program-output.txt と pastebin クライアントを組み合わせると簡単に使用できます。\n- ボットコマンドやヘルプ機能を試したいときは、/query や /msg を使ってください。例: /query phrik help command。\n\n"
    },
    {
      "title": "Wiki",
      "level": 3,
      "content": "wiki のガイドラインは以下のページにあります:\n\n- ArchWiki:貢献\n- ヘルプ:スタイル\n- ヘルプ:議論\n\n"
    },
    {
      "title": "バグトラッカー",
      "level": 3,
      "content": "バグトラッカーのガイドラインはバグ報告ガイドラインを見てください。\n\n"
    },
    {
      "title": "執行",
      "level": 2,
      "content": "メンバーの行動が容認できないとスタッフによって判断された場合、大抵は警告が発せられます。甚だしい違反の場合は即座にアクセス制限されます。スタッフが Arch フォーラムや IRC チャンネル、メーリングリストなどで警告について論ずることはありません。警告が無視された場合、更に踏み込んだ制裁が待っています。問題のユーザーアカウントの凍結から、ユーザーの削除、アクセス制限まで様々な対処法が取られます。実際にどんな対処法が使われるかはケースバイケースです。\n\n不当な判断が下されたと感じた場合、フォーラム・Wiki・IRC のそれぞれに用意されている適切な手段を使ってください (下を参照)。\n\n"
    },
    {
      "title": "スタッフの連絡先",
      "level": 2,
      "content": "全くの誤解を受けたり、他人が攻撃的な言動をしている場合など、スタッフに報告することがあるときは、助けを求めたり救済を得ることができます:\n\n- フォーラム: 「通報」ボタンを使用するか、forum@archlinuxjp.org にメールを送ってフォーラムの管理者に連絡してください。\n- Wiki: ArchWiki:メンテナンスチームに連絡してください。\n- IRC チャンネル: オペレーターに連絡してください。\n\n"
    }
  ]
}