{
  "title": "Fprint (Español)",
  "url": "https://wiki.archlinux.org/title/Fprint_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2024-03-08** \n\nArtículos relacionados\n\n- Fingerprint GUI (Español)\n- ThinkFinger (Español)\n\nDesde la página web de fprint:\n\nLa idea es utilizar el lector de huellas dactilares integrado en algunos portátiles para iniciar sesión utilizando PAM. Este artículo también explicará cómo usar una contraseña normal como método de respaldo para iniciar sesión (no se recomienda usar únicamente el lector de huellas dactilares debido a numerosas razones).\n\n"
    },
    {
      "title": "Prerrequisitos",
      "level": 2,
      "content": "Puedes comprobar si tu dispositivo es compatible consultando la lista de dispositivos compatibles o la lista de dispositivos no compatibles. Para comprobar cuál tienes, escribe:\n\n```\n$ lsusb\n```\n\nLa herramienta lsusb está disponible dentro del paquete usbutils.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Instale el paquete fprintd. imagemagick también puede ser necesario.\n\nAlgunos dispositivos requieren un \"fork\" diferente de libfprint, los cuales no han sido combinados (¿todavía?) con el paquete principal libfprint:\n\n- libfprint-tod — Para sensores táctiles.\n\n- libfprint-elanmoc2 — Para ELAN 04f3:0c4c. Esperando merge.\n\n- libfprint-elanmoc2-newdrvs — Experimental para 04f3:0c4c o un 04f3:0c00. Esperando merge.\n\n"
    },
    {
      "title": "Configuración de inicio de sesión",
      "level": 3,
      "content": "- Si usas GDM, la opción de huella digital ya está disponible en el menú de inicio de sesión (si no, añádase al grupo de usuario input). ¡Puedes saltarte esta sección!\n- Si utiliza SDDM, consulte SDDM#Using a fingerprint reader.\n\nAñade pam_fprintd.so como sufficient al principio de la sección auth de /etc/pam.d/system-local-login:\n\n```\n/etc/pam.d/system-local-login\n```\n\n```\nauth      sufficient pam_fprintd.so\nauth      include   system-login\n...\n```\n\nEsto intentara utilizar el inicio de sesión mediante huella dactilar y, si falla o no encuentra ninguna firma de huella dactilar en el directorio personal del usuario, procede al inicio de sesión mediante contraseña.\n\nTambién puede modificar otros archivos en /etc/pam.d/{login,su,sudo,gdm,lightdm} de la misma manera. Por ejemplo /etc/pam.d/polkit-1 para la autenticación basada en polkit (GNOME y muchos otros entornos de escritorio) o /etc/pam.d/kde para desbloquear la pantalla de bloqueo de KDE.\n\nAñadiendo pam_fprintd.so como sufficient a cualquier fichero de configuración en /etc/pam.d/ cuando una firma de huella dactilar está presente sólo preguntará por la autenticación de huella dactilar. Esto evita el uso de una contraseña si no puedes utilizar Ctrl+c en el escaneo de la huella digital (debido a la falta de un shell). Para utilizar tanto una contraseña como una huella digital en una interfaz gráfica, añada la siguiente línea al principio de cualquier archivo necesario:\n\n```\nauth\t\tsufficient  \tpam_unix.so try_first_pass likeauth nullok\nauth\t\tsufficient  \tpam_fprintd.so\n...\n```\n\nEsto solicitará una contraseña; si se pulsa Enter en un campo en blanco, se procederá a la autenticación de la huella dactilar.\n\nSi desea solicitar la huella dactilar y la contraseña al mismo tiempo, puede utilizar pam-fprint-grosshackAUR. Esto puede ser necesario para algunos programas gráficos que no permiten la introducción de contraseñas en blanco, como el agente polkit integrado de Gnome. Para utilizar este paquete, añada las siguientes líneas al principio de cualquier archivo necesario:\n\n```\nauth\t\tsufficient  \tpam_fprintd_grosshack.so\nauth\t\tsufficient  \tpam_unix.so try_first_pass nullok\n...\n```\n\n"
    },
    {
      "title": "Crear firma de huella digital",
      "level": 3,
      "content": "Necesitará tener un agente de autenticación en ejecución antes de poder enrolar.\n\nPara añadir una firma para un dedo, ejecute:\n\n```\n$ fprintd-enroll\n```\n\no crear una nueva firma para todos los dedos:\n\n```\n$ fprintd-delete \"$USER\"\n$ for finger in {left,right}-{thumb,{index,middle,ring,little}-finger}; do fprintd-enroll -f \"$finger\" \"$USER\"; done\n```\n\nSe le pedirá que escanee el dedo indicado. Pase el dedo índice derecho cinco veces. Después de eso, la firma se crea dentro de /var/lib/fprint/.\n\nTambién puede enrolar sin un agente de autenticación:\n\n```\n# fprintd-enroll user\n```\n\nPara verificar la huella digital recién creada, utilice:\n\n```\n$ fprintd-verify\n```\n\nPara obtener más información, consulte fprintd(1).\n\n"
    },
    {
      "title": "Restringir el enrolamiento",
      "level": 3,
      "content": "De forma predeterminada, todos los usuarios pueden registrar nuevas huellas dactilares sin que se les solicite la contraseña o la huella digital. Puede cambiar este comportamiento mediante reglas polkit.\n\nHay dos ubicaciones que contienen los archivos de configuración de polkit:\n\n- /etc/polkit-1/rules.d/\n- /usr/share/polkit-1/rules.d/\n\nNote: **modificar** \n\nEn el siguiente ejemplo, sólo root puede registrar huellas digitales:\n\n```\n/etc/polkit-1/rules.d/50-net.reactivated.fprint.device.enroll.rules\n```\n\n```\npolkit.addRule(function (action, subject) {\n  if (action.id == \"net.reactivated.fprint.device.enroll\") {\n    return subject.user == \"root\" ? polkit.Result.YES : polkit.Result.NO\n  }\n})\n```\n\n"
    },
    {
      "title": "No devices available (No hay dispositivos disponibles)",
      "level": 3,
      "content": "Si su dispositivo compatible no se encuentra o se afirma que ya está abierto (en uso), compruebe los registros fprintd.service en el journalctl.\n\nPuede encontrar entradas de registro como:\n\n```\nfprintd[2936592]: Corrupted message received\nfprintd[2936592]: Ignoring device due to initialization error: unsupported firmware version\n```\n\nAsegúrate de que el firmware de tu dispositivo está actualizado con Fwupd.\n\n"
    },
    {
      "title": "gdm se bloquea al mostrar el prompt de login después de suspender",
      "level": 3,
      "content": "Este problema se describe en en el repositorio de libfprint. La respuesta de los desarrolladores es:\n\nLa solución propuesta es crear:\n\n```\n/etc/modprobe.d/bluetooth-blacklist.conf\n```\n\n```\nblacklist btusb\n```\n\nO ejecutar directamente:\n\n```\n# rmmod btusb\n```\n\nEntonces no debería intentar inicializar el dispositivo.\n\n"
    },
    {
      "title": "Error inesperado al suspender el dispositivo",
      "level": 3,
      "content": "Este problema está descrito en el repositorio libfprint:\n\n"
    },
    {
      "title": "La autenticación por huella dactilar no está surtiendo efecto en el agente Polkit.",
      "level": 3,
      "content": "After adding fingerprint rules to Linux PAM, fingerprint recognition only works for SDDM and sudo, but not for polkit.\n\nCopie el archivo 50-default.rules en /etc/ y cambie el nombre del grupo wheel por su grupo de usuario.\n\n```\n# cp /usr/share/polkit-1/rules.d/50-default.rules /etc/polkit-1/rules.d/\n```\n\n```\n/etc/polkit-1/rules.d/50-default.rules\n```\n\n```\npolkit.addAdminRule(function(action, subject) {\n    return [\"unix-group:wheel\"];\n});\n```\n\n"
    },
    {
      "title": "Depuración",
      "level": 3,
      "content": "Utilice la siguiente variable de entorno y bandera de línea de comandos:\n\n```\n# G_MESSAGES_DEBUG=all /usr/lib/fprintd -t\n```\n\n"
    }
  ]
}