{
  "title": "Frequently asked questions (Español)",
  "url": "https://wiki.archlinux.org/title/Frequently_asked_questions_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-12** \n\nArtículos relacionados\n\n- Terminología en Arch\n- Preguntas frecuentes Arch User Repository\n- Solución de problemas\n\n"
    },
    {
      "title": "¿Qué es Arch Linux?",
      "level": 3,
      "content": "Véase el artículo Arch Linux.\n\n"
    },
    {
      "title": "¿Por qué podría preferir no usar Arch?",
      "level": 3,
      "content": "Es posible que no desee usar Arch, si:\n\n- No tiene la habilidad/tiempo/ganas de usar una distribución GNU/Linux basada en hazlo tú mismo.\n- Necesita compatibilidad para una arquitectura que no sea x86_64.\n- Adopta una postura firme sobre el uso de una distribución que solo proporcione software libre, según la definición de GNU.\n- Cree que un sistema operativo debería configurarse por sí solo y funcionar una vez instalado, incluyendo por defecto un completo conjunto de software y entornos de escritorios en la instalación.\n- No quiere una distribución GNU/Linux de lanzamiento continuo.\n- Está satisfecho con su sistema operativo actual.\n\n"
    },
    {
      "title": "¿Qué arquitecturas soporta Arch?",
      "level": 3,
      "content": "Arch sólo soporta la arquitectura x86_64 (a veces llamado amd64). El soporte para i686 fue eliminado en noviembre de 2017 [1].\n\nHay ports no oficiales para las arquitecturas i686 [2] y ARM [3], cada uno con sus propios canales de la comunidad [4][enlace roto 2024-01-13]\n\n"
    },
    {
      "title": "¿Sigue Arch el estándar de jerarquía del sistema de archivos de la Fundación Linux (FHS)?",
      "level": 3,
      "content": "Arch Linux sigue la jerarquía del sistema de archivos para sistemas operativos que usan el administrador de servicios systemd. Véase file-hierarchy(7) para obtener una explicación de cada directorio junto con sus designaciones. En particular, /bin, /sbin, y /usr/sbin son enlaces simbólicos a /usr/bin, y /lib junto a /lib64 son enlaces simbólicos a /usr/lib.\n\n"
    },
    {
      "title": "Soy un completo principiante en GNU/Linux. ¿Debo usar Arch?",
      "level": 3,
      "content": "Si es un principiante y quiere usar Arch, tenga en cuenta únicamente que debe estar dispuesto a invertir un tiempo considerable en el aprendizaje de un nuevo sistema, así como aceptar el hecho de que Arch está diseñado fundamentalmente como una distribución 'hazlo tú mismo'. Es el usuario quien monta el sistema y controla en lo que se convertirá.\n\nAntes de pedir ayuda, haga su propia investigación independiente buscando en la web, indagando en el foro (y leyendo el resto de estas preguntas frecuentes) y buscando en la excelente documentación proporcionada por la wiki de Arch. Hay una razón por la que estos recursos se ponen a disposición del usuario en primer lugar. Son muchos los voluntarios que dedican miles de horas compilando esta excelente información.\n\nVéase también Arch terminology (Español)#RTFM y la guía de instalación.\n\n"
    },
    {
      "title": "¿Arch está diseñado para ser utilizado como un servidor?, ¿un escritorio?, ¿una estación de trabajo",
      "level": 3,
      "content": "Arch no está diseñado para un tipo de uso particular. Más bien, está diseñado para un tipo particular de usuario. Arch está dirigido a usuarios competentes que disfrutan de su naturaleza 'hazlo tú mismo', y que además la aprovechan para moldear el sistema y satisfacer sus necesidades. Por lo tanto, moldeado según los propósitos del usuario, Arch se puede utilizar prácticamente para cualquier propósito. Muchos utilizan Arch tanto en equipos de sobremesa como en estaciones de trabajo. Y por supuesto, archlinux.org, aur.archlinux.org y casi toda la infraestructura de Arch se ejecuta en Arch.\n\n"
    },
    {
      "title": "Realmente me gusta Arch, excepto que el equipo de desarrollo debería implementar la funcionalidad X",
      "level": 3,
      "content": "Involúcrese, contribuya con el código/solución a la comunidad. Si está bien considerado por el equipo de la comunidad y de desarrollo, tal vez sea integrado en Arch. La comunidad de Arch se nutre de la contribución y del intercambio de códigos y de herramientas.\n\n"
    },
    {
      "title": "¿Para cuándo la nueva versión disponible?",
      "level": 3,
      "content": "Los lanzamientos de Arch Linux son simplemente un entorno live para la instalación o el rescate, que incluyen el meta-paquete base y unos pocos paquetes adicionales. Las versiones se liberan, por lo general, en la primera mitad de cada mes.\n\n"
    },
    {
      "title": "¿Es Arch Linux una distribución estable? ¿Tiene problemas con frecuencia?",
      "level": 3,
      "content": "Es el usuario el responsable en última instancia de la estabilidad de su propio sistema de lanzamiento continuo. El usuario decide el momento de actualizar, e integra los cambios necesarios cuando se requiere. Si el usuario accede a la comunidad en busca de ayuda, a menudo se le presta de manera oportuna. La diferencia entre Arch y otras distribuciones es que Arch es verdaderamente una distribución \"do-it-yourself\"; las denuncias de ruptura son equivocadas e improductivas, cuando se debe a los cambios hechos a las aplicaciones por los desarrolladores de las mismas, sin ser responsabilidad del equipo que desarrolla Arch.\n\nVéase el artículo mantenimiento del sistema para obtener consejos sobre cómo hacer que un sistema Arch Linux sea lo más estable posible.\n\n"
    },
    {
      "title": "Arch necesita más prensa (es decir, publicidad)",
      "level": 3,
      "content": "Arch obtiene mucha publicidad tal como es. El objetivo de Arch Linux no es ser grande, sino más bien, orgánico, el crecimiento sostenible se produce de forma natural entre los usuarios destinatarios.\n\n"
    },
    {
      "title": "Arch necesita más programadores",
      "level": 3,
      "content": "Posiblemente sea así. ¡No dude en ofrecer su tiempo! Visite los foros, canales IRC y listas de correo, y vea lo que hay pendiente por hacer. Véase también Getting involved (Español) para más detalles.\n\n"
    },
    {
      "title": "Arch necesita un instalador. ¿Tal vez una instalación a través de GUI?",
      "level": 3,
      "content": "Arch solía tener un instalador con una interfaz de usuario basada en texto llamada Arch Installation Framework (AIF). Después del abandono del último mantenedor, fue en desuso a favor de Arch Install Scripts.\n\nDado que la instalación no se produce con frecuencia (léase el resto de este artículo para saber más acerca de lo que significa lanzamiento continuo), no es una alta prioridad para los desarrolladores o usuarios. La guía de instalación ha sido completamente actualizada para utilizar el método de línea de órdenes.\n\n"
    },
    {
      "title": "He instalado Arch, ¡y estoy en una shell! ¿Y ahora qué?",
      "level": 3,
      "content": "Véase las recomendaciones generales.\n\n"
    },
    {
      "title": "¿Qué entorno de escritorio o gestor de ventanas debo usar?",
      "level": 3,
      "content": "Ya que hay una gran variedad disponibles, use el que más se ajuste a sus necesidades. Véase los artículos Desktop environment (Español) y Window manager (Español).\n\n"
    },
    {
      "title": "¿Qué hace único a Arch respecto de otras distribuciones \"minimalistas\"?",
      "level": 3,
      "content": "Véase Arch compared to other distributions (Español).\n\n"
    },
    {
      "title": "Mantenimiento del sistema",
      "level": 2,
      "content": "Véase System maintenance (Español).\n\n"
    },
    {
      "title": "¿Por qué va mi internet tan lento en comparación con otros sistemas operativos?",
      "level": 3,
      "content": "¿Está su red configurada correctamente? Véase el artículo sobre la configuración de red.\n\nTambién tenga en cuenta que Arch Linux no viene con traffic shaping habilitado. Por lo tanto, es posible que si un programa, de alguna manera, utiliza su conexión de Internet al máximo –sin importar si se trata de P2P o de conexiones de un clásico client-server– otras conexiones locales se encontrarán obstruidas, traduciéndose en retrasos graves y tiempos de espera. El auxilio puede venir instalando un cortafuegos como Shorewall o Vuurmuur; también hay scripts estáticos para iproute2 (como por ejemplo este derivado de Wondershaper), que realiza precisamente esta tarea.\n\n"
    },
    {
      "title": "¿Por qué Arch está usando toda mi RAM?",
      "level": 3,
      "content": "Fundamentalmente, una RAM no utilizada es una RAM desperdiciada.\n\nMuchos usuarios han observado cómo el kernel de Linux maneja la memoria de manera diferente de como están acostumbrados. Dado que el acceso a los datos alojados en la RAM es mucho más rápido que desde una unidad de almacenamiento, el kernel guarda en la memoria los datos a los que se ha accedido recientemente. Los datos en caché solo se borran cuando el sistema comienza a quedarse sin memoria disponible y los nuevos datos necesitan ser cargados.\n\nQuizás la causa más común de esta confusión es la orden free:\n\n```\n$ free -h\n```\n\n```\ntotal        used        free      shared  buff/cache   available\nMem:          2.8Gi       1.1Gi       283Mi       224Mi       1.4Gi       1.2Gi\nSwap:         3.0Gi       881Mi       2.1Gi\n```\n\nEs importante distinguir entre memoria \"free\" y \"available\". En el ejemplo anterior, un portátil con 2,8Gi de memoria RAM total parece estar utilizando la mayor parte de ella, y solo disponer de 283Mi de memoria libre. Sin embargo, 1,4Gi de la misma está en \"buff/cache\". Todavía hay 1,2Gi disponibles para iniciar nuevas aplicaciones, sin tener que acudir al espacio de intercambio. Véase man para más detalles. ¿El resultado de todo esto? ¡Más rendimiento!\n\nVéase este maravilloso artículo si ha despertado su curiosidad. También hay un sitio web dedicado a aclarar esta confusión: https://www.linuxatemyram.com/\n\n"
    },
    {
      "title": "¿De dónde vino todo mi espacio libre?",
      "level": 3,
      "content": "La respuesta a esta pregunta depende de su sistema. Hay algunas utilidades de disco que pueden ayudarle a encontrar la respuesta.\n\n"
    },
    {
      "title": "Administración de paquetes",
      "level": 2,
      "content": "Véase las páginas pacman, pacman/Tips and tricks y repositorios oficiales para obtener más respuestas.\n\n"
    },
    {
      "title": "He encontrado un error con el paquete X. ¿Qué debo hacer?",
      "level": 3,
      "content": "En primer lugar, es necesario averiguar si el error es algo que el equipo de Arch puede arreglar. A veces no lo es (por ejemplo, los fallos de Firefox pueden ser responsabilidad del equipo de Mozilla), lo que se llama un error upstream. Si se trata de un problema de Arch, hay una serie de pasos que puede seguir:\n\n1. busque en los foros para obtener información. Compruebe si alguien más lo ha notado;\n1. publique un bug report con información detallada en https://bugs.archlinux.org;\n1. si lo considera oportuno, escriba un mensaje en el foro detallando el problema y el hecho de que ya lo ha informado. Esto ayudará a evitar que mucha gente avise del mismo error.\n\n"
    },
    {
      "title": "Los paquetes que Arch deberían usar una única extensión. \".pkg.tar.gz\" y \".pkg.tar.xz\" son demasiado largos y/o confusos",
      "level": 3,
      "content": "Esto ha sido discutido en Arch mailing list. Algunos propusieron archivos con la extensión .pac. Por lo que se sabe actualmente, no existe un plan para cambiar la extensión de los paquetes. Como dijo Tobias Kieslich, uno de los desarrolladores de Arch: ¡Un paquete es un tarball comprimido con gzip [xz]!. Y se puede abrir, investigar y manipular por cualquier aplicación que gestione los *.tar. Por otra parte, el mime-type es detectado automática y correctamente por la mayoría de las aplicaciones.\n\n"
    },
    {
      "title": "Pacman necesita una biblioteca para que otras aplicaciones puedan acceder fácilmente a la información del paquete",
      "level": 3,
      "content": "pacman es el front-end para libalpm(3), la biblioteca \"Arch Linux Package Management\". Esta biblioteca permite escribir otros front-ends alternativos, como un front-end gráfico.\n\n"
    },
    {
      "title": "Pacman necesita la característica X",
      "level": 3,
      "content": "Si piensa que su idea tiene interés, entonces puede optar por debatirla en pacman-dev. También le recomendamos que compruebe https://bugs.archlinux.org/index.php?project=3[enlace roto 2024-01-13] por si encuentra peticiones de características similares.\n\nSin embargo, la mejor manera de obtener una característica adicional a pacman o a Arch Linux es implementarla por si mismo. El parche o código puede o no ser admitido oficialmente, pero quizás otros apreciarán, probarán y contribuirán a su esfuerzo.\n\n"
    },
    {
      "title": "Acabo de instalar el paquete X. ¿Cómo empiezo?",
      "level": 3,
      "content": "Si está utilizando un entorno de escritorio como KDE o GNOME, el programa automáticamente debería aparecer en el menú. Si está tratando de ejecutar el programa desde un terminal y no sabe el nombre del archivo binario, utilice:\n\n```\n$ pacman -Qlq nombre_del_paquete | grep /usr/bin/\n```\n\n"
    },
    {
      "title": "¿Por qué hay solo una única versión de cada biblioteca compartida en los repositorios oficiales?",
      "level": 3,
      "content": "Importantes distribuciones, como Debian, tienen diferentes versiones de bibliotecas compartidas incluidas en paquetes diferentes: libfoo1, libfoo2, libfoo3 y así sucesivamente. De esta manera es posible tener aplicaciones compiladas con diferentes versiones de libfoo instaladas en el mismo sistema.\n\nEn el caso de una distribución como Arch, solo las últimas versiones estables de paquetes tienen soporte oficial. Si retiramos el soporte para software obsoleto, lo mantenedores de los paquetes tendrán más tiempo para dedicar a las nuevas versiones asegurando así que las mismas funcionen como se espera de ellas. Tan pronto como una nueva versión de una biblioteca compartida se hace disponible, los desarrolladores la añaden a los repositorios y recompilan los paquetes afectados para utilizar la nueva versión.\n\n"
    },
    {
      "title": "¿Qué pasa si ejecuto una actualización completa del sistema y hay una actualización de una biblioteca compartida, pero no para las aplicaciones que dependen de ella?",
      "level": 3,
      "content": "Este escenario no debería ocurrir en absoluto. Suponiendo que una aplicación llamada foobaz, que está en uno de los repositorios oficiales, ha sido compilada con la biblioteca denominada libbaz, una actualización de libbaz conllevará una recompilación de foobaz, y pacman actualizará libbaz sin problemas. En caso contrario, si no se compila con éxito, el paquete foobaz tendrá una dependencia a una versión distinta (por ejemplo, libbaz 1.5), la cual se habría eliminado por pacman durante la actualización de libbaz, debido a un conflicto entre ambas.\n\nSi foobaz es un paquete que se compiló e instaló desde AUR, debe tratar de recompilar foobaz con la nueva versión de libbaz. Si la compilación falla, informe del problema a los desarrolladores de foobaz.\n\n"
    },
    {
      "title": "¿Es posible que haya una actualización del kernel principal, sin que se actualicen al mismo tiempo algunos de los paquetes de controladores?",
      "level": 3,
      "content": "No, eso no es posible. Las principales actualizaciones del kernel (por ejemplo, linux 3.5.0-1 a linux 3.6.0-1) siempre van acompañados de recompilaciones con todos los paquetes de controladores compatibles con el kernel. Por otro lado, si tiene un paquete de un controlador sin soporte oficial instalado en el sistema, como de AUR, y después de una actualización del kernel no recompila dicho controlador para el nuevo kernel, puede romperse el sistema. Los usuarios son responsables de actualizar los paquetes de controladores sin soporte que han instalado.\n\n"
    },
    {
      "title": "¿Qué hacer antes de actualizar?",
      "level": 3,
      "content": "Siga la sección Actualizar el sistema.\n\n"
    },
    {
      "title": "Un paquete de actualización fue liberado, pero pacman dice que el sistema está al día",
      "level": 3,
      "content": "Los servidores de réplicas de pacman no se sincronizan inmediatamente. Puede tomar más de 24 horas antes de una actualización está disponible para usted. Las únicas opciones son que sea paciente o utilizar otro servidor de réplica. MirrorStatus puede ayudar a identificar un servidor de réplica actualizado.\n\n"
    },
    {
      "title": "El proyecto X ha lanzado una nueva versión. ¿Cuánto tiempo demorará el paquete Arch para actualizar a esa nueva versión?",
      "level": 3,
      "content": "Las actualizaciones del paquete se lanzarán cuando estén listas. La cantidad específica de tiempo puede ser tan breve como unas pocas horas después de que se libere una actualización menor de corrección de errores, hasta varias semanas después de la actualización de un gran grupo de paquetes. La cantidad de tiempo desde la nueva versión hasta que Arch libera un nuevo paquete depende de los paquetes específicos y la disponibilidad de los mantenedores del paquete. Además, algunos paquetes pasan algún tiempo en el repositorio testing, por lo que esto puede prolongar el tiempo antes de que se actualice un paquete. Los mantenedores intentan trabajar lo más rápido posible para llevar actualizaciones estables a los repositorios. Si encuentra un paquete en los repositorios oficiales que está desactualizado, vaya al sitio web del paquete y márquelo.\n\n"
    },
    {
      "title": "Si necesito una versión anterior de una biblioteca instalada, ¿puedo simplemente enlazar a la versión más nueva?",
      "level": 3,
      "content": "Si tiene suerte, podría funcionar, por un tiempo. En cualquier caso, no es una solución adecuada, porque:\n\n- Las bibliotecas no cambian las versiones al azar – es probable que la API/ABI haya cambiado (posiblemente con bits eliminados), y es solo una cuestión de suerte si esos cambios afectan al uso.\n- El enlace simbólico no será rastreado por un administrador de paquetes. Los principiantes que intenten modificar de forma inmediata los archivos de la biblioteca del sistema, corren el mayor riesgo de realizar un cambio no deseado que no pueden diagnosticar/corregir, que el administrador de paquetes ayuda a evitar.\n- Una pequeña alternativa al volcado del archivo de biblioteca antiguo en el sistema de archivos, sin seguimiento, se olvidará, y no se detectarán/corregirán posibles errores de seguridad.\n\nEn su lugar, utilice/escriba por ejemplo un paquete de compatibilidad, que proporcione la versión de la biblioteca requerida.\n\n"
    },
    {
      "title": "¿Cómo puedo saber si mi procesador es compatible con x86_64?",
      "level": 3,
      "content": "Si su procesador es compatible con x86_64, tendrá el flag lm (modo largo) en /proc/cpuinfo. Por ejemplo,\n\n```\n$ grep -w lm /proc/cpuinfo\n```\n\nBajo Windows, utilizando el software gratuito CPU-Z para ayudarle a determinar si su CPU es compatible con 64-bit. Las CPU con instrucciones para AMD de MD64 o solución de EM64T para Intel, deberían ser compatibles con las versiones x86_64 y sus paquetes binarios.\n\n"
    },
    {
      "title": "¿Por qué 64 bits?",
      "level": 3,
      "content": "Es más rápido en la mayoría de los casos, y como razón adicional también inherentemente más seguro debido a la naturaleza de Aleatoriedad en la disposición del espacio de direcciones (ASLR) en combinación con Position-independent code (PIC) y Bit NX que no está disponible en el kernel de stock i686 debido a la deshabilitación de Extensión de dirección física (PAE). Si el equipo tiene más de 4 GiB de RAM, solamente un sistema operativo de 64 bits será capaz de utilizarlo en su totalidad.\n\nLos programadores también tienden cada vez más a preocuparse menos de 32 bits (\"legacy\") y tratarlo como \"nuevas\" CPU de x86 que soportan normalmente extensiones de 64-bit.\n\nHay muchas más razones que podríamos enumerar aquí para decirle que evite los 32 bits, razones relativas al kernel, al espacio de usuario y a los programas individuales que simplemente hacen mejor opción los 64 bits de momento.\n\n"
    }
  ]
}