{
  "title": "Frequently asked questions (Српски)",
  "url": "https://wiki.archlinux.org/title/Frequently_asked_questions_(%D0%A1%D1%80%D0%BF%D1%81%D0%BA%D0%B8)",
  "sections": [
    {
      "title": "Шта је Арч Линукс?",
      "level": 3,
      "content": "Види на Arch Linux (Српски) артиклу.\n\n"
    },
    {
      "title": "Зашто не бих хтео да користим Арч Линукс?",
      "level": 3,
      "content": "Можда не би хтео да користиш Арч, уколико:\n\n- немаш способност/време/вољу за 'уради сам' ГНУ/Линукс дистрибуцију.\n- ти је потребна подршка за архитектуру која није x86_64.\n- заузимаш чврст став о коришћењу дистрибуције која дозвољава само слободан софтвер као што је одредио ГНУ.\n- верујеш да би оперативни систем требало сам себе да подеси, ради из кутије, и садржи комплетан подразумевани сет софтвера и десктоп околине на инсталацијском медијуму.\n- не желиш \"ротирајуће издање\" ГНУ/Линукс дистрибуцију.\n- си задовољан са тренутним оперативним системом.\n\n"
    },
    {
      "title": "Зашто бих хтео да користим Арч?",
      "level": 3,
      "content": "Јер је Арч најбољи.\n\n"
    },
    {
      "title": "За које архитектуре Арч има подршку?",
      "level": 3,
      "content": "Арч једино подржава x86_64 (познат и као amd64) архитектуру. Подршка за i686 је прекинута у новембру 2017 [1].\n\nПостоје неофицијални портови за i686 архитектуру [2] и ARM процесори [3], оба са својственим каналима заједнице.\n\n"
    },
    {
      "title": "Да ли Арч прати Хијерархијски Стандард за Системе датотека Линукс Фундације (FHS)?",
      "level": 3,
      "content": "Арч прати хијерархију система датотека за оперативне системе који користе systemd сервисни менаџер. Види file-hierarchy(7) за објашњење о свакој датотеци, заједно са њиховим ознакама. Посебно, /bin, /sbin, и /usr/sbin су симболични линкови за /usr/bin, и /lib и /lib64 су симболични линкови за /usr/lib.\n\n"
    },
    {
      "title": "Потпуни сам ГНУ/Линукс почетник. Да ли бих требало да користим Арч?",
      "level": 3,
      "content": "Ако си потпуни почетник и желиш да користиш Арч, мораш да будеш спреман да уложиш време у учење новог система и прихватиш да је Арч осмишљен да буде \"уради сам\" дистрибуција; корисник је тај који саставља систем.\n\nПре питања за помоћ, сам истражи тражећи по Интернету, форуму и врховној документацији осигураној од Арч Викија. Постоји разлог зашто су ови ресурси направљени за вас на првом месту. Више хиљада волонтерских сати је потрошено на састављање ових сјајних информација.\n\nВиди такође Arch terminology#RTFM и Installation guide.\n\n"
    },
    {
      "title": "Да ли је арч осмишљен да буде сервер? Десктоп? Радна станица?",
      "level": 3,
      "content": "Арч није дизаниран за специфичан начин коришћења. Напротив, дизајниран је за специфичну врсту корисника Арч циља компететнее кориснике који уживају у његовој 'уради сам' природи и којима је циљ да обликују систем тако да одговара њиховим јединственим потребама. Баш због тога, у рукама својих циљаних корисника, Арч може бити виртуелни коришћен за било коју сврху. Доста људи користи Арч на десктопу и на радној станици заједно. И наравно, archlinux.org, aur.archlinux.org и скоро сви Арчеве инфраструктуре раде на Арчу.\n\n"
    },
    {
      "title": "I really like Arch, except the development team needs to implement feature X",
      "level": 3,
      "content": "Get involved, contribute your code/solution to the community. If it is well-regarded by the community and development team, perhaps it will be merged. The Arch community thrives on contribution and sharing of code and tools.\n\n"
    },
    {
      "title": "When will the new release be made available?",
      "level": 3,
      "content": "Arch Linux releases are simply a live environment for installation or rescue, which include the base meta package and a few other packages. The releases are issued usually in the first half of every month.\n\n"
    },
    {
      "title": "Да ли је Арч Линукс стабилна дистрибуција? Да ли често пуца?",
      "level": 3,
      "content": "It is the user who is ultimately responsible for the stability of their own rolling release system. The user decides when to upgrade, and merges necessary changes when required. If the user reaches out to the community, help is often provided in a timely manner. The difference between Arch and other distributions in this regard is that Arch is truly a 'do-it-yourself' distribution; complaints of breakage are misguided and unproductive, since upstream changes are not the responsibility of Arch devs.\n\nSee the System maintenance article for tips on how to make an Arch Linux system as stable as possible.\n\n"
    },
    {
      "title": "Арчу фали више популарности (тј. рекламе)",
      "level": 3,
      "content": "Арч добија доста популарности такав какав јесте. Циљ Арч Линукса није да буде велики, већ органски, одрживи раст се одвија природно међу циљном базом корисника.\n\n"
    },
    {
      "title": "Арчу треба још девелопера",
      "level": 3,
      "content": "Possibly so. Feel free to volunteer your time! Visit the forums, IRC channels, and mailing lists, and see what needs to be done. See also Getting involved for details.\n\n"
    }
  ]
}