{
  "title": "Fstab (Español)",
  "url": "https://wiki.archlinux.org/title/Fstab_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-10-21** \n\nArtículos relacionados\n\n- Denominación de dispositivos de bloque persistente\n- Sistemas de archivos\n- tmpfs\n- Espacio de intercambio\n\nEl archivo fstab(5) puede utilizarse para definir cómo deben montarse las particiones de disco, otros dispositivos de bloque o sistemas de archivos remotos en el sistema de archivos.\n\nCada sistema de archivos se describe en una línea separada. Estas definiciones se convertirán en unidades de montaje systemd dinámicamente en el arranque, y cuando se recargue la configuración del gestor del sistema. La configuración por defecto ejecutará automáticamente fsck y montará los sistemas de archivos antes de iniciar los servicios que necesitan que sean montados. Por ejemplo, systemd se asegura automáticamente de que los montajes de sistemas de archivos remotos como NFS o Samba se inicien solo después de que se haya configurado la red. Por lo tanto, los montajes de sistemas de archivos locales y remotos especificados en /etc/fstab deberían funcionar de forma inmediata. Véase systemd.mount(5) para más detalles.\n\nLa orden mount utilizará fstab, solo si se da una de las opciones de directorio o dispositivo, para rellenar el valor del otro parámetro. Al hacerlo, también se utilizarán las opciones de montaje que aparecen en fstab.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Un simple /etc/fstab, usando UUIDs del sistema de archivos, muestra la siguiente salida:\n\n```\n/etc/fstab\n```\n\n```\n# <dispositivo>                           <dir> <tipo> <opciones> <dump> <fsck>\nUUID=0a3407de-014b-458b-b5c1-848e92a327a3 /     ext4   defaults   0      1\nUUID=f9fe0b69-a280-415d-a03a-a32752370dee none  swap   defaults   0      0\nUUID=b411dc99-f0a0-4c87-9e05-184977be8539 /home ext4   defaults   0      2\n```\n\n- <device> describe el dispositivo especial de bloques o el sistema de archivos remoto que se va a montar; véase #Identificación de sistemas de archivos.\n- <dir> describe el directorio mount.\n- <tipo> el tipo de sistema de archivos.\n- <options> las opciones de montaje asociadas; véase mount(8) § FILESYSTEM-INDEPENDENT_MOUNT_OPTIONS y ext4(5) § MOUNT_OPTIONS.\n- <dump> es comprobado por la utilidad dump(8). Este campo suele estar configurado como 0, lo que desactiva la comprobación.\n- <fsck> establece el orden de las comprobaciones del sistema de archivos en el momento del arranque; véase fsck(8). Para el dispositivo raíz debe ser 1. Para otras particiones debe ser 2, o 0 para desactivar la comprobación.\n\n- Los del tipo auto permiten que la orden mount adivine qué tipo de sistema de archivos se utiliza. Esto es útil para medios ópticos (CD/DVD/Blu-ray).\n- Si el sistema de archivos raíz es btrfs o XFS, el orden de fsck debe establecerse en 0 en lugar de 1. Véase fsck.btrfs(8) y fsck.xfs(8).\n\nTodos los dispositivos especificados dentro de /etc/fstab se montarán automáticamente al iniciar y cuando se utilice la opción -a con mount(8) a menos que se especifique la opción noauto. Los dispositivos listados y no presentes darán lugar a un error salvo que se utilice la opción nofail.\n\nVéase fstab(5) § DESCRIPTION para más detalles.\n\n"
    },
    {
      "title": "Identificación de sistemas de archivos",
      "level": 2,
      "content": "Hay diferentes maneras de identificar los sistemas de archivos que se montarán en /etc/fstab: por el descriptor de nombre del kernel, la etiqueta y UUID del sistema de archivos, y la etiqueta y UUID de la partición GPT para los discos GPT. El UUID o el PARTUUID deben ser favorecidos sobre los descriptores de nombre del kernel y las etiquetas. Véase Nombres de dispositivos de bloques persistentes para más detalles. Se recomienda leer ese artículo primero antes de proceder.\n\nEn esta sección, se describe cómo montar sistemas de archivos utilizando todos los métodos de montaje disponibles mediante ejemplos. La salida de las órdenes lsblk -f y blkid utilizados en los siguientes ejemplos están disponibles en el artículo Nombres de dispositivos de bloques persistentes.\n\nPara utilizar los descriptores de nombres del kernel, utilice /dev/sdxy en la primera columna.\n\n"
    },
    {
      "title": "Descriptores del nombre del kernel",
      "level": 3,
      "content": "Ejecute lsblk -f para listar las particiones y anteponer los valores de la columna NAME con /dev/.\n\n```\n/etc/fstab\n```\n\n```\n# <dispositivo>   <dir>        <tipo>        <opciones>       <dump> <fsck>\n/dev/sda1         /boot        vfat          defaults         0      2\n/dev/sda2         /            ext4          defaults         0      1\n/dev/sda3         /home        ext4          defaults         0      2\n/dev/sda4         none         swap          defaults         0      0\n```\n\n"
    },
    {
      "title": "Etiquetas del sistema de archivos",
      "level": 3,
      "content": "Ejecute lsblk -f para listar las particiones y anteponer los valores de la columna LABEL con LABEL= o, alternativamente, ejecute blkid y utilice los valores de LABEL sin las comillas:\n\n```\n/etc/fstab\n```\n\n```\n# <dispositivo>   <dir>        <tipo>        <opciones>       <dump> <fsck>\nLABEL=ESP         /boot        vfat          defaults         0      2\nLABEL=Sistema     /            ext4          defaults         0      1\nLABEL=Datos       /home        ext4          defaults         0      2\nLABEL=Swap        none         swap          defaults         0      0\n```\n\n"
    },
    {
      "title": "UUIDs del sistema de archivos",
      "level": 3,
      "content": "Ejecute lsblk -f para listar las particiones y anteponer los valores de la columna UUID con UUID= o, alternativamente, ejecute blkid y utilice los valores UUID sin las comillas:\n\n```\n/etc/fstab\n```\n\n```\n# <dispositivo>                           <dir> <tipo> <opciones> <dump> <fsck>\nUUID=CBB6-24F2                            /boot vfat   defaults   0      2\nUUID=0a3407de-014b-458b-b5c1-848e92a327a3 /     ext4   defaults   0      1\nUUID=b411dc99-f0a0-4c87-9e05-184977be8539 /home ext4   defaults   0      2\nUUID=f9fe0b69-a280-415d-a03a-a32752370dee none  swap   defaults   0      0\n```\n\n"
    },
    {
      "title": "Etiquetas de las particiones GPT",
      "level": 3,
      "content": "Ejecute blkid para listar las particiones, y utilice los valores de PARTLABEL sin las comillas:\n\n```\n/etc/fstab\n```\n\n```\n# <dispositivo>                      <dir> <tipo> <opciones> <dump> <fsck>\nPARTLABEL=EFI\\040system\\040partition /boot vfat   defaults   0      2\nPARTLABEL=GNU/Linux                  /     ext4   defaults   0      1\nPARTLABEL=Home                       /home ext4   defaults   0      2\nPARTLABEL=Swap                       none  swap   defaults   0      0\n```\n\n"
    },
    {
      "title": "UUIDs de las particiones GPT",
      "level": 3,
      "content": "Ejecute blkid para listar las particiones, y utilice los valores de PARTUUID sin las comillas:\n\n```\n/etc/fstab\n```\n\n```\n# <dispositivo>                               <dir> <tipo> <opciones> <dump> <fsck>\nPARTUUID=d0d0d110-0a71-4ed6-936a-304969ea36af /boot vfat   defaults   0      2\nPARTUUID=98a81274-10f7-40db-872a-03df048df366 /     ext4   defaults   0      1\nPARTUUID=7280201c-fc5d-40f2-a9b2-466611d3d49e /home ext4   defaults   0      2\nPARTUUID=039b6c1c-7553-4455-9537-1befbc9fbc5b none  swap   defaults   0      0\n```\n\n"
    },
    {
      "title": "Montaje automático con systemd",
      "level": 3,
      "content": "Véase systemd.mount(5) para todas las opciones de montaje de systemd.\n\n"
    },
    {
      "title": "Partición local",
      "level": 4,
      "content": "En el caso de una partición grande, puede ser más eficiente permitir que los servicios que no dependen de ella se inicien mientras es comprobada por fsck. Esto se puede conseguir añadiendo las siguientes opciones a la entrada /etc/fstab de la partición:\n\n```\nnoauto,x-systemd.automount\n```\n\nEsto hará fsck y montará la partición sólo cuando se acceda a ella por primera vez, y el kernel cargará todo el acceso a los archivos hasta que esté listo. Este método puede ser relevante si uno tiene, por ejemplo, una partición /home significativamente grande.\n\n"
    },
    {
      "title": "Sistema de archivos remoto",
      "level": 4,
      "content": "Lo mismo se aplica a los montajes de sistemas de archivos remotos. Si se desea que se monten sólo al acceder a ellos, se tendrán que usar los parámetros noauto,x-systemd.automount. Además, puede utilizar la opción x-systemd.mount-timeout= para especificar el tiempo que systemd debe esperar a que termine la orden de montaje. Además, la opción _netdev asegura que systemd entienda que el montaje depende de la red y lo ordene después de que la red esté en línea.\n\n```\nnoauto,x-systemd.automount,x-systemd.mount-timeout=30,_netdev\n```\n\n"
    },
    {
      "title": "Sistema de archivos encriptado",
      "level": 4,
      "content": "Si tiene sistemas de archivos encriptados con ficheros de claves, también puede añadir el parámetro noauto a las entradas correspondientes en /etc/crypttab. Entonces systemd no abrirá el dispositivo encriptado en el arranque, sino que esperará hasta que se acceda a él y lo abrirá automáticamente con el archivo de claves especificado antes de montarlo. Esto puede ahorrar algunos segundos en el arranque si está usando un dispositivo RAID encriptado, por ejemplo, porque systemd no tiene que esperar a que el dispositivo esté disponible. Por ejemplo:\n\n```\n/etc/crypttab\n```\n\n```\ndata /dev/md0 /root/key noauto\n```\n\n"
    },
    {
      "title": "Desmontaje automático",
      "level": 4,
      "content": "También puede especificar un tiempo de espera para un montaje con la opción x-systemd.idle-timeout. Por ejemplo\n\n```\nnoauto,x-systemd.automount,x-systemd.idle-timeout=1min\n```\n\nEsto hará que systemd lo desmonte después de que haya estado inactivo durante 1 minuto.\n\n"
    },
    {
      "title": "Dispositivos externos",
      "level": 3,
      "content": "Los dispositivos externos que deben ser montados cuando están presentes pero ignorados si están ausentes pueden requerir la opción nofail. Esto evita que se reporten errores en el arranque. Por ejemplo:\n\n```\n/etc/fstab\n```\n\n```\n/dev/sdg1        /media/backup    jfs    nofail,x-systemd.device-timeout=1ms    0  2\n```\n\nLa opción nofail combina mejor con la opción x-systemd.device-timeout. Esto se debe a que el tiempo de espera del dispositivo por defecto es de 90 segundos, por lo que un dispositivo externo desconectado con sólo nofail hará que su arranque tarde 90 segundos más, a menos que reconfigure el tiempo de espera como se muestra. Asegúrese de no establecer el tiempo de espera en 0, ya que esto se traduce en un tiempo de espera infinito.\n\n"
    },
    {
      "title": "Espacios en la ruta de acceso",
      "level": 3,
      "content": "Dado que los espacios se utilizan en fstab para delimitar los campos, si algún campo (PARTLABEL, LABEL o el punto de montaje) contiene espacios, éstos deben ser sustituidos por caracteres de escape \\ seguidos del código octal de 3 dígitos 040:\n\n```\n/etc/fstab\n```\n\n```\nUUID=47FA-4071     /home/username/Camera\\040Pictures   vfat  defaults      0  0\n/dev/sda7          /media/100\\040GB\\040(Storage)       ext4  defaults,user 0  2\n```\n\n"
    },
    {
      "title": "Opciones de atime",
      "level": 3,
      "content": "Las siguientes opciones de atime pueden afectar al rendimiento de la unidad.\n\n- La opción strictatime actualiza el tiempo de acceso de los archivos cada vez que se accede a ellos. Esto es más útil cuando Linux se utiliza para servidores, pues no tiene mucho sentido para uso de escritorio. El inconveniente de la opción strictatime es que incluso la lectura de un archivo desde la caché de páginas (lectura desde la memoria en lugar de la unidad de disco) seguirá dando lugar a una escritura.\n\n- La opción noatime desactiva por completo la escritura de los tiempos de acceso a los archivos en la unidad cada vez que se lee un archivo. Esto funciona bien para casi todas las aplicaciones, excepto para aquellas que necesitan saber si un archivo ha sido leído desde la última vez que fue modificado. La información del tiempo de escritura a un archivo continuará actualizándose cada vez que se escriba en el archivo con esta opción activada.\n\n- La opción nodiratime desactiva la escritura de los tiempos de acceso a los archivos sólo para los directorios, mientras que otros archivos siguen recibiendo los tiempos de acceso. Nota: noatime implica nodiratime. No es necesario especificar ambos.\n\n- relatime actualiza el tiempo de acceso, pero solamente si el tiempo de acceso anterior fue inferior al tiempo de modificación o cambio actual. Además, desde Linux 2.6.30, la hora de acceso siempre se actualiza si la hora de acceso anterior era superior a las 24 horas. Esta opción se utiliza cuando se especifica la opción defaults, la opción atime (que significa utilizar el valor por defecto del kernel, que es relatime; véase mount(8) y wikipedia:Stat (system call)#Criticism of atime) o ninguna opción.\n\nCuando se utiliza Mutt u otras aplicaciones que necesitan saber si un archivo ha sido leído desde la última vez que fue modificado, la opción noatime no debe ser utilizada. El uso de la opción relatime es aceptable y sigue proporcionando una mejora de rendimiento.\n\nDesde el kernel 4.0 existe otra opción relacionada:\n\n- lazytime reduce las escrituras en disco manteniendo los cambios en las marcas de tiempo del inodo (tiempos de acceso, modificación y creación) sólo en memoria. Las marcas de tiempo en el disco se actualizan sólo cuando (1) el nodo del archivo necesita ser actualizado por algún cambio no relacionado con las marcas de tiempo del archivo, (2) se produce una sincronización con el disco, (3) un nodo no eliminado es desalojado de la memoria o (4) si han pasado más de 24 horas desde la última vez que la copia en memoria fue escrita en el disco.\n\nTenga en cuenta que la opción lazytime funciona en combinación con las opciones *atime anteriormente mencionadas , no como alternativa. Por defecto es relatime , pero puede ser incluso strictatime con el mismo o menor coste de escrituras en disco que la simmple opción relatime.\n\n"
    },
    {
      "title": "Volver a montar la partición raíz",
      "level": 3,
      "content": "Si por alguna razón la partición raíz ha sido montada incorrectamente como de sólo lectura, vuelva a montar la partición raíz con acceso de lectura-escritura con la siguiente orden:\n\n```\n# mount -o remount,rw /\n```\n\n"
    },
    {
      "title": "Montaje automático de particiones GPT",
      "level": 3,
      "content": "Cuando se utiliza UEFI/GPT, es posible omitir ciertas particiones de /etc/fstab según la Especificación de particiones detectables y tener a systemd-gpt-auto-generator(8) montando las particiones. Véase Systemd (Español)#Montaje automático de particiones GPT.\n\n"
    },
    {
      "title": "Fijar montaje",
      "level": 3,
      "content": "Puede vincular directorios con la opción bind:\n\n```\n/etc/fstab\n```\n\n```\n# <dispositivo>                     <dir>                         <tipo> <opciones>    <dump> <fsck>\nUUID=94649E22649E06E0                /media/user/OS/              ntfs   defaults,rw,errors=remount-ro  0  0\n/media/user/OS/Users/user/Music/     /home/user/Music/            none   defaults,bind 0   0\n/media/user/OS/Users/user/Pictures/  /home/user/Pictures/         none   defaults,bind 0   0\n/media/user/OS/Users/user/Videos/    /home/user/Videos/           none   defaults,bind 0   0\n/media/user/OS/Users/user/Downloads/ /home/user/Downloads/        none   defaults,bind 0   0\n/media/user/OS/Users/user/Documents/ /home/user/Documents/        none   defaults,bind 0   0\n/media/user/OS/Users/user/projects/  /home/user/projects/windows/ none   defaults,bind 0   0\n```\n\nVéase mount(8) § Operación de enlace de montaje para obtener más información.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Listado completo de dispositivos, incluyendo el dispositivo de bloques\n- Estándar de jerarquía del sistema de archivos\n- Caché y velocidad 30 veces más rápidos con TMPFS\n\n"
    }
  ]
}