{
  "title": "Fstab (Русский)",
  "url": "https://wiki.archlinux.org/title/Fstab_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Постоянные имена для блочных устройств\n- Файловые системы\n- Mount (Русский)\n- tmpfs (Русский)\n\nФайл fstab(5) используется для настройки параметров монтирования различных блочных устройств, разделов на диске и удаленных файловых систем.\n\nОн состоит из набора определений файловых систем. Каждая файловая система занимает свою строку. Эти определения динамически преобразуются в юниты монтирования systemd во время загрузки системы. При этом производится автоматическое разрешение зависимостей: службы, которые зависят от конкретной файловой системы, запускаются только после ее монтирования, а удаленные файловые системы вроде NFS или Samba, в свою очередь, монтируются только после того, как будет установлено сетевое подключение. Таким образом, и локальные, и удаленные файловые системы, указанные в /etc/fstab, будут правильно смонтированы без дополнительной настройки. По умолчанию, при монтировании также производится запуск проверки файловой системы программой fsck. За подробной информацией обратитесь к man-странице systemd.mount(5).\n\nПри монтировании с помощью mount fstab используется для определения точки монтирования, если указано только устройство, и наоборот. При этом параметры монтирования также берутся из fstab.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Простой пример /etc/fstab, в котором файловые системы идентифицируются по их UUID:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                <dir> <type> <options> <dump> <fsck>\nUUID=0a3407de-014b-458b-b5c1-848e92a327a3 /     ext4   defaults  0      1\nUUID=f9fe0b69-a280-415d-a03a-a32752370dee none  swap   defaults  0      0\nUUID=b411dc99-f0a0-4c87-9e05-184977be8539 /home ext4   defaults  0      2\n```\n\n- При выборе типа файловой системы auto команда mount попытается определить реальный тип файловой системы самостоятельно. Это полезно для компакт-дисков (CD/DVD/Blu-ray).\n- Если корневая файловая система btrfs или XFS, порядок fsck следует всегда указывать 0 вместо 1. Смотрите fsck.btrfs(8) и fsck.xfs(8).\n\nВсе прописанные в /etc/fstab устройства автоматически монтируются при загрузке системы или при запуске команды mount(8) с параметром -a, если не указана опция noauto. Если есть устройства, прописанные в файле, но не подключенные, это приведёт к ошибке, если не указана опция nofail.\n\nДля более подробной информации смотрите fstab(5) § DESCRIPTION.\n\n"
    },
    {
      "title": "Определение файловой системы",
      "level": 2,
      "content": "Конкретное место расположения файловой системы может быть определено различными способами. В файле /etc/fstab можно указать имя файла устройства, его метку или UUID (в том числе GPT-метку и GPT-UUID для дисков GPT). Определение по UUID или PARTUUID является наиболее предпочтительным способом. Подробнее об этом вы можете узнать на странице Постоянные имена для блочных устройств — рекомендуется прочесть её перед продолжением чтения данной статьи.\n\nДалее приведены примеры определений файловых систем с использованием каждого из способов. Вывод lsblk -f and blkid для этих примеров вы можете найти на странице Постоянные имена для блочных устройств.\n\n"
    },
    {
      "title": "По именам устройств",
      "level": 3,
      "content": "Запустите lsblk -f, чтобы отобразить список разделов. Укажите имена устройств с префиксом /dev/.\n\n```\n/etc/fstab\n```\n\n```\n# <device>        <dir>        <type>        <options>        <dump> <fsck>\n/dev/sda1         /boot        vfat          defaults         0      2\n/dev/sda2         /            ext4          defaults         0      1\n/dev/sda3         /home        ext4          defaults         0      2\n/dev/sda4         none         swap          defaults         0      0\n```\n\n"
    },
    {
      "title": "По меткам",
      "level": 3,
      "content": "Запустите lsblk -f, чтобы отобразить список разделов. Укажите метки из столбца LABEL с префиксом LABEL=:\n\n```\n/etc/fstab\n```\n\n```\n# <device>        <dir>        <type>        <options>        <dump> <fsck>\nLABEL=ESP         /boot        vfat          defaults         0      2\nLABEL=System      /            ext4          defaults         0      1\nLABEL=Data        /home        ext4          defaults         0      2\nLABEL=Swap        none         swap          defaults         0      0\n```\n\n"
    },
    {
      "title": "По UUID",
      "level": 3,
      "content": "Запустите lsblk -f, чтобы отобразить список разделов. Укажите идентификаторы из столбца UUID с префиксом UUID=:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                <dir> <type> <options> <dump> <fsck>\nUUID=CBB6-24F2                            /boot vfat   defaults  0      2\nUUID=0a3407de-014b-458b-b5c1-848e92a327a3 /     ext4   defaults  0      1\nUUID=b411dc99-f0a0-4c87-9e05-184977be8539 /home ext4   defaults  0      2\nUUID=f9fe0b69-a280-415d-a03a-a32752370dee none  swap   defaults  0      0\n```\n\n"
    },
    {
      "title": "По меткам GPT",
      "level": 3,
      "content": "Запустите blkid чтобы отобразить список разделов. Укажите значения PARTLABEL без кавычек:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                           <dir> <type> <options> <dump> <fsck>\nPARTLABEL=EFI\\040system\\040partition /boot vfat   defaults  0      2\nPARTLABEL=GNU/Linux                  /     ext4   defaults  0      1\nPARTLABEL=Home                       /home ext4   defaults  0      2\nPARTLABEL=Swap                       none  swap   defaults  0      0\n```\n\n"
    },
    {
      "title": "По UUID GPT",
      "level": 3,
      "content": "Запустите blkid чтобы отобразить список разделов. Укажите значения PARTUUID без кавычек:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                    <dir> <type> <options> <dump> <fsck>\nPARTUUID=d0d0d110-0a71-4ed6-936a-304969ea36af /boot vfat   defaults  0      2\nPARTUUID=98a81274-10f7-40db-872a-03df048df366 /     ext4   defaults  0      1\nPARTUUID=7280201c-fc5d-40f2-a9b2-466611d3d49e /home ext4   defaults  0      2\nPARTUUID=039b6c1c-7553-4455-9537-1befbc9fbc5b none  swap   defaults  0      0\n```\n\n"
    },
    {
      "title": "Автоматическое монтирование с systemd",
      "level": 3,
      "content": "Список всех опций монтирования systemd можно посмотреть в systemd.mount(5).\n\n"
    },
    {
      "title": "Локальный раздел",
      "level": 4,
      "content": "Если есть большой раздел, вы можете разрешить службам, которые не обращаются к нему, запускаться в то время, как он проверяется программой fsck. Для этого добавьте следующие параметры монтирования в запись /etc/fstab для соответствующего раздела:\n\n```\nnoauto,x-systemd.automount\n```\n\nПри этом процедура проверки и монтирования раздела будет запущена только при первой попытке доступа, и ядро будет держать в ожидании все потоки ввода-вывода, связанные с этим разделом, пока он не будет смонтирован. Это полезно в случае, например, очень большого раздела /home.\n\n"
    },
    {
      "title": "Удалённая файловая система",
      "level": 4,
      "content": "Автоматическое монтирование может аналогичным образом использоваться и для монтирования удаленных файловых систем. В дополнение, вы можете использовать параметр x-systemd.device-timeout=# для указания времени ожидания удаленной файловой системы при перебоях в соединении. Также опция _netdev даёт systemd понять, что файловая система зависит от сети.\n\n```\nnoauto,x-systemd.automount,x-systemd.mount-timeout=30,_netdev\n```\n\n"
    },
    {
      "title": "Зашифрованная файловая система",
      "level": 4,
      "content": "Если у вас имеются зашифрованные файловые системы, вы можете также добавить параметр noauto в соответствующие записи в /etc/crypttab. Тогда systemd не будет пытаться открыть зашифрованное устройство во время загрузки системы, а сделает это при первой попытке доступа к файловой системе на этом устройстве, применив указанный файл ключа и затем автоматически смонтировав ФС. Это может дать выигрыш в несколько секунд при загрузке системы, например, если у вас зашифрованный RAID массив: systemd не придется ожидать готовности устройства. Пример записи:\n\n```\n/etc/crypttab\n```\n\n```\ndata /dev/md0 /root/key noauto\n```\n\n"
    },
    {
      "title": "Автоматическое размонтирование",
      "level": 4,
      "content": "С помощью флага x-systemd.idle-timeout можно указать таймаут бездействия. Например:\n\n```\nnoauto,x-systemd.automount,x-systemd.idle-timeout=1min\n```\n\nВ таком случае systemd размонтирует раздел спустя одну минуту неактивности.\n\n"
    },
    {
      "title": "Пробелы в значениях полей",
      "level": 3,
      "content": "Так как пробельные символы используются в fstab для разделения полей, их нельзя напрямую использовать в значениях полей. Любые пробелы в полях (например, значения PARTLABEL, LABEL или точки монтирования) должны быть заменены специальными управляющими последовательностями, которые состоят из обратной косой черты (\\) и трех восьмеричных цифр (например, для пробела это \\040):\n\n```\n/etc/fstab\n```\n\n```\nUUID=47FA-4071     /home/username/Camera\\040Pictures   vfat  defaults       0  0\n/dev/sda7          /media/100\\040GB\\040(Storage)       ext4  defaults,user 0  2\n```\n\n"
    },
    {
      "title": "Внешние устройства",
      "level": 3,
      "content": "Если устройство не подключено постоянно, и может отсутствовать во время загрузки системы, монтируйте его с параметром nofail. Это предотвратит появление ошибок при загрузке.\n\n```\n/etc/fstab\n```\n\n```\n/dev/sdg1        /media/backup    jfs    nofail,x-systemd.device-timeout=1ms    0  2\n```\n\nПараметр nofail хорошо комбинируется с x-systemd.device-timeout. Таймаут по умолчанию 90 секунд, из-за чего отсутствие устройства приведёт к увеличению времени загрузки на 90 секунд. Не ставьте таймаут 0, так как это означает бесконечный таймаут.\n\n"
    },
    {
      "title": "Параметры atime",
      "level": 3,
      "content": "- Если файловая система смонтирована с параметром strictatime, то, когда происходит обращение к файлу, в его поле atime записывается текущее время (иными словами, время доступа). Это может быть полезно, когда Linux используется на сервере; на персональном компьютере эта функция обычно не нужна. Недостаток этой функции в том, что даже при чтении файла из кэша (в оперативной памяти) все равно производится медленная операция записи на диск. Использование параметров монтирования noatime, nodiratime или relatime может улучшить производительность доступа к данным, а также уменьшить износ твердотельных (SSD) накопителей.\n- Параметр noatime полностью отключает запись времени доступа к файлу. Большинство программ не используют это поле. Но бывают и редкие исключения — например, Mutt полагается на его значение. Для mutt вы можете использовать параметр relatime.\n- Параметр nodiratime отключает обновление времени доступа только для каталогов; для остальных файлов время atime будет обновляться всегда.\n\n- Параметр relatime включает обновление поля только если atime меньше времени последнего изменения файла или если с предыдущего обновления прошло больше 24 часов. Этот параметр автоматически используется при использовании параметра defaults или параметра atime (который означает значение по умолчанию в ядре, которым является relatime; смотрите mount(8) и wikipedia:Stat (system call)#Criticism of atime) и если не указаны никакие опции.\n\nВ ядре 4.0 появилась ещё одна опция:\n\n- lazytime уменьшает количество операций записи на диск, сохраняя изменения временных меток inode (время доступа, изменения и создания) только в памяти. Временные метки на диске обновляются только тогда, когда (1) inode файла необходимо обновить для некоторых изменений, не связанных с временными метками файла, (2) происходит синхронизация с диском, (3) восстановленный inode вытесняется из памяти или (4 ), если с момента последней записи на диск хранящейся в памяти копии прошло более 24 часов.\n\n"
    },
    {
      "title": "Перемонтирование корневого раздела",
      "level": 3,
      "content": "Если по какой-то причине корневой раздел был неправильно смонтирован только на чтение, вы можете перемонтировать его с доступом на чтение-запись без перезагрузки, набрав\n\n```\n# mount -o remount,rw /\n```\n\n"
    },
    {
      "title": "Автомонтирование GPT-раздела",
      "level": 3,
      "content": "При использовании UEFI/GPT вы можете избавиться от необходимости указывать некоторые разделы в /etc/fstab, разметив их в соответствии с Discoverable Partitions Specification, и примонтировать эти разделы с помощьюsystemd-gpt-auto-generator(8). Смотрите systemd (Русский)#Автомонтирование GPT-раздела.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Полный список устройств, включающий также блочные устройства\n- Стандарт иерархии файловой системы (FHS)\n- Ускорение веб-сайта в 30 раз (подробнее о tmpfs)\n\n"
    }
  ]
}