{
  "title": "Fstab (Português)",
  "url": "https://wiki.archlinux.org/title/Fstab_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Nomeação persistente de dispositivo de bloco\n- Sistemas de arquivos\n- tmpfs\n- swap\n\nO arquivo fstab(5) pode ser usado para definir como partições do disco, vários outros dispositivos de bloco, ou sistemas de arquivos remotos devem ser montados no sistema.\n\nCada sistema de arquivos é descrito em uma linha separada. Estas definições serão convertidas dinamicamente em units de montagem do systemd durante a inicialização, e quando a configuração do gerenciador do sistema é recarregada. A configuração padrão vai automaticamente executar fsck e montar os sistemas de arquivos antes de iniciar serviços que precisam deles montados. Por exemplo, systemd automaticamente garante que a montagem de sistemas de arquivos remotos como NFS ou Samba é somente realizada depois da rede estar configurada. Portanto, a montagem de sistemas de arquivos locais e remotos especificados no /etc/fstab deve funcionar normalmente. Veja {{man|5|systemd.mount} para detalhes.\n\nO comando mount usará o fstab, se somente o diretório ou dispositivo é dado, para preencher o valor do outro parâmetro. Ao fazer isso, as opções de montagem que estão listadas no fstab também serão usadas.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Um simples /etc/fstab, usando UUIDs do sistema de arquivos:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                <dir> <type> <options> <dump> <fsck>\nUUID=0a3407de-014b-458b-b5c1-848e92a327a3 /     ext4   defaults  0      1\nUUID=f9fe0b69-a280-415d-a03a-a32752370dee none  swap   defaults  0      0\nUUID=b411dc99-f0a0-4c87-9e05-184977be8539 /home ext4   defaults  0      2\n```\n\n- <device>, dispositivo, descreve o dispositivo de bloco especial ou sistema de arquivos remoto a ser montado; veja #Identificando sistemas de arquivos.\n- <dir>, diretório, descreve o ponto de montagem.\n- <type>, o tipo do sistema de arquivos.\n- <options>, as opções de montagem associadas; veja mount(8) § FILESYSTEM-INDEPENDENT_MOUNT_OPTIONS e ext4(5) § MOUNT_OPTIONS.\n- <dump> é verificado pelo utilitário dump(8). Este campo é normalmente definido para 0, que desabilita a verificação.\n- <fsck> define a ordem de execução do fsck do sistema de arquivos na iniciliazação; veja fsck(8). Para o dispositivo raiz isto deve ser 1. Para outras partições deve ser 2, ou 0 para desabilitar a verificação.\n\n- O tipo auto deixa o comando de montagem supor que tipo de sistema de arquivos é usado. Isto é útil para mídias óticas (CD/DVD/Blu-ray).\n- Se o sistema de arquivos raiz é btrfs ou XFS (Português), a ordem do fsck deve ser definida para 0 ao invês de 1. veja fsck.btrfs(8) e fsck.xfs(8).\n\nTodos os dispositivos especificados dentro do /etc/fstab serão automaticamente montados na inicialização e quando o parâmetro -a é usado com mount(8) a menos que a opção noauto é especificada. Dispositivos que são listados e não estão presentes resultarão em um erro a menos que a opção nofail é usada.\n\nVeja fstab(5) § DESCRIPTION para detalhes.\n\n"
    },
    {
      "title": "Identificando sistemas de arquivos",
      "level": 2,
      "content": "Existem diferentes maneiras de identificar sistemas de arquivos que serão montados no /etc/fstab: o descritor de nomes do kernel, rótulo e UUID do sistema de arquivos, e rótulo e UUID da partição GPT. UUID ou PARTUUID devem ser preferidos sobre o descritor de nomes do kernel e rótulos. Veja nomeação persistente de dispositivo de bloco para mais explicações. É recomendado a leitura dele antes de continuar lendo este.\n\nNeste seção, será descrito como montar sistemas de arquivos usando todos os métodos de montagem disponíveis por meio de exemplos. A saída dos comandos lsblk -f e blkid usados nos seguintes exemplos estão disponíveis no artigo Nomeação persistente de dispositivo de bloco.\n\nPara usar descritores de nomes do kernel, use /dev/sdxy na primeira coluna.\n\n"
    },
    {
      "title": "Descritores de nomes do kernel",
      "level": 3,
      "content": "Execute lsblk -f para listar as partições e prefixar os valores na coluna NAME com /dev/.\n\n```\n/etc/fstab\n```\n\n```\n# <device>        <dir>        <type>        <options>        <dump> <fsck>\n/dev/sda1         /boot        vfat          defaults         0      2\n/dev/sda2         /            ext4          defaults         0      1\n/dev/sda3         /home        ext4          defaults         0      2\n/dev/sda4         none         swap          defaults         0      0\n```\n\n"
    },
    {
      "title": "Rótulos do sistema de arquivos",
      "level": 3,
      "content": "Execute lsblk -f para listar as partições, e prefixe os valore na coluna LABEL (rótulo em português) com LABEL= ou alternativamente execute blkid e use os valores LABEL sem aspas:\n\n```\n/etc/fstab\n```\n\n```\n# <device>        <dir>        <type>        <options>        <dump> <fsck>\nLABEL=ESP         /boot        vfat          defaults         0      2\nLABEL=SYSTEM      /            ext4          defaults         0      1\nLABEL=DATA        /home        ext4          defaults         0      2\nLABEL=SWAP        none         swap          defaults         0      0\n```\n\n"
    },
    {
      "title": "UUIDs do sistema de arquivos",
      "level": 3,
      "content": "Execute lsblk -f para listar as partições, e prefixe os valores na coluna UUID com UUID= ou alternativamente execute blkid e use os valores UUID sem as aspas:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                <dir> <type> <options> <dump> <fsck>\nUUID=CBB6-24F2                            /boot vfat   defaults  0      2\nUUID=0a3407de-014b-458b-b5c1-848e92a327a3 /     ext4   defaults  0      1\nUUID=b411dc99-f0a0-4c87-9e05-184977be8539 /home ext4   defaults  0      2\nUUID=f9fe0b69-a280-415d-a03a-a32752370dee none  swap   defaults  0      0\n```\n\n"
    },
    {
      "title": "Rótulos de partição GPT",
      "level": 3,
      "content": "Execute blkid para listar as partições, e use os valores PARTLABEL sem as aspas:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                           <dir> <type> <options> <dump> <fsck>\nPARTLABEL=EFI\\040SYSTEM\\040PARTITION /boot vfat   defaults  0      2\nPARTLABEL=GNU/LINUX                  /     ext4   defaults  0      1\nPARTLABEL=HOME                       /home ext4   defaults  0      2\nPARTLABEL=SWAP                       none  swap   defaults  0      0\n```\n\n"
    },
    {
      "title": "UUIDs de partição GPT",
      "level": 3,
      "content": "Execute blkid para listar as partições, e use os valores PARTUUID sem as aspas:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                    <dir> <type> <options> <dump> <fsck>\nPARTUUID=d0d0d110-0a71-4ed6-936a-304969ea36af /boot vfat   defaults  0      2\nPARTUUID=98a81274-10f7-40db-872a-03df048df366 /     ext4   defaults  0      1\nPARTUUID=7280201c-fc5d-40f2-a9b2-466611d3d49e /home ext4   defaults  0      2\nPARTUUID=039b6c1c-7553-4455-9537-1befbc9fbc5b none  swap   defaults  0      0\n```\n\n"
    },
    {
      "title": "Automontagem com systemd",
      "level": 3,
      "content": "Veja systemd.mount(5) para todas as opções de montagem.\n\n"
    },
    {
      "title": "Partição local",
      "level": 4,
      "content": "No caso de uma grande partição, pode ser mais eficiente permitir serviços que não dependem dela para iniciar enquanto o fsck é executado nela. Para fazer isso adicione as seguintes opções na entrada do fstab da partição:\n\n```\nnoauto,x-systemd.automount\n```\n\nAssim o fsck e a montagem vão ser somente executados quando ela é primeiro acessada, e o kernel colocará no buffer todo o acesso a arquivos dela até que esteja pronta. Este método pode ser relevante se ter, por exemplo, uma partição /home significantemente grande.\n\n"
    },
    {
      "title": "Sistema de arquivos remoto",
      "level": 4,
      "content": "O mesmo se aplica para a montagem de sistema de arquivos remoto. Se você quer que eles sejam montados somente no acesso, você precisa usar os parâmetros noauto,x-systemd.automount. Adicionalmente, você pode usar a opção x-systemd.mount-timeout= para especificar quanto o systemd deve esperar para o comando de montagem terminar. Também, a opção _netdev garante que o systemd entende que a montagem depende da rede e que faça ela depois que a rede está conectada.\n\n```\nnoauto,x-systemd.automount,x-systemd.mount-timeout=30,_netdev\n```\n\n"
    },
    {
      "title": "Sistema de arquivos criptografado",
      "level": 4,
      "content": "Se você tem sistemas de arquivos criptografados com keyfiles, você pode também adicionar o parâmetro noauto para a entrada correspondente no /etc/crypttab. systemd não irá então abrir o dispositivo criptografado na inicialização, ao invês disso vai esperar até que ele seja acessado e então automaticamente abrí-lo com a keyfile especificada antes de montar. Isto pode salvar alguns segundos na inicialização se você está usando um dispositivo RAID criptografado por exemplo, porquê o systemd não precisa esperar pelo dispositivo se tornar disponível. Por exemplo:\n\n```\n/etc/crypttab\n```\n\n```\ndata /dev/md0 /root/key noauto\n```\n\n"
    },
    {
      "title": "Desmontar automaticamente",
      "level": 4,
      "content": "Você pode também especificar um periodo máximo de ociosidade para um dispositivo montado com o parâmetro x-systemd.idle-timeout. Por exemplo:\n\n```\nnoauto,x-systemd.automount,x-systemd.idle-timeout=1min\n```\n\nIsto vai fazer o systemd desmontar o dispositivo depois dele ficar ocioso por 1 minuto.\n\n"
    },
    {
      "title": "Dispositivos externos",
      "level": 3,
      "content": "Dispositivos externos que são montados quando presentes mas ignorados quando não, podem precisar da opção nofail. Isto previne erros sendo reportados na inicialização. Por exemplo:\n\n```\n/etc/fstab\n```\n\n```\n/dev/sdg1        /media/backup    jfs    nofail,x-systemd.device-timeout=1ms    0  2\n```\n\nA opção nofail é melhor combinada com a opção x-systemd.device-timeout. Devido ao tempo máximo de espera padrão de um dispositivo ser 90 segundos, então um dispositivo externo desconectado com somente nofail vai fazer sua inicialização 90 segundos mais longa, a menos que você reconfigure o tempo máximo de espera como mostrado. Tenha a certeza de não definí-lo como 0, já que isto é traduzido para o infinito.\n\n"
    },
    {
      "title": "Espaços no caminho do arquivo",
      "level": 3,
      "content": "Desde que espaços são usados no fstab para delimitar campos, se qualquer campo (PARTLABEL, LABEL ou o ponto de montagem) contém espaços, estes espaços devem ser trocados pelo caractere \\ seguido pelo código octal de 3 dígitos 040:\n\n```\n/etc/fstab\n```\n\n```\nUUID=47FA-4071     /home/usuario/Fotos\\040da\\040camera       vfat  defaults      0  0\n/dev/sda7          /media/100\\040GB\\040(Armazenamento)       ext4  defaults,user 0  2\n```\n\n"
    },
    {
      "title": "Opções atime",
      "level": 3,
      "content": "Abaixo opções atime que podem ter impacto no desempenho do dispositivo de armazenamento.\n\n- A opção strictatime atualiza o tempo de acesso dos arquivos toda vez que eles são acessados. Isto é útil quando o Linux é usado para servidores; não tem muito valor para usuários comuns. A desvantagem da opção strictatime é que até mesmo ler de um arquivo do page cache (ler da memória ao invês do dispositivo de armazenamento) vai resultar em uma escrita.\n- A opção noatime totalmente desabilita a escrita do tempo de acesso do arquivo para o dispositivo de armazenamento toda vez que ele é acessado. Funciona bem para quase todos as aplicações, exceto as que precisam saber se um arquivo foi lido desde a última vez que foi modificado. A informação do tempo de escrita do arquivo continuará a ser atualizada em qualquer momento que o arquivo é modificado com esta opção habilitada.\n- A opção nodiratime desabilita a escrita do tempo de acesso de um arquivo somente para diretórios enquanto outros arquivos vão ainda ter seu tempo de acesso escrito. Nota: noatime implica nodiratime. Você não precisa especificar ambos.\n- relatime atualiza o tempo de acesso somente se o tempo de acesso anterior for anterior ao tempo atual de modificação ou alteração. Adicionalmente, desde o Linux 2.6.30, o tempo de acesso é sempre atualizado se desde a última modificação tiver passado mais de 24 horas. Esta opção é usada quando a opção defaults, atime (que significa que o kernel vai usar o padrão, que é relatime; veja mount(8) e wikipedia:Stat (system call)#Criticism of atime) ou nenhuma opção é especificada.\n\nQuando usar Mutt ou outra aplicação que precisa saber se um arquivo foi lido desde a última vez que foi modificado, a opção noatime não deve ser usada; usar a opção relatime é aceitável e ainda oferece uma melhora de desempenho.\n\nDesde o kernel 4.0 existe outra opção relacionada:\n\n- lazytime reduz escrita para o disco ao manter as mudanças no timestamp do nó-i (tempo de acesso, modificação e criação) somente em memória. Os timestamps no disco são atualizados somente quando (1) o nó-i do arquivo precisa ser atualizado por alguma mudança não relacionada ao timestamp do arquivo, (2) uma sincronização para o disco ocorre, (3) um nó-i não deletado é expulso da memória ou (4) se mais que 24 horas passaram desde a última vez que a cópia em memória foi escrita no disco.\n\nNote que a opção lazytime funciona em conjunto com as opção *atime acima mencionadas, não como uma alternativa. Que é relatime por padrão, mas pode ser até mesmo strictatime com o mesmo ou menor custo da escrita no disco como a opção relatime sozinha.\n\n"
    },
    {
      "title": "Remontar a partição raiz",
      "level": 3,
      "content": "Se por alguma razão a partição raiz foi inapropriadamente montada como somente leitura, remontar a partição raiz com acesso a leitura-escrita pode ser feito com o seguinte comando:\n\n```\n# mount -o remount,rw /\n```\n\n"
    },
    {
      "title": "Automontagem de partição GPT",
      "level": 3,
      "content": "Em um disco particionado com GPT é possível omitir as partições /, /home, /srv e swap do /etc/fstab ao particionar de acordo com a Discoverable Partitions Specification. Veja systemd#Montagem automática de partição GPT.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Full device listing including block device\n- Filesystem Hierarchy Standard\n- 30x Faster Cache and Site Speed with TMPFS\n\n"
    }
  ]
}