{
  "title": "Fstab (Italiano)",
  "url": "https://wiki.archlinux.org/title/Fstab_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articoli correlati\n\n- Persistent block device naming\n- File systems (Italiano)\n- tmpfs\n- swap\n- genfstab\n\nIl file fstab(5) può essere utilizzato per definire come le partizioni dei dischi, vari altri dispositivi a blocchi o file system remoti debbano essere montati all'interno del file system.\n\nOgni file system è descritto in una linea separata. Queste definizioni verranno convertite dinamicamente in unità di montaggio systemd al momento del boot e quando la configurazione del gestore di sistema viene ricaricata. Per impostazione predefinita verrà eseguito automaticamente il controllo del file system e il montaggio dei file system prima di avviare i servizi che potrebbero necessitare di detti file system. Ad esempio, systemd assicura in modo automatico che il montaggio dei file system remoti quali NFS o Samba venga avviato solo una volta completata l’impostazione della rete. Pertanto il montaggio dei file system specificati in /etc/fstab, sia locali che remoti, dovrebbe funzionare senza bisogno di ulteriori impostazioni. Vedere systemd.mount(5) per maggiori dettagli.\n\nQualora venga passato come argomento solo uno tra la directory di montaggio o il dispositivo, il comando mount utilizzerà fstab per completare il valore relativo all’altro parametro. In questo caso vengono applicate anche le opzioni di montaggio elencate in fstab.\n\n"
    },
    {
      "title": "Utilizzo",
      "level": 2,
      "content": "Un semplice file /etc/fstab, con utilizzo degli UUID dei file system:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                <dir> <type> <options> <dump> <fsck>\nUUID=0a3407de-014b-458b-b5c1-848e92a327a3 /     ext4   defaults  0      1\nUUID=f9fe0b69-a280-415d-a03a-a32752370dee none  swap   defaults  0      0\nUUID=b411dc99-f0a0-4c87-9e05-184977be8539 /home ext4   defaults  0      2\n```\n\n- <device> descrive il dispositivo a blocchi speciale o il file system remoto da montare; vedere #Identificazione dei file system.\n- <dir> descrive la directory di montaggio.\n- <type> il tipo di file system.\n- <options> lo opzioni di montaggio associate; vedere mount(8) § FILESYSTEM-INDEPENDENT MOUNT OPTIONS e ext4(5) § Mount options for ext4.\n- <dump> viene verificato dallo strumento dump(8). Il valore di questo campo è di norma impostato su 0, con conseguente disabilitazione della verifica.\n- <fsck> definisce l’ordine dei controlli del file system al momento del boot; vedere fsck(8). Il valore per il dispositivo root dovrebbe essere 1. Per le altre partizioni dovrebbe essere 2, o 0 per disabilitare il controllo.\n\n- L’opzione auto per il tipo lascia che sia il comando mount a identificare il tipo di file system utilizzato. Questa soluzione risulta utile per i dispositivi ottici (CD/DVD/Blu-ray).\n- Se il file system root è btrfs o XFS, l’ordine di controllo del file system dovrebbe essere impostato su 0 anziché 1. Vedere fsck.btrfs(8) e fsck.xfs(8).\n\nTutti i dispositivi specificati all’interno di /etc/fstab verranno montati automaticamente all’avvio e quando viene utilizzata la flag -a con il comando mount(8), a meno che non sia specificata l’opzione noauto. I dispositivi elencati ma non presenti daranno origine a un errore, a meno che non sia utilizzata l’opzione nofail.\n\nVedere fstab(5) § DESCRIPTION per i dettagli.\n\n"
    },
    {
      "title": "Identificazione dei file system",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nCi sono diversi modi di identificare i file system che verranno montati in /etc/fstab: descrittore del nome del kernel, etichetta del file system e UUID, e etichetta della partizione GPT e UUID per i dischi GPT. Si consiglia evitare l’utilizzo dei descrittori del nome del kernel, e di preferire l’uso degli UUID o degli PARTUUID a quello delle etichette. Vedere Persistent block device naming per spiegazioni più dettagliate. Si raccomanda di leggere questo articolo prima proseguire nella lettura di questa pagina.\n\nIn questa sezione procederemo a descrivere, con l’ausilio di esempi, come montare i file system utilizzando tutti i metodi di montaggio disponibili. L’output dei comandi lsblk -f e blkid utilizzato nei seguenti esempi è disponibile nell’articolo Persistent block device naming.\n\n"
    },
    {
      "title": "Descrittori del nome del kernel",
      "level": 3,
      "content": "Eseguire lsblk -f per elencare le partizioni e aggiungere /dev/ come prefisso ai valori nella colonna \"NAME\".\n\n```\n/etc/fstab\n```\n\n```\n# <device>        <dir>        <type>        <options>        <dump> <fsck>\n/dev/sda1         /boot        vfat          defaults         0      2\n/dev/sda2         /            ext4          defaults         0      1\n/dev/sda3         /home        ext4          defaults         0      2\n/dev/sda4         none         swap          defaults         0      0\n```\n\n"
    },
    {
      "title": "Etichette dei file system",
      "level": 3,
      "content": "Eseguire lsblk -f per elencare le partizioni, e aggiungere LABEL= come prefisso ai valori nella colonna LABEL o, in alternativa, eseguire blkid e utilizzare i valori LABEL senza le virgolette:\n\n```\n/etc/fstab\n```\n\n```\n# <device>        <dir>        <type>        <options>        <dump> <fsck>\nLABEL=ESP         /boot        vfat          defaults         0      2\nLABEL=System      /            ext4          defaults         0      1\nLABEL=Data        /home        ext4          defaults         0      2\nLABEL=Swap        none         swap          defaults         0      0\n```\n\n"
    },
    {
      "title": "UUID dei file system",
      "level": 3,
      "content": "Eseguire lsblk -f per elencare le partizioni, e aggiungere UUID= come prefisso ai valori nella colonna UUID o, in alternativa, eseguire blkid e utilizzare i valori UUID senza le virgolette:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                <dir> <type> <options> <dump> <fsck>\nUUID=CBB6-24F2                            /boot vfat   defaults  0      2\nUUID=0a3407de-014b-458b-b5c1-848e92a327a3 /     ext4   defaults  0      1\nUUID=b411dc99-f0a0-4c87-9e05-184977be8539 /home ext4   defaults  0      2\nUUID=f9fe0b69-a280-415d-a03a-a32752370dee none  swap   defaults  0      0\n```\n\n"
    },
    {
      "title": "Etichette delle partizioni GPT",
      "level": 3,
      "content": "Eseguire blkid per elencare le partizioni, e utilizzare i valori PARTLABEL senza le virgolette:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                           <dir> <type> <options> <dump> <fsck>\nPARTLABEL=EFI\\040system\\040partition /boot vfat   defaults  0      2\nPARTLABEL=GNU/Linux                  /     ext4   defaults  0      1\nPARTLABEL=Home                       /home ext4   defaults  0      2\nPARTLABEL=Swap                       none  swap   defaults  0      0\n```\n\n"
    },
    {
      "title": "UUID delle partizioni GPT",
      "level": 3,
      "content": "Eseguire blkid per elencare le partizioni, e utilizzare i valori PARTUUID senza le virgolette:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                                    <dir> <type> <options> <dump> <fsck>\nPARTUUID=d0d0d110-0a71-4ed6-936a-304969ea36af /boot vfat   defaults  0      2\nPARTUUID=98a81274-10f7-40db-872a-03df048df366 /     ext4   defaults  0      1\nPARTUUID=7280201c-fc5d-40f2-a9b2-466611d3d49e /home ext4   defaults  0      2\nPARTUUID=039b6c1c-7553-4455-9537-1befbc9fbc5b none  swap   defaults  0      0\n```\n\n"
    },
    {
      "title": "Montaggio automatico con systemd",
      "level": 3,
      "content": "Vedere systemd.mount(5) per tutte le opzioni di montaggio di systemd.\n\n"
    },
    {
      "title": "Partizione locale",
      "level": 4,
      "content": "Nel caso di una partizione di grandi dimensioni, potrebbe risultare più efficiente consentire l'avvio dei servizi che non dipendono da essa mentre viene eseguito il controllo fsck. È possibile farlo aggiungendo le seguenti opzioni alla voce in /etc/fstab per la partizione interessata:\n\n```\nx-systemd.automount\n```\n\nQuest'opzione fa sì che la partizione venga controllata da fsck e montata solo quando viene effettuato il primo accesso alla partizione stessa, e il kernel conserverà un buffer di tutti gli accessi ai file fino a quando non sarà pronta. Questo metodo può essere utile nel caso, ad esempio, di una partizione /home di dimensioni significative.\n\n"
    },
    {
      "title": "File system remoti",
      "level": 4,
      "content": "Lo stesso principio si applica al montaggio dei file system remoti. Se si desidera montarli solo all'accesso, sarà necessario utilizzare i parametri x-systemd.automount. In aggiunta, è possibile utilizzare l'opzione x-systemd.mount-timeout= per specificare il tempo per cui systemd deve attendere che l'operazione di montaggio si completi. Inoltre, l'opzione _netdev assicura che systemd capisca che l'operazione di montaggio dipende dalla rete e che ne ordini pertanto l'esecuzione solo dopo che la rete stessa risulti online.\n\n```\nx-systemd.automount,x-systemd.mount-timeout=30,_netdev\n```\n\n"
    },
    {
      "title": "File system cifrati",
      "level": 4,
      "content": "Note: **This article or section is a candidate for merging with dm-crypt/System configuration#Mounting on demand.** This article or section is a candidate for merging with dm-crypt/System configuration#Mounting on demand.\n\nThis article or section is a candidate for merging with dm-crypt/System configuration#Mounting on demand.\n\nIn presenza di file system cifrati con keyfile, è inoltre possibile aggiungere il parametro noauto alle voci corrispondenti in /etc/crypttab. In questo caso, systemd non aprirà il dispositivo cifrato al boot, attendendo invece il momento in cui vi viene effettivamente fatto l'accesso per aprirlo quindi in modo automatico utilizzando il keyfile specificato prima di montarlo. Questo accorgimento potrebbe permettere di risparmiare alcuni secondi in fase di boot se, ad esempio, si utilizza un dispositivo RAID cifrato, poiché systemd non deve attendere che il dispositivo divenga disponibile. Ad esempio:\n\n```\n/etc/crypttab\n```\n\n```\ndata /dev/md/MyRAIDArray /etc/cryptsetup-keys.d/data.key noauto\n```\n\n"
    },
    {
      "title": "Smontaggio automatico",
      "level": 4,
      "content": "È inoltre possibile specificare un timeout di idle per un dispositivo montato utilizzando la flag x-systemd.idle-timeout. Ad esempio:\n\n```\nx-systemd.automount,x-systemd.idle-timeout=1min\n```\n\nCiò darà istruzione a systemd di smontare il dispositivo montato dopo che questo si sia trovato per 1 minuto in stato di idle.\n\n"
    },
    {
      "title": "Dispositivi esterni",
      "level": 3,
      "content": "I dispositivi esterni che devono essere montati quando presenti ma ignorati se assenti potrebbero richiedere l'utilizzo dell'opzione nofail. Questo accorgimento impedisce che vengano riportati errori durante il boot. Ad esempio:\n\n```\n/etc/fstab\n```\n\n```\nLABEL=MyExternalDrive /media/backup    jfs    nofail,x-systemd.device-timeout=5    0  2\n```\n\nL'opzione nofail andrebbe idealmente abbinata all'opzione x-systemd.device-timeout. Ciò in ragione del fatto che il tempo di timeout del dispositivo è, per impostazione predefinita, 90 secondi, pertanto un dispositivo esterno disconnesso e con la sola opzione nofail comporterà un aumento di 90 secondi del tempo di boot, a meno di riconfigurare il timeout come illustrato. Assicurarsi di non impostare il timeout su 0, in quanto questo valore di traduce in un tempo di timeout infinito.\n\n"
    },
    {
      "title": "Spazi nel percorso del file",
      "level": 3,
      "content": "Dal momento che in fstab gli spazi sono utilizzati per delimitare i campi, se un qualunque campo (PARTLABEL, LABEL o il punto di montaggio) contiene spazi, questi devono essere sostituiti con caratteri di escape \\ seguiti dal codice a tre cifre in base otto 040:\n\n```\n/etc/fstab\n```\n\n```\nUUID=47FA-4071         /home/username/Camera\\040Pictures   vfat  defaults      0  0\nLABEL=Storage\\040drive /media/100\\040GB\\040(Storage)       ext4  defaults,user 0  2\n```\n\n"
    },
    {
      "title": "Opzioni atime",
      "level": 3,
      "content": "Le opzioni atime indicate di seguito possono condizionare le prestazioni dei drive.\n\n- L'opzione strictatime aggiorna l'ora di accesso dei file a ogni accesso ai file stessi. Quest'opzione risulta maggiormente significativa nei casi in cui Linux è utilizzato per i server, mentre risulta poco sensata negli utilizzi desktop. Lo svantaggio dell'opzione strictatime è rappresentato dal fatto che anche la lettura di un file dalla cache della pagina (lettura effettuata dalla memoria anziché dal drive) risulterà in un'operazione di scrittura.\n- L'opzione noatime disabilita completamente la scrittura dell'ora di accesso ai file sul drive a ogni lettura dei file stessi. Questa configurazione funziona in modo ottimale per pressoché tutte le applicazioni, fatta eccezione per quelle in cui è necessario sapere se il file è stato letto dall'ultima volta in cui è stato modificato. Con questa opzione abilitata, l'informazione sull'ora di scrittura su un file continuerà a essere aggiornata ogniqualvolta che viene effettuata una scrittura sul file stesso.\n- L'opzione nodiratime disabilita la scrittura dell'ora di accesso ai file solo per le directory mentre l'ora di accesso continua a essere scritta per gli altri file. Nota: noatime implica nodiratime. Non è necessario specificare entrambe le opzioni.\n- relatime aggiorna l'ora di accesso solo se l'ora di accesso precedente era precedente all'ora attuale di modifica. Inoltre, a partire dalla versione 2.6.30 di Linux, l'ora di accesso viene sempre aggiornata se l'ora di accesso precedente risulta oltre 24 nel passato. Quest'opzione viene utilizzata quando è impostata l'opzione defaults, l'opzione atime (il che significa utilizzare l'impostazione di default del kernel, che è relatime; vedere mount(8) e Wikipedia) o quando non è impostata alcuna opzione.\n\nQuando si utilizza Mutt o altre applicazioni che necessitano di sapere se il file è stato letto dall'ultima volta in cui è stato modificato, è opportuno non utilizzare l'opzione noatime; l'utilizzo dell'opzione relatime è accettabile pur garantendo allo stesso tempo un miglioramento delle prestazioni.\n\nA partire dalla versione 4.0 del kernel è disponibile un'ulteriore opzione:\n\n- lazytime riduce le scritture sul disco conservando le modifiche nei timestamp inode (ore di accesso, modifica creazione) solo in memoria. I timestamp sul disco vengono aggiornati solo allorché (1) l'inode del file debba essere aggiornato per una modifica non correlata ai timestamp del file, (2) si verifichi un errore di sincronizzazione con un disco, (3) un inode non cancellato sia espulso dalla memoria o (4) siano trascorse oltre 24 ore dall'ultima volta in cui una copia in memoria è stata scritta su disco.\n\nÈ importante notare che l'opzione lazytime funziona in combinazione con le opzioni *atime precedentemente descritte, e non come alternativa ad esse. L'opzione abbinata per impostazione predefinita è relatime, ma potrebbe anche essere strictatime con un costo uguale o inferiore in termini di scritture su disco rispetto all'opzione di base relatime.\n\n"
    },
    {
      "title": "Rimontaggio della partizione root",
      "level": 3,
      "content": "Se per qualche motivo la partizione di root è stata impropriamente montata in sola lettura, rimontare la partizione di root con accesso in lettura-scrittura con il seguente comando:\n\n```\n# mount -o remount,rw /\n```\n\n"
    },
    {
      "title": "Montaggio automatico di una partizione GPT",
      "level": 3,
      "content": "Se si utilizza un sistema UEFI/GPT, è possibile omettere determinate partizioni da /etc/fstab effettuando il partizionamento come da specifiche sulle partizioni individuabili e lasciando che sia systemd-gpt-auto-generator(8) a effettuare il montaggio delle partizioni. Vedere systemd#GPT partition automounting.\n\n"
    },
    {
      "title": "Montaggio bind",
      "level": 3,
      "content": "È possibile montare le directory come link con l'opzione bind:\n\n```\n/etc/fstab\n```\n\n```\n# <device>                             <dir>                         <type> <options>     <dump> <fsck>\nUUID=94649E22649E06E0                  /media/user/OS/               ntfs    defaults,rw,errors=remount-ro  0  0\n/media/user/OS/Users/user/Music/       /home/user/Music/             none    defaults,bind 0   0\n/media/user/OS/Users/user/Pictures/    /home/user/Pictures/          none    defaults,bind 0   0\n/media/user/OS/Users/user/Videos/      /home/user/Videos/            none    defaults,bind 0   0\n/media/user/OS/Users/user/Downloads/   /home/user/Downloads/         none    defaults,bind 0   0\n/media/user/OS/Users/user/Documents/   /home/user/Documents/         none    defaults,bind 0   0\n/media/user/OS/Users/user/projects/    /home/user/projects/windows/  none    defaults,bind 0   0\n```\n\nVedere mount(8) § Bind mount operation per maggiori dettagli.\n\n"
    },
    {
      "title": "Generazione automatica di un file fstab utilizzando genfstab",
      "level": 3,
      "content": "È possibile utilizzare lo strumento genfstab per creare un file fstab. Vedere genfstab per maggiori dettagli.\n\n"
    },
    {
      "title": "Vedere anche",
      "level": 2,
      "content": "- Elenco completo dei dispositivi inclusi i dispositivi a blocchi\n- Standard per la gerarchia del file system\n- Velocità site e cache 30x superiore con TMPFS\n\n"
    }
  ]
}