{
  "title": "FUSE (Français)",
  "url": "https://wiki.archlinux.org/title/FUSE_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles apparentés\n\n- File systems\n\nFilesystem in UserSpacE, en français : « système de fichiers en espace utilisateur », souvent abrégé FUSE, est un logiciel libre permettant à un utilisateur sans privilèges particuliers d'accéder à un système de fichiers sans qu'il soit nécessaire de modifier les sources du noyau. Le code s'exécute en espace utilisateur : le module FUSE ne fait que fournir un pont vers l'interface du noyau.\n\n"
    },
    {
      "title": "Démontage",
      "level": 2,
      "content": "Les systèmes de fichiers FUSE peuvent être démontés en utilisant fusermount3(1) fourni par fuse3 ou en utilisant fusermount(1) fourni par fuse2. Par exemple :\n\n```\n$ fusermount3 -u mountpoint\n```\n\n"
    },
    {
      "title": "Liste des systèmes de fichiers FUSE",
      "level": 2,
      "content": "- adbfs-rootless — Monter un appareil Android connecté via USB.\n\n- apfs-fuse — Pilote FUSE pour APFS (Apple File System).\n\n- astreamfs — A(synchronous) Stream(ing) (fuse) F(ile)S(ystem).\n\n- AVFS — Un système de fichiers virtuels qui permet de parcourir des fichiers compressés (archives).\n\n- CurlFtpFS — Système de fichiers pour l'accès aux hôtes FTP basé sur FUSE et libcurl.\n\n- davfs2 — Pilote de système de fichiers qui vous permet de monter un dossier WebDAV.\n\n- EncFS — Système de fichiers cryptographiques empilables dans l'espace utilisateur.\n\n- fuse-archive — Servir une archive ou un fichier compressé en tant que système de fichiers FUSE en lecture seule.\n\n- fuseiso — Monte un ISO en tant qu'utilisateur normal.\n\n- gitfs — gitfs est un système de fichiers FUSE qui s'intègre totalement à git.\n\n- gocryptfs — gocryptfs est un système de fichiers cryptographique empilable dans l'espace utilisateur.\n\n- google-drive-ocamlfuse — Système de fichiers basé sur FUSE et appuyé par Google Drive, écrit en OCaml.\n\n- gphotofs — Module FUSE pour monter l'appareil photo comme un système de fichiers.\n\n- HubicFuse — Système de fichiers FUSE pour accéder au stockage cloud HubiC.\n\n- iFuse — Un système de fichiers FUSE pour accéder au contenu d'un iPhone ou d'un iPod Touch.\n\n- NTFS-3G — Pilote NTFS avec des capacités étendues.\n\n- s3fs — Système de fichiers basé sur FUSE bénéficiant du soutien d'Amazon S3.\n\n- splitviewfuse — Une vue sur un répertoire qui divise/fusionne les fichiers en segments.\n\n- SSHFS — Client de système de fichiers basé sur FUSE pour le montage de répertoires via SSH.\n\n- TMSU — Un outil en ligne de commande pour marquer vos fichiers et y accéder via un système de fichiers virtuel.\n\n- vdfuse — Montage des images disques VirtualBox (VDI/VMDK/VHD).\n\n- vramfs — Système de fichiers basé sur la VRAM.\n\n- wimmount — Monter les images Windows Imaging Format (WIM).\n\n- xbfuse — Monter une ISO Xbox (360).\n\n- xmlfs — Représenter un fichier XML sous forme de structure de répertoire pour un accès facile.\n\n- Media Transfer Protocol#FUSE filesystems (en)\n\n"
    },
    {
      "title": "Voir également",
      "level": 2,
      "content": "- Wikipedia:fr:Filesystem in Userspace#Exemples\n\n"
    }
  ]
}