{
  "title": "FUSE (Español)",
  "url": "https://wiki.archlinux.org/title/FUSE_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-11-10** \n\nEl sistema de archivos en el espacio de usuario (FUSE) es un mecanismo para sistemas operativos similares a Unix que permite a los usuarios sin privilegios de root crear sus propios sistemas de archivos sin editar el código del kernel. Esto se logra ejecutando el código del sistema de archivos en el espacio de usuario, mientras que el módulo del kernel FUSE proporciona solo un «puente» a las interfaces reales del kernel.\n\n"
    },
    {
      "title": "Desmontaje",
      "level": 2,
      "content": "Los sistemas de archivos FUSE se pueden desmontar con:\n\n```\n$ fusermount -u punto_de_montaje\n```\n\n"
    },
    {
      "title": "Lista de sistemas de archivos FUSE",
      "level": 2,
      "content": "- adbfs-git — Monta un dispositivo Android conectado a través de USB..\n\n- apfs-fuse-git — Controlador de FUSE para APFS (sistema de archivos de Apple).\n\n- CloudFusion — Sistema de archivos Linux (FUSE) para acceder a los servidores Dropbox, Sugarsync, Amazon S3, Google Drive o WebDAV.\n\n- CurlFtpFS — Sistema de archivos para acceder a servidores FTP basados ​​en FUSE y libcurl.\n\n- davfs2 — Controlador del sistema de archivos que permite montar una carpeta WebDAV.\n\n- EncFS — Sistema de archivos criptográfico apilable del espacio del usuario.\n\n- fuseiso — Monta una ISO como usuario regular.\n\n- gitfs — gitfs es un sistema de archivos FUSE que se integra completamente con git.\n\n- gocryptfs — gocryptfs es un sistema de archivos criptográfico apilable de espacio de usuario.\n\n- google-drive-ocamlfuse — Sistema de archivos basado en FUSE respaldado por Google Drive, escrito en OCaml.\n\n- gphotofs — Módulo de FUSE para montar la cámara como un sistema de archivos.\n\n- MegaFuse — Cliente MEGA para Linux, basado en FUSE.\n\n- s3fs — Sistema de archivos basado en FUSE respaldado por Amazon S3.\n\n- SSHFS — Cliente de sistema de archivos basado en FUSE para montar directorios sobre SSH.\n\n- TMSU — Una herramienta de línea de órdenes para etiquetar los archivos y acceder a ellos a través de un sistema de archivos virtual.\n\n- vdfuse — Montaje de imágenes de discos de VirtualBox (VDI/VMDK/VHD).\n\n- xbfuse-git — Monta una Xbox (360) ISO.\n\n- xmlfs — Representa un archivo XML como una estructura de directorio para un fácil acceso.\n\n- Media Transfer Protocol#FUSE filesystems\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Wikipedia:Filesystem in Userspace#Example uses\n\n"
    }
  ]
}