{
  "title": "FUSE (Русский)",
  "url": "https://wiki.archlinux.org/title/FUSE_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Файловые системы\n\nФайловая система в пользовательском пространстве (Filesystem in Userspace, FUSE) — это механизм для Unix-подобных операционных систем, позволяющий непривилегированным пользователям создавать собственные файловые системы без редактирования кода ядра. Это достигается путём запуска кода файловой системы в пространстве пользователя (user space), в то время как модуль ядра FUSE обеспечивает только «мост» к реальным интерфейсам ядра.\n\n"
    },
    {
      "title": "Размонтирование",
      "level": 2,
      "content": "Пакет fuse2 предоставляет инструмент fusermount, позволяющий выполнить размонтирование:\n\n```\n$ fusermount -u точка-монтирования\n```\n\n"
    },
    {
      "title": "Список файловых систем FUSE",
      "level": 2,
      "content": "- adbfs — Монтирует устройства Android, подключенные через USB.\n\n- apfs-fuse — Драйвер FUSE для APFS (Apple File System).\n\n- astreamfs — A(synchronous) Stream(ing) (fuse) F(ile)S(ystem).\n\n- CurlFtpFS — Файловая система для доступа к FTP-хостам, основанная на FUSE и libcurl.\n\n- davfs2 — Драйвер файловой системы, позволяющий монтировать папку WebDAV.\n\n- EncFS — Стековая криптографическая файловая система, работающая в пространстве пользователя.\n\n- fuse-archive — Монтирует архив или сжатый файл только для чтения.\n\n- fuseiso — Позволяет монтировать ISO обычным пользователям.\n\n- gitfs — Файловая система FUSE, которая полностью интегрируется с git.\n\n- gocryptfs — Стековая криптографическая файловая система, работающая в пространстве пользователя.\n\n- google-drive-ocamlfuse — Файловая система для Google Drive, написанная на OCaml\n\n- gphotofs — Модуль FUSE для монтирования камеры как файловой системы.\n\n- HubicFuse — Файловая система FUSE для доступа к облачному хранилищу HubiC.\n\n- iFuse — Файловая система FUSE для доступа к содержимому iPhone или iPod Touch.\n\n- NTFS-3G — Драйвер NTFS с расширенными возможностями.\n\n- MegaFuse — Клиент MEGA для Linux, основанный на FUSE.\n\n- s3fs — Файловая система на основе FUSE для работы с Amazon S3.\n\n- splitviewfuse — Представление каталога, которое разделяет/сливает файлы на сегменты.\n\n- SSHFS — Монтирование каталогов через SSH.\n\n- TMSU — Инструмент командной строки для добавления тегов к файлам и доступа к ним через виртуальную файловую систему.\n\n- vdfuse — Монтирование образов дисков VirtualBox (VDI/VMDK/VHD).\n\n- vramfs — Файловая система, хранящая данные в памяти видеокарты.\n\n- wimmount — Монтирование образов в формате Windows Imaging Format (WIM).\n\n- xbfuse — Монтирование Xbox (360) ISO.\n\n- xmlfs — Представляет файл XML в виде структуры каталогов для лёгкого доступа.\n\n- Media Transfer Protocol#FUSE filesystems\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Wikipedia:Filesystem in Userspace#Applications\n\n"
    }
  ]
}