{
  "title": "Games (Lietuvių)",
  "url": "https://wiki.archlinux.org/title/Games_(Lietuvi%C5%B3)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- List of games\n- Xorg\n\nŠiame puslapyje yra informacija apie veikiančius žaidimus, bei sistemos konfiguracijos patarimai.\n\n"
    },
    {
      "title": "Žaidimų aplinkos",
      "level": 2,
      "content": "Linux egzistuoja keletas aplinkų skirtų žaisti žaidimams:\n\n- Vietinė – žaidimai parašyti Linux'ams.\n- Internetinė – žaidimai veikiantys interneto naršyklėje. HTML5 žaidimai naudoja kanvas bei WebGL technologijas ir veikia visose moderniose naršyklėse. Flash-paremti – žaidimui reikia įdiegti įskiepį.\n- Specializuotos aplinkos (programinės įrangos emuliatoriai) – Reikalingos paleisti kitoms architektūroms ar sistemoms sukurtą programinę įrangą. Daugiau detalių rasite list of emulators. Wine - leidžia paleisti kai kuriuos Windows žaidimus, taip pat didelį kiekį kitos Windows programinės įrangos. Wine aplinkoje našumas varijuoja, dėl papildomų CPU sąnaudų kai kurie žaidimai gali sulėtėti, kitais atvejais veikimas pagreitėja. Dėl specifinės suderinanumo informacijos konsultuokitės su Wine AppDB. Crossover Games - Codeweavers komandos nariai yra didžiuliai Wine rėmėjai. Naudojantis Crossover Games kai kurių žaidimų įdiegimas ir konfigūravimas tampa daug paprastesnis, patikimesnis ir netgi įmanomesnis, nei naudojantis kitais metodais. Crossover yra mokamas komercinis produktas, turintis ir forumą kur kūrėjai aktyviai dalyvauja bendruomės veikloje. DOSBox yra minimali virtualioji mašina, kurioje veikia pilna DOS aplinka. Ją galima naudoti žaižiant klasikinius DOS žaidimus. scummvm tai daugybės klasikinių point-and-click nuotykių žaidimų viskas-viename variklio reimplementacija. Visą suderinamų žaidimų sąrašą rasite ScummVM svetainėje. Panašiai į ScummVM, varikli7 reimplementacijos ir portai egzistuoja specifiniams žaidimams, kaip Doom.\n- Virtualias mašinas galima naudoti suderinamų operacinių sistemų įdiegimui(pvz.: Windows). VirtualBox turi gerą 3D palaikymą. Sekant iš to, jeigu turite suderinamą techninę įrangą galite išbandyti VGA pralaidą į Windows KVM svečia, raktinis žodis yra \"virtual function I/O\" (VFIO), arba PCI passthrough via OVMF.\n\n- HTML5 žaidimai naudoja kanvas bei WebGL technologijas ir veikia visose moderniose naršyklėse.\n- Flash-paremti – žaidimui reikia įdiegti įskiepį.\n\n- Wine - leidžia paleisti kai kuriuos Windows žaidimus, taip pat didelį kiekį kitos Windows programinės įrangos. Wine aplinkoje našumas varijuoja, dėl papildomų CPU sąnaudų kai kurie žaidimai gali sulėtėti, kitais atvejais veikimas pagreitėja. Dėl specifinės suderinanumo informacijos konsultuokitės su Wine AppDB.\n- Crossover Games - Codeweavers komandos nariai yra didžiuliai Wine rėmėjai. Naudojantis Crossover Games kai kurių žaidimų įdiegimas ir konfigūravimas tampa daug paprastesnis, patikimesnis ir netgi įmanomesnis, nei naudojantis kitais metodais. Crossover yra mokamas komercinis produktas, turintis ir forumą kur kūrėjai aktyviai dalyvauja bendruomės veikloje.\n- DOSBox yra minimali virtualioji mašina, kurioje veikia pilna DOS aplinka. Ją galima naudoti žaižiant klasikinius DOS žaidimus.\n- scummvm tai daugybės klasikinių point-and-click nuotykių žaidimų viskas-viename variklio reimplementacija. Visą suderinamų žaidimų sąrašą rasite ScummVM svetainėje.\n- Panašiai į ScummVM, varikli7 reimplementacijos ir portai egzistuoja specifiniams žaidimams, kaip Doom.\n\n"
    },
    {
      "title": "Žaidimų gavimas",
      "level": 2,
      "content": "Nemažą skaičių galima rasti official repositories / AUR, žiūrėti List of games.\n\n"
    },
    {
      "title": "Skaitmeninis platinimas",
      "level": 3,
      "content": "Vien dėl to, kad žaidimai prieinami Linux aplinkoje doesn't nereiškia, kad jie vietiniai, jie gali būti supakuoti kartu su Wine ar DOSBox.\n\n- Steam — Valve sukurta skaitmeninio platinimo ir bendravimo platforma.\n\n- itch.io — Indie žaidimų parduotuvė.\n\n- GOG.com GOG.com oficialiai palaiko tik Ubuntu ir Linux Mint. lgogdownloaderAUR paketas gali būti naudojamas GOG žaidimų įdiegimui iš komandinės eilutės.\n\n- GOG.com oficialiai palaiko tik Ubuntu ir Linux Mint.\n- lgogdownloaderAUR paketas gali būti naudojamas GOG žaidimų įdiegimui iš komandinės eilutės.\n\n"
    },
    {
      "title": "Emuliatoriai",
      "level": 2,
      "content": "Emuliatorius tai programa, kurios tikslas replikuoti kitos platformos ar sistemos funkcijas taip leidžiant veikti žaidimams bei programoms, kurie esamai aplinkai nesuprogramuoti.\n\nTaip pat žiūrėti Category:Emulation ir Emulation General wiki.\n\nNote: **nelegalu** \n\n"
    },
    {
      "title": "Konsolės",
      "level": 3,
      "content": "Taip pat žiūrėti Wikipedia:List of video game console emulators.\n\n- Citra — Nintendo 3DS emuliatorius.\n\n- DeSmuME — Nintendo DS emuliatorius.\n\n- Dolphin — Labai galingas GameCube ir Wii emuliatorius.\n\n- epsxe — PlayStation žaidimų konsolės skirtos x86 PK techninei įrangai emuliatorius.\n\n- FCEUX — NTSC ir PAL 8 bit Nintendo/Famicom emuliatorius, kuris yra originalaus FCE Ultra emuliatoriaus evoliucija. Tikslus, suderinamas ir aktyviai palaikomas.\n\n- gngeo — NeoGeo emuliatorius komandinėje eilutėje.\n\n- higan — Daugiasistemis emuliatorius daugiausiai dėmesio skiriantis tikslumui, palaikantis SNES, NES, GB, GBC, GBA.\n\n- Mupen64Plus — Aukšto suderinamumo Nintendo 64 emuliatorius su įskiepių sistema.\n\n- Nestopia — Labai tikslus NES emuliatorius.\n\n- pSX — Įskiepiais neparemtas PlayStation emuliatorius su neblogu suderinamumu.\n\n- PCSXR — PlayStation emuliatorius; Debian atšaka nuo originalaus bet apleisto PCSX\n\n- PCSX2 — PlayStation 2 emuliatorius. Visdar palaikomas ir vystomas. Reikalingi BIOS failai.\n\n- PPSSPP — PlayStation Portable emuliatorius.\n\n- Snes9x — Nešiojamos, nemokamos Super Nintendo Entertainment System (SNES) emuliatorius.\n\n- Visual Boy Advance — Game Boy emuliatorius su Game Boy Advance, Game Boy Color, ir Super Game Boy palaikymu.\n\n- ZSNES — Aukšo suderinamumo Super Nintendo emuliatorius.\n\n"
    },
    {
      "title": "Kita",
      "level": 3,
      "content": "- DOSBox — Atviro kodo DOS emuliatorius su pirmine užduotimi paleisti DOS žaidimus.\n\n- DOSEmu — Atviro kodo DOS emuliatorius.\n\n- MAME — Multiple Arcade Machine Emuliatorius.\n\n- RetroArch — Libretro frontend'as (emuliacijos biblioteka, naudojanti modifikuotas egzistuojančių emuliatorių versijas kaip įskiepius).\n\n- ScummVM — Virtuali mašina seniems nuotykiams.\n\n- X Neko Project II — PC-9801 emuliatorius.\n\n"
    },
    {
      "title": "Žaidimų paleidimas",
      "level": 2,
      "content": "Kai kuriems žaidimams ar jų tipams gali būti reikalinga speciali konfigūracija, kad jie veiktų kaip numatyta. Iš esmės, žaidimai tiesiog veiks Arch Linux galimai su geresniu našumu, nei kitose distribucijose dėl kompiliavimo optimizacijos. Tačiau, kai kurioms specialioms sąrankoms gali būti reikalinga konfigūracija, kad viskas veiktų kaip tikėtasi.\n\n"
    },
    {
      "title": "Daugiaekranė sąranka",
      "level": 3,
      "content": "Turint daugiau nei vieną ekraną gali kilti problemų su pilno ekrano žaidimais. Tokiu atveju, antro X serverio paleidimas gali būti išeitis. Kitą išeitį galima rasti NVIDIA straipsnyje (gali tikti ir ne NVIDIA naudotojams).\n\n"
    },
    {
      "title": "Klaviatūros sugriebimas",
      "level": 3,
      "content": "Daug žaidimų pagriebia klaviatūrą, taip neleisdami pakeisti langų (dar žinoma kaip alt-tabbing).\n\nKai kurie SDL žaidimai (pvz.: Guacamelee) leidžia išjungti pagriebimą paspaudžiant Ctrl-g.\n\n"
    },
    {
      "title": "Žaidimo paleidimas atskirame X serveryje",
      "level": 3,
      "content": "Kai kuriais atvejais, kaip paminėta aukščiau, gali būti reikalinga ar norėtūsi paleisti antrą X serverį. Antrojo X serverio paleidimas turi keletą privalumų, kaip: geresnis našumas, galimybė išsi\"tab\"inti iš žaidimo naudojant Ctrl+Alt+F7/Ctrl+Alt+F8, nenulūžta pagrininė X sesija (kuri gali būti atidaryta darbui), jei žaidimas sukonfliktuoja su grafine tvarkykle. Naujas X serveris bus kaip nuotolinės prieigos prisijungimas ALSA, todėl norėdamas girdėti audio naudotojas turės priklausyti audio grupei\n\nPradėti antrąjam X serveriui (kaip pavyzdį naudosime nemokamą pirmo asmens šaudyklę Xonotic) tiesiog padarykite:\n\n```\n$ xinit /usr/bin/xonotic-glx -- :1 vt$XDG_VTNR\n```\n\nŠitai toliau gali būti patobulinta naudojant atskirą X konfigūracijos failą:\n\n```\n$ xinit /usr/bin/xonotic-glx -- :1 -xf86config xorg-game.conf vt$XDG_VTNR\n```\n\nGera priežastis čia naudoti atskirą xorg.conf jei jūsų pirminė konfigūracija naudoja NVIDIA Twinview kuris tokius 3D žaidimus kaip Xonotic renderina viduryje daugiaekranės sąsajos, ir eina per visus ekranus. Šitai nėra pageidautina, todėl patartina paleisti antrą X severį su alternatyvia konfigūracija kur antrasis ekranas yra išjungtas.\n\nŽaidimo skriptas nauojantis Openbox jūsų namų direktorijoje arba /usr/local/bin galėtų atrodyti taip:\n\n```\n~/game.sh\n```\n\n```\nif [ $# -ge 1 ]; then\n        game=\"$(which $1)\"\n        openbox=\"$(which openbox)\"\n        tmpgame=\"/tmp/tmpgame.sh\"\n        DISPLAY=:1.0\n        echo -e \"${openbox} &\\n${game}\" > ${tmpgame}\n        echo \"starting ${game}\"\n        xinit ${tmpgame} -- :1 -xf86config xorg-game.conf || exit 1\nelse\n        echo \"not a valid argument\"\nfi\n```\n\nTaigi, po chmod +x jūs galėtumėte naudoti skriptą:\n\n```\n$ ~/game.sh xonotic-glx\n```\n\n"
    },
    {
      "title": "Pelės aptikimo reguliavimas",
      "level": 3,
      "content": "Žaidimams kuriuose reikia išskirtinių įgūdžių pele, mouse polling rate pareguliavimas, gali turėti įtakos tikslumui.\n\n"
    },
    {
      "title": "Binaurinis garsas su OpenAL",
      "level": 3,
      "content": "Žaidimams naudojantiems OpenAL, geresniam poziciniam garso išgavimui galima naudoti OpenAL HRTF filtrus. Jie įjungiami su komanda:\n\n```\necho \"hrtf = true\" >> ~/.alsoftrc\n```\n\nAlternatyvai, įdiekite openal-hrtfAUR iš AUR, ir paredaguokite nustatymus /etc/openal/alsoftrc.conf\n\nSource žaidimams, vidiniuose žaidimo nustatymuose norint įjungti HRTF `dsp_slow_cpu` turi būti `1`, kitaip žaidimas įjungs savo apdorojimą. Taip pat turėsite sureguliuoti Steam vietiniam \"runtime\" naudojimui, arba jo openal.so kopiją nukreipti į vietinę savo kopiją. Visiškam išpildymui naudokite šiuos nustatymus:\n\n```\ndsp_slow_cpu 1 # Disable in-game spatialiazation\nsnd_spatialize_roundrobin 1 # Disable spatialization 1.0*100% of sounds\ndsp_enhance_stereo 0 # Disable DSP sound effects. You may want to leave this on, if you find it does not interfere with your perception of the sound effects.\nsnd_pitchquality 1 # Use high quality sounds\n```\n\n"
    },
    {
      "title": "PulseAudio reguliavimas",
      "level": 3,
      "content": "Jei naudojate PulseAudio, galbūt norėsite pareguliuoti pradinius nustatymus optimalesniam veikimui.\n\n"
    },
    {
      "title": "Realaus laiko prioriteto ir neigiamo nice lygio įjungimas",
      "level": 4,
      "content": "Pulseaudio kaip auio daemon'as, sukurtas veikti su realaus laiko prioritetu. Tačiau saugumo sumetimais, pagal nutylėjimą įtrauktas į reugliarųjį posistemį. Šitam pataisymui, įsitikinkite, kad esate audio grupėje. Tuomet, nuimkite komentarą ir pakeiskite šitas eilutes /etc/pulse/daemon.conf:\n\n```\nhigh-priority = yes\nnice-level = -11\n```\n\n```\nrealtime-scheduling = yes\nrealtime-priority = 5\n```\n\ntada perkraukite pulseaudio.\n\n"
    },
    {
      "title": "Aukštesnės kokybės atkūrimo naudojimas geresniam garsui",
      "level": 4,
      "content": "PulseAudio Arch sistemoje pagal numatytuosius nustatymus kanalų atkūrimui naudoja speex-float-0 , atkūrime jie laikomi 'vidutinės-žemos' kokybės. Jei jūsų sistema gali palaikyti papildomą apkrovą, galite gauti naudos naudodamiesi šituo nustatymu:\n\n```\nresample-method = speex-float-10\n```\n\n"
    },
    {
      "title": "Techninės įrangos buferių suderinimas su Pulse buferingu",
      "level": 4,
      "content": "Buferių suderinimas gali sumažinti trukčiojimą ir marginaliai padidinti našumą. Daugiau detalių čia.\n\n"
    },
    {
      "title": "Kadrų skaičiaus ir reagavimo gerenimas su planavimo politika",
      "level": 2,
      "content": "Beveik kiekvienas žaidimas gauna naudos, jei branduoliui priskiriama teisinga planavimo politika užduočių prioretizavimui. Tačiau be daemon'o pagalbos šį perplanavimą reiktų atlikti patiems arba su keletu daemon'ų kiekvienai politikai. Šios politikos idealiai turėtų būtų nustatytos programų kiekvienai gijai atskirai, bet ne kiekvienas programuotojas šias politikas įgyvendina. Yra keletas metodų kurie vistiek turėtų veikti:\n\n"
    },
    {
      "title": "Wine programoms",
      "level": 3,
      "content": "Žiūrėti Wine#Performance\n\n"
    },
    {
      "title": "Visam kitam",
      "level": 3,
      "content": "Programoms kurios pačios planavimo politikų neįgyvendina, daugelį funkcijų automatiškai gali atlikti schedtool įrankis, ir su juo susijęs daemon'as schedtooldAUR. Programų politikų pataisymui, redaguokite /etc/schedtoold.conf ir pridėkite programas su norimais schedtool argumentais.\n\n"
    },
    {
      "title": "Politikos",
      "level": 4,
      "content": "Visų pirma ir svarbiausia nustatant planavimo politiką į SCHED_ISO ne tik leis procesams naudoti daugiausiai 80 procentų CPU, bet ir bandys sumažinti vėlavimą, bei trukčiojimą, kada tik įmanoma. SCHED_ISO veikimui reikia Linux-ck, kadangi jis įgyvendintas tik šiame branduolyje. Linux-ck pots iš savęs turėtų sumažinti vėlavimą, ir idealiu atveju turėtų būti įdiegtas. Dauguma jei ne visi žaiimai gaus naudos iš:\n\n```\nbit.trip.runner -I\n```\n\nNaudotojams nenaudojanties Linux-ck, SCHED_FIFO yra alternatyva, kuri galbūt veiks dar geriau. Turėtumėte išbandyti ar programos gerai veikia su SCHED_FIFO, jei taip, tisiog naudokite jį. Tačiau atsargiai, SCHED_FIFO gali priversti sistemą badaugti! Vietoje -I naudokite:\n\n```\nbit.trip.runner -F -p 15\n```\n\n"
    },
    {
      "title": "Nice lygiai",
      "level": 4,
      "content": "Antra, nice lygiai nustato kurios užduotys atliekamos pirmiau, didėjimo tvarka.Daugumai mutimedijos užduočių rekomenduojamas -4 nice lygis, taip pat ir žaidimams:\n\n```\nbit.trip.runner -n -4\n```\n\n"
    },
    {
      "title": "Core affinity",
      "level": 4,
      "content": "Vystyme yra truputis nesusipratimo, kas turėtų atlikti multithreading'ą tvarkyklė ar programa. Jei abu bandys tai atlikti, tai privers tik iki kadrų skaičiaus kritimo ir užlūžimo. Pavyzdžiai yra skaičius modernių žaidimų, ir bet kuri Wine programa veikianti su neišjungtu GLSL. pasirinkti vieną branduolį ir leisti tik tvarkyklei reguliuoti šį procesą, paprasčiausiai naudokite -a 0x# vėliavėlę, kur # branduolių skaičius, pvz.:\n\n```\nbit.trip.runner -a 0x1\n```\n\nnaudoja pirmą branduolį. Kai kurie CPU hyperthreaded'inti ir turi tik 2 ar 4 branduolius, bet rodo 4 ar 8, tokiems geriausia:\n\n```\nbit.trip.runner -a 0x5\n```\n\nkur naudojami virtualūs branduoliai 0101, ar 1 ir 3.\n\n"
    },
    {
      "title": "Bendras atvejis",
      "level": 4,
      "content": "Daugumai žaidimų kuriuose reikalinga aukštas kadrų skaidrius ir žemas vėlavimas, geriausia naudoti šias vėliavėles. Dauguma modernių žaidimų supranta teisingą panauojimą, tačiau atitikimą reiktų patikrinti kiekvienai programai. Bendram atvejui:\n\n```\nbit.trip.runner -I -n -4\nAmnesia.bin64 -I -n -4\nhl2.exe -I -n -4 -a 0x1 #Wine with GLSL enabled\n```\n\nt.t.\n\n"
    },
    {
      "title": "Optimus ir kitos padedančios programos",
      "level": 4,
      "content": "Kaip bendra taisyklė, bet kuris kitas procesas reikalingas žaidimo veikimui turėtų būti su aukštesniu nice lygiu, nei pats žaiimas. Keista, Wine turi tokią problemą kaip atvirkštinis planavimas, iš todažnai galima gauti naudos svarbiems procesams nustatant aukštesnį nice lygį. Wineserver taip pat besąlygiškai gauna nauos iš SCHED_FIFO, kadangi retai sunaudoja visą CPU ar jam reikia aukšestnių prioritetų nei įmanoma.\n\n```\noptirun -I -n -5\nwineserver -F -p 20 -n 19\nsteam.exe -I -n -5\n```\n\n"
    },
    {
      "title": "Alternatyvūs branduoliai",
      "level": 2,
      "content": "Įprastinis Arch branduolys suteikia puikųn pagrindą bednram naudojimui. Tačiau jei sistema turi mažiau, nei 16 branduolių ir naudojama pirmiausia kaip darbo stotis, galite paakoti truputį našumo darbo krūviui ir gauti daugiau interaktyvumo su Linux-ck. Naudodami pre-optimizuotą branduolį tikrai išlošite našume, tik svarbu pasirinkti tinkamą branduolio architektūrą.\n\n"
    },
    {
      "title": "BFQ naudojimas",
      "level": 3,
      "content": "BFQ yra io-planuoklis ateinantis kaip linux-zen ir Linux-ck funkcija, ir yra optimizuotas būti paprastesniu, bet suteikiantis daugiau interaktyvumo ir našumo ne-serveriniam darbui. Norėdami jį įjungti pridėkite branduolio parametrą elevator=bfq į savo boot loader. Svarbu paminėti, kad nors auguma gių rekomenduoja naudoti noop ar deadline SSD diskams dėl našumo, ttai iš tikrųjų kenkia našumui kai daugiau nei viena gija bando pasiekti prietaisą. Geriausia naudoti bfq nebent jums labai reikia to našumo privalumo.\n\n"
    }
  ]
}