{
  "title": "Gamemode (Polski)",
  "url": "https://wiki.archlinux.org/title/Gamemode_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Powiązane artykuły\n\n- MangoHud\n\nGameMode to zestaw demona i biblioteki dla systemu Linux, która pozwala grom zażądać tymczasowego zastosowania zestawu optymalizacji w systemie operacyjnym hosta i/lub procesie gry.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj gamemode oraz lib32-gamemode.\n\nDodaj się do grupy gamemode. Bez tego, demon użytkownika GameMode nie będzie miał praw do zmiany gubernatora CPU lub priorytetów procesów.\n\n"
    },
    {
      "title": "Konfiguracja",
      "level": 2,
      "content": "GameMode jest konfigurowany za pomocą następujących plików, które są odczytywane, a następnie łączone w następującej kolejności:\n\n1. /etc/gamemode.ini do konfiguracji całego systemu;\n1. $XDG_CONFIG_HOME/gamemode.ini do konfiguracji lokalnej użytkownika;\n1. ./gamemode.ini do konfiguracji lokalnego katalogu.\n\n"
    },
    {
      "title": "Priorytetowanie",
      "level": 3,
      "content": "GameMode może opcjonalnie dostosować priorytet procesów gry (patrz renice(1)) do poziomu przekraczającego dolny limit zwykłego użytkownika 0.\n\nJest to kontrolowane przez następującą opcję konfiguracji:\n\n```\n[general]\nrenice=0\n```\n\nW przeciwieństwie do zmiany klasyfikacji procesu za pomocą komendy renice, GameMode używa wartości dodatniej i neguje ją przed zastosowaniem do procesu, tj. wartość 10 zmieni klasyfikację procesu gry na -10.\n\n"
    },
    {
      "title": "Podkręcanie",
      "level": 3,
      "content": "Tryb GameMode może opcjonalnie podkręcać GPU podczas działania, ale wymaga to specjalnej konfiguracji ze strony użytkownika.\n\nNiezależnie od używanego GPU, opcje konfiguracji apply_gpu_optimizations i gpu_device muszą być odpowiednio ustawione.\n\n"
    },
    {
      "title": "AMD",
      "level": 4,
      "content": "Aby zmienić poziom wydajności procesorów graficznych AMD, należy ręcznie włączyć overclocking i ustawić opcję konfiguracji amd_performance_level.\n\n"
    },
    {
      "title": "NVIDIA",
      "level": 4,
      "content": "Aby zmienić poziom wydajności procesorów graficznych NVIDIA, należy ręcznie włączyć overclocking oraz ustawić opcje konfiguracyjne nv_powermizer_mode, nv_core_clock_mhz_offset i nv_mem_clock_mhz_offset.\n\n"
    },
    {
      "title": "Test konfiguracji",
      "level": 3,
      "content": "Sprawdź, czy ustawienia w pliku konfiguracyjnym działają:\n\n```\n$ gamemoded -t\n```\n\n"
    },
    {
      "title": "Uruchamianie pojedynczej gry",
      "level": 3,
      "content": "Aby uruchomić grę za pomocą GameMode, wykonaj:\n\n```\n$ gamemoderun ./game\n```\n\n"
    },
    {
      "title": "Użycie z MangoHud",
      "level": 4,
      "content": "Zobacz MangoHud#Use with GameMode\n\n"
    },
    {
      "title": "Sprawdź, czy GameMode jest uruchomiony",
      "level": 3,
      "content": "Po uruchomieniu gry można sprawdzić, czy GameMode jest uruchomiony za pomocą polecenia:\n\n```\n$ gamemoded -s\n```\n\n"
    },
    {
      "title": "Uruchamianie pojedynczej gry Steam",
      "level": 3,
      "content": "Aby Steam uruchomił grę za pomocą GameMode, kliknij prawym przyciskiem myszy grę w Bibliotece, wybierz Właściwości..., a następnie w polu tekstowym Opcje uruchamiania wpisz:\n\n```\ngamemoderun %command%\n```\n\n"
    },
    {
      "title": "Uruchamianie Steam za pomocą GameMode",
      "level": 3,
      "content": "Aby uniknąć konieczności zmiany opcji uruchamiania dla wszystkich gier Steam, możesz uruchomić Steam bezpośrednio za pomocą GameMode:\n\n```\n$ gamemoderun steam-runtime\n```\n\nWadą tego podejścia jest to, że GameMode będzie działał tak długo, jak długo otwarty jest proces Steam, a nie tylko wtedy, gdy otwarta jest gra.\n\n"
    }
  ]
}