{
  "title": "Ganglia",
  "url": "https://wiki.archlinux.org/title/Ganglia",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ganglia is a scalable distributed system monitor tool for high-performance computing systems such as clusters and grids. It allows the user to remotely view live or historical statistics (such as CPU load averages or network utilization) for all machines that are being monitored.\n\nThe Ganglia Wiki contains all the information you need to get started with Ganglia.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Ganglia can be installed with the gangliaAUR package, along with the web frontend ganglia-webAUR. There is also a reduced-dependency version named ganglia-minimalAUR for headless systems.\n\n"
    },
    {
      "title": "Ganglia Web Interface",
      "level": 2,
      "content": "The ganglia web frontend is available as the ganglia-webAUR package on the AUR.\n\nYou will also need a web server with a working PHP setup. The following sections include some example setups.\n\nMake sure that the open_basedir setting in your /etc/php/php.ini includes /tmp, /usr/share/webapps and /var/lib/ganglia.\n\n"
    },
    {
      "title": "Nginx with php-fpm",
      "level": 3,
      "content": "Firstly, install the nginx and php-fpm packages.\n\nSecondly, read the nginx article. Note its nginx#FastCGI and subsequent php-fpm sections. nginx#nginx configuration details a minimum nginx.conf to use.\n\nAn older minimal configuration for nginx would be something like this:\n\n```\n/etc/nginx/nginx.conf\n```\n\n```\nevents {\n  worker_connections  1024;\n}\n\nhttp {\n  include mime.types;\n  default_type application/octet-stream;\n\n  upstream php {\n    server unix:/run/php-fpm/php-fpm.sock;\n  }\n\n  server {\n    listen 80 default_server;\n\n    root /usr/share/webapps;\n    index index.php;\n\n    location ~ \\.php$ {\n      fastcgi_pass php;\n      include fastcgi.conf;\n    }\n  }\n}\n```\n\nThen start gmetad.service, gmond.service, php-fpm.service and nginx.service.\n\nGo to http://localhost/ganglia and check that your setup is working.\n\n"
    },
    {
      "title": "Issues with IP-address binding or undesirable hostnames",
      "level": 3,
      "content": "If bind_hostname = yes in the udp_send_channel section of gmond.conf, the gmond daemon will determine which IP to bind to (and report in the XML data) by determining the IP address of the default hostname. You should be able to replicate this behaviour with one of these commands:\n\n```\n$ hostname -i\n$ host $(hostname)\n```\n\nThe hostname to report is determined by asking the system to look up a hostname for the chosen IP address, in order to ensure the hostname is that by which other machines on the network identify the monitored machine:\n\n```\n$ host <ip-address>\n```\n\nThe hostname listed at the top of the list is the one that will be reported by gmond, and will appear in the web UI. You can influence the returned hostname by modifying your /etc/hosts or /etc/nsswitch.conf files. In particular, watch out for placing myhostname before dns on the hosts line in /etc/nsswitch.conf. This will cause gmond to attempt to bind to a UDP port on 127.0.0.1, and it will fail to load.\n\nIf you are not able to achieve the desired behaviour, the hostname can be overridden in the gmond.conf file by adding the following lines to the globals section:\n\n```\nglobals {\n  ...\n  override_hostname = myhostname.mydomain\n  override_ip = 127.0.0.2\n}\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- E-mail exchange explaining IP and Hostname lookup: https://www.mail-archive.com/ganglia-general@lists.sourceforge.net/msg01885.html\n\n"
    }
  ]
}