{
  "title": "GDB (Português)",
  "url": "https://wiki.archlinux.org/title/GDB_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Arch Linux\n- Utilitários principais\n\nDo Wikipédia:\n\nPorque o kernel do GNU, Hurd, não está pronto para produção [1], o GNU é normalmente usado com o kernel do Linux. O Arch Linux é uma distribuição GNU/Linux, usando software GNU como o shell Bash, o GNU coreutils, o conjunto de ferramentas do GNU (toolchain) e vários outros utilitários e bibliotecas. Esta página não tenta listar todos os quase 400 pacotes GNU e apenas destaca alguns.\n\n"
    },
    {
      "title": "Texinfo",
      "level": 2,
      "content": "O software GNU é documentado usando a sintaxe de composição Texinfo. Você pode visualizar documentos de Informações usando o programa info, fornecido pelo pacote texinfo.\n\nEmbora a maioria dos softwares GNU também forneça páginas man, os documentos de Informações tendem a ser mais abrangentes.\n\n"
    },
    {
      "title": "Sistema base",
      "level": 2,
      "content": "- GRUB — GRUB é um gerenciador de boot para o projeto GNU.\n\n- Bash — É um shell compatível com sh que incorpora recursos úteis do Korn shell (ksh) e do C shell (csh).\n\n- Coreutils — coreutils fornece os utilitários básicos de manipulação de arquivo, shell e texto do sistema operacional GNU.\n\n- gzip — gzip é tanto um formato de arquivo quanto um aplicativo de software para compressão e descompressão.\n\n- tar — It provides the ability to create or decompress tar archives, as well as various other kinds of manipulation.\n\n"
    },
    {
      "title": "Conjunto de ferramentas",
      "level": 2,
      "content": "A maioria das ferramentas do conjunto de ferrtamentas do GNU (toolchain) estão no grupo base-devel, exceto glibc (exigido por base) e GDB.\n\n- GNU make — Utilitário GNU make para manter grupos de programas.\n\n- GCC — O GNU Compiler Collection - frontends para C e C++.\n\n- glibc — a implementação do GNU da biblioteca C.\n\n- GNU Binutils — Um conjunto de programas para montar e manipular arquivos binários e arquivos objeto. Inclui ld.\n\n- GNU Bison — O gerador de analisador de propósito geral do GNU.\n\n- GNU m4 — O processador de macros do GNU.\n\n- GDB — O depurador do GNU.\n\n"
    },
    {
      "title": "Sistema de compilação",
      "level": 3,
      "content": "Do Wikipédia:\n\n- GNU Autoconf — Ferramenta para configurar automaticamente código-fonte.\n\n- GNU Automake — Ferramenta para criar automaticamente Makefiles.\n\n- GNU Libtool — Um scripts de suporte genérico para bibliotecas.\n\n"
    },
    {
      "title": "Outros softwares",
      "level": 2,
      "content": "Muitas outras ferramentas opcionais do GNU está disponíveis nos repositórios oficiais:\n\n- GNOME, um ambiente de desktop\n- GIMP, um editor de imagens\n- GTK, um kit de ferramentas de widget\n- Gnumeric, um software de planilhas\n- GNU Parted, um gerenciador de partição\n- GNU Screen, um multiplexador de terminal\n- GNU nano, um editor de texto de linha de comando\n- GNU Emacs, um editor de texto extensível, personalizável e autodocumentado\n- GnuPG, uma implementação do OpenPGP\n- GNU Octave, uma linguagem de programação científica\n- GNU Readline, uma biblioteca de edição de linha para interfaces de linha de comando\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- https://www.gnu.org/\n- O Manifesto GNU\n- Lista de pacotes GNU no Wikipédia\n- O Projeto Arch Hurd visa portar o Arch Linux para o kernel Hurd.\n\n"
    }
  ]
}