{
  "title": "GDM (Português)",
  "url": "https://wiki.archlinux.org/title/GDM_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- GNOME\n- Gerenciador de exibição\n\nDo GDM - GNOME Display Manager: \"O Gerenciador de Exibição do GNOME (GDM) é um programa que gerencia servidores gráficos de exibição e lida com logins de usuários gráficos.\"\n\nGerenciadores de exibição fornecem a usuários de X Window System e Wayland com um prompt de login gráfico.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "GDM pode ser instalado com o pacote gdm e é instalado como parte do grupo gnome.\n\n"
    },
    {
      "title": "Inicialização",
      "level": 2,
      "content": "Para iniciar o GDM na inicialização do sistema, habilite gdm.service.\n\n"
    },
    {
      "title": "Inicializando aplicativos automaticamente",
      "level": 3,
      "content": "Pode-se querer iniciar automaticamente certos comandos, como xrandr, por exemplo, quanto da auttenticaçaõ. Isso pode ser obtido adicionando um comando ou script a um local originado pelo gerenciador de exibição. Consulte Gerenciador de exibição#Iniciando automaticamente para uma lista de locais suportados.\n\n"
    },
    {
      "title": "Imagem de plano de fundo na tela de autenticação",
      "level": 3,
      "content": "- Desde o GNOME 3.16, temas do GNOME Shell estão sendo armazenados como arquivos binários (gresource).\n- Essa alteração será substituída em atualizações subsequentes do gnome-shell.\n\nEm primeiro lugar, você precisa extrair o tema existente do GNOME Shell para uma pasta em seu diretório pessoal. Você pode fazer isso usando o seguinte script:\n\n```\nextractgst.sh\n```\n\n```\n#!/bin/sh\ngst=/usr/share/gnome-shell/gnome-shell-theme.gresource\nworkdir=${HOME}/shell-theme\n\nfor r in `gresource list $gst`; do\n\tr=${r#\\/org\\/gnome\\/shell/}\n\tif [ ! -d $workdir/${r%/*} ]; then\n\t  mkdir -p $workdir/${r%/*}\n\tfi\ndone\n\nfor r in `gresource list $gst`; do\n        gresource extract $gst $r >$workdir/${r#\\/org\\/gnome\\/shell/}\ndone\n```\n\nNavegue até o diretório criado. Você deve descobrir que os arquivos de tema foram extraídos para ele. Agora copie sua imagem de fundo preferida para este diretório.\n\nEm seguida, você precisa criar um arquivo no diretório com o seguinte conteúdo:\n\n```\ngnome-shell-theme.gresource.xml\n```\n\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<gresources>\n  <gresource prefix=\"/org/gnome/shell/theme\">\n    <file>calendar-today.svg</file>\n    <file>checkbox-focused.svg</file>\n    <file>checkbox-off-focused.svg</file>\n    <file>checkbox-off.svg</file>\n    <file>checkbox.svg</file>\n    <file>dash-placeholder.svg</file>\n    <file>gnome-shell.css</file>\n    <file>gnome-shell-high-contrast.css</file>\n    <file>icons/message-indicator-symbolic.svg</file>\n    <file>icons/pointer-double-click-symbolic.svg</file>\n    <file>icons/pointer-drag-symbolic.svg</file>\n    <file>icons/pointer-primary-click-symbolic.svg</file>\n    <file>icons/pointer-secondary-click-symbolic.svg</file>\n    <file>key-enter.svg</file>\n    <file>key-hide.svg</file>\n    <file>key-layout.svg</file>\n    <file>key-shift-latched-uppercase.svg</file>\n    <file>key-shift.svg</file>\n    <file>key-shift-uppercase.svg</file>\n    <file>no-events.svg</file>\n    <file>noise-texture.png</file>\n    <file>nome-do-arquivo</file>\n    <file>no-notifications.svg</file>\n    <file>pad-osd.css</file>\n    <file>process-working.svg</file>\n    <file>toggle-off-dark.svg</file>\n    <file>toggle-off-hc.svg</file>\n    <file>toggle-off.svg</file>\n    <file>toggle-on-dark.svg</file>\n    <file>toggle-on-hc.svg</file>\n    <file>toggle-on.svg</file>\n  </gresource>\n</gresources>\n```\n\nSubstitua nome-do-arquivo com o nome do arquivo de sua imagem de plano de fundo.\n\nAgora, abra o arquivo gnome-shell.css no diretório e alterar a definição #lockDialogGroup da seguinte forma:\n\n```\n#lockDialogGroup {\n  background: #2e3436 url(nome-do-arquivo);\n  background-size: [ALTURA]px [LARGURA]px;\n  background-repeat: no-repeat;\n}\n```\n\nDefina background-size para a resolução que o GDM usa, que pode não necessariamente ser a resolução da imagem. Para uma lista de resoluções de tela, veja Display resolution. Novamente, defina nome-de-arquivo para ser o nome da imagem de fundo.\n\nFinalmente, compile o tema usando o seguinte comando:\n\n```\n$ glib-compile-resources gnome-shell-theme.gresource.xml\n```\n\nEntão, copie o arquivo resultante gnome-shell-theme.gresource para o diretório /usr/share/gnome-shell.\n\nEntão, reinicie gdm.service (note que só encerrar a sessão não é suficiente) e você deve descobrir que ele está usando sua imagem de plano de fundo.\n\nPara mais informações, veja o seguinte tópico no forum.\n\n"
    },
    {
      "title": "Configuração no DConf",
      "level": 3,
      "content": "Algumas configurações do GDM são armazenadas em um banco de dados DConf. Eles podem ser configurados adicionando arquivo-chaves ao diretório /etc/dconf/db/gdm.d e, em seguida, recompilando o banco de dados do GDM executando dconf update como root ou fazendo login no usuário do GDM no sistema e alterando a configuração diretamente usando a ferramenta de linha de comando gsettings. Observe que, para a abordagem anterior, é necessário um arquivo de perfil do GDM - isso deve ser criado manualmente, pois não é mais enviado pelo desenvolvedor, veja abaixo:\n\n```\n/etc/dconf/profile/gdm\n```\n\n```\nuser-db:user\nsystem-db:gdm\nfile-db:/usr/share/gdm/greeter-dconf-defaults\n```\n\nPara a última abordagem, você pode efetuar login no usuário do GDM com o comando abaixo:\n\n```\n# machinectl shell gdm@\n```\n\n"
    },
    {
      "title": "Logo da tela de autenticação",
      "level": 4,
      "content": "Crie o seguinte arquivo-chave\n\n```\n/etc/dconf/db/gdm.d/02-logo\n```\n\n```\n[org/gnome/login-screen]\nlogo='/caminho/para/logo.png'\n```\n\ne recompile o banco de dados do GDM ou, alternativamente, autentique-se ao usuário GDM e execute o seguinte:\n\n```\n$ gsettings set org.gnome.login-screen logo '/caminho/para/logo.png'\n```\n\n"
    },
    {
      "title": "Alterando o tema do cursor",
      "level": 4,
      "content": "O GDM desconsidera as configurações do tema do cursor GNOME e também ignora o conjunto de temas do cursor de acordo com a especificação XDG. Para alterar o tema do cursor usado no GDM, crie o seguinte arquivo-chave\n\n```\n/etc/dconf/db/gdm.d/10-cursor-settings\n```\n\n```\n[org/gnome/desktop/interface]\ncursor-theme='nome-tema'\n```\n\ne recompile o banco de dados do GDM ou, alternativamente, autentique-se como o usuário GDM e execute o seguinte:\n\n```\n$ gsettings set org.gnome.desktop.interface cursor-theme 'nome-tema'\n```\n\n"
    },
    {
      "title": "Fonte maior para a tela de autenticação",
      "level": 4,
      "content": "Clique no ícone de acessibilidade no canto superior direito da tela (um círculo branco com a silhueta de uma pessoa no centro) e marque a opção Texto grande.\n\nPara definir um fator de escala específico, você pode criar o seguinte arquivo-chave:\n\n```\n/etc/dconf/db/gdm.d/03-scaling\n```\n\n```\n[org/gnome/desktop/interface]\ntext-scaling-factor='1.25'\n```\n\ne, em seguida, recompile o banco de dados do GDM ou, alternativamente, efetue login no usuário do GDM e execute o seguinte:\n\n```\n$ gsettings set org.gnome.desktop.interface text-scaling-factor '1.25'\n```\n\n"
    },
    {
      "title": "Desligando o som",
      "level": 4,
      "content": "Este ajuste desativa o feedback audível ouvido quando o volume do sistema é ajustado (via teclado) na tela de login.\n\nCrie o seguinte arquivo-chave:\n\n```\n/etc/dconf/db/gdm.d/04-sound\n```\n\n```\n[org/gnome/desktop/sound]\nevent-sounds='false'\n```\n\ne recompile o banco de dados do GDM ou, alternativamente, efetue login no usuário do GDM e execute o seguinte:\n\n```\n$ gsettings set org.gnome.desktop.sound event-sounds 'false'\n```\n\n"
    },
    {
      "title": "Configurando o comportamento do botão de energia",
      "level": 4,
      "content": "- As configurações do logind para o botão de energia são substituídas pelo daemon de configurações do GNOME. [2]\n- A partir do GDM 3.18, o botão de energia não pode ser ajustado para interativo. [3]\n- Em alguns casos, essa configuração será ignorada e os padrões codificados serão usados. [4]\n\nCrie o seguinte arquivo-chave:\n\n```\n/etc/dconf/db/gdm.d/05-power\n```\n\n```\n[org/gnome/settings-daemon/plugins/power]\npower-button-action='ação'\n```\n\ne recompile o banco de dados do GDM ou, alternativamente, efetue login no usuário do GDM e execute o seguinte:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.power power-button-action 'ação'\n```\n\nsendo ação uma entre nothing, suspend ou hibernate.\n\n"
    },
    {
      "title": "Habilitando tap-to-click",
      "level": 4,
      "content": "Tap-to-click (em português, \"tocar para clicar\") está desabilitado no GDM (e no GNOME) por padrão, mas você pode facilmente habilitá-lo com uma configuração no dconf.\n\nPara habilitar tap-to-click diretamente, use:\n\n```\n# sudo -u gdm gsettings set org.gnome.desktop.peripherals.touchpad tap-to-click true\n```\n\nSe você preferir fazer isso com uma GUI, use:\n\n```\n# sudo -u gdm dconf-editor\n```\n\nPara verificar se ela está definida corretamente, use:\n\n```\n$ sudo -u gdm gsettings get org.gnome.desktop.peripherals.touchpad tap-to-click\n```\n\nSe você receber um erro dconf-WARNING **: failed to commit changes to dconf: Error spawning command line, certifique-se que dbus está em excecução:\n\n```\n$ sudo -u gdm dbus-launch gsettings set org.gnome.desktop.peripherals.touchpad tap-to-click true\n```\n\n"
    },
    {
      "title": "Desabilitar/Habilitar o menu de acessibilidade",
      "level": 4,
      "content": "Para desabilitar ou habilitar o Menu de Acessibilidade, defina a seguinte chave no editor dconf:\n\n```\n# machinectl shell gdm@\n# gsettings set org.gnome.desktop.interface toolkit-accessibility false\n# exit\n```\n\nO menu é desabilitado quando a chave estiver em falso, habilitado quando estiver em verdadeiro.\n\n"
    },
    {
      "title": "Layout do teclado",
      "level": 3,
      "content": "O layout do teclado do sistema será aplicado ao GDM. Veja Keyboard configuration in Xorg#Using X configuration files.\n\nSe um sistema tiver vários usuários, é possível especificar um layout de teclado para o GDM usar, o que é diferente do layout do teclado do sistema. Em primeiro lugar, certifique-se de que o pacote gnome-control-center esteja instalado. Então inicie o gnome-control-center e navegue até Região & Idioma -> Fontes de entrada. Na barra de cabeçalho, pressione o botão de alternância Tela de início de sessão e escolha um layout de teclado na lista. Observe que o botão Tela de início de sessão não estará visível na barra de cabeçalho, a menos que vários usuários estejam presentes no sistema [5].\n\nUsuários do GDM 2.x (GDM legado) pode precisar editar ~/.dmrc como mostrado abaixo:\n\n```\n~/.dmrc\n```\n\n```\n[Desktop]\nLanguage=de_DE.UTF-8   # altera seu idioma padrão\nLayout=de   nodeadkeys # altera seu layout padrão\n```\n\n"
    },
    {
      "title": "Alterar o idioma",
      "level": 3,
      "content": "O idioma do sistema será aplicado ao GDM. Se um sistema tiver vários usuários, é possível definir um idioma para o GDM diferente do idioma do sistema. Neste caso, primeiro certifique-se de que gnome-control-center esteja instalado. Então, inicie o 'gnome-control-center' e escolha Região & Idioma. Na barra de cabeçalho, marque o botão de alternância Tela de início de sessão. Por fim, clique em Idioma e escolha seu idioma na lista. Você será solicitado a fornecer sua senha de root. Observe que o botão Tela de início de sessão não estará visível na barra de cabeçalho, a menos que vários usuários estejam presentes no sistema [6].\n\n"
    },
    {
      "title": "Autenticação automática",
      "level": 4,
      "content": "Para habilitar a autenticação automática com o GDM, adicione o seguinte a /etc/gdm/custom.conf (substitua nome_de_usuário por seu próprio):\n\n```\n/etc/gdm/custom.conf\n```\n\n```\n# Habilita autenticação automática para o usuário\n[daemon]\nAutomaticLogin=nome_de_usuário\nAutomaticLoginEnable=True\n```\n\nou para uma autenticação automática com um atraso:\n\n```\n/etc/gdm/custom.conf\n```\n\n```\n[daemon]\n\nTimedLoginEnable=true\nTimedLogin=nome_de_usuário\nTimedLoginDelay=1\n```\n\nVocê pode definir a sessão usada para autenticação automática (substitua gnome-xorg pela sessão desejada):\n\n```\n/var/lib/AccountsService/users/nome_de_usuário\n```\n\n```\nXSession=gnome-xorg\n```\n\n"
    },
    {
      "title": "Autenticação sem senha",
      "level": 4,
      "content": "Se você quiser ignorar o prompt de senha no GDM, basta adicionar a seguinte linha na primeira linha de /etc/pam.d/gdm-password:\n\n```\nauth sufficient pam_succeed_if.so user ingroup nopasswdlogin\n```\n\nEm seguida, adicione o grupo nopasswdlogin ao seu sistema. Veja Usuários e grupos#Gerenciamento de grupo para descrições de grupos e comandos de gerenciamento de grupos.\n\nAgora, adicione seu usuário ao grupo nopasswdlogin e você só terá que clicar no seu nome de usuário para se autenticar.\n\nNote: **Não** \n\n- Não faça isso para a conta root.\n- Você não poderá mais alterar seu tipo de sessão na autenticação com o GDM. Se você quiser alterar o tipo de sessão padrão, primeiro precisará remover o usuário do grupo nopasswdlogin.\n\n"
    },
    {
      "title": "Desligamento sem senha para várias sessões",
      "level": 4,
      "content": "O GDM usa o polkit e o logind para obter permissões para o encerramento. Você pode desligar o sistema quando vários usuários estão autenticados, definindo:\n\n```\n/etc/polkit-1/localauthority.conf.d/org.freedesktop.logind.policy\n```\n\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE policyconfig PUBLIC\n \"-//freedesktop//DTD PolicyKit Policy Configuration 1.0//EN\"\n \"http://www.freedesktop.org/standards/PolicyKit/1.0/policyconfig.dtd\">\n\n\n<policyconfig>\n\n  <action id=\"org.freedesktop.login1.power-off-multiple-sessions\">\n    <description>Shutdown the system when multiple users are logged in</description>\n    <message>System policy prevents shutting down the system when other users are logged in</message>\n    <defaults>\n      <allow_inactive>yes</allow_inactive>\n      <allow_active>yes</allow_active>\n    </defaults>\n  </action>\n\n</policyconfig>\n```\n\nVocê pode encontrar todas as opções de logind disponíveis (por exemplo, reboot-multiple-sessions) here.\n\n"
    },
    {
      "title": "Habilitar autenticação como root no GDM",
      "level": 4,
      "content": "Não é aconselhável fazer login como root, mas, se necessário, você pode editar /etc/pam.d/gdm-password e adicionar a seguinte linha antes da linha auth required pam_deny.so:\n\n/etc/pam.d/gdm-password\n\n```\nauth            sufficient      pam_succeed_if.so uid eq 0 quiet\n```\n\nO arquivo deve ser algo como isto:\n\n/etc/pam.d/gdm-password\n\n```\n...\nauth            sufficient      pam_succeed_if.so uid eq 0 quiet\nauth            sufficient      pam_succeed_if.so uid >= 1000 quiet\nauth            required        pam_deny.so\n...\n```\n\nVocê deve poder autenticar como root após reiniciar o GDM.\n\n"
    },
    {
      "title": "Ocultar usuário da lista de login",
      "level": 4,
      "content": "Os usuários da lista de usuários do gdm são reunidos por AccountsService. Ele irá ocultar automaticamente os usuários do sistema (UID <1000). Para ocultar usuários comuns da lista de login, crie ou edite um arquivo com o nome do usuário para ocultar em /var/lib/AccountsService/users/ para conter pelo menos:\n\n```\n/var/lib/AccountsService/users/nome_de_usuário\n```\n\n```\n[User]\nSystemAccount=true\n```\n\n"
    },
    {
      "title": "Definir as configurações de monitor padrão",
      "level": 3,
      "content": "Alguns ambientes de desktop armazenam configurações de exibição em ~/.config/monitors.xml. Os comandos xrandr são então gerados na base do conteúdo do arquivo. O GDM tem um arquivo semelhante armazenado em /var/lib/gdm/.config/monitors.xml.\n\nSe você tiver a configuração de seus monitores como quiser (orientação, escala, primário e assim por diante) em ~/.config/monitors.xml e quiser que o GDM honre essas configurações:\n\n```\n$ sudo cp ~/.config/monitors.xml /var/lib/gdm/.config/\n$ sudo chown gdm:gdm /var/lib/gdm/.config/monitors.xml\n```\n\nAs partes relevantes de monitors.xml para rotação e escala de tela são:\n\n```\n<monitors version=\"2\">\n  <configuration>\n    <logicalmonitor>\n      ...\n      <scale>2</scale>\n      ...\n      <transform>\n        <rotation>right</rotation>\n        <flipped>no</flipped>\n      </transform>\n      ...\n    </logicalmonitor>\n  </configuration>\n</monitors>\n```\n\nAs alterações entrarão em vigor no encerramento da sessão. Isso é necessário porque o GDM não respeita xorg.conf.\n\n"
    },
    {
      "title": "Configurar permissão de acesso do servidor X",
      "level": 3,
      "content": "Você pode usar o comando xhost para configurar permissões de acesso ao servidor X.\n\nPor exemplo, para conceder ao GDM o direito de acessar o servidor X, use o seguinte comando:\n\n```\n# xhost +SI:localuser:gdm\n```\n\n"
    },
    {
      "title": "Wayland e o driver proprietário da NVIDIA",
      "level": 3,
      "content": "O GDM não funciona bem no modo Wayland com o driver proprietário NVIDIA. Ao usar esse driver, o GDM usará o Xorg em vez disso. [7]\n\nPara forçar ativação do Wayland, desative a regra udev responsável para desativar o Wayland no GDM:\n\n```\n# ln -s /dev/null /etc/udev/rules.d/61-gdm.rules\n```\n\n"
    },
    {
      "title": "Falha no encerramento da sessão",
      "level": 3,
      "content": "Se o GDM iniciar corretamente na inicialização, mas falhar após tentativas repetidas de encerramento de sessão, tente adicionar essa linha à seção do daemon do /etc/gdm/custom.conf:\n\n```\nGdmXserverTimeout=60\n```\n\n"
    },
    {
      "title": "Xorg sem senha",
      "level": 3,
      "content": "Veja Xorg (Português)#Xorg sem root.\n\n"
    },
    {
      "title": "Usar backend do Xorg",
      "level": 3,
      "content": "O backend Wayland é usado por padrão e o backend Xorg é usado somente se o backend de Wayland não puder ser iniciado. Você pode querer usar o backend Xorg se, por exemplo:\n\n- A tela pisca\n- GDM trava\n\nPara usar o backend do Xorg por padrão, descomente a seguinte linha no /etc/gdm/custom.conf:\n\n```\n#WaylandEnable=false\n```\n\n"
    },
    {
      "title": "GDM congela com o systemd",
      "level": 3,
      "content": "Se o GDM travar com systemctl enable gdm, e systemctl start gdm funciona conforme esperado, aplique a configuração com systemctl edit gdm conforme abaixo:\n\n```\n[Service]\n Type=Idle\n```\n\n"
    },
    {
      "title": "GDM não inicia até a entrada ser fornecida",
      "level": 3,
      "content": "Se, após a inicialização, a tela permanecer preta e o GDM não iniciar até que o mouse seja movido ou algo digitado no teclado, isso pode ocorrer devido à falta de entropia necessária para a geração aleatória de números. Para confirmar, verifique se a seguinte linha aparece dentro do log de systemd-random-seed (que pode ser lido usando journalctl --unit systemd-random-seed):\n\n```\nKernel entropy pool is not initialized yet, waiting until it is.\n```\n\nPara corrigir isso, você pode passar o parâmetro do kernel random.trust_cpu=on se sua CPU possuir suporte à instrução RDRAND ou usar haveged, que também fornece entropia, embora seja de qualidade supostamente baixa. Veja artigo do Debian sobre o tópico para outras soluções.\n\n"
    },
    {
      "title": "Remoção incompleta do gdm",
      "level": 3,
      "content": "Após remover gdm, o systemd pode relatar o seguinte:\n\n```\nuser 'gdm': directory '/var/lib/gdm' does not exist\n```\n\nPara remover esse aviso, autentique-se como root e exclua o usuário primário \"gdm\" e exclua o grupo \"gdm\":\n\n```\n# userdel gdm\n# groupdel gdm\n```\n\nVerifique se gdm foi removido com sucesso via pwck e grpck. Para completar, você pode querer se certificar que não há arquivos arquivos sem dono por restos do gdm.\n\n"
    },
    {
      "title": "Suspensão automática do GDM (GNOME 3.28)",
      "level": 3,
      "content": "O GDM usa um banco de dados separado do dconf para controlar o gerenciamento de energia. Você pode fazer o GDM se comportar da mesma maneira que as sessões do usuário copiando as configurações do usuário para o banco de dados dconf do GDM.\n\n```\n$ IFS=$'\\n'; for x in $(sudo -u nome_de_usuário gsettings list-recursively org.gnome.settings-daemon.plugins.power); do eval \"sudo -u gdm dbus-launch gsettings set $x\"; done; unset IFS\n```\n\nsendo nome_de_usuário o nome do seu usuário.\n\nOu simplesmente desabilitar a suspensão automática (também execute o comando com ac substituído por battery para também desativá-lo durante a execução com bateria):\n\n```\n$ sudo -u gdm dbus-launch gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-type 'nothing'\n```\n\n"
    },
    {
      "title": "GDM ignora Wayland e usa X.Org por padrão",
      "level": 3,
      "content": "Wayland requer Kernel Mode Setting (KMS) em execução para funcionar, e em algumas máquinas o processo GDM inicia mais cedo que KMS, resultando em GDM ser incapaz de ver Wayland e trabalhando apenas com X.Org. Isso pode resultar em mensagens como o seguinte, mostrando seu log:\n\n```\ngnome-shell[569]: Failed to open gpu '/dev/dri/card0': GDBus.Error:org.freedesktop.DBus.Error.AccessDenied: Operation not permitted\n gnome-shell[569]: Failed to create backend: No GPUs found\n systemd[505]: gnome-shell-wayland.service: Failed with result 'protocol'.\n systemd[505]: Failed to start GNOME Shell on Wayland.\n```\n\nVocê pode resolver este problema iniciando o KMS mais cedo.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Manual de referência do GDM\n\n"
    }
  ]
}