{
  "title": "General Recommendations (Català)",
  "url": "https://wiki.archlinux.org/title/General_Recommendations_(Catal%C3%A0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles relacionats\n\n- Preguntes freqüents\n- Guia d'instal·lació\n- Llista d'aplicacions\n\nAquest document és un índex anotat d'articles populars i informació important per a millorar i afegir funcionalitat al sistema Arch Linux instal·lat. S'assumeix que el lector ha llegit i seguit la guia d'instal·lació per a obtenir un una instal·lació d'Arch Linux bàsica. És necessari llegir i entendre els conceptes explicats a #Administració del sistema i #Gestió de paquets per a poder seguir les altres seccions d'aquesta pàgina i la resta d'articles de la wiki.\n\n"
    },
    {
      "title": "Administració del sistema",
      "level": 2,
      "content": "Aquesta secció tracta les tasques administratives i la gestió del sistema. Vegeu Core utilities (Català) i Category:System administration (Català) per a més informació.\n\n"
    },
    {
      "title": "Usuaris i grups",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nUna nova instal·lació us deixa només amb el compte de superusuari, més conegut com a \"root\". Fer ús del sistema com a root durant llargs períodes de temps, possiblement exposant-lo via SSH en un servidor, és insegur. En comptes d'això, hauríeu de crear i utilitzar un compte d'usuari sense privilegis, i només utilitzar el compte root per a les tasques d'administració del sistema. Vegeu Users and groups (Català)#Gestió d'usuaris per a més detalls.\n\nEls usuaris i grups són un mecanisme de \"control d'accés\"; els administradors poden ajustar a quins grups pertany cada compte i de què són propietaris, amb l'objectiu de permetre o denegar a usuaris i serveis l'accés als recursos del sistema. Llegiu l'article sobre usuaris i grups per a més detalls i conèixer els potencials riscs de seguretat.\n\n"
    },
    {
      "title": "Seguretat",
      "level": 3,
      "content": "Llegiu Security (Català) per a conèixer les recomanacions i millors pràctiques per a protegir el sistema.\n\nPer a una llista d'aplicacions que permeten executar comandes o iniciar intèrprets d'ordres interactius com a un altre usuari (per exemple, root), vegeu List of applications (Català)/Security (Català)#Elevació de privilegis.\n\n"
    },
    {
      "title": "Gestió de serveis",
      "level": 3,
      "content": "Arch Linux empra systemd com a procés init, un programa per a la gestió del sistema i els seus serveix per a Linux. Per al manteniment de la vostra instal·lació d'Arch Linux, és bona idea aprendre els conceptes bàsics d'aquest programa.\n\nPer a interaccionar amb systemd s'usa la comanda systemctl. Vegeu systemd (Català)#Ús bàsic de systemctl per a més informació.\n\nTambé es proporciona un registre de sistema, amb la comanda journalctl. Vegeu journal (Català) per a més informació.\n\n"
    },
    {
      "title": "Manteniment del sistema",
      "level": 3,
      "content": "Arch és un sistema rolling release i els paquets reben actualitzacions constantment, així que els usuaris han de dedicar part del seu temps al manteniment del sistema.\n\n"
    },
    {
      "title": "Gestió de paquets",
      "level": 2,
      "content": "Aquesta secció conté informació útil relacionada amb la gestió de paquets. Vegeu FAQ (Català)#Gestió de paquets i Category:Package management (Català) per a més informació.\n\nNote: **abans** \n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman és el gestor de paquets (package manager, en anglès) d'Arch Linux: es recomana molt familiaritzar-se amb ell abans de llegir qualsevol altre article.\n\nPer a activar la descàrrega en paral·lel dels paquets, vegeu pacman (Català)#Activació de les descàrregues en paral·lel.\n\nVegeu pacman (Català)/Tips and tricks (Català) per a suggeriments sobre com millorar la vostra interacció amb pacman i sobre la gestió de paquets en general.\n\n"
    },
    {
      "title": "Repositoris",
      "level": 3,
      "content": "Vegeu l'article Official repositories (Català) per a conèixer l'objectiu de cada un dels repositoris oficialment mantinguts.\n\nSi penseu utilitzar aplicacions de 32 bits, voldreu activar el repositori multilib.\n\nL'article Unofficial user repositories (Català) llista molts altres repositoris sense suport oficial.\n\nPodríeu considerar d'instal·lar el servei pkgstats.\n\n"
    },
    {
      "title": "Miralls",
      "level": 3,
      "content": "Visiteu l'article Mirrors (Català) per conèixer els passos necessaris per a usar els miralls més ràpids i actualitzats dels repositoris oficials. Tal com s'explica a l'article, un molt bon consell és consultar periòdicament la pàgina d'Estat dels Miralls, on trobareu una llista dels miralls sincronitzats més recentment. Aquesta tasca es pot automatitzar amb Reflector.\n\n"
    },
    {
      "title": "Arch Build System",
      "level": 3,
      "content": "Ports és un sistema inicialment emprat per les distribucions BSD consistent en scripts de construcció que resideixen a un arbre de directoris al sistema local. Senzillament, cada port conté un script a un directori intuïtivament anomenat com l'aplicació de tercers que pot instal·lar.\n\nEl Arch Build System ofereix la mateixa funcionalitat mitjançant build scripts anomenats PKGBUILDs, que contenen informació d'una peça de programari concreta: hashes d'integritat, URL del projecte, versió, llicencia i instruccions de construcció. Aquest PKGBUILDs són processats per makepkg, el programa que genera els paquets que pacman pot gestionar.\n\nCada paquet dels repositoris i tots els presents a l'AUR poden ser recompilats amb makepkg.\n\n"
    },
    {
      "title": "Arch User Repository",
      "level": 3,
      "content": "Mentre l'Arch Build System permet construir el programari disponible als repositoris oficials, l'Arch User Repository (AUR) és l'equivalent per a paquets publicats pels usuaris. És un repositori sense suport de build scripts accessible mitjançant la interfície web o la interfície RPC Aurweb.\n\n"
    },
    {
      "title": "Arrencada",
      "level": 2,
      "content": "Aquesta secció conté informació rellevant per al procés d'arrencada. Podeu trobar una visió general del procés d'arrencada a Arch boot process (Català). Vegeu Category:Boot process (Català) per a més informació.\n\n"
    },
    {
      "title": "Reconeixement automàtic del maquinari",
      "level": 3,
      "content": "udev hauria de detectar automàticament el maquinari durant el procés d'arrencada. Es pot aconseguir una potencial millora en el temps d'arrencada desactivant la carrega automàtica de mòduls i especificant els mòduls requerits manualment, tal com es descriu a Kernel modules (Català). Addicionalment, Xorg hauria de detectar automàticament els controladors requerits mitjançant udev, però els usuaris tenen l'opció també de configurar el servidor X manualment.\n\n"
    },
    {
      "title": "Microcodi",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nEls processadors poden tenir comportaments erronis, que el kernel pot corregir actualitzant el microcodi durant l'inici. Vegeu Microcode (Català) per a més detalls.\n\n"
    },
    {
      "title": "Conservació dels missatges d'arrencada",
      "level": 3,
      "content": "Abans de demanar les credencials d'inici de sessió, el sistema neteja els missatges d'arrencada, impedint als usuaris obtenir dades de diagnòstic d'ells. Per a superar aquesta limitació, vegeu Disable clearing of boot messages (Català).\n\n"
    },
    {
      "title": "Activació de Bloq. Num (Num Lock)",
      "level": 3,
      "content": "A molts teclats es troba una tecla de blocatge del teclat numèric, molts cops anomenada Bloq. Num o Num Lock. Per a activar-la durant l'inici, vegeu Activating numlock on bootup (Català).\n\n"
    },
    {
      "title": "Interfície gràfica d'usuari",
      "level": 2,
      "content": "Aquesta secció ofereix orientació per als usuaris que desitgen executar aplicacions gràfiques al seu sistema. Vegeu Category:Graphical user interface (Català) per a recursos addicionals.\n\n"
    },
    {
      "title": "Gestors o compositors de finestres",
      "level": 3,
      "content": "Un entorn d'escriptori de ple dret ofereix una interfície gràfica d'usuari completa i consistent, però acostuma a consumir gran part dels recursos del sistema. Els usuaris que busquen maximitzar el rendiment o simplificar el seu entorn poden optar a instal·lar un gestor de finestres o un compositor per si sol i escollir a mà els extres desitjats. Utilitzant Xorg, la majoria d'entorns d'escriptori permeten també l'ús d'un gestor de finestres alternatiu. Els gestors de finestres dinàmics, apilats, i enrajolats difereixen en la seva gestió del posicionament de les finestres.\n\n"
    },
    {
      "title": "Directoris d'usuari",
      "level": 3,
      "content": "Els directoris d'usuari ben coneguts com Descàrregues o Música són creats pel servei d'usuari xdg-user-dirs-update.service, que ofereix xdg-user-dirs i està habilitat per defecte un cop instal·lat. Si el teu entorn d'escriptori o gestor de finestres no obté el paquet, podeu instal·lar-lo i executar xdg-user-dirs-update manualment com s'explica a XDG user directories (Català)#Creació dels directoris per defecte.\n\n"
    },
    {
      "title": "Administració d'energia",
      "level": 2,
      "content": "Aquesta secció pot ser útil per als propietaris de portàtils o altres usuaris interessats a controlar el consum energètic dels seus dispositius. Vegeu Category:Power management (Català) per a més informació.\n\nVegeu Power management (Català) per a una visió més general.\n\n"
    },
    {
      "title": "Esdeveniments ACPI",
      "level": 3,
      "content": "Els usuaris poden configurar com el sistema reacciona a esdeveniments ACPI com prémer el botó d'encesa o tancar la tapa del portàtil. Per al nou mètode (recomanat) que utilitza systemd, vegeu Administració d'energia amb systemd. Per al mètode antic, vegeu acpid.\n\n"
    },
    {
      "title": "Escalat de freqüència de CPU",
      "level": 3,
      "content": "Els processadors moderns poden reduir la seva freqüència i voltatge per a reduir la calor generada i el consum energètic. Limitar l'escalfament fa el sistema més silenciós i perllonga la vida del maquinari. Vegeu CPU frequency scaling (Català) per a més detalls.\n\n"
    },
    {
      "title": "Portàtils",
      "level": 3,
      "content": "Per a articles relacionats amb la computació portàtil a més de guies d'instal·lació especifiques a certs models, si us plau vegeu Category:Laptops (Català). Per a una visió general dels articles relacionats amb portàtils i recomanacions, vegeu Laptop (Català).\n\n"
    },
    {
      "title": "Suspensió i hibernació",
      "level": 3,
      "content": "Vegeu l'article principal: Power management (Català)/Suspend and hibernate (Català).\n\n"
    },
    {
      "title": "Multimèdia",
      "level": 2,
      "content": "Category:Multimedia (Català) inclou recursos addicionals.\n\n"
    },
    {
      "title": "Sistema de so",
      "level": 3,
      "content": "ALSA és un sistema de so de kernel que hauria de funcionar sense cap pas addicional (només cal activar el so). Els servidors de so com PipeWire i PulseAudio poden oferir característiques addicionals i suportar configuracions d'àudio més complexes.\n\nVegeu Professional audio (Català) si teniu requisits d'àudio més avançats.\n\n"
    },
    {
      "title": "Xarxes",
      "level": 2,
      "content": "Aquesta secció està limitada a petits procediments de xarxa. Vegeu Network configuration (Català) per a una guia de configuració completa i Category:Networking (Català) per a articles relacionats.\n\n"
    },
    {
      "title": "Sincronització de rellotge",
      "level": 3,
      "content": "El Network Time Protocol (NTP) és un protocol per a sincronitzar els rellotges dels ordinadors mitjançant la transmissió de paquets sobre xarxes de latència variable. Vegeu Time synchronization (Català) per a implementacions d'aquest protocol.\n\n"
    },
    {
      "title": "Seguretat DNS",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nPer a una millor seguretat mentre exploreu la web, jugueu en línia, us connecteu a serveis SSH i altres tasques similars considereu usar un resolutor DNS compatible amb DNSSEC que pugui validar registres DNS firmats, i un protocol encriptat com DNS sobre TLS, DNS sobre HTTPS o DNSCrypt. Vegeu Domain name resolution (Català) per a més detalls.\n\n"
    },
    {
      "title": "Configuració d'un tallafoc",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nUn tallafoc pot oferir una capa de protecció addicional sobre la pila de xarxa de Linux. Tot i que el kernel d'estoc d'Arch és capaç d'usar les iptables i nftables de Netfilter, cap d'elles es troba habilitada per defecte. És molt recomanable configurar alguna mena de tallafoc. Vegeu Category:Firewalls (Català) per a veure les guies disponibles.\n\n"
    },
    {
      "title": "Compartició de xarxa",
      "level": 3,
      "content": "Per a compartir fitxers entre les màquines d'una xarxa, seguiu els articles dedicats a NFS o SSHFS.\n\nEmpreu Samba per a unir-vos a una xarxa de Windows. Per a configurar la màquina per a autentificar mitjançant Active Directory, llegiu Active Directory integration (Català).\n\nVegeu també Category:Network sharing (Català).\n\n"
    },
    {
      "title": "Dispositius d'entrada",
      "level": 2,
      "content": "Aquesta secció conté consells de configuració de dispositius d'entrada populars. Vegeu Category:Input devices (Català) per a més informació.\n\n"
    },
    {
      "title": "Distribucions de teclat",
      "level": 3,
      "content": "Els teclats no anglesos o no estàndards podrien no funcionar de la forma esperada per defecte. Els passos necessaris per a configurar el keymap són diferents per a la consola virtual i per a Xorg, es descriuen a Keyboard configuration in console (Català) i Keyboard configuration in Xorg (Català) respectivament.\n\n"
    },
    {
      "title": "Botons del ratolí",
      "level": 3,
      "content": "Els propietaris de ratolins avançats o inusuals podrien trobar-se amb què no tots els botons del ratolí es reconeixen per defecte, o potser desitgen assignar accions diferents als botons addicionals. Podeu trobar instruccions a Mouse buttons (Català).\n\n"
    },
    {
      "title": "Panells tàctils de portàtils",
      "level": 3,
      "content": "Molts portàtils utilitzen \"panells tàctils\" de Synaptics o ALPS com a dispositiu apuntador. Per a aquests, i molts altres models de panells tàctils, podeu usar el controlador d'entrada de Synaptics o libinput; vegeu Touchpad Synaptics (Català) i libinput (Català) per a detalls sobre la instal·lació i configuració.\n\n"
    },
    {
      "title": "TrackPoints",
      "level": 3,
      "content": "Vegeu l'article sobre el TrackPoint per a configurar el vostre dispositiu TrackPoint.\n\n"
    },
    {
      "title": "Optimització",
      "level": 2,
      "content": "L'objectiu d'aquesta secció és resumir els retocs, eines i opcions disponibles útils per a millorar el rendiment del sistema i les aplicacions.\n\n"
    },
    {
      "title": "Benchmarking",
      "level": 3,
      "content": "El benchmarking és l'acte de mesurar el rendiment i comparar els resultats amb els d'un altre sistema o un estàndard generalment acceptat mitjançant un procediment unificat.\n\n"
    },
    {
      "title": "Millorar el rendiment",
      "level": 3,
      "content": "L'article Improving performance (Català) recull informació i és un resum bàsic sobre l'obtenció d'un millor rendiment a Arch Linux.\n\n"
    },
    {
      "title": "Discs d'estat sòlid",
      "level": 3,
      "content": "L'article Solid state drive (Català) cobreix molts aspectes sobre els discs d'estat sòlid, incloent-hi com configurar-los per a maximitzar la seva vida útil.\n\n"
    },
    {
      "title": "Serveis del sistema",
      "level": 2,
      "content": "Aquesta secció està relacionada amb els dimonis.\n\n"
    },
    {
      "title": "Índex i cerca de fitxers",
      "level": 3,
      "content": "La majoria de distribucions tenen una ordre locate disponible per a poder cercar fitxers ràpidament. Arch Linux ofereix diverses alternatives, vegeu locate (Català) per a més detalls.\n\nEls motors de cerca d'escriptori ofereixen un servei similar, mentre estan millor integrats en els entorns d'escriptori.\n\n"
    },
    {
      "title": "Entrega de correu local",
      "level": 3,
      "content": "La instal·lació per defecte no ofereix cap mecanisme per a sincronitzar el correu. A l'article Mail server (Català) podeu trobar una llista d'agents d'entrega de correu.\n\n"
    },
    {
      "title": "Impressió",
      "level": 3,
      "content": "CUPS és un sistema d'impressió de codi obert basat en estàndards desenvolupat per OpenPrinting per a Linux. Vegeu Category:Printers (Català) per a articles específics a impressores concretes.\n\n"
    },
    {
      "title": "Aparença",
      "level": 2,
      "content": "Aquesta secció conté retocs visuals freqüentment buscats per a una experiència Arch més plaent. Vegeu Category:Eye candy (Català) per a més opcions.\n\n"
    },
    {
      "title": "Fonts",
      "level": 3,
      "content": "És possible que vulgueu instal·lar un set de fonts TrueType, ja que en el sistema Arch bàsic només s'inclouen fonts inescalables basades en mapes de bits. Existeixen diverses famílies de fonts de propòsit general que ofereixen un gran abast Unicode i fins i tot compatibilitat mètrica amb fonts d'altres sistemes operatius.\n\nPodeu trobar munts d'informació sobre el tema als articles Fonts (Català) i Font configuration (Català).\n\nSi invertiu gran part del vostre temps treballant a la consola virtual (és a dir, fora del servidor X), potser desitgeu canviar la font de consola per a millorar la llegibilitat; vegeu Linux console (Català)#Fonts.\n\n"
    },
    {
      "title": "Temes GTK i Qt",
      "level": 3,
      "content": "Gran part de les aplicacions amb interfície gràfica per a sistemes Linux es basen en la llibreria GTK o la llibreria Qt. Vegeu aquells articles i Uniform look for Qt and GTK applications (Català) per a idees sobre com millorar l'aparença dels vostres programes instal·lats i com adaptar-la a les vostres preferències.\n\n"
    },
    {
      "title": "Millores per a la consola",
      "level": 2,
      "content": "Aquesta secció aplica petites modificacions que milloren la practicitat dels programes de consola. Vegeu Category:Command-line shells (Català) per a més informació..\n\n"
    },
    {
      "title": "Millores per a l'autocompletat del tabulador",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nEs recomana configurar l'autocompletat del tabulador estès immediatament, seguint les instruccions de l'article del vostre shell escollit.\n\n"
    },
    {
      "title": "Àlies",
      "level": 3,
      "content": "Crear un àlies per a una comanda, o per a un grup de comandes, és una manera d'estalviar temps quan s'utilitza la consola. És especialment útil per a tasques repetitives que no requereixen alteracions significatives dels seus paràmetres entre execucions. Els àlies per a estalviar temps més comuns es poden trobar a Bash (Català)#Àlies, que també es poden portar fàcilment a zsh (Català).\n\n"
    },
    {
      "title": "Shells alternatius",
      "level": 3,
      "content": "Bash és el shell instal·lat per defecte en el sistema Arch. El mitjà d'instal·lació, en canvi, fa servir zsh (Català) amb el paquet d'extensió grml-zsh-config. Vegeu Command-line shell (Català)#Llista de shells per a més alternatives.\n\n"
    },
    {
      "title": "Addicions per a bash",
      "level": 3,
      "content": "Hi ha disponible una llista miscel·lània de macros de configuració, cerca d'historial i Readline a Bash (Català)#Consells i trucs.\n\n"
    },
    {
      "title": "Sortida acolorida",
      "level": 3,
      "content": "Aquesta secció és coberta a Color output in console (Català).\n\n"
    },
    {
      "title": "Fitxers comprimits",
      "level": 3,
      "content": "En un sistema GNU/Linux, els fitxers comprimits (o arxius) es troben amb freqüència. Tar és una de les eines d'arxivament més utilitzades, i els usuaris haurien de familiaritzar-se amb la seva sintaxi (els paquets d'Arch Linux, per exemple, són simples tarballs comprimits amb zstd). Vegeu Archiving and compression (Català).\n\n"
    },
    {
      "title": "Indicador de la consola",
      "level": 3,
      "content": "L'indicador de la consola (PS1) és altament personalitzable. Vegeu Bash (Català)/Prompt customization (Català) o Zsh (Català)#Indicadors si utilitzeu Bash o Zsh, respectivament.\n\n"
    },
    {
      "title": "Shell emacs",
      "level": 3,
      "content": "Emacs és conegut per oferir opcions que van més enllà de les tasques típiques d'edició de text, sent una d'aquestes la possibilitat de ser un substitut complet per al shell. Consulteu Emacs (Català)#Problemes amb la sortida acolorida per a una solució als caràcters confusos que poden aparèixer quan s'habilita la sortida acolorida.\n\n"
    },
    {
      "title": "Suport del ratolí",
      "level": 3,
      "content": "Utilitzar un ratolí amb la consola per a les operacions de copiar i enganxar pot ser preferible davant el mode de còpia tradicional del GNU Screen. Vegeu General purpose mouse (Català) per a instruccions detallades. Sapigueu que ja podeu fer això en els emuladors de terminal amb el porta-retalls.\n\n"
    },
    {
      "title": "Gestió de sessions",
      "level": 3,
      "content": "Utilitzant multiplexadors de terminal com tmux o GNU Screen, els programes poden executar-se sota sessions compostes de pestanyes i panells que poden ser desconnectats sota demanda, tal que quan l'usuari mati l'emulador de terminal, finalitzi X, o tanqui sessió, els programes associats amb la sessió continuïn executant-se en segon pla mentre el servidor de multiplexat de terminal segueixi actiu. Interaccionar amb els programes requereix reconnectar-se a la sessió.\n\n"
    }
  ]
}