{
  "title": "General guidelines (Español)",
  "url": "https://wiki.archlinux.org/title/General_guidelines_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-10-03** \n\nAdemás del código de conducta, cada uno de los foros tiene sus propias pautas específicas que se resumen en las siguientes subsecciones.\n\n"
    },
    {
      "title": "Foros",
      "level": 2,
      "content": "Directrices específicas para los foros de Arch.\n\n"
    },
    {
      "title": "Cómo publicar",
      "level": 3,
      "content": "- Elija temas claros e informativos. Esto hace más probable obtener respuesta por parte de los usuarios con experiencia que tienen conocimiento sobre ese tema en particular. Esto también hace que el tema sea fácil de consultar y encontrar, por futuros usuarios, en las búsquedas del foro para problemas similares. Además, evite frases extravagantes como [HELP!], [URGENT], etc.\n- Un esfuerzo sincero por usar un lenguaje y una gramática moderados y adecuados es un signo de respeto hacia la comunidad que, sin duda, será apreciado, y es muy probable que obtenga respuestas positivas. Por favor, absténgase de utilizar términos como «textspeak», «netspeak», «leetspeak» y demás formas de la jerga de internet.\n- Al hacer preguntas, proporcione tanta información como le sea posible, incluyendo los mensajes de errores, salida del terminal, los registros, lo que se ha intentado anteriormente, qué documentación y búsquedas se han hecho y los archivos de configuración relacionados.\n- Elija un hilo por tema. Las discusiones largas son normalmente desaconsejadas en los subforos de cuestiones técnicas.\n- Envíe la pregunta a un solo subforo, escoja el más relevante, y publique allí.\n- No publique tutoriales ni \"cómo hacerlo\": esta documentación pertenece a la wiki, donde se puede mantener.\n- Cuando responda a un tema existente, lea siempre la publicación inicial y trate de centrarse en el tema que la originó.\n- Por último, cuando se encuentre una solución, marque su hilo como resuelto, mediante la edición del primer envío y anteponiendo la etiqueta [SOLVED] al título en el campo «Subject». Tenga en cuenta que debe evitar el uso de [CLOSED], ya que es utilizado por el sistema para marcar un hilo que ya no es accesible para los nuevos envíos.\n- Si un hilo está marcado como [SOLVED], no responda indicando el equivalente de «Estoy teniendo un problema similar...»; inicie un nuevo hilo y enlace al hilo [SOLVED], si es relevante.\n\n"
    },
    {
      "title": "Pegar código e imágenes",
      "level": 3,
      "content": "Por favor, use etiquetas [code] al pegar fragmentos de consola. Use también, por favor, el cliente pastebin a la hora de enviar una gran cantidad de código. No use pastebin.com—está bloqueado para algunos usuarios y tiene un historial de problemas molestos (Javascript, anuncios, formato deficiente, etc). Para los usuarios de idiomas distintos al inglés: por favor, antepongan LC_ALL=C a las órdenes enviadas, de modo que la salida se vea en inglés. No publique fotos a pantalla completa, use miniaturas en su lugar. Cualquier imagen de dimensiones superiores a 250×250px o de tamaño mayor de 50 kiB será eliminada. No publicar capturas de pantalla de salida de texto; publicar the actual text.\n\n"
    },
    {
      "title": "La vida es una calle de doble sentido",
      "level": 3,
      "content": "Una verdad simple, pero profunda e innegable. Asegúrese de que la publicación incluye detalles e información que los demás encuentren de utilidad. Comparta sus hallazgos con la comunidad. Comparta sus fracasos también. Publicar el equivalente de «Nevermind, I fixed it» (No importa, lo arreglé) en el hilo o borrar sus propios mensajes por razones similares, no sólo es egoísta e inútil para la comunidad, sino una pérdida total de tiempo y de recursos. Igualmente, pedir ayuda o mostrar una impaciencia evidente para obtenerla, tampoco es deseada aquí. Arch es mantenida por una comunidad de voluntarios. Los usuarios de Arch son conminados a investigar, esforzarse, informar en el hilo, ayudar a los demás, participar y contribuir a la comunidad.\n\nPor favor, no sea «help vampire».\n\n"
    },
    {
      "title": "Pedir recomendaciones sobre productos",
      "level": 3,
      "content": "Los temas que busquen asesoramiento sobre recomendaciones de productos informáticos se desaniman. Estos temas, como las discusiones sobre tecnología, se vuelven rápidamente obsoletas y es improbable que aporten beneficio alguno para la comunidad en general. Se espera que usted sea capaz de hacer su propia investigación y sacar sus propias conclusiones sobre cuál es el producto que mejor se adapte a sus necesidades personales.\n\n"
    },
    {
      "title": "Temas antiguos/«necro-bumping»",
      "level": 3,
      "content": "Ponga de su parte por mantener los foros ordenados. Como Arch está documentado en Wiki, publicar temas antiguos, o reabrir temas cerrados, «necrobumping», está generalmente desaconsejado y no exento de problemas técnicos para los subforos, ya que, potencialmente, pueden crear información «zombie» inconexa; es decir, se combinan mensajes obsoletos que contienen datos que ya no son relevantes debido a la naturaleza «rolling» de Arch con mensajes más recientes que reflejan más las circunstancias actuales.\n\nReglas del juego\n\n- Si tiene una pregunta, inicie un nuevo hilo y enlace con el antiguo, si procede. También puede reportar el hilo antiguo para que los moderadores puedan cerrarlo.\n- Si tiene algo que añadir o juzga que su información está relacionada pero es más actual, inicie un nuevo hilo y enlácelo al antiguo, si se desea, pero evite la duplicación de esfuerzos publicando información que ya figura en la wiki de Arch.\n- Si tiene una solución independiente de la versión o adecuada, el «necrobumping» podría ser apropiado si el hilo no tiene más de un año o dos.\n\n"
    },
    {
      "title": "Evite las publicaciones vacías/power-posting",
      "level": 3,
      "content": "«Power-posting» se describe mejor como el envío de mensajes vacíos y sin valor. No se toleran. Normalmente existen dos razones para hacerlo: para aumentar, sin sentido, el contador de mensajes, o para prestar apoyo a una idea como si se tratara de un voto. Ejemplos de power-posting incluyen, sin tener carácter exclusivo, responder con «+1», «lol», «me too», «I agree», o «:)».\n\nAl publicar o responder a los mensajes, asegúrese de que tiene algo que decir. Estos envíos vacíos se acumulan sobre las discusiones y debates, invalidan la función «Show New Posts» (Mostrar Mensajes Nuevos), y son residuos que ocupan ancho de banda y espacio en el servidor.\n\nSi ese hilo degenera en una serie de «+1/-1» o «yo también/de acuerdo/no estoy de acuerdo», será bloqueado. Los «power posts» individuales pueden ser también borrados.\n\n"
    },
    {
      "title": "Evite el bumping",
      "level": 3,
      "content": "Publicar una sola palabra o mensaje inútil («bumping» -golpear-) para atraer la atención a su hilo no está permitido. Haga su propia investigación, continúe solucionando, publique los resultados, y sea paciente con la comunidad. Si la gente está leyendo el hilo sin responder u ofrecer ayuda, puede tratar de suministrar más detalles o preguntar que dirección debe seguir. A menudo, la razón de los mensajes que quedan sin respuesta se debe, en gran parte, a los pocos detalles del envío original en sí o a la disponibilidad de las soluciones obvias en la wiki, en el foro o en la web, y al desinterés de la comunidad por señalar la obvio.\n\n"
    },
    {
      "title": "Evite el cross-posting",
      "level": 3,
      "content": "«Cross-posting» (envíos cruzados) consiste en publicar la misma pregunta varias veces en subforos diferentes (por ejemplo, la misma publicación en «Newbie Corner» y en «Installation»). Esto es dilapidar recursos y no está permitido. Cualquier tema transversal publicado, será bloqueado o eliminado inmediatamente.\n\n"
    },
    {
      "title": "Evite el thread hijacking",
      "level": 3,
      "content": "«Thread hijacking» (secuestrar o desviar el tema) consiste en el proceso de responder a un tema existente creando con la respuesta un tema diferente. Generalmente esto no se recomienda. Es mejor empezar un nuevo hilo si se tiene un problema que está relacionado con un tema existente publicado pero claramente diferente. Las publicaciones que desvían (o secuestran) el tema de un hilo serio con una discusión ajena al tema (off-topic) están toleradas también, pero se desaconseja en general.\n\n"
    },
    {
      "title": "Política Dustbin (temas marcados para su eliminación)",
      "level": 3,
      "content": "Los temas que estén bloqueados/cerrados, ya sea porque estén documentados en las bases o la Wiki, ya sea por que son incompatibles con la filosofía de Arch, se moverán a «Dust/troll-bin». Después de un período de cinco días, el tema será elegible para ser eliminado a discreción del personal (staff). El moderador responsable marcará claramente el tema como «Binned» o «For deletion».\n\n"
    },
    {
      "title": "Listas de correo",
      "level": 2,
      "content": "Pautas para las listas de correo. Véase también el estilo de publicación de la lista de correo.\n\n"
    },
    {
      "title": "Publicar por encima",
      "level": 3,
      "content": "No hay nunca una excusa para publicar arriba. Por favor, no lo haga.\n\n"
    },
    {
      "title": "Citas",
      "level": 3,
      "content": "Cite solamente los elementos necesarios de un correo electrónico anterior. Citando indiscriminadamente se hincha rápidamente el hilo y reduce su legibilidad, al mismo tiempo que aumenta la carga cognitiva en la lista entera. Reduzca todo el material redundante y responda ajustándose al material citado relevante.\n\n"
    },
    {
      "title": "Texto plano",
      "level": 3,
      "content": "El texto plano es el estándar de Unix y del correo electrónico. El lenguaje HTML es innecesario y, para aquellos que utilizan clientes de línea de órdenes, no deseado. Por favor, mantenga unas longitudes de línea razonables: 72 caracteres se considera el valor por defecto para explicarse.\n\n"
    },
    {
      "title": "Responder a la lista de correo",
      "level": 3,
      "content": "Al responder a un hilo de la lista de correo, asegúrese de responder a la lista de correo en lugar del autor del correo electrónico original. La mayoría de los clientes de correo electrónico deberían proporcionar una función de \"respuesta a la lista de correo\" entre las opciones de respuesta. De lo contrario, introduzca manualmente la dirección de correo electrónico de la lista de correo en el campo Para (To).\n\nPara las listas de correo que no requieran suscripción, como arch-mirrors-announce y aur-requests, utilice responder a todos y asegúrese de que la lista de correo se encuentre entre los destinatarios.\n\n"
    },
    {
      "title": "AUR",
      "level": 2,
      "content": "Directrices para el Arch User Repository se pueden encontrar en las directrices de presentación en AUR.\n\n"
    },
    {
      "title": "IRC",
      "level": 2,
      "content": "Todos los canales de IRC de Arch Linux están en la red irc de Libera Chat. Los usuarios en Libera Chat deben seguir la política de la red y las directrices del canal de Libera Chat.\n\nEl idioma oficial del canal #archlinux es el inglés. Si necesita ayuda en otro idioma, busque en los canales de arch internacionales.\n\n- El tema principal de #archlinux es dar soporte y debatir sobre Arch Linux. La conversación general sobre el software y el hardware está permitida siempre que no interfiera con el tema principal de discusión. Si se pide discurtir sobre otro tema en otro canal o en un mensaje privado no debería haber problema para hacerlo.\n\n- Lea el tema del canal de forma regular con /topic. A menudo contiene información importante.\n\n- Solo hay un bot del canal oficial. phrik!~archbot@archlinux/bot/phrik. No hay órdenes bot de spam y limite su uso a las cosas que son útiles. Si quiere traer su propio bot a cualquier canal de Arch Linux, solicítelo a los operadores antes de hacerlo\n- No inunde el canal con texto. Esto incluye el arte ASCII, las órdenes bot y registros de errores. Utilice un paste bin para compartir cosas superiores a líneas. La orden programa &> salida-programa.txt en combinación con clientes pastebin puede facilitar este paso. Si quiere probar las órdenes bot o mirar mediante la función de ayuda, utilice un /query o /msg. Ejemplo: /query phrik help orden.\n- La autorrespuesta en el canal o en mensaje privado no se permiten, con la sola excepción de respuestas como visitante al apodo resaltado en un mensaje privado.\n- No pregunte si hay alguien ahí o si utiliza el software, simplemente haga su pregunta.\n- No exija ayuda; pregunte por ella. Espere pacientemente durante unos minutos antes de reformular las preguntas. La mayoría de las preguntas son respondidas por «otro usuario si más», como usted.\n- Al pedir ayuda, responda siempre a las personas que le piden más información, si no sabe la respuesta, entonces dígalo.\n\n- Utilice un paste bin para compartir cosas superiores a líneas. La orden programa &> salida-programa.txt en combinación con clientes pastebin puede facilitar este paso.\n- Si quiere probar las órdenes bot o mirar mediante la función de ayuda, utilice un /query o /msg. Ejemplo: /query phrik help orden.\n\n"
    },
    {
      "title": "Wiki",
      "level": 2,
      "content": "Directrices para la wiki se pueden encontrar en:\n\n- Las 3 reglas fundamentales\n- Ayuda:Estilo\n- Ayuda:Discusión\n\n"
    },
    {
      "title": "Seguimiento de errores",
      "level": 2,
      "content": "Las pautas para el Seguimiento de errores se pueden encontrar en Pautas de informe de errores.\n\nVéase la página principal: Reporting bug guidelines.\n\n"
    }
  ]
}