{
  "title": "General recommendations (Bosanski)",
  "url": "https://wiki.archlinux.org/title/General_recommendations_(Bosanski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nRelated articles\n\n- Često postavljena pitanja\n- Instalacijske upute\n- Lista aplikacija\n\nOvaj dokument je anotirani index popularnih članaka i važnih informacija za poboljšavanje i dodavanje funkcionalnosti u instalirati Arch sistem. Pretpostavlja se da su čitaoci pročitali instalacijske upute da dobiju osnovu Arch instalaciju. Pročitali i razumjeti koncepte u #Sistemska administracija i #Paket menadžment je preduslov za ostale sekcije na ovoj stranici i ostale članke u wiki-u.\n\n"
    },
    {
      "title": "Sistemska administracija",
      "level": 2,
      "content": "Ova sekcija se odnosi na administrativne taskove i sistem menadžment. Za više, pogledajte Core utilities i Category:System administration (Bosanski).\n\n"
    },
    {
      "title": "Korisnici i grupe",
      "level": 3,
      "content": "Svježa instalacija ima samo superuser korisnikom (root). Logovanje kao root user duže vrijeme, čak eksponiranje root usera sa SSH serverom, je nesigurno. Umjesto toga, trebao bi kreirati i koristiti neprivilegovanog korisnika/e za većinu taskova, koristeći root samo za sistemsku administraciju. Vidi Korisnici i grupe#Menadžment korisnika za više detalja.\n\nKorisnici i grupe imaju mehanizam za access control; administrator mogu fine-tunati članove grupa i ko je vlasnik fajlova da dodijlete ili oduzmu privilegije na sistemu. Pročitaj Korisnici i grupe članak za detalje i potencijalne sigurnosne rizike.\n\n"
    },
    {
      "title": "Elevacija privilegija",
      "level": 3,
      "content": "Oba, i su i sudo komande omogućavaju pokretanja komandi kao drugi korisnik. su po defaultu starta interaktivni shell kao root user, a sudo by default privremeno dodijeli root privilegije za jednu komandu. Pogledaj njihove članke za više informacija.\n\n"
    },
    {
      "title": "Menadžment servisa",
      "level": 3,
      "content": "Arch Linux koristi systemd kao init process, koji je menadžment alat servisa i sistema za Linux. Za održavanje tvog Arch Linuxa, dobra ideja je naučiti njegove osnove. Interakcija sa systemd se radi korištenjem systemctl komande. Pročitaj systemd#Basic systemctl usage za više informacija.\n\n"
    },
    {
      "title": "Nadgledanje sistema",
      "level": 3,
      "content": "Arch je rolling release sistem i ima brzi preokret paketa, što znači da korisnici moraju uložiti vrijeme da rade nadgledanje sistema. Procitaj [[Security] za savjete i najbolje prakse za hardening sistema.\n\n"
    },
    {
      "title": "Paket menadžment",
      "level": 2,
      "content": "Ova sekcija sadrži korisne informacije vezano za paket menadžment. Za više, pogledajte Paket menadžment i Category:Packet management.\n\nNote: **prije** \n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman je Arch Linux packagemanager: svi korisnici su obavezi da se upoznaju sa njim prije čitanja ostalih članaka.\n\nVidi pacman/Tips and tricks za savjete kako poboljšati interakciju sa pacman-om i paket menadžmentom generalno.\n\n"
    },
    {
      "title": "Repositories",
      "level": 3,
      "content": "Vidi Official repositories članke za detalje o svrsi svakog oficijalno održavanog repository-a.\n\nAko planiraš koristiti 32-bitne aplikacije, moraš enable multilib repository.\n\nNeoficijalni korisnički repository članak izlistava nekoliko nepodržanih repository-a.\n\nMožda bi trebao razmisliti o instaliranju pkgstats servisa.\n\n"
    },
    {
      "title": "Mirori",
      "level": 3,
      "content": "Posjeti Mirori članak za korake da se u potpunosti iskoriste najbrži i oni mirori koji su up to date. Kao što je objašnjeno u članku, dobar savjet je periodično provjeriti Status mirora stranicu za listu mirora koji su nedavno sinhronizovani.\n\n"
    },
    {
      "title": "Arch Build System",
      "level": 3,
      "content": "Ports je sistem koji je inicijalno korišten od strane BSD distribucije koji se sadrži od build skripti koje se nalaze u directory tree na lokalnom sistemu. Jednostavno rečeno, svaki port sadrži skriptu unutar folder intuitivno nazvana kao i instalabilna third-party aplikacija.\n\nArch build system nudi istu funkcionalnost tako što pruža build skripte nazvane PKGBUILD, koje su popunjene informacijama za određeni software: hash-evi, URL projekta, verzija, licenca i build instrukcije. Ovi PKGBUILD-ovi su parsirane sa makepkg, program koji generiše pakete kojima se upravlja sa pacman-om.\n\nSvaki paket unutar repository zajedno sa paketima unutar AUR mogu se rekompajlirati sa makepkg.\n\n"
    },
    {
      "title": "Arch User Repository",
      "level": 3,
      "content": "Dok Arch Build System dozvoljava buildanje software-a dostupnog u oficijelnim repository-ima, Arch User Repository (AUR) je ekvivalent njemu za pakete submittane od strane korisnika. To je nepodržani repository build skripti dostupne preko web interfejs ili kroz Aurweb RPC interface.\n\n"
    },
    {
      "title": "Bootanje",
      "level": 2,
      "content": "Ova sekcija sadrži informacije vezano za proces bootanja. Overview proces Arch bootanja može se pronaći na Arch boot process. Za više pogledaj Category:Boot process.\n\n"
    },
    {
      "title": "Automatsko prepoznavanje hardware-a",
      "level": 3,
      "content": "Hardware bi trebao automatski biti prepoznat od strane udev tokom boot procesa. Potencijalno poboljšanje u vremenu bootanja može se postići isključivanje auto-loading-a i navesti željene module manuelno, kao što je opisano u Kernel modules. Dodatno, Xorg bi trebao automatski detektovati potrebne drivere koristeći udev, ali korisnici imaju opciju manuelnog konfigurisanja X servera.\n\n"
    },
    {
      "title": "Microcode",
      "level": 3,
      "content": "Procesori mogu imati pogrešno ponašanje, koje kerne može riješiti ažuriranjem mikrokoda na startupu. Vidi Microcode za detalje.\n\n"
    },
    {
      "title": "Očuvanje boot poruka",
      "level": 3,
      "content": "Nakon što se boot proces završi, ekran se počisti i pojavi se login prompt što onemogućava korisnike da dobiju feedback od boot procesa. Isljuči čišćenje ekrana od boot poruka da prevaziđes ovaj limit.\n\n"
    },
    {
      "title": "Num Lock aktivacija",
      "level": 3,
      "content": "Num Lock je toggle tipka koja ima na većini tastatura. Za aktiviranje Num Lock-a tokom startup-a, vidi Activating NumLock on Bootup.\n\n"
    },
    {
      "title": "Graphical user interface",
      "level": 2,
      "content": "Ova sekcija pruža orijentaciju za korisnike koji žele da pokrenu grafičke aplikacija na svom sistemu. Vidi Category:Graphical user interfaces za dodatne resurse.\n\n"
    },
    {
      "title": "Display server",
      "level": 3,
      "content": "Xorg je public, open-source implementacija X Window System-a (većinom X11 ili X). On je preduslov za pokretanje aplikacija GUI-em i većina korisnika će htjeti da ga instalira.\n\nWayland je noviji, alternativni display server protokol i referenca implementacija od Westona je dostupna.\n\n"
    },
    {
      "title": "Display driveri",
      "level": 3,
      "content": "Defaultni vesa display driver će raditi sa većinom grafičkih kartica, ali performanse se mogu poboljšati instaliranjem drivera za AMD, Intel ili NVIDIA proizvode.\n\n"
    },
    {
      "title": "Desktop okruženja",
      "level": 3,
      "content": "Iako Xorg pruža osnovni framework za buildanje grafičkog okruženja, dodatne komponente mogu biti potrebne za potpuni korisnički doživljaj. Desktop okruženja poput GNOME, KDE, LXDE i Xfce zapakuju unutar sebe veliki spektar X klijenata, poput window menadžera, panela, fajl menadžera, terminala, text editora, ikona i drugih alata. Korisnici sa manje iskustva bi trebali instalirati desktop okruženje sa kojim su više upoznati. Vidi Category:Desktop environments za dodatne resurse.additional resources.\n\n"
    },
    {
      "title": "Window menadžeri",
      "level": 3,
      "content": "Iskusno desktop okruženje pruža potpuni i konzistentni GUI, ali troši dosta resursa. Korisnici koje žele da maksimiziraju performanse ili da pojednostave svoje okruženje, mogu instalirati window menadžer sami i odabrati željene dodatke. Većina desktop okruženja dozvoljava alternativne window menadžere. Dinamični, stacking i tilling window menadžeri razlikuju se u tome kako operišu što se tiče pozicioniranje windowa.\n\n"
    },
    {
      "title": "Display menadžeri",
      "level": 3,
      "content": "Većina desktop okruženja uključuje display menadžer za automatsko startanje desktop okruženja i menadžment korisničkih logina. Korisnici bez desktop okruženje mogu posebno instalirati jedan. Alternativno, možda moraš startati X na loginu kao jednostavnu alternativu display menadžeru.\n\n"
    },
    {
      "title": "Korisnički folderi",
      "level": 3,
      "content": "Dobro poznati korisnički folderi poput Downloads ili Music su kreirani od strane xdg-user-dirs-update.service korisničkog servisa, koji je dostupan od strane xdg-user-dirs i enablan po defaultu prilikom instalacije. Ako tvoje desktop okruženje ili window menadžer ne pulla paket, možeš ga sam instalirati i pokrenuti xdg-user-dirs-update manuelno kao što je navedeno u XDG user directories#Creating default directories.\n\n"
    },
    {
      "title": "Power menadžment",
      "level": 2,
      "content": "Ovaj sekcija može biti od koristi korisnicima sa laptopom ili generalno korisnicima željnim kontrole nad powerom. Za više, pogledaj Category:Power management.\n\nVidi Power management za generalni pregled.\n\n"
    },
    {
      "title": "ACPI eventovi",
      "level": 3,
      "content": "Korisnici mogu konfigurisati kako sistem reagira na ACPI eventove poput pritiskanja power tipke ili poklapanja laptopa. Za novije metode(bolje) koristeći systemd, vidi Power management#ACPI events. Za starije metode, koristi acpid.\n\n"
    },
    {
      "title": "Skaliranje CPU frekvencije",
      "level": 3,
      "content": "Moderni procesori mogu sniziti svoju frekvenciju i napon da smanje toplotu i power consumption. Manje toplote rezultira tihih sistemom i produžuje život hardware-a. Vidi Skaliranje CPU frekvencije za detalje.\n\n"
    },
    {
      "title": "Laptopu",
      "level": 3,
      "content": "Za članke vezane za laptope zajedno sa specifičnim instalacijama za modele, vidi Category:Laptops. Za generalni overview članaka vezanih za laptope i savjete, vidi Laptop.\n\n"
    },
    {
      "title": "Suspend i hibernate",
      "level": 3,
      "content": "Vidi glavni artikal: Power management/Suspend and hibernate.\n\n"
    },
    {
      "title": "Multimedia",
      "level": 2,
      "content": "Category:Multimedia sadrži dodatne resurse.\n\n"
    },
    {
      "title": "Zvuk",
      "level": 3,
      "content": "Zvuk je omogućen od strane kernel drivera za zvuk:\n\n- ALSA je uključen unutar kernel i preporučen je jer obično radi out of the box (samo mora biti unmuted).\n- OSS je alternativa u slučaju kada ALSA ne radi.\n\nKorisnici mogu dodatno instalirati i konfigurasati zvučni server poput PulseAudio. Za napredne zahtjeva zvuka, vidi professional audio.\n\n"
    },
    {
      "title": "Browser plugini",
      "level": 3,
      "content": "Za pristup određenom web sadržaju, browser plugin poput Adobe Acrobat Reader-a, Adobe Flash Player-a i Jave mogu biti instalirani.\n\n"
    },
    {
      "title": "Codecs",
      "level": 3,
      "content": "Codecs su korišteni od strane multimedijalnih aplikacija za enkodiranje i dekodiranje streama zvuka ili videa. Da bi korisnici mogli pustiti određeni enkodirani stream, moraju imati pravi codec instaliran.\n\n"
    },
    {
      "title": "Networking",
      "level": 2,
      "content": "Ova sekcija je vezana za male mrežne procedure. Idi na mrežnu konfiguraciju za puni guide. Za više, pogledaj Category:Networking.\n\n"
    },
    {
      "title": "Sinhronizacija sata",
      "level": 3,
      "content": "Network Time Protocol (NTP) je protokol za sinhronizovanje sata računara preko mreže. Vidi vremensku sinhronizaciju za implementaciju takvog protokola.\n\n"
    },
    {
      "title": "DNS sigurnost",
      "level": 3,
      "content": "Za bolju sigurnost tokom browsanja interneta, plaćanja online, povezivanje na SSH servise i slične taskove koristeći DNSSEC-enabled DNS resolver koji može validirati potpisane DNS rekorde, i enkriptovani protokol poput DNS over TLS, DNS over HTTPS ili DNSCrypt. Vidi Domain name resolution za detalje.\n\n"
    },
    {
      "title": "Podešavanje firewall-a",
      "level": 3,
      "content": "Firewall može pružiti dodatni nivo zaštite na vrhu Linux network stacka. Dok je stock Arch kernel u mogućnosti koristiti [[Wikipedia:Netfilter|Netfilter-ove] iptables i nftables, ni jedan od njih nije enablan po defaultu. Preporučuje se podešavanje neke vrste firewalla. Vidi Category:Firewalls za dostupne guidove.\n\n"
    },
    {
      "title": "Dijeljenje resursa",
      "level": 3,
      "content": "Za dijeljenje fajlova između različitih mašina na mreži, prati NFS ili SSHFS članke.\n\nKoristi sambu da pristupis Windows mreži. Za konfiguraciju mašine da koristi Active Directory za autentifikaciju, pročitaj Active Directory integration.\n\nVidi također Category:Network sharing.\n\n"
    },
    {
      "title": "Ulazni uređaji",
      "level": 2,
      "content": "Ova sekcija sadrži popularne konfiguracijske savjete za ulazne uređaje. Za više, vidi Category:Input devices.\n\n"
    },
    {
      "title": "Layout tastature",
      "level": 3,
      "content": "Neengleske ili druge nestandardne tastature mogu da ne funkcionišu očekivano po defaultu. Potrebni koraci za konfigurisanju keymapa za virtuelnu konzolu i Xorg, opisani su Keyboard configuration in console i Keyboard configuration in Xorg.\n\n"
    },
    {
      "title": "Dugmići na mišu",
      "level": 3,
      "content": "Vlasnici naprednog ili neobičnog miša mogu primjetiti da tipke nisu prepoznate uopće po defaultu, ili žele da dodijele drukčije akcije za njih. Instrukcije se mogu pronaći na Mouse buttons.\n\n"
    },
    {
      "title": "Laptop touchpadi",
      "level": 3,
      "content": "Veliki broj laptopa koristi Synaptics ili ALPS touchpad-e. Za ove i slične touchpad modele, možeš koristiti ili Synaptics ulazne drivere ili libinput; vidi Touchpad Synaptics i libinput za instalaciju i konfiguraciju.\n\n"
    },
    {
      "title": "TrackPointi",
      "level": 3,
      "content": "Vidi TrackPoint članak za konfiguraciju TrackPoint uređaja.\n\n"
    },
    {
      "title": "Optimizacija",
      "level": 2,
      "content": "Ova sekcija pokušava da sumira tweak-ove, alate i dostupne opcije za poboljšanje sistema i performansi aplikacija.\n\n"
    },
    {
      "title": "Benchmarking",
      "level": 3,
      "content": "Benchmarking je akt mjerenja performansi i poređenja rezultata sa rezultatima drugog sistema ili široko prihvaćenog standarda.standard through a unified procedure.\n\n"
    },
    {
      "title": "Poboljšavanje performansi",
      "level": 3,
      "content": "Članak Improving performance ima informacije vezano za to i osnova je za poboljšavanje performansi u Arch Linuxu.\n\n"
    },
    {
      "title": "Solid state drives",
      "level": 3,
      "content": "Solid State Drives članak pokriva mnoge aspekte solid state drives-a, uključujući njihovi konfiguraciju da se maksimizira njihov život.\n\n"
    },
    {
      "title": "Sistemski servisi",
      "level": 2,
      "content": "Ova sekcija je vezana za daemone. Za više, vidi Category:Daemons.\n\n"
    },
    {
      "title": "Indeksiranje fajlova i pretraga",
      "level": 3,
      "content": "Većina distribucija ima locate komandu dostupnu za brzo pretraživanje fajlova. Da se ubaci ova funkcionalnost u Arch Linux, plocate je preporučen da se instalira. Nakon instalacije, pokreni updatedb za indeksiranje fajlsistema.\n\nDesktop search engine pruža sličan servis dok je u isto vrijeme bolje integrisan u desktop okruženja.\n\n"
    },
    {
      "title": "Local mail delivery",
      "level": 3,
      "content": "Defaultni setup nema način za sinhronizaciju mailova. Za konfiguraciju Postix-a za jednostavan lokalni mailbox delivery, vidi Postfix. Druge opcije su OpenSMTPD, msmtp i fdm.\n\n"
    },
    {
      "title": "Printanje",
      "level": 3,
      "content": "CUPS je standardno bazirani, open source sistem za printanje razvijen od strane Apple-a. Vidi Category:Printers za članke vezano za printere.\n\n"
    },
    {
      "title": "Izgled",
      "level": 2,
      "content": "Ova sekcija sadrži \"lijepe\" tweak-ove za ugodno iskustvo za Arch-om. Za više, vidi Category:Eye candy.\n\n"
    },
    {
      "title": "Fontovi",
      "level": 3,
      "content": "Možda ćeš htjeti instalirati set TrueType fontova, jer su jedino neskalabilni bitmap fontovi uključeni u basic Arch sistem. Postoji nekoliko general-purpose font familija koje pružaju Unicode podršku i čak metric kompatibilnost sa fontovima drugih operativnih sistema.\n\nDosta informacija o ovoj temi se može pronaći na fontovi i konfiguracija fonta člancima.\n\nUkoliko korisnik provodi puno vremena za virtuelnom konsolom, korisnici mogu promijeniti konzolni font; vidi Linux console#Fonts.\n\n"
    },
    {
      "title": "GTK i Qt teme",
      "level": 3,
      "content": "Veliki dio aplikacije za grafičkim interfejsom za Linux sisteme su bazirani na GTK ili Qt toolkit-ima. Vidi članke vezano za njih i Uniform look for Qt and GTF applications za ideje kako poboljšati izgled instaliranih programa i kako prilagoditi svom ukusu.\n\n"
    },
    {
      "title": "Konzolna poboljšavanje",
      "level": 2,
      "content": "Ova sekcija se odnosi na male modifikacije koje mogu poboljšati konzolne programe. Za viši, vidi Category:Command-line shells‎.\n\n"
    },
    {
      "title": "Tab-completion enhancements",
      "level": 3,
      "content": "Preporučeno je pravilno podesiti tab completion, kao što je navedeno u člancima vezano za shell-ove koji se koriste.\n\n"
    },
    {
      "title": "Aliasi",
      "level": 3,
      "content": "Definiranje aliasa za komandu ili grupu komandi je jedan od načina uštede vremena na konzoli. Ovo je pogotovo od pomoći za repetitivne taskove koji ne zahtjevaju neku posebnu modifikaciju parametara između pokretanja. Česti aliasi koji štede vrijeme, mogu biti pronađeni na Bash#Aliases, koji su portabilni i na zsh.\n\n"
    },
    {
      "title": "Alternativni shell-ovi",
      "level": 3,
      "content": "Bash je shell koji je instaliran po defaultu. Live instalacijski mediji, koristi zsh sa grml-zsh-config addon paket. Vidi Command-line shell#List of shells za više alternativa.\n\n"
    },
    {
      "title": "Bash dodaci",
      "level": 3,
      "content": "Lista dodatnih Bash podešavanja, pretraživanja historije i Readline makroi su dostupni u Bash#Tips and tricks.\n\n"
    },
    {
      "title": "Obojeni output",
      "level": 3,
      "content": "Ova sekcija je pokrivena u Color output u konzoli.\n\n"
    },
    {
      "title": "Kompresovani fajlovi",
      "level": 3,
      "content": "Kompresovani fajlovi ili arhive su česte na GNU/Linux sistemima. Tar je jedan od najčešće korištenih alata za arhiviranje i korisnici bi trebali biti upoznati sa njegovom sintaksom (Arch Linux paketi su npr. jednostavno xzipovani tarball-i). Vidi Archiving and compression.\n\n"
    },
    {
      "title": "Konzolni prompt",
      "level": 3,
      "content": "Konzolni prompt (PS1) može biti dosta customiziran. Vidi Bash/Prompt customization ili Zsh#Prompts u zavisnosti od shella koji koristiš.\n\n"
    },
    {
      "title": "Emacs shell",
      "level": 3,
      "content": "Emacs je poznat po tome što ima feature mimo regularnog text editinga, jedan od toga je potpuni shell replacement. Vidi Emacs#Colored output issues za fix vezano za pokvareni izgled karaktera nakon enablanja kolornog outputa.\n\n"
    },
    {
      "title": "Mouse podrška",
      "level": 3,
      "content": "Koristeći miš sa konzolom za copy-paste operacija može se preferirati u odnosu na GNU Screen-ov tradicionalni copy mode. Vidi General purpose mouse za detaljne direkcije. Uzmi u obzir da ovo već možeš raditi u terminal emulator-u sa clipboard-om.\n\n"
    },
    {
      "title": "Session menadžment",
      "level": 3,
      "content": "Koristeći terminalne multipleksere poput tmux ili GNU screen-a, programi mogu se pokretati pod sesijama koji se sastoje od tabova i pane-ova koji se mogu otkačiti(detach) po želji, tako da kad program kill-a terminal ili X ili se odjavi, programi mogu i dalje da rade u pozadini sve dok je multiplekser aktivan. Interakcija sa programom zahtjeva ponovno kačenje na njih.\n\n"
    }
  ]
}