{
  "title": "Genel öneriler",
  "url": "https://wiki.archlinux.org/title/Genel_%C3%B6neriler",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "İlgili makaleler\n\n- Sıkça sorulan sorular\n- Kurulum rehberi\n- Uygulamalar listesi\n\nBu döküman, kurulu Arch sistemini geliştirmek ve ona yeni işlevler eklemek için popüler makalelerin ve önemli bilgilerin açıklamalı bir dizinidir. Okuyucuların Kurulum rehberi'ni okuduğu ve temel bir Arch Linux kurulumunu gerçekleştirdiği varsayılır. #Sistem yönetimi ve #Paket yönetimi bölümlerinin okunmuş ve ilgili kavramların anlaşılmış olması, bu sayfadaki ve vikideki diğer makaleleri anlayabilmek için gereklidir.\n\n"
    },
    {
      "title": "Sistem yönetimi",
      "level": 2,
      "content": "Bu bölüm sistem idaresi için yapılması gerekenler ve sistem yönetimi ile ilgilenir. Dahası için Core utilities ve Category:System administration sayfalarına bakın.\n\n"
    },
    {
      "title": "Kullanıcılar ve gruplar",
      "level": 3,
      "content": "Yeni bir kurulum sonucunda sisteminizde sadece bir root yani kök kullanıcısı bulunur. Sürekli olarak kök kullanıcısı olarak sisteme girmek güvenli değildir. Bunun yerine kök yetkilerine sahip olmayan bir kullanıcı oluşturup çoğu işiniz için bu kullanıcıyı kullanmalı ve kök kullanıcısını sadece sistem yönetimiyle alakalı işlemleriniz için kullanmalısınız. Detaylar için Users and groups#User management sayfasına bakın.\n\nKullanıcılar ve gruplar, bir yetki yönetimi mekanizmasıdır; sistem yöneticileri, kullanıcıların ve servislerin sistem kaynaklarına erişimine izin vermek veya erişimini engellemek için grup üyeliklerinde ve sahipliklerinde ince ayarlar yapabilir. Detaylar ve muhtemel güvenlik riskleri için Users and groups makalesini okuyun.\n\n"
    },
    {
      "title": "Güvenlik",
      "level": 3,
      "content": "Sistemin güvenliğini artırmaya yönelik örnek uygulamalar ve öneriler için Security sayfasını okuyabilirsiniz.\n\nKomut çalıştırma yetkisi vermek veya başka bir kullanıcı (özellikle kök kullanıcısı) olarak interaktif kabuk (shell) başlatmak için kullanabileceğiniz programların listesi için List of applications/Security#Privilege elevation sayfasına bakın.\n\n"
    },
    {
      "title": "Servis yönetimi",
      "level": 3,
      "content": "Arch Linux init (açılış) işlemleri için systemd kullanmaktadır. Systemd aynı zamanda Linux için servis ve sistem yönetimini sağlamakla görevlidir. Arch Linux kurulumunuzu idame edebilmek için servis yönetiminin temellerini öğrenmeniz iyi bir başlangıç olacaktır. systemd ile etkileşime geçebilmek için systemctl komutu kullanılır. Daha fazla bilgi için systemd#Basic systemctl usage sayfasını okuyun.\n\nBununla birlikte sistem günlüğü hizmeti de journalctl komutu ile sunulmaktadır. Daha fazla bilgi için journal sayfasına bakın.\n\n"
    },
    {
      "title": "Sistem bakımı",
      "level": 3,
      "content": "Arch rolling relase yani yuvarlanan sürüm konseptine sahip bir sistemdir, yani hızlı ve sık sık paket güncellemeleri gerçekleştirir, bu sebeple kullanıcıların sistem bakımı hakkında belli bir düzeyde bilgi sahibi olması gerekebilir.\n\n"
    },
    {
      "title": "Paket yönetimi",
      "level": 2,
      "content": "Bu bölüm paket yönetimiyle alakalı yardımcı bilgiler barındırır. Dahası için Sıkça sorulan sorular#Paket yönetimi ve Category:Package management sayfalarına bakın.\n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman, Arch Linux paket yöneticisidir (package manager): başka herhangi bir makale okumadan önce pacman'e aşina olmanız şiddetle tavsiye edilir.\n\nÖnbelleğe alınmış paketlerin uzun vadede nasıl idare edilebileceğine dair bilgi edinmek için pacman#Cleaning the package cache makalesine bakın.\n\npacman/Tips and tricks sayfasını ziyaret ederek pacman'e olan aşinalığınızı artıracak öneriler ve genel olarak paket yönetimi hakkında bilgi sahibi olabilirsiniz.\n\n"
    },
    {
      "title": "Depolar",
      "level": 3,
      "content": "Sürdürülen her bir resmî deponun amaçları hakkında detaylı bilgi sahibi olmak için Official repositories makalesine bakın.\n\n32-bit uygulamalar kullanmayı düşünüyorsanız multilib deposunu aktif hâle getirmek isteyebilirsiniz.\n\nResmî olarak desteklenmeyen diğer birçok depo Unofficial user repositories makalesinde listelenmiştir.\n\npkgstats servisini indirmeniz önerilmektedir.\n\n"
    },
    {
      "title": "Yansımalar",
      "level": 3,
      "content": "Resmî depoların en güncel ve hızlı yansımalarından tam anlamıyla yararlanabilmeye yönelik adımlar için Yansımalar sayfasını ziyaret edin. İlgili makalede anlatıldığı üzere, yeni senkronize edilmiş yansımaların listesi için Mirror Status sayfasını düzenli olarak kontrol etmeniz şiddetle tavsiye edilir. Aynı zamanda bu işlem Reflector ile otomatikleştirilebilir.\n\n"
    },
    {
      "title": "Arch Yapım Sistem (Arch Build System)",
      "level": 3,
      "content": "Portlar (Ports), ilkin BSD dağıtımlarında kullanılmış olup yerel sistemde bir dizin ağacında yapım betikleri barındıran bir sistemdir. Kısacası her bir port kurulacak olan üçüncü taraf yazılımın ismi ile isimlendirilmiş bir dizin ve içerisinde bir betik barındırır.\n\nArch build system aynı işlevi PKGBUILD adı verilen yapım betikleri ile sağlar, bu yapımlar ilgili yazılım hakkında yapım bütünlüğü sağlama bilgisi (integrity hash), proje URLsi, sürüm, lisans ve yapım yönergeleri barındırır. Bu PKGBUILDler makepkg, yani pacman tarafından yönetilebilecek olan paketleri oluşturan asıl program tarafından çözümlenir.\n\nDepolarda ve AUR'da bulunan tüm paketler, makepkg ile yeniden derlemeye tabi olur.\n\n"
    },
    {
      "title": "Arch Kullanıcı Deposu (Arch User Repository)",
      "level": 3,
      "content": "Arch Yapım Sistemi'nin resmî depolarda bulunan yazılımları derleme olanağı sağlamasının yanında, Arch User Repository (AUR) kullanıcılar tarafından gönderilen paketlere karşılık gelir. AUR, web arayüzü ile veya Aurweb RPC interface ile ulaşabileceğiniz, yapım betikleri (script) barındıran ve desteklenmeyen, yani kullanıcıların buradan yapacağı yüklemeler sonucunda karşılaşabilecekleri olası sorunların kullanıcıların sorumluluğunda olduğu bir depodur.\n\nAUR deposu Arch Linux tarafından sunulur. Sorumluluk reddi beyanı, AUR'un üçüncü taraf bir depo olmasından dolayı değil, kullanıcılar tarafından gönüllü olarak hazırlanan paketleri içerdiği içindir.\n\n"
    },
    {
      "title": "Önyükleme",
      "level": 2,
      "content": "Bu bölüm önyükleme sürecine ilişkin bilgiler barındırır. Arch önyükleme sürecine dair genel bir bakış Arch boot process sayfasında bulunabilir. Dahası için Category:Boot process kategorisine bakın.\n\n"
    },
    {
      "title": "Donanımların otomatik algılanması",
      "level": 3,
      "content": "Donanımlar önyükleme sırasında udev tarafından otomatik olarak algılanıyor olmalıdır. Önyükleme süresini kısaltmak için muhtemel bir çözüm olarak modüllerin otomatik yüklenmesi yerine yüklenecek modüllerin, Kernel modules sayfasında belirtildiği üzere, tek tek belirtilmesi denenebilir. Ek olarak; Xorg, udev'i kullanarak sürücüleri (driver) otomatik olarak algılamalıdır, ancak kullanıcılar X sunucusunu elle yapılandırabilme seçeneğine sahiptir.\n\n"
    },
    {
      "title": "Mikrokod",
      "level": 3,
      "content": "İşlemciler hatalı bazı davranışlar gösterebilir ve sistem çekirdeği bu davranışları sistemin açılış aşamasında mikrokod güncellemesi yaparak düzeltebilir. Ayrıntılar için Microcode sayfasına göz atabilirsiniz.\n\n"
    },
    {
      "title": "Önyükleme mesajlarını geri getirme",
      "level": 3,
      "content": "Açılış ekranı sonlandığında tüm ekran temizlenir ve giriş ekranı gözükür, bu sebeple kullanıcı önyükleme süreci hakkında herhangi bir geribildirim alamaz. Disable clearing of boot messages sayfasındaki yönergeleri uygulayarak bu sınırlamanın üstesinden gelebilirsiniz.\n\n"
    },
    {
      "title": "Num Lock'u aktif etmek",
      "level": 3,
      "content": "Num Lock çoğu klavyede bulunan bir değiştirme tuşudur (toggle key). Num Lock tuşunu sistem başlatıldığında aktif etmek için Activating numlock on bootup sayfasına bakabilirsiniz.\n\n"
    },
    {
      "title": "Çizgesel (Graphical) kullanıcı arayüzü",
      "level": 2,
      "content": "Bu bölüm, sistemlerinde çizgesel bir arayüz çalıştırmak isteyen kullanıcılar için gerekli yönergeleri barındırmaktadır. Category:Graphical user interfaces sayfasını ziyaret ederek ek kaynaklara erişebilirsiniz.\n\n"
    },
    {
      "title": "Görüntü sunucusu",
      "level": 3,
      "content": "Xorg halka açık, açık kaynak kodlu bir Wikipedia:tr:X Pencere Sistemi uyarlamasıdır (sık bilinen ismi ile X11 veya X). Uygulamaları çizgesel (graphical) kullanıcı arayüzü (GUI) ile çalıştırmak için gereklidir.\n\nWayland, daha yeni, alternatif bir görüntü sunucusu protokolüdür ve birçok dizgicinin (compsoitor) temelini oluşturur. Artırılmış güvenliği, modern grafik işlemlerini daha verimli şekilde işlemesi ve aktif bir şekilde geliştirilmesinin yanında Xwayland aracılığı ile uyumluluğu sürdürmesi sebebiyle Xorg'dan daha avantajlı konumdadır.\n\n"
    },
    {
      "title": "Görüntü sürücüleri (driver)",
      "level": 3,
      "content": "Varsayılan modesetting görüntü sunucusu sürücüsü çoğu ekran kartında çalışacaktır, ancak AMD veya NVIDIA ürünlerine sahip kullanıcılar uygun sürücüleri indirerek performans artırılabilir ve ek özelliklerden yararlanılabilir.\n\n"
    },
    {
      "title": "Masaüstü ortamları",
      "level": 3,
      "content": "Her ne kadar ekran sunucusu (display server) çizgesel (graphical) bir arayüzü oluşturmak için temel araçları barındırsa da ek bileşenler tam bir kullanıcı deneyimi için gerekli olabilir. GNOME, KDE, COSMIC, LXDE ve Xfce gibi masaüstü ortamları; panel, dosya yöneticisi, uçbirim (terminal), metin düzenleyicisi, ikonlar ve başka birçok X11 üzerinde çalışan aracı bir araya getiren yazılım bütünleridir. Az tecrübeli kullanıcılar bu araçları ayrı ayrı indirmek yerine bir masaüstü ortamını indirip alışık oldukları işletim sistemlerine daha benzer bir bilgisayar ortamını tercih etmek isteyebilirler. Konu hakkında Masaüstü ortamları sayfasından ek kaynaklara erişebilirsiniz.\n\n"
    },
    {
      "title": "Pencere yöneticileri ve dizgicileri",
      "level": 3,
      "content": "Tam teşekküllü bir masaüstü ortamı, tam ve tutarlı bir çizgesel kullanıcı arayüzü sağlar, ancak bunun yanında fazlasıyla sistem kaynağı harcama eğilimi gösterir. Bilgisayar performanslarını mümkün olduğu kadar artırmak isteyen veya daha sade bir bilgisayar ortamına sahip olmak isteyen kullanıcılar bir pencere yöneticisini kurmayı ardından istedikleri diğer araçları kendileri seçmeyi tercih edebilirler. Ek olarak eğer Xorg kullanıyorsanız, çoğu masaüstü ortamı alternatif bir pencere yöneticisi kullanmayı desteklemektedir. Dinamik, istiflenen ve döşeme pencere yöneticileri, pencereleri ele alma biçimleri ile birbirlerinden ayrılırlar.\n\n"
    },
    {
      "title": "Görüntü yöneticisi",
      "level": 3,
      "content": "Çoğu masaüstü ortamı, otomatik olarak çizgesel ortamı başlatabilmek ve kullanıcı girişlerini kontrol edebilmek için bir görüntü yöneticisini dahilinde barındırır. Alternatif olarak start X at login (X'i giriş yapınca başlat) seçeneğini, görüntü yöneticilerine basit bir alternatif olarak tercih edebilirsiniz.\n\n"
    },
    {
      "title": "Kullanıcı dizinleri",
      "level": 3,
      "content": "İndirilenler veya Müzik gibi çokça bilinen kullanıcı dizinleri xdg-user-dirs-update.service kullanıcı servisi tarafından oluşturulur, bu servis xdg-user-dirs paketi tarafından sağlanır ve kurulumun akabinde varsayılan olarak çalıştırılır. Eğer masaüstü ortamınız veya pencere yöneticiniz bu paketi beraberinde kurmuyorsa, kendiniz kurup xdg-user-dirs-update servisini başlatabilirsiniz.\n\n"
    },
    {
      "title": "Güç yönetimi",
      "level": 2,
      "content": "Bu bölüm dizüstü bilgisayar sahipleri veya güç yönetim kontrollerini arayan kullanıcılar için yararlı olabilir. Category:Power management kategorisine bakarak daha fazla bilgiye erişebilirsiniz.\n\nDaha genel bir özet için Power management sayfasına bakın.\n\n"
    },
    {
      "title": "ACPI olayları (events)",
      "level": 3,
      "content": "Kullanıcılar, güç tuşuna basmak veya laptop kapağını kapatmak gibi ACPI olaylarına sistemin nasıl tepki vereceğini ayarlayabilirler. systemd kullanarak gerçekleştirilen önerilen yöntem için Power management#ACPI events sayfasına bakın. Daha eski bir yöntem için ise acpid sayfasına bakın.\n\n"
    },
    {
      "title": "CPU frekansını ölçeklendirme",
      "level": 3,
      "content": "Modern işlemciler, güç kullanımını ve ısınmayı azaltmak için frekanslarını ve voltajlarını düşürebilirler. Daha az ısı ortaya çıktığı için sistem daha sessiz çalışır ve donanımlarınız ömrü daha uzun olur. Detaylar için CPU frequency scaling sayfasına bakın.\n\n"
    },
    {
      "title": "Dizüstü bilgisayarlar",
      "level": 3,
      "content": "Taşınabilir bilgisayarlar ve belli bir bilgisayar modeline özgü kurulum yönergeleri barındıran makaleler için Category:Laptops kategorisine göz atabilirsiniz. Dizüstü bilgisayarlar ile ilgili öneriler ve makalelere genel bir bakış için Laptop sayfasına bakın.\n\n"
    },
    {
      "title": "Uyku ve \"Hazırda Beklet\"",
      "level": 3,
      "content": "Ana makaleye göz atın: Power management/Suspend and hibernate.\n\n"
    },
    {
      "title": "Çoklu ortam",
      "level": 2,
      "content": "Category:Multimedia kategorisi ek kaynakları barındırır.\n\n"
    },
    {
      "title": "Ses sistemi",
      "level": 3,
      "content": "ALSA ses sitemi, sistem çekirdeğinin beraberinde gelir ve sistem açıldıktan sonra otomatik olarak çalışabilmelidir. PipeWire ve PulseAudio gibi ses sunucuları ek özellikler sunabilir ve daha karmaşık ses yapılandırmalarını destekleyebilir.\n\nProfessional audio sayfası ile profesyonel ses ayarlamaları hakkında bilgi sahibi olabilirsiniz.\n\n"
    },
    {
      "title": "Ağ yapılandırması",
      "level": 2,
      "content": "Bu bölüm küçük ağ yapılandırma prosedürleri ile sınırlıdır. Daha tam bir yapılandırma rehberi için Network configuration sayfasına ve ilgili makaleler için Category:Networking sayfasına bakın.\n\n"
    },
    {
      "title": "DNS güvenliği",
      "level": 3,
      "content": "İnternette gezinirken, online alışveriş yaparken, SSH servislerine bağlanırken ve benzer çevrim içi işler gerçekleştirirken imzalı DNS kayıtlarını doğrulayabilecek, DNSSEC aktif edilmiş bir DNS çözümleyicisini ve TLS üzerinden DNS, HTTPS üzerinden DNS veya DNSCrypt gibi şifrelenmiş bir protokol kullanmayı gözden geçirin. Detaylar için Domain name resolution sayfasına bakın.\n\n"
    },
    {
      "title": "Güvenlik duvarı ayarlama",
      "level": 3,
      "content": "Bir güvenlik duvarı, Linux ağ yığınınıza ek bir güvenlik katmanı sağlayabilir. Stok Arch çekirdeği Netfilter'ın alt birimi olan iptables ve nftables gibi özellikleri desteklese de ikisi de varsayılan olarak açık değildir. Bir tür güvenlik duvarı ayarlamak şiddetle önerilir. Category:Firewalls kategorisini ziyaret ederek mevcut rehberleri görebilirsiniz.\n\n"
    },
    {
      "title": "Ağ üzerinden paylaşım",
      "level": 3,
      "content": "Aynı ağ üzerinde olan cihazlar arasında dosya paylaşımı için NFS veya SSHFS makalelerini takip edin.\n\nSamba'yı kullanarak bir Windows ağına katılabilirsiniz. Cihazınızı kimlik doğrulama amacıyla Active Directory kullanacak şekilde ayarlamak için Active Directory integration sayfasını okuyun.\n\nAyrıca Category:Network sharing sayfasına bakın.\n\n"
    },
    {
      "title": "Girdi cihazları",
      "level": 2,
      "content": "Bu bölüm yaygın girdi cihazları için yapılandırma ipuçları içermektedir. Dahası için Category:Input devices sayfasına bakın.\n\n"
    },
    {
      "title": "Klavye düzenleri",
      "level": 3,
      "content": "İngilizce olmayan veya başkaca standart dışı klavyeler varsayılan ayarlarla beklendikleri gibi çalışmayabilirler. Tuşeşlemi ayarlamak için uygulanması gereken aşamalar Xorg için ve sanal konsol için faklıdırlar, sırasıyla Linux console (Türkçe)/Keyboard configuration (Türkçe) ve Keyboard configuration in Xorg sayfalarında yapmanız gerekenler açıklanmıştır.\n\n"
    },
    {
      "title": "Fare butonları",
      "level": 3,
      "content": "Gelişmiş veya alışılmadık türden bir fare kullanan kullanıcılar tüm fare butonlarının varsayılan olarak algılanmadığını fark edebilirler, veya ekstra butonlarına farklı eylemler atamak isteyebilirler. Bunun için gerekli yönergeler Mouse buttons sayfasında mevcuttur.\n\n"
    },
    {
      "title": "Dizüstü dokunmatik fareleri",
      "level": 3,
      "content": "Birçok dizüstü bilgisayar Synaptics veya ALPS markalı dokunmatik farelerini kullanır. Bu modeller ve diğer birçok dokunmatik yüzey modeli için Synaptics girdi sürücüsünü veya libinput'u kullanabilirsiniz. Touchpad Synaptics ve libinput'u ziyaret ederek kurulum ve yapılandırma hakkında detayları öğrenebilirsiniz.\n\n"
    },
    {
      "title": "TrackPoint",
      "level": 3,
      "content": "TrackPoint cihazınızı yapılandırmak için TrackPoint makalesine bakın.\n\n"
    },
    {
      "title": "Optimizasyon",
      "level": 2,
      "content": "Bu bölüm sistemin ve uygulamaların performansını artırmak için yapabileceğiniz ayarlamalar, araçlar ve uygun seçenekleri özetlemeyi amaçlar.\n\n"
    },
    {
      "title": "Performans testi",
      "level": 3,
      "content": "Performans testi veya diğer bilinen adıyla \"benchmark\" yapmak, sisteminizin performansını ölçüp sonuçları diğer sistemlerle karşılaştırmaya veya yaygın olarak kabul gören bir standartla tümleşik bir prosedür üzerinden karşılaştırmaya verilen addır.\n\n"
    },
    {
      "title": "Performansı artırma",
      "level": 3,
      "content": "Improving performance makalesi Arch Linux sisteminizde performansınızı artırmak için yapabileceklerinize dair bilgiler için bir özet sağlar.\n\n"
    },
    {
      "title": "Katı hal sürücüsü (SSD)",
      "level": 3,
      "content": "Solid state drive makalesi katı hal sürücülerinin birçok yönünü ele alır, bunların arasında SSD'lerin ömrünü uzatmakla alakalı, örneğin TRIM ile, ayarlamalar da bulunur.\n\n"
    },
    {
      "title": "Sistem servisleri",
      "level": 2,
      "content": "Bu bölüm hayalet programlar (daemon) ile alakalıdır.\n\n"
    },
    {
      "title": "Dosya indeksleme ve arama yapma",
      "level": 3,
      "content": "Çoğu dağıtımda (distro) dosya araması yapabilmek için locate komutu kullanılabilir durumdadır. Arch Linux bunun yanında birçok alternatif sunmaktadır, detaylar için locate'e bakın.\n\nMasaüstü arama motorları, locate'inkine benzer bir faaliyet sağlar ve bunun yanında masaüstü ortamları ile daha entegre çalışırlar.\n\n"
    },
    {
      "title": "Yerel posta (mail) teslimi",
      "level": 3,
      "content": "Varsayılan bir kurulum e-postaları senkronize etmek için herhangi bir yol sağlamaz. E-posta teslim vekillerinin listesi mail server makalesinde listelenmiştir.\n\n"
    },
    {
      "title": "Yazıcılar",
      "level": 3,
      "content": "CUPS, OpenPrinting tarafından geliştirilmiş, standart tabanlı, açık kaynak kodlu Linux yazdırma sistemidir. Category:Printers kategorisinde yazıcı odaklı makalelere erişebilirsiniz.\n\n"
    },
    {
      "title": "Görünüm",
      "level": 2,
      "content": "Bu bölüm, estetik anlamda hoş bir Arch deneyimi için çokça rağbet gören \"göze hoş gelen\" diye özetleyebileceğimiz bazı ayarlamalar içerir. Dahası için Category:Eye candy kategorisine bakın.\n\n"
    },
    {
      "title": "Yazı tipleri",
      "level": 3,
      "content": "Arch sisteminizde dâhili olarak sadece boyutlandırılamayan biteşlem yazı tipleri bulunur, bu yüzden sisteminize ek olarak TrueType yazı tipleri indirmek isteyebilirsiniz. Birçok Unicode karakterini kapsayan ve üstelik diğer işletim sistemlerinden metrik desteği (metric-compatible fonts) olan yazı tipi aileleri Arch depolarında bulunur.\n\nKonu hakkında bolca bilgiye Fonts ve Font configuration makalelerinden erişilebilir.\n\nSanal konsolda (yani X sunucusunun dışında) ciddi miktarda zaman geçiren kullanıcılar, okunabilirliği artırmak için konsol fontunu değiştirmek isteyebilirler. Konu hakkında bilgi için Linux konsolu#Yazı tipleri sayfasına bakın.\n\n"
    },
    {
      "title": "GTK ve Qt temaları",
      "level": 3,
      "content": "Linux sistemlerdeki çizgesel arayüze sahip uygulamaların büyük bir çoğunluğunun temeli GTK veya Qt araç takımlarına (toolkit) bağlıdır. İlgili makalelere ve Uniform look for Qt and GTK applications sayfasına bakarak indirdiğiniz uygulamaların dış görünüşünü nasıl güzelleştirebileceğinize ve nasıl kendi zevkinize göre uyarlayabileceğinize dair bir fikir edinebilirsiniz.\n\n"
    },
    {
      "title": "Konsol iyileştirmeleri",
      "level": 2,
      "content": "Bu bölüm konsol programlarının kullanışlılığını artırmak için yapabileceğiniz küçük değişiklikleri ele almaktadır. Dahası için Category:Command-line shells kategorisine bakabilirsiniz.\n\n"
    },
    {
      "title": "Tab tamamlamaları için iyileştirmeler",
      "level": 3,
      "content": "Tercih ettiğiniz kabuğun (shell) makalesindeki ilgili yönergeleri uygulayarak genişletilmiş tab tamamlamalarını ayarlayabilirsiniz.\n\n"
    },
    {
      "title": "Armalar (Aliases)",
      "level": 3,
      "content": "Bir komuta veya komut grubuna arma takmak konsolda zaman kazanmanın yollarından biridir. Özellikle her bir çalıştırma sırasında parametrelerinde herhangi bir değişiklik yapmayı gerektirmeyen ve tekrar tekrar kullanılan komutlar için özellikle yararlı olabilir. Bash#Aliases sayfasında sıkça kullanılan ve zaman kazandıran bazı armalar bulunabilir, bu armalar aynı zamanda zsh'e de kolayca aktarılabilir.\n\n"
    },
    {
      "title": "Alternatif kabuklar",
      "level": 3,
      "content": "Bir Arch sisteminde varsayılan olarak kurulu olan kabuk Bash kabuğudur. Ancak Canlı kurulum ortamı zsh kabuğunu çalıştırır ve grml-zsh-config paketiyle erişebileceğiniz bir ayarlamalar bütününe sahiptir. Alternatif kabukların listesi için Command-line shell#List of shells sayfasına bakabilirsiniz.\n\n"
    },
    {
      "title": "Bash için eklemeler",
      "level": 3,
      "content": "Çeşitli Bash ayarlamalarının listesi, geçmiş araması ve Satırokuma (Readline) makroları Bash#Tips and tricks sayfasında mevcuttur.\n\n"
    },
    {
      "title": "Renkli çıktı",
      "level": 3,
      "content": "Bu bölüm konsolda renkli çıktıları ele almaktadır.\n\n"
    },
    {
      "title": "Sıkıştırılmış dosyalar",
      "level": 3,
      "content": "Bir GNU/Linux sisteminde sıkıştırılmış dosyalara veya arşivlere sıkça rastlanır. Tar en sık kullanılan arşivleme araçlarından birisidir ve kullanıcıları sözdizimi (syntax) ile haşır neşir olmalıdır. (örneğin Arch Linux uygulama paketleri zstd biçiminde sıkıştırılmış Tar dosyalarıdır). Arşivleme ve sıkıştırma işlemleri hakkında bilgi edinmek için Archiving and compression sayfasına bakın.\n\n"
    },
    {
      "title": "Konsol istemi",
      "level": 3,
      "content": "Konsol istemi (PS1) ayrıntılı bir şekilde kişiselleştirilebilir. Konu hakkında Bash/Prompt customization veya Zsh#Prompts sayfalarından sırasıyla Bash veya Zsh kabuklarına göre bilgi edinebilirsiniz.\n\n"
    },
    {
      "title": "Emacs kabuğu",
      "level": 3,
      "content": "Emacs, sıradan bir metin düzenleyicisinin ötesinde işler için seçenekler sunmasıyla bilinir, bunlardan biri de Emacs'ı tam bir kabuk olarak kullanabilme şansı sağlamasıdır. Emacs'ta renkli çıktıyı aktif edince ortaya çıkan karmaşık karakterler sorunun çözmek için Emacs#Colored output issues sayfasına başvurunuz.\n\n"
    },
    {
      "title": "Fare desteği",
      "level": 3,
      "content": "Konsol üzerinden fare kullanarak kopyala-yapıştır işlemleri, GNU Screen'in geleneksel kopyalama moduna tercih edilebilir. Kapsamlı yönergeler için General purpose mouse sayfasına başvurun. Şunun da bilinmesinde fayda var ki kopyala-yapıştır işlemlerini uçbirim emülatörleri kullanarak pano aracılığı gerçekleştirebilirsiniz.\n\n"
    },
    {
      "title": "Oturum yönetimi",
      "level": 3,
      "content": "tmux veya GNU Screen gibi uçbirim çoklayıcılarını kullanırken programlar; sekmeler ve yarı pencereler şeklinde birleştirilmiş ve istenildiğinde birbirlerinden ayrılabilecek oturumlar şeklinde çalışabilirler; bu yüzden kullanıcılar uçbirim emülatörlerini, X'i veya kullanıcıyı kapattıklarında ilgili uçbirim çoklayıcısının sunucusu açık olduğu sürece oturuma bağlı ilgili programlar çalışmaya devam ederler. Bu programlara erişebilmek ilgili oturumları yeniden iliştirmeyi gerektirir.\n\n"
    }
  ]
}