{
  "title": "General recommendations (Português)",
  "url": "https://wiki.archlinux.org/title/General_recommendations_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Perguntas frequentes\n- Guia de instalação\n- Lista de aplicativos\n\nEsse documento é um índice anotado de artigos populares e informações importantes para melhorar e adicionar funcionalidades ao sistema Arch instalado. Presume-se aqui que os leitores leram e seguiram o Guia de instalação para obter uma instalação básica do Arch Linux. Ter lido e entendido os conceitos explicados em #Administração do sistema e #Gerenciamento de pacote é obrigatório para seguir as outras seções desta página e outros artigos no wiki.\n\n"
    },
    {
      "title": "Administração do sistema",
      "level": 2,
      "content": "Essa seção lida com tarefas administrativas e gerenciamento do sistema. Veja Utilitários principais e Categoria: Administração do sistema para mais.\n\n"
    },
    {
      "title": "Usuários e grupos",
      "level": 3,
      "content": "Uma nova instalação deixa você com apenas a conta de superusuário, mais conhecida como \"root\". Fazer login como root por longos períodos de tempo, possivelmente expondo-o via SSH em um servidor, é inseguro. Em vez disso, você deve criar e usar contas de usuários sem privilégios para a maioria das tarefas, usando apenas a conta root para administração do sistema. Veja Usuários e grupos#Gerenciamento de usuário para detalhes.\n\nUsuários e grupos são um mecanismo para controle de acesso; administradores podem ajustar participação e posse de grupos para conceder ou negar aos usuários e serviços acesso aos recursos do sistema. Leia o artigo Usuários e grupos para detalhes e possíveis riscos de segurança.\n\n"
    },
    {
      "title": "Segurança",
      "level": 3,
      "content": "Leia Segurança para recomendações e boas práticas para proteger o sistema.\n\nPara uma lista de aplicativos que permitem executar comandos ou iniciar um shell interativo como outro usuário (por exemplo, root), veja List of applications/Security#Privilege elevation.\n\n"
    },
    {
      "title": "Gerenciamento de serviço",
      "level": 3,
      "content": "Arch Linux usa systemd como o processo init, que é um gerenciador de sistema e serviço para Linux. Para manter sua instalação do Arch Linux, é uma boa ideia aprender os básicos sobre ele.\n\nInteração com o systemd é feita com o comando systemctl. Veja systemd (Português)#Uso básico do systemctl para mais informações.\n\nUm sistema de registro também é fornecido, com o comando journalctl. Veja journal para mais informações.\n\n"
    },
    {
      "title": "Manutenção de sistema",
      "level": 3,
      "content": "Arch é um sistema rolling release e tem uma mudança rápida de pacote, então usuários levam algum tempo para fazer manutenção do sistema.\n\n"
    },
    {
      "title": "Gerenciamento de pacote",
      "level": 2,
      "content": "Essa seção contém informações úteis relacionadas ao gerenciamento de pacote. Veja Perguntas frequentes#Gerenciamento de pacote e Category:Package management (Português) para mais.\n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman, uma abreviação de package manager, é o gerenciador de pacotes do Arch Linux: é altamente recomendável que você se familiarize com ele antes de ler qualquer outro artigo.\n\nPara habilitar o download de pacotes em paralelo, veja pacman (Português)#Habilitando downloads em paralelo.\n\nPara tratamento de longo prazo de pacotes armazenados em cache, consulte pacman#Limpando o cache de pacotes.\n\nVeja pacman/Dicas e truques para sugestões sobre como melhorar sua interação com pacman e o gerenciamento de pacotes em geral.\n\n"
    },
    {
      "title": "Repositórios",
      "level": 3,
      "content": "Veja o artigo Repositórios oficiais para detalhes sobre o propósito de cada repositório oficialmente mantido.\n\nSe você planeja usar aplicativos 32 bits, você vai querer habilitar o repositório multilib.\n\nO artigo Repositórios extraoficiais de usuário lista diversos outros repositórios sem suporte.\n\nConsidere instalar o serviço pkgstats.\n\n"
    },
    {
      "title": "Espelhos",
      "level": 3,
      "content": "Por vezes chamados de \"espelhos\" (mirrors). Visite o artigo Espelhos para saber como aproveitar ao máximo o uso de espelhos mais rápidos e mais atualizados dos repositórios oficiais. Conforme explicado no artigo, um conselho particularmente bom é verificar rotineiramente a página Mirror Status para obter uma lista de espelhos que foram sincronizados recentemente. Isso pode ser automatizado com o Reflector.\n\n"
    },
    {
      "title": "Arch Build System",
      "level": 3,
      "content": "Ports é um sistema inicialmente usado pelas distribuições BSD consistindo em scripts de compilação que residem em uma árvore de diretório no sistema local. Basicamente, cada port contém um script dentro de um diretório intuitivamente nomeado pelo aplicativo terceiro instalável.\n\nO Arch Build System oferece a mesma funcionalidade para fornecer scripts de compilação chamados PKGBUILDs, que são populados com informações para uma dada peça de software: hashes de integridade, instruções de compilação e licença, versão e URL do projeto. Esses PKGBUILDs são analisados pelo makepkg, o programa atual que gera pacotes que são gerenciáveis de forma limpa pelo pacman.\n\nTodo pacote nos repositórios junto com aqueles presentes no AUR estão sujeitos a recompilação com makepkg.\n\n"
    },
    {
      "title": "Arch User Repository",
      "level": 3,
      "content": "Enquanto o Arch Build System permite a capacidade de compilar softwares disponíveis nos repositórios oficiais, o Arch User Repository (AUR) é o equivalente a pacotes enviados por usuários. É um repositório sem suporte de scripts de compilação acessíveis por meio da interface web ou pela interface RPC do Aurweb.\n\n"
    },
    {
      "title": "Inicialização",
      "level": 2,
      "content": "Essa seção contém informações pertinentes ao processo de inicialização (boot). Uma visão geral do processo de inicialização do Arch pode ser localizado em Processo de inicialização do Arch. Veja Category:Boot process (Português) para mais.\n\n"
    },
    {
      "title": "Autorreconhecimento de hardware",
      "level": 3,
      "content": "Hardware deve ser detectado automaticamente pelo udev durante o processo de inicialização por padrão. Uma melhoria potencial no tempo de inicialização pode ser atingido pela desabilitação de carregamento automático de módulos e especificação manual dos módulos necessários, como descrito em módulos de kernel. Além disso, Xorg deve ser capaz de detectar automaticamente drivers necessários usando udev, mas os usuários também têm a opção de configurar o servidor X manualmente.\n\n"
    },
    {
      "title": "Microcódigo",
      "level": 3,
      "content": "Processadores podem ter comportamento falho, o que o kernel pode corrigir atualizando o microcódigo na inicialização. Veja Microcódigo para detalhes.\n\n"
    },
    {
      "title": "Retendo mensagens de inicialização",
      "level": 3,
      "content": "Uma vez que o prompt de login aparece, as mensagens de inicialização são apagadas, deixando os usuários incapaz de obter feedback sobre o processo de inicialização. Desative a limpeza de mensagens de inicialização para superar dessa limitação.\n\n"
    },
    {
      "title": "Ativação de Num Lock",
      "level": 3,
      "content": "Num Lock é uma tecla de ativar/desativar localizada na maioria dos teclados. Para ativar a atribuição de tecla numérica do Num Lock durante a inicialização, veja Ativando numlock na inicialização.\n\n"
    },
    {
      "title": "Interface gráfica de usuário",
      "level": 2,
      "content": "Essa seção fornece orientação para usuários interessados em usar aplicativos gráficos em seu sistema. Veja Category:Graphical user interfaces (Português) para recursos adicionais.\n\n"
    },
    {
      "title": "Servidor de exibição",
      "level": 3,
      "content": "Xorg é a implementação código aberto e pública do X Window System (mais conhecido como X11 ou X). Ele é necessário para se usar aplicativos com interfaces gráficas de usuário (também conhecidas como GUIs).\n\nWayland é um protocolo de servidor de exibição alternativo mais novo com vários compositores para escolher. Suas vantagens sobre o Xorg são recursos de segurança aprimorados, manuseio mais eficiente de tarefas gráficas modernas e desenvolvimento ativo, mantendo a compatibilidade por meio do Xwayland.\n\n"
    },
    {
      "title": "Drivers de exibição",
      "level": 3,
      "content": "O driver de vídeo padrão modesetting funcionará com a maioria das placas de vídeo, mas o desempenho pode ser melhorado e recursos adicionais podem ser aproveitados instalando o driver apropriado para produtos AMD ou NVIDIA.\n\n"
    },
    {
      "title": "Ambientes gráficos",
      "level": 3,
      "content": "Embora o servidor de exibição forneça um framework básico para compilação de um ambiente gráfico, componentes adicionais podem ser considerados necessários para uma experiência de usuário completa. Ambientes de desktop, como o KDE, GNOME, Xfce, Cinnamon e LXDE, agrupam uma ampla gama de aplicativos bem integrados, como um gerenciador de janelas ou compositor, painel/barra de tarefas, gerenciador de arquivos, emulador de terminal, editor de texto, ícones e outros utilitários. Usuários com menos experiência podem preferir instalar um ambiente gráfico para ter um ambiente mais familiar. Veja Category:Desktop environments (Português) para recursos adicionais.\n\n"
    },
    {
      "title": "Gerenciadores de janela ou Compositores",
      "level": 3,
      "content": "Um ambiente gráfico completo fornece uma interface gráfica de usuário completa e consistente, mas tende a consumir uma boa quantidade de recursos do sistema. Usuários buscando maximizar o desempenho ou simplificar seu ambiente, podem optar por instalar um gerenciador de janela ou compositor sozinho e selecionar pessoalmente os extras desejados. Usando o Xorg, a maioria dos ambientes gráficos também permitem o uso de um gerenciador de janela alternativo. Os gerenciadores de janela dinâmicos, empilhamento e tiling se diferem na forma de lidar com posicionamento das janelas.\n\n"
    },
    {
      "title": "Diretórios de usuário",
      "level": 3,
      "content": "Os diretórios de usuário conhecidos, como Downloads ou Música, são criados pelo serviço do usuário xdg-user-dirs-update.service, fornecido por xdg-user-dirs e ativado por padrão após a instalação. Se o seu ambiente de desktop ou gerenciador de janelas não puxar o pacote, você pode instalar e executar xdg-user-dirs-update manualmente conforme Diretórios de usuário XDG#Criando diretórios padrão.\n\n"
    },
    {
      "title": "Gerenciadores de exibição",
      "level": 3,
      "content": "A maioria dos ambientes gráficos incluem um gerenciador de exibição para iniciar automaticamente o ambiente gráfico e gerenciar autenticação de usuário. Usuários sem um ambiente gráfico podem instalar um separadamente. Alternativamente, você pode iniciar X no login como uma alternativa simples a um gerenciador de exibição.\n\n"
    },
    {
      "title": "Gerenciamento de energia",
      "level": 2,
      "content": "Essa seção pode ser usada por donos de laptop ou usuários que busquem controles de gerenciamento de energia. Veja Category:Power management para mais.\n\nVeja Gestão de energia para uma visão geral.\n\n"
    },
    {
      "title": "Eventos de ACPI",
      "level": 3,
      "content": "Os usuários podem configurar como o sistema reage a eventos ACPI, como pressionar o botão de energia ou fechar a tampa de um laptop. Para o método recomendado usando systemd, consulte Gestão de energia#Eventos ACPI. Para o método antigo, consulte acpid.\n\n"
    },
    {
      "title": "Escala de frequência de CPU",
      "level": 3,
      "content": "Processadores modernos pode reduzir sua frequência e voltagem para reduzir a temperatura e consumo de energia. Menos calor leva a um sistema mais silencioso e prolonga a vida útil do hardware. Veja Escala de frequência do CPU para detalhes.\n\n"
    },
    {
      "title": "Laptops",
      "level": 3,
      "content": "Para artigos relacionados a computação portátil, junto com guias de instalação a modelos específicos, por favor veja Category:Laptops. Para uma visão geral de artigos e recomendações relacionadas, veja Laptop (Português).\n\n"
    },
    {
      "title": "Suspensão e hibernação",
      "level": 3,
      "content": "Veja o artigo principal: Gestão de energia/Suspender e hibernar.\n\n"
    },
    {
      "title": "Multimídia",
      "level": 2,
      "content": "Category:Multimedia inclui recursos adicionais.\n\n"
    },
    {
      "title": "Sistema de som",
      "level": 3,
      "content": "ALSA é um sistema de som do kernel que deve funcionar por padrão (só é preciso desmutá-lo). Servidores de som como PipeWire e PulseAudio podem oferecer recursos adicionais e suportar configurações de áudio mais complexas.\n\nVeja Áudio profissional para obter requisitos avançados de áudio.\n\n"
    },
    {
      "title": "Rede",
      "level": 2,
      "content": "Esta seção limita-se a pequenos procedimentos de rede. Consulte Configuração de rede para um guia de configuração completo e Category:Networking (Português) para artigos selecionados.\n\n"
    },
    {
      "title": "Segurança de DNS",
      "level": 3,
      "content": "Para melhor segurança ao navegar na web, jogar na internet, conectar a serviços SSH e tarefas similares, considere usar um resolvedor de DNS habilitado para DNSSEC que pode validar registros DNS assinados e DNSCrypt e um protocolo criptografado como DNS sobre TLS, DNS sobre HTTPS ou DNSCrypt. Veja Resolução de nome de domínio para detalhes.\n\n"
    },
    {
      "title": "Configuração de um firewall",
      "level": 3,
      "content": "Um firewall pode fornecer uma camada extra de proteção sobre a pilha de rede do Linux. O kernel padrão do Arch é capaz de usar iptables do Netfilter e nftables, apesar de não estarem habilitados por padrão. É altamente recomendado para configurar alguma forma de firewall. Veja Category:Firewalls para os guias disponíveis.\n\n"
    },
    {
      "title": "Compartilhamentos de rede",
      "level": 3,
      "content": "Para compartilhar arquivos entre máquinas em uma rede, siga o artigo NFS ou o SSHFS.\n\nUse Samba para entrar em uma rede Windows. Para configurar a máquina para usar Active Directory para autenticação, leia Active Directory integration.\n\nVeja também Category:Network sharing.\n\n"
    },
    {
      "title": "Dispositivos de entrada",
      "level": 2,
      "content": "Esse seção contém dicas de configuração de dispositivo de entrada popular. Veja Category:Input devices para mais.\n\n"
    },
    {
      "title": "Layouts de teclado",
      "level": 3,
      "content": "Teclados não-americanos ou fora de padrão podem não funcionar como esperado por padrão. Os passos necessários para configurar o mapa de teclas sãos diferentes para console virtual e Xorg, eles são descritos em Configuração de teclado no console e Configuração de teclado no Xorg, respectivamente.\n\n"
    },
    {
      "title": "Botões de mouse",
      "level": 3,
      "content": "Proprietários de mouses avançados ou incomuns podem descobrir que nem todos os botões do mouse são reconhecidos por padrão, ou podem querer atribuir ações diferentes para botões extras. Instruções podem ser localizadas em Todos botões do mouse funcionando.\n\n"
    },
    {
      "title": "Touchpads de laptop",
      "level": 3,
      "content": "Muitos laptops usam dispositivos de ponteiro \"touchpad\" Synaptics ou ALPS. Para esses e vários outros modelos de touchpad você pode usar o driver de entrada do Synaptics ou do libinput; veja Touchpad Synaptics ou libinput para detalhes de instalação e configuração.\n\n"
    },
    {
      "title": "TrackPoints",
      "level": 3,
      "content": "Veja o artigo TrackPoint para configurar seu dispositivo TrackPoint.\n\n"
    },
    {
      "title": "Otimizações",
      "level": 2,
      "content": "Essa seção visa resumir ajustes, ferramentas e opções disponíveis úteis para melhorar o desempenho do sistema e de aplicativos.\n\n"
    },
    {
      "title": "Benchmarking",
      "level": 3,
      "content": "Benchmarking é o ato de medir o desempenho e comparar os resultados ou um padrão amplamente aceito por meio de um procedimento unificado.\n\n"
    },
    {
      "title": "Melhorando o desempenho",
      "level": 3,
      "content": "O artigo Melhorando o desempenho junta informações e é resumo básico sobre ganho de desempenho no Arch Linux.\n\n"
    },
    {
      "title": "Unidade de estado sólido",
      "level": 3,
      "content": "O artigo Unidade de estado sólido cobre muitos aspectos sobre solid state drives, incluindo configurá-los para maximizar seu tempo de vida, por exemplo com TRIM\n\n"
    },
    {
      "title": "Serviços de sistema",
      "level": 2,
      "content": "Essa seção está relacionada a daemons.\n\n"
    },
    {
      "title": "Índice e pesquisa por arquivo",
      "level": 3,
      "content": "A maioria das distribuições possuem um comando locale disponível para pode pesquisar arquivos rapidamente. O Arch Linux oferece várias alternativas, veja locale para detalhes.\n\nMecanismos de pesquisa fornecem um serviço similar, ao mesmo tempo mais integrado ao ambiente de desktop.\n\n"
    },
    {
      "title": "Entrega local de correio",
      "level": 3,
      "content": "Uma instalação padrão não fornece uma forma de sincronizar correios eletrônicos (e-mails). Uma lista de agentes de entrega de correio está disponível no artigo Servidor de e-mail.\n\n"
    },
    {
      "title": "Impressão",
      "level": 3,
      "content": "CUPS é um sistema de impressão código aberto e baseado em padrões desenvolvido pela OpenPrinting para o Linux. Veja Category:Printers para artigos específicos sobre impressoras.\n\n"
    },
    {
      "title": "Aparência",
      "level": 2,
      "content": "Essa seção contém ajustes cosméticos frequentemente procurados para uma experiência no Arch esteticamente mais agradável. Veja Category:Eye candy para mais.\n\n"
    },
    {
      "title": "Fontes",
      "level": 3,
      "content": "Você pode querer instalar um conjunto de fontes TrueType, já que fontes bitmap não escaláveis são incluídas no sistema Arch. Há várias famílias de fontes de propósito geral fornecendo grande cobertura de Unicode e até mesmo compatibilidade métrica com fontes de outros sistemas operacionais.\n\nUma abundância de informações sobre o assunto pode ser localizada nos artigos Fontes e Configuração de fonte.\n\nSe for dispender uma quantidade significante de tempo trabalhando pelo console virtual (i.e. fora de um servidor X), usuários podem querer alterar a fonte do console para melhorar a legibilidade; veja Console do Linux#Fontes.\n\n"
    },
    {
      "title": "Temas GTK e Qt",
      "level": 3,
      "content": "Uma grande parte dos aplicativos com uma interface gráfica para sistemas Linux são baseadas nos toolkist GTK ou Qt. Veja estes artigos e Aparência uniforme para aplicativos Qt e GTK para ideias de como melhorar a aparência de seus programas instalados e adapte-o ao seu gosto.\n\n"
    },
    {
      "title": "Melhorias no console",
      "level": 2,
      "content": "Essa seção se aplica a pequenas modificações que melhoram a praticidade de programas de console. Veja Category:Command-line shells (Português) para mais.\n\n"
    },
    {
      "title": "Melhorias na completação por Tab",
      "level": 3,
      "content": "É recomendado configurar adequadamente completação por tab estendida imediatamente, conforme instruído no artigo de seu shell escolhido.\n\n"
    },
    {
      "title": "Aliases",
      "level": 3,
      "content": "Fazer um alias de um comando, ou um grupo deles, é uma forma de economizar tempo ao usar o console. Isso é especialmente útil para tarefas repetitivas que não precisam de alteração significativa em seus parâmetros entre as execuções. Aliases comuns que economizam tempo podem ser encontrados em Bash#Aliases, que também são facilmente portáveis para zsh.\n\n"
    },
    {
      "title": "Shells alternativos",
      "level": 3,
      "content": "Bash é o shell instalado por padrão em um sistema Arch. A mídia de instalação live, porém, usa zsh com o pacote complementar grml-zsh-config. Veja Shell de linha de comando#Lista de shells para mais alternativas.\n\n"
    },
    {
      "title": "Adições ao Bash",
      "level": 3,
      "content": "Uma lista de configurações Bash diversas, pesquisa de histórico e macros Readline está disponível em Bash#Tips and tricks.\n\n"
    },
    {
      "title": "Saída colorida",
      "level": 3,
      "content": "Essa seção é coberta por Saída colorida no console.\n\n"
    },
    {
      "title": "Arquivos compactados",
      "level": 3,
      "content": "Arquivos compactados, ou pacotes, são frequentemente encontrados em um sistema GNU/Linux. Tar é uma das ferramentas de arquivamento mais comumente usadas, e usuários devem estar familiarizados com sua sintaxe (pacotes do Arch Linux, por exemplo, são nada mais do que tarballs compactadas com zstd). Veja Arquivamento e compactação.\n\n"
    },
    {
      "title": "Prompt de console",
      "level": 3,
      "content": "O prompt de console (PS1) pode ser personalizado para uma de diversas formas. Veja Prompt colorido do Bash ou Zsh#Prompts se estiver usando Bash ou Zsh, respectivamente.\n\n"
    },
    {
      "title": "Shell do emacs",
      "level": 3,
      "content": "Emacs é conhecido por conter opções diversas às tarefas de esperada edição de texto, sendo uma delas uma completa substituição do shell. Consulte Emacs#Colored output issues para uma correção sobre caracteres ilegíveis que podem resultar pelo uso de saída colorida.\n\n"
    },
    {
      "title": "Suporte a mouse",
      "level": 3,
      "content": "Usar um mouse com o console para operações de copiar-colar pode ser preferido em relação ao modo de cópia tradicional do GNU Screen. Veja o General purpose mouse para direções compreensivas. Note que você já pode fazer isso em emuladores de terminal com a área de transferência.\n\n"
    },
    {
      "title": "Gerenciamento de sessão",
      "level": 3,
      "content": "Com o uso de multiplexadores de terminal como o tmux ou GNU Screen, programas podem ser executados em sessões compostas de ambas e painéis que podem ser desanexados à vontade, de forma que quando o usuário matar o emulador de terminal, terminar o X ou encerrar sua sessão, os programas associados permanecerão em execução em segundo plano desde que o servidor multiplexador de terminar esteja ativo. A interação com os programas requer reanexar à sessão.\n\n"
    },
    {
      "title": "Utilitários de shell POSIX",
      "level": 3,
      "content": "Note: **This article or section is a candidate for moving to Core utilities.** This article or section is a candidate for moving to Core utilities.\n\nThis article or section is a candidate for moving to Core utilities.\n\nMuitos pacotes comuns já instalam os utilitários POSIX mais populares [1] como dependências, mas o metapacote posix pode ser instalado para garantir que todos eles estejam sempre presentes.\n\nAlém dos utilitários obrigatórios, também existem metapacotes para algumas das categorias opcionais:\n\n- posix-c-development\n- posix-software-development\n- posix-user-portability\n- posix-xsi\n\n"
    }
  ]
}