{
  "title": "General Recommendations (Русский)",
  "url": "https://wiki.archlinux.org/title/General_Recommendations_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Часто задаваемые вопросы\n- Руководство по установке\n- Список приложений\n\nЭта страница является снабжённым комментариями списком популярных статей и важной информации по улучшению и добавлению функциональности в установленную систему Arch. Предполагается, что для получения базовой системы Arch Linux вы прочли и следовали инструкциям из руководства по установке. Прочтение и понимание концепций, изложенных в разделах #Администрирование системы и #Управление пакетами, необходимо для понимания других разделов этой страницы и других статей в wiki.\n\n"
    },
    {
      "title": "Администрирование системы",
      "level": 2,
      "content": "Данный раздел посвящён административным задачам и управлению системой. Для получения дополнительной информации смотрите статью Основные утилиты и категорию Администрирование системы.\n\n"
    },
    {
      "title": "Пользователи и группы",
      "level": 3,
      "content": "В свежей установке присутствует лишь аккаунт суперпользователя, более известный как «root». Вход в систему от имени суперпользователя на длительное время, особенно на сервер через SSH, считается небезопасным. Вместо этого для большинства задач вам нужно создать и использовать аккаунты непривилегированных пользователей, используя аккаунт суперпользователя только для администрирования системы. Для получения дополнительной информации смотрите раздел Пользователи и группы#Управление пользователями.\n\nПользователи и группы — это механизм контроля доступа. Администраторы могут тонко настраивать владельцев и членство в группах, чтобы предоставлять или запрещать пользователям и службам доступ к системным ресурсам. Для получения дополнительной информации об этом, а также о потенциальных рисках, связанных с безопасностью, читайте статью Пользователи и группы.\n\n"
    },
    {
      "title": "Безопасность",
      "level": 3,
      "content": "Рекомендации и лучшие практики по защите своей системы описаны в статье Безопасность.\n\nСписок приложений, которые позволяют выполнять команды от имени другого пользователя (например, root), смотрите в статье Список приложений/Безопасность#Повышение привилегий.\n\n"
    },
    {
      "title": "Управление службами",
      "level": 3,
      "content": "В качестве программы инициализации в Arch Linux используется systemd, являющаяся программой управления системой и службами для Linux. Для работы с установленным у вас Arch Linux желательно изучить основы её использования.\n\nВзаимодействие с systemd осуществляется при помощи команды systemctl. Для получения дополнительной информации читайте раздел systemd (Русский)#Основы использования systemctl.\n\nТакже systemd предоставляет собственную систему ведения логов, взаимодействовать с которой можно с помощью команды journalctl. Смотрите статью systemd/Журнал для более подробной информации.\n\n"
    },
    {
      "title": "Обслуживание системы",
      "level": 3,
      "content": "Arch — система с плавающими обновлениями (rolling release), и пакеты в ней обновляются довольно часто, так что пользователи должны уделять некоторое время обслуживанию системы.\n\n"
    },
    {
      "title": "Управление пакетами",
      "level": 2,
      "content": "В этом разделе содержится полезная информация, относящаяся к управлению пакетами. Чтобы узнать больше, смотрите раздел ЧаВо#Управление пакетами и категорию Управление пакетами.\n\nNote: **до** \n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman — это менеджер пакетов Arch Linux (package manager): настоятельно рекомендуется ознакомиться с ним перед чтением других статей.\n\nМожно включить параллельную загрузку для ускорения скачивания пакетов.\n\nДля освобождения места на диске можно очистить кэш пакетов.\n\nДля получения советов о том, как улучшить ваше взаимодействие с pacman и системой управления пакетами в целом, смотрите статью pacman/Советы и приёмы.\n\n"
    },
    {
      "title": "Репозитории",
      "level": 3,
      "content": "Для получения информации о назначении каждого официально поддерживаемого репозитория смотрите статью Официальные репозитории.\n\nЕсли вы планируете использовать 32-битные приложения, необходимо включить репозиторий multilib.\n\nВ статье Unofficial user repositories перечислены некоторые другие неподдерживаемые репозитории.\n\nРассмотрите возможность установки службы pkgstats.\n\n"
    },
    {
      "title": "Зеркала",
      "level": 3,
      "content": "Чтобы узнать, как получить максимальное преимущество от использования самых быстрых и актуальных зеркал официальных репозиториев, посетите страницу Зеркала. Как на ней объясняется, для получения списка недавно синхронизированных зеркал чрезвычайно хорошая идея — регулярно проверять страницу статуса зеркал. Это можно автоматизировать с помощью Reflector.\n\n"
    },
    {
      "title": "Система сборки для Arch (Arch Build System)",
      "level": 3,
      "content": "Порты — это система, изначально использовавшаяся в дистрибутивах BSD и состоящая из скриптов сборки, которые находятся в дереве каталогов локальной системы. Проще говоря, каждый порт содержит скрипт в каталоге с названием, соответствующим имени устанавливаемого стороннего приложения.\n\nСистема сборки Arch предлагает ту же функциональность, предоставляя скрипты сборки, называемые PKGBUILD и содержащие информацию о конкретном программном обеспечении: хэши для проверки целостности, URL-адрес проекта, версию, лицензию и инструкции по сборке. Эти файлы PKGBUILD использует makepkg — программа, генерирующая пакеты, которыми может управлять pacman.\n\nКаждый пакет в репозиториях, включая те, что представлены в AUR, можно пересобрать при помощи makepkg.\n\n"
    },
    {
      "title": "Arch User Repository",
      "level": 3,
      "content": "В то время как система сборки Arch даёт возможность сборки программ, доступных в официальных репозиториях, пользовательский репозиторий Arch (AUR) — их эквивалент для пакетов, предоставляемых пользователями. Это неподдерживаемый репозиторий, содержащий скрипты для сборки, доступные через веб-интерфейс или Aurweb RPC interface.\n\n"
    },
    {
      "title": "Загрузка",
      "level": 2,
      "content": "Данный раздел содержит информацию, относящуюся к процессу загрузки системы. Обзор особенностей процесса загрузки Arch можно найти в статье Процесс загрузки Arch. Дополнительная информация доступна в категории Процесс загрузки.\n\n"
    },
    {
      "title": "Автоопределение оборудования",
      "level": 3,
      "content": "По умолчанию оборудование определяется автоматически во время загрузки при помощи udev. Потенциально можно уменьшить время загрузки, отключив автозагрузку модулей и указав список необходимых модулей вручную, как описано в статье Модули ядра. Xorg также должен уметь автоматически определять требуемые драйверы при помощи udev, но у пользователей, опять же, есть возможность настроить X-сервер вручную.\n\n"
    },
    {
      "title": "Микрокод",
      "level": 3,
      "content": "Процессоры могут вести себя неправильно, но некоторые проблемы может исправить ядро путём обновления микрокода процессора во время загрузки системы. Для получения дополнительной информации смотрите статью Микрокод.\n\n"
    },
    {
      "title": "Сохранение загрузочных сообщений",
      "level": 3,
      "content": "После окончания процесса загрузки экран очищается и выводится приглашение на ввод имени пользователя, что не позволяет просмотреть сообщения процесса загрузки. Чтобы изменить такое поведение, отключите очистку загрузочных сообщений.\n\n"
    },
    {
      "title": "Включение Num Lock",
      "level": 3,
      "content": "Num Lock — клавиша переключения, которая присутствует на большинстве клавиатур. Для получения информации о том, как настроить автоматическое включение Num Lock при загрузке, смотрите статью Включение Numlock при загрузке системы.\n\n"
    },
    {
      "title": "Графический пользовательский интерфейс",
      "level": 2,
      "content": "В этом разделе представлена информация для пользователей, желающих запускать на своих системах графические приложения. Для получения дополнительной информации смотрите категорию Графический интерфейс пользователя.\n\n"
    },
    {
      "title": "Графический сервер",
      "level": 3,
      "content": "Xorg — это свободная реализация X Window System (называемой обычно X11 или X) с открытым исходным кодом. Она необходима для запуска приложений с графическим пользовательским интерфейсом (GUI), и большинство пользователей захочет её установить.\n\nWayland — новый, альтернативный протокол графического сервера. По сравнению с Xorg он более безопасен, более эффективен на современных видеокартах и находится в активной разработке, а Xwayland обеспечивает совместимость с приложениями X11. Есть несколько реализаций Wayland-композиторов, из которых вы можете выбрать подходящий композитор для себя.\n\n"
    },
    {
      "title": "Графические драйверы",
      "level": 3,
      "content": "Графический драйвер по умолчанию, modesetting, будет работать с большинством видеокарт, но можно повысить производительность и получить дополнительную функциональность, установив соответствующий драйвер для продукции AMD или NVIDIA.\n\n"
    },
    {
      "title": "Среды рабочего стола",
      "level": 3,
      "content": "Хотя графический сервер предоставляет основу для построения графического окружения, для полноценной работы могут понадобиться дополнительные компоненты. Среды рабочего стола, такие как KDE, GNOME, Xfce, Cinnamon, LXDE, собирают в единое целое большой набор интегрированных друг с другом приложений: оконный менеджер, панель, файловый менеджер, эмулятор терминала, текстовый редактор, значки и другие инструменты. Пользователи с небольшим опытом скорее всего захотят установить такую среду для получения более привычного интерфейса. Дополнительная информация доступна в статьях из категории Среды рабочего стола.\n\n"
    },
    {
      "title": "Оконные менеджеры или композиторы",
      "level": 3,
      "content": "Зрелая среда рабочего стола предоставляет завершённый и согласованный графический пользовательский интерфейс, но, как правило, потребляет значительное количество системных ресурсов. Пользователи, желающие получить максимальную производительность или упростить своё окружение, могут предпочесть установку автономного оконного менеджера или композитора и ручной выбор необходимых им дополнений. При использовании Xorg большинство сред рабочего стола позволяют выбрать альтернативный оконный менеджер. Динамические, стековые и фреймовые оконные менеджеры отличаются в том, как они управляют окнами.\n\n"
    },
    {
      "title": "Экранный менеджер",
      "level": 3,
      "content": "Большинство сред рабочего стола включает в свой состав экранный менеджер, автоматически запускающий графическое окружение и управляющий сеансами пользователей. Пользователи, не использующие среду рабочего стола, могут установить экранный менеджер отдельно. Можно и вовсе отказаться от его использования, выполняя автозапуск X при входе в систему.\n\n"
    },
    {
      "title": "Каталоги пользователя",
      "level": 3,
      "content": "Стандартные пользовательские каталоги, например, «Загрузки» или «Музыка», создаются пользовательской службой xdg-user-dirs-update.service, предоставляемой пакетом xdg-user-dirs и включённой по умолчанию при установке. Если ваша среда рабочего стола или оконный менеджер не загружают этот пакет автоматически, вы можете установить его вручную и выполнить xdg-user-dirs-update как описано в разделе XDG user directories (Русский)#Создание каталогов по умолчанию.\n\n"
    },
    {
      "title": "Управление питанием",
      "level": 2,
      "content": "Этот раздел может быть полезен владельцам ноутбуков и пользователям, ищущим способы управления питанием. Дополнительная информация доступна в категории Управление питанием.\n\nДля просмотра более полноценного обзора обратитесь к статье Управление питанием.\n\n"
    },
    {
      "title": "События ACPI",
      "level": 3,
      "content": "Пользователи могут настроить реакцию системы на события ACPI, такие как нажатие кнопки питания или закрытие крышки ноутбука. Информация о новом рекомендуемом методе с использованием systemd описана в разделе Управление питанием#События ACPI. Для просмотра информации о старом способе смотрите статью acpid (Русский).\n\n"
    },
    {
      "title": "Управление частотой процессора",
      "level": 3,
      "content": "Современные процессоры способны уменьшать рабочие частоту и напряжение для снижения температуры и количества потребляемой энергии. Меньшая температура ведёт к более тихой работе системы и увеличивает срок жизни оборудования. Для получения дополнительной информации смотрите статью Управление частотой процессора.\n\n"
    },
    {
      "title": "Ноутбуки",
      "level": 3,
      "content": "Для просмотра списка статей, относящихся к портативным компьютерам, в том числе руководств по установке на конкретные модели машин, смотрите категорию Ноутбуки. Для просмотра общего обзора статей и рекомендаций, относящихся к ноутбукам, обратитесь к статье Ноутбук.\n\n"
    },
    {
      "title": "Ждущий и спящий режимы",
      "level": 3,
      "content": "Смотрите статью Ждущий и спящий режимы.\n\n"
    },
    {
      "title": "Мультимедиа",
      "level": 2,
      "content": "Дополнительная информация содержится в категории Мультимедиа.\n\n"
    },
    {
      "title": "Звук",
      "level": 3,
      "content": "ALSA — это звуковая система ядра, которая должна работать «из коробки». Звуковые серверы, такие как PipeWire и PulseAudio, могут предложить дополнительные возможности и поддерживают более сложную конфигурацию звука.\n\nЕсли у вас есть особые требования, смотрите статью Профессиональное аудио.\n\n"
    },
    {
      "title": "Сеть",
      "level": 2,
      "content": "Информация в этом разделе ограничена небольшими процедурами по работе с сетью. Для просмотра подробного руководства обратитесь к статье Настройка сети. Для получения дополнительной информации смотрите категорию Сеть.\n\n"
    },
    {
      "title": "Безопасность DNS",
      "level": 3,
      "content": "Чтобы увеличить безопасность при просмотре веб-ресурсов, совершении online-платежей, подключении к службам SSH и подобных задачах, рекомендуется использовать DNS-преобразователь с поддержкой DNSSEC, который может проверять подписанные DNS-записи, а также криптографические протоколы, например, DNS over TLS, DNS over HTTPS или DNSCrypt. Смотрите статью Разрешение доменных имён для получения более подробной информации.\n\n"
    },
    {
      "title": "Настройка межсетевого экрана",
      "level": 3,
      "content": "Межсетевой экран (firewall) обеспечивает дополнительный уровень защиты поверх сетевого стека Linux. Стандартное ядро Arch содержит iptables от Netfilter и nftables, но по умолчанию они выключены. Пользователям настоятельно рекомендуется настроить какой-либо межсетевой экран. Для получения дополнительной информации смотрите категорию Межсетевые экраны.\n\n"
    },
    {
      "title": "Общий доступ",
      "level": 3,
      "content": "Для получения информации о том, как можно настроить обмен файлами между машинами внутри сети, смотрите статью NFS (Русский) или SSHFS (Русский).\n\nДля подключения к Windows-сети пользователи могут использовать Samba. Чтобы настроить вашу машину на присоединение к Active Directory и её использование для аутентификации, читайте статью Интеграция Active Directory.\n\nСмотрите также категорию Общий доступ.\n\n"
    },
    {
      "title": "Устройства ввода",
      "level": 2,
      "content": "В этом разделе содержатся советы по настройке популярных устройств ввода. Для получения дополнительной информации смотрите категорию Устройства ввода.\n\n"
    },
    {
      "title": "Раскладки клавиатуры",
      "level": 3,
      "content": "Не-английские и нестандартные клавиатуры по умолчанию могут работать не так, как ожидается. Необходимые шаги по настройке раскладки клавиатуры для виртуальной консоли и Xorg отличаются, и они описаны, соответственно, в статьях Конфигурация клавиатуры в консоли и Конфигурация клавиатуры в Xorg.\n\n"
    },
    {
      "title": "Кнопки мыши",
      "level": 3,
      "content": "Владельцы усовершенствованных или необычных мышей могут обнаружить, что по умолчанию распознаются не все кнопки, или могут захотеть изменить действия дополнительных кнопок. Соответствующие инструкции можно найти в статье Кнопки мыши.\n\n"
    },
    {
      "title": "Тачпады ноутбуков",
      "level": 3,
      "content": "Во многих ноутбуках используются указывающие устройства типа «тачпад» от Synaptics или ALPS. Для этих и некоторых других моделей тачпадов можно использовать драйвер Synaptics или libinput; смотрите статьи Touchpad Synaptics (Русский) и libinput для получения информации по их установке и настройке.\n\n"
    },
    {
      "title": "Тензометрические джойстики (TrackPoints)",
      "level": 3,
      "content": "Для настройки вашего тензометрического джойстика обратитесь к статье TrackPoint.\n\n"
    },
    {
      "title": "Оптимизация",
      "level": 2,
      "content": "Цель данного раздела — обобщить информацию о хитростях, инструментах и доступных опциях, полезных для увеличения производительности системы и приложений.\n\n"
    },
    {
      "title": "Бенчмаркинг",
      "level": 3,
      "content": "Бенчмаркинг — это действия по измерению производительности и сравнению результата либо с результатами других систем, либо с широко распространённым стандартом при помощи унифицированной процедуры.\n\n"
    },
    {
      "title": "Увеличение производительности",
      "level": 3,
      "content": "В статье Увеличение производительности излагаются основы, а также собрана информация об увеличении производительности в Arch Linux.\n\n"
    },
    {
      "title": "Твердотельные накопители (SSD)",
      "level": 3,
      "content": "В статье Твердотельные накопители описаны многие особенности SSD, в том числе и их настройка для увеличения срока службы, например, с помощью TRIM.\n\n"
    },
    {
      "title": "Системные службы",
      "level": 2,
      "content": "Информация в этом разделе относится к демонам.\n\n"
    },
    {
      "title": "Индексирование и поиск файлов",
      "level": 3,
      "content": "В большинстве дистрибутивов доступна команда locate, дающая возможность быстрого поиска файлов. Arch Linux предоставляет альтернативы; смотрите статью locate (Русский).\n\nПоисковые движки предоставляют похожую функциональность, при этом они лучше интегрированы в среды рабочего стола.\n\n"
    },
    {
      "title": "Локальная доставка почты",
      "level": 3,
      "content": "Стандартная установка не предоставляет каких-либо средств для синхронизации почты. Список почтовых агентов доступен в статье Mail server (англ.).\n\n"
    },
    {
      "title": "Печать",
      "level": 3,
      "content": "CUPS — это основанная на стандартах система печати с открытым исходным кодом, разработанная в OpenPrinting. Для просмотра списка статей, относящихся к конкретным принтерам, смотрите категорию Принтеры.\n\n"
    },
    {
      "title": "Внешний вид",
      "level": 2,
      "content": "В этом разделе содержатся часто искомые советы по улучшению внешнего вида для создания эстетически приятного интерфейса в Arch. Для получения дополнительной информации смотрите категорию Category:Eye candy (Русский).\n\n"
    },
    {
      "title": "Шрифты",
      "level": 3,
      "content": "Вы можете пожелать установить набор шрифтов TrueType, поскольку в базовую систему включены только немасштабируемые bitmap-шрифты. Существует несколько семейств шрифтов общего назначения с хорошим охватом символов Юникода и даже метрической совместимостью со шрифтами из других операционных систем.\n\nБольшое количество информации по данной теме можно найти в статьях Шрифты и Настройка шрифтов.\n\nЕсли вы проводите значительное количество времени в виртуальной консоли (то есть не в сеансе Xorg или Wayland), возможно, имеет смысл сменить шрифт для улучшения читаемости; смотрите раздел Консоль Linux#Шрифты.\n\n"
    },
    {
      "title": "Темы GTK и Qt",
      "level": 3,
      "content": "Огромное количество Linux-приложений с графическим интерфейсом основаны на тулкитах GTK и Qt. Для получения идей по улучшению внешнего вида установленных у вас программ и его настройке на ваш вкус смотрите соответствующие статьи, а также статью Единый вид приложений Qt и GTK.\n\n"
    },
    {
      "title": "Улучшения консоли",
      "level": 2,
      "content": "В этом разделе содержится информация о небольших изменениях, улучшающих работу консольных программ. Для получения дополнительной информации смотрите категорию Командные оболочки.\n\n"
    },
    {
      "title": "Улучшение дополнения команд клавишей Tab",
      "level": 3,
      "content": "Рекомендуется сразу корректно настроить расширенное дополнение команд клавишей Tab как описано в статье о вашей командной оболочке.\n\n"
    },
    {
      "title": "Псевдонимы",
      "level": 3,
      "content": "Создание псевдонима для команды или группы команд — это способ сохранения времени при использовании консоли. Это особенно полезно при решении часто повторяющихся задач, которым не требуется существенное изменение их параметров. В разделе Bash (Русский)#Псевдонимы можно найти общие псевдонимы для экономии времени, которые также легко портируются в zsh.\n\n"
    },
    {
      "title": "Альтернативные оболочки",
      "level": 3,
      "content": "Bash — это оболочка, устанавливаемая в систему Arch по умолчанию. Однако на установочном носителе используется zsh с дополнением grml-zsh-config. Для просмотра списка альтернативных оболочек обратитесь к разделу Командная оболочка#Список оболочек.\n\n"
    },
    {
      "title": "Дополнения для Bash",
      "level": 3,
      "content": "Список различных настроек Bash, поиск по истории и макрос Readline описаны в разделе Bash (Русский)#Советы и рекомендации.\n\n"
    },
    {
      "title": "Цветной вывод",
      "level": 3,
      "content": "Смотрите статью Color output in console (Русский).\n\n"
    },
    {
      "title": "Сжатые файлы",
      "level": 3,
      "content": "Сжатые файлы или архивы часто используются в системах GNU/Linux. Tar является одним из самых часто используемых инструментов архивации, поэтому пользователям следует ознакомиться с его синтаксисом (например, пакеты Arch Linux — это просто tar-архивы, сжатые с помощью zstd). Смотрите также статью Archiving and compression (Русский).\n\n"
    },
    {
      "title": "Приглашение командной строки",
      "level": 3,
      "content": "Приглашение командной строки (PS1) в значительной степени можно настроить под себя. Если вы используете Bash или Zsh, смотрите, соответственно, статью Bash/Настройка приглашения или раздел Zsh (Русский)#Настройка строки приглашения.\n\n"
    },
    {
      "title": "Оболочка Emacs",
      "level": 3,
      "content": "Emacs хорошо известен своими широкими возможностями, распространяющимися далеко за пределы обычного редактирования текста, благодаря чему может полностью заменить оболочку. Для решения проблем с искажением символов при цветном выводе обратитесь к разделу Emacs#Colored output issues.\n\n"
    },
    {
      "title": "Поддержка мыши",
      "level": 3,
      "content": "Использование мыши для копирования и вставки текста в консоли может быть более предпочтительным, чем использование традиционных методов GNU screen. Для получения точных инструкций обратитесь к статье General purpose mouse (Русский). Обратите внимание, что вы уже можете использовать мышь в эмуляторах терминала с поддержкой буфера обмена.\n\n"
    },
    {
      "title": "Управление сеансами",
      "level": 3,
      "content": "Терминальные мультиплексоры, такие как tmux или GNU Screen, позволяют запускать программы в отдельных сеансах, состоящих из вкладок и панелей. Эти сеансы можно по желанию отсоединить от терминала — это позволяет программам продолжить работу в фоновом режиме, когда пользователь закрывает эмулятор терминала или выходит из системы, пока активен сервер терминального мультиплексора. При этом для взаимодействия с программами потребуется переподключение к сеансу.\n\n"
    },
    {
      "title": "Инструменты командной строки POSIX",
      "level": 3,
      "content": "Многие стандартные пакеты уже устанавливают большинство популярных утилит POSIX в качестве зависимостей, но можно установить мета-пакет posix, чтобы гарантированно установить все утилиты.\n\nПомимо обязательных утилит, существуют также мета-пакеты для некоторых необязательных категорий:\n\n- posix-c-development\n- posix-software-development\n- posix-user-portability\n- posix-xsi\n\n"
    }
  ]
}