{
  "title": "General recommendations (Polski)",
  "url": "https://wiki.archlinux.org/title/General_recommendations_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Powiązane artykuły\n\n- Często zadawane pytania\n- Przewodnik Instalacyjny\n- Lista aplikacji\n\nTen dokument to zbiór popularnych artykułów i przydatnych informacji o dodawaniu funkcjonalności do zainstalowanego systemu Arch. Zakłada się, że czytelnicy przeczytali i wykonali instrukcje zawarte w Installation guide (Polski) i zainstalowali podstawowy system. Zaznajomienie się z informacjami zawartymi w #Administracja systemem i #Zarządzanie pakietami jest niezbędne do zrozumienia innych sekcji tej strony i pozostałych stron na Wiki.\n\n"
    },
    {
      "title": "Administracja systemem",
      "level": 2,
      "content": "Ta sekcja mówi o zadaniach administracyjnych i zarządzaniu systemem. Więcej informacji można znaleźć w Core utilities i Category:System administration.\n\n"
    },
    {
      "title": "Użytkownicy i grupy",
      "level": 3,
      "content": "Na nowej instalacji posiadasz tylko konto super-użytkownika, lepiej znanego jako \"root\". Logowanie się jako root przez dłuższy okres czasu, może nawet odsłanianie go przez SSH, jest niebezpieczne. Zamiast tego, powinieneś stworzyć i używać do większości zadań nieuprzywilejowanego konta użytkownika, a konta root tylko do administracji systemem. Zobacz Users and groups żeby uzyskać więcej informacji o tym, jak utworzyć i skonfigurować nowe konto użytkownika.\n\nGrupy i użytkownicy są mechanizmem kontroli dostępu; administratorzy mogą dostosować członkostwo i właściwości grup żeby przyznać lub odmówić użytkownikom i usługom dostępu do zasobów systemu. Przeczytaj Users and groups żeby uzyskać dodatkowe informacje dotyczące potencjalnych zagrożeń dla bezpieczeństwa.\n\n"
    },
    {
      "title": "Bezpieczeństwo",
      "level": 3,
      "content": "Przeczytaj Security, aby zapoznać się z zaleceniami i najlepszymi praktykami dotyczącymi wzmacniania systemu.\n\nLista aplikacji umożliwiających uruchamianie poleceń lub uruchamianie interaktywnej powłoki jako inny użytkownik (np. root) znajduje się w List of applications/Security#Privilege elevation.\n\n"
    },
    {
      "title": "Zarządzanie usługami",
      "level": 3,
      "content": "Arch Linux używa systemd jako procesu uruchamiającego. Jest on menadżerem systemu i usług dla Linuxa. Jeśli chcesz utrzymać swój system w dobrej kondycji, zalecane jest, aby poznać jego podstawy.\n\nInterakcje z systemd są wykonywane za pośrednictwem komendy systemctl. Więcej informacji można znaleźć w sekcji systemd#Basic systemctl usage.\n\nDostępny jest również system logów, dostępny za pomocą komendy journalctl. Więcej informacji można znaleźć w journal.\n\n"
    },
    {
      "title": "Bieżąca konserwacja systemu",
      "level": 3,
      "content": "Arch jest systemem o częstych aktualizacjach i zmianach w pakietach, więc użytkownicy muszą poświęcić trochę czasu na konserwację systemu, aby poprawić jego działanie i zwiększyć jego wydajność.\n\n"
    },
    {
      "title": "Zarządzanie pakietami",
      "level": 2,
      "content": "Ta sekcja zawiera pomocne informacje dotyczące zarządzania oprogramowaniem (pakietami). Odwiedź Frequently asked questions (Polski)#Zarządzanie pakietami i Category:Package management (Polski) aby dowiedzieć się więcej na ten temat.\n\nNote: **przed** \n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman jest menedżerem pakietów w Arch Linux. Zachęcamy do zapoznania się z nim przed przeczytaniem innych artykułów.\n\nAby włączyć równoległe pobieranie pakietów, zobacz pacman#Enabling parallel downloads.\n\nAby uzyskać informacje na temat długoterminowej obsługi pakietów w pamięci podręcznej, zobacz pacman#Cleaning the package cache.\n\nPrzeczytaj pacman/Tips and tricks aby zapoznać się ze wskazówkami, jak usprawnić użytkowanie pacmana i zarządzanie pakietami w ogólności.\n\n"
    },
    {
      "title": "Repozytoria",
      "level": 3,
      "content": "Zapoznaj się z działem o oficjalnych repozytoriach aby poznać szczegóły dotyczącego każdego z zarządzanych przez społeczność Arch repozytoriami.\n\nJeśli zainstalowałeś Arch Linux, ale masz zamiar używać aplikacji 32-bitowych, powinieneś włączyć repozytoria multilib.\n\nNieoficjalne repozytoria użytkowników zawierają listę innych repozytoriów nieoficjalnych, zarządzanych przez użytkowników.\n\n"
    },
    {
      "title": "Serwery lustrzane",
      "level": 3,
      "content": "Odwiedź stronę Mirrors, aby w pełni wykorzystać potencjał serwerów lustrzanych i skonfigurować je w ten sposób, aby używać tych najszybszych i najświeższych. Jak wyjaśniono w artykule, zalecane jest aby śledzić stronę Mirror Status lub Mirror-Status aby pozyskać listę serwerów, które zostały ostatnio zsynchronizowane. Można to zautomatyzować za pomocą Reflectora.\n\n"
    },
    {
      "title": "Arch Build System",
      "level": 3,
      "content": "Ports to system początkowo używany przez dystrybucje BSD, składający się ze skryptów kompilacji, które znajdują się w systemie lokalnym. Mówiąc najprościej, każdy port zawiera skrypt w katalogu intuicyjnie nazwanym na podstawie instalowalnej aplikacji.\n\nArch build system oferuje tę samą funkcjonalność, udostępniając skrypty budowania o nazwie PKGBUILD, które są zawierają informacje dotyczące danego oprogramowania; skróty integralności, adres URL projektu, wersję, licencje i instrukcje budowania. PKGBUILD są następnie analizowane przez makepkg, program generujący pakiety, którymi można łatwo zarządzać za pomocą pacmana.\n\nKażda paczka w repozytoriach wraz z tymi znajdującymi się w AUR podlega kompilacji za pomocą „makepkg”.\n\n"
    },
    {
      "title": "Arch User Repository",
      "level": 3,
      "content": "Podczas gdy drzewo ABS umożliwia tworzenie oprogramowania dostępnego w oficjalnych repozytoriach, Arch User Repository (AUR) jest odpowiednikiem pakietów udostępnianych przez użytkowników. Jest to nieoficjalne repozytorium skryptów kompilacji dostępnych przez interfejs sieciowy lub przez pomocnika AUR.\n\n"
    },
    {
      "title": "Uruchamianie",
      "level": 2,
      "content": "Ta sekcja zawiera informacje dotyczące procesu rozruchu. Przegląd procesu rozruchu Arch można znaleźć w Arch boot process. Aby uzyskać więcej informacji, zobacz Category: Boot process.\n\n"
    },
    {
      "title": "Automatyczne rozpoznawanie sprzętu",
      "level": 3,
      "content": "Sprzęt [domyślnie] powinien zostać automatyczne wykryty przez udev podczas procesu rozruchu. Poprawę czasu rozruchu można uzyskać wyłączając automatyczne ładowanie modułu i ręcznie określając wymagane moduły, jak opisano w Kernel module#Manual module handling. Ponadto Xorg powinien być w stanie automatycznie wykrywać wymagane sterowniki za pomocą udev, ale użytkownicy mogą również ręcznie skonfigurować serwer X.\n\n"
    },
    {
      "title": "Mikrokod",
      "level": 3,
      "content": "Procesory mogą zawierać wadliwy kod [1], który jądro może poprawić, aktualizując mikrokod (ang. microcode) przy uruchomieniu systemu. Procesory Intel wymagają osobnego pakietu do tego celu. Szczegółowe informacje można znaleźć w Microcode.\n\n"
    },
    {
      "title": "Ukrywanie komunikatów rozruchowych",
      "level": 3,
      "content": "Po zakończeniu rozruchu, komunikaty z rozruchu zostaną wyczyszczone i pojawi się monit z prośbą o zalogowanie, co uniemożliwi użytkownikom zbieranie informacji zwrotnych z procesu rozruchu. Zastosowanie wskazówek z artykułu Disable clearing of boot messages spowoduje pozostawienie informacji rozruchowych na ekranie.\n\n"
    },
    {
      "title": "Aktywacja Num Lock",
      "level": 3,
      "content": "Num Lock to klawisz przełączania występujący w większości klawiatur. Aby aktywować przypisanie klawiszy numerycznych podczas uruchamiania, zapoznaj się z Activating numlock on bootup.\n\n"
    },
    {
      "title": "Graficzny interfejs użytkownika",
      "level": 2,
      "content": "Ta sekcja zawiera wskazówki dla użytkowników, którzy chcą uruchamiać aplikacje graficzne w swoim systemie. Zobacz Category: X server, aby uzyskać dodatkowe informacje.\n\n"
    },
    {
      "title": "Serwer wyświetlania",
      "level": 3,
      "content": "Xorg to publiczna, otwarta implementacja X Window System (zwykle X11 lub X). Jest niezbędny do uruchamiania aplikacji z graficznym interfejsem użytkownika (GUI).\n\nWayland to nowszy, alternatywny protokół serwera wyświetlania z kilkoma kompozytorami do wyboru. Jego przewagą nad Xorgiem są ulepszone funkcje bezpieczeństwa, bardziej wydajna obsługa nowoczesnych zadań graficznych i aktywny rozwój przy jednoczesnym zachowaniu kompatybilności przez Xwayland.\n\n"
    },
    {
      "title": "Sterowniki graficzne",
      "level": 3,
      "content": "Domyślny sterownik ekranu modesetting będzie działał z większością kart graficznych, ale wydajność grafiki można znacznie poprawić i przede wszystkim wykorzystać wszystkie funkcje karty graficznej, instalując odpowiedni sterownik dla kart AMD, NVIDIA lub Intel.\n\n"
    },
    {
      "title": "Środowiska pulpitu",
      "level": 3,
      "content": "Chociaż serwer wyświetlania zapewnia podstawowe ramy dla tworzenia środowiska graficznego, dodatkowe komponenty mogą być uznane za niezbędne, aby użytkownik w poczuł się w pełni komfortowo ze swoim systemem. Środowiska pulpitu, takie jak KDE, GNOME, Xfce, Cinnamon i LXDE łączą w sobie szeroką gamę dobrze zintegrowanych aplikacji, takich jak menedżer okien lub kompozytor, panel/pasek zadań, menedżer plików, emulator terminala, edytor tekstu, ikony i inne narzędzia. Użytkownicy o mniejszym doświadczeniu mogą chcieć zainstalować środowisko pulpitu, aby uzyskać dostęp do popularnych narzędzi i ułatwić korzystanie z komputera. Zobacz Category:Desktop environments, aby uzyskać dodatkowe informacje.\n\n"
    },
    {
      "title": "Menedżery okien lub kompozytory",
      "level": 3,
      "content": "Rozwinięte środowisko pulpitu zapewnia pełny i spójny graficzny interfejs użytkownika, ale zwykle zużywa znaczną ilość zasobów systemowych. Użytkownicy, którzy chcą zmaksymalizować wydajność lub w inny sposób uprościć swój system, mogą zdecydować się na instalację menedżera okien lub kompozytora i dodatkowe narzędzia niezbędne do pracy z komputerem. Używając Xorg, większość środowisk pulpitu umożliwia także korzystanie z menedżera okien alternatywnego wobec tego domyślnie dostarczanego ze środowiskiem. Dynamiczne, nakładalne i kafelkowe menedżery okien różnią się w obsłudze rozmieszczenia okien.\n\n"
    },
    {
      "title": "Menedżer wyświetlania",
      "level": 3,
      "content": "Większość środowisk pulpitu zawiera menedżer wyświetlania do automatycznego uruchamiania środowiska graficznego i zarządzania logowaniami użytkowników. Użytkownicy nieposiadający środowiska graficznego mogą zainstalować je osobno. Możesz również bezpośrednio uruchomić serwer X co stanowi prostą alternatywę dla menedżera wyświetlania.\n\n"
    },
    {
      "title": "Zarządzanie energią",
      "level": 2,
      "content": "Ta sekcja może być przydatna dla właścicieli laptopów lub użytkowników szukających w inny sposób kontroli nad zarządzaniem energią. Aby uzyskać więcej informacji, zobacz Category:Power management.\n\nZobacz Power management, aby uzyskać więcej informacji.\n\n"
    },
    {
      "title": "Zdarzenia ACPI",
      "level": 3,
      "content": "Użytkownicy mogą skonfigurować sposób, w jaki system reaguje na zdarzenia ACPI, takie jak naciśnięcie przycisku zasilania lub zamknięcie pokrywy laptopa. Aby zapoznać się z zalecaną metodą zarządzania tymi zdarzeniami przy użyciu systemd, zobacz Power management#ACPI events. Aby zapoznać się ze starą metodą, zobacz acpid.\n\n"
    },
    {
      "title": "Skalowanie procesora",
      "level": 3,
      "content": "Nowoczesne procesory mogą zmniejszyć częstotliwość i napięcie w celu zmniejszenia zużycia ciepła i energii. Mniej ciepła prowadzi do cichszej pracy systemu i przedłuża żywotność sprzętu. Aby uzyskać szczegółowe informacje, zobacz stronę CPU frequency scaling.\n\n"
    },
    {
      "title": "Laptopy",
      "level": 3,
      "content": "Artykuły dotyczące komputerów przenośnych wraz z przewodnikami instalacji dla konkretnych modeli znajdują się w Category: Laptops. Aby uzyskać ogólny przegląd artykułów i zaleceń dotyczących laptopów, zobacz stronę Laptop.\n\n"
    },
    {
      "title": "Wstrzymanie i hibernacja",
      "level": 3,
      "content": "Zobacz główny artykuł: Suspend and hibernate.\n\n"
    },
    {
      "title": "Multimedia",
      "level": 2,
      "content": "Kategoria Multimedia zawiera dodatkowe informacje.\n\n"
    },
    {
      "title": "System dźwiękowy",
      "level": 3,
      "content": "ALSA to wbudowany w jądro system dźwiękowy, który powinien działać po instalacji (wystarczy odciszyć kanały). Serwery dźwięku takie jak PipeWire i PulseAudio mogą oferować dodatkowe funkcje i obsługiwać bardziej złożoną konfigurację audio.\n\nZobacz Professional audio dla zaawansowanych wymagań audio.\n\n"
    },
    {
      "title": "Sieć",
      "level": 2,
      "content": "Ta sekcja jest ograniczona do najprostszych ustawień sieciowych. Przejdź do Network configuration w celu uzyskania pełnej konfiguracji. Aby uzyskać więcej informacji, zobacz kategorię Category:Network.\n\n"
    },
    {
      "title": "Zabezpieczenia DNS",
      "level": 3,
      "content": "Aby zwiększyć bezpieczeństwo podczas przeglądania stron internetowych, płatności online, łączenia się z usługami SSH i podobnych zadań, rozważ użycie oprogramowania klienckiego DNSSEC, które może zatwierdzać podpisane rekordy DNS oraz DNSCrypt do szyfrowania ruchu DNS.\n\n"
    },
    {
      "title": "Konfigurowanie zapory sieciowej",
      "level": 3,
      "content": "Zapora sieciowa (ang. firewall) może zapewnić dodatkową ochronę sieci w systemie Linux. Chociaż standardowe jądro Arch jest w stanie używać Netfilter oraz iptables, rozwiązanie to nie jest domyślnie włączone. Zdecydowanie zaleca się skonfigurowanie jakiejś formy zapory sieciowej. Zapoznaj się ze stroną Firewalls, aby wyszukać dostępne przewodniki.\n\n"
    },
    {
      "title": "Udziały sieciowe",
      "level": 3,
      "content": "Aby udostępnić pliki między komputerami w sieci, postępuj zgodnie z artykułami dotyczącymi NFS lub SSHFS.\n\nUżyj Samba, aby dołączyć do sieci Windows. Aby skonfigurować urządzenie do korzystania z Active Directory, przeczytaj Active Directory integration.\n\nZobacz także Category:Network sharing.\n\n"
    },
    {
      "title": "Urządzenia wejściowe",
      "level": 2,
      "content": "Ta sekcja zawiera popularne wskazówki dotyczące konfiguracji urządzeń wejściowych takich jak myszka i klawiatura. Aby uzyskać więcej informacji, zobacz Category:Input devices.\n\n"
    },
    {
      "title": "Układy klawiatury",
      "level": 3,
      "content": "Klawiatury w języku innym niż angielski lub w inny sposób niestandardowe mogą nie działać domyślnie (tak jest z polskim układem klawiatury). Niezbędne kroki w celu skonfigurowania układu klawiszy są różne dla konsoli wirtualnej i Xorg. Skonfigurowanie polskiego układu klawiatury w konsoli zostało opisane w Przewodniku instalacyjnym. Więcej informacji na temat konfiguracji układu klawiatury w Xorg znajdziesz w: Keyboard configuration in Xorg.\n\n"
    },
    {
      "title": "Przyciski myszki",
      "level": 3,
      "content": "Może się okazać, że w bardziej zaawansowanych lub nietypowych myszkach, nie wszystkie przyciski działają prawidłowo. Przydatne instrukcje można znaleźć w All Mouse Buttons Working.\n\n"
    },
    {
      "title": "Płytki dotykowe (tzw. touchpady) w laptopach",
      "level": 3,
      "content": "Wiele laptopów korzysta z urządzeń wskazujących Synaptics lub ALPS zwanych płytkami dotykowymi (ang. touchpads). Niektóre płytki dotykowe używają sterownika wejściowego Synaptics (zob. Touchpad Synaptics).\n\n"
    },
    {
      "title": "Urządzenia typu TrackPoint",
      "level": 3,
      "content": "Zobacz artykuł TrackPoint, aby skonfigurować urządzenie typu TrackPoint.\n\n"
    },
    {
      "title": "Optymalizacja",
      "level": 2,
      "content": "Ta sekcja ma na celu podsumowanie poprawek, narzędzi i dostępnych opcji przydatnych w celu poprawy wydajności systemu i aplikacji.\n\n"
    },
    {
      "title": "Benchmarking",
      "level": 3,
      "content": "Benchmarking to czynność polegająca na mierzeniu wydajności i porównywaniu wyników z wynikami innych systemów z pomocą ujednoliconej procedury.\n\n"
    },
    {
      "title": "Zwiększanie wydajności",
      "level": 3,
      "content": "Artykuł Poprawianie wydajności zawiera podsumowanie informacje dotyczących wydajności systemu Arch Linux.\n\n"
    },
    {
      "title": "Dyski SSD",
      "level": 3,
      "content": "Artykuł Solid state drive zawiera informacje dotyczące dysków półprzewodnikowych (SSD), w tym dotyczące ich konfiguracji celem zwiększenia żywotności.\n\n"
    },
    {
      "title": "Usługi systemowe",
      "level": 2,
      "content": "Ta sekcja dotyczy tzw. demonów (ang. daemons).\n\n"
    },
    {
      "title": "Indeksowanie plików i wyszukiwanie",
      "level": 3,
      "content": "Większość dystrybucji udostępnia polecenie locate, które służy wyszukiwaniu plików w systemie. Arch Linux zapewnia kilka alternatyw, zobacz locate po szczegóły.\n\nWyszukiwarki desktopowe zapewniają podobne usługi, ale są lepiej zintegrowane z środowiskami graficznymi.\n\n"
    },
    {
      "title": "Poczta lokalna",
      "level": 3,
      "content": "Domyślna konfiguracja podstawowa nie zapewnia synchronizacji poczty. Lista agentów dostarczania poczty dostępna jest w artykule Mail server.\n\n"
    },
    {
      "title": "Drukowanie",
      "level": 3,
      "content": "CUPS to system drukowania open source opracowany przez OpenPrinting for Linux. Zobacz Category:Printers, aby zapoznać się z artykułami dotyczącymi konfiguracji drukarek.\n\n"
    },
    {
      "title": "Wygląd",
      "level": 2,
      "content": "Ta sekcja zawiera informacje o tzw. wodotryskach (ang. eye candy), czyli funkcjach poprawiających wrażenia estetyczne. Aby uzyskać więcej informacji, zobacz Category:Eye candy.\n\n"
    },
    {
      "title": "Czcionki",
      "level": 3,
      "content": "Możesz chcieć zainstalować zestaw czcionek TrueType, ponieważ tylko nieskalowalne czcionki bitmapowe są zawarte w podstawowym systemie Arch. Istnieje kilka ogólnych krojów czcionek zapewniających duże pokrycie Unicode, a nawet kompatybilność metryczną z czcionkami z innych systemów operacyjnych.\n\nWięcej informacji na ten temat można znaleźć w artykułach Fonts i Font configuration.\n\nJeśli spędzasz dużo czasu w wierszu poleceń (tj. bez uruchamiania serwera X), możesz zmienić czcionkę używaną w konsoli, aby zwiększyć czytelność tekstu. Zobacz stronę Linux console#Fonts.\n\n"
    },
    {
      "title": "Motywy GTK i Qt",
      "level": 3,
      "content": "Duża część aplikacji z interfejsem graficznym dla systemów Linux oparta jest na zestawach narzędzi GTK lub Qt. Zapoznaj się z artykułem Uniform look for Qt and GTK applications, aby znaleźć sposoby na poprawę wyglądu zainstalowanych programów i dostosowanie ich do własnych upodobań.\n\n"
    },
    {
      "title": "Ulepszenia konsoli",
      "level": 2,
      "content": "Ta sekcja dotyczy niewielkich modyfikacji, które ułatwiają korzystanie z konsoli. Aby uzyskać więcej informacji, zobacz Category:Command-line shells.\n\n"
    },
    {
      "title": "Ulepszenia auto-uzupełniania",
      "level": 3,
      "content": "Zaleca się prawidłowe skonfigurowanie rozszerzonego auto-uzupełniania od razu, zgodnie z instrukcjami w artykule wybranej powłoki.\n\n"
    },
    {
      "title": "Aliasy",
      "level": 3,
      "content": "Aliasowanie polecenia lub jego grupy to sposób na zaoszczędzenie czasu podczas korzystania z konsoli. Jest to szczególnie pomocne w przypadku powtarzających się zadań, które nie wymagają znaczącej zmiany parametrów. Typowe aliasy oszczędzające czas można znaleźć w Bash#Aliases. Można je łatwo przenosić również do zsh.\n\n"
    },
    {
      "title": "Alternatywne powłoki",
      "level": 3,
      "content": "Bash to powłoka instalowana domyślnie w systemie Arch. Nośnik instalacyjny używa jednak zsh z pakietem dodatkowym grml-zsh-config. Zobacz Command-line shell#List of shells, aby uzyskać więcej powłok.\n\n"
    },
    {
      "title": "Dodatki Bash",
      "level": 3,
      "content": "Lista różnych ustawień Bash, w tym ustawień autouzupełniania, wyszukiwania historii i makr Readline, jest dostępna w Bash#Tips and tricks.\n\n"
    },
    {
      "title": "Kolorowy tekst w konsoli",
      "level": 3,
      "content": "Zapoznaj się z działem Color output in console.\n\n"
    },
    {
      "title": "Pliki skompresowane i archiwa",
      "level": 3,
      "content": "Pliki skompresowane lub archiwa są często spotykane w systemie GNU/Linux. Tar jest jednym z najczęściej używanych narzędzi do archiwizacji, a użytkownicy powinni zapoznać się z jego składnią (pakiety Arch Linux, na przykład, są po prostu skompresowanymi - za pomocą zstd - tarballami). Zobacz Bash/Functions any uzyskać dodatkowe informacje.\n\n"
    },
    {
      "title": "Monit konsoli",
      "level": 3,
      "content": "Monit konsoli (PS1) można w dużym stopniu dostosować. Zobacz Bash/Prompt customization lub Zsh#Prompts, jeśli używasz odpowiednio Bash lub Zsh.\n\n"
    },
    {
      "title": "Emacs shell",
      "level": 3,
      "content": "Emacs jest znany z oferowania opcji wykraczających poza zwykłą edycję tekstu, jedną z nich jest zastąpienie powłoki wiersza poleceń. Skorzystaj z Emacs#Colored output issues, aby uzyskać pomoc w naprawieniu kolorów w Emacs, w związku z włączeniem kolorowych znaków w konsoli.\n\n"
    },
    {
      "title": "Obsługa myszy",
      "level": 3,
      "content": "Używanie myszy w konsoli np. do kopiowania i wklejania tekstu, może okazać się wygodniejsze niż tradycyjny tryb kopiowania w ekranie GNU. Szczegółowe instrukcje znajdują się w General purpose mouse.\n\n"
    },
    {
      "title": "Zarządzanie sesją",
      "level": 3,
      "content": "Używając multiplekserów terminali, takich jak tmux lub GNU Screen, programy można uruchamiać w sesjach składających się z kart i paneli, które można dowolnie odłączać, więc gdy użytkownik zakończy emulator terminala, zakończy serwer X lub wyloguje się, programy powiązane z sesją będą działały w tle, dopóki serwer terminali multiplekserów będzie aktywny. Interakcja z programami wymaga przelogowania.\n\n"
    }
  ]
}