{
  "title": "General purpose mouse (Português)",
  "url": "https://wiki.archlinux.org/title/General_purpose_mouse_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GPM, abreviação de General Purpose Mouse, é um daemon que fornece suporte a mouse para consoles virtuais do Linux.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote gpm. Para suporte a touchpad em um laptop, você também pode precisar instalar xf86-input-synaptics.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "O parâmetro -m precede a declaração do mouse a ser usado. O parâmetro -t precede o tipo de mouse. Para obter uma lista de tipos disponíveis para a opção -t, execute gpm com -t help.\n\n```\n# gpm -m /dev/input/mice -t help\n```\n\nO pacote gpm precisa ser iniciado com alguns parâmetros. Estes parâmetros podem ser registrados para criar o arquivo /etc/conf.d/gpm, ou usados ao executar o gpm diretamente. A partir de 2016, o arquivo gpm.service para systemd inclui os parâmetros para mouses USB.\n\n```\n/usr/lib/systemd/system/gpm.service\n```\n\n```\nExecStart=/usr/bin/gpm -m /dev/input/mice -t imps2\n```\n\nObviamente, deve ser editado, preferivelmente em uma forma amigável para o systemd, se houver outro tipo de mouse e o serviço for usado.\n\n- Para mouses PS/2, os parâmetros:\n\n```\n-m /dev/psaux -t ps2\n```\n\n- E trackpoints IBM precisam:\n\n```\n-m /dev/input/mice -t ps2\n```\n\nUma vez encontrada uma configuração adequada, inicie e habilite o gpm.service.\n\nPara mais informações, veja gpm(8).\n\n"
    },
    {
      "title": "QEMU ou VirtualBox",
      "level": 3,
      "content": "O mouse padrão emulado pelo QEMU e pelo VirtualBox tem sérios problemas tanto no gpm quanto no x com posicionamento e clique. A posição torna-se não sincronizada com o hospedeiro, portanto, há áreas que não podem ser passadas sem sair e entrar novamente na janela repetidamente. Clica em registrar em um local diferente do que o cursor estava mostrando.\n\nTanto o QEMU como o VirtualBox resolvem este problema fornecendo emulação para um tablet USB, o que dá um posicionamento absoluto. (libvirt usa isso automaticamente.)\n\nNo entanto, o gpm só sabe usar o mouse emulado no modo de posicionamento relativo, portanto, esses problemas permanecem. A tentativa de usar outros tipos por meio de -t não funciona corretamente.\n\ngpm-vmAUR inclui uma pull request de vários anos atrás para adicionar suporte ao tablet USB para o VirtualBox (que também funciona no QEMU) e modifica o gpm.service arquivo para usá-lo por padrão.\n\nVocê pode precisar alterar qual evento é usado. (Dando gpm o -m/dev/input/mice original não irá funcionar.) Por padrão:\n\n```\n/etc/gpm-vm.conf\n```\n\n```\nevent=\"/dev/input/event2\"\n```\n\nVocê pode determinar o evento a ser usado instalando evtest e executando:\n\n```\n# evtest\n```\n\n```\n...\n/dev/input/event2:      QEMU QEMU USB Tablet\n...\n```\n\nSe você precisar dar opções adicionais do gpm, você pode definir additional_args em /etc/gpm-vm.conf.\n\nUma vez encontrada uma configuração adequada, inicie e habilite o gpm.service.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Gentoo:GPM\n- consolationAUR Alternativa baseada no libinput\n\n"
    }
  ]
}