{
  "title": "General recommendations (Slovenščina)",
  "url": "https://wiki.archlinux.org/title/General_recommendations_(Sloven%C5%A1%C4%8Dina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Frequently asked questions (Slovenščina)\n- Installation guide (Slovenščina)\n- List of applications\n\nTa dokument je kazalo priljubljenih člankov in pomembnih informacij za izboljšanje in dodajanje funkcionalnosti nameščenemu sistemu Arch Linux, z nekaj dodane spremne besede. Predpostavlja se, da so bralci prebrali in upoštevali namestitveni priročnik za osnovno namestitev sistema Arch Linux. Prebrati in razumeti koncepte, razložene v #Upravljanje sistema in #Upravljanje paketov, je potrebno za spremljanje drugih delov te strani in drugih člankov na wikiju.\n\n"
    },
    {
      "title": "Upravljanje sistema",
      "level": 2,
      "content": "To poglavje obravnava administrativna opravila in upravljanje sistema. Za več glejte Core utilities in Category:System administration.\n\n"
    },
    {
      "title": "Uporabniki in skupine",
      "level": 3,
      "content": "Pri novi namestitvi imate na voljo samo t. i. \"superuser\" račun, bolje znan kot root. Večkratno ter dolgotrajno prijavljanje kot uporabnik root in morda celo dopuščanje prijave vanj preko SSH povezave je lahko nevarno. Namesto tega morate ustvariti in uporabljati neprivilegirane uporabniške račune za večino opravil, račun root pa uporabljati le za administracijo sistema. Za podrobnosti glejte Users and groups#User management.\n\nUporabniki in skupine so mehanizem za nadzor dostopa; administratorji lahko z dodeljevanjem ter odvzemanjem članstva skupinam uporabnikom dodelijo le tiste pravice, ki so zanj potrebne. Za podrobnosti in morebitna varnostna tveganja preberite članek Users and groups.\n\n"
    },
    {
      "title": "Varnost",
      "level": 3,
      "content": "Preberite Security za priporočila in najboljše prakse za okrepitev sistema.\n\nZa seznam aplikacij, ki omogočajo izvajanje ukazov ali zagon interaktivne lupine kot drug uporabnik (npr. root), glejte List of applications/Security#Privilege elevation.\n\n"
    },
    {
      "title": "Upravljanje storitev",
      "level": 3,
      "content": "Arch Linux uporablja systemd kot proces init, ki je upravitelj sistema in storitev za Linux. Za vzdrževanje namestitve Arch Linuxa je dobro vsaj laično znanje uporabe tega.\n\nInterakcija s systemd poteka z ukazom systemctl. Za več informacij glejte systemd#Basic systemctl usage.\n\nNa voljo je tudi sistem za beleženje z ukazom journalctl. Za več informacij glejte journal.\n\n"
    },
    {
      "title": "Vzdrževanje sistema",
      "level": 3,
      "content": "Arch je sistem s tekočimi izdajami in hitro menjavo paketov, zato si morajo uporabniki vzeti nekaj časa za vzdrževanje sistema.\n\n"
    },
    {
      "title": "Upravljanje paketov",
      "level": 2,
      "content": "To poglavje vsebuje koristne informacije, povezane z upravljanjem paketov. Za več informacij glejte FAQ#Package management in Category:Package management.\n\nNote: **pred** \n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman je package manager za Arch Linux: zelo priporočljivo je, da se z njim seznanite pred branjem drugih člankov.\n\nČe želite omogočiti vzporedno prenašanje paketov, glejte pacman#Enabling parallel downloads.\n\nGlejte pacman/Tips and tricks za predloge, kako izboljšati interakcijo s programom pacman in upravljanjem paketov na splošno.\n\n"
    },
    {
      "title": "Repozitoriji",
      "level": 3,
      "content": "Za podrobnosti o namenu vsakega uradno vzdrževanega repozitorija glejte članek Official repositories.\n\nČe nameravate uporabljati 32-bitne aplikacije, omogočite repozitorij multilib.\n\nV članku Unofficial user repositories je navedenih še več nepodprtih repozitorijev.\n\nRazmislite o namestitvi storitve pkgstats.\n\n"
    },
    {
      "title": "Zrcala",
      "level": 3,
      "content": "V članku Mirrors boste našli navodila, kako v celoti izkoristiti prednosti uporabe najhitrejših in najnovejših zrcalnih kopij uradnih repozitorijev. Kot je razloženo v članku, je še posebej pametno redno preverjati stran Mirror Status za seznam ogledal, ki so bila nedavno sinhronizirana. To je mogoče avtomatizirati s programom Reflector.\n\n"
    },
    {
      "title": "Arch Build System",
      "level": 3,
      "content": "Ports je sistem, ki so ga prvotno uporabljale distribucije BSD in je sestavljen iz skript za sestavljanje, ki se nahajajo v drevesu direktorijev na lokalnem sistemu. Preprosto povedano, vsak port vsebuje skripto v direktoriju, ki je intuitivno poimenovan po aplikaciji, ki jo je mogoče namestiti.\n\nSistem Arch build system ponuja enako funkcionalnost z zagotavljanjem skript za sestavljanje, imenovanih PKGBUILD, ki so napolnjene z informacijami za določeno programsko opremo: datoteke za preverjanje integritete, URL projekta, različico, licenco in navodili za sestavljanje. Te PKGBUILD-e uporablja makepkg, dejanski program, ki ustvarja pakete, ki jih je mogoče namestiti s programom pacman.\n\nVsak paket v repozitorijih skupaj s tistimi, ki so prisotni v AUR, je mogoče ponovno sestaviti s programom makepkg.\n\n"
    },
    {
      "title": "Uporabniški repozitorij Arch (AUR)",
      "level": 3,
      "content": "Medtem ko sistem Arch Build System omogoča gradnjo programske opreme, ki je na voljo v uradnih skladiščih, je Arch User Repository (AUR) ekvivalent za pakete, ki jih posredujejo uporabniki. To je neuraden repozitorij skript za sestavljanje, ki je dostopen prek spletnega vmesnika ali prek vmesnika Aurweb RPC.\n\n"
    },
    {
      "title": "Zagon",
      "level": 2,
      "content": "To poglavje vsebuje informacije, ki se nanašajo na postopek zagona. Pregled zagonskega postopka Arch najdete na Arch boot process. Za več informacij glejte Category:Boot process.\n\n"
    },
    {
      "title": "Samodejno prepoznavanje strojne opreme",
      "level": 3,
      "content": "Privzeto naj bi udev med postopkom zagona samodejno prepoznal strojno opremo. Potencialno izboljšanje zagonskega časa je mogoče doseči z onemogočanjem samodejnega nalaganja modulov in ročnim določanjem zahtevanih modulov, kot je opisano v Kernel modules. Poleg tega bi moral Xorg biti sposoben samodejno odkriti zahtevane gonilnike z uporabo udev, vendar imajo uporabniki možnost, da strežnik X konfigurirajo tudi ročno.\n\n"
    },
    {
      "title": "Mikrokoda",
      "level": 3,
      "content": "Procesorji se lahko obnašajo napačno, kar lahko jedro popravi s posodobitvijo mikrokode ob zagonu. Za podrobnosti glejte Microcode.\n\n"
    },
    {
      "title": "Ohranjanje zagonskih sporočil",
      "level": 3,
      "content": "Ko se prikaže poziv za prijavo, se sporočila ob zagonu izbrišejo, tako da uporabniki ne morejo pridobiti povratnih informacij o njih. Za odpravo te omejitve glejte Disable clearing of boot messages.\n\n"
    },
    {
      "title": "Aktivacija zaklepanja številk",
      "level": 3,
      "content": "Num Lock je preklopna tipka na večini tipkovnic. Za samodejno aktivacijo Num Lock ob zagonom glejte Activating numlock on bootup.\n\n"
    }
  ]
}