{
  "title": "Getting Involved (Русский)",
  "url": "https://wiki.archlinux.org/title/Getting_Involved_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Часто задаваемые вопросы\n- ArchWiki:Внесение вклада\n\nМутуализм в эволюционной биологии — отношения, в которых один организм платит небольшую цену, чтобы принести большую пользу кому-либо другому, одному или нескольким. Если таким вкладом в общее дело занимаются сразу несколько членов группы, польза для каждого из них возрастает многократно. Этот принцип можно применить и к активным членам сообщества Arch Linux, желающим внести свой вклад в развитие их любимого дистрибутива Linux. Такое участие приносит пользу не только членам нашего сообщества, но и всем сторонникам свободного и открытого программного обеспечения.\n\nЭта статья написана как для новичков, так и для опытных пользователей Arch Linux, желающих принести пользу, но это далеко не полный список возможностей. Пожалуйста, ознакомьтесь с кодексом поведения перед внесением вклада.\n\n"
    },
    {
      "title": "Общайтесь на форумах",
      "level": 3,
      "content": "Один из простейших способов поддержки — общение на официальном и/или русскоязычных форумах Arch Linux. Так вы сможете помочь новым пользователям и лучше узнать сообщество.\n\n"
    },
    {
      "title": "Улучшайте ArchWiki",
      "level": 3,
      "content": "ArchWiki — это документация по Arch Linux, поддерживаемая совместными усилиями наших пользователей. Всем пользователям предлагается внести свой вклад.\n\n"
    },
    {
      "title": "Присоединяйтесь к чатам",
      "level": 3,
      "content": "Вы можете помогать другим пользователям решать проблемы в IRC-канале. Однако очень важно сперва прочитать кодекс поведения. Для обсуждения отдельных тем существуют специальные IRC-каналы.\n\n"
    },
    {
      "title": "Подписывайтесь на списки рассылок",
      "level": 3,
      "content": "Присоединяйтесь к обсуждениям в публичных списках рассылок. Придерживайтесь темы, указанной в описании списка.\n\n"
    },
    {
      "title": "Художественные работы",
      "level": 3,
      "content": "Не стесняйтесь делиться с сообществом обоями, заставками, цветовыми палитрами, виджетами и темами оформления на форуме в разделе Artwork and Screenshots.\n\nСмотрите также Arch Linux Art и Artwork.\n\n"
    },
    {
      "title": "Сообщайте об установленных пакетах",
      "level": 3,
      "content": "pkgstats предоставляет таймер systemd, который отсылает список установленных пакетов, а также сведения об используемых архитектуре и зеркалах разработчикам Arch Linux. Это помогает им правильно расставлять приоритеты и делать дистрибутив ещё лучше. Пересылаемая информация анонимна и не может быть использована для вашей идентификации. Cобранная информация доступна на странице статистики. Больше информации доступно в этой ветке форума.\n\n"
    },
    {
      "title": "Сообщайте об ошибках и устраняйте их",
      "level": 3,
      "content": "Отчёты и исправление ошибок на баг-трекере — ещё один способ помочь сообществу.\n\nОднако его неправильное использование может быть контрпродуктивно. Пожалуйста, прочитайте сперва Указания по созданию отчета об ошибке.\n\n"
    },
    {
      "title": "Сообщайте о проблемах безопасности",
      "level": 3,
      "content": "Уязвимости находят всё время. Вы можете помочь Arch Security Team вести учёт новых уязвимостей.\n\n"
    },
    {
      "title": "Помогайте тестировать пакеты",
      "level": 3,
      "content": "Пакеты в тестовых репозиториях проверяются и подписываются перед добавлением в основные. Вы можете помочь Arch Testing Team тестировать новые пакеты.\n\n"
    },
    {
      "title": "Запрашивайте новые возможности",
      "level": 3,
      "content": "Запрашивайте возможности для пакетов Arch на баг-трекере. Перед этим прочитайте раздел Указания по созданию отчета об ошибке#Баг или фича? и убедитесь, что это корректный запрос новой возможности.\n\nДля пакетов AUR запрашивайте возможности на соответствующих страницах пакетов AUR.\n\n"
    },
    {
      "title": "Создавайте и поддерживайте пакеты в AUR",
      "level": 3,
      "content": "Пользовательский репозиторий Arch содержит скрипты пакетов, созданные сообществом, позволяя пользователям с лёгкостью устанавливать программное обеспечение, отсутствующее в официальных репозиториях. Популярные пакеты могут перейти в репозиторий extra.\n\naurphanAUR[ссылка недействительна: package not found] позволяет найти установленные в системе пакеты без сопроводителя, а вы можете заняться их поддержкой.\n\n"
    },
    {
      "title": "Становитесь сопровождающим пакетов",
      "level": 3,
      "content": "Если вы хотите помогать в поддержке AUR и пакетов в репозитории extra, вы можете попросить присвоить вам роль сопровождающего пакетов — смотрите Package Maintainers#How do I become a Package Maintainer?\n\n"
    },
    {
      "title": "События",
      "level": 2,
      "content": "Регулярно проводятся открытые для сообщества события, касающиеся исправления ошибок, очистки и других задач.\n\n- AUR Cleanup Day\n- Bug Day\n\n"
    },
    {
      "title": "Проекты программного обеспечения",
      "level": 2,
      "content": "Дистрибутив Arch Linux состоит из множества компонентов. Вносить вклад можно отдельно в каждый из этих проектов.\n\nОбсуждение различных проектов (если не указано иное) происходит в списке рассылки arch-projects и в IRC-канале #archlinux-projects.\n\nTable content:\nПроект | Описание | Языки | Сопровождающие | Ссылки\narch-boxes | Образы виртуальных машин | Bash | klausenbusk | баг-трекер, IRC #archlinux-releng, список рассылки arch-releng\narch-install-scripts | Полезные скрипты для установки Arch Linux | Bash | Foxboron | баг-трекер[устаревшая ссылка 2024-01-13 ⓘ]\narch-rebuild-order | Инструменты командной строки для определения порядка пересборки пакетов | Rust | jelle | баг-трекер\narch-release-promotion | Продвижение и синхронизация существующих релизов проекта в Arch Linux GitLab | Python | dvzrv | баг-трекер\narch-repro-status | Инструмент командной строки для запроса статуса воспроизводимости пакетов Arch Linux | Rust | orhun | баг-трекер\narch-security-tracker | Платформа отслеживания CVE security.archlinux.org и помощь в публикации рекомендаций по безопасности | Python (Flask) | anthraxx | баг-трекер, IRC #archlinux-security, список рассылки arch-security\narch-signoff | Подпись тестовых пакетов Arch Linux | Python | Jelle | баг-трекер\narchinstall | Официальный установщик Arch Linux | Python | Torxed | баг-трекер, Discord, документация\narchivetools | Готовое решение для создания снимка репозиториев пакетов Arch Linux, ISO-образов и boostrap-архивов | Bash |  | баг-трекер\narchiso | Скрипты и настройки для создания установочного образа | bash | dvzrv, nl6720 | баг-трекер, IRC #archlinux-releng, список рассылки arch-releng\narchlinux-common-style | Основные CSS-стили Arch Linux | SCSS, HTML, JavaScript | anthraxx, jelle | баг-трекер\narchlinux-docker | Образы Docker | Bash | hashworks, sangy | баг-трекер, docker hub, IRC #archlinux-releng, список рассылки arch-releng\narchlinux-keyring | Работа с PGP-ключами Arch Linux | Python | anthraxx, dvzrv | баг-трекер\narchlinux-repro | Инструменты для пересборки пакетов Arch Linux | Python | Foxboron, Jelle, Coderobe | баг-трекер\narchmanweb | Сайт man.archlinux.org | Python (Django) | Lahwaacz | баг-трекер\narchweb | Сайт archlinux.org | Python (Django) | jelle | баг-трекер\naurweb | Сайт aur.archlinux.org | Python, HTML, MySQL | artafinde, lfleischer | баг-трекер, IRC #archlinux-aurweb, список рассылки aur-dev\ndbscripts | Скрипты для выпуска и управления пакетами в репозиториях | Bash | Foxboron | баг-трекер\ndevtools | Инструменты для работы с пакетами | Bash | Anthraxx, Foxboron, jelle | баг-трекер\ngitlab-exporter | GitLab metrics exporter для Prometheus | Rust | Artafinde, orhun | баг-трекер\ngluebuddy | Демон-помощник, который следит за некоторыми аспектами инфраструктуры Arch Linux и проверяет выполнение определённых условий | Rust | anthraxx, jelle | баг-трекер\ninfrastructure | Инфраструктура Arch Linux | Ansible, Bash, Python, Packer, Terraform, Zsh | anthraxx, foutrelis, freswa, grazzolini, heftig, jelle, klausenbusk, svenstaro, artafinde | баг-трекер, IRC #archlinux-devops, список рассылки arch-devops\nkeycloak-archlinux-theme | Тема Arch Linux для Keycloak | Java | Artafinde | баг-трекер\nmkinitcpio | Генератор образов initramfs | Ash, Bash | grazzolini, Foxboron, nl6720 | баг-трекер\nmkinitcpio-archiso | Интеграция mkinitcpio для archiso | Ash, Bash | dvzrv, nl6720 | баг-трекер, IRC #archlinux-releng, список рассылки arch-releng\nnamcap | Инструмент для проверки бинарных пакетов и исходных PKGBUILD на наличие часто встречающихся ошибок упаковки | Python | alerque, dvzrv, FFY00, kgizdov | баг-трекер\nnetctl | Управление сетью systemd на основе профилей | Bash | jwitteveen | баг-трекер\nneoasknot | Страница про внесение вклада | JavaScript, Svelte | polyzen | баг-трекер, whatcanidofor.archlinux.org\npacman | Менеджер пакетов | Bash, C | Allan, agregory | баг-трекер, IRC #archlinux-pacman, список рассылки pacman-dev\npacman-contrib | Вспомогательные скрипты для pacman | Bash, C, Perl | Demize, Polyzen | баг-трекер, IRC #pacman-contrib, список рассылки pacman-contrib\npkgstats-cli | Клиент pkgstats | Go | pierres | баг-трекер, pkgstats.archlinux.de\npkgstats.archlinux.de | Сайт со статистикой пакетов Arch Linux | JavaScript, PHP, Vue | pierres | баг-трекер, pkgstats.archlinux.de\npyalpm | Python-биндинги к alpm | Python, C | Jelle | баг-трекер\npytest-pacman | Плагин pytest для генерации баз данных синхронизации репозиториев | Python | Jelle | баг-трекер\nrebuilderd-website | Сайт reproducible.archlinux.org | JavaScript | Jelle | баг-трекер, reproducible-builds.org, Debian wiki, IRC #archlinux-reproducible\nreleng | Автоматизация создания релизных артефактов (установочный образ, PXE) | Bash, Python | dvzrv | баг-трекер, IRC #archlinux-releng, список рассылки arch-releng\nrepod | Инструменты для управления репозиториями пакетов для дистрибутивов Linux, использующих менеджер пакетов pacman | Python | dvzrv | баг-трекер, документация\n\n"
    },
    {
      "title": "Сделайте пожертвование",
      "level": 2,
      "content": "Узнайте, как помочь покрыть расходы на содержание серверов, на официальной странице пожертвований Arch Linux.\n\n"
    },
    {
      "title": "Неофициальные проекты",
      "level": 2,
      "content": "Сообщество Arch Linux занимается многими проектами. Не стесняйтесь добавить свой!\n\n"
    },
    {
      "title": "Группы",
      "level": 3,
      "content": "Связанные с Arch Linux группы, в которые вы можете вступить.\n\n"
    },
    {
      "title": "Программы",
      "level": 3,
      "content": "Разработанное сообществом программное обеспечение, ориентированное на Arch Linux.\n\n"
    },
    {
      "title": "Как стать разработчиком Arch",
      "level": 2,
      "content": "Вашей главной мотивацией должно быть желание помочь сообществу, а не просто стать разработчиком Arch Linux во что бы то ни стало.\n\nОбычно новых разработчиков приглашают уже существующие, когда возрастает объём работы. Иногда они пишут о наличии свободного места и вы можете его занять, но гораздо чаще существующие разработчики просто приглашают кого-то, в ком уверены, что тот справится с поставленными задачами и хорошо впишется в работу команды. Портфолио вклада в проекты Arch Linux — лучший способ попасть в команду.\n\nВот краткий перечень того, что вы можете делать, чтобы достичь некоторой «популярности» среди разработчиков Arch Linux:\n\n- Создайте себе репутацию полезного человека, оказывая помощь, когда это возможно.\n- Отвечайте на вопросы на форумах, в IRC и списках рассылки.\n- Станьте сопровождающим пакетов и продемонстрируйте свои навыки работы с пакетами.\n- Публикуйте пакеты в AUR.\n- Присоединяйтесь к дополнительным проектам, которые когда-нибудь могут стать частью Arch Linux, или начните собственный проект.\n- Примите участие в разработке pacman, makepkg или других проектов Arch (на GitLab) и отправляйте патчи в баг-трекер.\n- Просматривайте баг-трекер и помогайте исправлять ошибки.\n- Находите новые ошибки и сообщайте о них.\n- Исправляйте ошибки в ArchWiki, добавляйте новые статьи, следите за уже существующими статьями и за актуальностью приводимых инструкций.\n- Помогайте с переводами.\n\n"
    }
  ]
}