{
  "title": "Getting Involved (Indonesia)",
  "url": "https://wiki.archlinux.org/title/Getting_Involved_(Indonesia)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **The translation of this article or section does not reflect the original text.** The translation of this article or section does not reflect the original text.\n\nThe translation of this article or section does not reflect the original text.\n\nRelated articles\n\n- Arch User Repository\n- Help:Editing\n\nDalam ilmu Biologi,simbiosis mutualisme adalah hubungan antar organisme yang saling memberikan manfaat/keuntungan.Prinsip ini juga dapat diaplikasikan untuk memotivasi dan mengajak anggota komunitas Arch Linux untuk ikut serta dan berkontribusi untuk distro GNU/Linux favoritnya. Keikutsertaan ini tidak hanya memberikan manfaat untuk anggota komunitas dan kepada Archer lainnya,tetapi juga kepada seluruh pengguna free and open source software\n\n"
    },
    {
      "title": "Bergabung dengan Forum Arch Linux",
      "level": 2,
      "content": "Salah satu cara termudah untuk berpatisipasi adalah dengan bergabung di Forum Arch Linux.Mulailah membaca etika berforum serta peraturan yang ada terlebih dahulu.Kemudian silahkan berbagi ide ataupun memberikan bantuan kepada orang lain seperti kepada pengguna baru.Jika terjadi pelanggaran diforum,silahkan laporkan kepada tim forum dengan cara mengklik tombol Report (dibagian bawah kanan post forum).\n\n"
    },
    {
      "title": "Berkontribusi untuk Arch Wiki",
      "level": 2,
      "content": "Wikis, by design, thrive on collaboration.\n\nArchWiki merupakan sebuah dokumentasi yang dibuat oleh komunitas dan ditujukan juga untuk komunitas.Para kontributor secara sukarela meluangkan waktu dan energi untuk berbagi pengetahuan serta skill dengan komunitas.Semua pengguna dipersilahkan untuk berkontribusi.Secara kasar,terdapat pembagian tugas di Archwiki yaitu:\n\n- Pemeliharaan teknis\n- Manajemen konten\n- Pengeditan konten\n- Membuat konten baru dan menterjemahkan konten yang sudah ada.\n\nJika Anda merasa sanggup untuk mengedit halaman wiki,silahkan perhatikan uraian tugas berikut :\n\n1. Tandai artikel dengan tanda status artikel yang benar.Contoh : {{Deletion}}/Penghapusan, {{Out of date}}/Kadaluarsa, {{Translateme}}/butuh diterjemahkan.\n1. Tambahkan konten ke stubs(Rintisan artikel) dan kembangkan artikel yang tidak lengkap serta perbaikan penulisan artikel yang jelek.\n1. Tambahkan atau tingkatkan kualitas terjemahan dari sebuah artikel dan pastikan semuanya tetap sinkron.\n1. Kurangi dan gabungkan artikel yang duplikat.\n1. Perbaiki ketidakakurattan atau artikel kadaluarsa serta gaya penulisan yang sesuai dengan EYD (ejaan yang disempurnakan).\n1. Kurangi jumlah kategori dengan cara menggabungkan kategori yang bermakna sama serta tingkatkan menu navigasi dari wiki.\n1. Mengkategorikan artikel yang tidak memiliki kategori..\n1. Tambahkan ringkasan artikel dibagian summary disemua artikel.\n1. Perbarui halaman FAQ dengan pertanyaan yang lebih relevan dari forum dan hapus pertanyaan yang kurang berguna lainnya.\n\nBerikut daftar halaman yang bisa Anda baca untuk melakukan pembersihan halaman :\n\n- Halaman permintaan/permohonan.\n- Pengarahan halaman yang rusak.\n- Pengarahan halaman yang berlebihan\n- Halaman singkat\n\nDalam jangka panjang,target yang harus dicapai adalah menjadikan Archwiki lebih profesional serta memiliki navigasi yang mudah,sehingga dokumenter dan petunjuk tambahan tidak diperlukan lagi.Semua ini adalah upaya komunitas yang tanpa pamrih,dan terkadang hal tersebut terasa membosankan.Jika Anda melakukan pekerjaan ini dengan serius,sebuah jabatan yang resmi sebagai pemelihara wiki akan menjadi tugas Anda.Hal ini membuat sebuah pekerjaan mempunyai tujuan yang diakui oleh orang.\n\n"
    },
    {
      "title": "Melaporkan Masalah",
      "level": 2,
      "content": "Membuka (dan menutup) laporan masalah di Arch Linux Bugtracker adalah salah satu cara untuk membantu dengan cara menolong komunitas melalui laporan masalah Anda.Bagaimanapun,penggunaan yang tidak efektif dari bug-tracker akan menimbulkan kontra-produktif dan menjadi sia-sia.Artikel ini akan memberikan Anda petunjuk untuk membantu komunitas secara efektif dengan cara melaporkan atau mencari masalah untuk diselesaikan.\n\n"
    },
    {
      "title": "Sekilas Tentang AUR",
      "level": 2,
      "content": "Arch User Repository adalah repositori yang dibawakan oleh komunitas menggunakan PKGBUILDs untuk pengguna Arch Linux.Paket yang terdapat di AUR dibuat menggunakan PKGBUILDs dan tidak mempunyai binari secara langsung ada seperti repositori resmi.Sehingga semua paket dari AUR akan dikompilasi secara manual disistem Arch Linux Anda untuk kemudian diinstall nantinya.AUR dibuat untuk mengontrol dan membagikan paket baru dari komunitas serta membuat sebuah paket lebih dikenal oleh semua pengguna sehingga dapat dimasukkan nanti ke dalam repositori [extra].\n\n"
    },
    {
      "title": "'Rolling Release' ezine",
      "level": 2,
      "content": "Berkontribusi di Rolling Release, enzine resmi Arch Linux. Publikasi berdasarkan masukan dari komunitas, berbasis web yang selalu mencari kontributor, seniman dan sejenisnya.\n\n"
    },
    {
      "title": "Proyek Komunitas",
      "level": 2,
      "content": "Arch Linux mempunyai komunitas untuk pengembangan perangkat lunak yang masih aktif dan sangat vital.Jika Anda mempunyai proyek dan ingin menghubungkannya,maka Anda sduah berada ditempat yang tepat.Masukkan link menuju proyek Anda,waktu Anda memulai proyek serta beberapa kalimat atau mungkin paragraf tentang proyek Anda.\n\nNote: **proyek resmi Arch Linux** \n\n"
    },
    {
      "title": "Lainnya",
      "level": 3,
      "content": "- Proyek Arch Hurd\n\n- Arch Linux Gaming Repository\n\n- Arch Quote Database\n\n- ArchServer Project\n\n"
    },
    {
      "title": "Anda sebagai Developer...",
      "level": 2,
      "content": "Entri ini dibuat berdasarkan sebuah trit dari sini yang berasal dari Forum Arch Linux.\n\nPertama,ingatlah motivasi Anda untuk berkontribusi di Arch,yaitu membantu komunitas,dan tidak berkeinginan untuk menjadi seorang \"Developer Arch Linux\" dengan maksud lain.Kedua,Anda juga menjadi bagian dari komunitas,dengan memberikan bantuan kepada orang lain berarti Anda sudah menolong diri Anda sendiri.\n\n"
    },
    {
      "title": "Apa yang bisa Saya lakukan?",
      "level": 3,
      "content": "Berikut adalah daftar yang secara khusus bisa diikuti agar Anda menjadi lebih bermanfaat bagi komunitas :\n\n- Buat nama baik Anda dengan memberikan bantuan sepenuh hati sebisa mungkin.\n- Jawablah pertanyaan yang ada di forum,IRC dan milis.\n- Bekerjasama dengan pengguna terpercaya dalam proses pembuatan paket Arch Linux guna meningkatkan pengalaman serta skill Anda.\n- Kirimkan paket hasil kerja Anda ke AUR.\n- Ikut serta dalam proyek kecil-kecilan yang mana suatu hari nanti,akan berguna untuk Arch Linux atau Anda bisa memulainya sendiri.\n- Mulailah bermain dengan Pacman,makepkg,initscripts atau kode sumber lainnya dan kirimkan perbaikan berupa patch ke bug tracker.\n- Jelajahi bug tracker dan ikut memperbaiki masalah yang sudah ada.\n- Cari,temukan dan kirimkan masalah baru yang muncul.\n- Perbaiki kesalahan di halaman wiki,tambahkan halaman baru,bersihkan halaman tak berguna yang masih ada dan pastikan semua prosedur selau terupdate.\n- Kirimkan hasil terjemahan Anda.\n\n"
    },
    {
      "title": "Bagaimana caranya untuk menjadi seorang Developer Arch?",
      "level": 3,
      "content": "Biasanya,developer baru adalah developer yang sudah ada sebelumnya sebagai penambah beban kerja.Terkadang mereka membutuhkan seseorang yang baru dan Anda bisa membuat permintaan agar bisa bergabung.Namun biasanya Mereka lebih suka mengajak orang yang sudah mereka kenal dekat dan cocok dengan pekerjaan dan tim.Mempunyai portofolio dari kontribusi terhadap Arch Linux adalah cara terbaik untuk bergabung didalam tim.\n\n"
    },
    {
      "title": "Anda mempunyai nilai seni...",
      "level": 2,
      "content": "Sangat dipersilahkan untuk membagikan hasil karya Anda berupa wallpaper,splash screen,color palettes,widget,tema dll dengan komunitas diforum.\n\nLihat juga: https://archlinux.org/art/\n\n"
    }
  ]
}