{
  "title": "Getting Involved (Español)",
  "url": "https://wiki.archlinux.org/title/Getting_Involved_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-06** \n\nArtículos relacionados\n\n- FAQ\n- ArchWiki:Contribuir\n\nEn biología evolutiva, la cooperación describe las interacciones donde un individuo que paga un pequeño coste produce un beneficio mayor para otro u otros. Si es correspondido, de esta contribución costosa pueden beneficiarse todos los involucrados enormemente. Este principio también se aplica a los miembros proactivos de la comunidad de Arch que quieran involucrarse y colaborar con su distribución de Linux preferida. Esta participación no solo beneficia a los miembros de la comunidad y sus compañeros Archers, sino también a todos los usuarios del software libre y de código abierto.\n\nEn este artículo se describe cómo los usuarios nuevos o experimentados en Arch, pueden contribuir a la comunidad. Tenga en cuenta que esto no es una lista exhaustiva. Antes de contribuir, por favor acostúmbrese al código de conducta.\n\n"
    },
    {
      "title": "Publicar en los foros",
      "level": 3,
      "content": "Una de las maneras más fáciles de colaborar es participando en los Foros de Arch Linux, que permiten conocer a la comunidad y ayudar a los nuevos usuarios.\n\n"
    },
    {
      "title": "Mejorar esta wiki",
      "level": 3,
      "content": "ArchWiki es una documentación sobre Arch Linux mantenido de forma colectiva. Se anima a todos los usuarios a colaborar.\n\n"
    },
    {
      "title": "Unirse a la sala de chat",
      "level": 3,
      "content": "Puede ayudar a otros usuarios a resolver problemas a través del canal IRC. Es muy importante, sin embargo, que lea las secciones dedicadas a las reglas de los canales antes de participar. Hay más canales disponibles para temas específicos.\n\n"
    },
    {
      "title": "Unirse a las listas de correo",
      "level": 3,
      "content": "Únase al debate en una o varias listas de correo públicas. Asegúrese de mantenerse en el tema como se proporciona en la descripción de la lista.\n\n"
    },
    {
      "title": "Trabajos artísticos",
      "level": 3,
      "content": "No dude en compartir fondos de pantalla, pantallas de presentación, paletas de colores, widgets, temas, etc. con la comunidad en el subforo de arte.\n\nVéase también Arte en Arch Linux.\n\n"
    },
    {
      "title": "Informar sobre los paquetes instalados",
      "level": 3,
      "content": "pkgstats proporciona un temporizador en systemd que envía una lista de los paquetes instalados en el sistema, junto con la arquitectura y los mirrors que se utilizan, a los desarrolladores de Arch Linux, con el fin de ayudarles a priorizar sus esfuerzos y mejorar la distribución. La información se envía de forma anónima y no puede ser utilizada para identificarle. Puede ver los datos recogidos en la página de estadísticas. Más información disponible en este hilo del foro.\n\n"
    },
    {
      "title": "Arreglar y reportar errores",
      "level": 3,
      "content": "Informar y corregir errores en el bug tracker es una de las posibles formas de ayudar a la comunidad.\n\nSin embargo, su uso ineficaz puede ser contraproducente. Para evitar esto, por favor, lea las directrices para informar de errores.\n\n"
    },
    {
      "title": "Informar sobre problemas de seguridad",
      "level": 3,
      "content": "Se encuentran nuevas vulnerabilidades todo el tiempo. Ayude al equipo de seguridad de Arch a realizar un seguimiento de las nuevas vulnerabilidades.\n\n"
    },
    {
      "title": "Ayudar a probar paquetes",
      "level": 3,
      "content": "Los paquetes en los repositorios de prueba deben probarse y firmarse antes de ser promovidos a los repositorios principales. Ayude al equipo de prueba de Arch a probar nuevos paquetes.\n\n"
    },
    {
      "title": "Crear y adoptar paquetes de AUR",
      "level": 3,
      "content": "El repositorio de usuario de Arch contiene los scripts de los paquetes realizados por la comunidad, permitiendo que los usuarios puedan instalar fácilmente programas que no son parte de los repositorios oficiales. Los paquetes más populares terminan incluyéndose en el repositorio extra.\n\naurphanAUR[enlace roto: package not found] puede ayudarle a identificar los paquetes huérfanos que utilice, para que pueda adoptarlos.\n\n"
    },
    {
      "title": "Convertirse en un usuario de confianza",
      "level": 3,
      "content": "Si desea ayudar a mantener AUR y los paquetes en el repositorio extra, puede solicitar convertirse en un usuario de confianza. Véase ¿Cómo me convierto en un TU? Para obtener más detalles.\n\n"
    },
    {
      "title": "Eventos",
      "level": 2,
      "content": "Regularmente hay eventos abiertos a la comunidad para la corrección de errores, la limpieza y otras actividades.\n\n- Bug Day\n- Día de la limpieza de AUR\n\n"
    },
    {
      "title": "Proyectos software",
      "level": 2,
      "content": "La distribución Arch Linux se compone de muchos componentes, como el gestor de paquetes pacman, el sitio web archlinux.org (archweb), o el sistema de soporte para el repositorio de usuario de Arch (aurweb). Cada uno de estos proyectos puede ser contribuido individualmente.\n\nVéase DeveloperWiki:Projects (Español) para obtener una descripción general de los miembros del equipo, los canales de comunicación y los lenguajes de programación utilizados. Los proyectos en sí están alojados con git en gitlab.archlinux.org.\n\n"
    },
    {
      "title": "Donar dinero",
      "level": 2,
      "content": "Puede encontrar la manera de ayudar a sostener los gastos del servidor en la ficha official Arch Linux donate page.\n\n"
    },
    {
      "title": "Proyectos no oficiales",
      "level": 2,
      "content": "La comunidad de Arch mantiene muchos proyectos. ¡Siéntase libre de incluir el tuyo!\n\n"
    },
    {
      "title": "Grupos",
      "level": 3,
      "content": "Grupos específicos de Arch en los que puede participar.\n\n"
    },
    {
      "title": "Convertirse en un desarrollador de Arch",
      "level": 2,
      "content": "La principal motivación para su trabajo en Arch debe ser ayudar a la comunidad en su conjunto, y no simplemente tratar de convertirse en un desarrollador de Arch por cualquier medio.\n\nPor lo general, los nuevos desarrolladores son elegidos por los desarrolladores existentes a medida que aumenta la carga de trabajo. A veces se publica un bando al que se puede responder para obtener el puesto, pero lo más normal es invitar a alguien que saben que será bueno en ello y que encajará con el resto del equipo. Las contribuciones a Arch son la mejor manera de hacerse un hueco en el equipo.\n\nHe aquí una lista de cosas que puede hacer para ganar un poco de \"notoriedad\" entre los desarrolladores de Arch:\n\n- Establecer una reputación de ser útil al ofrecer asistencia cuando sea posible.\n- Responder a las preguntas del foro, IRC y listas de correo.\n- Unirse a los usuarios de confianza para obtener experiencia compilando y mostrando sus habilidades.\n- Enviar paquetes a AUR.\n- Unirse a uno de los proyectos embrionarios que se pueden incorporar en su día a la corriente principal de Arch, o iniciar el suyo propio.\n- Trabajar con pacman, makepkg u otros proyectos de Arch y enviar parches al sistema de seguimiento de errores (bug tracker).\n- Recorrer el bug tracker y corregir los errores existentes.\n- Buscar y presentar nuevos errores.\n- Corregir errores de la wiki, añadir nuevas páginas, limpiar las páginas existentes y asegurarse de que los procedimientos estén al día.\n- Presentar traducciones.\n\n"
    }
  ]
}