{
  "title": "Getting involved (Polski)",
  "url": "https://wiki.archlinux.org/title/Getting_involved_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- FAQ\n- ArchWiki:Contributing\n\nW biologii ewolucyjnej współpraca opisuje interakcje, w których jednostka płaci niewielki koszt, aby przynieść większą korzyść jednej lub kilku innym osobom. Jeśli ten kosztowny wkład zostanie odwzajemniony, wszyscy zaangażowani mogą odnieść ogromne korzyści. Zasada ta odnosi się również do proaktywnych członków społeczności Arch, którzy chcą się zaangażować i wnieść swój wkład w swoją ulubioną dystrybucję Linuksa. Ich udział przynosi korzyści nie tylko członkom społeczności i ich kolegom Archerom, ale wszystkim użytkownikom wolne i otwarte oprogramowanie.\n\nTen artykuł opisuje, w jaki sposób zarówno nowi, jak i doświadczeni użytkownicy Arch mogą przyczynić się do rozwoju społeczności. Należy pamiętać, że nie jest to wyczerpująca lista. Zanim zaczniesz wnosić swój wkład, zapoznaj się z Kodeksem postępowania.\n\n"
    },
    {
      "title": "Publikuj na forach",
      "level": 3,
      "content": "Jednym z najprostszych sposobów na zaangażowanie się jest uczestnictwo w Forum Arch Linux, które pozwala poznać społeczność i pomóc nowym użytkownikom.\n\n"
    },
    {
      "title": "Udoskonalaj tę wiki",
      "level": 3,
      "content": "ArchWiki jest wspólnie utrzymywaną dokumentacją Arch Linux. Wszyscy użytkownicy są zachęcani do przyczyniania się.\n\n"
    },
    {
      "title": "Dołącz do czatu",
      "level": 3,
      "content": "Możesz pomagać innym użytkownikom w rozwiązywaniu problemów na kanał IRC. Bardzo ważne jest jednak, abyś zapoznał się z zasadami kanału przed wzięciem w nim udziału. Inne kanały są dostępne dla określonych tematów.\n\n"
    },
    {
      "title": "Dołącz do list mailingowych",
      "level": 3,
      "content": "Dołącz do dyskusji na jednej lub kilku publicznych listach dyskusyjnych [1]. Upewnij się, że nie odbiegasz od tematu podanego w opisie listy.\n\n"
    },
    {
      "title": "Grafika",
      "level": 3,
      "content": "Zachęcamy do dzielenia się tapetami, ekranami powitalnymi, paletami kolorów, widżetami, motywami itp. ze społecznością na podforum grafiki/sztuki.\n\nZobacz także Arch Linux Art i Artwork.\n\n"
    },
    {
      "title": "Zgłaszanie zainstalowanych pakietów",
      "level": 3,
      "content": "pkgstats zapewnia timer systemd, który wysyła listę pakietów zainstalowanych w systemie, wraz z architekturą i używanymi serwerami lustrzanymi, do programistów Arch Linux, aby pomóc im ustalić priorytety i uczynić dystrybucję jeszcze lepszą. Informacje są wysyłane anonimowo i nie mogą być wykorzystane do identyfikacji użytkownika. Zebrane dane można przeglądać na stronie statystyk. Więcej informacji można znaleźć na stronie w tym wątku na forum.\n\n"
    },
    {
      "title": "Naprawianie i zgłaszanie błędów",
      "level": 3,
      "content": "Zgłaszanie i naprawianie błędów dla pakietów Arch na GitLab jest jednym z możliwych sposobów pomocy społeczności.\n\nJednak nieefektywne użycie może przynieść efekt przeciwny do zamierzonego. Zapoznaj się z wytycznymi dotyczącymi zgłaszania błędów i informacje dot. próśb o scalenie pakietów..\n\n"
    },
    {
      "title": "Informowanie o kwestiach bezpieczeństwa",
      "level": 3,
      "content": "Cały czas odkrywane są nowe luki w zabezpieczeniach. Pomóż Arch Security Team śledzić nowe luki.\n\n"
    },
    {
      "title": "Pomoc w testowaniu pakietów",
      "level": 3,
      "content": "Pakiety znajdujące się w repozytoriach testowych muszą zostać wypróbowane i zatwierdzone, zanim trafią do repozytoriów głównych. Pomóż Arch Testing Team testować nowe pakiety.\n\n"
    },
    {
      "title": "Proponuj nowe funkcje",
      "level": 3,
      "content": "Proponuj funkcje dla pakietów Arch na GitLab. Zanim to zrobisz, przeczytaj Bug reporting guidelines#Bug or feature?, aby upewnić się, że jest to poprawne zgłoszenie funkcji, oraz General guidelines#Packaging merge requests.\n\nProponuj funkcje dla pakietów AUR na odpowiednich stronach pakietów AUR.\n\n"
    },
    {
      "title": "Tworzenie i przyjmowanie pakietów AUR",
      "level": 3,
      "content": "Repozytorium użytkowników Arch zawiera skrypty pakietów stworzone przez społeczność, pozwalając użytkownikom na łatwą instalację oprogramowania niebędącego częścią oficjalne repozytoria. Popularne pakiety są włączane do dodatkowego repozytorium.\n\n"
    },
    {
      "title": "Zostanie Opiekunem Pakietów",
      "level": 3,
      "content": "Jeśli chcesz pomóc w utrzymaniu AUR i pakietów w dodatkowym repozytorium możesz ubiegać się o status Opiekunem Pakietów. Zobacz Package Maintainers#How do I become a Package Maintainer?] po szczegóły.\n\n"
    },
    {
      "title": "Wydarzenia",
      "level": 2,
      "content": "Regularnie organizowane są wydarzenia otwarte dla społeczności, podczas których naprawiane są błędy, wykonywane prace porządkowe i inne aktywności.\n\n- AUR Cleanup Day\n- Bug Day\n\n"
    },
    {
      "title": "Projekty oprogramowania",
      "level": 2,
      "content": "Dystrybucja Arch Linux składa się z wielu komponentów, a każdy z projektów może być wspierany indywidualnie.\n\nDyskusja wokół różnych projektów (o ile nie zaznaczono inaczej) odbywa się na liście mailingowej arch-projects oraz na kanale IRC #archlinux-projects.\n\nTable content:\nProjekt | Opis | Języki | Opiekunowie | Dodatkowe linki\nalpm.rs | Powiązania Rust dla libalpm | Rust | Morganamilo | bugi\narch-boxes | Obrazy maszyn wirtualnych | Bash | klausenbusk | bugi, IRC #archlinux-releng, lista mailingowa arch-releng\narch-install-scripts | Przydatne skrypty do instalacji Arch Linux | Bash | Foxboron | bugi\narch-rebuild-order | Narzędzie CLI do określania kolejności przebudowy dostarczonych pakietów | Rust | jelle | bugi\narch-release-promotion | Promowanie i synchronizacja istniejących wydań projektu w instancji GitLab Arch Linuksa | Python | dvzrv | bugi\narch-repro-status | Narzędzie CLI do sprawdzania statusu odtwarzalności pakietów Arch Linux | Rust | orhun | bugi\narch-security-tracker | Platforma śledzenia CVE security.archlinux.org i pomoc w publikowaniu poradników. | Python (Flask) | anthraxx | bugi, IRC #archlinux-security, lista mailingowa Advisory\narch-signoff | Służy do zatwierdzania testowych paczek Arch Linux | Python | Jelle | bugi\narchinstall | Oficjalny instalator Arch Linux | Python | Torxed | bugi, Discord, dokumentacja\narchivetools | Gotowe rozwiązanie do tworzenia migawek repozytoriów pakietów Arch Linux, obrazów ISO i tarballi boostrap | Bash |  | bugi\narchiso | Skrypty i konfiguracja do tworzenia multimediów na żywo | bash | dvzrv, nl6720 | bugi, IRC #archlinux-releng, lista mailingowa arch-releng\narchlinux-common-style | Wspólne style CSS dla Arch Linux | SCSS, HTML, JavaScript | anthraxx, jelle | bugi\narchlinux-docker | Obrazy Docker | Bash | hashworks, sangy | bugi, hub docker, IRC #archlinux-releng, lista mailingowa arch-releng\narchlinux-keyring | Obsługa pęku kluczy PGP w Arch Linux | Python | anthraxx, dvzrv | bugi\narchlinux-repro | Narzędzia do odbudowy pakietów Arch Linux | Python | Foxboron, Jelle, Coderobe | bugi\narchmanweb | Strona man.archlinux.org | Python (Django) | Lahwaacz | bugi\narchweb | Strona archlinux.org | Python (Django) | jelle | bugi\naurweb | Strona i system dla aur.archlinux.org | Python, HTML, MySQL | artafinde, lfleischer | bugi, IRC #archlinux-aurweb, lista mailingowa aur-dev\nbugbuddy | Demon pomocniczy, który obserwuje przychodzące raporty o błędach dla Arch Linux i upewnia się, że właściwi ludzie są do nich przypisani. | Rust | anthraxx | bugi\ndbscripts | Skrypty do wydawania i zarządzania pakietami w repozytoriach | Bash | Foxboron | bugi\ndevtools | Narzędzia do pakowania dla deweloperów i twórców pakietów | Bash | Anthraxx, Foxboron, jelle, gromit | bugi\ngitlab-exporter | Eksporter metryk GitLab | Rust | Artafinde, orhun | bugi\ngluebuddy | Bezpieczny demon pomocniczy, który obserwuje kilka aspektów infrastruktury Arch Linux i upewnia się, że spełnione są określone warunki | Rust | anthraxx, jelle | bugi\ninfrastructure | Infrastruktura Arch Linux | Ansible, Bash, Python, Packer, Terraform, Zsh | anthraxx, foutrelis, freswa, grazzolini, heftig, jelle, klausenbusk, svenstaro, artafinde, gromit | bugi, IRC #archlinux-devops, lista mailingowa arch-devops\nkeycloak-archlinux-theme | Motyw Keycloak Arch Linux | Java | Artafinde | bugi\nmkinitcpio | Generator Initrd | Ash, Bash | grazzolini, Foxboron, nl6720 | bugi\nmkinitcpio-archiso | Integracja mkinitcpio dla archiso | Ash, Bash | dvzrv, nl6720 | bugi, IRC #archlinux-releng, lista mailingowa arch-releng\nnamcap | Narzędzie do sprawdzania pakietów binarnych i źródłowych PKGBUILD pod kątem typowych błędów pakowania. | Python | alerque, dvzrv, FFY00, kgizdov | bugi\nnetctl | Zarządzanie siecią systemd w oparciu o profile | Bash | jwitteveen | bugi\nneoasknot | Strona docelowa wkładu dla Arch Linux | JavaScript, Svelte | polyzen | bugi, whatcanidofor.archlinux.org\npacman | Menedżer pakietów | Bash, C | Allan, agregory | bugi, IRC #archlinux-pacman, lista mailingowa pacman-dev\npacman-contrib | Dodawanie skryptów do pacmana | Bash, C, Perl | Demize, Polyzen | bugi, IRC #pacman-contrib, lista mailingowa pacman-contrib\npkgstats-cli | klient pkgstats | Go | pierres | bugi, pkgstats.archlinux.de\npkgstats.archlinux.de | Strona statystyk pakietów Arch Linux | JavaScript, PHP, Vue | pierres | bugi, pkgstats.archlinux.de\npyalpm | Wiązania alpm dla Python | Python, C | Jelle | bugi\npytest-pacman | Wtyczka Pytest do generowania baz danych synchronizacji repozytorium | Python | Jelle | bugi\nrebuilderd-website | Strona dla reproducible.archlinux.org. | JavaScript | Jelle | bugi, reproducible-builds.org, Wiki Debiana, IRC #archlinux-reproducible\nreleng | Automatyzacja artefaktów wydania (nośnik instalacyjny, rozruch PXE) | Bash, Python | dvzrv | bugi, IRC #archlinux-releng, lista mailingowa arch-releng\nrepod | Narzędzia do utrzymywania repozytoriów pakietów binarnych dla dystrybucji Linuksa przy użyciu menedżera pakietów pacman | Python | dvzrv | bugi, dokumentacja\n\n"
    },
    {
      "title": "Darowizna pieniężna",
      "level": 2,
      "content": "Możesz dowiedzieć się, jak pomóc w utrzymaniu kosztów serwera na oficjalnej stronie darowizn Arch Linux.\n\n"
    },
    {
      "title": "Nieoficjalne projekty",
      "level": 2,
      "content": "Społeczność Arch prowadzi wiele projektów. Zachęcamy do dołączenia swojego!\n\n"
    },
    {
      "title": "Grupy",
      "level": 3,
      "content": "Grupy związane z Arch Linuxem, w które możesz się zaangażować.\n\n"
    },
    {
      "title": "Oprogramowanie",
      "level": 3,
      "content": "Oprogramowanie tworzone przez społeczność, które koncentruje się na Arch Linux.\n\n"
    },
    {
      "title": "Jak zostać Arch Developerem",
      "level": 2,
      "content": "Główną motywacją do pracy nad Arch powinna być pomoc całej społeczności, a nie tylko próba zostania deweloperem Arch.\n\nZazwyczaj nowi deweloperzy są wybierani przez istniejących deweloperów w miarę wzrostu obciążenia pracą. Czasami ogłaszają oni stanowisko i można ubiegać się o jego obsadzenie, ale częściej po prostu zapraszają kogoś, o kim wiedzą, że będzie w tym dobry i będzie dobrze pasował do reszty zespołu. Posiadanie portfolio wkładu Arch jest najlepszym sposobem na znalezienie się w zespole.\n\nOto lista rzeczy, które możesz zrobić, aby zyskać \"popularność\" wśród deweloperów Arch:\n\n- Zbudować reputację osoby pomocnej, oferując pomoc, gdy tylko jest to możliwe.\n- Odpowiadaj na pytania na forum, IRC i listach mailingowych.\n- Dołącz do Opiekunów Pakietów, aby zdobyć doświadczenie w tworzeniu pakietów i pokazać swoje umiejętności.\n- Przesyłaj pakiety do AUR.\n- Dołącz do jednego z odgałęzionych projektów, które pewnego dnia mogą zostać włączone do głównego nurtu Arch, lub rozpocznij własny.\n- Pracuj nad „pacman”, „makepkg” lub innym projektem (na GitLab) i przesyłaj poprawki do modułu śledzenia błędów.\n- Przejrzyj bug tracker i napraw istniejące błędy.\n- Znajduj i zgłaszaj nowe błędy.\n- Naprawiaj błędy wiki, dodawaj nowe strony, czyść istniejące strony i upewnianj się, że procedury są aktualne.\n- Twórz tłumaczenia.\n\n"
    }
  ]
}