{
  "title": "Getting involved (Français)",
  "url": "https://wiki.archlinux.org/title/Getting_involved_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- ArchWiki:Contributing\n- Frequently asked questions (Français)\n\nEn biologie évolutive, la coopération décrit des interactions où un individu paie un petit coût pour offrir un bénéfice plus important à un ou plusieurs autres. Si cette contribution coûteuse est réciproque, tous les participants peuvent en bénéficier énormément. Ce principe s'applique également aux membres proactifs de la communauté Arch souhaitant s'impliquer et contribuer à leur distribution Linux préférée. Leur participation bénéficie non seulement au membre de la communauté et à leurs camarades Archers, mais également à tous les utilisateurs de logiciels libres et open source.\n\nCet article décrit comment les nouveaux utilisateurs ainsi que les utilisateurs expérimentés d'Arch peuvent contribuer à la communauté. Notez qu'il ne s'agit pas d'une liste exhaustive. Avant de contribuer, veuillez vous familiariser avec le Code de conduite.\n\n"
    },
    {
      "title": "Poster sur les forums",
      "level": 3,
      "content": "L'une des façons les plus simples de s'impliquer est de participer aux Forums Arch Linux et au forum Arch Linux français, ce qui permet de connaître la communauté et d'aider les nouveaux utilisateurs.\n\n"
    },
    {
      "title": "Améliorer ce wiki",
      "level": 3,
      "content": "ArchWiki est une documentation Arch Linux maintenue de manière collaborative. Tous les utilisateurs sont encouragés à contribuer ou le traduire.\n\n"
    },
    {
      "title": "Rejoindre le salon de discussion",
      "level": 3,
      "content": "Vous pouvez aider d'autres utilisateurs à résoudre des problèmes sur les canaux IRC d'Arch et le canal français. Il est toutefois essentiel de lire les règles du canal avant de participer. D'autres canaux sont disponibles pour des sujets spécifiques.\n\n"
    },
    {
      "title": "Rejoindre les listes de diffusion",
      "level": 3,
      "content": "Participez aux discussions sur une ou plusieurs des listes de diffusion publiques. Assurez-vous de rester dans le sujet tel que décrit dans la description de la liste.\n\n"
    },
    {
      "title": "Œuvres artistiques",
      "level": 3,
      "content": "N'hésitez pas à partager des fonds d'écran, des écrans de démarrage, des palettes de couleurs, des widgets, des thèmes, etc. avec la communauté sur le sous-forum \"art\" ainsi que sur le forum francophone.\n\nVoir aussi Arch Linux Art et Artwork.\n\n"
    },
    {
      "title": "Détection des paquets installés",
      "level": 3,
      "content": "pkgstats fournit un timer pour systemd qui envoie une liste des paquets installés sur votre système, ainsi que l'architecture et les miroirs que vous utilisez, aux développeurs Arch Linux afin de les aider à prioriser leurs efforts et à améliorer la distribution. Les informations sont envoyées de manière anonyme et ne peuvent pas être utilisées pour vous identifier. Vous pouvez consulter les données collectées sur la Statistics page. Plus d'informations sont disponibles dans le forum.\n\n"
    },
    {
      "title": "Corriger et signaler les bugs",
      "level": 3,
      "content": "Rapporter et corriger les bugs des paquets Arch sur GitLab est l'une des façons possibles d'aider la communauté.\n\nCependant, une utilisation inefficace peut être contre-productive. Veuillez lire Bug reporting guidelines et General guidelines#Packaging merge requests.\n\n"
    },
    {
      "title": "Informer des problèmes de sécurité",
      "level": 3,
      "content": "De nouvelles vulnérabilités sont constamment découvertes. Aidez l'équipe Arch Security Team à suivre les nouvelles vulnérabilités.\n\n"
    },
    {
      "title": "Aider à tester les paquets",
      "level": 3,
      "content": "Les paquets des dépôts de test doivent être essayés et approuvés avant d'être promus dans les dépôts principaux. Aidez l'équipe des testeurs à tester les nouveaux paquets.\n\n"
    },
    {
      "title": "Demander des fonctionnalités",
      "level": 3,
      "content": "Demandez des fonctionnalités pour les paquets Arch sur GitLab. Avant de le faire, lisez Bug reporting guidelines#Bug or feature? pour vous assurer qu'il s'agit d'une demande de fonctionnalité valide, ainsi que General guidelines#Packaging merge requests.\n\nDemandez des fonctionnalités pour les paquets AUR sur les pages de paquets AUR correspondantes.\n\n"
    },
    {
      "title": "Créer et adopter des paquets AUR",
      "level": 3,
      "content": "Le dépôt des utilisateurs d'Arch (AUR) contient des scripts de paquets créés par la communauté, permettant aux utilisateurs d'installer facilement des logiciels qui ne font pas partie des dépots officiels. Les paquets populaires sont inclus dans le dépôt extra.\n\n"
    },
    {
      "title": "Devenir mainteneur de paquets",
      "level": 3,
      "content": "Note: **Cet article ou section a besoin d'être traduit(e).** Cet article ou section a besoin d'être traduit(e).\n\nCet article ou section a besoin d'être traduit(e).\n\nSi vous souhaitez aider à maintenir l'AUR et les paquets dans le dépôt extra, vous pouvez postuler pour devenir Mainteneur de paquets. Voir Comment devenir Mainteneur de paquets pour plus de détails.\n\n"
    },
    {
      "title": "Événements",
      "level": 2,
      "content": "Il y a des événements réguliers ouverts à la communauté pour la correction de bugs, le nettoyage et d'autres activités.\n\n- AUR Cleanup Day\n- Bug Day\n\n"
    },
    {
      "title": "Projets logiciels",
      "level": 2,
      "content": "La distribution Arch Linux comprend de nombreux composants et chacun des projets peut faire l'objet d'une contribution individuelle.\n\nLes discussions autour des différents projets (sauf indication contraire) ont lieu sur la liste arch-projects et dans le canal IRC #archlinux-projects.\n\nConsultez la page Getting involved#Software projects (en anglais) pour avoir la liste des projets.\n\n"
    },
    {
      "title": "Faire un don",
      "level": 2,
      "content": "Vous pouvez découvrir comment aider à couvrir les coûts des serveurs sur la page officielle de dons d'Arch Linux.\n\n"
    },
    {
      "title": "Projets non officiels",
      "level": 2,
      "content": "La communauté d'Arch maintient de nombreux projets. N'hésitez pas à inclure le vôtre !\n\n"
    },
    {
      "title": "Groupes",
      "level": 3,
      "content": "Groupes spécifiques à Arch auxquels vous pouvez participer.\n\n"
    },
    {
      "title": "Logiciels",
      "level": 3,
      "content": "Logiciels développés par la communauté qui se concentrent sur Arch Linux.\n\n"
    },
    {
      "title": "Devenir développeur Arch",
      "level": 2,
      "content": "La principale motivation pour votre travail sur Arch devrait être d'aider toute la communauté, et non simplement d'essayer de devenir un « développeur Arch » par tous les moyens.\n\nHabituellement, les nouveaux développeurs sont choisis par les développeurs existants à mesure que la charge de travail augmente. Parfois, ils publient un poste et vous pouvez postuler pour le remplir, mais plus souvent, ils invitent simplement quelqu'un qu'ils savent capable de bien faire le travail et qui s'intégrerait bien avec le reste de l'équipe. Avoir un portfolio de contributions à Arch est la meilleure façon d'intégrer l'équipe.\n\nVoici une liste de choses que vous pouvez faire pour gagner en « popularité » auprès des développeurs d'Arch :\n\n- Établissez une réputation d'être utile en offrant de l'aide chaque fois que possible.\n- Répondez aux questions sur le forum, IRC et les listes de diffusion.\n- Rejoignez les Mainteneurs de paquets pour acquérir de l'expérience en packaging et montrer vos compétences.\n- Soumettez des paquets à l'AUR.\n- Rejoignez l'un des projets dérivés qui pourraient être intégrés dans Arch principal un jour, ou démarrez le vôtre.\n- Travaillez sur « pacman », « makepkg » ou un autre projet (sur GitLab) et soumettez des correctifs au suivi des bugs.\n- Parcourez le suivi des bugs et corrigez les bugs existants.\n- Trouvez et soumettez de nouveaux bugs.\n- Corrigez les erreurs du wiki, ajoutez de nouvelles pages, nettoyez les pages existantes et assurez-vous que les procédures sont à jour.\n- Soumettez des traductions ou mettez les à jour.\n\n"
    }
  ]
}