{
  "title": "Getting and installing Arch (Русский)",
  "url": "https://wiki.archlinux.org/title/Getting_and_installing_Arch_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Этот документ является руководством по установке Arch Linux с помощью live-системы, загруженной из официального установочного образа. Данный образ включает в себя специальные возможности, описанные на странице Установка Arch Linux с использованием специальных возможностей. Также на странице Category:Installation process перечислены альтернативные методы установки.\n\nПеред установкой рекомендуется прочитать часто задаваемые вопросы. В тексте используются понятия, обозначения и стили, смысл которых описан на странице Help:Чтение. В частности, примеры кода могут содержать заполнители (отформатированные в курсиве), на месте которых необходимо вручную вписать нужные вам значения.\n\nДанное руководство состоит из кратко описанных шагов, которым рекомендуется следовать в указанном порядке. Более подробные инструкции приведены в соответствующих статьях ArchWiki и на страницах справочных руководств (man) различных программ. Ссылки и на то, и на другое присутствуют в этом руководстве. Также вы можете получить помощь в IRC-канале, на англоязычном форуме или в русскоязычных сообществах Arch Linux.\n\nArch Linux способен работать на любой x86_64-совместимой машине, имеющей хотя бы 512 МиБ ОЗУ, однако для загрузки live-системы нужно больше памяти.[1] Базовая установка занимает менее 2 ГиБ места на диске. Так как во время установки скачиваются пакеты из удалённого репозитория, необходимо работающее интернет-соединение.\n\n"
    },
    {
      "title": "Загрузка установочного образа",
      "level": 3,
      "content": "Перейдите на страницу загрузок и, в зависимости от желаемого способа загрузки live-системы, скачайте ISO-файл или netboot-образ, а также соответствующую подпись GnuPG.\n\n"
    },
    {
      "title": "Проверка подписи",
      "level": 3,
      "content": "Рекомендуется проверять подпись образа перед его использованием, особенно когда он был загружен с зеркала HTTP, где загрузки обычно подвержены перехвату для подмены образа на вредоносный.\n\nНа системах с установленным GnuPG вы можете сделать это, скачав ISO PGP signature (ссылка на него есть на странице загрузок в разделе Checksums) в каталог с образом и выполнив команду:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-версия-x86_64.iso.sig\n```\n\nТакже можно проверить подпись из установленного Arch Linux:\n\n```\n$ pacman-key -v archlinux-версия-x86_64.iso.sig\n```\n\n- Самой подписью можно манипулировать, если загрузить её с зеркала, а не с archlinux.org, как указано выше. В этом случае убедитесь, что открытый ключ, который используется для декодирования подписи, подписан другим надёжным ключом. Команда gpg выведет отпечаток (fingerprint) открытого ключа.\n- Ещё один метод проверки подлинности подписи — убедиться, что отпечаток открытого ключа идентичен отпечатку ключа разработчиков Arch Linux, которые подписали ISO-образ. Для получения дополнительной информации о процессе проверки подлинности открытых ключей смотрите статью Wikipedia:ru:Криптосистема с открытым ключом.\n\n"
    },
    {
      "title": "Подготовка установочного носителя",
      "level": 3,
      "content": "Загрузиться с ISO-образа на машине, на которой будет проводиться установка, можно с помощью USB-накопителя, оптического диска или сети (при помощи PXE) — инструкции для подготовки установочного носителя описаны в соответствующих статьях.\n\nПодготовка Netboot-образа описана в разделе Netboot#Boot from a USB flash drive.\n\n"
    },
    {
      "title": "Загрузка live-окружения",
      "level": 3,
      "content": "1. Загрузите компьютер с установочного носителя с Arch Linux. Для выбора загрузочного устройства обычно при включении компьютера нажимается специальная клавиша (иногда она указывается на заставке) во время фазы POST. Обратитесь к руководству вашей материнской платы для получения более подробных инструкций.\n1. Когда появится меню установочного носителя: если вы используете ISO-образ, выберите Arch Linux install medium и нажмите Enter для входа в установочное окружение; если вы используете Netboot-образ, выберите географически близкое к вам зеркало в меню Mirror, затем выберите Boot Arch Linux и нажмите Enter. Совет: ISO-образ использует systemd-boot при загрузке в UEFI-режиме и syslinux в BIOS-режиме. Используйте клавишу e или Tab для редактирования параметров загрузки. Netboot-образ использует iPXE, и указать параметры загрузки можно в меню Boot options. Список доступных параметров описан в README.bootparams. Распространённый пример ручной установки параметра загрузки — размер шрифта. Для улучшения читабельности на экране HiDPI (если он не распознался автоматически) может помочь добавление параметра fbcon=font:TER16x32. Смотрите раздел HiDPI (Русский)#Консоль Linux (tty) для более подробной информации.\n1. \n1. После загрузки вы попадёте в первую виртуальную консоль как пользователь root и увидите приглашение командной оболочки Zsh.\n\n- если вы используете ISO-образ, выберите Arch Linux install medium и нажмите Enter для входа в установочное окружение;\n- если вы используете Netboot-образ, выберите географически близкое к вам зеркало в меню Mirror, затем выберите Boot Arch Linux и нажмите Enter. Совет: ISO-образ использует systemd-boot при загрузке в UEFI-режиме и syslinux в BIOS-режиме. Используйте клавишу e или Tab для редактирования параметров загрузки. Netboot-образ использует iPXE, и указать параметры загрузки можно в меню Boot options. Список доступных параметров описан в README.bootparams. Распространённый пример ручной установки параметра загрузки — размер шрифта. Для улучшения читабельности на экране HiDPI (если он не распознался автоматически) может помочь добавление параметра fbcon=font:TER16x32. Смотрите раздел HiDPI (Русский)#Консоль Linux (tty) для более подробной информации.\n\n- ISO-образ использует systemd-boot при загрузке в UEFI-режиме и syslinux в BIOS-режиме. Используйте клавишу e или Tab для редактирования параметров загрузки. Netboot-образ использует iPXE, и указать параметры загрузки можно в меню Boot options. Список доступных параметров описан в README.bootparams.\n- Распространённый пример ручной установки параметра загрузки — размер шрифта. Для улучшения читабельности на экране HiDPI (если он не распознался автоматически) может помочь добавление параметра fbcon=font:TER16x32. Смотрите раздел HiDPI (Русский)#Консоль Linux (tty) для более подробной информации.\n\nЧтобы переключиться на другую виртуальную консоль в процессе установки (например, для просмотра этого руководства в Lynx), используйте горячие клавиши Alt+стрелка. Для редактирования файлов доступны программы mcedit(1), nano и vim. Список пакетов, присутствующих в установочном образе, доступен на странице pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Установка раскладки клавиатуры и шрифта",
      "level": 3,
      "content": "По умолчанию используется раскладка консоли US. Посмотреть список доступных раскладок можно с помощью команды:\n\n```\n# localectl list-keymaps\n```\n\nЧтобы выбрать раскладку, передайте её название команде loadkeys(1). Например, чтобы выбрать русскую раскладку, выполните команду:\n\n```\n# loadkeys ru\n```\n\nИспользуйте Ctrl+Shift для переключения между английской и русской раскладками.\n\nДля корректного отображения кириллицы нужно выбрать подходящий консольный шрифт. Консольные шрифты расположены в каталоге /usr/share/kbd/consolefonts/ и могут быть выбраны аналогичным способом с помощью команды setfont(8) без указания полного пути и расширения.\n\nНапример, для загрузки шрифта стандартного размера с русскими буквами выполните:\n\n```\n# setfont cyr-sun16\n```\n\nДля экрана HiDPI можно выбрать один из самых больших доступных шрифтов с русскими буквами:\n\n```\n# setfont ter-c32b\n```\n\n"
    },
    {
      "title": "Проверка режима загрузки",
      "level": 3,
      "content": "Чтобы проверить режим загрузки, проверьте разрядность UEFI:\n\n```\n# cat /sys/firmware/efi/fw_platform_size\n```\n\nЕсли команда выведет 64, то система загружена в режиме UEFI и имеет 64-битный x64 UEFI. Если команда выведет 32, то система загружена в режиме UEFI и имеет 32-битный IA32 UEFI — такой вариант тоже поддерживается, но в качестве загрузчика получится использовать только systemd-boot или GRUB. Если же такого файла не существует, возможно, система загружена в режиме BIOS (или CSM). Если система загрузилась не в том режиме, который вам нужен (UEFI или BIOS), обратитесь к руководству пользователя вашей материнской платы.\n\n"
    },
    {
      "title": "Соединение с интернетом",
      "level": 3,
      "content": "Для настройки сетевого соединения в live-окружении выполните следующие действия:\n\n- Убедитесь, что ваш сетевой интерфейс обнаружен и включён, например, с помощью ip-link(8): # ip link\n- Если планируется использовать Wi-Fi или WWAN, убедитесь, что беспроводная карта не заблокирована с помощью rfkill.\n- Подключитесь к сети: Ethernet: подключите кабель. Wi-Fi: подключитесь к беспроводной сети с помощью iwctl. Мобильный широкополосный модем: подключитесь к мобильной сети с помощью утилиты mmcli.\n- Настройте сетевые соединения: DHCP: установка динамического IP-адреса и адреса DNS-сервера (при помощи systemd-networkd и systemd-resolved) должна срабатывать автоматически для проводных и беспроводных сетевых интерфейсов. Статический IP: смотрите Настройка сети#Статический IP-адрес.\n- Соединение можно проверить с помощью утилиты ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernet: подключите кабель.\n- Wi-Fi: подключитесь к беспроводной сети с помощью iwctl.\n- Мобильный широкополосный модем: подключитесь к мобильной сети с помощью утилиты mmcli.\n\n- DHCP: установка динамического IP-адреса и адреса DNS-сервера (при помощи systemd-networkd и systemd-resolved) должна срабатывать автоматически для проводных и беспроводных сетевых интерфейсов.\n- Статический IP: смотрите Настройка сети#Статический IP-адрес.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Синхронизация системных часов",
      "level": 3,
      "content": "В live-окружении по умолчанию включен systemd-timesyncd, который выполнит синхронизацию времени автоматически после подключения интернета.\n\nЧтобы убедиться, что время синхронизировано, используйте timedatectl(1):\n\n```\n# timedatectl\n```\n\n"
    },
    {
      "title": "Разметка дисков",
      "level": 3,
      "content": "Когда запущенная система распознает накопители, они становятся доступны как блочные устройства, например, /dev/sda, /dev/nvme0n1 или /dev/mmcblk0. Чтобы посмотреть их список, используйте lsblk или fdisk.\n\n```\n# fdisk -l\n```\n\nРезультаты, оканчивающиеся на rom, loop и airootfs, можно игнорировать. Устройства mmcblk*, оканчивающиеся на rpbm, boot0 и boot1, тоже можно игнорировать.\n\nНа выбранном накопителе должны присутствовать следующие разделы:\n\n- Раздел для корневого каталога /.\n- Для загрузки в режиме UEFI также необходим системный раздел EFI.\n\nДля изменения таблицы разделов используйте инструмент разметки, например fdisk:\n\n```\n# fdisk /dev/диск_для_разметки\n```\n\n- Тщательно обдумайте схему разметки, чтобы в будущем не понадобилось менять её.\n- Если вы хотите создать составное блочное устройство для LVM, шифрования системы или RAID, сделайте это сейчас.\n- Если диск, с которого планируется загрузка системы, уже содержит системный раздел EFI — не создавайте новый раздел, а используйте существующий.\n- Подкачка может быть размещена в файле подкачки, если выбранная вами файловая система поддерживает его. Также можно не размещать подкачку на диске, а вместо этого настроить подкачку в zram после установки системы.\n\n"
    },
    {
      "title": "Примеры схем",
      "level": 4,
      "content": "Table content:\nТочка монтирования в установленной системе | Раздел | Тип раздела | Рекомендуемый размер\n/boot1 | /dev/системный_раздел_efi | Системный раздел EFI | 1 ГиБ\n[SWAP] | /dev/раздел_подкачки | Linux swap | Не менее 4 ГиБ\n/ | /dev/корневой_раздел | Linux x86-64 root (/) | Остаток, минимум 23–32 ГиБ\n\n1. Можно использовать другие точки монтирования, например /efi, если используемый загрузчик будет способен загрузить ядро и initramfs с корневого раздела. Смотрите соответствующее предупреждение в статье Процесс загрузки Arch#Загрузчик.\n\nTable content:\nТочка монтирования в установленной системе | Раздел | Тип раздела | Рекомендуемый размер\n[SWAP] | /dev/раздел_подкачки | Linux swap | Не менее 4 ГиБ\n/ | /dev/корневой_раздел | Linux | Остаток, минимум 23–32 ГиБ\n\nТакже смотрите Разметка дисков#Примеры схем.\n\n"
    },
    {
      "title": "Форматирование разделов",
      "level": 3,
      "content": "После создания разделов их нужно отформатировать в подходящую файловую систему. Для получения дополнительной информации смотрите раздел Файловые системы#Создание файловой системы.\n\nНапример, чтобы отформатировать /dev/корневой_раздел в файловую систему Ext4, выполните следующую команду:\n\n```\n# mkfs.ext4 /dev/корневой_раздел\n```\n\nЕсли вы создали раздел для подкачки (swap), инициализируйте его с помощью утилиты mkswap(8):\n\n```\n# mkswap /dev/раздел_подкачки\n```\n\nЕсли вы создали системный раздел EFI, отформатируйте его в FAT32 с помощью mkfs.fat(8).\n\n```\n# mkfs.fat -F 32 /dev/системный_раздел_efi\n```\n\n"
    },
    {
      "title": "Монтирование разделов",
      "level": 3,
      "content": "Смонтируйте корневой раздел в каталог /mnt. Например, если корневой раздел — /dev/корневой_раздел, выполните следующую команду:\n\n```\n# mount /dev/корневой_раздел /mnt\n```\n\nСоздайте точки монтирования в каталоге /mnt для всех остальных разделов (например, если точка монтирования раздела в установленной системе будет /boot, то создайте каталог /mnt/boot) и примонтируйте соответствующие разделы.\n\nДля UEFI примонтируйте системный раздел EFI:\n\n```\n# mount --mkdir /dev/системный_раздел_efi /mnt/boot\n```\n\nЕсли вы ранее создали раздел подкачки, активируйте его с помощью swapon(8):\n\n```\n# swapon /dev/раздел_подкачки\n```\n\nВ дальнейшем genfstab(8) обнаружит смонтированные файловые системы и пространство подкачки.\n\n"
    },
    {
      "title": "Выбор зеркал",
      "level": 3,
      "content": "Пакеты для установки будут скачиваться с серверов-зеркал, прописанных в файле /etc/pacman.d/mirrorlist. В установочном образе используется reflector, который после подключения к сети обновит список зеркал (выбрав 20 наиболее актуальных HTTPS-зеркал) и отсортирует их по скорости загрузки.\n\nЧем выше зеркало расположено в списке, тем больший приоритет оно имеет при скачивании пакета. Вы можете проверить этот файл и, при необходимости, отредактировать его вручную, переместив наверх наиболее географически близкие зеркала. При этом также учитывайте и другие критерии.\n\nПозже pacstrap скопирует этот файл в новую систему, так что это действительно стоит сделать.\n\n"
    },
    {
      "title": "Установка основных пакетов",
      "level": 3,
      "content": "Используйте скрипт pacstrap(8), чтобы установить пакет base, ядро Linux и прошивки часто встречающихся устройств:\n\n```\n# pacstrap -K /mnt base linux linux-firmware\n```\n\n- linux можно заменить на другой желаемый пакет ядра. Можно вообще не устанавливать ядро, если установка происходит в контейнере.\n- Можно пропустить установку пакета прошивок, если установка происходит в контейнере или виртуальной машине.\n\nПакет base содержит не все инструменты, имеющиеся на установочном носителе, из-за чего может потребоваться установка дополнительных пакетов для получения полностью функциональной базовой системы. Чтобы установить другие пакеты или группы, добавьте их названия к команде pacstrap (разделяя их пробелом) или используйте pacman во время этапа #Chroot. В частности, вам могут пригодиться:\n\n- обновления микрокода процессора — amd-ucode или intel-ucode — предоставляющие исправления ошибок и уязвимостей;\n- утилиты для управления файловыми системами в пользовательском пространстве, которые будут использоваться в системе, например, для их создания или для проверки на ошибки;\n- утилиты для работы с RAID или LVM, если они будут использоваться;\n- специфические прошивки других устройств, не включённые в linux-firmware (например, sof-firmware для некоторых звуковых карт, linux-firmware-marvell для беспроводных сетевых карт Marvell или прошивки для карт Broadcom);\n- ПО, необходимое для организации сети (например, сетевой менеджер или автономный DHCP-клиент, программу аутентификации для Wi-Fi, ModemManager для мобильного интернета);\n- консольный текстовый редактор (например, nano) для редактирования файлов настроек через консоль;\n- пакеты для доступа к документации в man и info: man-db, man-pages и texinfo.\n\nСписок пакетов, присутствующих в установочном образе, доступен на странице pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Сгенерируйте файл fstab (используйте ключ -U или -L, чтобы для идентификации разделов использовались UUID или метки, соответственно):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nПосле этого проверьте файл /mnt/etc/fstab и отредактируйте его в случае необходимости.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Перейдите к корневому каталогу новой системы:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Время",
      "level": 3,
      "content": "Задайте часовой пояс:\n\n```\n# ln -sf /usr/share/zoneinfo/Регион/Город /etc/localtime\n```\n\nЗапустите hwclock(8), чтобы сгенерировать /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nЭта команда предполагает, что аппаратные часы настроены в формате UTC. Для получения дополнительной информации смотрите раздел System time (Русский)#Стандарт времени.\n\nЧтобы предотвратить дрейф часов и обеспечить точность времени, настройте его синхронизацию с помощью клиента Network Time Protocol (NTP), например systemd-timesyncd.\n\n"
    },
    {
      "title": "Локализация",
      "level": 3,
      "content": "Отредактируйте файл /etc/locale.gen, раскомментировав en_US.UTF-8 UTF-8 и другие необходимые UTF-8 локали (например, ru_RU.UTF-8 UTF-8), после чего сгенерируйте их:\n\n```\n# locale-gen\n```\n\nСоздайте файл locale.conf(5) и задайте переменной LANG необходимое значение:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=ru_RU.UTF-8\n```\n\nЕсли вы меняли раскладку клавиатуры или шрифт, сделайте эти изменения постоянными, прописав их в файле vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=ru\nFONT=cyr-sun16\n```\n\n"
    },
    {
      "title": "Настройка сети",
      "level": 3,
      "content": "Создайте файл hostname:\n\n```\n/etc/hostname\n```\n\n```\nимявашегохоста\n```\n\nЗавершите настройку сети для вновь установленной среды. В частности, установите подходящее ПО для управления сетевым подключением, настройте его по необходимости и включите соответствующий юнит systemd, чтобы подключение к сети выполнялось сразу при загрузке системы.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Как правило, создание нового образа initramfs не требуется, поскольку pacstrap автоматически запускает mkinitcpio после установки пакета ядра.\n\nЕсли вы используете LVM, шифрование системы или RAID, отредактируйте файл mkinitcpio.conf(5) и пересоздайте образ initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Пароль суперпользователя",
      "level": 3,
      "content": "Установите пароль суперпользователя:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Загрузчик",
      "level": 3,
      "content": "Выберите и установите загрузчик с поддержкой Linux.\n\n"
    },
    {
      "title": "Перезагрузка",
      "level": 2,
      "content": "Выйдите из окружения chroot, набрав exit или нажав Ctrl+d.\n\nВы можете размонтировать все разделы с помощью команды umount -R /mnt, чтобы убедиться в том, что ни один из разделов не остался занят какой-либо программой. Если нужно, для поиска таких программ используйте fuser(1).\n\nТеперь перезагрузите компьютер, набрав reboot: если какие-нибудь разделы остались смонтированными, systemd их размонтирует. Не забудьте извлечь установочный носитель. После загрузки войдите в систему в качестве суперпользователя.\n\n"
    },
    {
      "title": "После установки",
      "level": 2,
      "content": "Дальнейшие указания по настройке системы после установки (например, создание аккаунта обычного пользователя, настройка графического интерфейса, звука или тачпада) описаны на странице Основные рекомендации.\n\nМножество интересных и полезных программ вы найдёте на странице Список приложений.\n\n"
    }
  ]
}