{
  "title": "Getting involved (Lietuvių)",
  "url": "https://wiki.archlinux.org/title/Getting_involved_(Lietuvi%C5%B3)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nEvoliucinėje biologijoje, bendradarbiavimas apibūdinamas kaip dviejų ar daugiau individų veikimas bendros geros labui. Šitas principas taikomas inicijuoti ir motyvuoti Arch bendruomenės narius, norinčius prisidėti ir padėti jų mėgstamai GNU/Linux distribucijai. Toks prisidėjimas naudingas ne tik bendruomenės nariui, bet ir kitiems draugams Archeriams kaip ir visiems nemokamos ir atviros programinės įrangos fanams.\n\nŠis straipsnis aprašo, kaip tiek nauji tiek patyrę Arch naudotojai gali pasidarbuoti bendruomenės labui. Tai nėra baigtinis sąrašas.\n\n"
    },
    {
      "title": "Oficialūs Arch Linux projektai",
      "level": 2,
      "content": "Susipažinkite su Code of conduct (Lietuviškai)\n\n"
    },
    {
      "title": "Rašykite forumuose",
      "level": 3,
      "content": "Vienas iš lengviausių būdų prisidėti yra dalyvauti tiek oficialiame Arch Linux forume, tiek lietuviškame Arch Linux forume. Čia galėsite tiek susipažinti su bendruomene, tiek padėti naujiems nariams.\n\n"
    },
    {
      "title": "Tobulinkite vikipediją",
      "level": 3,
      "content": "ArchWiki (Lietuviškai) yra bendruomenės palaikoma Arch Linux dokumentacija. Kviečiame visus prisidėti.\n\n"
    },
    {
      "title": "Prisijunkite prie IRC",
      "level": 3,
      "content": "Gali padėti kitiems naudotojams prisijungę prie IRC channel. Tačiau labai svarbu prieš dalyvaujant perskaityti kanalo taisykles. Specifinėms temoms yra daugiau kanalų\n\n"
    },
    {
      "title": "Praneškite apie įsidiegtus paketus",
      "level": 3,
      "content": "pkgstats turi systemd timer , kuris Arch Linux programuotojams siunčia jūsų sistemoje įdiegtų paketų sąrašą, kartu su architektūra ir nauojamais veidrožiais. Tai jiems padeda susidėioti prioritetus ir distribuciją padaryti dar geresne. Siunčiama informacija yra anoniminė ir jūsų identifikuoti negali. Surinktus duomenis galite pamatyti statistikos puslapyje. Daugiau informacijos galima rasti šioje forumo temoje.\n\n"
    },
    {
      "title": "Klaidų pranešimai ir jų taisymas",
      "level": 3,
      "content": "Pranešimas apie klaidas, bei jų taisymas Arch Linux klaidų seklyje yra vienas iš būdų padėti bendruomenei. Tačiau, neefektingas klaidų seklio naudojimas gali palaužti produktyvumą, vietoj to, kad būti naudingu. Šitas straipsnis padės kiekvienam kaip teisingai informuoti bendruomenę apie klaidą ir kaip aplamai gaudyti klaidas.\n\n"
    },
    {
      "title": "Informuokite apie saugumo problemas",
      "level": 3,
      "content": "Naujų pažeižiamumų randasi nuolatos. Padėkite Arch Security Team susekti naujas pažeidžiamas vietas.\n\n"
    },
    {
      "title": "Padėkite testuoti paketus",
      "level": 3,
      "content": "Testavimo saugyklose esantys paketai turi būti išbandyti ir pasirašyti, prieš jiems patenkant į pagrindinę saugyklą. Padėkite Arch Testing Team ištestuoti naujus paketus.\n\n"
    },
    {
      "title": "AUR paketų kūrimas ir perėmimas",
      "level": 3,
      "content": "Arch vartotojų saugykla yra bendruomenės valdoma PKGBUILD skriptų saugykla Arch vartotojams. Paketai AUR're yra statomi pasitelkiant į pagalbą PKGBUILD skriptus, kurie nėra pusiau sukompiliuoti binariniai paketai iš oficialios saugyklos. AUR buvo sukurtas organizuoti ir dalintis naujais paketais iš bendruomenės, taip pagreitinant populiarų paketų įtraukimą į extra saugyklą.\n\naurphanAUR[broken link: package not found] gali padėti surasti jūsų naudojamus apleistus paketus, kuriuos galėtumėte periimti savo globai.\n\n"
    },
    {
      "title": "Oficialūs programinės įrangos projektai",
      "level": 3,
      "content": "Oficialūs programinės įrangos projektai.\n\n"
    },
    {
      "title": "Aukokite pinigus",
      "level": 3,
      "content": "Kaip padėti išlaikyti serverius galite sužinoti oficialiame Arch Linux aukų puslapyje\n\n"
    },
    {
      "title": "Bendruomenės projektai",
      "level": 2,
      "content": "Arch bendruomenė palaiko daugybę projektų. Drąsiai pridėkite ir savo!\n\n"
    },
    {
      "title": "Grupės",
      "level": 3,
      "content": "Tikslinės Arch grupės prie kurių galima prisidėti.\n\n"
    },
    {
      "title": "Programinė Įranga",
      "level": 3,
      "content": "Bendruomenės kuriama programinė įranga, kurios dėmesys skirtas Arch Linux.\n\n"
    },
    {
      "title": "ArchWiki naršymas",
      "level": 3,
      "content": "Yra keletas skirtingų metodų apsilankyti ArchWiki.\n\n"
    },
    {
      "title": "Kaip galiu tapti Arch programuotoju?",
      "level": 3,
      "content": "Pirma, įsiminkite, kad pagrindinė jūsų darbo prie Arch motyvacija turėtų būti teikti pagalbą bendruomenei, o ne tiesiog būti Arch programuotoju.\n\nNauji programuotojai, jau esamų, dažniausiai parenkami, kai padidėja darbo krūvis. Kartais būna pranešama apie atsiradusią vietą, bet dažniausiai jie tiesiog pakviečia žmogų, kuris žinos ką daro ir pritiks esamoje komandoje. Įnašų į Arch porfolis griausias kelias papulti komandon.\n\nČia yra sąrašas, be jokios svarbumo tvarkos, kuriame yra išvardyti punktai, kaip galite būti naudingas bendruomenei:\n\n- Padėkite bendruomenei kai tik galite, taip užsitarnausite gerą vardą, kaip pagalbininkas.\n- Atsakinėkite į klausimus forume, IRC ir elektroniniu paštu.\n- Prisijunkite prie Trusted Users užsitarnaudami teisę prisijungti prie paketų kūrimo taip parodydami savo įgūdžius.\n- Skelbkite paketus AUR.\n- Prisijunkite prie kokio nors atšakinio projekto, kuris kada nors gal bus įtraukas į Arch, arba pradėkite savo.\n- Dirbkite prie pacman, makepkg, ar kitų Arch projektų ir skelbkite savo klaidų pataisymus į klaidų seklį.\n- Peržiūrėkite klaidų seklį ir taisykite klaidas.\n- Ieškokite ir skelbkite aptiktas klaidas.\n- Taisykite wiki klaidas, sukurkite naujus puslapius, tvarkykite esamus puslapius, ir įsitikinkite, kad viskas yra nepasenę.\n- Skelbkite savo vertimus.\n\n"
    },
    {
      "title": "Kaip tapti patikimu naudotoju",
      "level": 3,
      "content": "Skaitykite Package Maintainers#How do I become a Package Maintainer?.\n\n"
    },
    {
      "title": "Kaip menininkas..",
      "level": 2,
      "content": "Jauskitės laisvai dalindamiesi darbastaliais, ekrano užsklandom, spalvų paletėmis, valdikliais, temom, ir kt. forume.\n\nTaip pat žiūrėkite: Arch Linux Art\n\n"
    }
  ]
}