{
  "title": "Getting involved (Magyar)",
  "url": "https://wiki.archlinux.org/title/Getting_involved_(Magyar)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nRelated articles\n\n- FAQ\n- ArchWiki:Contributing\n\nAz evolúciós biológiában az együttműködés olyan interakciókat ír le, ahol az egyén kis költségeket fizet azért, hogy nagyobb hasznot hozzon egy valakinek vagy többieknek. Ha ezt a költséges hozzájárulást viszonozzák, akkor az minden érintett számára óriási haszonnal jár. Ez az elv azokra az Arch közösség proaktív tagjaira is vonatkozik, akik szeretnének bekapcsolódni és hozzájárulni kedvenc Linux disztribúciójukhoz. Részvételük nemcsak a közösség tagjainak és Arch közösségnek, hanem az ingyenes és nyílt forráskodú szoftverek összes felhasználójának is előnyös.\n\nEz a cikk leírja, hogy az új és a tapasztalt Arch felhasználók hogyan járulhatnak hozzá a közösséghez. Ne feledje, hogy ez nem teljes lista. Mielőtt hozzájárulna kérjük tanulmányozza át a magatartási kódexet.\n\n"
    },
    {
      "title": "Hozzászólás a fórumokon",
      "level": 3,
      "content": "A bekapcsolódás egyik legegyszerűbb módja az Arch Linux fórumokon való részvétel, amelyek lehetővé teszik a közösség megismerését és segítenek az új felhasználóknak.\n\n"
    },
    {
      "title": "Fejlesszd ezt a wikit",
      "level": 3,
      "content": "ArchWiki egy közösen karbantartott Arch Linux dokumentáció. Minden felhasználót biztatunk arra, hogy hozzájáruljon.\n\n"
    },
    {
      "title": "Csatlakozzon a csevegőszobához",
      "level": 3,
      "content": "Segíthet más felhasználóknak a IRC channel-eken is. Fontos azonban, hogy a részvétel előtt elolvassa a csevegőszoba szabályait. Emellett a további csatornák meghatározott témákhoz állnak rendelkezésre. Ezen csevegő szobákban használt nyelv az angol.\n\n"
    },
    {
      "title": "Csatlakozzon a levelezőlistákhoz",
      "level": 3,
      "content": "Csatlakozzon a vitákhoz.levelezőlista. Ügyeljen arra, hogy a lista leírásában leírtak szerint maradjon a témánál.\n\n"
    },
    {
      "title": "Alkotás",
      "level": 3,
      "content": "Bátran osszon meg háttérképeket, splash képernyőket, színpalettákat, widgeteket, témákat stb. alkotás alfórum.\n\nRészletekért lásd Arch Linux alkotást.\n\n"
    },
    {
      "title": "Jelentse be a telepített csomagokat",
      "level": 3,
      "content": "pkgstats által biztosított systemd timer elküldi a rendszeren telepített csomagok listáját, valamint a buildek és az általad használt tükrök listáját az Arch Linux fejlesztői számára annak érdekében, hogy segítsen nekik és még jobbá tegyék a disztribúciót. Az információt névtelenül küldjük el és nem használhatók fel azonosítására. Megtekintheti az összegyűjtött adatokat a Statisztikai oldalt. További információkért ezt a fórum szálat tekintsd meg.\n\n"
    },
    {
      "title": "Javitsd és jelentsd a hibákat",
      "level": 3,
      "content": "Jelentések és hibák rögzítése a hibakövetőben az egyik lehetséges módja annak, hogy segítsen a közösségnek.\n\nA nem megfelelő használata azonban megnehezíti a hiba beazonosítását és javítását. Kérjük, olvassa el a hibabejelentési irányelveket(Bug reporting guidelines).\n\n"
    },
    {
      "title": "Információ a biztonsági kérdésekről",
      "level": 3,
      "content": "Új biztonsági réseket folyamatosan találunk. Segítsen az Arch biztonsági csapatának(Arch Security Team) vagy kövesse nyomon az új sebezhetőségeket.\n\n"
    },
    {
      "title": "Segíts tesztelni a csomagokat",
      "level": 3,
      "content": "A teszt tárolók(repository) csomagjait ki kell próbálni és el kell fogadni, mielőtt előléptetnék őket a fő tárolókba. Segíts a Arch tesztelő csapatának az új csomagok tesztelésében.\n\n"
    },
    {
      "title": "Hozzon létre és tarts karban AUR csomagokat",
      "level": 3,
      "content": "Az Arch felhasználói tároló(Arch User Repository) közösség által készített csomagtelepítő scripteket tartalmaz, amelyek lehetővé teszik a felhasználók számára, hogy egyszerűen telepítsenek olyan programokat, amelyek nem részei a hivatalos tárolóknak(Official repositories). A népszerű csomagok az extra tárolónak(extra repository) részeivé válhanak.\n\n"
    },
    {
      "title": "Megbízható felhasználóvá válás feltételei",
      "level": 3,
      "content": "Ha segítesz karbantartani AUR és hivatalos tárolókat(community repository) akkor jelentkezhetsz megbizható felhasználónak(Trusted User). Lásd Package Maintainers#How do I become a Package Maintainer? a részletekért.\n\n"
    },
    {
      "title": "Események",
      "level": 2,
      "content": "Rendszeresen vannak olyan események, amelyek nyitottak a közösség számára mint a hibajavítások, tisztítások és egyéb tevékenységek.\n\n- Hiba nap(Bug Day)\n- AUR takarítás nap(AUR Cleanup Day)\n\n"
    },
    {
      "title": "Szoftver projektek",
      "level": 2,
      "content": "A Arch Linux számos komponensből áll, mint például a csomagkezelő pacman, a archlinux.org website (archweb), vagy a támogató rendszer mint a Arch User Repository (aurweb). Mindegyik projekt hozzájárulhat egyénileg.\n\nLásd DeveloperWiki:Projects a csapattagok, a kommunikációs csatornák és a használt programozási nyelvek áttekintéséhez. A projektek is ott érhetők el git itt gitlab.archlinux.org.\n\n"
    },
    {
      "title": "Adomány",
      "level": 2,
      "content": "Megtudhatja, hogyan segíthet a szerverköltségek fenntartásában a official Arch Linux donate page.\n\n"
    },
    {
      "title": "Nem hivatalos projektek",
      "level": 2,
      "content": "Arch közössége számos projektet tart fenn.\n\n"
    },
    {
      "title": "Csoportok",
      "level": 3,
      "content": "Arch linuxnak fentartott csoportok.\n\n"
    },
    {
      "title": "Arch fejlesztővé válik",
      "level": 2,
      "content": "Az Arch-on dolgozó munkájának fő motivációja, hogy segítenie kell az egész közösséget, és ez nem egyszerű az \"Arch fejlesztőnek\".\n\nÁltalában az új fejlesztőket a meglévő fejlesztők fogják felvenni, mivel a terhelés növekszik. Jelentkezni is lehet, de gyakrabban meghívnak valakit, akit tudnak, hogy jó lenne, és jól illeszkedne a csapat többi részéhez. Az Arch hozzájárulások portfóliója a legjobb módja annak, hogy a csapat tagja legyen.\n\nItt van néhány olyan dolog amivel segíthet az Arch fejlesztőinek:\n\n- Hozzon létre hírnevet azzal, hogy segítséget nyújt.\n- Válaszoljon a fórumon, az IRC-n és a levelezési listákon.\n- Csatlakozz a Trusted Users a csomagolási tapasztalat megszerzéséhez és a készségek megmutatása érdekében.\n- Küldj csomagokat az AUR-ba\n- Csatlakozzon az egyik projekthez, amely az Arch mainstream-be beépíthető, vagy elindíthatja a saját projektjét.\n- Dolgozz a pacman, makepkg vagy máson Arch projektek és küldje el a javításokat a hibakövetőbe.\n- Nézze át hibakövető rendszert és rögzítse a meglévő hibákat.\n- Új hibák keresése és benyújtása.\n- Javítsd a hibákat, új oldalak hozzáadása, meglévő oldalak tisztítása, és győződjön meg róla, hogy az eljárások naprakészek.\n- Fordítások benyújtása.\n\n"
    }
  ]
}