{
  "title": "Getty (Português)",
  "url": "https://wiki.archlinux.org/title/Getty_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Gerenciador de exibição\n\nO getty é o nome genérico de um programa que gerencia uma linha de terminal e seu terminal conectado. Seu objetivo é proteger o sistema de acessos não autorizados. Geralmente, cada processo de getty é iniciado por systemd e gerencia uma única linha de terminal.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "O agetty é o getty padrão no Arch Linux, como parte do pacote util-linux. Ele modifica as configurações de TTY enquanto espera por um login para que as novas linhas não sejam convertidas em CR-LFs. Isso tende a causar um \"efeito escada\" para mensagens impressas no console. Agetty gerencia consoles virtuais e seis desses consoles virtuais são fornecidos por padrão no Arch Linux. Eles geralmente são acessíveis pressionando Ctrl+Alt+F1 até Ctrl+Alt+F6.\n\nAs alternativas incluem:\n\n- mingetty — Um getty mínimo que permite logins automáticos.\n\n- fbgetty — Um console getty como o mingetty, que suporta framebuffers.\n\n- mgetty — Um programa versátil para lidar com todos os aspectos de um modem no Unix.\n\n"
    },
    {
      "title": "Adicionar outros consoles virtuais",
      "level": 2,
      "content": "Abra o arquivo /etc/systemd/logind.conf e defina a opção NAutoVTs=6 para o número de terminais virtuais que você deseja na inicialização.\n\nSe você deseja iniciar um temporariamente, você pode iniciar um serviço getty no TTY desejado digitando:\n\n```\n$ systemctl start getty@ttyN.service\n```\n\n"
    },
    {
      "title": "Login automático no console virtual",
      "level": 2,
      "content": "A configuração depende do editando units fornecidas para substituir os parâmetros padrão passados para agetty.\n\nA configuração difere para consoles virtuais e seriais. Na maioria dos casos, você deseja configurar o login automático em um console virtual, (cujo nome do dispositivo é ttyN, Onde N é o número). A configuração do login automático para consoles seriais será um pouco diferente. Os nomes dos dispositivos dos consoles seriais parecem ttySN, onde N é o número.\n\n"
    },
    {
      "title": "Console virtual",
      "level": 3,
      "content": "Edite manualmente, criando o seguinte snippet drop-in ou executando systemctl edit getty@tty1 e colando seu conteúdo:\n\n```\n/etc/systemd/system/getty@tty1.service.d/override.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=-/usr/bin/agetty --autologin username --noclear %I $TERM\n```\n\nSe você não deseja login totalmente automático, mas também não deseja digitar seu nome de usuário, você pode substituir --autologin username com --skip-login --login-options username.\n\nSe você quiser usar um tty outro que não seja tty1, veja systemd FAQ (EN).\n\n"
    },
    {
      "title": "Console serial",
      "level": 3,
      "content": "Crie o seguinte arquivo (e diretórios principais):\n\n```\n/etc/systemd/system/serial-getty@ttyS0.service.d/autologin.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=-/usr/bin/agetty --autologin username -s %I 115200,38400,9600 vt102\n```\n\n"
    },
    {
      "title": "Console Nspawn",
      "level": 3,
      "content": "Para configurar o login automático para systemd-nspawn (EN) container, substituir console-getty.service:\n\n```\n/etc/systemd/system/console-getty.service.d/override.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=-/sbin/agetty --noclear --autologin username --keep-baud console 115200,38400,9600 $TERM\n```\n\nSe machinectl login my-container método é usado para acessar o contêiner, também adicionar --autologin username ao container-getty@.service modelo que gerencia pts/[0-9]:\n\n```\n/etc/systemd/system/container-getty@.service.d/override.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=-/sbin/agetty --noclear --autologin username --keep-baud pts/%I 115200,38400,9600 $TERM\n```\n\n"
    },
    {
      "title": "Solicita apenas a senha de um usuário padrão no login do console virtual",
      "level": 2,
      "content": "Getty pode ser usado para fazer o login a partir de um console virtual com um usuário padrão, digitando a senha, mas sem a necessidade de inserir o nome de usuário. Por exemplo, para solicitar a senha para username em tty1:\n\n```\n/etc/systemd/system/getty@tty1.service.d/override.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=-/sbin/agetty -n -o username %I\n```\n\ne depois\n\n```\n# systemctl enable getty@tty1\n```\n\n"
    },
    {
      "title": "Mantenha as mensagens de inicialização em tty1",
      "level": 2,
      "content": "Por padrão, Arch tem o getty@tty1 serviço habilitado. O arquivo de serviço já passa --noclear, que impede o agetty de limpar a tela. Contudo o systemd limpa a tela antes de iniciá-lo. Para desativar esse comportamento, crie /etc/systemd/system/getty@tty1.service.d/noclear.conf:\n\n```\n/etc/systemd/system/getty@tty1.service.d/noclear.conf\n```\n\n```\n[Service]\nTTYVTDisallocate=no\n```\n\nIsso substitui apenas TTYVTDisallocate para agetty em TTY1, e deixa o arquivo de serviço global /usr/lib/systemd/system/getty@.service intocado. Veja Editando units fornecidas.\n\n- Certifique-se de remover o quiet do kernel parameters.\n- O início tardio do KMS pode fazer com que as primeiras mensagens de inicialização sejam apagadas. Veja KMS#Early KMS start or KMS#Disabling modesetting.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Alterar target padrão para inicializar\n- O TTY desmistificado (EN)\n- Wikipedia:Tty (unix)\n\n"
    }
  ]
}