{
  "title": "Getting involved (Português)",
  "url": "https://wiki.archlinux.org/title/Getting_involved_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- ArchWiki:Contribuindo\n- Frequently asked questions\n\nNa biologia, o mutualismo é uma interação entre dois organismos onde ambos tem benefícios. Este princípio se aplica aos membros proativos da comunidade Arch, que desejam contribuir e se envolver com o projeto em prol de sua distribuição Linux favorita. Esta participação beneficia não apenas membros da comunidade e seguidores do Arch, mas também, toda a gama dos usuários de software livre e de código aberto.\n\nEste artigo descreve como usuários novos e experientes do Arch podem contribuir para a comunidade. Note que não é uma lista exaustiva. Antes de contribuir, por favor esteja familiarizado com o Código de conduta.\n\n"
    },
    {
      "title": "Postagens nos fóruns",
      "level": 3,
      "content": "Uma das formas mais fáceis de participar e se envolver com o projeto é através dos Fóruns do Arch Linux, que permitem a interação e ajuda de membros da comunidade com novos usuários.\n\n"
    },
    {
      "title": "Melhore esta wiki",
      "level": 3,
      "content": "A ArchWiki é uma documentação do Arch Linux mantida colaborativamente. Todos os usuários são incentivados a contribuir.\n\n"
    },
    {
      "title": "Entre nas salas de chat",
      "level": 3,
      "content": "Você pode ajudar outros usuários a resolver problemas através do canal do IRC. É de suma importância que você leia as regras do canal antes de participar. Canais especiais estão disponíveis para tópicos específicos.\n\n"
    },
    {
      "title": "Entre nas listas de discussão",
      "level": 3,
      "content": "Participe da discussão em uma ou mais listas de discussão públicas. Certifique-se de se manter dentro do assunto conforme fornecido na descrição da lista.\n\n"
    },
    {
      "title": "Obra de arte",
      "level": 3,
      "content": "Sinta-se à vontade para compartilhar papéis de parede, telas iniciais, paletas de cores, widgets, temas, etc. com a comunidade no subfórum de arte.\n\nVeja também Arch Linux Art e Obra de arte.\n\n"
    },
    {
      "title": "Relate pacotes instalados",
      "level": 3,
      "content": "pkgstats fornece um timer de systemd que envia uma lista de pacotes instalados em seu sistema, junto com a arquitetura e mirrors que você usa, para os desenvolvedores do Arch Linux para ajudá-los a priorizar seus esforços e melhorar a ainda mais a distribuição. As informações são enviadas anonimamente e não pode ser usadas para identificar você. Você pode ver os dados colecionados página Statistics. More information is available in neste tópico do fórum.\n\n"
    },
    {
      "title": "Corrija e relate",
      "level": 3,
      "content": "Relatar e corrigir erros de pacotes do Arch no GitLab é uma das formas possíveis de se ajudar a comunidade.\n\nContudo, o uso inefetivo pode ser contraprodutivo. Por favor, leia Diretrizes de relatórios de erro e Diretrizes gerais#Solicitações de mesclagem de pacotes.\n\n"
    },
    {
      "title": "Informe sobre problemas de segurança",
      "level": 3,
      "content": "Novas vulnerabilidades são localizadas todo momento. Ajude a Equipe de Segurança do Arch a se manter antenada a novas vulnerabilidades.\n\n"
    },
    {
      "title": "Ajude a testar pacotes",
      "level": 3,
      "content": "Pacotes nos repositórios de teste precisam ser testados e assinados antes que ele sejam promovidos para os repositórios principais. Ajude a Equipe de Teste do Arch a testar novos pacotes.\n\n"
    },
    {
      "title": "Solicite recursos",
      "level": 3,
      "content": "Solicite recursos para pacotes Arch no GitLab. Antes de fazer isso, leia Diretrizes de relatórios de erro#Erro ou recurso?, para ter certeza de que é uma solicitação de recurso válida e Diretrizes gerais#Solicitações de mesclagem de pacotes.\n\nSolicite recursos para pacotes do AUR nas páginas dos pacotes AUR correspondentes.\n\n"
    },
    {
      "title": "Crie e adote pacotes do AUR",
      "level": 3,
      "content": "O Arch User Repository contém scripts de automatização de criação de pacotes feitos pela comunidade, permitindo que usuários instalem facilmente softwares que não são dos repositórios oficiais. Pacotes populares tendem a serem incluídos no repositório extra.\n\naurphanAUR[link quebrado: package not found] pode lhe ajudar a identificar pacotes órfãos que você usa, de forma que você possa adotá-los.\n\n"
    },
    {
      "title": "Tornando-se um Mantenedor de Pacote",
      "level": 3,
      "content": "Se você quiser ajudar a manter o AUR e os pacotes no repositório extra, você pode se inscrever para se tornar um Mantenedor de Pacote. Consulte Mantenedores de Pacote#Como eu me torno um Mantenedor de Pacote? para obter detalhes.\n\n"
    },
    {
      "title": "Eventos",
      "level": 2,
      "content": "Há eventos regulares abertos à comunidade para correção de bugs, limpeza e outras atividades.\n\n- AUR Cleanup Day\n- Bug Day\n\n"
    },
    {
      "title": "Projetos de software",
      "level": 2,
      "content": "A distribuição Arch Linux compreende muitos componentes e cada um desses projetos pode ser contribuído individualmente.\n\nA discussão sobre os vários projetos (salvo indicação em contrário) ocorre na lista de discussão arch-projects[link inativo 2024-01-13 ⓘ] e no canal IRC #archlinux-projects.\n\nTable content:\nProjeto | Descrição | Linguagens | Mantenedores | Links adicionais\nalpm.rs | Ligações Rust para libalpm | Rust | Morganamilo | bugs\narch-boxes | Imagens para máquina virtual | Bash | klausenbusk | bugs, IRC #archlinux-releng, lista de discussão arch-releng\narch-install-scripts | Scripts úteis para instalar o Arch Linux | Bash | Foxboron | bugs\narch-rebuild-order | Uma ferramenta de CLI para determinar a ordem de recompilação dos pacotes fornecidos | Rust | jelle | bugs\narch-release-promotion | Promoção e sincronização de lançamentos existentes de um projeto em uma instância GitLab do Arch Linux | Python | dvzrv | bugs\narch-repro-status | Ferramenta de CLI para consultar o status de reproducibilidade dos pacotes do Arch Linux | Rust | orhun | bugs\narch-security-tracker | A plataforma de rastreamento de CVEs security.archlinux.org e ajuda na publicação de avisos | Python (Flask) | anthraxx | bugs, IRC #archlinux-security, lista de discussão consultiva\narch-signoff | Arpovação de pacotes de teste do Arch Linux | Python | Jelle | bugs\narchinstall | Instalador oficial do Arch Linux | Python | Torxed | bugs, Discord, documentação\narchivetools | Uma solução pronta para uso para fazer snapshot de repositórios de pacotes Arch Linux, imagens ISOs e tarballs de boostrap | Bash |  | bugs\narchiso | Scripts e configuração para construir a mídia live | bash | dvzrv, nl6720 | bugs, IRC #archlinux-releng, lista de discussão arch-releng\narchlinux-common-style | Estilo CSS comum do Arch Linux | SCSS, HTML, JavaScript | anthraxx, jelle | bugs\narchlinux-docker | Imagens Docker | Bash | hashworks, sangy | bugs, docker hub, IRC #archlinux-releng, lista de discussarch-releng\narchlinux-keyring | Manipulação do chaveiro PGP do Arch Linux | Python | anthraxx, dvzrv | bugs\narchlinux-repro | Ferramentas para recompilar pacotes do Arch Linux | Python | Foxboron, Jelle, Coderobe | bugs\narchmanweb | O site man.archlinux.org | Python (Django) | Lahwaacz | bugs\narchweb | O site archlinux.org | Python (Django) | jelle | bugs\naurweb | A página e o sistema para aur.archlinux.org | Python, HTML, MySQL | artafinde, lfleischer | bugs, IRC #archlinux-aurweb, lista de discussão aur-dev\nbugbuddy | Daemon auxiliar que monitora os relatórios de bugs recebidos para o Arch Linux e garante que as pessoas certas sejam atribuídas a eles | Rust | anthraxx | bugs\nbuildbtw | Um serviço para auxiliar a equipe do Arch Linux a construir novas versões de pacotes | Rust | anthraxx, sven, raffomania | bugs, IRC #archlinux-buildbtw\ndbscripts | Scripts para lançar e gerenciar operações de pacotes para os repositórios oficiais | Bash | Foxboron | bugs\ndevtools | Ferramentas de empacotamento para desenvolvedores e empacotadores | Bash | Anthraxx, Foxboron, jelle, gromit | bugs\ngitlab-exporter | Exportador de métricas do GitLab | Rust | Artafinde, orhun | bugs\ngluebuddy | Um daemon seguro auxiliar que monitora vários aspectos da infraestrutura do Arch Linux e se certifica que certas condições sejam atendidas | Rust | anthraxx, jelle | bugs\ninfrastructure | Infraestrutura do Arch Linux | Ansible, Bash, Python, Packer, Terraform, Zsh | anthraxx, foutrelis, freswa, heftig, jelle, klausenbusk, svenstaro, artafinde, gromit | bugs, IRC #archlinux-devops, lista de discussão arch-devops\nkeycloak-archlinux-theme | Tema do Arch Linux para keycloak | Java | Artafinde | bugs\nmkinitcpio | Gerador de initrd | Ash, Bash | Foxboron, nl6720 | bugs\nmkinitcpio-archiso | Integração do Mkinitcpio para o archiso | Ash, Bash | dvzrv, nl6720 | bugs, IRC #archlinux-releng, lista de discussão arch-releng\nnamcap | Ferramenta para verificar pacotes binários e PKGBUILDs fonte para erros comuns de empacotamento | Python | alerque, dvzrv, FFY00, kgizdov | bugs\nnetctl | Gerenciamento de rede em systemd baseado em perfil | Bash | jwitteveen | bugs\nneoasknot | Página inicial de contribuição para Arch Linux | JavaScript, Svelte | polyzen | bugs, whatcanidofor.archlinux.org\npacman | Gerenciador de pacotes | Bash, C | Allan, agregory | bugs, IRC #archlinux-pacman, lista de discussão pacman-dev\npacman-contrib | Scripts de contribuição para o pacman | Bash, C, Perl | Demize, Polyzen | bugs, IRC #pacman-contrib, lista de discussão pacman-contrib\npkgstats-cli | Cliente do pkgstats | Go | pierres | bugs, pkgstats.archlinux.de\npkgstats.archlinux.de | Site de estatísticas de pacotes do Arch Linux | JavaScript, PHP, Vue | pierres | bugs, pkgstats.archlinux.de\npyalpm | Ligações Python para alpm | Python, C | Jelle | bugs\npytest-pacman | Plugin de pytest para geração de bases de dados de sincronização de repositórios | Python | Jelle | bugs\nrebuilderd-website | Site para reproducible.archlinux.org | JavaScript | Jelle | bugs, reproducible-builds.org, ReproducibleBuilds on Debian Wiki, IRC #archlinux-reproducible\nreleng | Automação de artefatos de lançamento (mídia de instalação, inicialização PXE) | Bash, Python | dvzrv | bugs, IRC #archlinux-releng, lista de discussão arch-releng\nrepod | Ferramentas para manter repositórios de pacotes binários para distribuições Linux usando o gerenciador de pacotes pacman | Python | dvzrv | bugs, documentação\nsignstar | Uma solução de assinatura de enclave segura e ferramentas em torno dela | Rust | dvzrv | bugs, IRC #archlinux-signstar\n\n"
    },
    {
      "title": "Doe dinheiro",
      "level": 2,
      "content": "Você pode ajudar a sustentar os custos dos servidores, na página oficial de doações para o Arch Linux.\n\n"
    },
    {
      "title": "Projetos não oficiais",
      "level": 2,
      "content": "A comunidade Arch mantém vários projetos. Sinta-se livre para incluir o seu!\n\n"
    },
    {
      "title": "Grupos",
      "level": 3,
      "content": "Grupos específicos do Arch, que podem ser de seu interesse.\n\n"
    },
    {
      "title": "Softwares",
      "level": 3,
      "content": "Software desenvolvido pela comunidade com foco no Arch Linux.\n\n"
    },
    {
      "title": "Software",
      "level": 3,
      "content": "Community-developed software that focuses on Arch Linux.\n\n"
    },
    {
      "title": "Tornando-se um Desenvolvedor do Arch",
      "level": 2,
      "content": "A principal motivação para o seu trabalho no Arch deve ser ajudar toda a comunidade, e não simplesmente tentar se tornar um desenvolvedor Arch de qualquer maneira.\n\nNormalmente, novos desenvolvedores são escolhidos pelos desenvolvedores existentes à medida que a carga de trabalho aumenta. Às vezes, eles publicam uma vaga e você pode se candidatar para preenchê-la, mas, mais frequentemente, eles apenas convidam alguém que sabem que seria bom no cargo e que se encaixaria bem no resto da equipe. Ter um portfólio de contribuições do Arch é a melhor maneira de fazer parte da equipe.\n\nAqui está uma lista de coisas que você pode fazer para ganhar alguma \"popularidade\" entre os desenvolvedores do Arch:\n\n- Estabeleça uma reputação de ser útil, oferecendo assistência sempre que possível.\n- Responda perguntas no fórum, IRC e listas de discussão.\n- Junte-se aos Mantenedores de Pacote para ganhar experiência em empacotamento e mostrar suas habilidades.\n- Envie pacotes para o AUR.\n- Junte-se a um dos projetos satélites que podem ser incorporados ao Arch mainstream algum dia, ou comece o seu próprio.\n- Trabalhe no pacman, makepkg ou outro projeto (no GitLab) e envie patches para o bug tracker.\n- Acesse o rastreador de bugs e corrija os bugs existentes.\n- Encontre e envie novos bugs.\n- Corrija erros na wiki, adicione novas páginas, limpe as páginas existentes e certifique-se de que os procedimentos estejam atualizados.\n- Envie traduções.\n\n"
    }
  ]
}