{
  "title": "Ghostscript (Español)",
  "url": "https://wiki.archlinux.org/title/Ghostscript_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-01-14** \n\nEste artículo cubre el software para ver, editar y convertir PDF, PostScript (PS), DjVu (déjà vu) y archivos XPS.\n\n"
    },
    {
      "title": "Motores",
      "level": 2,
      "content": "- Poppler — Biblioteca de renderizado de PDF basada en Xpdf. Para soportar CJK (Chino, Japonés, Koreano) con Poppler, instale poppler-data.\n\n- Mupdf — MuPDF es un visor de PDF, XPS y EPUB ligero, que consta de una biblioteca de software, herramientas de línea de órdenes y visores.\n\n- libspectre — Pequeña biblioteca para renderizar documentos PostScript.\n\n- Ghostscript — Intérprete para PostScript y PDF. Proporciona la interfaz de línea de órdenes gs(1), véase también /usr/share/doc/ghostscript/*/Use.htm (online[enlace roto 2022-09-22]), junto con muchos scripts como ps2pdf y pdf2ps.\n\n- DjVuLibre — Suite para crear, manipular y ver documentos DjVu.\n\n- libgxps — Biblioteca basada en GObject para manejar y renderizar documentos XPS.\n\n"
    },
    {
      "title": "Framebuffer",
      "level": 3,
      "content": "- fbgs — Visor de PostScript/pdf de los pobres para la consola framebuffer de Linux.\n\n- fbpdf — Pequeño visor de framebuffer PDF y DjVu basado en MuPDF, con atajos de teclado Vim y escrito en C\n\n- jfbview — Framebuffer PDF y visor de imágenes. Las características incluyen controles tipo Vim, zoom para ajustar, una vista TOC (esquema), renderizado rápido de subprocesos múltiples y pre-almacenamiento en caché asíncrono.\n\n"
    },
    {
      "title": "Gráficos",
      "level": 3,
      "content": "- apvlv — Visor de documentos ligero con atajos de teclado Vim. Soporta PDF, DjVu, UMD y TXT.\n\n- Atril — Visor de documentos multi-página simple para MATE. Soporta DjVu, DVI, EPS, EPUB, PDF, PostScript, TIFF, XPS y Comicbook.\n\n- DjView — Visor para documentos DjVu.\n\n- ePDFView — Visor de documentos PDF ligero utilizando las bibliotecas Poppler y GTK. Desarrollo detenido.\n\n- Emacs — Véase también pdf-tools para mejorar el soporte de pdf (emacs-pdf-tools-gitAUR) y el paquete djvu para soporte djvu.\n\n- Evince — Visor de documentos para GNOME. Soporta DjVu, DVI, EPS, PDF, PostScript, TIFF, XPS y Comicbook.\n\n- Foxit Reader — Pequeño, rápido (comparado con Acrobat) visor propietario de PDF. Discontinuado para Linux.\n\n- gv — Interfaz gráfica de usuario para el intérprete Ghostscript que permite ver y navegar por documentos PostScript y PDF.\n\n- llpp — Lector de PDF muy rápido basado en MuPDF, que admite desplazamiento continuo de páginas, marcadores y búsqueda de texto en todo el documento.\n\n- MuPDF — Visor muy rápido de EPUB, FictionBook, PDF, XPS y Comicbook escrito en C portable. Como característica soporta tipografía CJK.\n\n- Okular — Visor de documentos universal para KDE. Soporta CHM, Comicbook, DjVu, DVI, EPUB, FictionBook, Mobipocket, ODT, PDF, Plucker, PostScript, TIFF y XPS.\n\n- pdfpc — Presentador de Consola con soporte multimonitor para archivos PDF.\n\n- qpdfview — Visor de documentos con pestañas. Utiliza Poppler para soporte PDF, libspectre para soporte PS, DjVuLibre para soporte DjVu, CUPS para soporte de impresión y el Qt toolkit para su interfaz.\n\n- Xpdf — Visor que puede decodificar LZW y leer PDFs cifrados.\n\n- Xreader — Visor de documentos que forma parte del proyecto X-Apps. Soporta DjVu, DVI, EPUB, PDF, PostScript, TIFF, XPS y Comicbook.\n\n- Zathura — Visor de documentos altamente personalizable y funcional (basado en plugin). Soporta PDF, DjVu, PostScript y Comicbook.\n\n"
    },
    {
      "title": "Comparativa",
      "level": 4,
      "content": "El asterisco junto a la biblioteca indica que la dependencia opcional debe instalarse para una función específica.\n\nTable content:\nNombre | PDF | PostScript | DjVu | XPS | PDF forms | Anotación PDF | Licencia\nAdobe Reader | Personalizado | – | – | – | Sí | – | propietario\napvlv | Poppler | – | DjVuLibre | – | No | – | GPLv2\nAtril | Poppler | libspectre | DjVuLibre | libgxps | Sí | – | GPLv2\nDjView | – | – | DjVuLibre | – | – | – | GPLv2\nEmacs | Ghostscript* | DjVuLibre* | – | No | Sí | GPLv3\nePDFView | Poppler | – | – | – | No | – | GPLv2\nEvince | Poppler | libspectre | DjVuLibre | libgxps | Sí | Sí | GPLv2\nFoxit Reader | Personalizado | – | – | – | Sí | Sí | propietario\ngv | Ghostscript | – | – | No | – | GPLv3\nllpp | libmupdf | – | – | libmupdf | Sí | – | GPLv3\nMuPDF | Personalizado | – | – | Personalizado | Sí | Sí | AGPLv3\nOkular | Poppler | libspectre | DjVuLibre | Personalizado | Sí | Sí | GPL, LGPL\npdfpc | Poppler | – | – | – | No | – | GPLv2\nqpdfview | Poppler | libspectre* | DjVuLibre* | – | Sí | Sí | GPLv2\nXpdf | Personalizado | – | – | – | No | – | GPLv3\nXreader | Poppler | libspectre* | DjVuLibre* | libgxps* | Sí | Sí | GPLv2\nZathura | Poppler* / libmupdf* | libspectre* | DjVuLibre* | libmupdf* | [enlace roto 2024-07-30] No | – | zlib\n\n"
    },
    {
      "title": "PDF forms",
      "level": 4,
      "content": "La columna PDF Forms en la tabla anterior se refiere al soporte AcroForms.Si no necesita que lo que introduzca sea directamente extraíble del PDF, también puede utilizar las aplicaciones en #Anotación o #Edición gráfica de PDF para poner texto encima de un PDF. Los formularios PDF se pueden crear con LibreOffice Writer (Ver > Barras de herramientas > Controles de formulario) y los editores de PDF avanzados.\n\nEl formato propietario y en desuso XFA para formularios, no es totalmente compatible con Poppler[1][2] y solo es soportado por Adobe Reader y Master PDF Editor.\n\nAlternativamente, los navegadores web como Firefox o Chromium cuentan con un visor de PDF integrado capaz de completar formularios.\n\n"
    },
    {
      "title": "Anotación",
      "level": 2,
      "content": "- flpsed — Un anotador PostScript y PDF, solo soporta cajas de texto.\n\nVéase también List of applications/Documents#Stylus note-taking.\n\n"
    },
    {
      "title": "Edición gráfica de PDF",
      "level": 2,
      "content": "- Scribus puede importar y exportar PDF; el texto se importa como polígonos.[3]\n- LibreOffice Draw puede importar y exportar PDF; el texto se importa como texto; las fuentes incrustadas se sustituyen.[4][5]\n- Inkscape puede importar una sola página desde un PDF y exportar a PDF; el texto se importa como glifos clonados o texto; con este último se sustituyen las fuentes incrustadas.\n- Editores gráficos como GIMP y krita también pueden importar y exportar archivos PDF a costa de la rasterización.\n\n"
    },
    {
      "title": "Editores básicos",
      "level": 3,
      "content": "- jPDF Tweak — Aplicación Java Swing que puede combinar, dividir, rotar, reordenar, usar marcas de agua, cifrar, firmar y modificar archivos PDF.\n\n- PDF Arranger — Ayuda a fusionar o dividir documentos PDF y rotar, recortar y reorganizar páginas. Es una bifurcación mantenida de PDF-Shuffler.\n\n- PDF Chain — Interfaz GTK para PDFtk, escrito en C++, soportando concatenación, ráfaga, marcas de agua, archivos adjuntos y más.\n\n- PDF Mix Tool — Interfaz Qt para PoDoFo, escrito en C++, soporta división, fusión, rotación y mezclado de archivos PDF.\n\n- PDF Mod — Reordenar, rotar y eliminar páginas, exportar imágenes de un documento, editar el título, el tema, el autor y las palabras clave, y combinar documentos mediante arrastrar y soltar.\n\n- PDFsam — Aplicación de código abierto, escrita en Java, soporta fusión, división y rotación.\n\n- PDF Slicer — Aplicación simple para extraer, fusionar, rotar y reordenar páginas de documentos PDF.\n\n- PDF Tricks — Aplicación simple y eficiente para pequeñas manipulaciones en archivos PDF utilizando Ghostscript.\n\n"
    },
    {
      "title": "Herramientas de corte",
      "level": 3,
      "content": "- briss — GUI de Java para recortar páginas de documentos PDF en una o más regiones seleccionadas.\n\n- krop — Herramienta gráfica simple para recortar las páginas de archivos PDF.\n\n- pdfCropMargins — Recorta automáticamente los márgenes de los archivos PDF.\n\n- PdfHandoutCrop — Herramienta para recortar folletos en PDF con varias páginas por hoja.\n\n"
    },
    {
      "title": "Editores avanzados",
      "level": 3,
      "content": "- Master PDF Editor — Editor de PDF funcional y propietario. Gratis para uso no comercial.\n\n- PDF Studio — Editor de PDF propietario todo-en-uno similar a Adobe Acrobat.\n\n"
    },
    {
      "title": "Herramientas PDF",
      "level": 2,
      "content": "Véase también Ghostscript.\n\n- Coherent PDF — Herramientas de línea de órdenes para manipular archivos PDF que incluyen fusionar, cifrar, descifrar, escalar, recortar, rotar, marcadores, sellos, logotipos, números de página.\n\n- DiffPDF — Compare el texto o la apariencia visual de cada página en dos archivos PDF.\n\n- mupdf-tools — Herramientas desarrolladas como parte de MuPDF, contienen mutool(1) y muraster.\n\n- pdfgrep — Utilidad de línea de órdenes para buscar texto en archivos PDF.\n\n- pdfjam — Se puede utilizar para n-up, unir, rotar y voltear PDF y organizarlos en un formato adecuado para encuadernación de libros.\n\n- pdf2svg — Convierte archivos PDF a archivos SVG.\n\n- PDFtk — Herramienta simple para hacer cosas cotidianas con documentos PDF.\n\n- QPDF — Sistema de transformación de PDF con conservación de contenido.\n\n- Stapler — Alternativa ligera a PDFtk utilizando la biblioteca PyPDF2.\n\n"
    },
    {
      "title": "Crea un PDF a partir de imágenes",
      "level": 3,
      "content": "Con GraphicsMagick:\n\n```\n$ gm convert 1.jpg 2.jpg 3.jpg out.pdf\n```\n\n"
    },
    {
      "title": "Concatenar PDFs",
      "level": 3,
      "content": "Con Ghostscript:\n\n```\n$ gs -dNOPAUSE -sDEVICE=pdfwrite -sOUTPUTFILE=out.pdf -dBATCH 1.pdf 2.pdf 3.pdf\n```\n\nCon PDFtk:\n\n```\n$ pdftk 1.pdf 2.pdf 3.pdf cat output out.pdf\n```\n\nCon Poppler:\n\n```\n$ pdfunite 1.pdf 2.pdf 3.pdf out.pdf\n```\n\nCon QPDF:\n\n```\n$ qpdf --empty --pages 1.pdf 2.pdf 3.pdf -- out.pdf\n```\n\n"
    },
    {
      "title": "Convertir un PDF a texto",
      "level": 3,
      "content": "Con Poppler y manteniendo el diseño:\n\n```\n$ pdftotext -layout in.pdf out.txt\n```\n\nVéase también pdftotext(1).\n\n"
    },
    {
      "title": "Descifrar un PDF",
      "level": 3,
      "content": "Esta sección enumera los comandos para descifrar un PDF en un archivo sin cifrar. Tenga en cuenta que la mayoría de visores PDF también soportan archivos PDF cifrados.\n\nCon PDFtk:\n\n```\n$ pdftk in.pdf input_pw contraseña output out.pdf\n```\n\nCon Poppler a PostScript:\n\n```\n$ pdftops -upw contraseña in.pdf out.ps\n```\n\nCon QPDF:\n\n```\n$ qpdf --decrypt --password=contraseña in.pdf out.pdf\n```\n\n"
    },
    {
      "title": "Cifrar un PDF",
      "level": 3,
      "content": "La contraseña_de_usuario se utiliza para el cifrado, la contraseña_de_propietario para restringir las operaciones una vez que se descifra el documento, para más información, véase Wikipedia:PDF#Security and signatures.\n\nCon PDFtk:\n\n```\n$ pdftk in.pdf output out.pdf user_pw contraseña\n```\n\nCon PoDoFo:\n\n```\n$ podofoencrypt -u contraseña_de_usuario -o contraseña_de_propietario in.pdf out.pdf\n```\n\nCon QPDF:\n\n```\n$ qpdf --encrypt contraseña_de_usuario contraseña_de_propietario longitud_de_la_clave -- in.pdf out.pdf\n```\n\ndonde longitud_de_la_clave puede ser 40, 128 ó 256.\n\n"
    },
    {
      "title": "Extraer imágenes de un PDF",
      "level": 3,
      "content": "Con Poppler a JPEG:\n\n```\n$ pdfimages entrada.pdf -j prefijo_salida\n```\n\n"
    },
    {
      "title": "Extraer un rango de página del PDF, dividir el documento PDF de varias páginas",
      "level": 3,
      "content": "Con Ghostscript como un solo archivo[6]\n\n```\n$ gs -sDEVICE=pdfwrite -dNOPAUSE -dBATCH -dSAFER -dFirstPage=primero -dLastPage=último -sOutputFile=salida.pdf entrada.pdf\n```\n\nCon PDFtk como un solo archivo:\n\n```\n$ pdftk entrada.pdf cat primero-último output salida.pdf\n```\n\nCon Poppler como archivos separados:\n\n```\n$ pdfseparate -f primero -l último entrada.pdf prefijo_salida-%d.pdf\n```\n\nCon QPDF como un solo archivo:\n\n```\n$ qpdf --empty --pages entrada.pdf primero-último -- salida.pdf\n```\n\nCon mutool como un solo archivo:\n\n```\n$ mutool clean -g entrada.pdf salida.pdf primero-último\n```\n\n"
    },
    {
      "title": "Imponiendo un PDF",
      "level": 3,
      "content": "La imposición PDF puede hacerse con pdfjam, por ejemplo, el desperdicio de papel se puede reducir con pdfnup y pdfbook se puede utilizar para organizar archivos PDF en un formato adecuado para encuadernación de libros.\n\n"
    },
    {
      "title": "Inspeccionar metadatos",
      "level": 3,
      "content": "Con ExifTool:\n\n```\n$ exiftool archivo.pdf\n```\n\nCon Poppler:\n\n```\n$ pdfinfo archivo.pdf\n```\n\n"
    },
    {
      "title": "Optimizar, reducir el tamaño de un PDF",
      "level": 3,
      "content": "Con Ghostscript uno de:\n\n```\n$ ps2pdf -dPDFSETTINGS=/screen in.pdf out.pdf\n$ gs -dNOPAUSE -dBATCH -sDEVICE=pdfwrite -dCompatibilityLevel=1.4 -dPDFSETTINGS=/printer -sOutputFile=out.pdf in.pdf\n```\n\nPara distintas configuraciones véase la documentación[enlace roto 2022-09-22].\n\nTambién está shrinkpdfAUR, un script que envuelve gs.\n\n"
    },
    {
      "title": "Rasterizar un PDF",
      "level": 3,
      "content": "Con GraphicsMagick para convertir una página específica:\n\n```\n$ gm convert -density dpi entrada.pdf[página] salida.jpg\n```\n\nCon Poppler para convertir todas las páginas:\n\n```\n$ pdftoppm -jpeg -r dpi entrada.pdf prefijo_salida\n```\n\nCon Poppler para convertir una página específica:\n\n```\n$ pdftoppm -jpeg -r dpi -f página -singlefile entrada.pdf prefijo_salida\n```\n\n"
    },
    {
      "title": "División de páginas PDF",
      "level": 3,
      "content": "Con mupdf-tools para dividir cada página verticalmente en dos páginas:\n\n```\n$ mutool poster -y 2 in.pdf out.pdf\n```\n\nSe puede utilizar para deshacer imposiciones simples.\n\n"
    },
    {
      "title": "Añadir firma.png o imagen a una de las páginas del PDF",
      "level": 3,
      "content": "Para añadir una imagen en cualquier ubicación en un PDF se puede hacer con ImageMagick (convertir), xv y pdftk. Un script está aquí y otros consejos están aquí.\n\n"
    },
    {
      "title": "Herramientas DjVu",
      "level": 2,
      "content": "- DjVuLibre proporciona muchas herramientas de línea de órdenes, como por ejemplo ddjvu(1).\n- img2djvu — Codificador DjVu de una sola pasada basado en DjVu Libre e ImageMagick.\n\n- pdf2djvu — Crea archivos DjVu a partir de archivos PDF.\n\n"
    },
    {
      "title": "Convertir DjVu a imágenes",
      "level": 3,
      "content": "Divide Djvu en páginas separadas:\n\n```\n$ djvmcvt -i input.djvu /ruta/al/directorio/de/salida output-index.djvu\n```\n\nConvierte páginas Djvu en imágenes:\n\n```\n$ ddjvu --format=tiff page.djvu page.tiff\n```\n\nConvierte páginas Djvu en PDF:\n\n```\n$ ddjvu --format=pdf inputfile.djvu ouputfile.pdf\n```\n\nTambién puedes utilizar --page para exportar páginas específicas:\n\n```\n$ ddjvu --format=tiff --page=1-10 input.djvu output.tiff\n```\n\nesto convertirá las páginas de 1 a 10 en un archivo tiff.\n\n"
    },
    {
      "title": "Procesando imágenes",
      "level": 3,
      "content": "Puedes utilizar scantailor-advanced para:\n\n- corregir la orientación\n- dividir páginas\n- enderezar\n- recortar\n- ajustar márgenes\n\n"
    },
    {
      "title": "Crear DjVu desde imágenes",
      "level": 3,
      "content": "Hay un script útil en img2djvu-gitAUR.\n\n```\n$ img2djvu -c1 -d600 -v1 ./salida\n```\n\nesto creará out.djvu con 600 DPI de todos los archivos en en directorio ./salida.\n\nAlternativamente, puede probar didjvuAUR, que parece crear archivos más pequeños especialmente en imágenes con fondo bien definido.\n\n"
    },
    {
      "title": "Herramientas PostScript",
      "level": 2,
      "content": "- pstotext — Convierte archivos PostScript a texto.\n\n- Ghostscript\n\n"
    },
    {
      "title": "ps2pdf",
      "level": 3,
      "content": "ps2pdf es una envoltura alrededor de ghostscript para convertir PostScript a PDF:\n\n```\n$ ps2pdf -sPAPERSIZE=a4 -dOptimize=true -dEmbedAllFonts=true YourPSFile.ps\n```\n\nExplicación:\n\n- -sPAPERSIZE=something define el tamaño del papel. Para valores válidos de PAPERSIZE, véase [7][enlace roto 2022-09-22].\n- -dOptimize=true permite que el PDF creado se optimice para la carga.\n- -dEmbedAllFonts=true hace que las fuentes se vean siempre bonitas.\n\n"
    },
    {
      "title": "Bibliotecas",
      "level": 2,
      "content": "- libharu — Biblioteca C para generar documentos PDF.\n\n- PoDoFo — Una biblioteca de C++ para trabajar con el formato de archivo PDF.\n\n"
    },
    {
      "title": "Python",
      "level": 3,
      "content": "- PDFMiner — Utilidades para extraer, analizar datos de texto de archivos PDF. Incluye pdf2txt, dumppdf, y latin2ascii\n\n- pdfrw — Una biblioteca puramente Python que lee y escribe archivos PDF.\n\n- PyPDF3 — Una biblioteca puramente Python construida como un toolkit PDF.\n\n- PyX — Biblioteca de Python para la creación de archivos PostScript y PDF.\n\n- ReportLab — Una solución comprobada de generación de PDF.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- List of applications/Documents#Readers and viewers\n- List of applications/Documents#OCR software\n- Wikipedia:List of PDF software\n\n"
    }
  ]
}