{
  "title": "GNOME/Flashback",
  "url": "https://wiki.archlinux.org/title/GNOME/Flashback",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- Window manager\n\nGNOME Flashback (previously called GNOME fallback mode) is a shell for GNOME 3. The desktop layout and the underlying technology is similar to GNOME 2. It does not use 3D acceleration at all, so it is generally faster and less CPU intensive than GNOME Shell with llvmpipe.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "GNOME Flashback can be installed from the gnome-flashback package. It is recommended to install its optional dependencies also to get a more complete desktop environment.\n\nYou can also install the following packages which provide some additional applets for the GNOME Panel:\n\n- GNOME Applets — Small applications for the GNOME panel\n\n- Pomodoro Applet — GNOME Panel applet for timing the intervals used in the Pomodoro Technique(tm)\n\n- Sensors Applet — Applet for GNOME Flashback panel to display readings from hardware sensors, including CPU temperature, fan speeds and voltage readings\n\nIt is recommended to install the gnome group, which contains applications required for the standard GNOME experience.\n\n"
    },
    {
      "title": "Graphical log-in",
      "level": 3,
      "content": "Choose GNOME Flashback (Metacity) from the menu in a display manager of choice.\n\nThose who wish to use Compiz with GNOME Flashback should select GNOME Flashback (Compiz) instead.\n\n"
    },
    {
      "title": "Manually",
      "level": 3,
      "content": "- For the GNOME Flashback (Metacity) session, add the following to the ~/.xinitrc file: export XDG_CURRENT_DESKTOP=GNOME-Flashback:GNOME exec gnome-session --session=gnome-flashback-metacity\n\n```\nexport XDG_CURRENT_DESKTOP=GNOME-Flashback:GNOME\nexec gnome-session --session=gnome-flashback-metacity\n```\n\n- For the GNOME Flashback (Compiz) session, add the following to the ~/.xinitrc file: export XDG_CURRENT_DESKTOP=GNOME-Flashback:GNOME exec gnome-session --session=gnome-flashback-compiz\n\n```\nexport XDG_CURRENT_DESKTOP=GNOME-Flashback:GNOME\nexec gnome-session --session=gnome-flashback-compiz\n```\n\nAfter editing .xinitrc, GNOME Flashback can be launched with startx. See xinitrc for details.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "GNOME Flashback shares most of its settings with GNOME. See GNOME#Configuration for more details.\n\n"
    },
    {
      "title": "Customizing GNOME Panel",
      "level": 3,
      "content": "- To configure the panel, hold down the Alt key, and right-click on it in an empty area.\n- To move an applet on the panel, hold down the Alt key, and grab it with middle-button.\n\n"
    },
    {
      "title": "Alternative window manager",
      "level": 3,
      "content": "You can use an alternative window manager with GNOME Flashback by creating a custom GNOME session with the following components:\n\n```\nRequiredComponents=gnome-flashback-init;gnome-flashback;gnome-panel;window-manager;gnome-settings-daemon;nautilus-classic;\n```\n\nwhere window-manager is the window manager you wish to use. See GNOME/Tips and tricks#Custom GNOME sessions.\n\nAlso see this article on running awesome as the window manager in GNOME.\n\n"
    },
    {
      "title": "Panel speed settings",
      "level": 3,
      "content": "To adjust the amount of time it takes for the panel to disappear or reappear when autohide is enabled, execute the following:\n\n```\n$ gsettings set org.gnome.gnome-panel.toplevel:/org/gnome/gnome-panel/layout/toplevels/panel/ hide-delay time\n$ gsettings set org.gnome.gnome-panel.toplevel:/org/gnome/gnome-panel/layout/toplevels/panel/ unhide-delay time\n```\n\nwhere panel is either top-panel or bottom-panel and time is a value in miliseconds, e.g. 300.\n\nTo set the speed at which panel animations occur, execute the following:\n\n```\n$ gsettings set org.gnome.gnome-panel.toplevel:/org/gnome/gnome-panel/layout/toplevels/panel/ animation-speed value\n```\n\nwhere panel is either top-panel or bottom-panel and value is either \"'fast'\", \"'medium'\" or \"'slow'\".\n\n"
    },
    {
      "title": "Replace applications menu icon",
      "level": 3,
      "content": "Replace /usr/share/icons/icon-theme/16x16/places/start-here.png with your own icon (where icon-theme is the name of your icon theme).\n\nAfter making the change, restart GNOME Panel: gnome-panel --replace.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- GnomeFlashback - GNOME Wiki\n\n"
    }
  ]
}