{
  "title": "GNOME (العربية)/Files (العربية)",
  "url": "https://wiki.archlinux.org/title/GNOME_(%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9)/Files_(%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- GNOME\n- File manager functionality\n- Nemo\n- Thunar\n- PCManFM\n\nFiles is the default file manager for GNOME. Files attempts to provide a streamlined method to manage both files and applications.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the nautilus package. This package is part of the gnome group. See also File manager functionality#Additional features.\n\n"
    },
    {
      "title": "Extensions",
      "level": 3,
      "content": "Some programs can add extra functionality to Files. Here are a few examples:\n\n- Actions For Nautilus — An extension that allows you to add arbitrary actions to the file selection context menu. (written in Python)\n\n- Folder Color — A file browser extension for choosing the color of a folder (written in Python)\n\n- Nautilus Admin — Add to menu: \"Open as administrator\" or \"Edit as administrator\" (written in Python)\n\n- Nautilus Annotations — Annotate files and directories (written in C)\n\n- Nautilus Bluetooth — Add to menu: \"Send via Bluetooth\" (written in C)\n\n- Nautilus Checksums — Add checksums to Nautilus' properties window (written in C)\n\n- Nautilus Hide — Add to menu: \"Hide\"/\"Unhide\" (written in C)\n\n- Nautilus Image Converter — Resize/rotate images (written in C)\n\n- Nautilus Launch — Nautilus extension to run executables and launchers via right-click menu (written in C)\n\n- Nautilus Open Any Terminal — Nautilus extension which adds an context-entry for opening other terminal emulators.\n\n- Nautilus Metadata Editor — Nautilus extension with simple Metadata Editor for the following mime types: audio/x-mp3, audio/x-flac, audio/x-vorbis+ogg, audio/x-speex+ogg, audio/x-musepack, audio/x-wavpack, audio/x-tta, audio/x-aiff, audio/m4a, video/mp4, video/x-ms-asf (written in C and Vala)\n\n- Nautilus Share — Nautilus extension to share folder using Samba (written in C)\n\n- Seahorse Nautilus — PGP encryption and signing for Files (written in C)\n\n- Sushi — Quick file previewer for Nautilus. Part of gnome.\n\nNote: **GNOME Files** \n\n"
    },
    {
      "title": "Applications that ship their own Nautilus extensions",
      "level": 4,
      "content": "The following applications install their own extensions by default, thus providing integration with Nautilus:\n\n- Eiciel — GNOME file ACL editor — The application includes an \"Eiciel Nautilus\" extension that adds graphical ACL editor into the file properties window (written in C++)\n\n- File Roller — An application for browsing archives — The application includes a \"Nautilus FileRoller\" extension (written in C)\n\n- GNOME Terminal — The GNOME Terminal Emulator — The application includes a \"Terminal Nautilus\" extension (written in C)\n\n- Tilix — A tiling terminal emulator for GNU/Linux using GTK+ 3 — The application includes an extension for Nautilus which adds an \"Open in Tilix\" option to the context menu (written in Python)\n\n"
    },
    {
      "title": "Extensions that rely on non-free software",
      "level": 4,
      "content": "Some extensions for GNOME Files, although free, might rely on non-free software. The following list provides a few examples:\n\n- Code Nautilus — Nautilus extension to open files and directories in Visual Studio Code (written in Python)\n\n- JetBrains Nautilus — Nautilus extension to open files and directories in JetBrains Toolbox installed products (written in Python)\n\n- Nautilus Code — Nautilus extension which adds right-click menu items to open current folder in VSCode or GNOME Builder (written in C)\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Files is simple to configure graphically, but not all options are available in the preferences menu. More options are available with dconf-editor under org.gnome.nautilus.\n\n"
    },
    {
      "title": "Change default item view",
      "level": 3,
      "content": "You can change the default view for the items by setting the default-folder-viewer variable, e.g. for the list view:\n\n```\n$ gsettings set org.gnome.nautilus.preferences default-folder-viewer 'list-view'\n```\n\n"
    },
    {
      "title": "Sort by type",
      "level": 3,
      "content": "To sort files in all folders by type:\n\n```\n$ gsettings set org.gnome.nautilus.preferences default-sort-order 'type'\n```\n\n"
    },
    {
      "title": "Remove folders from the places sidebar",
      "level": 3,
      "content": "The displayed folders are specified in ~/.config/user-dirs.dirs and can be altered with any editor. An execution of xdg-user-dirs-update will change them again, thus it may be advisable to set the file permissions to read-only.\n\n"
    },
    {
      "title": "Always show text-entry location",
      "level": 3,
      "content": "The standard Files toolbar shows a button bar interface for path navigation. To enter path locations using the keyboard, you must expose the location text-entry field. This is done by pressing Ctrl+l\n\nTo make the location text-entry field always present, use gsettings as shown below:\n\n```\n$ gsettings set org.gnome.nautilus.preferences always-use-location-entry true\n```\n\nNote: **false** \n\n"
    },
    {
      "title": "Thumbnails",
      "level": 3,
      "content": "See File manager functionality#Thumbnail previews.\n\nSometimes video thumbnails are not shown. To solve it (as mentioned in No video thumbnails on nautilus), you must install ffmpegthumbnailer, gst-libav, gst-plugins-ugly, and remove the content of ~/.cache/thumbnails/fail/.\n\n"
    },
    {
      "title": "Create a new document from the right-click menu",
      "level": 3,
      "content": "To get this option one has to create a ~/Templates/ folder in your home folder and place an empty file inside the folder through your favorite Terminal by touch ~/Templates/new or by using any other file manager. Then just restart Files.\n\nOn non-English installations, the templates directory might have another name. One can find the actual directory with xdg-user-dir TEMPLATES.\n\nThe templates directory can be configured in the ~/.config/user-dirs.dirs file:\n\n```\nXDG_TEMPLATES_DIR=\"$HOME/some/path\"\n```\n\n"
    },
    {
      "title": "Hiding files",
      "level": 3,
      "content": "Like most other file managers GNOME Files hides files with names starting with a dot by default.\n\nGNOME Files additionally hides files when their names are listed in a .hidden file in the same directory (one filename per line). See nautilus-hideAUR for an extension that facilitates adding/removing entries from such .hidden files.\n\n"
    },
    {
      "title": "Open current directory in Tilix",
      "level": 3,
      "content": "If you are using tilix terminal you can easily add \"Open in Tilix\" option to the context menu of GNOME Files by installing its optional dependency nautilus-python.\n\n"
    },
    {
      "title": "Add a folder to bookmarks",
      "level": 3,
      "content": "To add a folder to your bookmarks, simply press Ctrl+d when you have the folder opened in Nautilus. Note that the list of bookmarks is shared with other GNOME-based graphical file managers (e.g. Nemo), so a folder added or removed from one will affect the bookmarks seen in the other.\n\n"
    },
    {
      "title": "Custom scripts",
      "level": 3,
      "content": "Scripts placed in ~/.local/share/nautilus/scripts can be run from the right click context menu of a file.\n\nThe context menu can also be organized into subfolders, e.g. ~/.local/share/nautilus/scripts/images and ~/.local/share/nautilus/scripts/music.\n\nScripts have access to the following environment variables:\n\n```\nNAUTILUS_SCRIPT_SELECTED_FILE_PATHS\nNAUTILUS_SCRIPT_SELECTED_URIS\nNAUTILUS_SCRIPT_CURRENT_URI\nNAUTILUS_SCRIPT_WINDOW_GEOMETRY\n```\n\nSome example scripts:\n\n```\n~/.local/share/nautilus/scripts/open-terminal-here\n```\n\n```\n#!/bin/sh\ngnome-terminal\n```\n\n```\n~/.local/share/nautilus/scripts/remove-extension\n```\n\n```\n#!/bin/sh\necho \"$NAUTILUS_SCRIPT_SELECTED_FILE_PATHS\" | while read -r filename; do\n    mv -n \"$filename\" \"${filename%.*}\"\ndone\n```\n\n"
    },
    {
      "title": "Keybinds",
      "level": 4,
      "content": "Keybinds to execute scripts can be assigned in the ~/.config/nautilus/scripts-accels file:\n\n```\n; Example Keybinds\n; Modifiers: <Control> <Alt> <Shift>\nF4 open-terminal-here\n<Alt>x remove-extension\n```\n\n"
    },
    {
      "title": "Network Shares / Virtual Filesystems",
      "level": 3,
      "content": "By installing gvfs and the various gvfs-* packages, you can add support for various network based filesystems (e.g. SMB, NFS, WebDAV, Nextcloud) and some mobile phones (Android MTP, Apple AFC).\n\nFor more information and other supported virtual filesystems, see File manager functionality.\n\n"
    },
    {
      "title": "Files is no longer the default file manager",
      "level": 3,
      "content": "This can be caused by the file association for directories being reset. Installing anjutaAUR or visual-studio-code-binAUR tend to do this.\n\nTo solve this, open Files, right-click on a folder, and choose Open With Other Application > Files > Select. This will set the association for directories back to Files.\n\nIf this does not solve the issue, see File manager functionality#Directories are not opened in the file manager.\n\n"
    },
    {
      "title": "Freezes for a few seconds after every copy operation",
      "level": 3,
      "content": "In case you have kdeconnect installed in your system, the problem might be caused by its file sharing module. Deactivate file sharing, and it should stop happening.\n\n"
    },
    {
      "title": "Cannot open Google Drive",
      "level": 3,
      "content": "You may be missing one or more of the following packages:\n\n- gnome-online-accounts\n- gvfs-goa\n- gvfs-google\n\nInstall them and you should be good to go.\n\n"
    },
    {
      "title": "Windows machines (version 1709 or up) with shared folders don't show up in Network view",
      "level": 3,
      "content": "To activate the WSD support in GNOME/Files install gvfs-wsdd to make GNOME/Files discover newer Windows machines in the network view. There is no further tweaking necessary.\n\n"
    },
    {
      "title": "WebDAV missing from mounting options",
      "level": 3,
      "content": "Install gvfs-dnssd and restart Nautilus.\n\n"
    },
    {
      "title": "Run as a Program doesn't work without gnome-console",
      "level": 3,
      "content": "'Run as a Program' context menu option is hardcoded for gnome-console and if you use different terminal and the default gnome terminal is not present, the context menu option won't do anything.\n\nSince it's just executing /usr/bin/kgx (executable for gnome-console) directly, you can create script (or symlink if your terminal has the same arguments) named kgx and place it inside /usr/bin/ to use your terminal for 'Run as a Program' context menu option.\n\nExample for using wezterm-gitAUR as a terminal for 'Run as a Program'\n\n```\n/usr/bin/kgx\n```\n\n```\n#!/bin/sh\n\nwezterm -e $@\n```\n\n"
    },
    {
      "title": "Open directory in an arbitrary terminal",
      "level": 3,
      "content": "It is possible to open a directory in a terminal emulator with \"Open with...\" right click menu entry. But the XDG desktop entry of the terminal is expected to contain appropriate Exec and MimeType values.\n\nFollowing example shows how to create additional desktop entry for Alacritty terminal emulator which will be recognized by \"Open with...\".\n\n```\n~/.local/share/applications/alacritty-directory.desktop\n```\n\n```\n[Desktop Entry]\nType=Application\n\n# Flag `working-directory` takes argument\nExec=alacritty --working-directory %f\n# MimeType contains special type `inode/directory;`\nMimeType=inode/directory;\n\nIcon=Alacritty\nTerminal=false\nCategories=System;TerminalEmulator;\nName=Open in Alacritty\nGenericName=Terminal\nStartupNotify=true\nStartupWMClass=Alacritty\n```\n\nRun update-desktop-database ~/.local/share/applications/ to apply changes.\n\nIf a terminal app became default file manager, it can be fixed with command xdg-mime default org.gnome.Nautilus.desktop inode/directory.\n\nCheck flags and desktop entry file of your preferred terminal application to adopt the example.\n\n"
    }
  ]
}