{
  "title": "Gnome (Italiano)",
  "url": "https://wiki.archlinux.org/title/Gnome_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nArticoli correlati\n\n- Desktop environment\n- GTK\n- GDM\n- GNOME/Files\n- GNOME/Gedit\n- GNOME/Web\n- GNOME/Evolution\n- GNOME_(Italiano)/Tips_and_tricks_(Italiano)\n- GNOME_(Italiano)/Troubleshooting_(Italiano)\n- GNOME/Flashback\n- GNOME/Keyring\n- GNOME/Document viewer\n- Official repositories#gnome-unstable\n\nGNOME(/(ɡ)noʊm/) e un desktop environment che mira ad essere semplice e facile da usare. È stato progettato da The GNOME Project ed è composto interamente da software gratuito e open source. GNOME fa parte del GNU Project. La visualizzazione predefinita è Wayland invece di Xorg, con le seguenti sessioni standard:\n\n- GNOME, la sessione predefinita basata sulla GNOME Shell su Wayland. Le varie applicazioni X possono essere utilizzate tramite XWayland.\n- GNOME Classic offre un \"esperienza tradizionale[link interrotto 2024-12-15]\" con un'interfaccia simile a GNOME 2. Per questo scopo viene con una serie di estensioni e impostazioni; in questo senso è più una versione personalizzata della GNOME Shell che una modalità di GNOME vera e propria.\n- GNOME su Xorg utilizza la GNOME Shell con Xorg.\n\n"
    },
    {
      "title": "Installazione",
      "level": 2,
      "content": "Sono disponibili due gruppi:\n\n- gnome ha il desktop di base e delle applicazioni integrate.\n- gnome-extra contiene applicazioni per GNOME, tra cui un client di posta elettronica, un client IRC, GNOME Tweaks, dei giochi, strumenti di sviluppo e una serie di impostazioni di personalizzazioni. Questo gruppo estende le funzionalità del gruppo di pacchetti gnome.\n\nIl desktop di base è composto da GNOME Shell, un plugin per il Mutter window manager. Può essere installato separatamente con gnome-shell.\n\n"
    },
    {
      "title": "Versioni instabili",
      "level": 3,
      "content": "Vedere Official repositories#gnome-unstable.\n\n"
    },
    {
      "title": "Avvio",
      "level": 2,
      "content": "GNOME può essere avviato graficamente con un display manager o manualmente dalla console (alcune funzioni potrebbero non essere presenti). Il display manager incluso in gnome è GDM.\n\n"
    },
    {
      "title": "Ambienti Grafici",
      "level": 3,
      "content": "Se si ha installato il gruppo gnome e si desidera lanciare il desktop automaticamente, si abiliti il servizio gdm.service. Così si può selezionare la sessione che si preferisce: GNOME , GNOME Classic o GNOME su Xorg dal menu della sessione del display manager. Si noti che GNOME Classic appare soltanto se è presentemente installato il pacchetto gnome-shell-extensions. La sessione Wayland può essere abilitata o disabilitata nella configurazione di GDM.\n\nSe si preferisce invece lanciare GNOME immediatamente (evitando un reboot), si lanci il servizio gdm.service menzionato in precedenza, da un tty non occupato.\n\n"
    },
    {
      "title": "Xorg sessioni",
      "level": 4,
      "content": "- Per la sessione GNOME su Xorg, si aggiunga al file ~/.xinitrc (Vedere qui per dettagli): export XDG_SESSION_TYPE=x11 export GDK_BACKEND=x11 exec gnome-session\n- Per la sessione GNOME Classic, si aggiunga al file ~/.xinitrc : export XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME export GNOME_SHELL_SESSION_MODE=classic exec gnome-session --session=gnome-classic\n\n```\nexport XDG_SESSION_TYPE=x11\nexport GDK_BACKEND=x11\nexec gnome-session\n```\n\n```\nexport XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME\nexport GNOME_SHELL_SESSION_MODE=classic\nexec gnome-session --session=gnome-classic\n```\n\nDopo aver modificato il file ~/.xinitrc , GNOME può essere lanciato con il comando startx (vedere xinitrc per ulteriori dettagli, come preservare la sessione di logind). Dopo aver impostato il file~/.xinitrc a cui può anche essere organizzato Start X at login, ad es. su tty2 aggiungendo sul file.bash_profile:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty2; ]]; then\n  XDG_SESSION_TYPE=x11 GDK_BACKEND=x11 exec startx\nfi\n```\n\n"
    },
    {
      "title": "Wayland sessioni",
      "level": 4,
      "content": "- Un server X: fornito da xorg-xwayland<-pacchetto, e ancora necessario per eseguire applicazioni che non sono ancora state trasferite aWayland. Applicazioni che utilizzano determinate librerie grafiche, ad esempio Qt, può essere costretto a utilizzare Wayland impostando le variabili di ambiente. Vedere Wayland#GUI libraries per maggiori informazioni.\n- Quando si utilizza il driver proprietario NVIDIA, non-Wayland-native le applicazioni soffrono di scarse prestazioni a causa della mancanza di accellerazione hardware su Xwayland. Questo è expected da risolvere nella primavera del 2020, ma non esiste una linea temporale impegnata da NVIDIA.\n\nÈ possibile avviare manualmente una sessione Wayland con\n\n```\nXDG_SESSION_TYPE=wayland dbus-run-session gnome-session\n```\n\nEseguire gnome-shell --wayland direttamente non è consigliabile perché non offre la gestione delle sessioni.\n\nSo noti che l'avvio manuale di Gnome non richiede gdm (e dunque il servizio gdm.servizi che l'accompagna), per cui è possibile tenere un'installazione minima di Gnome, con soltanto un paio di pacchetti invece dell'intero gruppo gnome.\n\nPer avviare Gnome una volta effettuato il login su tty1, si aggiunga quanto segue al file .bash_profile poiché non tutte le applicazioni (per esempio Firefox e QT) rispettano XDG_SESSION_TYPE:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty1 && $XDG_SESSION_TYPE == tty ]]; then\n  MOZ_ENABLE_WAYLAND=1 QT_QPA_PLATFORM=wayland XDG_SESSION_TYPE=wayland exec dbus-run-session gnome-session\nfi\n```\n\n"
    },
    {
      "title": "Applicazioni GNOME in Wayland",
      "level": 3,
      "content": "Quando viene utilizzata la sessione GNOME, le applicazioni GNOME verranno eseguite utilizzando Wayland.\n\nPer i casi di debug, i manuali di GTK3 e GTK4 vi elencano le opzioni e le variabili di ambiente.\n\n"
    },
    {
      "title": "Navigazione",
      "level": 2,
      "content": "Per sapere come usare la shell GNOME leggi in modo efficace il file GNOME Shell Cheat Sheet; evidenzia le funzionalità della shell GNOME e le scorciatoie da tastiera. Le funzioni includono il cambio di attività, l'uso della tastiera, il controllo della finestra, il pannello, la modalità panoramica e altro ancora. Alcune delle scorciatoie sono:\n\n- Super+m: mostra l'elenco delle notifiche\n- Super+a: mostra griglia dell'applicazione\n- Alt+Tab: ciclo di applicazioni attive\n- Alt+` ( la chiave sopra Tab sui layout di tastiera degli Stati Uniti): ciclo di finestre dell'applicazione in primo piano\n- Alt+F2, digita r o restart: riavviare la shell in caso di problemi grafici della shell (solo in X/modalità legacy, non in modalità Wayland).\n\nVedere Tips_and_tricks#Navigation per modificare le impostazioni predefinite e per impostare il meccanismo di cambio di finestra simile a quello in Windows.\n\nVedere Keyboard navigation[link interrotto 2024-12-15] per più scorciatoie.\n\n```\n$ gsettings set org.gnome.shell.app-switcher current-workspace-only true\n```\n\n"
    },
    {
      "title": "Nomi legacy",
      "level": 2,
      "content": "Table content:\nCurrent | Legacy\nFiles | Nautilus\nWeb | Epiphany\nText Editor | Gedit\nVideos | Totem\nMain Menu | Alacarte\nDocument Viewer | Evince\nDisk Usage Analyzer | Baobab\nImage Viewer | EoG (Eye of GNOME)\nPasswords and Keys | Seahorse\nGNOME Translation Editor | Gtranslator\n\n"
    },
    {
      "title": "Configurazione",
      "level": 2,
      "content": "Il pannello Impostazioni di sistema GNOME ( gnome-control-center ) e le applicazioni GNOME usano il sistema di configurazione dconf per memorizzare le loro impostazioni.\n\nÈ possibile accedere direttamente al database dconf utilizzando gli strumenti della riga di comando gsettings(1). Ciò consente anche di configurare le impostazioni non esposte dalle interfacce utente. Lo strumento da riga di comando dconf(1) può modificare direttamente il database sottostante, ignorando la convalida. Le variabili di configurazione di gsettings e dconf sono equivalenti, ma sono da dare in formati leggermente diversi: gsettings set mygroup.mysubgroup mysetting myvalue in gsettings e dconf write /mygroup/mysubgroup/mysetting myvalue in dconf.\n\nFino a quando le impostazioni di GNOME 3.24 sono state applicate dal demone delle impostazioni di GNOME (che si trova in /usr/lib/gnome-settings-daemon/gnome-settings-daemon), che poteva essere eseguito al di fuori di una sessione GNOME.\n\nGNOME 3.24 tuttavia ha sostituito il demone delle impostazioni di GNOME con diversi plugin di impostazioni separati /usr/lib/gnome-settings-daemon/gsd- * che sono stati successivamente spostati in /usr/lib/gsd- * . Questi plugin sono ora controllati tramite file desktop in /etc/xdg/autostart (org.gnome.SettingsDaemon.*. Desktop). Per eseguire questi plugin al di fuori di una sessione GNOME ora dovrai copiare/modificare le desktop entries appropriate in ~ /.config/autostart.\n\nLa configurazione viene generalmente eseguita in base all'utente, questa sezione non tratta come creare modelli di configurazione per più utenti.\n\n"
    },
    {
      "title": "Colore",
      "level": 4,
      "content": "Il demone colord legge l'EDID del display ed estrae il profilo colore appropriato. La maggior parte dei profili di colore sono precisi e non è necessaria alcuna impostazione; tuttavia per quelli che non sono precisi, o per i display più vecchi, i profili di colore possono essere inseriti in ~/.local/share/icc/ e indirizzati.\n\n"
    },
    {
      "title": "Luce Notturna",
      "level": 4,
      "content": "GNOME viene fornito con un filtro per la luce blu incorporato simile a Redshift. È possibile abilitare e personalizzare l'ora in cui si desidera abilitare la luce notturna dal menu delle impostazioni del display. Inoltre, puoi modificare la temperatura in kelvin con la seguente impostazione dconf, dove 5000 è un valore di esempio:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.color night-light-temperature 5000\n```\n\n"
    },
    {
      "title": "Data & ora",
      "level": 4,
      "content": "Se il sistema ha un Network Time Protocol daemon configurato, sarà efficace anche per GNOME. La sincronizzazione può essere impostata sul controllo manuale dal menu, se necessario.\n\nGNOME supporta la selezione automatica del fuso orario (può essere abilitato nella sezione Data e ora delle impostazioni di sistema, dato che i servizi di localizzazione sono abilitati (vedere la sezione Privacy delle impostazioni).\n\nPer mostrare la data nella barra in alto, eseguire:\n\n```\n$ gsettings set org.gnome.desktop.interface clock-show-date true\n```\n\nInoltre, per mostrare i numeri delle settimane nel calendario aperto nella barra in alto, eseguire:\n\n```\n$ gsettings set org.gnome.desktop.calendar show-weekdate true\n```\n\n"
    },
    {
      "title": "Applicazioni Predefinite",
      "level": 4,
      "content": "Quando si installa GNOME per la prima volta, è possibile che alcune applicazioni errate gestiscano determinati protocolli. Ad esempio, \"totem\" apre i video anziché VLC che era precedentemente utilizzato. Alcune associazioni possono essere impostate dalle impostazioni di sistema tramite: Dettagli > Applicazioni predefinite .\n\nPer altri protocolli e metodi, vedere Default applications per la configurazione.\n\n"
    },
    {
      "title": "Mouse e touchpad",
      "level": 4,
      "content": "La maggior parte delle impostazioni del touchpad può essere configurata dalle impostazioni di sistema tramite: Dispositivi > Mouse e touchpad .\n\nA seconda del dispositivo, potrebbero essere disponibili altre impostazioni di configurazione, ma non esposte tramite la GUI predefinita. Ad esempio, un touchpad diverso click-method\n\n```\n$ gsettings range org.gnome.desktop.peripherals.touchpad click-method\n```\n\n```\nenum\n'default'\n'none'\n'areas'\n'fingers'\n```\n\nda impostare manualmente:\n\n```\n$ gsettings set org.gnome.desktop.peripherals.touchpad click-method 'fingers'\n```\n\no via gnome-tweaks.\n\n"
    },
    {
      "title": "Ridimensionare finestre con il mouse",
      "level": 4,
      "content": "Si può usare il mouse per spostare le finestre tenendo premuto Super, tenendo cliccato il pulsante sinistro del mouse e muovendo il mouse.\n\nIn aggiunta si può abilitare l'utilizzo del mouse per ridimensionare le finestre, ad esempio tenendo premuto Super, tenendo cliccato il pulsante destro del mouse e muovendo il mouse:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences resize-with-right-button true\n```\n\nSe il tasto Super non dovesse essere gradito, si può anche cambiare il tasto modifier, scegliendo Alt o Ctrl:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences mouse-button-modifier \"'<Alt>'\"\n```\n\n"
    },
    {
      "title": "Rete",
      "level": 4,
      "content": "NetworkManager è lo strumento nativo del progetto GNOME per controllare le impostazioni di rete dalla shell. Installa il pacchetto networkmanager e abilita il servizio NetworkManager.service.\n\nSebbene sia possibile utilizzare qualsiasi altro network manager, NetworkManager fornisce la piena integrazione tramite le impostazioni della rete e dalla shell e un'applet indicatore di stato network-manager-applet (non e richiesto per GNOME).\n\n"
    },
    {
      "title": "Account online",
      "level": 4,
      "content": "Alcuni account online, come ownCloud, richiedono l'installazione di gvfs-goa per la piena funzionalità in applicazioni GNOME come GNOME Files e Documenti GNOME ThreePointSeven/Caratteristiche/ownCloud.\n\nVedi anche Online Accounts[link interrotto 2024-12-15] per più dettagli.\n\n"
    },
    {
      "title": "Ricerca",
      "level": 4,
      "content": "GNOME shell ha una ricerca a cui è possibile accedere rapidamente premendo il tasto Super e iniziando a digitare. Il pacchetto tracker3[broken link: package not found] è installato come dipendenza predefinita di tracker3-miners[broken link: package not found] del gruppo gnome e fornisce un'applicazione di indicizzazione e un database di metadati. Può essere configurato con la voce di menu Ricerca e indicizzazione ; monitorare lo stato con tracker3 status. Viene avviato automaticamente da gnome-session quando l'utente accede. Tracker non cercherà ricorsivamente tutte le directory nella home directory, dunque ci potrebbe essere bisogno di aggiungere altri sentieri personalizzati tramite il menu Search > Search locations. Per escludere una directory dall'indicizzazione si crei un file vuoto .nomedia. Si consulti anche [https://tracker.gnome.org/faq/[link interrotto 2024-10-12] FAQ Tracker}}.\n\nLe impostazioni di ricerca possono anche essere configurate nel pannello \"Impostazioni di sistema\".\n\nSi può vedere lo stato con tracker3 status. L'indicizzazione può essere avviata manualmente con tracker3 daemon -s. Il database Tracker può essere interrogato usando il comando tracker3 sparql. Visualizza la sua pagina di manuale tracker3-sparql(1)[link interrotto 2024-10-13] per maggiori informazioni.\n\n"
    },
    {
      "title": "Impostazioni per la sicurezza del dispositivo",
      "level": 4,
      "content": "Gnome 43 offre un nuovo pannello Sicurezza dispositivo (ing, Device Security) nelle impostazioni. Per il suo funzionamento si richiede fwupd (vedi [1]).\n\n"
    },
    {
      "title": "Impostazioni avanzate",
      "level": 3,
      "content": "Come notato sopra, molte opzioni di configurazione come la modifica del tema GTK o window manager non sono esposte nel pannello Impostazioni di sistema di GNOME ( gnome-control-center ). Gli utenti che desiderano configurare queste impostazioni potrebbero voler usare GNOME Tweaks ( gnome-tweaks), un comodo strumento grafico che espone molte di queste impostazioni.\n\nLe impostazioni GNOME (che sono memorizzate nel database DConf) possono anche essere configurate usando dconf-editor(1) (uno strumento grafico di configurazione DConf) o gsettings strumento da riga di comando. GNOME Tweaks non fa nient'altro sullo sfondo della GUI; nota tuttavia che non troverai tutte le impostazioni descritte nelle seguenti sezioni.\n\n"
    },
    {
      "title": "Estensioni",
      "level": 4,
      "content": "- Le estensioni da extensions.gnome.org possono essere installate dai browser, tuttavia ciò le rende accessibili soltanto ad un certo utente e richiede che vengano reinstallate per ogni aggiornamento importante. Per questo è necessario installare gnome-browser-connector. Non è necessario installare estensioni per il browser.\n- Installare estensioni tramite l'AUR (oppure i repositori ufficiali, se dovessero esservi) le rende accessibili su tutto il sistema e, nel caso si usi un AUR helper, automatizza il processo di aggiornamento.\n\n- Per questo è necessario installare gnome-browser-connector. Non è necessario installare estensioni per il browser.\n\nIl catalogo delle estensioni è disponibile su extensions.gnome.org. Possono essere installati e attivati ​​in un browser impostando l'interruttore nella parte superiore sinistra dello schermo su 'ON' e facendo clic su 'Installa' nella finestra popup (se l'estensione in questione non è installata ). Le estensioni installate sono disponibili all'indirizzo [2], dove è possibile verificare gli aggiornamenti disponibili. Le estensioni installate possono anche essere abilitate o disabilitate con gnome-tweaks.\n\nLa shell GNOME può essere personalizzata con estensioni per utente o a livello di sistema. L'installazione delle estensioni con pacman le rende disponibili per tutti gli utenti del sistema e automatizza il processo di aggiornamento. Il pacchetto gnome-shell-extensions fornisce una serie di estensioni gestite come parte del progetto GNOME (molte delle estensioni incluse sono usate dalla sessione GNOME Classic). Gli utenti che desiderano una barra delle applicazioni ma non desiderano utilizzare la sessione GNOME Classic potrebbero voler abilitare l'estensione \"Elenco finestre\" (fornita dal pacchetto gnome-shell-extensions).\n\nIl pacchetto gnome-shell-extensions offre una serie di estensioni molto utili, parte del GNOME project.\n\nPer abilitare l'utilizzo di estensioni (disabilitato come predefinito), si dia il comando:\n\n```\n$ gsettings set org.gnome.shell disable-user-extensions false\n```\n\nPer elencare le estensioni attualmente abilitate:\n\n```\n$ gsettings get org.gnome.shell enabled-extensions\n```\n\nQuest'ultimo comando potrebbe elencare estensioni che furono rimosse. Per elencare soltanto le estensioni abilitate e installate, si usi:\n\n```\n$ gnome-extensions list --enabled\n```\n\nPer ulteriori informazioni sulle estensioni della shell GNOME, consultare [3].\n\n"
    },
    {
      "title": "Aspetto",
      "level": 4,
      "content": "GNOME usa Adwaita come impostazione predefinita. Per applicare Adwaita-dark solo alle applicazioni GTK 2, utilizzare il seguente link simbolico:\n\n```\n$ ln -s /usr/share/themes/Adwaita-dark ~/.themes/Adwaita\n```\n\nPer selezionare nuovi temi (spostarli nella directory appropriata e) usare GNOME Tweaks o i comandi GSettings elencati di sotto.\n\nPer il tema GTK:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme nome_tema\n```\n\nPer il tema delle icone:\n\n```\n$ gsettings set org.gnome.desktop.interface icon-theme nome_tema\n```\n\nVedere GTK#Themes e Icons#Manually.\n\nPer impostare l'ordine dei pulsanti nella barra del titolo delle finestre (quando si usa i gestori delle finestre Mutter, Metacity) si dia il comando:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences button-layout ':minimize,maximize,close'\n```\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\nheaderbar.default-decoration {\n padding-top: 5px;\n padding-bottom: 5px;\n min-height: 0px;\n font-size: 0.8em;\n}\n\nheaderbar.default-decoration button.titlebutton {\n padding: 0px;\n min-height: 0px;\n}\n```\n\nVedere [4][link interrotto 2023-04-23] per maggiori informazioni.\n\nIl tema della stessa GNOME Shell è configurabile. Per usare un tema Shell, assicurati innanzitutto di aver installato il pacchetto gnome-shell-extensions. Quindi abilitare l'estensione Temi utente , tramite GNOME Tweaks o attraverso la pagina Web GNOME Shell Extensions. I temi della shell possono quindi essere caricati e selezionati usando GNOME Tweaks.\n\nEsistono diversi temi della shell GNOME disponibili nell'AUR, anche se non tutti hanno lo stesso formato. I temi della shell possono anche essere scaricati da gnome-look.org.\n\nLo schema GNOME predefinito non mostra alcuna icona nei menu. Per visualizzare le icone sui menu, immettere il seguente comando.\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xsettings overrides \"{'Gtk/ButtonImages': <1>, 'Gtk/MenuImages': <1>}\"\n```\n\nGli indicatori app possono essere utili per controllare or monitorare certe applicazioni che vengono eseguite dietro alle quinte. Per abilitarli, si installi gnome-shell-extension-appindicator o gnome-shell-extension-appindicator-gitAUR e si faccia ripartire la GNOME Shell. Poi si abiliti l'estensione AppIndicator, oppure si dia il comando:\n\n```\n$ gnome-extensions enable $(gnome-extensions list | grep -m 1 appindicatorsupport)\n```\n\nL'estensione Blur my Shell è un'estensione che aggiunge effetti alla schermata overview e alla shell. Si installi gnome-shell-extension-blur-my-shellAUR o gnome-shell-extension-blur-my-shell-gitAUR per avere l'ultima versione di sviluppo. Questa estensione è molto personalizzabile e si può scegliere di sfocare certe applicazioni.\n\nMolte applicazioni GNOME hanno soltanto gli angoli arrotondati in alto, mentre le finestre legacy hanno tutti e quattro gli angolo \"appuntiti\". Per fare arrotondare tutti e quattro gli angoli, si installi gnome-shell-extension-rounded-window-cornersAUR[broken link: package not found].\n\nL'Alt-Tab in GNOME è molto semplice e non mostra l'anteprima delle finestre selezionate. Si può cambiare la scorciatoia da Switch Applications a Switch Windows nelle impostazioni per fare mostrare le anteprime delle finestre.\n\nSi può anche impiegare l'estensione Coverview Alt-Tab: si tratta di un'estensione che espande la funzionalità Alt-Tab ed aggiunge funzionalità che rendono più facile saltare da applicazione in applicazione. Allo stesso tempo ne abbellisce anche l'aspetto. Si installi gnome-shell-extension-coverflow-alt-tab-gitAUR e si configuri a piacimento.\n\n"
    },
    {
      "title": "Cartelle della griglia delle app",
      "level": 4,
      "content": "Nel 'dconf-editor' vai su org.gnome.desktop.app-cartelle e imposta il valore di folder-children su un array di nomi di cartelle separati da virgola :\n\n```\n['Utilities', 'Sundry']\n```\n\nAggiungi applicazioni usando gsettings:\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ apps \"['alacarte.desktop', 'dconf-editor.desktop']\"\n```\n\nCiò aggiunge le applicazioni alacarte.desktop e dconf-editor.desktop alla cartella Sundry. Questo creerà anche la cartella org.gnome.desktop.app-cartelle.folders.Sundry.\n\nPer nominare la cartella (se non ha un nome che appare nella parte superiore delle applicazioni):\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ name \"Sundry\"\n```\n\nLe applicazioni possono anche essere ordinate per categoria (specificate nel loro file .desktop ):\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ categories \"['Office']\"\n```\n\nSe alcune applicazioni corrispondenti a una categoria non sono desiderate in una determinata cartella, è possibile impostare esclusioni:\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ excluded-apps \"['libreoffice-draw.desktop']\"\n```\n\nPer ulteriori informazioni, consultare [5] e [https: //wiki.gentoo.org/wiki/Gnome_Applications_Folders].\n\n"
    },
    {
      "title": "Avvio automatico",
      "level": 4,
      "content": "GNOME implementa XDG Autostart.\n\ngnome-tweaks consente di gestire le voci di avvio automatico.\n\n"
    },
    {
      "title": "Desktop",
      "level": 4,
      "content": "Per spostare il dash (la barra con le applicazioni) dalla schermata di overview al desktop principale si può installare l'estensione gnome-shell-extension-dash-to-dockAUR.\n\nFino a GNOME 3.28, le icone sul desktop erano fornite da Files che disegnava una finestra trasparente sul desktop contenente le icone. A partire da GNOME 3.28 questa funzionalità è stata rimossa e le icone del desktop non sono più disponibili in GNOME. Le possibili soluzioni alternative includono l'uso di Nemo (un fork di file che ha ancora la funzionalità delle icone del desktop) o l'installazione di gnome-shell-extension-desktop-iconsAUR, che replica la funzionalità dell'icona del desktop disponibile in GNOME 3.26 e prima, ma con alcune piccole differenze. Per ulteriori informazioni, consultare il seguente Arch thread thread.\n\nQuando si imposta lo sfondo della schermata Desktop o Blocco, è importante notare che la scheda Immagini mostrerà solo le immagini che si trovano nella cartella /home/ nome utente /Immagini. Se si desidera utilizzare un'immagine non presente in questa cartella, utilizzare i comandi indicati di seguito.\n\nPer lo sfondo del desktop:\n\n```\n$ gsettings set org.gnome.desktop.background picture-uri 'file:///path/to/my/picture.jpg'\n```\n\nPer lo sfondo della schermata di blocco:\n\n```\n$ gsettings set org.gnome.desktop.screensaver picture-uri 'file:///path/to/my/picture.jpg'\n```\n\nA partire da GNOME 3.34 puoi disabilitarlo con questo:\n\n```\n$ gsettings set org.gnome.desktop.interface enable-hot-corners false\n```\n\no via gnome-tweaks, in Top Bar > Activities Overview Hot Corner\n\nA partire da GNOME 40, il desktop partirà direttamente dalla schermata overview invece del desktop vuoto (come invece succedeva nelle versioni precedenti). Per tornare al comportamento precedente, si installi gnome-shell-extension-no-overviewAUR.\n\nAlternativamente lo si può disabilitare usando gsettings e gnome-shell-extension-dash-to-dockAUR:\n\n```\n$ gsettings set org.gnome.shell.extensions.dash-to-dock disable-overview-on-startup true\n```\n\nVedere la discussione a riguardo [6].\n\n"
    },
    {
      "title": "Storia del clipboard",
      "level": 4,
      "content": "A differenza degli altri desktop environments, GNOME non possiede uno strumento per gestire la history del clipboard. Questa funzionalità può essere introdotta installando gnome-shell-extension-clipboard-indicatorAUR.\n\n"
    },
    {
      "title": "Meteo",
      "level": 4,
      "content": "Per fare mostrare le attuali informazioni meteo in alto nel pannello in un punto a scelta, si installi gnome-shell-extension-openweatherAUR. Queste informazioni meteo sono aggiornate costantemente e mostrano dettagli utili come le condizioni del tempo, la velocità del vento, la pressione, ecc.\n\n"
    },
    {
      "title": "Caratteri",
      "level": 4,
      "content": "I caratteri possono essere impostati per i titoli Window, Interface (applicazioni), Documents e Monospace. Vedere la scheda Font in Tweaks per le opzioni pertinenti.\n\nPer i suggerimenti, sarà probabilmente desiderato RGBA poiché si adatta alla maggior parte dei tipi di monitor e se i caratteri appaiono troppo bloccati riducono i suggerimenti su \"Leggero\" o \"Nessuno\".\n\n"
    },
    {
      "title": "WEBP, miniature",
      "level": 4,
      "content": "Install webp-pixbuf-loader per rendere il visualizzatore di immagini di GNOME (eog) lavorare con le immagini WEBP e aggiungere un thumbnailer che crea miniature per le immagini WEBP in cui visualizzarleGNOME Files.\n\n"
    },
    {
      "title": "Metodi di input",
      "level": 4,
      "content": "GNOME ha integrato il supporto per input method tramite IBus, solo ibus e il motore del metodo di input desiderato (ad es. ibus-libpinyin per Pinyin intelligente) necessario dopo l'installazione, il motore del metodo di input può essere aggiunto come layout di tastiera nelle Impostazioni internazionali e della lingua di GNOME.\n\n"
    },
    {
      "title": "Consumo energetico",
      "level": 4,
      "content": "Quando si utilizza un laptop, è possibile che si desideri modificare le seguenti impostazioni:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-timeout 3600\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-timeout 1800\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power power-button-action suspend\n$ gsettings set org.gnome.desktop.lockdown disable-lock-screen true\n```\n\nPer mantenere attivo il monitor quando il coperchio è chiuso:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xrandr default-monitors-setup do-nothing\n```\n\nGNOME 3.24 ha deprecato le seguenti impostazioni:\n\n```\norg.gnome.settings-daemon.plugins.power button-hibernate\norg.gnome.settings-daemon.plugins.power button-power\norg.gnome.settings-daemon.plugins.power button-sleep\norg.gnome.settings-daemon.plugins.power button-suspend\norg.gnome.settings-daemon.plugins.power critical-battery-action\n```\n\nIl pannello delle impostazioni di GNOME non offre all'utente la possibilità di modificare l'azione attivata quando il coperchio del laptop è chiuso. Tuttavia gnome-tweaks può sovrascrivere l'impostazione applicata da systemd. Nella scheda Generale disattiva l'interruttore Sospendi quando il coperchio del laptop è chiuso . Quindi il sistema non \"Sospende su RAM (S3)\" alla chiusura del coperchio.\n\nPer modificare l'azione dell'interruttore del coperchio a livello di sistema, assicurarsi che l'impostazione sopra descritta sia 'non disattivata' e modificare le impostazioni del sistema in /etc/systemd/logind.conf. Per disattivare la sospensione alla chiusura del coperchio, impostare HandleLidSwitch = ignore, come descritto in Power management#ACPI events.\n\nIl pannello delle impostazioni non fornisce un'opzione per modificare l'azione del livello di batteria critica. Queste impostazioni sono state rimosse anche da dconf. Ora sono gestiti da upower. Modifica le impostazioni di potenziamento in /etc/UPower/UPower.conf. Trova queste impostazioni e adatta alle tue esigenze.\n\n```\n/etc/UPower/UPower.conf\n```\n\n```\nPercentageLow=10\nPercentageCritical=3\nPercentageAction=2\nCriticalPowerAction=HybridSleep\n```\n\n"
    },
    {
      "title": "Screencast",
      "level": 4,
      "content": "Lo strumento di screenshot di GNOME viene senza l'opzione Screencast. Si installi la dipendenza facoltativa gst-plugin-pipewire (di gnome-shell) per rendere possibile la cattura video dello schermo.\n\n"
    },
    {
      "title": "Utilizza un gestore finestre diverso",
      "level": 3,
      "content": "GNOME Shell non permette l'uso di un window manager diverso, tuttavia GNOME Flashback fornisce sessioni per Metacity e Compiz. Inoltre, è possibile definire le proprie custom GNOME sessions che utilizzano componenti alternativi.\n\nCon Wayland, la sostituzione della GNOME Shell con un compositore diverso può fare sì che certe sezioni del gnome-control-center (ovvero delle impostazioni di GNOME) appaiano incorrettamente. gnome-control-center funzionerà comunque, ma poiché mutter (la GNOME Shell) non sarà presente, non potrà fornire le impostazioni per queste sezioni, per cui esse o non appariranno proprio, oppure saranno prive di effetto. Tra le sezioni in questione ci sarebbero bluetooth, display, mouse/touchpad e potenzialmente altre.\n\n"
    },
    {
      "title": "Link esterni",
      "level": 2,
      "content": "- Sito ufficiale\n- Contribuire a GNOME, richiedere funzionalità, comunicare bugs, code sorgente\n- Articolo su Wikipedia\n- Estensioni per la GNOME-Shell\n- GNOME Shell Cheat Sheet\n- Personalizzazione (temi, icone...): Personalizza GNOME GNOME Look\n- GNOME applications: Indice App di GNOME Wikipedia:GNOME Core Applications\n- GNOME Source/Mirrors: GitLab di GNOME Mirror GitHub di GNOME Github\n\n- Personalizza GNOME\n- GNOME Look\n\n- Indice App di GNOME\n- Wikipedia:GNOME Core Applications\n\n- GitLab di GNOME\n- Mirror GitHub di GNOME Github\n\n"
    }
  ]
}