{
  "title": "GNOME (ไทย)",
  "url": "https://wiki.archlinux.org/title/GNOME_(%E0%B9%84%E0%B8%97%E0%B8%A2)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- GTK\n- GDM\n- GNOME/Tips and tricks\n- GNOME/Troubleshooting\n- GNOME/Files\n- GNOME/Gedit\n- GNOME/Web\n- GNOME/Evolution\n- GNOME/Flashback\n- GNOME/Keyring\n- GNOME/Document viewer\n- Official repositories#gnome-unstable\n\nGNOME (/(ɡ)noʊm/) is a desktop environment that aims to be simple and easy to use. It is designed by The GNOME Project and is composed entirely of free and open-source software. The default display is Wayland instead of Xorg and the available sessions are\n\n- GNOME, the default, runs GNOME Shell on Wayland. Traditional X applications are run through Xwayland.\n- GNOME Classic provides a \"traditional desktop experience\" (with an interface similar to GNOME 2) by using certain extensions and values. Thus, it is a customized form of GNOME Shell rather than a truly distinct mode.\n- GNOME on Xorg runs GNOME Shell using Xorg.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Two package groups are available:\n\n- gnome contains the base GNOME desktop and the well-integrated core applications;\n- gnome-extra contains further GNOME applications, including an email client, an IRC client, GNOME Tweaks, a set of games and development tools. Note that this group builds on the gnome group.\n\nThe base desktop consists of GNOME Shell, a plugin for the Mutter window manager. It can be installed separately with gnome-shell.\n\nUnstable releases can also be used, see Official repositories#gnome-unstable.\n\n"
    },
    {
      "title": "Starting",
      "level": 2,
      "content": "GNOME can be started either graphically with a display manager or manually from the console (some features may be missing). The display manager included in gnome is GDM.\n\n"
    },
    {
      "title": "Graphically",
      "level": 3,
      "content": "If you installed the gnome group and want GNOME to start automatically on next boot, enable gdm.service. You can then select the desired session: GNOME, GNOME Classic (only displayed if gnome-shell-extensions is installed), or GNOME on Xorg from the display manager's session menu. Wayland sessions can be enabled/disabled in the GDM config.\n\nIf you prefer to start GNOME right away, thereby avoiding a reboot, start the aforementioned gdm.service from a graphically unoccupied tty instead.\n\n"
    },
    {
      "title": "Xorg sessions",
      "level": 4,
      "content": "- For the GNOME on Xorg session, add to the ~/.xinitrc file (see [1] for details): export XDG_SESSION_TYPE=x11 export GDK_BACKEND=x11 exec gnome-session\n- For the GNOME Classic session, add to the ~/.xinitrc file: export XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME export GNOME_SHELL_SESSION_MODE=classic exec gnome-session\n\n```\nexport XDG_SESSION_TYPE=x11\nexport GDK_BACKEND=x11\nexec gnome-session\n```\n\n```\nexport XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME\nexport GNOME_SHELL_SESSION_MODE=classic\nexec gnome-session\n```\n\nAfter editing the ~/.xinitrc file, GNOME can be launched with the startx command (see xinitrc for additional details, such as preserving the logind session). After setting up the ~/.xinitrc file, it can also be arranged to Start X at login, e.g. on tty1 by adding to .bash_profile:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty1 ]]; then\n  XDG_SESSION_TYPE=x11 GDK_BACKEND=x11 exec startx\nfi\n```\n\n"
    },
    {
      "title": "Wayland sessions",
      "level": 4,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nManually starting a Wayland session is possible with:\n\n```\n$ XDG_SESSION_TYPE=wayland dbus-run-session gnome-session\n```\n\nRunning gnome-shell --wayland directly is not recommended, because it lacks session management.\n\nNote that manual invocation of Gnome does not require gdm (consequently also the accompanying gdm.service) at all and is thus also accessible for users with a (possibly very) minimal installation of Gnome composing of a selected few packages included in the more inclusive gnome group in accordance to personal preference.\n\nTo start on login to tty1, add the previous line of code to your .bash_profile. Firefox and QT applications do not respect XDG_SESSION_TYPE, so add variables for them as well:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty1 && $XDG_SESSION_TYPE == tty ]]; then\n  MOZ_ENABLE_WAYLAND=1 QT_QPA_PLATFORM=wayland XDG_SESSION_TYPE=wayland exec dbus-run-session gnome-session\nfi\n```\n\n"
    },
    {
      "title": "GNOME applications in Wayland",
      "level": 3,
      "content": "When the GNOME session is used, GNOME applications will be run using Wayland. For debugging cases, https://docs.gtk.org/gtk3/running.html and https://docs.gtk.org/gtk4/running.html list options and environment variables.\n\n"
    },
    {
      "title": "Navigation",
      "level": 2,
      "content": "To learn how to use the GNOME shell effectively, read the GNOME Shell Cheat Sheet; it highlights GNOME shell features and keyboard shortcuts. Features include task switching, keyboard use, window control, the panel, overview mode, and more. A few of the shortcuts are:\n\n- Super+m: show notification list\n- Super+a: show application grid\n- Alt+Tab: cycle active applications\n- Alt+` (the key above Tab on US keyboard layouts): cycle windows of the application in the foreground\n- Alt+F2, then enter r or restart: restart the shell in case of graphical shell problems (only in X/legacy mode, not in Wayland mode).\n\nSee /Tips and tricks#Navigation for changes to the default configuration making the window-switching resemble that of Windows.\n\nSee Keyboard navigation for more shortcuts.\n\n"
    },
    {
      "title": "Legacy names",
      "level": 2,
      "content": "Table content:\nCurrent | Legacy\nFiles | Nautilus\nWeb | Epiphany\nText Editor | Gedit\nVideos | Totem\nMain Menu | Alacarte\nDocument Viewer | Evince\nDisk Usage Analyzer | Baobab\nImage Viewer | EoG (Eye of GNOME)\nPasswords and Keys | Seahorse\nGNOME Translation Editor | Gtranslator\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "GNOME Settings (gnome-control-center) and GNOME applications use the dconf configuration system to store their settings.\n\nYou can directly access the dconf database using the gsettings(1) command line tool. This also allows you to configure settings not exposed by the user interfaces. Command line tool dconf(1) can directly modify the underlying database, bypassing validation. The configuration keys of gsettings and dconf are equivalent, but in a slightly different format: gsettings set mygroup.mysubgroup mysetting myvalue in gsettings would be dconf write /mygroup/mysubgroup/mysetting myvalue in dconf.\n\nUp until GNOME 3.24, settings were applied by the GNOME settings daemon (located at /usr/lib/gnome-settings-daemon/gnome-settings-daemon), which could be run outside of a GNOME session.\n\nGNOME 3.24, however, replaced the GNOME settings daemon with several separate settings plugins /usr/lib/gnome-settings-daemon/gsd-* which were later moved to /usr/lib/gsd-*. These plugins are now controlled via desktop files under /etc/xdg/autostart/ (matching org.gnome.SettingsDaemon.*.desktop). To run these plugins outside of a GNOME session, you will now need to copy/edit the appropriate desktop entries to ~/.config/autostart.\n\nThe configuration is usually performed user-specific; this section does not cover how to create configuration templates for multiple users.\n\n"
    },
    {
      "title": "Color",
      "level": 4,
      "content": "The daemon colord reads the display's EDID and extracts the appropriate color profile. Most color profiles are accurate and no setup is required; however, for those that are not accurate, or for older displays, color profiles can be put in ~/.local/share/icc/ and directed to.\n\n"
    },
    {
      "title": "Night Light",
      "level": 4,
      "content": "GNOME comes with a built-in blue light filter similar to Redshift. You can enable and customise the time you want to enable Night Light from the display settings menu. Furthermore, you can tweak the kelvin temperature with the following dconf setting, where 5000 is an example value:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.color night-light-temperature 5000\n```\n\n"
    },
    {
      "title": "Date & time",
      "level": 4,
      "content": "If the system has a configured Network Time Protocol daemon, it will be effective for GNOME as well. The synchronization can be set to manual control from the menu, if required.\n\nGNOME supports automatic time zone selection (can be enabled in Date & Time section of the system settings, given that location services are enabled (see Privacy section of the settings).\n\nTo show the date in the top bar, execute:\n\n```\n$ gsettings set org.gnome.desktop.interface clock-show-date true\n```\n\nAdditionally, to show week numbers in the calendar opened on the top bar, execute:\n\n```\n$ gsettings set org.gnome.desktop.calendar show-weekdate true\n```\n\n"
    },
    {
      "title": "Default applications",
      "level": 4,
      "content": "Upon installing GNOME for the first time, you may find that the wrong applications are handling certain protocols. For example, totem opens videos instead of a previously used VLC. Some of the associations can be set from system settings via Default Applications.\n\nFor other protocols and methods, see Default applications for configuration.\n\n"
    },
    {
      "title": "Mouse and touchpad",
      "level": 4,
      "content": "Most touchpad settings can be set from system settings via Mouse & Touchpad.\n\nDepending on your device, other configuration settings may be available, but not exposed via the default GUI. For example, a different touchpad click-method\n\n```\n$ gsettings range org.gnome.desktop.peripherals.touchpad click-method\n```\n\n```\nenum\n'default'\n'none'\n'areas'\n'fingers'\n```\n\nto be set manually:\n\n```\n$ gsettings set org.gnome.desktop.peripherals.touchpad click-method 'fingers'\n```\n\nor via gnome-tweaks.\n\nBy default, you can use your mouse to move windows by holding down Super, clicking and holding the left mouse button and dragging the mouse around.\n\nAdditionally, you can enable using your mouse to resize windows by holding down Super, clicking and holding the right mouse button and dragging the mouse around:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences resize-with-right-button true\n```\n\nIf you don't like the Super key, you can also change the modifier to something else, like Alt or Ctrl:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences mouse-button-modifier \"'<Alt>'\"\n```\n\n"
    },
    {
      "title": "Network",
      "level": 4,
      "content": "NetworkManager is the native tool of the GNOME project to control network settings from the shell. If you have not already, install the networkmanager package and enable the NetworkManager.service systemd unit.\n\nWhile any other network manager can be used alternatively, NetworkManager provides the full integration via the shell network settings and a status indicator applet network-manager-applet (not required for GNOME).\n\n"
    },
    {
      "title": "Online accounts",
      "level": 4,
      "content": "Some online accounts, such as ownCloud, require gvfs-goa and gvfs-dnssd to be installed for full functionality in GNOME applications such as GNOME Files and GNOME Documents [3].\n\nSee Online accounts for more information.\n\n"
    },
    {
      "title": "Search",
      "level": 4,
      "content": "The GNOME shell has a search that can be quickly accessed by pressing the Super key and starting to type. The localsearch package is installed by default as a dependency of nautilus from the gnome group and provides an indexing application and metadata database. It can be configured with the Search menu item in Settings. It is started automatically by gnome-session when the user logs in.\n\nlocalsearch does not automatically recurse into all directories under the user's home directory, so you may need to add custom paths via the Search > Search locations menu item. To exclude a directory from the indexing, create an empty .nomedia file.\n\nA status is available with localsearch status and the indexed content can be searched (localsearch search --help), edited (localsearch tag --help), or reset from the commandline. See localsearch help and localsearch command --help, or the online help for reference.\n\nThe database uses tinysparql-sql(1) and can also be queried directly, if needed.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 4,
      "content": "GNOME has accessibility settings available via Settings > Accessibility. The main settings may be toggled directly after enabling a top bar icon, but note further settings are available via the sub-menus for Seeing, Hearing, Typing, Pointing and clicking and Zoom. See https://help.gnome.org/users/gnome-help/stable/a11y.html.en for information on them.\n\nAdditionally, a default set of keyboard shortcuts can be set via Settings > Keyboard > View and Customize Keyboard Shortcuts > Accessibility. For example, pressing Alt, Super and 8 toggles zooming.\n\n"
    },
    {
      "title": "Device Security Settings",
      "level": 4,
      "content": "GNOME 43 comes with a new Device Security panel in Settings. This requires fwupd in order to function. See [4].\n\n"
    },
    {
      "title": "Advanced settings",
      "level": 3,
      "content": "As noted above, many configuration options such as changing the GTK theme or the window manager theme are not exposed in GNOME Settings (gnome-control-center). Those users that want to configure these settings may wish to use the GNOME Tweaks (gnome-tweaks), a convenient graphical tool which exposes many of these settings.\n\nGNOME settings (which are stored in the DConf database) can also be configured using the dconf-editor (a graphical DConf configuration tool) or the gsettings command line tool. The GNOME Tweaks does not do anything else in the background of the GUI; note though that you will not find all settings described in the following sections in it.\n\n"
    },
    {
      "title": "Extensions",
      "level": 4,
      "content": "The catalogue of extensions is available at https://extensions.gnome.org, they can be installed either through official repositories (only a few), the AUR or through the browser.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n- Installing extensions through the browser makes them available for the current user only and requires you to manually update each one. This is the easier method. Additionally, if you decided to install extensions from the browser instead, you need to install gnome-browser-connector. It is not required to install extensions from the official repositories or the AUR.\n- Installing extensions through the AUR (or through official repositories, if you find them there) makes them available system-wide (and automates the update process if using an AUR helper).\n\n- Additionally, if you decided to install extensions from the browser instead, you need to install gnome-browser-connector. It is not required to install extensions from the official repositories or the AUR.\n\nInstalled extensions can also be configured, enabled or disabled through a GUI with gnome-extensions-app, from the command line with gnome-extensions(1), or from the browser. In your browser, extensions can be installed then activated in the browser by setting the switch in right top right of the screen to ON and clicking Install on the popup window (if the extension in question is not installed). Installed extensions may be seen at https://extensions.gnome.org/local/, where available updates can be checked.\n\nThe gnome-shell-extensions package provides a set of very useful extensions maintained as part of the GNOME project.\n\nextension-managerAUR is a graphical tool which can also be used to install and remove extensions, as well as enable and disable them, both system-wide and for a user. Prior to using it, consider its list of known issues.\n\nTo enable usage of extensions (disabled by default):\n\n```\n$ gsettings set org.gnome.shell disable-user-extensions false\n```\n\nTo list currently enabled extensions:\n\n```\n$ gsettings get org.gnome.shell enabled-extensions\n```\n\nThe above command may list extensions that have been removed. To only list extensions that are enabled and installed, use gnome-extensions instead:\n\n```\n$ gnome-extensions list --enabled\n```\n\nFor more information about GNOME shell extensions, see https://extensions.gnome.org/about/.\n\n"
    },
    {
      "title": "Appearance",
      "level": 4,
      "content": "GNOME uses Adwaita by default. To apply Adwaita-dark only to GTK 2 applications, use the following symlink:\n\n```\n$ ln -s /usr/share/themes/Adwaita-dark ~/.themes/Adwaita\n```\n\nTo select new themes (move them to the appropriate directory and) use GNOME Tweaks or the GSettings commands below.\n\nFor the GTK theme:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme theme-name\n```\n\nFor the icon theme:\n\n```\n$ gsettings set org.gnome.desktop.interface icon-theme theme-name\n```\n\nSee GTK#Themes and Icons#Icon themes.\n\nTo set the order for the GNOME window manager (Mutter, Metacity):\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences button-layout ':minimize,maximize,close'\n```\n\nThe theme of GNOME Shell itself is configurable. To use a Shell theme, firstly ensure that you have the gnome-shell-extensions package installed. Then enable the User Themes extension, either through the GNOME Extensions application or through the GNOME Shell Extensions webpage. Shell themes can then be loaded and selected using GNOME Extensions.\n\nThere are a number of GNOME Shell themes available in the AUR, many themes do not have the same name format, so instead try searching for the appropriate theme in the AUR. Shell themes can also be downloaded from gnome-look.org.\n\nTo enable AppIndicators, which is useful for controlling/monitoring certain applications running in the background, Install gnome-shell-extension-appindicator or gnome-shell-extension-appindicator-gitAUR, restart the GNOME Shell, then enable the AppIndicator extension in the GNOME Extensions application or by running\n\n```\n$ gnome-extensions enable $(gnome-extensions list | grep -m 1 appindicatorsupport)\n```\n\nThe GNOME shell animation can be sped up, slowed down or disabled. See GNOME/Tips and tricks#Change animation speed.\n\nBlur my Shell is an extension that adds blur effects to the overview screen as well as the shell itself and other apps. Install gnome-shell-extension-blur-my-shellAUR or gnome-shell-extension-blur-my-shell-gitAUR for development updates. This extension is highly customizable, and you may choose to blur certain applications.\n\nThe default Alt-Tab in GNOME is very simple and does not show overviews of the selected windows. You can change the Alt-Tab shortcut from \"Switch Applications\" to \"Switch Windows\" in Settings to show window overviews.\n\nYou can also use Coverflow Alt-Tab. It is an extension that expands the Alt-Tab behavior and adds features to make switching between applications easier while also giving it a better look. Install gnome-shell-extension-coverflow-alt-tab-gitAUR, then you may change the configuration of this extension to your liking.\n\nNote: Super-` provides \"Switch windows of an application` by default.\n\n"
    },
    {
      "title": "Autostart",
      "level": 4,
      "content": "GNOME implements XDG Autostart.\n\nThe gnome-tweaks allows managing autostart-entries.\n\n"
    },
    {
      "title": "Desktop",
      "level": 4,
      "content": "To move the dash out of the overview and turn it into a dock to easily launch and switch applications, install gnome-shell-extension-dash-to-dockAUR.\n\nStarting from GNOME 40, the desktop will start directly into Overview Mode instead of an empty desktop (like in previous versions). To mimic legacy behaviour, one may install gnome-shell-extension-no-overviewAUR.\n\nAlternatively, you can disable it using gsettings if using gnome-shell-extension-dash-to-dockAUR:\n\n```\n$ gsettings set org.gnome.shell.extensions.dash-to-dock disable-overview-on-startup true\n```\n\nSee the discussion at [5].\n\n"
    },
    {
      "title": "Clipboard history",
      "level": 4,
      "content": "Unlike other desktop environments, GNOME does not have a built-in tool to manage the clipboard history. This can be done however with the help of an extension. Install gnome-shell-extension-clipboard-indicatorAUR.\n\n"
    },
    {
      "title": "Weather",
      "level": 4,
      "content": "To display the current weather information in the top panel based on a chosen location, install gnome-shell-extension-openweatherAUR. The weather information is updated in real-time and displays useful data such as conditions, wind speed, pressure, etc...\n\n"
    },
    {
      "title": "Sound input/output device selector",
      "level": 4,
      "content": "Note: **This article or section is being considered for removal.** This article or section is being considered for removal.\n\nThis article or section is being considered for removal.\n\nBy default, if you want to change your sound input or output device or change your microphone's volume, you need to open GNOME Control Center and configure these settings from there. To integrate a device selector and a microphone volume slider, install gnome-shell-extension-sound-output-device-chooserAUR or gnome-shell-extension-sound-output-device-chooser-gitAUR. Further configuration can be done after installation.\n\n"
    },
    {
      "title": "Fonts",
      "level": 4,
      "content": "Fonts can be set for Window titles, Interface (applications), Documents and Monospace. See the Fonts tab in the Tweaks for the relevant options.\n\nFor hinting, RGBA will likely be desired as this fits most monitors types, and if fonts appear too blocked reduce hinting to Slight or None.\n\n"
    },
    {
      "title": "Input methods",
      "level": 4,
      "content": "GNOME has integrated support for input methods through IBus. Only ibus and the wanted input method engine (e.g. ibus-libpinyin for Intelligent Pinyin) needed to be installed. After installation, the input method engine can be added as a keyboard layout under Keyboard > Input Sources in GNOME Settings (gnome-control-center).\n\n"
    },
    {
      "title": "Keyboard Layout quirks",
      "level": 4,
      "content": "If you are using an alternative keyboard layout like Neo2 which uses multiple layers/modifiers, you might need to go to Keyboard > Type Special Characters in GNOME Settings (gnome-control-center) and change the Alternate Characters Key away from Right Alt so that it can be used as a native modifier of the keyboard layout. Setting it to e.g. Left Alt prevents Alt+Tab, so be careful what you change it to. Without this change, your left Mod3 key might work, but the right one (AltGr) does not. (As of 2021-05-18)\n\n"
    },
    {
      "title": "Power",
      "level": 4,
      "content": "When you are using a laptop, you might want to alter the following settings controlling behavior when idle, screen lock power button presses and lid close:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-timeout 3600\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-timeout 1800\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power power-button-action suspend\n$ gsettings set org.gnome.desktop.lockdown disable-lock-screen true\n```\n\nTo keep the monitor active when the lid is closed:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xrandr default-monitors-setup do-nothing\n```\n\nGNOME 3.24 deprecated the following settings:\n\n```\norg.gnome.settings-daemon.plugins.power button-hibernate\norg.gnome.settings-daemon.plugins.power button-power\norg.gnome.settings-daemon.plugins.power button-sleep\norg.gnome.settings-daemon.plugins.power button-suspend\norg.gnome.settings-daemon.plugins.power critical-battery-action\n```\n\nThe settings panel of GNOME does not provide an option for the user to change the action triggered when the laptop lid is closed. To change the lid switch action system-wide, edit the systemd settings in /etc/systemd/logind.conf. To turn off suspend on lid close, set HandleLidSwitch=ignore, as described in Power management#ACPI events.\n\nThe settings panel does not provide an option for changing the critical battery level action. These settings have been removed from dconf as well. They are now managed by upower. Edit the upower settings in /etc/UPower/UPower.conf. Find these settings and adjust to your needs.\n\n```\n/etc/UPower/UPower.conf\n```\n\n```\nPercentageLow=10\nPercentageCritical=3\nPercentageAction=2\nCriticalPowerAction=HybridSleep\n```\n\nInstall the power-profiles-daemon optional dependency (of gnome-control-center) for power profiles support. Explicitly starting/enabling the power-profiles-daemon service is unnecessary since gnome-shell and GNOME Settings both request its activation upon launching.\n\nWhen the service is active, power profiles can be managed through the Power section of GNOME Settings and in the system menu.\n\n"
    },
    {
      "title": "Screencast",
      "level": 4,
      "content": "The built-in screenshot tool comes without the Screencast option by default. Install the gst-plugin-pipewire optional dependency (of gnome-shell) to enable screen recording.\n\n"
    },
    {
      "title": "Use a different window manager",
      "level": 3,
      "content": "GNOME Shell does not support using a different window manager, however GNOME Flashback provides sessions for Metacity and Compiz. Furthermore, it is possible to define your own custom GNOME sessions which use alternative components.\n\nUnder Wayland, replacing GNOME Shell with a different compositor will cause certain sections of gnome-control-center (GNOME Settings) to populate incorrectly. gnome-control-center will work, but since mutter (GNOME Shell) will not be available to provide settings for populating these sections, they will not have an effect or may not populate accurately with your settings. Sections affected are bluetooth, display, and mouse/touchpad to name a few.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Website\n- Contributing to GNOME, feature requests, bugs, code\n- Wikipedia article\n- GNOME-Shell Extensions\n- GNOME Shell Cheat Sheet\n- Customization (themes, icons...): Personalize GNOME GNOME Look\n- GNOME applications: GNOME Apps Index Wikipedia:GNOME Core Applications\n- GNOME Source/Mirrors: GNOME GitLab GNOME Github Mirror\n\n- Personalize GNOME\n- GNOME Look\n\n- GNOME Apps Index\n- Wikipedia:GNOME Core Applications\n\n- GNOME GitLab\n- GNOME Github Mirror\n\n"
    }
  ]
}