{
  "title": "GNOME (Čeština)",
  "url": "https://wiki.archlinux.org/title/GNOME_(%C4%8Ce%C5%A1tina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Související články\n\n- Desktop environment\n- GTK\n- GDM\n- GNOME/Tips and tricks\n- GNOME/Troubleshooting\n- GNOME/Files\n- GNOME/Gedit\n- GNOME/Web\n- GNOME/Evolution\n- GNOME/Flashback\n- GNOME/Keyring\n- GNOME/Document viewer\n- Official repositories#gnome-unstable\n\nGNOME (/(ɡ)noʊm/) je plochové prostředí, jež se snaží být přístupné. Je navrhováno skupinou The GNOME Project a je zcela tvořeno svobodným softwarem. Využívá Wayland místo Xorgu a nabízí relace\n\n- GNOME, standard, spustí GNOME Shell na Waylandu. Tradiční X aplikace se spouštějí přes Xwayland.\n- GNOME Classic poskytuje \"tradiční pracovní plochu[dead link 2024-12-15 ⓘ]\" (s uživatelským rozhraním podobným GNOME 2) užitím rozšíření a nastavení. Proto to je spíše jen poupravená obdoba GNOME Shellu než zcela odlišná volba.\n- GNOME on Xorg spustí GNOME Shell pomocí Xorgu.\n\n"
    },
    {
      "title": "Instalace",
      "level": 2,
      "content": "Dvě skupiny balíčků jsou k dispozici:\n\n- gnome obsahuje základní GNOME plochu a některé dobře integrované aplikace;\n- gnome-extra obsahuje další sadu GNOME aplikací, včetně emailového klientu, IRC klientu, GNOME Tweaks a řadu her. Tato skupina balíčků staví na gnome sadě balíčků.\n\nZákladní plocha se skládá z GNOME Shellu, pluginu pro správce oken Mutter. Může být nainstalován zvlášť skrz gnome-shell.\n\n\"Unstable\" vydání mohou být též použita; vizte Official repositories#gnome-unstable.\n\n"
    },
    {
      "title": "Spouštění",
      "level": 2,
      "content": "GNOME může být spuštěn graficky pomocí displejového správce nebo ručně z konzole (některé vymoženosti ale mohou chybět). Displejový správce, jejž obsahuje gnome, je GDM.\n\n"
    },
    {
      "title": "Grafické",
      "level": 3,
      "content": "Pokud jste nainstalovali gnome sadu balíčků a chcete spustit GNOME mimovolně při dalším spuštění, povolte gdm.service. Můžete si pak vybrat relaci: GNOME, GNOME Classic (zobrazí se pouze, je-li nainstalován balíček gnome-shell-extensions) či GNOME on Xorg. Waylandové relace mohou být povoleny/vypnuty v GDM konfiguračním souboru.\n\nPokud chcete radši spustit GNOME rovnou, abyste se vyhnuli restartu počítače, spusťte již zmíněné gdm.service z tty, jež zrovna není graficky zaneprázdněno.\n\n"
    },
    {
      "title": "Xorg relace",
      "level": 4,
      "content": "- Pro Gnome on Xorg relaci, přidejte do ~/.xinitrc souboru (vizte [1] pro podrobnosti): export XDG_SESSION_TYPE=x11 export GDK_BACKEND=x11 exec gnome-session\n- Pro GNOME Classic relaci, přidejte do ~/.xinitrc souboru: export XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME export GNOME_SHELL_SESSION_MODE=classic exec gnome-session\n\n```\nexport XDG_SESSION_TYPE=x11\nexport GDK_BACKEND=x11\nexec gnome-session\n```\n\n```\nexport XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME\nexport GNOME_SHELL_SESSION_MODE=classic\nexec gnome-session\n```\n\nPo upravení ~/.xinitrc souboru může být GNOME spuštěn skrz startx příkaz (vizte xinitrc pro další poznatky; například jak zachovat logind relaci). Po nastavení ~/.xinitrc souboru můžete též nastavit spuštění X po přihlášení, například na tty1 přidáním do .bash_profile:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty1 ]]; then\n  XDG_SESSION_TYPE=x11 GDK_BACKEND=x11 exec startx\nfi\n```\n\n"
    },
    {
      "title": "Waylandové relace",
      "level": 4,
      "content": "Note: **Pochybuje se o platnosti či přesnosti článku nebo části.** Pochybuje se o platnosti či přesnosti článku nebo části.\n\nPochybuje se o platnosti či přesnosti článku nebo části.\n\nRuční spouštění Waylandové relace je možné skrz XDG_SESSION_TYPE=wayland dbus-run-session gnome-session. Jiná možnost je spustit gnome-shell přímo s wayland možností z kterékoholiv dostupného tty:\n\n```\n$ gnome-shell --wayland\n```\n\nRuční spuštění GNOME nevyžaduje gdm (a tedy také následující gdm.service, tudíž je to přístupná volba pro uživatele s minimální instalací GNOME, jež se skládá jen z velmi mála balíčků z gnome.\n\nK spuštění po přihlášení na tty1 přidejte předchozí řádku kódu do .bash_profile. Firefox a jiné QT aplikace neuznávají XDG_SESSION_TYPE, tudíž pro ně musíte přidat proměnné prostředí též:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty1 && $XDG_SESSION_TYPE == tty ]]; then\n  MOZ_ENABLE_WAYLAND=1 QT_QPA_PLATFORM=wayland XDG_SESSION_TYPE=wayland exec dbus-run-session gnome-session\nfi\n```\n\n"
    },
    {
      "title": "GNOME aplikace ve Waylandu",
      "level": 3,
      "content": "Pokud je užita GNOME relace, GNOME aplikace budou spouštěny pod Waylandem. Pro debugovací případy https://docs.gtk.org/gtk3/running.html a https://docs.gtk.org/gtk4/running.html obsahují seznam možností a proměnných prostředí.\n\n"
    },
    {
      "title": "Navigování",
      "level": 2,
      "content": "Abyste se naučili, jak užívat GNOME Shellu účinně, přečtěte si GNOME Shell Cheat Sheet; popisuje GNOME Shell funkce a klávesové zkratky. Mezi funkce třeba patří přepínaní mezi aktivitami, používání klávesnice, ovládání oken, panel, režim přehledu a více. Některé ze zkratek jsou:\n\n- Super+m: zobraz upozornění\n- Super+a: zobraz mřížku aplikací\n- Alt+Tab: cykluj mezi zapnutými aplikacemi\n- Alt+` (tlačítko nad Tab na US klávesnicích): cykluj okna aplikací v popředí\n- Alt+F2, potom zmáčkněte r nebo restart: restartuj shell v případě, že grafický shell má potíže (pouze v X/legacy režimu, ne ve Waylandovém režimu)\n\nVizte tipy a triky pro změny standardního nastavení, aby přepínaní mezi okny bylo jako na Windowsu.\n\nVizte klávesnicovou navigaci[dead link 2024-12-15 ⓘ] pro více zkratek.\n\n"
    },
    {
      "title": "Legacy jména",
      "level": 2,
      "content": "Table content:\nNynější | Legacy\nFiles | Nautilus\nWeb | Epiphany\nVideos | Totem\nMain Menu | Alacarte\nDocument Viewer | Evince\nDisk Usage Analyzer | Baobab\nImage Viewer | EoG (Eye of GNOME)\nPasswords and Keys | Seahorse\nGNOME Translation Editor | Gtranslator\n\n"
    },
    {
      "title": "Nastavení",
      "level": 2,
      "content": "GNOME Settings (gnome-control-center) a GNOME applications používají dconf konfigurační systém k ukládání nastavení.\n\nMůžete přímo přepisovat dconf databázi skrz konzolový nástroj gsettings(1). To Vám též dovolí měnit nastavení, která se nezobrazují v uživatelském rozhraní. Konzolový nástroj dconf(1) může přímo ovlivnit databázi; vyhýbá se tím validaci.\n\nAž po GNOME 3.24 nastavení bylo aplikováno GNOME Settings daemonem (jenž se nachází v /usr/lib/gnome-settings-daemon/gmone-settings-daemon), jejž bylo možno spustit mimo GNOME relaci.\n\nGNOME 3.24 nahradila GNOME Settings daemona několika rozdílnými pluginy na nastavení /usr/lib/gnome-settings-daemon/gsd-*, jež byly časem přesunuty do /usr/lib/gsd-*. Tyto pluginy se nyní ovládají skrz soubory na ploše pod /etc/xdg/autostart (stejné jako org.gnome.SettingsDaemon.*.desktop). Ke spuštění těchto pluginů mimo GNOME relaci budete muset zkopírovat/přepsat určité desktopové vstupy v ~/.config/autostart.\n\nKonfigurace se často vytváří pro určité uživatele; tato část se nezabývá vytvářením konfigurace pro vícero uživatelů.\n\n"
    },
    {
      "title": "Barvy",
      "level": 4,
      "content": "Daemon colord čte EDID displeje a vybere vhodný barevný profil. Většina barevných profilů je přesně nastavená a nevyžaduje úpravy, nicméně pokud nejsou některé přesné, nebo máte-li starší displej, barevné profily mohou být vloženy do ~/.local/share/icc a můžete k nim nasměrovat.\n\n"
    },
    {
      "title": "Noční Světlo",
      "level": 4,
      "content": "GNOME obsahuje filtr na modré světlo podobné Redshiftu. Můžete jej povolit a vybrat si čas, od kdy chcete povolit Noční Světlo, z displejového nastavení. Též můžete změnit kelvinovou teplotu následujícím dconf nastavenǐm, kde 5000 je příkladná hodnota:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.color night-light-temperature 5000\n```\n\n"
    },
    {
      "title": "Datum & čas",
      "level": 4,
      "content": "Pokud má systém nakonfigurovaný Network Time Protocol daemona, bude provozuschopný pro GNOME též. Sladění může být nastaveno na ruční ovládání z menu, pokud je to nutné.\n\nGNOME nabízí samovolné vybírání časových zón (může být povoleno v Date & Time oddělení systémového nastavení, pokud jsou povoleny polohové služby (vizte Privacy oddělení nastavení)).\n\nK zobrazení datumu na horní liště, zadejte:\n\n```\n$ gsettings set org.gnome.desktop.interface clock-show-date true\n```\n\nAbyste dodatečně zobrazili číslo týdne v otevřeném kalendáři na horní liště, zadejte:\n\n```\n$ gsettings set org.gnome.desktop.calendar show-weekdate true\n```\n\n"
    },
    {
      "title": "Základní aplikace",
      "level": 4,
      "content": "Po prvním nainstalování GNOME možná shledáte, že špatné aplikace se starají o určité protokoly. Například totem otevírá videa namísto VLC. To může být změněno v systémovém nastavení skrz Základní aplikace.\n\nPro jiné protokoly a metody vizte Základní aplikace pro konfiguraci.\n\n"
    },
    {
      "title": "Myš a touchpad",
      "level": 4,
      "content": "Většina touchpadového nastavení může být změněna v systemovém nastavení skrz Myš & Touchpad.\n\nPodle Vašeho zařízení jiná konfigurační nastavení mohou být dostupná, ale nezobrazí se v standardním grafickém rozhraní. Například se nezobrazí jiná touchpadová click-method\n\n```\n$ gsettings range org.gnome.desktop.peripherals.touchpad click-method\n```\n\n```\nenum\n'default'\n'none'\n'areas'\n'fingers'\n```\n\nk ručnímu nastavení:\n\n```\n$ gsettings set org.gnome.desktop.peripherals.touchpad click-method 'fingers'\n```\n\nnebo skrz gnome-tweaks.\n\n"
    },
    {
      "title": "Síť",
      "level": 4,
      "content": "NetworkManager je nástroj GNOME projektu pro ovládání síťového nastavení ze shellu. Nainstalujte networkmanager balíček a povolte NetworkManager.service systemd unit, pokud jste zatím tak neučinili.\n\nZatímco může být použit jakýkoliv jiný správce síťe, NetworkManager poskytuje plnou integraci síťového nastavení a appletu na statusový indikátor network-manager-applet (není potřebný pro GNOME) skrz shell.\n\n"
    },
    {
      "title": "Online účty",
      "level": 4,
      "content": "Některé online účty jako například ownCloud vyžadují, aby byl balíček gvfs-goa nainstalován pro plnou provozuschopnost v GNOME aplikacích jako třeba GNOME Files či GNOME Documents [2].\n\nVizte Online účty[dead link 2024-12-15 ⓘ] pro důkladnější poučení.\n\n"
    },
    {
      "title": "Vyhledávání",
      "level": 4,
      "content": "GNOME shell nabízí vyhledávání, jež můžete využít zmáčknutím Super klávesy. Balíček tracker3[broken link: package not found] je již nainstalován jako součást gnome skupiny balíčků a poskytuje indexování aplikací a metadatové databáze. Může být nastaven skrz Vyhledávání a Indexování menu položku; monitorový status s tracker-control. Spouští se automaticky s gnome-session, když se uživatel přihlásí. Indexování může být ručně zapnuto skrz tracker-control -s. Vyhledávací nastavení může být nakonfigurováno v Nastavení.\n\nTracker databáze může být prohledána skrz tracker-sparql příkaz. Vizte tracker3-sparql(1)[dead link 2024-10-13] pro podrobnosti.\n\n"
    },
    {
      "title": "Pokročilá nastavení",
      "level": 3,
      "content": "Jak bylo zmíněno výše, mnoho konfiguračních možností jako menění vzhledu GTK či správce oken se nezobrazí v GNOME Settings (gnome-control-center). Uživatelé, kteří chtějí pozměnit toto nastavení, by měli využít GNOME Tweaks (gnome-tweaks), užitečný nástroj pro měnění tohoto nastavení skrz grafické rozhraní.\n\nGNOME Settings (jež jsou uložena v DConf databázi) mohou být též pozměněna skrz dconf-editor(1) (grafický DConf konfigurační nástroj) nebo konzolové gsettings. GNOME Tweaks nedělá nic dalšího v pozadí grafického rozhraní; nezapomeňte však že v tom nenajdete všechna nastavení popsaná v následujících odděleních.\n\n"
    },
    {
      "title": "Rozšíření",
      "level": 4,
      "content": "Katalog rozšířeních naleznete na https://extensions.gnome.org. Rozšíření mohou být nainstalována skrz oficiální repozitáře (pouze některá), AUR nebo prohlížeč.\n\nNote: **Pochybuje se o platnosti či přesnosti článku nebo části.** Pochybuje se o platnosti či přesnosti článku nebo části.\n\nPochybuje se o platnosti či přesnosti článku nebo části.\n\n- Instalování rozšíření skrz prohlížeč je povolí pouze pro přihlášeného uživatele a vyžadují ruční aktualizování. Toto je jednodušší způsob. Pokud jste se rozhodli nainstalovat rozšíření skrz prohlížeč, musíte si nainstalovat gnome-browser-connector. Tento balíček není potřebný, pokud stahujete rozšíření z oficiálních repozitářů nebo AUR.\n- Instalování rozšíření skrz AUR (nebo skrz oficiální repozitáře, pokud je tam najdete) je činí systémovými, tudíž budou dostupné všem uživatelům (též to automatizuje aktualizování, používáte-li AUR pomocníka.\n\n- Pokud jste se rozhodli nainstalovat rozšíření skrz prohlížeč, musíte si nainstalovat gnome-browser-connector. Tento balíček není potřebný, pokud stahujete rozšíření z oficiálních repozitářů nebo AUR.\n\nNainstalovaná rozšíření můžete konfigurovat, povolovat či vypínat skrz grafické rozhraní přes gnome-extensions-app, z konzolové řádky skrz gnome-extensions(1) nebo z prohlížeče. Rozšíření mohou být ve Vašem prohlížeči nainstalována a následně spuštěna kliknutím v pravém horním rohu na spínač, jenž se nastaví na stav ON. Pak musíte též zmáčknout Install ve vyskakovacím okně (pokud dané rozšíření ještě není nainstalováno). Již nainstalovaná rozšíření najdete na https://extensions.gnome.org/local/, kde též můžete zkontrolovat aktualizace.\n\nBalíček gnome-shell-extensions poskytuje sadu užitečných rozšíření, o niž se stará GNOME Project.\n\nK vypsání povolených rozšíření:\n\n```\n$ gsettings get org.gnome.shell enabled-extensions\n```\n\nPříkaz výše může vypsat rozšíření, jež byla odstraněna. K vypsání rozšíření, která jsou povolena a současně nainstalována, využijte příkaz gnome-extensions:\n\n```\n$ gnome-extensions list --enabled\n```\n\nPro více informací ohledně GNOME shell rozšíření, vizte https://extensions.gnome.org/about/.\n\n"
    },
    {
      "title": "Vzhled",
      "level": 4,
      "content": "GNOME standardně využívá Adwaita. Pro Adwaita-dark pouze pro GTK 2 aplikace, použijte následující symlink:\n\n```\n$ ln -s /usr/share/themes/Adwaita-dark ~/.themes/Adwaita\n```\n\nK vybrání nových vzhledů (přesuňte je do správné složky a) užijte GNOME Tweaks či GSettings příkazy níže.\n\nPro GTK vzhled:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme theme-name\n```\n\nPro vzhled ikonek:\n\n```\n$ gsettings set org.gnome.desktop.interface icon-theme theme-name\n```\n\nVizte GTK#Themes a Icons#Icon themes.\n\nK nastavení pořadí pro GNOME správce oken (Mutter, Metacity):\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences button-layout ':minimize,maximize,close'\n```\n\nVzhled GNOME Shellu je též nastavitelný. Abyste mohli použít Shell vzhled, prvně se ujistěte, že máte nainstalovaný balíček gnome-shell-extensions. Pak povolte User Themes rozšíření, buď skrz GNOME Extensions aplikaci, nebo skrz GNOME Shell Extensions stránku. Shell vzhledy mohou pak být načteny a vybrány skrz GNOME Extensions.\n\nLze nalézt mnoho GNOME Shell vzhledů na AUR. Mnoho vzhledů nepoužívá stejný formát jmen, tudíž zkuste vyhledat daný vzhled přímo v AUR. Shell vzhledy mohou být též stáhnuty z gnome-look.org.\n\nK povolení app indikátorů, které jsou užitečné pro ovládání či monitorování jednotlivých aplikací, které bězí v pozadí, nainstalujte balíček gnome-shell-extension-appindicator nebo gnome-shell-extension-appindicator-gitAUR, restartujte GNOME Shell a následně povolte app indikátor rozšíření v GNOME Extensions aplikaci či příkazem\n\n```\n$ gnome-extensions enable $(gnome-extensions list | grep -m 1 appindicatorsupport)\n```\n\nBlur my Shell je rozšíření, jež rozmazává obrazovku přehledu, shell samotný a některé aplikace. Nainstalujte gnome-shell-extension-blur-my-shellAUR nebo gnome-shell-extension-blur-my-shell-gitAUR pro aktualizace. Toto rozšíření nabízí širokou škálu nastavení; můžete si vybrat, které aplikace chcete rozmazat.\n\nVětšina GNOME aplikací mají zaoblený vzhled jenom na vrchních rozích, zatímco legacy okna mají všechny čtyři rohy ostré. Pokud chcete mít všechna okna zaoblená ze všech stran, nainstalujte gnome-shell-extension-rounded-window-cornersAUR[broken link: package not found].\n\nZákladní Alt-Tab v GNOME je velmi jednoduchý a nezobrazuje přehledy vybraných oken. Coverflowový Alt-Tab je rozšíření, které přidává nové funkce k Alt-Tab, aby přepínání mezi aplikacemi bylo jednodušší a vypadalo lépe. Nainstalujte gnome-shell-extension-coverflow-alt-tab-gitAUR a pak si nastavte toto rozšíření podle vkusu.\n\n"
    },
    {
      "title": "Autostart",
      "level": 4,
      "content": "GNOME poskytuje XDG Autostart.\n\nBalíček gnome-tweaks povoluje spravování autostart-entries.\n\n"
    },
    {
      "title": "Plocha",
      "level": 4,
      "content": "Aby se dash vyskytoval v aplikační liště, nainstalujte gnome-shell-extension-dash-to-dockAUR.\n\nOd GNOME 40 výše se plocha vždy spustí v přehledu (Overview Mode); nezobrazí již prázdnou plochu, jak to dělávaly starší verze. Chcete-li toto původní chování, nainstalujte si rozšíření \"No overview at start-up\".\n\nVizte diskuzi na [3].\n\n"
    },
    {
      "title": "Historie schránky",
      "level": 4,
      "content": "Na rozdíl od jiných plochových prostředí, GNOME nenabízí žádný zabudovaný nástroj pro spravování historie schránky. Pokud ji chcete spravovat, nainstalujte si rozšíření gnome-shell-extension-clipboard-indicatorAUR.\n\n"
    },
    {
      "title": "Počasí",
      "level": 4,
      "content": "Chcete-li vidět nynější informace o počasí v horní liště na libovolném místě, nainstalujte si gnome-shell-extension-openweatherAUR. Informace o počasí se aktualizují v reálném čase a zobrazují užitečné údaje jako například tlak, rychlost větru, atd.\n\n"
    },
    {
      "title": "Vybírání zařízení pro zvukový vstup/výstup",
      "level": 4,
      "content": "Note: **Pochybuje se o platnosti či přesnosti článku nebo části.** Pochybuje se o platnosti či přesnosti článku nebo části.\n\nPochybuje se o platnosti či přesnosti článku nebo části.\n\nPokud chcete změnit zařízení pro zvukový vstup nebo výstup či změnit hlasitost mikrofonu, musíte otevřít GNOME Control Center a změnit nastavení zde. Pro lepší integraci si nainstalujte gnome-shell-extension-sound-output-device-chooserAUR nebo gnome-shell-extension-sound-output-device-chooser-gitAUR. Po instalaci budete mít k dispozici důkladnější nastavení.\n\n"
    },
    {
      "title": "Fonty",
      "level": 4,
      "content": "Fonty mohou být nastaveny pro názvy oken, rozhraní (aplikací), dokumentů a monospace. Vizte tabulku s fonty v Tweaks pro podstatná nastavení.\n\nPro \"hinting\", RGBA bude vhodné, jelikož se hodí na většinu druhů monitorů; pokud fonty vypadají příliš kostičkovaně, snižte \"hinting\" na Slight nebo None.\n\n"
    },
    {
      "title": "WEBP, náhledy",
      "level": 4,
      "content": "Nainstalujte webp-pixbuf-loader, pokud chcete, aby GNOME prohlížeč fotek dokázal pracovat s WEPB obrázky a aby vytvářel náhledy pro WEBP obrazy, aby byly vidět v GNOME Files.\n\n"
    },
    {
      "title": "Metody zadávání znaků",
      "level": 4,
      "content": "GNOME má integrovanou podporu pro metody zadávání znaků skrz IBus. Je třeba nainstalovat pouze ibus a potřebný engine pro zadávací metodu (například ibus-libpinyin pro Inteligentní Pinyin). Po instalaci můžete přidat engine pro zadávací metodu jako klávesnicové rozložení pod Keyboard > Input Sources v GNOME Settings (gnome-control-center).\n\n"
    },
    {
      "title": "Jiné rozložení kláves",
      "level": 4,
      "content": "Užívate-li jiné rozložení kláves jako například Neo2, jež užívá několika vrstev, budete možná potřebovat zajít do Keyboard > Type Special Characters v GNOME Settings (gnome-control-center) a změnit Alternate Characters Key z Right Alt, abyste tuto klávesu mohli využít jako modifikátor pro dané rozložení. Pokud toto nastavení ale změníte třeba na Left Alt, znemožníte si Alt+Tab, tudíž buďte opatrní. Bez této změny, Vaše Mod3 klávesa by fungovala, ale pravý AltGr ne. (Od 18-05-2021)\n\n"
    },
    {
      "title": "Napájení",
      "level": 4,
      "content": "Pokud používáte notebook, možná budete chtít změnit následující nastavení, jež ovládá, jak se má systém chovat, když u něho nejste, když zmáčknete start nebo uzavřete víko:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-timeout 3600\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-timeout 1800\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power power-button-action suspend\n$ gsettings set org.gnome.desktop.lockdown disable-lock-screen true\n```\n\nAby monitor zůstal zapnutý, když se víko zaklapne:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xrandr default-monitors-setup do-nothing\n```\n\nOd GNOME 3.24 se již nevyužívají příkazy:\n\n```\norg.gnome.settings-daemon.plugins.power button-hibernate\norg.gnome.settings-daemon.plugins.power button-power\norg.gnome.settings-daemon.plugins.power button-sleep\norg.gnome.settings-daemon.plugins.power button-suspend\norg.gnome.settings-daemon.plugins.power critical-battery-action\n```\n\nGNOME panel nastavení neposkytuje možnost, aby uživatel změnil, co se stane po zaklapnutí víka notebooku. Nicméně gnome-tweaks může přepsat nastavení, které aplikuje systemd. V menu General, vypnetě Suspend when laptop lid is closed. Systém se pak neuspí do stavu Suspend to RAM (S3) po zaklapnutí víka.\n\nKe změně chování po uzavření víka systémově, ujistěte se, že nastavení zmíněno výše není vypnuté a pozměňte systemd nastavení v /etc/systemd/logind.config. Pokud chcete vypnout režim spánku po uzavření víka, nastavte HandleLidSwitch=ignore, jak je popsáno v Power management#ACPI events.\n\nPanel nastavení neposkytuje možnost změnit chování při nízké úrovni nabití. Toto nastavení bylo vyjmuto z dconf také. Nyní se spravují skrz upower. Změňte upower nastavení v /etc/UPower/UPower.conf. Vyhledejte si dané nastavení a poupravte jej podle potřeby.\n\n```\n/etc/UPower/UPower.conf\n```\n\n```\nPercentageLow=10\nPercentageCritical=3\nPercentageAction=2\nCriticalPowerAction=HybridSleep\n```\n\nNainstalujte power-profiles-daemon, dobrovolnou závislost gnome-control-center, pro podporu řízení spotřeby. Výslovné spouštění/povolování power-profiles-daemon služy je zbytečné, neboť gnome-shell a GNOME Settings vyžadují aktivaci těchto služeb hned po spuštění.\n\nKdyž je tato služba zapnutá, možnosti napájení mohou být spravovány skrz Power oddělení v GNOME Settings a v systémovém menu.\n\n"
    },
    {
      "title": "Užívání jiného správce oken",
      "level": 3,
      "content": "GNOME Shell nepodporuje používání jiného správce oken, nicméně GNOME Flashback poskytuje relace pro Metacity a Compiz. Též je možné si vytvořit vlastní GNOME relace, které využívají jiné systémové složky.\n\n"
    },
    {
      "title": "Vizte také",
      "level": 2,
      "content": "- Oficiální stránky\n- Přispívání GNOME, žádosti pro nové funkce, hlášení chyb, kód\n- Wikipedia článek\n- GNOME-Shell rozšíření\n- GNOME Shell Cheat Sheet\n- Nastavení (vzhledy, ikonky...): Zosobněte si GNOME GNOME Look\n- GNOME aplikace: GNOME Apps Index Wikipedia:GNOME Core Applications\n- GNOME Source/Mirrors: GNOME GitLab GNOME Github Mirror\n\n- Zosobněte si GNOME\n- GNOME Look\n\n- GNOME Apps Index\n- Wikipedia:GNOME Core Applications\n\n- GNOME GitLab\n- GNOME Github Mirror\n\n"
    }
  ]
}