{
  "title": "GNOME (Português)",
  "url": "https://wiki.archlinux.org/title/GNOME_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Ambiente de desktop\n- GTK\n- GDM\n- GNOME/Tips and tricks\n- GNOME/Troubleshooting\n- GNOME/Files\n- GNOME/Gedit\n- GNOME/Web\n- GNOME/Evolution\n- GNOME/Flashback\n- GNOME/Keyring\n- GNOME/Document viewer\n- GNOME/Software\n- Repositórios oficiais#gnome-unstable\n\nGNOME (/(ɡ)noʊm/) é um ambiente de desktop, ou desktop environment, que visa ser simples e fácil de usar. Ele é projetado por O Projeto GNOME e é composto interiramente de software livre e código aberto. O GNOME é uma parte do Projeto GNU. O display padrão é o Wayland em vez do Xorg.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Dois grupos estão disponíveis:\n\n- gnome contém o ambiente base do GNOME e um subconjunto de aplicativos bem integrados;\n- gnome-extra contém mais aplicativos do GNOME, incluindo um cliente de e-mail, um cliente IRC, Ajustes do GNOME e um conjunto de jogos. Note que esse grupo compila no grupo gnome.\n\nO ambiente base consiste no GNOME Shell, um plug-in para o gerenciador de janelas Mutter. Ele pode ser instalado separadamente com gnome-shell.\n\n"
    },
    {
      "title": "Lançamentos instáveis",
      "level": 3,
      "content": "Veja repositórios oficiais#gnome-unstable.\n\n"
    },
    {
      "title": "Sessões do GNOME",
      "level": 2,
      "content": "GNOME possui três sessões disponíveis, todos usando o GNOME Shell.\n\n- GNOME é o padrão que usa Wayland. Aplicativos X tradicionais são executados pelo Xwayland.\n- GNOME Clássico é uma disposição do ambiente tradicional com uma interface similar à do GNOME 2, usando extensões e parâmetros pré-ativados. [1] Portanto, é mais um GNOME Shell personalizado do que um modo realmente distinto.\n- GNOME sobre Xorg executa o GNOME Shell usando o Xorg.\n\n"
    },
    {
      "title": "Iniciando",
      "level": 2,
      "content": "O GNOME pode ser iniciado tanto graficamente, com um gerenciador de exibição, ou manualmente pelo console (podem faltar alguns recursos). O gerenciador de exibição incluso em gnome é o GDM.\n\n"
    },
    {
      "title": "Graficamente",
      "level": 3,
      "content": "Selecione a sessão: GNOME, GNOME Clássico ou GNOME sobre Xorg a partir do menu de sessões do gerenciador de exibição.\n\n"
    },
    {
      "title": "Sessões Xorg",
      "level": 4,
      "content": "- Para a sessão do GNOME sobre Xorg, adicione ao arquivo ~/.xinitrc (veja aqui para detalhes): export XDG_SESSION_TYPE=x11 export GDK_BACKEND=x11 exec gnome-session\n- Para a sessão do GNOME Clássico, adicione ao arquivo ~/.xinitrc: export XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME export GNOME_SHELL_SESSION_MODE=classic exec gnome-session --session=gnome-classic\n\n```\nexport XDG_SESSION_TYPE=x11\nexport GDK_BACKEND=x11\nexec gnome-session\n```\n\n```\nexport XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME\nexport GNOME_SHELL_SESSION_MODE=classic\nexec gnome-session --session=gnome-classic\n```\n\nApós editar o arquivo ~/.xinitrc, GNOME pode ser iniciado com o comando startx (veja xinitrc para detalhes adicionais, tal como preservar a sessão de logind). Após configurar o arquivo ~/.xinitrc, também é possível ser arranjado para Iniciar X no login,por exemplo no tty2 adicionando ao .bash_profile:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty2; ]]; then\n  XDG_SESSION_TYPE=x11 GDK_BACKEND=x11 exec startx\nfi\n```\n\n"
    },
    {
      "title": "Sessões Wayland",
      "level": 4,
      "content": "- Um servidor X — fornecido pelo pacote xorg-xwayland — ainda é necessário para executar aplicativos que ainda não foram portados para o Wayland. Aplicativos usando certas bibliotecas gráficas, tal como Qt, podem ser forçadas a usar o Wayland definindo variáveis de ambiente. Veja Wayland#Bibliotecas GUI para mais informações.\n- Quando estiver usando o driver proprietário da NVIDIA, aplicativos não nativos de Wayland vão sofrer de um desempenho muito ruim por causa de Xwayland sem aceleração de hardware. Espera-se resolver isso em outuno de 2020, mas ainda não há um cronograma comprometido pela NVIDIA.\n\nIniciar manualmente uma sessão Wayland é possível com XDG_SESSION_TYPE=wayland dbus-run-session gnome-session.\n\nPara iniciar ao autenticar no tty1, adicione o seguinte ao seu .bash_profile porque nem todos os aplicativos respeitam XDG_SESSION_TYPE, adicione uma variável ao firefox e para aplicativos QT:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty1 && $XDG_SESSION_TYPE == tty ]]; then\n   MOZ_ENABLE_WAYLAND=1 QT_QPA_PLATFORM=wayland XDG_SESSION_TYPE=wayland exec dbus-run-session gnome-session\nfi\n```\n\n"
    },
    {
      "title": "Aplicativos do GNOME no Wayland",
      "level": 3,
      "content": "Quando a sessão GNOME é usada, aplicativos do GNOME serão executados usando o Wayland. Para casos de depuração, o manual do GTK lista opções e variáveis de ambiente.\n\n"
    },
    {
      "title": "Navegação",
      "level": 2,
      "content": "Para aprender como usar o GNOME Shell efetivamente, leia a folha de dicas do GNOME Shell; ela realça os recursos e atalhos de teclado do GNOME Shell. Recursos incluem realce de tarefa, uso de teclado, controle de janela, o painel, modo de visão geral e mais. Alguns dos atalhos são:\n\n- Super + m: mostra a lista de notificações\n- Super + a: mostra a grade de aplicativos\n- Alt + Tab: alterna entre aplicativos ativos\n- Alt + ` (a tecla logo acima de Tab nos teclados americanos): alterna entre janelas do aplicativo em primeiro plano\n- Alt + F2, e depois insira r ou restart: reinicia o shell no caso de problemas no shell gráfico (apenas no modo X/legado, não no modo Wayland).\n\nVeja Navegação do teclado para mais atalhos.\n\n```\n$ gsettings set org.gnome.shell.app-switcher current-workspace-only true\n```\n\n"
    },
    {
      "title": "Nomes legados",
      "level": 2,
      "content": "Table content:\nAtual | Legado\nArquivos | Nautilus\nWeb | Epiphany\nVídeos | Totem\nMenu principal | Alacarte\nVisualizador de documentos | Evince\nAnalisador de uso de disco | Baobab\nVisualizador de imagens | EoG (Eye of GNOME)\nChaves e senhas | Seahorse\nEditor de Tradução do GNOME | Gtranslator\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "O painel Configurações do sistema do GNOME (gnome-control-center) e os aplicativos do GNOME usam o sistema de configuração dconf para armazenar suas configurações.\n\nVocê pode acessar diretamente o banco de dados dconf usando as ferramentas de linha de comando gsettings(1). Isso também permite que você alterar as configurações não expostas pelas interfaces de usuário. A ferramenta de linha de comando dconf(1) pode modificar diretamente o banco de dados subjacente, contornando a validação.\n\nAté o GNOME 3.24, as configurações eram aplicadas por um daemon de configurações do GNOME (localizado em /usr/lib/gnome-settings-daemon/gnome-settings-daemon), o qual poderia ser executado fora de uma sessão do GNOME.\n\nGNOME 3.24, porém, substituiu o daemon de configurações do GNOME com diversos outros plug-ins /usr/lib/gnome-settings-daemon/gsd-* separados, os quais posteriormente foram movidos para /usr/lib/gsd-*. Esses plug-ins são agora controlados via arquivos desktop sob /etc/xdg/autostart (org.gnome.SettingsDaemon.*.desktop). Para executar esses plug-ins fora de uma sessão do GNOME, você agora precisará copiar/editar as entradas de desktop apropriadas para ~/.config/autostart.\n\nA configuração geralmente é realizada para cada usuário, essa seção não cobre o como criar modelos de configuração para múltiplos usuários.\n\n"
    },
    {
      "title": "Cor",
      "level": 4,
      "content": "O daemon colord lê o EDID da tela e extrai o perfil de cor apropriado. A maioria dos perfis de cor são precisos e nenhuma configuração é necessária; porém, para aqueles que não forem precisos, ou para telas antigas, perfis de cores podem ser colocadas em ~/.local/share/icc/ e direcionado para ele.\n\n"
    },
    {
      "title": "Luz noturna",
      "level": 4,
      "content": "O GNOME vem com um filtro de luz azul integrado similar ao Redshift. Você pode ativar e personalizar a hora em que deseja ativar o modo Luz norturna no menu de configurações de exibição. Além disso, você pode ajustar a temperatura de kelvin com a seguinte configuração dconf, sendo 5000 um valor de exemplo:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.color night-light-temperature 5000\n```\n\n"
    },
    {
      "title": "Data & hora",
      "level": 4,
      "content": "Se o sistema possuir o daemon de Network Time Protocol configurado, ele será usado pelo GNOME também. A sincronização pode ser definida para controle manual pelo menu, se necessário.\n\nO GNOME possui suporte a seleção automática de fuso horário (pode ser habilitado na seção Data & hora das configurações do sistema, desde que os serviços de localização estejam habilitados (consulte a seção Privacidade das configurações).\n\nPara mostrar a data na barra superior, execute:\n\n```\n$ gsettings set org.gnome.desktop.interface clock-show-date true\n```\n\nAdicionalmente, para mostrar números da semana no calendário aberto na barra superior, execute:\n\n```\n$ gsettings set org.gnome.desktop.calendar show-weekdate true\n```\n\n"
    },
    {
      "title": "Aplicativos padrões",
      "level": 4,
      "content": "Ao instalar o GNOME pela primeira vez, você pode descobrir que os aplicativos errados estão lidando com certos protocolos. Por exemplo, totem abre vídeos em vez de o previamente usado VLC. Algumas das associações podem ser definidas pelas configurações do sistema via: Detalhes > Aplicativos padrões.\n\nPara outros protocolos e métodos, veja Default applications para configuração.\n\n"
    },
    {
      "title": "Mouse e touchpad",
      "level": 4,
      "content": "A maioria das configurações de touchpad podem ser definidos nas configurações do sistema por: Dipositivos > Mouse & touchpad.\n\nDependendo de seu dispositivo, outras configurações podem estar disponíveis, mas não expostas via GUI padrão. Por exemplo, um click-method diferente de touchpad\n\n```\n$ gsettings range org.gnome.desktop.peripherals.touchpad click-method\n```\n\n```\nenum\n'default'\n'none'\n'areas'\n'fingers'\n```\n\na ser definido manualmente:\n\n```\n$ gsettings set org.gnome.desktop.peripherals.touchpad click-method 'fingers'\n```\n\nOu via gnome-tweaks.\n\n"
    },
    {
      "title": "Rede",
      "level": 4,
      "content": "NetworkManager é a ferramenta nativa do projeto GNOME para controlar as configurações de rede pelo Shell. Instale o pacote networkmanager e habilite a unit do systemd NetworkManager.service.\n\nEnquanto qualquer outro gerenciador de rede pode ser usado, NetworkManager fornece a integração completa via configurações de rede shell e um miniaplicativo indicador de status network-manager-applet (não exigido para o GNOME).\n\n"
    },
    {
      "title": "Contas on-line",
      "level": 4,
      "content": "Algumas contas on-line, tal como ownCloud, exige que gvfs-goa esteja instalado par funcionalidade completa nos aplicativos do GNOME tal como GNOME Arquivos e GNOME Documentos [2].\n\n"
    },
    {
      "title": "Pesquisa",
      "level": 4,
      "content": "Note: **Este artigo ou esta seção precisa de tradução.** Este artigo ou esta seção precisa de tradução.\n\nEste artigo ou esta seção precisa de tradução.\n\nO shell do GNOME possui uma pesquisa que possa ser rapidamente acessada pressionando a tecla Super e comece a digitar. O pacote trackerAUR é instalado por padrão como parte do grupo gnome e fornece um aplicativo de indexação e banco de dados de metadados. Ele pode ser configurado com o item de menu Pesquisa e indexação; monitore o status com tracker-control. É iniciado automaticamente pelo gnome-session quando o usuário inicia a sessão. Indexação pode ser iniciada manualmente com tracker-control -s. As configurações de pesquisa também podem ser configuradas no painel Configurações de sistema.\n\nO bando de dados do Tracker pode ser consultado usando o comando tracker-sparql. Veja sua página de manual com tracker-sparql(1)[link inativo 2022-12-10] para mais informações.\n\n"
    },
    {
      "title": "Configurações avançadas",
      "level": 3,
      "content": "Como anotado acima, muitas opções de configuração tal como alterar o tema do GTK ou o tema do gerenciador de janela, não são expostas no painel de Configurações do sistema (gnome-control-center). Aqueles usuários que desejem alterar essas configurações pode desejar usar o Ajustes do GNOME (gnome-tweaks), uma ferramenta gráfica conveniente que expõe muitas das configurações.\n\nConfigurações do GNOME (que são armazenadas no banco de dados DConf) também podem ser alteradas usando o dconf-editor(1) (uma ferramenta gráfica de configuração de DConf) ou a ferramenta de linha de comando gsettings. O Ajustes do GNOME não faz nada no plano de fundo do GUI; note que você não encontrará nela todas as configurações descritas nas seções a seguir.\n\n"
    },
    {
      "title": "Aparência",
      "level": 4,
      "content": "O GNOME usa Adwaita por padrão. Para aplicar Adwaita dark apenas para aplicativos GTK 2, use o link simbólico a seguir:\n\n```\n$ ln -s /usr/share/themes/Adwaita-dark ~/.themes/Adwaita\n```\n\nPara selecionar novos temas (mova-os para o diretório apropriado e) use o Ajustes do GNOME ou os comandos de GSettings abaixo:\n\nPara o tema do GTK:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme nome-do-tema\n```\n\nPara o tema de ícones:\n\n```\n$ gsettings set org.gnome.desktop.interface icon-theme nome-do-tema\n```\n\nVeja GTK (Português)#Temas e Ícones#Manualmente.\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\nheaderbar.default-decoration {\n padding-top: 0px;\n padding-bottom: 0px;\n min-height: 0px;\n font-size: 0.6em;\n}\n\nheaderbar.default-decoration button.titlebutton {\n padding: 0px;\n min-height: 0px;\n}\n```\n\nVeja [3][link inativo 2023-04-23 ⓘ] para mais informações.\n\nPara definir a ordem para o gerenciador de janelas do GNOME (Mutter, Metacity):\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences button-layout ':minimize,maximize,close'\n```\n\n- Instale gnome-shell-extension-gtktitlebar-gitAUR. Remove barras de título de janelas não-GTK maximizadas.\n- Instale gnome-shell-extension-no-title-barAUR ou gnome-shell-extension-no-title-bar-gitAUR. Janelas maximizadas mesclam a barra de título com a barra de atividade, salvando pixels preciosos.\n\n- Instale mutter-hide-legacy-decorationsAUR[link quebrado: package not found]. Isso altera a configuração padrão no gerenciador de janelas, assim como oculta automaticamente a barra de título em aplicativos legados (sem barra de título) quando eles são maximizados ou colados lado a lado na lateral.\n- Instale gnome-shell-extension-pixel-saver-gitAUR ou gnome-shell-extension-pixel-saverAUR. Janelas maximizadas mesclam a barra de título com a barra de atividade, salvando pixels preciosos.\n\nO tema do GNOME Shell em si é configurável. Para usar um tema de Shell, primeiro assegure-se de que você tenha o pacote gnome-shell-extensions instalado. Então, habilite a extensão User Themes, pelo Ajustes do GNOME ou pela página web GNOME Shell Extensions. Temas de shell podem então ser carregadas e selecionadas usando Ajustes do GNOME.\n\nHá vários temas de GNOME Shell disponíveis no AUR. Temas de shell também pode ser baixados do gnome-look.org[link inativo 2024-01-13 ⓘ].\n\nO esquema padrão do GNOME não exibe qualquer ícone nos menus. Para exibir ícones nos menus, execute o seguinte comando.\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xsettings overrides \"{'Gtk/ButtonImages': <1>, 'Gtk/MenuImages': <1>}\"\n```\n\n"
    },
    {
      "title": "Pastas de grade de aplicativos",
      "level": 4,
      "content": "No dconf-editor, navegue para org.gnome.desktop.app-folders e defina o valor de folder-children para um vetor de nomes de pastas separados por vírgula:\n\n```\n['Utilities', 'Sundry']\n```\n\nAdicione aplicativos usando o gsettings:\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ apps \"['alacarte.desktop', 'dconf-editor.desktop']\"\n```\n\nIsso adiciona os aplicativos alacarte.desktop e dconf-editor.desktop à pastas Sundry. Isso também vai criar a pasta org.gnome.desktop.app-folders.folders.Sundry.\n\nPara nomear a pasta (se ela tiver nenhum nome que apareça no tipo dos aplicativos):\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ name \"Sundry\"\n```\n\nOs aplicativos também podem ser ordenados por sua categoria (especificada em seu arquivo .desktop):\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ categories \"['Office']\"\n```\n\nSe determinados aplicativos que corresponderem a uma categoria não forem desejados em uma pasta, exclusões podem ser definidas:\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ excluded-apps \"['libreoffice-draw.desktop']\"\n```\n\nPara mais informações, veja [5] e [6].\n\n"
    },
    {
      "title": "Inicialização automática",
      "level": 4,
      "content": "O GNOME implementa XDG Autostart.\n\nO gnome-tweaks permite gerenciar entradas de \"autostart\".\n\n"
    },
    {
      "title": "Área de trabalho",
      "level": 4,
      "content": "Até o GNOME 3.28, os ícones na área de trabalho eram fornecidos pelo Arquivos, que desenhava uma janela transparente sobre a área de trabalho contendo os ícones. A partir do GNOME 3.28 essa funcionalidade foi removida e os ícones da área de trabalho não estão mais disponíveis no GNOME. Possíveis soluções incluem o uso do Nemo (um fork do Arquivos que ainda possui a funcionalidade de ícones do desktop) ou a instalação do gnome-shell-extension-desktop-iconsAUR, o qual replica a funcionalidade do ícone do desktop disponível no GNOME 3.26 e anteriores, mas com pequenas diferenças. Para mais informações, consulte o seguinte tópico no fórum do Arch.\n\nAo definir o plano de fundo da área de trabalho ou da tela de bloqueio, é importante notar que a aba Imagens são exibirá imagens localizadas na pasta /home/nome-de-usuário/Imagens. Se você deseja usar uma imagem não localizada nesta pasta, use os comandos indicados abaixo.\n\nPara o plano de fundo da área de trabalho:\n\n```\n$ gsettings set org.gnome.desktop.background picture-uri 'file:///caminho/para/minha/imagem.jpg'\n```\n\nPara o plano de fundo da tela de bloqueio:\n\n```\n$ gsettings set org.gnome.desktop.screensaver picture-uri 'file:///caminho/para/minha/imagem.jpg'\n```\n\nA partir do GNOME 3.34, você pode desabilitá-lo desta forma:\n\n```\n$ gsettings set org.gnome.desktop.interface enable-hot-corners false\n```\n\nou por meio de gnome-tweaks, em Barra superior > Canto ativo do panorama de atividades\n\n"
    },
    {
      "title": "Extensões",
      "level": 4,
      "content": "O catálogo de extensões está disponível em extensions.gnome.org. Elas podem ser instaladas e ativadas no navegador definindo o botão no canto superior esquerdo da tela para ON e clicando em Install no diálogo resultante (se a extensão em questão não estiver instalada). Extensões instaladas podem ser vistas em extensions.gnome.org/local, na qual atualizações podem ser verificadas. Extensões instaladas também podem ser habilitadas ou desabilitadas usando gnome-tweaks.\n\nO GNOME Shell pode ser personalizado com extensões por usuário ou por todo o sistema. A instalação de extensões com pacman as disponibiliza para todos os usuários do sistema e automatiza o processo de atualização. O pacote gnome-shell-extensions fornece um conjunto de extensões mantidas como parte do projeto GNOME (muitas das extensões incluídas são usadas pela sessão do GNOME Clássico). Usuários que desejem uma barra de tarefas, mas não desejam usar a sessão do GNOME Clássico, podem querer habilitar a extensão Window list (fornecida pelo pacote gnome-shell-extensions).\n\nPara listar as extensões atualmente habilitadas:\n\n```\n$ gsettings get org.gnome.shell enabled-extensions\n```\n\nPara mais informações sobre as extensões do shell do GNOME, veja [7].\n\n"
    },
    {
      "title": "Fontes",
      "level": 4,
      "content": "Fontes podem ser definidas para Títulos de janelas, Interface (aplicativos), Documentos e Monoespaçada. Veja a aba Fontes no Ajustes para opções relevantes.\n\nPara hinting, RGBA provavelmente é melhor por atender a maioria dos tipos de monitores. Se as fontes aparecerem bloqueadas demais, reduza hinting para Slight ou None.\n\n"
    },
    {
      "title": "WEBP, miniaturas",
      "level": 4,
      "content": "Instale pixbuf-webp-thumbnailerAUR[link quebrado: package not found] para fazer o visualizador de imagens do GNOME (eog) funcionar com imagens de WEBP e adicione um aplicativo que cria miniaturas para imagens WEBP para exibi-las no GNOME Arquivos.\n\n"
    },
    {
      "title": "Métodos de entrada",
      "level": 4,
      "content": "O GNOME possui suporte integrado para métodos de entrada por meio do IBus, só sendo necessário instalar ibus e o motor do método de entrada (ex.: ibus-libpinyin para Intelligent Pinyin); após a instalação, o motor de método de entrada podem ser adicionados como disposição de teclado nas configurações de \"Idioma & região\" do GNOME.\n\n"
    },
    {
      "title": "Energia",
      "level": 4,
      "content": "Quando você está usando um notebook, você pode querer alterar as seguintes configurações:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-timeout 3600\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-timeout 1800\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power power-button-action suspend\n$ gsettings set org.gnome.desktop.lockdown disable-lock-screen true\n```\n\nPara manter o monitor ativo quando a tampa está fechada:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xrandr default-monitors-setup do-nothing\n```\n\nGNOME 3.24 tornou obsoletas as seguintes configurações:\n\n```\norg.gnome.settings-daemon.plugins.power button-hibernate\norg.gnome.settings-daemon.plugins.power button-power\norg.gnome.settings-daemon.plugins.power button-sleep\norg.gnome.settings-daemon.plugins.power button-suspend\norg.gnome.settings-daemon.plugins.power critical-battery-action\n```\n\nO painel de configurações do GNOME não oferece uma opção para o usuário, para alterar a ação acionada quando a tampa do notebook é fechada. No entanto, gnome-tweaks pode sobrescrever a configuração aplicada por systemd. Na aba Geral desative a opção Suspender quando a tampa do notebook é fechada. Assim, o sistema não irá Suspender para a RAM (S3) no fechamento da tampa.\n\nPara alterar a ação da opção de tampa em todo o sistema, certifique-se de que a configuração descrita acima não esteja desativada e edite as configurações do systemd em /etc/systemd/logind.conf. Para desativar a suspensão na tampa, defina HandleLidSwitch=ignore, conforme descrito em Power management (Português)#Eventos ACPI.\n\nO painel de configurações não fornece uma opção para alterar a ação de nível crítico de bateria. Essas configurações foram removidas também do dconf. Eles agora são gerenciados pelo upower. Edite as configurações do upower em /etc/UPower/UPower.conf. Encontre essas configurações e ajuste a suas necessidades.\n\n```\n/etc/UPower/UPower.conf\n```\n\n```\nPercentageLow=10\nPercentageCritical=3\nPercentageAction=2\nCriticalPowerAction=HybridSleep\n```\n\n"
    },
    {
      "title": "Usar um gerenciador de janela diferente",
      "level": 3,
      "content": "GNOME Shell não oferece suporte a usar um gerenciador de janela diferente, porém o GNOME Flashback forence sessões para Metacity e Compiz. Além disso, é possível definir suas próprias sessões GNOME personalizadas que usam componentes alternativos.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Site oficial\n- Artigo do Wikipédia\n- GNOME-Shell Extensions\n- Folha de dicas do GNOME Shell\n- Personalização (temas, ícones...): Personalize GNOME GNOME Look\n- Aplicativos do GNOME: Índice dos aplicativos do GNOME Aplicativos Centrais do GNOME\n- Código-fonte/Espelhos do GNOME: GitLab do GNOME Espelho do GNOME no Github\n\n- Personalize GNOME\n- GNOME Look\n\n- Índice dos aplicativos do GNOME\n- Aplicativos Centrais do GNOME\n\n- GitLab do GNOME\n- Espelho do GNOME no Github\n\n"
    }
  ]
}