{
  "title": "GNOME 3 (Español)",
  "url": "https://wiki.archlinux.org/title/GNOME_3_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-12** \n\nArtículos relacionados\n\n- Entorno de escritorio\n- GTK\n- GDM\n- GNOME/Tips and tricks\n- GNOME/Troubleshooting\n- GNOME/Files\n- GNOME/Gedit (Español)\n- GNOME/Web\n- GNOME/Evolution\n- GNOME/Flashback\n- GNOME/Keyring\n- GNOME/Visor de documentos\n- Official repositories#gnome-unstable\n\nGNOME (/(ɡ)noʊm/) es un entorno de escritorio que pretende ser simple y fácil de utilizar. Está diseñado por el Proyecto GNOME y está compuesto completamente de software libre y de código abierto. GNOME es parte del Proyecto GNU. La pantalla predeterminada es Wayland en lugar de Xorg y las sesiones disponibles son\n\n- GNOME, la opción por defecto, corre el intérprete de órdenes de GNOME en Wayland. Las applicaciones tradicionales de X corren a través de Xwayland.\n- GNOME Clásico proporciona una \"experiencia de escritorio tradicional[enlace roto 2024-12-15]\" (con una interfaz similar a GNOME 2) usando ciertas extensiones y valores. Por ende, es una forma personalizada del intérprte de órdenes de GNOME en lugar de un modo verdaderamente distinto.\n- GNOME en Xorg corre el intérprete de órdenes de GNOME usando Xorg.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Hay disponibles dos grupos de paquetes:\n\n- gnome contiene el escritorio base de GNOME y un subconjunto de aplicaciones [1] bien integradas;\n- gnome-extra contiene aplicaciones GNOME adicionales, incluido un cliente de correo electrónico, un cliente de IRC, Ajustes de GNOME y un conjunto de juegos. Tenga en cuenta que este grupo se basa en el grupo gnome.\n\nEl escritorio base consiste en GNOME Shell, un complemento para el gestor de ventanas Mutter. Se puede instalar por separado con gnome-shell.\n\n"
    },
    {
      "title": "Lanzamientos inestables",
      "level": 3,
      "content": "Véase Official repositories#gnome-unstable.\n\n"
    },
    {
      "title": "Inicio",
      "level": 2,
      "content": "GNOME puede iniciarse gráficamente con un gestor de pantalla o manualmente desde la consola (pueden faltar algunas funciones). El administrador de visualización incluido en gnome es GDM.\n\n"
    },
    {
      "title": "Gráficamente",
      "level": 3,
      "content": "Si instaló el grupo gnome y quiere que se inicie automáticamente en el próximo arranque, active el servicio GDM:\n\n```\n# systemctl enable gdm\n```\n\nLuego puede seleccionar la sesión deseada: GNOME, GNOME Classic (solo se muestra si gnome-shell-extensions estaba instalado), o GNOME en Xorg desde el menú de sesión del gestor. Las sesiones de Wayland pueden ser activadas/desativadas en la configuración de GDM.\n\nSi prefiere iniciar GNOME enseguida, evitando un reinicio, inicie gdm.service desde un tty desocupado:\n\n```\n# systemctl start gdm\n```\n\n"
    },
    {
      "title": "Sesiones de Xorg",
      "level": 4,
      "content": "- Para la sesión de GNOME en Xorg, añada al archivo ~/.xinitrc (véase aquí para los detalles): export XDG_SESSION_TYPE=x11 export GDK_BACKEND=x11 exec gnome-session\n- Para la sesión de GNOME Classic, añada al archivo ~/.xinitrc: export XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME export GNOME_SHELL_SESSION_MODE=classic exec gnome-session\n\n```\nexport XDG_SESSION_TYPE=x11\nexport GDK_BACKEND=x11\nexec gnome-session\n```\n\n```\nexport XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME\nexport GNOME_SHELL_SESSION_MODE=classic\nexec gnome-session\n```\n\nDespués de editar el archivo ~/.xinitrc, se puede iniciar GNOME con el comando startx (véase xinitrc para obtener detalles adicionales, como preservar la sesión de logind). Después de configurar el archivo ~/.xinitrc, también se puede organizar en Inicio automático de X al inicio de sesión, p.e. en tty1 añadiendo a .bash_profile:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty1; ]]; then\n  XDG_SESSION_TYPE=x11 GDK_BACKEND=x11 exec startx\nfi\n```\n\n"
    },
    {
      "title": "Sesiones de Wayland",
      "level": 4,
      "content": "- Todavía es necesario un servidor X para ejecutar aplicaciones que aún no se han portado a Wayland, véase Wayland (Español)#Xwayland para obtener más detalles. Las aplicaciones que utilizan ciertas bibliotecas de gráficos, como Qt, pueden verse obligadas a utilizar Wayland configurando variables de entorno. Véase Wayland (Español)#Bibliotecas GUI para obtener más información.\n- Cuando se utiliza el controlador propietario , las aplicaciones no nativas de Wayland sufren un bajo rendimiento debido a la falta de hardware acelerador Xwayland. Esto se espera que se resuelva en algún momento en el futuro (véase también Wayland (Español)#Xwayland).\n\nEs posible iniciar manualmente una sesión de Wayland con XDG_SESSION_TYPE=wayland dbus-run-session gnome-session.\n\nPara iniciar la sesión en tty1, añada lo siguiente a su .bash_profile ya que no todas las aplicaciones respetan {ic|XDG_SESSION_TYPE}}, añada una variable para aplicaciones Firefox, QT:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty1 && $XDG_SESSION_TYPE == tty ]]; then\n   MOZ_ENABLE_WAYLAND=1 QT_QPA_PLATFORM=wayland XDG_SESSION_TYPE=wayland exec dbus-run-session gnome-session\nfi\n```\n\n"
    },
    {
      "title": "Aplicaciones de GNOME en Wayland",
      "level": 3,
      "content": "Cuando se utiliza la sesión GNOME, las aplicaciones GNOME se ejecutarán utilizando Wayland. Para la depuración, el manual de GTK lista las opciones y las variables de entorno.\n\n"
    },
    {
      "title": "Navegación",
      "level": 2,
      "content": "Para aprender a utilizar GNOME Shell, lea GNOME Shell Cheat Sheet; destaca las características de GNOME Shell y los atajos de teclado. Las funciones incluyen el cambio de tareas, el uso del teclado, el control de la ventana, el panel, el modo de vista general y demás. Algunos de los atajos son:\n\n- Super + m: muestra la lista de notificaciones\n- Super + a: muestra la rejilla de aplicaciones\n- Alt + Tab: cambia entre las aplicaciones activas\n- Alt + º (la tecla sobre Tab en las distribuciones de teclado en español): cambia entre las ventanas de la aplicación en primer plano\n- Alt + F2, luego introduzca r o restart: reinicia el intérprete de órdenes en caso de problemas con el intérprete gráfico (solo en el modo X/legacy, no en el modo Wayland).\n\nVéase navegación por teclado[enlace roto 2024-12-15] para más atajos.\n\n```\n$ gsettings set org.gnome.shell.app-switcher current-workspace-only true\n```\n\n"
    },
    {
      "title": "Nombres heredados",
      "level": 2,
      "content": "Table content:\nActual | Antiguo\nArchivos | Nautilus\nWeb | Epiphany\nVídeos | Tótem\nMenú principal | Alacarte\nVisor de documentos | Evince\nAnalizador de uso de disco | Baobab\nVisor de imágenes | EoG (Ojo de GNOME)\nContraseñas y claves | Seahorse\nEditor de traducciones de GNOME | Gtranslator\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "El panel de configuración del sistema GNOME (gnome-control-center) y las aplicaciones GNOME utilizan el sistema de configuración dconf para almacenar sus configuraciones.\n\nPuede acceder directamente a la base de datos dconf utilizando la herramienta de línea de órdenes gsettings(1). Esto también le permite configurar ajustes no expuestos por las interfaces de usuario. La herramienta de línea de órdenes dconf(1) puede modificar directamente la base de datos subyacente, saltándose la validación.\n\nHasta antes de GNOME 3.24 la configuración era aplicada por el demonio de configuración de GNOME (ubicado en /usr/lib/gnome-settings-daemon/gnome-settings-daemon), que podía ejecutarse fuera de una sesión de GNOME.\n\nSin embargo, GNOME 3.24 reemplazó el demonio de configuración de GNOME con varios complementos de configuración separados /usr/lib/gnome-settings-daemon/gsd-* que posteriormente se movieron a /usr/lib/gsd-*. Estos complementos ahora se controlan mediante archivos de escritorio en /etc/xdg/autostart (org.gnome.SettingsDaemon.*.desktop). Para ejecutar estos complementos fuera de una sesión de GNOME, ahora deberá copiar/editar las entradas de escritorio correspondientes a ~/.config/autostart.\n\nLa configuración generalmente se realiza según el usuario, esta sección no trata sobre cómo crear plantillas de configuración para múltiples usuarios.\n\n"
    },
    {
      "title": "Color",
      "level": 4,
      "content": "El demonio colord lee el EDID de la pantalla y extrae el perfil de color apropiado. La mayoría de los perfiles de color son precisos y no se requiere configuración; sin embargo, para aquellos que no son precisos, o para pantallas más antiguas, los perfiles de color se pueden colocar en ~/.local/share/icc/.\n\n"
    },
    {
      "title": "Luz nocturna",
      "level": 4,
      "content": "GNOME viene con un filtro de luz azul incorporado similar a Redshift. Puede activar y personalizar la hora en que desea activar la luz nocturna desde el menú de configuración de pantalla. Además, puede ajustar la temperatura de color (en grados kelvin) con la siguiente configuración dconf, donde 5000 es un valor de ejemplo:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.color night-light-temperature 5000\n```\n\n"
    },
    {
      "title": "Fecha y hora",
      "level": 4,
      "content": "Si el sistema tiene configurado un demonio de protocolo de tiempo de red, también será efectivo para GNOME. La sincronización se puede configurar manualmente desde el menú, si es necesario.\n\nGNOME soporta la selección automática de la zona horaria (se puede activar en la sección Fecha y hora de la configuración del sistema, dado que los servicios de ubicación están activados (véase la sección Privacidad de la configuración).\n\nPara mostrar la fecha en la barra superior, ejecute:\n\n```\n$ gsettings set org.gnome.desktop.interface clock-show-date true\n```\n\nAdemás, para mostrar los números de semana en el calendario desplegado de la barra superior, ejecute:\n\n```\n$ gsettings set org.gnome.desktop.calendar show-weekdate true\n```\n\n"
    },
    {
      "title": "Aplicaciones predeterminadas",
      "level": 4,
      "content": "Al instalar GNOME por primera vez, es posible que las aplicaciones incorrectas estén manejando ciertos protocolos. Por ejemplo, totem abre los vídeos en lugar de VLC utilizado anteriormente. Algunas de las asociaciones se pueden configurar desde la configuración del sistema a través de: Detalles > Aplicaciones predeterminadas.\n\nPara otros protocolos y métodos, véase Aplicaciones predeterminadas para la configuración.\n\n"
    },
    {
      "title": "Ratón y panel táctil",
      "level": 4,
      "content": "La mayoría de las configuraciones del panel táctil se pueden establecer desde la configuración del sistema a través de: Dispositivos > Ratón y «touchpad».\n\nDependiendo de su dispositivo, pueden estar disponibles otros ajustes de configuración, pero no expuestos a través de la GUI predeterminada. Por ejemplo, un click-method del touchpad diferente\n\n```\n$ gsettings range org.gnome.desktop.peripherals.touchpad click-method\n```\n\n```\nenum\n'default'\n'none'\n'areas'\n'fingers'\n```\n\npara ser configurado manualmente:\n\n```\n$ gsettings set org.gnome.desktop.peripherals.touchpad click-method 'fingers'\n```\n\no mediante gnome-tweaks.\n\nPor defecto, puede usar su ratón para mover ventanas manteniendo la tecla Super, pinchando y manteniendo el botón izquierdo del ratón y arrastrando este.\n\nAdemás, puede habilitar el uso del ratón para cambiar el tamaño de las ventanas manteniendo la tecla Super, pinchando y manteniendo presionado el botón derecho del ratón y arrastrando este:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences resize-with-right-button true\n```\n\nSi no le gusta la tecla Super, puede cambiarla a otra tecla como Alt o Ctrl:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences mouse-button-modifier \"'<Alt>'\"\n```\n\n"
    },
    {
      "title": "Red",
      "level": 4,
      "content": "NetworkManager es la herramienta nativa del proyecto GNOME para controlar la configuración de red desde el intérprete. Instale el paquete networkmanager y active la unidad systemd NetworkManager.service.\n\nSi bien también se puede utilizar cualquier otro gestor de red, NetworkManager proporciona la integración completa a través de la configuración de red del intérprete y un applet indicador de estado network-manager-applet (no requerido para GNOME).\n\n"
    },
    {
      "title": "Cuentas en línea",
      "level": 4,
      "content": "Algunas cuentas en línea, como ownCloud, requieren que gvfs-goa esté instalado para una funcionalidad completa en aplicaciones GNOME como Archivos GNOME y Documentos GNOME [2].\n\nVéase Cuentas Online[enlace roto 2024-12-15] para más información.\n\n"
    },
    {
      "title": "Buscador",
      "level": 4,
      "content": "GNOME Shell tiene una búsqueda a la que se puede acceder rápidamente presionando la tecla Super y comenzando a escribir. El paquete tracker3[enlace roto: package not found] se instala de forma predeterminada como dependencia del paquete tracker3-miners[enlace roto: package not found], que hace parte del grupo gnome y proporciona una aplicación de indexación y una base de datos de metadatos. Se puede configurar con el elemento de menú Buscar; controle el estado con tracker3 status. Se inicia automáticamente con gnome-session cuando el usuario inicia sesión. La indexación se puede iniciar manualmente con tracker3 deamon -s. Los ajustes de búsqueda también se puede configurar en el panel Configuración del sistema.\n\nLa base de datos del rastreador se puede consultar utilizando el comando tracker3 sparql. Véase su página de manual tracker3-sparql(1)[enlace roto 2024-10-13] para más información.\n\n"
    },
    {
      "title": "Ajustes de Seguridad de Dispositivos",
      "level": 4,
      "content": "Gnome 43 viene con un nuevo panel de Seguridad de dispositivos en los ajustes. Este requiere el paquete fwupd para poder funcionar. Véase [3].\n\n"
    },
    {
      "title": "Configuración avanzada",
      "level": 3,
      "content": "Como se indicó anteriormente, muchas opciones de configuración, como cambiar el tema GTK o del gestor de ventanas no están expuestas en el panel de configuración del sistema GNOME (gnome-control-center). Es posible que aquellos usuarios que deseen configurar estos ajustes deseen utilizar Retoques de GNOME (gnome-tweaks), una herramienta gráfica que expone muchos de estos ajustes.\n\nLa configuración de GNOME (que se almacena en la base de datos DConf) también se puede configurar utilizando dconf-editor(1) (una herramienta de configuración gráfica de DConf) o la herramienta de línea de órdenes gsettings. Retoques de GNOME no hacen nada más tras la GUI; tenga en cuenta que no encontrará todas las configuraciones descritas en las siguientes secciones.\n\n"
    },
    {
      "title": "Apariencia",
      "level": 4,
      "content": "GNOME utiliza Adwaita por defecto. Para aplicar Adwaita en oscuro solo a aplicaciones GTK 2 utilice el siguiente enlace simbólico:\n\n```\n$ ln -s /usr/share/themes/Adwaita-dark ~/.themes/Adwaita\n```\n\nPara seleccionar nuevos temas (muévalos al directorio apropiado y) utilice Retoques de GNOME o las siguientes órdenes de configuración de GSOME:\n\nPara el tema GTK:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme nombre-tema\n```\n\nPara el tema del icono:\n\n```\n$ gsettings set org.gnome.desktop.interface icon-theme nombre-tema\n```\n\nVéase Temas de GTK e Icons#Manually.\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\nheaderbar.default-decoration {\n padding-top: 5px;\n padding-bottom: 5px;\n min-height: 0px;\n font-size: 0.8em;\n}\n\nheaderbar.default-decoration button.titlebutton {\n padding: 0px;\n min-height: 0px;\n}\n```\n\nVéase [4][enlace roto 2023-04-23] para más información.\n\nPara establecer el orden para el gestor de ventanas de GNOME (Mutter, Metacity):\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences button-layout ':minimize,maximize,close'\n```\n\n- Instale gnome-shell-extension-gtktitlebar-gitAUR. Elimina las barras de título de las ventanas maximizadas que no son GTK.\n- Instale gnome-shell-extension-no-title-bar-gitAUR o gnome-shell-extension-no-title-barAUR. Las ventanas maximizadas obtienen la barra de título fusionada en la barra de actividad.\n\n- Instale mutter-hide-legacy-decorationsAUR[enlace roto: package not found]. Cambia una configuración predeterminada en el gestor de ventanas, a fin de ocultar automáticamente la barra de título en aplicaciones heredadas (sin barra de encabezado) cuando están maximizadas o en mosaico en el lateral.\n- Instale gnome-shell-extension-pixel-saver-gitAUR o gnome-shell-extension-pixel-saverAUR. Las ventanas maximizadas obtienen la barra de título fusionada en la barra de actividad, ahorrando píxeles valiosos.\n\nEl tema de GNOME Shell en sí es configurable. Para utilizar un tema de Shell, primero asegúrese de tener el paquete gnome-shell-extensions instalado. Luego active la extensión Temas de usuario, ya sea a través de Retoques de GNOME o a través de la página web GNOME Shell Extensions. Los temas de Shell se pueden cargar y seleccionar mediante Retoques de GNOME.\n\nHay una serie de temas de GNOME Shell disponibles en AUR. Los temas de shell también se pueden descargar desde gnome-look.org.\n\nEl esquema predeterminado de GNOME no muestra ningún icono en los menús. Para mostrar iconos en los menús, ejecute el siguiente comando.\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xsettings overrides \"{'Gtk/ButtonImages': <1>, 'Gtk/MenuImages': <1>}\"\n```\n\n"
    },
    {
      "title": "Carpetas de la rejilla de aplicaciones",
      "level": 4,
      "content": "En dconf-editor navegue a org.gnome.desktop.app-folder y establezca el valor folder-children a una matriz de nombres de carpetas separados por comas:\n\n```\n['Utilities', 'Sundry']\n```\n\nAñada aplicaciones utilizando gsettings:\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ apps \"['alacarte.desktop', 'dconf-editor.desktop']\"\n```\n\nEsto añade las aplicaciones alacarte.desktop y dconf-editor.desktop a la carpeta Sundry. También se creará la carpeta org.gnome.desktop.app-folder.folders.Sundry.\n\nPara nombrar la carpeta (si no tiene un nombre que aparezca en la parte superior de las aplicaciones):\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ name \"Sundry\"\n```\n\nLas aplicaciones también se pueden ordenar por su categoría (especificada en su archivo .desktop):\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ categories \"['Office']\"\n```\n\nSi ciertas aplicaciones que coinciden con una categoría no se quieren en una carpeta determinada, se pueden establecer exclusiones:\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ excluded-apps \"['libreoffice-draw.desktop']\"\n```\n\nPara más información, véase [6] y [7].\n\n"
    },
    {
      "title": "Inicio automático",
      "level": 4,
      "content": "GNOME implementa XDG Autostart.\n\nEl paquete gnome-tweaks permite administrar las entradas de inicio automático.\n\n"
    },
    {
      "title": "Escritorio",
      "level": 4,
      "content": "Hasta GNOME 3.28, los iconos en el escritorio eran proporcionados por Archivos que dibujaba una ventana transparente sobre el escritorio que contenía los iconos. A partir de GNOME 3.28, esta funcionalidad se ha eliminado y los iconos del escritorio ya no están disponibles. Entre las posibles soluciones se encuentra el uso de Nemo (una bifurcación de Archivos que aún tiene la funcionalidad de los iconos del escritorio) o la instalación de gnome-shell-extension-desktop-iconsAUR que replica la funcionalidad del icono del escritorio disponible en GNOME 3.26 y anteriores, pero con algunas diferencias menores. Para obtener más información, véase el siguiente hilo del foro.\n\nAl configurar el fondo de la pantalla de Escritorio o Bloqueo, es importante tener en cuenta que la pestaña Imágenes solo mostrará las imágenes ubicadas en la carpeta /home/usuario/Imágenes. Si desea usar una imagen que no se encuentra en esta carpeta, utilice las órdenes que se indican a continuación.\n\nPara el fondo del escritorio:\n\n```\n$ gsettings set org.gnome.desktop.background picture-uri 'file:///path/to/my/picture.jpg'\n```\n\nPara el fondo de pantalla de bloqueo:\n\n```\n$ gsettings set org.gnome.desktop.screensaver picture-uri 'file:///path/to/my/picture.jpg'\n```\n\nA partir de GNOME 3.34 puede desactivarlo con esto:\n\n```\n$ gsettings set org.gnome.desktop.interface enable-hot-corners false\n```\n\nO mediante gnome-tweaks, en Top Bar > Activities Overview Hot Corner.\n\n"
    },
    {
      "title": "Extensiones",
      "level": 4,
      "content": "El catálogo de extensiones está disponible en extensions.gnome.org. Se pueden instalar y activar en un navegador configurando el interruptor en la parte superior izquierda de la pantalla en ON y pulsando en Instalar en la ventana emergente (si la extensión en cuestión no está instalada). Las extensiones instaladas se pueden ver en extensions.gnome.org/local, donde se pueden consultar las actualizaciones disponibles. Las extensiones instaladas también se pueden activa o desactivas con gnome-tweaks.\n\nGNOME Shell se puede personalizar con extensiones por cada usuario o para todo el sistema. La instalación de extensiones con pacman hace que estén disponibles para todos los usuarios del sistema y automatiza el proceso de actualización. El paquete gnome-shell-extensions proporciona un conjunto de extensiones mantenidas como parte del proyecto de GNOME (la sesión clásica de GNOME usa muchas de las extensiones incluidas). Los usuarios que desean una barra de tareas pero no quieren utilizar la sesión de GNOME Classic deben activar la extensión Window list (Lista de ventana, proporcionada por el paquete gnome-shell-extensions).\n\nPara listar las extensiones actualmente habilitadas:\n\n```\n$ gsettings get org.gnome.shell enabled-extensions\n```\n\nPara obtener más información sobre las extensiones de GNOME Shell, véase [8].\n\n"
    },
    {
      "title": "Tipografía",
      "level": 4,
      "content": "La tipografía se pueden configurar para títulos de Ventanas, Interfaz (aplicaciones), Documentos y Monoespacio. Véase la pestaña Tipografías en Retoques para las opciones relevantes.\n\nPara las sugerencias, es probable que se desee RGBA ya que esto se ajusta a la mayoría de los tipos de monitores, y si la tipografía aparece demasiado obstruida, reduzca la sugerencia a Ligero o Ninguno.\n\n"
    },
    {
      "title": "WEBP, miniaturas",
      "level": 4,
      "content": "Instale webp-pixbuf-loader para que el visor de imágenes de GNOME (eog) funcione con imágenes WEBP, y añada la capacidad para crear miniaturas para las imágenes WEBP para mostrarlas en el Gestor de archivos de GNOME.\n\n"
    },
    {
      "title": "Métodos de entrada",
      "level": 4,
      "content": "GNOME tiene soporte integrado para los métodos de entrada a través de IBus, solo se necesita instalar ibus y el motor del método de entrada deseado (por ejemplo, ibus-libpinyin para el Pinyin inteligente), después de la instalación, el motor del método de entrada se puede añadir como un diseño de teclado en la Configuración regional y de idioma de GNOME.\n\n"
    },
    {
      "title": "Peculiaridades de la distribución del teclado",
      "level": 4,
      "content": "Si está usando una distribución de teclado alternativa como Neo2 que usa múltiples capas/modificadores, es posible que tenga que ir a Teclado > Escribir caracteres especiales en la Configuración de GNOME (gnome-control-center) y cambiar la Tecla de caracteres alternativos para remplazar Right Alt para que pueda usarse como un modificador nativo de la distribución del teclado. Configurarlo en, por ejemplo, Left Alt evita Alt+Tab, así que tenga cuidado con lo que lo cambia.\n\nSin este cambio, la tecla izquierda Mod3 podría funcionar, pero la derecha (AltGr) no. (A partir del 2021-05-18)\n\n"
    },
    {
      "title": "Energía",
      "level": 4,
      "content": "Cuando está utilizando una computadora portátil, es posible que desee modificar la siguiente configuración:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-timeout 3600\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-timeout 1800\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power power-button-action suspend\n$ gsettings set org.gnome.desktop.lockdown disable-lock-screen true\n```\n\nPara mantener el monitor activo cuando la tapa está cerrada:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xrandr default-monitors-setup do-nothing\n```\n\nGNOME 3.24 desaprobó las siguientes configuraciones:\n\n```\norg.gnome.settings-daemon.plugins.power button-hibernate\norg.gnome.settings-daemon.plugins.power button-power\norg.gnome.settings-daemon.plugins.power button-sleep\norg.gnome.settings-daemon.plugins.power button-suspend\norg.gnome.settings-daemon.plugins.power critical-battery-action\n```\n\nEl panel de configuración de GNOME no ofrece una opción para que el usuario cambie la acción asociada al cerrar la tapa del portátil. Sin embargo gnome-tweaks puede anular la configuración aplicada por systemd. En la pestaña General desactive Suspender cuando la tapa del portátil está cerrada. El sistema no Suspenderá a RAM (S3) al cerrar la tapa.\n\nPara cambiar la acción de la tapa en todo el sistema, asegúrese de que la configuración descrita anteriormente no esté desactivada y edite la configuración de systemd en /etc/systemd/logind.conf. Para desactivar la suspensión al cerrar la tapa, configure HandleLidSwitch=ignore, como se describe en Eventos de ACPI.\n\nEl panel de configuración no proporciona una opción para cambiar la acción del nivel crítico de batería. Estas configuraciones también se han eliminado de dconf. Ahora son gestionados por upower. Edite la configuración de upower en /etc/UPower/UPower.conf. Encuentre estas configuraciones y ajústelos a sus necesidades.\n\n```\n/etc/UPower/UPower.conf\n```\n\n```\nPercentageLow=10\nPercentageCritical=3\nPercentageAction=2\nCriticalPowerAction=HybridSleep\n```\n\nInstale la dependencia opcional power-profiles-daemon (de gnome-control-center) para el soporte de perfiles de energía. Explícitamente iniciar/habilitar el servicio power-profiles-daemon es innecesario ya que gnome-shell y la configuración de GNOME solicitan su activación al iniciarse.\n\nCuando el servicio está activo, los perfiles de energía se pueden administrar a través de la sección Energía de la Configuración de GNOME y en el menú del sistema.\n\nDe manera predeterminada, la herramienta de captura de pantalla incorporada viene sin la opción Screencast. Instale la dependencia opcional gst-plugin-pipewire (de gnome-shell) para habilitar la grabación de pantalla.\n\n"
    },
    {
      "title": "Utilizar un gestor de ventanas diferente",
      "level": 3,
      "content": "GNOME Shell no admite el uso de un gestor de ventanas diferente, sin embargo GNOME Flashback proporciona sesiones para Metacity y Compiz. Además, es posible definir sus propias sesiones personalizadas de GNOME que utilizan componentes alternativos.\n\nEn Wayland, reemplazar GNOME Shell con un compositor diferente hará que ciertas secciones de gnome-control-center (Configuración de GNOME) se rellenen incorrectamente. gnome-control-center funcionará, pero dado que mutter (GNOME Shell) no estará disponible para proporcionar configuraciones para rellenar estas secciones, no tendrán ningún efecto o pueden no completarse con precisión con su configuración. Algunas de las secciones afectadas son bluetooth, pantalla y mouse/panel táctil.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Sitio web oficial\n- Contribuir a GNOME, peticiones, bugs, código\n- Artículo de Wikipedia\n- Extensiones de GNOME-Shell\n- GNOME Shell Cheat Sheet\n- Personalización (temas, iconos...): Personalice GNOME GNOME Look\n- Aplicaciones GNOME: Índice de aplicaciones GNOME Wikipedia:GNOME Core Applications\n- Fuentes/Espejos GNOME: GNOME en GitLab Espejo Github de GNOME\n\n- Personalice GNOME\n- GNOME Look\n\n- Índice de aplicaciones GNOME\n- Wikipedia:GNOME Core Applications\n\n- GNOME en GitLab\n- Espejo Github de GNOME\n\n"
    }
  ]
}