{
  "title": "GNOME/Keyring (Español)",
  "url": "https://wiki.archlinux.org/title/GNOME/Keyring_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nNote: **2020-12-11** \n\nGNOME Keyring (llavero de GNOME) es \"una colección de componentes en GNOME que almacenan secretos, contraseñas, claves, certificados y los ponen a disposición de las aplicaciones\".\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Cuando se utiliza GNOME, gnome-keyring se instala automáticamente como parte del grupo gnome. De lo contrario instale el paquete gnome-keyring. Instale libsecret para permitir que las aplicaciones usen sus llaveros. libgnome-keyring está en desuso, sin embargo, algunas aplicaciones pueden requerirlo.\n\nLas utilidades adicionales relacionadas con el llavero de GNOME incluyen:\n\n- secret-tool — Acceso al llavero de GNOME (y cualquier otro servicio que implemente la API del servicio DBus Secret) desde la línea de órdenes.\n\n- gnome-keyring-query — Proporciona una herramienta simple de línea de órdenes para consultar contraseñas del almacén de contraseñas del llavero de GNOME. (utiliza el obsoleto libgnome-keyring)\n\n"
    },
    {
      "title": "Administrar utilizando la GUI",
      "level": 2,
      "content": "Puede administrar los contenidos del llavero de GNOME utilizando Seahorse. Instálelo con el paquete seahorse.\n\nEs posible dejar la contraseña del llavero de GNOME en blanco o cambiarla. En Seahorse, en el menú desplegable \"Ver\", seleccione \"Por llavero\". En la pestaña Contraseñas, pulse con el botón derecho en \"Contraseñas: iniciar sesión\" y seleccione \"Cambiar contraseña\". Introduzca la contraseña anterior y deje vacía la nueva contraseña. Se le advertirá sobre el uso de almacenamiento no cifrado; continúe presionando \"Usar almacenamiento no seguro\".\n\n"
    },
    {
      "title": "Inicio de sesión automático",
      "level": 4,
      "content": "Si está utilizando el inicio de sesión automático, puede desactivar el gestor de claves configurando una contraseña en blanco en el llavero de inicio de sesión.\n\n"
    },
    {
      "title": "Inicio de sesión de consola",
      "level": 4,
      "content": "Cuando se utiliza el inicio de sesión basado en la consola, el demonio del llavero puede iniciarse mediante PAM o xinitrc. PAM también puede desbloquear el llavero automáticamente al iniciar sesión.\n\nInicie gnome-keyring-daemon desde /etc/pam.d/login:\n\nAñada auth optional pam_gnome_keyring.so al final de la sección auth y session optional pam_gnome_keyring.so auto_start al final de la sección session.\n\n```\n/etc/pam.d/login\n```\n\n```\n#%PAM-1.0\n \nauth       required     pam_securetty.so\nauth       requisite    pam_nologin.so\nauth       include      system-local-login\nauth       optional     pam_gnome_keyring.so\naccount    include      system-local-login\nsession    include      system-local-login\nsession    optional     pam_gnome_keyring.so auto_start\n```\n\nPara SDDM, el archivo /etc/pam.d/sddm ya viene con los cambios necesarios.\n\nA continuación, para GDM, añada password optional pam_gnome_keyring.so al final de /etc/pam.d/passwd.\n\n```\n/etc/pam.d/passwd\n```\n\n```\n#%PAM-1.0\n\n#password\trequired\tpam_cracklib.so difok=2 minlen=8 dcredit=2 ocredit=2 retry=3\n#password\trequired\tpam_unix.so sha512 shadow use_authtok\npassword\trequired\tpam_unix.so sha512 shadow nullok\npassword\toptional\tpam_gnome_keyring.so\n```\n\n- Para utilizar el desbloqueo automático, se debe configurar la misma contraseña para la cuenta de usuario y el llavero.\n- Aún necesitarás el código de abajo en ~/.xinitrc Para exportar las variables de entorno requeridas.\n\nInicie gnome-keyring-daemon desde xinitrc:\n\n```\n~/.xinitrc\n```\n\n```\neval $(/usr/bin/gnome-keyring-daemon --start --components=pkcs11,secrets,ssh)\nexport SSH_AUTH_SOCK\n```\n\nVéase Xfce#SSH agents para utilizarlo en Xfce.\n\n"
    },
    {
      "title": "Con un gestor de pantalla",
      "level": 3,
      "content": "Cuando se utiliza un gestor de pantalla, el llavero funciona de manera inmediata para la mayoría de los casos. Los siguientes gestores de pantalla desbloquean automáticamente el llavero una vez que inicie sesión:\n\n- GDM\n- LightDM\n- LXDM\n- SDDM\n\n"
    },
    {
      "title": "Inicio de sesión automático",
      "level": 4,
      "content": "En GDM, el llavero debe ser nombrado como Login (o el equivalente en su idioma) para ser desbloqueado automáticamente. GNOME creará uno automáticamente con el nombre correcto al iniciar la sesión.\n\nGDM puede desbloquear su llavero si coincide con su contraseña LUKS. Para que esto funcione, necesita utilizar la init de systemd en su mkinitcpio.conf así como los parámetros apropiados del kernel. Véase este hilo de Reddit[1].\n\n"
    },
    {
      "title": "Aplicaciones de terminal",
      "level": 4,
      "content": "Para activar el llavero para las aplicaciones que se ejecutan a través del terminal, como SSH, añada lo siguiente a su ~/.bash_profile, ~/.zshenv, o similar:\n\n```\n~/.bash_profile\n```\n\n```\nif [ -n \"$DESKTOP_SESSION\" ];then\n    eval $(gnome-keyring-daemon --start)\n    export SSH_AUTH_SOCK\nfi\n```\n\n```\n~/.config/fish/config.fish\n```\n\n```\nif test -n \"$DESKTOP_SESSION\"\n    set -x (gnome-keyring-daemon --start | string split \"=\")\nend\n```\n\n"
    },
    {
      "title": "Claves SSH",
      "level": 2,
      "content": "gnome-keyring-daemon con el componente ssh iniciará un agente SSH y cargará automáticamente todas las claves que coincidan con ~/.ssh/id_* con el correspondiente archivo .pub. No hay forma de eliminar estas claves del agente.\n\nPara listar todas las claves cargadas:\n\n```\n$ ssh-add -L\n```\n\nCuando se conecte a un servidor que utiliza una clave cargada con una contraseña, aparecerá un cuadro de diálogo que le pedirá la frase de contraseña. Tiene una opción para desbloquear automáticamente la clave cuando inicia sesión. Si marca esto, ¡no necesitará ingresar su frase de contraseña nuevamente!\n\nPara guardar permanentemente la contraseña en el llavero, utilice ssh-askpass del paquete seahorse:\n\n```\n/usr/lib/seahorse/ssh-askpass my_key\n```\n\nPara añadir manualmente una clave SSH desde otro directorio:\n\n```\n$ ssh-add ~/.private/id_rsa\nEnter passphrase for ~/.private/id_rsa:\n```\n\nPara desactivar todas las claves añadidas manualmente:\n\n```\n$ ssh-add -D\n```\n\n"
    },
    {
      "title": "Iniciar los componentes SSH y Secrets del demonio del llavero",
      "level": 3,
      "content": "Si está iniciando el llavero de Gnome con un gestor de pantalla o el método Pam descrito anteriormente y NO está utilizando Gnome, Unity o Mate como su escritorio, es posible que los componentes de SSH y Secrets no se inicien automáticamente. Puede solucionar esto copiando los archivos de escritorio gnome-keyring-ssh.desktop y gnome-keyring-secrets.desktop desde /etc/xdg/autostart/ a ~/.config/autostart/ y eliminando la línea OnlyShowIn.\n\n```\n$ cp /etc/xdg/autostart/{gnome-keyring-secrets.desktop,gnome-keyring-ssh.desktop} ~/.config/autostart/\n$ sed -i '/^OnlyShowIn.*$/d' ~/.config/autostart/gnome-keyring-secrets.desktop\n$ sed -i '/^OnlyShowIn.*$/d' ~/.config/autostart/gnome-keyring-ssh.desktop\n```\n\n"
    },
    {
      "title": "Desactivar los componentes del demonio del llavero",
      "level": 3,
      "content": "Si desea ejecutar un agente SSH alternativo (por ejemplo, ssh-agent o gpg-agent), debe desactivar el componente ssh del llavero de GNOME. Para hacerlo de una manera local en una cuenta, copie /etc/xdg/autostart/gnome-keyring-ssh.desktop a ~/.config/autostart y luego añada la línea Hidden=true al archivo copiado. A continuación, cierre la sesión.\n\n"
    },
    {
      "title": "Integración con aplicaciones",
      "level": 3,
      "content": "- Firefox\n\n"
    },
    {
      "title": "Limpiando frases de contraseña",
      "level": 3,
      "content": "```\ngnome-keyring-daemon -r -d\n```\n\nEsta orden inicia gnome-keyring-daemon, cerrando instancias previamente en ejecución.\n\n"
    },
    {
      "title": "Integración con Git",
      "level": 3,
      "content": "El llavero de GNOME es útil en conjunción con Git cuando se utiliza sobre HTTPS.\n\nInstale el paquete libsecret.\n\nConfigure Git para utilizar el ayudante:\n\n```\n$ git config --global credential.helper /usr/lib/git-core/git-credential-libsecret\n```\n\nLa próxima vez que haga un git push, se le pedirá que desbloquee su llavero, si no lo está ya.\n\n"
    },
    {
      "title": "Integración con GnuPG",
      "level": 3,
      "content": "Algunas aplicaciones que utilizan GnuPG requieren un pinentry-program para configurarse. Configure lo siguiente para utilizar pinentry de Gnome 3 para el llavero de Gnome para administrar las solicitudes de frase de contraseña.\n\n```\n~/.gnupg/gpg-agent.conf\n```\n\n```\npinentry-program /usr/bin/pinentry-gnome3\n```\n\nOtra opción es forzar loopback para GPG que debería permitir que se introduzca la contraseña en la aplicación.\n\n"
    },
    {
      "title": "Las contraseñas no son recordadas",
      "level": 3,
      "content": "Si recibe una solicitud de contraseña cada vez que inicia sesión y descubre que las contraseñas no se guardan, es posible que deba crear/configurar un llavero predeterminado.\n\nAsegúrese de que el paquete seahorse esté instalado, ábralo (\"Contraseñas y claves\" en la configuración del sistema) y seleccione Ver > Por llavero.\n\nSi no hay un llavero en la columna izquierda (se marcará con un icono de candado), vaya a Archivo > Nuevo > Llavero de contraseña y asígnele un nombre. Se le pedirá que introduzca una contraseña. Si no le asigna una contraseña al llavero, se desbloqueará automáticamente, incluso cuando se utilice el inicio de sesión automático, pero las contraseñas no se almacenarán de forma segura. Finalmente, pulse con el botón derecho en el llavero que acaba de crear y seleccione \"Establecer como predeterminado\".\n\n"
    },
    {
      "title": "Restableciendo el llavero",
      "level": 3,
      "content": "Si aparece el error \"La contraseña que utiliza para iniciar sesión en su computadora ya no coincide con la de su llavero de inicio de sesión\" (\"The password you use to login to your computer no longer matches that of your login keyring\" en inglés), deberá cambiar la contraseña del llavero. Puede hacer esto utilizando seahorse, haciendo clic derecho en \"llavero predeterminado\" y seleccionando \"Cambiar contraseña\".\n\nAlternativamente, puede eliminar \"login.keyring\" y \"user.keystore\" de /home/{usuario}/.local/share/keyrings/. Tenga en cuenta que esto eliminará permanentemente todas las claves guardadas. Después de eliminar los archivos, simplemente cierre la sesión y vuelva a iniciarla.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Wiki de GNOME[enlace roto 2024-11-05]\n\n"
    }
  ]
}