{
  "title": "GNOME (Русский)/Gedit (Русский)",
  "url": "https://wiki.archlinux.org/title/GNOME_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)/Gedit_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "gedit — текстовый редактор общего назначения для GNOME.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет gedit.\n\nДля дополнительных возможностей можно также установить gedit-plugins.\n\nМожно также использовать словари для проверки орфографии; смотрите статью Language checking.\n\n"
    },
    {
      "title": "Отключение добавления переноса строки в конце файла",
      "level": 3,
      "content": "По умолчанию gedit всегда добавляет в конце файла символ переноса строки, если его там ещё нет. Чтобы отключить это, выполните команду:\n\n```\n$ gsettings set org.gnome.gedit.preferences.editor ensure-trailing-newline false\n```\n\n"
    },
    {
      "title": "Сохранение резервных копий редактируемых файлов",
      "level": 3,
      "content": "При необходимости gedit может создать резервную копию отредактированного файла — содержимое резервной копии будет таким же, как и содержимое исходного файла до внесения изменений и последующего сохранения. Имя резервного файла будет таким же, как и имя исходного файла, но с суффиксом в виде символа ~. Таким образом, для файла с именем file1 резервная копия будет иметь имя file1~. По умолчанию файлы резервных копий скрыты.\n\nДля включения откройте настройки gedit (для пользователей GNOME Shell она находится в глобальном меню gedit), перейдите на вкладку Редактор и поставьте галочку Создавать запасную копию файла перед сохранением.\n\n"
    },
    {
      "title": "Подсветка синтаксиса",
      "level": 3,
      "content": "Gedit по умолчанию поддерживает подсветку синтаксиса для многих языков программирования с помощью gtksourceview4. В данном разделе описаны исключения, требующие дополнительной настройки.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 4,
      "content": "Установите пакет gtksourceview4-pkgbuildAUR для подсветки синтаксиса в файлах PKGBUILD.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Apps/Gedit - GNOME Wiki!\n\n"
    }
  ]
}