{
  "title": "GNOME (Italiano)/Tips and tricks (Italiano)",
  "url": "https://wiki.archlinux.org/title/GNOME_(Italiano)/Tips_and_tricks_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Vedi GNOME (Italiano) per l'articolo principale.\n\n"
    },
    {
      "title": "Attiva NumLock all'accesso",
      "level": 3,
      "content": "Vedere Activating numlock on bootup#GNOME\n\n"
    },
    {
      "title": "Alternative di tasti di scelta rapida",
      "level": 3,
      "content": "Molti tasti di scelta rapida possono essere modificati tramite il menu delle impostazioni di sistema. Ad esempio, per riattivare l'associazione dei tasti show desktop:\n\nImpostazioni di sistema > Tastiera > Scorciatoie > Navigazione > Nascondi tutte le finestre normali\n\nTuttavia, alcuni tasti di scelta rapida non possono essere modificati direttamente tramite le impostazioni di sistema. Per cambiare queste chiavi, usa \"dconf-editor\". Un esempio di nota particolare è il tasto di scelta rapida Alt- + ` (il tasto sopra Tab sui layout di tastiera USA). In GNOME Shell è preconfigurato per scorrere le finestre di un'applicazione, tuttavia è anche un tasto di scelta rapida usato spesso nell'editor Emacs. Può essere cambiato aprendo \"dconf-editor\" e modificando la chiave \"switch-group\" che si trova in org.gnome.desktop.wm.keybindings.\n\n"
    },
    {
      "title": "Interruttore da tastiera con comando",
      "level": 3,
      "content": "Per cambiare la scorciatoia da tastiera predefinita 'Win' + 'Spazio' in un altro tasto di scelta rapida:\n\nAd esempio, per passare a Alt + Maiusc : apri Gnome-Tweak-Tool (o Impostazioni tastiera, in GNOME 3.16) e imposta Digitazione > Sorgenti di input solo modificatori > seleziona Alt-Maiusc . Per maggiori informazioni vedere anche il forum thread.\n\n"
    },
    {
      "title": "Opzioni della tastiera XkbOptions",
      "level": 3,
      "content": "Utilizzando 'dconf-editor' , vai alla chiave denominata org.gnome.desktop.input-sources.xkb-options e aggiungi le XkbOptions desiderate (es. Caps: swapescape ) alla lista.\n\nVedere /usr/share/X11/xkb/rules/xorg per tutte le XkbOptions e /usr/share/X11/xkb/symbols/* per le rispettive descrizioni.\n\n"
    },
    {
      "title": "Annulla il binding della chiave Windows",
      "level": 3,
      "content": "Per impostazione predefinita, il \"tasto Windows\" aprirà la modalità panoramica della shell GNOME. Puoi svincolare questa chiave eseguendo il comando seguente\n\n```\n$ gsettings set org.gnome.mutter overlay-key 'Foo'\n```\n\n"
    },
    {
      "title": "Modifica i tasti di scelta rapida Nautilus",
      "level": 3,
      "content": "Dalla 3.15 non è più possibile usare il file 'accel' , ma è possibile riassociare le chiavi utilizzando nautilus-python. Installa il pacchetto e aggiungi il seguente file:\n\n```\n~/.local/share/nautilus-python/extensions/modify_keybindings.py\n```\n\n```\nimport os, gi\ngi.require_version('Nautilus', '3.0')\nfrom gi.repository import GObject, Nautilus, Gtk, Gio, GLib\n\ndef rebind():\n    app = Gtk.Application.get_default()\n    # Search for open_accels and nautilus_application_set_accelerators in:\n    #   https://github.com/GNOME/nautilus/blob/master/src/nautilus-files-view.c\n    app.set_accels_for_action( \"win.back\", [\"<alt>Left\", \"BackSpace\"] )\n\n    # if you want to figure out which hotkey belongs to which action try this:\n    # print(f'Alt+Left is: {app.get_actions_for_accel(\"<alt>Left\")}')\n\nclass BackspaceBack(GObject.GObject, Nautilus.LocationWidgetProvider):\n    def __init__(self):\n        pass\n\n    def get_widget(self, uri, window):\n        rebind()\n        return None\n\n}\n```\n\nRiavvia nautilus:\n\n```\n$ nautilus -q ; nautilus\n```\n\n"
    },
    {
      "title": "Dischi",
      "level": 2,
      "content": "GNOME fornisce un'utilità del disco per manipolare le impostazioni dell'unità di archiviazione. Queste sono alcune delle sue caratteristiche:\n\n- 'Abilita cache di scrittura' è una funzionalità fornita dalla maggior parte dei dischi rigidi. I dati vengono memorizzati nella cache e allocati in orari prestabiliti per migliorare le prestazioni del sistema. Non consigliato a meno che il computer non abbia una batteria di backup o sia un laptop poiché i dati andrebbero persi in caso di interruzione di corrente.\n\n- 'Opzioni di montaggio automatico' può montare unità e partizioni basate su GPT - utilizzerà le opzioni predefinite consigliate.\n\n"
    },
    {
      "title": "Nascondere le applicazioni dal menu",
      "level": 2,
      "content": "- Le voci del desktop possono essere nascoste modificando i file .desktop stessi. Vedere Desktop entries#Hide desktop entries.\n- MenulibreAUR fornisce un editor di menu senza dipendenze GNOME.\n\nUsa l'applicazione Menu principale (fornita dal pacchetto alacarte) per nascondere tutte le applicazioni che non desideri mostrare nel menu.\n\n"
    },
    {
      "title": "Registrazione screencast",
      "level": 2,
      "content": "GNOME presenta la registrazione screencast incorporata con la combinazione di tasti Ctrl+Shift+Alt+r. Quando la registrazione è in corso, viene visualizzato un cerchio rosso nell'angolo inferiore destro dello schermo. Al termine della registrazione, un file denominato Screencast from% d% u-% c.webm viene salvato nella directory Videos. Per poter utilizzare la funzione screencast è necessario installare i plugin gst.\n\n"
    },
    {
      "title": "Screenshot",
      "level": 2,
      "content": "gnome-screenshot per impostazione predefinita salva l'immagine nella directory dell'ultimo salvataggio, che puoi interrogare:\n\n```\n$ gsettings get org.gnome.gnome-screenshot last-save-directory\n```\n\nInvece di usare la directory sopra, puoi impostare una directory di salvataggio automatico. per esempio. per salvare automaticamente gli screenshot nella directory del desktop di user:\n\n```\n$ gsettings set org.gnome.gnome-screenshot auto-save-directory file:///home/user/Desktop\n```\n\nControlla la pagina man digitando sul terminale questo comando: gnome-screenshot(1) per ulteriori opzioni.\n\n"
    },
    {
      "title": "Ritardo di disconnessione",
      "level": 2,
      "content": "Per eliminare il ritardo predefinito di 60 secondi durante la disconnessione:\n\n```\n$ gsettings set org.gnome.SessionManager logout-prompt false\n```\n\n"
    },
    {
      "title": "Disabilita animazioni",
      "level": 2,
      "content": "Per disabilitare le animazioni della shell (come \"Mostra applicazioni\" e l'animazione wave nell'angolo attivo in alto a sinistra delle attività), esegui:\n\n```\n$ gsettings set org.gnome.desktop.interface enable-animations false\n```\n\noppure tramite gnome-tweaks, nella scheda \"Generale\", disattiva \"Animazioni\".\n\n"
    },
    {
      "title": "Supporto display Retina (HiDPI)",
      "level": 2,
      "content": "GNOME ha introdotto il supporto HiDPI nella versione 3.10. Se il display non fornisce le dimensioni corrette dello schermo tramite EDID, ciò può portare a elementi dell'interfaccia utente ridimensionati in modo errato. Come soluzione alternativa è possibile aprire \"dconf-editor\" e trovare la chiave scaling-factor in org.gnome.desktop.interface. Impostalo su 1 per ottenere la scala standard.\n\nVedi anche HiDPI.\n\n"
    },
    {
      "title": "Password e chiavi (chiavi PGP)",
      "level": 2,
      "content": "È possibile utilizzare il programma Password e chiavi seahorse per creare una chiave PGP in quanto è un front-end per GnuPG e la installa come dipendenza. Questo potrebbe essere utile in futuro (ad esempio se crittografare un file). Crea una chiave come mostrato di seguito (il processo potrebbe richiedere circa 10 minuti):\n\nFile > Nuovo > Chiave PGP > Nome > Email > Impostazioni predefinite > Passphrase .\n\n"
    },
    {
      "title": "Modifica la dimensione del terminale predefinita",
      "level": 3,
      "content": "La dimensione predefinita di un nuovo terminale può essere regolata nel menu Modifica> Preferenze profilo .\n\n"
    },
    {
      "title": "I nuovi terminali adottano la directory corrente",
      "level": 3,
      "content": "Per impostazione predefinita, i nuovi terminali si aprono nella directory $HOME. Per avere nuovi terminali, adottare la directory di lavoro corrente: source /etc/profile.d/vte.sh. Aggiungi il comando alla configurazione della shell per mantenere il comportamento. [1]\n\n"
    },
    {
      "title": "Riempi il terminale",
      "level": 3,
      "content": "Per riempire il terminale (creare un piccolo bordo invisibile tra i bordi della finestra e il contenuto del terminale) creare il file seguente:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\nvte-terminal,\nterminal-window {\n    padding: 10px 10px 10px 10px;\n    -vte-terminal-inner-border: 10px 10px 10px 10px;\n}\n```\n\n"
    },
    {
      "title": "Disabilita il cursore lampeggiante",
      "level": 3,
      "content": "Per disabilitare il cursore lampeggiante in GNOME 3.8 e versioni successive, utilizzare:\n\n```\n$ gsettings set org.gnome.desktop.interface cursor-blink false\n```\n\nPer disabilitare il cursore lampeggiante sul terminale utilizzare solo:\n\n```\n$ gsettings set org.gnome.Terminal.Legacy.Profile:/org/gnome/terminal/legacy/profiles:/:$(gsettings get org.gnome.Terminal.ProfilesList default|tr -d \\')/ cursor-blink-mode off\n```\n\nNotare che gnome-settings-daemon, dal pacchetto con lo stesso nome, deve essere in esecuzione affinché questa e altre modifiche alle impostazioni abbiano effetto nelle applicazioni GNOME - vedere GNOME#Configuration.\n\n"
    },
    {
      "title": "Disabilita la finestra di conferma alla chiusura del terminale",
      "level": 3,
      "content": "Il Terminale mostrerà sempre una finestra di conferma quando si tenta di chiudere la finestra mentre si è loggati come root. Per evitare ciò, eseguire quanto segue:\n\n```\n$ gsettings set org.gnome.Terminal.Legacy.Settings confirm-close false\n```\n\n"
    },
    {
      "title": "Pulsante centrale del mouse",
      "level": 2,
      "content": "Per impostazione predefinita, GNOME 3 disabilita l'emulazione del pulsante centrale del mouse indipendentemente dalle impostazioni Xorg ( 'Emulate3Buttons' ). Per abilitare l'emulazione del pulsante centrale del mouse, utilizzare:\n\n```\n$ gsettings set org.gnome.settings-daemon.peripherals.mouse middle-button-enabled true\n```\n\n"
    },
    {
      "title": "Abilita pulsanti e icone di menu",
      "level": 2,
      "content": "A partire da GTK 3.10, la chiave GSettings \"menu-have-icons\" è stata deprecata. Le icone nei pulsanti e nei menu possono ancora essere abilitate impostando le seguenti sostituzioni:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xsettings overrides \"{'Gtk/ButtonImages': <1>, 'Gtk/MenuImages': <1>}\"\n```\n\n"
    },
    {
      "title": "Usa colori e gradienti personalizzati per lo sfondo del desktop",
      "level": 2,
      "content": "Per utilizzare colori e sfumature personalizzati per lo sfondo del desktop, devi prima impostare un'immagine trasparente oppure un'immagine inesistente come sfondo del desktop. Ad esempio, il comando seguente imposterà un'immagine inesistente come sfondo.\n\n```\n$ gsettings set org.gnome.desktop.background picture-uri none\n```\n\nA questo punto, lo sfondo del desktop dovrebbe essere di un colore piatto - l'impostazione predefinita del colore è per un blu intenso.\n\nPer un colore piatto diverso è necessario modificare solo l'impostazione del colore primario:\n\n```\n$ gsettings set org.gnome.desktop.background primary-color <my color>\n```\n\ndove <my color> è un valore esadecimale (come \"ffffff\" per il bianco).\n\nPer un gradiente di colore, dovrai anche cambiare l'impostazione del colore secondario org.gnome.desktop.background secondary-color e selezionare un tipo di ombreggiatura. Ad esempio, se desideri un gradiente orizzontale, esegui quanto segue:\n\n```\n$ gsettings set org.gnome.desktop.background color-shading-type horizontal\n```\n\nSe stai usando un'immagine trasparente come sfondo, puoi impostare l'opacità eseguendo quanto segue: Se stai usando un'immagine trasparente come sfondo, puoi impostare l'opacità eseguendo quanto segue:\n\n```\n$ gsettings set org.gnome.desktop.background picture-opacity <value>\n```\n\ndove valore è un numero compreso tra 1 e 100 (100 per la massima opacità).\n\n"
    },
    {
      "title": "Sfondi in transizione",
      "level": 2,
      "content": "GNOME può passare da sfondi diversi a intervalli di tempo specifici. Questo viene fatto creando un file XML che specifica le immagini da utilizzare e l'intervallo di tempo. Per ulteriori informazioni sulla creazione di tali file, vedere il seguente articolo.\n\nIn alternativa, sono disponibili numerosi strumenti per automatizzare il processo:\n\n- mkwlppr — Questo script crea file XML che possono agire come sfondi dinamici per GNOME facendo riferimento a più sfondi.\n\nPer impostare il file XML come sfondo predefinito, vedere GNOME (Italiano)#Blocca schermo e sfondo.\n\n"
    },
    {
      "title": "Sessioni GNOME personalizzate",
      "level": 2,
      "content": "È possibile creare sessioni GNOME personalizzate che utilizzano il gestore di sessioni GNOME ma che avviano diversi set di componenti (Openbox con tint2 invece di GNOME Shell per esempio).\n\nSono necessari due file per una sessione GNOME personalizzata: un file di sessione in /usr/share/gnome-session/sessions/ che definisce i componenti da avviare e un desktop entry in /usr/share/xsessions che viene letto dal display manager. Di seguito viene fornito un file di sessione di esempio:\n\n```\n/usr/share/gnome-session/sessions/gnome-openbox.session\n```\n\n```\n[GNOME Session]\nName=GNOME Openbox\nRequiredComponents=openbox;tint2;gnome-settings-daemon;\n```\n\nE un file desktop di esempio:\n\n```\n/usr/share/xsessions/gnome-openbox.desktop\n```\n\n```\n[Desktop Entry]\nName=GNOME Openbox\nExec=gnome-session --session=gnome-openbox\n```\n\n"
    },
    {
      "title": "Reindirizza determinati URL a browser web specifici",
      "level": 2,
      "content": "Questo mostra come utilizzare Chromium per alcuni tipi di URL mantenendo Firefox come browser predefinito per tutte le altre attività.\n\nAssicurati che pcre sia install, per usare pcregrep.\n\nConfigurazione personalizzata xdg-open:\n\n```\n/usr/local/bin/xdg-open\n```\n\n```\n#!/bin/bash\nDOMAIN_LIST_FILE=~/'domains.txt'\nOTHER_BROWSER='/usr/bin/chromium-browser'\nBROWSER_OPTIONS='' # Opzionale, per le opzioni della riga di comando passate al browser\nXDG_OPEN='/usr/bin/xdg-open'\nDEFAULT_BROWSER='/usr/bin/firefox'\n\nif echo \"$1\"|pcregrep -q '^https?://'; then\n    matching=0\n    while read domain; do\n\tif echo \"$1\"|pcregrep -q \"^https?://${domain}\"; then\n\t    matching=1\n\t    break\n\tfi\n    done < \"$DOMAIN_LIST_FILE\"\n\n    if [[ $matching -eq 1 ]]; then\n\t\"$OTHER_BROWSER\" $BROWSER_OPTIONS ${*}\n\texit 0\n    fi\n    \n    \"$DEFAULT_BROWSER\" ${*}\n    exit 0\nelse\n    \"$XDG_OPEN\" ${*}\nfi\n```\n\nConfigura i domini per il reindirizzamento a \"Chromium\":\n\n```\n$HOME/domains.txt\n```\n\n```\nstackexchange.com\nstackoverflow.com\nsuperuser.com\nwww.youtube.com\ngithub.com\n```\n\nImposta xdg-open web come applicazione desktop:\n\n```\n$HOME/.local/share/applications/xdg-open-web.desktop\n```\n\n```\n[Desktop Entry]\nVersion=1.0\nName=xdg-open web\nGenericName=Web Browser\nExec=xdg-open %u\nTerminal=false\nType=Application\nMimeType=text/html;text/xml;application/xhtml+xml;application/vnd.mozilla.xul+xml;text/mml;x-scheme-handler/http;x-scheme-handler/https;\nStartupNotify=true\nCategories=Network;WebBrowser;\nKeywords=web;browser;internet;\nActions=new-window;new-private-window;\n```\n\n```\n$ update-desktop-database $HOME/.local/share/applications/\n```\n\nImposta xdg-open web come applicazione Web predefinita nelle impostazioni di GNOME: Vai su \"Impostazioni GNOME> Dettagli> Applicazioni predefinite\" e imposta \"Web\" su \"xdg-open web\".\n\n"
    },
    {
      "title": "Rimozione pellicola delle miniature dei video in Nautilus",
      "level": 2,
      "content": "Nautilus (File) sovrappone i fori della pellicola / l'effetto striscia di pellicola sulle miniature dei video a partire da Gnome 3.12. Per rimuovere o sovrascrivere questo effetto, la variabile d'ambiente G_RESOURCE_OVERLAYS può essere utilizzata per fare riferimento al percorso di una risorsa compilata (in questo caso filmholes.png) e specificare il percorso per l'overlay pertinente . Questa variabile d'ambiente è disponibile solo da GLib 2.50 e non avrà effetto sulle versioni precedenti.\n\nEstrai filmholes.png da Nautilus.\n\n```\ngresource extract /usr/bin/nautilus /org/gnome/nautilus/icons/filmholes.png > filmholes.png\n```\n\nModifica filmholes.png utilizzando il tuo editor preferito e rimuovi l'effetto pellicola dall'immagine, lasciando intatte la trasparenza e le dimensioni, quindi sovrascrivendo l'immagine estratta.\n\nCopia o sposta l'immagine estratta dove desiderato, ad esempio / usr / share / icons / e modifica ~ / .profile, aggiungendo la seguente esportazione, cambiando / usr / condividi / icons / come necessario per la posizione in cui hai inserito il file.\n\n```\nexport G_RESOURCE_OVERLAYS=/org/gnome/nautilus/icons/filmholes.png=/usr/share/icons/filmholes.png\n```\n\nSe ffmpegthumbnailer è stato installato come dipendenza per un altro file manager che potrebbe generare miniature, la riga Exec in /usr/share/thumbnailers/ffmpegthumbnailer.thumbnailer dovrebbe essere modificato rimuovendo il flag -f.\n\nPer assicurarti che non rimangano miniature che potrebbero già avere l'effetto pellicola incorporato, rimuovi la cache delle miniature.\n\n```\nrm -r ~/.cache/thumbnails\n```\n\nEsci e torna alla tua sessione e non dovresti più avere l'effetto fori della pellicola / striscia di pellicola sulle tue miniature in Nautilus.\n\n"
    },
    {
      "title": "Impedisci al software GNOME di scaricare gli aggiornamenti",
      "level": 2,
      "content": "Per impostazione predefinita gnome-software scaricherà i pacchetti aggiornati dai repository di Arch Linux. Questo forza il software GNOME ad aggiornare automaticamente gli elenchi dei pacchetti per \"pacman\". Questo è l'equivalente di pacman -Sy. Se l'utente ignora il prompt di aggiornamento del software GNOME, ma installa un nuovo pacchetto, ciò risulterà in partial upgrades, che sono 'non supportati' . Per impedire al software GNOME di aggiornare gli elenchi dei pacchetti, impostare la seguente impostazione dconf:\n\n```\n$ gsettings set org.gnome.software download-updates false\n```\n\n"
    },
    {
      "title": "Aumenta il volume oltre il 100%",
      "level": 2,
      "content": "Installa l'estensione volume mixer. Quindi utilizzare il mouse per scorrere sopra l'icona del volume nel pannello superiore per aumentare il volume oltre il 100%.\n\n"
    },
    {
      "title": "Regola il volume a passi più piccoli",
      "level": 2,
      "content": "Per impostazione predefinita, premendo i tasti del volume della tastiera si regola il volume del 6%. Se si desiderano passi più piccoli, la scorciatoia Maiusc + Tasto volume su / giù regola il volume in passi del 2%.\n\nInoltre, a partire da GNOME 3.36, è ora possibile regolare direttamente il passo del volume tramite un'impostazione di dconf. Ad esempio, per impostare l'incremento del volume al 2%, eseguire quanto segue:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.media-keys volume-step 2\n```\n\n"
    },
    {
      "title": "Mostra la percentuale del volume del suono accanto all'icona del pannello superiore",
      "level": 2,
      "content": "Installa l'estensione sound percentage per visualizzare il livello del volume di output corrente accanto all'icona del suono nel pannello superiore.\n\n"
    },
    {
      "title": "Sospensione ibrida sull'azione di chiusura del coperchio del laptop",
      "level": 2,
      "content": "Seguire i comandi seguenti per attivare Hybrid Sleep quando si chiude il coperchio del laptop. Leggi qui per ulteriori informazioni.\n\n```\nmkdir --parents /etc/systemd/logind.conf.d\n   printf '%s\\n' '[Login]' 'HandleLidSwitch=hybrid-sleep' >/etc/systemd/logind.conf.d/50-local.conf\n   systemctl restart systemd-logind.conf\n```\n\n"
    },
    {
      "title": "Avvia su GPU discreta",
      "level": 2,
      "content": "Installa switcheroo-control o switcheroo-control-gitAUR. start e enable switcheroo-control.service\n\n"
    },
    {
      "title": "Elenco finestre",
      "level": 2,
      "content": "Se ti piace avere un elenco di attività in basso ma non ti piace il colore nero predefinito di questa estensione, copia la sua directory:\n\n```\ncp -r /usr/share/gnome-shell/extensions/window-list@gnome-shell-extensions.gcampax.github.com/ ~/.local/share/gnome-shell/extensions/\n```\n\ne modifica il CSS a tuo piacimento. Ad esempio, per renderlo trasparente modifica stylesheet.css in questo modo:\n\n```\n.bottom-panel {\n  background: transparent;\n```\n\n```\n.window-button > StWidget,\n.window-picker-toggle > StWidget {\n  background-color: transparent;\n```\n\n"
    },
    {
      "title": "Consultare inoltre",
      "level": 2,
      "content": "- Gnome\n\n"
    }
  ]
}