{
  "title": "GNOME/Document viewer (Español)",
  "url": "https://wiki.archlinux.org/title/GNOME/Document_viewer_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-12** \n\nEl visor de documentos está específicamente diseñado para admitir los siguientes formatos de archivo: PDF, PostScript, DjVu, tiff, dvi, XPS, soporte de SyncTex con gedit, libros de cómics (cbr, cbz, cb7 y cbt). Para obtener una lista completa de los formatos admitidos, véase Formatos de documentos compatibles.\n\nEl visor de documentos utiliza la biblioteca poppler como backend.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete evince, o evince-gitAUR para la versión de desarrollo. Evince instala gnome-desktop como dependencia.\n\nPara una versión independiente instale evince-no-gnomeAUR o la versión ligera evince-lightAUR[enlace roto: package not found] para tener soporte solamente de PDF.\n\n"
    },
    {
      "title": "La impresora no aparece",
      "level": 3,
      "content": "Actualice gtk3 a la versión 3.22.26+47+g3a1a7135a2-1 o superior. En versiones anteriores de GTK 3, los backends de la impresora GTK se incluyeron en un paquete separado. [1]\n\n"
    },
    {
      "title": "La ampliación es limitada",
      "level": 3,
      "content": "El aumento del tamaño de la memoria caché de la página de Evince le permite ampliar aún más, lo que es útil para documentos grandes. Por defecto, la configuración se establece en 50MiB. El aumento del tamaño del caché de la página obviamente aumenta el consumo de memoria de Evince cuando se amplía.\n\nLa siguiente orden aumenta el tamaño del caché de la página a un gigabyte:\n\n```\n$ gsettings set org.gnome.Evince page-cache-size 'uint32 1000'\n```\n\n"
    },
    {
      "title": "Los textos en PDF no se muestran correctamente",
      "level": 3,
      "content": "Intente establecer el parámetro override-restrictions a falso:\n\n```\n$ gsettings set org.gnome.Evince override-restrictions false\n```\n\n"
    },
    {
      "title": "La búsqueda inversa con SyncTeX no funciona",
      "level": 3,
      "content": "Compruebe que python-dbus está instalado. Tras esto Ctrl+click debería funcionar.\n\n"
    },
    {
      "title": "Soporte de libro de cómics WebP",
      "level": 3,
      "content": "Algunos archivos de libro de cómics (cbr, cbz etc.) utilizan imágenes WebP. Instale webp-pixbuf-loader para el soporte de libro de cómics WebP.\n\n"
    },
    {
      "title": "Gestión de anotaciones",
      "level": 3,
      "content": "Evince v3.31.0 añade el atajo de teclado \"s\" para incluir anotaciones de texto y \"Ctrl+H\" para añadir una anotación de texto resaltado.\n\nEl autor predeterminado para las animaciones de texto de nota es igual al comentado en GECOS del usuario actual, para cambiar esto:\n\n```\nusermod -c “Su nuevo nombre real completo” sunombredeusuario\n```\n\n"
    },
    {
      "title": "Utilizar como visor de PDF predeterminado",
      "level": 3,
      "content": "Para establecer la asociación predeterminada para xdg-open,\n\n```\nxdg-mime default org.gnome.Evince.desktop application/pdf\n```\n\nOtros abridores de recursos se pueden configurar de manera similar.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Sitio web de Evince\n- Sitio web de Poppler\n- Página \"Referencia de PDF\" de Adobe[enlace roto 2025-03-15]\n\n"
    }
  ]
}