{
  "title": "GNOME 3 (Русский)",
  "url": "https://wiki.archlinux.org/title/GNOME_3_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- GTK (Русский)\n- GDM\n- GNOME/Tips and tricks\n- GNOME/Troubleshooting\n- GNOME/Files\n- GNOME (Русский)/Gedit (Русский)\n- GNOME/Web\n- GNOME/Evolution\n- GNOME/Flashback\n- GNOME/Keyring (Русский)\n- GNOME/Document viewer\n- GNOME/Software\n- Официальные репозитории#gnome-unstable\n\nGNOME (произностися как /(ɡ)noʊm/) — окружение рабочего стола, которое стремится быть простым и легким в использовании. Оно разработано в рамках Проекта GNOME и состоит полностью из свободного и открытого программного обеспечения. Является частью Проекта GNU. По умолчанию использует Wayland, а не Xorg.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Доступны две группы:\n\n- gnome содержит основное рабочее окружение и набор хорошо интегрированных приложений;\n- gnome-extra включает в себя дополнительные приложения GNOME, такие как архиватор, диспетчер дисков, текстовый редактор и набор игр. Обратите внимание, что эта группа опирается на gnome.\n\nБазовый рабочий стол состоит из GNOME Shell, плагина для оконного менеджера Mutter. Он может быть установлен отдельным пакетом - gnome-shell\n\n"
    },
    {
      "title": "Сессии GNOME",
      "level": 2,
      "content": "Доступно три сессии.\n\n- GNOME - сеанс по умолчанию; запускает GNOME Shell, используя протокол Wayland, а также привычные приложения X посредством Xwayland\n- GNOME Classic - традиционный рабочий стол, похожий на пользовательский интерфейс GNOME 2, но использующий технологии GNOME 3. Это достигается за счет использования предустановленных расширений и настроек (смотрите здесь, чтобы увидеть список). Следовательно, это более \"настроенный\", чем первый, режим GNOME Shell\n- GNOME on Xorg - запускает GNOME Shell, используя Xorg\n\n"
    },
    {
      "title": "Запуск GNOME",
      "level": 2,
      "content": "GNOME может быть запущен как графически, используя экранный менеджер, так и вручную из консоли. При запуске из консоли некоторые возможности могут быть ограничены.\n\n"
    },
    {
      "title": "Графически",
      "level": 3,
      "content": "В меню экранного менеджера выберите сессию GNOME, GNOME Classic или GNOME on Xorg.\n\n"
    },
    {
      "title": "Сессия Xorg",
      "level": 4,
      "content": "- Для запуска сессии GNOME on Xorg добавьте следующее в файл ~/.xinitrc (смотрите здесь для получения подробностей): export XDG_SESSION_TYPE=x11 export GDK_BACKEND=x11 exec gnome-session\n- Для запуска сессии GNOME Classic добавьте следующее в файл ~/.xinitrc: export XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME export GNOME_SHELL_SESSION_MODE=classic exec gnome-session --session=gnome-classic\n\n```\nexport XDG_SESSION_TYPE=x11\nexport GDK_BACKEND=x11\nexec gnome-session\n```\n\n```\nexport XDG_CURRENT_DESKTOP=GNOME-Classic:GNOME\nexport GNOME_SHELL_SESSION_MODE=classic\nexec gnome-session --session=gnome-classic\n```\n\nПосле редактирования файла ~/.xinitrc можно запустить GNOME при помощи команды startx (для получения информации о других возможностях, например сохранении сессии logind, смотрите статью xinitrc). После настройки ~/.xinitrc можете использовать инструкции из статьи Запуск Х при входе в систему, например, для запуска X на tty2 путём добавления следующих команд в .bash_profile:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty2; ]]; then\n  GDK_BACKEND=x11 exec startx\nfi\n```\n\n"
    },
    {
      "title": "Сессия Wayland",
      "level": 4,
      "content": "- Пакет xorg-xwayland все еще нужен даже для запуска тех приложений, которые не портированы на Wayland. Приложения, которые используют определённые графические библиотеки, такие как Qt, можно принудительно запускать с использованием Wayland при помощи установки переменных среды. См. Wayland#GUI libraries для получения более детальной информации.\n- При использовании проприетарного драйвера NVIDIA ненативные приложения Wayland имеют плохую производительность из-за отсутствия аппаратного ускорения Xwayland. Ожидается, что эта проблема будет решена весной 2020 года, но точные сроки от NVIDIA не поступали.\n\nВручную Wayland-сессию можно запустить следующей командой: XDG_SESSION_TYPE=wayland dbus-run-session gnome-session.\n\nЧтобы запускать сессию GNOME на tty1 при входе в систему, добавьте следующее содержимое в .bash_profile. Не все приложения проверяют переменную XDG_SESSION_TYPE, из-за чего необходимо добавить отдельные переменные для Firefox и Qt:\n\n```\nif [[ -z $DISPLAY && $(tty) == /dev/tty1 && $XDG_SESSION_TYPE == tty ]]; then\n  MOZ_ENABLE_WAYLAND=1 QT_QPA_PLATFORM=wayland XDG_SESSION_TYPE=wayland exec dbus-run-session gnome-session\nfi\n```\n\n"
    },
    {
      "title": "Приложения GNOME в Wayland",
      "level": 3,
      "content": "Когда используется сессия GNOME, соответствующие приложения будут запущены, используя Wayland. Для отладки смотрите руководство GTK, в нем перечислены параметры и переменные окружения.\n\n"
    },
    {
      "title": "Навигация",
      "level": 2,
      "content": "Чтобы понять, как использовать GNOME эффективно, прочитайте шпаргалку GNOME Shell; в ней освещаются особенности, включающие в себя переключение между задачами, использование клавиатуры, управление окнами, панель, режим обзора, GNOME shell и горячие клавиши. Вот некоторые из них:\n\n- Super + m: показать трей с сообщениями\n- Super + a: показать меню приложений\n- Alt + Tab: переключение между активными приложениями\n- Alt + ` (клавиша выше Tab на раскладке клавиатуры США): переключение между окнами активного приложения\n- Alt + F2, затем введите r или restart: перезапуск оболочки ввиду графических проблем (только для режима X/legacy. Не доступно для Wayland).\n\n```\n$ gsettings set org.gnome.shell.app-switcher current-workspace-only true\n```\n\n"
    },
    {
      "title": "Устаревшие названия",
      "level": 2,
      "content": "Table content:\nТекущее | Старое\nFiles | Nautilus\nWeb | Epiphany\nVideos | Totem\nMain Menu | Alacarte\nDocument Viewer | Evince\nDisk Usage Analyzer | Baobab\nImage Viewer | Loupe\nPasswords and Keys | Seahorse\nGNOME Translation Editor | Gtranslator\n\n"
    },
    {
      "title": "Конфигурация",
      "level": 2,
      "content": "Панель управления GNOME (gnome-control-center) и приложения GNOME используют низкоуровневую систему конфигурации dconf для хранения своих настроек.\n\nС помощью утилит gsettings и dconf вы можете напрямую получить доступ к базе данных dconf. Этот метод также позволяет настраивать параметры не предоставляемые графическим интерфейсом.\n\nДо версии GNOME 3.24 все настройки применялись с помощью демона настроек GNOME (находится в /usr/lib/gnome-settings-daemon/gnome-settings-daemon), который мог быть запущен вне сессии GNOME.\n\nОднако в GNOME 3.24 демон настроек GNOME был заменён несколькими отдельными плагинами: /usr/lib/gnome-settings-daemon/gsd-*, которые позже переместили в /usr/lib/gsd-*. Эти плагины теперь контролируются через .desktop-файлы, которые находятся в каталоге /etc/xdg/autostart (org.gnome.SettingsDaemon.*.desktop). Для того, чтобы запустить эти плагины вне сессии GNOME, необходимо скопировать соответствующие ярлыки приложений в каталог ~/.config/autostart.\n\nКонфигурация обычно производится отдельно для каждого пользователя и остальная часть этого раздела не приводит примеры того, как создать конфигурацию для нескольких пользователей одновременно.\n\n"
    },
    {
      "title": "Цвет",
      "level": 4,
      "content": "Демон (служба) colord считывает данные EDID дисплея и извлекает соответствующий цветовой профиль. Большинство цветовых профилей являются правильными и не требуют настройки; однако для тех, которые не являются правильными или для старых дисплеев, цветовые профили могут быть помещены в ~/.local/share/icc/ и направлены туда же.\n\n"
    },
    {
      "title": "Night Light",
      "level": 4,
      "content": "GNOME поставляется со встроенным световым фильтром, который похож на Redshift. Его можно включить в меню настроек в разделе Дисплеи. Более того вы можете изменить температуру кельвина посредством dconf. В следующем примере выбрано значение 5000:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.color night-light-temperature 5000\n```\n\n"
    },
    {
      "title": "Дата и время",
      "level": 4,
      "content": "Если в системе настроен Network Time Protocol daemon, то он будет эффективно работать также и с GNOME. Синхронизация может быть переключена на ручной контроль из меню.\n\nGNOME поддерживает автоматический выбор часового пояса (может быть включен в разделе Дата и время системных настроек при условии, что службы определения местоположения включены; смотртие раздел Конфиденциальность в настройках).\n\nЧтобы показывать дату в верхней панели:\n\n```\n$ gsettings set org.gnome.desktop.interface clock-show-date true\n```\n\nКроме того, чтобы показывать номера недель в календаре, открытом в верхней панели:\n\n```\n$ gsettings set org.gnome.desktop.calendar show-weekdate true\n```\n\n"
    },
    {
      "title": "Приложения по умолчанию",
      "level": 4,
      "content": "После установки GNOME в первый раз вы можете обнаружить, что не те приложения обрабатывают определенные протоколы. Например, totem открывает видео вместо ранее использованного VLC. Некоторые ассоциации могут быть установлены с помощью системных настроек: Все параметры > Подробности > Приложения по умолчанию.\n\nДля других протоколов и методов их конфигурации смотрите приложения по умолчанию.\n\n"
    },
    {
      "title": "Мышь и сенсорная панель",
      "level": 4,
      "content": "Многие настройки сенсорной панели могут быть установлены с помощью системных настроек: Параметры > Устройства > Мышь и сенсорная панель.\n\nВ зависимости от вашего устройства другие параметры, которые нельзя настроить через интерфейс, могут быть доступны. Например, другой click-method тачпада:\n\n```\n$ gsettings range org.gnome.desktop.peripherals.touchpad click-method\n```\n\n```\nenum\n'default'\n'none'\n'areas'\n'fingers'\n```\n\nВручную:\n\n```\n$ gsettings set org.gnome.desktop.peripherals.touchpad click-method 'fingers'\n```\n\nили через gnome-tweaks.\n\n"
    },
    {
      "title": "Сеть",
      "level": 4,
      "content": "NetworkManager - собственный инструмент проекта GNOME для управления настройками сети. Установите networkmanager и включите NetworkManager.service.\n\nВ отличие от других менеджеров сети, которые могут быть также использованы, NetworkManager обеспечивает полную интеграцию через настройки сети оболочки и предоставляет апплет индикатора статуса network-manager-applet (не требуется для GNOME).\n\n"
    },
    {
      "title": "Сетевые учетные записи",
      "level": 4,
      "content": "Некоторые сетевые учетные записи, такие как ownCloud, требуют установки gvfs-goa для полной работоспособности в приложениях GNOME, таких как GNOME Files и GNOME Documents [1].\n\n"
    },
    {
      "title": "Поиск",
      "level": 4,
      "content": "Note: **Эта статья или раздел нуждается в переводе** Эта статья или раздел нуждается в переводе\n\nЭта статья или раздел нуждается в переводе\n\nЧтобы воспользоваться поиском GNOME нужно нажать клавишу Super и просто начать печатать. Пакет trackerAUR устанавливается по умолчанию, как часть группы gnome, и индексирует приложения и базы метаданных. Настраивается при помощи Поиск и индексация. Мониторинг состояния производится посредством tracker-control. Он автоматически запускается gnome-session при входе в систему. Можно запустить вручную: tracker-control -s. Параметры поиска также могут быть настроены из панели Все параметры.\n\nОтправлять запросы базе данных Tracker можно при помощи tracker-sparql. Смотрите страницу справочного руководства tracker-sparql(1)[устаревшая ссылка 2022-12-10].\n\n"
    },
    {
      "title": "Расширенная конфигурация",
      "level": 3,
      "content": "Как вы могли заметить выше, многие параметры, такие как изменение темы GTK или оконного менеджера, недоступны в панели управления GNOME (gnome-control-center). Пользователи, желающие настроить эти параметры, возможно, захотят использовать GNOME Tweaks (gnome-tweaks - удобная графическая утилита, которая предоставляет доступ к множеству параметров.\n\nПараметры GNOME (которые сохраняются в базе данных DConf) также могут быть настроены, используя dconf-editor[устаревшая ссылка 2020-08-02 ⓘ] (графический инструмент для настройки DConf) или gsettings - консольный утилита для настройки. В GNOME Tweak Tool нет скрытых настроек, все они предоставлены в графическом интерфейсе; заметим, однако, что вы не найдете все описываемые ниже параметры в этой утилите.\n\n"
    },
    {
      "title": "Внешний вид",
      "level": 4,
      "content": "GNOME использует Adwaita по умолчанию. Для того, чтобы применить тему Adwaita dark только для GTK 2 приложений, используйте следующую символическую ссылку:\n\n```\n$ ln -s /usr/share/themes/Adwaita-dark ~/.themes/Adwaita\n```\n\nДля того, чтобы установить новые темы, переместите их в соответствующий каталог и используйте GNOME Tweaks или следующие команды GSettings:\n\nДля темы GTK:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme имя-темы\n```\n\nДля темы иконок:\n\n```\n$ gsettings set org.gnome.desktop.interface icon-theme имя-темы\n```\n\nСмотрите GTK#Темы и Icons#Manually.\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\nheaderbar.default-decoration {\n padding-top: 0px;\n padding-bottom: 0px;\n min-height: 0px;\n font-size: 0.6em;\n}\n\nheaderbar.default-decoration button.titlebutton {\n padding: 0px;\n min-height: 0px;\n}\n```\n\nСмотрите [2][устаревшая ссылка 2020-08-02 ⓘ] для дополнительной информации.\n\nВыполните, чтобы задать порядок кнопок (Mutter, Metacity):\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences button-layout ':minimize,maximize,close'\n```\n\n- Установите gnome-shell-extension-no-title-bar-gitAUR или gnome-shell-extension-no-title-barAUR. Заголовок окон в полноэкранном режиме будет перемещен в панель в верхней части экрана.\n\n- Установите mutter-hide-legacy-decorationsAUR[ссылка недействительна: package not found]. Это изменит стандартные настройки оконного менеджера таким образом, что заголовки старых приложений (без функциональных кнопок в заголовке), будут автоматически скрываться в полноэкранном режиме или при максимальной высоте.\n\n- Установите gnome-shell-extension-pixel-saver-gitAUR или gnome-shell-extension-pixel-saverAUR. Заголовок окон будет перемещен в панель в верхней части экрана, экономя драгоценные пиксели.\n\nТему Gnome Shell можно настроить. Убедитесь, что установлен пакет gnome-shell-extensions. Затем включите расширение User Themes при помощи GNOME Tweaks или через сайт GNOME Shell Extensions. Темы Shell могут быть загружены и выбраны, используя GNOME Tweaks.\n\nНекоторые темы GNOME Shell доступны в AUR.\n\nТакже темы можно скачать с gnome-look.org.\n\nПо умолчанию никакие иконки в меню не отображаются. Чтобы включить отображение иконок в меню, выполните следующую команду.\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xsettings overrides \"{'Gtk/ButtonImages': <1>, 'Gtk/MenuImages': <1>}\"\n```\n\n"
    },
    {
      "title": "Каталоги в меню приложений",
      "level": 4,
      "content": "В dconf-editor перейдите в org.gnome.desktop.app-folders и установите значение folder-children на массив имен папок, разделенных запятыми:\n\n```\n['Utilities', 'Sundry']\n```\n\nДобавьте приложения, используя gsettings:\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ apps \"['alacarte.desktop', 'dconf-editor.desktop']\"\n```\n\nДействия выше добавят приложения alacarte.desktop и dconf-editor.desktop в папку Sundry. Это также создаст каталог org.gnome.desktop.app-folders.folders.Sundry.\n\nЧтобы переименовать папку (если у нее нет имени, которое отображается в верхней части приложений):\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ name \"Sundry\"\n```\n\nПриложения аналогично могут быть отсортированы по их категории (указанной в .desktop файле):\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ categories \"['Office']\"\n```\n\nЕсли нужные приложения, соответствующие категории, не хотят добавляться в требуемую папку:\n\n```\n$ gsettings set org.gnome.desktop.app-folders.folder:/org/gnome/desktop/app-folders/folders/Sundry/ excluded-apps \"['libreoffice-draw.desktop']\"\n```\n\nДля получения более подробной информации смотрите [3] и [4].\n\n"
    },
    {
      "title": "Автозапуск приложений при входе в систему",
      "level": 4,
      "content": "GNOME реализует XDG Autostart.\n\nУтилита gnome-tweaks позволяет управлять тем, какие приложения будут запущены при входе.\n\nNote: **+** \n\n"
    },
    {
      "title": "Рабочий стол",
      "level": 4,
      "content": "До GNOME 3.28 иконки на рабочем столе предоставлялись Files. В GNOME 3.28 такая функциональность была удалена. Чтобы вернуть эту функциональность, можно использовать Nemo (форк Files, у которого есть данная функция) или установить расширение gnome-shell-extension-desktop-iconsAUR, которое воспроизводит такие иконки на рабочем столе, какие были в GNOME 3.26 и ниже, но с некоторыми отличиями. Для большей информации смотрите тему форума - Arch forum thread\n\nПри настройке фона рабочего стола и экрана блокировки, важно отметить, что вкладка Изображения будет отображать картинки, расположенные только в папке /home/имяпользователя/Изображения. Если вы хотите использовать картинку, не находящуюся в этой папке, используйте команды ниже.\n\nДля рабочего стола:\n\n```\n$ gsettings set org.gnome.desktop.background picture-uri 'file:///путь/к/моей/картинке.jpg'\n```\n\nДля экрана блокировки:\n\n```\n$ gsettings set org.gnome.desktop.screensaver picture-uri 'file:///путь/к/моей/картинке.jpg'\n```\n\nНачиная с версии GNOME 3.34 можно отключить его с помощью команды:\n\n```\n$ gsettings set org.gnome.desktop.interface enable-hot-corners false\n```\n\nили через gnome-tweaks, отключив опцию Верхняя панель > Активный угол меню Обзор\n\n"
    },
    {
      "title": "Расширения",
      "level": 4,
      "content": "Расширения можно найти на extensions.gnome.org. Они могут быть установлены и активированы в браузере путем установки переключателя в верхнем правом углу экрана на ON и последующего нажатия Install в диалоге (если расширение не установлено). После установки оно покажется во вкладке extensions.gnome.org/local/, которая также может быть использована для проверки обновлений. Установленные дополнения могут быть включены или, наоборот, выключены посредством gnome-tweaks.\n\nGNOME Shell может быть настроен при помощи расширений как для отдельного пользователя, так и для всех сразу. Расширение, установленные с помощью pacman, доступны для всех пользователей системы, заодно и автоматизируется процесс их дальнейшего обновления. Пакет gnome-shell-extensions предоставляет набор расширений, поддерживаемый как часть проекта GNOME (большинство включенных в него расширений используются в классической сессии GNOME). Пользователи, которые хотят панель задач, но не желают использовать сессию GNOME Classic, возможно, захотят установить расширение Window list (предоставляемое пакетом gnome-shell-extensions).\n\nДля просмотра активных на данный момент расширений выполните:\n\n```\n$ gsettings get org.gnome.shell enabled-extensions\n```\n\nДля получения дополнительной информации о расширениях GNOME, смотрите [5].\n\n"
    },
    {
      "title": "Шрифты",
      "level": 4,
      "content": "Можно настроить шрифты для заголовков окон, интерфейса (приложений), документов и изменить моноширинный шрифт. Смотрите вкладку \"Шрифты\" в GNOME Tweaks.\n\nДля хинтинга, скорее всего, потребуется RGBA, так как он подходит для мониторов большинства типов, и если шрифты кажутся слишком загороженными, то измените хинтинг на Slight или None.\n\n"
    },
    {
      "title": "Методы ввода",
      "level": 4,
      "content": "GNOME имеет встроенную поддержку методов ввода через IBus, нужно установить только ibus и соответствующий движок (например, ibus-libpinyin для Intelligent Pinyin); после установки можно добавить соответствующий движок, как раскладку клавиатуры, в настройках GNOME Язык и регион.\n\n"
    },
    {
      "title": "Электропитание",
      "level": 4,
      "content": "Если вы используете ноутбук, то вы возможно захотите изменить следующие настройки:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-timeout 3600\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-ac-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-timeout 1800\n$ gsettings set org.gnome.settings-daemon.plugins.power sleep-inactive-battery-type hibernate\n$ gsettings set org.gnome.settings-daemon.plugins.power power-button-action suspend\n$ gsettings set org.gnome.desktop.lockdown disable-lock-screen true\n```\n\nОставить монитор включенным при закрытии крышки:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xrandr default-monitors-setup do-nothing\n```\n\nСледующие настройки считаются устаревшими после версии GNOME 3.24:\n\n```\norg.gnome.settings-daemon.plugins.power button-hibernate\norg.gnome.settings-daemon.plugins.power button-power\norg.gnome.settings-daemon.plugins.power button-sleep\norg.gnome.settings-daemon.plugins.power button-suspend\norg.gnome.settings-daemon.plugins.power critical-battery-action\n```\n\nПанель настроек GNOME не предоставляет пользователю возможности выбрать выполняемое действие при закрытии крышки ноутбука. Однако gnome-tweaks может переопределять настройки, применённые systemd. На вкладке Основное отключите опцию Режим ожидания при закрытии ноутбука. Теперь система не будет уходить в спящий режим (\"Suspend to RAM\") при закрытии крышки ноутбука.\n\nДля того, чтобы изменить выполняемое действие при закрытии крышки для всех пользователей, убедитесь, что опция Режим ожидания при закрытии ноутбука не отключена и отредактируйте настройки systemd в /etc/systemd/logind.conf. Для отключения входа в спящий режим при закрытии крышки установите опцию HandleLidSwitch=ignore, как описано в Power management#ACPI events.\n\nПанель настроек не предоставляет соответствующую опцию для изменения действия, которое будет выполняться при критическом уровне заряда батареи. Также эти настройки были удалены из dconf. В настоящий момент они управляются upower. Отредактируйте файл настроек upower - /etc/UPower/UPower.conf. Найдите следующие параметры и настройте под свои нужны.\n\n```\n/etc/UPower/UPower.conf\n```\n\n```\nPercentageLow=10\nPercentageCritical=3\nPercentageAction=2\nCriticalPowerAction=HybridSleep\n```\n\n"
    },
    {
      "title": "Использование стороннего оконного менеджера",
      "level": 3,
      "content": "Оболочка GNOME не поддерживает использование стороннего оконного менеджера, однако GNOME/Flashback предоставляет сессии для Metacity и Compiz. Более того, можно определять собственные сессии GNOME с использованием альтернативных компонентов.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальный веб-сайт GNOME\n- Статья на Wikipedia\n- Расширения для оболочки GNOME\n- Список горячих клавиш для оболочки GNOME\n- Кастомизация (темы, иконки...): Персонализация GNOME GNOME Look\n- Приложения GNOME: GNOME Apps Index Wikipedia:GNOME Core Applications\n- Исходный код/Зеркала GNOME: Git-репозиторий GNOME Зеркало GNOME на GitHub\n\n- Персонализация GNOME\n- GNOME Look\n\n- GNOME Apps Index\n- Wikipedia:GNOME Core Applications\n\n- Git-репозиторий GNOME\n- Зеркало GNOME на GitHub\n\n"
    }
  ]
}