{
  "title": "GNU (Русский)",
  "url": "https://wiki.archlinux.org/title/GNU_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Arch Linux (Русский)\n- Основные утилиты\n\nGNU — это операционная система и обширная коллекция свободных компьютерных программ. GNU — это рекурсивный акроним, означающий «GNU's Not Unix!».\n\nПоскольку ядро GNU, Hurd, всё ещё не готово [1], программы GNU обычно используются с ядром Linux. Arch Linux — это дистрибутив GNU/Linux, использующий программы GNU, такие как командная оболочка Bash, GNU coreutils, GNU toolchain и множество других утилит и библиотек. Эта страница не пытается перечислить все почти 400 пакетов GNU, а лишь выделяет некоторые из них.\n\n"
    },
    {
      "title": "Texinfo",
      "level": 2,
      "content": "Документация программ GNU пишется с использованием синтаксиса Texinfo. Вы можете просматривать документы Info с помощью программы info, доступной в пакете texinfo.\n\nХотя для большинства программ GNU также есть man-страницы, документация Info, как правило, более полная.\n\n"
    },
    {
      "title": "Базовая система",
      "level": 2,
      "content": "- GRUB — Загрузчик.\n\n- Bash — Командная оболочка, совместимая с sh, которая включает в себя полезные функции из Korn shell (ksh) и C shell (csh).\n\n- Coreutils — Основные утилиты операционной системы GNU для работы с файлами, оболочкой и текстом.\n\n- gzip — Формат файла и программа для сжатия и распаковки.\n\n- tar — Программа для работы с tar-архивами.\n\n"
    },
    {
      "title": "Инструментарий",
      "level": 2,
      "content": "Почти все инструменты из GNU toolchain входят в состав группы base-devel, кроме glibc (требуется для base) и GDB.\n\n- GNU make — Утилита GNU make для управления группами программ.\n\n- GCC — The GNU Compiler Collection — фронтенды для C и C++.\n\n- glibc — Реализация стандартной библиотеки C от GNU.\n\n- GNU Binutils — Набор программ для сборки и манипулирования бинарными и объектными файлами. Включает в себя ld.\n\n- GNU Bison — Генератор парсеров общего назначения.\n\n- GNU m4 — Препроцессор макросов.\n\n- GDB — Отладчик.\n\n"
    },
    {
      "title": "Система сборки",
      "level": 3,
      "content": "Википедия:\n\n- GNU Autoconf — Инструмент для автоматической настройки исходного кода.\n\n- GNU Automake — Инструмент для автоматического создания make-файлов.\n\n- GNU Libtool — Скрипт поддержки общих библиотек.\n\n"
    },
    {
      "title": "Другие программы",
      "level": 2,
      "content": "Многие другие необязательные программы GNU доступны в официальных репозиториях:\n\n- GNOME — среда рабочего стола\n- GIMP — редактор изображений\n- GTK — инструментарий для разработки графических приложений\n- Gnumeric — табличный процессор\n- GNU Parted — инструмент для разметки дисков\n- GNU Screen — терминальный мультиплексор\n- GNU nano — консольный текстовый редактор\n- GNU Emacs — расширяемый, настраиваемый, самодокументирующийся текстовый редактор\n- GnuPG — реализация OpenPGP\n- GNU Octave — научный язык программирования\n- GNU Readline — библиотека для взаимодействия с командной строкой\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- https://www.gnu.org/\n- Манифест GNU\n- Список пакетов GNU — Википедия\n- Arch Hurd Project — попытка портирования Arch Linux на ядро Hurd\n\n"
    }
  ]
}