{
  "title": "GNU (Español)",
  "url": "https://wiki.archlinux.org/title/GNU_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-10-25** \n\nArtículos relacionados\n\n- Arch Linux\n- Utilidades principales\n\nFrom Wikipedia:\n\nDebido a que el kernel de GNU, Hurd, no está listo para producción [1] GNU se utiliza generalmente con el kernel de Linux. Arch Linux es una distribución de GNU/Linux de este tipo, que utiliza software de GNU como el intérprete de línea de órdenes Bash, coreutils de GNU, toolchain de GNU y muchas otras utilidades y bibliotecas. Esta página no intenta listar todos los paquetes GNU que son casi 400 y solo destaca algunos.\n\n"
    },
    {
      "title": "Texinfo",
      "level": 2,
      "content": "Los programas de GNU se documentan utilizando la sintaxis de composición tipográfica Texinfo. Puede ver los documentos de información utilizando el programa info, proporcionado por el paquete texinfo, que forma parte de base.\n\nSi bien la mayoría de los programas de GNU también tienen páginas de manual, los documentos de información tienden a ser más completos.\n\n"
    },
    {
      "title": "Sistema Base",
      "level": 2,
      "content": "- GRUB — GRUB es el gestor de arranque del proyecto GNU.\n\n- Bash — Es un intérprete de línea de órdenes compatible con sh que incorpora características útiles del intérprete de línea de órdenes Korn (ksh) y del intérprete de línea de órdenes C (csh).\n\n- Coreutils — Coreutils proporciona las utilidades básicas de manipulación de archivos, intérprete de línea de órdenes y texto del sistema operativo GNU.\n\n- gzip — gzip es tanto un formato de archivo como una aplicación para compresión y descompresión.\n\n- tar — Proporciona la capacidad de crear o descomprimir archivos tar, así como varios otros tipos de manipulación.\n\n"
    },
    {
      "title": "Toolchain",
      "level": 2,
      "content": "La mayoría de las herramientas de toolchain de GNU están en el grupo base-devel, excepto glibc, que está en base y GDB, que no está en ningún grupo.\n\n- GNU make — Utilidad para mantener grupos de programas.\n\n- GCC — La colección de compiladores GNU - frontends de C y C++.\n\n- glibc — Implementación de GNU de la biblioteca C.\n\n- GNU Binutils — Un conjunto de programas para ensamblar y manipular archivos binarios y de objetos. Incluye ld.\n\n- GNU bison — El generador de analizadores (parser generator) de propósito general de GNU.\n\n- GNU m4 — El procesador de macros de GNU.\n\n- GDB — El depurador de GNU.\n\n"
    },
    {
      "title": "Sistema de construcción",
      "level": 3,
      "content": "De Wikipedia:\n\n- GNU Autoconf — Herramienta para configurar automáticamente el código fuente.\n\n- GNU Automake — Herramienta para crear Makefiles automáticamente.\n\n- GNU Libtool — Una biblioteca genérico de soporte para script.\n\n"
    },
    {
      "title": "Otros programas",
      "level": 2,
      "content": "Muchas otras herramientas de GNU opcionales están disponibles en los repositorios oficiales:\n\n- GNOME, un entorno de escritorio\n- GIMP, un editor de imágenes\n- GTK+, un kit de herramientas de widgets\n- Gnumeric, un programa de hoja de cálculo\n- GNU Parted, un gestor de particiones\n- GNU Screen, un multiplexor de terminal\n- GNU nano, un editor de texto de línea de órdenes\n- GNU Emacs, Un editor de texto extensible, personalizable y autodocumentado\n- GnuPG, una implementación de OpenPGP\n- GNU Octave, un lenguaje de programación científica\n- GNU Readline, Una biblioteca de edición para interfaces de línea de órdenes\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- https://www.gnu.org/\n- El manifiesto de GNU\n- Wikipedia:es:Anexo:Paquetes GNU\n- El proyecto Arch Hurd tiene como objetivo portar Arch Linux al kernel Hurd.\n\n"
    }
  ]
}