{
  "title": "GNU nano (Español)",
  "url": "https://wiki.archlinux.org/title/GNU_nano_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-09-30** \n\nGNU nano (o nano) es un editor de texto cuya finalidad es presentar una interface simple con opciones de órdenes intuitivas para la edición de texto basada en consola. nano admite funciones que incluyen resaltado coloreado de la sintaxis, conversión de tipos de archivos DOS/Mac, corrección ortográfica y codificación UTF-8. nano se inicia con un búfer vacío que generalmente ocupa menos de 4 MB alojado en la memoria.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete nano.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "La apariencia, experiencia y funcionamiento de nano, generalmente, se controlan mediante argumentos dados en la línea de órdenes u mediante órdenes de configuración presentes en el archivo ~/.config/nano/nanorc.\n\nSe instala un archivo de configuración de muestra al instalar el programa, que se encuentra en /etc/nanorc. Para personalizar la configuración de nano, primero cree una copia local en ~/.config/nano/nanorc:\n\n```\n$ cp /etc/nanorc ~/.config/nano/nanorc\n```\n\nProceda a establecer el entorno de la consola de nano marcando y/o desmarcando órdenes en el archivo ~/.config/nano/nanorc.\n\n"
    },
    {
      "title": "Resaltado de sintaxis",
      "level": 3,
      "content": "Nano se entrega con reglas predefinidas de resaltado de sintaxis, establecidas en /usr/share/nano/*.nanorc. Para activarlas, añada la siguiente línea a ~/.config/nano/nanorc o a /etc/nanorc:\n\n```\ninclude \"/usr/share/nano/*.nanorc\"\n```\n\nPara mejorar el resaltado de la sintaxis que reemplacen y expandan los valores predeterminados, instale nano-syntax-highlighting o nano-syntax-highlighting-gitAUR y, además de la configuración anterior, añada también:\n\n```\ninclude \"/usr/share/nano-syntax-highlighting/*.nanorc\"\n```\n\n"
    },
    {
      "title": "Forth",
      "level": 4,
      "content": "Consulte https://paste.xinu.at/wc17YG/ para resaltar Forth.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 4,
      "content": "Guarde https://paste.xinu.at/4ss/ (similar al antiguo servidor de Arch svntogit) en /etc/nano/pkgbuild.nanorc e inclúyalo:\n\n```\ninclude \"/etc/nano/pkgbuild.nanorc\"\n```\n\n"
    },
    {
      "title": "Suspensión",
      "level": 3,
      "content": "A diferencia de la mayoría de los programas interactivos, la suspensión no está activada de manera predeterminada. Para cambiar esto, descomente la línea set suspend en /etc/nanorc. Esto le permitirá utilizar las teclas Ctrl+z para hacer que nano funcione en segundo plano.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Los accesos directos se pueden ver desde el interior de nano. Consulte los archivos de ayuda de nano en línea con Ctrl+g una vez dentro de nano y el Manual de órdenes de nano para obtener descripciones completas y asistencia adicional.\n\nVea también la cheatsheet para nano.\n\n"
    },
    {
      "title": "Funciones especiales",
      "level": 3,
      "content": "Los atajos del teclado que representan las funciones comunmente utilizadas, se enumeran a lo largo de las dos líneas inferiores en la pantalla de nano.\n\nSe pueden alternar mediante:\n\n- Ctrl para atajos basados ​​en ^.\n- Meta (normalmente Alt) o Esc para atajos basados ​​en M-.\n\n"
    },
    {
      "title": "Reemplazar vi con nano",
      "level": 3,
      "content": "Para reemplazar vi con nano como editor de texto predeterminado para órdenes como visudo, ajuste las variables de entorno VISUAL y EDITOR, por ejemplo:\n\n```\nexport VISUAL=nano\nexport EDITOR=nano\n```\n\n"
    },
    {
      "title": "Conflictos con combinaciones de teclas",
      "level": 3,
      "content": "Algunos gestores de ventanas tienen combinaciones de teclas que entran en conflicto con nano, por ejemplo Alt+Intro. Elimínelas o reasígnelas, por ejemplo, a Super (con dconf para mutter, muffin y marco) y reinicie el gestor de ventanas.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- nano (editor de texto) — Entrada de Wikipedia.\n- GNU nano Homepage — Sitio oficial.\n- GNU nano Bugs — Informe de errores.\n- Improved Nano Syntax Highlighting Files.\n\n"
    }
  ]
}