{
  "title": "Gocryptfs (Español)",
  "url": "https://wiki.archlinux.org/title/Gocryptfs_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nNote: **2020-08-06** \n\nArtículos relacionados\n\n- Data-at-rest encryption (Español)\n- EncFS (Español)\n\nDe gocryptfs:\n\nConsulte la página principal del proyecto gocryptfs para obtener más información sobre sus características, puntos de referencia, etc. Consulte Data-at-rest encryption (Español)#Cuadro comparativo para obtener una descripción general de métodos alternativos y EncFS como una alternativa directa.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale gocryptfs o gocryptfs-gitAUR.\n\nComo sistema de archivos FUSE, gocryptfs es totalmente configurable por el usuario (sin necesidad de poderes administrativos) y almacena sus archivos de configuración en el directorio del usuario.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Vea gocryptfs(1) y sus ejemplos primero.\n\n- Para lograr su objetivo de diseñar un cifrado autenticado, gocryptfs implementa un modo de cifrado AES-EME (para nombres de archivos, no el contenido). Si bien este modo aún no se ha usado/auditado ampliamente, ofrece protección de integridad para los datos, una característica que no está disponible para métodos alternativos de cifrado directo.\n- Consulte el bug report del seguimiento del proyecto con respecto a los hallazgos de la primera auditoría de seguridad para obtener más información.\n\n"
    },
    {
      "title": "Ejemplo usando el modo inverso",
      "level": 3,
      "content": "Una aplicación importante para los métodos de cifrado basados ​​en archivos son las copias de seguridad cifradas. Los sistemas de archivos basados ​​en FUSE son flexibles para esto, ya que permiten una amplia gama de destinos de las copias de respaldo utilizando herramientas estándar. Por ejemplo, un punto de montaje FUSE encriptado con gocryptfs puede ser fácilmente creado directamente en una ubicación Samba/NFS o Dropbox, sincronizado con un servidor remoto con rsync, o basta con copiarse manualmente en un almacenamiento de respaldo remoto.\n\nEl modo inverso de gocryptfs es particularmente útil para crear copias de seguridad cifradas, ya que prácticamente no requiere capacidad de almacenamiento adicional en la máquina para realizar las copias de seguridad.\n\nA continuación se muestra un ejemplo de usuario archie que crea una copia de seguridad de /home/archie:\n\nPrimero, archie deberá inicializar la configuración para el directorio home:\n\n```\n$ gocryptfs -init -reverse /home/archie\n```\n\n```\nChoose a password for protecting your files.\nPassword:\n...\n```\n\nEn segundo lugar, creará y montará un directorio vacío para la versión cifrada del directorio home:\n\n```\n$ mkdir /tmp/crypt\n$ gocryptfs -reverse /home/archie /tmp/crypt\nPassword:\nDecrypting master key\n\nYour master key is:\n...\nFilesystem mounted and ready.\n$\n```\n\nTercero, archie creará una copia de seguridad del directorio encriptado, una copia local simple para este ejemplo:\n\n```\n$ cp -a /tmp/crypt /tmp/backup\n```\n\ny hecho.\n\nEl directorio encriptado puede permanecer montado durante la sesión del usuario, o desmontarse manualmente:\n\n```\n$ fusermount -u /tmp/crypt\n$ rmdir /tmp/crypt\n```\n\nPara restaurar el contenido desde la copia de seguridad cifrada, se monta una vista de texto sin formato utilizando el modo normal de gocryptfs:\n\n```\n$ mkdir /tmp/restore\n$ gocryptfs /tmp/backup/ /tmp/restore\nPassword: \nDecrypting master key\n...\nFilesystem mounted and ready.\n$\n```\n\nAhora se pueden restaurar los archivos necesarios.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- A first security audit de gocryptfs\n- RFC5297 Synthetic Initialization Vector (SIV) Authenticated Encryption Using the Advanced Encryption Standard (AES)\n\n"
    }
  ]
}