{
  "title": "Gopher (Português)",
  "url": "https://wiki.archlinux.org/title/Gopher_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Gopher é um protocolo para transferência de informações pela Internet que era muito popular antes do HTTP assumir como o protocolo dominante, mas ainda há uma comunidade de usuários gopher que prefere a simplicidade do protocolo em relação aos protocolos mais complexos e grandes mais frequentemente encontrados. Note que nem todos os navegadores possuem suporte ao gopher, ou têm suporte incompleto.\n\n"
    },
    {
      "title": "Servidor GoFish",
      "level": 2,
      "content": "GoFish é um servidor gopher básico que permite que você execute seu próprio gopherspace. A configuração é semelhante a outros servidores, mas geralmente requer menos recursos para funcionar.\n\n"
    },
    {
      "title": "Instalação",
      "level": 3,
      "content": "Instale o pacote gofish-binAUR.\n\n"
    },
    {
      "title": "Configuração",
      "level": 3,
      "content": "Existem algumas configurações básicas para o servidor que você pode alterar no arquivo /etc/gofish.conf, mas os padrões funcionarão. Se você não alterar nenhuma configuração, a raiz do servidor gopher será /var/gopher e será executada na porta 70. (Observe que o Firefox só pode usar o protocolo gopher na porta 70, então mudar isso significará que seus usuários devem usar algum outro cliente.)\n\nPara rodar o servidor, inicie gofish.service.\n\nVocê pode conectar ao seu servidor e ver o que você tem navegando em gopher://127.0.0.1\n\n"
    },
    {
      "title": ".cache",
      "level": 3,
      "content": "Ao contrário do FTP, que mostra automaticamente todos os arquivos, o gopher depende de um arquivo chamado .cache em cada diretório para determinar como a página será mostrada ao usuário final. Embora o GoFish venha com a página man dotcache(5) para os arquivos .cache, pode ser um pouco confuso. O GoFish também vem com um programa para autogerar os arquivos .cache para todos os diretórios e arquivos na raiz do seu servidor.\n\n```\nmkcache -r\n```\n\nIsto irá criar todos os arquivos .cache necessários de forma recursiva, mas você pode querer editar alguns nomes. Um exemplo de arquivo .cache se parece com isto:\n\n```\niHello         none            example.com     70\n0ReadMe\t0/ReadMe.txt\texample.com\t70\n1Ebooks\t1/ebooks\texample.com\t70\n```\n\nO protocolo gopher usa prefixos numéricos para descrever o tipo de arquivo. 0 é um arquivo de texto simples, 1 é um diretório e 9 é um arquivo binário. O i indica uma imagem e, se estiver vinculada a none, ela será mostrada como texto simples. Isso é bom para apresentar seu site. Veja a página do manual dotcache(5) para mais informações sobre os prefixos. Após o prefixo, o nome será exibido no cliente e não precisará ser o mesmo que o arquivo ao qual ele está vinculado. Na segunda seção, vemos o \"caminho\" para o arquivo. Não existe um diretório chamado 0 ou 1 no sistema de arquivos, ele é adicionado apenas no URI para permitir que o servidor gopher e o usuário final saibam que tipo de arquivo ele é. A terceira seção é qualquer nome de domínio do site e o quarto é a porta em que está, o padrão é 70. O espaço entre cada uma das quatro seções deve ser uma guia, não um espaço ou não será analisado corretamente.\n\nAgora vamos examinar o arquivo .cache no diretório de e-books.\n\n```\n9Book 1\t9/ebooks/Book1.chm\texample.com\t70\n9Book 2\t9/ebooks/Book2.pdf\texample.com\t70\n```\n\nObserve que o URI é 9/ebooks/Book1.chm, e não 1/ebooks/9Book1.chm. Há sempre apenas um número de prefixo para o último item no URI. Observe também que um arquivo chm ou um arquivo pdf não são exatamente binários, mas ainda recebem o prefixo 9. No servidor GoFish, qualquer arquivo que não seja um arquivo de texto ou um diretório recebe o prefixo binário. Lembre-se que, se houver arquivos na raiz do seu servidor, as pessoas podem baixá-los ou visualizá-los, mesmo que eles não estejam no seu arquivo .cache, portanto, tenha cuidado.\n\n"
    },
    {
      "title": "Overbite para Firefox",
      "level": 2,
      "content": "The Overbite Project adiciona capacidade de gopherspace em alguns navegadores e dispositivos, incluindo o Mozilla Firefox. Verifique os complementos firefox-extension-overbitenxAUR ou overbitewx.\n\n"
    },
    {
      "title": "Acesso HTTP via proxy Gopher",
      "level": 2,
      "content": "Você pode usar https://gopher.floodgap.com/gopher/gw para navegar na rede Gopher via HTTP, por exemplo, usando um navegador sem suporte a Gopher.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Site do GoFish\n- Exemplos de sites Gopher\n\n"
    }
  ]
}