{
  "title": "GPhoto (Español)",
  "url": "https://wiki.archlinux.org/title/GPhoto_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-09** \n\nLibgphoto2 es la principal librería diseñada para permitir el acceso a cámaras digitales por parte de programas externos (frontend), como digiKam y gPhoto2. La lista de cámaras oficialmente soportadas está disponible en su página web (aunque podrían funcionar más).\n\nEste artículo documenta la configuración de libgphoto2 para acceder a las cámaras digitales. Algunas cámaras se montarán como dispositivos de almacenamiento USB normales y pueden no requerir el uso de libgphoto2.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete libgphoto2, y opcionalmente gphoto2 para tener una interfaz de línea de comandos.\n\n"
    },
    {
      "title": "Aplicaciones frontend",
      "level": 3,
      "content": "- Darktable — Utilidad para organizar y revelar imágenes raw.\n\n- digiKam — Aplicación de gestión de fotografías digitales para KDE.\n\n- Entangle — Proporciona una interfaz gráfica para \"tethered shooting\", es decir, para tomar fotografías con una cámara digital completamente controlada desde el ordenador.\n\n- gphotofs — Módulo Fuse para montar la cámara como un sistema de archivos.\n\n- gThumb — Navegador y visor de imágenes para GNOME.\n\n- GTKam — Frontend gráfico GTK 2 para gPhoto2.\n\n- gvfs-gphoto2 — Backend de GPhoto2 para GVfs para montar la cámara como un sistema de archivos desde un gestor de archivos que soporte GVfs como GNOME Files, Nemo, PCManFM y Thunar.\n\n- Kamera — Integración KDE para cámaras gPhoto2.\n\n- Pantheon Photos — Visor de imágenes para Pantheon.\n\n- Rapid Photo Downloader — Descargue fotos y vídeos de cámaras, tarjetas de memoria y dispositivos de almacenamiento portátiles.\n\n- Rawstudio — Un conversor de imágenes raw de código abierto escrito en GTK. Soporta tethered shooting con gPhoto2.\n\n- Shotwell — Organizador de fotos digital diseñado para GNOME.\n\n"
    },
    {
      "title": "Utilización de GPhoto2",
      "level": 2,
      "content": "GPhoto2 es un cliente de línea de comandos para libgphoto2. GPhoto2 permite acceder a la librería libgphoto2 desde un terminal o desde un shell script para realizar cualquier operación de cámara que sea posible. Esta es la principal interfaz de usuario.\n\nGPhoto2 también proporciona útiles funciones de depuración para los desarrolladores de controladores de cámaras.\n\nComandos rápidos\n\n- gphoto2 --list-ports\n- gphoto2 --auto-detect\n- gphoto2 --summary\n- gphoto2 --list-files\n- gphoto2 --get-all-files\n- gphoto2 --set-config datetime=now - sets the camera to the current time\n\nPara la manipulación avanzada de archivos, utilice\n\n- gphoto2 --shell\n\n"
    },
    {
      "title": "Ejemplo de uso con GVfs",
      "level": 3,
      "content": "Autodetecte la cámara conectada y liste el puerto requerido:\n\n```\n$ gphoto2 --auto-detect\nModel                          Port                                            \n----------------------------------------------------------\nCanon Digital IXUS 980 IS      usb:006,011\n```\n\nAhora abra su gestor de archivos favorito e introduzca la dirección del puerto encontrado con el detalle \"gphoto2://[usb:006,011]\" - la cámara se montará con GVfs y podrá ser gestionada con el gestor de archivos.\n\n"
    },
    {
      "title": "Problemas de permisos",
      "level": 2,
      "content": "Los usuarios con una sesión local tienen concedidos permisos para las cámaras mediante ACLs. Véase General troubleshooting (Español)#Permisos de sesión si no funciona.\n\n"
    }
  ]
}