{
  "title": "GPS (Polski)",
  "url": "https://wiki.archlinux.org/title/GPS_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Jest wiele różnych sprzętowych odbiorników Global Positioning System (GPS) wspieranych przez Arch Linux:\n\n- Adaptery Bluetooth GPS\n- Adaptery USB GPS (wewnętrzne bądź zewnętrzne)\n- Adaptery zintegrowane-z-WWAN (np. niektóry moduły HP EliteBook)\n- Smartfony są w stanie przekazywać dane GPS poprzez USB lub Bluetooth za pomocą dodatkowego oprogramowania\n\n"
    },
    {
      "title": "Sterowniki",
      "level": 2,
      "content": "Zazwyczaj urządzenie GPS jest przedstawiane jako urządzenie szeregowe, a jądro używa standardowego sterownika, ale w niektórych przypadkach sterowniki takie jak mtkbabelAUR bądź mbm-gpsd-pl4nkton-gitAUR muszą zostać doinstalowane.\n\n"
    },
    {
      "title": "Interfejsy",
      "level": 2,
      "content": "System GPS nie ma zbytnio ujednoliconego interfejsu ani konfiguracji w Linuksie. Surowe dane GPS są wyświetlane w urządzeniu szeregowych, a programy same interpretują lokalizację, blokując urządzenie. Współdzielenie adaptera GPS z wieloma aplikacjami jest możliwe dzięki gpsd.\n\n"
    },
    {
      "title": "GPSD",
      "level": 3,
      "content": "GPSD to demon służący do odpytywania urządzenia GPS oraz do pokazania wyniku na serwerze TCP. Jest to najbardziej standardowy interfejs GPS w Linuksie, a aplikacje obsługujące GPS zwykle wspierają jego użycie.\n\n"
    },
    {
      "title": "ModemManager",
      "level": 3,
      "content": "ModemManager to pewnego rodzaju pakiet obsługi modemów WWAN, który łączy się z NetworkManager. Wspiera on pozyskiwanie koordynatów GPS z - obsługujących ten system - kart WWAN i nawet wyświetla tą lokalizację w modem-manager-gui. Najważniejsze polecenia to:\n\n"
    },
    {
      "title": "Wyświetlenie możliwości lokalizacji",
      "level": 4,
      "content": "```\n# mmcli -m 0 --location-status\n```\n\n"
    },
    {
      "title": "Włączenie GPS",
      "level": 4,
      "content": "```\n# mmcli -m 0 --location-enable-gps-raw --location-enable-gps-nmea\n```\n\n"
    },
    {
      "title": "Wyświetlenie lokalizacji",
      "level": 4,
      "content": "```\n# watch mmcli -m 0 --location-get\n```\n\n"
    },
    {
      "title": "Wyłączenie GPS",
      "level": 4,
      "content": "```\n# mmcli -m 0 --location-disable-gps-raw --location-disable-gps-nmea\n```\n\n"
    },
    {
      "title": "Klienci",
      "level": 2,
      "content": "Pakiet gpsd dostarcza cgps - prosty, konsolowy klient służący do pokazywania bieżącego statusu urządzenia GPS.\n\n"
    },
    {
      "title": "Synchronizacja czasu",
      "level": 3,
      "content": "Zobacz Network Time Protocol daemon#Using ntpd with GPS\n\n"
    },
    {
      "title": "Zobacz także",
      "level": 2,
      "content": "- Włączanie lokalizacji GPS w ModemManager\n\n"
    }
  ]
}