{
  "title": "Grafana (Português)",
  "url": "https://wiki.archlinux.org/title/Grafana_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Zabbix\n- Munin\n\nGrafana é um painel de composição de uso geral e de código aberto, que é executado como um aplicativo da web. Possui suporte a graphite, InfluxDB, Prometheus ou opentsdb como backends.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote grafana.\n\nDepois disso, você pode habilitar e iniciar o grafana.service e acessar o aplicativo no host local, por exemplo: http://127.0.0.1:3000. O nome de usuário padrão é admin e a senha admin para acessar a interface web.\n\n"
    },
    {
      "title": "Instalação com Influxdb",
      "level": 3,
      "content": "Um back-end usado com frequência é o InfluxDB. Habilite e inicie o influxdb.service. A interface da web está disponível em http://localhost:8086/\n\n"
    },
    {
      "title": "Agregar dados",
      "level": 3,
      "content": "Em caso de monitoramento de servidor escalonável em combinação com Grafana e InfluxDB, pode-se escolher software como collectdAUR. Mais geralmente, qualquer dado de medição pode ser agregado com o InfluxDB e exibido com o Grafana. Existem módulos e bibliotecas para diversas linguagens de programação para interagir com o InfluxDB e pode-se até armazenar dados com um simples comando http post usando o programa curl.\n\nEntão, crie um banco de dados chamado exemplo:\n\n```\ncurl -G http://localhost:8086/query --data-urlencode \"q=CREATE DATABASE exemplo\"\n```\n\nEnvie dados para o banco de dados exemplo:\n\n```\ncurl -i -XPOST 'http://localhost:8086/write?db=exemplo' --data-binary 'cpu_load_short,host=server01,region=us-west value=0.64 1434055562000000000'\n```\n\n"
    },
    {
      "title": "Criando painel do Grafana",
      "level": 3,
      "content": "- Antes de criar um painel, precisamos adicionar uma fonte de dados. Então, primeiro clique em Data sources no menu à esquerda e depois em Add new.\n- O nome pode ser algo como influxdb e o tipo deve ser definido como InfluxDB 0.9. Neste exemplo, a URL das configurações do HTTP é http://localhost:8086. Note que a porta não é a mesma da interface web! O nome do banco de dados corresponde ao escolhido anteriormente, por ex. exemplo. Se não for alterado, o nome de usuário e a senha serão root.\n- Clique em Test connection para ver tudo está funcionando e, em seguida, Save.\n- Em seguida, de volta à primeira página, clique em Home no canto superior esquerdo e depois em New.\n- Agora, isso pode ser um pouco contraintuitivo, mas para adicionar um novo painel você deve passar o mouse sobre a pequena caixa verde no lado esquerdo e depois, por exemplo, escolher: Adicionar painel e Graph.\n- Clique no título do novo gráfico e selecione Edit.\n- Nas configurações do gráfico em Metrics escolha influxdb como fonte de dados no canto inferior direito.\n- Crie uma consulta selecionando seus dados agregados. Clique em select measurement que está localizado ao lado de FROM. No menu suspenso, deve aparecer uma lista de \"tabelas\" em seu banco de dados, por exemplo, a tabela denominada localhost. Se nenhuma sugestão aparecer, sua conexão com o InfluxDB poderá ser interrompida ou nenhum dado foi agregado ainda.\n- Ao lado do texto em negrito SELECT clique em value e escolha, por exemplo, os dados de medição uptime.\n- Para salvar as alterações, clique em Back to dashboard, então no ícone de disquete.\n\n"
    }
  ]
}