{
  "title": "Grafana (Español)",
  "url": "https://wiki.archlinux.org/title/Grafana_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-09-07** \n\nArtículos relacionados\n\n- Zabbix\n- Munin\n\nGrafana es un panel de instrumentos y un compositor gráfico de uso general y de código abierto, que se ejecuta como una aplicación web. Es compatible con graphite, InfluxDB, Prometheus o opentsdb como backends.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete grafana.\n\nDespués de eso, puede activar e iniciar grafana.service y acceder a la aplicación en localhost, por ejemplo: http://127.0.0.1:3000 . El nombre de usuario predeterminado es admin y la contraseña admin para acceder a la interfaz web.\n\n"
    },
    {
      "title": "Instalación de Influxdb",
      "level": 3,
      "content": "Un backend de uso frecuente es InfluxDB. Active e inicie influxdb.service. La interfaz web está disponible en http://localhost:8086/\n\n"
    },
    {
      "title": "Agregar datos",
      "level": 3,
      "content": "En caso de monitoreo de servidor escalable en combinación con Grafana e InfluxDB, se podría elegir software como {collectdAUR. Con carácter más general, cualquier dato de medición puede agregarse con InfluxDB y mostrarse con Grafana. Hay módulos y bibliotecas para que varios lenguajes de programación interactúen con InfluxDB e, incluso, se pueden almacenar datos con una simple orden «post http» utilizando el programa curl.\n\nPor lo tanto, cree una base de datos llamada example:\n\n```\ncurl -G http://localhost:8086/query --data-urlencode \"q=CREATE DATABASE example\"\n```\n\nEnvíe información a la base de datos example:\n\n```\ncurl -i -XPOST 'http://localhost:8086/write?db=example' --data-binary 'cpu_load_short,host=server01,region=us-west value=0.64 1434055562000000000'\n```\n\n"
    },
    {
      "title": "Crear el panel de instrumentos de Grafana",
      "level": 3,
      "content": "- Antes de crear un panel de instrumentos, debemos agregar una fuente de datos. Así que primero haga clic en Data sources en el menú izquierdo y luego en Add new.\n- El nombre puede ser algo como influxdb y el tipo debe establecerse en InfluxDB 0.9. En este ejemplo, la url de la configuración Http es http://localhost:8086. Tenga en cuenta que el puerto no es el mismo que el de la interfaz web. El nombre de la base de datos corresponde al elegido anteriormente, por ejemplo example. Si no se cambia, el nombre de usuario y la contraseña son root.\n- Haga clic en Test connection para ver que todo funciona y luego en Save.\n- A continuación, vuelta en la página principal, haga clic en Home en la esquina superior izquierda y luego en New.\n- Ahora, esto puede ser un poco contrario a la intuición, pero para agregar un nuevo panel de instrumentos, debe desplazarse y hacer clic sobre el pequeño cuadro verde en el lado izquierdo y luego, por ejemplo, elegir: Add panel y Graph.\n- Haga clic en el título del nuevo gráfico y seleccione Edit.\n- En la configuración del gráfico en Metrics elija influxdb como fuente de datos en la esquina inferior derecha.\n- Cree una consulta seleccionando sus datos agregados. Haga clic en select measurement que se encuentra al lado de FROM. En el menú desplegable debe aparecer una lista de «tablas» en su base de datos, por ejemplo, la tabla llamada localhost. Si no surge ninguna sugerencia, su conexión a InfluxDB podría interrumpirse o puede ser que aún no se haya agregado ningún dato.\n- Junto al texto en negrita SELECT haga clic en value y elija, por ejemplo, los datos de medición uptime.\n- Para guardar los cambios, haga clic en Back to dashboard y luego en el icono del disquete.\n\n"
    }
  ]
}