{
  "title": "GraphicsMagick (Español)",
  "url": "https://wiki.archlinux.org/title/GraphicsMagick_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-11-17** \n\nSegún Wikipedia:\n\n```\n<policy domain=\"delegate\" rights=\"none\" pattern=\"gs\" />\n```\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete imagemagick. Alternativamente, instale graphicsmagick para GraphicsMagick, el cual es una derivación de ImageMagick, que enfatiza la estabilidad de la programación API y la interfaz de línea de órdenes.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Consulte ImageMagick(1), o gm(1) para GraphicsMagick.\n\nLas operaciones más populares incluyen -append, -resize, -rotate, -quality y algunas más. Por ejemplo, para combinar varias imágenes en una:\n\n```\n$ convert -append input.pngs output.png\n```\n\nPara recortar parte de varias imágenes y convertirlas a otro formato:\n\n```\n$ mogrify -crop ANCHOxALTO+X+Y -format jpg *.png\n```\n\nDonde ANCHO y ALTO es el tamaño de la imagen de salida recortada, y X e Y son los márgenes del tamaño de la imagen de entrada.\n\n"
    },
    {
      "title": "Captura de pantalla",
      "level": 3,
      "content": "Una manera fácil de tomar una captura de pantalla de su sistema actual es utilizar la orden import(1):\n\n```\n$ import -window root screenshot.jpg\n```\n\nimport es parte del paquete imagemagick.\n\nEjecutar import sin la opción -window permite seleccionar una ventana o una región arbitraria de forma interactiva.\n\nNote: **graphicsmagick** \n\n"
    },
    {
      "title": "Captura de pantalla de múltiples pantallas X",
      "level": 4,
      "content": "Si ejecuta twinview o dualhead, simplemente tome la captura de pantalla dos veces y use imagemagick para pegarlas:\n\n```\nimport -window root -display :0.0 -screen /tmp/0.png\nimport -window root -display :0.1 -screen /tmp/1.png\nconvert +append /tmp/0.png /tmp/1.png screenshot.png\nrm /tmp/{0,1}.png\n```\n\n"
    },
    {
      "title": "Captura de pantalla de encabezados individuales de Xinerama",
      "level": 4,
      "content": "Las configuraciones de múltiples encabezados basadas en Xinerama tienen solo una pantalla virtual. Si las pantallas físicas están en diferentes alturas, encontrará un espacio muerto en la captura de pantalla. En este caso, es posible que desee tomar una captura de pantalla de cada pantalla física individualmente. Mientras la información de Xinerama esté disponible desde el servidor X, funcionará lo siguiente:\n\n```\n#!/bin/sh\nxdpyinfo -ext XINERAMA | sed '/^  head #/!d;s///' |\nwhile IFS=' :x@,' read i w h x y; do\n        import -window root -crop ${w}x$h+$x+$y head_$i.png\ndone\n```\n\n"
    },
    {
      "title": "Captura de pantalla de la ventana activa/enfocada",
      "level": 4,
      "content": "El siguiente script toma una captura de pantalla de la ventana actualmente enfocada. Funciona con gestores de ventanas de X compatibles con EWMH/NetWM. Para evitar sobrescribir capturas de pantalla anteriores, la fecha actual se utiliza como nombre del archivo.\n\n```\n#!/bin/sh\nactiveWinLine=$(xprop -root | grep \"_NET_ACTIVE_WINDOW(WINDOW)\")\nactiveWinId=${activeWinLine:40}\nimport -window \"$activeWinId\" /tmp/$(date +%F_%H%M%S_%N).png\n```\n\nAlternativamente, lo siguiente debería funcionar independientemente del soporte EWMH:\n\n```\n$ import -window \"$(xdotool getwindowfocus -f)\" /tmp/$(date +%F_%H%M%S_%N).png\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- ImageMagick website para obtener una extensa lista de opciones y ejemplos.\n- List of applications/Multimedia#Image processing\n\n"
    }
  ]
}