{
  "title": "GTK (Русский)",
  "url": "https://wiki.archlinux.org/title/GTK_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Единый вид приложений Qt и GTK\n- Qt (Русский)\n- GNU (Русский)\n\nC сайта GTK:\n\nGTK, GIMP Toolkit, изначально сделан проектом GNU для GIMP, но теперь это очень популярный инструмент, имеющий биндинги для многих языков программирования. Эта статья рассматривает инструменты, используемые для настройки тем GTK, стилей, иконок, шрифтов и размеров шрифтов, а также подробную ручную настройку.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Доступно несколько версий GTK. Их можно установить с помощью следующих пакетов:\n\n- GTK 4.x доступен с пакетом gtk4.\n- GTK 3.x доступен с пакетом gtk3.\n- GTK 2.x доступен с пакетом gtk2.\n- GTK 1.x доступен с пакетом gtkAUR.\n\n"
    },
    {
      "title": "Темы",
      "level": 2,
      "content": "GTK 3 и GTK 4 по умолчанию используют тему Adwaita, но также доступны темы HighContrast и HighContrastInverse. В GTK 2 тема по умолчанию Raleigh, но Arch Linux имеет свой файл настроек /usr/share/gtk-2.0/gtkrc, который устанавливает тему по умолчанию Adwaita.\n\nВыбрать определённую тему можно с помощью переменной окружения:\n\n- Для GTK 3 и GTK 4 используйте переменную GTK_THEME. Например, чтобы запустить Калькулятор GNOME с тёмным вариантом темы Adwaita:\n\n```\n$ GTK_THEME=Adwaita:dark gnome-calculator\n```\n\n- Применение переменной к ярлыкам приложений описано в статье Ярлыки приложений#Изменение переменных окружения.\n- Приложения, использующие libadwaita, требуют специальной поддержки и обязательной установки переменной окружения GTK_THEME, если используется тема GTK, отличная от Adwaita или Adwaita-dark.\n\n- Для GTK 2 используйте переменную GTK2_RC_FILES. Например, чтобы запустить GIMP с темой Raleigh:\n\n```\n$ GTK2_RC_FILES=/usr/share/themes/Raleigh/gtk-2.0/gtkrc gimp\n```\n\nДругие темы могут быть установлены из официальных репозиториев или из AUR. Также можно вручную поместить темы в ~/.themes/ или ~/.local/share/themes/.\n\nТемы с поддержкой GTK 2 и GTK 3:\n\n- Adapta — Адаптивная тема GTK, основанная на Material Design. Включает: Adapta, Adapta-Eta, Adapta-Nokto, Adapta-Nokto-Eta\n\n- Arc — Плоская тема с современным внешним видом и прозрачными элементами. Включает: Arc, Arc-Dark, Arc-Darker\n\n- Bluebird — Blue Desktop Suite для Xfce.\n\n- Breeze — GTK версия тем виджетов KDE по умолчанию. Включает: Breeze, Breeze-Dark\n\n- Deepin — Тема по умолчанию для рабочего стола Deepin. Включает: deepin, deepin-dark\n\n- GNOME Extra Themes — Дополнительные темы для рабочего стола GNOME. Включает: Adwaita, Adwaita-dark, HighContrast\n\n- Greybird — Серо-голубая тема Xfce, используемая по умолчанию в Xubuntu 12.04.\n\n- Materia — Плоская тема в стиле Material Design для GTK3, GTK2 и GNOME Shell.\n\n- MATE Themes — Тема по умолчанию для рабочего стола MATE. Включает: BlackMATE, Blue-Submarine, BlueMenta, ContrastHighInverse, Green-Submarine, GreenLaguna, Menta, TraditionalGreen, TraditionalOk\n\n- Numix — Плоская и лёгкая тема с современным видом (GNOME, Openbox, Unity, Xfce). Включает: Numix\n\n- Vertex — Тема для GTK 3, GTK 2, Gnome-Shell и Cinnamon.\n\n- Zuki — Темы для GTK, gnome-shell и др.\n\nЕсть ряд дополнительных тем GTK в AUR: поиск gtk-theme.\n\n"
    },
    {
      "title": "GTK и Qt",
      "level": 3,
      "content": "Если у вас есть GTK и Qt (KDE) приложения на рабочем столе, то вы знаете, что их внешность не сочетается/не совпадает. Если вы хотите, чтобы ваши стили GTK соответствовали вашим стилям Qt, смотрите статью Единый вид приложений Qt и GTK.\n\n"
    },
    {
      "title": "Средства настройки",
      "level": 2,
      "content": "Почти все основные среды рабочего стола предоставляют инструменты для настройки тем GTK, иконок, шрифта и размера шрифта, и управляют этими настройками с помощью XSettings:\n\n- Если вы используете Cinnamon, используйте Themes tool (cinnamon-settings themes): перейдите в Параметры > Параметры системы > Оформление.\n- Если вы используете Enlightenment: перейдите в Settings > All > Look > Application Theme.\n- Если вы используете GNOME, используйте Gnome Tweaks (gnome-tweaks): установите gnome-tweaks.\n- Если вы используете MATE, используйте Appearance Preferences tool (mate-appearance-properties): перейдите в Система > Параметры > Внешний вид.\n- Если вы используете Xfce, используйте Appearance tool: перейдите Настройки > Внешний вид.\n\nДругие графические инструменты, как правило перезаписывают файлы настроек.\n\nИнструменты, поддерживающие GTK 2 и GTK 3:\n\n- KDE GTK Configurator — Приложение, которое позволяет изменять стиль и шрифт приложений GTK 2 и GTK 3.\n\n- LXAppearance — независимая от среды рабочего стола утилита настройки GTK 2 и GTK 3 от проекта LXDE (не требует других частей LXDE).\n\n- Oo-mox — Графическое приложение для генерации различных цветовых вариаций тем Numix и Flat-Plat (GTK 2 и 3), тем иконок Archdroid и Gnome-Colors. Также позволяет генерировать предварительно масштабированные темы GTK 2 для HiDPI-дисплеев.\n\nИнструменты, поддерживающие только GTK 2:\n\n- GTK Change Theme — Маленькая программа, которая позволяет изменять вашу GTK 2.0 тему (считается лучшей альтернативой switch2).\n\n- GTK Preference Tool — Переключает темы GTK и меняет шрифт.\n\n- GTK Theme Switch — Простой переключатель тем GTK.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Параметры GTK могут быть вручную заданы в файлах настройки, но среда рабочего стола и приложения могут переопределить эти параметры. В зависимости от версии GTK, эти файлы находятся по пути:\n\n- GTK 2 конкрентного пользователя: ~/.gtkrc-2.0\n- GTK 2 всей системы: /etc/gtk-2.0/gtkrc\n- GTK 3 конкрентного пользователя: $XDG_CONFIG_HOME/gtk-3.0/settings.ini или $HOME/.config/gtk-3.0/settings.ini если не установлена $XDG_CONFIG_HOME\n- GTK 3 всей системы: /etc/gtk-3.0/settings.ini\n- GTK 4 конкрентного пользователя: $XDG_CONFIG_HOME/gtk-4.0/settings.ini или $HOME/.config/gtk-4.0/settings.ini если не установлена $XDG_CONFIG_HOME\n- GTK 4 всей системы: /etc/gtk-4.0/settings.ini\n\n- Полный список доступных настроек описан в документации GtkSettings (GTK 4, GTK 3, GTK 2).\n- Некоторые описанные ниже настройки (например gtk-icon-sizes) являются устаревшими и игнорируется с GTK 3.10.\n- При редактировании файлов настроек GTK изменения будут применены только для вновь запущенных приложений.\n\n"
    },
    {
      "title": "Базовая настройка темы",
      "level": 3,
      "content": "Для ручного изменения темы GTK, иконок, шрифтов и размеров шрифтов добавьте следующие файлы настроек, например:\n\n- GTK 2:\n\n```\n~/.gtkrc-2.0\n```\n\n```\ngtk-icon-theme-name = \"Adwaita\"\ngtk-theme-name = \"Adwaita\"\ngtk-font-name = \"DejaVu Sans 11\"\n```\n\n- GTK 3:\n\n```\n$XDG_CONFIG_HOME/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-icon-theme-name = Adwaita\ngtk-theme-name = Adwaita\ngtk-font-name = DejaVu Sans 11\n```\n\n- GTK 4:\n\n```\n$XDG_CONFIG_HOME/gtk-4.0/settings.ini\n```\n\n```\n[Settings]\ngtk-icon-theme-name = Adwaita\ngtk-theme-name = Adwaita\ngtk-font-name = DejaVu Sans 11\n```\n\nЕсли тема для GTK 3 не применяется, в дополнение к этому используйте gsettings:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme Pop\n```\n\n"
    },
    {
      "title": "Вариант тёмной темы",
      "level": 3,
      "content": "Некоторые темы GTK 3 содержат тёмный вариант темы, но он используется только когда приложение запрашивает именно его. Чтобы использовать тёмную тему со всеми GTK 3 приложениями, установите:\n\n```\ngtk-application-prefer-dark-theme = true\n```\n\nДля GTK 4 используйте:\n\n```\n$ gsettings set org.gnome.desktop.interface color-scheme prefer-dark\n```\n\n"
    },
    {
      "title": "Горячие клавиши",
      "level": 3,
      "content": "Горячие клавиши (accelerators) можно изменить путём наведения курсора мыши на соответствующий пункт меню и нажав нужную комбинацию клавиш. Чтобы включить эту функцию, установите:\n\n```\ngtk-can-change-accels = 1\n```\n\n"
    },
    {
      "title": "Горячие клавиши Emacs",
      "level": 4,
      "content": "Чтобы в приложениях GTK иметь горячие клавиши, подобные Emacs, добавьте следующее:\n\n```\n~/.gtkrc-2.0\n```\n\n```\ngtk-key-theme-name = \"Emacs\"\n```\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-key-theme-name = Emacs\n```\n\nДля GTK3 также выполните:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-key-theme \"Emacs\"\n```\n\nВ XFCE есть похожая настройка:\n\n```\n$ xfconf-query -c xsettings -p /Gtk/KeyThemeName -s Emacs\n```\n\nФайлы в /usr/share/themes/Emacs/ определяют сочетания клавиш Emacs и могут быть изменены. Копирование секций в пользовательский файл ~/.gtkrc-2.0 позволяет вносить изменения для каждого пользователя отдельно.\n\n"
    },
    {
      "title": "Задержка меню GNOME",
      "level": 3,
      "content": "Этот параметр управляет задержкой между \"указыванием мыши\" на меню и \"открытием меню\". Эта задержка измеряется в миллисекундах.\n\n```\ngtk-menu-popup-delay = 0\n```\n\n"
    },
    {
      "title": "Уменьшение размера виджетов",
      "level": 3,
      "content": "Если у вас небольшой экран или вы просто не любите большие иконки и виджеты, вы можете изменить их размер.\n\nДля того чтобы иконки были без текста в панели инструментов (допустимые значения), используйте\n\n```\ngtk-toolbar-style = GTK_TOOLBAR_ICONS\n```\n\nЧтобы использовать меньшие иконки:\n\n```\ngtk-icon-sizes = \"panel-menu=16,16:panel=16,16:gtk-menu=16,16:gtk-large-toolbar=16,16\\\n:gtk-small-toolbar=16,16:gtk-button=16,16\"\n```\n\nИли, чтобы удалить иконки из кнопок полностью:\n\n```\ngtk-button-images = 0\n```\n\nВы также можете удалить иконки из меню:\n\n```\ngtk-menu-images = 0\n```\n\nСмотрите также [1] и [2].\n\n"
    },
    {
      "title": "Скрытие кнопок CSD",
      "level": 3,
      "content": "Чтобы скрыть кнопки сворачивания и разворачивания, которые отображаются через декорирование на стороне клиента (CSD)[3] в окнах gtk3:\n\n```\ngtk-decoration-layout=menu:close\n```\n\nСмотрите документацию GTK.\n\n"
    },
    {
      "title": "Отключение вставки мышью",
      "level": 3,
      "content": "Чтобы отключить вставку средней кнопкой мыши из буфера обмена (PRIMARY):\n\n```\ngtk-enable-primary-paste=false\n```\n\n"
    },
    {
      "title": "Место запуска выбора файла",
      "level": 3,
      "content": "Чтобы открывать диалог \"выбор файла\" (например при открытии/сохранении) в текущем рабочем каталоге а не в последнем (recent) месте (обычно текущий-рабочий-каталог это домашний каталог), сделайте следующее:\n\nGTK 3\n\nИзмените DConf с gsettings:\n\n```\n$ gsettings set org.gtk.Settings.FileChooser startup-mode cwd\n```\n\nGTK 2:\n\nИзмените файл настроек ~/.config/gtk-2.0/gtkfilechooser.ini:\n\n```\nStartupMode=cwd\n```\n\n"
    },
    {
      "title": "Старое поведение прокрутки",
      "level": 3,
      "content": "До GTK 3.6 щелчок в стороне от ползунка прокрутки сдвигал прокрутку в направлении щелчка примерно на одну страницу. Начиная с GTK 3.6, прокрутка сразу перейдёт к позиции, в которой был выполнен щелчок. Такое поведение можно отменить в некоторых приложениях путем изменения следующей настройки:\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-primary-button-warps-slider = false\n```\n\n"
    },
    {
      "title": "Отключение наложения скроллбара",
      "level": 3,
      "content": "Начиная с GTK 3.15, наложение полосы прокрутки по умолчанию включено, что означает, что полосы прокрутки будут показываться только при наведении курсора мыши на приложение GTK. Такое поведение можно отменить, установив следующую переменную окружения: GTK_OVERLAY_SCROLLING=0. Смотрите Переменные окружения#Графические приложения.\n\nС версии GTK 3.24.9 это также можно отключить через настройки:\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-overlay-scrolling = false\n```\n\nGTK 4 больше не поддерживает GTK_OVERLAY_SCROLLING. Начиная с GTK 4, наложение полос прокрутки является частью инструментария. Переключатель был удалён, чтобы предотвратить поломку приложений, которые не были протестированы с обоими вариантами. Чтобы позволить разработчикам приложений решать, как должны выглядеть их приложения, GTK предоставляет механизм для отказа или добавления настройки для пользователей. Функция gtk_scrolled_window_set_overlay_scrolling() может быть использована для включения/выключения наложения для каждого приложения отдельно. Разработчики приложений могут дополнительно использовать GSettings, чтобы привязать к свойству пользовательскую настройку.\n\n"
    },
    {
      "title": "Удалить наложенные индикаторы скроллбара",
      "level": 4,
      "content": "Позиции наложения прокрутки обозначены тонкими пунктирными линиями в окне приложения. Они будут присутствовать, даже если наложение прокрутки отключено с помощью переменной окружения, упомянутой в предыдущем разделе. Для их удаления создайте следующий файл:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\n/* Remove dotted lines from GTK 3 applications */\nundershoot.top, undershoot.right, undershoot.bottom, undershoot.left { background-image: none; }\n```\n\n"
    },
    {
      "title": "Примеры",
      "level": 3,
      "content": "Примеры настройки GTK:\n\n```\n~/.gtkrc-2.0\n```\n\n```\ngtk-theme-name=\"Arc-Dark\"\ngtk-icon-theme-name=\"breeze-dark\"\ngtk-font-name=\"Sans 11\"\ngtk-cursor-theme-name=\"Breeze_Amber\"\ngtk-cursor-theme-size=0\ngtk-toolbar-style=GTK_TOOLBAR_BOTH_HORIZ\ngtk-toolbar-icon-size=GTK_ICON_SIZE_SMALL_TOOLBAR\ngtk-button-images=0\ngtk-menu-images=0\ngtk-enable-event-sounds=0\ngtk-enable-input-feedback-sounds=0\ngtk-xft-antialias=1\ngtk-xft-hinting=1\ngtk-xft-hintstyle=\"hintslight\"\ngtk-xft-rgba=\"rgb\"\n```\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-theme-name=Arc-Dark\ngtk-icon-theme-name=breeze-dark\ngtk-font-name=Sans 11\ngtk-cursor-theme-name=Breeze_Amber\ngtk-cursor-theme-size=0\ngtk-toolbar-style=GTK_TOOLBAR_BOTH_HORIZ\ngtk-toolbar-icon-size=GTK_ICON_SIZE_SMALL_TOOLBAR\ngtk-button-images=0\ngtk-menu-images=0\ngtk-enable-event-sounds=0\ngtk-enable-input-feedback-sounds=0\ngtk-xft-antialias=1\ngtk-xft-hinting=1\ngtk-xft-hintstyle=hintslight\ngtk-xft-rgba=rgb\n# gtk-decoration-layout=menu:close\n# gtk-application-prefer-dark-theme=1\n```\n\n```\n~/.config/gtk-4.0/settings.ini\n```\n\n```\n[Settings]\ngtk-theme-name=Adwaita\ngtk-icon-theme-name=gnome\ngtk-font-name=Cantarell 11\ngtk-cursor-theme-name=Grounation\ngtk-cursor-theme-size=0\ngtk-enable-event-sounds=1\ngtk-enable-input-feedback-sounds=1\ngtk-xft-antialias=1\ngtk-xft-hinting=1\ngtk-xft-hintstyle=hintfull\ngtk-primary-button-warps-slider=false\ngtk-xft-rgba=none\n```\n\n"
    },
    {
      "title": "Бэкенды GDK",
      "level": 2,
      "content": "GDK (базовый уровень абстракции GTK) поддерживает несколько бэкендов для отображения GTK-приложений.\n\n"
    },
    {
      "title": "Бэкенд Wayland",
      "level": 3,
      "content": "Бэкенд GDK Wayland поддерживается только в gtk3 и используется по умолчанию в сеансах Wayland.\n\nПриложения, использующие версии GTK до gtk3, не имеют поддержки Wayland и будут использовать бэкенд X11 через Xwayland.\n\nПри использовании бэкенда Wayland некоторые переменные не берутся из settings.ini. Любой ключ, присутствующий в схеме GSettings org.gnome.desktop.interface, считывается оттуда вместо settings.ini.\n\nПримером таких переменных являются gtk-color-scheme и icon-theme, ключи которых должны быть прописаны в GSettings, чтобы применить тему в Wayland. В качестве альтернативы, если нужно настроить только тему, можно установить переменную окружения GTK_THEME.\n\n"
    },
    {
      "title": "Бэкенд Xorg",
      "level": 3,
      "content": "Если используется Xorg, бэкенд по умолчанию автоматически переключается на x11.\n\nМожно заставить приложения GTK3, работающие в сеансе Wayland, использовать бэкенд X11 через Xwayland, установив переменную окружения GDK_BACKEND=x11.\n\n"
    },
    {
      "title": "Бэкенд Broadway",
      "level": 3,
      "content": "GDK Broadway обеспечивает поддержку для отображения GTK приложений в веб-браузере, используя HTML5 и веб-соккеты. [4]\n\nПри использовании broadwayd, укажите номер дисплея для использования с префиксом двоеточие, похожий на X. На дисплее по умолчанию номер 0.\n\n```\n$ display_number=:5\n```\n\nЗапустите его.\n\n```\n$ broadwayd $display_number\n```\n\nПорт используемый по умолчанию\n\n```\nport = 8080 + $display_number\n```\n\nВ браузере откройте адрес http://127.0.0.1:порт\n\nДля запуска приложений\n\n```\n$ GDK_BACKEND=broadway BROADWAY_DISPLAY=$display_number <<app>>\n```\n\nВ качестве альтернативы, можно установить адрес и порт\n\n```\n$ broadwayd --port $port_number --address $address $display_number\n```\n\n"
    },
    {
      "title": "Различные темы приложений между GTK 2 и GTK 3",
      "level": 3,
      "content": "В общем, если выбранная тема имеет поддержку как для GTK 2 и GTK 3, тема будет применяться для всех GTK 2 и GTK 3 приложений. Если выбранная тема имеет поддержку только GTK 2, будет использоваться для GTK 2 приложений, и GTK тема по умолчанию будет использоваться для GTK 3 приложений. Если выбранная тема имеет поддержку только GTK 3, то будет использована для GTK 3 приложений, и GTK тема по умолчанию будет использоваться для GTK 2 приложений. Таким образом, для согласования тем приложений, лучше использовать тему, которая имеет поддержку как GTK 2 так и GTK 3.\n\nВы можете найти установленные темы на вашей системе с поддержкой обоих версий GTK 2 и GTK 3, используя эту команду (не работает с именами, содержащими пробелы):\n\n```\nfind $(find ~/.themes /usr/share/themes/ -wholename \"*/gtk-3.0\" | sed -e \"s/^\\(.*\\)\\/gtk-3.0$/\\1/\") -wholename \"*/gtk-2.0\" | sed -e \"s/.*\\/\\(.*\\)\\/gtk-2.0/\\1\"/\n```\n\n"
    },
    {
      "title": "Тема не применяется к приложениям root",
      "level": 3,
      "content": "Пользовательский файл темы ($XDG_CONFIG_HOME/gtk-3.0/settings.ini, ~/.gtkrc-2.0) не может быть прочитан другими аккаунтами, выбранная тема не будет применяться к приложениям X, запущенным от имени root. Возможные решения:\n\n- Создайте символические ссылки, например\n\n```\n# ln -s /home/пользователь/.gtkrc-2.0 /etc/gtk-2.0/gtkrc\n# ln -s /home/пользователь/.config/gtk-3.0/settings.ini /etc/gtk-3.0/settings.ini\n```\n\n- Измените общесистемный файл настроек: /etc/gtk-3.0/settings.ini (GTK 3) или /etc/gtk-2.0/gtkrc (GTK 2)\n- Выполните настройку темы от имени root\n\n```\n# lxappearance\n```\n\n- Используйте настройки демона (это в большинстве окружений рабочего стола). Вариант desktop-agnostic использует XSettings доступный в AUR xsettingsd-gitAUR.\n\n"
    },
    {
      "title": "Клиентские декорации",
      "level": 3,
      "content": "С версии GTK 3.12 введены Клиентские декорации, которые действуют в титлбаре от оконного менеджера. Это может решить такие вопросы как двойной титл-бар, нет титл-бара вообще, или двойная тень с включенным композитингом.\n\nЧтобы удалить тень и зазор вокруг окон (например, в сочетании с тайловым оконным менеджером), создайте следующий файл:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\n.window-frame, .window-frame:backdrop {\n box-shadow: 0 0 0 black;\n border-style: none;\n margin: 0;\n border-radius: 0;\n}\n\n.titlebar {\n border-radius: 0;\n}\n\n.window-frame.csd.popup {\n  box-shadow: 0 1px 2px rgba(0, 0, 0, 0.2), 0 0 0 1px rgba(0, 0, 0, 0.13);\n}\n\n.header-bar {\n  background-image: none;\n  background-color: #ededed;\n  box-shadow: none;\n}\n/* You may want to use this if you don't like the double title.\nGtkLabel.title {\n    opacity: 0;\n}*/\n```\n\nЕсли всё ещё есть визуальные проблемы, вы можете использовать Инспектор GTK, чтобы найти проблемные элементы, как описано здесь [5].\n\nЧтобы настроить кнопки на панели заголовка, используйте опцию gtk-decoration-layout. [6] Приведенный ниже пример удаляет все кнопки:\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\ngtk-decoration-layout=menu:\n```\n\nЧтобы полностью убрать клиентские декорации, можно использовать пропатченную библиотеку, например gtk3-classicAUR или gtk3-nocsd-gitAUR.\n\n"
    },
    {
      "title": "Седиль ç/Ç вместо ć/Ć (характерно в основном для Французского языка)",
      "level": 3,
      "content": "Смотрите [7] и [8] для решения проблемы с использованием Xcompose (US international layout).\n\n"
    },
    {
      "title": "Подавить предупреждение о accessibility bus",
      "level": 3,
      "content": "Если вы не используете функции Gnome Accessibility (специальных возможностей),вы можете получать такие предупреждения :\n\n```\nWARNING **: Couldn't connect to accessibility bus:\n```\n\nвы можете подавить предупреждение, запуская программу с NO_AT_BRIDGE=1 или установить в качестве глобальной переменной окружения\n\n"
    },
    {
      "title": "Не соответствует цвет фона в строке заголовка (TitleBar)",
      "level": 3,
      "content": "Если вы используете оконный менеджер, который использует тему декорации окон, которая имитирует цвет темы фона GTK, вы можете обнаружить, что цвет заголовка окна больше не совпадает полностью с цветом приложений в некоторых приложениях GTK 3. В качестве обходного пути, создайте следующий файл:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\n/* Always use background color */\nGtkWindow {\n    background-color: @theme_bg_color;\n}\n\n/* Fix tooltip background override */\n.tooltip {\n    background-color: rgba(0, 0, 0, 0.8);\n}\n\n.tooltip * {\n    background-color: transparent;\n}\n\n/* Fix Nautilus desktop window background override */\nNautilusWindow {\n     background-color: transparent; \n}\n```\n\n"
    },
    {
      "title": "Неправильно работают события фокуса в тайловых оконных менеджерах",
      "level": 3,
      "content": "Определите GDK_CORE_DEVICE_EVENTS=1 для использования стиля ввода GTK2, вместо xinput2. [10]\n\n"
    },
    {
      "title": "Поддержка эскизов для диалога выбора файла GTK",
      "level": 3,
      "content": "Установите gtk2-patched-filechooser-icon-viewAUR и gtk3-patched-filechooser-icon-viewAUR, чтобы получить возможность просмотра файлов в виде миниатюр вместо списка в окне выбора файла GTK.\n\n"
    },
    {
      "title": "GTK 3 без polkit",
      "level": 3,
      "content": "GTK3 зависит от polkit через colord, который необходим для печати. Однако печать прекрасно работает без установленного polkit; по крайней мере, с монохромным принтером и версиями пакетов gtk3-print-backends=3.22.19-2 и colord=1.4.1-1.\n\n"
    },
    {
      "title": "Некоторые темы GTK 2 изменяют только цветовую палитру пользовательского интерфейса",
      "level": 3,
      "content": "В зависимости от поддержки GTK 2 выбранной темой, элементы управления пользовательского интерфейса могут иметь стандартный вид Raleigh, возможно, с другой цветовой палитрой. Это связано с тем, что для этих тем требуется движок GTK 2 Murrine, который отсутствует (программы GTK 2 должны сообщать об этом в стандартном выводе ошибок). Установите пакет gtk-engine-murrine.\n\n"
    },
    {
      "title": "Возвращение старого поведения поиска в диалоге выбора файла GTK",
      "level": 3,
      "content": "Диалог выбора файла GTK использует тот же механизм поиска файлов по вводимому имени, что и в GNOME/Files. Это может быть очень неприятно и не очень хорошо сочетается с другими средами рабочего стола.\n\nНекоторые приложения поддерживают XDG-desktop-portal, что позволяет приложению использовать родной диалог выбора файла. Если это не работает, вы можете восстановить старое поведение поиска, используя пропатченный GTK, например gtk3-classicAUR.\n\n"
    },
    {
      "title": "Текст в приложениях GTK 4 отображается размыто или неправильно",
      "level": 3,
      "content": "GTK 4 перешёл на сглаживание шрифтов с использованием оттенков серого без хинтинга. Доступна настройка, которая восстанавливает некоторые особенности поведения GTK 3 [11]. Субпиксельное сглаживание недоступно.\n\n```\n~/.config/gtk-4.0/settings.ini\n```\n\n```\n[Settings]\ngtk-hint-font-metrics=1\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальный сайт GTK\n- GTK - Википедия\n\n"
    }
  ]
}