{
  "title": "GTK+ (Português)",
  "url": "https://wiki.archlinux.org/title/GTK%2B_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Visual uniforme para aplicativos Qt e GTK\n- Qt\n- Projeto GNU\n\nDo site do GTK:\n\nO GTK, o GIMP Toolkit, foi criado inicialmente pelo Projeto GNU para o GIMP, mas agora é um kit de ferramentas muito popular com vinculações para várias linguagens. Este artigo explorará as ferramentas usadas para configurar o tema, o estilo, o ícone, a fonte e o tamanho da fonte do GTK, além de detalhar a configuração manual.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Três versões do GTK estão atualmente disponíveis nos repositórios oficiais. Elas podem ser instaladas com os seguintes pacotes:\n\n- GTK 4.x está disponível com o pacote gtk4.\n- GTK 3.x está disponível com o pacote gtk3.\n- GTK 2.x está disponível com o pacote gtk2.\n\n- GTK 1.x está disponível com o pacote gtkAUR.\n\n"
    },
    {
      "title": "Temas",
      "level": 2,
      "content": "No GTK 2, o tema padrão é o Raleigh, mas o Arch Linux tem um arquivo de configuração personalizado em /usr/share/gtk-2.0/gtkrc, que define o tema padrão como Adwaita. No GTK 3, o tema padrão é Adwaita, mas os temas HighContrast, HighContrastInverse e Raleigh também estão incluídos.\n\nPara forçar um tema específico, defina as seguintes variáveis de ambiente:\n\n- Para GTK 2, use GTK2_RC_FILES. Por exemplo, para iniciar o GIMP com o tema Raleigh:\n\n```\n$ GTK2_RC_FILES=/usr/share/themes/Raleigh/gtk-2.0/gtkrc gimp\n```\n\n- Para GTK 3, use GTK_THEME. Por exemplo, para iniciar a Calculadora do GNOME com a variante escura do Adwaita:\n\n```\n$ GTK_THEME=Adwaita:dark gnome-calculator\n```\n\nMais temas podem ser instalados a partir dos repositórios oficiais ou do AUR. Temas extraídos manualmente vão nos diretórios ~/.themes/ ou ~/.local/share/themes/.\n\nGTK 2 e GTK 3.20 ou mais novos tem suporte em:\n\n- Adapta — Um tema GTK adaptivo baseado em Material Design Guidelines. Inclui: Adapta, Adapta-Eta, Adapta-Nokto, Adapta-Nokto-Eta\n\n- Arc — Um tema plano com um visual moderno e elementos transparentes. Inclui: Arc, Arc-Dark, Arc-Darker\n\n- Bluebird — Blue Desktop Suite para o Xfce.\n\n- Breeze — A versão GTK do tema de widgets padrão do KDE. Inclui: Breeze, Breeze-Dark\n\n- Deepin — Tema padrão para o ambiente Deepin. Inclui: deepin, deepin-dark\n\n- GNOME Extra Themes — Temas extras para o ambiente GNOME. Inclui: Adwaita, Adwaita-dark, HighContrast\n\n- Greybird — Um tema cinza e azul para o Xfce, usado por padrão no Xubuntu 12.04.\n\n- Materia — Um tema plano semelhante ao Material Design para GTK3, GTK2 e GNOME-Shell.\n\n- MATE Themes — Temas padrão para o ambiente MATE. Inclui: BlackMATE, Blue-Submarine, BlueMenta, ContrastHighInverse, Green-Submarine, GreenLaguna, Menta, TraditionalGreen, TraditionalOk\n\n- Numix — Um tema plano e leve com um visual moderno (GNOME, Openbox, Unity, Xfce). Inclui: Numix\n\n- Vertex — Tema para GTK 3, GTK 2, Gnome-Shell e Cinnamon.\n\n- Zuki — Tema para GTK, gnome-shell e mais.\n\nHá vários temas GTK adicionais no AUR. Por exemplo, pesquise por gtk-theme.\n\n"
    },
    {
      "title": "GTK e Qt",
      "level": 3,
      "content": "Se você tem aplicativos GTK e Qt (KDE) em sua área de trabalho, sabe que sua aparência não combina bem. Se você deseja fazer seus estilos de GTK combinarem com seus estilos de Qt, por favor, leia Aparência uniforme para aplicativos em Qt e GTK.\n\n"
    },
    {
      "title": "Ferramentas de configuração",
      "level": 2,
      "content": "A maioria dos grandes ambientes de desktop fornecem ferramentas para configurar o tema GTK, ícones, fonte e tamanho da fonte, e gerenciar essas configurações por XSettings:\n\n- Se você usa Cinnamon, use a ferramenta Temas (cinnamon-settings themes): vá em Configurações do sistema > Temas.\n- Se você usa Enlightenment: vá em Definições > Tudo > Aparência > Tema das aplicações.\n- Se você usa GNOME, use Ajustes do GNOME (gnome-tweaks): instale gnome-tweaks.\n- Se você usa MATE, use a ferramenta Appearance Preferences (mate-appearance-properties): vá em Sistema > Configurações > Aparência.\n- Se você usa Xfce, use a ferramenta Appearance: vá em Configurações > Aparência.\n\nOutras ferramentas GUI geralmente sobrescrevem os arquivos de configuração.\n\nSuporte a GTK 2 e GTK 3:\n\n- KDE GTK Configurator — Aplicativo que permite que você altere o estilo e fonte de aplicativos GTK 2 e GTK 3.\n\n- LXAppearance — Ferramenta de configuração de estilo independente para GTK 2 e GTK 3 do projeto LXDE (não requer outras partes da área de trabalho do LXDE).\n\n- {{App|Oo-mox|Aplicativo gráfico para gerar diferentes variações de cores dos temas dos temas Numix e Flat-Plat (GTK 2 e 3), Archdroid e Gnome-Colors. Também permite gerar temas GTK 2 pré-dimensionados para telas HiDPI.|https://github.com/actionless/oomox%7C[link inativo 2023-05-06 ⓘ]themix-full-gitAUR\n\nSuporte apenas a GTK 2:\n\n- GTK Change Theme — Um programa pequeno que permite que você altere seu tema GTK 2.0 (considerado uma alternativa melhor ao switch2).\n\n- GTK Preference Tool — Seletor de temas GTK e alternador de fontes.\n\n- GTK Theme Switch — Alternador de temas GTK simples.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "As configurações do GTK podem ser especificadas manualmente nos arquivos de configuração, mas os ambientes e aplicativos de desktop podem substituir essas configurações. Dependendo da versão do GTK, esses arquivos estão localizados em:\n\n- específico de usuário no GTK 2: ~/.gtkrc-2.0\n- todo o sistema no GTK 2: /etc/gtk-2.0/gtkrc\n- específico de usuário no GTK 3: $XDG_CONFIG_HOME/gtk-3.0/settings.ini, ou $HOME/.config/gtk-3.0/settings.ini se $XDG_CONFIG_HOME não estiver definido\n- todo o sistema no GTK 3: /etc/gtk-3.0/settings.ini\n\n- Veja as propriedades de GtkSettings do GTK 3 (e as propriedades do GTK 2) no manual de referência de programação do GTK para a lista completa as opções de configuração de GTK atualmente válidas.\n- Algumas das configurações descritas abaixo (como gtk-icon-size) são obsoletas e ignoradas desde o GTK 3.10.\n- Se você editar seus arquivos de configuração do GTK, apenas os aplicativos recém-iniciados exibirão as alterações.\n\n"
    },
    {
      "title": "Configuração básica de tema",
      "level": 3,
      "content": "Para alterar manualmente o tema, os ícones, a fonte e o tamanho da fonte do GTK, adicione o seguinte aos arquivos de configuração, por exemplo:\n\n- GTK 2:\n\n```\n~/.gtkrc-2.0\n```\n\n```\ngtk-icon-theme-name = \"Adwaita\"\ngtk-theme-name = \"Adwaita\"\ngtk-font-name = \"DejaVu Sans 11\"\n```\n\n- GTK 3:\n\n```\n$XDG_CONFIG_HOME/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-icon-theme-name = Adwaita\ngtk-theme-name = Adwaita\ngtk-font-name = DejaVu Sans 11\n```\n\n"
    },
    {
      "title": "Variante escura de tema",
      "level": 3,
      "content": "Alguns temas do GTK 3 contêm uma variante de tema escuro, mas ela é usada apenas por padrão quando o aplicativo solicita isso explicitamente. Para usar a variante do tema escuro com todos os aplicativos GTK 3, defina:\n\n```\ngtk-application-prefer-dark-theme = true\n```\n\n"
    },
    {
      "title": "Atalhos de teclado",
      "level": 3,
      "content": "Os atalhos de teclado (também conhecidos como aceleradores no GTK) podem ser alterados passando o mouse sobre o respectivo item de menu e pressionando a combinação de teclas desejada. Para ativar esse recurso, defina:\n\n```\ngtk-can-change-accels = 1\n```\n\n"
    },
    {
      "title": "Vinculações de teclas Emacs",
      "level": 4,
      "content": "Para ter associações de teclas do tipo Emacs em aplicativos de GTK, adicione o seguinte:\n\n```\n~/.gtkrc-2.0\n```\n\n```\ngtk-key-theme-name = \"Emacs\"\n```\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-key-theme-name = Emacs\n```\n\nPara GTK 3, também execute:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-key-theme \"Emacs\"\n```\n\nXFCE possui uma configuração similar:\n\n```\n$ xfconf-query -c xsettings -p /Gtk/KeyThemeName -s Emacs\n```\n\nOs arquivos de configuração em /usr/share/themes/Emacs/ determinam quais são as ligações do Emacs e podem ser alteradas. Copiar seções para o arquivo ~/.gtkrc-2.0 permite alterações por usuário.\n\n"
    },
    {
      "title": "Atraso no menu do GNOME",
      "level": 3,
      "content": "Essa configuração controla o atraso entre apontar o mouse em um menu e a abertura do menu. Esse atraso é medido em milissegundos.\n\n```\ngtk-menu-popup-delay = 0\n```\n\n"
    },
    {
      "title": "Reduzir tamanhos de widgets",
      "level": 3,
      "content": "Se você tem uma tela pequena ou simplesmente não gosta de grandes ícones e widgets, pode redimensionar as coisas facilmente.\n\nPara ter ícones sem texto nas barras de ferramentas (valores válidos), use\n\n```\ngtk-toolbar-style = GTK_TOOLBAR_ICONS\n```\n\nPara ícones menores, use uma linha como essa:\n\n```\ngtk-icon-sizes = \"panel-menu=16,16:panel=16,16:gtk-menu=16,16:gtk-large-toolbar=16,16\\\n:gtk-small-toolbar=16,16:gtk-button=16,16\"\n```\n\nOu para remover ícones de botões completamente:\n\n```\ngtk-button-images = 0\n```\n\nVocê também pode remover ícones de menus:\n\n```\ngtk-menu-images = 0\n```\n\nVeja também [1] e [2].\n\n"
    },
    {
      "title": "Ocultar botões de CSD",
      "level": 3,
      "content": "Para remover os botões minimizar e maximizar das janelas em gtk3:\n\n```\ngtk-decoration-layout=menu:close\n```\n\nSee [3].\n\n"
    },
    {
      "title": "Desabilitar colagem com mouse",
      "level": 3,
      "content": "Para desaligar colagem ao clicar com o botão do meio do mouse (também conhecido como PRIMARY):\n\n```\ngtk-enable-primary-paste=false\n```\n\n"
    },
    {
      "title": "Localização inicial do seletor de arquivos",
      "level": 3,
      "content": "Abra o seletor de arquivos dentro do diretório de trabalho atual e não o local recentes. Normalmente o diretório de trabalho atual é a pasta pessoal.\n\nGTK 3\n\nAltere a configuração com o seguinte comando:\n\n```\n$ gsettings set org.gtk.Settings.FileChooser startup-mode cwd\n```\n\nGTK 2\n\nAdicione o seguinte para ~/.config/gtk-2.0/gtkfilechooser.ini:\n\n```\nStartupMode=cwd\n```\n\n"
    },
    {
      "title": "Comportamento de rolagem legada",
      "level": 3,
      "content": "Antes do GTK 3.6, clicar em um dos lados do controle deslizante na barra de rolagem moveria a barra de rolagem na direção do clique em aproximadamente uma página. Desde o GTK 3.6, o controle deslizante se moverá diretamente para a posição do clique. Esse comportamento pode ser revertido em alguns aplicativos, criando o arquivo com o conteúdo abaixo:\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-primary-button-warps-slider = false\n```\n\n"
    },
    {
      "title": "Desabilitar barras de rolagem de sobreposição",
      "level": 3,
      "content": "Desde o GTK 3.15, as barras de rolagem de sobreposição são ativadas por padrão, o que significa que as barras de rolagem serão mostradas apenas ao passar o mouse nas aplicações do GTK 3. Esse comportamento pode ser revertido pela configuração da seguinte variável de ambiente: GTK_OVERLAY_SCROLLING=0. Veja Variáveis de ambiente#Ambiente gráfico.\n\nO GTK 4 deixará de dar suporte a GTK_OVERLAY_SCROLLING. Ele já foi retirado do ramo mestre. A partir do GTK 4, a natureza de sobreposição das barras de rolagem é parte do kit de ferramentas. A alternância geral foi removida para impedir que os desenvolvedores quebrem aplicativos que não foram testados com ambas as combinações. Para permitir que os desenvolvedores de aplicativos decidam como devem ser seus aplicativos, o kit de ferramentas fornece um mecanismo para desativar ou adicionar uma configuração aos usuários. A função gtk_scrolled_window_set_overlay_scrolling() pode ser usada para ativar/desativar a sobreposição de rolagem em uma base por aplicativo. Os desenvolvedores de aplicativos podem, opcionalmente, usar o GSettings para ter uma configuração de usuário vinculada à propriedade.\n\n"
    },
    {
      "title": "Remover indicadores de rolagem de sobreposição",
      "level": 4,
      "content": "As posições das barras de rolagem de sobreposição são indicadas por linhas tracejadas finas na janela do aplicativo. Essas linhas tracejadas estarão presentes mesmo quando a rolagem de overlay estiver desabilitada usando a variável de ambiente discutida na seção acima. Para remover as linhas do indicador, crie o seguinte arquivo:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\n/* Remover linhas tracejadas de aplicativos GTK 3 */\nundershoot.top, undershoot.right, undershoot.bottom, undershoot.left { background-image: none; }\n```\n\n"
    },
    {
      "title": "Exemplos",
      "level": 3,
      "content": "Exemplo de configurações do GTK:\n\n```\n~/.gtkrc-2.0\n```\n\n```\ngtk-theme-name=\"Arc-Dark\"\ngtk-icon-theme-name=\"breeze-dark\"\ngtk-font-name=\"Sans 11\"\ngtk-cursor-theme-name=\"Breeze_Amber\"\ngtk-cursor-theme-size=0\ngtk-toolbar-style=GTK_TOOLBAR_BOTH_HORIZ\ngtk-toolbar-icon-size=GTK_ICON_SIZE_SMALL_TOOLBAR\ngtk-button-images=0\ngtk-menu-images=0\ngtk-enable-event-sounds=0\ngtk-enable-input-feedback-sounds=0\ngtk-xft-antialias=1\ngtk-xft-hinting=1\ngtk-xft-hintstyle=\"hintslight\"\ngtk-xft-rgba=\"rgb\"\n```\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-theme-name=Arc-Dark\ngtk-icon-theme-name=breeze-dark\ngtk-font-name=Sans 11\ngtk-cursor-theme-name=Breeze_Amber\ngtk-cursor-theme-size=0\ngtk-toolbar-style=GTK_TOOLBAR_BOTH_HORIZ\ngtk-toolbar-icon-size=GTK_ICON_SIZE_SMALL_TOOLBAR\ngtk-button-images=0\ngtk-menu-images=0\ngtk-enable-event-sounds=0\ngtk-enable-input-feedback-sounds=0\ngtk-xft-antialias=1\ngtk-xft-hinting=1\ngtk-xft-hintstyle=hintslight\ngtk-xft-rgba=rgb\n# gtk-decoration-layout=menu:close\n# gtk-application-prefer-dark-theme=1\n```\n\n"
    },
    {
      "title": "Backend do GDK",
      "level": 2,
      "content": "O GDK (a camada de abstração subjacente do GTK) possui suporte a vários backends para exibir aplicativos GTK. O backend padrão é x11.\n\n"
    },
    {
      "title": "Backend do Broadway",
      "level": 3,
      "content": "O backend do GDK Broadway fornece suporte para a exibição de aplicativos GTK em um navegador da Web, usando HTML5 e soquetes da web. [4]\n\nAo usar broadwayd, especifique o número de exibição a ser usado, prefixado com caractere de dois pontos, semelhante a X. O número de exibição padrão é 1.\n\n```\n$ display_number=:5\n```\n\nInicie-o.\n\n```\n$ broadwayd $display_number\n```\n\nPorta usada por padrão\n\n```\nport = 8080 + $display_number\n```\n\nAponte seu navegador para http://127.0.0.1:port\n\nPara iniciar aplicativos\n\n```\n$ GDK_BACKEND=broadway BROADWAY_DISPLAY=$display_number <<app>>\n```\n\nAlternativamente, você pode definir endereço e porta\n\n```\n$ broadwayd --port $port_number --address $address $display_number\n```\n\n"
    },
    {
      "title": "Backend do Wayland",
      "level": 3,
      "content": "O backend GDK do Wayland pode ser ativado definindo a variável de ambiente GDK_BACKEND=wayland.\n\n"
    },
    {
      "title": "Temas diferentes entre aplicativos GTK 2 e GTK 3",
      "level": 3,
      "content": "Em geral, se um tema selecionado tiver suporte ao GTK 2 e ao GTK 3, o tema será aplicado a todos os aplicativos GTK 2 e GTK 3. Se um tema selecionado tiver suporte apenas ao GTK 2, ele será usado para aplicativos do GTK 2 e o tema padrão do GTK será usado para aplicativos do GTK 3. Se o tema selecionado tiver suporte apenas ao GTK 3, ele será usado para aplicativos do GTK 3 e o tema padrão do GTK será usado para aplicativos do GTK 2. Assim, para a consistência do tema da aplicação, é melhor usar um tema que tenha suporte ao GTK 2 e o GTK 3.\n\nVocê poderia encontrar quais temas instalados em seu sistema possuem uma versão GTK 2 e GTK 3 usando este comando (não funciona com nomes que contenham espaços):\n\n```\nfind $(find ~/.themes /usr/share/themes/ -wholename \"*/gtk-3.0\" | sed -e \"s/^\\(.*\\)\\/gtk-3.0$/\\1/\") -wholename \"*/gtk-2.0\" | sed -e \"s/.*\\/\\(.*\\)\\/gtk-2.0/\\1\"/\n```\n\n"
    },
    {
      "title": "Tema não aplicado para aplicativos de root",
      "level": 3,
      "content": "Como arquivos de tema de usuário ($XDG_CONFIG_HOME/gtk-3.0/settings.ini, ~/.gtkrc-2.0) não são lidos por outras contas, o tema selecionado não será aplicado a aplicativos X sendo executados como root. Possíveis soluções incluem:\n\n- Criar links simbólicos, p.ex.:\n\n```\n# ln -s /home/[username]/.gtkrc-2.0 /etc/gtk-2.0/gtkrc\n# ln -s /home/[username]/.config/gtk-3.0/settings.ini /etc/gtk-3.0/settings.ini\n```\n\n- Configurar arquivos de temas para todo sistema: /etc/gtk-3.0/settings.ini (GTK 3) ou /etc/gtk-2.0/gtkrc (GTK 2)\n- Ajustar o tema como root\n\n```\n# sudo lxappearance\n```\n\n- Usar o daemon de configurações (é isso que a maioria dos ambientes desktop fazem). Uma variante agnóstica a desktop usando XSettings está disponível sob nome xsettingsd-gitAUR.\n\n"
    },
    {
      "title": "Decorações do lado do cliente",
      "level": 3,
      "content": "O GTK 3.12 introduziu decorações para cliente, que move a barra de cabeçalho para fora do gerenciador de janela. Isso pode apresentar problemas como barras de título duplas, nenhuma barra de título ou sombras duplas com composição habilitada.\n\nPara remover a sombra e o espaço em torno das janelas (por exemplo, em combinação com um gerenciador de janela de tiling), crie o seguinte arquivo:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\n.window-frame, .window-frame:backdrop {\n box-shadow: 0 0 0 black;\n border-style: none;\n margin: 0;\n border-radius: 0;\n}\n\n.titlebar {\n border-radius: 0;\n}\n\n.window-frame.csd.popup {\n  box-shadow: 0 1px 2px rgba(0, 0, 0, 0.2), 0 0 0 1px rgba(0, 0, 0, 0.13);\n}\n\n.header-bar {\n  background-image: none;\n  background-color: #ededed;\n  box-shadow: none;\n}\n/* You may want to use this if you don't like the double title.\nGtkLabel.title {\n    opacity: 0;\n}*/\n```\n\nPara ajustar os botões na barra de cabeçalho, use a configuração gtk-decoration-layout[5]. Os exemplos abaixo removem todos os botões:\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\ngtk-decoration-layout=menu:\n```\n\n"
    },
    {
      "title": "Cedilha ç/Ç em vez de ć/Ć",
      "level": 3,
      "content": "Veja [6] e [7] para uma a solução de contorno usando Xcompose (layout EUA internacional).\n\n"
    },
    {
      "title": "Suprimir aviso sobre barramento de acessibilidade",
      "level": 3,
      "content": "Se você não usa nenhuma recurso do Acesso Universal do GNOMe, você pode receber avisos com:\n\n```\nWARNING **: Couldn't connect to accessibility bus:\n```\n\nPara suprimir esses avisos, execute programas com NO_AT_BRIDGE=1 ou defina isso como uma variável de ambiente global.\n\n"
    },
    {
      "title": "Incompatibilidade de cor de fundo da barra de título",
      "level": 3,
      "content": "Se você estiver usando um gerenciador de janela que usa um tema de decoração de janelas que imita a cor de fundo do tema GTK, você pode descobrir que a cor da barra de título não combina mais com a cor do aplicativo em alguns aplicativos do GTK 3. Como solução alternativa, crie o seguinte arquivo:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\n/* Sempre usa cor de plano de fundo */\nGtkWindow {\n    background-color: @theme_bg_color;\n}\n\n/* Corrige substituição de plano de fundo da dica de ferramenta */\n.tooltip {\n    background-color: rgba(0, 0, 0, 0.8);\n}\n\n.tooltip * {\n    background-color: transparent;\n}\n\n/* Corrige substituição de plano de fundo da janela da área de trabalho do Nautilus */\nNautilusWindow {\n     background-color: transparent;\n}\n```\n\n"
    },
    {
      "title": "Eventos de foco incorretos com gerenciadores de janela tiling",
      "level": 3,
      "content": "Defina GDK_CORE_DEVICE_EVENTS=1 para usar entrada no estilo GTK2 em vez de xinput2. [9]\n\n"
    },
    {
      "title": "Suporte a miniaturas para diálogo de arquivos GTK 2",
      "level": 3,
      "content": "Instale gtk2-patched-filechooser-icon-viewAUR para ter a opção para ver arquivos como miniaturas em vez de lista no seletor de arquivos GTK.\n\n"
    },
    {
      "title": "Botão e ícones de menu",
      "level": 3,
      "content": "Para algumas aplicações na sessão Wayland do GNOME. Seu arquivo ~/.config/gtk-3.0/settings.ini está desconfigurado. Isso pode acontecer se você tentar outros ambientes de área de trabalho baseados em GTK. Estes são os valores ofensivos:\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-button-images=1\ngtk-menu-images=1\n```\n\nBasta defini-los como 0 ou remover o arquivo inteiro para usar os padrões do GNOME.\n\n"
    },
    {
      "title": "GTK 3 sem polkit",
      "level": 3,
      "content": "O GTK 3 depende do polkit através do colord, que é necessário para impressão. No entanto, a impressão funciona bem sem o polkit instalado; pelo menos com uma impressora monocromática e versões de pacote gtk3-print-backends=3.22.19-2 e colord=1.4.1-1.\n\n"
    },
    {
      "title": "Alguns temas de GTK 2 só alteram a paleta de cores da UI",
      "level": 3,
      "content": "Dependendo do tema de escolha do suporte para o GTK 2, os controles da interface do usuário ainda podem ter a aparência padrão do Raleigh, possivelmente com uma paleta de cores diferente. Isso se deve a esses temas que exigem o mecanismo Murrine GTK 2, que está faltando (programas GTK 2 devem reclamar sobre isso em sua saída de erro padrão). Instale o pacote gtk-engine-murrine.\n\n"
    },
    {
      "title": "Aplicando patch no seletor de arquivos GTK para usar a digitação adiantada normal",
      "level": 3,
      "content": "O seletor de arquivos GTK usa o mesmo recurso de busca por digitação antecipada do GNOME/Files. Isso pode ser muito chocante e não se encaixa muito bem com outros ambientes de desktop.\n\nAlguns aplicativos possuem suporte ao XDG-desktop-portal, que permite que o aplicativo use o seletor de arquivo nativo. Se isso não funcionar, você pode restaurar a funcionalidade de digitação antecipada usando um GTK com patch aplicado como, por exemplo, gtk3-mushroomsAUR[link quebrado: package not found].\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- O site oficial do GTK\n- Artigo do Wikipédia sobre o GTK\n\n"
    }
  ]
}