{
  "title": "GTK+ (Español)",
  "url": "https://wiki.archlinux.org/title/GTK%2B_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-05** \n\nArtículos relacionados\n\n- Uniformidad en aplicaciones Qt y GTK\n- Qt\n- GNU\n\nDe la web de GTK:\n\nGTK (GIMP Toolkit) fue originalmente creado por el Proyecto GNU para GIMP, pero ahora es un conjunto de herramientas popular con conectores a múltiples lenguajes de programación. Este artículo explora las herramientas utilizadas para configurar el tema GTK, el estilo, los iconos, las fuentes y sus tamaños, y también detalla la configuración manual.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Tres versiones de GTK estan disponibles en los repositorios oficiales. Se pueden instalar con los siguientes paquetes:\n\n- GTK 4.x disponible con el paquete gtk4.\n- GTK 3.x disponible con el paquete gtk3.\n- GTK 2.x disponible con el paquete gtk2.\n\nGTK 1.x disponible con el paquete gtkAUR.\n\n"
    },
    {
      "title": "Temas",
      "level": 2,
      "content": "En GTK 3, el tema predeterminado es Adwaita, pero también se incluyen HighContrast, HighContrastInverse y Raleigh.\n\nEn GTK 2, el tema predeterminado es Raleigh, pero Arch Linux tiene un archivo de configuración personalizado en /usr/share/gtk-2.0/gtkrc, que establece Adwaita como el tema predeterminado.\n\n- Para GTK 3, utilice GTK_THEME. Por ejemplo para lanzar la calculadora de GNOME con la variante oscura de Adwaita:\n\n```\n$ GTK_THEME=Adwaita:dark gnome-calculator\n```\n\nPara forzar un tema específico, establezca las siguientes variables de entorno.\n\n- Para GTK 2, utilice GTK2_RC_FILES. Por ejemplo para lanzar GIMP con el tema Raleigh:\n\n```\n$ GTK2_RC_FILES=/usr/share/themes/Raleigh/gtk-2.0/gtkrc gimp\n```\n\nSe pueden instalar más temas desde los repositorios oficiales o desde AUR. Los temas extraídos manualmente van en el directorio ~/.themes/ o ~/.local/share/themes/.\n\nTemas soportados en GTK 2 y GTK 3:\n\n- Adapta — Un tema GTK adaptativo basado en las guías de diseño de Material Design. Incluye: Adapta, Adapta-Eta, Adapta-Nokto, Adapta-Nokto-Eta\n\n- Arc — Un tema plano con un aspecto moderno y elementos transparentes. Incluye: Arc, Arc-Dark, Arc-Darker\n\n- Bluebird — Blue Desktop Suite para Xfce.\n\n- Breeze — Versión GTK del tema predeterminado de KDE. Incluye: Breeze, Breeze-Dark\n\n- Deepin — Tema predeterminado del escritorio Deepin. Incluye: deepin, deep-dark\n\n- Temas extra de GNOME — Temas extra para el escritorio GNOME. Incluye: Adwaita, Adwaita-dark, HighContrast\n\n- Greybird — Un tema de Xfce gris y azul, utilizado por defecto en Xubuntu 12.04.\n\n- Tema Materia — Un tema plano parecido a Material Design para GTK3, GTK2 y GNOME-Shell.\n\n- Temas de MATE — Temas predeterminados del escritorio MATE. Incluye: BlackMATE, Blue-Submarine, BlueMenta, ContrastHighInverse, Green-Submarine, GreenLaguna, Menta, TraditionalGreen, TraditionalOk\n\n- Numix — Un tema plano y ligero con un aspecto moderno (GNOME, Openbox, Unity, Xfce). Incluye: Numix\n\n- Vertex — Tema para GTK3, GTK2, Gnome-Shell y Cinnamon.\n\n- Zuki — Temas para GTK, gnome-shell y más.\n\nHay una serie de temas GTK adicionales en AUR, por ejemplo: búsqueda de gtk-theme.\n\n"
    },
    {
      "title": "GTK y Qt",
      "level": 3,
      "content": "Si tiene aplicaciones GTK y Qt (KDE) en su escritorio, entonces sabe que sus apariencias no combinan bien. Si desea que los estilos GTK coincidan con los estilos Qt, véase unificación de aspectos para las aplicaciones Qt y GTK.\n\n"
    },
    {
      "title": "Herramientas de configuración",
      "level": 2,
      "content": "La mayoría de los entornos de escritorio proporcionan herramientas para configurar el tema GTK, los iconos, la tipografía y el tamaño de la misma, y administrar estas configuraciones a través de XSettings:\n\n- Si utiliza Cinnamon, emplee la herramienta Temas (cinnamon-settings themes): diríjase a Configuración del sistema > Temas.\n- Si utiliza Enlightenment: diríjase a Configuración > Todos > Aspecto > Tema de aplicación.\n- Si utiliza GNOME, emplee los ajustes de GNOME (gnome-tweaks): instale gnome-tweaks.\n- Si utiliza MATE, emplee la herramienta de Preferencias de apariencia (mate-apariencia-propiedades): diríjase a Sistema > Configuración > Apariencia.\n- Si utiliza Xfce, emplee la herramienta Apariencia: diríjase a Configuración > Apariencia.\n\nOtras herramientas del GUI generalmente sobrescriben los archivos de configuración.\n\nCompatibles con GTK 2 y GTK 3:\n\n- KDE GTK Configurator — Aplicación que le permite cambiar el estilo y la tipografía de las aplicaciones GTK 2 y GTK 3.\n\n- LXAppearance — Herramienta independiente del escritorio de configuración de estilo GTK 2 y GTK 3 del proyecto LXDE (no requiere otras partes del escritorio LXDE).\n\n- Oo-mox — Aplicación gráfica para generar diferentes variaciones de color de los temas Numix y Flat-Plat (GTK 2 y 3), Archdroid y Gnome-Colors. También permite generar temas GTK 2 pre-escalados para pantallas HiDPI.\n\nCompatible solo con GTK 2:\n\n- GTK Change Theme — Pequeño programa que le permite cambiar su tema GTK 2.0 (considerada una mejor alternativa a switch2).\n\n- GTK Preference Tool — Selector de temas GTK y cambio de tipografía.\n\n- GTK Theme Switch — Intercambiador simple de temas GTK.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Los ajustes de GTK se puede especificar manualmente en los archivos de configuración, pero los entornos de escritorio y las aplicaciones pueden anular esta configuración. Dependiendo de la versión GTK, estos archivos se encuentran en:\n\n- GTK 2 específico del usuario: ~/.gtkrc-2.0\n- GTK 2 en todo el sistema: /etc/gtk-2.0/gtkrc\n- GTK 3 específico del usuario: $XDG_CONFIG_HOME/gtk-3.0/settings.ini, o $HOME/.config/gtk-3.0/settings.ini si $XDG_CONFIG_HOME no está establecido\n- GTK 3 en todo el sistema: /etc/gtk-3.0/settings.ini\n\n- Véase Propiedades GtkSettings de GTK 3 (y Propiedades de GTK 2) en el manual de referencia de programación de GTK para ver la lista completa de las opciones de configuración actualmente admitidas de GTK.\n- Algunas de las configuraciones que se describen a continuación (como gtk-icon-size) están en desuso y se ignoran desde GTK 3.10.\n- Si edita sus archivos de configuración GTK, solo las aplicaciones recién iniciadas mostrarán los cambios.\n\n"
    },
    {
      "title": "Configuración básica del tema",
      "level": 3,
      "content": "Para cambiar manualmente el tema, los iconos, la tipografía y el tamaño de la fuente GTK, añada lo siguiente a los archivos de configuración, por ejemplo:\n\n- GTK 2:\n\n```\n~/.gtkrc-2.0\n```\n\n```\ngtk-icon-theme-name = \"Adwaita\"\ngtk-theme-name = \"Adwaita\"\ngtk-font-name = \"DejaVu Sans 11\"\n```\n\n- GTK 3:\n\n```\n$XDG_CONFIG_HOME/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-icon-theme-name = Adwaita\ngtk-theme-name = Adwaita\ngtk-font-name = DejaVu Sans 11\n```\n\nSi el tema no se aplica para GTK 3, utilice además gsettings:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-theme Pop\n```\n\n"
    },
    {
      "title": "Variante oscura del tema",
      "level": 3,
      "content": "Algunos temas de GTK 3 contienen una variante oscura del tema, pero solo se usa de forma predeterminada cuando la aplicación lo solicita explícitamente. Para usar la variante oscura del tema con todas las aplicaciones GTK 3, establezca:\n\n```\ngtk-application-prefer-dark-theme = true\n```\n\n"
    },
    {
      "title": "Atajos de teclado",
      "level": 3,
      "content": "Los atajos de teclado (también conocidos como \"aceleradores\" en GTK o métodos abreviados de teclado) se pueden cambiar al colocar el ratón sobre el elemento del menú correspondiente y presionar la combinación de teclas deseada. Para habilitar esta característica, establezca:\n\n```\ngtk-can-change-accels = 1\n```\n\n"
    },
    {
      "title": "Combinaciones de teclas Emacs",
      "level": 4,
      "content": "Para tener combinaciones de teclas similares a Emacs en aplicaciones GTK, añada lo siguiente:\n\n```\n~/.gtkrc-2.0\n```\n\n```\ngtk-key-theme-name = \"Emacs\"\n```\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-key-theme-name = Emacs\n```\n\nPara GTK 3 ejecute también:\n\n```\n$ gsettings set org.gnome.desktop.interface gtk-key-theme \"Emacs\"\n```\n\nXFCE tiene una configuración similar:\n\n```\n$ xfconf-query -c xsettings -p /Gtk/KeyThemeName -s Emacs\n```\n\nLos archivos de configuración en /usr/share/themes/Emacs/ determinan cuáles son los enlaces de Emacs, y se pueden cambiar. Copiar secciones en el archivo ~/.gtkrc-2.0 de los usuarios permite realizar cambios para cada usuario.\n\n"
    },
    {
      "title": "Retraso del menú de GNOME",
      "level": 3,
      "content": "Esta configuración controla el retraso entre apuntar el ratón hacia un menú y la apertura del mismo. Este retraso se mide en milisegundos.\n\n```\ngtk-menu-popup-delay = 0\n```\n\n"
    },
    {
      "title": "Reducir el tamaño de los widgets",
      "level": 3,
      "content": "Si tiene una pantalla pequeña o simplemente no le gustan los iconos y widgets grandes, puede cambiarles el tamaño fácilmente.\n\nPara tener iconos sin texto en las barras de herramientas (valores válidos), utilice:\n\n```\ngtk-toolbar-style = GTK_TOOLBAR_ICONS\n```\n\nPara tener iconos más pequeños, utilice una línea como esta:\n\n```\ngtk-icon-sizes = \"panel-menu=16,16:panel=16,16:gtk-menu=16,16:gtk-large-toolbar=16,16\\\n:gtk-small-toolbar=16,16:gtk-button=16,16\"\n```\n\nO bien, para eliminar los iconos de los botones por completo:\n\n```\ngtk-button-images = 0\n```\n\nTambién puede eliminar los iconos de los menús:\n\n```\ngtk-menu-images = 0\n```\n\nVéase también [1] y [2].\n\n"
    },
    {
      "title": "Ocultar los botones CSD",
      "level": 3,
      "content": "Para eliminar los botones minimizar y maximizar de las ventanas gtk3:\n\n```\ngtk-decoration-layout=menu:close\n```\n\nVéase [3].\n\n"
    },
    {
      "title": "Desactivar pegar desde el ratón",
      "level": 3,
      "content": "Para desactivar el pegado al pulsar el botón central del ratón (también conocido como PRIMARIO):\n\n```\ngtk-enable-primary-paste=false\n```\n\n"
    },
    {
      "title": "Posición inicial del selector de archivos",
      "level": 3,
      "content": "Abra el selector de archivos dentro del directorio de trabajo actual y no en la ubicación reciente. Normalmente, el directorio de trabajo actual es el directorio personal.\n\nGTK 3\n\nCambie el ajuste con la orden siguiente:\n\n```\n$ gsettings set org.gtk.Settings.FileChooser startup-mode cwd\n```\n\nGTK 2\n\nAñada lo siguiente a ~/.config/gtk-2.0/gtkfilechooser.ini:\n\n```\nStartupMode=cwd\n```\n\n"
    },
    {
      "title": "Comportamiento de desplazamiento heredado",
      "level": 3,
      "content": "Antes de GTK 3.6, pulsando a cada lado del control deslizante en la barra de desplazamiento movía la barra de desplazamiento aproximadamente una página en la dirección donde pulsaba. Desde GTK 3.6, el control deslizante se mueve directamente a la posición donde se pulsa. Este comportamiento se puede revertir en algunas aplicaciones creando el archivo con el contenido siguiente:\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-primary-button-warps-slider = false\n```\n\n"
    },
    {
      "title": "Deshabilitar las barras de desplazamiento superpuestas",
      "level": 3,
      "content": "Desde GTK 3.15, las barras de desplazamiento superpuestas están habilitadas de forma predeterminada, lo que significa que las barras de desplazamiento se mostrarán solo al pasar el ratón en las aplicaciones de GTK 3. Este comportamiento se puede revertir configurando la siguiente variable de entorno: GTK_OVERLAY_SCROLLING=0. Véase Aplicaciones gráficas.\n\nGTK 4 ya no admitirá GTK_OVERLAY_SCROLLING. Ya ha sido eliminado de la rama principal de desarrollo. A partir de GTK 4, la naturaleza de superposición de las barras de desplazamiento es parte del kit de herramientas. Se ha eliminado el conmutador general para evitar que los desarrolladores rompan aplicaciones que no han sido probadas con ambas combinaciones. Para permitir que los desarrolladores de aplicaciones decidan qué aspecto deberían tener sus aplicaciones, en su lugar, el kit de herramientas proporciona un mecanismo para excluir o añadir una configuración para los usuarios. La función gtk_scrolled_window_set_overlay_scrolling() se puede usar para habilitar/deshabilitar las barras de desplazamiento superpuestas por cada usuario. Los desarrolladores de aplicaciones pueden utilizar opcionalmente GSettings para que el usuario tenga una configuración vinculada a esta propiedad.\n\n"
    },
    {
      "title": "Eliminar indicadores de la barra de desplazamiento de superposición",
      "level": 4,
      "content": "Las posiciones de las barras de desplazamiento de superposición se indican mediante líneas finas discontinuas en la ventana de la aplicación. Estas líneas discontinuas estarán presentes incluso cuando la barra de desplazamiento de superposición se deshabilite utilizando la variable de entorno que se analiza en la sección anterior. Para eliminar las líneas indicadoras, cree el siguiente archivo:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\n/* Remove dotted lines from GTK 3 applications */\nundershoot.top, undershoot.right, undershoot.bottom, undershoot.left { background-image: none; }\n```\n\n"
    },
    {
      "title": "Ejemplos",
      "level": 2,
      "content": "Ejemplo de configuración de GTK:\n\n```\n~/.gtkrc-2.0\n```\n\n```\ngtk-theme-name=\"Arc-Dark\"\ngtk-icon-theme-name=\"breeze-dark\"\ngtk-font-name=\"Sans 11\"\ngtk-cursor-theme-name=\"Breeze_Amber\"\ngtk-cursor-theme-size=0\ngtk-toolbar-style=GTK_TOOLBAR_BOTH_HORIZ\ngtk-toolbar-icon-size=GTK_ICON_SIZE_SMALL_TOOLBAR\ngtk-button-images=0\ngtk-menu-images=0\ngtk-enable-event-sounds=0\ngtk-enable-input-feedback-sounds=0\ngtk-xft-antialias=1\ngtk-xft-hinting=1\ngtk-xft-hintstyle=\"hintslight\"\ngtk-xft-rgba=\"rgb\"\n```\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-theme-name=Arc-Dark\ngtk-icon-theme-name=breeze-dark\ngtk-font-name=Sans 11\ngtk-cursor-theme-name=Breeze_Amber\ngtk-cursor-theme-size=0\ngtk-toolbar-style=GTK_TOOLBAR_BOTH_HORIZ\ngtk-toolbar-icon-size=GTK_ICON_SIZE_SMALL_TOOLBAR\ngtk-button-images=0\ngtk-menu-images=0\ngtk-enable-event-sounds=0\ngtk-enable-input-feedback-sounds=0\ngtk-xft-antialias=1\ngtk-xft-hinting=1\ngtk-xft-hintstyle=hintslight\ngtk-xft-rgba=rgb\ngtk-decoration-layout=menu:close\n# gtk-application-prefer-dark-theme=1\n```\n\n"
    },
    {
      "title": "Backends de GDK",
      "level": 2,
      "content": "GDK (la capa de abstracción subyacente de GTK) admite varios backends para mostrar aplicaciones de GTK. El backend predeterminado es x11.\n\n"
    },
    {
      "title": "Backend de Wayland",
      "level": 3,
      "content": "El backend de GDK Wayland es compatible solo con gtk3 y es el backend predeterminado cuando se utiliza el servidor de visualización Wayland.\n\nLas aplicaciones que utilizan versiones de GTK anteriores a gtk3 no tienen soporte para wayland y necesitan utilizar Xwayland para poder ejecutarse en una sesión de wayland mediante el backend X11.\n\n"
    },
    {
      "title": "Backend de Xorg",
      "level": 3,
      "content": "Si el servidor de visualización Xorg está en uso, el backend se establece automáticamente a x11.\n\nEs posible forzar las aplicaciones GTK3 a que se ejecutan en una sesión de wayland a utilizar el backend X11 a través de Xwayland configurando la variable de entorno GDK_BACKEND=x11.\n\n"
    },
    {
      "title": "Backend de Broadway",
      "level": 3,
      "content": "El backend de GDK Broadway proporciona soporte para mostrar aplicaciones GTK en un navegador web, utilizando HTML5 y sockets web. [4]\n\nCuando use broadwayd, especifique el número de pantalla a emplear, con el prefijo de dos puntos, similar a X. El número de pantalla predeterminado es 0 (cero).\n\n```\n$ display_number=:5\n```\n\nInícielo:\n\n```\n$ broadwayd $display_number\n```\n\nEl puerto utilizado por defecto es:\n\n```\nport = 8080 + $display_number\n```\n\nApunte su navegador a http://127.0.0.1:port.\n\nPara iniciar aplicaciones:\n\n```\n$ GDK_BACKEND=broadway BROADWAY_DISPLAY=$display_number <<aplicación>>\n```\n\nAlternativamente, puede configurar la dirección y el puerto\n\n```\n$ broadwayd --port $port_number --address $address $display_number\n```\n\n"
    },
    {
      "title": "Diferentes temas entre aplicaciones GTK 2 y GTK 3",
      "level": 3,
      "content": "En general, si un tema seleccionado es compatible con GTK 2 y GTK 3, este se aplicará a todas las aplicaciones GTK 2 y GTK 3. Si un tema seleccionado solo es compatible con GTK 2, se utilizará para las aplicaciones de GTK 2 y el tema predeterminado de GTK se utilizará para las aplicaciones de GTK 3. Si el tema seleccionado solo es compatible con GTK 3, se utilizará para las aplicaciones de GTK 3 y el tema predeterminado de GTK se utilizará para las aplicaciones de GTK 2. Por lo tanto, para la consistencia del tema de la aplicación, es mejor utilizar un tema que sea compatible con GTK 2 y GTK 3.\n\nPuede encontrar qué temas instalados en su sistema tienen las versiones GTK 2 y GTK 3 mediante esta orden (no funciona con nombres que contengan espacios):\n\n```\nfind $(find ~/.themes /usr/share/themes/ -wholename \"*/gtk-3.0\" | sed -e \"s/^\\(.*\\)\\/gtk-3.0$/\\1/\") -wholename \"*/gtk-2.0\" | sed -e \"s/.*\\/\\(.*\\)\\/gtk-2.0/\\1\"/\n```\n\n"
    },
    {
      "title": "Tema no aplicado en aplicaciones del superusuario",
      "level": 3,
      "content": "Como los archivos de temas del usuario ($XDG_CONFIG_HOME/gtk-3.0/settings.ini, ~/.gtkrc-2.0) no son leídos por otras cuentas, el tema seleccionado no se aplicará a las aplicaciones X ejecutadas como superusuario. Las posibles soluciones incluyen:\n\n- Crear enlaces simbólicos, por ejemplo:\n\n```\n# ln -s /home/[username]/.gtkrc-2.0 /etc/gtk-2.0/gtkrc\n# ln -s /home/[username]/.config/gtk-3.0/settings.ini /etc/gtk-3.0/settings.ini\n```\n\n- Configurar los archivos de temas en todo el sistema: /etc/gtk-3.0/settings.ini (GTK 3) o /etc/gtk-2.0/gtkrc (GTK 2)\n- Ajustar el tema como superusuario:\n\n```\n# lxappearance\n```\n\n- Utilizar un demonio de configuración (esto es lo que hacen la mayoría de los entornos de escritorio). Una variante agnóstica de escritorio que utiliza XSettings está disponible en AUR bajo xsettingsd-gitAUR.\n\n"
    },
    {
      "title": "Decoraciones del lado del cliente",
      "level": 3,
      "content": "GTK 3.12 introdujo las decoraciones del lado del cliente, que separa la barra de título del administrador de ventanas. Esto puede presentar problemas como las dobles barras de títulos, la no existencia de estas o las sombras dobles con la composición habilitada.\n\nPara eliminar la sombra y la brecha alrededor de las ventanas (por ejemplo, en combinación con un administrador de ventanas de mosaico), cree el siguiente archivo:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\n.window-frame, .window-frame:backdrop {\n box-shadow: 0 0 0 black;\n border-style: none;\n margin: 0;\n border-radius: 0;\n}\n\n.titlebar {\n border-radius: 0;\n}\n\n.window-frame.csd.popup {\n  box-shadow: 0 1px 2px rgba(0, 0, 0, 0.2), 0 0 0 1px rgba(0, 0, 0, 0.13);\n}\n\n.header-bar {\n  background-image: none;\n  background-color: #ededed;\n  box-shadow: none;\n}\n/* You may want to use this if you don't like the double title.\nGtkLabel.title {\n    opacity: 0;\n}*/\n```\n\nPara ajustar los botones en la barra superior, utilice la configuración gtk-decoration-layout. [5] El siguiente ejemplo eliminan todos los botones:\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\ngtk-decoration-layout=menu:\n```\n\n"
    },
    {
      "title": "Cedilla ç/Ç en lugar de ć/Ć",
      "level": 3,
      "content": "Véase [6], y [7] para una solución utilizando Xcompose (disposición internacional de EE.UU.).\n\n"
    },
    {
      "title": "Suprimir advertencia referente al bus de accesibilidad",
      "level": 3,
      "content": "Si no utiliza ninguna de las funciones de accesibilidad de Gnome, puede recibir advertencias en inglés como:\n\n```\nWARNING **: Couldn't connect to accessibility bus:\n```\n\nO en español:\n\n```\nADVERTENCIA **: No se pudo conectar al bus de accesibilidad:\n```\n\nPara suprimir estas advertencias, ejecute los programas con NO_AT_BRIDGE=1 o configúrelo como una variable de entorno global.\n\n"
    },
    {
      "title": "Falta de coincidencia del color de fondo de la barra de título",
      "level": 3,
      "content": "Si está utilizando un administrador de ventanas que utiliza un tema de decoración de ventanas que imita el color de fondo del tema GTK, es posible que el color de la barra de título ya no coincida completamente con el color de la aplicación en algunas aplicaciones GTK 3. Como solución, cree el siguiente archivo:\n\n```\n~/.config/gtk-3.0/gtk.css\n```\n\n```\n/* Always use background color */\nGtkWindow {\n    background-color: @theme_bg_color;\n}\n\n/* Fix tooltip background override */\n.tooltip {\n    background-color: rgba(0, 0, 0, 0.8);\n}\n\n.tooltip * {\n    background-color: transparent;\n}\n\n/* Fix Nautilus desktop window background override */\nNautilusWindow {\n     background-color: transparent; \n}\n```\n\n"
    },
    {
      "title": "Eventos de enfoque incorrecto con administradores de ventanas de mosaico",
      "level": 3,
      "content": "Defina GDK_CORE_DEVICE_EVENTS=1 para utilizar la entrada de estilo GTK 2, en lugar de xinput2. [9]\n\n"
    },
    {
      "title": "Soporte de miniaturas para el diálogo del archivo GTK",
      "level": 3,
      "content": "Instale gtk2-patched-filechooser-icon-viewAUR y gtk3-patched-filechooser-icon-viewAUR para tener la opción de ver los archivos como miniaturas en lugar de la lista en el selector de archivos de GTK.\n\n"
    },
    {
      "title": "Iconos de botón y menú",
      "level": 3,
      "content": "Para algunas aplicaciones en la sesión de Wayland de GNOME. Su archivo ~/.config/gtk-3.0/settings.ini está mal configurado. Esto puede ocurrir si prueba otros entornos de escritorio basados ​​en GTK. Estos son los valores afectados:\n\n```\n~/.config/gtk-3.0/settings.ini\n```\n\n```\n[Settings]\ngtk-button-images=1\ngtk-menu-images=1\n```\n\nSimplemente cámbielos a 0 o elimine todo el archivo para usar los valores predeterminados de GNOME.\n\n"
    },
    {
      "title": "GTK 3 sin polkit",
      "level": 3,
      "content": "GTK 3 depende del polkit a través de colord, que es requerido para imprimir. Sin embargo, la impresión funciona bien sin polkit instalado; al menos con una impresora monocromática y versiones de paquete gtk3-print-backends=3.22.19-2 y colord=1.4.1-1.\n\n"
    },
    {
      "title": "Algunos temas de GTK 2 solo cambian la paleta de colores de la interfaz de usuario",
      "level": 3,
      "content": "Según el tema elegido compatible con GTK 2, los controles de la interfaz de usuario pueden tener la apariencia predeterminada de Raleigh, posiblemente con una paleta de colores diferente. Esto se debe a que estos temas requieren el motor Murrine de GTK 2, que no está disponible (los programas GTK 2 deben avisar de ello en su salida de error estándar). Instale el paquete gtk-engine-murrine.\n\n"
    },
    {
      "title": "Parchear el selector de archivos GTK para utilizar el tipo regular antes",
      "level": 3,
      "content": "El selector de archivos GTK utiliza la misma característica de búsqueda anticipada que GNOME/Files. Esto puede ser muy discordante y no encajar muy bien con otros entornos de escritorio.\n\nAlgunas aplicaciones admiten XDG-desktop-portal que permite que la aplicación utilice el selector de archivos nativo. Si eso no funciona, puede restaurar la funcionalidad de escritura anticipada utilizando un GTK parcheado, por ejemplo gtk3-mushroomsAUR[enlace roto: package not found].\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Web oficial de GTK\n- Artículo en Wikipedia sobre GTK\n\n"
    }
  ]
}