{
  "title": "Guake (Русский)",
  "url": "https://wiki.archlinux.org/title/Guake_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- GNOME (Русский)\n\nGuake — выпадающий эмулятор терминала для GNOME (наподобие Yakuake для KDE, Tilda и консоли из игры Quake).\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет guake.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "После установки вы можете запустить Guake командой:\n\n```\n$ guake\n```\n\nПосле запуска вы можете зайти в Параметры в контекстном меню для изменения сочетания клавиш для появления/исчезания терминала. По умолчанию используется клавиша F12.\n\n"
    },
    {
      "title": "Автозапуск",
      "level": 2,
      "content": "Для автоматического запуска Guake при входе в систему создайте файл .desktop в /etc/xdg/autostart/:\n\n```\n# cp /usr/share/applications/guake.desktop /etc/xdg/autostart/\n```\n\nДля получения дополнительной информации смотрите статью Автозапуск.\n\n"
    },
    {
      "title": "Управление Guake из скрипта",
      "level": 2,
      "content": "Как и Yakuake, Guake позволяет настраивать себя после запуска посредством передачи сигналов через D-Bus. Таким образом, его можно использовать в сеансе, определяемом пользователем (user defined session). Вы можете создавать вкладки, устанавливать их имена, запросить запуск конкретной команды в любой открытой вкладке или просто показать/скрыть окно Guake, вручную в окне любого терминала либо создав для этого скрипт. Ниже приведен пример такого скрипта.\n\nВы можете использовать сам исполняемый файл guake для отправки сообщений D-Bus. Вот список доступных опций, которые могут быть вам интересны:\n\n- -t, --toggle-visibility — переключить видимость окна терминала (отобразить, если спрятано, и наоборот). По сути, вы можете просто набрать guake, и, если терминал уже был запущен, будет переключена видимость его окна.\n- -f, --fullscreen — переключить Guake в полноэкранный режим.\n- --show — показать окно Guake.\n- --hide — спрятать окно Guake.\n- -n ТЕК_КАТ, --new-tab=ТЕК_КАТ — создать новую вкладку и выбрать ее. Если указано значение ТЕК_КАТ, оно будет использовано для установки текущего каталога вкладки.\n- -s НОМЕР, --select-tab=НОМЕР — выбрать (сделать текущей) вкладку с номером НОМЕР. Вкладки нумеруются с нуля.\n- -g, --selected-tab — вывести номер текущей вкладки.\n- -e КОМАНДА, --execute-command=КОМАНДА — выполнить указанную команду КОМАНДА в текущей вкладке.\n- -i НОМЕР, --tab-index=НОМЕР — используется с --rename-tab для указания номера НОМЕР вкладки, которую необходимо переименовать. По умолчанию используется значение 0.\n- --rename-tab=ИМЯ — установить новое имя вкладки ИМЯ. Вы можете сбросить имя вкладки на значение по умолчанию, указав знак дефиса (\"-\"). Используйте опцию -i, чтобы указать, какую вкладку следует переименовать.\n- --bgcolor=RGB — установить цвет фона текущей вкладки RGB, указанный в шестнадцатеричном формате (#rrggbb).\n- --fgcolor=RGB — установить цвет текста текущей вкладки RGB, указанный в шестнадцатеричном формате (#rrggbb).\n- -r ИМЯ, --rename-current-tab=ИМЯ — то же, что и --rename-tab, но переименовывает текущую вкладку.\n- -q, --quit — завершить работу Guake.\n\nМожно комбинировать несколько опций в одном вызове. Если при вызове еще не был запущен экземпляр Guake, он будет запущен и все указанные опции будут к нему применены.\n\nЧтобы отобразить список всех доступных опций, наберите guake --help.\n\nЕсть 2 пути запуска guake с применением этих скриптов:\n\n- скопировать пример в файл вроде guake-init.sh, сделать его исполняемым и запускать его вместо guake;\n- кликнуть правой кнопкой мыши для вызова меню, открыть Guake Terminal > Параметры > События и добавить путь к guake-init.sh в поле «При запуске», при этом закомментировать строки /usr/bin/guake & и sleep 5 в приведённом ниже скрипте.\n\nВторой вариант предпочтителен, если вы хотите, чтобы скрипт выполнялся независимо от способа запуска guake, и в любом случае вы можете попросить guake не запускать этот скрипт с помощью опции guake --no-startup-script если понадобится.\n\nПример:\n\n```\n#!/bin/bash\n\n/usr/bin/guake &\nsleep 5 # позволим Guake запуститься и создать сеанс D-Bus\n\n# настроим единственную вкладку, которая открывается по умолчанию\nguake --rename-tab=\"iotop\" --execute=\"/usr/bin/iotop\"\n\n# создадим новую вкладку, запустим в ней сеанс bash\nguake --new-tab --execute=\"/usr/bin/bash\"\n# затем вызовем htop, переименовав вкладку в \"htop\"\nguake --execute=\"/usr/bin/htop\" --rename-tab=\"htop\"\n\n# ...\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/atop\" --rename-tab=\"atop\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"~/.iptables.sh\" --rename-tab=\"iptables -nvL\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/journalctl --follow --full\" --rename-tab=\"journalctl\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/irssi\" --rename-current-tab=\"irssi\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/sudo -i\" --rename-current-tab=\"rootshell0\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/sudo -i\" --rename-current-tab=\"rootshell1\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --rename-current-tab=\"shell0\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --rename-current-tab=\"shell1\"\n```\n\nОбратите внимание, что следует подождать некоторое время, вызвав sleep, чтобы избежать состояния гонки между процессами.\n\n"
    },
    {
      "title": "Плавающий режим в оконных менеджерах",
      "level": 3,
      "content": "Guake может работать не в плавающем режиме с некоторыми оконными менеджерами. Это можно решить, используя строку класса окна Guake (\"guake\" или \"Guake\" для xprop WM_CLASS). Например, для i3 смотрите i3 (Русский)#Правильное обращение с плавающими диалогами.\n\n"
    },
    {
      "title": "Переключение видимости Guake не работает (Wayland)",
      "level": 3,
      "content": "Если у вас Wayland, горячая клавиша переключения видимости иногда не работает. Это из-за того, что Guake использует библиотеку глобальных горячих клавиш, созданную для X, а для Wayland эквивалент глобальных горячих клавиш отсутствует. Многие приложения (например Firefox) работают в Wayland через Xwayland, и в них горячая клавиша будет работать, а в приложениях, работающих нативно в Wayland (например, приложения GNOME) работать не будет.\n\nПростым обходным путём может быть настройка горячей клавиши на вызов команды guake-toggle в вашем оконном менеджере или окружении рабочего стола.\n\nПодробнее смотрите этот github issue.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальная документация Guake\n\n"
    }
  ]
}