{
  "title": "Guake (Español)",
  "url": "https://wiki.archlinux.org/title/Guake_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-11-29** \n\nArtículos relacionados\n\n- GNOME\n\nGuake[enlace roto 2023-10-29] es un terminal despleable desde la parte superior de la pantella para GNOME (al estilo de Yakuake para KDE, Tilda o el terminal utilizado en Quake).\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale guake, disponible en los repositorios oficiales.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Una vez instalado, puede iniciar Guake desde un terminal con:\n\n```\n$ guake\n```\n\nDespués de que Guake se haya iniciado, puede hacer clic con el botón secundario del ratón sobre la interfaz y seleccionar Preferencias para cambiar la tecla de acceso rápido y descartar el terminal automáticamente, que de forma predeterminada está configurada en F12.\n\n"
    },
    {
      "title": "Inicio automático",
      "level": 2,
      "content": "Es posible que desee cargar Guake al iniciar el entorno de escritorio. Para hacer esto, necesita:\n\n```\n# cp /usr/share/applications/guake.desktop /etc/xdg/autostart/\n```\n\nConsulte Autostarting para obtener más información.\n\n"
    },
    {
      "title": "Realizar script para Guake",
      "level": 2,
      "content": "Al igual que Yakuake, Guake permite controlarse en tiempo de ejecución enviando los mensajes del servicio D-Bus. Por lo tanto, se puede utilizar para iniciar Guake en una sesión definida por el usuario. Puede crear pestañas, asignarles nombres y también solicitar ejecutar cualquier orden específica en cualquier pestaña abierta o simplemente mostrar/ocultar la ventana de Guake, manualmente en un terminal o creando un script personalizado para ello.\n\nEjemplo de tal script se proporciona debajo de esta sección.\n\nPuede utilizar el ejecutable guake para enviar mensajes D-Bus. Aquí está la lista de opciones disponibles que le pueden interesar:\n\n- -t, --toggle-visibility — alterna la visibilidad de la ventana del terminal. En realidad, puede escribir guake, y alternará la visibilidad de la instancia que ya se está ejecutando.\n- -f, --fullscreen — pone Guake en modo de pantalla completa.\n- --show — muestra la ventana principal de Guake.\n- --hide — oculta la ventana principal de Guake.\n- -n CUR_DIR, --new-tab=CUR_DIR — crea una nueva pestaña y la selecciona. El valor de CUR_DIR es utilizado para establecer un directorio actual para la pestaña, si se especifica.\n- -s INDEX, --select-tab=INDEX — selecciona la pestaña con el índice INDEX. Las pestañas indexadas comienzan con 0.\n- -g, --selected-tab — imprime el índice de la pestaña seleccionada actualmente.\n- -e CMD, --execute-command=CMD — ejecuta una orden arbitraria CMD en la pestaña seleccionada .\n- -i INDEX, --tab-index=INDEX — utilizada con --rename-tab para especificar el índice INDEX de una pestaña para renombrarla. El valor predeterminado es 0.\n- --rename-tab=TITLE — establece el nombre de la pestaña en TITLE. Puede restablecer el título de la pestaña al valor predeterminado pasando un solo guión (\"-\"). Utilice la opción -i para especificar qué pestaña cambiar de nombre.\n- --bgcolor=RGB — establece el color de fondo RGB en términos hexadecimales (#rrggbb) de la pestaña seleccionada.\n- --fgcolor=RGB — establece el color del primer plano RGB en términos hexadecimales (#rrggbb) de la pestaña seleccionada.\n- -r TITLE, --rename-current-tab=TITLE — igual que --rename-tab, pero cambia el nombre de la pestaña seleccionada actualmente.\n- -q, --quit — cierra la instancia de Guake en funcionamiento.\n\nSe pueden combinar varias opciones en una sola llamada. Si no se está ejecutando una instancia de Guake, todas las opciones especificadas se aplicarán a la instancia recién creada.\n\nPara mostrar la lista de todas las opciones disponibles, escriba guake --help.\n\nHay 2 formas de iniciar Guake mientras aplica estos scripts:\n\n- copiando el siguiente ejemplo en un archivo como guake-init.sh haciéndolo ejecutable y lanzando ese archivo en lugar de guake;\n- haciendo clic con el botón secundario del ratón en Terminal de Guake > Preferencias > General y añadir la ruta al script guake-init.sh en la sección «Path to script executed on Guake start:» mientras se asegura para comentar /usr/bin/guake & del script siguiente.\n\nLa segunda opción es preferible si desea que el script se ejecute independientemente de cómo se inicie Guake y aún puede indicarle a Guake que no ejecute el script con guake --no-startup-script, si es necesario.\n\nEjemplo:\n\n```\n#!/bin/bash\n\n/usr/bin/guake &\nsleep 5 # deja que comience el proceso Guake principal e inicialice la sesión de D-Bus\n\n# pestaña de ajuste que se abrirá por defecto\nguake --rename-tab=\"iotop\" --execute=\"/usr/bin/iotop\"\n\n# crea nueva pestaña, e inicia sesión bash en ella\nguake --new-tab --execute=\"/usr/bin/bash\"\n# y luego ejecuta htop, renombrando la pestaña a «htop»\nguake --execute=\"/usr/bin/htop\" --rename-current-tab=\"htop\"\n\n# ...\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/atop\" --rename-current-tab=\"atop\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"~/.iptables.sh\" --rename-current-tab=\"iptables -nvL\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/journalctl --follow --full\" --rename-current-tab=\"journalctl\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/irssi\" --rename-current-tab=\"irssi\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/sudo -i\" --rename-current-tab=\"rootshell0\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --execute=\"/usr/bin/sudo -i\" --rename-current-tab=\"rootshell1\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --rename-current-tab=\"shell0\"\n\nguake --new-tab --execute=\"/usr/bin/bash\"\nguake --rename-current-tab=\"shell1\"\n```\n\nTenga en cuenta que debemos esperar un tiempo que se denomina sleep para evitar condiciones de solapamiento entre instancias en ejecución.\n\n"
    },
    {
      "title": "En gestores de ventanas flotantes",
      "level": 3,
      "content": "Si está utilizando Tilda y un gestor de ventanas flotante, puede descubrir que puede utilizar la cadena class de «Tilda» para establecer que la ventana siga flotando. Pero la salida de WM_CLASS(STRING) de Guake es «Main.py», por lo que debe utilizar «Main.py» para hacer esto. Por ejemplo, en i3wm, añada esto a su .i3/config:\n\n```\nfor_window [class=\"Main.py\"] floating enable\n```\n\n"
    },
    {
      "title": "Alternar la visibilidad de Guake no funciona (Wayland)",
      "level": 3,
      "content": "Si está utilizando Wayland, la tecla de acceso rápido de alternancia de visibilidad de Guake puede no funcionar en algunas aplicaciones. Esto se debe a que Guake utiliza una biblioteca global de teclas rápidas para entornos X y no hay una interfaz global de teclas rápidas equivalente para Wayland. Muchas aplicaciones (por ejemplo, Firefox) se ejecutan en Wayland a través de Xwayland, donde funcionará la alternatividad de Guake, pero otras que ejecutan de forma nativa Wayland (por ejemplo, aplicaciones GNOME) desactivan la función de alternar Guake.\n\nSi no desea cambiar a un entorno X, una solución simple requiere configurar un acceso directo con su gestor de ventanas/entorno de escritorio para la orden guake-toggle.\n\nConsulte github issue para obtener más detalles.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Documentación oficial de Guake\n\n"
    }
  ]
}