{
  "title": "Guia d'instal·lació",
  "url": "https://wiki.archlinux.org/title/Guia_d%27instal%C2%B7laci%C3%B3",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Aquest document és una guia per a la instal·lació d'Arch Linux fent servir el sistema live carregat des d'un mitjà d'instal·lació creat des d'una imatge d'instal·lació oficial. El mitjà d'instal·lació ofereix característiques d'accessibilitat descrites a la pàgina Instal·lació d'Arch Linux amb opcions d'accessibilitat. Per a mètodes alternatius d'instal·lació, vegueu Category:Installation process (Català).\n\nAbans d'instal·lar, es recomana comprovar les preguntes freqüents. Podeu trobar les convencions utilitzades en aquest document a Help:Reading (Català). En particular, els exemples de codi poden contenir placeholders (en cursiva) que s'han de substituir manualment.\n\nPer a instruccions més detallades, consulteu els articles pertinents a l'ArchWiki o les diverses pàgines del man dels programes, ambdós enllaçats des d'aquesta guia. Per a ajuda interactiva, també estan disponibles el canal IRC i els fòrums.\n\nArch Linux hauria d'executar-se a qualsevol sistema compatible amb x86_64 i amb un mínim de 512 MiB de RAM, tot i que es necessita més memòria per a carregar el sistema live per a la instal·lació. [1]. Una instal·lació bàsica hauria d'ocupar menys de 2 GiB d'espai de disc. Com el procés d'instal·lació requereix obtenir els paquets d'un repositori remot, aquesta guia assumeix que es disposa d'una connexió a internet funcional.\n\n"
    },
    {
      "title": "Adquiriu una imatge d'instal·lació",
      "level": 3,
      "content": "Visiteu la pàgina de descarregues i, depenent de com vulgueu carregar el sistema, adquiriu un arxiu ISO o una imatge netboot, i la firma GnuPG corresponent.\n\n"
    },
    {
      "title": "Verifiqueu la firma",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nEs recomana verificar la firma de la imatge abans de fer-la servir, especialment quan s'ha descarregat d'un mirror HTTP, on les descàrregues són susceptibles a ser interceptades per a oferir imatges malicioses.\n\nEn un sistema amb GnuPG instal·lat, feu-ho descarregant la ISO PGP signature (sota Checksums a la pàgina de descarregues) al directori de la ISO, i verificant-la amb:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-versió-x86_64.iso.sig\n```\n\nDe manera alternativa, executeu des d'una instal·lació d'Arch Linux activa:\n\n```\n$ pacman-key -v archlinux-versió-x86_64.iso.sig\n```\n\n- La mateixa firma podria ser manipulada si es descarrega des d'un mirror en comptes de archlinux.org com s'ha mostrat. En aquest cas, assegureu que la clau pública, que s'utilitza per a verificar la signatura, està firmada per una altra clau de confiança. La comanda gpg mostrarà la petjada de la clau pública.\n- Un altre mètode per a verificar l'autenticitat de la firma és assegurar que la petjada de la clau pública és idèntica a la petjada de la clau del desenvolupador d'Arch Linux que va firmar el fitxer ISO. Vegeu aquest article per a més informació sobre el procés de clau pública per a autentificar claus.\n\n"
    },
    {
      "title": "Prepareu un mitjà d'instal·lació",
      "level": 3,
      "content": "La imatge d'instal·lació es pot carregar a la màquina objectiu mitjançant una unitat USB, un disc òptic o la xarxa amb PXE: seguiu l'article apropiat per a preparar vosaltres mateixos un mitjà d'instal·lació amb la imatge escollida.\n\n"
    },
    {
      "title": "Arranqueu l'entorn live",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\n1. Configureu el disc que conté el mitjà d'instal·lació d'Arch Linux com al vostre disc d'arrancada. Això normalment es pot fer prement una tecla durant la fase POST, com indica la pantalla de benvinguda. Consulteu el manual de la vostra placa base per a més detalls.\n1. Quan el menú d'arrencada del mitjà d'instal·lació aparegui, seleccioneu Arch Linux install medium i premeu Intro per a entrar a l'entorn d'instal·lació. Consell: La imatge d'instalació utilitza GRUB per a l'arrencada UEFI i syslinux per a l'arrencada BIOS. Vegeu README.bootparams per a una llista de paràmetres d'arrencada.\n1. Se us presentarà amb una consola de comandes Zsh del usuari root, a la primera consola virtual.\n\nPer canviar a una altra consola - per exemple, per veure aquesta guia amb Lynx durant la instal·lació - useu la drecera Alt+fletxa. Per a editar fitxers de configuració, teniu a la vostra disposició mcedit(1), nano i vim. Vegeu pkglist.x86_64.txt per a una llista de paquets inclosos al mitjà d'instal·lació.\n\n"
    },
    {
      "title": "Seleccioneu la distribució de teclat de la consola",
      "level": 3,
      "content": "El mapa de tecles de la consola per defecte és el US. Podeu llistar les distribucions disponibles amb:\n\n```\n# ls /usr/share/kbd/keymaps/**/*.map.gz\n```\n\nPer a seleccionar una distribució de teclat, passa el nom del fitxer corresponent a loadkeys(1), ometent la ruta i l'extensió del fitxer. Per exemple, per a configurar una distribució de teclat espanyola:\n\n```\n# loadkeys es\n```\n\nLes fonts de consola es troben a /usr/share/kbd/consolefonts/ i es poden configurar de forma similar amb setfont(8).\n\n"
    },
    {
      "title": "Verifiqueu el mode d'arrencada",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nPer a verificar el mode d'arrencada, llisteu el directori efivars:\n\n```\n# ls /sys/firmware/efi/efivars\n```\n\nSi la comanda mostra el directori sense errors, llavors el sistema ha arrencat en mode UEFI. Si el directori no existeix, el sistema ha arrencat en mode BIOS (o en mode CSM). Si el sistema no ha arrencat en el mode que desitjàveu, consulteu el manual de la vostra placa base.\n\n"
    },
    {
      "title": "Connecteu-vos a internet",
      "level": 3,
      "content": "Per a configurar una connexió de xarxa a l'entorn live, seguiu els següents passos:\n\n- Confirmeu que la vostra interfície de xarxa és llistada i habilitada, per exemple amb ip-link(8): # ip link\n- Per a connexions sense fil i WWAN, assegureu-vos que la targeta no està bloquejada amb rfkill.\n- Connecteu-vos a la xarxa: Ethernet - endolleu el cable. Wi-Fi - autentifiqueu-vos a la xarxa sense fils mitjançant iwctl. Mòdem mòbil de banda ampla - connecteu-vos a la xarxa mòbil amb l'eina mmcli.\n- Configureu la vostra connexió de xarxa: DHCP: l'assignació dinàmica d'adreces IP i servidors DNS (proporcionada per systemd-networkd i systemd-resolved) hauria de funcionar sense seguir cap pas addicional amb interfícies de xarxa Ethernet, WLAN i WWAN. Adreça IP estàtica: seguiu Network configuration (Català)#Adreces IP estàtiques.\n- Podeu verificar la connexió amb ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernet - endolleu el cable.\n- Wi-Fi - autentifiqueu-vos a la xarxa sense fils mitjançant iwctl.\n- Mòdem mòbil de banda ampla - connecteu-vos a la xarxa mòbil amb l'eina mmcli.\n\n- DHCP: l'assignació dinàmica d'adreces IP i servidors DNS (proporcionada per systemd-networkd i systemd-resolved) hauria de funcionar sense seguir cap pas addicional amb interfícies de xarxa Ethernet, WLAN i WWAN.\n- Adreça IP estàtica: seguiu Network configuration (Català)#Adreces IP estàtiques.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Actualitzeu el rellotge del sistema",
      "level": 3,
      "content": "A l'entorn live systemd-timesyncd està habilitat per defecte i l'hora se sincronitzarà automàticament un cop s'estableixi una connexió a internet.\n\nUseu timedatectl(1) per assegurar-vos que el rellotge del sistema és precís:\n\n```\n# timedatectl status\n```\n\n"
    },
    {
      "title": "Particioneu els discs",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nQuan el sistema live reconeix els discs, els assigna a un dispositiu de blocs com /dev/sda, /dev/nvme0n1 o /dev/mmcblk0. Per a identificar aquests dispositius, useu lsblk o fdisk.\n\n```\n# fdisk -l\n```\n\nEls resultats acabats en rom, loop o airoot poden ser ignorats.\n\nLes següents particions són necessàries en un dispositiu de la vostra elecció:\n\n- Una partició per al directori arrel /.\n- Per a arrencar en mode UEFI: una partició del sistema EFI.\n\nSi voleu crear dispositius de blocs apilats per a LVM, l'encriptació del sistema o RAID, feu-ho ara.\n\nUseu fdisk o parted per a modificar les taules de particions. Per exemple:\n\n```\n# fdisk /dev/disc_a_particionar\n```\n\n- Si no apareix el disc, assegureu-vos que el controlador del disc no està en mode RAID.\n- Si el disc des del qual voleu arrencar, ja té una partició del sistema EFI, empreu-la en comptes de crear una nova.\n- L'espai d'intercanvi pot configurar-se a un fitxer d'intercanvi en sistemes de fitxers que ho admetin.\n\n"
    },
    {
      "title": "Exemples de disposicions",
      "level": 4,
      "content": "Table content:\nPunt de muntatge | Partició | Tipus de partició | Mida suggerida\n/mnt/boot1 | /dev/particio_del_sistema_EFI | Partició del sistema EFI | Com a mínim 300 MiB\n[SWAP] | /dev/partició_de_intercanvi | Espai d'intercanvi de Linux | Més de 512 MiB\n/mnt | /dev/partició_arrel | Partició arrel de Linux (x86-64) | Resta del dispositiu\n\n1. És possible utilitzar altres punts de muntatge, com /mnt/efi, sempre que el carregador d'arrencada sigui capaç de carregar les imatges del kernel i de l'initramfs des del volum arrel. Vegeu l'advertència a Arch boot process (Català)#Carregador d'arrencada.\n\nTable content:\nPunt de muntatge | Partició | Tipus de partició | Mida suggerida\n[SWAP] | /dev/partició_de_intercanvi | Espai d'intercanvi de Linux | Més de 512 MiB\n/mnt | /dev/partició_arrel | Linux | Resta del dispositiu\n\nVegeu també Partitioning (Català)#Exemples de disposicions.\n\n"
    },
    {
      "title": "Formateu les particions",
      "level": 3,
      "content": "Un cop creades les particions, cada una de les noves particions ha de ser formatada amb un sistema de fitxers adequat. Vegeu File system (Català)#Creeu un sistema de fitxers per més detalls.\n\nPer exemple, per a crear un sistema de fitxers Ext4 a /dev/partició_arrel, executeu:\n\n```\n# mkfs.ext4 /dev/partició_arrel\n```\n\nSi heu creat una partició per a l'espai d'intercanvi, incialitzeu-la amb mkswap(8):\n\n```\n# mkswap /dev/partició_de_intercanvi\n```\n\nSi heu creat una partició del sistema EFI, formateu-la a FAT32 mitjançant mkfs.fat(8).\n\n```\n# mkfs.fat -F 32 /dev/partició_del_sistema_efi\n```\n\n"
    },
    {
      "title": "Munteu els sistemes de fitxers",
      "level": 3,
      "content": "Munteu el volum arrel a /mnt. Per exemple, si el volum arrel és /dev/partició_arrel:\n\n```\n# mount /dev/partició_arrel /mnt\n```\n\nCreeu qualsevol punt de muntatge restant (com /mnt/efi) i munteu els seus volums corresponents.\n\nEn sistemes UEFI, munteu la partició del sistema EFI:\n\n```\n# mount --mkdir /dev/partició_del_sistema_efi /mnt/boot\n```\n\nSi heu creat un volum d'intercanvi, activeu-lo amb swapon(8):\n\n```\n# swapon /dev/partició_de_intercanvi\n```\n\ngenfstab(8) més endavant detectarà els sistemes de fitxers muntats i l'espai d'intercanvi.\n\n"
    },
    {
      "title": "Seleccioneu els miralls",
      "level": 3,
      "content": "Els paquets a instal·lar s'han de descarregar dels servidors mirall, que estan definits a /etc/pacman.d/mirrorlist. En el sistema live, després de connectar-vos a internet, reflector actualitza la llista de miralls escollint els 20 miralls HTTPS més recentment actualitzats i ordenant-los per velocitat de descàrrega.\n\nEls miralls més amunt a la llista tenen més prioritat a l'hora de descarregar un paquet. Us pot interessar inspeccionar el fitxer per veure si és satisfactori. Si no fos el cas, editeu el fitxer, movent els miralls més propers geogràficament al capdamunt de la llista, tot i que hi ha altres criteris a tenir en compte.\n\nAquest fitxer més endavant serà copiat al nou sistema per pacstrap, així que val la pena ajustar-lo correctament.\n\n"
    },
    {
      "title": "Instal·leu els paquets essencials",
      "level": 3,
      "content": "Note: **Aquest article o secció necessita ser traduït.** Aquest article o secció necessita ser traduït.\n\nAquest article o secció necessita ser traduït.\n\nUseu l'script pacstrap(8) per a instal·lar el paquet base, el kernel Linux i el microprogramari per a maquinari comú:\n\n```\n# pacstrap -K /mnt base linux linux-firmware\n```\n\n- Podeu substituir linux amb un paquet de kernel de la vostra elecció, o ometre'l completament si esteu instal·lant a un contenidor.\n- Podeu ometre la instal·lació del paquet de microprogramari (linux-firmware) si esteu instal·lant a una màquina virtual o a un contenidor.\n\nEl paquet base no inclou totes les eines de l'entorn d'instal·lació, així que pot ser necessari instal·lar paquets addicionals per tenir un sistema base totalment funcional. En particular, considereu instal·lar:\n\n- utilitats d'espai d'usuari per a la gestió dels sistemes de fitxers que s'utilitzaran al sistema,\n- utilitats per a accedir a particions Raid o LVM,\n- microprogramari específic per a altres dispositius no inclosos a linux-firmware (per exemple, sof-firmware per a targetes de so),\n- programari necessari per a interactuar amb la xarxa (per exemple, un gestor de xarxes o un client DHCP),\n- un editor de text,\n- paquets per a accedir a la documentació a les pàgines del man i d'info: man-db, man-pages i texinfo.\n\nPer a instal·lar altres paquets o grups de paquets, afegiu els noms al final de la comanda pacstrap anterior (separats per espais) o utilitzeu pacman mentre accediu al nou sistema amb chroot. Per a comparar, podeu trobar els paquets disponibles al sistema live a pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Genereu un fitxer fstab (utilitzeu -U o -L per a escollir entre l'ús de UUIDs o etiquetes, respectivament):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nComproveu el fitxer resultant (/mnt/etc/fstab), i editeu-lo en cas de trobar errors.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Canvieu d'arrel per entrar al nou sistema:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Zona horària",
      "level": 3,
      "content": "Establiu la zona horària:\n\n```\n# ln -sf /usr/share/zoneinfo/Regió/Ciutat /etc/localtime\n```\n\nExecuteu hwclock(8) per a generar el fitxer /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nAquesta comanda assumeix que el rellotge de maquinari està configurat en UTC. Vegeu System time (Català)#Estàndard de temps per a més detalls.\n\n"
    },
    {
      "title": "Localització",
      "level": 3,
      "content": "Editeu /etc/locale.gen i descomenteu en_US.UTF-8 UTF-8 i qualsevol altre locale necessari (per exemple, ca_ES.UTF-8 UTF-8). Genereu els locales executant:\n\n```\n# locale-gen\n```\n\nCreeu el fitxer locale.conf(5), i definiu la variable LANG com correspongui:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=ca_ES.UTF-8\n```\n\nSi havíeu seleccionat una distribució de teclat per a la consola, feu el canvi persistent a vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=es\n```\n\n"
    },
    {
      "title": "Configuració de xarxa",
      "level": 3,
      "content": "Creeu el fitxer hostname:\n\n```\n/etc/hostname\n```\n\n```\nelmeuhostname\n```\n\nCompleteu la configuració de xarxa per al nou entorn instal·lat. Aquest pas pot incloure la instal·lació de programari de gestió de xarxes adequat.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Crear un nou initramfs no acostuma a ser necessari, perquè mkinitcpio s'executa durant la instal·lació del paquet del kernel amb pacstrap.\n\nPer a LVM, encriptació del sistema o RAID, modifiqueu mkinitcpio.conf(5) i recreeu la imatge initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Contrasenya de l'usuari root",
      "level": 3,
      "content": "Establiu la contrasenya de l'usuari root:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Carregador d'arrencada",
      "level": 3,
      "content": "Escolliu i instal·leu un carregador d'arrencada capaç d'iniciar sistemes Linux. Si teniu un processador Intel o AMD, activeu també les actualitzacions de microcodi.\n\n"
    },
    {
      "title": "Reinicieu",
      "level": 2,
      "content": "Sortiu de l'entorn chroot teclejant exit o prement Ctrl+d.\n\nOpcionalment, desmunteu manualment totes les particions amb umount -R /mnt: això us permetrà detectar particions \"ocupades\", i trobar la causa amb fuser(1).\n\nFinalment, reinicieu la màquina teclejant reboot: qualsevol partició encara muntada serà desmuntada automàticament per systemd. Recordeu desconnectar el mitjà d'instal·lació i llavors inicieu sessió al nou sistema amb l'usuari root.\n\n"
    },
    {
      "title": "Post-instal·lació",
      "level": 2,
      "content": "Vegeu General recommendations (Català) per a indicacions sobre la gestió del sistema i tutorials post-instal·lació (com la creació d'usuaris sense privilegis o la configuració d'una interfície d'usuari gràfica, del so o d'un panell tàctil).\n\nPer a una llista d'aplicacions que poden ser d'interès, vegeu List of applications (Català).\n\n"
    }
  ]
}