{
  "title": "Guía Oficial de Instalación",
  "url": "https://wiki.archlinux.org/title/Gu%C3%ADa_Oficial_de_Instalaci%C3%B3n",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2024-07-12** \n\nEste documento es una guía para la instalación de Arch Linux utilizando un sistema live iniciado desde un medio de instalación creado a partir de una imagen de instalación oficial. El medio de instalación proporciona funciones de accesibilidad que se describen en la página Instalar Arch Linux con opciones de accesibilidad. Para conocer medios alternativos de instalación, véase Categoría:Proceso de instalación.\n\nAntes de instalar, se recomienda ver el artículo FAQ. Para conocer las convenciones utilizadas en este documento, véase Ayuda:Lectura. En particular, los ejemplos de código pueden contener marcadores de posición (resaltados en cursiva) que deberán reemplazarse manualmente.\n\nEste es un instructivo conciso, pensado para que se siga el orden presentado por sección. Para obtener instrucciones más detalladas, véase los artículos relacionados de ArchWiki, o las páginas de los manuales de los distintos programas, con enlaces para ambos a lo largo de esta guía. Para obtener ayuda interactiva, dispone de los canales IRC y los foros.\n\nArch Linux puede ejecutarse en cualquier máquina compatible x86_64 con al menos 512 MiB de RAM, aunque se necesita más memoria para iniciar el sistema live para la instalación.[1] Una instalación básica debería ocupar menos de 2 GiB de espacio en disco. Dado que el proceso de instalación necesita obtener los paquetes desde un repositorio remoto, esta guía asume que dispone de una conexión a Internet funcional.\n\n"
    },
    {
      "title": "Adquirir una imagen de instalación",
      "level": 3,
      "content": "Visite la página Descarga y, dependiendo de cómo desee iniciar, adquiera el archivo ISO o una imagen de arranque de red y la firma GnuPG respectiva.\n\n"
    },
    {
      "title": "Verificar las firmas",
      "level": 3,
      "content": "Se recomienda verificar la firma de la imagen antes de usarla, especialmente cuando se descarga desde un servidor de réplica HTTP, donde las descargas generalmente son susceptibles de ser interceptadas por imágenes de servidores maliciosos.\n\nEn un sistema con GnuPG instalado, realice esta operación descargando la firma PGP ISO (bajo Checksums de la página Descarga) en el directorio de la imagen ISO, y verifíquela con la siguiente orden:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nTambién, desde una instalación existente de Arch Linux, puede escribir:\n\n```\n$ pacman-key -v archlinux-version-x86_64.iso.sig\n```\n\n- La firma en sí podría manipularse si se descarga desde un sitio de réplica, en lugar de hacerlo desde archlinux.org como se recomendó antes. En este caso, asegúrese de que la clave pública, que se utiliza para decodificar la firma, esté firmada por otra clave de confianza. La orden gpg emitirá la huella digital de la clave pública.\n- Otro método para verificar la autenticidad de la firma es asegurarse de que la huella digital de la clave pública sea idéntica a la huella digital de la del desarrollador de Arch Linux que firmó el archivo ISO. Véase Wikipedia:Public-key cryptography y Wikipedia:es:Criptografía asimétrica para obtener más información sobre el proceso de clave pública para autenticar claves.\n\n"
    },
    {
      "title": "Preparar un medio de instalación",
      "level": 3,
      "content": "La imagen de instalación (ISO) se puede suministrar a la máquina de destino a través de un unidad USB flash, un disco óptico o una red con PXE: vaya al artículo apropiado para preparar un medio de instalación a partir de la imagen elegida.\n\nPara el arranque de red, siga Netboot#Boot from a USB flash drive para preparar una unidad USB para el arranque por UEFI.\n\n"
    },
    {
      "title": "Arrancar el entorno live",
      "level": 3,
      "content": "1. Apunte el dispositivo de arranque actual a una unidad que contenga el soporte de instalación de Arch se logra, normalmente, presionando una tecla durante la fase POST (siglas en inglés de power-on self-test o autoprueba de arranque), tecla que se suele indicar en la pantalla de inicio del ordenador. Véase el manual de su placa base para más detalles.\n\n1. Cuando aparezca el menú de arranque de Arch, Si está usando el archivo ISO, seleccione Arch Linux install medium y pulse Intro para ingresar al entorno de instalación. Si está usando la imagen para arranque de red, desde el menú Mirror, elija un servidor de réplicas («mirror») que le esté geográficamente cerca, seleccione la opción de arranque (Boot Arch Linux) y presione intro. Sugerencia: La imagen de instalación utiliza systemd-boot para UEFI y syslinux para el arranque BIOS. Use, respectivamente, e o Tabulador para ingresar los parámetros del kernel. La imagen para arranque de red usa iPXE, así que los parámetros de arranque se pueden especificar en el menú «Boot options». Véase README.bootparams para obtener una lista de los parámetros de arranque. Un ejemplo de parámetro de arranque que se suele especificar, es el tamaño de letra. Para una mejor legibilidad en pantallas de alta resolución (si no son detectadas correctamente), puede usar fbcon=font:TER16x32. Vea HiDPI#Linux console (tty) para una explicación más detallada.\n1. \n1. Iniciará sesión en la primera consola virtual como usuario root, y se le presentará un intérprete de línea de órdenes Zsh (Español).\n\n- Si está usando el archivo ISO, seleccione Arch Linux install medium y pulse Intro para ingresar al entorno de instalación.\n- Si está usando la imagen para arranque de red, desde el menú Mirror, elija un servidor de réplicas («mirror») que le esté geográficamente cerca, seleccione la opción de arranque (Boot Arch Linux) y presione intro. Sugerencia: La imagen de instalación utiliza systemd-boot para UEFI y syslinux para el arranque BIOS. Use, respectivamente, e o Tabulador para ingresar los parámetros del kernel. La imagen para arranque de red usa iPXE, así que los parámetros de arranque se pueden especificar en el menú «Boot options». Véase README.bootparams para obtener una lista de los parámetros de arranque. Un ejemplo de parámetro de arranque que se suele especificar, es el tamaño de letra. Para una mejor legibilidad en pantallas de alta resolución (si no son detectadas correctamente), puede usar fbcon=font:TER16x32. Vea HiDPI#Linux console (tty) para una explicación más detallada.\n\n- La imagen de instalación utiliza systemd-boot para UEFI y syslinux para el arranque BIOS. Use, respectivamente, e o Tabulador para ingresar los parámetros del kernel. La imagen para arranque de red usa iPXE, así que los parámetros de arranque se pueden especificar en el menú «Boot options». Véase README.bootparams para obtener una lista de los parámetros de arranque.\n- Un ejemplo de parámetro de arranque que se suele especificar, es el tamaño de letra. Para una mejor legibilidad en pantallas de alta resolución (si no son detectadas correctamente), puede usar fbcon=font:TER16x32. Vea HiDPI#Linux console (tty) para una explicación más detallada.\n\nPara cambiar a una consola diferente —por ejemplo, para ver esta guía con el navegador web Lynx junto a la instalación, utilice el atajo del teclado Alt+flecha . Para editar los archivos de configuración, dispone de mcedit(1), nano y vim. Véase pkglist.x86_64.txt para obtener una lista de los paquetes incluidos en el medio de instalación.\n\n"
    },
    {
      "title": "Definir la distribución de teclado y fuente en consola",
      "level": 3,
      "content": "Por defecto, la distribución de teclado de la consola es la de EE.UU.. Las distribuciones de teclado disponibles se pueden enumerar con:\n\n```\n# localectl list-keymaps\n```\n\nPara configurar la distribución de teclado utilice la orden loadkeys(1), tomando de parámetro, el nombre de la distribución.Por ejemplo, para establecer una distribución de teclado en español, ejecute:\n\n```\n# loadkeys es\n```\n\nPara establecer una distribución de teclado en español latinoamericano, ejecute:\n\n```\n# loadkeys la-latin1\n```\n\nLos tipos de letras para consola se encuentran en /usr/share/kbd/consolefonts/ y se pueden configurar igualmente con setfont(8), omitiendo la ruta y extensión del archivo. Por ejemplo, para usar una de las fuentes con mayor resolución (para la pantalla adecuada), ejecute:\n\n```\n# setfont ter-132b\n```\n\n"
    },
    {
      "title": "Verificar la modalidad de arranque",
      "level": 3,
      "content": "Para comprobar el modo de arranque, vea la arquitectura UEFI:\n\n```\n# cat /sys/firmware/efi/fw_platform_size\n```\n\nSi la orden muestra 64, el sistema se iniciará en modo UEFI x64, con arquitectura de 64 bits. Si la orden muestra 32, el sistema también se iniciará en modo UEFI, pero este será del tipo IA32 y con arquitectura de 32 bits; y, aunque esté soportada, limita sus opciones de gestor de arranque a systemd-boot o GRUB. Si no existe el directorio, el sistema se iniciará en modo BIOS (o en modalidad CSM —Compatibility Support Module—). Si el sistema no se inició en la modalidad deseada (sea UEFI o BIOS), remítase al manual de su placa base para obtener detalles.\n\n"
    },
    {
      "title": "Conectarse a Internet",
      "level": 3,
      "content": "Para configurar una conexión de red en el entorno live, siga los siguientes pasos:\n\n- Asegúrese de que su interfaz de red está en la lista y activada, por ejemplo con la orden ip-link(8): # ip link\n\n```\n# ip link\n```\n\n- Para la conexión inalámbrica y WAN, asegúrese de que la tarjeta no esté bloqueada con rfkill.\n\n- Conéctese a la red: Ethernet: enchufe el cable. Wi-Fi: autentifíquese en la red inalámbrica utilizando iwctl. Módem de banda ancha móvil: conéctese a la red móvil con la utilidad mmcli.\n- Configure su conexión de red: DHCP: La asignación dinámica de la dirección IP y del servidor DNS (proporcionada por systemd-networkd y systemd-resolved) debería funcionar de forma inmediata para interfaces de red Ethernet, WLAN, y WWAN. Dirección IP estática: siga Network configuration (Español)#Dirección IP estática.\n- La conexión se puede verificar con la utilidad ping: # ping archlinux.org\n\n- Ethernet: enchufe el cable.\n- Wi-Fi: autentifíquese en la red inalámbrica utilizando iwctl.\n- Módem de banda ancha móvil: conéctese a la red móvil con la utilidad mmcli.\n\n- DHCP: La asignación dinámica de la dirección IP y del servidor DNS (proporcionada por systemd-networkd y systemd-resolved) debería funcionar de forma inmediata para interfaces de red Ethernet, WLAN, y WWAN.\n- Dirección IP estática: siga Network configuration (Español)#Dirección IP estática.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Actualizar el reloj del sistema",
      "level": 3,
      "content": "En el entorno en vivo, systemd-timesyncd está activado de forma predeterminada y la hora se sincronizará automáticamente una vez que se establezca una conexión a Internet.\n\nUtilice timedatectl(1) para asegurarse de que el reloj del sistema esté sincronizado:\n\n```\n# timedatectl\n```\n\n"
    },
    {
      "title": "Particionar el disco",
      "level": 3,
      "content": "Cuando el sistema lo reconoce, los discos se asignan a un dispositivo de bloque como /dev/sda, /dev/nvme0n1 o /dev/mmcblk0. Para identificar estos dispositivos, utilice lsblk o fdisk:\n\n```\n# fdisk -l\n```\n\nLos resultados que terminan en rom, loop o airootfs pueden ignorarse; como también boot0, boot1, y los dispositivos mmcblk* que terminan en rpbm.\n\nLas siguientes particiones son necesarias para el dispositivo elegido:\n\n- Una partición para el directorio raíz /.\n- Para arrancar en modo UEFI: una partición del sistema EFI.\n\nUtilice alguna herramienta de particionado como fdisk para modificar la tabla de particiones. Por ejemplo:\n\n```\n# fdisk /dev/la_unidad_a_particionar\n```\n\n- Si la unidad no aparece, asegúrese de que el controlador de la unidad no esté en modo RAID.\n- Tómese el tiempo de elegir un esquema de particionado pensando a largo plazo, y así evitar conversiones o reparticiones posteriores.\n- Si desea crear dispositivos de bloques apilados —stacked block devices— para LVM, cifrado de disco o RAID, hágalo ahora.\n- Si la unidad desde el que desea arrancar ya tiene una partición del sistema EFI, no cree otra, utilice la partición existente en su lugar.\n- El espacio de intercambio se puede configurar en un archivo como espacio de intercambio para los sistemas de archivos que lo admitan.\n\n"
    },
    {
      "title": "Esquemas de ejemplo",
      "level": 4,
      "content": "Table content:\nPunto de montaje en el sistema instalado | Partición | Tipo de partición | Tamaño sugerido\n/boot1 | /dev/partición_sistema_efi | EFI system partition | 1 GiB\n[SWAP] | /dev/partición_swap | Linux swap | 4 GiB como mínimo\n/ | /dev/partición_raiz | Linux x86-64 root (/) | Resto del dispositivo. A lo menos 23-32 GiB.\n\n1. Otros puntos de montaje como /efi, son posibles, siempre que el cargador de arranque utilizado sea capaz de cargar las imágenes del kernel e initramfs desde el volumen raíz. Véase la advertencia en Arch boot process (Español)#Gestor de arranque.\n\nTable content:\nPunto de montaje en el sistema instalado | Partición | Tpo de partición | Tamaño sugerido\n[SWAP] | /dev/swap_partition | Linux swap | 4 GiB como mínimo\n/mnt | /dev/root_partition | Linux | Resto del dispositivo. A lo menos 23-32 GiB.\n\nVéase también Esquemas de particionado.\n\n"
    },
    {
      "title": "Formatear las particiones",
      "level": 3,
      "content": "Una vez que se han creado las particiones, cada partición recién creada se debe formatear con un sistema de archivos apropiado. Véase File systems (Español)#Crear un sistema de archivos para más información.\n\nPor ejemplo, para crear un sistema de archivos Ext4 en /dev/partición_raiz, ejecute:\n\n```\n# mkfs.ext4 /dev/partición_raiz\n```\n\nSi creó una partición para el espacio de intercambio, dele formato con mkswap(8):\n\n```\n# mkswap /dev/partición_swap\n```\n\nSi creó una partición del sistema EFI, dele formato a FAT32 utilizando mkfs.fat(8).\n\n```\n# mkfs.fat -F 32 /dev/partición_sistema_efi\n```\n\n"
    },
    {
      "title": "Montar los sistemas de archivos",
      "level": 3,
      "content": "Monte el volumen raíz en /mnt. Por ejemplo, si el volumen raíz es /dev/partición_raiz:\n\n```\n# mount /dev/partición_raiz /mnt\n```\n\nCree los puntos de montaje restantes en /mnt (como /mnt/boot para /boot) y monte sus volúmenes con la jerarquía correspondiente.\n\nPara sistemas UEFI, monte la partición del sistema EFI:\n\n```\n# mount --mkdir /dev/partición_sistema_efi /mnt/boot\n```\n\nSi creó un volumen de intercambio, actívelo con swapon(8):\n\n```\n# swapon /dev/partición_swap\n```\n\ngenfstab(8) detectará posteriormente los sistemas de archivos montados y el espacio de intercambio.\n\n"
    },
    {
      "title": "Seleccionar los servidores de réplica",
      "level": 3,
      "content": "Los paquetes que se instalarán se deben descargar desde los servidores de réplicas, que se definen en /etc/pacman.d/mirrorlist. En el entorno live de instalación, después de conectarse a Internet, reflector actualizará la lista de servidores eligiendo los 20 espejos HTTPS sincronizados más recientemente.\n\nCuanto más alto se coloca un servidor de réplica en la lista, más prioridad tendrá al descargar un paquete. Es posible que desee inspeccionar el archivo para ver si es satisfactorio. Si no es así, modifique el archivo en consecuencia y mueva los servidores de réplicas geográficamente más cercanos a la parte superior de la lista, aunque se deben tener en consideración otros criterios.\n\nUna copia del archivo «mirrorlist» se realizará más tarde en el nuevo sistema por pacstrap, por lo tanto vale la pena hacerlo bien en esta fase.\n\n"
    },
    {
      "title": "Instalar paquetes esenciales",
      "level": 3,
      "content": "Utilice el script pacstrap(8) para instalar el paquete base, un Kernel de Linux y un firmware para hardware común::\n\n```\n# pacstrap -K /mnt base linux linux-firmware\n```\n\n- Puede sustituir linux por un paquete de kernel de su elección, o puede omitirlo completamente al instalarlo en un contenedor.\n- Puede omitir la instalación del paquete de firmware al instalarlo en una máquina virtual o contenedor.\n\nEl paquete base no incluye todas las herramientas presentes en el medio de instalación live, por lo que puede ser necesario instalar paquetes adicionales para que un sistema base sea completamente funcional. Para instalar otros paquetes o grupos de paquetes, agregue sus nombres como parámetros durante la ejecución del comando pacstrap anterior u ocupe pacman para instalarlos cuando ejecute el cambio de raíz en el sistema nuevo. En particular, considere instalar:\n\n- Actualizaciones para el microcódigo de la CPU —amd-ucode o intel-ucode— para corregir errores de hardware o como actualizaciones de seguridad;\n\n- utilidades del espacio de usuario para la gestión del sistema de archivos que se utilizarán en el sistema con el propósito de crear sistemas de archivos y hacer fsck;\n\n- utilidades para acceder y gestionar RAID o LVM si es que van a ser utilizados en el sistema;\n\n- firmware específico para otros dispositivos no incluidos en linux-firmware (por ejemplo, sof-firmware para el audio integrado, linux-firmware-marvell para los controladores de red inalámbrica Marvell o cualquier otro paquete de firmware para los controladores inalámbricos Broadcom);\n\n- software necesario para la conexión a redes (por ejemplo, un administrador de red o cliente DHCP, autenticador para redes Wi-Fi y/o ModemManager para conectarse a modems de banda ancha móvil);\n\n- un editor de texto (por ejemplo, nano) para editar los archivos de configuración desde la consola;\n\n- paquetes para acceder a la documentación en las páginas man e info: man-db, man-pages y texinfo.\n\nA modo de comparación, los paquetes disponibles en el sistema live se pueden encontrar en pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Genere un archivo fstab (Español) (utilice -U o -L para especificar en dicho archivo las UUID o las etiquetas, respectivamente):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nCompruebe el archivo resultante en /mnt/etc/fstab, y modifíquelo en caso de errores.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Cambie la raíz al nuevo sistema:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Zona horaria",
      "level": 3,
      "content": "Defina su zona horaria:\n\n```\n# ln -sf /usr/share/zoneinfo/Región/Ciudad /etc/localtime\n```\n\nEjecute hwclock(8) para generar el archivo /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nEsta orden presume que el reloj del hardware esta configurado en UTC. Vea la sección sobre la hora estándar para obtener más detalles.\n\nPara evitar que el reloj se desincronice y asegurar que la hora sea precisa, configure la sincronización horaria usando un cliente NTP (Network Time Protocol) como systemd-timesyncd\n\nTo prevent clock drift and ensure accurate time, set up time synchronization using a Network Time Protocol (NTP) client such as systemd-timesyncd.\n\n"
    },
    {
      "title": "Idioma del sistema",
      "level": 3,
      "content": "Edite /etc/locale.gen y descomente el locale (Español) necesario (por ejemplo, para España sería es_ES.UTF-8 UTF-8), además de en_US.UTF-8 UTF-8. Genere los locales ejecutando la orden:\n\n```\n# locale-gen\n```\n\nCree el archivo locale.conf(5), y defina la variable LANG en consecuencia (siguiendo con el ejemplo de España):\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=es_ES.UTF-8\n```\n\nSi fuese necesario, defina la distribución de teclado y fuente en vconsole.conf(5) para que permanezca en cada reinicio:\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=es\n```\n\n"
    },
    {
      "title": "Configurar la red",
      "level": 3,
      "content": "Cree el archivo hostname:\n\n```\n/etc/hostname\n```\n\n```\nelnombredesuequipo\n```\n\nComplete la conexión de red de nuevo para el entorno recién instalado. Eso puede incluir la instalación del software de gestión de redes preferido, su configuración y la activación de su unidad de systemd correspondiente para que inicie al arrancar.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Normalmente no es necesario crear una imagen initramfs nueva, dado que mkinitcpio (Español) se ejecuta durante la instalación del paquete kernel con pacstrap.\n\nPara LVM, cifrado del sistema o RAID, modifique mkinitcpio.conf(5) y regenere la imagen initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Contraseña de root",
      "level": 3,
      "content": "Establezca la contraseña de root:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Instalar gestor de arranque",
      "level": 3,
      "content": "Elija e instale un gestor de arranque compatible con Linux. Si tiene una CPU Intel o AMD, active las actualizaciones de microcódigo.\n\n"
    },
    {
      "title": "Reiniciar",
      "level": 2,
      "content": "Salga del entorno chroot escribiendo exit o presionando Ctrl+d.\n\nOpcionalmente, puede desmontar manualmente todas las particiones con umount -R /mnt: esto permite advertir cualquier partición «ocupada», y buscar su causa con fuser(1).\n\nPor último, reinicie el equipo escribiendo reboot: cualquier partición que todavía esté montada será desmontada automáticamente por systemd. Recuerde retirar los medios de instalación y luego inicie sesión en el nuevo sistema con la cuenta de root.\n\n"
    },
    {
      "title": "Posinstalación",
      "level": 2,
      "content": "Vea el artículo General recommendations (Español) para obtener instrucciones sobre cómo gestionar el sistema, así como tutoriales sobre qué hacer después de la instalación (tales como crear cuentas de usuario sin privilegios, configurar una interfaz gráfica de usuario, el sonido o un panel táctil).\n\nPara obtener una lista de aplicaciones que pueden ser de su interés, véase List of applications (Español).\n\n"
    }
  ]
}