{
  "title": "GVFS (Русский)",
  "url": "https://wiki.archlinux.org/title/GVFS_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- PCManFM (Русский)\n- SpaceFM (Русский)\n- Thunar (Русский)\n- Оконный менеджер\n- Среда рабочего стола\n- udisks (Русский)\n\nВ этой статье описываются дополнительные программные пакеты, необходимые для расширения возможностей и функций файловых менеджеров, в частности, где используются оконные менеджеры такие как Openbox. Если необходимо, также предусмотрена возможность доступа к разделам и съемным носителям информации (например флешкам) без пароля.\n\n"
    },
    {
      "title": "Обзор",
      "level": 2,
      "content": "Файловый менеджер сам по себе не будет предоставлять возможности, к которым привыкли пользователи сред рабочего стола, таких как Xfce или KDE. Это потому, что дополнительные пакеты программного обеспечения надо будет включить в данный файловый менеджер для:\n\n- Отображения и доступа к другим разделам\n- Отображения, монтирования, и доступа к съёмным носителям (таким, как USB-флешки, оптические диски, и цифровые камеры)\n- Включения обмена информацией с помощью сети/общих сетей, с другими установленными операционными системами\n- Включения миниатюр для файлов\n- Создания и распаковки файлов из архива\n- Автоматического монтирования сменных носителей\n\nЕсли файловый менеджер устанавливается как часть полного окружения рабочего стола, эти пакеты, как правило, устанавливаются автоматически. Следовательно, если файловый менеджер был установлен для автономного оконного менеджера, то, как и в случае с самим оконным менеджером, будут предоставляться только базовые функции. Дальше пользователь сам определяет характер и степень функциональных возможностей, которые нужно добавить.\n\n"
    },
    {
      "title": "Дополнительные возможности",
      "level": 2,
      "content": "Если вы планируете использовать легковесную среду, имейте в виду, что чем больше возможностей и функций у файлового менеджера, тем больше он использует памяти. Смотрите также udisks.\n\n"
    },
    {
      "title": "Монтирование",
      "level": 3,
      "content": "- Виртуальная Файловая Система Gnome (gvfs) предоставляет функции монтирования и корзины. GVFS использует udisks2 для монтирования, он является рекомендуемым решением для большинства файловых менеджеров.\n\nКаталоги, которые использует GVFS:\n\n- /usr/lib/gvfs/ содержит файлы gvfsd-*, где * относится к различным поддерживаемым типам файловых систем.\n- /usr/share/gvfs/mounts/ содержит правила монтирования для GVFS. Для использования собственных правил, создайте ~/.gvfs/mounts.\n\nДополнительные пакеты для установки обычно имеют имя в формате gvfs-*, например:\n\n- gvfs-mtp: медиа-плееры и мобильные устройства, которые используют MTP\n- gvfs-gphoto2: цифровые фотоаппараты и мобильные устройства, которые используют PTP\n- gvfs-afc: мобильные устройства Apple\n\n"
    },
    {
      "title": "Демон файлового менеджера",
      "level": 4,
      "content": "Во-первых, просто добавьте в автозагрузку файловый менеджер или запустите его в режиме демона (то есть в качестве фонового процесса). Например, при использовании PCManFM в Openbox, следующая команда может быть добавлена в файл ~/.config/openbox/autostart:\n\n```\npcmanfm -d &\n```\n\nТакже нужно настроить сам файловый менеджер в отношении управления томами (например, то, что он будет делать и какие приложения будут запущены, когда некоторые типы файлов будут обнаружены при монтировании).\n\n"
    },
    {
      "title": "Автономный режим",
      "level": 4,
      "content": "Другой вариант заключается в установке отдельного приложения для монтирования разделов. Преимущество такого варианта:\n\n- Может потребоваться меньше памяти для запуска в качестве фонового процесса/демона по сравнению с файловым менеджером\n- Не специфично для файлового менеджера, что позволяет его свободно добавлять, удалять и менять\n- gvfs можно не устанавливать, что уменьшит использование памяти.\n\n"
    },
    {
      "title": "Сети",
      "level": 3,
      "content": "- obexftpAUR: Монтирование устройств Bluetooth и передача файлов (смотрите Bluetooth)\n- gvfs-smb: Совместное использование принтеров и файлов Windows для Не-KDE рабочих сред (смотрите Samba)\n- kdenetwork-filesharing: Совместное использование принтеров и файлов Windows для KDE (смотрите Samba#KDE)\n- sshfs: FUSE-клиент на основе протокола передачи файлов SSH\n\n"
    },
    {
      "title": "Доступ к Windows",
      "level": 4,
      "content": "При использовании gvfs-smb, чтобы получить доступ к общим файлам Windows/CIFS/Samba сначала откройте файловый менеджер, и введите следующую команду в адресной строке, изменив имя_сервера и имя_общего_ресурса соответственно:\n\n```\nsmb://имя_сервера/имя_общего_ресурса\n```\n\n"
    },
    {
      "title": "Доступ к Apple",
      "level": 4,
      "content": "Поддержка AFP включена в gvfs, для доступа к файлам AFP начала откройте файловый менеджер, и введите следующую команду в адресной строке, изменив имя_сервера и имя_общего_ресурса соответственно:\n\n```\nafp://имя_сервера/имя_общего_ресурса\n```\n\n"
    },
    {
      "title": "Превью изображений",
      "level": 3,
      "content": "Некоторые файловые менеджеры не поддерживают миниатюры даже при установке указанных пакетов. Сверьтесь с документацией интересующего вас файлового менеджера.\n\n"
    },
    {
      "title": "Другие файловые менеджеры, кроме Dolphin и Konqueror",
      "level": 4,
      "content": "Эти пакеты применяются для большинства файловых менеджеров, таких как PCManFM, SpaceFM, Thunar и xfeAUR. Исключение составляют Dolphin и Konqueror, использующиеся в среде рабочего стола KDE.\n\n- tumbler: Графические файлы. Необходимо поставить чтобы расширить возможности для отображения миниатюр файлов других типов\n- poppler-glib: Adobe файлы .pdf\n- ffmpegthumbnailer: Видео файлы\n- freetype2: Файлы шрифтов\n- libgsf: Файлы .odf\n- raw-thumbnailerAUR: .raw файлы\n- totem: Видео файлы и тэги аудио файлов (только GNOME Files, Nemo и Caja)\n- evince или atril: .pdf файлы\n- gnome-epub-thumbnailer: .epub b .mobi файлы\n- mcomixAUR: .cbr comicbook архивы\n- folderpreviewAUR: предпросмотр папок\n- f3d: 3D-файлы, в том числе glTF, stl, step, ply, obj, fbx.\n\n"
    },
    {
      "title": "Dolphin и Konqueror (KDE)",
      "level": 4,
      "content": "Смотрите Dolphin#File previews.\n\n"
    },
    {
      "title": "Использование PCManFM для получения превью для других типов файлов",
      "level": 4,
      "content": "PCManFM поддерживает превью из коробки. Однако для поддержки миниатюр для других типов файлов PCManFM использует информацию из файлов, расположенных в /usr/share/thumbnailers. Пакеты, предоставляющие генератор превью, обычно добавляют соответствующий файл .thumbnailer в /usr/share/thumbnailers. Например, чтобы получить превью для файлов OpenDocument, вы можете установить пакет libgsf из официальных репозиториев. Для преью видеофайлов нужен пакет ffmpegthumbnailer. Для PDF-файлов можно установить evince, который предоставляет evince-thumbnailer и соответствующий файл в /usr/share/thumbnailers. Однако если вы предпочтёте не устанавливать evince, вы также можете воссоздать функциональность evince-thumbnailer с помощью команды convert из пакета imagemagick. Это достигается путём создания файла с расширением .thumbnailer (например, imagemagick-pdf.thumbnailer) в каталоге /usr/share/thumbnailers с таким содержимым:\n\n```\n[Thumbnailer Entry]\n  TryExec=convert\n  Exec=convert %i[0] -background \"#FFFFFF\" -flatten -thumbnail %s %o\n  MimeType=application/pdf;application/x-pdf;image/pdf;\n```\n\nПо этому примеру вы можете указать собственные генераторы превью, создавая свои файлы .thumbnailer. Имейте в виду, что %i относится к входному файлу (файлу, для которого будет создана его миниатюра), %o к выходному файлу (миниатюре изображения) и %s к размеру превью. В этих параметрах будут автоматически подставлены нужные значения и переданы генератору из PCManFM.\n\n"
    },
    {
      "title": "Запакованные файлы",
      "level": 3,
      "content": "Чтобы извлечь сжатые файлы, такие как \"тарболы\" (.tar и .tar.gz) с помощью файлового менеджера, сначала надо установить архиватор с графическим интерфейсом, например file-roller. Для получения дополнительной информации смотрите List of applications/Utilities#Archiving and compression tools. Дополнительный пакет, например unzip также должен быть установлен, для поддержки распаковки файлов .zip. После установки программы-архиватора, можно в контекстном меню (вызываемым правой кнопкой мыши) выбрать упаковывать/распаковывать файлы.\n\nАрхивные файлы смонтированы в папке /run/user/$(id -u)/gvfs/, автоматически создается точка монтирования, которая содержит полный путь к файлу в его названии, где все / заменены на %252F и : заменены на %253A шестнадцатеричные коды.\n\nПример пути к смонтированному архиву /full/path/to/file/name.zip\n\n```\n/run/user/$(id -u)/gvfs/archive:host=file%253A%252F%252F%252Ffull%252Fpath%252Fto%252Ffile%252Fname.zip\n```\n\n"
    },
    {
      "title": "Поддержка чтения/записи NTFS",
      "level": 3,
      "content": "Смотрите статью NTFS-3G (Русский).\n\n"
    },
    {
      "title": "Настольные уведомления",
      "level": 3,
      "content": "Некоторые файловые менеджеры используют настольные уведомления для подтверждения различных событий и состояний, например: монтирование, размонтирование и отсоединение съемных носителей.\n\n"
    },
    {
      "title": "Включение функции корзины на разных файловых системах (внешние диски)",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nСоздайте каталог Корзины .Trash-<uid> для всех пользователей на верхнем уровне файловой системы:\n\nНапример (точка монтирования: /media/sdc1, uid: 1000, gid: 1000):\n\n```\n# mkdir /media/sdc1/.Trash-1000\n```\n\nи смените владельца с помощью chown:\n\n```\n# chown 1000:1000 /media/sdc1/.Trash-1000\n```\n\n"
    },
    {
      "title": "При попытке монтирования дисков выдаётся \"Not Authorized\" (нет авторизации)",
      "level": 3,
      "content": "Файловые менеджеры, использующие udisks, требуют агент аутентификации polkit. Смотрите polkit#Authentication agents.\n\n"
    },
    {
      "title": "Для доступа к разделам требуется пароль",
      "level": 3,
      "content": "Необходимость ввода пароля для доступа к другим разделам или монтирования съемных носителей, вероятно, будет из-за настроек разрешения по умолчанию в udisks2. Более конкретно разрешение может быть установлен только в учетной записи администратора, а не учетной записи пользователя. Для подробностей смотрите Udisks#Настройка.\n\n"
    },
    {
      "title": "Каталоги не открываются в файловом менеджере",
      "level": 3,
      "content": "Вы можете обнаружить, что приложение, которое не является файловым менеджером, например Audacious, устанавливается в качестве приложения по умолчанию для открытия каталогов — приложение указывает MIME тип inode/directory в его desktop записи по умолчанию. Вы можете узнать текущее приложение по умолчанию для открытия каталогов с помощью следующей команды:\n\n```\n$ xdg-mime query default inode/directory\n```\n\nДля того, чтобы убедиться, что каталоги открываются в файловом менеджере, выполните следующую команду:\n\n```\n$ xdg-mime default мой-файловый-менеджер.desktop inode/directory\n```\n\nгде мой-файловый-менеджер.desktop запись desktop является вашим файловым менеджером — например org.gnome.Nautilus.desktop.\n\n```\n/usr/share/applications/mimeapps.list\n```\n\n```\n[Default Applications]\ninode/directory=мой-файловый-менеджер.desktop\n```\n\n"
    },
    {
      "title": "D-Bus",
      "level": 4,
      "content": "Некоторые приложения используют вместо этого D-Bus протокол org.freedesktop.FileManager1 (например Firefox). Следующая команда покажет список установленных служб, поддерживающих этот протокол:\n\n```\n$ grep -R FileManager1 /usr/share/dbus-1/services\n```\n\nЧтобы указать, какой файловый менеджер открывать, скопируйте соответствующий файл оттуда в $XDG_DATA_HOME/dbus-1/services. Дополнительно, чтобы применить изменения, может понадобиться завершить программу, реализующую D-Bus службу в данный момент.\n\n"
    }
  ]
}