{
  "title": "GVFS (Português)",
  "url": "https://wiki.archlinux.org/title/GVFS_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Gerenciadores de arquivos\n- Gerenciador de janela\n- Ambiente de desktop\n- Udisks\n\nEste artigo descreve os pacotes de software adicionais necessários para expandir os recursos e a funcionalidade dos gerenciadores de arquivos, especialmente quando se usa um gerenciador de janela como o Openbox. A capacidade de acessar partições e mídias removíveis sem uma senha - se afetada - também foi fornecida.\n\n"
    },
    {
      "title": "Visão geral",
      "level": 2,
      "content": "Um gerenciador de arquivos sozinho não fornecerá os recursos e funcionalidades aos quais os usuários de ambientes de desktop completos, como o Xfce ou o KDE, estarão acostumados. Isso ocorre porque pacotes de software adicionais serão necessários para permitir que um determinado gerenciador de arquivos:\n\n- Exibe e acesso outras partições\n- Exibe, monte e acesse mídias removíveis (e.x., pendrives, discos óticos e câmeras digitais)\n- Habilite conectividade/redes compartilhadas com outros sistemas operacionais instalados\n- Habilite miniaturização\n- Arquive e extraia arquivos comprimidos\n- Monte automaticamente mídia removível\n\nQuando um gerenciador de arquivos é instalado como parte de um ambiente de desktop completo, a maioria desses pacotes geralmente é instalada automaticamente. Consequentemente, quando um gerenciador de arquivos foi instalado para um gerenciador de janelas autônomo, como é o caso do próprio gerenciador de janelas, apenas uma base básica será fornecida. O usuário deve determinar a natureza e a extensão dos recursos e funcionalidades a serem adicionados.\n\n"
    },
    {
      "title": "Recursos adicionais",
      "level": 2,
      "content": "Particularmente, quando usando - ou pretendendo usar - um ambiente leve, deve-se notar que mais recursos e funções do gerenciador de arquivos geralmente significam o uso de mais memória. Veja também udisks.\n\n"
    },
    {
      "title": "Montando",
      "level": 3,
      "content": "- O sistema de arquivos virtual do GNOME (gvfs) fornece funcionalidade de montagem e lixo. O GVFS usa udisks2 para funcionalidade de montagem e é a solução recomendada para a maioria dos gerenciadores de arquivos.\n\nPastas usadas pelo GVFS:\n\n- /usr/lib/gvfs/ contém gvfsd-* arquivos, sendo que * se refere a vários tipos de sistema de arquivos suportados.\n- /usr/share/gvfs/mounts/ contém regras de montagem para GVFS. Para usar suas próprias regras, crie ~/.gvfs/mounts.\n\nPacotes adicionais para instalação geralmente seguem o padrão gvfs-*, por exemplo:\n\n- gvfs-mtp: reprodutores de mídia e dispositivos móveis que usam MTP\n- gvfs-gphoto2: câmeras digitais e dispositivos móveis que usam PTP\n- gvfs-afc: dispositivos móveis da Apple\n\n"
    },
    {
      "title": "Daemon de gerenciador de arquivos",
      "level": 4,
      "content": "A primeira é simplesmente iniciar automaticamente ou executar o gerenciador de arquivos instalado no modo daemon (ou seja, como um processo em segundo plano). Por exemplo, quando usando PCManFM em Openbox, o seguinte comando será adicionado ao arquivo ~/.config/openbox/autostart:\n\n```\npcmanfm -d &\n```\n\nTambém será necessário configurar o gerenciador de arquivos em relação ao gerenciamento de volume (por exemplo, o que ele fará e quais aplicativos serão lançados quando determinados tipos de arquivo forem detectados na montagem).\n\n"
    },
    {
      "title": "Autônomo",
      "level": 4,
      "content": "Outra opção é instalar um aplicativo de montagem separado. As vantagens de usar isso são:\n\n- Menos memória pode ser necessária para ser executada como um processo de segundo plano daemon do que um gerenciador de arquivos\n- Não é específico do gerenciador de arquivos, permitindo que sejam livremente adicionados, removidos e alternados\n- gvfs pode não ter que ser instalado para montar, reduzindo o uso de memória.\n\n"
    },
    {
      "title": "Redes",
      "level": 3,
      "content": "- obexftpAUR: Transferências de arquivos e montagem de dispositivos Bluetooth (veja Bluetooth)\n- gvfs-smb: Compartilhamento de arquivos e impressoras Windows para ambientes que não sejam KDE (veja Samba)\n- kdenetwork-filesharing: Compartilhamento de arquivos e impressoras Windows para KDE (veja Samba#KDE)\n- sshfs: Cliente FUSE baseado no protocolo de transferência de arquivos SSH\n\n"
    },
    {
      "title": "Acesso a Windows",
      "level": 4,
      "content": "Se estiver usando gvfs-smb, para acessar os compartilhamentos de arquivos do Windows/CIFS/Samba abra primeiro o gerenciador de arquivos e digite o seguinte no nome do caminho, alterando nome_do_servidor e nome_do_compartilhamento conforme apropriado:\n\n```\nsmb://nome_do_servidor/nome_do_compartilhamento\n```\n\n"
    },
    {
      "title": "Acesso a Apple",
      "level": 4,
      "content": "Suporte a AFP está incluso no gvfs. Para acessar os compartilhamentos de arquivos de AFP abra primeiro o gerenciador de arquivos e digite o seguinte no nome do caminho, alterando nome_do_servidor e nome_do_compartilhamento conforme apropriado:\n\n```\nafp://nome_do_servidor/nome_do_compartilhamento\n```\n\n"
    },
    {
      "title": "Visualização de miniaturas",
      "level": 3,
      "content": "Alguns gerenciadores de arquivos podem não suportar miniaturas, mesmo quando os pacotes listados foram instalados. Verifique a documentação do gerenciador de arquivos relevante.\n\nVocê não pode ver miniaturas para armazenamento remoto, incluindo MTP. Verifique as configurações do seu gerenciador de arquivos, por exemplo para Thunar é preciso definir \"Mostrar miniaturas: sempre\".\n\n"
    },
    {
      "title": "Gerenciadores de arquivo além do Dolphin e Konqueror",
      "level": 4,
      "content": "Esses pacotes se aplicam à maioria dos gerenciadores de arquivos, como PCManFM, SpaceFM, Thunar e xfeAUR. As exceções são Dolphin e Konqueror, usados no ambiente de desktop KDE.\n\n- tumbler: Arquivos de imagem. Ele também deve deve ser instalado para expandir as capacidades de miniaturas para outros tipos de arquivos\n- poppler-glib: Arquivos .pdf do Adobe\n- ffmpegthumbnailer: Arquivos de vídeo\n- freetype2: Arquivos de fonte\n- libgsf: Arquivos .odf\n- raw-thumbnailerAUR: Arquivos .raw\n- totem: Arquivos de vídeo e arquivos de áudio rotulados (Arquivos do GNOME e Caja apenas)\n- evince ou atril: Arquivos .pdf\n- comicx[link quebrado: package not found]: arquivos de quadrinhos .cbr\n\n"
    },
    {
      "title": "Dolphin e Konqueror (KDE)",
      "level": 4,
      "content": "Veja Dolphin#File previews.\n\n"
    },
    {
      "title": "Arquivos de pacotes",
      "level": 3,
      "content": "Para extrair arquivos compactados, como tarballs (.tar e .tar.gz) dentro de um gerenciador de arquivos, primeiro será necessário instalar um arquivador GUI, como o file-roller. Veja List of applications/Utilities#Archiving and compression tools para mais informações. Um pacote adicional como unzip também deve ser instalado para suportar o uso de arquivos zipados (.zip). Depois que um arquivador é instalado, os arquivos no gerenciador de arquivos podem, consequentemente, ser clicados com o botão direito do mouse para serem arquivados ou extraídos.\n\nOs empacotadores de arquivos são montados na pasta /run/user/$(id -u)/gvfs/ com ponto de montagem criado automaticamente que contém caminho completo para o arquivo em seu nome, onde todos / são substituídos por %252F e : substituído por %253A, que são códigos hexa.\n\nExample de caminho para o pacote montado /caminho/para/nome/de/arquivo.zip\n\n```\n/run/user/$(id -u)/gvfs/archive:host=file%253A%252F%252F%252Fcaminho%252Fpara%252Fnome%252Fde%252Farquivo.zip\n```\n\n"
    },
    {
      "title": "Suporte a leitura/escrita de NTFS",
      "level": 3,
      "content": "Veja o artigo NTFS-3G.\n\n"
    },
    {
      "title": "Notificações de desktop",
      "level": 3,
      "content": "Alguns gerenciadores de arquivos fazem uso de notificações de desktop para confirmar vários eventos e status, como montagem, desmontagem e ejeção de mídia removível.\n\n"
    },
    {
      "title": "Habilitar funcionalidade de lixeira em sistemas diferentes (unidades externas)",
      "level": 3,
      "content": "Crie diretórios de lixeira .Trash-<uid> para cada usuário no nível de topo de sistemas de arquivoa:\n\nPor exemplo (ponto de montagem: /media/sdc1, uid: 1000, gid: 1000):\n\n```\n# mkdir /media/sdc1/.Trash-1000\n```\n\ne execute chown neles:\n\n```\n# chown 1000:1000 /media/sdc1/.Trash-1000\n```\n\n"
    },
    {
      "title": "\"Not Authorized\" ao tentar montar as unidades",
      "level": 3,
      "content": "Gerenciadores de arquivos usando udisks precisam de um agente de autenticação polkit. Veja polkit#Authentication agents.\n\n"
    },
    {
      "title": "Senhas necessária para acessar partições",
      "level": 3,
      "content": "A necessidade de inserir uma senha para acessar outras partições ou mídia removível montada provavelmente será devido às configurações de permissão padrão de udisks2. Mais especificamente, a permissão pode ser definida apenas para a conta raiz, não para a conta do usuário. Veja Udisks#Configuration para detalhes.\n\n"
    },
    {
      "title": "Diretórios não são abertos no gerenciador de arquivos",
      "level": 3,
      "content": "Você pode descobrir que um aplicativo que não é um gerenciador de arquivos, Audacious por exemplo, está definido como o aplicativo padrão para abrir diretórios - um aplicativo que especifica que ele pode manipular o tipo MIME inode/directory em sua entrada de desktop pode se tornar o padrão. Você pode consultar o aplicativo padrão para abrir diretórios com o seguinte comando:\n\n```\n$ xdg-mime query default inode/directory\n```\n\nPara se certificar que diretórios são abertos no gerenciador de arquivos, execute o seguinte comando:\n\n```\n$ xdg-mime default meu_gerenciador_de_arquivos.desktop inode/directory\n```\n\nsendo que meu_gerenciador_de_arquivos.desktop é a entrada de desktop para o seu gerenciador de arquivos — org.gnome.Nautilus.desktop, por exemplo.\n\n```\n/usr/share/applications/mimeapps.list\n```\n\n```\n[Default Applications]\ninode/directory=meu_gerenciador_de_arquivos.desktop\n```\n\n"
    },
    {
      "title": "D-Bus",
      "level": 4,
      "content": "Algumas outras aplicações usam o protocolo D-Bus org.freedesktop.FileManager1 (por exemplo, Firefox). A seguir, é exibida uma lista dos serviços atualmente instalados que suportam este protocolo:\n\n```\n$ grep -R FileManager1 /usr/share/dbus-1/services\n```\n\nPara qual gerenciador de arquivos é aberto, copie o arquivo para $XDG_DATA_HOME/dbus-1/services. Além disso, antes que as alterações se tornem ativas, interrompa o programa atualmente implementando o serviço D-Bus.\n\n"
    }
  ]
}