{
  "title": "Hamachi (Italiano)",
  "url": "https://wiki.archlinux.org/title/Hamachi_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Hamachi è un software VPN proprietario (closed source) commerciale. Con Hamachi si possono associare due o più computer con una connessione ad Internet in una propria rete virtuale per una comunicazione diretta sicura.\n\n"
    },
    {
      "title": "Installazione",
      "level": 2,
      "content": "Installare il pacchetto logmein-hamachiAUR da AUR.\n\n"
    },
    {
      "title": "Configurazione",
      "level": 2,
      "content": "Hamachi è configurato in /var/lib/logmein-hamachi/h2-engine-override.cfg (creare il file nel caso non esistesse). Sfortunatamente, non è facile trovare una lista completa di opzioni di configurazione possibili, quindi sono qui elencate alcune.\n\n"
    },
    {
      "title": "Usare hamachi da linea di comando come normale utente",
      "level": 3,
      "content": "Per usare il comando hamachi da terminale come normale utente, aggiungere la seguente riga al file di configurazione:\n\n```\nIpc.User TuoNomeUtente\n```\n\n"
    },
    {
      "title": "Impostazione automatica del nickname",
      "level": 3,
      "content": "Normalmente, Hamachi usa l'hostname del sistema come nickname che sarà visto dagli altri utenti di Hamachi. Se si desidera impostare automaticamente un nickname personalizzato ad ogni avvio di Hamachi, aggiungere la seguente riga al file di configurazione:\n\n```\nSetup.AutoNick TuoNickname\n```\n\nSi può anche impostare manualmente il nickname usando hamachi da terminale:\n\n```\n# hamachi set-nick TuoNickname\n```\n\nTuttavia, questo deve essere fatto ogni volta che Hamachi (ri-)parte, quindi, se si vuole usare sempre lo stesso nickname, impostare automaticamente il nickname (come spiegato sopra) è la soluzione più semplice.\n\n"
    },
    {
      "title": "Eseguire Hamachi",
      "level": 2,
      "content": "Attivare logmein-hamachi.service\n\nOra si hanno vari comandi a disposizione. Questi elencati non sono in alcun ordine particolare e sono autoesplicativi.\n\n```\n$hamachi set-nick pippo\n$hamachi login\n$hamachi create mia-rete passwordsegreta\n$hamachi go-online mia-rete\n$hamachi list\n$hamachi go-offline mia-rete\n```\n\nPer la lista di tutti i comandi, eseguire:\n\n```\n$hamachi ?\n```\n\n"
    },
    {
      "title": "Systemd",
      "level": 3,
      "content": "Il pacchetto AUR logmein-hamachiAUR include anche un piccolo demone Systemd.\n\nÈ possibile impostare Hamachi per iniziare ad ogni avvio abilitando logmein-hamachi.service.\n\n"
    },
    {
      "title": "GUI",
      "level": 2,
      "content": "Sono disponibili su AUR le seguenti GUI per Hamachi:\n\n- haguichiAUR (Gtk3, Vala)\n- quamachiAUR (Qt4, Python)\n\n"
    },
    {
      "title": "Altre risorse",
      "level": 2,
      "content": "- Project home page\n\n"
    }
  ]
}