{
  "title": "Hamachi (Русский)",
  "url": "https://wiki.archlinux.org/title/Hamachi_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Hamachi — проприетарная, коммерческая VPN программа от LogMeIn, Inc. С hamachi Вы можете организовать два или более компьютера с интернетом в собственную виртуальную сеть для прямой безопасной связи.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет logmein-hamachiAUR.\n\nДля Hamachi доступны следующие графические оболочки:\n\n- haguichiAUR (Gtk3, Vala)\n- quamachiAUR (Qt5, Python)\n\n"
    },
    {
      "title": "Конфигурация",
      "level": 2,
      "content": "Hamachi настраивается в /var/lib/logmein-hamachi/h2-engine-override.cfg (Создайте данный файл, если его не существует). К сожалению, найти полный список возможных вариантов конфигурации нелегко, поэтому здесь приведены некоторые из них, которые вы можете использовать.\n\n"
    },
    {
      "title": "Использование инструмента командной строки hamachi от имени обычного пользователя",
      "level": 3,
      "content": "Чтобы использовать инструмент командной строки hamachi от имени обычного пользователя, добавьте следующую строку в файл конфигурации:\n\n```\n/var/lib/logmein-hamachi/h2-engine-override.cfg\n```\n\n```\nIpc.User username\n```\n\n"
    },
    {
      "title": "Автоматическая настройка пользовательского псевдонима",
      "level": 3,
      "content": "Обычно, hamachi использует ваше системное имя хоста как псевдоним для других hamachi пользователей, которые увидят псевдоним. Если вы хотите автоматически устанавливать пользовательский псевдоним при каждом запуске hamachi, добавьте следующую строку в файл конфигурации:\n\n```\nSetup.AutoNick ВашНик\n```\n\nВы также можете вручную установить пользовательский псевдоним в инструменте командной строки hamachi :\n\n```\n# hamachi set-nick ВашНик\n```\n\nНо это нужно делать каждый раз, когда Hamachi (повторно) запускается, так что если вы хотите всегда использовать один и тот же псевдоним, установить его автоматически (как описано выше), вероятно, будет проще.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Запустите logmein-hamachi.service.\n\nДля получения списка всех возможных команд запустите:\n\n```\n$ hamachi help\n```\n\nДля запуска hamachi после каждой загрузки включите logmein-hamachi.service.\n\n"
    }
  ]
}