{
  "title": "Hamachi (Español)",
  "url": "https://wiki.archlinux.org/title/Hamachi_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-09-01** \n\nHamachi es un software VPN comercial propiedad de LogMeIn, Inc. Con Hamachi puede organizar dos o más equipos con conexión a Internet en su propia red virtual para una comunicación segura directa.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete logmein-hamachiAUR.\n\nLos siguientes frontends de interfaz gráfica de usuario para Hamachi están disponibles en AUR:\n\n- haguichiAUR (Gtk3, Vala)\n- quamachiAUR (Qt5, Python)\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Hamachi está configurado en /var/lib/logmein-hamachi/h2-engine-override.cfg (cree ese archivo si no existe). Desafortunadamente, no es fácil encontrar una lista completa de posibles opciones de configuración, así que he aquí algunas de las puede usar.\n\n"
    },
    {
      "title": "Utilizar la herramienta de línea de órdenes «hamachi» como usuario normal",
      "level": 3,
      "content": "Para utilizar la herramienta de línea de órdenes de hamachi como usuario normal, añada la siguiente línea al archivo de configuración:\n\n```\n/var/lib/logmein-hamachi/h2-engine-override.cfg\n```\n\n```\nIpc.User sunombredeusuario\n```\n\n"
    },
    {
      "title": "Establecer automáticamente un apodo personalizado",
      "level": 3,
      "content": "Normalmente, Hamachi usa el nombre del equipo de su sistema como el apodo que verán otros usuarios de Hamachi. Si desea establecer automáticamente un apodo personalizado cada vez que se inicia Hamachi, añada la siguiente línea al archivo de configuración:\n\n```\nSetup.AutoNick suapododeequipo\n```\n\nTambién puede establecer manualmente un apodo con la herramienta de línea de órdenes de hamachi:\n\n```\n# hamachi set-nick YourNicknameHere\n```\n\nSin embargo, esto debe hacerse cada vez que Hamachi se (re)inicia, por lo que si desea utilizar siempre el mismo apodo, probablemente sea más fácil configurarlo automáticamente (como se explicó anteriormente).\n\n"
    },
    {
      "title": "Ejecutar Hamachi",
      "level": 2,
      "content": "Inicie logmein-hamachi.service.\n\nPara obtener una lista de todos las órdenes, ejecute:\n\n```\n$ hamachi ?\n```\n\nSi lo desea, puede configurar Hamachi para que se inicie en cada arranque con Systemd activando logmein-hamachi.service.\n\n"
    }
  ]
}