{
  "title": "Hardware raytracing (Polski)",
  "url": "https://wiki.archlinux.org/title/Hardware_raytracing_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nTa strona posłuży jako przewodnik po aktualnym stanie sprzętowej obsługi raytracingu w systemie Linux, a także dostarczy informacji o tym, jak wszystko skonfigurować.\n\nWe wszystkich przypadkach zakłada się, że gra będzie uruchamiana przez Proton, wymagane jest VKD3D, DXVK nie będzie działać.\n\n"
    },
    {
      "title": "AMD",
      "level": 2,
      "content": "Procesory graficzne AMD RDNA2 oferują sprzętową obsługę raytracingu poprzez wbudowane jednostki obliczeniowe, a ich wydajność jest obecnie zróżnicowana. Od wersji mesa 23, raytracing jest włączany dla poszczególnych gier, a od wersji mesa 23.2 raytracing będzie domyślnie włączony dla wszystkich aplikacji.\n\n- GPU - AMD RDNA2 lub nowsze\n- Sterownik - mesa 23 lub nowszy, amdvlk lub vulkan-radeon\n\n"
    },
    {
      "title": "Użycie",
      "level": 3,
      "content": "Dla wersji mesa poniżej 23.2, użyj następujących zmiennych środowiskowych:\n\n```\nRADV_PERFTEST='rt'\n```\n\n"
    },
    {
      "title": "Intel",
      "level": 2,
      "content": "Układy GPU Intel ARC oferują sprzętową obsługę raytracingu za pośrednictwem wbudowanych jednostek TSU, a ich obecna wydajność jest zróżnicowana.\n\n- GPU - Seria Intel ARC GD/2 lub nowsza\n- Sterownik - mesa 22.3 lub nowszy, vulkan-intel\n- Kernel - linux-firmware (oprogramowanie sprzętowe jest wymagane do obsługi GuC)\n\n"
    },
    {
      "title": "Użycie",
      "level": 3,
      "content": "Użyj następujących opcji zmiennych środowiskowych:\n\n```\nVKD3D_CONFIG=dxr11,dxr\n```\n\n"
    },
    {
      "title": "NVIDIA",
      "level": 2,
      "content": "Implementacja raytracingu NVIDIA dla systemu Linux jest prawie taka sama jak w systemie Windows, to znaczy, że przy obsługiwanym sprzęcie i odpowiednich sterownikach RTX działa dobrze w systemie Linux.\n\n- GPU - Dowolna karta z oznaczeniem RTX (RTX 2060+, RTX 3050+, RTX 4050+)\n- Sterownik - nvidia 510.60.02 lub nowsze z nvidia-utils i nvidia-settings (z ich wariantami lib32)\n\n"
    },
    {
      "title": "Użycie",
      "level": 3,
      "content": "Użyj następujących opcji zmiennych środowiskowych:\n\n```\nVKD3D_CONFIG=dxr11,dxr\nPROTON_ENABLE_NVAPI=1\nPROTON_ENABLE_NGX_UPDATER=1\n```\n\n"
    },
    {
      "title": "Testing",
      "level": 2,
      "content": "Zainstaluj pakiet raytracinginvulkan-gitAUR, a następnie uruchom go z terminala:\n\n```\n$ cd /opt/raytracinginvulkan/bin/\n$ ./RayTracer\n```\n\n"
    }
  ]
}