{
  "title": "Hardware raytracing (Français)",
  "url": "https://wiki.archlinux.org/title/Hardware_raytracing_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nCette page servira de guide sur l'état actuel de la prise en charge du raytracing matériel sous Linux et fournira des informations sur la façon de tout configurer.\n\nDans tous les cas, il est nécessaire de faire tourner le jeu via Proton, VKD3D est requis, DXVK ne fonctionnera pas.\n\n"
    },
    {
      "title": "AMD",
      "level": 2,
      "content": "Les GPU AMD RDNA2 offrent une prise en charge matérielle du raytracing grâce à des unités de calcul embarquées, les performances actuelles sont mitigées. Depuis mesa 23, le raytracing est activé pour chaque jeu, et à partir de mesa 23.2, le raytracing sera activé par défaut pour toutes les applications.\n\n- GPU - Séries AMD RDNA2 et plus récentes\n- Pilote - mesa 23 ou plus récentes, amdvlk ou vulkan-radeon\n\n"
    },
    {
      "title": "Utilisation",
      "level": 3,
      "content": "Pour les versions de mesa inférieures à 23.2, utilisez une variable d'environnement comme suit :\n\n```\nRADV_PERFTEST='rt'\n```\n\n"
    },
    {
      "title": "Intel",
      "level": 2,
      "content": "Les GPU Intel ARC offrent une prise en charge matérielle du raytracing par le biais d'unités de traitement intégrées, mais les performances actuelles sont mitigées.\n\n- GPU - Intel ARC GD/2 et plus récents.\n- Pilote - mesa 22.3 et plus récent, vulkan-intel\n- Noyau - linux-firmware (firmware necessaire pour la prise en charge GuC)\n\n"
    },
    {
      "title": "Usage",
      "level": 3,
      "content": "Utilisez la variable d'environnement comme suit :\n\n```\nVKD3D_CONFIG=dxr11,dxr\n```\n\n"
    },
    {
      "title": "NVIDIA",
      "level": 2,
      "content": "L'implémentation du raytracing de NVIDIA pour Linux est à peu près identique à celle de Windows, c'est-à-dire qu'avec le matériel pris en charge et les pilotes corrects, RTX fonctionne bien sous Linux.\n\n- GPU - Toute carte portant le nom RTX (RTX 20xx, RTX 30xx, RTX 40xx)\n- Pilote - nvidia 510.60.02 ou plus récent nvidia-utils et nvidia-settings (avec leur variante lib32)\n\n"
    },
    {
      "title": "Utilisation",
      "level": 3,
      "content": "Utilisez les variables d'environnement comme suit :\n\n```\nVKD3D_CONFIG=dxr11,dxr\nPROTON_ENABLE_NVAPI=1\nPROTON_ENABLE_NGX_UPDATER=1\n```\n\n"
    },
    {
      "title": "Tests",
      "level": 2,
      "content": "Installez le paquet raytracinginvulkan-gitAUR puis depuis le terminal :\n\n```\n$ cd /opt/raytracinginvulkan/bin/\n$ ./RayTracer\n```\n\n"
    }
  ]
}