{
  "title": "Hddtemp (Français)",
  "url": "https://wiki.archlinux.org/title/Hddtemp_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- lm sensors\n- Conky (Français)\n\nhddtemp est un petit utilitaire (avec daemon) qui donne la température du disque dur via S.M.A.R.T. (pour les disques prenant en charge cette fonctionnalité).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet hddtemp.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "Hddtemp nécessite des privilèges root. La commande hddtemp doit être suivie d'au moins un emplacement de disque. Vous pouvez lister plusieurs disque séparés par des espaces :\n\n```\n# hddtemp /dev/disk/by-id/wwn-0x60015ee0000b237f /dev/sdX2 ... /dev/sd Xn ...\n```\n\nDes informations supplémentaires sur l'utilisation sont disponibles dans la page de manuel hddtemp(8).\n\n"
    },
    {
      "title": "Daemon",
      "level": 2,
      "content": "Exécuter le daeon permet d'accéder aux informations de température via TCP/IP comme un utilisateur normal. Ceci est utile pour les scripts et les moniteurs système.\n\nLe daemon est contrôlé par hddtemp.service.\n\nPour obtenir la température, connectez-vous au daemon qui écoute sur le port 7634.\n\nAvec inetutils :\n\n```\n$ telnet localhost 7634\n```\n\nAvec gnu-netcat :\n\n```\n$ nc localhost 7634\n```\n\nLes deux sorties sont similaires à :\n\n```\n|/dev/sda|ST3500413AS|32|C||/dev/sdb|ST2000DM001-1CH164|36|C|\n```\n\nPour une statistique de meilleure qualité :\n\n```\n$ nc localhost 7634 |sed 's/|//m' | sed 's/||/ \\n/g' | awk -F'|' '{print $1 \" \" $3 \" \" $4}'\n```\n\n```\n/dev/sda 32 C \n/dev/sdb 36 C\n```\n\n"
    },
    {
      "title": "Remplacer le disque par défaut",
      "level": 3,
      "content": "Le daemon hddtemp par défaut ne surveille que /dev/sda. Si vous avez plusieurs disques, vous devez remplacer la configuration par défaut pour les surveiller.\n\nVous devez savoir quels disques durs prennent en charge la surveillance. Vous pouvez vérifier avec smartmontools. Éditez hddtemp.service.\n\n```\n[Service]\nExecStart=\nExecStart=/usr/bin/hddtemp --daemon --foreground /dev/disk/by-id/wwn-0x60015ee0000b237f /dev/sdb --listen=127.0.0.1\n```\n\nRemplacez les noms de périphériques par ceux que vous souhaitez surveiller.\n\nAprès avoir modifié, enregistrez le fichier et quittez l'éditeur. Systemd appliquera les changements et rechargera le service hddtemp automatiquement.\n\nVous pouvez également utiliser le script d'auto-génération qui détectera les disques durs pris en charge à l'aide de smartmontools et les imprimera sur la sortie standard.\n\n"
    },
    {
      "title": "Moniteurs",
      "level": 2,
      "content": "Hddtemp peut être intégré à un moniteur du système. Conky prends en charge hddtemp en mode daemon. Activez simplement hddtemp.service et ajoutez $hddtemp °C à votre fichier de configuration de conky.\n\n"
    },
    {
      "title": "Solid State Drives",
      "level": 2,
      "content": "Hddtemp lit généralement le champ 194 à partir des données intelligentes du disque. Dans les SSDs, les informations de température sont généralement stockées dans le champ 190. Pour obtenir ces informations, on peut exécuter :\n\n```\n# smartctl --all /dev/sdx\n```\n\nou\n\n```\n# hddtemp --debug /dev/sdx\n```\n\noù /dev/sdx est le lecteur (utilisez lsblk pour le vérifier).\n\nAlternativement, ajoutez une nouvelle entrée dans /etc/hddtemp.db. Par exemple :\n\n```\n# echo '\"Samsung SSD 840 EVO 250GB\" 190 C \"Samsung SSD 840 EVO 250GB\" >> /etc/hddtemp.db\n```\n\n"
    }
  ]
}