{
  "title": "Hdparm (Русский)",
  "url": "https://wiki.archlinux.org/title/Hdparm_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Securely wipe disk#hdparm\n\nhdparm и sdparm — инструменты командной строки для просмотра и изменения аппаратных параметров жёстких дисков. hdparm также можно использовать как простой инструмент для тестирования производительности.\n\nПервоначально hdparm создавался для IDE-дисков, а sdparm — для SCSI-дисков. Начиная примерно с 2010 года, интерфейсы устройств хранения данных представляют собой улучшенную смесь IDE и SCSI, hdparm и sdparm дополняют друг друга.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет hdparm. Для работы со SCSI-устройствами установите пакет sdparm.\n\n"
    },
    {
      "title": "Информация о диске",
      "level": 3,
      "content": "Для получения информации о жёстком диске выполните:\n\n```\n# hdparm -I /dev/sda\n```\n\n"
    },
    {
      "title": "Тестирование производительности",
      "level": 3,
      "content": "Смотрите Benchmarking (Русский)#hdparm.\n\n"
    },
    {
      "title": "Настройка управления питанием",
      "level": 3,
      "content": "Современные жёсткие диски поддерживают множество функций управления питанием. Наиболее распространённые из них приведены в следующей таблице. Полный список доступен в hdparm(8).\n\nTable content:\nПараметр | Описание\n-B | Устанавливает Advanced Power Management. Возможные значения от 1 до 255, низкие значения означают более агрессивное управление питанием, а более высокие — лучшую производительность. Значения от 1 до 127 разрешают остановку вращения, а значения от 128 до 254 — нет. Значение 255 полностью отключает эту функцию.\n-S | Устанавливает таймаут ожидания (spindown) для диска. Задаёт время, которое бездействующий диск подождёт перед выключением двигателя для экономии энергии. Значение 0 отключает таймаут, значения от 1 до 240 задают значения кратные 5 секундам, а значения от 241 до 251 — кратные 30 минутам.\n-M | Устанавливает Automatic Acoustic Management. Большинство современных жёстких дисков имеют возможность замедлить движение головок для снижения уровня шума. Возможное значение зависит от диска, некоторые диски могут не поддерживать эту функцию.\n\n- При передаче обоих параметров -B и -S значения APM менее 128 могут привести к тому, что диск выключится до истечения таймаута -S. See [1].\n- Узнать текущие значения -S и -M нельзя.\n\nЧтобы узнать текущее значение параметра -B, укажите его без значения:\n\n```\n# hdparm -B /dev/sda\n```\n\nДля изменения параметра, например, чтобы изменить APM на 127:\n\n```\n# hdparm -B 127 /dev/sda\n```\n\n"
    },
    {
      "title": "Кэш записи",
      "level": 3,
      "content": "Кэширование записи — это процесс временного кэширования файлов во внутренней памяти диска перед их записью на сам диск, что повышает производительность. Эта функция предоставляется большинством жёстких дисков и в большинстве случаев включена по умолчанию. Чтобы проверить, так ли это, выполните:\n\n```\n$ hdparm -W /dev/sdX\n```\n\nЕсли он отключен, его можно включить такой командой:\n\n```\n$ hdparm -W 1 /dev/sdX\n```\n\nА отключить — такой:\n\n```\n$ hdparm -W 0 /dev/sdX\n```\n\n"
    },
    {
      "title": "Отключение питания жёсткого диска",
      "level": 3,
      "content": "Типичная ситуация, когда это может понадобиться, — при использовании дисков, подключенных к дешёвому внешнему USB/SATA/FireWire корпусу или мосту. Если он не отправляет диску команду остановки должным образом при отключении питания, диск вынужден выполнять аварийную парковку головок. Регулярное выполнение аварийных парковок рано или поздно приведёт к поломке накопителя. Одно из решений заключается в том, чтобы, убедившись, что данные записаны на носитель, отправить диску команду выключения питания:\n\n```\n# hdparm -Y /dev/sdX\n```\n\n1. Данные действительно были записаны на носитель. Рекомендуется также подождать некоторое время, чтобы диск перёшел в режим ожидания.\n1. Устройство, в данном примере /dev/sdX, действительно является именно тем устройством, которое вы хотите отключить.\n\n"
    },
    {
      "title": "Запрос состояния диска без его пробуждения",
      "level": 3,
      "content": "Известно, что запрос состояния в hdparm будит некоторые диски. В этом случае попробуйте использовать команду smartctl из пакета smartmontools для выполнения запроса состояния, который не разбудит спящий диск. Например:\n\n```\n# smartctl -i -n standby /dev/sda\n```\n\n```\nsmartctl 6.5 2016-05-07 r4318 [x86_64-linux-4.10.13-1-ARCH] (local build)\nCopyright (C) 2002-16, Bruce Allen, Christian Franke, www.smartmontools.org\n\nDevice is in STANDBY mode, exit(2)\n```\n\n"
    },
    {
      "title": "Сохранение настроек с помощью правила udev",
      "level": 3,
      "content": "Чтобы настройки сохранялись при перезагрузках, можно использовать правило udev:\n\n```\n/etc/udev/rules.d/69-hdparm.rules\n```\n\n```\nACTION==\"add\", SUBSYSTEM==\"block\", KERNEL==\"sda\", RUN+=\"/usr/bin/hdparm -B 254 -S 0 /dev/sda\"\n```\n\nПоскольку название диска /dev/sdX может меняться случайным образом, идентифицировать диск также можно по его серийному номеру, как описано в разделе udev (Русский)#Определение диска по серийному номеру.\n\nСистемы с несколькими жёсткими дисками могут гибко применять это правило в соответствии с некоторыми критериями. Например, чтобы применить настройки питания ко всем вращающимся дискам (жёсткий диск с вращающейся головкой, исключая, в частности, твердотельные накопители), используйте следующее правило:\n\n```\n/etc/udev/rules.d/69-hdparm.rules\n```\n\n```\nACTION==\"add|change\", KERNEL==\"sd[a-z]\", ATTRS{queue/rotational}==\"1\", RUN+=\"/usr/bin/hdparm -B 127 /dev/%k\"\n```\n\n"
    },
    {
      "title": "Применение настроек после пробуждения из сна",
      "level": 3,
      "content": "Если после возвращения системы из ждущего или спящего режима настройки теряются, их можно применить повторно с помощью system-sleep.\n\nСоздайте скрипт в каталоге /usr/lib/systemd/system-sleep/ и сделайте его исполняемым:\n\n```\n/usr/lib/systemd/system-sleep/hdparm\n```\n\n```\n#!/bin/sh\n\ncase $1 in post)\n        /usr/bin/hdparm -B 254 -S 0 /dev/sda\n        ;;\nesac\n```\n\n"
    },
    {
      "title": "Перевод диска в спящий режим сразу после загрузки",
      "level": 3,
      "content": "Устройство, к которому редко обращаются, можно перевести в спящий режим сразу после загрузки системы. Это не работает с приведённым выше правилом udev, потому что оно срабатывает слишком рано. Чтобы отправить диску команду после завершения загрузки, можно создать службу systemd и включить её:\n\n```\n/etc/systemd/system/hdparm.service\n```\n\n```\n[Unit]\nDescription=hdparm sleep\n\n[Service]\nType=oneshot\nExecStart=/usr/bin/hdparm -q -S 120 -y /dev/sdb\n\n[Install]\nWantedBy=multi-user.target\n```\n\n"
    },
    {
      "title": "Работа с неподдерживаемыми устройствами",
      "level": 3,
      "content": "Некоторые диски не поддерживают остановку вращения через hdparm. Диагностическое сообщение об ошибке, подобное следующему, является хорошим признаком того, что дело обстоит именно так:\n\n```\n# hdparm -S 240 /dev/sda\n```\n\n```\n/dev/sda:\nsetting standby to 240 (20 minutes)\nHDIO_DRIVE_CMD(setidle) failed: Invalid argument\n```\n\nНа некоторых дисках команда hdparm успешно выполняется, но диск не следует заданным параметрам (APM или таймаут spindown). Это наблюдалось с жёстким диском Toshiba P300 (model HDWD120).\n\nНекоторые диски можно остановить с помощью hd-idleAUR, который предоставляет службу systemd. Отредактируйте значение HD_IDLE_OPTS в файле /etc/conf.d/hd-idle, затем запустите и включите службу hd-idle.service.\n\nПример, использующий время бездействия 10 минут для /dev/sda и 1 минуту для /dev/disk/by-uuid/01CF0AC9AA5EAF70:\n\n```\nHD_IDLE_OPTS=\"-i 0 -a /dev/sda -i 600 -a /dev/disk/by-uuid/01CF0AC9AA5EAF70 -i 60\"\n```\n\nПараметр -i 0 в начале означает, что для остальных дисков hd-idle отключен.\n\n"
    },
    {
      "title": "Управление питанием Western Digital Green",
      "level": 3,
      "content": "Жёсткие диски Western Digital Green имеют специальный таймер idle3, который контролирует время бездействия диска перед парковкой головок и переходом в состояние низкого энергопотребления. По умолчанию установлено очень маленькое значение 8 секунд, что может привести к тысячам парковок головок за короткий промежуток времени и в конечном итоге к преждевременному выходу из строя, не говоря уже о влиянии на производительность диска, которому часто приходится просыпаться перед выполнением обычного ввода/вывода. Компания Western Digital выступила с заявлением, в котором утверждается, что Linux не оптимизирован для устройств хранения данных с низким энергопотреблением, и советует уменьшить частоту логирования. Есть несколько способов изменения idle3:\n\n1. Western Digital поставляет DOS-утилиту wdidle3.exe для настройки этого параметра. Она предназначена только для обновления прошивки следующих жёстких дисков: WD1000FYPS, WD7500AYPS, WD7501AYPS, но известно, что она может изменять таймер idle3 и на других моделях Green.\n1. hdparm предоставляет реализацию, созданную с помощью реверс-инжиниринга, с флагом -J, которая не так полна, как оригинальная официальная программа, хотя, похоже, она работает по крайней мере на нескольких дисках. Для использования в Linux рекомендуется значение 30 секунд. Можно указать ноль (0), чтобы полностью отключить таймер WD idle3 (не рекомендуется):# hdparm -J 30 --please-destroy-my-drive /dev/sda Для автоматического применения этого параметра на поддерживаемых дисках смотрите раздел #Сохранение настроек с помощью правила udev.\n1. Ещё одна неофициальная утилита предоставляется пакетом idle3-tools. Сырое значение idle3 передаётся в качестве параметра команде idle3ctl. Соответствие между этим значением и таймаутом в секундах указано в таблице в idle3ctl(8). Следующая команда устанавливает таймер на 30 секунд:# idle3ctl -s 129 /dev/sdc Следующая команда полностью отключает таймер (не рекомендуется):# idle3ctl -d /dev/sdc\n\n```\n# hdparm -J 30 --please-destroy-my-drive /dev/sda\n```\n\n```\n# idle3ctl -s 129 /dev/sdc\n```\n\n```\n# idle3ctl -d /dev/sdc\n```\n\n- Для применения изменения требуется полное отключение питания диска, независимо от используемой программы из списка выше. Это означает, что диск необходимо полностью выключить, а затем включить; простой перезагрузки системы недостаточно.\n- Также известно, что некоторые диски Western Digital Green по-другому интерпретируют параметр таймаута ожидания hdparm -S 1, в результате чего таймер работает 10 минут, а не 5 секунд.\n- Энергопотребление диска Green обычно составляет около 5,3 Вт во время чтения/записи, 4,7 Вт при бездействии и 0,7 Вт в режиме ожидания.\n\n"
    },
    {
      "title": "Значение APM сбрасывается после сна",
      "level": 3,
      "content": "Значение APM может сбрасываться после ждущего режима и требовать повторного изменения параметра после каждого пробуждения. Это можно автоматизировать с помощью следующего юнита systemd (адаптировано из темы на форуме):\n\n```\n/etc/systemd/system/apm.service\n```\n\n```\n[Unit]\nDescription=Local system resume actions\nAfter=suspend.target hybrid-sleep.target hibernate.target\n\n[Service]\nType=simple\nExecStart=/usr/bin/hdparm -B 254 /dev/sda\n\n[Install]\nWantedBy=sleep.target\n```\n\nВ качестве альтернативы можно создать хук в /usr/lib/systemd/system-sleep.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- https://sourceforge.net/projects/hdparm/ - hdparm на SourceForge\n\n"
    }
  ]
}