{
  "title": "HDR monitor support (Français)",
  "url": "https://wiki.archlinux.org/title/HDR_monitor_support_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles apparentés\n\n- Steam (Français)\n- Gaming\n- Gamescope\n\nCette page servira de guide sur l'état actuel de la prise en charge des moniteurs HDR sous Linux. Pour mieux comprendre les défis à relever, vous pouvez regarder la vidéo sur cet article.\n\nLa prise en charge du HDR n'a pas encore été intégrée dans Wayland et n'est donc pas encore implémentée dans la plupart des serveurs d'affichage.\n\nX.org ne prévoit pas la prise en charge HDR [1].\n\nLes progrès actuels sont les suivants :\n\n- KDE Plasma 6.0 a introduit la prise en charge expérimentale du HDR pour la session Wayland. Voir KDE#HDR pour les options de lancement requises pour utiliser HDR.\n- Wayland (et les clients Wayland) : pas de support pour passer les métadonnées HDR à l'écran [2] [3].\n- Les clients DRM peuvent transmettre directement les métadonnées HDR, mais cela n'est pas disponible pour les clients utilisateurs ordinaires, seuls les logiciels spécialisés peuvent l'utiliser.\n- Les développeurs de COSMIC ont promis la prise en charge du HDR dans la version stable initiale.\n- Hyprland supportera probablement le HDR lorsqu'il sera fusionné avec wlroots [4].\n- Wlroots, \"Add HDR signalling\" MR.\n\n"
    },
    {
      "title": "Prérequis",
      "level": 2,
      "content": "- Avoir un écran HDR\n- Pilote graphique compatible HDR : AMDGPU et NVIDIA (550.54.14+) sont confirmés comme fonctionnant.\n- Prise en charge du noyau : Noyaux officiellement pris en charge - linux ou linux-zen. linux-neptune-65AUR - le noyau de SteamOS, prend en charge la numérisation HDR multiplan pour les GPU AMD, ce qui améliore considérablement la latence d'affichage et la stabilité VRR en affichant le contenu HDR sans compositing. Il a été testé pour fonctionner correctement avec les GPU de bureau de la série RX 6000.\n- Un serveur d'affichage pris en charge, voir #Configuration\n- Un jeu, un lecteur vidéo ou un navigateur prenant en charge le HDR Jeux : Liste des jeux prenant en charge le HDR. Lecteurs vidéo : mpv, peut-être plus, aidez à étendre cette liste ! Navigateurs web : Aucun navigateur web ne prend en charge le HDR sous Linux pour le moment.\n- Une couche de compatibilité prise en charge pour les jeux Windows : Wine ou Steam Proton. DXVK (2.1+) ou VKD3D-Proton (2.8+), en fonction de la version DirectX utilisée par le jeu. Astuce: Utilisez Proton 8.0, Experimental, ou Proton GE 44+. Tous sont livrés avec les versions DXVK et VKD3D appropriées.\n\n- Noyaux officiellement pris en charge - linux ou linux-zen.\n- linux-neptune-65AUR - le noyau de SteamOS, prend en charge la numérisation HDR multiplan pour les GPU AMD, ce qui améliore considérablement la latence d'affichage et la stabilité VRR en affichant le contenu HDR sans compositing. Il a été testé pour fonctionner correctement avec les GPU de bureau de la série RX 6000.\n\n- Jeux : Liste des jeux prenant en charge le HDR.\n- Lecteurs vidéo : mpv, peut-être plus, aidez à étendre cette liste !\n- Navigateurs web : Aucun navigateur web ne prend en charge le HDR sous Linux pour le moment.\n\n- DXVK (2.1+) ou VKD3D-Proton (2.8+), en fonction de la version DirectX utilisée par le jeu. Astuce: Utilisez Proton 8.0, Experimental, ou Proton GE 44+. Tous sont livrés avec les versions DXVK et VKD3D appropriées.\n\n"
    },
    {
      "title": "KDE Plasma",
      "level": 3,
      "content": "Consultez la page KDE#HDR (en).\n\n"
    },
    {
      "title": "Gamescope avec session Steam",
      "level": 3,
      "content": "Le compositeur Steam de Valve gamescope offre une prise en charge expérimentale du HDR. En suivant ces étapes, vous pourrez essayer le client Steam de Valve fonctionnant avec le gamescope compatible HDR.\n\n1. Installer gamescope\n1. Installer gamescope-session-steam-gitAUR\n1. Vous pouvez créer le fichier de configuration optionnel ~/.config/environment.d/gamescope-session.conf avec le contenu suivant\n1. Mettez à jour les valeurs de résolution pour qu'elles soient correctes. Vous pouvez lister vos écrans en lançant xrandr --query Vous pouvez avoir besoin de définir le connecteur d'affichage s'il ne choisit pas le bon par défaut.\n\n- Vous pouvez avoir besoin de définir le connecteur d'affichage s'il ne choisit pas le bon par défaut.\n\n```\nif [ \"$XDG_SESSION_DESKTOP\" = \"gamescope\" ] ; then\n    SCREEN_WIDTH=1920\n    SCREEN_HEIGHT=1080\n    CONNECTOR=*,eDP-1\n    CLIENTCMD=\"steam -gamepadui -steamos3 -steampal -steamdeck -pipewire-dmabuf\"\n    GAMESCOPECMD=\"/usr/bin/gamescope --hdr-enabled --hdr-itm-enable \\\n    --hide-cursor-delay 3000 --fade-out-duration 200 --xwayland-count 2 \\\n    -W $SCREEN_WIDTH -H $SCREEN_HEIGHT -O $CONNECTOR\"\nfi\n```\n\nVous pouvez maintenant démarrer gamescope à partir de votre gestionnaire de connexion ou d'un terminal.\n\n"
    },
    {
      "title": "Via un gestionnaire de connexion",
      "level": 4,
      "content": "Déconnectez-vous et sélectionnez le Steam Big Picture dans votre gestionnaire de connexion et connectez-vous.\n\n"
    },
    {
      "title": "Via la ligne de commande",
      "level": 4,
      "content": "1. Passez à un nouvel TTY en appuyant sur Ctrl+Alt+F2\n1. Connectez-vous et exécutez gamescope-session-plus steam pour démarrer la session steam standalone en HDR. Si le réseau ne fonctionne pas, vous pouvez y remédier en installant et en activant NetworkManager.\n\n- Si le réseau ne fonctionne pas, vous pouvez y remédier en installant et en activant NetworkManager.\n\n"
    },
    {
      "title": "Configurer Steam",
      "level": 4,
      "content": "1. Dans les paramètres généraux, sous Affichage, vous devriez maintenant voir les paramètres HDR. Activez HDR et Experimental HDR Support.\n1. Sélectionnez un jeu compatible HDR et cliquez sur la roue dentée à côté.\n1. Réglez la compatibilité sur Forcer l'utilisation de Proton 8.0 ou Proton Experimental.\n1. Réglez la résolution du jeu pour qu'elle corresponde à celle de votre écran, sinon le jeu se lancera à la résolution native de Steam Deck.\n1. Cliquez sur Jouer pour lancer le jeu. Vérifiez les paramètres du jeu pour voir si le paramètre HDR est disponible et activez-le.\n1. Pour revenir à votre session normale, sélectionnez Power et Switch to desktop mode dans le menu Steam.\n\n"
    },
    {
      "title": "Voir également",
      "level": 2,
      "content": "- https://zamundaaa.github.io/wayland/2023/12/18/update-on-hdr-and-colormanagement-in-plasma.html\n- https://github.com/ChimeraOS/gamescope-session/tree/main\n- https://www.reddit.com/r/linux_gaming/comments/10m2gyx/guide_alpha_test_hdr_on_linux/\n- https://forums.developer.nvidia.com/t/plasma-6-0-hdr-success-report/284564\n\n"
    }
  ]
}