{
  "title": "HiDPI (Русский)",
  "url": "https://wiki.archlinux.org/title/HiDPI_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Настройка шрифтов\n\nДисплеи HiDPI (High Dots Per Inch), также известные под маркетинговым названием Apple «Retina Display», — это экраны, имеющие высокое разрешение при относительно небольшом размере. Они в основном встречаются в ноутбуках и мониторах высшего класса.\n\nЕщё не все программы нормально работают в режиме высокого разрешения. Здесь перечислены основные настройки, улучшающие работу на дисплеях высокого разрешения.\n\n"
    },
    {
      "title": "GNOME",
      "level": 3,
      "content": "Для включения HiDPI перейдите в Настройки > Дисплеи > Масштаб и выберите нужное значение. Также можно использовать gsettings:\n\n```\n$ gsettings set org.gnome.settings-daemon.plugins.xsettings overrides \"[{'Gdk/WindowScalingFactor', <2>}]\"\n$ gsettings set org.gnome.desktop.interface scaling-factor 2\n```\n\n"
    },
    {
      "title": "Дробное масштабирование",
      "level": 4,
      "content": "На некоторых экранах (например, планшетах) может быть комфортнее использовать дробное масштабирование (fractional scaling). Это можно реализовать как в Wayland, так и в Xorg, хотя процедуры различаются.\n\nРеализация обсуждалась на GNOME fractional scaling hackfest 2017. [1]\n\nВключите экспериментальную функцию дробного масштабирования:\n\n```\n$ gsettings set org.gnome.mutter experimental-features \"['scale-monitor-framebuffer']\"\n```\n\nЗатем перейдите в Настройки > Дисплеи > Масштаб (новые значения могут появиться только после перезапуска сеанса).\n\nЧтобы включить это для всех пользователей, создайте следующие три файла:\n\n```\n/etc/dconf/profile/user\n```\n\n```\nuser-db:user\nsystem-db:local\n```\n\n```\n/etc/dconf/db/local.d/00-hidpi\n```\n\n```\n[org/gnome/mutter]\nexperimental-features=['scale-monitor-framebuffer']\n```\n\n```\n/etc/dconf/db/locks/hidpi\n```\n\n```\n/org/gnome/mutter/experimental-features\n```\n\nЗатем выполните dconf update и перезагрузитесь.\n\nUbuntu предоставляет патч [2] для настройки масштабирования с помощью Randr через GNOME Settings. Пропатченную версию можно установить с помощью пакета mutter-x11-scalingAUR. После установки выполните:\n\n```\n$ gsettings set org.gnome.mutter experimental-features \"['x11-randr-fractional-scaling']\"\n```\n\nЗатем перейдите в Настройки > Дисплеи > Масштаб.\n\nТакже можно реализовать дробное масштабирование вручную, используя коэффициент масштабирования GNOME вместе с масштабированием через xrandr. Эта комбинация позволяет правильно масштабировать шрифты TTF, чтобы они не размывались, в отличие от использования только xrandr. С помощью gsettings картинка увеличивается, а затем с помощью xrandr уменьшается до нужного размера.\n\nСперва задайте в настройках GNOME такой масштаб, который будет больше чем нужно. Обычно «2» уже много, но если нет, то попробуйте «3» и так далее. Затем начните изменять масштабирование с помощью xrandr. Сперва узнайте название нужного видеовыхода, в примерах ниже используется eDP1. Попробуйте для начала задать коэффициент, например, 1.25 — если интерфейс всё ещё слишком крупный, то немного увеличьте коэффициент; если уже слишком мелкий — немного уменьшите.\n\n```\n$ xrandr --output eDP1 --scale 1.25x1.25\n```\n\nЧтобы изменения сохранялись между перезагрузками, можно использовать autorandr; смотрите этот ответ на StackOverflow.\n\n"
    },
    {
      "title": "Масштабирование текста",
      "level": 4,
      "content": "В качестве альтернативы или в дополнение к изменению общего масштаба можно отдельно изменить масштаб текста. Это можно сделать через Gnome Tweaks в настройке Шрифты > Коэффициент масштабирования или через gsettings. Этот коэффициент может быть дробным числом, например:\n\n```\n$ gsettings set org.gnome.desktop.interface text-scaling-factor 1.5\n```\n\n"
    },
    {
      "title": "KDE Plasma",
      "level": 3,
      "content": "Настройки Plasma позволяют задать масштаб шрифтов, значков и виджетов. Они повлияют как на приложения Qt, так и на GTK.\n\nДля совместной настройки масштаба шрифтов, виджетов и значков:\n\n1. Параметры системы > Экран > Настройка экранов > Глобальный масштаб (в Xorg) или Масштаб (в Wayland)\n1. Задайте нужный коэффициент с помощью ползунка и нажмите «Применить»\n1. Перезагрузитесь для полного применения изменений\n\n"
    },
    {
      "title": "Размер курсора",
      "level": 4,
      "content": "Для настройки размера курсора мыши:\n\n1. Параметры системы > Внешний вид > Курсоры мыши > Размер\n\n"
    },
    {
      "title": "Масштаб шрифтов",
      "level": 4,
      "content": "Чтобы настроить только масштабирование текста:\n\n1. Параметры системы > Внешний вид > Шрифты\n1. Поставьте галочку Использовать другой DPI и настройте значение на свой вкус. Эта настройка должна вступить в силу немедленно для вновь запущенных приложений. Для применения ко всему рабочему столу Plasma нужно перезапустить сеанс.\n\n"
    },
    {
      "title": "Масштаб значков",
      "level": 4,
      "content": "Чтобы настроить только масштабирование значков:\n\n1. Параметры системы > Внешний вид > Значки > Выбрать размеры значков\n1. Выберите желаемый размер значков в каждой категории. Изменения должны примениться сразу.\n\n"
    },
    {
      "title": "Значки в трее с фиксированным размером",
      "level": 4,
      "content": "Значки в трее не масштабируются вместе с остальным рабочим столом, поскольку по умолчанию Plasma игнорирует настройки масштабирования Qt. Чтобы заставить Plasma учитывать настройки Qt, установите переменную окружения PLASMA_USE_QT_SCALING=1.\n\n"
    },
    {
      "title": "Xwayland",
      "level": 4,
      "content": "Начиная с Plasma 5.26, метод масштабирования Xwayland можно выбрать здесь: Параметры системы > Экран > Настройка экранов > Устаревшие приложения (X11).\n\nВ режиме «Масштабирование средствами системы» приложение X11 будет рендериться в 1x, а затем увеличиваться (масштабироваться) силами KDE. Это работает для всех приложений, но размывает картинку из-за увеличения.\n\nВ режиме «Масштабирование средствами приложений» приложение X будет рендерить себя в соответствующем размере. Это позволит избежать размытости, но приложения, не поддерживающие HiDPI, будут рендерить себя в масштабе 1х и поэтому будут выглядеть маленькими.\n\nСмотрите этот пост в блоге для более подробной информации.\n\n"
    },
    {
      "title": "Xfce",
      "level": 3,
      "content": "В Xfce настроить масштабирование можно здесь:\n\n1. Диспетчер настроек > Внешний вид > Настройки > Масштабирование окон\n1. Диспетчер настроек > Диспетчер окон > Стиль — тема Default-xhdpi\n\nТо же самое можно сделать с помощью команды xfconf-query:\n\n```\n$ xfconf-query -c xsettings -p /Gdk/WindowScalingFactor -s 2\n$ xfconf-query -c xfwm4 -p /general/theme -s Default-xhdpi\n```\n\nЕсли в некоторых приложениях GTK шрифты всё равно не масштабируются, попробуйте также сделать следующее (смотрите #GDK 3 (GTK 3)):\n\n1. Перейдите в Диспетчер настроек > Внешний вид > Шрифты > Задать DPI и измените на 192\n1. Установите переменную окружения GDK_DPI_SCALE=0.5 для уменьшения тех шрифтов, которые отмасштабировались дважды.\n\nЭти настройки применяются к Xfce и приложениям GTK.\n\nМасштабирование в Qt нужно настроить вручную; смотрите раздел #Qt 5. Если вы изменили DPI шрифтов, вам может понадобиться задать переменную окружения QT_FONT_DPI=96, чтобы избежать двойного масштабирования шрифтов в приложениях Qt.\n\n"
    },
    {
      "title": "Cinnamon",
      "level": 3,
      "content": "Поддерживает из коробки.\n\n"
    },
    {
      "title": "Enlightenment",
      "level": 3,
      "content": "Для E18 перейдите в E Setting panel. В Look > Scaling можно управлять коэффициентами масштабирования пользовательского интерфейса. Коэффициент 1.2, похоже, хорошо подходит для родного разрешения экрана MacBook Pro 15\".\n\n"
    },
    {
      "title": "Sway",
      "level": 3,
      "content": "Смотрите Sway#HiDPI.\n\n"
    },
    {
      "title": "Ресурсы X",
      "level": 2,
      "content": "Если вы не используете среду рабочего стола, такую как KDE, Xfce или другую, которая управляла бы настройками X за вас, вы можете установить желаемые настройки DPI вручную с помощью переменной Xft.dpi в Xresources:\n\n```\n~/.Xresources\n```\n\n```\nXft.dpi: 192\n\n! Это также можно быть полезно в зависимости от вашего монитора и личных предпочтений:\nXft.autohint: 0\nXft.lcdfilter:  lcddefault\nXft.hintstyle:  hintfull\nXft.hinting: 1\nXft.antialias: 1\nXft.rgba: rgb\n```\n\nДля Xft.dpi обычно хорошо подходят значения кратные 96, например 192 даёт масштаб 200%.\n\nУбедитесь, что эти настройки загружаются при запуске X — например, в файле ~/.xinitrc с помощью команды xrdb -merge ~/.Xresources. Смотрите статью Ресурсы X для более подробной информации.\n\nЭто задаст нужный размер шрифта в большинстве приложений, однако не повлияет на такие вещи, как размер значков. Установка Xft.dpi одновременно с масштабированием инструментария (например, GDK_SCALE) может привести к тому, что в некоторых программах, например Firefox, элементы интерфейса будут намного больше чем ожидалось.\n\n"
    },
    {
      "title": "X-сервер",
      "level": 2,
      "content": "Некоторые программы всё ещё могут считывать DPI, заданный X-сервером (большинство программ считывают ресурсы X прямо или косвенно). Старые версии i3 (до 2017 года) и Chromium (до 2017 года) делали это.\n\nЧтобы проверить, правильно ли X-сервер определил физические размеры вашего монитора, используйте утилиту xdpyinfo из пакета xorg-xdpyinfo:\n\n```\n$ xdpyinfo | grep -B 2 resolution\n```\n\n```\nscreen #0:\n  dimensions:    3200x1800 pixels (423x238 millimeters)\n  resolution:    192x192 dots per inch\n```\n\nВ этом примере используются неточные размеры (423 мм x 238 мм, хотя Dell XPS 9530 имеет размеры 346 мм x 194 мм), чтобы получить число, кратное 96 dpi, в данном случае 192 dpi. Это, как правило, работает лучше, чем использование правильного DPI — например, Pango рисует шрифты чётче в i3.\n\nЕсли DPI неверный, можно попытаться исправить его, как описано в разделе Xorg (Русский)#Размер дисплея и DPI.\n\n"
    },
    {
      "title": "Qt 5",
      "level": 3,
      "content": "Начиная с Qt 5.6, в приложениях Qt 5 можно включить учёт DPI экрана с помощью переменной окружения QT_AUTO_SCREEN_SCALE_FACTOR. В Qt 5.14 появилась новая переменная окружения QT_ENABLE_HIGHDPI_SCALING, которая заменяет переменную QT_AUTO_SCREEN_SCALE_FACTOR. Для наибольшей совместимости рекомендуется задать обе переменные:\n\n```\n$ export QT_AUTO_SCREEN_SCALE_FACTOR=1\n$ export QT_ENABLE_HIGHDPI_SCALING=1\n```\n\nЕсли автоматическое определение DPI не даёт желаемого эффекта, масштабирование можно задать вручную для каждого экрана (QT_SCREEN_SCALE_FACTORS/QT_ENABLE_HIGHDPI_SCALING) или глобально (QT_SCALE_FACTOR). Более подробная информация есть в блоге Qt и в документации разработчика Qt.\n\n- Если вы вручную устанавливаете коэффициент экрана, важно установить QT_AUTO_SCREEN_SCALE_FACTOR=0 и QT_ENABLE_HIGHDPI_SCALING=0, иначе некоторые приложения, которые принудительно включают высокий DPI, будут масштабироваться дважды.\n- QT_SCALE_FACTOR масштабирует шрифты, а QT_SCREEN_SCALE_FACTORS может не масштабировать их в зависимости от приложения.\n- Если вы также установите DPI шрифта вручную в xrdb для поддержки других инструментариев, QT_SCALE_FACTORS сделает шрифты огромными.\n- Если у вас #Несколько экранов с разным DPI, вам может понадобиться сделать QT_SCREEN_SCALE_FACTORS=\"2;2\".\n\nАльтернатива:\n\n```\n$ QT_FONT_DPI=96 clementine\n```\n\n"
    },
    {
      "title": "GDK 3 (GTK 3)",
      "level": 3,
      "content": "Установка масштаба GDK (в X11, не в Wayland) масштабирует пользовательский интерфейс, но не значки. Если вы используете минимальный оконный менеджер с установкой dpi через Xft.dpi, GDK будет масштабироваться отлично. В других случаях сделайте следующее:\n\nДля масштабирования интерфейса только на целочисленный коэффициент:\n\n```\n$ export GDK_SCALE=2\n```\n\nGTK3/4 не поддерживает дробное масштабирование, поэтому дробные коэффициенты будут игнорироваться. Эта переменная окружения также игнорируется в сеансах mutter wayland.\n\nДля масштабирования только текста можно использовать GDK_DPI_SCALE. Чтобы отменить масштабирование текста, можно использовать дробное масштабирование:\n\n```\n$ export GDK_DPI_SCALE=0.5\n```\n\nGTK3/4 не позволяют масштабировать значки, если приложение явно не реализует способ сделать это. Смотрите issue #4528. Если вам нужна эта возможность, по возможности используйте Qt.\n\n"
    },
    {
      "title": "GTK 2",
      "level": 3,
      "content": "Масштабирование интерфейса не поддерживается самим GTK 2, однако с помощью themix-full-gitAUR можно сгенерировать тему с элементами, предварительно масштабированными для отображения в HiDPI.\n\n"
    },
    {
      "title": "Electron",
      "level": 3,
      "content": "В приложениях Electron (например, slack-desktopAUR, signal-desktop и т. п.) можно задать масштаб путём добавления флага --force-device-scale-factor в файл .desktop. Обычно он находится в каталоге /usr/share/applications/ и может быть переопределён путём создания копии в ~/.local/share/applications/. Флаг должен быть добавлен к строке, начинающейся с «Exec=», например:\n\n```\n~/.local/share/applications/slack.desktop\n```\n\n```\nExec=env LD_PRELOAD=/usr/lib/libcurl.so.3 /usr/bin/slack --force-device-scale-factor=1.5 %U\n```\n\n"
    },
    {
      "title": "Elementary (EFL)",
      "level": 3,
      "content": "Увеличение интерфейса в 1.5 раза:\n\n```\nexport ELM_SCALE=1.5\n```\n\nСмотрите https://phab.enlightenment.org/w/elementary/[устаревшая ссылка 2024-10-12 ⓘ] для более подробной информации.\n\n"
    },
    {
      "title": "GNUstep",
      "level": 3,
      "content": "Приложения GNUstep, использующие его графическую библиотеку (AppKit), принимают свойство GSScaleFactor в своих настройках по умолчанию (настройки STEP). Чтобы задать масштаб 1.5 для всех приложений:\n\n```\ndefaults write NSGlobalDomain GSScaleFactor 1.5\n```\n\nОбратите внимание, что вы также должны отключить хинтинг шрифтов, установив значение параметра GSFontHinting равным 17, иначе рендеринг текста будет выглядеть искажённым при отображении длинных строк.\n\n```\ndefaults write NSGlobalDomain GSFontHinting 17\n```\n\nНекоторое автоматическое обнаружение было возможно ещё в 2011 году, но код, отвечающий за бэкенд X11, был впоследствии закомментирован.\n\n"
    },
    {
      "title": "Уменьшение разрешения фреймбуфера",
      "level": 4,
      "content": "Смотрите GRUB/Tips and tricks#Setting the framebuffer resolution.\n\n"
    },
    {
      "title": "Изменение размера шрифта GRUB",
      "level": 4,
      "content": "Найдите желаемый шрифт в /usr/share/fonts/.\n\nСконвертируйте его в формат, который понимает GRUB:\n\n```\n# grub-mkfont -s 30 -o /boot/grubfont.pf2 /usr/share/fonts/FontFamily/FontName.ttf\n```\n\nВ файле /etc/default/grub задайте новый шрифт, как описано в разделе GRUB/Tips and tricks#Background image and bitmap fonts:\n\n```\nGRUB_FONT=\"/boot/grubfont.pf2\"\n```\n\nНаконец, перегенерируйте файл настроек GRUB.\n\n"
    },
    {
      "title": "systemd-boot",
      "level": 3,
      "content": "Выберите более низкое разрешение для консоли с помощью опции console-mode (смотрите systemd-boot (Русский)#Настройка и loader.conf(5) § OPTIONS).\n\n"
    },
    {
      "title": "Приложения",
      "level": 2,
      "content": "Если вы используете сеанс Wayland, но приложение работает через Xwayland (либо потому что оно не поддерживает Wayland изначально, либо потому что оно использует X11 по умолчанию), интерфейс и шрифты могут оказаться размытыми, даже если приложение поддерживает HiDPI. Смотрите это сообщение об ошибке. Смотрите также Wayland (Русский)#Визуальное обнаружение приложений Xwayland.\n\n"
    },
    {
      "title": "Firefox",
      "level": 4,
      "content": "Firefox должен использовать настройки #GDK 3 (GTK 3). Однако GDK_SCALE масштабирует неконсистентно и не поддерживает дробные значения, вместо него можно попробовать GDK_DPI_SCALE. Другой вариант, который позволит избежать специфических для Firefox настроек во многих установках, — использовать #Ресурсы X, поскольку Firefox должен считывать указанное там значение Xft.dpi.\n\nЧтобы переопределить эти параметры, откройте страницу расширенных настроек Firefox (about:config) и добавьте параметр ui.textScaleFactor со значением 150 (или подберите более подходящее для вас значение; 150 — хороший выбор для экранов Retina). Вероятно, также понадобится изменить масштаб по умолчанию в основных настройках, например, до 120%. Это не обеспечивает консистентное масштабирование всего Firefox: отредактируйте layout.css.devPixelsPerPx для этого, но это может работать не так, как ожидается.\n\nЕсли Firefox не масштабирует шрифты, вы можете создать файл userChrome.css и добавить в него соответствующие стили. Более подробная информация о userChrome.css есть на mozillaZine. Начиная с Firefox 69, файлы userChrome.css и userContent.css не загружаются по умолчанию, если только пользователь не установит свои предпочтения. Откройте страницу расширенных настроек Firefox (about:config) и установите параметр toolkit.legacyUserProfileCustomizations.stylesheets на True, затем перезапустите Firefox для применения изменений.\n\n```\n~/.mozilla/firefox/профиль/chrome/userChrome.css\n```\n\n```\n@namespace url(\"https://www.mozilla.org/keymaster/gatekeeper/there.is.only.xul\");\n\n/* #tabbrowser-tabs, #navigator-toolbox, menuitem, menu, ... */\n* {\n    font-size: 15px !important;\n}\n\n/* exception for badge on adblocker */\n.toolbarbutton-badge {\n    font-size: 8px !important;\n}\n```\n\nЕсли вы используете HiDPI-монитор вместе с другим монитором, вы можете использовать дополнение ffreszoom, регулирующее масштаб страницы, если обнаруживает использование большого монитора (уровень и порог масштабирования настраиваются). Изменение внутренних настроек CSS DPI через расширение в настоящее время не поддерживается [3].\n\nЕсли вы используете Wayland, смотрите Firefox (Русский)#Wayland для информации по включению опционального бэкенда Wayland в firefox. Это также применимо к thunderbird.\n\n"
    },
    {
      "title": "Chromium / Google Chrome",
      "level": 4,
      "content": "Chromium должен использовать настройки #GDK 3 (GTK 3).\n\nДля переопределения настроек можно добавить флаг --force-device-scale-factor, который изменит масштаб интерфейса браузера и содержимого страниц. Например: chromium --force-device-scale-factor=2.\n\nПри использовании этой опции значение 1 означает обычный размер. Можно использовать дробные значения. Чтобы сделать изменение постоянным, для Chromium вы можете добавить его в ~/.config/chromium-flags.conf:\n\n```\n~/.config/chromium-flags.conf\n```\n\n```\n--force-device-scale-factor=2\n```\n\nДля Chrome используйте ~/.config/chrome-flags.conf.\n\nЕсли вы используете HiDPI-монитор вместе с другим монитором, вы можете использовать расширение reszoom, чтобы автоматически менять уровень масштабирования под активный экран.\n\nЕсли вы используете Wayland, включите поддержку нативного Wayland, чтобы не было размытости. Смотрите также Chromium#Incorrect HiDPI rendering.\n\n"
    },
    {
      "title": "Opera",
      "level": 4,
      "content": "Opera должна использовать настройки #GDK 3 (GTK 3).\n\nДля переопределения настроек можно добавить флаг --alt-high-dpi-setting=X, где X означает желаемый DPI, например --alt-high-dpi-setting=144. Новые версии Opera автоматически определяют DPI через настройки DPI шрифта (в KDE: Использовать другой DPI).\n\n"
    },
    {
      "title": "Gimp 2.10",
      "level": 3,
      "content": "Gimp 2.10 всё ещё использует GTK 2, поэтому родной поддержки HiDPI не имеет. Для увеличения значков можно открыть Параметры > Интерфейс > Тема значков и выбрать Огромный размер значков или другое подходящее значение.\n\nЕсли шрифты меню слишком маленькие, вы можете обновить существующую тему, скопировав её из /usr/share/gimp/2.0/themes/ в ~/.config/GIMP/2.10/themes/ и изменив gtk-font-name и font_name в gtkrc на что-нибудь побольше, например Sans 30. Затем выберите новую тему через Параметры > Интерфейс > Тема. При копировании не забудьте переименовать новый каталог во что-то отличное от оригинального имени (например, Dark > DarkHighDPI).\n\nТакже можно попробовать gimp-hidpi (инструкции по установке устарели и относятся к версии 2.8, в Gimp 2.10 тема должна быть установлена в ~/.config/GIMP/2.10/themes/).\n\nБолее новая версия gimp-develAUR использует GTK 3 и поэтому поддерживает Wayland и HiDPI. Размер значков и текста можно настроить через Параметры > Интерфейс > Тема значков/Дисплей соответственно.\n\n"
    },
    {
      "title": "Inkscape",
      "level": 3,
      "content": "Можно настроить размер значков через Параметры > Интерфейс > Тема. [4][5]\n\n"
    },
    {
      "title": "AWT/Swing",
      "level": 4,
      "content": "Java-приложения, использующие фреймворк AWT/Swing, можно масштабировать через свойство ВМ sun.java2d.uiScale при запуске java. Значение может быть дробным числом или процентами. Например:\n\n```\njava -Dsun.java2d.uiScale=2 -jar приложение_на_swing.jar\njava -Dsun.java2d.uiScale=300% -jar приложение_на_swing.jar\n```\n\nНачиная с Java 9 также используется переменная окружения GDK_SCALE.\n\nНа данный момент Java AWT/Swing (вплоть до OpenJDK 13) фактически поддерживает только целочисленные значения. Значения -Dsun.java2d.uiScale=250% или GDK_SCALE=2.5 будут обрабатываться аналогично значениям -Dsun.java2d.uiScale=2 или GDK_SCALE=2.\n\n"
    },
    {
      "title": "JavaFX",
      "level": 4,
      "content": "Java-приложения, использующие JavaFX, можно масштабировать через свойство ВМ glass.gtk.uiScale при запуске java. Значение может быть целочисленным процентом, целочисленным значением DPI (где 96dpi означает масштаб 100%, а, например, 192dpi означает масштаб 200%) или дробным значением. Например:\n\n```\njava -Dglass.gtk.uiScale=200% -jar приложение_на_jfx.jar\njava -Dglass.gtk.uiScale=192dpi -jar приложение_на_jfx.jar\njava -Dglass.gtk.uiScale=2.0 -jar приложение_на_jfx.jar\n```\n\nJavaFX прекрасно поддерживает дробные значения. Использование значений вроде -Dglass.gtk.uiScale=250% или -Dglass.gtk.uiScale=2.5 даёт ожидаемый результат.\n\n"
    },
    {
      "title": "AWT/Swing и JavaFX вместе",
      "level": 4,
      "content": "Некоторые Java-приложения используют JavaFX и AWT/Swing совместно (через javafx.embed.swing.JFXPanel). В этом случае настройки AWT/Swing будут влиять и на JavaFX, а настройка -Dglass.gtk.uiScale не будет иметь никакого эффекта.\n\n"
    },
    {
      "title": "IDE от JetBrains",
      "level": 4,
      "content": "Продукты JetBrains (IntelliJ IDEA и другие IDE) поддерживают два режима HiDPI (JRE-managed и IDE-managed). Последовательность определения коэффициента масштабирования системы описана в [6]:\n\n1. Свойство Java – -Dsun.java2d.uiScale\n1. gsettings(1) – ubuntu.user-interface/scale-factor или org.gnome.desktop.interface/scaling-factor\n1. GDK_SCALE и GDK_DPI_SCALE\n1. Xresources – Xft.dpi\n1. 1.0\n\nДля решения проблем обратитесь к диалогу «Show HiDPI Info» через поиск «Shift Shift».\n\nПри использовании разного масштабирования на разных мониторах может возникнуть проблема, когда IntelliJ не распознаёт реальное, исходное разрешение монитора. У некоторых пользователей получалось решить проблему добавлением опции -Dsun.java2d.uiScale.enabled=true в файле название_ide.vmoptions (Help > Edit custom VM options).\n\nЕсли это не сработает, на Wayland может быть включена экспериментальная опция GTK scale-monitor-framebuffer (смотрите раздел #Wayland выше). В настоящее время продукты JetBrains работают на Xwayland и пока не имеют встроенной поддержки Wayland. Это делает рендеринг в продуктах JetBrains несовместимым с фреймбуфером масштабирования монитора. Отключение фреймбуфера может решить проблемы размытых шрифтов и рендеринга в продуктах JB, но, увы, приводит к отключению дробного масштабирования.\n\nОбратите внимание, что на PyCharm eap (2023.2.2 RC) масштабирование, управляемое через IDE, не работает. В качестве обходного пути удалите eap-версию и установите стабильную.\n\n"
    },
    {
      "title": "Maple",
      "level": 4,
      "content": "Отмасштабировать Maple под HiDPI можно с помощью решения AWT/Swing. Но его нужно добавить в каталог установки Maple в каталог-maple/bin/maple в JVM_OPTIONS:\n\n```\nкаталог-maple/bin/maple\n```\n\n```\n...\nJVM_OPTIONS=\"-Dsun.java2d.uiScale=2 ...\"\n...\n```\n\nВ качестве альтернативы можно использовать переменную окружения GDK_SCALE:\n\n```\n$ GDK_SCALE=2 каталог-maple/bin/xmaple %f\n```\n\n"
    },
    {
      "title": "LibreOffice",
      "level": 3,
      "content": "LibreOffice на всех бэкендах VCL берёт настройки из соответствующих инструментариев. Есть ошибка, из-за которой бэкенд kf5 на Wayland не масштабируется [7]. Вместо этого используйте бэкенд gtk3. Смотрите LibreOffice (Русский)#Темы оформления.\n\n"
    },
    {
      "title": "MATLAB",
      "level": 3,
      "content": "Последние версии MATLAB] (R2017b) позволяют задавать коэффициент масштабирования[8]:\n\n```\n>> s = settings;s.matlab.desktop.DisplayScaleFactor\n>> s.matlab.desktop.DisplayScaleFactor.PersonalValue = 2\n```\n\nИзменения применяются после перезапуска.\n\nЭто может стать утомительным, если менять масштаб нужно часто. Для упрощения можно использовать скрипт:\n\n```\n~/bin/matlab-scale\n```\n\n```\n#!/bin/sh\nexec matlab -r \"s = settings;s.matlab.desktop.DisplayScaleFactor.PersonalValue=$1;quit\" -nodesktop -nosplash\n```\n\nДля изменения масштаба на 3:\n\n```\n$ matlab-scale 3\n```\n\n"
    },
    {
      "title": "Приложения Mono",
      "level": 3,
      "content": "Согласно [9][устаревшая ссылка 2023-04-23 ⓘ], приложения Mono масштабируются как GTK 3. Точный метод зависит от графической библиотеки: GtkSharp, очевидно, опирается на Gtk, в то время как Windows Forms (libgdiplus) просто смотрит настройки Xft.\n\n"
    },
    {
      "title": "NetBeans",
      "level": 3,
      "content": "NetBeans позволяет управлять размером шрифта своего интерфейса с помощью параметра --fontsize при запуске. Чтобы сделать это изменение постоянным, отредактируйте файл /usr/share/netbeans/etc/netbeans.conf и добавьте параметр --fontsize к свойству netbeans_default_options.[10]\n\nРазмер шрифтов редактора можно контролировать в меню Tools > Option > Fonts & Colors.\n\nРазмер шрифта окна вывода можно контролировать в меню Tools > Options > Miscelaneous > Output.\n\n"
    },
    {
      "title": "OBS Studio",
      "level": 3,
      "content": "OBS 29 поддерживает HiDPI без дополнительной настройки.\n\nДля старых версий OBS рекомендовалось установить переменную окружения QT_AUTO_SCREEN_SCALE_FACTOR=0, чтобы отключить Qt’s hi-dpi migration mode, и установить тему Yami. Не используйте тему Yami в OBS 29 и новее, так как она больше не нужна и приведёт к ошибкам.\n\n"
    },
    {
      "title": "Skype",
      "level": 3,
      "content": "Skype for Linux (пакет skypeforlinux-binAUR) использует #GDK 3 (GTK 3).\n\n"
    },
    {
      "title": "Spotify",
      "level": 3,
      "content": "Масштаб можно изменить с помощью сочетаний клавиш Ctrl++ для увеличения, Ctrl+- для уменьшения и Ctrl+0 для масштаба по умолчанию. Масштаб будет сохранён в ~/.config/spotify/Users/YOUR-SPOTIFY-USER-NAME/prefs, возможно, вам придётся создать этот файл самостоятельно:\n\n```\n~/.config/spotify/Users/YOUR-SPOTIFY-USER-NAME/prefs\n```\n\n```\napp.browser.zoom-level=100\n```\n\nТакже Spotify может быть запущен с пользовательским коэффициентом масштабирования, который будет умножен на значение, указанное в ~/.config/spotify/Users/YOUR-SPOTIFY-USER-NAME/prefs, например\n\n```\n$ spotify --force-device-scale-factor=1.5\n```\n\n"
    },
    {
      "title": "Официальная поддержка HiDPI",
      "level": 4,
      "content": "- С 25 января 2018 года в бета-программе появилась поддержка HiDPI, которая должна работать автоматически.\n- Через Steam > Настройки > Интерфейс установите флажок Увеличить текст и значки в соответствии с размером монитора (требуется перезапуск).\n- Если масштаб не определился автоматически, используйте GDK_SCALE=2 для установки нужного коэффициента масштабирования.\n- Если это не сработает, используйте steam -forcedesktopscaling 2 или установите переменную окружения STEAM_FORCE_DESKTOPUI_SCALING=2.0. [11]. После обновления интерфейса в 2023 году также поддерживается дробное масштабирование вроде 1.25.\n\n"
    },
    {
      "title": "Неофициальная",
      "level": 4,
      "content": "Для увеличения размера шрифта интерфейса можно установить HiDPI-Steam-Skin. Хотя он не идеален, он повышает удобство использования.\n\nMetroSkin Unofficial Patch также помогает в работе с HiDPI на Steam в Linux.\n\n"
    },
    {
      "title": "Sublime Text 3",
      "level": 3,
      "content": "Sublime Text 3 имеет полную поддержку масштабирования. Перейдите в Preferences > Settings и добавьте \"ui_scale\": 2.0 в ваши настройки.\n\n"
    },
    {
      "title": "Thunderbird",
      "level": 3,
      "content": "Смотрите #Firefox. Для открытия страницы about:config, перейдите в Настройки > Основные > Редактор настроек (кнопка в самом низу).\n\n"
    },
    {
      "title": "VirtualBox",
      "level": 3,
      "content": "VirtualBox также применяет общесистемное масштабирование к мониторам виртуальных машин, что уменьшает максимальное разрешение внутри виртуальных машин на коэффициент масштабирования (смотрите [12]).\n\nЭто можно обойти, вычислив обратную величину коэффициента масштабирования и вручную задав новый коэффициент масштабирования в команде запуска VirtualBox, например:\n\n```\n$ QT_SCALE_FACTOR=0.5 VirtualBoxVM --startvm название-вм\n```\n\n"
    },
    {
      "title": "VMware",
      "level": 3,
      "content": "Текст в приложении VMware отображается в размере, соответствующем настройкам системы, но значки маленькие, а между элементами интерфейса слишком маленькие отступы.\n\nКак описано в #GDK 3 (GTK 3), вы можете использовать GDK_SCALE для дальнейшего увеличения масштаба всего пользовательского интерфейса (включая значки и отступы), а затем использовать GDK_DPI_SCALE для уменьшения масштаба только текста до приемлемого размера.\n\nНапример, чтобы получить окончательный коэффициент масштабирования 2x:\n\n```\n$ GDK_SCALE=2 GDK_DPI_SCALE=0.5 vmware\n```\n\n"
    },
    {
      "title": "Приложения Wine",
      "level": 3,
      "content": "Запустите\n\n```\n$ winecfg\n```\n\nи на вкладке «Графика» измените «Разрешение экрана». Это влияет только на размер шрифта.\n\n"
    },
    {
      "title": "Zathura",
      "level": 3,
      "content": "Просмотр документов нормально работает из коробки.\n\nРазмер шрифта интерфейса можно изменить через файл настроек (обратите внимание, что «font» это опция girara):\n\n```\nset font \"monospace normal 20\"\n```\n\n"
    },
    {
      "title": "Zoom",
      "level": 3,
      "content": "Задайте переменную scaleFactor в ~/.config/zoomus.conf.\n\nДля Flatpak-версии задайте переменную окружения QT_SCALE_FACTOR (например 0.5 [13]). Это также можно сделать с помощью графического инструмента Flatseal.\n\n"
    },
    {
      "title": "Gazebo",
      "level": 3,
      "content": "Gazebo отображает только верхнюю левую часть вида, а не весь вид. Чтобы исправить это, необходимо установить переменную окружения Qt.\n\nДля запуска Gazebo:\n\n```\n$ QT_SCREEN_SCALE_FACTORS=[1.0] gazebo\n```\n\nДля запуска симуляции ROS:\n\n```\n$ TURTLEBOT3_MODEL=burger QT_SCREEN_SCALE_FACTORS=[1.0] roslaunch turtlebot3_gazebo turtlebot3_world.launch\n```\n\nСоздание псевдонима вроде gazebo=\"QT_SCREEN_SCALE_FACTORS=[1.0] gazebo\" работает в первом случае, но не работает во втором.\n\n"
    },
    {
      "title": "Fcitx",
      "level": 3,
      "content": "Можно изменить FontSize в ~/.config/fcitx/conf/fcitx-classic-ui.config.\n\nДля Fcitx5 укажите Font в двойных кавычках в ~/.config/fcitx5/conf/classicui.conf.\n\n"
    },
    {
      "title": "Неподдерживаемые приложения — через сетевой уровень",
      "level": 3,
      "content": "Для масштабирования приложений можно использовать run-scaled-gitAUR[ссылка недействительна: package not found] (который использует xpra).\n\nДругой способ — запустить приложение на весь экран без декораций окна на отдельном рабочем столе VNC, а затем масштабировать VNC-просмотрщик. С помощью vncdesk-gitAUR вы можете создать рабочий стол для каждого приложения отдельно, а затем запустить сервер и клиент простой командой, например vncdesk 2.\n\nВ x11vnc есть экспериментальная опция -appshare, которая открывает по одному просмотрщику на каждое окно приложения. Возможно, с этим можно что-то придумать.\n\n"
    },
    {
      "title": "Неподдерживаемые приложения — через Weston",
      "level": 3,
      "content": "Это несетевое и потенциально аппаратно ускоряемое решение. Базовый пример выглядит так:\n\n```\n$ weston --xwayland --socket=testscale --scale=2\n$ DISPLAY=:1 WAYLAND_DISPLAY=testscale приложение\n```\n\nОтдельный файл настроек weston.ini, используемый с weston --config, может сделать всё покрасивее:\n\n```\n[core]\nidle-time=0\n[shell]\npanel-position=none\nlocking=false\n```\n\nЗначение DISPLAY должно быть тем, которое использует Xwayland. Если обычный Xorg работает на :0, то Xwayland скорее всего будет использовать :1. Можно проверить файлы в /tmp/.X11-unix.\n\nДля запуска приложений в отдельных окнах изменяйте параметры --socket и WAYLAND_DISPLAY + DISPLAY для каждого приложения. Правда, заскриптовать это проблематично из-за того, что DISPLAY должен быть небольшим целым числом.\n\n"
    },
    {
      "title": "Несколько экранов",
      "level": 2,
      "content": "Настройки HiDPI применяются ко всему рабочему столу, поэтому внешние мониторы без HiDPI будут отображать всё слишком крупно. Однако установка различных коэффициентов масштабирования для разных мониторов уже поддерживается в Wayland.\n\n"
    },
    {
      "title": "Экран сбоку",
      "level": 3,
      "content": "Можно использовать опцию scale в xrandr в качестве обходного пути. Например, если есть не-HiDPI монитор (DP1) справа от встроенного HiDPI дисплея (eDP1), можно выполнить:\n\n```\n$ xrandr --output eDP-1 --auto --output DP-1 --auto --scale 2x2 --right-of eDP-1\n```\n\nПри расширении сверху внутреннего дисплея на внешнем мониторе может отображаться часть внутреннего дисплея, в таком случае укажите положение вручную.\n\nТакже можно настроить параметр sharpness для уменьшения размытия, вызванного масштабированием.\n\n- Решение с --scale 2x2 может не работать на некоторых картах NVIDIA, решения пока что нет. [14] Возможный обходной путь — задать ForceFullCompositionPipeline=On в CurrentMetaMode через nvidia-settings. Смотрите [15].\n- Если вы используете драйвер modesetting и мышь мерцает, для решения проблемы можно задать экрану, который не масштабировался, масштаб 0.9999x0.9999.\n\n"
    },
    {
      "title": "Несколько внешних мониторов",
      "level": 3,
      "content": "При масштабировании нескольких внешних мониторов, имеющих более низкое разрешение, чем встроенный дисплей HiDPI, могут возникнуть проблемы. В этом случае вы можете попробовать понизить масштаб дисплея HiDPI, например, с помощью:\n\n```\n$ xrandr --output eDP1 --scale 0.5x0.5 --output DP2 --right-of eDP1 --output HDMI1 --right-of DP2\n```\n\nПри понижении масштаба дисплея HiDPI шрифт на нём будет слегка размыт, но это отличается о той размытости, которая появляется при повышении масштаба внешних мониторов. Вы можете сравнить и посмотреть, какой вид размытости менее проблематичен для вас.\n\n"
    },
    {
      "title": "Дублирование экрана",
      "level": 3,
      "content": "Если вы хотите просто выводить одну и ту же картинку на оба экрана, то это просто.\n\nЕсли AxB это разрешение дисплея HiDPI (например, 3200x1800) и CxD это разрешение внешнего монитора (например, 1920x1200):\n\n```\n$ xrandr --output HDMI --scale [A/C]x[B/D]\n```\n\nВ данном примере получится следующее (3200/1920 = 1.66 и 1800/1200 = 1.5):\n\n```\n$ xrandr --output HDMI --scale 1.66x1.5\n```\n\nПример для экранов UHD и 1080p (3840/1920=2 2160/1080=2):\n\n```\n$ xrandr --output HDMI --scale 2x2\n```\n\nТакже можно настроить параметр sharpness для уменьшения размытия, вызванного масштабированием.\n\n"
    },
    {
      "title": "Инструменты",
      "level": 3,
      "content": "Есть инструменты для автоматизации выполнения вышеупомянутых команд.\n\n- Этот скрипт настраивает внешний дисплей без HiDPI над внутренним дисплеем с HiDPI.\n- xrandr-extend.\n- xlayoutdisplayAUR — это консольный фронтенд для xrandr, который определяет и устанавливает правильный DPI: README\n\n"
    },
    {
      "title": "Встроенные шрифты",
      "level": 3,
      "content": "Консоль Linux изменяет шрифт на TER16x32 (основан на ter-i32b из terminus-font[16]), основываясь на количестве пикселей по вертикали и горизонтали дисплея[17] независимо от его физического размера. Если ваш монитор не распознался как HiDPI, шрифт по умолчанию можно изменить. Для этого добавьте fbcon=font:TER16x32 в параметры ядра. 32-пиксельные шрифты — это максимум, поддерживаемый ядром Linux, в некоторых случаях этого может быть недостаточно.\n\n"
    },
    {
      "title": "Внешние шрифты (tty)",
      "level": 3,
      "content": "Самые крупные шрифты, присутствующие в пакете kbd, — latarcyrheb-sun32 и solar24x32. Другие пакеты, например terminus-font, содержат дополнительные альтернативы, такие как ter-132n (обычный) и ter-132b (полужирный). Подробнее о настройке можно почитать в разделах Консоль Linux#Шрифты и Консоль Linux#Постоянные изменения, в частности, для применения настройки шрифта в early userspace.\n\nПосле изменения шрифта он часто искажается и становится нечитаемым при переходе на другие виртуальные консоли (tty2-6). Для исправления можно принудительно задать определённый режим для KMS, например video=2560x1600@60 (подставьте родное разрешение вашего HiDPI дисплея) и перезагрузиться. При использовании меньших разрешений текст будет выглядеть более крупным, но при этом пикселизированным.\n\nПри загрузке через UEFI может оказаться так, что консоль и загрузчик ограничены низким разрешением, несмотря на правильные настройки KMS. Это может быть вызвано тем, что в настройках UEFI включена legacy/BIOS загрузка. Её отключение позволит системе загрузиться с правильным разрешением.\n\n"
    },
    {
      "title": "kmscon",
      "level": 3,
      "content": "Для полноценной поддержки HiDPI можно использовать KMSCON.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Ultra HD 4K Linux Graphics Card Testing (Nov 2013)\n- Understanding pixel density\n- Mixed DPI and the X Window System\n\n"
    }
  ]
}