{
  "title": "High Performance Firewall/Nat with iptables and VLANs and iproute2 (Italiano)",
  "url": "https://wiki.archlinux.org/title/High_Performance_Firewall/Nat_with_iptables_and_VLANs_and_iproute2_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nNote: **This article or section is a candidate for merging with Router.** This article or section is a candidate for merging with Router.\n\nThis article or section is a candidate for merging with Router.\n\nImagine this, you have more than two networks separated by Virtual Lans protocols (IEEE 802.1q) or VLANs, carried to you by an intelligent/manageable switch on one troncal line 10/100/1000 MB HD/FD (naturally the best is 1000 MB FD).\n\nThis page introduce how to create High Performance Firewall / Nat with iptables and VLANs and iproute2. Then you can share internet to a really BIG numbers of hosts, and maintain a good performance.\n\n"
    },
    {
      "title": "VLAN support",
      "level": 2,
      "content": "First, create sub-network as in page VLAN.\n\n"
    },
    {
      "title": "The round robin NAT",
      "level": 3,
      "content": "Let us suppose we have a one ip: 200.aaa.bbb.6 and our gateway is 200.aaa.bbb.1. we can safely put these parameters by default in our configuration. It will not get participation at all in our firewall.\n\nI say I have 3 groups of 10 IPs each to play...... we will define the NEXT in our firewall script:\n\n```\nGr1='200.AAA.CCC.10-200.AAA.CCC.20'\nGr2='200.AAA.DDD.10-200.AAA.DDD.20'\nGr3='200.AAA.EEE.10-200.AAA.EEE.20'\n```\n\nAnd the next important line is:\n\n```\niptables -t nat -A POSTROUTING -s 192.168.0.0/21  -j SNAT --to $Gr1 #ACCESS VLAN 10\niptables -t nat -A POSTROUTING -s 192.168.8.0/21  -j SNAT --to $Gr2 #ACCESS VLAN 20\niptables -t nat -A POSTROUTING -s 192.168.15.0/21  -j SNAT --to $Gr1 #ACCESS VLAN 30\n.... etc\n```\n\nYou can repeat the groups for access, subdivide the networks ETC, iptables make a round robin over the Gr1, Gr2 and Gr3 by default, no modification is needed.\n\nIt is not necessary to create a virtual card (alias) to every IP in the group.\n\nIt is important that every real router knows every group and publishes its via BGP (or similar) to the neighbours.\n\n"
    },
    {
      "title": "tips",
      "level": 3,
      "content": "To accelerate some ports you can put this in the top of FORWARD chain\n\n```\niptables -A FORWARD -m state --state ESTABLISHED,RELATED -j ACCEPT\niptables -A FORWARD -p icmp -o eth0 -j ACCEPT\niptables -A FORWARD -p tcp -m multiport --dports 80,443,110,53 -j ACCEPT  # FAST FAST FAST \niptables -A FORWARD -p udp  --dport 53 -j ACCEPT\n```\n\nThis mean:\n\n- the packets incoming will pass only 1 rule if it is an establish connection\n- the packet incoming will pass 2 rules if is a ping or similar\n- the packet will pass 3 rules if is http, mail or similar\n- and the DNS request will pass 3 o 4 rules until go out\n\nThe outgoing virus will KILL our machine, and we not need to share \"windows\" conversations so, kill them!!!!\n\n```\n#VIRUS\niptables -A FORWARD -p tcp --dport 135:139 -j DROP\niptables -A FORWARD -p tcp --dport 445 -j DROP\niptables -A FORWARD -p udp --dport 135:139 -j DROP\niptables -A FORWARD -p udp --dport 445 -j DROP\n```\n\nIf you can, before they reach our machine.\n\n"
    },
    {
      "title": "The High Performance",
      "level": 2,
      "content": "We get to the real important part of this howto.\n\nIn our run to get a really big number of hosts running through our machine we miss some things\n\n1. We forget that is just one NICs to potentially more than 8000 Mac Addresses. The card shared memory is not prepare for this!!!!!\n1. By default iptables is not prepared to make this number of connections simultaneously !!!!!!\n\nSo...\n\nTo the first issue... I get some error messages in the logs relative to this, I'm really sorry, I lost these logs and do not remember what they said. But the answer is this, increase the threshold memory to the neighbours. Type this and read:\n\n```\n# cat /proc/sys/net/ipv4/neigh/default/gc_thresh1 \n128\n# cat /proc/sys/net/ipv4/neigh/default/gc_thresh2 \n512\n# cat /proc/sys/net/ipv4/neigh/default/gc_thresh3 \n1024\n```\n\nNext you can put this in the /etc/sysctl.conf\n\n```\nnet.ipv4.neigh.default.gc_thresh1 = 512\nnet.ipv4.neigh.default.gc_thresh2 = 1024\nnet.ipv4.neigh.default.gc_thresh3 = 2048\n```\n\nand make sysctl -p to increase to the double!!! (no reboot needed) with this I get no errors!!!!!\n\nThe next part will need some comprehension about buckets and conntracks and hashsize (the way how iptables manage the nat connections). There is a very good document about this at here. Read it!!!! Some thing are change since IPtables is know as Netfiler.\n\nIn resume!!! Put this in your modules section:\n\n```\nMODULES=(8021q 'nf_conntrack hashsize=1048576' nf_conntrack_ftp \n                               ...and other nf_stuff .......)\n```\n\nThe last ones is just to avoid some problems that we have with ftp connections (I thing this is not necessary anymore). The 'nf_conntrack hashsize=1048576' increase the numbers of the hashsize (increase the kernel memory designated to NAT connections) (need reboot or reload module :-) see by running dmesg | grep conntrack as root)\n\nAnd the next is put some similar to the /etc/sysctl.d/99-sysctl.conf: file\n\n```\n...\nnet.netfilter.nf_conntrack_max = 1048576\n...\n```\n\nAnd do the sysctl --system command\n\nIn my case is the same number, that means that I have 1 connection for bucket!!!! I do not need more!!!! by default NetFilter put rate of 1:8. I.E. 8 conections per bucket!! (I think, not remember well)..\n\nIn our case we get about 600.000 simultaneous connections in 2 1Giga NICs cards, You can see this with the next command\n\n```\n# cat /proc/sys/net/netfilter/nf_conntrack_count\n```\n\nAnd put this in a snmpd agent to get and graph it in a MRTG/cacti server ..... uuuuuuu homework\n\n"
    },
    {
      "title": "The iproute2",
      "level": 2,
      "content": "We have 3 big access to Internet!!! This is because we manage 3 class C groups of IPs (some restrictions of BGP) in this firewall. So, we have 3 incoming traffics that we can manage, but only one outgoing!!! Our default gateway. This can easily fill our outgoing quote, so we have to spare it.\n\nFirst we have to put some new tables to /etc/iproute2/rt_tables file\n\n```\n# echo 200 PRO_1 >> /etc/iproute2/rt_tables\n# echo 205 PRO_2 >> /etc/iproute2/rt_tables\n# echo 210 PRO_3 >> /etc/iproute2/rt_tables\n```\n\nCan be more, can be less, depends on traffic\n\nSecond we have to give a default gateway to this tables\n\n```\n# ip route add default via 200.aaa.bbb.2 table PRO_1\n# ip route add default via 200.aaa.bbb.3 table PRO_2\n# ip route add default via 200.aaa.bbb.4 table PRO_3\n```\n\nIt is recommended but not necessary put the local interfaces to each table. If you do not put the next few lines you will get not answer of ping in the local network, but you will be able to pass trough.\n\n```\n# ip route add 192.168.0.0/21 via 192.168.0.1 table PRO_1\n# ip route add 192.168.8.0/21 via 192.168.8.1 table PRO_1\n# ip route add 192.168.15.0/21 via 192.168.15.1 table PRO_1\n.....\nsame PRO_2, same PRO_3\n```\n\nThe last thing is to give the order to the incoming packages\n\n```\n# ip rule add from 192.168.0.0/21 table PRO_1\n....\n....\n```\n\nAgain, you can play with the PRO_X and even you can play with the mask and submask For example we want to give only a one class C to outgoing to PRO_3\n\n```\n# ip rule add from 192.168.1.0/24 table PRO_3\n```\n\nPut this before the <NET>/21\n\n"
    }
  ]
}