{
  "title": "History of Arch Linux (日本語)",
  "url": "https://wiki.archlinux.org/title/History_of_Arch_Linux_(%E6%97%A5%E6%9C%AC%E8%AA%9E)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Arch Linux は、x86_64 向けに独自に開発された、あらゆる用途に対応できる万能 GNU/Linux ディストリビューションです。Arch はローリングリリースモデルをベースとしており、常に最先端であるように努め、ほとんどのソフトウェアは最新の安定バージョンが提供されます。Arch は最小限の基本システムの状態でインストールされ、ユーザー自身が、ユーザーの理想とする環境のために必要なものだけをインストールして構築することができます。\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 原則 1.1 シンプルであること 1.2 最新であること 1.3 実用的であること 1.4 ユーザー中心であること 1.5 汎用であること\n- 2 歴史 2.1 初期 2.2 中期 2.3 ArchWiki の誕生 2.4 A. Griffin 時代の幕開け 2.5 Arch Install Scripts 2.6 systemd 時代 2.7 i686 サポートの廃止 2.8 プロジェクトリーダーの展望と選出 2.9 GitLab 時代\n\n- 1.1 シンプルであること\n- 1.2 最新であること\n- 1.3 実用的であること\n- 1.4 ユーザー中心であること\n- 1.5 汎用であること\n\n- 2.1 初期\n- 2.2 中期\n- 2.3 ArchWiki の誕生\n- 2.4 A. Griffin 時代の幕開け\n- 2.5 Arch Install Scripts\n- 2.6 systemd 時代\n- 2.7 i686 サポートの廃止\n- 2.8 プロジェクトリーダーの展望と選出\n- 2.9 GitLab 時代\n\n"
    },
    {
      "title": "シンプルであること",
      "level": 3,
      "content": "Arch Linux はシンプリシティを、「不必要な追加や修正を行わない」ことと定義しています。Arch Linux はオリジナルの開発者(アップストリーム)のリリースしたままのソフトウェアを、最小限のディストリビューション固有(ダウンストリーム)の変更を加えて提供しています。アップストリームに取り入れられていないパッチは避けられ、Arch のダウンストリームパッチは、プロジェクトの次のリリースで廃止されるパックポートされたバグフィックスでほぼ構成されています。\n\n同じように、Arch はアップストリームの提供する設定ファイルを、ファイルパスの調整のような限定的なディストリビューション固有の問題の修正のみに留めて提供しています。単にパッケージがインストールされたからといって、自動でサービスを有効にするような自動化は追加しません。パッケージは、特定のケースでディスクスペースの無駄を省くといった、特に利点がある場合にのみ分割されます。GUI の構成設定ツールは公式には提供されず、ほとんどのシステム設定をシェル上やテキストエディタで行うことを推奨しています。\n\n"
    },
    {
      "title": "最新であること",
      "level": 3,
      "content": "Arch Linux は、そのソフトウェアにシステムを破損させるような問題がない限り、常に最新の安定バージョンを提供するよう努めています。ローリングリリースをベースとしたシステムは、一度インストールすれば継続的なアップグレードで使用し続けることができます。\n\nArch は GNU/Linux ユーザーに、最新の安定版カーネルの他、systemd init システム、新しいファイルシステム、LVM2、ソフトウェア RAID、udev サポートおよび initcpio (と mkinitcpio) を含む多くの新しい機能を提供します。\n\n"
    },
    {
      "title": "実用的であること",
      "level": 3,
      "content": "Arch は理想的なディストリビューションというよりは実用的なディストリビューションです。このページに書かれている原則はあくまで原則にすぎません。最終的に、設計上の決定は開発者の総意によって個別に行われます。事実に基づく技術的な分析と議論が重要なのであり、政治的・大衆的意見は意味を持ちません。\n\nArch Linux のリポジトリにある数多くのパッケージとビルドスクリプトは、希望する人々にフリーでオープンソースなソフトウェアを提供するのと同じように、「イデオロギーよりも機能性」を選ぶ人々にプロプライエタリソフトウェアパッケージの選択の自由もサポートしています。\n\n"
    },
    {
      "title": "ユーザー中心であること",
      "level": 3,
      "content": "多くの GNU/Linux ディストリビューションが、より「ユーザーフレンドリ」であろうとしているのに対し、Arch Linux はこれまでも、そしてこれからも「ユーザー中心」でありつづけます。Arch はできるだけ多くの人にアピールするよりも、貢献している人のニーズを満たすことを目指しています。熟練の GNU/Linux ユーザーや、積極的にドキュメントを読んだり自分の問題を解決する“do-it-yourself”の姿勢を持った人をターゲットにしています。\n\n全てのユーザーはディストリビューションへ参加・貢献することを推奨されています。バグの報告や修正の支援、パッケージを改善するパッチやコアプロジェクトの開発支援はとても助けになります。Arch の開発者はボランティアであり、積極的に貢献することでチームの一部を担っていると感じることができるでしょう。Archer は自由にArch_User_Repositoryにパッケージを投稿したり、ArchWiki ドキュメントの改善や拡充、フォーラム・メーリングリストやIRC チャンネルでの他のユーザーの問題解決の支援や意見交換をすることができます。Arch Linux は地球上の多くの人々に選ばれているオペレーティングシステムであり、様々な言語でのドキュメントの提供や作成を支援する国際コミュニティがいくつも存在しています。\n\n"
    },
    {
      "title": "汎用であること",
      "level": 3,
      "content": "Arch Linux は汎用のディストリビューションです。インストール時には、コマンドラインの環境のみが提供されています。不要なパッケージを削除するのではなく、x86_64アーキテクチャ用の公式リポジトリで提供されている何千もの高品質なパッケージを選ぶことでカスタムシステムを作り上げることができます。\n\nArch はローリングリリースモデルで、軽量・シンプルで高速なパッケージマネージャ pacman に支えられており、一つのコマンドでシステム全体を継続的にアップグレードできます。また、Arch は ports ライクな Arch Build System も提供しており、パッケージのソースからビルドおよびインストールが簡単に行え、その同期も一つのコマンドで行えます。さらに、Arch は Arch User Repository (AUR) にはユーザーがメンテナンスする何千もの PKGBUILD スクリプトが登録されており、makepkg コマンドを使用してソースからインストール可能なパッケージにコンパイルできます。さらには、自分自身のカスタムリポジトリを用意することも容易にしています。\n\n"
    },
    {
      "title": "歴史",
      "level": 2,
      "content": "Arch コミュニティは一番有名で影響力のある Linux ディストリビューションの1つにまで成長・成熟を続け、その評価は長年に渡って受けた注目とレビューによって裏付けられています。\n\nArch の開発者は無給で、パートタイムのボランティアであり、Arch Linux をマネタイズする予定はありません。これからもあらゆる意味でフリーであり続けます。Arch の開発の歴史についてさらに調べたいという好奇心があるなら Internet Archive Wayback Machine の Arch のエントリ や Arch Linux ニュースアーカイブ を見てください。\n\n"
    },
    {
      "title": "初期",
      "level": 3,
      "content": "Judd Vinet (カナダ人プログラマーであり時折ギタリスト) が2001年の早くに Arch Linux の開発を開始しました。最初の公式リリース、Arch Linux 0.1 は2002年3月11日に公開されています。Slackware, BSD, Polish Linux Distribution, CRUX のすっきりとしたシンプリシティに影響を受け、また、当時これらのディストリビューションにパッケージ管理が存在してなかったのに失望して、Vinet はこれらのディストリビューションと同じような方針で独自のディストリビューションを立ち上げたのです。彼は、パッケージのインストール・削除・アップグレードを自動的に処理する、pacman という名のパッケージ管理システムも書き上げました。\n\n"
    },
    {
      "title": "中期",
      "level": 3,
      "content": "フォーラムの投稿数やユーザー数、バグレポートの数のグラフから明らかなように、初期の Arch コミュニティは着実に成長していきました。さらに、Arch は早くから オープンでフレンドリで有益なコミュニティ として知られています。\n\n"
    },
    {
      "title": "ArchWiki の誕生",
      "level": 3,
      "content": "2005年7月8日には MediaWiki エンジンによる ArchWiki が立ち上げられました。\n\n"
    },
    {
      "title": "A. Griffin 時代の幕開け",
      "level": 3,
      "content": "2007年の後半に、Judd Vinet は Arch 開発者として活発に参加することをやめ、円滑にアメリカ人のプログラマー Aaron Griffin (Phrakture) へとトップが移りました。\n\n"
    },
    {
      "title": "Arch Install Scripts",
      "level": 3,
      "content": "2012年7月15日にリリースされたインストールイメージからは、メニューによって操作する Arch Installation Framework が 廃止 されて代わりに Arch Install Scripts (arch-install-scripts) が搭載されるようになりました。\n\n"
    },
    {
      "title": "systemd 時代",
      "level": 3,
      "content": "2012年と2013年の間に伝統的な System V init システムが systemd によって置き換えられました [1][2][3][4]。\n\n"
    },
    {
      "title": "i686 サポートの廃止",
      "level": 3,
      "content": "2017年1月25日、開発者やコミュニティで使われなくなってきたことを受けて i686 アーキテクチャのサポートを段階的に廃止することが アナウンス されました。そして 2017年11月末日 までにミラーから全ての i686 パッケージが削除されました。\n\n"
    },
    {
      "title": "プロジェクトリーダーの展望と選出",
      "level": 3,
      "content": "2020年の始め、チームの努力により、 Arch Linux のスタッフは今後のリーダーを決定する新しいプロセスを考案しました。詳細は DeveloperWiki:プロジェクトリーダー を参照してください。\n\nA. Griffin の退任の決定により、後継者を選出する投票が行われました。2020年2月24日に結果が公開され、 Levente Polyak が公式に選出されました。\n\n"
    },
    {
      "title": "GitLab 時代",
      "level": 3,
      "content": "2023年5月、Arch Linux はパッケージングインフラストラクチャを GitLab へ移行しました。この移行により内部的な変更や革新が行われただけでなく、testing リポジトリが core-testing と extra-testing に分割され、staging リポジトリが core-staging と extra-staging に分割され、さらに community リポジトリが extra に統合されました。詳細は GitLab のブログをご覧ください。\n\nその数か月後の 2023年11月、旧バグトラッカー (Flyspray) は GitLab へ移行され、GitLab のコラボレーション機能 (issues や merge requests) が一般公開されました。アーカイブ目的で旧バグトラッカーの静的コピーが保存されるため、例えばランダムに選ばれた FS#56716 のようなリンクも引き続き有効です。\n\n"
    }
  ]
}