{
  "title": "How to use a mouse in the console (Italiano)",
  "url": "https://wiki.archlinux.org/title/How_to_use_a_mouse_in_the_console_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GPM, short for General Purpose Mouse, is a daemon that provides mouse support for Linux virtual consoles.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the gpm package. For touchpad support on a laptop, please see Laptop#Touchpad.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The -m parameter precedes the declaration of the mouse to be used. The -t parameter precedes the type of mouse. To get a list of available types for the -t option, run gpm with -t help.\n\n```\n# gpm -m /dev/input/mice -t help\n```\n\nThe gpm package needs to be started with a few parameters. These parameters can be recorded by creating the file /etc/conf.d/gpm, or used when running gpm directly. The gpm.service includes the parameters for USB mice (ExecStart=/usr/bin/gpm -m /dev/input/mice -t imps2).\n\nObviously, it should be edited, preferably in a systemd friendly manner, if there is another mouse type, and the service is used.\n\n- For PS/2 mice, the parameters are: -m /dev/psaux -t ps2\n- And IBM Trackpoints need: -m /dev/input/mice -t ps2\n\n```\n-m /dev/psaux -t ps2\n```\n\n```\n-m /dev/input/mice -t ps2\n```\n\nOnce a suitable configuration has been found, start and enable the gpm.service.\n\nFor more information see gpm(8).\n\n"
    },
    {
      "title": "QEMU or VirtualBox",
      "level": 3,
      "content": "The default mouse emulated by QEMU and VirtualBox has severe problems in both gpm and x with positioning and clicking. The position becomes unsynchronized with the host, so there are areas that cannot be hovered over without repeatedly exiting and re-entering the window. Clicks register in a different location than the cursor was showing at.\n\nBoth QEMU and VirtualBox solve this problem by providing emulation for a USB tablet, which gives absolute positioning. (libvirt uses this automatically.)\n\nHowever, the gpm only knows how to use the emulated mouse in relative positioning mode, so these problems remain. Attempting to use other types via -t fail to get it working properly.\n\ngpm-vmAUR includes a several year old pull request to add USB tablet support for VirtualBox (which also works under QEMU) and modifies the gpm.service file to use it by default.\n\nYou may need to change which event is used. (Giving gpm the original -m /dev/input/mice will not work.) By default:\n\n```\n/etc/gpm-vm.conf\n```\n\n```\nevent=\"/dev/input/event2\"\n```\n\nYou can determine the event to use by installing evtest and running:\n\n```\n# evtest\n```\n\n```\n...\n/dev/input/event2:      QEMU QEMU USB Tablet\n...\n```\n\nIf you need to give gpm additional options, you can set additional_args in /etc/gpm-vm.conf.\n\nOnce a suitable configuration has been found, start and enable the gpm.service.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Gentoo:GPM\n- consolationAUR Alternative based on libinput\n\n"
    }
  ]
}