{
  "title": "HP EliteBook 745 G2",
  "url": "https://wiki.archlinux.org/title/HP_EliteBook_745_G2",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nPointing Stick |  | Yes\nKeyboard |  | Yes\nVideo |  | Yes\nWebcam | 04f2:b477 | Yes\nEthernet |  | Yes\nBluetooth | 0a5c:21fb | Yes\nSD-Card slot |  | Yes\nAudio |  | Yes\nWireless | 0a5c:21fb | Yes\nFingerprint reader |  | Untested\nSmart Card Reader |  | Untested\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Even if UEFI, Arch Linux and (e.g.) GRUB are correctly configured and with the correct UEFI NVRAM variables set, the system will not boot from the HDD/SSD. The problem is that HP hard coded the paths for the OS boot manager in their UEFI boot manager to \\EFI\\Microsoft\\Boot\\bootmgfw.efi to boot Microsoft Windows, regardless of how the UEFI NVRAM variables are changed. There are two workarounds:\n\n"
    },
    {
      "title": "Using the \"Customized Boot\" path option (recommended)",
      "level": 3,
      "content": "The latest HP firmware allows defining a “Customized Boot” path in the UEFI pre-boot graphical environment. Select the “Customized Boot” option in the UEFI pre-boot graphical environment under “Boot Options” and set the path to your OS boot loader on the EFI system partition e.g.:\n\n\\EFI\\grub\\grubx64.efi\n\nAlways verify the correct path to the .efi file. Also, adjust the device boot order (also in the UEFI pre-boot graphical environment) to boot this entry first.\n\n"
    },
    {
      "title": "Change the OS boot loader path to match the hard coded path",
      "level": 3,
      "content": "Note: **This article or section is being considered for removal.** This article or section is being considered for removal.\n\nThis article or section is being considered for removal.\n\nChange the UEFI application path of the OS boot loader to that hard coded path. On your EFI system partition; e.g. with esp being the EFI system partition mountpoint:\n\n```\n# mkdir -p esp/EFI/Microsoft/Boot\n# cp esp/EFI/grub/grubx64.efi esp/EFI/Microsoft/Boot/bootmgfw.efi\n```\n\nor\n\n```\n# mkdir -p esp/EFI/BOOT\n# cp esp/EFI/grub/grubx64.efi esp/EFI/BOOT/BOOTx64.EFI\n```\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "This notebook supports HDD FDE (SED). The HDD/SSD can be locked by setting a password in the UEFI pre-boot graphical environment under the option \"DriveLock\" (this requires setting a password for the UEFI pre-boot graphical environment first). If you replace the HDD/SSD, make sure to get a compatible one to make use of this feature.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 2,
      "content": "The default driver seems to work but cannot discover other devices. You need to either:\n\n1. Download the BCM20702A1-0a5c-21fb.hcd file from broadcom-bt-firmware and place it to the /lib/firmware/brcm directory. This is preferred.\n1. Use broadcom-bt-firmware-gitAUR but you will need to figure out conflicts with already installed firmware - beware that Bluetooth and WLAN are the on the same chip and you might easily break your existing setup.\n\n"
    },
    {
      "title": "Card reader",
      "level": 2,
      "content": "Use rts5227-dkmsAUR.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "The function key controlling the microphone does not work.\n\n"
    },
    {
      "title": "Power management",
      "level": 2,
      "content": "Resume on lid open feature needs to be enabled in the bios / uefi setup: Advanced > Built-in device options > Wake unit from sleep when lid is opened.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- UEFI, GNU/Linux and HP notebooks – problems and how to get it working\n\n- Changing Boot Order on Dual Boot Windows 8 and Ubuntu\n\n- Setting GRUB as the default boot manager on a UEFI-based system\n\n"
    }
  ]
}