{
  "title": "HP Envy x360 13-ar0002nf",
  "url": "https://wiki.archlinux.org/title/HP_Envy_x360_13-ar0002nf",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nGPU | 1002:15d8 | Yes\nWi-Fi | 10ec:b822 | Yes\nBluetooth | 0bda:b00b | Yes\nAudio | 1022:15e3 | Yes\nTouchpad | 06cb:00c9 | Yes\nCamera | 04ca:709d | Yes\nCard reader | 10ec:522a | Yes\nSensors | 1022:15e4 | Yes\nFingerprint reader |  | No\n\nThe HP Envy x360 13-ar0002nf was released in 2019 and has an AMD R5 3500U CPU with an integrated Radeon Vega 8 GPU, 6GB of RAM (8GB - 2GB hardware reserved) and a 1080p display.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "This laptop has Secure Boot enabled by default. To start the installer you need to disable it in the UEFI. Then you can just boot the installer in UEFI mode and just install like a normal UEFI system. You can start using Secure Boot in Linux via Unified Extensible Firmware Interface/Secure Boot.\n\n"
    },
    {
      "title": "Battery and power management",
      "level": 2,
      "content": "Comes with a 53Wh battery, and with Laptop Mode Tools or TLP in use, yields about 10 hours of battery life under light usage. Under heavy load, battery life dwindles to 4 hours. This laptop unfortunately only comes with s2idle (S0) sleep state out of the box, which causes many problems in resuming from sleep. It is however possible to patch the ACPI tables in order to add in S3 sleep, which restores perfect functionality. See this forum post.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "You need to install alsa-tools to use hdajackretask. Within the utility, tick Show unconnected pins, then override the following:\n\n- Pin 0x14 to Internal Speaker (LFE)\n- Pins 0x17 and 0x1e to Internal Speaker\n- Then click Install boot override and reboot\n\nThis is the simplest way to get the exact desired functionality for this model, as it is possible to get a configuration where the top bar fires, but where volume can no longer be controlled with instructions for other models.\n\n"
    },
    {
      "title": "Orientation sensor",
      "level": 2,
      "content": "You currently need to install iio-sensor-proxy and reboot to make the orientation sensor work.\n\n"
    },
    {
      "title": "Touchscreen and stylus",
      "level": 2,
      "content": "Everything works out of the box, both for touch and stylus use. If using a stylus, the system can differentiate between the stylus, and properly does palm rejection if using something like Xournal++. The experience is exactly the same as with Windows. This has only been tested with a HP stylus.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "The laptop comes with the standard Insyde H20 UEFI firmware setup, which might be easier to parse into OCR software. The laptop also has backlit keys with 2 levels of brightness, if necessary. No diagnostic LEDs nor beep codes appear to be present in the firmware.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "It seems like the System Firmware and UEFI dbx fields are correctly supported by fwupd.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Table content:\nKey | Visible? | Marked? | Effect\nFn+F1 | Yes | Yes | No effect (Windows help key)\nFn+F2 | Yes | Yes | XF86MonBrightnessDown\nFn+F3 | Yes | Yes | XF86MonBrightnessUp\nFn+F4 | Yes | Yes | Super+P alias\nFn+F5 | Yes | Yes | Cycles through key backlight brightness\nFn+F6 | Yes | Yes | XF86AudioMute\nFn+F7 | Yes | Yes | XF86AudioLowerVolume\nFn+F8 | Yes | Yes | XF86AudioRaiseVolume\nFn+F9 | Yes | Yes | XF86AudioPrev\nFn+F10 | Yes | Yes | XF86AudioPlay\nFn+F11 | Yes | Yes | XF86AudioNext\nFn+F12 | Yes | Yes | XF86RFKill\n\n"
    }
  ]
}