{
  "title": "Hwdetect",
  "url": "https://wiki.archlinux.org/title/Hwdetect",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- mkinitcpio\n\nhwdetect is a hardware detection script primarily used to load or list modules for use in mkinitcpio.conf. As such, it informs its user about which kernel modules are required to drive the hardware. This is in contrast to many other tools, that only query the hardware, and show raw information, leaving the user with the task to associate that information with the required drivers. The script makes use of information exported by the sysfs subsystem employed by the Linux kernel.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the hwdetect package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "See the hwdetect source, or run hwdetect --help.\n\n"
    },
    {
      "title": "Examples",
      "level": 3,
      "content": "You can use the following method to populate MODULES in mkinitcpio.conf.\n\n```\n# hwdetect --show-modules\n```\n\nThe command should have similar output to the following (system-dependant):\n\n```\nSOUND    : pcspkr\nOTHER    : 8139cp 8139too ac\n```\n\nDepending on what is used, copy the module names to replace the MODULES section in /etc/mkinitcpio.conf. The system should now boot faster, as some, or all, of the hardware detection and modules dependencies calculations is already stated.\n\n- The tool has dedicated output for usage within /etc/mkinitcpio.conf.\n- If any of the module names change because newer kernels have newer modules, or you install new hardware on your computer, you will need to generate the list of modules again and update MODULES.\n\n"
    },
    {
      "title": "Unused modules",
      "level": 3,
      "content": "To generate a list of modules currently not used, use the following script:\n\n```\nawk -F: '{gsub(\"-\",\"_\"); print $2}'); do\n    if ! grep -q \"$hw\" <(printf '%s\\n' \"${modules[@]}\"); then\n        printf '%s\\n' \"$hw\";\n    fi\ndone\n```\n\n"
    },
    {
      "title": "Higher level modules",
      "level": 3,
      "content": "The converse script is also of interest as it lists modules which are higher level, in the sense that they are less related to specific pieces of hardware:\n\n```\nawk -F: '{gsub(\"-\",\"_\"); print $2}'))\n\nfor mod in $(awk '{print $1}' /proc/modules); do\n    if ! grep -q \"$mod\" <(printf '%s\\n' \"${lowlevel[@]}\"); then\n        printf '%s\\n' \"$mod\";\n    fi\ndone\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- lspci, and other hardware detection related tools\n\n"
    }
  ]
}