{
  "title": "I18n (Português)",
  "url": "https://wiki.archlinux.org/title/I18n_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Help:i18n\n- Comunidades internacionais\n\n"
    },
    {
      "title": "Seções padrão",
      "level": 2,
      "content": "Seções e instruções em uma versão traduzida das contidas na página original, em inglês.\n\n"
    },
    {
      "title": "Crie uma nova página e sua tradução",
      "level": 3,
      "content": "Note: **Certifique-se de revisar tudo se você usá-lo.** \n\n"
    },
    {
      "title": "Escolha uma página para traduzir",
      "level": 3,
      "content": "Você pode encontrar páginas para traduzir por meio dos métodos abaixo:\n\n- Pesquise as páginas com as quais você tem mais familiaridade, confira se elas já estão traduzidas.\n- Comece a partir das páginas mais importantes, como installation guide, Main page ou General recommendations, leia-as e abra páginas que têm links diretos lá. Confira se elas estão traduzidas. (já estão traduzidas, são apenas exemplos).\n- Confira as páginas com mais revisões.\n- Ou use a função de página aleatória para encontrar páginas não traduzidas.\n\nVamos usar exatamente esta página como um exemplo: ArchWiki Translation Team (Português) (já está traduzido, mas somente um exemplo hipotético).\n\n"
    },
    {
      "title": "Determine o título da nova página",
      "level": 3,
      "content": "Títulos de páginas de todas as páginas internacionalizadas (i18n) devem seguir Help:i18n (Português)#Títulos de páginas. Se você não tem familiaridade com esta regra, você pode usar o método abaixo para obter o nome da página:\n\n1. No topo da página original em inglês, clique na aba Edit no menu horizontal.\n1. Adicione um link interlíngua para o idioma para o qual você pretende traduzir, mas não salve a página ainda.\n1. Pré-visualize a página com o novo link interlíngua.\n1. Visite o link interlíngua que você criou que você seria levado para ArchWiki Translation Team (Idioma) (abra em nova aba, não feche a página de pré-visualização), sendo \"Idioma\" o nome do idioma associado com a tradução que você está criando. Ao traduzir para Português, seria ArchWiki Translation Team (Português)\n1. Já que a nova página não existe, crie-o clicando em Create no menu horizontal.\n\n"
    },
    {
      "title": "Traduza o conteúdo",
      "level": 3,
      "content": "1. Copie todo o código-fonte da página original em inglês.\n1. Você verá uma editor de texto simples. Cole aqui o código-fonte da página que você copiou anteriormente.\n1. Traduza os links Category para suas versões localizadas. Por exemplo, altere [[Category:ArchWiki]] para [[Category:ArchWiki (Idioma)]]. Para português, seria [[Category:ArchWiki (Português)]]. Veja Help:Categoria para mais informações.\n1. Adicione um link interlíngua para o artigo original, que você está traduzindo. Se você adicionou um link interlíngua para a nova página antes de copiar o código-fonte da página em inglês, remova-o do código-fonte da nova página.\n1. Traduza o texto da página copiada e salve tudo, adicionando um resumo da edição tal como translate [[ArchWiki Translation Team]].\n1. No topo da página traduzida, haverá uma lista de categorias de página que está inserida. Certifique-se que todas as categorias existam, isto é, os links não devem estar vermelhos. Se estiver, crie todas as categorias em falta seguindo os links vermelhos - categorias são criadas da mesma forma que páginas normais.\n1. Adicione Template:StatusTradução à página traduzida. Para saber como suar uso, consulte Template:StatusTradução#Uso.\n1. (opcional) Crie uma outra página com o título traduzido, como Título traduzido de ArchWiki Translation Team, cujo título seja uma versão traduzida de ArchWiki Translation Team (Idioma). Insira #redirect [[ArchWiki Translation Team (Idioma)]] como seu único conteúdo e salva-a.\n\n"
    },
    {
      "title": "Adicione link interlíngua",
      "level": 3,
      "content": "Volte para a página em inglês. Adicione Help:i18n (Português)#Links interlínguas e salve-o desta vez. Se a página for protegia, registre uma solicitação em sua página de discussão. Um mantenedor vai adicionar um link interlíngua para você.\n\n"
    },
    {
      "title": "Mantendo traduções",
      "level": 2,
      "content": "Use Template:StatusTradução para facilitar o acompanhamento de quaisquer novas alterações não traduzidas.\n\nAtenção especial deve ser dada a artigos importantes como o Guia de instalação, Arch Linux e similares. As correções de erros de digitação em inglês, que não fazem parte, por exemplo, de um comando ou de sua saída, não precisam ser aplicadas à sua tradução geralmente podem ser ignoradas com segurança.\n\nAs traduções de novos conteúdos não precisam acontecer imediatamente. Como as reversões podem acontecer com bastante frequência, você pode esperar antes de traduzir edições potencialmente de baixa qualidade ou duvidosas para não gastar tempo em algo que será desfeito eventualmente.\n\n"
    },
    {
      "title": "Lidando com traduções antigas",
      "level": 3,
      "content": "Infelizmente, existem muitas traduções desatualizadas ou insuficientes. Se você encontrar alguma delas, sinalize-as com Template:Traduzir ou Template:Tradução ruim se eles ainda não tiverem sido sinalizados. O primeiro é usado em traduções que ainda não estão criticamente desatualizadas. Altere Template:Traduzir para Template:Tradução ruim se a tradução estiver desatualizada.\n\nSe uma tradução ruim foi sinalizada por um tempo, de preferência 6-12 meses, mas ninguém a atualizou, você pode redirecionar para o artigo em inglês. Você pode redirecionar traduções sem sinalizar primeiro quando elas:\n\n- Contém informações perigosas (inclui, mas não se limita a, comandos destrutivos ou instruções relacionadas à segurança erradas/ausentes).\n- Foram obviamente abandonados desde a sua criação (que tem que ser pelo menos 2 anos atrás, para dar tempo de sobra aos tradutores). Você pode ignorar edições menores posteriores não relacionadas à tradução (edições de bot, alteração de categorias, correção de gramática e assim por diante) para determinar se uma tradução foi abandonada.\n- São antigos (última tradução há mais de 5 anos e está significativamente fora de sincronia com a página em inglês).\n\n- Você pode ignorar edições menores posteriores não relacionadas à tradução (edições de bot, alteração de categorias, correção de gramática e assim por diante) para determinar se uma tradução foi abandonada.\n\nIsso se aplica apenas parcialmente a pequenos artigos onde apenas a versão em inglês raramente é atualizada. Se a tradução estiver boa, mas contiver apenas, por exemplo, um comando desatualizado criticamente, corrija-o em vez de redirecionar.\n\n"
    },
    {
      "title": "Modelos que podem ser traduzidos",
      "level": 3,
      "content": "A tabela a seguir lista todos os modelos que podem ser traduzidos.\n\nNote: **somente** \n\nTable content:\nModelos em inglês | Modelos em português\nModelos de artigos\nTemplate:Related articles start | Template:Related articles start (Português)\nTemplate:Unsupported | Template:Sem suporte\nTemplate:Yes | Template:Sim\nTemplate:No | Template:Não\nTemplate:Tip | Template:Dica\nTemplate:Note | Template:Nota\nTemplate:Warning | Template:Atenção\nTemplate:Dead link | Template:Dead link (Português)\nTemplate:Broken package link | Template:Broken package link (Português)\nTemplate:Broken section link | Template:Broken section link (Português)\nModelos de status de tradução\nTemplate:Bad translation | Template:Tradução ruim\nTemplate:Translateme | Template:Traduzir\nTemplate:TranslationStatus | Template:StatusTradução\nModelos de navegação\nTemplate:Laptops table header | Template:Cabeçalho de tabela de laptops\nTemplate:Laptops navigation | Template:Navegação de laptops\nTemplate:List of applications navigation | Template:Navegação da lista de aplicativos\nTemplate:Package guidelines | Template:Diretrizes de pacotes\nModelos especiais\nTemplate:Cat main | Template:Cat principal\nTemplate:Template | Template:Template (Português)\nTemplate:META Error | Template:META Error (Português)\nTemplate:META Unexplained Status Template | Template:META Unexplained Status Template (Português)\nTemplate:Comment | Template:Comentário\nTemplate:Committed identity | Template:Identidade confirmada\nTemplate:Unsigned | Template:Não assinou\n\n"
    },
    {
      "title": "Modelos que devem ser omitidos em traduções",
      "level": 2,
      "content": "Quando a página ou seção é sinalizada com Template:Accuracy, Template:Style, Template:Archive, Template:Remove ou Template:Out of date, não traduza páginas/seções em questão até que os problemas incorretos sejam corrigidos e o modelo removido.\n\nSe você vir Template:Expansion, Template:Merge, Template:Move ou Template:Redirect você pode traduzir com segurança a página, mas não copie estes modelos para o artigo traduzido.\n\nSe você vir Template:Broken package link, Template:Broken section link ou Template:Dead link, não copie esses modelos para o artigo traduzido. Corrija-os no texto original e, em seguida, copie e/ou traduza com links corrigidos ou omita a frase ou seção inteira referente a eles durante a tradução.\n\n"
    },
    {
      "title": "Tradução do AUR",
      "level": 3,
      "content": "É possível traduzir as mensagens da interface web do AUR, o repositório de usuário do Arch. Instruções sobre como traduzir podem ser vistas aqui.\n\nTradutores: Rafael Fontenelle\n\nRevisores:\n\n"
    },
    {
      "title": "Tradução de libalpm, pacman, pacman scripts",
      "level": 3,
      "content": "É possível traduzir as mensagens dos executáveis pacman, makepkg e outros pedaços do gerenciamento de pacotes do Arch Linux. Informações sobre como traduzir podem ser vistas aqui\n\nTradutores: Rafael Fontenelle\n\nRevisores:\n\n"
    },
    {
      "title": "Tradução de páginas man",
      "level": 3,
      "content": "Não há, oficialmente, tradução de páginas man de projetos do Arch Linux. Porém, há um projeto chamado manpages-l10n que trabalha exclusivamente com tradução de páginas man para vários projetos e várias distros, incluindo as dos projetos do Arch Linux (ex.: do pacman). Traduções são feitas em arquivos PO (Gettext).\n\n"
    },
    {
      "title": "Tradução do ArchWiki",
      "level": 3,
      "content": "Aqui você encontra uma relação de tradutores que contribuem, ou já contribuíram em algum momento, para o ArchWiki. Se seu nome não consta, mas deveria, sinta-se à vontade para adicionar.\n\nTable content:\nNome do tradutor | Nome de usuário no ArchWiki\nAlbino Biasutti Neto | bino28\nBruno Alexander Brito dos Santos | Bruno Brito\nCabel | Mxzcabel\nCainã Costa | CainaCosta\nClécio Oliveira | Cleciooliveira\nDenis Falqueto | DenisFalqueto\nDione Batista | StrykeONE\nEduardo Lopes | duca\nEstêvão Valadão | Estêvão\nFotanus | fotanus\nFranklin Souza | FranklinTech\nGilfran Ribeiro | Gilfran\nGuilherme Costa | GuilhermeCosta\nGuilherme Nanini | Gnanini\nGuitar_brasil | guitar_brasil\nHenrique Rodrigues | Rickxyz\nIsaac Vicente | zak\nJean Lima Andrade | jyeno\nJeremias Alves Queiroz | Jere2001\nKalib | kalib\nLeandro Costa | lokidarkeden\nLeandro Inácio | LeandroInacio\nLeandro Pincini | redpill\nLuís Gabriel | lampih\nMarcelo Ari Wiebbelling | Hrevil wiki\nMarcos Ferreira | M4rQu1Nh0S\nMaurício de Lima | Mauriciodelima\nNando correa | lfercorrea\nPianista | Pianista\nPhillipe Smitux | Phillipe\nRafael Fontenelle | Josephgbr\nRobson Cardoso | cylax\nRodrigo Dutra | Rodrigo_Dutra\nRodrigo Lima | lima87\nTati | Thatysx\nTomas Schertel | tschertel\nTozedascoves | Tozedascoves\nVictor Viana | nickneo e Victor\nXitus | Xitus\n\n"
    }
  ]
}