{
  "title": "I2P (Русский)",
  "url": "https://wiki.archlinux.org/title/I2P_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Tor (Русский)\n- GNUnet\n- Freenet\n\nI2P — анонимная сеть, предоставляющая чувствительным в плане конфиденциальности приложениям простой способ создания безопасных соединений. Пересылаемые данные \"заворачиваются\" в несколько слоёв шифрования и передаются по сети, которая является одновременно распределённой и динамической, без доверенных участников. Через I2P может работать целый ряд приложений, в том числе электронная почта, peer-to-peer программы, IRC-чаты и другие.\n\nАктуальны две реализации I2P:\n\n- I2P — Написано на Java. Изначальная разработка. Интерактивный и дружелюбный Web-GUI интерфейс со встроенным почтовым клиентом (SusiMail) и торрент клиентом (I2PShark).\n- i2pd — Написано на C++. Альтернативная разработка. Взаимодействие возможно посредством интерфейса командной строки (Command-Line-Interface) или конфигурационных файлов. Минималистичный, лёгкий, быстрый.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Пакет i2pd содержит демон, который написан на C++ и хорошо подходит для систем с ограниченными ресурсами. Также доступна разрабатываемая версия i2pd-gitAUR.\n\nСтандартный I2P-набор доступен в пакетах i2pAUR и i2p-binAUR. Обоим для работы необходима среда выполнения Java, например, OpenJDK.\n\nНа сайте проекта I2P можно скачать скомпилированный бинарный файл, который может быть установлен в домашнем каталоге пользователя и использован через интерфейс командной строки (Command-Line-Interface). В этом случае I2P будет обновляться автоматически через сеть I2P.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Если вы установили i2pd, запустите и по желанию включите службу i2pd.service. Настройки демона находятся в файле /etc/i2pd/i2pd.conf. Если же вы установили i2pAUR, то вместо этого запустите и по желанию включите службу i2prouter.service.\n\nОткройте браузер и посетите приветственную страницу I2P по адресу 127.0.0.1:7070 (для демона) или 127.0.0.1:7657 (для официальной версии, см. FAQ). Отсюда можно перейти к настройкам I2P, статистике и ссылкам на I2P-сайты. Учтите, что сайты I2P будут недоступны некоторое время — демон должен сначала \"подгрузить\" сеть, что может занять несколько минут.\n\nЧтобы посещать I2P-сайты, настройте браузер использовать локальный прокси:\n\n```\nHTTP  127.0.0.1 4444\nSOCKS 127.0.0.1 4447\n```\n\n"
    },
    {
      "title": "Создание eepsite",
      "level": 2,
      "content": "Создание I2P-сайта (т.н. eepsite) описано в инструкции. Учтите, что под домашним каталогом понимается домашний каталог пользователя i2p, /opt/i2p (см., например, файл i2p.install в AUR).\n\nВ случае демона изучите документацию от разработчиков.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- I2P в Википедии\n- Домашняя страница I2P\n- I2P FAQ\n- Домашняя страница i2pd\n- Документация i2pd\n\n"
    }
  ]
}