{
  "title": "I3 (Português)",
  "url": "https://wiki.archlinux.org/title/I3_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Comparação de gerenciadores de janela tiling\n- Gerenciador de janela\n\ni3 é um gerenciador de janela tiling dinâmico inspirado no wmii que visa principalmente a desenvolvedores e usuários avançados.\n\nOs objetivos estabelecidos para o i3 incluem documentação clara, suporte adequado a vários monitores, uma estrutura em árvore para janelas e modos diferentes, como no vim.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "O i3 pode ser instalado com o pacote i3-wm.\n\nO i3 é um grupo de pacotes e também está disponível. Inclui o gerenciador de janelas, um programa bloqueador de tela e dois programas que escrevem uma linha de status para o i3bar através da sua saída (stdout).\n\n"
    },
    {
      "title": "Pelo tty",
      "level": 3,
      "content": "Execute i3 com xinit.\n\n"
    },
    {
      "title": "Gerenciador de exibição",
      "level": 3,
      "content": "i3-wm inclui um arquivo i3.desktop no Xsession que o inicia. i3-with-shmlog.desktop habilita logs (útil para depuração). i3-gnomeAUR integra o i3 ao GNOME.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Veja a documentação oficial para mais informações, principalmente o Guia do usuário i3.\n\n"
    },
    {
      "title": "Atalhos",
      "level": 3,
      "content": "No i3, os comandos são chamados com uma chave modificadora, referida como $mod. Isto é Alt (Mod1) por padrão, com Super (Mod4) sendo uma alternativa popular. Super é a tecla geralmente representada em um teclado como um ícone do Windows ou em um teclado da Apple como uma tecla de comando.\n\nVeja a Carta de referência do i3 e Usando o i3 para as configurações padrão. Veja Keyboard bindings para adição de novos atalhos.\n\nUsuários de layouts de teclado que não sejam Qwerty podem querer contornar o \"assistente de configuração\" como Descrito abaixo.\n\nSe alternar entre vários gerenciadores de janelas ou ambientes de desktop, considere usar sxhkd ou outro programa que não depende do ambiente para gerenciar atalhos. Mais informações podem ser encontradas em Atalhos de teclado#Xorg.\n\n"
    },
    {
      "title": "Contêineres e layouts",
      "level": 3,
      "content": "O i3 gerencia janelas em uma estrutura de árvore, com contêineres como blocos de construção. Essa estrutura se ramifica com divisões horizontais ou verticais. Os contêineres são lado a lado por padrão, mas podem ser definidos como tabbed or stacking layouts, bem como flutuante (como para janelas de diálogo). Janelas flutuantes estão sempre no topo.\n\nVeja i3 Tree e Containers and the tree data structure para detalhes.\n\n"
    },
    {
      "title": "Iniciador de aplicativos",
      "level": 3,
      "content": "O i3 usa dmenu como iniciador de aplicativos, associado por padrão a $mod+d. Como é uma dependência opcional dmenu deve primeiro ser instalado antes que esta funcionalidade possa ser usada.\n\nO pacote i3-wm contém i3-dmenu-desktop, Perl wrapper para dmenu que usa entradas de desktop para criar uma lista de todos os aplicativos instalados. Como alternativa, o pacote j4-dmenu-desktop-gitAUR pode ser usado.\n\nrofi é um popular substituto do dmenu, além de também listar entradas desktop.\n\n"
    },
    {
      "title": "KRunner como iniciador de aplicativos no KDE Plasma/i3",
      "level": 4,
      "content": "É possível ter executar o i3 junto com o KDE Plasma como visto aqui: KDE#Usar um gerenciador de janela diferente\n\nAo executar o Plasma com KDEWM=/usr/bin/i3, pode-se definir o KRunner como lançador de aplicativos alternativo com $mod+d adicionando o seguinte na configuração do i3 :\n\n```\n~/.config/i3/config\n```\n\n```\nset $menu --no-startup-id qdbus org.kde.krunner /App display\nbindsym $mod+d exec $menu\n```\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Veja Configurando o i3 para detalhes. O restante deste artigo pressupõe que o arquivo de configuração do i3 está na pasta ~/.config/.\n\n"
    },
    {
      "title": "Assistente de configuração e layouts de teclado alternativos",
      "level": 3,
      "content": "Quando o i3 é iniciado pela primeira vez, ele oferece a execução do assistente de configuração i3-config-wizard. Essa ferramenta cria ~/.config/i3/config reescrevendo um arquivo de configuração de modelo em /etc/i3/config.keycodes. Faz duas modificações no modelo padrão:\n\n1. Ele solicita ao usuário que escolha uma chave modificadora padrão, que será adicionada ao modelo como uma única linha, como set $mod Mod1; e\n1. ele substitui todas as linhas bindcode por linhas bindsym correspondentes ao layout de teclado atual do usuário.\n\nStep 2 foi projetado para garantir que os quatro atalhos de navegação, j, k, l e ; em um teclado Qwerty, serão mapeados para as keysyms de teclado com o mesmo local, por exemplo h, t, n, s em um teclado Dvorak. O efeito colateral dessa mágica é que até quinze outras keysyms de teclado podem ser remapeadas de maneira a interromper a mnemônica - de modo que, para um usuário do Dvorak, \"reiniciar\" esteja associado a $mod1+p ao invés de $mod1+r, \"dividir horizontalmente\" está associado a $mod1+d ao invés de $mod1+h, e assim por diante.\n\nPortanto, os usuários de layouts de teclado alternativos que desejam atalhos de teclas que correspondam àqueles fornecidos nos tutoriais, podem preferir contornar o \"assistente de configuração\". Isso pode ser feito apenas copiando /etc/i3/config para dentro do ~/.config/i3/config (ou ~/.i3/config), e editando esse arquivo.\n\nObserve que também é possível uma configuração baseada em código, por exemplo, para usuários que frequentemente alternam entre layouts de teclado, mas desejam que os atalhos do i3 permaneçam os mesmos.\n\n"
    },
    {
      "title": "Inicialização automática",
      "level": 3,
      "content": "Adicione um comando exec no arquivo ~/.config/i3/config para executar um comando na inicialização. Por exemplo:\n\n```\nexec terminator\n```\n\nUsando um comando exec_always garantirá que o comando também seja executado sempre que o i3 for reiniciado.\n\nAlternativamente, você pode usar XDG Autostart.\n\n"
    },
    {
      "title": "i3bar",
      "level": 3,
      "content": "Além de mostrar informações do workspace, o i3bar pode atuar como uma entrada para o i3status ou uma alternativa, como as mencionadas na próxima seção. Por exemplo:\n\n```\n~/.config/i3/config\n```\n\n```\nbar {\n    output            LVDS1\n    status_command    i3status\n    position          top\n    mode              hide\n    workspace_buttons yes\n    tray_output       none\n\n    font -misc-fixed-medium-r-normal--13-120-75-75-C-70-iso10646-1\n\n    colors {\n        background #000000\n        statusline #ffffff\n\n        focused_workspace  #ffffff #285577\n        active_workspace   #ffffff #333333\n        inactive_workspace #888888 #222222\n        urgent_workspace   #ffffff #900000\n    }\n}\n```\n\nVeja o Configurando o i3bar para detalhes.\n\n"
    },
    {
      "title": "Alternativas ao i3bar",
      "level": 4,
      "content": "Alguns usuários podem preferir painéis como os fornecidos pelas Ambientes de desktop. Isso pode ser realizado dentro do i3 iniciando o aplicativo de painel escolhido durante a inicialização.\n\nPor exemplo, para usar o painel do Xfce (xfce4-panel), adicione a seguinte linha em qualquer lugar ~/.config/i3/config:\n\n```\nexec --no-startup-id xfce4-panel --disable-wm-check\n```\n\nO i3bar pode ser desativado comentando o bar{ } dentro da ~/.config/i3/config, ou definindo um atalho de teclado para alternar a barra:\n\n```\n~/.config/i3/config\n```\n\n```\n# alternador da barra, esconde e mostra\nbindsym $mod+m bar mode toggle\n```\n\nSubstituições independentes do ambiente de desktop estão listadas abaixo:\n\n- polybar — Uma ferramenta rápida e fácil de usar para criar barras de status.\n\n- excalibar — Barra de status leve e personalizável, escrita em C.\n\n"
    },
    {
      "title": "i3status",
      "level": 3,
      "content": "Copie os arquivos de configuração padrão para o diretório inicial:\n\n```\n$ cp /etc/i3status.conf ~/.config/i3status/config\n```\n\nNem todos os plug-ins estão definidos na configuração padrão e alguns valores de configuração podem ser inválidos para o seu sistema, portanto, eles precisam ser atualizados de acordo. Veja i3status(1) para detalhes.\n\n"
    },
    {
      "title": "Alternativas ao i3status",
      "level": 4,
      "content": "- conky — Monitor de sistema altamente extensível. Para uso com o i3bar, veja esse tutorial\n\n- i3blocks — Extensível via scripts de shell. Ele pode manipular eventos de clique, interrupções e definição de intervalos de atualização por bloco.\n\n- i3pystatus — Barra de status extensível do Python 3 com muitos plugins e opções de configuração por padrão.\n\n- j4status — Fornece uma linha de status, configurável via plugins e escrita em C. Plugins extras são fornecidos por j4status-plugins-gitAUR[link quebrado: package not found].\n\n- goi3bar — Substituição do i3status escrita em Go. Arquivo de configuração controlado por vários plugins, opções de simultaneidade e suporte avançado a plugins.\n\n- goblocks — Substituição rápida e leve do i3status, escrita em Go.\n\n- bumblebee-status — Gerador de barra de status Python com capacidade de tema.\n\n- ty3status — Substituição do i3status escrita em TypeScript. Construído com suporte de primeira classe para blocos javascript.\n\n- i3status-rust — Substituição altamente eficiente e rica em recursos, escrita em Rust. Pode lidar com atualizações push, intervalos de atualização individuais, eventos temáticos e de clique\n\n- Barista — Barista é um substituto do i3status escrito em Go.\n\n"
    },
    {
      "title": "Wrappers do i3status",
      "level": 4,
      "content": "- i3cat — Baseado em go wrapper que pode concatenar entradas de várias fontes externas. Ele pode manipular eventos de clique e encaminhar sinais especificados pelo usuário para seus subprocessos.\n\n- py3status — Um wrapper extensível do i3status escrito em Python.\n\n- YaGoStatus — Mais uma substituição do i3status escrita em Go.\n\n"
    },
    {
      "title": "Fontes icônicas na barra de status",
      "level": 4,
      "content": "O suporte para fontes icônicas é integrado desde i3 versão 4.20.\n\n- ttf-font-awesome — Ícones vetoriais escaláveis que podem ser personalizados com CSS. Uma folha de dicas mostra o ponto Unicode para cada glifo.\n\n- ttf-font-icons — Mix sem sobreposição e de tamanho consistente de Awesome e Ionicons. Isso também evita pequenas sobreposições entre DejaVu Sans e Awesome.\n\n- ttf-ionicons — A fonte de ícone premium para o Ionic Framework.\n\nPara combinar fontes, defina uma sequência de fallback de fontes no seu arquivo de configuração, separando fontes com , igual a:\n\n```\n~/.config/i3/config\n```\n\n```\nbar {\n  ...\n  font pango:DejaVu Sans Mono, Icons 8\n  ...\n}\n```\n\nEm concordância com sintaxe do pango, o tamanho da fonte é especificado apenas uma vez, no final da lista separada por vírgula de famílias de fontes. Definir um tamanho para cada fonte faria com que todos, exceto a última, fossem ignorados.\n\nAdicione ícones às strings de formato em ~/.config/i3status/config usando os números unicode fornecidos nas folhas de dicas acima. O método de entrada varia entre os editores de texto. Por exemplo, para inserir o ícone do \"coração\" (unicode número f004):\n\n- em vários editores de texto GUI (por exemplo. gedit, Leafpad) e terminais (por exemplo. GNOME Terminal, xfce4-terminal): Ctrl+Shift+u, f004, Enter\n- no Emacs: C-x, 8, RET, f004, RET\n- no Vim (no modo de inserção): Ctrl+v, uf004\n- no urxvt: enquanto aguarda Ctrl+Shift, digite f004\n\n"
    },
    {
      "title": "Emulador de terminal",
      "level": 3,
      "content": "Por padrão, ao pressionar $mod+Enter lança o i3-sensible-terminal que é um script que chama um terminal. Veja i3-sensible-terminal(1) para os terminais do pedido são chamados.\n\nPara iniciar um terminal da sua escolha, modifique esta linha em ~/.config/i3/config:\n\n```\nbindsym $mod+Return exec i3-sensible-terminal\n```\n\nComo alternativa, defina a variável de ambiente $TERMINAL.\n\n"
    },
    {
      "title": "Desativar clique no título",
      "level": 3,
      "content": "Adicione bindsym button1 nop para não selecionar uma janela quando você clica em seu quadro de título. Útil se o seu layout padrão estiver com guias e você frequentemente perder as guias do i3 em vez de algo em um aplicativo.\n\n"
    },
    {
      "title": "Ir para a janela aberta",
      "level": 3,
      "content": "- quickswitch-i3 — Utilitário Python para alterar rapidamente e localizar janelas no i3\n\n- i3-wm-scripts — Procure e pule para janelas com nomes específicos correspondentes a regexp\n\n- rofi — Pesquise e pule para abrir a janela do scratchpad\n\n- i3-easyfocus — Focar e selecionar janelas no i3\n\n- wmfocus — Focar e selecionar janelas no i3 e outros gerenciadores de janelas\n\n- i3-cycle-focus — Fornece uma funcionalidade Alt+Tab para o i3\n\n- i3-winmotion — Focar e selecionar janelas visíveis em i3\n\n"
    },
    {
      "title": "Ir para a janela urgente",
      "level": 3,
      "content": "Adicione ao ~/.config/i3/config: [1]\n\n```\nbindsym $mod+x [urgent=latest] focus\n```\n\n"
    },
    {
      "title": "Salvar e restaurar o layout da janela",
      "level": 3,
      "content": "A partir da versão 4.8, o i3 pode salvar e restaurar layouts de workspace. Para fazer isso, são necessários os seguintes pacotes: perl-anyevent-i3 e perl-json-xs.\n\n"
    },
    {
      "title": "Salvar o layout atual da janela de um único workspace",
      "level": 4,
      "content": "Para salvar o layout atual da janela, siga estas etapas:\n\n1. Primeiro, execute vários comandos para abrir janelas em um workspace preferido e redimensione-as, se necessário. Certifique-se de anotar cada comando executado para cada janela.\n1. Agora, em um novo workspace, abra um terminal e execute o seguinte: $ i3-save-tree --workspace N > ~/.config/i3/workspace_N.json onde N é o número do workspace preferido. Isso salvará o layout atual do workspace N no arquivo ~/.config/i3/workspace_N.json.\n1. O arquivo recém-criado precisa ser editado. Isso pode ser feito automaticamente com o seguinte comando: $ sed -i 's|^\\(\\s*\\)// \"|\\1\"|g; /^\\s*\\/\\//d' ~/.config/i3/workspace_N.json\n\n```\n$ i3-save-tree --workspace N > ~/.config/i3/workspace_N.json\n```\n\n```\n$ sed -i 's|^\\(\\s*\\)// \"|\\1\"|g; /^\\s*\\/\\//d' ~/.config/i3/workspace_N.json\n```\n\n"
    },
    {
      "title": "Restaurar o layout da janela do workspace",
      "level": 4,
      "content": "Há duas maneiras de restaurar o layout de workspace: escrevendo um script ou editando ~/.config/i3/config para carregar automaticamente o layout. Nesta seção, apenas o primeiro caso será considerado, consulte a documentação oficial para o segundo caso.\n\nPara restaurar o layout salvo na seção anterior, escreva um arquivo chamado load_layout.sh com o seguinte conteúdo:\n\n- As linhas de partida:\n\n```\n~/load_layout.sh\n```\n\n```\n#!/bin/sh\ni3-msg \"workspace M; append_layout ~/.config/i3/workspace_N.json\"\n```\n\nonde M é o número do workspace na qual você deseja carregar o layout salvo anteriormente e N é o número do workspace salvo na seção anterior.\n\n- E os comandos usados na seção anterior para obter as janelas preferidas, mas entre parênteses e com um e comercial acrescentado antes dos últimos parênteses.\n\nPor exemplo, se o layout salvo conter três janelas uxterm:\n\n```\n~/load_layout.sh\n```\n\n```\n#!/bin/sh\n\n# Primeiro adicionamos o layout salvo do workspace N para o workspace M\ni3-msg \"workspace M; append_layout ~/.config/i3/workspace_N.json\"\n\n# E finalmente preenchemos os containers com os programas que eles tinham\n(uxterm &)\n(uxterm &)\n(uxterm &)\n```\n\nEm seguida, defina o arquivo como executável. Finalmente, o layout do workspace N pode ser carregado no workspace M executando:\n\n```\n$ ~/load_layout.sh\n```\n\n"
    },
    {
      "title": "Contêineres do scratchpad",
      "level": 3,
      "content": "Por padrão, scratchpads contêm apenas uma única janela. No entanto, contêineres também podem ser transformados em um scratchpad.\n\nCrie um novo contêiner (por exemplo, Mod+Enter), divida-o (Mod+v) e crie outro contêiner. Selecione o contêiner pai (Mod+a), divida na direção oposta (Mod+h) e crie um container novamente.\n\nFoque no primeiro contêiner (selecionando o contêiner pai caso necessário), faça a janela flutuar (Mod+Shift+Space) e mova para o scratchpad (Mod+Shift+-). Agora você pode dividir contêineres conforme preferência.\n\nVeja também [2] para vários scratchpads.\n\n"
    },
    {
      "title": "Proteção de tela e gerenciamento de energia",
      "level": 3,
      "content": "Com o Gestão de energia#xss-lock você pode registrar um bloqueador de tela para o sua sessão do i3. A opção -time com xautolock bloqueia a tela após um determinado período de tempo:\n\n```\nxautolock -time 10 -locker \"i3lock -i 'background_image.png'\" &\n```\n\nUm arquivo de serviço do systemd pode ser usado para bloquear a tela antes que o sistema seja enviado para o estado de suspensão ou hibernação. Veja Suspender e hibernar#Units do systemd customizáveis. Observe que o i3lock exige que o tipo de serviço seja forking.\n\nVeja também DPMS.\n\nOutra opção é usar xidlehookAUR com betterlockscreenAUR ou outro protetor de tela. xidlehook é um substituto do xautolock escrito em Rust, mas com algumas funcionalidades adicionais. Incluindo a opção para desabilitar o travamento da tela quando o som está tocando ou quando a tela está no modo tela cheia. A opção --timer é dada em segundos:\n\n```\nxidlehook --not-when-audio --not-when-fullscreen --timer 360 \"betterlockscreen -l dim\" \"\" &\n```\n\n"
    },
    {
      "title": "Desligar, reiniciar e bloquear a tela",
      "level": 3,
      "content": "Combinações de teclas para desligar, reiniciar e bloquear a tela podem ser adicionadas ao ~/.config/i3/config. O exemplo abaixo supõe que você tenha polkit instalado para permitir que usuários sem privilégios executem comandos de gerenciamento de energia.\n\n```\nset $Locker i3lock && sleep 1\n\nset $mode_system System (l) lock, (e) logout, (s) suspend, (h) hibernate, (r) reboot, (Shift+s) shutdown\nmode \"$mode_system\" {\n    bindsym l exec --no-startup-id $Locker, mode \"default\"\n    bindsym e exec --no-startup-id i3-msg exit, mode \"default\"\n    bindsym s exec --no-startup-id $Locker && systemctl suspend, mode \"default\"\n    bindsym h exec --no-startup-id $Locker && systemctl hibernate, mode \"default\"\n    bindsym r exec --no-startup-id systemctl reboot, mode \"default\"\n    bindsym Shift+s exec --no-startup-id systemctl poweroff -i, mode \"default\"\n\n    # de volta ao normal: Enter ou Escape\n    bindsym Return mode \"default\"\n    bindsym Escape mode \"default\"\n}\n\nbindsym $mod+Pause mode \"$mode_system\"\n```\n\nDepois de concluído, você receberá um aviso sempre que pressionar $mod+pause. Para um comportamento mais complexo, use um script separado e consulte-o no modo [3]\n\n- sleep 1 adiciona um pequeno atraso para evitar possíveis condições de corrida com suspensão [4]\n- O argumento -i do systemctl poweroff desliga a máquina mesmo que outros usuários estejam logados (isso requer polkit), ou quando logind presume (erroneamente). [5]\n\nPara uma lista de bloqueadores de tela alternativos, veja List of applications/Security#Screen lockers.\n\n"
    },
    {
      "title": "Engolir a janela do terminal",
      "level": 3,
      "content": "Parecido com o dwm, i3 pode \"engolir\" (swallow) a janela atual do terminal com a nova janela GUI lançada a partir dele. Isto pode ser feito com o uso do pacote i3-swallow-gitAUR.\n\nPor exemplo, para deixar o mpv engolir o terminal que o abriu:\n\n```\n$ swallow mpv video.mp4\n```\n\nAlternativamente, a ação de enngolir do terminal pode ser simulada usando um container em tabbed ou stacked para ocultar a janela do terminal quando você não estiver usando. No entanto, isso vem com a desvantagem de sempre ter uma lista de janelas na parte superior do contêiner.\n\n"
    },
    {
      "title": "Gerenciamento manual de monitores externos",
      "level": 3,
      "content": "Graças ao xrandr existem várias maneiras de gerenciar facilmente os monitores dos sistemas. O exemplo abaixo o integra no arquivo de configuração do i3, e se comporta como na seção Gerenciamento de energia acima.\n\nAqui, um laptop com saídas VGA e HDMI usará uma seleção de menu para ativar/desativar:\n\n```\n## Gerenciamento manual de monitores externos\n# Defina os atalhos e o que eles fazem\nset $mode_display Ext Screen (v) VGA ON, (h) HDMI ON, (x) VGA OFF, (y) HDMI OFF\nmode \"$mode_display\" {\n    bindsym v exec --no-startup-id xrandr --output VGA1 --auto --right-of LVDS1, mode \"default\"\n    bindsym h exec --no-startup-id xrandr --output HDMI1 --auto --right-of LVDS1, mode \"default\"\n    bindsym x exec --no-startup-id xrandr --output VGA1 --auto --off, mode \"default\"\n    bindsym y exec --no-startup-id xrandr --output HDMI1 --auto --off, mode \"default\"\n\n    # de volta ao normal: Enter ou Escape\n    bindsym Return mode \"default\"\n    bindsym Escape mode \"default\"\n}\n# Declare aqui o atalho para exibir o menu de seleção de exibição\nbindsym $mod+x mode \"$mode_display\"\n```\n\nQualquer janela que ainda esteja aberta em uma tela desligada retornará automaticamente à tela ativa restante.\n\nA maneira mais simples de determinar os nomes dos seus dispositivos é conectar o dispositivo que você deseja usar e executar:\n\n```\n$ xrandr --query\n```\n\nque produzirá os dispositivos reconhecidos disponíveis e seus nomes no sistema para definir seu arquivo de configuração adequadamente.\n\nConsulte a página página de manual do xrandr para obter a lista completa de opções disponíveis, o userguide do i3 e/ou o FAQ do i3 no reddit para mais informações.\n\n"
    },
    {
      "title": "Navegação na web com guias ou empilhadas",
      "level": 3,
      "content": "Alguns navegadores da Web intencionalmente não implementam guias, pois o gerenciamento de guias é considerado uma tarefa do gerenciador de janelas, não uma tarefa do navegador.\n\nPara deixar o i3 gerenciar seu navegador da web sem guias, neste exemplo para o uzbl, adicione a seguinte linha ao seu ~/.config/i3/config\n\n```\nfor_window [class=\"Uzbl-core\"] focus child, layout stacking, focus\n```\n\nIsso é para navegação na Web empilhada, o que significa que as janelas serão mostradas verticalmente. A vantagem sobre a navegação com guias é que os títulos das janelas são totalmente visíveis, mesmo que muitas janelas do navegador estejam abertas.\n\nSe preferir a navegação com guias, com as janelas na direção horizontal ('tabs'), use\n\n```\nfor_window [class=\"Uzbl-core\"] focus child, layout tabbed, focus\n```\n\n"
    },
    {
      "title": "Variáveis de workspaces",
      "level": 3,
      "content": "Como os workspaces são definidos várias vezes no i3, atribuir variáveis de workspaces pode ser útil. Por exemplo:\n\n```\nset $WS1 term\nset $WS2 web\nset $WS3 misc\nset $WS4 media\nset $WS5 code\n```\n\nEm seguida, substitua os nomes do workspace por suas variáveis correspondentes:\n\n```\nbindsym $mod+1          workspace $WS1\n...\nbindsym $mod+Shift+1    move container to workspace $WS1\n```\n\nVeja Changing named workspaces para mais informações.\n\n"
    },
    {
      "title": "Manuseio correto de diálogos flutuantes",
      "level": 3,
      "content": "Enquanto o diálogo deve abrir no modo flutuante por padrão [6], muitos ainda abrem no modo lado a lado. Para alterar esse comportamento, verifique a caixa de diálogo WM_WINDOW_ROLE com xorg-xprop e adicione as regras corretas para ~/.i3/config (usando pcre syntax):\n\n```\nfor_window [window_role=\"pop-up\"] floating enable\nfor_window [window_role=\"task_dialog\"] floating enable\n```\n\nVocê também pode usar regras de título e expressões regulares:\n\n```\nfor_window [title=\"Preferences$\"] floating enable\n```\n\nou WM_CLASS:\n\n```\nfor_window [class=\"(?i)mplayer\"] floating enable\n```\n\n"
    },
    {
      "title": "Velocidade de download/upload da rede na barra de status",
      "level": 3,
      "content": "Você pode adaptar esse script da upstream. Para isso,\n\n- renomeie as duas placas de rede de acordo com o seu sistema (use ip addr)\n- encontre-os em /sys/devices substitua-os adequadamente:\n\n```\n$ find /sys/devices -name network_interface\n```\n\nAgora, basta salvar o script em um local adequado (por exemplo, ~/.config/i3) e aponte seu programa de status para ele.\n\n"
    },
    {
      "title": "Alternar automaticamente a orientação de divisão horizontal/vertical da janela",
      "level": 3,
      "content": "O pacote autotiling pode ser usado para alternar automaticamente a orientação de janela horizontal/vertical, resultando em um comportamento semelhante ao lado a lado em espiral do bspwm. Após a instalação, adicione o seguinte ao seu ~/.config/i3/config e recarregue o i3.\n\n```\nexec_always --no-startup-id autotiling\n```\n\n"
    },
    {
      "title": "Geral",
      "level": 3,
      "content": "Em muitos casos, os bugs são corrigidos nas versões de desenvolvimento i3-gitAUR e i3status-gitAUR, e o upstream solicitará a reprodução de erros nesta versão. [7] Veja também Debugging/Getting traces#Compilation options.\n\n"
    },
    {
      "title": "Nova instalação exibe apenas texto ilegível",
      "level": 3,
      "content": "Certifique-se de que você instalou um conjunto de fontes TrueType após a instalação.\n\n"
    },
    {
      "title": "Os botões na barra de mensagens do i3 não funcionam",
      "level": 3,
      "content": "Botões como \"Edit config\" no i3-nagbar chamam o i3-sensible-terminal, então verifique se o seu emulador de terminal é reconhecido pelo i3.\n\n"
    },
    {
      "title": "Linha defeituosa envolve no terminal lado a lado",
      "level": 3,
      "content": "O i3 v4.3 e versões posteriores ignoram sugestões de incremento de tamanho para janelas lado a lado [8]. Isso pode fazer com que terminais enrolem as linhas prematuramente, entre outros problemas. Como uma solução alternativa, deixe a janela incorreta flutuando antes de colocá-la novamente em mosaico.\n\n"
    },
    {
      "title": "O cursor do mouse permanece no modo de espera",
      "level": 3,
      "content": "Ao iniciar um script ou aplicativo que não suporta notificações de inicialização, o cursor do mouse permanece no modo ocupado/relógio/relógio por 60 segundos.\n\nPara resolver isso para um aplicativo específico, use o parâmetro --no-startup-id, por exemplo:\n\n```\nexec --no-startup-id ~/script\nbindsym $mod+d exec --no-startup-id dmenu_run\n```\n\nPara desativar esta animação globalmente, veja Temas de cursor#Crie links para cursores faltando.\n\n"
    },
    {
      "title": "Atalhos que não respondem",
      "level": 3,
      "content": "Algumas ferramentas como o scrot podem não funcionar quando usados com um atalho comum (executado após pressionar a tecla). Nesses casos, execute comandos após o soltar a tecla com o argumento --release [9]:\n\n```\nbindsym --release Print exec --no-startup-id scrot\nbindsym --release Shift+Print exec --no-startup-id scrot -s\n```\n\n"
    },
    {
      "title": "Tearing",
      "level": 3,
      "content": "O i3 não implementa adequadamente o buffer duplo [10] portanto, tearing ou tremulações podem ocorrer. Veja picom.\n\n"
    },
    {
      "title": "Ícones invisíveis na barra de status",
      "level": 3,
      "content": "A diretiva tray_output primary pode exigir a configuração de uma saída primária com o xrandr, especificando a saída explicitamente ou simplesmente removendo esta diretiva. [11] Veja xrandr (Português) para detalhes. A configuração padrão criada pelo i3-config-wizard não adiciona mais essa diretiva à configuração do i3 4.12.\n\n"
    },
    {
      "title": "Workspace padrão para o Spotify",
      "level": 3,
      "content": "Para atribuir um workspace padrão para janelas do spotify você não pode usar o comando padrão assign, você deve usar um comando for_window, como\n\n```\n~/.config/i3/config\n```\n\n```\n...\nfor_window [class=\"Spotify\"] move container to workspace $ws10\n```\n\nPara garantir que for_window não mova a janela se já estiver em $ws10, pode-se usar move --no-auto-back-and-forth.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Site oficial\n- Funtoo:I3 Tiling Window Manager\n- Código-fonte do i3\n- i3-extras - Coleção de scripts e patches\n- i3ipc-glib - Uma bibilioteca para extensões do i3\n- i3ipc-ruby - Uma biblioteca melhorada para extensões do i3 em Ruby\n- j4tools - Ferramentas não oficiais projetadas para funcionar com i3\n\nFóruns do Arch Linux\n\n- The i3 thread - Uma discussão geral sobre o i3\n- i3 desktop screenshots and config sharing\n\nScreencasts\n\n- i3 window manager v4.1 screencast\n- i3 window manager v4.1X screencasts\n\n"
    }
  ]
}