{
  "title": "ICC profiles (Русский)",
  "url": "https://wiki.archlinux.org/title/ICC_profiles_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Поскольку это относится к общему использованию настольных систем, ICC профиль представляет собой двоичный файл, который содержит точные данные о цветовых атрибутах ввода или устройства вывода. Один или несколько профилей могут быть применены к системе и ее устройствам для получения согласованных и повторяемых результатов для редактирования и публикации графики и документов. Профили ICC обычно откалиброваны с помощью (трехцветного) колориметра или спектрофотометром, когда требуется абсолютная точность цветопередачи.\n\n"
    },
    {
      "title": "Генерация профиля",
      "level": 2,
      "content": "Управление цветом - это рабочий процесс калибровки оборудования, программного профилирования и встраивания профиля в изображение или видео. Все это основано на использовании ICC профиля.\n\n"
    },
    {
      "title": "Колориметр или спектрофотометр",
      "level": 3,
      "content": "Настоятельно рекомендуется использовать колориметр или спектрометрическое устройство для калибровки оборудования, печати принтера и сканера. Для домашнего использования доступно несколько недорогих колориметров. Некоторые из них хорошо или даже лучше поддерживаются в Linux, чем в других операционных системах. Часто рекомендуемыми устройствами являются X-Rite ColorMunki Display, DataColor Spyder5 Express и устройство с открытым исходным кодом ColorHug. Вы можете найти другие поддерживаемые Linux устройства, перечисленные в документации к AgyllCMS.\n\n"
    },
    {
      "title": "Argyll CMS",
      "level": 3,
      "content": "Система управления цветом Argyll - это полный набор инструментов для создания и загрузки профиля в командной строке, перечисленных в разделе argyllcms.\n\nОзнакомьтесь с официальной документацией Argyll CMS, чтобы узнать, как профилировать выбранные устройства.\n\n"
    },
    {
      "title": "Калибровка и профилирование монитора с помощью дополнительного калибровочного оборудования",
      "level": 3,
      "content": "Существует интерфейс GUI для ArgyllCMS, называемый DisplayCal, доступный как displaycal. В большинстве случаев вам подойдут настройки по умолчанию. Это обычный способ калибровки цвета при дневном свете 6500К и гаммой 2,2. Подробнее читайте в документации DispalGui. Многие учебные пособия доступны в сети.\n\n"
    },
    {
      "title": "Калибровка сканера",
      "level": 3,
      "content": "Следуйте инструкциям из части Scanner в руководстве Color Management on Linux.\n\n"
    },
    {
      "title": "Калибровка принтера",
      "level": 3,
      "content": "Смотрите cups-calibrate(8).\n\n"
    },
    {
      "title": "Передача файла",
      "level": 3,
      "content": "Генерация профиля в системе Windows или macOS является одним из самых простых и наиболее рекомендуемых способов получения ICC профиля для монитора. Поскольку цветовые профили ICC записываются в открытую спецификацию, они совместимы в разных операционных системах. Передача профилей из одной ОС в другую может быть использована в качестве обходного пути из-за отсутствия поддержки определенных спектрофотометров или колориметров в Linux: можно просто создать профиль на другой ОС, а затем использовать его в рабочем процессе Linux. Обратите внимание, что система, на которой создается профиль, должна размещать ту же самую видеокарту и монитор, для которых должен использоваться профиль. После создания профиля ICC или серии профилей в системе Windows скопируйте файл(ы) из пути по умолчанию:\n\n```\nC:\\WINDOWS\\System32\\spool\\drivers\\color\n```\n\nmacOS обычно сохраняет сохраненные профили ICC в одном из двух местоположений:\n\n```\n/Library/ColorSync/Profiles\n/Users/USER_NAME/Library/ColorSync/Profile\n```\n\nКак только соответствующие .icc/.icm файлы будут скопированы, установите профили устройств в нужную вам систему. Каталоги профилей устройств в Linux:\n\n```\n/usr/share/color/icc\n/usr/local/share/color/icc\n/home/USER_NAME/.color/icc\n```\n\n"
    },
    {
      "title": "Gnome Color Manager",
      "level": 3,
      "content": "В Gnome профиль ICC можно легко создать с помощью gnome-color-manager. В Gnome это доступно через Центр управления и довольно просто использовать. Для использования этой функции вам понадобится колориметрическое устройство.\n\n"
    },
    {
      "title": "Инструкция",
      "level": 4,
      "content": "Убедитесь, что запущен gnome-settings-daemon и запущен:\n\n```\n$ colormgr get-devices\n```\n\nНайдите Device ID строку вашего монитора. Если это, например xrandr-Lenovo Group Limited, начните калибровать с помощью команды:\n\n```\ngcm-calibrate --device \"xrandr-Lenovo Group Limited\"\n```\n\n"
    },
    {
      "title": "ThinkPads",
      "level": 3,
      "content": "Смотрите цветовые профили для IBM/Lenovo ThinkPad ноутбуков monitor profile (generic) в поддержке.\n\n"
    },
    {
      "title": "Загрузка ICC профилей",
      "level": 2,
      "content": "Профили ICC загружаются либо демоном сеанса, либо специальным загрузчиком ICC. У Gnome и KDE есть демоны, способные загружать профили ICC из colord. Если вы используете colord в сочетании с gnome-settings-daemon или colord-kde, профиль будет загружен автоматически. Если вы не используете ни Gnome, ни KDE, вы можете установить независимый демон, xiccd, который делает то же самое, но не зависит от среды вашего рабочего стола. Не запускайте одновременно два демона, совместимых с ICC (например, gnome-settiongs-daemon и xiccd).\n\nЕсли вы не используете какой-либо ICC-capable демон, убедитесь, что вы используете только один загрузчик ICC - либо xcalib, dispwin, dispcalGUI-apply-profiles, либо другие, иначе вы легко получите неконтролируемую среду. (Последний загрузчик установил калибровку, а ранее загруженная калибровка была перезаписана.)\n\nПрежде чем использовать какой-либо конкретный загрузчик ICC, вы должны понимать, что некоторые инструменты устанавливают только калибровочные кривые (например, xcalib), другие инструменты, устанавливающие только профиль отображения на X.org _ICC_PROFILE atom (например, xicc) и другие инструменты, выполняют обе задачи сразу (например, dispwin, dispcalGUI-apply-profiles).\n\n"
    },
    {
      "title": "xcalib",
      "level": 3,
      "content": "- xcalib - это легкий загрузчик монитора, который может загружать профиль монитора ICC для совместного использования в десктоп приложениях. xcalib является частью репозитория пользователей Arch (AUR).\n\n"
    },
    {
      "title": "Пример Xinitrc",
      "level": 4,
      "content": "Загружаемый профиль P221W-sRGB.icc в /usr/share/color/icc на монитор host:0 при запуске X сервера\n\n```\n#!/bin/bash\n\n/usr/bin/xcalib -d :0 /usr/share/color/icc/P221W-sRGB.icc\n```\n\n"
    },
    {
      "title": "Пример JWM <StartupCommand>",
      "level": 4,
      "content": "Загружаемый профиль P221W-Native.icc в /usr/local/share/color/icc на монитор host:0 при запуске JWM\n\n```\n<StartupCommand>xcalib -d :0 /usr/local/share/color/icc/P221W-Native.icc</StartupCommand>\n```\n\n"
    },
    {
      "title": "dispwin",
      "level": 3,
      "content": "- dispwin является частью argyllcms.\n\n"
    },
    {
      "title": "Пример Xinitrc",
      "level": 4,
      "content": "Загружаемый профиль 906w-6500K.icc в /home/arch/.color/icc на монитор 0 при запуске X сервера\n\n```\n#!/bin/bash\n\n/usr/bin/dispwin -d0 /home/arch/.color/icc/906w-6500K.icc\n```\n\n"
    },
    {
      "title": "Пример JWM <StartupCommand>",
      "level": 4,
      "content": "Загрузить калибровочный файл Argyll 906w-7000K.cal в /usr/local/share/color/icc на монитор 1 при запуске JWM\n\n```\n<StartupCommand>dispwin -d1 /usr/local/share/color/icc/906w-7000K.cal</StartupCommand>\n```\n\nВы можете легко использовать один из этих загрузчиков для применения цветового профиля на ранней стадии загрузки при запуске экранного менеджера, например, используя загрузочный скрипт LightDM. Это позволяет загрузить один файл профиля icc. Это не будет работать с загрузкой нескольких файлов профиля при использовании настройки multi monitopr.\n\n"
    },
    {
      "title": "Приложения, поддерживающие профили ICC",
      "level": 2,
      "content": "- Xsane может использовать профили ICC для сканирования с коррекцией цвета.\n- CUPS может использовать профили ICC для печати с исправлением цвета с использованием Colord, но фактическая реализация и удобство использования неясны.\n- GIMP может использовать профили ICC для отображения редактируемого изображения. Однако использование установленного профиля ICC должно быть явно включено в диалоговом окне настроек.\n- mpv может учитывать профиль ICC при воспроизведении видео. Аргумент командной строки: --icc-profile=/path/to/profile.icc или --icc-profile-auto. Только --vo=opengl управление цветом; другие драйверы VO будут молча игнорировать параметры профиля ICC.\n- Firefox по умолчанию использует общесистемный профиль ICC только при отображении изображений, уже отмеченных профилем ICC. Предположим, что немаркированные изображения используют sRGB и применяют к ним цветокоррекцию, задают gfx.color_management.mode предпочтение 1.\n- Eye of Gnome и Eye of MATE автоматически используют установленный системой профиль ICC.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Wikipedia:Linux color management\n- Argyll Color Management System - официальный сайт\n- DisplayCal: базовая концепция калибровки дисплея и профилирования\n- Отображение цветового профилирования в Linux (XFCE)\n- Monitor Hardware Calibration\n\n"
    }
  ]
}