{
  "title": "Icons (Português)",
  "url": "https://wiki.archlinux.org/title/Icons_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artigo ou esta seção precisa de tradução.** Este artigo ou esta seção precisa de tradução.\n\nEste artigo ou esta seção precisa de tradução.\n\nArtigos relacionados\n\n- Temas de cursor\n- Xfce\n\nO projeto freedesktop fornece a Icon Theme Specification, que se aplica à maioria dos ambientes de desktop linux e tenta unificar a aparência de vários ícones em um icon-theme (tema de ícones). O Freedesktop também fornece a Icon Naming Specification, que define um esquema de nomeação padrão para ícones que se acredita serem instalados em qualquer sistema. O tema padrão hicolor deve incluir todos eles.\n\n"
    },
    {
      "title": "Ícones e emblemas",
      "level": 3,
      "content": "Para anexar um ícone personalizado a um tema de ícones existente, xdg-icon-resource pode ser usado. Isso redimensionará e copiará o ícone para $HOME/.local/share/icons/. Com esse método, emblemas personalizados também podem ser adicionados. Exemplos:\n\n```\n$ xdg-icon-resource install --size 128 --context emblems archuser-exemplo.png # adicionar como emblema\n$ xdg-icon-resource install --size 128 archuser-exemplo.png # adicionar como um ícone normal\n```\n\n"
    },
    {
      "title": "Ícones de tipo MIME",
      "level": 3,
      "content": "Os gerenciadores de arquivos atuais não dependem do tipo tradicional de MIME que file --mime gera. Em vez disso, são utilizadas definições de /usr/share/mime/. Chamar um ícone de acordo com a definição encontrada lá e copiá-lo para ~/.local/share/icons fará com que o gerenciador de arquivos exiba o ícone do tipo MIME personalizado. Este comando ilustra o método:\n\n```\nCria um ícone personalizado para arquivos de banco de dados do keepass (*.kdb)\n```\n\n```\n# grep kdb /usr/share/mime/globs | egrep -o '.+\\/[^:]+' | tr '/' '-'\napplication-x-keepass ;# renomeie seu ícones de acordo com essa saída\nxdg-icon-resource install --size 128 --context mimetypes application-x-keepass.png\n```\n\n"
    },
    {
      "title": "De um pacote",
      "level": 4,
      "content": "- Repositórios oficiais — pesquisa por \"icon-theme\".\n- AUR — pesquisa por \"icon-theme\".\n\n"
    },
    {
      "title": "Manualmente",
      "level": 4,
      "content": "Se você não conseguir encontrar um pacote para o tema do ícone que está procurando, será necessário instalá-lo manualmente.\n\n- Primeiro, encontre e baixe o pacote de ícones desejado. Muitos temas de ícones diferentes podem ser baixados dos seguintes sites: Customize.org, Opendesktop.org e Xfce-look.org.\n\n- Em seguida, navegue até o diretório que contém o pacote de ícones e extraia-o. Por exemplo, tar -xzf /home/user/downloads/icon-pack.tar.gz.\n\n- Mova a pasta extraída que contém os ícones para ~/.icons ou ~/.local/share/icons (apenas usuário) ou para /usr/share/icons (em todo o sistema).\n\n- Opcional: execute gtk-update-icon-cache -f -t ~/.icons/<nome_tema> para atualizar o cache do ícone.\n\n- Selecione o tema do ícone usando a ferramenta de configuração apropriada para seu ambiente de desktop ou gerenciador de janela.\n\n"
    },
    {
      "title": "fstab / gvfs",
      "level": 2,
      "content": "De acordo com este documento, gerenciadores de arquivos que usam GVFS (como GNOME Arquivos ou Thunar) podem exibir ícones para locais personalizados, como compartilhamentos NFS. Tudo o que você precisa são algumas opções de montagem estendidas dentro do /etc/fstab com nomes de ícones suportados pelo tema do ícone selecionado:\n\n```\n/etc/fstab\n```\n\n```\nhostname:/ /mnt/ nfs4 defaults,_netdev,user,rw,exec,comment=x-gvfs-show,x-gvfs-name=Network%20Attached%20Storage,x-gvfs-icon=network-server,x-gvfs-symbolic-icon=network-server,timeo=14 0 0\n```\n\n"
    }
  ]
}