{
  "title": "Idesk (Русский)",
  "url": "https://wiki.archlinux.org/title/Idesk_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Idesk — простая программа для добавления значков на рабочий стол X. Она также может фоном рабочего стола с помощью встроенной программы смены обоев, аналогичной той, что есть в Windows 7.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет ideskAUR и создайте каталог ~/.idesktop/.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "При первом запуске idesk создат файл настроек ~/.ideskrc. Если каталог ~/.idesktop/ пуст, он также создаст стандартный значок ~/.idesktop/default.lnk, который просто отображает приветствие через xdialog. Его можно использовать в качестве шаблона для других значков.\n\nПакет ideskAUR не предоставляет man-страницы, но есть файл /usr/share/idesk/README. Также есть документация на SourceForge.net, но большинство параметров в принципе понятны и так.\n\n"
    },
    {
      "title": "Настройки фона",
      "level": 3,
      "content": "Если вы используете другой установщик обоев, например, feh или Nitrogen, настройки фона Idesk изменять не нужно.\n\nУстановщик фона, встроенный в Idesk, поддерживает форматы JPEG, PNG, GIF и XPM. Укажите путь к файлу в Background.File или Background.Source.\n\n"
    },
    {
      "title": "Значки",
      "level": 3,
      "content": "Для поиска значков Idesk смотрит файлы с расширением .lnk в каталоге ~/.idesktop/. Каждый файл должен содержать один значок. Если вы попытаетесь прописать второй значок в том же файле, он будет проигнорирован. Кроме расширения .lnk, остальное имя файла не имеет значения.\n\nПример для Chromium:\n\n```\nchromium.lnk\n```\n\n```\ntable Icon\n  Caption: Chromium\n  ToolTip.Caption: Google's OSS Web Browser\n  Icon: /usr/share/icons/hicolor/32x32/apps/chromium.png\n  Width: 32\n  Height: 32\n  X: 977\n  Y: 369\n  Command[0]: chromium\nend\n```\n\nWidth и Height должны соответствовать фактическим размерам значка. Значения X и Y будут автоматически обновляться при перемещении значка по рабочему столу.\n\n- Большинство системных значков можно найти в следующих местах: /usr/share/icons/hicolor/, /usr/share/icons/gnome/ и /usr/share/pixmaps/.\n- Многие темы значков предоставляют иконки разных размеров — 48x48 является общепринятым размером для значков рабочего стола.\n\n"
    },
    {
      "title": "Idesktool",
      "level": 3,
      "content": "Пакет idesk-extrasAUR предоставляет графический инструмент настройки Idesk. Его можно запустить командой idesktool. Пользователи могут использовать Idesktool для создания и удаления значков, изменения настроек и перезапуска Idesk.\n\n"
    }
  ]
}