{
  "title": "Idesk",
  "url": "https://wiki.archlinux.org/title/Idesk",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Idesk is a simple program for adding icons to your X desktop. It can also manage your wallpaper with a built in changer similar to that found in Windows 7.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the ideskAUR package and create the ~/.config/idesktop/ directory.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "At the first run idesk will create the ~/.config/.ideskrc configuration file. If ~/.config/idesktop/ is empty, it will also create the ~/.config/idesktop/default.lnk icon, which just runs xdialog to display a welcome message. It can be used as a template for other icons.\n\nThe ideskAUR package does not come with a man page, but it does come with a readme file: /usr/share/idesk/README. There is also documentation on SourceForge.net, however most of the configuration options should be self-explanatory.\n\n"
    },
    {
      "title": "Background options",
      "level": 3,
      "content": "If you are using another wallpaper setter such as Feh or Nitrogen, Idesk's background settings do not need to be modified.\n\nIf you are using Idesk's own background setter, supported wallpaper formats include JPEG, PNG, GIF, and XPM. Using either Background.File or Background.Source, specify the path to the image file you wish to use as a wallpaper.\n\n"
    },
    {
      "title": "Icons",
      "level": 3,
      "content": "Idesk looks in ~/.idesktop/ for files which names end with .lnk for icons. Each file should define one icon. If you attempt to define a second icon, it will be silently ignored. Aside from ending with .lnk, the files' names are not important.\n\nExample for Chromium:\n\n```\nchromium.lnk\n```\n\n```\ntable Icon\n  Caption: Chromium\n  ToolTip.Caption: Google's OSS Web Browser\n  Icon: /usr/share/icons/hicolor/32x32/apps/chromium.png\n  Width: 32\n  Height: 32\n  X: 977\n  Y: 369\n  Command[0]: chromium\nend\n```\n\nWidth and Height should match the actual dimensions of the icon. X and Y will be modified by idesk to reflect the icon's actual position.\n\n- Most system icons can be found in the following locations: /usr/share/icons/hicolor/, /usr/share/icons/gnome/ and /usr/share/pixmaps/.\n- Many icon themes provide a variety of different sizes of icon - 48x48 is a commonly used size for desktop icons.\n\n"
    },
    {
      "title": "Idesktool",
      "level": 3,
      "content": "The idesk-extrasAUR package provides a graphical configuration tool for Idesk. It can be started by running the idesktool command. Users can use Idesktool to create and remove icons, modify settings and restart Idesk.\n\n"
    }
  ]
}