{
  "title": "Incron (Português)",
  "url": "https://wiki.archlinux.org/title/Incron_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "incron é um daemon que monitora eventos de sistemas de arquivos e executa comandos definidos nas tabelas do sistema e do usuário.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote incron.\n\n"
    },
    {
      "title": "Ativação e inicialização automática",
      "level": 2,
      "content": "Após a instalação, o daemon não será ativado por padrão. Ele pode ser habilitado usando systemctl.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Os incrontabs nunca devem ser editados diretamente; em vez disso, os usuários devem usar o programa incrontab para trabalhar com seus incrontabs.\n\n"
    },
    {
      "title": "Usando incrontab",
      "level": 3,
      "content": "Para visualizar seus incrontabs, os usuários devem emitir o comando:\n\n```\n$ incrontab -l\n```\n\nPara editar suas incrontabs, eles devem usar:\n\n```\n$ incrontab -e\n```\n\nPara remover as incrontabs, eles podem usar:\n\n```\n$ incrontab -r\n```\n\nPara recarregar incrond, use:\n\n```\n$ incrontab -d\n```\n\nPara editar a incrontab de outro usuário, execute o seguinte comando como root:\n\n```\n$ incrontab -u usuário\n```\n\n"
    },
    {
      "title": "Formato de incrontab",
      "level": 3,
      "content": "Cada linha em um arquivo incrontab é uma tabela que o dameon executa quando um evento acontece em um determinado diretório ou arquivo.\n\nO formato básico para um incrontab é:\n\n```\ncaminho máscara comando\n```\n\n- caminho é o diretório ou arquivo que incrond vai monitorar por alterações.\n- máscara é o tipo de evento de sistema de arquivos que icrond vai monitorar. Esse parâmetro pode ser separado por vígulas.\n- comando é o comando a ser executado após ocorrer(em) o(s) evento(s) de sistema de arquivos especificado(s).\n\n"
    },
    {
      "title": "Tipos de máscaras",
      "level": 4,
      "content": "O incrontab usa tipos de máscara para especificar qual evento do sistema de arquivos monitorar. Para mais opções, consulte inotify(7)\n\nPara acionar um comando se um arquivo for acessado ou lido:\n\n```\nIN_ACCESS\n```\n\nPara acionar um comando se os metadados de um arquivo forem alterados (por exemplo, carimbos de data/hora, permissões):\n\n```\nIN_ATTRIB\n```\n\nPara acionar um comando se um arquivo aberto para gravação estiver fechado:\n\n```\nIN_CLOSE_WRITE\n```\n\nPara acionar um comando se um arquivo ou diretório não aberto para gravação estiver fechado:\n\n```\nIN_CLOSE_NOWRITE\n```\n\nPara acionar um comando se um arquivo ou diretório for criado em um diretório monitorado:\n\n```\nIN_CREATE\n```\n\nPara acionar um comando se um arquivo ou diretório for excluído de um diretório monitorado:\n\n```\nIN_DELETE\n```\n\nPara acionar um comando se um arquivo ou diretório monitorado for excluído (ou movido para um sistema de arquivos diferente):\n\n```\nIN_DELETE_SELF\n```\n\nPara acionar um comando se um arquivo foi modificado:\n\n```\nIN_MODIFY\n```\n\nPara acionar um comando se um arquivo ou diretório monitorado for movido dentro do sistema de arquivos:\n\n```\nIN_MOVE_SELF\n```\n\nPara acionar um comando se um arquivo ou diretório for movido para fora do diretório monitorado:\n\n```\nIN_MOVED_FROM\n```\n\nPara acionar um comando se um arquivo ou diretório for movido para o diretório monitorado:\n\n```\nIN_MOVED_TO\n```\n\nPara acionar um comando se um arquivo ou diretório monitorado for aberto:\n\n```\nIN_OPEN\n```\n\n"
    }
  ]
}