{
  "title": "Incus (Español)",
  "url": "https://wiki.archlinux.org/title/Incus_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2024-02-17** \n\nArtículos relacionados\n\n- Linux Containers\n- LXD\n\nIncus es un administrador/hipervisor para contenedores (a través de LXC) y máquinas virtuales (a través de QEMU).\n\nEs una bifurcación de LXD por los mantenedores originales. La documentación de la página wiki de LXD sigue siendo muy relevante y se recomienda su lectura.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete incus, luego active incus.socket.\n\nAlternativamente, puede activar/iniciar incus.service directamente, en caso de que desee que las instancias se inicien automáticamente, por ejemplo.\n\nPara delegar la creación de contenedores a los usuarios, active/inicie la unidad incus-user.socket. Véase #Acceder a Incus como usuario sin privilegios para la delegación de grupos.\n\n"
    },
    {
      "title": "Migración desde LXD",
      "level": 3,
      "content": "Si desea migrar desde una instalación LXD existente, debe hacerlo en este punto, ya que la herramienta de migración solo se ejecutará en un servidor de destino Incus vacío.\n\nDespués de comprobar que las órdenes lxc info y incus info se ejecuten correctamente, consulte la documentación sobre el proceso y luego ejecute la herramienta de migración:\n\n```\n# lxd-to-incus\n```\n\n"
    },
    {
      "title": "Contenedores sin privilegios",
      "level": 3,
      "content": "Se recomienda utilizar contenedores sin privilegios (véase Linux Containers#Privileged or unprivileged containers para obtener una explicación de la diferencia).\n\nPara esto, modifique /etc/subuid y /etc/subgid (si estos archivos no están presentes, créelos) para que contengan la asignación a los pares uid/gid para cada usuario que podrá ejecutar los contenedores. El siguiente ejemplo es simplemente para el superusuario 'root' (y la unidad del sistema systemd):\n\nPuedes utilizar usermod de la siguiente manera:\n\nusermod -v 1000000-1000999999 -w 1000000-1000999999 root\n\nO modificar directamente los archivos mencionados anteriormente de la siguiente manera:\n\n```\n/etc/subuid\n```\n\n```\nroot:1000000:1000000000\n```\n\n```\n/etc/subgid\n```\n\n```\nroot:1000000:1000000000\n```\n\nAhora, cada contenedor se iniciará unprivileged de forma predeterminada.\n\nPara conocer la alternativa, véase LXD (Español)#Contenedores con privilegios.\n\n"
    },
    {
      "title": "Configurar Incus",
      "level": 3,
      "content": "En el primer inicio, es necesario configurar Incus.\n\nEjecute como superusuario 'root':\n\n```\n# incus admin init\n```\n\nEsto iniciará una guía de configuración interactiva en el terminal, que cubre diferentes temas como almacenamiento, redes, etc.\n\nPuede encontrar una descripción general en la Guía de introducción oficial.\n\n"
    },
    {
      "title": "Acceder a Incus como usuario sin privilegios",
      "level": 3,
      "content": "Incus define dos grupos de usuario:\n\n- incus \"permite el acceso básico de usuario, sin configuración y todas las acciones restringidas a un proyecto por usuario.\"\n- incus-admin \"permite un control total sobre Incus.\"\n\nPara controlar Incus sin tener que ejecutar todas las órdenes como root, añada su usuario a estos grupos:\n\n```\n# usermod -a -G incus usuario\n# usermod -a -G incus-admin usuario\n```\n\nCierre sesión y vuelva a iniciarla para que se reevalúe su membresía en el grupo.\n\n"
    },
    {
      "title": "Descripción general de las órdenes",
      "level": 3,
      "content": "Puede obtener una descripción general de todas las órdenes disponibles escribiendo:\n\n```\n$ incus\n```\n\n"
    },
    {
      "title": "Crear un contenedor",
      "level": 3,
      "content": "Puedes crear un contenedor con incus launch, por ejemplo:\n\n```\n$ incus launch ubuntu:20.04\n```\n\nLos contenedores se basan en imágenes que se descargan desde servidores de imágenes o servidores LXD remotos.\n\nPuede ver la lista de servidores ya añadidos con:\n\n```\n$ incus remote list\n```\n\nPuede listar todas las imágenes en un servidor con incus image list, por ejemplo:\n\n```\n$ incus image list images:\n```\n\nEsto le mostrará todas las imágenes en uno de los servidores predeterminados: images.linuxcontainers.org\n\nTambién puede buscar imágenes añadiendo términos como el nombre de la distribución:\n\n```\n$ incus image list images:debian\n```\n\nIniciar un contenedor con una imagen de un servidor específico con:\n\n```\n$ incus launch servername:imagename\n```\n\nPor ejemplo:\n\n```\n$ incus launch images:centos/8/amd64 centos\n```\n\nPara crear un contenedor con arquitectura AMD64:\n\n```\n$ incus launch images:archlinux/current/amd64 arch\n```\n\n"
    },
    {
      "title": "Acceder a los contenedores por nombre de host",
      "level": 3,
      "content": "Esto asume que está utilizando el puente predeterminado que se llama incusbr0 y que está utilizando systemd-resolved.\n\n```\n# systemd-resolve --interface incusbr0 --set-domain '~incus' --set-dns $(incus network get incusbr0 ipv4.address | cut -d / -f 1)\n```\n\nAhora puede acceder a los contenedores por su nombre:\n\n```\n$ ping nombrecontenedor.incus\n```\n\n"
    },
    {
      "title": "Starting a virtual machine fails",
      "level": 3,
      "content": "Si observa el error:\n\n```\nError: Couldn't find one of the required UEFI firmware files: [{code:OVMF_CODE.4MB.fd vars:OVMF_VARS.4MB.ms.fd} {code:OVMF_CODE.2MB.fd vars:OVMF_VARS.2MB.ms.fd} {code:OVMF_CODE.fd vars:OVMF_VARS.ms.fd} {code:OVMF_CODE.fd vars:qemu.nvram}]\n```\n\nEs porque Arch Linux no distribuye firmware de arranque seguro ovmf firmado. Para iniciar máquinas virtuales, debe desactivar el inicio seguro por el momento:\n\n```\n$ incus launch ubuntu:18.04 test-vm --vm -c security.secureboot=false\n```\n\nEsto también se puede añadir al perfil predeterminado haciendo:\n\n```\n$ incus profile set default security.secureboot=false\n```\n\n"
    },
    {
      "title": "Desinstalar",
      "level": 2,
      "content": "Detenga y desactive los servicios. Despues desinstale el paquete incus.\n\nSi desea eliminar todos los datos:\n\n```\n# rm -r /var/lib/incus\n```\n\nSi utilizó alguna de las configuraciones de red de ejemplo, también debe eliminarlas.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- La página oficial de Incus\n- Documentación oficial\n- Guía de introducción\n- Foro oficial\n- El repositorio GitHub de Incus\n\n"
    }
  ]
}