{
  "title": "Instalar a partir de um Linux existente",
  "url": "https://wiki.archlinux.org/title/Instalar_a_partir_de_um_Linux_existente",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Instalar a partir de SSH\n\nEste documento descreve o processo de inicialização necessário para instalar o Arch Linux a partir de um sistema host Linux em execução. Após o bootstrapping, a instalação prossegue conforme descrito no guia de instalação.\n\nInstalar o Arch Linux de um Linux existente é útil para:\n\n- instalar remotamente o Arch Linux, p.ex. um servidor raiz (virtual)\n- substituir um Linux existente sem um LiveCD (ver #Substituindo o sistema existente sem um LiveCD)\n- criar uma nova distribuição ou LiveMedia baseada no Arch Linux\n- criar um ambiente de chroot do Arch Linux, p.ex.: contêiner base de Docker\n- rootfs-over-NFS para terminais burros\n\nO objetivo do procedimento de inicialização é configurar um ambiente a partir do qual os scripts do arch-install-scripts (como o pacstrap e arch-chroot) podem ser executados.\n\nSe o sistema hospedeiro funciona no Arch Linux, isso pode ser conseguido simplesmente instalando arch-install-scripts. Se o sistema hospedeiro executar outra distribuição Linux, primeiro você precisará configurar um chroot baseado no Arch Linux.\n\n"
    },
    {
      "title": "Backup e preparação",
      "level": 2,
      "content": "Faça backup de todos os seus dados, incluindo correios, servidores web, etc. Tenha todas as informações ao seu alcance. Preserve todas as configurações do seu servidor, hostnames, etc.\n\nAqui está uma lista de dados que você provavelmente precisará:\n\n- Endereço IP\n- hostname(s), (nota: servidores raiz são principalmente também parte do domínio dos provedores, verifique ou salve seu /etc/hosts antes de excluir)\n- Servidor DNS (verifique /etc/resolv.conf)\n- Chaves SSH (se outras pessoas trabalham no seu servidor, elas terão de aceitar novas chaves, caso contrário. Isso inclui chaves do seu Apache, seus servidores de e-mail, seu servidor SSH e outros.)\n- Informações de hardware (placa de rede, etc. Consulte o seu /etc/modules.conf pré-instalado)\n- Arquivos de configuração Grub.\n\nEm geral, é uma boa ideia ter uma cópia local do diretório original /etc no seu disco rígido local.\n\n"
    },
    {
      "title": "De um host executando o Arch Linux",
      "level": 2,
      "content": "Instale o pacote arch-install-scripts.\n\nSiga Guia de instalação#Montar os sistemas de arquivos para montar o sistema de arquivos que será usado para o diretório raiz bem como todos os outros pontos de montagem necessários. Se você já usa o diretório /mnt para alguma outra coisa, basta criar outro diretório como /mnt/install e usá-lo como a base de pontos de montagem para o resto da instalação.\n\nNesta fase, o Arch Linux pode ser instalado do zero ou pode espelhar a instalação do host. As duas opções são descritas a seguir.\n\n"
    },
    {
      "title": "Criar uma nova instalação do Arch",
      "level": 3,
      "content": "Siga Guia de instalação#Instalação.\n\nNo procedimento, o primeiro passo, Guia de instalação#Selecionar os espelhos, pode ser pulado, já que o host já deve ter a lista de espelhos correta.\n\n- Para evitar baixar novamente todos os pacotes, considere seguir Pacman/Dicas e truques#Cache do pacman compartilhado na rede ou use a opção -c do pacstrap para usar o cache de pacotes do host.\n- Quando o gerenciador de boot Grub é usado, o comando grub-mkconfig pode detectar dispositivos incorretamente. Isso resultará em Erro:nenhuma partição ao tentar inicializar a partir do pendrive. Para resolver este problema, a partir do host executando o Arch Linux, monte as partições recém-instaladas, use arch-chroot na nova partição, depois instale e configure o grub. A última etapa pode requerer a desativação de lvmetad do /etc/lvm/lvm.conf configurando use_lvmetad=0.\n\n"
    },
    {
      "title": "Criar uma cópia exata de uma instalação do Arch existente",
      "level": 3,
      "content": "É possível replicar uma instalação existente do Arch Linux copiando o sistema de arquivos do host para a nova partição e fazer alguns ajustes nela para torná-la inicializável e única.\n\nO primeiro passo é copiar os arquivos do host para a nova partição montada, para isso, considere o uso da abordagem exibida em rsync#Full system backup.\n\nEm seguida, siga o procedimento descrito em Guia de instalação#Configurar o sistema com algumas advertências e etapas adicionais:\n\n- Guia de instalação#Horário, Guia de instalação#Localização e Guia de instalação#Senha do root podem ser ignorados\n- Guia de instalação#Initramfs pode ser necessário especialmente se estiver alterando o sistema de arquivos, por exemplo, para ext4 para Btrfs\n- Sobre Guia de instalação#Gerenciador de boot, é necessário reinstalar o gerenciador de boot\n- Exclua /etc/machine-id de forma que um novo, único, seja gerado na próxima inicialização\n\nSe a instalação espelhada do Arch puder ser usada em uma configuração diferente ou com outro hardware, considere as seguintes operações adicionais:\n\n- Use a atualização do microcódigo da CPU adaptada para o sistema alvo durante o passo Guia de instalação#Gerenciador de boot\n- Se algum Xorg (Português)#Configuração específico foi apresentado no host e pode estar incompleto com o sistema alvo, siga Movendo uma instalação existente para dentro (ou fora) de uma máquina virtual#Desabilite quaisquer arquivos relacionados ao Xorg\n- Faça qualquer outro ajuste apropriado para o sistema de destino, como reconfigurar a rede ou o áudio.\n\n"
    },
    {
      "title": "De um host executando outra distribuição Linux",
      "level": 2,
      "content": "Existem várias ferramentas que automatizam uma grande parte das etapas descritas nas subseções a seguir. Consulte as respectivas páginas para obter instruções detalhadas.\n\n- arch-bootstrap (Bash)\n- digitalocean-debian-to-arch (disco de repartição, específico para DigitalOCean)\n- image-bootstrap (Python)\n- vps2arch (Bash)\n\nA maneira manual é apresentada nas seguintes subseções. A ideia é fazer o pacman funcionar diretamente no sistema hospedeiro ou executar um sistema Arch dentro do sistema host, com a instalação real sendo executada a partir do sistema Arch. O sistema aninhado está contido dentro de um chroot.\n\n"
    },
    {
      "title": "Usando pacman do sistema hospedeiro",
      "level": 3,
      "content": "O Pacman pode ser compilado na maioria das distribuições Linux e usado diretamente no sistema hospedeiro para inicializar o Arch Linux. O arch-install-scripts deve ser executado sem problemas diretamente dos fontes baixados em qualquer distribuição recente.\n\nAlgumas distribuições fornecem um pacote para o pacman e/ou arch-install-scripts em seus repositórios oficiais, que podem ser usados para essa finalidade. Até fevereiro de 2019, o Gentoo é conhecido por fornecer o pacote pacman, e o Alpine Linux e o Fedora são conhecidos por fornecer pacman e arch-install-scripts.\n\n"
    },
    {
      "title": "Criando um chroot",
      "level": 3,
      "content": "Dois métodos para configurar e entrar no chroot são apresentados abaixo, do mais fácil ao mais complicado. Selecione apenas um dos dois métodos. Então, continue em #Usando um ambiente chroot.\n\n"
    },
    {
      "title": "Método A: Usando a imagem do bootstrap (recomendado)",
      "level": 4,
      "content": "Baixe a imagem bootstrap de um espelho (mirror) em /tmp.\n\nVocê também pode baixar a assinatura (mesma URL com .sig adicionado) e verificá-la com GnuPG.\n\nExtraia o tarball:\n\n```\n# tar xzf <caminho-para-imagem-bootstrap>/archlinux-bootstrap-*-x86_64.tar.gz\n```\n\nSelecione um servidor de repositório editando /tmp/root.x86_64/etc/pacman.d/mirrorlist.\n\nEntre no chroot\n\n- Se bash 4 ou posterior estiver instalado, e unshare tiver suporte às opções --fork e --pid:\n\n```\n# /tmp/root.x86_64/bin/arch-chroot /tmp/root.x86_64/\n```\n\n- Do contrário, execute os seguintes comandos:\n\n```\n# mount --bind /tmp/root.x86_64 /tmp/root.x86_64\n# cd /tmp/root.x86_64\n# cp /etc/resolv.conf etc\n# mount -t proc /proc proc\n# mount --make-rslave --rbind /sys sys\n# mount --make-rslave --rbind /dev dev\n# mount --make-rslave --rbind /run run    # (presumindo que /run existe no sistema)\n# chroot /tmp/root.x86_64 /bin/bash\n```\n\n"
    },
    {
      "title": "Método B: Usando a imagem LiveCD",
      "level": 4,
      "content": "É possível montar a imagem raiz da mídia mais recente de instalação do Arch Linux e, em seguida, fazer chroot nela. Este método tem a vantagem de fornecer uma instalação funcional do Arch Linux no direito do sistema host sem a necessidade de prepará-lo instalando pacotes específicos.\n\n- A imagem raiz pode ser encontrada em um dos espelhos em arch/x86_64/. O formato squashfs não é editável, portanto, desfazemos o \"squash\" na imagem raiz e a montamos.\n\n- Para fazer um \"unsquash\" na imagem raiz, execute\n\n```\n# unsquashfs airootfs.sfs\n```\n\n- Antes de fazer chroot para ela, precisamos configurar alguns pontos de montagem e copiar o resolv.conf para conectividade.\n\n```\n# mount --bind squashfs-root squashfs-root\n# mount -t proc none squashfs-root/proc\n# mount -t sysfs none squashfs-root/sys\n# mount -o bind /dev squashfs-root/dev\n# mount -o bind /dev/pts squashfs-root/dev/pts  ## importante para o pacman (para verificação de assinatura)\n# cp -L /etc/resolv.conf squashfs-root/etc  ## Isso é necessário para usar conectividade com o chroot\n```\n\n- Agora, tudo está preparado para fazer chroot para dentro do ambiente Arch recém-instalado\n\n```\n# chroot squashfs-root bash\n```\n\n"
    },
    {
      "title": "Usando um ambiente chroot",
      "level": 3,
      "content": "O ambiente bootstrap é realmente minimalista (sem nano ou lvm2). Portanto, precisamos configurar o pacman para baixar outros pacotes necessários.\n\n"
    },
    {
      "title": "Inicializando o chaveiro do pacman",
      "level": 4,
      "content": "Antes de iniciar a instalação, as chaves do pacman precisam ser configuradas. Antes de executar os dois comandos a seguir, leia pacman-key (Português)#Inicializando o chaveiro para entender os requisitos de entropia:\n\n```\n# pacman-key --init\n# pacman-key --populate archlinux\n```\n\n"
    },
    {
      "title": "Selecionando um espelho e baixando ferramentas básicas",
      "level": 4,
      "content": "Após selecionar um espelho, renove as listas de pacotes e instale o que você precisa: {base-devel, parted etc.\n\n- Como ainda não há nenhum editor de texto, você precisa sair do arch-chroot e editar a mirrorlist usando o editor de texto do host.\n- Quando você tentar instalar pacotes com o pacman, você pode obter erro: não foi possível determinar o ponto de montagem do cachedir: /var/cache/pacman/pkg. Para contornar isso, você pode usar mount --bind diretório-para-livecd-ou-bootstrap diretório-para-livecd-ou-bootstrap antes de fazer chroot. Veja FS#46169.\n\n```\nmount --bind diretório-para-livecd-ou-bootstrap diretório-para-livecd-ou-bootstrap\n```\n\n"
    },
    {
      "title": "Dicas de instalação",
      "level": 3,
      "content": "Você pode prosseguir agora para Guia de instalação#Partição dos discos e seguir o resto do Guia de instalação.\n\nAlguns sistemas hospedeiros ou configurações podem exigir determinadas etapas adicionais. Veja as seções abaixo para obter dicas.\n\n"
    },
    {
      "title": "Host baseado no debian",
      "level": 4,
      "content": "Em alguns sistemas baseados no Debian, pacstrap pode produzir o seguinte erro:\n\n```\n# pacstrap /mnt base\n```\n\n```\n==> Creating install root at /mnt\nmount: mount point /mnt/dev/shm is a symbolic link to nowhere\n==> ERROR: failed to setup API filesystems in new root\n```\n\nIsso porque em algumas versões do Debian, /dev/shm aponta para /run/shm enquanto no chroot baseado no Arch, /run/shm não existe e o link está quebrado. Para corrigir esse erro, cria um diretório /run/shm:\n\n```\n# mkdir /run/shm\n```\n\nAo instalar archlinux-2015.07.01-x86_64 a partir de um host Debian 7, o seguinte erro impediu pacstrap(8) e arch-chroot de funcionar:\n\n```\n# pacstrap -i /mnt\n```\n\n```\nmount: mount point /mnt/dev/pts does not exist\n==> ERROR: failed to setup chroot /mnt\n```\n\nAparentemente, é porque esses dois scripts usam uma função em comum. chroot_setup()[1] depende em novos recursos do util-linux, que são incompatíveis com Debian 7 userland (veja FS#45737).\n\nA solução para pacstrap é executar manualmente seus várias tarefas, mas use o procedimento regular para montaros sistemas de arquivos do kernel no diretório alvo (\"$newroot\"):\n\n```\n# newroot=/mnt\n# mkdir -m 0755 -p \"$newroot\"/var/{cache/pacman/pkg,lib/pacman,log} \"$newroot\"/{dev,run,etc}\n# mkdir -m 1777 -p \"$newroot\"/tmp\n# mkdir -m 0555 -p \"$newroot\"/{sys,proc}\n# mount --bind \"$newroot\" \"$newroot\"\n# mount -t proc /proc \"$newroot/proc\"\n# mount --rbind /sys \"$newroot/sys\"\n# mount --rbind /run \"$newroot/run\"\n# mount --rbind /dev \"$newroot/dev\"\n# pacman -r \"$newroot\" --cachedir=\"$newroot/var/cache/pacman/pkg\" -Sy base base-devel ... ## adicione os pacotes que quiser\n# cp -a /etc/pacman.d/gnupg \"$newroot/etc/pacman.d/\"       ## copiar chaveiro\n# cp -a /etc/pacman.d/mirrorlist \"$newroot/etc/pacman.d/\"  ## copiar lista de espelhos\n```\n\nEm vez de usar arch-chroot para Guia de instalação#Chroot, basta usar:\n\n```\n# chroot \"$newroot\"\n```\n\nA tentativa de criar volumes lógicos LVM de um ambiente archlinux-bootstrap-2015.07.01-x86_64 em um host Debian 7 resultaram no seguinte erro:\n\n```\n# lvcreate -L 20G lvm -n root\n```\n\n```\n/run/lvm/lvmetad.socket: connect failed: No such file or directory\n  WARNING: Failed to connect to lvmetad. Falling back to internal scanning.\n  /dev/lvm/root: not found: device not cleared\n  Aborting. Failed to wipe start of new LV.\n```\n\n(A criação de volume físico e grupo de volumes funcionaram apesar de /run/lvm/lvmetad.socket: connect failed: No such file or directory estar sendo exibido.)\n\nIsso poderia ser facilmente contornado criando os volumes lógicos fora do chroot (do host Debian). Eles estão disponíveis uma vez que executados chroot novamente.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nTambém, se o sistema que você está usando tiver lvm, você pode ter a seguinte saída:\n\n```\n# grub-install --target=i386-pc --recheck /dev/main/archroot\n```\n\n```\nInstalling for i386-pc platform.\n  /run/lvm/lvmetad.socket: connect failed: No such file or directory\n  WARNING: Failed to connect to lvmetad. Falling back to internal scanning.\n  /run/lvm/lvmetad.socket: connect failed: No such file or directory\n  WARNING: Failed to connect to lvmetad. Falling back to internal scanning.\n  /run/lvm/lvmetad.socket: connect failed: No such file or directory\n  WARNING: Failed to connect to lvmetad. Falling back to internal scanning.\n  /run/lvm/lvmetad.socket: connect failed: No such file or directory\n  WARNING: Failed to connect to lvmetad. Falling back to internal scanning.\n  /run/lvm/lvmetad.socket: connect failed: No such file or directory\n  WARNING: Failed to connect to lvmetad. Falling back to internal scanning.\n```\n\nIsso porque o Debian não usa lvmetad por padrão. Você precisa editar /etc/lvm/lvm.conf e definir use_lvmetad para 0:\n\n```\nuse_lvmetad = 0\n```\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nIsto irá desencadear mais tarde um erro na inicialização no estágio initrd. Portanto, você deve alterá-lo depois da geração grub. Em um software RAID + LVM, as etapas seriam as seguintes:\n\n- Após instalar o sistema, verifique seu Mkinitcpio e as configurações do gerenciador de boot (boot loader). Veja Processo de inicialização do Arch#Gerenciador de boot para uma lista de gerenciadores de inicialização.\n- Você pode precisar alterar seu /etc/mdadm.conf para refletir suas configurações de RAID (se aplicável).\n- Você pode precisar alterar seuHOOKS e MODULES de acordo com seus requisitos de LVM e RAID: MODULES=\"dm_mod\" HOOKS=\"base udev mdadm_udev ... block lvm2 filesystems ...\"\n- Você provavelmente vai precisar gerar novas imagens initrd com mkinitcpio. Veja Mkinitcpio#Criação e ativação de imagem.\n- Defina use_lvmetad = 0 em /etc/lvm/lvm.conf.\n- Atualize as configurações de seu gerenciador de boot. Veja a página wiki de seu gerenciador de boot para detalhes.\n- Defina use_lvmetad = 1 em /etc/lvm/lvm.conf.\n\n"
    },
    {
      "title": "Host baseado no Fedora",
      "level": 4,
      "content": "Nos hosts baseados no Fedora e USBs ativos, você pode encontrar problemas ao usar genfstab para gerar seu fstab. Remova as entradas duplicadas e a opção \"seclabel\" onde aparecer, pois isso é específico do Fedora e impedirá que o sistema seja inicializado normalmente.\n\n"
    },
    {
      "title": "Coisas para verificar antes de reiniciar",
      "level": 2,
      "content": "Antes de reiniciar, verifique novamente alguns detalhes em sua instalação para obter uma instalação bem-sucedida. Para fazer isso, primeiro faça o chroot no sistema recém-instalado e, em seguida:\n\n- crie um usuário com senha, de forma que você possa se autenticar via ssh. Isso é crítico já que autenticação como root é desabilitada por padrão desde OpenSSH-7.1p2.\n- defina uma senha de root, de forma que você pode trocar para o root via su posteriormente\n- instale uma solução ssh e habilite sua instância de servidor para iniciar automaticamente na inicialização.\n- defina sua configuração de rede par ter uma conexão iniciada automaticamente na inicialização.\n- defina um gerenciador de boot e configure-o para usar a partição swap que você apropriou anteriormente como a partição raiz. Você pode querer configurar seu gerenciador de boot para poder inicializar em seu sistema antigo; é útil reutilizar a partição /boot existente do servidor no novo sistema para este propósito.\n\n"
    },
    {
      "title": "Substituindo o sistema existente sem um LiveCD",
      "level": 2,
      "content": "Encontre ~700 MB de espaço livre em algum lugar do disco, p.ex. particionando uma partição swap. Você pode desativar a partição swap e configurar o seu sistema lá.\n\n"
    },
    {
      "title": "Defina a partição antiga de swap como nova partição raiz",
      "level": 3,
      "content": "Verifique cfdisk, /proc/swaps ou /etc/fstab para localizar sua partição swap. Presumindo que seu disco rígido esteja localizado em sdaX (X será um número).\n\nFaça o seguinte:\n\nDesabilite o espaço swap:\n\n```\n# swapoff /dev/sdaX\n```\n\nCrie um sistema de arquivos nele\n\n```\n# fdisk /dev/sda\n(defina o campo de ID do /dev/sdaX para \"Linux\" - Hex 83)\n# mke2fs -j /dev/sdaX\n```\n\nCrie um diretório para montá-lo nele\n\n```\n# mkdir /mnt/novosis\n```\n\nFinalmente, monte o novo diretório para instalar um sistema intermediário.\n\n```\n# mount -t ext4 /dev/sdaX /mnt/novosis\n```\n\n"
    },
    {
      "title": "Instalação",
      "level": 3,
      "content": "Instale os pacotes essenciais e qualquer outro pacote necessário para instalar um sistema com conexão à Internet na partição temporária, tendo o cuidado com o limite de ~700 MB de espaço. Ao especificar pacotes a serem instalados com pacstrap, considere adicionar a opção -c para evitar o preenchimento de um espaço valioso baixando pacotes para o sistema host.\n\nUma vez que o novo sistema Arch Linux esteja instalado, corrija a configuração do gerenciador de boot e, então, reinicie no sistema recém-criado e faça um rsync de todo o sistema para a partição primária.\n\n"
    }
  ]
}