{
  "title": "Installation guide (Čeština)",
  "url": "https://wiki.archlinux.org/title/Installation_guide_(%C4%8Ce%C5%A1tina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Tato stránka Vás provede instalací Arch GNU/Linuxu. Použijeme Live CD/USB, jež si vytvoříme z oficiálního ISO obrazu. Instalační médium poskytuje funkce, jež zlepšují přístupnost pro uživatele se zdravotním postižením (vizte instalaci Arch GNU/Linuxu s asistenčními technologiemi pro více informací). Pro jiné možnosti instalace vizte kategorii instalačního postupu.\n\nDoporučujeme si ještě před instalací přečíst Často kladené otázky. Zajímají-li Vás konvence zde užité, vizte Nápovědu:Čtení. Podstatné je, že příklady s kódem mohou obsahovat proměnné (psány zkoseným textem), které se musí zadat ručně.\n\nPro důkladnější instrukce vizte související ArchWiki články či návody jednotlivých programů. Na obojí zde naleznete odkazy. Potřebujete-li interaktivní pomoc, nabízí se Vám IRC kanál a fóra.\n\nArch GNU/Linux by neměl mít problémy s libovolným x86_64kompatibilním strojem, který má alespoň 512 MiB RAM, nicméně víc paměti je třeba k spuštění Live CD/USB pro instalaci. [1] Základní instalace by neměla zabírat víc než 2 GiB místa na disku. Jelikož tento instalační postup stahuje balíčky z online repozitářů, budeme potřebovat připojení k internetu.\n\n"
    },
    {
      "title": "Získejte ISO obraz",
      "level": 3,
      "content": "Navštivte stránku pro stáhnutí ISO, vyberte si ISO podle potřeby a jeho GnuPG digitální podpis.\n\n"
    },
    {
      "title": "Potvrďte platnost podpisu",
      "level": 3,
      "content": "Doporučujeme potvrdit platnost podpisu ISO před užitím, obzvlášť, stahovali-li jste přes HTTP, neboť se při přenosu může ISO zaměnit za malware.\n\nPokud máte systém s GnuPG, stáhněte ISO PGP podpis (pod Checksums na dané stránce), přesuňte jej do ISO složky a následně zkontrolujte:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nNebo také je možnost zadat tento příkaz z již nainstalovaného Arch GNU/Linuxu:\n\n```\n$ pacman-key -v archlinux-version-x86_64.iso.sig\n```\n\n- Podpis samotný by mohl být vyměněn za falešný, pokud jste jej stahovali ze zrcadlové sítě namísto archlinux.org, jak je zmíněno výše. V tomto případě se ujistěte, že veřejný klíč, jejž použijete pro dekódovaní podpisu, je podepsán jiným důvěryhodným klíčem. Příkaz gpg vypíše otisk (\"fingerprint\") veřejného klíče.\n- Jiná metoda pro prokázání platnosti podpisu je se ujistit, že otisk veřejného klíče je stejný jako otisk klíče Arch GNU/Linux vývojáře, který podepsal daný ISO soubor. Vizte tento článek na Wikipédii pro více informací ohledně této problematiky.\n\n"
    },
    {
      "title": "Připravte instalační médium",
      "level": 3,
      "content": "Instalační obraz může být dodán zařízení přes USB, disk či síť pomocí PXE: řiďte se podle návodech v daných článcích, abyste si připravili instalační médium z vybraného ISO souboru.\n\n"
    },
    {
      "title": "Spusťte instalační médium",
      "level": 3,
      "content": "1. Vyberte zařízení s instalačním médiem. Toho obvykle dosáhnete zmáčknutím klávesy při POST fázi bootování, jak by mělo být vidět na obrazovce. Zkonzultujte manuál základní desky pro detaily.\n1. Až se zobrazí menu instalačního média, vyberte Arch Linux install medium a zmáčkněte Enter, abyste se dostali do instalačního prostředí. Tip: Instalační obraz užívá GRUB pro UEFI a syslinux pro BIOS. Vizte README.bootparams pro seznam boot proměnných.\n1. Budete přihlášeni na první virtuální konzoli jakožto root uživatel a budete mít k dispozici Zsh shell.\n\nAbyste přešli na jinou konzoli, například abyste viděli tento návod pomocí programu Lynx při instalaci, využijte klávesovou zkratku Alt+arrow. K pozměnění konfiguračních souborů, příkazy mcedit(1), nano a vim jsou k mání. Vizte pkglist.x86_64.txt pro seznam balíčků v instalačním médiu.\n\n"
    },
    {
      "title": "Nastavte konzolové klávesnicové rozložení",
      "level": 3,
      "content": "Základní rozložení kláves je US. Dostupná rozložení kláves si můžete prohlédnout příkazem:\n\n```\n# ls /usr/share/kbd/keymaps/**/*.map.gz\n```\n\nK nastavení klávesnicového rozložení, užijte příkazu loadkeys(1) s vhodným souborem (bez cesty k souboru a jeho koncovky). Například k nastavení českého rozložení kláves:\n\n```\n# loadkeys cz-qwertz\n```\n\nKonzolové fonty se nachází v /usr/share/kbd/consolefonts/ a mohou být podobně nastaveny pomocí setfont(8).\n\n"
    },
    {
      "title": "Zkontrolujte bootovací režim",
      "level": 3,
      "content": "Abyste zkontrolovali bootovací režim, vypište efivars složku:\n\n```\n# ls /sys/firmware/efi/efivars\n```\n\nPokud tento příkaz vypíše složku bez problémů, systém se spustil v UEFI režimu. Pokud tato složka není k nalezení, systém se pravděpodobně spustil v BIOS (či CSM) režimu. Pokud se systém nespustil ve Vámi požadovaném režimu, zkonzultujte manuál své základovky.\n\n"
    },
    {
      "title": "Připojte se k internetu",
      "level": 3,
      "content": "K nastavení připojení k internetu v instalačním prostředí, následujte tyto kroky:\n\n- Ujistěte se, že Vaše síťové rozhraní je v seznamu a spuštěné. To můžete zkontrolovat příkazy ip-link(8): # ip link\n- Pro bezdrátové připojení a WWAN, ujistěte se, že Vaše síťová karta není zablokována rfkill.\n- Připojte se k síti: Ethernetovým kabelem Wi-Fi pomocí iwctl. Mobílní sítí pomocí mmcli.\n- Nakonfigurujte si síťové připojení: DHCP: dynamické IP adresy a DNS servery (poskytnuté systemd-networkd a systemd-resolved) by měly fungovat od základu pro Ethernet, WLAN a WWAN síťová rozhraní. Statické IP adresy: řiďte se podle Network configuration#Static IP address.\n- Připojení může být zkontrolováno příkazem ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernetovým kabelem\n- Wi-Fi pomocí iwctl.\n- Mobílní sítí pomocí mmcli.\n\n- DHCP: dynamické IP adresy a DNS servery (poskytnuté systemd-networkd a systemd-resolved) by měly fungovat od základu pro Ethernet, WLAN a WWAN síťová rozhraní.\n- Statické IP adresy: řiďte se podle Network configuration#Static IP address.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Nastavte systémový čas",
      "level": 3,
      "content": "V instalačním prostředí je systemd-timesyncd povolen od základu a čas bude samovolně sladěn, jakmile se naváže připojení k internetu.\n\nPoužijte timedatectl(1), abyste se ujistili, že systémový čas je přesný:\n\n```\n# timedatectl status\n```\n\n"
    },
    {
      "title": "Vytvořte diskové oddíly",
      "level": 3,
      "content": "Pokud instalační prostředí rozezná disky, jsou přiřazeny k blokovému zařízení jako například /dev/sda, /dev/nvme0n1 nebo /dev/mmcblk0. K rozpoznání těchto zařízení použijte lsblk nebo fdisk.\n\n```\n# fdisk -l\n```\n\nVýsledků, které končí na rom, loop nebo airoot, si nemusíte všímat.\n\nTyto diskové oddíly jsou nezbytně nutné pro vybrané zařízení:\n\n- Jeden oddíl pro root adresář /.\n- Pro bootování v UEFI režimu: EFI systémový oddíl.\n\nChcete-li vytvořit bloková zařízení pro LVM, systémové šifrování nebo RAID, udělejte to nyní.\n\nUžijte fdisk nebo parted k úpravě tabulky diskových oddělení. Například:\n\n```\n# fdisk /dev/the_disk_to_be_partitioned\n```\n\n- Pokud se disk nezobrazí, ujistěte se, že diskový ovladač není v RAID režimu.\n- Pokud disk, ze kterého chcete bootovat již obsahuje EFI systémový oddíl, nevytvářejte nový, ale využijte ten již existující.\n- Swap prostor může být nastaven na swap souboru pro systémy souborů, které to podporují.\n\n"
    },
    {
      "title": "Příkladné rozložení",
      "level": 4,
      "content": "Table content:\nMontážní bod | Oddíl | Druh oddílu | Doporučená velikost\n/mnt/boot1 | /dev/efi_system_partition | EFI systémový oddíl | Alespoň 300 MiB\n[SWAP] | /dev/swap_partition | Linux swap | Víc než 512 MiB\n/mnt | /dev/root_partition | Linux x86-64 root (/) | Zbytek zařízení\n\n1. Jiné montážní body, jako například /mnt/efi, jsou dostupné, pokud využívaný boot loader je schopný načíst kernel a initramfs obrazy z root oddílu. Vizte varování v Arch boot process#Boot loader.\n\nTable content:\nMontážní bod | Oddíl | Druh oddílu | Doporučená velikost\n[SWAP] | /dev/swap_partition | Linux swap | Víc než 512 MiB\n/mnt | /dev/root_partition | Linux | Zbytek zařízení\n\nVizte také příklady rozložení.\n\n"
    },
    {
      "title": "Naformátujte diskové oddíly",
      "level": 3,
      "content": "Až budou diskové oddíly vytvořeny, každý z nich musí být naformátován vhodným souborovým systémem. Vizte vytváření souborového systému pro detaily.\n\nNapříklad k vytvoření Ext4 souborového systému v /dev/root_partition použijte:\n\n```\n# mkfs.ext4 /dev/root_partition\n```\n\nPokud jste vytvořili oddíl pro swap, inicializujte jej pomocí mkswap(8):\n\n```\n# mkswap /dev/swap_partition\n```\n\nVytvořili-li jste EFI systémový oddíl, naformátujte jej na FAT32 přes mkfs.fat(8).\n\n```\n# mkfs.fat -F 32 /dev/efi_system_partition\n```\n\n"
    },
    {
      "title": "Nasaďte souborové systémy",
      "level": 3,
      "content": "Nasaďte root adresář na /mnt. Například pokud root adresář je /dev/root_partition:\n\n```\n# mount /dev/root_partition /mnt\n```\n\nVytvořte zbývající montážní body (například /mnt/efi) a nasaďte je na vhodné adresáře.\n\nPro UEFI systémy nasaďte EFI systémový oddíl:\n\n```\n# mount --mkdir /dev/efi_system_partition /mnt/boot\n```\n\nPokud jste vytvořili swap adresář, povolte jej přes swapon(8):\n\n```\n# swapon /dev/swap_partition\n```\n\ngenfstab(8) později rozezná nasazené souborové systémy a swap.\n\n"
    },
    {
      "title": "Vyberte zrcadlové sítě",
      "level": 3,
      "content": "Balíčky k instalaci musí být stáhnuty ze zrcadlových sítí, jež jsou vypsány v /etc/pacman.d/mirrorlist. V instalačním prostředí po připojení k internetu reflector aktualizuje seznam zrcadlových sítí vybráním 20 nedávno sladěných HTTPS zrcadlových sítí a zařadí je podle rychlosti stahování.\n\nČím výš je zrcadlový server postaven v seznamu, tím vyšší přednost má při stahování balíčku. Měli byste se podívat na tento soubor, abyste se ujistili, že je vhodný. Pokud není, pozměňte jej podle potřeb, a posuňte geograficky nejbližší zrcadlové sítě na vrchol seznamu; nicméně měl by se brát zřetel i na jiné vlivy.\n\nTento soubor bude později zkopírován do nového systému pomocí pacstrapu, tudíž se vyplatí jej dobře nastavit.\n\n"
    },
    {
      "title": "Nainstalujte potřebné balíčky",
      "level": 3,
      "content": "Použijte pacstrap(8) skript pro instalaci base balíčku, Linux kernelu a firmwaru pro většinu hardwaru:\n\n```\n# pacstrap -K /mnt base linux linux-firmware\n```\n\n- Můžete zaměnit linux za libovolný kernel balíček podle potřeb. Můžete jej též zcela vynechat, pokud systém instalujete ve virtuálním prostředí.\n- Můžete vynechat instalaci firmwarových balíčků, pokud systém instalujete na virtuálním stroji nebo v izolovaném prostředí.\n\nBalíček base neobsahuje všechny nástroje z instalačního prostředí, proto instalace některých dalších balíčků může být potřeba pro plně funkční základní systém. Zvažte instalaci:\n\n- uživatelských utilit pro správu souborových systémů, které budou užity na systému,\n- utilit pro přístup k RAID či LVM diskovým oddílům,\n- konkrétního firmwaru pro jiná zařízení, který není obsažen v linux-firmware (například sof-firmware pro zvukové karty),\n- softwaru potřebného pro spravování sítě (například správce sítě či DHCP klient),\n- textového editoru\n- balíčků pro přístup k dokumentaci v man a info stránkách: man-db, man-pages a texinfo.\n\nK instalaci jiných balíčků či skupin balíčků přidejte jejich jména k pacstrap příkazu zmíněnému výše (a oddělte je mezerou) nebo použijte pacman, zatímco jste změnili root na nový systém. Pro porovnání můžete najít balíčky použité v instalačním prostředí na pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Vygenerujte fstab soubor (užijte -U nebo -L k definování pomocí UUID či návěstí v tomto pořadí):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nZkontrolujte výsledný /mnt/etc/fstab soubor a upravte jej, vyskytují-li se chyby.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Změňte root na nový systém:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Časová zóna",
      "level": 3,
      "content": "Nastavte časovou zónu:\n\n```\n# ln -sf /usr/share/zoneinfo/Region/City /etc/localtime\n```\n\nSpusťte hwclock(8) k vygenerování /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nTento příkaz předpokládá, že hardwarový čas je nastaven na UTC. Vizte časové standardy pro detaily.\n\n"
    },
    {
      "title": "Lokalizace",
      "level": 3,
      "content": "Upravte /etc/locale.gen a odkomentujte en_US.UTF-8 UTF-8 a jiné potřebné lokály. Následně je vygenerujte příkazem:\n\n```\n# locale-gen\n```\n\nVytvořte locale.conf(5) soubor a nastavte LANG proměnnou následovně:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_US.UTF-8\n```\n\nPokud jste nastavili rozložení konzolové klávesnice, učiňte změny stálými v vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=de-latin1\n```\n\n"
    },
    {
      "title": "Síťové nastavení",
      "level": 3,
      "content": "Vytvořte hostname soubor:\n\n```\n/etc/hostname\n```\n\n```\nmyhostname\n```\n\nDokončete síťové nastavení pro nově nainstalované prostředí. Například můžete nainstalovat software pro spravování sítě.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Vytváření nového initramfs většinou není nutné, jelikož mkinitcpio bylo spuštěno při instalaci kernelového balíčku přes pacstrap.\n\nPro LVM, systémové šifrování nebo RAID, upravte mkinitcpio.conf(5) a znovu vytvořte initramfs obraz:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Root heslo",
      "level": 3,
      "content": "Nastavte root heslo:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Boot loader",
      "level": 3,
      "content": "Vyberte a nainstaultje boot loader vhodný pro Linux. Máte-li Intel či AMD CPU, povolte microcode aktualizace.\n\n"
    },
    {
      "title": "Restart",
      "level": 2,
      "content": "Odejděte z chroot prostředí příkazem exit či zkratkou Ctrl+d.\n\nDodatečně můžete ručně odpojit všechny diskové oddíly pomocí příkazu umount -R /mnt: toto Vám umožní si všimnout \"zaměstnaných\" oddílů. Můžete pak vyhledat příčinu přes fuser(1).\n\nNakonec restartujte systém příkazem reboot: systemd odpojí všechny stále nasazen oddíly. Nezapomeňte odstranit instalační médium a potom se přihlásit do nového systému pod root účtem.\n\n"
    },
    {
      "title": "Po instalaci",
      "level": 2,
      "content": "Vizte obecná doporučení pro návod, jak spravovat systém (vytváření uživatelských účtů bez práv, nastavování grafického rozhraní, zvuku či touchpadu, atd.).\n\nPro plný seznam aplikací, o které byste mohli mít zájem, vizte seznam aplikací.\n\n"
    }
  ]
}