{
  "title": "Install from SSH (Español)",
  "url": "https://wiki.archlinux.org/title/Install_from_SSH_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-11-13** \n\nEste artículo está destinado a mostrar a los usuarios cómo instalar Arch de forma remota a través de una conexión SSH. Considere este enfoque cuando el servidor se encuentra en un lugar remoto o si desea utilizar la capacidad de copiar/pegar de un cliente SSH para realizar la instalación de Arch.\n\n"
    },
    {
      "title": "En la máquina remota (destino)",
      "level": 2,
      "content": "Arranque la máquina de destino en un entorno live de Arch a través de una imagen USB/CD Live: esto registrará al usuario como root.\n\nEn este punto, configure la red en la máquina de destino como, por ejemplo, se sugiere en Installation guide (Español)#Conectarse a Internet.\n\nEn segundo lugar, configure una contraseña de root necesaria para una conexión SSH, ya que la contraseña de Arch predeterminada para root está vacía:\n\n```\n# passwd\n```\n\nAhora compruebe que PermitRootLogin yes está presente (y sin comentar) en /etc/ssh/sshd_config. Esta configuración permite el inicio de sesión como root con autenticación de contraseña en el servidor SSH.\n\nFinalmente, inicie el demonio openssh con sshd.service, que se incluye por defecto en el CD live.\n\n"
    },
    {
      "title": "En la máquina local",
      "level": 2,
      "content": "En la máquina local, conéctese a la máquina de destino a través de SSH con la siguiente orden:\n\n```\n$ ssh root@ip.address.of.target\n```\n\nA partir de aquí se le presentará el mensaje de bienvenida del entorno live y podrá administrar la máquina de destino como si estuviera sentado frente a su teclado físico. En este punto, si la intención es simplemente instalar Arch desde el soporte live, siga la Installation guide (Español). Si la intención es editar una instalación de Linux existente con problemas, siga el artículo de la wiki Install from existing Linux (Español).\n\n"
    }
  ]
}