{
  "title": "Installing Arch Linux on a USB key (Español)",
  "url": "https://wiki.archlinux.org/title/Installing_Arch_Linux_on_a_USB_key_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-11-08** \n\nArtículos relacionados\n\n- Installation guide (Español)\n- General recommendations (Español)\n- General troubleshooting (Español)\n\nEsta página describe cómo realizar una instalación normal de Arch en una llave USB (o «unidad flash»). A diferencia de un USB como soporte de instalación, el usb live daría como resultado la instalación de un sistema de forma permanente en una unidad flash USB idéntica a como resultaría una instalación normal sobre un disco HDD.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Hay varias maneras de instalar Arch en una memoria USB, dependiendo del sistema operativo disponible:\n\n- Si tenemos otro equipo disponible con linux (que no tiene por que ser con Arch), podemos seguir las instrucciones para Install from existing Linux.\n- Podemos también utilizar un CD/USB de Arch Linux para instalar Arch en la llave USB, arrancando el CD/USB y siguiendo las instrucciones de la installation guide (Español). Si arrancamos desde un USB Live, la instalación tendrá que hacerse en una memoria USB diferente.\n- Si ejecuta OS X o Windows, descargue VirtualBox, instale VirtualBox Extensions, agregue la unidad USB a una máquina virtual que ejecuta Arch (por ejemplo, ejecutandola desde una iso), apunte la instalación a la unidad USB mientras usa las instrucciones de installation guide (Español).\n\n"
    },
    {
      "title": "Ajustes de instalación",
      "level": 3,
      "content": "- Antes de crear el disco RAM inicial en /etc/mkinitcpio.conf mueva los hooks block y keyboard antes del hook autodetect. Esto es necesario para permitir el arranque en múltiples sistemas, cada uno de los cuales requiere diferentes módulos en el espacio de usuario temprano.\n- Se recomienda encarecidamente revisar el artículo wiki sobre reducir las lecturas/escrituras del disco antes de seleccionar un sistema de archivos. Para resumir, ext4 sin journal debe estar bien, que puede crearse con # mkfs.ext4 -O \"^has_journal\" /dev/sdXX. El inconveniente obvio de usar un sistema de archivos con el journal inhabilitado es la pérdida de datos como resultado de un desmontaje forzoso. Hay que reconocer que una unidad flash tiene un número limitado de escrituras, y un sistema de archivos con journald tomará algunas de estas a medida que se actualice el diario. Por esta misma razón, es mejor olvidar la partición de intercambio. Tenga en cuenta que esto no afecta a la instalación en una unidad USB.\n- Si desea poder seguir utilizando el dispositivo USB de almacenamiento masivo como unidad extraíble multiplataforma, puede lograrse mediante la creación de una partición que contenga un sistema de archivos adecuado (probablemente NTFS o exFAT). Tenga en cuenta que la partición de datos puede necesitar ser la primera partición en el dispositivo, ya que Windows asume que solo puede haber una partición en un dispositivo extraíble, y de lo contrario montará automáticamente una partición del sistema EFI. Recuerde instalar dosfstools y ntfs-3g. Algunas herramientas están disponibles en línea que pueden permitirle cambiar sobre la marcha el bit de medios extraíbles (RMB) en su dispositivo USB de almacenamiento masivo. Esto engañaría a los sistemas operativos para tratar su dispositivo USB de almacenamiento masivo como un disco duro externo y le permitiría usar cualquier esquema de partición que elija.\n\nNote: **no** \n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "- Asegúrese de que el archivo /etc/fstab incluye la información de la partición correcta para / y para cualquier otra partición en la llave USB. Si la llave USB va a ser usada para arrancar en varias máquinas, es muy probable que los dispositivos y el número de los discos duros disponibles varíen. Por lo tanto, es aconsejable el uso de UUID o etiquetas:\n\n- Para obtener los UUID apropiados de las particiones utilice la orden blkid.\n\n- Cuando GRUB es instalado en la llave USB, la llave será siempre hd0,0\n- Parece que las versiones actuales de GRUB usan automáticamente, por defecto, uuid. Las instrucciones siguientes son para GRUB legacy.\n\n"
    },
    {
      "title": "GRUB legacy",
      "level": 3,
      "content": "menu.lst, el archivo de configuración de GRUB legacy, debe ser modificado para que coincida (más o menos) con el siguiente:\n\nCuando se utiliza la etiqueta («label»), el archivo menu.lst debería mostrar este aspecto:\n\n```\nroot (hd0,0)\nkernel /boot/vmlinuz-linux root=/dev/disk/by-label/Arch rw\ninitrd /boot/initramfs-linux.img\n```\n\nY, si se usa UUID, debería mostrar este otro:\n\n```\nroot (hd0,0)\nkernel /boot/vmlinuz-linux root=/dev/disk/by-uuid/3a9f8929-627b-4667-9db4-388c4eaaf9fa rw\ninitrd /boot/initramfs-linux.img\n```\n\n"
    },
    {
      "title": "GRUB",
      "level": 3,
      "content": "En GPT con instalaciones UEFI, asegúrese de seguir las instrucciones de GRUB (Español)#Sistemas UEFI e incluya la opción --removable ya que, de lo contrario, puede romper las instalaciones existentes de GRUB, como en la siguiente órden:\n\n```\n# grub-install --target=x86_64-efi --efi-directory=esp  --removable --recheck\n```\n\n"
    },
    {
      "title": "Syslinux",
      "level": 3,
      "content": "Usando la UUID:\n\n```\nLABEL Arch\n        MENU LABEL Arch Linux\n        LINUX ../vmlinuz-linux\n        APPEND root=UUID=3a9f8929-627b-4667-9db4-388c4eaaf9fa rw\n        INITRD ../initramfs-linux.img\n```\n\n"
    },
    {
      "title": "Controladores de entrada",
      "level": 4,
      "content": "Para uso con el portátil (o para utilizar una pantalla táctil), necesitará el paquete xf86-input-synaptics para trabajar con la pantalla/panel táctil.\n\nPara obtener instrucciones sobre puesta a punto o problemas del touchpad, consulte el artículo Touchpad Synaptics (Español).\n\n"
    },
    {
      "title": "Controladores de vídeo",
      "level": 4,
      "content": "Note: **no** \n\nPara admitir las GPU más comunes, instale xf86-video-vesa, xf86-video-ati, xf86-video-intel, xf86-video-amdgpu y xf86-video-nouveau.\n\n"
    },
    {
      "title": "Nombres permanentes para los dispositivos de bloques",
      "level": 4,
      "content": "Se recomienda utilizar UUID, tanto en fstab (Español) como en la configuración del gestor de arranque. Véase Persistent block device naming (Español) para obtener más detalles.\n\nComo alternativa, puede crear reglas udev para crear un enlace simbólico personalizado para la llave USB. A continuación, utilice este enlace simbólico en fstab y en la configuración del gestor de arranque. Véase Udev#Setting static device names para obtener más detalles.\n\n"
    },
    {
      "title": "Parámetros del kernel",
      "level": 4,
      "content": "Es posible que desee desactivar KMS, por diversas razones, tales como evitar una pantalla en blanco o un error de «no signal» en la pantalla, al usar algunas tarjetas de vídeo Intel, etc. Para desactivar KMS, añada nomodeset como parámetro del kernel. Consulte el artículo sobre los Kernel parameters (Español) para obtener más información.\n\n"
    },
    {
      "title": "Arranque desde medios USB 3",
      "level": 4,
      "content": "Véa [1][enlace roto 2023-06-17].\n\n"
    },
    {
      "title": "Compatibilidad",
      "level": 3,
      "content": "La imagen fallback se debe utilizar para obtener una máxima compatibilidad.\n\n"
    },
    {
      "title": "Optimizar la vida útil de la memoria flash",
      "level": 3,
      "content": "- Es posible que desee configurar journald para almacenar sus diarios en la RAM, por ejemplo, creando un archivo de configuración personalizado:\n\n```\n/etc/systemd/journald.conf.d/usbstick.conf\n```\n\n```\n[Journal]\nStorage=volatile\nRuntimeMaxUse=30M\n```\n\n- Para desactivar fsync y las llamadas al sistema relacionadas en los navegadores web y otras aplicaciones que no escriben datos esenciales, use la orden eatmydata de libeatmydata para evitar tales llamadas al sistema:\n\n```\n$ eatmydata firefox\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Install Arch Linux from VirtualBox\n- Solid State Drives\n\n"
    }
  ]
}