{
  "title": "Install Arch Linux with accessibility options (Português)",
  "url": "https://wiki.archlinux.org/title/Install_Arch_Linux_with_accessibility_options_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "A mídia de instalação oficial do Arch Linux oferece suporte a vários recursos de Acessibilidade:\n\n- fala é fornecida pelo pacote espeakup\n- suporte a terminal braille é gerenciado pelo pacote brltty\n\nEste documento descreve como instalar o Arch Linux usando esses recursos.\n\n"
    },
    {
      "title": "Inicializar o ambiente live",
      "level": 3,
      "content": "Quando a mídia de instalação começar a inicializar, pressione Seta para baixo seguido por Enter para habilitar a inicialização com fala habilitada.\n\nDispositivos braille USB devem ser detectados automaticamente via udev.\n\n"
    },
    {
      "title": "Várias placas de som",
      "level": 3,
      "content": "Se o seu computador tiver várias placas de som, você ouvirá a seguinte mensagem: Please select your sound card for speech output. Significa \"Por favor, selecione sua palca de som para a fala.\"\n\nAo ouvir um bipe na saída que gostaria de usar, pressione Enter para selecionar a placa.\n\n"
    },
    {
      "title": "Alterar o idioma da fala",
      "level": 3,
      "content": "Para alterar a voz/idioma do espeak-ng usado por espeakup.service, edite a unit de forma que o código de idioma seja anexado ao default_voice= na diretiva Environment=.\n\nVocê também pode alterar a variante de voz do espeak-ng anexando +variante ao código de idioma. Veja espeakup(8) e espeak-ng(1) para mais informações.\n\n"
    },
    {
      "title": "Instalar os pacotes essenciais",
      "level": 3,
      "content": "Para suporte de fala no sistema instalado, você precisa de espeakup e alsa-utils. Se você usa um dispositivo braille, instale o pacote brltty.\n\nAnexe os pacotes necessários à chamada pacstrap(8) ao instalar:\n\n```\n# pacstrap /mnt base linux linux-firmware espeakup alsa-utils\n```\n\n"
    },
    {
      "title": "Placa de som",
      "level": 3,
      "content": "Se #Várias placas de som foram detectadas, copie o arquivo /etc/asound.conf, o qual foi gerado na mídia de instalação:\n\n```\n# cp /etc/asound.conf /mnt/etc/\n```\n\n"
    },
    {
      "title": "Habilitar os serviços",
      "level": 3,
      "content": "Para ter suporte de voz após inicializar no sistema instalado, você precisa habilitar espeakup.service. Veja também #Alterar o idioma da fala.\n\n"
    },
    {
      "title": "Reiniciar",
      "level": 2,
      "content": "Depois de inicializar no sistema recém-instalado, ele deve começar a falar automaticamente.\n\n"
    }
  ]
}