{
  "title": "Instalar Arch Linux em uma mídia removível",
  "url": "https://wiki.archlinux.org/title/Instalar_Arch_Linux_em_uma_m%C3%ADdia_remov%C3%ADvel",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Guia de instalação\n- Recomendações gerais\n- Solução de problemas gerais\n- Instalar Arch Linux do VirtualBox\n- Unidades de estado sólido\n\nEsta página explica como realizar uma instalação normal do Arch em uma mídia removível (como um pendrive ou, em inglês, de USB key). Em contraste com o fato de ter um LiveUSB coberto em Mídia de instalação em flash USB, o resultado será uma instalação persistente idêntica à instalação normal em HDD.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Existem várias maneiras de instalar o Arch em uma mídia removível, dependendo do sistema operacional disponível:\n\n- Se você tem outro computador Linux disponível (não precisa ser o Arch), você pode seguir as instruções em Instalar a partir de um Linux existente.\n- Um Arch Linux CD/USB pode ser usado para instalar o Arch na mídia removível, através da inicialização do CD/USB e seguindo o guia de instalação. Se for inicializar de um Live USB, a instalação não poderá ser feita na mesma mídia removível por meio do qual você inicializando.\n- Se você usar Windows ou macOS, faça o download do VirtualBox, instale as VirtualBox Extensions, conecte sua mídia removível a uma máquina virtual com Linux (seja já instalado ou por uma ISO live) e aponte a instalação para a unidade agora conectada enquanto usa as instruções no Guia de instalação.\n\n"
    },
    {
      "title": "Ajustes na instalação",
      "level": 3,
      "content": "- Antes de criar o disco de RAM inicial, em /etc/mkinitcpio.conf mova os hooks block e keyboard antes do hook autodetect. Isso é necessário para permitir a inicialização em vários sistemas. cada um exigindo módulos diferentes no early userspace.\n- Se você escolheu instalar o Arch Linux em um dispositivo de armazenamento de massa USB e deseja continuar a usá-lo como armazenamento uma unidade removível multiplataforma, isso pode ser feito criando uma partição que hospede um sistema de arquivos apropriado (provavelmente NTFS ou exFAT). Observe que a partição de dados pode precisar ser a primeira partição no dispositivo, pois o Windows pressupõe que só pode haver uma partição em um dispositivo removível e, de outra forma, terá uma montagem automática de uma partição do sistema EFI. Lembre-se de instalar dosfstools e ntfs-3g. Algumas ferramentas estão disponíveis on-line que podem permitir que você mude o Bit de Mídia Removível (RMB) em seu dispositivo de armazenamento USB. Isso faria com que os sistemas operacionais tratassem seu dispositivo de armazenamento USB como um disco rígido externo e permitisse que você usasse qualquer esquema de particionamento escolhido.\n\nNote: **não** \n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "- Certifique-se de que /etc/fstab inclua as informações de partição corretas para / e para quaisquer outras partições no disco. Se a unidade for inicializado em várias máquinas, é bem provável que os dispositivos e o número de discos rígidos disponíveis variem. Por isso, é aconselhável usar o UUID ou o rótulo.\n\nPara obter os UUIDs adequados para sua partição, use lsblk do blkid. Veja Nomeação persistente de dispositivo de bloco#by-uuid para mais informações.\n\n- Quando o GRUB é instalado no disco, o disco sempre será hd0,0.\n- Parece que as versões atuais do GRUB serão automaticamente padronizadas para usar o uuid. As instruções a seguir são para GRUB legado.\n\n"
    },
    {
      "title": "GRUB legado",
      "level": 3,
      "content": "menu.lst, o arquivo de configuração do GRUB legado, deve ser editado para (mais ou menos) corresponder às configurações a seguir.\n\nQuando estiver usando rótulos de sistema de arquivos, seu menu.lst deve se parecer com isso:\n\n```\nroot (hd0,0)\nkernel /boot/vmlinuz-linux root=/dev/disk/by-label/Arch rw\ninitrd /boot/initramfs-linux.img\n```\n\nE para UUID, deve se parecer com isso:\n\n```\nroot (hd0,0)\nkernel /boot/vmlinuz-linux root=/dev/disk/by-uuid/3a9f8929-627b-4667-9db4-388c4eaaf9fa rw\ninitrd /boot/initramfs-linux.img\n```\n\n"
    },
    {
      "title": "GRUB",
      "level": 3,
      "content": "Na GPT com instalações UEFI, certifique-se de seguir as instruções em GRUB (Português)#Sistemas UEFI e incluir a opção --removable, pois isso pode interromper as instalações do GRUB existentes, como no comando abaixo:\n\n```\n# grub-install --target=x86_64-efi --efi-directory=esp --removable --recheck\n```\n\n"
    },
    {
      "title": "Syslinux",
      "level": 3,
      "content": "Usando seu UUID:\n\n```\nLABEL Arch\n        MENU LABEL Arch Linux\n        LINUX ../vmlinuz-linux\n        APPEND root=UUID=3a9f8929-627b-4667-9db4-388c4eaaf9fa rw\n        INITRD ../initramfs-linux.img\n```\n\n"
    },
    {
      "title": "Drivers de vídeo",
      "level": 4,
      "content": "Note: **não** \n\nPara obter suporte às GPUs mais comuns, instale xf86-video-vesa, xf86-video-ati, xf86-video-intel, xf86-video-amdgpu e xf86-video-nouveau.\n\n"
    },
    {
      "title": "Nomenclatura de dispositivos de bloco persistentes",
      "level": 4,
      "content": "Recomenda-se usar o UUID tanto na configuração do fstab quanto na do gerenciador de inicialização. Veja Nomeação persistente de dispositivo de bloco para detalhes.\n\nAlternativamente, você pode criar a regra do udev para criar um link simbólico personalizado para seu disco. Em seguida, use este link simbólico na configuração do fstab e do gerenciador de inicialização. Veja udev#Setting static device names para detalhes.\n\n"
    },
    {
      "title": "Parâmetros do kernel",
      "level": 4,
      "content": "Você pode desabilitar KMS por vários motivos, como obter uma tela em branco ou um erro de \"sem sinal\" no visor, ao usar algumas placas de vídeo Intel, etc. Para desabilitar o KMS, adicione nomodeset como um parâmetro do kernel. Veja Parâmetros do kernel para mais informações.\n\n"
    },
    {
      "title": "Compatibilidade",
      "level": 3,
      "content": "A imagem alternativa deve ser usada para compatibilidade máxima.\n\n"
    },
    {
      "title": "Minimizando o acesso a disco",
      "level": 3,
      "content": "Se você está usando Arch em um pendrive, cartão SD ou outros dispositivos com E/S lenta ou com escritas limitadas, você pode se interessar em minimizar escritas desnecessárias para obter melhor desempenho e longevidade.\n\n- É altamente recomendável revisar o artigo Melhorando o desempenho#Reduzir leituras/escritas no disco antes de selecionar um sistema de arquivos. De forma resumida, para mídias baseadas em flash tal como pendrive e cartões SD, ext4 sem um jornal deve ser servir bem, o qual pode ser criado com # mkfs.ext4 -O \"^has_journal\" /dev/sdXX. A desvantagem óbvia de usar um sistema de arquivos com o journaling desativado é a perda de dados como resultado de uma desmontagem desajeitada. Reconheça que o flash tem um número limitado de gravações, e um sistema de arquivos com journaling levará alguns deles à medida que o journal for atualizado. Por esse mesmo motivo, é melhor nem pensar a partição swap. Observe que isso não afeta a instalação em um disco rígido portátil.\n- Você pode querer configurar o journal do systemd para armazenar seus journals na RAM, por exemplo, criando um arquivo de configuração personalizado:\n\n```\n/etc/systemd/journald.conf.d/usbstick.conf\n```\n\n```\n[Journal]\nStorage=volatile\nRuntimeMaxUse=30M\n```\n\n- Para desabilitar fsync e chamadas de sistema relacionadas em navegadores web e outros aplicativos que não escrevem dados essenciais, use o comando eatmydata do libeatmydata para evitar tais chamadas de sistema:\n\n```\n$ eatmydata firefox\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- ALMA - Um utilitário escrito em Rust para criar automaticamente instalações persistentes em USB do Arch Linux Live.\n- Arch Linux USB - A excelente descrição do c-magyar sobre a criação de uma instalação persistente do Live USB.\n- archuseriso - Modelos para compilar imagens ISO live do Arch Linux. Ferramenta de criação de de Live USB com suporte a armazenamento persistente & criptografia.\n\n"
    }
  ]
}