{
  "title": "Installation guide (Română)",
  "url": "https://wiki.archlinux.org/title/Installation_guide_(Rom%C3%A2n%C4%83)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nAcest document este un ghid pentru instalarea Arch Linux din sistemul live bootat cu imaginea de instalare oficială. Înainte de instalare, este recomandată citirea FAQ-ului. Pentru convențiile folosite în acest document, vizitați Help:Reading. Exemplele de cod pot conține substituenți (scriși în italic) care trebuie înlocuiți manual.\n\nPentru instrucțiuni mai detaliate, vizitați articolul respectiv din ArchWiki sau paginile de manual (manpage-urile) fiecărui program, ambele legate de acest link. Pentru a primi ajutor interactiv, vizitați Canalul IRC și forumurile sunt disponibile, de asemenea.\n\nArch Linux ar trebui să meargă pe orice sistem compatibil cu arhitectura x86_64 cu minim 530 MiB RAM. O instalare de bază ar trebui să ocupe mai puțin de 2 GiB de spațiu de stocare. Cum procesul de instalare trebuie să descarce pachete dintr-o arhivă la distanță, acest ghid presupune că o conexiune la internet este disponibilă.\n\n"
    },
    {
      "title": "Pre-instalare",
      "level": 2,
      "content": "Imaginile de instalare și semnăturile lor GnuPG pot fi obținute de pagina de download.\n\n"
    },
    {
      "title": "Verificarea semnăturii",
      "level": 3,
      "content": "Este recomandat să verificați semnătura imaginii înainte de a o folosi, în special când folosiți un mirror HTTP, unde descărcările sunt de obicei predispuse să fie interceptate pentru a servi imagini cu scop intenționat.\n\nPe un sistem cu GnuPG instalat se poate realiza acest lucru descărcând PGP signature (sub Checksums) în folder-ul unde ați descărcat și ISO-ul, și să verificați cu:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nAlternativ, dintr-o instalare existentă Arch Linux, folosiți:\n\n```\n$ pacman-key -v archlinux-version-x86_64.iso.sig\n```\n\n- Semnătura în sine poate fi manipualtă dacă este descărcată de pe un site mirror, în loc să fie descărcată de pe archlinux.org, ca mai de asupra. În acest caz, fiți sigur că cheia publică, care este folosită să decodeze semnătura, este semnată de altă cheie, de încredere. Comanda gpg va arăta amprenta cheiii publice.\n\n- Altă metodă pentru a verifica autenticitatea semnăturii este să vă asigurați că amprenta cheii publice este identică cu amprenta cheii dezvoltatorului Arch Linux care a semnat fișierul ISO. Vizitați Wikipedia:Public-key cryptography pentru mai multe informații despte procesul de autentificare a cheilor publice.\n\n"
    },
    {
      "title": "Bootează mediul live",
      "level": 3,
      "content": "Mediul live poate fi bootat de pe un stick USB, un disc optic sau o rețea cu PXE. Pentru metode alternative de instalare, vizitați Category:Installation process.\n\n- Bootarea de pe un drive care conține media de instalare Arch se poate face de obicei prin apăsarea unei taste în timpul fazei de POST a calculatorului, după cum este indicat pe splash screen. Citiți manualul plăcii de bază pentru detalii.\n- Când apare meniul Arch, selectați Boot Arch Linux și apăsați Enter ca să intrați în mediul de instalare.\n- Vizitați README.bootparams pentru o listă a parametrilor de boot, și packages.x86_64 pentru o listă a pachetelor incluse.\n- Vei fi logat în prima consolă virtuală ca și utilizatorul root, și vei fi prezentat cu un prompt shell Zsh.\n\nCa să schimbi pe o altă consolă, spre exemplu, ca să vezi acest ghid cu ELinks lângă instalare, folosește shortcut-ul Alt+arrow. Pentru a edita fișiere de configurare, nano, vi și vim sunt disponibile.\n\n"
    },
    {
      "title": "Setați layout-ul tastaturii",
      "level": 3,
      "content": "Key-map-ul consolei implicit este US. Layout-urile disponibile pot fi afișate cu:\n\n```\n# ls /usr/share/kbd/keymaps/**/*.map.gz\n```\n\nPentru a modifica layout-ul, adăugați un nume de fișier corespunzător loadkeys(1), omițând calea și extensia fișierului. Spre exemplu, pentru a seta un layout în germană:\n\n```\n# loadkeys de-latin1\n```\n\nFonturile de consolă sunt localizate în /usr/share/kbd/consolefonts/ și pot fi setate de asemenea cu setfont(8).\n\n"
    },
    {
      "title": "Verificați modul de boot",
      "level": 3,
      "content": "Dacă modul UEFI este activat pe o placă de bază UEFI, Archiso va boota Arch Linux via systemd-boot. Pentru a verifica acest lucru, listați folderul efivars:\n\n```\n# ls /sys/firmware/efi/efivars\n```\n\nDacă folderul nu există, sistemul poate a bootat în modul BIOS sau CSM. Citiți manualul plăcii de bază pentru detalii.\n\n"
    },
    {
      "title": "Conectarea la internet",
      "level": 3,
      "content": "Pentru a configura o conexiune la rețea, parcurgeți următorii pași:\n\n- Asigurați-vă că interfața dvs. de rețea este listată și activată, spre exemplu cu ip-link(8): # ip link\n- Conectați-vă la rețea. Conectați cablul Ethernet sau conectați-vă printr-o rețea wireless.\n- Configurați-vă conexiunea la rețea: Adresă IP statică Adresă IP dinamică: folosiți DHCP. Note: Imaginea de instalare activează dhcpcd (dhcpcd@interface.service) pentru dispozitive cu conexiune prin cablu la pornire.\n- Conexiunea poate fi verificată cu ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Adresă IP statică\n- Adresă IP dinamică: folosiți DHCP.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Actualizați data și ora",
      "level": 3,
      "content": "Folosiți timedatectl(1) ca să vă asigurați că data și ora sistemului sunt corecte:\n\n```\n# timedatectl set-ntp true\n```\n\nPentru a verifica starea serviciului, folosiți timedatectl status.\n\n"
    },
    {
      "title": "Partiționați discurile",
      "level": 3,
      "content": "Când discurile sunt recunoscute de sistemul live, acestora li se atribuie un dispozitiv bloc ca și /dev/sda sau /dev/nvme0n1. Pentru a identifica aceste dispozitive, folosiți lsblk sau fdisk.\n\n```\n# fdisk -l\n```\n\nRezultatele care se termină în rom, loop sau airoot pot fi ignorate.\n\nUrmătoarele partiții sunt necesare pentru un dispozitiv ales:\n\n- O partiție pentru folder-ul root /.\n- Dacă UEFI este activat, o partiție de sistem EFI.\n\nDacă doriți să creați dispozitive bloc stivuite pentru LVM, encripție de sistem sau RAID, faceți-o acum.\n\n"
    },
    {
      "title": "Layout-uri exemplu",
      "level": 4,
      "content": "Table content:\nBIOS cu MBR\nPunct de montare | Partiție | Tip de partiție | Dimensiune sugerată\n/mnt | /dev/sdX1 | Linux | Restul dispozitivului\n[SWAP] | /dev/sdX2 | Swap Linux | Peste 512 MiB\nUEFI cu GPT\nPunct de montare | Partiție | Tip de partiție | Dimensiune sugerată\n/mnt/boot sau /mnt/efi | /dev/sdX1 | Partiție de sistem EFI | 260–512 MiB\n/mnt | /dev/sdX2 | Partiția root pentru Linux x86-64 (/) | Restul dispozitivului\n[SWAP] | /dev/sdX3 | Swap Linux | Peste 512 MiB\n\nVizitați și Partitioning#Example layouts.\n\n- Folosiți fdisk sau parted pentru a modifica partition table-ul, spre exemplu fdisk /dev/sdX.\n- Spațiul swap poate fi setat pe un fișier swap pentru sistemele de fișier care suportă asta.\n\n"
    },
    {
      "title": "Formatați partițiile",
      "level": 3,
      "content": "După ce partițiile au fost create, fiecare trebuie să fie formatată cu un sistem de fișiere corespunzător. Spre exemplu, dacă partiția root este pe /dev/sdX1 și va conține sistemul de fișiere ext4, rulați:\n\n```\n# mkfs.ext4 /dev/sdX1\n```\n\nDacă ați creat o partiție pentru swap, inițializați-o cu mkswap:\n\n```\n# mkswap /dev/sdX2\n# swapon /dev/sdX2\n```\n\nVizitați File systems#Create a file system pentru detalii.\n\n"
    },
    {
      "title": "Montați sistemele de fișiere",
      "level": 3,
      "content": "Montați sistemul de fișiere pentru partiția root în folder-ul /mnt, spre exemplu:\n\n```\n# mount /dev/sdX1 /mnt\n```\n\nCreați orice alte puncte de montare (ca și /mnt/efi) și montați-le partițiile corespunzătoare.\n\ngenfstab(8) va detecta mai târziu sistemele de fișiere montate și spațiul swap.\n\n"
    },
    {
      "title": "Selectați mirror-urile",
      "level": 3,
      "content": "Pachetele care trebuie instalate trebuie să fie descărcate de pe servere mirror, care sunt definite în /etc/pacman.d/mirrorlist. Pe sistemul live, toate mirror-urile sunt activate, și sunt sortate după starea lor de sincronizare și viteza lor atunci când imaginea de instalare a fost creată.\n\nCu cât un mirror este plasat mai sus în listă, cu atât are mai multă prioritate atunci când un pachet este descărcat. Este de prefereat să editați fisierul și să mutați mirror-urile mai aproape de dumneavoastră, geografic vorbind, și să le puneți pe primele locuri, totuși și alte criterii trebuie luate în considerare.\n\nAcest fișier va fi mai târziu copiat pe sistemul nou cu ajutorul pacstrap, deci merită editat corect.\n\n"
    },
    {
      "title": "Instalați pachete esențiale",
      "level": 3,
      "content": "Folosiți scriptul pacstrap(8) pentru a instala pachetul base, kernel-ul Linux și firmware pentru hardware uzual:\n\n```\n# pacstrap /mnt base linux linux-firmware\n```\n\nPachetul base nu include toate uneltele din instalarea live, așa că instalarea altor pachete poate fi necesară pentru funcționarea deplină a unui sistem de bază. Considerați instalarea acestor pachete în particular:\n\n- utilități pentru administrarea sistemelor de fisiere care vor fi folosite pe sistem,\n- utilități pentru accesarea partițiilor RAID sau LVM,\n- firmware specific pentru alte dispozitive care nu sunt incluse în linux-firmware,\n- software necesar pentru networking,\n- un editor de texte,\n- pachete pentru accesarea documentării din paginile man și info: man-db, man-pages și texinfo.\n\nPentru a instala alte pachete sau grupuri de pachete, adăugați-le numele la comanda pacstrap de deasupra (separate prin spații) sau folosiți pacman în timp ce sunteți într-un chroot pe noul sistem. Pentru comparație, pachetele valabile în sistemul live pot fi găsite în packages.x86_64.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Generați un fișier fstab (folosiți -U sau -L ca să definiți după UUID-uri sau label-uri, respectiv):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nVerificați fișierul /mnt/etc/fstab rezultat, și editați-l în caz că au apărut erori.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Schimbați root-ul în noul sistem:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Fus orar",
      "level": 3,
      "content": "Setează fusul orar:\n\n```\n# ln -sf /usr/share/zoneinfo/Regiune/Oraș /etc/localtime\n```\n\nRulează hwclock(8) pentru a genera /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nAceastă comandă presupune că ceasul hardware este setat pentru UTC. Vizitați System time#Time standard pentru detalii.\n\n"
    },
    {
      "title": "Localizare",
      "level": 3,
      "content": "Editați /etc/locale.gen și decomentați en_US.UTF-8 UTF-8 și alte locale-uri necesare. Generați locale-urile folosind:\n\n```\n# locale-gen\n```\n\nCreați fișierul locale.conf(5), și setați variabila LANG în consecință:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_US.UTF-8\n```\n\nDacă ați setat layout-ul tastaturii, făceți-vă schimbările persistente în vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=de-latin1\n```\n\n"
    },
    {
      "title": "Configurarea rețelei",
      "level": 3,
      "content": "Creați fișierul hostname:\n\n```\n/etc/hostname\n```\n\n```\nmyhostname\n```\n\nAdăugați intrări potrivite la hosts(5):\n\n```\n/etc/hosts\n```\n\n```\n127.0.0.1\tlocalhost\n::1\t\tlocalhost\n127.0.1.1\tmyhostname.localdomain\tmyhostname\n```\n\nDacă sistemul are o adresă IP permanentă, ar trebui să fie folosită în loc de 127.0.1.1.\n\nCompletați configurarea rețelei pentru noul instalat mediu, asta include și instalarea managerului de rețea preferat.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Crearea unui initramfs nou nu este necesară de obicei, deoarece mkinitcpio a fost rulat la instalarea pachetului kernelului ales cu pacstrap.\n\nPentru LVM, criptare de sistem sau RAID, modificați mkinitcpio.conf(5) și recreați imaginea initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Parola utilizatorului root",
      "level": 3,
      "content": "Setați parola pentru utilizatorul root:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Boot loader",
      "level": 3,
      "content": "Alegeți și instalați un boot loader capabil de Linux. Dacă aveți un procesor Intel sau AMD, activați actualizări pentru microcode.\n\n"
    },
    {
      "title": "Reboot",
      "level": 2,
      "content": "Ieșiți din mediul chroot scriind exit sau apăsând Ctrl+d.\n\nOptional, puteți demonta toate partițiile cu umount -R /mnt: Această comandă permite observarea oricăror partiții \"busy\", și găsirea cauzei cu fuser(1).\n\nÎn cele din urmă, reporniți calcularorul scriind reboot: orice partiție care este încă montată va fi demontată automat de către systemd. Țineți minte să scoateți mediul de instalare și să vă logați în noul sistem cu contul root.\n\n"
    },
    {
      "title": "Post-instalare",
      "level": 2,
      "content": "Vizitați General recommendations pentru direcții de gesionare a sistemului și tutoriale post-instalare (ca și configurarea unei interfațe grafice, sunet sau un touchpad).\n\nPentru o listă de programe care pot fi de interes, vizitați List of applications.\n\n"
    }
  ]
}