{
  "title": "Installation guide (Suomi)",
  "url": "https://wiki.archlinux.org/title/Installation_guide_(Suomi)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Tämä sivu on opas Arch Linuxin asentamiseen viralliselta levykuvalta live-ympäristöstä. Asennusmedia sisältää helppokäyttö ominaisuuksia, joita on himean kuvailtu sivulla Install Arch Linux with accessibility options. Muita asennustapoja löytyy täältä Category:Installation process.\n\nEnnen asentamista on suotavaa lukea usein kysytyt kysymykset. Lue tällä sivulla käytettävistä käytännöistä sivulta Help:Reading (Suomi). Erityisesti, koodiesimerkeissä kursivoidut kohdat täytyy korvata manuaalisesti.\n\nTarkempia ohjeita varten lue vastaavat ArchWiki-artikkelit tai ohjelmien ohjekirjat, jotka molemmat on linkitetty tästä oppaasta. Interaktiiviseen apuun IRC-kanava ja foorumi on myös saatavilla.\n\nArch Linuxin pitäisi toimia millä tahansa x86_64-yhteensopivalla tietokoneella, jossa on vähintään 512 MiB keskusmuistia, vaikkakin muistia vaaditaan enemmän live järjestelmän käynnistämiseen. [1] Perusasennuksen pitäisi viedä alle 2 GiB levytilaa. Koska asennusprosessin pitää saada paketteja etävarastosta, tämä opas olettaa, että toimiva internet-yhteys on saatavilla.\n\n"
    },
    {
      "title": "Asennusmedian lataaminen",
      "level": 3,
      "content": "Käy lataus sivulla ja, riippuen siitä miten halutaan järjestelmä käynnistää, lataa joko ISO-tiedosto tai netboot levykuva ja sitä vastaava GnuPG-allekirjoitus.\n\n"
    },
    {
      "title": "Varmenna allekirjoitus",
      "level": 3,
      "content": "On suotavaa varmentaa levykuvan allekirjoitus ennen sen käyttöä, varsinkin kun käytetään HTTP-peiliä, missä lataukset ovat yleensä alttiita kaappauksille, joilla levitetään haitallisia levykuvia.\n\nJärjestelmissä, joissa GnuPG on asennettuna, voidaan tämä tehdä lataamalla PGP-allekirjoitus (kohdasta Tarkistussummat lataus sivulla) ISO-hakemistoon, ja varmentamalla se komennolla:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nVaihtoehtoisesti, olemassa olevasta Arch Linux -asennuksesta aja:\n\n```\n$ pacman-key -v archlinux-versio-x86_64.iso.sig\n```\n\n- Allekirjoitus itsessään voi olla peukaloitu jos se ladataan peilisivustolta, sen sijaan, että se ladattaisiin sivustolta archlinux.org kuten yllä. Tässä tapauksessa varmista, että julkinen avain, jota käytetään allekirjoituksen purkamiseen, on toisen luotettavan avaimen varmentama. Komento gpg tulostaa julkisen avaimen sormenjäljen.\n- Toinen tapa varmentaa allekirjoituksen todenperäisyys on varmistaa, että julkisen avaimen sormenjälki on identtinen Arch Linux -kehittäjän kanssa, joka allekirjoitti ISO-tiedoston. Katso Wikipedia:Public-key cryptography lisää tietoa julkisella avaimella tehtävästä prosessista autentikoida avaimia.\n\n"
    },
    {
      "title": "Valmistele asennusmedia",
      "level": 3,
      "content": "Levykuva voidaan tuoda kohdekoneelle USB-tikulla, optisella levyllä tai verkosta PXE:n avulla: seuraa sopivaa artikkelia omaa asennusmediaa varten valitusta levykuvasta.\n\n"
    },
    {
      "title": "Käynnistä live-ympäristö",
      "level": 3,
      "content": "1. Nykyisen käynnistyslaitteen osoittaminen Arch-asennusmediaan saadaan yleensä painamalla näppäintä POST -vaiheen aikana, kuten aloitusnäytössä kerrotaan. Lue lisää emolevysi ohjekirjasta.\n1. Kun asennusmedian alkulatausohjelma ilmestyy, valitse Arch Linux install medium ja paina Enter -näppäintä päästäksesi asennusympäristöön.\n\n1. Sinut kirjataan ensimmäiseen virtuaalikonsoliin juurikäyttäjänä Zsh -kehotteeseen.\n\nJos haluat vaihtaa eri konsoliin - esimerkiksi tämän oppaan lukemista varten Lynx -sovelluksen avulla asennuksen rinnalla - käytä Alt+nuoli näppäimiä. Muokataksesi asetustiedostoja, mcedit(1), nano ja vim ovat saatavilla.\n\n"
    },
    {
      "title": "Aseta näppäinasettelu",
      "level": 3,
      "content": "Oletus konsolin näppäinasettelu on US. Saatavilla olevat asettelut voidaan listata komennolla:\n\n```\n# ls /usr/share/kbd/keymaps/**/*.map.gz\n```\n\nMuokataksesi asettelua lisää vastaava tiedostonimi loadkeys(1) -komennon perään, jättäen pois hakemistopolun ja tiedostoliitteen. Esimerkiksi asettaaksesi suomenkielisen näppäinasettelun:\n\n```\n# loadkeys fi\n```\n\nKonsolifontit sijaitsevat hakemistossa /usr/share/kbd/consolefonts/ ja ne voidaan samalla tavoin asettaa komennolla setfont(8).\n\n"
    },
    {
      "title": "Varmista käynnistystila",
      "level": 3,
      "content": "Jos UEFI-tila on käytössä UEFI -emolevyllä, Archiso käynnistää Arch Linuxin sen mukaisesti ohjelmalla systemd-boot. Tämän varmistamiseksi listaa efivars -hakemisto:\n\n```\n# ls /sys/firmware/efi/efivars\n```\n\nJos yllä olevalla komennolla polku näkyy ilman virheitä, järjestelmä on käynnistynyt UEFI tilassa. Jos hakemistoa ei löydy, tietokone voi olla käynnistetty BIOS-tilassa (tai CSM-tilassa). Jos järjestelmä ei käynnistynyt odotetussa tilassa, lue emolevysi ohjekirjasta lisätietoja.\n\n"
    },
    {
      "title": "Yhdistä internetiin",
      "level": 3,
      "content": "Käy läpi seuraavat vaiheet verkkoyhteyden luomiseksi live ympäristössä:\n\n- Varmistetaan, että verkkokortti on listattu ja käytössä, esimerkiksi komennolla ip-link(8): # ip link\n- Langalliselle yhteydelle, varmistetaan ettei verkkokortti ole estettynä komennolla rfkill.\n- Yhdistetään verkkoon: Ethernet—kaapeli kiinnitettynä. Wi-Fi—todennetaan verkkoyhteys langattomaan verkkoon komennolla iwctl.\n- Verkkoyhteyden konfigurointi: DHCP: dynaamisen IP osoitteen ja DNS palvelimen osoittaminen (tulee systemd-networkd ja systemd-resolved) tulisi toimia suorilteen langallisille ja langattomille verkkokäyttöliittymille. Staattinen IP osoite: katso Verkon konfigurointi#Staattinen IP osoite.\n- Yhteys voidaan varmistaa ping -komennolla: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernet—kaapeli kiinnitettynä.\n- Wi-Fi—todennetaan verkkoyhteys langattomaan verkkoon komennolla iwctl.\n\n- DHCP: dynaamisen IP osoitteen ja DNS palvelimen osoittaminen (tulee systemd-networkd ja systemd-resolved) tulisi toimia suorilteen langallisille ja langattomille verkkokäyttöliittymille.\n- Staattinen IP osoite: katso Verkon konfigurointi#Staattinen IP osoite.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Päivitä järjestelmän kello",
      "level": 3,
      "content": "Käytä työkalua timedatectl(1) varmistamaan, että järjestelmän kello on oikeassa:\n\n```\n# timedatectl set-ntp true\n```\n\nTarkistaaksesi palvelun tilan, käytä timedatectl status.\n\n"
    },
    {
      "title": "Osioi levyt",
      "level": 3,
      "content": "Kun live-järjestelmä tunnistaa lohkolaitteet, se liittää ne kuten /dev/sda, /dev/nvme0n1 tai /dev/mmcblk0. Näiden laitteiden tunnistamiseen käytä työkalua lsblk tai fdisk.\n\n```\n# fdisk -l\n```\n\nJos tulos päättyy kirjaimiin rom, loop tai airoot, se voidaan jättää huomioimatta.\n\nSeuraavat osiot ovat pakollisia valitulle laitteelle:\n\n- Yksi osio juurihakemistolle /.\n- Jos UEFI on käytössä, EFI-järjestelmäosio.\n\nJos haluat luoda pinottuja lohkolaitteita LVM:lle, järjestelmän salauksen tai RAID:n, tee se nyt.\n\n"
    },
    {
      "title": "Esimerkkikaaviot",
      "level": 4,
      "content": "Table content:\nKiinnityskohta | Osio | Osion tyyppi | Suositeltava koko\n/mnt | /dev/sdX1 | Linux | Loput laitteesta\n[SWAP] | /dev/sdX2 | Linux swap -osio | Yli 512 MiB\n\nTable content:\nKiinnityskohta | Osio | Osion tyyppi | Suositeltava koko\n/mnt/boot tai /mnt/efi | /dev/sdX1 | EFI-järjestelmäosio | 260–512 MiB\n/mnt | /dev/sdX2 | Linux x86-64 -juuri (/) | Loput laitteesta\n[SWAP] | /dev/sdX3 | Linux swap -osio | Yli 512 MiB\n\nKatso myös Partitioning#Example layouts.\n\n- Käytä työkalua fdisk tai parted osiointitaulukoiden muokkaamiseen, esimerkiksi fdisk /dev/sdX.\n- Swap -osion sijasta voidaan käyttää swap-tiedostoa niissä tiedostojärjestelmissä, jotka sitä tukevat.\n- Jos levy josta halutaan käynnistää sisältää jo EFI järjestelmän osion, älä luo toista, vaan käytä jo olemassa olevaa osiota sen sijaan.\n\n"
    },
    {
      "title": "Alusta osiot",
      "level": 3,
      "content": "Kun osiot on luotu, jokainen osio täytyy alustaa sopivalla tiedostojärjestelmällä. Esimerkiksi jos juuriosio on /dev/sdX1 ja se sisältää ext4 -tiedostojärjestelmän, aja:\n\n```\n# mkfs.ext4 /dev/sdX1\n```\n\nJos loit osion swap-tilalle, valmistele se työkalulla mkswap:\n\n```\n# mkswap /dev/sdX2\n```\n\nKatso artikkelista File systems#Create a file system lisätietoja.\n\n"
    },
    {
      "title": "Kiinnitä tiedostojärjestelmät",
      "level": 3,
      "content": "Kiinnitä tiedostojärjestelmä juuriosiolla kohtaan /mnt, esimerkiksi:\n\n```\n# mount /dev/sdX1 /mnt\n```\n\nLuo loput kiinnityskohdat (kuten /mnt/efi) käyttäen mkdir(1) ja kiinnitä vastaavat osiot.\n\nJos loit swap osion, aktivoi se käyttäen swapon(8):\n\n```\n# swapon /dev/sdX1\n```\n\ngenfstab(8) myöhemmin tunnistaa kiinnitetyt tiedostojärjestelmät ja swap-tilan.\n\n"
    },
    {
      "title": "Valitse peilit",
      "level": 3,
      "content": "Asennettavat paketit täytyy ladata peilipalvelimilta, jotka on määritetty tiedostossa /etc/pacman.d/mirrorlist. Live-järjestelmässä kaikki peilit on käytössä ja ne on järjestetty synkronointitilansa ja nopeutensa mukaan sillä hetkellä, kun levykuva luotiin.\n\nMitä korkeammalla peili on luettelossa, sitä suurempi prioriteetti sillä on, kun paketteja ladataan. Kannattaa muokata tiedostoa vastaavasti, ja siirtää maantieteellisesti lähimmät peilit luettelon alkuun, vaikka muutkin kriteerit tulee ottaa huomioon.\n\nTämä tiedosto kopioidaan myöhemmin uuteen järjestelmään työkalulla pacstrap, joten kannattaa muokata se nyt.\n\n"
    },
    {
      "title": "Asenna välttämättömät paketit",
      "level": 3,
      "content": "Käytä pacstrap(8) -skriptiä base-paketin, Linux-kernelin ja yleisen laitteiston laiteohjelmiston asentamiseen:\n\n```\n# pacstrap /mnt base linux linux-firmware\n```\n\nbase-paketti ei sisällä kaikkia asennusympäristön paketteja, joten muiden pakettien asentaminen voi olla tarpeen täysin toimivan perusasennuksen saavuttamiseksi. Erityisesti harkitse seuraavien asentamista:\n\n- käyttäjäympäristön työkalut järjestelmässä käytettävien tiedostojärjestelmien hallintaan,\n- työkalut RAID- tai LVM-osioiden käyttämiseen,\n- tietyt laiteohjelmistot niille laitteille, joita linux-firmware ei kata,\n- ohjelmistot verkkoyhteyksille,\n- tekstinmuokkain,\n- paketit käyttöohjeiden lukemiseen man ja info -sivuilta: man-db, man-pages ja texinfo.\n\nAsentaaksesi muita paketteja tai pakettiryhmiä, lisää pakettien nimet yllä olevan pacstrap-komennon loppuun (välilyönnillä erotettuna) tai käytä työkalua pacman kun olet chrootannut tiedostojärjestelmään. Vertailun vuoksi, live-ympäristössä saatavilla olevat paketit voi löytää osoitteesta packages.x86_64.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Luo fstab-tiedosto (käytä -U tai -L määrittämään UUID tai nimet, vastaavasti):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nTarkista syntyvä /mnt/etc/fstab-tiedosto ja muokkaa, jos jokin ei täsmää.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Vaihda juuri uuteen järjestelmään:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Aikavyöhyke",
      "level": 3,
      "content": "Aseta aikavyöhyke:\n\n```\n# ln -sf /usr/share/zoneinfo/Alue/Kaupunki /etc/localtime\n```\n\nAja hwclock(8) luodaksesi /etc/adjtime -tiedoston:\n\n```\n# hwclock --systohc\n```\n\nTämä komento olettaa, että emolevyn kello on asetettu UTC-aikaan. Katso System time#Time standard lisätietoja.\n\n"
    },
    {
      "title": "Kieli",
      "level": 3,
      "content": "Muokkaa tiedostoa /etc/locale.gen ja poista kommentointi kohdasta en_US.UTF-8 UTF-8 ja muista tarvittavista kielistä. Luo kielet ajamalla komento:\n\n```\n# locale-gen\n```\n\nLuo locale.conf(5) -tiedosto, ja aseta LANG -muuttuja vastaavasti:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_US.UTF-8\n```\n\nJos muutit näppäinasettelua, tee muutoksista pysyvät tiedostolla vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=fi\n```\n\n"
    },
    {
      "title": "Verkon määritys",
      "level": 3,
      "content": "Luo hostname-tiedosto:\n\n```\n/etc/hostname\n```\n\n```\nkoneennimi\n```\n\nLisää täsmäävät kohdat tiedostoon hosts(5):\n\n```\n/etc/hosts\n```\n\n```\n127.0.0.1\tlocalhost\n::1\t\tlocalhost\n127.0.1.1\tkoneennimi.localdomain\tkoneennimi\n```\n\nJos järjestelmällä on kiinteä IP-osoite, käytä sitä 127.0.1.1:n sijaan.\n\nViimeistele verkon määritys juuri asennetulle ympäristölle asentamalla haluamasi verkonhallintatyökalut.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Uuden initramfs -kuvan luominen ei yleensä ole välttämätöntä, koska mkinitcpio ajettiin kernel-paketin asentamisen yhteydessä työkalulla pacstrap.\n\nLVM:ää, järjestelmän salausta tai RAID:ia varten muokkaa mkinitcpio.conf(5) -tiedostoa ja luo initramfs-kuva uudelleen:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Juurikäyttäjän salasana",
      "level": 3,
      "content": "Aseta juurikäyttäjän salasana:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Käynnistin",
      "level": 3,
      "content": "Valitse ja asenna Linux-tuettu käynnistin. Jos sinulla on Intel- tai AMD-prosessori, ota myös microcode-päivitykset käyttöön.\n\n"
    },
    {
      "title": "Käynnistä uudelleen",
      "level": 2,
      "content": "Poistu chroot-ympäristöstä kirjoittamalla exit tai painamalla Ctrl+d.\n\nJos haluat, irrota kaikki osiot manuaalisesti umount -R /mnt: tämän avulla voidaan huomata jumiin jääneet osiot, ja löytämällä syy työkalulla fuser(1).\n\nLopuksi käynnistä tietokone uudelleen kirjoittamalla reboot: systemd irrottaa kaikki osiot. Muista poistaa asennusmedia ja sitten kirjaudu uuteen järjestelmään juurikäyttäjänä.\n\n"
    },
    {
      "title": "Asennuksen jälkeen",
      "level": 2,
      "content": "Katso General recommendations järjestelmän hallintaan ja asennuksen jälkeisiin ohjeisiin (kuten graafisen käyttöliittymän, äänen tai kosketuslevyn määrittämiseen).\n\nKatso List of applications luettelo sovelluksista, joista saatat olla kiinnostunut.\n\n"
    }
  ]
}