{
  "title": "Installation guide (Slovenščina)",
  "url": "https://wiki.archlinux.org/title/Installation_guide_(Sloven%C5%A1%C4%8Dina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ta dokument je vodnik za namestitev Arch Linuxa z uporabo \"živega sistema\" (ang. live system). Tega zapečemo z uradne namestitvene slike na t. i. namestitveni medij, kar je lahko npr. USB ključek. Sistem vsebuje funkcije dostopnosti, ki so opisane na strani Install Arch Linux with accessibility options. Za alternativne načine namestitve glejte Category:Installation process.\n\nPred namestitvijo je priporočljivo pregledati pogosto zastavljena vprašanja. Za konvencije, uporabljene v tem dokumentu, glejte Help:Reading. Še posebej morate biti pozorni pri primerih kode (te so oblikovani tako).\n\nZa podrobnejša navodila glejte ustrezne članke na tem wikiju ali si preberite ustrezno man stran relevantnega programa (oboje se v tem vodniku navaja). Za bolj interaktivno pomoč so na voljo tudi IRC kanal in forumi.\n\nArch Linux načeloma deluje na kateremkoli x86_64-kompatibilnem računalniku z najmanj 512 MiB RAM-a, čeprav je za zagon živega sistema za namestitev potrebno več pomnilnika.[1] Osnovna namestitev naj bi zasedla manj kot 2 GiB prostora na disku. Ker mora postopek namestitve pridobiti pakete iz oddaljenega repozitorija, ta vodnik predpostavlja, da je na voljo delujoča povezava do Interneta.\n\n"
    },
    {
      "title": "Pridobitev namestitvene slike",
      "level": 3,
      "content": "Obiščite stran Download in glede na način zagona pridobite datoteko ISO ali sliko netboot ter ustrezen podpis GnuPG. Če Arch Linux nameščate prvič, po vsej verjetnosti iščete ISO datoteko, ki jo najpreprosteje prenesete preko enega izmed fizično bližnjih zrcalnih repozitorijev, ki so navedeni na isti strani spodaj. Datoteka bo v obliki archlinux-različica-x86_64.iso.\n\n"
    },
    {
      "title": "Preverite podpis",
      "level": 3,
      "content": "Pred uporabo je priporočljivo preveriti podpis namestitvene slike, zlasti pri prenosu iz HTTP zrcal, kjer se lahko zgodi, da je bil prenos prestrežen ter ste prejeli zlonamerno sliko.\n\nV sistemu z nameščenim GnuPG to storite tako, da prenesete podpis ISO PGP (pod Checksums na strani Download) v direktorij, kjer se nahaja prenesen ISO, in ga preverite:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-različica-x86_64.iso.sig\n```\n\nDruga možnost je, da iz obstoječe namestitve Arch Linuxa zaženete:\n\n```\n$ pacman-key -v archlinux-različica-x86_64.iso.sig\n```\n\n- Sam podpis je lahko prirejen, če ga prenesete z zrcalnega spletišča namesto s archlinux.org, kot je navedeno zgoraj. V tem primeru poskrbite, da je javni ključ, ki se uporablja za dešifriranje podpisa, podpisan z drugim, zaupanja vrednim ključem. Ukaz gpg bo prikazal prstni odtis (ang. fingerprint) javnega ključa.\n- Druga metoda za preverjanje pristnosti podpisa je, da se prepričate, da je prstni odtis javnega ključa enak prstnemu odtisu ključa Arch Linux razvijalca, ki je podpisal datoteko ISO. Za več informacij o kriptografiji javnega ključa glejte Wikipedia:Public-key cryptography.\n\n"
    },
    {
      "title": "Pripravite namestitveni medij",
      "level": 3,
      "content": "Namestitveno sliko lahko na ciljnemu računalniku poženete preko USB ključka, optičnega diska ali omrežja z uporabo PXE: sledite ustreznemu članku, da iz izbrane slike sami pripravite namestitveni medij.\n\n"
    },
    {
      "title": "Zaženite živo okolje",
      "level": 3,
      "content": "1. Kot trenutno zagonsko napravo izberite tisto, na kateri je namestitveni medij Arch Linuxa. Običajno to dosežemo s pritiskom tipke ob zagonu računalnika med fazo POST, ko se na zaslonu prikaže logotip proizvajalca matične plošče. Za podrobnosti glejte priročnik vaše matične plošče.\n1. Ko se prikaže meni za zagonski nalagalnik (ang. bootloader) namestitvenega medija, izberite Arch Linux install medium in pritisnite tipko Enter, da vstopite v okolje za namestitev. Tip: Namestitvena slika uporablja GRUB za UEFI in syslinux za BIOS. Za seznam zagonskih parametrov glejte README.bootparams.\n1. V prvo virtualno konzolo boste prijavljeni kot uporabnik root in prikazan vam bo poziv lupine Zsh.\n\nČe želite preklopiti na drugo konzolo - na primer za ogled tega vodnika s spletnim brskalnikom Lynx - uporabite bližnjico Alt+puščica. Za urejanje konfiguracijskih datotek ter ostalih tekstovnih datotek so na voljo mcedit(1), nano in vim. Za seznam paketov, vključenih v namestitveni medij, glejte pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Nastavitev postavitve tipkovnice konzole",
      "level": 3,
      "content": "Privzeta postavitev tipkovnice je US. Razpoložljive postavitve lahko naštejete z:\n\n```\n# ls /usr/share/kbd/keymaps/**/*.map.gz\n```\n\nČe želite nastaviti razporeditev tipkovnice, v ukaz loadkeys(1) podajte ime ustrezne datoteke, pri čemer izpustite pot in končnico datoteke. Na primer, če želite nastaviti slovensko razporeditev tipkovnice:\n\n```\n# loadkeys slovene\n```\n\nFonti za konzolo se nahajajo v /usr/share/kbd/consolefonts/ in jih lahko prav tako nastavite s setfont(8).\n\n"
    },
    {
      "title": "Preverite načina zagona",
      "level": 3,
      "content": "Preden nadaljujete je priporočeno preveriti zagonski način. To storite tako, da preverite direktorij efivars:\n\n```\n# ls /sys/firmware/efi/efivars\n```\n\nČe ukaz prikaže direktorij brez napake, je sistem zagnan v načinu UEFI. Če direktorij ne obstaja, je sistem morda zagnan v načinu BIOS (ali CSM). Če se sistem ni zagnal v želenem načinu, glejte priročnik za osnovno ploščo.\n\n"
    },
    {
      "title": "Povežite se z Internetom",
      "level": 3,
      "content": "Če želite vzpostaviti omrežno povezavo v živem okolju, lahko poskusite naslednje korake:\n\n- Prepričajte se, da je vaš omrežni vmesnik omogočen in izbran, na primer z ip-link(8): # ip link\n- Če uporabljate brezžično omrežje ali WWAN, se prepričajte, da kartica ni blokirana z rfkill.\n- Povežite se z omrežjem: Ethernet - priključite kabel. Wi-Fi - prijavite se v brezžično omrežje z uporabo iwctl. Mobilni širokopasovni modem - povežite se z mobilnim omrežjem z orodjem mmcli.\n- Konfigurirajte omrežno povezavo: DHCP: dinamično dodeljevanje naslovov IP in strežnikov DNS (ki ju zagotavljata systemd-networkd in systemd-resolved) bi moralo delovati takoj po namestitvi za omrežne vmesnike Ethernet, WLAN in WWAN brez dodatnih korakov. Statični naslov IP: sledite Network configuration#Static IP address.\n- Povezavo do Interneta lahko preverite s funkcijo ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernet - priključite kabel.\n- Wi-Fi - prijavite se v brezžično omrežje z uporabo iwctl.\n- Mobilni širokopasovni modem - povežite se z mobilnim omrežjem z orodjem mmcli.\n\n- DHCP: dinamično dodeljevanje naslovov IP in strežnikov DNS (ki ju zagotavljata systemd-networkd in systemd-resolved) bi moralo delovati takoj po namestitvi za omrežne vmesnike Ethernet, WLAN in WWAN brez dodatnih korakov.\n- Statični naslov IP: sledite Network configuration#Static IP address.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Posodobitev sistemske ure",
      "level": 3,
      "content": "V živem okolju je systemd-timesyncd privzeto omogočen: čas se bo samodejno sinhroniziral, ko bo vzpostavljena povezava z Internetom.\n\nUporabite timedatectl(1), da zagotovite točnost sistemske ure:\n\n```\n# timedatectl status\n```\n\n"
    },
    {
      "title": "Particioniranje diskov",
      "level": 3,
      "content": "Ko živi sistem prepozna diske, so ti dodeljeni posameznim blokovnim napravam, ki so poimenovane kot npr. /dev/sda, /dev/nvme0n1, /dev/mmcblk0. Da prepoznate svoje diske, uporabite lsblk ali fdisk:\n\n```\n# fdisk -l\n```\n\nRezultati, ki se končajo z rom, loop ali airoot, lahko zavoljo tega koraka prezrete.\n\nNaslednje particije so obvezne za izbrano napravo, na kateri boste namestili Arch:\n\n- Ena particija za root direktorij /.\n- Pri zagonu v načinu UEFI: sistemska particija EFI.\n\nČe želite katerekoli uporabljene diske urediti v LVM, RAID, ali jih šifrirati, to storite zdaj. Kasneje na nameščenem sistemu je sicer vse našteto še vedno možno, vendar dosti bolj mukotrpno kot sedaj, ko so vaši diski še prazni.\n\nUporabite fdisk ali parted za spreminjanje particijskih tabel. Na primer:\n\n```\n# fdisk /dev/izbrani_disk\n```\n\n- Če se disk ne prikaže, preverite, da diskovni krmilnik ni v načinu RAID.\n- Če je na disku, s katerega želite zagnati že sistemska particija EFI, ne ustvarite nove, temveč uporabite obstoječo particijo.\n- Namesto swap particije lahko uporabite swap datoteko za datotečne sisteme, ki to podpirajo.\n\n"
    },
    {
      "title": "Primeri particijskih tabel",
      "level": 4,
      "content": "Table content:\nPriključna točka | Particija | Vrsta particije | Priporočena velikost\n/mnt/boot1 | /dev/sistemska_particija_EFI | sistemska particija EFI | Vsaj 300 MiB\n[SWAP] | /dev/swap_particija | Linux swap | Več kot 512 MiB\n/mnt | /dev/root_particija | Linux x86-64 root (/) | Preostanek diska\n\n1. Druge priključne točke, kot je /mnt/efi, so možne, dokler je uporabljeni zagonski nalagalnik sposoben naložiti slike jedra in initramfs iz root particije. Glejte opozorilo Arch boot process#Boot loader.\n\nTable content:\nPriključna točka | Particija | Vrsta particije | Priporočena velikost\n[SWAP] | /dev/swap_particija} | Linux swap | Več kot 512 MiB\n/mnt | /dev/root_particija} | Linux | Preostanek naprave\n\nOglejte si tudi Partitioning#Example layouts.\n\n"
    },
    {
      "title": "Formatirajte particije",
      "level": 3,
      "content": "Ko so particije ustvarjene, je treba vsako novo ustvarjeno particijo formatirati z ustreznim datotečnim sistemom. Za podrobnosti glejte File system#Create a file system.\n\nČe želite na primer ustvariti datotečni sistem Ext4 na /dev/root_particija, zaženite:\n\n```\n# mkfs.ext4 /dev/root_particija\n```\n\nČe ste ustvarili particijo za swap, jo inicializirajte z mkswap(8):\n\n```\n# mkswap /dev/swap_particija\n```\n\nČe ste ustvarili sistemsko particijo EFI, jo formatirajte v FAT32 z uporabo mkfs.fat(8).\n\n```\n# mkfs.fat -F 32 /dev/sistemska_particija_efi\n```\n\n"
    },
    {
      "title": "Priključite datotečne sisteme",
      "level": 3,
      "content": "Priključite root particijo na /mnt. Na primer, če je korenska particija /dev/root_particija:\n\n```\n# mount /dev/root_particija /mnt\n```\n\nUstvarite vse preostale priključne točke (na primer /mnt/efi) in priključite ustrezne particije.\n\nPri sistemih UEFI priključite sistemsko particijo EFI:\n\n```\n# mount --mkdir /dev/sistemska_particija_efi /mnt/boot\n```\n\nČe ste ustvarili swap particijo, jo omogočite s swapon(8):\n\n```\n# swapon /dev/swap_particija\n```\n\ngenfstab(8) bo pozneje zaznal nameščene datotečne sisteme in swap prostor.\n\n"
    },
    {
      "title": "Izberite zrcala",
      "level": 3,
      "content": "Paketi, ki jih je treba namestiti, morajo biti preneseni z zrcalnih strežnikov, ki so določeni v /etc/pacman.d/mirrorlist. V živem sistemu reflector po vzpostavitvi povezave z Internetom posodobi seznam zrcal tako, da izbere 20 nazadnje sinhroniziranih zrcal HTTPS in jih razvrsti po hitrosti prenosa.\n\nČim višje je zrcalo na seznamu, tem večjo prednost ima pri prenosu paketa. Morda boste želeli pregledati datoteko in preveriti, ali je zadovoljiva. Če ni, datoteko ustrezno uredite in geografsko najbližja zrcala premaknite na vrh seznama, čeprav je treba upoštevati tudi druga merila.\n\nTo datoteko bo pozneje pacstrap kopiral v novi sistem, zato se z njo splača ukvarjati, čeprav je ponavadi že privzeta različica dovolj dobra.\n\n"
    },
    {
      "title": "Namestite ključne pakete",
      "level": 3,
      "content": "Uporabite skripto pacstrap(8) za namestitev paketa base, jedra Linux kernel in vdelane programske opreme za običajno strojno opremo:\n\n```\n# pacstrap -K /mnt base linux linux linux-firmware\n```\n\n- Paket linux lahko nadomestite z izbranim kernel paketom ali pa ga pri namestitvi v kontejner v celoti izpustite.\n- Pri namestitvi v virtualko ali kontejner lahko izpustite namestitev paketa vdelane programske opreme.\n\nPaket base ne vključuje vseh orodij iz živega okolja, zato bo za popolnoma delujoč osnovni sistem morda potrebna namestitev drugih paketov. Predvsem razmislite o namestitvi:\n\n- uporabniških pripomočkov za upravljanje datotečnih sistemov, ki se bodo uporabljali v sistemu,\n- pripomočkov za dostop do RAID ali LVM naprav,\n- posebne vdelane programske opreme za druge naprave, ki niso vključene v linux-firmware (npr. sof-firmware za zvočne kartice),\n- programske opreme, potrebne za omrežje (npr. upravitelj omrežja ali odjemalec DHCP),\n- urejevalnik besedila,\n- paketi za dostop do dokumentacije na straneh man in info: man-db, man-pages in texinfo.\n\nČe želite namestiti druge pakete ali skupine paketov, dodajte imena zgornjemu ukazu pacstrap (ločeno s presledki) ali uporabite pacman, medtem ko ste priklopljeni v nov sistem. Za primerjavo lahko pakete, ki so na voljo v živem sistemu, najdete v pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Ustvarite datoteko fstab (uporabite -U ali -L za opredelitev po UUID ali oznakah):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nPreverite nastalo datoteko /mnt/etc/fstab in jo v primeru napak uredite.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Spremenite korenski direktorij v nov sistem:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Časovni pas",
      "level": 3,
      "content": "Nastavite časovni pas:\n\n```\n# ln -sf /usr/share/zoneinfo/Regija/Mesto /etc/localtime\n```\n\nSlovenska časovna se na primer nahaja na /usr/share/zoneinfo/Europe/Ljubljana. Zaženi hwclock(8) za ustvarjanje /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nTa ukaz predpostavlja, da je strojna ura nastavljena na UTC. Za podrobnosti glejte System time#Time standard.\n\n"
    },
    {
      "title": "Lokalizacija",
      "level": 3,
      "content": "Uredite /etc/locale.gen in odkomentirajte en_US.UTF-8 UTF-8 in druge potrebne Locale-e, na primer sl_SI.UTF-8 UTF-8. Izbrane lokalizacije ustvarite tako, da zaženete:\n\n```\n# locale-gen\n```\n\nUstvarite datoteko locale.conf(5) in ustrezno nastavi spremenljivko LANG:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_US.UTF-8\n```\n\nČe ste spremenili postavitev tipkovnice konzole, lahko naredite spremembo trajno v vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=slovene\n```\n\n"
    },
    {
      "title": "Konfiguracija omrežja",
      "level": 3,
      "content": "Ustvarite datoteko z imenom naprave:\n\n```\n/etc/hostname\n```\n\n```\nime_naprave\n```\n\nDokončajte konfiguracijo omrežja na novo nameščenem sistemu. To lahko vključuje namestitev ustrezne programske opreme za upravljanje omrežja.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Ustvarjanje novega initramfs običajno ni potrebno, ker je bil mkinitcpio zagnan ob namestitvi paketa base s pacstrap.\n\nZa LVM, šifriranje sistema ali RAID primerno spremenite mkinitcpio.conf(5) in ponovno ustvarite sliko initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Geslo uporabnika root",
      "level": 3,
      "content": "Uporabniku root nastavite geslo:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Zagonski nalagalnik",
      "level": 3,
      "content": "Izberite in namestite zagonski nalagalnik, ki podpira Linux. Če imate procesor Intel ali AMD, omogočite tudi posodobitve mikrokode.\n\n"
    },
    {
      "title": "Ponovni zagon",
      "level": 2,
      "content": "Zapustite okolje chroot tako, da vtipkate exit ali pritisnete Ctrl+d.\n\nPo želji ročno odključite vse particije z umount -R /mnt: tako lahko opazite vse \"zaposlene\" particije in s fuser(1) ugotovite vzrok.\n\nNa koncu ponovno zaženite računalnik z vnosom ukaza reboot: vse še vedno priključene particije bo systemd samodejno odključil. Ne pozabite odstraniti namestitvenega medija in se nato prijavite v novi sistem z uporabnikom root.\n\n"
    },
    {
      "title": "Po namestitvi",
      "level": 2,
      "content": "Glejte Splošna priporočila za navodila za upravljanje sistema in navodila po namestitvi (kot so ustvarjanje neprivilegiranih uporabniških računov, nastavitev grafičnega uporabniškega vmesnika, zvoka ali touchpad-a).\n\nZa seznam aplikacij, ki bi vas lahko zanimale, glejte List of applications.\n\n"
    }
  ]
}