{
  "title": "Installation guide (العربية)",
  "url": "https://wiki.archlinux.org/title/Installation_guide_(%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **هذه الصفحة غير مكتملة! لا تتبع الإرشادات المذكورة هنا.** \n\nهذه المقالة هي دليل لتثبيت آرتش لينكس من نظام حي مشغل من وسيط تثبيت تم إعداده من صورة تثبيت رسمية. وسيط التثبيت يوفر ميزات تسهيل الوصول وهي موصوفة على صفحة ثبت آرتش لينكس مع ميزات تسهيل الوصول. لطرق أخرى للتثبيت انظر تصنيف:عملية التثبيت.\n\nقبل التثبيت, من المقترح قرائة الأسئلة الشائعة. للتعاريف المستخدمة في هذه الصفحة راجع المساعدة:القرائة. خاصةً, القطع البرمجية قد تحتوي نصوصاً نائبة (منسقة ككلمات مائلة) يجب تغييرها يدوياً.\n\nهذا الدليل موجز وتُنصح بقرائته بالترتيب المعطى لكل قسم. لتعليمات أكثر تفصيلاً, طالع مقالات موسوعة آرتش ذات الصلة أو صفحات كتيب كل برنامج، كلاهما له وصلات على هذه الصفحة. لمساعدة تفاعلية, قناة IRC والمنتدى متوافران ايضاً.\n\nآرتش لينكس يجب أن يعمل على أي جهاز متوافق مع x86_64 ويحتوي على الأقل 512 MiB من الذاكرة, لكن ستحتاج ذاكرة أكثر لتشغيل النظام الحي. [١] تثبيت بسيط يجب أن يستخدم أقل من 2 GiB من مساحة التخزين. هذا الدليل يفترض وجود اتصال للإنترنت, لوجوب تنزيل حزم من مستودع.\n\n"
    },
    {
      "title": "احصل على صورة التثبيت",
      "level": 3,
      "content": "زر صفحة التنزيل، وحسب الطريقة التي تريد تشغيل النظام بها, أحصل على ملف ISO أو صورة التشغيل عبر الشبكة (netboot)، وتوقيع GnuPG المناسب.\n\n"
    },
    {
      "title": "تحقق من التوقيع",
      "level": 3,
      "content": "من المقترح التحقق من توقيع صورة التثبيت قبل استخدامها, خصيصاً عند التنزيل من مرآة HTTP والتي تكون عموماً عرضة للاعتراض لتقدم صور تنزيل مريبة.\n\nعلى نظام ثبت عليه GnuPG، يمكن القيام بذلك عن طريق تنزيل توقيع PGP للISO (تحت قسم «Checksums» في صفحة التنزيل) إلى المجلد الذي يحتوي ملف الISO والتحقق من الملف باستخدام:\n\n```\n$  gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nبدلاً من ذلك, من تثبيت آرتش موجود حالياً شغل:\n\n```\n$ pacman-key -v archlinux-version-x86_64.iso.sig\n```\n\n- التوقيع نفسه يمكن التلاعب به إن تم تنزيله من مرآة, بدلاً من موقع archlinux.org. في هذه الحالة تأكد أن المفتاح العام, الذي يستخدم لفك تشفير التوقيع, موقع باستخدام مفتاح آخر موثوق. أمر gpg سيعطي بصمة المفتاح العام.\n- طريقة أخرى للتحقق من موثوقية التوقيع هي التحقق من أن بصمة المفتاح العام متطابقة مع بصمة مفتاح المطور الذي وقع ملف الISO. انظر Wikipedia:Public-key cryptography لمزيد من المعلومات.\n\n"
    },
    {
      "title": "جهز وسيط تثبيت",
      "level": 3,
      "content": "ملف الISO يمكن إيصاله إلى الجهاز الهدف عن طريق وحدة ذاكرة وميضية (فلاشة)، أو قرص ضوئي, أو شبكة مع خاصية PXE: اتبع المقالة المناسبة لتجهز وسيط تثبيت من ملف الISO.\n\nلصورة التشغيل عبر الإنترنت (Netboot)، اتبع Netboot#Boot from a USB flash drive لتجهيز فلاشة لتشغيل UEFI.\n\n"
    },
    {
      "title": "شغل البيئة الحية",
      "level": 3,
      "content": "Note: صور تثبيت ارتش لينكس لا تدعم التشغيل الآمن (Secure Boot) سيتوجب عليك تعطيل التشغيل الآمن لتشغيل وسيط التثيبت. إن أردت ذلك فيمكن إعداد التشغيل الآمن بعد التثبيت.\n\nصور تثبيت ارتش لينكس لا تدعم التشغيل الآمن (Secure Boot) سيتوجب عليك تعطيل التشغيل الآمن لتشغيل وسيط التثيبت. إن أردت ذلك فيمكن إعداد التشغيل الآمن بعد التثبيت.\n\n1. وجه جهاز التشغيل إلى الخيار الذي يحتوي على وسيط تنزيل ارتش لينكس. عادة ما يتم ذلك عن طريق ضغط مفتاح خلال مرحلة POST, كما هو معروض على الشاشة الأولية. راجع كتيب تعليمات اللوحة الأم للجهاز للتفاصيل.\n1. عندما تظهر شاشة محمل إقلاع (Bootloader) وسيط التشغيل إن استخدمت الISO، اختر وسيط تثبيت ارتش لينكس واضغط Enter لدخول بيئة التثبيت. إن استخدمت صورة (Netboot) اختر مرآة تنزيل قريبة جغرافياً من قائمة مرايا (Mirror)، بعدها اختر شغل ارتش لينكس (Boot Arch Linux) واضغط Enter. تلميحة: الISO يستخدم systemd-boot لUEFI وsyslinux لBIOS. استخدم e أو Tab بالترتيب لتُدخِل عوامل التشغيل. صورة Netboot تستخدم iPXE وعوامل التشغيل يمكن تغييرها من قائمة خيارات التشغيل (Boot options). طالع README.bootparams لقائمة بخيارات التشغيل. مثال شائع لخيارات التشغيل المفعلة يدوياً هو حجم الخط. لتجربة قرائة افضل على شاشات HiDPI عندما لا يتعرف عليها تلقائياً كاستخدام fbcon=font:TER16x32. طالع HiDPI#Linux console (tty) لشرح مفصل.\n\n- إن استخدمت الISO، اختر وسيط تثبيت ارتش لينكس واضغط Enter لدخول بيئة التثبيت.\n- إن استخدمت صورة (Netboot) اختر مرآة تنزيل قريبة جغرافياً من قائمة مرايا (Mirror)، بعدها اختر شغل ارتش لينكس (Boot Arch Linux) واضغط Enter. تلميحة: الISO يستخدم systemd-boot لUEFI وsyslinux لBIOS. استخدم e أو Tab بالترتيب لتُدخِل عوامل التشغيل. صورة Netboot تستخدم iPXE وعوامل التشغيل يمكن تغييرها من قائمة خيارات التشغيل (Boot options). طالع README.bootparams لقائمة بخيارات التشغيل. مثال شائع لخيارات التشغيل المفعلة يدوياً هو حجم الخط. لتجربة قرائة افضل على شاشات HiDPI عندما لا يتعرف عليها تلقائياً كاستخدام fbcon=font:TER16x32. طالع HiDPI#Linux console (tty) لشرح مفصل.\n\n- الISO يستخدم systemd-boot لUEFI وsyslinux لBIOS. استخدم e أو Tab بالترتيب لتُدخِل عوامل التشغيل. صورة Netboot تستخدم iPXE وعوامل التشغيل يمكن تغييرها من قائمة خيارات التشغيل (Boot options). طالع README.bootparams لقائمة بخيارات التشغيل.\n- مثال شائع لخيارات التشغيل المفعلة يدوياً هو حجم الخط. لتجربة قرائة افضل على شاشات HiDPI عندما لا يتعرف عليها تلقائياً كاستخدام fbcon=font:TER16x32. طالع HiDPI#Linux console (tty) لشرح مفصل.\n\n1. سيسجل دخولك إلى الطرفية الافتراضية الأولى كالمستخدم الأساسي، وسيعرض موجهة صدفة Zsh.\n\nللتبديل إلى طرفية أخرى كمثال لعرض هذا الدليل باستخدام Lynx بجانب التثبيت استخدم اختصار Alt+سهم. لتعديل ملفات الإعدادات، يتوفر mcedit(1) وnano وvim. طالع pkglist.x86_64.txt لقائمة بالحزم المتوفرة في وسيط التثبيت.\n\n"
    },
    {
      "title": "اضبط تخطيط لوحة المفاتيح والخط",
      "level": 3,
      "content": "التخطيط الافتراضي للوحة المفاتيح هو US. يمكن عرض التخطيطات المتوفرة باستخدام:\n\n```\n# localectl list-keymaps\n```\n\nلضبط تخطيط لوحة مفاتيح, مرر اسمه إلى loadkeys(1). مثلاً لضبط لوحة مفاتيح ألمانية:\n\n```\n# loadkeys de-latin1\n```\n\nخطوط الطرفية توجد في /usr/share/kbd/consolefonts/ ويمكن ضبطها بنفس الطريقة باستخدام setfont(8) مع حذف مسار الملف وامتداده، على سبيل المثال، لاستخدام احد اكبر خطوط الملائمة لشاشات HiDPI شغل:\n\n```\n# setfont ter-132b\n```\n\n"
    },
    {
      "title": "تحقق من وضع التشغيل",
      "level": 3,
      "content": "للتحقق من وضع التشغيل، تحقق من عدد بتات الUEFI:\n\n```\n# cat /sys/firmware/efi/fw_platform_size\n```\n\nإذا كانت نتيجة الأمر 64، فالنظام مشغل في وضع UEFI وله UEFI (64بت) x64. إذا كانت النتيجة 32، فالنظام مشغل في وضع UEFI وله UEFI (32بت) IA32؛ هذا مدعوم ولكنه يحد خيارات محمل الإقلاع إلى systemd-boot وGRUB. إن لم يكن الملف موجوداً, النظام قد يكون مشغلاً في وضع BIOS أو CSM. إن لم يكن النظام مشغلاً في الوضع الذي ترغب به، راجع كتيب تعليمات اللوحة الأم للجهاز.\n\n"
    },
    {
      "title": "اتصل بالإنترنت",
      "level": 3,
      "content": "للاتصال بشبكة الإنترنت في البيئة الحية، اتبع الخطوات التالية:\n\n- تأكد من أن واجهة الشبكة موجودة ومفعلة، على سبيل المثال باستخدام ip-link(8): # ip link\n- للشبكات اللاسلكية وWWAN, تأكد من أن البطاقة غير محظورة من rfkill.\n- اتصل بالشبكة: إيثيرنت - وصل الكابل. Wi-Fi - اتصل بالشبكة اللاسلكية باستخدام iwctl. مودم واسع النطاق - اتصل بشبكة الواسع النطاق باستخدام nmcli.\n- صمم اتصالك للشبكة: DHCP: عنوان IP متغيرة وتخصيص خادم DNS (مقدمة بsystemd-networkd و systemd-resolved) يكونا فعالين سلفا لشبكات الايثرنت, الWi-Fi, والواسع النطاق. الIP الثابت: اتبع Network configuration#Static IP address.\n- الشبكة يمكن تثبيتها باستعمال ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- إيثيرنت - وصل الكابل.\n- Wi-Fi - اتصل بالشبكة اللاسلكية باستخدام iwctl.\n- مودم واسع النطاق - اتصل بشبكة الواسع النطاق باستخدام nmcli.\n\n- DHCP: عنوان IP متغيرة وتخصيص خادم DNS (مقدمة بsystemd-networkd و systemd-resolved) يكونا فعالين سلفا لشبكات الايثرنت, الWi-Fi, والواسع النطاق.\n- الIP الثابت: اتبع Network configuration#Static IP address.\n\n```\n# ping archlinux.org\n```\n\n"
    }
  ]
}