{
  "title": "Installation guide (Svenska)",
  "url": "https://wiki.archlinux.org/title/Installation_guide_(Svenska)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Detta dokument är en guide för att installera Arch Linux med hjälp utav live-systemet startat från installationsmediet från en officiell installationsavbildning. Installationsmediet tillhandahåller tillgänglighetsfunktioner som beskrivs på sidan Install Arch Linux with accessibility options. För alternativa installationsmetoder, se Category:Installation process.\n\nFöre installationen rekommenderas det att läsa FAQ'en. För konventioner i detta dokument, se Help:Reading. I synnerhet kan kodexempel innehålla platshållare (formaterade italics) som måste bytas ut manuellt.\n\nFör mer detaljerade instruktioner, se respektive ArchWiki artiklar eller de olika programmens man pages, båda länkade från denna guide. För interaktiv hjälp, är IRC-kanalen och forumet också tillgängliga.\n\nArch Linux bör fungera på alla x86_64-kompatibla system med minst 512 MiB RAM, men mer minne krävs för att starta live-systemet för installation.[1] En grundläggande installation bör ta mindre än 2 GiB diskutrymme. Eftersom installationsprocessen måste hämta paket från ett fjärrarkiv, antar den här guiden att en fungerande internetanslutning är tillgänglig.\n\n"
    },
    {
      "title": "Ladda ner en installationsavbildning",
      "level": 3,
      "content": "Besök nerladdningssidan och, beroende på hur du vill starta systemet, ladda ner ISO-filen eller en netboot-avbildning och respektive GnuPG signatur.\n\n"
    },
    {
      "title": "Verifiera signaturer",
      "level": 3,
      "content": "Det rekommenderas att verifiera avbildningssignaturen före användning, särskilt när du laddar ner från en HTTP spegel, där nedladdningar i allmänhet är mer benägna att kapas för att leverera skadliga avbildningar.\n\nPå ett system med GnuPG installerat gör du detta genom att ladda ner ISO PGP signaturen (under Checksums på nerladdningssidan) till ISO-mappen, och verifiera den med:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nAlternativt, från en befintlig Arch Linux-installation:\n\n```\n$ pacman-key -v archlinux-version-x86_64.iso.sig\n```\n\n- Själva signaturen kan manipuleras om den laddas ner från en spegelsida, istället för från archlinux.org som ovan. Se till att den offentliga nyckeln, som används för att avkoda signaturen, är signerad av en annan, pålitlig nyckel. Kommandot gpg matar ut den offentliga nyckelns fingeravtryck\n- En annan metod för att verifiera signaturens äkthet är att säkerställa att den offentliga nyckelns fingeravtryck är identiskt med nyckelfingeravtrycket från Arch Linux-utvecklaren som signerade ISO-filen. Se Wikipedia:sv:Asymmetrisk kryptering för mer information om processen för offentlig nyckel för att autentisera nycklar.\n\n"
    },
    {
      "title": "Förbered ett installationsmedium",
      "level": 3,
      "content": "Installationsavbildningen kan överföras till målsystemet via ett USB-minne, en optisk skiva, eller ett nätverk med PXE: följ lämplig artikel för att förbereda dig för ett installationsmedium från den valda avbildningen.\n\n"
    },
    {
      "title": "Starta live-miljön",
      "level": 3,
      "content": "1. Ställ in den aktuella startenheten till den med Arch Linux-installationsmediet. Normalt uppnås det genom att trycka på en knapp under POST-processen. Se moderkortshandboken för mer information.\n1. När installationsmediets bootloader-meny visas, välj Arch Linux install medium och tryck Enter för att komma in i installationsmiljön. Tip: Installationsavbildningen använder GRUB för UEFI och syslinux för BIOS-startande. Se README.bootparams för en lista över startparametrar.\n1. Du kommer vara inloggad på den första virtuella konsolen som root och presenteras med en Zsh shell prompt.\n\nFör att växla till en annan konsol—till exempel för att se den här guiden med Lynx tillsammans med installationen—använd Alt+piltangent genvägen. För att redigera konfigurationsfiler finns mcedit(1), nano och vim tillgängliga. Se pkglist.x86_64.txt för en lista över paket som ingår i installationsmediet.\n\n"
    },
    {
      "title": "Ställ in konsoll-tangentbordslayouten",
      "level": 3,
      "content": "Standard konsollayoten är US. Tillgängliga layouter kan listas med:\n\n```\n# ls /usr/share/kbd/keymaps/**/*.map.gz\n```\n\nFör att ställa in tangentbordslayouten, lägg till ett motsvarande filnamn till loadkeys(1), uteslutande sökvägen och filändelsen. Till exempel för att ställa in Svenska:\n\n```\n# loadkeys sv-latin1\n```\n\nKonsolteckensnitt finns i /usr/share/kbd/consolefonts/ och kan också ställas in med setfont(8).\n\n"
    },
    {
      "title": "Verifiera startläget",
      "level": 3,
      "content": "För att verifiera startläget, lista efivars-mappen:\n\n```\n# ls /sys/firmware/efi/efivars\n```\n\nOm kommandot visar mappen utan fel startas systemet i UEFI-läge. Om mappen inte finns kan systemet startats i BIOS (eller CSM)-läge. Om systemet inte startade i det läge du önskar, se moderkortets manual.\n\n"
    },
    {
      "title": "Anslut till internet",
      "level": 3,
      "content": "För att sätta upp en nätverksanslutning i livemiljön, gå igenom följande steg:\n\n- Se till att ditt nätverksgränssnitt är listat och aktiverat, till exempel med ip-link(8): # ip link\n- För trådlöst och WWAN, se till att det kortet inte är blockerat med rfkill.\n- Anslut till nätverket: Trådat—anslut kabeln. Wi-Fi—verifiera det trådlösa nätverket med iwctl. Mobilt bredbandsmodem-anslut till mobilnätverket med mmcli-verktyget.\n- Konfigurera din nätverksanslutning: DHCP: dynamisk IP-adress och DNS-servertilldelning (tillhandahålls av systemd-networkd och systemd-resolved) bör fungera direkt från start för trådade, trådlösa och WWAN-nätverksgränssnitt. Statisk IP-adress: följ Network configuration#Static IP address.\n- Anslutningen kan verifieras med ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Trådat—anslut kabeln.\n- Wi-Fi—verifiera det trådlösa nätverket med iwctl.\n- Mobilt bredbandsmodem-anslut till mobilnätverket med mmcli-verktyget.\n\n- DHCP: dynamisk IP-adress och DNS-servertilldelning (tillhandahålls av systemd-networkd och systemd-resolved) bör fungera direkt från start för trådade, trådlösa och WWAN-nätverksgränssnitt.\n- Statisk IP-adress: följ Network configuration#Static IP address.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Uppdatera systemklockan",
      "level": 3,
      "content": "Använd timedatectl(1) för att säkerställa att systemklockan är korrekt:\n\n```\n# timedatectl set-ntp true\n```\n\nFör att kontrollera servicestatusen, använd timedatectl status.\n\n"
    },
    {
      "title": "Partitionera diskarna",
      "level": 3,
      "content": "När de igenkänns av live-systemet tilldelas diskar till en blockenhet som /dev/sda, /dev/nvme0n1 eller /dev/mmcblk0. För att identifiera dessa enheter, använd lsblk eller fdisk.\n\n1. fdisk -l\n\nResultat som slutar på rom, loop eller airoot kan ignoreras.\n\nFöljande partitioner är obligatoriska för en vald enhet:\n\n- En partition för rotmappen /.\n- För att starta i UEFI-läge: en EFI-systempartition.\n\nOm du vill skapa några staplade blockenheter för LVM, systemkryptering eller RAID, gör det nu.\n\nAnvänd fdisk eller parted för att ändra partitionstabeller. Till exempel:\n\n```\n# fdisk /dev/the_disk_to_be_partitioned'\n```\n\n- Om disken inte dyker upp, se till att diskkontrollern inte är i RAID-läge.\n- Om disken du vill starta från redan har en EFI-systempartition, skapa inte en annan, utan använd den befintliga partitionen istället.\n- Swaputrymme kan ställas in till en swapfil för filsystem som stödjer det.\n\n"
    },
    {
      "title": "Exempel på layouter",
      "level": 4,
      "content": "Table content:\nMonteringspunkt | Partition | Partitionstyp | Föreslagen storlek\n/mnt/boot1 | /dev/efi_system_partition | EFI system partition | Minst 300 MiB\n[SWAP] | /dev/swap_partition | Linux swap | Mer än 512 MiB\n/mnt | /dev/root_partition | Linux x86-64-rot (/) | Resten av enheten\n\n1. Andra monteringspunkter, såsom /mnt/efi, är möjliga förutsatt att den använda bootloadern kan ladda kärnan och initramfs-bilder från rotvolymen. Se varningen i Arch boot process#Boot loader.\n\nTable content:\nMonteringspunkt | Partition | Partitionstyp | Föreslagen storlek\n[SWAP] | /dev/swap_partition | Linux swap | Mer än 512 MiB\n/mnt | /dev/root_partition | Linux | Resten av enheten\n\nSe även Partitioning#Example layouts.\n\n"
    },
    {
      "title": "Formatera partitionerna",
      "level": 3,
      "content": "När partitionerna har skapats måste varje nyskapad partition formateras med ett lämpligt filsystem. Se File systems#Create a file system för detaljer.\n\nFör att till exempel skapa ett Ext4-filsystem på /dev/root_partition, kör:\n\n```\n# mkfs.ext4 /dev/root_partition\n```\n\nOm du skapade en partition för swap, initialisera den med mkswap(8):\n\n```\n# mkswap /dev/swap_partition\n```\n\nOm du skapade en EFI-systempartition, formatera den till FAT32 med mkfs.fat(8).\n\n```\n# mkfs.fat -F 32 /dev/efi_system_partition\n```\n\n"
    },
    {
      "title": "Montera filsystemen",
      "level": 3,
      "content": "Montera rotvolymen till /mnt. Till exempel, om rotvolymen är /dev/root_partition:\n\n```\n# mount /dev/root_partition /mnt\n```\n\nSkapa eventuella återstående monteringspunkter (såsom /mnt/efi) och montera motsvarande volymer.\n\nFör UEFI-system, montera EFI-partionen:\n\n```\n# mount --mkdir /dev/efi_system_partition /mnt/boot\n```\n\nOm du skapade en swap-volym, aktivera den med swapon(8):\n\n1. swapon /dev/swap_partition\n\ngenfstab(8) kommer senare att upptäcka monterade filsystem och swap-utrymme.\n\n"
    },
    {
      "title": "Välj speglar",
      "level": 3,
      "content": "Paket som ska installeras måste laddas ner från spegelservrar, som definieras i /etc/pacman.d/mirrorlist. I live-systemet, efter att ha anslutit till internet, uppdaterar reflector spegellistan genom att välja 20 senast synkroniserade HTTPS-speglar och sortera efter nedladdningshastighet.\n\nJu högre en spegel placeras i listan, desto mer prioritet ges den när du laddar ner ett paket. Du kanske vill inspektera filen för att se om den är tillfredsställande. Om den inte är det, redigera filen i enlighet med detta och flyttar de geografiskt närmaste speglarna till toppen av listan, även om andra kriterier bör beaktas.\n\nDen här filen kommer senare att kopieras till det nya systemet av pacstrap, så det är värt att få rätt.\n\n"
    },
    {
      "title": "Installera viktiga paket",
      "level": 3,
      "content": "Använd skriptet pacstrap(8) för att installera base-paketet, Linux kärna och firmware för vanlig hårdvara:\n\n```\n# pacstrap /mnt base linux linux-firmware\n```\n\n- Du kan ersätta linux med ett kärnepaket som du väljer, eller så kan du helt utelämna det när du installerar i en container.\n- Du kan utelämna installationen av firmwarepaketet när du installerar i en virtuell maskin eller container.\n\nbase-paketet innehåller inte alla verktyg från liveinstallationen, så det kan vara nödvändigt att installera andra paket för ett fullt fungerande bassystem. Överväg särskilt att installera:\n\n- userspace-verktyg för hantering av filsystem som kommer att användas i systemet,\n- verktyg för åtkomst till RAID eller LVM partitioner,\n- specifik firmware för andra enheter som inte ingår i linux-firmware (t.ex. sof-firmware för ljudkort),\n- programvara som krävs för nätverk (t.ex. en nätverkshanterare eller DHCP-klient),\n- en textredigerare,\n- paket för åtkomst till dokumentation på sidorna man och info sidorna: man-db, man-pages och texinfo.\n\nFör att installera andra paket eller paketgrupper, lägg till namnen i kommandot pacstrap ovan (mellanslagsavgränsat) eller använd pacman medans chrootad i det nya systemet. För jämförelse finns paket som finns tillgängliga i live-systemet på pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Skapa en fstab-fil (använd -U eller -L för att definiera med UUID respektive etiketter):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nKontrollera den resulterande /mnt/etc/fstab-filen och redigera den vid fel.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Ändra rot till det nya systemet:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Tidszon",
      "level": 3,
      "content": "Ställ in tidszon:\n\n```\n# ln -sf /usr/share/zoneinfo/Region/City /etc/localtime\n```\n\nKör hwclock(8) för att generera /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nDetta kommando förutsätter att hårdvaruklockan är inställd på UTC. Se System time#Time standard för mer information.\n\n"
    },
    {
      "title": "Lokalisering",
      "level": 3,
      "content": "Redigera /etc/locale.gen och avmarkera en_US.UTF-8 UTF-8 och andra språk som behövs. Generera språken genom att köra:\n\n```\n# locale-gen\n```\n\nSkapa filen locale.conf(5) och ställ in LANG-variabeln i enlighet med detta:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=sv_SE.UTF-8\n```\n\nOm du ställt in tangentbordslayouten, gör ändringarna bestående i vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=sv-latin1\n```\n\n"
    },
    {
      "title": "Nätverkskonfiguration",
      "level": 3,
      "content": "Skapa värdnamnsfilen:\n\n```\n/etc/hostname\n```\n\n```\nmyhostname\n```\n\nSlutför nätverkskonfiguration för den nyligen installerade miljön. Det kan inkludera installation av lämplig nätverkshanteringsprogramvara.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Att skapa ett nytt initramfs krävs vanligtvis inte, eftersom mkinitcpio kördes vid installation av kärnepaketet med pacstrap.\n\nFör LVM, system encryption eller RAID, ändra mkinitcpio.conf(5) och återskapa initramfs-avbildningen:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Rootlösenord",
      "level": 3,
      "content": "Ställ in root-lösenordet:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Bootloader",
      "level": 3,
      "content": "Välj och installera en Linux-kompatibel bootloader. Om du har en Intel- eller AMD-CPU, aktivera mikrokod-uppdateringar i tillägg.\n\n"
    },
    {
      "title": "Starta om",
      "level": 2,
      "content": "Avsluta chroot-miljön genom att skriva exit eller trycka på Ctrl+d.\n\nDu kan eventuellt avmontera alla partitioner manuellt med umount -R / mnt: detta gör det möjligt att upptäcka alla \"upptagna\" partitioner och hitta orsaken med fuser(1).\n\nSlutligen starta om maskinen genom att skriva reboot: alla partitioner som fortfarande är monterade kommer automatiskt att avmonteras av systemd. Kom ihåg att ta bort installationsmediet och logga sedan in i det nya systemet med root-kontot.\n\n"
    },
    {
      "title": "Efterinstallation",
      "level": 2,
      "content": "Se General recommendations för anvisningar om systemhantering och handledning efter installationen (som att skapa oprivilegerade användarkonton, ställa in ett grafiskt användargränssnitt, ljud eller en pekplatta).\n\nFör en lista över applikationer som kan vara av intresse, se List of applications.\n\n"
    }
  ]
}