{
  "title": "Installation guide (Français)",
  "url": "https://wiki.archlinux.org/title/Installation_guide_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ce document est un guide pour l'installation d'Arch Linux au moyen du système live Archiso démarré depuis le support d'installation issue des images officielles. Le support d'installation offre des fonctionnalités d'accessibilité décrites à la page Installer Arch Linux avec les options d'accessibilité. Pour les autres moyens d'installation, voir Category:Installation process (Français).\n\nAvant installation, il est conseillé de consulter la FAQ. Pour les conventions utilisées dans ce document, voir l'aide à la lecture. En particulier, les exemple de code contiennent parfois des champs (notés en italique) que vous devez modifier manuellement.\n\nCe guide est rédigé de manière concise et il vous est conseillé de suivre les instructions dans l'ordre présenté pour chaque section. Pour de plus amples instructions, se référer aux articles respectifs du ArchWiki ainsi que les pages de manuel en liens dans ce guide. Pour une aide interactive, les Canaux IRC Arch ainsi que le forum international et le forum francophone sont disponibles.\n\nArch Linux devrait fonctionner sur n'importe quelle machine utilisant l'architecture x86_64 dotée d'un minimum de 512 MiB de RAM, bien que plus de mémoire soit nécessaire pour démarrer le système live en vue de l'installation. [1] Une installation basique devrait utiliser moins de 2 GiB d'espace disque. Enfin, le processus d'installation nécessitant le téléchargement de paquets depuis un dépôt distant, ce guide considère qu'une connexion Internet est disponible.\n\n"
    },
    {
      "title": "Obtenir l'image d'installation",
      "level": 3,
      "content": "Visitez la page de Téléchargement et, selon la façon dont vous voulez démarrer, récupérez l'image ISO ou bien l'image «netboot» ainsi que la signature GnuPG correspondante.\n\n"
    },
    {
      "title": "Vérifier la signature",
      "level": 3,
      "content": "Il est recommandé de vérifier la signature de l'image avant de l'utiliser, particulièrement lors du téléchargement depuis un miroir HTTP, puisque ceux-ci sont sujet à être interceptés pour fournir des fichiers malveillants.\n\nDepuis un système avec GnuPG installé, faites cette vérification en téléchargeant la signature PGP de l'ISO (dans \"Checksums\" sur la page de téléchargement) dans le répertoire contenant l'ISO et en la vérifiant avec:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-version-x86_64.iso.sig\n```\n\nDepuis une installation Arch Linux existante, vous pouvez également utiliser la commande:\n\n```\n$ pacman-key -v archlinux-version-x86_64.iso.sig\n```\n\n- La signature elle-même pourrait être manipulée si elle est téléchargée à partir d'un site miroir, au lieu de l'être à partir de archlinux.org comme ci-dessus. Dans ce cas, assurez-vous que la clé publique, qui est utilisée pour décoder la signature, soit signée par une autre clé digne de confiance. La commande gpg affichera l'empreinte de la clé publique.\n- Une autre méthode pour vérifier l'authenticité de la signature consiste à s'assurer que l'empreinte de la clé publique est identique à l'empreinte de la clé du développeur Arch Linux qui a signé le fichier ISO. Voir Wikipedia:fr:Cryptographie asymétrique pour plus d'informations sur le processus d'authentification des clés par une clé publique.\n\n"
    },
    {
      "title": "Préparer un support d'installation",
      "level": 3,
      "content": "L'image d'installation peut être déployée sur la machine concernée via une clé USB, un disque optique, ou par réseau avec PXE : consultez l'article approprié pour préparer vous-même un support d'installation selon de l'image choisie.\n\nPour une image \"Netboot\", veuillez suivre Netboot#Boot from a USB flash drive pour préparer une clé USB pour un démarrage UEFI.\n\n"
    },
    {
      "title": "Démarrer l'environnement «live»",
      "level": 3,
      "content": "1. Choisissez le périphérique de démarrage pour utiliser le support préparé précédemment. Généralement, la manipulation consiste à appuyer sur une touche — fréquemment mentionnée sur l'écran d'accueil de votre machine — durant le POST. Référez-vous au manuel de votre carte mère pour plus de détails.\n1. Lorsque le menu du support d'installation apparaît, si vous avez utilisé l'ISO, sélectionnez Arch Linux install medium et validez avec la touche Entrée. si vous avez utilisé l'image \"Netboot\", choisissez un mirroir géographiquement proche depuis le menu Mirror et valiez avec la touche Entrée. Astuce: L'image d'installation utilise systemd-boot pour démarrer sur les UEFI et Syslinux sur les BIOS. Utilisez respectivement e ou Tab pour ajouter des paramètres de boot. L'image \"Netboot\" utilise iPXE et les paramètres de démarrage peuvent être choisis dans le menu Boot Options. Consultez README.bootparams pour une liste des paramètres de démarrage. Un exemple typique de paramètre de boot entré manuellement est la taille de la police. Pour une meilleure lecture sur des écrans à haut DPI, s'il ne sont pas reconnus comme tels, fbcon=font:TER16x32 peut aider. Consultez HiDPI#Linux console (tty) pour des explications détaillées.#\n1. Vous serez connecté dans la première console virtuelle sous l'utilisateur root et vous verrez une invite de commande zsh\n\n- si vous avez utilisé l'ISO, sélectionnez Arch Linux install medium et validez avec la touche Entrée.\n- si vous avez utilisé l'image \"Netboot\", choisissez un mirroir géographiquement proche depuis le menu Mirror et valiez avec la touche Entrée. Astuce: L'image d'installation utilise systemd-boot pour démarrer sur les UEFI et Syslinux sur les BIOS. Utilisez respectivement e ou Tab pour ajouter des paramètres de boot. L'image \"Netboot\" utilise iPXE et les paramètres de démarrage peuvent être choisis dans le menu Boot Options. Consultez README.bootparams pour une liste des paramètres de démarrage. Un exemple typique de paramètre de boot entré manuellement est la taille de la police. Pour une meilleure lecture sur des écrans à haut DPI, s'il ne sont pas reconnus comme tels, fbcon=font:TER16x32 peut aider. Consultez HiDPI#Linux console (tty) pour des explications détaillées.#\n\n- L'image d'installation utilise systemd-boot pour démarrer sur les UEFI et Syslinux sur les BIOS. Utilisez respectivement e ou Tab pour ajouter des paramètres de boot. L'image \"Netboot\" utilise iPXE et les paramètres de démarrage peuvent être choisis dans le menu Boot Options. Consultez README.bootparams pour une liste des paramètres de démarrage.\n- Un exemple typique de paramètre de boot entré manuellement est la taille de la police. Pour une meilleure lecture sur des écrans à haut DPI, s'il ne sont pas reconnus comme tels, fbcon=font:TER16x32 peut aider. Consultez HiDPI#Linux console (tty) pour des explications détaillées.#\n\nPour changer de console — par exemple pour consulter ce guide avec Lynx pendant l'installation — vous pouvez utiliser Alt+flèches de direction. Pour modifier les fichiers de configuration, mcedit(1), nano et vim sont disponibles. Voir pkglist.x86_64.txt pour consulter la liste des paquets inclus dans le support d'installation.\n\n"
    },
    {
      "title": "Disposition du clavier en console et de la police de caractères",
      "level": 3,
      "content": "La disposition par défaut est le clavier US. Les dispositions disponibles peuvent être listées par :\n\n```\n# localectl list-keymaps\n```\n\nPour modifier la disposition du clavier, passez son à loadkeys(1) en omettant le chemin du fichier ainsi que l'extension. Par exemple pour la disposition Française vous pouvez utiliser :\n\n```\n# loadkeys fr-latin1\n```\n\nLes polices de la console se trouvent dans /usr/share/kbd/consolefonts/ et peuvent de même être modifiées avec setfont(8) en omettant les chemin et extension du fichier. Par example, pour utiliser l'une des plus grandes polices adaptées aux HiDPI screens, exécutez :\n\n```\n# setfont ter-132b\n```\n\n"
    },
    {
      "title": "Vérifier le mode de démarrage",
      "level": 3,
      "content": "Pour vérifier le mode de démarrage, vérifiez le nombre de bits UEFI :\n\n```\n# cat /sys/firmware/efi/fw_platform_size\n```\n\nSi la commande renvoie 64, alors le système est démarré en mode UEFI et dispose d'un UEFI x64 64 bits. Si la commande renvoie 32, alors le système est démarré en mode UEFI et dispose d'un UEFI IA32 32 bits; bien que cela soit pris en charge, cela limitera le choix du chargeur d'amorçage à systemd-boot et GRUB. Si le fichier n'existe pas, le système peut être démarré en mode BIOS (ou CSM). Si le système n'a pas démarré dans le mode souhaité (UEFI vs BIOS), reportez-vous au manuel de votre carte mère.\n\n"
    },
    {
      "title": "Connexion à Internet",
      "level": 3,
      "content": "Pour configurer la connexion réseau dans l'image live, suivez ces étapes :\n\n- Vérifiez que votre Carte réseau est répertoriée et activée, par exemple avec ip-link(8): # ip link\n- Pour les connections sans fil comme le Wi-Fi ou les réseaux mobiles (4G...), vérifiez que l'utilitaire rfkill ne bloque pas l'interface.\n- Connexion au réseau: Ethernet—Connectez le câble. Wi-Fi—Authentifiez-vous sur le réseau sans fil avec iwctl. Réseaux mobiles—Connectez-vous au réseau avec l'utilitaire mmcli.\n- Configurez votre connexion réseau: DHCP: l'adressage dynamique des adresses IP et des serveurs DNS (fourni par systemd-networkd (Français) et systemd-resolved (Français) devraient fonctionner par défaut) pour les protocoles Ethernet, Wi-Fi and Mobiles. Adresse IP statique : suivez Network configuration#Static IP address.\n- La connexion peut être confirmée avec ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernet—Connectez le câble.\n- Wi-Fi—Authentifiez-vous sur le réseau sans fil avec iwctl.\n- Réseaux mobiles—Connectez-vous au réseau avec l'utilitaire mmcli.\n\n- DHCP: l'adressage dynamique des adresses IP et des serveurs DNS (fourni par systemd-networkd (Français) et systemd-resolved (Français) devraient fonctionner par défaut) pour les protocoles Ethernet, Wi-Fi and Mobiles.\n- Adresse IP statique : suivez Network configuration#Static IP address.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Mise à jour de l'horloge système",
      "level": 3,
      "content": "Dans l'environnement live, systemd-timesyncd est activé par défaut et l'heure sera synchronisée automatiquement dès qu'une connexion à Internet sera établie.\n\nUtilisez timedatectl(1) pour vous assurer que l'horloge système est correctement réglée.\n\n```\n# timedatectl\n```\n\n"
    },
    {
      "title": "Partitionnement des disques",
      "level": 3,
      "content": "Une fois reconnus par le système live, les disques se verront affectés un périphérique de type bloc tel que /dev/sda, /dev/nvme0n1 ou /dev/mmcblk0. Pour identifier ces périphériques, utilisez lsblk ou fdisk.\n\n```\n# fdisk -l\n```\n\nLes résultats se terminant par rom, loop ou airootfs peuvent être ignorés. Les appareils mmcblk* se terminant par rpbm, boot0 et boot1 peuvent être ignorés.\n\nLes partitions suivantes sont nécessaires sur un périphériques choisi:\n\n- Une partition racine /.\n- Pour démarrer en mode UEFI: une partition EFI.\n\n- Utilisez un outil de partitionnement comme fdisk pour modifier la table de partitions. Par exemple :\n\n```\n# fdisk /dev/disque_en_question\n```\n\n- Prenez le temps de planifier un schéma de partitionnement à long terme afin d'éviter les conversions ou re-partitionnement risquées et compliquées dans le futur.\n- Si vous souhaitez utiliser LVM, un chiffrement de votre système ou encore RAID, faites le maintenant.\n- Si le disque depuis lequel vous souhaitez démarrer possède déjà une partition EFI, n'en recréez pas une autre mais utilisez la partition pré-existante.\n- La Swap peut être définie sur un fichier d'échange pour les systèmes de fichier qui le prennent en charge. Alternativement, de la swap basée sur le disque peut être évitée entièrement en configurant swap on zram après avoir installé le systeme\n\n"
    },
    {
      "title": "Exemples de Partitionnement",
      "level": 4,
      "content": "Table content:\nPoint de Montage sur le système installé | Partition | Type de partition | Taille suggérée\n/boot1 | /dev/efi_system_partition | EFI system partition | 1 GiB\n[SWAP] | /dev/partition_d'échange | Linux swap | Au moins 4 GiB\n/mnt | /dev/partition_racine | Linux x86-64 root (/) | Le reste du disque. Au moins 23 à 32 GiB.\n\n1. D'autres points de montage, tels que /efi ne devrait être envisagé que si le chargeur d'amorçage utilisé est capable de charger le noyau et l'initramfs directement depuis la partition racine. Voir l'avertissement dans Arch boot process (Français)#Chargeur d'amorçage.\n\nTable content:\nPoint de Montage sur le système installé | Partition | Type de Partition | Taille suggérée\n[SWAP] | /dev/partition_d'échange | Linux swap | Au moins 4 GiB\n/mnt | /dev/partition_racine | Linux | Le reste du disque. Au moins 23 à 32 GiB.\n\nPour d'autres exemples: Partitioning#Example layouts.\n\n"
    },
    {
      "title": "Formatage des partitions",
      "level": 3,
      "content": "Une fois les partitions crées, celles-ci doivent être formatées avec un système de fichier approprié. Consultez File systems#Create a file system pour plus de détails.\n\nPar exemple, pour créer un système de fichier ext4 sur /dev/partition_racine, utilisez :\n\n```\n# mkfs.ext4 /dev/partition_racine\n```\n\nSi vous avez crée une partition d'échange, initialisez la avec mkswap(8):\n\n```\n# mkswap /dev/partition_d'échange\n```\n\nSi vous avez créé une partition système EFI, formatez-la en FAT32 avec mkfs.fat(8).\n\n```\n# mkfs.fat -F 32 /dev/efi_system_partition\n```\n\n"
    },
    {
      "title": "Montage des systèmes de fichiers",
      "level": 3,
      "content": "Montez la partition racine dans /mnt. Par exemple, si la partition racine est /dev/partition_racine:\n\n```\n# mount /dev/partition_racine /mnt\n```\n\nCréez chaques points de montage restants dans /mnt (tels que /mnt/boot pour /boot) et montez les volumes dans l'ordre hiérarchique correspondant.\n\nPour les systèmes avec un UEFI, montez la partition système EFI :\n\n```\n# mount --mkdir /dev/efi_system_partition /mnt/boot\n```\n\nSi vous avez créé une partition d'échange, activez-la avec swapon(8):\n\n```\n# swapon /dev/partition_d'échange\n```\n\ngenfstab(8) détectera plus tard les systèmes de fichiers et l'espace d'échange montés.\n\n"
    },
    {
      "title": "Sélection du miroir",
      "level": 3,
      "content": "Les paquets à installer doivent être téléchargés depuis les miroirs des dépôts officiels tels que définis dans /etc/pacman.d/mirrorlist. Sur le système live, après connexion à Internet, reflector met à jour la liste des miroirs en sélectionnant les 20 miroirs les plus récemment synchronisés et en les triant par vitesse de téléchargement.\n\nPlus le miroir se trouve haut dans la liste, plus grande est sa priorité lors d'un téléchargement. Vérifiez le contenu de /etc/pacman.d/mirrorlist et modifiez le si besoin. Placez les miroirs les plus proches géographiquement en haut de la liste, bien que d'autres critères sont à prendre en compte\n\nPar exemple pour trouver un miroir plus proche de chez vous (et/ou plus rapide) en utilisant reflector:\n\n```\n# reflector --country France --age 12 --protocol https --sort rate --save /etc/pacman.d/mirrorlist\n```\n\nCette commande devrait sélectionner les miroirs HTTPS synchronisés ces 12 dernières heures en France, les trier par vitesse de téléchargement, et mettre à jour le fichier /etc/pacman.d/mirrorlist.\n\npacstrap copiera plus tard ce fichier sur le nouveau système, prendre votre temps sur cette étape peut donc vous en faire gagner plus tard.\n\n"
    },
    {
      "title": "Installation des paquets essentiels",
      "level": 3,
      "content": "Utilisez le script pacstrap(8) en lui indiquant le répertoire correspondant à la racine du système suivi des paquets ou groupes à installer (séparés par un espace). Pour le système de base, installez le \"méta-paquet\" base, le noyau, et le microprogramme pour les périphériques les plus courants:\n\n```\n# pacstrap -K /mnt base linux linux-firmware\n```\n\n- Vous pouvez remplacer linux par un autre noyau de votre choix ou l'omettre dans l'installation d'un container.\n- Vous pouvez également omettre le microprogramme si vous installez dans une machine virtuelle un container.\n\nLe paquet base n'inclut pas tous les outils de l'installation «live», donc l'installation d'autres paquets peut être nécessaire pour obtenir un système de base entièrement fonctionnel. Pour installer d'autres paquets ou groupes de paquets, ajoutez leurs noms à la commande pacstrap ci-dessus (séparés par des espaces) ou utilisez pacman pour les installer pendant que vous êtes «chroot»é dans votre nouvelle installation. En particulier, envisagez d'installer:\n\n- les mises-à-jour du microcode du processeur (amd-ucode ou intel-ucode) pour les corrections de bogues matériels et de sécurité,\n- les utilitaires nécessaires à la gestion des systèmes de fichiers,\n- les utilitaires en userspace pour les systèmes de fichiers qui seront utilisés pour, par exemple, la création de système de fichiers et fsck,\n- les utilitaires pour accéder ou gérer les partitions RAID ou LVM s'ils sont utilisés sur le système,\n- les microprogrammes spécifiques à des périphériques qui ne seraient pas déjà inclus dans linux-firmware (comme sof-firmware pour l'audio de la carte mère, linux-firmware-marvell pour les puces Marvell sans fil et l'un des multiples packages de micrologiciels pour Broadcom wireless),\n- les logiciels nécessaires à la connexion au réseau (par exemple, un gestionnaire de réseau ou un client DHCP autonome, un logiciel d'authentification pour le Wi-Fi, un gestionnaire de modem pour les réseaux mobiles),\n- un éditeur de texte pour console (tels que nano ) pour permettre la modification fichiers de configuration depuis la console,\n- les paquets de documentation comme man-db, man-pages et texinfo.\n\nA titre d'exemple, consultez la liste des paquets disponibles sur le média d'installation.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Générez le fichier fstab (utiliser -U ou -L pour définir par UUID ou étiquettes, respectivement):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nVérifiez le fichier /mnt/etc/fstab obtenu, et modifiez-le en cas d'erreur.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Chrooter dans le nouveau système:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Heure",
      "level": 3,
      "content": "Définissez le fuseau horaire, par exemple pour la France:\n\n```\n# ln -sf /usr/share/zoneinfo/Europe/Paris /etc/localtime\n```\n\nLancez hwclock(8) pour générer /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nCette commande repose sur l'hypothèse que l'horloge matérielle est réglée sur UTC. Consultez System time (Français)#Standard de temps pour plus de détails.\n\nPour éviter la dérive de l'horloge et garantir une heure précise, configurez la synchronisation du temps à l'aide d'un client Network Time Protocol (NTP) tel que systemd-timesyncd.\n\n"
    },
    {
      "title": "Locales",
      "level": 3,
      "content": "Modifiez /etc/locale.gen et dé-commentez votre locale, puis générez les locales avec la commande suivante:\n\n```\n# locale-gen\n```\n\nCréez le fichier locale.conf(5) et définissez la variable LANG correspondante :\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=fr_FR.UTF-8\n```\n\nÉditez le fichier vconsole.conf(5) afin d'y spécifier la disposition de clavier ainsi que la police de caractères que vous souhaitez conserver :\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=fr-latin1\n```\n\n"
    },
    {
      "title": "Configuration réseau",
      "level": 3,
      "content": "Créez le fichier hostname :\n\n```\n/etc/hostname\n```\n\n```\nlenomdevotremachine\n```\n\nTerminez la configuration du réseau pour le nouvel environnement installé. Cela peut inclure l'installation d'un logiciel de gestion de réseau approprié, sa configuration si nécessaire et l'activation de son unité systemd pour son lancement au démarrage de la machine.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "La création d'un nouvel initramfs n'est généralement pas nécessaire, car mkinitcpio a été lancé lors de l'installation du noyau avec pacstrap.\n\nPour LVM, le chiffrement ou RAID, modifiez mkinitcpio.conf(5) et recréez l'image initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Mot de passe administrateur",
      "level": 3,
      "content": "Définissez un mot de passe pour root:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Installation d'un chargeur d'amorçage",
      "level": 3,
      "content": "Choisissez et installez un chargeur d'amorçage adapté.\n\n"
    },
    {
      "title": "Redémarrer",
      "level": 2,
      "content": "Sortez de l'environnement chroot en tapant (exit ou par le raccourci Ctrl+D).\n\nSi vous le souhaitez, démontez manuellement toutes les partitions avec umount -R /mnt : cela permet de détecter les partitions \"occupées\" et d'en trouver la cause avec fuser(1).\n\nEnfin, redémarrez la machine en tapant reboot : toutes les partitions encore montées seront automatiquement démontées par systemd. N'oubliez pas de retirer le support d'installation et vous pourrez vous connecter au nouveau système avec le compte root.\n\n"
    },
    {
      "title": "Après le redémarrage",
      "level": 2,
      "content": "Consultez les Recommandations générales pour des indications sur l'administration de votre système et des tutoriels de post-installation (comme la création de comptes utilisateurs non privilégiés, la configuration d'une interface utilisateur graphique, du son ou d'un pavé tactile).\n\nPour une liste des applications pouvant présenter un intérêt, voir la liste des applications.\n\n"
    }
  ]
}