{
  "title": "Installing Arch Linux on LVM (Português)",
  "url": "https://wiki.archlinux.org/title/Installing_Arch_Linux_on_LVM_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Você deve criar seus volumes LVM entre as etapas de particionamento e formatação do procedimento de instalação. Ao invés de diretamente formatar uma partição para que ela seja a raiz de seu sistema de arquivos, o sistema de arquivos deverá ser criado dentro de um volume lógico (LV).\n\nVisão geral:\n\n- Instalação dos pacotes necessários. (consulte LVM#Instalação);\n- Criação de partições no lugar onde seus volumes físicos (PVs) irão residir;\n- Criação de seus volumes físicos (PVs). Se você tiver um disco é melhor apenas criar um PV em uma partição grande. Se você tiver múltiplos discos, você pode criar partições em cada um deles e criar um PV em cada partição;\n- Criação seu grupo de volumes (VG) e adicionar todos os PVs a ele;\n- Criação volumes lógicos (LVs) dentro deste VG;\n- Continuação a partir do Guia de instalação#Formatar as partições;\n- Ao chegar na etapa “Initramfs” do guia de instalação, adicione o hook lvm2 ao /etc/mkinitcpio.conf (consulte os detalhes abaixo);\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Você seguirá o guia de instalação até chegar ao Guia de instalação#Partição dos discos. Nesse ponto, você irá divergir e fazer todo o seu particionamento com o LVM em mente.\n\n"
    },
    {
      "title": "Criação de partições",
      "level": 3,
      "content": "Primeiro, particione o dispositivo conforme necessário antes de configurar o LVM.\n\nAo criar as partições:\n\n- Se estiver usando GPT, defina a partição do tipo GUID para E6D6D379-F507-44C2-A23C-238F2A3DF928 (partição do tipo Linux LVM no fdisk e 8e00 no gdisk).\n- Se estiver usando uma tabela de partições do tipo MBR, defina o ID do tipo de partição para 8e (partição do tipo Linux LVM no fdisk).\n\n"
    },
    {
      "title": "Criação de volumes físicos",
      "level": 3,
      "content": "Para listar todos os seus dispositivos capazes de serem usados como volume físico:\n\n```\n# lvmdiskscan\n```\n\nCrie um volume físico neles:\n\n```\n# pvcreate DISPOSITIVO\n```\n\nEste comando cria um cabeçalho em cada dispositivo que poderá ser usado pelo LVM. Conforme definido em LVM#Blocos de construção do LVM, DISPOSITIVO pode ser qualquer dispositivo de bloco, ou seja, um disco /dev/sda, uma partição /dev/sda2 ou um dispositivo de loopback. Por exemplo:\n\n```\n# pvcreate /dev/sda2\n```\n\nVocê pode verificar os volumes físicos criados com:\n\n```\n# pvdisplay\n```\n\nVocê também pode obter um resumo de informações em volumes físicos com:\n\n```\n# pvscan\n```\n\n"
    },
    {
      "title": "Criação e expansão de um grupo de volumes",
      "level": 3,
      "content": "Primeiro, você precisa criar um grupo de volumes em um dos volumes físicos:\n\n```\n# vgcreate grupo_de_volumes volume_fisico\n```\n\nPor exemplo:\n\n```\n# vgcreate GrupoVolume00 /dev/sda2\n```\n\nVeja lvm(8) para uma lista de caracteres válidos para nomes de grupos de volumes.\n\nEntão, estenda-o para todos os volumes físicos que você desejar que pertençam a ele:\n\n```\n# vgextend grupo_de_volumes volume_fisico\n```\n\nPor exemplo, para adicionar sdb1 e sdc a seu grupo de volumes:\n\n```\n# vgextend GrupoVolume00 /dev/sdb1\n# vgextend GrupoVolume00 /dev/sdc\n```\n\nVocê pode ver como o seu grupo de volumes aumenta, usando:\n\n```\n# vgdisplay\n```\n\nIsto é o que você também faria se desejasse adicionar um disco a um RAID ou grupo de espelhamento com discos em falha.\n\n"
    },
    {
      "title": "Criação combinada de volumes físicos e grupos de volumes",
      "level": 4,
      "content": "O LVM permite combinar a criação de grupo de volumes e de volume físico em um simples passo. Por exemplo, para criar o grupo de volumes GrupoVol00 com três dispositivos mencionados acima, você pode executar:\n\n```\n# vgcreate GrupoVol00 /dev/sda2 /dev/sdb1 /dev/sdc\n```\n\nEste comando irá primeiro configurar três partições como volumes físicos (se necessário) e então irá criar o grupo de volumes com os três volumes. O comando irá avisá-lo se detectar um sistema de arquivos existente em qualquer um dos dispositivos.\n\n"
    },
    {
      "title": "Criação de volumes lógicos",
      "level": 3,
      "content": "- Se desejar usar snapshots, armazenar cache em volumes lógicos, definir volumes lógicos de provisionamento fino ou configurar RAID, consulte a página principal a partir de LVM#Volumes lógicos.\n- Se um volume lógico será formatado em ext4, deixe pelo menos 256 MiB de espaço livre em seu grupo de volume para permitir o uso de e2scrub(8). Após a criação do último volume com -l 100%FREE, isto pode ser alcançado ao reduzir o tamanho com lvreduce -L -256M grupo_volume/volume_logico.\n\nAgora será necessário criar volumes lógicos neste grupo de volumes. Você cria um volume lógico com o comando a seguir fornecendo o nome de um novo volume lógico, seu tamanho, e o grupo de volumes ao qual ele pertencerá:\n\n```\n# lvcreate -L tamanho grupo_de_volumes -n volume_logico\n```\n\nPor exemplo:\n\n```\n# lvcreate -L 10G GrupoVol00 -n lvolhome\n```\n\nIsto irá criar um volume lógico que você poderá acessar posteriormente com /dev/GrupoVol00/lvolhome. Assim como grupos de volumes, você pode usar qualquer nome que desejar para seu volume lógico quando estiver criando-o, com exceção de algumas restrições listadas em lvm(8) § VALID_NAMES.\n\nVocê também pode especificar um ou mais volumes físicos para restringir onde o LVM irá alocar os dados. Por exemplo, você pode criar um volume lógico para a raiz do sistema de arquivos em seu SSD pequeno, e seu volume /home em um disco rígido mecânico mais lento. Simplesmente adicione os dispositivos de volume físicos à linha de comando, por exemplo:\n\n```\n# lvcreate -L 10G GrupoVol00 -n lvolhome /dev/sdc1\n```\n\nSe você desejar preencher todo o espaço livre no restante do grupo de volumes, use o seguinte comando:\n\n```\n# lvcreate -l 100%FREE grupo_de_volumes -n volume_logico\n```\n\nVocê pode verificar os volumes lógicos criados com:\n\n```\n# lvdisplay\n```\n\n"
    },
    {
      "title": "Formatação e montagem de volumes lógicos",
      "level": 3,
      "content": "Seus volumes lógicos deverão agora estar localizados em /dev/NomeDoSeuGrupoDeVolumes/. Se você não puder localizá-lo, use os comandos a seguir para carregar o módulo para criação de nodes de dispositivo e para tornar os grupos de volumes disponíveis:\n\n```\n# modprobe dm_mod\n# vgscan\n# vgchange -ay\n```\n\nAgora você pode criar sistemas de arquivos em volumes lógicos e montá-los como partições normais (veja como montar um sistema de arquivos para detalhes adicionais):\n\n```\n# mkfs.tipo_de_sistema_de_arquivos /dev/grupo_de_volumes/volume_logico\n# mount /dev/grupo_de_volumes/volume_logico/ponto_de_montagem\n```\n\nPor exemplo:\n\n```\n# mkfs.ext4 /dev/GrupoVol00/lvolhome\n# mount /dev/GrupoVol00/lvolhome /home\n```\n\nNote: **Não** \n\n"
    },
    {
      "title": "Configuração do sistema",
      "level": 2,
      "content": "Certifique-se que o pacote lvm2 está instalado.\n\n"
    },
    {
      "title": "Adição de hooks do mkinitcpio",
      "level": 3,
      "content": "No caso da raiz do sistema de arquivos estar em um LVM, você irá precisar ativar os hooks apropriados do mkinitcpio, caso contrário seu sistema não irá inicializar. Ative:\n\n- udev e lvm2 para um initramfs baseado no busybox;\n- systemd e lvm2 para um initramfs baseado no systemd;\n\nudev estará lá por padrão. Edite o arquivo e insira lvm2 entre block e filesystems, como por exemplo:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=(base udev ... block lvm2 filesystems)\n```\n\nPara initramfs baseados no systemd:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=(base systemd ... block lvm2 filesystems)\n```\n\nDepois, você pode continuar com as instruções normais de instalação com a etapa criar uma ramdisk inicial.\n\n"
    },
    {
      "title": "Opções de inicialização do kernel",
      "level": 3,
      "content": "Se a raiz do sistema de arquivos estiver em um volume lógico, o parâmetro do kernel root= deve ser apontado para o dispositivo mapeado, por exemplo /dev/nome-do-vg/nome-do-lv.\n\n"
    }
  ]
}