{
  "title": "Install from a USB flash drive (Português)",
  "url": "https://wiki.archlinux.org/title/Install_from_a_USB_flash_drive_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- CD Burning\n- Archiso\n- Multiboot USB drive (Português)\n\nEsta página discute vários métodos multiplataforma sobre como criar uma unidade USB do instalador do Arch Linux (também conhecida como \"unidade flash\", \"pendrive\", \"USB stick\", \"flash drive\", \"USB key\" etc.) para inicializar na BIOS e sistemas UEFI. O resultado será um sistema LiveUSB (similar a LiveCD) que pode ser usado para instalar o Arch Linux, manutenção do sistema ou para fins de recuperação, e que, por causa da natureza do SquashFS, descartará todas as alterações quando o computador for desligado.\n\nSe você deseja executar uma instalação completa do Arch Linux a partir de uma unidade USB (por exemplo, com configurações persistentes), consulte Instalando Arch Linux em um pendrive. Se você gostaria de usar seu pendrive inicializável com Arch Linux como um sistema de recuperação, veja chroot.\n\n"
    },
    {
      "title": "No GNU/Linux",
      "level": 4,
      "content": "Note: **sdx** \n\nNote: **não** \n\nExecute o seguinte comando, substituindo /dev/sdx pela sua unidade, por exemplo /dev/sdb. (não anexe um número de partição, de forma a não usar algo como /dev/sdb1)\n\n```\n# dd bs=4M if=path/to/archlinux.iso of=/dev/sdx status=progress oflag=sync\n```\n\nVeja dd(1) para mais informações sobre dd. Veja dd(1) § DESCRIPTION para mais informações sobre oflag=sync.\n\ngnome-multi-writer é uma ferramenta gráfrica baseada em GTK3 para escrever um arquivo ISO para um ou mais dispositivos USB de uma só vez.\n\nKindd é um frontend gráfico baseado no Qt para dd. Está disponível como kinddAUR.\n\n"
    },
    {
      "title": "No Windows",
      "level": 4,
      "content": "Rufus é um escritor multiuso de ISO em USB. Ele fornece uma interface gráfica do usuário e não se importa se a unidade está formatada corretamente ou não.\n\nBasta selecionar a ISO do Arch Linux, a unidade USB na qual você deseja criar o Arch Linux inicializável e clicar em Iniciar.\n\nNote: **modo Imagem DD** \n\n- Para Rufus versão ≥ 3.0, selecione GPT a partir do menu suspenso Esquema de partição. Ao clicar em Iniciar, você verá o diálogo de seleção de modo, selecione o modo Imagem DD.\n- Para Rufus versão < 3.0,selecione o modo Imagem DD a partir do menu suspenso na parte inferior.\n\nEsse método não requer nenhuma solução alternativa e é tão simples quanto dd no Linux. Basta baixar o ISO do Arch Linux e, com permissões de administrador local, use o utilitário USBwriter para gravar na memória flash USB.\n\nwin32diskimager é outra ferramenta gráfica de gravação de ISO para Windows. Basta selecionar sua imagem ISO e a letra da unidade USB de destino (talvez seja necessário formatá-la primeiro para atribuir uma letra de unidade) e clicar em Write.\n\nCertifique-se que sua instalação de Cygwin contém o pacote dd.\n\nColoque seu arquivo de imagem em seu diretório home:\n\n```\nC:\\cygwin\\home\\joao\\\n```\n\nExecute o cygwin como administrador (necessário para o cygwin acessar o hardware). Para escrever na sua unidade USB, use o seguinte comando:\n\n```\ndd if=imagem.iso of=\\\\.\\x: bs=4M\n```\n\nsendo imagem.iso o caminho para o arquivo de imagem iso dentro do diretório cygwin e \\\\.\\x: é a sua unidade flash USB onde x é a letra designada pelo Windows, por exemplo \\\\.\\d:.\n\nNo Cygwin 6.0, descubra a partição correta com:\n\n```\ncat /proc/partitions\n```\n\ne escreva a imagem ISO com as informações da saída. Exemplo:\n\n```\ndd if=imagem.iso of=/dev/sdb bs=4M\n```\n\nUma versão do dd licenciada sob GPL para Windows está disponível em http://www.chrysocome.net/dd. A vantagem dela sobre o Cygwin é um download menor. Use-a como mostrado nas instruções do Cygwin acima.\n\nPara começar, baixe a última versão do dd para Windows. Uma vez baixado, extraia o conteúdo do arquivo em Downloads ou em outro lugar.\n\nAgora, inicie seu prompt de comando como administrador. Em seguida, mude o diretório (cd) para o diretório Downloads.\n\nSe a sua ISO do Arch Linux estiver em outro lugar, você pode precisar declarar o caminho completo, por conveniência, você pode querer colocar o ISO do Arch Linux na mesma pasta que o executável dd. O formato básico do comando será semelhante a este:\n\n```\n# dd if=archlinux-versão-x86_64.iso od=\\\\.\\x: bs=4M\n```\n\nSimplesmente substitua os vários pontos nulos (indicados por um \"x\") com a data correta e letra de unidade correta. Aqui está um exemplo completo. Por exemplo:\n\n```\n# dd if=ISOs\\archlinux-versão-x86_64.iso od=\\\\.\\d: bs=4M\n```\n\nNote: Você pode descobrir o número da unidade física digitando wmic diskdrive list brief no prompt de comando ou com dd --list\n\n```\n# dd if=ISOs\\archlinux-versão-x86_64.iso of=\\\\.\\PhysicalDrive1 bs=4M\n```\n\nVocê pode descobrir o número da unidade física digitando wmic diskdrive list brief no prompt de comando ou com dd --list\n\n"
    },
    {
      "title": "No macOS",
      "level": 4,
      "content": "Primeiro, você precisa identificar o dispositivo USB. Abra /Applications/Utilities/Terminal e liste todos os dispositivos de armazenamento com o comando:\n\n```\n$ diskutil list\n```\n\nSeu dispositivo USB aparecerá como algo como /dev/disk2 (external, physical). Verifique se esse é o dispositivo que você deseja apagar verificando seu nome e tamanho e, em seguida, use seu identificador para os comandos abaixo, em vez de /dev/diskX.\n\nUm dispositivo USB é normalmente automontado no macOS e você pode ter que desmontá-lo (não ejetar) antes de escrever blocos nele com dd. No Terminal, execute:\n\n```\n$ diskutil unmountDisk /dev/diskX\n```\n\nAgora, copie o arquivo de imagem ISO para o dispositivo. O comando dd é similar à sua contraparte Linux, mas note o 'r' antes do modo 'disk' para modo raw, que torna a transferência muito mais rápida:\n\n```\n# dd if=caminho/para/arch.iso of=/dev/rdiskX bs=1m\n```\n\nEsse comando será executado sem qualquer mensagem de saída. Para ver o progresso, envie SIGINFO pressionando Ctrl+t. Note que diskX aqui não deve incluir o sufixo s1 ou, do contrário, o dispositivo USB só será inicializável no modo UEFI e não no legado. Após a conclusão, o macOS reclamar \"O disco que você inseriu não podia ser lido por este computador\". Selecione 'Ignorar'. O dispositivo USB será inicializável.\n\n"
    },
    {
      "title": "No Android",
      "level": 4,
      "content": "EtchDroid é um instalador de imagem de sistema operacional para o Android. Ele funciona sem permissões de root no Android 5 até o Android 8. De acordo com relatórios de erros, nem sempre funciona no Android 9 e Android 4.4.\n\nPara criar um instalador do Arch Linux, baixe o arquivo de imagem ISO no seu dispositivo Android. Conecte a unidade USB ao seu dispositivo, usando um adaptador USB-OTG, se necessário. Abra o EtchDroid, selecione \"Flash raw image\", selecione o seu Arch ISO e selecione o seu drive USB. Conceda a permissão da API USB e confirme.\n\nMantenha seu telefone em uma mesa enquanto está gravando a imagem: muitos adaptadores USB-OTG são um pouco instáveis e você pode desconectá-lo por engano.\n\n"
    },
    {
      "title": "No GNU/Linux",
      "level": 4,
      "content": "Esse método é mais complicado do que gravar a imagem diretamente com dd, mas mantém a unidade flash utilizável para armazenamento de dados (ou seja, o ISO é instalado em uma partição específica dentro de um dispositivo já particionado sem alterar outras partições).\n\nNote: **Xn** \n\n- Se ainda não tiver feito, crie uma tabela de partição em /dev/sdX.\n- Se ainda não tiver feito, crie uma partição no dispositivo. A partição /dev/sdXn deve ser formatada para FAT32.\n- Monte a imagem ISO, monte o sistema de arquivos FAT32 localizado no dispositivo flash USB e copie o conteúdo da imagem ISO para ele. Em seguida, desmonte a imagem ISO, mas mantenha a partição FAT32 montada (isso pode usado em etapas subsequentes). Por exemplo:\n\n```\n# mkdir -p /mnt/{iso,usb}\n# mount -o loop archlinux-versão-x86_64.iso /mnt/iso\n# mount /dev/sdXn /mnt/usb\n# cp -a /mnt/iso/* /mnt/usb\n# sync\n# umount /mnt/iso\n```\n\nPara inicializar um rótulo ou um UUID para selecionar, é necessário informar a partição a ser inicializada. Por padrão, o rótulo ARCH_AAAAMM (com o ano e mês de lançamento apropriado) é usado. Assim, o rótulo do sistema de arquivos precisa ser definido de acordo, por exemplo, usando gparted. Alternativamente, você pode mudar este comportamento alterando as linhas terminadas por archisolabel=ARCH_AAAAMM no arquivo /mnt/usb/arch/boot/syslinux/archiso_sys.cfg (para inicialização de BIOS), e em /mnt/usb/loader/entries/archiso-x86_64.conf (para inicialização com UEFI). Para usar um UUID, substitua as porções de linhas com archisodispositivo=/dev/disk/by-uuid/SEU-UUID. O UUID pode ser recuperado com blkid -o valor -s UUID /dev/sdXn.\n\nOs arquivos Syslinux para sistemas BIOS já são copiados para /mnt/usb/arch/boot/syslinux. Instale o pacote syslinux e siga as instruções em Syslinux#Manually para tornar a partição inicializável.\n\n"
    },
    {
      "title": "No Windows",
      "level": 4,
      "content": "Note: **criador de USB inicializável** \n\n- Para formatação manual, não use nenhum utilitário criador de USB inicializável para criar o USB UEFI inicializável. Para formatação manual, não use dd para Windows para inserir o ISO na unidade USB.\n- Nos comandos abaixo, X: é considerado como sendo a unidade flash USB no Windows.\n- Windows usa barra invertida \\ como separador de caminho, então o mesmo é usado nos comandos abaixo.\n- Todos os comandos devem ser executados no prompt de comandos do Windows como administrador.\n- > denota o prompt de comando do Windows.\n\n- Particione e formate o drive USB usando o particionador de USB Rufus. Selecione a opção de esquema de partição como MBR para BIOS e UEFI e sistema de arquivos como FAT32. Desmarque a opção \"Criar um disco inicializável usando imagem ISO\" e \"Criar arquivos estendidos de rótulo e ícone\".\n- Altere o Rótulo do Volume da unidade flash USB X: para corresponder ao LABEL mencionado na parte archisolabel= em <ISO>\\loader\\entries\\archiso-x86_64.conf. Esta etapa é necessária para o ISO oficial (Archiso). Esta etapa também pode ser executada usando o Rufus, durante a etapa anterior de \"particionamento e formatação\".\n- Extraia a ISO (similar a extrair o arquivo ZIP) para a unidade flash USB usando 7-Zip.\n- Baixe os binários oficiais Syslinux 6.xx (arquivo zip) de https://www.kernel.org/pub/linux/utils/boot/syslinux/ e extrai-a. A versão do Syslinux deve ser a mesma versão usada na imagem ISO.\n\n- Execute o comando a seguir (no prompt de comando do Windows, como admin):\n\n```\n> cd bios\\\n> for /r %Y in (*.c32) do copy \"%Y\" \"X:\\arch\\boot\\syslinux\\\" /y\n> copy mbr\\*.bin X:\\arch\\boot\\syslinux\\ /y\n```\n\n- Instale Syslinux no USB executando (use win64\\syslinux64.exe para Windows x64):\n\n```\n> cd bios\\\n> win32\\syslinux.exe -d /arch/boot/syslinux -i -a -m X:\n```\n\n- A etapa acima instala o ldlinux.sys do Syslinux no VBR da partição USB, define a partição como \"active/boot\" na tabela de partições MBR e grava o código de inicialização do MBR no primeiro código de inicialização de 440 bytes região do USB.\n- O opção -d espera um caminho com separador de caminho de barra como nos sistemas * unix.\n\n"
    },
    {
      "title": "Usando uma unidade USB multiboot",
      "level": 4,
      "content": "Isso permite inicializar vários ISOs de um único dispositivo USB, incluindo o archiso. Atualizar uma unidade USB existente para uma ISO mais recente é mais simples do que na maioria dos outros métodos. Veja Unidade USB de inicialização múltipla.\n\n"
    },
    {
      "title": "Usando o utilitário de disco do GNOME",
      "level": 4,
      "content": "As distribuições Linux que usam o GNOME podem facilmente criar um live CD através do nautilus e do gnome-disk-utility. Basta clicar com o botão direito no arquivo .iso e selecionar Abrir com Gravador de imagem de disco. Quando o Utilitário de disco do GNOME abrir, especifique a unidade flash no menu suspenso Destino e clique em Iniciar Restauração.\n\n"
    },
    {
      "title": "Fazendo uma unidade USB-ZIP",
      "level": 4,
      "content": "Para alguns sistemas BIOS antigos, somente a inicialização de unidades USB-ZIP é suportada. Este método permite que você ainda inicialize a partir de uma unidade USB-HDD.\n\n- Baixe syslinux e mtools de repositórios oficiais.\n- Localize sua unidade usb com lsblk.\n- Digite mkdiskimage -4 /dev/sdx 0 64 32 (substitua x com a letra de sua unidade). Isso vai levar um tempo.\n\nA partir daqui, continue com o método de formatação manual. A partição será /dev/sdx4 por causa da forma que unidades ZIP funcionam.\n\n"
    },
    {
      "title": "Usando UNetbootin",
      "level": 4,
      "content": "O UNetbootin pode ser usado em qualquer distribuição Linux ou no Windows para copiar seu ISO para um dispositivo USB. No entanto, o Unetbootin sobrescreve o syslinux.cfg, portanto, ele cria um dispositivo USB que não inicializa corretamente. Por esse motivo, Unetbootin não é recomendado -- use dd ou um dos outros métodos discutidos neste tópico.\n\nEdite syslinux.cfg:\n\n```\nsysconfig.cfg\n```\n\n```\ndefault menu.c32\nprompt 0\nmenu title Archlinux Installer\ntimeout 100\n\nlabel unetbootindefault\nmenu label Archlinux_x86_64\nkernel /arch/boot/x86_64/vmlinuz\nappend initrd=/arch/boot/x86_64/archiso.img archisodevice=/dev/sdx1 ../../\n```\n\nEm /dev/sdx1 você deve substituir x pela primeira letra livre após a última letra em uso no sistema onde você está instalando o Arch Linux (p.ex., Se você tiver dois discos rígidos, use c. Você pode fazer essa alteração durante a primeira fase de inicialização pressionando Tab quando o menu é exibido.\n\n"
    },
    {
      "title": "A forma Flashnul",
      "level": 4,
      "content": "flashnul é um utilitário para verificar a funcionalidade e manutenção da memória Flash (Flash USB, IDE-Flash, SecureDigital, MMC, MemoryStick, SmartMedia, XD, CompactFlash etc).\n\nEm um prompt de comando, chame flashnul com -p e determine qual índice de dispositivo é seu drive USB, por exemplo:\n\n```\nC:\\>flashnul -p\n```\n\n```\nAvailable physical drives:\nAvailable logical disks:\nC:\\\nD:\\\nE:\\\n```\n\nDepois de determinar qual é o dispositivo correto, você pode gravar a imagem em sua unidade, chamando flashnul com o índice do dispositivo, -L e o caminho para sua imagem, por exemplo:\n\n```\nC:\\>flashnul E: -L caminho\\para\\arch.iso\n```\n\nContanto que você tenha certeza de que deseja gravar os dados, digite yes e espere um pouco para que eles sejam gravados. Se você receber um erro de acesso negado, feche todas as janelas do Explorer abertas.\n\nSe sob o Vista ou o Win7, você deve abrir o console como administrador, senão o flashnul não conseguirá abrir o pendrive como um dispositivo de bloco e só poderá gravar através dos meios fornecidos pelo Windows.\n\n"
    },
    {
      "title": "Carregar a mídia de instalação da RAM",
      "level": 4,
      "content": "Este método usa Syslinux e um Ramdisk (MEMDISK) para carregar toda a imagem ISO do Arch Linux na RAM. Como isso será executado inteiramente a partir da memória do sistema, você precisará certificar-se de que o sistema em que você estará instalando tenha uma quantidade adequada. Uma quantidade mínima de RAM entre 500 MB e 1 GB deve ser suficiente para uma instalação do Arch Linux baseada em MEMDISK.\n\nPara obter mais informações sobre os requisitos do sistema Arch Linux, bem como sobre os do MEMDISK, consulte o Guia de instalação e aqui. Para referência, aqui está o tópico do fórum anterior.\n\nComece formatando a unidade flash USB como FAT32. Em seguida, crie as seguintes pastas na unidade recém-formatada.\n\n- Boot Boot/ISOs Boot/Settings\n\n- Boot/ISOs\n- Boot/Settings\n\nEm seguida copie o ISO que você gostaria de inicializar na pasta Boot/ISOs. Depois disso, extraia os seguintes arquivos da última versão do syslinux do site aqui e copie-os para o seguinte pastas.\n\n- ./win32/syslinux.exe para a pasta Área de trabalho ou Downloads em seu sistema.\n- ./memdisk/memdisk para a pasta Settings em seu dispositivo flash USB.\n\nDepois de copiar os arquivos necessários, navegue até a unidade flash USB, /boot/Settings e crie um arquivo syslinux.cfg.\n\n```\n/Boot/Settings/syslinux.cfg\n```\n\n```\nDEFAULT arch_iso\n\nLABEL arch_iso\n        MENU LABEL Arch Setup\n        LINUX memdisk\n        INITRD /Boot/ISOs/archlinux-versão-x86_64.iso\n        APPEND iso\n```\n\nPara mais informações sobre o Syslinux veja o artigo do Arch Wiki.\n\nFinalmente, crie um arquivo *.bat onde syslinux.exe está localizado e execute-o (\"Executar como administrador\" se você estiver no Vista ou no Windows 7):\n\n```\nC:\\Documents and Settings\\usuário\\Área de trabalho\\install.bat\n```\n\n```\n@echo off\nsyslinux.exe -m -a -d /Boot/Settings X:\n```\n\n"
    },
    {
      "title": "Solução de problemas",
      "level": 2,
      "content": "- Se você receber o erro \"device did not show up after 30 seconds\" devido à não montagem do /dev/disk/by-label/ARCH_AAAAMM, tente renomear sua mídia USB para ARCH_AAAAMM (por exemplo, ARCH_201501).\n- Se você receber erros, tente usar outro dispositivo USB. Existem casos em que resolveu todos os problemas.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Gentoo wiki - LiveUSB/HOWTO\n- Fedora wiki - How to create and use Live USB\n- openSUSE wiki - SDB:Live USB stick\n\n"
    }
  ]
}