{
  "title": "Install Arch Linux with accessibility options (Français)",
  "url": "https://wiki.archlinux.org/title/Install_Arch_Linux_with_accessibility_options_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Le support d'installation officiel d'Arch Linux prend en charge diverses fonctionnalités d'Accessibilité :\n\n- la synthèse vocale est fournie par le paquet espeakup\n- la prise en charge du terminal en braille est fourni par le paquet brltty\n\nCe document décrit comment installer Arch Linux en utilisant ces fonctionnalités.\n\n"
    },
    {
      "title": "Démarrer l'environnement «live»",
      "level": 3,
      "content": "Quand le support d'installation commence à démarrer, appuyez sur Bas suivi de Entrée pour démarrer avec la synthèse vocale activée.\n\nLes écrans braille branchés en USB devraient être détectés automatiquement par udev.\n\n"
    },
    {
      "title": "Cartes son multiples",
      "level": 3,
      "content": "Si votre ordinateur dispose de plusieurs cartes son, vous entendrez le message suivant : Please select your sound card for speech output.\n\nQuand un bip retentit sur la sortie audio que vous souhaitez utiliser, appuyez sur Entrée pour la sélectionner.\n\n"
    },
    {
      "title": "Changer la langue de la synthèse vocale",
      "level": 3,
      "content": "Pour modifier la langue de espeak-ng utilisée par espeakup.service, éditez l'unité de façon à ce que le code de la langue soit ajouté à default_voice= dans la partie Environment=.\n\nIl est également possible de changer la voix de espeak-ng en ajoutant +variant au code de langue. Consultez espeakup(8) et espeak-ng(1) pour plus d'informations.\n\n"
    },
    {
      "title": "Installation des paquets essentiels",
      "level": 3,
      "content": "Pour la prise en charge de la synthèse vocale dans le système installé, vous avez besoin de espeakup et alsa-utils. Si vous utilisez un écran braille, installez le paquet brltty.\n\nAjoutez les paquets souhaités à la commande pacstrap(8) lors de l'installation :\n\n```\n# pacstrap -K /mnt base linux linux-firmware espeakup alsa-utils\n```\n\n"
    },
    {
      "title": "Carte son",
      "level": 3,
      "content": "Si des #Cartes son multiples ont été détectées, copiez le fichier /etc/asound.conf, qui a été généré dans le support d'installation :\n\n```\n# cp /etc/asound.conf /mnt/etc/\n```\n\n"
    },
    {
      "title": "Activer les services",
      "level": 3,
      "content": "Pour bénéficier d'une assistance vocale après le démarrage du système installé, activez espeakup.service. Consultez également #Changer la langue de la synthèse vocale.\n\n"
    },
    {
      "title": "Redémarrage",
      "level": 2,
      "content": "Après redémarrage du système nouvellement installé, la synthèse vocale devrait commencer automatiquement.\n\n"
    }
  ]
}