{
  "title": "Install Arch Linux with accessibility options (Català)",
  "url": "https://wiki.archlinux.org/title/Install_Arch_Linux_with_accessibility_options_(Catal%C3%A0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "El mitjà d'instal·lació oficial d'Arch Linux suporta diverses característiques d'Accessibilitat:\n\n- El paquet espeakup permet la lectura de pantalla.\n- El paquet brltty gestiona el suport per a terminals braille.\n\nAquest document explica com instal·lar Arch Linux utilitzant aquestes característiques.\n\n"
    },
    {
      "title": "Arranqueu l'entorn live",
      "level": 3,
      "content": "Quan el mitjà d'instal·lació comenci l'arrencada, premeu Fletxa avall seguida per Retorn per a arrencar amb la lectura de pantalla activada.\n\nLes pantalles braille USB haurien de ser detectades automàticament via udev.\n\n"
    },
    {
      "title": "Múltiples targetes de so",
      "level": 3,
      "content": "Si el vostre ordinador té més d'una targeta de so, sentireu el següent missatge: Please select your sound card for speech output. (en català: Si us plau, seleccioneu la vostra targeta de so per a la sortida de la lectura de pantalla.).\n\nQuan sentiu un bip a la sortida que vulgueu emprar, premeu Retorn per a seleccionar la targeta.\n\n"
    },
    {
      "title": "Canvieu l'idioma de lectura",
      "level": 3,
      "content": "Per a canviar l'idioma o veu del espeak-ng que utilitza espeakup.service, editeu la unitat de tal manera que el codi de l'idioma aparegui just després de default_voice= a la directiva Environment=.\n\nTambé podeu canviar la variant de veu del espeak-ng afegint +variant al codi d'idioma. Vegeu espeakup(8) i espeak-ng(1) per a més informació.\n\n"
    },
    {
      "title": "Instal·leu els paquets essencials",
      "level": 3,
      "content": "Per a tindre suport per a la lectura de pantalla al sistema instal·lat, necessitareu espeakup i alsa-utils. Si useu una pantalla braille, instal·leu el paquet brltty.\n\nAfegiu els paquets necessaris a la crida a pacstrap(8) a l'hora d'instal·lar:\n\n```\n# pacstrap -K /mnt base linux linux-firmware espeakup alsa-utils\n```\n\n"
    },
    {
      "title": "Targeta de so",
      "level": 3,
      "content": "Si s'han detectat #Múltiples targetes de so, copieu el fitxer /etc/asound.conf, generat pel mitjà d'instal·lació:\n\n```\n# cp /etc/asound.conf /mnt/etc/\n```\n\n"
    },
    {
      "title": "Activeu els serveis",
      "level": 3,
      "content": "Per a tindre suport per a la lectura de pantalla després d'arrencar el sistema instal·lat haureu d'activar espeakup.service. Vegeu també #Canvieu l'idioma de lectura.\n\n"
    },
    {
      "title": "Reinicieu",
      "level": 2,
      "content": "Després d'arrencar el nou sistema, la lectura de pantalla hauria de començar automàticament.\n\n"
    },
    {
      "title": "Resolució de problemes",
      "level": 2,
      "content": "La majoria d'aplicacions haurien de funcionar sense seguir cap pas addicional, com les basades en Gtk, Qt o Gecko. Podeu verificar la funcionalitat executant accerciser. L'aplicació escollida hauria d'aparèixer i tindre una estructura d'arbre amb molts nivells. Podrien haver-hi problemes si:\n\n- No heu activat les tecnologies d'accessibilitat per a la vostra distribució. Acostuma a haver-hi en algun lloc una casella de selecció que les activarà. Després d'activar-les, haureu de reiniciar.\n- L'aplicació és basada en Chromium o Electron. Aquests programes normalment necessiten la variable d'entorn ACCESIBILITY_ENABLED=1, i l'argument addicional --force-renderer-accessibility a l'hora d'executar-los. En el cas de Chrome, podeu activar les opcions d'accessibilitat a chrome://accessibility en comptes de seguir aquest últim pas, però sembla que aquesta configuració no es conserva en reiniciar el sistema.\n- L'aplicació és basada en Java. En aquest cas, haureu d'instal·lar el pont ATK java-atk-wrapper-openjdk8 (depenent de la vostra versió de Java).\n- En l'estrany cas que l'aplicació sigui molt vella o exòtica i s'hagi construït amb Qt4, com és el cas d'alguns programes que no han rebut manteniment des del 2015, haureu d'instal·lar qt-at-spi.\n- Com a últim recurs, alguna d'aquestes variables d'entorn podria ajudar: GTK_MODULES=gail:atk-bridge, OOO_FORCE_DESKTOP=gnome, GNOME_ACCESSIBILITY=1, QT_ACCESSIBILITY=1, QT_LINUX_ACCESSIBILITY_ALWAYS_ON=1.\n\n"
    }
  ]
}