{
  "title": "Installation guide (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Installation_guide_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Bu belge, Arch Linux'u resmî kurulum kalıbı ile, tercih ettiğiniz kurulum aracını kullanarak yüklemenize yardımcı olacak bir rehberdir. Kurulum ortamı canlı sistem şeklindedir ve canlı sisteme erişebilmek için kurulum aracını cihazınıza bağlayıp, cihazınızı bu ortamda önyüklemeniz gerekmektedir. Canlı sistem, Arch Linux'u erişilebilirlik ayarları ile kurma sayfasında açıklandığı üzere erişilebilirlik seçenekleri sunmaktadır. Başkaca kurulum yöntemleri için Kategori: Yükleme süreci sayfasına göz atın.\n\nKurulumdan önce SSS sayfasına bakmanız tavsiye edilir. Bu dokümanda kullanılan ortak standartlar hakkında bilgi edinmek için Yardım:Okuma yönergeleri sayfasını ziyaret edebilirsiniz. Bilhassa italik biçimde yazılmış yer tutucular, kullanıcı tarafından elle değiştirilmelidir.\n\nRehber kısa tutulmuştur ve talimatları bölüm başında belirtilen sırayla takip etmeniz tavsiye edilir. Daha ayrıntılı yönergeler için ilgili ArchWiki makalelerine ve çeşitli programların kullanım kılavuzlarına (man page) göz atabilir, etkileşimli yardım için IRC kanalı (İngilizce) ve forumlardan (İngilizce) yararlanabilirsiniz.\n\nArch Linux, x86_64 uyumlu, 512 MiB belleğe sahip her cihazda çalışabilmelidir ancak canlı sistemi önyükleyebilmek için daha fazla belleğe ihtiyaç duyulur.[1] Temel bir kurulum diskte 2 GiB'dan az yer kaplamalıdır. Kurulum, uzak depolardan paketler indirmeyi gerektireceği için bu süreçte internet bağlantınızın olduğu varsayılır.\n\n"
    },
    {
      "title": "Kurulum kalıbı edinme",
      "level": 3,
      "content": "Download sayfasından, önyüklemeyi nasıl yapmak istediğinize göre ISO dosyasını veya Netboot kalıbını edinin. Ayrıca aynı sayfadan ilgili PGP imzasını da edinmeyi unutmayın, bir sonraki aşamada bu imzaya ihtiyacınız olacaktır.\n\n"
    },
    {
      "title": "İmzayı doğrulama",
      "level": 3,
      "content": "İndirdiğiniz kalıbı kullanmadan önce doğrulamanız tavsiye edilir. Özellikle zararlı kalıplar sunacak şekilde müdahale edilme tehlikesi barındıran HTTP yansımalarından indirilen dosyaları kullanmadan önce imza doğrulamak önemlidir.\n\nSisteminizde GnuPG yüklü ise PGP imzasını, ISO'nun bulunduğu dizine indirip (Download sayfasında Checksums'ın altında) şu komut ile doğrulayın:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-sürüm-x86_64.iso.sig\n```\n\nVeya süregelen bir Arch Linux kurulumundayken şu komutu çalıştırın:\n\n```\n$ pacman-key -v archlinux-sürüm-x86_64.iso.sig\n```\n\n- İmzanın kendisi archlinux.org yerine yansıma bir siteden indirilmişse kötü amaçlarla değiştirilmiş olabilir. Bu durumda imzayı çözmek için kullanılan kamusal anahtarın (public key) başka güvenilir bir anahtar tarafından imzalandığına emin olun. gpg komutu kamusal anahtar parmak izinin çıktısını verecektir.\n- İmzanın geçerliliğini onaylamanın bir başka yolu ise kamusal anahtar parmak izi ile Arch Linux geliştiricilerinden ISO'yu imzalayan kişinin anahtar parmak izinin aynı olduğunu doğrulamaktır. Kamusal anahtar işlemi hakkında daha fazla bilgi edinmek için Wikipedia:tr:Açık anahtarlı şifreleme makalesine göz atın.\n\n"
    },
    {
      "title": "Kurulum diski hazırlama",
      "level": 3,
      "content": "ISO dosyası hedef cihaza bir USB disk, optik disk veya ağ üzerinden PXE ile sağlanabilir: ilgili makaleleri takip edip tercih ettiğiniz ISO ile kendinize bir kurulum diski hazırlayabilirsiniz.\n\nNetboot kalıbı için Netboot#Boot from a USB flash drive makalesini takip edin ve UEFI olarak önyüklenebilir bir USB disk hazırlayın.\n\n"
    },
    {
      "title": "Canlı ortamda önyükleme",
      "level": 3,
      "content": "1. BIOS/UEFI üzerinden Arch Linux kurulum ortamını barındıran önyükleme aygıtını seçin. Önyükleme menüsüne genellikle POST safhasında, açılış ekranında belirtilen tuşa (Örneğin F2 veya Del) basarak ulaşılabilir. Detaylar için anakartınızın kullanım kılavuzuna başvurun.\n1. Kurulumun önyükleme menüsü açıldığında, Eğer ISO'yu kullanıyorsanız, Arch Linux kurulum ortamını seçin ve Enter'a tıklayıp ana kurulum ortamına girin. Eğer Netboot kalıbını kullanıyorsanız, Mirror bölümünden coğrafi anlamda yakın bir yansıma seçin, ardından Boot Arch Linux'u seçin ve Enter'a tıklayın. İpucu: ISO, UEFI modunda iken systemd-boot, BIOS modunda iken syslinux kullanır. Önyükleme parametrelerini girmek için sırasıyla e veya Tab tuşlarını kullanın, parametrelerin listesi için README.bootparams dosyasına bakın. Netboot kalıbı iPXE kullanır ve önyükleme parametreleri Boot options menüsünden belirlenebilir. Elle tanımlanan önyükleme parametrelerine verilebilecek en yaygın örnek yazı tipi boyutudur. HiDPI ekranlarda (sistem tarafından algılanmadığında) okunabilirlik için fbcon=font:TER16x32 parametresini kullanmak yardımcı olabilir. Ayrıntılı açıklama için HiDPI#Linux console (tty) sayfasına bakın.\n1. Bu adımların sonunda ilk sanal uçbirim ekranına tam yetkili kullanıcı olarak giriş yapmış olacaksınız ve sizi Zsh kabuğu karşılayacak.\n\n- Eğer ISO'yu kullanıyorsanız, Arch Linux kurulum ortamını seçin ve Enter'a tıklayıp ana kurulum ortamına girin.\n- Eğer Netboot kalıbını kullanıyorsanız, Mirror bölümünden coğrafi anlamda yakın bir yansıma seçin, ardından Boot Arch Linux'u seçin ve Enter'a tıklayın. İpucu: ISO, UEFI modunda iken systemd-boot, BIOS modunda iken syslinux kullanır. Önyükleme parametrelerini girmek için sırasıyla e veya Tab tuşlarını kullanın, parametrelerin listesi için README.bootparams dosyasına bakın. Netboot kalıbı iPXE kullanır ve önyükleme parametreleri Boot options menüsünden belirlenebilir. Elle tanımlanan önyükleme parametrelerine verilebilecek en yaygın örnek yazı tipi boyutudur. HiDPI ekranlarda (sistem tarafından algılanmadığında) okunabilirlik için fbcon=font:TER16x32 parametresini kullanmak yardımcı olabilir. Ayrıntılı açıklama için HiDPI#Linux console (tty) sayfasına bakın.\n\n- ISO, UEFI modunda iken systemd-boot, BIOS modunda iken syslinux kullanır. Önyükleme parametrelerini girmek için sırasıyla e veya Tab tuşlarını kullanın, parametrelerin listesi için README.bootparams dosyasına bakın. Netboot kalıbı iPXE kullanır ve önyükleme parametreleri Boot options menüsünden belirlenebilir.\n- Elle tanımlanan önyükleme parametrelerine verilebilecek en yaygın örnek yazı tipi boyutudur. HiDPI ekranlarda (sistem tarafından algılanmadığında) okunabilirlik için fbcon=font:TER16x32 parametresini kullanmak yardımcı olabilir. Ayrıntılı açıklama için HiDPI#Linux console (tty) sayfasına bakın.\n\nFarklı bir uçbirime geçmek için—örneğin, bu rehberi kurulum süresince Lynx'te görüntülemek için—Alt+yön tuşu kısayolunu kullanın. Yapılandırma dosyalarını düzenlemek için, mcedit(1), nano ve vim kullanılabilir durumdadır. Kurulum ortamına dahil edilmiş paketlerin listesi için packages.x86_64 sayfasına bakın.\n\n"
    },
    {
      "title": "Konsol klavye düzenini ve yazı tipini ayarlama",
      "level": 3,
      "content": "Varsayılan uçbirim tuşeşlemi İngilizce (ABD)'dir. Kullanılabilir düzenler şu komut ile listelenebilir:\n\n```\n# localectl list-keymaps\n```\n\nDüzeni değiştirmek için loadkeys(1) komutuna uçbirim tuşeşleminin ismini girin. Örneğin, Türkçe Q klavye düzenine ayarlamak için:\n\n```\n# loadkeys trq\n```\n\nVeya Türkçe F klavye için:\n\n```\n# loadkeys trf\n```\n\nUçbirim yazı tipleri /usr/share/kbd/consolefonts/ dizininde bulunur, tercih ettiğiniz yazı tipine ayarlamak için setfont(8) komutunu kullanabilirsiniz, yazı tipini dosya dizinini ve uzantısını dahil etmeden girmeniz gerekmektedir. Örneğin HiDPI ekranlara uygun en büyük yazı tiplerinden birini kullanmak için şu komutu çalıştırın:\n\n```\n# setfont ter-132b\n```\n\n"
    },
    {
      "title": "Önyükleme modunu doğrulama",
      "level": 3,
      "content": "Hangi önyükleme modunda olduğunuzu öğrenmek için UEFI bit genişliğini kontrol edin:\n\n```\n# cat /sys/firmware/efi/fw_platform_size\n```\n\n- Eğer komut 64 şeklinde çıktı veriyorsa sistem, UEFI modunda ve 64-bit x64 UEFI'ye sahip demektir.\n- Eğer komut 32 şeklinde çıktı veriyorsa sistem UEFI modunda ve 32-bit IA32 UEFI'ye sahip demektir, bu mod desteklenmektedir ancak önyükleyici olarak karma önyükleme modunu destekleyen bir önyükleyici seçmenizi gerektirir.\n- Eğer komut çalıştırıldığında No such file or directory çıktısı alıyorsanız, sistem BIOS veya CSM modunda önyüklenmiş olabilir.\n\nEğer sistem istediğiniz modda (UEFI veya BIOS) önyüklenmemiş ise anakartınızın kullanım kılavuzuna başvurun.\n\n"
    },
    {
      "title": "İnternete bağlanma",
      "level": 3,
      "content": "Canlı ortamda bir internet bağlantısı sağlamak için şu adımları takip edin:\n\n1. Kullanacağınız ağ arayüzünün listelenmiş ve etkin olduğunu doğrulayın, örneğin ip-link(8) aracılığıyla: # ip link\n1. Kablosuz ağa veya WAN'a bağlanmadan önce ilgili kartın rfkill ile bloke edilmediğinden emin olun.\n1. Ağa bağlanın: Ethernet—kabloyu takın. Wi-Fi—iwctl'yi kullanarak kablosuz ağa bağlanın. Mobil genişbant modemi—mmcli'yi kullanarak mobil ağa bağlanın.\n1. Ağ bağlantınızı yapılandırın: DHCP: (systemd-networkd ve systemd-resolved tarafından sağlanan) dinamik IP adresi ve DNS sunucusu atamaları; ethernet, WLAN ve WWAN ağ arayüzleri için hiçbir ayarlamaya gerek duymadan çalışıyor olmalıdır. Statik IP adresi: Network configuration#Static IP address sayfasını takip edin.\n1. Bağlantınızı test etmek için ping komutunu kullanabilirsiniz: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernet—kabloyu takın.\n- Wi-Fi—iwctl'yi kullanarak kablosuz ağa bağlanın.\n- Mobil genişbant modemi—mmcli'yi kullanarak mobil ağa bağlanın.\n\n- DHCP: (systemd-networkd ve systemd-resolved tarafından sağlanan) dinamik IP adresi ve DNS sunucusu atamaları; ethernet, WLAN ve WWAN ağ arayüzleri için hiçbir ayarlamaya gerek duymadan çalışıyor olmalıdır.\n- Statik IP adresi: Network configuration#Static IP address sayfasını takip edin.\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Sistem saatini güncelleme",
      "level": 3,
      "content": "Canlı ortamda systemd-timesyncd varsayılan olarak açıktır ve internet bağlantısı sağladığınız andan itibaren sistem zamanı otomatik olarak senkronize edilecektir.\n\ntimedatectl(1) kullanarak sistem saatinin senkronize olduğunu temin edin:\n\n```\n# timedatectl\n```\n\n"
    },
    {
      "title": "Disk bölümlendirmesi",
      "level": 3,
      "content": "Diskler, canlı sistem tarafından algılandıktan sonra; /dev/sda, /dev/nvme0n1 veya /dev/mmcblk0 gibi bir blok aygıta atanır. Bu cihazları tanımlayabilmek için, lsblk veya aşağıdaki fdisk komutunu kullanın.\n\n```\n# fdisk -l\n```\n\nrom, loop veya airootfs şeklinde olan bölümler görmezden gelinebilir. rpbm, boot0 ve boot1 şeklinde biten mmcblk* cihazlar da aynı şeklide görmezden gelinebilir.\n\nAşağıda belirtilen disk bölümleri seçtiğiniz herhangi bir blok aygıt için zorunlu bölümlerdir:\n\n- Kök dizin için bir bölüm /.\n- UEFI modda önyükleyebilmek için: bir EFI sistem bölümü.\n\nfdisk benzeri bir bölümlendirme aracı kullanın. Örneğin:\n\n```\n# fdisk /dev/bölümlendirilecek_disk\n```\n\n- Riskli ve karmaşık dönüşümleri veya yeniden bölümlendirme işlemlerini önlemek için uzun vâdeli kullanıma uygun bir bölümlendirme şeması planlamaya zaman ayırın.\n- LVM, sistem şifrelemesi veya RAID için yığın blok cihazı oluşturmak istiyorsanız bu aşamada yapmalısınız.\n- Eğer önyükleyeceğiniz disk hâlihazırda bir EFI sistem bölümü barındırıyorsa yeni bir tane oluşturmayın ve bulunanı kullanın.\n- Takas (swap) alanı, destekleyen dosya sistemlerinde takas dosyası şeklinde de ayarlanabilir. Alternatif olarak, disk üzerinde takastan tamamen kaçınabilir ve sistemi kurduktan sonra zram ile takas bölgesi ayarlayıp kullanabilirsiniz.\n\n"
    },
    {
      "title": "Örnek düzenler",
      "level": 4,
      "content": "Table content:\nYükleme yapılan sistemdeki bağlantı noktası | Bölüm | Bölüm tipi | Önerilen boyut\n/boot1 | /dev/efi_sistem_bölümü | EFI sistem bölümü | 1 GiB\n[SWAP] | /dev/takas_bölümü | Linux swap | En az 4 GiB\n/ | /dev/kök_bölümü | Linux x86-64 kök dizini (/) | Cihazda geriye kalan tüm alan, en az 23-32 GiB arası olmalıdır\n\n1. EFI bölümünü /efi gibi farklı bağlantı noktalarına da bağlayabilirsiniz. Ancak kullanacağınız önyükleyicinin sistem çekirdeğini ve initramfs imajlarını kök dizininden yükleyebilmesi gerekir.\n\nTable content:\nYükleme yapılan sistemdeki bağlantı noktası | Bölüm | Bölüm tipi | Önerilen boyut\n[SWAP] | /dev/takas_bölümü | Linux swap | En az 4 GiB\n/ | /dev/kök_bölümü | Linux | Cihazda geriye kalan tüm alan, en az 23-32 GiB arası olmalıdır\n\nÖrnek bölümlendirme düzenlerini inceleyip nasıl bir düzen oluşturmanız gerektiği hakkında ipucu alabilirsiniz.\n\n"
    },
    {
      "title": "Bölüm biçimlendirme",
      "level": 3,
      "content": "Bölümler oluşturulduktan sonra, oluşturulmuş her yeni bölüm uygun dosya sistemi ile biçimlendirilmelidir. Konu hakkında File systems#Create a file system sayfasında daha fazla detaya ulaşabilirsiniz.\n\nÖrneğin, /dev/kök_bölümü bölümünde Ext4 dosya sistemi oluşturmak için şu komutu çalıştırın:\n\n```\n# mkfs.ext4 /dev/kök_bölümü\n```\n\nEğer takas için bir bölüm oluşturmuşsanız mkswap(8) ile hazır hâle getirin:\n\n```\n# mkswap /dev/takas_bölümü\n```\n\nEğer bir EFI sistem bölümü oluşturmuşsanız mkfs.fat(8) aracını kullanarak FAT32 şeklinde biçimlendirin.\n\n```\n# mkfs.fat -F 32 /dev/efi_sistem_bölümü\n```\n\n"
    },
    {
      "title": "Dosya sistemlerini bağlama",
      "level": 3,
      "content": "Kök dizinini /mnt'a bağlayın. Örneğin, kök disk bölümü /dev/kök_bölümü ise:\n\n```\n# mount /dev/kök_bölümü /mnt\n```\n\n/mnt bölümünün altında geriye kalan bağlama noktalarını oluşturun ve ilgili bölümlere bağlayın. (/boot için /mnt/boot gibi)\n\nUEFI sistemler için, EFI sistem bölümünü bağlayın:\n\n```\n# mount --mkdir /dev/efi_sistem_bölümü /mnt/boot\n```\n\nEğer bir takas bölümü oluşturmuşsanız swapon(8) ile etkinleştirin:\n\n```\n# swapon /dev/swap_bölümü\n```\n\nRehberin sonraki aşamalarında genfstab(8), bağlanmış dosya sistemlerini ve takas alanını algılayacaktır.\n\n"
    },
    {
      "title": "Yansıma bağlantıları seçme",
      "level": 3,
      "content": "İndirilecek olan paketler yansıma sunuculardan indirilmelidir, bu sunucular /etc/pacman.d/mirrorlist dosyası tarafından belirlenir. Canlı sistemde internete bağlandıktan sonra reflector, yansımaların listesini, en yeni 20 senkronize HTTPS yansımasını indirme hızına göre sıralayıp bu sıraya göre günceller.\n\nListede bir yansımanın yukarılara yerleştirilmiş olması, bir paketin indirilmesi sırasında ona verilecek önceliği ifade eder. Listenin doğruluğundan emin olmak için incelemek isteyebilirsiniz. Eğer listede sıkıntılar olduğunu düşünüyorsanız dosyayı gereğince düzenleyebilirsiniz.\n\nBu yansımalar dosyası, sonrasında pacstrap ile yeni yükleyeceğiniz sisteme kopyalanacağı için doğru bir şekilde düzenlemek önemlidir.\n\n"
    },
    {
      "title": "Temel paketleri yükleme",
      "level": 3,
      "content": "base paketini, Linux çekirdeğini ve yaygın donanımlar için donanım yazılımlarını pacstrap(8) betiği ile yükleyin:\n\n```\n# pacstrap -K /mnt base linux linux-firmware\n```\n\n- İstediğiniz sistem çekirdeği tercihinize göre linux paketi yerine başka bir çekirdek paketini kurabilirsiniz. Veya eğer kap/container (sanallaştırma) içine kurulum yapıyorsanız çekirdek yüklemeyebilirsiniz.\n- Sanal makineye veya kap içerisine kurulum yaparken donanım yazılımlarını indirmeyebilirsiniz\n\nbase, canlı kurulum ortamındaki tüm araçları barındırmaz, bu yüzden tümüyle işlevsel, temel bir sistem için daha fazla pakete ihtiyaç duyulabilir. Başka paket veya paket gruplarını indirmek için paketlerin isimlerini yukarıdaki pacstrap komutunun sonuna (aralara boşluk bırakarak) ekleyebilirsiniz veya yeni sisteme chroot yapılmışken pacman kullanarak indirebilirsiniz. Bilhassa şunları indirmeniz gerekebilir:\n\n- donanımsal hata ve güvenlik çözümleri için CPU mikrokod güncellemeleri (amd-ucode veya intel-ucode),\n- sistemde kullanılacak dosya sistemleri için kullanıcı alanı (user space) araçları, örneğin dosya sistemi oluşturmak ve fsck için\n- eğer sistemde kullanılacaksa RAID veya LVM bölümlerine erişim için gerekli araçlar\n- linux-firmware paketine dahil edilmemiş özel donanım yazılımları (ör. yerleşik ses için sof-firmware, Marvell kablosuz cihazları ve Broadcom kablosuz cihazlarına ait diğer donanım yazılımları için linux-firmware-marvell)\n- ağ yapılandırması için gerekli araçlar (ör. bir ağ yöneticisi veya bağımsız bir DHCP istemcisi, Wi-Fi için doğrulama yazılımı veya mobil genişbant bağlantıları için ModemManager)\n- yapılandırma dosyalarını konsol üzerinden düzenleyebilmek için bir konsol metin düzenleyicisi (ör. nano)\n- man ve info sayfalarındaki dokümanlara ulaşabilmek için gerekli paketler: man-db, man-pages ve texinfo.\n\nNelerin gerekli olabileceği konusunda bir fikir edinmek için canlı sistemde bulunan paketlerin listesi packages.x86_64'de sıralanmıştır.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Bir fstab dosyası oluşturun (UUIDleri veya etiketleri tanımlamak için -U veya -L bayraklarını kullanın)\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nOluşturmuş olduğunuz /mnt/etc/fstab dosyasını kontrol edin ve bir hata söz konusu ise tercih ettiğiniz metin editörü ile düzenleyin.\n\n"
    },
    {
      "title": "Yeni sisteme giriş (Chroot)",
      "level": 3,
      "content": "Yeni sistemin köküne geçiş yapın:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Zaman",
      "level": 3,
      "content": "Zaman dilimini ayarlayın:\n\n```\n# ln -sf /usr/share/zoneinfo/Europe/Istanbul /etc/localtime\n```\n\n/etc/adjtime dosyasını oluşturmak için hwclock(8) komutunu çalıştırın:\n\n```\n# hwclock --systohc\n```\n\nBu komut donanım saatinizin UTC yani Eşgüdümlü Evrensel Zaman'a ayarlı olduğunu varsayar. Detaylar için System time#Time standard sayfasına bakabilirsiniz.\n\nSaatte kaymaları önlemek ve sistem zamanınızın doğru olduğundan emin olmak için systemd-timesyncd gibi bir Ağ Zaman Protokolü (NTP) kullanarak zaman senkronizasyonunu ayarlayın.\n\n"
    },
    {
      "title": "Yerelleştirme",
      "level": 3,
      "content": "Tercih ettiğiniz düzenleyici ile /etc/locale.gen dosyasını açın. tr_TR.UTF-8 UTF-8 ve diğer ihtiyaç duyacağınız UTF-8 yerel bölge ifadelerinin yorum karakterini (# sembolü) silin. Ardından sistem yerelleştirme ayarlarını şu komut ile oluşturun:\n\n```\n# locale-gen\n```\n\nlocale.conf(5) dosyasını oluşturun ve LANG değişkenini gereğince tanımlayın:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=tr_TR.UTF-8\n```\n\nKlavye düzenini değiştirmişseniz, vconsole.conf(5) dosyasını düzenleyerek bu düzeni kalıcı hâle getirebilirsiniz:\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=trq\n```\n\n"
    },
    {
      "title": "Ağ yapılandırması",
      "level": 3,
      "content": "hostname doyasını oluşturup bilgisayar adını ayarlayın:\n\n```\n/etc/hostname\n```\n\n```\nbilgisayar_adiniz\n```\n\nYeni kurmuş olduğunuz ortam için ağ ayarlarını tamamlayın. Örneğin eğer pacstrap sırasında yüklememişseniz uygun ağ yönetim yazılımlarını yükleyebilir, eğer gerekliyse yapılandırabilir ve önyükleme sonrasında çalışması için ilgili systemd birimini başlatabilirsiniz.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "Yeni initramfs oluşturmak genellikle gerekli değildir çünkü pacstrap ile sistem çekirdeği yüklenirken mkinitcpio çalıştırılır ve initramfs oluşturulur.\n\nSisteminiz LVM, sistem şifrelemesi ve RAID içeriyor ise, mkinitcpio.conf(5) dosyasını düzenleyin ve initramfs imajını tekrar oluşturun:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Kök şifresi",
      "level": 3,
      "content": "Kök kullanıcı şifresini ayarlayın:\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Önyükleyici",
      "level": 3,
      "content": "Linux ile uyumlu bir önyükleyici seçip kurun.\n\n"
    },
    {
      "title": "Yeniden başlatma",
      "level": 2,
      "content": "Chroot ortamından exit komutu veya Ctrl+d tuş kombinasyonu ile çıkın.\n\nTercihen tüm disk bölümlerinin bağlantısını, umount -R /mnt komutu ile kesebilirsiniz. Bu şekilde hâlen \"meşgul\" bir disk bölümü varsa haberdar olabilir ve fuser(1) ile sebebini saptayabilirsiniz.\n\nSon olarak bilgisayarınızı reboot komutu ile yeniden başlatın: canlı sisteme bağlı kalmış bir disk bölümü varsa bağlantısı systemd tarafından otomatik olarak kesilecektir. Kurulum diskini çıkarmayı unutmayın, ve ardından yeni sisteminize kök kullanıcısı olarak giriş yapın.\n\n"
    },
    {
      "title": "Kurulum sonrası",
      "level": 2,
      "content": "Sistem yönetimi için yönergeleri ve kurulum sonrası yapılması gerekenler için hazırlanmış öğreticileri Genel öneriler sayfasında bulabilirsiniz. (Çizgesel (Graphical) kullanıcı arabirimi (GUI) ayarlamak, sınırlı yetkiye sahip kullanıcı oluşturmak gibi)\n\nİlgilenebileceğiniz uygulamaların listesi için Uygulamalar listesi'ne göz atın.\n\n"
    }
  ]
}