{
  "title": "Intel (Русский)",
  "url": "https://wiki.archlinux.org/title/Intel_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Intel GMA 3600\n- Xorg (Русский)\n- Kernel mode setting (Русский)\n- Xrandr\n- Hybrid graphics\n- Vulkan (Русский)\n- GPGPU\n\nС тех пор как Intel предоставляет и поддерживает только свободные драйвера, видеокарты Intel graphics работают \"из коробки\".\n\nВсеобъемлющий список моделей видеокарт и соответствующих чипсетов и процессоров доступен в английской Википедии и Gentoo:Intel#Feature support.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет mesa, который предоставляет драйвер DRI для 3D-ускорения.\n\n- Для поддержки 32 битных приложений, установите lib32-mesa из репозитория multilib.\n- Для DDX драйвера (который обеспечивает 2D-ускорение в Xorg) установите пакет xf86-video-intel. (Не рекомендуется, см. Примечание ниже.)\n- Для поддержки Vulkan (Ivy Bridge и новее) установите пакет vulkan-intel.\n\nСмотрите также Аппаратное ускорение видео.\n\n"
    },
    {
      "title": "Загрузка",
      "level": 2,
      "content": "Модуль ядра Intel должен автоматически загрузиться при запуске системы.\n\nЕсли он не загрузился, то:\n\n- Убедитесь, что вы не используете параметр ядра nomodeset, так как kernel mode-setting обязателен для Intel.\n- Также проверьте, что модуль не добавлен в чёрный список в каталогах /etc/modprobe.d/ или /usr/lib/modprobe.d/.\n\n"
    },
    {
      "title": "Ранний запуск KMS",
      "level": 3,
      "content": "Kernel mode setting (KMS) поддерживается чипсетами Intel, использующими драйвер i915 DRM; он обязателен и включен по умолчанию.\n\nКак включить KMS как можно раньше при загрузке, описано в статье Kernel mode setting (Русский)#Ранний запуск KMS.\n\n"
    },
    {
      "title": "Загрузка прошивки GuC / HuC",
      "level": 3,
      "content": "Начиная с 9 поколения графики (Skylake и новее) используется Graphics micro (μ) Controller (GuC) для следующей функциональности [3][устаревшая ссылка 2023-09-16 ⓘ]:\n\n- Вынос некоторых задач по декодированию медиа на HEVC/H.265 micro (µ) Controller (HuC). Используется только вместе с intel-media-driver для аппаратного ускорения видео. Появилось в Gen9.\n- Использование GuC для планирования, передачи контекста и управления питанием. Введено в Alder Lake-P (Mobile), в рамках Gen12.\n\nДля использования этих возможностей нужно загрузить прошивку GuC. Что касается поддержки HuC, некоторые функции видео (например, CBR rate control в режиме кодирования с низким энергопотреблением SKL) также требуют загрузки прошивки HuC [4]. Файлы прошивок GuC и HuC предоставляются пакетом linux-firmware.\n\nФункциональность GuC контролируется параметром ядра i915.enable_guc. Он используется следующим образом:\n\nTable content:\nЗначение enable_guc | GuC Submission | HuC Firmware Loading | По умолчанию для платформ | Поддерживается на платформах\n0 | Нет | Нет | Tiger Lake, Rocket Lake и Pre-Gen12 [5] | Все\n1 | Да | Нет | – | Alder Lake-P (Mobile) и новее\n2 | Нет | Да | Alder Lake-S (Desktop) [6] [7] | Gen9 и новее\n3 | Да | Да | Alder Lake-P (Mobile) и новее\n\nЕсли GuC submission или HuC firmware loading не включены по умолчанию для вашего GPU, вы можете включить их вручную.\n\nВ первую очередь убедитесь, что пакет linux-firmware установлен.\n\nЕсли ваша система настроена на поздний запуск KMS (по умолчанию), вы можете вручную включить эти возможности, установив параметр i915.enable_guc, как описано в статье Параметры ядра.\n\nЕсли же вы добавили модуль i915 в initramfs (смотрите Kernel mode setting (Русский)#Ранний запуск KMS), то вместо этого вы должны установить эти опции через файл в каталоге /etc/modprobe.d/, например:\n\n```\n/etc/modprobe.d/i915.conf\n```\n\n```\noptions i915 enable_guc=2\n```\n\nИ затем пересобрать образ initramfs.\n\nПри следующей загрузке можно проверить, что GuC и HuC включены, с помощью dmesg:\n\n```\n# dmesg\n```\n\n```\n[30130.586970] i915 0000:00:02.0: [drm] GuC firmware i915/icl_guc_33.0.0.bin version 33.0 submission:disabled\n[30130.586973] i915 0000:00:02.0: [drm] HuC firmware i915/icl_huc_9.0.0.bin version 9.0 authenticated:yes\n```\n\nЕсли они не поддерживаются вашим графическим адаптером, вы увидите:\n\n```\n# dmesg\n```\n\n```\n[    0.571339] i915 0000:00:02.0: [drm] Incompatible option enable_guc=2 - GuC is not supported!\n[    0.571340] i915 0000:00:02.0: [drm] Incompatible option enable_guc=2 - HuC is not supported!\n```\n\nТакже для проверки можно использовать:\n\n```\n# cat /sys/kernel/debug/dri/0/gt/uc/guc_info\n# cat /sys/kernel/debug/dri/0/gt/uc/huc_info\n```\n\nNote: Обратите внимание, что соответствующее предупреждение не является фатальным, как объясняется в [8]:\n\n```\n# journalctl\n```\n\n```\n... kernel: [drm:intel_gvt_init [i915]] *ERROR* i915 GVT-g loading failed due to Graphics virtualization is not yet supported with GuC submission\n... kernel: i915 0000:00:02.0: [drm:i915_driver_load [i915]] Device initialization failed (-5)\n... kernel: i915: probe of 0000:00:02.0 failed with error -5\n... kernel: snd_hda_intel 0000:00:1f.3: failed to add i915 component master (-19)\n```\n\nОбратите внимание, что соответствующее предупреждение не является фатальным, как объясняется в [8]:\n\n```\n# journalctl -b\n```\n\n```\n... kernel: i915 0000:00:02.0: Direct firmware load for i915/gvt/vid_0x8086_did_0x5916_rid_0x02.golden_hw_state failed with error -2\n```\n\n"
    },
    {
      "title": "Настройка Xorg",
      "level": 2,
      "content": "Для запуска Xorg никакой специальной настройки обычно не требуется.\n\nЕсли он всё-таки не запускается или вы хотите изменить какие-то настройки драйвера, можно создать примерно такой файл настроек Xorg:\n\n```\n/etc/X11/xorg.conf.d/20-intel.conf\n```\n\n```\nSection \"Device\"\n  Identifier \"Intel Graphics\"\n  Driver \"intel\"\nEndSection\n```\n\nДополнительные опции добавляются в строках ниже Driver. Полный список доступных опций описан в intel(4).\n\n"
    },
    {
      "title": "AccelMethod",
      "level": 3,
      "content": "Согласно intel(4) § CONFIGURATION DETAILS:\n\nВам может понадобиться прописать Option \"AccelMethod\" при создании файла конфигурации. Классическими вариантами являются UXA, SNA (по умолчанию) и BLT.\n\nЕсли у вас возникают проблемы со стандартным SNA (например, пикселированная графика, повреждённый текст и т.д.), попробуйте использовать вместо него UXA, что можно сделать, добавив следующую строку в файл настроек Xorg:\n\n```\nOption      \"AccelMethod\"  \"uxa\"\n```\n\n"
    },
    {
      "title": "Настройка модуля ядра",
      "level": 2,
      "content": "Модуль ядра i915 можно настраивать через опции модуля. Часть этих опций модуля влияют на энергосбережение.\n\nСписок всех опций с кратким их описанием и значения по умолчанию можно получить командой:\n\n```\n$ modinfo -p i915\n```\n\nЧтобы проверить, какие опции в данный момент включены, выполните\n\n```\n# systool -m i915 -av\n```\n\nВы можете заметить, что многие опции по умолчанию имеют значение -1, что означает использование настроек энергосбережения по умолчанию для чипа. Однако можно настроить более агрессивное энергосбережение с помощью опций модуля.\n\n"
    },
    {
      "title": "Сжатие буфера кадров (enable_fbc)",
      "level": 3,
      "content": "Использование сжатия буфера кадров (Framebuffer compression, FBC) позволяет снизить энергопотребление и уменьшить пропускную способность памяти, необходимую для обновления экрана.\n\nДля включения FBC добавьте параметр ядра i915.enable_fbc=1 или пропишите его в файле /etc/modprobe.d/i915.conf:\n\n```\n/etc/modprobe.d/i915.conf\n```\n\n```\noptions i915 enable_fbc=1\n```\n\nNote: Или таких:\n\n```\nkernel: drm: not enough stolen space for compressed buffer, disabling.\n```\n\nИли таких:\n\n```\n# dmesg\n```\n\n```\n[ 2360.475430] [drm] not enough stolen space for compressed buffer (need 4325376 bytes), disabling\n[ 2360.475437] [drm] hint: you may be able to increase stolen memory size in the BIOS to avoid this\n```\n\nРешением является отключение сжатия буфера кадров, что слегка увеличит энергопотребление (около 0,06 Вт). Для его отключения добавьте i915.enable_fbc=0 в параметры ядра. Более подробную информацию о результатах отключения сжатия можно найти здесь.\n\n"
    },
    {
      "title": "Fastboot",
      "level": 3,
      "content": "Цель Intel Fastboot — сохранить буфер кадров, настроенный BIOS или загрузчиком, чтобы избежать мерцания до запуска Xorg.[12][13]\n\nЧтобы включить fastboot на платформах, где он ещё не используется по умолчанию, добавьте i915.fastboot=1 в параметры ядра или в /etc/modprobe.d/i915.conf:\n\n```\n/etc/modprobe.d/i915.conf\n```\n\n```\noptions i915 fastboot=1\n```\n\n"
    },
    {
      "title": "Поддержка виртуализации графики Intel GVT-g",
      "level": 3,
      "content": "Смотрите Intel GVT-g.\n\n"
    },
    {
      "title": "Включение performance support",
      "level": 3,
      "content": "Начиная с Gen6 (Sandy Bridge более новые), GPU Intel предоставляют счётчики производительности, используемые для предоставления драйверам внутренних данных о производительности. Драйверы и аппаратные регистры называют эту инфраструктуру Observation Architecture («OA») [14], но в документации Intel она также обозначается как Observability Performance Counters [15][устаревшая ссылка 2023-09-16 ⓘ] [16][устаревшая ссылка 2023-09-16 ⓘ].\n\nПо умолчанию использовать observation architecture могут только программы, запущенные с привилегиями CAP_SYS_ADMIN (эквивалент root) или CAP_PERFMON. [17] [18] Большинство приложений будут нормально работать и без них, но будет появляться следующее предупреждение:\n\n```\nMESA-INTEL: warning: Performance support disabled, consider sysctl dev.i915.perf_stream_paranoid=0\n```\n\nЧтобы включить performance support без использования привилегий (или root), укажите этот параметр с помощью sysctl.\n\nЕсли установка значения 0 в файле /etc/sysctl.d/*.conf приводит к следующей ошибке при загрузке:\n\n```\nsysctl: cannot stat /proc/sys/dev/i915/perf_stream_paranoid: No such file or directory\n```\n\nто нужно добавить модуль i915 в initramfs для раннего запуска KMS.\n\n"
    },
    {
      "title": "Настройка режима масштабирования",
      "level": 3,
      "content": "Это может быть полезно для некоторых полноэкранных приложений:\n\n```\n$ xrandr --output LVDS1 --set PANEL_FITTING param\n```\n\nГде param одно из следующих значений:\n\n- center: разрешение экрана не будет меняться, масштабирование отключено,\n- full: масштабировать разрешение экрана для использования всего места на экране или\n- full_aspect: максимально масштабировать разрешение экрана, но соблюдать соотношение сторон.\n\nЕсли это не сработало, попробуйте:\n\n```\n$ xrandr --output LVDS1 --set \"scaling mode\" param\n```\n\nГде param это \"Full\", \"Center\" или \"Full aspect\".\n\n"
    },
    {
      "title": "Декодирование H.264 на GMA 4500",
      "level": 3,
      "content": "Пакет libva-intel-driver предоставляет только декодирование MPEG-2 для некоторых GPU серии GMA 4500. Чтобы проверить, касается ли это вашего конкретного GPU, установите этот драйвер и пакет libva-utils, а затем проверьте вывод команды vainfo на наличие записей, начинающихся с VAProfileH264.\n\nПоддержка декодирования H.264 сопровождается в отдельной ветке под названием g45-h264, которой можно воспользоваться, установив пакет libva-intel-driver-g45-h264AUR. Однако имейте в виду, что данная поддержка экспериментальна и в данный момент не ведётся активная разработка. Использование VA-API с этим драйвером на GMA 4500 серии видеокарт уменьшит нагрузку на центральный процессор, однако не гарантируется плавное воспроизведение в сравнении с программным декодированием. Тестирование с использованием mplayer показало что использование vaapi для воспроизведения закодированного в H.264 1080p видео снизило нагрузку на процессор, однако воспроизведение происходит с рывками, в то время как воспроизведение 720p работало удовлетворительно [21]. Это подтверждает и опыт других пользователей [22]. Установка большего размера выделяемой видеопамяти в BIOS приводит к гораздо лучшему воспроизведению с аппаратным декодированием. Даже 1080p h264 работает хорошо после этого[23]. Плавное воспроизведение (1080p/720p) работает также с mpv-gitAUR в сочетании с ffmpeg-gitAUR и libva-intel-driver-g45-h264AUR. С помощью MPV и плагина Firefox \"Send to MPV player\"[24] можно смотреть видео с аппаратным ускорением на YouTube.\n\n"
    },
    {
      "title": "Старый драйвер OpenGL (i965)",
      "level": 3,
      "content": "В Mesa 20.0 для Gen8+ по умолчанию используется новый OpenGL-драйвер Iris. Некоторые приложения работают с ним быстрее. Вы можете отключить его и вернуться к использованию старого драйвера i965, установив переменную окружения MESA_LOADER_DRIVER_OVERRIDE=i965 перед запуском любого приложения OpenGL. Эта настройка не влияет на приложения Vulkan.\n\n"
    },
    {
      "title": "Переопределение сообщаемой версии OpenGL",
      "level": 3,
      "content": "Переменная окружения MESA_GL_VERSION_OVERRIDE может использоваться для переопределения версии OpenGL, которая будет сообщаться приложению. Например, при установке MESA_GL_VERSION_OVERRIDE=4.5 будет сообщаться версия OpenGL 4.5.\n\n"
    },
    {
      "title": "Просмотр использования GPU",
      "level": 3,
      "content": "Смотрите Аппаратное ускорение видео#Проверка.\n\n"
    },
    {
      "title": "Управление яркостью и гаммой",
      "level": 3,
      "content": "Смотрите Backlight (Русский).\n\n"
    },
    {
      "title": "Тиринг",
      "level": 3,
      "content": "У некоторых пользователей случается тиринг из-за метода ускорения SNA. Чтобы исправить это, включите опцию \"TearFree\" в файле настроек Xorg:\n\n```\n/etc/X11/xorg.conf.d/20-intel.conf\n```\n\n```\nSection \"Device\"\n   Identifier  \"Intel Graphics\"\n   Driver      \"intel\"\n   Option      \"TearFree\"    \"true\"\nEndSection\n```\n\nСм. отчёт об ошибке за подробной информацией.\n\n- Данная опция может не работать если SwapbuffersWait выставлена на false.\n- Данная опция может значительно увеличить выделение памяти и снизить производительность. [25]\n- Данная опция может создать дополнительные проблемы в некоторых приложениях, например Super Meat Boy.\n- Данная опция не работает с методом ускорения UXA, только с SNA.\n- Для Intel UHD 620 или 630 может понадобиться добавить Option \"TripleBuffer\" \"true\" для работы TearFree.\n\n"
    },
    {
      "title": "Отключение вертикальной синхронизации (VSYNC)",
      "level": 3,
      "content": "Полезно, когда:\n\n- Chromium/Chrome лагает или тормозит из-за GPU, а с опцией --disable-gpu работает гладко\n- тест glxgears не показывает желаемой производительности\n\nДрайвер intel использует тройную буферизацию[устаревшая ссылка 2023-07-30 ⓘ] для вертикальной синхронизации, что позволяет без потерь в производительности избежать разрывы кадров. Чтобы отключить вертикальную синхронизацию (например, для \"бенчмаркинга\") создайте файл .drirc в вашей домашней директории со следующим содержимым:\n\n```\n~/.drirc\n```\n\n```\n<device screen=\"0\" driver=\"dri2\">\n\t<application name=\"Default\">\n\t\t<option name=\"vblank_mode\" value=\"0\"/>\n\t</application>\n</device>\n```\n\nНе используйте driconfAUR[ссылка недействительна: package not found] для создания этого файла, так как он выставит неправильное название драйвера.\n\n"
    },
    {
      "title": "Проблемы с DRI3",
      "level": 3,
      "content": "Драйвер xf86-video-intel по умолчанию использует DRI3. На некоторых системах это может вызвать проблемы, подобные этой. Чтобы переключиться на DRI2, добавьте следующую строку в файл настроек Xorg:\n\n```\nOption \"DRI\" \"2\"\n```\n\nДля драйвера modesetting это не сработает. Вместо этого укажите переменную окружения LIBGL_DRI3_DISABLE=1.\n\n"
    },
    {
      "title": "Повреждение шрифтов и экрана в приложениях GTK (пропадают глифы при возвращении из ждущего/спящего режима)",
      "level": 3,
      "content": "Если вы столкнулись с проблемой пропадания символов в приложениях GTK, вам может помочь следующее обходное решение. Отредактируйте файл /etc/environment и добавьте следующую строку:\n\n```\n/etc/environment\n```\n\n```\nCOGL_ATLAS_DEFAULT_BLIT_MODE=framebuffer\n```\n\nСмотрите также FreeDesktop bug 88584.\n\n"
    },
    {
      "title": "Пустой экран во время загрузки системы на этапе \"Loading modules\"",
      "level": 3,
      "content": "Если вы используете \"поздний старт\" KMS и во время загрузки системы наблюдаете пустой экран, может помочь добавление i915 и intel_agp в initramfs. Смотрите раздел #Ранний запуск KMS выше.\n\nЛибо можно добавить следующее в параметры ядра:\n\n```\nvideo=SVIDEO-1:d\n```\n\nЕсли необходим вывод в VGA, попробуйте следующее:\n\n```\nvideo=VGA-1:1280x800\n```\n\n"
    },
    {
      "title": "X зависает/падает с драйверами intel",
      "level": 3,
      "content": "Некоторые проблемы со сбоем X, зависания GPU, или проблемы с зависанием X, могут быть решены путем отключения использования GPU с опцией NoAccel:\n\n```\n/etc/X11/xorg.conf.d/20-intel.conf\n```\n\n```\nSection \"Device\"\n   Identifier \"Intel Graphics\"\n   Driver \"intel\"\n   Option \"NoAccel\" \"True\"\nEndSection\n```\n\nКроме того, попробуйте отключить 3D-ускорение только с опцией DRI:\n\n```\n/etc/X11/xorg.conf.d/20-intel.conf\n```\n\n```\nSection \"Device\"\n   Identifier \"Intel Graphics\"\n   Driver \"intel\"\n   Option \"DRI\" \"False\"\nEndSection\n```\n\n"
    },
    {
      "title": "Добавление неопределённых разрешений",
      "level": 3,
      "content": "Этот вопрос рассматривается в Xrandr page.\n\n"
    },
    {
      "title": "Подсветка не регулируется",
      "level": 3,
      "content": "Если после возвращения из ждущего режима яркость экрана не регулируется, проверьте свою конфигурацию в соответствии со статьёй Backlight (Русский).\n\nЕсли проблема остаётся, использование одного из следующих параметров ядра может помочь:\n\n```\nacpi_osi=Linux\nacpi_osi=\"!Windows 2012\"\nacpi_osi=\n```\n\nТакже убедитесь, что вы не используете fastboot (параметр ядра i915.fastboot), так как он может ломать управление подсветкой.\n\n"
    },
    {
      "title": "Искажение/Зависание в Chromium и Firefox",
      "level": 3,
      "content": "Если у вас проявляются искажения или зависания в Chromium и/или Firefox, попробуйте следующее:\n\n- Используйте AccelMethod \"uxa\"\n- Отключите VSYNC\n- Включите опцию TearFree\n- Отключите «DRI» и ускорение (проверено на 10 поколении Intel Iris): Option \"NoAccel\" \"True\" Option \"DRI\" \"False\"\n\n```\nOption \"NoAccel\" \"True\"\nOption \"DRI\" \"False\"\n```\n\n"
    },
    {
      "title": "Ядро сбоит с ядрами 4.0+ на чипах Broadwell/Core-M",
      "level": 3,
      "content": "Через несколько секунд после запуска X/Wayland машина зависает и в логе journalctl будет описан крах ядра ссылающийся на графику Intel, как показано ниже:\n\n```\nJun 16 17:54:03 hostname kernel: BUG: unable to handle kernel NULL pointer dereference at           (null)\nJun 16 17:54:03 hostname kernel: IP: [<          (null)>]           (null)\n...\nJun 16 17:54:03 hostname kernel: CPU: 0 PID: 733 Comm: gnome-shell Tainted: G     U     O    4.0.5-1-ARCH #1\n...\nJun 16 17:54:03 hostname kernel: Call Trace:\nJun 16 17:54:03 hostname kernel:  [<ffffffffa055cc27>] ? i915_gem_object_sync+0xe7/0x190 [i915]\nJun 16 17:54:03 hostname kernel:  [<ffffffffa0579634>] intel_execlists_submission+0x294/0x4c0 [i915]\nJun 16 17:54:03 hostname kernel:  [<ffffffffa05539fc>] i915_gem_do_execbuffer.isra.12+0xabc/0x1230 [i915]\nJun 16 17:54:03 hostname kernel:  [<ffffffffa055d349>] ? i915_gem_object_set_to_cpu_domain+0xa9/0x1f0 [i915]\nJun 16 17:54:03 hostname kernel:  [<ffffffff811ba2ae>] ? __kmalloc+0x2e/0x2a0\nJun 16 17:54:03 hostname kernel:  [<ffffffffa0555471>] i915_gem_execbuffer2+0x141/0x2b0 [i915]\nJun 16 17:54:03 hostname kernel:  [<ffffffffa042fcab>] drm_ioctl+0x1db/0x640 [drm]\nJun 16 17:54:03 hostname kernel:  [<ffffffffa0555330>] ? i915_gem_execbuffer+0x450/0x450 [i915]\nJun 16 17:54:03 hostname kernel:  [<ffffffff8122339b>] ? eventfd_ctx_read+0x16b/0x200\nJun 16 17:54:03 hostname kernel:  [<ffffffff811ebc36>] do_vfs_ioctl+0x2c6/0x4d0\nJun 16 17:54:03 hostname kernel:  [<ffffffff811f6452>] ? __fget+0x72/0xb0\nJun 16 17:54:03 hostname kernel:  [<ffffffff811ebec1>] SyS_ioctl+0x81/0xa0\nJun 16 17:54:03 hostname kernel:  [<ffffffff8157a589>] system_call_fastpath+0x12/0x17\nJun 16 17:54:03 hostname kernel: Code:  Bad RIP value.\nJun 16 17:54:03 hostname kernel: RIP  [<          (null)>]           (null)\n```\n\nЭто может быть исправлено путем отключения поддержки execlist, которая была изменена по умолчанию на ядре с версии 4.0. Добавьте следующий параметр ядра:\n\n```\ni915.enable_execlists=0\n```\n\nЭто сломано как минимум в версии ядра 4.0.5.\n\n"
    },
    {
      "title": "Зависание Windows-гостя",
      "level": 3,
      "content": "Видеовывод гостевой системы Windows в VirtualBox иногда зависает, пока хост не заставит обновить экран (например, перемещением курсора мыши). Удаление опции enable_fbc=1 устраняет эту проблему.\n\n"
    },
    {
      "title": "Мерцание экрана",
      "level": 3,
      "content": "Panel Self Refresh (PSR), функция энергосбережения, используемая iGPU Intel, вызывает мерцание экрана в некоторых случаях FS#49628 FS#49371 FS#50605. Временным решением является отключение этой функции с помощью параметра ядра i915.enable_psr=0.\n\n"
    },
    {
      "title": "OpenGL 2.1 с драйвером i915",
      "level": 3,
      "content": "Обновление mesa с версии 13.x до 17 может сломать поддержку OpenGL 2.1 на GPU Intel третьего поколения (GMA3100, смотрите здесь), как описано в этой статье, откатив его к OpenGL 1.4. Однако это можно восстановить вручную, установив в /etc/drirc или ~/.drirc такие параметры:\n\n```\n/etc/drirc\n```\n\n```\n<driconf>\n...\n    <device driver=\"i915\">\n        <application name=\"Default\">\n            <option name=\"stub_occlusion_query\" value=\"true\" />\n            <option name=\"fragment_shader\" value=\"true\" />\n        </application>\n    </device>\n...\n</driconf>\n```\n\n"
    },
    {
      "title": "Проблема с KMS: консоль ограничена в небольшую площадь",
      "level": 3,
      "content": "Один из портов низкого разрешения видео может быть включен во время загрузки системы, в результате чего терминал использует маленькую часть экрана. Чтобы исправить это, отдельно отключите порт с помощью опции модуля i915 video=SVIDEO-1:d в параметрах командной строке ядра в загрузчике. Больше информации об этом доступно на странице Параметры ядра.\n\nЕсли это не сработало, попробуйте выключить TV1 или VGA1 вместо SVIDEO-1. Имена портов можно узнать с помощью xrandr.\n\n"
    },
    {
      "title": "Не работает звук через HDMI на процессорах Haswell",
      "level": 3,
      "content": "Как описано в этом сообщении об ошибке в Linux, звук не будет выводиться через HDMI при intel_iommu=on. Для решения проблемы используйте следующий параметр ядра:\n\n```\nintel_iommu=on,igfx_off\n```\n\nИли вообще отключите IOMMU:\n\n```\nintel_iommu=off\n```\n\n"
    },
    {
      "title": "Сбои/зависания на маломощных процессорах Intel",
      "level": 3,
      "content": "Процессоры Intel с низким энергопотреблением и/или процессоры ноутбуков имеют тенденцию к случайному зависанию или сбою из-за проблем с функциями управления питанием, присутствующими в маломощных чипах Intel. Если такой сбой произойдёт, вы не увидите никаких журналов, сообщающих об этой проблеме. Добавление следующих параметров ядра может помочь решить проблему.\n\n```\nintel_idle.max_cstate=1 i915.enable_dc=0 ahci.mobile_lpm_policy=1\n```\n\nahci.mobile_lpm_policy=1 исправляет зависание на некоторых ноутбуках Lenovo и Acer из-за проблем с управлением питанием контроллера SATA. Это обходное решение не связано с графикой Intel, но оно решает связанные с этим проблемы. Добавление этого параметра ядра изменяет управление питанием соединения (link power management) со стандартного значения прошивки на максимальную производительность и также решает проблему зависания при изменении яркости дисплея на некоторых машинах Lenovo, но увеличивает потребление энергии в режиме ожидания на 1-1,5 Вт на современных ультрабуках. Для получения дополнительной информации, особенно о других состояниях, обратитесь к списку рассылки ядра Linux и документации Red Hat.\n\ni915.enable_dc=0 отключает управление питанием GPU. Это позволяет устранить случайные зависания на некоторых системах Intel, в частности на чипах Goldmount и Kaby Lake Refresh. Использование этого параметра приводит к более высокому энергопотреблению и сокращению времени работы от батареи на ноутбуках/ноутбуках.\n\nintel_idle.max_cstate=1 ограничивает состояние сна процессора, он не позволяет процессору переходить в состояние глубокого сна. Это абсолютно не идеально и приводит к увеличению энергопотребления и снижению времени работы от батареи. Однако это решает проблему случайных зависаний на многих системах Intel. Используйте это, если у вас есть чип Intel Baytrail или Kaby Lake Refresh. Известно, что чипы Intel «Baytrail» произвольно зависают без этого параметра ядра из-за аппаратного дефекта[26]. Более подробную информацию о параметре max_cstate можно найти в документации ядра, а о cstates в целом — в статье на GitHub.\n\nЕсли вы попробуете добавить одновременно intel_idle.max_cstate=1 i915.enable_dc=0 ahci.mobile_lpm_policy=1 в надежде исправить частые зависания и это решит проблему, то впоследствии вам следует удалять их по одному, чтобы посмотреть, какие из них действительно помогли решить проблему. Запуск с отключенными cstates и управлением питанием дисплея не рекомендуется, если проблема связана с управлением питанием SATA и ahci.mobile_lpm_policy=1 действительно решает её.\n\nБолее подробную информацию можно найти в Linux Reviews.\n\n"
    },
    {
      "title": "Поддержка мониторов 165Гц",
      "level": 3,
      "content": "Для некоторых 165-герцовых мониторов xrandr не отображает опцию 165Hz, и добавление нового режима не помогает. В таком случае смотрите i915-driver-stuck-at-40hz-on-165hz-screen.\n\nNote: Затем добавьте edid в параметр HOOKS в файле /etc/mkinitcpio.conf, примерно так:\n\n```\n/etc/initcpio/install/edid\n```\n\n```\n#!/bin/bash\n\nbuild() {\n    add_file /lib/firmware/edid/edid.bin\n}\n\nhelp() {\n    cat <<HELPEOF\nThis hook add support for 165Hz\nHELPEOF\n}\n```\n\nЗатем добавьте edid в параметр HOOKS в файле /etc/mkinitcpio.conf, примерно так:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=(... fsck edid)\n```\n\nЗатем пересоздайте образ initramfs\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- https://01.org/linuxgraphics/documentation[устаревшая ссылка 2023-09-16 ⓘ] (includes a list of supported hardware)\n\n"
    }
  ]
}