{
  "title": "Ipset (Español)",
  "url": "https://wiki.archlinux.org/title/Ipset_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-08-07** \n\nArtículos relacionados\n\n- Firewalls (Español)\n- Iptables (Español)\n\nipset es una aplicación complementaria para el cortafuegos de Linux iptables. Le permite configurar reglas para bloquear rápida y fácilmente un conjunto de direcciones IP, entre otras cosas.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale ipset de los repositorios oficiales.\n\n"
    },
    {
      "title": "Bloquear una lista de conexiones de red",
      "level": 3,
      "content": "Comience creando un nuevo «set« (conjunto) de direcciones de conexiones de red. Esto crea un nuevo conjunto de «hash» de direcciones de red «net» llamado «myset»:\n\n```\n# ipset create myset hash:net\n```\n\no\n\n```\n# ipset -N myset nethash\n```\n\nAñada al conjunto cualquier dirección IP que desee bloquear:\n\n```\n# ipset add myset 14.144.0.0/12\n# ipset add myset 27.8.0.0/13\n# ipset add myset 58.16.0.0/15\n# ipset add myset 1.1.1.0/24\n```\n\nFinalmente, configure iptables para bloquear cualquier dirección de ese conjunto. Esta orden añadirá una regla en la parte superior de la cadena «INPUT» para que «-m» coincida con el conjunto llamado «myset» de ipset (--match-set) cuando es un paquete «src» y «DROP», descartándolo:\n\n```\n# iptables -I INPUT -m set --match-set myset src -j DROP\n```\n\n"
    },
    {
      "title": "Bloquear una lista de direcciones IP",
      "level": 3,
      "content": "Comience creando un nuevo «conjunto» de direcciones IP. Esto crea un nuevo conjunto «hash» de direcciones «ip» llamado «myset-ip»:\n\n```\n# ipset create myset-ip hash:ip\n```\n\no\n\n```\n# ipset -N myset-ip iphash\n```\n\nAñada cualquier dirección IP que desee bloquear al conjunto:\n\n```\n# ipset add myset-ip 1.1.1.1\n# ipset add myset-ip 2.2.2.2\n```\n\nFinalmente, configure iptables para bloquear cualquier dirección de ese conjunto:\n\n```\n# iptables -I INPUT -m set --match-set myset-ip src -j DROP\n```\n\n"
    },
    {
      "title": "Hacer que ipset sea persistente",
      "level": 3,
      "content": "El ipset que ha creado se almacena en la memoria y desaparecerá después del reinicio. Para que el ipset creado sea persistente, debe hacer lo que sigue.\n\nPrimero, guarde el ipset en /etc/ipset.conf:\n\n```\n# ipset save > /etc/ipset.conf\n```\n\nLuego active ipset.service, que funciona de manera similar a iptables.service para restaurar las reglas iptables.\n\n"
    },
    {
      "title": "Bloquear con PeerGuardian y otras listas de bloqueo",
      "level": 3,
      "content": "La herramienta pg2ipset-gitAUR del autor de Maeyanie.com, junto con el script ipset-update.sh se pueden usar con cron para actualizar automáticamente varias listas de bloqueo. Actualmente, de manera predeterminada, se implementa el bloqueo de: país, nodo de salida tor y lista pg2 de Bluetack.\n\n"
    },
    {
      "title": "Otras órdenes",
      "level": 2,
      "content": "Para ver los conjuntos:\n\n```\n# ipset list\n```\n\no\n\n```\n# ipset -L\n```\n\nPara eliminar un conjunto llamado «myset»:\n\n```\n# ipset destroy myset\n```\n\no\n\n```\n# ipset -X myset\n```\n\nPara eliminar todos los conjuntos:\n\n```\n# ipset destroy\n```\n\nConsulte la página de manual de ipset para obtener más información.\n\n"
    },
    {
      "title": "Optimización",
      "level": 2,
      "content": "La herramienta iprangeAUR puede ayudar a reducir las entradas en ipset.conf fusionando rangos adyacentes o eliminando rangos superpuestos. Esto puede mejorar el rendimiento del enrutador/cortafuegos si el tamaño de la tabla es enorme. Esta herramienta también puede convertir una lista de nombres de servidores a IP.\n\nAunque ipset está diseñado para poder escalar bien, eso no significa que lo haga infinitamente. En particular, algunas paises tienen espacios de direcciones IP muy grandes, lo que hará que el bloqueo geográfico sea ineficiente.\n\n"
    }
  ]
}