{
  "title": "IRC Channels (Español)",
  "url": "https://wiki.archlinux.org/title/IRC_Channels_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-08** \n\nArtículos relacionados\n\n- ArchWiki:IRC\n- Comunidades internacionales\n- phrik\n\nPara utilizar Internet Relay Chat (IRC), necesita un cliente IRC. El medio de instalación incluye el cliente Irssi.\n\nDebe familiarizarse con nuestro código de conducta y en particular con el de IRC antes de unirse a cualquiera de los canales oficiales. Para obtener una lista de las abreviaturas comúnmente utilizadas, véase terminología de Arch.\n\n"
    },
    {
      "title": "Canales principales",
      "level": 2,
      "content": "Esta sección trata sobre #archlinux, el canal de soporte principal de Arch Linux en IRC, y #archlinux-offtopic, el canal social principal de Arch Linux, ambos disponibles en la red Libera Chat. Véase https://archlinux.org/news/move-of-official-irc-channels-to-liberachat/\n\nEl tema central de #archlinux es el soporte y la discusión general sobre Arch Linux.\n\n"
    },
    {
      "title": "Registro",
      "level": 3,
      "content": "Para reducir los mensajes no deseado (spam), #archlinux y #archlinux-offtopic tienen el modo de canal configurado en +r y +q $~a. Esto significa que debe identificarse a través de NickServ para poder unirse a estos canales y enviar mensajes, respectivamente. Si no está registrado e identificado, será reenviado a #archlinux-unregistered.\n\nPara registrarse en NickServ, siga el Libera Chat FAQ, así como también NickServ help cuando se conecte a irc.libera.chat:\n\n```\n/query NickServ HELP REGISTER\n/query NickServ HELP IDENTIFY\n```\n\nNote: **#libera** \n\n- Si sucede que /query no funciona en su cliente, puede probar con /quote NickServ <comando> o /msg NickServ <comando>.\n- Algunos clientes de IRC tienen un comportamiento por el cual intentan unirse automáticamente a los canales antes de que se haya identificado con NickServ. Debe activar SASL para resolverlo. Busque la documentación de su cliente IRC o consulte la página de libera SASL para encontrar instrucciones sobre como habilitarlo.\n- Puede obtener una lista de personas que pueden ayudarle escribiendo /msg ChanServ ACCESS #archlinux LIST, o unirse a #libera y preguntar allí.\n\n"
    },
    {
      "title": "Operadores del canal",
      "level": 3,
      "content": "Los operadores de arco son operaciones tanto en #archlinux como en #archlinux-offtopic. Véase la lista a continuación o ejecute /msg phrik listops en Libera.\n\nSi por algún motivo necesita la ayuda de un operador, no dude en /query o /msg a nosotros. Aquí está la lista de operadores a 2021-09-24:\n\n- alad\n- amcrae\n- BrainDamage\n- gehidore / man\n- grawity\n- heftig\n- jelle\n- MrElendig / Mion\n- Namarrgon\n- tigrmesh / tigr\n- wonder / ioni\n\n"
    },
    {
      "title": "Contactos de grupo Libera",
      "level": 3,
      "content": "Los contactos del grupo median asuntos entre el personal de la red Libera Chat, el personal de Arch Linux y los usuarios de Arch Linux. Eso incluye la gestión de canales en el espacio de nombres #archlinux-* en la red Libera Chat y la asignación de máscaras de host archlinux/*. Tenga en cuenta que solo el personal de Arch Linux es elegible para obtener máscaras de host.\n\n- wonder / ioni\n- fukawi2\n- anthraxx\n- dvzrv\n- Namarrgon\n\n"
    },
    {
      "title": "Depuración colaborativa",
      "level": 2,
      "content": "Al solicitar ayuda de un canal de ayuda de IRC (como #archlinux), no es apropiado pegar registros en el canal y esto puede incluso provocar que le expulsen. Utilice un pastebin en su lugar, puede utilizar phriks factoid !paste para ver qué pastebins son aceptables.\n\nLos pastebins aceptables generalmente funcionan sin activar JavaScript. Algunos requieren activar JavaScript para publicar desde un navegador web, lo que aún es aceptable porque no afecta al visualizador. No deben mostrar publicidad u otro contenido disruptivo y tampoco deben requerir un inicio de sesión. Los pastebins excelentes generalmente brindan una forma de pegar la salida a través de tuberías.\n\nUna lista de ejemplo de pastebins aceptables:\n\n- https://0x0.st: soporta el pegado de casi cualquier tipo de archivo. Puede tener la detección del tipo MIME ligeramente rota.\n- https://paste.rs: soporta el pegado de imágenes, pero el tipo MIME estará desactivado.\n- https://bpa.st: bueno para las personas que quieren algo gráfico.\n- http://ix.io - solo http. Popular, pero es útil cuando se depura un problema de SSL, lo que significa que no se pueden utilizar pastebins solo para https.\n\n"
    },
    {
      "title": "Utilización de IRC",
      "level": 3,
      "content": "Al entrar por primera vez al canal, no es necesario decir hola. Indique el problema que está experimentando y asegúrese de ser detallado y proporcionar archivos de registro. También ayuda buscar primero cualquier mensaje de error que esté recibiendo para no perder el tiempo de nadie. También vale la pena buscar problemas en cualquiera de los rastreadores de errores del software relevante. Cuanto más útil y detallado sea, más rápido recibirá ayuda.\n\nSi se trata de un problema o pregunta que es muy específico de un software específico, considere visitar el canal de IRC dedicado, si lo hay. Es más probable que reciba una buena respuesta allí.\n\n"
    },
    {
      "title": "Salida de errores/mensajes a un archivo",
      "level": 3,
      "content": "A veces no es posible canalizar la salida a un pastebin directamente y debe escribirse en un archivo antes.\n\n```\n$ aplicación &> aplicación-output.txt\n```\n\nEsto es útil si se pegan registros que contienen datos confidenciales, por ejemplo, números de serie en la salida smartctl, que deben editarse manualmente.\n\n"
    },
    {
      "title": "Otros canales",
      "level": 2,
      "content": "El tamaño de nuestra comunidad condujo a la creación de múltiples canales de IRC. Para obtener una lista de todos los canales en irc.libera.chat que contienen archlinux en su nombre, utilice el comando /query alis LIST *archlinux*.\n\nTable content:\nCanal | Asunto\n#archlinux-aur | Debate general sobre AUR\n#archlinux-aurweb | Debate sobre el desarrollo de aurweb\n#archlinux-bugs | Debate centrado en errores\n#archlinux-classroom | Un proyecto que desarrolla y aloja clases para la comunidad Arch Linux\n#archlinux-conf | Discusión y organización de ArchConf\n#archlinux-devops | Debate sobre la infraestructura interna de Arch Linux y devops\n#archlinux-multilib | Debate sobre el proyecto Arch Linux Multilib y empaquetado\n#archlinux-newbie | Un espacio para aprender, probar cosas nuevas y pedir ayuda sin temor al ridículo\n#archlinux-pacman | Debate y desarrollo de pacman\n#archlinux-proaudio | Debate sobre audio profesional en Arch.\n#archlinux-projects | Debate y desarrollo de proyectos (mkinitcpio, abs, dbscripts, devtools...)\n#archlinux-releng | Debate sobre ingeniería de versiones (arch-boxes, archiso, archlinux-docker y releng) de Arch Linux\n#archlinux-reproducible | Debate para lograr compilaciones reproducibles\n#archlinux-security | Debate de problemas de seguridad dentro de los paquetes de Arch\n#archlinux-testing | Debate sobre los repositorios de prueba\n#archlinux-wiki | Debate sobre ArchWiki, sus artículos y foros\n#archlinux-women | Discusión de proyectos para programas / eventos para alentar a las mujeres a contribuir con Arch Linux y brindar un espacio para que las mujeres socialicen y se conozcan. Mayormente en inglés.\n\n"
    },
    {
      "title": "Canales IRC internacionales",
      "level": 3,
      "content": "Los debates internacionales están disponibles en los siguientes canales, también ubicados en la red IRC irc.libera.chat, a menos que se indique lo contrario.\n\nTable content:\nCanal | Comunidad\n#archlinux-br | Brasileño\n#archlinux-cn | Chino; también en irc.oftc.net#arch-cn\n#archlinux-cz | Checo\n#archlinux.de | Alemán\n#archlinux.dk | Danés\n#archlinux-es | Español\n#archlinux-fr | Francés\n#archlinux-mx | Mexicano\n#archlinux-nordics | Los Nórdicos: danés, finlandés, noruego y sueco\n#archlinux.org.pl | Polaco\n#archlinux-pt | Portugués\n#archlinux.ro | Rumano\n#archlinux-tr | Turco\n#archlinux-ua | Ucraniano\n\n"
    }
  ]
}