{
  "title": "IRC channel (Català)",
  "url": "https://wiki.archlinux.org/title/IRC_channel_(Catal%C3%A0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles relacionats\n\n- ArchWiki:IRC\n- Comunitats internacionals\n- phrink\n\nPer a utilitzar l'Internet Relay Chat (IRC), necessitareu un Client IRC. L'entorn d'instal·lació inclou el client Irssi.\n\nS'espera que us familiaritzeu amb el codi de conducta i les pautes generals dels canals IRC abans d'unir-vos als canals oficials. Per a una llista d'abreviatures freqüentment usades, vegeu Arch terminology (Català).\n\n"
    },
    {
      "title": "Canals principals",
      "level": 2,
      "content": "Aquesta secció parla sobre #archlinux, el canal IRC de suport d'Arch Linux principal; i sobre #archlinux-offtopic, el canal social d'Arch Linux principal. Els dos canals es troben a la xarxa Libera Chat. Vegeu https://archlinux.org/news/move-of-official-irc-channels-to-liberachat/.\n\nEl tema principal a #archlinux és el suport i la discussió general sobre Arch Linux.\n\n"
    },
    {
      "title": "Registre",
      "level": 3,
      "content": "Per a reduir l'spam, #archlinux i #archlinux-offtopic tenen el mode del canal establert en +r i +q $~a. Això significa que us heu d'identificar a través de NickServ per a poder unir-vos a aquests canals i poder enviar-hi missatges, respectivament. Si no esteu registrats i identificats, se us redirigirà a #archlinux-unregistered.\n\nPer a registrar-vos amb NickServ, seguiu els FAQ de Libera Chat, o també NickServ HELP quan estigueu connectats a irc.libera.chat:\n\n```\n/query NickServ HELP REGISTER\n/query NickServ HELP IDENTIFY\n```\n\nNote: **#libera** \n\n- Si /query no funciona al vostre client, podeu provar d'utilitzar /quote NickServ ordre o /msg NickServ ordre.\n- Alguns clients IRC tenen una condició de carrera on aquests intenten unir-se automàticament als canals abans que us identifiqueu amb NickServ. Haureu d'activar SASL per a solucionar-ho. Vegeu la documentació del vostre client IRC o la pàgina de Libera Chat sobre SASL per a instruccions sobre com activar-ho.\n- Podeu obtenir una llista de gent que us pot ajudar teclejant /msg ChanServ FLAGS #archlinux, o uniu-vos a #libera i pregunteu allí.\n\n"
    },
    {
      "title": "Operadors dels canals",
      "level": 3,
      "content": "Els operadors d'Arch són operadors a #archlinux i #archlinux-offtopic. Vegeu la llista aquí sota, o executeu /msg phrik listops a Libera Chat.\n\nSi per alguna raó necessiteu l'ajuda d'un operador, no tingueu vergonya i envieu-nos un /query o un /msg. Aquí teniu una llista d'operadors actualitzada el 24 de setembre del 2021:\n\n- alad\n- BrainDamage\n- gehidore / man\n- grawity\n- heftig\n- jelle\n- MrElendig / Mion\n- Namarrgon\n- tigrmesh / tigr\n- wonder / ioni\n\n"
    },
    {
      "title": "Contactes de grup Libera Chat",
      "level": 3,
      "content": "Els contactes de grup es dediquen a la mediació de les qüestions entre el personal de la xarxa Libera Chat, el personal d'Arch Linux i els usuaris d'Arch Linux. Això inclou la gestió dels canals a l'espai de noms #archlinux-* a la xarxa Libera Chat i l'assignació de màscares d'amfitrió archlinux/*. Si us plau, tingueu en compte que només el personal d'Arch Linux pot obtenir les màscares d'amfitrió.\n\n- wonder / ioni\n- fukawi2\n- anthraxx\n- dvzrv\n- Namarrgon\n\n"
    },
    {
      "title": "Depuració col·laborativa",
      "level": 2,
      "content": "Quan demaneu ajuda a un canal IRC d'ajuda (com #archlinux), és inapropiat enganxar-hi registres, i fer-ho podria ser motiu d'expulsió. En canvi, utilitzeu un pastebin. Podeu emprar el factoide de phrik !paste per a saber quins pastebins són acceptables. Els pastebins acceptables normalment funcionen sense activar JavaScript. Alguns requereixen activar JavaScript per a publicar des d'un navegador web, però això encara es considera acceptable perquè no afecta el lector. Els pastebins no haurien de mostrar anuncis o altre contingut disruptiu, i no haurien de requerir iniciar sessió. Els millors pastebins acostumen a oferir un mètode per a enganxar la sortida d'una comanda mitjançant pipes.\n\nUna llista d'exemple de pastebins acceptables:\n\n- https://0x0.st - suporta l'enganxament de quasi qualsevol mena de fitxer. La detecció MIME podria estar lleugerament trencada.\n- https://paste.rs - suporta l'enganxament d'imatges, però el tipus MIME serà incorrecte.\n- https://bpa.st - bo per a qui necessiti quelcom gràfic.\n- http://ix.io - només funciona via http. És popular, però és útil per a depurar problemes amb SSL, on no és possible utilitzar pastebins https.\n\n"
    },
    {
      "title": "Ús d'IRC",
      "level": 3,
      "content": "Quan entreu al canal no cal que saludeu. Especifiqueu el vostre problema i assegureu-vos de ser detallats i enviar els fitxers de registre. També ajuda que busqueu primer els missatges d'error que esteu veient abans de preguntar i malbaratar el temps de la resta. També val la pena buscar el vostre problema als rastrejadors d'errors del programari rellevant. Com més ajuda i detalls doneu, més ràpid podreu rebre ajuda.\n\nSi la vostra qüestió és molt específica a un programa concret, considereu visitar si existeix el canal IRC dedicat a aquest. Allí teniu més possibilitats de rebre una bona resposta.\n\n"
    },
    {
      "title": "Redirigiu errors o missatges a un fitxer",
      "level": 3,
      "content": "A vegades no és possible enviar la sortida d'un programa a un pastebin directament a través d'una pipe i s'ha d'escriure a un fitxer abans.\n\n```\n$ aplicació &> sortida-aplicació.txt\n```\n\nAixò és útil quan enganxeu registres que contenen informació delicada (com nombres de sèrie a la sortida de smartctl) que s'ha d'eliminar manualment.\n\n"
    },
    {
      "title": "Altres canals",
      "level": 2,
      "content": "La mida de la nostra comunitat ens ha portat a la creació de múltiples canals IRC. Per a obtenir una llista de tots els canals a irc.libera.chat que contenen archlinux al seu nom, useu l'ordre /query alis LIST *archlinux*.\n\nTable content:\nCanal | Tema\n#archlinux-aur | Discussió general sobre l'AUR\n#archlinux-aurweb | Discussió sobre el desenvolupament d'aurweb\n#archlinux-bugs | Discussió centrada en els errors de programari\n#archlinux-classroom | Un projecte que desenvolupa i organitza classes per a la comunitat d'Arch Linux\n#archlinux-conf | Organització i discussió d'ArchConf\n#archlinux-devops | Discussió sobre la infraestructura interna i devops d'Arch Linux\n#archlinux-multilib | Discussió i empaquetament de l'Arch Linux Multilib Project\n#archlinux-newbie | Un espai per a aprendre, provar coses noves, i demanar ajuda sense por a fer el ridícul\n#archlinux-pacman | Desenvolupament i discussió de Pacman\n#archlinux-proaudio | Discussió sobre Arch Linux Pro Audio\n#archlinux-projects | Desenvolupament i discussió de projectes (mkinitcpio, abs, dbscripts, devtools…)\n#archlinux-releng | Discussió sobre Arch Linux Release Engineering (arch-boxes, archiso, archlinux-docker i releng)\n#archlinux-reproducible | Canal de discussió per aconseguir compilacions reproduïbles\n#archlinux-security | Discussió de problemes de seguretat als paquets d'Arch\n#archlinux-testing | Canal de discussió dedicat als repositoris de prova\n#archlinux-wiki | Discussió sobre l'ArchWiki, els seus articles i els Fòrums d'Arch Linux\n#archlinux-women | Discussió de projectes de programes o esdeveniments per a animar a les dones a contribuir a Arch Linux i oferir un espai perquè les dones puguin socialitzar i conèixer-se entre si. Principalment en anglès.\n\n"
    },
    {
      "title": "Canals IRC internacionals",
      "level": 3,
      "content": "Es permeten les discussions internacionals als següents canals, també a la xarxa IRC irc.libera.chat, a no ser que s'indiqui el contrari.\n\nTable content:\nCanal | Comunitat\n#archlinux-br | Brasilera\n#archlinux-cn | Xinesa; també a irc.oftc.net#arch-cn\n#archlinux-cz | Txeca\n#archlinux-de | Alemanya\n#archlinux-dk | Danesa\n#archlinux-es | Espanyola\n#archlinux-fr | Francesa\n#archlinux-mx | Mexicana\n#archlinux-nordics | Els Nòrdics: Danesos, Finlandesos, Noruecs i Suecs\n#archlinux-pl | Polonesa\n#archlinux-pt | Portuguesa\n#archlinux-ro | Romanesa\n#archlinux-tr | Turca\n#archlinux-ua | Ucraïnesa\n\n"
    }
  ]
}