{
  "title": "IRC Channels (Português)",
  "url": "https://wiki.archlinux.org/title/IRC_Channels_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- ArchWiki:IRC (Português)\n- Comunidades internacionais\n- phrik\n\nPara usar Internet Relay Chat (IRC), você precisa de um cliente IRC. O ambiente de instalação live inclui o cliente Irssi.\n\nEspera-se que você esteja familiarizado com nosso código de conduta e o Diretrizes gerais#IRC antes de entrar em qualquer um dos canais oficiais. Para uma lista da s abreviações comumente usadas, veja Terminologia do Arch.\n\n"
    },
    {
      "title": "Canais principais",
      "level": 2,
      "content": "Essa seção é sobre o #archlinux, o principal canal IRC de suporte ao Arch Linux, e o #archlinux-offtopic, o canal social principal do Arch Linux, ambos disponíveis na rede Libera Chat. Veja Migração dos canais IRC oficiais para libera.chat.\n\nO tópico central de #archlinux é suporte e discussão geral sobre o Arch Linux.\n\n"
    },
    {
      "title": "Registro",
      "level": 3,
      "content": "Para reduzir o spam, #archlinux e #archlinux-offtopic agora têm o modo de canal definido para +r e +q $~a. Isso significa que agora você precisa estar identificado via NickServ para ser capaz de ingressar nesses canais e enviar mensagens, respectivamente. Se você não estiver registrado e identificado, você será encaminhado para #archlinux-unregistered.\n\nPara registrar com NickServ, siga o FAQ do Libera Chat, bem como NickServ HELP quando conectado ao irc.libera.chat:\n\n```\n/query NickServ HELP REGISTER\n/query NickServ HELP IDENTIFY\n```\n\nNote: **#libera** \n\n- Se /query acabar por não funcionar em seu cliente, você pode tentar usar /quote NickServ comando ou /msg NickServ comando.\n- Alguns clientes IRC têm uma condição de corrida na qual eles tentam ingressar automaticamente em canais antes de você ser identificado com NickServ. Você precisa habilitar SASL para resolver isso. Olhe a documentação do seu cliente IRC ou olhe a página SASL do Libera Chat para encontrar instruções sobre como habilitá-lo.\n- Você pode obter uma lsita de pessoas que podem lhe ajudar digitando /msg ChanServ FLAGS #archlinux ou ingressando no #libera e perguntando lá.\n\n"
    },
    {
      "title": "Operadores do canal",
      "level": 3,
      "content": "Operadores do Arch são ops em ambos #archlinux e #archlinux-offtopic. Veja abaixo a lista ou execute /msg phrik listops no Libera Chat.\n\nSe você, por algum motivo, precisar de ajuda de um operador, não seja tímido para nos /query ou /msg. Aqui está a lista de operadores até 2021-09-24:\n\n- alad\n- BrainDamage\n- gehidore / man\n- grawity\n- jelle\n- MrElendig / Mion\n- Namarrgon\n\n"
    },
    {
      "title": "Contatos de grupos do Libera Chat",
      "level": 3,
      "content": "Os contatos de grupos mediam assuntos entre a equipe da rede Libera Chat, a equipe do Arch Linux e os usuários do Arch Linux. Isso inclui o gerenciamento de canais no espaço de nomes #archlinux-* na rede Libera Chat e a atribuição de máscaras de host archlinux/*. Observe que apenas a equipe do Arch Linux é elegível para máscaras de host.\n\n- wonder / ioni\n- fukawi2\n- anthraxx\n- dvzrv\n- Namarrgon\n\n"
    },
    {
      "title": "Depuração colaborativa",
      "level": 2,
      "content": "Ao solicitar ajuda de um canal de ajuda do IRC (como #archlinux), é inapropriado colar logs no canal e isso pode até fazer com que você seja expulso. Use um pastebin em vez disso, você pode usar phriks factoid !paste para ver quais pastebins são aceitáveis. Pastebins aceitáveis geralmente funcionam sem habilitar o JavaScript. Alguns exigem a ativação do JavaScript para postagem de um navegador da Web, o que ainda é aceitável porque não afeta o visualizador. Eles não devem exibir publicidade ou outro conteúdo perturbador e também não devem exigir um login. Pastebins excelentes geralmente fornecem uma maneira de colar a saída por meio de tubulação.\n\nUma lista de exemplo de pastebins aceitáveis:\n\n- https://0x0.st - oferece suporte à colagem de quase qualquer tipo de arquivo. Pode ter a detecção do tipo MIME ligeiramente quebrada.\n- https://paste.rs - oferece suporte à colagem de imagens, mas o tipo MIME estará desativado.\n- https://bpa.st - bom para pessoas que querem algo gráfico.\n- https://gist.github.com - útil se você também quiser renderizar markdown ou vários arquivos, suporta colagem CLI via github-cli.\n\n"
    },
    {
      "title": "Uso do IRC",
      "level": 3,
      "content": "Ao entrar no canal pela primeira vez, não há necessidade de dizer olá. Indique o problema que você está enfrentando e certifique-se de ser detalhado e fornecer arquivos de log. Também ajuda procurar quaisquer mensagens de erro que você está recebendo primeiro para não desperdiçar o tempo de ninguém. Também vale a pena procurar problemas em qualquer um dos rastreadores de bugs do software relevante. Quanto mais útil e verboso você for, mais rápido você receberá ajuda.\n\nSe este for um problema ou pergunta muito específico para um software específico, considere visitar o canal IRC dedicado a ele, se houver. É mais provável que receba uma boa resposta lá.\n\n"
    },
    {
      "title": "Armazene erros/mensagens em um arquivo",
      "level": 3,
      "content": "Às vezes não é possível canalizar a saída para um pastebin diretamente e deve ser escrito em um arquivo antes.\n\n```\n$ aplicativo &> aplicativo-output.txt\n```\n\nIsso é útil ao colar logs que contêm dados confidenciais, por exemplo, números de série na saída de smartctl, que precisam ser editados manualmente.\n\n"
    },
    {
      "title": "Outros canais",
      "level": 2,
      "content": "O tamanho de nossa comunidade levou à criação de múltiplos canais IRC. Para obter uma lista de todos os canais em irc.libera.chat que contêm archlinux em seu nome, use o comando /query alis LIST *archlinux*. Para mais informações sobre como pesquisar canais, consulte https://libera.chat/guides/findingchannels.\n\nTable content:\nCanal | Tópico\n#archlinux-aur | Discussão geral do AUR\n#archlinux-aurweb | Discussão sobre o desenvolvimento do aurweb\n#archlinux-bugs | Discussão centrada em bugs\n#archlinux-buildbtw | buildbtw discussão sobre desenvolvimento\n#archlinux-classroom | Um projeto que desenvolve e hospeda classes para a comunidade do Arch Linux\n#archlinux-conf | Organização e discussão da ArchConf\n#archlinux-devops | Discussões sobre infraestrutura interna e devops do Arch Linux\n#archlinux-multilib | Discussão e empacotamento do Projeto Multilib do Arch Linux\n#archlinux-newbie | Um espaço para aprender, tentar novas coisas e pedir ajuda sem medo do ridículo\n#archlinux-pacman | Desenvolvimento e discussão sobre o Pacman\n#archlinux-proaudio | Discussão sobre Arch Linux Pro Audio\n#archlinux-projects | Desenvolvimento e discussão sobre projetos (mkinitcpio, abs, dbscripts, devtools…)\n#archlinux-releng | Discussão da Engenharia de Lançamentos do Arch Linux (arch-boxes, archiso, archlinux-docker e releng)\n#archlinux-reproducible | Canal de discussão para atingir compilações reproduzíveis\n#archlinux-security | Discussão sobre questões de segurança em pacotes do Arch\n#archlinux-signstar | signstar discussão sobre desenvolvimento\n#archlinux-testing | Canal de discussão a cerca dos repositórios de teste\n#archlinux-wiki | Discussão sobre ArchWiki, seus artigos e os Fóruns do Arch Linux\n#archlinux-women | Discussão de projetos para programas/eventos para encorajar mulheres a contribuir para o Arch Linux e fornecer um espaço para mulheres socializarem e se conheçam. Principalmente em inglês.\n\n"
    },
    {
      "title": "Canais IRC internacionais",
      "level": 3,
      "content": "Discussões internacionais estão disponíveis nos seguintes canais, também localizados na rede IRC irc.libera.chat , a menos que seja afirmado o contrário.\n\nTable content:\nCanal | Comunidade\n#archlinux-br | Brasileiro\n#archlinux-ca | Catalan\n#archlinux-cn | Chinês, também em irc.oftc.net#arch-cn\n#archlinux-cz | Tcheco\n#archlinux-de | Alemão\n#archlinux-dk | Dinamarquês\n#archlinux-es | Espanhol\n#archlinux-fr | Francês\n#archlinux-mx | Mexicano\n#archlinux-nordics | Os nórdicos: Dinamarquês, Finlandês, Norueguês e Sueco)\n#archlinux-pl | Polonês\n#archlinux-pt | Português\n#archlinux-ro | Romano\n#archlinux-tr | Turco\n#archlinux-ua | Ucraniano\n\n"
    }
  ]
}