{
  "title": "Iwd (Português)",
  "url": "https://wiki.archlinux.org/title/Iwd_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Configuração de rede\n- Configuração de rede sem fio\n- wpa_supplicant\n\nO iwd (iNet wireless daemon) é um daemon sem fio para Linux escrito pela Intel. O objetivo principal do projeto é otimizar a utilização de recursos, não dependendo de nenhuma biblioteca externa e, em vez disso, utilizando os recursos fornecidos pelo Kernel Linux na máxima extensão possível.\n\nO iwd pode funcionar no modo autônomo ou em combinação com gerentes de rede abrangentes, como ConnMan, systemd-networkd e NetworkManager.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote iwd.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "O pacote iwd fornece o programa cliente iwctl, o daemon iwd e a ferramenta de monitoramento Wi-Fi iwmon.\n\niwgtkAUR fornece um front-end GUI para o iwd e um ícone (de bandeja) indicador.\n\nInicie/habilite iwd.service para que possa ser controlado por meio do comando iwctl ou do iwgtk.\n\n"
    },
    {
      "title": "iwctl",
      "level": 3,
      "content": "Para obter um prompt interativo, faça:\n\n```\n$ iwctl\n```\n\nO prompt interativo é exibido com um prefixo de [iwd]#.\n\n- No prompt iwctl você pode concluir automaticamente os comandos e nomes de dispositivos pressionando Tab.\n- Para sair do prompt interativo, envie EOF pressionando Ctrl+d.\n- Você pode usar todos os comandos como argumentos de linha de comando sem inserir um prompt interativo. Por exemplo: iwctl device wlan0 show.\n\nPara listar todos os comandos disponíveis:\n\n```\n[iwd]# help\n```\n\n"
    },
    {
      "title": "Conectar a uma rede",
      "level": 4,
      "content": "Primeiro, se você não souber o nome do seu dispositivo sem fio, liste todos os dispositivos Wi-Fi:\n\n```\n[iwd]# device list\n```\n\nEm seguida, para iniciar a procura por redes (observe que esse comando vai emitir nenhuma saída):\n\n```\n[iwd]# station dispositivo scan\n```\n\nVocê pode listar todas as redes disponíveis:\n\n```\n[iwd]# station dispositivo get-networks\n```\n\nPor fim, para conectar-se a uma rede:\n\n```\n[iwd]# station dispositivo connect SSID\n```\n\nSe uma senha for necessária, você será solicitado a digitá-la. Como alternativa, você pode fornece-la como argumento da linha de comando:\n\n```\n$ iwctl --passphrase senha station dispositivo connect SSID\n```\n\n- O iwd armazena automaticamente as senhas da rede no diretório /var/lib/iwd e os usa para se conectar automaticamente no futuro. Veja #Configuração de rede.\n- Para conectar-se a uma rede com espaços no SSID, o nome da rede deve estar entre aspas duplas.\n- O iwd suporta apenas senhas PSK de 8 a 63 caracteres codificados em ASCII. A seguinte mensagem de erro será fornecida se os requisitos não forem atendidos: PMK generation failed. Ensure Crypto Engine is properly configured.\n\n"
    },
    {
      "title": "Conecte-se a uma rede usando WPS/WSC",
      "level": 4,
      "content": "Se sua rede estiver configurada de forma que você possa conectar-se a ela pressionando um botão (Wikipedia:Wi-Fi Protected Setup), verifique primeiro se o seu dispositivo de rede também é capaz de usar este procedimento de configuração.\n\n```\n[iwd]# wsc list\n```\n\nEntão, desde que seu dispositivo apareça na lista acima,\n\n```\n[iwd]# wsc dispositivo push-button\n```\n\ne pressione o botão no seu roteador. O procedimento também funciona se o botão foi pressionado antes, menos de 2 minutos antes.\n\nSe sua rede precisar validar um número PIN para conectar-se dessa maneira, verifique o comando help saída para ver como fornecer as opções corretas para o comando wsc.\n\n"
    },
    {
      "title": "Desconectar de uma rede",
      "level": 4,
      "content": "Para desconectar-se de uma rede:\n\n```\n[iwd]# station dispositivo disconnect\n```\n\n"
    },
    {
      "title": "Mostrar informações do dispositivo e da conexão",
      "level": 4,
      "content": "Para exibir os detalhes de um dispositivo Wi-Fi, como endereço MAC:\n\n```\n[iwd]# device dispositivo show\n```\n\nPara exibir o estado da conexão, incluindo a rede conectada de um dispositivo Wi-Fi:\n\n```\n[iwd]# station dispositivo show\n```\n\n"
    },
    {
      "title": "Gerenciar redes conhecidas",
      "level": 4,
      "content": "Para listar as redes às quais você se conectou anteriormente:\n\n```\n[iwd]# known-networks list\n```\n\nPara esquecer uma rede conhecida:\n\n```\n[iwd]# known-networks SSID forget\n```\n\n"
    },
    {
      "title": "iwgtk",
      "level": 3,
      "content": "Alternativamente, iwgtkAUR fornece um front-end GUI por meio do qual o iwd pode ser controlado.\n\nA execução de iwgtk sem nenhum argumento inicia a janela do aplicativo, que pode ser usada para ativar/desativar seus adaptadores e dispositivos, alterar seus modos de operação, visualizar redes disponíveis, conectar-se a redes disponíveis e gerenciar redes conhecidas.\n\n"
    },
    {
      "title": "Ícone indicador",
      "level": 4,
      "content": "Para iniciar o daemon de ícone indicador (na bandeja do sistema) do iwgtk, execute:\n\n```\n$ iwgtk -i\n```\n\nSe o ícone indicador não aparecer, sua bandeja do sistema provavelmente não tem suporte para a API StatusNotifierItem, caso em que você precisa executar uma camada de compatibilidade como snixembed-gitAUR.\n\nAs seguintes bandejas do sistema têm suporte a StatusNotifierItem e, portanto, funcionam por padrão:\n\n- KDE Plasma\n- swaybar\n- xfce4-panel\n\nAs bandejas a seguir têm suporte apenas a XEmbed e, portanto, exigem snixembed-gitAUR:\n\n- AwesomeWM\n- i3bar\n\n"
    },
    {
      "title": "Inicialização automática",
      "level": 4,
      "content": "O caso de uso mais comum para o iwgtk é iniciar o daemon do indicador toda vez que você efetuar login em sua área de trabalho. Se o seu ambiente de desktop for compatível com o padrão XDG Autostart, isso deve acontecer automaticamente devido ao arquivo iwgtk-indicator.desktop que é colocado em /etc/xdg/autostart/ pelo pacote AUR.\n\nAlternativamente, um arquivo unit do systemd para iniciar o daemon do indicador é fornecido pelo pacote do AUR. Se o seu ambiente de desktop tiver suporte à unit graphical-session.target do systemd, então o iwgtk pode ser iniciado automaticamente via systemd habilitando a unit de usuário iwgtk.service.\n\n"
    },
    {
      "title": "Configuração de rede",
      "level": 2,
      "content": "Por padrão, iwd guarda a configuração de rede no diretório /var/lib/iwd. O arquivo de configuração é nomeado como rede.tipo onde rede é o SSID da rede e tipo é o tipo da rede, dentre .open, .psk ou .8021x. O arquivo é usado para guardar o PreSharedKey criptografado e opcionalmente a Passphrase e também pode ser criada pelo usuário sem invocar o iwctl. O arquivo também pode ser usado para outras configurações referentes àquele SSID. Para mais configurações, veja iwd.network(5).\n\n"
    },
    {
      "title": "WPA-PSK",
      "level": 3,
      "content": "Um exemplo pequeno de arquivo para se conectar a uma rede protegida por WPA-PSK ou WPA2-PSK com o SSID \"spaceship\" e senha \"test1234\":\n\n```\n/var/lib/iwd/spaceship.psk\n```\n\n```\n[Security]\nPreSharedKey=aafb192ce2da24d8c7805c956136f45dd612103f086034c402ed266355297295\n```\n\nPara calcular a chave pré-compartilhada da senha, um destes dois métodos pode ser usado:\n\n- Inserir a senha em texto simples no arquivo de configuração:\n\n```\n/var/lib/iwd/spaceship.psk\n```\n\n```\n[Security]\nPassphrase=test1234\n```\n\n```\n/var/lib/iwd/spaceship.psk\n```\n\n```\n[Security]\nPassphrase=test1234\nPreSharedKey=aafb192ce2da24d8c7805c956136f45dd612103f086034c402ed266355297295\n```\n\n- Ou a chave pré-compartilhada pode ser calculada do SSID e a senha usando wpa_passphrase (do wpa_supplicant) ou wpa-pskAUR. Veja wpa_supplicant#Connecting with wpa_passphrase para mais detalhes.\n\n"
    },
    {
      "title": "EAP-PWD",
      "level": 4,
      "content": "Para conectar-se a um ponto de acesso corporativo protegido por EAP-PWD, é necessário criar um arquivo chamado: essid.8021x no diretório /var/lib/iwd com o seguinte conteúdo:\n\n```\n/var/lib/iwd/essid.8021x\n```\n\n```\n[Security]\nEAP-Method=PWD\nEAP-Identity=seu_e-mail_empresarial\nEAP-Password=sua_senha\n\n[Settings]\nAutoConnect=True\n```\n\nSe você não deseja se conectar automaticamente ao ponto de acesso, defina a opção como False e conecte manualmente ao ponto de acesso via iwctl. O mesmo se aplica à senha, se você não quiser armazená-la em texto sem formatação, deixe a opção fora do arquivo e apenas conecte-se ao AP da empresa.\n\n"
    },
    {
      "title": "EAP-PEAP",
      "level": 4,
      "content": "Como o EAP-PWD, você também precisa criar um arquivo essid.8021x no diretório. Antes de prosseguir com a gravação do arquivo de configuração, este também é um bom momento para descobrir qual certificado CA sua organização usa. Este é um arquivo de configuração de exemplo que usa autenticação de senha MSCHAPv2:\n\n```\n/var/lib/iwd/essid.8021x\n```\n\n```\n[Security]\nEAP-Method=PEAP\nEAP-Identity=anonymous@realm.edu\nEAP-PEAP-CACert=/path/to/root.crt\nEAP-PEAP-ServerDomainMask=radius.realm.edu\nEAP-PEAP-Phase2-Method=MSCHAPV2\nEAP-PEAP-Phase2-Identity=johndoe@realm.edu\nEAP-PEAP-Phase2-Password=hunter2\n\n[Settings]\nAutoConnect=true\n```\n\nAs senhas MsCHAPv2 também podem ser armazenadas como um hash criptografado. O hash md4 correto pode ser calculado com:\n\n```\n$ iconv -t utf16le | openssl md4\n```\n\nInsira um fim de arquivo (EOF) após sua senha pressionando Ctrl+d, não pressione Enter. O hash resultante precisa ser armazenado dentro da chave EAP-PEAP-Phase2-Password-Hash.\n\n"
    },
    {
      "title": "TTLS-PAP",
      "level": 4,
      "content": "Como o EAP-PWD, você também precisa criar um arquivo essid.8021x no diretório. Antes de prosseguir com a gravação do arquivo de configuração, este também é um bom momento para descobrir qual certificado CA sua organização usa. Este é um exemplo de arquivo de configuração que usa autenticação de senha PAP:\n\n```\n/var/lib/iwd/essid.8021x\n```\n\n```\n[Security]\nEAP-Method=TTLS\nEAP-Identity=anonymous@uni-test.de\nEAP-TTLS-CACert=cert.pem\nEAP-TTLS-ServerDomainMask=*.uni-test.de\nEAP-TTLS-Phase2-Method=Tunneled-PAP\nEAP-TTLS-Phase2-Identity=user\nEAP-TTLS-Phase2-Password=password\n\n[Settings]\nAutoConnect=true\n```\n\n"
    },
    {
      "title": "eduroam",
      "level": 4,
      "content": "eduroam oferece uma configuration assistant tool (CAT), que infelizmente não suporta iwd. No entanto, o instalador, que você pode baixar clicando no botão de download e selecionando sua universidade, é apenas um script Python. É fácil extrair as opções de configuração necessárias, incluindo o certificado e a máscara de domínio do servidor.\n\nA tabela a seguir contém um mapeamento das opções de configuração do iwd para variáveis de script de instalação do CAT eduroam.\n\nTable content:\nOpção de configuração de Iwd | Variável de Script CAT\nnome do arquivo | um de Config.ssids\nEAP-Method | Config.eap_outer\nEAP-Identity | Config.anonymous_identity\nEAP-PEAP-CACert | Config.CA\nEAP-PEAP-ServerDomainMask | um de Config.servers\nEAP-PEAP-Phase2-Method | Config.eap_inner\nEAP-PEAP-Phase2-Identity | username@Config.user_realm\n\n- EAP-Identity pode não ser necessário pelo seu provedor eduroam; nesse caso, você pode ter que usar anonymous@config.realm_do_usuário nesta área.\n- Se sua EAP-PEAP-ServerDomainMask começa com DNS:, somente use a parte depois do DNS:.\n\n"
    },
    {
      "title": "Outros casos",
      "level": 3,
      "content": "Mais exemplos de testes podem ser encontrados nos casos de teste do repositório upstream.\n\n"
    },
    {
      "title": "Configuração opcional",
      "level": 2,
      "content": "O arquivo /etc/iwd/main.conf pode ser usado para a configuração principal. Veja iwd.config(5).\n\n"
    },
    {
      "title": "Desativar a conexão automática para uma rede específica",
      "level": 3,
      "content": "Criar/editar o arquivo /var/lib/iwd/rede.tipo. Adicione a seguinte seção a ele:\n\n```\n/var/lib/iwd/spaceship.psk (por exemplo)\n```\n\n```\n[Settings]\nAutoConnect=false\n```\n\n"
    },
    {
      "title": "Desativar verificação periódica para redes disponíveis",
      "level": 3,
      "content": "Por padrão, quando iwd estiver desconectado, ele verifica periodicamente as redes disponíveis. Para desativar a verificação periódica (para sempre verificar manualmente), criar/editar o arquivo /etc/iwd/main.conf e adicione a seguinte seção a ele:\n\n```\n/etc/iwd/main.conf\n```\n\n```\n[Scan]\nDisablePeriodicScan=true\n```\n\n"
    },
    {
      "title": "Ativar configuração de rede embutida",
      "level": 3,
      "content": "Desde a versão 0.19, o iwd pode atribuir endereços IP e configurar rotas usando um cliente DHCP embutido ou com configuração estática. É uma boa alternativa para clientes DHCP independentes.\n\nPara ativar o recurso de configuração de rede do iwd, crie/edite o arquivo /etc/iwd/main.conf e adicione a seguinte seção a ele:\n\n```\n/etc/iwd/main.conf\n```\n\n```\n[General]\nEnableNetworkConfiguration=true\n```\n\nTambém é possível definir métricas de rota com RoutePriorityOffset:\n\n```\n/etc/iwd/main.conf\n```\n\n```\n[Network]\nRoutePriorityOffset=300\n```\n\n"
    },
    {
      "title": "IPv6 support",
      "level": 4,
      "content": "Desde a versão 1.10, iwd suporta IPv6, mas isso é desabilitado por padrão. Para habilitar, adicione a seguinte linha no arquivo de configuração:\n\n```\n/etc/iwd/main.conf\n```\n\n```\n[Network]\nEnableIPv6=true\n```\n\nEsta configuração é necessária caso queira usar o DHCPv6 ou IPv6 estático. Pode também ser configurado para redes em específico.\n\n"
    },
    {
      "title": "Definindo o endereço IP estático na configuração de rede",
      "level": 4,
      "content": "Adicione a seguinte seção ao arquivo /var/lib/iwd/rede.tipo. Por exemplo:\n\n```\n/var/lib/iwd/spaceship.psk\n```\n\n```\n[IPv4]\nAddress=192.168.1.10\nNetmask=255.255.255.0\nGateway=192.168.1.1\nBroadcast=192.168.1.255\nDNS=192.168.1.1\n```\n\n"
    },
    {
      "title": "Selecione o gerenciador de DNS",
      "level": 4,
      "content": "No momento, o iwd suporta dois gerenciadores de DNS -systemd-resolved e resolvconf.\n\nAdicione a seguinte seção ao /etc/iwd/main.conf para systemd-resolved:\n\n```\n/etc/iwd/main.conf\n```\n\n```\n[Network]\nNameResolvingService=systemd\n```\n\nPara resolvconf:\n\n```\n/etc/iwd/main.conf\n```\n\n```\n[Network]\nNameResolvingService=resolvconf\n```\n\n"
    },
    {
      "title": "Permitir que qualquer usuário leia informações de status",
      "level": 3,
      "content": "Se você quiser permitir que qualquer usuário leia as informações de status, mas sem poder modificar, você pode criar o seguinte arquivo de configuração do D-Bus:\n\n```\n/etc/dbus-1/system.d/iwd-allow-read.conf\n```\n\n```\n<!-- Allow any user to read iwd status information. Overrides some part\n     of /usr/share/dbus-1/system.d/iwd-dbus.conf. -->\n\n<!DOCTYPE busconfig PUBLIC \"-//freedesktop//DTD D-BUS Bus Configuration 1.0//EN\"\n \"http://www.freedesktop.org/standards/dbus/1.0/busconfig.dtd\">\n<busconfig>\n\n  <policy context=\"default\">\n    <deny send_destination=\"net.connman.iwd\"/>\n    <allow send_destination=\"net.connman.iwd\" send_interface=\"org.freedesktop.DBus.Properties\" send_member=\"GetAll\" />\n    <allow send_destination=\"net.connman.iwd\" send_interface=\"org.freedesktop.DBus.Properties\" send_member=\"Get\" />\n    <allow send_destination=\"net.connman.iwd\" send_interface=\"org.freedesktop.DBus.ObjectManager\" send_member=\"GetManagedObjects\" />\n    <allow send_destination=\"net.connman.iwd\" send_interface=\"net.connman.iwd.Device\" send_member=\"RegisterSignalLevelAgent\" />\n    <allow send_destination=\"net.connman.iwd\" send_interface=\"net.connman.iwd.Device\" send_member=\"UnregisterSignalLevelAgent\" />\n  </policy>\n\n</busconfig>\n```\n\n"
    },
    {
      "title": "Depuração detalhada do TLS",
      "level": 3,
      "content": "Isso pode ser útil se você tiver problemas para configurar o MSCHAPv2 ou TTLS. Você pode definir o seguinte variável de ambiente via trecho drop-in:\n\n```\n/etc/systemd/system/iwd.service.d/tls-debug.conf\n```\n\n```\n[Service]\nEnvironment=IWD_TLS_DEBUG=TRUE\n```\n\nVerifique os logs do iwd posteriormente executando journalctl -u iwd.service como root.\n\n"
    },
    {
      "title": "Reiniciando iwd.service após a inicialização do sistema",
      "level": 3,
      "content": "Em algumas máquinas, é relatado que o iwd.service precisa ser reiniciado para funcionar após a inicialização. Veja FS#63912 e o tópico 251432. Isso provavelmente ocorre porque o kernel e os serviços do Linux iniciam muito cedo e o iwd é iniciado antes que a placa de rede sem fio seja ligada. Como solução alternativa, estenda a unit para adicionar um atraso:\n\n```\n[Service]\nExecStartPre=/usr/bin/sleep 2\n```\n\nEntão recarregue a configuração do gerenciador do systemd.\n\n"
    },
    {
      "title": "Problemas de conexão após a reinicialização",
      "level": 3,
      "content": "Um pool de baixa entropia pode causar problemas de conexão, particularmente perceptíveis após a reinicialização. Veja Random number generation para sugestões para incrementar o pool de entropia.\n\n"
    },
    {
      "title": "O dispositivo sem fio não é renomeado pelo udev",
      "level": 3,
      "content": "Desde a versão 1.0, iwd desabilita a renomeação do dispositivo sem fio. Ele instala o seguinte arquivo de configuração de rede do systemd que previne udev de renomear a interface para wlp#s#:\n\n```\n/usr/lib/systemd/network/80-iwd.link\n```\n\n```\n[Match]\nType=wlan\n\n[Link]\nNamePolicy=keep kernel\n```\n\nComo resultado, o nome do link sem fio wlan# é mantido após a inicialização. Isto resolve uma condição de corrida entre iwd e udev na renomeação da interface como explicado em iwd udev interface renaming[link inativo 2024-10-12 ⓘ].\n\nSe isso resultar em problemas, tente mascará-lo com:\n\n```\n# ln -s /dev/null /etc/systemd/network/80-iwd.link\n```\n\n"
    },
    {
      "title": "Sem DHCP no modo AP",
      "level": 3,
      "content": "Os clientes podem não receber um endereço IP via DHCP ao conectar-se a iwd no modo de ponto de acesso (AP). Portanto, é necessário habilitar a configuração de rede por iwd nas interfaces gerenciadas:\n\n```\n/etc/iwd/main.conf\n```\n\n```\n[General]\nEnableNetworkConfiguration=True\n```\n\nO arquivo mencionado deve ser criado se ainda não existir.\n\n"
    },
    {
      "title": "Wifi fica desconectando por causa de travamentos no iwd",
      "level": 3,
      "content": "Alguns usuários experimentam desconexões com WiFi, reconectando-se continuamente, mas se estabilizando eventualmente e conseguindo se conectar.\n\nOs usuários relatam falhas ([1]) de iwd.service em seu journal.\n\nO principal problema é ter vários serviços conflitantes para gerenciar suas conexões de rede. Para corrigir esse problema, verifique eles foram habilitados ao mesmo tempo por você.\n\n"
    },
    {
      "title": "Erro ao carregar a chave privada do cliente",
      "level": 3,
      "content": "Para carregar arquivos de chave, o iwd requer o módulo de kernel pkcs8_key_parser. Durante a inicialização, ele é carregado por systemd-modules-load.service(8) usando /usr/lib/modules-load.d/pkcs8.conf, e esse não será o caso se o iwd acabou de ser instalado.\n\nSe mensagens como Error loading client private key /caminho/da/chave aparecerem no journal ao tentar se conectar a redes WPA Empresariais, carregue manualmente o módulo:\n\n```\n# modprobe pkcs8_key_parser\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Getting Started with iwd[link inativo 2024-10-12 ⓘ]\n- Network Configuration Settings[link inativo 2024-10-12 ⓘ]\n- Mais exemplos para WPA empresarial\n- O tópico do IWD nos fóruns do Arch Linux\n- 2017 Update on new WiFi daemon for Linux by Marcel Holtmann - YouTube\n- The New Wi-Fi Experience for Linux - Marcel Holtmann, Intel - YouTube\n- How to set up a simple access point with iwd[link inativo 2024-10-12 ⓘ]\n\n"
    }
  ]
}