{
  "title": "Jak se zúčastnit",
  "url": "https://wiki.archlinux.org/title/Jak_se_z%C3%BA%C4%8Dastnit",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nSouvisející články\n\n- Často kladené otázky\n- ArchWiki:Contributing\n\nV evoluční biologii kooperace popisuje interakce, kde individuál za malou cenu značně přispěje zbytku. Pokud tyto příspěvky jsou opakovány ostatními, přispěje to všem značně. Tato zásada se též týká aktivních členů Arch komunity, kteří chtějí přispívat své oblíbené distribuci. Jejich účast nepřispívá pouze Arch komunitě, nýbrž všem uživatelům svobodného softwaru.\n\nTento článek popisuje, jak noví i zkušení Arch uživatelé mohou přispět komunitě. Poznamenejte však, že toto není úplný seznam. Ještě předtím, než začnete přispívat, přečtěte si pravidla chování.\n\n"
    },
    {
      "title": "Buďte aktivní na fóru",
      "level": 3,
      "content": "Jeden z nejjednodušších způsobů, jak se zúčastnit, je být aktivní na Arch Linux fóru; tak se seznámíte s komunitou a pomůžete novým uživatelům.\n\n"
    },
    {
      "title": "Zlepšete wiki",
      "level": 3,
      "content": "ArchWiki je skupinově udržovaná Arch Linux dokumentace. Pobízíme všechny uživatele, aby přispěli.\n\n"
    },
    {
      "title": "Připojte se do chatu",
      "level": 3,
      "content": "Můžete pomoci ostatním uživatelům na našem IRC kanálu. Nicméně je nezbytně nutné, abyste si přečetli pravidla kanálů, než se zúčastníte. Jiné kanály jsou dostupné pro určitá témata.\n\n"
    },
    {
      "title": "Účastněte se mailové konference",
      "level": 3,
      "content": "Připojte se k diskuzi na mailových konferencích. Snažte se nevyhýbat tématu dané konference.\n\n"
    },
    {
      "title": "Kresby",
      "level": 3,
      "content": "Sdílejte své tapety, splash screeny, barevné palety, widgety, vzhledy, atd. s komunitou na uměleckém podfóru.\n\nVizte také Arch Linux Kresby a Kresby.\n\n"
    },
    {
      "title": "Ohlaste nainstalované balíčky",
      "level": 3,
      "content": "pkgstats poskytuje systemd časovač, jenž zasílá seznam nainstalovaných balíčků na Vašem zařízení spolu s architekturou a používanými zrcadly Arch Linux vývojářům, aby mohli lépe soustředit své síly a zlepšit distribuci. Poskytnuté podrobnosti jsou anonymizované a nemohou být využity k rozpoznání uživatele. Můžete si prohlédnout sbírané údaje na [htttps://pkgstats.archlinux.de/packages Stránce statistik]. Další podrobnosti jsou dostupné v této diskuzi.\n\n"
    },
    {
      "title": "Opravte a ohlašujte chyby",
      "level": 3,
      "content": "Ohlašování a opravování chyb na sledovači chyb je jeden ze způsobů, jak pomoci komunitě.\n\nNicméně neúčinné využití může být protiproduktivní. Přečtěte si Pravidla ohlašování chyb.\n\n"
    },
    {
      "title": "Zpravujte o bezpečnostních chybách",
      "level": 3,
      "content": "Nové bezpečnostní chyby se objevují neustále. Pomozte Arch Bezpečnostnímu Týmu udržovat souhrn.\n\n"
    },
    {
      "title": "Pomozte zkoušet balíčky",
      "level": 3,
      "content": "Balíčky v testovcích repozotářích se prvně musí vyzkoušet než se přesunou do hlavních repozitářů. Pomozte Arch Testovacímu Týmu vyzkoušet nové balíčky.\n\n"
    },
    {
      "title": "Požadujte nové funkce",
      "level": 3,
      "content": "Požadujte nové funkce pro Arch balíčky na sledovači chyb. Ale ještě než tak učiníte, přečtěte si Bug reporting guidelines#Bug or feature? a ujistěte se, že Váš požadavek je platný.\n\nPožadujte funkce pro AUR balíčky na jejich AUR stránkách.\n\n"
    },
    {
      "title": "Tvořte nebo přizpůsobte AUR balíčky",
      "level": 3,
      "content": "Arch Uživatelský Repozitář obsahuje komunitní skripty pro balíčky; tím umožňují uživatelům jednoduše nainstalovat software, který není součástí oficiálních repozitářů. Populární balíčky jsou potom přesunuty do oficiálního extra repozitáře.\n\n"
    },
    {
      "title": "Staňte se Důvěryhodným Uživatelem",
      "level": 3,
      "content": "Pokud chcete pomoci udržovat AUR balíčky v extra repozitáři, můžete se stát Důvěrhodným Uživatelem. Vizte Package Maintainers#How do I become a Package Maintainer? pro podrobnosti.\n\n"
    },
    {
      "title": "Události",
      "level": 2,
      "content": "Často se odehrávají události pro ceolou komunitu pro opravování chyb, pročišťování a jiné činy.\n\n- Chybový den\n- AUR pročišťovací den\n\n"
    },
    {
      "title": "Softwarové projekty",
      "level": 2,
      "content": "Arch Linux distribuce se skládá z mnoha částí; správce balíčků pacman, archlinux.org stránky (archweb), a podpůrný systém Arch Uživatelský Repozitář (aurweb). Můžete přispět každému projektu zvlášť.\n\nDiskuze týkající se jednotlivých problémů se odehrávají na arch-projektové mailové konferenci a na #archlinux-projects IRC kanálu.\n\nTable content:\nProjekt | Popis | Jazyky | Údržbáři | Dodatečné odkazy\narch-boxes | Obrazy pro virtuální zdroje | Bash | klausenbusk, shibumi | \narch-release-promotion | Podpora a sladění eistujících vydání projektu v Arch Linuxové GitLab instanci | Python | dvzrv | bugs\narch-install-scripts | Užitečné skripty pro instalaci Arch Linuxu | Bash | Foxboron | bugs[dead link 2024-01-13 ⓘ]\narch-security-tracker | CVE trasovací platforma; pomáhá ve zveřejňování advisories | Python (Flask) | anthraxx | security.archlinux.org, IRC #archlinux-security, Advisory mailing list\narch-signoff | Sign off Arch Linux testovací balíčky | Python | Jelle | bugs\narchinstall | Arch Linux oficiální instalátor | Python | Torxed | bugs, Discord, Doc\narchiso | Skripty a konfigurace pro sestavování živého média | ash, bash | dvzrv, nl6720 | IRC #archlinux-releng, arch-releng mailové konference\narchlinux-docker | Docker obrazy | Bash | hashworks, sangy | bugs, docker hub\narchlinux-repro | Nástroje k sestavování Arch Linux balíčků | Python | Foxboron, Jelle, Coderobe | bugs\narchweb | Stránka archlinux.org | Python (Django) | jelle | bugs\naurweb | Stránka a systém pro aur.archlinux.org | Python, HTML, MySQL | artafinde, kevr, lfleischer | bugs, IRC #archlinux-aurweb\ndbscripts | Skripty pro vydávání a spravování balíčků v repozitářích | Bash | Foxboron | bugs\ndevtools | Zabalovací nástroje pro vývojáře a balíčkáře | Bash | Anthraxx, Foxboron, jelle | bugs\ninfrastruktura | Arch Linux infrastruktura | Ansible, Python | artafinde, foutrelis, grazzolini, svenstaro, wCPO | IRC #archlinux-devops\npacman | Správce Balíčků | Bash, C | Allan, agregory | bugs[dead link 2024-01-13 ⓘ] IRC #archlinux-pacman\ngitlab-exporter | GitLab exportér metric | Rust | Artafinde, orhun | bugs\npacman-contrib | Kontribuční skripty do pacmana | Bash, C | Demize, Polyzen | bugs\npyalpm | alpm Python spoje | Python, C | Jelle | bugs\nreleng | Automatizace instalačních artefaktů (instalační médium, PXE boot) | Bash, Python | dvzrv | bugs\nrepod | Nástroje na údržbu binárních balíčkových repozitářů pro Linux distribuce, jež využívají pacman správce balíčků | Python | dvzrv | bugs, documentation\nrebuilderd-website | Str reproducible.archlinux.org | JavaScript | Jelle | reproducible-builds.org, Debian wiki, IRC #archlinux-reproducible\n\n"
    },
    {
      "title": "Přispějte penězi",
      "level": 2,
      "content": "Můžete zjistit, jak pomoci udržovat server na oficiální Arch Linux příspěvkové stránce.\n\n"
    },
    {
      "title": "Neoficiální projekty",
      "level": 2,
      "content": "Projekty Arch komunity. Přidejte i vlastní!\n\n"
    },
    {
      "title": "Skupiny",
      "level": 3,
      "content": "Skupiny týkající se Arche, jichž se můžete účastnit.\n\n"
    },
    {
      "title": "Software",
      "level": 3,
      "content": "Komunitou vyvíjený software, jenž se soustřeďuje na Arch Linux.\n\n"
    },
    {
      "title": "Staňte se Arch Linux vývojářem",
      "level": 2,
      "content": "Hlavní motivace pro Vaši práci na Archi by mělo být pomáhání celé komunitě; neměli byste se chtít stát Arch vývojářem jen tak.\n\nČasto nynější vývojáři vyberou nové vývojáře, jakmile se zvýší workload. Občas Usually, new developers are picked by the existing developers as the workload increases. Sometimes they post a position and you can apply to fill it, but more often, they just invite somebody they know would be good at it and would fit in well with the rest of the team. Having a portfolio of Arch contributions is the best way to make it on the team.\n\nZde je seznam úkonů, jež mohou zvýšit Vaši \"popularitu\" mezi Arch vývojáři:\n\n- Získejte reputaci jako pomocník poskytováním pomoci, kdykoliv to je možné.\n- Odpovídejte na otázky na fóru, IRC a mailových konferencích.\n- Staňte se Důvěryhodným Uživatelem k získání zkušeností se správou balíčků.\n- Uložte nové balíčky na AUR.\n- Účastněte se projektů, které by se časem mohli oficiálně přidat do Arche; nebo počněte svůj vlastní.\n- Pracujte na pacmanovi, makepkg nebo jiném projektu (na GitLabu) a zašlete svoje opravy.\n- Dívejte se na sledovač chyb a opravte stávající chyby.\n- Vyhledávejte a ohlašujte nové chyby.\n- Opravujte wiki chyby, přidávejte nové stránky, opravte stávající články a ujistěte se, že procedury nejsou zastaralé.\n- Tvořte překlady.\n\n"
    }
  ]
}