{
  "title": "Joplin (Русский)",
  "url": "https://wiki.archlinux.org/title/Joplin_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Joplin — это кроссплатформенное приложение для ведения заметок и дел с использованием синтаксиса Markdown. Оно разработано как альтернатива Evernote с открытым исходным кодом. Оно доступно для различных операционных систем, таких как Linux, Windows, MacOS, Android и iOS. Поддерживает облачную синхронизацию, сквозное шифрование, веб-клиппинг, историю заметок, импорт/экспорт заметок, редактирование в формате markdown, WYSIWYG-редактирование и тегирование. Кроме того, существует множество плагинов Joplin, которые можно установить для улучшения работы с заметками.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет joplinAUR, чтобы получить CLI-версию Joplin. Чтобы использовать настольную версию Joplin, работающую на Electron, установите joplin-desktopAUR.\n\n"
    },
    {
      "title": "Плагины",
      "level": 2,
      "content": "Начиная с версии 1.6.4, плагины Joplin можно устанавливать напрямую, открыв меню поиска плагинов в разделе Сервис > Настройки > Плагины. Установочный файл плагина будет автоматически загружен в папку плагинов Joplin ~/.config/joplin-desktop/plugins. После перезапуска приложения установленные плагины Joplin будут работать по своему прямому назначению.\n\nОбратите внимание, что плагины работают только в настольной версии Joplin.\n\n"
    },
    {
      "title": "Импорт заметок из Evernote",
      "level": 3,
      "content": "Чтобы импортировать заметки из Evernote и сохранить их в Joplin в формате markdown, откройте Файл > Импорт > ENEX - Файл экспорта Evernote (Markdown) из главного окна приложения. Появится диалоговое окно, в котором можно найти файл экспорта Evernote и импортировать его в Joplin.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Документация Joplin\n- Домашняя страница Joplin\n- Официальный репозиторий плагинов Joplin\n- Обзор Joplin на сайте блога It's FOSS\n- Перевод обзора от журнала Linux Format\n\n"
    }
  ]
}