{
  "title": "Julia (Español)",
  "url": "https://wiki.archlinux.org/title/Julia_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-01-01** \n\nJulia es un lenguaje de programación dinámico de alto nivel y alto rendimiento para computación numérica. Proporciona un sofisticado compilador, ejecución paralela distribuida, precisión numérica y una extensa librería de funciones matemáticas.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete julia. Para aprender cómo se utiliza Julia, lea por favor la documentación previa.\n\n"
    },
    {
      "title": "IJulia",
      "level": 2,
      "content": "Si intenta instalar ijulia ejecutando Pkg.add(\"IJulia\") y aparece la advertencia MbedTLS had build errors., puede que necesite instalar el paquete mbedtls.\n\n"
    },
    {
      "title": "Arpack",
      "level": 3,
      "content": "La compilación del paquete Arpack puede generar un error como el que se muestra a continuación (se ha omitido el stacktrace):\n\n```\njulia> Pkg.build(\"Arpack\")\n```\n\n```\nBuilding Arpack → `~/.julia/packages/Arpack/UiiMc/deps/build.log`\n┌ Error: Error building `Arpack`:\n│ ERROR: LoadError: LibraryProduct(nothing, [\"libarpack\"], :libarpack, \"Prefix(~/.julia/packages/Arpack/UiiMc/deps/usr)\") is not satisfied, cannot generate deps.jl!\n```\n\nSe ha presentado un problema.\n\nArpack empaqueta su propio libarpack.so que requiere que el DSO libopenblas64_.so.0 esté presente en el sistema:\n\n```\n$ ldd ~/.julia/packages/Arpack/UiiMc/deps/usr/lib/libarpack.so | grep 'not found'\n```\n\n```\nlibopenblas64_.so.0 => not found\n```\n\nLa parte UiiMc de la ruta puede ser diferente en su sistema. Tal y como se muestra, el DSO requerido no está presente en el sistema, lo que causa el error de compilación. Una solución para este problema es crear un enlace simbólico al archivo DSO proporcionado por el paquete openblas, es decir\n\n```\n# ln -s /usr/lib/libopenblas.so /usr/lib/libopenblas64_.so.0\n```\n\ny luego recompilar el paquete Arpack en Julia. Sin embargo, no está claro si el DSO /usr/lib/libopenblas.so del paquete openblas puede funcionar de manera estable como reemplazo directo, dado que el sufijo 64 parece usarse para indicar una diferencia en la interfaz y el sufijo 64 indica una versión diferente en lugar de una diferencia en la arquitectura de destino.\n\n"
    },
    {
      "title": "Resaltado de sintaxis y más",
      "level": 4,
      "content": "julia-vim\n\n"
    },
    {
      "title": "Linting",
      "level": 4,
      "content": "El complemento julialint combinado con el paquete Lint.jl proporciona linting.\n\n"
    },
    {
      "title": "Rendimiento",
      "level": 2,
      "content": "Es recomendable que use una implementación BLAS de multihilo, como openblas. Esto puede llevar a aceleraciones de 10-50x para ciertas operaciones matriciales.\n\n"
    }
  ]
}