{
  "title": "Jupyter (Español)",
  "url": "https://wiki.archlinux.org/title/Jupyter_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-01-19** \n\nJupyter es un proyecto que produce entornos interactivos basados en navegadores web para programación, matemáticas y ciencia de datos. Es compatible con varios lenguajes a través de complementos (\"kernels\"), como Python, Ruby, Haskell, R, Scala y Julia.\n\nJupyter Notebook es la aplicación tradicional y la más estable . JupyterLab tiene una nueva interfaz y es más adecuado para trabajar con proyectos más grandes que constan de varios archivos. JupyterLab se considera \"listo para su uso diario\" desde la versión 0.33.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Para obtener Jupyter Notebook, instale el paquete jupyter-notebook.\n\nPara obtener JupyterLab, instale el paquete jupyterlab.\n\nDespués de la instalación, ejecute lo siguiente para habilitar los widgets interactivos de Javascript en los notebooks; de lo contrario, los widgets serán deshabilitados.\n\n```\n# jupyter nbextension enable --py --sys-prefix widgetsnbextension\n```\n\nPara instalar extensiones de Jupyter Notebook de terceros para el usuario actual, use la opción --user en lugar de --sys-prefix mientras ejecuta jupyter nbextension install. Para hacer lo mismo con la instalación de las extensiones de JupyterLab, establezca la variable de entorno\n\n```\n$ export JUPYTERLAB_DIR=$HOME/.local/share/jupyter/lab\n```\n\ny verifíquelo ejecutando jupyter lab path. De ahí en adelante, siga las instrucciones de instalación habituales.\n\n"
    },
    {
      "title": "Puesta en marcha",
      "level": 2,
      "content": "Para iniciar el servidor notebook ejecute:\n\n```\n$ jupyter notebook\n```\n\nPara iniciar JupyterLab ejecute:\n\n```\n$ jupyter lab\n```\n\nNavegue a la URL que aparece en la salida estándar si no se abre ningún navegador web automáticamente.\n\n"
    },
    {
      "title": "Haskell",
      "level": 3,
      "content": "Instale el paquete ihaskell-gitAUR. Luego ejecute ihaskell install.\n\n"
    },
    {
      "title": "Julia",
      "level": 3,
      "content": "Instale el paquete julia y ejecute julia para obtener un mensaje REPL. Entonces ejecute:\n\n```\nusing Pkg\nPkg.add(\"IJulia\")\n```\n\nVéase el manual de Julia para obtener más detalles sobre la gestión de paquetes.\n\n"
    },
    {
      "title": "Python",
      "level": 3,
      "content": "El soporte de Python 3 (a través de python-ipykernel) se incluye al instalar jupyter-notebook.\n\n"
    },
    {
      "title": "R",
      "level": 3,
      "content": "Siga las instrucciones de instalación en IR Kernel.\n\n"
    },
    {
      "title": "Sage math",
      "level": 3,
      "content": "Instale el paquete sagemath.\n\n"
    },
    {
      "title": "Octave",
      "level": 3,
      "content": "Instale el paquete jupyter-octave_kernelAUR.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página web oficial\n\n"
    }
  ]
}