{
  "title": "KDE Plasma (Español)",
  "url": "https://wiki.archlinux.org/title/KDE_Plasma_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-01-28** \n\nNote: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nArtículos relacionados\n\n- Entornos de escritorio\n- Gestor de pantallas\n- Gestor de ventanas\n- Qt\n- SDDM\n- Dolphin\n- KDE Wallet\n- KDevelop\n- Trinity\n- Apariencia uniforme para aplicaciones Qt y GTK\n\nKDE es un proyecto de software que actualmente comprende un entorno de escritorio conocido como Plasma, una colección de librerías y frameworks (KDE Frameworks) y también varias aplicaciones (KDE Applications). El anterior KDE tiene un UserBase wiki bien mantenido. Allí se puede encontrar información detallada sobre la mayoría de las aplicaciones KDE.\n\n"
    },
    {
      "title": "Plasma",
      "level": 3,
      "content": "Instale el metapaquete plasma-meta o el grupo plasma. Para conocer las diferencias entre plasma-meta y plasma véase grupo de paquetes. Alternativamente, para una instalación de Plasma más minimalista, instale el paquete plasma-desktop. El upstream de KDE tiene recomendaciones de paquetes y de configuración para obtener una sesión de Plasma con todos los complementos.\n\nSi es un usuario de NVIDIA con el controlador propietario nvidia y desea usar Wayland active el DRM kernel mode setting.\n\n"
    },
    {
      "title": "Plasma Móvil",
      "level": 3,
      "content": "Instale el paquete plasma-mobileAUR. También instale el paquete qt5-wayland para el teclado virtual Maliit.\n\n"
    },
    {
      "title": "Aplicaciones KDE",
      "level": 3,
      "content": "Para instalar el conjunto completo de aplicaciones KDE, instale el grupo kde-applications o el metapaquete kde-applications-meta. Si desea instalar aplicaciones de KDE para una categoría concreta como juegos o educación, instale la dependencia relevante de kde-applications-meta. Tenga en cuenta que esto sólo instalará aplicaciones, no instalará ninguna versión de Plasma.\n\n"
    },
    {
      "title": "Lanzamientos inestables",
      "level": 3,
      "content": "Véase Repositorios oficiales#kde-unstable\n\n"
    },
    {
      "title": "Iniciar Plasma",
      "level": 2,
      "content": "Plasma puede iniciarse usando o bien un gestor de pantallas, o bien desde la consola.\n\n"
    },
    {
      "title": "Usar un gestor de pantallas",
      "level": 3,
      "content": "- Seleccione Plasma (Wayland) para iniciar una nueva sesión en Wayland.\n- Seleccione Plasma (X11) para iniciar una nueva sesión en Xorg.\n- Seleccione Plasma Mobile (Wayland) para iniciar una nueva sesión de Plasma Móvil en Wayland.\n\n"
    },
    {
      "title": "Desde la consola",
      "level": 3,
      "content": "- Para iniciar plasma en una sesión Wayland desde la consola, ejecute /usr/lib/plasma-dbus-run-session-if-needed /usr/bin/startplasma-wayland[1]\n\n- Para iniciar plasma con xinit/startx, agregue export DESKTOP_SESSION=plasma y exec startplasma-x11 en su archivo .xinitrc o ejecute directamente en la consola startx /usr/bin/startplasma-x11. Si quiere iniciar Xorg al iniciar sesión, revise Inicio automático de X al inicio de sesión.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "La mayoría de las configuraciones para las aplicaciones KDE se almacenan en ~/.config/. Sin embargo, la configuración de KDE se realiza principalmente a través de la aplicación Preferencias del sistema. Se puede iniciar desde un terminal ejecutando systemsettings.\n\n"
    },
    {
      "title": "Escritorio Plasma",
      "level": 4,
      "content": "Existen diferentes tipos de temas de KDE, que varían según el alcance de lo que modifican:\n\n- Temas Globales, paquetes completos que pueden incluir temas de Plasma, estilos de aplicaciones, colores, fuentes, íconos, cursores, pantallas de bienvenida, temas SDDM y colores para Konsole.\n- Temas de Plasma, que modifican el aspecto de los paneles y widgets de Plasma. Estos suelen tener un tema Kvantum o Aurorae recomendado que los acompaña para completar el look.\n- Estilos de Aplicaciones, que modifican el aspecto de los programas.\n- Estilos de Aplicaciones que usan motores de temas tales que Kvantum, QtCurve [2], QSvgStyle [3] y Aurorae.\n- #Temas de iconos, que proporcionan iconos para aplicaciones, archivos y acciones.\n\nPara facilitar la instalación en todo el sistema, algunos temas están disponibles tanto en los repositorios oficiales como en el AUR.\n\nLos temas de Plasma también se pueden instalar a través de Preferencias del sistema > Tema del espacio de trabajo > Tema de escritorio > Obtener nuevos temas.\n\nBreeze no está disponible directamente para Qt4 ya que no se puede compilar sin los paquetes de KDE 4, que se han eliminado del repositorio adicional en agosto de 2018 (FS#59784). Sin embargo, puede instalar breeze-gtk y elegir GTK+ como estilo de interfaz gráfica ejecutando qtconfig-qt4.\n\nEl tema recomendado para una apariencia agradable en aplicaciones GTK+ es breeze-gtk, un tema GTK+ diseñado para imitar la apariencia del tema de Plasma Breeze. Instale kde-gtk-config (parte del grupo plasma) y seleccione el tema GTK instalado para GTK2/GTK3-Theme en Preferencias del sistema > Estilo de las aplicaciones > Estilo de aplicaciones de GNOME.\n\nEn algunos temas, la descripción emergente en aplicaciones GTK+ tiene texto blanco sobre fondos blancos, lo que dificulta su lectura. Para cambiar los colores en las aplicaciones GTK2, busque la sección de descripciones emergentes en el archivo .gtkrc-2.0 y cámbiela. Para la aplicación GTK3 se deben cambiar dos archivos, gtk.css y settings.ini. También puede ayudar el desmarcar la opción Aplicar colores a aplicaciones no Qt en Preferencias del sistema > Colores.\n\nAlgunos programas de GTK2 como vuescan-binAUR todavía parecen difíciles de usar debido a casillas de verificación invisibles con el aspecto Breeze o Adwaita en una sesión Plasma. Para solucionar esto, instale y seleccione, por ejemplo, el aspecto Numix-Frost-Light de numix-frost-themesAUR en Preferencias del sistema > Estilo de las aplicaciones > Estilo de aplicaciones de GNOME (GTK) > Seleccione un tema de GTK2:. Numix-Frost-Light se parece a Breeze.\n\nLa cara del usuario se puede configurar a través de Preferencias del sistema > Detalles de cuentas > Gestor de usuarios.\n\nLos plasmoides son pequeñas aplicaciones KDE scripteadas (scripts plasmoides) o codificadas (binarios plasmoides) diseñadas para mejorar la funcionalidad de su escritorio.\n\nLa forma más fácil de instalar scripts plasmoides es haciendo clic derecho en un panel o en el escritorio y seleccionando Añadir elementos gráficos > Obtener nuevos elementos gráficos > Descargar nuevos elementos gráficos de plasma. Esto le mostratá una bonita interfaz para https://store.kde.org/ que le permite instalar, desinstalar o actualizar scripts plasmoides de terceros con un solo clic.\n\nMuchos binarios de Plasmoid están disponibles en AUR.\n\nInstale plasma-pa o kmix (inicie Kmix desde el lanzador de aplicaciones). plasma-pa ahora se instala de manera predeterminada con plasma, no se necesita ninguna configuración.\n\nCuando el panel de plasma esté encima de otras ventanas, su sombra se mostrará encima de ellas. [4] Para deshabilitar este comportamiento sin afectar a otras sombras, instale xorg-xprop y ejecute:\n\n```\n$ xprop -remove _KDE_NET_WM_SHADOW\n```\n\na continuación, seleccione el panel con el cursor de tamaño ampliado. [5] Para su automatización, instale xorg-xwininfo y cree el siguiente script:\n\n```\n/usr/local/bin/kde-no-shadow\n```\n\n```\n#!/bin/bash\nfor WID in $(xwininfo -root -tree | sed '/\"Plasma\": (\"plasmashell\" \"plasmashell\")/!d; s/^  *\\([^ ]*\\) .*/\\1/g'); do\n   xprop -id $WID -remove _KDE_NET_WM_SHADOW\ndone\n```\n\nEstablezca permisos de ejecución para el script:\n\n```\n# chmod 755 /usr/local/bin/kde-no-shadow\n```\n\nEl script se puede ejecutar al iniciar sesión con Agregar script en Inicio automático:\n\n```\n$ kcmshell5 autostart\n```\n\n"
    },
    {
      "title": "Decoraciones de las ventanas",
      "level": 4,
      "content": "Las decoraciones de las ventanas se pueden cambiar en Preferencias del sistema > Estilo de las aplicaciones > Decoración de ventanas.\n\nAllí también puede descargar e instalar directamente más temas con un solo clic, y algunos están disponibles en AUR.\n\n"
    },
    {
      "title": "Temas de iconos",
      "level": 4,
      "content": "Los temas de iconos se pueden instalar y cambiar en Preferencias del sistema > Iconos.\n\n"
    },
    {
      "title": "Eficiencia de espacio",
      "level": 4,
      "content": "El shell del Plasma Netbook se ha eliminado de Plasma 5, véase la siguiente publicación en el foro de KDE. Sin embargo, puede lograr algo similar editando el archivo ~/.config/kwinrc agregando BorderlessMaximizedWindows=true en la sección [Windows].\n\n"
    },
    {
      "title": "Generación de miniaturas",
      "level": 4,
      "content": "Para permitir la generación de miniaturas para archivos de media o de documentos en el escritorio y en Dolphin, instale kdegraphics-thumbnailers y ffmpegthumbs.\n\nLuego, habilite las categorías de las miniaturas para el escritorio haciendo clic con el botón derecho en el fondo de escritorio > Configurar escritorio > Iconos > Más opciones de vista previa...\n\nEn Dolphin, vaya a Control > Configurar Dolphin... > General > Vistas previas.\n\n"
    },
    {
      "title": "Imprimir",
      "level": 3,
      "content": "También puede configurar impresoras en Preferencias del sistema > Impresoras. Para usar este método, primero debe instalar print-manager y cups. Véase CUPS#Configuration.\n\n"
    },
    {
      "title": "Soporte Samba/Windows",
      "level": 3,
      "content": "Si desea tener acceso a los servicios de Windows, instale Samba (paquete samba).\n\nLa funcionalidad de compartir con Dolphin requiere el paquete kdenetwork-filesharing y los recursos compartidos, que el stock smb.conf no los tiene habilitados. Las instrucciones para agregarlos se encuentran en Samba#Habilitar los recursos compartidos, después de lo cual la compartición en Dolphin debería funcionar sin necesidad de configuración después de reiniciar Samba.\n\nA diferencia de los exploradores de archivos GTK que también utilizan GVfs para el programa lanzado, abrir archivos desde recursos compartidos de Samba en Dolphin a través de KIO hace que Plasma copie primero todo el archivo al sistema local con la mayoría de los programas (VLC es una excepción). Para solucionar esto, puede usar un navegador de archivos basado en GTK como thunar con gvfs y gvfs-smb (y gnome-keyring para guardar las credenciales de inicio de sesión) para acceder a los recursos compartidos SMB de una manera más capaz.\n\nOtra posibilidad es montar un recurso compartido Samba a través de cifs-utils para hacer creer a Plasma que el recurso compartido SMB es solo una carpeta local normal y, por lo tanto, se pueda acceder a él normalmente. Véase Samba#Montaje manual y Samba#Montaje automático.\n\nUna solución con interfaz gráfica está disponible en samba-mounter-gitAUR, que ofrece básicamente la misma funcionalidad a través de una opción fácil de utilizar ubicada en Preferencias del sistema > Controladores de red. Sin embargo, podría romperse con las nuevas versiones de KDE Plasma.\n\n"
    },
    {
      "title": "Actividades de KDE Desktop",
      "level": 3,
      "content": "KDE Desktop Activities son espacios de trabajo especiales en los que puede seleccionar configuraciones específicas para cada actividad que se aplican solamente cuando se está utilizando dicha actividad.\n\n"
    },
    {
      "title": "Administración de energía",
      "level": 3,
      "content": "Instale powerdevil para obtener un servicio integrado de administración de energía en Plasma. Este servicio ofrece funciones adicionales de ahorro de energía, control de brillo del monitor (si es compatible) e informes de batería, incluidos dispositivos periféricos.\n\n"
    },
    {
      "title": "Inicio automático",
      "level": 3,
      "content": "Plasma puede iniciar aplicaciones automáticamente y ejecutar scripts en el arranque y el apagado. Para iniciar automáticamente una aplicación, vaya a Preferencias del sistema > Arranque y apagado > Autoarranque y agregue el programa o el script de shell que desee. Para las aplicaciones, se creará un archivo .desktop, para los scripts de shell, se creará un enlace simbólico.\n\n- Los programas pueden iniciarse automáticamente solo con el inicio de sesión, mientras que los scripts de shell también se pueden ejecutar en el apagado o incluso antes de que se inicie Plasma.\n- Los scripts de shell solo se ejecutarán si están marcados como ejecutables.\n\n- Coloque entradas del escritorio (es decir, archivos .desktop) en el directorio XDG Autostart apropiado.\n\n- Coloque o guarde los scripts de shell en uno de los siguientes directorios:\n\n"
    },
    {
      "title": "Phonon",
      "level": 3,
      "content": "De Wikipedia:\n\nPhonon está siendo ampliamente utilizando en KDE, tanto para audio (por ejemplo, las notificaciones del sistema o aplicaciones de audio de KDE) como para vídeo (por ejemplo, las miniaturas de video de Dolphin).\n\n"
    },
    {
      "title": "¿Qué backend debo elegir?",
      "level": 4,
      "content": "Puede elegir entre backends basados en GStreamer y VLC - cada uno disponible en versiones para aplicaciones Qt4 y aplicaciones Qt5 (phonon-qt4-gstreamerAUR, phonon-qt5-gstreamer - phonon-qt4-vlcAUR, phonon-qt5-vlc).\n\nEl anterior (Phonon) prefiere VLC, pero algunas distribuciones de Linux más prominentes (Kubuntu y Fedora-KDE por ejemplo) prefieren GStreamer porque les permite dejar fácilmente de lado los códecs patentados MPEG de la instalación por defecto. Ambos backends tienen un conjunto de características ligeramente diferentes. El backend de Gstreamer tiene alguna dependencias de códecs opcionales, instálelos según sea necesario:\n\n- gst-libav - códecs de Libav.\n- gst-plugins-good - Soporte de PulseAudio y códecs adicionales.\n- gst-plugins-ugly - códecs adicionales.\n- gst-plugins-bad - códecs adicionales.\n\nEn el pasado, también se desarrollaron otros backends, pero ya no se mantienen y sus paquetes AUR se han eliminado.\n\n- Se pueden instalar varios backends a la vez y priorizarlos en Preferencias del sistema > Multimedia > Audio y vídeo > Motor.\n- Según los foros de KDE, el backend de VLC carece de soporte para ReplayGain.\n- Si usa el backend VLC, puede experimentar cuelgues cada vez que Plasma quiera enviarle una advertencia sonora y en muchos otros casos también [6]. Una posible solución es reconstruir la caché de los plugins de VLC:\n\n```\n# /usr/lib/vlc/vlc-cache-gen /usr/lib/vlc/plugins\n```\n\n"
    },
    {
      "title": "Aplicaciones",
      "level": 2,
      "content": "El proyecto KDE proporciona un conjunto de aplicaciones que se integran con el escritorio Plasma. Véase el grupo kde-applications para obtener una lista completa de las aplicaciones disponibles. Véase también Category:KDE (Español) para los artículos relacionados con las aplicaciones KDE .\n\nAparte de los programas provistos en KDE Applications, hay muchas otras aplicaciones disponibles que pueden complementar el escritorio Plasma. Algunas de éstas se tratan a continuación.\n\n"
    },
    {
      "title": "Detener Xorg server a través de las preferencias del sistema KDE",
      "level": 4,
      "content": "Navegue al submenú Preferencias del sistema > Dispositivos de entrada > Teclado > Avanzado (pestaña) > \"Key Sequence to kill the X server\" y asegúrese de que la casilla esté marcada.\n\n"
    },
    {
      "title": "KCM",
      "level": 4,
      "content": "KCM significa KConfig Module. Los KCM pueden ayudarle a configurar su sistema al proporcionar interfaces en preferencias del sistema, o a través de la línea de comandos con kcmshell6.\n\n- kde-gtk-config — Configurador GTK2 y GTK3 para KDE.\n\n- wacom tablet — Interfaz gráfica de KDE para los controladores Linux Wacom.\n\n- Kcmsystemd — módulo de control systemd para KDE.\n\nPuede encontrar más KCMs en linux-apps.com.\n\n"
    },
    {
      "title": "Búsqueda de escritorio",
      "level": 3,
      "content": "KDE implementa la búsqueda de escritorio con un software llamado Baloo, una solución de indexación y de búsqueda de archivos.\n\n"
    },
    {
      "title": "Navegadores web",
      "level": 3,
      "content": "Los siguientes navegadores web pueden integrarse con Plasma:\n\n- Konqueror — Parte del proyecto KDE, es compatible con dos motores de renderización - KHTML y Qt WebEngine basado en Chromium.\n\n- Falkon — Un navegador web Qt con funciones de integración Plasma, anteriormente conocido como Qupzilla. Utiliza Qt WebEngine.\n\n- Chromium — Chromium y su variante patentada Google Chrome tienen una integración de Plasma limitada. Pueden usar KWallet y las ventanas de KDE Abrir/Guardar.\n\n- Firefox — Firefox puede configurarse para integrarse mejor con Plasma. Véase Integración de Firefox KDE para obtener más información.\n\n"
    },
    {
      "title": "PIM",
      "level": 3,
      "content": "KDE ofrece su propia pila para la gestión de información personal. Esto incluye emails, contactos, calendario, etc. Para instalar todos los paquetes PIM, puede usar el metapaquete kde-pim-meta.\n\n"
    },
    {
      "title": "Akonadi",
      "level": 4,
      "content": "Akonadi es un sistema destinado a actuar como caché local para datos PIM, independientemente de su origen, para que luego pueda ser utilizado por otras aplicaciones. Esto incluye los emails, contactos, calendarios, eventos, diarios, alarmas, notas, etc. del usuario. Akonadi no almacena ningún dato por sí mismo: el formato de almacenamiento depende de la naturaleza de los datos (por ejemplo, los contactos pueden almacenarse en formato vCard).\n\nInstale akonadi. Para obtener complementos adicionales, instale kdepim-addons.\n\nNote: Véase también FS#32878.\n\n```\n# pacman -S akonadi --assume-installed mariadb\n```\n\nVéase también FS#32878.\n\nInstale postgresql.\n\nPara usar PostgreSQL edite el archivo de configuración de Akonadi para que tenga el siguiente contenido:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QPSQL\n\n[QPSQL]\nHost=\nInitDbPath=/usr/bin/initdb\nName=akonadi\nServerPath=/usr/bin/pg_ctl\nStartServer=true\n```\n\nInicie Akonadi con akonadictl start, y verifique su estado: akonadictl status.\n\nPara usar SQLite edite el archivo de configuración de Akonadi para que coincida con la configuración que se muestra a continuación:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QSQLITE3\n\n[QSQLITE3]\nName=/home/username/.local/share/akonadi/akonadi.db\n```\n\nVéase esta sección en la base de usuarios de KDE.\n\n"
    },
    {
      "title": "KDE Connect",
      "level": 3,
      "content": "KDE Connect proporciona varias características para conectar su teléfono Android con su escritorio Linux:\n\n- Comparta archivos y URLs a/desde KDE desde/a cualquier aplicación, sin cables.\n- Emulación de panel táctil: use la pantalla de su teléfono como si fuera el panel táctil de su ordenador.\n- Sincronización de notificaciones (4.3+): lea sus notificaciones Android desde el escritorio.\n- Portapapeles compartido: copie y pegue entre su teléfono y su ordenador.\n- Control remoto multimedia: utilize su teléfono como un control remoto para reproductores multimedia en Linux.\n- Conexión WiFi: no necesita cable usb ni bluetooth.\n- Cifrado RSA: su información está segura.\n\nDeberá instalar KDE Connect tanto en su ordenador como en Android. Para el PC, instale el paquete kdeconnect. Para Android, instale KDE Connect desde Google Play o desde F-Droid.\n\nPara el uso de la entrada remota con plasma en wayland es necesario instalar el paquete xdg-desktop-portal.\n\nEs posible usar KDE Connect incluso si no usa el escritorio Plasma. Para los usuarios de GNOME, se puede lograr una mejor integración instalando gnome-shell-extension-gsconnectAUR en vez de kdeconnect.\n\nSi usa un cortafuegos, necesita abrir los puertos UDP y TCP 1714 a través de 1764. Véase https://community.kde.org/KDEConnect#Troubleshooting.\n\n"
    },
    {
      "title": "Usar un gestor de ventanas diferente",
      "level": 3,
      "content": "La configuración del selector de componentes en Plasma ya no permite cambiar el gestor de ventanas. [7] Para cambiar el gestor de ventanas utilizado, debe establecer la variable de entorno KDEWM antes del inicio de KDE. [8] Para ello, puede crear un script llamado set_window_manager.sh en ~/.config/plasma-workspace/env/ y exportar la variable KDEWM allí. Por ejemplo, para utilizar el gestor de ventanas i3:\n\n```\n~/.config/plasma-workspace/env/set_window_manager.sh\n```\n\n```\nexport KDEWM=/usr/bin/i3\n```\n\nY luego hacerlo ejecutable:\n\n```\n$ chmod +x ~/.config/plasma-workspace/env/set_window_manager.sh\n```\n\n"
    },
    {
      "title": "Sesión KDE/Openbox",
      "level": 4,
      "content": "El paquete openbox proporciona una sesión para usar KDE con Openbox. Para hacer uso de esta sesión, seleccione KDE/Openbox en el menú gestor de pantallas.\n\nPara aquellos que inician sesión manualmente, agregue la siguiente línea a su configuración xinit:\n\n```\n~/.xinitrc\n```\n\n```\nexec openbox-kde-session\n```\n\n"
    },
    {
      "title": "Rehabilitar efectos de composición",
      "level": 4,
      "content": "Al reemplazar Kwin con un gestor de ventanas que no proporciona un Compositor (como Openbox), se perderá cualquier efecto de composición del escritorio, por ejemplo, la transparencia. En este caso, instale y ejecute un gestor de Composite separado para proporcionar los efectos como Xcompmgr o Compton.\n\n"
    },
    {
      "title": "Configurar la resolución del monitor / múltiples monitores",
      "level": 3,
      "content": "Para habilitar la gestión de resolución de pantalla y múltiples monitores en Plasma, instale kscreen. Esto agrega las opciones adicionales a Preferencias del sistema > Pantalla y monitor.\n\n"
    },
    {
      "title": "Deshabilitar la apertura del lanzador de aplicaciones con la tecla Super (tecla Windows)",
      "level": 3,
      "content": "Para deshabilitar esta característica, actualmente puede ejecutar el siguiente comando:\n\n```\n$ kwriteconfig5 --file kwinrc --group ModifierOnlyShortcuts --key Meta \"\"\n```\n\n"
    },
    {
      "title": "Deshabilitar que los marcadores se muestren en el menú de aplicaciones",
      "level": 3,
      "content": "Si tiene instalada la integración del navegador de Plasma, KDE mostrará marcadores en el lanzador de aplicaciones.\n\nPara deshabilitar esta característica, ejecute las siguientes órdenes:\n\n```\n$ mkdir ~/.local/share/kservices5\n$ sed 's/EnabledByDefault=true$/EnabledByDefault=false/' /usr/share/kservices5/plasma-runner-bookmarks.desktop > ~/.local/share/kservices5/plasma-runner-bookmarks.desktop\n```\n\n"
    },
    {
      "title": "Las fuentes en una sesión Plasma se ven mal",
      "level": 4,
      "content": "Pruebe a instalar los paquetes ttf-dejavu y ttf-liberation.\n\nDespués de la instalación, asegúrese de cerrar sesión y volver a iniciarla. No debería tener que modificar nada en Preferencias del sistema > Tipos de letra. Si está utilizando qt5ct, la preferencias de la Herramienta de Configuración Qt5 pueden anular los ajustes de los tipos de letra en las preferencias del sistema.\n\nSi ha configurado personalmente el renderizado de sus Fuentes, tenga en cuenta que las preferencias del sistema pueden alterar su apariencia. Cuando vaya a Preferencias del sistema > Tipos de letra, las preferencias del sistema probablemente alterarán el archivo de configuración de las fuentes (fonts.conf).\n\nNo hay forma de evitar esto, pero, si configura los valores para que coincidan con su archivo fonts.conf, el renderizado esperado de las fuentes volverá (se requerirá que reinicie su aplicación o, en algunos casos, que reinicie su escritorio). Tenga en cuenta que las preferencias de las fuentes de Gnome también hacen esto.\n\n"
    },
    {
      "title": "Las fuentes son enormes o parecen desproporcionadas",
      "level": 4,
      "content": "Intente forzar la fuente DPI a 96 en Preferencias del sistema > Tipos de letra.\n\nSi eso no funciona, intente establecer el DPI directamente en su configuración de Xorg como se documenta en Xorg#Setting DPI manually.\n\n"
    },
    {
      "title": "Configuración relacionada",
      "level": 3,
      "content": "Muchos problemas en KDE están relacionados con su configuración.\n\n"
    },
    {
      "title": "El escritorio Plasma se comporta de manera extraña",
      "level": 4,
      "content": "Los problemas en Plasma son generalmente causados por widgets de Plasma inestables (llamados coloquialmente plasmoides) o temas de Plasma. Primero, encuentre cuál fue el último widget o tema que instaló y deshabilítelo o desinstálelo.\n\nPor lo tanto, si su escritorio muestra repentinamente un «bloqueo», es probable que esto se deba a un widget instalado defectuoso. Si no puede recordar qué widget instaló antes de que comenzara el problema (a veces puede ser un problema irregular), intente localizarlo eliminando cada widget hasta que el problema cese. Luego, puede desinstalar el widget y presentar un informe de error en el seguimiento de errores de KDE solo si es un widget oficial. Si no lo es, se recomienda buscar la entrada en la KDE Store e informar al desarrollador de ese widget sobre el problema (detallando los pasos para reproducirlo, etc.).\n\nSi no puede encontrar el problema, pero no quiere que se pierdan todos los ajustes, vaya a ~/.config/ y ejecute el siguiente comando:\n\n```\n$ for j in plasma*; do mv -- \"$j\" \"${j%}.bak\"; done\n```\n\nEste comando renombrará todos los archivos de configuración relacionados con Plasma de su usuario a *.bak (por ejemplo, plasmarc.bak) y cuando vuelva a iniciar sesión en Plasma, tendrá la configuración predeterminada de nuevo. Para deshacer esa acción, elimine la extensión de archivo .bak. Si ya tiene archivos *.bak, renómbrelos, muévalos o elimínelos primero. Se recomienda encarecidamente que se creen regularmente copias de seguridad de todos modos. Véase sincronización y programas de copia de seguridad para obtener una lista de posibles soluciones.\n\n"
    },
    {
      "title": "Limpiar la caché para resolver problemas de actualización",
      "level": 4,
      "content": "El problema puede ser causado por un caché antiguo. A veces, después de una actualización, la memoria caché antigua podría presentar un comportamiento extraño y difícil de depurar, como shells no detenibles, cuelgues al cambiar varias configuraciones, que Ark no pueda extraer archivos o que Amarok no reconozca ninguna de sus canciones. Esta solución también puede resolver problemas con aplicaciones KDE y Qt que se ven mal después de una actualización.\n\nReconstruya la caché usando los siguientes comandos:\n\n```\n$ rm ~/.config/Trolltech.conf\n$ kbuildsycoca5 --noincremental\n```\n\nOpcionalmente, vacíe los contenidos de la carpeta ~/.cache/, sin embargo, esto también borrará la caché de otras aplicaciones:\n\n```\n$ rm -rf ~/.cache/*\n```\n\n"
    },
    {
      "title": "Problemas gráficos",
      "level": 3,
      "content": "Asegúrese de tener instalado el controlador adecuado para su GPU. Véase Xorg#Driver installation para obtener más información. Si tiene una tarjeta más antigua, podría ayudar el #Deshabilitar los efectos del escritorio manualmente o automáticamente para aplicaciones definidas o #Deshabilitar la composición.\n\n"
    },
    {
      "title": "Obtener el estado actual de KWin para fines de soporte y depuración",
      "level": 4,
      "content": "Este comando muestra un resumen del estado actual de KWin, incluidas las opciones utilizadas, el backend de composición utilizado y las capacidades relevantes del controlador OpenGL. Véase más en el blog de Martin.\n\n```\n$ qdbus org.kde.KWin /KWin supportInformation\n```\n\n"
    },
    {
      "title": "Deshabilitar los efectos del escritorio manualmente o automáticamente para aplicaciones definidas",
      "level": 4,
      "content": "Plasma tiene habilitados los efectos del escritorio de manera predeterminada y no todas las aplicaciones los deshabilitarán automáticamente, por ejemplo, los juegos. Puede deshabilitar los efectos del escritorio en Preferencias del sistema > Comportamiento del escritorio > Efectos del escritorio y alternar los efectos del escritorio con Alt+Shift+F12.\n\nAdicionalmente, puede crear reglas KWin personalizadas para deshabilitar/habilitar automáticamente la composición cuando cierta aplicación/ventana se inicie en Preferencias del sistema > Gestión de ventanas > Reglas de la ventana.\n\n"
    },
    {
      "title": "Deshabilitar la composición",
      "level": 4,
      "content": "En Preferencias del sistema > Pantalla y monitor > Compositor, desmarque Activar el compositor durante el inicio y reinicie Plasma.\n\n"
    },
    {
      "title": "Parpadeo en pantalla completa cuando la composición está habilitada",
      "level": 4,
      "content": "En Preferencias del sistema > Pantalla y monitor > Compositor, desmarque Permitir que las aplicaciones bloqueen la composición. Esto puede afectar al rendimiento.\n\n"
    },
    {
      "title": "El cursor de Plasma a veces se muestra incorrectamente",
      "level": 4,
      "content": "Cree el directorio ~/.icons/default, y dentro de él un archivo llamado index.theme con el siguiente contenido:\n\n```\n~/.icons/default/index.theme\n```\n\n```\n[Icon Theme]\nInherits=breeze_cursors\n```\n\nEjecute el siguiente comando:\n\n```\n$ ln -s /usr/share/icons/breeze_cursors/cursors ~/.icons/default/cursors\n```\n\n"
    },
    {
      "title": "Se ha establecido una resolución de pantalla inutilizable",
      "level": 4,
      "content": "Sus ajustes de configuración locales para kscreen pueden anular aquellos establecidos en xorg.conf. Busque los archivos de configuración de kscreen en ~/.local/share/kscreen/ y revise si el modo está establecido en una resolución que no es compatible con su monitor.\n\n"
    },
    {
      "title": "No hay sonido después de suspender",
      "level": 4,
      "content": "Si no hay sonido después de la suspensión y si KMix no muestra dispositivos de audio los cuales deberían estar ahí, reiniciar plasmashell y pulseaudio podría ayudar:\n\n```\n$ killall plasmashell\n$ systemctl --user restart pulseaudio.service\n$ plasmashell\n```\n\nEs posible que algunas aplicaciones también deban reiniciarse para que el sonido se reproduzca de nuevo.\n\n"
    },
    {
      "title": "Los archivos MP3 no se pueden reproducir cuando se utiliza el backend GStreamer Phonon",
      "level": 4,
      "content": "Esto se puede resolver instalando el complemento libav de GStreamer (paquete gst-libav). Si aún tiene problemas, puede intentar cambiar el backend de Phonon utilizado instalando otro como phonon-qt4-vlcAUR o phonon-qt5-vlc.\n\nLuego, asegúrese de que se prefiera el backend vía Preferencias del sistema > Multimedia > Audio y vídeo > Motor.\n\n"
    },
    {
      "title": "No hay opciones de Suspender/Hibernar",
      "level": 4,
      "content": "Si su sistema puede suspender o hibernar usando systemd pero estas opciones no se muestran en KDE, asegúrese de que powerdevil esté instalado.\n\n"
    },
    {
      "title": "Limpie la configuración de akonadi para arreglar KMail",
      "level": 4,
      "content": "En primer lugar, asegúrese de que KMail no se está ejecutando. Después, haga una copia de seguridad de la configuración:\n\n```\n$ cp -a ~/.local/share/akonadi ~/.local/share/akonadi-old\n$ cp -a ~/.config/akonadi ~/.config/akonadi-old\n```\n\nInicie Preferencias del sistema > Personal y elimine todos los medios. Vuelva a Dolphin y elimine el ~/.local/share/akonadi/ original y ~/.config/akonadi/ - las copias que hizo aseguran que pueda revertir los cambios en caso de ser necesario.\n\nAhora vuelva a la página de preferencias del sistema y agregue cuidadosamente los medios necesarios. Debería ver la lectura de medios en sus carpetas de correo. A continuación, inicie Kontact/KMail para ver si funciona correctamente.\n\n"
    },
    {
      "title": "Vaciar la bandeja de entrada IMAP en KMail",
      "level": 4,
      "content": "Para algunas cuentas IMAP, KMail mostrará la bandeja de entrada como un contenedor de nivel superior (por lo que no será posible leer los mensajes allí) con todas las demás carpetas de esta cuenta dentro. [9]. Para resolver este problema, simplemente deshabilite las suscripciones del lado del servidor en la configuración de la cuenta KMail.\n\n"
    },
    {
      "title": "Se congela cuando se usa montaje automático en un volumen NFS",
      "level": 4,
      "content": "El uso de Fstab#Montaje automático con systemd en un volumen NFS puede provocar bloqueos, véase informe de errores previos.\n\n"
    },
    {
      "title": "Registro agresivo del diario QXcbConnection",
      "level": 3,
      "content": "Véase Qt#Desactivar/Cambiar el comportamiento del log de journal Qt.\n\n"
    },
    {
      "title": "Las aplicaciones KF5/Qt 5 no muestran iconos en i3/FVWM/awesome",
      "level": 3,
      "content": "Véase Qt#Configuración de aplicaciones Qt5 en otros entornos que KDE Plasma.\n\n"
    },
    {
      "title": "Problemas al guardar las credenciales y los diálogos de KWallet se muestran de manera persistente",
      "level": 3,
      "content": "No se recomienda desactivar el sistema de guardado de contraseñas de KWallet en las preferencias del usuario, ya que es necesario para guardar credenciales cifradas como las frases de contraseñas WiFi de cada usuario. La persistencia de los diálogos de KWallet puede ser consecuencia de desactivarlo.\n\nEn caso de que encuentre molestos los diálogos para desbloquear la cartera cuando las aplicaciones deseen acceder a ella, puede permitir que los gestores de pantallas SDDM y LightDM desbloqueen la cartera al iniciar sesión automáticamente, véase KDE Wallet#Desbloquear KDE Wallet automáticamente al iniciar sesión. La primera cartera debe ser generada por KWallet (y no por el usuario) para poder ser utilizada por las credenciales del programa del sistema.\n\nEn caso de que desee que las credenciales de la cartera no se abran en la memoria para cada aplicación, puede restringir su acceso a las aplicaciones con kwalletmanager en la configuración de KWallet.\n\nSi no le interesa para nada el cifrado de credenciales, simplemente puede dejar los formularios de contraseñas en blanco cuando KWallet le pida la contraseña mientras crea una cartera. En este caso, las aplicaciones pueden acceder a las contraseñas sin tener que desbloquear primero la cartera.\n\n"
    },
    {
      "title": "Discover no muestra ninguna aplicación",
      "level": 3,
      "content": "Esto se puede resolver instalando packagekit-qt5.\n\n"
    },
    {
      "title": "kscreenlocker_greet usa mucha CPU con controladores de NVIDIA",
      "level": 3,
      "content": "Tal y como se describe en KDE Bug 347772 los controladores OpenGL de NVIDIA y QML pueden no funcionar bien con Qt 5. Esto puede llevar a kscreenlocker_greet a utilizar mucha CPU después de desbloquear la sesión. Para resolver este problema, establezca la variable de entorno QSG_RENDERER_LOOP a basic.\n\nA continuación, elimine las instancias anteriores del greeter con killall kscreenlocker_greet.\n\n"
    },
    {
      "title": "Error 22 del SO cuando se ejecuta Akonadi en ZFS",
      "level": 3,
      "content": "Si su directorio de inicio está en un grupo ZFS, cree un archivo ~/.config/akonadi/mysql-local.conf con el siguiente contenido:\n\n```\n[mysqld]\ninnodb_use_native_aio = 0\n```\n\nVéase MariaDB#OS error 22 when running on ZFS.\n\n"
    },
    {
      "title": "Algunos programas no pueden desplazarse cuando sus ventanas están inactivas",
      "level": 3,
      "content": "Esto se debe a la problemática manera en que GTK3 maneja los eventos de desplazamiento del ratón. Una solución para esto es establecer la variable de entorno GDK_CORE_DEVICE_EVENTS=1. Sin embargo, esta solución también rompe el desplazamiento suave del panel táctil y el desplazamiento de la pantalla táctil.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página web de KDE\n- Noticias de KDE\n- Blogs de KDE\n- Foros de KDE\n- Wikis de KDE\n- Seguimiento de errores de KDE\n- Blog de Martin Graesslin\n- Salas Matrix de KDE\n\n"
    }
  ]
}