{
  "title": "KDE Desktop Tricks",
  "url": "https://wiki.archlinux.org/title/KDE_Desktop_Tricks",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- Display manager\n- Window manager\n- Qt\n- SDDM\n- Dolphin\n- KDE Wallet\n- KDevelop\n- Trinity\n- Uniform look for Qt and GTK applications\n- Official repositories#kde-unstable\n\nKDE is a software project currently comprising a desktop environment known as Plasma, a collection of libraries and frameworks (KDE Frameworks) and several applications (KDE Applications) as well.\n\nKDE upstream has a well maintained UserBase wiki. Detailed information about most KDE applications can be found there.\n\n"
    },
    {
      "title": "Plasma",
      "level": 3,
      "content": "Install the plasma-meta meta-package or the plasma group. For differences between plasma-meta and plasma reference Package group. Alternatively, for a more minimal Plasma installation, install the plasma-desktop package. Upstream KDE has package and setup recommendations to get a fully-featured Plasma session.\n\nIf you are an NVIDIA user with the proprietary nvidia driver and wish to use the Wayland session, enable the DRM kernel mode setting.\n\n"
    },
    {
      "title": "Plasma Mobile",
      "level": 3,
      "content": "Install plasma-mobileAUR.\n\n"
    },
    {
      "title": "KDE applications",
      "level": 3,
      "content": "To install the full set of KDE Applications, install the kde-applications-meta meta-package or the kde-applications group. If you only want KDE applications for a certain category, like gaming or education, install the relevant dependency of kde-applications-meta. Note that installing applications alone will not install any version of Plasma.\n\n"
    },
    {
      "title": "Unstable releases",
      "level": 3,
      "content": "See Official repositories#kde-unstable for beta releases.\n\n"
    },
    {
      "title": "Starting Plasma",
      "level": 2,
      "content": "As of KDE Plasma 6, the Wayland session has matured enough to become the default and preferred one. The Xorg session is still supported, but will be removed in Plasma 7. See Wayland Known Significant Issues and X11 Known Significant Issues for more information.\n\nPlasma can be started either using a display manager, or from the console.\n\n"
    },
    {
      "title": "Using a display manager",
      "level": 3,
      "content": "- Select Plasma (Wayland) to launch a new session in Wayland.\n- Select Plasma (X11) to launch a new session in Xorg.\n- Select Plasma Mobile (Wayland) to launch a new Plasma Mobile session in Wayland.\n\n"
    },
    {
      "title": "From the console",
      "level": 3,
      "content": "- To start a Plasma on Wayland session from a console, run /usr/lib/plasma-dbus-run-session-if-needed /usr/bin/startplasma-wayland[1].\n- To start Plasma with xinit/startx, append export DESKTOP_SESSION=plasma and exec startplasma-x11 to your .xinitrc file or run directly in the console startx /usr/bin/startplasma-x11. If you want to start Xorg at login, please see Start X at login.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Most settings for KDE applications are stored in ~/.config/. However, configuring KDE is primarily done through the System Settings application. It can be started from a terminal by executing systemsettings.\n\n"
    },
    {
      "title": "Plasma desktop",
      "level": 4,
      "content": "There are different types of KDE themes, varying by scope of what they modify:\n\n- Global themes, comprehensive packages that can include Plasma themes, application styles, colors, fonts, icons, cursors, splash screens, SDDM themes, and Konsole color schemes. Global themes can be applied with the lookandfeeltool command line tool.\n- Plasma themes, modifying the look of Plasma panels and widgets. These often have a recommended accompanying Kvantum or Aurorae theme to complete the look.\n- Application styles, modifying the look of programs.\n- Application styles that use theme engines such as Kvantum, QtCurve [2], QSvgStyle [3], and Aurorae.\n- #Icon themes, providing icons for applications, files, and actions.\n\nFor easy system-wide installation and updating, some themes are available in both the official repositories and the AUR.\n\nGlobal themes can also be installed through System Settings > Colors & Themes > Global Theme > Get New....\n\nThe recommended theme for a pleasant appearance in GTK applications is breeze-gtk, a GTK theme designed to mimic the appearance of Plasma's Breeze theme. Install kde-gtk-config (part of the plasma group), relogin and select Breeze as the GTK theme in System Settings > Colors & Themes > Application Style > Configure GNOME/GTK Application Style....\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nIn some themes, tooltips in GTK applications have white text on white backgrounds making it difficult to read. To change the colors in GTK2 applications, find the section for tooltips in the .gtkrc-2.0 file and change it. For GTK3 application two files need to be changed, gtk.css and settings.ini.\n\nSome GTK2 programs like vuescan-binAUR still look hardly usable due to invisible checkboxes with the Breeze or Adwaita skin in a Plasma session. To workaround this, install and select e.g. the Numix-Frost-Light skin of the numix-frost-themesAUR under System Settings > Colors & Themes > Application Style > Configure GNOME/GTK Application Style... > GTK theme. Numix-Frost-Light looks similar to Breeze.\n\nPlasma and SDDM will both use images found at /var/lib/AccountsService/icons/ as users' avatars. To configure with a graphical interface, you can use System Settings > Users. The file corresponding to your username can be removed to restore the default avatar.\n\nPlasmoids are widgets for Plasma desktop shell designed to enhance the functionality of desktop, they can be found on the AUR.\n\nPlasmoid scripts can also be installed by right-clicking onto a panel or the desktop and choosing Enter Edit Mode > Add Widgets... > Get New Widgets... > Download New Plasma Widgets. This will present a front-end for https://store.kde.org/ that allows you to install, uninstall, or update third-party Plasmoid scripts with just one click.\n\nInstall plasma-pa or kmix (start Kmix from the Application Launcher). plasma-pa is now installed by default with plasma, no further configuration needed.\n\nAs the Plasma panel is on top of other windows, its shadow is drawn over them. [4] To disable this behaviour without impacting other shadows, install xorg-xprop and run:\n\n```\n$ xprop -remove _KDE_NET_WM_SHADOW\n```\n\nthen select the panel with the plus-sized cursor. [5] For automation, install xorg-xwininfo and create the following script:\n\n```\n/usr/local/bin/kde-no-shadow\n```\n\n```\n#!/bin/bash\nfor WID in $(xwininfo -root -tree | sed '/\"plasmashell\": (\"plasmashell\" \"plasmashell\")/!d; s/^  *\\([^ ]*\\) .*/\\1/g'); do\n   xprop -id $WID -remove _KDE_NET_WM_SHADOW\ndone\n```\n\nMake the script executable.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nThe script can be run on login with Add Login Script in Autostart:\n\n```\n$ kcmshell6 autostart\n```\n\nSee HiDPI#KDE Plasma.\n\n"
    },
    {
      "title": "Plasma Mobile",
      "level": 4,
      "content": "The plasma-phone-settings repository contains several recommended settings which can be applied globally (/etc/xdg) and/or per user (~/.config).\n\n/etc/xdg/kscreenlockerrc (or ~/.config/kscreenlockerrc) locks the screen immediately after login. [6] This is useful in combination with SDDM#Autologin.\n\n```\n/etc/xdg/kscreenlockerrc\n```\n\n```\n[Daemon]\nLockOnStart=true\n```\n\n"
    },
    {
      "title": "Virtual keyboard",
      "level": 4,
      "content": "To use a virtual keyboard in the Wayland session, install maliit-keyboard and enable it in System Settings > Keyboard > Virtual Keyboard.\n\nIf your device has a hardware keyboard, but you want to use the virtual keyboard, add the KWIN_IM_SHOW_ALWAYS=1 environment variable to your Wayland session.\n\nTo use a virtual keyboard in the X11 session, choose an appropriate one from List of applications/Utilities#On-screen keyboards and run it manually.\n\n"
    },
    {
      "title": "Window decorations",
      "level": 4,
      "content": "Window decorations can be found in the AUR.\n\nThey can be changed in System Settings > Colors & Themes > Window Decorations, there you can also directly download and install more themes with one click.\n\n"
    },
    {
      "title": "Icon themes",
      "level": 4,
      "content": "Icon themes can be installed and changed on System Settings > Colors & Themes > Icons.\n\n"
    },
    {
      "title": "Space efficiency",
      "level": 4,
      "content": "The Plasma Netbook shell has been dropped from Plasma 5, see the following KDE forum post. However, you can achieve something similar by editing the file ~/.config/kwinrc adding BorderlessMaximizedWindows=true in the [Windows] section.\n\n"
    },
    {
      "title": "Thumbnail generation",
      "level": 4,
      "content": "To allow thumbnail generation for media or document files on the desktop and in Dolphin, install kdegraphics-thumbnailers and ffmpegthumbs.\n\nThen enable the thumbnail categories for the desktop via right click on the desktop background > Configure Desktop and Wallpaper... > Icons > Configure Preview Plugins....\n\nIn Dolphin, navigate to Configure > Configure Dolphin... > Interface > Previews.\n\n"
    },
    {
      "title": "Night Light",
      "level": 3,
      "content": "Plasma provides a Redshift-like feature (working on both Xorg and Wayland) called Night Light. It makes the colors on the screen warmer to reduce eye strain at the time of your choosing. It can be enabled in System Settings > Colors & Themes > Night Light.\n\n"
    },
    {
      "title": "Printing",
      "level": 3,
      "content": "You can also configure printers in System Settings > Printers. To use this method, you must first install the following packages print-manager, cups, system-config-printer. See CUPS#Configuration.\n\n"
    },
    {
      "title": "Samba/Windows support",
      "level": 3,
      "content": "The Dolphin share functionality requires the package kdenetwork-filesharing and usershares, which the stock smb.conf does not have enabled. Instructions to add them are in Samba#Enable Usershares, after which sharing in Dolphin should work out of the box after restarting Samba.\n\nAccessing Windows shares from Dolphin works out of the box. Use the path smb://servername/share to browse the files.\n\nUnlike GTK file browsers which utilize GVfs also for the launched program, opening files from Samba shares in Dolphin via KIO makes Plasma copy the whole file to the local system first with most programs (VLC is an exception). To workaround this, you can use a GTK based file browser like thunar with gvfs and gvfs-smb (and gnome-keyring for saving login credentials) to access SMB shares in a more able way.\n\nAnother possibility is to mount a Samba share via cifs-utils to make it look to Plasma like if the SMB share was just a normal local folder and thus can be accessed normally. See Samba#Manual mounting and Samba#Automatic mounting.\n\nAn GUI solution is available with samba-mounter-gitAUR, which offers basically the same functionality via an easy to use option located at System Settings > Network Drivers. However, it might break with new KDE Plasma versions.\n\n"
    },
    {
      "title": "KDE Desktop activities",
      "level": 3,
      "content": "KDE Desktop Activities are special workspaces where you can select specific settings for each activity that apply only when you are using said activity.\n\n"
    },
    {
      "title": "Power management",
      "level": 3,
      "content": "Install powerdevil for an integrated Plasma power managing service. This service offers additional power saving features, monitor brightness control (if supported) and battery reporting including peripheral devices.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n"
    },
    {
      "title": "Autostart",
      "level": 3,
      "content": "Plasma can autostart applications and run scripts on startup and shutdown. To autostart an application, navigate to System Settings > Autostart and add the program or shell script of your choice. For applications, a .desktop file will be created, for login scripts, a .desktop file launching the script will be created.\n\n- Programs can be autostarted on login only, whilst shell scripts can also be run on shutdown or even before Plasma itself starts.\n- Shell scripts will only be run if they are marked executable.\n- Shell scripts previously placed in ~/.config/autostart-scripts/ will get automatically migrated to .desktop files.\n\n- Place Desktop entries (i.e. .desktop files) in the appropriate XDG Autostart directory.\n- Place or symlink shell scripts in one of the following directories: ~/.config/plasma-workspace/env/: for executing scripts at login before launching Plasma. ~/.config/plasma-workspace/shutdown/: for executing scripts when Plasma exits.\n\n- ~/.config/plasma-workspace/env/: for executing scripts at login before launching Plasma.\n- ~/.config/plasma-workspace/shutdown/: for executing scripts when Plasma exits.\n\nSee official documentation.\n\n"
    },
    {
      "title": "Phonon",
      "level": 3,
      "content": "From Wikipedia:\n\nPhonon is being widely used within KDE, for both audio (e.g., the System notifications or KDE audio applications) and video (e.g., the Dolphin video thumbnails). It can use the following backends:\n\n- VLC: phonon-qt6-vlc\n- mpv: phonon-qt6-mpv\n- GStreamer: phonon-qt6-gstreamer-gitAUR, see GStreamer#Installation for additional codec support\n\nKDE recommends only the VLC backend, as the GStreamer backend is unmaintained.\n\n- Multiple backends can be installed at once and prioritized via the phononsettings application.\n- According to the KDE forums, the VLC backend lacks support for ReplayGain.\n- If using the VLC backend, you may experience crashes every time Plasma wants to send you an audible warning and in quite a number of other cases as well [8]. A possible fix is to rebuild the VLC plugins cache:\n\n```\n# /usr/lib/vlc/vlc-cache-gen /usr/lib/vlc/plugins\n```\n\n"
    },
    {
      "title": "Backup and restore",
      "level": 3,
      "content": "Plasma stores personalized desktop settings as configuration files in the XDG_CONFIG_HOME folder. Use the detail of configuration files to select and choose a method of backup and restore.\n\n"
    },
    {
      "title": "systemd startup",
      "level": 3,
      "content": "Plasma uses a systemd user instance to launch and manage all the Plasma services. This is the default startup method since Plasma 5.25, but can be disabled to use boot scripts instead with the following command (however this may stop working in a future release):\n\n```\n$ kwriteconfig6 --file startkderc --group General --key systemdBoot false\n```\n\nMore details about the implementation can be read in Edmundson's blog: Plasma and the systemd startup.\n\n"
    },
    {
      "title": "Spell checking",
      "level": 3,
      "content": "KDE applications use sonnet for spell checking. See its optional dependencies for the supported spell checkers.\n\nConfigure it in System Settings > Spell Check.\n\n"
    },
    {
      "title": "Running KWin Wayland on NVIDIA",
      "level": 3,
      "content": "See https://community.kde.org/Plasma/Wayland/Nvidia.\n\n"
    },
    {
      "title": "Applications",
      "level": 2,
      "content": "The KDE project provides a suite of applications that integrate with the Plasma desktop. See the kde-applications group for a full listing of the available applications. Also see Category:KDE for related KDE application pages.\n\nAside from the programs provided in KDE Applications, there are many other applications available that can complement the Plasma desktop. Some of these are discussed below.\n\n"
    },
    {
      "title": "Terminate Xorg server through KDE System Settings",
      "level": 4,
      "content": "Navigate to the submenu System Settings > Keyboard > Advanced (tab) > Key sequence to kill the X server and ensure that the checkbox is ticked.\n\n"
    },
    {
      "title": "KCM",
      "level": 4,
      "content": "KCM stands for KConfig Module. KCMs can help you configure your system by providing interfaces in System Settings, or through the command line with kcmshell6.\n\n- sddm-kcm — KDE Configuration Module for SDDM.\n\n- kde-gtk-config — GTK2 and GTK3 Configurator for KDE.\n\n- wacom tablet — KDE GUI for the Wacom Linux Drivers.\n\nMore KCMs can be found at linux-apps.com.\n\n"
    },
    {
      "title": "Desktop search",
      "level": 3,
      "content": "KDE implements desktop search with a software called Baloo, a file indexing and searching solution.\n\n"
    },
    {
      "title": "Web browsers",
      "level": 3,
      "content": "The following web browsers can integrate with Plasma:\n\n- Konqueror — Part of the KDE project, supports two rendering engines – KHTML and the Chromium-based Qt WebEngine.\n\n- Falkon — A Qt web browser with Plasma integration features, previously known as Qupzilla. It uses Qt WebEngine.\n\n- Chromium — Chromium and its proprietary variant Google Chrome have limited Plasma integration. They can use KWallet and KDE Open/Save windows.\n\n- Firefox — Firefox can be configured to better integrate with Plasma. See Firefox#KDE integration for details.\n\n"
    },
    {
      "title": "PIM",
      "level": 3,
      "content": "KDE offers its own stack for personal information management (PIM). This includes emails, contacts, calendar, etc. To install all the PIM packages, you could use the kde-pim package group or the kde-pim-meta meta package.\n\n"
    },
    {
      "title": "Akonadi",
      "level": 4,
      "content": "Akonadi is a system meant to act as a local cache for PIM data, regardless of its origin, which can be then used by other applications. This includes the user's emails, contacts, calendars, events, journals, alarms, notes, and so on. Akonadi does not store any data by itself: the storage format depends on the nature of the data (for example, contacts may be stored in vCard format).\n\nInstall akonadi. For additional addons, install kdepim-addons.\n\n- If you wish to use a database engine other than MariaDB, then when installing the akonadi package, use the following command to skip installing the mariadb dependencies: # pacman -S akonadi --assume-installed mariadb See also FS#32878.\n- If Akonadi cannot find /usr/bin/mysqld upon first start, it will fall back to using SQLite.\n\n```\n# pacman -S akonadi --assume-installed mariadb\n```\n\nBy default Akonadi will use /usr/bin/mysqld (MariaDB by default, see MySQL for alternative providers) to run a managed MySQL instance with the database stored in ~/.local/share/akonadi/db_data/.\n\nAkonadi supports using the system-wide MySQL for its database.[9]\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QMYSQL\n\n[QMYSQL]\nHost=\nName=akonadi_username\nOptions=\"UNIX_SOCKET=/run/mysqld/mysqld.sock\"\nStartServer=false\n```\n\nAkonadi supports either using the existing system-wide PostgreSQL instance, i.e. postgresql.service, or running a PostgreSQL instance with user privileges and the database in ~/.local/share/akonadi/db_data/.\n\nInstall postgresql and postgresql-old-upgrade.\n\nEdit the Akonadi configuration file so that it has the following contents:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QPSQL\n```\n\n- When Akonadi starts, it will create the [QPSQL] section and set the appropriate variables in it.\n- The database will be stored in ~/.local/share/akonadi/db_data/.\n\nStart Akonadi with akonadictl start, and check its status: akonadictl status.\n\n- Starting with akonadi 19.08.0-1 the PostgreSQL database cluster in ~/.local/share/akonadi/db_data/ will get automatically upgraded when a major PostgreSQL version upgrade is detected.\n- For previous akonadi versions major PostgreSQL version upgrades will require a manual database upgrade. Follow the update instructions on KDE UserBase Wiki. Make sure to adjust the paths to PostgreSQL binaries to those used by postgresql and postgresql-old-upgrade, see PostgreSQL#Upgrading PostgreSQL.\n\nThis requires an already configured and running PostgreSQL.\n\nCreate a PostgreSQL user account for your user:\n\n```\n[postgres]$ createuser username\n```\n\nCreate a database for Akonadi:\n\n```\n[postgres]$ createdb -O username -E UTF8 --locale=C -T template0 akonadi-username\n```\n\nEdit the Akonadi configuration file to match the configuration below:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QPSQL\n\n[QPSQL]\nHost=/run/postgresql\nName=akonadi-username\nStartServer=false\n```\n\nStart Akonadi with akonadictl start, and check its status: akonadictl status.\n\nTo use SQLite, edit the Akonadi configuration file to match the configuration below:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QSQLITE\n```\n\n- When Akonadi starts, it will create the [QSQLITE] section and set the appropriate variables in it.\n- The database will be stored as ~/.local/share/akonadi/akonadi.db.\n\nUsers who want to disable Akonadi would need to not start any KDE applications that rely on it. See this section in the KDE userbase for more information.\n\n"
    },
    {
      "title": "KDE Connect",
      "level": 3,
      "content": "KDE Connect provides several features to connect your Android or iOS phone with your Linux desktop:\n\n- Share files and URLs to/from KDE from/to any app, without wires.\n- Touchpad emulation: Use your phone screen as your computer's touchpad.\n- Notifications sync (4.3+): Read your Android notifications from the desktop.\n- Shared clipboard: copy and paste between your phone and your computer.\n- Multimedia remote control: Use your phone as a remote for Linux media players.\n- Wi-Fi connection: no usb wire or bluetooth needed.\n- RSA Encryption: your information is safe.\n\nYou will need to install KDE Connect both on your computer and on your phone. For PC, install kdeconnect package. For Android, install KDE Connect from Google Play or from F-Droid. If you want to browse your phone's filesystem, you need to install sshfs as well and configure filesystem exposes in your Android app. For iOS, install KDE Connect from the App Store. Not all features from the Android version are available on the iOS version.\n\nTo use remote input functionality on a Plasma Wayland session, the xdg-desktop-portal package is required.\n\nIt is possible to use KDE Connect even if you do not use the Plasma desktop. For GNOME users, better integration can be achieved by installing gnome-shell-extension-gsconnectAUR instead of kdeconnect. To start the KDE Connect daemon manually, execute /usr/bin/kdeconnectd.\n\nIf you use a firewall, you need to open UDP and TCP ports 1714 through 1764.\n\nSometimes, KDE Connect will not detect a phone. You can restart the services by running killall kdeconnectd and then opening kdeconnect in system settings or running kdeconnect-cli --refresh followed by kdeconnect-cli -l. You can also use Pair new device > Add devices by IP on KDE Connect for Android.\n\n"
    },
    {
      "title": "Use a different window manager",
      "level": 3,
      "content": "It is possible to use a window manager other than KWin with Plasma. This allows you to combine the functionality of the KDE desktop with the utility of a tiling window manager, which may be more fleshed out than KWin tiling scripts.\n\nThe component chooser settings in Plasma no longer allows changing the window manager, but you are still able to swap KWin via other methods.\n\n"
    },
    {
      "title": "Replacing KWin service",
      "level": 4,
      "content": "Since KDE 5.25, Plasma's systemd based startup is enabled by default.\n\nTo replace KWin in this startup, you must first mask the plasma-kwin_x11.service for the current user to prevent it from starting.\n\nThen, create a new systemd user unit to start your preferred WM [10]:\n\n```\n~/.config/systemd/user/plasma-custom-wm.service\n```\n\n```\n[Install]\nWantedBy=plasma-workspace.target\n\n[Unit]\nDescription=Plasma Custom Window Manager\nBefore=plasma-workspace.target\n\n[Service]\nExecStart=/path/to/other/wm\nSlice=session.slice\nRestart=on-failure\n```\n\nTo use it, do (as user units) a daemon-reload, make sure you have masked plasma-kwin_x11.service then enable the newly created plasma-custom-wm.service.\n\n"
    },
    {
      "title": "Using script-based boot and KDEWM",
      "level": 4,
      "content": "Plasma's script-based boot is used by disabling #systemd startup. If you have done so, you can change the window manager by setting the KDEWM environment variable before Plasma is invoked.\n\nNote: **This article or section is a candidate for merging with Environment variables#Globally.** This article or section is a candidate for merging with Environment variables#Globally.\n\nThis article or section is a candidate for merging with Environment variables#Globally.\n\nIf you have root access, you can also add an XSession that will be available to all users as an option on the login screen.\n\nFirst, create a script with execution permissions as follows:\n\n```\n/usr/local/bin/plasma-i3.sh\n```\n\n```\n#!/bin/sh\nexport KDEWM=/usr/bin/i3\n/usr/bin/startplasma-x11\n```\n\nReplace /usr/bin/i3 to the path to your preferred WM. Ensure the path is correctly set. If KDE is unable to start the window manager, the session will fail and the user will be returned to the login screen.\n\nThen, to add an XSession, add a file in /usr/share/xsessions/ with the following content:\n\n```\n/usr/share/xsessions/plasma-i3.desktop\n```\n\n```\n[Desktop Entry]\nType=XSession\nExec=/usr/local/bin/plasma-i3.sh\nDesktopNames=KDE\nName=Plasma (i3)\nComment=KDE Plasma with i3 as the WM\n```\n\n"
    },
    {
      "title": "KDE/Openbox session",
      "level": 4,
      "content": "The openbox package provides a session for using KDE with Openbox. To make use of this session, disable #systemd startup and select KDE/Openbox from the display manager menu.\n\nFor those starting the session manually, add the following line to your xinit configuration:\n\n```\n~/.xinitrc\n```\n\n```\nexec openbox-kde-session\n```\n\n"
    },
    {
      "title": "KWin tiling window scripts",
      "level": 3,
      "content": "A list of KWin extensions that can be used to make KDE behave more like a tiling window manager.\n\n- Polonium — An (unofficial) successor to Bismuth\n\n- Kröhnkite — A dynamic tiling extension inspired by dwm.\n\n- KZones — A script that mimicks the behavior of Microsoft PowerToys and Windows 11 snap layouts.\n\n"
    },
    {
      "title": "Configuring monitor resolution / multiple monitors",
      "level": 3,
      "content": "To enable display resolution management and multiple monitors in Plasma, install kscreen. This provides additional options to System Settings > Display & Monitor.\n\n"
    },
    {
      "title": "Configuring ICC profiles",
      "level": 3,
      "content": "On X11, ICC profiles are handled by colord. To configure them in Plasma, install colord-kde. This provides additional options in System Settings > Color Management. ICC profiles can be imported using Import Profile.\n\nFor Wayland sessions, color management is handled by the compositor, i.e. KWin for Plasma. In this case, no additional package is required. The color profile can be configured per monitor in System Settings > Display & Monitor > Color Profile.\n\n"
    },
    {
      "title": "HDR",
      "level": 3,
      "content": "HDR support is experimental and only works in a Wayland session. System Settings > Display & Monitor > High Dynamic Range > Enable HDR.\n\nFor more information see Xaver Hugl's blog post and HDR monitor support.\n\nNote: **This article or section is a candidate for merging with HDR monitor support.** This article or section is a candidate for merging with HDR monitor support.\n\nThis article or section is a candidate for merging with HDR monitor support.\n\nThings that work:\n\n"
    },
    {
      "title": "Games",
      "level": 4,
      "content": "Until upstream APIs are finalized, some games require a special Vulkan layer to function vk-hdr-layer-kwin6-gitAUR. Gamescope does not require this layer, as it has support for the frog HDR protocol directly.\n\n- Launch Steam with HDR enabled. All games will then have HDR enabled, but Steam and all games will be launched inside a gamescope window.\n\n```\n$ gamescope --hdr-enabled --steam -- env DXVK_HDR=1 steam\n```\n\n- In Steam, to enable HDR for a single game, set the following Launch options:\n\n```\nDXVK_HDR=1 gamescope -f --hdr-enabled -- %command%\n```\n\n- To launch a non-Steam game within gamescope:\n\n```\n$ DXVK_HDR=1 gamescope -f --hdr-enabled -- executable\n```\n\n- Launch a Windows application with HDR enabled using Wine on Wayland\n\n```\n$ ENABLE_HDR_WSI=1 DXVK_HDR=1 DISPLAY= wine executable.exe\n```\n\n- Run RetroArch with HDR support (must enable HDR in video settings inside of RetroArch as well). Currently only supported on the git release, available here retroarch-gitAUR.\n\n```\n$ ENABLE_HDR_WSI=1 retroarch\n```\n\n- Run native games with HDR (Quake II RTX)\n\n```\n$ ENABLE_HDR_WSI=1 SDL_VIDEODRIVER=wayland quake2rtx\n```\n\n"
    },
    {
      "title": "Video",
      "level": 4,
      "content": "There are multiple ways to play HDR content with mpv.\n\n- For mpv versions before 0.40 and Mesa version before 25.1, install vk-hdr-layer-kwin6-gitAUR. Then, run the following command with HDR enabled[11]:\n\n```\n$ ENABLE_HDR_WSI=1 mpv --vo=gpu-next --target-colorspace-hint --gpu-api=vulkan --gpu-context=waylandvk \"path/to/video\"\n```\n\n- For mpv versions after 0.40, Wayland HDR support is automatically enabled with the dmabuf-wayland, drm video outputs, and using gpu-next with Vulkan Video Decoding\n\n```\n$ mpv --vo=dmabuf-wayland \"path/to/video\"\n```\n\n- From the tty terminal, one could do\n\n```\n$ mpv --vo=drm \"path/to/video\"\n```\n\n- With Vulkan Video Decoding\n\n```\n$ mpv --vo=gpu-next --gpu-api=vulkan --gpu-context=waylandvk --hwdec=vulkan --target-colorspace-hint \"path/to/video\"\n```\n\n"
    },
    {
      "title": "Disable opening application launcher with Super key (Windows key)",
      "level": 3,
      "content": "To disable this feature, you currently have to edit the kwinrc config file and set the Meta key under ModifierOnlyShortcuts to an empty string:\n\n```\n$XDG_CONFIG_HOME/kwinrc\n```\n\n```\n[ModifierOnlyShortcuts]\nMeta=\n```\n\nAlternatively, you can also run the following command:\n\n```\n$ kwriteconfig6 --file kwinrc --group ModifierOnlyShortcuts --key Meta \"\"\n```\n\n"
    },
    {
      "title": "Disable bookmarks showing in application menu",
      "level": 3,
      "content": "With the Plasma Browser integration installed, KDE will show bookmarks in the application launcher.\n\nTo disable this feature, go to System Settings > Search > Plasma Search and uncheck Bookmarks.\n\n"
    },
    {
      "title": "IBus Integration",
      "level": 3,
      "content": "IBus is an input method framework and can be integrated into KDE. See IBus#Integration for details.\n\nUsing IBus may be required when using KDE on Wayland to offer accented characters and dead keys support [12].\n\n"
    },
    {
      "title": "Enable hotspot in plasma-nm",
      "level": 3,
      "content": "See NetworkManager#Sharing internet connection over Wi-Fi.\n\n"
    },
    {
      "title": "Restore previous saved session",
      "level": 3,
      "content": "If you have System Settings > Session > Desktop Session > Session Restore > On login, launch apps that were open: On last logout (default) selected, ksmserver (KDE's session manager) will automatically save/load all open applications to/from ~/.config/ksmserverrc on logout/login.\n\n"
    },
    {
      "title": "Receive local mail in KMail",
      "level": 3,
      "content": "If you have set up local mail delivery with a mail server that uses the Maildir format, you may want to receive this mail in KMail. To do so, you can re-use KMail's default receiving account \"Local Folders\" that stores mail in ~/.local/share/local-mail/.\n\nSymlink the ~/Maildir directory (where Maildir format mail is commonly delivered) to the Local Folders' inbox:\n\n```\n$ ln -s .local/share/local-mail/inbox ~/Maildir\n```\n\nAlternatively, add a new receiving account with the type Maildir and set ~/Maildir as its directory.\n\n"
    },
    {
      "title": "Configure Plasma for all users",
      "level": 3,
      "content": "Edit config/main.xml files in the /usr/share/plasma. For example, to configure the Application Launcher for all users, edit /usr/share/plasma/plasmoids/org.kde.plasma.kickoff/contents/config/main.xml. To prevent the files from being overwritten with package updates, add the files to Pacman's NoUpgrade\n\n"
    },
    {
      "title": "Disable hibernate",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Power management.** This article or section is a candidate for merging with Power management.\n\nThis article or section is a candidate for merging with Power management.\n\nProperly disable the hibernate feature and hide it from the menu with a Polkit policy rule.\n\n```\n/etc/polkit-1/rules.d/99-disable-hibernate.rules\n```\n\n```\n// Disable hibernate for all users\npolkit.addRule(function(action, subject) {\n   if ((action.id == \"org.freedesktop.login1.hibernate\")) {\n      return polkit.Result.NO;\n   }\n});\npolkit.addRule(function(action, subject) {\n   if ((action.id == \"org.freedesktop.login1.hibernate-multiple-sessions\")) {\n      return polkit.Result.NO;\n   }\n});\n```\n\nAlternatively, add the following lines to a file in /etc/systemd/sleep.conf.d/:\n\n```\n/etc/systemd/sleep.conf.d/00-disable-hibernation.conf\n```\n\n```\n[Sleep]\nAllowHibernation=no\nAllowSuspendThenHibernate=no\nAllowHybridSleep=no\n```\n\n"
    },
    {
      "title": "Using window rules",
      "level": 3,
      "content": "Kwin has the ability to specify rules for specific windows/applications. For example, you can force enable the window titlebar even if the application developer decided that there should not be one. You can set such rules as specific starting position, size, minimize state, keeping above/below others and so on.\n\nTo create a rule you can press Alt+F3 when the window of interest is in focus. Then, in More Actions > Configure special application/window settings, you can set the desired property. A list of created rules is available from System Settings > Window Management > Window Rules.\n\n"
    },
    {
      "title": "Mount network shares in fixed location",
      "level": 3,
      "content": "By default KDE mount manager (kio-fuse) will mount network shares to ${XDG_RUNTIME_DIR}/kio-fuse-6-char-random-string.\n\nCreate directory, e.g. mnt_kio in your home directory:\n\n```\n$ mkdir ~/mnt_kio\n```\n\nOverride default kio-fuse.service using a drop-in file:\n\n```\n~/.config/systemd/user/kio-fuse.service.d/mountpoint.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=/usr/lib/kio-fuse -f %h/mnt_kio\n```\n\nNow if you mount your network shares via dbus or by openning some file from remote share in Dolphin:\n\n```\n$ dbus-send --session --print-reply --type=method_call \\\n          --dest=org.kde.KIOFuse \\\n                 /org/kde/KIOFuse \\\n                 org.kde.KIOFuse.VFS.mountUrl \"smb://etcetc\"\n```\n\nThey will be mounted to ~/mnt_kio.\n\n"
    },
    {
      "title": "Locally Integrated Menu",
      "level": 3,
      "content": "To have the menu bar integrated with the title bar, install material-kwin-decoration-gitAUR from the AUR, then in System Settings > Window Decorations, select 'Material' and add the Application Menu button to the title bar (preferably as second from the left). Works only on X11 session.\n\n"
    },
    {
      "title": "Pre-authorize remote control on Wayland",
      "level": 3,
      "content": "Xdg-desktop-portal-kde has support for remote input from a remote desktop session, a virtual KVM switch, kde-connect, emulated devices like a controller using steam-input, etc. This authorization is lost after the application or the desktop-portal is restarted, which causes the \"Remote control requested\" window pop up every time and makes unattended access impossible.\n\nAs of plasma version 6.3, a permission system was implemented, which allows to pre-authorize applications. Currently, the permission api is only available through the flatpak cli, although applications do not need to run as a flatpak to be able to get pre-authorized.\n\nAs per the upstream docs and flatpak-permission-set man pages, you need to figure out if the application you want to authorize sets an application ID or not. If started through a runner like krunner, it gets set by plasma and is usually the filename of the .desktop-file under /usr/share/applications.\n\nFor example, to pre-authorize a virtual KVM switch like lan-mouse, you would do:\n\n```\n$ flatpak permission-set kde-authorized remote-desktop de.feschbar.LanMouse yes\n```\n\nIf you start it as a daemon in a systemd user-unit, you should use the name of that unit instead:\n\n```\n$ flatpak permission-set kde-authorized remote-desktop lan-mouse yes\n```\n\nIf you application does not set an ID, you can leave that field empty:\n\n```\n$ flatpak permission-set kde-authorized remote-desktop \"\" yes\n```\n\n"
    },
    {
      "title": "KDE applications fail to start in GNOME after upgrade to KDE 6",
      "level": 3,
      "content": "Wayland is used by default for KDE 6 applications, and the KDE applications fail to work under GNOME Wayland (and potentially other DEs/WMs) in this scenario. This can be fixed by setting the QT_QPA_PLATFORM=xcb environment variable.\n\nThis is a workaround for KDE bugs and not a problem with Wayland itself.\n\n"
    },
    {
      "title": "KDE icons missing after upgrade to KDE 6",
      "level": 3,
      "content": "After the last upgrade to KDE 6 you may notice issues with all of the KDE icons not displaying. Newly created accounts showed them just fine.\n\nThe issue for this is that the theme got lost while upgrading and had to be reassigned manually. For this go to System Settings > Colors & Themes > Icons and select the theme you would like to use for the icons again.\n\n"
    },
    {
      "title": "qt5ct and kvantum bugs after upgrade",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nLatest update might cause incompatible HiDPI scaling that made some interfaces becomes too big for your screen, some icons are missing or can not be displayed, and missing panels or widgets.\n\nTry to remove qt5ct and kvantum related package, then apply default global Plasma theme. If the problem persists, try clearing all your KDE configuration and reinstalling plasma to overwrite the configuration. Be sure to check HiDPI scaling in KDE system settings as well.\n\n"
    },
    {
      "title": "Fonts are huge or seem disproportional",
      "level": 3,
      "content": "Try to force font DPI to 96 in System Settings > Text & Fonts > Fonts.\n\nIf that does not work, try setting the DPI directly in your Xorg configuration as documented in Xorg#Setting DPI manually.\n\n"
    },
    {
      "title": "Configuration related",
      "level": 3,
      "content": "Many problems in KDE are related to its configuration.\n\n"
    },
    {
      "title": "Plasma desktop behaves strangely",
      "level": 4,
      "content": "Plasma problems are usually caused by unstable Plasma widgets (colloquially called plasmoids) or Plasma themes. First, find which was the last widget or theme you had installed and disable or uninstall it.\n\nSo, if your desktop suddenly exhibits \"locking up\", this is likely caused by a faulty installed widget. If you cannot remember which widget you installed before the problem began (sometimes it can be an irregular problem), try to track it down by removing each widget until the problem ceases. Then you can uninstall the widget, and file a bug report on the KDE bug tracker only if it is an official widget. If it is not, it is recommended to find the entry on the KDE Store and inform the developer of that widget about the problem (detailing steps to reproduce, etc.).\n\nIf you cannot find the problem, but you do not want all the settings to be lost, navigate to ~/.config/ and run the following command:\n\n```\n$ for j in plasma*; do mv -- \"$j\" \"${j%}.bak\"; done\n```\n\nThis command will rename all Plasma related configuration files to *.bak (e.g. plasmarc.bak) of your user and when you will relogin into Plasma, you will have the default settings back. To undo that action, remove the .bak file extension. If you already have *.bak files, rename, move, or delete them first. It is highly recommended that you create regular backups anyway. See Synchronization and backup programs for a list of possible solutions.\n\n"
    },
    {
      "title": "Clean cache to resolve upgrade problems",
      "level": 4,
      "content": "The problem may be caused by old cache. Sometimes, after an upgrade, the old cache might introduce strange, hard to debug behaviour such as unkillable shells, hangs when changing various settings, Ark being unable to extract archives or Amarok not recognizing any of your music. This solution can also resolve problems with KDE and Qt applications looking bad after an update.\n\nRebuild the cache using the following commands:\n\n```\n$ rm ~/.config/Trolltech.conf\n$ kbuildsycoca6 --noincremental\n```\n\nOptionally, empty the ~/.cache/ folder contents, however, this will also clear the cache of other applications:\n\n```\n$ rm -rf ~/.cache/*\n```\n\nSometimes, empty the ~/.cache/ folder does not work, for example, if you encountered the following error:\n\n```\nkf.service.sycoca: The menu spec file ( \"\" ) contains a Layout or DefaultLayout tag without the mandatory Merge tag inside. Please fix it.\n```\n\nIt might be something related to outdated configuration files. In the above case, moving ~/.config/menus/ folder away may fix the issue. In other cases, try moving each file out of ~/.config/menus/ folder could be a good way to check what triggers the error.\n\n"
    },
    {
      "title": "Plasma desktop does not respect locale/language settings",
      "level": 4,
      "content": "Plasma desktop may use different settings than you set at KDE System Settings panel, or in locale.conf (per Locale#Variables). First thing to do is log out and log in after removing ~/.config/plasma-localerc, if this does not fix the issue, try to edit the file manually. For example, to set LANG variable to es_ES.UTF-8 and the LC_MESSAGES variable to en_US.UTF-8:\n\n```\n~/.config/plasma-localerc\n```\n\n```\n[Formats]\nLANG=es_ES.UTF-8\n\n[Translations]\nLANGUAGE=en_US\n```\n\n"
    },
    {
      "title": "Cannot change theme, icons, fonts, colors in systemsettings; most icons are not displayed",
      "level": 4,
      "content": "Make sure that QT_QPA_PLATFORMTHEME environment variable is unset, the command printenv QT_QPA_PLATFORMTHEME should show empty output. Otherwise if you had an environment set (most likely qt5ct or qt6ct) the variable will force qt5ct/qt6ct settings upon Qt applications, the command export QT_QPA_PLATFORMTHEME= should unset the environment.\n\nAn easier (and more reliable) solution can be to uninstall completely qt5ct and qt6ct.\n\n"
    },
    {
      "title": "Volume control, notifications or multimedia keys do not work",
      "level": 4,
      "content": "Hiding certain items in the System Tray settings (e.g. Audio Volume, Media Player or Notifications) also disables related features. Hiding the Audio Volume disables volume control keys, Media Player disables multimedia keys (rewind, stop, pause) and hiding Notifications disables showing notifications.\n\n"
    },
    {
      "title": "Login Screen KCM does not sync cursor settings to SDDM",
      "level": 4,
      "content": "The Login Screen KCM reads your cursor settings from ~/.config/kcminputrc, without this file no settings are synced. The easiest way to generate this file is to change your cursor theme in System Settings > Colors & Themes > Cursors, then change it back to your preferred cursor theme.\n\n"
    },
    {
      "title": "Missing panels/widgets",
      "level": 4,
      "content": "A crash or hardware change can modify the screen numbers, even on a single monitor setup. The panels/widgets can be missing after such an event, this can be fixed in the ~/.config/plasma-org.kde.plasma.desktop-appletsrc file by changing the lastScreen values.\n\n"
    },
    {
      "title": "Graphical problems",
      "level": 3,
      "content": "Make sure you have the proper driver for your GPU installed. See Xorg#Driver installation for more information. If you have an older card, it might help to #Disable desktop effects manually or automatically for defined applications or #Disable compositing.\n\n"
    },
    {
      "title": "Getting current state of KWin for support and debug purposes",
      "level": 4,
      "content": "This command prints out a summary of the current state of KWin including used options, used compositing backend and relevant OpenGL driver capabilities. See more on Martin's blog.\n\n```\n$ qdbus6 org.kde.KWin /KWin org.kde.KWin.supportInformation\n```\n\n"
    },
    {
      "title": "Disable desktop effects manually or automatically for defined applications",
      "level": 4,
      "content": "Plasma has desktop effects enabled by default and e.g. not every game will disable them automatically. You can disable desktop effects in System Settings > Window Management > Desktop Effects and you can toggle desktop effects with Alt+Shift+F12.\n\nAdditionally, you can create custom KWin rules to automatically disable/enable compositing when a certain application/window starts under System Settings > Window Management > Window Rules.\n\n"
    },
    {
      "title": "Enable transparency",
      "level": 4,
      "content": "If you use a transparent background without enabling the compositor, you will get the message:\n\n```\nThis color scheme uses a transparent background which does not appear to be supported on your desktop\n```\n\nIn System Settings > Display & Monitor > Compositor, check Compositing: Enable on startup and restart Plasma.\n\n"
    },
    {
      "title": "Disable compositing",
      "level": 4,
      "content": "In System Settings > Display & Monitor > Compositor, uncheck Compositing: Enable on startup and restart Plasma.\n\n"
    },
    {
      "title": "Flickering in fullscreen when compositing is enabled",
      "level": 4,
      "content": "In System Settings > Display & Monitor > Compositor, uncheck Compositing: Allow applications to block compositing. This may harm performance.\n\n"
    },
    {
      "title": "Effects such as Expose, Overview and Desktop Grid are jerky",
      "level": 4,
      "content": "Setting the environment variable QSG_USE_SIMPLE_ANIMATION_DRIVER for KWIN reduces jerking in some Quick Scene Graphics based effects. For this purpose, it is sufficient to create a drop-in for the service running KWIN:\n\n```\n/etc/systemd/user/plasma-kwin_x11.service.d/10-kwin_QSG_SAD.conf\n```\n\n```\n[Service]\nEnvironment=\"QSG_USE_SIMPLE_ANIMATION_DRIVER=1\"\n```\n\n(in the case of Wayland session, use plasma-kwin_wayland.service.d as directory name)\n\nThen restart the session.\n\nAnother try is to set QSG_NO_VSYNC instead of QSG_USE_SIMPLE_ANIMATION_DRIVER.\n\n"
    },
    {
      "title": "Plasma cursor sometimes shown incorrectly",
      "level": 4,
      "content": "Create the directory ~/.local/share/icons/default/ (alternatively, ~/.icons/default), then, inside it, create a file named index.theme, then add to it the following contents:\n\n```\n~/.local/share/icons/default/index.theme\n```\n\n```\n[Icon Theme]\nInherits=breeze_cursors\n```\n\nIf applicable, replace breeze_cursors with the cursor theme you use (cursor themes can be found in /usr/share/icons/, e.g. Breeze_Light).\n\nOn Wayland, it is necessary for xdg-desktop-portal-gtk to be installed for GTK/GNOME applications to correctly apply cursor themes.\n\nFirefox and Thunderbird running under Wayland will refer to GSettings to determine which cursor to display.\n\nTo sync KDE settings to GTK applications, install kde-gtk-config.\n\nIf you do not want to install an extra package, you can set the cursor theme manually:\n\n```\n$ gsettings set org.gnome.desktop.interface cursor-theme cursor-theme-name\n```\n\n"
    },
    {
      "title": "Cursor jerking/flicking when changing roles (e.g., when mousing over hyperlinks)",
      "level": 4,
      "content": "Try installing the appropriate 2D acceleration driver for your system and window manager.\n\n"
    },
    {
      "title": "Unusable screen resolution set",
      "level": 4,
      "content": "Your local configuration settings for kscreen can override those set in xorg.conf. Look for kscreen configuration files in ~/.local/share/kscreen/ and check if mode is being set to a resolution that is not supported by your monitor.\n\n"
    },
    {
      "title": "Blurry icons in system tray",
      "level": 4,
      "content": "In order to add icons to tray, applications often make use of the library appindicator. If your icons are blurry, check which version of libappindicator you have installed. If you only have libappindicator-gtk2 installed, you can install libappindicator-gtk3 as an attempt to get clear icons.\n\n"
    },
    {
      "title": "Cannot change screen resolution when running in a virtual machine",
      "level": 4,
      "content": "When running Plasma in a VMware, VirtualBox or QEMU virtual machine, kscreen may not allow changing the guest's screen resolution to a resolution higher than 800×600.\n\nThe workaround is to set the PreferredMode option in xorg.conf.d(5). Alternatively try using a different graphics adapter in the VM, e.g. VBoxSVGA instead of VMSVGA for VirtualBox and Virtio instead of QXL for QEMU. See KDE Bug 407058 for details.\n\n"
    },
    {
      "title": "Dolphin, Kate, etc. stuck long time when opening",
      "level": 4,
      "content": "Check whether your user directories (Documents, Downloads, etc.) are read-only.\n\n"
    },
    {
      "title": "Spectacle screenshot uses old screen state",
      "level": 4,
      "content": "In System Settings > Display & Monitor > Compositor, change Keep window thumbnails from Only from Shown windows to Never. If you're on Intel graphics, ensure that xf86-video-intel is not installed.\n\n"
    },
    {
      "title": "Poor font rendering in GTK applications",
      "level": 4,
      "content": "See XDG Desktop Portal#Poor font rendering in GTK applications on KDE Plasma.\n\n"
    },
    {
      "title": "Improper window resizing",
      "level": 4,
      "content": "You may observe that windows of some applications do not resize properly, but rather, the resized portion is transparent and mouse clicks are sent to the underlying window. To correct this behavior, change KDE's GTK3 theme to something other than oxygen-gtk.\n\n"
    },
    {
      "title": "Random lockups while using modesetting or nouveau driver for old nvidia cards",
      "level": 4,
      "content": "See Nouveau#Random_lockups_with_kernel_error_messages\n\n"
    },
    {
      "title": "No sound after suspend",
      "level": 4,
      "content": "If there is no sound after suspending and KMix does not show audio devices which should be there, restarting plasmashell and pulseaudio may help:\n\n```\n$ killall plasmashell\n$ systemctl --user restart pulseaudio.service\n$ plasmashell\n```\n\nSome applications may also need to be restarted in order for sound to play from them again.\n\n"
    },
    {
      "title": "MP3 files cannot be played when using the GStreamer Phonon backend",
      "level": 4,
      "content": "This can be solved by installing the GStreamer libav plugin (package gst-libav). If you still encounter problems, you can try changing the Phonon backend used by installing another such as phonon-qt6-vlc.\n\nThen, make sure the backend is preferred via phononsettings.\n\n"
    },
    {
      "title": "No volume control icon in tray and cannot adjust sound by function key",
      "level": 4,
      "content": "Check if you have plasma-pa installed.\n\n"
    },
    {
      "title": "No sound after a short time",
      "level": 4,
      "content": "If journalctl -p4 -t pulseaudio contains entries saying Failed to create sink input: sink is suspended, try commenting the following line in /etc/pulse/default.pa:\n\n```\n#load-module module-suspend-on-idle\n```\n\nIf the issue persists, plasma-meta or plasma may have installed pulseaudio alongside wireplumber. To fix the issue, replace pulseaudio with pipewire-pulse. If pulseaudio is preferred, replace wireplumber with pipewire-media-session. See PipeWire#PulseAudio clients and this forum thread for more details.\n\n"
    },
    {
      "title": "No Suspend/Hibernate options",
      "level": 4,
      "content": "If your system is able to suspend or hibernate using systemd but do not have these options shown in KDE, make sure powerdevil is installed.\n\n"
    },
    {
      "title": "No power profile options",
      "level": 4,
      "content": "Make sure you installed powerdevil and power-profiles-daemon. Run powerprofilesctl and check the driver. If it is intel_pstate or amd_pstate, you are done, otherwise see CPU frequency scaling#Scaling drivers for more information on enabling them.\n\n"
    },
    {
      "title": "Clean Akonadi configuration to fix KMail",
      "level": 4,
      "content": "See [13] for details.\n\nIf you want a backup, copy the following configuration directories:\n\n```\n$ cp -a ~/.local/share/akonadi ~/.local/share/akonadi-old\n$ cp -a ~/.config/akonadi ~/.config/akonadi-old\n```\n\n"
    },
    {
      "title": "Empty IMAP inbox in KMail",
      "level": 4,
      "content": "For some IMAP accounts KMail will show the inbox as a top-level container (so it will not be possible to read messages there) with all other folders of this account inside.[14]. To solve this problem simply disable the server-side subscriptions in the KMail account settings.\n\n"
    },
    {
      "title": "Authorization error for EWS account in KMail",
      "level": 4,
      "content": "While setting up EWS account in KMail, you may keep getting errors about failed authorization even for valid and fully working credentials. This is likely caused by broken communication between KWallet and KMail. To workaround the issue set a passsword via qdbus:\n\n```\n$ qdbus6 org.freedesktop.Akonadi.Resource.akonadi_ews_resource_0 /Settings org.kde.Akonadi.Ews.Wallet.setPassword \"XXX\"\n```\n\n"
    },
    {
      "title": "Aggressive QXcbConnection / kscreen.xcb.helper journal logging",
      "level": 3,
      "content": "See Qt#Disable/Change Qt journal logging behaviour.\n\n"
    },
    {
      "title": "KF5/Qt 5 applications do not display icons in i3/FVWM/awesome",
      "level": 3,
      "content": "See Qt#Configuration of Qt 5/6 applications under environments other than KDE Plasma.\n\n"
    },
    {
      "title": "Problems with saving credentials and persistently occurring KWallet dialogs",
      "level": 3,
      "content": "It is not recommended to turn off the KWallet password saving system in the user settings as it is required to save encrypted credentials like Wi-Fi passphrases for each user. Persistently occuring KWallet dialogs can be the consequence of turning it off.\n\nIn case you find the dialogs to unlock the wallet annoying when applications want to access it, you can let the display managers SDDM and LightDM unlock the wallet at login automatically, see KDE Wallet#Unlock KDE Wallet automatically on login. The first wallet needs to be generated by KWallet (and not user-generated) in order to be usable for system program credentials.\n\nIn case you want the wallet credentials not to be opened in memory for every application, you can restrict applications from accessing it with kwalletmanager in the KWallet settings.\n\nIf you do not care for credential encryption at all, you can simply leave the password forms blank when KWallet asks for the password while creating a wallet. In this case, applications can access passwords without having to unlock the wallet first.\n\n"
    },
    {
      "title": "Discover does not show any applications",
      "level": 3,
      "content": "This can be solved by installing packagekit-qt6 or packagekit-qt5 depending on your Plasma/Qt version.\n\n"
    },
    {
      "title": "Discover stops showing updates from Arch repositories",
      "level": 3,
      "content": "Discover sometimes will not remove its PackageKit alpm lock. To release it, remove /var/lib/PackageKit/alpm/db.lck. Use \"Refresh\" in Discover and updates should appear (if there are any updates pending).\n\n"
    },
    {
      "title": "High CPU usage of kscreenlocker_greet with NVIDIA drivers",
      "level": 3,
      "content": "As described in KDE Bug 347772 NVIDIA OpenGL drivers and QML may not play well together with Qt 5. This may lead kscreenlocker_greet to high CPU usage after unlocking the session. To work around this issue, set the QSG_RENDERER_LOOP environment variable to basic.\n\nThen kill previous instances of the greeter with killall kscreenlocker_greet.\n\n"
    },
    {
      "title": "OS error 22 when running Akonadi on ZFS",
      "level": 3,
      "content": "If your home directory is on a ZFS pool, create a ~/.config/akonadi/mysql-local.conf file with the following contents:\n\n```\n[mysqld]\ninnodb_use_native_aio = 0\n```\n\nSee MariaDB#OS error 22 when running on ZFS.\n\n"
    },
    {
      "title": "Some programs are unable to scroll when their windows are inactive",
      "level": 3,
      "content": "This is caused by the problematic way of GTK3 handling mouse scroll events. A workaround for this is to set environment variable GDK_CORE_DEVICE_EVENTS=1. However, this workaround also breaks touchpad smooth scrolling and touchscreen scrolling.\n\n"
    },
    {
      "title": "TeamViewer behaves slowly",
      "level": 3,
      "content": "When using TeamViewer, it may behave slowly if you use smooth animations (such as windows minimizing). See #Disable compositing as a workaround.\n\n"
    },
    {
      "title": "Kmail, Kontact and Wayland",
      "level": 3,
      "content": "Kmail may become unresponsive, show a black messageviewer or similar, often after having been minimized and restored. A workaround may be to set environment variable QT_QPA_PLATFORM=\"xcb;wayland\". See KDE Bug 397825.\n\n"
    },
    {
      "title": "Unlock widgets (Plasma ≥ 5.18)",
      "level": 3,
      "content": "If you previously locked your widgets, you will probably find yourself unable to unlock them again. You just have to run this command to do so:\n\n```\n$ qdbus6 org.kde.plasmashell /PlasmaShell evaluateScript \"lockCorona(false)\"\n```\n\nThe new Customize Layout does not require to lock them back up but if want to do that:\n\n```\n$ qdbus6 org.kde.plasmashell /PlasmaShell evaluateScript \"lockCorona(true)\"\n```\n\n"
    },
    {
      "title": "KIO opens URLs with the wrong program",
      "level": 3,
      "content": "Check file associations regarding HTML, PHP, etc... and change it to a browser. KIO's cache files are located in $HOME/.cache/kioexec. See also xdg-utils#URL scheme handlers.\n\n"
    },
    {
      "title": "Lock the screen before suspending and hibernating",
      "level": 3,
      "content": "In the System Settings application, KDE offers a setting to automatically lock the screen after waking up from sleep. Upon resuming, some users report that the screen is briefly showed before locking. To prevent this behavior and have KDE lock the screen before suspending, create a hook in systemd(1) by creating the following file as the root user:\n\n```\n/usr/lib/systemd/system-sleep/lock_before_suspend.sh\n```\n\n```\n#!/bin/bash\n\ncase $1/$2 in\n    pre/*)\n        case $2 in\n            suspend|hibernate)\n                loginctl lock-session\n                sleep 1\n                ;;\n            esac\n        ;;\nesac\n```\n\nThe use of sleep is necessary in order for the loginctl lock-session command to complete before the device is suspended. Using a lower timeout may not allow for this to complete.\n\nAfter creating the file, make it executable.\n\nFinally, make sure that the KDE setting is enabled by going to System Settings > Screen Locking and checking the Lock screen automatically: After waking from sleep checkbox.\n\n"
    },
    {
      "title": "X11 shortcuts conflict on Wayland",
      "level": 3,
      "content": "Some X11 software like freerdp can grab keyboard input since KDE 5.27. Others like VMware cannot grab correctly. [15]\n\nIt is inappropriate to force grab in Xserver or in compositors. [16] You can solve it in an elegant way as follows:\n\n- Right click the window titlebar (e.g. VMware or Citrix);\n- More Actions > Configure Special Window Settings...\n- Click Add Property... and select Ignore global shortcuts.\n- Select force and yes. Apply it.\n\n"
    },
    {
      "title": "System settings not applying when changed",
      "level": 3,
      "content": "This can be caused because system settings cannot access/modify the .config folder in your home directory.\n\nTo fix this, you need to change the owner of the folder:\n\n```\n# chown user:user /home/user/.config\n```\n\nuser refers to the name of the user that you are logged into in KDE Plasma. If the name of your home directory is not the same as the user you are logged in as, you can change it accordingly.\n\nIf this does not work, you might need to change the permissions of the folder:\n\n```\n# chmod 755 /home/user/.config\n```\n\n"
    },
    {
      "title": "Plasma 6 Global Menu not working with some applications",
      "level": 3,
      "content": "There are issues with the Widget \"Global Menu\" not working with some applications even after installing appmenu-gtk-module and libdbusmenu-glib. The fix is to install the plasma5-integration and to restart your Session.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- KDE homepage\n- KDE news\n- KDE Blogs\n- KDE Forums\n- KDE Wikis\n- KDE bug tracker and reporter\n- Martin Graesslin's blog\n- KDE Matrix Rooms\n\n"
    }
  ]
}