{
  "title": "KDE (Italiano)",
  "url": "https://wiki.archlinux.org/title/KDE_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nArticoli correlati\n\n- Desktop environment (Italiano)\n- Display manager (Italiano)\n- Window manager (Italiano)\n- Qt (Italiano)\n- SDDM\n- Dolphin\n- KDE Wallet\n- KDevelop\n- Trinity\n- Uniform look for Qt and GTK applications (Italiano)\n- Official repositories#kde-unstable\n\nKDE è un progetto software attualmente composto da un ambiente desktop, meglio conosciuto con il nome di Plasma, una collezione di librerie e framework (KDE Frameworks) e svariate applicazioni (KDE Applications). A livello upstream, KDE possiede una UserBase wiki ottimamente curata, dove è possibile trovare informazioni dettagliate sulla maggior parte delle applicazioni KDE.\n\n"
    },
    {
      "title": "Plasma",
      "level": 3,
      "content": "Installare il meta-pacchetto plasma-meta o il gruppo plasma. Per comprendere le differenze tra plasma-meta e plasma fare riferimento alla pagina Package group. In alternativa, per un'installazione di Plasma più minimale, installare il pacchetto plasma-desktop. A livello upstream, KDE fornisce delle raccomandazioni di pacchettizzazione e setup finalizzate a ottenere una sessione di Plasma comprensiva di tutte le funzioni.\n\nGli utenti NVIDIA che utilizzano il driver proprietario nvidia e desiderano utilizzare Wayland, dovranno altresì abilitare il DRM kernel mode setting.\n\n"
    },
    {
      "title": "Plasma Mobile",
      "level": 3,
      "content": "Installare plasma-mobileAUR.\n\n"
    },
    {
      "title": "Applicazioni KDE",
      "level": 3,
      "content": "Per l'intero set di applicazioni KDE, installare il gruppo kde-applications o il meta-pacchetto kde-applications-meta. Se si desidera solo una determinata categoria di applicazioni KDE, come giochi o didattica, installare la rispettiva dipendenza del pacchetto kde-applications-meta. È importante notare che questa operazione non installerà alcuna versione di Plasma, ma esclusivamente le applicazioni.\n\n"
    },
    {
      "title": "Rilasci instabili",
      "level": 3,
      "content": "Vedere Official repositories#kde-unstable per i rilasci beta.\n\n"
    },
    {
      "title": "Avvio di Plasma",
      "level": 2,
      "content": "È possibile avviare Plasma sia utilizzando un display manager che dalla console.\n\n"
    },
    {
      "title": "Utilizzando un display manager",
      "level": 3,
      "content": "- Selezionare Plasma (X11) per lanciare una nuova sessione in Xorg.\n- Selezionare Plasma (Wayland) per lanciare una nuova sessione in Wayland.\n- Selezionare Plasma Mobile (Wayland) per lanciare una nuova sessione Plasma Mobile in Wayland.\n\n"
    },
    {
      "title": "Dalla console",
      "level": 3,
      "content": "- Per avviare Plasma con xinit/startx, aggiungere export DESKTOP_SESSION=plasma e exec startplasma-x11 al proprio file .xinitrc. Qualora si desideri avviare Xorg al login, vedere Start X at login.\n- Per avviare una sessione di Plasma in Wayland da una console, eseguire startplasma-wayland[1]. Non dovrebbe essere necessario avviare manualmente una sessione di dbus mediante il comando dbus-run-session[2].\n\n"
    },
    {
      "title": "Configurazione",
      "level": 2,
      "content": "La maggior parte delle impostazioni relative alle applicazioni KDE sono contenute nella cartella ~/.config/. Tuttavia la configurazione di KDE avviene principalmente attraverso l'applicazione Impostazioni di sistema. Questa applicazione può essere avviata da un terminale eseguendo systemsettings.\n\n"
    },
    {
      "title": "Desktop Plasma",
      "level": 4,
      "content": "Esistono diversi tipi di temi KDE, che si differenziano in base agli elementi da essi modificati:\n\n- Temi globali, pacchetti completi che possono includere temi di Plasma, stili delle applicazioni, colori, font, icone, cursori, splash screen, temi SDDM, e schemi di colori di Konsole.\n- Temi di Plasma che modificano l'aspetto dei pannelli e dei widget di Plasma. Questi temi sono spesso associati a un tema Kvantum o Aurorae raccomandato che ne completa l'aspetto.\n- Stili delle applicazioni che modificano l'aspetto dei programmi.\n- Stili delle applicazioni che utilizzano theme engine quali Kvantum, QtCurve [3], QSvgStyle [4], e Aurorae.\n- #Temi delle icone che forniscono icone per applicazioni, file e azioni.\n\nPer facilitare l'installazione e l'aggiornamento a livello di sistema, alcuni temi sono disponibili sia nei repository ufficiali che nell'AUR.\n\nI temi globali possono inoltre essere installati tramite la funzione Impostazioni di sistema > Aspetto > Tema globale > Scarica nuovi temi globali....\n\nPer ottimizzare l'aspetto delle applicazioni GTK, il tema raccomandato è breeze-gtk, un tema GTK concepito per simulare il look del tema Brezza di Plasma. Installare kde-gtk-config (parte di plasma group) e selezionare Brezza come tema GTK in Impostazioni di sistema > Aspetto > Stile delle applicazioni > Configura lo stile delle applicazioni GNOME/GTK....\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nIn alcuni temi, il testo dei tooltip nelle applicazioni GTK è di colore bianco su sfondo bianco, e risulta quindi di difficile lettura. Per impostare i colori nelle applicazioni GTK2, modificare la rispettiva sezione all'interno del file .gtkrc-2.0. Per le applicazioni GTK3 è necessario modificare due file: gtk.css e settings.ini.\n\nAlcuni programmi GTK2 quali vuescan-binAUR continueranno ad avere un'usabilità limitata a causa delle caselle di spunta invisibili all'interno di una sessione di Plasma con la skin Breeze o Adwaita. Per ovviare a questo problema, installare ad es. la skin Numix-Frost-Light mediante il pacchetto numix-frost-themesAUR e selezionarla in Impostazioni di sistema > Aspetto > Stile delle applicazioni > Configura lo stile delle applicazioni GNOME/GTK... > Tema GTK. Il look del tema Numix-Frost-Light è simile a quello di Brezza.\n\nSia Plasma che SDDM utilizzeranno le immagini presenti nella cartella /var/lib/AccountsService/icons/ come avatar per gli utenti. Per la configurazione mediante interfaccia grafica, accedere all'applicazione Impostazioni di sistema > Utenti, che potrebbe essere necessario prima installare (vedere il pacchetto plasma-desktop). Per ripristinare l'avatar di default, rimuovere il file corrispondente al nome del proprio utente.\n\nI plasmoidi sono widget per la shell del desktop Plasma concepiti per estendere la funzionalità del desktop e sono disponibili nell'AUR.\n\nI plasmoidi possono inoltre essere installati facendo clic con il tasto destro su un pannello o sul desktop e selezionando Aggiungi oggetti > Ottieni nuovi oggetti... > Scarica nuovi oggetti di Plasma. Verrà visualizzata un'interfaccia per https://store.kde.org/ che permette di installare, disinstallare o aggiornare script di plasmoidi di terze parti con un solo clic.\n\nInstallare plasma-pa o kmix (avviare Kmix dal lanciatore di applicazioni). plasma-pa viene ora installato di default con plasma, e non è richiesta alcuna ulteriore configurazione.\n\nQuando il pannello di Plasma risulta sovrapposto ad altre finestre, la sua ombra viene proiettata su queste ultime. [5] Per disabilitare questo comportamento senza intervenire sulle altre ombre, installare xorg-xprop ed eseguire:\n\n```\n$ xprop -remove _KDE_NET_WM_SHADOW\n```\n\ndopodiché selezionare il pannello con il cursore a forma di segno '+'. [6] Per automatizzare questa operazione, installare xorg-xwininfo e creare il seguente script:\n\n```\n/usr/local/bin/kde-no-shadow\n```\n\n```\n#!/bin/bash\nfor WID in $(xwininfo -root -tree | sed '/\"Plasma\": (\"plasmashell\" \"plasmashell\")/!d; s/^  *\\([^ ]*\\) .*/\\1/g'); do\n   xprop -id $WID -remove _KDE_NET_WM_SHADOW\ndone\n```\n\nRendere eseguibile lo script.\n\nÈ possibile eseguire lo script al login con la funzione Aggiungi script di accesso in Avvio automatico:\n\n```\n$ kcmshell5 autostart\n```\n\nVedere HiDPI#KDE Plasma.\n\n"
    },
    {
      "title": "Plasma Mobile",
      "level": 4,
      "content": "Per utilizzare Plasma Mobile sugli schermi di piccole dimensioni, plasma-phone-settings contiene diverse impostazioni applicabili globalmente (/etc/xdg) e/o a livello utente ~/.config.\n\nIl file /etc/xdg/applications-blacklistrc (oppure ~/.config/applications-blacklistrc) rimuove le applicazioni dal menu/lanciatore di applicazioni per liberare spazio.\n\nIl file /etc/xdg/kdeglobals (oppure ~/.config/kdeglobals) permette di:\n\n- Impostare Angelfish come browser web.\n- Impostare l'aspetto (org.kde.plasma.phone) in modo tale che, ad esempio, le finestre vengano massimizzate e siano prive di barra del titolo.\n\nIl file /etc/xdg/kscreenlockerrc (oppure ~/.config/kscreenlockerrc) blocca lo schermo immediatamente dopo il login. Questa soluzione è utile in combinazione con SDDM#Autologin.\n\nIl file /etc/xdg/kwinrc (oppure ~/.config/kwinrc) permette di:\n\n- Disabilitare la sfocatura per migliorare le prestazioni.\n- Abilitare la tastiera virtuale Maliit.\n\n"
    },
    {
      "title": "Decorazioni delle finestre",
      "level": 4,
      "content": "Le decorazioni delle finestre sono disponibili nell'AUR.\n\nÈ possibile modificarle in Impostazioni di sistema > Aspetto > Decorazioni delle finestre. Qui è inoltre possibile scaricare e installare direttamente altri temi con un semplice clic.\n\n"
    },
    {
      "title": "Temi delle icone",
      "level": 4,
      "content": "I temi delle icone possono essere installati e modificati in Impostazioni di sistema > Aspetto > Icone.\n\n"
    },
    {
      "title": "Efficienza in termini di spazio",
      "level": 4,
      "content": "La shell Plasma Netbook è stata abbandonata a partire da Plasma 5, vedere il seguente post sul forum KDE. Tuttavia è possibile ottenere un risultato simile modificando il file ~/.config/kwinrc e aggiungendo BorderlessMaximizedWindows=true nella sezione [Windows].\n\n"
    },
    {
      "title": "Generazione di thumbnail",
      "level": 4,
      "content": "Per consentire la generazione di thumbnail per i file multimediali o per i documenti sul desktop e in Dolphin, installare kdegraphics-thumbnailers e ffmpegthumbs.\n\nDopodiché abilitare le categorie di thumbnail per il desktop facendo clic con il tasto destro sullo sfondo del desktop > Configura desktop e sfondo... > Icone > Configura le estensioni di anteprima....\n\nIn Dolphin, accedere al menu Configura > Configura Dolphin... > Generale > Anteprime.\n\n"
    },
    {
      "title": "Colore notturno",
      "level": 3,
      "content": "Plasma offre una funzione simile a quella offerta da redshift (che funziona sia in Xorg che in Wayland) chiamata Colore notturno. Questa funzione rende i colori sullo schermo più caldi per ridurre l'affaticamento degli occhi all'ora impostabile liberamente. È possibile abilitarla in Impostazioni di sistema > Schermo e video > Colore notturno.\n\n"
    },
    {
      "title": "Stampa",
      "level": 3,
      "content": "È possibile configurare le stampanti anche in Impostazioni di sistema > Stampanti. Per utilizzare questo metodo, è necessari prima installare i seguenti pacchetti print-manager, cups, system-config-printer. Vedere CUPS#Configuration.\n\n"
    },
    {
      "title": "Samba/supporto Windows",
      "level": 3,
      "content": "Se si desidera avere accesso ai servizi Windows, installare Samba (pacchetto samba).\n\nLa funzionalità di condivisione di Dolphin necessita del pacchetto kdenetwork-filesharing e di condivisioni utente, non abilitate nel file smb.conf predefinito. Le istruzioni per aggiungerle sono disponibili nella pagina Samba#Enable Usershares. Una volta completata questa operazione la funzione di condivisione in Dolphin dovrebbe essere immediatamente funzionante, senza la necessità di riavviare Samba.\n\nDiversamente dai gestori di file GTK, che utilizzano GVfs anche per il programma lanciato, aprendo i file da condivisioni Samba in Dolphin mediante KIO, con la maggior parte dei programmi Plasma copia prima l'intero file nel file system locale (VLC rappresenta un'eccezione). Per aggirare questa limitazione, è possibile utilizzare un gestore di file basato su GTK come thunar con gvfs e gvfs-smb (e gnome-keyring per salvare le credenziali di login) per accedere alle condivisioni SMB in modo più efficiente.\n\nUn'altra possibilità è montare una condivisione Samba tramite cifs-utils per far sì che Plasma la consideri come una comune cartella locale a cui accedere normalmente. Vedere Samba#Manual mounting e Samba#Automatic mounting.\n\nIl pacchetto samba-mounter-gitAUR fornisce una soluzione GUI che offre in linea di principio le medesime funzionalità tramite un'opzione di facile utilizzo disponibile in Impostazioni di sistema > Driver di rete. Tuttavia questa soluzione potrebbe non funzionare con le nuove versioni di KDE Plasma.\n\n"
    },
    {
      "title": "Attività del desktop KDE",
      "level": 3,
      "content": "Le attività sono spazi di lavoro speciali dove è possibile selezionare specifiche impostazioni che si applicano solo per la singola attività e solo quando queste viene utilizzata.\n\n"
    },
    {
      "title": "Gestione energetica",
      "level": 3,
      "content": "Installare powerdevil per un servizio di gestione energetica integrato in Plasma. Questo servizio offre funzionalità di risparmio energetico aggiuntive, controllo della luminosità dello schermo (se supportato) e indicazione dello stato della batteria, incluse le periferiche.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n"
    },
    {
      "title": "Avvio automatico",
      "level": 3,
      "content": "Plasma può avviare automaticamente le applicazioni ed eseguire script all'avvio e all'arresto. Per avviare automaticamente un'applicazione, accedere a Impostazioni di sistema > Avvio e spegnimento > Avvio automatico e aggiungere il programma o lo script shell desiderato. Per le applicazioni verrà creato un file .desktop, mentre per gli script di login verrà creato un file .desktop che lancerà lo script.\n\n- L'avvio automatico dei programmi può essere eseguito soltanto al login, mentre gli script shell possono essere eseguiti anche allo spegnimento o prima dell'avvio dello stesso ambiente Plasma.\n- Gli script shell verranno eseguiti solo se eseguibili.\n- Gli script shell precedentemente inseriti nella cartella ~/.config/autostart-scripts/ verranno convertiti automaticamente in file .desktop.\n\n- Inserire gli elementi desktop (ad es. i file .desktop) nella cartella XDG Autostart desiderata.\n- Inserire gli script o creare un link simbolico che rimandi ad essi in una delle seguenti cartelle: ~/.config/plasma-workspace/env/: per eseguire gli script al login prima del lancio di plasma. ~/.config/plasma-workspace/shutdown/: per eseguire gli script al momento della chiusura di Plasma.\n\n- ~/.config/plasma-workspace/env/: per eseguire gli script al login prima del lancio di plasma.\n- ~/.config/plasma-workspace/shutdown/: per eseguire gli script al momento della chiusura di Plasma.\n\nVedere la documentazione ufficiale.\n\n"
    },
    {
      "title": "Phonon",
      "level": 3,
      "content": "Da Wikipedia:\n\nPhonon trova un ampio utilizzo all'interno di KDE, sia per le risorse audio (ad es., le notifiche di sistema o le applicazioni audio KDE) che video (ad es. i thumbnail video di Dolphin). Può utilizzare i seguenti backend:\n\n- VLC: phonon-qt5-vlc\n- GStreamer: phonon-qt5-gstreamer, vedere GStreamer#Installation per il supporto di ulteriori codec\n- mpv: phonon-qt5-mpvAUR, phonon-qt5-mpv-gitAUR\n\nKDE raccomanda l'utilizzo del solo backend VLC. Lo sviluppo del backend GStreamer è inattivo, ma alcune delle principali distribuzioni Linux (ad esempio Kubuntu e Fedora-KDE) lo utilizzano come backend di default, in quanto questa soluzione permette loro di escludere facilmente dall'installazione standard i codec MPEG brevettati.\n\n- È possibile installare contemporaneamente più backend e definirne la priorità tramite l'applicazione phononsettings.\n- Secondo quanto riportato nel forum KDE, il backend VLC non supporta lo standard ReplayGain.\n- Nel caso si utilizzi il backend VLC, si potrebbero verificare dei crash ogni qual volta Plasma tenti di inviare un avviso audio e in un numero significativo di altri casi [8]. Una delle possibili soluzioni a questo problema è ricostruire la cache dei plugin VLC:\n\n```\n# /usr/lib/vlc/vlc-cache-gen /usr/lib/vlc/plugins\n```\n\n"
    },
    {
      "title": "Backup e ripristino",
      "level": 3,
      "content": "KDE Plasma 5 conserva le impostazioni personalizzate del desktop come file di configurazione nella cartella XDG_CONFIG_HOME. Utilizzare le informazioni dettagliate sui file di configurazione per scegliere un metodo di backup e ripristino.\n\n"
    },
    {
      "title": "Avvio tramite systemd",
      "level": 3,
      "content": "Plasma utilizza un'istanza utente systemd per lanciare e gestire tutti i propri servizi. Questo metodo di avvio è quello utilizzato di default a partire da Plasma 5.25, me è possibile disabilitarlo per utilizzare al suo posto degli script di boot eseguendo il seguente comando (sebbene questa soluzione potrebbe non risultare più funzionante nei rilasci futuri):\n\n```\n$ kwriteconfig5 --file startkderc --group General --key systemdBoot false\n```\n\nMaggiori dettagli sull'implementazione sono disponibili nel blog di Edmundson: plasma e l'avvio tramite systemd.\n\n"
    },
    {
      "title": "Controllo ortografico",
      "level": 3,
      "content": "Le applicazioni KDE utilizzano sonnet per il controllo ortografico. Vedere le sue dipendenze opzionali per i le soluzioni di controllo ortografico supportate.\n\nÈ possibile configurare questo strumento in Impostazioni di sistema > Impostazioni regionali > Correttore ortografico.\n\n"
    },
    {
      "title": "Esecuzione di kwin wayland con NVIDIA",
      "level": 3,
      "content": "Vedere https://community.kde.org/Plasma/Wayland/Nvidia.\n\n"
    },
    {
      "title": "Applicazioni",
      "level": 2,
      "content": "Il progetto KDE fornisce una suite di applicazioni che si integrano nel desktop Plasma. Vedere il gruppo kde-applications per un elenco completo di tutte le applicazioni disponibili. Vedere anche Category:KDE per le pagine correlate delle applicazioni KDE.\n\nOltre ai programmi forniti dalla suite di applicazioni KDE, sono disponibili molte altre applicazioni in grado di estendere le funzionalità del desktop Plasma. Alcune di queste sono trattate di seguito.\n\n"
    },
    {
      "title": "Terminare il server Xorg mediante le impostazioni di sistema KDE",
      "level": 4,
      "content": "Accedere al sottomenu Impostazioni di sistema > Dispositivi di immissione > Tastiera > Avanzate (tab) > \"Sequenza di tasti per terminare il server X\" e assicurarsi che il checkbox sia selezionato.\n\n"
    },
    {
      "title": "KCM",
      "level": 4,
      "content": "KCM è un acronimo che indica i moduli di configurazione di KDE. I KCM sono strumenti utili per la configurazione del proprio sistema e sono accessibili nelle impostazioni di sistema o da terminale tramite il comando kcmshell6.\n\n- sddm-kcm — modulo di configurazione di KDE per SDDM.\n\n- kde-gtk-config — configuratore GTK2 e GTK3 per KDE.\n\n- wacom tablet — GUI di KDE per i driver Wacom per Linux.\n\n- Kcmsystemd — modulo di controllo di systemd per KDE.\n\nAltri KCM sono disponibili alla pagina linux-apps.com.\n\n"
    },
    {
      "title": "Ricerca desktop",
      "level": 3,
      "content": "KDE implementa la ricerca desktop tramite Baloo, una soluzione software per la ricerca e l'indicizzazione dei file.\n\n"
    },
    {
      "title": "Browser web",
      "level": 3,
      "content": "I seguenti browser web possono integrarsi nell'ambiente Plasma:\n\n- Konqueror — parte del progetto KDE, supporta due motori di rendering – KHTML e Qt WebEngine, basato su Chromium.\n\n- Falkon — un browser web Qt con funzioni di integrazione con Plasma, conosciuto in precedenza con il nome di Qupzilla. Utilizza Qt WebEngine.\n\n- Chromium — Chromium e la sua variante proprietaria Google Chrome presentano delle limitazioni nell'integrazione con Plasma. Possono utilizzare KWallet e le finestre Apri/Salva KDE.\n\n- Firefox — Firefox può essere configurato per una migliore integrazione in Plasma. Vedere Firefox#KDE integration per i dettagli.\n\n"
    },
    {
      "title": "PIM",
      "level": 3,
      "content": "KDE mette a disposizione un proprio stack per la gestione delle informazioni personali (PIM). Tali informazioni includono e-mail, contatti, calendario, ecc. Per installare tutti i pacchetti PIM, è possibile utilizzare il gruppo di pacchetti kde-pim o il meta-pacchetto kde-pim-meta.\n\n"
    },
    {
      "title": "Akonadi",
      "level": 4,
      "content": "Akonadi è un sistema concepito per agire come cache locale per i dati PIM, indipendentemente dalla loro origine. Questa cache può a sua volta essere utilizzata da altre applicazioni. Sono inclusi i dati relativi alle e-mail dell'utente oltre che ai sui contatti, calendari, eventi, file di journal, allarmi, note ecc. Non conserva di per sé alcun dato: il formato di archiviazione dipende dalla natura dei dati (ad esempio, i contatti possono essere salvati nel formato vCard).\n\nInstallare akonadi. Per ulteriori add add-on, installare kdepim-addons.\n\n- Se si desidera utilizzare un motore del database diverso da MariaDB, quando si installa il pacchetto akonadi utilizzare il seguente comando per evitare l'installazione delle dipendenze mariadb: # pacman -S akonadi --assume-installed mariadb Vedere anche FS#32878.\n- Se Akonadi non trova il file /usr/bin/mysqld al primo avvio, ripiegherà sull'utilizzo di SQLite.\n\n```\n# pacman -S akonadi --assume-installed mariadb\n```\n\nCome impostazione predefinita Akonadi utilizzerà /usr/bin/mysqld (MariaDB di default, vedere MySQL per soluzioni alternative) per eseguire un'istanza MySQL gestita con il database salvato in ~/.local/share/akonadi/db_data/.\n\nAkonadi supporta l'utilizzo di MySQL a livello di sistema per il proprio database.[9]\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QMYSQL\n\n[QMYSQL]\nHost=\nName=akonadi_nome utente'\nOptions=\"UNIX_SOCKET=/run/mysqld/mysqld.sock\"\nStartServer=false\n```\n\nAkonadi supporta alternativamente l'utilizzo dell'istanza PostgreSQL già esistente a livello di sistema, vale a dire postgresql.service, o l'esecuzione di un'istanza PostgreSQL con privilegi utente a livello del database salvato in ~/.local/share/akonadi/db_data/.\n\nInstallare postgresql e postgresql-old-upgrade.\n\nModificare il file di configurazione di Akonadi in modo che rifletta quando segue:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QPSQL\n```\n\n- Al momento dell'avvio, Akonadi creerà la sezione [QPSQL] e imposterà le relative variabili appropriate.\n- Il database verrà salvato in ~/.local/share/akonadi/db_data/.\n\nAvviare Akonadi con akonadictl start e verificarne lo stato: akonadictl status.\n\n- A partire da akonadi 19.08.0-1, il cluster del database PostgreSQL in ~/.local/share/akonadi/db_data/ verrà aggiornato automaticamente ogni qual volta venga rilevato un major upgrade della versione di PostgreSQL.\n- Per le versioni precedenti di akonadi, i major upgrade della versione di PostgreSQL richiederanno un intervento manuale per aggiornare il database. Seguire le istruzioni di aggiornamento presenti nella KDE UserBase Wiki. Assicurarsi di adattare i percorsi dei file binari PostgreSQL in modo che riflettano quelli utilizzati dai pacchetti postgresql e postgresql-old-upgrade, vedere PostgreSQL#Upgrading PostgreSQL.\n\nQuesta soluzione necessita di un'istanza PostgreSQL già configurata e in esecuzione.\n\nCreare un account utente PostgreSQL per il proprio utente:\n\n```\n[postgres]$ createuser nome utente\n```\n\nCreare un database per Akonadi:\n\n```\n[postgres]$ createdb -O nome utente -E UTF8 --locale=C -T template0 akonadi-nome utente\n```\n\nConfigurare Akonadi affinché utilizzi l'istanza PostgreSQL a livello di sistema:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QPSQL\n\n[QPSQL]\nHost=/run/postgresql\nName=akonadi-nome utente\nStartServer=false\n```\n\nAvviare Akonadi con akonadictl start e verificarne lo stato: akonadictl status.\n\nPer utilizzare SQLite, modificare il file di configurazione di Akonadi come indicato di seguito:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QSQLITE\n```\n\n- Al momento dell'avvio, Akonadi creerà la sezione [QSQLITE] e imposterà le relative variabili appropriate.\n- Il database verrà salvato come ~/.local/share/akonadi/akonadi.db.\n\nGli utenti che desiderano disabilitare Akonadi dovrebbero evitare di avviare qualunque applicazione KDE che lo richieda. Vedere questa sezione in KDE userbase per maggiori informazioni.\n\n"
    },
    {
      "title": "KDE Connect",
      "level": 3,
      "content": "KDE Connect offre diverse funzioni che permettono di connettere il proprio telefono Android o iOS con il proprio desktop Linux:\n\n- Condivisione di file e URL verso/da KDE da/verso qualunque app, senza fili.\n- Emulazione del touchpad: possibilità di utilizzare lo schermo del proprio telefono come un touchpad.\n- Sincronizzazione delle notifiche (4.3+): possibilità di leggere le notifiche del proprio telefono Android dal desktop.\n- Appunti condivisi: possibilità di eseguire operazioni di copia e incolla tra il proprio telefono e il proprio computer.\n- Controllo multimediale remoto: possibilità di utilizzare il proprio telefono come telecomando per controllare i riproduttori multimediali Linux.\n- Connessione WiFi: non sono necessari cavi USB o connessioni Bluetooth.\n- Cifratura RSA: sicurezza per le proprie informazioni.\n\nÈ necessario utilizzare KDE Connect sia sul proprio computer che sul proprio telefono. Per il PC, installare il pacchetto kdeconnect. Per Android, installare KDE Connect da Google Play o da F-Droid. Nel caso si desideri avere la possibilità di navigare all'interno del file system del proprio cellulare, sarà necessario installare sshfs e configurare la visibilità del file system nell'app Android. Per iOS, installare KDE Connect dall'App Store. Non tutte le funzioni della versione Android sono disponibili in quella iOS.\n\nPer utilizzare la funzionalità di input remoto in una sessione Plasma Wayland, è richiesto il pacchetto xdg-desktop-portal.\n\nÈ possibile utilizzare KDE Connect anche se non si utilizza il desktop Plasma. Gli utenti GNOME possono ottenere un migliore livello di integrazione installando gnome-shell-extension-gsconnectAUR anziché kdeconnect. Per avviare manualmente il demone di KDE Connect, eseguire /usr/lib/kdeconnectd.\n\nSe si utilizza un firewall, sarà necessario aprire le porte UDP e TCP da 1714 a 1764.\n\nTalvolta può accadere che KDE Connect non rilevi un telefono. È possibile riavviare i servizi eseguendo killall kdeconnectd e aprendo poi kdeconnect nelle impostazioni di sistema o eseguendo kdeconnect-cli --refresh, seguito da kdeconnect-cli -l. È inoltre possibile utilizzare Associa nuovo dispositivo > Aggiungi dispositivi per IP su KDE Connect per Android.\n\n"
    },
    {
      "title": "Utilizzo di un altro window manager",
      "level": 3,
      "content": "Con Plasma è possibile utilizzare un window manager diverso da KWin. In questo modo è possibile combinare la funzionalità del desktop KDE e la praticità di un tiling window manager, con una soluzione migliore rispetto all'utilizzo degli script di KWin che aggiungono la funzione di tiling.\n\nLa funzione di selezione dei componenti di Plasma non permette più di cambiare il window manager, tuttavia è ancora possibile sostituire KWin utilizzando altri metodi.\n\n"
    },
    {
      "title": "Sostituzione del servizio KWin",
      "level": 4,
      "content": "A partire da KDE 5.25, è abilitato di default l'avvio di Plasma basato su systemd.\n\nPer sostituire KWin in questo processo di avvio è necessario, per prima cosa, mascherare il servizio plasma-kwin_x11.service per l'utente attuale, al fine di prevenirne l'avvio.\n\nDopodiché, creare una nuova unità utente systemd per avviare il proprio WM di preferenza [10]:\n\n```\n~/.config/systemd/user/plasma-custom-wm.service\n```\n\n```\n[Install]\nWantedBy=plasma-workspace.target\n\n[Unit]\nDescription=Plasma Custom Window Manager\nBefore=plasma-workspace.target\n\n[Service]\nExecStart=/path/to/other/wm\nSlice=session.slice\nRestart=on-failure\n```\n\nPer utilizzarla, ricaricare il demone (come unità utente), assicurarsi di aver mascherato il servizio plasma-kwin_x11.service e abilitare il servizio plasma-custom-wm.service appena creato.\n\n"
    },
    {
      "title": "Utilizzo del sistema di boot basato su script e KDEWM",
      "level": 4,
      "content": "Per utilizzare il sistema di boot basato su script di Plasma, occorre disabilitare l'avvio tramite systemd. Una volta eseguita questa operazione, è possibile cambiare il window manager impostando la variabile d'ambiente KDEWM prima dell'invocazione di Plasma.\n\nNote: **This article or section is a candidate for merging with Environment variables#Globally.** This article or section is a candidate for merging with Environment variables#Globally.\n\nThis article or section is a candidate for merging with Environment variables#Globally.\n\nSe si possiede l'accesso come root, è inoltre possibile aggiungere una sessione XSession che sarà disponibile per tutti gli utenti come opzione nella schermata di login.\n\nPer prima cosa, creare uno script con permessi di esecuzione come segue:\n\n```\n/usr/local/bin/plasma-i3.sh\n```\n\n```\n#!/bin/sh\nexport KDEWM=/usr/bin/i3\n/usr/bin/startplasma-x11\n```\n\nSostituire /usr/bin/i3 con il percorso del WM che si desidera utilizzare. Assicurarsi che il percorso sia definito correttamente. Nel caso KDE non fosse in grado di avviare il window manager, la sessione fallirà e l'utente verrà reindirizzato alla schermata di login.\n\nDopodiché, per aggiungere una sessione XSession, inserire in /usr/share/xsessions un file con il seguente contenuto:\n\n```\n/usr/share/xsessions/plasma-i3.desktop\n```\n\n```\n[Desktop Entry]\nType=XSession\nExec=/usr/local/bin/plasma-i3.sh\nDesktopNames=KDE\nName=Plasma (i3)\nComment=KDE Plasma with i3 as the WM\n```\n\n"
    },
    {
      "title": "Sessione KDE/Openbox",
      "level": 4,
      "content": "Il pacchetto openbox fornisce una sessione per utilizzare KDE con Openbox. Per utilizzare questa sessione, selezionare KDE/Openbox dal menu del display manager.\n\nChi avvia la sessione manualmente, dovrà aggiungere la seguente linea alla propria configurazione xinit:\n\n```\n~/.xinitrc\n```\n\n```\nexec openbox-kde-session\n```\n\n"
    },
    {
      "title": "Script KWin per tiling window",
      "level": 3,
      "content": "Di seguito un elenco di estensioni KWin che possono essere utilizzate per far sì che il comportamento di KDE somigli più a quello di un tiling window manager.\n\n- Bismuth — Add-on che dispone automaticamente le finestre in configurazione tiling e permette di gestirle mediante tastiera, in modo simile a i3, Sway o dwm.\n\n- Polonium — Un successore (non ufficiale) di Bismuth\n\n- Kröhnkite — Un'estensione per il tiling dinamico ispirata a dwm.\n\n- KZones — Uno script che simula il comportamento di Microsoft PowerToys e dei layout di ancoraggio di Windows 11\n\n"
    },
    {
      "title": "Configurazione della risoluzione del monitor / monitor multipli",
      "level": 3,
      "content": "Per abilitare la gestione della risoluzione del display e i monitor multipli in Plasma, installare kscreen. Questo pacchetto fornisce le relative opzioni aggiuntive in Impostazioni di sistema > Schermo e video.\n\n"
    },
    {
      "title": "Configurazione dei profili ICC",
      "level": 3,
      "content": "Per abilitare i profili ICC in Plasma, installare colord-kde. Questo pacchetto fornisce le relative opzioni aggiuntive in Impostazioni di sistema > Color Corrections.\n\nÈ possibile importare i profili ICC utilizzando Aggiungi profilo.\n\n"
    },
    {
      "title": "Disabilitazione dell'apertura del lanciatore di applicazioni con il tasto Super (tasto Windows)",
      "level": 3,
      "content": "Per disabilitare questa funzione è attualmente disponibile il seguente comando:\n\n```\n$ kwriteconfig5 --file kwinrc --group ModifierOnlyShortcuts --key Meta \"\"\n```\n\n"
    },
    {
      "title": "Disabilitazione dei preferiti nel menu delle applicazioni",
      "level": 3,
      "content": "Con l'integrazione del browser Plasma installata, KDE mostrerà i preferiti all'interno del lanciatore di applicazioni.\n\nPer disabilitare questa funzione è possibile eseguire i seguenti comandi:\n\n```\n$ mkdir ~/.local/share/kservices5\n$ sed 's/EnabledByDefault=true$/EnabledByDefault=false/' /usr/share/kservices5/plasma-runner-bookmarks.desktop > ~/.local/share/kservices5/plasma-runner-bookmarks.desktop\n```\n\n"
    },
    {
      "title": "Integrazione IBus",
      "level": 3,
      "content": "IBus è un framework per il metodo di input integrabile all'interno di KDE. Vedere IBus#Integration per i relativi dettagli.\n\nL'impiego di IBus può rendersi necessario in caso di utilizzo di KDE su Wayland per poter usufruire del supporto per caratteri accentati e dead key [11].\n\n"
    },
    {
      "title": "Abilitazione dell'hotspot in plasma-nm",
      "level": 3,
      "content": "Vedere NetworkManager#Sharing internet connection over Wi-Fi.\n\n"
    },
    {
      "title": "Ripristino della sessione precedente salvata",
      "level": 3,
      "content": "Se risulta selezionato Impostazioni di sistema > Avvio e spegnimento > Sessioni del desktop > All'accesso: Ripristina la sessione precedentemente salvata (default), ksmserver (il gestore di sessioni di KDE) salverà/caricherà automaticamente tutte le applicazioni aperte in/da ~/.config/ksmserverrc al logout/login.\n\n"
    },
    {
      "title": "Ricezione della posta locale in KMail",
      "level": 3,
      "content": "Nel caso si sia provveduto a impostare la consegna della posta locale con un server di posta che utilizzi il formato Maildir, si potrebbe voler ricevere tale posta in KMail. In questo caso, è possibile riutilizzare l'account di ricezione di default di KMail \"Local Folders\" che salva la posta in ~/.local/share/local-mail/.\n\nCreare per la cartella ~/Maildir (in cui viene di norma salvata la posta in formato Maildir) un link simbolico verso la cartella della posta in entrata dell'account \"Local Folders\":\n\n```\n$ ln -s .local/share/local-mail/inbox ~/Maildir\n```\n\nIn alternativa, aggiungere un nuovo account per la ricezione di tipo Maildir e impostare ~/Maildir come cartella per questo account.\n\n"
    },
    {
      "title": "Configurare Plasma per tutti gli utenti",
      "level": 3,
      "content": "Modificare i file config/main.xml nella cartella /usr/share/plasma. Ad esempio, per configurare il lanciatore di applicazioni per tutti gli utenti, modificare il file /usr/share/plasma/plasmoids/org.kde.plasma.kickoff/contents/config/main.xml. Per prevenire la sovrascrittura dei file con l'aggiornamento dei pacchetti, aggiungere i file all'array NoUpgrade di Pacman\n\n"
    },
    {
      "title": "Disabilitazione dell'ibernazione",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Power management.** This article or section is a candidate for merging with Power management.\n\nThis article or section is a candidate for merging with Power management.\n\nPer disabilitare in modo corretto la funzione di ibernazione nascondendola dal menu, creare una regola di policy Polkit.\n\n```\n/etc/polkit-1/rules.d/99-disable-hibernate.rules\n```\n\n```\n// Disable hibernate for all users\npolkit.addRule(function(action, subject) {\n   if ((action.id == \"org.freedesktop.login1.hibernate\")) {\n      return polkit.Result.NO;\n   }\n});\npolkit.addRule(function(action, subject) {\n   if ((action.id == \"org.freedesktop.login1.hibernate-multiple-sessions\")) {\n      return polkit.Result.NO;\n   }\n});\n```\n\nIn alternativa, aggiungere le seguenti linee a un file in /etc/systemd/sleep.conf.d/:\n\n```\n/etc/systemd/sleep.conf.d/00-disable-hibernation.conf\n```\n\n```\n[Sleep]\nAllowHibernation=no\nAllowSuspendThenHibernate=no\nAllowHybridSleep=no\n```\n\n"
    },
    {
      "title": "Utilizzo delle regole delle finestre",
      "level": 3,
      "content": "Kwin è in grado di specificare delle regole per specifiche finestre/applicazioni. Ad esempio, è possibile forzare l'abilitazione della barra del titolo della finestra anche qualora lo sviluppatore dell'applicazione abbia deciso non non prevederne la presenza. È possibile definire tali regole per specificare la posizione iniziale, le dimensioni, lo stato di minimizzazione, per mantenere la finestra sopra/sotto le altre ecc.\n\nPer creare una regola premere la combinazione di tasti Alt+F3 quando la finestra in questione è selezionata. Dopodiché in Altre azioni > Configura impostazioni specifiche per la finestra/l'applicazione, è possibile definire la proprietà desiderata. Un elenco delle regole create è disponibile in Impostazioni di sistema > Gestione delle finestre > Regole delle finestre.\n\n"
    },
    {
      "title": "Tastiera virtuale",
      "level": 3,
      "content": "Nell'installazione di default non è presente alcuna tastiera virtuale. Sceglierne una adeguata alle proprie esigenze da List of applications/Utilities#On-screen keyboards, ad esempio la tastiera Maliit, e installarla. Dopodiché abilitarla nelle impostazioni di sistema.\n\n"
    },
    {
      "title": "Bug di qt5ct e kvantum dopo l'aggiornamento",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nL'ultimo aggiornamento potrebbe causare uno scaling HiDPI incompatibile ed essere causa di alcune interfacce eccessivamente grandi per il proprio schermo, di alcune icone mancanti o non visualizzate, e di pannelli o widget mancanti.\n\nProvare a rimuovere qt5ct e kvantum e i relativi pacchetti associati, dopodiché applicare il tema globale di default di Plasma. Se il problema persiste, provare a cancellare tutte le proprie configurazioni di KDE e a reinstallare plasma per sovrascrivere la configurazione. Assicurarsi di verificare lo scaling HiDPI anche nelle impostazioni di sistema KDE.\n\n"
    },
    {
      "title": "I font vengono non vengono visualizzati correttamente in una sessione Plasma",
      "level": 4,
      "content": "Provare a installare i pacchetti ttf-dejavu e ttf-liberation.\n\nDopo l'installazione assicurarsi di eseguire il logout e di effettuare nuovamente il login. Non dovrebbe essere necessario modificare nulla in Impostazioni di sistema > Aspetto > Caratteri. Se si sta utilizzando qt5ct, le impostazioni nello strumento di configurazione Qt5 potrebbero sovrascrivere le impostazioni dei caratteri definite nelle impostazioni di sistema.\n\nNel caso si sia definito personalmente il rendering dei propri font, le impostazioni del sistema potrebbero alterarne l'aspetto. Accedendo a Impostazioni di sistema > Aspetto > Caratteri l'applicazione Impostazioni di sistema con ogni probabilità modificherà il file di configurazione dei font (fonts.conf).\n\nNon esiste alcun modo di evitare questo comportamento tuttavia, impostando i valori in modo che corrispondano al proprio file fonts.conf, si avrà nuovamente il rendering atteso dei font (sarà necessario il riavvio della propria applicazione o, in alcuni casi, del desktop). Notare che questo comportamento è comune anche alle preferenze per i font di Gnome.\n\n"
    },
    {
      "title": "I font sono enormi o hanno un aspetto sproporzionato",
      "level": 4,
      "content": "Provare a forzare i DPI dei font a 96 in Impostazioni di sistema > Aspetto > Caratteri.\n\nSe questa soluzione non funziona, provare a impostare il valore DPI direttamente nella propria configurazione Xorg come documentato in Xorg#Setting DPI manually.\n\n"
    },
    {
      "title": "Problemi legati alla configurazione",
      "level": 3,
      "content": "Molti dei problemi in KDE sono correlati alla sua configurazione.\n\n"
    },
    {
      "title": "Il desktop Plasma si comporta in modo strano",
      "level": 4,
      "content": "I problemi di Plasma sono di norma causati da widget di Plasma instabili (detti anche plasmoidi in termini colloquiali) o da temi di Plasma. Per prima cosa, individuare l'ultimo widget o tema installato e disabilitarlo o disinstallarlo.\n\nPertanto se il proprio desktop si \"blocca\" all'improvviso, la causa è con ogni probabilità da attribuirsi a un widget difettoso installato. Se non si ricorda quale sia l'ultimo widget installato prima della comparsa del problema (talvolta potrebbe trattarsi di un problema che si presenta a intervalli irregolari), provare a individuarlo eliminando ogni widget fino alla scomparsa del problema. Dopodiché è possibile disinstallare il widget e segnalare il bug nel bug tracker di KDE esclusivamente se si tratta di un widget ufficiale. In caso contrario si raccomanda di individuare la relativa pagina sul KDE Store e di informare lo sviluppatore del widget in merito al problema occorso (indicando in dettagli i passaggi da riprodurre, ecc.).\n\nQualora non si riesca a individuare il problema, ma si vuole evitare di perdere \"tutte\" le impostazioni, portarsi nella cartella ~/.config/ ed eseguire il seguente comando:\n\n```\n$ for j in plasma*; do mv -- \"$j\" \"${j%}.bak\"; done\n```\n\nQuesto comando rinominerà tutti i file di configurazione di Plasma del proprio utente aggiungendovi l'estensione *.bak (ad es. plasmarc.bak). In tal modo al nuovo login in Plasma verranno ripristinate le impostazioni di default. Per annullare quest'azione, rimuovere l'estensione .bak dai file. Qualora siano già presenti dei file con estensione *.bak, rinominarli, spostarli o cancellarli prima. La creazione di backup a intervalli regolari è comunque una pratica consigliata. Vedere Synchronization and backup programs per un elenco di possibili soluzioni.\n\n"
    },
    {
      "title": "Pulizia della cache per risolvere i problemi legati agli aggiornamenti",
      "level": 4,
      "content": "Il problema può essere causato da una cache datata. Talvolta, dopo un aggiornamento, la vecchia cache può introdurre comportamenti strani, di cui può risultare difficile eseguire il debug, quali shell non terminabili con il comando di kill, blocco della schermata alla modifica di impostazioni varie, impossibilità per Ark di estrarre archivi o incapacità di Amarok di riconoscere qualunque elemento della libreria musicale. Questa soluzione può risolvere i problemi di visualizzazione delle applicazioni KDE e Qt in seguito a un aggiornamento.\n\nRicostruire la cache utilizzando i seguenti comandi:\n\n```\n$ rm ~/.config/Trolltech.conf\n$ kbuildsycoca5 --noincremental\n```\n\nOpzionalmente, svuotare il contenuto della cartella ~/.cache/, tuttavia questa operazione pulirà la cache anche delle altre applicazioni:\n\n```\n$ rm -rf ~/.cache/*\n```\n\n"
    },
    {
      "title": "Il desktop Plasma non rispetta le impostazioni di localizzazione/lingua",
      "level": 4,
      "content": "Il desktop Plasma potrebbe utilizzare impostazioni diverse da quelle definite nel pannello delle impostazioni di sistema KDE o nel file locale.conf (via Locale#Variables). La prima cosa da fare è effettuare il logout e poi nuovamente il login dopo aver rimosso ~/.config/plasma-localerc, se questa operazione non risolve il problema, provare a modificare manualmente il file. Ad esempio, per impostare la variabile LANG con il valore it_IT.UTF-8 e la variabile LC_MESSAGES con il valore en_US.UTF-8:\n\n```\n~/.config/plasma-localerc\n```\n\n```\n[Formats]\nLANG=it_IT.UTF-8\n\n[Translations]\nLANGUAGE=en_US\n```\n\n"
    },
    {
      "title": "Impossibile cambiare tema, icone, font, colori nelle impostazioni di sistema; la maggior parte delle icone non viene visualizzata",
      "level": 4,
      "content": "Assicurarsi che la variabile d'ambiente QT_QPA_PLATFORMTHEME non sia impostata, il comando printenv QT_QPA_PLATFORMTHEME dovrebbe restituire un output vuoto. Nel caso contrario in cui sia definito un ambiente da parte di un'applicazione (con ogni probabilità qt5ct), questa variabile forzerà le impostazioni di qt5ct sulle applicazioni Qt. Il comando export QT_QPA_PLATFORMTHEME= dovrebbe annullare la variabile.\n\nUna soluzione più semplice (e più affidabile) può essere quella di disinstallare completamente qt5ct.\n\n"
    },
    {
      "title": "Il controllo del volume, le notifiche o i tasti multimediali non funzionano",
      "level": 4,
      "content": "Nascondendo determinati elementi nelle impostazioni del vassoio di sistema (ad es. Volume audio, Lettore multimediale o Notifiche) si disabilitano anche le rispettive funzioni. Se si nasconde Volume audio si disabilitano i tasti di controllo del volume, Lettore multimediale disabilita i tasti di riproduzione multimediali (rewind, stop, pausa) e nascondendo Notifiche si disabilita la visualizzazione delle notifiche.\n\n"
    },
    {
      "title": "Il modulo KCM Schermata di accesso non sincronizza le impostazioni del cursore con SDDM",
      "level": 4,
      "content": "Il modulo KCM Schermata di accesso legge le impostazioni del cursore dell'utente dal file ~/.config/kcminputrc, in assenza di questo file le impostazioni non vengono sincronizzate. Il modo più semplice per generare questo file è modificare il proprio tema del cursore in Impostazioni di sistema > Puntatori, e reimpostare in seguito il proprio tema cursore preferito.\n\n"
    },
    {
      "title": "Pannelli/widget mancanti",
      "level": 4,
      "content": "Un eventuale crash o la sostituzione di componenti hardware possono modificare i numeri degli schermi, anche in un setup con monitor singolo. Di conseguenza i pannelli/widget possono risultare mancanti. Questo problema può essere risolto modificando i valori lastScreen nel file ~/.config/plasma-org.kde.plasma.desktop-appletsrc.\n\n"
    },
    {
      "title": "Problemi grafici",
      "level": 3,
      "content": "Assicurarsi di avere installato il driver appropriato per la propria GPU. Vedere Xorg#Driver installation per maggiori informazioni. Se si possiede una scheda datata, potrebbe essere utile disabilitare manualmente o automaticamente gli effetti desktop per specifiche applicazioni o disabilitare il compositing.\n\n"
    },
    {
      "title": "Ottenere lo stato attuale di KWin per finalità di supporto e debug",
      "level": 4,
      "content": "Il seguente comando restituisce un sommario dello stato attuale di KWin incluse le opzioni utilizzate, il backend di compositing utilizzato e le rispettive funzionalità del driver OpenGL. Maggiori informazioni alla pagina Martin's blog.\n\n```\n$ qdbus org.kde.KWin /KWin org.kde.KWin.supportInformation\n```\n\n"
    },
    {
      "title": "Disabilitazione manuale o automatica degli effetti desktop per specifiche applicazioni",
      "level": 4,
      "content": "In Plasma determinati effetti desktop sono abilitati di default e, ad esempio, non tutti i giochi li disabilitano automaticamente. È possibile disabilitare gli effetti desktop in Impostazioni di sistema > Comportamento dello spazio di lavoro > Effetti del desktop. Inoltre è possibile attivarli e disattivarli con la combinazione di tasti Alt+Shift+F12.\n\nSi possono altresì creare regole di KWin personalizzate per abilitare/disabilitare automaticamente il compositing quando una determinata applicazione/finestra si avvia in Impostazioni di sistema > Gestione delle finestre > Regole delle finestre.\n\n"
    },
    {
      "title": "Abilitazione della trasparenza",
      "level": 4,
      "content": "Se si utilizza uno sfondo trasparente senza abilitare il compositor, viene visualizzato questo messaggio:\n\n```\nQuesto schema di colori utilizza uno sfondo trasparente che sembra non essere supportato dal proprio desktop\n```\n\nIn Impostazioni di sistema > Schermo e video > Compositore, selezionare Composizione: Abilita all'avvio e riavviare Plasma.\n\n"
    },
    {
      "title": "Disabilitazione del compositing",
      "level": 4,
      "content": "In Impostazioni di sistema > Schermo e video > Compositore, selezionare Composizione: Abilita all'avvio e riavviare Plasma.\n\n"
    },
    {
      "title": "Sfarfallio in modalità schermo intero con il compositing abilitato",
      "level": 4,
      "content": "In Impostazioni di sistema > Schermo e video > Compositore, selezionare Composizione: Consenti alle applicazioni di bloccare la composizione. Questa operazione può incidere negativamente sulle prestazioni.\n\n"
    },
    {
      "title": "Il puntatore di Plasma talvolta non viene visualizzato correttamente",
      "level": 4,
      "content": "Creare la cartella ~/.icons/default (oppure ${XDG_DATA_HOME:-$HOME/.local/share}/icons/default/) e inserire al suo interno un file con nome index.theme con il seguente contenuto:\n\n```\n~/.icons/default/index.theme\n```\n\n```\n[Icon Theme]\nInherits=breeze_cursors\n```\n\nSe necessario, sostituire breeze_cursors con il tema del cursore utilizzato.\n\nEseguire il seguente comando:\n\n```\n$ ln -s /usr/share/icons/breeze_cursors/cursors ~/.icons/default/cursors\n```\n\nIn Wayland è necessario installare xdg-desktop-portal-gtk affinché le applicazioni GTK/GNOME utilizzino correttamente i temi del cursore.\n\nSe si è attivato il supporto per Wayland, Firefox e Thunderbird faranno riferimento a GSettings per determinare il puntatore da visualizzare.\n\nPer sincronizzare le impostazioni KDE con le applicazioni GTK, installare kde-gtk-config.\n\nSe non si desidera installare un pacchetto extra, è possibile impostare il tema del cursore manualmente:\n\n```\n$ gsettings set org.gnome.desktop.interface cursor-theme nome del tema del cursore\n```\n\n"
    },
    {
      "title": "Sfarfallio/movimento a scatti del puntatore al cambio ruoli (ad es., quando il mouse passa sopra link ipertestuali)",
      "level": 4,
      "content": "Provare a installare il driver appropriato di accelerazione 2D per il proprio sistema e window manager.\n\n"
    },
    {
      "title": "È impostata una risoluzione schermo inutilizzabile",
      "level": 4,
      "content": "Le proprie impostazioni locali per kscreen possono sovrascrivere quelle definite in xorg.conf. Esaminare i file di configurazione di kscreen in ~/.local/share/kscreen/ e verificare che la modalità non sia impostata su un valore di risoluzione non supportato dal proprio monitor.\n\n"
    },
    {
      "title": "Icone sfocate nel vassoio di sistema",
      "level": 4,
      "content": "Per aggiungere le icone al vassoio di sistema, spesso le applicazioni utilizzano la libreria appindicator. Nel caso le icone risultino sfocate, verificare la versione di libappindicator installata nel proprio sistema. Se risulta installata soltanto la libreria libappindicator-gtk2, è possibile installare libappindicator-gtk3 per tentare di correggere la visualizzazione delle icone.\n\n"
    },
    {
      "title": "Impossibile modificare la risoluzione dello schermo all'interno di una macchina virtuale",
      "level": 4,
      "content": "Quando Plasma viene eseguito all'interno di una macchina virtuale VMware, VirtualBox o QEMU, kscreen potrebbe non consentire di modificare la risoluzione dello schermo guest su una risoluzione superiore a 800×600.\n\nPer aggirare questa limitazione è possibile impostare l'opzione PreferredMode in xorg.conf.d(5). In alternativa, provare a utilizzare un adattatore grafico diverso nella macchina virtuale, ad es. VBoxSVGA anziché VMSVGA per VirtualBox e Virtio anziché QXL per QEMU. Vedere KDE Bug 407058 per maggiori dettagli.\n\n"
    },
    {
      "title": "Dolphin, Kate, ecc. rimangono bloccati a lungo all'apertura",
      "level": 4,
      "content": "Verificare che le cartelle (Documenti, Scaricati, ecc.) del proprio utente non siano in sola lettura.\n\n"
    },
    {
      "title": "Lo screenshot con Spectacle utilizza uno stato dello schermo precedente",
      "level": 4,
      "content": "In Impostazioni di sistema > Schermo e video > Compositore, modificare Tieni le miniature delle finestre da Solo per le finestre visibili a Mai. Se la propria macchina utilizza grafica Intel, assicurarsi che xf86-video-intel non sia installato.\n\n"
    },
    {
      "title": "Niente audio dopo la sospensione",
      "level": 4,
      "content": "Se in seguito a una sospensione non si riscontra alcun segnale audio e se in KMix non vengono visualizzati dispositivi audio che dovrebbero invece essere presenti, potrebbe essere utile riavviare plasmashell e pulseaudio:\n\n```\n$ killall plasmashell\n$ systemctl --user restart pulseaudio.service\n$ plasmashell\n```\n\nPotrebbe essere necessario riavviare alcune applicazioni per ripristinare l'audio al loro interno.\n\n"
    },
    {
      "title": "Impossibile riprodurre file MP3 utilizzando il backend Phonon GStreamer",
      "level": 4,
      "content": "Questo problema può essere risolto installando il plugin libav GStreamer (pacchetto gst-libav). Nel caso si continuino a riscontrare problemi, è possibile provare a cambiare il backend Phonon utilizzato installandone un altro quale phonon-qt4-vlcAUR o phonon-qt5-vlc.\n\nDopodiché assicurarsi di selezionare il backend come preferito in Impostazioni di sistema > Multimedia > Audio e Video > Backend.\n\nSe questa voce non viene visualizzata nelle impostazioni di sistema, provare a eseguire phononsettings nel proprio terminale.\n\n"
    },
    {
      "title": "Nessuna icona di controllo del volume nel vassoio di sistema e impossibile regolare il volume con il tasto funzione",
      "level": 4,
      "content": "Verificare che plasma-pa sia installato nel proprio sistema.\n\n"
    },
    {
      "title": "Niente audio dopo poco tempo",
      "level": 4,
      "content": "Se il comando journalctl -p4 -t pulseaudio restituisce voci che l'errore Failed to create sink input: sink is suspended, provare a commentare la seguente linea in /etc/pulse/default.pa:\n\n```\n#load-module module-suspend-on-idle\n```\n\nSe il problema persiste, plasma-meta o plasma potrebbero aver installato pulseaudio insieme a wireplumber. Per risolvere il sistema, sostituire pulseaudio con pipewire-pulse. Se si preferisce pulseaudio, sostituire wireplumber con pipewire-media-session. Vedere PipeWire#PulseAudio clients e questo thread sul forum for per maggiori dettagli.\n\n"
    },
    {
      "title": "Nessuna opzione di sospensione/ibernazione",
      "level": 4,
      "content": "Se il proprio sistema è dotato delle funzionalità per la sospensione o l'ibernazione mediante systemd, ma queste opzioni non vengono visualizzate in KDE, assicurarsi che il pacchetto powerdevil sia installato nel proprio sistema.\n\n"
    },
    {
      "title": "Nessuna opzione per il profilo energetico",
      "level": 4,
      "content": "Assicurarsi di aver installato powerdevil e power-profiles-daemon. Eseguire powerprofilesctl e verificare il driver. Se il driver è intel_pstate o amd_pstate, la propria configurazione è corretta, in caso contrario vedere CPU frequency scaling#Scaling drivers per maggiori informazioni sull'abilitazione.\n\n"
    },
    {
      "title": "Pulizia della configurazione di Akonadi per risolvere i problemi in KMail",
      "level": 4,
      "content": "Vedere [12] per maggiori dettagli.\n\nSe si desidera effettuare un backup, copiare le seguenti cartelle di configurazione:\n\n```\n$ cp -a ~/.local/share/akonadi ~/.local/share/akonadi-old\n$ cp -a ~/.config/akonadi ~/.config/akonadi-old\n```\n\n"
    },
    {
      "title": "Casella inbox IMAP vuota in KMail",
      "level": 4,
      "content": "Per alcuni account IMAP, KMail mostrerà la casella inbox come contenitore di livello top (risulta pertanto impossibile leggere i messaggi al suo interno) contenente tutte le altre cartelle di tali account.[13]. Per risolvere questo problema è sufficiente disabilitare le sottoscrizioni lato server nelle impostazioni account di KMail.\n\n"
    },
    {
      "title": "Errore di autorizzazione per account EWS in KMail",
      "level": 4,
      "content": "Durante l'impostazione di un account EWS in KMail, è possibile che si verifichino errori di autorizzazione anche inserendo credenziali valide e perfettamente funzionanti. Questo problema è con ogni probabilità causato da un malfunzionamento nella comunicazione tra KWallet e KMail. Per aggirare questo inconveniente, impostare una password tramite qdbus:\n\n```\n$ qdbus org.freedesktop.Akonadi.Resource.akonadi_ews_resource_0 /Settings org.kde.Akonadi.Ews.Wallet.setPassword \"XXX\"\n```\n\n"
    },
    {
      "title": "Attività di logging aggressiva nel journal da parte di QXcbConnection / kscreen.xcb.helper",
      "level": 3,
      "content": "Vedere Qt#Disable/Change Qt journal logging behaviour.\n\n"
    },
    {
      "title": "Le applicazioni KF5/Qt 5 non visualizzano le icone in i3/FVWM/awesome",
      "level": 3,
      "content": "Vedere Qt#Configuration of Qt 5/6 applications under environments other than KDE Plasma.\n\n"
    },
    {
      "title": "Problemi con il salvataggio delle credenziali e visualizzazione continua di finestre di dialogo di KWallet",
      "level": 3,
      "content": "Si sconsiglia di disabilitare il sistema di salvataggio delle password di KWallet nelle impostazioni dell'utente, in quanto questo sistema è necessario per il salvataggio delle credenziali cifrate quali le password delle reti WiFi per ogni utente. La disabilitazione di questo sistema può essere la causa della continua comparsa di finestre di dialogo di KWallet.\n\nNel caso risultino fastidiose le finestre di dialogo per lo sbloccaggio del wallet quando le applicazioni vi richiedono l'accesso, è possibile impostare i display manager SDDM e LightDM affinché sblocchino il wallet automaticamente al login. Vedere a tal proposito KDE Wallet#Unlock KDE Wallet automatically on login. Il primo wallet deve essere generato da KWallet (e non dall'utente) per poter essere utilizzato per le credenziali dei programmi di sistema.\n\nQualora si desideri impedire che le credenziali del wallet vengano aperte nella memoria per ogni applicazione, è possibile limitare l'accesso delle applicazioni al wallet stesso utilizzando le funzionalità offerte da kwalletmanager nelle impostazioni di KWallet.\n\nNel caso non si desideri alcun tipo di cifratura delle credenziali, è possibile semplicemente lasciare vuoti i campi associati alla password quando KWallet ne richiede la definizione al momento della creazione di un wallet. In questo caso, le applicazioni possono accedere alle password senza che sia necessario prima sbloccare il wallet.\n\n"
    },
    {
      "title": "Discover non mostra alcuna applicazione",
      "level": 3,
      "content": "Questo problema può essere risolto installando il pacchetto packagekit-qt5.\n\n"
    },
    {
      "title": "Discover non mostra più gli aggiornamenti dai repository di Arch",
      "level": 3,
      "content": "Talvolta Discover potrebbe non rimuovere il lock alpm PackageKit. Per sbloccarlo, rimuovere /var/lib/PackageKit/alpm/db.lck. Utilizzare \"Aggiorna\" in Discover e gli aggiornamenti dovrebbero essere visualizzati (se disponibili).\n\n"
    },
    {
      "title": "Elevato utilizzo della CPU da parte di kscreenlocker_greet con i driver NVIDIA",
      "level": 3,
      "content": "Come descritto in KDE Bug 347772 i driver OpenGL NVIDIA e QML potrebbero non funzionare in modo ottimale con Qt 5. La conseguenza potrebbe essere un elevato utilizzo della CPU da parte di kscreenlocker_greet dopo lo sblocco della sessione. Per aggirare questo problema, impostare la variabile d'ambiente QSG_RENDERER_LOOP in basic.\n\nDopodiché terminare tutte le istanze precedenti del greeter con il comando killall kscreenlocker_greet.\n\n"
    },
    {
      "title": "OS error 22 eseguendo Akonadi su file system ZFS",
      "level": 3,
      "content": "Se la propria cartella home si trova all'interno di un pool ZFS, creare un file ~/.config/akonadi/mysql-local.conf con il seguente contenuto:\n\n```\n[mysqld]\ninnodb_use_native_aio = 0\n```\n\nVedere MariaDB#OS error 22 when running on ZFS.\n\n"
    },
    {
      "title": "Impossibile scorrere all'interno di alcuni programmi quando le relative finestre sono inattive",
      "level": 3,
      "content": "La causa è da attribuirsi alla modalità problematica di gestione degli eventi di scorrimento con il mouse da parte di GTK3. Un modo per aggirare questo problema è impostare la variabile d'ambiente GDK_CORE_DEVICE_EVENTS=1. Tuttavia, così facendo si disabilitano anche lo smooth scrolling del touchpad e lo scorrimento su touchscreen.\n\n"
    },
    {
      "title": "TeamViewer è lento",
      "level": 3,
      "content": "TeamViewer potrebbe funzionare lentamente se si utilizzano animazioni (come la minimizzazione della finestre). Il problema può essere aggirato disabilitando il compositing .\n\n"
    },
    {
      "title": "Kmail, Kontact e Wayland",
      "level": 3,
      "content": "Kmail potrebbe smettere di rispondere, mostrare uno sfondo nero nella visualizzazione dei messaggi o comportamenti simili, spesso dopo essere stata minimizzata e poi ripristinata. Un modo per aggirare questo problema potrebbe essere impostare la variabile d'ambiente QT_QPA_PLATFORM=\"xcb;wayland\". Vedere KDE Bug 397825.\n\n"
    },
    {
      "title": "Sbloccare i widget (Plasma ≥ 5.18)",
      "level": 3,
      "content": "Se si erano precedentemente bloccati i widget, con ogni probabilità ci si troverà nell'impossibilità di sbloccarli nuovamente. Per farlo è sufficiente eseguire questo comando:\n\n```\n$ qdbus org.kde.plasmashell /PlasmaShell evaluateScript \"lockCorona(false)\"\n```\n\nBenché ciò non sia necessario nella nuova funzione Customize Layout, se si desidera bloccarli nuovamente eseguire:\n\n```\n$ qdbus org.kde.plasmashell /PlasmaShell evaluateScript \"lockCorona(true)\"\n```\n\n"
    },
    {
      "title": "KIO apre gli URL con il programma sbagliato",
      "level": 3,
      "content": "Verificare le associazioni dei file per HTML, PHP, ecc... e modificare le impostazioni assegnando un browser. I file di cache di KIO si trovano in $HOME/.cache/kioexec. Vedere anche xdg-utils#URL scheme handlers.\n\n"
    },
    {
      "title": "Blocco dello schermo prima della sospensione e dell'ibernazione",
      "level": 3,
      "content": "Nell'applicazione Impostazioni di sistema, KDE mette a disposizione un'impostazione che consente di bloccare automaticamente lo schermo dopo il risveglio dalla sospensione. Al momento della riattivazione, alcuni utenti segnalano che lo schermo viene visualizzato brevemente prima di essere bloccato. Per prevenire questo comportamento e far sì che KDE blocchi lo schermo prima della sospensione, creare il seguente hook in systemd(1) come utente root:\n\n```\n/usr/lib/systemd/system-sleep/lock_before_suspend.sh\n```\n\n```\n#!/bin/bash\n\ncase $1/$2 in\n    pre/*)\n        case $2 in\n            suspend|hibernate)\n                loginctl lock-session\n                sleep 1\n                ;;\n            esac\n        ;;\nesac\n```\n\nL'utilizzo di sleep è necessario per permettere il completamento del blocco della sessione prima della sospensione del dispositivo. Un valore inferiore non permette il completamento.\n\nDopo aver creato il file, renderlo eseguibile.\n\nInfine, assicurarsi che l'impostazione KDE sia abilitata in selezionando la casella di spunta \"Dopo il risveglio dalla sospensione\" in Impostazioni di sistema > Comportamento dello spazio di lavoro > Blocco dello schermo.\n\n"
    },
    {
      "title": "Conflitto delle scorciatoie X11 in Wayland",
      "level": 3,
      "content": "Alcuni software X11 come freerdp possono catturare l'input della tastiera a partire da KDE 5.27. Altri come VMware non sono in grado di eseguire questa operazione correttamente. [14]\n\nForzare la cattura dell'input da tastiera in Xserver o nei compositori è una pratica inappropriata. [15] È possibile risolvere questo problema con una soluzione elegante procedendo come segue:\n\n- Fare clic con il tasto destro sulla barra del titolo della finestra (ad es. VMware o Citrix);\n- Altre azioni > Configura impostazioni specifiche per la finestra...\n- Fare clic su Aggiungi proprietà... e selezionare Ignora la scorciatoie globali.\n- Selezionare forza e sì. Applicare l'impostazione.\n\n"
    },
    {
      "title": "Vedere anche",
      "level": 2,
      "content": "- KDE homepage\n- KDE news\n- KDE Blogs\n- KDE Forums\n- KDE Wikis\n- KDE bug tracker and reporter\n- Martin Graesslin's blog\n- KDE Matrix Rooms\n\n"
    }
  ]
}