{
  "title": "KDE Plasma (Русский)",
  "url": "https://wiki.archlinux.org/title/KDE_Plasma_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Среда рабочего стола\n- Экранный менеджер\n- Оконный менеджер\n- Qt (Русский)\n- SDDM (Русский)\n- Dolphin\n- KDE Wallet\n- KDevelop\n- Trinity\n- Единый вид приложений Qt и GTK\n- Официальные репозитории#kde-unstable\n\nKDE — проект, состоящий из среды рабочего стола (Plasma), набора библиотек и фреймворков (KDE Frameworks), а также набора приложений (KDE Applications).\n\nKDE активно поддерживает вики-ресурс UserBase. Здесь пользователи могут получить наиболее актуальную и подробную информацию о большинстве приложений KDE.\n\n"
    },
    {
      "title": "Plasma",
      "level": 3,
      "content": "Установите мета-пакет plasma-meta или группу пакетов plasma. Для получения информации о различиях между ними смотрите статью Группа пакетов. Если вам нужна более минималистичная Plasma (с меньшим количеством установленных пакетов и приложений), установите пакет plasma-desktop. Смотрите также рекомендации по установке в документации KDE.\n\nЕсли у вас NVIDIA, вы используете проприетарный драйвер nvidia и хотите использовать сеанс Wayland, включите DRM kernel mode setting.\n\n"
    },
    {
      "title": "Plasma Mobile",
      "level": 3,
      "content": "Установите пакет plasma-mobileAUR. Также установите qt5-wayland для виртуальной клавиатуры Maliit.\n\n"
    },
    {
      "title": "Приложения KDE",
      "level": 3,
      "content": "Чтобы установить все приложения KDE (KDE Applications), установите группу пакетов kde-applications или мета-пакет kde-applications-meta. Если вы хотите установить только определённую категорию приложений (например, игры или образование), установите соответствующую зависимость kde-applications-meta. Обратите внимание, что установятся только приложения KDE, а не среда рабочего стола Plasma.\n\n"
    },
    {
      "title": "Нестабильные версии",
      "level": 3,
      "content": "Для получения информации о нестабильных версиях Plasma и KDE Applications смотрите статью Официальные репозитории#kde-unstable.\n\n"
    },
    {
      "title": "Запуск Plasma",
      "level": 2,
      "content": "Plasma можно запустить с помощью экранного менеджера или через консоль.\n\n"
    },
    {
      "title": "Используя экранный менеджер",
      "level": 3,
      "content": "- Выберите Plasma (Wayland) для запуска нового сеанса в Wayland.\n- Выберите Plasma (X11) для запуска нового сеанса в Xorg.\n- Выберите Plasma Mobile (Wayland) для запуска нового сеанса Plasma Mobile в Wayland.\n\n"
    },
    {
      "title": "Используя консоль",
      "level": 3,
      "content": "- Для запуска сеанса Plasma с Wayland из консоли выполните /usr/lib/plasma-dbus-run-session-if-needed /usr/bin/startplasma-wayland[1].\n- Для запуска Plasma с помощью xinit/startx добавьте строки export DESKTOP_SESSION=plasma и exec startplasma-x11 в файл .xinitrc или запустите его командой startx /usr/bin/startplasma-x11. Если вы хотите автоматически запускать Xorg при входе в систему, ознакомьтесь со статьёй xinit (Русский)#Автозапуск X при входе в систему.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Большинство настроек приложений KDE хранятся в каталоге ~/.config/. Однако для настройки KDE обычно используется графическое приложение Параметры системы, которое также можно запустить через терминал командой systemsettings.\n\n"
    },
    {
      "title": "Рабочий стол Plasma",
      "level": 4,
      "content": "Есть различные типы тем KDE, различающиеся по области своего действия:\n\n- Глобальные темы — комплексные пакеты, которые могут включать темы Plasma, стили приложений, цвета, шрифты, значки, курсоры, заставки, темы SDDM и цветовые схемы Konsole.\n- Темы Plasma, меняющие внешний вид панелей и виджетов Plasma. Для завершённого внешнего вида часто рекомендуется использовать сопутствующую тему Kvantum или Aurorae.\n- Стили приложений, меняющие внешний вид программ.\n- Стили приложений, которые используют движки тем, такие как Kvantum, QtCurve [2], QSvgStyle [3] и Aurorae.\n- #Темы значков для приложений, файлов и действий.\n\nДля удобства установки и обновления некоторые темы доступны как в официальных репозиториях, так и в AUR.\n\nГлобальные темы также можно установить через Параметры системы > Цвета и оформления > Оформление рабочей среды > Загрузить новые оформления.\n\nДля GTK-приложений рекомендуется использовать тему breeze-gtk, которая имитирует дизайн Breeze, использующийся в Plasma. Установите kde-gtk-config (часть группы пакетов plasma), перелогиньтесь и выберите Breeze в качестве темы GTK через Параметры системы > Цвета и оформления > Оформление приложений > Настроить оформление приложений GNOME/GTK....\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nВ некоторых случаях, подсказки в GTK-приложениях имеют белый текст на белом фоне, что заметно усложняет их чтение. Чтобы изменить цвета в GTK2-приложениях, найдите раздел для подсказок (\"tooltips\") в файле .gtkrc-2.0 и измените его. Для GTK3-приложений измените два файла: gtk.css и settings.ini.\n\nНекоторые GTK2-приложения (например, vuescan-binAUR) всё равно плохо смотрятся из-за невидимых флажков с темой Breeze или Adwaita в Plasma. Для решения этой проблемы, установите и выберите, к примеру, тему Numix-Frost-Light из пакета numix-frost-themesAUR в приложении Параметры системы > Цвета и оформления > Оформление приложений > Настроить оформление приложений GNOME/GTK... > Стиль программ GTK. Numix-Frost-Light также выглядит похоже на Breeze.\n\nPlasma и SDDM используют изображения из /var/lib/AccountsService/icons/ в качестве аватаров пользователей. Чтобы выбрать аватар с помощью графического интерфейса, перейдите в Параметры системы > Пользователи. Для восстановления стандартного аватара можно удалить файл с вашим именем пользователя.\n\nПлазмоиды — это виджеты для расширения функциональности рабочего стола Plasma. Они доступны в AUR.\n\nСкриптовые плазмоиды можно установить через контекстное меню панели или рабочего стола, выбрав Режим редактирования > Добавить виджеты... > Пополнить список виджетов... > Загрузить виджеты Plasma. Здесь вы сможете устанавливать, удалять и обновлять любые виджеты, размещённые на store.kde.org.\n\nУстановите plasma-pa или kmix (запустите Kmix из Меню запуска приложений). Обратите внимание, что plasma-pa устанавливается вместе с группой пакетов plasma и не требует настройки.\n\nВ связи с тем, что панель Plasma находится поверх других окон, её тень всегда падает на них. [4] Для отключения данной функции без влияния на какие-либо другие тени, установите xorg-xprop и выполните данную команду:\n\n```\n$ xprop -remove _KDE_NET_WM_SHADOW\n```\n\nзатем кликните курсором мыши на панель. [5] Для автоматизации данных действий установите xorg-xwininfo и создайте следующий скрипт:\n\n```\n/usr/local/bin/kde-no-shadow\n```\n\n```\n#!/bin/bash\nfor WID in $(xwininfo -root -tree | sed '/\"plasmashell\": (\"plasmashell\" \"plasmashell\")/!d; s/^  *\\([^ ]*\\) .*/\\1/g'); do\n   xprop -id $WID -remove _KDE_NET_WM_SHADOW\ndone\n```\n\nСделайте скрипт исполняемым.\n\nСкрипт можно добавить в автоматический запуск при входе в систему через Параметры системы > Автозапуск > Добавить сценарий входа в систему (если скрипт запускается слишком рано, может понадобиться добавить что-то вроде sleep 5):\n\n```\n$ kcmshell6 autostart\n```\n\nСмотрите HiDPI (Русский)#KDE Plasma.\n\n"
    },
    {
      "title": "Plasma Mobile",
      "level": 4,
      "content": "Репозиторий plasma-phone-settings предоставляет несколько рекомендуемых настроек, которые могут быть применены глобально (/etc/xdg) и/или для отдельного пользователя (~/.config).\n\n/etc/xdg/kscreenlockerrc (или ~/.config/kscreenlockerrc) блокирует экран сразу после входа. [6] Полезно в сочетании с автовходом экранного менеджера, например SDDM (Русский)#Автоматический вход в систему.\n\nЕсли на вашем устройстве есть физическая клавиатура, но вы всё равно хотите использовать виртуальную, добавьте переменную окружения KWIN_IM_SHOW_ALWAYS=1 в ваш сеанс Wayland.\n\n"
    },
    {
      "title": "Декорации окон",
      "level": 4,
      "content": "Декорации окон можно найти в AUR.\n\nИх можно настроить через Параметры системы > Цвета и оформления > Оформление окон; там же можно напрямую скачать и установить новые темы в один клик.\n\n"
    },
    {
      "title": "Темы значков",
      "level": 4,
      "content": "Темы значков устанавливаются и изменяются в приложении Параметры системы > Цвета и оформления > Значки.\n\n"
    },
    {
      "title": "Экономия места на экране",
      "level": 4,
      "content": "Рабочая среда Plasma Netbook была удалена из Plasma 5, подробности доступны на официальном форуме. Но несмотря на это, вы можете добиться похожего результата, в файле ~/.config/kwinrc добавив строку BorderlessMaximizedWindows=true в секции [Windows].\n\n"
    },
    {
      "title": "Генерирование эскизов файлов",
      "level": 4,
      "content": "Для генерирования эскизов медиафайлов и их предпросмотра в Dolphin или на рабочем столе установите пакеты kdegraphics-thumbnailers и ffmpegthumbs.\n\nЗатем выберите категории эскизов для отображения на рабочем столе: кликните ПКМ на обоях и перейдите в Настроить рабочий стол и обои... > Значки > Настроить модули предварительного просмотра....\n\nВ Dolphin данная функция находится в меню Настройка > Настроить Dolphin... > Интерфейс > Миниатюры.\n\n"
    },
    {
      "title": "Ночная цветовая схема",
      "level": 3,
      "content": "Plasma предоставляет функцию «Ночная цветовая схема» (Night Light), похожую на Redshift и поддерживающую как Xorg, так и Wayland. Она изменяет цветовую температуру, делая её теплее и тем самым уменьшая усталость глаз. Включить и настроить данную функцию можно в приложении Параметры системы > Цвета и оформления > Ночная цветовая схема.\n\n"
    },
    {
      "title": "Печать",
      "level": 3,
      "content": "Также принтеры можно настроить в приложении Параметры системы > Принтеры. Для этого установите пакеты print-manager, cups и system-config-printer. Подробнее о настройке CUPS вы можете прочитать на странице CUPS (Русский)#Настройка.\n\n"
    },
    {
      "title": "Поддержка Samba/Windows",
      "level": 3,
      "content": "Для предоставления общего доступа к файлам через Dolphin нужно установить пакет kdenetwork-filesharing и включить поддержку общих каталогов (usershares), которая в стандартном файле настроек (smb.conf) отключена по умолчанию. Инструкции по включению приведены в разделе Samba (Русский)#Создание ресурсов общего доступа от имени обычного пользователя. После выполнения инструкций и перезапуска Samba обмен файлами в Dolphin заработает.\n\nПодключение к общим каталогам Windows через Dolphin работает из коробки. Используйте адрес smb://имя_сервера/имя_ресурса для подключения и просмотра файлов.\n\nВ отличие от файловых менеджеров, основанных на GTK и использующих GVfs также для открытия программ, открытие файлов из общего каталога Samba в Dolphin (использующего KIO) сначала копирует файл целиком в локальную систему перед его открытием в большинстве программ (исключение — VLC). Для решения этой проблемы можно использовать файловые менеджеры на основе GTK, например, thunar с gvfs и gvfs-smb (и gnome-keyring для сохранения учётных данных).\n\nТакже можно смонтировать общий каталог Samba с помощью cifs-utils. Тогда Plasma будет воспринимать его как обычную локальную папку, к которой можно обращаться как обычно. Для более подробной информации смотрите статьи Samba (Русский)#Ручное монтирование и Samba (Русский)#Автоматическое монтирование.\n\nДля настройки подключения к Samba из графического интерфейса можно использовать samba-mounter-gitAUR, который предлагает практически ту же самую функциональность, но доступную в приложении Параметры системы > Network Drivers. Тем не менее, данная функциональность может ломаться с выходом новых версий KDE Plasma.\n\n"
    },
    {
      "title": "Комнаты KDE",
      "level": 3,
      "content": "Комнаты KDE (Desktop Activities) представляют собой специальные рабочие пространства, для каждого из которых можно задавать независимые настройки.\n\n"
    },
    {
      "title": "Управление питанием",
      "level": 3,
      "content": "Установите powerdevil для получения встроенной службы управления энергопотреблением Plasma. Данная служба предлагает дополнительные возможности по оптимизации энергопотребления, регулировке яркости экрана (если поддерживается) и получению информации о состоянии аккумуляторов устройств.\n\n"
    },
    {
      "title": "Автозапуск приложений",
      "level": 3,
      "content": "Plasma может автоматически запускать приложения и скрипты во время запуска и завершения работы. Для добавления приложения или скрипта в автозапуск перейдите в Параметры системы > Автозапуск. После добавления приложения или скрипта входа будет создан соответствующий файл .desktop.\n\n- Приложения могут быть автоматически запущены только во время входа в систему, тогда как скрипты могут быть также запущены при завершении работы или даже перед запуском Plasma.\n- Скрипты будут запущены только в том случае, если они являются исполняемыми.\n- Для скриптов, которые ранее размещались в ~/.config/autostart-scripts/, будет выполнена автоматическая миграция в файлы .desktop.\n\n- Разместите ярлыки приложений (то есть файлы .desktop) в соответствующем каталоге XDG Autostart.\n- Разместите или создайте символические ссылки на скрипты в одном из следующих каталогов: ~/.config/plasma-workspace/env/: для запуска скриптов во время входа в систему, перед запуском Plasma. ~/.config/plasma-workspace/shutdown/: для запуска скриптов во время завершения работы Plasma.\n\n- ~/.config/plasma-workspace/env/: для запуска скриптов во время входа в систему, перед запуском Plasma.\n- ~/.config/plasma-workspace/shutdown/: для запуска скриптов во время завершения работы Plasma.\n\nСмотрите также официальную документацию.\n\n"
    },
    {
      "title": "Phonon",
      "level": 3,
      "content": "Из Википедии:\n\nPhonon широко используется в среде KDE как для аудио (например, для системных уведомлений), так и для видео (например, для видео-миниатюр в Dolphin). Он поддерживает следующие бекенды:\n\n- VLC: phonon-qt6-vlc\n- GStreamer: phonon-qt6-gstreamer-gitAUR, для поддержки дополнительных кодеков смотрите GStreamer#Installation\n- mpv: phonon-qt6-mpvAUR, phonon-qt6-mpv-gitAUR\n\nKDE рекомендует только бекенд VLC. Бекенд GStreamer не поддерживается, но некоторые популярные дистрибутивы Linux (например, Kubuntu и Fedora-KDE) используют GStreamer по умолчанию, поскольку он позволяет убрать запатентованные кодеки MPEG из стандартной установки.\n\n- Можно установить несколько бекендов и изменять их приоритет в приложении phononsettings.\n- Согласно форуму KDE, у бекенда VLC отсутствует поддержка ReplayGain.\n- Во время использования бекенда на VLC могут наблюдаться сбои в работе приложений, когда Plasma хочет отправить уведомление со звуком (также и в некоторых других случаях) [7]. Данную проблему можно попробовать решить обновлением кеша плагинов VLC:\n\n```\n# /usr/lib/vlc/vlc-cache-gen /usr/lib/vlc/plugins\n```\n\n"
    },
    {
      "title": "Резервное копирование и восстановление",
      "level": 3,
      "content": "Plasma хранит пользовательские настройки в папке XDG_CONFIG_HOME. Вы можете посмотреть информацию об используемых файлах конфигурации и настроить их резервное копирование.\n\n"
    },
    {
      "title": "Запуск через systemd",
      "level": 3,
      "content": "Plasma использует пользовательский экземпляр systemd для запуска. Этот метод используется по умолчанию с версии 5.25, но его можно отключить и перейти на стартовые скрипты с помощью команды (однако это может перестать работать в будущем):\n\n```\n$ kwriteconfig6 --file startkderc --group General --key systemdBoot false\n```\n\nПодробнее о реализации можно почитать здесь: Edmundson's blog: plasma and the systemd startup.\n\n"
    },
    {
      "title": "Проверка орфографии",
      "level": 3,
      "content": "Для проверки орфографии приложения KDE используют фреймворк sonnet. Поддерживаемые им инструменты проверки орфографии указаны в опциональных зависимостях этого пакета.\n\nНастроить можно через Параметры системы > Проверка орфографии.\n\n"
    },
    {
      "title": "Запуск kwin wayland на NVIDIA",
      "level": 3,
      "content": "Смотрите https://community.kde.org/Plasma/Wayland/Nvidia.\n\n"
    },
    {
      "title": "Приложения",
      "level": 2,
      "content": "Проект KDE поставляет набор приложений, интегрированных в среду рабочего стола Plasma, полный список которых доступен в группе пакетов kde-applications. Также в категории Category:KDE (Русский) доступны статьи, относящиеся к приложениям KDE.\n\nКроме приложений, поставляемых в KDE Applications, доступны также и многие другие, дополняющие рабочий стол Plasma. Некоторые из них описаны ниже.\n\n"
    },
    {
      "title": "Сочетание клавиш для остановки X-сервера",
      "level": 4,
      "content": "Перейдите в Параметры системы > Клавиатура > Дополнительно (вкладка) и отметьте флажок Комбинация клавиш для прерывания работы X-сервера.\n\n"
    },
    {
      "title": "KCM",
      "level": 4,
      "content": "Модули KCM (KConfig Module) добавляют компоненты настройки системы в приложение Параметры системы. Также их можно запустить через командную строку командой kcmshell6.\n\n- sddm-kcm — Модуль для настройки SDDM.\n\n- kde-gtk-config — Конфигурация GTK2 и GTK3 для KDE.\n\n- wacom tablet — Графический интерфейс для Wacom Linux Drivers.\n\nБольше модулей KCM можно найти на сайте linux-apps.com.\n\n"
    },
    {
      "title": "Локальный поисковик",
      "level": 3,
      "content": "В KDE Plasma есть локальный поисковик — Baloo, который позволяет индексировать и искать файлы.\n\n"
    },
    {
      "title": "Веб-браузеры",
      "level": 3,
      "content": "Следующие веб-браузеры могут быть интегрированы в Plasma:\n\n- Konqueror — Часть проекта KDE. Поддерживает два движка — KHTML и Qt WebEngine, основанный на Chromium.\n\n- Falkon — Веб-браузер, основанный на Qt и включающий в себя возможности интеграции с Plasma. Использует движок Qt WebEngine.\n\n- Chromium — Chromium и его проприетарный вариант Google Chrome довольно ограничены в интеграции с Plasma. Они могут использовать KWallet и диалоги Plasma для открытия и сохранения файлов.\n\n- Firefox — Firefox можно настроить для большей интеграции с Plasma. Смотрите Firefox (Русский)#Интеграция с KDE для более подробной информации.\n\n"
    },
    {
      "title": "PIM",
      "level": 3,
      "content": "KDE поставляет свой собственный набор приложений для управления персональной информацией (personal information management, PIM), что включает в себя работу с электронными письмами, контактами, календарями и так далее. Чтобы установить все PIM-пакеты, воспользуйтесь группой пакетов kde-pim или мета-пакетом kde-pim-meta.\n\n"
    },
    {
      "title": "Akonadi",
      "level": 4,
      "content": "Akonadi представляет собой хранилище локального кеша для PIM-данных, которые, независимо от их происхождения, могут использоваться другими приложениями. Сюда входят: электронная почта, контакты, календари, события, журналы, будильники, заметки и так далее. Формат хранения данных зависит от самих данных (например, контакты могут храниться в формате vCard).\n\nУстановите пакет akonadi. Для получения дополнений установите kdepim-addons.\n\n- Если вы не планируете использовать MariaDB в качестве базы данных, то используйте следующую команду для пропуска зависимостей mariadb при установке пакета akonadi: # pacman -S akonadi --assume-installed mariadb Смотрите также FS#32878.\n- Если Akonadi не найдёт /usr/bin/mysqld при первом запуске, он станет использовать SQLite.\n\n```\n# pacman -S akonadi --assume-installed mariadb\n```\n\nПо умолчанию Akonadi использует /usr/bin/mysqld (по умолчанию это MariaDB, другие реализации описаны в статье MySQL (Русский)) для запуска собственного экземпляра MySQL с базой данных в ~/.local/share/akonadi/db_data/.\n\nAkonadi поддерживает использование общесистемного экземпляра MySQL для своей базы данных.[8]\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QMYSQL\n\n[QMYSQL]\nHost=\nName=akonadi_имя_пользователя\nOptions=\"UNIX_SOCKET=/run/mysqld/mysqld.sock\"\nStartServer=false\n```\n\nAkonadi поддерживает использование как существующего общесистемного экземпляра PostgreSQL (то есть postgresql.service), так и запуск PostgreSQL с правами пользователя и базой данных в ~/.local/share/akonadi/db_data/.\n\nУстановите пакеты postgresql и postgresql-old-upgrade.\n\nОтредактируйте файл конфигурации Akonadi так, чтобы он содержал следующие параметры:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QPSQL\n```\n\n- Секция [QPSQL] и её значения будут созданы во время запуска Akonadi.\n- База данных будет храниться в каталоге ~/.local/share/akonadi/db_data/.\n\nЗапустите Akonadi командой akonadictl start и проверьте его статус: akonadictl status.\n\n- Начиная с akonadi 19.08.0-1 кластер базы данных PostgreSQL ~/.local/share/akonadi/db_data/ автоматически обновляется при обнаружении нового крупного обновления PostgreSQL.\n- Более старые версии akonadi требуют обновления базы данных вручную после крупных обновлений PostgreSQL. Следуйте инструкциям обновления на KDE UserBase Wiki, чтобы обновить базу данных PostgreSQL в ~/.local/share/akonadi/db_data/, используемую Akonadi. Убедитесь, что заданы правильные пути к бинарным файлам PostgreSQL, используемые postgresql и postgresql-old-upgrade, смотрите PostgreSQL (Русский)#Обновление PostgreSQL.\n\nДанный метод требует уже настроенный и запущенный экземпляр PostgreSQL.\n\nСоздайте аккаунт пользователя PostgreSQL:\n\n```\n[postgres]$ createuser имя_пользователя\n```\n\nСоздайте базу данных для Akonadi:\n\n```\n[postgres]$ createdb -O имя_пользователя -E UTF8 --locale=C -T template0 akonadi-имя_пользователя\n```\n\nНастройте Akonadi, чтобы он использовал общесистемный PostgreSQL:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QPSQL\n\n[QPSQL]\nHost=/run/postgresql\nName=akonadi-имя_пользователя\nStartServer=false\n```\n\nЗапустите Akonadi командой akonadictl start и проверьте его статус: akonadictl status.\n\nДля использования SQLite отредактируйте файл конфигурации Akonadi так, чтобы он содержал следующие параметры:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QSQLITE\n```\n\n- Секция [QSQLITE] и её значения будут созданы во время запуска Akonadi.\n- База данных будет храниться в файле ~/.local/share/akonadi/akonadi.db.\n\nПользователи, которые хотят отключить Akonadi, должны не запускать приложения KDE, которые зависят от него. Смотрите раздел Disabling the Akonadi subsystem в KDE UserBase для более подробной информации.\n\n"
    },
    {
      "title": "KDE Connect",
      "level": 3,
      "content": "KDE Connect предлагает ряд функций для подключения телефона на базе Android или iOS к вашему устройству с Linux:\n\n- Пересылайте файлы и ссылки с KDE в любое приложение (и наоборот).\n- Эмуляция тачпада: используйте экран вашего смартфона как тачпад компьютера.\n- Синхронизация уведомлений (Android 4.3+): получайте уведомления с вашего Android-смартфона на рабочем столе.\n- Общий буфер обмена: копируйте на компьютере и вставляйте на телефоне (и наоборот).\n- Удалённое управление медиаконтентом: используйте ваш смартфон для управления медиаплеерами в Linux.\n- Подключение по Wi-Fi: нет нужды в проводах или Bluetooth.\n- Шифрование RSA: ваши данные в безопасности.\n\nВам нужно будет установить KDE Connect как на компьютере, так и на телефоне. На компьютере установите пакет kdeconnect. На Android установите KDE Connect из Google Play или F-Droid. Для доступа к файловой системе телефона также нужно установить пакет sshfs и дать соответствующее разрешение на доступ к ФС при запуске Android-приложения. На iOS установите KDE Connect из App Store. Не все функции из версии для Android доступны в версии для iOS.\n\nДля работы удалённого ввода в сеансе Wayland нужен пакет xdg-desktop-portal.\n\nKDE Connect можно использовать и с другими средами рабочего стола. Пользователи GNOME могут улучшить интеграцию с помощью установки gnome-shell-extension-gsconnectAUR вместо kdeconnect. Чтобы запустить демон KDE Connect вручную, выполните /usr/bin/kdeconnectd.\n\nЕсли вы используете межсетевой экран, вам потребуется открыть TCP- и UDP-порты от 1714 до 1764.\n\nИногда KDE Connect не обнаруживает телефон. Вы можете перезапустить службы, выполнив killall kdeconnectd, а затем открыв kdeconnect в системных настройках или выполнив команду kdeconnect-cli --refresh и затем kdeconnect-cli -l. В KDE Connect для Android также можно использовать Создать сопряжение с новым > Добавить устройства по IP.\n\n"
    },
    {
      "title": "Использование альтернативного оконного менеджера",
      "level": 3,
      "content": "В Plasma можно использовать оконный менеджер, отличный от KWin. Это позволяет сочетать функциональность рабочего стола KDE с удобством фреймового оконного менеджера, который может быть более проработанным, чем скрипты KWin для тайлинга.\n\nPlasma больше не позволяет выбирать альтернативный оконный менеджер в Параметрах системы, но его ещё можно изменить другими способами.\n\n"
    },
    {
      "title": "Замена службы KWin",
      "level": 4,
      "content": "Начиная с KDE 5.25, по умолчанию используется запуск через systemd.\n\nЗамаскируйте пользовательскую службу plasma-kwin_x11.service, чтобы KWin не запускался при запуске системы.\n\nЗатем создайте новую пользовательскую службу, которая будет запускать нужный вам оконный менеджер [9]:\n\n```\n~/.config/systemd/user/plasma-custom-wm.service\n```\n\n```\n[Install]\nWantedBy=plasma-workspace.target\n\n[Unit]\nDescription=Plasma Custom Window Manager\nBefore=plasma-workspace.target\n\n[Service]\nExecStart=/путь/к/оконному/менеджеру\nSlice=session.slice\nRestart=on-failure\n```\n\nДля использования выполните daemon-reload (в пользовательском экземпляре systemd), перепроверьте, что пользовательская служба plasma-kwin_x11.service замаскирована, и включите свежесозданную пользовательскую службу plasma-custom-wm.service.\n\n"
    },
    {
      "title": "Использование стартовых скриптов и KDEWM",
      "level": 4,
      "content": "Для перехода на стартовые скрипты отключите запуск через systemd, как описано в разделе #Запуск через systemd. После этого можно сменить оконный менеджер путём изменения переменной окружения KDEWM перед запуском Plasma.\n\nЕсли у вас есть root-доступ, можно добавить XSession, который будет доступен всем пользователям в качестве опции на экране входа в систему.\n\nСначала создайте такой скрипт и сделайте его исполняемым:\n\n```\n/usr/local/bin/plasma-i3.sh\n```\n\n```\n#!/bin/sh\nexport KDEWM=/usr/bin/i3\n/usr/bin/startplasma-x11\n```\n\nВместо /usr/bin/i3 можно указать путь к другому нужному вам оконному менеджеру. Убедитесь, что путь задан правильно. Если KDE не сможет запустить оконный менеджер, сеанс завершится неудачей и пользователь будет выброшен обратно на экран входа в систему.\n\nЗатем для добавления XSession создайте файл в /usr/share/xsessions/ с таким содержимым:\n\n```\n/usr/share/xsessions/plasma-i3.desktop\n```\n\n```\n[Desktop Entry]\nType=XSession\nExec=/usr/local/bin/plasma-i3.sh\nDesktopNames=KDE\nName=Plasma (i3)\nComment=KDE Plasma with i3 as the WM\nComment[ru]=KDE Plasma с оконным менеджером i3\n```\n\n"
    },
    {
      "title": "Сеанс KDE/Openbox",
      "level": 4,
      "content": "Пакет openbox предоставляет сеанс для использования KDE с Openbox. Чтобы его использовать, отключите #Запуск через systemd и выберите KDE/Openbox из меню экранного менеджера.\n\nДля запуска сеанса вручную добавьте следующую строку в ваш файл xinitrc:\n\n```\n~/.xinitrc\n```\n\n```\nexec openbox-kde-session\n```\n\n"
    },
    {
      "title": "Скрипты KWin для тайлинга",
      "level": 3,
      "content": "Список расширений KWin, с помощью которых можно сделать его более похожим на тайловые оконные менеджеры.\n\n- Bismuth — Дополнение, которое автоматически выполняет тайлинг окон и позволяет управлять ими с помощью клавиатуры, подобно i3, Sway или dwm.\n\n- Polonium — Неофициальный преемник Bismuth.\n\n- Kröhnkite — Расширение для динамического тайлинга, вдохновлённое dwm.\n\n- KZones — Скрипт, который имитирует поведение функции «Fancy Zones» из Microsoft PowerToys и Snap Layouts из Windows 11.\n\n"
    },
    {
      "title": "Настройка разрешения экрана / нескольких мониторов",
      "level": 3,
      "content": "Для настройки разрешения экрана и нескольких мониторов в Plasma установите пакет kscreen, после чего появятся дополнительные опции в приложении Параметры системы > Экран и монитор.\n\n"
    },
    {
      "title": "Настройка ICC-профилей",
      "level": 3,
      "content": "Для настройки ICC-профилей в Plasma установите пакет colord-kde, который добавляет дополнительные опции в Параметры системы > Управление цветом.\n\nICC-профили можно импортировать с помощью кнопки Импортировать профиль.\n\n"
    },
    {
      "title": "HDR",
      "level": 3,
      "content": "Поддержка HDR является экспериментальной и работает только в сеансе Wayland. Включить можно через Параметры системы > Экран и монитор > Расширенный динамический диапазон (HDR) > Включить HDR.\n\nДополнительную информацию можно найти в блоге Xaver Hugl и в статье HDR monitor support.\n\nВещи, которые работают:\n\n"
    },
    {
      "title": "Игры",
      "level": 4,
      "content": "Пока API не стабилизирован, некоторым играм для работы требуется Vulkan-слой vk-hdr-layer-kwin6-gitAUR.\n\n- Запустите Steam с включенным HDR. После этого всем играм будет доступен HDR, но игры и сам Steam будут находиться в окне gamescope.\n\n```\n$ gamescope --hdr-enabled --steam -- env DXVK_HDR=1 steam\n```\n\n- Чтобы включить HDR для отдельной игры, пропишите в её Параметры запуска:\n\n```\nDXVK_HDR=1 gamescope -f --hdr-enabled %command%\n```\n\n- Чтобы запустить игру не из Steam через gamescope:\n\n```\n$ DXVK_HDR=1 gamescope -f --hdr-enabled команда\n```\n\n- Запуск Windows-приложения с включенным HDR в Wine и Wayland\n\n```\n$ ENABLE_HDR_WSI=1 DXVK_HDR=1 DISPLAY=wine программа.exe\n```\n\n- Запуск Linux-игр с включенным HDR (например, Quake II RTX)\n\n```\n$ ENABLE_HDR_WSI=1 SDL_VIDEODRIVER=wayland quake2rtx\n```\n\n"
    },
    {
      "title": "Видео",
      "level": 4,
      "content": "Воспроизведение видео с HDR через MPV:\n\n```\n$ ENABLE_HDR_WSI=1 mpv --vo=gpu-next --target-colorspace-hint --gpu-api=vulkan --gpu-context=waylandvk \"путь/к/видео\"\n```\n\n"
    },
    {
      "title": "Отключение открытия Меню запуска приложений клавишей Super (Windows)",
      "level": 3,
      "content": "Для отключения данной функции пока что придётся напрямую отредактировать файл kwinrc, в разделе ModifierOnlyShortcuts прописав пустое значение для клавиши Meta:\n\n```\n$XDG_CONFIG_HOME/kwinrc\n```\n\n```\n[ModifierOnlyShortcuts]\nMeta=\n```\n\nИли можно воспользоваться следующей командой:\n\n```\n$ kwriteconfig6 --file kwinrc --group ModifierOnlyShortcuts --key Meta \"\"\n```\n\n"
    },
    {
      "title": "Отключение отображения закладок браузера в меню приложений",
      "level": 3,
      "content": "KDE отображает закладки браузера в меню запуска приложений, если работает интеграция браузера с Plasma (Plasma Browser Integration).\n\nДля отключения этой функции перейдите в Параметры системы > Поиск > Поиск Plasma и отключите Закладки.\n\n"
    },
    {
      "title": "Интеграция с IBus",
      "level": 3,
      "content": "IBus — это фреймворк методов ввода; он может быть интегрирован в KDE. Подробнее смотрите IBus#Integration.\n\nИспользование IBus может потребоваться при использовании KDE на Wayland для поддержки акцентов и dead keys [10].\n\n"
    },
    {
      "title": "Включение точки доступа в plasma-nm",
      "level": 3,
      "content": "Смотрите NetworkManager#Sharing internet connection over Wi-Fi.\n\n"
    },
    {
      "title": "Восстановление предыдущего сеанса",
      "level": 3,
      "content": "Если выбран пункт Параметры системы > Сеанс > Управление сеансами > Восстановление сеанса > Восстанавливать приложения, которые были запущены: Перед последним выходом из системы (по умолчанию), то ksmserver будет автоматически сохранять открытые приложения в файл ~/.config/ksmserverrc и загружать их оттуда при следующем входе.\n\n"
    },
    {
      "title": "Получение локальной почты в KMail",
      "level": 3,
      "content": "Если вы настроили доставку локальной почты на почтовом сервере, который использует формат Maildir, вы можете захотеть получать эту почту в KMail. Для этого вы можете повторно использовать стандартную учётную запись KMail «Локальные папки», которая хранит почту в ~/.local/share/local-mail/.\n\nСоздайте символическую ссылку ~/Maildir (куда обычно доставляется почта в формате Maildir), ведущую на папку входящих сообщений Local Folders:\n\n```\n$ ln -s .local/share/local-mail/inbox ~/Maildir\n```\n\nИли создайте новую учётную запись с типом Maildir и укажите для неё каталог ~/Maildir.\n\n"
    },
    {
      "title": "Настройка Plasma для всех пользователей",
      "level": 3,
      "content": "Измените файлы config/main.xml в каталоге /usr/share/plasma. Например, чтобы настроить Application Launcher для всех пользователей, измените файл /usr/share/plasma/plasmoids/org.kde.plasma.kickoff/contents/config/main.xml. Чтобы предотвратить перезапись файлов при обновлении пакетов, добавьте файлы в список NoUpgrade в Pacman.\n\n"
    },
    {
      "title": "Особые параметры окон",
      "level": 3,
      "content": "В Kwin есть возможность задавать параметры для определённых окон/приложений. Например, вы можете принудительно включить панель заголовка окна, даже если разработчик приложения решил, что её не должно быть. Можно задать начальную позицию, размер, сворачивание, расположение выше/ниже других и так далее.\n\nДля создания параметра нажмите Alt+F3, когда нужное окно находится в фокусе. Затем в Дополнительно > Настроить индивидуальные параметры окна/приложения можно задать нужное свойство. Список созданных параметров доступен через Параметры системы > Диспетчер окон > Особые параметры окон.\n\n"
    },
    {
      "title": "Виртуальная клавиатура",
      "level": 3,
      "content": "По умолчанию виртуальные клавиатуры не установлены. Выберите подходящую (смотрите List of applications/Utilities#On-screen keyboards), например Maliit, и установите её. Затем включите её через Параметры системы.\n\n"
    },
    {
      "title": "После обновления до KDE 6 приложения KDE не запускаются в GNOME",
      "level": 3,
      "content": "В приложениях KDE 6 по умолчанию используется Wayland, и они не работают под GNOME Wayland (и, возможно, под другими средами). Можно заставить приложения работать через X11, установив переменную окружения QT_QPA_PLATFORM=xcb.\n\nЭто обходное решение для багов KDE, а не проблема самого́ Wayland.\n\n"
    },
    {
      "title": "После обновления до KDE 6 пропали значки KDE",
      "level": 3,
      "content": "После обновления до KDE 6 могут пропасть значки KDE, при этом в свежесозданной учётной записи значки работают.\n\nПроблема в том, что при обновлении потерялась тема, и её нужно выбрать заново. Для этого перейдите в Параметры системы > Цвета и оформления > Значки и выберите желаемую тему значков.\n\n"
    },
    {
      "title": "Огромные или непропорциональные шрифты",
      "level": 3,
      "content": "Попробуйте вручную задать значение DPI равное 96 через Параметры системы > Текст и шрифты > Шрифты.\n\nЕсли это не помогло, попробуйте также вручную установить значение DPI в конфигурации сервера Xorg, как указано на странице Xorg (Русский)#Настройка DPI вручную.\n\n"
    },
    {
      "title": "Настройки",
      "level": 3,
      "content": "Множество проблем в KDE могут возникать из-за ошибок в файлах настроек.\n\n"
    },
    {
      "title": "Странное поведение рабочего стола Plasma",
      "level": 4,
      "content": "Проблемы в Plasma обычно вызваны нестабильными виджетами (плазмоидами) или темами Plasma. Первым делом найдите, какие плазмоиды и темы вы недавно устанавливали, и попробуйте их отключить или удалить.\n\nЕсли вы наблюдаете проблемы с зависанием/закрытием Plasma, скорее всего, они вызваны ошибкой в одном из установленных виджетов. Если вы не помните, какие из них были установлены до появления проблемы (она может быть непостоянной), попробуйте убирать их по одному до исчезновения проблемы. Убедившись, что проблема оказалась в последнем удалённом виджете, вы можете создать отчёт об ошибке на баг-трекере KDE, но только если это официальный виджет. В ином случае рекомендуется найти виджет на KDE Store и уведомить его автора о проблеме (указывая детали, например, как повторить ошибку).\n\nЕсли вы не можете найти источник проблемы, но не хотите сбрасывать все настройки, перейдите в каталог ~/.config/ и введите следующую команду:\n\n```\n$ for j in plasma*; do mv -- \"$j\" \"${j%}.bak\"; done\n```\n\nДанная команда переименует все файлы конфигурации Plasma вашего пользователя в *.bak (например, plasmarc.bak), и, когда вы перезайдёте в Plasma, вы снова получите настройки по умолчанию. Для возвращения предыдущего состояния файлов конфигурации достаточно будет убрать расширение .bak. Если у вас уже есть файлы *.bak, сначала переименуйте, переместите или удалите их. Также крайне рекомендуется регулярно создавать бекапы, смотрите статью Программы синхронизации и резервного копирования для получения информации о возможных решениях.\n\n"
    },
    {
      "title": "Очистка кэша для решения проблем с обновлением",
      "level": 4,
      "content": "Также проблемы могут быть вызваны старыми данными в кэше. Иногда после обновления они могут вызывать странное, мало предсказуемое и трудное в отладке поведение рабочего стола или программ KDE. Например, незакрываемые оболочки, зависания во время изменения различных настроек, невозможность Ark извлечь архив или невозможность Amarok распознать вашу коллекцию музыки. Очистка кэша также может помочь решить проблему с плохим внешним видом программ KDE или Qt после обновления.\n\nПерестроить кэш можно следующими командами:\n\n```\n$ rm ~/.config/Trolltech.conf\n$ kbuildsycoca6 --noincremental\n```\n\nДополнительно можно удалить содержимое каталога ~/.cache/. Обратите внимание, что это также очистит и кэш других программ:\n\n```\n$ rm -rf ~/.cache/*\n```\n\n"
    },
    {
      "title": "Рабочий стол Plasma не соблюдает настройки локали/языка",
      "level": 4,
      "content": "Рабочий стол Plasma может использовать настройки, отличные от тех, которые вы задали в параметрах KDE или в файле locale.conf (согласно Локали#Переменные окружения). Первое, что нужно сделать, это выйти из системы и войти в неё после удаления файла ~/.config/plasma-localerc, а если это не поможет, попробуйте отредактировать файл вручную. Например, установить переменную LANG в ru_RU.UTF-8, а переменную LC_MESSAGES в en_US.UTF-8:\n\n```\n~/.config/plasma-localerc\n```\n\n```\n[Formats]\nLANG=ru_RU.UTF-8\n\n[Translations]\nLANGUAGE=en_US\n```\n\n"
    },
    {
      "title": "Не получается изменить тему, значки, шрифты, цвета в параметрах системы; большинство значков не отображается",
      "level": 4,
      "content": "Убедитесь, что переменная окружения QT_QPA_PLATFORMTHEME не установлена, команда printenv QT_QPA_PLATFORMTHEME должна не вывести ничего. В противном случае, если она установлена (скорее всего qt5ct или qt6ct), переменная будет принудительно устанавливать настройки qt5ct/qt6ct для Qt-приложений, команда export QT_QPA_PLATFORMTHEME= должна снять переменную.\n\nБолее простым (и более надёжным) решением может быть полное удаление qt5ct и qt6ct.\n\n"
    },
    {
      "title": "Не работают уведомления, мультимедийные клавиши или изменение громкости",
      "level": 4,
      "content": "Это может быть связано с тем, что отключение отображения некоторых пунктов в настройках трея (виджета «Системный лоток»), таких как «Громкость», «Проигрыватель» или «Уведомления», приводит к отключению связанных с этим функций. Так, при отключении «Громкости» перестанут работать клавиши изменения громкости, «Проигрывателя» — мультимедийные клавиши (перемотка, стоп, пауза), «Уведомлений» — отображение уведомлений.\n\n"
    },
    {
      "title": "Настройки входа в систему не синхронизируют настройки курсора с SDDM",
      "level": 4,
      "content": "Настройки входа в систему считывают настройки курсоров из ~/.config/kcminputrc, без этого файла настройки не будут синхронизироваться. Наиболее простой способ сгенерировать данный файл — изменить настройки курсора в приложении Параметры системы > Цвета и оформления > Курсоры мыши, после чего вернуть предпочитаемую тему курсоров.\n\n"
    },
    {
      "title": "Отсутствуют панели/виджеты",
      "level": 4,
      "content": "Сбой или изменение аппаратного обеспечения может изменить номера экранов, даже при использовании одного монитора. Панели/виджеты могут пропасть, это можно исправить в файле ~/.config/plasma-org.kde.plasma.desktop-appletsrc, изменив значения lastScreen.\n\n"
    },
    {
      "title": "Графика",
      "level": 3,
      "content": "Убедитесь, что в системе установлен подходящий драйвер для вашей видеокарты. Смотрите статью Xorg (Русский)#Установка драйвера для получения более подробной информации. В случае с более старой видеокартой может помочь #Отключение эффектов рабочего стола вручную или автоматически для определённых приложений или #Отключение композитного режима.\n\n"
    },
    {
      "title": "Получение текущего состояния KWin для поддержки и отладки",
      "level": 4,
      "content": "Следующая команда выведет полную сводку о текущем состоянии KWin включая использующиеся настройки, данные о композитном бекенде и возможностях драйвера OpenGL. Более подробная информация доступна в данном блоге.\n\n```\n$ qdbus6 org.kde.KWin /KWin org.kde.KWin.supportInformation\n```\n\n"
    },
    {
      "title": "Отключение эффектов рабочего стола вручную или автоматически для определённых приложений",
      "level": 4,
      "content": "Эффекты рабочего стола Plasma активированы по умолчанию и, к примеру, не каждая игра автоматически их отключает. Вы можете выключить эффекты рабочего стола вручную в приложении Параметры системы > Диспетчер окон > Эффекты рабочего стола и включать/выключать их с помощью сочетания клавиш Alt+Shift+F12.\n\nТакже можно создать собственные правила KWin для автоматического включения/выключения композитного режима при запуске определённых программ в приложении Параметры системы > Диспетчер окон > Особые параметры окон.\n\n"
    },
    {
      "title": "Включение прозрачности",
      "level": 4,
      "content": "Вы увидите следующее сообщение при использовании прозрачного фона без включения композитора:\n\n```\nThis color scheme uses a transparent background which does not appear to be supported on your desktop\n```\n\nПерейдите в Параметры системы > Экран и монитор > Обеспечение эффектов, отметьте флажок Графические эффекты: Включать при входе в систему и перезапустите Plasma.\n\n"
    },
    {
      "title": "Отключение композитного режима",
      "level": 4,
      "content": "В приложении Параметры системы > Экран и монитор > Обеспечение эффектов снимите флажок с опции Графические эффекты: Включать при входе в систему и перезапустите Plasma.\n\n"
    },
    {
      "title": "Мерцание окон в полноэкранном режиме при включённом композитном режиме",
      "level": 4,
      "content": "В приложении Параметры системы > Экран и монитор > Обеспечение эффектов снимите флажок с опции Графические эффекты: Разрешать приложениям блокировать режим с графическими эффектами. Это может снизить производительность.\n\n"
    },
    {
      "title": "Курсор иногда отображается неправильно",
      "level": 4,
      "content": "Создайте каталог ~/.local/share/icons/default/ (или ~/.icons/default) и файл index.theme внутри него со следующим содержимым:\n\n```\n~/.local/share/icons/default/index.theme\n```\n\n```\n[Icon Theme]\nInherits=breeze_cursors\n```\n\nМожно заменить breeze_cursors на желаемую тему курсора, например Breeze_Light (темы курсора находятся в каталоге /usr/share/icons/).\n\nДля Wayland также нужно установить xdg-desktop-portal-gtk, чтобы тема курсора применялась в приложениях GTK/GNOME.\n\nЕсли Firefox и Thunderbird работают через Wayland, они считывают настройки курсора через GSettings.\n\nДля синхронизации настроек KDE с приложениями GTK установите kde-gtk-config.\n\nЕсли устанавливать лишний пакет не хочется, можно указать тему курсора вручную:\n\n```\n$ gsettings set org.gnome.desktop.interface cursor-theme название-темы\n```\n\n"
    },
    {
      "title": "Мигающий курсор во время изменения его вида",
      "level": 4,
      "content": "Если курсор начинает мигать при изменении его вида (например, при наведении на ссылку), попробуйте установить соответствующий драйвер для ускорения 2D-операций в системе и оконном менеджере.\n\n"
    },
    {
      "title": "Непригодное для использования множество разрешений экрана",
      "level": 4,
      "content": "Локальные настройки kscreen могут переопределять параметры xorg.conf. Просмотрите конфигурационные файлы kscreen в каталоге ~/.local/share/kscreen/ и проверьте, не задано ли режиму (mode) неподдерживаемое вашим экраном разрешение.\n\n"
    },
    {
      "title": "Размытые значки в системном трее",
      "level": 4,
      "content": "Приложения часто используют библиотеку appindicator для добавления значков в трей. Если они отображаются размытыми, проверьте установленную версию библиотеки в системе. В случае, если установлен только пакет libappindicator-gtk2, попробуйте также установить libappindicator-gtk3.\n\n"
    },
    {
      "title": "Не получается изменить разрешение экрана при запуске в виртуальной машине",
      "level": 4,
      "content": "При запуске Plasma в виртуальной машине VMware, VirtualBox или QEMU kscreen иногда не может выставить разрешение экрана гостя больше чем 800x600.\n\nВ качестве обходного пути можно установить опцию PreferredMode в xorg.conf.d(5). Также можно попробовать использовать другой графический адаптер для ВМ: например, в VirtualBox вместо VMSVGA использовать VboxSVGA, а в QEMU — Virtio вместо QXL. Смотрите KDE Bug 407058 для подробностей.\n\n"
    },
    {
      "title": "Dolphin, Kate и другие программы надолго подвисают при открытии",
      "level": 4,
      "content": "Проверьте, не являются ли пользовательские каталоги (Документы, Загрузки и т. д.) доступными только для чтения.\n\n"
    },
    {
      "title": "Снимок экрана в Spectacle использует старое состояние экрана",
      "level": 4,
      "content": "Зайдите в Параметры системы > Экран и монитор > Обеспечение эффектов и переключите Создавать миниатюры окон на Не создавать. Если вы используете GPU Intel, убедитесь, что xf86-video-intel не установлен.\n\n"
    },
    {
      "title": "Отсутствие звука после выхода из ждущего режима",
      "level": 4,
      "content": "В случае если в Plasma отсутствует звук после выхода из ждущего режима и KMix не отображает нужных аудиоустройств, может помочь перезапуск plasmashell и pulseaudio:\n\n```\n$ killall plasmashell\n$ systemctl --user restart pulseaudio.service\n$ plasmashell\n```\n\nДругим приложениям тоже может понадобиться перезапуск для возобновления возможности воспроизводить звук.\n\n"
    },
    {
      "title": "MP3-файлы не воспроизводятся с бекендом GStreamer в Phonon",
      "level": 4,
      "content": "Эту проблему можно решить установкой плагина libav (пакет gst-libav) для GStreamer. Если всё равно есть проблемы, попробуйте другой бекенд для Phonon, например phonon-qt6-vlc.\n\nТакже убедитесь, что выбранный вами бекенд имеет самый высокий приоритет, в приложении phononsettings.\n\n"
    },
    {
      "title": "Нет значка громкости в трее и громкость не регулируется мультимедийными клавишами",
      "level": 4,
      "content": "Проверьте, что пакет plasma-pa установлен.\n\n"
    },
    {
      "title": "Пропадает звук через некоторое время",
      "level": 4,
      "content": "Если journalctl -p4 -t pulseaudio содержит Failed to create sink input: sink is suspended, попробуйте закомментировать следующую строку в /etc/pulse/default.pa:\n\n```\n#load-module module-suspend-on-idle\n```\n\nЕсли проблема осталась, возможно, plasma-meta или plasma установили pulseaudio вместе с wireplumber. Для решения проблемы замените pulseaudio на pipewire-pulse. Если вы хотите использовать pulseaudio, замените wireplumber на pipewire-media-session. Смотрите PipeWire (Русский)#Клиенты PulseAudio и тему на форуме для более подробной информации.\n\n"
    },
    {
      "title": "Отсутствие ждущего/спящего режима",
      "level": 4,
      "content": "Если система может переходить в спящий или ждущий режим через systemd, но данная опция не отображается в KDE, убедитесь, что установлен пакет powerdevil.\n\n"
    },
    {
      "title": "Нет настройки профиля управления питанием",
      "level": 4,
      "content": "Убедитесь, что пакеты powerdevil и power-profiles-daemon установлены. Выполните команду powerprofilesctl в консоли и проверьте используемый драйвер. Если есть intel_pstate или amd_pstate, то всё хорошо, а если нет, то смотрите раздел CPU frequency scaling#Scaling drivers.\n\n"
    },
    {
      "title": "Сброс настроек Akonadi для решения проблем с KMail",
      "level": 4,
      "content": "Смотрите [11] для получения подробной информации.\n\nЕсли необходимо сделать резервную копию настроек, скопируйте следующие каталоги:\n\n```\n$ cp -a ~/.local/share/akonadi ~/.local/share/akonadi-old\n$ cp -a ~/.config/akonadi ~/.config/akonadi-old\n```\n\n"
    },
    {
      "title": "Пустая папка входящих сообщений в IMAP-аккаунте KMail",
      "level": 4,
      "content": "Для некоторых аккаунтов KMail, использующих протокол IMAP, папка входящих сообщений может отображаться в виде контейнера верхнего уровня (таким образом делая прочтение сообщений невозможным) со всеми остальными папками в нём.[12]. Для решения этой проблемы достаточно отключить подписки на стороне сервера (server-side subscriptions) в настройках аккаунта в KMail.\n\n"
    },
    {
      "title": "Ошибка авторизации EWS-аккаунта в KMail",
      "level": 4,
      "content": "При добавлении EWS-аккаунта в KMail могут возникнуть ошибки авторизации даже с корректными и работающими данными. Вероятнее всего, это вызвано нарушением связи KWallet (англ.) и KMail. Для решения проблемы задайте пароль с помощью qdbus:\n\n```\n$ qdbus6 org.freedesktop.Akonadi.Resource.akonadi_ews_resource_0 /Settings org.kde.Akonadi.Ews.Wallet.setPassword \"XXX\"\n```\n\n"
    },
    {
      "title": "Слишком частое журналирование событий QXcbConnection / kscreen.xcb.helper",
      "level": 3,
      "content": "Смотрите Qt (Русский)#Настройка журнала Qt.\n\n"
    },
    {
      "title": "Приложения на KF5/Qt 5 не отображают значки в i3/FVWM/awesome",
      "level": 3,
      "content": "Смотрите Qt (Русский)#Настройка приложений Qt 5 в средах, отличных от KDE Plasma.\n\n"
    },
    {
      "title": "Проблемы с сохранением учётных данных и постоянно появляющимися диалогами KWallet",
      "level": 3,
      "content": "KWallet, систему сохранения паролей, не рекомендуется отключать в настройках пользователя, так как для каждого из них сохраняются некоторые зашифрованные данные, например, пароли от сетей WiFi. Однако постоянно появляющиеся диалоги KWallet могут стать причиной его отключения.\n\nВ случае если вас раздражают диалоги разблокировки KWallet когда приложения хотят получить к нему доступ, можно разрешить экранным менеджерам SDDM и LightDM автоматически разблокировать бумажник при входе в систему – смотрите KDE Wallet#Unlock KDE Wallet automatically on login. Первый бумажник должен быть сгенерирован непосредственно KWallet (а не пользователем), чтобы использовать его при входе в систему.\n\nВ случае если вы не хотите открывать в памяти учётные данные бумажника для каждого приложения, можно ограничить доступ некоторых программ к нему с помощью kwalletmanager в настройках KWallet.\n\nЕсли же вы совсем не беспокоитесь насчёт шифрования учётных данных, можно просто оставить поля для ввода пароля пустыми во время создания бумажника в KWallet. В таком случае приложения смогут получать доступ к бумажнику без его предварительной разблокировки.\n\n"
    },
    {
      "title": "Discover не отображает приложения",
      "level": 3,
      "content": "Проблему можно решить установкой пакета packagekit-qt6 или packagekit-qt5 в зависимости от версии Plasma/Qt.\n\n"
    },
    {
      "title": "Discover перестал показывать обновления из репозиториев Arch",
      "level": 3,
      "content": "Иногда Discover не снимает блокировку PackageKit alpm. Чтобы снять её вручную, удалите /var/lib/PackageKit/alpm/db.lck. Нажмите кнопку Обновить в Discover, и обновления должны появиться (если есть какие-либо неустановленные обновления).\n\n"
    },
    {
      "title": "Высокая нагрузка kscreenlocker_greet на ЦП при использовании драйверов NVIDIA",
      "level": 3,
      "content": "Как описано в KDE Bug 347772 (англ.), драйвера NVIDIA OpenGL и QML могут не очень хорошо взаимодействовать друг с другом в Qt 5. Это может привести к тому, что kscreenlocker_greet будет использовать довольно много ресурсов ЦП после разблокировки сессии. Для исправления данной проблемы задайте переменной окружения QSG_RENDERER_LOOP значение basic.\n\nПосле чего закройте предыдущий процесс экрана приветствия с помощью команды killall kscreenlocker_greet.\n\n"
    },
    {
      "title": "\"OS error 22\" при работе Akonadi на ZFS",
      "level": 3,
      "content": "Если ваш домашний каталог находится в пуле ZFS, создайте файл ~/.config/akonadi/mysql-local.conf со следующим содержанием:\n\n```\n[mysqld]\ninnodb_use_native_aio = 0\n```\n\nСмотрите также MariaDB#OS error 22 when running on ZFS.\n\n"
    },
    {
      "title": "Не работает прокрутка неактивных окон в некоторых программах",
      "level": 3,
      "content": "Проблема вызвана тем, что GTK3 проблематично обрабатывает события прокрутки мышью. Временным решением является задание переменной окружения GDK_CORE_DEVICE_EVENTS=1. Однако такое решение также не позволяет использовать плавную прокрутку на тачпаде и прокрутку на сенсорном дисплее.\n\n"
    },
    {
      "title": "Медленно работающий TeamViewer",
      "level": 3,
      "content": "TeamViewer может медленно работать при включённых плавных анимациях (таких как сворачивание окон). Временным решением является #Отключение композитного режима.\n\n"
    },
    {
      "title": "Kmail, Kontact и Wayland",
      "level": 3,
      "content": "Kmail может зависнуть, показывать чёрное окно просмотра сообщения или что-то подобное, часто после сворачивания и восстановления. Обходным решением может быть установка переменной окружения QT_QPA_PLATFORM=\"xcb;wayland\". Смотрите KDE Bug 397825.\n\n"
    },
    {
      "title": "Разблокировка виджетов (Plasma ≥ 5.18)",
      "level": 3,
      "content": "Если вы ранее заблокировали свои виджеты, вы, вероятно, не сможете разблокировать их снова. Для этого нужно просто выполнить эту команду:\n\n```\n$ qdbus6 org.kde.plasmashell /PlasmaShell evaluateScript \"lockCorona(false)\"\n```\n\nНовый Customize Layout не требует блокировать их обратно, но если вы хотите это сделать:\n\n```\n$ qdbus6 org.kde.plasmashell /PlasmaShell evaluateScript \"lockCorona(true)\"\n```\n\n"
    },
    {
      "title": "KIO открывает ссылки в неправильной программе",
      "level": 3,
      "content": "Проверьте ассоциации файлов HTML, PHP и т.д. и измените их на браузер. Файлы кэша KIO находятся в $HOME/.cache/kioexec. Смотрите также xdg-utils (Русский)#Обработчики URL схем.\n\n"
    },
    {
      "title": "Блокировка экрана перед уходом в ждущий или спящий режим",
      "level": 3,
      "content": "В приложении «Параметры системы» KDE предлагает настройку для автоматической блокировки экрана после пробуждения компьютера. При возобновлении работы некоторые пользователи сообщают, что экран успевает ненадолго отобразиться перед фактической блокировкой. Чтобы предотвратить такое поведение и заставить KDE блокировать экран перед уходом в сон, создайте хук systemd(1), создав следующий файл от имени root:\n\n```\n/usr/lib/systemd/system-sleep/lock_before_suspend.sh\n```\n\n```\n#!/bin/bash\n\ncase $1/$2 in\n    pre/*)\n        case $2 in\n            suspend|hibernate)\n                loginctl lock-session\n                sleep 1\n                ;;\n            esac\n        ;;\nesac\n```\n\nИспользование sleep необходимо для того, чтобы команда loginctl lock-session успела выполниться до фактического перехода в сон.\n\nПосле создания файла сделайте его исполняемым.\n\nНаконец, в параметрах KDE поставьте галочку Блокировка экрана > Блокировать экран автоматически после: После выхода из ждущего режима.\n\n"
    },
    {
      "title": "Конфликт сочетаний клавиш X11 в Wayland",
      "level": 3,
      "content": "Некоторые программы X11 вроде freerdp могут захватывать ввод клавиатуры с KDE 5.27. Другие, такие как VMware, не могут захватить его корректно. [13]\n\nПринудительный захват в Xserver или в композиторах неуместен. [14] Эту проблему можно решить следующим элегантным способом:\n\n- Нажмите правой кнопкой мыши на панели заголовка окна (например, VMware или Citrix);\n- Дополнительно > Настроить индивидуальные параметры окна...\n- Нажмите Добавить свойство... и выберите Игнорировать глобальные комбинации клавиш.\n- Выберите значения Принудительно и Да. Примените изменения.\n\n"
    },
    {
      "title": "Изменение системных настроек не применяется",
      "level": 3,
      "content": "Такое может случиться, если каталог .config почему-то оказался недоступен для изменения.\n\nДля исправления измените владельца каталога и его содержимого на себя:\n\n```\n# chown пользователь:пользователь /home/пользователь/.config\n```\n\nпользователь — имя пользователя, который работает в KDE Plasma. Если домашний каталог находится в другом месте, измените путь к нему в этой команде.\n\nЕсли это не поможет, также попробуйте изменить права доступа:\n\n```\n# chmod 755 /home/пользователь/.config\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Домашняя страница KDE (англ.)\n- Домашняя страница KDE Россия\n- Новости KDE (англ.)\n- Блоги KDE (англ.)\n- Форумы KDE (англ.)\n- Вики KDE (англ.)\n- Баг-трекер KDE (англ.)\n- Блог Мартина Греслина (англ.)\n- Комнаты KDE в Matrix\n\n"
    }
  ]
}