{
  "title": "KDE Plasma (Português)",
  "url": "https://wiki.archlinux.org/title/KDE_Plasma_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artigo ou esta seção precisa de tradução.** Este artigo ou esta seção precisa de tradução.\n\nEste artigo ou esta seção precisa de tradução.\n\nArtigos relacionados\n\n- Ambiente de desktop\n- Gerenciador de exibição\n- Gerenciador de janela\n- Qt\n- SDDM\n- Dolphin\n- Carteira do KDE\n- KDevelop\n- Trinity\n- Visual uniforme para aplicativos Qt e GTK\n\nO KDE é um projeto de software que atualmente compreende um ambiente de desktop conhecido como Plasma, uma coleção de bibliotecas e frameworks (KDE Frameworks) e vários aplicativos (aplicativos do KDE) também. O upstream KDE tem um wiki de UserBase bem mantido. Informações detalhadas sobre a maioria dos aplicativos do KDE podem ser encontradas lá.\n\n"
    },
    {
      "title": "Plasma",
      "level": 3,
      "content": "Antes de instalar o Plasma, certifique-se de ter uma instalação Xorg em funcionamento no seu sistema.\n\nInstale o meta-pacote plasma-meta ou o grupo plasma. Para diferenças entre plasma-meta e plasma, consulte Grupo de pacotes. Como alternativa, para uma instalação mínima de Plasma, instale o pacote plasma-desktop.\n\n"
    },
    {
      "title": "Aplicativos do KDE",
      "level": 3,
      "content": "Para instalar o conjunto completo de Aplicativos do KDE, instale o grupo kde-applications ou o meta-pacote kde-applications-meta. Observe que isso só instalará aplicativos, não instalará nenhuma versão do Plasma.\n\n"
    },
    {
      "title": "Lançamentos instáveis",
      "level": 3,
      "content": "Veja Repositórios oficiais#kde-unstable\n\n"
    },
    {
      "title": "Iniciando o Plasma",
      "level": 2,
      "content": "Plasma pode ser iniciado usando um gerenciador de exibição ou o console.\n\n"
    },
    {
      "title": "Usando um gerenciador de exibição",
      "level": 3,
      "content": "- Selecione Plasma para iniciar uma nova sessão no Xorg.\n- Selecione Plasma (Wayland) para iniciar uma nova sessão no Wayland.\n\n"
    },
    {
      "title": "Do console",
      "level": 3,
      "content": "- Para iniciar o Plasma com xinit/startx, anexe exec startplasma-x11 ao seu arquivo .xinitrc. Se você quiser iniciar o Xorg no login, consulte Iniciar X no login.\n- Para iniciar uma sessão do Plasma no Wayland a partir de um console, execute XDG_SESSION_TYPE=wayland dbus-run-session startplasma-wayland.[1]\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "A maioria das configurações para aplicativos do KDE é armazenada em ~/.config/. No entanto, a configuração do KDE é feita principalmente através do aplicativo Configurações do sistema. Pode ser iniciado a partir de um terminal executando systemsettings.\n\n"
    },
    {
      "title": "Plasma desktop",
      "level": 4,
      "content": "Temas de Plasma definem a aparência de painéis e widgets do Plasma. Para facilitar a instalação em todo o sistema, alguns temas estão disponíveis nos repositórios oficiais e no AUR.\n\nTemas do Plasma também podem ser instalados por meio de Configurações do sistema > Tema global > Baixar novos temas globais....\n\nO KDE Store oferece mais personalizações ao Plasma, como temas do SDDM e telas de inicialização (splash-screens).\n\nO tema recomendado para uma aparência agradável em aplicativos GTK é o breeze-gtk, um tema GTK projetado para imitar a aparência do tema Breeze do Plasma. Instale kde-gtk-config (parte do grupo plasma) e selecione Breeze ou Breeze-Dark como o tema GTK2/GTK3 em Configurações do sistema > Estilo do aplicativo > Configurar estilo de aplicativos GNOME/GTK....\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nEm alguns temas, as dicas de ferramentas nos aplicativos GTK têm texto branco em fundo branco, dificultando a leitura. Para alterar as cores nos aplicativos GTK2, encontre a seção para dicas de ferramentas no arquivo .gtkrc-2.0 e altere-a. Para aplicativo GTK3, dois arquivos precisam ser alterados, gtk.css e settings.ini.\n\nAlguns programas GTK2 como vuescan-binAUR ainda parecem pouco utilizáveis devido a caixas de seleção invisíveis com a capa Breeze ou Adwaita em uma sessão de Plasma. Para resolver isso, instale e selecione, por exemplo, o tema Numix-Frost-Light do numix-frost-themesAUR em Configurações do sistema > Estilo dos aplicativos > Configurar estilo de aplicativos GNOME/GTK... > Tema GTK2:. Numix-Frost-Light se parece com o Breeze.\n\nO plasma e o SDDM usarão um arquivo PNG encontrado em ~/.face.icon como avatar do usuário. Para configurar com uma interface gráfica, você pode usar Configurações do sistema > Detalhes da conta > Gerenciador de Usuários. O ícone padrão pode ser encontrado em /usr/share/sddm/faces/.\n\nPlasmoides são pequenos aplicativos do KDE em scripts (scripts plasmoides) ou em códigos (binários plasmoides) projetados para melhorar a funcionalidade do seu ambiente gráfico.\n\nA maneira mais fácil de instalar scripts plasmoides é clicando com o botão direito do mouse em um painel ou na área de trabalho e escolhendo Adicionar widgets > Baixar novos widgets... > Baixar novos widgets do Plasma. Isto irá apresentar um bom frontend para https://store.kde.org/ que permite instalar, desinstalar ou atualizar scripts de plasmoides de terceiros com literalmente apenas um clique.\n\nMuitos binários plasmoides estão disponíveis no AUR.\n\nInstale plasma-pa ou kmix (inicie Kmix a partir do Lançador de aplicativos). plasma-pa está agora instalado por padrão com plasma, nenhuma outra configuração é necessária.\n\nComo o painel do Plasma está em cima de outras janelas, sua sombra é desenhada sobre elas. [2] Para desabilitar esse comportamento sem afetar outras sombras, instale xorg-xprop e execute:\n\n```\n$ xprop -remove _KDE_NET_WM_SHADOW\n```\n\nem seguida, selecione o painel com o cursor de tamanho maior. [3] Para automação, instale o xorg-xwininfo e crie o seguinte script:\n\n```\n/usr/local/bin/kde-no-shadow\n```\n\n```\n#!/bin/bash\nfor WID in $(xwininfo -root -tree | sed '/\"Plasma\": (\"plasmashell\" \"plasmashell\")/!d; s/^  *\\([^ ]*\\) .*/\\1/g'); do\n   xprop -id $WID -remove _KDE_NET_WM_SHADOW\ndone\n```\n\nDefina permissões de execução para o script:\n\n```\n# chmod 755 /usr/local/bin/kde-no-shadow\n```\n\nO script pode ser executar ao iniciar sessão com Adicionar script em Iniciar automaticamente:\n\n```\n$ kcmshell5 autostart\n```\n\n"
    },
    {
      "title": "Decorações de janela",
      "level": 4,
      "content": "Decorações da janela podem ser alteradas em Configurações do sistema > Estilo dos aplicativos > Decorações da janela.\n\nLá você também pode baixar e instalar diretamente mais temas com um clique e alguns disponíveis no AUR.\n\n"
    },
    {
      "title": "Temas de ícone",
      "level": 4,
      "content": "Temas de ícones podem ser instalados e alterados em Configurações do sistema > Ícones.\n\n"
    },
    {
      "title": "Eficiência de espaço",
      "level": 4,
      "content": "O shell Plasma Netbook foi retirado do Plasma 5, veja a seguinte publicação do fórum do KDE. No entanto, você pode conseguir algo semelhante editando o arquivo ~/.config/kwinrc adicionando BorderlessMaximizedWindows=true na seção [Windows].\n\n"
    },
    {
      "title": "Geração de miniatura",
      "level": 4,
      "content": "Para permitir a geração de miniaturas para arquivos de mídia ou documentos na área de trabalho e no Dolphin, instale o kdegraphics-thumbnailers e o ffmpegthumbs.\n\nEm seguida, ative as categorias de miniaturas para a área de trabalho através de clique direito no plano de fundo da área de trabalho > Configurar área de trabalho > Ícones > Mais Opções de Prévia....\n\nNo Dolphin, navegue até Controle > Configurar o Dolphin... > Geral > Visualizações.\n\n"
    },
    {
      "title": "Cor norturna",
      "level": 3,
      "content": "O Plasma fornece um recurso semelhante ao do Redshift (funcionando com Xorg e Wayland) chamado Cor noturna. Ele torna as cores na tela mais quentes para reduzir a fadiga ocular no momento da sua escolha. Ele pode ser ativado em Configurações do sistema > Tela e monitor > Cor noturna.\n\n"
    },
    {
      "title": "Impressão",
      "level": 3,
      "content": "Você também pode configurar impressoras em Configurações do sistema > Impressoras. Para usar este método, você deve primeiro instalar os seguintes pacotes print-manager, cups e system-config-printer. Veja CUPS#Configuration.\n\n"
    },
    {
      "title": "Suporte a Windows/Samba",
      "level": 3,
      "content": "Se você quiser ter acesso aos serviços do Windows, instale o Samba (pacote samba).\n\nA funcionalidade de compartilhamento do Dolphin requer o pacote kdenetwork-filesharing e usershares, que o arquivo smb.conf não habilitou. As instruções para adicioná-las estão no Samba#Ativar_compartilhamentos_de_usuário, após o qual o compartilhamento no Dolphin deve funcionar imediatamente após o reinício do Samba.\n\nAo contrário dos navegadores de arquivos GTK que utilizam o GVfs também para o programa iniciado, abrir arquivos de compartilhamentos Samba no Dolphin via KIO faz com que o Plasma copie o arquivo inteiro para o sistema local primeiro com a maioria dos programas (VLC é uma exceção). Para resolver isso, você pode usar um navegador de arquivos baseado em GTK como thunar com gvfs e gvfs-smb (e gnome-keyring para salvar credenciais de login) para acessar compartilhamentos SMB de uma maneira mais eficiente.\n\nOutra possibilidade é montar um compartilhamento Samba via cifs-utils para fazer com que pareça o Plasma como se o compartilhamento SMB fosse apenas uma pasta local normal e, portanto, pudesse ser acessado normalmente. Veja Samba#Montagem manual e Samba #Montagem automática.\n\nUma solução de GUI está disponível com samba-mounter-gitAUR, que oferece basicamente a mesma funcionalidade através de uma opção fácil de usar localizada em Configurações do sistema > Drivers de Rede. No entanto, pode quebrar com novas versões do KDE Plasma.\n\n"
    },
    {
      "title": "Atividades do ambiente KDE",
      "level": 3,
      "content": "Atividades do ambiente KDE são espaços especiais nos quais você pode selecionar configurações específicas para cada atividade que se aplica apenas quando você está usando aquela atividade.\n\n"
    },
    {
      "title": "Gerenciamento de energia",
      "level": 3,
      "content": "Instale powerdevil para um serviço integrado de gerenciamento de energia Plasma. Este serviço oferece recursos adicionais de economia de energia, controle de brilho do monitor (se suportado) e relatório de bateria, incluindo dispositivos periféricos.\n\n"
    },
    {
      "title": "Inicialização automática",
      "level": 3,
      "content": "O Plasma pode iniciar automaticamente aplicativos e executar scripts na inicialização e no desligamento. Para iniciar automaticamente um aplicativo, navegue até Configurações do sistema > Inicialização e desligamento > Iniciar automaticamente e adicione o programa ou shell script de sua escolha. Para aplicativos, um arquivo .desktop será criado, para scripts de shell, um link simbólico será criado.\n\n- Os programas podem ser iniciados automaticamente somente no login, enquanto os shell scripts também podem ser executados no desligamento ou até mesmo antes do início do Plasma.\n- Os scripts do shell só serão executados se estiverem marcados com executável.\n\n- Coloque entradas de desktop (p.ex., arquivos .desktop) no diretório de inicialização automática XDG apropriado.\n\n- Coloque ou faça link simbólico para scripts shell em um dos seguintes diretórios:\n\n"
    },
    {
      "title": "Phonon",
      "level": 3,
      "content": "Do Wikipedia:\n\nO Phonon está sendo amplamente usado no KDE, tanto para áudio (por exemplo, as notificações do sistema ou aplicativos de áudio do KDE) como para vídeo (por exemplo, as miniaturas de vídeo do Dolphin).\n\n"
    },
    {
      "title": "Qual backend eu devo escolher?",
      "level": 4,
      "content": "Você pode escolher entre backends baseados no GStreamer e VLC – cada um disponível em versões para aplicativos Qt4 e aplicativos Qt5 (phonon-qt4-gstreamerAUR, phonon-qt5-gstreamer – phonon-qt4-vlcAUR, phonon-qt5-vlc).\n\nUpstream prefere VLC, mas proeminentes distribuições Linux (Kubuntu e Fedora-KDE, por exemplo) preferem o GStreamer porque isso permite que eles deixem de fora facilmente os codecs MPEG patenteados da instalação padrão. Ambos os backends têm um conjunto de recursos um pouco diferente [4]. O backend do Gstreamer possui alguma dependência de codec opcional, instale-os conforme necessário:\n\n- gst-libav — Codecs de libav.\n- gst-plugins-good — Suporte a PulseAudio e codecs adicionais.\n- gst-plugins-ugly — codecs adicionais.\n- gst-plugins-bad — codecs adicionais.\n\nNo passado, outros backends também foram desenvolvidos, mas não são mais mantidos e seus pacotes AUR foram excluídos.\n\n- Vários backends podem ser instalados de uma só vez e priorizado por meio do aplicativo phononsettings.\n- De acordo com os fóruns do KDE, o backend VLC carece de suporte para ReplayGain.\n- Se usar o backend do VLC, você poderá encontrar travamentos toda vez que o Plasma quiser lhe enviar um aviso sonoro e em vários outros casos também [5]. Uma possível correção é reconstruir o cache de plugins do VLC:\n\n```\n# /usr/lib/vlc/vlc-cache-gen /usr/lib/vlc/plugins\n```\n\n"
    },
    {
      "title": "Aplicativos",
      "level": 2,
      "content": "O projeto KDE fornece um conjunto de aplicativos que se integram ao desktop Plasma. Veja o grupo kde-applications para uma lista completa dos aplicativos disponíveis. Veja também Category: KDE para páginas de aplicativos relacionadas ao KDE.\n\nAlém dos programas fornecidos nos aplicativos do KDE, há muitos outros aplicativos disponíveis que podem complementar o ambiente do Plasma. Alguns destes são discutidos abaixo.\n\n"
    },
    {
      "title": "Encerrar o servidor Xorg por meio de Configurações do Sistema KDE",
      "level": 4,
      "content": "Navegue até o submenu Configurações do sistema > Dispositivos de entrada > Teclado > Avançado (aba) > \"Sequência de teclas para mantar o servidor X\" e verifique se a caixa de seleção está marcada.\n\n"
    },
    {
      "title": "KCM",
      "level": 4,
      "content": "KCM significa KConfig Module. Os KCMs podem ajudá-lo a configurar seu sistema fornecendo interfaces nas configurações do sistema, ou através da linha de comando com kcmshell6.\n\n- sddm-kcm — Módulo de configuração do KDE para SDDM.\n\n- kde-gtk-config — Configurador GTK2 e GTK3 para KDE.\n\n- wacom tablet — Interface gráfica do KDE para drivers Linux de Wacom.\n\n- Kcmsystemd — Módulo de controle de systemd para KDE.\n\nMais KCMs podem ser encontrados em linux-apps.com.\n\n"
    },
    {
      "title": "Pesquisa do ambiente",
      "level": 3,
      "content": "O KDE implementa a pesquisa na área de trabalho com um software chamado Baloo, uma solução de indexação e busca de arquivos.\n\n"
    },
    {
      "title": "Navegadores web",
      "level": 3,
      "content": "Os seguintes navegadores da web podem se integrar ao Plasma:\n\n- Konqueror — Parte do projeto KDE, possui suporte a dois motores de renderização – o KHTML e o Qt WebEngine baseado no Chromium.\n\n- Falkon — Um navegador web Qt com recursos de integração do Plasma, anteriormente conhecido como Qupzilla. Ele usa o Qt WebEngine.\n\n- Chromium — O Chromium e sua variante proprietária, o Google Chrome, têm uma integração limitada ao Plasma. Eles podem usar o KWallet e janelas de abrir/salvar do KDE.\n\n- Firefox — Firefox pode ser configurado para melhor integrar ao Plasma. Veja integração do Firefox com KDE para detalhes.\n\n"
    },
    {
      "title": "PIM",
      "level": 3,
      "content": "O KDE oferece sua própria pilha para gerenciamento de informações pessoais (PIM). Isso inclui e-mails, contatos, calendário, etc. Para instalar todos os pacotes PIM, você pode usar o grupo de pacotes kde-pim ou o metapacote kde-pim-meta.\n\n"
    },
    {
      "title": "Akonadi",
      "level": 4,
      "content": "O Akonadi é um sistema destinado a atuar como um cache local para dados do PIM, independentemente de sua origem, que pode ser usado por outros aplicativos. Isso inclui os e-mails, contatos, calendários, eventos, diários, alarmes, notas e assim por diante do usuário. O Akonadi não armazena dados por si só: o formato de armazenamento depende da natureza dos dados (por exemplo, os contatos podem ser armazenados no formato vCard).\n\nInstale akonadi. Para extensões adicionais, instale kdepim-addons.\n\nNote: Veja também FS#32878.\n\n```\n# pacman -S akonadi --assume-installed mariadb\n```\n\nVeja também FS#32878.\n\nPor padrão, o Akonadi vai usar /usr/bin/mysqld (MariaDB por padrão, veja MySQL para provedores alternativos) para executar uma instância MySQL gerenciada com o banco de dados armazenado em ~/.local/share/akonadi/db_data/.\n\nO Akonadi possui suporte ao uso de MySQL para todo sistema para seu banco de dados.[6]\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QMYSQL\n\n[QMYSQL]\nHost=\nName=akonadi_usuário\nOptions=\"UNIX_SOCKET=/run/mysqld/mysqld.sock\"\nStartServer=false\n```\n\nO Akonadi possui suporte tanto a instância existente do sistema PostgreSQL, ou seja, postgresql.service, ou a execução de uma instância do PostgreSQL com privilégios de usuário e o banco de dados em ~/.local/share/akonadi/db_data/.\n\nInstale postgresql e postgresql-old-upgrade.\n\nEdite o arquivo de configuração do Akonadi para que ele tenha o seguinte conteúdo:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QPSQL\n```\n\n- Quando o Akonadi iniciar, ele criará a seção [QPSQL] e configurará as variáveis apropriadas.\n- O banco de dados será armazenado em ~/.local/share/akonadi/db_data/.\n\nInicie Akonadi com akonadictl start e verifique seu estado: akonadictl status.\n\n- A partir do akonadi 19.08.0-1, o cluster de banco de dados do PostgreSQL em ~/.local/share/akonadi/db_data/ será atualizado automaticamente quando uma atualização de versão do postgreSQL é detectada.\n- Para as versões anteriores do akonadi, as principais atualizações da versão do PostgreSQL exigirão uma atualização manual do banco de dados. Siga as instruções de atualização no KDE UserBase Wiki. Certifique-se de ajustar os caminhos dos binários do PostgreSQL para aqueles usados pelo postgresql e pelo postgresql-old-upgrade, veja PostgreSQL#Upgrading PostgreSQL.\n\nIsso requer um já configurado e executando o PostgreSQL.\n\nCrie uma conta de usuário do PostgreSQL para seu usuário:\n\n```\n[postgres]$ createuser usuário\n```\n\nCrie um banco de dados para o Akonadi:\n\n```\n[postgres]$ createdb -O usuário --locale=en_US.UTF-8 -T template0 akonadi-usuário\n```\n\nConfigure o Akonadi para usar o PostgreSQL em todo o sistema:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QPSQL\n\n[QPSQL]\nHost=/run/postgresql\nName=akonadi-usuário\nStartServer=false\n```\n\nInicie Akonadi com akonadictl start e verifique seu estado: akonadictl status.\n\nPara usar SQLite, edit o arquivo de configuração do Akonadi para corresponder à configuração abaixo:\n\n```\n~/.config/akonadi/akonadiserverrc\n```\n\n```\n[%General]\nDriver=QSQLITE3\n```\n\n- Quando o Akonadi inicia, ele vai criar a seção [QSQLITE3] e definir as variáveis apropriadas nele.\n- O banco de dados será armazenado como ~/.local/share/akonadi/akonadi.db.\n\nVeja essa seção no KDE UserBase.\n\n"
    },
    {
      "title": "KDE Connect",
      "level": 3,
      "content": "KDE Connect fornece vários recursos para conectar seu telefone Android ao seu desktop Linux:\n\n- Compartilhamento de arquivos e URLs para/do KDE de/para qualquer aplicativo, sem fios.\n- Emulação do touchpad: use a tela do telefone como o touchpad do seu computador.\n- Notificações sincronizadas (4.3+): leia as notificações do Android no computador.\n- Área de transferência compartilhada: copie e cole entre seu telefone e seu computador.\n- Controle remoto de multimídia: utilize o seu telefone como controle remoto para leitores multimídia do Linux.\n- Conexão WiFi: não é necessário fio USB ou Bluetooth.\n- Criptografia RSA: suas informações estão seguras.\n\nVocê precisará instalar o KDE Connect tanto no seu computador quanto no seu Android. Para o lado do PC, instale o pacote kdeconnect. Do lado do Android, instale o KDE Connect do Google Play ou do F-Droid. Se você quiser navegar pelo sistema de arquivos do seu telefone, você também precisa instalar o sshfs e configurar as exposições do sistema de arquivos em seu aplicativo Android.\n\nPara o correto funcionamento da entrada remota no wayland voce precisa instalar o pacote xdg-desktop-portal.\n\nÉ possível usar o KDE Connect mesmo que você não use ao ambiente Plasma. Para usuários do GNOME, uma melhor integração pode ser obtida instalando gnome-shell-extension-gsconnectAUR em vez de kdeconnect. Para iniciar o daemon do KDE Connect manualmente, execute /usr/lib/kdeconnectd.\n\nSe você usa um firewall, você precisa abrir as portas UDP e TCP 1714 até 1764. Veja https://community.kde.org/KDEConnect#Troubleshooting.\n\n"
    },
    {
      "title": "Usar um gerenciador de janela diferente",
      "level": 3,
      "content": "As configurações do seletor de componentes no Plasma não permitem mais alterar o gerenciador de janela. [7] Para alterar o gerenciador de janela usado, você precisa definir a variável de ambiente KDEWM antes da inicialização do KDE. As instruções estão disponíveis no KDE UserBase Wiki — Tutorials/Using Other Window Managers with Plasma.\n\n"
    },
    {
      "title": "Sessão KDE/Openbox",
      "level": 4,
      "content": "O pacote openbox fornece uma sessão para usar o KDE com Openbox. Para fazer uso desta sessão, selecione KDE/Openbox no menu do gerenciador de exibição.\n\nPara aqueles que iniciam a sessão manualmente, adicione a seguinte linha à sua configuração do xinit (Português):\n\n```\n~/.xinitrc\n```\n\n```\nexec openbox-kde-session\n```\n\n"
    },
    {
      "title": "Reabilitar efeitos de composição",
      "level": 4,
      "content": "Ao substituir o Kwin por um gerenciador de janelas que não forneça um Compositor (como o Openbox), quaisquer efeitos de composição do ambiente, por exemplo, transparência será perdida. Nesse caso, instale e execute um gerenciador composto separado para fornecer os efeitos, como Xcompmgr ou Compton.\n\n"
    },
    {
      "title": "Configurando resolução do monitor / vários monitores",
      "level": 3,
      "content": "Para ativar o gerenciamento de resolução de tela e vários monitores no Plasma, instale o kscreen. Isso fornece opções adicionais para Configurações do sistema > Tela e monitor.\n\n"
    },
    {
      "title": "Configurando perfis ICC",
      "level": 3,
      "content": "Para ativar perfis ICC no Plasma, instale colord-kde. Isso fornece opções adicionais para Configurações do sistema > Correções de cores.\n\nOs perfis ICC podem ser importados usando Adicionar perfil.\n\n"
    },
    {
      "title": "Desabilitar a abertura do lançador de aplicativos com a tecla Super (tecla Windows)",
      "level": 3,
      "content": "Para desabilitar esse recurso, você pode executar o seguinte comando:\n\n```\n$ kwriteconfig5 --file kwinrc --group ModifierOnlyShortcuts --key Meta \"\"\n```\n\n"
    },
    {
      "title": "Desabilitar exibição de Favoritos no menu de aplicativos",
      "level": 3,
      "content": "Com a integração do navegador com o Plasma instalada, o KDE mostrará favoritos no lançador de aplicativos.\n\nPara desabilitar esse recurso, você atualmente pode executar os seguintes comandos:\n\n```\n$ mkdir ~/.local/share/kservices5\n$ sed 's/EnabledByDefault=true$/EnabledByDefault=false/' /usr/share/kservices5/plasma-runner-bookmarks.desktop > ~/.local/share/kservices5/plasma-runner-bookmarks.desktop\n```\n\n"
    },
    {
      "title": "Fontes em uma sessão do Plasma têm visual ruim",
      "level": 4,
      "content": "Tente instalar os pacotes ttf-dejavu e ttf-liberation.\n\nApós a instalação, certifique-se de sair e voltar. Você não deve modificar nada em Configurações do sistema > Fontes. Se você estiver usando o qt5ct, as configurações da Qt5 Configuration Tool poderão substituir as configurações de fonte nas Configurações do sistema.\n\nSe você configurou pessoalmente como sua Fontes renderiza, esteja ciente de que as Configurações do sistema podem alterar sua aparência. Quando você vai Configurações do sistema > Fontes, Configurações do sistema provavelmente irá alterar o seu arquivo de configuração de fontes (fonts.conf).\n\nNão há como evitar isso, mas, se você definir os valores para corresponder ao seu arquivo fonts.conf, a renderização de fonte esperada retornará (será necessário reiniciar o aplicativo ou, em alguns casos, reiniciar sua área de trabalho). Note que as preferências de fonte do GNOME também fazem isso.\n\n"
    },
    {
      "title": "Fontes são gigantes ou parecem desproporcionais",
      "level": 4,
      "content": "Tente forçar o DPI da fonte para 96 em Configurações do sistema > Fontes.\n\nSe isso não funcionar, tente configurar o DPI diretamente na sua configuração do Xorg como documentado em Xorg#Definindo o DPI manualmente.\n\n"
    },
    {
      "title": "Configuração relatada",
      "level": 3,
      "content": "Muitos problemas no KDE estão relacionados à sua configuração.\n\n"
    },
    {
      "title": "O ambiente Plasma se comporta de forma estranha",
      "level": 4,
      "content": "Os problemas no Plasma são geralmente causados por widgets de Plasma instáveis (coloquialmente chamados de plasmoides) ou temas de Plasma. Primeiro, descubra qual foi o último widget ou tema que você instalou e desative ou desinstale-o.\n\nPortanto, se seu ambiente exibir um \"bloqueio\", isso provavelmente é causado por um widget instalado defeituoso. Se você não consegue lembrar qual widget você instalou antes do problema começar (às vezes pode ser um problema irregular), tente rastreá-lo removendo cada widget até que o problema cesse. Então você pode desinstalar o widget, e preencher um relatório de erro no rastreador de erros do KDE somente se for um widget oficial. Se não for, é recomendado encontrar a entrada na KDE Store e informar o desenvolvedor do widget sobre o problema (detalhando os passos para se reproduzir, etc.).\n\nSe você não conseguir encontrar o problema, mas não quiser que todas as configurações sejam perdidas, navegue até ~/.config/ e execute o seguinte comando:\n\n```\n$ for j in plasma*; do mv -- \"$j\" \"${j%}.bak\"; done\n```\n\nEste comando vai renomear todos os arquivos de configuração relacionados ao Plasma para *.bak (por exemplo, plasmarc.bak) do seu usuário e quando você entrar no Plasma, você terá o configurações padrão de volta. Para desfazer essa ação, remova a extensão de arquivo .bak. Se você já tiver arquivos *.bak, renomeie, mova ou exclua-os primeiro. É altamente recomendável que você crie backups regulares de qualquer maneira. Veja Programas de sincronização e backup para uma lista de possíveis soluções.\n\n"
    },
    {
      "title": "Limpar cache para resolver problemas de atualização",
      "level": 4,
      "content": "O problema pode ser causado por um cache antigo. Às vezes, após uma atualização, o cache antigo pode apresentar um comportamento estranho, difícil de depurar, como shells que não podem ser encerrados, travamentos ao alterar várias configurações, sendo que o Ark não consegue extrair arquivos ou o Amarok não reconhece nenhuma de suas músicas. Esta solução também pode resolver problemas com os aplicativos do KDE e do Qt que ficam ruins após uma atualização.\n\nRecompile o cache usando os seguintes comandos:\n\n```\n$ rm ~/.config/Trolltech.conf\n$ kbuildsycoca5 --noincremental\n```\n\nOpcionalmente, esvazie o conteúdo da pasta ~/.cache/, porém isso também vai limpar o cache de outros aplicativos:\n\n```\n$ rm -rf ~/.cache/*\n```\n\n"
    },
    {
      "title": "Não é possível alterar o tema, ícones, fontes, cores nas configurações do sistema; a maioria dos ícones não é exibida",
      "level": 4,
      "content": "Certifique-se de que a variável de ambiente QT_QPA_PLATFORMTHEME esteja desmarcada, o comando printenv QT_QPA_PLATFORMTHEME deve mostrar a saída vazia. A variável é usada normalmente para forçar as configurações qt5ct nos aplicativos Qt.\n\n"
    },
    {
      "title": "Teclas de controle do volume, notificações e multimídia não funcionam",
      "level": 4,
      "content": "Ocultar determinados itens nas configurações da área de notificação (por exemplo, Volume do áudio, Reprodutor de mídia ou Notificações) também desativa os recursos relacionados. Ao ocultar o Volume do áudio desativa as teclas de controle de volume, Reprodutor de mídia desativa as teclas multimídia (rebobinar, parar, pausar) e ocultar Notificações desativa a exibição de notificações.\n\n"
    },
    {
      "title": "A tela de autenticação KCM não sincroniza as configurações do cursor para SDDM",
      "level": 4,
      "content": "A tela de autenticação do KCM lê as configurações do cursor em ~/.config/kcminputrc, sem esse arquivo nenhuma configuração é sincronizada. A maneira mais fácil de gerar esse arquivo é alterar o tema do cursor em Configurações do sistema > Cursores e alterá-lo novamente para o tema preferido de cursor.\n\n"
    },
    {
      "title": "Problemas gráficos",
      "level": 3,
      "content": "Certifique-se de ter o driver adequado para a sua GPU instalada. Veja Xorg#Instalação de driver para mais informações. Se você tiver uma placa mais antiga, poderá ajudar a #Desabilitar efeitos do ambiente manualmente ou automaticamente para aplicativos definidos ou #Desabilitar composição.\n\n"
    },
    {
      "title": "Obtendo o estado atual de KWin para propósito de suporte e depuração",
      "level": 4,
      "content": "Esse comando exibe um resumo do estado atual do KWin, incluindo opções usadas, back-end de composição usada e recursos relevantes do driver OpenGL. Veja mais no blog do Martin.\n\n```\n$ qdbus org.kde.KWin /KWin supportInformation\n```\n\n"
    },
    {
      "title": "Desabilitar efeitos do ambiente manualmente ou automaticamente para aplicativos definidos",
      "level": 4,
      "content": "O Plasma tem efeitos do ambiente ativados por padrão e, por exemplo, nem todo jogo irá desabilitá-los automaticamente. Você pode desativar os efeitos da área de trabalho em Configurações do sistema > Comportamento da Área de Trabalho > Efeitos da área de trabalho e pode alternar os efeitos da área de trabalho com Alt+Shift+F12.\n\nAlém disso, você pode criar regras personalizadas do KWin para desabilitar/habilitar automaticamente a composição quando um determinado aplicativo/janela é iniciado em Configurações do sistema > Gerenciamento de Janelas > Regras das janelas.\n\n"
    },
    {
      "title": "Habilitar transparência",
      "level": 4,
      "content": "Se você usar um fundo transparente sem habilitar o compositor, você receberá a mensagem:\n\n```\nEste esquema de cores usa um fundo transparente, que parece não ser suportado pelo seu ambiente de trabalho\n```\n\nEm Configurações do sistema > Tela e monitor > Compositor, marque Ativar o compositor na inicialização e reinicie o Plasma.\n\n"
    },
    {
      "title": "Desabilitar composição",
      "level": 4,
      "content": "Em Configurações do sistema > Tela e monitor > Compositor, desmarque Ativar o compositor na inicialização e reinicie Plasma.\n\n"
    },
    {
      "title": "Oscilação em tela cheia quando composição está habilitada",
      "level": 4,
      "content": "Em Configurações do sistema > Tela e monitor > Compositor, desmarque Permitir que os aplicativos bloqueiem a composição. Isso pode prejudicar o desempenho.\n\n"
    },
    {
      "title": "O cursor do Plasma algumas vezes é mostrado incorretamente",
      "level": 4,
      "content": "Crie o diretório ~/.icons/default e, dentro, um arquivo chamado index.theme com o seguinte conteúdo:\n\n```\n~/.icons/default/index.theme\n```\n\n```\n[Icon Theme]\nInherits=breeze_cursors\n```\n\nExecute o seguinte comando:\n\n```\n$ ln -s /usr/share/icons/breeze_cursors/cursors ~/.icons/default/cursors\n```\n\n"
    },
    {
      "title": "Cursor tremendo/oscilando ao mudar entre funções (por exemplo, ao passar o mouse sobre hiperlinks)",
      "level": 4,
      "content": "Tente instalar o driver de aceleração 2D apropriado para o seu sistema e gerenciador de janela.\n\n"
    },
    {
      "title": "Resolução de tela inutilizável definida",
      "level": 4,
      "content": "Suas configurações locais para o kscreen podem sobrescrever aquelas definidas no xorg.conf. Procure pelos arquivos de configuração do kscreen em ~/.local/share/kscreen/ e verifique se o modo está sendo definido para uma resolução que não é suportada pelo seu monitor.\n\n"
    },
    {
      "title": "Ícones borrados na área de notificação",
      "level": 4,
      "content": "Para adicionar ícones à área de notificação, os aplicativos geralmente fazem uso da biblioteca appindicator. Se os ícones estiverem desfocados, verifique qual versão do libappindicator você instalou. Se você só tem o libappindicator-gtk2 instalado, você pode instalar o libappindicator-gtk3 como uma tentativa de obter ícones claros.\n\n"
    },
    {
      "title": "Não é possível alterar a resolução da tela ao executar em uma máquina virtual",
      "level": 4,
      "content": "Ao executar o Plasma em uma máquina virtual VMware, VirtualBox ou QEMU, o kscreen pode não permitir alterar a resolução da tela do convidado para uma resolução superior a 800×600.\n\nA solução alternativa é definir a opção PreferredMode em xorg.conf.d(5). Como alternativa, tente usar um adaptador gráfico diferente na VM, por exemplo, VBoxSVGA em vez de VMSVGA para VirtualBox e Virtio em vez de QXL para QEMU. Veja KDE Bug 407058 para obter detalhes.\n\n"
    },
    {
      "title": "Nenhum som após a suspensão",
      "level": 4,
      "content": "Se não houver som após a suspensão e se o KMix não mostrar dispositivos de áudio que deveriam estar lá, reiniciar o plasmashell e pulseaudio pode ajudar:\n\n```\n$ killall plasmashell\n$ systemctl --user restart pulseaudio.service\n$ plasmashell\n```\n\nAlguns aplicativos também podem precisar ser reiniciados para que o som seja reproduzido novamente.\n\n"
    },
    {
      "title": "Arquivos MP3 não pode ser reproduzidos usando o backend GStreamer Phonon",
      "level": 4,
      "content": "Isso pode ser resolvido instalando o plugin libav do GStreamer (pacote gst-libav). Se você ainda encontrar problemas, tente alterar o backend do Phonon usado instalando outro, como phonon-qt4-vlcAUR ou phonon-qt5-vlc.\n\nEm seguida, certifique-se de que o backend é preferido através de Configurações do sistema > Multimídia > Áudio e vídeo > Infraestrutura.\n\n"
    },
    {
      "title": "Nenhuma opção de suspensão/hibernação",
      "level": 4,
      "content": "Se o seu sistema puder suspender ou hibernar usando systemd, mas não tiver essas opções mostradas no KDE, certifique-se de que powerdevil esteja instalado.\n\n"
    },
    {
      "title": "Limpar a configuração do Akonadi para corrigir o KMail",
      "level": 4,
      "content": "Consulte esse documento para detalhes.\n\nSe você quiser um backup, por favor copie o diretório de configuração em vez de excluí-lo.\n\n```\n$ cp -a ~/.local/share/akonadi ~/.local/share/akonadi-old\n$ cp -a ~/.config/akonadi ~/.config/akonadi-old\n```\n\n"
    },
    {
      "title": "Esvaziar a caixa de entrada IMAP no KMail",
      "level": 4,
      "content": "Para algumas contas IMAP, o KMail irá mostrar a caixa de entrada como um contentor de nível superior (por isso, não será possível ler mensagens lá) com todas as outras pastas desta conta no interior. [8]. Para resolver este problema, simplesmente desative as assinaturas do lado do servidor nas configurações da conta do KMail.\n\n"
    },
    {
      "title": "Erros de autorização par a conta EWS no KMail",
      "level": 4,
      "content": "Ao configurar a conta do EWS no KMail, você pode continuar recebendo erros sobre a autorização com falha, mesmo para credenciais válidas e totalmente funcionais. Isso provavelmente é causado por uma comunicação interrompida entre o KWallet e o KMail. Para solucionar o problema, defina uma senha pelo qdbus:\n\n```\n$ qdbus org.freedesktop.Akonadi.Resource.akonadi_ews_resource_0 /Settings org.kde.Akonadi.Ews.Wallet.setPassword \"XXX\"\n```\n\n"
    },
    {
      "title": "Congela ao usar montagem automática em um volume NFS",
      "level": 4,
      "content": "Usar Fstab#Automontagem com systemd em um volume NFS pode causar congelamentos, veja relatório de erro no upstream.\n\n"
    },
    {
      "title": "Registro log agressivo do QXcbConnection",
      "level": 3,
      "content": "Veja Qt#Disable/Change Qt journal logging behaviour.\n\n"
    },
    {
      "title": "Aplicativos KF5/Qt 5 não exibem ícones em i3/FVWM/awesome",
      "level": 3,
      "content": "Veja Qt#Configuration of Qt 5/6 applications under environments other than KDE Plasma.\n\n"
    },
    {
      "title": "Problemas com salvar credenciais e ocorrendo persistentemente diálogos do KWallet",
      "level": 3,
      "content": "Não é recomendado desativar o sistema de salvamento de senhas do KWallet nas configurações do usuário, pois é necessário para salvar credenciais criptografadas, como senhas WiFi para cada usuário. Diálogos do KWallet aparecendo de forma persistente podem ser a consequência de desativá-lo.\n\nCaso você ache irritantes os diálogos para desbloquear a carteira quando os aplicativos quiserem acessá-la, você pode deixar que os gerenciadores de exibição SDDM e LightDM desbloqueiem a carteira no início da sessão automaticamente, consulte KDE Wallet#Unlock KDE Wallet automatically on login. A primeira carteira precisa ser gerada pelo KWallet (e não gerada pelo usuário) para ser usada nas credenciais do programa do sistema.\n\nCaso você queira que as credenciais da carteira não sejam abertas na memória para cada aplicativo, você pode restringir os aplicativos de acessá-los com o kwalletmanager nas configurações do KWallet.\n\nSe você não se importa com a criptografia de credenciais, pode simplesmente deixar os formulários de senha em branco quando o KWallet solicitar a senha durante a criação de uma carteira. Nesse caso, os aplicativos podem acessar senhas sem ter que desbloquear a carteira primeiro.\n\n"
    },
    {
      "title": "Descoberta não mostra qualquer aplicativos",
      "level": 3,
      "content": "Isso pode ser resolvido instalando packagekit-qt5.\n\n"
    },
    {
      "title": "Alto uso de CPU de kscreenlocker_greet com drivers da NVIDIA",
      "level": 3,
      "content": "Como descrito no Bug 347772 do KDE, os drivers NVIDIA OpenGL e QML podem não funcionar bem junto com o Qt 5. Isso pode levar kscreenlocker_greet a um alto uso da CPU após desbloquear a sessão. Para contornar esse problema, defina a variável de ambiente QSG_RENDERER_LOOP como basic.\n\nEm seguida, mate as instâncias anteriores do greeter com killall kscreenlocker_greet.\n\n"
    },
    {
      "title": "OS error 22 ao executar Akonadi no ZFS",
      "level": 3,
      "content": "Se sua pasta pessoal está em um pool de ZFS, crie um arquivo ~/.config/akonadi/mysql-local.conf com o seguinte conteúdo:\n\n```\n[mysqld]\ninnodb_use_native_aio = 0\n```\n\nVeja MariaDB#OS error 22 when running on ZFS.\n\n"
    },
    {
      "title": "Alguns programas não conseguem rolar o texto quando suas janelas estão inativas",
      "level": 3,
      "content": "Isso é causado pela maneira problemática de o GTK 3 lidar com eventos de rolagem do mouse. Uma solução para isso é definir a variável de ambiente GDK_CORE_DEVICE_EVENTS=1. No entanto, essa solução também interrompe a rolagem suave do touchpad e a rolagem da tela sensível ao toque.\n\n"
    },
    {
      "title": "TeamViewer está lento",
      "level": 3,
      "content": "Ao usar o TeamViewer, ele pode se comportar lentamente se você usar animações uniformes (como minimizar janelas). Veja #Desabilitar composição como uma solução alternativa.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Site do KDE\n- Notícias do KDE\n- KDE Blogs\n- KDE Forums\n- KDE Wikis\n- Rastreador e relatador de erros do KDE\n- Blog do Martin Graesslin\n\n"
    }
  ]
}