{
  "title": "KDevelop (简体中文)",
  "url": "https://wiki.archlinux.org/title/KDevelop_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From KDevelop's website:\n\nKDevelop 5 has parser backends for C, C++, Objective-C, OpenCL and JavaScript/QML, with plugins supporting PHP, Python 3 and Ruby. Basic syntax highlighting and code folding are available for dozens of other source-code and markup formats, but without semantic analysis.\n\nKDevelop is part of the KDE project, and is based on KDE Frameworks and Qt. The C/C++ backend uses Clang, clang-tidy and heaptrack to provide accurate information even for very complex codebases.\"\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the kdevelop package or grab the kdevelop-gitAUR to get started.\n\n"
    },
    {
      "title": "Features",
      "level": 2,
      "content": "KDevelop uses an embedded text editor component through the KParts framework. The default editor is KDE Advanced Text Editor (Kate), which can optionally be replaced with a Qt Designer-based editor. This list focuses on the features of KDevelop itself.\n\n- Source code editor with syntax highlighting and automatic indentation (Kate).\n- C/C++ language is now supported with a Clang's backend (as of KDevelop-5.0)\n- Project management for different project types, such as Automake, CMake, qmake for Qt based projects and Ant for Java based projects.\n- Class browser.\n- GUI Designer\n- Front-end for the GNU Compiler Collection and GNU Debugger.\n- Wizards to generate and update class definitions and application framework.\n- Automatic code completion (C/C++).\n- Built-in Doxygen support.\n- Revision control (also known as SCM) support. Supported systems include CVS, Subversion, Perforce, ClearCase, Git, Mercurial, and Bazaar\n\nKDevelop 4 is a completely plugin-based architecture. When a developer makes a change, they only must compile the plugin.\n\nCode completion is available for C and C++. Symbols are kept in a Berkeley DB file for quick lookups without re-parsing. KDevelop also offers a developer framework which helps to write new parsers for other programming languages.\n\nAn integrated debugger allows graphically doing all debugging with breakpoints and backtraces. It even works with dynamically loaded plugins unlike command line GDB.\n\nQuick Open allows quick navigation between files.\n\n"
    },
    {
      "title": "Plugins",
      "level": 3,
      "content": "Currently, around 50 to 100 plugins exist for this IDE. Major ones include persistent project-wide code bookmarks, Code abbreviations which allow expanding text quickly, a Source formatter which reformats code to a style guide before saving, Regular expressions search, and project-wide search/replace which helps in refactoring code.\n\nInstall plugins to provide autocompletion and other language-specific features:\n\n- For PHP, install the kdevelop-php package\n- For Python, install the kdevelop-python package\n- For C++, install either gcc or clang package, although Options for other Compilers also exist.\n\n"
    },
    {
      "title": "Building additional plugins",
      "level": 2,
      "content": "The KDevelop Parser Generator (kdevelop-pg-qt package) is required to build additional plugins. Plugins will not compile if this package is not installed beforehand.\n\n"
    },
    {
      "title": "KDevCMakeManager",
      "level": 3,
      "content": "Make sure cmake is installed if you get this error: \"Could not load project management plugin KDevCMakeManager\".\n\n"
    },
    {
      "title": "Debugging with gdb",
      "level": 3,
      "content": "The debugging option to use gdb will not appear unless okteta is installed. Install okteta and restart KDevelop to enable gdb support.\n\n"
    }
  ]
}