{
  "title": "KeePass (Русский)",
  "url": "https://wiki.archlinux.org/title/KeePass_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "KeePass — это формат зашифрованной базы данных паролей. Он является альтернативой онлайн-менеджерам паролей и поддерживается на всех основных платформах.\n\nСуществует две версии формата: KeePass 1.x (Classic) и KeePass 2.x.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "В официальных репозиториях доступны три основные реализации KeePass:\n\n- KeePass — Кроссплатформенный менеджер паролей, который имеет поддержку автонабора и буфера обмена, если соответственно установлены xdotool и xsel. Он позволяет импортировать много форматов и имеет много плагинов.\n\n- KeePassXC — Форк KeePassX, который активно поддерживается и имеет дополнительные возможности, такие как интеграция с браузером, поддержка ssh агента, поддержка yubikey, генератор TOTP и KeeShare. Также предоставляет CLI.\n\n- GNOME Secrets — Современный менеджер паролей GNOME, построенный на базе KeePass.\n\nДругие менее известные альтернативы можно найти в AUR:\n\n- KeePassX — Начинался как Linux-порт KeePass. keepassx2AUR использует формат KeePass 2.x, но может импортировать базы данных 1.x. Она также позволяет импортировать базы данных PwManager и KWallet XML. Она не поддерживает плагины. [1] Активная разработка не ведется с 2016 года. [2]\n\n- keepassc — Менеджер паролей на основе curses, совместимый с KeePass v.1.x и KeePassX. Он использует xsel для работы с буфером обмена.\n\n- kpcli — Интерфейс командной строки для файлов базы данных KeePass *.kdb или *.kdbx.\n\n- keepmenu — Dmenu/Rofi фронтенд для файлов базы данных Keepass.\n\n- keeweb — Веб-приложение (online / Electron), совместимое с KeePass 2.x. KeeWeb - единственная версия с поддержкой синхронизации по умолчанию для основных облачных сервисов, Gdrive, Onedrive, Dropbox и т.д.\n\n"
    },
    {
      "title": "Интеграция",
      "level": 2,
      "content": "Для интеграции KeePass с другими программами существует множество плагинов и расширений. KeePassX и KeePassXC не имеют интерфейса плагинов, но KeePassXC имеет различные встроенные интеграции.\n\n"
    },
    {
      "title": "Установка плагинов в KeePass",
      "level": 3,
      "content": "KeePass по умолчанию установлен в /usr/share/keepass/. Скопируйте plugin.plgx в подкаталог plugins в каталоге установки KeePass, как показано ниже:\n\n```\n# mkdir /usr/share/keepass/plugins\n# cp plugin.plgx /usr/share/keepass/plugins\n```\n\n"
    },
    {
      "title": "keepassxc-browser для KeePassXC",
      "level": 4,
      "content": "keepassxc-browser - это браузерное расширение встроенной интеграции KeePassXC в браузер с использованием нативного обмена сообщениями и транспортного шифрования с помощью libsodium. Оно было разработано для замены KeePassHTTP, так как протокол KeePassHTTP имеет фундаментальные проблемы с безопасностью.\n\nРазработчики предоставляют расширение для браузера:\n\n- в Firefox Add-ons (для Firefox и Tor Browser);\n- и в chrome web store (для Chromium, Google Chrome, Vivaldi и Brave).\n\nИсходный код и объяснение принципов работы можно найти на GitHub, разработчики KeePassXC предоставляют руководство по настройке на своем сайте.\n\n"
    },
    {
      "title": "keepassxc-browser для KeePass",
      "level": 4,
      "content": "keepassxc-browser также может использоваться с KeePass через Keepass-natmsg Plugin из AUR (keepass-natmsgAUR) и рекомендуется как преемник KeePassHTTP.\n\n"
    },
    {
      "title": "KeePassRPC и Kee",
      "level": 4,
      "content": "Kee (GitHub repo) - это браузерное расширение для Firefox и Chromium, которое интегрирует KeePass через KeePassRPC, плагин KeePass от тех же разработчиков.\n\nПлагин KeePass доступен на GitHub или в AUR (keepass-plugin-rpcAUR).\n\nЭто браузерное расширение можно найти на GitHub, Firefox Add-ons и в chrome web store.\n\n"
    },
    {
      "title": "Через функцию автонабора",
      "level": 4,
      "content": "Альтернативой прямому каналу между браузером и KeePass(XC) является использование функции автонабора (Auto-Type). Существуют расширения для браузеров, которые поддерживают этот способ, помещая URL страницы в имя окна:\n\n- KeePass Helper или TitleURL для Firefox\n- URL в заголовке для Chromium.\n\n"
    },
    {
      "title": "Nextcloud",
      "level": 3,
      "content": "- Keeweb для Nextcloud (nextcloud-app-keewebAUR)\n\n"
    },
    {
      "title": "Yubikey",
      "level": 3,
      "content": "YubiKey может быть интегрирован с KeePass благодаря разработчикам плагинов KeePass. KeepassXC обеспечивает встроенную поддержку Yubikey Challenge-Response без плагинов.\n\n"
    },
    {
      "title": "Конфигурация с помощью KeePass",
      "level": 4,
      "content": "1. StaticPassword Настройте один из слотов Yubikey для хранения статического пароля. Вы можете сделать пароль длиной до 65 символов (64 символа с ведущим \"!\"). Этот пароль можно использовать в качестве основного пароля для базы данных KeePass.\n1. одноразовые пароли (OATH-HOTP) Скачайте плагин с сайта KeePass: https://keepass.info/plugins.html#otpkeyprov. Используйте yubikey-personalization-gui-gitAUR для настройки OATH-HOTP В расширенном режиме снимите галочку OATH Token Identifier В KeePass появится дополнительная опция в разделе Файл ключа / провайдер под названием Одноразовые пароли (OATH HOTP). Скопируйте секрет, длину ключа (6 или 8) и счетчик (в графическом интерфейсе персонализации Yubikey этот параметр называется Moving Factor Seed). Вам может понадобиться установить параметр Look-ahead count на что-то большее, чем 0; смотрите эту тему на форуме для получения дополнительной информации. Смотрите это видео для получения дополнительной помощи\n1. Challenge-Response (HMAC-SHA1) Получите плагин из AUR: keepass-plugin-keechallengeAUR В KeePass появится дополнительная опция в разделе Key file / provider под названием Yubikey challenge-response. Плагин предполагает, что используется слот 2.\n\n1. Скачайте плагин с сайта KeePass: https://keepass.info/plugins.html#otpkeyprov.\n1. Используйте yubikey-personalization-gui-gitAUR для настройки OATH-HOTP\n1. В расширенном режиме снимите галочку OATH Token Identifier\n1. В KeePass появится дополнительная опция в разделе Файл ключа / провайдер под названием Одноразовые пароли (OATH HOTP).\n1. Скопируйте секрет, длину ключа (6 или 8) и счетчик (в графическом интерфейсе персонализации Yubikey этот параметр называется Moving Factor Seed).\n1. Вам может понадобиться установить параметр Look-ahead count на что-то большее, чем 0; смотрите эту тему на форуме для получения дополнительной информации.\n1. Смотрите это видео для получения дополнительной помощи\n\n1. Получите плагин из AUR: keepass-plugin-keechallengeAUR\n1. В KeePass появится дополнительная опция в разделе Key file / provider под названием Yubikey challenge-response.\n1. Плагин предполагает, что используется слот 2.\n\n"
    },
    {
      "title": "Агент SSH",
      "level": 3,
      "content": "KeePassXC предлагает поддержку агента SSH, подобная функция также доступна для KeePass с помощью плагина KeeAgent.\n\nЭта функция позволяет хранить ключи SSH в базах данных KeePass, KeePassXC/KeeAgent действует как клиент OpenSSH и динамически добавляет и удаляет ключ в агенте.\n\nЭта функция в KeePassXC документирована в его FAQ.\n\n"
    },
    {
      "title": "Служба секретов",
      "level": 3,
      "content": "KeePassXC содержит интеграцию Freedesktop.org Secret Service. Когда эта функция включена, другие программы могут сохранять секреты внутри KeePassXC. Хотя это повышает общую безопасность, это может привести к нежелательному поведению после закрытия KeePassXC, так как программы, которые полагаются на свои секреты для работы, не могут их получить.\n\n"
    },
    {
      "title": "Отключите менеджер буфера обмена",
      "level": 3,
      "content": "Если вы являетесь заядлым пользователем менеджеров буфера обмена, вам может потребоваться отключить менеджер буфера обмена перед запуском Keepass, а затем снова запустить менеджер буфера обмена.\n\nВ реализации KeePassXC есть возможность автоматической очистки менеджера буфера обмена через некоторое время, достаточное для вставки скопированных элементов.\n\n"
    },
    {
      "title": "Проблемы масштабирования пользовательского интерфейса в KeePassXC 2.6",
      "level": 3,
      "content": "Если элементы пользовательского интерфейса масштабируются неправильно, см. HiDPI#Qt 5 и это сообщение об ошибке.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Список приложений/Безопасность#Менеджеры паролей\n\n"
    }
  ]
}