{
  "title": "Kernel Module Package Guidelines (Italiano)",
  "url": "https://wiki.archlinux.org/title/Kernel_Module_Package_Guidelines_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\n"
    },
    {
      "title": "Suddivisone dei pacchetti",
      "level": 2,
      "content": "I pacchetti che contengono i moduli del kernel dovrebbero essere trattati in modo particolare, per supportare quegli utenti che posseggono più di un kernel installato su un sistema.\n\nQuando si prepara un pacchetto contenente un modulo del kernel e altri file di supporto, è bene tenerli separati.\n\n"
    },
    {
      "title": "Linee di guida",
      "level": 3,
      "content": "Quando si prepara un pacchetto di questo tipo (prendendo come esempio driver NVIDIA) la convenzione è:\n\n- creare un pacchetto nvidia contenente solo i moduli compilati per il kernel vanilla;\n- creare un pacchetto nvidia-utils contenente i file di supporto;\n- assicurarsi che il pacchetto nvidia dipenda da nvidia-utils (a meno che ci sia una buona ragione per non farlo);\n- per gli altri kernel, come kernel26-mm, creare il pacchetto nvidia-mm contenente i moduli compilati per quel kernel;\n- assicurarsi che il pacchetto nvidia dipenda dall'attuale versione del kernel, ad esempio:\n\n```\ndepends=('kernel26>=2.6.24-2' 'kernel26<2.6.25-0' 'nvidia-utils')\n```\n\nNell'esempio è stato scritto 2.6.24-2, e non -1, perché c'è stato un importante cambiamento nella configurazione in un sottosistema del kernel che ha richiesto la ricompilazione di tutti i moduli. In casi come questo, bisogna sempre controllare le dipendenze, altrimenti alcune persone con versioni non aggiornate di kernel e di driver segnaleranno che quel modulo è difettoso.\n\n"
    },
    {
      "title": "Funzionamento",
      "level": 3,
      "content": "Mentre i moduli compilati per diverse versioni del kernel si trovano sempre in directory diverse e quindi possono tranquillamente coesistere, i file di supporto, di norma, si trovano sempre in uno stesso posto. Se un pacchetto contiene moduli e file di supporto, sarà impossibile installare un modulo per più di un kernel a causa degli stessi file di supporto presenti nei pacchetti, e questo provoca conflitti.\n\nLa separazione dei moduli e dei file di supporto permettono di installare i pacchetti per più versioni di kernel nello stesso sistema, condividendo gli stessi file di supporto che si trovano in una sola posizione.\n\n"
    },
    {
      "title": "Posizione dei file",
      "level": 2,
      "content": "Se un pacchetto include un modulo del kernel che è destinato a sostituire un modulo esistente con lo stesso nome, il modulo dovrebbe essere messo nella directory /lib/modules/2.6.xx-ARCH/updates. Quando verrà eseguito depmod, i moduli presenti in questa directory avranno la precedenza.\n\n"
    }
  ]
}