{
  "title": "Kernel (Bosanski)",
  "url": "https://wiki.archlinux.org/title/Kernel_(Bosanski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Kernel modules\n- Compile kernel module\n- Kernel Panics\n- sysctl\n\nPrema Wikipedia-i:\n\nArch Linux je baziran na Linux kernelu. Postoje razni alternativni Linux kerneli za Arch Linux pored zadnjeg stabilnog kernela. Ovaj članak opisuje opcije dostupne u repository-ima. Također, tu je i opis patcheva koji se mogu primijeniti na kernel. Članak se završava se pregledom kompilacije custom kernela sa linkovima za razne metode.\n\nKernel paketi se instaliraju na filesystem pod /boot/. Da se kernel može bootati, boot loader (Bosanski) mora biti ispravno konfigurisan.\n\n"
    },
    {
      "title": "Oficijalno podržani kerneli",
      "level": 2,
      "content": "- Stable — Vanilla Linux kernel i moduli sa nekoliko patcheva primjenjenih.\n\n- Hardened — Linux kernel sa fokusom na sigurnost sa setom patcheva da se mitigiraju kernel i userspace exploiti. Također, omogućava više upstream kernel hardening feature-a nego linux.\n\n- Longterm — Long-term support (LTS) (Podrška na dugo vrijeme) Linux kernel i moduli.\n\n- Zen Kernel — Rezultat kolaboracije kernel hakera da se pruži najbolji mogući Linux kernel za svakodnevnu upotrebu. Vidi više detalja na https://liquorix.net (koji ima kernel binary-e bazirane na Zen-u za Debianw).\n\n"
    },
    {
      "title": "Kompajliranje",
      "level": 2,
      "content": "Arch Linux pruža dvije metode kompajliranja kernela.\n\n"
    },
    {
      "title": "kernel.org kerneli",
      "level": 2,
      "content": "- Git — Linux kernel i moduli buildani koristeći source iz Git repository-a Linus Torvaldsa\n\n- Mainline — Kernel gdje su svi novi feature-i uvedeni, release-an svako 2-3 mjeseca.\n\n- Next — Bleeding edge kerneli sa feature-ima koji čekaju da se merge-aju u sljedeći mainline kernel.\n\n- Longterm 5.4 — Long-term support (LTS) Linux 5.4 kernel i moduli.\n\n- Longterm 5.10 — Long-term support (LTS) Linux 5.10 kernel i moduli.\n\n- Longterm 5.15 — Long-term support (LTS) Linux 5.15 kernel i moduli.\n\n"
    },
    {
      "title": "Patchevi i patchset-ovi",
      "level": 2,
      "content": "Postoji mnogo razloga za patchovanje kernela, glavni su performanse ili podrška za feature koji nisu u mainline. Drugi razlozi mogu biti čisto radi zabave i da se vidi kako se to radi i šta su prednosti toga.\n\nVažno je napomenuti da je najbolji način da se ubrza sistem jeste da se prvo kernel prilagodi sistemu, posebno arhitekturi i tipu procesora. Iz ovog razloga, korištenje pre-packaged verzija custom kernela sa generičkom arhitekturom nije preporučeno ili vrijedno toga. Drugi benefit jeste taj što se može smanjiti veličina kernela (ujedno i build time) isključivanjem podrške za stvari koje nemate ili ih ne koristite. Npr, možete početi sa stock kernel config-om kada je nova verzija release-ana i ukloniti podršku za stvari poput bluetooth, video4linux, 1000Mbit ethernet, itd; funkcionalnosti za koje znate da nisu potrebne za vašu mašinu. Iako ova stranica nije za customiziranje kernel configa, preporučena je kao prvi korak prije korištenja patchsetova kada su savladane osnove.\n\nConfig fajlovi za Arch Linux mogu biti korišteni kao početna tačka. Oni su Arch paket source fajlovima, npr. [1] linkovani iz linux. Config fajl vašeg trenutnog kernela može biti dostupan u file systemu na /proc/config.gz ako je CONFIG_IKCONFIG_PROC kernel opcija uključena.\n\nUkoliko niste prije patchovali ili customizirali kernel ranije, nije teško i postoje razni PKGBUILD-ovi na forumu za individualne patchsetova. Preporučeno je da se počne ispočetka sa malo istraživanja o prednostima svakog patchseta umjesto da se samo naslijepo odabere patchset. Na ovaj način, naučit ćete više o tome šta radite umjesto da samo odaberete kernel na startup-u i onda se pitate šta u stvari radi.\n\n"
    },
    {
      "title": "Major patchsetovi",
      "level": 3,
      "content": "- Linux-ck — Sadrži patchove od strane Con Kolivasa dezijnirane da se poboljšava responsiveness sa naglaskom na desktop, ali odgovarajući za bilo koji workload.\n\n- pf-kernel — Pruža razne super feature koji nisu merge-ani u mainline. Baziran nije na vec postojećem Linux forku niti patchset, iako neko neoficijalni portovi mogu biti korišteni ukoliko potrebni patchsetovi nisu release-ani oficijalno. Najistaknutiji patchovi iz linux-pf je UKSM.\n\n- Repository, linux-pfAUR od pf-kernel developer, post-factum\n\n- Realtime kernel — Održavano od male grupe core developera, koje vodi Ingo Molnar. Ovaj patch omogućava skoro svakom kernelu da bude preempted(naći odgovarajući prevod), sa izuzetkom malih regiona koda (\"raw_spinlock critical regions\"). Ovo je urađeno sa zamjenjivanjem većine kernel spinlocka sa mutex-ima koji podržavaju nasljeđivanje prioriteta, kao i prebacivanje svih interrupt-a i software interrupt-a u kernel thread.\n\n"
    },
    {
      "title": "Drugi patchsets",
      "level": 3,
      "content": "Neki od izlistanih paketa mogu biti dostupni kao binary paketi preko Neoficijalnih korisničkih repository-a.\n\n- Clear — Patchevi iz Intelovog Clear Linux projekta. Pruža optimizacije za performanse i sigurnost. WireGuard modul.\n\n- Libre — Linux kernel bez \"binary blobova\".\n\n- Liquorix — Kernel zamjena napravljena koristeći konfiguraciju ciljanu za Debian i Zen kernel source-ove. Dezijaniran za desktop, multimediju i gaming workloade, često je korišten kao Debian Linux zamjena za performanse. Danebtz, maintainer Liquorix patchseta je ujedno i developer za Zen patchset.\n\n- VFIO — Linux kernel i nekoliko patchec pisani od strane Alex Williamsona (acs override i i915) da se enable mogućnost za rad PCI Passthrough as KVM-om na nekim mašinama.\n\n- XanMod — Ciljano da se u potpunosti iskoristi prednost workstationa sa viskom performansama, gaming desktopima, media centrima i drugima je napravljena da pruži više čvrsto, responsive i smooth desktop iskustvo. Ovaj kernel koristi scheduler, BFQ I/O scheduler, UKSM realtime memory data deduplication, YeAH TCP kontrola zagušenja, x86_64 podršku za napredni set instrukcija i druge defaultne promjene.\n\n"
    },
    {
      "title": "Vidi i",
      "level": 2,
      "content": "- O'Reilly - Linux Kernel in a Nutshell (besplatna ebook)\n- Koji stabilni kernel bih trebao koristiti? od Greg Kroah-Hartman\n\n"
    }
  ]
}