{
  "title": "Kernel parameters (Русский)",
  "url": "https://wiki.archlinux.org/title/Kernel_parameters_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Существует три способа передачи параметров ядру и контроля над ним:\n\n1. При сборке ядра — через файл config. Полная информация Ядро#Компиляция.\n1. При запуске ядра — используя параметры командной строки (обычно через загрузчик).\n1. На этапе выполнения — через файлы в /proc/sys/ (смотрите sysctl) и /sys/).\n\nНастраиваемые в этих способах параметры различаются по доступности, имени и методу, в котором они указаны. Эта страница объясняет только второй метод (параметры командной строки ядра) и показывает список наиболее часто используемых параметров ядра в Arch Linux.\n\nБольшинство параметров связаны с подсистемами и работают, только если ядро собрано с этими подсистемами. Они также зависят от наличия оборудования, с которым они связаны.\n\nПараметры, задаваемые в командной строке, имеют формат параметр или параметр=значение.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "- Посмотреть параметры, с которыми сейчас загружена система, и проверить, применились ли ваши изменения, можно с помощью команды cat /proc/cmdline.\n- Установочный носитель Arch Linux использует Syslinux на BIOS-системах и GRUB на UEFI.\n\nПараметры ядра можно установить либо временно, отредактировав загрузочную запись в меню загрузчика, либо навсегда, изменив файл конфигурации загрузчика.\n\nПримеры ниже демонстрируют, как добавить параметры quiet и splash в Syslinux, systemd-boot, GRUB, GRUB Legacy, LILO и rEFInd.\n\n"
    },
    {
      "title": "Syslinux",
      "level": 3,
      "content": "- После появления меню нажмите Tab и добавьте их в конце строки:\n\n```\nlinux /boot/vmlinuz-linux root=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 rw initrd=/boot/initramfs-linux.img quiet splash\n```\n\n- Для сохранения изменений между перезагрузками измените файл /boot/syslinux/syslinux.cfg и добавьте их в строку APPEND:\n\n```\nAPPEND root=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 rw quiet splash\n```\n\nПолную информацию по настройке можно прочитать в статье Syslinux.\n\n"
    },
    {
      "title": "systemd-boot",
      "level": 3,
      "content": "- После появления меню нажмите e и добавьте параметры в конце строки:\n\n```\ninitrd=\\initramfs-linux.img root=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 rw quiet splash\n```\n\n- Если значение таймаута меню не установлено, во время загрузки зажмите пробел, чтобы меню systemd-boot появилось.\n- Если вы не можете изменить параметры из меню загрузки, может понадобиться изменить файл /boot/loader/loader.conf и добавить editor 1 чтобы разрешить редактирование.\n\n- Для сохранения изменений между перезагрузками измените файл /boot/loader/entries/arch.conf (предполагается, что у вас настроен системный раздел EFI) и добавьте их в строку options:\n\n```\noptions root=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 rw quiet splash\n```\n\nПолную информацию по настройке можно прочитать в статье systemd-boot.\n\n"
    },
    {
      "title": "GRUB",
      "level": 3,
      "content": "- Нажмите e в момент показа загрузочного меню и добавьте в строку, содержащую linux:\n\n```\nlinux /boot/vmlinuz-linux root=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 rw quiet splash\n```\n\n- Для сохранения изменений между перезагрузками, если вы не используете grub-mkconfig, можно изменить эту же строку напрямую в файле /boot/grub/grub.cfg, а для grub-mkconfig измените файл /etc/default/grub и добавьте параметры внутри кавычек в строке GRUB_CMDLINE_LINUX_DEFAULT:\n\n```\nGRUB_CMDLINE_LINUX_DEFAULT=\"quiet splash\"\n```\n\n```\n# grub-mkconfig -o /boot/grub/grub.cfg\n```\n\nПолную информацию по настройке можно прочитать в статье GRUB (Русский).\n\n"
    },
    {
      "title": "GRUB Legacy",
      "level": 3,
      "content": "- Нажмите e в момент показа загрузочного меню и добавьте в строку, содержащую kernel:\n\n```\nkernel /boot/vmlinuz-linux root=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 rw quiet splash\n```\n\n- Для сохранения изменений между перезагрузками измените файл /boot/grub/menu.lst и добавьте их в строку kernel аналогично примеру выше.\n\nПолную информацию по настройке можно прочитать в статье GRUB Legacy (Русский).\n\n"
    },
    {
      "title": "LILO",
      "level": 3,
      "content": "- Добавьте в /etc/lilo.conf:\n\n```\nimage=/boot/vmlinuz-linux\n        ...\n        quiet splash\n```\n\nПолную информацию по настройке можно прочитать в статье LILO.\n\n"
    },
    {
      "title": "rEFInd",
      "level": 3,
      "content": "- На нужном пукте меню нажмите +, F2 или Insert и нажмите ещё раз в нужном подменю. Добавьте параметры ядра в конце строки:\n\n```\nroot=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 rw initrd=\\boot\\initramfs-linux.img quiet splash\n```\n\n- Для сохранения изменений между перезагрузками измените файл /boot/refind_linux.conf и добавьте их внутри кавычек во всех нужных строках, например\n\n```\n\"Boot using default options\"   \"root=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 rw quiet splash\"\n```\n\n- Если вы отключили автоматическое определение ОС в rEFInd и вместо этого определяете разделы ОС в esp/EFI/refind/refind.conf для загрузки своих ОС, вы можете отредактировать его следующим образом:\n\n```\nmenuentry \"Arch Linux\" {\n\t...\n\toptions  \"root=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 rw quiet splash\"\n\t...\n}\n```\n\nПолную информацию по настройке можно прочитать в статье rEFInd (Русский)\n\n"
    },
    {
      "title": "EFISTUB",
      "level": 3,
      "content": "Смотрите EFISTUB#Using UEFI directly.\n\n"
    },
    {
      "title": "dracut",
      "level": 3,
      "content": "dracut может встраивать параметры ядра в initramfs, что позволяет исключить их из конфигурации загрузчика. Смотрите dracut#Kernel command line options.\n\n"
    },
    {
      "title": "Взлом cmdline",
      "level": 3,
      "content": "Даже без доступа к загрузчику можно изменить параметры ядра, чтобы включить отладку (если у вас есть root-доступ). Это можно сделать, перезаписав /proc/cmdline, в котором хранятся параметры ядра. Однако /proc/cmdline недоступен для записи даже для root, но это можно обойти с помощью bind mount.\n\nСначала создайте файл, содержащий желаемые параметры ядра\n\n```\n/root/cmdline\n```\n\n```\nroot=UUID=0a3407de-014b-458b-b5c1-848e92a327a3 ro console=tty1 logo.nologo debug\n```\n\nЗатем сделайте bind mount, перекрыв старый файл с параметрами новым:\n\n```\n# mount -n --bind -o ro /root/cmdline /proc/cmdline\n```\n\nПараметр -n пропускает добавление записи в /etc/mtab, поэтому он будет работать, даже если корневая ФС примонтирована только для чтения. Вы можете выполнить cat /proc/cmdline, чтобы убедиться в успешности изменений.\n\n"
    },
    {
      "title": "Список параметров",
      "level": 2,
      "content": "Список не исчерпывающий. Полный список можно посмотреть в документации к ядру.\n\nTable content:\nПараметр | Описание\ninit | Запустить указанный исполняемый файл вместо /sbin/init в качестве процесса init. Пакет systemd-sysvcompat создаёт символическую ссылку /sbin/init, указывающую на /usr/lib/systemd/systemd, для использования systemd. Укажите /bin/sh для загрузки в командную оболочку.\ninitrd | Путь к образу начальной файловой системы (initramfs). Для загрузчиков UEFI и EFISTUB необходимо использовать обратный слэш (\\) в качестве разделителей в пути.\ncryptdevice | Расположение раздела, зашифрованного с dm-crypt, плюс имя device mapper.\ndebug | Включить отладку ядра (уровень журнала событий).\nlsm | Установить порядок инициализации модулей безопасности Linux, используется для включения AppArmor, SELinux или TOMOYO.\nmaxcpus | Максимальное количество процессоров, которые ядро SMP будет задействовать во время загрузки.\nmem | Принудительное использование определённого количества используемой памяти.\nnetdev | Параметры сетевых устройств.\nnomodeset | Отключить Kernel mode setting.\npanic | Время до автоматической перезагрузки при панике ядра.\nresume | Указать устройство подкачки, которое будет использоваться при выходе из гибернации.\nro | При загрузке монтировать корневую ФС только в режиме чтения (используется по умолчанию1).\nroot | Корневая файловая система. Смотрите список поддерживаемых форматов имён устройств в файле init/do_mounts.c. Имейте в виду, что initramfs с udev поддерживает больше форматов имён.\nrootflags | Параметры монтирования корневой ФС. Полезно для настройки параметров, которые нельзя применить при перемонтировании (например, с помощью systemd-remount-fs.service(8)). Например, опция discard для XFS.\nrw | При загрузке монтировать корневую ФС в режиме чтения/записи.\nsystemd.unit | Загрузка в указанную цель.\nvideo | Переопределить стандартные настройки фреймбуффера.\n\n1 mkinitcpio использует ro по умолчанию, если загрузчик не устанавливает ни rw, ни ro. Загрузчики могут устанавливать используемое значение, например, GRUB по умолчанию использует rw (смотрите FS#36275).\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Документация ядра: \"The kernel’s command-line parameters\"\n- Power saving#Kernel parameters\n- List of kernel parameters with further explanation and grouped by similar options\n\n"
    }
  ]
}