{
  "title": "Kernel module (Bosanski)",
  "url": "https://wiki.archlinux.org/title/Kernel_module_(Bosanski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Boot debugging\n- Kernel\n- Kernel parameters\n- Compile kernel module (Bosanski)\n\nKernel moduli su dio koda koji može se loadati i unloadati iz kernela na zahtjev. Oni produžuju funkcionalnost kernela bez rebootanja sistema.\n\nDa kreirate kernel module, možete pročitati The Linux Kernel Module Programming Guide. Module može biti konfigurisan kao built-in ili loadable. Da dinamično učitate ili uklonite modul, mora biti konfigurisan kao loadable modul u kernel konfiguraciji (linija povezana sa modulom će pokazati slovo M).\n\n"
    },
    {
      "title": "Dohvaćanja informacija",
      "level": 2,
      "content": "Moduli su smješteni u /usr/lib/modules/kernel_release. Možete koristiti uname -r da vidite svoju trenutnu kernel verziju.\n\nDa vidite trenutno loadane module u kernel:\n\n```\n$ lsmod\n```\n\nDa vidite informacije u modulu:\n\n```\n$ modinfo module_name\n```\n\nDa vidite listu opcija za modul:\n\n```\n$ systool -v -m module_name\n```\n\nDa izlistate veliku konfiguraciju svih modula:\n\n```\n$ modprobe -c | less\n```\n\nDa prikažete konfiguraciju određenog modula::\n\n```\n$ modprobe -c | grep module_name\n```\n\nIzlistajte dependency-e modula (ili aliasa), uključujući i sami modul:\n\n```\n$ modprobe --show-depends module_name\n```\n\n"
    },
    {
      "title": "Automatsko loadanje module sa systemd",
      "level": 2,
      "content": "Danas, svo potrebno loadanje module automatski radi udev, tako da ukoliko ne koristite out-of-tree kernel modul, nema potrebe da stavljate module koji će se bootati u bootu u konfiguracijski fajl. Ipak, postoje slučajevu gdje možda želite loadati dodatni modul tokom boot procesa ili blacklistati drugi za ispravno funkcionisanje računara.\n\nKernel moduli se mogu eksplicitino izlistati u fajlovima pod /etc/modules-load.d/ za systemd da ih loada tokom boot-a. Svaki konfiguracijski fajl ja imenovan kao /etc/modules-load.d/<program>.conf. Konfiguracijski fajlovi jednostavno sadrže listu kernel modula koji će se loadati, odvojeni novom linijom. Prazne linije i linije čiji prvo non-whitespace karakter je # ili ; su ignorisane.\n\n```\n/etc/modules-load.d/virtio-net.conf\n```\n\n```\n# Load virtio_net.ko tokom boota\nvirtio_net\n```\n\nVidi modules-load.d(5) za više detalja.\n\n"
    },
    {
      "title": "Manuelno održavanje modula",
      "level": 2,
      "content": "Upravljanje kernel modulima vrši se sa alatima iz kmod paketa. Možete manuelno koristiti ove alate.\n\nDa loadate module:\n\n```\n# modprobe ime_modula\n```\n\nDa loadate modul na osnovu imena (oni koji nisu instalirani u /usr/lib/modules/$(uname -r)/):\n\n```\n# insmod naziv_fajla [argumenti]\n```\n\nDa unloadate modul:\n\n```\n# modprobe -r module_name\n```\n\nIli:\n\n```\n# rmmod module_name\n```\n\n"
    },
    {
      "title": "Podešavanje opcija modula",
      "level": 2,
      "content": "Da proslijedite parametar kernel modulu, možete ih proslijediti manuelno sa modprobe ili osigurati da određeni parametri su uvijek primijenjeni korištenjem modprobe konfiguracijskog fajla ili koristeći kernel command line.\n\n"
    },
    {
      "title": "Manauelno prilikom loadanja sa modprobe",
      "level": 3,
      "content": "Osnovni način prosljeđivanja parametara modulu je korištenjem modprobe komadne. Parametri su navedeni na command line koristeći jednostavne ključ=vrijednost dodjele:\n\n```\n# modprobe ime_module ime_parametra=vrijednost_parametra\n```\n\n"
    },
    {
      "title": "Koristeći fajlove u /etc/modprobe.d/",
      "level": 3,
      "content": "Fajlovi u /etc/modprobe.d/ folderu mogu biti korišteni da se postave podešavanja za modul za udev, koji će koristiti modprobe da upravlja loadanjem module tokom bootanja. Konfiguracijski fajlovi u ovom folderu mogu imati bilo kakvo ime, ali moraju završavati sa .conf ekstenzijom. Sintaksa je:\n\n```\n/etc/modprobe.d/myfilename.conf\n```\n\n```\noptions module_name parameter_name=parameter_value\n```\n\nNpr:\n\n```\n/etc/modprobe.d/thinkfan.conf\n```\n\n```\n# Na ThinkPadima, ovo omogućava 'thinkfan' daemon da kontroliše brzinu ventilatora\noptions thinkpad_acpi fan_control=1\n```\n\n"
    },
    {
      "title": "Koristeći kernel command line",
      "level": 3,
      "content": "Ukoliko je modul buildan u kernel, možete proslijediti opcije modulu koristeći kernel comamnd line. Za sve česte bootloadere, sljedeća sintaksa je tačna:\n\n```\nime_modula.ime_parametra=vrijednost_parametra\n```\n\nNpr:\n\n```\nthinkpad_acpi.fan_control=1\n```\n\nJednostavno dodate ovo u bootloader kernel liniju, ako što je opisano u Kernel parametrima.\n\n"
    },
    {
      "title": "Podešavanja aliasa",
      "level": 2,
      "content": "Aliasi su alternativna imena za module. Npr: alias my-mod dugi_naziv_modula znači da možete koristiti modprobe my-mod umjesto modprobe dugi_naziv_modula. Možete također koristiti shell-like wildcarde, tako da alias my-mod* dugi_naziv_modula znači da modprobe my-mod-something ima isti efekat. Kreiranje aliasa:\n\n```\n/etc/modprobe.d/mojalias.conf\n```\n\n```\nalias mymod dugi_naziv_modula\n```\n\nNeki moduli imaju aliase koji su korišteni automatski da se loadaju kada ih aplikacija treba. Isključivanje ovih aliasa može spriječiti automatsko loadanje, ali će i dalje dozvoljati manuelno loadanje modula.\n\n```\n/etc/modprobe.d/modprobe.conf\n```\n\n```\n# Spriječi Bluetooth autoload\nalias net-pf-31 off\n```\n\n"
    },
    {
      "title": "Blacklistanje",
      "level": 2,
      "content": "Blacklistanje, u kontekstu kernel modula, je mehanizam spriječavanja kernel modula da se automatski loadaju. Ovo može biti korisno ako npr. asocirani hardware nije potreban ili ako loadanje tog modula izaziva probleme: npr mogu biti dva kernel modula koja pokušavaju da kontrolišu isti dio hardware-a i loadanje oba može prouzrokovati konflikt.\n\nNeki module su loadani kao dio initramfs-a. mkinitcpio -M će ispisati sve automatski detektovane module: da spriječite initramfs da ne loada automatski neke od tih, blacklistajte ih u .conf fajlu unutar /etc/modprobe.d i bit će dodano tokom modconf hookanja tokom generisanja image-a. Pokretanjem mkinitcpio -v će izlistati sve pullane module za različitim hookovima (npr. filesystems hook, block hook itd.). Zapamtite da dodate .conf fajl u FILES niz u /etc/mkinitcpio.conf ako nemate modconf hook u vašem HOOKS nizu (npr. odudarate od defaultne konfiguracije), i nakon što ste blacklistali module, regenerišite initramfs i rebootajte iza toga.\n\n"
    },
    {
      "title": "Korištenje fajlova u /etc/modprobe.d/",
      "level": 3,
      "content": "Kreirajte .conf fajl unutar /etc/modprobe.d/ i dodajte liniju za svaki modul koji želite blacklistati koristeći blacklist ključnu riječ. Ako npr. želite spriječiti pcspkr module da se loada:\n\n```\n/etc/modprobe.d/nobeep.conf\n```\n\n```\n# Ne loadaj 'pcspkr' modul tokom boota.\nblacklist pcspkr\n```\n\nNote: Ipak, postoji workaround za ovo ponašanja; install komanda govori modprobe da pokrene custom komandu umjesto loadanja modula u kernel uobičajeno, tako da možete forsirati da modul uvijek faila sa:\n\nIpak, postoji workaround za ovo ponašanja; install komanda govori modprobe da pokrene custom komandu umjesto loadanja modula u kernel uobičajeno, tako da možete forsirati da modul uvijek faila sa:\n\n```\n/etc/modprobe.d/blacklist.conf\n```\n\n```\n...\ninstall ime_modula /bin/true\n...\n```\n\n"
    },
    {
      "title": "Korištenje kernel command line",
      "level": 3,
      "content": "Mozete također blacklistati module iz bootloadera.\n\nJednostavno dodajte module_blacklist=modname1,modname2,modname3 u kernel line bootloadera, kao što je opisano u Kernel parametrima.\n\n"
    },
    {
      "title": "Moduli se ne loadaju",
      "level": 3,
      "content": "U slučaju kada se određeni moduli ne loada i boot log (dostupan sa journalctl -b) kaže da je modul blacklista, ali ne postoji entry unutar /etc/modprobe.d, provjerite drugi modprobe source folder na /usr/lib/modprobe.d za blacklistane module.\n\nModul se neće loadati ukoliko \"vermagic\" string unutar kernel modula se ne poklapa sa vrijednošću trenutnog kernela na vašem sistemu. Ukoliko je poznato da je modul kompatibilan sa trenutnim kernel, \"vermagic\" provjera se može ignorisati sa modprobe --force-vermagic.\n\n"
    },
    {
      "title": "Vidi i",
      "level": 2,
      "content": "- Disable PC speaker beep\n- Pisanje WMI drivera\n\n"
    }
  ]
}