{
  "title": "Kernel live patching (Português)",
  "url": "https://wiki.archlinux.org/title/Kernel_live_patching_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Módulos de kernel\n- Kernel/Compilação\n- Kexec\n\nO Kernel Live Patching ou KLP (\"Aplicação de patches durante o uso do kernel\" em uma tradução livre) permite correções rápidas no espaço de kernel sem reiniciar o sistema inteiro. Desde a versão 4.0, os patches (modificações) relacionados foram aceitos[1][2][3], de forma que é possível configurar seu kernel para ativar esse recurso. Geralmente, o KLP é alcançado por meio das seguintes etapas:\n\n1. Obter a árvore de fontes do kernel que está sendo usado\n1. Preparar o patch no kernel\n1. Aplicar algumas ferramentas (veja a seguir) para ajudar a transformar e carregar o patch\n\nAlguns projetos forneciam os utilitários de aplicação de patches durante o uso antes do suporte oficial do KLP, como o ksplice da Oracle, o #kGraft da SuSE e o #kpatch da Red Hat. Eles implementaram a funcionalidade KLP de diferentes maneiras. O conjunto funcional minimalista de patches inseridas no kernel mainstream foi derivado do kpatch e do kGraft.\n\n"
    },
    {
      "title": "Instalação",
      "level": 3,
      "content": "Instale kpatchAUR para um kernel apropriado e kpatch-gitAUR para ferramentas de userspace.\n\nVocê também pode compilar manualmente um kernel que possui suporte ao uso kpatch, habilitando CONFIG_LIVEPATCH, CONFIG_DEBUG_INFO e CONFIG_KALLSYMS.\n\n"
    },
    {
      "title": "Uso",
      "level": 3,
      "content": "Depois que os dois pacotes forem criados com sucesso e após a reinicialização, você pode\n\n```\n$ export ROOTDIR=some/dir/aur/linux-kpatch/src/linux-x-y\n$ cd $ROOTDIR\n```\n\nSuponha que você tenha feito algumas modificações e tenha um patch algum.patch (contra a árvore de fontes após um makepkg -o, não o kernel padrão da versão x.y) em o diretório de trabalho. Inicie o utilitário kpatch,\n\n```\n$ kpatch-build -s $(pwd) -v $(pwd)/vmlinux algum.patch\n```\n\nEste comando envolve duas compilações do kernel, a original e a corrigida, portanto, pode levar um tempo para ser concluído. Após o término da compilação, deve haver um módulo kpatch-algum.ko no mesmo diretório. E depois,\n\n```\n# insmod kpatch-algum.ko\n```\n\ndeve resolver a questão.\n\nPara mais informações, consulte as páginas man ou o repositório no GitHub.\n\n"
    },
    {
      "title": "kGraft",
      "level": 2,
      "content": "KGraft não foi testado no ambiente do Arch.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- O documento do kernel sobre livepatch\n- wikipedia:Kpatch\n- wikipedia:KGraft\n- wikipedia:Ksplice\n\n"
    }
  ]
}