{
  "title": "Kernel parameters (Español)",
  "url": "https://wiki.archlinux.org/title/Kernel_parameters_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nHay tres formas de pasar opciones al núcleo (también conocido por su nombre en inglés, kernel) y de ese modo controlar su comportamiento:\n\n1. Durante la compilación del núcleo.\n1. Al arrancar el núcleo (por lo general, cuando se invoca desde un gestor de arranque).\n1. En tiempo de ejecución (a través de los archivos en /proc y /sys).\n\nEsta página explica con más detalle el segundo método y muestra una lista de los parámetros del núcleo más utilizados en Arch Linux.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Los parámetros del núcleo se pueden configurar de forma temporal mediante la edición del menú de arranque cuando se muestra, o, de forma permanente, modificando el archivo de configuración del gestor de arranque.\n\nAquí vamos a añadir los parámetros quiet y splash en Syslinux, GRUB, GRUB Legacy y LILO.\n\n"
    },
    {
      "title": "Syslinux",
      "level": 3,
      "content": "- Pulse Tab cuando el menú se visualice y agregue los parámetros al final de la cadena:\n\n```\n> .linux ../vmlinuz-linux root=/dev/sda3 ro initrd=../initramfs-linux.img quiet splash\n```\n\n- Para hacer permanente la modificación al reiniciar el sistema, edite /boot/syslinux/syslinux.cfg y añada los parámetros a la línea APPEND:\n\n```\nAPPEND root=/dev/sda3 ro quiet splash\n```\n\nPara obtener más información sobre la configuración de Syslinux, consulte el artículo Syslinux.\n\n"
    },
    {
      "title": "GRUB",
      "level": 3,
      "content": "- Pulse e cuando el menú se visualice+ y agregue los parámetros al final de la línea linux:\n\n```\nlinux   /boot/vmlinuz-linux root=UUID=978e3e81-8048-4ae1-8a06-aa727458e8ff ro  quiet splash\n```\n\n- Para hacer el cambio permanente después de reiniciar el sistema, se podría modificar manualmente /boot/grub/grub.cfg con la línea exacta vista arriba, para los principiantes se recomienda:\n\n```\nGRUB_CMDLINE_LINUX_DEFAULT=\"quiet splash\"\n```\n\n```\n# grub-mkconfig -o /boot/grub/grub.cfg\n```\n\nPara obtener más información sobre la configuración de GRUB, consulte el artículo GRUB.\n\n"
    },
    {
      "title": "GRUB Legacy",
      "level": 3,
      "content": "- Pulse e cuando el menú aparece y agregue los parámetros al final de la línea kernel:\n\n```\nkernel /boot/vmlinuz-linux root=/dev/sda3 ro quiet splash\n```\n\n- Para hacer el cambio permanentes después de reiniciar el sistema, edite /boot/grub/menu.lst y añada a la línea del kernel los parámetros , exactamente igual que antes.\n\nPara obtener más información sobre la configuración de GRUB Legacy, consulte el artículo GRUB Legacy.\n\n"
    },
    {
      "title": "LILO",
      "level": 3,
      "content": "- Añada a /etc/lilo.conf:\n\n```\nimage=/boot/vmlinuz-linux\n        ...\n        quiet splash\n```\n\nPara obtener más información sobre la configuración de LILO, consulte el artículo LILO.\n\n"
    },
    {
      "title": "systemd-boot",
      "level": 3,
      "content": "- Pulse e cuando aparezca el menú y agregue los parámetros al final de la cadena:\n\n```\ninitrd=\\initramfs-linux.img root=/dev/sda2 rw quiet splash\n```\n\n- Para hacer que los cambios permanezcan tras el reinicio, edite /boot/loader/entries/arch.conf (suponiendo que haya establecido la EFI system partition y configurado lo archivos de acuerdo a las instrucciones de la systemd-boot) y añada lo siguiente a la línea options:\n\n```\noptions root=/dev/sda2 rw quiet splash\n```\n\nPara obtener más información sobre la configuración de systemd-boot, consulte el artículo systemd-boot.\n\n"
    },
    {
      "title": "rEFInd",
      "level": 3,
      "content": "- Para hacer que el cambio permanezca al reiniciar el sistema, edite /boot/EFI/arch/refind_linux.conf y añada a todas las líneas o a las que lo necesiten, por ejemplo:\n\n```\n\"Boot to X\"   \"root=PARTUUID=978e3e81-8048-4ae1-8a06-aa727458e8ff ro rootfstype=ext4 quiet splash\n```\n\n- Si ha desactivado la detección automática de los sistemas operativos en rEFInd y se han definido, en su lugar, dichos sistemas operativos por párrafos en el archivo /boot/EFI/refind/refind.conf, entonces, para cargar su sistema operativo, puede editar el archivo como sigue:\n\n```\nmenuentry \"Arch\" {\n\tloader /EFI/arch/vmlinuz-arch.efi\n\toptions \"quiet splash ro root=PARTUUID=978e3e81-8048-4ae1-8a06-aa727458e8ff\"\n```\n\nPara obtener más información sobre la configuración de los parámetros del núcleo en rEFInd, véase\n\n1. Configuring the rEFInd Bootmanager\n1. Methods of Booting Linux\n\n"
    },
    {
      "title": "Lista de parámetros",
      "level": 2,
      "content": "Los parámetros siempre vienen como parameter o parameter=value. Todos estos parámetros distinguen entre mayúsculas y minúsculas.\n\nTable content:\nparámetro | Descripción\nroot= | Sistema de archivos root.\nro | Monta el dispositivo root como solo lectura en el arranque.\nrw | Monta el dispositivo root como lectura-escritura en el arranque (por defecto).\ninitrd= | Especifica la ubicación del disco RAM inicial.\ninit= | Ejecuta el binario especificado en lugar de /sbin/init (enlace simbólico a systemd en Arch) como proceso init.\ninit=/bin/sh | Arranca en modo shell.\nsystemd.unit= | \nsystemd.unit=multi-user | Arranca en el runlevel especificado.\nsystemd.unit=rescue | Arranca en modo usuario único (root).\nnomodeset | Desactiva Kernel mode setting.\n\nPara obtener una lista completa de todas las opciones, consulte la documentación del núcleo Linux.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- sysctl\n- Power saving#Kernel parameters\n- Lista de parámetros del núcleo Linux con más explicaciones y agrupados por opciones similares\n\n"
    }
  ]
}