{
  "title": "Keyboard shortcuts (Русский)",
  "url": "https://wiki.archlinux.org/title/Keyboard_shortcuts_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "В этой статье приведен список (не общеизвестных) стандартных сочетаний клавиш и предоставляется информация о пользовательской настройке.\n\n"
    },
    {
      "title": "Ядро (SysRq)",
      "level": 3,
      "content": "Имеется несколько низкоуровненных сочетаний клавиш, реализованных в ядре и которые могут быть использованы для отладки и восстановления зависнувшей системы. Всякий раз, когда это возможно, рекомендуется использовать эти сочетания клавиш вместо аппаратного выключения (удержание кнопки включения компьютера до полного отключения системы).\n\nПодробнее: Wikipedia:Magic SysRq key\n\n"
    },
    {
      "title": "Включение",
      "level": 4,
      "content": "В systemd битовая маска разрешений sysrq по умолчанию установлена на 0x10, что не позволяет, в частности, отправлять процессам сигналы или перезагружаться. Чтобы разрешить полное использование sysrq в вашей системе, добавьте kernel.sysrq = 1 в конфигурацию sysctl. Значения больше 1 могут использоваться для выборочного включения функций sysrq; подробности описаны в документации ядра. Если хотите убедиться, что они будут включены даже до монтирования разделов и перед initrd, добавьте sysrq_always_enabled=1 в параметры ядра.\n\nОбратите внимание, что изменение этих настроек является постоянным. Если вы хотите изменить параметры sysrq только для текущего сеанса, можно использовать sysctl kernel.sysrq=1 или echo \"1\" > /proc/sys/kernel/sysrq.\n\nПолное включение sysrq связано с некоторыми очевидными рисками безопасности. Помимо принудительных перезагрузок и тому подобного, sysrq может использоваться для дампа содержимого регистров процессора, что теоретически может раскрыть конфиденциальную информацию. Поскольку для его использования требуется физический доступ к системе (если только вы не вынесете управление sysrq за её пределы), большинство пользователей настольных компьютеров, вероятно, сочтут уровень риска приемлемым. Тем не менее, прежде чем включить sysrq, убедитесь, что вы полностью понимаете последствия его использования и динамику контекста, в котором работает ваша система.\n\n"
    },
    {
      "title": "Перезагрузка",
      "level": 4,
      "content": "Общая идиома для запоминания этих сочетаний клавиш - \"Reboot Even If System Utterly Broken\" (сокращенно \"REISUB\"). Кроме того, подумайте об этом наоборот \"BUSIER\".\n\nTable content:\nСочетание клавиш | Описание | Код для включения | Другие включаемые функции\nAlt+SysRq+r Unraw | Забирает клавиатуру от X для управления. | 4 | Alt+SysRq+k SAK\nAlt+SysRq+e Terminate | Отправляет SIGTERM всем процессам. Этот сигнал запрашивает завершение процесса, но он может быть проигнорирован. | 64 | Alt+SysRq+f OOM kill Alt+SysRq+j Thaw\nAlt+SysRq+i Kill | Отправляет SIGKILL всем процессам. Этот сигнал вызывает немедленное завершение процесса.\nAlt+SysRq+s Sync | Сбрасывает данные на диск. | 16 | -\nAlt+SysRq+u Unmount | Монтирует все файловые системы только для чтения. | 32 | -\nAlt+SysRq+b Reboot | Перезагружает | 128 | -\n\nНапример, чтобы выборочно включить только функцию перезагрузки, установите kernel.sysrq в 128. Весь набор функций REISUB можно включить, установив значение 244, хотя это также включает дополнительные функции, перечисленные в последнем столбце таблицы. Дополнительную документацию смотрите в документации ядра и в исходном файле ядра /drivers/tty/sysrq.c.\n\n"
    },
    {
      "title": "Завершение процесса, занимающего много памяти",
      "level": 4,
      "content": "Можно использовать Alt+SysRq+f для вызова OOM (out-of-memory) killer, не вызывая паники ядра, если ничего не может быть убито. OOM killer использует набор эвристик, чтобы выбрать не очень важный процесс, использующий больше всего памяти, и убить его. Это очень полезно для завершения процесса, который заблокировал вашу систему, например, запущенный скрипт браузера, и во многих случаях может избавить от необходимости перезагрузки. Обратите внимание, что OOM killer может быть нацелен на широкий спектр процессов, несмотря на его благонамеренную эвристику, и может быть несколько непредсказуемым, поэтому будьте осторожны с его вызовом.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 4,
      "content": "- Если вы используете экранный менеджер и после Alt+SysRq+e появляется экран входа в систему (или рабочий стол, если включен автовход), скорее всего это вызвано директивой Restart=always в соответствующем файле службы. Если нужно отредактируйте юнит, однако это не должно препятствовать работе последовательности \"REISUB\".\n- Если все вышеперечисленные комбинации работают, кроме Alt+SysRq+b, попробуйте использовать контралатеральную клавишу Alt.\n- На ноутбуках, использующих клавишу Fn для переключения SysRq/PrtScrn, на самом деле не обязательно использовать Fn (например, Alt+PrtSc+буква должно работать).\n- На ноутбуках Lenovo клавиша SysRq часто настроена как Fn+S. Чтобы использовать ее нажмите и держите Alt, затем нажмите Fn+s, отпустите Fn и s все еще удерживайте Alt, а затем нажмите необходимую клавишу-букву.\n- Вам может потребоваться нажать Ctrl вместе с Alt. Так например, полное сочетание клавиш будет таким: Ctrl+Alt+SysRq+b.\n\n"
    },
    {
      "title": "Консоль Linux",
      "level": 3,
      "content": "Смотрите Консоль Linux#Горячие клавиши.\n\n"
    },
    {
      "title": "Xorg и Wayland",
      "level": 3,
      "content": "Table content:\nСочетание клавиш | Описание | Примечание\nCtrl+Alt+F1, F2, F3, ... | Переключиться на n-ную виртуальную консоль | Если это не работает, попробуйте Ctrl+Fn+Alt+F….\nShift+Insert Mouse Button 2 | Вставить текст из буфера PRIMARY | По умолчанию Shift+Insert Qt соответствует CLIPBOARD вместо буфера PRIMARY (посмотрите, например, [1]) и Ctrl+Shift+Insert - буферу PRIMARY.\n\n"
    },
    {
      "title": "Readline",
      "level": 3,
      "content": "Readline — это широко используемая библиотека для редактирования строк; она используется, например, в Bash, FTP и многих других программах (больше примеров можно посмотреть в разделе \"Required By\" в описании пакета readline). Она имеет Emacs-подобные и vi-подобные режимы редактирования, которые можно настроить с помощью управляющих последовательностей. Стандартные сочетания клавиш описаны в readline(3) и документации Info.\n\n"
    },
    {
      "title": "Zsh",
      "level": 3,
      "content": "Zsh использует ZLE для виджетов, скриптов и команд.\n\n"
    },
    {
      "title": "Xorg",
      "level": 3,
      "content": "Чтобы узнать некоторые общие сочетания клавиш, которые по умолчанию отключены, смотрите Конфигурация клавиатуры в Xorg#Часто используемые опции XKB.\n\nКогда мы находимся в графическом окружение, мы можем захотеть выполнить команду при нажатии определенной комбинации клавиш (то есть привязать команду к keysym). Существует несколько способов сделать это:\n\n- Самый портативный способ. Использование инструментов низкого уровня, таких как acpid. Не все клавиши поддерживаются, но конфигурация в унифицированном виде возможна для клавиш клавиатуры, подключения адаптера питания и даже для подключения/отключения наушников. Также трудно запускать программы внутри X сеанса правильно.\n- Универсальный способ. Использование утилит Xorg (например, xbindkeys) и, в конечном итоге, инструментов вашего окружения рабочего стола или оконного менеджера.\n- Более быстрый способ. Использование сторонних программ, где все можно сделать в GUI, таких как Gnome Control Center.\n\n"
    },
    {
      "title": "sxhkd",
      "level": 4,
      "content": "Простой демон X hotkey с мощным и компактным синтаксисом конфигурации. Для получения дополнительной информации смотрите sxhkd.\n\n"
    },
    {
      "title": "actkbd",
      "level": 4,
      "content": "С домашней страницы actkbd:\n\nОбразец конфигурации и руководство по настройке можно найти здесь.\n\n"
    },
    {
      "title": "xbindkeys",
      "level": 4,
      "content": "xbindkeys позволяет расширенное сопоставление клавиш с действиями независимо от окружения рабочего стола.\n\n"
    },
    {
      "title": "Среды рабочего стола",
      "level": 3,
      "content": "- LXDE (Русский)#Горячие клавиши\n- Xfce (Русский)#Сочетания клавиш\n\n"
    },
    {
      "title": "Оконные менеджеры",
      "level": 3,
      "content": "- Fluxbox#Keyboard shortcuts\n- Openbox (Русский)#Сочетания клавиш\n- i3 (Русский)#Назначение клавиш\n\n"
    },
    {
      "title": "Сочетание клавиш для X-selection-paste",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nПользователи, которые предпочитают работать скорее с клавиатурой, чем с мышью, могут извлечь выгоду из сочетаний клавиш к операции вставки средней кнопки мыши. Это особенно полезно в среде, которая управляется клавиатурой. Пример работы:\n\n1. В Firefox выберите строку, которую вы хотите использовать для Google (с помощью мыши).\n1. Нажмите Ctrl+k , чтобы ввести поле \"поисковая система\".\n1. Нажмите F9, чтобы вставить буфер, вместо того, чтобы перемещать указатель мыши в поле и щелкать по колесику для вставки.\n\nВ предлагаемом здесь способе используются следующие три пакета:\n\n- xsel для предоставления доступа к содержимому буфера the x-selection-buffer.\n- Xbindkeys для связывания клавиши к действию.\n- xvkbdAUR для передачи буферной строки в приложение путем эмуляции ввода клавиатуры.\n\nВ этом примере операция x-selection-paste связывается с клавишей F9:\n\n```\n.xbindkeysrc\n```\n\n```\n\"xvkbd -no-jump-pointer -xsendevent -text \"\\D1`xsel`\" 2>/dev/null\"\n    F9\n```\n\nПрефикс кода \"\\D1\" устанавливает задержку 100 мс для вставки буфера (для получения дополнительной информации смотрите домашнюю страницу xvkbd).\n\nКоды клавиш отличных от F9 можно определить с помощью xbindkeys -k.\n\nСвязанные с этим ссылки:\n\n- Вставка содержимого X (не буфера обмена) клавиатурой\n- домашняя страница xvkbd\n\n"
    },
    {
      "title": "Оконный менеджер XMonad",
      "level": 4,
      "content": "В оконном менеджере xmonad есть встроенная функция для вставки содержимого x-selection-buffer. Чтобы связать эту функцию с клавишей (здесь с Insert) , можно использовать следующие настройки:\n\n```\nxmonad.hs\n```\n\n```\nimport XMonad.Util.Paste\n...\n  -- X-selection-paste buffer\n  , ((0,                     xK_Insert), pasteSelection) ]\n```\n\n"
    },
    {
      "title": "Советы и рекомендации",
      "level": 2,
      "content": "- Если вам нравится работать с клавиатурой, вы также можете оценить фреймовые оконные менеджеры.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Руководство администратора для новичков Linux - сочетания клавиш и команды (англ)\n- Клавиатура и консоль Linux HOWTO (англ)\n\n"
    }
  ]
}