{
  "title": "Keyboard shortcuts (Português)",
  "url": "https://wiki.archlinux.org/title/Keyboard_shortcuts_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Este artigo visa fornecer uma lista (não tão popular) dos atalhos de teclado padrão e também fornece informações sobre sua personalização.\n\n"
    },
    {
      "title": "Kernel (SysRq)",
      "level": 3,
      "content": "Existem certos atalhos de baixo nível implementados no kernel por meio da tecla sysrq que podem ser usados para depuração e recuperação de um sistema instável ou travado. Sempre que possível, recomenda-se que estes atalhos sejam utilizados ao invés de fazer um desligamento forçado via hardware (segurando o botão de energia até desligar completamente o sistema).\n\n"
    },
    {
      "title": "Ativação",
      "level": 4,
      "content": "systemd possui a máscara de bits de permissões sysrq definida como 0x10 por padrão, que não permite reinicialização ou sinalização de processo, entre outras coisas. Para permitir o uso completo da tecla sysrq no seu sistema, adicione kernel.sysrq=1 à sua configuração de sysctl. Valores maiores que 1 podem ser usados para ativar seletivamente funções sysrq; veja a documentação do Linux Kernel para detalhes. Se desejar tê-la ativada já durante o inicialização, adicione a configuração apropriada para a configuração do sysctl. Se quiser ter certeza de que elas serão ativadas mesmo antes das partições serem montadas e no initrd, então adicione sysrq_always_enabled=1 nos parâmetros do kernel.\n\nObserve que alterar a configuração por esses métodos fará com que as alterações persistam durante as reinicializações. Se você quiser tentar alterar as configurações do sysrq apenas para sua sessão atual, pode executar sysctl kernel.sysrq=1 ou echo \"1\" > /proc/sys/kernel/sysrq\n\nExistem alguns riscos óbvios de segurança envolvidos na ativação completa da tecla sysrq. Além de forçar reinicializações e similares, ela pode ser usada para despejar o conteúdo dos registros da CPU, o que teoricamente poderia revelar informações confidenciais. Como usá-la requer acesso físico ao sistema (a menos que você saia do seu caminho), a maioria dos usuários de desktop provavelmente considerará o nível de risco aceitável. Dito isso, certifique-se de entender completamente as implicações da ativação e a dinâmica do contexto maior em que seu sistema está operando antes de ativar o sysrq completamente.\n\n"
    },
    {
      "title": "Reinicialização",
      "level": 4,
      "content": "Uma linguagem comum para decorá-las é, do inglês, \"Reboot Even If System Utterly Broken\" (ou simplesmente \"REISUB\"), que quer dizer, a grosso modo, \"reinicie mesmo se o sistema estiver completamente quebrado\". Outra maneira de se lembrar da sequência de teclas é pensar na palavra, \"BUSIER\" lida de trás para frente (também do inglês, que quer dizer algo como ocupado demais).\n\nTable content:\nAtalho | Descrição\nAlt+SysRq+r Unraw | Toma o controle do teclado do servidor X, e assume.\nAlt+SysRq+e Terminate | Envia o sinal SIGTERM a todos os processos, permitindo encerrá-los de maneira não arbitrária ou forçada.\nAlt+SysRq+i Kill | Envia o sinal SIGKILL para todos os processos, forçando-os a se encerrarem imediatamente.\nAlt+SysRq+s Sync | Grava os dados na unidade de disco rígido.\nAlt+SysRq+u Unmount | Desmonta e remonta todos os sistemas de arquivos em modo somente leitura.\nAlt+SysRq+b Reboot | Reinicia o sistema.\n\n"
    },
    {
      "title": "Matando um processo que esteja consumindo memória excessivamente",
      "level": 4,
      "content": "Alt+SysRq+f pode ser usado para chamar o matador OOM (out-of-memory) sem causar kernel panic se nada puder ser eliminado. O matador OOM usa um conjunto de heurísticas para escolher o processo relativamente não vital que está usando mais memória e matá-lo. Isso é muito útil para interromper um processo que bloqueia seu sistema, causando surtos excessivos, como um script de navegador descontrolado, e pode aliviar a necessidade de uma reinicialização em muitos casos. Observe que o matador OOM pode ter como alvo uma ampla variedade de processos, apesar de suas heurísticas bem-intencionadas e pode ser um pouco imprevisível, portanto, tenha cuidado ao chamá-lo casualmente.\n\n"
    },
    {
      "title": "Solução de problemas",
      "level": 4,
      "content": "- Se estiver usando um gerenciador de exibição e após Alt+SysRq+e você for levado à tela de login (ou à sua área de trabalho caso o login automático estiver ativado), então provavelmente a diretiva Restart=always no arquivo service é a responsável. Se necessário, edite a unit, embora isto não deve evitar que a sequência \"REISUB\" funcione.\n- Caso todas as combinações acima funcionem, exceto Alt+SysRq+b, tente usar a tecla Alt do lado oposto do teclado.\n- Em laptops que usam a tecla Fn para diferenciar a função SysRq de PrtScrn, pode não ser necessário usar a tecla Fn (isto é, simplesmente pressionar Alt+PrtSc+letra pode ser o suficiente).\n- Em laptops Lenovo, SysRq é frequentemente configurada como Fn+S. Para usá-la, pressione e segure Alt, então pressione Fn+s, solte Fn e s e, ainda segurando Alt use a combinação de teclas acima.\n- Pode ser necessário pressionar Ctrl junto de Alt. Então, por exemplo, o atalho completo pode ser Ctrl+Alt+SysRq+b.\n\nVeja Wikipedia:Magic SysRq key para mais detalhes.\n\n"
    },
    {
      "title": "Console virtual",
      "level": 3,
      "content": "Veja Console do Linux#Atalhos de teclado.\n\n"
    },
    {
      "title": "Xorg e Wayland",
      "level": 3,
      "content": "Table content:\nTeclas de atalho | Descrição | Notas\nCtrl+Alt+F1, F2, F3, ... | Alterna para o n-ésimo console virtual | Se não funcionar, tente Ctrl+Fn+Alt+F… com as demais teclas de função.\nShift+Insert Mouse Button 2 | Cola texto do PRIMARY buffer | Por padrão, o Qt mapeia Shift+Insert para a área de transferência ao invés do buffer PRIMARY (veja exemplo [1]) enquanto Ctrl+Shift+Insert é mapeado para o buffer PRIMARY.\n\n"
    },
    {
      "title": "Readline",
      "level": 3,
      "content": "Readline é uma biblioteca comumente usada para edição de linha; e é usada, por exemplo pelo Bash, FTP, e muitos outros (veja detalhes do pacote readline, na coluna \"Required By\" da tabela, para mais exemplos). É semelhante ao estilo de edição do Emacs e do vi, que podem ser personalizados com sequências de escape. Combinações padrão de teclas estão listadas em sua documentação.\n\n"
    },
    {
      "title": "Zsh",
      "level": 3,
      "content": "Zsh utiliza ZLE para ligar atalhos a widgets, scripts e comandos.\n\n"
    },
    {
      "title": "Xorg",
      "level": 3,
      "content": "Veja Xorg/Keyboard configuration#Frequently used XKB options alguns atalhos comuns, que são desativados por padrão.\n\nEm um ambiente gráfico, podemos querer executar um comando quando certa combinação de teclas é pressionada (isto é, um comando ligado a uma keysym). Existem várias maneiras de se fazer isso:\n\n- A maneira mais prática é usando ferramentas de baixo nível , como uma daemon acpid. Nem todas as teclas são suportadas, mas uma configuração de maneira bastante uniforme é possível para teclas, conexão com fontes de energia e até mesmo ao plugar/desplugar um conector de fone de ouvido. Também é difícil executar programas dentro de uma sessão do X corretamente.\n- A maneira universal é usando utilitários do Xorg (por exemplo, xbindkeys) e eventualmente as ferramentas de seu gerenciador de janelas ou ambiente de desktop.\n- A maneira mais rápida é através de programas de terceiros que façam tudo via interface gráfica, tais como a Central de Controle do GNOME.\n\n"
    },
    {
      "title": "sxhkd",
      "level": 4,
      "content": "Uma simplória daemon hotkey para o X com uma poderosa e compacta sintaxe de configuração. Veja sxhkd para detalhes.\n\n"
    },
    {
      "title": "actkbd",
      "level": 4,
      "content": "Da site do actkbd:\n\nUm modelo de configuração, bem como guia, estão disponíveis aqui.\n\n"
    },
    {
      "title": "xbindkeys",
      "level": 4,
      "content": "xbindkeys permite mapeamento avançado de teclas para ações independentemente do ambiente de desktop (Desktop Environment).\n\n"
    },
    {
      "title": "Ambientes de desktop",
      "level": 3,
      "content": "- LXDE#Keyboard shortcuts\n- Xfce#Keyboard shortcuts\n\n"
    },
    {
      "title": "Gerenciadores de janela",
      "level": 3,
      "content": "- Fluxbox#Keyboard shortcuts\n- Openbox#Keyboard shortcuts\n- i3#Keyboard shortcuts\n\n"
    },
    {
      "title": "Associação de teclas para X-selection-paste",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nUsuários que preferem usar mais o teclado ao invés do mouse podem se beneficiar de um atalho de teclado para operação de colagem que até então é feita através do botão intermediário do mouse. Isto é especialmente útil em um ambiente baseado em utilização do teclado. Um exemplo de como seria este fluxo de trabalho vem a seguir:\n\n1. No Firefox, selecione (com o mouse) um texto que deseja pesquisar no google.\n1. Pressione Ctrl+k para abrir o campo de busca.\n1. Pressione F9 para colar o texto, ao invés de ter que mover o ponteiro do mouse para dentro do campo de busca e usar o botão intermediário do mouse para colá-lo.\n\nO método sugerido aqui usa três pacotes::\n\n- xsel para dar acesso ao conteúdo do x-selection-buffer.\n- Xbindkeys para vincular pressionamento de teclas a uma ação.\n- xvkbdAUR para passar a string do buffer para a aplicação ao emular uma entrada de teclado.\n\nEste exemplo vincula uma operação do x-selection-paste à tecla F9:\n\n```\n.xbindkeysrc\n```\n\n```\n\"xvkbd -no-jump-pointer -xsendevent -text \"\\D1`xsel`\" 2>/dev/null\"\n    F9\n```\n\nO código \"\\D1\" estabelece uma pause de 100 ms para inserir a seleção do buffer (veja a site do xvkbd).\n\nOs códigos para outras teclas diferentes de F9 podem ser determinados usando xbindkeys -k.\n\nReferências (em inglês):\n\n- Pasting X selection (not clipboard) contents with keyboard\n- site do xvkbd\n\n"
    },
    {
      "title": "XMonad Window Manager",
      "level": 4,
      "content": "No gerenciador de janela xmonad existe uma função embutida para colar o conteúdo do x-selection-buffer. De modo a vincular esta função a um pressionamento de teclas, (aqui, a tecla Insert), a seguinte configuração pode ser usada:\n\n```\nxmonad.hs\n```\n\n```\nimport XMonad.Util.Paste\n...\n  -- X-selection-paste buffer\n  , ((0,                     xK_Insert), pasteSelection) ]\n```\n\n"
    },
    {
      "title": "Dicas e truques",
      "level": 2,
      "content": "- Se você é adepto ao uso do computador primordialmente com teclado, você pode gostar de um Gerenciadores de janela#Gerenciadores de janela de tiling.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- The Linux Magic System Request Key - Kernel documentation\n- Linux Newbie Administrator Guide - Shortcuts and Commands\n- The Linux keyboard and console HOWTO\n\n"
    }
  ]
}