{
  "title": "Keybase (Español)",
  "url": "https://wiki.archlinux.org/title/Keybase_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-13** \n\nArtículos relacionados\n\n- GnuPG\n\nDe Wikipedia:\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Keybase se distribuye mediante el paquete keybaseAUR. El sistema de archivos KBFS y la interfaz gráfica de Keybase pueden instalarse con los paquetes kbfsAUR y keybase-guiAUR. De manera alternativa, keybase-binAUR está disponible en el AUR el cual incluye todo en un solo paquete. Véase también las instrucciones de instalación en keybase.io.\n\n"
    },
    {
      "title": "Registro / Inicio de sesión",
      "level": 2,
      "content": "Si instala la interfaz gráfica a través de keybase-binAUR, este le guiará en el proceso de registro. Las siguientes instrucciones se refieren al paquete keybaseAUR que sólo utiliza la línea de comandos.\n\nKeybase requiere que su servicio se ejecute para poder interactuar con él. Primero inicie el servicio keybase iniciando el servicio de systemd incluido como vuestro usuario (active este servicio para que se ejecute en el arranque):\n\n```\n$ systemctl start --user keybase\n```\n\nO bien, ejecute el servicio keybase manualmente:\n\n```\n$ keybase service\n```\n\nPara registrar una cuenta en Keybase, utilice y siga las indicaciones que se muestran en pantalla:\n\n```\n$ keybase signup\n```\n\nSi ya tiene una cuenta en Keybase, puede acceder con:\n\n```\n$ keybase login <nombre_de_usuario>\n```\n\n"
    },
    {
      "title": "Claves GnuPG",
      "level": 2,
      "content": "Durante el registro interactivo, si ya tiene algún par de claves GnuPG en su keyring, Keybase le preguntará si desea utilizar una de ellas. Si no tiene, puede generar una con:\n\n```\n$ keybase pgp gen\n```\n\nEsto generará interactivamente un par de claves y las cargará de forma segura.\n\n"
    },
    {
      "title": "Sistema de archivos Keybase (KBFS)",
      "level": 2,
      "content": "KBFS utiliza FUSE para montar el sistema de archivos criptográfico remoto. Se distribuye con el paquete keybase-binAUR, aunque también es posible instalarlo por separado con kbfsAUR.\n\nKeybase permite a los usuarios almacenar hasta 250 GB de archivos en un almacenamiento en la nube, denominado sistema de archivos Keybase. El sistema de archivos se divide en tres partes: archivos públicos, archivos privados y archivos de equipo. El sistema de archivos se monta por defecto en /keybase si se instala a través de keybase-binAUR.\n\nPara configurar kbfs si se instala a través del paquete kbfsAUR, primero asegúrese de que el servicio keybase se está ejecutando (véase las instrucciones anteriores). A continuación, configure el punto de montaje deseado para el KBFS:\n\n```\n$ keybase config set mountdir /ruta/a/kbfs\n```\n\nAhora puede iniciar el servicio kbfs:\n\n```\n$ systemctl start --user kbfs\n```\n\nActive este servicio para que el kbfs se monte en el arranque.\n\nTodos los archivos bajo /ruta/a/kbfs/public son firmados automáticamente por el cliente. Todos los archivos bajo /ruta/a/kbfs/private son encriptados y firmados antes de cargarse, resultando encriptados de extremo a extremo. Véase documetos KBFS en keybase.io para obtener más información e instrucciones de uso.\n\n"
    },
    {
      "title": "La interfaz gráfica de Keybase se inicia automáticamente",
      "level": 3,
      "content": "Por defecto, keybase-gui añade una entrada al escritorio en su inicio automático. Para desactivarlo ejecute:\n\n```\nkeybase ctl autostart --disable\n```\n\n"
    },
    {
      "title": "Icono de bandeja al usar la extensión AppIndicator GNOME Shell",
      "level": 3,
      "content": "Es posible que no le aparezca ningún icono cuando se inicie Keybase, si está utilizando la extensión gnome-shell-extension-appindicator. Parece ser que Electron necesita que se instale libappindicator-gtk3 para poder crear y gestionar esos iconos.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página web de Keybase\n- Wikipedia:Keybase\n- Conceptos básicos de Keybase\n\n"
    }
  ]
}