{
  "title": "Keyboard configuration in console (Русский)",
  "url": "https://wiki.archlinux.org/title/Keyboard_configuration_in_console_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Конфигурация клавиатуры в Xorg\n- Дополнительные клавиши\n- Консоль Linux#Шрифты\n\nСопоставление клавиш (раскладки) для виртуальной консоли, консольных шрифтов и консольных карт предоставляется пакетом kbd (зависимость для systemd), который также предоставляет множество инструментов низкого уровня для управления виртуальной консолью. Кроме того, systemd также предоставляет инструмент localectl, который может контролировать как локали системы, так и настройки раскладки клавиатуры как для виртуальной консоли, так и для Xorg.\n\n"
    },
    {
      "title": "Просмотр настроек клавиатуры",
      "level": 2,
      "content": "Используйте localectl status для просмотра текущих конфигураций клавиатуры.\n\n"
    },
    {
      "title": "Раскладки клавиатуры",
      "level": 2,
      "content": "Файлы раскладок хранятся в дереве каталогов /usr/share/kbd/keymaps/. Обычно один файл keymap соответствует одной раскладке клавиатуры (оператор include может использоваться для совместного использования общих частей, а файл keymap может содержать несколько схем с некоторой комбинацией клавиш, используемой для переключения). Для получения дополнительной информации смотрите keymaps(5).\n\n"
    },
    {
      "title": "Список раскладок",
      "level": 3,
      "content": "Соглашения об именах консольных раскладок несколько условны, но обычно они основаны на:\n\n- Коды языков: где код языка совпадает с кодом страны (например, ru для русского языка или fr для французского языка).\n- Коды стран: где варианты одного и того же языка используются в разных странах (например, uk для английского языка в Великобритании или us для Соединенных Штатов Америки); список кодов стран также можно найти в w:ru:ISO 3166-1#Список кодов по ISO 3166.\n- Раскладка клавиатуры: где раскладка не связана с конкретной страной или языком (например, dvorak для раскладки клавиатуры Dvorak).\n\nДля получения списка всех доступных раскладок используйте команду:\n\n```\n$ localectl list-keymaps\n```\n\nЧтобы найти раскладку клавиатуры, используйте следующую команду, заменив search_term кодом для вашего языка, страны или раскладки:\n\n```\n$ localectl list-keymaps | grep -i search_term\n```\n\nАльтернативно, используя find:\n\n```\n$ find /usr/share/kbd/keymaps/ -type f\n```\n\nКакие установлены русские раскладки для UTF-8:\n\n```\n$ localectl list-keymaps | grep ru | grep UTF-8\nruwin_alt-UTF-8  \nruwin_alt_sh-UTF-8  \nruwin_cplk-UTF-8  \nruwin_ct_sh-UTF-8  \nruwin_ctrl-UTF-8\n```\n\nГде ruwin_cplk-UTF-8 - переключение раскладки клавишей CAPS LOCK, ruwin_alt_sh-UTF-8 - переключение по ALT+SHIFT, и т.п.\n\n"
    },
    {
      "title": "Временная конфигурация (Loadkeys)",
      "level": 3,
      "content": "Можно установить раскладку только для текущего сеанса. Это полезно при проверке различных раскладок, решение проблем и т.д.\n\nДля этого используют инструмент loadkeys. Он используется внутри systemd при загрузке раскладки клавиатуры, настроенной в /etc/vconsole.conf. Пользоваться им легко:\n\n```\n# loadkeys раскладка_клавиатуры\n```\n\nДля получения дополнительной информации смотрите loadkeys(1).\n\n"
    },
    {
      "title": "Постоянная конфигурация",
      "level": 3,
      "content": "Постоянную комбинацию клавиш можно установить в /etc/vconsole.conf, которая считывается systemd при запуске. Для указания раскладки используется переменная KEYMAP. Если переменная пуста или не установлена, в качестве значения по умолчанию используется раскладка us. Смотрите vconsole.conf(5) для получения информации обо всех параметрах. Например:\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=ru\n...\n```\n\nДля удобства, localectl можно использовать для настройки раскладки клавиатуры. Он изменит переменную KEYMAP в /etc/vconsole.conf, а также установит раскладку для текущего сеанса:\n\n```\n$ localectl set-keymap --no-convert раскладка_клавиатуры\n```\n\nОпцию --no-convert можно использовать для предотвращения localectl автоматического изменения раскладки клавиатуры в Xorg до ближайшего совпадения. Для получения дополнительной информации смотрите localectl(1).\n\n"
    },
    {
      "title": "Создание своей раскладки",
      "level": 3,
      "content": "Вы используете горячие клавиши для вывода особенных символов, пользуясь консолью. Кроме того, мы можем также напечатать последовательность символов и некоторые escape-последовательности. Таким образом, если мы печатаем последовательность символов, составляющих команду, а затем escape-символ для новой строки, эта команда будет выполнена.\n\nОдин из способов сделать это - отредактировать файл раскладки. Однако, поскольку он будет перезаписан в любое время, когда пакет, к которому он принадлежит, обновляется, редактирование этого файла не рекомендуется. Лучше объединить существующую раскладку со своей. Утилита loadkeys может сделать это.\n\nСначала, создайте файл раскладки. Этот файл раскладки может быть где угодно, но этот способ подражает иерархии каталогов в /usr/local:\n\n```\n# mkdir -p /usr/local/share/kbd/keymaps\n# vim /usr/local/share/kbd/keymaps/personal.map\n```\n\nВ качестве примечания следует отметить, что личная раскладка также полезна для переопределения поведения клавиш, уже обработанных стандартной раскладкой: при загрузке с помощью loadkeys директивы в стандартной раскладке будут заменены при конфликте с новыми директивами и сохраняются в противном случае. Таким образом, только изменения в раскладке должны быть указаны в личной раскладке.\n\n"
    },
    {
      "title": "Добавление директив",
      "level": 4,
      "content": "- Keycode - это номер генерируемый вашей клавиатурой при нажатии на определенную клавишу. Например, кнопка пробела сгенерирует Keycode=128.\n- Keysym - это просто слово используемое для обозначения типа клавиши. Эта концепция очень важна, потому как позволяет программам не оперировать с кодами напрямую, а работать с клавиатурой по названиям клавишь.\n\nВ этой личной раскладке требуются два типа директив. Прежде всего директивы keycode, которые соответствуют формату, указанному в стандартных раскладках по умолчанию. Эти директивы сопоставляют keycode с keysym. Keysyms представляют действия клавиатуры. Доступные действия включают вывод кодов символов или последовательностей символов, переключение консолей или раскладок клавиатуры, загрузку машины и многие другие действия. Полную активную текущую раскладку можно получить с помощью\n\n```\n# dumpkeys -l\n```\n\nБольшинство keysyms интуитивно понятны. Например, чтобы настроить клавишу 112 для вывода символа 'e', директива примет следующий вид:\n\n```\nkeycode 112  = e\n```\n\nЧтобы настроить клавишу 112 для вывода символа евро, директива будет следующего вида:\n\n```\nkeycode 112 = euro\n```\n\nНекоторые keysym не сразу связаны с действиями клавиатуры. В частности, keysyms с префиксом заглавной буквы F и от одной до трех цифр (F1-F246), составляющие число больше 30, всегда свободны. Это полезно для указания горячей клавиши для вывода последовательности символов и других действий:\n\n```\nkeycode 112 = F70\n```\n\nЗатем F70 может быть связан для вывода определенной строки:\n\n```\nstring F70 = \"Hello\"\n```\n\nКогда клавиша 112 нажата, она выведет содержимое F70. Чтобы выполнить команду в терминале, символ окончания новой строки должен быть добавлен в конец строки с командой. Например, чтобы ввести систему в спящий режим, добавляется следующая строка в раскладку:\n\n```\nstring F70 = \"sudo /usr/sbin/hibernate\\n\"\n```\n\n"
    },
    {
      "title": "Другие примеры",
      "level": 4,
      "content": "- Чтобы сделать клавишу Правый Alt такой же как клавиша Левый Alt (для Emacs), используй следующую строку в своей раскладке. Это включит файл /usr/share/kbd/keymaps/i386/include/linux-with-two-alt-keys.inc, посмотри его для получения дополнительной информации.\n\ninclude \"linux-with-two-alt-keys\"\n\n- Чтобы поменять местами CapsLock и Escape (для Vim), выполните переназначение соответствующих кодов клавиш:\n\n```\nkeycode 1 = Caps_Lock\nkeycode 58 = Escape\n```\n\n- Чтобы сделать CapsLock еще одним Control, выполните переназначение соответствующих кодов клавиш:\n\n```\nkeycode 58 = Control\n```\n\n- Чтобы поменять местами CapsLock и Левый Control, выполните переназначение соответствующих кодов клавиш:\n\n```\nkeycode 29 = Caps_Lock\nkeycode 58 = Control\n```\n\n"
    },
    {
      "title": "Сохранение изменений",
      "level": 4,
      "content": "Чтобы использовать свою раскладку, нужно ее загрузить с помощью loadkeys:\n\n```\n$ loadkeys /usr/local/share/kbd/keymaps/personal.map\n```\n\nОднако, эта раскладка активна только для текущего сеанса. Чтобы загрузить ее при загрузке, укажите полный путь файла вашей раскладки в переменной KEYMAP в /etc/vconsole.conf. Файл не должен быть запакован, как официальные раскладки, представленные kbd.\n\n"
    },
    {
      "title": "Регулировка задержки и скорости автоповтора",
      "level": 2,
      "content": "Задержка автоповтора означает количество времени (обычно в милисекундах), за которое необходимо нажать и удерживать клавишу для начала повторного процесса. После запуска повторяющегося процесса символ будет повторяться с определенной частотой (обычно заданной в Гц), указанной скоростью автоповтора. Эти значения могут быть изменены с помощью команды kbdrate. Обратите внимание, что эти настройки настраиваются отдельно для виртуальной консоли и для Xorg.\n\n```\n# kbdrate [-d delay] [-r rate]\n```\n\nНапример, чтобы установить задержку автоповтора в 200 мс и скорость автоповтора в 30 Гц, используйте следующую команду:\n\n```\n# kbdrate -d 200 -r 30\n```\n\nВвод команды без указания задержки и скорости автоповтора приведет к сбросу значений до их соответствующих значений по умолчанию; задержка 250 мс и скорость 11 Гц:\n\n```\n# kbdrate\n```\n\n"
    },
    {
      "title": "Служба systemd",
      "level": 3,
      "content": "Службу systemd можно использовать для установки скорости клавиатуры. Например\n\n```\n/etc/systemd/system/kbdrate.service\n```\n\n```\n[Unit]\nDescription=Keyboard repeat rate in tty.\n\n[Service]\nType=oneshot\nRemainAfterExit=yes\nStandardInput=tty\nStandardOutput=tty\nExecStart=/usr/bin/kbdrate -s -d 450 -r 60\n \n[Install]\nWantedBy=multi-user.target\n```\n\nЗатем запустите/включите службу systemd kbdrate.service.\n\n"
    }
  ]
}