{
  "title": "Kitty (Português)",
  "url": "https://wiki.archlinux.org/title/Kitty_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O kitty é um emulador de terminal baseado em OpenGL, com scripts, com recursos de mosaico, TrueColor, suporte a ligaduras e extensões de protocolo para entrada de teclado e renderização de imagem.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote kitty.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Novas abas e janelas podem ser criadas e redimensionadas pressionando várias vezes o atalho ctrl+shift. Os layouts são comutáveis por ctrl+shift+l e pode ser salvo/restaurado.\n\nO modo de teclado completo fornece distinção entre chaves ambíguas como ctrl+i vs tab. Além disso, novos efeitos de texto, como sublinhado ondulado, também estão disponíveis para aplicativos que o suportam.\n\n"
    },
    {
      "title": "Kittens",
      "level": 3,
      "content": "kitty possui uma estrutura para criar subprogramas chamados kittens. Alguns deles:\n\n```\n$ kitty +kitten icat image.jpeg             # mostrar imagem no terminal (precisa do imagemagick)\n$ kitty +kitten diff file1 file2            # mostre o diff (diferença) de dois arquivos\n$ kitty +kitten clipboard                   # esse kitten permite trabalhar com a área de transferência mesmo sobre ssh\n```\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Kitty armazena a sua configuração em ~/.config/kitty/kitty.conf. Fontes, cores, cursores e comportamentos de rolagem podem ser ajustados. Você pode ver todas as opções disponíveis na Documentação Oficial (EN). Você também você pode encontrar lá o arquivo de configuração (EN) usado por padrão.\n\n"
    },
    {
      "title": "Problemas de terminal com SSH",
      "level": 3,
      "content": "Quando o kitty é usado para ssh em um controle remoto que não tem seu terminfo, vários problemas podem ocorrer. A solução normalmente é copiar o terminfo. Kitty tem um kitten ssh para automatizar exatamente isso.\n\n```\nkitty +kitten ssh user@host\n```\n\nVocê pode querer defini-lo como um alias para o ssh.\n\nSe por algum motivo você não conseguir instalar o terminfo no controle remoto, você pode tentar configurar TERM para algo que é mais provável de estar presente. Observe que isso pode desativar alguns dos recursos do terminal.\n\n```\nTERM='xterm-256color' ssh user@host\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Repositório do GitHuh\n\n"
    }
  ]
}