{
  "title": "KRunner (Русский)",
  "url": "https://wiki.archlinux.org/title/KRunner_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- KDE (Русский)\n\nKRunner — приложение, встроенное в Plasma 5, для быстрого запуска функций и команд и использующее систему плагинов для настройки доступных для использования функций.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет krunner.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Открыть KRunner в Plasma можно либо через контекстное меню рабочего стола, либо сочетанием клавиш Alt+Space или Alt+F2. В некоторых рабочих пространствах, например, на пустом рабочем столе, начало ввода текста автоматически вызовет KRunner.\n\n"
    },
    {
      "title": "Открытие KRunner клавишей Meta",
      "level": 2,
      "content": "Чтобы сделать Meta горячей клавишей для запуска KRunner, выполните\n\n```\n$ kwriteconfig5 --file kwinrc --group ModifierOnlyShortcuts --key Meta \"org.kde.krunner,/App,,toggleDisplay\"\n```\n\nДля применения изменения в текущем сеансе отправьте D-Bus сигнал процессу KWin:\n\n```\n$ qdbus org.kde.KWin /KWin reconfigure\n```\n\nЕсли вы не используете D-Bus, перезапустите KWin: kwin_x11 --replace в X11 или kwin_wayland --replace в Wayland.\n\n"
    },
    {
      "title": "Переключение между окнами",
      "level": 2,
      "content": "Если вы хотите использовать KRunner только для переключения между открытыми окнами, можно отключить в настройках все лишние модули, кроме модуля «Окна». Однако имейте в виду, что модули поиска также используются в виджете запуска приложений и в эффекте обзора. Если полное отключение вам не подходит, можно использовать другой способ.\n\n1. Откройте Параметры системы > Рабочая среда > Комбинации клавиш > Специальные действия.\n1. Выберите пункт Изменить > Создать > Глобальная комбинация клавиш > Команда D-Bus.\n1. Поставьте галочку справа от имени созданного вами действия.\n1. На вкладке Активация выберите желаемое сочетание клавиш.\n1. На вкладке Действие пропишите следующие параметры: - Приложение : org.kde.krunner - Объект : /App - Функция : querySingleRunner - Аргументы : windows \"\"\n\n```\n- Приложение : org.kde.krunner\n - Объект     : /App\n - Функция    : querySingleRunner\n - Аргументы  : windows \"\"\n```\n\nПримените изменения, и теперь по нажатию выбранного вами сочетания клавиш будет появляться KRunner, выполняющий поиск только по заголовкам окон. К сожалению, такой способ не позволяет отобразить полный список всех открытых окон.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- KRunner на KDE UserBase Wiki\n\n"
    }
  ]
}