{
  "title": "KVM (Español)",
  "url": "https://wiki.archlinux.org/title/KVM_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2024-02-19** \n\nArtículos relacionados\n\n- Categoría:Hipervisores\n- Libvirt\n\nKVM, la Maquina virtual basada en el kernel (Kernel-based Virtual Machine) es un hipervisor integrado al kernel de Linux. Es parecido en propósito a Xen pero es mucho mas fácil de hacer andar. A diferencia QEMU, el cual ocupa emulación, KVM es un modo de operación especial de QEMU que usa extensiones de CPU (Virtualización asistida por hardware HVM) para la virtualización con el modulo del kernel.\n\nAl usar KVM, se pueden ejecutar varias maquinas virtuales ejecutando GNU/Linux, Windows o cualquier otro sistema operativo sin ser modificado. (véase el Estatus de Soporte de Sistema Operativo Invitado para mas información). Cada maquina virtual tiene su propio hardware virtualizado: una tarjeta de red, disco, tarjeta grafica, etc.\n\nPuede encontrar las diferencias entre KVM y Xen, VMware o QEMU en la pagina de preguntas y respuestas frecuentes de KVM.\n\nEste articulo no cubre las características de distintos emuladores usando KVM como base. Usted debe ver los artículos relacionados para esa información.\n\n"
    },
    {
      "title": "Soporte de hardware",
      "level": 3,
      "content": "KVM requiere que el procesador del host tenga soporte para virtualización (llamado Vt-x en los procesadores Intel y AMD-V para los AMD). Puede ver su si procesador tiene soporte para virtualización por hardware con el siguiente comando:\n\n```\n$ LC_ALL=C lscpu | grep Virtualization\n```\n\nY, alternativamente:\n\n```\n$ grep -E --color=auto 'vmx|svm|0xc0f' /proc/cpuinfo\n```\n\nSi al ejecutar cualquiera de los dos comandos no obtiene alguna salida, su procesador no soporta virtualización por hardware , y no podrá usar KVM.\n\n"
    },
    {
      "title": "Soporte en el kernel",
      "level": 3,
      "content": "Arch Linux provee los módulos para el kernel necesarios para soportar KVM.\n\n- Usted puede comprobar si los módulos necesarios (kvm y/o kvm_amd o kvm_intel) están disponibles en el kernel con el siguiente comando:\n\n```\n$ zgrep CONFIG_KVM= /proc/config.gz\n```\n\n- Entonces, asegúrese que los módulos sean cargados automáticamente con el comando:\n\n```\n$ lsmod | grep kvm\n```\n\n```\nkvm_intel             245760  0\nkvmgt                  28672  0\nmdev                   20480  2 kvmgt,vfio_mdev\nvfio                   32768  3 kvmgt,vfio_mdev,vfio_iommu_type1\nkvm                   737280  2 kvmgt,kvm_intel\nirqbypass              16384  1 kvm\n```\n\nSi el comando no devuelve nada, el modulo necesita ser cargado manualmente; véase Kernel module (Español)#Manejo manual de módulos.\n\n"
    },
    {
      "title": "Paravirtualización con Virtio",
      "level": 2,
      "content": "La paravirtualización provee un medio de comunicación rápido y eficiente para los sistemas huésped (guests) para usar los dispositivos de la maquina anfitriona (host). KVM provee dispositivos paravirtualizados a las maquinas virtuales usando la API (Application Programming Interfase: Interfaz de Programación de aplicaciones) de Virtio como una capa entre el hipervisor y el invitado.\n\nTodos los dispositivos Virtio tienen dos partes: el dispositivo anfitrión y el controlador huésped.\n\n"
    },
    {
      "title": "Soporte en el kernel",
      "level": 3,
      "content": "Use el siguiente comando para ver si los módulos VIRTIO están disponibles en el kernel dentro de la maquina virtual:\n\n```\n$ zgrep VIRTIO /proc/config.gz\n```\n\nY, revise si los módulos del kernel son cargados automáticamente con el comando:\n\n```\n$ lsmod | grep virtio\n```\n\nEl en caso de que los comandos anteriores no devuelvan nada, tiene que cargar los módulos manualmente.\n\n"
    },
    {
      "title": "Lista de dispositivos paravirtualizados",
      "level": 3,
      "content": "- dispositivo de red (virtio-net)\n- dispositivo de bloque (virtio-blk)\n- dispositivo controlador (virtio-scsi)\n- dispositivo serial (virtio-serial)\n- dispositivo balón (balloon device) (virtio-balloon)\n\n"
    },
    {
      "title": "Como usar KVM",
      "level": 2,
      "content": "Véase el articulo principal: QEMU (Español).\n\n"
    },
    {
      "title": "Virtualización anidada",
      "level": 3,
      "content": "La virtualización anidada permite que maquinas virtuales existentes puedan ser ejecutadas en hipervisores de terceros y en otra nubes sin alguna modificación a la maquina virtual original o su funcionamiento de red.\n\nActive la función de virtualización anidada en el anfitrión para kvm_intel:\n\n```\n# modprobe -r kvm_intel\n# modprobe kvm_intel nested=1\n```\n\nPara hacerlo permanente (Véase Kernel module (Español)#Configurar las opciones del módulo):\n\n```\n/etc/modprobe.d/kvm_intel.conf\n```\n\n```\noptions kvm_intel nested=1\n```\n\nVerifique que la función este activada:\n\n```\n$ cat /sys/module/kvm_intel/parameters/nested\n```\n\n```\nY\n```\n\nActive el modo de \"host passthrough\" (paso sobre el anfitrión) para enviar todas las características de la CPU al sistema anfitrión:\n\n1. Si esta usando QEMU, ejecute la maquina virtual con el siguiente comando: qemu-system-x86_64 -enable-kvm -cpu host.\n1. Si usa virt-manager, cambie el modelo de la CPU a host-passthrough.\n1. Si esta usando virsh, use virsh edit vm-name y cambie la linea de CPU a <cpu mode='host-passthrough' check='partial'/>\n\nInicie la maquina virtual y compruebe que la propiedad vmx este presente:\n\n```\n$ grep -E --color=auto 'vmx|svm' /proc/cpuinfo\n```\n\n"
    },
    {
      "title": "Activando páginas enormes",
      "level": 3,
      "content": "Puede activar las hugepages para mejorar el rendimiento de su maquina virtual. Con una maquina con Arch Linux actualizado y KVM funcional probablemente ya tiene todo lo que necesita. Compruebe su tiene el directorio /dev/hugepages. Si no lo tiene, creelo. Ahora necesita establecer los permisos apropiados para usar ese directorio. Los permisos por defecto son el uid (User Identifier: Identificador de Usuario) y el gid (Group Identifier: Identificador del Grupo) del usuario root con 0755, pero queremos que cualquiera en el grupo kvm tenga acceso a las hugepages.\n\nAñada a su /etc/fstab:\n\n```\n/etc/fstab\n```\n\n```\nhugetlbfs       /dev/hugepages  hugetlbfs       mode=01770,gid=kvm        0 0\n```\n\nEn lugar de especificar el nombre del grupo directamente, con gid=kvm, puede especificar el gid como un número, pero el gid debe ser igual al del grupo kvm. El modo 1770 permite que cualquiera en el grupo crear archivos, pero no desenlazar o renombrar los archivos de otros. Asegúrese que /dev/hugepages este correctamente montado:\n\n```\n# umount /dev/hugepages\n# mount /dev/hugepages\n$ mount | grep huge\n```\n\n```\nhugetlbfs on /dev/hugepages type hugetlbfs (rw,relatime,mode=1770,gid=78)\n```\n\nAhora puede calcular cuantas hugepages va a necesitar. Véase que tan grandes son sus hugepages:\n\n```\n$ grep Hugepagesize /proc/meminfo\n```\n\nNormalmente, el tamaño debería ser de 2048 kB (que corresponde a 2 MB). Digamos que quiere ejecutar su maquina virtual con 1024 MB, así que divide 1024 / 2 = 512 y lo aumenta un poco para redondearlo a 550. Ahora establezca la cantidad de hugepages que quiere:\n\n```\necho 550 > /proc/sys/vm/nr_hugepages\n```\n\nSi tiene suficiente espacio libre, debería ver lo siguiente:\n\n```\n$ grep HugePages_Total /proc/meminfo\n```\n\n```\nHugesPages_Total:  550\n```\n\nSi obtiene un numero menor, cierre algunas aplicaciones o inicie su maquina virtual con menos memoria (numero_de_hugepages x 2):\n\n```\n$ qemu-system-x86_64 -enable-kvm -m 1024 -mem-path /dev/hugepages -hda <disk_image> [...]\n```\n\nFíjese en el parámetro -mem-path. Este hará uso de las hugepages.\n\nMientras que su maquina virtual se esta ejecutando, puede comprobar cuantas hugepages están siendo usadas:\n\n```\n$ grep HugePages /proc/meminfo\n```\n\n```\nHugePages_Total:     550\nHugePages_Free:       48\nHugePages_Rsvd:        6\nHugePages_Surp:        0\n```\n\nAhora que todo parece funcionar, puede activar las hugepages por defecto. Añada a su /etc/sysctl.d/40-hugepage.conf:\n\n```\n/etc/sysctl.d/40-hugepage.conf\n```\n\n```\nvm.nr_hugepages = 550\n```\n\nVéase tambien:\n\n- Sumario de soporte de hugetlbpage en el kernel de Linux (en inglés)\n- Debian Wiki - Hugepages (en inglés)\n\n"
    },
    {
      "title": "Secure Boot",
      "level": 3,
      "content": "KVM Secure boot tiene algunos requisitos antes de poder activarse:\n\n1. Debe utilizar una UEFI con soporte de arranque seguro compilado.\n1. La UEFI debe tener claves registradas.\n\nPara activar UEFI con soporte de arranque seguro, instale edk2-ovmf y configure su máquina virtual para utilizar UEFI activado para arranque seguro. Si está utilizando libvirt, puede hacerlo añadiendo lo siguiente a la configuración XML de su máquina virtual.\n\n```\n<os firmware=\"efi\">\n  <loader readonly=\"yes\" secure=\"yes\" type=\"pflash\">/usr/share/edk2/x64/OVMF_CODE.secboot.4m.fd</loader>\n</os>\n```\n\nA continuación, debe registrar algunas claves. En este ejemplo registraremos las claves de inicio seguras de Microsoft y Redhat. Instale virt-firmware y ejecute lo siguiente. Reemplace vm_name con el nombre de su máquina virtual.\n\n```\n$ virt-fw-vars --input /var/lib/libvirt/qemu/nvram/vm_name_VARS.fd --output /var/lib/libvirt/qemu/nvram/vm_name_SECURE_VARS.fd --secure-boot --enroll-redhat\n```\n\nLuego edite la configuración XML de libvirt de su máquina virtual para que apunte al nuevo archivo VARS.\n\n```\n<os firmware=\"efi\">\n  <loader readonly=\"yes\" secure=\"yes\" type=\"pflash\">/usr/share/edk2/x64/OVMF_CODE.secboot.4m.fd</loader>\n  <nvram template=\"/usr/share/edk2/x64/OVMF_VARS.4m.fd\">/var/lib/libvirt/qemu/nvram/{vm-name}_SECURE_VARS.fd</nvram>\n</os>\n```\n\nDespués de este arranque seguro debería activarse automáticamente. Puede volver a comprobarlo entrando al BIOS de la máquina virtual presionando F2 cuando vea el logotipo de inicio UEFI.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Indice de tutoriales de KVM (en inglés)\n- Preguntas y respuestas frecuentes de KVM (en inglés)\n\n"
    }
  ]
}