{
  "title": "La Filosofía de Arch",
  "url": "https://wiki.archlinux.org/title/La_Filosof%C3%ADa_de_Arch",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-09-30** \n\nArch Linux es una distribución GNU/Linux de propósito general, desarrollada independientemente para x86-64, que se esfuerza por proporcionar las últimas versiones estables de la mayoría del software, siguiendo un modelo de lanzamiento continuo (rolling-release). La instalación por defecto deja un sistema de base mínima, que el usuario configurará posteriormente agregando lo que necesite.\n\n"
    },
    {
      "title": "Simplicidad",
      "level": 3,
      "content": "Arch Linux define simplicidad como sin adiciones o modificaciones innecesarias. El software es lanzado por los desarrolladores originales (upstream) con cambios mínimos (downstream) específicos para la distribución en cuestión: se evitan los parches no aceptados por upstream, y los parches downstream de Arch consisten, casi en su totalidad, en correcciones de errores backports que han quedado desfasados por el próximo lanzamiento del proyecto.\n\nDe un modo similar, los archivos de configuración de Arch proporcionados por los desarrolladores contienen cambios limitados relativos a cuestiones específicas de la distribución, como el ajuste de las rutas de los archivos del sistema. No añade características de automatización, tales como activar un servicio simplemente porque se ha instalado el paquete. Los paquetes son únicamente divididos cuando existen ventajas convincentes, como por ejemplo para ahorrar espacio en disco, en particular con casos de generar acumulación de residuos. No se proporcionan oficialmente utilidades de configuración gráficas, animando al usuario a realizar la mayor parte de la configuración del sistema desde un terminal y con un editor de texto.\n\n"
    },
    {
      "title": "Modernidad",
      "level": 3,
      "content": "Arch Linux se esfuerza por mantener las últimas versiones estables liberadas de software, siempre y cuando no causen errores del sistema en la medida que pueda evitarse razonablemente. Se basa en un sistema lanzamiento continuo, que permite una instalación de una sola vez con actualizaciones continuas.\n\nArch incorpora muchas de las nuevas tecnologías disponibles para los usuarios de GNU/Linux, incluyendo el sistema de inicio systemd, sistemas de archivos modernos, LVM2, software RAID, soporte para udev e initcpio (con mkinitcpio), así como las últimas versiones de kernel disponibles.\n\n"
    },
    {
      "title": "Pragmatismo",
      "level": 3,
      "content": "Arch es una distribución pragmática antes que idealista. Los principios aquí solo sirven como directrices útiles. En última instancia, las decisiones de diseño se realizan caso por caso a través de un desarrollo consensuado. Las técnicas de análisis se basan en la evidencia y los debates, no en la política o las opiniones públicas.\n\nSe ofrece un gran número de paquetes y script de compilación en los diferentes repositorios de Arch Linux tanto de software libre y de código abierto para aquellos que lo prefieran, así como de software propietario para aquellos que abrazan la funcionalidad sobre la ideología.\n\n"
    },
    {
      "title": "Centrado en el usuario",
      "level": 3,
      "content": "Mientras que muchas distribuciones de GNU/Linux intentan ser fáciles de usar, Arch Linux siempre ha pretendido y pretende permanecer centrado en el usuario. La distribución está destinada a cubrir las necesidades de aquellos usuarios que contribuyen a ella, en lugar de tratar de atraer a la mayor cantidad posible de usuarios. Está dirigida a usuarios competentes en GNU/Linux, o a cualquier persona con una actitud «do-it-yourself» que esté dispuesta a leer la documentación y resolver por sí misma los problemas.\n\nTodos los usuarios están invitados a participar y contribuir con la distribución. Informar y ayudar a arreglar errores es altamente valorada y, los parches de mejora de paquetes o los proyectos de core, son muy apreciados: los desarrolladores de Arch, a menudo, comenzaron siendo voluntarios y activos contribuyentes antes de formar parte de ese equipo. Los Archers pueden contribuir libremente con paquetes en Arch User Repository, mejorar la documentación de ArchWiki, proporcionar asistencia técnica a los demás usuarios o simplemente intercambiar opiniones en los foros, listas de correos o Canales IRC. Arch Linux es el sistema operativo elegido por muchas personas en todo el mundo, y existen varias comunidades internacionales que ofrecen ayuda y traducen la documentación a muchos idiomas diferentes.\n\n"
    },
    {
      "title": "Versatilidad",
      "level": 3,
      "content": "Arch Linux es una distribución de propósito general. Tras la instalación, solo se proporciona un entorno de línea de órdenes; en lugar de ir eliminando paquetes innecesarios y no deseados, se ofrece al usuario la posibilidad de crear un sistema personalizado, eligiendo entre miles de paquetes de alta calidad presentes en los repositorios oficiales, con soporte para arquitectura x86-64.\n\nArch es un modelo de lanzamiento continuo (rolling-release) respaldado por pacman, un gestor de paquetes ligero, sencillo y rápido, que permite actualizar de forma continuada todo el sistema con una orden. Arch también ofrece el Arch Build System, un sistema tipo puertos que hace fácil compilar e instalar paquetes desde las fuentes, que también se pueden sincronizar con una orden. Además, el Arch User Repository contiene muchos miles más de scripts PKGBUILD aportados por la comunidad para la elaboración de paquetes desde las fuentes de carácter inestables usando la aplicación makepkg. También hace posible que los usuarios construyan y mantengan sus propios repositorios personalizados con facilidad.\n\n"
    },
    {
      "title": "Historia",
      "level": 2,
      "content": "La comunidad Arch ha crecido y madurado hasta convertirse en una de las distribuciones GNU/Linux más populares e influyentes, también atestiguada por la atención y crítica recibidas a lo largo de los años.\n\nLos desarrolladores de Arch son voluntarios no remunerados, a tiempo parcial, y no hay perspectivas de monetizar Arch Linux, por lo que seguirá siendo libre en todos los sentidos de la palabra. Aquellos con curiosidad por leer más detalles sobre el historial de desarrollo de Arch pueden navegar por el registro de Arch en Internet Archive Wayback Machine y los archivos de noticias de Arch Linux.\n\n"
    },
    {
      "title": "Los primeros años",
      "level": 3,
      "content": "Judd Vinet, un guitarrista ocasional y programador canadiense, comenzó a desarrollar Arch Linux a principios de 2001. Su primer lanzamiento oficial, Arch Linux 0.1, fue el 11 de marzo de 2002. Motivado por la elegante sencillez de Slackware, BSD, PLD Linux y CRUX, y también decepcionado ante la falta de gestión de paquetes en ese momento, Vinet construyó su propia distribución basada en principios similares a aquellas distribuciones. Pero, también escribió un programa de gestión de paquetes llamado pacman para manejar, de forma automática, la instalación, eliminación y actualización de paquetes.\n\n"
    },
    {
      "title": "Los años intermedios",
      "level": 3,
      "content": "La primera comunidad de Arch creció de manera constante, como lo demuestra este gráfico de publicaciones, usuarios e informes de errores en el foro. Por otra parte, fue desde sus primeros días conocida como una comunidad abierta, amigable y colaboradora.\n\n"
    },
    {
      "title": "El nacimiento de ArchWiki",
      "level": 3,
      "content": "En 2005-07-08 la ArchWiki comenzó basada en Mediawiki.\n\n"
    },
    {
      "title": "El amanecer de la era de A. Griffin",
      "level": 3,
      "content": "A finales de 2007, Judd Vinet se retiró de la participación activa como desarrollador de Arch, y transfirió sin problemas las riendas al programador estadounidense Aaron Griffin, también conocido como Phrakture.\n\nCon los años, la comunidad de Arch continuó creciendo y madurando, y ha recibido recientemente una atención inusual de la prensa, teniendo en cuenta el tamaño modesto de esta distribución Linux.\n\nLos desarrolladores de Arch no cobran, dedican a la misma parte de su tiempo y no tienen perspectivas de monetizar Arch Linux, por lo que siguen siendo libres en el sentido más amplio de la palabra. Los curiosos que deseen examinar con más detalle la historia del desarrollo de Arch pueden navegar por la Arch entry in the Internet Archive Wayback Machine y la Arch Linux News Archives.\n\n"
    },
    {
      "title": "Scripts de instalación de Arch",
      "level": 3,
      "content": "El lanzamiento en 2012-07-15 del medio de instalación volvió obsoleta la estructura de instalación por menús de Arch (Arch Installation Framework, también conocido como AIF), en favor de los scripts de instalación de Arch (arch-install-scripts).\n\n"
    },
    {
      "title": "La era de systemd",
      "level": 3,
      "content": "Entre 2012 y 2013 el sistema de inicio tradicional (system V) fue remplazado por systemd.[1][2][3][4]\n\n"
    },
    {
      "title": "Finaliza el soporte de i686",
      "level": 3,
      "content": "En 2017-01-25 se anunció que el soporte para la arquitectura i686 seria finalizado debido a la poca popularidad entre los desarrolladores y la comunidad. Al final de noviembre de 2017, todos los paquetes fueron eliminados de los servidores réplica.\n\n"
    },
    {
      "title": "Revisión del rol y elección del líder del proyecto",
      "level": 3,
      "content": "A principios de 2020, en un esfuerzo de equipo, el personal de Arch Linux diseñó un nuevo proceso para determinar futuros líderes, documentado en DeveloperWiki:Project Leader.\n\nComo Aaron Griffin había decidido renunciar a su cargo, se realizó una encuesta para elegir a una nueva persona para reemplazarlo, y en 2020-02-24 los resultados fueron publicados, haciendo oficial la elección de Levente Polyak.\n\n"
    }
  ]
}