{
  "title": "Language checking (Español)",
  "url": "https://wiki.archlinux.org/title/Language_checking_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-07-16** \n\nEste arículo cubre los programas de corrección ortográfica y de corrección gramatical.\n\nExcepto casos especiales, todos los correctores ortográficos tienen en común el que tienen dos partes: la unidad lógica y el diccionario. Tened en cuenta instalar los dos, aunque el diccionario suele tener como dependencia el paquete de lógica.\n\n"
    },
    {
      "title": "Correctores ortográficos",
      "level": 2,
      "content": "- GNU Aspell — Corrector ortográfico diseñado para reemplazar eventualmente a ispell, véase también aspell(1) y el documento de información.\n\n- Hunspell — Corrector ortográfico y biblioteca y programa del analizador morfológico, véase también hunspell(1).\n\n- Nuspell — Programa y biblioteca de corrector ortográfico diseñado como una alternativa moderna a hunspell, véase también nuspell(1).\n\n- Ispell — Programa interactivo de corrección ortográfica para Unix, véase también ispell(1).\n\n"
    },
    {
      "title": "Idioma específico",
      "level": 3,
      "content": "- Hspell — Corrector ortográfico hebreo\n\n- Voikko — Corrector ortográfico y gramatical finlandés, separador de palabras y recopilación de datos lingüísticos relacionados\n\n"
    },
    {
      "title": "Enchant",
      "level": 3,
      "content": "Enchant es una biblioteca para el corrector ortográfico genérico, desarrollada como parte de AbiWord, que admite todos los correctores ortográficos anteriores, aparte de Ispell.\n\nEnchant está disponible con el paquete enchant. Para su utilización y ordenación de archivo, véase enchant-2(1).\n\nEnchant es utilizado por muchas aplicaciones a través de las siguientes bibliotecas GTK:\n\n- gspell — API flexible para implementar la corrección ortográfica en aplicaciones GTK.\n\n- GtkSpell — Proporciona resaltado y reemplazo de palabras mal escritas al estilo de un procesador de textos en un widget GtkTextView.\n\n"
    },
    {
      "title": "Aplicaciones",
      "level": 3,
      "content": "Firefox, Thunderbird, Chromium y LibreOffice pueden todos utilizar los diccionarios Hunspell instalados en todo el sistema, así como los diccionarios/otros correctores ortográficos instalados a través de sus propios sistemas de extensión. Véase las siguientes secciones:\n\n- Firefox (Español)#Diccionarios para corrección ortográfica\n- Thunderbird#Spell checking\n- LibreOffice (Español)#Corrección de ortografía\n\nAbiWord y Gedit utilizan Enchant.\n\n"
    },
    {
      "title": "Correctores gramaticales",
      "level": 2,
      "content": "- LanguageTool — Corrector de lenguaje de código abierto, escrito en Java.\n\n- Style and Diction — Diction identifica frases largas y mal utilizadas. Style analiza las características superficiales de un documento.\n\n- TeXtidote — Corrector de lenguaje para documentos LaTeX, basado en LanguageTool.\n\n"
    },
    {
      "title": "Aplicaciones",
      "level": 3,
      "content": "Firefox, Thunderbird, Chromium y LibreOffice soportan todos la corrección gramatical solo a través de extensiones. Para LibreOffice, véase LibreOffice (Español)#Comprobación de la gramática con LanguageTool.\n\nAbiWord tiene un corrector gramatical incorporado, véase AbiWord (Español)#Comprobación de gramática.\n\n"
    }
  ]
}