{
  "title": "Laptop (Español)",
  "url": "https://wiki.archlinux.org/title/Laptop_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-04** \n\nEsta Página principal de la computadora portátil contiene enlaces a artículos (secciones) necesarios para configurar una computadora portátil para obtener la mejor experiencia. Configurar una computadora portátil es, en muchos aspectos, lo mismo que configurar una computadora de escritorio. Sin embargo, hay algunas diferencias clave. Arch Linux proporciona todas las herramientas y programas necesarios para tomar el control completo de su computadora portátil. Estos programas y utilidades se destacan a continuación, con tutoriales de consejos apropiados.\n\nPara obtener una descripción general de la compatibilidad de hardware de Linux reportada/lograda de un modelo de computadora portátil en particular, véase los resultados por proveedor en las subpáginas a continuación.\n\nSi hay instrucciones específicas del modelo de computadora portátil, el artículo respectivo se vincula en la primera columna de las subpáginas del proveedor. En caso de que el modelo no figure en la tabla de proveedores, las instrucciones existentes de modelos similares a través de la subcategoría de proveedores en Categoría:Portatil pueden ayudar.\n\n"
    },
    {
      "title": "Gestión de energía",
      "level": 2,
      "content": "La gestión de la energía es muy importante para cualquier persona que desee hacer un buen uso de la capacidad de su batería. Las siguientes herramientas y programas ayudan a aumentar la duración de la batería y a mantener su computadora portátil fresca y silenciosa.\n\n"
    },
    {
      "title": "Estado de la batería",
      "level": 3,
      "content": "La lectura del estado de la batería se puede hacer de varias maneras. El método clásico es un demonio (daemon) que sondea periódicamente el nivel de la batería mediante la interfaz ACPI. En algunos sistemas, la batería envía eventos a udev cada vez que se (des)carga en un 1%, este evento se puede conectar a alguna acción usando una regla udev.\n\n"
    },
    {
      "title": "ACPI",
      "level": 4,
      "content": "El estado de la batería se puede leer utilizando las utilidades ACPI desde el terminal. Las utilidades ACPI de la línea de órdenes se proporcionan a través del paquete acpi. Véase Módulos ACPI para obtener más información.\n\n- cbatticon es un icono de batería que se encuentra en la bandeja del sistema.\n- batifyAUR es un archivo udevrule que activa notificaciones de nivel de batería y enchufe (soporta sesiones multi-x).\n- batsignal es un demonio (daemon) liviano de monitorización de batería que utiliza libnotify para advertir sobre niveles bajos de batería.\n\n"
    },
    {
      "title": "Hibernar con nivel de batería bajo",
      "level": 4,
      "content": "Si su batería envía eventos a udev cada vez que se (des)carga en un 1%, puede utilizar esta regla de udev para hibernar automáticamente el sistema cuando el nivel de la batería es crítico y así evitar que se pierda todo el trabajo no guardado.\n\n```\n/etc/udev/rules.d/99-lowbat.rules\n```\n\n```\n# Suspende el sistema cuando el nivel de la batería caiga al 5% o menos\nSUBSYSTEM==\"power_supply\", ATTR{status}==\"Discharging\", ATTR{capacity}==\"[0-5]\", RUN+=\"/usr/bin/systemctl hibernate\"\n```\n\nEsta regla se repetirá cada vez que se establezca la condición. Como tal, cuando se reanuda desde la hibernación cuando la batería es crítica, la computadora hiberna directamente. Algunas computadoras portátiles no arrancan más allá de cierto nivel de batería, por lo que la regla podría ajustarse en consecuencia.\n\nSi tiene más de una batería o si está utilizando un dispositivo periférico alimentado por batería, la regla podría activarse inesperadamente por la descarga de otra batería; esto se puede arreglar comprobando /sys/class/power_supply/nameOfMainBattery/attributesAndOtherDirectories para otro par de atributos/valores para añadir a su regla udev. Este atributo adicional debe ser específico de la batería principal, por ejemplo model_name.\n\nLas baterías pueden saltar a un valor más bajo en lugar de descargarse continuamente, por lo tanto, se utiliza un patrón de coincidencia de cadena udev para todas las capacidades de 0 a 5.\n\nSe pueden añadir otras reglas para realizar diferentes acciones según el estado y/o la capacidad de la fuente de alimentación.\n\nSi su sistema no tiene o faltan eventos ACPI, ejecute con frecuencia el siguiente script que utiliza acpi:\n\n```\n#!/bin/sh\nacpi -b | awk -F'[,:%]' '{print $2, $3}' | {\n\tread -r status capacity\n\n\tif [ \"$status\" = Discharging -a \"$capacity\" -lt 5 ]; then\n\t\tlogger \"Critical battery threshold\"\n\t\tsystemctl hibernate\n\tfi\n}\n```\n\nSi tiene más de una batería o si está utilizando un dispositivo periférico alimentado por batería, debe modificar la segunda línea del script añadiendo grep para monitorear la batería correcta de la siguiente manera: acpi -b | grep \"Battery 0\" | awk -F'[,:%]' '{print $2, $3}' | {. Reemplace Battery 0 con la batería requerida según lo informado por acpi -b.\n\nUna forma de probar las reglas de udev es hacer que creen un archivo cuando se ejecutan. Por ejemplo:\n\n```\n/etc/udev/rules.d/98-discharging.rules\n```\n\n```\nSUBSYSTEM==\"power_supply\", ATTR{status}==\"Discharging\", RUN+=\"/usr/bin/touch /home/example/discharging\"\n```\n\nEsto crea un archivo en /home/example/discharging cuando se desconecta el cargador de la computadora portátil. Puede probar si la regla funcionó desconectando su computadora portátil y buscando este archivo. Para hacer pruebas más avanzadas de reglas udev, véase Udev#Testing rules before loading.\n\n"
    },
    {
      "title": "Suspender e hibernar",
      "level": 3,
      "content": "La suspensión manual del sistema operativo, ya sea en la memoria (en espera) o en el disco (hibernación), a veces proporciona la forma más eficiente de optimizar la duración de la batería, según el patrón de uso de la computadora portátil.\n\nVéase el artículo principal Suspender e hibernar.\n\n"
    },
    {
      "title": "Problema de giro del disco duro",
      "level": 3,
      "content": "Documentado aquí.\n\nPara evitar que el disco duro de su computadora portátil deje de girar con demasiada frecuencia, establezca una administración de energía menos agresiva como se describe en hdparm#Power management configuration. Incluso los valores predeterminados pueden ser demasiado agresivos.\n\n"
    },
    {
      "title": "Disparadores para despertar",
      "level": 3,
      "content": "Las fuentes/eventos/disparadores para despertar el sistema desde cualquier estados hardware de ahorro de energía. Para encontrar y configurar estos, véase Disparadores para despertar.\n\n"
    },
    {
      "title": "Brillo de la pantalla",
      "level": 3,
      "content": "Véase Backlight.\n\n"
    },
    {
      "title": "Panel táctil",
      "level": 3,
      "content": "Para que su panel táctil funcione correctamente, véase la página libinput. Touchpad Synaptics es el controlador de entrada más antiguo, que actualmente se encuentra en modo de mantenimiento y ya no se actualiza.\n\n"
    },
    {
      "title": "Panel táctil no detectado en absoluto",
      "level": 4,
      "content": "Si un dispositivo de panel táctil no se detecta y no se muestra como un dispositivo, una posible solución podría ser utilizar uno o más de estos parámetros del kernel:\n\n```\ni8042.noloop i8042.nomux i8042.nopnp i8042.reset\n```\n\nSi no se detecta un panel táctil Elantech y aparece la siguiente línea en su journal:\n\n```\nelan_i2c 5-0015: 5-0015 supply vcc not found, using dummy regulator\n```\n\nEstá relacionado con un problema con el módulo psmouse que intenta utilizar un bus secundario para el dispositivo de panel táctil y elan_i2c no lo hace. La solución es forzarlo a utilizar el principal. Cree el archivo mostrado a continuación y vuelva a cargar el módulo psmouse o reinicie:\n\n```\n/etc/modprobe.d/psmouse.conf\n```\n\n```\noptions psmouse elantech_smbus=0\n```\n\n"
    },
    {
      "title": "Lector de huellas dactilares",
      "level": 3,
      "content": "Véase Fingerprint-gui, fprint y ThinkFinger (para ThinkPads).\n\n"
    },
    {
      "title": "Cámara web",
      "level": 3,
      "content": "Véase Configuración de la cámara web.\n\n"
    },
    {
      "title": "Protección contra golpes del disco duro",
      "level": 3,
      "content": "Hay varias computadoras portátiles de diferentes proveedores que cuentan con capacidades de protección contra golpes. Dado que los fabricantes se han negado a admitir el desarrollo de código abierto de los componentes de software requeridos hasta el momento, el soporte de Linux para la protección contra golpes varía considerablemente entre las diferentes implementaciones de hardware.\n\nActualmente, dos proyectos, llamados HDAPS y Hpfall, soportan este tipo de protección. HDAPS es para IBM/Lenovo Thinkpads y hpfall para portátiles HP/Compaq.\n\n"
    },
    {
      "title": "Gráficos híbridos",
      "level": 3,
      "content": "Los fabricantes de computadoras portátiles desarrollaron nuevas tecnologías que involucran dos tarjetas gráficas en una sola computadora, lo que permite usos de alto rendimiento y ahorro de energía. Estas computadoras portátiles generalmente utilizan un chip Intel para la visualización de forma predeterminada, por lo que primero se necesita un controlador Intel graphics. Luego puede elegir métodos para utilizar el segundo chip de gráficos.\n\n"
    },
    {
      "title": "Aceleración de vídeo por hardware",
      "level": 3,
      "content": "El uso de decodificación y codificación por hardware puede conducir a una mayor duración de la batería. Véase Aceleración de vídeo.\n\n"
    },
    {
      "title": "LED de silencio de audio",
      "level": 3,
      "content": "En las computadoras portátiles que utilizan Intel HD Audio, es posible que el usuario deba especificar manualmente el modelo de códec para que funcione el LED de silencio (mute) de audio. Primero, verifique si su computadora portátil utiliza Intel HD Audio; la siguiente orden producirá una salida de ser así:\n\n```\n$ lsmod | grep snd_hda_intel\n```\n\nA continuación, deberá encontrar su modelo de códec de audio:\n\n```\n$ grep Codec /proc/asound/card*/codec*\n```\n\nAhora necesita encontrar su códec en la lista de nombres de modelos disponibles. Si no puede encontrar un códec para su modelo específico, puede encontrar uno que funcione a través de prueba y error.\n\nPara indicarle al módulo del kernel qué opciones específicas del modelo debe cargar, especifique model= opción del módulo del kernel. Por ejemplo:\n\n```\n/etc/modprobe.d/mute-led.conf\n```\n\n```\noptions snd-hda-intel model=nombre_modelo\n```\n\nPara probar si esto funcionó o no, se debe recargar el módulo del kernel. Puede hacerlo reiniciando.\n\nSi necesita probar una gran cantidad de códecs, puede ser más eficiente evitar el reinicio llevando primero el sistema a un estado donde ningún proceso esté utilizando el módulo del kernel y luego recargando el módulo con los nuevos parámetros. Esto se puede hacer cerrando la sesión de todas las sesiones gráficas y de consola, y deteniendo el gestor de pantalla si utiliza uno. Al volver a iniciar sesión en una consola, ejecute las siguientes órdenes:\n\n```\n# modprobe -r snd_hda_intel\n# modprobe snd_hda_intel model=nombre_modelo\n```\n\nEl módulo ahora utilizará el nuevo códec especificado en nombre_modelo.\n\n"
    },
    {
      "title": "Sincronizar reloj mediante la red",
      "level": 2,
      "content": "Para una computadora portátil, puede ser una buena idea utilizar Chrony como alternativa a NTPd, OpenNTPD o systemd-timesyncd para sincronizar su reloj a través de la red. Chrony está diseñado para funcionar bien incluso en sistemas sin conexión de red permanente (como computadoras portátiles) y es capaz de sincronizar el tiempo mucho más rápido que el ntp estándar. Chrony tiene varias ventajas cuando se utiliza en sistemas que se ejecutan en máquinas virtuales, como un mayor rango de corrección de frecuencia para ayudar a corregir los relojes que se desvían rápidamente y una mejor respuesta a los cambios rápidos en la frecuencia del reloj. También tiene una huella de memoria más pequeña y no requiere reactivaciones de procesos innecesarias, lo que mejora la eficiencia energética.\n\n"
    },
    {
      "title": "Escribir páginas de computadora portátil",
      "level": 2,
      "content": "Véase Help:Laptop page guidelines si desea crear o modificar cualquier página de computadora portátil.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Escalado de frecuencia de CPU es una tecnología utilizada principalmente por portátiles que permite que el sistema operativo escale la frecuencia de la CPU hacia arriba o hacia abajo, según la carga del sistema actual y/o el esquema de energía.\n- Señalización de gestión de energía de pantalla describe cómo apagar automáticamente la pantalla de la computadora portátil después de un intervalo específico de inactividad (no solo en blanco con un protector de pantalla, sino completamente apagada).\n- Configuración de red inalámbrica proporciona información sobre la configuración de la conexión inalámbrica.\n- Extra keyboard keys describe la configuración de las teclas multimedia.\n- acpid es un demonio (daemon) flexible y extensible para entregar eventos ACPI.\n\n- Véase Categoría:Portátiles y sus subcategorías para páginas dedicadas a modelos/proveedores específicos.\n- Los ajustes de batería para ThinkPad se pueden encontrar en TLP y el artículo tp_smapi.\n\n- https://linux-on-laptops.com/\n- https://www.linlap.com/\n\n"
    }
  ]
}