{
  "title": "Laptop (Português)",
  "url": "https://wiki.archlinux.org/title/Laptop_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artigo ou esta seção precisa de tradução.** Este artigo ou esta seção precisa de tradução.\n\nEste artigo ou esta seção precisa de tradução.\n\nEssa página de manual do Laptop contém links para artigos (seções) necessários para configurar um laptop para a melhor experiência. Configurar um laptop é, em muitos aspectos, o mesmo que configurar um desktop. No entanto, existem algumas diferenças importantes. O Arch Linux fornece todas as ferramentas e programas necessários para assumir o controle total do seu laptop. Esses programas e utilitários são destacados a seguir, com tutoriais de dicas apropriados.\n\nPara obter uma visão geral da compatibilidade de hardware Linux relatada/alcançada de um modelo específico de laptop, consulte os resultados por fornecedor das subpáginas abaixo.\n\nSe houver instruções específicas para o modelo do laptop, o respectivo artigo será reticulado na primeira coluna das subpáginas do fornecedor. Caso o modelo não esteja listado na tabela de fornecedores, instruções existentes de modelos semelhantes por meio do Laptops a subcategoria de fornecedores pode ajudar.\n\n"
    },
    {
      "title": "Gerenciar energia",
      "level": 2,
      "content": "O gerenciamento de energia é muito importante para quem deseja fazer bom uso da capacidade da bateria. As ferramentas e programas a seguir ajudam a aumentar a vida útil da bateria e a manter o laptop refrigerado e silencioso.\n\n"
    },
    {
      "title": "Estado da bateria",
      "level": 3,
      "content": "A leitura do estado da bateria pode ser feita de várias maneiras. O método clássico é usar algum daemon que verifica periodicamente o nível da bateria usando a interface ACPI. Em alguns sistemas, a bateria envia eventos ao udev sempre que (des) carrega em 1%, esse evento pode ser conectado a alguma ação usando uma regra do udev.\n\n"
    },
    {
      "title": "ACPI",
      "level": 4,
      "content": "O estado da bateria pode ser lido usando os utilitários ACPI do terminal. Os utilitários de linha de comando ACPI são fornecidos através do pacote acpi. Veja ACPI modules para mais informações.\n\n- cbatticon é um ícone de bateria que fica na bandeja do sistema.\n- batifyAUR é um arquivo de regra udev que aciona notificações de nível de bateria e plug-in (suporte a sessões multi-x).\n- batsignal é um daemon de monitor de bateria leve que usa libnotify para alertar sobre níveis de bateria fraca.\n\n"
    },
    {
      "title": "Hibernar com bateria fraca",
      "level": 4,
      "content": "Se a sua bateria enviar eventos para o udev sempre que (des) carregar em 1%, você pode usar esta regra do udev para hibernar automaticamente o sistema quando o nível da bateria for crítico e, assim, evitar que todo trabalho não salvo seja perdido.\n\n```\n/etc/udev/rules.d/99-lowbat.rules\n```\n\n```\n# Suspenda o sistema quando o nível da bateria cair para 5% ou menos\nSUBSYSTEM==\"power_supply\", ATTR{status}==\"Discharging\", ATTR{capacity}==\"[0-5]\", RUN+=\"/usr/bin/systemctl hibernate\"\n```\n\nEsta regra será repetida sempre que a condição for definida. Assim, ao retomar da hibernação quando a bateria está crítica, o computador hibernará diretamente. Alguns laptops não inicializam além de um determinado nível de bateria, portanto, a regra pode ser ajustada de acordo.\n\nSe você tiver mais de uma bateria ou se estiver usando um dispositivo periférico alimentado por bateria, a regra pode ser disparada inesperadamente por outra bateria descarregando; isso pode ser corrigido verificando /sys/class/power_supply/nameOfMainBattery/attributesAndOtherDirectories para outro atributo/valor de par para adicionar à sua regra udev. Este outro atributo deve ser específico para a bateria principal, por exemplo model_name.\n\nAs baterias podem saltar para um valor mais baixo em vez de descarregar continuamente, portanto, um padrão de correspondência de string udev para todas as capacidades de 0 a 5 é usado.\n\nOutras regras podem ser adicionadas para executar ações diferentes dependendo do status e/ou capacidade da fonte de alimentação.\n\nSe o seu sistema não tem eventos ACPI ou estão faltando, use o cron com o seguinte script que usa o pacote acpi:\n\n```\n#!/bin/sh\nacpi -b | awk -F'[,:%]' '{print $2, $3}' | {\n\tread -r status capacity\n\n\tif [ \"$status\" = Discharging -a \"$capacity\" -lt 5 ]; then\n\t\tlogger \"Critical battery threshold\"\n\t\tsystemctl hibernate\n\tfi\n}\n```\n\nSe você tiver mais de uma bateria ou se estiver usando um dispositivo periférico alimentado por bateria, deve modificar a segunda linha do script adicionando grep monitorar a bateria corretamente assim: acpi -b | grep \"Battery 0\" | awk -F'[,:%]' '{print $2, $3}' | {. Substitua Battery 0 com a bateria necessária, conforme relatado por acpi -b.\n\nUma forma de testar as regras do udev é fazer com que criem um arquivo quando forem executadas. Por exemplo:\n\n```\n/etc/udev/rules.d/98-discharging.rules\n```\n\n```\nSUBSYSTEM==\"power_supply\", ATTR{status}==\"Discharging\", RUN+=\"/usr/bin/touch /home/example/discharging\"\n```\n\nIsso cria um arquivo em /home/example/discharging quando o carregador do laptop é desconectado. Você pode testar se a regra funcionou desconectando seu laptop e procurando este arquivo. Para testes mais avançados de regras do udev, veja Udev#Testing rules before loading.\n\n"
    },
    {
      "title": "Suspender e hibernar",
      "level": 3,
      "content": "Suspender manualmente o sistema operacional, seja para a memória (standby) ou para o disco (hibernate), às vezes é a maneira mais eficiente de otimizar a vida útil da bateria, dependendo do padrão de uso do laptop.\n\nVeja o artigo principal Suspensão e hibernação.\n\n"
    },
    {
      "title": "Problema de rotação do disco rígido",
      "level": 3,
      "content": "Documentação aqui (EN).\n\nPara evitar que o disco rígido do seu laptop desligue com muita frequência, defina um gerenciamento de energia menos agressivo, conforme descrito em Configuração de gerenciamento de energia (EN). Mesmo os valores padrão podem ser muito agressivos.\n\n"
    },
    {
      "title": "Modificar eventos de despertar",
      "level": 3,
      "content": "Eventos que fazem com que o sistema seja reiniciado power states pode ser regulado em /proc/acpi/wakeup. Escrevendo uma entrada do Dispositivo alterna o status de habilitado para desabilitado, ou vice-versa.\n\nPor exemplo, para desativar o despertar da suspensão (S3) ao abrir a tampa, execute:\n\n```\n# echo LID > /proc/acpi/wakeup\n```\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nEssa mudança pode se tornar permanente com tmpfiles.d(5):\n\n```\n/etc/tmpfiles.d/disable-lid-wakeup.conf\n```\n\n```\nw /proc/acpi/wakeup - - - - LID\n```\n\n"
    },
    {
      "title": "Brilho da tela",
      "level": 3,
      "content": "Veja Backlight.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "Para fazer seu touchpad funcionar corretamente, consulte a página libinput. Touchpad Synaptics é o driver de entrada mais antigo, que está atualmente em modo de manutenção e não é mais atualizado.\n\n"
    },
    {
      "title": "Touchpad não detectado de todo",
      "level": 4,
      "content": "Se um dispositivo touchpad não for detectado e mostrado como um dispositivo, uma possível solução pode ser usar um ou mais desses parâmetros de kernel.\n\n```\ni8042.noloop i8042.nomux i8042.nopnp i8042.reset\n```\n\nSe for um Touchpad Elantech não sendo detectado e você estiver obtendo a seguinte linha em seu journalctl -k:\n\n```\nelan_i2c 5-0015: 5-0015 supply vcc not found, using dummy regulator\n```\n\nestá relacionado a um problema com o módulo psmouse tentando usar um barramento secundário para o dispositivo touchpad, e elan_i2c falhando em fazê-lo. A solução é forçá-lo a usar o principal. Basta criar o arquivo abaixo e recarregar o módulo psmouse ou reiniciar:\n\n```\n/etc/modprobe.d/psmouse.conf\n```\n\n```\noptions psmouse elantech_smbus=0\n```\n\n"
    },
    {
      "title": "Leitor de impressão digital",
      "level": 3,
      "content": "Veja Fingerprint-gui, fprint e ThinkFinger (para ThinkPads).\n\n"
    },
    {
      "title": "Webcam",
      "level": 3,
      "content": "Veja Configuração Webcam (EN).\n\n"
    },
    {
      "title": "Proteção contra choque do disco rígido",
      "level": 3,
      "content": "Existem vários laptops de diferentes fornecedores com recursos de proteção contra choques. Como os fabricantes se recusaram a oferecer suporte ao desenvolvimento de código aberto dos componentes de software necessários até agora, o suporte do Linux para proteção contra choque varia consideravelmente entre as diferentes implementações de hardware.\n\nAtualmente, dois projetos, chamados HDAPS e Hpfall (disponível no AUR), suportam este tipo de proteção. HDAPS é para IBM/Lenovo Thinkpads e hpfall para laptops HP/Compaq.\n\n"
    },
    {
      "title": "Gráficos híbridos",
      "level": 3,
      "content": "Os fabricantes de laptops desenvolveram novas tecnologias envolvendo duas placas gráficas em um único computador, possibilitando o uso de alto desempenho e economia de energia. Esses laptops geralmente usam um chip Intel para exibição por padrão, então um Gráficos Intel o driver é necessário primeiro. Então você pode choose methods para utilizar o segundo chip gráfico.\n\n"
    },
    {
      "title": "LED de áudio mudo",
      "level": 3,
      "content": "Em laptops que usam o Intel HD Audio, o usuário pode precisar especificar manualmente o modelo do codec para que o LED de áudio mudo funcione. Primeiro, verifique se o seu laptop usa Intel HD Audio:\n\n```\n# lsmod | grep snd_hda_intel\n```\n\nSe isso produzir qualquer saída, então o seu laptop usa Intel HD Audio. Em seguida, você precisará encontrar seu modelo de codec de áudio. Para fazer esta execução:\n\n```\n# cat /proc/asound/card*/codec* | grep Codec\n```\n\nAgora você precisa encontrar seu codec no lista de nomes de modelos disponíveis (EN). Se você não conseguir encontrar um codec para o seu modelo específico, poderá encontrar um que funcione por tentativa e erro.\n\nA fim de dizer ao módulo do kernel quais opções específicas do modelo carregar, especifique o model= Opções de configuração de módulos. Para exemplo:\n\n```\n/etc/modprobe.d/mute-led.conf\n```\n\n```\noptions snd-hda-intel model=model_name\n```\n\nPara testar se isso funcionou ou não, o módulo do kernel deve ser recarregado. Você pode fazer isso reiniciando.\n\n"
    },
    {
      "title": "Sincronização da hora da rede",
      "level": 2,
      "content": "Para um laptop, pode ser uma boa ideia usar Chrony como uma alternativa para NTPd, OpenNTPD ou systemd-timesyncd para sincronizar seu relógio pela rede. O Chrony foi projetado para funcionar bem mesmo em sistemas sem conexão de rede permanente (como laptops) e é capaz de sincronização de tempo muito mais rápida do que o ntp padrão. O Chrony tem várias vantagens quando usado em sistemas executados em máquinas virtuais, como um intervalo maior para correção de frequência para ajudar a corrigir variações rápidas de relógios e melhor resposta a mudanças rápidas na frequência do relógio. Ele também ocupa menos memória e não desperta processos desnecessários, melhorando a eficiência de energia.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Escala de frequência da CPU é uma tecnologia usada principalmente por notebooks que permite ao sistema operacional aumentar ou diminuir a frequência da CPU, dependendo da carga atual do sistema e/ou esquema de energia.\n- Display Power Management Signaling descreve como desligar automaticamente a tela do laptop após um intervalo especificado de inatividade (não apenas apagada com um protetor de tela, mas completamente desligada).\n- Configuração de rede fornece informações sobre como configurar a conexão sem fio.\n- Extra keyboard keys descreve a configuração das chaves de mídia.\n- acpid é um daemon flexível e extensível para entrega de eventos ACPI.\n\n- Veja Laptops e suas subcategorias para páginas dedicadas a modelos/fornecedores específicos.\n- Ajustes de bateria para ThinkPads podem ser encontrados em TLP e no artigo tp_smapi.\n\n- http://www.linux-on-laptops.com/\n- http://www.linlap.com/\n\n"
    }
  ]
}