{
  "title": "Laptop Mode Tools (Français)",
  "url": "https://wiki.archlinux.org/title/Laptop_Mode_Tools_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- acpid\n- systemd (Français)\n- CPU frequency scaling (Français)\n- Laptop\n- Powertop (Français)\n- TLP\n\nLaptop Mode Tools est un ensemble de fonctions d'économie d'énergie pour les systèmes Linux. C'est le principal moyen d'activer la fonction Laptop Mode du noyau Linux, qui permet à votre disque dur de s'arrêter. En outre, il vous permet de modifier un certain nombre d'autres paramètres liés à l'alimentation en utilisant un simple fichier de configuration.\n\nCombiné avec acpid et la gestion de fréquence du processeur, LMT fournit à la plupart des utilisateurs une suite complète de gestion de l'alimentation des ordinateurs portables.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet laptop-mode-toolsAUR ou le paquet laptop-mode-tools-gitAUR.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "La configuration est gérée par :\n\n- /etc/laptop-mode/laptop-mode.conf - le fichier de configuration primaire.\n- /etc/laptop-mode/conf.d/* - des dizaines de \"modules\" spécifiques aux fonctionnalités.\n\nChaque module peut être explicitement enabled (activé), disabled (désactivé), ou mis à auto en modifiant l'argument CONTROL_* de n'importe quel fichier de conf.d/. LMT tentera d'activer tous les modules où CONTROL_* est défini à auto si ENABLE_AUTO_MODULES est défini dans /etc/laptop-mode/laptop-mode.conf. Il existe deux exceptions à la règle ci-dessus : auto-hibernate.conf et battery-level-polling.conf utilisent une variable ENABLE_* au lieu de CONTROL_*.\n\nPour vérifier rapidement quels modules sont activés, désactivés ou automatiques, exécutez :\n\n```\n$ grep -r '^\\(CONTROL\\|ENABLE\\)_' /etc/laptop-mode/conf.d\n```\n\nEnfin, activez laptop-mode.service.\n\n"
    },
    {
      "title": "Disques durs",
      "level": 3,
      "content": "Pour cela, vous devez avoir installé hdparm et/ou sdparm. Consultez Hdparm.\n\nLa mise en rotation du disque dur grâce aux valeurs hdparm -S permet d'économiser de l'énergie et rend le tout beaucoup plus silencieux. LMT peut également définir des valeurs pour hdparm -B. La valeur maximale d'économie d'énergie du disque dur est de 1 et la valeur minimale de 254. Par exemple, définissez cette valeur à 254 sur le secteur et à 20 sur la batterie. Si vous trouvez que l'activité normale se bloque souvent en attendant que le disque tourne, il peut être judicieux de définir une valeur plus élevée (par exemple 128), ce qui le fera tourner moins souvent. Les valeurs hdparm -S et hdparm -B sont configurées dans /etc/laptop-mode/laptop-mode.conf.\n\nAvec la variable CONTROL_MOUNT_OPTIONS (activée par défaut), laptop-mode-tools remonte automatiquement vos partitions, en ajoutant commit=600,noatime dans les options de montage. Cela empêche le programme de journalisation jbd2 d'accéder à votre disque toutes les quelques secondes, le journal du disque étant mis à jour toutes les 10 minutes.\n\n"
    },
    {
      "title": "SSD",
      "level": 4,
      "content": "Extrait de la FAQ officielle :\n\nQuestion : J'ai un SSD dans ma machine. Dois-je activer l'une ou l'autre des parties de laptop-mode-tools relatives aux disques, ou sont-elles sans intérêt ?\n\nRéponse: Ils peuvent être pertinents, car (a) le mode ordinateur portable réduira le nombre d'écritures, ce qui améliore la durée de vie d'un SSD, et (b) le mode ordinateur portable rend les écritures rapides, ce qui permet aux mécanismes d'économie d'énergie comme l'ALPM d'entrer en action. Cependant, votre expérience pourra être différente en fonction du matériel spécifique concerné. Pour certains matériels, vous n'obtiendrez aucun gain du tout, pour d'autres, le gain peut être substantiel.\n\n"
    },
    {
      "title": "Fréquence du CPU",
      "level": 3,
      "content": "Pour cela, vous devez avoir un pilote de fréquence CPU installé. Consultez modification de la fréquence du CPU.\n\n```\n# cpufreq.conf\n# ThinkPad T40/T42/T60 Example\n#\nCONTROL_CPU_FREQUENCY=1\nBATT_CPU_MAXFREQ=fastest\nBATT_CPU_MINFREQ=slowest\nBATT_CPU_GOVERNOR=ondemand\nBATT_CPU_IGNORE_NICE_LOAD=1\nLM_AC_CPU_MAXFREQ=fastest\nLM_AC_CPU_MINFREQ=slowest\nLM_AC_CPU_GOVERNOR=ondemand\nLM_AC_CPU_IGNORE_NICE_LOAD=1\nNOLM_AC_CPU_MAXFREQ=fastest\nNOLM_AC_CPU_MINFREQ=slowest\nNOLM_AC_CPU_GOVERNOR=ondemand\nNOLM_AC_CPU_IGNORE_NICE_LOAD=0\nCONTROL_CPU_THROTTLING=0\n```\n\n"
    },
    {
      "title": "Intel SATA",
      "level": 4,
      "content": "Activez la fonction de gestion de l'énergie de la liaison agressive du contrôleur Intel SATA AHCI pour mettre la liaison du disque en mode de très faible consommation en l'absence d'E/S de disque.\n\n```\n# intel-sata-powermgmt.conf\n# ThinkPad T40/T42/T60 Example\n#\nDEBUG=0\nCONTROL_INTEL_SATA_POWER=1\nBATT_ACTIVATE_SATA_POWER=1\nLM_AC_ACTIVATE_SATA_POWER=1\nNOLM_AC_ACTIVATE_SATA_POWER=0\n```\n\n"
    },
    {
      "title": "USB autosuspend",
      "level": 4,
      "content": "```\n# runtime-pm.conf\n# Exemple pour ThinkPad T40/T42/T60\n#\nDEBUG=0\nCONTROL_RUNTIME_AUTOSUSPEND=1\nBATT_SUSPEND_RUNTIME=1\nLM_AC_SUSPEND_RUNTIME=1\nNOLM_AC_SUSPEND_RUNTIME=1\nAUTOSUSPEND_TIMEOUT=2\n```\n\n"
    },
    {
      "title": "Luminosité de l'écran LCD",
      "level": 4,
      "content": "Les valeurs de luminosité disponibles pour certains ordinateurs portables peuvent être obtenues en exécutant la commande suivante :\n\n```\n$ cat /proc/acpi/video/VID/LCD/brightness\n```\n\nPour les ordinateurs portables ThinkPad T40/T42, les valeurs de luminosité minimale et maximale peuvent être obtenues en exécutant :\n\n```\n$ cat /sys/class/backlight/acpi_video0/brightness\n$ cat /sys/class/backlight/acpi_video0/max_brightness\n```\n\n```\n# lcd-brightness.conf\n# ThinkPad T40/T42 Example\n#\nDEBUG=0\nCONTROL_BRIGHTNESS=1\nBATT_BRIGHTNESS_COMMAND=\"echo 0\"\nLM_AC_BRIGHTNESS_COMMAND=\"echo 7\"\nNOLM_AC_BRIGHTNESS_COMMAND=\"echo 7\"\nBRIGHTNESS_OUTPUT=\"/sys/class/backlight/thinkpad_screen/brightness\"\n```\n\nPour les ordinateurs portables ThinkPad T60, les valeurs de luminosité minimale et maximale peuvent être obtenues en exécutant :\n\n```\n$ cat /sys/class/backlight/thinkpad_screen/max_brightness\n$ cat /sys/class/backlight/thinkpad_screen/brightness\n```\n\n```\n# lcd-brightness.conf\n# Exemple pour ThinkPad T60\n#\nDEBUG=0\nCONTROL_BRIGHTNESS=1\nBATT_BRIGHTNESS_COMMAND=\"echo 0\"\nLM_AC_BRIGHTNESS_COMMAND=\"echo 7\"\nNOLM_AC_BRIGHTNESS_COMMAND=\"echo 7\"\nBRIGHTNESS_OUTPUT=\"/sys/class/backlight/acpi_video0/brightness\"\n```\n\n"
    },
    {
      "title": "Écran vide pour le terminal",
      "level": 4,
      "content": "```\n# terminal-blanking.conf\n# Exemple pour ThinkPad T40/T42/T60\n#\nDEBUG=0\nCONTROL_TERMINAL=1\nTERMINALS=\"/dev/tty1\"\nBATT_TERMINAL_BLANK_MINUTES=1\nBATT_TERMINAL_POWERDOWN_MINUTES=2\nLM_AC_TERMINAL_BLANK_MINUTES=10\nLM_AC_TERMINAL_POWERDOWN_MINUTES=10\nNOLM_AC_TERMINAL_BLANK_MINUTES=10\nNOLM_AC_TERMINAL_POWERDOWN_MINUTES=10\n```\n\n"
    },
    {
      "title": "Ethernet",
      "level": 4,
      "content": "```\n# ethernet.conf\n# Exemple pour ThinkPad T40/T42/T60\n#\nDEBUG=0\nCONTROL_ETHERNET=1\nLM_AC_THROTTLE_ETHERNET=0\nNOLM_AC_THROTTLE_ETHERNET=0\nDISABLE_WAKEUP_ON_LAN=1\nDISABLE_ETHERNET_ON_BATTERY=1\nETHERNET_DEVICES=\"eth0\"\n```\n\n"
    },
    {
      "title": "Réseau local sans fil",
      "level": 4,
      "content": "Les paramètres de gestion de l'alimentation des interfaces sans fil dépendent du matériel et sont donc un peu plus difficiles à configurer. Selon le chipset sans fil, les paramètres sont gérés dans l'un des trois fichiers suivants :\n\n1. /etc/laptop-mode/conf.d/wireless-power.conf pour une méthode générique d'économie d'énergie (en utilisant \"iwconfig wlan0 power on/off\"). Ceci s'applique à la plupart des chipsets (c'est-à-dire tout ce qui n'est pas des chipsets Intel listés ci-dessous).\n1. /etc/laptop-mode/conf.d/wireless-ipw-power.conf pour les chipsets Intel pilotés par l'ancien pilote ipw. Ceci s'applique aux IPW3945, IPW2200 et IPW2100. Il utilise actuellement (à partir de LMT 1.55-1) iwpriv pour IPW3945, et une combinaison des paramètres iwconfig et iwpriv pour IPW2100 et IPW220. Consultez /usr/share/laptop-mode-tools/modules/wireless-ipw-power pour plus de détails. (notez que l'ipw3945 n'est plus utilisé, consultez ci-dessous)\n1. /etc/laptop-mode/conf.d/wireless-iwl-power.conf pour les chipsets Intel pilotés par les modules iwl4965, iwl3945 et iwlagn (ce dernier prend en charge les chipsets 4965, 5100, 5300, 5350, 5150, 1000, et 6000)\n\nNotez que l'activation de ces trois modules ne devrait pas poser beaucoup de problèmes, puisque LMT détecte le module utilisé par l'interface et agit en conséquence.\n\nLes modules pris en charge pour chaque fichier de configuration, indiqués ci-dessus, sont pris directement dans LMT. Cependant, cela semble être un peu dépassé, puisque le noyau actuel 2.6.34 ne fournit plus les modules ipw3945 et iwl4965 (le chipset 3945 utilise iwl3945 à la place, et le 4965 utilise le module générique iwlagn). Ceci est seulement apporté ici à titre d'information, car cela n'affecte pas (ou ne devrait pas affecter) le fonctionnement de LMT.\n\nIl y a un problème connu avec certains chipsets fonctionnant avec le module iwlagn (à savoir, le chipset 5300, et peut-être d'autres). Sur ces chipsets, les paramètres suivants de /etc/laptop-mode/conf.d/wireless-iwl-power.conf :\n\n```\nIWL_AC_POWER\nIWL_BATT_POWER\n```\n\nsont ignorés, car le fichier /sys/class/net/wlan*/device/power_level n'existe pas. À la place, la méthode standard (avec iwconfig wlan0 power on/off) est automatiquement utilisée.\n\n"
    },
    {
      "title": "AC97",
      "level": 4,
      "content": "```\n# ac97-powersave.conf\n# Exemple pour ThinkPad T40/T42/T60\n#\nDEBUG=0\nCONTROL_AC97_POWER=1\n```\n\n"
    },
    {
      "title": "Intel HDA",
      "level": 4,
      "content": "```\n# intel-hda-powersave.conf\n# Exemple pour ThinkPad T40/T42/T60\n#\nDEBUG=0\nCONTROL_INTEL_HDA_POWER=1\nBATT_INTEL_HDA_POWERSAVE=1\nLM_AC_INTEL_HDA_POWERSAVE=1\nNOLM_AC_INTEL_HDA_POWERSAVE=0\nINTEL_HDA_DEVICE_TIMEOUT=10\nINTEL_HDA_DEVICE_CONTROLLER=0\n```\n\n"
    },
    {
      "title": "Laptop-mode-tools ne détecte pas les événements",
      "level": 3,
      "content": "Installez acpid et activez acpid.service.\n\nSi cela n'aide pas, parcourez les fichiers de configuration de laptop-mode et assurez-vous que le service que vous souhaitez activer est défini sur 1. De nombreux services (y compris le contrôle de cpufreq) sont réglés par défaut sur \"auto\", ce qui peut ne pas les activer.\n\nDes problèmes avec le bluetooth qui ne fonctionne pas lors d'un démarrage sur batterie sont résolu en désactivant runtime-pm.\n\n"
    },
    {
      "title": "Souris USB en veille après 5 secondes sur batterie",
      "level": 3,
      "content": "Trouvez d'abord l'ID de votre périphérique (il devrait ressembler à 046d:c534) :\n\n```\n$ lsusb\n```\n\nMettez cette valeur dans la variable AUTOSUSPEND_DEVID_BLACKLIST dans /etc/laptop-mode/conf.d/runtime-pm.conf, par exemple :\n\n```\n/etc/laptop-mode/conf.d/runtime-pm.conf\n```\n\n```\n...\nAUTOSUSPEND_DEVID_BLACKLIST=\"046d:c534\"\n...\n```\n\nLes ID multiples peuvent être séparés par des espaces.\n\n"
    },
    {
      "title": "KDE affiche un écran noir",
      "level": 4,
      "content": "Lorsque le mode ordinateur portable est activé, KDE ne démarre pas. La raison en est que le gestionnaire d'affichage par défaut de KDE (SDDM) démarre avant le pilote NVIDIA. Pour éviter cela, vous devez supprimer nomodeset des paramètres du noyau.\n\n"
    },
    {
      "title": "Démarrage plus lent après avoir activé laptop-mode.service",
      "level": 4,
      "content": "Comme décrit précédemment, laptop-mode-tools affecte le pilote NVIDIA. L'ajout de nvidia-drm.modeset=1 aux paramètres du noyau réduit considérablement le temps de démarrage.\n\n"
    },
    {
      "title": "Consulter aussi",
      "level": 2,
      "content": "- wiki Laptop Mode Tools\n- FAQ\n- Mailing List\n\n"
    }
  ]
}