{
  "title": "Lemonbar (Polski)",
  "url": "https://wiki.archlinux.org/title/Lemonbar_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "lemonbar to lekki pasek o niskim zużyciu pamięci oparty na XCB. Posiada możliwości modyfikacji koloru pierwszoplanowego (czcionki), zmiany koloru tła, wyrównania tekstu oraz w pełni wspiera kodowanie UTF-8.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiet lemonbar-gitAUR.\n\n"
    },
    {
      "title": "Konfiguracja",
      "level": 2,
      "content": "Lemonbar jest w pełni konfigurowany za pomocą poleceń w stylu screenrc i opcji linii komend. W starszych wersjach programu wymagało to edycji plików przed kompilacją.\n\nNa stronie man programu dostępny jest krótki przegląd opcji konfiguracji.\n\n"
    },
    {
      "title": "Użycie",
      "level": 2,
      "content": "lemonbar nie wypisuje żadnych informacji sam z siebie. Żeby uzyskać w nim tekst trzeba stworzyć potok (pipe). Poniższy przykład wypisze \"Witaj Świecie!\" w terminalu, aby wyświetlić komunikat na pasku uruchom /droga/do/przykładu.sh | lemonbar.\n\n```\n#!/bin/bash\n\n# Wypisanie tekstu\necho \"Witaj Świecie!\"\n```\n\nJeżeli chcesz, żeby tekst w lemonbarze był aktualizowany przez skrypt, musisz dodać opcję -p (n.p.: /droga/do/przykładu.sh | lemonbar -p). Zapobiega to wyłączaniu lemonbara po tym, jak standardowe wyjście zostaje zamknięte.\n\n"
    },
    {
      "title": "Kolory",
      "level": 3,
      "content": "lemonbar używa poniższych komend, żeby kolorować tekst, tło i pod/nadkreślenie. Kolory mogą być ustalone za pomocą formatów #RRGGBB, #AARRGGBB (z kanałem alfa; kompozytor musi być włączony), lub #RGB.\n\nSpecjalny kolor - wskazuje na kolor domyślny (który jest ustawiany za pomocą opcji linii komend; domyślnie biały tekst na czarnym tle).\n\nTable content:\nKomenda | Znaczenie\n%{Fkolor} | Użyj kolor jako kolor czcionki/pierwszoplanowy\n%{Bkolor} | Użyj kolor jako kolor tła\n%{Ukolor} | Użyj kolor jako kolor pod/nadkreślenia tekstu\n\n"
    },
    {
      "title": "Wyrównanie tekstu",
      "level": 3,
      "content": "lemonbar wspiera wyrównywanie tekstu, używając poniższych komend.\n\nTable content:\nKomenda | Znaczenie\n%{l} | Wyrównuje tekst to lewej\n%{c} | Centruje tekst\n%{r} | Wyrównuje tekst do prawej\n\n"
    },
    {
      "title": "Przykłady",
      "level": 3,
      "content": "Poniższy przykład wypisuje datę i czas na środku paska, używając żółtego koloru czcionki oraz niebieskiego koloru tła.\n\n%{F-} i %{B-} przywracają odpowiednio kolor czcionki i tła do ustawień domyślnych.\n\n```\nprzykład.sh\n```\n\n```\n#!/usr/bin/bash\n\n# Definiowanie Zegara\nClock() {\n        DATETIME=$(date \"+%a %b %d, %T\")\n\n        echo -n \"$DATETIME\"\n}\n\n# Wypisanie Zegara\nwhile true; do\n        echo \"%{c}%{F#FFFF00}%{B#0000FF} $(Clock) %{F-}%{B-}\"\n        sleep 1\ndone\n```\n\nKolejny przykład pokazuje poziom naładowania baterii. Do użycia tego skryptu wymagana jest instalacja acpi.\n\n```\nprzykład.sh\n```\n\n```\n#!/usr/bin/bash\n\n#Definiowanie baterii\nBattery() {\n        BATPERC=$(acpi --battery | cut -d, -f2)\n        echo \"$BATPERC\"\n}\n\n# Wypisywanie stanu naładowania\nwhile true; do\n        echo \"%{r}$(Battery)\"\n        sleep 1;\ndone\n```\n\n"
    },
    {
      "title": "Czcionki XFT",
      "level": 3,
      "content": "Domyślna wersja lemonbara nie wspiera czcionek XFT. Aby skorzystać z czcionek XFT, należy zainstalować pakiet lemonbar-xft-gitAUR, który zastępuje lemonbar-gitAUR.\n\nJeśli chcesz użyć innej czcionki w lemonbarze, dodaj opcję -f do polecenia (n.p. lemonbar -f \"Roboto Medium\").\n\n"
    },
    {
      "title": "Ikony Font Awesome",
      "level": 4,
      "content": "Ze wsparciem XFT, możesz dodać ikony font-awesome do swojego paska. Przed użyciem ikon zainstaluj ttf-font-awesome i dodaj opcję -f \"Font Awesome\" do polecenia. Należy pamiętać, że jeśli chcesz użyć innych znaków, niż tych z Font Awesome, musisz również dodać inną czcionkę, na przykład -f \"Roboto Medium\".\n\nZanim dodasz ikonę do swojego paska lemonbar, sprawdź jej identyfikator Unicode na liście Font Awesome. Następnie użyj tego identyfikatora jako tekstu. Poniżej pokazany jest skrypt, który wypisuje ikonę z identyfikatorem f242.\n\n```\nfontawesome.sh\n```\n\n```\n#!/usr/bin/bash\necho -e \"\\uf242 Battery: 0\"\n```\n\nZwróć uwagę na flagę -e w poleceniu echo. Jest ona niezbędna, aby poprawnie wyświetlić symbol.\n\nAby użyć powyższego skryptu z lemonbarem, wykonaj polecenie: lemonbar -f \"Roboto Medium\" -f \"Font Awesome\".\n\n"
    }
  ]
}