{
  "title": "Lenovo Yoga 7i Gen 8 (16IRL8)",
  "url": "https://wiki.archlinux.org/title/Lenovo_Yoga_7i_Gen_8_(16IRL8)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nGPU | 8086:a7a0 | Yes\nWireless | 8086:51f1 | Yes\nBluetooth | 8087:0033 | Yes\nStorage | 15b7:5016 | Yes\nAudio | 8086:51ca | Yes\nWebcam | 174f:181d | Yes\nMicro SD-Card Reader | 10ec:522a | Yes\nFingerprint Reader | 27c6:55b4 | Yes\nKeyboard |  | Yes\nTouchpad |  | Yes\nTouchscreen |  | Yes\nDigital Pen |  | Yes\nAccelerometer |  | Yes\nLid Switch |  | Yes\nTablet Mode Control Switch |  | Yes\n\nThe Lenovo Yoga 7i Gen 8, model 16IRL8, is an Intel powered 2-in-1 convertible laptop with a 16 inch display. It has been released in the first half of 2023.\n\nThe tested configuration (82YN004RGE) includes the Intel i7-1360P CPU, WD PC SN740 1TB SSD and a BOE 1600p panel.\n\n"
    },
    {
      "title": "UEFI menus",
      "level": 3,
      "content": "Press F2 to access the UEFI firmware settings and F12 for the boot menu.\n\n"
    },
    {
      "title": "Options",
      "level": 3,
      "content": "Additionally to typical options (Secure Boot, Storage Control Mode, Hyperthreading, Virtualization, Always on USB, WLAN, ...) it is also possible to change the thermal control mode (battery saving, intelligent cooling, extreme performance) through the UEFI settings. 'Flip to Start' can be activated/deactivated as well, which turns the PC on when the lid is opened, like a power button press would do.\n\n"
    },
    {
      "title": "Updates",
      "level": 3,
      "content": "The webcam, SPI controller, system and UEFI firmware, TPM and SSD are displayed updatable in fwupd. However, this has not been tested.\n\n"
    },
    {
      "title": "Drivers",
      "level": 3,
      "content": "Install the mesa package for the Intel graphics driver. Install intel-media-driver for hardware accelerated decoding.\n\n"
    },
    {
      "title": "Issues",
      "level": 3,
      "content": "With the 1600p display version, there was noticeable screen tearing with X11. Switching to Wayland solved this issue.\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "Install sof-firmware for audio drivers.\n\nIssues with speakers and the microphone are fixed since Kernel version 6.6.\n\n"
    },
    {
      "title": "Keyboard",
      "level": 3,
      "content": "The keyboard and function keys work out of the box. A list of function keys can be found in Lenovo Yoga 7i#Function keys .\n\n"
    },
    {
      "title": "Pen",
      "level": 3,
      "content": "The Lenovo Digital Pen 2 works as expected. You can remap the pen buttons using xinput (X11) or evsieveAUR (Wayland).\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 3,
      "content": "Experimental support for the fingerprint reader can be enabled using the approach in Lenovo Yoga 7i#Fingerprint reader.\n\n"
    },
    {
      "title": "Tablet Mode",
      "level": 2,
      "content": "The accelerometer and tablet mode switch are supported through iio-sensor-proxy. This enables both screen rotation detection as well as tablet mode. Make sure your desktop environment supports these features, see Tablet PC#Rotation.\n\n"
    },
    {
      "title": "Webcam",
      "level": 2,
      "content": "The webcam works out of the box.\n\nThe IR camera is recognized as a secondary webcam. However, by default the IR emitter does not activate, use linux-enable-ir-emitterAUR to configure the driver correctly to make authentication using howdy possible. Just follow the steps on GitHub.\n\n"
    },
    {
      "title": "Power saving mode",
      "level": 3,
      "content": "power-profiles-daemon supports the laptop's power saving modes.\n\n"
    },
    {
      "title": "Sleep modes",
      "level": 3,
      "content": "S2 deep sleep mode works by default without issues. In consumes around 0.2W in this mode, which is equivalent to around 0.3% of battery capacity per hour.\n\nWorkarounds to enable S3 sleep, like in Lenovo Yoga 7i#Activating S3 sleep, have not been tested.\n\n"
    },
    {
      "title": "Battery conservation mode",
      "level": 3,
      "content": "See Laptop/Lenovo#Battery conservation mode\n\n"
    },
    {
      "title": "Fan speed",
      "level": 3,
      "content": "Fan speed settings are controlled by the BIOS and are not available through lm_sensors. However, in the UEFI firmware settings menu three different modes can be selected (battery saving, intelligent cooling, extreme performance).\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Lenovo Yoga 7i\n- Laptop/Lenovo\n\n"
    }
  ]
}