{
  "title": "Lenovo ThinkPad P43s",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_P43s",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nGPU (Intel) |  | Yes\nGPU (Nvidia) |  | Yes\nWireless |  | Yes\nAudio |  | Yes\nTrackPoint |  | Yes\nTouchpad |  | Yes\nWebcam |  | Yes\nBluetooth |  | Yes\nMobile broadband |  | Untested\nFingerprint sensor |  | No\nMicroSD reader |  | Yes\n\n"
    },
    {
      "title": "Graphics",
      "level": 2,
      "content": "This laptop has its external display ports directly wired to the NVIDIA chip. In loose terms this means that the dedicated GPU must be enabled in order for external displays to be used. Luckily, it is possible to do dynamic switching between the integrated and dedicated graphics, but this is only possible by using the Intel DDX driver xf86-video-intel as opposed to modesetting.\n\nThe laptop can be used in one of two modes: Hybrid Graphics, or Dedicated Graphics only.\n\nIn order to use the integrated Intel UHD 630 GPU (as part of Hybrid Graphics) you need to add the i915 module to your initramfs by adding it as a module in your mkinitcpio. This is done by setting the following on /etc/mkinitcpio.conf:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\n...\nMODULES=(i915)\n```\n\nFailure to add the above will leave you stuck when trying to load the initramfs and your system will not be able to boot.\n\nIt might be possible to make do without the module above by using the Dedicated Graphics only (this can be done by changing the setting in UEFI).\n\n"
    },
    {
      "title": "Proprietary driver with bumblebee",
      "level": 3,
      "content": "With this setup the integrated GPU is used by default but some applications can be rendered on the discrete GPU with the optirun or primusrun launchers. See Bumblebee for detailed instructions. The lack of proper v-sync support means that with this method applications rendered on the discrete GPU exhibit tearing. There is also some overhead introduced as a result of moving data inefficiently between the discrete and integrated GPUs, but the Nvidia GPU performs much better than it does with Nouveau.\n\nTo get this working you will need bumblebee, bbswitch, nvidia and xf86-video-intel.\n\nThen set the following configuration files.\n\n```\n/etc/X11/xorg.conf.d/intel.conf\n```\n\n```\nSection \"ServerLayout\"\n    Identifier     \"Layout0\"\n    Screen      0  \"intel\"\n    Inactive       \"nvidia\"\nEndSection\n\nSection \"Monitor\"\n    Identifier     \"Monitor0\"\n    Option         \"DPMS\"\nEndSection\n\nSection \"Device\"\n    Identifier     \"nvidia\"\n    Driver         \"dummy\"\n    BusID          \"PCI:1:0:0\"\nEndSection\n\nSection \"Screen\"\n    Identifier     \"nvidia\"\n    Device         \"nvidia\"\nEndSection\n\nSection \"Screen\"\n    Identifier     \"intel\"\n    Device         \"intel\"\n    Monitor        \"Monitor0\"\nEndSection\n\nSection \"Device\"\n    Identifier  \"intel\"\n    Driver      \"intel\"\n    Option      \"TearFree\" \"true\"\n    Option      \"DRI\" \"3\"\n    BusId       \"PCI:0:2:0\"\nEndSection\n```\n\nYou probably already have one of these so adjust/add as needed - the dummy device at the end is essential:\n\n```\n/etc/bumblebee/xorg.conf.nvidia\n```\n\n```\nSection \"ServerLayout\"\n    Identifier  \"Layout0\"\n    Option      \"AutoAddDevices\" \"false\"\n    Option      \"AutoAddGPU\" \"false\"\n\n    # Inventions\n    Screen      0 \"nvidia\"\n    Inactive    \"intel\"\nEndSection\n\nSection \"Device\"\n    Identifier  \"DiscreteNvidia\"\n    Driver      \"nvidia\"\n    VendorName  \"NVIDIA Corporation\"\n    BusID \"PCI:1:0:0\"\n    Option \"ProbeAllGpus\" \"false\"\n\n    Option \"NoLogo\" \"true\"\n    Option \"UseEDID\" \"true\"\n    Option \"AllowEmptyInitialConfiguration\"\nEndSection\n\nSection \"Device\"\n    Identifier \"intel\"\n    Driver \"dummy\"\n    BusID \"PCI:0:2:0\"\nEndSection\n\nSection \"Screen\"\n    Identifier \"nvidia\"\n    Device \"nvidia\"\nEndSection\n```\n\nAt this stage, restart your machine. Then you should be able to run applications on the GPU as you normally would with optirun, e.g., optirun glxgears. If you want to use the external displays you need to keep your GPU on by running a task on optirun and then running intel-virtual-output -f (this will stay running and binds the external display ports to virtual outputs that you can use). At this stage you should be able to see and use the external ports.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "Most FN keys should work out of the box, but if it does not, bind mentioned keys to below commands:\n\n- F1 button: amixer set Master toggle.\n- F2 button: amixer set Master 5%-.\n- F3 button: amixer set Master 5%+.\n- F4 button: amixer set Capture toggle.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 2,
      "content": "Touchpad is problematic. By default, if you hold the thumb over the button area, the pointer will not move. Once the system is installed, the problem disappears when using KDE, while GNOME still exhibits the issue. In GNOME, use the following to fix the problem:\n\n```\n$ xinput set-prop 'SynPS/2 Synaptics TouchPad' 'libinput Click Method Enabled' 1 0\n```\n\nEven after doing this, the mouse pointer still jumps around when clicking the button sometimes.\n\n"
    },
    {
      "title": "Fingerprint sensor",
      "level": 2,
      "content": "The fingerprint sensor works with some recent firmware and software updates (2019-12-15). Driver development info: [1].\n\nUse fwupd to install the latest firmware for \"Synaptics Prometheus Fingerprint Reader\". The update might have to be done manually as the released firmware is in testing; or you could enable the testing remote in fwupd to allow automated upgrade. The relevant firmwares are Prometheus Fingerprint Reader and Prometheus Fingerprint Reader Configuration.\n\nfprint has more details on how to setup the fingerprint for PAM authentication for example.\n\n"
    },
    {
      "title": "CPU throttling issue",
      "level": 3,
      "content": "With the BIOS Version 1.52 (this problem is known to occur on 1.52, it might still happen on other versions too), the CPU tends to throttle down to 400 MHz earlier than it should. In particular, this can be seen when using Bumblebee.\n\nAfter installing BIOS Version 1.54, this problem is fixed.\n\n"
    },
    {
      "title": "Speaker noise issue",
      "level": 3,
      "content": "The speaker on the Lenovo Thinkpad T490 may have a high static hissing noise, which does not change if you lower the volume, but stops if you mute the speaker or use the headphone jack. This problem cannot be fixed completely as of now. Updating to the most current BIOS version will make the speaker silent while it is not playing anything without you having to mute it all the time. But as soon as the user is playing sound, the noise will be back, clearly audible in the background.\n\nCheck the Lenovo Support Website for the newest BIOS Version.\n\n"
    },
    {
      "title": "MicroSD card reader issue",
      "level": 3,
      "content": "The MicroSD card reader works with the arch kernel 5.3.11-arch1-1. There have been issues with previous kernel versions.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 3,
      "content": "Works well with wireless headphones: no issues pairing or connecting with Blueman and PulseAudio.\n\n"
    },
    {
      "title": "Slow wakeup after suspend",
      "level": 3,
      "content": "After suspend the laptop takes a few second until it becomes responsive. Disallowing the access to the WWAN device in the BIOS solves this issue.\n\n"
    },
    {
      "title": "ACPI",
      "level": 2,
      "content": "The default /etc/acpi/handler.sh script has a check for the device that looks like this:\n\n```\n/etc/acpi/handler.sh\n```\n\n```\nac_adapter)\n        case \"$2\" in\n            AC|ACAD|ADP0)\n```\n\nThis will not work, since the T490 device is called ACPI0003 which is not matched by the above check. The instructions in Acpid does mention a pattern that does work and it is recommended to use this instead.\n\n"
    },
    {
      "title": "See Also",
      "level": 2,
      "content": "- Lenovo Forums: A throttling fix is being investigated by Lenovo.\n\n"
    }
  ]
}