{
  "title": "Lenovo Yoga Slim 7 Pro AMD (14ACH5) (Русский)",
  "url": "https://wiki.archlinux.org/title/Lenovo_Yoga_Slim_7_Pro_AMD_(14ACH5)_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nЖелезо | PCI/USB ID | Работает?\nТачпад | PS/2 | Да\nКлавиатура |  | Да\nGPU | 1002:1638 | Да\nВебкамера | 13d3:5419 | Да\nBluetooth | 0489:e0cd | Да\nАудио | 1022:15e3 | Да\nWireless | 14c3:7961 | Да\nTPM |  | Не проверено\n\nЭтот ноутбук поставляется в моделях O или D:\n\nO = Встроенная графика Vega (Onboard)\n\nD = Встроенная графика + выделенный графический процессор NVIDIA MX450 2GB (Dedicated)\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Для установки необходимо отключить Secure Boot в UEFI. Вы можете войти в него, нажав F2 (или Fn+F2) во время загрузки. Для доступа к меню загрузки, позволяющему выбрать нестандартное загрузочное устройство (например, USB-устройства), нажмите F12 (или Fn+F12) во время загрузки.\n\n"
    },
    {
      "title": "Прошивка",
      "level": 2,
      "content": "Хотя известно, что Lenovo поддерживает fwupd в целом, для Yoga Slim 7 он еще не добавлен.\n\n"
    },
    {
      "title": "UEFI",
      "level": 3,
      "content": "Доступ к UEFI можно получить при загрузке, нажав F2, доступны минимальные опции.\n\nОбновления в настоящее время предоставляются Lenovo в виде двоичных файлов Windows.\n\n"
    },
    {
      "title": "Дисплей",
      "level": 2,
      "content": "Ноутбук поставляется с опциональным глянцевым дисплеем 2800x1800 90hz: рекомендуемые настройки для GNOME - 200% масштаб и 85% масштаб шрифта, масштабирование KDE достаточно настраиваемо, чтобы справиться с разрешением.\n\nДля получения более подробной информации смотрите HiDPI.\n\n"
    },
    {
      "title": "Графика",
      "level": 2,
      "content": "Встроенная графика Vega достойная, в модели D выделенная графика NVIDIA может быть отключена в BIOS в настройках \"UMA Graphics\".\n\nПри использовании выделенной графики NVIDIA рекомендуется отключать чип, когда он не используется, с помощью одного из решений NVIDIA Optimus.\n\n"
    },
    {
      "title": "Сон",
      "level": 3,
      "content": "s0ix - единственное поддерживаемое состояние сна, оно хорошо работает в ядре 5.16 и выше, хотя наблюдается небольшой разряд, когда машина находится в режиме сна.\n\n"
    },
    {
      "title": "Гибернация",
      "level": 3,
      "content": "Не протестировано, хотя гибернация должна работать на ядрах 5.16 и выше.\n\n"
    },
    {
      "title": "Экономия батареи",
      "level": 3,
      "content": "Используя GNOME, можно изменить профиль экономии батареи, что отражено в UEFI:\n\n- Battery Life - Battery Saver\n- Balanced - Интеллектуальное охлаждение\n- Высокая производительность - Производительность\n\nДля экономии батареи рекомендуется установить TLP.\n\nЭтот ноутбук поддерживает драйвер частоты amd_pstate, см. Управление частотой процессора, когда amd_pstate активирован, ядра могут работать на частоте до 400 МГц, снижая расход батареи в режиме простоя.\n\nМожно добавить пользовательское разрешение 2880x1800 с частотой 60 Гц, чтобы уменьшить расход батареи, вызванный работой дисплея на частоте 90 Гц.\n\n- При работе в режиме сбалансированного питания от сети переменного тока вентилятор машины будет часто вращаться.\n- Режим экономии заряда батареи и режим быстрой зарядки можно включить из Windows с помощью программы Lenovo Vantage. Он останется включенным после загрузки Linux.\n\n"
    }
  ]
}