{
  "title": "Lenovo ThinkPad X201 (Polski)",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_X201_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **The translation of this article or section does not reflect the original text.** The translation of this article or section does not reflect the original text.\n\nThe translation of this article or section does not reflect the original text.\n\nLenovo ThinkPad X201 jest 2 rdzeniowym (4 wątkowym) subnotebookiem produkowanym przez Lenovo. Aby dowiedzieć się więcej na jego temat sprawdź: Thinkwiki\n\nArch działa świetnie na tym laptopie, jednak w pewnych przypadkach (np. ze względu na różne podzespoły stosowane w tym modelu) wymaga kilku interwencji użytkownika.\n\n"
    },
    {
      "title": "Grafika",
      "level": 2,
      "content": "Ze względu na to, że laptop ten występuje tylko ze zintegrowanym układem graficznym firmy Intel, Xorg najczęściej sam ładuje właściwy sterownik, bez żadnej dodatkowej konfiguracji. Jednak w przypadku problemów z wyświetlaniem, w dziale Intel znajdziesz wszystkie potrzebne do rozwiązania problemów informacje.\n\nOd wydania Mesy 9.0, na mobilnych układach o nazwie kodowej \"Iron Lake\" czasami mogą wystąpić problemy z wyświetlaniem grafiki, bądź nagłym zawieszeniem pulpitu. Angielskie źródła mówią o zawieszaniu się systemów, które do odzyskania sprawności, mogą wymagać nawet restartu systemu. W przypadku X201 problem ten występuje po hibernacji i jedynie przy menadżerze logowania GDM. Zabicie procesu GDM z innego terminala przywraca poprawne działanie systemu.\n\n"
    },
    {
      "title": "Hibernation",
      "level": 2,
      "content": "Po zainstalowaniu i konfiguracji pakietu pm-utilsAUR hibernacja i usypianie odbywa się bezproblemowo.\n\n"
    },
    {
      "title": "Zmiana częstotliwości pracy procesora",
      "level": 3,
      "content": "Po zainstalowaniu cpupower i uruchomieniu usługi procesor sam dostosowuje częstotliwość pracy, TurboCore również działa prawidłowo.\n\n"
    },
    {
      "title": "Zmniejszanie napięcia procesora",
      "level": 3,
      "content": "W procesorach serii Core ix nie jest możliwa programowa ingerencja w napięcie procesora.\n\n"
    },
    {
      "title": "Modem 3G",
      "level": 3,
      "content": "Modem 3G jest jedyną właściwie rzeczą, która w X201 nie działa zaraz po instalacji. Większość dystrybucji ma duży problem z jego obsługą. W tym laptopie występuje oficjalnie tylko jeden model modemu 3G, jest nim Qualcomm Gobi 2000. Przede wszystkim w tej chwili nie spotkałem się z działającą konfiguracją wvdial, ale jest i dobra informacja, modem na Archu świetnie działa w trybie graficznym!\n\nDo prawidłowego działania i wykrywania modemu potrzebujemy menadżer sieci networkmanager oraz modemmanager. Po zainstalowaniu oprogramowania z oficjalnego repozytorium wykonujemy:\n\n```\nsystemctl enable NetworkManager modemmanager\n```\n\nNastępnie pobieramy i instalujemy gobi-loaderAUR. Kolejnym krokiem jest pobranie sterowników pod Windows 7 ze strony producenta: ((https://support.lenovo.com/us/en/downloads/migr-72938)) Najlepszą metodą jest zainstalowanie pakietu za pomocą wine, ponieważ spowoduje to wypakowanie potrzebnych nam elementów Teraz Koniecznie wchodzimy na konto root za pomocą su i tworzymy katalog:\n\n```\nmkdir /usr/lib/firmware/gobi\n```\n\nBędąc na koncie root musimy skopiować 3 pliki, modemy montowane w X201 nie są brandowane, potrzebujemy więc skopiować do utworzonego katalogu plik:\n\n- amss.mbn i apps.mbn z katalogu\n\n```\n./.wine/drive_c/Program\\ Files\\ \\(x86\\)/QUALCOMM/Images/Lenovo/UMTS/\n```\n\n- UQCN.mbn z katalogu\n\n```\n./.wine/drive_c/Program\\ Files\\ \\(x86\\)/QUALCOMM/Images/Lenovo/2/\n```\n\nNastępnie uruchamiamy komputer ponownie, zaraz po tym w NetworkManagerze modem powinien zostać bez większych problemów wykryty, jeżeli tak się nie stało, wykonaj\n\n```\nrmmod qcserial\n```\n\na następnie\n\n```\nmodprobe qcserial\n```\n\ni odczekaj chwile.\n\n"
    }
  ]
}