{
  "title": "Lenovo ThinkPad X1 Carbon (Gen 10)",
  "url": "https://wiki.archlinux.org/title/Lenovo_ThinkPad_X1_Carbon_(Gen_10)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Table content:\nHardware | PCI/USB ID | Working?\nVideo | 8086:46a6 | Yes\nWireless | 8086:51f0 | Yes\nMobile broadband | 8086:75602c7c:0127 1cf8:3502 | Yes\nAudio | 8086:51c8 | Yes\nTouchPad | 06cb:00fc | Yes\nTrackPoint | 06cb:00fc | Yes\nWebcam | 06cb:0052 | Partial\nFingerprint reader |  | Yes\nBluetooth |  | Yes\nNFC |  | Untested\nTouchscreen |  | Yes\n\n"
    },
    {
      "title": "Audio",
      "level": 2,
      "content": "This laptop requires Sound Open Firmware in order for the soundcard to work.\n\n"
    },
    {
      "title": "Video",
      "level": 2,
      "content": "See Lenovo ThinkPad X1 Carbon (Gen 9)#Video\n\n"
    },
    {
      "title": "Fingerprint reader",
      "level": 2,
      "content": "The fingerprint reader works out of the box using fprintd. See Fprint.\n\n"
    },
    {
      "title": "Camera",
      "level": 2,
      "content": "The Gen10 Carbon X1 can be configured with one of two webcam setups:\n\n- FHD 1080p camera - tested and works;\n- MIPI \"Computer Vision\" - does not work, see this thread on the Lenovo Forums.\n\n"
    },
    {
      "title": "Mobile broadband",
      "level": 2,
      "content": "The Fibocom L860, Fibocom FM350-GL, and Quectel EM05-CE WWAN chips are currently available for this laptop. The Quectel EM05-CE chip should be operable out of the box on Linux. Use of the Fibocom L860 chip requires installing the external FCC unlocking tool, which is available with the thinkpad-l860-gl-fcc-unlock-binAUR package. Do note that the unlocking tool does not work in the US yet, however it has been promised that support for US sim cards will be available soon. FCC unlocking for the Fibocom FM350-GL is available for non-US customers [1].\n\nAfter installing thinkpad-l860-gl-fcc-unlock-binAUR, enable the lenovo-cfgservice.service. The package also includes a modemmanager hook that will allow ModemManager to unlock the modem when appropriate.\n\nSome users report that the Fibocom L860 LTE modem does not work correctly with its factory firmware version, 18601.5001.00.01.01.32_GC. Firmware version can be checked by inspecting the output of mmcli -m [modem index]. When running the firmware version mentioned above, it is possible to connect to an LTE bearer but the exposed wwan0 interface might not be able to get an IP address. Upgrading to the latest firmware, 18601.5001.00.01.17.09_GC at the time of writing, fixes this issue. Unfortunately, this modem cannot be upgraded using using fwupd, so again at the time of writing, the only solution is to do so from a Windows installation using Windows Update.\n\n"
    },
    {
      "title": "Powersaving",
      "level": 2,
      "content": "This laptop works nearly out of the box with tlp; however, the WWAN chip currently has issues with runtime power management and will prevent booting if runtime-pm is enabled for the device. To exclude it, modify the tlp configuration like:\n\n```\n/etc/tlp.conf\n```\n\n```\nRUNTIME_PM_DENYLIST=\"08:00.0\"\n```\n\n"
    },
    {
      "title": "Performance modes",
      "level": 3,
      "content": "Lenovo supports 'platform-profiles' on newer kernels which can rather dramatically improve performance by decreasing throttling, or greatly improve battery life and thermals by lowering the CPU's power limit. These modes can result in over a 100% increase or decrease in CPU power draw. The default mode is \"balanced\" however users can switch between these modes using the following keyboard shortcuts:\n\n- Fn+l - Low-power mode\n- Fn+m - Balanced mode (aka Medium)\n- Fn+h - Performance mode (aka High)\n\nThese modes can also be selected automatically by using tlp and the PLATFORM_PROFILE_ON_AC/BAT configuration fields.\n\nThe currently active mode can be checked with the following command:\n\n```\n# cat /sys/firmware/acpi/platform_profile\n```\n\n"
    },
    {
      "title": "Intel GPU power saving",
      "level": 3,
      "content": "The i915 kernel module is used for the Alderlake iGPU. This supports various power saving measures such as frame buffer compression, panel self refresh. Some of these may have been enabled by default internally within the driver, but can also be manually set using kernel command line arguments.\n\n- Frame Buffer Compression can be enabled by setting enable_fbc=1. This seems to work fine.\n- Panel Self Refresh can be enabled by setting enable_psr=1 or enable_psr=2. enable_psr=2 seems to work fine.\n- Display controller power management: enable_dc=4 . Seems to work fine.\n\nBoth settings tested on 1260p with Linux 6.7 kernel.\n\n"
    },
    {
      "title": "Firmware",
      "level": 2,
      "content": "UEFI firmware and other device firmware is available through the Linux Vendor Firmware Service (LVFS), and can be installed using fwupd. Updates to the UEFI firmware include updates to the Intel Management Engine, so they may fail altogether if IME is disabled on the UEFI settings. A workaround for this is to temporarily enable IME, upgrade the firmware with fwupd, and disable IME after that.\n\nSecure boot works out of the box with custom keys from multiple tools, including sbctl.\n\n"
    },
    {
      "title": "Function keys",
      "level": 2,
      "content": "In the firmware configuration it is possible to swap the Ctrl and Fn keys.\n\nSome of the function keys have keycodes with values that are too high to use in X, which truncates values past 248. In Wayland, these keys might be difficult to map but can be doable manually using the in your desktop environment by specifying the XF86 keysym by hand from the table below. For example, in Gnome you can use dconf-editor to modify entries in /org/gnome/settings-daemon/plugins/media-keys/ and other settings locations.\n\nTable content:\nKey | Visible?1 | Marked?2 | Effect\nFn+Esc | No | Yes | Toggles Fn lock\nFn+F1 | Yes | Yes | XF86AudioMute\nFn+F2 | Yes | Yes | XF86AudioLowerVolume\nFn+F3 | Yes | Yes | XF86AudioRaiseVolume\nFn+F4 | Yes | Yes | XF86AudioMicMute\nFn+F5 | Yes | Yes | XF86MonBrightnessDown\nFn+F6 | Yes | Yes | XF86MonBrightnessUp\nFn+F7 | Yes | Yes | XF86Display\nFn+F8 | Yes | Yes | XF86WLAN\nFn+F9 | Wayland-only | Yes | XF86NotificationCenter\nFn+F10 | Wayland-only | Yes | XF86PickupPhone\nFn+F11 | Wayland-only | Yes | XF86HangupPhone\nFn+F12 | Yes | Yes | XF86Favorites\nFn+PrtSc | Wayland-only | Yes | XF86SelectiveScreenshot\nFn+Space | Yes | Yes | XF86SelectiveScreenshot\nFn+4 | Yes | No | XF86Sleep\nFn+Left | Yes | No | Home\nFn+Right | Yes | No | End\nFn+l | No | No | Switch to low power mode\nFn+m | No | No | Switch to balanced/medium power mode\nFn+h | No | No | Switch to performance/high power mode\n\n1. The key is visible to xev and similar tools. Wayland-only indicates the code can only be seen from a Wayland session.\n1. The physical key has a symbol on it, which describes its function.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 2,
      "content": "This laptop features a UEFI interface that is driven with a mouse or touchscreen; however, this interface can be disabled in favor of a traditional keyboard interface which is more accessible to use. Blind users might need to request help from a sighted person in order to make this change initially, but once changed the interface is far more easily navigable.\n\nThe boot device can be changed out of the box without needing to access the UEFI menu during boot by hitting F12, though the menu is initially on a 10 second timer so it might be necessary to input an UP or DOWN after the menu loads if the user is using a screen reader or something else which might take time in order to provide the user feedback on which option to select.\n\n"
    }
  ]
}