{
  "title": "Libreoffice (Italiano)",
  "url": "https://wiki.archlinux.org/title/Libreoffice_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Apache OpenOffice\n\nFrom LibreOffice website:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install one of the following packages:\n\n- libreoffice-still is the stable maintenance branch with relatively rare updates, for conservative users.\n- libreoffice-fresh is the feature branch, with new program enhancements for early adopters or power users.\n\n- In the past, the installation of at least 1 language pack was required. Currently, LibreOffice detects your system defaults and sets as locale setting; manual installation of a language pack is no longer needed, except to add additional languages. See help.libreoffice.org for additional information.\n- The British English language pack (libreoffice-fresh-en-gb) should not be confused with the pack for Ukrainian (libreoffice-fresh-uk) or Breton (libreoffice-fresh-br).\n- For the SDK install libreoffice-fresh-sdk.\n\nCheck the optional dependencies pacman displays. If you use HSQLDB Embedded in LibreOffice Base, you must install a Java Runtime Environment. You may need hsqldb2-javaAUR to use some modules in LibreOffice Base.\n\n"
    },
    {
      "title": "Theme",
      "level": 2,
      "content": "LibreOffice includes support for GTK and Qt theme integration. See also Uniform look for Qt and GTK applications.\n\nLibreOffice will try to auto detect the most suitable VCL interface based on your desktop environment. To force the use of a certain VCL interface, e.g. \"gtk4\" set the environment variables SAL_USE_VCLPLUGIN=gtk4. For more user interface options see /etc/profile.d/libreoffice-fresh.sh or /etc/profile.d/libreoffice-still.sh, where the variables are listed and can be uncommented.\n\n"
    },
    {
      "title": "Extension management",
      "level": 2,
      "content": "The following additional extensions are available:\n\n- libreoffice-extension-texmaths, which can create LaTeX mathematical equations (as PNG or SVG images) inside Writer, Impress, and Draw [2]\n- libreoffice-extension-writer2latex, which can convert Writer documents to LaTeX files [3]\n\nFor more extensions, check the AUR, the built-in LibreOffice Extension manager, or libreplanet.\n\n"
    },
    {
      "title": "Fonts",
      "level": 2,
      "content": "The Document Foundation wiki mentions various fonts that are packaged by default with LibreOffice on Windows and macOS. On Arch, the following packages may be installed for the fonts:\n\n- ttf-caladea\n- ttf-carlito\n- ttf-dejavu\n- ttf-gentium-basicAUR\n- ttf-liberation\n- ttf-linux-libertine-g\n- noto-fonts\n- adobe-source-code-pro-fonts\n- adobe-source-sans-fonts\n- adobe-source-serif-fonts\n\nAlso see Fonts#Font packages.\n\n"
    },
    {
      "title": "Spell checking",
      "level": 3,
      "content": "For spell checking, make sure hunspell and a language dictionary for it are installed. Then enable the Writing aids by selecting the check-box in Tools > Options > Language Settings > Writing Aids > Hunspell SpellChecker after restarting LibreOffice.\n\nUnlike other languages, Finnish spellchecking and grammar checking are based on Voikko. For LibreOffice voikko-libreofficeAUR should be installed.\n\nProject Orthos provides more complete Greek spell checkers as Libreoffice extensions. Package libreoffice-extension-orthos-greek-dictionaryAUR provides a Greek-only spelling dictionary, while libreoffice-extension-orthos-greek-english-dictionaryAUR provides one that bundles Greek and US English.\n\n"
    },
    {
      "title": "Bidirectional support",
      "level": 3,
      "content": "To enable Bidi support, select the check-box for Complex Text Layout (CTL) from: Tools > Options... > Languages and Locales > General > Default Languages for Documents, then choose the appropriate language. Language alignment can then be forced by RCtrl + RShift and LCtrl + LShift. There's a known issue that switches text direction when paragraph style changes.\n\n"
    },
    {
      "title": "Hyphenation rules",
      "level": 3,
      "content": "For hyphenation rules, you will need hyphen and a language hyphen rule set (hyphen-en for English, hyphen-de for German, etc).\n\n"
    },
    {
      "title": "Thesaurus",
      "level": 3,
      "content": "For the thesaurus option, you will need libmythes and a mythes language thesaurus (like mythes-en for English, mythes-de for German, etc).\n\nFor Greek, instead of mythes-elAUR you may want to try out libreoffice-extension-orthos-greek-thesaurusAUR, which includes more words.\n\n"
    },
    {
      "title": "Grammar checking with LanguageTool",
      "level": 3,
      "content": "For grammar checking, several tools are available. The most common is languagetool. Instructions on how to use it depend on which version of LibreOffice you have.\n\nSince version 7.4, LibreOffice supports LanguageTool natively, no extensions are needed:\n\n1. Click on Tools > Options... > Language and Locales > LanguageTool Server.\n1. Enable LanguageTool by selecting the check-box.\n1. The URL to use depends on whether you have a remote account (free or premium), or are running a local server: If you have a remote free account, use https://api.languagetool.org/v2. Leave the other two text fields blank. If you have a remote premium account, use https://api.languagetoolplus.com/v2 as \"Base URL\", write your email address, and type in the API key. If you have set up a local LanguageTool server, use http://localhost:8081/v2 as \"Base URL\". Leave User name and API Key empty.\n1. Click OK, and open a Writer document if one is not already open.\n1. Select the check-box Tools > Automatic Spell Checking.\n\n- If you have a remote free account, use https://api.languagetool.org/v2. Leave the other two text fields blank.\n- If you have a remote premium account, use https://api.languagetoolplus.com/v2 as \"Base URL\", write your email address, and type in the API key.\n- If you have set up a local LanguageTool server, use http://localhost:8081/v2 as \"Base URL\". Leave User name and API Key empty.\n\nSee LanguageTool page for more information.\n\n"
    },
    {
      "title": "Offline help",
      "level": 3,
      "content": "libreoffice-still and libreoffice-fresh provide the offline help files for en-US. Help files for different locales is provided by the appropriate libreoffice language package, (i.e., libreoffice-fresh-en-za provides the help files for en-ZA locales).\n\n"
    },
    {
      "title": "Speed up startup",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n- Disable startup logo: If you prefer to disable the startup logo screen with loading progress, open /etc/libreoffice/sofficerc, find the Logo= line and set it to Logo=0. Alternatively, use the --nologo CLI option.\n- Disable Java Runtime: If you are not using features that rely on Java, consider disabling the Java runtime. Go to Tools > Options > LibreOffice > Advanced and uncheck Use a Java runtime environment.\n- Turn off AutoSpellcheck: in Tools > Options > Language Settings > Writing Aids uncheck Check spelling as you type and Check grammar as you type.\n\n"
    },
    {
      "title": "Installing macros",
      "level": 3,
      "content": "If you intend to use macros, you must have a Java Runtime Environment enabled.\n\nThe default path for macros in Arch Linux is different from most Linux distributions. Its location is: ~/.config/libreoffice/4/user/Scripts/.\n\n"
    },
    {
      "title": "Base as a database frontend",
      "level": 3,
      "content": "Base can be used as a frontend to a database like PostgreSQL. It cannot edit the tables but It gives a very nice overview of the columns and rows of a table with the possibility of hiding columns for better overview of the relevant data. It can also filter the data and enables deletion of multiple rows by selecting them and easy editing of single cells.\n\nIt can also help construct SQL queries with the help of a query GUI.\n\n"
    },
    {
      "title": "Automated document conversion based on LibreOffice or OpenOffice",
      "level": 3,
      "content": "Document conversion can be done by libreoffice directly if called with the --headless command line option. For example, to convert a .odt into .pdf file, you can issue:\n\n```\n$ libreoffice --headless --convert-to pdf ./*.odt\n```\n\nAnother option is to use the command line tool unoconv, which is an automated conversion and styling tool that uses LibreOffice. Even though it requires more work [4], it is still very useful as it is. It either connects to a running LibreOffice, starts one for its own usage, or connects to a running instance that was started explicitly for its usage. A running X server is not required.\n\n"
    },
    {
      "title": "Notification sounds",
      "level": 3,
      "content": "Some user actions like closing LibreOffice with an unsaved document will bring up the \"Save Document?\" popup window together with a notification sound. Enabling/disabling notification sounds can be tried by changing the GTK configuration option gtk-enable-event-sounds, see GTK#Examples.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "A general way to track down problems is the safe mode in LibreOffice:\n\n```\n$ libreoffice --safe-mode\n```\n\n"
    },
    {
      "title": "Font substitution",
      "level": 3,
      "content": "In case the document uses a font that is not installed in the system, LibreOffice will use an alternative font to render the document. This is called \"font substitution\".\n\nLibreOffice uses fontconfig to resolve fonts.\n\nTo find out which font is the substitute for a missing font, you can issue:\n\n```\n$ fc-match \"My Font\"\n```\n\nIf the result is something like My Font.otf, it means the font is correctly installed. If the result is something different, it means that \"My Font\" is not installed and is being substituted by something else.\n\nNote that LibreOffice will not issue any errors or messages when it substitutes a font with another. It just puts the name of the font on the toolbar in italics, which mean the font is missing and is being substituted.\n\nSubstitution proposed by fontconfig can be overridden with LibreOffice. To override a fontconfig substitution, proceed as follows.\n\nFrom the drop-down menu, select Tools > Options > LibreOffice > Fonts. Check the box that says Apply Replacement Table. Type the name of your font, for example My Font, in the font box and choose your desired font for the Replace with option. When done, click the checkmark. Then choose the Always and Screen only options in the box below. Click OK.\n\n"
    },
    {
      "title": "Anti-aliasing",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Font configuration.** This article or section is a candidate for merging with Font configuration.\n\nThis article or section is a candidate for merging with Font configuration.\n\nExecute:\n\n```\n$ echo \"Xft.lcdfilter: lcddefault\" | xrdb -merge\n```\n\nTo make the change persistent, add Xft.lcdfilter: lcddefault to your ~/.Xresources file, and make sure to run $ xrdb -merge ~/.Xresources (source). See X resources for more details.\n\nIf this does not work, you can also try adding Xft.lcdfilter: lcddefault to your ~/.Xdefaults. If you do not have this file, you will have to create it.\n\n"
    },
    {
      "title": "Hanging when using NFSv3 shares",
      "level": 3,
      "content": "If LibreOffice hangs when trying to open or save a document located on a NFSv3 share, try prepending the following lines with a # in /usr/lib/libreoffice/program/soffice:\n\n```\n# file locking now enabled by default\nSAL_ENABLE_FILE_LOCKING=1\nexport SAL_ENABLE_FILE_LOCKING\n```\n\nTo avoid overwriting on update you can copy /usr/lib/libreoffice/program/soffice in /usr/local/bin. Original post here.\n\n"
    },
    {
      "title": "LibreOffice does not detect certificates",
      "level": 3,
      "content": "See the official documentation.\n\n"
    },
    {
      "title": "Run .pps files in edit mode (without slideshow)",
      "level": 3,
      "content": "The only solution is to rename the .pps file to .ppt.\n\nAdd the following script to your home directory and use it to open every .pps file. Very useful to open .pps files received by email without the need to save them.\n\n```\n#!/bin/sh\nf=$(mktemp --suffix .ppt)\ncp \"$1\" \"${f}\" && libreoffice \"${f}\" && rm -f \"${f}\"\n```\n\n"
    },
    {
      "title": "Media support",
      "level": 3,
      "content": "If embedded videos are just gray boxes, make sure to have installed the GStreamer plugins required.\n\n"
    },
    {
      "title": "Default paper size in Writer and Draw",
      "level": 3,
      "content": "If the default paper size in blank Writer and Draw documents is persistently incorrect for your locale, try installing the libpaper optional dependency and either updating /etc/papersize (for a system-wide change) or exporting the PAPERSIZE environment variable (for a user change) with your preferred paper size. See paper(1) and paper --no-size --all.\n\nNote: **Letter** \n\n"
    },
    {
      "title": "AutoText expected default behaviour not functional in system locales other than en_US",
      "level": 3,
      "content": "If expected default AutoText behaviour is not present (for example, typing fn in a document in Writer and then pressing the F3 key does not result in the automatic insertion of a numbered function) when the system locale is not en_US you need to add the default en_US AutoText templates to your AutoText path. To do this, go to Tools > AutoText..., then click on Path... and add the following path to the list: /usr/lib/libreoffice/share/autotext/en-US. AutoText should now work as expected by default.\n\n"
    },
    {
      "title": "LibreOffice freezes or crashes",
      "level": 3,
      "content": "Disable OpenCL and/or OpenGL by setting the environment variable SAL_DISABLE_OPENCL=1 and/or SAL_DISABLEGL=1. The LibreOffice safe mode also offers the option to disable both.\n\nIf LibreOffice is freezing or failing to start with the message \"Application Error\" but works fine when OpenCL is disabled, try installing an OpenCL runtime.\n\n"
    },
    {
      "title": "Wayland and HiDPI",
      "level": 3,
      "content": "To work around issues with scaling UI elements in Wayland on HiDPI screens, try to specify a VCL interface (e.g., gtk3 or qt6). See #Theme.\n\nMultiple screens with different scaling are affected by a bug preventing proper scaling on all screens. As a workaround start LibreOffice in Xwayland-mode (e.g. WAYLAND_DISPLAY= libreoffice).\n\n"
    },
    {
      "title": "kio-fuse and webdav",
      "level": 3,
      "content": "To ensure LibreOffice always falls back on kio-fuse for remote files (instead of its internal webdav implementation and password store), remove ,webdav,webdavs from the X-KDE-Protocols key in all libreoffice*.desktop files.\n\n"
    },
    {
      "title": "KDE Plasma/GNOME + Wayland with or without fractional scaling results in terrible lag when scrolling",
      "level": 3,
      "content": "Users of KDE Plasma 6 and 5 and some users testing with GNOME have reported issues of terrible lag while scrolling through documents as reported in [5]. Running LibreOffice through X11 can solve the issue (There are reports that the issue is not resolved in GNOME when using the GTK3 backend). This can be done individually by the setting the environment variable QT_QPA_PLATFORM=xcb libreoffice while in KDE Plasma (QT) or GDK_BACKEND=x11 libreoffice while in GNOME (GTK). Each .desktop file can be edited to permanently apply the change until a fix is found. Users can also switch back to X11 to mediate the issue.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Libreoffice Extensions and Templates\n- Wikipedia:LibreOffice\n\n"
    }
  ]
}