{
  "title": "LibreOffice (Español)",
  "url": "https://wiki.archlinux.org/title/LibreOffice_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nArtículos relacionados\n\n- Apache OpenOffice\n\nDel sitio web de LibreOffice:\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale una de los siguientes paquetes:\n\n- libreoffice-still es la rama estable de mantenimiento con actualizaciones infrecuentes, para los usuarios cautelosos.\n- libreoffice-fresh es la rama de características, con mejoras nuevas del programa para los adoptantes tempranos o usuarios avanzados.\n\n- Anteriormente, se requería la instalación de un paquete de idioma por lo mínimo. Actualmente, LibreOffice detecta los valores predeterminados del sistema y los usa para la configuración regional; ya no es necesario la instalación manual de un paquete de idioma, salvo para añadir idiomas adicionales. Véase help.libreoffice.org para información adicional.\n- No confunda el paquete de idioma de inglés británico (libreoffice-fresh-en-gb) con los paquetes del ucraniano (libreoffice-fresh-uk) o bretón (libreoffice-fresh-br).\n- Para la SDK (kit de desarrollo de software, en inglés: software development kit), instale libreoffice-fresh-sdk.\n- Están disponibles los paquetes de idioma Español según la rama que se instaló en el paso anterior: libreoffice-still-es. libreoffice-fresh-es.\n\n- libreoffice-still-es.\n- libreoffice-fresh-es.\n\nExamine las dependencias opcionales que pacman sugiere. Si usa HSQLDB, incrustado en LibreOffice Base, tiene que instalar un entorno de ejecución de Java. Tal vez necesite hsqldb2-javaAUR para usar unos módulos en LibreOffice Base.\n\n"
    },
    {
      "title": "Tema",
      "level": 2,
      "content": "LibreOffice incluye apoyo por integración de temas de GTK y Qt. Véase también Aspecto uniforme de applicaciónes GTK y Qt.\n\nLibreOffice intenta autodetectar cual interfaz de VCL sea más apropiado por los datos del entorno del escritorio. Para forzar la utilización de una interfaz de VCL específica, como por ejemplo «gtk4», establece el variable del entorno SAL_USE_VCLPLUGIN=gtk4. Para encontrar más opciones de la interfaz del usuario, consulte /etc/profile.d/libreoffice-fresh.sh o /etc/profile.d/libreoffice-still.sh, donde se enumera las variables y se los puede descomentar.\n\n"
    },
    {
      "title": "Gestión de extensiones",
      "level": 2,
      "content": "Los siguientes extensiones adicionales están disponibles:\n\n- libreoffice-extension-texmaths, tal renderiza ecuaciones matemáticas con LaTeX (como imágenes de PNG o SVG) incrustado en Writer, Impress, y Draw. [2]\n- libreoffice-extension-writer2latex, tal convierte los documentos de Writer a archivos de LaTeX. [3]\n\nPara otros extensiones, compruebe el AUR, el gestor de Extensiones incorporado en LibreOffice, o libreplanet\n\n"
    },
    {
      "title": "Tipos de letra",
      "level": 2,
      "content": "El wiki de The Document Foundation describe varios tipos de letra predeterminados cuales son empaquetados con LibreOffice en Windows y macOS. En Arch, estos tipos de letra se pueden añadir por medio de los siguientes paquetes:\n\n- ttf-caladea\n- ttf-carlito\n- ttf-dejavu\n- ttf-gentium-basicAUR\n- ttf-liberation\n- ttf-linux-libertine-g\n- noto-fonts\n- adobe-source-code-pro-fonts\n- adobe-source-sans-fonts\n- adobe-source-serif-fonts\n\nVéase también Fonts (Español)#Paquetes de fuente.\n\n"
    },
    {
      "title": "Corrección de ortografía",
      "level": 3,
      "content": "Para que funcione la corrección de ortografía, asegúrese de que hunspell está instalado correctament; esto debe de ser el caso para ambas las ramas de LibreOffice still y fresh. Entonces instale un diccionario de hunspell por el idioma querido, como por ejemplo hunspell-en_us para el inglés estadounidense o hunspell-es_any para el español neutro (compruebe en el AUR para encontrar idiomas además de los en los repositorios oficiales). Entonces, después de reiniciar LibreOffice, active los Ayudas de escritura por seleccionar la casilla de verificación en Herramientas > Opciones... > Idiomas y regiones > Ayudas de escritura > Revisor ortográfico Hunspell.\n\nA diferencia de los otros idiomas, la comprobación de la ortografía y la gramática finés utiliza Voikko. Para LibreOffice, se tiene que instalar el paquete voikko-libreofficeAUR.\n\nEl proyecto Orthos provee revisores de ortografía griegos más completo en forma de extensiones de LibreOffice. El paquete libreoffice-extension-orthos-greek-dictionaryAUR provee un diccionario ortográfica de solo griego, mientras que libreoffice-extension-orthos-greek-english-dictionaryAUR provee uno que combina griego y inglés de los EE. UU.\n\n"
    },
    {
      "title": "Soporte de texto bidireccional",
      "level": 3,
      "content": "Para activar soporte de texto bidireccional, seleccione la casilla de verificaión para Disposición compleja de textos (CTL, por sus siglos en inglés) por Herramientas > Opciones... > Idiomas y regiones > Generales > Idiomas predeterminados por los documentos, y escoja el idioma apropiado. Entonces el alineamiento de texto se puede forzar por los atajos Ctrl + tecla Mayús derecha y Ctrl + tecla Mayús izquierda. Hay un problema conocido cual causa que la dirección del texto cambia a la vez que cambie el estilo de párrafo.\n\n"
    },
    {
      "title": "Reglas de división de palabras",
      "level": 3,
      "content": "Para disponer de las reglas de división, necesitará hyphen y un conjunto de reglas por un idioma específica (hyphen-en para inglés, hyphen-es para español, etc.).\n\n"
    },
    {
      "title": "Diccionario de sinónimos",
      "level": 3,
      "content": "Para la opción Sinónimos necesitará libmythes y un diccionario de mythes por un idioma espesífica (como mythes-en para inglés, mythes-es para español, etc.).\n\nPara el griego, en vez de mythes-elAUR, hay tambień libreoffice-extension-orthos-greek-thesaurusAUR, cual incluye más palabras.\n\n"
    },
    {
      "title": "Comprobación de la gramática con LanguageTool",
      "level": 3,
      "content": "Para la opción de corrección de gramática, hay disponibles varias herramientas. Lo más común es languagetool. Las instrucciones de instalación dependen por la versión de LibreOffice vigente.\n\nDesde versión 7.4, LibreOffice tiene compatibilidad innato con LanguageTool[4], y no necesita una extensión:\n\n1. Navigue a Herramientas > Opciones... > Idiomas y regiones > Servidor LanguageTool.\n1. Active a LanguageTool por seleccionar la casilla de verificación.\n1. El URL que se utiliza depende en el tipo de cuenta remota (gratis o prémium) del usuario, o si tiene un servidor local: Por una cuenta gratuita remota, ponga https://api.languagetool.org/v2, y deje los otros dos campos blancos. Por una cuenta prémium remota, ponga como «URL de base» https://api.languagetool.org/v2, escriba el correo electrónico de la cuenta, y teclee el clave de API. Por un servidor local de LanguageTool, ponga como «URL de base» http://localhost:8081/v2. Deje vacíos «Nombre de usuario» y «Clave de API».\n1. Haga clic en Aceptar, y abra un documento de Writer si no hay uno abierto ya.\n1. Seleccione la casilla de verificaión Herramientas > Revisión ortográfica automática.\n\n- Por una cuenta gratuita remota, ponga https://api.languagetool.org/v2, y deje los otros dos campos blancos.\n- Por una cuenta prémium remota, ponga como «URL de base» https://api.languagetool.org/v2, escriba el correo electrónico de la cuenta, y teclee el clave de API.\n- Por un servidor local de LanguageTool, ponga como «URL de base» http://localhost:8081/v2. Deje vacíos «Nombre de usuario» y «Clave de API».\n\nVéase a la página de LanguageTool para más información.\n\n"
    },
    {
      "title": "Ayuda sin conexión",
      "level": 3,
      "content": "libreoffice-still y libreoffice-fresh proveen los archivos de ayuda sin conexión para en-US. Los archivos de la ayuda para las otras regiones se provee por el paquete de idioma de LibreOffice correspondiente (como por ejemplo, libreoffice-fresh-en-za provee los archivos de ayuda para las regiones en-ZA)\n\n"
    },
    {
      "title": "Acelerar inicialización",
      "level": 3,
      "content": "- Desactivar el logotipo inicial: Al preferir desactivar la pantalla del logotipo inicial con el progreso de carga, abra /etc/libreoffice/sofficerc, busque la línea con Logo=, y establézcalo a Logo=0. Alternativamente, se puede usar la opción de la ILC --nologo.\n- Deshabilite la ejecución Java: Al no utilizar las características cuales dependen en Java, considere el desactivar la ejecución de Java. Navegue a Herramientas > Opciones... > LibreOffice > Avanzadas y deseleccione Utilizar un entorno de ejecución de Java.\n- Desactive la corrección ortográfica automática: En Herramientas > Opciones... > Idiomas y regiones > Ayudas de escritura, deseleccione Revisar la ortografía al escribir y Revisar la gramática al escribir.\n\n"
    },
    {
      "title": "Instalación de macros",
      "level": 3,
      "content": "Antes de poder utilizar las macros, se tiene que habilitar un entorno de ejecución Java.\n\nLa ruta predeterminada para las macros es distinta de la de la mayoría de las distribuciones Linux. Su ubicación es ~/.config/libreoffice/4/user/Scripts/.\n\n"
    },
    {
      "title": "Base como interfaz para bases de datos",
      "level": 3,
      "content": "Base se puede usar como una interfaz a una base de datos como PostgreSQL. No puede editar a las tablas, pero da una muy buena vista general de las columnas y filas de una table, aun con la posibilidad de ocultar unas columnas para tener una vista mejor de los datos pertinentes. También puede filtrar los datos y habilita la eliminación de filas múltiples por seleccionarlas y la revición facil de celdas solas.\n\nTambién ayuda en construir búsquedas de SQL con la ayuda de una IGU de búsquedas.\n\n"
    },
    {
      "title": "Sustitución de fuentes",
      "level": 3,
      "content": "Esta configuración se puede cambiar en las opciones LibreOffice. En el menú desplegable, seleccione Herramientas> Opciones> LibreOffice> Fuentes. Marque la casilla que diceAplicarsustitución de tablas. Escriba Andale Sans UI en el cuadro Fuente y elija su tipo de letra deseado para la opción de reemplazarcon. Cuando termine, haga clic en lamarca. A continuación, seleccione elsiempreysóloopciones de pantalla en el cuadro a continuación. Haga clic en Aceptar. A continuación, tendrá que ir aHerramientas> Opciones LibreOffice>> Ver y desmarque la opción \"Usar fuente del sistema para la interfaz de usuario \". Si utiliza una fuente no antialised, como Arial, también tendrá que desactivar \"anti-aliasing de pantalla de la fuente\" antes de las fuentes de menú procesar correctamente.\n\n"
    },
    {
      "title": "No se pueden ingresar acentos",
      "level": 3,
      "content": "Descripción del problema: En las otras aplicaciones los acentos funcionan bien, en LibreOffice no los puedo ingresar usando el teclado, el problema parecen ser las teclas muertas pues la ñ si funciona pero las tildes no, adicionalmente puedo copiar (por ejemplo de Firefox) y pegar las letras con tildes.\n\nSolución:\n\nEn /etc/locale.gen desmarcar (quitar #) de:\n\n- es_ES.UTF-8\n- es_ES.ISO-8859-1\n- en_US.UTF-8\n- en_US.ISO-8859-1\n\nluego en la consola como root\n\n```\n# locale-gen\n```\n\ny en LibreOffice Opciones -> Configuración del Idioma -> Idioma de: --> Interfaz del Usuario: Predeterminado - Español - España\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Libreoffice Extensions and Templates\n- Wikipedia:es:LibreOffice\n\n"
    }
  ]
}