{
  "title": "Libreoffice (Русский)",
  "url": "https://wiki.archlinux.org/title/Libreoffice_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "С домашней страницы LibreOffice:\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите один из следующих пакетов:\n\n- libreoffice-still - стабильная ветвь обновлений\n- libreoffice-fresh - новые функции появляются сначала здесь, часто обновляется\n\n- В прошлом требовалась установка хотя бы одного языкового пакета. Сейчас LibreOffice автоматически определяет системные умолчания и выставляет настройки локали; ручная установка языкового пакета теперь необязательна и нужна только для локализации интерфейса. Подробнее смотрите help.libreoffice.org.\n- Для SDK установите libreoffice-fresh-sdk.\n\nДля русского интерфейса установите libreoffice-still-ru или libreoffice-fresh-ru соответственно установленной вами версии LibreOffice.\n\nПроверьте опциональные зависимости, которые выводит pacman. Java Runtime Environment не требуется, пока вы не захотите использовать Libreoffice Base: см. Java (Русский). Вам может понадобиться hsqldb2-javaAUR, чтобы использовать некоторые модули в LibreOffice Base.\n\n"
    },
    {
      "title": "Темы оформления",
      "level": 2,
      "content": "LibreOffice поддерживает интеграцию тем GTK+ (Русский) and Qt (Русский). Смотри также Uniform look for Qt and GTK applications (Русский).\n\nНаборы библиотек проверяются в следующем порядке:\n\n```\ngtk3 > gtk > kde4 > generic\n```\n\nЧтобы принудительно использовать определенный интерфейс VCL UI, используйте одну из SAL_USE_VCLPLUGIN=gen, SAL_USE_VCLPLUGIN=kde4, SAL_USE_VCLPLUGIN=gtk или SAL_USE_VCLPLUGIN=gtk3 переменных среды (environment variables (Русский)). Можно снять комментирование с этих переменных в /etc/profile.d/libreoffice-fresh.sh или /etc/profile.d/libreoffice-still.sh.\n\nОднако, если в программе всё похоже на использование значков Windows 95/98, перейдите в меню Tools > Options..., (в котором представлено диалоговое окно Options), затем выберите LibreOffice > Accessibility и снимите флажок Automatically detect high-contrast mode of operating system.\n\nЕсли это не сработает сразу, вам может потребоваться изменить набор значков, который используется; это также находится в диалоговом окне Options в разделе LibreOffice > View с двумя всплывающими окнами для Icon size and style (последнее всплывающее окно должно быть изменено на нечто иное, чем \"High-contrast\").\n\n"
    },
    {
      "title": "Отключение логотипа запуска",
      "level": 3,
      "content": "Если вы предпочитаете отключать логотип запуска, откройте /etc/libreoffice/sofficerc, найдите строку содержащую Logo= и замените на Logo=0.\n\n"
    },
    {
      "title": "Управление расширениями",
      "level": 2,
      "content": "В официальных репозиториях Arch доступны следующие расширения:\n\n- libreoffice-extension-texmaths\n- libreoffice-extension-writer2latex\n\nТакже вы можете поискать расширения в AUR, во встроенном в LibreOffice менеджере расширений или на libreplanet.\n\n"
    },
    {
      "title": "Шрифты",
      "level": 2,
      "content": "The Document Foundation wiki упоминает различные шрифты, идущие в комплекте с LibreOffice в Windows и macOS. В Arch вам может понадобиться установить следующие пакеты:\n\n- ttf-caladea\n- ttf-carlito\n- ttf-dejavu\n- ttf-gentium-basicAUR\n- ttf-liberation\n- ttf-linux-libertine-g\n- noto-fonts\n- adobe-source-code-pro-fonts\n- adobe-source-sans-fonts\n- adobe-source-serif-fonts\n\nСмотрите также Fonts#Font packages.\n\n"
    },
    {
      "title": "Проверка правописания",
      "level": 3,
      "content": "Установите hunspell и словари для него: hunspell-en_us hunspell-ru-aotAUR. Также в доступны hunspell-ru (старый), hunspell-ru-aot-ieyoAUR (не различает е/ё).\n\n"
    },
    {
      "title": "Правила переноса",
      "level": 3,
      "content": "Установите hyphen и набор правил для него: hyphen-en hyphen-ruAUR.\n\n"
    },
    {
      "title": "Тезаурус",
      "level": 3,
      "content": "Установите libmythes и словари для него: mythes-en mythes-ruAUR.\n\n"
    },
    {
      "title": "Проверка грамматики",
      "level": 3,
      "content": "Есть несколько инструментов. Часто используемый — LanguageTool. Вы можете:\n\n- установить пакет libreoffice-extension-languagetoolAUR\n- или скачать его на странице расширений LibreOffice и самостоятельно установить его через Сервис > Управление расширениями.\n\nПосле установки расширения убедитесь, что установлен рантайм Java 8 (jre8-openjdk). Действительно, Languagetool использует Java и может замедлять или вызывать мелкие зависания LibreOffice, особенно при открытии документов. К счастью, это обычно происходит только при первом открытии документа и больше не случается. После установки вы можете захотеть включить его в качестве среды по умолчанию для LibreOffice. Для этого перейдите в Сервис > Параметры > Расширенные возможности и выберите соответствующую JRE (будет отображаться как 1.8.0), затем нажмите «ОК». Вам будет предложено перезапустить пакет LibreOffice. После перезапуска вы сможете без проблем установить Languagetools.\n\nДругие инструменты проверки грамматики можно найти на странице расширений LibrePlanet, на официальном сайте LibreOffice Extensions или на сайте OpenOffice. Имейте в виду, что расширения OpenOffice не обязательно заработают в LibreOffice.\n\n"
    },
    {
      "title": "Оффлайн-справка",
      "level": 3,
      "content": "Пакеты libreoffice-still и libreoffice-fresh предоставляют оффлайн-справку для английского языка. Справка для других языков доступна в соответствующих пакетах, например libreoffice-fresh-ru.\n\n"
    },
    {
      "title": "Установка макросов",
      "level": 2,
      "content": "Если Вы намерены использовать макросы, Вам нужно установить Java Runtime Environment.\n\nВ Arch Linux стандартный путь к макросам отличается от многих других дистрибутивов: ~/.config/libreoffice/4/user/Scripts/\n\n"
    },
    {
      "title": "Ускоряем LibreOffice",
      "level": 3,
      "content": "Некоторые из настроек могут уменьшить время загрузки LibreOffice и скорость ее работы. Однако, потребление оперативной памяти тоже возрастет. Эти настройки можно найти в меню Сервис > Параметры.\n\n- В закладке Память: Снизьте число шагов, на которое можно вернуться при редактировании, например 20 или 30. Установить Использовать для LibreOffice равным 128МБ Установите Памяти на объект равным 20МБ Если Вы часто применяете LibreOffice, проверьте, что используется Quickstarter (использовать быстрый запуск).\n- В закладке Расширенные возможности, снимите галочку с Use a Java runtime environment (использовать виртуальную машину java).\n\n- Снизьте число шагов, на которое можно вернуться при редактировании, например 20 или 30.\n- Установить Использовать для LibreOffice равным 128МБ\n- Установите Памяти на объект равным 20МБ\n- Если Вы часто применяете LibreOffice, проверьте, что используется Quickstarter (использовать быстрый запуск).\n\n"
    },
    {
      "title": "Base как фронтенд для базы данных",
      "level": 3,
      "content": "Base можно использовать в качестве фронтенда для базы данных вроде PostgreSQL. Он не может изменять таблицы, но даёт хороший обзор столбцов и строк таблицы с возможностью скрытия столбцов. Он также позволяет использовать фильтры, удалять по несколько строк с помощью их выделения и удобно редактировать отдельные ячейки.\n\nОн также помогает составлять SQL-запросы в удобном GUI.\n\n"
    },
    {
      "title": "Автоматическая конвертация документов",
      "level": 3,
      "content": "Консольная утилита unoconv позволяет проводить автоматизированную конвертацию и стилизацию ис пользованием LibreOffice. Хотя она требует доработки, она весьма полезна уже сейчас. Она может подключаться к запущенному LibreOffice или запускать свой собственный экземпляр. X-сервер не требуется.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Общий способ поиска проблем — запуск в безопасном режиме:\n\n```\n$ libreoffice --safe-mode\n```\n\n"
    },
    {
      "title": "Шрифт подстановки",
      "level": 3,
      "content": "Его можно изменить в опциях LibreOffice. Из выпадающего меню выберите Tools > Options > LibreOffice > Fonts (Сервис > Параметры > LibreOffice > Шрифты). Поставьте галочку в поле Apply Replacement Table (применить таблицу замен). Выберите шрифт Andale Sans UI и выберите желаемый шрифт для опции Replace with (заменить на). Когда закончите, нажмите checkmark (галочку). Затем выберите опции Always(всегда) и Screen only (экран). Нажимайте ОК. Затем Вам нужно перейти в меню Tools > Options > LibreOffice > View (Сервис > Параметры > LibreOffice > Вид) и снять галочку с опции \"Use system font for user interface\". Если Вы используете несглаженный шрифт, например, Arial, также придется убрать опцию \"Screen font antialiasing\" (использовать сглаживание).\n\n"
    },
    {
      "title": "Сглаживание",
      "level": 3,
      "content": "Выполните:\n\n```\n$ echo \"Xft.lcdfilter: lcddefault\" | xrdb -merge\n```\n\nЧтобы сделать изменение постоянным, добавьте \"Xft.lcdfilter: lcddefault\" в ~/.Xresources файл. ([1][устаревшая ссылка 2020-08-02 ⓘ])\n\nЕсли не сработало, можно также добавить \"Xft.lcdfilter: lcddefault\" в ~/.Xdefaults. Если такого файла нет, создайте его.\n\n"
    },
    {
      "title": "Проблемы с проверкой правописания",
      "level": 3,
      "content": "Проблемы с проверкой правописания могут быть вызваны неверной кодировкой словарей. Чтобы устранить эту проблему, следуйте инструкциям.\n\nНайдите, где хранятся файлы словарей (к примеру, pacman -Ql openoffice-base). Большая часть дистрибутивов устанавливает их в /usr/lib/openoffice/share/extension/install. Как только путь найден, присвойте его значение переменной shell:\n\n```\ndroot=\"/usr/lib/openoffice/share/extension/install\"\n```\n\nУстановите пакеты unzip и zip для того, чтобы иметь возможность распаковать файлы словарей:\n\n```\npkg=$(pacman -T unzip zip) || pacman -S $pkg\n```\n\nДля справки, чтобы получить список словарей, входящих в состав базового пакета:\n\n```\ncd \"$droot\" && ls | sed -rn 's,^dict-(..)\\.oxt$,\\1,p'\n```\n\nОпределите, какие языковые словари Вам нужно исправить:\n\n```\nlang=\"en ru\"\n```\n\nРаспакуйте эти словари и конвертируйте их кодировку в UTF-8:\n\n```\ntmp=\"/tmp/dictfix-$USER-$$\"\n\nmkdir \"$tmp\"\ncd \"$tmp\"\n\nfor i in $lang; do\n\ti=\"$droot/dict-$i.oxt\"\n\tunzip \"$i\" -d oxt.tmp\n\ticonv -f ISO-8859-15 -t UTF-8 oxt.tmp/dictionaries.xcu > dict.tmp\n\tmv dict.tmp oxt.tmp/dictionaries.xcu\n\t(cd oxt.tmp && zip -r \"$i\" .)\ndone\n\nrm -rf \"$tmp\"\n```\n\nНаконец, при помощи встроенного менеджера расширений (Tools) установите словари из получившихся в итоге файлов dict-xx.oxt.\n\n"
    },
    {
      "title": "Зависание при использовании NFSv3",
      "level": 3,
      "content": "Если программа зависает при попытке открыть/сохранить документ в сетевую папку NFSv3, попробуйте закомментировать следующие строчки символом \"#\" в /usr/lib/libreoffice/program/soffice:\n\n```\n# file locking now enabled by default\nSAL_ENABLE_FILE_LOCKING=1\nexport SAL_ENABLE_FILE_LOCKING\n```\n\nЧтобы избежать перезаписи файла при обновлении, вы можете скопировать /usr/lib/libreoffice/program/soffice в /usr/local/bin. Исходное сообщение здесь.\n\n"
    },
    {
      "title": "LibreOffice не находит мои сертификаты",
      "level": 3,
      "content": "Если Вы не видите своих сертификатов при попытке подписать документ, Вам необходимо их сконфигурировать в программах Firefox или Thunderbird. Если же и после этого их не видно, наберите команду:\n\n```\nexport MOZILLA_CERTIFICATE_FOLDER=$HOME/.mozilla/firefox/XXXXXX.default/\n```\n\nНахождение сертификатов\n\n"
    },
    {
      "title": "Запуск .pps файлов в режиме редактирования (без слайд-шоу)",
      "level": 3,
      "content": "Единственный способ — переименовать .pps в .ppt.\n\nДобавьте этот скрипт в домашнем каталоге и используйте его при открытии каждого .pps файла.\n\n```\n#!/bin/sh\nf=$(mktemp --suffix .ppt)\ncp \"$1\" \"${f}\" && libreoffice \"${f}\" && rm -f \"${f}\"\n```\n\n"
    },
    {
      "title": "Поддержка медиа",
      "level": 3,
      "content": "Если вместо встроенных видео видны лишь серые прямоугольники, проверьте установку требуемых плагинов GStreamer.\n\n"
    },
    {
      "title": "Стандартный размер бумаги в Writer и Draw",
      "level": 3,
      "content": "Если он постоянно неправильный для вашей локали, попробуйте установить необязательную зависимость libpaper и обновить /etc/papersize (влияет на всю систему) или прописать переменную окружения PAPERSIZE (для отдельного пользователя) на предпочтительный размер бумаги. Смотрите papersize(5)[устаревшая ссылка 2023-03-12].\n\nNote: **Letter** \n\n"
    },
    {
      "title": "Панели инструментов LibreOffice нечитабельны с тёмной темой Breeze/Plasma 5",
      "level": 3,
      "content": "Измените стиль значков в Сервис > Параметры > LibreOffice > Вид > Стиль значков на «Breeze Dark» или другой читабельный стиль. Вам может понадобиться установить пакет breeze-gtk.\n\nЕсли этого недостаточно, убедитесь, что LibreOffice стартует с интерфейсом gtk3 или gen (смотрите #Темы оформления). [2]\n\n"
    },
    {
      "title": "AutoText expected default behaviour not functional in system locales other than en_US",
      "level": 3,
      "content": "If expected default AutoText behaviour is not present (for example, typing fn in a document in Writer and then pressing the F3 key does not result in the automatic insertion of a numbered function) when the system locale is not en_US you need to add the default en_US AutoText templates to your AutoText path. To do this, go to Tools > AutoText, then click on Path... and add the following path to the list: /usr/lib/libreoffice/share/autotext/en-US. AutoText should now work as expected by default.\n\n"
    },
    {
      "title": "LibreOffice зависает или вылетает",
      "level": 3,
      "content": "Отключите OpenCL и/или OpenGL, установив переменную окружения SAL_DISABLE_OPENCL=1 и/или SAL_DISABLEGL=1. Безопасный режим LibreOffice также отключает их оба.\n\nЕсли LibreOffice зависает или вылетает с \"Application Error\", но работает с отключенным OpenCL, попробуйте установить OpenCL runtime.\n\n"
    },
    {
      "title": "Звуки уведомлений",
      "level": 3,
      "content": "Некоторые действия вроде закрытия LibreOffice без сохранения документа показывают всплывающее окно «Сохранить изменения?» вместе со звуком уведомления. Включить или отключить его можно изменением опции GTK \"gtk-enable-event-sounds\", смотрите GTK (Русский)#Примеры\n\n"
    },
    {
      "title": "LibreOffice не открывает документы расположенные в сети через Dolphin в KDE",
      "level": 3,
      "content": "Если при открытии документов из сетевых каталогов всплывет сплеш-заставка LibreOffice и затем ничего не происходит, то наберите команды для изменения Desktop-файлов приложения:\n\n```\nsudo sed -i 's/X-GIO-NoFuse=true/#X-GIO-NoFuse=true/' /usr/share/applications/libreoffice-*\nsudo sed -i 's/X-KDE-Protocols=file,http,smb,ftp,webdav/#X-KDE-Protocols=file,http,smb,ftp,webdav/' /usr/share/applications/libreoffice-*\n```\n\nИсточник\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Расширения и Шаблоны LibreOffice\n- Wikipedia:ru:LibreOffice\n\n"
    }
  ]
}