{
  "title": "LibreOffice (Українська)",
  "url": "https://wiki.archlinux.org/title/LibreOffice_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "З домашньої сторінки [1]: LibreOffice — потужний офісний пакет; завдяки його простому інтерфейсу і потужним інструментам Ви розкриєте свій творчий потенціал і підвищите продуктивність. LibreOffice містить кілька програм, які роблять його найпотужнішим безкоштовним і відкритим пакетом офісних програм на ринку: текстовий процесор Writer, програма для роботи з електронними таблицями Calc, рушій презентацій Impress, Draw, наша програма для малювання та блок-схем, Base, наша база даних і інтерфейс бази даних, а також Math для редагування математичних виразів.\n\n"
    },
    {
      "title": "Інсталяція",
      "level": 2,
      "content": "Встановіть один із наступних пакетів відповідно до вашої потреби:\n\n- libreoffice-still — стабільна гілка оновлень із рідкісними змінами.\n- libreoffice-fresh — гілка з новими функціями, де інновації з’являються першими (оновлення відбуваються частіше).\n\nNote: **libreoffice-fresh-sdk** \n\n- Раніше для встановлення потрібно було інсталювати хоча б один мовний пакет, але зараз LibreOffice автоматично визначає системні налаштування локалі. Ручна установка мовного пакету потрібна лише для повної локалізації інтерфейсу.\n- Для SDK використовуйте пакет libreoffice-fresh-sdk.\n\nДля отримання інтерфейсу українською встановіть відповідний пакет, наприклад — libreoffice-still-uk або libreoffice-fresh-uk, залежно від встановленої версії LibreOffice.\n\nПеревірте опціональні залежності, які може показувати pacman. Java Runtime Environment не потрібен для базової роботи, проте для роботи з LibreOffice Base (фронтендом для баз даних) можуть знадобитися додаткові пакети (див. Java) і, можливо, пакет hsqldb2-javaAUR для деяких модулів.\n\n"
    },
    {
      "title": "Теми оформлення",
      "level": 2,
      "content": "LibreOffice підтримує інтеграцію тем оформлення для GTK+ та Qt . Також дивіться сторінку Uniform look for Qt and GTK applications. Порядок перевірки наборів бібліотек (VCL-плагінів) наступний: gtk3 > gtk > kde4 > generic\n\nЩоб примусово використовувати певний інтерфейс, задайте одну з наступних змінних середовища:\n\n- SAL_USE_VCLPLUGIN=gen\n- SAL_USE_VCLPLUGIN=kde4\n- SAL_USE_VCLPLUGIN=gtk\n- SAL_USE_VCLPLUGIN=gtk3\n\nЦі змінні можна розкоментувати у файлах /etc/profile.d/libreoffice-fresh.sh або /etc/profile.d/libreoffice-still.sh.\n\nЯкщо LibreOffice відображає значки в стилі Windows 95/98, перейдіть у меню «Сервіс > Параметри…», оберіть «LibreOffice > Accessibility» та зніміть прапорець «Автоматично визначати висококонтрастний режим операційної системи». За необхідності змініть набір значків у розділі «LibreOffice > View» (виберіть інший стиль для «Icon size and style», не «High-contrast»).\n\n"
    },
    {
      "title": "Відключення логотипа запуску",
      "level": 3,
      "content": "Якщо ви бажаєте відключити логотип під час завантаження, відкрийте файл: /etc/libreoffice/sofficerc, знайдіть рядок із текстом Logo= та змініть його на: Logo=0.\n\n"
    },
    {
      "title": "Управління розширеннями",
      "level": 2,
      "content": "В офіційних репозиторіях Arch доступні наступні розширення:\n\n- libreoffice-extension-texmaths — для створення математичних формул (PNG або SVG).\n- libreoffice-extension-writer2latex — для конвертації документів Writer у LaTeX.\n\nТакож розширення можна шукати в AUR, використовувати вбудований менеджер розширень LibreOffice або переглянути libreplanet.\n\n"
    },
    {
      "title": "Шрифти",
      "level": 2,
      "content": "За даними The Document Foundation [2], LibreOffice у Windows і macOS постачається з певними шрифтами. У Arch Linux може бути потрібно встановити:\n\n- ttf-caladea\n- ttf-carlito\n- ttf-dejavu\n- ttf-gentium-basicAUR\n- ttf-liberation\n- ttf-linux-libertine-g\n- noto-fonts\n- adobe-source-code-pro-fonts\n- adobe-source-sans-fonts\n- adobe-source-serif-fonts\n\nДив. також сторінку Fonts#Font packages.\n\n"
    },
    {
      "title": "Перевірка правопису",
      "level": 3,
      "content": "Для перевірки правопису встановіть пакет hunspell та словники, наприклад:\n\n- hunspell-en_us\n- hunspell-ru-aotAUR (для російської; для української зазвичай використовується системний пакет, якщо він доступний)\n\n"
    },
    {
      "title": "Правила перенесення (гіфенація)",
      "level": 3,
      "content": "Встановіть hyphen та відповідний набір правил, наприклад:\n\n- hyphen-en\n- hyphen-ukAUR\n\n"
    },
    {
      "title": "Тезаурус",
      "level": 3,
      "content": "Встановіть libmythes та словники для нього:\n\n- mythes-en\n- mythes-ukAUR\n\n"
    },
    {
      "title": "Перевірка граматики",
      "level": 3,
      "content": "Як інструмент перевірки граматики можна використовувати LanguageTool. Для його встановлення:\n\n- Інсталюйте пакет libreoffice-extension-languagetoolAUR\n- Або завантажте розширення зі сторінки [3]\n\nПісля встановлення переконайтеся, що встановлено Java 8 (наприклад, jre8-openjdk). У меню «Сервіс > Параметри > Розширені можливості» оберіть відповідну JRE, після чого перезапустіть LibreOffice.\n\n"
    },
    {
      "title": "Оффлайн-довідка",
      "level": 3,
      "content": "Пакети libreoffice-still та libreoffice-fresh включають оффлайн-довідку для англійської мови. Для інших мов використовуйте відповідні пакети (наприклад, libreoffice-fresh-uk).\n\n"
    },
    {
      "title": "Установка макросів",
      "level": 2,
      "content": "Якщо ви плануєте використовувати макроси, встановіть Java Runtime Environment. У Arch Linux стандартний шлях до макросів — ~/.config/libreoffice/4/user/Scripts/.\n\n"
    },
    {
      "title": "Прискорення роботи LibreOffice",
      "level": 3,
      "content": "Деякі налаштування можуть зменшити час завантаження LibreOffice:\n\n- У розділі «Пам'ять» в «Сервіс > Параметри» зменшіть кількість кроків для відміни (наприклад, до 20–30).\n- Встановіть параметр «Пам'ять для LibreOffice» (Use for LibreOffice) на 128 МБ.\n- Зменшіть «Пам'ять на об'єкт» до 20 МБ.\n- Якщо часто використовуєте LibreOffice, перевірте, чи активовано швидкий запуск (Quickstarter).\n- У розділі «Розширені можливості» вимкніть використання Java Runtime Environment, якщо вона не потрібна.\n\n"
    },
    {
      "title": "Base як фронтенд для баз даних",
      "level": 3,
      "content": "LibreOffice Base можна використовувати як зручний графічний інтерфейс для перегляду баз даних (наприклад, PostgreSQL). Він дозволяє переглядати структуру таблиць, фільтрувати дані, виділяти та редагувати окремі записи, а також допомагає у складанні SQL-запитів.\n\n"
    },
    {
      "title": "Автоматична конвертація документів",
      "level": 3,
      "content": "Утиліта unoconv дозволяє автоматизувати конвертацію документів (наприклад, .odt в .pdf) через командний рядок. Приклад команди: libreoffice --headless --convert-to pdf ./*.odt\n\n"
    },
    {
      "title": "Вирішення проблем",
      "level": 2,
      "content": "Якщо виникають проблеми, спробуйте запустити LibreOffice у безпечному режимі: libreoffice --safe-mode\n\n"
    },
    {
      "title": "Замінник шрифтів",
      "level": 3,
      "content": "Якщо LibreOffice використовує шрифт, якого немає у системі, перейдіть у меню «Сервіс > Параметри > LibreOffice > Шрифти», поставте прапорець «Застосувати таблицю замін», виберіть шрифт (наприклад, Andale Sans UI) для заміни та натисніть галочку. Далі виберіть опції «Завжди» та «Лише для екрану».\n\n"
    },
    {
      "title": "Сгладжування шрифтів",
      "level": 3,
      "content": "Виконайте наступну команду для покращення якості шрифтів: echo \"Xft.lcdfilter: lcddefault\" Щоб зробити це постійним, додайте рядок Xft.lcdfilter: lcddefault до файлу ~/.Xresources (або ~/.Xdefaults, якщо файл відсутній).\n\n"
    },
    {
      "title": "Проблеми з перевіркою правопису",
      "level": 3,
      "content": "Якщо перевірка правопису працює некоректно через невірну кодування словників, знайдіть місце їх розташування (наприклад, через pacman -Ql openoffice-base) і за допомогою утиліт unzip та zip перетворіть їхню кодування у UTF-8. Детальний алгоритм можна реалізувати за допомогою Bash-скрипта (див. приклад у розділі).\n\n"
    },
    {
      "title": "Зависання при використанні NFSv3",
      "level": 3,
      "content": "Якщо LibreOffice зависає при роботі з NFSv3, відкрийте файл /usr/lib/libreoffice/program/sofficerc і закоментуйте рядки: # file locking now enabled by default # SAL_ENABLE_FILE_LOCKING=1 # export SAL_ENABLE_FILE_LOCKING Також можна скопіювати цей файл у /usr/local/bin для збереження змін при оновленнях.\n\n"
    },
    {
      "title": "Проблеми з пошуком сертифікатів",
      "level": 3,
      "content": "Якщо LibreOffice не знаходить сертифікати для цифрового підпису, перегляньте офіційну документацію LibreOffice з цифрового підпису ([4]) і налаштуйте їх через відповідні програми (Firefox, Thunderbird).\n\n"
    },
    {
      "title": "Запуск .pps файлів у режимі редагування",
      "level": 3,
      "content": "Щоб відкрити .pps файл без запуску слайд-шоу, перейменуйте його на .ppt або використайте наступний скрипт (збережіть його у домашньому каталозі і запускайте для кожного файлу): #!/bin/sh f=$(mktemp --suffix .ppt) cp \"$1\" \"${f}\" && libreoffice \"${f}\" && rm -f \"${f}\"\n\n"
    },
    {
      "title": "Підтримка медіа",
      "level": 3,
      "content": "Якщо відео відображаються як сірі прямокутники, переконайтеся, що встановлено необхідні плагіни GStreamer#Installation.\n\n"
    },
    {
      "title": "Стандартний розмір паперу в Writer і Draw",
      "level": 3,
      "content": "Якщо стандартний розмір паперу не відповідає вашим локальним налаштуванням, встановіть додаткову залежність libpaper і відредагуйте файл /etc/papersize (системне змінення) або встановіть змінну середовища PAPERSIZE для користувача. Для довідки див. papersize(1).\n\n"
    },
    {
      "title": "Проблеми з відображенням панелей інструментів у темній темі Breeze/Plasma 5",
      "level": 3,
      "content": "Якщо панелі інструментів LibreOffice нечитабельні при темній темі, змініть стиль значків у меню «Сервіс > Параметри > LibreOffice > Вид > Стиль значків» на «Breeze Dark» або інший відповідний стиль. Можливо, доведеться встановити пакет breeze-gtk.\n\nЯкщо цього недостатньо, переконайтеся, що LibreOffice запускається з інтерфейсом gtk3 або gen (див. розділ «Теми оформлення»). [Джерело: https://bbs.archlinux.org/viewtopic.php?id=206813]\n\n"
    },
    {
      "title": "Автовставка (AutoText)",
      "level": 3,
      "content": "Якщо функціональність автотексту (наприклад, набір fn з наступним натисканням F3 для вставки шаблону) не працює у системах з локаллю, відмінною від en_US, додайте стандартні автотекст шаблони en_US до вашого шляху автотексту. Для цього перейдіть у «Сервіс > Автотекст», натисніть «Шлях…» і додайте: /usr/lib/libreoffice/share/autotext/en-US.\n\n"
    },
    {
      "title": "LibreOffice зависає або аварійно завершує роботу",
      "level": 3,
      "content": "Спробуйте відключити апаратне прискорення OpenCL та/або OpenGL, встановивши змінні середовища: SAL_DISABLE_OPENCL=1 SAL_DISABLEGL=1 . Безпечний режим LibreOffice також може вимкнути обидві функції.\n\nЯкщо при запуску LibreOffice з’являється повідомлення «Application Error», а при відключенні OpenCL програма працює стабільно, спробуйте встановити відповідний OpenCL runtime (див. GPGPU#Runtime).\n\n"
    },
    {
      "title": "Звуки повідомлень",
      "level": 3,
      "content": "Деякі дії (наприклад, закриття LibreOffice з несохраненим документом) супроводжуються звуковими сигналами. Керувати ними можна через опції GTK \"gtk-enable-event-sounds\" (див. GTK).\n\n"
    },
    {
      "title": "Проблеми з відкриттям документів через Dolphin у KDE",
      "level": 3,
      "content": "Якщо при відкритті документів з мережевих папок через Dolphin у KDE LibreOffice не завантажує документ (з'являється лише заставка), відредагуйте файли робочих ярликів LibreOffice наступним чином: sudo sed -i 's/X-GIO-NoFuse=true/#X-GIO-NoFuse=true/' /usr/share/applications/libreoffice-* sudo sed -i 's/X-KDE-Protocols=file,http,smb,ftp,webdav/#X-KDE-Protocols=file,http,smb,ftp,webdav/' /usr/share/applications/libreoffice-* (Джерело: [5])\n\n"
    },
    {
      "title": "Дивіться також",
      "level": 2,
      "content": "- Розширення та Шаблони LibreOffice\n- Стаття на Wikipedia\n\n"
    },
    {
      "title": "Посилання",
      "level": 2,
      "content": "- Офіційний сайт: LibreOffice\n- Довідка LibreOffice: LibreOffice Help\n\nRetrieved from \"https://wiki.archlinux.org/index.php/LibreOffice_(Українська)\" (станом на 05.02.2025)\n\n"
    }
  ]
}