{
  "title": "LightDM (Русский)",
  "url": "https://wiki.archlinux.org/title/LightDM_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Экранный менеджер\n- GDM\n- LXDM (Русский)\n\nLightDM это кросс-десктопный Экранный менеджер. Главные особенности:\n\n- Кросс-десктопный - поддерживает различные технологии рабочего стола.\n- Поддерживает различные технологии отображения (X, Wayland, Mir, ...).\n- Легковесный - низкое потребление памяти и высокая производительность.\n- Поддержка гостевых сессий.\n- Поддержка удаленного входа (входящий - XDMCP, VNC, исходящий - XDMCP, PAM).\n- Комплексный набор тестов.\n- Низкая сложность кода.\n\nБолее подробную информацию о проекте LightDM можно найти здесь.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите lightdm.\n\n"
    },
    {
      "title": "Greeter (Экран приветствия/входа в систему)",
      "level": 3,
      "content": "Возможно вы хотите установить Экран приветствия. Экран приветствия представляет собой графический интерфейс, который предлагает пользователю ввести учетные данные, выбрать сеанс, и так далее. Можно использовать LightDM без Экрана приветствия, но только с настроеным автоматическим входом; в противном случае вам нужно установить xorg-server и какой-нибудь экран приветствия из перечисленных ниже.\n\nОфициальные репозитории содержат следующие экраны приветствия:\n\n- lightdm-gtk-greeter: Это экран приветствия по умолчанию, который LightDM пытается использовать, если в настройках не выбран какой-то другой.\n- lightdm-deepin-greeter (deepin-session-shell): Экран приветствия из проекта Deepin.\n- lightdm-pantheon-greeter: Экран приветствия из проекта elementary OS.\n- lightdm-slick-greeter: Основанный на GTK экран приветствия, сосредоточенный на внешнем виде сильнее чем lightdm-gtk-greeter; является форком lightdm-unity-greeterAUR[ссылка недействительна: package not found] и экраном по умолчанию в Linux Mint.\n- lightdm-webkit2-greeter: Экран приветствия, который использует Webkit2 для тем. Он заменяет lightdm-webkit-greeter.\n- lightdm-webkit-theme-litarvan: Современная и полнофункциональная тема Webkit2 LightDM.\n\nВ AUR доступны дополнительные экраны приветствия:\n\n- lightdm-unity-greeterAUR[ссылка недействительна: package not found]: Экран приветствия используемый Unity.\n- lightdm-mini-greeterAUR: Минималистичный настраиваемый однопользовательский экран приветствия.\n- lightdm-webkit-theme-aetherAUR: Элегантный и понятный экран приветствия с темой Arch Linux, написанный на основе lightdm и lightdm-webkit2-greeter.\n- lightdm-elephant-greeter-gitAUR: Небольшой и простой экран приветствия, по умолчанию запускается в Wayland-композиторе cage.\n- web-greeterAUR: Современный, привлекательный экран приветствия использует PyQtWebEngine для оформления. Он заменяет lightdm-webkit2-greeter.\n\nВы можете установить Экран приветствия по умолчанию, путём изменения раздела [Seat:*] в файле настроек LightDM, например:\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[Seat:*]\n...\ngreeter-session=lightdm-вашэкран-greeter\n...\n```\n\nКаждый файл .desktop в каталоге /usr/share/xgreeters представляет доступный Экран приветствия. В этом примере доступны Экраны приветствия lightdm-gtk-greeter и lightdm-webkit2-greeter:\n\n```\n$ ls -1 /usr/share/xgreeters/\nlightdm-gtk-greeter.desktop\nlightdm-webkit2-greeter.desktop\n```\n\n"
    },
    {
      "title": "Включение LightDM",
      "level": 2,
      "content": "Убедитесь в том что вы включили lightdm.service, чтобы LightDM запускался при загрузке. Смотрите также Экранный менеджер#Запуск экранного менеджера.\n\n"
    },
    {
      "title": "Инструмент командной строки",
      "level": 2,
      "content": "LightDM предлагает инструмент командной строки, dm-tool, который может быть использован для блокировки текущего места, переключения сеансов и т.д., что полезно в «минималистских» оконных менеджерах и для тестирования. Чтобы увидеть список доступных команд, выполните следующую команду:\n\n```\n$ dm-tool --help\n```\n\n"
    },
    {
      "title": "Переключение пользователей",
      "level": 3,
      "content": "Команда LightDM dm-tool может быть использована для входа нескольких пользователей в отдельные TTY. Приведённая ниже команда посылает запрос на блокировку текущей сессии и переключается на экран приветствия LightDM, что позволяет другому пользователю войти в систему.\n\n```\n$ dm-tool switch-to-greeter\n```\n\n"
    },
    {
      "title": "Тестирование",
      "level": 2,
      "content": "Установите xorg-server-xephyr из официальных репозиториев.\n\nЗатем запустите LightDM как приложение X:\n\n```\n$ lightdm --test-mode --debug\n```\n\n"
    },
    {
      "title": "Дополнительные настройки",
      "level": 2,
      "content": "LightDM может быть настроен редактированием его файла конфигурации /etc/lightdm/lightdm.conf.\n\nНекоторые Экраны приветствия имеют свои собственные файлы настроек. Например:\n\nlightdm-gtk-greeter: /etc/lightdm/lightdm-gtk-greeter.conf (или можно использовать графический инструмент lightdm-gtk-greeter-settings).\n\nlightdm-webkit2-greeter: /etc/lightdm/lightdm-webkit2-greeter.conf\n\n"
    },
    {
      "title": "X session wrapper",
      "level": 3,
      "content": "Если вы мигрируете с xinit, то заметите, что сессия запущена не вашим shell. Это происходит, потому что не shell запускает сессию (и наследуются переменные вашего shell), а LightDM запускает сессию и не использую ваш шелл shell. LightDM запускает сессию с помощью скрипта и после этого графическое окружение. По умолчанию используется /etc/lightdm/Xsession.\n\n"
    },
    {
      "title": "Переменные окружения",
      "level": 4,
      "content": "Скрипт проверяет и использует /etc/profile, ~/.profile, /etc/xprofile и ~/.xprofile в указанном порядке. Если вы используете shell которые не использует эти файлы, то можете создать ~/.xprofile. (В этом примере используется zsh)\n\n```\n~/.xprofile\n```\n\n```\n#!/bin/sh\n[ -f ~/.config/zsh/.zshenv ] && . ~/.config/zsh/.zshenv\n```\n\nЕсли имеются переменные shell которые важны для вашей сессии (например Gtk или QT темы, расположение GNUPG, изменения в конфигурации, и т.д.) это позволит графическому окружению получить доступ к переменным окружения shell.\n\n"
    },
    {
      "title": "Keymap",
      "level": 4,
      "content": "Скрипт запускает Xkbmap с аргументами указанными в файлах /etc/X11/Xkbmap, ~/.Xkbmap. Если эти файлы не найдены, запускается xmodmap с /etc/X11/Xmodmap, ~/.Xmodmap. Если используется xkbmap, файлы обрабатываются при помощи cat. Пример:\n\n```\n~/.Xmodmap\n```\n\n```\n-model pc105 -layout us,us,tr -variant ,dvorak,f -option grp:caps_toggle\n```\n\nИначе, сессия наследует системные настройки X11. Эти настройки могут быть указаны в конфигурационных файлах xorg вручную или с помощью localectl set-x11-keymap. Смотрите Xorg/Keyboard configuration#Setting keyboard layout.\n\n"
    },
    {
      "title": "Несколько раскладок клавиатуры в lightdm-gtk-greeter",
      "level": 4,
      "content": "Чтобы включить возможность выбора настроенных раскладок клавиатуры на экране приветствияоткройте выпадающее меню и настройте раскладки. Также можно использовать графический lightdm-gtk-greeter-settings или откорректировать файл вручную:\n\n```\n/etc/lightdm/lightdm-gtk-greeter.conf\n```\n\n```\n[greeter]\nindicators = ~host;~spacer;~clock;~spacer;~layout;~language;~session;~a11y;~power\n```\n\nИспользуйте localectl, чтобы установить несколько раскладок, например de и его “вариант” neo с последней как основной:\n\n```\n# localectl --no-convert set-x11-keymap de,de pc105 neo,\n```\n\nОбратите внимание на запятую в конце, которая подразумевает пустой вариант для второго de.\n\n"
    },
    {
      "title": "Изменение фонового изображения/цветов",
      "level": 3,
      "content": "Вы можете установить фон в шестнадцатеричном формате цвета или изображение. Некоторые экраны приветствия предоставляют более расширенные параметры для фона, например выбор фона на экране входа, случайное изображение, и т.д.\n\n"
    },
    {
      "title": "Экран приветствия GTK",
      "level": 4,
      "content": "Можете воспользоваться программой с графическим интерфейсом lightdm-gtk-greeter-settings.\n\nПользователям, желающим настроить обои на экране приветствия необходимо отредактировать /etc/lightdm/lightdm-gtk-greeter.conf и определить переменную background в секции [greeter]. Например:\n\n```\n/etc/lightdm/lightdm-gtk-greeter.conf\n```\n\n```\n[greeter]\nbackground=/usr/share/pixmaps/black_and_white_photography-wallpaper-1920x1080.jpg\n```\n\nТема GTK3 может быть указана в переменной theme-name в секции [greeter]. Тема для значков у курсора изменяются аналогично, как показано в примере:\n\n```\n/etc/lightdm/lightdm-gtk-greeter.conf\n```\n\n```\n[greeter]\ntheme-name = Tela\nicon-theme-name = Tela\ncursor-theme-name = Tela\ncursor-theme-size = 32\nfont-name = Cantarell 20\n```\n\n"
    },
    {
      "title": "Экран приветствия Webkit2",
      "level": 4,
      "content": "lightdm-webkit2-greeter позволяет выбрать обои непосредственно на экране приветствия. Также доступна возможность показывать случайное изображение при каждом запуске, если используете Material theme. По умолчанию, как источник обоев используется /usr/share/backgrounds. Вы можете изменить каталог с изображениями отредактировав lightdm-webkit2-greeter.conf. Например:\n\n```\n/etc/lightdm/lightdm-webkit2-greeter.conf\n```\n\n```\n[branding]\nbackground_images = /usr/share/backgrounds\n```\n\n"
    },
    {
      "title": "Экран приветствия Unity",
      "level": 4,
      "content": "Пользователи, использующие lightdm-unity-greeterAUR[ссылка недействительна: package not found] должны отредактировать /usr/share/glib-2.0/schemas/com.canonical.unity-greeter.gschema.xml файл, а затем выполнить:\n\n```\n# glib-compile-schemas /usr/share/glib-2.0/schemas/\n```\n\nВ соответствии с этой страницей.\n\n"
    },
    {
      "title": "Экран приветствия Slick",
      "level": 4,
      "content": "Используйте графический инструмент lightdm-settingsAUR.\n\n"
    },
    {
      "title": "Изменение аватара",
      "level": 3,
      "content": "Во-первых, убедитесь, что установлен пакет accountsservice из Официальных репозиториев, затем настройте его следующим образом, замените username на имя нужного пользователя.\n\n- Создайте PNG файл /var/lib/AccountsService/icons/username.png размером 96x96. Также доступны и другие форматы изображений, например JPEG.\n- Или создайте файл с изображением /home/username/.face и пропустите следующий шаг так как уже указан путь к каталогу пользователя.\n- Отредактируйте или создайте файл /var/lib/AccountsService/users/username и добавьте строки\n\n```\n[User]\nIcon=/var/lib/AccountsService/icons/username\n```\n\nИмя файла здесь указывает на изображение созданное в первом шаге, если необходимо измените и расширение файла.\n\n"
    },
    {
      "title": "Внедрение Arch-ориентированных 64x64 иконок",
      "level": 3,
      "content": "Пакет archlinux-artworkAUR содержит некоторые интересные примеры, которые устанавливаются в /usr/share/archlinux/icons и которые могут быть скопированы в /usr/share/icons/hicolor/64x64/devices следующим образом:\n\n```\n# find /usr/share/archlinux/icons -name \"*64*\" -exec cp {} /usr/share/icons/hicolor/64x64/devices \\;\n```\n\nПосле копирования, пакет archlinux-artworkAUR может быть удалён.\n\n"
    },
    {
      "title": "Включение автовхода",
      "level": 3,
      "content": "Отредактируйте файл настроек LightDM, раскомментируйте эти строки и правильно настройте:\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[Seat:*]\nautologin-user=username\n```\n\nВы должны быть в группе autologin, чтобы входить в систему автоматически без ввода пароля:\n\n```\n# groupadd -r autologin\n# gpasswd -a username autologin\n```\n\nLightDM производит вход в сессию указанную в ~/.dmrc пользователя для которого настроен автоматический вход. Чтобы обойти эти настройки, укажите autologin-session в lightdm.conf:\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[Seat:*]\nautologin-user=username\nautologin-session=session\n```\n\nСписок доступных имён сессий можно посмотреть в /usr/share/xsessions/*.desktop для X сессий и в /usr/share/wayland-sessions/*.desktop для Wayland.\n\n"
    },
    {
      "title": "Включение интерактивного беспарольного входа в систему",
      "level": 3,
      "content": "LightDM проходит через PAM, так что вы должны сконфигурировать lightdm настройки PAM:\n\n```\n/etc/pam.d/lightdm\n```\n\n```\n#%PAM-1.0\nauth        sufficient  pam_succeed_if.so user ingroup nopasswdlogin\nauth        include     system-login\n...\n```\n\nВы также должны входить в группу nopasswdlogin, чтобы получить возможность входа в систему в интерактивном режиме без ввода пароля:\n\n```\n# groupadd -r nopasswdlogin\n# gpasswd -a username nopasswdlogin\n```\n\nДля того, чтобы создать новую учётную запись пользователя, которая входит в систему автоматически и дополнительно имеет возможность снова войти в систему без пароля, пользователь может быть создан с помощью дополнительного участия в обеих группах и т.д .:\n\n```\n# useradd -mG autologin,nopasswdlogin -s /bin/bash username\n```\n\n"
    },
    {
      "title": "Гостевой вход",
      "level": 3,
      "content": "Чтобы включить поддержку гостевого входа в LightDM (без изменения настроек вашей системы) потребуется следующее:\n\n1. guest-account-script: по умолчанию guest-account и включает в себя две команды: add (для создания временного системного гостевого аккаунта, возвращает имя пользователя созданного аккаунта) remove имя аккаунта(для удаления указанного аккаунта)\n1. Наличие autologin группы в которую созданный гостевой аккаунт должен быть добавлен (см. /etc/pam.d/lightdm-autologin)\n\n- add (для создания временного системного гостевого аккаунта, возвращает имя пользователя созданного аккаунта)\n- remove имя аккаунта(для удаления указанного аккаунта)\n\nВ AUR доступны два пакета, которые включают гостевой вход в lightdm:\n\n- lightdm-guestAUR предоставляет (неизмененный) guest-session скрипт как и сам lightdm.\n- lightdm-guest-accountAUR предоставляет минимальную версию скрипта.\n\n"
    },
    {
      "title": "Скрытие системных пользователей и служб",
      "level": 3,
      "content": "Чтобы исключить системных пользователей из списка при входе в систему, установите дополнительную зависимость accountsservice или добавьте имя пользователя в /etc/lightdm/users.conf в секцию hidden-users. Первый вариант предпочтительнее, так как не нужно обновлять список при добавлении или удалении пользователей.\n\n"
    },
    {
      "title": "Миграция с SLiM",
      "level": 3,
      "content": "Переместите содержимое xinitrc в xprofile, удалите вызов запуска Оконного менеджера или Среды рабочего стола.\n\n"
    },
    {
      "title": "Вход с помощью ~/.xinitrc",
      "level": 3,
      "content": "Смотрите Display manager (Русский)#Использование ~/.xinitrc как сеанс.\n\n"
    },
    {
      "title": "NumLock включен по умолчанию",
      "level": 3,
      "content": "Установите пакет numlockx и отредактируйте /etc/lightdm/lightdm.conf:\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[Seat:*]\ngreeter-setup-script=/usr/bin/numlockx on\n```\n\n"
    },
    {
      "title": "Сессия по умолчанию",
      "level": 3,
      "content": "Lightdm, как и другие Экранные менеджеры, хранит последнюю выбранную сессию в ~/.dmrc. Для подробностей смотрите Display manager (Русский)#Настройка сеанса.\n\n"
    },
    {
      "title": "Экран приветствия GTK",
      "level": 4,
      "content": "Необходимо отредактировать /etc/lightdm/lightdm-gtk-greeter.conf и ввести значение в переменную position. Оно принимает значения x и y, как абсолютные (в пикселях), так и относительные (в процентах). Каждое значение может иметь дополнительное местоположение для привязки окна, start, center и end, которые отделяются от значения запятой.\n\nПример:\n\n```\nposition=200,start 50%,center\n```\n\n"
    },
    {
      "title": "VNC сервер",
      "level": 3,
      "content": "Lightdm также может использоваться для подключения через VNC. Установите пакет tigervnc на сервер и опционально как VNC-клиент на ПК клиента.\n\nНастройте пароль для аутентификации на сервере под root:\n\n```\n# vncpasswd /etc/vncpasswd\n```\n\nОтредактируйте конфигурационный файл LightDM как показано ниже. Имейте ввиду, что listen-address настраивает VNC на соединение только с localhost. Это используется для разрешения соединения только через SSH and port forwarding. Проверьте, что на клиенте SSH используется localhost:5900 for the tunnel destination; использование 127.0.0.1:5900 или ::1:5900 нереализуемо при сетевых подключениях с двойным стеком. Если хотите разрешить небезопасные соединения можете отключить эти настройки.\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[VNCServer]\nenabled=true\ncommand=Xvnc -rfbauth /etc/vncpasswd\nport=5900\nlisten-address=localhost\nwidth=1024\nheight=768\ndepth=24\n```\n\nТеперь откройте SSH туннель и подключитесь к localhost как описано в TigerVNC#On the client.\n\n"
    },
    {
      "title": "Блокировка экрана с помощью light-locker",
      "level": 3,
      "content": "light-locker простой блокировщик экрана для LightDM. После установки и корректного запуска, сеанс может быть заблокирован командой:\n\n```\n$ light-locker-command -l\n```\n\nНеобходимо, чтобы light-locker был запущен перед запуском вашей сессии. По умолчанию, это доступно через XDG Autostart. Дополнительную информацию смотри в разделе Autostarting.\n\n"
    },
    {
      "title": "Использование нескольких мониторов",
      "level": 3,
      "content": "Иногда LightDM некорректно устанавливает разрешение экрана при использовании нескольких мониторов. Следующая конфигурация Xorg работает с двумя мониторами: большой основной экран слева и меньший вторичный справа. Порядок может быть изменён и дополнен.\n\n```\n/etc/X11/xorg.conf.d/52-resolution-fix.conf\n```\n\n```\nSection \"Monitor\"\n    Identifier \"DP1\"\n    Option \"PreferredMode\" \"3840x2160\"\n    Option \"Primary\" \"1\"\nEndSection\nSection \"Monitor\"\n    Identifier \"eDP1\"\n    Option \"PreferredMode\" \"1920x1080\"\n    Option \"RightOf\" \"DP1\"\nEndSection\n```\n\nЭто делает параметр display-setup-script в /etc/lightdm/lightdm.conf избыточным.\n\n"
    },
    {
      "title": "Автоматический вход не работает",
      "level": 3,
      "content": "Убедитесь, что autologin-user= в /etc/lightdm/lightdm.conf содержит допустимое значение. Последующие пробелы также вызывают ошибки.\n\nЕсли автоматический вход приводит к пустому экрану или экран входа сразу возвращается, возможно необходимо установить logind-check-graphical=true.\n\nТакже можно установить lightdm-autologin-greeter-gitAUR для этой цели.\n\n"
    },
    {
      "title": "Просмотр текущей конфигурации",
      "level": 3,
      "content": "Для просмотра используемой конфигурации, запустите:\n\n```\n$ lightdm --show-config\n```\n\nБудут показаны текущие настройки, со ссылками на файлы в которых заданы эти настройки.\n\n"
    },
    {
      "title": "LightDM не запускается и моргает экран",
      "level": 3,
      "content": "Если вы столкнулись с миганием экрана, и в итоге LightDM не запускается, проверьте что вы определили Экран приветствия правильно, в файле настроек LightDM. И если вы правильно задали Экран приветствия GTK, убедитесь что xsessions-directory (по умолчанию: /usr/share/xsessions) существует и содержит по меньшей мере один файл .desktop.\n\nТа же ошибка может произойти при запуске Lightdm, когда последняя запускаемая сессия больше не доступна (например, когда вы последний раз использовали Gnome, а потом удалили пакет gnome-session): самый простой способ - временно восстановить удалённый пакет. Другое возможное решение:\n\n```\n# dbus-send --system --type=method_call --print-reply --dest=org.freedesktop.Accounts /org/freedesktop/Accounts/User1000 org.freedesktop.Accounts.User.SetXSession string:xfce\n```\n\nВ этом примере устанавливается сессия по умолчанию \"xfce\" для пользователя 1000.\n\n"
    },
    {
      "title": "Локаль неправильно отображается",
      "level": 3,
      "content": "В случае, если ваша локаль не отображается правильно LightDM, добавьте свой языковой стандарт в /etc/environment\n\n```\nLANG=ru_RU.utf8\n```\n\nЕсли вы хотите, чтобы LightDM и экраны приветствия использовали язык отличающийся от системного, можете использовать параметр Environment= в Systemd#Drop-in files.\n\n"
    },
    {
      "title": "Не отвечает в течение нескольких минут после запуска",
      "level": 3,
      "content": "Возможно, необходимо увеличить энтропию. Для этого установите и включите haveged. Подробнее о проблеме https://github.com/canonical/lightdm/issues/17\n\n"
    },
    {
      "title": "Отсутствуют иконки в Экране приветствия GTK",
      "level": 3,
      "content": "Если вы используете lightdm-gtk-greeter как Экран приветствия и видите \"заполнитель изображений\" в виде иконок, убедитесь что действующая тема значков установлена и задействована. Проверьте следующий файл:\n\n```\n/etc/lightdm/lightdm-gtk-greeter.conf\n```\n\n```\n[greeter]\ntheme-name=mate      # имя каталога из /usr/share/themes/\nicon-theme-name=mate # имя каталога из /usr/share/icons/\n```\n\n"
    },
    {
      "title": "LightDM зависает при попытке входа в систему",
      "level": 3,
      "content": "После ввода правильного имени пользователя и пароля, при попытке войти в систему, вы обнаруживаете что LightDM завис и вы не можете продолжить загрузку до Рабочего стола. Чтобы устранить эту проблему, переустановите пакет gdk-pixbuf2. Смотрите эту тему на форуме (Англ.).\n\n"
    },
    {
      "title": "LightDM отображается в неправильном мониторе",
      "level": 3,
      "content": "Если вы используете несколько мониторов, LightDM может отображаться в неправильном (например, если ваш основной монитор находится справа). Чтобы заставить экран LightDM отображаться на конкретном мониторе, отредактируйте /etc/lightdm/lightdm.conf и измените параметр display-setup-script, например:\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\ndisplay-setup-script=xrandr --output HDMI-1 --primary\n```\n\nЗамените HDMI-1 на ваш настоящий ID монитора, который можно найти с помощью результата вывода команды xrandr.\n\nЕсли используете экран приветствия GTK, можете отредактировать /etc/lightdm/lightdm-gtk-greeter.conf и добавить параметр active-monitor например:\n\n```\n/etc/lightdm/lightdm-gtk-greeter.conf\n```\n\n```\n[greeter]\nactive-monitor=0\n```\n\nЗамените 0 на необходимый номер монитора.\n\n"
    },
    {
      "title": "LightDM не отображается или отображается только вывод TTY",
      "level": 3,
      "content": "Может случиться так, что ваша система загружается так быстро, что служба LightDM запускается перед загрузкой графического драйвера. Если это ваш случай, добавьте следующие настройки в файл lightdm.conf:\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[LightDM]\nlogind-check-graphical=true\n```\n\nЭтот параметр заставит LightDM ждать, пока графический драйвер не будет готов перед запуском сессии Экранного приветствия/автозапуска.\n\n"
    },
    {
      "title": "LightDM запускается с маленьким FPS на Intel Graphics",
      "level": 3,
      "content": "Смотрите Intel graphics#AccelMethod.\n\n"
    },
    {
      "title": "Pulseaudio не запускается автоматически",
      "level": 3,
      "content": "Смотрите PulseAudio (Русский)#Запуск.\n\n"
    },
    {
      "title": "Большая задержка перед загрузкой LightDM при зашифрованном HOME",
      "level": 3,
      "content": "Некоторые темы LightDM пытаются получить доступ к пользовательскому аватару расположенному в HOME. Если ваш HOME зашифрован, LightDM не может получить доступ к нему. Чтобы исправить ситуацию, сделайте следующее:\n\n- Установите ваш аватар в соответствии с #Изменение аватара\n- Только для lightdm-gtk-greeter: hide-user-image = true в /etc/lightdm/lightdm-gtk-greeter.conf\n\n"
    },
    {
      "title": "Загрузка останавливается на \"[ OK ] Reached target Graphical Interface.\"",
      "level": 3,
      "content": "Возможно, что обзор пользователя и группы не удаётся, в случае если вы изменили /etc/nsswitch.conf. Это случается когда nsswitch.conf группа: включает ldap без настроек nss_initgroups_ignoreusers ALLLOCAL в /etc/nslcd.conf\n\n"
    },
    {
      "title": "Сессия Wayland не работает с дублирующимися записями GNOME",
      "level": 3,
      "content": "Некоторые экраны приветствия (lightdm-webkit2-greeter например) не поддерживает две сессии с одинаковым именем [1]. Для проверки на дублирующиеся записи выполните:\n\n```\n$ ls -1 /usr/share/wayland-sessions /usr/share/xsessions\n```\n\nПереименуйте дублирующиеся записи в /usr/share/xsessions. Например:\n\n```\n# mv /usr/share/xsessions/gnome.desktop /usr/share/xsessions/gnome.desktop.disabled\n```\n\n"
    },
    {
      "title": "Первая попытка входа всегда завершается ошибкой",
      "level": 3,
      "content": "Укажите hostname как описано в Настройка сети. Также смотрите FS#47694.\n\n"
    },
    {
      "title": "Бесконечный цикл при входе",
      "level": 3,
      "content": "Если вы попали в замкнуты круг в котором вводите корректные имя пользователя и пароль, но экран чернеет и вы возвращаетесь на экран входа после каждой попытки. Удаление командой rm ~/.Xauthority (проблемного пользовательского файла .Xauthority) может решить проблему.\n\nДругой причиной может быть, что вы заменили файл \"lightdm.conf\" для сброса настроек и в нём отсутствует строка:\n\n```\nsession-wrapper=/etc/lightdm/Xsession\n```\n\nВ этом случае, lightdm пытается использовать \"lightdm-session\" в качестве session-wrapper, которая отсутствует в Arch Linux.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Статья на Ubuntu Wiki\n- Gentoo:LightDM\n- Страница на Launchpad\n- https://wiki.ubuntu.com/MattFischer\n- LightDM на GitHub\n\n"
    }
  ]
}