{
  "title": "Limits.conf (Русский)",
  "url": "https://wiki.archlinux.org/title/Limits.conf_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Перевод этой статьи или раздела не отражает оригинальное содержание.** Перевод этой статьи или раздела не отражает оригинальное содержание.\n\nПеревод этой статьи или раздела не отражает оригинальное содержание.\n\nRelated articles\n\n- cgroups\n- Security\n\n/etc/security/limits.conf позволяет устанавливать ограничения на ресурсы для пользователей, вошедших в систему через PAM. Это полезный способ предотвратить, например fork-bombs от использования всех системных ресурсов.\n\n"
    },
    {
      "title": "Синтаксис",
      "level": 2,
      "content": "Файл по умолчанию хорошо прокомментирован, но дополнительную информацию можно получить, просмотрев страницу limits.conf(5) man page.\n\n"
    },
    {
      "title": "core",
      "level": 3,
      "content": "Corefiles полезны для отладки, но раздражают при обычном использовании системы. Вам следует установить мягкое ограничение 0 и жесткое ограничение неограниченное, а затем временно повышать ограничение для текущей оболочки с помощью ulimit -c unlimited когда вам нужны corefiles для отладки.\n\n```\n*           soft    core       0           # Запретить генерировать corefiles по умолчанию.\n*           hard    core       unlimited   # Позволяет временно включать core файлы.\n```\n\n"
    },
    {
      "title": "nice",
      "level": 3,
      "content": "Вы должны запретить всем, кроме root, иметь процессы с минимальной доброжелательностью (-20), чтобы root мог исправить неотзывчивую систему.\n\n```\n*           hard    nice       -19         # Запретитm пользователям, не являющимся root-пользователями, запускать процесс с минимальным значением.\nroot        hard    nice       -20         # Позволяет root запустить процесс на минимальном уровне, чтобы исправить ситуацию, когда система не реагирует на запросы.\n```\n\n"
    },
    {
      "title": "nofile",
      "level": 3,
      "content": "Это ограничивает количество файловых дескрипторов, которые могут быть открыты в любой момент времени у процесса, принадлежащего указанному домену. Вам может потребоваться увеличить это значение до 8192 для работы некоторых игр. Некоторые приложения баз данных, такие как MongoDB или Apache Kafka, рекомендуют устанавливать nofile на 64000 или 128000[1].\n\n```\n*           hard    nofile     65535\n*           soft    nofile      8192        # Требуется для запуска некоторых игр.\n```\n\n"
    },
    {
      "title": "nproc",
      "level": 3,
      "content": "Ограничение nproc очень важно, поскольку оно ограничивает количество раз, которое может повторить бомба-вилка. Однако слишком низкое значение может сделать вашу систему нестабильной или даже непригодной для использования, поскольку новые процессы не смогут создаваться.\n\nЗначение 300 слишком мало даже для самых минимальных Window-менеджеров, чтобы запустить больше нескольких настольных приложений и демонов, но часто подходит для серверов без X (на самом деле, 300 это значение, которое факультет компьютерных наук Университета Джорджии использовал для ограничения процессов для студентов на своих Linux-серверах в 2017 году).\n\nВот пример ограничения nproc для всех пользователей системы:\n\n```\n*           hard    nproc      2048        # Не позволяйте вилочным бомбам вывести систему из строя.\n```\n\nОбратите внимание, что это значение 2048 всего лишь пример, и вам может понадобиться установить более высокое значение. С другой стороны, вы можете обойтись и более низким значением.\n\nКакое бы значение nproc вы ни установили, не забудьте разрешить пользователю root создавать столько процессов, сколько он захочет; в противном случае вы можете сделать систему неработоспособной, установив обычный лимит nproc слишком низким. Обратите внимание, что эта строка должна идти после глобального hardlimit, а значение ниже (65536) является произвольным.\n\n```\nroot        hard    nproc      65536       # Предотвращение того, что root не может запустить достаточное количество процессов.\n```\n\n"
    },
    {
      "title": "приоритет",
      "level": 3,
      "content": "Обычно по умолчанию \"niciness\" должен быть равен 0, но вы можете установить для отдельных пользователей и групп разные приоритеты по умолчанию с помощью этого параметра.\n\n```\n*           soft    priority   0           # Установите приоритет по умолчанию на нейтральную niceness.\n```\n\n"
    }
  ]
}