{
  "title": "Linux console (Русский)",
  "url": "https://wiki.archlinux.org/title/Linux_console_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Конфигурация клавиатуры в консоли\n- Screen capture#Virtual console\n- Color output in console\n- getty\n\nВыписка из Википедии:\n\nДанная статья описывает основы консоли Linux и как настроить отображения шрифтов. Настройка клавиатуры описана в подстранице Конфигурация клавиатуры в консоли.\n\n"
    },
    {
      "title": "Реализация",
      "level": 2,
      "content": "Консоль, в отличии от сервисов которые взаимодействуют с пользователем напрямую, является частью ядра системы. Это отличает ее от эмуляторов терминала, таких как xterm (Русский), которые реализованы на уровне пользовательского пространства и являются обычными приложениями. Консоль оставалась компонентом ядра Linux, но имела заметные изменения, такие как графический вывод (framebuffer) и поддержка Юникода.\n\nНе смотря на все усовершенствования консоли, она до сих пор имеет полную обратную совместимость с прежним оборудованием, ограниченным в своих возможностях по сравнению с графическими эмуляторами терминала.\n\n"
    },
    {
      "title": "Виртуальные консоли",
      "level": 3,
      "content": "Консоль в представлении пользователя это набор виртуальных консолей. Они создают впечатление параллельной работы нескольких терминалов: в каждую из виртуальных консолей могут быть залогинены разные пользователи. Они могут работать в своих оболочках и иметь собственные настройки шрифтов. Каждая консоль использует устройство /dev/ttyX и вы можете переключится между ними сочетанием клавиш Alt+FX, где X номер виртуальной консоли начиная с 1. Устройство /dev/console автоматически привязывается к активной виртуальной консоли.\n\nПодробнее смотреть chvt(1), openvt(1) и deallocvt(1).\n\n"
    },
    {
      "title": "Текстовый режим",
      "level": 3,
      "content": "Изначально Linux был создан как ядро для управления оборудованием ПК, консоль была разработана по стандартам IBM CGA/EGA/VGA, которые поддерживали на тот момент все ПК. Графические возможности, предоставляемые этим стандартом предоставляли простое отображение 80*25 сетки символов с поддержкой 16 цветов. Этот устаревший режим был похож на принцип работы текстовых терминалов, таких как VT100. Все еще существует возможность загрузиться в текстовом режиме, если оборудование поддерживает его, но большинство современных дистрибутивов (в том числе Arch Linux) используют framebuffer консоль.\n\n"
    },
    {
      "title": "Framebuffer консоль",
      "level": 3,
      "content": "Так как Linux был портирован на различные архитектуры, которые не использовали VGA-совместимых графических адаптеров и не поддерживали текстовый режим, требовалась другая реализация. Framebuffer консоль была разработана для предоставления стандартной консоли среди всех доступных платформ и представляла собой VGA-подобный интерфейс независимый от используемого графического оборудования. Таким образом, консоль Linux - это не эмулятор терминала, а сам по себе терминал. Она использует тип терминала linux и в значительной мере совместима с VT100.\n\n"
    },
    {
      "title": "Горячие клавиши",
      "level": 2,
      "content": "Table content:\nГорячие клавиши | Описание\nCtrl+Alt+Del | Перезапускает систему (указанно символической ссылкой /usr/lib/systemd/system/ctrl-alt-del.target)\nAlt+F1, F2, F3, ... | Переключает на n-ую виртуальную консоль\nAlt+ ← | Переключает на предыдущую виртуальную консоль\nAlt+ → | Переключает на следующую виртуальную консоль\nScroll Lock | Когда Scroll Lock активен, ввод и вывод заблокированы\nCtrl+c | Закрывает текущую задачу\nCtrl+d | Вставляет EOF\nCtrl+z | Прерывает текущую задачу\n\nПодробнее смотреть console_codes(4).\n\n"
    },
    {
      "title": "Шрифты",
      "level": 2,
      "content": "По стандарту, виртуальная консоль использует встроенный в ядро шрифт с набором символов CP437 [1], но это можно изменить.\n\nLinux консоль по умолчанию использует кодирование UTF-8, но из-за особенностей VGA-совместимого framebuffer, консольный шрифт ограничен стандартными 256 или 512 глифами. Если в шрифте более чем 256 глифов, то количество цветов уменьшается с 16 до 8. Для корректного отображения нужного символа требуется специальная карта трансляции, называемая unimap. В настоящее время большинство консольных шрифтов имеют встроенную unimap, но исторически она загружалась отдельно.\n\nПакет kbd предоставляет инструменты для смены шрифта и его отображения в виртуальной консоли. Доступные шрифты находятся в директории /usr/share/kbd/consolefonts/. Шрифты с расширением .psfu или .psfu.gz имеют встроенную карту трансляций Юникод.\n\nСписки раскладок, являющиеся связью между нажатой клавишей и символом используемым системой, находятся в директории /usr/share/kbd/keymaps/, подробности смотрите на странице Конфигурация клавиатуры в консоли.\n\n"
    },
    {
      "title": "Предпросмотр и временные изменения",
      "level": 3,
      "content": "```\n$ showconsolefont\n```\n\nПоказывает таблицу глифов или символов шрифта.\n\nsetfont временно меняет шрифт, если команде передано имя шрифта (находящегося в директории /usr/share/kbd/consolefonts/), например:\n\n```\n$ setfont lat2-16 -m 8859-2\n```\n\nСогласно ISO 8859 для кириллических раскладок используем кодировку 8859-5. Например, кириллический шрифт terminus:\n\n```\n$ setfont ter-v32b -m 8859-5\n```\n\nНазвание шрифта чувствительно к регистру. Без параметров setfont возвращает консоли стандартный шрифт.\n\nДля смены на маленький шрифт размера 8x8, можете использовать данный шрифт:\n\n```\n$ setfont -h8 /usr/share/kbd/consolefonts/drdos8x8.psfu.gz\n```\n\nДля большого шрифта, можете рассмотреть шрифт terminus-font, он доступен в различных размерах. Например ter-132n.\n\n"
    },
    {
      "title": "Постоянные изменения",
      "level": 3,
      "content": "Переменная FONT в /etc/vconsole.conf используется для применения шрифта при загрузке системы для всех консолей. Смотрите vconsole.conf(5) для деталей.\n\nДля отображения символов Č, ž, đ, š or Ł, ę, ą, ś используйте шрифт lat2-16.psfu.gz:\n\n```\n/etc/vconsole.conf\n```\n\n```\n...\nFONT=lat2-16\nFONT_MAP=8859-2\n```\n\nВторая часть набора символов ISO/IEC 8859 будет размера 16. Вы можете поменять размер шрифта используя другие значения (например lat2-08). Для регионов определяемых спецификацией ISO 8859, смотрите Части ISO 8859\n\nДля использования шрифта в пользовательском пространстве при загрузке системы используйте хук consolefont в /etc/mkinitcpio.conf. Смотрите mkinitcpio (Русский)#HOOKS для подробностей.\n\nЕсли шрифт не применяется после загрузки системы, или изменения временные, то скорее всего шрифт сбрасывается когда графический драйвер инициализируется и консоль меняется на framebuffer. Как решение, загружайте графический драйвер раньше, для примера смотрите Kernel mode setting (Русский)#Ранний запуск KMS, [2] или другими способами сделайте загрузку framebuffer перед применением /etc/vconsole.conf.\n\n"
    },
    {
      "title": "HiDPI",
      "level": 2,
      "content": "Смотрите HiDPI#Linux console (tty).\n\n"
    },
    {
      "title": "Звуковые сигналы",
      "level": 2,
      "content": "Смотреть Динамик ПК#Beep.\n\n"
    },
    {
      "title": "Смотреть также",
      "level": 2,
      "content": "- The TTY demystified – Linus Åkesson\n\n"
    }
  ]
}