{
  "title": "Lisp package guidelines (Italiano)",
  "url": "https://wiki.archlinux.org/title/Lisp_package_guidelines_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\n"
    },
    {
      "title": "Introduzione",
      "level": 2,
      "content": "Attualmente ci sono relativamente pochi pacchetti lisp disponibili nei repository di Arch. Questo significa che prima o poi, probabilmente, se ne aggiungeranno altri. E' dunque utile pensare, adesso che ce ne sono pochi, a come dovrebbero essere pacchettizzati. Questa pagina vuole essere un punto di riferimento sulle linee guida per i pacchetti lisp. E' bene comunque tenere a mente che questa non è una versione definitiva; se non siete d'accordo con alcune idee suggerite qui, sentitevi liberi di modificare la pagina e proporre qualcosa di migliore.\n\n"
    },
    {
      "title": "Struttura delle cartelle e nomi",
      "level": 2,
      "content": "C'è almeno un pacchetto nel repository base (libgpg-errpor) che include dei file lisp, che sono posizionati in /usr/share/common-lisp/source/gpg-error. Per conformità, gli altri pacchetti lisp dovrebbero installare i propri files in /usr/share/common-lisp/source/. Ogni pacchetto dovrebbe avere la propria cartella, in modo da non creare disordine in questa cartella di base.\n\nLa cartella del pacchetto dovrebbe avere lo stesso nome del pacchetto lisp, e non dovrebbe essere nominata come nel repository Arch (o AUR). Questo si applica anche ai pacchetti costituiti soltanto da un file.\n\nAd esempio, un pacchetto Lisp chiamato cl-ppcre dovrebbe essere nominato cl-ppcre in AUR e risiedere in /usr/share/common-lisp/source/cl-ppcre. Un pacchetto chiamato alexandria dovrebbe essere nominato cl-alexandria in AUR e risiedere in in /usr/share/common-lisp/source/alexandria.\n\n"
    },
    {
      "title": "ASDF",
      "level": 2,
      "content": "Cercare di evitare l'utilizzo di ASDF-Install per l'installazione di questi pacchetti di sistema.\n\nASDF può essere necessario o utile per la compilazione e/o il caricamento di pacchetti. In questo caso, è consigliabile che la cartella usata per il registro centrale (la posizione di tutti i link simbolici a *.asd) sia /usr/share/common-lisp/systems/.\n\nSono stati riscontrati problemi effettuando la compilazione con asdf come parte del processo di compilazione di un pacchetto. Si può risolvere attraverso l'uso di un file package.install di questo tipo:\n\n```\n# cl-ppcre.install\n# arg 1:  the new package version\npost_install() {\n    echo \"---> Compiling lisp files <---\"\n\n    clisp --silent -norc -x \\\n        \"(load #p\\\"/usr/share/common-lisp/source/asdf/asdf\\\") \\\n        (pushnew #p\\\"/usr/share/common-lisp/systems/\\\" asdf:*central-registry* :test #'equal) \\\n        (asdf:operate 'asdf:compile-op 'cl-ppcre)\"\n\n    echo \"---> Done compiling lisp files <---\"\n\n    cat << EOM\n\n    To load this library, load asdf and then place the following lines\n    in your ~/.clisprc.lisp file:\n\n    (push #p\"/usr/share/common-lisp/systems/\" asdf:*central-registry*)\n    (asdf:operate 'asdf:load-op 'cl-ppcre)\nEOM\n}\n\npost_upgrade() {\n    post_install $1\n}\n\npre_remove() {\n    rm /usr/share/common-lisp/source/cl-ppcre/{*.fas,*.lib}\n}\n\nop=$1\nshift\n\n$op $*\n```\n\nNaturalmente, per far funzionare questo esempio, è necessario avere un link simbolico a package.asd nella cartella di sistema di asdf. Durante la compilazione del pacchetto, questo dovrebbe risolvere...\n\n```\npushd ${_lispdir}/systems\nln -s ../source/cl-ppcre/cl-ppcre.asd .\nln -s ../source/cl-ppcre/cl-ppcre-test.asd .\npopd\n```\n\n...dove $_lispdir è ${startdir}/pkg/usr/share/common-lisp. Creando un link con un path relativo piuttosto che assoluto, è possibile garantire che il link rimanga valido anche dopo l'installazione.\n\n"
    },
    {
      "title": "Packaging per versioni specifiche di Lisp",
      "level": 2,
      "content": "Quando possibile, non creare pacchetti relativi ad una singola implementazione di lisp, cercare di essere indipendenti dall piattaforma per quanto il pacchetto lo permetta. Se, nonostante tutto, il pacchetto è specificatamente pensato per una singola implementazione di lisp (ad esempio, gli sviluppatori non hanno ancora aggiunto il supporto per altre implementazioni, o il pacchetto è stato sviluppato per fornire una funzionalità già presente in altre implementazioni), è corretto fare il proprio pacchetto Arch specifico per una particolare implementazione di lisp.\n\nPer evitare di creare pacchetti specifici per una particolare implementazione, idealmente i pacchetti relativi a tutte le implementazioni (SBCL, cmucl, clisp) dovrebbero essere creati con il campo del PKGBUILD common-lisp. Comunque, non è il caso (e questo potrebbe creare problemi alla persone che preferiscono avere implementazioni multiple di lisp a portata di mano). Allo stesso tempo, si potrebbe (a) non rendere il proprio pacchetto dipendente da nessun lisp e includere nel package.install un messaggio che richieda l'installazione di lisp (non ottimale) opppure (b) seguire l'esempio del PKGBUILD di sbcl e includere un controllo condizionale per capire quale lisp è necessario (che è una soluzione complessa e, ancora, non ottimale). Altre idee sono le benvenute.\n\nC'è anche da notare che se ASDF è necessario per installare/compilare/caricare il pacchetto le cose possono potenzialmente diventare più complicate a causa delle dipendenze, dal momento che SBCL viene fornito con asdf, clisp no ma c'è un pacchetto in AUR, e CMUCL potrebbe o meno fornirlo. (Purtroppo l'autore di questa pagina non conosce praticamente niente di CMUCL; mi dispiace).\n\nLe persone che stanno attualmente mantenendo dei pacchetti lisp relativi ad una particolare implementazione di lisp ma che non necessitano di una particolare implementazione per funzionare potrebbero considerare di fare almeno una delle seguenti cose:\n\n- Modificare i propri PKGBUILD(s) per essere indipendenti dalla piattaforma, assicurandosi che qualcun'altro che non stia già mantenendo lo stesso pacchetto per un'implementazione diversa.\n\n- Offrirsi di farsi carico o aiutare con il mantenimento di versioni dello stesso pacchetto anche per altre implementazioni di lisp e combinarle in un unico pacchetto\n\n- Offire il proprio pacchetto al maintainer di una versione dello stesso pacchetto per un'altra implementazione, in modo da permettergli di combinarle in un unico pacchetto.\n\n(Notare che joyfulgirl, l'autrice di questo documento, che attualmente mantiene le versioni per clisp di cl-ppcre e stumpwm; è disponibile sia a donare questi pacchetti ai maintainer delle versioni SBCL oppure mantenere la nuova versione indipendente dalla piattaforma da sola se i maintainer delle versione SBCL non se ne vogliono fare carico)\n\n"
    },
    {
      "title": "Cose che l'utente può fare",
      "level": 2,
      "content": "- Mantenere pacchetti lisp seguendo queste linee-guida.\n- Aggiornare e correggere queste linee-guida\n- Seguire i cambiamenti di questa pagina\n- Fornire (educatamente) consigli, pareri e suggerimenti sia su questo documento che sul lavoro delle persone\n- Tradurre questa pagina e futuri aggiornamenti a questa pagina.\n\n"
    }
  ]
}