{
  "title": "List of Applications/Documents (简体中文)",
  "url": "https://wiki.archlinux.org/title/List_of_Applications/Documents_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)",
  "sections": [
    {
      "title": "Text editors",
      "level": 2,
      "content": "See also Wikipedia:Comparison of text editors.\n\nSome of the lighter-weight Integrated development environments can also serve as text editors.\n\n"
    },
    {
      "title": "Console",
      "level": 3,
      "content": "- dte — Small, easy to use editor with multi-tabbed interface, syntax highlighting, ctags navigation, etc.\n\n- e3 — Tiny editor without dependencies, written in assembly.\n\n- ed — A POSIX-compliant line-oriented text editor. Useful for shell scripts, less so for manual usage. Original editor for Unix.\n\n- ee — Classic curses-based text editor. Born in HP-UX, used in FreeBSD.\n\n- JED — Text editor that makes extensive use of the S-Lang library. Includes a console version (jed) and an X-window version (xjed).\n\n- JOE (Joe's Own Editor) — Terminal-based text editor designed to be easy to use.\n\n- mcedit — Useful text editor that comes with Midnight Commander file manager.\n\n- micro — Modern and intuitive terminal-based text editor, written in go and extensible through plugins.\n\n- Minimum Profit — Text editor for programmers.\n\n- nano — Console text editor based on pico with on-screen key bindings help.\n\n- ne — Minimalist text editor with Windows-like key-bindings.\n\n- Tilde — Intuitive text editor with Windows-like key bindings.\n\n"
    },
    {
      "title": "Emacs-style text editors",
      "level": 3,
      "content": "- Emacs — The extensible, customizable, self-documenting real-time display editor by GNU.\n\n- jove — Jonathan's Own Version of Emacs is an Emacs-like editor without Lisp.\n\n- mg — Small, fast, and portable Emacs-like editor.\n\n- vile — Lightweight Emacs clone with vi-like key bindings.\n\n- Zile — Lightweight Emacs clone.\n\n"
    },
    {
      "title": "Vi-style text editors",
      "level": 3,
      "content": "- Amp — Text editor written in Rust, that aims to take the core interaction model of Vim, simplify it, and bundle in the essential features required for a modern text editor.\n\n- Aretext — Minimalist text editor with Vim-compatible key bindings.\n\n- BusyBox vi — A small vi clone. Can be invoked with busybox vi.\n\n- Elvis — A vi clone with optional X support.\n\n- Kakoune — Modal editor. Fewer keystrokes. Selection based, multi-cursor editing. Orthogonal design.\n\n- Helix — A post-modern modal text editor.\n\n- Neovim — Vim rebirth for the 21st century.\n\n- Neovim-Qt — Qt GUI for Neovim.\n\n- vi — The original ex/vi text editor.\n\n- Vim (Vi IMproved) — Is included as vi with most UNIX systems.\n\n- Vis — Modern, legacy free, simple yet efficient Vim-like editor.\n\n"
    },
    {
      "title": "Graphical",
      "level": 3,
      "content": "- Acme — Minimalist and flexible programming environment developed by Rob Pike for the Plan 9 operating system.\n\n- Adie — Fast and convenient programming text editor.\n\n- Beaver — GTK editor designed to be modular, lightweight and stylish.\n\n- CorePad — Simple lightweight but powerful text editor with syntax-highlighting support for a dozen or more languages. Part of C-Suite.\n\n- Deepin Text Editor — Simple text editor for Deepin desktop.\n\n- Ecrire — Simple text editor based on EFL.\n\n- FeatherPad — Minimal Qt5 plain text editor featuring a native dark theme and support for tabs, printing and syntax highlighting.\n\n- FLTK Editor — Simple text editor application for FLTK.\n\n- gCSVedit — Simple text editor for CSV, TSV and other kinds of delimiter-separated values (DSV) files.\n\n- gedit — GTK editor for the GNOME desktop with syntax highlighting, automatic indentation, matching brackets, etc., and a number of add-ons to increase functionality. Part of gnome-extra.\n\n- GNOME Text Editor — Simple text editor for GNOME focused on a pleasing default experience. Part of gnome.\n\n- Gobby — Collaborative editor supporting multiple documents in one session and a multi-user chat.\n\n- Howl — General purpose, fast and lightweight editor with a keyboard-centric minimalistic user interface.\n\n- jEdit — Text editor for programmers, written in Java.\n\n- Kate — Full-featured programmer's editor for the KDE desktop with MDI and a filesystem browser. Part of kde-utilities.\n\n- KWrite — Lightweight text editor for the KDE desktop that uses the same editor widget as Kate, now provided by the kate package. Part of kde-utilities.\n\n- L3afpad — Simple text editor forked from Leafpad, supports GTK 3.\n\n- Lapce — Lightning-fast and Powerful Code Editor written in Rust.\n\n- Leafpad — Notepad clone for GTK that emphasizes simplicity.\n\n- Liri Text — Text editor for Liri.\n\n- Lite XL — A lightweight, simple, fast, feature-filled, and extremely extensible text editor written in C, and Lua, adapted from lite.\n\n- medit — Programming and around-programming text editor.\n\n- Mousepad — Fast text editor for the Xfce Desktop Environment.\n\n- NEdit — Text editor for the Motif environment.\n\n- Notepadqq — Qt-based, Notepad++-like text editor with support for syntax highlighting for more than 100 languages.\n\n- Nota — Easy to use text editor with a simple interface with support for tabbed documents, syntax highlighting for various languages, Focus mode, annotations, configurable fonts, and colors, a side panel with an integrated file browser, and more. Part of maui.\n\n- Pantheon Code — Code editor for elementaryOS. It auto-saves your files, meaning they are always up-to-date. Plus it remembers your tabs so you never lose your spot, even in between sessions.\n\n- Pluma — Powerful text editor for MATE.\n\n- QSciTE — Qt clone of the SciTE text and code editor.\n\n- Sam — Minimalist text editor with a graphical user interface, a very powerful command language and remote editing capabilities, developed by Rob Pike.\n\n- SciTE — Generally useful editor with facilities for building and running programs.\n\n- Sublime Text — Proprietary C++ and Python-based editor with many advanced features and plugins while staying lightweight and pretty.\n\n- TEA — Qt-based feature-rich text editor.\n\n- Textadept — Lua-extensible feature rich text editor based on Scintilla and written in C.\n\n- Textosaurus — Simple cross-platform text editor based on Qt and QScintilla.\n\n- Text Pieces — Powerful scratchpad with ability to perform a lot of text transformations.\n\n- Visual Studio Code — Editor for building and debugging modern web and cloud applications.\n\n- VSCodium — Visual Studio Code, but compiled without telemetry.\n\n- xed — Text editor based on Pluma developed for Linux Mint.\n\n- XEdit — Simple text editor for the X Window System.\n\n- wxMEdit — Text/Hex editor written in C++ and wxWidgets.\n\n- Zed — A high-performance, multiplayer code editor from the creators of Atom and Tree-sitter. It's also open source.\n\n"
    },
    {
      "title": "Office suites",
      "level": 3,
      "content": "See also Wikipedia:Comparison of office suites.\n\n- Calligra — Actively developed fork of KOffice, the KDE office suite. It offers most of the features of OpenOffice. Part of kde-office.\n\n- Google Docs — Cloud office solution by Google.\n\n- LibreOffice — The office productivity suite compatible to the open and standardized ODF document format. Fork of OpenOffice, supported by The Document Foundation.\n\n- OnlyOffice — Office suite that combines text, spreadsheet and presentation editors.\n\n- OpenOffice — Open-source office software suite for word processing, spreadsheets, presentations, graphics, databases and more, under the Apache Licence.\n\n- SoftMaker FreeOffice — Complete, reliable, lightning-fast and Microsoft Office-compatible proprietary office suite with a word processor, spreadsheet, and presentation graphics software.\n\n- WPS Office — Proprietary office productivity suite, previously known as Kingsoft Office.\n\n- Yozo Office — Proprietary office suite, compatible with MS Office.\n\n"
    },
    {
      "title": "Word processors",
      "level": 3,
      "content": "See also Wikipedia:Comparison of word processors.\n\n- AbiWord — Full-featured word processor.\n\n- Calligra Words — Powerful word processor included in the Calligra Suite. Part of kde-office.\n\n- LibreOffice Writer — Full-featured word processor included in the LibreOffice suite.\n\n- OpenOffice Writer — Full-featured word processor included in the OpenOffice suite.\n\n- Ted — Easy to use GTK-based rich text processor (with footnote support).\n\n- WordGrinder — Word processor for the console.\n\n"
    },
    {
      "title": "WYSIWYG HTML editors",
      "level": 4,
      "content": "- PageEdit — ePub visual XHTML editor.\n\n- SeaMonkey Composer — Powerful yet simple HTML editor included in the SeaMonkey suite.\n\n"
    },
    {
      "title": "Desktop publishing",
      "level": 4,
      "content": "- gLabels — Program for creating labels, business cards and media covers.\n\n- Scribus — Desktop publishing program. Uses hyphen and its language packs for hyphenation.\n\n"
    },
    {
      "title": "Presentations",
      "level": 3,
      "content": "- Calligra Stage — Easy to use yet still flexible presentation application included in the Calligra Suite. Part of kde-office.\n\n- LibreOffice Impress — Presentation program included in the LibreOffice suite.\n\n- MDP — A command-line based markdown presentation tool.\n\n- OpenOffice Impress — Presentation program included in the OpenOffice suite.\n\n- sent — Simple plaintext presentation tool.\n\n- Sozi — Zooming presentation editor and player. Based on the Electron platform.\n\n- Spice-Up — Create simple and beautiful presentations.\n\n"
    },
    {
      "title": "Spreadsheets",
      "level": 3,
      "content": "See also Wikipedia:Comparison of spreadsheet software.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- sc — Curses-based lightweight spreadsheet.\n\n- sc-im — Spreadsheet program based on sc.\n\n- visidata — Python multitool for discovering and arranging data.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Calligra Sheets — Powerful spreadsheet application included in the Calligra Suite. Part of kde-office.\n\n- Gnumeric — Spreadsheet program for the GNOME desktop.\n\n- LibreOffice Calc — Full-featured spreadsheet application included in the LibreOffice suite.\n\n- OpenOffice Calc — Full-featured spreadsheet application included in the OpenOffice suite.\n\n- Pyspread — Pyspread is a non-traditional spreadsheet application that is based on and written in the programming language Python.\n\n"
    },
    {
      "title": "Database tools",
      "level": 3,
      "content": "For DBMS-specific tools, see:\n\n- MySQL#Graphical tools\n- PostgreSQL#Graphical tools\n- SQLite#Software\n- MongoDB#Tools\n\nSee also Wikipedia:Comparison of database tools.\n\n- Adminer — Full-featured database management webapp with support for many database types.\n\n- beekeeper-studio — A modern, easy to use, and good looking SQL client for MySQL, Postgres, SQLite, SQL Server, and more.\n\n- DBeaver — Java-based graphical database editor with support for many database types.\n\n- DbVisualizer — The Universal Database Tool\n\n- GdaBrowser — Graphical tool to get a quick access to a database's structure and contents.\n\n- Harlequin — The SQL IDE for your terminal.\n\n- Kexi — Visual database applications creator tool by KDE, designed to fill the gap between spreadsheets and database solutions requiring more sophisticated development.\n\n- LibreOffice Base — Full-featured desktop database front end included in the LibreOffice suite, designed to meet the needs of a broad array of users.\n\n- OpenOffice Base — Full-featured desktop database front end included in the OpenOffice suite, designed to meet the needs of a broad array of users.\n\n- Orbada — Excellent tool for database developers, SQL developers, DBA administrators, as well as for users who wish to broaden their knowledge and skills in SQL. Last release dated 2019-07-03.\n\n- Sequeler — SQL client built in Vala and Gtk. It allows you to connect to your local and remote databases, write SQL in a handy text editor with language recognition, and visualize SELECT results in a Gtk.Grid Widget.\n\n- SQuirreL SQL Client — Graphical Java program that will allow you to view the structure of a JDBC compliant database, browse the data in tables, issue SQL commands etc.\n\n- TOra — Database management GUI that supports accessing most of the common database platforms in use, including Oracle, MySQL, and PostgreSQL, as well as limited support for any target that can be accessed through Qt's ODBC support.\n\n"
    },
    {
      "title": "Plain-text database utilities",
      "level": 4,
      "content": "These kinds of software are in a substance somewhat between text processing core utilities like awk, spreadsheets and production-level database system. And they usually come with a non-SQL command-line interface.\n\n- csvkit — CSV/TSV toolkit written in Python\n\n- csvtk — cross-platform, efficient and practical CSV/TSV toolkit written in Go\n\n- datamash — GNU utility for basic numeric and statistical operations on plain text data.\n\n- num-utils — A set of commandline programs for numeric calculations.\n\n- recutils — GNU utilities to work with human-editable, plaintext database files (in a simple format called \"recfile\").\n\n- tsv-utils — eBay's CLI tools for large, tabular data files, including filtering, statistics, sampling, and joins.\n\n"
    },
    {
      "title": "\"Simplified\" database software (beginner-friendly database tools)",
      "level": 4,
      "content": "- Symphytum — Personal database software for everyone who desires to manage and organize data in an easy and intuitive way, without having to study complex database languages and software user interfaces.\n\n- TreeLine — Store almost any kind of information in a tree structure, which makes it easy to keep things organized.\n\n"
    },
    {
      "title": "Formula editors",
      "level": 3,
      "content": "See also #TeX formula editors and Wikipedia:Formula editor.\n\n- LibreOffice Math — Create and edit scientific formulas and equations. Included in the LibreOffice suite.\n\n- OpenOffice Math — Create equations and formulas for your documents. Included in the OpenOffice suite.\n\n"
    },
    {
      "title": "Markup languages",
      "level": 2,
      "content": "See also Wikipedia:Comparison of document markup languages.\n\n- txt2tags — Dead-simple, KISS-compliant lightweight, human-readable markup language to produce rich format content out of plain text files.\n\n"
    },
    {
      "title": "AsciiDoc",
      "level": 3,
      "content": "See also Wikipedia:AsciiDoc.\n\n- AsciiDoc.py — A legacy implementation written in Python. Used by Arch for generating pacman's man pages.[1].\n\n- Asciidoctor — An implementation written in Ruby, with many extra features.\n\n"
    },
    {
      "title": "Markdown",
      "level": 3,
      "content": "See also the official website and Wikipedia:Markdown.\n\n- cmark — CommonMark parsing and rendering library and program in C.\n\n- Discount — A Markdown implementation written in C.\n\n- lowdown — Markdown translator producing HTML5 and roff documents in the ms and man formats.\n\n- Marked — Markdown parser and compiler built for speed.\n\n- md2html — C Markdown parser.\n\n- Pandoc also supports Markdown.\n\n"
    },
    {
      "title": "Python implementations",
      "level": 4,
      "content": "- CommonMark-py — Python parser for the CommonMark Markdown specification.\n\n- M2R2 — Markdown to reStructuredText converter.\n\n- Mistune — The fastest markdown parser in pure Python with renderer feature.\n\n- Python-Markdown — Extensible Python implementation of John Gruber's Markdown.\n\n- PyMdown Extensions — Extensions for Python-Markdown.\n\n- MkDocs — Project documentation with Markdown.\n\n- Material for MkDocs — Material design theme for MkDocs.\n\n- MkDocs Material Extensions — Markdown extension resources for MkDocs Material.\n\n"
    },
    {
      "title": "Ruby implementations",
      "level": 4,
      "content": "- kramdown — Fast, pure Ruby Markdown superset converter, using a strict syntax definition.\n\n- Maruku — Pure Ruby Markdown-superset interpreter.\n\n- mdless — Pure Ruby terminal-based markdown viewer/interpeter.\n\n"
    },
    {
      "title": "Markdown editors",
      "level": 4,
      "content": "- Apostrophe — Distraction free Markdown editor made with GTK.\n\n- CuteMarkEd — Qt-based Markdown editor with live HTML preview, math expressions, code and markdown syntax highlighting. Discontinued since 2016.\n\n- Formiko — reStructuredText and Markdown editor and live previewer written in Python with GTK.\n\n- ghostwriter — Distraction-free Markdown editor. Part of kde-office.\n\n- Marker — Simple yet robust Markdown editor.\n\n- Mark My Words — Minimal markdown editor.\n\n- Mark Text — Next generation markdown editor. Based on the Electron platform.\n\n- Remarkable — Fully featured Markdown editor.\n\n- ReText — Simple text editor for Markdown and reStructuredText.\n\n- ThiefMD — Markdown and Fountain editor inspired by Ulysses.\n\n- Typora — Proprietary, minimalist Markdown editor.\n\n- Zettlr — A cross-platform markdown editor, inspired by the Zettelkasten system for note-taking and personal knowledge management. Based on the Electron platform.\n\n"
    },
    {
      "title": "reStructuredText",
      "level": 3,
      "content": "See also reStructuredText.\n\n- Docutils — Set of tools for processing plaintext (reStructuredText) docs into formats such as HTML, XML, or LaTeX.\n\n- rstcheck — Checks syntax of reStructuredText and code blocks nested within it.\n\n- Sphinx — A documentation generation system using reStructuredText to generate output in multiple formats (primary documentation system for the Python project).\n\n"
    },
    {
      "title": "Typesetting systems",
      "level": 3,
      "content": "- groff — GNU implementation of troff, a heirloom Unix document processing system and the default formatter for man pages.\n\n- Lout — A lightware document formatting system. Reads a high-level description of a document similar in style to LaTeX and produces a PostScript.\n\n- SILE — Modern typesetting system inspired by TeX.\n\n- TeX — A high-quality typesetting system popular in academia.\n\n- Texinfo — Typesetting syntax for software manuals used by the GNU Project.\n\n- Typst — A markup-based typesetting system for the sciences.\n\n- Speedata — A database publishing software that creates high-quality layouted PDFs fully automatically.\n\n"
    },
    {
      "title": "TeX editors",
      "level": 3,
      "content": "With TeX, LaTeX and friends, creation of any scientific document, article, journal, etc. is made commonplace.\n\nSee also Wikipedia:Comparison of TeX editors and Wikibooks:LaTeX/Installation#Editors.\n\n- AUCTeX — Together with RefTex, AUCTeX provices an extensible environment for writing and formatting TeX files in Emacs.\n\n- Enter TeX — LaTeX editor for GNOME, previously known as GNOME LaTeX.\n\n- gedit LaTeX Plugin — Add code-completion to gedit and allows for compiling LaTeX documents and managing BibTeX bibliographies.\n\n- Gummi — Lightweight TeX/LaTeX GTK-based editor. It features a continuous preview mode, integrated BibTeX support, extendable snippet interface and multi-document support.\n\n- Kile — User-friendly TeX/LaTeX editor for the KDE desktop with many features.\n\n- Ktikz — Small application helping you to create PGF/TikZ diagrams for your publications.\n\n- LyX — Document processor that encourages an approach to writing based on the structure of your documents (WYSIWYM) and not simply their appearance (WYSIWYG).\n\n- Setzer — LaTeX editor written in Python with GTK.\n\n- TeXmacs — WYSIWYW (what you see is what you want) editing platform with special features for scientists.\n\n- Texmaker — Cross-platform, light and easy-to-use LaTeX IDE. It integrates many tools needed to develop documents with LaTeX, in just one application\n\n- TeXstudio — Fork of TeXMaker including support for code completion of bibtex items, grammar check and automatic detection of the need for multiple LaTeX runs.\n\n- TeXworks — Simple TeX front-end program modeled after TeXShop.\n\n- TikZiT — Graphical tool for rapidly creating graphs and diagrams using PGF/TikZ.\n\n- Vim-LaTeX-suite — Customizable LaTeX environment for Vim.\n\n"
    },
    {
      "title": "TeX formula editors",
      "level": 3,
      "content": "- EqualX — LaTeX equation editor with real time preview.\n\n- KLatexFormula — GUI for generating images from LaTeX equations.\n\n- LibreOffice TexMaths extension — LaTeX equation editor for LibreOffice.\n\n"
    },
    {
      "title": "XML editors",
      "level": 3,
      "content": "See also Wikipedia:Comparison of XML editors.\n\n- QXmlEdit — Simple Qt XML editor and XSD viewer.\n\n- XML Copy Editor — Fast, validating XML editor.\n\n- XML Tree Editor — Displays XML files as tree views and allows basic operations: adding, editing and deleting text nodes and their attributes.\n\n"
    },
    {
      "title": "Document converters",
      "level": 2,
      "content": "See also #Markup languages and PDF, PS and DjVu.\n\n- Antiword — MS Word to text converter.\n\n- catdoc — Converter for Microsoft Word, Excel, PowerPoint and RTF files to text.\n\n- docx2txt — MS Word Docx to text converter.\n\n- HTMLDOC — Reads HTML and Markdown source files or web pages and generates corresponding EPUB, HTML, PostScript, or PDF files with an optional table of contents.\n\n- Morphosis — Document conversion app using Pandoc and WebKitGTK.\n\n- mutool — All purpose tool based on MuPDF for dealing with document files in various manners.\n\n- Pandoc — Swiss-army knife for converting markup and document formats.\n\n- unoconv — Libreoffice-based document converter.\n\n- UnRTF — Command-line program which converts RTF documents to other formats.\n\n"
    },
    {
      "title": "Bibliographic reference managers",
      "level": 2,
      "content": "See also Wikipedia:Comparison of reference management software.\n\n- Citations — Manage your bibliographies using the BibTeX format.\n\n- JabRef — Java GUI frontend for managing BibTeX and other bibliographies.\n\n- KBibTeX — BibTeX editor by KDE to edit bibliographies used with LaTeX.\n\n- Mendeley Desktop — Proprietary reference manager and academic social network.\n\n- Papis — A command-line based document and bibliography manager.\n\n- Zotero — An easy-to-use tool to help you collect, organize, cite, and share your research sources. Can import and export BibTeX and has browser extensions.\n\n"
    },
    {
      "title": "Readers and viewers",
      "level": 2,
      "content": "- NFO Viewer — Simple viewer for NFO files.\n\n"
    },
    {
      "title": "PDF and DjVu",
      "level": 3,
      "content": "See PDF, PS and DjVu.\n\n"
    },
    {
      "title": "E-book",
      "level": 3,
      "content": "- Arianna — An ebook reader and library management app supporting EPUB files. Part of kde-graphics.\n\n- Beseda — Accessible (for visually impaired) console ebook-reader that can speak TXT, FB2, ABW, [X]HTML, ODT, DOCX books and documents.\n\n- Bookworm — Simple, focused e-book reader for Elementary OS with EPUB, PDF, Mobipocket and Comicbook support.\n\n- Calibre — E-book library management application that can also edit EPUB files, convert between different formats and sync with a variety of e-book readers. Supported formats include CHM, Comicbook, DjVu, DOCX, EPUB, FictionBook, HTML, HTMLZ, Kindle, LIT, LRF, Mobipocket, ODT, PDF, PRC, PDB, PML, RB, RTF, SNB, TCR, TXT and TXTZ.\n\n- Cool Reader — E-book viewer with many supported formats such as EPUB (non-DRM), FictionBook, TXT, RTF, HTML, CHM and TCR.\n\n- FBReader — E-book viewer with many supported formats such as EPUB, FictionBook, HTML, plucker, PalmDoc, zTxt, TCR, CHM, RTF, OEB, Mobipocket (non-DRM) and TXT.\n\n- Foliate — Simple and modern GTK eBook reader. Supports EPUB, Mobipocket, Kindle, FictionBook, and Comicbook formats.\n\n- Lector — Qt based e-book reader with PDF, EPUB, Kindle, Mobipocket and Comicbook support.\n\n- Sigil — WYSIWYG EPUB e-book editor.\n\n- baca — console epub reader.\n\n- KOReader — An ebook reader application supporting PDF, DjVu, EPUB, FB2 and many more formats, running on Cervantes, Kindle, Kobo, PocketBook and Android devices\n\nSome PDF viewers like apvlv, Atril, MuPDF, Okular, Xreader, and Zathura also support the EPUB format.\n\n"
    },
    {
      "title": "Comic book",
      "level": 3,
      "content": "- Automedia — A very small downloader for manga and anime from various websites. Designed to be a much more lightweight alternative to HakuNeko. Written primarly in C.\n\n- HakuNeko — Downloader for manga and anime from various websites. Based on the Electron platform.\n\n- Kindle Comic Converter — Allows you to transform your PNG, JPG, GIF, CBZ, CBR and CB7 files into EPUB or MOBI format e-books.\n\n- Komikku — Online/offline manga reader for GNOME.\n\n- Manga Reader — Manga reader for local files. Supports zip, rar, tar, 7z, cbz, cbr, cbt, cb7 files and also folders.\n\n- MComix — GTK3 image viewer specifically designed to handle comic book archives (fork of Comix). Also includes library manager.\n\n- QComicBook — Viewer for comic book archives that aims at convenience and simplicity.\n\n- QuickMedia — Online manga reader. Supports automatically upscaling pages with waifu2x-ncnn-vulkan\n\n- YACReader — Comic book viewer written in C++ and Qt5. Comes with YACReaderLibrary for managing comics.\n\nSome PDF and E-book viewers like Atril, Bookworm, Calibre, Foliate, GNOME Document Viewer, Lector, MuPDF, Okular, Papers, Xreader and Zathura also support the Comicbook format.\n\n"
    },
    {
      "title": "CHM",
      "level": 3,
      "content": "See also Wikipedia:Microsoft Compiled HTML Help.\n\n- Archmage — Extensible reader and decompiler for files in the CHM format.\n\n- Kchmviewer — Qt-based CHM viewer that uses chmlib and borrows some ideas from xchm. It does not depend on KDE, but it can be compiled to integrate with it.\n\n- xCHM — Lightweight CHM viewer, based on chmlib.\n\nSome PDF and E-book viewers like Cool Reader, FBReader and Okular also support the CHM format.\n\n"
    },
    {
      "title": "Document managers",
      "level": 2,
      "content": "- Paperwork — Personal document manager. It manages scanned documents and PDFs.\n\n- Shelf — Document collection manager that supports PDF files. Part of maui.\n\n"
    },
    {
      "title": "Scanning software",
      "level": 2,
      "content": "See SANE#Frontends\n\n- ScanTailor Advanced — Interactive post-processing tool for scanned pages. Fork of Scan Tailor with additional features and fixes.\n\n"
    },
    {
      "title": "Console",
      "level": 3,
      "content": "See also Wikipedia:Comparison of optical character recognition software.\n\n- CuneiForm — Command line OCR system originally developed and open sourced by Cognitive technologies. Supported languages: eng, ger, fra, rus, swe, spa, ita, ruseng, ukr, srp, hrv, pol, dan, por, dut, cze, rum, hun, bul, slo, lav, lit, est, tur.\n\n- GOCR — OCR engine which also supports barcode recognition.\n\n- Ocrad — OCR program based on a feature extraction method.\n\n- OCRmyPDF — Adds an OCR text layer to scanned PDF files, allowing them to be searched.\n\n- Tesseract — Accurate open source OCR engine. Package splitted, you need install some datafiles for each language (tesseract-data-eng for example).\n\n"
    },
    {
      "title": "Graphical",
      "level": 3,
      "content": "- gImageReader — Graphical GTK/Qt frontend to Tesseract.\n\n- gscan2pdf — Scans, runs an OCR engine, minor post-processing, creates a document.\n\n- Linux-Intelligent-Ocr-Solution — Easy-OCR solution and Tesseract trainer for converting print into text using either scanner or a camera.\n\n- OCRFeeder — Python GUI for GNOME which performs document analysis and rendition, and can use either CuneiForm, GOCR, Ocrad or Tesseract as OCR engines. It can import from PDF or image files, and export to HTML or OpenDocument.\n\n- Paperwork — Personal document manager. It manages scanned documents and PDFs.\n\n- Scans to PDF — Create small, searchable PDFs from scanned documents.\n\n- YAGF — Graphical interface for the CuneiForm text recognition program on the Linux platform.\n\n"
    },
    {
      "title": "Note-taking software",
      "level": 3,
      "content": "See also Wikipedia:Comparison of notetaking software.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- dnote — A simple command line notebook for programmers\n\n- Org mode — Emacs mode for notes, project planning and authoring.\n\n- eureka — CLI tool to input and store your ideas without leaving the terminal\n\n- kb — A minimalist terminal-based knowledge manager.\n\n- nb — A command line and local web note‑taking, bookmarking, archiving, and knowledge base application.\n\n- tnote — Small note taking program for the terminal.\n\n- Vimwiki — Personal wiki for Vim – interlinked, plain text files written in a markup language.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- BasKet — Application for organizing, sharing, and taking notes. It can manage various types of information such as to-do lists, links, pictures, and other types, similar to a scrapbook.\n\n- Boostnote — Note-taking application for programmers that focuses on markdown, snippets, and customizability. Based on the Electron platform.\n\n- Buho — Task and note keeper to save links, write quick notes and organize pages as books. Part of maui.\n\n- Cherrytree — Hierarchical note taking application, featuring rich text and syntax highlighting, storing data in a single xml or sqlite file.\n\n- Deepin Voice Notes — Lightweight memo tool to make text notes and voice recordings.\n\n- Encryptic — JavaScript note taking application with Markdown editor and encryption support. Based on the Electron platform.\n\n- FeatherNotes — Lightweight Qt hierarchical notes-manager.\n\n- FromScratch — Simple but smart note-taking application that you can use as a quick note taking or todo app. Based on the Electron platform.\n\n- GNOME Notes — Note editor for GNOME designed to remain simple to use. Part of gnome-extra.\n\n- Gnote — Port of Tomboy to C++. It is the same note taking application, including most of the add-ins.\n\n- Iotas — Simple note taking with Markdown support and optional Nextcloud Notes sync.\n\n- Joplin — Note taking and to-do application, which can handle a large number of notes organized into notebooks on desktop or mobile devices. It synchronizes with WebDAV, Dropbox, OneDrive, NextCloud, S3 (beta) and other backends. Based on the Electron platform.\n\n- KeepNote — Cross-platform GTK note-taking application with rich text formatting.\n\n- Logseq — A local-first, non-linear, outliner notebook for organizing and sharing your personal knowledge base.\n\n- Marknote — A simple markdown note management app for KDE.\n\n- MyNotex — Note-taking, document file and activity manager.\n\n- Nextcloud Notes — Simple notes app for Nextcloud.\n\n- NixNote — Helps you take notes and stay organized. Create text notes, attach files or images, and even synchronize with Evernote. Formerly called Nevernote.\n\n- Norka — Note-taking software with Markdown support designed for Pantheon.\n\n- Notejot — Stupidly simple sticky notes applet for elementaryOS.\n\n- Notes — Note-taking application, write down your thoughts.\n\n- Notes-Up — Markdown notes editor and manager for elementaryOS.\n\n- Notion — Note-taking, task management, project management, knowledge management software\n\n- Notorious — Keyboard centric note-taking application with Markdown syntax highlighting support.\n\n- nvPY — Simplenote syncing note-taking application, inspired by Notational Velocity and ResophNotes, but uglier and cross-platformerer.\n\n- Obsidian — Personal knowledge base that uses markdown text files to organize notes in a format that mirrors the human brain.\n\n- OutWiker — Store notes in a tree.\n\n- QOwnNotes — Notepad and todo list manager with markdown support and optional ownCloud integration built on Qt5.\n\n- Simplenote — The simplest way to keep notes. Based on the Electron platform.\n\n- Standard Notes — Simple and private notes application which focuses on simplicity, and encrypts data locally before it ever touches a cloud. Based on the Electron platform.\n\n- TagSpaces — Offline personal data manager for managing of your local files. Based on the Electron platform.\n\n- TiddlyWiki — Unique non-linear notebook for capturing, organizing and sharing complex information.\n\n- VNote — Vim-inspired note-taking application that knows programmers and Markdown better.\n\n- WizNote — Cloud based note-taking client.\n\n- Zim — WYSIWYG text editor that aims at bringing the concept of a wiki to the desktop.\n\n- zNotes — Lightweight application for notes management with simple interface.\n\n- μPad — Note-taking app that helps you organise + take notes without restrictions. Based on the Electron platform.\n\n"
    },
    {
      "title": "Stylus note-taking",
      "level": 4,
      "content": "- Cournal — Collaborative note taking and journal application using a stylus. It allows multiple users to annotate PDF files in real-time.\n\n- Saber — Open source libre cross platform note taking app\n\n- Write — A proprietary word processor for handwriting.\n\n- Xournal — Application for notetaking, sketching and keeping a journal using a stylus. Capable of annotating existing PDF files as well.\n\n- Xournal++ — Notetaking software designed around a tablet. C++ rewrite of Xournal with PDF annotation support.\n\n- Rnote — A simple note taking application written in Rust and GTK4.\n\n"
    },
    {
      "title": "Diary",
      "level": 3,
      "content": "- Almanah — Small GTK application to allow you to keep a diary of your life.\n\n- Lifeograph — Off-line and private journal and note taking application. It offers a rich feature set presented in a clean and simple user interface.\n\n- RedNotebook — Modern journal, which lets you format, tag and search your entries.\n\n- Simple Diary — Simple and lightweight diary app with Markdown support.\n\n"
    },
    {
      "title": "Mind-mapping",
      "level": 3,
      "content": "See also Wikipedia:List of concept- and mind-mapping software.\n\n- FreeMind — A mind mapper, and a hierarchical editor with strong emphasis on folding. Could be used for knowledge and content management.\n\n- Freeplane — Fork of FreeMind, supports thinking, sharing information and getting things done at work. The software can be used for mind mapping and analyzing the information contained in mind maps.\n\n- Minder — Mind-mapping application designed for Pantheon.\n\n- MindMaster — Proprietary mindmap and brainstorm software with modern UI and beautiful template. It also provides online mindmap service and cross-platform sharing.\n\n- Semantik — Mind-mapping application for KDE.\n\n- TreeSheets — A \"hierarchical spreadsheet\" that is a great replacement for spreadsheets, mind mappers, outliners, PIMs, text editors and small databases.\n\n- View Your Mind — Tool to generate and manipulate maps which show your thoughts. Such maps can help you to improve your creativity and effectivity. You can use them for time management, to organize tasks, to get an overview over complex contexts, to sort your ideas etc.\n\n- Visual Understanding Environment — Flexible tools for managing and integrating digital resources in support of teaching, learning and research.\n\n- XMind — Brainstorming and mind mapping application. It provides a rich set of different visualization styles, and allows sharing of created mind maps via their website.\n\n"
    },
    {
      "title": "Sticky notes",
      "level": 3,
      "content": "- GloboNote — An easy to use desktop application for sticky notes, to-do lists, personal journals, reminders and other notes.\n\n- Notes — Provides you a quick way to paste text, to write down a list of things, to leave a note to your friend, or whatever you had do with Post-It's.\n\n- PrimeNote — A polished, cross-platform sticky note application written in PyQt.\n\n- Xpad — Sticky note application for jotting down things to remember.\n\n"
    },
    {
      "title": "Distraction-free writing",
      "level": 3,
      "content": "See also #Markdown editors and Wikipedia:Full-screen writing program.\n\n- FocusWriter — Simple, distraction-free writing environment. It utilizes a hide-away interface that you access by moving your mouse to the edges of the screen, allowing the program to have a familiar look and feel to it while still getting out of the way so that you can immerse yourself in your work.\n\n- PyRoom — Fullscreen editor without buttons, widgets, formatting options, menus and with only the minimum of required dialog windows, it does not have any distractions and lets you focus on writing and only writing.\n\n- Quilter — Focus on your writing and write beautiful solid stories with the Focus Mode in tow in this Markdown editor.\n\n- TextRoom — Fullscreen text editor for writers.\n\n"
    },
    {
      "title": "Story writing",
      "level": 3,
      "content": "- Manuskript — Provides a rich environment to help writers create their first draft and then further refine and edit their masterpiece.\n\n- NovProg — Tool to graph your progress in writing a NaNoWriMo style novel.\n\n- oStorybook — Tool for writers, essayists, authors from the draft to the final work.\n\n"
    },
    {
      "title": "Screenwriting",
      "level": 3,
      "content": "- KIT Scenarist — Simple and powerful application for creating screenplays.\n\n- Magic Fountain — Fountain syntax editor and viewer for writing screenplays.\n\n- Trelby — Simple, fast and elegantly laid out to make screenwriting simple.\n\n- Fade In — Fade In Professional Screenwriting Software is the most advanced software used by professionals writing for motion pictures, television, video games, the stage, radio, and more.\n\n"
    },
    {
      "title": "Dictionary and thesaurus",
      "level": 3,
      "content": "See also Wikipedia:Category:Dictionary software and Wikipedia:DICT#DICT clients.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- dictd — Client/server software for the DICT protocol.\n\n- sdcv — Command line dictionary. It provides access to dictionaries in StarDict's format.\n\n- thesauromatic — Static, offline, command-line thesaurus written in Rust.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Artha — English thesaurus that works completely off-line and is based on WordNet.\n\n- Gjiten Kai — Rewrite of Gjiten, a GTK Japanese dictionary.\n\n- GNOME Dictionary — GNOME application to check word definitions and spellings in an online dictionary. Part of gnome-extra.\n\n- GoldenDict — Feature-rich dictionary lookup program.\n\n- Kiten — Japanese reference and study tool. Part of kde-education.\n\n- MATE Dictionary — MATE application to look up words in dictionary sources.\n\n- OpenDict — Computer dictionary, which supports popular computer dictionary formats including Slowo and Mova. It also acts as a client for DICT servers.\n\n- Palaura — Handy dictionary to find any word's definition.\n\n- PowerWord — Proprietary Chinese-English dictionary tool.\n\n- QStarDict — Dictionary program written using Qt. The user interface is similar to StarDict.\n\n- Quick Lookup — Simple GTK dictionary application powered by Wiktionary.\n\n- StarDict — International dictionary software.\n\n- Xfce4 Dictionary — Search different kinds of dictionary services for words or phrases.\n\n"
    },
    {
      "title": "Spell checkers",
      "level": 3,
      "content": "See Language checking.\n\n"
    },
    {
      "title": "Translation and localization",
      "level": 3,
      "content": "See also Wikipedia:Comparison of computer-assisted translation tools.\n\n- Apertium — Free and open source rule-based machine translation platform with available language data. It supports the following formats: HTML, Microsoft Office 2007 XML, OpenDocument, TMX, MediaWiki and others.\n\n- Crow Translate — Simple and lightweight translator that allows to translate and speak text using Google, Yandex and Bing.\n\n- Dialect — Translation app for GNOME based on Google Translate and other online services.\n\n- Gtranslator — Enhanced gettext po file editor for the GNOME. It handles all forms of gettext po files and includes very useful features.\n\n- Lokalize — Standard KDE tool for software translation. It includes basic editing of PO files, support for glossary, translation memory, project managing, etc. Part of kde-sdk.\n\n- Moses — Statistical machine translation tool (language data not included).\n\n- OmegaT — General translator's tool which contains a lot of translation memory features and can give suggestions from Google Translate. It supports the following formats: HTML, Microsoft Office 2007 XML, OpenDocument, XLIFF/Okapi, MediaWiki, plain text, TMX and others.\n\n- Poedit — Simple translation editor for gettext (PO, POT) and XLIFF.\n\n- Pology — Set of Python tools for dealing with gettext/po-files.\n\n- Qt Linguist — Translating Qt C++ and Qt Quick applications into local languages.\n\n- Translate Shell — Command-line interface and interactive shell for Google Translate.\n\n- Translate Toolkit — Localization and translation toolkit, which provides a set of tools for working with localization file formats and files that might need localization.\n\n"
    },
    {
      "title": "Console",
      "level": 3,
      "content": "- barcode — A tool to convert text strings to printed bars.\n\n- iec16022 — Produce 2D barcodes often also referenced as DataMatrix.\n\n- qrencode — C library and command line tool for encoding data in a QR code symbol.\n\n- ZBar — Application and library for reading bar codes from various sources.\n\n- Zint — Barcode encoding library and command line tool supporting over 50 symbologies.\n\n"
    },
    {
      "title": "Graphical",
      "level": 3,
      "content": "- CoBang — QR code scanner application.\n\n- Decoder — QR code scanner and generator.\n\n- gLabels — Program for creating labels and business cards. It also supports creating barcodes.\n\n- QRab — Simply grabs QR code from screen and copies decoded text into clipboard.\n\n- Qrca — Scan QR-Codes with your camera on phones and laptops, and create your own for easily sharing data between devices.\n\n- Qreator — Graphical utility for creating QR codes.\n\n- QtQR — QR code generator and decoder.\n\n- ZBarCam GUI — Simple GUI for ZBar to read bar codes from various sources.\n\n- Zint Barcode Studio — Barcode generator GUI.\n\n"
    },
    {
      "title": "Placeholder text generators",
      "level": 2,
      "content": "- Lorem — Simple app to generate the Lorem Ipsum placeholder text.\n\n"
    }
  ]
}