{
  "title": "List of applications (Polski)/Utilities (Polski)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Polski)/Utilities_(Polski)",
  "sections": [
    {
      "title": "Powłoki poleceń",
      "level": 3,
      "content": "Zobacz główny artykuł: Command-line shell.\n\nZobacz także Wikipedia:Comparison of command shells.\n\n"
    },
    {
      "title": "Emulatory terminali",
      "level": 3,
      "content": "Emulatory terminali wyświetlają okno GUI zawierające terminal. Większość emuluje Xterm, który z kolei emuluje VT102, który emuluje maszynę do pisania. Aby uzyskać więcej informacji, zobacz Wikipedia:Terminal emulator.\n\nWyczerpująca lista znajduje się w Wikipedia:List of terminal emulators.\n\n- Alacritty — Wieloplatformowy emulator terminala z akceleracją GPU.\n\n- aterm — Zamiennik Xterm z obsługą przezroczystości. Od 2008 roku został wycofany na rzecz urxvt.\n\n- Contour — Nowoczesny i szybki emulator terminala z pełną obsługą Unicode, w tym ZJW (w przeciwieństwie do 99% emulatorów).\n\n- cool-retro-term — Dobrze wyglądający emulator terminala, który naśladuje stary wyświetlacz katodowy.\n\n- CoreTerminal — Emulator terminala oparty na qtermwidget. Część C-Suite.\n\n- CuteCom — Graficzny terminal szeregowy.\n\n- Darktile — Emulator terminala renderowany przez GPU, przeznaczony do zarządzania oknami w kafelkach.\n\n- Deepin Terminal — Aplikacja emulacji terminala dla Deepin desktop.\n\n- Eterm — Emulator terminala przeznaczony jako zamiennik xterm i zaprojektowany dla pulpitu Enlightenment.\n\n- Extraterm — Emulator terminala z obsługą obrazów w terminalu, Unicode, ligaturą czcionek, powiększaniem tekstu itp.\n\n- foot — Lekki emulator terminala dla Wayland z obsługą sixel\n\n- Hyper — Terminal z obsługą JS/CSS. Oparty na platformie Electron.\n\n- Konsole — Emulator terminala dołączony do pulpitu KDE. Część kde-utilities.\n\n- kitty — Nowoczesny, hakowalny, funkcjonalny emulator terminala oparty na OpenGL\n\n- Liri Terminal — Terminal Material Design dla Liri.\n\n- mlterm — Wielojęzyczny emulator terminala obsługujący różne zestawy znaków i kodowania, czcionki o zmiennej szerokości i renderowanie bidi.\n\n- moserial — Terminal szeregowy oparty na GTK dla środowiska GNOME.\n\n- PuTTY — Wysoce konfigurowalny program konsoli ssh/telnet/serial.\n\n- QMLKonsole — Aplikacja terminalowa dla Plasma Mobile.\n\n- QTerminal — Lekki emulator terminala oparty na Qt.\n\n- rxvt-unicode (urxvt) — Konfigurowalny emulator terminala sforkowany z rxvt, z obsługą rozszerzeń Perl.\n\n- shellinabox — Internetowy terminal SSH\n\n- st — Prosta implementacja terminala dla X.\n\n- Station — Emulacja terminala oferuje różne tryby widoku, takie jak podział w pionie i poziomie, interfejs z zakładkami oraz polecenia kopiowania i wklejania. Część maui.\n\n- Tabby — Nowoczesny terminal z obsługą Unicode.\n\n- Terminology — Emulator terminala opracowany przez zespół projektu Enlightenment z innowacyjnymi funkcjami: miniaturami plików i odtwarzaniem multimediów jak w odtwarzaczu multimedialnym.\n\n- wayst — Prosty emulator terminala dla Wayland i X11 z renderowaniem OpenGL i minimalnymi zależnościami.\n\n- xterm — Prosty emulator terminala dla systemu X Window. Zapewnia terminale kompatybilne z DEC VT102 i Tektronix 4014 dla programów, które nie mogą bezpośrednio korzystać z systemu okienkowego.\n\n- Yakuake — Rozwijalny (drop-down) emulator terminala (w stylu Quake) oparty na Konsole. Część kde-utilities.\n\n- zutty — Wysokiej klasy terminal dla słabszych systemów.\n\n"
    },
    {
      "title": "Bazowane na VTE",
      "level": 4,
      "content": "VTE (Virtual Terminal Emulator) to widżet opracowany we wczesnych dniach GNOME do użytku w Terminalu GNOME. Od tego czasu powstało wiele terminali o podobnych możliwościach.\n\n- Deepin Terminal (GTK version) — Stara aplikacja emulująca terminal dla Deepin desktop.\n\n- EasySSH — Menedżer połączeń SSH.\n\n- Germinal — Minimalistyczny emulator terminala, który zapewnia zmaksymalizowany terminal bez obramowania, domyślnie dołączony do sesji tmux, a tym samym zapewniający zakładki i panele.\n\n- GNOME connection manager — Menedżer połączeń SSH i telnet skoncentrowany na integracji ze środowiskiem GNOME.\n\n- GNOME Console — Wcześniej znany jako King's Cross, prosty i przyjazny dla użytkownika emulator terminala dla środowiska GNOME. Część gnome.\n\n- GNOME Terminal — Emulator terminala dołączony do środowiska GNOME z obsługą Unicode. Część gnome-extra.\n\n- Black Box Terminal — Elegancki i konfigurowalny terminal dla środowiska GNOME.\n\n- Guake — Terminal rozwijany dla pulpitu GNOME.\n\n- kermit — Emulator terminala oparty na VTE, który ma być prosty, szybki i skuteczny.\n\n- LXTerminal — Niezależny od pulpitu emulator terminala dla LXDE.\n\n- MATE terminal — Rozwinięcie Wikipedia:Terminal GNOME dla pulpitu MATE.\n\n- Pantheon Terminal — Super lekki, piękny i prosty emulator terminala. Został zaprojektowany do konfiguracji z rozsądnymi ustawieniami domyślnymi i niewielką lub żadną konfiguracją.\n\n- ROXTerm — Zakładkowy emulator terminala o niewielkich rozmiarach.\n\n- sakura — Emulator terminala oparty na GTK i VTE.\n\n- Terminator — Emulator terminala obsługujący wiele paneli terminala z możliwością zmiany rozmiaru.\n\n- Termite — Terminal VTE oparty na klawiaturze, przeznaczony do użytku w menedżerze okien z obsługą kafelków i/lub zakładek. Nieobsługiwany - twórcy zalecają przejście na Alacritty.\n\n- Termit — Prosty emulator terminala oparty na VTE z obsługą skryptów Lua\n\n- Tilda — Konfigurowalny rozwijany emulator terminala.\n\n- Tilix — Kafelkowy emulator terminala dla środowiska GNOME.\n\n- tym — Konfigurowalny emulator terminala Lua\n\n- Xfce Terminal — Emulator terminala dołączony do pulpitu Xfce z obsługą kolorowego monitu i interfejsu z zakładkami.\n\n"
    },
    {
      "title": "Bazowane na KMS",
      "level": 4,
      "content": "Następujące emulatory terminali są oparte na kernel mode setting, które mogą być wywoływane bez X.\n\n- KMSCON — Oparta na KMS/DRM konsola systemowa (getty) ze zintegrowanym emulatorem terminala dla systemów operacyjnych Linux.\n\n"
    },
    {
      "title": "Bazowane na framebuffer",
      "level": 4,
      "content": "W świecie GNU/Linux, framebuffer może odnosić się do wirtualnego urządzenia w jądrze Linuksa (fbdev) lub wirtualnego systemu framebuffer dla X (xvfb). Ta sekcja zawiera głównie listę emulatorów terminali opartych na urządzeniu wirtualnym w jądrze, czyli fbdev.\n\n- yaft — Prosty emulator terminala do życia bez X, z glifami UCS2, tapetą i obsługą 256 kolorów.\n\n- Fbterm — szybki emulator TERMinal oparty na FrameBuffer dla systemu Linux\n\n"
    },
    {
      "title": "Pagery terminalowe",
      "level": 3,
      "content": "Zobacz takżeWikipedia:Terminal pager.\n\n- less — Program podobny do more, ale z obsługą przewijania do przodu i do tyłu, a także częściowego ładowania plików.\n\n- mcview — Pager z obsługą myszy i kolorów. Jest dołączony do midnight commander.\n\n- moar — Moar to pager. Został zaprojektowany tak, aby po prostu robić to, co do niego należy, bez żadnej konfiguracji.\n\n- more — Prosty i funkcjonalny pager. Jest częścią util-linux.\n\n- most — Pager z obsługą wielu okien, przewijaniem w lewo i w prawo oraz wbudowaną obsługą kolorów\n\n- ov — Bogata w funkcje terminalowa przeglądarka tekstu. Jest to tak zwany pager terminalowy.\n\n- Vim może może być także używany jako pager.\n\n"
    },
    {
      "title": "Multipleksery terminali",
      "level": 3,
      "content": "Zobacz także Wikipedia:Terminal multiplexer.\n\n- abduco — Narzędzie do obsługi dołączania i odłączania sesji, które pozwala procesowi działać niezależnie od kontrolującego go terminala.\n\n- byobu — Dodatek na licencji GPLv3 dla tmux lub screen. Wymaga zainstalowanego multipleksera terminali.\n\n- dtach — Program emulujący funkcję odłączania GNU Screen.\n\n- dvtm — Menedżer okien w konsoli w stylu dwm.\n\n- GNU Screen — Pełnoekranowy menedżer okien, który multipleksuje fizyczny terminal.\n\n- mtm — Prosty multiplekser terminali z zaledwie czterema poleceniami: zmiana fokusu, podział, zamknięcie i przerysowanie ekranu.\n\n- tmate — Fork tmux mający na celu pomoc w zdalnym dostępie i programowaniu w parach.\n\n- tmux — Multiplekser terminali na licencji BSD.\n\n- zellij — Terminalowy multiplekser na sterydach napisany w Rust\n\n- wezterm — Akcelerowany przez GPU wieloplatformowy emulator terminala i multiplekser zaimplementowany w Rust.\n\n"
    },
    {
      "title": "Menedżery plików",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of file managers.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Clex — Menedżer plików z pełnoekranowym interfejsem użytkownika\n\n- CliFM — Menedżer plików wiersza poleceń: w pełni funkcjonalny, szybki, rozszerzalny i lekki jak diabli.\n\n- ded (Directory-Editor) — Rozszerzenie dired, jest podobne do Emacs Dired.\n\n- Dired (Directory Editor) — Menedżer plików zintegrowany z Emacs.\n\n- fff — Prosty menedżer plików napisany w języku Bash.\n\n- fm — Menedżer plików oparty na terminalu.\n\n- joshuto — ranger - terminalowy menedżer plików napisany w języku Rust.\n\n- Last File Manager — Potężny menedżer plików napisany w Pythonie 3 z interfejsem curses.\n\n- lf — Terminalowy menedżer plików napisany w języku Go przy użyciu architektury serwer/klient.\n\n- Midnight Commander — Oparty na konsoli, dwupanelowy menedżer plików.\n\n- nffm — \"Nothing Fancy File Manager\", bezmyszowy menedżer plików ncurses napisany w C.\n\n- nnn — Niewielki, szybki i bogaty w funkcje menedżer plików.\n\n- Pilot — Menedżer plików dostarczany z klientem poczty Alpine.\n\n- Ranger — Konsolowy menedżer plików z powiązaniami vi, możliwością dostosowywania i wieloma funkcjami.\n\n- sfm — prosty menedżer plików dla systemów uniksopodobnych.\n\n- TUIFI Manager — Wieloplatformowy, terminalowy menedżer plików (i komponent) zorientowany na system Termux, przeznaczony do użytku z projektem Uni-Curses lub bez niego.\n\n- Vifm — Oparty na Ncurses dwupanelowy menedżer plików z powiązaniami klawiszy podobnymi do vi.\n\n- xplr — Hakowalny, minimalny, szybki eksplorator plików TUI.\n\n- yazi — Niesamowicie szybki terminalowy menedżer plików napisany w Rust, oparty na asynchronicznym I/O.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Caja — Menedżer plików dla pulpitu MATE.\n\n- CoreFM — Prosty, lekki i łatwy w użyciu menedżer plików z wieloma funkcjami, takimi jak podgląd obrazów, obsługa ikon mime, widok podzielony, automatyczne montowanie nośników wymiennych, obsługa przeciągania i upuszczania itp. Część pakietu C-Suite.\n\n- Deepin File Manager — Menedżer plików opracowany dla Deepin.\n\n- Dolphin — Menedżer plików dołączony do pulpitu KDE. Część kde-system.\n\n- fm — Menedżer plików oparty na terminalu.\n\n- Gentoo — Lekki menedżer plików dla GTK.\n\n- GNOME Files — Rozszerzalny, ciężki menedżer plików używany domyślnie w środowisku GNOME z obsługą własnych skryptów. Część gnome.\n\n- Index — Menedżer plików umożliwiający przeglądanie plików systemowych i aplikacji oraz podgląd plików muzycznych, tekstowych, graficznych i wideo, a także udostępnianie ich aplikacjom zewnętrznym. Część maui.\n\n- Konqueror — Menedżer plików i przeglądarka internetowa dla pulpitu KDE.\n\n- Liri Files — Menedżer plików dla Liri.\n\n- Nemo — Nemo jest menedżerem plików pulpitu Cinnamon. Jest rozwidleniem Nautilusa.\n\n- Pantheon Files — Przeglądarka plików zaprojektowana dla elementary OS.\n\n- PathFinder — Przeglądarka plików dostarczana z FOX toolkit.\n\n- PCManFM — Bardzo szybki i lekki menedżer plików, który może również opcjonalnie zarządzać ikonami i tłem pulpitu.\n\n- PCManFM-Qt — Port Qt menedżera plików PCManFM.\n\n- Peony — Menedżer plików dla pulpitu UKUI.\n\n- qtFM — Mały, lekki menedżer plików dla komputerów z systemem Linux oparty na czystym Qt.\n\n- ROX Filer — Mały i szybki menedżer plików, który może opcjonalnie zarządzać tłem pulpitu i panelami.\n\n- Thunar — Menedżer plików, który może być uruchamiany jako demon z doskonałym czasem uruchamiania i ładowania katalogów.\n\nNależy pamiętać, że niektóre z tych dwupanelowych menedżerów plików można również skonfigurować tak, aby miały tylko jeden panel.\n\n- Double Commander — Menedżer plików z dwoma panelami obok siebie. Jest inspirowany Total Commanderem i zawiera kilka nowych pomysłów.\n\n- GNOME Commander — Dwupanelowy menedżer plików dla środowiska GNOME.\n\n- Krusader — Zaawansowany dwupanelowy (w stylu Midnight Commander) menedżer plików dla pulpitu KDE.\n\n- muCommander — Lekki, wieloplatformowy menedżer plików z dwupanelowym interfejsem napisany w Javie.\n\n- SpaceFM — Wielopanelowy menedżer plików GTK z zakładkami.\n\n- Sunflower — Mały i wysoce konfigurowalny dwupanelowy menedżer plików dla systemu Linux z obsługą wtyczek.\n\n- Tux Commander — Menedżer plików z oknem i dwoma panelami obok siebie, podobny do popularnych menedżerów plików Total Commander lub Midnight Commander.\n\n- Worker — Szybki, lekki i bogaty w funkcje menedżer plików dla X Window System.\n\n- Xfe — Menedżer plików dla X (X File Explorer) podobny do Microsoft Explorer.\n\n"
    },
    {
      "title": "Zarządzanie śmieciami",
      "level": 3,
      "content": "Zobacz Trash management#Trash creation.\n\n"
    },
    {
      "title": "Synchronizacja plików i tworzenie kopii zapasowych",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Synchronization and backup programs#Data synchronization.** This article or section is a candidate for merging with Synchronization and backup programs#Data synchronization.\n\nThis article or section is a candidate for merging with Synchronization and backup programs#Data synchronization.\n\nZobacz także Synchronization and backup programs, Wikipedia:Comparison of file synchronization software i Wikipedia:Comparison of backup software.\n\n- borg — Deduplikujący program do tworzenia kopii zapasowych z kompresją i uwierzytelnionym szyfrowaniem, który obsługuje tworzenie kopii zapasowych przez ssh\n\n- Déjà Dup — Prosty program GTK do tworzenia kopii zapasowych. Ukrywa złożoność tworzenia kopii zapasowych we \"właściwy sposób\" (szyfrowane, poza siedzibą i regularne) i używa duplicity jako backendu.\n\n- DirSync Pro — Małe, ale potężne narzędzie do synchronizacji plików i folderów.\n\n- Duplicati — Klient kopii zapasowych, który bezpiecznie przechowuje zaszyfrowane, przyrostowe, skompresowane kopie zapasowe w usługach przechowywania w chmurze i na zdalnych serwerach plików.\n\n- duplicity — Proste narzędzie wiersza poleceń, które umożliwia tworzenie zaszyfrowanych, skompresowanych, przyrostowych kopii zapasowych na niemal dowolnej pamięci masowej.\n\n- Duply — Interfejs wiersza poleceń dla duplicity, który upraszcza jego uruchamianie. Zarządza ustawieniami zadań tworzenia kopii zapasowych w profilach i umożliwia wsadowe wykonywanie poleceń.\n\n- FreeFileSync — Oprogramowanie do porównywania i synchronizacji folderów, które tworzy i zarządza kopiami zapasowymi wszystkich ważnych plików.\n\n- git-annex — Zarządzanie plikami za pomocą git, dodawania zawartości pliku do git.\n\n- grsync — GUI GTK+ dla rsync do synchronizacji folderów, plików i tworzenia kopii zapasowych\n\n- hsync — Program wiersza poleceń do synchronizacji tylko tych plików, których nazwy zostały zmienione/przeniesione, ale poza tym nie uległy zmianie. Działa poprzez wydawanie prostych operacji przenoszenia w miejscu docelowym bez faktycznego przesyłania plików i ma być używany w połączeniu z innymi programami do synchronizacji, które nie mają takiej możliwości.\n\n- KBackup — Program do tworzenia kopii zapasowych z łatwym w użyciu interfejsem użytkownika opartym na KDE Frameworks. Część kde-utilities.\n\n- Kup — Planista tworzenia kopii zapasowych dla pulpitu Plasma. Używa bup i rsync jako backend.\n\n- rclone — Program wiersza poleceń do synchronizacji plików i katalogów do i z Amazon S3, Dropbox, Google Drive, Microsoft OneDrive, Yandex Disk i wielu innych usług przechowywania w chmurze, a także między ścieżkami lokalnymi.\n\n- restic — Szybki, bezpieczny i wydajny program do tworzenia kopii zapasowych, który obsługuje tworzenie kopii zapasowych w wielu usługach w chmurze.\n\n- rsync — Program do przesyłania plików wykorzystujący \"algorytm rsync\", który zapewnia bardzo szybką metodę synchronizacji zdalnych plików. Robi to wysyłając tylko różnice w plikach przez łącze, nie wymagając, aby oba zestawy plików były wcześniej obecne na jednym z końców łącza. Posiada multiple frontends available.\n\n- SparkleShare — Aplikacja do udostępniania plików i współpracy napisana w języku C#. Może synchronizować się z dowolnym serwerem Git przez SSH.\n\n- Syncthing — Program do ciągłej synchronizacji plików. Synchronizuje pliki między dwoma lub więcej komputerami w prosty sposób bez zaawansowanej konfiguracji.\n\n- Syncany — Aplikacja do przechowywania i udostępniania plików w chmurze z naciskiem na bezpieczeństwo i abstrakcję pamięci masowej.\n\n- Synkron — Aplikacja, która pomaga zawsze aktualizować pliki i foldery. Możesz łatwo zsynchronizować swoje dokumenty, muzykę lub zdjęcia, aby wszędzie mieć ich najnowsze wersje.\n\n- Tarsnap — Bezpieczna i wydajna usługa tworzenia kopii zapasowych online.\n\n- Timeshift — Narzędzie do przywracania systemu dla Linuksa.\n\n- Unison — Narzędzie do synchronizacji plików, które umożliwia przechowywanie dwóch replik kolekcji plików i katalogów na różnych hostach (lub różnych dyskach na tym samym hoście), modyfikowanie ich osobno, a następnie aktualizowanie poprzez propagowanie zmian w każdej replice do drugiej.\n\n- YARsync — Wrapper wokół rsync napisany w Pythonie, zapewniający synchronizację plików i tworzenie kopii zapasowych z interfejsem podobnym do git.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "Aby zapoznać się z narzędziami wiersza poleceń do archiwizacji i kompresji, zobacz Archiving and compression.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- 360zip — Zastrzeżone narzędzie do archiwizacji.\n\n- Ark — Narzędzie do archiwizacji dołączone do pulpitu KDE. Część kde-utilities.\n\n- Arqiver — Prosty menedżer archiwów Qt oparty na libarchive.\n\n- CoreArchiver — Proste narzędzie do kompresji/rozpakowywania plików oparte na Qt i libarchive-qt. Część C-Suite.\n\n- Deepin Archive Manager — Szybka i lekka aplikacja do tworzenia i rozpakowywania archiwów.\n\n- Engrampa — Menedżer archiwów dla MATE\n\n- File Roller — Menedżer archiwów dla pulpitu GNOME. Część gnome-extra.\n\n- LXQt File Archiver — Prosty i lekki, niezależny od pulpitu archiwizator plików Qt.\n\n- p7zip-gui — GUI należący do oprogramowania p7zip.\n\n- PeaZip — Menedżer plików i archiwów o otwartym kodzie źródłowym.\n\n- Xarchiver — Lekki, niezależny od pulpitu menedżer archiwów zbudowany przy użyciu GTK.\n\n"
    },
    {
      "title": "Porównywanie, scalanie",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of file comparison tools.\n\nDo zarządzania plikami pacnew/pacsave istnieją wyspecjalizowane narzędzia. Zobacz Pacnew and Pacsave files#Managing .pac* files.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "Zobacz diff(1) z diffutils oraz alternatywy.\n\n- colordiff — Wrap skryptu Perla dla \"diff\", które generuje te same dane wyjściowe, ale z ładnym podświetleniem \"składni\".\n\n- diff-highlight — Skrypt Perl do podświetlania zmienionych części w parach linii wyniku diff -u\n\n- diffr — Narzędzie Rust do ładnego drukowania diff z podświetlaniem na poziomie słów w celu ułatwienia przeglądania.\n\n- ydiff — Wrapper Pythona do uzyskiwania podświetlonych danych wyjściowych diff ze stdin lub plików/katalogów śledzonych przez VCS, w widoku niezmienionym lub obok siebie.\n\n- delta — Przeglądarka różnic napisana w języku Rust z podświetlaniem składni.\n\n- diff-so-fancy — Dekorator danych wyjściowych diff. Nie oblicza on różnicy, a jedynie ją dekoruje.\n\n- difftastic — Porównuje pliki przy użyciu ich drzew składni\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- DiffPDF — Porównanie tekstu lub wyglądu każdej strony w dwóch plikach PDF.\n\n- Diffuse — Małe i proste narzędzie do scalania tekstu napisane w Pythonie.\n\n- KDiff3 — Narzędzie do porównywania i scalania plików i katalogów dla pulpitu KDE.\n\n- Kompare — Program GUI do przeglądania i łączenia różnic między plikami źródłowymi. Obsługuje różne formaty różnic i zapewnia wiele opcji dostosowywania wyświetlanego poziomu informacji. Część kdesdk[broken link: package not found].\n\n- Meld — Wizualne narzędzie do porównywania i scalania, które może porównywać pliki, katalogi i projekty kontrolowane wersjami.\n\n- xxdiff — Graficzna przeglądarka różnic między plikami i katalogami.\n\nVim i Emacs zapewniają funkcjonalność łączenia z vimdiff oraz ediff.\n\n"
    },
    {
      "title": "Masowe renamery",
      "level": 3,
      "content": "Od tłumacza: tj. \"zmieniacze nazw\"\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "Zobacz rename(1) z util-linux.\n\n- brn2 — szybka masowa zmiana nazwy z zamianą.\n\n- edir — Zmieniaj nazwy, usuwaj i kopiuj pliki i katalogi za pomocą edytora (rozszerzony vidir).\n\n- f2 — Wieloplatformowe narzędzie wiersza poleceń do szybkiej i bezpiecznej wsadowej zmiany nazw plików i katalogów, może również zmieniać nazwy plików na podstawie tagów audio.\n\n- nomino — Narzędzie do masowej zmiany nazw dla programistów.\n\n- rename.pl — Masowy renamer oparty na perl regex.\n\n- vidir — Zmieniaj nazwy i usuwaj pliki i katalogi za pomocą edytora.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Caja-Rename — Rozszerzenie do masowej zmiany nazwy dla Caja.\n\n- CoreRenamer — Prosta, lekka aplikacja do masowej zmiany nazw plików. Część pakietu C-Suite.\n\n- GPRename — Masowy renamer GTK dla plików i katalogów.\n\n- KRename — Bardzo wydajny program do masowej zmiany nazw plików dla pulpitu KDE.\n\n- metamorphose2 — oparty na wxPython program do masowej zmiany nazw z obsługą wyrażeń regularnych, zmiany nazw plików multimedialnych zgodnie z ich metadanymi itp.\n\n- Thunar Bulk Rename — Zmienia nazwę wielu plików jednocześnie, używając jakiegoś kryterium, które odnosi się do przynajmniej jednego z plików. Uruchamiane z thunar -B.\n\n"
    },
    {
      "title": "Wyszukiwanie plików",
      "level": 3,
      "content": "Ta sekcja zawiera listę narzędzi do wyszukiwania plików na podstawie nazwy pliku, ścieżki do pliku lub metadanych. Wyszukiwanie pełnotekstowe znajduje się w następnej sekcji.\n\nZobacz także Wikipedia:List of search engines#Desktop search engines.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "Zobacz find(1) z findutils oraz alternatywy.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Catfish — Wszechstronne narzędzie do wyszukiwania plików przez Xfce, może być zasilane przez find, locate i Zeitgeist.\n\n- CoreHunt — Łatwe w użyciu, szybkie narzędzie do wyszukiwania plików z wyszukiwaniem skategoryzowanym i historią wyszukiwania. Część C-Suite.\n\n- Czkawka — Narzędzie do wyszukiwania plików GTK z zaawansowanymi funkcjami, może również znajdować podobne obrazy i filmy.\n\n- GNOME Search Tool — Narzędzie GNOME do wyszukiwania plików, zależne od GNOME/Files.\n\n- KFind — Narzędzie wyszukiwania dla KDE do znajdowania plików według nazwy, typu lub zawartości. Posiada wyszukiwanie wewnętrzne i obsługuje lokalizację. Część kde-utilities.\n\n- MATE Search Tool — Narzędzie MATE do wyszukiwania plików.\n\n- regexxer — Interaktywne narzędzie do wyszukiwania i zamiany, obsługujące wyrażenia regularne w stylu Perla.\n\n- Searchmonkey — Potężne narzędzie wyszukiwania GUI do dopasowywania wzorców regex.\n\nProgramy te indeksują pliki, umożliwiając ich szybkie wyszukiwanie.\n\n- fsearch — Narzędzie do szybkiego wyszukiwania plików dla systemów uniksopodobnych oparte na GTK 3.\n\n- angrysearch — Narzędzie do wyszukiwania plików w systemie Linux z natychmiastowymi wynikami podczas pisania.\n\n"
    },
    {
      "title": "Wyszukiwanie pełnotekstowe",
      "level": 3,
      "content": "Zobacz grep(1) z grep i alternatywy, które zapewniają nieindeksowane wyszukiwanie pełnotekstowe.\n\n"
    },
    {
      "title": "Indeksatory pełnotekstowe",
      "level": 4,
      "content": "- Baloo — Rozwiązanie KDE do indeksowania i wyszukiwania plików, posiada CLI i jest używane przez KRunner.\n\n- DocFetcher — Graficzna aplikacja Java do wyszukiwania na pulpicie.\n\n- MeiliSearch — Błyskawiczna, niezwykle trafna i odporna na literówki wyszukiwarka.\n\n- Namazu — Wyszukiwarka pełnotekstowa\n\n- Recoll — Narzędzie do wyszukiwania pełnotekstowego oparte na Xapian, posiada CLI i GUI.\n\n- Tracker — Uniwersalny indeksator, narzędzie wyszukiwania i baza metadanych używana przez GNOME Dokumenty, Muzyka, Zdjęcia i Filmy.\n\n- Zeitgeist — Frameworrk do agregacji zdarzeń aktywności użytkownika i powiadomień (otwierane pliki, odwiedzane strony internetowe, prowadzone rozmowy itp.\n\n"
    },
    {
      "title": "Kuźnie kodu (forges)",
      "level": 3,
      "content": "- GitLab — Aplikacja do zarządzania projektami i hostingu kodu.\n\n- Gitea — Bezbolesna, samodzielnie hostowana usługa Git. Fork of Gogs.\n\n- Forgejo — Lekka kuźnia oprogramowania. Projekt społecznościowy oparty na Gitea.\n\n"
    },
    {
      "title": "Klienty kuźni kodu",
      "level": 4,
      "content": "- git-open — Otwórz stronę repozytorium (GitHub, GitLab, Bitbucket) w przeglądarce\n\n- github-cli — Oficjalne narzędzie wiersza poleceń GitHub\n\n- hub — Interfejs wiersza poleceń dla GitHub\n\n- hut — Interfejs wiersza poleceń dla Sourcehut\n\n- lab — Narzędzie typu hub dla GitLab\n\n- snippet — Oparty na terminalu interfejs do tworzenia nowego fragmentu GitLab\n\n"
    },
    {
      "title": "Systemy kontroli wersji",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of revision control software.\n\n- Bazaar — Rozproszony system kontroli wersji, który pomaga śledzić historię projektu w czasie i łatwo współpracować z innymi.\n\n- CVS — Concurrent Versions System, system kontroli wersji klient-serwer.\n\n- Darcs — Rozproszony system kontroli wersji, który został zaprojektowany w celu zastąpienia tradycyjnych, scentralizowanych systemów kontroli źródeł, takich jak CVS i Subversion.\n\n- Fossil — Rozproszony VCS ze śledzeniem błędów, wiki, forum i technotes.\n\n- Git — Rozproszony system kontroli wersji i zarządzania kodem źródłowym z naciskiem na szybkość.\n\n- Mercurial — Rozproszony system kontroli wersji napisany w Pythonie i pod wieloma względami podobny do Gita.\n\n- Subversion — W pełni funkcjonalny scentralizowany system kontroli wersji, pierwotnie zaprojektowany jako lepszy CVS.\n\n"
    },
    {
      "title": "Automatyzacja kompilacji",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of build automation software.\n\n- Apache Ant — Biblioteka Java i narzędzie wiersza poleceń, którego zadaniem jest sterowanie procesami opisanymi w plikach kompilacji jako cele i punkty rozszerzeń zależne od siebie.\n\n- Apache Maven — Narzędzie do automatyzacji kompilacji używane głównie w Javie.\n\n- Bazel — Narzędzie o otwartym kodzie źródłowym, które umożliwia zautomatyzowane tworzenie i testowanie oprogramowania.\n\n- CMake — Rodzina narzędzi przeznaczonych do tworzenia, testowania i pakowania oprogramowania.\n\n- GNU make — Narzędzie GNU make do utrzymywania grup programów.\n\n- Meson — Niezwykle szybki i przyjazny dla użytkownika system kompilacji.\n\n- Gradle — Potężny system kompilacji dla JVM.\n\n- Phing — Program PHP przeznaczony do automatyzacji wszelkiego rodzaju zadań.\n\n"
    },
    {
      "title": "Zintegrowane środowiska programistyczne",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of integrated development environments.\n\nLista pod PHP znajduje się w PHP#Development tools.\n\n- Android Studio — Oficjalne środowisko programistyczne Androida oparte na IntelliJ IDEA.\n\n- Anjuta — Wszechstronne IDE z zarządzaniem projektami, kreatorem aplikacji, interaktywnym debuggerem, edytorem źródeł, obsługą kontroli wersji i wieloma innymi narzędziami.\n\n- Aptana Studio — IDE oparte na Eclipse, ale ukierunkowane na tworzenie stron internetowych, z obsługą HTML, CSS, Javascript, Ruby on Rails, PHP, Adobe AIR i innych.\n\n- Bluefish — Potężny edytor skierowany do programistów i twórców stron internetowych, z wieloma opcjami pisania stron internetowych, skryptów i kodu programowania. Obsługuje wiele języków programowania i znaczników.\n\n- Code::Blocks — IDE C, C++ i Fortrana zbudowane, aby sprostać najbardziej wymagającym potrzebom użytkowników. Został zaprojektowany tak, aby był bardzo rozszerzalny i w pełni konfigurowalny.\n\n- CLion — Wieloplatformowe IDE dla języków C i C++.\n\n- CodeLite — Otwarte i wieloplatformowe IDE C/C++/PHP i Node.js napisane w C++.\n\n- Eclipse — IDE dla Java, C/C++, PHP, Perl i Python z obsługą Subversion i zarządzaniem zadaniami.\n\n- Eric — W pełni funkcjonalne IDE Python i Ruby napisane w PyQt5.\n\n- Gambas — IDE oparte na interpreterze języka Basic z rozszerzeniami obiektowymi.\n\n- Geany — Małe i lekkie IDE z obsługą wielu języków programowania i znaczników, w tym C, Java, PHP, HTML, Python, Perl, Pascal.\n\n- GNOME Builder — Narzędzie do pisania i współtworzenia świetnych aplikacji opartych na GNOME. Część gnome-extra.\n\n- KDevelop — W pełni funkcjonalne, rozszerzalne wtyczkami IDE dla C/C++ i innych języków programowania. Część kde-applications.\n\n- Komodo Edit — Darmowy, wielojęzyczny edytor.\n\n- Lapce — Błyskawiczny i wydajny edytor kodu napisany w języku Rust.\n\n- Lazarus — IDE kompatybilne z Delphi (Object Pascal) do szybkiego tworzenia aplikacji. Posiada różnorodne komponenty gotowe do użycia oraz graficzny kreator formularzy do łatwego tworzenia złożonych graficznych interfejsów użytkownika.\n\n- LiteIDE — Proste IDE Go.\n\n- Lite XL — Lekki, prosty, szybki, pełen funkcji i niezwykle rozszerzalny edytor tekstu napisany w C i Lua, zaadaptowany z lite.\n\n- MPLAB — IDE dla rozwoju Microchip PIC i dsPIC.\n\n- Netbeans — IDE do programowania w językach Java, JavaScript, PHP, Python, Ruby, Groovy, C, C++, Scala, Clojure i innych.\n\n- PhpStorm — JetBrains PhpStorm to komercyjne, wieloplatformowe IDE dla PHP zbudowane na platformie IntelliJ IDEA firmy JetBrains, zapewniające edytor dla PHP, HTML i JavaScript z analizą kodu w locie, zapobieganiem błędom i automatyczną refaktoryzacją kodu PHP i JavaScript.\n\n- Qt Creator — Lekkie, wieloplatformowe zintegrowane środowisko programistyczne C++ z naciskiem na Qt.\n\n- Theia — Eclipse Theia to darmowe i otwarte IDE dla aplikacji desktopowych i webowych. Jest zaimplementowany w TypeScript, oparty na Visual Studio Code i kładzie nacisk na rozszerzalność. Może być uruchamiana jako aplikacja webowa lub desktopowa.\n\n- Visual Studio Code — Visual Studio Code to wieloplatformowy, darmowy i otwarty edytor tekstu opracowany przez Microsoft, napisany w JavaScript i TypeScript. Obsługuje różne języki dzięki swoim rozszerzeniom.\n\n- VSCodium — Wolne/biblioteczne oprogramowanie Open Source Binaries of VSCode.\n\n- ZeroBrane Studio — IDE z obsługą debugowania dla Lua 5.1, Lua 5.2, Lua 5.3, LuaJIT i innych silników Lua.\n\n"
    },
    {
      "title": "IDE dla Javy",
      "level": 4,
      "content": "- BlueJ — W pełni funkcjonalne IDE dla Javy używane głównie do celów edukacyjnych i dla początkujących.\n\n- IntelliJ IDEA — IDE dla Javy, Groovy i innych języków programowania z zaawansowanymi funkcjami refaktoryzacji.\n\n"
    },
    {
      "title": "IDE dla Pythona",
      "level": 4,
      "content": "- Ninja-IDE — IDE do programowania w Pythonie.\n\n- PyCharm — IDE dla Pythona z obsługą analizy kodu, debugowania, testów jednostkowych, kontroli wersji i tworzenia stron internetowych z Django.\n\n- Spyder — Naukowe środowisko programistyczne dla Pythona zapewniające funkcje podobne do MATLAB.\n\n- Thonny — IDE dla Pythona dla początkujących.\n\n- WingIDE — Zastrzeżone środowisko programistyczne dla Pythona. Jest w pełni funkcjonalne i przeznaczone do użytku profesjonalnego.\n\n"
    },
    {
      "title": "Edukacyjne IDE",
      "level": 4,
      "content": "- KTurtle — Edukacyjne środowisko programistyczne, którego celem jest ułatwienie nauki programowania. Część kde-education.\n\n- Processing — Plac zabaw do nauczania nie-programistów podstaw programowania komputerowego w kontekście wizualnym.\n\n- Scratch — System programowania i narzędzie do tworzenia treści do celów edukacyjnych i rozrywkowych, takich jak tworzenie interaktywnych projektów i prostych gier opartych na sprite'ach. Jest używany głównie przez niewykwalifikowanych użytkowników (takich jak dzieci) jako wstęp do programowanie sterowane zdarzeniami.\n\n"
    },
    {
      "title": "Debugery",
      "level": 3,
      "content": "- Accerciser — Interaktywny eksplorator dostępności w języku Python. Wykorzystuje bibliotekę AT-SPI do sprawdzania, badania i interakcji z widżetami, umożliwiając sprawdzenie, czy aplikacja dostarcza prawidłowych informacji technologiom wspomagającym i zautomatyzowanym ramom testowym. Część gnome-extra.\n\n- Accessibility Inspector — Inspektor drzewa dostępności aplikacji. Część kde-accessibility.\n\n- bin-cpuflags-x86 — Małe narzędzie CLI do wykrywania flag procesora (zestawów instrukcji) plików binarnych X86.\n\n- Bustle — Rysuje diagramy sekwencji aktywności magistrali D-Bus. Pokazuje emisje sygnałów, wywołania metod i odpowiadające im zwroty, ze znacznikami czasu dla każdego zdarzenia i czasu trwania każdego wywołania metody.\n\n- Data Display Debugger — Graficzny interfejs dla debuggerów wiersza poleceń, takich jak GDB.\n\n- Desed — Oparty na TUI debugger dla sed. Zawiera podgląd zmiennych i wyrażeń regularnych, ustawianie punktów przerwania oraz przechodzenie do przodu i do tyłu.\n\n- D-Spy — Łatwy w użyciu debugger D-Bus. Jest jak d-feet, ale napisany w C i niesamowicie szybki. Część gnome-extra.\n\n- GammaRay — Narzędzie do inspekcji i manipulacji aplikacjami Qt.\n\n- GDBFrontend — Łatwy, elastyczny i rozszerzalny debuger graficzny.\n\n- Heaptrack — Profiler pamięci heap dla systemu Linux.\n\n- KCachegrind — Narzędzie do wizualizacji danych profilu, używane do określenia najbardziej czasochłonnych części wykonawczych programu. Część kdesdk[broken link: package not found].\n\n- KDbg — Graficzny interfejs użytkownika do GDB, debugera GNU. Zapewnia intuicyjny interfejs do ustawiania punktów przerwania, sprawdzania zmiennych i przechodzenia przez kod.\n\n- KDebugSettings — Aplikacja umożliwiająca wybór wyświetlanych kategorii QLoggingCategory poprzez edycję globalnego pliku konfiguracyjnego użytkownika qtlogging.ini. Część kde-utilities.\n\n- Massif-Visualizer — Wizualizator dla plików danych Valgrind Massif.\n\n- Nemiver — Łatwy w użyciu samodzielny debuger C/C++ (nakładka GDB), który dobrze integruje się ze środowiskiem GNOME.\n\n- Qt QDbusViewer — Narzędzie do introspekcji obiektów i wiadomości D-Bus.\n\n- scanmem — Narzędzie do debugowania przeznaczone do izolowania adresu dowolnej zmiennej w wykonywanym procesie.\n\n- Sysprof — Narzędzie do profilowania, które pomaga znaleźć funkcje, w których program zużywa najwięcej czasu. Część gnome-extra.\n\n"
    },
    {
      "title": "Lexing i parsowanie",
      "level": 3,
      "content": "Lex i Yacc są częścią POSIX.\n\n- flex — Narzędzie do generowania programów skanujących tekst, alternatywa dla Lex.\n\n- Berkeley Yacc — Berkeley'owska reimplementacja uniksowego generatora parserów Yacc.\n\n- GNU Bison — Generator parsera ogólnego przeznaczenia GNU, alternatywa dla byacc.\n\nSą też inne:\n\n- ANTLR — Generator parsera, napisany w Javie, do parsowania plików tekstowych lub binarnych.\n\n- LPeg — Biblioteka dopasowywania wzorców, oparta na PEG-ach, dla Lua.\n\n- peg/leg — Generatory do generowania parserów rekurencyjnych dla C.\n\n- Ragel — Kompiluje skończone maszyny stanów ze zwykłych języków do wykonywalnego kodu C, C++, Objective-C lub D.\n\n"
    },
    {
      "title": "Komunikaty GUI/TUI",
      "level": 3,
      "content": "Programy te zapewniają gotowe interfejsy użytkownika do ostrzegania użytkownika lub proszenia o informacje. Najlepiej nadają się do pisania skryptów powłoki; dla bardziej złożonych przypadków użycia, zobacz #Konstruktory GUI.\n\n- Dialog — Widżety TUI zbudowane przy użyciu ncurses.\n\n- kdialog — Komunikaty GUI oparte na Qt stworzone przez KDE.\n\n- yad (Yet Another Dialog) — Fork Zenity z większą liczbą typów okien dialogowych i obsługą niestandardowych przycisków.\n\n- Zenity — Komunikaty GUI oparte na GTK w GNOME.\n\n"
    },
    {
      "title": "Konstruktory GUI",
      "level": 3,
      "content": "- FLUID — Projektant GUI FLTK.\n\n- Glade — Twórz lub otwieraj projekty interfejsów użytkownika dla aplikacji GTK. Część gnome-extra.\n\n- KImageMapEditor — Edytor map obrazów osadzonych wewnątrz plików HTML, oparty na znaczniku <map>. Część kde-graphics.\n\n- KUIViewer — Szybka przeglądarka dla Qt Designer UI File. Część kdesdk[broken link: package not found].\n\n- Qt Designer — Narzędzie do projektowania i tworzenia graficznych interfejsów użytkownika (GUI) za pomocą Qt Widgets.\n\n"
    },
    {
      "title": "Edytory hex",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of hex editors.\n\n- Bless — Wysokiej jakości, w pełni funkcjonalny edytor szesnastkowy.\n\n- GHex — Edytor heksadecymalny dla środowiska GNOME, który umożliwia wczytanie danych z dowolnego pliku, wyświetlenie ich i edycję w formacie heksadecymalnym lub ascii. Część gnome-extra.\n\n- hyx — Minimalistyczny (< 2300 linii C), ale potężny (hex/ASCII, wstawianie/zastępowanie/usuwanie, kopiowanie/wklejanie, cofanie/ponawianie, wyszukiwanie, kolory, kontrolki inspirowane vimem) edytor hex terminala Linux.\n\n- ImHex — Edytor szesnastkowy dla inżynierów wstecznych, programistów i osób, które cenią swoją siatkówkę oka podczas pracy o 3 nad ranem.\n\n- Okteta — Edytor hex KDE do przeglądania i edycji surowych danych plików.\n\n- Reverse Engineer's Hex Editor — Edytor szesnastkowy z funkcjami analizy i adnotacji formatów plików binarnych\n\n- wxHexEditor — Edytor heksadecymalny dla dużych plików z zaawansowanymi funkcjami, takimi jak surowa pamięć i możliwość edycji na dysku.\n\n"
    },
    {
      "title": "Dumpery hex",
      "level": 3,
      "content": "Zobacz także Wikipedia:Hex dump.\n\n- chd — Obsługujący Unicode zamiennik xxd/hexdump.\n\n- hex — Nowoczesny kolorowy zrzut hex. Nazwa binarna to hx.\n\n- hexd — Nowoczesny kolorowy zrzut hex.\n\n- hexdump — Podstawowy zrzut hex ze standardowego pakietu util-linux.\n\n- hexyl — Nowoczesny kolorowy zrzut hex.\n\n- hexxy — Nowoczesny kolorowy zrzut hex.\n\n- huxdemp — Zaawansowana i kolorowa wersja hexdump używająca pagera. Nazwa binarna to huxd.\n\n- phd — Kolorowy zrzut hex. pwn phd.\n\n- ugrep — Alternatywa Grep z funkcją zrzutu hexowego. ug --hexdump.\n\n- unidump — hexdump dla danych Unicode.\n\n- xxd — Podstawowy zrzut hex z vima.\n\n"
    },
    {
      "title": "Narzędzia JSON",
      "level": 3,
      "content": "- gron — gron przekształca JSON w dyskretne przypisania, aby ułatwić grepowanie.\n\n- jid — Koparka przyrostowa JSON\n\n- jo — Polecenie do tworzenia JSON.\n\n- jq — Procesor JSON wiersza poleceń\n\n- jshon — Parser JSON dla powłoki.\n\n- powłoka Elvish ma wbudowaną obsługę JSON\n\n"
    },
    {
      "title": "Programowanie piśmienne",
      "level": 3,
      "content": "Zobacz także Wikipedia:pl:Literate programming.\n\n- Noweb — Proste, rozszerzalne narzędzie do programowania z użyciem bibliotek ICON i texlive\n\n- nuweb — Proste narzędzie do programowania piśmiennego\n\n"
    },
    {
      "title": "Modelery UML",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of Unified Modeling Language tools.\n\n- ArgoUML — Narzędzie do modelowania UML z obsługą wszystkich standardowych diagramów UML 1.4.\n\n- Eclipse Modeling Tools — Narzędzia i środowiska uruchomieniowe do tworzenia aplikacji opartych na modelach.\n\n- Gaphor — Proste narzędzie do modelowania UML.\n\n- Modelio — Środowisko modelowania wspierające główne standardy: UML, BPMN, MDA, SysML.\n\n- Papyrus — Narzędzie inżynieryjne oparte na modelu, bazujące na Eclipse.\n\n- PlantUML — Narzędzie do tworzenia diagramów UML ze zwykłego języka tekstowego.\n\n- PlantUML QEditor — Edytor PlantUML napisany w Qt.\n\n- Umbrello — Program do tworzenia diagramów w zunifikowanym języku modelowania (UML) oparty na technologii KDE. Część kdesdk[broken link: package not found].\n\n- UMLet — Narzędzie UML z prostym interfejsem użytkownika: szybkie rysowanie diagramów UML, tworzenie diagramów sekwencji i aktywności ze zwykłego tekstu, eksportowanie diagramów do formatów eps, pdf, jpg, svg i schowka, udostępnianie diagramów za pomocą Eclipse i tworzenie nowych, niestandardowych elementów UML.\n\n- UML/INTERLIS-editor — Ułatwienie stosowania podejścia opartego na modelach większej liczbie użytkowników.\n\n- Violet — Bardzo łatwy w nauce i obsłudze edytor UML, który rysuje ładnie wyglądające diagramy.\n\n"
    },
    {
      "title": "Przeglądarki dokumentacji API",
      "level": 3,
      "content": "- Devhelp — Narzędzie dla programistów do przeglądania i przeszukiwania dokumentacji API. Część gnome-extra.\n\n- Doc Browser — Przeglądarka dokumentacji API z obsługą DevDocs i Hoogle.\n\n- Qt Assistant — Narzędzie do przeglądania dokumentacji online w formacie pliku pomocy Qt.\n\n- quickDocs — Szybki czytnik dokumentów deweloperskich do czytania Valadoc i DevDocs.\n\n- Zeal — Offline'owa przeglądarka dokumentacji API dla programistów.\n\n"
    },
    {
      "title": "Systemy śledzenia zgłoszeń",
      "level": 3,
      "content": "- Bugzilla — Moduł Mozilli do śledzenia błędów.\n\n- Flyspray — Lekki, internetowy system śledzenia błędów napisany w PHP\n\n- MantisBT — Internetowy system śledzenia zgłoszeń\n\n- Redmine — Elastyczna aplikacja internetowa do zarządzania projektami. Napisana przy użyciu Ruby on Rails, jest wieloplatformowa i obsługuje wiele baz danych.\n\n- Trac — Trac Zintegrowany SCM i zarządzanie projektami przy użyciu Apache i Subversion.\n\nZobacz także Git server#Advanced web applications.\n\n"
    },
    {
      "title": "Recenzja kodu",
      "level": 3,
      "content": "- Gerrit — Internetowe narzędzie do przeglądania kodu oparte na systemie kontroli wersji Git\n\n- GitLab również obsługuje przeglądy kodu.\n\nZobacz także Wikipedia:List of tools for code review.\n\n"
    },
    {
      "title": "Tworzenie gier",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of game engines.\n\n- Allegro — Wieloplatformowa biblioteka przeznaczona głównie do programowania gier wideo i multimediów.\n\n- GDevelop — Kreator gier zaprojektowany do użytku przez każdego - nie wymaga umiejętności programowania.\n\n- Godot — Zaawansowany, bogaty w funkcje, wieloplatformowy silnik gier 2D i 3D. Twórz gry z łatwością, korzystając z unikalnego podejścia Godot do tworzenia gier.\n\n- LibreSprite — Edytor animowanych sprite'ów i narzędzie do pixel artu umożliwia tworzenie animacji 2D na potrzeby gier wideo.\n\n- LÖVE — Środowisko programowania gier oparte na języku Lua.\n\n- Pixelorama — edytor sprite'ów 2D z obsługą animacji, stworzony przez Orama Interactive na silniku Godot Engine przy użyciu GDScript.\n\n- TIC-80 — Wirtualna (fantasy) komputer/konsola.\n\n- Tiled — Edytor poziomów 2D ogólnego przeznaczenia z potężnymi funkcjami edycji map kafelkowych. Jest łatwy w użyciu i nadaje się do wielu rodzajów gier.\n\n- Unity — Unity to elastyczna i potężna platforma programistyczna do tworzenia wieloplatformowych gier 3D i 2D. Zastrzeżona, ale darmowa wersja jest dostępna dla niektórych przypadków użycia (zobacz tutaj, aby uzyskać więcej informacji).\n\n"
    },
    {
      "title": "Menedżery repozytorium",
      "level": 3,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\n- Nexus 2 — Menedżer repozytoriów Nexus 2 (OSS)\n\n- Nexus 3 — Nexus 3 Repozytorium OSS\n\n- Artifactory — Artifactory to zaawansowany menedżer repozytoriów binarnych do użytku przez narzędzia kompilacji, narzędzia do zarządzania zależnościami i serwery kompilacji\n\n"
    },
    {
      "title": "Selektory znaków",
      "level": 3,
      "content": "- emote — Nowoczesny selektor emoji napisany w GTK3.\n\n- GNOME Characters — Aplikacja mapy znaków dla środowiska GNOME. Część gnome.\n\n- gucharmap — Selektor znaków GTK 3 dla środowiska GNOME.\n\n- KCharSelect — Narzędzie do wybierania znaków specjalnych ze wszystkich zainstalowanych czcionek i kopiowania ich do schowka. Część kde-utilities.\n\n"
    },
    {
      "title": "Klawiatury ekranowe",
      "level": 3,
      "content": "- CellWriter — Siatkowy panel wprowadzania danych z rozpoznawaniem pisma ręcznego.\n\n- CoreKeyboard — Prosta wirtualna klawiatura Qt oparta na X11 z sugestiami słów. Część C-Suite.\n\n- eekboard — Łatwy w użyciu zestaw narzędzi wirtualnej klawiatury.\n\n- Florence — Rozszerzalna, skalowalna wirtualna klawiatura ekranowa dla środowiska GNOME, która nie przeszkadza, gdy nie jest potrzebna.\n\n- Maliit Keyboard — Wirtualna klawiatura przydatna dla KDE Plasma-Wayland\n\n- Onboard — Klawiatura ekranowa przydatna dla użytkowników tabletów i osób niepełnosprawnych.\n\n- qtvkbd — Wirtualna klawiatura napisana w Qt, fork kvkbd.\n\n- QVKbd — Wirtualna klawiatura napisana w Qt.\n\n- Squeekboard — Wirtualna klawiatura GTK 3 dla Waylanda, napisana w Rust/C.\n\n- theShell On Screen Keyboard — Klawiatura z ekranem dotykowym dla theShell.\n\n- xvkbd — Wirtualna klawiatura dla systemu okien X.\n\n- wvkbd — Wirtualna klawiatura dla Wayland i wlroots.\n\n"
    },
    {
      "title": "Przełączniki układu klawiatury",
      "level": 3,
      "content": "- fbxkb — Wskaźnik i przełącznik klawiatury zgodny z NETWM. Pokazuje flagę bieżącej klawiatury w obszarze systray i pozwala przełączyć się na inną.\n\n- xxkb — Lekki wskaźnik i przełącznik układu klawiatury.\n\n- gxkb — Wskaźnik i przełącznik układu klawiatury X11.\n\n- qxkb — Przełącznik klawiatury napisany w Qt.\n\n- X Neural Switcher — Analizator tekstu wykrywa język wprowadzanych danych i w razie potrzeby koryguje układ klawiatury.\n\n"
    },
    {
      "title": "Menedżery powiązań klawiszy",
      "level": 3,
      "content": "Zobacz Keyboard shortcuts#Xorg.\n\n"
    },
    {
      "title": "Metody wprowadzania danych",
      "level": 3,
      "content": "Zobacz główny artykuł: Input method.\n\n"
    },
    {
      "title": "Narzędzia do partycjonowania",
      "level": 3,
      "content": "Zobacz Partitioning#Partitioning tools.\n\n"
    },
    {
      "title": "Narzędzia do formatowania",
      "level": 3,
      "content": "Zobacz File systems#Types of file systems.\n\n"
    },
    {
      "title": "Narzędzia do klonowania",
      "level": 3,
      "content": "Zobacz Disk cloning.\n\n"
    },
    {
      "title": "Narzędzia do montowania",
      "level": 3,
      "content": "Zobacz także udisks#Mount helpers.\n\n- 9mount — Montowanie systemów plików 9p.\n\n- cryptmount — Do montowania zaszyfrowanego systemu plików jako zwykły użytkownik.\n\n- KDiskFree — Wyświetla informacje o dyskach twardych i innych urządzeniach pamięci masowej. Umożliwia także montowanie i odmontowywanie dysków oraz wyświetlanie ich w menedżerze plików. Część kde-utilities.\n\n- ldm — Lekki demon, który automatycznie montuje dyski przy użyciu udev\n\n- pmount — Zamontuj źródło jako zwykły użytkownik do automatycznie utworzonego miejsca docelowego /media/source_name.\n\n- pmount-safe-removal — Montowanie urządzeń wymiennych jako zwykły użytkownik z bezpiecznym usuwaniem\n\n- udevil — Montuje urządzenia wymienne jako zwykły użytkownik, wyświetla informacje o urządzeniu i monitoruje jego zmiany. Zależy tylko od udev i glib.\n\n- ws — Montowanie udziałów sieciowych Windows (CIFS i VFS).\n\n- zulucrypt — Interfejs GUI dla cryptsetup do tworzenia, zarządzania i montowania zaszyfrowanych woluminów; obsługuje również encfs\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- duc — Biblioteka i zestaw narzędzi do sprawdzania wykorzystania dysków.\n\n- dust — Bardziej intuicyjna wersja du w Rust.\n\n- gdu — Analizator wykorzystania dysku z interfejsem konsoli napisany w języku Go.\n\n- gt5 — \"du-browser\" z obsługą Diff.\n\n- ncdu — Prosty analizator wykorzystania dysku ncurses.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Filelight — Analizator wykorzystania dysku, który tworzy interaktywną mapę koncentrycznych, podzielonych na segmenty pierścieni, które pomagają wizualizować wykorzystanie dysku na komputerze. Część kde-utilities.\n\n- GNOME Disk Usage Analyzer — Analizator wykorzystania dysku dla środowiska GNOME do sprawdzania rozmiaru folderów i dostępnego miejsca na dysku. Część gnome.\n\n- Graphical Disk Map — Analizator wykorzystania dysku, który rysuje mapę prostokątów o rozmiarach odpowiadających rozmiarom plików lub katalogów.\n\n- fsview (part of Konqueror) — Oparty na KDE analizator wykorzystania dysku, który rysuje mapę prostokątów o rozmiarach odpowiadających rozmiarom plików lub katalogów.\n\n- MATE Disk Usage Analyzer — Narzędzie do analizy wykorzystania dysku dla MATE Desktop.\n\n- qdirstat — Statystyki katalogów oparte na Qt (KDirStat/K4DirStat bez KDE - od autora oryginalnego KDirStat).\n\n"
    },
    {
      "title": "Stan zdrowia dysku",
      "level": 3,
      "content": "Zobacz S.M.A.R.T.#GUI applications.\n\n"
    },
    {
      "title": "Narzędzia do odzyskiwania plików",
      "level": 3,
      "content": "Zobacz File recovery#List of utilities.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Czkawka CLI — Prosta, szybka i darmowa aplikacja do usuwania niepotrzebnych plików z komputera.\n\n- duff — Narzędzie wiersza poleceń do szybkiego wyszukiwania duplikatów w danym zestawie plików.\n\n- fclones — Bardzo szybka wyszukiwarka duplikatów plików napisana w języku rust.\n\n- fdupes — Program do identyfikowania lub usuwania duplikatów plików znajdujących się w określonych katalogach.\n\n- jdupes — Identyfikacja i podejmowanie działań w przypadku duplikatów plików.\n\n- rdfind — Narzędzie wiersza poleceń do wyszukiwania duplikatów plików. Porównuje pliki na podstawie ich zawartości.\n\n- rmlint — Narzędzie do szybkiego wyszukiwania (i opcjonalnego usuwania) duplikatów plików i innych błędów.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- BleachBit — Zwalnia miejsce na dysku i chroni prywatność; zwalnia pamięć podręczną, usuwa pliki cookie, czyści historię internetową, niszczy pliki tymczasowe, usuwa dzienniki i odrzuca śmieci, o których istnieniu nie wiedziałeś.\n\n- Czkawka GUI — Prosta, szybka i darmowa aplikacja do usuwania niepotrzebnych plików z komputera. Wygląda podobnie do FSlint.\n\n- dupeGuru — Narzędzie GUI do wyszukiwania duplikatów plików w systemie.\n\n- FSlint — Narzędzie do wyszukiwania i czyszczenia różnych form kłaczków w systemie plików.\n\n- GConf Cleaner — czyści nieznane/nieprawidłowe klucze GConf, które wciąż znajdują się w bazie danych GConf.\n\n- Shredder — Graficzny interfejs użytkownika dla rmlint.\n\n- Sweeper — Narzędzie do czyszczenia systemu dla KDE. Część kde-utilities.\n\n"
    },
    {
      "title": "Zapisywanie obrazu dysku",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of tools to create Live USB systems.\n\n- Bytewalk — Bytewalk to narzędzie do ekstrakcji oprogramowania układowego i fork binwalk.\n\n- Deepin Boot Maker — Narzędzie do tworzenia dysku rozruchowego dla Deepin OS.\n\n- Fedora Media Writer — Narzędzie, które pomaga użytkownikom umieszczać obrazy Fedory na dyskach przenośnych, takich jak dyski flash.\n\n- GNOME MultiWriter — Zapis pliku ISO na wielu urządzeniach USB jednocześnie. Część gnome-extra.\n\n- Image Burner — Prosta wypalarka obrazów zaprojektowana dla elementary OS.\n\n- ISO Image Writer — Narzędzie KDE do zapisu pliku .iso na dysku USB. Część kde-utilities.\n\n- LiveUSB Install — Instalowanie różnych dystrybucji Linuxa i systemów operacyjnych na wymiennym dysku flash lub dysku zewnętrznym.\n\n- MultiBootUSB — Instaluje wiele dystrybucji live na dysku USB w sposób nieniszczący i ma opcję ich odinstalowania.\n\n- Popsicle — Narzędzie do równoległego flashowania wielu urządzeń USB, napisane w języku Rust.\n\n- SUSE Studio ImageWriter — Narzędzie do zapisywania nieprzetworzonych obrazów dysków i hybrydowych plików ISO na kluczach USB.\n\n- UNetbootin — Instaluje dystrybucje Linux/BSD na partycji lub dysku USB.\n\n- Usbimager — Minimalna aplikacja GUI do zapisu skompresowanych obrazów dysków na napędach USB.\n\n- WoeUSB — Proste narzędzie do tworzenia instalatora Windows na pamięć USB z obrazu ISO lub prawdziwej płyty DVD (fork WinUSB).\n\n- windows2usb — Narzędzie do nagrywania plików ISO systemu Windows na dysk flash w systemie Linux z obsługą MBR/GPT, BIOS/UEFI, FAT32/NTFS\n\n- Ventoy — Nowe bootowalne rozwiązanie USB\n\n"
    },
    {
      "title": "Menedżery zadań",
      "level": 3,
      "content": "- CoreStats — Prosta, lekka przeglądarka zasobów systemowych do monitorowania statystyk CPU, RAM, sieci i IO dysku. Część C-Suite.\n\n- Deepin System Monitor — Monitorowanie stanu procesu systemowego dla pulpitu Deepin.\n\n- GNOME System Monitor — Monitor systemu dla GNOME do przeglądania i zarządzania zasobami systemowymi. Część gnome.\n\n- GNOME Usage — Wyświetlanie informacji o wykorzystaniu zasobów systemowych, takich jak pamięć i miejsce na dysku.\n\n- htop — Prosta, interaktywna przeglądarka procesów ncurses.\n\n- bashtop — Monitor zasobów systemu Linux napisany w bash.\n\n- bpytop — Htop, ale lżejszy i z większą liczbą funkcji.\n\n- btop — Przepisanie bpytop w C++\n\n- bottom — Wieloplatformowy graficzny monitor procesów/systemu.\n\n- gtop — Pulpit nawigacyjny monitorowania systemu dla terminala.\n\n- Linux Process Explorer — Graficzny eksplorator procesów dla systemu Linux.\n\n- LXTask — Lekki menedżer zadań dla LXDE.\n\n- qps — Lekki menedżer zadań dla LXQt.\n\n- MATE System Monitor — Monitor systemu dla MATE.\n\n- Plasma System Monitor — Zaawansowany i konfigurowalny monitor systemu dla KDE. Część plasma.\n\n- Task Manager — Menedżer procesów oparty na GTK2/GTK3 z podstawowym monitorem zasobów systemowych dla Xfce.\n\n"
    },
    {
      "title": "Monitorowanie systemu",
      "level": 3,
      "content": "Zobacz także Category:Monitoring.\n\n- Collectd — Prosty, rozszerzalny demon monitorowania systemu oparty na rrdtool. Ma niewielkie rozmiary i może być skonfigurowany jako samodzielna aplikacja lub jako serwer/klient.\n\n- collectl — Collectl to lekkie narzędzie do monitorowania wydajności, zdolne do interaktywnego raportowania, a także rejestrowania na dysku. Raportuje statystyki dotyczące procesora, dysku, infiniband, lustre, pamięci, sieci, nfs, procesu, quadrics, slabs i innych w łatwym do odczytania formacie.\n\n- Conky — Lekki, skryptowalny monitor systemu.\n\n- CoreFreq — Niskopoziomowy monitor procesora z funkcjami podobnymi do BIOS-u.\n\n- dool — Wszechstronne narzędzie do statystyki zasobów.\n\n- Fsniper — Demon uruchamiający skrypty na podstawie zmian w plikach monitorowanych przez inotify.\n\n- GKrellM — Prosty, elastyczny pakiet monitora systemowego dla GTK z wieloma wtyczkami.\n\n- glances — Narzędzie do monitorowania oparte na CLI curses w Pythonie.\n\n- hitome — Szybki monitor systemu, który nie wymaga dużych zasobów.\n\n- kmon — Menedżer jądra Linux i monitor aktywności.\n\n- Mission Center — Aplikacja GTK4 do monitorowania użycia procesora, pamięci, dysku, sieci i GPU.\n\n- Nagstamon — Monitor stanu, który łączy się z wieloma serwerami monitorującymi Nagios, Icinga, Opsview, Centreon, Op5 Monitor/Ninja, Checkmk i Thruk.\n\n- netdata — Internetowy monitor wydajności w czasie rzeczywistym.\n\n- Paramano — Lekki monitor baterii i skaler częstotliwości procesora. Sforkowany z trayfreq\n\n- Resources — Prosty i wszechstronny monitor dla aplikacji graficznych, procesów i zasobów systemowych (CPU, pamięć, GPU, interfejsy sieciowe i urządzenia blokowe), napisany w Rust i GTK4.\n\n- Sysstat — Collection of resource monitoring tools: iostat, isag, mpstat, pidstat, sadf, sar.\n\n- Telegraf — Agent napisany w języku Go do zbierania, przetwarzania, agregowania i zapisywania metryk.\n\n- xosview — Monitor systemowy przypominający gr_osview z SGI IRIX.\n\n- zps — Małe narzędzie do listowania i usuwania procesów zombie w systemie GNU/Linux.\n\n"
    },
    {
      "title": "Monitorowanie czujników sprzętowych",
      "level": 3,
      "content": "Zobacz lm_sensors#Graphical front-ends.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- alsi — Narzędzie informacji o systemie dla Arch Linux. Może być skonfigurowane dla każdego innego systemu bez konieczności dotykania kodu źródłowego skryptu.\n\n- archey4 — Skrypt Pythona wyświetlający informacje o systemie wraz z logo Arch Linux.\n\n- dmidecode — Zgłasza informacje o sprzęcie systemu zgodnie z opisem w BIOS-ie systemu zgodnie ze standardem SMBIOS/DMI.\n\n- fastfetch — Podobnie jak Neofetch, ale znacznie szybszy, ponieważ napisany w języku C.\n\n- hwdetect — Prosty skrypt wyświetlający listę modułów eksportowanych w /sys/.\n\n- hwinfo — Potężne narzędzie do wykrywania sprzętu pochodzi z openSUSE.\n\n- hw-probe — Narzędzie do sondowania sprzętu, sprawdzania działania i znajdowania sterowników za pomocą Linux Hardware Database.\n\n- inxi — Skrypt pobierający informacje o systemie.\n\n- neofetch — Szybki, wysoce konfigurowalny skrypt informacji systemowych, który obsługuje wyświetlanie obrazów za pomocą w3m.\n\n- nmon — Aplikacja konsolowa do monitorowania różnych komponentów systemu.\n\n- pfetch — Ładne narzędzie informacji o systemie napisane w POSIX sh.\n\n- screenfetch — Podobny do archey, ale ma opcję zrobienia zrzutu ekranu. Napisany w bashu.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- GPU-Viewer — GUI do glxinfo, vulkaninfo, clinfo i es2_info; napisane w Pythonie z GTK.\n\n- hardinfo2 — Informacje o systemie i testy porównawcze dla systemów Linux.\n\n- i-Nex — Aplikacja, która gromadzi informacje o komponentach sprzętowych dostępnych w systemie i wyświetla je za pomocą interfejsu użytkownika podobnego do popularnego narzędzia CPU-Z w systemie Windows.\n\n- lshw — Małe narzędzie dostarczające szczegółowych informacji na temat konfiguracji sprzętowej maszyny z interfejsami CLI i GTK.\n\n- KInfoCenter — Scentralizowany i wygodny przegląd informacji systemowych dla KDE. Część plasma.\n\n- USBView — Wyświetla topologię urządzeń na magistrali USB.\n\n"
    },
    {
      "title": "Przeglądarki dziennika systemowego",
      "level": 3,
      "content": "- GNOME Logs — Przeglądarka dziennika systemd. Część gnome.\n\n- KJournald Browser — Zapewnia elastyczne narzędzie do przeglądania lokalnych, zdalnych i offline baz danych systemd-journald. Część kde-system.\n\n- KSystemLog — Narzędzie do przeglądania logów systemowych dla KDE. Część kde-system.\n\n- MATE System Log — Przeglądarka logów systemowych dla MATE.\n\n- Pacman Log Viewer — Narzędzie służące do przeglądania pliku dziennika pakmana, w szczególności wyświetla listę zainstalowanych, usuniętych i zaktualizowanych pakietów, umożliwiając filtrowanie według nazwy pakietu i/lub daty.\n\n- QJournalctl — Graficzny interfejs użytkownika oparty na Qt dla polecenia journalctl systemd.\n\n"
    },
    {
      "title": "Przeglądarki czcionek",
      "level": 3,
      "content": "Zobacz także Wikipedia:Font management software.\n\n- Deepin Font Manager — Narzędzie do zarządzania czcionkami dla Deepin Desktop.\n\n- Font Manager — Proste zarządzanie czcionkami dla środowisk GTK.\n\n- Fonty Python — Zarządzaj, przeglądaj i znajduj swoje czcionki.\n\n- GNOME Fonts — Przeglądarka czcionek dla środowiska GNOME. Część gnome.\n\n- KFontview — Aplikacja KDE do przeglądania i instalowania różnych typów czcionek.\n\n- MATE Font Viewer — Przeglądarka czcionek dla MATE.\n\n"
    },
    {
      "title": "Przeglądarki instrukcji",
      "level": 3,
      "content": "Zobacz man page#Installation.\n\n"
    },
    {
      "title": "Harmonogramy poleceń",
      "level": 3,
      "content": "Zobacz także Cron.\n\n- FcronQ — Fcron GUI, zaawansowany harmonogram poleceń okresowych.\n\n- GNOME Schedule — Graficzny interfejs crontab i at dla środowiska GNOME.\n\n- KCron — Narzędzie dla KDE do uruchamiania aplikacji w tle w regularnych odstępach czasu. Jest to graficzny interfejs polecenia Cron. Część kde-system.\n\n- KTimer — Małe narzędzie dla KDE do wykonywania programów po pewnym czasie. Pozwala na wprowadzenie kilku zadań i ustawienie timera dla każdego z nich. Timery dla każdego zadania mogą być uruchamiane, zatrzymywane, zmieniane lub zapętlane. Część kde-utilities.\n\n"
    },
    {
      "title": "Wyłączniki czasowe",
      "level": 3,
      "content": "- auto-suspend — Mały skrypt do zamykania lub zawieszania systemu z powodu braku skonfigurowanych działań.\n\n- Hsiu-Ming's Timer — Graficzny wyłącznik czasowy, który umożliwia wyłączenie, wyłączenie monitora, ponowne uruchomienie lub odtworzenie dźwięku po upływie określonego czasu.\n\n- KShutdown — Graficzne narzędzie do wyłączania, które pozwala wyłączyć lub zawiesić komputer o określonej godzinie. Oferuje różne opcje czasu i opóźnienia, obsługę wiersza poleceń i powiadomienia.\n\n"
    },
    {
      "title": "Synchronizacja zegara",
      "level": 3,
      "content": "Zobacz Time synchronization.\n\n"
    },
    {
      "title": "Zarządzanie ekranem",
      "level": 3,
      "content": "Zobacz Xrandr#Graphical front-ends.\n\n"
    },
    {
      "title": "Zarządzanie podświetleniem",
      "level": 3,
      "content": "Zobacz Backlight#Backlight utilities.\n\n"
    },
    {
      "title": "Zarządzanie kolorami",
      "level": 3,
      "content": "Zobacz ICC profiles#Utilities i Backlight#Color correction.\n\n"
    },
    {
      "title": "Zarządzanie drukarkami",
      "level": 3,
      "content": "Zobacz CUPS#GUI applications.\n\n"
    },
    {
      "title": "Zarządzanie Bluetooth",
      "level": 3,
      "content": "Zobacz Bluetooth#Front-ends.\n\n"
    },
    {
      "title": "Zarządzanie zasilaniem",
      "level": 3,
      "content": "Zobacz Power management#Userspace tools.\n\n"
    },
    {
      "title": "Zarządzanie systemem",
      "level": 3,
      "content": "Zobacz Systemd#GUI configuration tools.\n\n"
    },
    {
      "title": "Zarządzanie rozruchem",
      "level": 3,
      "content": "Zobacz GRUB/Tips and tricks#GUI configuration tools.\n\n"
    },
    {
      "title": "Zarządzanie pakietami",
      "level": 3,
      "content": "Zobacz pacman tips#Utilities.\n\n"
    },
    {
      "title": "Zarządzanie konfiguracją",
      "level": 3,
      "content": "- aconfmgr — Pakiet do śledzenia, zarządzania i przywracania konfiguracji systemu Arch Linux.\n\n- Ansible — Mechanizm automatyzacji IT, który automatyzuje provisioning w chmurze, zarządzanie konfiguracją, wdrażanie aplikacji, orkiestrację wewnątrzusługową i wiele innych potrzeb IT.\n\n- cdist — Prosty system zarządzania konfiguracją z obsługą Arch Linux.\n\n- Chef — Oprogramowanie do automatyzacji ciągłego dostarczania bezpiecznych aplikacji i infrastruktury.\n\n- etckeeper — Zbiór narzędzi umożliwiających przechowywanie /etc w repozytorium VCS.\n\n- Puppet — Oprogramowanie do automatyzacji IT, które pomaga administratorom systemów zarządzać infrastrukturą przez cały cykl jej życia, od udostępniania i konfiguracji po zarządzanie poprawkami i zgodność.\n\n- Saltstack — Oparte na języku Python oprogramowanie typu open source do automatyzacji IT sterowanej zdarzeniami, zdalnego wykonywania zadań i zarządzania konfiguracją.\n\n"
    },
    {
      "title": "Wirtualizacja",
      "level": 3,
      "content": "Zobacz Libvirt#Client oraz VirtualBox.\n\n"
    },
    {
      "title": "Warstwy kompatybilności",
      "level": 3,
      "content": "Zobacz Wine (Windows) i Darling (MacOS).\n\n"
    }
  ]
}