{
  "title": "List of applications/Security (Русский)",
  "url": "https://wiki.archlinux.org/title/List_of_applications/Security_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Безопасность",
      "level": 2,
      "content": "Вопросы безопасности подробно рассмотрены в главной статье по этой теме: Безопасность.\n\n"
    },
    {
      "title": "Сетевая безопасность",
      "level": 3,
      "content": "Смотрите также Сравнение программ для анализа пакетов.\n\n- airgeddon — Многофункциональный Bash-скрипт для аудита беспроводных сетей.\n\n- Arpwatch — Утилита для отслеживания Ethernet-активности; ведёт базу данных Ethernet/IP адресов.\n\n- bettercap — \"Швейцарский нож\" для сетевых атак и мониторинга.\n\n- darkstat — Перехват сетевого трафика, подсчёт статистики, отчёты по HTTP.\n\n- dsniff — Набор инструментов для аудита сетей и тестирования на проникновение.\n\n- EtherApe — Графический сетевой монитор, разработанный на основе проекта etherman. Взаимодействие с канальным уровнем, режимы работы с IP и TCP, графическое отображение сетевой активности. Размеры хостов и соединений изменяются в зависимости от трафика. Цветовое отображение протоколов.\n\n- Ettercap — Многоцелевой сетевой сниффер/анализатор/перехватчик/логгер.\n\n- GNOME Network Tools — Интерфейс GNOME для различных сетевых утилит.\n\n- hping — Сборщик/анализатор пакетов с интерфейсом командной строки.\n\n- IPTraf — Консольная утилита сетевого мониторинга.\n\n- jnettop — Похожий на top визуализатор сетевого трафика.\n\n- justniffer — Анализатор сетевых протоколов, который перехватывает трафик и позволяет настраивать логи; может эмулировать файлы логов веб-сервера Apache, отслеживать время отклика и извлекать из HTTP-трафика \"перехваченные\" файлы.\n\n- Kismet — Детектор канального уровня беспроводных сетей (Wi-Fi), сниффер, система обнаружения проникновений.\n\n- LinSSID — Графический сканер беспроводных сетей.\n\n- Nemesis — Утилита командной строки для изготовления и инъекции сетевых пакетов.\n\n- Net Activity Viewer — Графический инструмент для просмотра сетевых соединений, по функциональности похож на Netstat.\n\n- netsniff-ng — Высокопроизводительный сниффер сетей Linux для изучения сетевых пакетов.\n\n- ngrep — Схожая с grep утилита, которая позволяет осуществлять поиск сетевых пакетов на определённом интерфейсе.\n\n- Nmap — Сканер безопасности для обнаружения хостов и служб в компьютерных сетях, создаёт \"карту\" сети.\n\n- Ntop — Сетевые зонды для оценки загруженности сети вроде того, как это делает top применительно к процессам.\n\n- pyNeighborhood — Основанная на GTK утилита исследования SMB/CIFS.\n\n- Smb4K — Продвинутая утилита для обнаружения и изучения \"соседей\" в сети, а также для монтирования Samba в KDE.\n\n- Snort — Система предотвращения и обнаружения проникновений.\n\n- Spectools — Набор инструментов для работы с анализаторами спектра, в том числе для устройств Wi-Spy.\n\n- Sshguard — Демон для защиты SSH и других служб от атак методом грубой силы, похож на Fail2ban.\n\n- Suricata — Высокопроизводительный движок для IDS, IPS и мониторинга сетевой безопасности.\n\n- Tcpdump — Консольный анализатор пакетов, позволяющий пользователю перехватывать и отображать TCP/IP (и не только) пакеты, передаваемые и принимаемые по сети.\n\n- vnStat — Консольный инструмент для мониторинга сетевого трафика; может вести логи трафика на отдельных сетевых интерфейсах.\n\n- What IP — Небольшое GTK-приложение для получения информации о вашем IP.\n\n- Wireshark — Анализатор сетевых протоколов, позволяющий перехватывать и интерактивно изучать сетевой трафик.\n\n- Xplico — Утилита для сетевой форензики, которая реконструирует содержимое добытых сниффером пакетов.\n\n- Zeek — Мощный фреймворк для сетевого анализа, сильно отличающийся от стандартных IDS-систем.\n\n"
    },
    {
      "title": "Межсетевые экраны",
      "level": 3,
      "content": "См. iptables#Фронтенды.\n\n"
    },
    {
      "title": "Обнаружение угроз и уязвимостей",
      "level": 3,
      "content": "- AFICK — Утилита для отслеживания изменений в файловой системе, которая помогает обнаружить случаи проникновения.\n\n- Lynis — Утилита системного аудита для защиты Unix/Linux-систем.\n\n- Metasploit Framework — Продвинутая платформа с открытым исходным кодом для разработки, тестирования и использования экплойтов.\n\n- Nessus — Программа сканирования уязвимостей.\n\n- OpenVAS — Фреймворк из нескольких служб и утилит для сканирования и исправления уязвимостей. Форк Nessus с открытым исходным кодом.\n\n- OSSEC — Хостовая система обнаружения вторжений с открытым исходным кодом для анализа логов, проверки целостности файлов, отслеживания политик, обнаружения руткитов, отслеживания атак в реальном времени и активного ответа.\n\n- Samhain — Хостовая система обнаружения вторжений для проверки целостности файлов и мониторинга/анализа файлов логов, а также обнаружения руткитов, мониторинга портов, обнаружения поддельных исполняемых файлов с битом SUID и скрытых процессов.\n\n- Tiger — Утилита для аудита безопасности и обнаружения вторжений.\n\n- Tripwire — Система обнаружения вторжений.\n\n"
    },
    {
      "title": "Безопасность файлов",
      "level": 3,
      "content": "- AIDE — Программа для проверки целостности файлов и каталогов.\n\n- Logwatch — Настраиваемая система анализа логов.\n\n"
    },
    {
      "title": "Антивирусы",
      "level": 3,
      "content": "- ClamAV — Антивирусный движок с открытым исходным кодом для обнаружения троянов, вирусов и прочих угроз.\n\n- ClamTk — Графический интерфейс для ClamAV на основе GTK и Perl. Быстрый, лёгкий в использовании антивирусный сканер для Linux-систем.\n\n- Linux Malware Detect — Сканер для обнаружения вредоносных программ для окружений с совместным доступом.\n\n- Rootkit Hunter — Проверяет машину на наличие руткитов и других нежелательных программ.\n\n- Hostsblock — Скрипт для загрузки, сортировки и компиляции большого количества блокирующих рекламу и вирусы файлов hosts.\n\n"
    },
    {
      "title": "Блокировка экрана",
      "level": 3,
      "content": "Смотрите также Блокировка экрана.\n\n- betterlockscreen — Обёртка для i3lock-color. Кэширует изображения с различными фильтрами и блокирует экран с невероятной скоростью.\n\n- Cinnamon Screensaver — Блокировщик экрана для рабочего стола Cinnamon.\n\n- Deepin Screensaver — Лёгкий скринсэйвер на базе Qt5.\n\n- GNOME Screensaver — Устаревший блокировщик экрана для рабочего стола GNOME. Не поддерживается с 2012 года.\n\n- i3lock — Простой блокировщик экрана. Обратная связь с пользователем, PAM-аутентификация. В качестве фона можно выбрать либо изображение, либо однотонный цвет.\n\n- i3lock-blur — Форк i3lock с blur-эффектом фонового изображения.\n\n- i3lock-color — Форк i3lock с поддержкой настроек цвета и позиционирования; также есть blur-эффект фонового изображения.\n\n- Light-locker — Простой блокировщик (форк gnome-screensaver), который ставит целью предоставлять простые, разумные и безопасные настройки по умолчанию, а также обеспечивать легкую интеграцию с любыми рабочими столами за счёт отсутствия зависимостей, специфичных для конкретных окружений. Использует LightDM для блокирования и разблокирования сеансов посредством ConsoleKit/UPower или logind/systemd.\n\n- MATE Screensaver — Скринсэйвер и блокировщик для окружения рабочего стола MATE.\n\n- physlock — Блокировщик экрана и консоли.\n\n- sflock — Простой блокировщик экрана для X, основанный на slock. Предлагает простую систему обратной связи с пользователями.\n\n- slock — Простой и лёгкий блокировщик экрана X. Только полностью чёрный фон при блокировке, без анимации и текстовых полей.\n\n- tsscreenlock — Блокировщик экрана для theShell. Отображает управление музыкой, а при работе с theShell — также и уведомления рабочего стола.\n\n- vlock — Блокировщик TTY. Зеркало оригинального vlock доступно на github.\n\n- xfce4-screensaver — Скринсейвер и блокировщик, который ставит целью предоставлять простые, разумные и безопасные настройки по умолчанию, а также поддерживать лёгкую интеграцию с рабочим столом Xfce.\n\n- xlockmore — Простой блокировщик экрана X11 с поддержкой PAM.\n\n- XScreenSaver — Скринсейвер и блокировщик для X Window System.\n\n- XSecureLock — Утилита блокировки экрана X11 с упором на безопасность.\n\n- xtrlock — Лёгкий блокировщик экрана X. В режиме блокировки окна остаются видны, а вместо курсора мыши отображается иконка блокировки. Ввод пароля и нажате клавиши Enter разблокирует экран.\n\n"
    },
    {
      "title": "Аудит паролей",
      "level": 3,
      "content": "- John the Ripper — Программа проверки паролей.\n\n- Hashcat — Утилита восстановления паролей в многопоточном режиме.\n\n"
    },
    {
      "title": "Консольные",
      "level": 4,
      "content": "- 1password CLI — Проприетарная утилита командной строки для менеджера паролей 1Password.\n\n- Bitwarden — Менеджер паролей с открытым исходным кодом; есть версии для настольного компьютера, смартфона, браузера и командной строки. Размещение в облаке или на своём хосте.\n\n- gopass — Продвинутый консольный менеджер паролей, с поддержкой GnuPG и других бэкендов.\n\n- Himitsu — Система хранения секретов.\n\n- KeePassC — Менеджер паролей на основе библиотеки Curses, совместим с KeePass v.1.x.\n\n- LastPass — Хостовый менеджер паролей.\n\n- pass — Простой консольный менеджер паролей на основе работы с текстовыми файлами и шифрования GnuPG.\n\n- pwsafe — Консольная программа для Unix, управляет зашифрованной базой данных паролей.\n\n- spm — Простой менеджер паролей, написанный полностью на POSIX-совместимом языке оболочки с использованием PGP. Быстрый, лёгкий и расширяемый скриптами.\n\n- tpm — Крошечный менеджер паролей, идея которого вдохновлена pass; написан полностью на POSIX-совместимом языке оболочки.\n\n- Vault — Инструмент управления секретами.\n\n- Ylva — Консольный менеджер паролей, написан на Си, использует OpenSSL.\n\n"
    },
    {
      "title": "Графические",
      "level": 4,
      "content": "- Authenticator — Приложение двухфакторной аутентификации для GNOME с открытым исходным кодом.\n\n- Bitwarden — Менеджер паролей с открытым исходным кодом; есть версии для настольного компьютера, смартфона, браузера и командной строки. Размещение в облаке или на своём хосте.\n\n- Figaro's Password Manager 2 — Порт Figaro's Password Manager для GTK2 с некоторыми расширениями.\n\n- GNOME Secrets — Менеджер паролей для GNOME, использующий формат KeePass v.4.\n\n- Ked Password Manager — Менеджер для управления большим количеством паролей.\n\n- KeePass Password Safe — Менеджер на основе Mono для безопасной работы с паролями.\n\n- KeePassX — Менеджер на основе Qt. Совместим с KeePass версий v.1.x и v.2.x.\n\n- KeePassXC — Развиваемый сообществом форк KeePassX с более активной разработкой. Совместим с KeePass версий v.1.x (только импорт) и v.2.x.\n\n- Keysmith — Генератор кодов OTP от KDE.\n\n- KDE Wallet Manager — Утилита для управления паролями на основе подсистемы KDE wallet; помимо обычного хранения паролей может работать напрямую с установленными в системе приложениями, в которых предусмотрена поддержка wallet.\n\n- OTPClient — Безопасное и удобное в использовании GTK-приложение для двухфакторной аутентификации; поддерживает два способа генерации одноразовых паролей, Time-based One-time Passwords (TOTP) и HMAC-Based One-Time Passwords (HOTP).\n\n- Passbook — Современный менеджер паролей для GNOME.\n\n- Password Gorilla — Кроссплатформенный менеджер паролей.\n\n- Password Safe — Простой и безопасный менеджер.\n\n- QPass — Удобный менеджер со встроенным генератором паролей.\n\n- QtPass — Графический интерфейс для pass, стандартного менеджера паролей в Unix.\n\n- Revelation — Менеджер для рабочего стола GNOME.\n\n- Seahorse — Приложение GNOME для управления зашифрованными ключами и паролями в GNOME Keyring.\n\n- Universal Password Manager — Позволяет хранить имена пользователей, пароли, ссылки и общие заметки в зашифрованной базе данных, которая защищена одним мастер-паролем.\n\n"
    },
    {
      "title": "Проверка хэш-сумм",
      "level": 4,
      "content": "- cfv — Небольшая утилита для создания и проверки файлов контрольных сумм, поддерживает форматы .sfv, .csv, .crc, .md5, md5sum, sha1sum, .torrent, par и .par2.\n\n- GtkHash — GTK-утилита для вычисления дайджестов сообщений и контрольных сумм.\n\n- hashdeep — Кроссплатформенный инструмент для вычисления хэш-сумм любого количества файлов.\n\n- Quick Hash GUI — Графический интерфейс для быстрого выбора и последовательного хэширования файлов (по отдельности или рекурсивно по каталогам), текстов и (в Linux) дисков.\n\n- RHash — Утилита для проверки хэш-сумм (SFV, CRC и т.д.). Поддерживает большое количество алгоритмов.\n\n- MassHash — Набор инструментов (как консольных, так и графических на базе GTK) для хэширования файлов, написанный на Python. Среди поддерживаемых алгоритмов — MD5, SHA-1, SHA-224, SHA-256, SHA-384, SHA-512.\n\n- Parchive — Утилита, которая с помощью файлов PAR2 может обнаружить факт повреждения файлов с данными и восстановить их при необходимости.\n\n"
    },
    {
      "title": "Шифрование, подписи и стеганография",
      "level": 4,
      "content": "- age — Простой, современный и безопасный инструмент (и библиотека) для шифрования с небольшими явными ключами, без опций настройки и компоновкой в стиле UNIX.\n\n- ccrypt — Консольная утилита для шифрования и дешифрации файлов и потоков на основе алгоритма Rijndael.\n\n- Enigmail — Расширение безопасности для Mozilla Thunderbird и Seamonkey. Позволяет посылать и получать электронную почту, которая подписана и/или зашифрована по стандарту OpenPGP.\n\n- GNOME Keysign — Приложение GTK/GNOME для подписи чужих ключей с помощью GnuPG. Быстрое, лёгкое, надёжное.\n\n- GnuPG — Разработанная в рамках проекта GNU полная и свободная реализация стандарта OpenPGP в соответствии с RFC4880. Открытая замена PGP, обычно используется для создания цифровых подписей пакетов.\n\n- GPG-Crypter — Графический интерфейс для GnuPG (GPG) на основе GTK3 и библиотеки GPGME.\n\n- KeePassXC — В основном используется для управления паролями, но также поддерживает прикрепление произвольных файлов к записям в зашифрованной базе данных.\n\n- Keybase — Каталог открытых ключей, который позволяет сопоставлять профили социальных сетей с ключами шифрования; также предлагается кроссплатформенный зашифрованный чат, облачное хранилище и репозиторий Git.\n\n- KGpg — Простой KDE-интерфейс для GnuPG.\n\n- Kleopatra — Менеджер сертификатов и объединённый криптографический интерфейс для KDE. Работа с сертификатами X.509 и OpenPGP в GpgSM, получение сертификатов от LDAP-серверов.\n\n- minisign — Простая программа для подписи ключей.\n\n- OpenSSH — Де-факто стандартная реализация SSH, поддерживающая подпись сообщений.\n\n- passphrase2pgp — Воспроизводимая генерация закрытого ключа в форматах OpenPGP/OpenSSH из введённой пользователем парольной фразы и, по желанию, подпись сообщения.\n\n- Seahorse — Приложение GNOME для работы с ключами шифрования и паролями в GNOME Keyring.\n\n- scrypt — Консольная утилита шифрования на основе безопасной функции создания ключей scrypt.\n\n- steghide — Утилита для стеганографии, которая позволяет скрытно хранить данные в изображениях и аудиофайлах.\n\n"
    },
    {
      "title": "Шифрование неактивных данных",
      "level": 4,
      "content": "Смотрите Data-at-rest encryption (Русский).\n\n"
    },
    {
      "title": "Повышение привилегий",
      "level": 3,
      "content": "- doas — Порт команды doas из OpenBSD, которая известна значительно меньшим размером по сравнению с sudo.\n\n- pkexec(1) — Приложение Polkit, которое позволяет авторизованному пользователю запускать команды или интерактивную оболочку от имени другого пользователя. Настраивается с помощью правил Polkit.\n\n- su — Команда для принятия личности другого пользователя в системе.\n\n- sudo — Утилита, которая позволяет запускать команды от лица другого пользователя (в том числе и root), с ведением журнала выполненных команд.\n\n"
    }
  ]
}