{
  "title": "List of applications (Polski)/Other (Polski)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Polski)/Other_(Polski)",
  "sections": [
    {
      "title": "Serwery CalDAV/CardDAV",
      "level": 3,
      "content": "- Baïkal — Lekki serwer CalDAV+CardDAV.\n\n- kcaldav — Prosty, bezpieczny, minimalny serwer CalDAV.\n\n- Radicale — Wolny i otwarty serwer CalDAV i CardDAV.\n\n- xandikos — Lekki, ale kompletny serwer CardDAV/CalDAV, który tworzy kopię zapasową repozytorium Git.\n\n"
    },
    {
      "title": "Menedżery informacji osobistych",
      "level": 3,
      "content": "Aplikacje te obsługują zarządzanie czasem, zadaniami i kontaktami.\n\n- Evolution — Aplikacja do zarządzania informacjami osobistymi, zapewniająca zintegrowane funkcje poczty, kalendarza i książki adresowej. Część gnome-extra.\n\n- Kontact — Zintegrowane rozwiązanie do zarządzania danymi osobowymi. Część kde-pim.\n\n- Osmo — Osobisty organizer GTK, zawierający moduły kalendarza, menedżera zadań i książki adresowej.\n\n- SeaMonkey Mail & Newsgroups with Lightning — Rozszerzenie SeaMonkey zapewniające obsługę kalendarza i zadań.\n\n- Thunderbird z Lightning — Rozszerzenie do Mozilla Thunderbird, które zapewnia obsługę kalendarza i zadań.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Calcurse — Tekstowy kalendarz i system planowania ncurses (obsługuje CalDAV)\n\n- ccal — Program konsolowy wypisujący na standardowe wyjście kalendarz wraz z kalendarzem chińskim.\n\n- khal — System kalendarza wiersza poleceń (nieinteraktywny) i ncurses (interaktywny) (obsługuje CalDAV)\n\n- mail2rem — Mały skrypt do importowania kalendarzy .ics z Maildir do kalendarza Remind.\n\n- Pal — Bardzo lekki kalendarz z interaktywnym i nieinteraktywnym interfejsem.\n\n- pcal — Narzędzie do tworzenia kalendarzy pdf z danych wejściowych pcal, które mogą być eksportowane przez niektóre programy kalendarzowe.\n\n- Remind — Wysoce zaawansowany tekstowy system kalendarzy i powiadomień.\n\n- When — Prosty program kalendarza osobistego.\n\n- Wyrd — Tekstowy interfejs Remind, kalendarza i programu alarmowego używanego na komputerach z systemami UNIX i Linux.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Calindori — Aplikacja kalendarza dla Plasma Mobile.\n\n- chinese-calendar — Chiński tradycyjny kalendarz dla Ubuntu Kylin.\n\n- CoreTime — Bardzo prosta aplikacja zegara/kalendarza, która wyświetla zegar, obsługuje alarmy, przypomnienia, stoper i minutnik. Część C-Suite.\n\n- Day Planner — Program zaprojektowany z myślą o łatwym planowaniu i zarządzaniu czasem. Może zarządzać spotkaniami, urodzinami i nie tylko.\n\n- Deepin Calendar — Aplikacja kalendarza dla Deepin.\n\n- etmtk (Event and Task Manager) — Prosta aplikacja z podejściem \"Getting Things Done!\" do obsługi zdarzeń, zadań, aktywności, przypomnień i projektów.\n\n- Gahshomar — Kalendarz perski (Jalali/Farsi).\n\n- GNOME Calendar — Aplikacja kalendarza dla środowiska GNOME. Część gnome.\n\n- KAlarm — Narzędzie do osobistych wiadomości alarmowych, poleceń i planisty e-maili, część kde-pim.\n\n- Kongress — Aplikacja towarzysząca dla konferencji stworzona przez KDE. Część kde-utilities.\n\n- KOrganizer — Kalendarz i program do planowania, część kde-pim.\n\n- Merkuro — Aplikacja kalendarza wykorzystująca Akonadi do synchronizacji z usługami zewnętrznymi (NextCloud, GMail, ...). Część kde-pim.\n\n- Nextcloud Calendar — Aplikacja kalendarza dla Nextcloud.\n\n- Outspline — Rozszerzalny konspekt z zaawansowanymi funkcjami zarządzania czasem, obsługujący zdarzenia o złożonych schematach powtarzalności.\n\n- TkRemind — Zaawansowany kalendarz i program alarmowy.\n\n"
    },
    {
      "title": "Odliczanie czasu i stoper",
      "level": 4,
      "content": "- arttime — Zegar, minutnik, menedżer czasu oparty na wzorach, przeglądarka grafiki ASCII. Ustawianie jednorazowych, wielokrotnych, powtarzających się zegarów opartych na wzorach.\n\n- GNOME Clocks — Aplikacja zegara dla środowiska GNOME, zawierająca funkcje alarmu, stopera i minutnika. Część gnome.\n\n- Hourglass — Prosta aplikacja przeznaczona dla elementary OS.\n\n- KClock — Konwergentna aplikacja zegara dla Plasma. Zawiera funkcje alarmu, minutnika, stopera i strefy czasowej. Część kde-utilities.\n\n- Kronometer — Aplikacja stopera dla KDE.\n\n- KTeaTime — Poręczny timer do parzenia herbaty.\n\n- pystopwatch — Stoper napisany w Pythonie z zegarem i dwiema funkcjami odliczania, które można zminimalizować do zasobnika.\n\n- snore — Program podobny do sleep, ale z informacją zwrotną.\n\n- termdown — Odliczanie czasu i stoper w terminalu.\n\n"
    },
    {
      "title": "Liczniki czasu przerwy",
      "level": 4,
      "content": "- arttime — Zegar, minutnik, menedżer czasu oparty na wzorach, przeglądarka grafiki ASCII. Ustawianie jednorazowych, wielokrotnych, powtarzających się zegarów opartych na wzorach.\n\n- GNOME Break Timer — Śledzi ilość korzystania z komputera i przypomina o regularnych przerwach.\n\n- RSI Break — Dbaj o swoje zdrowie i regularnie przerywaj pracę, aby uniknąć powtarzających się urazów przeciążeniowych (RSI).\n\n- Safe Eyes — Narzędzie do zmniejszania i zapobiegania powtarzającym się urazom przeciążeniowym (RSI).\n\n- Work-break — Równoważenie czasu pracy i odpoczynku z uwzględnieniem aktualnego i obecnego obciążenia.\n\n- Workrave — Program wspomagający leczenie i zapobieganie RSI na Xorg.\n\n"
    },
    {
      "title": "Timery Pomodoro",
      "level": 4,
      "content": "Zobacz Wikipedia:pl:Technika Pomodoro, aby uzyskać wprowadzenie.\n\n- arttime — Zegar, minutnik, menedżer czasu oparty na wzorach, przeglądarka grafiki ASCII. Ustawianie jednorazowych, wielokrotnych, powtarzających się zegarów opartych na wzorach.\n\n- flow — Aplikacja Pomodoro, która blokuje czynniki rozpraszające podczas pracy.\n\n- Francis — Aplikacja wykorzystująca dobrze znaną technikę pomodoro, która pomaga zwiększyć produktywność. Część kde-utilities.\n\n- Gnomato — Timer dla techniki Pomodoro.\n\n- GNOME Pomodoro — Narzędzie do zarządzania czasem dla środowiska GNOME oparte na technice Pomodoro.\n\n- Pilorama — Przyjemne dla oka narzędzie do timeboxingu napisane w QML\n\n- Pomodoro-Logger — Timer i rejestrator Pomodoro z tablicą Kanban do zarządzania i śledzenia zadań.\n\n- potato-c — Minimalny i wydajny timer pomodoro ze strukturą serwer-klient.\n\n- Solanum — Timer pomodoro dla środowiska GNOME\n\n- Tomate — Timer dla techniki Pomodoro.\n\n- Tomato — Prosta, użyteczna i wydajna aplikacja pomodoro zaprojektowana dla systemu elementary OS.\n\n- Tomighty — Licznik czasu na pulpicie dla techniki Pomodoro.\n\n"
    },
    {
      "title": "Narzędzia do śledzenia czasu",
      "level": 3,
      "content": "- ActivityWatch — Samodzielny / lokalny hostowany, wieloplatformowy, klient-serwer, skoncentrowany na prywatności aktywny program do śledzenia okien.\n\n- Hamster — Aplikacja do śledzenia czasu, która pomaga śledzić, ile czasu spędziłeś w ciągu dnia na wybranych czynnościach.\n\n- Kapow — Punch clock do śledzenia czasu spędzonego nad projektami.\n\n- KTimeTracker — Aplikacja do zarządzania zadaniami i śledzenia czasu.\n\n- Tider — Lekka aplikacja do śledzenia czasu (GTK)\n\n- Timenaut — Narzędzie do śledzenia czasu, które śledzi aktywne okna i pozwala sortować je według kategorii. Oparty na platformie Electron.\n\n- Timewarrior — Aplikacja do śledzenia czasu w wierszu poleceń.\n\n- Timetrack — Prosta aplikacja do śledzenia czasu dla środowiska GNOME.\n\n- Wakatime — Wtyczki open source do pomiarów dotyczących programowania z intuicyjnym interfejsem internetowym.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- c3 — Wieloplatformowy menedżer todo TUI, który rozszerza format todo Calcurse o drzewiastą strukturę zależności, a nawet więcej!\n\n- dijo — Skryptowalny, oparty na curses, cyfrowy tracker nawyków\n\n- Taskbook — Zadania, tablice i notatki dla środowiska wiersza poleceń.\n\n- Taskell — Tablica kanban/menedżer zadań działający z poziomu wiersza poleceń.\n\n- Taskwarrior — Aplikacja listy rzeczy do zrobienia z wiersza poleceń z obsługą dostosowywania lua i nie tylko.\n\n- todoman — Menedżer listy zadań z wiersza poleceń (obsługuje CalDAV)\n\n- Todo.txt — Mały menedżer zadań z wiersza poleceń.\n\n- TuDu — Oparty na Ncurses hierarchiczny menedżer list rzeczy do zrobienia z powiązaniami klawiszy podobnymi do vima.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Agenda — Prosta, szybka, konkretna lista rzeczy do zrobienia dla elementary OS.\n\n- Effitask — Graficzny menedżer zadań, oparty na formacie Todo.txt.\n\n- Getting Things GNOME! — Organizer zadań osobistych i elementów listy TODO dla środowiska GNOME inspirowany metodologią Getting Things Done (GTD).\n\n- Go For It! — Prosta i stylowa aplikacja zwiększająca produktywność, zawierająca listę rzeczy do zrobienia połączoną z minutnikiem, który pozwala skupić się na bieżącym zadaniu. Listy rzeczy do zrobienia są przechowywane w formacie Todo.txt.\n\n- Endeavour — Osobisty menedżer zadań dla środowiska GNOME. Część gnome-extra.\n\n- Nextcloud Tasks — Aplikacja zadań dla Nextcloud.\n\n- Planner — Menedżer zadań z obsługą Todoist.\n\n- ptask — Menedżer zadań GTK oparty na Taskwarrior.\n\n- sleek — aplikacja todo.txt z nowoczesnym GUI. Oparta na platformie Electron.\n\n- TickTick — Jest to prosta i skuteczna aplikacja do zarządzania listą zadań i zadaniami z płynną synchronizacją w chmurze na wszystkich urządzeniach\n\n- Zanshin — Aplikacja do zarządzania zadaniami dla KDE. Część kde-pim.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Abook — Tekstowy menedżer kontaktów zaprojektowany do użytku z mutt.\n\n- Khard — Książka adresowa wiersza poleceń, która może synchronizować się z serwerami CardDAV.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Communicator — Zintegrowana książka adresowa i dialer umożliwiają wyszukiwanie i przeglądanie kontaktów, edycję danych kontaktowych oraz tworzenie nowych kontaktów, ulubionych i dialerów. Część maui.\n\n- GNOME Contacts — Menedżer kontaktów dla środowiska GNOME. Część gnome.\n\n- KAddressBook — Menedżer książki adresowej dla KDE. Część kde-pim.\n\n- LDAP Administration Tool — Przeglądaj katalogi oparte na LDAP i dodawaj/edytuj/usuwaj zawarte w nich wpisy.\n\n- Nextcloud Contacts — Aplikacja Kontakty dla Nextcloud.\n\n- phpLDAPadmin — Aplikacja internetowa klienta LDAP. Hierarchiczna przeglądarka drzewiasta i zaawansowane funkcje wyszukiwania sprawiają, że przeglądanie i administrowanie katalogiem LDAP jest intuicyjne.\n\n- Thunderbird z rozszerzeniem CardBook — Książka adresowa oparta na standardach CardDAV i vCard.\n\n"
    },
    {
      "title": "Zarządzanie finansami",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of accounting software.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Beancount — Komputerowy język bazujący na regule podwójnego zapisu, który pozwala definiować rekordy transakcji finansowych w pliku tekstowym, odczytywać je w pamięci, generować z nich różne raporty, zapewniając również interfejs sieciowy.\n\n- esniper — Proste, lekkie narzędzie do snipingu aukcji eBay.\n\n- hledger — Program księgowy do śledzenia pieniędzy, czasu lub dowolnego innego towaru przy użyciu podwójnego księgowania i prostego, edytowalnego formatu pliku. hledger jest inspirowany i w dużej mierze kompatybilny z ledger.\n\n- Ledger — Ledger to potężny, podwójnie księgowany system księgowy dostępny z poziomu wiersza poleceń systemu UNIX.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Eqonomize! — Wieloplatformowe oprogramowanie do księgowości osobistej, skupiające się na wydajności i łatwości obsługi dla małych gospodarstw domowych.\n\n- ERPNext — Darmowe i otwarte oprogramowanie do planowania zasobów przedsiębiorstwa (ERP).\n\n- GnuCash — Aplikacja finansowa, która implementuje system podwójnego zapisu księgowego z funkcjami księgowości dla małych firm.\n\n- Grisbi — System finansów osobistych, który zarządza osobami trzecimi, kategoriami wydatków i wpływów, a także liniami budżetowymi, latami finansowymi i innymi informacjami, dzięki czemu jest odpowiedni dla stowarzyszeń.\n\n- HomeBank — Łatwy w użyciu menedżer finansów, który może szczegółowo analizować finanse osobiste za pomocą potężnych narzędzi filtrujących i wykresów.\n\n- KMyMoney — Menedżer finansów osobistych, który działa podobnie do Microsoft Money. Obsługuje różne typy kont, kategoryzację wydatków i dochodów, uzgadnianie kont bankowych oraz import/eksport do formatu pliku \"QIF\".\n\n- Kresus — Samoobsługowe oprogramowanie do zarządzania finansami osobistymi. Każdego dnia automatycznie pobiera wszystkie nowe transakcje bankowe i pozwala je kategoryzować, analizować za pomocą wykresów i ustalać budżet.\n\n- Manager — Autorskie oprogramowanie księgowe dla małych firm.\n\n- Money Manager EX — Łatwy w użyciu pakiet do finansów osobistych\n\n- Odoo — Otwarty system ERP napisany wyłącznie w Pythonie. Wcześniej znany jako OpenERP.\n\n- Skrooge — Menedżer finansów osobistych dla pulpitu KDE.\n\n"
    },
    {
      "title": "Kryptowaluty",
      "level": 3,
      "content": "- Portfel Atomic — Zarządzaj swoim Bitcoinem, Ethereum, XRP, Litecoinem, XLM i ponad 300 innymi monetami i tokenami.\n\n- Bitcoin Core — Połącz się z siecią P2P Bitcoin.\n\n- Portfel Cake — Portfel wielowalutowy.\n\n- Portfel Sparrow — Zaawansowany klient Bitcoin.\n\n- Coinomi — Bezpiecznie przechowuj, zarządzaj i wymieniaj Bitcoin, Ethereum i ponad 1770 innych aktywów blockchain.\n\n- Cointop — Aplikacja terminalowa do śledzenia kryptowalut.\n\n- Electrum — Lekki klient Bitcoin.\n\n- Etherwall — Portfel Ethereum.\n\n- Exodus — Kompleksowa, własnościowa aplikacja do zabezpieczania, zarządzania i wymiany aktywów blockchain. Oparta na platformie Electron.\n\n- Mist — Przeglądarka Dapp Ethereum.\n\n- Monero — Portfel Monero.\n\n- Portfel Feather — Lekki portfel Monero.\n\n- Dogecoin Core — Portfel Dogecoin Core, umożliwia połączenie z siecią P2P Dogecoin.\n\n"
    },
    {
      "title": "Zarządzanie projektami",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of project management software.\n\n- Calligra Plan — Aplikacja do zarządzania projektami, która jest przeznaczona do zarządzania umiarkowanie dużymi projektami z wieloma zasobami.\n\n- GanttProject — Aplikacja do planowania projektów z wykresem Gantta, zarządzaniem zasobami i kalendarzem.\n\n- Notion-app — Oprogramowanie do robienia notatek i zarządzania projektami, które służy do robienia notatek, zarządzania zadaniami, zarządzania projektami, zarządzania wiedzą i zarządzania wiedzą osobistą.\n\n- Planner — Menedżer zadań z obsługą Todoist.\n\n- ProjectLibre — Oprogramowanie do zarządzania projektami będące alternatywą dla Microsoft Project.\n\n- TaskJuggler — Nowoczesne i wydajne narzędzie do zarządzania projektami. Jego nowe podejście do planowania i śledzenia projektów jest bardziej elastyczne i lepsze od powszechnie używanych narzędzi do edycji wykresów Gantta.\n\n"
    },
    {
      "title": "Zarządzanie podróżami",
      "level": 3,
      "content": "- Itinerary — Cyfrowy asystent podróży, stawiający na ochronę prywatności użytkowników. Część kde-pim.\n\n- KTrip — Asystent transportu publicznego dla urządzeń mobilnych. Część kde-utilities.\n\n- Railway — Umożliwia wyszukiwanie informacji o podróży dla wielu różnych linii kolejowych, bez konieczności nawigowania po różnych stronach internetowych.\n\n"
    },
    {
      "title": "Zarządzanie przepisami",
      "level": 3,
      "content": "- GNOME Recipes — Aplikacja do zarządzania przepisami dla środowiska GNOME. Część gnome-extra.\n\n- Gourmand — Prosta, ale potężna aplikacja do zarządzania recepturami.\n\n"
    },
    {
      "title": "Edukacja",
      "level": 2,
      "content": "Zobacz także List of games#Education.\n\n- Kalm — Uczy różnych technik oddychania. Część kde-utilities.\n\n- Moodle — System zarządzania nauczaniem o otwartym kodzie źródłowym.\n\n- OpenBoard — Oprogramowanie do tablic interaktywnych dla szkół i uniwersytetów.\n\n"
    },
    {
      "title": "Fiszki",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of flashcard software.\n\n- Anki — Inteligentny program treningu pamięci z powtarzaniem odstępów.\n\n- jVLT — Narzędzie do nauki słownictwa.\n\n- KWordQuiz — Narzędzie, które daje potężny sposób na opanowanie nowych słowników. Część kde-education.\n\n- Mnemosyne — Narzędzie typu flash-card, które optymalizuje proces uczenia się.\n\n- Parley — Program ułatwiający zapamiętywanie. Wykorzystuje metodę powtarzania z odstępami, znaną również jako fiszki. Część kde-education.\n\n- Pauker — Narzędzie do nauki oparte na fiszkach, wykorzystujące trening pamięci krótkotrwałej i długotrwałej.\n\n- StudyFlash — Ucz się fiszek w swoim terminalu\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Dvorak 7min — Prosty samouczek pisania na klawiaturze oparty na ncurses dla tych, którzy próbują biegle opanować układ klawiatury Dvorak.\n\n- GNU Typist — Uniwersalny nauczyciel pisania na klawiaturze.\n\n- psani-profi — Czeski program, który nauczy cię touchtypingu.\n\n- Typespeed — Przetestuj szybkość pisania i sprawdź CPS swoich palców.\n\n- typiskt — Trenowanie pisania bez patrzenia na klawiaturę w terminalu (Bash).\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Klavaro — Nauka pisania na klawiaturze bez patrzenia, która ma być niezależna od klawiatury i języka.\n\n- KTouch — Program do nauki i ćwiczenia pisania na klawiaturze. Część kde-education.\n\n- TIPP10 — Inteligentny samouczek pisania na klawiaturze.\n\n- TypingTest — Program do testowania pisania na klawiaturze z dużymi możliwościami dostosowywania.\n\n"
    },
    {
      "title": "Dostępność",
      "level": 2,
      "content": "Zobacz Accessibility aby uzyskać wskazówki dotyczące obsługi pulpitu i Category:Accessibility dla wszystkich dostępnych artykułów. Zobacz także klawiatury ekranowe.\n\n"
    },
    {
      "title": "Syntezatory mowy",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of speech synthesizers i porównanie odsłuchu różnych silników.\n\n- Ekho — Chińskie oprogramowanie do zamiany tekstu na mowę (TTS) dla języków kantońskiego, mandaryńskiego, Zhaoan Hakka, tybetańskiego, ngangien i koreańskiego.\n\n- eSpeak — Kompaktowy syntezator mowy obsługujący ponad 50 języków.\n\n- eSpeak NG — Fork eSpeak (z powodu braku aktywności pierwotnego opiekuna).\n\n- Festival — Ogólny framework do budowania systemów syntezy mowy, a także zawierający przykłady różnych modułów. Jako całość oferuje pełną zamianę tekstu na mowę.\n\n- Flite — Lekki silnik syntezy mowy.\n\n- Gespeaker — Nakładka GTK dla espeak. Umożliwia odtwarzanie tekstu w wielu językach z ustawieniami głosu, wysokości, głośności i szybkości.\n\n- KMouth — Interfejs syntezatora mowy, który umożliwia osobom niemówiącym na mówienie do komputera. Część kde-accessibility.\n\n- MaryTTS — Wielojęzyczna platforma syntezy mowy napisana w języku Java.\n\n- MBROLA — Autorski program phonemes-to-audio obsługujący ponad 70 języków. Mbrola-voices może być również używany z eSpeak.\n\n- Mimic — Synteza tekstu na mowę z projektu Mycroft (opartego na Flite).\n\n- Open JTalk — Japoński system syntezy mowy.\n\n- Orca — Czytnik ekranu dla osób niewidomych lub niedowidzących, wykorzystujący eSpeak (poprzez Speech Dispatcher). Część gnome.\n\n- piper — Szybki, lokalny neuronowy system zamiany tekstu na mowę.\n\n- RHVoice — Wieloplatformowa (w tym na Androida) zamiana tekstu na mowę od niewidomego rosyjskojęzycznego programisty, oparta na HTS (ru, ka, uk, ky, tt, en, pt, eo)\n\n- SOPS — Zapewnia prosty sposób pisania niestandardowych wtyczek dla czytnika ekranu Orca.\n\n- Speech dispatcher — Wspólny interfejs do syntezy mowy. Posiada backend dla eSpeak, Festival i kilku innych syntezatorów mowy.\n\n"
    },
    {
      "title": "Rozpoznawanie mowy",
      "level": 3,
      "content": "Zobacz także Wikipedia:Speech recognition software for Linux.\n\n- Julius — Silnik ciągłego rozpoznawania mowy o dużym zasobie słownictwa.\n\n- Kaldi — Zestaw narzędzi do rozpoznawania mowy.\n\n- Kalliope — Modułowy, zawsze włączony, sterowany głosowo osobisty asystent przeznaczony do automatyzacji domu.\n\n- Kaylee — Nieco wymyślny program do rozpoznawania poleceń głosowych, który wykonuje akcje, gdy użytkownik wypowiada luźno ustawione zdania.\n\n- Mycroft — Asystent głosowy z możliwością hakowania.\n\n- Numen — Sterowanie głosowe w trybie głośnomówiącym\n\n- nerd-dictation — Lekkie dyktowanie aktywowane ręcznie za pomocą VOSK-API\n\n"
    },
    {
      "title": "Lupy ekranowe",
      "level": 3,
      "content": "- boomer — Aplikacja Zoomer dla systemu Linux.\n\n- KMag — Małe narzędzie KDE do powiększania części ekranu. Część kde-accessibility.\n\n- Magnus — Bardzo prosta lupa na pulpicie, pokazująca obszar wokół wskaźnika myszy w osobnym oknie powiększonym dwu-, trzy-, cztero- lub pięciokrotnie.\n\n- Virtual Magnifying Glass — Proste, konfigurowalne i łatwe w użyciu narzędzie do powiększania ekranu.\n\n- xzoom — Powiększanie, obracanie i odbicie lustrzane obszaru wyświetlacza X.\n\n"
    },
    {
      "title": "Adnotacje na ekranie",
      "level": 3,
      "content": "- Gromit-MPX — Narzędzie do tworzenia adnotacji na ekranie.\n\n- Pylote — Narzędzie do rysowania na ekranie.\n\n- Screenkey — Narzędzie do wyświetlania naciśniętych klawiszy.\n\n- Show Me The Key — Alternatywa dla screenkey, która działa pod Waylandem poprzez libinput\n\n"
    },
    {
      "title": "Mysz",
      "level": 3,
      "content": "- Easystroke — Używaj gestów myszy do inicjowania poleceń i skrótów klawiszowych.\n\n- KMouseTool — Klika mysz za każdym razem, gdy kursor myszy zatrzyma się na chwilę. Została zaprojektowana, aby pomóc osobom z urazami spowodowanymi powtarzającym się wysiłkiem, dla których naciskanie przycisków jest bolesne. Część kde-accessibility.\n\n- Mousetweaks — Ulepszenia dostępności dla urządzeń wskazujących.\n\n"
    },
    {
      "title": "Menedżery wyświetlania",
      "level": 2,
      "content": "Zobacz główny artykuł: Display manager#List of display managers.\n\n"
    },
    {
      "title": "Środowiska graficzne",
      "level": 2,
      "content": "Zobacz główny artykuł: Desktop environment#List of desktop environments.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "Zobacz także List of applications (Polski)/Utilities (Polski)#Multipleksery terminali, które oferują niektóre funkcje menedżerów okien dla konsoli.\n\n- twin — Menedżer okien w trybie tekstowym.\n\n- Wmutils — Zestaw narzędzi do manipulacji oknami X.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "Zobacz główny artykuł: Window manager#List of window managers.\n\n"
    },
    {
      "title": "Kompozytory",
      "level": 4,
      "content": "Zobacz główny artykuł: Xorg#List of composite managers.\n\n"
    },
    {
      "title": "Kompozytory na Waylanda",
      "level": 3,
      "content": "Zobacz główny artykuł: Wayland#Compositors.\n\n"
    },
    {
      "title": "Tilery okien",
      "level": 3,
      "content": "- QuickTile — Lekka samodzielna alternatywa dla wtyczki Compiz Grid.\n\n- wumwum — Menedżer okien. Może przekształcić menedżery okien zgodne z emwh w menedżery okien z kafelkami, zachowując wszystkie początkowe funkcje.\n\n"
    },
    {
      "title": "Paski zadań",
      "level": 3,
      "content": "Zobacz także Wikipedia:Taskbar.\n\n- Bmpanel — Lekki panel zgodny z technologią NETWM.\n\n- Cairo-Dock — Wysoce konfigurowalna aplikacja dokująca i uruchamiająca.\n\n- CoreAction — Pasek boczny z przydatnymi gadżetami, takimi jak ładowanie systemu, kalendarz, kalkulator, notatki itp. Część C-Suite.\n\n- Dash to Panel — W pełni konfigurowalny pasek zadań z ikonami dla gnome-shell. Przenosi pulpit do głównego panelu GNOME, podobnie jak w KDE Plasma i Windows 10.\n\n- eww — Elkowars Wacky Widgets to samodzielny system widżetów wykonany w języku Rust, który umożliwia implementację własnych, niestandardowych widżetów w dowolnym menedżerze okien.\n\n- fbpanel — Lekki panel biurkowy zgodny z NETWM.\n\n- GNOME Panel — Panel dołączony do pulpitu GNOME Flashback.\n\n- Latte — Dock oparty na frameworku Plasma, który zapewnia elegancką i intuicyjną obsługę zadań i plazmoidów.\n\n- Lemonbar — Lekki jak piórko pasek oparty na XCB. Zapewnia obsługę UTF-8, kolory tła i pierwszego planu, wyrównanie tekstu i niewiele więcej.\n\n- LXPanel — Lekki panel pulpitu X11 i część pulpitu LXDE.\n\n- MATE Panel — Panel dołączony do pulpitu MATE.\n\n- nwg-dock — Oparta na GTK stacja dokująca zaprojektowana dla menedżera okien Sway.\n\n- nwg-panel — Panel oparty na GTK3 dla kompozytorów Sway i Hyprland Wayland.\n\n- PerlPanel — Idealny dodatek do lekkiego menedżera okien, takiego jak OpenBox, lub programu do rysowania na pulpicie, takiego jak iDesk.\n\n- Plank — Elegancki, prosty, czysty dock ze środowiska graficznego pantheon.\n\n- Polybar — szybkie i łatwe w użyciu narzędzie do tworzenia pasków stanu.\n\n- Tint2 — Prosty panel/pasek zadań opracowany specjalnie dla Openbox.\n\n- Vala Panel — Panel Gtk3 do komponowania menedżerów okien\n\n- Xfce Panel — Panel dołączony do pulpitu Xfce.\n\n- xmobar — Lekki, tekstowy pasek stanu napisany w języku Haskell.\n\n- Waybar — Konfigurowalny pasek zadań dla kompozytorów Wayland opartych na Wlroots.\n\n- yambar — Modułowy i lekki panel stanu dla X11 i Wayland, który dokłada wszelkich starań, aby być zarówno wydajnym procesorem, jak i baterią.\n\n"
    },
    {
      "title": "Zasobnik systemowy",
      "level": 3,
      "content": "- AllTray — Dokowanie innych aplikacji w zasobniku systemowym (obszar powiadomień).\n\n- Docker — Aplikacja dokująca pełniąca funkcję zasobnika systemowego.\n\n- KDocker — Zadokuj dowolną aplikację w zasobniku systemowym (obszar powiadomień).\n\n- Stalonetray — Samodzielny zasobnik systemowy freedesktop.org i KDE (obszar powiadomień) dla Xorg. Posiada pełną obsługę XEMBED i minimalne zależności: tylko lib X11. Stalonetray działa z praktycznie każdym menedżerem okien zgodnym z EWMH.\n\n- Trayer — Lekki zasobnik systemowy (obszar powiadomień) oparty na GTK.\n\n"
    },
    {
      "title": "Programy uruchamiające aplikacje",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of desktop application launchers.\n\n- Albert — Zaawansowany, oparty na wtyczkach, samodzielny program uruchamiający klawiaturę.\n\n- Application Finder — Łatwy w użyciu program uruchamiający aplikacje z Xfce.\n\n- Bashrun2 — Zapewnia inne, podstawowe podejście do okna dialogowego uruchamiania, wykorzystując wyspecjalizowaną sesję Bash w małym oknie xterm.\n\n- bemenu — Lekkie dynamiczne menu inspirowane dmenu. Działa natywnie na Wayland.\n\n- dmenu — Szybkie i lekkie dynamiczne menu dla X, które jest również przydatne jako program uruchamiający aplikacje.\n\n- dmenu-extended — Rozszerzenie do dmenu do szybkiego otwierania plików i folderów.\n\n- dswitcher — Przełącznik okien oparty na dmenu, który działa niezależnie od przestrzeni roboczej lub minimalizacji.\n\n- fuzzel — Program uruchamiający aplikacje dla kompozytorów Wayland opartych na wlroots, podobny do trybu `drun` rofi.\n\n- Gmrun — Lekki program uruchamiający aplikacje oparty na GTK, z możliwością uruchamiania programów w terminalu i innymi przydatnymi funkcjami.\n\n- GNOME Do — Program uruchamiający aplikacje inspirowany Quicksilver z wieloma wtyczkami, pierwotnie opracowany dla pulpitu GNOME.\n\n- Gnome-Pie — Okrągły program uruchamiający aplikacje (menu kołowe) dla systemu Linux. Składa się z kilku ciast, z których każde składa się z wielu plasterków.\n\n- higgins — Niezależny od pulpitu program uruchamiający aplikacje, wyszukiwarka plików, kalkulator i inne. Oparty na wtyczkach, swobodnie i łatwo rozszerzalny za pomocą wtyczek napisanych przez użytkownika\n\n- j4-dmenu-desktop — Bardzo szybki program uruchamiający aplikacje dmenu.\n\n- jgmenu — Proste, niezależne, nowocześnie wyglądające menu X11, zaprojektowane do pisania skryptów, rysowania i dostosowywania.\n\n- Kupfer — Wygodne narzędzie poleceń i dostępu dla pulpitu GNOME, które może uruchamiać aplikacje, otwierać dokumenty i uzyskiwać dostęp do różnych typów obiektów oraz wykonywać na nich działania.\n\n- launch — Proste polecenie do uruchamiania aplikacji z emulatora terminala.\n\n- Launchy — Bardzo popularny wieloplatformowy program uruchamiający aplikacje z systemem opartym na wtyczkach, który zapewnia dodatkowe funkcje.\n\n- Lighthouse — Proste skryptowalne wyskakujące okno dialogowe do uruchomienia na X.\n\n- nwg-drawer — Szuflada aplikacji oparta na GTK, zaprojektowana dla kompozytora Sway.\n\n- nwg-menu — Oparte na GTK menu aplikacji zaprojektowane dla kompozytora Sway.\n\n- rofi — Przełącznik wyskakujących okienek z grubsza oparty na superswitcher, wymagający jedynie xlib i pango.\n\n- rlaunch — Niezwykle szybki i lekki program uruchamiający aplikacje podobne do dmenu, napisany w języku Rust\n\n- Synapse — Semantyczny program uruchamiający napisany w Vala, którego można używać do uruchamiania aplikacji, a także znajdowania i uzyskiwania dostępu do odpowiednich dokumentów i plików za pomocą silnika Zeitgeist.\n\n- Ulauncher — Nowoczesny i błyszczący program uruchamiający, który zapewnia rozmyte wyszukiwanie, rozszerzenia i motywy\n\n- vonal — Nowoczesne, konfigurowalne menu globalne z nieograniczającym systemem wtyczek napisanym w języku Rust\n\n- wofi — Oparty na GTK przełącznik wyskakujących okien dla kompozytorów Wayland, takich jak sway. Zainspirowany przez rofi.\n\n- wmenu — Dynamiczne menu dla kompozytorów Wayland opartych na Sway i wlroots. Zapewnia natywny dla Wayland zamiennik dmenu, który zachowuje wygląd i działanie dmenu\n\n- yofi — Minimalistyczne menu dla kompozytorów opartych na Wayland.\n\n- tofi — Malutkie dynamiczne menu, szybki i prosty zamiennik dmenu/rofi dla kompozytorów Wayland takich jak sway.\n\n"
    },
    {
      "title": "Edytory menu aplikacji",
      "level": 3,
      "content": "- Alacarte — Dodawanie lub usuwanie aplikacji z menu głównego.\n\n- AppEditor — Edycja wpisów aplikacji w menu aplikacji.\n\n- Ezame — Edytor plików pulpitu i menu.\n\n- KMenuEdit — Edytuj jeden z programów uruchamiających aplikacje KDE. Część plasma.\n\n- lxmed — Edytor menu aplikacji napisany w Javie.\n\n- MenuLibre — Zaawansowany edytor menu zapewniający nowoczesne funkcje w przejrzystym, łatwym w użyciu interfejsie.\n\n- Meow — Edytor menu aplikacji napisany w Javie.\n\n- Mozo — Zmiana aplikacji wyświetlanych w menu głównym.\n\n"
    },
    {
      "title": "Programy do ustawiania tapet",
      "level": 3,
      "content": "Zobacz także Wikipedia:Wallpaper (computing).\n\n- bgs — Niezwykle szybki i mały program do ustawiania tła dla X oparty na imlib2.\n\n- esetroot — Główny program do ustawiania tła Eterm, pakowany osobno.\n\n- feh — Lekka i wydajna przeglądarka obrazów, która może być również używana do zarządzania tapetami pulpitu.\n\n- Fondo — Znajdź wiele najpiękniejszych tapet z Unsplash.com.\n\n- habak — Aplikacja do zmiany tła.\n\n- Hanabi — Tapeta na żywo dla GNOME.\n\n- Hidamari — Tapeta wideo dla systemu Linux. Napisana w języku Python.\n\n- hsetroot — Narzędzie do tworzenia kompozycji tapet.\n\n- HydraPaper — Narzędzie GTK do ustawiania dwóch różnych teł dla każdego monitora w środowisku GNOME.\n\n- Hyprpaper — Hyprpaper to niesamowicie szybkie narzędzie do tapet wayland z kontrolą IPC.\n\n- LiveWallpaper — Animowane tapety 3D.\n\n- mpvpaper — Program do tworzenia tapet wideo dla kompozytorów wayland opartych na wlroots.\n\n- Nitrogen — Szybka i lekka przeglądarka i ustawiacz tła pulpitu dla okien X.\n\n- oguri — Demon animowanych tapet dla kompozytorów Wayland.\n\n- pacwall — Tapeta na żywo, która pokazuje wykres zależności i stan zainstalowanych pakietów.\n\n- pybgsetter — Multi-backend (hsetroot, Esetroot, habak, feh) do ustawiania tapety pulpitu.\n\n- pywal — Zmienia tapetę i tworzy pasujące schematy kolorów dla różnych aplikacji (rofi, i3, terminale)\n\n- swaybg — Narzędzie do tapet dla kompozytorów Wayland.\n\n- swww — Wydajny demon animowanych tapet dla wayland, kontrolowany w czasie wykonywania.\n\n- Variety — Zmienia tapetę w regularnych odstępach czasu przy użyciu obrazów określonych przez użytkownika lub pobranych automatycznie.\n\n- Xlivebg — Struktura tapet na żywo i kolekcja tapet na żywo dla systemu okien X.\n\n- xwallpaper — Minimalistyczne narzędzie do ustawiania tapet dla X.\n\n"
    },
    {
      "title": "Pagery dla wirtualnych pulpitów",
      "level": 3,
      "content": "Zobacz także Wikipedia:Pager (GUI).\n\n- bbpager — Dokowalny pager dla blackbox i innych menedżerów okien.\n\n- fbpager — Pager pulpitu dla Fluxbox.\n\n- IPager — Konfigurowalny pager z przezroczystością, pierwotnie opracowany dla Fluxbox.\n\n- Netwmpager — Pager kompatybilny z NetWM/EWMH.\n\n"
    },
    {
      "title": "Widżety pulpitu",
      "level": 3,
      "content": "- gDesklets — System do przenoszenia mini programów (desklets) na pulpit.\n\n- KRuler — Wyświetla na ekranie linijkę mierzącą piksele. Część kde-graphics.\n\n"
    },
    {
      "title": "Powiadomienia na pulpicie",
      "level": 3,
      "content": "Zobacz: Serwery powiadomień.\n\n"
    },
    {
      "title": "Menedżery schowka",
      "level": 3,
      "content": "Zobacz Clipboard#Managers.\n\n"
    },
    {
      "title": "Interfejs wylogowania",
      "level": 3,
      "content": "- clearine — Piękny interfejs wylogowania dla menedżera okien X11\n\n- nwg-bar — Konfigurowalny pasek przycisków dla kompozytorów opartych na wlroots.\n\n- oblogout — Skrypt wylogowania Openbox\n\n- wlogout — Menu wylogowania dla wayland\n\n"
    }
  ]
}