{
  "title": "List of applications (Polski)/Documents (Polski)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Polski)/Documents_(Polski)",
  "sections": [
    {
      "title": "Edytory tekstu",
      "level": 2,
      "content": "Zobacz także Wikipedia:Comparison of text editors.\n\nNiektóre z lżejszych zintegrowanych środowisk programistycznych mogą również służyć jako edytory tekstu.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 3,
      "content": "- dte — Mały, łatwy w użyciu edytor z interfejsem z wieloma zakładkami, podświetlaniem składni, nawigacją po znacznikach itp.\n\n- e3 — Malutki edytor bez zależności, napisany w asemblerze.\n\n- ed — Zgodny z POSIX liniowy edytor tekstu. Przydatny do skryptów powłoki, mniej do użytku ręcznego. Oryginalny edytor dla systemu Unix.\n\n- ee — Klasyczny edytor tekstu oparty na curses. Stworzony w HP-UX, używany w FreeBSD.\n\n- JED — Edytor tekstu wykorzystujący w szerokim zakresie bibliotekę S-Lang. Zawiera wersję konsolową (jed) i wersję X-window (xjed).\n\n- JOE (Joe's Own Editor) — Terminalowy edytor tekstu zaprojektowany z myślą o łatwości użytkowania.\n\n- mcedit — Przydatny edytor tekstu dostarczany wraz z menedżerem plików Midnight Commander.\n\n- micro — Nowoczesny i intuicyjny terminalowy edytor tekstu, napisany w języku Go i rozszerzalny za pomocą wtyczek.\n\n- Minimum Profit — Edytor tekstu dla programistów.\n\n- nano — Konsolowy edytor tekstu oparty na pico z pomocą dotyczącą przypisywania klawiszy na ekranie.\n\n- ne — Minimalistyczny edytor tekstu z powiązaniami klawiszy podobnymi do Windows.\n\n- Tilde — Intuicyjny edytor tekstu z powiązaniami klawiszy jak w systemie Windows.\n\n"
    },
    {
      "title": "Edytory tekstu w stylu Emacsa",
      "level": 3,
      "content": "- Emacs — Rozszerzalny, konfigurowalny, samodokumentujący się edytor wyświetlania w czasie rzeczywistym autorstwa GNU.\n\n- jove — Jonathan's Own Version of Emacs to edytor podobny do Emacsa bez Lispa.\n\n- mg — Mały, szybki i przenośny edytor podobny do Emacsa.\n\n- vile — Lekki klon Emacsa z powiązaniami klawiszy podobnymi do \"vi\".\n\n- Zile — Lekki klon Emacsa.\n\n"
    },
    {
      "title": "Edytory tekstu w stylu Vi",
      "level": 3,
      "content": "- Amp — Edytor tekstu napisany w języku Rust, który ma na celu przejęcie podstawowego modelu interakcji Vima, uproszczenie go i dołączenie podstawowych funkcji wymaganych w nowoczesnym edytorze tekstu.\n\n- Aretext — Minimalistyczny edytor tekstu z powiązaniami klawiszy kompatybilnymi z vimem.\n\n- BusyBox vi — Zapewnia \"małego klona 'vi'\". Może być wywołany z busybox vi.\n\n- elvis — Klon vi z opcjonalną obsługą X.\n\n- Kakoune — Edytor modalny. Mniej naciśnięć klawiszy. Edycja oparta na zaznaczeniu i wielu kursorach. Projektowanie ortogonalne.\n\n- Helix — Postmodernistyczny modalny edytor tekstu.\n\n- Neovim — Odrodzenie Vima na miarę XXI wieku.\n\n- Neovim-Qt — Qt GUI dla Neovim.\n\n- vi — Oryginalny edytor tekstu ex/vi.\n\n- Vim — Zaawansowany edytor tekstu, który stara się zapewnić moc de-facto edytora uniksowego \"vi\", z bardziej kompletnym zestawem funkcji.\n\n- Vis — Nowoczesny, darmowy, prosty, ale wydajny edytor podobny do vima.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 3,
      "content": "- Acme — Minimalistyczne i elastyczne środowisko programistyczne opracowane przez Roba Pike'a dla systemu operacyjnego Plan 9.\n\n- Adie — Szybki i wygodny edytor tekstu do programowania.\n\n- Beaver — Edytor GTK zaprojektowany jako modułowy, lekki i stylowy.\n\n- CorePad — Prosty, lekki, ale potężny edytor tekstu z obsługą podświetlania składni dla kilkunastu języków. Część pakietu C-Suite.\n\n- Deepin Text Editor — Prosty edytor tekstu dla Deepin desktop.\n\n- Ecrire — Prosty edytor tekstu oparty na EFL.\n\n- FeatherPad — Minimalistyczny edytor tekstu Qt5 z natywnym ciemnym motywem i obsługą zakładek, drukowania i podświetlania składni.\n\n- FLTK Editor — Prosty edytor tekstu dla FLTK.\n\n- gCSVedit — Prosty edytor tekstu dla plików CSV, TSV i innych rodzajów plików z wartościami oddzielonymi separatorem (DSV).\n\n- gedit — Edytor GTK dla środowiska GNOME z podświetlaniem składni, automatycznym wcięciem, dopasowywaniem nawiasów itp. oraz wieloma dodatkami zwiększającymi funkcjonalność. Część gnome-extra.\n\n- GNOME Text Editor — Prosty edytor tekstu dla środowiska GNOME, nastawiony na przyjemną obsługę domyślną. Część gnome.\n\n- Gobby — Edytor do współpracy obsługujący wiele dokumentów w jednej sesji i czat dla wielu użytkowników.\n\n- Howl — Uniwersalny, szybki i lekki edytor z minimalistycznym interfejsem użytkownika zorientowanym na klawiaturę.\n\n- jEdit — Edytor tekstu dla programistów, napisany w języku Java.\n\n- Kate — W pełni funkcjonalny edytor programistyczny dla pulpitu KDE z MDI i przeglądarką systemu plików. Część kde-utilities.\n\n- KWrite — Lekki edytor tekstu dla pulpitu KDE, który używa tego samego widżetu edytora co Kate, teraz dostarczany przez pakiet kate. Część kde-utilities.\n\n- L3afpad — Prosty edytor tekstu sforkowany z Leafpad, obsługuje GTK 3.\n\n- Lapce — Błyskawiczny i wydajny edytor kodu napisany w języku Rust.\n\n- Leafpad — Klon notatnika dla GTK, który kładzie nacisk na prostotę.\n\n- Liri Text — Edytor tekstu dla Liri.\n\n- Lite XL — Lekki, prosty, szybki, pełen funkcji i niezwykle rozszerzalny edytor tekstu napisany w C i Lua, zaadaptowany z lite.\n\n- medit — Programistyczny i około-programistyczny edytor tekstu.\n\n- Mousepad — Szybki edytor tekstu dla środowiska graficznego Xfce.\n\n- NEdit — Edytor tekstu dla środowiska Motif.\n\n- Notepadqq — Oparty na Qt, podobny do Notepad++ edytor tekstu z obsługą podświetlania składni dla ponad 100 języków.\n\n- Nota — Łatwy w użyciu edytor tekstu z prostym interfejsem z obsługą dokumentów w kartach, podświetlaniem składni dla różnych języków, trybem ostrości, adnotacjami, konfigurowalnymi czcionkami i kolorami, panelem bocznym ze zintegrowaną przeglądarką plików i nie tylko. Część maui.\n\n- Pantheon Code — Edytor kodu dla elementary OS. Automatycznie zapisuje pliki, co oznacza, że są one zawsze aktualne. Ponadto zapamiętuje zakładki, dzięki czemu nigdy nie zgubisz swojego punktu w pliku, nawet między sesjami.\n\n- Pluma — Potężny edytor tekstu dla MATE.\n\n- QSciTE — Klon Qt edytora tekstu i kodu SciTE.\n\n- Sam — Minimalistyczny edytor tekstu z graficznym interfejsem użytkownika, bardzo wydajnym językiem poleceń i możliwością zdalnej edycji, opracowany przez Roba Pike'a.\n\n- SciTE — Ogólnie przydatny edytor z możliwością tworzenia i uruchamiania programów.\n\n- Sublime Text — Zastrzeżony edytor oparty na językach C++ i Python z wieloma zaawansowanymi funkcjami i wtyczkami, a jednocześnie lekki i ładny.\n\n- Tau — Minimalna nakładka GTK na rdzeń edytora xi napisana w Rust.\n\n- TEA — Bogaty w funkcje edytor tekstu oparty na Qt.\n\n- Textadept — Rozszerzalny, bogaty w funkcje edytor tekstu Lua oparty na Scintilli i napisany w języku C.\n\n- Textosaurus — Prosty wieloplatformowy edytor tekstu oparty na Qt i QScintilla.\n\n- Visual Studio Code — Edytor do tworzenia i debugowania nowoczesnych aplikacji internetowych i chmurowych.\n\n- VSCodium — Visual Studio Code, ale skompilowane bez telemetrii.\n\n- xed — Edytor tekstu oparty na Plumie opracowany dla Linux Mint.\n\n- XEdit — Prosty edytor tekstu dla systemu X Window.\n\n- wxMEdit — Edytor tekstu/hex napisany w C++ i wxWidgets.\n\n"
    },
    {
      "title": "Zoptymalizowane dla dużych plików",
      "level": 3,
      "content": "- glogg — Szybki, zaawansowany eksplorator logów.\n\n- Klogg — Naprawdę szybki eksplorator logów oparty na projekcie glogg.\n\n"
    },
    {
      "title": "Pakiety biurowe",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of office suites.\n\n- Calligra — Aktywnie rozwijany fork KOffice, pakietu biurowego KDE. Oferuje on większość funkcji OpenOffice, a jednocześnie posiada wersje na smartfony (Calligra Mobile) i tablety (Calligra Active).\n\n- LibreOffice — Pakiet biurowy zgodny z otwartym i ustandaryzowanym formatem dokumentów ODF. Fork OpenOffice, wspierane przez The Document Foundation.\n\n- OnlyOffice — Pakiet biurowy łączący w sobie edytory tekstu, arkuszy kalkulacyjnych i prezentacji.\n\n- OpenOffice — Pakiet oprogramowania biurowego o otwartym kodzie źródłowym do edycji tekstu, arkuszy kalkulacyjnych, prezentacji, grafiki, baz danych i innych, na licencji Apache.\n\n- SoftMaker Office — Kompletny, niezawodny, szybki i kompatybilny z pakietem Microsoft Office pakiet biurowy z edytorem tekstu, arkuszem kalkulacyjnym i oprogramowaniem graficznym do prezentacji.\n\n- WPS Office — Autorski pakiet biurowy, wcześniej znany jako Kingsoft Office.\n\n- Yozo Office — Własny pakiet biurowy, kompatybilny z MS Office.\n\n"
    },
    {
      "title": "Biurowe edytory tekstu",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of word processors.\n\n- AbiWord — W pełni funkcjonalny edytor tekstu.\n\n- Calligra Words — Potężny edytor tekstu wchodzący w skład pakietu Calligra Suite.\n\n- LibreOffice Writer — W pełni funkcjonalny edytor tekstu wchodzący w skład pakietu LibreOffice.\n\n- OpenOffice Writer — W pełni funkcjonalny edytor tekstu wchodzący w skład pakietu OpenOffice.\n\n- Ted — Łatwy w użyciu procesor tekstu sformatowanego oparty na GTK (z obsługą przypisów).\n\n- WordGrinder — Edytor tekstu dla konsoli.\n\n"
    },
    {
      "title": "Edytory HTML WYSIWYG",
      "level": 4,
      "content": "- PageEdit — wizualny edytor XHTML ePub.\n\n- SeaMonkey Composer — Potężny, ale prosty edytor HTML zawarty w pakiecie SeaMonkey.\n\n"
    },
    {
      "title": "Publikowanie",
      "level": 4,
      "content": "- gLabels — Program do tworzenia etykiet, wizytówek i okładek nośników.\n\n- Scribus — Program do publikowania na komputerach. Używa hyphen i jego pakietów językowych do dzielenia wyrazów.\n\n"
    },
    {
      "title": "Prezentacje",
      "level": 3,
      "content": "- Calligra Stage — Łatwa w użyciu, a jednocześnie elastyczna aplikacja do prezentacji wchodząca w skład pakietu Calligra Suite.\n\n- LibreOffice Impress — Program do tworzenia prezentacji wchodzący w skład pakietu biurowego LibreOffice.\n\n- MDP — Narzędzie do prezentacji markdown oparte na wierszu poleceń.\n\n- OpenOffice Impress — Program do tworzenia prezentacji wchodzący w skład pakietu biurowego OpenOffice.\n\n- sent — Proste narzędzie do prezentacji zwykłego tekstu.\n\n- Sozi — Powiększający edytor i odtwarzacz prezentacji. Oparty na platformie Electron.\n\n- Spice-Up — Twórz proste i piękne prezentacje.\n\n"
    },
    {
      "title": "Arkusze kalkulacyjne",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of spreadsheet software.\n\n- Calligra Sheets — Potężna aplikacja do arkuszy kalkulacyjnych zawarta w pakiecie Calligra Suite.\n\n- Gnumeric — Arkusze kalkulacyjne dla środowiska GNOME.\n\n- LibreOffice Calc — W pełni funkcjonalny program do arkuszy kalkulacyjnych wchodzący w skład pakietu LibreOffice.\n\n- OpenOffice Calc — W pełni funkcjonalny arkusz kalkulacyjny wchodzący w skład pakietu OpenOffice.\n\n- Pyspread — Pyspread to nietradycyjna aplikacja arkusza kalkulacyjnego oparta na języku programowania Python i napisana w tym języku.\n\n- sc — Lekki program do arkuszy kalkulacyjnych oparty na curses.\n\n- sc-im — Program do arkuszy kalkulacyjnych oparty na sc.\n\n"
    },
    {
      "title": "Narzędzia bazy danych",
      "level": 3,
      "content": "Narzędzia specyficzne dla DBMS, patrz:\n\n- MySQL#Graphical tools\n- PostgreSQL#Graphical tools\n- SQLite#Software\n- MongoDB#Tools\n\nZobacz także Wikipedia:Comparison of database tools.\n\n- Adminer — W pełni funkcjonalna aplikacja internetowa do zarządzania bazami danych z obsługą wielu typów baz danych.\n\n- beekeeper-studio — Nowoczesny, łatwy w użyciu i dobrze wyglądający klient SQL dla MySQL, Postgres, SQLite, SQL Server i innych.\n\n- DBeaver — Oparty na Javie graficzny edytor baz danych z obsługą wielu typów baz danych.\n\n- DbVisualizer — Uniwersalne narzędzie bazy danych\n\n- GdaBrowser — Graficzne narzędzie umożliwiające szybki dostęp do struktury i zawartości bazy danych.\n\n- Harlequin — IDE SQL dla terminala.\n\n- Kexi — Wizualne narzędzie do tworzenia aplikacji bazodanowych KDE, zaprojektowane w celu wypełnienia luki między arkuszami kalkulacyjnymi a rozwiązaniami bazodanowymi wymagającymi bardziej zaawansowanego rozwoju.\n\n- LibreOffice Base — W pełni funkcjonalny interfejs bazy danych na pulpicie dołączony do pakietu LibreOffice, zaprojektowany tak, aby zaspokoić potrzeby szerokiego grona użytkowników.\n\n- OpenOffice Base — W pełni funkcjonalny interfejs bazy danych na pulpicie, zawarty w pakiecie OpenOffice, zaprojektowany w celu zaspokojenia potrzeb szerokiego grona użytkowników.\n\n- Orbada — Doskonałe narzędzie dla programistów baz danych, programistów SQL, administratorów DBA, a także dla użytkowników, którzy chcą poszerzyć swoją wiedzę i umiejętności w zakresie SQL. Ostatnia wersja z dnia 2019-07-03.\n\n- Sequeler — Klient SQL zbudowany w Vala i Gtk. Pozwala łączyć się z lokalnymi i zdalnymi bazami danych, pisać SQL w poręcznym edytorze tekstu z rozpoznawaniem języka i wizualizować wyniki SELECT w widżecie Gtk.Grid.\n\n- SQuirreL SQL Client — Graficzny program Java umożliwiający przeglądanie struktury bazy danych zgodnej z JDBC, przeglądanie danych w tabelach, wydawanie poleceń SQL itp.\n\n- TOra — Interfejs GUI do zarządzania bazami danych, który obsługuje dostęp do większości powszechnie używanych platform baz danych, w tym Oracle, MySQL i PostgreSQL, a także ograniczoną obsługę dowolnego celu, do którego można uzyskać dostęp za pośrednictwem obsługi ODBC Qt.\n\n"
    },
    {
      "title": "Narzędzia baz danych w postaci zwykłego tekstu",
      "level": 4,
      "content": "Tego rodzaju oprogramowanie znajduje się pomiędzy narzędziami do przetwarzania tekstu, takimi jak awk, arkuszami kalkulacyjnymi i systemami baz danych na poziomie produkcyjnym. Ponaddto zwykle są one dostarczane z interfejsem wiersza poleceń innym niż SQL.\n\n- csvkit — Zestaw narzędzi CSV/TSV napisany w Pythonie\n\n- csvtk — wieloplatformowy, wydajny i praktyczny zestaw narzędzi CSV/TSV napisany w języku Go\n\n- datamash — Narzędzie GNU do podstawowych operacji numerycznych i statystycznych na danych tekstowych.\n\n- num-utils — Zestaw programów konsolowych do obliczeń numerycznych.\n\n- recutils — Narzędzia GNU do pracy z edytowalnymi przez człowieka, tekstowymi plikami baz danych (w prostym formacie zwanym \"recfile\").\n\n- tsv-utils — Narzędzia CLI eBay do obsługi dużych, tabelarycznych plików danych, w tym filtrowania, statystyk, próbkowania i łączenia.\n\n"
    },
    {
      "title": "\"Uproszczone\" oprogramowanie bazodanowe (narzędzia bazodanowe przyjazne dla początkujących)",
      "level": 4,
      "content": "- Symphytum — Oprogramowanie do osobistej bazy danych dla każdego, kto chce zarządzać i organizować dane w łatwy i intuicyjny sposób, bez konieczności uczenia się skomplikowanych języków baz danych i interfejsów użytkownika oprogramowania.\n\n- TreeLine — Przechowuj prawie każdy rodzaj informacji w strukturze drzewa, co ułatwia utrzymanie porządku.\n\n"
    },
    {
      "title": "Edytory wzorów",
      "level": 3,
      "content": "Zobacz #Edytory wzorów TeX oraz Wikipedia:Formula editor.\n\n- LibreOffice Math — Tworzy i edytuje formuły naukowe i równania. Wchodzi w skład pakietu biurowego LibreOffice.\n\n- OpenOffice Math — Tworzy równania i formuły dla dokumentów. Dołączony do pakietu OpenOffice.\n\n"
    },
    {
      "title": "Języki znacznikowe",
      "level": 2,
      "content": "Zobacz także Wikipedia:Comparison of document markup languages.\n\n- txt2tags — Prosty, zgodny z KISS, lekki, czytelny dla człowieka język znaczników do tworzenia treści w bogatym formacie ze zwykłych plików tekstowych.\n\n"
    },
    {
      "title": "AsciiDoc",
      "level": 3,
      "content": "Zobacz także Wikipedia:AsciiDoc.\n\n- AsciiDoc.py — Starsza implementacja napisana w Pythonie. Używana przez Arch do generowania stron podręcznika pacmana [1].\n\n- Asciidoctor — Implementacja napisana w języku Ruby, z wieloma dodatkowymi funkcjami.\n\n"
    },
    {
      "title": "Markdown",
      "level": 3,
      "content": "Zobacz również oficjalną stronę i Wikipedia:Markdown.\n\n- cmark — Biblioteka i program do parsowania i renderowania CommonMark w języku C.\n\n- Discount — Implementacja Markdown napisana w języku C.\n\n- lowdown — Tłumacz Markdown tworzący dokumenty HTML5 i roff w formatach ms i man.\n\n- Marked — Parser i kompilator Markdown zbudowany z myślą o szybkości.\n\n- md2html — Parser C Markdown.\n\n- Pandoc również obsługuje Markdown.\n\n"
    },
    {
      "title": "Implementacje w Pythonie",
      "level": 4,
      "content": "- CommonMark-py — Parser Pythona dla specyfikacji CommonMark Markdown.\n\n- M2R2 — Konwerter Markdown na reStructuredText.\n\n- Mistune — Najszybszy parser markdown w czystym Pythonie z funkcją renderowania.\n\n- Python-Markdown — Rozszerzalna implementacja Markdown Johna Grubera w Pythonie.\n\n- PyMdown Extensions — Rozszerzenia dla Python-Markdown.\n\n- MkDocs — Dokumentacja projektu z użyciem Markdown.\n\n- Material dla MkDocs — Motyw Material design dla MkDocs.\n\n- MkDocs Material Extensions — Zasoby rozszerzeń Markdown dla MkDocs Material.\n\n"
    },
    {
      "title": "Implementacje w Ruby",
      "level": 4,
      "content": "- kramdown — Szybki, czysty konwerter supersetów Ruby Markdown, wykorzystujący ścisłą definicję składni.\n\n- Maruku — Interpreter czystego Rubiego Markdown-superset.\n\n- mdless — Oparta na terminalu Ruby przeglądarka markdown/interpeter.\n\n"
    },
    {
      "title": "Edytory Markdown",
      "level": 4,
      "content": "- Apostrophe — Edytor Markdown bez elementów rozpraszających uwagę stworzony przy użyciu GTK.\n\n- CuteMarkEd — Oparty na Qt edytor Markdown z podglądem HTML na żywo, wyrażeniami matematycznymi, podświetlaniem kodu i składni Markdown. Porzucony od 2016 roku.\n\n- Formiko — Edytor reStructuredText i Markdown oraz podgląd na żywo napisany w Pythonie z GTK.\n\n- ghostwriter — Edytor Markdown bez elementów rozpraszających uwagę. Część kde-office.\n\n- Marker — Prosty, ale solidny edytor Markdown.\n\n- Mark My Words — Minimalny edytor markdown.\n\n- Mark Text — Edytor markdown nowej generacji. Oparty na platformie Electron.\n\n- Remarkable — W pełni funkcjonalny edytor Markdown.\n\n- ReText — Prosty edytor tekstu dla Markdown i reStructuredText.\n\n- ThiefMD — Edytor Markdown i Fountain inspirowany Ulyssesem.\n\n- Typora — Własny, minimalistyczny edytor Markdown.\n\n- Zettlr — Wieloplatformowy edytor markdown, inspirowany systemem Zettelkasten do tworzenia notatek i zarządzania wiedzą osobistą. Oparty na platformie Electron.\n\n"
    },
    {
      "title": "reStructuredText",
      "level": 3,
      "content": "Zobacz także reStructuredText.\n\n- Docutils — Zestaw narzędzi do przetwarzania dokumentów tekstowych (reStructuredText) do formatów takich jak HTML, XML lub LaTeX.\n\n- rstcheck — Sprawdza składnię reStructuredText i zagnieżdżonych w nim bloków kodu.\n\n- Sphinx — System generowania dokumentacji wykorzystujący reStructuredText do generowania danych wyjściowych w wielu formatach (główny system dokumentacji dla projektu Python).\n\n"
    },
    {
      "title": "Systemy składu tekstu",
      "level": 3,
      "content": "- groff — GNU implementacja troffa, dziedzicznego uniksowego systemu przetwarzania dokumentów i domyślnego formatyzatora stron man.\n\n- Lout — Lekki system formatowania dokumentów. Odczytuje wysokopoziomowy opis dokumentu w stylu podobnym do LaTeX i tworzy PostScript.\n\n- SILE — Nowoczesny system składu inspirowany TeX-em.\n\n- TeX — Wysokiej jakości system składu popularny w środowisku akademickim.\n\n- Texinfo — Składnia maszynopisu dla podręczników oprogramowania używanych przez Projekt GNU.\n\n- Typst — System składu oparty na znacznikach dla nauk ścisłych.\n\n"
    },
    {
      "title": "Edytory TeX",
      "level": 3,
      "content": "Dzięki TeX, LaTeX i przyjaciołom tworzenie dowolnego dokumentu naukowego, artykułu, czasopisma itp. staje się powszechne.\n\nZobacz także Wikipedia:Comparison of TeX editors i Wikibooks:LaTeX/Installation#Editors.\n\n- AUCTeX — Wraz z RefTex, AUCTeX zapewnia rozszerzalne środowisko do pisania i formatowania plików TeX w Emacs.\n\n- gedit LaTeX Plugin — Dodaje uzupełnianie kodu do gedit i pozwala na kompilowanie dokumentów LaTeX i zarządzanie bibliografiami BibTeX.\n\n- GNOME LaTeX — Edytor LaTeX dla środowiska GNOME Desktop z obsługą uzupełniania kodu, kompilacji i zarządzania projektami.\n\n- Gummi — Lekki edytor TeX/LaTeX oparty na GTK. Posiada tryb ciągłego podglądu, zintegrowaną obsługę BibTeX, rozszerzalny interfejs snippetów i obsługę wielu dokumentów.\n\n- Kile — Przyjazny dla użytkownika edytor TeX/LaTeX dla pulpitu KDE z wieloma funkcjami.\n\n- Ktikz — Mała aplikacja pomagająca tworzyć diagramy PGF/TikZ do publikacji.\n\n- LyX — Procesor dokumentów, który zachęca do pisania w oparciu o strukturę dokumentów (WYSIWYM), a nie tylko ich wygląd (WYSIWYG).\n\n- Setzer — Edytor LaTeX napisany w Pythonie z GTK.\n\n- TeXmacs — Platforma do edycji WYSIWYW (what you see is what you want) ze specjalnymi funkcjami dla naukowców.\n\n- Texmaker — Wieloplatformowe, lekkie i łatwe w użyciu IDE LaTeX. Integruje wiele narzędzi potrzebnych do tworzenia dokumentów w LaTeX-u w jednej aplikacji\n\n- TeXstudio — Fork TeXMaker, zawierający obsługę uzupełniania kodu elementów bibtex, sprawdzania gramatyki i automatycznego wykrywania potrzeb wielokrotnego uruchamiania LaTeX.\n\n- TeXworks — Prosty program TeX front-end wzorowany na TeXShop.\n\n- TikZiT — Narzędzie graficzne do szybkiego tworzenia wykresów i diagramów przy użyciu PGF/TikZ.\n\n- Vim-LaTeX-suite — Konfigurowalne środowisko LaTeX dla Vima.\n\n"
    },
    {
      "title": "Edytory wzorów TeX",
      "level": 3,
      "content": "- EqualX — Edytor równań LaTeX z podglądem w czasie rzeczywistym.\n\n- KLatexFormula — GUI do generowania obrazów z równań LaTeX.\n\n- LibreOffice TexMaths extension — Edytor równań LaTeX dla LibreOffice.\n\n"
    },
    {
      "title": "Edytory XML",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of XML editors.\n\n- QXmlEdit — Prosty edytor Qt XML i przeglądarka XSD.\n\n- XML Copy Editor — Szybki, sprawdzający poprawność edytor XML.\n\n- XML Tree Editor — Wyświetla pliki XML jako widoki drzewa i umożliwia podstawowe operacje: dodawanie, edytowanie i usuwanie węzłów tekstowych i ich atrybutów.\n\n"
    },
    {
      "title": "Konwertery dokumentów",
      "level": 2,
      "content": "Zobacz także #Języki znacznikowe i PDF, PS and DjVu.\n\n- Antiword — Konwerter MS Word na tekst.\n\n- catdoc — Konwerter plików Microsoft Word, Excel, PowerPoint i RTF na tekst.\n\n- docx2txt — Konwerter MS Word Docx na tekst.\n\n- HTMLDOC — Odczytuje pliki źródłowe HTML i Markdown lub strony internetowe i generuje odpowiednie pliki EPUB, HTML, PostScript lub PDF z opcjonalnym spisem treści.\n\n- mutool — Uniwersalne narzędzie oparte na MuPDF do obsługi plików dokumentów na różne sposoby.\n\n- Pandoc — Zestaw narzędzi do konwersji znaczników i formatów dokumentów.\n\n- unoconv — Konwerter dokumentów oparty na LibreOffice.\n\n- UnRTF — Program wiersza poleceń konwertujący dokumenty RTF do innych formatów.\n\n"
    },
    {
      "title": "Menedżery odnośników bibliograficznych",
      "level": 2,
      "content": "Zobacz także Wikipedia:Comparison of reference management software.\n\n- DocEar — Docear to pakiet literatury akademickiej do wyszukiwania, organizowania i tworzenia literatury akademickiej, oparty na oprogramowaniu do mapowania myśli Freeplane i menedżerze referencji JabRef.\n\n- JabRef — Interfejs Java GUI do zarządzania BibTeXem i innymi bibliografiami.\n\n- KBibTeX — Edytor BibTeX dla KDE do edycji bibliografii używanych z LaTeX.\n\n- Mendeley Desktop — Własny menedżer referencji i akademicka sieć społecznościowa.\n\n- Papis — Oparty na wierszu poleceń menedżer dokumentów i bibliografii.\n\n- Zotero — Łatwe w użyciu narzędzie ułatwiające gromadzenie, porządkowanie, cytowanie i udostępnianie źródeł naukowych. Może importować i eksportować BibTeX i ma rozszerzenia przeglądarki.\n\n"
    },
    {
      "title": "Czytniki i przeglądarki",
      "level": 2,
      "content": "- NFO Viewer — Prosta przeglądarka plików NFO.\n\n"
    },
    {
      "title": "PDF i DjVu",
      "level": 3,
      "content": "Zobacz PDF, PS and DjVu.\n\n"
    },
    {
      "title": "E-book",
      "level": 3,
      "content": "- Arianna — Czytnik ebooków i aplikacja do zarządzania biblioteką obsługująca pliki EPUB. Część kde-graphics.\n\n- Beseda — Dostępny (dla osób niedowidzących) czytnik e-booków, który może obsługiwać książki i dokumenty TXT, FB2, ABW, [X]HTML, ODT, DOCX.\n\n- Bookworm — Prosty czytnik e-booków dla systemu Elementary OS z obsługą formatów EPUB, PDF, Mobipocket i Comicbook.\n\n- Calibre — Aplikacja do zarządzania biblioteką e-booków, która może również edytować pliki EPUB, konwertować między różnymi formatami i synchronizować z różnymi czytnikami e-booków. Obsługiwane formaty to CHM, Comicbook, DjVu, DOCX, EPUB, FictionBook, HTML, HTMLZ, Kindle, LIT, LRF, Mobipocket, ODT, PDF, PRC, PDB, PML, RB, RTF, SNB, TCR, TXT i TXTZ.\n\n- Cool Reader — Przeglądarka książek elektronicznych z wieloma obsługiwanymi formatami, takimi jak EPUB (bez DRM), FictionBook, TXT, RTF, HTML, CHM i TCR.\n\n- FBReader — Przeglądarka książek elektronicznych z wieloma obsługiwanymi formatami, takimi jak EPUB, FictionBook, HTML, plucker, PalmDoc, zTxt, TCR, CHM, RTF, OEB, Mobipocket (bez DRM) i TXT.\n\n- Foliate — Prosty i nowoczesny czytnik eBooków GTK. Obsługuje formaty EPUB, Mobipocket, Kindle, FictionBook i Comicbook.\n\n- Lector — Oparty na Qt czytnik e-booków z obsługą PDF, EPUB, Kindle, Mobipocket i Comicbook.\n\n- Sigil — Edytor e-booków EPUB WYSIWYG.\n\n- baca — Konsolowy czytnik EPUB.\n\nNiektóre przeglądarki PDF, takie jak apvlv, Atril, MuPDF, Okular i Xreader również obsługują format EPUB.\n\n"
    },
    {
      "title": "Komiksy",
      "level": 3,
      "content": "- Automedia — Bardzo mały program do pobierania mangi i anime z różnych stron internetowych. Zaprojektowany jako lżejsza alternatywa dla HakuNeko. Napisany głównie w C.\n\n- HakuNeko — Program do pobierania mangi i anime z różnych stron internetowych. Oparty na platformie Electron.\n\n- Kindle Comic Converter — Umożliwia przekształcanie plików PNG, JPG, GIF, CBZ, CBR i CB7 w e-booki w formacie EPUB lub MOBI.\n\n- Komikku — Czytnik mangi online/offline dla środowiska GNOME.\n\n- Manga Reader — Czytnik mangi dla plików lokalnych. Obsługuje pliki zip, rar, tar, 7z, cbz, cbr, cbt, cb7, a także foldery.\n\n- MComix — Przeglądarka obrazów GTK3 zaprojektowana specjalnie do obsługi archiwów komiksów (fork Comix). Zawiera również menedżera bibliotek.\n\n- QComicBook — Przeglądarka archiwów komiksów, której celem jest wygoda i prostota.\n\n- QuickMedia — Czytnik mangi online. Obsługuje automatyczne skalowanie stron za pomocą waifu2x-ncnn-vulkan\n\n- YACReader — Przeglądarka komiksów napisana w C++ i Qt5. Zawiera bibliotekę YACReaderLibrary do zarządzania komiksami.\n\nNiektóre przeglądarki PDF i e-booków, takie jak Atril, Bookworm, Calibre, Evince, Foliate, Lector, MuPDF, Okular, Xreader i Zathura również obsługują format Comicbook.\n\n"
    },
    {
      "title": "CHM",
      "level": 3,
      "content": "Zobacz także Wikipedia:Microsoft Compiled HTML Help.\n\n- Archmage — Rozszerzalny czytnik i dekompilator plików w formacie CHM.\n\n- Kchmviewer — Przeglądarka CHM oparta na Qt, używająca chmlib i zapożyczająca niektóre pomysły z xchm. Nie jest zależna od KDE, ale może być skompilowana do integracji z nim.\n\n- xCHM — Lekka przeglądarka CHM, oparta na chmlib.\n\nNiektóre przeglądarki PDF i e-booków, takie jak Cool Reader, FBReader i Okular również obsługują format CHM.\n\n"
    },
    {
      "title": "Menedżery dokumentów",
      "level": 2,
      "content": "- Paperwork — Osobisty menedżer dokumentów. Zarządza zeskanowanymi dokumentami i plikami PDF.\n\n- Shelf — Menedżer kolekcji dokumentów i książek elektronicznych obsługujący pliki PDF i EPUB. Część maui.\n\n"
    },
    {
      "title": "Oprogramowanie do skanowania",
      "level": 2,
      "content": "Zobacz SANE#Frontends\n\n- ScanTailor Advanced — Interaktywne narzędzie do przetwarzania zeskanowanych stron. Fork Scan Tailor z dodatkowymi funkcjami i poprawkami.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of optical character recognition software.\n\n- CuneiForm — System OCR wiersza poleceń pierwotnie opracowany i otwarty przez Cognitive technologies. Obsługiwane języki: eng, ger, fra, rus, swe, spa, ita, ruseng, ukr, srp, hrv, pol, dan, por, dut, cze, rum, hun, bul, slo, lav, lit, est, tur.\n\n- GOCR — Silnik OCR, który obsługuje również rozpoznawanie kodów kreskowych.\n\n- Ocrad — Program OCR oparty na metodzie ekstrakcji cech.\n\n- OCRmyPDF — Dodaje warstwę tekstową OCR do zeskanowanych plików PDF, umożliwiając ich przeszukiwanie.\n\n- Tesseract — Dokładny silnik OCR o otwartym kodzie źródłowym. Pakiet podzielony, należy zainstalować kilka plików danych dla każdego języka (tesseract-data-eng na przykład).\n\n"
    },
    {
      "title": "Graficzne",
      "level": 3,
      "content": "- gImageReader — Graficzna nakładka GTK/Qt na Tesseract.\n\n- gscan2pdf — Skanuje, uruchamia silnik OCR, wykonuje drobne przetwarzanie końcowe, tworzy dokument.\n\n- Linux-Intelligent-Ocr-Solution — Rozwiązanie Easy-OCR i trener Tesseract do konwersji druku na tekst przy użyciu skanera lub kamery.\n\n- OCRFeeder — Python GUI dla Gnome, który wykonuje analizę i renderowanie dokumentów i może używać CuneiForm, GOCR, Ocrad lub Tesseract jako silników OCR. Może importować z plików PDF lub obrazów i eksportować do HTML lub OpenDocument.\n\n- Paperwork — Osobisty menedżer dokumentów. Zarządza zeskanowanymi dokumentami i plikami PDF.\n\n- Scans to PDF — Tworzenie małych, przeszukiwalnych plików PDF z zeskanowanych dokumentów.\n\n- YAGF — Graficzny interfejs dla programu do rozpoznawania tekstu CuneiForm na platformie Linux.\n\n"
    },
    {
      "title": "Programy do robienia notatek",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of notetaking software.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- dnote — Prosty konsolowy notatnik dla programistów\n\n- Org mode — tryb Emacs do tworzenia notatek, planowania projektów i pisania.\n\n- eureka — Narzędzie CLI do wprowadzania i przechowywania pomysłów bez opuszczania terminala\n\n- kb — Minimalistyczny menedżer wiedzy oparty na terminalu.\n\n- nb — Aplikacja konsolowa (z przeglądarkowym interfejsem GUI) do tworzenia notatek, zakładek, archiwizacji i bazy wiedzy.\n\n- tnote — Mały konsolowy program do robienia notatek.\n\n- Vimwiki — Osobista wiki dla Vima - połączone ze sobą pliki tekstowe są napisane w języku znaczników.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- BasKet — Aplikacja do organizowania, udostępniania i robienia notatek. Może zarządzać różnymi rodzajami informacji, takimi jak listy rzeczy do zrobienia, linki, zdjęcia innymi, prawie jak fizyczny zeszyt.\n\n- Boostnote — Aplikacja do tworzenia notatek dla programistów, która koncentruje się na markdown, fragmentach i możliwości dostosowywania. Oparta na platformie Electron.\n\n- Buho — Menedżer zadań i notatek do zapisywania linków, tworzenia szybkich notatek i organizowania stron jako książek. Część maui.\n\n- Cherrytree — Hierarchiczna aplikacja do tworzenia notatek, zawierająca bogaty tekst i podświetlanie składni, przechowująca dane w pojedynczym pliku xml lub sqlite.\n\n- Deepin Voice Notes — Lekkie narzędzie do tworzenia notatek tekstowych i nagrań głosowych.\n\n- Encryptic — Aplikacja do tworzenia notatek w JavaScript z edytorem Markdown i obsługą szyfrowania. Oparta na platformie Electron.\n\n- FeatherNotes — Lekki hierarchiczny menedżer notatek Qt.\n\n- FromScratch — Prosta, ale inteligentna aplikacja do robienia notatek, której można używać jako aplikacji do szybkiego robienia notatek lub rzeczy do zrobienia. Oparta na platformie Electron.\n\n- GNOME Notes — Edytor notatek dla środowiska GNOME zaprojektowany z myślą o prostocie użytkowania. Część gnome-extra.\n\n- Gnote — Port Tomboy do C++. Jest to ta sama aplikacja do robienia notatek, zawierająca większość dodatków.\n\n- Joplin — Aplikacja do tworzenia notatek i zadań do wykonania, która może obsługiwać dużą liczbę notatek zorganizowanych w notatnikach na komputerach stacjonarnych lub urządzeniach mobilnych. Synchronizuje się z WebDAV, Dropbox, OneDrive, NextCloud, S3 (beta) i innymi backendami. Oparta na platformie Electron.\n\n- KeepNote — Wieloplatformowa aplikacja GTK do robienia notatek z bogatym formatowaniem tekstu.\n\n- Logseq — Lokalny, nieliniowy notatnik do organizowania i udostępniania osobistej bazy wiedzy.\n\n- Marknote — Prosta aplikacja do zarządzania notatkami Markdown dla KDE.\n\n- MyNotex — Menedżer notatek, plików dokumentów i aktywności.\n\n- Nextcloud Notes — Prosta aplikacja do notatek dla Nextcloud.\n\n- NixNote — Pomaga robić notatki i zachować porządek. Umożliwia tworzenie notatek tekstowych, załączanie plików lub obrazów, a nawet synchronizację z Evernote. Wcześniej nazywana Nevernote.\n\n- Norka — Oprogramowanie do tworzenia notatek z obsługą Markdown zaprojektowane dla Pantheon.\n\n- Notejot — Głupio prosty aplet samoprzylepnych notatek dla elementaryOS.\n\n- Notes — Aplikacja do robienia notatek, zapisywania myśli.\n\n- Notes-Up — Edytor i menedżer notatek Markdown dla systemu elementaryOS.\n\n- Notion — Tworzenie notatek, zarządzanie zadaniami, zarządzanie projektami, oprogramowanie do zarządzania wiedzą\n\n- Notorious — Zorientowana na klawiaturę aplikacja do tworzenia notatek z obsługą podświetlania składni Markdown.\n\n- nvPY — Aplikacja do synchronizacji notatek Simplenote, inspirowana Notational Velocity i ResophNotes, ale brzydsza i bardziej wieloplatformowa.\n\n- Obsidian — Osobista baza wiedzy wykorzystująca pliki tekstowe markdown do organizowania notatek w formacie odzwierciedlającym ludzki mózg.\n\n- OutWiker — Przechowywanie notatek w drzewie.\n\n- QOwnNotes — Notatnik i menedżer list rzeczy do zrobienia z obsługą markdown i opcjonalną integracją ownCloud zbudowany na Qt5.\n\n- Simplenote — Najprostszy sposób na prowadzenie notatek. Oparty na platformie Electron.\n\n- Standard Notes — Prosta aplikacja do prywatnych notatek, która koncentruje się na prostocie. Szyfruje dane lokalnie, zanim kiedykolwiek dotkną chmury. Oparta na platformie Electron.\n\n- TagSpaces — Osobisty menedżer danych offline do zarządzania plikami lokalnymi. Oparty na platformie Electron.\n\n- TiddlyWiki — Unikalny nieliniowy notatnik do przechwytywania, organizowania i udostępniania złożonych informacji.\n\n- Trilium — Zbuduj swoją osobistą bazę wiedzy dzięki Trilium Notes.\n\n- TuxCards — Hierarchiczny notatnik do wprowadzania i zarządzania każdym rodzajem notatek i pomysłów w uporządkowany sposób.\n\n- VNote — Inspirowana Vimem aplikacja do robienia notatek, która lepiej zna programistów i Markdown.\n\n- WikidPad — Przypominający Wiki notatnik do zapisywania myśli, pomysłów, list rzeczy do zrobienia, kontaktów i wszystkiego innego, co przyjdzie Ci do głowy.\n\n- WizNote — Oparty na chmurze klient do robienia notatek.\n\n- Zim — Edytor tekstu WYSIWYG, którego celem jest przeniesienie koncepcji wiki na pulpit.\n\n- zNotes — Lekka aplikacja do zarządzania notatkami z prostym interfejsem.\n\n- μPad — Aplikacja do robienia notatek, która pomaga organizować i robić notatki bez ograniczeń. Oparta na platformie Electron.\n\n"
    },
    {
      "title": "Sporządzanie notatek rysikiem",
      "level": 4,
      "content": "- Cournal — Aplikacja do wspólnego tworzenia notatek i dzienników za pomocą rysika. Umożliwia dodawanie adnotacji wielu użytkownikom do plików PDF w czasie rzeczywistym.\n\n- Saber — Wieloplatformowa aplikacja open source do robienia notatek\n\n- Write — Zastrzeżony edytor tekstu do odręcznego pisania.\n\n- Xournal — Aplikacja do notowania, szkicowania i prowadzenia dziennika za pomocą rysika. Może również dodawać adnotacje do istniejących plików PDF.\n\n- Xournal++ — Oprogramowanie do tworzenia notatek zaprojektowane z myślą o tabletach. Przepisanie Xournal w C++ z obsługą adnotacji PDF.\n\n- Rnote — Prosta aplikacja do robienia notatek napisana w Rust i GTK4.\n\n"
    },
    {
      "title": "Pamiętnik",
      "level": 3,
      "content": "- Almanah — Niewielka aplikacja GTK umożliwiająca prowadzenie dziennika życia.\n\n- Lifeograph — Aplikacja do prowadzenia prywatnych dzienników i notatek w trybie offline. Oferuje bogaty zestaw funkcji przedstawionych w przejrzystym i prostym interfejsie użytkownika.\n\n- RedNotebook — Nowoczesny dziennik, który pozwala formatować, oznaczać i przeszukiwać wpisy.\n\n- Simple Diary — Prosta i lekka aplikacja dziennika z obsługą Markdown.\n\n"
    },
    {
      "title": "Tworzenie map myśli",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of concept- and mind-mapping software.\n\n- FreeMind — OMaper myśli i hierarchiczny edytor z silnym naciskiem na składanie. Może być używany do zarządzania wiedzą i treścią.\n\n- Freeplane — Fork FreeMind, wspiera myślenie, dzielenie się informacjami i wykonywanie zadań w pracy. Oprogramowanie może być używane do tworzenia map myśli i analizowania informacji zawartych w mapach myśli.\n\n- Minder — Aplikacja do tworzenia map myśli zaprojektowana dla Pantheon.\n\n- MindMaster — Autorskie oprogramowanie do tworzenia map myśli i burzy mózgów z nowoczesnym interfejsem użytkownika i pięknym szablonem. Zapewnia również usługę mapy myśli online i udostępnianie na różnych platformach.\n\n- Semantik — Aplikacja do tworzenia map myśli dla KDE.\n\n- TreeSheets — \"Hierarchiczny arkusz kalkulacyjny\", który doskonale zastępuje arkusze kalkulacyjne, narzędzia do mapowania myśli, konspekty, PIM-y, edytory tekstu i małe bazy danych.\n\n- View Your Mind — Narzędzie do generowania i manipulowania mapami przedstawiającymi myśli użytkownika. Takie mapy mogą pomóc poprawić kreatywność i efektywność. Można ich używać do zarządzania czasem, organizowania zadań, przeglądania złożonych kontekstów, sortowania pomysłów itp.\n\n- Visual Understanding Environment — Elastyczne narzędzia do zarządzania i integracji zasobów cyfrowych w celu wspierania nauczania, uczenia się i badań.\n\n- XMind — Aplikacja do burzy mózgów i tworzenia map myśli. Zapewnia bogaty zestaw różnych stylów wizualizacji i umożliwia udostępnianie utworzonych map myśli za pośrednictwem ich strony internetowej.\n\n"
    },
    {
      "title": "Karteczki samoprzylepne",
      "level": 3,
      "content": "- GloboNote — Łatwa w użyciu aplikacja desktopowa do notatek samoprzylepnych, list rzeczy do zrobienia, osobistych dzienników, przypomnień i innych notatek.\n\n- Notes — Aplikacja do robienia notatek, zapisywania myśli.\n\n- PrimeNote — Dopracowana, wieloplatformowa aplikacja do obsługi karteczek samoprzylepnych napisana w PyQt.\n\n- Xpad — Aplikacja do notatek samoprzylepnych do zapisywania rzeczy do zapamiętania.\n\n"
    },
    {
      "title": "Pisanie bez rozpraszania uwagi",
      "level": 3,
      "content": "Zobacz także #Edytory Markdown i Wikipedia:Full-screen writing program.\n\n- FocusWriter — Proste, nierozpraszające środowisko do pisania. Wykorzystuje ukryty interfejs, do którego można uzyskać dostęp, przesuwając mysz do krawędzi ekranu, dzięki czemu program ma znajomy wygląd i styl, a jednocześnie nie przeszkadza, dzięki czemu można zanurzyć się w pracy.\n\n- PyRoom — Pełnoekranowy edytor bez przycisków, widżetów, opcji formatowania, menu i tylko z minimalną liczbą wymaganych okien dialogowych, nie rozprasza uwagi i pozwala skupić się na pisaniu i tylko pisaniu.\n\n- Quilter — Skup się na pisaniu i twórz piękne, solidne historie dzięki trybowi Focus Mode w tym edytorze Markdown.\n\n- TextRoom — Pełnoekranowy edytor tekstu dla pisarzy.\n\n"
    },
    {
      "title": "Pisanie opowiadań",
      "level": 3,
      "content": "- Manuskript — Zapewnia bogate środowisko, które pomaga pisarzom stworzyć pierwszy szkic, a następnie dopracować i edytować swoje arcydzieło.\n\n- NovProg — Narzędzie do tworzenia wykresów postępów w pisaniu powieści w stylu NaNoWriMo.\n\n- oStorybook — Narzędzie dla pisarzy, eseistów, autorów od szkicu do ostatecznego dzieła.\n\n"
    },
    {
      "title": "Scenariopisarstwo",
      "level": 3,
      "content": "- KIT Scenarist — Prosta i wydajna aplikacja do tworzenia scenariuszy.\n\n- Magic Fountain — Przeglądarka i edytor scenariuszy w składni Fountain.\n\n- Trelby — Prosty, szybki i elegancko rozplanowany w celu ułatwienia pisania scenariuszy.\n\n- Fade In — Fade In Professional Screenwriting Software to najbardziej zaawansowane oprogramowanie używane przez profesjonalistów piszących do filmów, telewizji, gier wideo, sceny, radia i nie tylko.\n\n"
    },
    {
      "title": "Słowniki i tezaurusy",
      "level": 3,
      "content": "Zobacz także Wikipedia:Category:Dictionary software i Wikipedia:DICT#DICT clients.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- dictd — Oprogramowanie klient/serwer dla protokołu DICT.\n\n- sdcv — Konsolowy słownik. Zapewnia dostęp do słowników w formacie StarDict.\n\n- thesauromatic — Statyczny offline'owy tezaurus napisany w języku Rust.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Artha — Angielski tezaurus, który działa całkowicie offline i jest oparty na WordNet.\n\n- Gjiten Kai — Przepisanie Gjiten, japońskiego słownika GTK.\n\n- GNOME Dictionary — Aplikacja GNOME do sprawdzania definicji i pisowni wyrazów w słowniku online. Część gnome-extra.\n\n- GoldenDict — Bogaty w funkcje program do wyszukiwania słowników.\n\n- Kiten — Narzędzie do nauki japońskiego. Część kde-education.\n\n- MATE Dictionary — Aplikacja MATE do wyszukiwania słów w źródłach słownikowych.\n\n- OpenDict — Słownik komputerowy, który obsługuje popularne formaty słowników komputerowych, w tym Slowo i Mova. Działa również jako klient dla serwerów DICT.\n\n- Palaura — Podręczny słownik umożliwiający znalezienie definicji dowolnego słowa.\n\n- PowerWord — Zastrzeżony słownik chińsko-angielski.\n\n- QStarDict — Program słownikowy napisany przy użyciu Qt. Interfejs użytkownika jest podobny do StarDict.\n\n- Quick Lookup — Prosta aplikacja słownika GTK oparta na Wiktionary.\n\n- StarDict — Oprogramowanie słownika międzynarodowego.\n\n- Xfce4 Dictionary — Przeszukuj różne rodzaje słowników w poszukiwaniu słów lub fraz.\n\n"
    },
    {
      "title": "Sprawdzanie pisowni",
      "level": 3,
      "content": "Zobacz Language checking.\n\n"
    },
    {
      "title": "Tłumaczenie",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of computer-assisted translation tools.\n\n- Apertium — Bezpłatna i otwarta platforma tłumaczenia maszynowego oparta na regułach z dostępnymi danymi językowymi. Obsługuje następujące formaty: HTML, Microsoft Office 2007 XML, OpenDocument, TMX, MediaWiki i inne.\n\n- Crow Translate — Prosty i lekki tłumacz, który umożliwia tłumaczenie i mówienie tekstu za pomocą Google, Yandex i Bing.\n\n- Dialect — Aplikacja do tłumaczenia dla środowiska GNOME oparta na Tłumaczu Google.\n\n- Gtranslator — Ulepszony edytor plików gettext po dla środowiska GNOME. Obsługuje wszystkie formy plików gettext po i zawiera bardzo przydatne funkcje.\n\n- Lokalize — Standardowe narzędzie KDE do tłumaczenia oprogramowania. Obejmuje podstawową edycję plików PO, obsługę glosariusza, pamięć tłumaczeń, zarządzanie projektami itp. Część kde-sdk\n\n- Moses — Statystyczne narzędzie do tłumaczenia maszynowego (dane językowe nie są dołączone).\n\n- OmegaT — Ogólne narzędzie tłumacza, które zawiera wiele funkcji pamięci tłumaczeniowej i może podawać sugestie z Tłumacza Google. Obsługuje następujące formaty: HTML, Microsoft Office 2007 XML, OpenDocument, XLIFF/Okapi, MediaWiki, zwykły tekst, TMX i inne.\n\n- Poedit — Prosty edytor tłumaczeń dla gettext (PO, POT) i XLIFF.\n\n- Pology — Zestaw narzędzi Pythona do obsługi plików gettext/po.\n\n- Qt Linguist — Tłumaczenie aplikacji Qt C++ i Qt Quick na lokalne języki.\n\n- Translate Shell — Interfejs wiersza poleceń i interaktywna powłoka dla Tłumacza Google.\n\n- Translate Toolkit — Zestaw narzędzi do lokalizacji i tłumaczenia, który zapewnia zestaw narzędzi do pracy z formatami plików lokalizacyjnych i plikami, które mogą wymagać lokalizacji.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 3,
      "content": "- barcode — Narzędzie do konwersji ciągów tekstowych na drukowane paski.\n\n- iec16022 — Tworzy kody kreskowe 2D, często określane również jako DataMatrix.\n\n- qrencode — Biblioteka C i narzędzie wiersza poleceń do kodowania danych w symbolu QR Code.\n\n- ZBar — Aplikacja i biblioteka do odczytu kodów kreskowych z różnych źródeł.\n\n- Zint — Biblioteka kodowania kodów kreskowych i narzędzie wiersza poleceń obsługujące ponad 50 symboli.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 3,
      "content": "- CoBang — Aplikacja do skanowania kodów QR.\n\n- gLabels — Program do tworzenia etykiet, wizytówek i okładek nośników.\n\n- QRab — Po prostu pobiera kod QR z ekranu i kopiuje zdekodowany tekst do schowka.\n\n- Qreator — Graficzne narzędzie do tworzenia kodów QR.\n\n- QtQR — Generator i dekoder kodów QR.\n\n- ZBarCam GUI — Prosty graficzny interfejs użytkownika dla ZBar do odczytu kodów kreskowych z różnych źródeł.\n\n- Zint Barcode Studio — Generator kodów kreskowych GUI.\n\n"
    },
    {
      "title": "Grafika tekstowa",
      "level": 2,
      "content": "Zobacz ASCII art#Software.\n\n"
    }
  ]
}