{
  "title": "List of Applications/Science (日本語)",
  "url": "https://wiki.archlinux.org/title/List_of_Applications/Science_(%E6%97%A5%E6%9C%AC%E8%AA%9E)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "インターネット – マルチメディア – ユーティリティ – ドキュメント – セキュリティ – サイエンス – その他\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 サイエンス 1.1 数学 1.1.1 電卓 1.1.1.1 Console 1.1.1.2 Graphical 1.1.2 数式処理システム 1.1.3 Visualization of networks/graphs 1.1.4 科学技術計算 1.1.5 統計学 1.1.6 データ評価とプロット 1.1.7 証明支援システム 1.2 物理学 1.2.1 物理シミュレーション 1.2.2 単位変換 1.3 化学 1.3.1 分子構造 1.3.1.1 ビューア 1.3.1.2 ドローイング 1.3.1.3 モデリング 1.3.2 周期表 1.4 地球科学 1.4.1 地理学 1.4.2 気象学 1.5 天文学 1.6 生物学 1.6.1 計算生物学とバイオインフォマティクス 1.6.2 Genealogy 1.6.3 画像処理 1.6.4 DICOM ビューアとボリュームレンダリング 1.7 工学 1.7.1 コンピュータ支援設計 1.7.2 電子工学 1.7.2.1 デジタル論理 1.7.2.2 HDL 1.7.2.3 MCU IDE とプログラマ 1.7.2.4 Electronic circuit simulation and schematic capture editing 1.7.2.5 Electronic design and schematic capture editing 1.8 遠距離通信 1.8.1 アマチュア無線 1.9 シミュレーションモデリング 1.10 計算機科学 1.10.1 人工知能 1.10.2 Photogrammetry\n\n- 1.1 数学 1.1.1 電卓 1.1.1.1 Console 1.1.1.2 Graphical 1.1.2 数式処理システム 1.1.3 Visualization of networks/graphs 1.1.4 科学技術計算 1.1.5 統計学 1.1.6 データ評価とプロット 1.1.7 証明支援システム\n- 1.2 物理学 1.2.1 物理シミュレーション 1.2.2 単位変換\n- 1.3 化学 1.3.1 分子構造 1.3.1.1 ビューア 1.3.1.2 ドローイング 1.3.1.3 モデリング 1.3.2 周期表\n- 1.4 地球科学 1.4.1 地理学 1.4.2 気象学\n- 1.5 天文学\n- 1.6 生物学 1.6.1 計算生物学とバイオインフォマティクス 1.6.2 Genealogy 1.6.3 画像処理 1.6.4 DICOM ビューアとボリュームレンダリング\n- 1.7 工学 1.7.1 コンピュータ支援設計 1.7.2 電子工学 1.7.2.1 デジタル論理 1.7.2.2 HDL 1.7.2.3 MCU IDE とプログラマ 1.7.2.4 Electronic circuit simulation and schematic capture editing 1.7.2.5 Electronic design and schematic capture editing\n- 1.8 遠距離通信 1.8.1 アマチュア無線\n- 1.9 シミュレーションモデリング\n- 1.10 計算機科学 1.10.1 人工知能 1.10.2 Photogrammetry\n\n- 1.1.1 電卓 1.1.1.1 Console 1.1.1.2 Graphical\n- 1.1.2 数式処理システム\n- 1.1.3 Visualization of networks/graphs\n- 1.1.4 科学技術計算\n- 1.1.5 統計学\n- 1.1.6 データ評価とプロット\n- 1.1.7 証明支援システム\n\n- 1.1.1.1 Console\n- 1.1.1.2 Graphical\n\n- 1.2.1 物理シミュレーション\n- 1.2.2 単位変換\n\n- 1.3.1 分子構造 1.3.1.1 ビューア 1.3.1.2 ドローイング 1.3.1.3 モデリング\n- 1.3.2 周期表\n\n- 1.3.1.1 ビューア\n- 1.3.1.2 ドローイング\n- 1.3.1.3 モデリング\n\n- 1.4.1 地理学\n- 1.4.2 気象学\n\n- 1.6.1 計算生物学とバイオインフォマティクス\n- 1.6.2 Genealogy\n- 1.6.3 画像処理\n- 1.6.4 DICOM ビューアとボリュームレンダリング\n\n- 1.7.1 コンピュータ支援設計\n- 1.7.2 電子工学 1.7.2.1 デジタル論理 1.7.2.2 HDL 1.7.2.3 MCU IDE とプログラマ 1.7.2.4 Electronic circuit simulation and schematic capture editing 1.7.2.5 Electronic design and schematic capture editing\n\n- 1.7.2.1 デジタル論理\n- 1.7.2.2 HDL\n- 1.7.2.3 MCU IDE とプログラマ\n- 1.7.2.4 Electronic circuit simulation and schematic capture editing\n- 1.7.2.5 Electronic design and schematic capture editing\n\n- 1.8.1 アマチュア無線\n\n- 1.10.1 人工知能\n- 1.10.2 Photogrammetry\n\n"
    },
    {
      "title": "電卓",
      "level": 4,
      "content": "See also Wikipedia:Comparison of software calculators.\n\n- bc — 任意精度計算言語。\n\n- calc — 任意精度計算コンソール。\n\n- clac — 後置記法のコマンドライン・スタックベース計算機。\n\n- qalc — Command-line calculator and equation solver with fault-tolerant parsing, constant recognition and units.\n\n- Deepin Calculator — Deepin デスクトップの使いやすい電卓\n\n- Extcalc — Qt ベースの科学用グラフィカル計算器。\n\n- FOX Calculator — シンプルなデスクトップ電卓。\n\n- galculator — GTK ベースの科学用電卓。\n\n- Genius — 数学的なプログラミング言語を備えた先進的な計算機。\n\n- GNOME Calculator — GNOME デスクトップの科学電卓。\n\n- KAlgebra — kde-education に含まれる計算器と 3D プロッタ。\n\n- KCalc — KDE デスクトップの科学電卓。\n\n- Liri Calculator — Liri の電卓。\n\n- MATE Calc — MATE デスクトップ環境の計算機。\n\n- Qalculate! — 電卓・方程式ソルバ。フォールトトレラントなパース、定数認識とユニット。\n\n- SpeedCrunch — 高速高精度でパワフルなクロスプラットフォームの計算器。\n\n- xcalc — 代数・逆ポーランド表記法モードを備えた X 用科学電卓。\n\n"
    },
    {
      "title": "数式処理システム",
      "level": 4,
      "content": "See also Wikipedia:ja:数式処理システムの一覧.\n\n- AXIOM — FriCAS: 強力な AXIOM-CAS の派生システム。\n\n- GAP — 群論計算に重点を置いた分散計算のための数式処理システム。\n\n- Maple — 有名な商用 CAS。主として教育で使われています。\n\n- Mathics — 記号数学計算用のフリーな CAS。主要な言語として Python を使用。Mathematica 互換の構文と機能を備えることを目指しています。ほとんどの処理は Sympy を使っており、より高度な機能を Sage で補っています。\n\n- Mathomatic — C で書かれた多目的の数式処理システム。\n\n- Maxima — Maple/Mathematica-ライクなプログラム。\n\n- PARI/GP — 整数論の高速計算のために作られた数式処理システム。\n\n- Singular — 可換・非可換環論・代数幾何学・特異点論に特に注力されている多項式計算の数式処理システム。\n\n- wxMaxima — 強力な数式処理システムである Maxima のグラフィカルユーザーインターフェイス。\n\n- Xcas — フリーの、基礎的な数式処理システムである、Giac のユーザーインターフェース。\n\n"
    },
    {
      "title": "Visualization of networks/graphs",
      "level": 4,
      "content": "- Graphia — Visualizes large graphs specified in various formats (including GML and GraphML) in 3D space in real time. See this issue on the Graphia Github for the Archlinux package dependencies of Graphia.\n\n- Graphviz — The established tool for displaying smallish graphs in 2D.\n\n"
    },
    {
      "title": "科学技術計算",
      "level": 4,
      "content": "See also Wikipedia:Comparison of numerical analysis software.\n\n- Cadabra — A field-theory motivated approach to computer algebra.\n\n- Cantor — KDE に統合されたワークシートインターフェイスから好きな数学アプリケーションを使うことができるアプリケーション。kde-education に含まれます。\n\n- EngLab — C ライクな構文を持ったクロスコンパイル数学プラットフォーム。\n\n- FFTW — 離散フーリエ変換を計算するための高速フーリエ変換ライブラリ。スペクトル法など幅広い数値計算に使われています。\n\n- FreeMat — Matlab-ライクなプログラム。(MPI による) 分散環境による並列計算の開発のサポート、C や C++、Fortran などのコードがいらないインターフェース、3D グラフィック機能など。\n\n- GeoGebra — インタラクティブなグラフィック・数式・スプレッドシートを備えた動的な数学ソフトウェア。\n\n- Julia — 技術計算のための高水準・高性能な動的言語。\n\n- Kig — インタラクティブ幾何学アプリケーション。kde-education に含まれています。\n\n- matplotlib (PyLab) — 科学計算用の Python モジュール (pyplot や numpy など) のコレクション。\n\n- Octave — 数値計算のための Matlab-ライクなプログラミング言語・インターフェース。\n\n- SageMath — Python で書かれた Maxima に似た数式処理システム。Magma, Maple, Mathematica, Matlab の代替。\n\n- Scilab — 数値計算に使われる Matlab 代替、構文は Matlab とは異なりますが、簡単に変換できます。\n\n"
    },
    {
      "title": "統計学",
      "level": 4,
      "content": "See also Wikipedia:Comparison of statistical packages.\n\n- gretl — A cross-platform software package for econometric analysis, written in the C programming language.\n\n- JAGS (Just another Gibbs sampler) — マルコフ連鎖モンテカルロ法 (MCMC) を使う階層ベイズモデルの分析のためのクロスプラットフォームプログラム。\n\n- jamovi — SPSS のユーザーが簡単に使えるように作られた統計パッケージ。Electron プラットフォームベース。\n\n- Python Data Analysis Library (pandas) — Python プログラミング言語による、高性能かつ使いやすい、データ解析ツール。\n\n- PSPP — フリーの SPSS 実装。\n\n- R — 統計計算とグラフのソフトウェア環境。\n\n- RKWard — 統計解析向けプログラミング言語 R のフロントエンド。\n\n- RStudio — Qt で書かれた R の強力で生産的な IDE。\n\n"
    },
    {
      "title": "データ評価とプロット",
      "level": 4,
      "content": "Wikipedia:ja:グラフ作成ソフトも参照。\n\n- AlphaPlot — Application for scientific data analysis and visualization, fork of SciDavis / QtiPlot.\n\n- Engauge Digitizer — グラフの画像からデータを抽出。\n\n- Fityk — 曲線あてはめ・データ解析アプリケーション。釣鐘型関数を実験データに当てるのによく使われます。\n\n- Gnuplot — 関数・データの 2D / 3D プロットを生成するコマンドラインプログラム。\n\n- Grace — WYSIWYG 2D グラフプロットツール。\n\n- KmPlot — グラフと積分・導関数を描画するプログラム。kde-education に含まれます。\n\n- LabPlot — SciDAVis に似たフリーのデータ解析・視覚化アプリケーション。\n\n- Plots — A graph plotting app for GNOME.\n\n- Rocs — グラフアルゴリズムを設計・解析するのに興味がある全ての人 (教師・学生・研究者) のためのグラフ理論 IDE。kde-education に含まれます。\n\n- ROOT — CERN によって開発されている（元は素粒子物理学用の）データ解析プログラム・ライブラリ。\n\nアプリケーション一覧#スプレッドシートも見てください。\n\n"
    },
    {
      "title": "証明支援システム",
      "level": 4,
      "content": "Wikipedia:Proof assistant も参照。\n\n- Agda — 依存型・関数型プログラミング言語・プルーフアシスタント。直感的に証明を書いてチェックできます。\n\n- Coq — 形式証明管理システム。数学主題と実行アルゴリズム、定理を記述するための形式言語を備えており、機械的に証明をチェックする半自動な開発環境を実現します。\n\n- Isabelle — 数学定理を形式言語で表現できる汎用の証明支援器。論理計算で定理を証明するためのツールを提供します。\n\n"
    },
    {
      "title": "物理シミュレーション",
      "level": 4,
      "content": "- Code_Aster — 土木工学や構造力学における有限要素解析 (FEA) や数値シミュレーションのためのソフトウェアパッケージ。\n\n- OpenFOAM — Software package and toolkit for computational fluid dynamics (CFD).\n\n- Calculix — A three-dimensional structural finite element program.\n\n- Elmer_FEM_solver — Finite element analysis (FEA/FEM) software for multiphysics problems. Includes models for fluid dynamics, structural mechanics, electromagnetics, heat transfer, and acoustics.\n\n- Netgen/NGSolve — A high performance multiphysics finite element software, with a flexible Python interface to implement new physical equations and solution algorithms easily.\n\n- ONELAB/Gmsh — An open-source, lightweight interface to finite element software, by default containing the mesh generator Gmsh, the finite element solver GetDP and the optimization library conveks.\n\n- FEniCS — An open-source computing platform for solving partial differential equations, enabling users to quickly translate scientific models into efficient finite element code with the high-level Python and C++ interfaces that scale across platforms ranging from laptops to high-performance clusters.\n\n- FEBio — An open-source software tool for nonlinear finite element analysis specifically focused on solving nonlinear large deformation problems in biomechanics and biophysics, able to solve problems in mixture mechanics (i.e. biphasic or multiphasic materials), fluid mechanics, reaction-diffusion, and heat transfer, including fluid-solid interactions.\n\n- EPANET — 配水管網における水の移動と水質に関する長期シミュレーションを行います。\n\n- Step — 二次元の物理シミュレーション。kde-education に含まれています。\n\n- SWMM — SWMM\n\n"
    },
    {
      "title": "単位変換",
      "level": 4,
      "content": "- ConvertAll — 意味がないものでも様々に単位を組み合わせられる (e.g. inches per decade) 単位変換アプリケーション。\n\n- Gonvert — 長さ、量、数など多くのカテゴリで CGS・帝国単位・古代単位など多くの単位系間で変換できる変換ユーティリティ。\n\n- Units — コマンドライン単位コンバーター・電卓。倍数的なスケール変化、ノンリニアな変換ができる。華氏を摂氏やゲージに変換する等。\n\n"
    },
    {
      "title": "分子構造",
      "level": 4,
      "content": "See also Wikipedia:List of molecular graphics systems.\n\n- Avogadro — 3D 分子構造のエディタ・ビューア・シミュレータ (蛋白質構造データバンクからのファイルのダウンロードもサポート)。\n\n- BALLView — スタンドアローンの分子モデリング・視覚化アプリケーション。BALL フレームワークの一部。\n\n- Ghemical — 分子構造を編集・回覧・シミュレートするために使われる計算化学ソフトウェアパッケージ。\n\n- PyMOL — オープンソースの分子視覚化システム。小さな分子や、タンパク質などの生体高分子の高品質な 3D イメージを作成できます。\n\n- VMD — 3D グラフィックと内蔵のスクリプトを使って巨大な生体分子を表示・アニメーション・解析する分子視覚化プログラム。\n\n- BKChem — 実践的な見かけの良い化学構造式の描写プログラム。\n\n- Chemtool — 化学構造式を描写するための GTK プログラム。\n\n- Gabedit — GAMESS, Gaussian, MOLCAS, MOLPRO, MPQC, OpenMopac, Firefly (旧名 PC GAMESS), Q-Chem などの計算化学パッケージのグラフィカルユーザーインターフェース。\n\n- APBS — 分子複合系の静電気・溶媒和の性質を解析。\n\n- CP2K — 量子化学と固体物理学のソフトウェアパッケージ。\n\n- Fpocket — ボロノイ分割に基づく非常に高速なオープンソースの蛋白質ポケット検知アルゴリズム。\n\n- GROMACS (GROningen MAchine for Chemical Simulations) — 分子動力学法を使うための多目的パッケージ。数百から数万原子（分子、粒子）の系の動きのニュートン方程式をシミュレートする。\n\n- AmberTools — 独立して開発されている複数のパッケージと Amber18 から構成されたスイート。完全な分子動力学シミュレーションを実行することができます。顕在水分子あるいは一般化ボルン溶媒モデルを使用。\n\n- NAMD — 巨大な生命分子系の高性能シミュレーションのために作られた並列分子動力学コード。\n\n- ORCA — 非経験的, DFT, 半経験的 SCF-MO パッケージ。\n\n- PDB2PQR — 分子複合系の静電気・溶媒和の性質を解析。\n\n- PMEMD — MBER ソフトウェアパッケージの PMEMD モジュール。\n\n- Quantum ESPRESSO — 電子状態計算とナノスケールの材料モデリングのアプリケーションの統合スイート。密度汎関数理論、平面波、擬ポテンシャル（ノルム保存/ウルトラソフト）に基づく。\n\n- smina — スコアリング・最小化が改善された Autodock Vina のフォーク。\n\n"
    },
    {
      "title": "周期表",
      "level": 4,
      "content": "- eperiodique — EFL を使用するシンプルな周期表ビューア。\n\n- gElemental — 付加情報が含まれている元素周期表。\n\n- Kalzium — 構造式エディタと方程式ソルバーの付いた元素周期表。Part of kde-education.\n\n"
    },
    {
      "title": "地理学",
      "level": 4,
      "content": "- BT747 — MTK GPS データロガーの万能ナイフ。\n\n- FoxtrotGPS — 軽量・高速なマッピングアプリケーション。\n\n- Gebabbel — GPSBabel の代替 GUI。\n\n- GeoDa — A tool for spatial data analysis.\n\n- GNOME Maps — GNOME のシンプルな地図クライアント。gnome-extra に含まれています。\n\n- Gpredict — リアルタイムの人工衛星トラッキング・軌道予測アプリケーション。\n\n- GPSBabel — GPS ウェイポイント・軌跡・ルートを様々なフォーマットで読み書き。\n\n- gpsd — シリアルまたは USB でホストコンピュータに接続された GPS や AIS 受信器を監視して、ホストコンピュータの TCP ポート 2947 からセンサーの位置・進路・速度データを利用できるようにするデーモン。\n\n- GpsPrune — GPS システムの位置データを表示・編集・変換。\n\n- GPXSee — GPS ログビューア・アナライザ。\n\n- GPX Viewer — gpx ファイルに保存された軌跡・ウェイポイントを視覚化するシンプルなツール。\n\n- GRASS GIS — 地理空間データ管理と解析・画像処理・地図生成・空間モデリングと視覚化。\n\n- gvSIG — あらゆる種類の地理情報を取得・保存・管理・解析・展開するためのデスクトップアプリケーションと地理情報システム (GIS) in order to solve complex management and planning problems.\n\n- JOSM — Java で書かれた OpenStreetMap エディタ。\n\n- Mapton — Java で書かれた拡張性の高いデスクトップ地図・地球儀アプリケーション。\n\n- Marble — 地球について学習できる仮想地球・世界地図。kde-education に含まれています。\n\n- Merkaartor — OpenStreetMap エディタ。\n\n- Navit — モジュール方式のターンバイターンカーナビゲーションシステム。\n\n- OffRoad — OsmAnd から移植されたオフラインベクター地図表示システム。\n\n- OpenOrienteering Mapper — オリエンテーリング地図制作プログラム。\n\n- QMapShack — 次回の野外旅行を計画しよう。\n\n- QGIS — ベクター・ラスター・データベース形式をサポートする地理情報システム (GIS)。\n\n- Subsurface — ダイブスポット (GPS 座標に基づく) と使用したウエイト・スーツ、ダイブマスターとバディを記録するダイビングログブック。\n\n- Viking — GPS データを管理するための GTK 2 アプリケーション。\n\n"
    },
    {
      "title": "気象学",
      "level": 4,
      "content": "- Gis Weather — カスタマイズ可能な天気予報デスクトップウィジェット。\n\n- GNOME Weather — あなたの住んでいる都市の天気を表示したりインターネットサービスの天気予報にアクセスできる GNOME 用の小さなアプリケーション。\n\n- meteo-qt — 天気情報を表示するシステムトレイアプリケーション。\n\n- wttr — https://wttr.in のデータを使って天気をチェックするシンプルなコンソールアプリケーション。\n\n- Xfce Weather Panel Plugin — Xfce4 パネルの天気予報プラグイン。\n\n- wego-darksky — A fork of the terminal weather app wego with Dark Sky support.\n\n"
    },
    {
      "title": "天文学",
      "level": 3,
      "content": "- Astropy — The Astropy Project is a community effort to develop a common core package for Astronomy in Python and foster an ecosystem of interoperable astronomy packages.\n\n- Celestia — 広大な宇宙を旅することができる 3D 天体シミュレーションプログラム。現実に即してモデリングされ、いかなる時間のいかなる場所も見ることができます。\n\n- GIMP Astronomy Plugins — 天体画像作成用の GIMP プラグインのセット。\n\n- GoQat — オートガイドやフォーカスヘルプなどの機能を持った、特に QSI カメラ用の、カメラキャプチャソフトウェア。\n\n- KStars — 地球上のどの場所でも、どの時刻でも、夜空の正確なグラフィカルシミュレーションができるプラネタリウムアプリケーション。KDE Edu に含まれています。\n\n- Qastrocam-g2 — 天文学のためのウェブカメラキャプチャソフトウェア。\n\n- Skychart / Cartes du Ciel — 星座・惑星などの望遠鏡で見れるほとんどの天体を図示・ラベリングするプラネタリウム。Digitized Sky Survey チャートやチャートのスーパーインポーズ画像のダウンロードもできます。\n\n- SPICE — A comprehensive toolkit and api to design, simulate and analyse space missions\n\n- StarPlot — 三次元星座ビューア。\n\n- Stellarium — リアルタイムのリアリスティックな空を描くことができる OpenGL を使っている美しい 3D プラネタリウム。\n\n- Where Is M13 — 星団や星雲の位置や物理的な特性を確認できるアプリケーション。\n\n- XEphem — Motif-ベースの天体歴・プラネタリウムプログラム。\n\n"
    },
    {
      "title": "計算生物学とバイオインフォマティクス",
      "level": 4,
      "content": "See also Wikipedia:List of open source bioinformatics software.\n\n- BALL (Biochemical Algorithms Library) — 分子力学法や高度な溶媒和メソッド、蛋白質構造の比較・分析のクラス、さらにデータ構造の広大なセットを提供する C++ のアプリケーションフレームワーク。ファイルのインポート・エクスポートやビジュアライゼーションも可能。\n\n- BioJava — 計算生物学や生物情報科学で使う Java ツールのセット。\n\n- Biopython — 計算生物学や生物情報科学で使う Python パッケージとツール。\n\n- EMBOSS (European Molecular Biology Open Software Suite) — 分子生物学やバイオインフォマティクスのコミュニティのために開発されたオープンソースの分析ソフトウェアパッケージ。\n\n- MUMmer — 接尾辞木を使った配列アライメント用のバイオインフォマティクスソフトウェアシステム。\n\n- Snapgene — クローズドソースの分子クローニングアプリケーション。素早く簡単に生体操作を計画・描画・文章化できます。Supports a wide range of cloning and PCR manipulations. フリー版では一般的な分子生物学のワークフローの視覚化ができます。\n\n- UGENE — よく使われている生物学ツールやアルゴリズムを統合したアプリケーション。グラフィカルユーザーインターフェースとコマンドラインを提供。\n\n"
    },
    {
      "title": "Genealogy",
      "level": 4,
      "content": "- Gramps — 家系図を見ることができる家系プログラム。\n\n- LifeLines — Text based genealogy software for family trees and reports.\n\n"
    },
    {
      "title": "画像処理",
      "level": 4,
      "content": "- ImageJ — プラグインやマクロによる拡張ができる Java ベースのイメージプロセシング・分析プログラム。顕微鏡検査で広く使われています (例: 細胞を数える)。\n\n- Fiji — 多くのプラグインがまとめられた ImageJ ディストリビューション (と ImageJ2)。\n\n"
    },
    {
      "title": "DICOM ビューアとボリュームレンダリング",
      "level": 4,
      "content": "- aeskulap — シンプルな DICOM データビューア。\n\n- weasis — モジュラー型の多目的 DICOM ビューア。\n\n- aliza — DICOM, MetaIO, Nifti, Nrrd 形式などの 2D, 3D, 4D 画像と DICOM, VTK, STL, OBJ 形式のメッシュを開きます。\n\n- 3DSlicer — 包括的な MRI, CT, LSCM 顕微鏡ボリューム処理・分割・3D 再構成。\n\n- ParaView — Interactive data visualization tool built using VTK that can scale across distributed computer hardware.\n\n"
    },
    {
      "title": "コンピュータ支援設計",
      "level": 4,
      "content": "See also Wikipedia:List of computer-aided design editors.\n\n- BRL-CAD — Constructive Solid Geometry (CSG) ソリッドモデリングコンピュータ支援設計 (CAD) システム。インタラクティブなジオメトリーエディタ、グラフィックレンダリングやジオメトリック分析に使えるレイトレーシング、分散ネットワークコンピューティングフレームバッファ、スクリプト、イメージプロセッシング・シグナルプロセッシングツール。\n\n- FreeCAD — OpenCascade ベースの CAD/CAE プログラム。マクロ記録、ワークベンチ、サーバー機能などを備えています。Qt と Python で開発。\n\n- LeoCAD — バーチャル LEGO モデルを作成するための CAD プログラム。使用しやすいインターフェースを持っており、現在、LDraw コミュニティによって作成された10,000以上の異なったピースを含んでいます。\n\n- LibreCAD — Qt5 を使ったパワフルな 2D CAD アプリケーション。QCad コミュニティエディションからフォークされて作られました。\n\n- OpenSCAD — プログラマー流によるオープンソースの 2D/3D CAD。\n\n- QCAD — 2D CAD アプリケーション。QCaD には標準の DXF ファイルフォーマットが含まれており HPGL フォーマットをサポートしています, and optionally the DWG format through a proprietary plugin.\n\n- SolveSpace — Powerful 3D CAD constraint-based parametric modeler with simple mechanical simulation capabilities.\n\n"
    },
    {
      "title": "電子工学",
      "level": 4,
      "content": "See also Wikipedia:Comparison of EDA software.\n\nデジタル論理ソフトウェアは主として、論理回路を設計・シミュレートするためのシンプルな教育ツールとして使われます。\n\n- Digital — Interactive simulator similiar to the discontinued Logisim. Features Karnaugh maps, logic tables, FSM editor, VHDL export and more, written in Java.\n\n- glogic — Python で書かれた教育用のグラフィカルな論理回路シミュレータ。\n\n- GTKWave — フル機能の GTK ベース波形ビューア。LXT, LXT2, VZT, FST, GHW ファイルや標準的な Verilog VCD/EVCD ファイルを読み込むことができます。\n\n- Logisim — 教育用の電子回路設計・シミュレーションプログラム。Java で書かれています。開発は停止中。\n\n- Logisim Evolution — オリジナルの Logisim に新しい機能を開発するプロジェクト。Java で書かれています。\n\n- PulseView — 論理アナライザ・オシロスコープ・MSO GUI。\n\n- SmartSim — シンプルで綺麗な電子論理回路設計・シミュレーションソフトウェア。教師と生徒を対象としており、軽量でクロスプラットフォーム、GPL でライセンスされています。Vala で書かれています。\n\n- WaveDrom editor — Timing diagram rendering in real-time from simple textual description. Can also be edited and embedded in the browser.\n\nAlso see Wikipedia:Hardware description language.\n\n- Gowin EDA Edu IDE — An IDE for Gowin's FGPA devices, including Sipeed Tang Nano and Sipeed Tang Nano 4K.\n\n- en:Intel Quartus Prime — Quartus Prime と ModelSim-Intel, HLS Compiler, etc を含む Intel の FPGA device の設計ツール。\n\n- Lattice Diamond — A set of design tools for Lattice's FPGA chips.\n\n- Microsemi Libero — Development tools for designing with Microsemi's PolarFire, IGLOO2, SmartFusion2, RTG4, SmartFusion, IGLOO, ProASIC3 and Fusion families.\n\n- Xilinx ISE WebPACK — FPGA プログラマブルロジックデザインスイート。\n\n- GHDL — Free and Open Source VHDL 2008/93/87 analyzer, compiler and simulator.\n\n- OpenFPGAloader — Universal utility for programming FPGA. Try openfpgaloader-gitAUR if your board isn't managed by the stable version.\n\n- Verilator — A Verilog/SystemVerilog simulator, performs lint code-quality checks, compile to threaded C++ code for simulation.\n\n- iverilog — Icarus Verilog compiler and simulation tool (slower but older than Verilator).\n\n- VTR — Verilog to Routing, Open Source CAD Flow for FPGA ResearchVerilog to Route.\n\n- Arduino — Arduino プロトタイピングプラットフォーム SDK。\n\n- avrcalc — Atmel AVR の開発を加速する計算機。\n\n- AVRDUDE — AVR マイクロコントローラの ROM や EEPROM の中身をダウンロード・アップデート・操作。\n\n- dfu-util — Device firmware update (DFU) USB programmer.\n\n- SPIPGM — パラレルポートケーブルで PC に接続されたシリアル SPI フラッシュ ROM メモリをプログラミングするためのツール。\n\n- esp-idf — Espressif IoT Development Framework. Official development framework for ESP32.\n\n- platformio — Collaborative platform for embedded development, embedded development, with debugger, unit testing, code analysis. Default IDE is VSCode, but can be used by Atom, Eclipse, Emacs Qt Creator, Vim and several other IDE. Core CLI utils.\n\n- easy_spice — Electronic circuit simulator. SPICE frontend, using gschem for schematics and ngspice as simulator.\n\n- eispice — Clone of the Berkley SPICE 3 Simulation Engine. It was originally targeted toward PCB level Signal Integrity Simulation; simulating IBIS model defined devices, transmission lines, and passive termination but the scope of the tool has been slowly expanding to include more general purpose circuit simulation features. Python interface.\n\n- gnucap — GNU circuit simulator.\n\n- gspiceui — GUI to various freely available Spice electronic ciruit simulators.\n\n- Oregano — 回路図入力や電子回路のシミュレーションに使うグラフィカルソフトウェアアプリケーション。シミュレーションは ngspice か Gnucap エンジンによって行われます。\n\n- ngspice — 回路のシミュレートに使用するアプリケーション。spice3f5 のオープンソース版後継。Has the most versatile user interface; supporting scripting within the circuit descriptions, use through an interpreter, as a C library, through tcl or various external wrappers (e.g., Python).\n\n- Qucs — 電子回路シミュレーションアプリケーション。グラフィカルユーザーインターフェースによる回路の設計と、大信号・小信号・ノイズの挙動をシミュレートができます。\n\n- qucs-s — Electronics circuit simulator that gives you the ability to set up a circuit with a GUI and simulate it. Fork of qucs that uses external, better, programs to do actual simulation.\n\n- Xyce — SANDIA Xyce is an open source, SPICE-compatible, high-performance analog circuit simulator, capable of solving extremely large circuit problems by supporting large-scale parallel computing platforms.\n\n- asco — SPICE Circuit Optimizer.\n\n- Fritzing — Easy to use program to draw good-looking circuit diagrams, and also create schematics and PCBs.\n\n- gEDA — 電子回路の設計や、回路図入力、シミュレーション、プロトタイピング、生産につかわれる電子設計自動化ツールのフルスイートとツールキット。\n\n- gEDA PCB — インタラクティブなプリント基板エディタ。\n\n- KiCAD — 電子回路の結線図の設計やプリント基板 (PCB) への実装を容易にする電子設計自動化のソフトウェアスイート。\n\n- QElectroTech — 高度な電子回路を設計するために使われるアプリケーション。\n\n"
    },
    {
      "title": "遠距離通信",
      "level": 3,
      "content": "- GNU Radio — ソフトウェア無線を実装するための信号処理ブロックを提供するソフトウェア開発ツールキット。\n\n- Gqrx — GNU Radio と Qt GUI ツールキットで実装されたソフトウェア無線レシーバ。\n\n- Pothos — 相互接続された信号ブロックのトポロジーを作成するための完全なデータフローフレームワーク。\n\n- SDR# — 人気の SDR プログラム。\n\n- SigDigger — Qt ベースのデジタル信号アナライザ。Suscan コアと Sigutils DSP ライブラリを使用。\n\n"
    },
    {
      "title": "アマチュア無線",
      "level": 4,
      "content": "メインの記事を見てください: アマチュア無線#ソフトウェアリスト。\n\nWikipedia:List of software-defined radios も参照。\n\n"
    },
    {
      "title": "シミュレーションモデリング",
      "level": 3,
      "content": "- Flight Gear — Open-source, multi-platform atmospheric and orbital flight simulator with a flight dynamics engine (JSBSim) that is part of a 2015 NASA benchmark to judge new simulation code to space industry standards.\n\n- gephi — Java で書かれたオープンソースのネットワーク解析・視覚化ソフトウェア。\n\n- golly — ライフゲーム (Conway's Game of Life) や他のセルオートマトンを探査するオープンソース・クロスプラットフォームアプリケーション。\n\n- Netlogo — マルチエージェントのプログラマブルモデリング環境。\n\n- AnyLogic — クロスプラットフォームのプロプライエタリマルチメソッドシミュレーションモデリングツール。個人利用も可能。\n\n"
    },
    {
      "title": "人工知能",
      "level": 4,
      "content": "Wikipedia:Comparison of deep learning software も参照。\n\n- Fast Artificial Neural Network — 順伝播型ニューラルネットワークを開発するためのライブラリ。\n\n- Mycroft — 音声認識を備えた知的パーソナルアシスタント・ナレッジナビゲータ。\n\n- Orange — ビジュアルプログラミングや Python で使えるデータ視覚化・機械学習・データマイニングツールキット。\n\n- Torch — 機械学習ライブラリ・科学計算フレームワーク・LuaJIT ベースのスクリプト言語。\n\n- X Neural Switcher — 自動 (知的) でキーボードレイアウトを修正。\n\n- Tensorflow — エンドツーエンドのオープンソース機械学習プラットフォーム。\n\n- PyTorch — 研究時のプロトタイピングから本番環境への実装を加速するオープンソース機械学習フレームワーク。\n\n- Theano — Theano is a Python library that allows you to define, optimize, and evaluate mathematical expressions involving multi-dimensional arrays efficiently.\n\n"
    },
    {
      "title": "Photogrammetry",
      "level": 4,
      "content": "See also Wikipedia:Comparison_of_photogrammetry_software.\n\n- OpenMVS — A software package.\n\n- OpenMVG — A software package.\n\n- AliceVision — A software package.\n\n"
    }
  ]
}