{
  "title": "List of applications (Español)/Security (Español)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Espa%C3%B1ol)/Security_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-06** \n\n"
    },
    {
      "title": "Seguridad",
      "level": 2,
      "content": "Para guías más detalladas, véase la página principal de ArchWiki, Seguridad.\n\n"
    },
    {
      "title": "Seguridad de la red",
      "level": 3,
      "content": "Vea también Wikipedia:Anexo:Comparativa de analizadores de paquetes\n\n- airgeddon — Script de bash multiuso para inspeccionar redes inalámbricas.\n\n- Arpwatch — Herramienta que controla la actividad Ethernet y mantiene una base de datos de emparejamiento de direcciones Ethernet/IP.\n\n- bettercap — La navaja suiza para ataques y monitoreo de redes.\n\n- darkstat — Captura el trafico de red, calcula estadísticas de uso, y entrega reportes a través de HTTP.\n\n- dsniff — Colección de herramientas para inspección de redes y pruebas de penetración.\n\n- EtherApe — Monitor de redes grafico para Unix modelado de etherman. Tiene modos de capa de enlace, IP y TCP. Muestra la actividad de red de manera grafica y los hosts y enlaces cambian de tamaño según el trafico. Muestra los protocolos codificados por color.\n\n- Ettercap — Sniffer/analizador/interceptor/registrador de red multipropósito.\n\n- GNOME Network Tools — Interfaz de GNOME para varias herramientas de red.\n\n- Honeyd — Herramienta que permite al usuario instalar y ejecutar múltiples máquinas virtuales en una red informática.\n\n- hping — Ensamblador/analizador de paquetes TCP/IP orientado para consolas.\n\n- IPTraf — Utilidad de monitorización de la red basada en consola.\n\n- jnettop — Visualizador de trafico de red parecido a top.\n\n- justniffer — Analizador de protocolos de red que captura el trafico de la red y produce registros de manera personalizada, puede emular los archivos de registro de un servidor Apache, rastrear los tiempos de respuesta y extraer todos los archivos «interceptados» en el trafico HTTP.\n\n- Kismet — Sistema de detección de redes, sniffing, y detección de intrusos para redes inalámbricas con el protocolo 802.11 (capa 2).\n\n- LinSSID — Escaneador de redes inalámbricas grafico.\n\n- Nemesis — Utilidad de creación e inyección de paquetes de red para consola.\n\n- Net Activity Viewer — Visor grafico de conexiones de red, es parecido en funcionalidad con Netstat.\n\n- netsniff-ng — Sniffer de red de alto rendimiento para inspección de paquetes para linux.\n\n- ngrep — Utilidad parecida a grep que permite buscar paquetes de red en una interfaz.\n\n- Nmap — Escáner de seguridad utilizado para descubrir los equipos y servicios en una red informática, creando así un «mapa» de la red.\n\n- Ntop — Sondeo de la red que muestra el uso de la red de una manera similar a lo que hace top para los procesos.\n\n- pyNeighborhood — Utilidad de navegación SMB/CIFS.\n\n- Smb4K — Navegador de vecindarios de redes avanzado y utilidad de montado de Samba share para KDE.\n\n- Snort — Sistema de detección y prevención de intrusos en la red.\n\n- Spectools — Un conjunto de utilidades para hardware analizador de espectro, incluidos los dispositivos Wi-Spy.\n\n- Sshguard — Demonio que protege SSH y otros servicios contra los ataques a fuerza bruta, es similar a Fail2ban.\n\n- Suricata — Motor de monitoreado de seguridad de redes, sistema de prevención y detección de intrusión de redes de alto rendimiento.\n\n- Tcpdump — Analizador de paquetes para consola común que permite el usuario mostrar e interceptar paquetes TCP/IP que están siendo transmitidos en una red.\n\n- vnStat — Monitor de tráfico de red basado en consola que mantiene un registro del tráfico de red para las interfaces seleccionadas.\n\n- What IP — Una pequeña aplicación en GTK para obtener información acerca de su IP.\n\n- Wireshark — Analizador de protocolos de red que le permite capturar y explorar interactivamente el tráfico que se ejecuta en una red informática.\n\n- Xplico — Herramienta de análisis forense de redes (HAFR, en inglés: NFAT) que permite reconstruir los contenido de los paquetes obtenidos con un sniffer.\n\n- Zeek — Marco de análisis de redes poderoso que es muy distinto a los sistemas de detección de intrusos que conoce.\n\n"
    },
    {
      "title": "Manejo del cortafuegos",
      "level": 3,
      "content": "Vea iptables (Español)#Frontend.\n\n"
    },
    {
      "title": "Detección de amenazas y vulnerabilidades",
      "level": 3,
      "content": "- AFICK — Herramienta de seguridad que permite monitorear cambios en sus sistemas de archivos, y por lo tanto, detectar intrusos.\n\n- Lynis — Herramienta de auditoria de seguridad y sistemas para reforzar sistemas Unix/Linux.\n\n- Metasploit Framework — Una plataforma avanzada y de código abierto para el desarrollo, prueba, y usado de código exploit.\n\n- Nessus — Programa de análisis integral de vulnerabilidades.\n\n- OpenVAS — Marco de varios servicios y herramientas que ofrecen una solución comprensible para escaneo y manejo de vulnerabilidades. Es una bifurcación libre y de código abierto (FOSS) de Nessus.\n\n- OSSEC — Sistema de detección de intrusos en hosts de código abierto que analiza registros, comprueba la integridad de los archivos, maneja las políticas, detecta rootkits, alerta en tiempo real y ofrece una respuesta activa.\n\n- Samhain — Sistema de detección de intrusos en hosts (SDIH) (en inglés: HIDS) que provee revisiones a la integridad de los archivos y monitoreo/análisis a los archivos de registro, también detección de rootkits, monitoreo de puertos, detección de ejecutables sospechosos con SUID y procesos ocultos.\n\n- Tiger — Herramienta de seguridad que puede ser usada tanto como un auditor de seguridad o como un sistema de detección de intrusos.\n\n- Tripwire — Sistema de detección de intrusos.\n\n"
    },
    {
      "title": "Seguridad de los archivos",
      "level": 3,
      "content": "- AIDE — Analizador de la integridad de archivos y directorios.\n\n- Logwatch — Sistema de análisis de registros personalizable.\n\n"
    },
    {
      "title": "Anti malware",
      "level": 3,
      "content": "- ClamAV — Motor de antivirus de código abierto para detectar troyanos, virus, malware y otras amenazas.\n\n- ClamTk — Frontend grafico para ClamAV que usa Perl y las librerías Gtk. Esta diseñado para ser escáner antivirus fácil de usar, ligero y bajo demanda.\n\n- Linux Malware Detect — Escáner de malware diseñado en contra de las amenazas encontradas en entornos de hosts compartidos.\n\n- Rootkit Hunter — Revisa la maquina buscando la presencia de rootkits y otras herramientas no deseadas.\n\n- Hostsblock — Un script que descarga, ordena, y compila varios archivos hosts anti anuncios y malware.\n\n"
    },
    {
      "title": "Aplicaciones para realizar copias de respaldo (backup)",
      "level": 3,
      "content": "Vea también Synchronization and backup programs#Incremental backups y Wikipedia:Comparison of backup software.\n\n- Déjà Dup — Aplicación para hacer copias de respaldo simple en GTK. Esconde la complejidad de hacer respaldos de la «manera correcta» (encriptado, protección con servidor aparte (off-site), y regular) y ocupa duplicity como motor.\n\n- borg — Programa para hacer copias de respaldo con deduplicación, compresión, y encriptación autenticada que soporta hacer respaldos a través de ssh.\n\n- Duplicati — Cliente que almacena de manera segura copias de respaldo encriptadas, comprimidas, y de manera incremental en servicios de almacenamiento en la nube y servidores de archivos remotos.\n\n- duplicity — Utilidad de consola simple que permite hacer copias de respaldo incrementales encriptadas y comprimidas en casi cualquier tipo de almacenamiento.\n\n- Duply — Interfaz por consola para duplicity que simplifica su ejecución. Maneja la configuración de los procesos de respaldo en perfiles y permite ejecutar comandos por lotes.\n\n- restic — Programa para hacer copias de respaldo rápido, seguro y eficiente que soporta hacer respaldos en varios servicios de la nube.\n\n- Tarsnap — Servicio de copias de respaldo propietario que es seguro y eficiente.\n\n"
    },
    {
      "title": "Aplicaciones para bloquear la pantalla",
      "level": 4,
      "content": "Vea también Session lock.\n\n- betterlockscreen — Wrapper de i3lock-color. Betterlockscreen le permite usar imágenes con distintos filtros como pantalla de bloqueo a una velocidad abrasadora.\n\n- Cinnamon Screensaver — Bloqueador de pantalla para el escritorio Cinnamon.\n\n- Deepin Screensaver — Un salvapantalla ligero basado en Qt5.\n\n- GNOME Screensaver — Bloqueador de pantalla para el escritorio GNOME Flashback.\n\n- i3lock — Un bloqueador de pantalla simple. Provee respuesta al usuario y utiliza autenticación PAM. El fondo puede ser establecido a una imagen o un color solido.\n\n- i3lock-blur — Bifurcación de i3lock que puede usar su escritorio con efecto de desenfoque como imagen de fondo.\n\n- i3lock-color — Bifurcación de i3lockcon soporte para colores y posicionamiento configurable y puede usar su escritorio con efecto de desenfoque como imagen de fondo.\n\n- Light-locker — Un bloqueador simple (bifurcado de gnome-screensaver) que tiene como objetivo tener opciones por defecto simples, cuerdas y seguras, también estar bien integrado con el escritorio sin tener alguna dependencia para escritorios específicos. Usa LightDM para bloquear y desbloquear su sesión a través de ConsoleKit/UPower o logind/systemd.\n\n- MATE Screensaver — Salvapantallas y bloqueador para el entorno de escritorio MATE.\n\n- physlock — .Bloqueador de pantalla y consola\n\n- sflock — Utilidad de bloqueo de pantalla simple para X, basado en slock. Proporciona una retroalimentación de los usuarios muy básica.\n\n- slock — Muy sencillo y ligero bloqueador de pantalla de X. Proporciona solo un fondo negro cuando está bloqueado, no hay animaciones o campos de texto.\n\n- tsscreenlock — Bloqueador de pantalla usado en theShell. Muestra los controles de música, y si se usa con theShell, también muestra las notificaciones de escritorio.\n\n- vlock — Bloqueador de TTY. Una replica del vlock original está disponible en github.\n\n- xfce4-screensaver — Un bloqueador y salvapantallas que tiene como objetivo tener opciones por defecto simples, cuerdas y seguras, y también estar bien integrado con el escritorio xfce.\n\n- xlockmore — Bloqueador de pantalla para X11 con soporte para PAM.\n\n- XScreenSaver — Bloqueador y salvapantallas para el sistema de ventanas X.\n\n- XSecureLock — Utilidad para bloquear la pantalla en X11 con el objetivo principal de ser seguro.\n\n- xtrlock — Bloqueador de pantalla muy ligero para X. Mantiene las ventanas visibles y muestra un candado en vez del cursor. Al escribir la contraseña y presionar intro se desbloquea la pantalla.\n\n"
    },
    {
      "title": "Auditoría de contraseñas",
      "level": 3,
      "content": "- John the Ripper — Descifrador de contraseñas.\n\n- Hashcat — Utilidad de recuperacion de contraseñas avanzada con capacidad multihilo.\n\n"
    },
    {
      "title": "Gestores de contraseñas",
      "level": 3,
      "content": "Vea también KeePass.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- gopass — Gestor de contraseñas avanzado para consola, soporta GnuPG y otros motores.\n\n- KeePassC — Gestor de contraseñas basado en Curses compatible con KeePass v.1.x.\n\n- LastPass — Gestor de contraseñas alojado.\n\n- pass — Gestor de contraseñas simple para consola que las organiza en archivo de texto plano con encriptación GnuPG.\n\n- pwsafe — Programa para consola de comandos de unix que maneja bases de datos de contraseñas encriptadas.\n\n- spm — Gestor de contraseñas simple escrito enteramente en POSIX shell usando PGP. Es rápido, ligero y fácilmente extensible.\n\n- tpm — Gestor de contraseñas pequeño, inspirado por pass, escrito completamente en POSIX shell.\n\n- Ylva — Gestor de contraseñas para consola de comandos, escrito en C, usa OpenSSL.\n\n"
    },
    {
      "title": "Gráficos",
      "level": 4,
      "content": "- Authenticator — Aplicación de autenticación en dos pasos hecha para GNOME.\n\n- Bitwarden — Gestor de contraseñas de código abierto con versiones para el escritorio, móvil, navegador y consola. Se puede usar autoalojado o en la nube.\n\n- Encryptr — Gestor de contraseñas basado en la nube de conocimiento cero.\n\n- Enpass — Gestor de contraseñas multiplataforma.\n\n- Figaro's Password Manager 2 — Versión en GTK2 del Figaro's Password Manager (Gestor de contraseñas de Figaro) con nuevos arreglos.\n\n- GNOME Password Safe — Gestor de contraseñas para GNOME que hace uso del formato de KeePass v.4.\n\n- Ked Password Manager — Un gestor de contraseñas que ayuda a manejar una gran cantidad de ellas.\n\n- KeePass Password Safe — Gestor de contraseñas basado en Mono, que le ayuda a manejar sus contraseñas de una manera segura.\n\n- KeePassX — Gestor de contraseñas basado en QT. Es compatible con KeePass v.1.x y KeePass v.2.x.\n\n- KeePassXC — Bifurcación comunitaria de KeePassX con un desarrollo más activo. Es compatible con KeePass v.1.x (solo para importar) y KeePass v.2.x.\n\n- KDE Wallet Manager — Herramienta para manejar las contraseñas de sistema. Al usar el subsistema de billetera de KDE, no solo le permite mantener sus propios secretos, si no también las contraseñas de cada aplicación que se integre a ella.\n\n- OTPClient — Software en GTK altamente seguro y fácil de usar para autenticación en dos pasos que soporta tanto contraseñas basadas en tiempo de un solo uso (TOTP en inglés) como contraseñas de un solo uso basadas en HMAC (HOTP en inglés).\n\n- Passbook — Gestor de contraseñas moderno para GNOME.\n\n- Password Gorilla — Un gestor de contraseñas multiplataforma.\n\n- Password Safe — Gestor de contraseñas simple y seguro.\n\n- QPass — Gestor de contraseñas fácil de usar y con un generador de contraseñas integrado.\n\n- QtPass — Interfaz grafica para pass, el gestor de contraseñas estándar para unix.\n\n- Revelation — Gestor de contraseñas para el escritorio GNOME.\n\n- Seahorse — Aplicación de GNOME para manejar claves de codificación y contraseñas en el llavero de GNOME.\n\n- Universal Password Manager — Le permite almacenar nombres de usuario, contraseñas, URLs y notas genéricas en una base de datos encriptada y protegida por una contraseña maestra.\n\n"
    },
    {
      "title": "Verificadores de hashes",
      "level": 4,
      "content": "- cfv — Utilidad pequeña para tanto crear como verificar archivos checksum, soporta archivos .sfv, .csv, .crc, .md5, md5sum, sha1sum, .torrent, par, y .par2.\n\n- GtkHash — Una utilidad en GTK para computar compendios o checksums\n\n- hashdeep — Herramientas multiplataforma para computar hashes, o compendios, para cualquier numero de archivos\n\n- Quick Hash GUI — Una interfaz grafica para permitir una rápida selección y subsecuente conversión a hash de los archivos (de manera individual o recursivamente en la estructura de una carpeta), textos o (en Linux) discos.\n\n- RHash — Utilidad para verificar sumas hash (SFV, CRC, etc.). Soporta varios algoritmos.\n\n- MassHash — Un conjunto de herramientas de cálculos de hashes (tanto para consola e interfaz grafica GTK) escritas en Python. Los algoritmos soportados incluyen MD5, SHA-1, SHA-224, SHA-256, SHA-384, SHA-512.\n\n- Parchive — Utilidad que crea y usa archivos PAR2 para detectar daños en archivos de datos y los repara si es necesario.\n\n"
    },
    {
      "title": "Encriptación, firmado, y esteganografía",
      "level": 4,
      "content": "- age — Una herramienta (y librería) de encriptado simple, moderna y segura con llaves pequeñas y explicitas, sin opciones de configuración, y una componibilidad al estilo UNIX.\n\n- ccrypt — Una utilidad para consola de comandos para encriptar y descifrar archivos y flujos de datos basada en Rijndael.\n\n- Enigmail — Una extensión de seguridad para Mozilla Thunderbird y Seamonkey. Le permite escribir y recibir correos firmados y/o encriptados con el estándar OpenPGP.\n\n- GNOME Keysign — Aplicación en GTK/GNOME para usar GnuPG para firmar las llaves de otras personas. Rápidamente, fácilmente y de manera segura.\n\n- GnuPG — La implementación completa y libre del proyecto GNU del estándar OpenPGP como la define RFC4880. Es un reemplazo completo y libre de PGP, mayormente usado para firmar paquetes de manera digital.\n\n- GPG-Crypter — Interfaz grafica para GnuPG(GPG) que usa el set de herramientas GTK3 y la librería GPGME.\n\n- Keybase — Directorio de llaves que mapea las identidades en las redes sociales con llaves, con chats encriptados multiplataforma, almacenamiento en la nube, y repositorios git.\n\n- KGpg — Interfaz simple para GnuPG, para KDE.\n\n- Kleopatra — Gestor de certificados e interfaz grafica para Unified Crypto para KDE. Soporta manejar certificados X.509 y OpenPGP en la caja de llaves de GpgSM y conseguir certificados desde servidores LDAP.\n\n- minisign — Programa simple que solo implementa firmado de llaves.\n\n- Seahorse — Aplicación de GNOME para manejar claves de encriptación y contraseñas en el llavero de GNOME.\n\n- scrypt — Utilidad de cifrado para consola de comandos con la función de derivación de llave scrypt protegida por memoria.\n\n- steghide — Una utilidad de esteganografía que es capaz de esconder datos en varios tipos de archivo de imagen y audio.\n\n"
    },
    {
      "title": "Cifrado de datos en reposo",
      "level": 4,
      "content": "Vea Cifrado de datos en reposo.\n\n"
    },
    {
      "title": "Elevación de privilegios",
      "level": 3,
      "content": "- doas — Una versión portable del comando doas de OpenBSD, conocido por ser sustancialmente más pequeño en tamaño que sudo.\n\n- su — Comando usado para asumir la identidad de otro usuario en el sistema.\n\n- sudo — Comando para delegar la habilidad de ejecutar comandos como root u otro usuario dejando un registro de lo hecho.\n\n"
    }
  ]
}