{
  "title": "List of applications/Internet (Español)",
  "url": "https://wiki.archlinux.org/title/List_of_applications/Internet_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **La traducción de este artículo o sección no refleja el texto original.** La traducción de este artículo o sección no refleja el texto original.\n\nLa traducción de este artículo o sección no refleja el texto original.\n\nNote: **2021-01-28** \n\n"
    },
    {
      "title": "Administradores de red",
      "level": 4,
      "content": "Véase también Network configuration (Español)#Gestores de red.\n\n"
    },
    {
      "title": "Clientes VPN",
      "level": 4,
      "content": "- Bitmask — Comunicación segura y cifrada utilizando varios proveedores de servicios.\n\n- Libreswan — Una implementación de software libre del protocolo VPN estandarizado más ampliamente compatible y basado en (\"IPsec\") y el Intercambio de Claves de Internet (\"IKE\").\n\n- NetworkManager — Soporta una variedad de protocolos (p.e. MS, Cisco, Fortinet) a través de un sistema de complementos.\n\n- OpenConnect — Soporta VPN de Cisco y Juniper.\n\n- Openswan — Solución VPN basada en IPsec.\n\n- OpenVPN — Para conectarse a VPNs de OpenVPN.\n\n- PPTP Client — Para conectarse a VPN PPTP, como Microsoft VPNs (MPPE). (inseguro)\n\n- strongSwan — Solución VPN basada en IPsec.\n\n- tinc — Un demonio VPN libre.\n\n- vopono — Wrapper OpenVPN y Wireguard para lanzar aplicaciones con túneles VPN en espacios de nombres de red.\n\n- Vpnc — Para conectarse a los concentradores VPN 3000 de Cisco.\n\n- WireGuard — Túnel de red seguro de próxima generación.\n\n"
    },
    {
      "title": "Servidores Proxy",
      "level": 4,
      "content": "- Dante — Servidor y cliente SOCKS, implementando RFC 1928 y estándares relacionados.\n\n- Privoxy — Proxy web sin almacenamiento en caché con capacidades de filtrado avanzadas para mejorar la privacidad, modificar los datos de la página web y los encabezados HTTP, controlar el acceso y eliminar anuncios y basura desagradable de Internet.\n\n- Project V — Conjunto de herramientas para ayudarlo a construir su propia red de privacidad a través de Internet.\n\n- Shadowsocks — Proxy socks5 seguro, diseñado para proteger su tráfico de Internet.\n\n- Squid — Proxy de almacenamiento en caché para la web que soporta HTTP, HTTPS, FTP y más.\n\n- Stunnel — Un servidor y un cliente para añadir y eliminar el cifrado TLS al flujo de datos TCP.\n\n- Tinyproxy — Demonio proxy ligero HTTP/HTTPS.\n\n- Trojan — Un mecanismo no identificable que le ayuda a evitar GFW.\n\n- Varnish — Acelerador HTTP de alto rendimiento.\n\n- XX-Net — Herramienta de proxy web fácil de utilizar.\n\n- Ziproxy — Servidor proxy HTTP de compresión de reenvío (sin almacenamiento en caché).\n\n"
    },
    {
      "title": "Redes de anonimato",
      "level": 4,
      "content": "- Freenet — Una red cifrada sin censura.\n\n- GNUnet — Framework para una red segura peer-to-peer.\n\n- I2P — Red anónima distribuida.\n\n- Lantern — Programa peer-to-peer de elusión de censura en internet.\n\n- Tor — Red de anonimato superpuesto.\n\n"
    },
    {
      "title": "Navegadores web",
      "level": 3,
      "content": "Véase también Wikipedia:Comparison of web browsers.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- browsh — Un navegador basado en texto completamente moderno. Se ejecuta como una interfaz para Firefox sin monitor.\n\n- ELinks — Navegador web avanzado y bien establecido de modo de texto rico en funciones con soporte de desplazamiento de la rueda del ratón (bifurcación de links).\n\n- Links — Navegador web en modo gráfico y texto. Incluye una versión de consola similar a Lynx.\n\n- Lynx — Navegador de texto para la World Wide Web.\n\n- w3m — Navegador web basado en texto/paginado. Tiene combinaciones de teclas tipo vim y es capaz de mostrar imágenes.\n\n"
    },
    {
      "title": "Gráfico",
      "level": 4,
      "content": "Véase también Wikipedia:es:Gecko (software).\n\n- Firefox — Navegador extensible de Mozilla basado en Gecko con renderizado rápido.\n\n- SeaMonkey — Continuación de Mozilla Internet Suite.\n\n- GNU IceCat — Una compilación personalizada de Firefox ESR distribuida por el Proyecto GNU, despojada de componentes no libres y con extensiones de privacidad adicionales. El ciclo de lanzamiento puede retrasarse en comparación con Mozilla Firefox.\n\n- LibreWolf — Una bifurcación de Firefox, centrada en la privacidad, la seguridad y la libertad.\n\n- Tor Browser Launcher — Descarga, comprueba, instala y ejecuta Tor Browser de forma segura y sencilla, una bifurcación de Firefox ESR.\n\n- Waterfox Classic — Bifurcación optimizada de Firefox 56, sin recopilación de datos y que permite extensiones sin firmar y complementos NPAPI.\n\n- Waterfox Current — Bifurcación optimizada de Firefox ESR, rama actualizada de Waterfox rica en funciones.\n\nVéase también Wikipedia:es:Blink.\n\n- Chromium — Navegador web desarrollado por Google, el proyecto de código abierto detrás de Google Chrome.\n\n- Brave — Navegador web que bloquea anuncios y rastreadores de forma predeterminada.\n\n- Iridium — Un conjunto de parches centrados en la privacidad para Chromium. Véase diferencias con Chromium.\n\n- Ungoogled Chromium — Modificaciones a Google Chromium para eliminar la integración de Google y mejorar la privacidad, el control y la transparencia.\n\n- Google Chrome — Navegador web propietario desarrollado por Google.\n\n- Opera — Navegador propietario desarrollado por Opera Software.\n\n- Slimjet — Navegador propietario rápido, inteligente y potente basado en Chromium.\n\n- Vivaldi — Un navegador propietario avanzado pensado para el usuario avanzado.\n\n- Yandex Browser — Navegador propietario que combina un diseño minimalista con tecnología sofisticada para hacer que la web sea más rápida, segura y fácil.\n\n- Crusta — Navegador web increíblemente rápido con funciones completas con funciones únicas.\n\n- Dooble — Colorido navegador web.\n\n- Eric — Navegador HTML basado en QtWebEngine, parte del conjunto de herramientas de desarrollo eric6, se puede iniciar con la orden eric6_browser.\n\n- Falkon — Navegador web basado en QtWebEngine, escrito en Qt Framework.\n\n- Konqueror — Navegador web basado en Qt toolkit y Qt WebEngine (o motor de diseño KHTML), parte de kde-network.\n\n- Liri Browser — Un navegador web Material Design minimalista escrito para Liri.\n\n- Otter Browser — Navegador con el objetivo de recrear la interfaz de usuario clásica de Opera (12.x) utilizando Qt5. Puede utilizar Qt WebEngine como un backend alternativo.\n\n- Qt WebBrowser — Navegador para dispositivos integrados desarrollado utilizando las capacidades de Qt y Qt WebEngine.\n\n- qutebrowser — Un navegador orientado al teclado, tipo vim basado en PyQt5 y QtWebEngine.\n\n- Beaker — Navegador web punto a punto con herramientas para crear y alojar sitios web. Basado en la platadorma Electron.\n\n- Ferdi — Electron application. Navegador de mensajería que le permite combinar sus servicios de mensajería favoritos en una sola aplicación. Se basa en Franz.\n\n- Franz — Electron application. Navegador de mensajería para WhatsApp, Facebook Messenger, Slack, Telegram y muchos otros servicios web.\n\n- Min — Un navegador web más inteligente y rápido basado en la plataforma Electron.\n\nVéase también Wikipedia:WebKit.\n\nLa mayoría de estos admiten el bloqueo de anuncios a través de wyebadblock.\n\n- Ephemeral — Un navegador privado de forma predeterminada y siempre de incógnito para elementary OS.\n\n- Eolie — Navegador web simple para GNOME.\n\n- GNOME Web — Navegador que utiliza el motor de renderizado WebKitGTK, parte de gnome.\n\n- Luakit — Framework de navegador rápido, pequeño y basado en webkit extensible por Lua.\n\n- Midori — Navegador web ligero basado en GTK y WebKit.\n\n- Nyxt — Navegador orientado al teclado, infinitamente extensible diseñado para usuarios avanzados. Tiene combinaciones de teclas familiares (Emacs, VI, CUA) y presenta búsquedas difusas entre pestañas, múltiples selecciones, historial como árbol y más.\n\n- surf — Navegador ligero basado en WebKit, que sigue la filosofía suckless (básicamente, el navegador en sí es un único archivo fuente C).\n\n- Surfer — Navegador web simple basado en teclado, escrito en C. Soporta JS-scripts personalizados.\n\n- Tangram — Integración de aplicaciones web en el escritorio, específico para GNOME.\n\n- Vimb — Un navegador web similar a Vim escrito en C que está inspirado en Pentadactyl y Vimprobable. Incluye una página de manual y un cómo (howto) para configuraciones comunes. Soporta scripts JS personalizados, modo oscuro y maneja solicitudes de geolocalización.\n\n- wyeb — Un navegador web tipo vim inspirado en dwb y luakit con Adblock.\n\n- OSPKit — Navegador html basado en webkit para imprimir.\n\n- Otter Browser — Navegador con el objetivo de recrear la interfaz de usuario clásica de Opera (12.x) utilizando Qt5.\n\n- qutebrowser — Un navegador guiado por teclado, tipo vim basado en PyQt5 con QtWebKit como backend disponible.\n\n- smtube — Aplicación que permite navegar, buscar y reproducir videos de YouTube.\n\n- WCGBrowser — Un navegador web para sistemas de kiosco.\n\n- Dillo — Pequeño y rápido navegador web gráfico basado en FLTK. Utiliza su propio motor de diseño.\n\n- Links — Navegador en modo gráfico y de texto. Incluye una versión gráfica de CSS de X-window/framebuffer, representación de imágenes, menús desplegables. Se puede lanzar con la orden xlinks -g.\n\n- NetSurf — Navegador de peso pluma escrito en C, notable por su lento desarrollo de compatibilidad con JavaScript y su rápido procesamiento a través de su propio motor de diseño.\n\n- Pale Moon — Una bifurcación de Firefox centrada en la velocidad, con una interfaz anterior a Firefox 29. Utiliza el motor de diseño Goanna, una bifurcación de Gecko. Los complementos de Firefox pueden no ser compatibles. Sin soporte para las nuevas funciones de Firefox como WebExtensions, cache2, e10s y OTMC. Muchas de las antiguas 93,598 versiones de 19,450 complementos de Firefox creados por 14,274 desarrolladores durante los últimos 15 años utilizando tecnología XUL/XPCOM en el archivo de complementos clásicos todavía funcionan.\n\n"
    },
    {
      "title": "Servidores Web",
      "level": 3,
      "content": "Un servidor web sirve páginas web HTML y otros archivos a través de HTTP a clientes como los navegadores web. Los principales servidores web pueden interactuar con programas para servir contenido dinámico (aplicaciones web).\n\nVéase también Category:Web server (Español) y Wikipedia:Comparison of web server software.\n\n- Apache — Un servidor HTTP de alto rendimiento basado en Unix.\n\n- Caddy — Servidor web HTTP/2 con HTTPS automático.\n\n- Hiawatha — Servidor web seguro y avanzado.\n\n- Lighttpd — Un servidor web seguro, rápido, compatible y muy flexible.\n\n- nginx — Servidor HTTP ligero y servidor proxy IMAP/POP3.\n\n- sthttpd — Bifurcación con soporte del servidor web thttpd.\n\n- yaws — Servidor web/framework escrito en Erlang.\n\n"
    },
    {
      "title": "Servidores web estáticos",
      "level": 4,
      "content": "- darkhttpd — Un servidor web estático pequeño y seguro, escrito en C, no es compatible con HTTPS o Auth.\n\n- quark — Un servidor web http get-only extremadamente pequeño y simple. Solo sirve páginas estáticas en un único host.\n\n- serve — Servicio de archivos estáticos y listado de directorios.\n\n- servy — Un diminuto servidor web, binario único, escrito en Rust.\n\n- Webfs — Servidor web simple e instantáneo para contenido mayormente estático.\n\nEl módulo de biblioteca estándar Python http.server también se puede utilizar desde la línea de órdenes.\n\n"
    },
    {
      "title": "Servidores web especializados",
      "level": 4,
      "content": "- chezdav — Servidor WebDAV que permite compartir un directorio en particular.\n\n- Mongoose — Biblioteca de servidor web integrada, compatible con WebSocket y MQTT.\n\n- OnionShare — Le permite enviar y recibir archivos de forma segura y anónima. Funciona iniciando un servidor web, haciéndolo accesible como un servicio de cebolla Tor y generando una dirección web imposible de adivinar para que otros puedan descargar o subirle archivos.\n\n- VServer — Aplicación GTK, que abre un servidor http en la carpeta seleccionada y comparte sus archivos.\n\n- webhook — Pequeño servidor para crear puntos finales HTTP (hooks).\n\n- Woof — Un servidor web ad-hoc de un solo archivo; ofrece un archivo web.\n\n"
    },
    {
      "title": "Servidores WSGI",
      "level": 4,
      "content": "- Gunicorn — Un servidor HTTP Python WSGI para UNIX.\n\n- uWSGI — Un servidor contenedor de aplicaciones rápido, de recuperación automática y amigable para el desarrollador/administrador escrito en C.\n\n- Waitress — Un servidor WSGI para Python 3.\n\nApache también es compatible con WSGI mediante mod_wsgi.\n\n"
    },
    {
      "title": "Pruebas de rendimiento",
      "level": 4,
      "content": "- http_load — Una herramienta de prueba de rendimiento del servidor web, se ejecuta en un solo proceso.\n\n- httperf — Puede generar varias cargas de trabajo HTTP, escrito en C.\n\n- siege — Una utilidad de evaluación rendimiento y pruebas de regresión HTTP.\n\n- vegeta — Herramienta de prueba de carga HTTP, escrita en Go.\n\n- Web Bench — Herramienta de evaluación comparativa, utiliza fork() para simular múltiples clientes.\n\n"
    },
    {
      "title": "Gestores de descargas",
      "level": 4,
      "content": "Véase también Wikipedia:Comparison of download managers.\n\n- aria2 — Utilidad de descarga ligera que admite HTTP/S, FTP, SFTP, BitTorrent y Metalink. Puede ejecutarse como un demonio controlado a través de un dispositivo mediante una interfaz JSON-RPC o XML-RPC.\n\n- Axel — Acelerador de descarga de línea de órdenes peso pluma que ocupa menos de 250kB en disco. Soporta HTTP/S y FTP.\n\n- cURL — Una utilidad y biblioteca de recuperación de URL. Soporta HTTP, FTP y SFTP.\n\n- HTTPie — Cliente HTTP de línea de órdenes amigable para humanos en la era de las API.\n\n- HTTrack — Una utilidad de navegador fuera de línea fácil de utilizar. Le permite descargar un sitio World Wide Web desde Internet a un directorio local, creando de forma recursiva todos los directorios, obteniendo HTML, imágenes y otros archivos del servidor a su computadora.\n\n- LFTP — Sofisticado programa de transferencia de archivos. Soporta HTTP, FTP, SFTP, FISH y BitTorrent.\n\n- mps-youtube — Jukebox YouTube basado en terminal con gestión de listas de reproducción. Reproduce audio/video a través de mplayer/mpv.\n\n- Plowshare — Un conjunto de herramientas de línea de órdenes diseñadas para administrar sitios web para compartir archivos (alias Hosters).\n\n- RTMPDump — Descarga vídeos FLV a través de RTMP (protocolo propietario de Adobe para reproductores de vídeo Flash).\n\n- snarf — Herramienta de recuperación de URL de línea de órdenes. Soporta HTTP y FTP.\n\n- Streamlink — Inicia transmisiones desde varios servicios de transmisión en un reproductor de vídeo personalizado o las almacena en un archivo.\n\n- Streamripper — Graba y divide la transmisión de mp3 en pistas.\n\n- You-Get — Descarga contenidos multimedia (vídeos, audios, imágenes) de la Web.\n\n- youtube-dl — Descarga vídeos de YouTube y muchos otros sitios web.\n\n- youtube-viewer — Utilidad de línea de órdenes para ver vídeos de YouTube.\n\n- Wget — Una utilidad de red para recuperar archivos de la Web. Soporta HTTP y FTP.\n\n- ClipGrab — Descargador y convertidor para YouTube, Vimeo y muchos otros sitios de video en línea.\n\n- FatRat — Administrador de descargas basado en Qt con soporte para HTTP, FTP, SFTP, BitTorrent y Metalin.\n\n- Forklift — GUI simple para youtube-dl utilizando PyGObject.\n\n- FreeRapid — Descargador basado en Java que soporta descargas desde servicios de intercambio de archivos.\n\n- gtk-youtube-viewer — Utilidad GTK para ver videos de YouTube.\n\n- Gwget — Gestor de descargas para GNOME. Soporta HTTP y FTP.\n\n- Gydl — GUI wrapper alrededor del programa ya existente youtube-dl para descargar contenido de sitios como YouTube.\n\n- JDownloader — Descargador basado en Java para sitios de alojamiento de un solo clic.\n\n- KGet — Gestor de descargas para KDE. Admite HTTP, FTP, BitTorrent y Metalink. Parte de kde-network.\n\n- Persepolis — Interfaz gráfica para el administrador de descargas aria2 con muchas características. Soporta HTTP y FTP.\n\n- pyLoad — Descargador escrito en Python y diseñado para ser extremadamente ligero, fácilmente extensible y totalmente manejable a través de la web.\n\n- Steadyflow — Administrador de descargas simple para GNOME. Soporta HTTP y FTP.\n\n- Streamtuner2 — Estación de radio por Internet y navegador de video. Simplemente enumera las estaciones en categorías de diferentes directorios y lanza sus aplicaciones multimedia preferidas para la reproducción.\n\n- uGet — Administrador de descargas GTK con clasificación de descargas e importación HTML. Soporta HTTP, FTP, BitTorrent, Metalink, YouTube y Mega.\n\n- Video Downloader — Aplicación GTK para descargar vídeos de sitios web como YouTube y muchos otros (basada en youtube-dl).\n\n- Xtreme Download Manager — Potente herramienta para aumentar la velocidad de descarga hasta un 500%. Soporta HTTP y FTP. El capturador de vídeo funciona de manera general y no se limita a ciertos sitios web.\n\n"
    },
    {
      "title": "Transferencia de archivos LAN",
      "level": 4,
      "content": "Véase también #Mensajeros LAN.\n\n- LAN Share — Aplicación de transferencia de archivos de red de área local multiplataforma, construida con el framework Qt GUI. Se puede utilizar para transferir una carpeta completa, uno o varios archivos, grandes o pequeños de forma inmediata sin ninguna configuración adicional.\n\n- NitroShare — Aplicación de transferencia de archivos de red multiplataforma, construida con el framework Qt GUI. Está diseñado para que la transferencia de archivos de un dispositivo a otro en la red local sea extremadamente simple.\n\n- Teleport — Aplicación nativa GTK3 para compartir archivos sin esfuerzo en la red local.\n\n- Warpinator — Aplicación GTK para compartir archivos en la LAN.\n\n"
    },
    {
      "title": "Servidores de almacenamiento en la nube",
      "level": 4,
      "content": "- Cozy — Una nube personal que puedes hackear, alojar y eliminar.\n\n- Nextcloud — Un servidor en la nube para almacenar sus archivos centralmente en un hardware controlado por usted.\n\n- Pydio — Aplicación web madura de código abierto para compartir y sincronizar archivos.\n\n- Seafile — Una herramienta de colaboración y almacenamiento de archivos en línea con soporte avanzado para sincronización de archivos, protección de la privacidad y trabajo en equipo.\n\n"
    },
    {
      "title": "Clientes de sincronización en la nube",
      "level": 4,
      "content": "- Algunos programas de sincronización y respaldo proporcionan soporte directo para algunos servicios de almacenamiento en la nube.\n- Algunos sistemas de arcgivos FUSE proporcionan una forma de montar el almacenamiento en la nube como un sistema de archivos. Se puede acceder a Google Drive también por gvfs-google para aplicaciones basadas en GVFS (como Nautilus), y por kio-gdrive para aplicaciones basadas en KIO (como Dolphin).\n- Véase optimizar el almacenamiento en la nube para lograr el almacenamiento de conocimiento cero (cifrado transparente del lado del cliente) en cualquier servicio en la nube de terceros.\n\n- CloudCross — Sincronice archivos y carpetas locales con muchos proveedores de la nube. Está disponible la compatibilidad con Mail.ru Cloud, Yandex Disk, Google Drive, OneDrive y Dropbox.\n\n- Rclone — Cliente de sincronización, copia y montaje de varios proveedores.\n\n- Rclone Browser — Cliente GUI para Rclone.\n\n- drive — Pequeño programa para extraer o insertar archivos de Google Drive.\n\n- DriveSync — Utilidad de línea de órdenes que sincroniza sus archivos de Google Drive con una carpeta local en su máquina.\n\n- gdrive — Utilidad de línea de órdenes para interactuar con Google Drive.\n\n- Grive — Cliente de Google Drive con soporte para la nueva API REST de Drive y sincronización parcial.\n\n- Insync — Cliente de escritorio de Google Drive no oficial y propietario.\n\n- ODrive — GUI de Google Drive basado en la plataforma Electron.\n\n- VGrive — Cliente GUI basado en GTK (back-end y front-end) para Google Drive hecho en Vala.\n\n- aws-cli — CLI para Amazon Web Services, incluidas transferencias de archivos eficientes hacia y desde Amazon S3.\n\n- Backblaze B2 — Cliente de línea de órdenes de código abierto Backblaze B2.\n\n- Baidu Netdisk — Servicio de almacenamiento en la nube lanzado por Baidu (anteriormente Baidu Cloud).\n\n- Cozy Drive — Cliente de escritorio para Cosy.\n\n- Dropbox — Cliente de escritorio propietario para Dropbox.\n\n- hubiC — Servicio de cliente de sincronización propietario y herramientas de línea de órdenes para hubiC.\n\n- Cliente de sincronización Mega — Cliente de escritorio propietario para sincronizar archivos con Mega.\n\n- Megatools — CLI no oficial para Mega.\n\n- Cliente Nextcloud — Cliente de escritorio para Nextcloud.\n\n- Nutstore — Cliente de escritorio propietario para Nutstore.\n\n- OneDrive — CLI no oficial para OneDrive.\n\n- Cliente de escritorio ownCloud — Cliente de sincronización de escritorio para ownCloud.\n\n- pCloud Drive — Cliente propietario de sincronización de escritorio para pCloud. Basado en la plataforma Electron.\n\n- PydioSync — Cliente de escritorio para Pydio.\n\n- S3cmd — CLI no oficial para Amazon S3.\n\n- Cliente Seafile — Interfaz cliente para Seafile.\n\n- SpiderOak One — Cliente propietario para SpiderOak One.\n\n- Tresorit — Cliente propietario de sincronización de escritorio para Tresorit.\n\n- Yandex Disk — CLI propietario para Yandex Disk.\n\n"
    },
    {
      "title": "FTP",
      "level": 4,
      "content": "Véase también Wikipedia:Comparison of FTP client software.\n\n- FileZilla — Cliente FTP, FTPS y SFTP rápido y confiable.\n\n- gFTP — Cliente FTP multiproceso para Linux.\n\n- ftp — Cliente ftp simple proporcionado por GNU Inetutils.\n\n- ncftp — Un conjunto de programas de aplicación libres que implementan FTP.\n\n- tnftp — Cliente FTP con varias funciones avanzadas para NetBSD.\n\nAlgunos gestores de archivos como Dolphin, GNOME Files y Thunar también proporciona funcionalidad FTP.\n\nVéase también Wikipedia:List of FTP server software.\n\n- bftpd — Pequeño servidor FTP fácil de configurar.\n\n- ftpd — Servidor ftp simple proporcionado por GNU Inetutils.\n\n- proFTPd — Un servidor FTP seguro y configurable.\n\n- Pure-FTPd — Servidor FTP libre (con licencia BSD), seguro, con calidad de producción y compatible con el estándar.\n\n- SSH — SFTP es un protocolo de red que proporciona acceso a archivos, transferencia de archivos y gestión de archivos a través de cualquier flujo de datos confiable.\n\n- vsftpd — Servidor FTP ligero, estable y seguro para sistemas tipo UNIX.\n\n"
    },
    {
      "title": "Clientes BitTorrent",
      "level": 4,
      "content": "Algunos gestores de descargas también pueden conectarse a la red BitTorrent: Aria2, LFTP, FatRat, KGet, MLDonkey, uGet.\n\nVéase también Wikipedia:es:Anexo:Comparativa de clientes BitTorrent.\n\n- Ctorrent — CTorrent es un cliente BitTorrent implementado en C++ para ser ligero y rápido.\n\n- peerflix — Cliente torrent de streaming para node.js.\n\n- rTorrent — Cliente BitTorrent ncurses simple y ligero. Requiere el backend libtorrent.\n\n- Transmission CLI — Cliente BitTorrent simple y fácil de utilizar con una versión demonio y múltiples interfaces. Este paquete incluye backend, demonio, interfaz de línea de órdenes e interfaz web.\n\n- Deluge — Cliente BitTorrent fácil de usar escrito en Python usando GTK que puede ejecutarse como un demonio.\n\n- Fragments — Cliente BitTorrent fácil de usar que sigue a GNOME HIG e incluye características bien pensadas.\n\n- FrostWire — Descargas en la nube, cliente BitTorrent y reproductor multimedia fáciles de utilizar.\n\n- Ktorrent — Cliente BitTorrent rico en funciones para KDE.\n\n- Powder Player — Híbrido entre un cliente BitTorrent de transmisión y un reproductor. Basado en la plataforma Electron.\n\n- qBittorrent — Cliente de BitTorrent con un motor de búsqueda de torrents integrado de código abierto (GPLv2) que se parece mucho a µtorrent.\n\n- Tixati — Programa propietario de intercambio de archivos punto-a-punto que utiliza el popular protocolo BitTorrent.\n\n- Torrential — Cliente torrent simple para elementary OS.\n\n- Transmission — Cliente BitTorrent simple y fácil de usar con una versión de demonio y múltiples interfaces.\n\n- Transmission Remote — Cliente GTK para la gestión remota del cliente de BitTorrent Transmission, utilizando su protocolo HTTP RPC.\n\n- Tremotesf — Cliente Qt para la gestión remota del cliente Transmission BitTorrent, utilizando su protocolo HTTP RPC.\n\n- Tribler — Cliente de BitTorrent del sistema de intercambio de archivos de cuarta generación.\n\n- Vuze — Cliente BitTorrent rico en funciones escrito en Java (antes Azureus).\n\n- WebTorrent Desktop — Aplicación Streaming BitTorrent. Basado en la plataforma Electron.\n\n"
    },
    {
      "title": "Otras redes P2P",
      "level": 4,
      "content": "Véase también Wikipedia:es:Anexo:Comparativa de clientes peer-to-peer.\n\n- aMule — Conocido cliente de eDonkey/Kad con una versión de demonio e interfaces GTK, web y CLI.\n\n- EiskaltDC++ — Ciente de conexión directa y ADC.\n\n- gtk-gnutella — Servidor/cliente GTK para la red punto-a-punto Gnutella.\n\n- KaMule — Interfaz gráfica de KDE para aMule.\n\n- LBRY — Navegador y cartera para LBRY, el mercado de contenido descentralizado y controlado por el usuario. Basado en la plataforma Electron.\n\n- lbt — Pequeño conjunto de herramientas de línea de órdenes para LBRY.\n\n- MLDonkey — Cliente P2P multiprotocolo que soporta HTTP, FTP, BitTorrent, Direct Connect, eDonkey y FastTrack.\n\n- ncdc — Cliente de conexión directa y ADC moderno y liviano con una interfaz ncurses amigable.\n\n- Nicotine+ — Un cliente gráfico para la red P2P Soulseek.\n\n- Send Anywhere — Servicio de intercambio de archivos propietario donde los usuarios pueden compartir contenido digital directamente en tiempo real. Basado en la plataforma Electron.\n\n"
    },
    {
      "title": "Clientes Pastebin",
      "level": 4,
      "content": "Véase también Wikipedia:es:Pastebin.\n\nLos servicios de Pastebin a menudo se usan para citar texto o imágenes mientras colaboran y solucionan problemas. Los clientes de Pastebin proporcionan una forma conveniente de publicar desde la línea de órdenes.\n\n```\norden |& curl -F 'f:1=<-' ix.io\n```\n\n```\ncurl -F 'f:1=<-' ix.io < archivo\n```\n\n- Elmer — Cliente Pastebin similar a wgetpaste y curlpaste, excepto que está escrito en Perl y se puede usar con wget o curl. Servidores: codepad.org, rafb.me, sprunge.us[enlace roto 2024-07-30].\n\n- Fb-client — Cliente para el pastebin paste.xinu.at.\n\n- Gist — Interfaz de línea de órdenes para el servicio pastebin gist.github.com.\n\n- imgur — Un cliente CLI que puede cargar imágenes al servicio de intercambio de imágenes imgur.com.\n\n- Ix — Cliente para el pastebin ix.io.\n\n- Pastebinit — Script Python realmente pequeño que actúa como un cliente Pastebin. Servidores: pastie.org, paste.kde.org, paste.debian.net, paste.ubuntu.com y otros (para una lista completa véase pastebinit -l).\n\n- ruby-haste — Cliente para hastebin.com.\n\n- Uppity — El cliente pastebin con actitud.\n\n- Wgetpaste — Script de bash que automatiza el pegado a varios servicios de pastebin. Servidores: pastebin.ca[enlace roto 2022-09-20], codepad.org, dpaste.com and pastebin.osuosl.org.\n\n"
    },
    {
      "title": "Clientes de correo",
      "level": 4,
      "content": "Véase también Wikipedia:Comparison of email clients\n\n- aerc — Trabajo en progreso de cliente de correo asíncrono.\n\n- alot — Un terminal experimental MUA basado en notmuch mail. Está escrito en python usando el kit de herramientas urwid.\n\n- Alpine — Cliente de correo electrónico rápido, fácil de usar y con licencia de Apache basado en Pine.\n\n- S-nail — Un sistema de procesamiento de correo con una sintaxis de órdenes que recuerda a ed con líneas reemplazadas por mensajes. Proporciona la funcionalidad de mailx.\n\n- mu/mu4e — Indizador de correo electrónico (mu) y cliente para emacs (mu4e). Basado en Xapian para búsquedas rápidas.\n\n- Mutt — Pequeño pero muy poderoso cliente de correo basado en texto.\n\n- NeoMutt — Lector de correo de línea de órdenes (o MUA). Es una bifurcación de Mutt con características adicionales.\n\n- nmh — Un sistema modular de gestión de correo.\n\n- notmuch — Un indexador de correo rápido construido sobre xapian.\n\n- sendemail — Un cliente de correo electrónico SMTP de línea de órdenes ligero escrito en Perl.\n\n- Sup — Cliente de correo CLI con búsqueda muy rápida, etiquetado, subprocesamiento y operación similar a GMail.\n\n- swaks — SMTP Swiss Army Knife; Probador SMTP de línea de órdenes, incluye TLS y AUTH, se puede utilizar para enviar correos electrónicos.\n\n- Wanderlust — Cliente de correo electrónico y lector de noticias para Emacs.\n\n- Balsa — Cliente de correo electrónico simple y ligero para GNOME.\n\n- Claws Mail — Cliente de correo electrónico y lector de noticias ligero basado en GTK.\n\n- ElectronMail — Aplicación de escritorio no oficial para varios proveedores de correo electrónico cifrado de extremo a extremo (como ProtonMail, Tutanota). Basado en la plataforma Electron.\n\n- Evolution — Cliente de correo electrónico maduro y rico en funciones que forma parte del proyecto GNOME. Parte de gnome-extra.\n\n- Geary — Cliente de correo de escritorio simple integrado con Vala.\n\n- Kmail — Cliente de correo electrónico maduro y rico en funciones. Parte de kde-pim.\n\n- Kube — Cliente moderno de comunicación y colaboración creado con QtQuick.\n\n- Mailspring — Bifurcación propietaria de Nylas Mail por uno de los autores originales.\n\n- Nylas Mail — Aplicación de correo de escritorio extensible. Basado en la plataforma Electron.\n\n- openWMail — El cliente de escritorio que falta para Gmail y Google Inbox. Basado en la plataforma Electron.\n\n- SeaMonkey Mail & Newsgroups — Cliente de correo electrónico incluido en la suite SeaMonkey.\n\n- Sylpheed — Cliente de correo electrónico GTK ligero y fácil de usar.\n\n- Thunderbird — Cliente de correo electrónico rico en funciones de Mozilla escrito en GTK.\n\n- Trojitá — Cliente de correo electrónico Qt IMAP. Solo soporta una cuenta IMAP.\n\n- Nextcloud Mail — Una aplicación web de correo electrónico para NextCloud.\n\n- Roundcubemail — Aplicación web multilingüe de cliente IMAP basada en navegador con una interfaz de usuario nativa similar a una aplicación.\n\n- SquirrelMail — ¡Webmail de narices!\n\n"
    },
    {
      "title": "Notificadores de correo",
      "level": 4,
      "content": "- Ayatana Webmail — Notificaciones y acciones de correo web para cualquier escritorio.\n\n- Bubblemail — Servicio de notificación de correo nuevo y no leído para buzones de correo locales, cuentas en línea pop, imap y gnome. Una bifurcación de Mailnag.\n\n- CheckMails — Comprobador de correo no leído de la bandeja del sistema mediante protocolo IMAP.\n\n- Gnubiff — Programa de notificación por correo que comprueba el correo y muestra los encabezados cuando llega un nuevo correo.\n\n- Mailnag — Demonio extensible de notificación de correo.\n\n- QGmailNotifier — Notificador Gmail basado en Qt5.\n\n"
    },
    {
      "title": "Servidores de correo",
      "level": 4,
      "content": "Véase servidor de correo.\n\n- DavMail — Puerta de enlace de intercambio POP/IMAP/SMTP/Caldav/Carddav/LDAP que permite a los usuarios utilizar cualquier cliente de correo/calendario con un servidor Exchange.\n\n- Modoboa — Una plataforma modular de alojamiento y gestión de correo, escrita en Python.\n\n"
    },
    {
      "title": "Agentes de recuperación de correo",
      "level": 4,
      "content": "Véase también Wikipedia:es:Mail retrieval agent.\n\n- fdm — Programa para buscar y entregar correo.\n\n- Fetchmail — Una utilidad de recuperación de correo remoto.\n\n- getmail — Un recuperador de correo POP3/IMAP4 con Maildir confiable y entrega de órdenes.\n\n- hydroxide — Un puente para terceros ProtonMail CardDAV, IMAP y SMTP de código abierto.\n\n- imapsync — Herramienta de migración, copia o sincronización IMAP.\n\n- isync — Sincronizador de buzones IMAP y MailDir.\n\n- mpop — Un cliente POP3 pequeño y rápido adecuado como reemplazo de fetchmail.\n\n- OfflineIMAP — Sincroniza correos electrónicos entre dos repositorios.\n\n"
    },
    {
      "title": "Clientes de mensajería instantánea",
      "level": 4,
      "content": "Véase también Wikipedia:es:Anexo:Comparación de clientes de mensajería instantánea y Wikipedia:Comparison of VoIP software.\n\nEsta sección enumera todo el software de cliente con soporte de mensajería instantánea.\n\nEl número de redes compatibles con estos clientes es muy grande, pero ellos (como cualquier cliente multiprotocolo) generalmente tienen un soporte muy limitado o nulo para funciones específicas de la red.\n\n- BarnOwl — Cliente de charla basado en Ncurses con soporte para los protocolos Zephyr, XMPP, IRC y Twitter.\n\n- BitlBee — Puerta de enlace IRC a redes de charla populares (XMPP, ICQ y Twitter).\n\n- EKG2 — Cliente XMPP, Gadu-Gadu, ICQ e IRC basado en Ncurses.\n\n- Finch — Cliente de charla basado en Ncurses que usa libpurple y soporta todos sus protocolos (Bonjour, Gadu-Gadu, Groupwise, ICQ, IRC, SIMPLE, XMPP, Zephyr).\n\n- WeeChat — Cliente IRC modular y ligero basado en ncurses. Soporta variedad de otros protocolos a través de complementos.\n\n- Jitsi — Teléfono VoIP de audio/vídeo y mensajería instantánea escrita en Java que admite protocolos como SIP, XMPP, ICQ, IRC y muchas otras características útiles.\n\n- Kopete — Mensajería instantánea fácil de usar que admite Bonjour, Gadu-Gadu, GroupWise, ICQ y XMPP.\n\n- Pidgin — Cliente de mensajería instantánea multiprotocolo con soporte de audio que utiliza libpurple y soporta todos sus protocolos (Bonjour, Gadu-Gadu, Groupwise, ICQ, IRC, SIMPLE, XMPP, Zephyr).\n\n- qutIM — Mensajería instantánea simple y fácil de usar que soporta mensajes ICQ, XMPP, Mail.Ru, IRC y VKontakte.\n\n- Smuxi — Cliente IRC multiplataforma que también soporta Twitter y XMPP.\n\n- Thunderbird — El cliente de correo electrónico rico en funciones que soporta mensajería instantánea y charla usando IRC y XMPP.\n\n- Volt — Cliente de escritorio nativo propietario para Skype, Telegram, Slack, XMPP, Discord, IRC y más.\n\nVéase también Wikipedia:Comparison of Internet Relay Chat clients.\n\n- BitchX — Cliente IRC basado en consola desarrollado a partir del popular ircII.\n\n- ERC — Cliente IRC potente, modular y extensible para Emacs.\n\n- ii — Cliente IRC de peso pluma, literalmente hace un tail -f de la conversación y echo de sus respuestas a un archivo.\n\n- ircii — El cliente de IRC más antiguo mantenido que afirma ser pequeño y rápido debido a su conjunto reducido de funciones.\n\n- Irssi — Cliente IRC basado en ncurses altamente configurable.\n\n- pork — Cliente IRC programable, basado en ncurses que se ve y se siente principalmente como ircII.\n\n- ScrollZ — Cliente avanzado de IRC basado en ircII.\n\n- sic — Cliente IRC extremadamente simple, similar a ii.\n\n- tiny — Un cliente IRC escrito en Rust con una interfaz sin líos.\n\nComparación\n\nTable content:\nNombre | Paquete | Escrito en | Extensible | SASL\nBitchX | bitchx-gitAUR | C | ? | ?\nERC | emacs | ELisp | en ELisp | vía script\nii | iiAUR | C | stdin/stdout | No\nIrssi | irssi | C | en Perl | Sí\npork | pork | C | en Perl | No\nScrollZ | scrollzAUR | C | ? | No\nsic | sicAUR | C | stdin/stdout | No\ntiny | tiny-irc-client-gitAUR[enlace roto: package not found] | Rust | No | Sí\nWeeChat | weechat | C | varios lenguajes | Sí\n\n- HexChat — Bifurcación de XChat para Linux y Windows.\n\n- Konversation — Cliente IRC basado en Qt para el escritorio KDE.\n\n- KVIrc — Cliente IRC basado en Qt con amplio soporte de temas.\n\n- Loqui — Cliente de IRC en GTK.\n\n- LostIRC — Cliente simple de IRC en GTK con autocompletado mediante tabulador, soporte para múltiples servidores, registro y otros.\n\n- Polari — Cliente IRC simple del proyecto GNOME.\n\n- Quassel — Cliente IRC moderno, multiplataforma y distribuido.\n\n- Srain — Moderno y hermoso cliente IRC escrito en GTK 3.\n\nVéase también Wikipedia:es:Extensible Messaging and Presence Protocol y Wikipedia:Comparison of instant messaging clients#XMPP-related features.\n\n- Freetalk — Cliente XMPP basado en consola.\n\n- jabber.el — Cliente XMPP mínimo para Emacs.\n\n- MCabber — Pequeño cliente de consola XMPP, incluye características: SSL, PGP, MUC, OTR y UTF8.\n\n- Poezio — Cliente XMPP con sensación de IRC.\n\n- Profanity — Un cliente XMPP basado en consola inspirado en Irssi.\n\n- Cagou (Salut à Toi) — nterfaz de escritorio/móvil para Salut à Toi, cliente XMPP multipropósito.\n\n- Converse.js — Cliente de charla XMPP basado en web escrito en JavaScript.\n\n- Dino — Un cliente XMPP moderno y fácil de usar, con soporte para PGP y OMEMO.\n\n- Gajim — Cliente XMPP con soporte de audio escrito en Python utilizando GTK.\n\n- Kaidan — Un cliente Jabber/XMPP simple y fácil de utilizar que proporciona una interfaz de usuario moderna mediante Kirigami y QtQuick.\n\n- Kadu — Cliente XMPP y Gadu-Gadu basado en Qt.\n\n- Libervia (Salut à Toi) — Interfaz web para Salut à Toi, cliente XMPP multipropósito.\n\n- Nextcloud JavaScript XMPP Client — Aplicación de chat para Nextcloud con XMPP, cifrado de extremo a extremo, videollamadas, transferencia de archivos y charla grupal.\n\n- Psi — Cliente XMPP basado en Qt.\n\n- Spark — Cliente de colaboración XMPP en tiempo real multiplataforma optimizado para empresas y organizaciones.\n\n- Swift — Cliente XMPP escrito en C++ con Qt y Swiften.\n\n- Tkabber — Cliente XMPP rico en funciones fácil de hackear por el autor del servidor XMPP ejabberd.\n\n- Vacuum IM — Cliente XMPP multiplataforma lleno de funciones.\n\nVéase también Wikipedia:List of SIP software#Clients.\n\n- Blink — Cliente SIP de última generación y fácil de usar.\n\n- Jami — Softphone compatible con SIP y mensajería instantánea para la red descentralizada de Jami. Anteriormente conocido como Ring y SFLphone.\n\n- Linphone — Aplicación de teléfono VoIP (cliente SIP) para comunicarse libremente con personas a través de Internet, con mensajes instantáneos de voz, vídeo y texto.\n\n- Twinkle — Softphone Qt para comunicación VoIP y mensajería instantánea utilizando SIP.\n\n- Zoiper — Softphone propietario VOIP SIP e IAX2.\n\nVéase también Matrix.\n\n- Element — Cliente Glossy Matrix con énfasis en el rendimiento y la usabilidad. Aplicación web y aplicación de escritorio basada en la plataforma Electron.\n\n- Fractal — Cliente Matrix para GNOME escrito en Rust.\n\n- Mirage — Un cliente de chat Matrix sofisticado, personalizable y operable por teclado para comunicaciones cifradas y descentralizadas. Escrito en Qt/QML + Python con nio, actualmente en estado alfa.\n\n- nheko — Cliente de escritorio para el protocolo Matrix.\n\n- Quaternion — Cliente de mensajería instantánea basado en Qt5 para el protocolo Matrix.\n\n- Spectral — Cliente multiplataforma Glossy Matrix basado en Qt5.\n\nVéase también Tox.\n\n- qTox — Potente cliente Tox escrito en C++/Qt que sigue las pautas de diseño de Tox.\n\n- ratox — Cliente Tox basado en FIFO.\n\n- Toxic — Cliente Tox basado en ncurses.\n\n- Toxygen — Cliente Tox escrito en Python3 puro.\n\n- Venom — Un cliente Tox moderno para el escritorio GNU/Linux.\n\n- µTox — Cliente Tox ligero.\n\nVéase también Avahi#Link-Local (Bonjour/Zeroconf) chat y Wikipedia:es:Anexo:Comparación de mensajeros LAN.\n\n- BeeBEEP — Mensajero LAN seguro.\n\n- iptux — Programa de comunicación LAN, compatible con IP Messenger.\n\nVéase también Ring y Tox.\n\n- Bitmessage — Protocolo de comunicaciones P2P descentralizado y sin confianza para enviar mensajes cifrados a otra persona o a muchos suscriptores.\n\n- Patchwork — Aplicación descentralizada de mensajería y uso compartido construida sobre Secure Scuttlebutt (SSB). Basado en la plataforma Electron.\n\n- RetroShare — Mensajería instantánea cifrada sin servidor con intercambio de archivos, grupos de charla, correo.\n\n- Ricochet — Sistema anónimo de mensajería instantánea punto-a-punto integrado en el servicio de ocultación Tor.\n\n- Caprine — Aplicación no oficial de Facebook Messenger. Basado en la plataforma Electron.\n\n- Delta Chat — Una aplicación de chat orientada a la privacidad utilizando correos electrónicos. Basado en la plataforma Electron.\n\n- Discord — Aplicación propietaria de charla de voz y texto todo en uno para jugadores que es gratuita y funciona tanto en su computadora de escritorio como en su teléfono.\n\n- Gitter — Producto de comunicación para comunidades y equipos en GitHub.\n\n- Hangups — Cliente de mensajería instantánea de terceros para Hangouts de Google con interfaz de consola.\n\n- Kotatogram — Bifurcación experimental de Telegram Desktop.\n\n- Matterhorn — Cliente de consola para el sistema de charla Mattermost.\n\n- Mattermost Desktop — Aplicación de escritorio para Mattermost. Basado en la plataforma Electron.\n\n- Mumble — Aplicación de charla de voz similar a TeamSpeak.\n\n- QQ — Software de mensajería instantánea propietario desarrollado por Tencent (imitando ICQ).\n\n- Rocket.Chat Desktop — Aplicación de escritorio para Rocket.Chat. Basado en la plataforma Electron.\n\n- Signal — Signal Private Messenger para el escritorio. Basado en la plataforma Electron.\n\n- Skype — Aplicación popular pero propietaria para la comunicación de voz y vídeo. Basado en la plataforma Electron.\n\n- Slack — Cliente Slack propietario para escritorio. Basado en la plataforma Electron.\n\n- TeamSpeak — Aplicación de VoIP propietaria con jugadores como público objetivo.\n\n- TeamTalk — Aplicación de VoIP propietaria con charla de vídeo, uso compartido de archivos y escritorios. Sin embargo, compartir el escritorio no parece funcionar en Linux. El paquete AUR es solo de servidor, pero el cliente está integrado en el proceso make.\n\n- Telegram Desktop — Cliente de escritorio oficial de Telegram.\n\n- Viber — Programa propietario multiplataforma de mensajería instantánea y VoIP.\n\n- Wire — Mensajero moderno y privado. Basado en la plataforma Electron.\n\n- YakYak — Cliente de escritorio no oficial para Hangouts de Google. Basado en la plataforma Electron.\n\n- Zoom — Aplicación propietaria de videoconferencia, reuniones en línea y mensajería grupal.\n\n- Zulip — Cliente de escritorio para la charla grupal de Zulip. Basado en la plataforma Electron.\n\n"
    },
    {
      "title": "Servidores de mensajería instantánea",
      "level": 4,
      "content": "Véase también Wikipedia:Comparison of instant messaging protocols.\n\n- InspIRCd — Un demonio IRC estable, moderno y liviano.\n\n- IRCD-Hybrid — Un demonio IRC ligero y de alto rendimiento.\n\n- miniircd — Un servidor IRC pequeño y sin configuración, adecuado para uso privado.\n\n- ngIRCd — Un servidor libre, portátil y liviano de IRC para redes pequeñas o privadas.\n\n- Ergo — Un servidor IRC moderno escrito en Go.\n\n- UnrealIRCd — Servidor IRC de código abierto.\n\n- Prosody — Un servidor XMPP escrito en el lenguaje de programación Lua. Prosody está diseñado para ser ligero y altamente extensible. Está licenciado bajo una permisiva licencia MIT.\n\n- Ejabberd — Servidor XMPP robusto, escalable y extensible escrito en Erlang.\n\n- Jabberd2 — Un servidor XMPP escrito en lenguaje C y licenciado bajo la Licencia Pública General de GNU. Fue inspirado por jabberd14.\n\n- Openfire — Un servidor multiplataforma de mensajería instantánea XMPP escrito en Java.\n\nVéase también Wikipedia:List of SIP software#Servers.\n\n- Asterisk — Una solución completa de PBX.\n\n- Kamailio — Servidor SIP sólido como una roca.\n\n- openSIPS — Proxy/servidor SIP para voz, vídeo, mensajería instantánea, presencia y cualquier otra extensión SIP.\n\n- Repro — Un servidor SIP libre de código abierto.\n\n- Yate — Servidor de telefonía avanzado, maduro y flexible que se utiliza para VoIP y redes fijas, y para operadores móviles tradicionales y virtuales.\n\n- Mattermost — Servidor de nube privada de código abierto, alternativa a Slack.\n\n- Murmur — El servidor de aplicaciones de charla de voz para Mumble.\n\n- Nextcloud Talk — Aplicación de vídeo- y audio-conferencia para Nextcloud.\n\n- Rocket.Chat — Servidor de chat web, desarrollado en JavaScript, utilizando el framework completo de Meteor.\n\n- Spreed WebRTC — Servidor WebRTC de llamada de audio/vídeo y conferencia.\n\n- Synapse — Servidor de referencia para el protocolo Matrix.\n\n- TeamSpeak Server — Servidor propietario de conferencia VoIP.\n\n- uMurmur — Servidor Mumble minimalista.\n\n"
    },
    {
      "title": "Programas colaborativos",
      "level": 4,
      "content": "Véase también Wikipedia:Collaborative software.\n\n- Citadel/UX — Incluye un servidor de correo electrónico y lista de correo, mensajería instantánea, libretas de direcciones, calendario / programación, tableros de anuncios y motores de wiki y blog.\n\n- SOGo — Servidor de programa colaborativo creado alrededor de OpenGroupware.org (OGo) y el servidor de aplicaciones SOPE.\n\n"
    },
    {
      "title": "Agregadores de noticias",
      "level": 4,
      "content": "Agregadores RSS/Atom. Algunos clientes de correo electrónicos también pueden actuar como agregador de noticias: Claws Mail RSSyl plugin, Evolution RSS plugin, SeaMonkey Mail & Newsgroups, Thunderbird.\n\nVéase también Wikipedia:Comparison of feed aggregators.\n\n- Canto — Agregador RSS en Ncurses.\n\n- Gnus — Cliente de correo electrónico, NNTP y RSS para Emacs.\n\n- Newsboat — Agregador RSS en Ncurses con diseño y combinación de teclas similar al cliente de correo electrónico Mutt.\n\n- Rawdog — \"Agregador RSS sin delirios de grandeza\" que analiza las fuentes RSS/CDF/Atom en una página HTML estática de artículos en orden cronológico.\n\n- sfeed — Analizador ligero de RSS y Atom.\n\n- Snownews — Lector de noticias RSS en modo texto.\n\n- Akregator — Agregador de noticias para KDE, parte de kde-pim.\n\n- Alduin — Agregador de fuentes RSS, Atom y JSON. Basado en la plataforma Electron.\n\n- FeedReader — Aplicación de escritorio moderna diseñada para complementar las cuentas RSS existentes basadas en la web. Discontinuado.\n\n- Feeds — Un lector de feeds RSS/Atom para GNOME.\n\n- HackUp — Lea Hacker News desde el escritorio.\n\n- Liferea — Agregador de noticias GTK para fuentes de noticias en línea y weblogs.\n\n- NewsFlash — Lector de feeds moderno diseñado para el escritorio GNOME. El sucesor espiritual de FeedReader.\n\n- Nextcloud News — Lector de fuentes RSS/Atom para Nextcloud.\n\n- QuiteRSS — Lector de fuentes RSS/Atom escrito en Qt/С++.\n\n- Raven — Lector RSS de escritorio simple hecho con VueJS. Basado en la plataforma Electron.\n\n- RSS Guard — Lector de noticias RSS y ATOM muy pequeño desarrollado utilizando el framework Qt.\n\n- selfoss — La nueva aplicación web de agregación, lector de RSS multipropósito, transmisión en vivo, mashup.\n\n- Tickr — Lector RSS basado en GTK que muestra las fuentes como una línea de desplazamiento suave en su escritorio, como se conoce en las estaciones de TV.\n\n- Tiny Tiny RSS — Agregador de fuentes de noticias basado en web (RSS/Atom).\n\n"
    },
    {
      "title": "Clientes de podcast",
      "level": 4,
      "content": "Algunos reproductores multimedia también pueden actuar como cliente de podcast: Amarok, Banshee, Cantata, Clementine, Goggles Music Manager, Rhythmbox, VLC media player. git-annex también puede funcionar como podcatcher.\n\nVéase también Wikipedia:List of podcatchers.\n\n- castero — Un cliente de podcast TUI para terminal.\n\n- castget — Descargador simple de línea de órdenes, diseñado principalmente para la descarga automática y desatendida de podcasts.\n\n- gpo — Interfaz en modo de texto de gPodder.\n\n- Greg — Un agregador de podcast de línea de órdenes.\n\n- Marrie — Un cliente de podcast simple que se ejecuta en la interfaz de línea de órdenes.\n\n- pcd — Un cliente de podcast mínimo escrito en Go.\n\n- CPod — Aplicación simple y hermosa de podcast. Basado en la plataforma Electron.\n\n- GNOME Podcasts — Cliente de podcast para el escritorio GNOME escrito en Rust.\n\n- gPodder — Cliente de podcast y agregador de medios (interfaz GTK).\n\n- Vocal — Cliente de podcast simple para el escritorio moderno (GTK).\n\n"
    },
    {
      "title": "Lectores de noticias Usenet",
      "level": 4,
      "content": "Algunos clientes de correo electrónico también pueden actuar como lectores de noticias de Usenet: Claws Mail, Evolution, NeoMutt, SeaMonkey Mail & Newsgroups, Sylpheed, Thunderbird.\n\nVéase también Wikipedia:List of Usenet newsreaders y Wikipedia:Comparison of Usenet newsreaders.\n\n- nn — Lector de noticias Usenet alternativo más fácil de utilizar (basada en curses) para UNIX.\n\n- slrn — Cliente de noticias basado en texto.\n\n- tin — Un lector de noticias UseNet NNTP basado en spool multiplataforma.\n\n- trn — Un lector de noticias Usenet basado en texto.\n\n- NZBGet — Descargador binario de Usenet para archivos .nzb con interfaz web y CLI.\n\n- Pan — Lector de noticias Usenet en GTK que es bueno tanto en texto como en binarios.\n\n- SABnzbd — Una aplicación web de lector de noticias binario de código abierto escrita en Python.\n\n- XRN — Lector de noticias Usenet para el Sistema de ventanas X.\n\n"
    },
    {
      "title": "Clientes de microblogging",
      "level": 4,
      "content": "Véase también Wikipedia:List of Twitter services and applications.\n\n- bti — Cliente simple de línea de órdenes para twitter/identi.ca\n\n- oysttyer — (bifurcación oficial de ttytter) Un cliente de Twitter de línea de órdenes basado en texto de consola interactiva escrito en Perl.\n\n- Rainbowstream — Un cliente de Twitter de consola potente y con todas las funciones escrito en Python.\n\n- toot — Herramienta CLI y TUI para interactuar con instancias de Mastodon.\n\n- turses — Cliente de Twitter para la consola basado en tyrs con importantes mejoras.\n\n- Birdie — Hermoso cliente de Twitter diseñado para elementary OS.\n\n- Cawbird — Cliente de Twitter GTK nativo para el escritorio Linux.\n\n- Choqok — Cliente de microblogging para KDE que SOPORTA los servicios de Twitter.com, Pump.io, GNU social y opendesktop.org.\n\n- Mikutter — Cliente de Twitter simple y potente que usa GTK y Ruby.\n\n- Polly — Cliente Linux de Twitter diseñado para múltiples columnas con múltiples cuentas.\n\n- Pumpa — Cliente Pump.io escrito en C++ y Qt.\n\n- Tootle — Cliente GTK3 para Mastodon.\n\n- Turpial — Cliente de Twitter de interfaz múltiple escrito en Python.\n\n- Whalebird — Aplicación cliente Mastodon. Basado en la plataforma Electron.\n\n"
    },
    {
      "title": "Motores de blogs",
      "level": 4,
      "content": "Véase también Wikipedia:es:Blog y Wikipedia:List of content management systems.\n\n- Diaspora — Una red social distribuida con privacidad.\n\n- Drupal — Una plataforma de gestión de contenido basada en PHP.\n\n- Joomla — Un sistema de gestión de contenido (CMS) en PHP que le permite crear sitios web y potentes aplicaciones en línea.\n\n- Wordpress — Herramienta de blog y plataforma de publicación.\n\n"
    },
    {
      "title": "Generadores de sitio estático",
      "level": 4,
      "content": "- Hexo — Framework de blog rápido, simple y potente.\n\n- Hugo — Hugo es un generador de sitio web HTML y CSS estático escrito en Go. Está optimizado para velocidad, facilidad de uso y personalización.\n\n- Jekyll — Motor de blog estático, escrito en Ruby, que soporta Markdown, textil y otros formatos.\n\n- Nanoblogger — Un pequeño motor de weblog escrito en Bash para la línea de órdenes. Utiliza herramientas comunes de UNIX como cat, grep y sed para crear contenido HTML estático. Ya no se mantiene.\n\n- Nikola — Generador de sitio estático escrito en Python, con reconstrucciones incrementales y múltiples formatos de marcado.\n\n- Pelican — Generador de sitio estático, impulsado por Python.\n\n"
    },
    {
      "title": "Escritorio remoto",
      "level": 3,
      "content": "Véase también Wikipedia:es:Escritorio remoto y Wikipedia:Comparison of remote desktop software.\n\n"
    },
    {
      "title": "Clientes de escritorio remoto",
      "level": 4,
      "content": "- AnyDesk — Programa de escritorio remoto propietario.\n\n- GNOME Boxes — Una sencilla aplicación GNOME 3 para acceder a sistemas remotos o virtuales. Soporta RDP, VNC y SPICE.\n\n- GNOME Connections — Cliente de escritorio remoto para GNOME. Soporta RDP y VNC.\n\n- GVncViewer — Cliente VNC simple en Gtk-VNC. Corre con gvncviewer.\n\n- KRDC — Cliente de escritorio remoto para KDE. Soporta RDP y VNC. Parte de kde-network.\n\n- Remmina — Cliente de escritorio remoto escrito en GTK. Soporta RDP, VNC, NX, XDMCP y SSH.\n\n- Remote Viewer — Cliente de pantalla remota simple. Soporta SPICE y VNC.\n\n- Remotely — Visor VNC simple para GNOME.\n\n- Sunlogin Remote Control — Software propietario que soporta el control remoto de dispositivos móviles, Windows, Mac, Linux y otros sistemas. Utiliza su propio protocolo propietario.\n\n- ToDesk — Cliente de escritorio remoto propietario que se adapta al trabajo en equipo remoto. Utiliza su propio protocolo propietario.\n\n- TeamViewer — Cliente de escritorio remoto propietario. Utiliza su propio protocolo propietario.\n\n- vncviewer (TigerVNC) — Visor VNC para X.\n\n- Vinagre — Visor de escritorio remoto para GNOME. Soporta RDP, VNC, SPICE y SSH. Parte de gnome-extra.\n\n- xfreerdp — Cliente X11 FreeRDP. Corre con xfreerdp.\n\n- X2Go Client — Un cliente gráfico (Qt5) para el sistema X2Go que utiliza el protocolo NX technology.\n\n"
    },
    {
      "title": "Servidores de escritorio remotos",
      "level": 4,
      "content": "- Krfb — Servidor VNC para KDE. Parte de kde-network.\n\n- wayvnc — Servidor VNC para compositores wayland basados ​​en wlroots (como sway).\n\n- x0vncserver (TigerVNC) — Servidor VNC para X.\n\n- x11vnc — Servidor VNC para X.\n\n- X2Go Server — Un programa de escritorio remoto de código abierto que utiliza el protocolo NX technology.\n\n- Xrdp — Un demonio que soporta RDP. Utiliza Xvnc, X11rdp o xorgxrdp como backend.\n\n"
    }
  ]
}