{
  "title": "List of applications (Español)/Utilities (Español)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Espa%C3%B1ol)/Utilities_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\n"
    },
    {
      "title": "Órdenes básicas de la shell",
      "level": 3,
      "content": "- Core utilities — El paquete contiene el archivo básico, la shell y las utilidades de manipulación de texto para el sistema operativo GNU.\n\n"
    },
    {
      "title": "Gestores de paquetes",
      "level": 3,
      "content": "Véanse los artículos de ArchWiki sobre este asunto para obtener más información: AUR helpers y Pacman GUI Frontends.\n\n- Pacmatic — Wrapper de pacman para comprobar noticias de Arch antes de actualizar, evitar las actualizaciones parciales y alertar sobre cambios en los archivos de configuración.\n\n- pkgfile — Herramienta que encuentra el paquete al que pertenece un archivo.\n\n"
    },
    {
      "title": "Programas de visualización sobre la utilización del disco",
      "level": 3,
      "content": "- Disk Usage Analyzer (Baobab) — Analizador de uso de disco para el escritorio de GNOME.\n\n- Filelight — Analizador del uso del disco que crea un mapa interactivo concéntrico, de anillos segmentados, que ayuda a visualizar el uso del disco en el ordenador.\n\n- GdMap — Analizador del uso del disco que dibuja un mapa de rectángulos, calibrados según los tamaños de los archivos o directorios.\n\n- gt5 — Diff-capable \"du-browser\".\n\n- ncdu — Sencillo analizador del uso del disco basado en ncurses.\n\n"
    },
    {
      "title": "Herramientas de grabación de CD/DVD",
      "level": 3,
      "content": "Véase el artículo de ArchWiki sobre este asunto para obtener más información: Burning CD/DVD with GUI.\n\n"
    },
    {
      "title": "Gestores de portapapeles",
      "level": 3,
      "content": "- Anamnesis — Gestor de portapapeles que almacena todo el historial del portapapeles y ofrece una interfaz para hacer una búsqueda de texto completo. Tiene disponible tanto un modo en línea de órdenes como un modo gráfico.\n\n- ClipIt — Fork de Parcellite con características adicionales y corrección de errores.\n\n- CopyQ — Gestor de portapapeles inteligente con búsqueda e historial editables, acciones personalizadas sobre elementos y soporte para línea de órdenes.\n\n- Klipper — Gestor de portapapeles con todas las características para el escritorio KDE.\n\n- Parcellite — Gestor de portapapeles liviano y rico en funciones.\n\n"
    },
    {
      "title": "Herramientas de compresión",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of file archivers.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- atool — Script para gestionar archivos comprimidos de varios tipos.\n\n- p7zip — Puerto de 7-Zip para sistemas POSIX, incluido Linux. La herramienta de línea de órdenes se llama 7z.\n\n"
    },
    {
      "title": "Interfaz gráfica",
      "level": 4,
      "content": "- Ark — Herramienta de compresión de archivos incluido en el escritorio KDE.\n\n- File Roller — Gestor de compresión de archivos incluido en el escritorio GNOME.\n\n- p7zip — Puerto de 7-Zip para sistemas POSIX, incluido Linux. La GUI requiere wxGTK y se llama 7zFM.\n\n- PeaZip — Gestor de archivos y de compresión de código abierto.\n\n- Xarchiver — Gestor de compresión de archivos ligero, de escritorio independiente, compilado con GTK+.\n\n"
    },
    {
      "title": "Gestores de archivos",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of file managers.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- Dired — Editor de directorios integrado con Emacs.\n\n- Midnight Commander — Gestor de archivos de dobles paneles basado en consola.\n\n- nffm — \"Nothing Fancy File Manager\", un gestor de archivos basado en ncurses sin ratón escrito en C.\n\n- Pilot — Gestor de archivos que viene con el cliente de email Alpine.\n\n- Ranger — Gestor de archivos basado en consola con atajos de teclado a vi, personalizable y con muchas características.\n\n- Vifm — Gestor de archivos de dobles paneles basado en ncurses con atajos de teclado a vi.\n\n"
    },
    {
      "title": "Interfaz gráfica",
      "level": 4,
      "content": "- Dolphin — Administrador de archivos incluidos en el escritorio KDE4.\n\n- Double Commander — Gestor de archivos con dos paneles de lado a lado. Está inspirado en Total Commander y cuenta con algunas ideas nuevas.\n\n- emelFM2 — Administrador de archivos que implementa el popular diseño de dos paneles.\n\n- Konqueror — Administrador de archivos para el escritorio KDE.\n\n- Krusader — Gestor de archivos de doble panel avanzado (estilo Midnight Commander) para el escritorio KDE.\n\n- GNOME Files — Extensible, gestor de archivos pesado usado por defecto en GNOME con soporte para scripts personalizados.\n\n- Nemo — Nemo es el administrador de archivos del escritorio Cinnamon. Una buena alternativa a GNOME Files.\n\n- PCManFM — Administrador de archivos ligero que cuenta con navegación por pestañas y puede administrar opcionalmente el fondo del escritorio..\n\n- qtFM — Pequeño, administrador de archivos ligero para escritorios Linux basado en Qt puro.\n\n- ROX — Gestor de archivos pequeño y rápido que puede manejar opcionalmente el fondo del escritorio y los paneles .\n\n- Sunflower — Gestor de archivos de doble panel, pequeño y altamente personalizable, para Linux, con soporte para plugins.\n\n- Thunar — Administrador de archivos que se puede ejecutar como un demonio con excelentes tiempos de puesta en marcha y carga de directorios.\n\n- Tux Commander — Gestor de archivos de ventana con dos paneles, uno en el lateral, similar al popular Total Commander o Midnight Commander.\n\n- Worker — Rápido, ligero y rico en funciones administrador de archivos para el sistema de ventanas X.\n\n- Xfe — Microsoft Explorer como administrador de archivos para X (X File Explorer).\n\n"
    },
    {
      "title": "Herramientas de integración y comparación de archivos",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of file comparison tools.\n\n- Diffuse — Herramienta de integración de texto pequeña y simple para el escritorio KDE.\n\n- Kompare — Programa gráfico para visualizar y combinar diferencias entre los archivos de origen. Es compatible con una variedad de formatos diferentes y proporciona muchas opciones para personalizar el nivel de información que se muestra.\n\n- Meld — Herramienta de visualización de diferencias y combinación que puede comparar archivos, directorios, y proyectos de control de versiones.\n\nVim y Emacs proporcionan funciones de combinación con vimdiff y ediff.\n\n"
    },
    {
      "title": "Barras de tareas",
      "level": 3,
      "content": "- Bmpanel — Ligero, panel compatible con NETWM para el sistema X11.\n\n- Cairo-Dock — Dock altamente personalizable y lanzador de aplicaciones.\n\n- Docker — Aplicación dock que actúa como bandeja del sistema.\n\n- fbpanel — Ligero, panel de escritorio compatible NETWM.\n\n- GNOME Panel — Panel incluido en el escritorio GNOME Flashback.\n\n- LXPanel — Ligero panel del escritorio X11 y parte del escritorio LXDE.\n\n- Stalonetray — Bandeja del sistema autónomo.\n\n- Tint2 — Panel/barra de tareas simple desarrollado específicamente para Openbox.\n\n- Trayer — Bandeja de sistema ligero basado en GTK+.\n\n- Xfce Panel — Panel incluido en el escritorio Xfce.\n\n"
    },
    {
      "title": "Aplicaciones para renombrar masivamente archivos",
      "level": 3,
      "content": "- GPRename — Renombrador por lotes para archivos y directorios basado en GTK+.\n\n- KRename — Muy potente renombrador de archivos por lotes para el escritorio KDE.\n\n- metamorphose2 — Renombrador por lotes basado en wxPython con soporte para expresiones regulares, cambiar el nombre de los archivos multimedia de acuerdo con sus metadatos, etc.\n\n- rename.pl — Renombrador por lotes basado en expresiones regulares perl.\n\n"
    }
  ]
}