{
  "title": "List of applications (Polski)/Security (Polski)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Polski)/Security_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Szczegółowe instrukcje można znaleźć na głównej stronie dot. bezpieczeństwa.\n\n"
    },
    {
      "title": "Bezpieczeństwo sieci",
      "level": 2,
      "content": "Zobacz także Wikipedia:Comparison of packet analyzers.\n\n- airgeddon — Wielozadaniowy skrypt bash do audytu sieci bezprzewodowych\n\n- Arpwatch — Narzędzie monitorujące aktywność sieci Ethernet i przechowujące bazę danych par adresów Ethernet/IP.\n\n- bettercap — Narzędzie do ataków sieciowych i monitorowania.\n\n- darkstat — Przechwytuje ruch sieciowy, oblicza statystyki użytkowania i udostępnia raporty za pośrednictwem protokołu HTTP.\n\n- dsniff — Zbiór narzędzi do audytu sieci i testów penetracyjnych.\n\n- EtherApe — Graficzny monitor sieci dla systemu Unix wzorowany na programie etherman. Posiada tryby warstwy łącza, IP i TCP, wyświetla aktywność sieci w sposób graficzny. Hosty i łącza zmieniają swój rozmiar wraz z ruchem sieciowym. Wyświetlanie protokołów kodowanych kolorami.\n\n- Ettercap — Uniwersalny sniffer/analizator/interceptor/logger sieciowy.\n\n- GNOME Network Tools — Interfejs GNOME dla różnych narzędzi sieciowych.\n\n- hping — Zorientowany na wiersz poleceń asembler/analizator pakietów TCP/IP.\n\n- IPTraf — Narzędzie do monitorowania sieci oparte na konsoli.\n\n- jnettop — wizualizator ruchu sieciowego przypominający konsolę.\n\n- justniffer — Analizator protokołów sieciowych, który przechwytuje ruch sieciowy i tworzy dzienniki w niestandardowy sposób, może emulować pliki dziennika serwera WWW Apache, śledzić czasy odpowiedzi i wyodrębniać wszystkie \"przechwycone\" pliki z ruchu HTTP.\n\n- Kismet — Detektor sieci bezprzewodowej 802.11 warstwy 2., sniffer i system wykrywania włamań.\n\n- LinSSID — Graficzny skaner sieci bezprzewodowych.\n\n- Nemesis — Narzędzie wiersza poleceń do tworzenia i wstrzykiwania pakietów sieciowych.\n\n- Net Activity Viewer — Graficzna przeglądarka połączeń sieciowych, podobna pod względem funkcjonalności do Netstat.\n\n- netsniff-ng — Wysokowydajny sniffer sieciowy Linux do inspekcji pakietów.\n\n- ngrep — narzędzie podobne do grep, które umożliwia wyszukiwanie pakietów sieciowych na interfejsie.\n\n- Nmap — Skaner bezpieczeństwa używany do wykrywania hostów i usług w sieci komputerowej, tworząc w ten sposób \"mapę\" sieci.\n\n- Ntop — Sonda sieciowa, która pokazuje wykorzystanie sieci w sposób podobny do tego, co top robi dla procesów.\n\n- pyNeighborhood — Oparte na GTK narzędzie do przeglądania SMB/CIFS.\n\n- Smb4K — Zaawansowana przeglądarka sąsiedztwa sieci i narzędzie do montowania udziałów Samba dla KDE.\n\n- Snort — Sieciowy system zapobiegania i wykrywania włamań.\n\n- Spectools — Zestaw narzędzi dla analizatorów widma, w tym urządzeń Wi-Spy.\n\n- Sshguard — Daemon chroniący SSH i inne usługi przed atakami typu brute-force, podobny do Fail2ban.\n\n- ssh-audit — Audyt konfiguracji SSH.\n\n- Suricata — Wysokowydajny sieciowy system IDS, IPS i silnik monitorowania bezpieczeństwa sieci.\n\n- Tcpdump — Wspólny konsolowy analizator pakietów, który umożliwia użytkownikowi przechwytywanie i wyświetlanie pakietów TCP/IP i innych pakietów przesyłanych lub odbieranych przez sieć.\n\n- vnStat — Oparty na konsoli monitor ruchu sieciowego, który przechowuje dziennik ruchu sieciowego dla wybranych interfejsów.\n\n- What IP — Mała aplikacja GTK do uzyskiwania informacji o adresie IP.\n\n- Wireshark — Analizator protokołów sieciowych umożliwiający przechwytywanie i interaktywne przeglądanie ruchu w sieci komputerowej.\n\n- Xplico — Narzędzie do analizy sieciowej (NFAT), które jest oprogramowaniem rekonstruującym zawartość przejęć wykonanych za pomocą sniffera pakietów.\n\n- Zeek — Potężny framework do analizy sieci, który znacznie różni się od typowych systemów IDS, które możesz znać.\n\n"
    },
    {
      "title": "Zarządzanie zaporą sieciową",
      "level": 2,
      "content": "Zobacz iptables#Front-ends oraz nftables#Front-ends.\n\n"
    },
    {
      "title": "Wykrywanie zagrożeń i luk w zabezpieczeniach",
      "level": 2,
      "content": "- AFICK — Narzędzie bezpieczeństwa, które umożliwia monitorowanie zmian w systemach plików, a tym samym wykrywanie włamań.\n\n- Chipsec — Zawiera zestaw modułów, w tym proste testy zabezpieczeń sprzętowych i poprawnej konfiguracji, testy luk w oprogramowaniu układowym i komponentach platformy, narzędzia do oceny bezpieczeństwa i fuzzingu dla różnych urządzeń i interfejsów platformy oraz narzędzia pozyskujące krytyczne artefakty oprogramowania układowego i urządzeń.\n\n- Lynis — Narzędzie bezpieczeństwa służące do audytu systemu w celu wzmacniania systemów Unix/Linux.\n\n- Metasploit Framework — Zaawansowana platforma open-source do tworzenia, testowania i używania kodu exploitów.\n\n- Nessus — Kompleksowy program skanowania podatności.\n\n- OpenVAS — Framework kilku usług i narzędzi oferujących kompleksowe i wydajne rozwiązanie do skanowania i zarządzania lukami w zabezpieczeniach. FOSS'owy fork Nessus.\n\n- OSSEC — Open Source Host-based Intrusion Detection System, który wykonuje analizę dzienników, sprawdzanie integralności plików, monitorowanie zasad, wykrywanie rootkitów, alarmowanie w czasie rzeczywistym i aktywne reagowanie.\n\n- OWASP ZAP — Skaner bezpieczeństwa aplikacji internetowych.\n\n- Samhain — System wykrywania włamań oparty na hoście (HIDS) zapewnia sprawdzanie integralności plików i monitorowanie/analizę plików dziennika, a także wykrywanie rootkitów, monitorowanie portów, wykrywanie nieuczciwych plików wykonywalnych SUID i ukrytych procesów.\n\n- Tiger — Narzędzie bezpieczeństwa, które może być używane zarówno jako audyt bezpieczeństwa, jak i system wykrywania włamań.\n\n- Tripwire — System wykrywania włamań.\n\n"
    },
    {
      "title": "Bezpieczeństwo plików",
      "level": 2,
      "content": "- AIDE — Narzędzie do sprawdzania integralności plików i katalogów.\n\n- Logwatch — Konfigurowalny system analizy logów.\n\n"
    },
    {
      "title": "Ochrona przed złośliwym oprogramowaniem",
      "level": 2,
      "content": "- ClamAV — Opensource'owy silnik antywirusowy do wykrywania trojanów, wirusów, złośliwego oprogramowania i innych złośliwych zagrożeń.\n\n- ClamTk — Graficzny interfejs dla ClamAV wykorzystujący biblioteki Perl i Gtk. Został zaprojektowany jako łatwy w użyciu, lekki skaner antywirusowy na żądanie dla systemów Linux.\n\n- Linux Malware Detect — Skaner złośliwego oprogramowania zaprojektowany z myślą o zagrożeniach występujących we współdzielonych środowiskach hostowanych.\n\n- Rootkit Hunter — Sprawdza maszyny pod kątem obecności rootkitów i innych niepożądanych programów.\n\n- Hostsblock — Skrypt, który pobiera, sortuje i kompiluje wiele plików hosts blokujących reklamy i złośliwe oprogramowanie.\n\n"
    },
    {
      "title": "Blokady ekranu",
      "level": 2,
      "content": "Note: **This article or section is a candidate for merging with Session lock#By environment.** This article or section is a candidate for merging with Session lock#By environment.\n\nThis article or section is a candidate for merging with Session lock#By environment.\n\nZobacz także Session lock.\n\n- betterlockscreen — Wrapper i3lock-color. Betterlockscreen pozwala na buforowanie obrazów z różnymi filtrami i ekranem blokady z niesamowitą prędkością.\n\n- Cinnamon Screensaver — Blokada ekranu dla pulpitu Cinnamon.\n\n- Deepin Screensaver — Lekki wygaszacz ekranu oparty na Qt5.\n\n- GNOME Screensaver — Przestarzała blokada ekranu dla środowiska GNOME. Nieobsługiwany od 2012 roku.\n\n- i3lock — Prosta blokada ekranu. Zapewnia informacje zwrotne od użytkownika i wykorzystuje uwierzytelnianie PAM. Tło można ustawić na obraz lub jednolity kolor.\n\n- i3lock-blur — Fork i3lock, który może używać pulpitu z zastosowanym efektem rozmycia jako tła.\n\n- i3lock-color — Fork i3lock z obsługą konfiguracji kolorów i pozycjonowania oraz może używać pulpitu z zastosowanym efektem rozmycia jako tła.\n\n- Light-locker — Prosta blokada (sforkowana z gnome-screensaver), która ma mieć proste, rozsądne, bezpieczne ustawienia domyślne i być dobrze zintegrowana z pulpitem, nie niosąc żadnych zależności specyficznych dla pulpitu. Opiera się na LightDM do blokowania i odblokowywania sesji poprzez ConsoleKit/UPower lub logind/systemd.\n\n- MATE Screensaver — Wygaszacz ekranu i blokada dla środowiska graficznego MATE.\n\n- physlock — Blokada na ekran i konsolę.\n\n- sflock — Proste narzędzie do blokowania ekranu dla X, oparte na slock. Zapewnia bardzo podstawowe informacje zwrotne od użytkownika.\n\n- slock — Bardzo prosty i lekki X screen locker. Oferuje tylko czarne tło po zablokowaniu, nie ma animacji ani pól tekstowych.\n\n- tsscreenlock — Blokada ekranu używana z theShell. Wyświetla sterowanie muzyką, a jeśli jest używany z theShell, wyświetla również powiadomienia na pulpicie.\n\n- vlock — Blokada TTY. Kopia lustrzana oryginalnego vlocka jest dostępna na githubie.\n\n- xfce4-screensaver — Wygaszacz ekranu i blokada, która ma mieć proste, rozsądne, bezpieczne ustawienia domyślne i być dobrze zintegrowana z pulpitem xfce.\n\n- xlockmore — Prosta blokada ekranu X11 z obsługą PAM.\n\n- XScreenSaver — Wygaszacz ekranu i blokada dla systemu X Window.\n\n- XSecureLock — Narzędzie do blokowania ekranu X11 zaprojektowane z myślą o bezpieczeństwie.\n\n- xtrlock — Bardzo lekka blokada ekranu X. Utrzymuje widoczność okien i wyświetla ikonę blokady zamiast kursora myszy. Wpisanie hasła, a następnie enter odblokowuje ekran.\n\n- swaylock — Blokada ekranu dla Wayland.\n\n- swaylock-effects — Swaylock, z fantazyjnymi efektami.\n\n- gtklock — Oparty na GTK ekran blokady dla Wayland.\n\n"
    },
    {
      "title": "Audyt haseł",
      "level": 2,
      "content": "- John the Ripper — Łamacz haseł.\n\n- Hashcat — Wielowątkowe zaawansowane narzędzie do odzyskiwania haseł.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 3,
      "content": "- 1password CLI — Zastrzeżone narzędzie wiersza poleceń dla menedżera haseł 1Password.\n\n- Bitwarden — Menedżer haseł typu opensource w wersji desktopowej, mobilnej, przeglądarkowej i CLI. Hostowany w chmurze lub samodzielnie.\n\n- gopass — Zaawansowany konsolowy menedżer haseł, obsługujący GnuPG i inne backendy.\n\n- Himitsu — Menedżer tajnej pamięci.\n\n- KeePassC — Menedżer haseł oparty na curses, kompatybilny z KeePass v.1.x.\n\n- LastPass — Hostowany menedżer haseł.\n\n- pass — Prosty konsolowy menedżer haseł z płaską organizacją plików tekstowych i szyfrowaniem GnuPG.\n\n- pwsafe — Uniksowy program wiersza poleceń zarządzający zaszyfrowanymi bazami haseł.\n\n- tpm — Malutki menedżer haseł, inspirowany programem Pass, napisany w całości w powłoce POSIX.\n\n- Vault — Zastrzeżone narzędzie do zarządzania sekretami.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 3,
      "content": "- 1Password — Zastrzeżony graficzny interfejs użytkownika dla menedżera haseł 1Password.\n\n- Authenticator — Aplikacja opensource do uwierzytelniania dwuskładnikowego stworzona dla środowiska GNOME.\n\n- Bitwarden — Menedżer haseł typu opensource w wersji desktopowej, mobilnej, przeglądarkowej i CLI. Hostowany w chmurze lub samodzielnie.\n\n- Figaro's Password Manager 2 — Port GTK2 Figaro's Password Manager z kilkoma nowymi ulepszeniami.\n\n- Ked Password Manager — Menedżer haseł, który pomaga zarządzać dużą liczbą haseł.\n\n- KeePass Password Safe — Menedżer haseł oparty na mono, który pomaga zarządzać hasłami w bezpieczny sposób.\n\n- KeePassXC — Społecznościowy fork KeePassX z bardziej aktywnym rozwojem. Kompatybilny z KeePass v.1.x (tylko import) i KeePass v.2.x.\n\n- Keysmith — Oprogramowanie do generowania OTP przez KDE.\n\n- KDE Wallet Manager — Narzędzie do zarządzania hasłami w systemie. Korzystając z podsystemu portfela KDE, pozwala nie tylko zachować własne sekrety, ale także uzyskać dostęp i zarządzać hasłami każdej aplikacji, która integruje się z portfelem. Część kde-utilities.\n\n- OTPClient — Wysoce bezpieczne i łatwe w użyciu oprogramowanie GTK do uwierzytelniania dwuskładnikowego, które obsługuje zarówno hasła jednorazowe oparte na czasie (TOTP), jak i hasła jednorazowe oparte na HMAC (HOTP).\n\n- Passbook — Nowoczesny menedżer haseł dla środowiska GNOME.\n\n- Password Gorilla — Wieloplatformowy menedżer haseł.\n\n- Password Safe — Prosty i bezpieczny menedżer haseł.\n\n- QPass — Łatwy w użyciu menedżer haseł z wbudowanym generatorem haseł.\n\n- QtPass — GUI dla pass, standardowego uniksowego menedżera haseł.\n\n- Revelation — Menedżer haseł dla środowiska GNOME.\n\n- Seahorse — Aplikacja GNOME do zarządzania kluczami szyfrowania i hasłami w GNOME Keyring. Część gnome-extra.\n\n- Secrets — Menedżer haseł dla środowiska GNOME wykorzystujący format KeePass v.4.\n\n- Universal Password Manager — Umożliwia przechowywanie nazw użytkowników, haseł, adresów URL i ogólnych notatek w zaszyfrowanej bazie danych chronionej jednym hasłem głównym.\n\n"
    },
    {
      "title": "Sprawdzanie hashy",
      "level": 3,
      "content": "- cfv — Niewielkie narzędzie do testowania i tworzenia plików z sumami kontrolnymi, obsługujące pliki .sfv, .csv, .crc, .md5, .md5sum, .sha1sum, .torrent, .par i .par2.\n\n- GtkHash — Narzędzie GTK do obliczania hashy lub sum kontrolnych wiadomości\n\n- hashdeep — Wieloplatformowe narzędzie do obliczania hashy, lub sum kontrolnych wiadomości, dowolnej liczby plików\n\n- Quick Hash GUI — Graficzny interfejs użytkownika umożliwiający szybkie wybieranie, a następnie hashowanie plików (pojedynczo lub rekurencyjnie w całej strukturze folderów), tekstu i (w systemie Linux) dysków.\n\n- RHash — Narzędzie do weryfikacji sum hashy (SFV, CRC itp.). Obsługuje wiele algorytmów.\n\n- MassHash — Zestaw narzędzi do hashowania plików (zarówno CLI, jak i GTK GUI) napisanych w Pythonie. Obsługiwane algorytmy obejmują MD5, SHA-1, SHA-224, SHA-256, SHA-384, SHA-512.\n\n- Parchive — Narzędzie, które tworzy i wykorzystuje pliki PAR2 do wykrywania uszkodzeń w plikach danych i naprawiania ich w razie potrzeby.\n\n"
    },
    {
      "title": "Szyfrowanie, podpisywanie, steganografia",
      "level": 3,
      "content": "- age — Proste, nowoczesne i bezpieczne narzędzie szyfrujące (i biblioteka) z małymi jawnymi kluczami, bez opcji konfiguracyjnych i możliwością komponowania w stylu UNIX.\n\n- ccrypt — Narzędzie wiersza poleceń do szyfrowania i deszyfrowania plików i strumieni w oparciu o Rijndael.\n\n- GNOME Keysign — Aplikacja GTK/GNOME do używania GnuPG do podpisywania kluczy innych osób. Szybko, łatwo i bezpiecznie.\n\n- GnuPG — Kompletna i wolna implementacja standardu OpenPGP zdefiniowanego przez RFC4880 w ramach projektu GNU. Wolny i otwarty zamiennik PGP, używany głównie do cyfrowego podpisywania pakietów.\n\n- GPG-Crypter — Graficzna nakładka na GnuPG(GPG) wykorzystująca zestaw narzędzi GTK3 i bibliotekę GPGME.\n\n- KeePassXC — Służy głównie do zarządzania i generowania haseł, ale obsługuje również dołączanie dowolnych plików do wpisów w zaszyfrowanej bazie danych.\n\n- Keybase — Katalog kluczy mapujący tożsamości mediów społecznościowych, z szyfrowanym czatem między platformami, przechowywaniem w chmurze i repozytoriami git.\n\n- KGpg — Prosty interfejs dla GnuPG, dla KDE. Część kde-utilities.\n\n- Kleopatra — Menedżer certyfikatów i Unified Crypto GUI dla KDE. Obsługuje zarządzanie certyfikatami X.509 i OpenPGP w skrzynce kluczy GpgSM oraz pobieranie certyfikatów z serwerów LDAP. Część kde-pim.\n\n- minisign — Prosty program, który implementuje tylko podpisywanie kluczy\n\n- opgpcard — Narzędzie CLI do sprawdzania, zarządzania i używania kart OpenPGP\n\n- OpenSSH — De facto implementacja SSH obsługująca podpisywanie wiadomości\n\n- passphrase2pgp — Odtwarzalne generowanie klucza prywatnego w formatach OpenPGP/OpenSSH zgodnie z wprowadzonym przez użytkownika hasłem i opcjonalne podpisywanie wiadomości za jednym razem\n\n- rsop — Stateless OpenPGP (SOP) na podstawie rpgp\n\n- Seahorse — Aplikacja GNOME do zarządzania kluczami szyfrowania i hasłami w GNOME Keyring. Część gnome-extra.\n\n- scrypt — Narzędzie do szyfrowania z wiersza poleceń wykorzystujące funkcję wyprowadzania klucza scrypt, która jest odporna na uszkodzenia pamięci.\n\n- sq — Interfejs konsolowy dla biblioteki Sequoia, implementacji OpenPGP\n\n- sqop — Implementacja Intefejsu Stateless OpenPGP na podstawie biblioteki Sequoia\n\n- steghide — Narzędzie steganograficzne umożliwiające ukrywanie danych w różnego rodzaju plikach graficznych i dźwiękowych.\n\n- stegcloak — Narzędzie steganograficzne CLI do ukrywania zaszyfrowanych wiadomości w zwykłym tekście przy użyciu niewidocznych znaków i haseł\n\n"
    },
    {
      "title": "Szyfrowanie danych w spoczynku",
      "level": 3,
      "content": "Zobacz Data-at-rest encryption (Polski).\n\n"
    },
    {
      "title": "Podniesienie uprawnień",
      "level": 2,
      "content": "- doas — Przenośna wersja polecenia doas OpenBSD, znana z tego, że jest znacznie mniejsza w porównaniu do sudo, jednocześnie realizując ten sam cel uruchamiania poleceń jako root lub inny użytkownik.\n\n- pkexec(1) — Aplikacja Polkit, która umożliwia autoryzowanemu użytkownikowi uruchamianie poleceń lub interaktywnej powłoki jako inny użytkownik. Konfigurowana przy użyciu reguł Polkit.\n\n- polkit-fakesudo — Wrapper polkitu, który emuluje sudo.\n\n- su — Polecenie używane do przejęcia tożsamości innego użytkownika w systemie.\n\n- sudo — Polecenie delegujące możliwość uruchamiania poleceń jako root lub inny użytkownik przy jednoczesnym zapewnieniu ścieżki audytu.\n\n"
    }
  ]
}