{
  "title": "List of Applications/Science (Español)",
  "url": "https://wiki.archlinux.org/title/List_of_Applications/Science_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\n"
    },
    {
      "title": "Documentos científicos",
      "level": 3,
      "content": "Véase el artículo de ArchWiki sobre este asunto para obtener más información: List of applications/Documents (Español)#Documentos científicos.\n\n"
    },
    {
      "title": "Calculadoras",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of software calculators.\n\n- bc — Lenguaje de programación de cálculo numérico con precisión arbitraria.\n\n- calc — Calculadora de consola con precisión arbitraria.\n\n- Extcalc — Calculadora científica gráfica basada en Qt.\n\n- GCalctool — Calculadora científica incluida en el escritorio GNOME.\n\n- KAlgebra — Calculadora y plóter 3D incluida en KDE EDU.\n\n- KCalc — Calculadora científica incluida en el escritorio KDE.\n\n- Qalculate — Calculadora y resolución de ecuaciones con el análisis de tolerancia a fallos, el reconocimiento de constantes y unidades.\n\n- SpeedCrunch — Calculadora multiplataforma rápida, potente y altamente precisa.\n\n- xcalc — Calculadora científica para X con modos de notación polaca inversa y algebraicas.\n\n"
    },
    {
      "title": "Sistema de álgebra computacional",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of computer algebra systems.\n\n- Fermat — Sistema algebraico por ordenador que hace aritmética de enteros arbitrariamente largos y fracciones, polinomios multivariados, cálculos simbólicos, matrices sobre anillos de polinomios, gráficos, y otros cálculos numéricos.\n\n- GAP — Sistema de álgebra computacional para álgebra discreta computacional con especial énfasis en la teoría de grupos computacionales.\n\n- Mathomatic — Aplicaciones generales para el sistema de álgebra computacional escrito en C.\n\n- Maxima — Programa similar a Maple/Mathematica con un fronted basado en wxWidgets.\n\n- PARI/GP — Sistema de álgebra computacional diseñado para cálculos rápidos en la teoría de números.\n\n- Xcas — Interfaz de usuario de Giac, un sistema de álgebra computacional básica gratuita.\n\n"
    },
    {
      "title": "Ciencia o técnica computacional",
      "level": 4,
      "content": "- Ciencias de la computación: «Las ciencias de la computación o ciencias computacionales son aquellas que abarcan las bases teóricas de la información y la computación, así como su aplicación en sistemas computacionales.»\n- Técnicas de la computación:«Técnica computacional es la aplicación de los principios matemáticos e informáticos de la ciencia computacional para resolver problemas prácticos de interés industrial.»\n\nVéase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of numerical analysis software.\n\n- EngLab — Plataforma para matemáticas dotada de un lenguaje propio con una sintaxis similar a C.\n\n- FreeMat — Programa como Matlab que soportta muchas de sus funciones y cuenta con una interfaz sin código externo basada en C, C+ + y Fortran, desarrollo de algoritmos paralelos y distribuidos (a través de MPI), y capacidades de visualización 3D.\n\n- Octave — Lenguaje similar a MATLAB e interfaz para cálculos numéricos.\n\n- PyLab — Colección de módulos de Python (pyplot, numpy, etc.) que se utiliza para los cálculos científicos.\n\n- Sage — Sistema de software de matemática, que combina muchos paquetes de código abierto existentes en una interfaz de Python común. Alternativa a Magma, Maple, Mathematica y Matlab.\n\n- Scilab — Alternativa a Matlab utilizada para los cálculos numéricos. Su sintaxis no es equivalente a la de Matlab, pero puede ser fácilmente convertida.\n\n"
    },
    {
      "title": "Estadística",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of statistical packages.\n\n- JAGS (Just another Gibbs sampler) — Programa multiplataforma para el análisis de los modelos jerárquicos bayesianos utilizando el método Markov Chain Monte Carlo (MCMC).\n\n- PSPP — Implementación SPSS libre.\n\n- R — Entorno de software para computación y gráficos estadístico.\n\n- RKWard — Frontend para el lenguaje estadístico R.\n\n"
    },
    {
      "title": "Evaluación de datos",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: List of information graphics software.\n\n- Fityk — Aplicación de análisis de datos y ajustes de curvas principalmente utilizada para ajustes analíticos, con funciones en forma de campana para los datos experimentales.\n\n- Gnuplot — Programa en línea de órdenes que genera plóteres de funciones en 2D y3D, datos y ajuste de datos.\n\n- Grace — Herramienta WYSIWYG para el trazado gráfico en 2D.\n\n- LabPlot — Software libre de análisis de datos y aplicación de visualización, similar a SciDAVis.\n\n- ROOT — Programa de análisis de datos y biblioteca (originalmente para la física de partículas), desarrollado por el CERN.\n\nVéase también el apartado: Hojas de cálculo\n\n"
    },
    {
      "title": "Biología computacional y bioinformática",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: List of open source bioinformatics software.\n\n- BALL (Biochemical Algorithms Library) — Marco de aplicaciones en C++ que proporciona un amplio conjunto de estructuras de datos, como clases para mecánicas moleculares, métodos avanzados de solvatación, comparación y análisis de estructuras de proteínas, importación/exportación de archivos, y visualización.\n\n- BioJava — Conjunto de herramientas de Java para la biología computacional, así como para la bioinformática.\n\n- Biopython — Paquete de Python con herramientas para biología computacional y bioinformática.\n\n- EMBOSS (European Molecular Biology Open Software Suite) — Paquete de código abierto de análisis, especialmente desarrollado para las necesidades de la comunidad de usuarios de biología molecular y bioinformática.\n\n- MEGA (Molecular Evolutionary Genetics Analysis) — Herramienta integrada para realizar secuencias de alineación manual y automática, inferir árboles filogenéticos, escanear bases de datos online, tasar estimación de evolución molecular, deducir secuencias ancestrales, y probar hipótesis evolutivas.\n\n- MUMmer — Sistema de software de bioinformática para el alineamiento de secuencias basado en árboles de sufijos.\n\n- UGENE — Aplicación que integra decenas de herramientas sobre biología y algoritmos conocidos, proporcionando tanto una interfaz gráfica de usuario como en línea de órdenes.\n\n"
    },
    {
      "title": "Visores moleculares",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: List of molecular graphics systems.\n\n- Avogadro — Editor, visor y simulador de estructuras moleculares en 3D (también admite la descarga de archivos desde el Protein Data Bank).\n\n- BALLView — Modelador molecular independiente y aplicación de visualización, parte del marco BALL.\n\n- Ghemical — Paquete de software de química computacional utilizado para editar, visualizar y simular estructuras moleculares.\n\n- PyMOL — Sistema de visualización molecular de código abierto que puede producir imágenes 3D de alta calidad de moléculas pequeñas y macromoléculas biológicas, como las proteínas.\n\n"
    },
    {
      "title": "Gráficos moleculares",
      "level": 4,
      "content": "- Chemtool — Programa basado en GTK+ para la elaboración de fórmulas estructurales químicas.\n\n- EasyChem — Sencillo programa de dibujo de fórmula esqueletal de moléculas, enfocado en la producción de figuras con calidad de impresión.\n\n- Gabedit — Interfaz gráfica de usuario para paquetes de química computacional tales como GAMESS, Gaussian, MOLCAS, MOLPRO, MPQC, OpenMopac, Firefly (anteriormente PC GAMESS) y Q-Chem.\n\n- XDrawChem — Programa extensible de dibujo de fórmulas esqueletales de moléculas (incluye predicción de espectroscopia).\n\n"
    },
    {
      "title": "Tabla periódica",
      "level": 4,
      "content": "- gElemental — Tabla periódica de los elementos con información adicional.\n\n- Kalzium — Tabla periódica de los elementos con editor de moléculas y resolución de ecuaciones del escritorio KDE.\n\n"
    },
    {
      "title": "Bioquímica",
      "level": 4,
      "content": "- Bioclipse — Plataforma visual basada en Java para bioquímica, que utiliza el cliente Eclipse Rich Client Platform (RCP).\n\n"
    },
    {
      "title": "Modelado molecular",
      "level": 4,
      "content": "- GROMACS (GROningen MAchine for Chemical Simulations) — Paquete versátil para representar dinámicas moleculares, es decir, simular ecuaciones newtonianas del movimiento para sistemas con cientos de millones de partículas.\n\n- Quantum ESPRESSO — Suite integrada de aplicaciones para cálculos de estructura electrónica y de modelado de materiales a nanoescala. Se basa en la teoría del funcional densidad, ondas planas y pseudopotenciales (tanto potenciales norm-conserving como ultrasoft).\n\n"
    },
    {
      "title": "Manipulación de imágenes",
      "level": 4,
      "content": "- ImageJ — Programa de procesamiento de imágenes y análisis basado en Java que proporciona extensibilidad a través de plugins y macros. Es ampliamente utilizado en microscopía (por ejemplo, para el recuento de células).\n\n- Fiji — Distribución ImageJ (y pronto ImageJ2) con una gran cantidad de plugins organizados en una estructura de menú coherente.\n\n"
    },
    {
      "title": "Astronomía",
      "level": 3,
      "content": "- Celestia — Programa de simulación de astronomía en 3D, que permite a los usuarios viajar a través de un universo amplio, moldeando después la realidad, a cualquier velocidad, en cualquier dirección y en cualquier momento de la historia.\n\n- GIMP Astronomy Plugins — Conjunto de plugins de GIMP para el procesamiento de imágenes astronómicas.\n\n- GoQat — Software de control de cámara, especialmente para las cámaras QSI, que ofrece otras características como autoguiado, ayuda de focalización y otras.\n\n- KStars — Aplicación de planetario que proporciona una simulación gráfica precisa del cielo nocturno, desde cualquier lugar de la Tierra, en cualquier fecha y hora. Se incluye en KDE Edu.\n\n- Skychart / Cartes du Ciel — Planetarium que mapea y etiqueta la mayoría de las constelaciones, planetas y objetos que se pueden ver con un telescopio. También puede descargar gráficos digitalizados de Sky Survey y superponer imágenes sobre estos mapas.\n\n- StarPlot — Visor de mapa de las estrellas en 3 dimensiones.\n\n- Stellarium — Hermoso planetario en 3D que utiliza OpenGL para representar un cielo realista en tiempo real .\n\n- XEphem — Programa de planetario y efemérides basado en Motif.\n\n"
    },
    {
      "title": "Electrónica",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of EDA software.\n\n- gEDA — Suite completa y conjunto de herramientas de Electronic Design Automation (automatización de diseño electrónico) que se utilizan para el diseño de circuitos eléctricos, captura esquemática, simulación, prototipos y producción.\n\n- KiCAD — Suite de software de automatización de diseño electrónico (siglas en inglés EDA) que facilita el diseño de esquemas de circuitos electrónicos y su conversión a la PCB (tarjeta de circuito impreso).\n\n- KTechLab — IDE para el diseño de circuitos electrónicos y microcontroladores PIC y su simulación con un extenso diseñador de circuitos, con trazado automático y con simulación de todos los componentes electrónicos comunes y elementos lógicos.\n\n- Oregano — Aplicación de software gráfico de simulación y captura de esquemas de circuitos eléctricos. La simulación real se realiza por los motores ngspice o Gnucap.\n\n- QElectroTech — Aplicación utilizada para dibujar circuitos eléctricos avanzados.\n\n- Qucs — Aplicación de simulación de circuitos electrónicos que tiene la capacidad de crear un circuito con una interfaz gráfica de usuario y simular su señal larga, la señal pequeña y el comportamiento del ruido.\n\n"
    },
    {
      "title": "Simulación física",
      "level": 4,
      "content": "- Code_Aster — Paquete de software para el análisis de ingeniería civil y estructural de elementos finitos y simulación numérica en mecánica estructural.\n\n- Step — Motor de simulación física de dos dimensiones que se incluye en el escritorio KDE como parte de KDE Edu.\n\n"
    },
    {
      "title": "Conversión de unidades",
      "level": 4,
      "content": "- ConvertAll — Aplicación de conversión de unidad que permite combinar unidades de cualquier forma (por ejemplo, centímetros por decenios), incluso si no tiene sentido.\n\n- Gonvert — Utilidad de la conversión que permite la conversión entre cualesquiera unidades tales como CGS, Ancient, Imperial con numerosas categorías, como la longitud, la masa, números, etc.\n\n- Units — Conversor de unidad en línea de órdenes y una calculadora que puede manejar los cambios de escala multiplicativo, conversiones no lineales como Fahrenheit a Celsius o calibre del cable y otros.\n\n"
    }
  ]
}