{
  "title": "List of Applications (日本語)",
  "url": "https://wiki.archlinux.org/title/List_of_Applications_(%E6%97%A5%E6%9C%AC%E8%AA%9E)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "インターネット – マルチメディア – ユーティリティ – ドキュメント – セキュリティ – サイエンス – その他\n\n関連記事\n\n- Core Utilities\n- ゲーム一覧\n\nこの記事はカテゴリによってソートされたアプリケーションの一覧です。多くのセクションでアプリケーションはコンソールとグラフィカルに分けられています。\n\n- このページは複数カテゴリにわたって検索するのを楽にするために存在しています。上から順に眺めていくのならサブカテゴリの分割ページのリンクを使って下さい。\n- pkgstats パッケージをインストールすることで、インストールしたパッケージの一覧（と使っているアーキテクチャ・ミラー）を送信するタイマーが作成され、Arch Linux の開発者がどの部分に優先的に力を入れればいいのかを決める助けになります。情報は匿名で送信されあなたを特定することはできないようになっています。Statistics ページで集められたデータを見ることができます。詳しくは こちらのスレッド を見てください。\n- デーモンパッケージには大抵の場合、起動するための systemd ユニットファイルが含まれています。パッケージによっては複数のユニットファイルが入っていることもあります。パッケージをインストールしてから pacman -Qql package | grep -Fe .service -e .socket を実行すればユニットを確認できます。\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 インターネット 1.1 ネットワーク接続 1.1.1 ネットワーク管理 1.1.2 VPN クライアント 1.1.3 プロキシサーバー 1.1.4 匿名化ネットワーク 1.2 ウェブブラウザ 1.2.1 コンソール 1.2.2 グラフィカル 1.2.2.1 Gecko ベース 1.2.2.1.1 Firefox スピンオフ 1.2.2.2 Blink ベース 1.2.2.2.1 プライバシー重視の chromium 派生版 1.2.2.2.2 プロプライエタリな chromium の派生版 1.2.2.2.3 qt5-webengine ベース 1.2.2.2.4 electron ベースのブラウザ 1.2.2.3 WebKit ベース 1.2.2.3.1 webkit2gtk ベース 1.2.2.3.2 qt5-webkit ベース 1.2.2.4 その他 1.2.3 Gemini ブラウザ 1.3 ウェブサーバー 1.3.1 静的ウェブサーバー 1.3.2 特化したウェブサーバー 1.3.3 WSGI サーバー 1.3.4 パフォーマンステスト 1.4 ファイル共有 1.4.1 ダウンロードマネージャ 1.4.1.1 コンソール 1.4.1.2 グラフィカル 1.4.2 LAN ファイル転送 1.4.3 クラウドストレージサーバー 1.4.4 クラウド同期クライアント 1.4.4.1 マルチプロトコルクライアント 1.4.4.2 Google Drive クライアント 1.4.4.3 他の同期クライアント 1.4.5 FTP 1.4.5.1 FTP クライアント 1.4.5.2 FTP サーバー 1.4.6 BitTorrent クライアント 1.4.6.1 コンソール 1.4.6.2 グラフィカルインターフェイス 1.4.7 他の P2P ネットワーク 1.4.8 Pastebin サービス 1.4.8.1 専用クライアントなし 1.4.8.2 専用クライアント 1.5 コミュニケーション 1.5.1 電子メールクライアント 1.5.1.1 コンソール 1.5.1.2 グラフィカル 1.5.1.3 Web ベース 1.5.2 メール通知 1.5.3 メールサーバー 1.5.4 メール取得エージェント 1.5.5 インスタントメッセージクライアント 1.5.5.1 マルチプロトコルクライアント 1.5.5.1.1 コンソール 1.5.5.1.2 グラフィカル 1.5.5.2 IRC クライアント 1.5.5.2.1 コンソール 1.5.5.2.2 グラフィカル 1.5.5.3 XMPP クライアント 1.5.5.3.1 コンソール 1.5.5.3.2 グラフィカル 1.5.5.4 SIP クライアント 1.5.5.5 Matrix クライアント 1.5.5.6 Tox クライアント 1.5.5.7 LAN メッセンジャー 1.5.5.8 P2P メッセージングクライアント 1.5.5.9 その他 IM クライアント 1.5.6 インスタントメッセージングサーバー 1.5.6.1 IRC サーバー 1.5.6.2 XMPP サーバー 1.5.6.3 SIP サーバー 1.5.6.4 他の IM サーバー 1.5.7 コラボレーティブソフトウェア 1.6 ニュース・RSS・ブログ 1.6.1 フィードリーダー 1.6.1.1 コンソール 1.6.1.2 グラフィカル 1.6.2 ポッドキャストクライアント 1.6.2.1 コンソール 1.6.2.2 グラフィカル 1.6.3 Usenet ニュースリーダー 1.6.3.1 コンソール 1.6.3.2 グラフィカル 1.6.4 マイクロブログクライアント 1.6.4.1 コンソール 1.6.4.2 グラフィカル 1.6.5 ブログソフトウェア 1.6.6 静的サイトジェネレーター 1.7 リモートデスクトップ 1.7.1 リモートデスクトップクライアント 1.7.2 リモートデスクトップサーバー\n- 2 マルチメディア 2.1 コーデック 2.2 画像 2.2.1 画像ビューア 2.2.1.1 フレームバッファ画像ビューアー 2.2.1.2 グラフィカル画像ビューアー 2.2.2 画像管理ソフト 2.2.3 画像処理 2.2.3.1 画像圧縮 2.2.3.1.1 コンソール 2.2.3.1.2 グラフィカル 2.2.4 ラスタ画像エディタ 2.2.5 専門的な画像エディター 2.2.6 画像のジオタグ付与 2.2.7 ベクタ画像エディタ 2.2.8 フォントエディタ 2.2.9 2D アニメーション 2.2.10 3D コンピューターグラフィックス 2.2.11 カラーピッカーとパレット 2.2.12 スクリーンキャプチャ 2.2.13 デジタルカメラ管理 2.3 音声 2.3.1 オーディオシステム 2.3.2 オーディオプレイヤー 2.3.2.1 サーバー 2.3.2.2 コンソール 2.3.2.3 グラフィカル 2.3.2.3.1 GStreamer ベース 2.3.2.3.2 Phonon ベース 2.3.2.3.3 その他 2.3.3 インターネットラジオ再生ソフト 2.3.4 音楽ストリーミングクライアント 2.3.5 オーディオタグエディタ 2.3.5.1 コンソール 2.3.5.2 グラフィカル 2.3.6 歌詞 2.3.6.1 歌詞プレーヤー 2.3.6.2 歌詞ダウンローダー 2.3.6.3 歌詞エディター 2.3.7 オーディオコンバーター 2.3.8 サウンド編集 2.3.9 デジタル・オーディオ・ワークステーション 2.3.10 オーディオアナライザー 2.3.11 楽譜作成ソフトウェア 2.3.12 オーディオ合成環境 2.3.13 サウンドジェネレーター 2.3.14 音楽トラッカー 2.3.15 DJ 2.3.16 オーディオエフェクト 2.3.17 Audio visualizers 2.3.18 Remote audio 2.3.19 音量調整 2.3.20 CD リッピング 2.4 動画 2.4.1 ビデオプレーヤー 2.4.1.1 コンソール 2.4.1.2 グラフィカル 2.4.1.2.1 GStreamer-based 2.4.1.2.2 mpv-based 2.4.1.2.3 MPlayer-based 2.4.1.2.4 Phonon-based 2.4.1.2.5 Other 2.4.2 Video converters 2.4.2.1 Console 2.4.2.2 Graphical 2.4.3 ビデオエディタ 2.4.4 Subtitles 2.4.4.1 Subtitle players 2.4.4.2 Subtitle downloaders 2.4.4.3 Subtitle editors 2.4.5 スクリーンキャスト 2.4.6 Miracast 2.4.7 ウェブカメラ 2.4.8 DVD authoring 2.4.9 DVD リッピング 2.4.10 Video thumbnails 2.5 Game and interactive application development 2.6 Collection managers 2.7 Media servers 2.8 メタデータ 2.9 Mobile device managers 2.10 光メディアの書き込み\n- 3 ユーティリティ 3.1 Terminal 3.1.1 コマンドシェル 3.1.2 ターミナルエミュレータ 3.1.2.1 VTE ベース 3.1.2.2 KMS ベース 3.1.2.3 フレームバッファベース 3.1.3 ターミナルページャ 3.1.4 ターミナルマルチプレクサ 3.2 ファイル 3.2.1 ファイルマネージャ 3.2.1.1 コンソール 3.2.1.2 グラフィカル 3.2.1.2.1 Twin-panel 3.2.2 ゴミ箱管理 3.2.3 ファイル同期とバックアップ 3.2.4 Archiving and compression tools 3.2.4.1 Archive managers 3.2.5 Comparison, diff, merge 3.2.5.1 Console 3.2.5.2 Graphical 3.2.6 バッチ処理リネームプログラム 3.2.6.1 Console 3.2.6.2 Graphical 3.2.7 ファイル検索 3.2.7.1 Console 3.2.7.2 Graphical 3.2.7.2.1 File indexers 3.2.8 Full-text searching 3.2.8.1 Full-text indexers 3.3 Development 3.3.1 Code forges 3.3.1.1 Code forge clients 3.3.2 バージョン管理システム 3.3.3 ビルド自動化 3.3.4 統合開発環境 3.3.4.1 Java IDEs 3.3.4.2 Python IDEs 3.3.4.3 Rust IDEs 3.3.4.4 Educational IDEs 3.3.5 Debuggers 3.3.6 Lexing and parsing 3.3.7 GUI builders 3.3.8 Hex editors 3.3.9 JSON tools 3.3.10 Literate programming 3.3.11 UML modelers 3.3.12 API documentation browsers 3.3.13 課題追跡システム 3.3.14 コードレビュー 3.3.15 ゲーム開発 3.3.16 Repository managers 3.4 Text input 3.4.1 Character selectors 3.4.2 スクリーンキーボード 3.4.3 キーボードレイアウトの切り替え 3.4.4 Keybinding managers 3.4.5 インプットメソッド 3.5 Disks 3.5.1 パーティション分割ツール 3.5.2 Formatting tools 3.5.3 Cloning tools 3.5.4 マウントツール 3.5.5 ディスク使用量表示プログラム 3.5.5.1 Console 3.5.5.2 Graphical 3.5.6 Disk health status 3.5.7 File recovery tools 3.5.8 Disk cleaning 3.5.8.1 Console 3.5.8.2 Graphical 3.5.9 Disk image writing 3.6 System 3.6.1 タスクマネージャ 3.6.2 システム監視 3.6.3 Hardware sensor monitoring 3.6.4 システム情報ビューア 3.6.4.1 コンソール 3.6.4.2 グラフィカル 3.6.5 System log viewers 3.6.6 Font viewers 3.6.7 Help viewers 3.6.8 Command schedulers 3.6.9 Shutdown timers 3.6.10 時刻同期 3.6.11 Screen management 3.6.12 Backlight management 3.6.13 Color management 3.6.14 Printer management 3.6.15 Bluetooth management 3.6.16 電源管理 3.6.17 System management 3.6.18 Boot management 3.6.19 パッケージ管理 3.6.20 Virtualization 3.6.21 Compatibility layers\n- 4 ドキュメントとテキスト 4.1 テキストエディタ 4.1.1 Vi-style text editors 4.1.2 Emacs-style text editors 4.1.3 コンソール 4.1.4 グラフィカル 4.2 Office 4.2.1 Office suites 4.2.2 ワードプロセッサ 4.2.2.1 WYSIWYG HTML エディタ 4.2.2.2 Desktop publishing 4.2.3 Presentations 4.2.4 スプレッドシート 4.2.5 データベースツール 4.2.5.1 簡易データベースソフトウェア 4.2.6 Formula editors 4.3 マークアップ言語 4.3.1 AsciiDoc 4.3.2 Markdown 4.3.2.1 Python 実装 4.3.2.2 Ruby 実装 4.3.2.3 Markdown エディタ 4.3.3 組版システム 4.3.4 TeX エディタ 4.3.5 TeX 数式エディタ 4.3.6 XML エディタ 4.4 Document converters 4.5 参照文献マネージャ 4.6 文章リーダー・ビューア 4.6.1 PDF と DjVu 4.6.2 電子書籍 4.6.3 漫画ビューア 4.6.4 CHM 4.7 Document managers 4.8 スキャニングソフトウェア 4.9 OCR ソフトウェア 4.9.1 Console 4.9.2 Graphical 4.10 Notes 4.10.1 メモ管理 4.10.1.1 コンソール 4.10.1.2 グラフィカル 4.10.2 手書きメモ 4.10.3 Diary 4.10.4 マインドマップツール 4.10.5 Sticky notes 4.11 Special writing environments 4.11.1 Distraction-free writing 4.11.2 Story writing 4.11.3 Screenwriting 4.12 Language 4.12.1 Dictionary and thesaurus 4.12.1.1 Console 4.12.1.2 Graphical 4.12.2 Spell checkers 4.12.3 翻訳・地域化 4.13 バーコードジェネレータ・リーダー 4.13.1 コンソール 4.13.2 グラフィカル\n- 5 セキュリティ 5.1 ネットワークセキュリティ 5.2 ファイアウォール 5.3 脅威と脆弱性保護 5.4 ファイルセキュリティ 5.5 アンチマルウェア 5.6 スクリーンロック 5.7 Password auditing 5.8 パスワードマネージャ 5.8.1 Console 5.8.2 Graphical 5.9 Cryptography 5.9.1 ハッシュチェッカー 5.9.2 暗号化, 署名, ステガノグラフィー 5.9.3 Data-at-rest encryption 5.10 管理者権限\n- 6 サイエンス 6.1 数学 6.1.1 電卓 6.1.1.1 Console 6.1.1.2 Graphical 6.1.2 数式処理システム 6.1.3 Visualization of networks/graphs 6.1.4 科学技術計算 6.1.5 統計学 6.1.6 データ評価とプロット 6.1.7 証明支援システム 6.2 物理学 6.2.1 物理シミュレーション 6.2.2 単位変換 6.3 化学 6.3.1 分子構造 6.3.1.1 ビューア 6.3.1.2 ドローイング 6.3.1.3 モデリング 6.3.2 周期表 6.4 地球科学 6.4.1 地理学 6.4.2 気象学 6.5 天文学 6.6 生物学 6.6.1 計算生物学とバイオインフォマティクス 6.6.2 Genealogy 6.6.3 画像処理 6.6.4 DICOM ビューアとボリュームレンダリング 6.7 工学 6.7.1 コンピュータ支援設計 6.7.2 電子工学 6.7.2.1 デジタル論理 6.7.2.2 HDL 6.7.2.3 MCU IDE とプログラマ 6.7.2.4 Electronic circuit simulation and schematic capture editing 6.7.2.5 Electronic design and schematic capture editing 6.8 遠距離通信 6.8.1 アマチュア無線 6.9 シミュレーションモデリング 6.10 計算機科学 6.10.1 人工知能 6.10.2 Photogrammetry\n- 7 その他 7.1 Organization 7.1.1 Personal information managers 7.1.2 Time management 7.1.2.1 コンソール 7.1.2.2 グラフィカル 7.1.3 Timers 7.1.3.1 Countdown timers and stopwatch 7.1.3.2 Break timers 7.1.3.3 Pomodoro timers 7.1.4 Time trackers 7.1.5 Task management 7.1.5.1 コンソール 7.1.5.2 グラフィカル 7.1.6 Contacts management 7.1.6.1 Console 7.1.6.2 Graphical 7.1.7 ファイナンス 7.1.7.1 Console 7.1.7.2 Graphical 7.1.8 暗号通貨 7.1.9 プロジェクト管理 7.1.10 レシピ管理 7.2 教育 7.2.1 フラッシュカード 7.2.2 タッチタイピング 7.2.2.1 コンソール 7.2.2.2 グラフィカル 7.3 アクセシビリティ 7.3.1 Speech synthesizers 7.3.2 音声認識 7.3.3 Screen magnifiers 7.3.4 On-screen annotation 7.3.5 マウス 7.4 Display managers 7.5 デスクトップ環境 7.5.1 ウィンドウマネージャ 7.5.1.1 コンソール 7.5.1.2 グラフィカル 7.5.1.3 コンポジットマネージャ 7.5.2 Wayland Compositors 7.5.3 ウィンドウタイル 7.5.4 タスクバー 7.5.5 System tray 7.5.6 アプリケーションランチャー 7.5.7 アプリケーションメニューエディタ 7.5.8 壁紙設定 7.5.9 仮想デスクトップのページャ 7.5.10 デスクトップウィジェット 7.5.11 デスクトップ通知 7.5.12 クリップボードマネージャ 7.5.13 ログアウト UI\n- 8 参照\n\n- 1.1 ネットワーク接続 1.1.1 ネットワーク管理 1.1.2 VPN クライアント 1.1.3 プロキシサーバー 1.1.4 匿名化ネットワーク\n- 1.2 ウェブブラウザ 1.2.1 コンソール 1.2.2 グラフィカル 1.2.2.1 Gecko ベース 1.2.2.1.1 Firefox スピンオフ 1.2.2.2 Blink ベース 1.2.2.2.1 プライバシー重視の chromium 派生版 1.2.2.2.2 プロプライエタリな chromium の派生版 1.2.2.2.3 qt5-webengine ベース 1.2.2.2.4 electron ベースのブラウザ 1.2.2.3 WebKit ベース 1.2.2.3.1 webkit2gtk ベース 1.2.2.3.2 qt5-webkit ベース 1.2.2.4 その他 1.2.3 Gemini ブラウザ\n- 1.3 ウェブサーバー 1.3.1 静的ウェブサーバー 1.3.2 特化したウェブサーバー 1.3.3 WSGI サーバー 1.3.4 パフォーマンステスト\n- 1.4 ファイル共有 1.4.1 ダウンロードマネージャ 1.4.1.1 コンソール 1.4.1.2 グラフィカル 1.4.2 LAN ファイル転送 1.4.3 クラウドストレージサーバー 1.4.4 クラウド同期クライアント 1.4.4.1 マルチプロトコルクライアント 1.4.4.2 Google Drive クライアント 1.4.4.3 他の同期クライアント 1.4.5 FTP 1.4.5.1 FTP クライアント 1.4.5.2 FTP サーバー 1.4.6 BitTorrent クライアント 1.4.6.1 コンソール 1.4.6.2 グラフィカルインターフェイス 1.4.7 他の P2P ネットワーク 1.4.8 Pastebin サービス 1.4.8.1 専用クライアントなし 1.4.8.2 専用クライアント\n- 1.5 コミュニケーション 1.5.1 電子メールクライアント 1.5.1.1 コンソール 1.5.1.2 グラフィカル 1.5.1.3 Web ベース 1.5.2 メール通知 1.5.3 メールサーバー 1.5.4 メール取得エージェント 1.5.5 インスタントメッセージクライアント 1.5.5.1 マルチプロトコルクライアント 1.5.5.1.1 コンソール 1.5.5.1.2 グラフィカル 1.5.5.2 IRC クライアント 1.5.5.2.1 コンソール 1.5.5.2.2 グラフィカル 1.5.5.3 XMPP クライアント 1.5.5.3.1 コンソール 1.5.5.3.2 グラフィカル 1.5.5.4 SIP クライアント 1.5.5.5 Matrix クライアント 1.5.5.6 Tox クライアント 1.5.5.7 LAN メッセンジャー 1.5.5.8 P2P メッセージングクライアント 1.5.5.9 その他 IM クライアント 1.5.6 インスタントメッセージングサーバー 1.5.6.1 IRC サーバー 1.5.6.2 XMPP サーバー 1.5.6.3 SIP サーバー 1.5.6.4 他の IM サーバー 1.5.7 コラボレーティブソフトウェア\n- 1.6 ニュース・RSS・ブログ 1.6.1 フィードリーダー 1.6.1.1 コンソール 1.6.1.2 グラフィカル 1.6.2 ポッドキャストクライアント 1.6.2.1 コンソール 1.6.2.2 グラフィカル 1.6.3 Usenet ニュースリーダー 1.6.3.1 コンソール 1.6.3.2 グラフィカル 1.6.4 マイクロブログクライアント 1.6.4.1 コンソール 1.6.4.2 グラフィカル 1.6.5 ブログソフトウェア 1.6.6 静的サイトジェネレーター\n- 1.7 リモートデスクトップ 1.7.1 リモートデスクトップクライアント 1.7.2 リモートデスクトップサーバー\n\n- 1.1.1 ネットワーク管理\n- 1.1.2 VPN クライアント\n- 1.1.3 プロキシサーバー\n- 1.1.4 匿名化ネットワーク\n\n- 1.2.1 コンソール\n- 1.2.2 グラフィカル 1.2.2.1 Gecko ベース 1.2.2.1.1 Firefox スピンオフ 1.2.2.2 Blink ベース 1.2.2.2.1 プライバシー重視の chromium 派生版 1.2.2.2.2 プロプライエタリな chromium の派生版 1.2.2.2.3 qt5-webengine ベース 1.2.2.2.4 electron ベースのブラウザ 1.2.2.3 WebKit ベース 1.2.2.3.1 webkit2gtk ベース 1.2.2.3.2 qt5-webkit ベース 1.2.2.4 その他\n- 1.2.3 Gemini ブラウザ\n\n- 1.2.2.1 Gecko ベース 1.2.2.1.1 Firefox スピンオフ\n- 1.2.2.2 Blink ベース 1.2.2.2.1 プライバシー重視の chromium 派生版 1.2.2.2.2 プロプライエタリな chromium の派生版 1.2.2.2.3 qt5-webengine ベース 1.2.2.2.4 electron ベースのブラウザ\n- 1.2.2.3 WebKit ベース 1.2.2.3.1 webkit2gtk ベース 1.2.2.3.2 qt5-webkit ベース\n- 1.2.2.4 その他\n\n- 1.2.2.1.1 Firefox スピンオフ\n\n- 1.2.2.2.1 プライバシー重視の chromium 派生版\n- 1.2.2.2.2 プロプライエタリな chromium の派生版\n- 1.2.2.2.3 qt5-webengine ベース\n- 1.2.2.2.4 electron ベースのブラウザ\n\n- 1.2.2.3.1 webkit2gtk ベース\n- 1.2.2.3.2 qt5-webkit ベース\n\n- 1.3.1 静的ウェブサーバー\n- 1.3.2 特化したウェブサーバー\n- 1.3.3 WSGI サーバー\n- 1.3.4 パフォーマンステスト\n\n- 1.4.1 ダウンロードマネージャ 1.4.1.1 コンソール 1.4.1.2 グラフィカル\n- 1.4.2 LAN ファイル転送\n- 1.4.3 クラウドストレージサーバー\n- 1.4.4 クラウド同期クライアント 1.4.4.1 マルチプロトコルクライアント 1.4.4.2 Google Drive クライアント 1.4.4.3 他の同期クライアント\n- 1.4.5 FTP 1.4.5.1 FTP クライアント 1.4.5.2 FTP サーバー\n- 1.4.6 BitTorrent クライアント 1.4.6.1 コンソール 1.4.6.2 グラフィカルインターフェイス\n- 1.4.7 他の P2P ネットワーク\n- 1.4.8 Pastebin サービス 1.4.8.1 専用クライアントなし 1.4.8.2 専用クライアント\n\n- 1.4.1.1 コンソール\n- 1.4.1.2 グラフィカル\n\n- 1.4.4.1 マルチプロトコルクライアント\n- 1.4.4.2 Google Drive クライアント\n- 1.4.4.3 他の同期クライアント\n\n- 1.4.5.1 FTP クライアント\n- 1.4.5.2 FTP サーバー\n\n- 1.4.6.1 コンソール\n- 1.4.6.2 グラフィカルインターフェイス\n\n- 1.4.8.1 専用クライアントなし\n- 1.4.8.2 専用クライアント\n\n- 1.5.1 電子メールクライアント 1.5.1.1 コンソール 1.5.1.2 グラフィカル 1.5.1.3 Web ベース\n- 1.5.2 メール通知\n- 1.5.3 メールサーバー\n- 1.5.4 メール取得エージェント\n- 1.5.5 インスタントメッセージクライアント 1.5.5.1 マルチプロトコルクライアント 1.5.5.1.1 コンソール 1.5.5.1.2 グラフィカル 1.5.5.2 IRC クライアント 1.5.5.2.1 コンソール 1.5.5.2.2 グラフィカル 1.5.5.3 XMPP クライアント 1.5.5.3.1 コンソール 1.5.5.3.2 グラフィカル 1.5.5.4 SIP クライアント 1.5.5.5 Matrix クライアント 1.5.5.6 Tox クライアント 1.5.5.7 LAN メッセンジャー 1.5.5.8 P2P メッセージングクライアント 1.5.5.9 その他 IM クライアント\n- 1.5.6 インスタントメッセージングサーバー 1.5.6.1 IRC サーバー 1.5.6.2 XMPP サーバー 1.5.6.3 SIP サーバー 1.5.6.4 他の IM サーバー\n- 1.5.7 コラボレーティブソフトウェア\n\n- 1.5.1.1 コンソール\n- 1.5.1.2 グラフィカル\n- 1.5.1.3 Web ベース\n\n- 1.5.5.1 マルチプロトコルクライアント 1.5.5.1.1 コンソール 1.5.5.1.2 グラフィカル\n- 1.5.5.2 IRC クライアント 1.5.5.2.1 コンソール 1.5.5.2.2 グラフィカル\n- 1.5.5.3 XMPP クライアント 1.5.5.3.1 コンソール 1.5.5.3.2 グラフィカル\n- 1.5.5.4 SIP クライアント\n- 1.5.5.5 Matrix クライアント\n- 1.5.5.6 Tox クライアント\n- 1.5.5.7 LAN メッセンジャー\n- 1.5.5.8 P2P メッセージングクライアント\n- 1.5.5.9 その他 IM クライアント\n\n- 1.5.5.1.1 コンソール\n- 1.5.5.1.2 グラフィカル\n\n- 1.5.5.2.1 コンソール\n- 1.5.5.2.2 グラフィカル\n\n- 1.5.5.3.1 コンソール\n- 1.5.5.3.2 グラフィカル\n\n- 1.5.6.1 IRC サーバー\n- 1.5.6.2 XMPP サーバー\n- 1.5.6.3 SIP サーバー\n- 1.5.6.4 他の IM サーバー\n\n- 1.6.1 フィードリーダー 1.6.1.1 コンソール 1.6.1.2 グラフィカル\n- 1.6.2 ポッドキャストクライアント 1.6.2.1 コンソール 1.6.2.2 グラフィカル\n- 1.6.3 Usenet ニュースリーダー 1.6.3.1 コンソール 1.6.3.2 グラフィカル\n- 1.6.4 マイクロブログクライアント 1.6.4.1 コンソール 1.6.4.2 グラフィカル\n- 1.6.5 ブログソフトウェア\n- 1.6.6 静的サイトジェネレーター\n\n- 1.6.1.1 コンソール\n- 1.6.1.2 グラフィカル\n\n- 1.6.2.1 コンソール\n- 1.6.2.2 グラフィカル\n\n- 1.6.3.1 コンソール\n- 1.6.3.2 グラフィカル\n\n- 1.6.4.1 コンソール\n- 1.6.4.2 グラフィカル\n\n- 1.7.1 リモートデスクトップクライアント\n- 1.7.2 リモートデスクトップサーバー\n\n- 2.1 コーデック\n- 2.2 画像 2.2.1 画像ビューア 2.2.1.1 フレームバッファ画像ビューアー 2.2.1.2 グラフィカル画像ビューアー 2.2.2 画像管理ソフト 2.2.3 画像処理 2.2.3.1 画像圧縮 2.2.3.1.1 コンソール 2.2.3.1.2 グラフィカル 2.2.4 ラスタ画像エディタ 2.2.5 専門的な画像エディター 2.2.6 画像のジオタグ付与 2.2.7 ベクタ画像エディタ 2.2.8 フォントエディタ 2.2.9 2D アニメーション 2.2.10 3D コンピューターグラフィックス 2.2.11 カラーピッカーとパレット 2.2.12 スクリーンキャプチャ 2.2.13 デジタルカメラ管理\n- 2.3 音声 2.3.1 オーディオシステム 2.3.2 オーディオプレイヤー 2.3.2.1 サーバー 2.3.2.2 コンソール 2.3.2.3 グラフィカル 2.3.2.3.1 GStreamer ベース 2.3.2.3.2 Phonon ベース 2.3.2.3.3 その他 2.3.3 インターネットラジオ再生ソフト 2.3.4 音楽ストリーミングクライアント 2.3.5 オーディオタグエディタ 2.3.5.1 コンソール 2.3.5.2 グラフィカル 2.3.6 歌詞 2.3.6.1 歌詞プレーヤー 2.3.6.2 歌詞ダウンローダー 2.3.6.3 歌詞エディター 2.3.7 オーディオコンバーター 2.3.8 サウンド編集 2.3.9 デジタル・オーディオ・ワークステーション 2.3.10 オーディオアナライザー 2.3.11 楽譜作成ソフトウェア 2.3.12 オーディオ合成環境 2.3.13 サウンドジェネレーター 2.3.14 音楽トラッカー 2.3.15 DJ 2.3.16 オーディオエフェクト 2.3.17 Audio visualizers 2.3.18 Remote audio 2.3.19 音量調整 2.3.20 CD リッピング\n- 2.4 動画 2.4.1 ビデオプレーヤー 2.4.1.1 コンソール 2.4.1.2 グラフィカル 2.4.1.2.1 GStreamer-based 2.4.1.2.2 mpv-based 2.4.1.2.3 MPlayer-based 2.4.1.2.4 Phonon-based 2.4.1.2.5 Other 2.4.2 Video converters 2.4.2.1 Console 2.4.2.2 Graphical 2.4.3 ビデオエディタ 2.4.4 Subtitles 2.4.4.1 Subtitle players 2.4.4.2 Subtitle downloaders 2.4.4.3 Subtitle editors 2.4.5 スクリーンキャスト 2.4.6 Miracast 2.4.7 ウェブカメラ 2.4.8 DVD authoring 2.4.9 DVD リッピング 2.4.10 Video thumbnails\n- 2.5 Game and interactive application development\n- 2.6 Collection managers\n- 2.7 Media servers\n- 2.8 メタデータ\n- 2.9 Mobile device managers\n- 2.10 光メディアの書き込み\n\n- 2.2.1 画像ビューア 2.2.1.1 フレームバッファ画像ビューアー 2.2.1.2 グラフィカル画像ビューアー\n- 2.2.2 画像管理ソフト\n- 2.2.3 画像処理 2.2.3.1 画像圧縮 2.2.3.1.1 コンソール 2.2.3.1.2 グラフィカル\n- 2.2.4 ラスタ画像エディタ\n- 2.2.5 専門的な画像エディター\n- 2.2.6 画像のジオタグ付与\n- 2.2.7 ベクタ画像エディタ\n- 2.2.8 フォントエディタ\n- 2.2.9 2D アニメーション\n- 2.2.10 3D コンピューターグラフィックス\n- 2.2.11 カラーピッカーとパレット\n- 2.2.12 スクリーンキャプチャ\n- 2.2.13 デジタルカメラ管理\n\n- 2.2.1.1 フレームバッファ画像ビューアー\n- 2.2.1.2 グラフィカル画像ビューアー\n\n- 2.2.3.1 画像圧縮 2.2.3.1.1 コンソール 2.2.3.1.2 グラフィカル\n\n- 2.2.3.1.1 コンソール\n- 2.2.3.1.2 グラフィカル\n\n- 2.3.1 オーディオシステム\n- 2.3.2 オーディオプレイヤー 2.3.2.1 サーバー 2.3.2.2 コンソール 2.3.2.3 グラフィカル 2.3.2.3.1 GStreamer ベース 2.3.2.3.2 Phonon ベース 2.3.2.3.3 その他\n- 2.3.3 インターネットラジオ再生ソフト\n- 2.3.4 音楽ストリーミングクライアント\n- 2.3.5 オーディオタグエディタ 2.3.5.1 コンソール 2.3.5.2 グラフィカル\n- 2.3.6 歌詞 2.3.6.1 歌詞プレーヤー 2.3.6.2 歌詞ダウンローダー 2.3.6.3 歌詞エディター\n- 2.3.7 オーディオコンバーター\n- 2.3.8 サウンド編集\n- 2.3.9 デジタル・オーディオ・ワークステーション\n- 2.3.10 オーディオアナライザー\n- 2.3.11 楽譜作成ソフトウェア\n- 2.3.12 オーディオ合成環境\n- 2.3.13 サウンドジェネレーター\n- 2.3.14 音楽トラッカー\n- 2.3.15 DJ\n- 2.3.16 オーディオエフェクト\n- 2.3.17 Audio visualizers\n- 2.3.18 Remote audio\n- 2.3.19 音量調整\n- 2.3.20 CD リッピング\n\n- 2.3.2.1 サーバー\n- 2.3.2.2 コンソール\n- 2.3.2.3 グラフィカル 2.3.2.3.1 GStreamer ベース 2.3.2.3.2 Phonon ベース 2.3.2.3.3 その他\n\n- 2.3.2.3.1 GStreamer ベース\n- 2.3.2.3.2 Phonon ベース\n- 2.3.2.3.3 その他\n\n- 2.3.5.1 コンソール\n- 2.3.5.2 グラフィカル\n\n- 2.3.6.1 歌詞プレーヤー\n- 2.3.6.2 歌詞ダウンローダー\n- 2.3.6.3 歌詞エディター\n\n- 2.4.1 ビデオプレーヤー 2.4.1.1 コンソール 2.4.1.2 グラフィカル 2.4.1.2.1 GStreamer-based 2.4.1.2.2 mpv-based 2.4.1.2.3 MPlayer-based 2.4.1.2.4 Phonon-based 2.4.1.2.5 Other\n- 2.4.2 Video converters 2.4.2.1 Console 2.4.2.2 Graphical\n- 2.4.3 ビデオエディタ\n- 2.4.4 Subtitles 2.4.4.1 Subtitle players 2.4.4.2 Subtitle downloaders 2.4.4.3 Subtitle editors\n- 2.4.5 スクリーンキャスト\n- 2.4.6 Miracast\n- 2.4.7 ウェブカメラ\n- 2.4.8 DVD authoring\n- 2.4.9 DVD リッピング\n- 2.4.10 Video thumbnails\n\n- 2.4.1.1 コンソール\n- 2.4.1.2 グラフィカル 2.4.1.2.1 GStreamer-based 2.4.1.2.2 mpv-based 2.4.1.2.3 MPlayer-based 2.4.1.2.4 Phonon-based 2.4.1.2.5 Other\n\n- 2.4.1.2.1 GStreamer-based\n- 2.4.1.2.2 mpv-based\n- 2.4.1.2.3 MPlayer-based\n- 2.4.1.2.4 Phonon-based\n- 2.4.1.2.5 Other\n\n- 2.4.2.1 Console\n- 2.4.2.2 Graphical\n\n- 2.4.4.1 Subtitle players\n- 2.4.4.2 Subtitle downloaders\n- 2.4.4.3 Subtitle editors\n\n- 3.1 Terminal 3.1.1 コマンドシェル 3.1.2 ターミナルエミュレータ 3.1.2.1 VTE ベース 3.1.2.2 KMS ベース 3.1.2.3 フレームバッファベース 3.1.3 ターミナルページャ 3.1.4 ターミナルマルチプレクサ\n- 3.2 ファイル 3.2.1 ファイルマネージャ 3.2.1.1 コンソール 3.2.1.2 グラフィカル 3.2.1.2.1 Twin-panel 3.2.2 ゴミ箱管理 3.2.3 ファイル同期とバックアップ 3.2.4 Archiving and compression tools 3.2.4.1 Archive managers 3.2.5 Comparison, diff, merge 3.2.5.1 Console 3.2.5.2 Graphical 3.2.6 バッチ処理リネームプログラム 3.2.6.1 Console 3.2.6.2 Graphical 3.2.7 ファイル検索 3.2.7.1 Console 3.2.7.2 Graphical 3.2.7.2.1 File indexers 3.2.8 Full-text searching 3.2.8.1 Full-text indexers\n- 3.3 Development 3.3.1 Code forges 3.3.1.1 Code forge clients 3.3.2 バージョン管理システム 3.3.3 ビルド自動化 3.3.4 統合開発環境 3.3.4.1 Java IDEs 3.3.4.2 Python IDEs 3.3.4.3 Rust IDEs 3.3.4.4 Educational IDEs 3.3.5 Debuggers 3.3.6 Lexing and parsing 3.3.7 GUI builders 3.3.8 Hex editors 3.3.9 JSON tools 3.3.10 Literate programming 3.3.11 UML modelers 3.3.12 API documentation browsers 3.3.13 課題追跡システム 3.3.14 コードレビュー 3.3.15 ゲーム開発 3.3.16 Repository managers\n- 3.4 Text input 3.4.1 Character selectors 3.4.2 スクリーンキーボード 3.4.3 キーボードレイアウトの切り替え 3.4.4 Keybinding managers 3.4.5 インプットメソッド\n- 3.5 Disks 3.5.1 パーティション分割ツール 3.5.2 Formatting tools 3.5.3 Cloning tools 3.5.4 マウントツール 3.5.5 ディスク使用量表示プログラム 3.5.5.1 Console 3.5.5.2 Graphical 3.5.6 Disk health status 3.5.7 File recovery tools 3.5.8 Disk cleaning 3.5.8.1 Console 3.5.8.2 Graphical 3.5.9 Disk image writing\n- 3.6 System 3.6.1 タスクマネージャ 3.6.2 システム監視 3.6.3 Hardware sensor monitoring 3.6.4 システム情報ビューア 3.6.4.1 コンソール 3.6.4.2 グラフィカル 3.6.5 System log viewers 3.6.6 Font viewers 3.6.7 Help viewers 3.6.8 Command schedulers 3.6.9 Shutdown timers 3.6.10 時刻同期 3.6.11 Screen management 3.6.12 Backlight management 3.6.13 Color management 3.6.14 Printer management 3.6.15 Bluetooth management 3.6.16 電源管理 3.6.17 System management 3.6.18 Boot management 3.6.19 パッケージ管理 3.6.20 Virtualization 3.6.21 Compatibility layers\n\n- 3.1.1 コマンドシェル\n- 3.1.2 ターミナルエミュレータ 3.1.2.1 VTE ベース 3.1.2.2 KMS ベース 3.1.2.3 フレームバッファベース\n- 3.1.3 ターミナルページャ\n- 3.1.4 ターミナルマルチプレクサ\n\n- 3.1.2.1 VTE ベース\n- 3.1.2.2 KMS ベース\n- 3.1.2.3 フレームバッファベース\n\n- 3.2.1 ファイルマネージャ 3.2.1.1 コンソール 3.2.1.2 グラフィカル 3.2.1.2.1 Twin-panel\n- 3.2.2 ゴミ箱管理\n- 3.2.3 ファイル同期とバックアップ\n- 3.2.4 Archiving and compression tools 3.2.4.1 Archive managers\n- 3.2.5 Comparison, diff, merge 3.2.5.1 Console 3.2.5.2 Graphical\n- 3.2.6 バッチ処理リネームプログラム 3.2.6.1 Console 3.2.6.2 Graphical\n- 3.2.7 ファイル検索 3.2.7.1 Console 3.2.7.2 Graphical 3.2.7.2.1 File indexers\n- 3.2.8 Full-text searching 3.2.8.1 Full-text indexers\n\n- 3.2.1.1 コンソール\n- 3.2.1.2 グラフィカル 3.2.1.2.1 Twin-panel\n\n- 3.2.1.2.1 Twin-panel\n\n- 3.2.4.1 Archive managers\n\n- 3.2.5.1 Console\n- 3.2.5.2 Graphical\n\n- 3.2.6.1 Console\n- 3.2.6.2 Graphical\n\n- 3.2.7.1 Console\n- 3.2.7.2 Graphical 3.2.7.2.1 File indexers\n\n- 3.2.7.2.1 File indexers\n\n- 3.2.8.1 Full-text indexers\n\n- 3.3.1 Code forges 3.3.1.1 Code forge clients\n- 3.3.2 バージョン管理システム\n- 3.3.3 ビルド自動化\n- 3.3.4 統合開発環境 3.3.4.1 Java IDEs 3.3.4.2 Python IDEs 3.3.4.3 Rust IDEs 3.3.4.4 Educational IDEs\n- 3.3.5 Debuggers\n- 3.3.6 Lexing and parsing\n- 3.3.7 GUI builders\n- 3.3.8 Hex editors\n- 3.3.9 JSON tools\n- 3.3.10 Literate programming\n- 3.3.11 UML modelers\n- 3.3.12 API documentation browsers\n- 3.3.13 課題追跡システム\n- 3.3.14 コードレビュー\n- 3.3.15 ゲーム開発\n- 3.3.16 Repository managers\n\n- 3.3.1.1 Code forge clients\n\n- 3.3.4.1 Java IDEs\n- 3.3.4.2 Python IDEs\n- 3.3.4.3 Rust IDEs\n- 3.3.4.4 Educational IDEs\n\n- 3.4.1 Character selectors\n- 3.4.2 スクリーンキーボード\n- 3.4.3 キーボードレイアウトの切り替え\n- 3.4.4 Keybinding managers\n- 3.4.5 インプットメソッド\n\n- 3.5.1 パーティション分割ツール\n- 3.5.2 Formatting tools\n- 3.5.3 Cloning tools\n- 3.5.4 マウントツール\n- 3.5.5 ディスク使用量表示プログラム 3.5.5.1 Console 3.5.5.2 Graphical\n- 3.5.6 Disk health status\n- 3.5.7 File recovery tools\n- 3.5.8 Disk cleaning 3.5.8.1 Console 3.5.8.2 Graphical\n- 3.5.9 Disk image writing\n\n- 3.5.5.1 Console\n- 3.5.5.2 Graphical\n\n- 3.5.8.1 Console\n- 3.5.8.2 Graphical\n\n- 3.6.1 タスクマネージャ\n- 3.6.2 システム監視\n- 3.6.3 Hardware sensor monitoring\n- 3.6.4 システム情報ビューア 3.6.4.1 コンソール 3.6.4.2 グラフィカル\n- 3.6.5 System log viewers\n- 3.6.6 Font viewers\n- 3.6.7 Help viewers\n- 3.6.8 Command schedulers\n- 3.6.9 Shutdown timers\n- 3.6.10 時刻同期\n- 3.6.11 Screen management\n- 3.6.12 Backlight management\n- 3.6.13 Color management\n- 3.6.14 Printer management\n- 3.6.15 Bluetooth management\n- 3.6.16 電源管理\n- 3.6.17 System management\n- 3.6.18 Boot management\n- 3.6.19 パッケージ管理\n- 3.6.20 Virtualization\n- 3.6.21 Compatibility layers\n\n- 3.6.4.1 コンソール\n- 3.6.4.2 グラフィカル\n\n- 4.1 テキストエディタ 4.1.1 Vi-style text editors 4.1.2 Emacs-style text editors 4.1.3 コンソール 4.1.4 グラフィカル\n- 4.2 Office 4.2.1 Office suites 4.2.2 ワードプロセッサ 4.2.2.1 WYSIWYG HTML エディタ 4.2.2.2 Desktop publishing 4.2.3 Presentations 4.2.4 スプレッドシート 4.2.5 データベースツール 4.2.5.1 簡易データベースソフトウェア 4.2.6 Formula editors\n- 4.3 マークアップ言語 4.3.1 AsciiDoc 4.3.2 Markdown 4.3.2.1 Python 実装 4.3.2.2 Ruby 実装 4.3.2.3 Markdown エディタ 4.3.3 組版システム 4.3.4 TeX エディタ 4.3.5 TeX 数式エディタ 4.3.6 XML エディタ\n- 4.4 Document converters\n- 4.5 参照文献マネージャ\n- 4.6 文章リーダー・ビューア 4.6.1 PDF と DjVu 4.6.2 電子書籍 4.6.3 漫画ビューア 4.6.4 CHM\n- 4.7 Document managers\n- 4.8 スキャニングソフトウェア\n- 4.9 OCR ソフトウェア 4.9.1 Console 4.9.2 Graphical\n- 4.10 Notes 4.10.1 メモ管理 4.10.1.1 コンソール 4.10.1.2 グラフィカル 4.10.2 手書きメモ 4.10.3 Diary 4.10.4 マインドマップツール 4.10.5 Sticky notes\n- 4.11 Special writing environments 4.11.1 Distraction-free writing 4.11.2 Story writing 4.11.3 Screenwriting\n- 4.12 Language 4.12.1 Dictionary and thesaurus 4.12.1.1 Console 4.12.1.2 Graphical 4.12.2 Spell checkers 4.12.3 翻訳・地域化\n- 4.13 バーコードジェネレータ・リーダー 4.13.1 コンソール 4.13.2 グラフィカル\n\n- 4.1.1 Vi-style text editors\n- 4.1.2 Emacs-style text editors\n- 4.1.3 コンソール\n- 4.1.4 グラフィカル\n\n- 4.2.1 Office suites\n- 4.2.2 ワードプロセッサ 4.2.2.1 WYSIWYG HTML エディタ 4.2.2.2 Desktop publishing\n- 4.2.3 Presentations\n- 4.2.4 スプレッドシート\n- 4.2.5 データベースツール 4.2.5.1 簡易データベースソフトウェア\n- 4.2.6 Formula editors\n\n- 4.2.2.1 WYSIWYG HTML エディタ\n- 4.2.2.2 Desktop publishing\n\n- 4.2.5.1 簡易データベースソフトウェア\n\n- 4.3.1 AsciiDoc\n- 4.3.2 Markdown 4.3.2.1 Python 実装 4.3.2.2 Ruby 実装 4.3.2.3 Markdown エディタ\n- 4.3.3 組版システム\n- 4.3.4 TeX エディタ\n- 4.3.5 TeX 数式エディタ\n- 4.3.6 XML エディタ\n\n- 4.3.2.1 Python 実装\n- 4.3.2.2 Ruby 実装\n- 4.3.2.3 Markdown エディタ\n\n- 4.6.1 PDF と DjVu\n- 4.6.2 電子書籍\n- 4.6.3 漫画ビューア\n- 4.6.4 CHM\n\n- 4.9.1 Console\n- 4.9.2 Graphical\n\n- 4.10.1 メモ管理 4.10.1.1 コンソール 4.10.1.2 グラフィカル\n- 4.10.2 手書きメモ\n- 4.10.3 Diary\n- 4.10.4 マインドマップツール\n- 4.10.5 Sticky notes\n\n- 4.10.1.1 コンソール\n- 4.10.1.2 グラフィカル\n\n- 4.11.1 Distraction-free writing\n- 4.11.2 Story writing\n- 4.11.3 Screenwriting\n\n- 4.12.1 Dictionary and thesaurus 4.12.1.1 Console 4.12.1.2 Graphical\n- 4.12.2 Spell checkers\n- 4.12.3 翻訳・地域化\n\n- 4.12.1.1 Console\n- 4.12.1.2 Graphical\n\n- 4.13.1 コンソール\n- 4.13.2 グラフィカル\n\n- 5.1 ネットワークセキュリティ\n- 5.2 ファイアウォール\n- 5.3 脅威と脆弱性保護\n- 5.4 ファイルセキュリティ\n- 5.5 アンチマルウェア\n- 5.6 スクリーンロック\n- 5.7 Password auditing\n- 5.8 パスワードマネージャ 5.8.1 Console 5.8.2 Graphical\n- 5.9 Cryptography 5.9.1 ハッシュチェッカー 5.9.2 暗号化, 署名, ステガノグラフィー 5.9.3 Data-at-rest encryption\n- 5.10 管理者権限\n\n- 5.8.1 Console\n- 5.8.2 Graphical\n\n- 5.9.1 ハッシュチェッカー\n- 5.9.2 暗号化, 署名, ステガノグラフィー\n- 5.9.3 Data-at-rest encryption\n\n- 6.1 数学 6.1.1 電卓 6.1.1.1 Console 6.1.1.2 Graphical 6.1.2 数式処理システム 6.1.3 Visualization of networks/graphs 6.1.4 科学技術計算 6.1.5 統計学 6.1.6 データ評価とプロット 6.1.7 証明支援システム\n- 6.2 物理学 6.2.1 物理シミュレーション 6.2.2 単位変換\n- 6.3 化学 6.3.1 分子構造 6.3.1.1 ビューア 6.3.1.2 ドローイング 6.3.1.3 モデリング 6.3.2 周期表\n- 6.4 地球科学 6.4.1 地理学 6.4.2 気象学\n- 6.5 天文学\n- 6.6 生物学 6.6.1 計算生物学とバイオインフォマティクス 6.6.2 Genealogy 6.6.3 画像処理 6.6.4 DICOM ビューアとボリュームレンダリング\n- 6.7 工学 6.7.1 コンピュータ支援設計 6.7.2 電子工学 6.7.2.1 デジタル論理 6.7.2.2 HDL 6.7.2.3 MCU IDE とプログラマ 6.7.2.4 Electronic circuit simulation and schematic capture editing 6.7.2.5 Electronic design and schematic capture editing\n- 6.8 遠距離通信 6.8.1 アマチュア無線\n- 6.9 シミュレーションモデリング\n- 6.10 計算機科学 6.10.1 人工知能 6.10.2 Photogrammetry\n\n- 6.1.1 電卓 6.1.1.1 Console 6.1.1.2 Graphical\n- 6.1.2 数式処理システム\n- 6.1.3 Visualization of networks/graphs\n- 6.1.4 科学技術計算\n- 6.1.5 統計学\n- 6.1.6 データ評価とプロット\n- 6.1.7 証明支援システム\n\n- 6.1.1.1 Console\n- 6.1.1.2 Graphical\n\n- 6.2.1 物理シミュレーション\n- 6.2.2 単位変換\n\n- 6.3.1 分子構造 6.3.1.1 ビューア 6.3.1.2 ドローイング 6.3.1.3 モデリング\n- 6.3.2 周期表\n\n- 6.3.1.1 ビューア\n- 6.3.1.2 ドローイング\n- 6.3.1.3 モデリング\n\n- 6.4.1 地理学\n- 6.4.2 気象学\n\n- 6.6.1 計算生物学とバイオインフォマティクス\n- 6.6.2 Genealogy\n- 6.6.3 画像処理\n- 6.6.4 DICOM ビューアとボリュームレンダリング\n\n- 6.7.1 コンピュータ支援設計\n- 6.7.2 電子工学 6.7.2.1 デジタル論理 6.7.2.2 HDL 6.7.2.3 MCU IDE とプログラマ 6.7.2.4 Electronic circuit simulation and schematic capture editing 6.7.2.5 Electronic design and schematic capture editing\n\n- 6.7.2.1 デジタル論理\n- 6.7.2.2 HDL\n- 6.7.2.3 MCU IDE とプログラマ\n- 6.7.2.4 Electronic circuit simulation and schematic capture editing\n- 6.7.2.5 Electronic design and schematic capture editing\n\n- 6.8.1 アマチュア無線\n\n- 6.10.1 人工知能\n- 6.10.2 Photogrammetry\n\n- 7.1 Organization 7.1.1 Personal information managers 7.1.2 Time management 7.1.2.1 コンソール 7.1.2.2 グラフィカル 7.1.3 Timers 7.1.3.1 Countdown timers and stopwatch 7.1.3.2 Break timers 7.1.3.3 Pomodoro timers 7.1.4 Time trackers 7.1.5 Task management 7.1.5.1 コンソール 7.1.5.2 グラフィカル 7.1.6 Contacts management 7.1.6.1 Console 7.1.6.2 Graphical 7.1.7 ファイナンス 7.1.7.1 Console 7.1.7.2 Graphical 7.1.8 暗号通貨 7.1.9 プロジェクト管理 7.1.10 レシピ管理\n- 7.2 教育 7.2.1 フラッシュカード 7.2.2 タッチタイピング 7.2.2.1 コンソール 7.2.2.2 グラフィカル\n- 7.3 アクセシビリティ 7.3.1 Speech synthesizers 7.3.2 音声認識 7.3.3 Screen magnifiers 7.3.4 On-screen annotation 7.3.5 マウス\n- 7.4 Display managers\n- 7.5 デスクトップ環境 7.5.1 ウィンドウマネージャ 7.5.1.1 コンソール 7.5.1.2 グラフィカル 7.5.1.3 コンポジットマネージャ 7.5.2 Wayland Compositors 7.5.3 ウィンドウタイル 7.5.4 タスクバー 7.5.5 System tray 7.5.6 アプリケーションランチャー 7.5.7 アプリケーションメニューエディタ 7.5.8 壁紙設定 7.5.9 仮想デスクトップのページャ 7.5.10 デスクトップウィジェット 7.5.11 デスクトップ通知 7.5.12 クリップボードマネージャ 7.5.13 ログアウト UI\n\n- 7.1.1 Personal information managers\n- 7.1.2 Time management 7.1.2.1 コンソール 7.1.2.2 グラフィカル\n- 7.1.3 Timers 7.1.3.1 Countdown timers and stopwatch 7.1.3.2 Break timers 7.1.3.3 Pomodoro timers\n- 7.1.4 Time trackers\n- 7.1.5 Task management 7.1.5.1 コンソール 7.1.5.2 グラフィカル\n- 7.1.6 Contacts management 7.1.6.1 Console 7.1.6.2 Graphical\n- 7.1.7 ファイナンス 7.1.7.1 Console 7.1.7.2 Graphical\n- 7.1.8 暗号通貨\n- 7.1.9 プロジェクト管理\n- 7.1.10 レシピ管理\n\n- 7.1.2.1 コンソール\n- 7.1.2.2 グラフィカル\n\n- 7.1.3.1 Countdown timers and stopwatch\n- 7.1.3.2 Break timers\n- 7.1.3.3 Pomodoro timers\n\n- 7.1.5.1 コンソール\n- 7.1.5.2 グラフィカル\n\n- 7.1.6.1 Console\n- 7.1.6.2 Graphical\n\n- 7.1.7.1 Console\n- 7.1.7.2 Graphical\n\n- 7.2.1 フラッシュカード\n- 7.2.2 タッチタイピング 7.2.2.1 コンソール 7.2.2.2 グラフィカル\n\n- 7.2.2.1 コンソール\n- 7.2.2.2 グラフィカル\n\n- 7.3.1 Speech synthesizers\n- 7.3.2 音声認識\n- 7.3.3 Screen magnifiers\n- 7.3.4 On-screen annotation\n- 7.3.5 マウス\n\n- 7.5.1 ウィンドウマネージャ 7.5.1.1 コンソール 7.5.1.2 グラフィカル 7.5.1.3 コンポジットマネージャ\n- 7.5.2 Wayland Compositors\n- 7.5.3 ウィンドウタイル\n- 7.5.4 タスクバー\n- 7.5.5 System tray\n- 7.5.6 アプリケーションランチャー\n- 7.5.7 アプリケーションメニューエディタ\n- 7.5.8 壁紙設定\n- 7.5.9 仮想デスクトップのページャ\n- 7.5.10 デスクトップウィジェット\n- 7.5.11 デスクトップ通知\n- 7.5.12 クリップボードマネージャ\n- 7.5.13 ログアウト UI\n\n- 7.5.1.1 コンソール\n- 7.5.1.2 グラフィカル\n- 7.5.1.3 コンポジットマネージャ\n\n"
    },
    {
      "title": "ネットワーク管理",
      "level": 4,
      "content": "ネットワーク設定#ネットワーク管理 を参照してください。\n\n"
    },
    {
      "title": "VPN クライアント",
      "level": 4,
      "content": "- Bitmask — 様々なサービスプロバイダを使用した、セキュアで暗号化されたコミュニケーション\n\n- Libreswan — 「IPsec」と「IKE」をベースにした、最も広くサポートされ、標準化されたVPNプロトコルのフリーソフトウェア実装です。\n\n- Mullvad — Mullvad VPN サービスの GUI クライアント\n\n- NetworkManager — プラグインシステムにより複数のプロトコル (例えば MS, Cisco, Fortinet) をサポート。\n\n- OpenConnect — Cisco と Juniper VPN に対応。\n\n- Openswan — IPsec-based VPN Solution.\n\n- OpenVPN — OpenVPN による VPN に接続します。\n\n- PPTP クライアント — Microsoft VPN (MPPE) などの PPTP VPN に接続します (安全ではない)。\n\n- en:RiseupVPN — riseup.net の Riseup VPN サービスのための GUI クライアント。RiseupVPN はユーザーアカウント、ログの保存、あらゆるユーザーの追跡を必要としません。サービスは寄付によって賄われています。snap パッケージ も利用可能です。\n\n- strongSwan — IPsec ベースの VPN ソリューション。\n\n- tinc — tinc はフリーの VPN デーモンです。\n\n- en:vopono — ネットワークネームスペース内で VPN トンネルとアプリケーションを起動する、OpenVPN と Wireguard のラッパーです。\n\n- Vpnc — Cisco 3000 VPN コンセントレータに接続します。\n\n- WireGuard — 次世代のセキュアなネットワークトンネル。\n\n"
    },
    {
      "title": "プロキシサーバー",
      "level": 4,
      "content": "- Brook — 強力な暗号化と検出不可能であることにフォーカスしたプロキシ。\n\n- en:Clash — Go で書かれた、ルールベースのトンネル。\n\n- Dante — RFC 1928 と関連する標準を実装する、SOCKS サーバーと SOCKS クライアントです。\n\n- NaïveProxy — より強い検閲耐性とより低い検出可能性のためにトラフィックをカモフラージュする、Chrome のネットワークスタックを使用したプロキシ。\n\n- Privoxy — プライバシーを強化するための高度なフィルタリング能力、web ページのデータや HTTP ヘッダーの変更、アクセス制御、広告や不快なインターネットのガラクタの削除の機能がある、キャッシュを行わない web プロキシ。\n\n- Project V — Project V は、インターネット上に自分のプライバシーネットワークを構築するのを補助するツールセットです。\n\n- Shadowsocks — インターネットトラフィックを保護するようにデザインされた、セキュアな socks5 プロキシです。\n\n- Squid — HTTP, HTTPS, FTP などに対応する、Web のためのキャッシュプロキシ。\n\n- Stunnel — TCP データフローに TLS 暗号化を追加/削除するサーバーとクライアント。\n\n- Tinyproxy — 軽量な HTTP/HTTPS プロキシデーモン。\n\n- Trojan — GFW をバイパスするのを助ける、正体不明のメカニズム。\n\n- Varnish — パフォーマンスの高い HTTP アクセラレータ。\n\n- XX-Net — 使い方が簡単なウェブプロキシツール。\n\n- Ziproxy — 転送する (キャッシュしない) 圧縮機能のある HTTP プロキシサーバー。\n\n"
    },
    {
      "title": "匿名化ネットワーク",
      "level": 4,
      "content": "- Freenet — 検閲が存在しない暗号化ネットワーク。\n\n- GNUnet — セキュアなピアツーピアネットワークのフレームワーク。\n\n- I2P — 分散型の匿名ネットワーク。\n\n- Lantern — ピアツーピアインターネット検閲回避ソフトウェア。\n\n- Tor — 匿名化オーバーレイネットワーク。\n\n"
    },
    {
      "title": "ウェブブラウザ",
      "level": 3,
      "content": "Wikipedia:Comparison of web browsers も参照してください。\n\n"
    },
    {
      "title": "コンソール",
      "level": 4,
      "content": "- browsh — 現代的なテキストベースのブラウザ。ヘッドレス Firefox のフロントエンドとして実行されます。\n\n- ELinks — 先進的な、定評のある高機能なテキストモードウェブブラウザ。マウスホイールによるスクロールのサポート、フレームや表、Lua と Guile による拡張が可能 (Links フォーク)。\n\n- Links — テキスト WWW ブラウザ。Lynx に似ているコンソールバージョン [links] と、CSS・画像レンダリング・プルダウン式のメニューがあるグラフィカルな X-window/フレームバッファバージョンの [xlinks -g] があります (Arch では両方コンパイルされています)。\n\n- Lynx — World Wide Web 用のテキストブラウザ。\n\n- w3m — テキストベースのウェブブラウザ。vim ライクのキーバインドがあり、画像を表示することも可能です。\n\n"
    },
    {
      "title": "グラフィカル",
      "level": 4,
      "content": "Wikipedia:ja:Gecko も参照してください。\n\n- Firefox — Mozilla によって開発されている、高速レンダリングを行う Gecko ベースの拡張性のあるブラウザ。\n\n- SeaMonkey — Mozilla インターネットスイートの後継。\n\n- Cliqz — Firefox ベースのプライバシーを意識したウェブブラウザ。開発終了。\n\n- Dot — プライバシーとなめらかな UI にフォーカスした、firefox のフォーク。\n\n- FireDragon — KDE 連携パッチとカスタムブランディングを含む、LibreWolf のフォークです。\n\n- GNU IceCat — GNU プロジェクトによって配布されている Firefox ESR のカスタムビルド。フリーでないコンポーネントを削除し、プライバシー保護用の拡張を追加しています。リリースサイクルは Mozilla Firefox よりも遅れがちです。\n\n- LibreWolf — Firefox のフォークで、プライバシー、セキュリティと自由にフォーカスしています。\n\n- Tor Browser Launcher — セキュアで簡単に Tor ブラウザをダウンロード、検証、インストール、起動できる、Firefox ESR のフォークです。\n\n- Waterfox Classic — データの収集と、署名のない拡張機能と NPAPI プラグインの使用ができる、Firefox 56 の最適化されたフォークです。\n\n- Waterfox Current — Firefox ESR の最適化されたフォークで、Waterfox の更新された機能の多いブランチです。\n\n- Waterfox G3 — Firefox 78 の最適化されたフォークで、Waterfox の更新された機能の多いブランチです。\n\nWikipedia:ja:Blink (レンダリングエンジン) を参照。\n\n- Chromium — Google によって開発されているウェブブラウザ。WebKit レイアウトエンジンを使っています。Google Chrome のオープンソースプロジェクト。\n\n- Brave — ビルトインの広告とトラッカーブロックを持つウェブブラウザ。\n\n- Iridium — Chromium 用のプライバシー保護 パッチセット。詳しくは Chromium との差異 を参照。\n\n- Ungoogled chromium — Google との統合を排除してプライバシーや透過性を高めた Google Chromium の改造版。\n\n- Google Chrome — Google によって開発されているプロプライエタリのウェブブラウザ。\n\n- Microsoft Edge — Microsoft により開発されたプロプライエタリのウェブブラウザ。\n\n- Opera — Opera Software により開発されたプロプライエタリのブラウザ。\n\n- Slimjet — 高速・スマート・強力なプロプライエタリブラウザ。Chromium がベース。\n\n- Vivaldi — パワーユーザーのために作られた先進的な proprietary ブラウザ。\n\n- Yandex Browser — ミニマルな設計と洗練されたテクノロジーによりウェブを高速・安全・簡単にする proprietary ブラウザ。\n\n- Dooble — カラフルウェブブラウザ。\n\n- Eric — QtWebEngine ベースの HTML ブラウザです。eric6 の開発ツールセットの一部で、eric6_browser コマンドで起動できます。\n\n- Falkon — QtWebEngine ベースのウェブブラウザで、Qt フレームワークで書かれています。\n\n- Konqueror — Qt ツールキットと Qt WebEngine (または KHTML レイアウトエンジン) をベースとしたウェブブラウザ。kde-network に含まれています。\n\n- Liri Browser — Liri のミニマルなマテリアルデザインのウェブブラウザ。\n\n- Otter Browser — Qt5 を使用して、クラシックな Opera (12.x) の UI を再現することを目指すブラウザ。\n\n- Qt WebBrowser — Qt と Qt WebEngine を使用して組み込みデバイス用に開発されたブラウザ。\n\n- qutebrowser — キーボードで操作する、vim ライクなブラウザ。PyQt5 と QtWebEngine がベース。\n\n- Beaker — ウェブサイトを作成してホストするツールがある、ピアツーピアのウェブブラウザ。\n\n- Ferdi — 気に入ったメッセージングサービスを1つのアプリケーションに統合できる、メッセージングブラウザ。Franz ベース。\n\n- Franz — WhatsApp, Facebook Messenger, Slack, Telegram と他のたくさんのウェブサービスのための、メッセージングブラウザ。\n\n- Min — あなたのプライバシーを守る、高速でミニマルなブラウザ。注意を引くものを最小化するようにデザインされたインターフェースを含んでいます。\n\n- Rambox — Franz の GPL でライセンスされた代替。その対をなす Apache 2 の全ての機能を提供します。\n\nWikipedia:ja:WebKit を参照。\n\nこれらのほとんどは wyebadblock で広告ブロックをサポートしています。\n\n- Badwolf — ミニマリストでプライバシーを意識したブラウザ。\n\n- Ephemeral — elementary OS 向けの、デフォルトでプライベートな、常に incognito なブラウザ。\n\n- Eolie — GNOME のためのシンプルなウェブブラウザ。\n\n- GNOME Web — WebKitGTK レンダリングエンジンを使うウェブブラウザ。gnome の一部。\n\n- Lariza — GTK 3, GLib, WebKit2GTK を使用するシンプルなウェブブラウザ。\n\n- Luakit — 速くて小さくて webkit ベースのブラウザフレームワークで、Lua により拡張できます。\n\n- Midori — GTK と Webkit ベースの軽量なウェブブラウザ。\n\n- Nyxt — キーボード指向の、無限に拡張できるブラウザで、パワーユーザー向けにデザインされています。親しみやすいキーバインド (Emacs, VI, CUA) と、タブ間のあいまい検索、複数選択、ツリー状の履歴などの機能を持っています。\n\n- surf — 軽量な WebKit ベースブラウザ。suckless philosophy に従っています (基本的にブラウザ自体はひとつの C ソースファイルで構成)。\n\n- Surfer — シンプルなキーボードベースのブラウザで、C で書かれています。カスタム JS スクリプトをサポートしています。\n\n- Tangram — ウェブアプリケーションのデスクトップ、特に GNOME への統合。\n\n- Vimb — C で書かれた Vim ライクなウェブブラウザで、Pentadactyl や Vimprobable に影響を受けています。manpage と一般的な設定のハウツーを含んでいます。カスタム JS スクリプト、ダークモードとジオロケーションリクエストをサポートしています。\n\n- wyeb — vim ライクなウェブブラウザで、dwb と luakit に影響を受けています。広告ブロック機能があります。\n\n- OSPKit — 印刷向けの、Webkit ベースの HTML ブラウザ。\n\n- Otter Browser — Qt5 を使用して昔の Opera (12.x) の UI を再現するブラウザ。\n\n- qutebrowser — キーボードで操作する、vim ライクなブラウザ。PyQt5 と QtWebKit がベース。\n\n- smtube — YouTube のビデオを閲覧、検索と再生できるアプリケーション。\n\n- WCGBrowser — キオスクシステムのためのウェブブラウザ。\n\n- Basilisk — Pale Moon の開発者によるもう一つの Goanna ベース のブラウザです。Firefox 52 ベースの UI を特徴としていて、永遠のベータ版です。WebExtensions のサポートがありませんが、XUL ベースのアドオンはサポートしています。\n\n- Dillo — FLTK ベースの小型・高速なグラフィカルウェブブラウザ。独自のレイアウトエンジンを使用。\n\n- Links — グラフィックとテキストモードのウェブブラウザ。CSS、画像レンダリング、プルダウンメニューのあるグラフィカルな X-window / フレームバッファバージョンを含んでいます。xlinks -g コマンドで起動できます。\n\n- NetSurf — C で書かれたフェザー級のブラウザ。そのゆっくり開発が進む JavaScript サポートと、カスタムレンダリングエンジンによって高速レンダリングすることで有名。\n\n- Pale Moon — 速度を重視して Firefox 29 以前のインターフェイスを備えた Firefox のフォーク。Gecko のフォークである Goanna レイアウトエンジンを使用。Firefox のアドオンが動作しないことがあります。WebExtensions, cache2, e10s, OTMC など Firefox の新機能はサポートしていません。たくさんの古い Classic Add-ons Archive の、XUL/XPCOM 技術が使われている、過去15年間に14274の開発者により作成された19450 Firefox アドオンの93598バージョン がまだ動きます。\n\n"
    },
    {
      "title": "Gemini ブラウザ",
      "level": 4,
      "content": "Wikipedia:ja:Gemini_(プロトコル)#ソフトウェア も参照してください。\n\n- Amfora — Gemini プロトコルのターミナルブラウザ。\n\n- Bombabillo — ターミナル向けのウェブではないクライアント。Gopher, Gemini などに対応しています。\n\n- Castor — Gemini、Gopher と Finger プロトコルのグラフィカルクライアント。Rust と GTK で書かれています。\n\n- Kristall — Qt ベースの Gemini ブラウザ。\n\n- Lagrange — Gemini 空間をブラウズするためのデスクトップの GUI クライアント。ウェブブラウザの現代的な利便性を提供します。\n\n- Telescope — w3m ライクな Gemini のブラウザ。\n\n"
    },
    {
      "title": "ウェブサーバー",
      "level": 3,
      "content": "Webサーバ は HTML ウェブページと他のファイルを、HTTP で ウェブブラウザ のようなクライアントに送信します。 多くのウェブサーバーは動的コンテンツ (ウェブアプリケーション) を送信するために、プログラムとのインターフェースを持っています。.\n\nカテゴリ:ウェブサーバー や Wikipedia:Comparison of web server software も参照してください。\n\n- Apache HTTP Server — パフォーマンスの高い Unix ベースの HTTP サーバー。\n\n- Caddy — 自動的な HTTPS の機能を持つ、HTTP/2 ウェブサーバー。\n\n- Hiawatha — セキュアで先進的なウェブサーバー。\n\n- Lighttpd — セキュア、高速、迎合的でとても柔軟なウェブサーバー。\n\n- nginx — 軽量な HTTP サーバーと IMAP/POP3 プロキシ。\n\n- sthttpd — thttpd ウェブサーバーのサポートされているフォーク。\n\n- yaws — Erlang で書かれたウェブサーバー/フレームワーク。\n\n"
    },
    {
      "title": "静的ウェブサーバー",
      "level": 4,
      "content": "- darkhttpd — 小さくてセキュアなウェブサーバー。C で書かれており、HTTPS や認証はサポートしていません。\n\n- quark — 非常に小さくてシンプルな、http get のみのウェブサーバー。一つのホストで静的ページのみを送信します。\n\n- serve — 静的ファイルの送信とディレクトリのリスト化。\n\n- servy — とても小さい、シングルバイナリの、Rustで書かれたウェブサーバー。\n\n- Webfs — シンプルで即座に使えるウェブサーバー。ほぼ静的なコンテンツ向け。\n\nPython の標準ライブラリモジュール http.server も、コマンドラインから使うことができます。\n\n"
    },
    {
      "title": "特化したウェブサーバー",
      "level": 4,
      "content": "- chezdav — 特定のディレクトリを共有できる WebDAV サーバー。\n\n- Mongoose — 組み込みウェブサーバーライブラリ。WebSocket と MQTT をサポートしています。\n\n- OnionShare — 安全かつ匿名でファイルの送受信をできるようにします。ウェブサーバーを開始して、Tor オニオンサービスとしてアクセスできるようにして、推測不能なウェブアドレスを生成することで、他の人にファイルを送信したり、ファイルをアップロードしてもらうことができます。\n\n- VServer — 選択されたフォルダーで HTTP サーバーを開き、ファイルを共有する GTK アプリケーション。\n\n- webhook — HTTP エンドポイント (フック) を作るための小さなサーバー\n\n- Woof — アドホックな単一ファイルウェブサーバ。Web Offer One File。\n\n"
    },
    {
      "title": "WSGI サーバー",
      "level": 4,
      "content": "- Gunicorn — UNIX 向けの Python WSGI HTTP サーバー。\n\n- uWSGI — 高速で、セルフホスティングできる、開発者/システム管理者に優しい、C で書かれたアプリケーションコンテナサーバーです。\n\n- Waitress — Python3 の WSGI サーバー。\n\nApache も mod_wsgi で WSGI をサポートしています。\n\n"
    },
    {
      "title": "パフォーマンステスト",
      "level": 4,
      "content": "- http_load — ウェブサーバーのパフォーマンスをテストするツール。1つのプロセスで動作します。\n\n- httperf — HTTP の様々な負荷を生成できます。C で書かれています。\n\n- siege — HTTP レグレッションテストとベンチマークのユーティリティ。\n\n- vegeta — HTTP 負荷テストツール。Go で書かれています。\n\n- Web Bench — ベンチマークツール。複数のクライアントを fork() を使ってシミュレーションします。\n\n"
    },
    {
      "title": "ダウンロードマネージャ",
      "level": 4,
      "content": "Wikipedia:Comparison of download managers も参照してください。\n\n- aria2 — 軽量なダウンロードユーティリティ。HTTP/S, FTP, SFTP, BitTorrent と Metalink をサポート。内蔵の JSON-RPC か XML-RPC インターフェースを通じてデーモンとして起動・操作することも可能です。\n\n- Axel — 非常に軽量なコマンドラインダウンロードアクセラレータ。ディスクを 250kB しか占有しません。HTTP/S と FTP をサポートします。\n\n- cURL — URL 取得ユーティリティ・ライブラリ。HTTP、FTP と SFTP をサポートしています。\n\n- HTTPie — 人間に優しい、API 時代のコマンドライン HTTP クライアント。\n\n- HTTrack — 使いやすい、オフラインブラウザユーティリティ。WWW サイトをインターネットからローカルディレクトリにダウンロードして、再帰的に全てのディレクトリを構築して、HTML や画像と他のファイルをサーバーからコンピュータに取得することができます。\n\n- LFTP — 洗練されたファイル転送プログラム。HTTP、FTP、SFTP、FISH と BitTorrent をサポートします。\n\n- mps-youtube — ターミナルベースの YouTube ジュークボックスで、プレイリストの管理機能を持っています。音声と動画を mplayer/mpv で再生します。\n\n- Plowshare — ファイルを共有するためのウェブサイトを管理するために設計された、コマンドラインツールのセットです (Hosters としても知られています)。\n\n- RTMPDump — RTMP (Flash ビデオプレーヤーのための Adobe のプロプライエタリプロトコル) を通して FLV ビデオをダウンロードします。\n\n- snarf — コマンドライン URL 取得ツール。HTTP と FTP をサポートします。\n\n- Streamlink — 様々なストリーミングサービスから、カスタムビデオプレーヤーやファイルへの保存のストリームを起動します。\n\n- Streamripper — ストリーミングの mp3 を録音して、トラックごとに分割します。\n\n- You-Get — Web からメディアコンテンツ (動画、音楽、画像) をダウンロードします。\n\n- youtube-dl — YouTube や、たくさんの他のウェブサイトから動画をダウンロード。\n\n- youtube-viewer — YouTube の動画を見るためのコマンドラインユーティリティ。\n\n- yt-dlp — youtube-dl のフォークです。追加の機能や修正が入っています。\n\n- Wget — Web からファイルを取得するネットワークユーティリティ。HTTP と FTP をサポート。\n\n- ClipGrab — YouTube、Vimeo と他のたくさんのオンライン動画サイトからダウンロードして変換します。\n\n- FatRat — HTTP, FTP, SFTP, BitTorrent, Metalink などをサポートしている Qt ベースのダウンロードマネージャ。\n\n- Forklift — PyGObject を使った、youtube-dl のためのシンプルな GUI。\n\n- FreeRapid — ファイル共有サービスからのダウンロードをサポートする、Java ベースのダウンローダー。\n\n- gtk-youtube-viewer — YouTube のビデオを見るための GTK ユーティリティ。\n\n- Gwget — GNOME のダウンロードマネージャ。Supports HTTP and FTP.\n\n- Gydl — YouTube のようなサイトからコンテンツをダウンロードする、youtube-dl プログラムの GUI ラッパーです。\n\n- Gyre — Coub からの動画のための GTK3 ダウンローダー。\n\n- JDownloader — ワンクリックホスティングサイトのための Java ベースのダウンローダー。\n\n- KGet — DKDE のダウンロードマネージャ。HTTP, FTP, BitTorrent, Metalink をサポート。kde-network に含まれています。\n\n- MegaBasterd — また別の非公式 MEGA ダウンローダー/アップローダー/ストリーミングスイート。\n\n- Motrix — HTTP、FTP、BitTorrent、Magnet などのダウンロードをサポートする、フル機能のダウンロードマネージャーElectron プラットフォームベース。\n\n- Persepolis — aria2 ダウンロードマネージャーの、たくさんの機能を持っているグラフィカルフロントエンド。HTTP と FTP をサポート。\n\n- pyLoad — Python で書かれたダウンローダーで、非常に軽量で、簡単に拡張でき、web で完全に管理できるようにデザインされています。\n\n- Steadyflow — GNOME のための、シンプルなダウンロードマネージャー。HTTP と FTP をサポート。\n\n- Streamtuner2 — インターネットラジオステーションとビデオブラウザ。様々なディレクトリからカテゴリごとに局を単にリスト化し、再生のために好みのメディアアプリを起動します。\n\n- uGet — GTK ダウンロードマネージャ。ダウンロードの分類や HTML のインポートができます。Supports HTTP, FTP, BitTorrent, Metalink, YouTube and Mega.\n\n- Video Downloader — YouTube やたくさんの他のウェブサイトから動画をダウンロードする、GTK アプリケーションです (youtube-dl ベース)。\n\n- Xtreme Download Manager — ダウンロードの速度を最大5倍に加速する、パワフルなツール。HTTP と FTP をサポート。動画ダウンローダーは一般的な方法で動作し、特定のウェブサイトに限定されません。\n\n- youtubedl-gui — 簡単に使える、youtube-dl のグラフィカルインターフェース。\n\n"
    },
    {
      "title": "LAN ファイル転送",
      "level": 4,
      "content": "#LAN messengers も参照してください。\n\n- LAN Share — クロスプラットフォームな LAN ファイル転送アプリケーションで、Qt GUI フレームワークで作られています。一切の追加の設定なしで、フォルダ全体の転送、1つまたはたくさんのファイル、大きいファイルや小さいファイルを即座に転送することができます。\n\n- NitroShare — クロスプラットフォームなネットワークファイル転送アプリケーションで、Qt GUI フレームワークで作られています。1つのデバイスからローカルネットワークの他のデバイスにとてもシンプルにファイルを転送できるように設計されています。\n\n- Teleport — ローカルネットワークで努力なしにファイルを共有する、ネイティブ GTK3 アプリケーション。\n\n- Warpinator — LAN 越しにファイルを共有する GTK アプリケーション。\n\n"
    },
    {
      "title": "クラウドストレージサーバー",
      "level": 4,
      "content": "- Cozy — 自分でハックしたりホスティングしたり削除したりできる、パーソナルクラウド。\n\n- Nextcloud — あなたが管理するハードウェアで集中的にファイルを保存できるクラウドサーバー。\n\n- Pydio — 成熟した、ファイル共有と同期のためのオープンソースウェブアプリケーション。\n\n- Seafile — ファイル同期、プライバシー保護とチームワークの先進的なサポートを持ったオンラインファイルストレージ・コラボレーションツール。\n\n"
    },
    {
      "title": "クラウド同期クライアント",
      "level": 4,
      "content": "- いくつかの 同期およびバックアッププログラム は、クラウドストレージサービスのサポートを直接提供します。\n- いくつかの FUSE ファイルシステム は、クラウドストレージをファイルシステムとしてマウントする方法を提供します。Google Drive は gvfs-google から GVFS-based アプリケーション (例えば Nautilus) で、kio-gdrive から KIO-based アプリケーション (例えば Dolphin) でアクセスすることもできます。\n- ゼロ知識 (クライアントサイドでの透過暗号化) ストレージをあらゆるサードパーティークラウドサービスで達成するには、保存データ暗号化#クラウドストレージの最適化 を参照してください。\n\n- CloudCross — ローカルのファイルやフォルダをたくさんのクラウドプロバイダーと同期します。Mail.ru Cloud、Yandex Disk、Google Drive、OneDrive と Dropbox のサポートが利用可能です。\n\n- Rclone — マルチプロバイダーの同期、コピー、マウントクライアント。\n\n- Rclone Browser — Rclone の GUI クライアント。\n\n- drive — Google Drive とファイルを取得・保存する小さいプログラム。\n\n- DriveSync — Google Drive ファイルをマシンのローカルフォルダに同期する、コマンドラインユーティリティ。\n\n- gdrive — Google Drive を操作するコマンドラインユーティリティ。\n\n- Grive — 新しい Drive REST API と部分同期をサポートする、Google Drive クライアント。\n\n- Insync — 非公式のプロプライエタリ Google Drive デスクトップクライアント。\n\n- ODrive — Electron プラットフォームベースの Google Drive GUI。\n\n- VGrive — Vala でできた、Google Drive の GTK ベースの GUI クライアント (バックエンドとフロントエンド)。\n\n- aws-cli — Amazon Web Services の CLI。Amazon S3 から/への効率的なファイルの転送を含みます。\n\n- Backblaze B2 — Backblaze B2 のオープンソースのコマンドラインクライアント。\n\n- Baidu Netdisk — Baidu のクラウドストレージサービスのためのプロプライエタリクライアント (以前は Baidu Cloud)。\n\n- Cozy Drive — Cozy のデスクトップクライアント。\n\n- Dropbox — Dropbox のプロプライエタリデスクトップクライアント。\n\n- hubiC — hubiC の、プロプライエタリ同期クライアントサービスとコマンドラインツール。\n\n- Mega Sync Client — Mega とファイルを同期するプロプライエタリデスクトップクライアント。\n\n- Megatools — Mega の非公式 CLI。\n\n- Nextcloud Client — Nextcloud のデスクトップクライアント。\n\n- Nutstore — Nutstore のプロプライエタリデスクトップクライアント。\n\n- OneDrive — OneDrive の非公式 CLI。\n\n- OneDrive — OneDrive の非公式 CLI のフォーク。\n\n- ownCloud Desktop Client — ownCloud のデスクトップ同期クライアント。\n\n- pCloud Drive — pCloud の、プロプライエタリなデスクトップ同期クライアント。Electron プラットフォームベース。\n\n- PydioSync — Pydio のデスクトップクライアント。\n\n- S3cmd — Amazon S3 の非公式 CLI。\n\n- Seafile Client — Seafile の GUI クライアント。\n\n- SpiderOak One — SpiderOak One のプロプライエタリクライアント。\n\n- Synology Drive — 集中化された Synology NAS と複数のクライアントコンピューターの間で、ファイルを同期・共有するプロプライエタリ GUI クライアント。\n\n- Tresorit — Tresorit のプロプライエタリデスクトップ同期クライアント。\n\n- Yandex Disk — Yandex Disk のプロプライエタリ CLI。\n\n"
    },
    {
      "title": "FTP",
      "level": 4,
      "content": "Wikipedia:Comparison of FTP client software も参照してください。\n\n- FileZilla — 高速で信頼性のある FTP, FTPS, SFTP クライアント。\n\n- gFTP — Linux 用のマルチスレッド FTP クライアント。\n\n- ftp — GNU Inetutils により提供される、シンプルな ftp クライアント。\n\n- ncftp — FTP を実装するフリーのアプリケーションプログラムのセット。\n\n- tnftp — 先進的な機能を持った NetBSD 用に開発された FTP クライアント。\n\nDolphin, GNOME Files, Thunar などのファイルマネージャにも FTP 機能はあります。\n\nWikipedia:List of FTP server software も参照してください。\n\n- bftpd — 小さくて、設定しやすい FTP サーバー。\n\n- ftpd — GNU Inetutils により提供される、シンプルな ftp サーバー。\n\n- proFTPd — セキュアでコンフィグラブルな FTP サーバー。\n\n- Pure-FTPd — フリーの (BSD ライセンス)、セキュアな、品質の高い、標準規格に準拠した FTP サーバー。\n\n- SSH — SFTP は高信頼性のデータストリームでファイルアクセス・転送・管理を行うネットワークプロトコルです。\n\n- vsftpd — UNIX-ライクシステム用の軽量で安定かつセキュアな FTP サーバー。\n\n"
    },
    {
      "title": "BitTorrent クライアント",
      "level": 4,
      "content": "以下のいくつかの ダウンロードマネージャ は BitTorrent ネットワークに接続することが可能です。Aria2、LFTP、FatRat、KGet、MLDonkey、uGet。\n\nWikipedia:Comparison of BitTorrent clients も参照してください。\n\n- Ctorrent — C++ で実装された軽量かつ軽快な BitTorrent クライアント。\n\n- Deluge — クライアント/サーバーモデルで複数ユーザーのインターフェースを持った BitTorrent クライアント。このパッケージはコンソールクライアントを含んでいます。\n\n- peerflix — node.js 向けストリーミング torrent クライアント。\n\n- rTorrent — シンプルで軽量な ncurses BitTorrent クライアント。libtorrent バックエンドが必要です。\n\n- Transmission CLI — シンプルで使いやすい BitTorrent クライアント。デーモン版と複数のフロントエンドが存在します。このパッケージは、バックエンド・デーモン・コマンドラインインターフェイス・ウェブ UI インターフェイスを含みます。\n\n- Deluge (GTK interface) — GTK を使って Python で書かれたユーザーフレンドリーな BitTorrent クライアント。\n\n- Fragments — GNOME デスクトップ環境のための使いやすい BitTorrent クライアント。\n\n- FrostWire — 使いやすいクラウドダウンローダー、BitTorrent クライアントとメディアプレイヤー。\n\n- Ktorrent — KDE 向けの高機能な BitTorrent クライアント。\n\n- Powder Player — ストリーミング BitTorrent クライアントとプレイヤーのハイブリッドです。Electron プラットフォームベースです。\n\n- qBittorrent — µtorrent に似ているオープンソースの (GPLv2) BitTorrent クライアントと、統合された torrent サーチエンジン。\n\n- Tixati — BitTorrent プロトコルを使用する、プロプライエタリ P2P クライアント。\n\n- Torrential — elementary OS のシンプルな torrent クライアント。\n\n- Transmission — シンプルで使いやすい BitTorrent クライアント。デーモン版 and multiple フロントエンドが存在します。\n\n- Transmission Remote — Transmission BitTorrent クライアントの、HTTP RPC プロトコルを使ったリモート管理の GTK クライアント。\n\n- Tremotesf — Transmission BitTorrent クライアントのリモート管理のための Qt クライアントで、HTTP RPC プロトコルを使用します。https://github.com/equeim/tremotesf2\n\n- Tribler — 第4世代ファイル共有システム型 bittorrent クライアント。\n\n- Vuze — Java で書かれた高機能な BitTorrent クライアント (旧名 Azureus)。\n\n- WebTorrent Desktop — ストリーミング BitTorrent アプリケーション。Electron プラットフォームベースです。\n\n"
    },
    {
      "title": "他の P2P ネットワーク",
      "level": 4,
      "content": "Wikipedia:Comparison of file-sharing applications も参照してください。\n\n- aMule — 有名な eDonkey/Kad クライアント。デーモン版、GTK、ウェブ、CLI フロントエンド。\n\n- EiskaltDC++ — Direct Connect と ADC のクライアント。\n\n- gtk-gnutella — Gnutella ピアツーピアネットワークの GTK サーバー/クライアント。\n\n- KaMule — aMule の KDE グラフィカルフロントエンド。\n\n- LBRY — 非集中的な、ユーザーによりコントロールされるコンテンツのマーケットプレースである LBRY のブラウザとウォレットです。Electron プラットフォームベースです。\n\n- lbt — LBRY のコマンドラインツールの小さなセット。\n\n- MLDonkey — マルチプロトコル P2P クライアントで、HTTP、FTP、BitTorrent、Direct Connect、eDonkey と FastTrack をサポートしています。\n\n- ncdc — モダンで軽量な Direct Connect と ADC クライアントで、使いやすい ncurses インターフェースを持っています。\n\n- Nicotine+ — Soulseek P2P ネットワークのグラフィカルクライアント。\n\n- Send Anywhere — プロプライエタリなファイル共有サービスで、ユーザーはリアルタイムにデジタルコンテンツを直接共有できます。Electron プラットフォームベースです。\n\n- IPFS — IPFS はブロックチェーンを利用した P2P ネットワークで、ファイルの送受信ができます。\n\n"
    },
    {
      "title": "Pastebin サービス",
      "level": 4,
      "content": "Wikipedia:ja:Pastebin も参照してください。\n\nPastebin サービスは、共同作業やトラブルシューティングの際にテキストや画像を示すのによく使われます。Pastebin クライアントを使えば、cli から投稿することができるようになります。\n\nいくつかのサービスは、CURL など、より多くの一般的なコマンドラインツールで使用することができます。行番号などの拡張は、cat -n など、より多くのコマンドラインツールを使用することができます。\n\n- 0x0.st はファイルホスティング・URL 短縮サービスです。使用例は以下の通りです。\n\n```\ncommand | curl -F 'file=@-' 0x0.st\n```\n\n```\ncurl -F 'file=@-' 0x0.st < file\n```\n\n- ix.io。使用例は以下の通りです。 command | curl -F 'f:1=<-' ix.io ファイルのアップロードは以下の通りです。 curl -F 'f:1=<-' ix.io < file\n- termbin.com は nc で使うことができます。\n\n```\ncommand | curl -F 'f:1=<-' ix.io\n```\n\n```\ncurl -F 'f:1=<-' ix.io < file\n```\n\n- Elmer — wgetpaste や curlpaste に似ている pastebin クライアント。Perl で書かれており、wget や curl と共に使用することができます。サーバー: codepad.org, rafb.me, sprunge.us.\n\n- Fb-client — paste.xinu.at pastebin のクライアント。\n\n- Gist — gist.github.com pastebin サービスのコマンドライン用インターフェース。\n\n- imgur — imgur.com 画像共有サービスに画像をアップロードできる CLI クライアント。\n\n- Ix — ix.io pastebin のクライアント。\n\n- Pastebinit — Pastebin クライアントとして動く小さな Python スクリプト。サーバー: pastie.org, paste.kde.org, paste.debian.net, paste.ubuntu.com など (全てのリストは pastebinit -l を見てください)。\n\n- ruby-haste — hastebin.com のクライアント。\n\n- Uppity — 無愛想な pastebin クライアント。\n\n- Wgetpaste — 多くの pastebin サービスへの投稿を自動化する bash スクリプト。サーバー: pastebin.ca、codepad.org、dpaste.com や pastebin.osuosl.org。\n\n"
    },
    {
      "title": "電子メールクライアント",
      "level": 4,
      "content": "Wikipedia:Comparison of email clients も参照してください。\n\n- aerc — 現在開発中の非同期電子メールクライアント。\n\n- alot — notmuch mail ベースの実験的なターミナル MUA。urwid ツールキットを使って python で書かれています。\n\n- Alpine — Pine ベースの高速で使いやすい Apache ライセンスのメールクライアント。\n\n- S-nail — ed のようなコマンド構文で使えるメール処理システム。mailx の機能を提供します。\n\n- mu/mu4e — メールインデックス作成プログラム (mu) と emacs 用のクライアント (mu4e)。Xapian による高速検索が使えます。\n\n- Mutt — 小さいがパワフルなテキストベースのメールクライアント。\n\n- NeoMutt — コマンドラインメールリーダー(または MUA)。Mutt のフォークで、追加の機能を持っています。\n\n- nmh — モジュール式のメール管理システム。\n\n- notmuch — xapian 上で動作する高速なメールインデクサ。\n\n- sendemail — 軽量な SMTP 電子メールクライアントで、Perl で書かれています。\n\n- Sup — 非常に高速な検索、タグ付け、スレッディング、GMail ライクな操作ができる CLI メールクライアント。\n\n- swaks — Swiss Army Knife SMTP。コマンドラインの、TLS や AUTH を含む SMTP テストや、電子メールの送信に使用できます。\n\n- Wanderlust — Emacs 用のメールクライアント・ニュースリーダー。\n\n- Balsa — Gnome プロジェクトのシンプルで軽量な電子メールクライアント。\n\n- Claws Mail — 軽量な GTK ベースの電子メールクライアント・ニュースリーダー。\n\n- ElectronMail — いくつかのエンドツーエンド暗号化電子メールプロバイダー (ProtonMail や Tutanota など) の非公式デスクトップアプリケーション。Electron プラットフォームベース。\n\n- Evolution — 成熟した高機能な電子メールクライアントで、GNOME プロジェクトの一部です。gnome-extra に含まれています。\n\n- Geary — Vala で作られたシンプルなデスクトップメールクライアント。\n\n- Kmail — 成熟した高機能な電子メールクライアント。Part of kde-pim.\n\n- Kube — 現代的なコミュニケーション・コラボレーションクライアントで、QtQuick でビルドされています。\n\n- Mailspring — Nylas Mail の、オリジナルの作者の1人によるフォークです。有料の \"Pro\" バージョンは Mailspring ID を必要とし、スヌーズや後で送信などの追加の機能があります。Electron プラットフォームベースです。\n\n- openWMail — Gmail & Google Inbox 用のデスクトップクライアント。Electron プラットフォームベースです。\n\n- SeaMonkey Mail & Newsgroups — SeaMonkey スイートに含まれているメールクライアント。\n\n- Sylpheed — 軽量でユーザーフレンドリーな GTK 電子メールクライアント。\n\n- Thunderbird — Mozilla によって開発されている、GTK で書かれた高機能な電子メールクライアント。\n\n- Trojitá — Qt IMAP 電子メールクライアント。1つの IMAP アカウント にのみ対応しています。\n\n- Tutanota — Tutanota メールサービス用の電子メールクライアント。Electron プラットフォームベース。\n\n- Viagee — 「ファイルを電子メールで送る」や、web の 'mailto' リンクなどのデスクトップメールアクションを、Gmail web クライアントで扱うことができるようにします。\n\n- Nextcloud Mail — NextCloud の電子メールウェブアプリ。\n\n- Roundcubemail — ネイティブなアプリケーションのようなインターフェイスがある、ブラウザベースの多言語 IMAP クライアント。\n\n- SquirrelMail — 変人向けのウェブメール\n\n"
    },
    {
      "title": "メール通知",
      "level": 4,
      "content": "- Ayatana Webmail — あらゆるデスクトップのためのウェブメールの通知とアクション。\n\n- Bubblemail — ローカルのメールボックス、pop、imap と gnome オンラインアカウントの、新規と未読メールの通知サービス。Mailnag のフォーク。\n\n- CheckMails — IMAP プロトコルを使ったシステムトレイ未読メールチェッカー。\n\n- Gnubiff — メールを確認して、新しいメールが届いたときにヘッダーを表示する、メール通知プログラム。\n\n- Mailnag — 拡張可能なメール通知デーモン。\n\n- QGmailNotifier — ポータブルな Qt5 ベースの GMail 通知プログラム。\n\n"
    },
    {
      "title": "メールサーバー",
      "level": 4,
      "content": "メールサーバー を参照してください。\n\n- DavMail — Exchange サーバーでユーザーがどんなメール/カレンダークライアントでも使えるようにする POP/IMAP/SMTP/Caldav/Carddav/LDAP exchange ゲートウェイ。\n\n- Modoboa — モジュール化されたメールホスティング・管理プラットフォームで、Python で書かれています。\n\n"
    },
    {
      "title": "メール取得エージェント",
      "level": 4,
      "content": "Wikipedia:Mail retrieval agent も参照してください。\n\n- fdm — メールを取得と配送するプログラム。\n\n- Fetchmail — リモートのメールの取得ユーティリティ。\n\n- getmail — 信頼できる Maildir とコマンド配信のある、POP3/IMAP4 メール取得ツール。\n\n- hydroxide — サードパーティーでオープンソースの ProtonMail の CardDAV、IMAP と SMTP のブリッジ\n\n- imapsync — IMAP 同期、コピー、移行ツール。\n\n- isync — IMAP と MailDir メールボックスの同期ツール。\n\n- mpop — fetchmail の代替として適している、小さくて早い POP3 クライアント。\n\n- OfflineIMAP — 2つのリポジトリの間で電子メールを同期します。\n\n"
    },
    {
      "title": "インスタントメッセージクライアント",
      "level": 4,
      "content": "Wikipedia:Comparison of instant messaging clients や Wikipedia:Comparison of VoIP software も参照してください。\n\nこのセクションではインスタントメッセージをサポートしている全てのソフトウェアを並べています。\n\nこれらのクライアントによってサポートされているネットワークの数は多いですが、（マルチプロトコルクライアントのご多分に漏れず）ネットワークごとの特有の機能は制限があったりサポートされていません。\n\n- BarnOwl — ncurses ベースのチャットクライアント。Zephyr, XMPP, IRC, Twitter プロトコルをサポート。\n\n- BitlBee — 人気のあるチャットネットワーク (XMPP, ICQ, Twitter) に接続できる IRC クライアント。\n\n- EKG2 — Ncurses ベースの XMPP、Gadu-Gadu、ICQ、IRC クライアント。\n\n- Finch — libpurple を使っている ncurses ベースのチャットクライアントで、全てのプロトコル (Bonjour, Gadu-Gadu, Groupwise, ICQ, IRC, SIMPLE, XMPP, Zephyr) をサポートします。\n\n- WeeChat — モジュール式で軽量な ncurses ベース IRC クライアント。他の様々なプロトコルは、プラグインを通してサポートされます。\n\n- Jitsi — Java で書かれたオーディオ・ビデオ VoIP 電話とインスタントメッセンジャーで、SIP, XMPP, ICQ, IRC などのプロトコルや、たくさんの他の有用な機能をサポートしています。\n\n- Kopete — Bonjour, Gadu-Gadu, GroupWise, ICQ, XMPP などをサポートしているユーザーフレンドリーな IM。\n\n- KDE Telepathy — Telepathy フレームワークを使っている KDE のインスタントメッセージクライアント。Kopete に代わるものとして開発されました。\n\n- Lith — WeeChat を中継するクライアントで、実行中の WeeChat インスタンスにどこからでも接続できるようになります。\n\n- Pidgin — 音声をサポートするマルチプロトコル・インスタントメッセージクライアントで、libpurple を使用していて、その全てのプロトコル (Bonjour, Gadu-Gadu, Groupwise, ICQ, IRC, SIMPLE, XMPP, Zephyr) をサポートします。\n\n- qutIM — シンプルでユーザーフレンドリーな IM。ICQ, XMPP, Mail.Ru, IRC, VKontakte をサポート。\n\n- Smuxi — クロスプラットフォーム IRC クライアントで、Twitter や XMPP もサポートしています。\n\n- Thunderbird — 機能が豊富な電子メールクライアントで、IRC や XMPP を使ったインスタントメッセージやチャットをサポートしています。\n\n- Volt — プロプライエタリなネイティブデスクトップクライアントで、Skype, Telegram, Slack, XMPP, Discord, IRC やその他に対応しています。\n\nWikipedia:Comparison of Internet Relay Chat clients も参照してください。\n\n- BitchX — 人気の ircII から開発されたコンソールベースの IRC クライアント。\n\n- ERC — パワフルな、モジュール式の、拡張性のある Emacs 用 IRC クライアント。\n\n- ii — フェザー級の IRC クライアント。文字通り tail -f で会話して echo で返事をファイルに出力する。\n\n- ircii — 最も古いメンテナンスされている IRC クライアントで、限定した機能により小さくて高速であると謳っています。\n\n- Irssi — 細かく設定ができる ncurses ベースの IRC クライアント。\n\n- pork — プログラマブルで、ncurses ベースの IRC クライアント。ircII と雰囲気が似ています。\n\n- ScrollZ — ircII がベースの先進的な IRC クライアント。\n\n- senpai — bouncer (例えば soju-gitAUR) と一番うまく機能する IRC クライアントで、ログが記録されず、履歴は CHATHISTORY でサーバーから取得され、ネットワークは bouncer-networks でサーバーから取得されます。\n\n- sic — ii に似た極端にシンプルな IRC クライアント。\n\n- tiny — Rust で書かれたきれいなインターフェースを持った IRC クライアント\n\n比較\n\nTable content:\n名前 | パッケージ | 言語 | 拡張性 | SASL\nBitchX | bitchx-gitAUR | C | ? | ?\nERC | emacs | ELisp | in ELisp | via script\nii | iiAUR | C | stdin/stdout | No\nircii | irciiAUR | C | ? | No\nIrssi | irssi | C | in Perl | Yes\npork | pork | C | in Perl | No\nScrollZ | scrollzAUR | C | ? | No\nsenpai | senpaiAUR | Go | ? | Yes\nsic | sicAUR | C | stdin/stdout | No\ntiny | tiny-irc-client-gitAUR | Rust | No | Yes\nWeeChat | weechat | C | multiple languages | Yes\n\n- ChatZilla — 真新しく、使いやすく、高度に拡張可能な Internet Relay Chat (IRC) クライアントで、 XULRunner を使って Mozilla プラットフォーム上でビルドされています。SeaMonkey スイートに含まれています。\n\n- HexChat — XChat フォーク。Linux と Windows に対応。\n\n- Konversation — KDE デスクトップ向け Qt ベースの IRC クライアント。\n\n- KVIrc — テーマをサポートしている Qt ベースの IRC クライアント。\n\n- Loqui — GTK IRC クライアント。\n\n- LostIRC — タブ自動補完、マルチサーバーサポート, logging などが特徴のシンプルな GTK IRC クライアント。\n\n- Polari — GNOME プロジェクトによるシンプルな IRC クライアント。\n\n- Quassel — 近代的で、クロスプラットフォームの、分散型 IRC クライアント。\n\n- Srain — 近代的で美しい IRC クライアントで、GTK 3 で書かれています。\n\nWikipedia:ja:Extensible_Messaging_and_Presence_Protocol や Wikipedia:Comparison of instant messaging clients#XMPP-related features も参照してください。\n\n- Freetalk — コンソールベースの XMPP クライアント。\n\n- jabber.el — Emacs 用の最小 Jabber クライアント。\n\n- jp (Salut à Toi) — Salut à Toi 用の CLI フロントエンド、多目的 XMPP クライアント。\n\n- MCabber — 小さな XMPP クライアント。機能: SSL, PGP, MUC, OTR, UTF8.\n\n- Poezio — IRC のような使い心地の XMPP クライアント。\n\n- Primitivus (Salut à Toi) — Salut à Toi 用のコンソールフロントエンド、多目的 XMPP クライアント。\n\n- Profanity — Irssi からインスパイアされたコンソールベースの XMPP クライアント。\n\n- Cagou (Salut à Toi) — Salut à Toi 用のデスクトップ/モバイルフロントエンドで、多目的 XMPP クライアントです。\n\n- Converse.js — Web ベースの XMPP チャットクライアントで、JavaScript で書かれています。\n\n- Dino — 現代的で使いやすい XMPP クライアントで、PGP と OMEMO をサポートしています。\n\n- Gajim — XMPP クライアントで、音声をサポートしています。Python で GTK を使って書かれています。\n\n- Kaidan — シンプルでユーザーフレンドリーな Jabber/XMPP クライアントで、Kirigami と QtQuick を使って近代的なユーザーインターフェースを提供します。\n\n- Kadu — Qt ベースの、XMPP と Gadu-Gadu のクライアント。\n\n- Libervia (Salut à Toi) — Salut à Toi の web フロントエンド、多目的 XMPP クライアント。\n\n- Nextcloud JavaScript XMPP Client — Nextcloud のチャットクライアントで、XMPP、エンドツーエンド暗号化、ビデオ通話、ファイル転送とグループチャットに対応しています。\n\n- Psi — Qt ベースの XMPP クライアント。\n\n- Spark — クロスプラットフォームのリアルタイム XMPP コラボレーションクライアントで、ビジネスと組織に最適化されています。\n\n- Swift — C++、Qt と Swiften で書かれた XMPP クライアント。\n\n- Tkabber — ハックしやすい ejabberd XMPP サーバーの作者による機能豊富な XMPP クライアント。\n\n- Vacuum IM — フル機能のクロスプラットフォーム XMPP クライアント。\n\nWikipedia:List of SIP software#Clients も参照してください。\n\n- Blink — 最新の使いやすい SIP クライアント。\n\n- Jami — 分散化された Jami ネットワークのための、SIP 互換のソフトフォンとインスタントメッセンジャー。元々は Ring や SFLphone という名前でした。\n\n- Linphone — インターネットを通じて自由に音声、ビデオ、テキストメッセージでコミュニケーションできる VoIP フォンアプリケーション (SIP クライアント)。\n\n- Twinkle — SIP を使った VoIP や IM コミュニケーションの Qt ソフトフォン。\n\n- Zoiper — プロプライエタリの SIP と IAX2 VoIP ソフトフォン\n\nMatrix と Matrix クライアント も参照してください。\n\n- Element — スタイリッシュな Matrix クライアントで、パフォーマンスと使いやすさに重点を置いています。ウェブアプリケーションとデスクトップアプリケーションは Electron プラットフォームベースです。\n\n- QuickMedia — rofi に触発された、ウェブサービス用のネイティブクライアントです。Matrix と、いくつかの他のサイトをサポートしています。\n\n- FluffyChat — マルチプラットフォームの Matrix クライアントで、シンプルでクリーンな UI を持っていて、Dart/Flutter で書かれています。\n\n- Fractal — GNOME のための Matrix クライアントで、Rust で書かれています。\n\n- Gomuks — ターミナルの Matrix クライアントで、mautrix と mauview を使って Go で書かれています。\n\n- Mirage — 装飾的、カスタマイズ可能、キーボードでの操作が可能な、暗号化と非中央化されたコミュニケーションのための Matrix チャットのクライアント。Qt/QML + Python と nio で書かれていて、現在はアルファ版です。\n\n- Neochat — Matrix プロトコルの KDE クライアント。\n\n- nheko — Matrix プロトコルのデスクトップクライアント。\n\n- Quaternion — Qt5 ベースの Matrix プロトコルのための IM クライアント。\n\n- SchildiChat — Matrix クライアントで、Element をベースにしており、より伝統的なインスタントメッセージ体験を提供します。Electron プラットフォームベースです。\n\n- Spectral — Qt5 ベースの、見た目のよいクロスプラットフォームな Matrix クライアント。\n\n- Syphon — プライバシーを重視したクロスプラットフォームの Matrix クライアントで、E2EE をサポートしていて、現在はアルファ版です。\n\nTox も参照してください。\n\n- qTox — パワフルな Tox クライアントで、C++/Qt で Tox デザインガイドラインを満たすように書かれています。\n\n- ratox — FIFO ベースの tox クライアント。\n\n- Toxic — ncurses ベースの Tox クライアント\n\n- Toxygen — 純粋な Python3 で書かれている Tox クライアントです。\n\n- Venom — GNU/Linux デスクトップ向けのモダンな Tox クライアント。\n\n- µTox — 軽量な Tox クライアント。\n\nAvahi#リンクローカル (Bonjour/Zeroconf) チャット と Wikipedia:Comparison of LAN messengers も参照してください。\n\n- BeeBEEP — 安全な LAN メッセンジャー。\n\n- iptux — LAN 通信ソフトウェア。IP Messenger と互換性あり。\n\n- LAN Messenger — インターネットコミュニケーションのための P2P チャットアプリケーションで、サーバーを必要としません。通知、個人とグループの暗号化されたメッセージ、ファイル送信とメッセージログを含む、様々な便利な機能がサポートされています。\n\nRing や Tox も参照してください。\n\n- Bitmessage — 非中央化されていてトラストレスな P2P コミュニケーションプロトコルで、暗号化されたメッセージを他の人やたくさんの受信者に送信することができます。\n\n- Briar — Briar はメッセージングアプリケーションで、活動家、ジャーナリストや、安全・簡単でロバストなコミュニケーション手段が必要なあらゆる人向けにデザインされています。\n\n- Patchwork — 非中央化されたメッセージと共有のアプリケーションで、Secure Scuttlebutt (SSB) でビルドされています。Electron プラットフォームベースです。\n\n- RetroShare — サーバーレスの暗号化済みインスタントメッセンジャーで、ファイル共有、チャットグループ、メールなどを備えています。\n\n- Ricochet — Tor サービスを基にして作成された匿名のピアツーピアによるインスタントメッセージシステム。\n\n- BlueJeans — BlueJeans ビデオ通話のための、プロプライエタリなデスクトップアプリケーション。Electron プラットフォームベースです。\n\n- Caprine — 非公式の Facebook Messenger アプリ。Electron プラットフォームベースです。\n\n- Chatterino — Twitch chat のチャットクライアント。\n\n- Delta Chat — 電子メールを使用した、プライバシーを考慮したチャットアプリケーション。Electron プラットフォームベースです。\n\n- Discord — ゲーマー用のプロプライエタリなオールインワンの音声・テキストチャット。フリーでデスクトップとスマートフォンの両方で動作。Electron プラットフォームベースです。\n\n- Gitter — GitHub のコミュニティやチームのためのコミュニケーション製品。\n\n- Hangups — Google ハングアウトのサードパーティ製インスタントメッセージクライアントで、コンソールインターフェースを持っています。\n\n- en:ICQ — Linux 向け公式 ICQ クライアント。\n\n- IRCCloud — 現代的で常時接続の IRC クライアントサービスのためのデスクトップクライアント。Electron プラットフォームベースです。\n\n- Jitsi Meet — Jitsi Meet のデスクトップアプリケーション。Electron プラットフォームベースです。\n\n- Kotatogram Desktop — Telegram Desktop の実験的なフォーク。\n\n- Matterhorn — Mattermost チャットシステムのコンソールクライアント。\n\n- Mattermost Desktop — Mattermost のデスクトップアプリケーション。Electron プラットフォームベース。\n\n- Microsoft Teams — Microsoft Teams の公式プロプライエタリクライアント。Electron プラットフォームベースです。\n\n- Mumble — TeamSpeak に似たボイスチャットアプリケーション。\n\n- en:QQ — Tencent によって開発された、プロプライエタリなインスタントメッセージングソフトウェア (ICQ を模倣しています)。\n\n- Rocket.Chat Desktop — Rocket.Chat のデスクトップアプリケーション。Electron プラットフォームベースです。\n\n- Session Desktop — オニオンルーティングベースのメッセンジャーです。Electron プラットフォームベースです。\n\n- Signal Desktop — Signal プライベートメッセンジャーのデスクトップアプリケーション。Electron プラットフォームベースです。\n\n- Skype — 音声とビデオのコミュニケーションが行える人気ですがプロプライエタリのアプリケーション。Electron プラットフォームベースです。\n\n- Slack — プロプライエタリのデスクトップ向け Slack クライアント。Electron プラットフォームベースです。\n\n- teams-for-linux — 非公式の Linux 向け Microsoft Teams クライアント。Electron プラットフォームベースです。\n\n- TeamSpeak — ゲーマーをターゲットにしたプロプライエタリの VoIP アプリケーション。\n\n- TeamTalk — プロプライエタリな VoIP アプリケーションで、ビデオチャット、ファイルとデスクトップの共有ができます。しかし、デスクトップ共有は Linux では動作しないようです。AUR パッケージはサーバーのみですが、クライアントは make プロセスの中でビルドされます。\n\n- Telegram Desktop — 公式 Telegram デスクトップクライアント。\n\n- Telegrand — GNOME 向けの GTK4 telegram クライアント。\n\n- ThreemaQT — 非公式 Threema Web デスクトップクライアント。\n\n- Viber — プロプライエタリでクロスプラットフォームな IM ・ VoIP ソフトウェア。\n\n- WhatsAppQT — 非公式 WhatsApp Web デスクトップクライアント。\n\n- Wire — 近代的なプライベートメッセンジャー。Electron プラットフォームベースです。\n\n- YakYak — Google Hangouts の非公式デスクトップクライアント。Electron プラットフォームベースです。\n\n- Zoom — プロプライエタリなビデオ会議、オンラインミーティングとグループメッセージアプリケーション。\n\n- Zulip — Zulip グループチャットのデスクトップクライアント。Electron プラットフォームベースです。\n\n"
    },
    {
      "title": "インスタントメッセージングサーバー",
      "level": 4,
      "content": "Wikipedia:Comparison of instant messaging protocols も参照してください。\n\n- InspIRCd — 安定していて、近代的で軽量な IRC デーモン。\n\n- IRCD-Hybrid — 軽量でパフォーマンスの高い IRC デーモン。\n\n- miniircd — 小さくて設定不要な IRC サーバーで、個人での使用に適しています。\n\n- ngIRCd — 無料、ポータブルで軽量な IRC サーバーで、小さいか非公開のネットワークに適しています。\n\n- Ergo — 近代的で、セットアップがシンプルな IRC サーバーで、Go で書かれています。IRCd、サービスフレームワークとバウンサーの機能を持っています。\n\n- UnrealIRCd — オープンソースの IRC サーバー。\n\nWikipedia:Comparison of XMPP server software も参照してください。\n\n- Prosody — Lua プログラミング言語で書かれた XMPP サーバー。Prosody は軽量で高い拡張性を持つように設計されています。ライセンスは MIT ライセンス。\n\n- Ejabberd — ロバスト、スケーラブルで拡張可能な Erlang で書かれた Jabber サーバー。\n\n- Jabberd2 — C 言語で書かれた XMPP サーバーで GNU General Public License でライセンスされています。jabberd14 から影響を受けています。\n\n- Openfire — XMPP IM マルチプラットフォームサーバー。Java で書かれています。\n\nWikipedia:List of SIP software#Servers も参照してください。\n\n- Asterisk — 完全な PBX ソリューション。\n\n- Kamailio — とても安定した SIP サーバー。\n\n- openSIPS — 音声、ビデオ、IM、オンライン状態や他の SIP 拡張のための SIP プロキシ/サーバー。\n\n- Repro — オープンソースでフリーな SIP サーバー。\n\n- Yate — 先進的で、成熟していて、柔軟なテレフォニーサーバーで、VoIP と固定ネットワーク、伝統的なモバイルオペレーターと MVNO に使用されています。\n\n- Mattermost — オープンソースのプライベートクラウドサーバーで、Slack の代替です。\n\n- Murmur — Mumble のボイスチャットアプリケーションサーバー。\n\n- Nextcloud Talk — Nextcloud の映像と音声の会議アプリ。\n\n- Rocket.Chat — Web チャットサーバーで、JavaScript で、Meteor フルスタックフレームワークを使って開発されています。\n\n- Spreed WebRTC — WebRTC 音声・ビデオ通話と会議サーバー。\n\n- Synapse — matrix プロトコルのリファレンス実装であるホームサーバー。\n\n- TeamSpeak Server — プロプライエタリの VoIP 会議サーバー。\n\n- uMurmur — ミニマルな Mumble サーバー。\n\n"
    },
    {
      "title": "コラボレーティブソフトウェア",
      "level": 4,
      "content": "Wikipedia:ja:コラボレーティブソフトウェア も参照してください。\n\n- Citadel/UX — メールとメーリングリストサーバー、インスタントメッセージング、アドレス帳、カレンダー/スケジューリング、掲示板、wiki やブログエンジンを含みます。\n\n- SOGo — グループウェアサーバーで、OpenGroupware.org (OGo) と SOPE アプリケーションサーバーを中心に構築されています。\n\n"
    },
    {
      "title": "フィードリーダー",
      "level": 4,
      "content": "RSS/Atom 収集クライアントです。いくつかの 電子メールクライアント は、ニュース収集クライアントとしても動作させることができます: Claws Mail RSSyl プラグイン、Evolution RSS プラグイン、SeaMonkey Mail & Newsgroups、Thunderbird など。\n\nWikipedia:Comparison of feed aggregators も参照してください。\n\n- Canto — ncurses RSS アグリゲータ。\n\n- Gnus — Emacs 用の電子メール、NNTP、RSS クライアント。\n\n- Newsboat — Mutt メールクライアントに似たレイアウトとキーバインドを持つ ncurses RSS アグリゲータ。\n\n- Rawdog — \"RSS Aggregator Without Delusions Of Grandeur\" は RSS/CDF/Atom フィードをパースして時間順で HTML ページに変換します。\n\n- sfeed — 軽量な RSS と Atom パーサー。\n\n- Snownews — テキストモード RSS ニュースリーダー。\n\n- Akregator — KDE 向けのニュースアグリゲータ、kde-pim の一部。\n\n- Alduin — RSS、Atom と JSON フィードアグリゲーター。Electron プラットフォームベースです。開発が停止しています。\n\n- Alligator — Kirigami ベースの RSS/Atom フィードリーダーで、携帯端末向けです。\n\n- FeedReader — 近代的なデスクトップアプリケーションで、既存の web ベースの RSS アカウントを補完するようにデザインされています。開発が停止しています。\n\n- Feeds — GNOME 向け RSS/Atom フィードリーダー。\n\n- Fluent Reader — 近代的なデスクトップ RSS リーダーで、React と Fluent UI でビルドされています。Electron プラットフォームベースです。\n\n- HackUp — デスクトップから Hacker News を読むことができまう。\n\n- Liferea — オンラインのニュースフィードやウェブログを読むための GTK ニュースアグリゲータ。\n\n- NewsFlash — 近代的なフィードリーダーで、GNOME デスクトップのためにデザインされています。FeedReader の精神的な後継です。\n\n- Nextcloud News — Nextcloud 向けの RSS/Atom フィードリーダー。\n\n- QuiteRSS — Qt/С++ で書かれている RSS/Atom フィードリーダー。\n\n- Raven — シンプルなデスクトップ RSS リーダーで、VueJS で作られています。Electron プラットフォームベースです。\n\n- RSS Guard — Qt フレームワークで開発されている非常に小さな RSS/Atom ニュースリーダー。\n\n- selfoss — 新しい多目的な RSS リーダー、ライブストリーム、マッシュアップ、集約ができる web アプリケーション。\n\n- Tickr — テレビのニュース番組にあるようにフィードをデスクトップにスクロールしながら表示する GTK ベースの RSS リーダー。\n\n- en:Tiny Tiny RSS — Web ベースのニュースフィード (RSS/Atom) アグリゲーター。\n\n"
    },
    {
      "title": "ポッドキャストクライアント",
      "level": 4,
      "content": "いくつかのメディアプレーヤーはポッドキャストクライアントとしても動作することができます。Amarok、Banshee、Cantata、Clementine、Goggles Music Manager、Rhythmbox、VLC media player、git-annex は podcatcher としても動作する ことができます。\n\nWikipedia:List of podcatchers も参照してください。\n\n- castero — ターミナル向けの、TUI ポッドキャストクライアント。\n\n- castget — シンプルなコマンドライン RSS enclosure ダウンローダーで、主にポッドキャストの自動・無人ダウンロードを目的としています。\n\n- gpo — gPodder のテキストモードインターフェース。\n\n- Greg — コマンドラインのポッドキャストアグリゲーター。\n\n- Marrie — コマンドラインインターフェイスで動作するシンプルなポッドキャストクライアント。\n\n- pcd — ミニマルなポッドキャストクライアントで、go で書かれています。\n\n- CPod — シンプルで美しいポッドキャストアプリ。Electron プラットフォームベース。\n\n- GNOME Podcasts — GNOME デスクトップ用のポッドキャストクライアントで、 Rust で書かれています。\n\n- gPodder — ポッドキャストクライアント・メディアアグリゲーター (GTK インターフェイス)。\n\n- Vocal — 近代的なデスクトップにあうシンプルなポッドキャストクライアント (GTK)。\n\n"
    },
    {
      "title": "Usenet ニュースリーダー",
      "level": 4,
      "content": "いくつかの 電子メールクライアント は Usenet ニュースリーダーとしても振る舞うことができます。Claws Mail、Evolution、NeoMutt、SeaMonkey Mail & Newsgroups、Sylpheed、Thunderbird など。\n\nWikipedia:List of Usenet newsreaders、Wikipedia:Comparison of Usenet newsreaders も参照してください。\n\n- nn — UNIX 用のユーザーフレンドリな (curses ベースの) Usenet ニュースリーダー。\n\n- slrn — テキストベースのニュースクライアント。\n\n- tin — NNTP と spool ベースのクロスプラットフォームなスレッド式 UseNet ニュースリーダー。\n\n- trn — テキストベースのスレッド式 Usenet ニュースリーダー。\n\n- NZBGet — .nzb ファイルのための Usenet バイナリダウンローダーで、web と CLI のインターフェースを持っています。\n\n- Pan — テキストとバイナリ両方を扱える GTK の Usenet ニュースリーダー。\n\n- SABnzbd — Python で書かれたオープンソースのバイナリニュースリーダー。\n\n- XRN — X Window System 向けの Usenet ニュースリーダー。\n\n"
    },
    {
      "title": "マイクロブログクライアント",
      "level": 4,
      "content": "Wikipedia:List of Twitter services and applications も参照してください。\n\n- bti — twitter/identi.ca のシンプルなコマンドラインクライアント。\n\n- oysttyer — (ttytter の公式フォーク) インタラクティブコンソールのテキストベースコマンドライン Twitter クライアントで、Perl で書かれています。\n\n- Rainbowstream — Python で書かれた強力かつ機能豊富な Twitter コンソールクライアント。\n\n- toot — Mastodon インスタンスとやりとりするための CLI と TUI のツール。\n\n- turses — コンソールベースの tyrs の機能を改善させた Twitter クライアント。\n\n- Cawbird — Linux デスクトップ向けのネイティブ GTK Twitter クライアント。\n\n- Choqok — KDE のマイクロブログクライアント。Twitter.com, Pump.io, GNU social, opendesktop.org サービスをサポート。\n\n- Giara — Reddit アプリで、Python、GTK、Handy でビルドされています。\n\n- Mikutter — GTK と Ruby を使用する、シンプルでパワフルな Twitter クライアント。\n\n- Pumpa — C++ と Qt で書かれた Pump.io クライアント。\n\n- Tootle — Mastodon の GTK3 クライアント。\n\n- Turpial — マルチインターフェイスの Twitter クライアント。Python で書かれています。\n\n- Whalebird — Mastodon クライアントアプリケーション。Electron プラットフォームベースです。\n\n"
    },
    {
      "title": "ブログソフトウェア",
      "level": 4,
      "content": "Wikipedia:ja:ブログ と Wikipedia:ja:コンテンツ管理システムの一覧 も参照してください。\n\n- Diaspora — 分散型のプライバシー指向ソーシャルネットワーク。\n\n- Drupal — PHP ベースのコンテンツ管理プラットフォーム。\n\n- Joomla — PHP 製のコンテンツ管理システム (CMS)。ウェブサイトを作成したり強力なオンラインアプリケーションが使えます。\n\n- Wordpress — ブログツールと公開プラットフォーム。\n\n"
    },
    {
      "title": "静的サイトジェネレーター",
      "level": 4,
      "content": "- Hexo — 高速・シンプル・パワフルなブログフレームワーク。\n\n- Hugo — Hugo は静的な HTML と CSS のウェブサイトジェネレーターで、Go で書かれています。速度、使いやすさ、設定可能性に最適化されています。\n\n- Jekyll — 静的ブログエンジン。Ruby で書かれており、Markdown や textile などのフォーマットをサポート。\n\n- Nanoblogger — Bash で書かれたコマンドラインの小規模な weblog エンジン。cat, grep, sed などの標準 UNIX ツールを使って静的な HTML コンテンツを作成します。もうメンテナンスされていません。\n\n- Nikola — Python で書かれた静的サイトジェネレータ。インクリメンタルリビルドと複数のマークアップフォーマットに対応。\n\n- Pelican — 静的なサイトジェネレータ。Python で動作。\n\n"
    },
    {
      "title": "リモートデスクトップ",
      "level": 3,
      "content": "Wikipedia:ja:リモートデスクトップや Wikipedia:Comparison of remote desktop software も参照。\n\nWeb ブラウザベースのソリューションについては Chrome Remote Desktop も参照してください。\n\n"
    },
    {
      "title": "リモートデスクトップクライアント",
      "level": 4,
      "content": "- AnyDesk — プロプライエタリなリモートデスクトップソフトウェア。\n\n- GNOME Connections — GNOME のリモートデスクトップクライアント。RDP と VNC をサポートしています。\n\n- GVncViewer — Gtk-VNC によるシンプルな VNC クライアント。gvncviewer で実行できます。\n\n- KRDC — KDE のリモートデスクトップクライアント。RDP と VNC をサポート。kde-network に含まれています。\n\n- Remmina — GTK で書かれたリモートデスクトップクライアント。RDP, VNC, NX, XDMCP, SSH をサポート。\n\n- Remote Viewer — シンプルなリモートディスプレイクライアント。SPICE と VNC をサポートしています。\n\n- Remotely — GNOME のシンプルな VNC ビューアー。メンテナンスされていません。\n\n- Sunlogin Remote Control — モバイルデバイス、Windows、Mac、Linux や他のシステムのリモートコントロールをサポートするプロプライエタリソフトウェア。独自のプロプライエタリプロトコルを使用します。\n\n- ToDesk — リモートチームワークに適している、プロプライエタリなリモートデスクトップクライアント。独自のプロプライエタリプロトコルを使用します。\n\n- TeamViewer — プロプライエタリのリモートデスクトップクライアント。プロプライエタリの独自プロトコルを使用。\n\n- vncviewer (TigerVNC) — X 用の VNC ビューア。\n\n- Vinagre — GNOME のリモートデスクトップビューア。RDP, VNC, SPICE, SSH をサポート。gnome-extra に含まれています。\n\n- xfreerdp — FreeRDP X11 クライアント。xfreerdp で実行できます。\n\n- X2Go Client — X2Go システムのグラフィカルクライアント (Qt5)。NX technology プロトコルを使用。\n\n"
    },
    {
      "title": "リモートデスクトップサーバー",
      "level": 4,
      "content": "- Krfb — KDE の VNC サーバー。kde-network に含まれています。\n\n- NoMachine — プロプライエタリなリモートデスクトップサーバーとクライアントで、NX technology ベースです。\n\n- wayvnc — (swayなどの) wlroots ベース の wayland コンポジタのための VNC サーバ\n\n- x0vncserver (TigerVNC) — X ディスプレイの VNC サーバー。\n\n- x11vnc — リアル X ディスプレイの VNC サーバー。\n\n- X2Go Server — オープンソースのリモートデスクトップソフトウェア。NX technology プロトコルを使用。\n\n- Xpra — マルチプラットフォームなスクリーン・アプリケーション転送システム。\n\n- Xrdp — RDP をサポートするデーモン。Xvnc、X11rdp または xorgxrdp をバックエンドとして使用します。\n\n"
    },
    {
      "title": "コーデック",
      "level": 3,
      "content": "次の記事を参照してください: コーデック。\n\n"
    },
    {
      "title": "画像ビューア",
      "level": 4,
      "content": "Wikipedia:Comparison of image viewers を参照してください。\n\n- fbi — Linux フレームバッファコンソールの為の画像ビューア。\n\n- fbv — フレームバッファコンソール用のとてもシンプルな画像ファイルビューア。\n\n- fim — 広範囲にカスタマイズできるスクリプト可能なフレームバッファ画像ビューア、fbi ベース。\n\n- jfbview — フレームバッファPDF/画像ビューア、Imlib2 ベース。Vim の様な操作性、回転とズーム、フィットの為のズーム、素早いマルチスレッドレンダリングなどの特徴があります。\n\n- CoreImage — シンプルで軽量、使いやすい画像ビューアーで、Qt ベースです。C-Suite の一部です。\n\n- Deepin Image Viewer — Deepin デスクトップ環境の画像ビューア。\n\n- Ephoto — EFL ベースの軽量な画像ビューア。\n\n- Eye of GNOME — 画像回覧・カタログ表示プログラム、GNOME デスクトップ環境の一部。\n\n- Eye of MATE — MATE デスクトップのシンプルな画像ビューア。\n\n- EyeSight — Hawaii デスクトップ環境の画像ビューア。\n\n- feh — imlib2 を使う、高速で軽量な画像ビューア。\n\n- GalaPix — OpenGL ベースの画像ビューア、大きな画像コレクションを同時に回覧・ズーム。\n\n- Geeqie — RAW ファイルのサポートなどの機能が追加されている画像ブラウザ・ビューア (GQview のフォーク)。\n\n- GPicView — シンプルで高速な X 用画像ビューア、LXDE デスクトップの一部。\n\n- Gwenview — KDE デスクトップ用の高速で簡単に使える画像ビューア。\n\n- ida — 画像を閲覧するための X11 アプリケーション (Motif ベース)。\n\n- imv — Wayland やアニメーション GIF にも対応している軽量な画像ビューアで、FreeImage を使用しています。\n\n- Koko — デスクトップとタッチ対応デバイス向けにデザインされた画像ビューアー。\n\n- KuickShow — 高速で便利な、KDE 向け画像ビューアー。\n\n- LxImage-Qt — LXQt の画像ビューア。\n\n- meh — XLib だけを使用する、軽量・単純・高速な画像ビューア。\n\n- Mirage — 画像の切り取り・リサイズなどの機能、カスタムアクション、サムネイルパネルをサポートしている PyGTK 画像ビューア。\n\n- nomacs — Qt 画像ビューア。機能豊富でありながら起動が速く、設定で様々なウィジェットや、画像のみを表示できます。\n\n- PhotoQt — シンプルで使いやすいインターフェイスを持つ、高速で細かい設定が可能な画像ビューア。\n\n- pqiv — GTK 3 ベースのコマンドライン画像ビューアーで、ミニマルな UI を持っていて、圧縮されたアーカイブ内の画像に対応しています。qiv の書き直しです。\n\n- qimgv — 高速で使いやすい Qt5 画像ビューアーです。mpv を利用した webm/mp4 再生をサポートしています。\n\n- qeh — 本当に早くてシンプルな画像ビューアー。feh に似ていますが、より高速でシンプルで、より多くのフォーマットをサポートしています。\n\n- Quick Image Viewer — GTK と imlib2 を基にした非常に小さく高速な画像ビューア。\n\n- qView — Qt 画像ビューアーで、ミニマリズムと使いやすさを念頭に置いてデザインされています。\n\n- Ristretto — Xfce デスクトップ環境向けの高速で軽量な画像ビューア。\n\n- shufti — 画像やファイルのディレクトリによってズームレベルや回転、ウィンドウサイズやデスクトップの位置・表示エリアの非破壊的な保存と復元ができるツール。\n\n- sxiv — タイル型ウィンドウマネージャと上手く動作する imlib2 を使ったシンプルな画像ビューア。\n\n- Viewnior — 画像の反転・回転・アニメーション機能と設定できるマウスアクション機能を持った最小主義の GTK 画像ビューア。\n\n- Vimiv — vim ライクなキーバインドを備えた画像ビューア。Gtk3 ツールキットを使って Python 3 で書かれています。\n\n- Vimiv (Qt port) — vim ライクなキーバインドを備えた画像ビューア。python3 と PyQt5 で書かれています。\n\n- vpv — 科学的な画像可視化のためにデザインされた画像ビューアー。\n\n- Xloadimage — クラシックな X 画像ビューア。\n\n"
    },
    {
      "title": "画像管理ソフト",
      "level": 4,
      "content": "Wikipedia:Image organizer も参照してください。\n\n- Deepin Album — Deepin desktop のための、画像を閲覧・管理するための写真マネージャー。\n\n- digiKam — プラグイン方式の編集機能を備えている KDE ベースの画像管理ソフト。digiKam は RAW 現像や画像編集ができる他の似たアプリケーションよりも多くの機能があると主張しています。\n\n- Frogr — GNOME desktop のための小さいアプリケーションで、ユーザーは Flickr 画像ホスティングサイトのアカウントを管理することができます。\n\n- GNOME Photos — GNOME で写真を表示・管理・共有。\n\n- gThumb — GNOME デスクトップ用の画像ビューアとブラウザ。\n\n- KPhotoAlbum — デジタル写真一覧化ソフトウェアで、注釈・ブラウジング・検索と、デジタル画像やビデオの閲覧をサポートしています。\n\n- Memories — 画像ビューアー・マネージャーで、elementary OS 向けにデザインされています。\n\n- Pantheon Photos — Pantheon のための写真管理ソフト。\n\n- PhotoPrism — 個人的な写真の管理ソフトで、Go と Google TensorFlow を利用しています。\n\n- Phototonic — 高速で機能的な画像ビューアーとブラウザー (Qt)。\n\n- Pix — 画像ギャラリーと画像ビューアーで、画像編集ソフトのような他のアプリケーションで画像を開いたり、ファイルにタグを追加したり、写真に注釈を追加したり、回転や共有するのに使うことができます。\n\n- Pix — 画像ビューアーとブラウザーで、gthumb ベースです。X-Apps プロジェクトです。\n\n- Rapid Photo Downloader — カメラ・メモリーカードやポータブルストレージデバイスから写真や動画をダウンロードします。\n\n- Shotwell — GNOME デスクトップ環境のために作られたデジタル写真オーガナイザー。\n\n"
    },
    {
      "title": "画像処理",
      "level": 4,
      "content": "- CairoSVG — SVG から PNG, PDF, PS への変換ツール。\n\n- Converseen — Qt ベースの一括画像変換・リサイズツール。\n\n- CropGUI — jpeg ファイルのロスレスクロップと回転のための GTK ユーティリティ。\n\n- dcraw — 多数のカメラの RAW 形式を変換。\n\n- G'MIC — 画像処理のためのフル機能のオープンソースフレームワーク。1d スカラ信号から 3d+t マルチスペクトル立体画像, 2次元のカラー画像まで様々なユーザーインターフェイスで画像データセットの変換・操作・フィルタリング・視覚化ができます。\n\n- GraphicsMagick — API の保持とコマンドラインの安定を目指して作られた ImageMagick のフォーク。パフォーマンスを高めるためにマルチコアもサポートしており、そのパフォーマンスが買われて多くの商用サイト (Flickr, etsy) で使われています。\n\n- ImageMagick — コマンドライン画像編集プログラム。100 以上のフォーマットの正確なコンバートをサポートしていることで知られています。基本的に API を使ってスクリプトを作りバックエンドで処理するのに使われます。\n\n- PosteRazor — 画像や PDF をカットして、印刷するとポスターとして組み合わせられるように分割します。\n\n- Guetzli — 視覚的な JPEG エンコーダーで、高い画像品質での高い圧縮密度を目指しています。\n\n- jpegoptim — JPEG 最適化ユーティリティで、可逆圧縮と不可逆圧縮を提供しています。\n\n- optipng — 可逆 PNG 圧縮ソフトウェア。\n\n- oxipng — 可逆・マルチスレッド PNG 圧縮ソフトウェア。\n\n- pngcrush — PNG ファイルの圧縮を最適化するツールです。\n\n- pngquant — PNG 画像の不可逆圧縮。\n\n- zopflipng — とても効率的な PNG 最適化ツールで、Google の zopfli ライブラリを使用しています。\n\n- Curtail — GTK ベースの画像圧縮ソフトウェアで、PNG と JPEG ファイルタイプをサポートしています。\n\n- Image Optimizer — Elementary OS 向けの、シンプルな可逆圧縮画像最適化ソフトウェアで、Vala と Gtk でビルドされています。\n\n- Trimage — Qt ベースの、PNG と JPG ファイルを最適化するツール。\n\n"
    },
    {
      "title": "ラスタ画像エディタ",
      "level": 4,
      "content": "Wikipedia:Comparison of raster graphics editors も参照してください。\n\n- AzPainter — イラストを描くためのペイントソフトウェア。\n\n- CorePaint — シンプルなビットマップペイントツールで、とてもシンプルな画像を作ることができます。C-Suite の一部です。\n\n- Deepin Draw — Deepin desktop 向けの、軽量なドローイングツール。\n\n- Drawing — GNOME desktop 向けのドローイングアプリケーションで、基本的なドローイング操作に Cairo と GdkPixbuf を使っています。\n\n- Drawpile — 共同ドローイングプログラムで、複数のユーザーが同時に同じキャンバスでスケッチすることができます。\n\n- GIMP — Adobe Photoshop などのプロプライエタリエディタに似ている画像編集スイート。GIMP (GNU Image Manipulation Program) は 1990 年代半ばに開発がスタートし、今では多くのプラグインと追加機能を持っています。\n\n- Glimpse — GIMP のフォークで、使いやすさを重視したフリーソフトウェアアプリケーションで、熟練者レベルの画像編集に対応しています。\n\n- Gpaint — GNOME 用の Paintbrush クローン。\n\n- GrafX2 — ビットマップペイントプログラムで、256色のドローイングに特化しています。\n\n- ImEditor — シンプルで多目的な画像エディタ。\n\n- KolourPaint — フリーの、KDE 用ラスタ画像エディタ。Windows 7 以前の Microsoft ペイントに似ていますが、透過などの追加機能を備えています。kde-applications と kde-graphics グループの一部です。\n\n- Krita — KDE プラットフォームのデジタルペインティング・イラストレーションソフトウェア。\n\n- Milton — 無限のキャンバスを持ったペイントプログラム。\n\n- mtPaint — パレットがインデックスされた画像やピクセルアート向けの画像編集プログラム。\n\n- MyPaint — デジタルペインター向けのフリーグラフィックアプリケーション。\n\n- PhotoFlare — シンプルですがパワフルな画像エディタで、PhotoFiltre からインスパイアされました。\n\n- Pinta — Paint.NET に倣ったお絵かきプログラム。カジュアルユーザー向けのシンプルな GIMP 代替を提供することが目標。\n\n- Pixelitor — 先進的な画像エディタで、レイヤー、レイヤーマスク、テキストレイヤー、複数のアンドゥ、ブレンドモード、クロップ、ガウスぼかし、アンシャープマスク、ヒストグラムなどに対応しています。\n\n- Swappy — Wayland ネイティブのスナップショット編集ツール。\n\n- XPaint — 多くの標準的なペイントプログラムが持っている機能を持ったカラー画像編集ツール。\n\ndigiKam, Ephoto, GNOME Photos, gThumb, ida, nomacs, Pantheon Photos, Phototonic や Shotwell などの画像ビューアや画像オーガナイザーでは、基本的な画像編集もできます。\n\n"
    },
    {
      "title": "専門的な画像エディター",
      "level": 4,
      "content": "- darktable — 撮影ワークフローや RAW 現像をするためのアプリケーション。\n\n- Filmulator — シンプルな raw 画像エディターで、フィルムの現像プロセスに基づいています。\n\n- FOSStriangulator — 画像から、三角形でできたイラストを作成するツール。\n\n- Hugin — 画像をつなぎ合わせてパノラマ画像を生成します。\n\n- LightZone — プロレベルのデジタル暗室と画像エディタで、Photoshop Lightroom に似ています。\n\n- Luminance HDR — HDR イメージングのワークフローを提供する、オープンソースのグラフィカルユーザーインターフェースアプリケーション。\n\n- nUFRaw — DCRaw を使って、デジタルカメラから raw 画像を読み込んで編集するユーティリティ。\n\n- Oqapy — 撮影ワークフローアプリケーション。\n\n- Rawstudio — Raw 画像コンバーターで、GTK で書かれています。\n\n- RawTherapee — 強力なクロスプラットフォームの raw 画像処理プログラム。\n\n- Showfoto — 強力な画像編集ツールを持った、写真エディター。\n\n"
    },
    {
      "title": "画像のジオタグ付与",
      "level": 4,
      "content": "- Geotag — 画像の日時情報と、GPS ユニットや地図からの位置情報をマッチさせます。\n\n- Geotagging — 写真と GPS 追跡ログ (GPX) を同期させる、写真のジオタグ付与ツール。\n\n- GottenGeography — GNOME デスクトップ向けの、使いやすい写真のジオタグ付与アプリケーション。\n\n- GPicSync — GPS トラックログから、画像のメタデータに位置情報を付与します。\n\n- GPSCorrelate — デジタルカメラの写真に、GPX フォーマットの GPS データからジオタグの関連付けを行います。\n\n"
    },
    {
      "title": "ベクタ画像エディタ",
      "level": 4,
      "content": "Wikipedia:Comparison of vector graphics editors も参照してください。\n\n- Dia — GTK ベースの作図プログラム。\n\n- diagrams.net — Web 技術で作られた、作図プログラム。Electron プラットフォームベースです。\n\n- Dot Matrix — シンプルな線で作る、独創的なグリフのプレイグラウンド。\n\n- Figma — Figma 共同デザインツールの非公式デスクトップアプリケーション。Electron プラットフォームベースです。\n\n- Gravit Designer — プロプライエタリなベクターデザインアプリケーション。Electron プラットフォームベースです。\n\n- Inkscape — ベクタ画像エディタ。Illustrator, CorelDraw, Xara X に似た機能を持ち SVG (Scalable Vector Graphics) ファイルフォーマットを使うことができます。Inkscape は多くの高度な SVG 機能をサポートしており（マーカー、クローン、アルファブレンドなど）、すっきりしたインターフェースを持っています。ノードの編集、複雑なパス操作、ビットマップのトレースなどを簡単に行えます。また、開かれた、コミュニティ貢献の開発によってユーザーと開発者のコミュニティは非常に活発です。\n\n- Karbon — ベクタ画像エディタ、Calligra スイートの一部。\n\n- LibreOffice Draw — ベクター画像エディタと作図ツールです。LibreOffice スイートに含まれていて、Microsoft Visio に似ています。\n\n- Mockingbot — プロプライエタリなプロトタイプ作成・共同デザインツール。Electron プラットフォームベースです。\n\n- OpenOffice Draw — ベクター画像エディタと作図ツールで、OpenOffice スイートに含まれています。\n\n- Pencil Project — GUI プロトタイピング・モックアップツール。Electron プラットフォームベースです。\n\n- sK1 — Adobe Illustrator や CorelDraw の代替、PostScript や PDF ですぐに出力できるようになっています。\n\n- SvgVi — SVG ビューアーとエディターで、XML 定義を使用します。\n\n- yEd —\n\n- Xfig — インタラクティブなドローイングツール。\n\n"
    },
    {
      "title": "フォントエディタ",
      "level": 4,
      "content": "Wikipedia:Comparison of font editors も参照してください。\n\n- Birdfont — ベクター画像を作って TTF、 EOT、 SVG フォントとしてエクスポートできるフォントエディターです。\n\n- FontForge — アウトラインフォントエディター。\n\n- TruFont — フォント編集アプリケーション。\n\n"
    },
    {
      "title": "2D アニメーション",
      "level": 4,
      "content": "- enve — 柔軟で、ユーザーによる拡張が可能な 2D アニメーションソフトウェア。\n\n- Glaxnimate — ベクター 2D アニメーションソフトウェアで、主に Lottie と TGS フォーマット向けですが、標準的な SVG アニメーションのエクスポートにもよく対応しています。\n\n- OpenToonz — 2D アニメーション作成ソフトウェア。\n\n- Pencil2D — 2D 手書きアニメーションを作成する簡単で直感的なツール。\n\n- qStopMotion — ストップモーション・アニメーション動画を作成するアプリケーション。ユーザーは、カメラやハードディスクから読み込んだ写真からストップモーションを作成して、mpeg や avi などの異なる動画フォーマットでアニメーションをエクスポートすることができます。\n\n- Scribl — シンプルな動画マニュアルを作成するアプリケーションで、音声と手書きのアニメーションを組み合わせることができます。\n\n- Stopmotion — ストップモーション・アニメーションを作成するアプリケーション。フレームをキャプチャして編集し、1つのファイルにエクスポートすることができます。\n\n- Synfig Studio — 2D アニメーションソフトウェアで、ベクターやビットマップのアートワークを使って映画品質のアニメーションを作成する強力なソリューションとしてデザインされています。\n\n- TupiTube Desk — 2D アニメーションを作成して共有できるデスクトップアプリケーションで、子供や10代にフォーカスしています。\n\n- Aseprite — ピクセルアートの 2d アニメーション。\n\n- Pixelorama — ピクセルアートの 2d アニメーション。\n\nドローイングアプリケーション Krita と 3D エディター Blender (Grease Pencil モード) はどちらも 2D アニメーション機能を持っています。\n\n"
    },
    {
      "title": "3D コンピューターグラフィックス",
      "level": 4,
      "content": "Wikipedia:ja:3DCGソフトウェア も参照してください。\n\n- Art of Illusion — Java で書かれた 3D モデリング・レンダリングスタジオ。\n\n- Blender — 3D モデリング、テキスチャ、アニメーションなどの機能を持った完全一体型の 3D グラフィック創作スイート。\n\n- CloudCompare — 3D 点群とメッシュ処理ソフトウェア。\n\n- Dust3D — 3D モデリングソフトウェア。3D の完璧なベースモデルをすぐに作ることができます。ゲーム制作・3D プリントなどのキャラクターメイキングを高速化できます。\n\n- F3D — 高速でミニマリストな KISS 3D ビューアー。サポートしているファイルフォーマットは、VTK (legacy と XML)、STL、GLTF、PLY、OBJ、3DS などです。\n\n- Goxel — オープンソースの 3D ボクセルエディター。\n\n- MakeHuman™ — 人間の体を作成するための Parametrical モデルのプログラム。\n\n- MeshLab — 3D 三角メッシュを処理・編集するシステム。\n\n- Sweet Home 3D — フロアプランを計画・開発するための、インテリアデザインソフトウェアアプリケーション。\n\n- POV-Ray — 3D グラフィックを作成するスクリプトベースのレイトレーシングソフトウェア。\n\n- VoxelShop — ボクセルオブジェクトを編集・作成する、とても直感的で強力なソフトウェア。\n\n- Wings 3D — パワフルで使いやすい先進的なサブディビジョンモデラー。\n\n"
    },
    {
      "title": "カラーピッカーとパレット",
      "level": 4,
      "content": "- Agave — GNOME 向けのカラースキーマデザイナーツール。\n\n- Chameleon — X11 のシンプルなカラーピッカーで、色を標準出力に出力します。\n\n- ColorGrab — クロスプラットフォームなカラーピッカー。\n\n- Color Palette — デザインガイドラインに定義された GNOME カラーパレットを表示するためのツールです。\n\n- colorpicker — スクリーン上のピクセルをクリックすると、その色の値を RGB で表示します。X11 向けに書かれています。\n\n- Color Picker — Pantheon デスクトップ向けのシンプルなカラーピッカー。\n\n- Coulr — 開発者とデザイナーを助けるカラーボックス。\n\n- Deepin Picker — Deepin デスクトップ向けのカラーピッカーツール。\n\n- delicolour — 軽量な GTK 3 カラーファインダー。\n\n- gcolor2 — シンプルな GTK 2 カラーセレクター。\n\n- Gcolor3 — シンプルな GTK 3 カラーセレクター。\n\n- GPick — 先進的なカラーピッカーツール。\n\n- KColorChooser — スクリーンやパレットから色を選ぶ、シンプルなアプリケーション。kde-graphics の一部です。\n\n- Kontrast — 色のコントラストを確認するツールで、色が正しくアクセシブルか検証することができます。kde-accessibility の一部です。\n\n- MATE Color Selection — パレットやスクリーンから色を選びます。mate-color-select で実行します。\n\n- Pick — Linux デスクトップ向けの、シンプルなカラーピッカーツール。\n\n- PrestoPalette — 調和の取れたカラーパレットを作成するための、アーティストのツール。\n\n- xcolor — X11 向けの軽量なカラーピッカー。\n\n"
    },
    {
      "title": "スクリーンキャプチャ",
      "level": 4,
      "content": "スクリーンショットの取得#専用のソフトウェア を参照してください。\n\n"
    },
    {
      "title": "デジタルカメラ管理",
      "level": 4,
      "content": "gPhoto#インストール を参照してください。\n\n"
    },
    {
      "title": "オーディオシステム",
      "level": 4,
      "content": "メインの記事 サウンドシステム と Wikipedia:ja:サウンドサーバ も参照してください。\n\n"
    },
    {
      "title": "オーディオプレイヤー",
      "level": 4,
      "content": "Wikipedia:Comparison of audio player software も参照してください。\n\n#ビデオプレーヤー セクションのたくさんのアプリケーションも音声再生に対応しています。\n\n- Music Player Daemon — サーバー・クライアントアーキテクチャを採用したオーディオプレーヤー。使用するには、分離したクライアントが必要です。\n\n- en:Funkwhale — セルフホストされた、近代的で、無料でオープンソースなミュージックサーバー。Grooveshark に強く影響を受けています。インスタンスは一体になることができます。\n\n- cmus — 多くの機能を持っている ncurses ベースのミュージックプレイヤー。\n\n- Cplay — 様々なオーディオプレイヤーに対応した curses フロントエンド (ogg123, mpg123, mpg321, splay, madplay, mikmod, xmp, sox)。\n\n- davis — mpd の CLI クライアントで、Rust で書かれています。\n\n- Herrie — 最小主義のコンソールベースのミュージックプレイヤー、ネイティブで AudioScrobbler をサポート。\n\n- MOC — ncurses コンソールオーディオプレイヤー。MP3, OGG, WAV フォーマットをサポート。\n\n- MPFC — Gstreamer ベースの curses インターフェイスを備えたオーディオプレーヤー。\n\n- mpg123 — Linux, FreeBSD, Solaris, HP-UX やその他多くの UNIX システムに対応している高速でフリーの MP3 コンソールオーディオプレイヤー (MP1 と MP2 もデコードします)。\n\n- vitunes — Curses ベースの音楽プレーヤーとプレイリスト管理ソフトで、vim ライクなキーバインディングを使用します。\n\n- whistle — curses ベースのコマンドライン音声プレイヤー。\n\n- XMMS2 — 人気のミュージックプレイヤーを完全に書き換えたもの。\n\n- Banshee — iTunes クローン、GTK と Mono で作られ、機能豊富です。アップストリームの開発は停止しています。\n\n- Blanket — 異なる音を聞くことで、集中力を強化して生産性を向上させます。\n\n- Byte — elementary OS 向けにデザインされた音楽プレーヤー。\n\n- Clementine — Qt5 にポートされた Amarok 1.4 クローン。Strawberry (下に記載) も参照してください。\n\n- Cozy — Linux 向けの近代的なオーディオブックプレーヤーで、GTK 3 を使用しています。\n\n- Exaile — Amarok の GTK クローン。\n\n- GNOME Music — GNOME の新しい音楽再生アプリケーション。エレガントな没入型のブラウザと、シンプルでわかりやすいコントロールを備えています。\n\n- Guayadeque — 巨大なコレクションを簡単に管理できるフル機能のメディアプレイヤー。GStreamer メディアフレームワークを使っています。\n\n- Lollypop — GNOME の音楽プレイヤー。\n\n- Melody — ローカルの音楽ファイル、オンラインラジオや音楽 CD を聞くための音楽プレーヤー。\n\n- Muine — C# で書かれた音楽プレイヤー。\n\n- Pantheon Music — シンプル、高速で、見た目のよい音楽プレーヤーです。elementary の公式音楽プレーヤーです。\n\n- Parlatype — GNOME 向けの、文字起こし用のミニマルな音楽プレーヤー。好きなテキストアプリケーションで書き起こしを行うために音声ソースを再生します。\n\n- Pragha — 軽量な、2パネル型の GTK 音楽マネージャーで、C で書かれています。\n\n- Quod Libet — GTK, Python と GStreamer で書かれた音声プレイヤー。プレイリストで正規表現をサポートしています。\n\n- Rhythmbox — iTunes の GTK クローン。GNOME のデフォルトプレイヤー。\n\n- Sayonara — C++ で書かれた Qt フレームワークの小規模で高速な Linux 用の音声プレイヤー。\n\n- Strawberry — Clementine のフォークで、音楽愛好家や音楽収集家向けです。Qt6 を使用します。\n\n- Tauon Music Box — 近代的で、快適で合理的な音楽プレーヤーで、音楽コレクションの再生向けです。\n\n- Amarok — 機能が非常に多いことで有名な成熟した Qt ベースのプレイヤー。\n\n- JuK — オーディオジュークボックスアプリケーション。MP3, Ogg Vorbis, FLAC 音声ファイルをサポート。\n\n- Yarock — 近代的な見た目の音楽プレーヤーで、様々な特徴を備えており、特定のデスクトップ環境に依存しません。Yarock は、カバーアートに基づく、簡単で綺麗な音楽ブラウザーを提供するためにデザインされています。\n\n- Aqualung — 先進的な音楽プレーヤーで、音楽 CD、インターネットラジオストリームやポッドキャストも、あらゆる音楽フォーマットの音楽ファイルとほぼ同じように再生でき、隣接トラックとの間に空白を入れない機能を持っています。\n\n- Audacious — Beep や古い XMMS に似ている Winamp クローン。\n\n- DeaDBeeF — 多くの機能を持っている軽くて速い音楽プレイヤー。GNOME や KDE には依存せず、GTK GUI だけでなくコンソールだけでも利用可能。たくさんのプラグインやメタデータエディタも付属。\n\n- Deepin Music — 素晴しい音楽プレーヤーで、美しくて調整可能な Deepin-UI ベースの UI を持っています。\n\n- Drumstick MIDI File Player — MIDI ファイルプレーヤーで、Drumstick ベースです。\n\n- Elisa — KDE コミュニティによるシンプルな音楽プレーヤーで、ユーザーによい体験を提供することを目的としています。\n\n- gmusicbrowser — MP3/OGG/FLAC ファイルコレクション用のオープンソースのジュークボックス。\n\n- Goggles Music Manager — 音楽の自動カテゴライズ、ギャップレス再生、簡単なタグ編集、インターネットラジオなどの機能があるミュージックコレクションマネージャ、プレーヤー。Fox toolkit を使っています。\n\n- LXMusic — 最小主義で xmms2 ベースの音楽プレイヤー。\n\n- museeks — 最小主義で簡単に使える音楽プレーヤー。Electron プラットフォームベースです。\n\n- Musique — ありふれた音楽プレイヤー。\n\n- Qmmp — Winamp や XMMS に似たユーザーインターフェースを持っている Qt ベースのマルチメディアプレイヤー。\n\n- Soundux — シンプルなユーザーインターフェースを特徴とするサウンドボード。\n\n- Vvave — とても小さい Qt 音楽プレーヤーで、お気に入りの曲をいつでも聞けるようにします。\n\n"
    },
    {
      "title": "インターネットラジオ再生ソフト",
      "level": 4,
      "content": "- GNOME Internet Radio Locator — 放送中のラジオプログラムを、インターネット上のラジオ放送の物理的な場所に基づいて簡単に探すことができます。\n\n- Goodvibes — 軽量なインターネットラジオプレーヤー。\n\n- Radiotray-NG — インターネットラジオプレーヤーのシステムトレイアプレット。\n\n- Shortwave — インターネットラジオ局を探して聞くための、GTK 3 アプリケーション。\n\n- Tuner — ミニマリストなラジオ局プレーヤー。\n\n"
    },
    {
      "title": "音楽ストリーミングクライアント",
      "level": 4,
      "content": "- Google Play Music Desktop Player — 美しいクロスプラットフォームな Google Play Music のデスクトッププレーヤー。Electron プラットフォームベースです。\n\n- Headset — YouTube を世界クラスの音楽ストリーミングサービスにするデスクトップアプリです。Electron プラットフォームベースです。\n\n- MellowPlayer — Web ベースの音楽ストリーミングサービスをウィンドウ内で開き、デスクトップとの連携を提供する、無料、オープンソースでクロスプラットフォームな Qt ベースのデスクトップアプリケーションです。\n\n- Nuclear — 現代的な音楽プレーヤーで、無料のソースからのストリーミングに特化しています。Electron プラットフォームベースです。\n\n- pianobar — オンラインラジオ Pandora のコンソールベースのフロントエンド。\n\n- Pithos — Python/GTK の Pandora Radio デスクトップクライアント。\n\n- Spotify — プロプライエタリの音楽ストリーミングサービス。ローカル再生と Spotify の巨大なライブラリからのストリーミング（フリーアカウントが必要）をサポート。\n\n"
    },
    {
      "title": "オーディオタグエディタ",
      "level": 4,
      "content": "- Beets — 音楽ライブラリオーガナイザー、タグエディタ。\n\n- Demlo — 音楽のタグ付け、エンコード、バッチリネームなど。\n\n- id3 — ID3 1.x と 2.x タグを編集する、コマンドラインユーティリティ。\n\n- id3ted — コマンドラインの id3 タグエディタ。\n\n- id3v2 — id3v2 タグのコマンドラインエディタ。\n\n- MP3Info — MP3 の技術的な情報のビューアーと ID3 1.x タグエディタ。\n\n- MP3Unicode — mp3 ファイルの中の ID3 タグを異なるエンコーディングに変換するコマンドラインユーティリティ。\n\n- Taffy — シンプルなコマンドラインタグエディタ。多数の音声フォーマットに対応。\n\n- Tagutil — 音楽ファイルのタグを編集する CLI ツール。スクリプト化しやすいインターフェースとインタラクティブに使いやすいことの両方を提供することを目標にしています。\n\n- Audio Tag Tool — MP3 と Ogg Vorbis ファイルのタグを編集するためのツール。\n\n- Coquillo — 様々な音楽フォーマットのためのメタデータエディタ。\n\n- EasyTag — music ファイルの ID3 タグを回覧・編集・書込するためのユーティリティで、たくさんの音楽フォーマットをサポートしています。\n\n- Ex Falso — クロスプラットフォーム対応のフリーでオープンソースオーディオタグエディタとライブラリ管理。exfalso で実行できます。\n\n- GabTag — 音楽のタグ付けツールで、GTK で書かれています。\n\n- Kid3 — MP3, Ogg/Vorbis, FLAC, MPC, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV, AIFF ファイルタグエディタ。\n\n- KTag Editor — ID3v タグエディターで、Qt5 フレームワークで開発されています。mp3、wav、ogg、wma、flac、asf ファイルをサポートしています。\n\n- MP3Info GUI — MP3 の内部情報ビューアと ID3 1.x タグエディタ。グラフィカルインターフェースは gmp3info コマンドで起動できます。\n\n- Picard — Python によって書かれたクロスプラットフォームのオーディオタグエディタ (MusicBrainz 公式タグエディタ)。\n\n- NTag — グラフィカルなタグエディターで、毎日の生活のユースケースにフォーカスしています。\n\n- Puddletag — Windows 用の MP3tag のリプレースメント。\n\n- Qoobar — ユニバーサルな Qt ベースの音声タグ付けプログラム (クラシック音楽に特化)。\n\n- Tag Editor — Qt GUI によるタグエディタ。コマンドラインインターフェイスも装備。MP4/M4A/AAC (iTunes), ID3v1, ID3v2, Vorbis, Opus, FLAC and Matroska に対応。\n\n- Thunar Media Tags Plugin — Thunar File Manager にメディアファイル向けの特別な機能を追加します。タグの編集などの機能を含みます。\n\n"
    },
    {
      "title": "歌詞",
      "level": 4,
      "content": "- Floodlight Presenter — 教会向けのプレゼンテーションと歌詞のプログラムで、歌詞とメディアを表示できます。\n\n- Give Me Lyrics — どんなアプリケーションから再生中の曲でも、歌詞を見ることができます。\n\n- Lyrics — MPRIS インターフェースで、メディアプレーヤーに歌詞を表示します。\n\n- OSD Lyrics — 様々なメディアプレーヤーに対応した Lyric show。\n\n- clyrics — 拡張性がある歌詞取得プログラム。cmus や mocp のデーモンをサポート。\n\n- glyrc — コマンドラインの音楽関連のメタデータサーチエンジンで、歌詞のダウンロードもサポートしています。\n\n- Karaoke Lyrics Editor — カラオケ用の歌詞エディターと CD+G/動画エクスポーター。\n\n- LyricsX — 歌詞エディター。\n\n"
    },
    {
      "title": "オーディオコンバーター",
      "level": 4,
      "content": "- Caudec — マルチプロセスなコマンドラインオーディオコンバーターで、たくさんの形式をサポートしています (FLAC、MP3、Ogg Vorbis、Windows codecs と、それ以外にも多数)\n\n- Ecasound — マルチトラックオーディオの処理に特化したコマンドラインツール。オーディオの再生、録音と変換のような単純なタスク以外にも、マルチトラックのエフェクト処理、ミックス、録音と信号再利用にも使用することができます。\n\n- FFaudioConverter — バッチでのオーディオコンバーターとエフェクトプロセッサー。複数のファイルや、音楽や動画を含むフォルダー全体を、FFmpeg を用いて他のオーディオフォーマットへの変換をすることができます。\n\n- Flacon — 音楽のアルバム全体を含む1つの大きなオーディオファイルから、個別のトラックを抽出し、別々のオーディオファイルに保存します。\n\n- fre:ac — オーディオコンバーターと CD リッパーで、様々な人気のフォーマットとエンコーダーをサポートしています。\n\n- Gnac — GNOME の音声コンバーター。\n\n- SoundConverter — オーディオファイルを異なるフォーマットに変換するグラフィカルアプリケーション。\n\n- soundKonverter — 様々なオーディオコーバーターの Qt ベースの GUI フロントエンドです。\n\n- SoX — 様々なフォーマットのコンピューターオーディオのファイルを他のフォーマットに変換する、コマンドラインユーティリティ。\n\n"
    },
    {
      "title": "サウンド編集",
      "level": 4,
      "content": "Wikipedia:Comparison of digital audio editors も参照してください。\n\n- Audacity — デジタル音声の波形編集プログラム。\n\n- GNOME Sound Recorder — 録音と再生ができるサウンドレコーダアプリケーション。.flac, .ogg (OGG オーディオ, もしくは .oga), .wav 音声ファイル。\n\n- Gnome Wave Cleaner — デジタルオーディオエディターで、オーディオファイルのノイズ除去と増幅ができます。\n\n- Kwave — KDE 用のサウンドエディタ。\n\n- mhWaveEdit — グラフィカルプログラムで、音楽ファイルの編集、再生と録音ができます。\n\n- Mp3splt — mp3、ogg vorbis とネイティブ FLAC を、開始と終了の時間の位置を指定して、デコードせずに分割するユーティリティです。\n\n- ocenaudio — プロプライエタリでクロスプラットフォーム、簡単に使えて、高速で機能的なオーディオエディター。\n\n- Play it Slowly — 異なる速度やピッチでオーディオファイルを再生できます。\n\n- Polyphone — sf2 フォーマットを使用する SoundFont エディターで、サンプルから楽器を作成・編集することができます。\n\n- Snd — 先進的なサウンドエディターで、Emacs を大まかに真似ています。\n\n- Sweep — オーディオエディターとライブプレイバックツール。\n\n- WaveSurfer — サウンドの可視化と操作のためのツールです。代表的な応用例は、音声・サウンド解析や音声注釈・文字起こしです。\n\n"
    },
    {
      "title": "デジタル・オーディオ・ワークステーション",
      "level": 4,
      "content": "プロオーディオ も参照してください。\n\n- Ardour — マルチチャンネルハードディスクレコーダーとデジタルオーディオワークステーション。\n\n- Bitwig Studio — プロプライエタリなプロフェッショナル用デジタルオーディオワークステーション。\n\n- Frinika — シーケンサー、ソフトシンセ、リアルタイムエフェクトと録音の機能を持った、デジタルオーディオワークステーション。\n\n- LMMS — コンピューターによる作曲を支援する、デジタルオーディオワークステーションです。\n\n- MusE — MIDI/オーディオシーケンサー (デジタルオーディオワークステーション)で、録音と編集に対応していて、Linux 向けの完全なマルチトラック仮想スタジオになることを目標としています。\n\n- Non — モジュラー式のデジタルオーディオワークステーションで、タイムライン、シーケンサー、ミキサーとセッションマネージャーの4つの部分から構成されています。\n\n- Qtractor — Qt ベースのハードディスクレコーダーと、平均的なホームユーザーだけでなくプロフェッショナルユーザーの要求にも応えるパワフルなデジタルオーディオワークステーション。\n\n- REAPER — プロプライエタリなデジタルオーディオワークステーションで、完全なマルチトラックオーディオとMIDIの録音、編集、処理、ミキシングとマスタリングツールセットを提供します。\n\n- Rosegarden — ALSA と Qt を使って開発されたデジタルオーディオワークステーション、MIDI シーケンサー、楽譜エディタ、作曲・編曲ツールとして使用可能。\n\n- Tracktion Waveform — プロプライエタリなデジタルオーディオワークステーションで、現代的な音楽プロデューサーの要求に合わせて設計されています。\n\n"
    },
    {
      "title": "オーディオアナライザー",
      "level": 4,
      "content": "- audioprism — PulseAudio 入力と WAV ファイル向けのスペクトログラムツール。\n\n- BRP-PACU — デュアルチャンネル FFT ベースの音響解析ツールで、エンジニアが伝達関数法を用いてライブプロフェッショナルサウンドシステムを解析することを支援します。\n\n- Baudline — プロプライエタリな、時間周波数解析・スペクトログラムアナライザーです。\n\n- FMIT — 楽器をチューニングするためのグラフィカルユーティリティで、エラーと音量の履歴と、高度な機能を持っています。\n\n- Friture — リアルタイムオーディオアナライザー。\n\n- Mousai — audd.io の API を使って曲を特定する、シンプルなアプリケーション。\n\n- rtspeccy — リアルタイムオーディオスペクトラムアナライザー。\n\n- sndpeek — リアルタイムオーディオビジュアライゼーションツール。\n\n- SongRec — 非公式 Shazam クライアントで、任意のオーディオファイルやマイクからのオーディオを認識します。Rust で書かれています。\n\n- Sonic Visualiser — 音楽ファイルの内容を表示して解析します。\n\n- Spek — スペクトログラムを表示して、オーディオファイルの解析を支援します。\n\n"
    },
    {
      "title": "楽譜作成ソフトウェア",
      "level": 4,
      "content": "LilyPond#フロントエンド や Wikipedia:ja:楽譜作成ソフトウェア も参照してください。\n\n- Aria Maestosa — MIDI シーケンサー/エディター。スコア、キーボード、ギター、ドラムとコントローラービューを備えたユーザーフレンドリーな UI を数クリックすることで、MIDI ファイルの作曲、編集と再生ができます。\n\n- Canorus — 音楽スコアエディター。無制限の数と長さの五線譜、ポリフォニー、音符、コードネーム、歌詞の MIDI 再生、MIDI、MusicXML、ABC Music、MusiXTeX と LilyPond のようなフォーマットへのフィルターのインポート/エクスポートに対応しています。\n\n- Impro-Visor — 楽譜作成ソフトウェアで、ジャズミュージシャンが即興に似たソロを作曲して聞くことができるようにデザインされています。\n\n- LilyPond — 最高品質の楽譜を作成することを可能にするための、音楽作成プログラムです。\n\n- MuseScore — 楽譜を作成、再生と印刷することができます。\n\n- TuxGuitar — マルチトラックなギター・タブラチュアのエディター・プレイヤー。\n\n"
    },
    {
      "title": "オーディオ合成環境",
      "level": 4,
      "content": "Wikipedia:Comparison of audio synthesis environments も参照してください。\n\n- Blue — Csound の作曲環境で、Java で書かれています。\n\n- Cabbage — オーディオソフトウェア開発のためのフレームワークで、シンプルなマークアップテキストと Csound オーディオ合成言語を使用します。\n\n- ChucK — 精密な時間制御、並列でオンザフライな音楽プログラミング言語。\n\n- Csound — サウンドや音楽の処理システム。\n\n- CsoundQt — Csound のフロントエンドで、オートコンプリート、インタラクティブウィジェットと統合ヘルプを持つハイライトエディタを備えています。\n\n- FoxDot — Python と SuperCollider でのライブコーディング。\n\n- Pure Data — リアルタイムミュージックとマルチメディア環境。\n\n- Sonic Pi — コードベースの音楽作成とパフォーマンスツール。\n\n- SuperCollider — オーディオ合成とアルゴリズム作曲法のためのプラットフォームで、ミュージシャン、アーティストと音の研究者に使われています。\n\n- en:VCV Rack — 仮想ユーロラック DAW。より多くの Wikipedia:ja:ユーロラック のエミュレートされたモジュールを追加するためにプラグインシステムを使用します。\n\n"
    },
    {
      "title": "サウンドジェネレーター",
      "level": 4,
      "content": "このセクションは、 ドラムマシン、サンプラー と ソフトウェア・シンセサイザー を含みます。\n\n- ADLMIDI — OPL3/OPN2 のシンセサイザーで、ADLMIDI を使用しています。\n\n- ADLplug — ADLMIDI 向けの FM Yamaha OPL3 シンセサイザーです。\n\n- Agordejo — 音楽とオーディオの制作セッションマネージャーで、NSM ベースです。\n\n- ams — Alsa モジュラーシンセ。リアルタイムモジュラーシンセサイザーとエフェクトプロセッサー。\n\n- amsynth — アナログモデリングシンセサイザー (Analog Modelling SYNTHesizer)。使いやすいソフトウェアシンセサイザーで、クラシックな減算方式のシンセサイザー構造を持っています。\n\n- DIN — サウンドシンセサイザーと楽器。\n\n- Drumstick — MIDI ツールのセットで、ドラムグリッド、MIDI プレイヤー、バーチャルピアノを持っています。\n\n- Element — モジュラー LV2/VST3 オーディオプラグインホスト。\n\n- Fluajho — JACK 向けの SF2 サウンドフォントサンプルプレイヤーで、Fluidsynth ベースです。\n\n- FluidSynth — リアルタイムソフトウェアシンセサイザーで、SoundFont 2 の仕様に基づいています。\n\n- Geonkick — パーカッションのエレメントを合成できるシンセサイザーです。最も基本的な例は、キック、スネア、ハイハット、シェイカー、クラップです。\n\n- Gigedit — サンプルベースの仮想楽器向けの、グラフィカルな楽器エディタで、GigaStudio/Gigasampler ファイルフォーマットベースです。\n\n- GrandOrgue — バーチャルパイプオルガンサンプルプレイヤーアプリケーションで、HW1 互換のファイルフォーマットをサポートしています。\n\n- GSequencer — 自分の曲を再生、作成、編集、ミックスするための様々なツールを提供します。ステップシーケンサー、ピアノロール、オートメーションと波形エディターの機能があります。\n\n- Helm — コンピューターで電子音楽を作るためのソフトウェアシンセサイザーです。\n\n- Hydrogen — ドラムシーケンスを作成するための、先進的なドラムマシンです。\n\n- JSampler — LinuxSampler ソフトウェアオーディオサンプラーの Java GUI です。\n\n- OPNplug — OPNMIDI 向けの FM Yamaha OPN2 シンセサイザーです。\n\n- Patroneo — 使いやすい、パターンベースの MIDI シーケンサーです。\n\n- PySynth — シンプルな音楽シンセサイザーのスイートと、Python 3 で書かれたヘルパースクリプトです。\n\n- QMidiArp — 先進的な MIDI アルペジエーター、プログラム可能なステップシーケンサーと LFO。\n\n- QmidiCtl — MIDI リモートコントローラーアプリケーションで、MIDI データをネットワーク経由で、UDP/IP マルチキャストを利用して送信します。\n\n- QmidiNet — MIDI ネットワークゲートウェイアプリケーションで、MIDI データをネットワーク経由で、UDP/IP マルチキャストを利用して送受信します。\n\n- QMidiRoute — ALSA 向けの MIDI ルーターとプロセッサー。\n\n- Qsampler — LinuxSampler ソフトウェアオーディオサンプラー向けの Qt GUI。\n\n- Qsynth — Fluidsynth 向けの Qt GUI。\n\n- Qwertone — シンプルな音楽シンセサイザーアプリ (おもちゃのピアノ風) ですが、通常の qwerty キーボードを入力として使用します。\n\n- QXGEdit — XG デバイス向け (例： Yamaha DB50XG) の MIDI System Exclusive ファイルを編集するための Qt GUI です。\n\n- setBfree — DSP トーンホイールオルガン。\n\n- SpectMorph — 楽器のサンプルを解析して合成 (モーフィング) します。\n\n- TiMidity++ — ソフトウェアシンセサイザーで、MIDI ファイルを PCM 波形データに変換することで再生することができます。\n\n- Vee One Suite — 伝統的なソフトウェア楽器： 多声音楽の減算方式シンセサイザーの synthv1、多声音楽のサンプラーシンセサイザーの samplv1、さらに別のドラムキットサンプラーの drumkv1、多声音楽の加算方式のシンセサイザーの padthv1。\n\n- Vico — ミニマリストな Midi シーケンサーで、他のソフトウェアと並行で使うことを意図しています。\n\n- VMPK — 仮想 MIDI ピアノキーボード。MIDI イベントジェネレーターとレシーバー。midi サウンドフォントを使って音を生成したり、MIDI シンセサイザーを制御するのに使ったりできます。\n\n- Yoshimi — ソフトウェアシンセサイザーで、ZynAddSubFX のフォークです。\n\n- ZynAddSubFX — フル機能のソフトウェアシンセサイザーで、高価なハードウェアの一般的な音から、素晴らしい音の世界にブーストするような面白い音まで、多数の楽器を作成することができます。\n\n"
    },
    {
      "title": "音楽トラッカー",
      "level": 4,
      "content": "- Buzztrax — コンピューターとサウンドカードだけを使って作曲する音楽スタジオ。\n\n- FamiStudio — NES やファミコン向けの、とてもシンプルな音楽エディターです。\n\n- klystrack — C64/NES/Amiga スタイルのチップチューンをモダンなプラットフォーム上で作るためのトラッカーです。\n\n- MilkyTracker — .MOD と .XM モジュールファイルを作成するための音楽アプリケーション。\n\n- OpenMPT — コンピューターで素晴らしい音楽を作成・再生するためのトラッカーソフトウェア。\n\n- Radium — 新しい種類のインターフェースを持つ、音楽エディターです。\n\n- Schism Tracker — 高いクオリティの音楽を、特別で高価な設備なしに、一部を再現するのが難しいユニークな「指の感覚」で作成します。\n\n"
    },
    {
      "title": "DJ",
      "level": 4,
      "content": "- Giada — DJ、ライブパフォーマーと電子音楽家向けの、ミニマルでハードコアな音楽ツール。\n\n- IDJC — Shoutcast や Icecast サーバーを使ったインターネットストリーミングライブショーに興味がある個人向けの、強力で使いやすいソースクライアントです。\n\n- Linux Show Player — 強力で機能が豊富な、キューリストを作成するソフトウェアです。シアター再生とライブ音楽ショーのためにデザインされています。\n\n- Luppp — ライブでの使用を意図した、音楽作成ツールです。リアルタイム処理と、高速で直感的なワークフローにフォーカスされています。\n\n- Mixxx — DJ が、デジタル音楽ファイルを使って創造的なライブミックスのパフォーマンスをするのに必要なツールを統合します。\n\n- Seq24 — ライブパフォーマンス向けのミニマルなループベースの MIDI シーケンサーで、MIDI \"ループ\" を編集・再生するためのとてもシンプルなインターフェースを持っています。\n\n- xwax — Linux 向けのデジタルバイナルシステム (DVS) です。DJ やターンテーブリストが、デジタルオーディオファイル (MP3、Ogg Vorbis、FLAC、AAC など) を再生したり、通常のタイムコードレコードのペアを使ってコントロールしたりできます。\n\n"
    },
    {
      "title": "オーディオエフェクト",
      "level": 4,
      "content": "- Calf Plugin Pack for JACK — プラグインのセットと JACK インターフェースを使って、サウンドを処理・生成します。 (calfjackhost)\n\n- Carla — オーディオプラグインホストで、たくさんのオーディオドライバーやプラグインフォーマットをサポートしています。\n\n- guitarix — JACK 向けの仮想ギターアンプです。\n\n- PulseEffects — PipeWire 上で (古いパッケージでは PulseAudio 上で) PulseAudio アプリケーションと入力ソースにエフェクトを適用します。\n\n- Rakarrack — Richly featured multi-effects processor emulating a guitar effects pedalboard.\n\n"
    },
    {
      "title": "Audio visualizers",
      "level": 4,
      "content": "- Barva — Visualizer for PulseAudio that pulses the background of your terminal.\n\n- C.A.V.A. — ALSA, MPD, PulseAudio に対応しているコンソールベースのオーディオビジュアライザー。\n\n- Cavalcade — GTK GUI for C.A.V.A.\n\n- cli-visualizer — カスタマイズ性が高い CLI ベースのオーディオビジュアライザー。\n\n- GLava — OpenGL audio spectrum visualizer. Its primary use case is for desktop windows or backgrounds.\n\n- GLMViz — Fully configurable OpenGL music visualizer.\n\n- Le Biniou — User-friendly, powerful music visualization / VJing tool.\n\n- projectM — 3D アクセラレーションを使う反復画像ベースレンダリングを使うミュージックビジュアライザー。\n\n- VSXu — OpenGL-based (hardware-accelerated), modular programming environment with its main purpose to リアルタイムのオーディオビジュアルプリセットを作成・表示.\n\n"
    },
    {
      "title": "Remote audio",
      "level": 4,
      "content": "- jammr — Play jam sessions with musicians around the world over the internet.\n\n- Jamulus — Enables musicians to perform real-time jam sessions over the internet.\n\n- Noson — Fast and smart controller for SONOS devices.\n\n- SonoBus — Application for streaming high-quality, low-latency peer-to-peer audio between devices over the internet or a local network.\n\n- Upplay — Qt-based UPnP audio control point.\n\n"
    },
    {
      "title": "音量調整",
      "level": 4,
      "content": "See also PulseAudio#Front-ends and JACK Audio Connection Kit#GUI.\n\n- alsamixer — Soundcard mixer for ALSA soundcard driver, with ncurses interface.\n\n- ALSA Tray — Provides a systray icon and a command line interface for setting the volume of the ALSA Mixers.\n\n- AlsaVolume — Tray ALSA volume changer written using gtkmm.\n\n- AMixST — Volume wheel using ALSA and Qt5.\n\n- Emixer — Utility to control volume levels. Part of Enlightenment.\n\n- GNOME ALSA Mixer — ALSA mixer for GNOME.\n\n- GVolWheel — トレイアイコンからボリュームを操作できるオーディオミキサー。\n\n- KMix — KDE volume control program.\n\n- MATE Volume Control — Audio mixer application and system tray applet for MATE to mix audio and adjust volume levels of various audio mixer devices.\n\n- PNMixer — Obmixer のフォーク。ALSA のチャンネル選択、接続・切断の検出、ショートカットなどの機能が追加されています。\n\n- QasTools — Collection of desktop applications for the Linux sound system ALSA. It provides QasMixer (mixer), QasHctl (HCTL mixer) and QasConfig (configuration browser).\n\n- Retrovol — Retro-looking volume setting tray applet.\n\n- Volctl — Per-application system tray applet volume control for PulseAudio.\n\n- Volnoti — GNU/Linux などの POSIX オペレーティングシステム向けの軽量なボリューム通知デーモン。\n\n- Volti — 内蔵ミキサーとマルチメディアキーのサポートがある、システムトレイからオーディオボリュームを操作するための GTK アプリケーション。ALSA だけを使用します。\n\n- Volume Icon — チャンネル選択、テーマや外部ミキサーなどが使えるシステムトレイのボリュームコントロール。\n\n- VolWheel — トレイアイコンをスクロールしてサウンドボリュームを操作できる小さなアプリケーション。\n\n- Xfce ALSA Panel Plugin — Simple ALSA volume control plugin for Xfce4 panel.\n\n"
    },
    {
      "title": "CD リッピング",
      "level": 4,
      "content": "光学ディスクドライブ#CD を見て下さい。\n\n"
    },
    {
      "title": "ビデオプレーヤー",
      "level": 4,
      "content": "See also Wikipedia:Comparison of video player software.\n\n- FFplay — FFmpeg ライブラリと SDL ライブラリを使用するシンプルでポータブルなメディアプレイヤー。 It is mostly used as a testbed for the various FFmpeg APIs.\n\n- gst-play-1.0 — GStreamer のシンプルなコマンドライン再生テストツール。\n\n- MPlayer — 多様なビデオ・オーディオフォーマットをサポートしているビデオプレイヤー。\n\n- mpv — MPlayer と mplayer2 ベースの動画プレイヤー\n\n- VLC media player — TTY で HD 動画をスムーズに再生できる、有名なビデオプレイヤーのコマンドライン版。The rc interface can be launched with vlc -I rc, and the ncurses interface vlc -I ncurses で起動します。\n\n- Cinema — Video player and manager for watching local video files.\n\n- Clapper — GNOME media player built using GJS with GTK4 toolkit and powered by GStreamer with OpenGL rendering.\n\n- Glide — Simple and minimalistic media player relying on GStreamer for the multimedia support and GTK+ for the user interface.\n\n- GNOME Videos — GStreamer を使用する GNOME デスクトップのメディアプレイヤー (音声と動画の両方に対応)。gnome に含まれています。\n\n- Identity — Program for comparing multiple versions of an image or video.\n\n- Movie Monad — Free and simple to use video player made with Haskell using GStreamer and GTK. Precompiled and no Haskell dependency in run-time.\n\n- Pantheon Videos — Video player and library app designed for elementary OS using GStreamer.\n\n- Parole — GStreamer フレームワークによるモダンなメディアプレイヤー。\n\n- Rage — おまけ機能が存在する Enlightenment Foundation Libraries を使って書かれた動画・音声プレイヤー。Uses GStreamer\n\n- Snappy — ミニマルなインターフェイスを持つパワフルなメディアプレイヤー that uses GStreamer.\n\n- Spivak — Karaoke player based on GStreamer and Qt5.\n\n- Xnoise — \"スマートな GUI、スピードと多くの機能\"を備えた音声・ビデオ両方の GTK と GStreamer を使ったメディアプレイヤー (開発中止)。\n\n- Baka MPlayer — Free and open source, cross-platform, mpv based multimedia player (Qt 5).\n\n- Bomi — bomi is a graphical user interface(GUI) player based on mpv for Linux.\n\n- Celluloid — Simple GTK frontend for mpv, formerly GNOME MPV.\n\n- Clip — Video player and collection manager utilizing mpv as the backend.\n\n- Deepin Movie — Movie player for Deepin desktop based on mpv.\n\n- Haruna Video Player — Qt/QML video player built on top of mpv.\n\n- Kawaii-Player — Audio/video manager and multimedia player (based on mpv) with PC-to-PC casting feature, along with functionalities of portable media server and torrent streaming server.\n\n- KittehPlayer — A YouTube-like video player based on Qt, QML and mpv.\n\n- Media Player Classic Qute Theater — Clone of Media Player Classic reimplimented in Qt and based on mpv.\n\n- Minitube — YouTube desktop application written in C++ using mpv and Qt.\n\n- MoonPlayer — Video player for playing and downloading online videos from YouTube, Youku etc.\n\n- mpv — Very basic GUI for mpv. Can be launched with mpv --player-operation-mode=pseudo-gui.\n\n- mpvz — Qt5/QML based GUI for libmpv. Based on the Tethys theme for Bomi.\n\n- SMPlayer — Qt multimedia player with extra features (CSS themes, YouTube integration, etc.) based on mpv. It can use MPlayer as alternative backend.\n\n- xt7-player-mpv — Qt/Gambas GUI to mpv with a rich set of configurable options including filters and drivers, ladspa plugins support as well as library/playlist managment, YouTube, online radios, podcasts, DVB-T and more.\n\n- GNOME MPlayer — Simple GTK-based GUI for MPlayer.\n\n- Dragon Player — KDE 用のシンプルなビデオプレイヤー based on Phonon. Part of the kde-multimedia group.\n\n- KMPlayer — Simple Phonon-based video player for KDE and video player plugin for Konqueror. It can use MPlayer as alternative backend.\n\n- FreeTube — Desktop YouTube player built with privacy in mind. Use YouTube without advertisements and prevent Google from tracking you with their cookies and JavaScript. Based on the Electron platform.\n\n- Kaffeine — デフォルトで VLC をバックエンドに使う、多目的 KDE メディアプレイヤー。デジタル TV (DVB-T, DVB-C, DVB-S) をサポート。\n\n- Kaku — Highly integrated music player supports different online platform like YouTube, SoundCloud, Vimeo and more. Based on the Electron platform.\n\n- Kodi — Media player and entertainment hub for digital media.\n\n- QMPlay2 — T ベースの動画プレイヤー。ffmpeg と libmodplug がサポートしている全てのフォーマットを再生できます。モジュールシステムが統合されており、Youtube ブラウザなどが入っています。\n\n- QtAV Player — QtAV and FFmpeg ベースのシンプルなメディアプレイヤー。Run with Player or QMLPlayer.\n\n- Stremio — Extensible media center.\n\n- tvtime — High quality television application for use with video capture cards.\n\n- VLC media player — 中堅のビデオプレーヤー、様々なオーディオ・ビデオフォーマットをサポート。\n\n- xine — フリーのマルチメディアプレイヤー。\n\n- Xjadeo — Video player that displays a video-clip in sync with an external time source (MTC, LTC, JACK-transport).\n\n- YUView — Qt-based YUV player with an advanced analytic toolset.\n\n"
    },
    {
      "title": "Video converters",
      "level": 4,
      "content": "See also Wikipedia:Comparison of video converters and コーデック#Container format tools.\n\n- Avidemux CLI — 単純な切り取り、フィルタリング、エンコードなどの作業のためのフリーのビデオエディタ。\n\n- FFmpeg — 音声や動画を記録・変換・ストリーミングすることができる、完全なクロスプラットフォームのソリューション。\n\n- HandBrake CLI — mkv/x264 リッピングのバッチ処理にうってつけのシンプルでパワフルなビデオトランスコーダー。\n\n- MEncoder — Free command line video decoding, encoding and filtering tool.\n\n- Transcode — Command line tool for video stream processing.\n\n- Ciano — Simple multimedia file converter using FFmpeg and ImageMagick.\n\n- FFmpegYAG — Advanced GUI for the popular FFmpeg audio/video encoding tool.\n\n- FF Multi Converter — Simple graphical application which enables you to convert audio, video, image and document files between all popular formats, by utilizing other command-line tools.\n\n- HandBrake — mkv/x264 リッピングのバッチ処理にうってつけのシンプルでパワフルなビデオトランスコーダー。GTK バージョン。\n\n- QWinFF — Qt5 GUI for FFmpeg that can read audio and video files in various formats and convert them into other formats.\n\n- Transmageddon — 動画を GStreamer によってサポートされているフォーマットに変換するシンプルな python アプリケーション。\n\n- WinFF — Graphical video and audio batch converter using FFmpeg.\n\n"
    },
    {
      "title": "ビデオエディタ",
      "level": 4,
      "content": "See also Wikipedia:Comparison of video editing software.\n\n- Avidemux — 単純な切り取り、フィルタリング、エンコードなどの作業のためのフリーのビデオエディタ。\n\n- Blender — ノンリニアな動画エディタが組み込まれているフル機能の 3D グラフィック作成スイート。\n\n- Cinelerra (Heroine Virtual) — プロフェッショナルなビデオ編集・合成環境。\n\n- Cinelerra (Community Version) — プロフェッショナルなビデオ編集・合成環境。\n\n- Cinelerra GG Infinity — プロフェッショナルなビデオ編集・合成環境。\n\n- DaVinci Resolve — Proprietary A/V post-production software suite.\n\n- Flowblade — Linux 用のマルチトラック・ノンリニア動画エディタ。素早く、堅牢な編集環境を得られるように作られています。\n\n- Kdenlive — セミプロフェッショナルな作業のために設計されたノンリニアビデオエディタ。\n\n- Lightworks — 様々なフォーマットのデジタル動画を編集・マスタリングするための、プロプライエタリのプロフェッショナルノンリニア編集システム。\n\n- LiVES — ビデオエディタ and VJ (ライブパフォーマンス) platform.\n\n- LosslessCut — GUI tool for lossless trimming/cutting of video/audio files. Based on the Electron platform.\n\n- Natron — Open-source compositing software. Node-graph based. Similar in functionalities to Adobe After Effects and Nuke by The Foundry.\n\n- Olive — Non-linear video editor aiming to provide a fully-featured alternative to high-end professional video editing software.\n\n- OpenShot — MLT フレームワークを使ったノンリニアビデオエディタ。\n\n- Pitivi — 直感的に操作でき GNOME と協調するように作られたビデオエディタ。\n\n- Shotcut — フリーでオープンソースのクロスプラットフォーム動画エディタ。\n\n- VapourSynth Editor — Editor for VapourSynth scripts.\n\n- VidCutter — Fast lossless media cutter + joiner w/ frame-accurate SmartCut options powered by mpv, FFmpeg via a sleek Qt5 GUI.\n\n- Video Trimmer — Cut out a fragment of a video given the start and end timestamps. The video is never re-encoded, so the process is very fast and does not reduce the video quality.\n\n"
    },
    {
      "title": "Subtitles",
      "level": 4,
      "content": "- Penguin Subtitle Player — スタンドアロン字幕プレイヤー that provides a translucent window which always stays on the top so subtitles can be shown on top of the video without blocking anything.\n\n- SubtitlesPrinter — X の画面上に字幕を表示。動画プレイヤーに依存しません。\n\n- QNapi — Qt client for downloading movie subtitles from NapiProjekt, OpenSubtitles, Napisy24.\n\n- subdl — Command-line tool for downloading subtitles from opensubtitles.org.\n\n- SubDownloader — Automatic download/upload of subtitles using fast hashing.\n\nSee also Wikipedia:Comparison of subtitle editors.\n\n- Aegisub — Subtitle editor.\n\n- Gaupol — フル機能の字幕エディタ。\n\n- Gnome Subtitles — GNOME の動画字幕エディタ。\n\n- Jubler — Open-source multiplatform subtitle editor written in Java.\n\n- Subtitle Composer — 字幕エディタ for KDE supporting various formats, 様々なプレイヤーのバックエンドをサポートしており、波形を表示することもできます。\n\n- Subtitle Edit — Subtitle editing program. Written in C# using mono.\n\n- Subtitle Editor — GTK 3 tool to edit subtitles for GNU/Linux/*BSD.\n\n"
    },
    {
      "title": "スクリーンキャスト",
      "level": 4,
      "content": "スクリーンショットの取得#スクリーンキャスト を参照してください。\n\n"
    },
    {
      "title": "Miracast",
      "level": 4,
      "content": "See en:Miracast#Implementations.\n\n"
    },
    {
      "title": "ウェブカメラ",
      "level": 4,
      "content": "See also FFmpeg#Recording webcam and Wikipedia:Comparison of webcam software.\n\n- Cheese — Take photos and videos with your webcam, with fun graphical effects.\n\n- Deepin Camera — Tool to view camera, take photo and video.\n\n- fswebcam — Small and simple command line webcam software that generates images for a webcam.\n\n- Guvcview — Simple interface for capturing and viewing video from v4l2 devices.\n\n- Kamoso — Webcam recorder from KDE community.\n\n- MJPG-streamer — Command line application which can be used to stream M-JPEG over an IP-based network from a webcam to various types of viewers.\n\n- Motion — Highly configurable program that monitors video signals from many types of cameras. It is able to detect if a significant part of the picture has changed; in other words, it can detect motion.\n\n- Pantheon Camera — Camera app designed for elementary OS.\n\n- QtCAM — Webcam software with more than 10 image control settings, extension settings and color space switching.\n\n- v4l2ucp — Universal control panel for V4L2 devices.\n\n- v4l-utils — Provides a series of utilities for media devices.\n\n- Webcamoid — Full featured webcam suite.\n\n- ZArt — GUI for G'MIC real-time manipulations on the output of a webcam.\n\n"
    },
    {
      "title": "DVD authoring",
      "level": 4,
      "content": "See also Wikipedia:List of DVD authoring applications.\n\n- Bombono DVD — DVD authoring program with nice and clean GUI.\n\n- Devede — Program to create VideoDVDs and CDs.\n\n- DVDStyler — DVD authoring application for the creation of professional-looking DVDs.\n\n"
    },
    {
      "title": "DVD リッピング",
      "level": 4,
      "content": "光学ディスクドライブ#DVD を見て下さい。\n\n"
    },
    {
      "title": "Video thumbnails",
      "level": 4,
      "content": "- vcsi — Create video contact sheets. A video contact sheet is an image composed of video capture thumbnails arranged on a grid.\n\n- Video Contact Sheet — Bash script meant to create video contact sheets (previews) of videos. Any video supported by mplayer and ffmpeg can be used.\n\n"
    },
    {
      "title": "Game and interactive application development",
      "level": 3,
      "content": "- Godot Engine — Game development platform for both 2D and 3D games, with integrate IDE\n\n- LÖVE — Lua based game development environment\n\n- TIC-80 — Fantasy computer/console\n\n"
    },
    {
      "title": "Collection managers",
      "level": 3,
      "content": "- Data Crow — Media cataloger and media organizer.\n\n- GCstar — GNOME application for organizing various collections (board games, comic books, movies, stamps, etc.).\n\n- Griffith — Movie collection manager application.\n\n- MediaElch — Media manager for Kodi. Information about movies, TV shows, concerts and music are stored as nfo files.\n\n- Tellico — KDE application for organizing various collections (books, video, music, coins, etc.).\n\n- tinyMediaManager — Media management tool to provide metadata for Kodi.\n\n- vMovieDB — Movie collection manager for the Gnome desktop.\n\n"
    },
    {
      "title": "Media servers",
      "level": 3,
      "content": "- Airsonic — Web-based media streamer, providing ubiquitous access to your music. (Fork of Subsonic.)\n\n- Emby — Proprietary media server, which automatically converts and streams your media on-the-fly to play on any device.\n\n- OwnTone — DAAP (iTunes) and MPD media server with support for AirPlay devices, Apple Remote, Chromecast, Spotify and internet radio.\n\n- Gerbera — UPnP Media Server to stream your media to devices on your home network. (Fork of MediaTomb.)\n\n- Icecast — Streaming media (audio/video) server which currently supports Ogg (Vorbis and Theora), Opus, WebM and MP3 streams.\n\n- en:Jellyfin — Media system that puts you in control of managing and streaming your media.\n\n- Plex — Proprietary media server, which organizes your personal video, music, and photo collections and streams them to all of your devices.\n\n- ReadyMedia — Simple media server software, with the aim of being fully compliant with DLNA/UPnP-AV clients.\n\n- Rygel — UPnP AV MediaServer and MediaRenderer that allows you to easily share audio, video and pictures, and control of media player on your home network.\n\n- Serviio — Proprietary media server, which allows you to stream your media files (music, video or images) to renderer devices (e.g. a TV set, Bluray player, games console or mobile phone) on your connected home network.\n\n- Subsonic — Proprietary media server to stream from your own computer.\n\n- Tvheadend — TV streaming server and recorder supporting DVB-S, DVB-S2, DVB-C, DVB-T, ATSC, ISDB-T, IPTV, SAT>IP and HDHomeRun as input sources.\n\n- Universal Media Server — UPnP media server, which is capable of sharing video, audio and images between most modern devices. (Fork of PS3 Media Server.)\n\n"
    },
    {
      "title": "メタデータ",
      "level": 3,
      "content": "- CoreInfo — Simple media metadata viewer built on mediainfo library. Part of C-Suite.\n\n- DV Analyzer — Technical quality control and reporting tool that examines DV streams in order to report errors.\n\n- ExifTool — Command-line application for reading, writing and editing meta information in a wide variety of files.\n\n- Exiv2 — Command line utility to manage image metadata. It provides fast and easy read and write access to the Exif, IPTC and XMP metadata and the ICC Profile embedded within digital images in various formats.\n\n- ffprobe — Gather information from multimedia streams and print it in human- and machine-readable fashion.\n\n- jExifToolGUI — Java/Swing graphical frontend for ExifTool, which reads and writes all kind of metadata tags from/to image files.\n\n- jhead — Exif jpeg header manipulation tool.\n\n- MediaConch — Implementation checker, policy checker, reporter, and fixer.\n\n- MediaInfo — Convenient unified display of the most relevant technical and tag data for video and audio files.\n\n- sndfile-info — Obtaining information about the contents of an audio file.\n\n"
    },
    {
      "title": "Mobile device managers",
      "level": 3,
      "content": "- Android File Transfer — Interactive Media Transfer Protocol client with Qt5 GUI.\n\n- gnokii — 携帯電話を使うためのツールとユーザースペースドライバ。\n\n- gMTP — Simple MP3 and media player client for Media Transfer Protocol.\n\n- GNOME Phone Manager — GNOME デスクトップから携帯電話をコントロール。\n\n- gtkpod — GUI for Apple's iPod using GTK. It allows you to import your existing iTunes database, add songs, podcasts, videos and cover art, and to edit ID3 tags.\n\n- KDE Connect — Provides integration between devices.\n\n- Modem Manager GUI — Control EDGE/3G/4G broadband modem specific functions.\n\n- Wammu — Manage data in your cell phone such as contacts, calendar or messages.\n\n"
    },
    {
      "title": "光メディアの書き込み",
      "level": 3,
      "content": "光学ディスクドライブ#GUI で CD/DVD/BD を焼く を見てください。\n\n"
    },
    {
      "title": "コマンドシェル",
      "level": 4,
      "content": "次の記事を参照: コマンドラインシェル\n\n次も参照: Wikipedia:Comparison of command shells\n\n"
    },
    {
      "title": "ターミナルエミュレータ",
      "level": 4,
      "content": "ターミナルエミュレータとはターミナルを含むGUIウィンドウを表示する機能を有します。 それらエミュレータのほとんどは Xterm をエミュレートしていて、その Xterm は VT102 をエミュレートしていて、VT102 はタイプライターをエミュレートしています。For further background information, see Wikipedia:Terminal emulator.\n\nFor a comprehensive list, see Wikipedia:List of terminal emulators.\n\n- Alacritty — クロスプラットフォームの GPU アクセラレーションターミナルエミュレータ。\n\n- aterm — 透過をサポートした xterm 代替。2008年から urxvt に取って代わられています。\n\n- cool-retro-term — 昔のブラウン管ディスプレイを模した見た目が良いターミナルエミュレータ。\n\n- CoreTerminal — Terminal emulator based on qtermwidget. Part of C-Suite.\n\n- CuteCom — A graphical serial terminal.\n\n- Deepin Terminal — Terminal emulation application for Deepin desktop.\n\n- Eterm — Enlightenment デスクトップ向けに作られた xterm を代替するターミナルエミュレータ。\n\n- foot — Lightweight terminal emulator for Wayland with sixel support\n\n- Hyper — A terminal with JS/CSS support. Based on the Electron platform.\n\n- Konsole — KDE デスクトップのターミナルエミュレータ。\n\n- kitty — モダンで柔軟な設定が可能な OpenGL ベースのターミナルエミュレータ\n\n- Liri Terminal — Material Design terminal for Liri.\n\n- mlterm — 世界中の様々な文字セットやエンコーディングが使える多言語対応のターミナルエミュレータ。\n\n- moserial — GTK-based serial terminal for the GNOME desktop.\n\n- PuTTY — Highly configurable ssh/telnet/serial console program.\n\n- QTerminal — 軽量な Qt ベースのターミナルエミュレータ。\n\n- rxvt — xterm の人気代替。\n\n- shellinabox — ウェブベースの SSH ターミナル。\n\n- st — X 向けのシンプルなターミナル実装。\n\n- Station — Terminal emulation features different view modes such as split vertically and horizontally, a tabbed interface, and copy and paste commands.\n\n- Terminology — 革新的な機能を備えた Enlightenment プロジェクトチームによるターミナルエミュレータ:ファイルのサムネイルとメディアは、メディアプレーヤーのように再生されます。\n\n- urxvt — (Perl によって) 高い拡張性を持ちユニコードが使える rxvt クローンターミナルエミュレータ。タブ、URL 起動、Quake スタイルのドロップダウンモード、擬似透過をサポート。\n\n- wayst — Simple terminal emulator for Wayland and X11 with OpenGL rendering and minimal dependencies.\n\n- xterm — X Window System 用のシンプルなターミナルエミュレータ。ウィンドウシステムを直接使えないプログラム用に DEC VT102 や Tektronix 4014 互換のターミナルを提供します。\n\n- Yakuake — Konsole ベースのドロップダウンターミナル (Quake スタイル) エミュレータ。\n\n- zutty — A high-end terminal for low-end systems.\n\nVTE (Virtual Terminal Emulator) は初期の GNOME で GNOME Terminal で使うために開発されたウィジェットです。VTE ができてから、似た機能を持つ数多くのターミナルが生まれました。\n\n- Deepin Terminal (GTK version) — Old terminal emulation application for Deepin desktop.\n\n- EasySSH — SSH Connection Manager.\n\n- Germinal — ボーダーレスな最大化されたターミナルを表示する、最小主義のターミナルエミュレータ。デフォルトで tmux セッションにアタッチするので、タブやパネルが使えます。\n\n- GNOME Terminal — GNOME デスクトップのターミナルエミュレータ。ユニコードをサポート。\n\n- Guake — GNOME デスクトップ向けドロップダウンターミナル。\n\n- kermit — A VTE-based terminal emulator that aims to be simple, fast and effective.\n\n- King’s Cross — Simple user-friendly terminal emulator for the GNOME desktop.\n\n- LXTerminal — LXDE 向けのデスクトップ非依存のターミナルエミュレータ。\n\n- MATE terminal — MATE デスクトップの GNOME ターミナル のフォーク。\n\n- Pantheon Terminal — 超軽量・美麗・シンプルなターミナルエミュレータ。デフォルト設定で使うように作られているので設定がほとんどありません。\n\n- ROXTerm — 場所をとらないタブ式ターミナルエミュレータ。\n\n- sakura — GTK と VTE ベースのターミナルエミュレータ。\n\n- Terminator — マルチプルでリサイズ可能な端末パネルをサポートしたターミナルエミュレータ。\n\n- Termite — キーボード中心の VTE ベースのターミナル。タイル型またはタブをサポートしているウィンドウマネージャで使われるように作られています。 Unmaintained - the developers recommend switching to Alacritty.\n\n- Tilda — 設定可能なドロップダウンターミナルエミュレータ。\n\n- Tilix — タイル型ターミナルエミュレータ for GNOME.\n\n- Xfce Terminal — Xfce デスクトップに含まれているターミナルエミュレータ。カラープロンプト、タブをサポート。\n\n以下のターミナルエミュレータは カーネルモード設定を使っており X がなくても起動できます。\n\n- KMSCON — Linux オペレーティングシステム用のターミナルエミュレータを統合した KMS/DRM ベースのシステムコンソール（getty）です。\n\nGNU/Linux では、Linux カーネルの仮想デバイス (fbdev) や X の仮想フレームバッファシステム (xvfb) のことをフレームバッファと呼ぶことがあります。このセクションでは主としてカーネルの仮想デバイス fbdev をベースにするターミナルエミュレータをリストアップしています。\n\n- yaft — X をなくても動かせるシンプルなターミナルエミュレータ。UCS2 文字、壁紙、256color をサポート。\n\n- Fbterm — a fast FrameBuffer based TERMinal emulator for linux\n\n"
    },
    {
      "title": "ターミナルページャ",
      "level": 4,
      "content": "Wikipedia:Terminal pager を参照してください。\n\n- more — シンプルで機能の少ないページャです。util-linuxの一部です。\n\n- less — more に似たプログラムだが、前方・後方両方のスクロールをサポートし、ファイルの部分読み込みもできる。\n\n- most — マルチウィンドウ、左右スクロール、内蔵カラーをサポートしたページャ\n\n- mcview — マウスとカラーに対応したページャ。midnight commander にバンドルされている。\n\n- また、Vim はページャとして使うことができます。\n\n"
    },
    {
      "title": "ターミナルマルチプレクサ",
      "level": 4,
      "content": "Wikipedia:Terminal multiplexer も参照してください。\n\n- abduco — プロセスを制御端末とは別に実行させる、セッションのアタッチとデタッチをサポートするツール。\n\n- byobu — An GPLv3 licensed addon for tmux or screen. It requires a terminal multiplexer installed.\n\n- dtach — Program that emulates the detach feature of GNU Screen.\n\n- dvtm — dwm-style window manager in the console.\n\n- GNU Screen — 物理端末を多重化するフルスクリーンウィンドウマネージャ。\n\n- mtm — Simple terminal multiplexer with just four commands: change focus, split, close, and screen redraw.\n\n- tmux — BSDライセンスのターミナル・マルチプレクサ。\n\n- zellij — Rust で書かれた強化されたターミナル・マルチプレクサ\n\n- wezterm — Rust で実装された GPU アクセラレーションによるクロスプラットフォームなターミナルエミュレータおよびマルチプレクサ。\n\n"
    },
    {
      "title": "ファイルマネージャ",
      "level": 4,
      "content": "See also Wikipedia:Comparison of file managers.\n\n- Clex — フルスクリーンのユーザーインターフェイスを持つファイルマネージャ。\n\n- CliFM — The command line file manager: full-featured, fast, extensible, and lightweight as hell.\n\n- ded — directory editor, file manager similar to Emacs dired\n\n- Dired — Emacs と統合されたディレクトリエディタ。\n\n- joshuto — ranger-like terminal file manager written in Rust.\n\n- Last File Manager — curses インターフェイスを備えた Python 3 で書かれた強力なファイルマネージャ。\n\n- lf — Terminal file manager written in Go using server/client architecture.\n\n- Midnight Commander — コンソールベース、デュアルパネルのファイルマネージャー。\n\n- nffm — \"Nothing Fancy File Manager\"、C で書かれたマウスを使わない ncurses ファイルマネージャ。\n\n- nnn — Tiny, lightning fast, feature-packed file manager.\n\n- fff — A simple file manager written in Bash.\n\n- Pilot — Alpine メールクライアントについてくるファイルマネージャー。\n\n- Ranger — vi バインディング、カスタマイズ性、多機能をもったコンソールベースのファイルマネージャー。\n\n- Vifm — ncurses ベースの 2 パネルファイルマネージャー、vi ライクなキーバインド。\n\n- xplr — A hackable, minimal, fast TUI file explorer.\n\n- Caja — MATE デスクトップのファイルマネージャ。\n\n- CoreFM — Simple lightweight easy to use file manager with many features like image previews, mime-icon support, split view, auto-mounting of removable media, drag-n-drop support etc. Part of C-Suite.\n\n- Deepin File Manager — Deepin 用に開発されたファイルマネージャ。\n\n- Dolphin — KDE デスクトップのファイルマネージャー。\n\n- Gentoo — GTK の軽量ファイルマネージャ。\n\n- GNOME Files — 拡張性のある、カスタムスクリプトをサポートしているヘビー級のファイルマネージャー。GNOME のデフォルト。\n\n- Index — File manager that lets you browse your system files and applications and preview your music, text, image and video files and share them with external applications.\n\n- Konqueror — KDE デスクトップ用ファイルマネージャー。\n\n- Liri Files — The file manager for Liri.\n\n- Nemo — Nemo は Cinnamon デスクトップのファイルマネージャです。A fork of Nautilus.\n\n- Pantheon Files — File browser designed for elementary OS.\n\n- PathFinder — FOX ツールキット によるファイルブラウザ。\n\n- PCManFM — desktop icon や壁紙の管理などの機能をもっている very fast and 軽量ファイルマネージャー。\n\n- PCManFM-Qt — Qt port of PCManFM file manager.\n\n- Peony — File manager for the UKUI desktop.\n\n- qtFM — 小さく軽量な、純粋に Qt ベースの Linux デスクトップ用ファイルマネージャー。\n\n- ROX Filer — 小さく高速なファイルマネージャー。壁紙やパネルの管理なども可能。\n\n- Thunar — 高速に起動し素早くディレクトリを読み込むようにデーモンとして実行できるファイルマネージャー。\n\nNote that some of these twin-panel file managers can also be set to have only one pane.\n\n- Double Commander — 2つのパネルが並ぶファイルマネージャ。Total Commander にインスパイアされており新しいアイデアが実装されています。\n\n- GNOME Commander — GNOME デスクトップのデュアルパネルファイルマネージャ。\n\n- Krusader — KDE デスクトップ用の先進的なツインパネル (Midnight Commander スタイル) ファイルマネージャー。\n\n- muCommander — 軽量でクロスプラットフォームのファイルマネージャ。デュアルパネルのインターフェイスを持ち、Java で書かれています。\n\n- SpaceFM — GTK マルチパネルタブ式ファイルマネージャー。\n\n- Sunflower — 小さく細かく設定可能でプラグインをサポートしたツインパネルの Linux ファイルマネージャー。\n\n- trolCommander — Lightweight, dual-pane file manager written in Java. Fork of muCommander.\n\n- Tux Commander — 人気の Total Commander や Midnight Commander ファイルマネージャーに似た２つのパネルをもったウィンドウ型ファイルマネージャー。\n\n- Worker — 高速、軽量、機能豊富な X Window System 向けファイルマネージャー。\n\n- Xfe — Microsoft Explorer ライクの X 用ファイルマネージャー (X File Explorer)。\n\n"
    },
    {
      "title": "ゴミ箱管理",
      "level": 4,
      "content": "- trash-cli — FreeDesktop.org の Trash 規格 を実装するコマンドラインインターフェイス。\n\n"
    },
    {
      "title": "ファイル同期とバックアップ",
      "level": 4,
      "content": "バックアッププログラム、Wikipedia:Comparison of file synchronization software と Wikipedia:Comparison of backup software も見てください。\n\n- borg — Deduplicating backup program with compression and authenticated encryption that supports backing up over ssh\n\n- Déjà Dup — Simple GTK backup program. It hides the complexity of doing backups the 'right way' (encrypted, off-site, and regular) and uses duplicity as the backend.\n\n- DirSync Pro — Small, but powerful utility for file and folder synchronization.\n\n- Duplicati — Backup client that securely stores encrypted, incremental, compressed backups on cloud storage services and remote file servers.\n\n- duplicity — Simple command-line utility which allows encrypted compressed incremental backup to nearly any storage.\n\n- Duply — Command-line front-end for duplicity which simplifies running it. It manages backup job settings in profiles and allows to batch execute commands.\n\n- FreeFileSync — Folder comparison and synchronization software that creates and manages backup copies of all your important files.\n\n- git-annex — Manage files with git, without checking the file contents into git.\n\n- grsync — GTK+ GUI for rsync to synchronize folders, files and make backups\n\n- hsync — Command line program to sync only those files that have been renamed/moved but otherwise unchanged. It works by issuing simple move operations at the destination without actually transferring the files, and is meant to be used in conjunction with other synchronization programs that lack this capability.\n\n- rclone — Command line program to sync files and directories to and from Amazon S3, Dropbox, Google Drive, Microsoft OneDrive, Yandex Disk and many other cloud storage services as well as between local paths.\n\n- restic — Fast, secure, efficient backup program that supports backing up to many cloud services.\n\n- rsync — File transfer program that uses the \"rsync algorithm\" which provides a very fast method for bringing remote files into sync. It does this by sending just the differences in the files across the link, without requiring that both sets of files are present at one of the ends of the link beforehand. Has multiple frontends available.\n\n- SparkleShare — File sharing and collaboration application written in C#. It can sync with any Git server over SSH.\n\n- Syncthing — Continuous file synchronization program. It synchronizes files between two or more computers in a simple way without advanced configuration.\n\n- Syncany — Cloud storage and filesharing application with a focus on security and abstraction of storage.\n\n- Synkron — Application that helps you keep your files and folders always updated. You can easily sync your documents, music or pictures to have their latest versions everywhere.\n\n- Tarsnap — Secure, efficient proprietary online backup service.\n\n- Timeshift — A system restore tool for Linux.\n\n- Unison — File synchronization tool that allows two replicas of a collection of files and directories to be stored on different hosts (or different disks on the same host), modified separately, and then brought up to date by propagating the changes in each replica to the other.\n\n"
    },
    {
      "title": "Archiving and compression tools",
      "level": 4,
      "content": "For archiving and compression command-line tools, see アーカイブと圧縮.\n\n- 360zip — A proprietary archiving tool.\n\n- Ark — KDE デスクトップのアーカイブツール。\n\n- Arqiver — Simple Qt archive manager based on libarchive.\n\n- CoreArchiver — Simple file compressing/extracting utility based on Qt and libarchive-qt. Part of C-Suite.\n\n- Deepin Archive Manager — Fast and lightweight application for creating and extracting archives.\n\n- Engrampa — MATE のアーカイブマネージャ。\n\n- GNOME Archive Manager — GNOME のデフォルト圧縮ファイルマネージャ (previously File Roller).\n\n- LXQt File Archiver — Simple and lightweight desktop-agnostic Qt file archiver.\n\n- p7zip-gui — The GUI belonging to the p7zip software.\n\n- PeaZip — オープンソースのファイル・アーカイブマネージャ。\n\n- Xarchiver — GTK で作られた軽量なデスクトップ非依存のアーカイブマネージャ。\n\n"
    },
    {
      "title": "Comparison, diff, merge",
      "level": 4,
      "content": "See also Wikipedia:Comparison of file comparison tools.\n\nFor managing pacnew/pacsave files, specialised tools exist. See Pacnew と Pacsave ファイル#.pac* ファイルの管理.\n\nSee diff(1) from diffutils and its alternatives.\n\n- colordiff — 'diff' の Perl スクリプトラッパー。同じ出力にシンタックスハイライトを追加。\n\n- diffr — A Rust utility to pretty-print diff with highlighting at word-level for ease of review.\n\n- ydiff — A Python wrapper to get highlighted diff output from stdin or VCS-tracked file/dirs, in either unfied or side-by-side view.\n\n- delta — A diff viewer written in Rust with syntax highlighting.\n\n- diff-so-fancy — A diff output decorator. It does not calculate the diff, it only decorates it.\n\n- DiffPDF — Compare the text or the visual appearance of each page in two PDF files.\n\n- Diffuse — Python で書かれた小さくてシンプルなテキストマージツール。\n\n- KDiff3 — KDE デスクトップのファイルとディレクトリの比較・マージツール。\n\n- Kompare — ソースファイルの差を回覧・マージするための GUI フロントエンドプログラム。様々な diff フォーマットをサポートし、表示する情報レベルをカスタマイズするための多くのオプションがある。\n\n- Meld — ビジュアル比較・マージツール。ファイル・ディレクトリ・プロジェクトのバージョンの比較が可能。\n\n- xxdiff — ファイルやディレクトリの差異を表示するグラフィカルブラウザ。\n\nVim と Emacs にはそれぞれ vimdiff と ediff というマージ機能があります。\n\n"
    },
    {
      "title": "バッチ処理リネームプログラム",
      "level": 4,
      "content": "See rename(1) from util-linux.\n\n- edir — Rename, delete, and copy files and directories using your editor (enhanced vidir).\n\n- f2 — Cross-platform command-line tool for batch renaming files and directories quickly and safely, can also rename files based on audio tags.\n\n- rename.pl — perl regex ベースのバッチリネーマー。\n\n- vidir — Rename and delete files and directories using your editor.\n\n- Caja-Rename — Batch renaming extension for Caja.\n\n- CoreRenamer — Simple lightweight batch file renamer application. Part of C-Suite.\n\n- GPRename — ファイルとディレクトリの名前を変える GTK バッチ処理プログラム。\n\n- KRename — KDE デスクトップ向けのとてもパワフルなバッチ処理リネームプログラム。\n\n- metamorphose2 — wxPython ベースのバッチリネーマーで、正規表現や、メタデータによるマルチメディアファイルの名前変更などをサポートしています。\n\n- Thunar Bulk Rename — Change the name of multiple files at once using some criterion that applies to at least one of the files. Run with thunar -B.\n\n"
    },
    {
      "title": "ファイル検索",
      "level": 4,
      "content": "This section lists utilities for file searching based on filename, file path or metadata. For full-text searching, see the next section.\n\nSee also Wikipedia:List of search engines#Desktop search engines.\n\nSee find(1) from findutils and its alternatives.\n\n- Catfish — 多目的のファイル検索ツール by Xfce, can be powered by find, locate and Zeitgeist.\n\n- CoreHunt — Easy to use fast file searching tool with categorized search and search history. Part of C-Suite.\n\n- GNOME Search Tool — ファイルを検索する Gnome ユーティリティ, depends on GNOME Files.\n\n- KFind — Search tool for KDE to find files by name, type or content. Has internal search and supports locate.\n\n- MATE Search Tool — MATE utility to search for files.\n\n- regexxer — Interactive search and replace tool featuring Perl-style regular expressions.\n\n- Searchmonkey — 正規表現が使えるパワフルな GUI 検索ユーティリティ。\n\nThese programs index your files to allow for quick searching.\n\n- Basenji — Volume indexing tool designed for easy and fast indexing of CD/DVD and other type of volume collections.\n\n- fsearch — A fast file search utility for Unix-like systems based on GTK 3.\n\n"
    },
    {
      "title": "Full-text searching",
      "level": 4,
      "content": "See grep(1) from grep and its alternatives, which provide non-indexed full-text search.\n\n- Baloo — KDE のファイルインデックス作成・検索ソリューション, has a CLI and is used by KRunner.\n\n- DocFetcher — Graphical Java デスクトップ検索アプリケーション。\n\n- Recoll — Xapian がバックエンドのフルテキスト検索ツール, has CLI and GUI.\n\n- Tracker — オールインワンのインデックス作成・検索ツールとメタデータのデータベース, used by GNOME Documents, Music, Photos and Videos.\n\n- Zeitgeist — Event aggregation framework for the user's activities and notifications (files opened, websites visited, conversations had, etc.), has several third-party front-ends.\n\n"
    },
    {
      "title": "Code forges",
      "level": 4,
      "content": "- GitLab — Project management and code hosting application.\n\n- Gitea — Painless self-hosted Git service. Community managed fork of Gogs.\n\n- git-open — Open a repo website (GitHub, GitLab, Bitbucket) in your browser\n\n- github-cli — GitHub's official command line tool\n\n- hub — Command line interface for GitHub\n\n- lab — A hub-like tool for GitLab\n\n- snippet — A terminal based interface to create a new GitLab snippet\n\n"
    },
    {
      "title": "バージョン管理システム",
      "level": 4,
      "content": "Wikipedia:Comparison of revision control software も参照してください。\n\n- Bazaar — Distributed version control system that helps you track project history over time and to collaborate easily with others.\n\n- CVS — Concurrent Versions System, a client-server revision control system.\n\n- Darcs — Distributed revision control system that was designed to replace traditional, centralized source control systems such as CVS and Subversion.\n\n- Fossil — Distributed VCS with bug tracking, wiki, forum, and technotes.\n\n- Git — Distributed revision control and source code management system with an emphasis on speed.\n\n- Mercurial — Distributed version control system written in Python and similar in many ways to Git.\n\n- Subversion — Full-featured centralized version control system originally designed to be a better CVS.\n\n"
    },
    {
      "title": "ビルド自動化",
      "level": 4,
      "content": "See also Wikipedia:List of build automation software.\n\n- Apache Ant — Java ライブラリとコマンドラインツール。相互に依存するターゲットや拡張ポイントにあわせてビルドファイルに書かれている手順を実行します。\n\n- Apache Maven — Build automation tool used primarily for Java.\n\n- CMake — ソフトウェアをビルド、テスト、パッケージ化するためのツール群。\n\n- GNU make — プログラムのグループを管理するための、GNU make ユーティリティ。\n\n- Meson — Extremely fast and user friendly build system.\n\n- Gradle — JVM の強力なビルドシステム。\n\n- Phing — あらゆる作業を自動化する PHP プログラム。\n\n"
    },
    {
      "title": "統合開発環境",
      "level": 4,
      "content": "See also Wikipedia:Comparison of integrated development environments.\n\nFor PHP specific list, see PHP#Development tools.\n\n- Android Studio — The official Android development environment based on IntelliJ IDEA.\n\n- Anjuta — プロジェクト管理、アプリケーションウィザード、インタラクティブデバッガ、ソースエディタ、バージョンコントロールなど多数のツールを備えた多目的 IDE。\n\n- Aptana Studio — ウェブ開発を対象にしている Eclipse ベースの IDE。HTML, CSS, Javascript, Ruby on Rails, PHP, Adobe AIR などをサポート。\n\n- Bluefish — Powerful editor targeted towards programmers and webdevelopers, with many options to write websites, scripts and programming code. It supports many programming and markup languages.\n\n- Code::Blocks — C, C++ and Fortran IDE built to meet the most demanding needs of its users. It is designed to be very extensible and fully configurable.\n\n- CLion — A cross-platform IDE for C and C++.\n\n- CodeLite — C++ で書かれた C/C++/PHP/Node.js のオープンソースなクロスプラットフォーム IDE。\n\n- Cloud9 — ブラウザやクラウドで動く最新の IDE、どこでも・いつでもアプリケーションを実行・デバッグ・開発できます。\n\n- Eclipse — IDE for Java, C/C++, PHP, Perl and Python with subversion support and task management.\n\n- Eric — PyQt5 によるフル機能の Python / Ruby IDE。\n\n- Gambas — Basic インタプリタをベースにオブジェクト指向の拡張を加えたフリーの開発環境。\n\n- Geany — Small and lightweight IDE with many supported many programming and markup languages including C, Java, PHP, HTML, Python, Perl, Pascal.\n\n- GNOME Builder — Tool to write and contribute to great GNOME-based applications.\n\n- KDevelop — 機能豊富なプラグインを使うことができる C/C++ などのプログラミング言語の IDE。\n\n- Komodo Edit — フリーの、多言語エディタ。\n\n- Lazarus — Delphi (Object Pascal) compatible IDE for Rapid Application Development. It has variety of components ready for use and a graphical form designer to easily create complex graphical user interfaces.\n\n- LiteIDE — シンプルな Go の IDE。\n\n- MPLAB — Microchip PIC と dsPIC 開発のための IDE。\n\n- Netbeans — Java, JavaScript, PHP, Python, Ruby, Groovy, C, C++, Scala, Clojure などの言語で開発するための統合開発環境 (IDE)。\n\n- PhpStorm — JetBrains PhpStorm は PHP 向けの商用のクロスプラットフォーム IDE です。JetBrains の IntelliJ IDEA プラットフォームの上で動作し、providing an editor for PHP, HTML and JavaScript with PHP や JavaScript コードをオンザフライでコード解析したり、エラー補正や自動リファクタリングが行えるエディタを提供します。\n\n- Qt Creator — Qt での開発に焦点をおいた軽量なクロスプラットフォームの C++ 統合開発環境。\n\n- Theia — Eclipse Theia is a free and open-source IDE for desktop and web applications. It is implemented in TypeScript, is based on Visual Studio Code, and emphasizes extensibility. It can be run as a web or a desktop application.\n\n- Visual Studio Code — Visual Studio Code is a cross-platform, free and open-source text editor developed by Microsoft, written in JavaScript and TypeScript. It supports a variety of languages thanks to its extensions.\n\n- VSCodium — Free/Libre Open Source Software Binaries of VSCode.\n\n- BlueJ — 教育や初心者が主に使うことを目的とした完全な機能を備えた Java IDE。\n\n- IntelliJ IDEA — 高度なリファクタリング機能を持つ Java, Groovy などのプログラミング言語向けの IDE。\n\n- Ninja-IDE — IDE for Python development.\n\n- PyCharm — Python でのプログラミングに使われる IDE。コード解析、デバッグ、ユニットテスト、バージョンコントロール、Django によるウェブ開発をサポート。\n\n- Spyder — MATLAB のような機能を提供する科学用 Python 開発環境。\n\n- Thonny — 初心者向けの Python IDE。\n\n- WingIDE — Proprietary Python development environment. It is fully featured and meant for professional use.\n\nSee also: [1]\n\n- IntelliJ IDEA — IDE for Java, Groovy and other programming languages with advanced refactoring features.\n\n- Visual Studio Code — Visual Studio Code is a cross-platform, free and open-source text editor developed by Microsoft, written in JavaScript and TypeScript. It supports a variety of languages thanks to its extensions.\n\n- VSCodium — Free/Libre Open Source Software Binaries of VSCode.\n\n- Etoys — Educational tool and media-rich authoring environment for teaching children.\n\n- KTurtle — Educational programming environment that aims to make learning how to program as easily as possible. Part of kde-education.\n\n- Processing — Playground for teaching non-programmers the fundamentals of computer programming in a visual context.\n\n- Scratch — インタラクティブなプロジェクトやシンプルなスプライトベースのゲームを作成できる、教育とエンターテイメント用の programming system and content development tool。イベント駆動型プログラミングのエントリのように初心者 (子供など) を主に対象としています。\n\n"
    },
    {
      "title": "Debuggers",
      "level": 4,
      "content": "- Accerciser — Interactive Python accessibility explorer. It uses the AT-SPI library to inspect, examine, and interact with widgets, allowing you to check if an application is providing correct information to assistive technologies and automated testing frameworks.\n\n- Bustle — Draws sequence diagrams of D-Bus activity. It shows signal emissions, method calls and their corresponding returns, with time stamps for each individual event and the duration of each method call.\n\n- Data Display Debugger — Graphical front-end for command-line debuggers such as GDB.\n\n- Desed — TUI-based debugger for sed. Features variable and regex preview, setting breakpoints and stepping back and forth.\n\n- D-Feet — Easy to use D-Bus debugger to inspect D-Bus interfaces of running programs and invoke methods on those interfaces.\n\n- GammaRay — Qt-application inspection and manipulation tool.\n\n- KCachegrind — Profile data visualization tool, used to determine the most time consuming execution parts of program.\n\n- KDbg — Graphical user interface to GDB, the GNU debugger. It provides an intuitive interface for setting breakpoints, inspecting variables, and stepping through code.\n\n- Massif-Visualizer — Visualizer for Valgrind Massif data files.\n\n- Nemiver — Easy to use standalone C/C++ debugger (GDB front-end) that integrates well in the GNOME environment.\n\n- Qt QDbusViewer — Tool to introspect D-Bus objects and messages.\n\n- scanmem — Debugging utility designed to isolate the address of an arbitrary variable in an executing process.\n\n- Sysprof — Profiling tool that helps in finding the functions in which a program uses most of its time.\n\n"
    },
    {
      "title": "Lexing and parsing",
      "level": 4,
      "content": "Lex and Yacc are part of POSIX.\n\n- flex — A tool for generating text-scanning programs, alternative to Lex.\n\n- Berkeley Yacc — Berkeley reimplementation of the Unix parser generator Yacc.\n\n- GNU Bison — The GNU general-purpose parser generator, alternative to byacc.\n\nAnd then there are also:\n\n- ANTLR — Parser generator, written in Java, for parsing structured text or binary files.\n\n- LPeg — Pattern-matching library, based on PEGs, for Lua.\n\n- peg/leg — Recursive-descent parser generators for C.\n\n- Ragel — Compiles finite state machines from regular languages into executable C, C++, Objective-C, or D code.\n\n"
    },
    {
      "title": "GUI builders",
      "level": 4,
      "content": "- FLUID — FLTK GUI designer.\n\n- Glade — Create or open user interface designs for GTK applications.\n\n- KUIViewer — Quick viewer for Qt Designer UI File.\n\n- Qt Designer — Tool for designing and building graphical user interfaces (GUIs) with Qt Widgets.\n\n"
    },
    {
      "title": "Hex editors",
      "level": 4,
      "content": "See also Wikipedia:Comparison of hex editors.\n\n- Bless — High quality, full featured hex editor.\n\n- GHex — Hex editor for GNOME, which allows the user to load data from any file, view and edit it in either hex or ascii.\n\n- hyx — Minimalistic but powerful console hex editor.\n\n- Reverse Engineer's Hex Editor — Hex editor with features for analyzing and annotating binary file formats\n\n- Okteta — KDE hex editor for viewing and editing the raw data of files.\n\n"
    },
    {
      "title": "JSON tools",
      "level": 4,
      "content": "- gron — gron transforms JSON into discrete assignments to make it easier to grep.\n\n- jid — JSON incremental digger\n\n- jo — A command to create JSON.\n\n- jq — Command-line JSON processor\n\n- jshon — A JSON parser for the shell.\n\n- the Elvish shell has built-in support for JSON\n\n"
    },
    {
      "title": "Literate programming",
      "level": 4,
      "content": "See also Wikipedia:Literate programming.\n\n- Noweb — A Simple, Extensible Tool for Literate Programming build against ICON libs and texlive\n\n- nuweb — A Simple Literate Programming Tool\n\n"
    },
    {
      "title": "UML modelers",
      "level": 4,
      "content": "See also Wikipedia:List of Unified Modeling Language tools.\n\n- ArgoUML — UML modeling tool with support for all standard UML 1.4 diagrams.\n\n- Eclipse Modeling Tools — Tools and runtimes for building model-based applications.\n\n- Gaphor — Simple modeling tool for UML.\n\n- Modelio — Modeling environment supporting the main standards: UML, BPMN, MDA, SysML.\n\n- Papyrus — Model-based engineering tool based on Eclipse.\n\n- PlantUML — Tool to create UML diagrams from a plain text language.\n\n- PlantUML QEditor — PlantUML editor written in Qt.\n\n- Umbrello — Unified Modelling Language (UML) diagram program based on KDE Technology.\n\n- UML Designer — Graphical tool based on Eclipse to edit and visualize UML models.\n\n- UMLet — UML tool with a simple user interface: draw UML diagrams fast, build sequence and activity diagrams from plain text, export diagrams to eps, pdf, jpg, svg, and clipboard, share diagrams using Eclipse, and create new, custom UML elements.\n\n- UML/INTERLIS-editor — Facilitate the application of the model driven approach to a greater number of users.\n\n- Violet — Very easy to learn and use UML editor that draws nice-looking diagrams.\n\n"
    },
    {
      "title": "API documentation browsers",
      "level": 4,
      "content": "- Devhelp — Developer tool for browsing and searching API documentation.\n\n- Doc Browser — API documentation browser with support for DevDocs and Hoogle.\n\n- Qt Assistant — Tool for viewing on-line documentation in Qt help file format.\n\n- quickDocs — Fast developer docs reader for reading Valadoc and DevDocs.\n\n- Zeal — Offline API documentation browser for software developers.\n\n"
    },
    {
      "title": "課題追跡システム",
      "level": 4,
      "content": "- Bugzilla — Mozilla によるバグトラッカー。\n\n- Flyspray — PHP で書かれた軽量なウェブベースのバグ追跡システム\n\n- MantisBT — ウェブベースの課題追跡システム\n\n- Redmine — 柔軟なプロジェクト管理のためのウェブアプリケーション。Ruby on Rails を使用して書かれており、クロスプラットフォームおよびクロスデータベース対応。\n\n- Request Tracker (RT) — オープンソースの代表的な課題追跡システム。\n\n- Trac — Apache と Subversion を使用する統合 SCM & プロジェクト管理システム。\n\nen:Git server#Advanced web applications を参照。\n\n"
    },
    {
      "title": "コードレビュー",
      "level": 4,
      "content": "- Gerrit — Git バージョン管理システム上に構築されたウェブベースのコードレビュー ツール\n\n- GitLab もコードレビューをサポートしています。\n\nWikipedia:List of tools for code review も参照してください。\n\n"
    },
    {
      "title": "ゲーム開発",
      "level": 4,
      "content": "Wikipedia:List of game engines も参照してください。\n\n- GDevelop — プログラミングスキルが不要で、誰でも使用できるゲーム作成ツール。\n\n- en:Godot — 高度で機能満載のマルチプラットフォーム対応の 2D および 3D ゲームエンジン。Godot の独自のアプローチを使用して、簡単にゲームを作成できます。\n\n- LibreSprite — アニメーションスプライトエディタおよびピクセルアートツールで、ビデオゲーム用の 2D アニメーションを作成できます。\n\n- Pixelorama — Orama Interactive によって Godot Engine と GDScript を使用して作成された、アニメーション対応の 2D スプライトエディタ。\n\n- Tiled — 強力なタイルマップ編集機能を備えた汎用の 2D レベルエディタ。使いやすさを重視して設計されており、多くのタイプのゲームに適しています。\n\n- Unity — Unity は、マルチプラットフォームの 3D および 2D ゲームを作成するための柔軟で強力な開発プラットフォームです。プロプライエタリですが、特定の使用例には無料バージョンが利用可能です（詳細はこちらをご覧ください）。\n\n"
    },
    {
      "title": "Repository managers",
      "level": 4,
      "content": "Table content:\nこの記事あるいはセクションで使われている用語や表現には問題が存在します。 議論: Redirects to company blogs should not be here. (議論: トーク:アプリケーション一覧#)\n\n- Nexus 2 — Nexus 2 Repository Manager (OSS)\n\n- Nexus 3 — Nexus 3 Repository OSS\n\n- Artifactory — Artifactory is an advanced Binary Repository Manager for use by build tools, dependency management tools and build servers\n\n"
    },
    {
      "title": "Character selectors",
      "level": 4,
      "content": "- GNOME Characters — Character map application for GNOME.\n\n- gucharmap — GTK 3 character selector for GNOME.\n\n- KCharSelect — Tool to select special characters from all installed fonts and copy them into the clipboard. Part of kde-utilities.\n\n"
    },
    {
      "title": "スクリーンキーボード",
      "level": 4,
      "content": "- CellWriter — Grid-entry handwriting recognition input panel.\n\n- CoreKeyboard — Simple X11 based Qt virtual keyboard with word suggestions. Part of C-Suite.\n\n- eekboard — Easy to use virtual keyboard toolkit.\n\n- Florence — Extensible scalable on-screen virtual keyboard for GNOME that stays out of your way when not needed.\n\n- Onboard — Onscreen keyboard useful for tablet PC users and for mobility impaired users.\n\n- qtvkbd — Virtual keyboard written in Qt, a fork of kvkbd.\n\n- QVKbd — Virtual keyboard written in Qt.\n\n- Squeekboard — GTK 3 virtual keyboard for Wayland, written in Rust/C.\n\n- theShell On Screen Keyboard — Touchscreen keyboard for theShell.\n\n- xvkbd — Virtual keyboard for X window system.\n\n"
    },
    {
      "title": "キーボードレイアウトの切り替え",
      "level": 4,
      "content": "- fbxkb — NETWM 互換のキーボードインジケータ・スイッチャー。システム領域にある現在のキーボードのフラグを表示し、他のキーボードに切り替えることが可能です。\n\n- xxkb — 軽量なキーボードレイアウトインジケータ・スイッチャー。\n\n- gxkb — X11 keyboard layout indicator and switcher.\n\n- qxkb — Qt で書かれているキーボード切り替えアプリケーション。\n\n- X Neural Switcher — テキストアナライザ。入力の言語を検出して必要に応じてキーボードレイアウトを修正します。\n\n"
    },
    {
      "title": "Keybinding managers",
      "level": 4,
      "content": "See キーボードショートカット#Xorg.\n\n"
    },
    {
      "title": "インプットメソッド",
      "level": 4,
      "content": "See the main article: インプットメソッド.\n\n"
    },
    {
      "title": "パーティション分割ツール",
      "level": 4,
      "content": "See パーティショニング#パーティショニングツール.\n\n"
    },
    {
      "title": "Formatting tools",
      "level": 4,
      "content": "See ファイルシステム#ファイルシステムのタイプ.\n\n"
    },
    {
      "title": "Cloning tools",
      "level": 4,
      "content": "See ディスクのクローン#ディスククローンソフトウェア.\n\n"
    },
    {
      "title": "マウントツール",
      "level": 4,
      "content": "See also udisks#Mount helpers.\n\n- 9mount — 9p ファイルシステムをマウント。\n\n- cryptmount — 暗号化されたファイルシステムを通常ユーザーでマウント。\n\n- KDiskFree — Displays information about hard disks and other storage devices. It also allows to mount and unmount drives and view them in a file manager.\n\n- ldm — udev を使ってドライブを自動的にマウントする軽量なデーモン。\n\n- pmount — 通常ユーザーでソースを自動的に作成する /media/source_name にマウント。\n\n- pmount-safe-removal — 安全に取り除けるように通常ユーザーでリムーバブルデバイスをマウント。\n\n- udevil — 通常ユーザーでリムーバブルデバイスをマウント。デバイス情報を表示して、デバイスの変更を監視。udev と glib にだけ依存。\n\n- ws — Windows ネットワーク共有をマウント (CIFS と VFS)。\n\n- zulucrypt — 暗号化ボリュームを作成・管理・マウントする cryptsetup の GUI フロントエンド。EncFS もサポート。\n\n"
    },
    {
      "title": "ディスク使用量表示プログラム",
      "level": 4,
      "content": "- duc — ディスク使用量を調査するためのライブラリとツールスイート。\n\n- gdu — Disk usage analyzer with console interface written in Go.\n\n- gt5 — 差分が表示できる \"du-browser\"。\n\n- ncdu — シンプルな ncurses ディスク使用量アナライザ。\n\n- Filelight — コンピュータのディスク使用量を、リング状のマップに視覚化するディスク使用量アナライザ。\n\n- GNOME Disk Usage Analyzer — GNOME デスクトップ用のディスク使用量アナライザ to check folder sizes and available disk space.\n\n- Graphical Disk Map — ファイルやディレクトリサイズにあわせて長方形を表示するディスク使用量アナライザ。\n\n- fsview (part of Konqueror) — KDE based disk usage analyzer that draws a map of rectangles sized according to file or dir sizes.\n\n- MATE Disk Usage Analyzer — Disk usage analyzing tool for MATE Desktop.\n\n- qdirstat — Qt-based directory statistics (KDirStat/K4DirStat without any KDE - from the original KDirStat author).\n\n"
    },
    {
      "title": "Disk health status",
      "level": 4,
      "content": "See S.M.A.R.T.#GUI applications.\n\n"
    },
    {
      "title": "File recovery tools",
      "level": 4,
      "content": "See ファイルリカバリ#List of utilities.\n\n"
    },
    {
      "title": "Disk cleaning",
      "level": 4,
      "content": "- duff — A command-line utility for quickly finding duplicates in a given set of files.\n\n- fclones — Very fast duplicate file Finder written in rust.\n\n- fdupes — Program for identifying or deleting duplicate files residing within specified directories.\n\n- jdupes — Identify and take actions upon duplicate files.\n\n- rdfind — Command line tool that finds duplicate files. It compares files based on their content.\n\n- rmlint — 重複するファイルを素早く見つけ出すツール (任意で削除も可能)。\n\n- BleachBit — ディスク容量を開けてプライバシーを守ります。キャッシュやクッキー、インターネット履歴、一時ファイル、ログなどを消去。\n\n- dupeGuru — GUI tool to find duplicate files in a system.\n\n- FSlint — A utility to find and clean various forms of lint on a filesystem.\n\n- GConf Cleaner — gconf データベースに居座っている不必要な gconf キーを消去。\n\n- Shredder — Graphical user interface for rmlint.\n\n- Sweeper — System cleaning utility for KDE.\n\n"
    },
    {
      "title": "Disk image writing",
      "level": 4,
      "content": "See also Wikipedia:List of tools to create Live USB systems.\n\n- Deepin Boot Maker — Tool to make boot disk for Deepin OS.\n\n- Fedora Media Writer — Tool that helps users put Fedora images on their portable drives such as flash disks.\n\n- GNOME MultiWriter — Write an ISO file to multiple USB devices at once.\n\n- Image Burner — Simple imageburner designed for elementary OS.\n\n- ISOImageWriter — Tool to write a .iso file to a USB disk.\n\n- LiveUSB Install — Install various Linux distributions and operating systems on removable flash drive or external disk drive.\n\n- MultiBootUSB — Install multiple live distributions on a USB disk non-destructively and has an option to uninstall them.\n\n- MultiSystem — GUI tool to create a USB system that can boot multiple distributions.\n\n- Popsicle — Utility for flashing multiple USB devices in parallel, written in Rust.\n\n- SUSE Studio ImageWriter — Utility for writing raw disk images & hybrid isos to USB keys.\n\n- UNetbootin — Installs Linux/BSD distributions to a partition or USB drive.\n\n- Usbimager — Minimal GUI application to write compressed disk images to USB drives.\n\n- WoeUSB — Simple tool to create USB stick windows installer from an ISO image or a real DVD. (Fork of WinUSB).\n\n- windows2usb — Windows 7/8/8.1/10 ISO to Flash Drive burning utility for Linux with MBR/GPT, BIOS/UEFI, FAT32/NTFS support\n\n"
    },
    {
      "title": "タスクマネージャ",
      "level": 4,
      "content": "- CoreStats — Simple lightweight system resource viewer to monitor the CPU, RAM, Network and Disk IO statistics. Part of C-Suite.\n\n- Deepin System Monitor — Monitor system process status for Deepin desktop.\n\n- GNOME System Monitor — GNOME のシステムモニタ to view and manage system resources.\n\n- GNOME Usage — View information about use of system resources, like memory and disk space.\n\n- htop — シンプルな、ncurses 対話式プロセスビューア。\n\n- bpytop — Htop but more lightweight with more features.\n\n- btop — Rewrite of bpytop in C++\n\n- KSysGuard — KDE のタスクマネージャ・パフォーマンスモニタ。\n\n- Linux Process Explorer — Linux 向けのグラフィカルプロセスエクスプローラー。\n\n- LXTask — LXDE の軽量なタスクマネージャー。\n\n- qps — Lightweight task manager for LXQt.\n\n- MATE System Monitor — MATE のシステムモニター。\n\n- Stacer — System optimizer and application monitor that helps users to manage entire system with different aspects, its an all in one system utility.\n\n- Task Manager — Xfce の GTK2/GTK3 プロセス管理アプリケーション with basic system resource monitor\n\n"
    },
    {
      "title": "システム監視",
      "level": 4,
      "content": "カテゴリ:状態監視と通知も参照してください。\n\n- Conky — 軽量でスクリプト式のシステムモニタ。\n\n- Collectd — rrdtool ベースのシンプルで拡張性のあるシステム監視デーモン。消費リソースが少なくて、スタンドアロンに、またはサーバー・クライアントアプリケーションとして設定できます。\n\n- collectl — 軽量なパフォーマンス監視ツール。対話式にレポートを作成したりディスクにログを出力できます。CPU やディスク、InfiniBand、Lustre、メモリ、ネットワーク、NFS、プロセス, quadrics, slabs などの統計情報を読みやすいフォーマットでまとめます。\n\n- dstat — 多目的リソース統計ツール。\n\n- Fsniper — Daemon to run scripts based on changes in files monitored by inotify.\n\n- GKrellM — シンプルで柔軟性のある GTK 向けシステムモニタパッケージ。多くのプラグインが含まれている。\n\n- glances — Python 製の CLI curses ベース監視ツール。\n\n- kmon — Linux kernel manager and activity monitor.\n\n- Nagstamon — Status monitor that connects to multiple Nagios, Icinga, Opsview, Centreon, Op5 Monitor/Ninja, Checkmk and Thruk monitoring servers.\n\n- netdata — ウェブベースのリアルタイムパフォーマンスモニター。\n\n- Telegraf — Agent written in Go for collecting, processing, aggregating, and writing metrics.\n\n- Paramano — 軽量なバッテリモニター、CPU 周波数スケーラ。trayfreq のフォーク。\n\n- Sysstat — リソース管理ツールのコレクション: iostat, isag, mpstat, pidstat, sadf, sar。\n\n- xosview — SGI IRIX の gr_osview に似ているシステムモニター。\n\n- zps — A small utility for listing and reaping zombie processes on GNU/Linux.\n\n"
    },
    {
      "title": "Hardware sensor monitoring",
      "level": 4,
      "content": "See lm_sensors#Graphical front-ends.\n\n"
    },
    {
      "title": "システム情報ビューア",
      "level": 4,
      "content": "- alsi — Arch Linux のシステム情報ツール。スクリプトのソースコードを修正しなくても他のシステム用に設定することが可能です。\n\n- archey3 — Arch Linux のロゴとシステム情報を表示する Python スクリプト。\n\n- dmidecode — SMBIOS/DMI の仕様による BIOS に書かれているシステムのハードウェア情報を表示します。\n\n- hwdetect — /sys によってエクスポートされたモジュールを表示するシンプルなスクリプト。\n\n- hwinfo — openSUSE 由来のパワフルなハードウェア検出ツール。\n\n- hw-probe — Tool to probe for hardware, check operability and find drivers with the help of Linux Hardware Database.\n\n- inxi — システム情報を取得するためのスクリプト。\n\n- neofetch — w3m で画像を表示することができる高速・カスタマイズ可能なシステム情報スクリプト。\n\n- nmon — Console based application for monitoring various system components.\n\n- pfetch — A pretty system information tool written in POSIX sh.\n\n- screenfetch — archey と似ていますがスクリーンショットを取得することができます。bash で書かれています。\n\n- GPU-Viewer — GUI to glxinfo, vulkaninfo, clinfo and es2_info; written in Python with GTK.\n\n- hardinfo — ハードウェアとオペレーティングシステムに関する情報を表示する小さなアプリケーション。Windows のデバイスマネージャに似ています。\n\n- i-Nex — システムで利用できるハードウェアコンポーネントの情報を収集して Windows の人気ツール CPU-Z に似ているユーザーインターフェースで情報を表示するアプリケーション。\n\n- lshw — マシンのハードウェア設定に関する情報を詳しく表示する小さなツール。CLI と GTK のインターフェイス。\n\n- KInfoCenter — Centralized and convenient overview of system information for KDE.\n\n- USBView — Display the topology of devices on the USB bus.\n\n"
    },
    {
      "title": "System log viewers",
      "level": 4,
      "content": "- GNOME Logs — Viewer for the systemd journal. Part of gnome.\n\n- GNOME System Log — System log viewer for GNOME.\n\n- KSystemLog — System log viewer tool for KDE.\n\n- MATE System Log — System log viewer for MATE.\n\n- Pacman Log Viewer — Tool used to inspect pacman log file, in particular it lists installed, removed and upgraded packages letting you to filter by package's name and/or date.\n\n- QJournalctl — Qt-based graphical user interface for systemd's journalctl command.\n\n"
    },
    {
      "title": "Font viewers",
      "level": 4,
      "content": "See also Wikipedia:Font management software.\n\n- Deepin Font Manager — A font management tool for Deepin desktop.\n\n- Font Manager — Simple font management for GTK desktop environments.\n\n- Fonty Python — Manage, view and find your fonts.\n\n- GNOME Fonts — Font viewer for GNOME.\n\n- KFontview — KDE application to view and install different types of fonts.\n\n- MATE Font Viewer — Font viewer for MATE.\n\n"
    },
    {
      "title": "Help viewers",
      "level": 4,
      "content": "See man ページ#インストール.\n\n"
    },
    {
      "title": "Command schedulers",
      "level": 4,
      "content": "See also Cron.\n\n- FcronQ — Fcron GUI, an advanced periodic command scheduler.\n\n- GNOME Schedule — Graphical interface to crontab and at for GNOME.\n\n- KCron — Tool for KDE to run applications in the background at regular intervals. It is a graphical interface to the Cron command.\n\n- KTimer — Little tool for KDE to execute programs after some time. It allows you to enter several tasks and to set a timer for each of them. The timers for each task can be started, stopped, changed, or looped.\n\n"
    },
    {
      "title": "Shutdown timers",
      "level": 4,
      "content": "- GShutdown — Advanced shutdown utility which allows you to schedule the shutdown or the restart of your computer, or logout your actual session.\n\n- Hsiu-Ming's Timer — Graphical shutdown timer, which enables you to shutdown, turn off monitor, reboot or play sound after a period of time.\n\n- KShutdown — Graphical shutdown utility, which allows you to turn off or suspend a computer at a specified time. It features various time and delay options, command-line support, and notifications.\n\n"
    },
    {
      "title": "時刻同期",
      "level": 4,
      "content": "See 時刻同期.\n\n"
    },
    {
      "title": "Screen management",
      "level": 4,
      "content": "See Xrandr#Graphical front-ends.\n\n"
    },
    {
      "title": "Backlight management",
      "level": 4,
      "content": "See バックライト#バックライトユーティリティ.\n\n"
    },
    {
      "title": "Color management",
      "level": 4,
      "content": "See en:ICC profiles#Utilities and バックライト#色補正.\n\n"
    },
    {
      "title": "Printer management",
      "level": 4,
      "content": "See CUPS#GUI applications.\n\n"
    },
    {
      "title": "Bluetooth management",
      "level": 4,
      "content": "See Bluetooth#Front-ends.\n\n"
    },
    {
      "title": "電源管理",
      "level": 4,
      "content": "See 電源管理#ユーザースペースツール.\n\n"
    },
    {
      "title": "System management",
      "level": 4,
      "content": "See Systemd#GUI configuration tools.\n\n"
    },
    {
      "title": "Boot management",
      "level": 4,
      "content": "See GRUB/Tips and tricks#GUI configuration tools.\n\n"
    },
    {
      "title": "パッケージ管理",
      "level": 4,
      "content": "See pacman ヒント#ユーティリティ.\n\n"
    },
    {
      "title": "Virtualization",
      "level": 4,
      "content": "See Libvirt#Client and VirtualBox.\n\n"
    },
    {
      "title": "Compatibility layers",
      "level": 4,
      "content": "See Wine (Windows) and Darling (MacOS).\n\n"
    },
    {
      "title": "テキストエディタ",
      "level": 3,
      "content": "See also Wikipedia:Comparison of text editors.\n\nSome of the lighter-weight 統合開発環境 can also serve as text editors.\n\n"
    },
    {
      "title": "Vi-style text editors",
      "level": 4,
      "content": "- Amp — Rust で書かれたテキストエディタで、Vim のコア機能をシンプルにして、近代的なテキストエディタに求められる機能をバンドルすることを目標としています。\n\n- Aretext — vim と互換性のあるキーバインディングを備えたシンプルなテキストエディタ。\n\n- BusyBox vi — \"小さな vi クローン\" を提供。次のコマンドで起動できます。busybox vi.\n\n- Kakoune — モーダルエディタ。キーストロークが少なく、選択ベースでマルチカーソル編集を使うことができ、直交デザインを取っています。\n\n- Helix — モダンなモーダルテキストエディタ。\n\n- Neovim — 21世紀の Vim 再誕。\n\n- Neovim-Qt — Qt GUI 製の Neovim\n\n- vi — オリジナルの ex/vi テキストエディタ。\n\n- Vim (Vi IMproved) — 標準の Unix エディタである 'vi' に多くの機能を追加した先進的なテキストエディタ。\n\n- Vis — モダンでレガシーフリー、単純ながら効率的な vim ライクなエディタ。\n\n"
    },
    {
      "title": "Emacs-style text editors",
      "level": 4,
      "content": "- Emacs — 拡張性がありカスタマイズが多用でドキュメント豊富なリアルタイムディスプレイエディタ by GNU.\n\n- mg — 小型で高速、ポータブルな Emacs 互換エディタ。\n\n- MicroEmacs — Ncurses ベースのテキストエディタ。\n\n- vile — vi ライクなキーバインドを使用する軽量な Emacs クローン。\n\n- Zile — 軽量な Emacs クローン。\n\n"
    },
    {
      "title": "コンソール",
      "level": 4,
      "content": "- dte — マルチタブインターフェース、シンタックスハイライト、ctags ナビゲーションなどを備えた、小さくて使いやすいエディタ。\n\n- e3 — 依存パッケージのない、アセンブラで書かれた小さなエディタ。\n\n- ee — クラシックな curse ベースのテキストエディタ。HP-UX で誕生し、FreeBSD で使われています。\n\n- JED — S-Lang ライブラリ を使って拡張するテキストエディタ。コンソール版 (jed) と X ウィンドウ版 (xjed) があります。\n\n- JOE (Joe's Own Editor) — 使いやすいように設計されている端末ベースのテキストエディタ。\n\n- mcedit — Midnight Commander ファイルマネージャに付属している便利なテキストエディタ。\n\n- micro — 近代的で直感的なターミナルベースのテキストエディタ。Go で書かれておりプラグインで拡張できます。\n\n- Minimum Profit — プログラマ向けのテキストエディタ。\n\n- nano — テキストエディタpicoをベースとしたコンソールテキストエディタ。画面上にキー操作が表示されます。\n\n- ne — Windows ライクなキーバインドを使用するミニマリストテキストエディタ。\n\n- slap — Sublime ライクなターミナルベースのテキストエディタ。\n\n- Tilde — Windows ライクなキーバインドを備えた直感的なテキストエディタ。\n\n"
    },
    {
      "title": "グラフィカル",
      "level": 4,
      "content": "- Acme — Rob Pike によって開発されている Plan 9 OS 向けの最小主義の柔軟性のあるプログラミング環境。\n\n- Adie — Fast and convenient programming text editor.\n\n- Atom — GitHub によって開発されている待望のテキストエディタ。Node.js で書かれたプラグインのサポート、Git の制御が組み込まれています。\n\n- Beaver — モジュラー・ライトウェイト・スタイリッシュに設計された GTK エディタ。\n\n- Brackets — コードエディタ for the web。JavaScript, HTML, CSS で書かれています。\n\n- CorePad — Simple lightweight but powerful text editor with syntax-highlighting support for a dozen or more languages. Part of C-Suite.\n\n- Deepin Text Editor — Simple text editor for Deepin desktop.\n\n- Ecrire — Simple text editor based on EFL.\n\n- Enki — Text editor for programmers.\n\n- FeatherPad — ダークテーマをネイティブで搭載しタブ・印刷・シンタックスハイライトをサポートするミニマルな Qt5 のプレーンテキストエディタ。\n\n- FLTK Editor — Simple text editor application for FLTK.\n\n- gCSVedit — Simple text editor for CSV, TSV and other kinds of delimiter-separated values (DSV) files.\n\n- gedit — GNOME デスクトップの GTK エディタ。シンタックスハイライト、自動インデント、パターンマッチなどの機能があり、さらに機能を追加するための多数のプラグインが存在します。\n\n- GNOME Text Editor — Simple text editor for GNOME focused on a pleasing default experience.\n\n- Gobby — 複数の文章を一つのセッションで、マルチユーザーのチャットを使って編集できる共同作業エディタ。\n\n- Howl — General purpose, fast and lightweight editor with a keyboard-centric minimalistic user interface.\n\n- jEdit — プログラマーのためのテキストエディタ、Java で書かれています。\n\n- JuffEd — Qt で書かれた、シンタックスハイライトのできるシンプルなタブテキストエディタ。\n\n- Kate — KDE デスクトップの MDI とファイルシステムブラウザがついたフル機能のプログラマー用エディタ。\n\n- KWrite — Kate のウィジェットとしても使われている KDE デスクトップの軽量なテキストエディタ。\n\n- L3afpad — シンプルなテキストエディタ。Leafpad のフォークで、GTK 3 をサポート。\n\n- Leafpad — シンプルさを強調した GTK のメモ帳クローン。\n\n- Light Table — Next generation code editor that connects you to your creation with instant feedback.\n\n- Liri Text — Text editor for Liri.\n\n- medit — プログラミング用テキストエディタ。\n\n- Mousepad — Xfce デスクトップ環境の軽快なテキストエディタ。\n\n- NEdit — Motif 環境のテキストエディタ。\n\n- Notepadqq — Qt ベースで Notepad++ ライクなテキストエディタ。100以上の言語のシンタックスハイライトをサポート。\n\n- Nota — Easy to use text editor with a simple interface with support for tabbed documents, syntax highlighting for various languages, Focus mode, annotations, configurable fonts, and colors, a side panel with an integrated file browser, and more.\n\n- Pantheon Code — Code editor for elementaryOS. It auto-saves your files, meaning they are always up-to-date. Plus it remembers your tabs so you never lose your spot, even in between sessions.\n\n- Pluma — MATE のパワフルなテキストエディタ。\n\n- QSciTE — SciTE テキスト・コードエディタの Qt クローン。\n\n- Sam — グラフィカルユーザーインターフェースのある最小主義のテキストエディタ。Rob Pike によって開発されており、パワフルなコマンド言語、リモート編集機能などがある。\n\n- SciTE — プログラムのビルド・実行を容易くする一般的に使いやすいエディタ。\n\n- Scribes — シンプリシティとパワーを併せ持つ究極最小主義のテキストエディタ。\n\n- Sublime Text — Proprietary の C++ と Python ベースのエディタ。先進的な機能やプラグインが多数存在しながら軽量で外観も綺麗です。\n\n- Tau — Minimal GTK front end to the xi editor core written in Rust.\n\n- TEA — Qt ベースの高機能なテキストエディタ。\n\n- Textadept — Lua で拡張できる機能豊富なテキストエディタ。Scintilla をベースとしており C で書かれています。\n\n- Textosaurus — Simple cross-platform text editor based on Qt and QScintilla.\n\n- Visual Studio Code — 近代的なウェブ・クラウドアプリケーションをビルド・デバッグするためのエディタ。\n\n- xed — Text editor based on Pluma developed for Linux Mint.\n\n- XEdit — X Window System のシンプルなテキストエディタ。\n\n- wxMEdit — Text/Hex editor written in C++ and wxWidgets.\n\n"
    },
    {
      "title": "Office suites",
      "level": 4,
      "content": "See also Wikipedia:Comparison of office suites.\n\n- Calligra — 活発に開発されている KOffice (KDE のオフィススイート) のフォーク。OpenOffice のほとんどの機能を持っていてスマートフォン版 (Calligra Mobile) やタブレット版 (Calligra Active) もあります。\n\n- LibreOffice — The office productivity suite compatible to the open and standardized ODF document format. Fork of OpenOffice, supported by The Document Foundation.\n\n- OnlyOffice — Office suite that combines text, spreadsheet and presentation editors.\n\n- OpenOffice — オープンソースのオフィススイート。ワードプロセッサ、スプレッドシート、プレゼンテーション、グラフィック、データベースなど (現在は Apache ライセンス)。\n\n- SoftMaker Office — 軽量で機能豊富な Microsoft Office 互換のオフィススイート。ワードプロセッサ、スプレッドシート、プレゼンテーショングラフィックソフトウェアが付属。\n\n- WPS Office — プロプライエタリなオフィススイート。旧名 Kingsoft Office。\n\n- Yozo Office — Proprietary office suite, compatible with MS Office.\n\n"
    },
    {
      "title": "ワードプロセッサ",
      "level": 4,
      "content": "See also Wikipedia:Comparison of word processors.\n\n- en:AbiWord — フル機能のワードプロセッサ。\n\n- Calligra Words — Calligra スイートに含まれているパワフルなワードプロセッサ。\n\n- LibreOffice Writer — LibreOffice スイートに含まれているフル機能のワードプロセッサ。\n\n- OpenOffice Writer — OpenOffice スイートに含まれているフル機能のワードプロセッサ。\n\n- Ted — 使いやすい GTK ベースのリッチテキストプロセッサ (脚注をサポート)。\n\n- WordGrinder — Word processor for the console.\n\n- BlueGriffon — World Wide Web 用の新しい WYSIWYG コンテンツエディタ。\n\n- PageEdit — ePub visual XHTML editor.\n\n- SeaMonkey Composer — SeaMonkey スイートに含まれているパワフルでシンプルな HTML エディタ。\n\n- gLabels — ラベルや名刺 and media covers を作るためのプログラム。\n\n- Scribus — デスクトップパブリッシングプログラム。Uses hyphen and its language packs for hyphenation.\n\n"
    },
    {
      "title": "Presentations",
      "level": 4,
      "content": "- Calligra Stage — Easy to use yet still flexible presentation application included in the Calligra Suite.\n\n- LibreOffice Impress — Presentation program included in the LibreOffice suite.\n\n- OpenOffice Impress — Presentation program included in the OpenOffice suite.\n\n- sent — Simple plaintext presentation tool.\n\n- Sozi — Zooming presentation editor and player. Based on the Electron platform.\n\n- Spice-Up — Create simple and beautiful presentations.\n\n"
    },
    {
      "title": "スプレッドシート",
      "level": 4,
      "content": "See also Wikipedia:Comparison of spreadsheet software.\n\n- Calligra Sheets — Calligra スイートに含まれているパワフルな表計算アプリケーション。\n\n- Gnumeric — GNOME デスクトップの一部になっているスプレッドシートプログラム。\n\n- LibreOffice Calc — LibreOffice スイートに含まれているフル機能の表計算アプリケーション。\n\n- OpenOffice Calc — OpenOffice スイートに含まれているフル機能の表計算アプリケーション。\n\n- Pyspread — Pyspread is aPython プログラミング言語で書かれた新しいスプレッドシートアプリケーション。\n\n- sc — curses ベースの軽量スプレッドシート。\n\n- sc-im — sc ベースのスプレッドシートプログラム。\n\n"
    },
    {
      "title": "データベースツール",
      "level": 4,
      "content": "DBMS 特有のツールについては、以下を参照してください:\n\n- MySQL#グラフィカルツール\n- PostgreSQL#グラフィカルツール\n- SQLite#グラフィカルツール\n\nまた、Wikipedia:Comparison of database tools も参照してください。\n\n- Adminer — 多くのデータベースタイプをサポートする、フル機能のデータベース管理ウェブアプリ。\n\n- DBeaver — 多くのデータベースタイプをサポートする、Java ベースのグラフィカルデータベースエディタ。\n\n- DbVisualizer — ユニバーサルデータベースツール。\n\n- GdaBrowser — データベースの構造や内容に素早くアクセスできるグラフィカルツール。\n\n- GSQL — GNOME の統合データベース開発ツール。2010 年に最後のリリース。\n\n- Kexi — KDE による視覚的データベースアプリケーション作成ツールで、スプレッドシートとより高度な開発を必要とするデータベースソリューションの間のギャップを埋めるよう設計されています。\n\n- LibreOffice Base — 多様なユーザーのニーズを満たすよう設計された、LibreOffice スイートに含まれるフル機能のデスクトップデータベースフロントエンド。\n\n- OpenOffice Base — 多様なユーザーのニーズを満たすよう設計された、OpenOffice スイートに含まれるフル機能のデスクトップデータベースフロントエンド。\n\n- Orbada — データベース開発者、SQL 開発者、DBA 管理者、および SQL の知識とスキルを向上させたいユーザー向けの優れたツール。\n\n- Sequeler — Vala と Gtk で構築された SQL クライアント。ローカルおよびリモートのデータベースに接続し、言語認識を備えた便利なテキストエディタで SQL を記述し、Gtk.Grid Widget で SELECT 結果を視覚化できます。\n\n- SQuirreL SQL Client — JDBC 対応データベースの構造を表示し、テーブル内のデータを閲覧し、SQL コマンドを発行することができるグラフィカルな Java プログラム。\n\n- TOra — Oracle、MySQL、PostgreSQL などの一般的なデータベースプラットフォームにアクセスできるデータベース管理 GUI で、Qt の ODBC サポートを介してアクセスできるターゲットに対しては限定的なサポートも提供します。\n\n- Glom — 使いやすいデータベースデザイナーおよびユーザーインターフェイス。\n\n- Symphytum — 複雑なデータベース言語やソフトウェアのユーザーインターフェイスを学ばずに、データを簡単かつ直感的に管理および整理したいすべての人のための個人向けデータベースソフトウェア。\n\n- TreeLine — ほぼあらゆる種類の情報をツリー構造に保存でき、整理が簡単です。\n\n"
    },
    {
      "title": "Formula editors",
      "level": 4,
      "content": "See also #TeX formula editors and Wikipedia:Formula editor.\n\n- LibreOffice Math — Create and edit scientific formulas and equations. Included in the LibreOffice suite.\n\n- OpenOffice Math — Create equations and formulas for your documents. Included in the OpenOffice suite.\n\n"
    },
    {
      "title": "マークアップ言語",
      "level": 3,
      "content": "Wikipedia:Comparison of document markup languages も参照。\n\n- Sphinx — reStructuredText によるドキュメント生成システム。複数のフォーマットで出力可能 (Python プロジェクトのためのドキュメントシステム)。\n\n- txt2tags — すごくわかりやすい、KISS-準拠の軽量な人間に読めるマークアップ言語。リッチフォーマットコンテンツをプレーンテキストファイルから作成。\n\n"
    },
    {
      "title": "AsciiDoc",
      "level": 4,
      "content": "Wikipedia:AsciiDoc も参照してください。\n\n- AsciiDoc — The original implementation, written in Python. Arch では pacman の man ページを生成するのに使われています [2]。\n\n- Asciidoctor — Ruby による asciidoc の実装。様々な機能 が追加されています。\n\n"
    },
    {
      "title": "Markdown",
      "level": 4,
      "content": "公式ウェブサイト [3] と Wikipedia:Markdown も参照してください。\n\n- Discount — C 言語で書かれた Markdown の実装。\n\n- lowdown — Markdown から HTML5 および roff フォーマットの ms および man ドキュメントを生成するトランスレーター。\n\n- Marked — 速度を重視した Markdown パーサーおよびコンパイラ。\n\n- Pandoc も Markdown をサポートしています。\n\n- CommonMark-py — CommonMark Markdown 仕様の Python パーサー。\n\n- M2R — Markdown から reStructuredText へのコンバーター。\n\n- Mistune — 純粋な Python で最速の Markdown パーサーで、レンダラー機能を備えています。\n\n- Python-Markdown — John Gruber の Markdown の拡張可能な Python 実装。\n\n- kramdown — 厳格な構文定義を使用する高速で純粋な Ruby Markdown スーパーセットコンバーター。\n\n- Maruku — 純粋な Ruby Markdown スーパーセットインタープリター。\n\n- mdless — 純粋な Ruby でターミナルベースの Markdown ビューア/インタープリター。\n\n- Abricotine — デスクトップ向けの Markdown エディタ。 Electron プラットフォームに基づいています。\n\n- Apostrophe — GTK で作られた、気が散らない Markdown エディタ。\n\n- CuteMarkEd — Qt ベースの Markdown エディタで、HTML のライブプレビュー、数式、コードおよび Markdown の構文ハイライトを備えています。2016 年以降、開発は終了しています。\n\n- Formiko — Python と GTK で書かれた reStructuredText および Markdown エディタで、ライブプレビューが可能です。\n\n- ghostwriter — 気が散らない Markdown エディタ。\n\n- Marker — シンプルでありながら堅牢な Markdown エディタ。\n\n- Mark My Words — ミニマルな Markdown エディタ。\n\n- Mark Text — 次世代の Markdown エディタ。Electron プラットフォームに基づいています。\n\n- Moeditor — 汎用 Markdown エディタ。Electron プラットフォームに基づいています。2016 年以降、開発は終了しています。\n\n- Remarkable — フル機能の Markdown エディタ。\n\n- ReText — Markdown および reStructuredText 用のシンプルなテキストエディタ。\n\n- ThiefMD — Ulysses にインスパイアされた Markdown および Fountain エディタ。\n\n- Typora — プロプライエタリでミニマルな Markdown エディタ。\n\n"
    },
    {
      "title": "組版システム",
      "level": 4,
      "content": "- groff — GNU の troff の実装で、ユニックスのドキュメント処理システムの後継であり、man ページ のデフォルトフォーマッタ。\n\n- Lout — 軽量なドキュメント整形システム。LaTeX と同じようにドキュメントの高水準記述を読み込んで PostScript を生成します。\n\n- SILE — Modern typesetting system inspired by TeX.\n\n- TeX — A high-quality typesetting system popular in academia.\n\n- en:Texinfo — Typesetting syntax for software manuals used by the GNU プロジェクト.\n\n"
    },
    {
      "title": "TeX エディタ",
      "level": 4,
      "content": "TeX、LaTeX、および関連ソフトウェア を使用することで、科学的なドキュメント、記事、ジャーナルなどを簡単に作成できます。\n\nWikipedia:Comparison of TeX editors および Wikibooks:LaTeX/Installation#Editors も参照してください。\n\n- AUCTeX — Together with RefTex, Emacs で TeX ファイルを作成・フォーマットするための拡張性のあるパッケージ。\n\n- gedit LaTeX Plugin — gedit にコード補完を追加して LaTeX 文章をコンパイルしたり BibTeX 目録を管理できるようにする。\n\n- GNOME LaTeX — GNOME デスクトップの LaTeX エディタで、コード補完とコンパイル、プロジェクトの管理に対応。\n\n- Gummi — 軽量な GTK ベースの TeX/LaTeX エディタ。連続的なプレビューモード、統合された BibTeX サポート、拡張性のあるスニペットインターフェイスとマルチドキュメントサポートが特徴。\n\n- Kile — 多くの機能を持っているユーザーフレンドリーな KDE デスクトップ用 TeX/LaTeX エディタ。\n\n- Ktikz — PGF/TikZ で簡単に図式を作れる small application.\n\n- LyX — 単純に外観にあわせて書くのではなく (WYSIWYG) 文章の構造を意識させる (WYSIWYM) ドキュメントプロセッサ。\n\n- Setzer — LaTeX editor written in Python with GTK.\n\n- TeXmacs — 科学者用に特別な機能がある WYSIWYW 編集プラットフォーム。\n\n- Texmaker — クロスプラットフォームの、軽量で使いやすい LaTeX IDE。LaTeX で文章を作成するのに必要な多数のツールが、たった一つのアプリケーションに全て統合されています。\n\n- TeXstudio — TeXMaker のフォークで、bibtex アイテムのコード補完、文法チェック、複数の LaTeX を実行する必要の自動検出などをサポート。\n\n- TeXworks — シンプルな TeX フロントエンドプログラムで、TeXShop をモデルにしています。\n\n- TikZiT — PGF/TikZ を使って素早く図やダイアグラムを作成するためのグラフィカルツール。\n\n- Vim-LaTeX-suite — vim 用の LaTeX 環境。\n\n"
    },
    {
      "title": "TeX 数式エディタ",
      "level": 4,
      "content": "- EqualX — リアルタイムプレビューができる LaTeX 方程式エディタ。\n\n- KLatexFormula — LaTeX 方程式から画像を生成するための GUI。\n\n- LibreOffice TexMaths extension — LibreOffice 用の LaTeX 方程式エディタ。\n\n"
    },
    {
      "title": "XML エディタ",
      "level": 4,
      "content": "Wikipedia:Comparison of XML editors も参照してください。\n\n- QXmlEdit — シンプルな Qt XML エディタと XSD ビューア。\n\n- XML Copy Editor — 高速で、XML の妥当性を確認する XML エディタ。\n\n- XML Tree Editor — XML ファイルをツリービューで表示し、基本的な操作（テキストノードやその属性の追加、編集、削除）を行うことができます。\n\n"
    },
    {
      "title": "Document converters",
      "level": 3,
      "content": "See also #Markup languages and PDF、PS および DjVu.\n\n- Antiword — MS Word to text converter.\n\n- catdoc — Converter for Microsoft Word, Excel, PowerPoint and RTF files to text.\n\n- docx2txt — MS Word Docx to text converter.\n\n- HTMLDOC — Reads HTML and Markdown source files or web pages and generates corresponding EPUB, HTML, PostScript, or PDF files with an optional table of contents.\n\n- mutool — All purpose tool based on MuPDF for dealing with document files in various manners.\n\n- Pandoc — マークアップと文書フォーマットを変換するためのスイスアーミーナイフ。\n\n- unoconv — Libreoffice ベースのドキュメントコンバーター。\n\n- UnRTF — Command-line program which converts RTF documents to other formats.\n\n"
    },
    {
      "title": "参照文献マネージャ",
      "level": 3,
      "content": "See also Wikipedia:Comparison of reference management software.\n\n- Bibus — 参照文献インデックスを作成して OpenOffice.org/LibreOffice に直接挿入することができる参照文献データベース。\n\n- DocEar — Docear is 学術文献を検索・管理・作成するための学術文献スイート。マインドマップソフトウェアの Freeplane とリファレンスマネージャの JabRef から作られています。\n\n- JabRef — BibTeX やその他のビブリオグラフィを管理するための Java GUI フロントエンド。\n\n- KBibTeX — BibTeX editor by KDE to edit bibliographies used with LaTeX.\n\n- Mendeley Desktop — Proprietary reference manager and academic social network.\n\n- Papis — A command-line based document and bibliography manager.\n\n- Pybliographer — Tool for managing bibliographic databases.\n\n- Referencer — GNOME application to organize documents or references, and ultimately generate a BibTeX bibliography file.\n\n- Zotero — 研究資料の収拾、管理、引用、共有に役立つフリーで使いやすいツールです。Can import and export BibTeX and has browser extensions.\n\n"
    },
    {
      "title": "文章リーダー・ビューア",
      "level": 3,
      "content": "- NFO Viewer — Simple viewer for NFO files.\n\n"
    },
    {
      "title": "PDF と DjVu",
      "level": 4,
      "content": "PDF、PS および DjVuを参照してください。\n\n"
    },
    {
      "title": "電子書籍",
      "level": 4,
      "content": "- Bookworm — Elementary OS の電子書籍リーダー。EPUB, PDF, Mobipocket, Comicbook をサポート。\n\n- Calibre — 電子書籍ライブラリ管理アプリケーションthat can also edit EPUB files, 様々な電子書籍リーダーとの同期やフォーマット変換も可能。サポートしているフォーマットは CHM, Comicbook, DjVu, DOCX, EPUB, FictionBook, HTML, HTMLZ, Kindle, LIT, LRF, Mobipocket, ODT, PDF, PRC, PDB, PML, RB, RTF, SNB, TCR, TXT, TXTZ など。\n\n- Cool Reader — 多くのフォーマットをサポートしている電子書籍ビューア。サポートしているのは EPUB (DRM フリー), FictionBook, TXT, RTF, HTML, CHM, TCR など。\n\n- FBReader — 多くのフォーマットをサポートしている電子書籍ビューア。サポートしているのは EPUB, FictionBook, HTML, plucker, PalmDoc, zTxt, TCR, CHM, RTF, OEB, Mobipocket (DRM フリー), TXT など。\n\n- Foliate — Simple and modern GTK eBook reader. Supports EPUB, Mobipocket, Kindle, FictionBook, and Comicbook formats.\n\n- GNOME Books — E-book manager application for GNOME with EPUB, Mobipocket, FictionBook, DjVu and Comicbook support.\n\n- Lector — Qt based e-book reader with PDF, EPUB, Kindle, Mobipocket and Comicbook support.\n\n- Sigil — WYSIWYG EPUB ebook エディタ。\n\nSome PDF viewers like apvlv, Atril, MuPDF, Okular and Xreader also support the EPUB format.\n\n"
    },
    {
      "title": "漫画ビューア",
      "level": 4,
      "content": "- Automedia — 様々なウェブサイトから漫画やアニメをダウンロードするための非常に小さなダウンローダーです。HakuNeko の代わりとして、より軽量になるように設計されています。主に C 言語で書かれています。\n\n- Buoh — GNOME 用のオンラインストリップコミックリーダー。\n\n- HakuNeko — 様々なサイトからマンガやアニメをダウンロードすることができるダウンローダーです。 Electron プラットフォームをベースにしています。\n\n- Kindle Comic Converter — PNG, JPG, GIF, CBZ, CBR, CB7 ファイルを EPUB や MOBI 形式の電子書籍に変換することができます。\n\n- Komikku — GNOME 用のオンライン/オフラインのマンガリーダー。\n\n- Manga Reader — ローカルファイル用のマンガリーダー。zip, rar, tar, 7z, cbz, cbr, cbt, cb7 ファイルとフォルダをサポートします。\n\n- MComix — 漫画アーカイブを読むのに作られた GTK3 画像ビューア (Comix のフォーク)。ライブラリマネージャも付属。\n\n- Peruse — KDEによるコミックブックリーダー。\n\n- QComicBook — 利便性とシンプルさを追求したコミックアーカイブス用ビューア。\n\n- QuickMedia — オンライン漫画リーダー。waifu2x-ncnn-vulkan によるページの自動アップスケーリングに対応しています。\n\n- YACReader — C++ と Qt5 で書かれたコミックビューア。付属している YACReaderLibrary でコミックを管理できます。\n\nAtril, Bookworm, Calibre, Evince, Foliate, Lector, MuPDF, Okular, Xreader, Zathura などのいくつかの PDF や電子書籍ビューアもコミックブックフォーマットに対応しています。\n\n"
    },
    {
      "title": "CHM",
      "level": 4,
      "content": "See also Wikipedia:Microsoft Compiled HTML Help.\n\n- Archmage — CHM 形式のファイルの Extensible リーダーおよび逆コンパイラ。\n\n- Kchmviewer — chmlib を使う、xchm からもアイデアを拝借している Qt ベースの CHM ビューア。KDE には依存していませんが、統合するようにコンパイルすることもできます。\n\n- xCHM — chmlib ベースの軽量な CHM ビューア。\n\nSome PDF and E-book viewers like Cool Reader, FBReader and Okular also support the CHM format.\n\n"
    },
    {
      "title": "Document managers",
      "level": 3,
      "content": "- GNOME Documents — Document manager application for GNOME with PDF, DVI, XPS, PostScript, Microsoft Office, LibreOffice and Google Docs support.\n\n- Paperwork — Personal document manager. It manages scanned documents and PDFs.\n\n- Shelf — Document and EBook collection manager that supports PDF and EPUB files.\n\n"
    },
    {
      "title": "スキャニングソフトウェア",
      "level": 3,
      "content": "SANE#フロントエンドのインストール を参照。\n\n- ScanTailor Advanced — Interactive post-processing tool for scanned pages. Fork of Scan Tailor with additional features and fixes.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "See also Wikipedia:Comparison of optical character recognition software.\n\n- CuneiForm — Cognitive Technologies によって開発されオープンソース化されたコマンドラインの OCR システム。サポートしている言語: eng, ger, fra, rus, swe, spa, ita, ruseng, ukr, srp, hrv, pol, dan, por, dut, cze, rum, hun, bul, slo, lav, lit, est, tur。\n\n- GOCR — バーコード認識もサポートする OCR エンジン。\n\n- Ocrad — 特徴抽出法に基づく OCR プログラム。\n\n- OCRmyPDF — Adds an OCR text layer to scanned PDF files, allowing them to be searched.\n\n- OCRopus — OCR プラットフォーム、ドキュメントレイアウトや自然言語モデルを解析するモジュールが存在します (Tesseract や独自のエンジンを使用可能)。\n\n- Tesseract — 正確なオープンソースの OCR エンジン。パッケージは分割されており、言語ごとにデータファイルをインストールする必要があります (例えば tesseract-data-eng)。\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- gImageReader — Tesseract のグラフィカル GTK/Qt フロントエンド。\n\n- gscan2pdf — スキャンして OCR エンジンを実行して、ポストプロセス処理を施して、ドキュメントを作成。\n\n- Linux-Intelligent-Ocr-Solution — Easy-OCR solution and Tesseract trainer for converting print into text using either scanner or a camera.\n\n- OCRFeeder — ドキュメント解析と翻訳を行う Gnome の Python GUI。OCR エンジンとして CuneiForm, GOCR, Ocrad, Tesseract を使用可能。PDF や画像ファイルをインポートして HTML や OpenDocument にエクスポートできる。\n\n- Paperwork — Personal document manager. It manages scanned documents and PDFs.\n\n- Scans to PDF — Create small, searchable PDFs from scanned documents.\n\n- YAGF — Graphical interface for the CuneiForm text recognition program on the Linux platform.\n\n"
    },
    {
      "title": "メモ管理",
      "level": 4,
      "content": "See also Wikipedia:Comparison of notetaking software.\n\n- Geeknote — Command line client for Evernote.\n\n- hierarchical notebook — XML フォーマットを使って様々な種類のデータ（アドレス、to-do リスト、アイデア、ブックレビューなど）をひとつに管理するプログラム。\n\n- Org mode — ノート用の Emacs モード。プロジェクトのプランニングとオーサリング。\n\n- tnote — Small note taking program for the terminal.\n\n- Vimwiki — Personal wiki for Vim – interlinked, plain text files written in a markup language.\n\n- BasKet — ノートの作成・管理・共有をするアプリケーション。スクラップブックのように様々なタイプの情報を管理できます。to-do リスト、リンク、画像など。\n\n- Boostnote — Note-taking application for programmers that focuses on markdown, snippets, and customizability. Based on the Electron platform.\n\n- Buho — Task and note keeper to save links, write quick notes and organize pages as books.\n\n- Cherrytree — 階層式のノート作成アプリケーション。リッチテキストやシンタックスハイライトの機能があり、ひとつの XML か sqlite ファイルにデータを保存します。\n\n- Deepin Voice Notes — Lightweight memo tool to make text notes and voice recordings.\n\n- Encryptic — JavaScript note taking application with Markdown editor and encryption support. Based on the Electron platform.\n\n- FeatherNotes — Lightweight Qt hierarchical notes-manager.\n\n- FromScratch — Simple but smart note-taking application that you can use as a quick note taking or todo app. Based on the Electron platform.\n\n- GNOME Notes — Note editor for GNOME designed to remain simple to use.\n\n- Gnote — Tomboy の C++ 移植。It is the same note taking application, including most of the add-ins.\n\n- Joplin — Note taking and to-do application, which can handle a large number of notes organized into notebooks. Based on the Electron platform.\n\n- KeepNote — クロスプラットフォームの GTK メモ作成アプリケーション。リッチテキストフォーマット。\n\n- KJots — Note taking application for KDE.\n\n- Mikidown — Note taking application featuring markdown syntax.\n\n- MyNotex — Note-taking, document file and activity manager.\n\n- Nextcloud Notes — Simple notes app for Nextcloud.\n\n- NixNote — Helps you take notes and stay organized. Create text notes, attach files or images, and even synchronize with Evernote. 旧名 Nevernote。\n\n- Norka — Note-taking software with Markdown support designed for Pantheon.\n\n- Notejot — Stupidly simple sticky notes applet for elementaryOS.\n\n- Notes — Note-taking application, write down your thoughts.\n\n- Notes-Up — Markdown notes editor and manager for elementaryOS.\n\n- Notorious — Keyboard centric note-taking application with Markdown syntax highlighting support.\n\n- nvPY — Simplenote syncing note-taking application, inspired by Notational Velocity and ResophNotes, but uglier and cross-platformerer.\n\n- OutWiker — Store notes in a tree.\n\n- QOwnNotes — オープンソースのメモ帳・ToDo リストマネージャ。Markdown をサポートし任意で ownCloud と統合させることができます。qt5 を使用。\n\n- Simplenote — The simplest way to keep notes. Based on the Electron platform.\n\n- Standard Notes — Simple and private notes application which focuses on simplicity, and encrypts data locally before it ever touches a cloud. Based on the Electron platform.\n\n- TagSpaces — Offline personal data manager for managing of your local files. Based on the Electron platform.\n\n- TiddlyWiki — Unique non-linear notebook for capturing, organizing and sharing complex information.\n\n- Tomboy — wiki のようなリンクシステムでメモを繋げることができる Linux と Unix 用のデスクトップメモアプリケーション。\n\n- Trilium — Build your personal knowledge base with Trilium Notes.\n\n- TuxCards — Hierarchical notebook to enter and manage ever every kind of notes and ideas in a structured manner.\n\n- VNote — Vim-inspired note-taking application that knows programmers and Markdown better.\n\n- WikidPad — Wiki-like notebook for storing your thoughts, ideas, todo lists, contacts, or anything else you can think of to write down.\n\n- WizNote — クラウドノート管理クライアント。\n\n- Zim — wiki のコンセプトをデスクトップに取り入れるを目指している WYSIWYG テキストエディタ。\n\n- zNotes — シンプルなインターフェイスによるノート管理のたけの軽量クロスプラットフォームアプリケーション。\n\n- μPad — Note-taking app that helps you organise + take notes without restrictions. Based on the Electron platform.\n\n"
    },
    {
      "title": "手書きメモ",
      "level": 4,
      "content": "- Cournal — Collaborative note taking and journal application using a stylus. It allows multiple users to annotate PDF files in real-time.\n\n- Write — A proprietary 手書きのワードプロセッサ。\n\n- Xournal — 手書きでメモを書いたり、スケッチしたり、日記を付けるためのアプリケーション。Capable of annotating existing PDF files as well.\n\n- Xournal++ — Notetaking software designed around a tablet. C++ による Xournal の改良版 with PDF annotation support.\n\n- Rnote — A simple note taking application written in Rust and GTK4.\n\n"
    },
    {
      "title": "Diary",
      "level": 4,
      "content": "- Almanah — Small GTK application to allow you to keep a diary of your life.\n\n- Hazama — Simple and highly customizable application for keeping diary. There is no calendar but a big list that contains preview of diaries.\n\n- Lifeograph — Off-line and private journal and note taking application. It offers a rich feature set presented in a clean and simple user interface.\n\n- RedNotebook — フォーマット・タグ付け・エントリ検索ができる近代的なジャーナル。\n\n- Simple Diary — Simple and lightweight diary app with Markdown support.\n\n"
    },
    {
      "title": "マインドマップツール",
      "level": 4,
      "content": "See also Wikipedia:List of concept- and mind-mapping software.\n\n- FreeMind — Java で書かれたマインドマップソフトウェア。\n\n- Freeplane — Fork of FreeMind, 仕事場・学校・家庭などで物事を考えたり情報を共有したりするのに使うソフトウェアアプリケーション。マインドマップや情報の解析にも利用できます。\n\n- Labyrinth — 軽量なマインドマップツール, written in Python using GTK, 画像のインポートや描画をサポート。\n\n- Minder — Mind-mapping application designed for Pantheon.\n\n- MindMaster — Proprietary mindmap and brainstorm software with modern UI and beautiful template. It also provides online mindmap service and cross-platform sharing.\n\n- Semantik — KDE のマインドマップアプリケーション。\n\n- TreeSheets — A \"hierarchical spreadsheet\" that is スプレッドシート・マインドマップ・アウトライナー・PIM・テキストエディタ・データベースを全て置き換えるソフトウェア。\n\n- View Your Mind — 思考内容のマップを作成するツール。創造性・効率性を改善できます。時間管理やタスクの処理に使ったり、複雑なものを解きほぐしたり、アイデアを並べてみたりすることが可能。\n\n- Visual Understanding Environment — 教育・学習・研究を支援するデジタルな資料を管理・統合するための柔軟なツール。\n\n- XMind — ブレインストーミング・マインドマップアプリケーション。様々な視覚化スタイルを使って、ウェブサイトで作成したマインドマップを共有できます。\n\n"
    },
    {
      "title": "Sticky notes",
      "level": 4,
      "content": "- GloboNote — Easy to use desktop note taking application. You can use it to create sticky notes, to-do lists, personal journals, reminders and other notes all in one application.\n\n- KNotes — コンピュータ上で付箋を書くことができるプログラム。Part of kdepim[リンク切れ: package not found].\n\n- MyNotes — Sticky note application. An icon appears in the system tray and from it you can create and manage your sticky notes.\n\n- Notes — Provides you a quick way to paste text, to write down a list of things, to leave a note to your friend, or whatever you had do with Post-It's.\n\n- PrimeNote — Most polished, cross-platform sticky note application (PyQt5). Provides support for Cloud, Vim, CSS styling and more !\n\n- xNots — Desktop post-it/sticky note system for the Unix geek.\n\n- Xpad — Sticky note application for jotting down things to remember.\n\n"
    },
    {
      "title": "Distraction-free writing",
      "level": 4,
      "content": "See also #Markdown editors and Wikipedia:Full-screen writing program.\n\n- FocusWriter — Simple, distraction-free writing environment. It utilizes a hide-away interface that you access by moving your mouse to the edges of the screen, allowing the program to have a familiar look and feel to it while still getting out of the way so that you can immerse yourself in your work.\n\n- PyRoom — Fullscreen editor without buttons, widgets, formatting options, menus and with only the minimum of required dialog windows, it does not have any distractions and lets you focus on writing and only writing.\n\n- Quilter — Focus on your writing and write beautiful solid stories with the Focus Mode in tow in this Markdown editor.\n\n- TextRoom — Fullscreen text editor for writers.\n\n"
    },
    {
      "title": "Story writing",
      "level": 4,
      "content": "- Manuskript — Provides a rich environment to help writers create their first draft and then further refine and edit their masterpiece.\n\n- NovProg — Tool to graph your progress in writing a NaNoWriMo style novel.\n\n- oStorybook — Tool for writers, essayists, authors from the draft to the final work.\n\n"
    },
    {
      "title": "Screenwriting",
      "level": 4,
      "content": "- KIT Scenarist — Simple and powerful application for creating screenplays.\n\n- Magic Fountain — Fountain syntax editor and viewer for writing screenplays.\n\n- Trelby — Simple, fast and elegantly laid out to make screenwriting simple.\n\n"
    },
    {
      "title": "Dictionary and thesaurus",
      "level": 4,
      "content": "See also Wikipedia:Category:Dictionary software and Wikipedia:DICT#DICT clients.\n\n- dictd — Client/server software for the DICT protocol.\n\n- sdcv — Command line dictionary. It provides access to dictionaries in StarDict's format.\n\n- thesauromatic — Static, offline, command-line thesaurus written in Rust.\n\n- Artha — English thesaurus that works completely off-line and is based on WordNet.\n\n- Gjiten Kai — Rewrite of Gjiten, a GTK Japanese dictionary.\n\n- GNOME Dictionary — GNOME application to check word definitions and spellings in an online dictionary.\n\n- GoldenDict — Feature-rich dictionary lookup program.\n\n- Kiten — Japanese reference and study tool. Part of kde-education.\n\n- MATE Dictionary — MATE application to look up words in dictionary sources.\n\n- OpenDict — Computer dictionary, which supports popular computer dictionary formats including Slowo and Mova. It also acts as a client for DICT servers.\n\n- Palaura — Handy dictionary to find any word's definition.\n\n- PowerWord — Proprietary Chinese-English dictionary tool.\n\n- QStarDict — Dictionary program written using Qt. The user interface is similar to StarDict.\n\n- Quick Lookup — Simple GTK dictionary application powered by Wiktionary.\n\n- StarDict — International dictionary software.\n\n- Xfce4 Dictionary — Search different kinds of dictionary services for words or phrases.\n\n"
    },
    {
      "title": "Spell checkers",
      "level": 4,
      "content": "See en:Language checking.\n\n"
    },
    {
      "title": "翻訳・地域化",
      "level": 4,
      "content": "See also Wikipedia:Comparison of computer-assisted translation tools.\n\n- Apertium — 言語データを含む、フリーのオープンソースなルールベース機械翻訳プラットフォーム。次のフォーマットをサポート: HTML, Microsoft Office 2007 XML, OpenDocument, TMX, MediaWiki など。\n\n- Crow Translate — Simple and lightweight translator that allows to translate and speak text using Google, Yandex and Bing.\n\n- Dialect — A translation app for GNOME based on Google Translate.\n\n- Gtranslator — GNOME の gettext po ファイルエディタ。gettext po ファイルの全ての形式を扱い便利な機能が含まれています。\n\n- Lokalize — ソフトウェア翻訳のための標準 KDE ツール。PO ファイルの編集機能に加えて、用語集・翻訳メモリ・プロジェクト管理などをサポート。It belongs to kdesdk\n\n- Moses — 統計に基づく機械翻訳ツール（言語データは含まれていません）。\n\n- OmegaT — 一般的な翻訳支援ツール。翻訳メモリなどの多くの機能を持ち Google 翻訳からのサジェストも可能。次のフォーマットをサポート: HTML, Microsoft Office 2007 XML, OpenDocument, XLIFF/Okapi, MediaWiki, plain text, TMX など。\n\n- Poedit — Simple translation editor for gettext (PO, POT) and XLIFF.\n\n- Pology — gettext/po-ファイル を扱うための Python ツールのセット。\n\n- Qt Linguist — Translating Qt C++ and Qt Quick applications into local languages.\n\n- Translate Shell — Command-line interface and interactive shell for Google Translate.\n\n- Translate Toolkit — Localization and translation toolkit, which provides a set of tools for working with localization file formats and files that might need localization.\n\n"
    },
    {
      "title": "コンソール",
      "level": 4,
      "content": "- barcode — テキスト文字列をバーコードに変換するツール。\n\n- iec16022 — DataMatrix と呼ばれる 2D バーコードを生成。\n\n- qrencode — QR コードでデータをエンコードするための C ライブラリとコマンドラインツール。\n\n- ZBar — 様々なソースからバーコードを読み込むアプリケーションとライブラリ。\n\n- Zint — 50以上の規格に対応しているバーコードエンコーディングライブラリ・コマンドラインツール。\n\n"
    },
    {
      "title": "グラフィカル",
      "level": 4,
      "content": "- CoBang — QR Code scanner application.\n\n- gLabels — ラベルや名刺を作成するためのプログラム。バーコードの作成もサポート。\n\n- QRab — Simply grabs QR code from screen and copies decoded text into clipboard.\n\n- Qreator — Graphical utility for creating QR codes.\n\n- QtQR — QR コードジェネレータ・デコーダー。\n\n- ZBarCam GUI — Simple GUI for ZBar to read bar codes from various sources.\n\n- Zint Barcode Studio — バーコードジェネレータ GUI。\n\n"
    },
    {
      "title": "セキュリティ",
      "level": 2,
      "content": "詳しいガイドは、ArchWiki のメインページを見て下さい、セキュリティ。\n\n"
    },
    {
      "title": "ネットワークセキュリティ",
      "level": 3,
      "content": "See also Wikipedia:Comparison of packet analyzers.\n\n- airgeddon — Multi-use bash script to audit wireless networks\n\n- Arpwatch — Ethernet の活動を監視し Ethernet/IP アドレスペアリングのデータベースを保持するツール。\n\n- bettercap — Swiss army knife for network attacks and monitoring.\n\n- darkstat — Captures network traffic, calculates statistics about usage, and serves reports over HTTP.\n\n- dsniff — Collection of tools for network auditing and penetration testing.\n\n- EtherApe — etherman を手本に作成されたグラフィカルネットワークモニター。Featuring link layer, IP and TCP modes, ネットワークの活動状態をグラフィカルに表示します。Hosts and links change in size with traffic. Color coded protocols display.\n\n- Ettercap — Multipurpose Network sniffer/analyser/interceptor/logger.\n\n- GNOME Network Tools — GNOME interface for various networking tools.\n\n- Honeyd — コンピュータネットワーク上に複数の仮想ホストを設定・起動するためのツール。\n\n- hping — Command-line oriented TCP/IP packet assembler/analyzer.\n\n- IPTraf — コンソールベースのネットワークモニタリングユーティリティ。\n\n- jnettop — top-like console network traffic visualizer.\n\n- justniffer — Network protocol analyzer that captures network traffic and produces logs in a customized way, can emulate Apache web server log files, track response times and extract all \"intercepted\" files from the HTTP traffic.\n\n- Kismet — 802.11 layer2 ワイヤレスネットワークの検出・キャプチャ・侵入検知システム。\n\n- LinSSID — Graphical wireless scanner.\n\n- Nemesis — コマンドラインのネットワークパケットクラフト・インジェクションツール。\n\n- Net Activity Viewer — Graphical network connections viewer, similar in functionality with Netstat.\n\n- netsniff-ng — High performance Linux network sniffer for packet inspection.\n\n- ngrep — grep-like utility that allows you to search for network packets on an interface.\n\n- Nmap — コンピュータネットワーク上のホストとサービスを探しネットワークの\"マップ\"を作るために使われるセキュリティスキャナ。\n\n- Ntop — top がプロセスの動きを表示するように、ネットワークの使用を表示するためのネットワーク監視ツール。\n\n- pyNeighborhood — GTK-based SMB/CIFS browsing utility.\n\n- Smb4K — Advanced network neighborhood browser and Samba share mounting utility for KDE.\n\n- Snort — ネットワーク侵入防止・検知システム。\n\n- Spectools — Wi-Spy デバイスなどのハードウェアのスペクトラムアナライザとして使えるユーティリティ集。\n\n- Sshguard — ブルートフォース攻撃から SSH などのサービスを防護する Fail2ban に似たデーモン。\n\n- Suricata — 高性能なネットワーク IDS, IPS, Network Security Monitoring エンジン。\n\n- Tcpdump — コンソールベースのパケットアナライザで、ネットワーク越しに転送された TCP/IP などのパケットを傍受して表示することができます。\n\n- vnStat — 選択したインターフェースのトラフィックをログする、コンソールベースのネットワークトラフィックモニタ。\n\n- What IP — Small GTK application to get info on your IP.\n\n- wifiphisher — Fast automated phishing attacks against WPA networks.\n\n- Wireshark — コンピュータネットワークで動いているトラフィックを見るためのネットワークプロトコルアナライザー。\n\n- Xplico — Network forensics analysis tool (NFAT), which is a software that reconstructs the contents of acquisitions performed with a packet sniffer.\n\n- Zeek — Powerful network analysis framework that is much different from the typical IDS you may know.\n\n"
    },
    {
      "title": "ファイアウォール",
      "level": 3,
      "content": "See iptables#Front-ends.\n\n"
    },
    {
      "title": "脅威と脆弱性保護",
      "level": 3,
      "content": "- AFICK — ファイルシステムの変更を監視して侵入を検知するセキュリティツール。\n\n- Lynis — Unix/Linux システムを防護するセキュリティ・システム監査ツール。\n\n- Metasploit Framework — exploit コードを開発・テスト・使用するための高度なオープンソースプラットフォーム。\n\n- Nessus — 総合的な脆弱性スキャンプログラム。\n\n- OpenVAS — 脆弱性をスキャンして管理する包括的かつ強力なソリューションを提供する複数のサービスとツールからなるフレームワーク。FOSS Nessus のフォーク。\n\n- OSSEC — オープンソースのホストベースの侵入検知システム。ログを解析、ファイルの整合性を確認、ポリシーを確認、rootkit を検出、リアルタイムの改変に対応します。\n\n- Samhain — ホストベースの侵入検知システム (HIDS)。ファイルの整合性の確認、ログファイルの監視・解析、rootkit の検出、ポートの監視、危険な SUID 実行ファイルや隠しプロセスを検出します。\n\n- Tiger — セキュリティ監査と侵入検知システムの両方の役割を果たすことができるセキュリティツール。\n\n- Tripwire — 侵入検知システム。\n\n"
    },
    {
      "title": "ファイルセキュリティ",
      "level": 3,
      "content": "- AIDE — ファイルとディレクトリの整合性チェッカー。\n\n- Logwatch — カスタマイズできるログ分析システム。\n\n"
    },
    {
      "title": "アンチマルウェア",
      "level": 3,
      "content": "- ClamAV — オープンソースのアンチウイルスエンジン。トロイの木馬、ウイルス、マルウェアなどの危険なプログラムを検出します。\n\n- ClamTk — Graphical front-end for ClamAV using Perl and Gtk libraries. It is designed to be an easy-to-use, lightweight, on-demand antivirus scanner for Linux systems.\n\n- Linux Malware Detect —\n\n- Rootkit Hunter — rootkit などの招かれざるツールの存在をチェックします。\n\n- Hostsblock — A script that downloads, sorts, and compiles multiple ad- and malware-blocking hosts files.\n\n"
    },
    {
      "title": "スクリーンロック",
      "level": 3,
      "content": "See also en:Session lock.\n\n- betterlockscreen — i3lock-color wrapper. Betterlockscreen allows you to cache images with different filters and lockscreen with blazing speed.\n\n- Cinnamon Screensaver — Cinnamon デスクトップの画面ロッカー。\n\n- Deepin Screensaver — A lightweight Qt5 based screensaver.\n\n- GNOME Screensaver — Legacy GNOME デスクトップの画面ロッカー。Unmaintained since 2012.\n\n- i3lock — シンプルな画面ロッカー。ユーザーフィードバックを提供し、PAM 認証を使用します。画像や単色の背景を設定可能。\n\n- i3lock-blur — i3lock のフォークで背景としてブラー効果をかけたデスクトップを使うことができます。\n\n- i3lock-color — Fork of i3lock with color and positioning configuration support and 背景画像としてブラーのかかったデスクトップのスクリーンショットをセットします。\n\n- Light-locker — デスクトップの依存を増やすことなくデスクトップと統合することができる、単純な安全で安心なシンプルロッカー (gnome-screensaver のフォーク)。ConsoleKit/UPower や logind/systemd でセッションをロックするために LightDM を使っています。\n\n- MATE Screensaver — MATE デスクトップ環境のスクリーンセーバー・ロッカー。\n\n- physlock — 画面とコンソールのロッカー。\n\n- sflock — X 用の slock ベースのシンプルなスクリーンロッカー。基本的なユーザーフィードバックを提供します。\n\n- slock — とてもシンプルで軽量な X スクリーンロッカー。ロック時には黒い背景しか表示しません、アニメーションやテキストはありません。\n\n- sxlock — sflock のフォーク。基本的なユーザーフィードバック・PAM 認証・DPMS と RandR をサポート。サスペンドやハイバネート時に画面をロックする sxlock.service があります。詳しくは README を参照。\n\n- tsscreenlock — theShell で使われているスクリーンロッカー。音楽のコントロールを表示し、theShell を使用している場合、デスクトップ通知も表示。\n\n- vlock — TTY ロッカー。オリジナルの vlock のミラーは GitHub から取得できます。\n\n- xfce4-screensaver — A screen saver and locker that aims to have simple, sane, secure defaults and be well integrated with the xfce desktop.\n\n- xlockmore — シンプルな X11 画面ロック。PAM 対応。\n\n- XScreenSaver — X Window System 向けのスクリーンセーバー・ロッカー。\n\n- XSecureLock — セキュリティに焦点を置いた X11 のスクリーンロックユーティリティ。\n\n- xtrlock — 非常に軽量な X ディスプレイロッカー。ウィンドウは表示したままで、マウスカーソルの代わりにロックアイコンを表示します。パスワードを入力すれば画面のロックは解除されます。\n\n- swaylock — Wayland 用のスクリーンロッカー。\n\n- swaylock-effects — 派手なエフェクト付きの Swaylock。\n\n"
    },
    {
      "title": "Password auditing",
      "level": 3,
      "content": "- John the Ripper — Password cracker.\n\n- Hashcat — Multithreaded advanced password recovery utility.\n\n"
    },
    {
      "title": "パスワードマネージャ",
      "level": 3,
      "content": "See also KeePass.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- 1password CLI — Proprietary command line tool for 1Password password manager.\n\n- Bitwarden — Open source password manager with desktop, mobile, browser, and CLI versions. Cloud or self-hosted.\n\n- gopass — Advanced console based password manager, supporting GnuPG and other backends.\n\n- KeePassC — Curses-based password manager compatible to KeePass v.1.x.\n\n- LastPass — Hosted password manager.\n\n- pass — シンプルなコンソールベースのパスワードマネージャ featuring flat text file organization and GnuPG encryption.\n\n- pwsafe — 暗号化されたパスワードデータベースを管理する Unix コマンドラインプログラム。\n\n- spm — PGP を使用して POSIX シェルだけで書かれたシンプルなパスワードマネージャ。軽量・高速でスクリプトに簡単に組み込めます。\n\n- tpm — tiny password manager, inspired by pass, written entirely in POSIX shell.\n\n- Ylva — Command-line password manager, written in C, uses OpenSSL.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- 1password — Proprietary password manager and secure wallet.\n\n- Authenticator — Two-factor authentication application built for GNOME.\n\n- Bitwarden — Open source password manager with desktop, mobile, browser, and CLI versions. Cloud or self-hosted.\n\n- Encryptr — ゼロ知識・クラウドベースのパスワードマネージャ。\n\n- Enpass — マルチプラットフォームのパスワードマネージャ。\n\n- Figaro's Password Manager 2 — Figaro's Password Manager の GTK2 ポートで新機能がいくつか追加されています。\n\n- GNOME Password Safe — Password manager for GNOME which makes use of the KeePass v.4 format.\n\n- Ked Password Manager — 大量のパスワードを扱うのに役立つパスワードマネージャ。\n\n- KeePass Password Safe — 安全な方法でパスワードを管理するための、パスワードマネージャ。Mono ベース。\n\n- KeePassX — Qt-based password manager. KeePass v.1.x や KeePass v.2.x と互換性あり。\n\n- KeePassXC — Community fork of KeePassX with more active development. Compatible with KeePass v.1.x (import only) and KeePass v.2.x.\n\n- KDE Wallet Manager — Tool to manage the passwords on your system. By using the KDE wallet subsystem it not only allows you to keep your own secrets but also to access and manage the passwords of every application that integrates with the wallet.\n\n- OTPClient — Highly secure and easy to use GTK software for two-factor authentication that supports both Time-based One-time Passwords (TOTP) and HMAC-Based One-Time Passwords (HOTP).\n\n- Passbook — Modern password manager for GNOME.\n\n- Password Gorilla — クロスプラットフォームのパスワードマネージャ。\n\n- Password Safe — シンプルで安全なパスワードマネージャ。\n\n- QPass — パスワード生成器が付いている使いやすいパスワードマネージャ。\n\n- QtPass — GUI for pass, the standard unix password manager.\n\n- Revelation — GNOME デスクトップのパスワードマネージャ。\n\n- Seahorse — GNOME Keyring で暗号化キーとパスワードを管理する GNOME アプリケーション。\n\n- Universal Password Manager — GNOME Keyring で暗号化キーとパスワードを管理する GNOME アプリケーション。\n\n"
    },
    {
      "title": "ハッシュチェッカー",
      "level": 4,
      "content": "- cfv — チェックサムファイルのテストと作成ができる小さなユーティリティ。.sfv, .csv, .crc, .md5, md5sum, sha1sum, .torrent, par, .par2 ファイルに対応。\n\n- GtkHash — メッセージダイジェストまたはチェックサムを計算する GTK ユーティリティ。\n\n- hashdeep — 様々なファイルのハッシュやメッセージダイジェストを計算するクロスプラットフォームのツール。\n\n- Quick Hash GUI — ファイルのすばやい選択とハッシュ作成ができる GUI (フォルダ構造で別々に行ったり再帰的に使用可能)。\n\n- RHash — ハッシュサムを確認するためのユーティリティ (SFV, CRC など)。多数のアルゴリズムをサポート。\n\n- MassHash — Python で書かれたファイルハッシュ作成ツールのセット (CLI と GTK の GUI)。MD5, SHA-1, SHA-224, SHA-256, SHA-384, SHA-512 などのアルゴリズムをサポート。\n\n- Parchive —\n\n"
    },
    {
      "title": "暗号化, 署名, ステガノグラフィー",
      "level": 4,
      "content": "- age — A simple, modern and secure encryption tool (and library) with small explicit keys, no config options, and UNIX-style composability.\n\n- ccrypt — ファイルやストリームを暗号化・復号化するためのコマンドラインユーティリティ based on Rijndael.\n\n- Enigmail — Mozilla Thunderbird や Seamonkey のセキュリティ拡張。OpenPGP 規格で暗号化・署名されたメールを送受信できるようになります。\n\n- GNOME Keysign — GTK/GNOME application to use GnuPG for signing other people's keys. Quickly, easily, and securely.\n\n- GnuPG — RFC4880 で定義されている OpenPGP 標準の GNU プロジェクトによる完全でフリーな実装。パッケージの電子署名で広く使われている、PGP を置き換える。\n\n- GPG-Crypter — Graphical front-end to GnuPG(GPG) using the GTK3 toolkit and GPGME library.\n\n- Keybase — Key directory mapping social media identities, with cross platform encrypted chat, cloud storage, and git repositories.\n\n- KGpg — KDE のシンプルな GnuPG インターフェイス。\n\n- Kleopatra — Certificate Manager and Unified Crypto GUI for KDE. It supports managing X.509 and OpenPGP certificates in the GpgSM keybox and retrieving certificates from LDAP servers.\n\n- minisign — Simple program that only implements key signing\n\n- Seahorse — GNOME Keyring で暗号鍵やパスワードを管理するための GNOME アプリケーション。\n\n- scrypt — Command-line encryption utility featuring the memory-hardened scrypt key derivation function.\n\n- steghide — 画像や音声ファイルなど様々な種類のファイルにデータを隠すことができるステガノグラフィーユーティリティ。\n\n"
    },
    {
      "title": "Data-at-rest encryption",
      "level": 4,
      "content": "See 保存データ暗号化.\n\n"
    },
    {
      "title": "管理者権限",
      "level": 3,
      "content": "- doas — A portable version of OpenBSD's doas command, known for being substantially smaller in size compared to sudo.\n\n- pkexec(1) — A Polkit application that allows an authorized user to run commands or an interactive shell as another user. Configured using Polkit rules.\n\n- su — Command used to assume the identity of another user on the system.\n\n- sudo — Command to delegate the ability to run commands as root or another user while providing an audit trail.\n\n"
    },
    {
      "title": "電卓",
      "level": 4,
      "content": "See also Wikipedia:Comparison of software calculators.\n\n- bc — 任意精度計算言語。\n\n- calc — 任意精度計算コンソール。\n\n- clac — 後置記法のコマンドライン・スタックベース計算機。\n\n- qalc — Command-line calculator and equation solver with fault-tolerant parsing, constant recognition and units.\n\n- Deepin Calculator — Deepin デスクトップの使いやすい電卓\n\n- Extcalc — Qt ベースの科学用グラフィカル計算器。\n\n- FOX Calculator — シンプルなデスクトップ電卓。\n\n- galculator — GTK ベースの科学用電卓。\n\n- Genius — 数学的なプログラミング言語を備えた先進的な計算機。\n\n- GNOME Calculator — GNOME デスクトップの科学電卓。\n\n- KAlgebra — kde-education に含まれる計算器と 3D プロッタ。\n\n- KCalc — KDE デスクトップの科学電卓。\n\n- Liri Calculator — Liri の電卓。\n\n- MATE Calc — MATE デスクトップ環境の計算機。\n\n- Qalculate! — 電卓・方程式ソルバ。フォールトトレラントなパース、定数認識とユニット。\n\n- SpeedCrunch — 高速高精度でパワフルなクロスプラットフォームの計算器。\n\n- xcalc — 代数・逆ポーランド表記法モードを備えた X 用科学電卓。\n\n"
    },
    {
      "title": "数式処理システム",
      "level": 4,
      "content": "See also Wikipedia:ja:数式処理システムの一覧.\n\n- AXIOM — FriCAS: 強力な AXIOM-CAS の派生システム。\n\n- GAP — 群論計算に重点を置いた分散計算のための数式処理システム。\n\n- Maple — 有名な商用 CAS。主として教育で使われています。\n\n- Mathics — 記号数学計算用のフリーな CAS。主要な言語として Python を使用。Mathematica 互換の構文と機能を備えることを目指しています。ほとんどの処理は Sympy を使っており、より高度な機能を Sage で補っています。\n\n- Mathomatic — C で書かれた多目的の数式処理システム。\n\n- Maxima — Maple/Mathematica-ライクなプログラム。\n\n- PARI/GP — 整数論の高速計算のために作られた数式処理システム。\n\n- Singular — 可換・非可換環論・代数幾何学・特異点論に特に注力されている多項式計算の数式処理システム。\n\n- wxMaxima — 強力な数式処理システムである Maxima のグラフィカルユーザーインターフェイス。\n\n- Xcas — フリーの、基礎的な数式処理システムである、Giac のユーザーインターフェース。\n\n"
    },
    {
      "title": "Visualization of networks/graphs",
      "level": 4,
      "content": "- Graphia — Visualizes large graphs specified in various formats (including GML and GraphML) in 3D space in real time. See this issue on the Graphia Github for the Archlinux package dependencies of Graphia.\n\n- Graphviz — The established tool for displaying smallish graphs in 2D.\n\n"
    },
    {
      "title": "科学技術計算",
      "level": 4,
      "content": "See also Wikipedia:Comparison of numerical analysis software.\n\n- Cadabra — A field-theory motivated approach to computer algebra.\n\n- Cantor — KDE に統合されたワークシートインターフェイスから好きな数学アプリケーションを使うことができるアプリケーション。kde-education に含まれます。\n\n- EngLab — C ライクな構文を持ったクロスコンパイル数学プラットフォーム。\n\n- FFTW — 離散フーリエ変換を計算するための高速フーリエ変換ライブラリ。スペクトル法など幅広い数値計算に使われています。\n\n- FreeMat — Matlab-ライクなプログラム。(MPI による) 分散環境による並列計算の開発のサポート、C や C++、Fortran などのコードがいらないインターフェース、3D グラフィック機能など。\n\n- GeoGebra — インタラクティブなグラフィック・数式・スプレッドシートを備えた動的な数学ソフトウェア。\n\n- Julia — 技術計算のための高水準・高性能な動的言語。\n\n- Kig — インタラクティブ幾何学アプリケーション。kde-education に含まれています。\n\n- matplotlib (PyLab) — 科学計算用の Python モジュール (pyplot や numpy など) のコレクション。\n\n- Octave — 数値計算のための Matlab-ライクなプログラミング言語・インターフェース。\n\n- SageMath — Python で書かれた Maxima に似た数式処理システム。Magma, Maple, Mathematica, Matlab の代替。\n\n- Scilab — 数値計算に使われる Matlab 代替、構文は Matlab とは異なりますが、簡単に変換できます。\n\n"
    },
    {
      "title": "統計学",
      "level": 4,
      "content": "See also Wikipedia:Comparison of statistical packages.\n\n- gretl — A cross-platform software package for econometric analysis, written in the C programming language.\n\n- JAGS (Just another Gibbs sampler) — マルコフ連鎖モンテカルロ法 (MCMC) を使う階層ベイズモデルの分析のためのクロスプラットフォームプログラム。\n\n- jamovi — SPSS のユーザーが簡単に使えるように作られた統計パッケージ。Electron プラットフォームベース。\n\n- Python Data Analysis Library (pandas) — Python プログラミング言語による、高性能かつ使いやすい、データ解析ツール。\n\n- PSPP — フリーの SPSS 実装。\n\n- R — 統計計算とグラフのソフトウェア環境。\n\n- RKWard — 統計解析向けプログラミング言語 R のフロントエンド。\n\n- RStudio — Qt で書かれた R の強力で生産的な IDE。\n\n"
    },
    {
      "title": "データ評価とプロット",
      "level": 4,
      "content": "Wikipedia:ja:グラフ作成ソフトも参照。\n\n- AlphaPlot — Application for scientific data analysis and visualization, fork of SciDavis / QtiPlot.\n\n- Engauge Digitizer — グラフの画像からデータを抽出。\n\n- Fityk — 曲線あてはめ・データ解析アプリケーション。釣鐘型関数を実験データに当てるのによく使われます。\n\n- Gnuplot — 関数・データの 2D / 3D プロットを生成するコマンドラインプログラム。\n\n- Grace — WYSIWYG 2D グラフプロットツール。\n\n- KmPlot — グラフと積分・導関数を描画するプログラム。kde-education に含まれます。\n\n- LabPlot — SciDAVis に似たフリーのデータ解析・視覚化アプリケーション。\n\n- Plots — A graph plotting app for GNOME.\n\n- Rocs — グラフアルゴリズムを設計・解析するのに興味がある全ての人 (教師・学生・研究者) のためのグラフ理論 IDE。kde-education に含まれます。\n\n- ROOT — CERN によって開発されている（元は素粒子物理学用の）データ解析プログラム・ライブラリ。\n\nアプリケーション一覧#スプレッドシートも見てください。\n\n"
    },
    {
      "title": "証明支援システム",
      "level": 4,
      "content": "Wikipedia:Proof assistant も参照。\n\n- Agda — 依存型・関数型プログラミング言語・プルーフアシスタント。直感的に証明を書いてチェックできます。\n\n- Coq — 形式証明管理システム。数学主題と実行アルゴリズム、定理を記述するための形式言語を備えており、機械的に証明をチェックする半自動な開発環境を実現します。\n\n- Isabelle — 数学定理を形式言語で表現できる汎用の証明支援器。論理計算で定理を証明するためのツールを提供します。\n\n"
    },
    {
      "title": "物理シミュレーション",
      "level": 4,
      "content": "- Code_Aster — 土木工学や構造力学における有限要素解析 (FEA) や数値シミュレーションのためのソフトウェアパッケージ。\n\n- OpenFOAM — Software package and toolkit for computational fluid dynamics (CFD).\n\n- Calculix — A three-dimensional structural finite element program.\n\n- Elmer_FEM_solver — Finite element analysis (FEA/FEM) software for multiphysics problems. Includes models for fluid dynamics, structural mechanics, electromagnetics, heat transfer, and acoustics.\n\n- Netgen/NGSolve — A high performance multiphysics finite element software, with a flexible Python interface to implement new physical equations and solution algorithms easily.\n\n- ONELAB/Gmsh — An open-source, lightweight interface to finite element software, by default containing the mesh generator Gmsh, the finite element solver GetDP and the optimization library conveks.\n\n- FEniCS — An open-source computing platform for solving partial differential equations, enabling users to quickly translate scientific models into efficient finite element code with the high-level Python and C++ interfaces that scale across platforms ranging from laptops to high-performance clusters.\n\n- FEBio — An open-source software tool for nonlinear finite element analysis specifically focused on solving nonlinear large deformation problems in biomechanics and biophysics, able to solve problems in mixture mechanics (i.e. biphasic or multiphasic materials), fluid mechanics, reaction-diffusion, and heat transfer, including fluid-solid interactions.\n\n- EPANET — 配水管網における水の移動と水質に関する長期シミュレーションを行います。\n\n- Step — 二次元の物理シミュレーション。kde-education に含まれています。\n\n- SWMM — SWMM\n\n"
    },
    {
      "title": "単位変換",
      "level": 4,
      "content": "- ConvertAll — 意味がないものでも様々に単位を組み合わせられる (e.g. inches per decade) 単位変換アプリケーション。\n\n- Gonvert — 長さ、量、数など多くのカテゴリで CGS・帝国単位・古代単位など多くの単位系間で変換できる変換ユーティリティ。\n\n- Units — コマンドライン単位コンバーター・電卓。倍数的なスケール変化、ノンリニアな変換ができる。華氏を摂氏やゲージに変換する等。\n\n"
    },
    {
      "title": "分子構造",
      "level": 4,
      "content": "See also Wikipedia:List of molecular graphics systems.\n\n- Avogadro — 3D 分子構造のエディタ・ビューア・シミュレータ (蛋白質構造データバンクからのファイルのダウンロードもサポート)。\n\n- BALLView — スタンドアローンの分子モデリング・視覚化アプリケーション。BALL フレームワークの一部。\n\n- Ghemical — 分子構造を編集・回覧・シミュレートするために使われる計算化学ソフトウェアパッケージ。\n\n- PyMOL — オープンソースの分子視覚化システム。小さな分子や、タンパク質などの生体高分子の高品質な 3D イメージを作成できます。\n\n- VMD — 3D グラフィックと内蔵のスクリプトを使って巨大な生体分子を表示・アニメーション・解析する分子視覚化プログラム。\n\n- BKChem — 実践的な見かけの良い化学構造式の描写プログラム。\n\n- Chemtool — 化学構造式を描写するための GTK プログラム。\n\n- Gabedit — GAMESS, Gaussian, MOLCAS, MOLPRO, MPQC, OpenMopac, Firefly (旧名 PC GAMESS), Q-Chem などの計算化学パッケージのグラフィカルユーザーインターフェース。\n\n- APBS — 分子複合系の静電気・溶媒和の性質を解析。\n\n- CP2K — 量子化学と固体物理学のソフトウェアパッケージ。\n\n- Fpocket — ボロノイ分割に基づく非常に高速なオープンソースの蛋白質ポケット検知アルゴリズム。\n\n- GROMACS (GROningen MAchine for Chemical Simulations) — 分子動力学法を使うための多目的パッケージ。数百から数万原子（分子、粒子）の系の動きのニュートン方程式をシミュレートする。\n\n- AmberTools — 独立して開発されている複数のパッケージと Amber18 から構成されたスイート。完全な分子動力学シミュレーションを実行することができます。顕在水分子あるいは一般化ボルン溶媒モデルを使用。\n\n- NAMD — 巨大な生命分子系の高性能シミュレーションのために作られた並列分子動力学コード。\n\n- ORCA — 非経験的, DFT, 半経験的 SCF-MO パッケージ。\n\n- PDB2PQR — 分子複合系の静電気・溶媒和の性質を解析。\n\n- PMEMD — MBER ソフトウェアパッケージの PMEMD モジュール。\n\n- Quantum ESPRESSO — 電子状態計算とナノスケールの材料モデリングのアプリケーションの統合スイート。密度汎関数理論、平面波、擬ポテンシャル（ノルム保存/ウルトラソフト）に基づく。\n\n- smina — スコアリング・最小化が改善された Autodock Vina のフォーク。\n\n"
    },
    {
      "title": "周期表",
      "level": 4,
      "content": "- eperiodique — EFL を使用するシンプルな周期表ビューア。\n\n- gElemental — 付加情報が含まれている元素周期表。\n\n- Kalzium — 構造式エディタと方程式ソルバーの付いた元素周期表。Part of kde-education.\n\n"
    },
    {
      "title": "地理学",
      "level": 4,
      "content": "- BT747 — MTK GPS データロガーの万能ナイフ。\n\n- FoxtrotGPS — 軽量・高速なマッピングアプリケーション。\n\n- Gebabbel — GPSBabel の代替 GUI。\n\n- GeoDa — A tool for spatial data analysis.\n\n- GNOME Maps — GNOME のシンプルな地図クライアント。gnome-extra に含まれています。\n\n- Gpredict — リアルタイムの人工衛星トラッキング・軌道予測アプリケーション。\n\n- GPSBabel — GPS ウェイポイント・軌跡・ルートを様々なフォーマットで読み書き。\n\n- gpsd — シリアルまたは USB でホストコンピュータに接続された GPS や AIS 受信器を監視して、ホストコンピュータの TCP ポート 2947 からセンサーの位置・進路・速度データを利用できるようにするデーモン。\n\n- GpsPrune — GPS システムの位置データを表示・編集・変換。\n\n- GPXSee — GPS ログビューア・アナライザ。\n\n- GPX Viewer — gpx ファイルに保存された軌跡・ウェイポイントを視覚化するシンプルなツール。\n\n- GRASS GIS — 地理空間データ管理と解析・画像処理・地図生成・空間モデリングと視覚化。\n\n- gvSIG — あらゆる種類の地理情報を取得・保存・管理・解析・展開するためのデスクトップアプリケーションと地理情報システム (GIS) in order to solve complex management and planning problems.\n\n- JOSM — Java で書かれた OpenStreetMap エディタ。\n\n- Mapton — Java で書かれた拡張性の高いデスクトップ地図・地球儀アプリケーション。\n\n- Marble — 地球について学習できる仮想地球・世界地図。kde-education に含まれています。\n\n- Merkaartor — OpenStreetMap エディタ。\n\n- Navit — モジュール方式のターンバイターンカーナビゲーションシステム。\n\n- OffRoad — OsmAnd から移植されたオフラインベクター地図表示システム。\n\n- OpenOrienteering Mapper — オリエンテーリング地図制作プログラム。\n\n- QMapShack — 次回の野外旅行を計画しよう。\n\n- QGIS — ベクター・ラスター・データベース形式をサポートする地理情報システム (GIS)。\n\n- Subsurface — ダイブスポット (GPS 座標に基づく) と使用したウエイト・スーツ、ダイブマスターとバディを記録するダイビングログブック。\n\n- Viking — GPS データを管理するための GTK 2 アプリケーション。\n\n"
    },
    {
      "title": "気象学",
      "level": 4,
      "content": "- Gis Weather — カスタマイズ可能な天気予報デスクトップウィジェット。\n\n- GNOME Weather — あなたの住んでいる都市の天気を表示したりインターネットサービスの天気予報にアクセスできる GNOME 用の小さなアプリケーション。\n\n- meteo-qt — 天気情報を表示するシステムトレイアプリケーション。\n\n- wttr — https://wttr.in のデータを使って天気をチェックするシンプルなコンソールアプリケーション。\n\n- Xfce Weather Panel Plugin — Xfce4 パネルの天気予報プラグイン。\n\n- wego-darksky — A fork of the terminal weather app wego with Dark Sky support.\n\n"
    },
    {
      "title": "天文学",
      "level": 3,
      "content": "- Astropy — The Astropy Project is a community effort to develop a common core package for Astronomy in Python and foster an ecosystem of interoperable astronomy packages.\n\n- Celestia — 広大な宇宙を旅することができる 3D 天体シミュレーションプログラム。現実に即してモデリングされ、いかなる時間のいかなる場所も見ることができます。\n\n- GIMP Astronomy Plugins — 天体画像作成用の GIMP プラグインのセット。\n\n- GoQat — オートガイドやフォーカスヘルプなどの機能を持った、特に QSI カメラ用の、カメラキャプチャソフトウェア。\n\n- KStars — 地球上のどの場所でも、どの時刻でも、夜空の正確なグラフィカルシミュレーションができるプラネタリウムアプリケーション。KDE Edu に含まれています。\n\n- Qastrocam-g2 — 天文学のためのウェブカメラキャプチャソフトウェア。\n\n- Skychart / Cartes du Ciel — 星座・惑星などの望遠鏡で見れるほとんどの天体を図示・ラベリングするプラネタリウム。Digitized Sky Survey チャートやチャートのスーパーインポーズ画像のダウンロードもできます。\n\n- SPICE — A comprehensive toolkit and api to design, simulate and analyse space missions\n\n- StarPlot — 三次元星座ビューア。\n\n- Stellarium — リアルタイムのリアリスティックな空を描くことができる OpenGL を使っている美しい 3D プラネタリウム。\n\n- Where Is M13 — 星団や星雲の位置や物理的な特性を確認できるアプリケーション。\n\n- XEphem — Motif-ベースの天体歴・プラネタリウムプログラム。\n\n"
    },
    {
      "title": "計算生物学とバイオインフォマティクス",
      "level": 4,
      "content": "See also Wikipedia:List of open source bioinformatics software.\n\n- BALL (Biochemical Algorithms Library) — 分子力学法や高度な溶媒和メソッド、蛋白質構造の比較・分析のクラス、さらにデータ構造の広大なセットを提供する C++ のアプリケーションフレームワーク。ファイルのインポート・エクスポートやビジュアライゼーションも可能。\n\n- BioJava — 計算生物学や生物情報科学で使う Java ツールのセット。\n\n- Biopython — 計算生物学や生物情報科学で使う Python パッケージとツール。\n\n- EMBOSS (European Molecular Biology Open Software Suite) — 分子生物学やバイオインフォマティクスのコミュニティのために開発されたオープンソースの分析ソフトウェアパッケージ。\n\n- MUMmer — 接尾辞木を使った配列アライメント用のバイオインフォマティクスソフトウェアシステム。\n\n- Snapgene — クローズドソースの分子クローニングアプリケーション。素早く簡単に生体操作を計画・描画・文章化できます。Supports a wide range of cloning and PCR manipulations. フリー版では一般的な分子生物学のワークフローの視覚化ができます。\n\n- UGENE — よく使われている生物学ツールやアルゴリズムを統合したアプリケーション。グラフィカルユーザーインターフェースとコマンドラインを提供。\n\n"
    },
    {
      "title": "Genealogy",
      "level": 4,
      "content": "- Gramps — 家系図を見ることができる家系プログラム。\n\n- LifeLines — Text based genealogy software for family trees and reports.\n\n"
    },
    {
      "title": "画像処理",
      "level": 4,
      "content": "- ImageJ — プラグインやマクロによる拡張ができる Java ベースのイメージプロセシング・分析プログラム。顕微鏡検査で広く使われています (例: 細胞を数える)。\n\n- Fiji — 多くのプラグインがまとめられた ImageJ ディストリビューション (と ImageJ2)。\n\n"
    },
    {
      "title": "DICOM ビューアとボリュームレンダリング",
      "level": 4,
      "content": "- aeskulap — シンプルな DICOM データビューア。\n\n- weasis — モジュラー型の多目的 DICOM ビューア。\n\n- aliza — DICOM, MetaIO, Nifti, Nrrd 形式などの 2D, 3D, 4D 画像と DICOM, VTK, STL, OBJ 形式のメッシュを開きます。\n\n- 3DSlicer — 包括的な MRI, CT, LSCM 顕微鏡ボリューム処理・分割・3D 再構成。\n\n- ParaView — Interactive data visualization tool built using VTK that can scale across distributed computer hardware.\n\n"
    },
    {
      "title": "コンピュータ支援設計",
      "level": 4,
      "content": "See also Wikipedia:List of computer-aided design editors.\n\n- BRL-CAD — Constructive Solid Geometry (CSG) ソリッドモデリングコンピュータ支援設計 (CAD) システム。インタラクティブなジオメトリーエディタ、グラフィックレンダリングやジオメトリック分析に使えるレイトレーシング、分散ネットワークコンピューティングフレームバッファ、スクリプト、イメージプロセッシング・シグナルプロセッシングツール。\n\n- FreeCAD — OpenCascade ベースの CAD/CAE プログラム。マクロ記録、ワークベンチ、サーバー機能などを備えています。Qt と Python で開発。\n\n- LeoCAD — バーチャル LEGO モデルを作成するための CAD プログラム。使用しやすいインターフェースを持っており、現在、LDraw コミュニティによって作成された10,000以上の異なったピースを含んでいます。\n\n- LibreCAD — Qt5 を使ったパワフルな 2D CAD アプリケーション。QCad コミュニティエディションからフォークされて作られました。\n\n- OpenSCAD — プログラマー流によるオープンソースの 2D/3D CAD。\n\n- QCAD — 2D CAD アプリケーション。QCaD には標準の DXF ファイルフォーマットが含まれており HPGL フォーマットをサポートしています, and optionally the DWG format through a proprietary plugin.\n\n- SolveSpace — Powerful 3D CAD constraint-based parametric modeler with simple mechanical simulation capabilities.\n\n"
    },
    {
      "title": "電子工学",
      "level": 4,
      "content": "See also Wikipedia:Comparison of EDA software.\n\nデジタル論理ソフトウェアは主として、論理回路を設計・シミュレートするためのシンプルな教育ツールとして使われます。\n\n- Digital — Interactive simulator similiar to the discontinued Logisim. Features Karnaugh maps, logic tables, FSM editor, VHDL export and more, written in Java.\n\n- glogic — Python で書かれた教育用のグラフィカルな論理回路シミュレータ。\n\n- GTKWave — フル機能の GTK ベース波形ビューア。LXT, LXT2, VZT, FST, GHW ファイルや標準的な Verilog VCD/EVCD ファイルを読み込むことができます。\n\n- Logisim — 教育用の電子回路設計・シミュレーションプログラム。Java で書かれています。開発は停止中。\n\n- Logisim Evolution — オリジナルの Logisim に新しい機能を開発するプロジェクト。Java で書かれています。\n\n- PulseView — 論理アナライザ・オシロスコープ・MSO GUI。\n\n- SmartSim — シンプルで綺麗な電子論理回路設計・シミュレーションソフトウェア。教師と生徒を対象としており、軽量でクロスプラットフォーム、GPL でライセンスされています。Vala で書かれています。\n\n- WaveDrom editor — Timing diagram rendering in real-time from simple textual description. Can also be edited and embedded in the browser.\n\nAlso see Wikipedia:Hardware description language.\n\n- Gowin EDA Edu IDE — An IDE for Gowin's FGPA devices, including Sipeed Tang Nano and Sipeed Tang Nano 4K.\n\n- en:Intel Quartus Prime — Quartus Prime と ModelSim-Intel, HLS Compiler, etc を含む Intel の FPGA device の設計ツール。\n\n- Lattice Diamond — A set of design tools for Lattice's FPGA chips.\n\n- Microsemi Libero — Development tools for designing with Microsemi's PolarFire, IGLOO2, SmartFusion2, RTG4, SmartFusion, IGLOO, ProASIC3 and Fusion families.\n\n- Xilinx ISE WebPACK — FPGA プログラマブルロジックデザインスイート。\n\n- GHDL — Free and Open Source VHDL 2008/93/87 analyzer, compiler and simulator.\n\n- OpenFPGAloader — Universal utility for programming FPGA. Try openfpgaloader-gitAUR if your board isn't managed by the stable version.\n\n- Verilator — A Verilog/SystemVerilog simulator, performs lint code-quality checks, compile to threaded C++ code for simulation.\n\n- iverilog — Icarus Verilog compiler and simulation tool (slower but older than Verilator).\n\n- VTR — Verilog to Routing, Open Source CAD Flow for FPGA ResearchVerilog to Route.\n\n- Arduino — Arduino プロトタイピングプラットフォーム SDK。\n\n- avrcalc — Atmel AVR の開発を加速する計算機。\n\n- AVRDUDE — AVR マイクロコントローラの ROM や EEPROM の中身をダウンロード・アップデート・操作。\n\n- dfu-util — Device firmware update (DFU) USB programmer.\n\n- SPIPGM — パラレルポートケーブルで PC に接続されたシリアル SPI フラッシュ ROM メモリをプログラミングするためのツール。\n\n- esp-idf — Espressif IoT Development Framework. Official development framework for ESP32.\n\n- platformio — Collaborative platform for embedded development, embedded development, with debugger, unit testing, code analysis. Default IDE is VSCode, but can be used by Atom, Eclipse, Emacs Qt Creator, Vim and several other IDE. Core CLI utils.\n\n- easy_spice — Electronic circuit simulator. SPICE frontend, using gschem for schematics and ngspice as simulator.\n\n- eispice — Clone of the Berkley SPICE 3 Simulation Engine. It was originally targeted toward PCB level Signal Integrity Simulation; simulating IBIS model defined devices, transmission lines, and passive termination but the scope of the tool has been slowly expanding to include more general purpose circuit simulation features. Python interface.\n\n- gnucap — GNU circuit simulator.\n\n- gspiceui — GUI to various freely available Spice electronic ciruit simulators.\n\n- Oregano — 回路図入力や電子回路のシミュレーションに使うグラフィカルソフトウェアアプリケーション。シミュレーションは ngspice か Gnucap エンジンによって行われます。\n\n- ngspice — 回路のシミュレートに使用するアプリケーション。spice3f5 のオープンソース版後継。Has the most versatile user interface; supporting scripting within the circuit descriptions, use through an interpreter, as a C library, through tcl or various external wrappers (e.g., Python).\n\n- Qucs — 電子回路シミュレーションアプリケーション。グラフィカルユーザーインターフェースによる回路の設計と、大信号・小信号・ノイズの挙動をシミュレートができます。\n\n- qucs-s — Electronics circuit simulator that gives you the ability to set up a circuit with a GUI and simulate it. Fork of qucs that uses external, better, programs to do actual simulation.\n\n- Xyce — SANDIA Xyce is an open source, SPICE-compatible, high-performance analog circuit simulator, capable of solving extremely large circuit problems by supporting large-scale parallel computing platforms.\n\n- asco — SPICE Circuit Optimizer.\n\n- Fritzing — Easy to use program to draw good-looking circuit diagrams, and also create schematics and PCBs.\n\n- gEDA — 電子回路の設計や、回路図入力、シミュレーション、プロトタイピング、生産につかわれる電子設計自動化ツールのフルスイートとツールキット。\n\n- gEDA PCB — インタラクティブなプリント基板エディタ。\n\n- KiCAD — 電子回路の結線図の設計やプリント基板 (PCB) への実装を容易にする電子設計自動化のソフトウェアスイート。\n\n- QElectroTech — 高度な電子回路を設計するために使われるアプリケーション。\n\n"
    },
    {
      "title": "遠距離通信",
      "level": 3,
      "content": "- GNU Radio — ソフトウェア無線を実装するための信号処理ブロックを提供するソフトウェア開発ツールキット。\n\n- Gqrx — GNU Radio と Qt GUI ツールキットで実装されたソフトウェア無線レシーバ。\n\n- Pothos — 相互接続された信号ブロックのトポロジーを作成するための完全なデータフローフレームワーク。\n\n- SDR# — 人気の SDR プログラム。\n\n- SigDigger — Qt ベースのデジタル信号アナライザ。Suscan コアと Sigutils DSP ライブラリを使用。\n\n"
    },
    {
      "title": "アマチュア無線",
      "level": 4,
      "content": "メインの記事を見てください: アマチュア無線#ソフトウェアリスト。\n\nWikipedia:List of software-defined radios も参照。\n\n"
    },
    {
      "title": "シミュレーションモデリング",
      "level": 3,
      "content": "- Flight Gear — Open-source, multi-platform atmospheric and orbital flight simulator with a flight dynamics engine (JSBSim) that is part of a 2015 NASA benchmark to judge new simulation code to space industry standards.\n\n- gephi — Java で書かれたオープンソースのネットワーク解析・視覚化ソフトウェア。\n\n- golly — ライフゲーム (Conway's Game of Life) や他のセルオートマトンを探査するオープンソース・クロスプラットフォームアプリケーション。\n\n- Netlogo — マルチエージェントのプログラマブルモデリング環境。\n\n- AnyLogic — クロスプラットフォームのプロプライエタリマルチメソッドシミュレーションモデリングツール。個人利用も可能。\n\n"
    },
    {
      "title": "人工知能",
      "level": 4,
      "content": "Wikipedia:Comparison of deep learning software も参照。\n\n- Fast Artificial Neural Network — 順伝播型ニューラルネットワークを開発するためのライブラリ。\n\n- Mycroft — 音声認識を備えた知的パーソナルアシスタント・ナレッジナビゲータ。\n\n- Orange — ビジュアルプログラミングや Python で使えるデータ視覚化・機械学習・データマイニングツールキット。\n\n- Torch — 機械学習ライブラリ・科学計算フレームワーク・LuaJIT ベースのスクリプト言語。\n\n- X Neural Switcher — 自動 (知的) でキーボードレイアウトを修正。\n\n- Tensorflow — エンドツーエンドのオープンソース機械学習プラットフォーム。\n\n- PyTorch — 研究時のプロトタイピングから本番環境への実装を加速するオープンソース機械学習フレームワーク。\n\n- Theano — Theano is a Python library that allows you to define, optimize, and evaluate mathematical expressions involving multi-dimensional arrays efficiently.\n\n"
    },
    {
      "title": "Photogrammetry",
      "level": 4,
      "content": "See also Wikipedia:Comparison_of_photogrammetry_software.\n\n- OpenMVS — A software package.\n\n- OpenMVG — A software package.\n\n- AliceVision — A software package.\n\n"
    },
    {
      "title": "Personal information managers",
      "level": 4,
      "content": "These applications support time, task and contacts management.\n\n- Evolution — Personal information management application that provides integrated mail, calendaring and address book functionality. Part of gnome-extra.\n\n- Kontact — Integrated solution to your personal information management.\n\n- Osmo — GTK パーソナルオーガナイザ。カレンダー、タスク管理、アドレス帳のモジュールを含む。\n\n- SeaMonkey Mail & Newsgroups with Lightning — Extension to SeaMonkey that provides calendar and task support.\n\n- Thunderbird with Lightning — カレンダーとタスクを加える Mozilla Thunderbird 拡張。\n\n"
    },
    {
      "title": "Time management",
      "level": 4,
      "content": "- Calcurse — テキストベースの ncurses カレンダー・スケジューリングシステム。(supports CalDAV)\n\n- ccal — A console program which writes a calendar together with Chinese calendar to standard output.\n\n- khal — Command-line (non-interactive) and ncurses (interactive) calendar system (supports CalDAV)\n\n- mail2rem — Maildir から Remind カレンダーに .ics カレンダーをインポートするための小さなスクリプト。\n\n- Pal — インタラクティブなインターフェースとそうでないインターフェースを持つとても軽量なカレンダー。\n\n- pcal — A tool to create pdf calendars from pcal input which can be exported by some calendar programs.\n\n- Remind — 高度に洗練されたテキストベースのカレンダー・通知システム。\n\n- When — シンプルなパーソナルカレンダープログラム。\n\n- Wyrd — UNIX や Linux コンピュータで使われるカレンダー・アラームプログラムの Remind のテキストベースのフロントエンド。\n\n- chinese-calendar — Chinese traditional calendar for Ubuntu Kylin.\n\n- CoreTime — Very simple Clock/Calendar application which shows a clock, supports alarms, reminders, a stop watch and a timer. Part of C-Suite.\n\n- Day Planner — 時間の管理や予定作成を助けるプログラム。アポイントや誕生日などを管理できます。\n\n- Deepin Calendar — Calendar application for Deepin.\n\n- etmtk (Event and Task Manager) — \"Getting Things Done!\" アプローチによってイベント・タスク・活動・リマインダー・プロジェクトなどを管理するシンプルなアプリケーション。\n\n- Gahshomar — Persian (Jalali/Farsi) calendar.\n\n- GNOME Calendar — GNOME のカレンダーアプリケーション。\n\n- KAlarm — Personal alarm message, command and email scheduler, part of kdepim[リンク切れ: package not found].\n\n- KOrganizer — カレンダー・スケジューリングプログラム, part of kdepim[リンク切れ: package not found].\n\n- Kalendar — A calendar application using Akonadi to sync with external services (NextCloud, GMail, ...).\n\n- Nextcloud Calendar — Calendar app for Nextcloud.\n\n- Outspline — 高度な時間管理機能がある拡張性に優れたアウトライナー。複雑に発生するイベントをサポート。\n\n- Pantheon Calendar — Desktop calendar app designed for elementary OS.\n\n- TkRemind — 洗練されたカレンダー・アラームプログラム。\n\n"
    },
    {
      "title": "Timers",
      "level": 4,
      "content": "- GNOME Clocks — GNOME の時計アプリケーション, including alarm, stopwatch and timer functionality.\n\n- Hourglass — Simple time keeping application designed for elementary OS.\n\n- Kronometer — Stopwatch application for KDE.\n\n- KTeaTime — Handy timer for steeping tea.\n\n- pystopwatch — Stopwatch written in Python with a clock and two countdown functions that can minimize to the tray.\n\n- termdown — Countdown timer and stopwatch in your terminal.\n\n- GNOME Break Timer — コンピュータの使用時間を記録して、定期的に休憩を促すプログラム。\n\n- RSI Break — Takes care of your health and regularly breaks your work to avoid repetitive strain injury (RSI).\n\n- Safe Eyes — Tool to reduce and prevent repetitive strain injury (RSI).\n\n- Workrave — RSI を補助するツール。\n\nSee Wikipedia:Pomodoro Technique for an introduction.\n\n- flow — Pomodoro app that blocks distractions while you work.\n\n- Gnomato — Timer for the Pomodoro Technique.\n\n- GNOME Pomodoro — Time management utility for GNOME based on the Pomodoro Technique.\n\n- Pilorama — Eye-candy timeboxing tool written in QML\n\n- Pomodoro-Logger — Pomodoro timer and logger with Kanban board for task management and tracking.\n\n- Solanum — A pomodoro timer for the GNOME desktop\n\n- Tomate — Timer for the Pomodoro Technique.\n\n- Tomato — Simple, usable and efficient pomodoro app designed for elementaryOS.\n\n- Tomighty — Desktop timer for the Pomodoro Technique.\n\n"
    },
    {
      "title": "Time trackers",
      "level": 4,
      "content": "- ActivityWatch — A self/local-hosted, cross-platform, client-server, privacy-focused active window tracker.\n\n- Hamster — 一日のアクティビティにどれくらい時間がかかったかを記録するタイムトラッキングアプリケーション。\n\n- Kapow — Punch clock to track time spent on projects.\n\n- KTimeTracker — Todo management and time tracking application.\n\n- Tider — 軽量なタイムトラッキングアプリケーション (GTK)。\n\n- Timenaut — Time tracker that tracks active windows and lets you sort them into categories. Based on the Electron platform.\n\n- Timewarrior — A command-line time-tracking application.\n\n- Timetrack — Simple time-tracking app for GNOME.\n\n- Wakatime — Open source plugins for metrics about your programming with intuitive web-interface.\n\n"
    },
    {
      "title": "Task management",
      "level": 4,
      "content": "- DevTodo — タスクリストを管理するための小さなコマンドラインアプリケーション。\n\n- Taskbook — Tasks, boards & notes for the command-line habitat.\n\n- Taskwarrior — lua によるカスタマイズ性その他をサポートするコマンドラインの To-do リストアプリケーション。\n\n- todoman — Command-line To-do list manager (supports CalDAV)\n\n- Todo.txt — 小さなコマンドライン To-do マネージャ。\n\n- TuDu — Vimの様なキーバインドを備えた Ncurses ベースの階層的な To-do リストマネージャ。\n\n- Agenda — Simple, fast, no-nonsense to-do (task) list for elementary OS.\n\n- Effitask — Graphical task manager, based on the Todo.txt format.\n\n- Getting Things GNOME! — GNOME デスクトップ向けのパーソナルタスク・To-do リスト管理アプリケーション inspired by the Getting Things Done (GTD) methodology.\n\n- Go For It! — Simple and stylish productivity app, featuring a to-do list, merged with a timer that keeps your focus on the current task. To-do lists are stored in the Todo.txt format.\n\n- GNOME To Do — Personal task manager for GNOME.\n\n- Nextcloud Tasks — Tasks app for Nextcloud.\n\n- Planner — Task manager with Todoist support.\n\n- ptask — GTK task manager based on Taskwarrior.\n\n- QTodoTxt — todo.txt ファイルの UI クライアント。\n\n- sleek — todo.txt app with modern GUI. Based on the Electron platform.\n\n- Task Coach — パーソナルタスクと To-do リストを管理するシンプルな To-do マネージャ。\n\n- Tasque — Easy quick task management app written in C#.\n\n- Zanshin — To-do management application for KDE.\n\n"
    },
    {
      "title": "Contacts management",
      "level": 4,
      "content": "- Abook — Text-based contacts manager designed for use with mutt.\n\n- Khard — Command-line addressbook that is able to sync with CardDAV-servers.\n\n- Communicator — Integrated address book and dialer application features the search for and view of contacts, edit contact details, and make new contacts, favorites, and dialer pad.\n\n- GNOME Contacts — Contacts manager for GNOME.\n\n- KAddressBook — Address book manager for KDE.\n\n- LDAP Administration Tool — Browse LDAP-based directories and add/edit/delete entries contained within.\n\n- Nextcloud Contacts — Contacts app for Nextcloud.\n\n- phpLDAPadmin — LDAP client webapp. Its hierarchical tree-viewer and advanced search functionality make it intuitive to browse and administer your LDAP directory.\n\n- Thunderbird with CardBook extension — address book based on the CardDAV and vCard standards.\n\n"
    },
    {
      "title": "ファイナンス",
      "level": 4,
      "content": "See also Wikipedia:Comparison of accounting software.\n\n- Beancount — 金融取引記録をテキスト ファイルで定義し、メモリ内で読み取り、そこからさまざまなレポートを生成し、Web インターフェイスを提供できる複式簿記のコンピューター言語。\n\n- esniper — eBay オークションでスナイプするためのシンプルで軽量なツール。\n\n- hledger — 複式簿記を使ってお金や時間、商品を追跡するための会計プログラム。シンプルで編集しやすいファイルフォーマットを使います。Ledger と互換性があります。\n\n- Ledger — Ledger はパワフルな、複式記帳法の会計システムで、UNIX コマンドラインからアクセスします。\n\n- BillReminder — Small and quick accounting application designed to allow for easy tracking of bills.\n\n- Eqonomize! — Cross-platform personal accounting software, with focus on efficiency and ease of use for the small household economy.\n\n- GnuCash — 複式簿記システムを実装した小さなビジネスの会計向けのファイナンスアプリケーション。\n\n- Grisbi — パーソナルファイナンスシステム。サードパーティ・支出・レシートのカテゴリと予算・会計年度など組織の運営に役立つ情報を管理します。\n\n- HomeBank — パワフルなフィルタリングツールやグラフでお金の使い道を分析できる使いやすいファイナンスマネージャ。\n\n- KMyMoney — Microsoft Money に似たパーソナルファイナンスマネージャ。収入と支出のカテゴリ分配や銀行口座の調整、“QIF” ファイルフォーマットのインポート・エクスポートをサポート。\n\n- Kresus — セルフホスト型の個人財務管理ソフトウェア。毎日、すべての新しい銀行取引を自動的に取得し、それらを分類し、チャートで調査し、予算を設定することができます。\n\n- Manager — 中小企業向けのプロプライエタリ会計ソフトウェア。\n\n- Money Manager EX — 使いやすい個人用ファイナンススイート。\n\n- Odoo — 純粋に python で作られたオープンソースの ERP システム。以前は OpenERP として知られていました。\n\n- Skrooge — KDE デスクトップ向けのパーソナルファイナンスマネージャ。\n\n"
    },
    {
      "title": "暗号通貨",
      "level": 4,
      "content": "- ARK デスクトップウォレット — ARK 用のウォレット。\n\n- Atomic ウォレット — Bitcoin、Ethereum、XRP、Litecoin、XLM、その他300以上のコインとトークンを管理。\n\n- Bitcoin Core — Bitcoin P2Pネットワークに接続。\n\n- Cake ウォレット — マルチ通貨ウォレット。\n\n- Sparrow ウォレット — 高度なBitcoinクライアント。\n\n- Coinomi — Bitcoin、Ethereum、その他1,770以上のブロックチェーン資産を安全に保管、管理、交換。\n\n- Cointop — 暗号通貨を追跡するためのターミナルベースのアプリケーション。\n\n- Electrum — 軽量なBitcoinクライアント。\n\n- Etherwall — Ethereumウォレット。\n\n- Exodus — ブロックチェーン資産を安全に保管、管理、交換するための統合型プロプライエタリアプリケーション。Electronプラットフォームベース。\n\n- Mist — Ethereum Dappブラウザ。\n\n- Monero — Moneroウォレット。\n\n- Feather ウォレット — 軽量Moneroウォレット。\n\n- Dogecoin Core — Dogecoin Coreウォレット、Dogecoin P2Pネットワークへの接続を可能にする。\n\n"
    },
    {
      "title": "プロジェクト管理",
      "level": 4,
      "content": "Wikipedia:ja:プロジェクト管理ツールの比較 も参照してください。\n\n- Calligra Plan — 複数のリソースを使用して中規模のプロジェクトを管理することを目的としたプロジェクト管理アプリケーション。\n\n- GanttProject — ガントチャート、リソース管理、カレンダー機能を備えたプロジェクトスケジューリングアプリケーション。\n\n- Planner — GNOME 用のプロジェクト管理アプリケーション。\n\n- ProjectLibre — Microsoft Project の代替となるプロジェクト管理ソフトウェア。\n\n- TaskJuggler — モダンで強力なプロジェクト管理ツール。その新しいプロジェクト計画および追跡アプローチは、一般的に使用されているガントチャート編集ツールよりも柔軟で優れています。\n\n"
    },
    {
      "title": "レシピ管理",
      "level": 4,
      "content": "- GNOME Recipes — GNOME 用のレシピ管理アプリケーション。\n\n- Gourmand — シンプルでありながら強力なレシピ管理アプリケーション。\n\n- KRecipes — 個人のレシピコレクションを素早く簡単に整理するために設計された KDE アプリケーション。\n\n"
    },
    {
      "title": "教育",
      "level": 3,
      "content": "See also ゲーム一覧#教育.\n\n- Moodle — オープンソースの学習管理システム。\n\n- OpenBoard — Interactive whiteboard software for schools and universities.\n\n"
    },
    {
      "title": "フラッシュカード",
      "level": 4,
      "content": "See also Wikipedia:List of flashcard software.\n\n- Anki — 物事を記憶するのを楽にするプログラム。\n\n- jVLT — Vocabulary learning tool.\n\n- KWordQuiz — Tool that gives you a powerful way to master new vocabularies. Part of kde-education.\n\n- Mnemosyne — 学習を最適化するフラッシュカードツール。\n\n- Parley — Program to help you memorize things. It uses the spaced repetition learning method, also known as flash cards. Part of kde-education.\n\n- Pauker — Flash card based learning tool using shortterm and longterm memory training.\n\n- OpenTeacher — Open source application that helps you learn a variety of subjects\n\n- StudyFlash — Learn flashcards inside your terminal\n\n"
    },
    {
      "title": "タッチタイピング",
      "level": 4,
      "content": "- Dvorak 7min — Dvorak キーボードレイアウトに慣れるためのシンプルな ncurses ベースのタイピングチューター。\n\n- GNU Typist — 汎用のタイピングチューター。\n\n- psani-profi — タッチタイピングを教えるプログラム（チェコ語）。\n\n- Typing Trainer — 英語とハンガリー語に対応した ncurses ベースのタイピングトレーナープログラム。\n\n- Typespeed — タイピング速度をテストし、指の CPS（秒間入力数）を測定します。\n\n- typiskt — ターミナル（Bash）でのタッチタイピングトレーニング。\n\n- Amphetype — 画面上のキーボードを必要としないが、速度と精度を向上させたい人向けのレイアウト非依存のタイピングプログラム。\n\n- Klavaro — キーボードや言語に依存しないタッチタイピングを教えるプログラム。\n\n- KTouch — タッチタイピングを学び、練習するためのプログラム。kde-education の一部。\n\n- TIPP10 — インテリジェントなタッチタイピングチューター。\n\n- TypingTest — 多くのカスタマイズが可能なタイピングテストデスクトッププログラム。\n\n"
    },
    {
      "title": "アクセシビリティ",
      "level": 3,
      "content": "See アクセシビリティ for tips on operating the desktop and Category:アクセシビリティ for all available articles. See also On-screen keyboards.\n\n"
    },
    {
      "title": "Speech synthesizers",
      "level": 4,
      "content": "See also Wikipedia:Comparison of speech synthesizers and listening comparison of the different engines.\n\n- Ekho — Chinese text-to-speech (TTS) software for Cantonese, Mandarin, Zhaoan Hakka, Tibetan, Ngangien and Korean.\n\n- eSpeak — Compact speech synthesizer for more than 50 languages.\n\n- eSpeak NG — Fork of eSpeak (due to inactivity of original maintainer).\n\n- Festival — General framework for building speech synthesis systems as well as including examples of various modules. As a whole it offers full text to speech.\n\n- Flite — Lightweight speech synthesis engine.\n\n- Gespeaker — GTK frontend for espeak. It allows you to play a text in many languages with settings for voice, pitch, volume and speed.\n\n- KMouth — Speech synthesizer frontend which enables persons that cannot speak to let their computer speak.\n\n- MaryTTS — Multilingual text-to-speech synthesis platform written in Java.\n\n- MBROLA — Proprietary phonemes-to-audio program which supports more than 70 languages. Mbrola-voices can also be used with eSpeak.\n\n- Mimic — Mycroft プロジェクトの音声合成システム(based on Flite)。\n\n- Open JTalk — Japanese text-to-speech synthesis system.\n\n- Orca — 視力がない人のためのスクリーンリーダー, using eSpeak (via Speech Dispatcher).\n\n- RHVoice — Cross-platform (including Android) text-to-speech from a blind Russian-speaking developer, based on HTS (ru, ka, uk, ky, tt, en, pt, eo)\n\n- SOPS — Orca スクリーンリーダーのプラグイン拡張。\n\n- Speech Dispatcher — Common interface to speech synthesis. It has backends for eSpeak, Festival, and a few other speech synthesizers.\n\n- SVOX Pico — The text-to-speech engine used on Android phones. (en-US, en-GB, de-DE, es-ES, fr-FR, it-IT)\n\n"
    },
    {
      "title": "音声認識",
      "level": 4,
      "content": "See also Wikipedia:Speech recognition software for Linux.\n\n- Blather — Speech recognizer that will run commands when a user speaks preset commands, uses PocketSphinx.\n\n- Julius — Large vocabulary continuous speech recognition engine.\n\n- Kaldi — Speech recognition toolkit.\n\n- Kalliope — Modular always-on voice controlled personal assistant designed for home automation.\n\n- Kaylee — Somewhat fancy voice command recognition program that performs actions when a user speaks loosely preset sentences.\n\n- Mycroft — Hackable voice assistant.\n\n- Simon — Speech recognition program that can replace your mouse and keyboard.\n\n- nerd-dictation — Light weight manually activated dictation using the VOSK-API\n\n"
    },
    {
      "title": "Screen magnifiers",
      "level": 4,
      "content": "- KMag — Small KDE utility to magnify a part of the screen.\n\n- Magnus — Very simple desktop magnifier, showing the area around the mouse pointer in a separate window magnified two, three, four, or five times.\n\n- Virtual Magnifying Glass — Simple, customizable and easy-to-use screen magnification tool.\n\n- xzoom — Zoom, rotate and mirror area of X display.\n\n"
    },
    {
      "title": "On-screen annotation",
      "level": 4,
      "content": "- Gromit-MPX — Tool to make annotations on the screen.\n\n- Pylote — Tool to draw on the screen.\n\n- Screenkey — Tool to display pressed keys.\n\n"
    },
    {
      "title": "マウス",
      "level": 4,
      "content": "- Easystroke — マウスジェスチャーを使用してコマンドやホットキーを起動します。\n\n- KMouseTool — マウスカーソルが少し停止すると、マウスをクリックします。ボタンを押すのが痛い反復性ストレス障害の人々を支援するために設計されました。\n\n- Mousetweaks — ポインティングデバイス向けのアクセシビリティ強化機能。\n\n"
    },
    {
      "title": "Display managers",
      "level": 3,
      "content": "See the main article: ディスプレイマネージャ#ディスプレイマネージャ一覧.\n\n"
    },
    {
      "title": "デスクトップ環境",
      "level": 3,
      "content": "See the main article: デスクトップ環境#デスクトップ環境の一覧.\n\n"
    },
    {
      "title": "ウィンドウマネージャ",
      "level": 4,
      "content": "See also アプリケーション一覧/ユーティリティ#Terminal multiplexers, which offer some of the functions of window managers for the console.\n\n- twin — テキストモード・ウィンドウマネージャ。\n\n- Wmutils — A set of tools for X windows manipulation.\n\nSee the main article: ウィンドウマネージャ#ウィンドウマネージャ一覧.\n\nSee the main article: Xorg#コンポジット.\n\n"
    },
    {
      "title": "Wayland Compositors",
      "level": 4,
      "content": "See the main article: Wayland#Compositors.\n\n"
    },
    {
      "title": "ウィンドウタイル",
      "level": 4,
      "content": "- QuickTile — Compiz Grid プラグインの代わりになる軽量なスタンドアロンプログラム。\n\n- wumwum — ウィンドウマネージャマネージャ。emwh 準拠のウィンドウマネージャをタイル型ウィンドウマネージャに変えます。\n\n"
    },
    {
      "title": "タスクバー",
      "level": 4,
      "content": "See also Wikipedia:Taskbar.\n\n- Avant Window Navigator — 画面の下に表示される軽量なドック。\n\n- Bmpanel — 軽量な、NETWM 準拠のパネル。\n\n- Cairo-Dock — 細かくカスタマイズできるドックとランチャー。\n\n- CoreAction — Side bar with some handy gadgets like system loads, calendar, calculator, notes etc. Part of C-Suite.\n\n- Dash to Panel — A fully customizable icon taskbar for gnome-shell. Moves the dash into the GNOME main panel, similar to KDE Plasma and Windows 10.\n\n- Docky — フル機能のドックアプリケーション。通常のアプリケーションを開きウィンドウを簡単に素早く管理します。\n\n- fbpanel — 軽量な、NETWM 準拠のデスクトップパネル。\n\n- GNOME Panel — GNOME Flashback デスクトップに含まれているパネル。\n\n- Latte — Dock based on Plasma frameworks that provides an elegant and intuitive experience for your tasks and plasmoids.\n\n- Lemonbar — A featherweight bar based on XCB. Provides UTF-8 support, background and foreground colors, text alignment, and not much more.\n\n- LXPanel — LXDE デスクトップの軽量 X11 デスクトップパネル。\n\n- MATE Panel — MATE デスクトップに含まれているパネル。\n\n- nwg-dock — GTK-based dock designed for the Sway window manager.\n\n- nwg-panel — GTK-based panel designed for the Sway window manager.\n\n- PerlPanel — OpenBox などの軽量なウィンドウマネージャや、iDesk などのデスクトップ描写プログラムに最適なパネル。\n\n- Plank — Pantheon デスクトップ環境のエレガントでシンプル、クリーンなドック。\n\n- Polybar — a fast and easy-to-use tool for creating status bars.\n\n- Tint2 — Openbox 用に開発されているシンプルなパネル・タスクバー。\n\n- Vala Panel — Gtk3 panel for compositing window managers\n\n- Xfce Panel — Xfce デスクトップのパネル。\n\n- xmobar — A lightweight, text-based, status bar written in Haskell.\n\n- Waybar — A customizable taskbar for Wlroots-based Wayland compositors.\n\n- yambar — A modular and lightweight status panel for X11 and Wayland that goes to great lengths to be both CPU and battery efficient.\n\n"
    },
    {
      "title": "System tray",
      "level": 4,
      "content": "- AllTray — Dock other applications into the system tray (notification area).\n\n- Docker — システムトレイとして動作するドック。\n\n- KDocker — Dock any application in the system tray (notification area).\n\n- Stalonetray — スタンドアローン freedesktop.org and KDE システムトレイ (notification area) for Xorg. It has full XEMBED support and minimal dependencies: an X11 lib only. Stalonetray works with virtually any EWMH-compliant window manager.\n\n- Trayer — 軽量な GTK ベースのシステムトレイ (notification area).\n\n"
    },
    {
      "title": "アプリケーションランチャー",
      "level": 4,
      "content": "See also Wikipedia:Comparison of desktop application launchers.\n\n- Albert — Sophisticated, plugin based standalone keyboard launcher.\n\n- Application Finder — Xfce の使いやすいアプリケーションランチャ。\n\n- Bashrun2 — 小さな xterm のウィンドウで特別な Bash セッションを使用してダイアログを実行する、風変わりなベアボーン風の方法を提供します。\n\n- bemenu — Lightweight dynamic menu inspired by dmenu. Works natively on Wayland.\n\n- dmenu — アプリケーションランチャーとしても使える高速で軽量な X 用ダイナミックメニュー。\n\n- dmenu-extended — ファイルやフォルダを素早く開くための dmenu の拡張。\n\n- dmenu2 — 多数のパッチを適用して画面選択・輝度・透過度設定などのオプションを追加した dmenu の Unmaintained フォーク。\n\n- dswitcher — dmenu ベースのウィンドウスイッチャ。ワークスペースや最小化と関係なく動作します。\n\n- Fehlstart — 小さな GTK ベースのアプリケーションランチャー。\n\n- Gmrun — 軽量な GTK ベースのアプリケーションランチャー。ターミナルからのプログラムの起動など便利な機能があります。\n\n- GNOME Do — 元は GNOME デスクトップ用に開発されていた、Quicksilver にインスパイアされ多くのプラグインを持つアプリケーションランチャー。\n\n- Gnome-Pie — Circular application launcher (pie menu) for Linux. It is made of several pies, each consisting of multiple slices.\n\n- j4-dmenu-desktop — 超高速な dmenu アプリケーションランチャー。\n\n- jgmenu — Simple, independent, contemporary-looking X11 menu, designed for scripting, ricing and tweaking.\n\n- higgins — デスクトップを選ばないアプリケーションランチャー、ファイルファインダー、電卓もろもろ。プラグインを使うことで簡単・自由に拡張できます。\n\n- Kupfer — GNOME デスクトップ用の便利なコマンド・アクセスツール。アプリケーションの起動、ドキュメントの開閉など様々な種類のオブジェクトにアクセスし実行できます。\n\n- launch — Simple command for launching applications from a terminal emulator.\n\n- Launchy — プラグインによって機能を拡張できる人気の高いクロスプラットフォームのアプリケーションランチャー。\n\n- Lighthouse — X 上で動作するシンプルかつスクリプタブルなポップアップダイアログ。\n\n- nwg-drawer — Sway コンポジター用に設計された GTK ベースのアプリケーションドロワー。\n\n- nwg-menu — GTK-based application menu designed for the Sway compositor.\n\n- rofi — superswitcher ベースのポップアップウィンドウスイッチャ。xlib と pango にのみ依存。\n\n- rlaunch — An extremely fast and light-weight dmenu-like application launcher written in Rust\n\n- Synapse — Synapse は Vala で書かれたセマンティックランチャーで、アプリケーションを起動するだけでなく Zeitgeist エンジンを使うことで関連ドキュメントやファイルを探してアクセスすることができます。\n\n- Ulauncher — Modern and shiny launcher that provides fuzzy search, extensions, and themes\n\n- Whippet — コントロールフリークのための、ランチャと xdg-open の代替。名前や mimetype で関連付けられたファイル・URL を開きます。SQLite データベースを使ってアプリケーションと関連付けはカスタマイズ可能。メニューの管理は dmenu を使用。\n\n- wofi — GTK-based popup window switcher for Wayland compositors such as sway. Inspired by rofi.\n\n"
    },
    {
      "title": "アプリケーションメニューエディタ",
      "level": 4,
      "content": "- Alacarte — メインメニューからアプリケーションを追加または削除します。\n\n- AppEditor — アプリケーションメニュー内のアプリケーションエントリを編集します。\n\n- Ezame — デスクトップおよびメニューファイルエディタ。\n\n- KMenuEdit — KDE アプリケーションランチャーのひとつを編集します。\n\n- lxmed — Java で作成されたアプリケーションメニューエディタ。\n\n- MenuLibre — モダンな機能を提供し、クリーンで使いやすいインターフェースを備えた高度なメニューエディタ。\n\n- Meow — Java で作成されたアプリケーションメニューエディタ。\n\n- Mozo — メインメニューに表示されるアプリケーションを変更します。\n\n"
    },
    {
      "title": "壁紙設定",
      "level": 4,
      "content": "See also Wikipedia:Wallpaper (computing).\n\n- bgs — imlib2 ベースの極めて高速で小さな壁紙設定プログラム。\n\n- esetroot — Eterm の root 壁紙設定プログラム、別個にパッケージされています。\n\n- feh — 軽量で強力な画像ビューア。デスクトップの壁紙の管理にも使えます。\n\n- Fondo — Find a variety of the most beautiful wallpapers from Unsplash.com.\n\n- habak — 壁紙を変更するアプリ。\n\n- hsetroot — 背景を作成するツール。\n\n- HydraPaper — GTK utility to set two different backgrounds for each monitor on GNOME.\n\n- LiveWallpaper — Animated 3D wallpapers.\n\n- Nitrogen — X ウィンドウの高速で軽量なデスクトップ背景ブラウザと設定プログラム。\n\n- oguri — An animated wallpaper daemon for Wayland compositors.\n\n- pacwall — A live wallpaper that shows the dependency graph and status of installed packages.\n\n- pybgsetter — 複数のバックエンド (hsetroot, Esetroot, habak, feh) が使ってデスクトップの壁紙を設定。\n\n- pywal — Changes the wallpaper and creates matching colorschemes for various applications (rofi, i3, terminals)\n\n- swaybg — Wallpaper tool for Wayland compositors.\n\n- Variety — Changes the wallpaper on a regular interval using user-specified or automatically downloaded images.\n\n- xli — X 向けの画像表示プログラム。\n\n- xwallpaper — Minimalistic wallpaper setting utility for X.\n\n"
    },
    {
      "title": "仮想デスクトップのページャ",
      "level": 4,
      "content": "Wikipedia:Pager (GUI) も参照してください。\n\n- bbpager — blackbox などのウィンドウマネージャ向けのドッカブルページャ。\n\n- fbpager — Fluxbox の仮想デスクトップページャ。\n\n- IPager — 透過度などを設定できるページャ、元々は Fluxbox のために開発されていました。\n\n- Neap — 素朴で軽量なページャ。パネルの通知エリアで動作します。\n\n- Netwmpager — NetWM/EWMH 互換のページャ。\n\n"
    },
    {
      "title": "デスクトップウィジェット",
      "level": 4,
      "content": "- gDesklets — デスクトップにミニプログラム（デスクレット）を表示するシステム。\n\n- GPhotoFrame — GNOME デスクトップ用のフォトフレームガジェット。\n\n- KRuler — 画面上にピクセルを測定する定規を表示します。kde-graphics の一部。\n\n- Screenlets — 小さなオーナードローンアプリケーションで構成されるウィジェットフレームワーク。\n\n"
    },
    {
      "title": "デスクトップ通知",
      "level": 4,
      "content": "こちらを参照: 通知サーバー\n\n"
    },
    {
      "title": "クリップボードマネージャ",
      "level": 4,
      "content": "こちらを参照 クリップボード#クリップボードマネージャの一覧\n\n"
    },
    {
      "title": "ログアウト UI",
      "level": 4,
      "content": "- clearine — X11 ウィンドウマネージャ用の美しいログアウト UI\n\n- nwg-bar — wlroots ベースのコンポジタ用の設定可能なボタンバー\n\n- oblogout — Openbox のログアウトスクリプト\n\n- wlogout — Wayland 用のログアウトメニュー\n\n"
    },
    {
      "title": "参照",
      "level": 2,
      "content": "- ターミナルアプリケーションのリスト、スクリーンショットとレビュー付き\n- Arch Linux Forums / LnF Awards 2010 - 2010年の最も優れている軽量・高速アプリ。\n- Arch Linux Forums / LnF Awards 2011 - 2011年の最も優れている軽量・高速アプリ。\n- Survey: 2013-2014年の最も人気のあるアプリの投票\n- Survey: 2017年以降で最も人気のあるアプリの投票\n- https://sourceforge.net/ オープンソースソフトウェア\n- https://www.oschina.net/ オープンソースチャイナ\n- https://linuxappfinder.com/\n- http://www.linuxlinks.com/\n- Wikipedia:List of free and open-source software packages\n- https://linuxappfinder.com/alternatives - Windows と OS X ソフトウェアの代替\n- https://alternativeto.net/ - 人気のプログラムの代替を検索\n- http://www.linuxalt.com/ - Windows ソフトウェアと同一の機能を持っている Linux ソフトウェア\n- http://lin-app.com/ - Linux 用の様々な商用アプリケーションのオンライン情報サービス\n- https://www.osalt.com/\n\n"
    }
  ]
}