{
  "title": "List of applications (Español)/Other (Español)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Espa%C3%B1ol)/Other_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\n"
    },
    {
      "title": "Entorno de trabajo",
      "level": 3,
      "content": "La instalación por defecto de Arch provee Bash como intérprete de comandos y no contiene ningún entorno de escritorio, por lo tanto fuerza al usuario a que elija uno por si mismo. La mayoría de instalación Arch trabajan con algún gestor de ventanas de X11 y/o algún entorno de escritorio, aunque siempre hay gente que prefiere hacer su trabajo sobre consola.\n\n"
    },
    {
      "title": "Bootsplash",
      "level": 4,
      "content": "Vea también Wikipedia:es:Bootsplash.\n\n- Plymouth — El nuevo proceso de arranque gráfico de Fedora, que sustituye al envejecido proceso de arranque de Red Hat\n\n"
    },
    {
      "title": "Intérpretes de comandos",
      "level": 4,
      "content": "Vea el artículo principal: Línea de comandos.\n\nVea también Wikipedia:Comparison of command shells.\n\n"
    },
    {
      "title": "Multiplexadores de terminal",
      "level": 4,
      "content": "- abduco — Herramienta con soporte para la desconexión y reconexión de sesiones, lo que permite a un proceso ejecutarse con independencia de la terminal que lo controla.\n\n- dtach — Programa que emula la capacidad de desconexión de GNU Screen.\n\n- GNU Screen — Gestor de ventanas a tamaño completo que multiplexa una terminal física.\n\n- tmux — Multiplexador de terminal con licencia BSD.\n\n"
    },
    {
      "title": "Entornos de escritorio",
      "level": 4,
      "content": "Vea el artículo principal: Entorno de Escritorio#Lista de entornos de escritorio.\n\nVea también Comparación de entornos de escritorio basado en el sistema de ventanas X.\n\n"
    },
    {
      "title": "Gestores de ventanas",
      "level": 4,
      "content": "Vea también #Multiplexadores de terminal, que ofrecen parte de las funcionalidades de gestores de ventanas para la consola.\n\n- dvtm — Gestor de ventanas estilodwm en consola.\n\n- twin — Gestor de ventanas en modo texto.\n\nVéase el artículo Window manager (Español)#Lista de gestores de ventanas..\n\nVéase también Comparación de gestores de ventanas de X (en Inglés).\n\n"
    },
    {
      "title": "Basado en tiles (baldosas)",
      "level": 4,
      "content": "- QuickTile — Alternativa ligera independiente al plugin Grid de Compiz.\n\n- wumwum — El gesto de gestores de ventanas. Puede convertir gestores de ventanas compatibles con emwh en gestores de ventanas basados en tiles conservando todas sus funcionalidades intactas.\n\n"
    },
    {
      "title": "Paginadores virtuales de escritorio",
      "level": 4,
      "content": "Vea también Wikipedia:Pager (GUI).\n\n- bbpager — Paginador acoplable a paneles para blackbox y otros gestores de ventanas.\n\n- fbpager — Paginador de escritorios virtuales para fluxbox.\n\n- IPager — Paginador configurables con transparencia, desarrollado originalmente por Fluxbox.\n\n- Neap — Paginador ligero no intrusivo que se ejecuta en el área de notificación de su panel.\n\n- Netwmpager — Paginador compatible con NetWM/EWMH.\n\n"
    },
    {
      "title": "Aplicaciones de soporte",
      "level": 4,
      "content": "Vea el artículo principal: Gestores de pantalla#Lista de gestores de pantalla.\n\nVea el artículo principal: Xorg#Composite.\n\n- Bmpanel — Panel ligero compatible con NETWM.\n\n- Cairo-Dock — Dock altamente personalizable y lanzador de aplicaciones.\n\n- Docker — Aplicación que actúa como bandeja del sistema.\n\n- fbpanel — Panel de escritorio ligero compatible con NETWM.\n\n- GNOME Panel — Panel incluido en el escritorio GNOME Flashback.\n\n- LXPanel — Panel de escritorio ligero para X11 que forma parte del escritorio LXDE.\n\n- MATE Panel — Panel incluido en el escritorio MATE.\n\n- PerlPanel — El acompañamiento ideal a un gestor de ventanas ligero como OpenBox, o un programa como de renderizado de escritorio como iDesk.\n\n- plank — Dock elegante, simple y limpio del entorno de escritorio pantheon.\n\n- Stalonetray — Bandeja del sistema independiente.\n\n- Tint2 — Panel/barra de tareas desarrollado específicamente para Openbox.\n\n- Trayer — Bandeja del sistema ligera basada en GTK+.\n\n- Xfce Panel — Panel incluido en el escritorio Xfce.\n\nVéase también Wikipedia:Comparison of desktop application launchers.\n\n- ADeskBar — Lanzador de aplicaciones fácil, simple y discreto para Openbox.\n\n- Bashrun2 — Proporciona un enfoque diferente, con solo lo esencial, para ejecutar un diálogo usando una sesión de Bash especializada dentro de una pequeña ventana xterm.\n\n- dmenu — Menú dinámico, ligero y rápido para X que también sirve como lanzador de aplicaciones.\n\n- dmenu-extended — Extensión de dmenu para abrir rápidamente ficheros y carpetas.\n\n- dswitcher — Conmutador de ventanas basado en dmenu que trabaja sin importar el espacio de trabajo o la minimización.\n\n- Fehlstart — Pequeño lanzador de aplicaciones basado en GTK+.\n\n- Gmrun — Lanzador de aplicaciones ligero basado en GTK+, con la capacidad de ejecutar programas dentro de una terminal y otras características útiles.\n\n- GNOME Do — Lanzador de aplicaciones inspirado en Quicksilver con muchos plugins, originalmente desarrollado para el escritorio GNOME.\n\n- j4-dmenu-desktop — Lanzador de aplicaciones dmenu muy rápido.\n\n- Kupfer — Conveniente comando y herramienta de acceso para el escritorio GNOME capaz de lanzar aplicaciones, abrir documentos y acceder a diferentes tipos de objetos y actuar sobre ellos.\n\n- Launchy — Lanzador de aplicaciones multiplataforma muy popular con un sistema basado en plugins usado para aportarle funcionalidades extra.\n\n- rofi — Un conmutador de ventana emergente basado a grandes rasgos en superswitcher, requiriendo tan solo xlib y pango.\n\n- Synapse — Synapse es un lanzador semántico escrito en Vala que puede usar para iniciar aplicaciones así como encontrar documentos y ficheros relevantes empleando el motor de Zeitgeist.\n\n- xfce4-appfinder — un lanzador de aplicaciones muy fácil de usar de Xfce.\n\n- Yeganesh — Wrapper de dmenu ligero que reordena los comandos basándose en su popularidad, escrito en Haskell.\n\nUn puñado de gestores de apagado están disponibles:\n\n- oblogout — Un script con entorno gráfico para el cierre de sesión hecho para Openbox que puede ser usado por otros gestores de ventanas.\n\n"
    },
    {
      "title": "Finanzas",
      "level": 3,
      "content": "Vea también Wikipedia:Comparison of accounting software.\n\n- esniper — Herramienta simple y ligera para pujar en el último segundo en subastas de eBay.\n\n- GnuCash — Aplicación financiera que implementa una sistema de contabilidad por partida doble con características para contabilidad en pequeñas empresas.\n\n- Grisbi — Sistema de finanzas personal que gestiona categorías de gastos y recibos de terceros, así como presupuestos, pago de impuestos, y otra información que lo hace apropiados para asociaciones.\n\n- HomeBank — Gestor financiero fácil de usar que puede analizar sus finanzas personales en detalle usando un conjunto de potentes herramientas de filtrado y gráficos.\n\n- KMyMoney — Gestor financiero personal que opera de forma similar a Microsoft Money. Soporta diferentes tipos de cuentas, categorización de gastos e ingresos, conciliación bancaria de cuentas e importación/exportación al formato de archivo \"QIF\".\n\n- Ledger — Ledger es un potente sistema de contabilidad por partida doble al que se puede acceder desde línea de comandos de UNIX.\n\n- Money Manager EX — Una suite de finanzas personal fácil de usar\n\n- Skrooge — Gestor de finanzas personal para el escritorio KDE.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- Calcurse — Calendario en Ncurses basado en texto y agenda.\n\n- Pal — Calendario muy ligero con interfaces tanto interactiva como no interactiva.\n\n- Remind — Sistema de notificación y calendario altamente sofisticado basado en texto.\n\n- Taskwarrior — Aplicación de listas de tareas con soporte para personalización con lua y mucho más.\n\n- Todo.txt — Pequeño gestor de listas de tareas para la línea de comandos.\n\n- TuDu — Gestor de listas de tareas jerárquico basado en Ncurses con atajos de teclado estilo vim.\n\n- When — Programa de calendario personal simple.\n\n- Wyrd — Interfaz basada en texto para Remind, un programa de calendarios y alarmas usado en ordenadores con sistemas UNIX y Linux.\n\n- DevTodo — Pequeña aplicación en línea de comandos parar mantener listas de tareas.\n\n"
    },
    {
      "title": "Entorno gráfico",
      "level": 4,
      "content": "- Calendar — Programa calendario para GNOME.\n\n- Day Planner — Programa diseñado para ayudarle a planear y gestionar de manera sencilla su tiempo. Puede gestionar citas, cumpleaños y mucho más.\n\n- etm (Event and Task Manager) — Aplicación simple con un enfoque \"¡Terminar las cosas!\" para manejar eventos, tareas, actividades, recordatorios y proyectos.\n\n- GTG (Getting Things GNOME!) — Organizador de listas de tareas escrito para el escritorio GNOME.\n\n- Hamster — Aplicación de seguimiento que le ayuda a controlar cuanto tiempo ha invertido a lo largo del día en actividades que ha decidido hacerles seguimiento.\n\n- KOrganizer — Programa de calendario y agenda, parte de kde-pim.\n\n- Lightning — Extensión para Mozilla Thunderbird que da soporte para calendario y lista de tareas.\n\n- Orage — Calendario y gestor de tareas basado en GTK+ típicamente integrado en Xfce.\n\n- Osmo — Organizador personal basado en GTK+, que incluye calendario, gestor de tareas y módulos de libreta de direcciones.\n\n- Outspline — Esquematizador extensible con características avanzadas de gestión del tiempo,soporte para eventos con complejos esquemas de recurrencia.\n\n- QTodoTxt — Interfaz gráfica multiplataforma para ficheros todo.txt (see project's page)\n\n- Task Coach — Gestor de tareas simple de código abierto para gestionar tareas y listas de tareas \"por-hacer\" personasles.\n\n- Tasque — aplicación de gestión rápida y fácil de tareas escrita en C Sharp.\n\n- Tider — Aplicación de seguimiento ligera (basada en GTK+)\n\n- TkRemind — Programa sofisticado de alarmas y calendario.\n\n"
    },
    {
      "title": "Emuladores",
      "level": 3,
      "content": "Un emulador es un programa que sirve para replicar las funciones de otra plataforma o sistema de manera que permita ejecutar programas y juegos en entornos para los que no fueron programados.\n\nNote: **ilegales** \n\n"
    },
    {
      "title": "Consolas",
      "level": 4,
      "content": "Vea también Emuladores de videojuegos.\n\n- Citra — Emulador de Nintendo 3DS.\n\n- DeSmuME — Emulador de Nintendo DS.\n\n- Dolphin — Emulador de GameCube and Wii muy fiable.\n\n- epsxe — Emulador para la PlayStation para PCs basado en la arquitectura x86.\n\n- FCEUX — Emulador NTSC y PAL de 8 bit de la Nintendo/Famicom que es una evolución de el emulador original FCE Ultra. Es preciso, compatible y mantenido de forma activa.\n\n- gngeo — emulador de NeoGeo mediante línea de comandos.\n\n- higan — Emulador multisistema enfocado en la exactitud, soporte para SNES, NES, GB, GBC, GBA.\n\n- mednafen — Emulador multisistema mediante línea de comandos.\n\n- Mupen64Plus — Emulador altamente compatible de Nintendo 64 con sistema de plugins.\n\n- pSX — Un emulador de PlayStation no basado en plugins con un alto grado de compatibilidad.\n\n- PCSXR — Emulador de PlayStation; bifurcación de Debian del proyecto original PCSX que fue abandonado\n\n- PCSX2 — Emulador de PlayStation 2. Todavía es mantenido y desarrollado. Requiere los archivos BIOS.\n\n- snes-9x — Emulador de la SNES portable y gratuito.\n\n- Visual Boy Advance — Emulador de Game Boy con soporte para Game Boy Advance, Game Boy Color, y Super Game Boy.\n\n- ZSNES — Emulador de Super Nintendo con gran compatibilidad.\n\n"
    },
    {
      "title": "Otras",
      "level": 4,
      "content": "- DOSBox — Emulador de DOS de código abierto cuyo principal propósito es ejecutar juegos de DOS.\n\n- DOSEmu — Emulador de DOS de código abierto.\n\n- MAME — Emulador de varias máquinas Arcade.\n\n- RetroArch — Interfaz para libretro (libraría de emulación. usando versiones modificadas de emuladores como plugins).\n\n- ScummVM — Máquina virtual para aventuras gráficas de la vieja escuela.\n\n- X Neko Project II — Emulador de PC-9801.\n\n"
    },
    {
      "title": "Radio aficionados",
      "level": 3,
      "content": "Vea el artículo principal: Amateur radio#Software.\n\nVea también Wikipedia:List of software-defined radios.\n\n"
    }
  ]
}