{
  "title": "List of Applications/Utilities (日本語)",
  "url": "https://wiki.archlinux.org/title/List_of_Applications/Utilities_(%E6%97%A5%E6%9C%AC%E8%AA%9E)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "インターネット – マルチメディア – ユーティリティ – ドキュメント – セキュリティ – サイエンス – その他\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 ユーティリティ 1.1 Terminal 1.1.1 コマンドシェル 1.1.2 ターミナルエミュレータ 1.1.2.1 VTE ベース 1.1.2.2 KMS ベース 1.1.2.3 フレームバッファベース 1.1.3 ターミナルページャ 1.1.4 ターミナルマルチプレクサ 1.2 ファイル 1.2.1 ファイルマネージャ 1.2.1.1 コンソール 1.2.1.2 グラフィカル 1.2.1.2.1 Twin-panel 1.2.2 ゴミ箱管理 1.2.3 ファイル同期とバックアップ 1.2.4 Archiving and compression tools 1.2.4.1 Archive managers 1.2.5 Comparison, diff, merge 1.2.5.1 Console 1.2.5.2 Graphical 1.2.6 バッチ処理リネームプログラム 1.2.6.1 Console 1.2.6.2 Graphical 1.2.7 ファイル検索 1.2.7.1 Console 1.2.7.2 Graphical 1.2.7.2.1 File indexers 1.2.8 Full-text searching 1.2.8.1 Full-text indexers 1.3 Development 1.3.1 Code forges 1.3.1.1 Code forge clients 1.3.2 バージョン管理システム 1.3.3 ビルド自動化 1.3.4 統合開発環境 1.3.4.1 Java IDEs 1.3.4.2 Python IDEs 1.3.4.3 Rust IDEs 1.3.4.4 Educational IDEs 1.3.5 Debuggers 1.3.6 Lexing and parsing 1.3.7 GUI builders 1.3.8 Hex editors 1.3.9 JSON tools 1.3.10 Literate programming 1.3.11 UML modelers 1.3.12 API documentation browsers 1.3.13 課題追跡システム 1.3.14 コードレビュー 1.3.15 ゲーム開発 1.3.16 Repository managers 1.4 Text input 1.4.1 Character selectors 1.4.2 スクリーンキーボード 1.4.3 キーボードレイアウトの切り替え 1.4.4 Keybinding managers 1.4.5 インプットメソッド 1.5 Disks 1.5.1 パーティション分割ツール 1.5.2 Formatting tools 1.5.3 Cloning tools 1.5.4 マウントツール 1.5.5 ディスク使用量表示プログラム 1.5.5.1 Console 1.5.5.2 Graphical 1.5.6 Disk health status 1.5.7 File recovery tools 1.5.8 Disk cleaning 1.5.8.1 Console 1.5.8.2 Graphical 1.5.9 Disk image writing 1.6 System 1.6.1 タスクマネージャ 1.6.2 システム監視 1.6.3 Hardware sensor monitoring 1.6.4 システム情報ビューア 1.6.4.1 コンソール 1.6.4.2 グラフィカル 1.6.5 System log viewers 1.6.6 Font viewers 1.6.7 Help viewers 1.6.8 Command schedulers 1.6.9 Shutdown timers 1.6.10 時刻同期 1.6.11 Screen management 1.6.12 Backlight management 1.6.13 Color management 1.6.14 Printer management 1.6.15 Bluetooth management 1.6.16 電源管理 1.6.17 System management 1.6.18 Boot management 1.6.19 パッケージ管理 1.6.20 Virtualization 1.6.21 Compatibility layers\n\n- 1.1 Terminal 1.1.1 コマンドシェル 1.1.2 ターミナルエミュレータ 1.1.2.1 VTE ベース 1.1.2.2 KMS ベース 1.1.2.3 フレームバッファベース 1.1.3 ターミナルページャ 1.1.4 ターミナルマルチプレクサ\n- 1.2 ファイル 1.2.1 ファイルマネージャ 1.2.1.1 コンソール 1.2.1.2 グラフィカル 1.2.1.2.1 Twin-panel 1.2.2 ゴミ箱管理 1.2.3 ファイル同期とバックアップ 1.2.4 Archiving and compression tools 1.2.4.1 Archive managers 1.2.5 Comparison, diff, merge 1.2.5.1 Console 1.2.5.2 Graphical 1.2.6 バッチ処理リネームプログラム 1.2.6.1 Console 1.2.6.2 Graphical 1.2.7 ファイル検索 1.2.7.1 Console 1.2.7.2 Graphical 1.2.7.2.1 File indexers 1.2.8 Full-text searching 1.2.8.1 Full-text indexers\n- 1.3 Development 1.3.1 Code forges 1.3.1.1 Code forge clients 1.3.2 バージョン管理システム 1.3.3 ビルド自動化 1.3.4 統合開発環境 1.3.4.1 Java IDEs 1.3.4.2 Python IDEs 1.3.4.3 Rust IDEs 1.3.4.4 Educational IDEs 1.3.5 Debuggers 1.3.6 Lexing and parsing 1.3.7 GUI builders 1.3.8 Hex editors 1.3.9 JSON tools 1.3.10 Literate programming 1.3.11 UML modelers 1.3.12 API documentation browsers 1.3.13 課題追跡システム 1.3.14 コードレビュー 1.3.15 ゲーム開発 1.3.16 Repository managers\n- 1.4 Text input 1.4.1 Character selectors 1.4.2 スクリーンキーボード 1.4.3 キーボードレイアウトの切り替え 1.4.4 Keybinding managers 1.4.5 インプットメソッド\n- 1.5 Disks 1.5.1 パーティション分割ツール 1.5.2 Formatting tools 1.5.3 Cloning tools 1.5.4 マウントツール 1.5.5 ディスク使用量表示プログラム 1.5.5.1 Console 1.5.5.2 Graphical 1.5.6 Disk health status 1.5.7 File recovery tools 1.5.8 Disk cleaning 1.5.8.1 Console 1.5.8.2 Graphical 1.5.9 Disk image writing\n- 1.6 System 1.6.1 タスクマネージャ 1.6.2 システム監視 1.6.3 Hardware sensor monitoring 1.6.4 システム情報ビューア 1.6.4.1 コンソール 1.6.4.2 グラフィカル 1.6.5 System log viewers 1.6.6 Font viewers 1.6.7 Help viewers 1.6.8 Command schedulers 1.6.9 Shutdown timers 1.6.10 時刻同期 1.6.11 Screen management 1.6.12 Backlight management 1.6.13 Color management 1.6.14 Printer management 1.6.15 Bluetooth management 1.6.16 電源管理 1.6.17 System management 1.6.18 Boot management 1.6.19 パッケージ管理 1.6.20 Virtualization 1.6.21 Compatibility layers\n\n- 1.1.1 コマンドシェル\n- 1.1.2 ターミナルエミュレータ 1.1.2.1 VTE ベース 1.1.2.2 KMS ベース 1.1.2.3 フレームバッファベース\n- 1.1.3 ターミナルページャ\n- 1.1.4 ターミナルマルチプレクサ\n\n- 1.1.2.1 VTE ベース\n- 1.1.2.2 KMS ベース\n- 1.1.2.3 フレームバッファベース\n\n- 1.2.1 ファイルマネージャ 1.2.1.1 コンソール 1.2.1.2 グラフィカル 1.2.1.2.1 Twin-panel\n- 1.2.2 ゴミ箱管理\n- 1.2.3 ファイル同期とバックアップ\n- 1.2.4 Archiving and compression tools 1.2.4.1 Archive managers\n- 1.2.5 Comparison, diff, merge 1.2.5.1 Console 1.2.5.2 Graphical\n- 1.2.6 バッチ処理リネームプログラム 1.2.6.1 Console 1.2.6.2 Graphical\n- 1.2.7 ファイル検索 1.2.7.1 Console 1.2.7.2 Graphical 1.2.7.2.1 File indexers\n- 1.2.8 Full-text searching 1.2.8.1 Full-text indexers\n\n- 1.2.1.1 コンソール\n- 1.2.1.2 グラフィカル 1.2.1.2.1 Twin-panel\n\n- 1.2.1.2.1 Twin-panel\n\n- 1.2.4.1 Archive managers\n\n- 1.2.5.1 Console\n- 1.2.5.2 Graphical\n\n- 1.2.6.1 Console\n- 1.2.6.2 Graphical\n\n- 1.2.7.1 Console\n- 1.2.7.2 Graphical 1.2.7.2.1 File indexers\n\n- 1.2.7.2.1 File indexers\n\n- 1.2.8.1 Full-text indexers\n\n- 1.3.1 Code forges 1.3.1.1 Code forge clients\n- 1.3.2 バージョン管理システム\n- 1.3.3 ビルド自動化\n- 1.3.4 統合開発環境 1.3.4.1 Java IDEs 1.3.4.2 Python IDEs 1.3.4.3 Rust IDEs 1.3.4.4 Educational IDEs\n- 1.3.5 Debuggers\n- 1.3.6 Lexing and parsing\n- 1.3.7 GUI builders\n- 1.3.8 Hex editors\n- 1.3.9 JSON tools\n- 1.3.10 Literate programming\n- 1.3.11 UML modelers\n- 1.3.12 API documentation browsers\n- 1.3.13 課題追跡システム\n- 1.3.14 コードレビュー\n- 1.3.15 ゲーム開発\n- 1.3.16 Repository managers\n\n- 1.3.1.1 Code forge clients\n\n- 1.3.4.1 Java IDEs\n- 1.3.4.2 Python IDEs\n- 1.3.4.3 Rust IDEs\n- 1.3.4.4 Educational IDEs\n\n- 1.4.1 Character selectors\n- 1.4.2 スクリーンキーボード\n- 1.4.3 キーボードレイアウトの切り替え\n- 1.4.4 Keybinding managers\n- 1.4.5 インプットメソッド\n\n- 1.5.1 パーティション分割ツール\n- 1.5.2 Formatting tools\n- 1.5.3 Cloning tools\n- 1.5.4 マウントツール\n- 1.5.5 ディスク使用量表示プログラム 1.5.5.1 Console 1.5.5.2 Graphical\n- 1.5.6 Disk health status\n- 1.5.7 File recovery tools\n- 1.5.8 Disk cleaning 1.5.8.1 Console 1.5.8.2 Graphical\n- 1.5.9 Disk image writing\n\n- 1.5.5.1 Console\n- 1.5.5.2 Graphical\n\n- 1.5.8.1 Console\n- 1.5.8.2 Graphical\n\n- 1.6.1 タスクマネージャ\n- 1.6.2 システム監視\n- 1.6.3 Hardware sensor monitoring\n- 1.6.4 システム情報ビューア 1.6.4.1 コンソール 1.6.4.2 グラフィカル\n- 1.6.5 System log viewers\n- 1.6.6 Font viewers\n- 1.6.7 Help viewers\n- 1.6.8 Command schedulers\n- 1.6.9 Shutdown timers\n- 1.6.10 時刻同期\n- 1.6.11 Screen management\n- 1.6.12 Backlight management\n- 1.6.13 Color management\n- 1.6.14 Printer management\n- 1.6.15 Bluetooth management\n- 1.6.16 電源管理\n- 1.6.17 System management\n- 1.6.18 Boot management\n- 1.6.19 パッケージ管理\n- 1.6.20 Virtualization\n- 1.6.21 Compatibility layers\n\n- 1.6.4.1 コンソール\n- 1.6.4.2 グラフィカル\n\n"
    },
    {
      "title": "コマンドシェル",
      "level": 4,
      "content": "次の記事を参照: コマンドラインシェル\n\n次も参照: Wikipedia:Comparison of command shells\n\n"
    },
    {
      "title": "ターミナルエミュレータ",
      "level": 4,
      "content": "ターミナルエミュレータとはターミナルを含むGUIウィンドウを表示する機能を有します。 それらエミュレータのほとんどは Xterm をエミュレートしていて、その Xterm は VT102 をエミュレートしていて、VT102 はタイプライターをエミュレートしています。For further background information, see Wikipedia:Terminal emulator.\n\nFor a comprehensive list, see Wikipedia:List of terminal emulators.\n\n- Alacritty — クロスプラットフォームの GPU アクセラレーションターミナルエミュレータ。\n\n- aterm — 透過をサポートした xterm 代替。2008年から urxvt に取って代わられています。\n\n- cool-retro-term — 昔のブラウン管ディスプレイを模した見た目が良いターミナルエミュレータ。\n\n- CoreTerminal — Terminal emulator based on qtermwidget. Part of C-Suite.\n\n- CuteCom — A graphical serial terminal.\n\n- Deepin Terminal — Terminal emulation application for Deepin desktop.\n\n- Eterm — Enlightenment デスクトップ向けに作られた xterm を代替するターミナルエミュレータ。\n\n- foot — Lightweight terminal emulator for Wayland with sixel support\n\n- Hyper — A terminal with JS/CSS support. Based on the Electron platform.\n\n- Konsole — KDE デスクトップのターミナルエミュレータ。\n\n- kitty — モダンで柔軟な設定が可能な OpenGL ベースのターミナルエミュレータ\n\n- Liri Terminal — Material Design terminal for Liri.\n\n- mlterm — 世界中の様々な文字セットやエンコーディングが使える多言語対応のターミナルエミュレータ。\n\n- moserial — GTK-based serial terminal for the GNOME desktop.\n\n- PuTTY — Highly configurable ssh/telnet/serial console program.\n\n- QTerminal — 軽量な Qt ベースのターミナルエミュレータ。\n\n- rxvt — xterm の人気代替。\n\n- shellinabox — ウェブベースの SSH ターミナル。\n\n- st — X 向けのシンプルなターミナル実装。\n\n- Station — Terminal emulation features different view modes such as split vertically and horizontally, a tabbed interface, and copy and paste commands.\n\n- Terminology — 革新的な機能を備えた Enlightenment プロジェクトチームによるターミナルエミュレータ:ファイルのサムネイルとメディアは、メディアプレーヤーのように再生されます。\n\n- urxvt — (Perl によって) 高い拡張性を持ちユニコードが使える rxvt クローンターミナルエミュレータ。タブ、URL 起動、Quake スタイルのドロップダウンモード、擬似透過をサポート。\n\n- wayst — Simple terminal emulator for Wayland and X11 with OpenGL rendering and minimal dependencies.\n\n- xterm — X Window System 用のシンプルなターミナルエミュレータ。ウィンドウシステムを直接使えないプログラム用に DEC VT102 や Tektronix 4014 互換のターミナルを提供します。\n\n- Yakuake — Konsole ベースのドロップダウンターミナル (Quake スタイル) エミュレータ。\n\n- zutty — A high-end terminal for low-end systems.\n\nVTE (Virtual Terminal Emulator) は初期の GNOME で GNOME Terminal で使うために開発されたウィジェットです。VTE ができてから、似た機能を持つ数多くのターミナルが生まれました。\n\n- Deepin Terminal (GTK version) — Old terminal emulation application for Deepin desktop.\n\n- EasySSH — SSH Connection Manager.\n\n- Germinal — ボーダーレスな最大化されたターミナルを表示する、最小主義のターミナルエミュレータ。デフォルトで tmux セッションにアタッチするので、タブやパネルが使えます。\n\n- GNOME Terminal — GNOME デスクトップのターミナルエミュレータ。ユニコードをサポート。\n\n- Guake — GNOME デスクトップ向けドロップダウンターミナル。\n\n- kermit — A VTE-based terminal emulator that aims to be simple, fast and effective.\n\n- King’s Cross — Simple user-friendly terminal emulator for the GNOME desktop.\n\n- LXTerminal — LXDE 向けのデスクトップ非依存のターミナルエミュレータ。\n\n- MATE terminal — MATE デスクトップの GNOME ターミナル のフォーク。\n\n- Pantheon Terminal — 超軽量・美麗・シンプルなターミナルエミュレータ。デフォルト設定で使うように作られているので設定がほとんどありません。\n\n- ROXTerm — 場所をとらないタブ式ターミナルエミュレータ。\n\n- sakura — GTK と VTE ベースのターミナルエミュレータ。\n\n- Terminator — マルチプルでリサイズ可能な端末パネルをサポートしたターミナルエミュレータ。\n\n- Termite — キーボード中心の VTE ベースのターミナル。タイル型またはタブをサポートしているウィンドウマネージャで使われるように作られています。 Unmaintained - the developers recommend switching to Alacritty.\n\n- Tilda — 設定可能なドロップダウンターミナルエミュレータ。\n\n- Tilix — タイル型ターミナルエミュレータ for GNOME.\n\n- Xfce Terminal — Xfce デスクトップに含まれているターミナルエミュレータ。カラープロンプト、タブをサポート。\n\n以下のターミナルエミュレータは カーネルモード設定を使っており X がなくても起動できます。\n\n- KMSCON — Linux オペレーティングシステム用のターミナルエミュレータを統合した KMS/DRM ベースのシステムコンソール（getty）です。\n\nGNU/Linux では、Linux カーネルの仮想デバイス (fbdev) や X の仮想フレームバッファシステム (xvfb) のことをフレームバッファと呼ぶことがあります。このセクションでは主としてカーネルの仮想デバイス fbdev をベースにするターミナルエミュレータをリストアップしています。\n\n- yaft — X をなくても動かせるシンプルなターミナルエミュレータ。UCS2 文字、壁紙、256color をサポート。\n\n- Fbterm — a fast FrameBuffer based TERMinal emulator for linux\n\n"
    },
    {
      "title": "ターミナルページャ",
      "level": 4,
      "content": "Wikipedia:Terminal pager を参照してください。\n\n- more — シンプルで機能の少ないページャです。util-linuxの一部です。\n\n- less — more に似たプログラムだが、前方・後方両方のスクロールをサポートし、ファイルの部分読み込みもできる。\n\n- most — マルチウィンドウ、左右スクロール、内蔵カラーをサポートしたページャ\n\n- mcview — マウスとカラーに対応したページャ。midnight commander にバンドルされている。\n\n- また、Vim はページャとして使うことができます。\n\n"
    },
    {
      "title": "ターミナルマルチプレクサ",
      "level": 4,
      "content": "Wikipedia:Terminal multiplexer も参照してください。\n\n- abduco — プロセスを制御端末とは別に実行させる、セッションのアタッチとデタッチをサポートするツール。\n\n- byobu — An GPLv3 licensed addon for tmux or screen. It requires a terminal multiplexer installed.\n\n- dtach — Program that emulates the detach feature of GNU Screen.\n\n- dvtm — dwm-style window manager in the console.\n\n- GNU Screen — 物理端末を多重化するフルスクリーンウィンドウマネージャ。\n\n- mtm — Simple terminal multiplexer with just four commands: change focus, split, close, and screen redraw.\n\n- tmux — BSDライセンスのターミナル・マルチプレクサ。\n\n- zellij — Rust で書かれた強化されたターミナル・マルチプレクサ\n\n- wezterm — Rust で実装された GPU アクセラレーションによるクロスプラットフォームなターミナルエミュレータおよびマルチプレクサ。\n\n"
    },
    {
      "title": "ファイルマネージャ",
      "level": 4,
      "content": "See also Wikipedia:Comparison of file managers.\n\n- Clex — フルスクリーンのユーザーインターフェイスを持つファイルマネージャ。\n\n- CliFM — The command line file manager: full-featured, fast, extensible, and lightweight as hell.\n\n- ded — directory editor, file manager similar to Emacs dired\n\n- Dired — Emacs と統合されたディレクトリエディタ。\n\n- joshuto — ranger-like terminal file manager written in Rust.\n\n- Last File Manager — curses インターフェイスを備えた Python 3 で書かれた強力なファイルマネージャ。\n\n- lf — Terminal file manager written in Go using server/client architecture.\n\n- Midnight Commander — コンソールベース、デュアルパネルのファイルマネージャー。\n\n- nffm — \"Nothing Fancy File Manager\"、C で書かれたマウスを使わない ncurses ファイルマネージャ。\n\n- nnn — Tiny, lightning fast, feature-packed file manager.\n\n- fff — A simple file manager written in Bash.\n\n- Pilot — Alpine メールクライアントについてくるファイルマネージャー。\n\n- Ranger — vi バインディング、カスタマイズ性、多機能をもったコンソールベースのファイルマネージャー。\n\n- Vifm — ncurses ベースの 2 パネルファイルマネージャー、vi ライクなキーバインド。\n\n- xplr — A hackable, minimal, fast TUI file explorer.\n\n- Caja — MATE デスクトップのファイルマネージャ。\n\n- CoreFM — Simple lightweight easy to use file manager with many features like image previews, mime-icon support, split view, auto-mounting of removable media, drag-n-drop support etc. Part of C-Suite.\n\n- Deepin File Manager — Deepin 用に開発されたファイルマネージャ。\n\n- Dolphin — KDE デスクトップのファイルマネージャー。\n\n- Gentoo — GTK の軽量ファイルマネージャ。\n\n- GNOME Files — 拡張性のある、カスタムスクリプトをサポートしているヘビー級のファイルマネージャー。GNOME のデフォルト。\n\n- Index — File manager that lets you browse your system files and applications and preview your music, text, image and video files and share them with external applications.\n\n- Konqueror — KDE デスクトップ用ファイルマネージャー。\n\n- Liri Files — The file manager for Liri.\n\n- Nemo — Nemo は Cinnamon デスクトップのファイルマネージャです。A fork of Nautilus.\n\n- Pantheon Files — File browser designed for elementary OS.\n\n- PathFinder — FOX ツールキット によるファイルブラウザ。\n\n- PCManFM — desktop icon や壁紙の管理などの機能をもっている very fast and 軽量ファイルマネージャー。\n\n- PCManFM-Qt — Qt port of PCManFM file manager.\n\n- Peony — File manager for the UKUI desktop.\n\n- qtFM — 小さく軽量な、純粋に Qt ベースの Linux デスクトップ用ファイルマネージャー。\n\n- ROX Filer — 小さく高速なファイルマネージャー。壁紙やパネルの管理なども可能。\n\n- Thunar — 高速に起動し素早くディレクトリを読み込むようにデーモンとして実行できるファイルマネージャー。\n\nNote that some of these twin-panel file managers can also be set to have only one pane.\n\n- Double Commander — 2つのパネルが並ぶファイルマネージャ。Total Commander にインスパイアされており新しいアイデアが実装されています。\n\n- GNOME Commander — GNOME デスクトップのデュアルパネルファイルマネージャ。\n\n- Krusader — KDE デスクトップ用の先進的なツインパネル (Midnight Commander スタイル) ファイルマネージャー。\n\n- muCommander — 軽量でクロスプラットフォームのファイルマネージャ。デュアルパネルのインターフェイスを持ち、Java で書かれています。\n\n- SpaceFM — GTK マルチパネルタブ式ファイルマネージャー。\n\n- Sunflower — 小さく細かく設定可能でプラグインをサポートしたツインパネルの Linux ファイルマネージャー。\n\n- trolCommander — Lightweight, dual-pane file manager written in Java. Fork of muCommander.\n\n- Tux Commander — 人気の Total Commander や Midnight Commander ファイルマネージャーに似た２つのパネルをもったウィンドウ型ファイルマネージャー。\n\n- Worker — 高速、軽量、機能豊富な X Window System 向けファイルマネージャー。\n\n- Xfe — Microsoft Explorer ライクの X 用ファイルマネージャー (X File Explorer)。\n\n"
    },
    {
      "title": "ゴミ箱管理",
      "level": 4,
      "content": "- trash-cli — FreeDesktop.org の Trash 規格 を実装するコマンドラインインターフェイス。\n\n"
    },
    {
      "title": "ファイル同期とバックアップ",
      "level": 4,
      "content": "バックアッププログラム、Wikipedia:Comparison of file synchronization software と Wikipedia:Comparison of backup software も見てください。\n\n- borg — Deduplicating backup program with compression and authenticated encryption that supports backing up over ssh\n\n- Déjà Dup — Simple GTK backup program. It hides the complexity of doing backups the 'right way' (encrypted, off-site, and regular) and uses duplicity as the backend.\n\n- DirSync Pro — Small, but powerful utility for file and folder synchronization.\n\n- Duplicati — Backup client that securely stores encrypted, incremental, compressed backups on cloud storage services and remote file servers.\n\n- duplicity — Simple command-line utility which allows encrypted compressed incremental backup to nearly any storage.\n\n- Duply — Command-line front-end for duplicity which simplifies running it. It manages backup job settings in profiles and allows to batch execute commands.\n\n- FreeFileSync — Folder comparison and synchronization software that creates and manages backup copies of all your important files.\n\n- git-annex — Manage files with git, without checking the file contents into git.\n\n- grsync — GTK+ GUI for rsync to synchronize folders, files and make backups\n\n- hsync — Command line program to sync only those files that have been renamed/moved but otherwise unchanged. It works by issuing simple move operations at the destination without actually transferring the files, and is meant to be used in conjunction with other synchronization programs that lack this capability.\n\n- rclone — Command line program to sync files and directories to and from Amazon S3, Dropbox, Google Drive, Microsoft OneDrive, Yandex Disk and many other cloud storage services as well as between local paths.\n\n- restic — Fast, secure, efficient backup program that supports backing up to many cloud services.\n\n- rsync — File transfer program that uses the \"rsync algorithm\" which provides a very fast method for bringing remote files into sync. It does this by sending just the differences in the files across the link, without requiring that both sets of files are present at one of the ends of the link beforehand. Has multiple frontends available.\n\n- SparkleShare — File sharing and collaboration application written in C#. It can sync with any Git server over SSH.\n\n- Syncthing — Continuous file synchronization program. It synchronizes files between two or more computers in a simple way without advanced configuration.\n\n- Syncany — Cloud storage and filesharing application with a focus on security and abstraction of storage.\n\n- Synkron — Application that helps you keep your files and folders always updated. You can easily sync your documents, music or pictures to have their latest versions everywhere.\n\n- Tarsnap — Secure, efficient proprietary online backup service.\n\n- Timeshift — A system restore tool for Linux.\n\n- Unison — File synchronization tool that allows two replicas of a collection of files and directories to be stored on different hosts (or different disks on the same host), modified separately, and then brought up to date by propagating the changes in each replica to the other.\n\n"
    },
    {
      "title": "Archiving and compression tools",
      "level": 4,
      "content": "For archiving and compression command-line tools, see アーカイブと圧縮.\n\n- 360zip — A proprietary archiving tool.\n\n- Ark — KDE デスクトップのアーカイブツール。\n\n- Arqiver — Simple Qt archive manager based on libarchive.\n\n- CoreArchiver — Simple file compressing/extracting utility based on Qt and libarchive-qt. Part of C-Suite.\n\n- Deepin Archive Manager — Fast and lightweight application for creating and extracting archives.\n\n- Engrampa — MATE のアーカイブマネージャ。\n\n- GNOME Archive Manager — GNOME のデフォルト圧縮ファイルマネージャ (previously File Roller).\n\n- LXQt File Archiver — Simple and lightweight desktop-agnostic Qt file archiver.\n\n- p7zip-gui — The GUI belonging to the p7zip software.\n\n- PeaZip — オープンソースのファイル・アーカイブマネージャ。\n\n- Xarchiver — GTK で作られた軽量なデスクトップ非依存のアーカイブマネージャ。\n\n"
    },
    {
      "title": "Comparison, diff, merge",
      "level": 4,
      "content": "See also Wikipedia:Comparison of file comparison tools.\n\nFor managing pacnew/pacsave files, specialised tools exist. See Pacnew と Pacsave ファイル#.pac* ファイルの管理.\n\nSee diff(1) from diffutils and its alternatives.\n\n- colordiff — 'diff' の Perl スクリプトラッパー。同じ出力にシンタックスハイライトを追加。\n\n- diffr — A Rust utility to pretty-print diff with highlighting at word-level for ease of review.\n\n- ydiff — A Python wrapper to get highlighted diff output from stdin or VCS-tracked file/dirs, in either unfied or side-by-side view.\n\n- delta — A diff viewer written in Rust with syntax highlighting.\n\n- diff-so-fancy — A diff output decorator. It does not calculate the diff, it only decorates it.\n\n- DiffPDF — Compare the text or the visual appearance of each page in two PDF files.\n\n- Diffuse — Python で書かれた小さくてシンプルなテキストマージツール。\n\n- KDiff3 — KDE デスクトップのファイルとディレクトリの比較・マージツール。\n\n- Kompare — ソースファイルの差を回覧・マージするための GUI フロントエンドプログラム。様々な diff フォーマットをサポートし、表示する情報レベルをカスタマイズするための多くのオプションがある。\n\n- Meld — ビジュアル比較・マージツール。ファイル・ディレクトリ・プロジェクトのバージョンの比較が可能。\n\n- xxdiff — ファイルやディレクトリの差異を表示するグラフィカルブラウザ。\n\nVim と Emacs にはそれぞれ vimdiff と ediff というマージ機能があります。\n\n"
    },
    {
      "title": "バッチ処理リネームプログラム",
      "level": 4,
      "content": "See rename(1) from util-linux.\n\n- edir — Rename, delete, and copy files and directories using your editor (enhanced vidir).\n\n- f2 — Cross-platform command-line tool for batch renaming files and directories quickly and safely, can also rename files based on audio tags.\n\n- rename.pl — perl regex ベースのバッチリネーマー。\n\n- vidir — Rename and delete files and directories using your editor.\n\n- Caja-Rename — Batch renaming extension for Caja.\n\n- CoreRenamer — Simple lightweight batch file renamer application. Part of C-Suite.\n\n- GPRename — ファイルとディレクトリの名前を変える GTK バッチ処理プログラム。\n\n- KRename — KDE デスクトップ向けのとてもパワフルなバッチ処理リネームプログラム。\n\n- metamorphose2 — wxPython ベースのバッチリネーマーで、正規表現や、メタデータによるマルチメディアファイルの名前変更などをサポートしています。\n\n- Thunar Bulk Rename — Change the name of multiple files at once using some criterion that applies to at least one of the files. Run with thunar -B.\n\n"
    },
    {
      "title": "ファイル検索",
      "level": 4,
      "content": "This section lists utilities for file searching based on filename, file path or metadata. For full-text searching, see the next section.\n\nSee also Wikipedia:List of search engines#Desktop search engines.\n\nSee find(1) from findutils and its alternatives.\n\n- Catfish — 多目的のファイル検索ツール by Xfce, can be powered by find, locate and Zeitgeist.\n\n- CoreHunt — Easy to use fast file searching tool with categorized search and search history. Part of C-Suite.\n\n- GNOME Search Tool — ファイルを検索する Gnome ユーティリティ, depends on GNOME Files.\n\n- KFind — Search tool for KDE to find files by name, type or content. Has internal search and supports locate.\n\n- MATE Search Tool — MATE utility to search for files.\n\n- regexxer — Interactive search and replace tool featuring Perl-style regular expressions.\n\n- Searchmonkey — 正規表現が使えるパワフルな GUI 検索ユーティリティ。\n\nThese programs index your files to allow for quick searching.\n\n- Basenji — Volume indexing tool designed for easy and fast indexing of CD/DVD and other type of volume collections.\n\n- fsearch — A fast file search utility for Unix-like systems based on GTK 3.\n\n"
    },
    {
      "title": "Full-text searching",
      "level": 4,
      "content": "See grep(1) from grep and its alternatives, which provide non-indexed full-text search.\n\n- Baloo — KDE のファイルインデックス作成・検索ソリューション, has a CLI and is used by KRunner.\n\n- DocFetcher — Graphical Java デスクトップ検索アプリケーション。\n\n- Recoll — Xapian がバックエンドのフルテキスト検索ツール, has CLI and GUI.\n\n- Tracker — オールインワンのインデックス作成・検索ツールとメタデータのデータベース, used by GNOME Documents, Music, Photos and Videos.\n\n- Zeitgeist — Event aggregation framework for the user's activities and notifications (files opened, websites visited, conversations had, etc.), has several third-party front-ends.\n\n"
    },
    {
      "title": "Code forges",
      "level": 4,
      "content": "- GitLab — Project management and code hosting application.\n\n- Gitea — Painless self-hosted Git service. Community managed fork of Gogs.\n\n- git-open — Open a repo website (GitHub, GitLab, Bitbucket) in your browser\n\n- github-cli — GitHub's official command line tool\n\n- hub — Command line interface for GitHub\n\n- lab — A hub-like tool for GitLab\n\n- snippet — A terminal based interface to create a new GitLab snippet\n\n"
    },
    {
      "title": "バージョン管理システム",
      "level": 4,
      "content": "Wikipedia:Comparison of revision control software も参照してください。\n\n- Bazaar — Distributed version control system that helps you track project history over time and to collaborate easily with others.\n\n- CVS — Concurrent Versions System, a client-server revision control system.\n\n- Darcs — Distributed revision control system that was designed to replace traditional, centralized source control systems such as CVS and Subversion.\n\n- Fossil — Distributed VCS with bug tracking, wiki, forum, and technotes.\n\n- Git — Distributed revision control and source code management system with an emphasis on speed.\n\n- Mercurial — Distributed version control system written in Python and similar in many ways to Git.\n\n- Subversion — Full-featured centralized version control system originally designed to be a better CVS.\n\n"
    },
    {
      "title": "ビルド自動化",
      "level": 4,
      "content": "See also Wikipedia:List of build automation software.\n\n- Apache Ant — Java ライブラリとコマンドラインツール。相互に依存するターゲットや拡張ポイントにあわせてビルドファイルに書かれている手順を実行します。\n\n- Apache Maven — Build automation tool used primarily for Java.\n\n- CMake — ソフトウェアをビルド、テスト、パッケージ化するためのツール群。\n\n- GNU make — プログラムのグループを管理するための、GNU make ユーティリティ。\n\n- Meson — Extremely fast and user friendly build system.\n\n- Gradle — JVM の強力なビルドシステム。\n\n- Phing — あらゆる作業を自動化する PHP プログラム。\n\n"
    },
    {
      "title": "統合開発環境",
      "level": 4,
      "content": "See also Wikipedia:Comparison of integrated development environments.\n\nFor PHP specific list, see PHP#Development tools.\n\n- Android Studio — The official Android development environment based on IntelliJ IDEA.\n\n- Anjuta — プロジェクト管理、アプリケーションウィザード、インタラクティブデバッガ、ソースエディタ、バージョンコントロールなど多数のツールを備えた多目的 IDE。\n\n- Aptana Studio — ウェブ開発を対象にしている Eclipse ベースの IDE。HTML, CSS, Javascript, Ruby on Rails, PHP, Adobe AIR などをサポート。\n\n- Bluefish — Powerful editor targeted towards programmers and webdevelopers, with many options to write websites, scripts and programming code. It supports many programming and markup languages.\n\n- Code::Blocks — C, C++ and Fortran IDE built to meet the most demanding needs of its users. It is designed to be very extensible and fully configurable.\n\n- CLion — A cross-platform IDE for C and C++.\n\n- CodeLite — C++ で書かれた C/C++/PHP/Node.js のオープンソースなクロスプラットフォーム IDE。\n\n- Cloud9 — ブラウザやクラウドで動く最新の IDE、どこでも・いつでもアプリケーションを実行・デバッグ・開発できます。\n\n- Eclipse — IDE for Java, C/C++, PHP, Perl and Python with subversion support and task management.\n\n- Eric — PyQt5 によるフル機能の Python / Ruby IDE。\n\n- Gambas — Basic インタプリタをベースにオブジェクト指向の拡張を加えたフリーの開発環境。\n\n- Geany — Small and lightweight IDE with many supported many programming and markup languages including C, Java, PHP, HTML, Python, Perl, Pascal.\n\n- GNOME Builder — Tool to write and contribute to great GNOME-based applications.\n\n- KDevelop — 機能豊富なプラグインを使うことができる C/C++ などのプログラミング言語の IDE。\n\n- Komodo Edit — フリーの、多言語エディタ。\n\n- Lazarus — Delphi (Object Pascal) compatible IDE for Rapid Application Development. It has variety of components ready for use and a graphical form designer to easily create complex graphical user interfaces.\n\n- LiteIDE — シンプルな Go の IDE。\n\n- MPLAB — Microchip PIC と dsPIC 開発のための IDE。\n\n- Netbeans — Java, JavaScript, PHP, Python, Ruby, Groovy, C, C++, Scala, Clojure などの言語で開発するための統合開発環境 (IDE)。\n\n- PhpStorm — JetBrains PhpStorm は PHP 向けの商用のクロスプラットフォーム IDE です。JetBrains の IntelliJ IDEA プラットフォームの上で動作し、providing an editor for PHP, HTML and JavaScript with PHP や JavaScript コードをオンザフライでコード解析したり、エラー補正や自動リファクタリングが行えるエディタを提供します。\n\n- Qt Creator — Qt での開発に焦点をおいた軽量なクロスプラットフォームの C++ 統合開発環境。\n\n- Theia — Eclipse Theia is a free and open-source IDE for desktop and web applications. It is implemented in TypeScript, is based on Visual Studio Code, and emphasizes extensibility. It can be run as a web or a desktop application.\n\n- Visual Studio Code — Visual Studio Code is a cross-platform, free and open-source text editor developed by Microsoft, written in JavaScript and TypeScript. It supports a variety of languages thanks to its extensions.\n\n- VSCodium — Free/Libre Open Source Software Binaries of VSCode.\n\n- BlueJ — 教育や初心者が主に使うことを目的とした完全な機能を備えた Java IDE。\n\n- IntelliJ IDEA — 高度なリファクタリング機能を持つ Java, Groovy などのプログラミング言語向けの IDE。\n\n- Ninja-IDE — IDE for Python development.\n\n- PyCharm — Python でのプログラミングに使われる IDE。コード解析、デバッグ、ユニットテスト、バージョンコントロール、Django によるウェブ開発をサポート。\n\n- Spyder — MATLAB のような機能を提供する科学用 Python 開発環境。\n\n- Thonny — 初心者向けの Python IDE。\n\n- WingIDE — Proprietary Python development environment. It is fully featured and meant for professional use.\n\nSee also: [1]\n\n- IntelliJ IDEA — IDE for Java, Groovy and other programming languages with advanced refactoring features.\n\n- Visual Studio Code — Visual Studio Code is a cross-platform, free and open-source text editor developed by Microsoft, written in JavaScript and TypeScript. It supports a variety of languages thanks to its extensions.\n\n- VSCodium — Free/Libre Open Source Software Binaries of VSCode.\n\n- Etoys — Educational tool and media-rich authoring environment for teaching children.\n\n- KTurtle — Educational programming environment that aims to make learning how to program as easily as possible. Part of kde-education.\n\n- Processing — Playground for teaching non-programmers the fundamentals of computer programming in a visual context.\n\n- Scratch — インタラクティブなプロジェクトやシンプルなスプライトベースのゲームを作成できる、教育とエンターテイメント用の programming system and content development tool。イベント駆動型プログラミングのエントリのように初心者 (子供など) を主に対象としています。\n\n"
    },
    {
      "title": "Debuggers",
      "level": 4,
      "content": "- Accerciser — Interactive Python accessibility explorer. It uses the AT-SPI library to inspect, examine, and interact with widgets, allowing you to check if an application is providing correct information to assistive technologies and automated testing frameworks.\n\n- Bustle — Draws sequence diagrams of D-Bus activity. It shows signal emissions, method calls and their corresponding returns, with time stamps for each individual event and the duration of each method call.\n\n- Data Display Debugger — Graphical front-end for command-line debuggers such as GDB.\n\n- Desed — TUI-based debugger for sed. Features variable and regex preview, setting breakpoints and stepping back and forth.\n\n- D-Feet — Easy to use D-Bus debugger to inspect D-Bus interfaces of running programs and invoke methods on those interfaces.\n\n- GammaRay — Qt-application inspection and manipulation tool.\n\n- KCachegrind — Profile data visualization tool, used to determine the most time consuming execution parts of program.\n\n- KDbg — Graphical user interface to GDB, the GNU debugger. It provides an intuitive interface for setting breakpoints, inspecting variables, and stepping through code.\n\n- Massif-Visualizer — Visualizer for Valgrind Massif data files.\n\n- Nemiver — Easy to use standalone C/C++ debugger (GDB front-end) that integrates well in the GNOME environment.\n\n- Qt QDbusViewer — Tool to introspect D-Bus objects and messages.\n\n- scanmem — Debugging utility designed to isolate the address of an arbitrary variable in an executing process.\n\n- Sysprof — Profiling tool that helps in finding the functions in which a program uses most of its time.\n\n"
    },
    {
      "title": "Lexing and parsing",
      "level": 4,
      "content": "Lex and Yacc are part of POSIX.\n\n- flex — A tool for generating text-scanning programs, alternative to Lex.\n\n- Berkeley Yacc — Berkeley reimplementation of the Unix parser generator Yacc.\n\n- GNU Bison — The GNU general-purpose parser generator, alternative to byacc.\n\nAnd then there are also:\n\n- ANTLR — Parser generator, written in Java, for parsing structured text or binary files.\n\n- LPeg — Pattern-matching library, based on PEGs, for Lua.\n\n- peg/leg — Recursive-descent parser generators for C.\n\n- Ragel — Compiles finite state machines from regular languages into executable C, C++, Objective-C, or D code.\n\n"
    },
    {
      "title": "GUI builders",
      "level": 4,
      "content": "- FLUID — FLTK GUI designer.\n\n- Glade — Create or open user interface designs for GTK applications.\n\n- KUIViewer — Quick viewer for Qt Designer UI File.\n\n- Qt Designer — Tool for designing and building graphical user interfaces (GUIs) with Qt Widgets.\n\n"
    },
    {
      "title": "Hex editors",
      "level": 4,
      "content": "See also Wikipedia:Comparison of hex editors.\n\n- Bless — High quality, full featured hex editor.\n\n- GHex — Hex editor for GNOME, which allows the user to load data from any file, view and edit it in either hex or ascii.\n\n- hyx — Minimalistic but powerful console hex editor.\n\n- Reverse Engineer's Hex Editor — Hex editor with features for analyzing and annotating binary file formats\n\n- Okteta — KDE hex editor for viewing and editing the raw data of files.\n\n"
    },
    {
      "title": "JSON tools",
      "level": 4,
      "content": "- gron — gron transforms JSON into discrete assignments to make it easier to grep.\n\n- jid — JSON incremental digger\n\n- jo — A command to create JSON.\n\n- jq — Command-line JSON processor\n\n- jshon — A JSON parser for the shell.\n\n- the Elvish shell has built-in support for JSON\n\n"
    },
    {
      "title": "Literate programming",
      "level": 4,
      "content": "See also Wikipedia:Literate programming.\n\n- Noweb — A Simple, Extensible Tool for Literate Programming build against ICON libs and texlive\n\n- nuweb — A Simple Literate Programming Tool\n\n"
    },
    {
      "title": "UML modelers",
      "level": 4,
      "content": "See also Wikipedia:List of Unified Modeling Language tools.\n\n- ArgoUML — UML modeling tool with support for all standard UML 1.4 diagrams.\n\n- Eclipse Modeling Tools — Tools and runtimes for building model-based applications.\n\n- Gaphor — Simple modeling tool for UML.\n\n- Modelio — Modeling environment supporting the main standards: UML, BPMN, MDA, SysML.\n\n- Papyrus — Model-based engineering tool based on Eclipse.\n\n- PlantUML — Tool to create UML diagrams from a plain text language.\n\n- PlantUML QEditor — PlantUML editor written in Qt.\n\n- Umbrello — Unified Modelling Language (UML) diagram program based on KDE Technology.\n\n- UML Designer — Graphical tool based on Eclipse to edit and visualize UML models.\n\n- UMLet — UML tool with a simple user interface: draw UML diagrams fast, build sequence and activity diagrams from plain text, export diagrams to eps, pdf, jpg, svg, and clipboard, share diagrams using Eclipse, and create new, custom UML elements.\n\n- UML/INTERLIS-editor — Facilitate the application of the model driven approach to a greater number of users.\n\n- Violet — Very easy to learn and use UML editor that draws nice-looking diagrams.\n\n"
    },
    {
      "title": "API documentation browsers",
      "level": 4,
      "content": "- Devhelp — Developer tool for browsing and searching API documentation.\n\n- Doc Browser — API documentation browser with support for DevDocs and Hoogle.\n\n- Qt Assistant — Tool for viewing on-line documentation in Qt help file format.\n\n- quickDocs — Fast developer docs reader for reading Valadoc and DevDocs.\n\n- Zeal — Offline API documentation browser for software developers.\n\n"
    },
    {
      "title": "課題追跡システム",
      "level": 4,
      "content": "- Bugzilla — Mozilla によるバグトラッカー。\n\n- Flyspray — PHP で書かれた軽量なウェブベースのバグ追跡システム\n\n- MantisBT — ウェブベースの課題追跡システム\n\n- Redmine — 柔軟なプロジェクト管理のためのウェブアプリケーション。Ruby on Rails を使用して書かれており、クロスプラットフォームおよびクロスデータベース対応。\n\n- Request Tracker (RT) — オープンソースの代表的な課題追跡システム。\n\n- Trac — Apache と Subversion を使用する統合 SCM & プロジェクト管理システム。\n\nen:Git server#Advanced web applications を参照。\n\n"
    },
    {
      "title": "コードレビュー",
      "level": 4,
      "content": "- Gerrit — Git バージョン管理システム上に構築されたウェブベースのコードレビュー ツール\n\n- GitLab もコードレビューをサポートしています。\n\nWikipedia:List of tools for code review も参照してください。\n\n"
    },
    {
      "title": "ゲーム開発",
      "level": 4,
      "content": "Wikipedia:List of game engines も参照してください。\n\n- GDevelop — プログラミングスキルが不要で、誰でも使用できるゲーム作成ツール。\n\n- en:Godot — 高度で機能満載のマルチプラットフォーム対応の 2D および 3D ゲームエンジン。Godot の独自のアプローチを使用して、簡単にゲームを作成できます。\n\n- LibreSprite — アニメーションスプライトエディタおよびピクセルアートツールで、ビデオゲーム用の 2D アニメーションを作成できます。\n\n- Pixelorama — Orama Interactive によって Godot Engine と GDScript を使用して作成された、アニメーション対応の 2D スプライトエディタ。\n\n- Tiled — 強力なタイルマップ編集機能を備えた汎用の 2D レベルエディタ。使いやすさを重視して設計されており、多くのタイプのゲームに適しています。\n\n- Unity — Unity は、マルチプラットフォームの 3D および 2D ゲームを作成するための柔軟で強力な開発プラットフォームです。プロプライエタリですが、特定の使用例には無料バージョンが利用可能です（詳細はこちらをご覧ください）。\n\n"
    },
    {
      "title": "Repository managers",
      "level": 4,
      "content": "Table content:\nこの記事あるいはセクションで使われている用語や表現には問題が存在します。 議論: Redirects to company blogs should not be here. (議論: トーク:アプリケーション一覧/ユーティリティ#)\n\n- Nexus 2 — Nexus 2 Repository Manager (OSS)\n\n- Nexus 3 — Nexus 3 Repository OSS\n\n- Artifactory — Artifactory is an advanced Binary Repository Manager for use by build tools, dependency management tools and build servers\n\n"
    },
    {
      "title": "Character selectors",
      "level": 4,
      "content": "- GNOME Characters — Character map application for GNOME.\n\n- gucharmap — GTK 3 character selector for GNOME.\n\n- KCharSelect — Tool to select special characters from all installed fonts and copy them into the clipboard. Part of kde-utilities.\n\n"
    },
    {
      "title": "スクリーンキーボード",
      "level": 4,
      "content": "- CellWriter — Grid-entry handwriting recognition input panel.\n\n- CoreKeyboard — Simple X11 based Qt virtual keyboard with word suggestions. Part of C-Suite.\n\n- eekboard — Easy to use virtual keyboard toolkit.\n\n- Florence — Extensible scalable on-screen virtual keyboard for GNOME that stays out of your way when not needed.\n\n- Onboard — Onscreen keyboard useful for tablet PC users and for mobility impaired users.\n\n- qtvkbd — Virtual keyboard written in Qt, a fork of kvkbd.\n\n- QVKbd — Virtual keyboard written in Qt.\n\n- Squeekboard — GTK 3 virtual keyboard for Wayland, written in Rust/C.\n\n- theShell On Screen Keyboard — Touchscreen keyboard for theShell.\n\n- xvkbd — Virtual keyboard for X window system.\n\n"
    },
    {
      "title": "キーボードレイアウトの切り替え",
      "level": 4,
      "content": "- fbxkb — NETWM 互換のキーボードインジケータ・スイッチャー。システム領域にある現在のキーボードのフラグを表示し、他のキーボードに切り替えることが可能です。\n\n- xxkb — 軽量なキーボードレイアウトインジケータ・スイッチャー。\n\n- gxkb — X11 keyboard layout indicator and switcher.\n\n- qxkb — Qt で書かれているキーボード切り替えアプリケーション。\n\n- X Neural Switcher — テキストアナライザ。入力の言語を検出して必要に応じてキーボードレイアウトを修正します。\n\n"
    },
    {
      "title": "Keybinding managers",
      "level": 4,
      "content": "See キーボードショートカット#Xorg.\n\n"
    },
    {
      "title": "インプットメソッド",
      "level": 4,
      "content": "See the main article: インプットメソッド.\n\n"
    },
    {
      "title": "パーティション分割ツール",
      "level": 4,
      "content": "See パーティショニング#パーティショニングツール.\n\n"
    },
    {
      "title": "Formatting tools",
      "level": 4,
      "content": "See ファイルシステム#ファイルシステムのタイプ.\n\n"
    },
    {
      "title": "Cloning tools",
      "level": 4,
      "content": "See ディスクのクローン#ディスククローンソフトウェア.\n\n"
    },
    {
      "title": "マウントツール",
      "level": 4,
      "content": "See also udisks#Mount helpers.\n\n- 9mount — 9p ファイルシステムをマウント。\n\n- cryptmount — 暗号化されたファイルシステムを通常ユーザーでマウント。\n\n- KDiskFree — Displays information about hard disks and other storage devices. It also allows to mount and unmount drives and view them in a file manager.\n\n- ldm — udev を使ってドライブを自動的にマウントする軽量なデーモン。\n\n- pmount — 通常ユーザーでソースを自動的に作成する /media/source_name にマウント。\n\n- pmount-safe-removal — 安全に取り除けるように通常ユーザーでリムーバブルデバイスをマウント。\n\n- udevil — 通常ユーザーでリムーバブルデバイスをマウント。デバイス情報を表示して、デバイスの変更を監視。udev と glib にだけ依存。\n\n- ws — Windows ネットワーク共有をマウント (CIFS と VFS)。\n\n- zulucrypt — 暗号化ボリュームを作成・管理・マウントする cryptsetup の GUI フロントエンド。EncFS もサポート。\n\n"
    },
    {
      "title": "ディスク使用量表示プログラム",
      "level": 4,
      "content": "- duc — ディスク使用量を調査するためのライブラリとツールスイート。\n\n- gdu — Disk usage analyzer with console interface written in Go.\n\n- gt5 — 差分が表示できる \"du-browser\"。\n\n- ncdu — シンプルな ncurses ディスク使用量アナライザ。\n\n- Filelight — コンピュータのディスク使用量を、リング状のマップに視覚化するディスク使用量アナライザ。\n\n- GNOME Disk Usage Analyzer — GNOME デスクトップ用のディスク使用量アナライザ to check folder sizes and available disk space.\n\n- Graphical Disk Map — ファイルやディレクトリサイズにあわせて長方形を表示するディスク使用量アナライザ。\n\n- fsview (part of Konqueror) — KDE based disk usage analyzer that draws a map of rectangles sized according to file or dir sizes.\n\n- MATE Disk Usage Analyzer — Disk usage analyzing tool for MATE Desktop.\n\n- qdirstat — Qt-based directory statistics (KDirStat/K4DirStat without any KDE - from the original KDirStat author).\n\n"
    },
    {
      "title": "Disk health status",
      "level": 4,
      "content": "See S.M.A.R.T.#GUI applications.\n\n"
    },
    {
      "title": "File recovery tools",
      "level": 4,
      "content": "See ファイルリカバリ#List of utilities.\n\n"
    },
    {
      "title": "Disk cleaning",
      "level": 4,
      "content": "- duff — A command-line utility for quickly finding duplicates in a given set of files.\n\n- fclones — Very fast duplicate file Finder written in rust.\n\n- fdupes — Program for identifying or deleting duplicate files residing within specified directories.\n\n- jdupes — Identify and take actions upon duplicate files.\n\n- rdfind — Command line tool that finds duplicate files. It compares files based on their content.\n\n- rmlint — 重複するファイルを素早く見つけ出すツール (任意で削除も可能)。\n\n- BleachBit — ディスク容量を開けてプライバシーを守ります。キャッシュやクッキー、インターネット履歴、一時ファイル、ログなどを消去。\n\n- dupeGuru — GUI tool to find duplicate files in a system.\n\n- FSlint — A utility to find and clean various forms of lint on a filesystem.\n\n- GConf Cleaner — gconf データベースに居座っている不必要な gconf キーを消去。\n\n- Shredder — Graphical user interface for rmlint.\n\n- Sweeper — System cleaning utility for KDE.\n\n"
    },
    {
      "title": "Disk image writing",
      "level": 4,
      "content": "See also Wikipedia:List of tools to create Live USB systems.\n\n- Deepin Boot Maker — Tool to make boot disk for Deepin OS.\n\n- Fedora Media Writer — Tool that helps users put Fedora images on their portable drives such as flash disks.\n\n- GNOME MultiWriter — Write an ISO file to multiple USB devices at once.\n\n- Image Burner — Simple imageburner designed for elementary OS.\n\n- ISOImageWriter — Tool to write a .iso file to a USB disk.\n\n- LiveUSB Install — Install various Linux distributions and operating systems on removable flash drive or external disk drive.\n\n- MultiBootUSB — Install multiple live distributions on a USB disk non-destructively and has an option to uninstall them.\n\n- MultiSystem — GUI tool to create a USB system that can boot multiple distributions.\n\n- Popsicle — Utility for flashing multiple USB devices in parallel, written in Rust.\n\n- SUSE Studio ImageWriter — Utility for writing raw disk images & hybrid isos to USB keys.\n\n- UNetbootin — Installs Linux/BSD distributions to a partition or USB drive.\n\n- Usbimager — Minimal GUI application to write compressed disk images to USB drives.\n\n- WoeUSB — Simple tool to create USB stick windows installer from an ISO image or a real DVD. (Fork of WinUSB).\n\n- windows2usb — Windows 7/8/8.1/10 ISO to Flash Drive burning utility for Linux with MBR/GPT, BIOS/UEFI, FAT32/NTFS support\n\n"
    },
    {
      "title": "タスクマネージャ",
      "level": 4,
      "content": "- CoreStats — Simple lightweight system resource viewer to monitor the CPU, RAM, Network and Disk IO statistics. Part of C-Suite.\n\n- Deepin System Monitor — Monitor system process status for Deepin desktop.\n\n- GNOME System Monitor — GNOME のシステムモニタ to view and manage system resources.\n\n- GNOME Usage — View information about use of system resources, like memory and disk space.\n\n- htop — シンプルな、ncurses 対話式プロセスビューア。\n\n- bpytop — Htop but more lightweight with more features.\n\n- btop — Rewrite of bpytop in C++\n\n- KSysGuard — KDE のタスクマネージャ・パフォーマンスモニタ。\n\n- Linux Process Explorer — Linux 向けのグラフィカルプロセスエクスプローラー。\n\n- LXTask — LXDE の軽量なタスクマネージャー。\n\n- qps — Lightweight task manager for LXQt.\n\n- MATE System Monitor — MATE のシステムモニター。\n\n- Stacer — System optimizer and application monitor that helps users to manage entire system with different aspects, its an all in one system utility.\n\n- Task Manager — Xfce の GTK2/GTK3 プロセス管理アプリケーション with basic system resource monitor\n\n"
    },
    {
      "title": "システム監視",
      "level": 4,
      "content": "カテゴリ:状態監視と通知も参照してください。\n\n- Conky — 軽量でスクリプト式のシステムモニタ。\n\n- Collectd — rrdtool ベースのシンプルで拡張性のあるシステム監視デーモン。消費リソースが少なくて、スタンドアロンに、またはサーバー・クライアントアプリケーションとして設定できます。\n\n- collectl — 軽量なパフォーマンス監視ツール。対話式にレポートを作成したりディスクにログを出力できます。CPU やディスク、InfiniBand、Lustre、メモリ、ネットワーク、NFS、プロセス, quadrics, slabs などの統計情報を読みやすいフォーマットでまとめます。\n\n- dstat — 多目的リソース統計ツール。\n\n- Fsniper — Daemon to run scripts based on changes in files monitored by inotify.\n\n- GKrellM — シンプルで柔軟性のある GTK 向けシステムモニタパッケージ。多くのプラグインが含まれている。\n\n- glances — Python 製の CLI curses ベース監視ツール。\n\n- kmon — Linux kernel manager and activity monitor.\n\n- Nagstamon — Status monitor that connects to multiple Nagios, Icinga, Opsview, Centreon, Op5 Monitor/Ninja, Checkmk and Thruk monitoring servers.\n\n- netdata — ウェブベースのリアルタイムパフォーマンスモニター。\n\n- Telegraf — Agent written in Go for collecting, processing, aggregating, and writing metrics.\n\n- Paramano — 軽量なバッテリモニター、CPU 周波数スケーラ。trayfreq のフォーク。\n\n- Sysstat — リソース管理ツールのコレクション: iostat, isag, mpstat, pidstat, sadf, sar。\n\n- xosview — SGI IRIX の gr_osview に似ているシステムモニター。\n\n- zps — A small utility for listing and reaping zombie processes on GNU/Linux.\n\n"
    },
    {
      "title": "Hardware sensor monitoring",
      "level": 4,
      "content": "See lm_sensors#Graphical front-ends.\n\n"
    },
    {
      "title": "システム情報ビューア",
      "level": 4,
      "content": "- alsi — Arch Linux のシステム情報ツール。スクリプトのソースコードを修正しなくても他のシステム用に設定することが可能です。\n\n- archey3 — Arch Linux のロゴとシステム情報を表示する Python スクリプト。\n\n- dmidecode — SMBIOS/DMI の仕様による BIOS に書かれているシステムのハードウェア情報を表示します。\n\n- hwdetect — /sys によってエクスポートされたモジュールを表示するシンプルなスクリプト。\n\n- hwinfo — openSUSE 由来のパワフルなハードウェア検出ツール。\n\n- hw-probe — Tool to probe for hardware, check operability and find drivers with the help of Linux Hardware Database.\n\n- inxi — システム情報を取得するためのスクリプト。\n\n- neofetch — w3m で画像を表示することができる高速・カスタマイズ可能なシステム情報スクリプト。\n\n- nmon — Console based application for monitoring various system components.\n\n- pfetch — A pretty system information tool written in POSIX sh.\n\n- screenfetch — archey と似ていますがスクリーンショットを取得することができます。bash で書かれています。\n\n- GPU-Viewer — GUI to glxinfo, vulkaninfo, clinfo and es2_info; written in Python with GTK.\n\n- hardinfo — ハードウェアとオペレーティングシステムに関する情報を表示する小さなアプリケーション。Windows のデバイスマネージャに似ています。\n\n- i-Nex — システムで利用できるハードウェアコンポーネントの情報を収集して Windows の人気ツール CPU-Z に似ているユーザーインターフェースで情報を表示するアプリケーション。\n\n- lshw — マシンのハードウェア設定に関する情報を詳しく表示する小さなツール。CLI と GTK のインターフェイス。\n\n- KInfoCenter — Centralized and convenient overview of system information for KDE.\n\n- USBView — Display the topology of devices on the USB bus.\n\n"
    },
    {
      "title": "System log viewers",
      "level": 4,
      "content": "- GNOME Logs — Viewer for the systemd journal. Part of gnome.\n\n- GNOME System Log — System log viewer for GNOME.\n\n- KSystemLog — System log viewer tool for KDE.\n\n- MATE System Log — System log viewer for MATE.\n\n- Pacman Log Viewer — Tool used to inspect pacman log file, in particular it lists installed, removed and upgraded packages letting you to filter by package's name and/or date.\n\n- QJournalctl — Qt-based graphical user interface for systemd's journalctl command.\n\n"
    },
    {
      "title": "Font viewers",
      "level": 4,
      "content": "See also Wikipedia:Font management software.\n\n- Deepin Font Manager — A font management tool for Deepin desktop.\n\n- Font Manager — Simple font management for GTK desktop environments.\n\n- Fonty Python — Manage, view and find your fonts.\n\n- GNOME Fonts — Font viewer for GNOME.\n\n- KFontview — KDE application to view and install different types of fonts.\n\n- MATE Font Viewer — Font viewer for MATE.\n\n"
    },
    {
      "title": "Help viewers",
      "level": 4,
      "content": "See man ページ#インストール.\n\n"
    },
    {
      "title": "Command schedulers",
      "level": 4,
      "content": "See also Cron.\n\n- FcronQ — Fcron GUI, an advanced periodic command scheduler.\n\n- GNOME Schedule — Graphical interface to crontab and at for GNOME.\n\n- KCron — Tool for KDE to run applications in the background at regular intervals. It is a graphical interface to the Cron command.\n\n- KTimer — Little tool for KDE to execute programs after some time. It allows you to enter several tasks and to set a timer for each of them. The timers for each task can be started, stopped, changed, or looped.\n\n"
    },
    {
      "title": "Shutdown timers",
      "level": 4,
      "content": "- GShutdown — Advanced shutdown utility which allows you to schedule the shutdown or the restart of your computer, or logout your actual session.\n\n- Hsiu-Ming's Timer — Graphical shutdown timer, which enables you to shutdown, turn off monitor, reboot or play sound after a period of time.\n\n- KShutdown — Graphical shutdown utility, which allows you to turn off or suspend a computer at a specified time. It features various time and delay options, command-line support, and notifications.\n\n"
    },
    {
      "title": "時刻同期",
      "level": 4,
      "content": "See 時刻同期.\n\n"
    },
    {
      "title": "Screen management",
      "level": 4,
      "content": "See Xrandr#Graphical front-ends.\n\n"
    },
    {
      "title": "Backlight management",
      "level": 4,
      "content": "See バックライト#バックライトユーティリティ.\n\n"
    },
    {
      "title": "Color management",
      "level": 4,
      "content": "See en:ICC profiles#Utilities and バックライト#色補正.\n\n"
    },
    {
      "title": "Printer management",
      "level": 4,
      "content": "See CUPS#GUI applications.\n\n"
    },
    {
      "title": "Bluetooth management",
      "level": 4,
      "content": "See Bluetooth#Front-ends.\n\n"
    },
    {
      "title": "電源管理",
      "level": 4,
      "content": "See 電源管理#ユーザースペースツール.\n\n"
    },
    {
      "title": "System management",
      "level": 4,
      "content": "See Systemd#GUI configuration tools.\n\n"
    },
    {
      "title": "Boot management",
      "level": 4,
      "content": "See GRUB/Tips and tricks#GUI configuration tools.\n\n"
    },
    {
      "title": "パッケージ管理",
      "level": 4,
      "content": "See pacman ヒント#ユーティリティ.\n\n"
    },
    {
      "title": "Virtualization",
      "level": 4,
      "content": "See Libvirt#Client and VirtualBox.\n\n"
    },
    {
      "title": "Compatibility layers",
      "level": 4,
      "content": "See Wine (Windows) and Darling (MacOS).\n\n"
    }
  ]
}