{
  "title": "List of Applications/Multimedia (Español)",
  "url": "https://wiki.archlinux.org/title/List_of_Applications/Multimedia_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\n"
    },
    {
      "title": "Visores de imágenes",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of image viewers.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- fbi — Visor de imágenes para Linux que explota el framebuffer de consola.\n\n- fbv — Visor de archivos gráficos muy simple que explota el framebuffer de consola.\n\n- fim — Visor de imágenes que explota el framebuffer de consola, altamente configurable y basado en fbi.\n\n- jfbview — Visor de imágenes y framebuffer PDF basado en Imlib2. Las caracteríticas incluyen controles tipo Vim, rotación y zoom, zoom para ajustar, y rápido renderizado multihilo.\n\n"
    },
    {
      "title": "Interfaz gráfica",
      "level": 4,
      "content": "- Eye of GNOME — Visor de imágenes y catalogador de programas, que forma parte del entorno de escritorio GNOME.\n\n- feh — Visor de imágenes rápido y ligero que utiliza imlib2.\n\n- Geeqie — Navegador y visor de imágenes (fork de GQview) que añade características adicionales, como soporte para archivos RAW.\n\n- Gimmage — Visor de imágenes Gtkmm.\n\n- GPicView — Visor de imágenes simple y rápido de X, que forma parte del escritorio LXDE.\n\n- gThumb — Visor de imágenes para el escritorio GNOME.\n\n- Gwenview — Visor de imágenes para el escritorio KDE, rápido y fácil de usar.\n\n- Mirage — Visor de imágenes PyGTK con soporte para recortar y redimensionar, acciones personalizadas y un panel de miniaturas.\n\n- nomacs — Visor de imágenes libre (Qt) para windows, linux, y sistemas mac, que está licenciado bajo la GNU General Public License v3.\n\n- Picasa — Organizador de imágenes y visor de Google que tiene capacidades de edición e integración con el sitio web para compartir fotos.\n\n- Quick Image Viewer — Visor de imágenes muy pequeño y rápido, basado en GTK+ y imlib2.\n\n- Ristretto — Visor de imágenes rápido y ligero para el entorno de escritorio Xfce.\n\n- sxiv — Visor de imágenes simple basado en imlib2 que funciona bien con los gestores de ventanas tipo mosaico.\n\n- Viewnior — Visor de imágenes minimalista basado en GTK+ con soporte para voltear, rotar, animaciones y acciones del ratón configurables.\n\n- Xloadimage — El clásico visor de imágenes de X.\n\n- XnView MP — Eficaz visualizador de imágenes, navegador y conversor.\n\n- xv — Programa shareware escrito por John Bradley para mostrar y modificar imágenes digitales en el sistema de ventanas X.\n\n"
    },
    {
      "title": "Editores de imágenes matriciales o ráster",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of raster graphics editors.\n\n- darktable — Programa de fotografía y desarrollo de aplicaciones RAW.\n\n- digiKam — Organizador de imágenes basado en KDE con una función de edición integrada a través de una arquitectura de plugin. digiKam afirma que es ofrecido con características más completas con respecto a similares aplicaciones, con un conjunto más amplio de funciones de manipulación de imágenes incluyendo manipulación e importación de imágenes RAW.\n\n- GIMP — Suite de edición de imágenes en línea con los editores profesionales como Adobe Photoshop. GIMP (GNU Image Manipulation Program) fue puesto en marcha a mediados de 1990 y ha adquirido un gran número de plugins y herramientas adicionales.\n\n- Gpaint — Paintbrush Clon de GNOME.\n\n- GraphicsMagick — Fork de ImageMagick diseñado para tener API y la estabilidad de la línea de órdenes. También es compatible con CPU múltiples para mejorar el rendimiento y, por lo tanto, es usado por algunos grandes sitios comerciales (Flickr, etsy) para su funcionamiento.\n\n- ImageMagick — Programa de manipulación de imágenes en línea de órdenes. Es conocido por sus conversiones de formato exactos con soporte para más de 100 formatos. Su API le permite ser escrito y se utiliza por lo general como un procesador backend .\n\n- KolourPaint — Editor gráfico raster de KDE, similar a Paint de Microsoft anterior a Windows 7, pero con algunas características adicionales, tales como soporte para la transparencia. Parte de los grupos kde-applications y kde-graphics.\n\n- Krita — Software de dibujo e ilustración digital basado en la plataforma KDE y en las bibliotecas de Calligra. Parte del grupo calligra.\n\n- Luminance HDR — Interfaz gráfica de código abierto que tiene como objetivo proporcionar un programa para imágenes HDR.\n\n- mtPaint — Programa de edición de gráficos orientado a la creación de imágenes Paleta indexada y pixel art.\n\n- MyPaint — Aplicación de software de gráficos gratuita para dibujos digitales.\n\n- Pinta — Programa de edición y dibujo siguiendo el modelo de Paint.NET. Su objetivo es proporcionar una alternativa simplificada a GIMP para usuarios ocasionales.\n\n- Shotwell — Organizador de imágenes con un pequeño conjunto de funciones de manipulación de imágenes (rotar, recortar, ajustar el color y eliminación de ojos rojos). Puede importar fotos directamente desde cámaras digitales y exportarlas a los sitios multimedia sociales (Facebook, Flickr, Picasa Web Albums, etc.).\n\n- XPaint — Herramienta de manipulación del color de imágenes que cuenta con las opciones más comunes del programa paint.\n\n"
    },
    {
      "title": "Gráficos vectoriales - Ilustración",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of vector graphics editors.\n\n- Dia — Programa de creación de diagramas basado en GTK+.\n\n- Inkscape — Editor de gráficos vectoriales, con capacidades similares a Illustrator, CorelDraw, o Xara X, que utiliza el formato de archivo SVG (Scalable Vector Graphics). Inkscape soporta muchas características avanzadas de SVG (marcadores, clones, mezcla alfa, etc.) y tiene mucho cuidado en el diseño de una interfaz intuitiva. Hace fácil editar nodos, realizar operaciones complejas, trazar mapas de bits y mucho más. Sus desarrolladores también tienen como objetivo mantener una próspera comunidad de usuarios y desarrolladores para que siga siendo software abierto, en beneficio de la comunidad.\n\n- Karbon — Editor de gráficos vectoriales, que forma parte de la suite Calligra. Parte del grupo calligra.\n\n- sK1 — Reemplazo para Adobe Illustrator o CorelDraw, orientado al PostScript «preimpresión lista» y salida de PDF.\n\n"
    },
    {
      "title": "Gráficos vectoriales - CAD",
      "level": 4,
      "content": "Véanse los artículos de Wikipedia sobre este asunto para obtener más información: CAD y List of computer-aided design editors.\n\n- BRL-CAD — Sistema de geometría constructiva de sólidos (conocido por sus siglas inglesas CSG) y diseño asistido por ordenador de modelado de sólidos (conocido por sus siglas inglesas CAD), que incluye un editor de geometría interactiva, apoyo el trazado de rayos para el procesamiento de gráficos y análisis geométricos, computer network distributed framebuffer support, scripting, herramientas de elaboración de imágenes y procesamiento de señales.\n\n- FreeCAD — Programa CAD/CAE, basado en OpenCascade, Qt y Python con funciones como grabación de macros, bancos de trabajo y la capacidad de funcionar como servidor.\n\n- LeoCAD — Programa CAD para crear modelos LEGO virtuales. Cuenta con una interfaz fácil de usar y, en la actualidad, con más de 6.000 piezas diferentes creadas por la comunidad LDraw.\n\n- LibreCAD — Potente aplicación CAD 2D basada en Qt. Se ha bifurcado de QCad Community Edition.\n\n- QCAD — Potente aplicación CAD 2D que se inició en 1999. QCAD incluye el formato de archivo estándar DFX y soporta formato HPGL.\n\n"
    },
    {
      "title": "Modelado/renderizado 3D",
      "level": 4,
      "content": "- Modelado: «que consiste en ir dando forma a objetos individuales que luego serán usados en la escena. Existen diversos tipos de geometría para modelador con NURBS y modelado poligonal o subdivisión de superficies», y\n- Renderizado: «se llama renderización al proceso final de generar la imagen 2D o animación a partir de la escena creada.»\n\nVéase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of 3D computer graphics software.\n\n- Art of Illusion — Programa de modelado y estudio de renderizado escrito en Java.\n\n- Blender — Suite de creación de gráficos 3D completamente integral con capacidad de modelado 3D, texturizado y animación, entre otras cosas.\n\n- MakeHuman™ — Programa de modelado paramétrico para la creación de órganos humanos.\n\n- POV-Ray — Trazador de rayos basado en script para la creación de gráficos 3D.\n\n- Wings 3D — Modelador de subdivisión avanzado que es a la vez potente y fácil de usar.\n\n"
    },
    {
      "title": "Captura de pantalla",
      "level": 4,
      "content": "Véase el artículo de ArchWiki sobre este asunto para obtener más información: Taking a screenshot.\n\n"
    },
    {
      "title": "Screencast",
      "level": 4,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of screencasting software.\n\nLas utilidades screencast le permiten crear un vídeo del escritorio de su ordenador o de ventanas individuales.\n\n- byzanz — Herramienta de screencast simple que produce animaciones GIF.\n\n- RecordMyDesktop — Una utilidad fácil de usar que graba el escritorio en el formato ogg con una interfaz CLI, Qt o GTK+.\n\n- simplescreenrecorder — Un grabador de pantalla con muchas características, compatible con X11 y OpenGL.\n\n- vokoscreen — Herramienta de screencast simple, GUI ffmpeg.\n\n- XVidCap — Aplicación utilizada para grabar un screencast o una grabación digital de una salida de la pantalla del sistema de ventanas X con una narración de audio.\n\n"
    },
    {
      "title": "Sistemas de audio",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Servidor de sonido.\n\nVéase el artículo de ArchWiki sobre este asunto para obtener más información: Sound system.\n\n"
    },
    {
      "title": "Reproductores de audio",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of audio player software.\n\n"
    },
    {
      "title": "Demonio y cliente de «music player»",
      "level": 4,
      "content": "- Music Player Daemon — Demonio ligero y versátil para gestionar música.\n\n- Véase también: List of MPD clients.\n- XMMS2 — Completa reescritura del popular reproductor music player.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- cmus — Reproductor de música con muchas características y basado en ncurses.\n\n- Cplay — Front-end basado en curses para diversos reproductores de audio (ogg123, mpg123, mpg321, splay, madplay, y mikmod, xmp y sox).\n\n- Herrie — Reproductor de música minimalista basado en consola con soporte AudioScrobbler nativo.\n\n- MOC — Reproductor de audio de consola basado en ncurses con soporte para formatos MP3, OGG y WAV.\n\n- mpg123 — Rápido reproductor de audio MP3 de consola para Linux, FreeBSD, Solaris, HP-UX y casi todos los demás sistemas UNIX (también decodifica archivos MP1 y MP2).\n\n- pianobar — Frontend para Pandora basado en consola.\n\n- VLC — Reproductor multimedia altamente portable con módulo de interfaz ncurses y marco multimedia, capaz de leer la mayoría de formatos de audio y vídeo, como DVD, CD de audio, VCD y varios protocolos streaming.\n\n"
    },
    {
      "title": "Interfez gráfica",
      "level": 4,
      "content": "- Amarok — Reproductor maduro basado en Qt conocido por su gran cantidad de funciones .\n\n- Audacious — Clon de Winamp como Beep y viejas versiones XMMS.\n\n- Clementine — Clon de Amarok 1.4, portado a Qt 4.\n\n- DeaDBeeF — Reproductor de música ligero y rápido, con muchas características, sin dependencias de GNOME o KDE, soporte para consola, así como para una interfaz gráfica de usuario GTK+, viene con muchos complementos y cuenta con un editor de metadatos.\n\n- Exaile — Clon de Amarok basado en GTK+.\n\n- gmusicbrowser — Jukebox de código abierto para grandes colecciones de archivos MP3/OGG/FLAC.\n\n- Goggles Music Manager — Álbun y reproductor de música que clasifica automáticamente su música, compatible con la reproducción sin pausas, ofrece fácil edición de etiquetas y apoyo de radio por Internet. Utiliza el Fox toolkit.\n\n- Guayadeque — Completo reproductor multimedia que puede manejar fácilmente grandes colecciones y utiliza el marco multimedia GStreamer.\n\n- Pragha — Álbum de música basado en GTK+ (fork de Consonance Music Manager)\n\n- Qmmp — Reproductor multimedia basado en Qt con una interfaz gráfica similar a Winamp o XMMS.\n\n- Quod Libet — Reproductor de audio escrito con PyGTK y GStreamer.\n\n- Rhythmbox — Clon de iTunes basado en GTK+, que se utiliza por defecto en GNOME.\n\n- Spotify — Servicio de streaming de música propietario. Soporta la reproducción local y el streaming desde la amplia biblioteca de Spotify (necesita una cuenta gratuita).\n\n- VLC — Reproductor y plataforma multimedia altamente portable capaz de leer la mayoría de formatos de audio y vídeo, como DVD, CD de audio, VCD y distintos protocolos streaming.\n\n"
    },
    {
      "title": "Ripear CD",
      "level": 3,
      "content": "- Abcde — Herramienta de línea de órdenes completa para ripear CD de audio.\n\n- Asunder — Programa de extracción de CD basado en GTK.\n\n- cdparanoia — Herramienta para CD de Audio Digital (Compact Disc Digital Audio - CDDA) y Extracción de Audio Digital (Digital Audio Extraction - DAE).\n\n- Gnac — Conversor de audio para GNOME.\n\n- Goobox — Reproductor de CD y ripeador de GNOME.\n\n- Grip — Rápido y ligero ripeador de CD dentro del proyecto GNOME que se asemeja a Audiograbber.\n\n- KAudioCreator — Programa de extracción y codificación de CD de audio y la codificación de archivos del disco.\n\n- rubyripper — Extractor de audio que intenta entregar un registro seguro a través de múltiples extracciones de la misma pista y la corrección de cualquier diferencia.\n\n- Sound Juicer — Extractor de CD para GNOME.\n\n- soundKonverter — Front-end para diversos conversores de audio.\n\n"
    },
    {
      "title": "Visualización",
      "level": 3,
      "content": "- ProjectM — Visualizador de música que utiliza aceleración 3D interactiva basada en renderización de imágenes.\n\n- VSXu — Programa gratuito que permite crear y realizar ajustes preestablecidos audiovisuales en tiempo real.\n\n"
    },
    {
      "title": "Editores de etiquetas de audio",
      "level": 3,
      "content": "- Audio Tag Tool — Herramienta para editar las etiquetas de archivos MP3 y Ogg Vorbis.\n\n- EasyTag — Utilidad para visualizar, editar y escribir las etiquetas ID3 de los archivos MP3.\n\n- Ex Falso — Multiplataforma gratuita y de código abierto, editor de etiquetas de audio y organizador de biblioteca.\n\n- ID3 Mass Tagger — Utilidad de línea de comandos para editar etiquetas ID3 1.x y 2.x.\n\n- Kid3 — Editor de etiquetas de archivos MP3, Ogg/Vorbis, FLAC, MPC, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV y AIFF.\n\n- MP3Info — Visor de información técnica de MP3 y editor de etiquetas ID3 1.x.\n\n- MusicBrainz Picard — Editor multiplataforma de etiquetas de audio escrito en Python (el etiquetador oficial de MusicBrainz).\n\n- Puddletag — Reemplazo del famoso MP3tag de Windows.\n\n"
    },
    {
      "title": "Editores de audio",
      "level": 3,
      "content": "- Ardour — Grabador multicanal de disco duro y estación de trabajo de audio digital.\n\n- Audacity — Programa que permite manipular las waveforms de audio digital.\n\n- GNOME Sound Recorder — La aplicación Sound Recorder permite grabar y reproducir archivos de sonido .flac, .ogg (OGG audio, o .oga), y .wav.\n\n- KWave — Editor de sonido para KDE.\n\n- Qtractor — Grabador de disco duro basado en Qt y estación de trabajo de audio digital que tiene como objetivo proporcionar software de estación de trabajo de audio digital lo suficientemente simple para el usuario doméstico medio, y sin embargo, lo suficientemente poderoso para el usuario profesional .\n\n- Rosegarden — Programa de trabajo de audio digital desarrollada con ALSA y Qt, que actúa como un secuenciador de audio y MIDI, y herramienta de edición y composición musical.\n\n"
    },
    {
      "title": "Aplicaciones de e-book",
      "level": 3,
      "content": "- Calibre — Aplicación de gestión de biblioteca de libros electrónicos, que también puede convertir diferentes formatos y sincronizarse con una gran variedad de lectores de libros electrónicos. Los formatos soportados incluyen CBZ, CBR, CBC, CHM, DJVU, EPUB, FictionBook, HTML, HTMLZ, LIT, LRF, Mobipocket, ODT, PDF, PRC, PDB, PML, RB, RTF, SNB, TCR, TXT y TXTZ.\n\n- Cool Reader — Visor de libros electrónicos compatible con muchos formatos, como EPUB (no DRM), FictionBook, TXT, RTF, HTML, CHM y TCR.\n\n- FBReader — Visor de libros electrónicos compatible con muchos formatos, como EPUB, FictionBook, HTML, plucker, PalmDoc, zTxt, TCR, CHM, RTF, OEB, Mobipocket (no DRM) y TXT.\n\n- Sigil — Editor ebook WYSIWYG.\n\n- Xournal — Aplicación para visualizar PDF y tomar notas.\n\n"
    },
    {
      "title": "Telefonía",
      "level": 3,
      "content": "- gnokii — Herramientas y controlador del espacio de usuario para usar con teléfonos móviles.\n\n- GNOME Phone Manager — Controla el teléfono móvil desde el escritorio GNOME.\n\n"
    },
    {
      "title": "Reproductores de vídeo",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of video player software.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- MPlayer — Reproductor de vídeo que soporta una gama completa y versátil de formatos de vídeo y audio.\n\n- mpv — Reproductor multimedia basado en MPlayer y mplayer2.\n\n- xine-ui — Reproductor multimedia gratuito.\n\n- VLC ncurses — Versión de línea de comandos del famoso reproductor de vídeo que puede reproducir sin problemas vídeos de alta definición en el TTY .\n\n"
    },
    {
      "title": "Interfaz gráfica",
      "level": 4,
      "content": "Véanse los artículos de ArchWiki sobre este asunto para obtener más información: MPlayer frontends[enlace roto: sección no válida] y mpv.\n\n- Dragon Player — Reproductor de vídeo sencillo para KDE. Parte de los grupos kde-multimedia.\n\n- Kaffeine — Reproductor multimedia KDE muy versátillayer que, por defecto , utiliza Xine como backend y tiene un excelente soporte de TV digital (DVB).\n\n- Parole — Reproductor multimedia moderno basado en el marco de GStreamer.\n\n- Totem — Reproductor multimedia (audio y vídeo) para el escritorio GNOME que usa GStreamer. Parte del grupo gnome\n\n- VLC media player — Reproductor de vídeo con soporte para una amplia variedad de formatos de audio y vídeo.\n\n- Xnoise — Reproductor multimedia basado en GTK+ y GStreamer tanto para audio como para vídeo con «una interfaz pulida, gran velocidad y muchas características».\n\n"
    },
    {
      "title": "Editores de vídeo",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of video editing software.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- Avidemux — Editor de vídeo gratuito diseñado para cortar, filtrar y codificar tareas sencillas.\n\n- HandBrake-CLI — Simple pero potente transcodificador de vídeo ideal para ripear lotes mkv/x264.\n\n"
    },
    {
      "title": "Interfaz gráfica",
      "level": 4,
      "content": "- {{App|Avidemux|Editor de vídeo gratuito diseñado para cortar, filtrar y codificar tareas sencillas.|http://fixounet.free.fr/avidemux/%7C[enlace roto 2022-09-20]avidemux-qt\n- Cinelerra (Community Version) — Editor de vídeo profesional y entorno de composición.\n\n- HandBrake — Simple pero potente transcodificador de vídeo ideal para ripear lotes mkv/x264. Versión GTK+.\n\n- Kdenlive — Editor de vídeo no lineal diseñado para trabajo de base y semiprofesional.\n\n- Kino — Editor de vídeo no lineal basado en GTK+ que soporta muchas tareas básicas y de detalle de audio/vídeo, así como tareas de edición y montaje.\n\n- LiVES — Plataforma de edición de vídeo y VJ (grabación en directo).\n\n- Open Shot — Editor de video no lineal basado en el marco MLT.\n\n- PiTiVi — Editor de vídeo diseñado para ser intuitivo y se integra bien en el escritorio GNOME.\n\n- Transmageddon — Sencilla aplicación python para la transcodificación de vídeo a formatos compatibles con GStreamer.\n\n"
    },
    {
      "title": "Gestores de colecciones",
      "level": 3,
      "content": "- GCstar — Aplicación de GNOME para la organización de diversas colecciones (juegos de mesa, cómics, películas, sellos, etc.).\n\n- Tellico — Aplicación de KDE para organizar diversas colecciones (libros, videos, música, monedas, etc.).\n\n- XBMC — Aplicación para la organización de diversas colecciones y recuperar automáticamente informaciones acerca de ellos (vídeo, música, fotos).\n\n"
    }
  ]
}