{
  "title": "List of applications/Multimedia (Italiano)",
  "url": "https://wiki.archlinux.org/title/List_of_applications/Multimedia_(Italiano)",
  "sections": [
    {
      "title": "Codecs",
      "level": 2,
      "content": "See the main article: Codecs.\n\n"
    },
    {
      "title": "Image viewers",
      "level": 3,
      "content": "See also Wikipedia:Comparison of image viewers.\n\n"
    },
    {
      "title": "Framebuffer",
      "level": 4,
      "content": "- fbi — Image viewer for the linux framebuffer console.\n\n- fbv — Very simple graphic file viewer for the framebuffer console.\n\n- fim — Highly customizable and scriptable framebuffer image viewer based on fbi.\n\n- jfbview — Framebuffer PDF and image viewer based on Imlib2. Features include Vim-like controls, rotation and zoom, zoom-to-fit, and fast multi-threaded rendering.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- timg — Terminal Image and Video Viewer.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- CoreImage — Simple lightweight easy to use image viewer based on Qt. Part of C-Suite.\n\n- Deepin Image Viewer — Image viewer for Deepin desktop.\n\n- Ephoto — A light image viewer based on EFL.\n\n- Eye of GNOME — Image viewer for GNOME desktop. Part of gnome-extra.\n\n- Eye of MATE — Simple graphics viewer for the MATE desktop.\n\n- feh — Fast, lightweight image viewer that uses imlib2.\n\n- GNOME Image Viewer — Simple image viewer for GNOME desktop. Part of gnome.\n\n- GPicView — Simple and fast image viewer for X, which is part of the LXDE desktop.\n\n- Gwenview — Fast and easy to use image viewer for the KDE desktop with optional dependencies for additional format support. Part of kde-graphics.\n\n- ida — X11 application (Motif based) for viewing images. Install the optional dependencies as needed.\n\n- image-roll — Simple and fast GTK image viewer with basic image manipulation tools.\n\n- imv — Lightweight image viewer with support for Wayland and animated GIFs which uses FreeImage.\n\n- Koko — Image viewer designed for desktop and touch devices. Part of kde-graphics.\n\n- KuickShow — Fast and convenient image viewer for KDE.\n\n- LxImage-Qt — The LXQt image viewer.\n\n- meh — meh is a small, simple, super fast image viewer using raw XLib.\n\n- Mirage — PyGTK image viewer featuring support for crop and resize, custom actions and a thumbnail panel.\n\n- mpv-gallery-view — Gallery-view scripts for mpv.\n\n- nomacs — Qt image viewer. It is feature-rich but starts fast and can be configured to show additional widgets or only the image.\n\n- nsxiv — Simple image viewer based on imlib2 that works well with tiling window managers. Community fork of sxiv.\n\n- PhotoQt — Fast and highly configurable image viewer with a simple and nice interface.\n\n- pqiv — GTK 3 based command-line image viewer with a minimal UI supporting images in compressed archives, rewrite of qiv.\n\n- qimgv — Fast and easy to use Qt5 image viewer. Supports webm/mp4 playback via mpv.\n\n- Quick Image Viewer — Very small and fast image viewer based on GTK and imlib2.\n\n- qView — Qt image viewer designed with minimalism and usability in mind.\n\n- Ristretto — Fast and lightweight image viewer for the Xfce desktop environment.\n\n- shufti — shufti non-destructively saves and restores the zoom level, rotation, window size, desktop location and viewing area on a per-image/file location basis\n\n- sxiv — Simple image viewer based on imlib2 that works well with tiling window managers.\n\n- Viewnior — Minimalistic GTK image viewer featuring support for flipping, rotating, animations and configurable mouse actions.\n\n- Vimiv — An image viewer with vim-like keybindings. It is written in python3 using the Gtk3 toolkit.\n\n- Vimiv (Qt port) — An image viewer with vim-like keybindings. It is written in python3 and PyQt5.\n\n- vpv — Image viewer designed for scientific image visualization.\n\n- Xloadimage — Classic X image viewer.\n\n"
    },
    {
      "title": "Image organizers",
      "level": 3,
      "content": "See also Wikipedia:Image organizer.\n\n- Deepin Album — Photo manager for viewing and organizing pictures, for Deepin desktop.\n\n- digiKam — KDE-based image organizer with built-in editing features via a plugin architecture. digiKam asserts it is more full featured than similar applications with a larger set of image manipulation features including RAW image import and manipulation.\n\n- Frogr — Small application for the GNOME desktop that allows users to manage their accounts in the Flickr image hosting website.\n\n- Geeqie — Image browser and viewer (fork of GQview) that adds additional functionality such as support for RAW files.\n\n- GNOME Photos — Access, organize, and share your photos on GNOME. Part of gnome-extra.\n\n- gThumb — Image viewer and browser for the GNOME desktop.\n\n- KPhotoAlbum — Digital image cataloging software that supports annotation, browsing, searching and viewing of digital images and videos.\n\n- Memories — Image viewer and manager designed for elementary OS.\n\n- Pantheon Photos — Photo organizer for Pantheon.\n\n- PhotoPrism — Personal Photo Management powered by Go and Google TensorFlow.\n\n- Phototonic — Fast and functional image viewer and browser (Qt).\n\n- Pix — Image gallery and image viewer that can be used to open images with other applications like an image editor, add tags to the files, add annotations to pictures, rotate and share them. Part of maui.\n\n- Pix — Image viewer and browser based on gthumb. X-Apps Project.\n\n- Rapid Photo Downloader — Download photos and videos from cameras, memory cards and portable storage devices.\n\n- Shotwell — A digital photo organizer designed for the GNOME desktop environment\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- CairoSVG — SVG to PNG, PDF, PS converter.\n\n- dcraw — Converts many camera RAW formats.\n\n- G'MIC — Full-featured open-source framework for image processing, providing several different user interfaces to convert/manipulate/filter/visualize generic image datasets, ranging from 1d scalar signals to 3d+t sequences of multi-spectral volumetric images, including 2d color images.\n\n- GraphicsMagick — Fork of ImageMagick designed to have API and command-line stability. It also supports multi-CPU for enhanced performance and thus is used by some large commercial sites (Flickr, etsy) for its performance.\n\n- ImageMagick — Command-line image manipulation program. It is known for its accurate format conversions with support for over 100 formats. Its API enables it to be scripted and it is usually used as a backend processor.\n\n- waifu2x — Image Super-Resolution for Anime-style art using Deep Convolutional Neural Networks.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Converseen — Qt-based batch image converter and resizer.\n\n- CropGUI — GTK utility for lossless cropping and rotation of JPEG files.\n\n- ImPPG — performs Lucy-Richardson deconvolution, unsharp masking, brightness normalization and tone curve adjustment\n\n- PosteRazor — Cut an image or PDF into pieces which can be printed and assembled to a poster.\n\n- Switcheroo — Convert between different image filetypes and resize them easily.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- Guetzli — A perceptual JPEG encoder, aiming for excellent compression density at high visual quality.\n\n- jpegoptim — JPEG optimization utility providing lossless and lossy compression.\n\n- optipng — Lossless PNG compressor.\n\n- oxipng — Lossless multithreaded PNG compressor.\n\n- pngcrush — Tool for optimizing the compression of PNG files.\n\n- pngquant — Lossy compression of PNG images.\n\n- zopflipng — Highly efficient PNG optimisation tool using Google's zopfli library\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Curtail — Image compressor that supports PNG, JPEG, WebP and SVG file types.\n\n- Image Optimizer — Simple lossless image optimizer built with Vala and Gtk for Elementary OS.\n\n- OptiImage — Useful image compressor that supports PNG, JPEG, WebP and SVG file types.\n\n- Trimage — Qt-based tool for optimizing PNG and JPG files.\n\n"
    },
    {
      "title": "Raster graphics editors",
      "level": 3,
      "content": "See also Wikipedia:Comparison of raster graphics editors.\n\n- AzPainter — Painting software for illustration drawing.\n\n- CorePaint — Simple bitmap painting tool to produce very simple graphics. Part of C-Suite.\n\n- Deepin Draw — Lightweight drawing tool for Deepin desktop.\n\n- Drawing — Drawing application for the GNOME desktop, using Cairo and GdkPixbuf for basic drawing operations.\n\n- Drawpile — Collaborative drawing program that allows multiple users to sketch on the same canvas simultaneously.\n\n- GIMP — Image editing suite in the vein of proprietary editors such as Adobe Photoshop. GIMP (GNU Image Manipulation Program) has been started in the mid 1990s and has acquired a large number of plugins and additional tools.\n\n- Gpaint — Paintbrush clone for GNOME.\n\n- GrafX2 — Bitmap paint program specialized in 256 color drawing.\n\n- ImEditor — Simple and versatile image editor.\n\n- KolourPaint — Free raster graphics editor for KDE, similar to Microsoft's Paint application before Windows 7, but with some additional features such as support for transparency. Part of kde-graphics.\n\n- Krita — Digital painting and illustration software included based on the KDE platform.\n\n- KXStitch — Cross stitch pattern and chart creation.\n\n- Milton — Infinite-canvas paint program.\n\n- mtPaint — Graphics editing program geared towards creating indexed palette images and pixel art.\n\n- MyPaint — Free software graphics application for digital painters.\n\n- Obfuscate — Censor private information from any image.\n\n- PhotoFlare — Simple but powerful image editor originally inspired by PhotoFiltre.\n\n- Pinta — Drawing and editing program modeled after Paint.NET. Its goal is to provide a simplified alternative to GIMP for casual users.\n\n- Pixelitor — Advanced image editor with support for layers, layer masks, text layers, multiple undo, blending modes, cropping, Gaussian blurring, unsharp masking, histograms, etc.\n\n- Satty — Image annotation tool inspired by Swappy and Flameshot.\n\n- Swappy — Wayland native image annotation tool.\n\n- XPaint — Color image editing tool which features most standard paint program options.\n\nSome image viewers and organizers like digiKam, Ephoto, GNOME Photos, gThumb, ida, nomacs, Pantheon Photos, Phototonic and Shotwell also provide some basic image manipulation functionality.\n\n"
    },
    {
      "title": "Specialized photo editors",
      "level": 3,
      "content": "- A Photo Tool (Libre) — Photo editor with easy to use basic image editing tools.\n\n- darktable — Photography workflow and RAW development application.\n\n- Filmulator — Simple raw photo editor based on the process of developing film.\n\n- FOSStriangulator — Tool for making triangulated illustrations out of photos.\n\n- Hugin — Panorama photo stitcher.\n\n- LightZone — Professional-level digital darkroom and photo editor comparable to Photoshop Lightroom.\n\n- Luminance HDR — Open source graphical user interface application that aims to provide a workflow for HDR imaging.\n\n- nUFRaw — Utility to read and manipulate raw images from digital cameras using DCRaw.\n\n- Rawstudio — Raw-image converter written in GTK.\n\n- RawTherapee — A powerful cross-platform raw image processing program.\n\n- Showfoto — Photo editor with powerful image editing tools.\n\n"
    },
    {
      "title": "Photo geotagging",
      "level": 3,
      "content": "- Geotag — Match date/time information from photos with location information from a GPS unit or from a map.\n\n- Geotagging — Photography geotagging tool to synchronize photos with gps track log (GPX).\n\n- GottenGeography — Easy to use photo geotagging application for the GNOME desktop.\n\n- GPicSync — Inserts location in your pictures metadata from a GPS tracklog.\n\n- GPSCorrelate — Correlate (geotagging) digital camera photos with GPS data in GPX format.\n\n- KGeoTag — Photo geotagging application based on KDE Frameworks.\n\n"
    },
    {
      "title": "Vector graphics editors",
      "level": 3,
      "content": "See also Wikipedia:Comparison of vector graphics editors.\n\n- Dia — GTK-based diagram creation program.\n\n- diagrams.net — Diagram drawing application built on web technology. Based on the Electron platform.\n\n- Dot Matrix — The glyph playground of creativity from simple lines.\n\n- Figma — Unofficial desktop application for Figma collaborative design tool. Based on the Electron platform.\n\n- Inkscape — Vector graphics editor, with capabilities similar to Illustrator, CorelDraw, or Xara X, using the SVG (Scalable Vector Graphics) file format.\n\n- Karbon — Vector graphics editor, part of the Calligra Suite. Part of kde-office.\n\n- LazPaint — Image editor, like PaintBrush or Paint.Net, written in Lazarus (Free Pascal)\n\n- LibreOffice Draw — Vector graphics editor and diagramming tool included in the LibreOffice suite similar to Microsoft Visio.\n\n- Lunacy — Vector graphic design software for UI/UX and web design.\n\n- Mockitt — Proprietary online design, prototyping, and collaboration platform. Based on the Electron platform.\n\n- OpenOffice Draw — Vector graphics editor and diagramming tool included in the OpenOffice suite.\n\n- Pencil Project — GUI prototyping and mockup tool. Based on the Electron platform.\n\n- sK1 — Replacement for Adobe Illustrator or CorelDraw, oriented for \"prepress ready\" PostScript & PDF output.\n\n- SvgVi — SVG viewer and editor using XML declarations.\n\n- SymbolEditor — Application to create libraries of QPainterPath objects with rendering hints.\n\n- yEd — General-purpose proprietary diagramming program for flowcharts, network diagrams, UML diagrams, BPMN diagrams, mind maps, organization charts, and Entity Relationship diagrams.\n\n- Xfig — Interactive drawing tool.\n\n"
    },
    {
      "title": "Font editors",
      "level": 3,
      "content": "See also Wikipedia:Comparison of font editors.\n\n- Birdfont — Font editor which lets you create vector graphics and export TTF, EOT and SVG fonts.\n\n- FontForge — Outline font editor.\n\n- TruFont — Font-editing application.\n\n"
    },
    {
      "title": "2D animation",
      "level": 3,
      "content": "- Glaxnimate — Vector 2D animation software, mainly for Lottie and TGS formats, but have a good standard animated SVG export\n\n- OpenToonz — 2D animation creation software.\n\n- Pencil2D — Easy, intuitive tool to make 2D hand-drawn animations.\n\n- qStopMotion — Application for creating stop-motion animation movies. The users will be able to create stop-motions from pictures imported from a camera or from the harddrive and export the animation to different video formats such as mpeg or avi.\n\n- Scribl — Application to create simple video lectures that combine audio with hand-drawn animation.\n\n- Stopmotion — Application to create stop-motion animations. It helps you capture and edit the frames of your animation and export them as a single file.\n\n- Synfig Studio — 2D animation software, designed as powerful industrial-strength solution for creating film-quality animation using a vector and bitmap artwork.\n\n- TupiTube Desk — Desktop application to create and share 2D animations, focused on kids and teenagers.\n\n- Aseprite — Open-source software for creating pixel art and animations. Builds can either be purchased from the developers or compiled from source.\n\n- Pixelorama — Open-source software for creating pixel art and animations.\n\n- Tahoma2D — Free and powerful software for 2D and stop motion animators. Based on OpenToonz\n\nThe drawing application Krita, the 3D editor Blender (Grease Pencil mode), and the python library Manim have 2D animation features too.\n\n"
    },
    {
      "title": "3D computer graphics",
      "level": 3,
      "content": "See also Wikipedia:Comparison of 3D computer graphics software.\n\n- Art of Illusion — 3D modeling and rendering studio written in Java.\n\n- Blender — Fully integrated 3D graphics creation suite capable of 3D modeling, texturing, and animation, among other things.\n\n- Blockbench — A low-poly 3D model editor\n\n- CloudCompare — 3D point cloud and mesh processing software.\n\n- Dust3D — 3D modeling software. It helps you create a 3D watertight base model in seconds. Use it to speed up your character modeling in game making, 3D printing, and so on.\n\n- F3D — A fast and minimalist KISS 3D viewer. Supported file formats: VTK (legacy and XML), STL, GLTF, PLY, OBJ, 3DS, …\n\n- Goxel — Open Source 3D voxel editor.\n\n- MakeHuman™ — Parametrical modeling program for creating human bodies.\n\n- MeshLab — System for processing and editing 3D triangular meshes.\n\n- Sweet Home 3D — Interior design software application for the planning and development of floor plans\n\n- POV-Ray — Script-based raytracer for creating 3D graphics.\n\n- VoxelShop — Extremely intuitive and powerful software to modify and create voxel objects.\n\n- Wings 3D — Advanced subdivision modeler that is both powerful and easy to use.\n\n"
    },
    {
      "title": "Color pickers and palettes",
      "level": 3,
      "content": "- ColorGrab — Cross-platform color picker.\n\n- Color Palette — Tool for viewing the GNOME color palette as defined by the design guidelines.\n\n- colorpicker — Click on a pixel on your screen and print its color value in RGB. Written for X11.\n\n- Color Picker — Simplistic color picker for the Pantheon desktop.\n\n- Contrast — Checks whether the contrast between two colors meet the WCAG requirements.\n\n- Coulr — Color box to help developers and designers.\n\n- Deepin Picker — Color picker tool for Deepin desktop.\n\n- delicolour — Lightweight GTK 3 color finder.\n\n- Eyedropper — Color picker and formatter.\n\n- Gcolor3 — Simple GTK 3 color selector.\n\n- GPick — Advanced color picker tool.\n\n- hyprpicker — A wlroots-compatible Wayland color picker that does not suck.\n\n- KColorChooser — Simple application to select the color from the screen or from a pallete. Part of kde-graphics.\n\n- Kontrast — Tool to check contrast for colors that allows verifying that your colors are correctly accessible. Part of kde-accessibility.\n\n- MATE Color Selection — Choose colors from the palette or the screen. Run with mate-color-select.\n\n- Pick — Simple color picker tool for the Linux desktop.\n\n- PrestoPalette — An artist's tool for creating harmonious color palettes.\n\n- sxcs — Minimal X11 color picker and magnifier\n\n- xcolor — Lightweight color picker for X11.\n\n"
    },
    {
      "title": "Screenshot",
      "level": 3,
      "content": "See Screen capture#Screenshot software.\n\n"
    },
    {
      "title": "Digital camera managers",
      "level": 3,
      "content": "See gPhoto#Installation.\n\n"
    },
    {
      "title": "Text art",
      "level": 3,
      "content": "See ASCII art#Software.\n\n"
    },
    {
      "title": "Audio systems",
      "level": 3,
      "content": "See also the main article Sound system and Wikipedia:Sound server.\n\n"
    },
    {
      "title": "Audio players",
      "level": 3,
      "content": "See also Wikipedia:Comparison of audio player software.\n\nMany applications in the #Video players section also support audio playback.\n\n"
    },
    {
      "title": "Server",
      "level": 4,
      "content": "- Music Player Daemon — Audio player that has a server-client architecture. In order to interface with it, a separate client is needed.\n\n- Funkwhale — self-hosted, modern, free and open-source music server, heavily inspired by Grooveshark. Instances can be federated.\n\n- Navidrome — Open source music server and streamer with a built in Web UI. Compatible with a wide range of third-party Android and iOS apps.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- cmus — Very feature-rich ncurses-based music player.\n\n- cplay-ng — Updated fork of cplay.\n\n- davis — A CLI client for mpd, written in Rust.\n\n- MOC — Ncurses console audio player with support for the MP3, OGG, and WAV formats.\n\n- mpg123 — Fast free MP3 console audio player for Linux, FreeBSD, Solaris, HP-UX and nearly all other UNIX systems (also decodes MP1 and MP2 files).\n\n- musikcube — A cross-platform, terminal-based music player, audio engine, metadata indexer, and server in c++.\n\n- vitunes — Curses-based music player and playlist manager with vim-like keybindings.\n\n- whistle — Curses-based commandline audio player.\n\n- XMMS2 — Complete rewrite of the popular music player.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Amberol — Small and simple sound and music player that is well integrated with GNOME.\n\n- Blanket — Improve focus and increase your productivity by listening to different sounds.\n\n- Byte — Music player designed for elementary OS.\n\n- Clementine — Amarok 1.4 clone, ported to Qt5. See also Strawberry (below).\n\n- Cozy — Modern audio book player for Linux using GTK 3.\n\n- Exaile — GTK clone of Amarok.\n\n- GNOME Audio Player — Audio player for GNOME. Part of gnome.\n\n- GNOME Music — Music player for GNOME. It aims to combine an elegant and immersive browsing experience with simple and straightforward controls. Part of gnome.\n\n- Guayadeque — Full featured media player that can easily manage large collections and uses the GStreamer media framework (no longer maintained as of September 2023).\n\n- Lollypop — A GNOME music player.\n\n- Melody — Music player for listening to local music files, online radios and audio CD's.\n\n- Nulloy — Music player with a waveform progress bar.\n\n- Pantheon Music — Simple, fast, and good looking music player. The official elementary music player.\n\n- Parlatype — Minimal audio player for manual speech transcription, for GNOME. It plays audio sources to transcribe them in your favorite text application.\n\n- Pragha — A lightweight two-panel GTK music manager written in C.\n\n- Quod Libet — Audio player written with GTK, Python and GStreamer with support for regular expressions in playlists.\n\n- Rhythmbox — GTK clone of iTunes, used by default in GNOME.\n\n- Sayonara — Small, clear and fast audio player for Linux written in C++, uses the Qt framework.\n\n- Strawberry — Fork of Clementine aimed at audio enthusiasts and music collectors. Uses Qt6.\n\n- Tauon Music Box — Modern, comfortable and streamlined music player for the playback of your music collection.\n\n- Amarok — Mature Qt-based player known for its plethora of features.\n\n- Aqualung — Advanced music player, which plays audio CDs, internet radio streams and podcasts as well as soundfiles in just about any audio format and has the feature of inserting no gaps between adjacent tracks.\n\n- Audacious — Winamp clone like Beep and old XMMS versions.\n\n- DeaDBeeF — Light and fast music player with many features, no GNOME or KDE dependencies, supports console-only, as well as a GTK GUI, comes with many plugins, and has a metadata editor.\n\n- Drumstick MIDI File Player — MIDI file player based on Drumstick.\n\n- Elisa — Simple music player by the KDE community aiming to provide a nice experience for its users. Part of kde-multimedia.\n\n- fooyin — A customisable Qt-based music player.\n\n- gmusicbrowser — Open-source jukebox for large collections of MP3/OGG/FLAC files.\n\n- Goggles Music Manager — Music collection manager and player that automatically categorizes your music, supports gapless playback, features easy tag editing, and internet radio support. Uses the Fox toolkit.\n\n- JuK — JuK is an audio jukebox application, supporting collections of MP3, Ogg Vorbis, and FLAC audio files. Part of kde-multimedia.\n\n- LXMusic — A minimalist xmms2-based music player.\n\n- museeks — Minimalistic and easy to use music player. Based on the Electron platform.\n\n- Musique — Just another music player, only better.\n\n- Qmmp — Qt-based multimedia player with a user interface that is similar to Winamp or XMMS.\n\n- Soundux — Soundboard that features a simple user interface.\n\n- Vvave — Tiny Qt music player to keep your favorite songs at hand. Part of maui.\n\n"
    },
    {
      "title": "Internet radio listeners",
      "level": 3,
      "content": "- Goodvibes — Lightweight internet radio player.\n\n- Radio — Easily find live radio programs based on geographical location of radio broadcasters on the Internet.\n\n- Radiotray-NG — Internet radio player systray applet.\n\n- Shortwave — GTK application for finding and listening to internet radio stations.\n\n- Tuner — Minimalist radio station player.\n\n"
    },
    {
      "title": "Music streaming clients",
      "level": 3,
      "content": "- AudioTube — YouTube Music client app for phones and desktop computers. Part of kde-multimedia.\n\n- Cider — An open source and community oriented Apple Music client for Windows, Linux, macOS, and more. Based on the Electron platform.\n\n- Google Play Music Desktop Player — Beautiful cross platform desktop player for Google Play Music. Based on the Electron platform.\n\n- Headset — Desktop application that turns YouTube into a world class music streaming service. Based on the Electron platform.\n\n- ncspot — Cross-platform ncurses Spotify client written in Rust, inspired by ncmpc and the likes.\n\n- Nuclear — Modern music player focused on streaming from free sources. Based on the Electron platform.\n\n- pianobar — Console-based frontend for the online radio Pandora.\n\n- Pithos — Python/GTK Pandora Radio desktop client.\n\n- Spotify — Proprietary music streaming service. It supports local playback and streaming from Spotify's vast library (requires a free account).\n\n- spotify-qt — Lightweight Spotify client using Qt.\n\n- spotify-tui — Spotify for the terminal written in Rust.\n\n- TIDAL Hi-Fi (Max quality) — The web version of TIDAL Player running in electron with Hi-Fi (High & Max) support thanks to widevine\n\n- YouTube Music — Electron-based wrapper around YouTube Music with built in addons.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- Beets — Music library organizer, tagger and more.\n\n- Demlo — Batch music tagger, encoder, renamer and more.\n\n- id3 — Command-line utility to edit ID3 1.x and 2.x tags.\n\n- id3v2 — Command line editor for id3v2 tags.\n\n- MP3Info — MP3 technical info viewer and ID3 1.x tag editor.\n\n- MP3Unicode — Command line utility to convert ID3 tags in mp3 files between different encodings.\n\n- Taffy — Simple command-line tag editor for many audio formats.\n\n- Tagutil — CLI tool to edit music file's tag. It aims to provide both an easy-to-script interface and ease of use interactively.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Audio Tag Tool — Tool to edit tags in MP3 and Ogg Vorbis files.\n\n- Coquillo — Metadata editor for various audio formats.\n\n- Ear Tag — Simple audio file tag editor.\n\n- EasyTag — Utility for viewing, editing and writing ID3 tags of music files, supports many audio formats.\n\n- Ex Falso — Cross-platform free and open source audio tag editor and library organizer. Run with exfalso.\n\n- GabTag — Audio tagging tool written in GTK.\n\n- Kid3 — MP3, Ogg/Vorbis, FLAC, MPC, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV and AIFF files tag editor.\n\n- MP3Info GUI — MP3 technical info viewer and ID3 1.x tag editor. The graphical interface can be launched with the gmp3info command.\n\n- NickvisionTagger — GTK Music file tag editor. Can load tags from MusicBrainz database. Works with mp3, ogg, flac, wma, and wav. Convert filenames to tags and tags to filenames.\n\n- Picard — Cross-platform audio tag editor written in Python (the official MusicBrainz tagger).\n\n- NTag — Graphical tag editor focused on everyday life use cases.\n\n- Puddletag — Replacement for the famous MP3tag for Windows.\n\n- Tag Editor — A tag editor with Qt GUI and command-line interface supporting MP4/M4A/AAC (iTunes), ID3v1/ID3v2, Vorbis, Opus, FLAC and Matroska.\n\n- Thunar Media Tags Plugin — Adds special features for media files to the Thunar File Manager, including the ability to edit tags.\n\n"
    },
    {
      "title": "Lyrics players",
      "level": 4,
      "content": "- Floodlight Presenter — Presentation and lyrics program for churches to display lyrics and media.\n\n- Give Me Lyrics — See the lyrics of the song that is playing, from any application.\n\n- OSD Lyrics — Lyric show compatible with various media players.\n\n"
    },
    {
      "title": "Lyrics downloaders",
      "level": 4,
      "content": "- clyrics — Extensible lyrics fetcher, with daemon support for cmus and mocp.\n\n- glyrc — Command-line music related metadata searchengine, including support for downloading lyrics.\n\n"
    },
    {
      "title": "Lyrics editors",
      "level": 4,
      "content": "- Karaoke Lyrics Editor — Lyrics editor and CD+G/video exporter for Karaoke.\n\n- LyricsX — Lyrics editor.\n\n"
    },
    {
      "title": "Audio converters",
      "level": 3,
      "content": "- Ecasound — Command line tools designed for multitrack audio processing. It can be used for simple tasks like audio playback, recording and format conversions, as well as for multitrack effect processing, mixing, recording and signal recycling.\n\n- FFaudioConverter — Batch audio converter and effects processor. It can convert files or whole folders containing music and video files to other audio formats with FFmpeg.\n\n- Flacon — Extracts individual tracks from one big audio file containing the entire album of music and saves them as separate audio files.\n\n- fre:ac — Audio converter and CD ripper with support for various popular formats and encoders.\n\n- Gnac — Audio converter for GNOME.\n\n- SoundConverter — A graphical application to convert audio files into different formats.\n\n- soundKonverter — Qt-based GUI front-end to various audio converters.\n\n- SoX — Command line utility that can convert various formats of computer audio files into other formats.\n\n"
    },
    {
      "title": "Audio editors",
      "level": 3,
      "content": "See also Wikipedia:Comparison of digital audio editors.\n\n- Audacity — Program that lets you manipulate digital audio waveforms.\n\n- GNOME Sound Recorder — Provides a straight-forward way to record and play audio. Part of gnome-extra.\n\n- GWC — Digital audio editor to denoise, dehiss and amplify audio files.\n\n- KRecorder — A convergent audio recording application for Plasma. Part of kde-utilities.\n\n- Kwave — Sound editor for KDE. Part of kde-multimedia.\n\n- mhWaveEdit — Graphical program for editing, playing and recording sound files.\n\n- Mp3splt — Utility to split mp3, ogg vorbis and native FLAC files selecting a begin and an end time position, without decoding.\n\n- ocenaudio — Proprietary cross-platform, easy to use, fast and functional audio editor.\n\n- Play it Slowly — Play back audio files at a different speed or pitch.\n\n- Polyphone — A soundfont editor to create and edit a musical instrument based on samples, using the sf2 format.\n\n- Snd — Advanced sound editor modeled loosely after Emacs.\n\n- Swami — A SoundFont editor\n\n- Sweep — Audio editor and live playback tool.\n\n- WaveSurfer — Tool for sound visualization and manipulation. Typical applications are speech/sound analysis and sound annotation/transcription.\n\n"
    },
    {
      "title": "Digital audio workstations",
      "level": 3,
      "content": "See also Professional audio.\n\n- Ardour — Multichannel hard disk recorder and digital audio workstation.\n\n- Bitwig Studio — Proprietary professional digital audio workstation.\n\n- Frinika — Digital audio workstation, features sequencer, soft-synths, realtime effects and audio recording.\n\n- LMMS — Digital audio workstation which allows you to produce music with your computer.\n\n- MusE — MIDI/Audio sequencer (digital audio workstation) with recording and editing capabilities, aims to be a complete multitrack virtual studio for Linux.\n\n- Non — Modular digital audio workstation composed of four main parts: Timeline, Sequencer, Mixer and Session Manager.\n\n- Qtractor — Qt-based hard disk recorder and digital audio workstation application that aims to provide digital audio workstation software simple enough for the average home user, and yet powerful enough for the professional user.\n\n- REAPER — Proprietary digital audio workstation, offering a full multitrack audio and MIDI recording, editing, processing, mixing and mastering toolset.\n\n- Rosegarden — Digital audio workstation program developed with ALSA and Qt that acts as an audio and MIDI sequencer, scorewriter and musical composition and editing tool.\n\n- Tracktion Waveform — Proprietary digital audio workstation, specifically designed for the needs of modern music producers.\n\n- Zrythm — A feature-rich digital audio workstation with support for various plugin formats and advanced audio processing capabilities.\n\n"
    },
    {
      "title": "Audio analyzers",
      "level": 3,
      "content": "- audioprism — Spectrogram tool for PulseAudio input and WAV files.\n\n- BRP-PACU — Dual channel FFT based acoustic analysis tool to help engineers analyze live professional sound systems using the transfer function.\n\n- FMIT — Graphical utility for tuning your musical instruments, with error and volume history and advanced features.\n\n- Friture — Real-time audio analyzer.\n\n- Mousai — Simple application for identifying songs using the API of audd.io.\n\n- rtspeccy — Real time audio spectrum analyzer.\n\n- SongRec — Unofficial Shazam client to recognize audio from an arbitrary audio file or from the microphone, written in Rust.\n\n- Sonic Visualiser — Viewing, analyzing, and annotating the contents of music audio files.\n\n- Spek — A barebones interface for ffmpeg's spectogram png output, helps to analyse your audio files by showing their spectrogram.\n\n"
    },
    {
      "title": "Scorewriters",
      "level": 3,
      "content": "See also LilyPond#Front-ends and Wikipedia:Comparison of scorewriters.\n\n- Canorus — Music score editor. It supports an unlimited number and length of staffs, polyphony, a MIDI playback of notes, chord markings, lyrics, import/export filters to formats like MIDI, MusicXML, ABC Music, MusiXTeX and LilyPond.\n\n- Impro-Visor — Music notation program designed to help jazz musicians compose and hear solos similar to ones that might be improvised.\n\n- LilyPond — Music engraving program, devoted to producing the highest-quality sheet music possible.\n\n- MuseScore — Create, playback, and print sheet music.\n\n- TuxGuitar — Multitrack guitar tablature editor and player.\n\n"
    },
    {
      "title": "Metronome",
      "level": 3,
      "content": "- GMetronome — A GTK metronome and tempo measurement tool.\n\n- Metronome — Beats the rhythm for you to keep the tempo.\n\n"
    },
    {
      "title": "Audio synthesis environments",
      "level": 3,
      "content": "See also Wikipedia:Comparison of audio synthesis environments.\n\n- Blue — Music composition environment for Csound, written in Java.\n\n- Cabbage — Framework for audio software development using simple markup text and the Csound audio synthesis language.\n\n- Cardinal — Virtual modular synthesizer plugin based on the VCV Rack, includes lots of virtualized Eurorack modules.\n\n- ChucK — Strongly-timed, concurrent, and on-the-fly music programming language.\n\n- Csound — Sound and music computing system.\n\n- CsoundQt — Frontend for Csound featuring a highlighting editor with autocomplete, interactive widgets and integrated help.\n\n- FoxDot — Live Coding with Python and SuperCollider.\n\n- Pure Data — Real-time music and multimedia environment.\n\n- Sonic Pi — Code-based music creation and performance tool.\n\n- SuperCollider — Platform for audio synthesis and algorithmic composition, used by musicians, artists, and researchers working with sound.\n\n- VCV Rack — Virtual Eurorack DAW. Use a plugin systems to add more Eurorack emulated modules.\n\n"
    },
    {
      "title": "Sound generators",
      "level": 3,
      "content": "This section contains drum machines, software samplers and software synthesizers.\n\n- ADLMIDI — OPL3/OPN2 synthesizer using ADLMIDI.\n\n- ADLplug — FM Yamaha OPL3 synthesizer for ADLMIDI.\n\n- Agordejo — Music and audio production session manager based on NSM.\n\n- ams — ALSA Modular Synth. Realtime modular synthesizer and effect processor.\n\n- amsynth — Analog Modelling SYNTHesizer. Easy-to-use software synthesizer with a classic subtractive synthesizer topology.\n\n- DIN — Sound synthesizer and musical instrument.\n\n- Drumlabooh — LV2/VSTi drum machine with Hydrogen, SFZ, Drumlabooh kits support.\n\n- Drumstick — Set of MIDI tools: drum grid, MIDI player, virtual piano.\n\n- Element — A modular LV2/VST3 audio plugin host.\n\n- FluidSynth — Real-time software synthesizer based on the SoundFont 2 specifications.\n\n- Geonkick — Synthesizer that can synthesize elements of percussion. The most basic examples are: kicks, snares, hit-hats, shakers, claps.\n\n- Gigedit — Graphical instrument editor for sample based virtual instruments, based on the GigaStudio/Gigasampler file format.\n\n- GrandOrgue — Virtual pipe organ sample player application supporting a HW1 compatible file format.\n\n- GSequencer — Provides various tools to play, create, edit and mix your own music. It features a step sequencer, piano roll, automation and wave-form editor.\n\n- Helm — Software synthesizer to create electronic music on your computer.\n\n- Hydrogen — Advanced drum machine to create drum sequences.\n\n- JSampler — Java GUI for LinuxSampler software audio sampler.\n\n- OPNplug — FM Yamaha OPN2 synthesizer for OPNMIDI.\n\n- Patroneo — Easy to use pattern based midi sequencer.\n\n- QMidiArp — Advanced MIDI arpeggiator, programmable step sequencer and LFO.\n\n- QmidiCtl — MIDI remote controller application that sends MIDI data over the network, using UDP/IP multicast.\n\n- QmidiNet — MIDI network gateway application that sends and receives MIDI data over the network, using UDP/IP multicast.\n\n- QMidiRoute — MIDI router and processor for ALSA.\n\n- Qsampler — Qt GUI for LinuxSampler software audio sampler.\n\n- Qsynth — Qt GUI for Fluidsynth.\n\n- Qwertone — Simple music synthesizer (like a toy-piano), but based on usual qwerty-keyboard for input.\n\n- QXGEdit — Qt GUI for editing MIDI System Exclusive files for XG devices (eg. Yamaha DB50XG).\n\n- setBfree — DSP tonewheel organ.\n\n- SpectMorph — Analyze samples of musical instruments and combine them (morphing).\n\n- Surge XT — Cross platform, subtractive hybrid synthesizer. Installs the standalone application (surge-xt-standalone), plugins (surge-xt-clap, surge-xt-vst3), and common files (surge-xt-common).\n\n- TiMidity++ — Software synthesizer, which can play MIDI files by converting them into PCM waveform data.\n\n- Vee One Suite — Old-school software instruments: synthv1, a polyphonic subtractive synthesizer; samplv1, a polyphonic sampler synthesizer; drumkv1, yet another drum-kit sampler; padthv1, a polyphonic additive synthesizer.\n\n- VMPK — Virtual MIDI Piano Keyboard. MIDI events generator and receiver. It can use midi SoundFonts to generate sound by itself, or can be used to drive a MIDI synthesizer.\n\n- Yoshimi — Software synthesizer, a fork of ZynAddSubFX.\n\n- ZynAddSubFX — Fully featured software synthesizer capable of making a countless number of instruments, from some common heard from expensive hardware to interesting sounds that you will boost to an amazing universe of sounds.\n\n"
    },
    {
      "title": "Music trackers",
      "level": 3,
      "content": "- Buzztrax — Music studio to compose songs using only a computer with a soundcard.\n\n- FamiStudio — Very simple music editor for the Nintendo Entertainment System or Famicom.\n\n- FastTracker II — A clone of the same tracker name using SDL2 in C.\n\n- Furnace — A chiptune tracker compatible with DefleMask modules. Emulates a variety of sound chips.\n\n- klystrack — Tracker for making C64/NES/Amiga-style chiptunes on a modern platform.\n\n- MilkyTracker — Music application for creating .MOD and .XM module files.\n\n- OpenMPT — Tracker software to create and play back some great music on your computer.\n\n- ProTracker 2 — A clone of the original tracker from the amiga. Written using SDL2 in C.\n\n- Radium — Music editor with a new type of interface.\n\n- Schism Tracker — Create high quality music without the requirements of specialized, expensive equipment, and with a unique \"finger feel\" that is difficult to replicate in part.\n\n- SunVox — Small, fast and powerful modular synthesizer with pattern-based sequencer (tracker).\n\n"
    },
    {
      "title": "DJ",
      "level": 3,
      "content": "- Giada — Minimal, hardcore audio tool for DJs, live performers and electronic musicians.\n\n- IDJC — Powerful yet easy to use source-client for individuals interested in streaming live radio shows over the Internet using Shoutcast or Icecast servers.\n\n- Linux Show Player — Powerful and feature-rich software to arrange cue lists. Designed for theater plays and live music shows.\n\n- Luppp — Music creation tool, intended for live use. The focus is on real time processing and a fast and intuitive workflow.\n\n- Mixxx — Integrates the tools DJs need to perform creative live mixes with digital music files.\n\n- xwax — Digital Vinyl System (DVS) for Linux. It allows DJs and turntablists to playback digital audio files (MP3, Ogg Vorbis, FLAC, AAC and more), controlled using a normal pair of turntables via timecoded vinyls.\n\n"
    },
    {
      "title": "Audio effects",
      "level": 3,
      "content": "- Calf Plugin Pack for JACK — Process and produce sounds using a set of plugins with JACK interface. (calfjackhost)\n\n- Carla — Audio plugin host, with support for many audio drivers and plugin formats.\n\n- guitarix — Virtual guitar amplifier for JACK.\n\n- EasyEffects — Apply effects to audio applications and input sources over PipeWire (or PulseAudio with legacy package).\n\n- Rakarrack — Richly featured multi-effects processor emulating a guitar effects pedalboard.\n\n- ToneLib GFX — the perfect custom tone with a complete guitar studio in your computer\n\n"
    },
    {
      "title": "Audio visualizers",
      "level": 3,
      "content": "- Barva — Visualizer for PulseAudio that pulses the background of your terminal.\n\n- C.A.V.A. — Console-based audio visualizer for ALSA, MPD and PulseAudio.\n\n- Cavalcade — GTK GUI for C.A.V.A.\n\n- GLava — OpenGL audio spectrum visualizer. Its primary use case is for desktop windows or backgrounds.\n\n- GLMViz — Fully configurable OpenGL music visualizer.\n\n- Le Biniou — User-friendly, powerful music visualization / VJing tool.\n\n- projectM — Music visualizer which uses 3D accelerated iterative image-based rendering.\n\n- VSXu — OpenGL-based (hardware-accelerated), modular programming environment with its main purpose to visualize music and create graphic effects in real-time.\n\n"
    },
    {
      "title": "Remote audio",
      "level": 3,
      "content": "- Audio Sharing — Share current computer audio playback in the form of an RTSP stream. This stream can then be played back by other devices.\n\n- GUPnP Tools — Provides client and server side tools which enable one to easily test and debug one's UPnP devices and control points.\n\n- jammr — Play jam sessions with musicians around the world over the internet.\n\n- Jamulus — Enables musicians to perform real-time jam sessions over the internet.\n\n- netaudio — List, configure, and control Audinate Dante network audio devices.\n\n- Noson — Fast and smart controller for SONOS devices.\n\n- SonoBus — Application for streaming high-quality, low-latency peer-to-peer audio between devices over the internet or a local network.\n\n- Upplay — Qt-based UPnP audio control point.\n\n"
    },
    {
      "title": "Volume control",
      "level": 3,
      "content": "See also PulseAudio#Front-ends and JACK Audio Connection Kit#Comparison of JACK control GUIs.\n\n- alsamixer — Soundcard mixer for ALSA soundcard driver, with ncurses interface.\n\n- AlsaVolume — Tray ALSA volume changer written using gtkmm.\n\n- Emixer — Utility to control volume levels. Part of Enlightenment.\n\n- Gnome Alsamixer — ALSA mixer for GNOME.\n\n- GVolWheel — Audio mixer which lets you control the volume through a tray icon.\n\n- KMix — KDE volume control program. Part of kde-multimedia.\n\n- MATE Volume Control — Audio mixer application and system tray applet for MATE to mix audio and adjust volume levels of various audio mixer devices.\n\n- PNMixer — A fork of Obmixer. It has many new features such as ALSA channel selection, connect/disconnect detection, shortcuts, etc.\n\n- QasTools — Collection of desktop applications for the Linux sound system ALSA. It provides QasMixer (mixer), QasHctl (HCTL mixer) and QasConfig (configuration browser).\n\n- Retrovol — Retro-looking volume setting tray applet.\n\n- Volctl — Per-application system tray applet volume control and OSD for PulseAudio.\n\n- Volnoti — A lightweight volume notification daemon for GNU/Linux and other POSIX operating systems.\n\n- Volume Icon — Another volume control for your system tray with channel selection, themes and an external mixer.\n\n- Xfce ALSA Panel Plugin — Simple ALSA volume control plugin for Xfce4 panel.\n\n"
    },
    {
      "title": "CD ripping",
      "level": 3,
      "content": "See Optical disc drive#Audio CD.\n\n"
    },
    {
      "title": "Video players",
      "level": 3,
      "content": "See also Wikipedia:Comparison of video player software.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- FFplay — Very simple and portable media player using the FFmpeg libraries and the SDL library. It is mostly used as a testbed for the various FFmpeg APIs.\n\n- gst-play-1.0 — Simple command line playback testing tool for GStreamer.\n\n- MPlayer — Video player that supports a complete and versatile array of video and audio formats.\n\n- mpv — Movie player based on MPlayer and mplayer2.\n\n- VLC media player — Command-line version of the famous video player that can play smoothly high definition videos in the TTY. The rc interface can be launched with vlc -I rc, and the ncurses interface can be launched with vlc -I ncurses.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Cinema — Video player and manager for watching local video files.\n\n- Clapper — Media player built for the GNOME desktop environment using GTK4 toolkit and powered by GStreamer.\n\n- Glide — Simple and minimalistic media player relying on GStreamer for the multimedia support and GTK for the user interface.\n\n- GNOME Videos — Media player (audio and video) for the GNOME desktop that uses GStreamer. Part of gnome.\n\n- Identity — Program for comparing multiple versions of an image or video.\n\n- Movie Monad — Free and simple to use video player made with Haskell using GStreamer and GTK. Precompiled and no Haskell dependency in run-time.\n\n- Pantheon Videos — Video player and library designed for elementary OS using GStreamer.\n\n- Parole — Modern media player based on the GStreamer framework.\n\n- Rage — Video and audio player written with Enlightenment Foundation Libraries with some extra bells and whistles. Uses GStreamer\n\n- Showtime — Video player for GNOME.\n\n- Snappy — Powerful media player with a minimalistic interface that uses GStreamer.\n\n- Spivak — Karaoke player based on GStreamer and Qt5.\n\n- Baka MPlayer — Free and open source, cross-platform, mpv based multimedia player (Qt 5).\n\n- Bomi — bomi is a graphical user interface(GUI) player based on mpv for Linux.\n\n- Celluloid — Simple GTK frontend for mpv.\n\n- Deepin Movie — Movie player for Deepin desktop based on mpv.\n\n- Haruna Video Player — Qt/QML video player built on top of mpv.\n\n- Kawaii-Player — Audio/video manager and multimedia player (based on mpv) with PC-to-PC casting feature, along with functionalities of portable media server and torrent streaming server.\n\n- Media Player Classic Qute Theater — Clone of Media Player Classic reimplemented in Qt and based on mpv.\n\n- Minitube — YouTube desktop application written in C++ using mpv and Qt.\n\n- MoonPlayer — Video player for playing and downloading online videos from YouTube, Youku etc.\n\n- mpv — Very basic GUI for mpv. Can be launched with mpv --player-operation-mode=pseudo-gui.\n\n- mpvz — Qt5/QML based GUI for libmpv. Based on the Tethys theme for Bomi.\n\n- ImPlay — Cross-Platform Desktop Media Player, built on top of mpv and ImGui.\n\n- PlasmaTube — YouTube video player for KDE based on mpv and yt-dlp. Part of kde-multimedia.\n\n- SMPlayer — Qt multimedia player with extra features (CSS themes, YouTube integration, etc.) based on mpv. It can use MPlayer as alternative backend.\n\n- xt7-player-mpv — Qt/Gambas GUI to mpv with a rich set of configurable options including filters and drivers, ladspa plugins support as well as library/playlist management, YouTube, online radios, podcasts, DVB-T and more.\n\n- Clip — Video player and collection manager utilizing FFmpeg as the backend. Part of maui.\n\n- Dragon Player — Simple video player for KDE based on Phonon. Part of kde-multimedia.\n\n- Electronplayer — An application using the Electron framework. It is used for viewing Netflix, YouTube, Twitch, Floatplane, Hulu, Amazon Prime Video and more. Most notably to isolate the cookies from these websites from your main web browser.\n\n- FreeTube — Desktop YouTube player built with privacy in mind. Use YouTube without advertisements and prevent Google from tracking you with their cookies and JavaScript. Based on the Electron platform.\n\n- Gnome MPlayer — Simple GTK-based GUI for MPlayer.\n\n- Kaffeine — Very versatile KDE media player that, by default, utilizes VLC as its backend and has excellent support of digital TV (DVB-T, DVB-C, DVB-S).\n\n- Kodi — Media player and entertainment hub for digital media.\n\n- QMPlay2 — Qt based video player. It can play and stream all formats supported by FFmpeg and libmodplug. It has on integrated module system, which includes a YouTube browser.\n\n- QtAV Player — Simple media player based on QtAV and FFmpeg. Run with Player or QMLPlayer.\n\n- Stremio — Extensible media center.\n\n- tvtime — High quality television application for use with video capture cards.\n\n- VLC media player — Middleweight video player with support for a wide variety of audio and video formats.\n\n- xine — Free multimedia player.\n\n- Xjadeo — Video player that displays a video-clip in sync with an external time source (MTC, LTC, JACK-transport).\n\n- YUView — Qt-based YUV player with an advanced analytic toolset.\n\n"
    },
    {
      "title": "Video converters",
      "level": 3,
      "content": "See also Wikipedia:Comparison of video converters and Codecs and containers#Container format tools.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "- Avidemux CLI — Free video editor designed for simple cutting, filtering and encoding tasks.\n\n- FFmpeg — Complete, cross-platform solution to record, convert and stream audio and video.\n\n- HandBrake CLI — Simple yet powerful video transcoder ideal for batch mkv/x264 ripping.\n\n- MEncoder — Free command line video decoding, encoding and filtering tool.\n\n- Transcode — Command line tool for video stream processing.\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- Ciano — Simple multimedia file converter using FFmpeg and ImageMagick.\n\n- FF Multi Converter — Simple graphical application which enables you to convert audio, video, image and document files between all popular formats, by utilizing other command-line tools.\n\n- HandBrake — Simple yet powerful video transcoder ideal for batch mkv/x264 ripping. GTK version.\n\n- QWinFF — Qt5 GUI for FFmpeg that can read audio and video files in various formats and convert them into other formats.\n\n- Transmageddon — Simple python application for transcoding video into formats supported by GStreamer.\n\n- WinFF — Graphical video and audio batch converter using FFmpeg.\n\n"
    },
    {
      "title": "Video editors",
      "level": 3,
      "content": "See also Wikipedia:Comparison of video editing software.\n\n- Avidemux — Free video editor designed for simple cutting, filtering and encoding tasks.\n\n- Blender — Fully integrated 3D graphics creation suite with a built-in non-linear video editor.\n\n- Cinelerra (Community Version) — Advanced video editing and compositing environment.\n\n- Cinelerra GG Infinity — Professional video editing and compositing environment.\n\n- DaVinci Resolve — Proprietary A/V post-production software suite.\n\n- Flowblade — Multitrack non-linear video editor for Linux, designed to provide a fast, robust editing experience.\n\n- Kdenlive — Non-linear video editor designed for basic to semi-professional work. Part of kde-multimedia.\n\n- Lightworks — Professional proprietary non-linear editing system for editing and mastering digital video in various formats.\n\n- LiVES — Video editor and VJ (live performance) platform.\n\n- LosslessCut — GUI tool for lossless trimming/cutting of video/audio files. Based on the Electron platform.\n\n- Natron — Open-source compositing software. Node-graph based. Similar in functionalities to Adobe After Effects and Nuke by The Foundry.\n\n- Olive — Non-linear video editor aiming to provide a fully-featured alternative to high-end professional video editing software.\n\n- OpenShot — Non-linear video editor based on MLT framework.\n\n- Pitivi — Video editor designed to be intuitive and integrate well in the GNOME desktop.\n\n- Shotcut — Shotcut is a free, open source, cross-platform video editor.\n\n- V2Mixer — free cross-platform movie editor,mixer\n\n- VapourSynth Editor — Editor for VapourSynth scripts.\n\n- VidCutter — Fast lossless media cutter + joiner w/ frame-accurate SmartCut options powered by mpv, FFmpeg via a sleek Qt5 GUI.\n\n- Video Trimmer — Cut out a fragment of a video given the start and end timestamps. The video is never re-encoded, so the process is very fast and does not reduce the video quality.\n\n"
    },
    {
      "title": "Subtitle players",
      "level": 4,
      "content": "- Penguin Subtitle Player — Standalone subtitle player that provides a translucent window which always stays on the top so subtitles can be shown on top of the video without blocking anything.\n\n- SubtitlesPrinter — Print subtitles above an X-screen, independently of the video player.\n\n"
    },
    {
      "title": "Subtitle downloaders",
      "level": 4,
      "content": "- QNapi — Qt client for downloading movie subtitles from NapiProjekt, OpenSubtitles, Napisy24.\n\n- subliminal — Python library and command-line tool to search and download subtitles from different providers (opensubtitles.com, addic7ed.com, ...).\n\n- subdl — Command-line tool for downloading subtitles from opensubtitles.org.\n\n"
    },
    {
      "title": "Subtitle editors",
      "level": 4,
      "content": "See also Wikipedia:Comparison of subtitle editors.\n\n- Aegisub — Subtitle editor.\n\n- Gaupol — Full-featured subtitle editor.\n\n- Gnome Subtitles — Video subtitle editor for GNOME.\n\n- Jubler — Open-source multiplatform subtitle editor written in Java.\n\n- Subtitle Composer — Subtitle editor for KDE supporting various formats, features different player backends, able to display wave form.\n\n- Subtitle Edit — Subtitle editing program. Written in C# using mono.\n\n- Subtitle Editor — GTK 3 tool to edit subtitles for GNU/Linux/*BSD.\n\n"
    },
    {
      "title": "Screencast",
      "level": 3,
      "content": "See Screen capture#Screencast software.\n\n"
    },
    {
      "title": "Miracast",
      "level": 3,
      "content": "Miracast is a standard for wireless connections from sending devices to display receivers mainly using Wi-Fi Direct. Use iw dev to check your hardware support. Use iw reg get to make sure the regulatory domain is not set to \"Global\", as that might block some functionality.\n\n- GNOME Network Displays — GTK application to cast your desktop to a remote display. Not specific to the GNOME environment, depends on PipeWire.\n\n- MiracleCast — Command line tools to connect external monitors to your system via Wi-Fi Display specification also known as Miracast.\n\n"
    },
    {
      "title": "Webcam",
      "level": 3,
      "content": "See also FFmpeg#Recording webcam and Wikipedia:Comparison of webcam software.\n\n- Booth — A convergent camera app.\n\n- cameractrls — Command line and graphical application for configuring v4l2 devices.\n\n- Cheese — Take photos and videos with your webcam, with fun graphical effects. Part of gnome-extra.\n\n- Deepin Camera — Tool to view camera, take photo and video.\n\n- fswebcam — Small and simple command line webcam software that generates images for a webcam.\n\n- GNOME Camera — Take pictures and videos. Part of gnome.\n\n- Guvcview — Simple interface for capturing and viewing video from v4l2 devices.\n\n- Kamoso — Webcam recorder from KDE community. Part of kde-multimedia.\n\n- MJPG-streamer — Command line application which can be used to stream M-JPEG over an IP-based network from a webcam to various types of viewers.\n\n- Motion — Highly configurable program that monitors video signals from many types of cameras. It is able to detect if a significant part of the picture has changed; in other words, it can detect motion.\n\n- Pantheon Camera — Camera application designed for elementary OS.\n\n- QtCAM — Webcam software with more than 10 image control settings, extension settings and color space switching.\n\n- v4l2loopback — Kernel module that allows to create virtual video (v4l2) devices. This can be used to create virtual webcams with video passed by programs like FFmpeg.\n\n- v4l2ucp — Universal control panel for V4L2 devices.\n\n- v4l-utils — Provides a series of utilities for media devices.\n\n- Webcamoid — Full featured webcam suite.\n\n"
    },
    {
      "title": "DVD authoring",
      "level": 3,
      "content": "See also Wikipedia:List of DVD authoring applications.\n\n- Bombono DVD — DVD authoring program with nice and clean GUI.\n\n- Devede — Program to create VideoDVDs and CDs.\n\n- DVDStyler — DVD authoring application for the creation of professional-looking DVDs.\n\n"
    },
    {
      "title": "DVD ripping",
      "level": 3,
      "content": "See Optical disc drive#DVD-Video.\n\n"
    },
    {
      "title": "Video thumbnails",
      "level": 3,
      "content": "- vcsi — Create video contact sheets. A video contact sheet is an image composed of video capture thumbnails arranged on a grid.\n\n- Video Contact Sheet — Bash script meant to create video contact sheets (previews) of videos. Any video supported by mplayer and ffmpeg can be used.\n\n"
    },
    {
      "title": "Personal video recorders",
      "level": 3,
      "content": "- MythTV — A homebrew PVR project.\n\n"
    },
    {
      "title": "Collection managers",
      "level": 2,
      "content": "- GCstar — Application for organizing various collections (board games, comic books, movies, stamps, etc.).\n\n- Griffith — Movie collection manager application.\n\n- MediaElch — Media manager for Kodi. Information about movies, TV shows, concerts and music are stored as nfo files.\n\n- Tellico — KDE application for organizing various collections (books, video, music, coins, etc.).\n\n- tinyMediaManager — Media management tool to provide metadata for Kodi.\n\n"
    },
    {
      "title": "Media servers",
      "level": 2,
      "content": "- Airsonic — Web-based media streamer, providing ubiquitous access to your music. (Fork of Subsonic.)\n\n- DMS — A UPnP DLNA Digital Media Server that includes basic video transcoding (thus with minimum dependencies).\n\n- Emby — Proprietary media server, which automatically converts and streams your media on-the-fly to play on any device.\n\n- Gerbera — UPnP Media Server to stream your media to devices on your home network. (Fork of MediaTomb.)\n\n- Icecast — Streaming media (audio/video) server which currently supports Ogg (Vorbis and Theora), Opus, WebM and MP3 streams.\n\n- Jellyfin — Media system that puts you in control of managing and streaming your media.\n\n- OwnTone — DAAP (iTunes) and MPD media server with support for AirPlay devices, Apple Remote, Chromecast, Spotify and internet radio.\n\n- Plex — Proprietary media server, which organizes your personal video, music, and photo collections and streams them to all of your devices.\n\n- ReadyMedia — Simple media server software, with the aim of being fully compliant with DLNA/UPnP-AV clients.\n\n- Rygel — UPnP AV MediaServer and MediaRenderer that allows you to easily share audio, video and pictures, and control of media player on your home network. Part of gnome.\n\n- Serviio — Proprietary media server, which allows you to stream your media files (music, video or images) to renderer devices (e.g. a TV set, Bluray player, games console or mobile phone) on your connected home network.\n\n- Subsonic — Proprietary media server to stream from your own computer.\n\n- Tvheadend — TV streaming server and recorder supporting DVB-S, DVB-S2, DVB-C, DVB-T, ATSC, ISDB-T, IPTV, SAT>IP and HDHomeRun as input sources.\n\n- Universal Media Server — UPnP media server, which is capable of sharing video, audio and images between most modern devices. (Fork of PS3 Media Server.)\n\n"
    },
    {
      "title": "Metadata",
      "level": 2,
      "content": "- CoreInfo — Simple media metadata viewer built on mediainfo library. Part of C-Suite.\n\n- DV Analyzer — Technical quality control and reporting tool that examines DV streams in order to report errors.\n\n- ExifTool — Command-line application for reading, writing and editing meta information in a wide variety of files.\n\n- ExifCleaner — Desktop app to clean metadata from images, videos, PDFs, and other files.\n\n- Exiv2 — Command line utility to manage image metadata. It provides fast and easy read and write access to the Exif, IPTC and XMP metadata and the ICC Profile embedded within digital images in various formats.\n\n- ffprobe — Gather information from multimedia streams and print it in human- and machine-readable fashion.\n\n- jExifToolGUI — Java/Swing graphical frontend for ExifTool, which reads and writes all kind of metadata tags from/to image files.\n\n- jhead — Exif jpeg header manipulation tool.\n\n- mat2 — Metadata removal tool, supporting a wide range of commonly used file formats.\n\n- MediaConch — Implementation checker, policy checker, reporter, and fixer.\n\n- MediaInfo — Convenient unified display of the most relevant technical and tag data for video and audio files.\n\n- Metadata Cleaner — Python GTK application to view and clean metadata in files, using mat2.\n\n- sndfile-info — Obtaining information about the contents of an audio file.\n\n"
    },
    {
      "title": "Mobile device managers",
      "level": 2,
      "content": "- Android 2 Linux Notifications — Display your Android phone notifications on your desktop using a LAN connection.\n\n- Android File Transfer — Interactive Media Transfer Protocol client with Qt5 GUI.\n\n- gMTP — Simple MP3 and media player client for Media Transfer Protocol.\n\n- gnokii — Tools and user space driver for use with mobile phones.\n\n- gtkpod — GUI for Apple's iPod using GTK. It allows you to import your existing iTunes database, add songs, podcasts, videos and cover art, and to edit ID3 tags.\n\n- KDE Connect — Provides integration between devices. Part of kde-network.\n\n- Modem Manager GUI — Control EDGE/3G/4G broadband modem specific functions.\n\n- Phone Manager — Control your mobile phone from your GNOME desktop.\n\n- Sachesi — Firmware, extractor, searcher and installer for Blackberry 10.\n\n- Ttwatch — Linux TomTom GPS Watch Utilities.\n\n- Wammu — Manage data in your cell phone such as contacts, calendar or messages.\n\n"
    },
    {
      "title": "TV guide",
      "level": 2,
      "content": "- Telly Skout — Convergent TV guide based on Kirigami.\n\n- TV-Browser — Java-based TV guide which is easily extensible using plugins.\n\n- XMLTV — Set of utilities to download TV listings and format them in XML.\n\n"
    },
    {
      "title": "Optical disc burning",
      "level": 2,
      "content": "See Optical disc drive#Burning CD/DVD/BD with a GUI.\n\n"
    }
  ]
}