{
  "title": "List of applications (Polski)/Science (Polski)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Polski)/Science_(Polski)",
  "sections": [
    {
      "title": "Kalkulator",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of software calculators.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- bc — Język kalkulatorów o dowolnej precyzji.\n\n- calc — Kalkulator konsolowy o dowolnej precyzji.\n\n- clac — Konsolowy kalkulator oparty na stosie z notacją postfiksową.\n\n- kalker — Kalkulator wiersza poleceń ze składnią matematyczną obsługującą zmienne i funkcje zdefiniowane przez użytkownika, liczby zespolone oraz szacowanie pochodnych i całek.\n\n- qalc — Kalkulator wiersza poleceń i narzędzie do rozwiązywania równań z odpornym na błędy parsowaniem, rozpoznawaniem stałych i jednostek.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Deepin Calculator — Łatwy w użyciu kalkulator dla Deepin desktop.\n\n- Extcalc — Naukowy kalkulator graficzny oparty na Qt.\n\n- FOX Calculator — Prosty kalkulator biurkowy.\n\n- galculator — Kalkulator naukowy oparty na GTK.\n\n- Genius — Zaawansowany kalkulator zawierający matematyczny język programowania.\n\n- GNOME Calculator — Kalkulator naukowy dostępny w środowisku GNOME. Część gnome.\n\n- KAlgebra — Kalkulator i ploter 3D. Część kde-education.\n\n- Kalk — Aplikacja kalkulatora konwergentnego zbudowana przy użyciu frameworka Kirigami. Część kde-utilities.\n\n- KCalc — Kalkulator naukowy dołączony do pulpitu KDE. Część kde-utilities.\n\n- KEuroCalc — Uniwersalny przelicznik i kalkulator walut.\n\n- Liri Calculator — Kalkulator dla Liri.\n\n- MATE Calc — Kalkulator dla środowiska graficznego MATE.\n\n- Qalculate! — Kalkulator i narzędzie do rozwiązywania równań z odpornym na błędy parsowaniem, rozpoznawaniem stałych i jednostek.\n\n- SpeedCrunch — Szybki, precyzyjny i wydajny kalkulator wieloplatformowy.\n\n- xcalc — Kalkulator naukowy dla X z trybami notacji algebraicznej i odwrotnej notacji polskiej.\n\n"
    },
    {
      "title": "Komputerowy system algebry",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of computer algebra systems.\n\n- AXIOM — FriCAS: pochodna potężnego AXIOM-CAS\n\n- GAP — System algebry komputerowej do obliczeniowej algebry dyskretnej ze szczególnym uwzględnieniem obliczeniowej teorii grup.\n\n- Maple — Słynny komercyjny CAS. Często używany w edukacji.\n\n- Mathics — Darmowy CAS do symbolicznych obliczeń matematycznych, wykorzystujący Pythona jako swój główny język. Jego celem jest osiągnięcie składni i funkcji kompatybilnych z Mathematica. Opiera się głównie na Sympy dla większości zadań matematycznych i, opcjonalnie, Sage dla bardziej zaawansowanych funkcji.\n\n- Mathomatic — Komputerowy system algebry ogólnego przeznaczenia napisany w języku C.\n\n- Maxima — System algebry komputerowej podobny do Maple/Mathematica.\n\n- PARI/GP — System algebry komputerowej przeznaczony do szybkich obliczeń w teorii liczb.\n\n- Singular — System algebry komputerowej do obliczeń wielomianowych, ze szczególnym naciskiem na algebrę przemienną i nieprzemienną, geometrię algebraiczną i teorię osobliwości.\n\n- wxMaxima — Graficzny interfejs użytkownika dla Maxima, potężnego systemu algebry komputerowej.\n\n- Xcas — Interfejs użytkownika do Giac, darmowego, podstawowego systemu algebry komputerowej.\n\n"
    },
    {
      "title": "Wizualizacja sieci/wykresów",
      "level": 3,
      "content": "- Glue — Połączone wizualizacje danych w wielu plikach.\n\n- Graphviz — Narzędzie o ugruntowanej pozycji do wyświetlania małych wykresów w 2D.\n\n"
    },
    {
      "title": "Obliczenia naukowe lub techniczne",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of numerical analysis software.\n\n- Cadabra — Podejście do algebry komputerowej oparte na teorii pola.\n\n- Cantor — Aplikacja umożliwiająca korzystanie z ulubionych aplikacji matematycznych z poziomu ładnego, zintegrowanego z KDE interfejsu arkusza. Część kde-education.\n\n- FFTW — Biblioteka Fast Fourier Transform do obliczania dyskretnych transformat Fouriera. Używana w wielu różnych zastosowaniach numerycznych, w tym w metodach spektralnych.\n\n- FreeMat — Program podobny do Matlaba, który obsługuje wiele jego funkcji i oferuje bezkodowy interfejs do zewnętrznego kodu C, C++ i Fortran, dalsze równoległe tworzenie algorytmów rozproszonych (za pośrednictwem MPI) oraz możliwości wizualizacji 3D.\n\n- GeoGebra — Dynamiczne oprogramowanie matematyczne z interaktywną grafiką, algebrą i arkuszem kalkulacyjnym\n\n- Julia — Wysokopoziomowy, wysokowydajny dynamiczny język do obliczeń technicznych.\n\n- Kig — Aplikacja do geometrii interaktywnej. Część kde-education.\n\n- matplotlib (PyLab) — Zbiór modułów Pythona (pyplot, numpy itp.) używanych do obliczeń naukowych.\n\n- Octave — Język i interfejs podobny do MATLAB do obliczeń numerycznych.\n\n- SageMath — System oprogramowania matematycznego, który łączy wiele istniejących pakietów opensource we wspólny interfejs Pythona. Alternatywa dla programów Magma, Maple, Mathematica i Matlab.\n\n- Scilab — Alternatywa dla Matlaba używana do obliczeń numerycznych. Jego składnia nie jest równoważna składni Matlaba, ale można ją łatwo przekonwertować.\n\n"
    },
    {
      "title": "Statystyka",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of statistical packages.\n\n- gretl — Wieloplatformowy pakiet oprogramowania do analizy ekonometrycznej, napisany w języku programowania C.\n\n- JAGS (Just another Gibbs sampler) — Wieloplatformowy program do analizy bayesowskich modeli hierarchicznych przy użyciu symulacji MCMC (Markov Chain Monte Carlo).\n\n- jamovi — Pakiet statystyczny, który jest łatwy w użyciu i zaprojektowany tak, aby był znany użytkownikom SPSS. Oparty na platformie Electron.\n\n- Python Data Analysis Library (pandas) — Dostarczanie wysokowydajnych, łatwych w użyciu struktur danych i narzędzi do analizy danych w języku programowania Python.\n\n- PSPP — Wolna (free) implementacja SPSS.\n\n- R — Środowisko oprogramowania do obliczeń statystycznych i grafiki.\n\n- RKWard — Frontend dla języka statystycznego R.\n\n- RStudio — Potężne i wydajne IDE dla R napisane w Qt.\n\n"
    },
    {
      "title": "Analiza danych i tworzenie wykresów",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with List of Applications#Scientific and technical computing.** This article or section is a candidate for merging with List of Applications#Scientific and technical computing.\n\nThis article or section is a candidate for merging with List of Applications#Scientific and technical computing.\n\nZobacz także Wikipedia:List of information graphics software.\n\n- AlphaPlot — Aplikacja do analizy i wizualizacji danych naukowych, fork SciDAVis / QtiPlot.\n\n- DataWarrior — Program do wizualizacji i analizy danych o otwartym kodzie źródłowym z wbudowaną inteligencją chemiczną.\n\n- Engauge Digitizer — Wyodrębnia punkty danych z obrazów wykresów.\n\n- Fityk — Aplikacja do dopasowywania krzywych i analizy danych, używana głównie do dopasowywania analitycznych funkcji w kształcie dzwonu do danych eksperymentalnych.\n\n- Gnuplot — Program konsolowy, który może generować wykresy 2D i 3D funkcji, danych i dopasowań danych.\n\n- Grace — Narzędzie WYSIWYG do tworzenia wykresów 2D.\n\n- KmPlot — Program do rysowania wykresów, ich całek i pochodnych. Część kde-education.\n\n- LabPlot — Bezpłatna aplikacja do analizy i wizualizacji danych, podobna do SciDAVis.\n\n- OVITO (Open Visualization Tool) — Rozwiązanie do wizualizacji i analizy danych naukowych dla symulacji opartych na cząsteczkach.\n\n- Plots — Program do tworzenia wykresów dla środowiska GNOME.\n\n- Rocs — Graph Theory IDE dla wszystkich zainteresowanych projektowaniem i analizą algorytmów grafowych (np. wykładowców, studentów, badaczy). Część kde-education.\n\n- ROOT — Program do analizy danych i biblioteka (pierwotnie dla fizyki cząstek elementarnych) opracowane przez CERN.\n\nZobacz także List of applications (Polski)/Documents (Polski)#Arkusze kalkulacyjne.\n\n"
    },
    {
      "title": "Systemy wspomagające dowodzenie twierdzeń",
      "level": 3,
      "content": "Zobacz także Wikipedia:pl:System wspomagający dowodzenie twierdzeń.\n\n- Agda — Zależnie typowany funkcjonalny język programowania i asystent dowodu. Jest to interaktywny system do pisania i sprawdzania dowodów.\n\n- Coq — Formalny system zarządzania dowodami. Zapewnia formalny język do pisania definicji matematycznych, wykonywalnych algorytmów i twierdzeń wraz ze środowiskiem do półinteraktywnego opracowywania dowodów sprawdzanych maszynowo.\n\n- Isabelle — Ogólny asystent dowodu, który umożliwia wyrażanie formuł matematycznych w języku formalnym i zapewnia narzędzia do dowodzenia tych formuł w rachunku logicznym.\n\n- Lean Theorem Prover — Asystent dowodu opracowany głównie przez Leonardo de Moura w Microsoft Research, używany w połączeniu z biblioteką matematyczną Lean.\n\n"
    },
    {
      "title": "Narzędzia",
      "level": 3,
      "content": "- Geiger Counter Logger — Jest to lekki demon działający w tle i stale raportujący odczyty licznika Geigera do różnych witryn monitorujących promieniowanie\n\n- GWtool — Proste narzędzia do pracy z falami grawitacyjnymi\n\n- JaxoDraw — Program fizyki cząstek elementarnych do rysowania diagramów Feynmana.\n\n- InterSpec — Oprogramowanie do analizy promieniowania spektralnego\n\n- Libint — Wysokowydajna biblioteka do obliczania całek gaussowskich w mechanice kwantowej\n\n- Pysolar — Zbiór bibliotek Pythona do symulacji napromieniowania dowolnego punktu na Ziemi przez Słońce. Zawiera kod do niezwykle precyzyjnych obliczeń efemeryd.\n\n- Silx — Zbiór pakietów Python do analizy danych w ośrodkach promieniowania synchrotronowego.\n\n"
    },
    {
      "title": "Symulacja fizyki",
      "level": 3,
      "content": "- Calculix — Trójwymiarowy program strukturalnych elementów skończonych.\n\n- DFTB+ — Pakiet oprogramowania do symulacji mechaniki kwantowej oparty na metodzie DFTB\n\n- EPANET — EPANET przeprowadza symulację ruchu i jakości wody w sieciach rur pod ciśnieniem w dłuższym okresie czasu.\n\n- Elmer_FEM_solver — Oprogramowanie do analizy elementów skończonych (MES/FEM) dla problemów wielofizycznych. Obejmuje modele dynamiki płynów, mechaniki strukturalnej, elektromagnetyki, wymiany ciepła i akustyki.\n\n- FEniCS — Platforma obliczeniowa o otwartym kodzie źródłowym do rozwiązywania równań różniczkowych cząstkowych, umożliwiająca użytkownikom szybkie tłumaczenie modeli naukowych na wydajny kod elementów skończonych za pomocą wysokopoziomowych interfejsów Python i C++, które skalują się na różnych platformach, od laptopów po wysokowydajne klastry.\n\n- Finesse — Oprogramowanie do symulacji interferometru w dziedzinie częstotliwości\n\n- Geant4 — Zestaw narzędzi do symulacji oddziaływań fizyki cząstek elementarnych.\n\n- ONELAB/Gmsh — Otwarty, lekki interfejs do oprogramowania elementów skończonych, domyślnie zawierający generator siatki Gmsh, solver elementów skończonych GetDP i bibliotekę optymalizacji conveks.\n\n- Herwig — Herwig to wielofunkcyjny generator zdarzeń fizyki cząstek elementarnych.\n\n- Netgen/NGSolve — Wysokowydajne oprogramowanie wielofizycznych elementów skończonych z elastycznym interfejsem Python do łatwej implementacji nowych równań fizycznych i algorytmów rozwiązań.\n\n- OpenFOAM — Pakiet oprogramowania i zestaw narzędzi do obliczeniowej dynamiki płynów (CFD).\n\n- OpenLoops 2 — Pakiet fizyki cząstek do szybkiej numerycznej oceny elementów macierzy drzewa i jednej pętli.\n\n- QuTiP — QuTiP to oprogramowanie typu opensource do symulacji dynamiki otwartych systemów kwantowych\n\n- Rivet — Pakiet fizyki cząstek elementarnych do analizy danych i walidacji generatorów zdarzeń Monte Carlo\n\n- Speaq — Narzędzia do wyrównywania widm magnetycznego rezonansu jądrowego (NMR), przetwarzania opartego na pikach, analizy ilościowej i wizualizacji\n\n- SWMM — Storm Water Management Model to dynamiczny model symulacji spływu powierzchniowego i opadowego wykorzystywany do symulacji ilości i jakości hydrologii powierzchniowej/podpowierzchniowej.\n\n- Sherpa — Pakiet fizyki cząstek do symulacji Monte Carlo zdarzeń w zderzaczach.\n\n- Step — Dwuwymiarowy silnik symulacji fizyki. Część kde-education.\n\n- VESTA — Program do wizualizacji 3D modeli strukturalnych, danych objętościowych, takich jak gęstości elektronowe/jądrowe i morfologie kryształów.\n\n- WHIZARD — Generator zdarzeń Monte Carlo dla Tevatronu, LHC, ILC, CLIC, CEPC, FCC-ee, FCC-hh, SppC i innych eksperymentów fizyki wysokich energii.\n\n"
    },
    {
      "title": "Zamiana jednostek",
      "level": 3,
      "content": "- ConvertAll — Aplikacja do konwersji jednostek, która pozwala łączyć jednostki w dowolny sposób (np. cale na dekadę), nawet jeśli nie ma to sensu.\n\n- fend — Kalkulator uwzględniający jednostki o dowolnej precyzji.\n\n- Gonvert — Narzędzie do konwersji, które umożliwia konwersję między wieloma jednostkami, takimi jak CGS, Ancient, Imperial z wieloma kategoriami, takimi jak długość, masa, liczby itp.\n\n- Numbat — Statycznie typowany język programowania do obliczeń naukowych z pierwszorzędną obsługą wymiarów i jednostek fizycznych.\n\n- Rink — Narzędzie do konwersji jednostek i biblioteka napisana w języku Rust. Może być używane do obliczeń fizycznych i inżynieryjnych, a także do analizy wymiarowości.\n\n- UDUNITS — Narzędzie do obliczania wielkości fizycznych.\n\n- Units — Konwerter jednostek i kalkulator konsolowy, który może obsługiwać mnożnikowe zmiany skali, nieliniowe konwersje, takie jak Fahrenheita na Celsjusza lub miernik drutu i inne.\n\n"
    },
    {
      "title": "Chemia",
      "level": 2,
      "content": "- TCcalc — Podstawowy kalkulator CLI termodynamiki chemicznej. Umożliwia obliczanie delta S i H reakcji/zmian stanu.\n\n"
    },
    {
      "title": "Przeglądarki",
      "level": 4,
      "content": "Zobacz także Wikipedia:List of molecular graphics systems.\n\n- Avogadro — Edytor, przeglądarka i symulator struktur cząsteczek 3D (obsługuje również pobieranie plików z Protein Data Bank).\n\n- Ghemical — Pakiet oprogramowania do chemii obliczeniowej używany do edycji, przeglądania i symulacji struktur molekularnych.\n\n- PyMOL — System wizualizacji molekularnej o otwartym kodzie źródłowym, który może tworzyć wysokiej jakości obrazy 3D małych cząsteczek i makrocząsteczek biologicznych, takich jak białka.\n\n- UCSF Chimera — Rozszerzalny system modelowania molekularnego.\n\n- UCSF ChimeraX — Program do wizualizacji molekularnej nowej generacji, wzorowany na UCSF Chimera.\n\n- VMD — VMD to program do wizualizacji molekularnej służący do wyświetlania, animowania i analizowania dużych systemów biomolekularnych przy użyciu grafiki 3D i wbudowanych skryptów.\n\n- wxMacMolPlt — GUI o otwartym kodzie źródłowym do przygotowywania, przesyłania i wizualizacji danych wejściowych i wyjściowych dla pakietu chemii kwantowej GAMESS.\n\n"
    },
    {
      "title": "Rysowanie",
      "level": 4,
      "content": "- Chemtool — Oparty na GTK program do rysowania chemicznych wzorów strukturalnych.\n\n- Gabedit — Graficzny interfejs użytkownika do pakietów chemii obliczeniowej, takich jak GAMESS, Gaussian, MOLCAS, MOLPRO, MPQC, OpenMopac, Firefly (wcześniej PC GAMESS) i Q-Chem.\n\n"
    },
    {
      "title": "Modelowanie",
      "level": 4,
      "content": "- AmberTools — AmberTools składa się z kilku niezależnie opracowanych pakietów, które działają dobrze zarówno samodzielnie, jak i z samym Amber18. Pakiet może być również wykorzystywany do przeprowadzania kompletnych symulacji dynamiki molekularnej, z wykorzystaniem jawnych modeli wody lub uogólnionych modeli rozpuszczalnika Borna.\n\n- APBS — Właściwości elektrostatyczne i solwatacyjne dla złożonych cząsteczek.\n\n- COPASI — COmplex PAthway SImulator do analizy sieci biochemicznych i ich dynamiki.\n\n- CP2K — Pakiet oprogramowania do chemii kwantowej i fizyki ciała stałego.\n\n- Fpocket — Fpocket to bardzo szybki algorytm wykrywania kieszeni białkowych oparty na teselacji Voronoi.\n\n- GROMACS (GROningen MAchine for Chemical Simulations) — Wszechstronny pakiet do wykonywania dynamiki molekularnej, tj. symulacji newtonowskich równań ruchu dla układów zawierających od setek do milionów cząstek.\n\n- LAMMPS — Wielkoskalowy masowo równoległy symulator atomowy/molekularny.\n\n- MODELLER — Modeler homologii struktury 3D.\n\n- NAMD — NAMD to równoległy kod dynamiki molekularnej przeznaczony do wysokowydajnej symulacji dużych układów biomolekularnych.\n\n- NWChem — Pakiet oprogramowania do chemii obliczeniowej ab initio.\n\n- Open Babel — Biblioteka zaprojektowana do konwersji wielu formatów plików używanych w modelowaniu molekularnym i chemii obliczeniowej.\n\n- ORCA — ORCA to pakiet ab initio, DFT i półempiryczny SCF-MO.\n\n- PDB2PQR — Właściwości elektrostatyczne i solwatacyjne dla złożonych cząsteczek.\n\n- PLUMED — Wtyczka opensource do obliczeń energii swobodnej w układach molekularnych, która współpracuje z niektórymi z najpopularniejszych silników dynamiki molekularnej.\n\n- PMEMD — Moduł PMEMD pakietu oprogramowania AMBER.\n\n- PSI4 — Chemia kwantowa o otwartym kodzie źródłowym\n\n- Quantum ESPRESSO — Zintegrowany pakiet aplikacji do obliczeń struktury elektronowej i modelowania materiałów w nanoskali. Opiera się na teorii funkcjonału gęstości, falach płaskich i pseudopotencjałach (zarówno zachowujących normę, jak i ultra miękkich).\n\n- RDKit — Zbiór oprogramowania do cheminformatyki i uczenia maszynowego napisanego w językach C++ i Python.\n\n- rDock — Szybki, wszechstronny i otwarty program do dokowania ligandów do białek i kwasów nukleinowych.\n\n- smina — Smina to fork Autodock Vina, który koncentruje się na poprawie punktacji i minimalizacji.\n\n"
    },
    {
      "title": "Analiza symulacji",
      "level": 3,
      "content": "- mdanalysis — Zorientowany obiektowo zestaw narzędzi Python do analizy trajektorii dynamiki molekularnej w wielu popularnych formatach.\n\n- MDTraj — Nowoczesna, otwarta biblioteka do analizy trajektorii dynamiki molekularnej.\n\n- xdrfile — Umożliwia odczyt plików GROMACS trr i xtc, a także konwersję z jednego formatu na inny.\n\n"
    },
    {
      "title": "Układ okresowy",
      "level": 3,
      "content": "- eperiodique — Prosta przeglądarka układu okresowego pierwiastków wykorzystująca EFL.\n\n- gElemental — Układ okresowy pierwiastków z dodatkowymi informacjami.\n\n- Kalzium — Układ okresowy pierwiastków z edytorem cząsteczek i rozwiązaniem równań. Część kde-education.\n\n"
    },
    {
      "title": "Klimatologia",
      "level": 3,
      "content": "- Climate Data Operators — Konsolowe narzędzie do manipulowania i analizowania danych modelu klimatycznego. Obsługiwane formaty danych to GRIB, netCDF, SERVICE, EXTRA i IEG.\n\n"
    },
    {
      "title": "Kartografia",
      "level": 4,
      "content": "- JOSM — Główny edytor dla OpenStreetMap napisany w Javie.\n\n- Merkaartor — Edytor OpenStreetMap.\n\n- OpenOrienteering Mapper — Program do tworzenia map na orientację.\n\n- Phyghtmap — Generowanie linii konturowych OSM z danych NASA SRTM\n\n"
    },
    {
      "title": "GPS, podróż, śledzenie",
      "level": 4,
      "content": "- BT747 — Zestaw narzędzi dla rejestratorów GPS MTK.\n\n- FoxtrotGPS — Lekka i szybka aplikacja do mapowania.\n\n- Gebabbel — Alternatywny graficzny interfejs użytkownika dla GPSBabel.\n\n- Gpredict — Aplikacja do śledzenia satelitów i przewidywania orbit w czasie rzeczywistym.\n\n- GPSBabel — Odczytuje, zapisuje i manipuluje punktami trasy GPS, śladami i trasami w różnych formatach.\n\n- gpsd — Demon serwisowy, który monitoruje jeden lub więcej odbiorników GPS lub AIS podłączonych do komputera hosta za pośrednictwem portów szeregowych lub USB, udostępniając wszystkie dane dotyczące lokalizacji / kursu / prędkości czujników do zapytania na porcie TCP 2947 komputera hosta.\n\n- GpsPrune — Przeglądaj, edytuj i konwertuj dane współrzędnych z systemów GPS.\n\n- GPX Viewer — Proste narzędzie do wizualizacji ścieżek i punktów trasy zapisanych w pliku gpx.\n\n- GPXSee — Przeglądarka i analizator plików dziennika GPS.\n\n- Navit — Modułowy system nawigacji samochodowej turn-by-turn.\n\n- PreviSat — PreviSat to oprogramowanie do śledzenia satelitów do celów obserwacyjnych\n\n- QMapShack — Zaplanuj następną wycieczkę na świeżym powietrzu.\n\n- Railway — Podróże koleją, rozkład jazdy pociągów i trasy pociągów\n\n- Satellite — Wyświetla informacje Globalnego Systemu Nawigacji Satelitarnej (GNSS: GPS, Galileo, Glonass itp.) uzyskane ze źródeł NMEA i zapisuje trasy\n\n- Subsurface — Dziennik nurkowania umożliwiający śledzenie nurkowań poprzez rejestrowanie lokalizacji nurkowania (ze współrzędnymi GPS), zastosowanych balastów i zabezpieczeń, divemasterów i partnerów nurkowych itp.\n\n- Viking — Aplikacja GTK 2 do zarządzania danymi GPS.\n\n"
    },
    {
      "title": "Analiza danych i GIS",
      "level": 4,
      "content": "- GeoDa — Narzędzie do analizy danych przestrzennych.\n\n- GRASS GIS — Zarządzanie i analiza danych geoprzestrzennych, przetwarzanie obrazów, tworzenie grafik/map, modelowanie przestrzenne i wizualizacja.\n\n- gvSIG — vSIG to system informacji geograficznej (GIS), czyli aplikacja desktopowa przeznaczona do przechwytywania, przechowywania, obsługi, analizowania i wdrażania wszelkiego rodzaju informacji geograficznych w celu rozwiązywania złożonych problemów związanych z zarządzaniem i planowaniem.\n\n- Panoply — Przeglądarka danych NetCDF, HDF i GRIB firmy NASA GISS\n\n- QGIS — System informacji geograficznej (GIS) obsługujący formaty wektorowe, rastrowe i bazodanowe.\n\n- SAGA — Oprogramowanie systemu informacji geograficznej (GIS) z ogromnymi możliwościami przetwarzania i analizy danych geograficznych.\n\n- WCSTools — Pakiet programów do ustawiania i używania układów współrzędnych świata\n\n"
    },
    {
      "title": "Klient mapy",
      "level": 4,
      "content": "- Cruiser — Aplikacja mapowa i nawigacyjna wykorzystująca mapy wektorowe offline\n\n- GNOME Maps — Prosty klient map dla GNOME z funkcjami nawigacji i GNSS (dostosowany do Linux Mobile). Część gnome.\n\n- kosmindoormap — Wewnętrzna kartografia, poziomy budynków, głównie stacji kolejowych i lotnisk. Na podstawie danych OSM\n\n- MapSCII — Konsolowa przeglądarka map.\n\n- Marble Maps — System nawigacji wektorowej i GNSS, z modułowym systemem nawigacji zakręt po zakręcie dla samochodów, pieszych i rowerzystów. (dostosowany do Linux Mobile)\n\n- Mapton — Rozszerzalna aplikacja do obsługi map i globusów napisana w języku Java.\n\n- Marble — Wirtualny globus i atlas świata, które można wykorzystać do nauki o Ziemi. Część kde-education.\n\n- OffRoad — Wyświetlanie map wektorowych offline przeniesione z OsmAnd.\n\n- Organic Maps — Nawigacja oparta na GNSS, z wektorowymi funkcjami offline i routingiem oraz routingiem zakręt po zakręcie\n\n- OSMin — Nawigacja oparta na GNSS, z wektorowymi funkcjami offline i wyznaczaniem tras, a także wyznaczaniem tras samochodowych, pieszych, rowerowych i pieszych zakręt po zakręcie (dostosowana do systemu Linux Mobile).\n\n- Pure Maps — Wyświetlanie map wektorowych i rastrowych, miejsc, tras itp.\n\n"
    },
    {
      "title": "Stan pogody",
      "level": 4,
      "content": "- Gis Weather — Konfigurowalny widżet prognozy pogody na pulpit.\n\n- GNOME Weather — Niewielka aplikacja dla środowiska GNOME, która umożliwia monitorowanie aktualnych warunków pogodowych w mieście lub w dowolnym miejscu na świecie oraz dostęp do zaktualizowanych prognoz dostarczanych przez różne serwisy internetowe. Część gnome.\n\n- KWeather — Konwergentna aplikacja pogodowa dla Plasmy. Część kde-utilities.\n\n- meteo-qt — Aplikacja w zasobniku systemowym do wyświetlania informacji o pogodzie.\n\n- wttr — Prosta aplikacja konsolowa do sprawdzania pogody, wykorzystująca dane ze strony https://wttr.in\n\n- Xfce Weather Panel Plugin — Wtyczka prognozy pogody dla panelu Xfce4.\n\n- wego — Terminalowa aplikacja pogodowa.\n\n"
    },
    {
      "title": "Geologia",
      "level": 3,
      "content": "- CDI — Jest to biblioteka C ogólnego przeznaczenia z dodatkowym interfejsem Fortran do obsługi plików IO w dziedzinie geonauki.\n\n- EnhancedVolcano — Gotowe do publikacji wykresy wulkanów z ulepszonymi kolorami i etykietami.\n\n- GEOmap — Mapowanie topograficzne i geologiczne.\n\n- GPlates — Jest to program do tektoniki płyt. Manipuluje rekonstrukcjami cech geologicznych i paleogeograficznych w czasie geologicznym.\n\n- Gsegyview — Przeglądarka plików danych sejsmicznych SEG-Y\n\n- Gstat — Przestrzenne i przestrzenno-czasowe modelowanie geostatystyczne, przewidywanie i symulacja\n\n- Madagascar — Wielowymiarowa analiza danych i powtarzalne eksperymenty obliczeniowe.\n\n- SeisComP — Oprogramowanie sejsmologiczne do akwizycji, przetwarzania, dystrybucji i interaktywnej analizy danych.\n\n- Seismic Un*x — Środowisko przetwarzania i badań sejsmicznych opracowane w Center for Wave Phenomena, Colorado School of Mines\n\n- TauP — Kalkulator czasu podróży sejsmicznej.\n\n"
    },
    {
      "title": "Oceanografia",
      "level": 3,
      "content": "- Cmocean — Zestaw map kolorów do standaryzacji powszechnie wykreślanych zmiennych oceanograficznych.\n\n"
    },
    {
      "title": "Oprogramowanie do astrometrii i przetwarzania obrazu",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of astrometric solvers.\n\n- APTS — Zestaw narzędzi do automatycznej akwizycji i przetwarzania obrazów astrofotograficznych\n\n- Astap — Astrometryczny (płytowy) solver, układanie obrazów, fotometria i przeglądarka FITS\n\n- AstroCrop — Narzędzie do wstępnego przetwarzania obrazów astronomicznych\n\n- AstroImageJ — ImageJ dla astronomii\n\n- Astrometry.net — Automatyczne rozpoznawanie obrazów astronomicznych\n\n- AudeLA — AudeLA to rozszerzenie TCL mające na celu zapewnienie astronomom amatorom przetwarzania obrazu, sterowania teleskopem, sterowania kamerą ccd i różnych algorytmów astronomicznych\n\n- CARTA — Sześcianowe narzędzie do analizy i renderowania dla astronomii\n\n- FITSH — Pakiet oprogramowania do przetwarzania obrazów astronomicznych\n\n- GIMP Astronomy Plugins — Zestaw wtyczek GIMP do przetwarzania obrazów astronomicznych.\n\n- Ginga — Przeglądarka danych astronomicznych w plikach FITS (Flexible Image Transport System)\n\n- SCAMP — Czyta katalogi SExtractor i oblicza rozwiązania astrometryczne i fotometryczne dla dowolnej sekwencji obrazów FITS w całkowicie automatyczny sposób.\n\n- SExtractor — Jest to program, który tworzy katalog obiektów na podstawie obrazu astronomicznego.\n\n- Montage — Silnik mozaiki obrazów astronomicznych\n\n- Munipack — Ogólne oprogramowanie do przetwarzania obrazów astronomicznych\n\n- oaCapture — Aplikacja do obrazowania planet przy użyciu Qt5\n\n- PlanetarySystemStacker — Tworzenie ostrego obrazu obiektu układu planetarnego\n\n- THELI — THELI to procesor do przetwarzania danych dla obrazów astronomicznych w zakresie optycznym, bliskiej podczerwieni i średniej podczerwieni\n\n"
    },
    {
      "title": "Oprogramowanie do przechwytywania obrazu",
      "level": 3,
      "content": "- CCDciel — Oprogramowanie do przechwytywania CCD przeznaczone dla astronomów amatorów.\n\n- FireCapture — Wiodące narzędzie do przechwytywania planet\n\n- GoQat — Oprogramowanie do akwizycji obrazu z kamery, zwłaszcza w przypadku kamer QSI, które zapewnia inne funkcje, takie jak automatyczne prowadzenie, pomoc w ustawianiu ostrości i inne.\n\n- lin_guider — Program autonaprowadzania astronomicznego\n\n- Mrcal — Jest to ogólny zestaw narzędzi stworzony do rozwiązywania problemów związanych z kalibracją i SFM, które napotykamy w NASA/JPL.\n\n- Open PHD Guiding — Narzędzie do automatycznego prowadzenia astrofotografii PHD2\n\n- SAOImageDS9 — SAOImage DS9: Aplikacja do wizualizacji danych astronomicznych\n\n- Siril — Siril to aplikacja do astrofotografii, która umożliwia wstępną obróbkę i przetwarzanie obrazów z dowolnego typu kamery (CCD, kamery planetarnej, kamery internetowej itp.)\n\n"
    },
    {
      "title": "Biblioteka wspólna",
      "level": 3,
      "content": "- Astropy — Projekt Astropy to wysiłek społeczności mający na celu opracowanie wspólnego podstawowego pakietu dla astronomii w Pythonie i wspieranie ekosystemu interoperacyjnych pakietów astronomicznych.\n\n- CASA — Pakiet oprogramowania Common Astronomy Software Applications.\n\n- Casacore — Zawiera podstawowe biblioteki starego pakietu AIPS++/CASA.\n\n- CDF — Biblioteka NASA Common Data Format (CDF) do zarządzania danymi naukowymi\n\n- ERFA — Niezbędne procedury dla podstawowej astronomii\n\n- HEASoft — Biblioteka astrofizyki wysokich energii NASA\n\n- libTheSky — Biblioteka Fortran do obliczania pozycji ciał niebieskich i zdarzeń z dużą dokładnością\n\n- Pal — Biblioteka astronomii pozycyjnej.\n\n- PyEphem — PyEphem zapewnia obliczenia astronomiczne na poziomie naukowym\n\n- SOFA — Zestaw algorytmów i procedur stosowanych w astronomii fundamentalnej\n\n"
    },
    {
      "title": "Zestawy narzędzi",
      "level": 3,
      "content": "- AstroML — Uczenie maszynowe, statystyka i eksploracja danych do astronomii i astrofizyki\n\n- Exoplanet — exoplanet to zestaw narzędzi do probabilistycznego modelowania danych szeregów czasowych w astronomii z naciskiem na obserwacje egzoplanet\n\n- Galpy — Dynamika galaktyczna w Pythonie\n\n- Gammapy — Pakiet Pythona dla astronomii promieniowania gamma\n\n- HEALPix — Oprogramowanie do pikselizacji, hierarchicznej indeksacji, syntezy, analizy i wizualizacji danych na kuli\n\n- JHelioviewer — Oprogramowanie do wizualizacji danych słonecznych w kontekście pogody kosmicznej\n\n- JMARS — Java Mission-planning and Analysis for Remote Sensing.\n\n- JSkyCalc — Narzędzie do przygotowywania obserwacji w języku Java\n\n- Period04 — Period04 to program komputerowy przeznaczony w szczególności do analizy statystycznej dużych astronomicznych szeregów czasowych zawierających luki\n\n- Pywwt — Jest to oficjalny zestaw narzędzi umożliwiający dostęp do AAS WorldWide Telescope (WWT) z poziomu Pythona\n\n- RochePlot — Wykreśl kluczowe etapy ewolucji gwiazdy podwójnej\n\n- Skyfield — Elegancka astronomia dla Pythona\n\n- SolTrack — Wolny (od zastrzeżeń), szybki i dokładny program C/C++ do obliczania pozycji Słońca\n\n- SPICE — Kompleksowy zestaw narzędzi i API do projektowania, symulacji i analizy misji kosmicznych\n\n- STILTS — Zestaw narzędzi biblioteki infrastruktury tabel Starlink\n\n- sunclock — Astronomiczna mapa świata pokazująca dzień i noc oraz pozycje Słońca i Księżyca\n\n- Tempo — Oprogramowanie do pomiaru czasu Pulsar\n\n- TOPCAT — Narzędzie do operacji na katalogach i tabelach\n\n- VaST — VaST to narzędzie programowe do wyszukiwania obiektów zmiennych na serii zdjęć astronomicznych\n\n- VStar — VStar to wieloplatformowe, łatwe w użyciu narzędzie do wizualizacji i analizy danych gwiazd zmiennych, które zostało pierwotnie opracowane w ramach projektu AAVSO Citizen Sky\n\n"
    },
    {
      "title": "Kalkulatory i narzędzia CLI",
      "level": 3,
      "content": "- astroTools — Narzędzia konsolowe dla astronomii i astrofizyki\n\n- Gnuastro — Różne programy i funkcje biblioteczne do manipulacji i analizy danych astronomicznych\n\n- Kosmorro — Program do obliczania efemeryd\n\n- Project Pluto — Project Pluto dostarcza oprogramowanie astronomiczne, zarówno komercyjne, jak i darmowe, amatorom i profesjonalnym astronomom\n\n- star-charter — Narzędzie konsolowe do tworzenia wektorowych wykresów nocnego nieba w formatach SVG, PDF i PNG\n\n- Sunwait — Obliczanie czasu wschodu/zachodu słońca za pomocą cywilnych, morskich, astronomicznych i niestandardowych zmierzchów\n\n"
    },
    {
      "title": "Zarządzanie teleskopami i obserwatoriami",
      "level": 3,
      "content": "- GILDAS — Jest zbiorem najnowocześniejszego oprogramowania zorientowanego na (sub-)milimetrowe aplikacje radioastronomiczne (zarówno z pojedynczą tarczą, jak i interferometrem)\n\n- imSim — pakiet oprogramowania, który symuluje teleskop LSST i badanie\n\n- rubin_sim — Harmonogram, analiza strategii badania i inne narzędzia symulacyjne dla Rubin Observatory\n\n- Srt-py — Kod sterowania małym teleskopem radiowym w Pythonie.\n\n"
    },
    {
      "title": "Symulacja",
      "level": 3,
      "content": "- APSYNSIM — Symulator syntezy apertury dla radioastronomii\n\n- Galaxy2 — Program symulujący ruch gwiazd pod wpływem grawitacji\n\n- GalSim — Modułowy zestaw narzędzi do symulacji obrazów galaktyk\n\n- FriendlyVRI — Został zaprojektowany do symulacji obserwacji astronomicznych przy użyciu połączonych macierzy anten radiowych w technice zwanej syntezą apertury rotacji Ziemi\n\n- Pynterferometer — Jest to interfejs graficzny przeznaczony do demonstracji technik interferometrii radiowej wykorzystywanych przez teleskopy\n\n"
    },
    {
      "title": "Programy eksploracji kosmosu",
      "level": 3,
      "content": "- Cosmographia — Cosmographia to program wizualizacyjny renderujący Układ Słoneczny i jego ciała w 3D w celu stworzenia swobodnie nawigowalnej mapy Układu Słonecznego\n\n- Cosmonium — Program astronomii 3D i eksploracji kosmosu\n\n- OpenSpace — OpenSpace to otwarte, niekomercyjne i swobodnie dostępne oprogramowanie do interaktywnej wizualizacji danych, zaprojektowane w celu wizualizacji całego znanego wszechświata i przedstawienia naszych bieżących wysiłków w celu zbadania kosmosu\n\n- Our Galaxy — Jest to wyjątkowa aplikacja, która pomaga zrozumieć elementy strukturalne Galaktyki oraz wizualizować lokalizacje i właściwości fizyczne obiektów głębokiego nieba w niej i wokół niej\n\n"
    },
    {
      "title": "Atlas planetarny i wirtualny",
      "level": 3,
      "content": "Zobacz także Wikipedia:Planetarium software.\n\nZobacz także Wikipedia:List of observatory software.\n\n- Aladin — Interaktywny programowy atlas nieba\n\n- Celestia — Program do symulacji astronomii 3D, który pozwala użytkownikom podróżować przez rozległy wszechświat, wzorowany na rzeczywistości, z dowolną prędkością, w dowolnym kierunku i w dowolnym czasie w historii.\n\n- Gaia Sky — Symulator wszechświata 3D o otwartym kodzie źródłowym z obsługą ponad miliarda obiektów\n\n- HNSKY — Hallo Northern Sky to półprofesjonalny, darmowy program do obsługi planetarium\n\n- KStars — Aplikacja planetarium, która zapewnia dokładną graficzną symulację nocnego nieba, z dowolnego miejsca na Ziemi, o dowolnej dacie i godzinie. Jest ona zawarta w KDE Edu.\n\n- Skychart / Cartes du Ciel — Planetarium, które mapuje i oznacza większość konstelacji, planet i obiektów, które można zobaczyć za pomocą teleskopu. Może również pobierać zdigitalizowane mapy nieba i nakładać obrazy na te mapy.\n\n- StarPlot — Trójwymiarowa przeglądarka map gwiazd.\n\n- Stellarium — Piękne planetarium 3D wykorzystujące OpenGL do renderowania realistycznego nieba w czasie rzeczywistym.\n\n- Virtual Moon Atlas — Oprogramowanie do obserwacji i badania Księżyca\n\n- XEphem — Efemerydy oparte na motywach i program planetarium.\n\n"
    },
    {
      "title": "Biologia obliczeniowa i bioinformatyka",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of open source bioinformatics software.\n\n- Biopython — Pakiet Python z narzędziami do biologii obliczeniowej, a także bioinformatyki.\n\n- EMBOSS (European Molecular Biology Open Software Suite) — Otwarty pakiet oprogramowania analitycznego opracowany specjalnie na potrzeby społeczności użytkowników biologii molekularnej i bioinformatyki.\n\n- MUMmer — Bioinformatyczny system oprogramowania do wyrównywania sekwencji oparty na drzewach sufiksów.\n\n- Snapgene — Zamknięta aplikacja do klonowania molekularnego, która oferuje szybki i łatwy sposób planowania, wizualizacji i dokumentowania procedur biologii molekularnej. Obsługuje szeroki zakres klonowania i manipulacji PCR. Darmowa wersja pozwala na najbardziej typowe wizualizacje przepływu pracy w biologii molekularnej.\n\n- UGENE — Aplikacja integrująca dziesiątki znanych narzędzi i algorytmów biologicznych, zapewniająca zarówno graficzny interfejs użytkownika, jak i interfejs wiersza poleceń.\n\n"
    },
    {
      "title": "Genealogia",
      "level": 3,
      "content": "- Gramps — Program genealogiczny, który pomaga śledzić drzewo genealogiczne.\n\n- LifeLines — Tekstowe oprogramowanie genealogiczne do tworzenia drzew genealogicznych i raportów.\n\n"
    },
    {
      "title": "Manipulacja obrazem",
      "level": 3,
      "content": "- ImageJ — Oparty na Javie program do przetwarzania i analizy obrazów, który zapewnia rozszerzalność za pomocą wtyczek i makr. Jest szeroko stosowany w mikroskopii (np. do zliczania komórek).\n\n- Fiji — Dystrybucja ImageJ (a wkrótce ImageJ2) z wieloma wtyczkami zorganizowanymi w spójną strukturę menu.\n\n"
    },
    {
      "title": "Przeglądarki DICOM i renderowanie objętości",
      "level": 3,
      "content": "- aeskulap — Prosta przeglądarka danych DICOM\n\n- weasis — Uniwersalna przeglądarka DICOM o wysoce modułowej architekturze\n\n- aliza — Otwieranie obrazów 2D, 3D i 4D w formatach DICOM, MetaIO, Nifti, Nrrd i innych, siatek w formatach DICOM, VTK, STL i OBJ\n\n- 3DSlicer — Kompleksowe MRI, CT, LSCM przetwarzanie objętości, segmentacja i rekonstrukcja 3D\n\n- ParaView — Interaktywne narzędzie do wizualizacji danych zbudowane przy użyciu VTK, które można skalować na rozproszonym sprzęcie komputerowym.\n\n"
    },
    {
      "title": "Projektowanie wspomagane komputerowo (CAD)",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of computer-aided design editors.\n\n- BRL-CAD — System CAD do konstruktywnego modelowania geometrii bryłowej, zawierający interaktywny edytor geometrii, obsługę ray tracingu do renderowania grafiki i analizy geometrycznej, obsługę rozproszonego bufora ramki w sieci komputerowej, narzędzia do tworzenia skryptów, przetwarzania obrazów i przetwarzania sygnałów.\n\n- FreeCAD — Parametryczny modeler 3D CAD oparty na OpenCascade, Coin3D, Qt i Pythonie z funkcjami takimi jak nagrywanie makr, środowiska robocze i możliwość uruchamiania jako serwer.\n\n- LeoCAD — Program CAD do tworzenia wirtualnych modeli LEGO. Ma łatwy w użyciu interfejs i obecnie zawiera ponad 10 000 różnych elementów stworzonych przez społeczność LDraw.\n\n- LibreCAD — Aplikacja CAD 2D oparta na Qt5. Rozwidlona z QCAD Community Edition.\n\n- OpenSCAD — Modeler 3D CAD, który wykorzystuje tekstowe, programistyczne podejście do tworzenia i manipulowania obiektami.\n\n- QCAD — Aplikacja CAD 2D oparta na Qt. Obsługuje standardowe formaty plików DFX i HPGL oraz opcjonalnie format DWG za pośrednictwem zastrzeżonej wtyczki.\n\n- SolveSpace — Potężny, oparty na ograniczeniach modeler parametryczny 3D CAD z prostymi możliwościami symulacji mechanicznej.\n\n"
    },
    {
      "title": "Drukowanie 3D",
      "level": 3,
      "content": "Zobacz także RepRap.\n\n"
    },
    {
      "title": "Slicery",
      "level": 4,
      "content": "Slicery konwertują modele 3D do formatu obsługiwanego przez drukarkę 3D, zazwyczaj jest to G-code.\n\n- PrusaSlicer — Slicer od Prusa Research. Rozwinięcie Slic3r. Przeznaczony dla ich drukarek, ale obsługuje również inne marki. Opensource.\n\n- Cura — Slicer firmy Ultimaker. Skierowany do ich drukarek, ale obsługuje również inne marki. Open source.\n\n- SuperSlicer — Ulepszony fork PrusaSlicer utrzymywany przez społeczność. Nie specyficzny dla marki. Opensource.\n\n- BambuStudio — Slicer dla drukarek od BambuLabs. Fork PrusaSlicer. Opensource.\n\n- orca-slicer — Utrzymywany przez społeczność fork BambuStudio (z kolei fork PrusaSlicer). Opensource.\n\n- MatterControl — Prosty edytor 3D, slicer i oprogramowanie do sterowania drukarkami 3D autorstwa MatterHackers. Nie specyficzne dla marki. Opensource.\n\n- IdeaMaker — Slicer firmy Raise3D. Skierowany do ich drukarek, ale obsługuje również inne marki. Closedsource.\n\n- Slic3r — Jeden z najwcześniejszych slicerów. Nie jest już zbyt często używany. Nie jest specyficzny dla marki. Opensource.\n\n- icesl — Oprogramowanie do modelowania ze zintegrowanym slicerem. Nie specyficzne dla marki. Closedsource.\n\n- FlashPrint — Slicer dla drukarek 3D FlashForge. Closedsource.\n\n"
    },
    {
      "title": "Oprogramowanie sterujące",
      "level": 4,
      "content": "Oprogramowanie do sterowania drukarkami 3D, zwykle za pomocą kabla lub bezprzewodowo.\n\n- OctoPrint — Interfejs sieciowy dla drukarek 3D FDM wykorzystujący G-kod. Opensource.\n\n- PrintRun — Oprogramowanie sterujące GUI dla drukarek 3D FDM wykorzystujące G-kod. Opensource.\n\n- Repetier-Host — Połączony slicer i oprogramowanie sterujące dla drukarek 3D. Closedsource.\n\n"
    },
    {
      "title": "Elektronika",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of EDA software.\n\n"
    },
    {
      "title": "Logika cyfrowa",
      "level": 4,
      "content": "Cyfrowe oprogramowanie logiczne to głównie proste narzędzia edukacyjne przeznaczone wyłącznie do projektowania i symulacji obwodów logicznych.\n\n- Digital — Interaktywny symulator podobny do wycofanego Logisim. Zawiera mapy Karnaugh, tablice logiczne, edytor FSM, eksport VHDL i wiele więcej, napisany w Javie.\n\n- GTKWave — W pełni funkcjonalna przeglądarka fal oparta na GTK, która odczytuje pliki LXT, LXT2, VZT, FST i GHW, a także standardowe pliki Verilog VCD/EVCD i umożliwia ich przeglądanie.\n\n- Logisim — Edukacyjne oprogramowanie do projektowania i symulacji logiki cyfrowej, napisane w Javie, oficjalnie przestało być rozwijane.\n\n- Logisim Evolution — Projekt, który kontynuuje rozwój oryginalnego Logisim z nowymi funkcjami, napisany w Javie.\n\n- PulseView — Analizator logiczny, oscyloskop i MSO GUI.\n\n- SmartSim — Proste i piękne oprogramowanie do projektowania i symulacji cyfrowych obwodów logicznych, przeznaczone głównie dla nauczycieli i studentów, bardzo lekkie i wieloplatformowe, na licencji GPL, napisane w języku Vala.\n\n- WaveDrom editor — Renderowanie diagramu czasowego w czasie rzeczywistym z prostego opisu tekstowego. Może być również edytowany i osadzony w przeglądarce.\n\n"
    },
    {
      "title": "HDL",
      "level": 4,
      "content": "Zobacz także Wikipedia:Hardware description language.\n\n- Gowin EDA Edu IDE — IDE dla urządzeń FGPA firmy Gowin, w tym Sipeed Tang Nano i Sipeed Tang Nano 4K.\n\n- Intel Quartus Prime — Zestaw narzędzi projektowych dla urządzeń FPGA firmy Intel, który obejmuje Quartus Prime, ModelSim-Intel, HLS Compiler itp.\n\n- Lattice Diamond — Zestaw narzędzi projektowych dla układów FPGA firmy Lattice.\n\n- Microsemi Libero — Narzędzia programistyczne do projektowania z wykorzystaniem rodzin PolarFire, IGLOO2, SmartFusion2, RTG4, SmartFusion, IGLOO, ProASIC3 i Fusion firmy Microsemi.\n\n- Xilinx ISE WebPACK — Zestaw do projektowania programowalnych układów logicznych FPGA.\n\n- GHDL — Darmowy i otwarty analizator, kompilator i symulator VHDL 2008/93/87.\n\n- OpenFPGAloader — Uniwersalne narzędzie do programowania układów FPGA. Wypróbuj openfpgaloader-gitAUR, jeśli twoja płyta nie jest zarządzana przez stabilną wersję.\n\n- Verilator — Symulator Verilog/SystemVerilog, przeprowadza kontrolę jakości kodu (lint), kompiluje do wątkowego kodu C++ do symulacji.\n\n- iverilog — Kompilator i narzędzie do symulacji Icarus Verilog (wolniejsze, ale starsze niż Verilator).\n\n- VTR — Verilog to Routing, Opensource CAD Flow for FPGA ResearchVerilog to Route.\n\n"
    },
    {
      "title": "IDE i programatory MCU",
      "level": 4,
      "content": "- Arduino — Zestaw SDK dla platformy prototypowej Arduino.\n\n- avrcalc — Kalkulator przyspieszający rozwój układów AVR firmy Atmel.\n\n- AVRDUDE — Pobieranie/wgrywanie/manipulowanie zawartością pamięci ROM i EEPROM mikrokontrolerów AVR.\n\n- dfu-util — Programator USB do aktualizacji oprogramowania sprzętowego urządzenia (DFU).\n\n- SPIPGM — Narzędzie do programowania szeregowych pamięci SPI FlashROM podłączonych do komputera za pomocą kabla portu równoległego.\n\n- esp-idf — Espressif IoT Development Framework. Oficjalna platforma programistyczna dla ESP32.\n\n- platformio — Wspólna platforma dla rozwoju wbudowanego, rozwoju wbudowanego, z debuggerem, testowaniem jednostkowym, analizą kodu. Domyślnym IDE jest VSCode, ale może być używane przez Atom, Eclipse, Emacs Qt Creator, Vim i kilka innych IDE. Podstawowe narzędzia CLI.\n\n"
    },
    {
      "title": "Symulacja obwodów elektronicznych i edycja schematów",
      "level": 4,
      "content": "- easy_spice — Symulator obwodu elektronicznego. Frontend SPICE, wykorzystujący gschem dla schematów i ngspice jako symulator.\n\n- gnucap — Symulator obwodów GNU.\n\n- gspiceui — GUI do różnych swobodnie dostępnych symulatorów układów elektronicznych Spice.\n\n- Oregano — Graficzna aplikacja do przechwytywania schematów i symulacji obwodów elektrycznych. Rzeczywista symulacja jest wykonywana przez silniki ngspice lub Gnucap.\n\n- ngspice — Symulator obwodów drukowanych dla systemu Linux. Otwarty następca kodu spice3f5. Posiada najbardziej wszechstronny interfejs użytkownika; obsługuje skrypty w opisach obwodów, korzystanie z interpretera, jako biblioteka C, poprzez tcl lub różne zewnętrzne wrappery (np. Python).\n\n- Qucs — Aplikacja symulatora obwodów elektronicznych, która umożliwia skonfigurowanie obwodu za pomocą graficznego interfejsu użytkownika i symulację jego zachowania w zakresie dużych i małych sygnałów oraz szumów.\n\n- qucs-s — Symulator obwodu elektronicznego, który daje możliwość skonfigurowania obwodu za pomocą GUI i jego symulacji. Widelec qucs, który wykorzystuje zewnętrzne, lepsze programy do rzeczywistej symulacji.\n\n- Xyce — SANDIA Xyce jest otwartoźródłowym, kompatybilnym z SPICE, wysokowydajnym symulatorem obwodów analogowych, zdolnym do rozwiązywania bardzo dużych problemów z obwodami poprzez obsługę wielkoskalowych równoległych platform obliczeniowych.\n\n"
    },
    {
      "title": "Projektowanie elektroniczne i edycja schematów",
      "level": 4,
      "content": "- asco — Optymalizator obwodów SPICE.\n\n- Fritzing — Łatwy w użyciu program do rysowania dobrze wyglądających schematów obwodów, a także tworzenia PCB.\n\n- gEDA — Pełny zestaw narzędzi do automatyzacji projektowania elektronicznego, które są wykorzystywane do projektowania obwodów elektrycznych, przechwytywania schematów, symulacji, prototypowania i produkcji.\n\n- gEDA PCB — Interaktywny edytor płytek drukowanych.\n\n- KiCad — Pakiet oprogramowania do automatyzacji projektowania elektronicznego (EDA), który ułatwia projektowanie schematów układów elektronicznych i ich konwersję na PCB (płytkę drukowaną).\n\n- KTechLab — IDE dla mikrokontrolerów i symulacji obwodów elektronicznych.\n\n- QElectroTech — Aplikacja służąca do rysowania zaawansowanych obwodów elektrycznych.\n\n"
    },
    {
      "title": "Telekomunikacja",
      "level": 2,
      "content": "- GNU Radio — Zestaw narzędzi programistycznych, który zapewnia bloki przetwarzania sygnału do implementacji radia programowego.\n\n- Gqrx — Odbiornik radiowy definiowany programowo zaimplementowany przy użyciu GNU Radio i zestawu narzędzi Qt GUI.\n\n- Pothos — Projekt Pothos to kompletny framework przepływu danych do tworzenia topologii połączonych bloków przetwarzania.\n\n- SDR# — Najpopularniejszy program SDR.\n\n- SigDigger — Analizator sygnału cyfrowego oparty na Qt, wykorzystujący rdzeń Suscan i bibliotekę Sigutils DSP.\n\n"
    },
    {
      "title": "Radio amatorskie",
      "level": 3,
      "content": "Zobacz główny artykuł: Amateur radio#Software.\n\nZobacz także Wikipedia:List of software-defined radios.\n\n"
    },
    {
      "title": "Modelowanie symulacyjne",
      "level": 2,
      "content": "- Flight Gear — Otwarty, wieloplatformowy symulator lotów atmosferycznych i orbitalnych z silnikiem dynamiki lotu (JSBSim), który jest częścią 2015 NASA benchmark w celu oceny nowego kodu symulacyjnego zgodnie ze standardami branży kosmicznej.\n\n- gephi — Gephi to pakiet oprogramowania do analizy i wizualizacji sieci o otwartym kodzie źródłowym, napisany w języku Java.\n\n- golly — Golly to wieloplatformowa aplikacja o otwartym kodzie źródłowym do eksploracji gry Conway's Game of Life i wielu innych typów automatów komórkowych.\n\n- Netlogo — NetLogo to wieloagentowe, programowalne środowisko do modelowania.\n\n- AnyLogic — AnyLogic to wieloplatformowe narzędzie do modelowania symulacji z wykorzystaniem wielu metod, które jest również dostępne do użytku osobistego.\n\n"
    },
    {
      "title": "Architektura",
      "level": 3,
      "content": "- edumips64 — Wieloplatformowy edukacyjny symulator procesora MIPS64.\n\n- Qiskit Aer — Wysokowydajny symulator obwodów kwantowych zawierający modele szumu.\n\n- QtMips — Symulator procesora MIPS do celów edukacyjnych z wizualizacją potoku i pamięci podręcznej.\n\n- QtRvSim — Symulator procesora RISC-V do celów edukacyjnych.\n\n- QtSpim — Port Qt jednego z pierwszych edukacyjnych symulatorów procesora MIPS. Nie jest już utrzymywany, ale nadal używany na niektórych zajęciach.\n\n"
    },
    {
      "title": "Sztuczna inteligencja",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of deep learning software.\n\n- Fast Artificial Neural Network — Biblioteka do tworzenia sztucznych sieci neuronowych typu feedforward.\n\n- Mycroft — Inteligentny osobisty asystent i nawigator wiedzy z funkcją rozpoznawania mowy.\n\n- Orange — Zestaw narzędzi do wizualizacji danych, uczenia maszynowego i eksploracji danych, dostępny za pośrednictwem programowania wizualnego i Pythona.\n\n- Torch — Biblioteka uczenia maszynowego, naukowy framework obliczeniowy i język skryptowy oparty na LuaJIT.\n\n- Tensorflow — Kompleksowa platforma uczenia maszynowego typu opensource.\n\n- Prolog — Prolog to język programowania logicznego związany ze sztuczną inteligencją i lingwistyką obliczeniową.\n\n- PyTorch — Framework uczenia maszynowego typu opensource, który przyspiesza ścieżkę od prototypowania badań do wdrożenia produkcyjnego.\n\n- Theano — Theano to biblioteka Pythona, która umożliwia definiowanie, optymalizację i ocenę wyrażeń matematycznych obejmujących wielowymiarowe tablice.\n\n- X Neural Switcher — Automatyczne (inteligentne) dostosowanie układu klawiatury.\n\n"
    },
    {
      "title": "Systemy rozproszone",
      "level": 3,
      "content": "- SimGrid — Instrument naukowy do badania rozproszonych systemów na dużą skalę.\n\n- Shadow — Hybryda rozproszonego systemu/symulatora sieci/emulatora o otwartym kodzie źródłowym (np. dla Tor i Bitcoin).\n\n"
    },
    {
      "title": "Sieci",
      "level": 3,
      "content": "- CORE — Common Open Research Emulator.\n\n- IMUNES — Zintegrowany emulator/symulator sieci wieloprotokołowej.\n\n- GNS3 — Emulator oprogramowania sieciowego wykorzystujący połączenie urządzeń wirtualnych i rzeczywistych do symulacji złożonych sieci.\n\n- ns-2 — Symulator zdarzeń dyskretnych przeznaczony do badań sieciowych.\n\n- ns-3 — Symulator sieci zdarzeń dyskretnych dla systemów internetowych.\n\n- OMNeT++ — Oparty na komponentach pakiet symulacyjny przeznaczony do modelowania sieci komunikacyjnych.\n\n"
    },
    {
      "title": "Fotogrametria",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison_of_photogrammetry_software.\n\n- OpenMVS — Biblioteka dla naukowców zajmujących się wizją komputerową, szczególnie skierowana do społeczności zajmującej się rekonstrukcją Multi-View Stereo.\n\n- OpenMVG — OpenMVG zapewnia kompleksową strukturę rekonstrukcji 3D z obrazów złożoną z bibliotek, plików binarnych i potoków.\n\n- AliceVision — Fotogrametryczne ramy wizji komputerowej\n\n"
    }
  ]
}