{
  "title": "List of Applications/Documents (日本語)",
  "url": "https://wiki.archlinux.org/title/List_of_Applications/Documents_(%E6%97%A5%E6%9C%AC%E8%AA%9E)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "インターネット – マルチメディア – ユーティリティ – ドキュメント – セキュリティ – サイエンス – その他\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 ドキュメントとテキスト 1.1 テキストエディタ 1.1.1 Vi-style text editors 1.1.2 Emacs-style text editors 1.1.3 コンソール 1.1.4 グラフィカル 1.2 Office 1.2.1 Office suites 1.2.2 ワードプロセッサ 1.2.2.1 WYSIWYG HTML エディタ 1.2.2.2 Desktop publishing 1.2.3 Presentations 1.2.4 スプレッドシート 1.2.5 データベースツール 1.2.5.1 簡易データベースソフトウェア 1.2.6 Formula editors 1.3 マークアップ言語 1.3.1 AsciiDoc 1.3.2 Markdown 1.3.2.1 Python 実装 1.3.2.2 Ruby 実装 1.3.2.3 Markdown エディタ 1.3.3 組版システム 1.3.4 TeX エディタ 1.3.5 TeX 数式エディタ 1.3.6 XML エディタ 1.4 Document converters 1.5 参照文献マネージャ 1.6 文章リーダー・ビューア 1.6.1 PDF と DjVu 1.6.2 電子書籍 1.6.3 漫画ビューア 1.6.4 CHM 1.7 Document managers 1.8 スキャニングソフトウェア 1.9 OCR ソフトウェア 1.9.1 Console 1.9.2 Graphical 1.10 Notes 1.10.1 メモ管理 1.10.1.1 コンソール 1.10.1.2 グラフィカル 1.10.2 手書きメモ 1.10.3 Diary 1.10.4 マインドマップツール 1.10.5 Sticky notes 1.11 Special writing environments 1.11.1 Distraction-free writing 1.11.2 Story writing 1.11.3 Screenwriting 1.12 Language 1.12.1 Dictionary and thesaurus 1.12.1.1 Console 1.12.1.2 Graphical 1.12.2 Spell checkers 1.12.3 翻訳・地域化 1.13 バーコードジェネレータ・リーダー 1.13.1 コンソール 1.13.2 グラフィカル\n\n- 1.1 テキストエディタ 1.1.1 Vi-style text editors 1.1.2 Emacs-style text editors 1.1.3 コンソール 1.1.4 グラフィカル\n- 1.2 Office 1.2.1 Office suites 1.2.2 ワードプロセッサ 1.2.2.1 WYSIWYG HTML エディタ 1.2.2.2 Desktop publishing 1.2.3 Presentations 1.2.4 スプレッドシート 1.2.5 データベースツール 1.2.5.1 簡易データベースソフトウェア 1.2.6 Formula editors\n- 1.3 マークアップ言語 1.3.1 AsciiDoc 1.3.2 Markdown 1.3.2.1 Python 実装 1.3.2.2 Ruby 実装 1.3.2.3 Markdown エディタ 1.3.3 組版システム 1.3.4 TeX エディタ 1.3.5 TeX 数式エディタ 1.3.6 XML エディタ\n- 1.4 Document converters\n- 1.5 参照文献マネージャ\n- 1.6 文章リーダー・ビューア 1.6.1 PDF と DjVu 1.6.2 電子書籍 1.6.3 漫画ビューア 1.6.4 CHM\n- 1.7 Document managers\n- 1.8 スキャニングソフトウェア\n- 1.9 OCR ソフトウェア 1.9.1 Console 1.9.2 Graphical\n- 1.10 Notes 1.10.1 メモ管理 1.10.1.1 コンソール 1.10.1.2 グラフィカル 1.10.2 手書きメモ 1.10.3 Diary 1.10.4 マインドマップツール 1.10.5 Sticky notes\n- 1.11 Special writing environments 1.11.1 Distraction-free writing 1.11.2 Story writing 1.11.3 Screenwriting\n- 1.12 Language 1.12.1 Dictionary and thesaurus 1.12.1.1 Console 1.12.1.2 Graphical 1.12.2 Spell checkers 1.12.3 翻訳・地域化\n- 1.13 バーコードジェネレータ・リーダー 1.13.1 コンソール 1.13.2 グラフィカル\n\n- 1.1.1 Vi-style text editors\n- 1.1.2 Emacs-style text editors\n- 1.1.3 コンソール\n- 1.1.4 グラフィカル\n\n- 1.2.1 Office suites\n- 1.2.2 ワードプロセッサ 1.2.2.1 WYSIWYG HTML エディタ 1.2.2.2 Desktop publishing\n- 1.2.3 Presentations\n- 1.2.4 スプレッドシート\n- 1.2.5 データベースツール 1.2.5.1 簡易データベースソフトウェア\n- 1.2.6 Formula editors\n\n- 1.2.2.1 WYSIWYG HTML エディタ\n- 1.2.2.2 Desktop publishing\n\n- 1.2.5.1 簡易データベースソフトウェア\n\n- 1.3.1 AsciiDoc\n- 1.3.2 Markdown 1.3.2.1 Python 実装 1.3.2.2 Ruby 実装 1.3.2.3 Markdown エディタ\n- 1.3.3 組版システム\n- 1.3.4 TeX エディタ\n- 1.3.5 TeX 数式エディタ\n- 1.3.6 XML エディタ\n\n- 1.3.2.1 Python 実装\n- 1.3.2.2 Ruby 実装\n- 1.3.2.3 Markdown エディタ\n\n- 1.6.1 PDF と DjVu\n- 1.6.2 電子書籍\n- 1.6.3 漫画ビューア\n- 1.6.4 CHM\n\n- 1.9.1 Console\n- 1.9.2 Graphical\n\n- 1.10.1 メモ管理 1.10.1.1 コンソール 1.10.1.2 グラフィカル\n- 1.10.2 手書きメモ\n- 1.10.3 Diary\n- 1.10.4 マインドマップツール\n- 1.10.5 Sticky notes\n\n- 1.10.1.1 コンソール\n- 1.10.1.2 グラフィカル\n\n- 1.11.1 Distraction-free writing\n- 1.11.2 Story writing\n- 1.11.3 Screenwriting\n\n- 1.12.1 Dictionary and thesaurus 1.12.1.1 Console 1.12.1.2 Graphical\n- 1.12.2 Spell checkers\n- 1.12.3 翻訳・地域化\n\n- 1.12.1.1 Console\n- 1.12.1.2 Graphical\n\n- 1.13.1 コンソール\n- 1.13.2 グラフィカル\n\n"
    },
    {
      "title": "テキストエディタ",
      "level": 3,
      "content": "See also Wikipedia:Comparison of text editors.\n\nSome of the lighter-weight 統合開発環境 can also serve as text editors.\n\n"
    },
    {
      "title": "Vi-style text editors",
      "level": 4,
      "content": "- Amp — Rust で書かれたテキストエディタで、Vim のコア機能をシンプルにして、近代的なテキストエディタに求められる機能をバンドルすることを目標としています。\n\n- Aretext — vim と互換性のあるキーバインディングを備えたシンプルなテキストエディタ。\n\n- BusyBox vi — \"小さな vi クローン\" を提供。次のコマンドで起動できます。busybox vi.\n\n- Kakoune — モーダルエディタ。キーストロークが少なく、選択ベースでマルチカーソル編集を使うことができ、直交デザインを取っています。\n\n- Helix — モダンなモーダルテキストエディタ。\n\n- Neovim — 21世紀の Vim 再誕。\n\n- Neovim-Qt — Qt GUI 製の Neovim\n\n- vi — オリジナルの ex/vi テキストエディタ。\n\n- Vim (Vi IMproved) — 標準の Unix エディタである 'vi' に多くの機能を追加した先進的なテキストエディタ。\n\n- Vis — モダンでレガシーフリー、単純ながら効率的な vim ライクなエディタ。\n\n"
    },
    {
      "title": "Emacs-style text editors",
      "level": 4,
      "content": "- Emacs — 拡張性がありカスタマイズが多用でドキュメント豊富なリアルタイムディスプレイエディタ by GNU.\n\n- mg — 小型で高速、ポータブルな Emacs 互換エディタ。\n\n- MicroEmacs — Ncurses ベースのテキストエディタ。\n\n- vile — vi ライクなキーバインドを使用する軽量な Emacs クローン。\n\n- Zile — 軽量な Emacs クローン。\n\n"
    },
    {
      "title": "コンソール",
      "level": 4,
      "content": "- dte — マルチタブインターフェース、シンタックスハイライト、ctags ナビゲーションなどを備えた、小さくて使いやすいエディタ。\n\n- e3 — 依存パッケージのない、アセンブラで書かれた小さなエディタ。\n\n- ee — クラシックな curse ベースのテキストエディタ。HP-UX で誕生し、FreeBSD で使われています。\n\n- JED — S-Lang ライブラリ を使って拡張するテキストエディタ。コンソール版 (jed) と X ウィンドウ版 (xjed) があります。\n\n- JOE (Joe's Own Editor) — 使いやすいように設計されている端末ベースのテキストエディタ。\n\n- mcedit — Midnight Commander ファイルマネージャに付属している便利なテキストエディタ。\n\n- micro — 近代的で直感的なターミナルベースのテキストエディタ。Go で書かれておりプラグインで拡張できます。\n\n- Minimum Profit — プログラマ向けのテキストエディタ。\n\n- nano — テキストエディタpicoをベースとしたコンソールテキストエディタ。画面上にキー操作が表示されます。\n\n- ne — Windows ライクなキーバインドを使用するミニマリストテキストエディタ。\n\n- slap — Sublime ライクなターミナルベースのテキストエディタ。\n\n- Tilde — Windows ライクなキーバインドを備えた直感的なテキストエディタ。\n\n"
    },
    {
      "title": "グラフィカル",
      "level": 4,
      "content": "- Acme — Rob Pike によって開発されている Plan 9 OS 向けの最小主義の柔軟性のあるプログラミング環境。\n\n- Adie — Fast and convenient programming text editor.\n\n- Atom — GitHub によって開発されている待望のテキストエディタ。Node.js で書かれたプラグインのサポート、Git の制御が組み込まれています。\n\n- Beaver — モジュラー・ライトウェイト・スタイリッシュに設計された GTK エディタ。\n\n- Brackets — コードエディタ for the web。JavaScript, HTML, CSS で書かれています。\n\n- CorePad — Simple lightweight but powerful text editor with syntax-highlighting support for a dozen or more languages. Part of C-Suite.\n\n- Deepin Text Editor — Simple text editor for Deepin desktop.\n\n- Ecrire — Simple text editor based on EFL.\n\n- Enki — Text editor for programmers.\n\n- FeatherPad — ダークテーマをネイティブで搭載しタブ・印刷・シンタックスハイライトをサポートするミニマルな Qt5 のプレーンテキストエディタ。\n\n- FLTK Editor — Simple text editor application for FLTK.\n\n- gCSVedit — Simple text editor for CSV, TSV and other kinds of delimiter-separated values (DSV) files.\n\n- gedit — GNOME デスクトップの GTK エディタ。シンタックスハイライト、自動インデント、パターンマッチなどの機能があり、さらに機能を追加するための多数のプラグインが存在します。\n\n- GNOME Text Editor — Simple text editor for GNOME focused on a pleasing default experience.\n\n- Gobby — 複数の文章を一つのセッションで、マルチユーザーのチャットを使って編集できる共同作業エディタ。\n\n- Howl — General purpose, fast and lightweight editor with a keyboard-centric minimalistic user interface.\n\n- jEdit — プログラマーのためのテキストエディタ、Java で書かれています。\n\n- JuffEd — Qt で書かれた、シンタックスハイライトのできるシンプルなタブテキストエディタ。\n\n- Kate — KDE デスクトップの MDI とファイルシステムブラウザがついたフル機能のプログラマー用エディタ。\n\n- KWrite — Kate のウィジェットとしても使われている KDE デスクトップの軽量なテキストエディタ。\n\n- L3afpad — シンプルなテキストエディタ。Leafpad のフォークで、GTK 3 をサポート。\n\n- Leafpad — シンプルさを強調した GTK のメモ帳クローン。\n\n- Light Table — Next generation code editor that connects you to your creation with instant feedback.\n\n- Liri Text — Text editor for Liri.\n\n- medit — プログラミング用テキストエディタ。\n\n- Mousepad — Xfce デスクトップ環境の軽快なテキストエディタ。\n\n- NEdit — Motif 環境のテキストエディタ。\n\n- Notepadqq — Qt ベースで Notepad++ ライクなテキストエディタ。100以上の言語のシンタックスハイライトをサポート。\n\n- Nota — Easy to use text editor with a simple interface with support for tabbed documents, syntax highlighting for various languages, Focus mode, annotations, configurable fonts, and colors, a side panel with an integrated file browser, and more.\n\n- Pantheon Code — Code editor for elementaryOS. It auto-saves your files, meaning they are always up-to-date. Plus it remembers your tabs so you never lose your spot, even in between sessions.\n\n- Pluma — MATE のパワフルなテキストエディタ。\n\n- QSciTE — SciTE テキスト・コードエディタの Qt クローン。\n\n- Sam — グラフィカルユーザーインターフェースのある最小主義のテキストエディタ。Rob Pike によって開発されており、パワフルなコマンド言語、リモート編集機能などがある。\n\n- SciTE — プログラムのビルド・実行を容易くする一般的に使いやすいエディタ。\n\n- Scribes — シンプリシティとパワーを併せ持つ究極最小主義のテキストエディタ。\n\n- Sublime Text — Proprietary の C++ と Python ベースのエディタ。先進的な機能やプラグインが多数存在しながら軽量で外観も綺麗です。\n\n- Tau — Minimal GTK front end to the xi editor core written in Rust.\n\n- TEA — Qt ベースの高機能なテキストエディタ。\n\n- Textadept — Lua で拡張できる機能豊富なテキストエディタ。Scintilla をベースとしており C で書かれています。\n\n- Textosaurus — Simple cross-platform text editor based on Qt and QScintilla.\n\n- Visual Studio Code — 近代的なウェブ・クラウドアプリケーションをビルド・デバッグするためのエディタ。\n\n- xed — Text editor based on Pluma developed for Linux Mint.\n\n- XEdit — X Window System のシンプルなテキストエディタ。\n\n- wxMEdit — Text/Hex editor written in C++ and wxWidgets.\n\n"
    },
    {
      "title": "Office suites",
      "level": 4,
      "content": "See also Wikipedia:Comparison of office suites.\n\n- Calligra — 活発に開発されている KOffice (KDE のオフィススイート) のフォーク。OpenOffice のほとんどの機能を持っていてスマートフォン版 (Calligra Mobile) やタブレット版 (Calligra Active) もあります。\n\n- LibreOffice — The office productivity suite compatible to the open and standardized ODF document format. Fork of OpenOffice, supported by The Document Foundation.\n\n- OnlyOffice — Office suite that combines text, spreadsheet and presentation editors.\n\n- OpenOffice — オープンソースのオフィススイート。ワードプロセッサ、スプレッドシート、プレゼンテーション、グラフィック、データベースなど (現在は Apache ライセンス)。\n\n- SoftMaker Office — 軽量で機能豊富な Microsoft Office 互換のオフィススイート。ワードプロセッサ、スプレッドシート、プレゼンテーショングラフィックソフトウェアが付属。\n\n- WPS Office — プロプライエタリなオフィススイート。旧名 Kingsoft Office。\n\n- Yozo Office — Proprietary office suite, compatible with MS Office.\n\n"
    },
    {
      "title": "ワードプロセッサ",
      "level": 4,
      "content": "See also Wikipedia:Comparison of word processors.\n\n- en:AbiWord — フル機能のワードプロセッサ。\n\n- Calligra Words — Calligra スイートに含まれているパワフルなワードプロセッサ。\n\n- LibreOffice Writer — LibreOffice スイートに含まれているフル機能のワードプロセッサ。\n\n- OpenOffice Writer — OpenOffice スイートに含まれているフル機能のワードプロセッサ。\n\n- Ted — 使いやすい GTK ベースのリッチテキストプロセッサ (脚注をサポート)。\n\n- WordGrinder — Word processor for the console.\n\n- BlueGriffon — World Wide Web 用の新しい WYSIWYG コンテンツエディタ。\n\n- PageEdit — ePub visual XHTML editor.\n\n- SeaMonkey Composer — SeaMonkey スイートに含まれているパワフルでシンプルな HTML エディタ。\n\n- gLabels — ラベルや名刺 and media covers を作るためのプログラム。\n\n- Scribus — デスクトップパブリッシングプログラム。Uses hyphen and its language packs for hyphenation.\n\n"
    },
    {
      "title": "Presentations",
      "level": 4,
      "content": "- Calligra Stage — Easy to use yet still flexible presentation application included in the Calligra Suite.\n\n- LibreOffice Impress — Presentation program included in the LibreOffice suite.\n\n- OpenOffice Impress — Presentation program included in the OpenOffice suite.\n\n- sent — Simple plaintext presentation tool.\n\n- Sozi — Zooming presentation editor and player. Based on the Electron platform.\n\n- Spice-Up — Create simple and beautiful presentations.\n\n"
    },
    {
      "title": "スプレッドシート",
      "level": 4,
      "content": "See also Wikipedia:Comparison of spreadsheet software.\n\n- Calligra Sheets — Calligra スイートに含まれているパワフルな表計算アプリケーション。\n\n- Gnumeric — GNOME デスクトップの一部になっているスプレッドシートプログラム。\n\n- LibreOffice Calc — LibreOffice スイートに含まれているフル機能の表計算アプリケーション。\n\n- OpenOffice Calc — OpenOffice スイートに含まれているフル機能の表計算アプリケーション。\n\n- Pyspread — Pyspread is aPython プログラミング言語で書かれた新しいスプレッドシートアプリケーション。\n\n- sc — curses ベースの軽量スプレッドシート。\n\n- sc-im — sc ベースのスプレッドシートプログラム。\n\n"
    },
    {
      "title": "データベースツール",
      "level": 4,
      "content": "DBMS 特有のツールについては、以下を参照してください:\n\n- MySQL#グラフィカルツール\n- PostgreSQL#グラフィカルツール\n- SQLite#グラフィカルツール\n\nまた、Wikipedia:Comparison of database tools も参照してください。\n\n- Adminer — 多くのデータベースタイプをサポートする、フル機能のデータベース管理ウェブアプリ。\n\n- DBeaver — 多くのデータベースタイプをサポートする、Java ベースのグラフィカルデータベースエディタ。\n\n- DbVisualizer — ユニバーサルデータベースツール。\n\n- GdaBrowser — データベースの構造や内容に素早くアクセスできるグラフィカルツール。\n\n- GSQL — GNOME の統合データベース開発ツール。2010 年に最後のリリース。\n\n- Kexi — KDE による視覚的データベースアプリケーション作成ツールで、スプレッドシートとより高度な開発を必要とするデータベースソリューションの間のギャップを埋めるよう設計されています。\n\n- LibreOffice Base — 多様なユーザーのニーズを満たすよう設計された、LibreOffice スイートに含まれるフル機能のデスクトップデータベースフロントエンド。\n\n- OpenOffice Base — 多様なユーザーのニーズを満たすよう設計された、OpenOffice スイートに含まれるフル機能のデスクトップデータベースフロントエンド。\n\n- Orbada — データベース開発者、SQL 開発者、DBA 管理者、および SQL の知識とスキルを向上させたいユーザー向けの優れたツール。\n\n- Sequeler — Vala と Gtk で構築された SQL クライアント。ローカルおよびリモートのデータベースに接続し、言語認識を備えた便利なテキストエディタで SQL を記述し、Gtk.Grid Widget で SELECT 結果を視覚化できます。\n\n- SQuirreL SQL Client — JDBC 対応データベースの構造を表示し、テーブル内のデータを閲覧し、SQL コマンドを発行することができるグラフィカルな Java プログラム。\n\n- TOra — Oracle、MySQL、PostgreSQL などの一般的なデータベースプラットフォームにアクセスできるデータベース管理 GUI で、Qt の ODBC サポートを介してアクセスできるターゲットに対しては限定的なサポートも提供します。\n\n- Glom — 使いやすいデータベースデザイナーおよびユーザーインターフェイス。\n\n- Symphytum — 複雑なデータベース言語やソフトウェアのユーザーインターフェイスを学ばずに、データを簡単かつ直感的に管理および整理したいすべての人のための個人向けデータベースソフトウェア。\n\n- TreeLine — ほぼあらゆる種類の情報をツリー構造に保存でき、整理が簡単です。\n\n"
    },
    {
      "title": "Formula editors",
      "level": 4,
      "content": "See also #TeX formula editors and Wikipedia:Formula editor.\n\n- LibreOffice Math — Create and edit scientific formulas and equations. Included in the LibreOffice suite.\n\n- OpenOffice Math — Create equations and formulas for your documents. Included in the OpenOffice suite.\n\n"
    },
    {
      "title": "マークアップ言語",
      "level": 3,
      "content": "Wikipedia:Comparison of document markup languages も参照。\n\n- Sphinx — reStructuredText によるドキュメント生成システム。複数のフォーマットで出力可能 (Python プロジェクトのためのドキュメントシステム)。\n\n- txt2tags — すごくわかりやすい、KISS-準拠の軽量な人間に読めるマークアップ言語。リッチフォーマットコンテンツをプレーンテキストファイルから作成。\n\n"
    },
    {
      "title": "AsciiDoc",
      "level": 4,
      "content": "Wikipedia:AsciiDoc も参照してください。\n\n- AsciiDoc — The original implementation, written in Python. Arch では pacman の man ページを生成するのに使われています [1]。\n\n- Asciidoctor — Ruby による asciidoc の実装。様々な機能 が追加されています。\n\n"
    },
    {
      "title": "Markdown",
      "level": 4,
      "content": "公式ウェブサイト [2] と Wikipedia:Markdown も参照してください。\n\n- Discount — C 言語で書かれた Markdown の実装。\n\n- lowdown — Markdown から HTML5 および roff フォーマットの ms および man ドキュメントを生成するトランスレーター。\n\n- Marked — 速度を重視した Markdown パーサーおよびコンパイラ。\n\n- Pandoc も Markdown をサポートしています。\n\n- CommonMark-py — CommonMark Markdown 仕様の Python パーサー。\n\n- M2R — Markdown から reStructuredText へのコンバーター。\n\n- Mistune — 純粋な Python で最速の Markdown パーサーで、レンダラー機能を備えています。\n\n- Python-Markdown — John Gruber の Markdown の拡張可能な Python 実装。\n\n- kramdown — 厳格な構文定義を使用する高速で純粋な Ruby Markdown スーパーセットコンバーター。\n\n- Maruku — 純粋な Ruby Markdown スーパーセットインタープリター。\n\n- mdless — 純粋な Ruby でターミナルベースの Markdown ビューア/インタープリター。\n\n- Abricotine — デスクトップ向けの Markdown エディタ。 Electron プラットフォームに基づいています。\n\n- Apostrophe — GTK で作られた、気が散らない Markdown エディタ。\n\n- CuteMarkEd — Qt ベースの Markdown エディタで、HTML のライブプレビュー、数式、コードおよび Markdown の構文ハイライトを備えています。2016 年以降、開発は終了しています。\n\n- Formiko — Python と GTK で書かれた reStructuredText および Markdown エディタで、ライブプレビューが可能です。\n\n- ghostwriter — 気が散らない Markdown エディタ。\n\n- Marker — シンプルでありながら堅牢な Markdown エディタ。\n\n- Mark My Words — ミニマルな Markdown エディタ。\n\n- Mark Text — 次世代の Markdown エディタ。Electron プラットフォームに基づいています。\n\n- Moeditor — 汎用 Markdown エディタ。Electron プラットフォームに基づいています。2016 年以降、開発は終了しています。\n\n- Remarkable — フル機能の Markdown エディタ。\n\n- ReText — Markdown および reStructuredText 用のシンプルなテキストエディタ。\n\n- ThiefMD — Ulysses にインスパイアされた Markdown および Fountain エディタ。\n\n- Typora — プロプライエタリでミニマルな Markdown エディタ。\n\n"
    },
    {
      "title": "組版システム",
      "level": 4,
      "content": "- groff — GNU の troff の実装で、ユニックスのドキュメント処理システムの後継であり、man ページ のデフォルトフォーマッタ。\n\n- Lout — 軽量なドキュメント整形システム。LaTeX と同じようにドキュメントの高水準記述を読み込んで PostScript を生成します。\n\n- SILE — Modern typesetting system inspired by TeX.\n\n- TeX — A high-quality typesetting system popular in academia.\n\n- en:Texinfo — Typesetting syntax for software manuals used by the GNU プロジェクト.\n\n"
    },
    {
      "title": "TeX エディタ",
      "level": 4,
      "content": "TeX、LaTeX、および関連ソフトウェア を使用することで、科学的なドキュメント、記事、ジャーナルなどを簡単に作成できます。\n\nWikipedia:Comparison of TeX editors および Wikibooks:LaTeX/Installation#Editors も参照してください。\n\n- AUCTeX — Together with RefTex, Emacs で TeX ファイルを作成・フォーマットするための拡張性のあるパッケージ。\n\n- gedit LaTeX Plugin — gedit にコード補完を追加して LaTeX 文章をコンパイルしたり BibTeX 目録を管理できるようにする。\n\n- GNOME LaTeX — GNOME デスクトップの LaTeX エディタで、コード補完とコンパイル、プロジェクトの管理に対応。\n\n- Gummi — 軽量な GTK ベースの TeX/LaTeX エディタ。連続的なプレビューモード、統合された BibTeX サポート、拡張性のあるスニペットインターフェイスとマルチドキュメントサポートが特徴。\n\n- Kile — 多くの機能を持っているユーザーフレンドリーな KDE デスクトップ用 TeX/LaTeX エディタ。\n\n- Ktikz — PGF/TikZ で簡単に図式を作れる small application.\n\n- LyX — 単純に外観にあわせて書くのではなく (WYSIWYG) 文章の構造を意識させる (WYSIWYM) ドキュメントプロセッサ。\n\n- Setzer — LaTeX editor written in Python with GTK.\n\n- TeXmacs — 科学者用に特別な機能がある WYSIWYW 編集プラットフォーム。\n\n- Texmaker — クロスプラットフォームの、軽量で使いやすい LaTeX IDE。LaTeX で文章を作成するのに必要な多数のツールが、たった一つのアプリケーションに全て統合されています。\n\n- TeXstudio — TeXMaker のフォークで、bibtex アイテムのコード補完、文法チェック、複数の LaTeX を実行する必要の自動検出などをサポート。\n\n- TeXworks — シンプルな TeX フロントエンドプログラムで、TeXShop をモデルにしています。\n\n- TikZiT — PGF/TikZ を使って素早く図やダイアグラムを作成するためのグラフィカルツール。\n\n- Vim-LaTeX-suite — vim 用の LaTeX 環境。\n\n"
    },
    {
      "title": "TeX 数式エディタ",
      "level": 4,
      "content": "- EqualX — リアルタイムプレビューができる LaTeX 方程式エディタ。\n\n- KLatexFormula — LaTeX 方程式から画像を生成するための GUI。\n\n- LibreOffice TexMaths extension — LibreOffice 用の LaTeX 方程式エディタ。\n\n"
    },
    {
      "title": "XML エディタ",
      "level": 4,
      "content": "Wikipedia:Comparison of XML editors も参照してください。\n\n- QXmlEdit — シンプルな Qt XML エディタと XSD ビューア。\n\n- XML Copy Editor — 高速で、XML の妥当性を確認する XML エディタ。\n\n- XML Tree Editor — XML ファイルをツリービューで表示し、基本的な操作（テキストノードやその属性の追加、編集、削除）を行うことができます。\n\n"
    },
    {
      "title": "Document converters",
      "level": 3,
      "content": "See also #Markup languages and PDF、PS および DjVu.\n\n- Antiword — MS Word to text converter.\n\n- catdoc — Converter for Microsoft Word, Excel, PowerPoint and RTF files to text.\n\n- docx2txt — MS Word Docx to text converter.\n\n- HTMLDOC — Reads HTML and Markdown source files or web pages and generates corresponding EPUB, HTML, PostScript, or PDF files with an optional table of contents.\n\n- mutool — All purpose tool based on MuPDF for dealing with document files in various manners.\n\n- Pandoc — マークアップと文書フォーマットを変換するためのスイスアーミーナイフ。\n\n- unoconv — Libreoffice ベースのドキュメントコンバーター。\n\n- UnRTF — Command-line program which converts RTF documents to other formats.\n\n"
    },
    {
      "title": "参照文献マネージャ",
      "level": 3,
      "content": "See also Wikipedia:Comparison of reference management software.\n\n- Bibus — 参照文献インデックスを作成して OpenOffice.org/LibreOffice に直接挿入することができる参照文献データベース。\n\n- DocEar — Docear is 学術文献を検索・管理・作成するための学術文献スイート。マインドマップソフトウェアの Freeplane とリファレンスマネージャの JabRef から作られています。\n\n- JabRef — BibTeX やその他のビブリオグラフィを管理するための Java GUI フロントエンド。\n\n- KBibTeX — BibTeX editor by KDE to edit bibliographies used with LaTeX.\n\n- Mendeley Desktop — Proprietary reference manager and academic social network.\n\n- Papis — A command-line based document and bibliography manager.\n\n- Pybliographer — Tool for managing bibliographic databases.\n\n- Referencer — GNOME application to organize documents or references, and ultimately generate a BibTeX bibliography file.\n\n- Zotero — 研究資料の収拾、管理、引用、共有に役立つフリーで使いやすいツールです。Can import and export BibTeX and has browser extensions.\n\n"
    },
    {
      "title": "文章リーダー・ビューア",
      "level": 3,
      "content": "- NFO Viewer — Simple viewer for NFO files.\n\n"
    },
    {
      "title": "PDF と DjVu",
      "level": 4,
      "content": "PDF、PS および DjVuを参照してください。\n\n"
    },
    {
      "title": "電子書籍",
      "level": 4,
      "content": "- Bookworm — Elementary OS の電子書籍リーダー。EPUB, PDF, Mobipocket, Comicbook をサポート。\n\n- Calibre — 電子書籍ライブラリ管理アプリケーションthat can also edit EPUB files, 様々な電子書籍リーダーとの同期やフォーマット変換も可能。サポートしているフォーマットは CHM, Comicbook, DjVu, DOCX, EPUB, FictionBook, HTML, HTMLZ, Kindle, LIT, LRF, Mobipocket, ODT, PDF, PRC, PDB, PML, RB, RTF, SNB, TCR, TXT, TXTZ など。\n\n- Cool Reader — 多くのフォーマットをサポートしている電子書籍ビューア。サポートしているのは EPUB (DRM フリー), FictionBook, TXT, RTF, HTML, CHM, TCR など。\n\n- FBReader — 多くのフォーマットをサポートしている電子書籍ビューア。サポートしているのは EPUB, FictionBook, HTML, plucker, PalmDoc, zTxt, TCR, CHM, RTF, OEB, Mobipocket (DRM フリー), TXT など。\n\n- Foliate — Simple and modern GTK eBook reader. Supports EPUB, Mobipocket, Kindle, FictionBook, and Comicbook formats.\n\n- GNOME Books — E-book manager application for GNOME with EPUB, Mobipocket, FictionBook, DjVu and Comicbook support.\n\n- Lector — Qt based e-book reader with PDF, EPUB, Kindle, Mobipocket and Comicbook support.\n\n- Sigil — WYSIWYG EPUB ebook エディタ。\n\nSome PDF viewers like apvlv, Atril, MuPDF, Okular and Xreader also support the EPUB format.\n\n"
    },
    {
      "title": "漫画ビューア",
      "level": 4,
      "content": "- Automedia — 様々なウェブサイトから漫画やアニメをダウンロードするための非常に小さなダウンローダーです。HakuNeko の代わりとして、より軽量になるように設計されています。主に C 言語で書かれています。\n\n- Buoh — GNOME 用のオンラインストリップコミックリーダー。\n\n- HakuNeko — 様々なサイトからマンガやアニメをダウンロードすることができるダウンローダーです。 Electron プラットフォームをベースにしています。\n\n- Kindle Comic Converter — PNG, JPG, GIF, CBZ, CBR, CB7 ファイルを EPUB や MOBI 形式の電子書籍に変換することができます。\n\n- Komikku — GNOME 用のオンライン/オフラインのマンガリーダー。\n\n- Manga Reader — ローカルファイル用のマンガリーダー。zip, rar, tar, 7z, cbz, cbr, cbt, cb7 ファイルとフォルダをサポートします。\n\n- MComix — 漫画アーカイブを読むのに作られた GTK3 画像ビューア (Comix のフォーク)。ライブラリマネージャも付属。\n\n- Peruse — KDEによるコミックブックリーダー。\n\n- QComicBook — 利便性とシンプルさを追求したコミックアーカイブス用ビューア。\n\n- QuickMedia — オンライン漫画リーダー。waifu2x-ncnn-vulkan によるページの自動アップスケーリングに対応しています。\n\n- YACReader — C++ と Qt5 で書かれたコミックビューア。付属している YACReaderLibrary でコミックを管理できます。\n\nAtril, Bookworm, Calibre, Evince, Foliate, Lector, MuPDF, Okular, Xreader, Zathura などのいくつかの PDF や電子書籍ビューアもコミックブックフォーマットに対応しています。\n\n"
    },
    {
      "title": "CHM",
      "level": 4,
      "content": "See also Wikipedia:Microsoft Compiled HTML Help.\n\n- Archmage — CHM 形式のファイルの Extensible リーダーおよび逆コンパイラ。\n\n- Kchmviewer — chmlib を使う、xchm からもアイデアを拝借している Qt ベースの CHM ビューア。KDE には依存していませんが、統合するようにコンパイルすることもできます。\n\n- xCHM — chmlib ベースの軽量な CHM ビューア。\n\nSome PDF and E-book viewers like Cool Reader, FBReader and Okular also support the CHM format.\n\n"
    },
    {
      "title": "Document managers",
      "level": 3,
      "content": "- GNOME Documents — Document manager application for GNOME with PDF, DVI, XPS, PostScript, Microsoft Office, LibreOffice and Google Docs support.\n\n- Paperwork — Personal document manager. It manages scanned documents and PDFs.\n\n- Shelf — Document and EBook collection manager that supports PDF and EPUB files.\n\n"
    },
    {
      "title": "スキャニングソフトウェア",
      "level": 3,
      "content": "SANE#フロントエンドのインストール を参照。\n\n- ScanTailor Advanced — Interactive post-processing tool for scanned pages. Fork of Scan Tailor with additional features and fixes.\n\n"
    },
    {
      "title": "Console",
      "level": 4,
      "content": "See also Wikipedia:Comparison of optical character recognition software.\n\n- CuneiForm — Cognitive Technologies によって開発されオープンソース化されたコマンドラインの OCR システム。サポートしている言語: eng, ger, fra, rus, swe, spa, ita, ruseng, ukr, srp, hrv, pol, dan, por, dut, cze, rum, hun, bul, slo, lav, lit, est, tur。\n\n- GOCR — バーコード認識もサポートする OCR エンジン。\n\n- Ocrad — 特徴抽出法に基づく OCR プログラム。\n\n- OCRmyPDF — Adds an OCR text layer to scanned PDF files, allowing them to be searched.\n\n- OCRopus — OCR プラットフォーム、ドキュメントレイアウトや自然言語モデルを解析するモジュールが存在します (Tesseract や独自のエンジンを使用可能)。\n\n- Tesseract — 正確なオープンソースの OCR エンジン。パッケージは分割されており、言語ごとにデータファイルをインストールする必要があります (例えば tesseract-data-eng)。\n\n"
    },
    {
      "title": "Graphical",
      "level": 4,
      "content": "- gImageReader — Tesseract のグラフィカル GTK/Qt フロントエンド。\n\n- gscan2pdf — スキャンして OCR エンジンを実行して、ポストプロセス処理を施して、ドキュメントを作成。\n\n- Linux-Intelligent-Ocr-Solution — Easy-OCR solution and Tesseract trainer for converting print into text using either scanner or a camera.\n\n- OCRFeeder — ドキュメント解析と翻訳を行う Gnome の Python GUI。OCR エンジンとして CuneiForm, GOCR, Ocrad, Tesseract を使用可能。PDF や画像ファイルをインポートして HTML や OpenDocument にエクスポートできる。\n\n- Paperwork — Personal document manager. It manages scanned documents and PDFs.\n\n- Scans to PDF — Create small, searchable PDFs from scanned documents.\n\n- YAGF — Graphical interface for the CuneiForm text recognition program on the Linux platform.\n\n"
    },
    {
      "title": "メモ管理",
      "level": 4,
      "content": "See also Wikipedia:Comparison of notetaking software.\n\n- Geeknote — Command line client for Evernote.\n\n- hierarchical notebook — XML フォーマットを使って様々な種類のデータ（アドレス、to-do リスト、アイデア、ブックレビューなど）をひとつに管理するプログラム。\n\n- Org mode — ノート用の Emacs モード。プロジェクトのプランニングとオーサリング。\n\n- tnote — Small note taking program for the terminal.\n\n- Vimwiki — Personal wiki for Vim – interlinked, plain text files written in a markup language.\n\n- BasKet — ノートの作成・管理・共有をするアプリケーション。スクラップブックのように様々なタイプの情報を管理できます。to-do リスト、リンク、画像など。\n\n- Boostnote — Note-taking application for programmers that focuses on markdown, snippets, and customizability. Based on the Electron platform.\n\n- Buho — Task and note keeper to save links, write quick notes and organize pages as books.\n\n- Cherrytree — 階層式のノート作成アプリケーション。リッチテキストやシンタックスハイライトの機能があり、ひとつの XML か sqlite ファイルにデータを保存します。\n\n- Deepin Voice Notes — Lightweight memo tool to make text notes and voice recordings.\n\n- Encryptic — JavaScript note taking application with Markdown editor and encryption support. Based on the Electron platform.\n\n- FeatherNotes — Lightweight Qt hierarchical notes-manager.\n\n- FromScratch — Simple but smart note-taking application that you can use as a quick note taking or todo app. Based on the Electron platform.\n\n- GNOME Notes — Note editor for GNOME designed to remain simple to use.\n\n- Gnote — Tomboy の C++ 移植。It is the same note taking application, including most of the add-ins.\n\n- Joplin — Note taking and to-do application, which can handle a large number of notes organized into notebooks. Based on the Electron platform.\n\n- KeepNote — クロスプラットフォームの GTK メモ作成アプリケーション。リッチテキストフォーマット。\n\n- KJots — Note taking application for KDE.\n\n- Mikidown — Note taking application featuring markdown syntax.\n\n- MyNotex — Note-taking, document file and activity manager.\n\n- Nextcloud Notes — Simple notes app for Nextcloud.\n\n- NixNote — Helps you take notes and stay organized. Create text notes, attach files or images, and even synchronize with Evernote. 旧名 Nevernote。\n\n- Norka — Note-taking software with Markdown support designed for Pantheon.\n\n- Notejot — Stupidly simple sticky notes applet for elementaryOS.\n\n- Notes — Note-taking application, write down your thoughts.\n\n- Notes-Up — Markdown notes editor and manager for elementaryOS.\n\n- Notorious — Keyboard centric note-taking application with Markdown syntax highlighting support.\n\n- nvPY — Simplenote syncing note-taking application, inspired by Notational Velocity and ResophNotes, but uglier and cross-platformerer.\n\n- OutWiker — Store notes in a tree.\n\n- QOwnNotes — オープンソースのメモ帳・ToDo リストマネージャ。Markdown をサポートし任意で ownCloud と統合させることができます。qt5 を使用。\n\n- Simplenote — The simplest way to keep notes. Based on the Electron platform.\n\n- Standard Notes — Simple and private notes application which focuses on simplicity, and encrypts data locally before it ever touches a cloud. Based on the Electron platform.\n\n- TagSpaces — Offline personal data manager for managing of your local files. Based on the Electron platform.\n\n- TiddlyWiki — Unique non-linear notebook for capturing, organizing and sharing complex information.\n\n- Tomboy — wiki のようなリンクシステムでメモを繋げることができる Linux と Unix 用のデスクトップメモアプリケーション。\n\n- Trilium — Build your personal knowledge base with Trilium Notes.\n\n- TuxCards — Hierarchical notebook to enter and manage ever every kind of notes and ideas in a structured manner.\n\n- VNote — Vim-inspired note-taking application that knows programmers and Markdown better.\n\n- WikidPad — Wiki-like notebook for storing your thoughts, ideas, todo lists, contacts, or anything else you can think of to write down.\n\n- WizNote — クラウドノート管理クライアント。\n\n- Zim — wiki のコンセプトをデスクトップに取り入れるを目指している WYSIWYG テキストエディタ。\n\n- zNotes — シンプルなインターフェイスによるノート管理のたけの軽量クロスプラットフォームアプリケーション。\n\n- μPad — Note-taking app that helps you organise + take notes without restrictions. Based on the Electron platform.\n\n"
    },
    {
      "title": "手書きメモ",
      "level": 4,
      "content": "- Cournal — Collaborative note taking and journal application using a stylus. It allows multiple users to annotate PDF files in real-time.\n\n- Write — A proprietary 手書きのワードプロセッサ。\n\n- Xournal — 手書きでメモを書いたり、スケッチしたり、日記を付けるためのアプリケーション。Capable of annotating existing PDF files as well.\n\n- Xournal++ — Notetaking software designed around a tablet. C++ による Xournal の改良版 with PDF annotation support.\n\n- Rnote — A simple note taking application written in Rust and GTK4.\n\n"
    },
    {
      "title": "Diary",
      "level": 4,
      "content": "- Almanah — Small GTK application to allow you to keep a diary of your life.\n\n- Hazama — Simple and highly customizable application for keeping diary. There is no calendar but a big list that contains preview of diaries.\n\n- Lifeograph — Off-line and private journal and note taking application. It offers a rich feature set presented in a clean and simple user interface.\n\n- RedNotebook — フォーマット・タグ付け・エントリ検索ができる近代的なジャーナル。\n\n- Simple Diary — Simple and lightweight diary app with Markdown support.\n\n"
    },
    {
      "title": "マインドマップツール",
      "level": 4,
      "content": "See also Wikipedia:List of concept- and mind-mapping software.\n\n- FreeMind — Java で書かれたマインドマップソフトウェア。\n\n- Freeplane — Fork of FreeMind, 仕事場・学校・家庭などで物事を考えたり情報を共有したりするのに使うソフトウェアアプリケーション。マインドマップや情報の解析にも利用できます。\n\n- Labyrinth — 軽量なマインドマップツール, written in Python using GTK, 画像のインポートや描画をサポート。\n\n- Minder — Mind-mapping application designed for Pantheon.\n\n- MindMaster — Proprietary mindmap and brainstorm software with modern UI and beautiful template. It also provides online mindmap service and cross-platform sharing.\n\n- Semantik — KDE のマインドマップアプリケーション。\n\n- TreeSheets — A \"hierarchical spreadsheet\" that is スプレッドシート・マインドマップ・アウトライナー・PIM・テキストエディタ・データベースを全て置き換えるソフトウェア。\n\n- View Your Mind — 思考内容のマップを作成するツール。創造性・効率性を改善できます。時間管理やタスクの処理に使ったり、複雑なものを解きほぐしたり、アイデアを並べてみたりすることが可能。\n\n- Visual Understanding Environment — 教育・学習・研究を支援するデジタルな資料を管理・統合するための柔軟なツール。\n\n- XMind — ブレインストーミング・マインドマップアプリケーション。様々な視覚化スタイルを使って、ウェブサイトで作成したマインドマップを共有できます。\n\n"
    },
    {
      "title": "Sticky notes",
      "level": 4,
      "content": "- GloboNote — Easy to use desktop note taking application. You can use it to create sticky notes, to-do lists, personal journals, reminders and other notes all in one application.\n\n- KNotes — コンピュータ上で付箋を書くことができるプログラム。Part of kdepim[リンク切れ: package not found].\n\n- MyNotes — Sticky note application. An icon appears in the system tray and from it you can create and manage your sticky notes.\n\n- Notes — Provides you a quick way to paste text, to write down a list of things, to leave a note to your friend, or whatever you had do with Post-It's.\n\n- PrimeNote — Most polished, cross-platform sticky note application (PyQt5). Provides support for Cloud, Vim, CSS styling and more !\n\n- xNots — Desktop post-it/sticky note system for the Unix geek.\n\n- Xpad — Sticky note application for jotting down things to remember.\n\n"
    },
    {
      "title": "Distraction-free writing",
      "level": 4,
      "content": "See also #Markdown editors and Wikipedia:Full-screen writing program.\n\n- FocusWriter — Simple, distraction-free writing environment. It utilizes a hide-away interface that you access by moving your mouse to the edges of the screen, allowing the program to have a familiar look and feel to it while still getting out of the way so that you can immerse yourself in your work.\n\n- PyRoom — Fullscreen editor without buttons, widgets, formatting options, menus and with only the minimum of required dialog windows, it does not have any distractions and lets you focus on writing and only writing.\n\n- Quilter — Focus on your writing and write beautiful solid stories with the Focus Mode in tow in this Markdown editor.\n\n- TextRoom — Fullscreen text editor for writers.\n\n"
    },
    {
      "title": "Story writing",
      "level": 4,
      "content": "- Manuskript — Provides a rich environment to help writers create their first draft and then further refine and edit their masterpiece.\n\n- NovProg — Tool to graph your progress in writing a NaNoWriMo style novel.\n\n- oStorybook — Tool for writers, essayists, authors from the draft to the final work.\n\n"
    },
    {
      "title": "Screenwriting",
      "level": 4,
      "content": "- KIT Scenarist — Simple and powerful application for creating screenplays.\n\n- Magic Fountain — Fountain syntax editor and viewer for writing screenplays.\n\n- Trelby — Simple, fast and elegantly laid out to make screenwriting simple.\n\n"
    },
    {
      "title": "Dictionary and thesaurus",
      "level": 4,
      "content": "See also Wikipedia:Category:Dictionary software and Wikipedia:DICT#DICT clients.\n\n- dictd — Client/server software for the DICT protocol.\n\n- sdcv — Command line dictionary. It provides access to dictionaries in StarDict's format.\n\n- thesauromatic — Static, offline, command-line thesaurus written in Rust.\n\n- Artha — English thesaurus that works completely off-line and is based on WordNet.\n\n- Gjiten Kai — Rewrite of Gjiten, a GTK Japanese dictionary.\n\n- GNOME Dictionary — GNOME application to check word definitions and spellings in an online dictionary.\n\n- GoldenDict — Feature-rich dictionary lookup program.\n\n- Kiten — Japanese reference and study tool. Part of kde-education.\n\n- MATE Dictionary — MATE application to look up words in dictionary sources.\n\n- OpenDict — Computer dictionary, which supports popular computer dictionary formats including Slowo and Mova. It also acts as a client for DICT servers.\n\n- Palaura — Handy dictionary to find any word's definition.\n\n- PowerWord — Proprietary Chinese-English dictionary tool.\n\n- QStarDict — Dictionary program written using Qt. The user interface is similar to StarDict.\n\n- Quick Lookup — Simple GTK dictionary application powered by Wiktionary.\n\n- StarDict — International dictionary software.\n\n- Xfce4 Dictionary — Search different kinds of dictionary services for words or phrases.\n\n"
    },
    {
      "title": "Spell checkers",
      "level": 4,
      "content": "See en:Language checking.\n\n"
    },
    {
      "title": "翻訳・地域化",
      "level": 4,
      "content": "See also Wikipedia:Comparison of computer-assisted translation tools.\n\n- Apertium — 言語データを含む、フリーのオープンソースなルールベース機械翻訳プラットフォーム。次のフォーマットをサポート: HTML, Microsoft Office 2007 XML, OpenDocument, TMX, MediaWiki など。\n\n- Crow Translate — Simple and lightweight translator that allows to translate and speak text using Google, Yandex and Bing.\n\n- Dialect — A translation app for GNOME based on Google Translate.\n\n- Gtranslator — GNOME の gettext po ファイルエディタ。gettext po ファイルの全ての形式を扱い便利な機能が含まれています。\n\n- Lokalize — ソフトウェア翻訳のための標準 KDE ツール。PO ファイルの編集機能に加えて、用語集・翻訳メモリ・プロジェクト管理などをサポート。It belongs to kdesdk\n\n- Moses — 統計に基づく機械翻訳ツール（言語データは含まれていません）。\n\n- OmegaT — 一般的な翻訳支援ツール。翻訳メモリなどの多くの機能を持ち Google 翻訳からのサジェストも可能。次のフォーマットをサポート: HTML, Microsoft Office 2007 XML, OpenDocument, XLIFF/Okapi, MediaWiki, plain text, TMX など。\n\n- Poedit — Simple translation editor for gettext (PO, POT) and XLIFF.\n\n- Pology — gettext/po-ファイル を扱うための Python ツールのセット。\n\n- Qt Linguist — Translating Qt C++ and Qt Quick applications into local languages.\n\n- Translate Shell — Command-line interface and interactive shell for Google Translate.\n\n- Translate Toolkit — Localization and translation toolkit, which provides a set of tools for working with localization file formats and files that might need localization.\n\n"
    },
    {
      "title": "コンソール",
      "level": 4,
      "content": "- barcode — テキスト文字列をバーコードに変換するツール。\n\n- iec16022 — DataMatrix と呼ばれる 2D バーコードを生成。\n\n- qrencode — QR コードでデータをエンコードするための C ライブラリとコマンドラインツール。\n\n- ZBar — 様々なソースからバーコードを読み込むアプリケーションとライブラリ。\n\n- Zint — 50以上の規格に対応しているバーコードエンコーディングライブラリ・コマンドラインツール。\n\n"
    },
    {
      "title": "グラフィカル",
      "level": 4,
      "content": "- CoBang — QR Code scanner application.\n\n- gLabels — ラベルや名刺を作成するためのプログラム。バーコードの作成もサポート。\n\n- QRab — Simply grabs QR code from screen and copies decoded text into clipboard.\n\n- Qreator — Graphical utility for creating QR codes.\n\n- QtQR — QR コードジェネレータ・デコーダー。\n\n- ZBarCam GUI — Simple GUI for ZBar to read bar codes from various sources.\n\n- Zint Barcode Studio — バーコードジェネレータ GUI。\n\n"
    }
  ]
}