{
  "title": "List of applications (Polski)/Multimedia (Polski)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Polski)/Multimedia_(Polski)",
  "sections": [
    {
      "title": "Kodeki",
      "level": 2,
      "content": "Zobacz główny artykuł: Codecs.\n\n"
    },
    {
      "title": "Przeglądarki obrazów",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of image viewers.\n\n"
    },
    {
      "title": "Framebuffer",
      "level": 4,
      "content": "- fbi — Przeglądarka obrazów dla konsoli framebuffer systemu Linux.\n\n- fbv — Bardzo prosta przeglądarka plików graficznych dla konsoli framebuffer.\n\n- fim — Wysoce konfigurowalna i skryptowalna przeglądarka obrazów framebuffer oparta na fbi.\n\n- jfbview — Przeglądarka plików PDF i obrazów dla dla framebuffer z oparta na Imlib2. Funkcje obejmują sterowanie podobne do Vima, obracanie i powiększanie, powiększanie do dopasowania i szybkie renderowanie wielowątkowe.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- timg — Konsolowa przeglądarka obrazów i wideo.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- CoreImage — Prosta, lekka i łatwa w użyciu przeglądarka obrazów oparta na Qt. Część C-Suite.\n\n- Deepin Image Viewer — Przeglądarka obrazów dla Deepin desktop.\n\n- Ephoto — Lekka przeglądarka obrazów oparta na EFL.\n\n- Eye of GNOME — Przeglądarka obrazów dla środowiska GNOME. Część gnome-extra.\n\n- Eye of MATE — Prosta przeglądarka grafiki dla pulpitu MATE.\n\n- feh — Szybka, lekka przeglądarka obrazów wykorzystująca imlib2.\n\n- GPicView — Prosta i szybka przeglądarka obrazów dla X, która jest częścią pulpitu LXDE.\n\n- Gwenview — Szybka i łatwa w użyciu przeglądarka obrazów dla pulpitu KDE z opcjonalnymi zależnościami do obsługi dodatkowych formatów. Część kde-graphics.\n\n- ida — Aplikacja X11 (oparta na Motif) do przeglądania obrazów. W razie potrzeby zainstaluj opcjonalne zależności.\n\n- image-roll — Prosta i szybka przeglądarka obrazów GTK z podstawowymi narzędziami do manipulacji grafiki.\n\n- imv — Lekka przeglądarka obrazów z obsługą Wayland i animowanych GIF-ów, korzystająca z FreeImage.\n\n- Koko — Przeglądarka obrazów zaprojektowana dla komputerów stacjonarnych i urządzeń dotykowych. Część kde-graphics.\n\n- KuickShow — Szybka i wygodna przeglądarka obrazów dla KDE.\n\n- LxImage-Qt — Przeglądarka obrazów LXQt.\n\n- Loupe — Prosta przeglądarka obrazów dla środowiska GNOME. Część gnome.\n\n- meh — meh to mała, prosta, super szybka przeglądarka obrazów wykorzystująca XLib.\n\n- Mirage — Przeglądarka obrazów PyGTK z obsługą przycinania i zmiany rozmiaru, niestandardowymi akcjami i panelem miniatur.\n\n- mpv-gallery-view — Skrypty podglądu galerii dla mpv.\n\n- mpv-image-viewer — Konfiguracja, skrypty i wskazówki dotyczące korzystania z mpv jako przeglądarki obrazów.\n\n- nomacs — Przeglądarka obrazów Qt. Jest bogata w funkcje, ale uruchamia się szybko i można ją skonfigurować tak, aby wyświetlała dodatkowe widżety lub tylko obraz.\n\n- nsxiv — Prosta przeglądarka obrazów oparta na imlib2, która działa dobrze z menedżerami okien kafelkowych. Społecznościowy fork sxiv.\n\n- PhotoQt — Szybka i wysoce konfigurowalna przeglądarka obrazów z prostym i przyjemnym interfejsem.\n\n- pqiv — Przeglądarka obrazów oparta na GTK 3 z minimalnym interfejsem użytkownika obsługująca obrazy w skompresowanych archiwach, rewrite qiv.\n\n- qimgv — Szybka i łatwa w użyciu przeglądarka obrazów Qt5. Obsługuje odtwarzanie webm/mp4 przez mpv.\n\n- Quick Image Viewer — Bardzo mała i szybka przeglądarka obrazów oparta na GTK i imlib2.\n\n- qView — Przeglądarka obrazów Qt zaprojektowana z myślą o minimalizmie i użyteczności.\n\n- Ristretto — Szybka i lekka przeglądarka obrazów dla środowiska graficznego Xfce.\n\n- shufti — shufti w sposób nieniszczący zapisuje i przywraca poziom powiększenia, obrót, rozmiar okna, lokalizację na pulpicie i obszar wyświetlania dla każdego obrazu/lokalizacji pliku\n\n- sxiv — Prosta przeglądarka obrazów oparta na imlib2, która działa dobrze z menedżerami okien kafelkowych.\n\n- Viewnior — Minimalistyczna przeglądarka obrazów GTK z obsługą przerzucania, obracania, animacji i konfigurowalnych akcji myszy.\n\n- Vimiv — Przeglądarka obrazów z powiązaniami klawiszy podobnymi do vima. Jest napisana w python3 przy użyciu zestawu narzędzi Gtk3.\n\n- Vimiv (Qt port) — Przeglądarka obrazów z powiązaniami klawiszy podobnymi do vima. Jest napisana w python3 i PyQt5.\n\n- vpv — Przeglądarka obrazów przeznaczona do wizualizacji obrazów naukowych.\n\n- Xloadimage — Klasyczna przeglądarka obrazów X.\n\n"
    },
    {
      "title": "Organizatory obrazów",
      "level": 3,
      "content": "Zobacz także Wikipedia:Image organizer.\n\n- Deepin Album — Menedżer zdjęć do przeglądania i organizowania zdjęć, dla pulpitu Deepin.\n\n- digiKam — Oparty na KDE organizer obrazów z wbudowanymi funkcjami edycji za pośrednictwem architektury wtyczek. digiKam zapewnia, że jest bardziej funkcjonalny niż podobne aplikacje z większym zestawem funkcji manipulacji obrazami, w tym importem i manipulacją obrazami RAW.\n\n- Frogr — Niewielka aplikacja dla środowiska GNOME, która pozwala użytkownikom zarządzać kontami w serwisie hostującym zdjęcia Flickr.\n\n- Geeqie — Przeglądarka obrazów (fork GQview), która dodaje dodatkowe funkcje, takie jak obsługa plików RAW.\n\n- GNOME Photos — Dostęp, porządkowanie i udostępnianie zdjęć w środowisku GNOME. Część gnome-extra.\n\n- gThumb — Przeglądarka obrazów dla środowiska GNOME.\n\n- KPhotoAlbum — Oprogramowanie do katalogowania obrazów cyfrowych, które obsługuje adnotacje, przeglądanie, wyszukiwanie i przeglądanie cyfrowych obrazów i filmów.\n\n- Memories — Przeglądarka i menedżer obrazów zaprojektowany dla elementary OS.\n\n- Pantheon Photos — Organizator zdjęć dla Pantheon.\n\n- PhotoPrism — Zarządzanie zdjęciami osobistymi oparte na Go i Google TensorFlow.\n\n- Phototonic — Szybka i funkcjonalna przeglądarka obrazów (Qt).\n\n- Pix — Galeria i przeglądarka obrazów, która może być używana do otwierania obrazów za pomocą innych aplikacji, takich jak edytor obrazów. Umożliwa także dodawanie tagów do plików, dodawanie adnotacji do zdjęć, obracanie i udostępnianie ich.\n\n- Pix — Przeglądarka obrazów oparta na gthumb. Projekt X-Apps.\n\n- Rapid Photo Downloader — Pobieranie zdjęć i filmów z aparatów, kart pamięci i przenośnych urządzeń pamięci masowej.\n\n- Shotwell — Cyfrowy organizer zdjęć zaprojektowany dla środowiska graficznego GNOME\n\n"
    },
    {
      "title": "Przetwarzanie obrazów",
      "level": 3,
      "content": "- CairoSVG — Konwerter SVG na PNG, PDF, PS.\n\n- Converseen — Oparty na Qt wsadowy konwerter. Umożliwia również zmianę rozmiarów grafiki.\n\n- CropGUI — Narzędzie GTK do bezstratnego przycinania i obracania plików JPEG.\n\n- dcraw — Konwertuje wiele formatów RAW z aparatów.\n\n- G'MIC — W pełni funkcjonalny open-source'owy framework do przetwarzania obrazów, zapewniający kilka różnych interfejsów użytkownika do konwersji/manipulacji/filtrowania/wizualizacji ogólnych zestawów danych obrazów, od sygnałów skalarnych 1d do sekwencji 3d+t wielospektralnych obrazów wolumetrycznych, w tym obrazów kolorowych 2d.\n\n- GraphicsMagick — Fork ImageMagick zaprojektowany z myślą o stabilności API i wiersza poleceń. Obsługuje również wiele procesorów w celu zwiększenia wydajności i dlatego jest używany przez niektóre duże witryny komercyjne (Flickr, etsy) ze względu na swoją wydajność.\n\n- ImageMagick — Program do manipulacji obrazami z wiersza poleceń. Znany jest z dokładnej konwersji formatów z obsługą ponad 100 formatów. Jego interfejs API umożliwia tworzenie skryptów i jest zwykle używany jako procesor backendowy.\n\n- ImPPG — wykonuje dekonwolucję Lucy-Richardson, maskowanie bez wyostrzania, normalizację jasności i regulację krzywej tonalnej\n\n- PosteRazor — Umożliwa rozdzielenie obrazu lub pliku PDF na części, które można wydrukować i złożyć w plakat.\n\n- waifu2x — Upscaling dla sztuki w stylu anime przy użyciu głębokich konwolucyjnych sieci neuronowych.\n\n"
    },
    {
      "title": "Kompresja obrazów",
      "level": 4,
      "content": "- Guetzli — Percepcyjny koder JPEG, którego celem jest uzyskanie doskonałej gęstości kompresji przy wysokiej jakości wizualnej.\n\n- jpegoptim — Narzędzie do optymalizacji JPEG zapewniające bezstratną i stratną kompresję.\n\n- optipng — Bezstratny kompresor PNG.\n\n- oxipng — Bezstratny wielowątkowy kompresor PNG.\n\n- pngcrush — Narzędzie do optymalizacji kompresji plików PNG.\n\n- pngquant — Kompresja stratna obrazów PNG.\n\n- zopflipng — Wysoce wydajne narzędzie do optymalizacji PNG wykorzystujące bibliotekę Google zopfli\n\n- Curtail — Kompresor obrazów oparty na GTK, obsługujący typy plików PNG i JPEG.\n\n- Image Optimizer — Prosty bezstratny optymalizator obrazu zbudowany z Vala i Gtk dla Elementary OS.\n\n- Trimage — Oparte na Qt narzędzie do optymalizacji plików PNG i JPG.\n\n"
    },
    {
      "title": "Edytory grafiki rastrowej",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of raster graphics editors.\n\n- AzPainter — Oprogramowanie malarskie do rysowania ilustracji.\n\n- CorePaint — Proste narzędzie do malowania bitmap w celu tworzenia bardzo prostych grafik. Część C-Suite.\n\n- Deepin Draw — Lekkie narzędzie do rysowania dla Deepin Desktop.\n\n- Drawing — Aplikacja do rysowania dla środowiska GNOME, wykorzystująca Cairo i GdkPixbuf do podstawowych operacji rysowania.\n\n- Drawpile — Program do wspólnego rysowania, który umożliwia wielu użytkownikom jednoczesne szkicowanie na tym samym płótnie.\n\n- GIMP — Pakiet do edycji obrazów w duchu edytorów własnościowych, takich jak Adobe Photoshop. GIMP (GNU Image Manipulation Program) został zapoczątkowany w połowie lat 90. i zyskał dużą liczbę pluginów oraz dodatkowych narzędzi.\n\n- Gpaint — Klon Paintbrusha dla środowiska GNOME.\n\n- GrafX2 — Program do malowania bitmap specjalizujący się w rysowaniu w 256 kolorach.\n\n- ImEditor — Prosty i wszechstronny edytor obrazów.\n\n- KolourPaint — Darmowy edytor grafiki rastrowej dla KDE, podobny do aplikacji Paint Microsoftu sprzed Windows 7, ale z kilkoma dodatkowymi funkcjami, takimi jak obsługa przezroczystości. Część grup kde-applications i kde-graphics.\n\n- Krita — Oprogramowanie do cyfrowego malowania i ilustracji oparte na platformie KDE.\n\n- KXStitch — Tworzenie wzorów stitchu krzyżykowego i wykresów.\n\n- Milton — Program do malowania na nieskończonym płótnie.\n\n- mtPaint — Program do edycji grafiki przeznaczony do tworzenia indeksowanych obrazów paletowych i pixel artu.\n\n- MyPaint — Darmowa aplikacja graficzna dla malarzy cyfrowych.\n\n- PhotoFlare — Prosty, ale potężny edytor obrazów, pierwotnie zainspirowany PhotoFiltre.\n\n- Pinta — Program do rysowania i edycji wzorowany na Paint.NET. Jego celem jest zapewnienie uproszczonej alternatywy dla GIMP dla zwykłych użytkowników.\n\n- Pixelitor — Zaawansowany edytor obrazów z obsługą warstw, masek warstw, warstw tekstowych, wielokrotnego cofania, trybów mieszania, kadrowania, rozmycia gaussowskiego, maskowania nieostrości, histogramów itp.\n\n- Swappy — Narzędzie do edycji migawek natywne dla Wayland.\n\n- XPaint — Narzędzie do edycji kolorowych obrazów, które oferuje większość standardowych opcji programu do malowania.\n\nNiektóre przeglądarki i organizery obrazów, takie jak digiKam, Ephoto, GNOME Photos, gThumb, ida, nomacs, Pantheon Photos, Phototonic i Shotwell również zapewniają podstawowe funkcje obróbki obrazów.\n\n"
    },
    {
      "title": "Specjalistyczne edytory zdjęć",
      "level": 3,
      "content": "- A Photo Tool (Libre) — Edytor zdjęć z łatwymi w użyciu podstawowymi narzędziami do edycji obrazu.\n\n- darktable — Aplikacja do obróbki zdjęć i tworzenia plików RAW.\n\n- Filmulator — Prosty edytor surowych zdjęć oparty na procesie wywoływania zdjęć.\n\n- FOSStriangulator — Narzędzie do tworzenia trójkątnych ilustracji ze zdjęć.\n\n- Hugin — Stitcher zdjęć panoramicznych.\n\n- LightZone — Profesjonalna cyfrowa ciemnia i edytor zdjęć porównywalny z Photoshop Lightroom.\n\n- Luminance HDR — Aplikacja z graficznym interfejsem użytkownika typu open source, której celem jest zapewnienie możliwości pracy z obrazami HDR.\n\n- nUFRaw — Narzędzie do odczytu i obróbki nieprzetworzonych obrazów z aparatów cyfrowych przy użyciu DCRaw.\n\n- Rawstudio — Konwerter surowych obrazów napisany w GTK.\n\n- RawTherapee — Potężny, wieloplatformowy program do przetwarzania surowych obrazów.\n\n- Showfoto — Edytor zdjęć z potężnymi narzędziami do edycji obrazu.\n\n"
    },
    {
      "title": "Geotagowanie zdjęć",
      "level": 3,
      "content": "- Geotag — Dopasowywanie informacji o dacie/godzinie ze zdjęć do informacji o lokalizacji z urządzenia GPS lub z mapy.\n\n- Geotagging — Narzędzie do geotagowania zdjęć w celu synchronizacji zdjęć z zapisem ścieżki GPS (GPX).\n\n- GottenGeography — Łatwa w użyciu aplikacja do geotagowania zdjęć dla środowiska GNOME.\n\n- GPicSync — Wstawia do zdjęć metadane lokalizacji z dziennika GPS.\n\n- GPSCorrelate — Korelacja (geotagowanie) zdjęć z aparatu cyfrowego z danymi GPS w formacie GPX.\n\n- KGeoTag — Aplikacja do geotagowania zdjęć oparta na KDE Frameworks.\n\n"
    },
    {
      "title": "Edytory grafiki wektorowej",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of vector graphics editors.\n\n- Dia — Program do tworzenia diagramów oparty na GTK.\n\n- diagrams.net — Aplikacja do rysowania diagramów oparta na technologii webowej. Oparta na platformie Electron.\n\n- Dot Matrix — Glifowy plac zabaw kreatywności z prostych linii.\n\n- Figma — Nieoficjalna aplikacja desktopowa dla narzędzia do wspólnego projektowania Figma. Oparta na platformie Electron.\n\n- Inkscape — Edytor grafiki wektorowej o możliwościach zbliżonych do Illustratora, CorelDraw, czy Xara X, wykorzystujący format plików SVG (Scalable Vector Graphics).\n\n- Karbon — Edytor grafiki wektorowej wchodzący w skład pakietu Calligra Suite.\n\n- LazPaint — Edytor obrazów, taki jak PaintBrush lub Paint.Net, napisany w języku Lazarus (Free Pascal)\n\n- LibreOffice Draw — Edytor grafiki wektorowej i narzędzie do tworzenia diagramów zawarte w pakiecie LibreOffice, podobne do Microsoft Visio.\n\n- Lunacy — Oprogramowanie do projektowania grafiki wektorowej dla UI/UX i projektowania stron internetowych.\n\n- Mockitt — Autorska platforma online do projektowania, prototypowania i współpracy. Oparta na platformie Electron.\n\n- OpenOffice Draw — Edytor grafiki wektorowej i narzędzie do tworzenia diagramów wchodzące w skład pakietu biurowego OpenOffice.\n\n- Pencil Project — Narzędzie do tworzenia prototypów i makiet GUI. Oparte na platformie Electron.\n\n- sK1 — Zamiennik Adobe Illustrator lub CorelDraw, zorientowany na \"gotowe do druku\" wydruki PostScript i PDF.\n\n- SvgVi — Przeglądarka i edytor SVG wykorzystujący deklaracje XML.\n\n- SymbolEditor — Aplikacja do tworzenia bibliotek obiektów QPainterPath z podpowiedziami renderowania.\n\n- yEd — Opatentowany program do tworzenia diagramów ogólnego przeznaczenia dla schematów blokowych, diagramów sieciowych, diagramów UML, diagramów BPMN, map myśli, schematów organizacyjnych i diagramów relacji jednostek.\n\n- Xfig — Interaktywne narzędzie do rysowania.\n\n"
    },
    {
      "title": "Edytory czcionek",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of font editors.\n\n- Birdfont — Edytor czcionek umożliwiający tworzenie grafiki wektorowej i eksportowanie czcionek TTF, EOT i SVG.\n\n- FontForge — Edytor czcionek konturowych.\n\n- TruFont — Aplikacja do edycji czcionek.\n\n"
    },
    {
      "title": "Animacja 2D",
      "level": 3,
      "content": "- enve — Elastyczne oprogramowanie do animacji 2D z możliwością rozbudowy przez użytkownika.\n\n- Glaxnimate — Oprogramowanie do animacji wektorowych 2D, głównie dla formatów Lottie i TGS, ale ma dobry standardowy eksport animacji SVG\n\n- OpenToonz — oprogramowanie do tworzenia animacji 2D.\n\n- Pencil2D — Łatwe, intuicyjne narzędzie do tworzenia ręcznie rysowanych animacji 2D.\n\n- qStopMotion — Aplikacja do tworzenia filmów animowanych poklatkowo. Użytkownicy będą mogli tworzyć animacje poklatkowe ze zdjęć zaimportowanych z kamery lub z dysku twardego i eksportować animacje do różnych formatów wideo, takich jak mpeg lub avi.\n\n- Scribl — Aplikacja do tworzenia prostych wykładów wideo łączących dźwięk z ręcznie rysowaną animacją.\n\n- Stopmotion — Aplikacja do tworzenia animacji poklatkowych. Pomaga przechwytywać i edytować klatki animacji oraz eksportować je jako pojedynczy plik.\n\n- Synfig Studio — oprogramowanie do animacji 2D, zaprojektowane jako potężne rozwiązanie przemysłowe do tworzenia animacji o jakości filmowej przy użyciu grafiki wektorowej i bitmapowej.\n\n- TupiTube Desk — Aplikacja komputerowa do tworzenia i udostępniania animacji 2D, przeznaczona dla dzieci i nastolatków.\n\n- Aseprite — Oprogramowanie open-source do tworzenia grafiki pikselowej i animacji. Kompilacje mogą być zakupione od deweloperów lub skompilowane ze źródła.\n\n- Pixelorama — Oprogramowanie open-source do tworzenia grafiki pikselowej i animacji.\n\n- Tahoma2D — Darmowe i wydajne oprogramowanie dla animatorów 2D i animacji poklatkowej. Oparty na OpenToonz\n\nAplikacja do rysowania Krita, edytor 3D Blender (tryb Grease Pencil) i biblioteka Pythona Manim również posiadają funkcje animacji 2D.\n\n"
    },
    {
      "title": "Grafika komputerowa 3D",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of 3D computer graphics software.\n\n- Art of Illusion — studio modelowania i renderowania 3D napisane w Javie.\n\n- Blender — W pełni zintegrowany pakiet do tworzenia grafiki 3D, umożliwiający między innymi modelowanie 3D, teksturowanie i animację.\n\n- Blockbench — Edytor modeli 3D low-poly\n\n- CloudCompare — oprogramowanie do przetwarzania chmur punktów i siatek 3D.\n\n- Dust3D — oprogramowanie do modelowania 3D. Pomaga stworzyć wodoszczelny model bazowy 3D w kilka sekund. Użyj go, aby przyspieszyć modelowanie postaci w tworzeniu gier, drukowaniu 3D itp.\n\n- F3D — Szybka, minimalistyczna, oparta na KISS przeglądarka 3D. Obsługiwane formaty plików: VTK (legacy i XML), STL, GLTF, PLY, OBJ, 3DS, ..\n\n- Goxel — Edytor wokseli 3D o otwartym kodzie źródłowym.\n\n- MakeHuman™ — Program do modelowania parametrycznego do tworzenia ludzkich ciał.\n\n- MeshLab — System do przetwarzania i edycji trójkątnych siatek 3D.\n\n- Sweet Home 3D — Aplikacja do projektowania wnętrz do planowania i opracowywania planów pięter\n\n- POV-Ray — Oparty na skryptach raytracer do tworzenia grafiki 3D.\n\n- VoxelShop — Niezwykle intuicyjne i potężne oprogramowanie do modyfikowania i tworzenia obiektów wokselowych.\n\n- Wings 3D — Zaawansowany modeler podziału, który jest zarówno potężny, jak i łatwy w użyciu.\n\n"
    },
    {
      "title": "Próbniki kolorów i palety",
      "level": 3,
      "content": "- Chameleon — Prosty selektor kolorów dla X11, który wysyła kolory na stdout.\n\n- ColorGrab — Wieloplatformowy selektor kolorów.\n\n- Color Palette — Narzędzie do przeglądania palety kolorów środowiska GNOME zgodnie z wytycznymi projektowymi.\n\n- colorpicker — Kliknij piksel na ekranie i wydrukuj jego wartość koloru w RGB. Napisana dla X11.\n\n- Color Picker — Uproszczony selektor kolorów dla pulpitu Pantheon.\n\n- Coulr — Pole kolorów, aby pomóc programistom i projektantom.\n\n- Deepin Picker — Narzędzie do wybierania kolorów dla pulpitu Deepin.\n\n- delicolour — Lekka wyszukiwarka kolorów GTK 3.\n\n- Gcolor3 — Prosty selektor kolorów GTK 3.\n\n- GPick — Zaawansowane narzędzie do wybierania kolorów.\n\n- hyprpicker — Selektor kolorów Wayland kompatybilny z wlroots, który nie ssie.\n\n- KColorChooser — Prosta aplikacja do wybierania koloru z ekranu lub z palety. Część kde-graphics.\n\n- Kontrast — Narzędzie do sprawdzania kontrastu kolorów, które pozwala zweryfikować, czy kolory są odpowiednio widoczne. Część kde-accessibility.\n\n- MATE Color Selection — Wybiera kolory z palety lub ekranu. Uruchom z mate-color-select.\n\n- Pick — Proste narzędzie do wybierania kolorów dla pulpitu systemu Linux.\n\n- PrestoPalette — Narzędzie artysty do tworzenia harmonijnych palet kolorów.\n\n- xcolor — Lekki próbnik kolorów dla X11.\n\n"
    },
    {
      "title": "Zrzuty ekranu",
      "level": 3,
      "content": "Zobacz Screen capture#Screenshot software.\n\n"
    },
    {
      "title": "Menedżery aparatów cyfrowych",
      "level": 3,
      "content": "Zobacz gPhoto#Installation.\n\n"
    },
    {
      "title": "Systemy audio",
      "level": 3,
      "content": "Zobacz także główny artykuł Sound system oraz Wikipedia:Sound server.\n\n"
    },
    {
      "title": "Odtwarzacze audio",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of audio player software.\n\nWiele aplikacji w sekcji #Odtwarzacze wideo obsługuje również odtwarzanie dźwięku.\n\n"
    },
    {
      "title": "Serwer",
      "level": 4,
      "content": "- Music Player Daemon — Odtwarzacz audio o architekturze serwer-klient. Do połączenia z nim potrzebny jest oddzielny klient.\n\n- Funkwhale — samodzielnie hostowany, nowoczesny, darmowy serwer muzyczny o otwartym kodzie źródłowym, mocno inspirowany Grooveshark. Instancje mogą być federowane.\n\n- Navidrome — Otwarty serwer muzyczny i streamer z wbudowanym interfejsem użytkownika. Kompatybilny z szeroką gamą aplikacji innych firm dla systemów Android i iOS.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- cmus — Bardzo bogaty w funkcje odtwarzacz muzyki oparty na ncurses.\n\n- cplay-ng — Zaktualizowany fork cplay.\n\n- davis — Klient CLI dla mpd, napisany w języku Rust.\n\n- MOC — Odtwarzacz audio konsoli Ncurses z obsługą formatów MP3, OGG i WAV.\n\n- mpg123 — Szybki, darmowy konsolowy odtwarzacz audio MP3 dla systemów Linux, FreeBSD, Solaris, HP-UX i prawie wszystkich innych systemów UNIX (dekoduje również pliki MP1 i MP2).\n\n- musikcube — Wieloplatformowy, terminalowy odtwarzacz muzyki, silnik audio, indeksator metadanych i serwer w języku C++.\n\n- vitunes — Oparty na curses odtwarzacz muzyki i menedżer list odtwarzania z powiązaniami klawiszy podobnymi do vima.\n\n- whistle — Odtwarzacz audio oparty na curses.\n\n- XMMS2 — Całkowite przepisanie popularnego odtwarzacza muzyki.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Blanket — Popraw koncentrację i zwiększ produktywność, słuchając różnych dźwięków.\n\n- Byte — Odtwarzacz muzyczny zaprojektowany dla elementary OS.\n\n- Clementine — Klon Amaroka 1.4, przeniesiony do Qt5. Zobacz także Strawberry (poniżej).\n\n- Cozy — Nowoczesny odtwarzacz książek audio dla systemu Linux wykorzystujący GTK 3.\n\n- Exaile — Klon GTK aplikacji Amarok.\n\n- GNOME Music — Odtwarzacz muzyki dla środowiska GNOME. Jego celem jest połączenie eleganckiego i wciągającego przeglądania z prostym i łatwym sterowaniem. Część gnome.\n\n- Guayadeque — W pełni funkcjonalny odtwarzacz multimedialny, który może z łatwością zarządzać dużymi kolekcjami i korzysta z frameworka multimedialnego GStreamer (nie jest już obsługiwany od września 2023 r.).\n\n- Lollypop — Odtwarzacz muzyczny GNOME.\n\n- Melody — Odtwarzacz muzyczny do słuchania lokalnych plików muzycznych, radia internetowego i płyt audio CD.\n\n- Nulloy — Odtwarzacz muzyki z paskiem postępu kształtu fali.\n\n- Pantheon Music — Prosty, szybki i dobrze wyglądający odtwarzacz muzyki. Oficjalny odtwarzacz muzyki podstawowej.\n\n- Parlatype — Minimalny odtwarzacz audio do ręcznej transkrypcji mowy dla środowiska GNOME. Odtwarza źródła audio w celu ich transkrypcji w ulubionej aplikacji tekstowej.\n\n- Pragha — Lekki dwupanelowy menedżer muzyki GTK napisany w języku C.\n\n- Quod Libet — Odtwarzacz audio napisany przy użyciu GTK, Pythona i GStreamera z obsługą wyrażeń regularnych w listach odtwarzania.\n\n- Rhythmbox — Klon GTK programu iTunes, używany domyślnie w środowisku GNOME.\n\n- Sayonara — Mały, przejrzysty i szybki odtwarzacz audio dla Linuksa napisany w C++, wykorzystuje framework Qt.\n\n- Strawberry — Fork Clementine skierowany do entuzjastów audio i kolekcjonerów muzyki. Wykorzystuje Qt6.\n\n- Tauon Music Box — Nowoczesny, wygodny i usprawniony odtwarzacz muzyczny do odtwarzania kolekcji muzyki.\n\n- Amarok — Dojrzały odtwarzacz oparty na Qt, znany z mnogości funkcji.\n\n- Aqualung — Zaawansowany odtwarzacz muzyczny, który odtwarza płyty audio CD, strumienie radia internetowego i podcasty, a także pliki dźwiękowe w prawie każdym formacie audio i ma funkcję wstawiania bez przerw między sąsiednimi utworami.\n\n- Audacious — Winamp klon jak Beep i stare wersje XMMS.\n\n- DeaDBeeF — Lekki i szybki odtwarzacz muzyczny z wieloma funkcjami, bez zależności od GNOME lub KDE, obsługuje tylko konsolę, a także GUI GTK, zawiera wiele wtyczek i ma edytor metadanych.\n\n- Deepin Music — Niesamowity odtwarzacz muzyki z genialnym i dopracowanym interfejsem użytkownika opartym na Deepin-UI.\n\n- Drumstick MIDI File Player — Odtwarzacz plików MIDI oparty na Drumstick.\n\n- Elisa — Prosty odtwarzacz muzyki stworzony przez społeczność KDE, którego celem jest zapewnienie użytkownikom przyjemnych wrażeń.\n\n- fooyin — Konfigurowalny odtwarzacz muzyki oparty na Qt.\n\n- gmusicbrowser — Szafa grająca typu open-source dla dużych kolekcji plików MP3/OGG/FLAC.\n\n- Goggles Music Manager — Menedżer kolekcji muzycznej i odtwarzacz, który automatycznie kategoryzuje muzykę, obsługuje odtwarzanie bez przerw, oferuje łatwą edycję tagów i obsługę radia internetowe. Wykorzystuje Fox toolkit.\n\n- JuK — JuK to aplikacja typu jukebox, obsługująca kolekcje plików audio w formatach MP3, Ogg Vorbis i FLAC.\n\n- LXMusic — Minimalistyczny odtwarzacz muzyki oparty na xmms2.\n\n- museeks — Minimalistyczny i łatwy w użyciu odtwarzacz muzyki. Oparty na platformie Electron.\n\n- Musique — Kolejny odtwarzacz muzyczny, tylko lepszy.\n\n- Qmmp — Odtwarzacz multimedialny oparty na Qt z interfejsem użytkownika podobnym do Winampa lub XMMS.\n\n- Soundux — Soundboard z prostym interfejsem użytkownika.\n\n- Vvave — Malutki odtwarzacz muzyczny Qt do przechowywania ulubionych utworów pod ręką.\n\n"
    },
    {
      "title": "Odtwarzacze radia internetowego",
      "level": 3,
      "content": "- GNOME Radio — Łatwe wyszukiwanie programów radiowych na żywo na podstawie lokalizacji geograficznej nadawców radiowych w Internecie.\n\n- Goodvibes — Lekki odtwarzacz radia internetowego.\n\n- Radiotray-NG — Aplet systray odtwarzacza radia internetowego.\n\n- Shortwave — Aplikacja GTK 3 do wyszukiwania i słuchania internetowych stacji radiowych.\n\n- Tuner — Minimalistyczny odtwarzacz stacji radiowych.\n\n"
    },
    {
      "title": "Klienty do streamingu muzyki",
      "level": 3,
      "content": "- AudioTube — Aplikacja kliencka YouTube Music na telefony i komputery stacjonarne. Część kde-multimedia.\n\n- Cider — Klient Apple Music o otwartym kodzie źródłowym i zorientowany na społeczność dla systemów Windows, Linux, macOS i innych. Oparty na platformie Electron.\n\n- Google Play Music Desktop Player — Piękny, wieloplatformowy odtwarzacz dla Muzyki Google Play. Oparty na platformie Electron.\n\n- Headset — Aplikacja na komputery stacjonarne, która zmienia YouTube w światowej klasy usługę strumieniowego przesyłania muzyki. Oparta na platformie Electron.\n\n- ncspot — Wieloplatformowy klient Spotify dla ncurses napisany w Rust, inspirowany ncmpc i podobnymi.\n\n- Nuclear — Nowoczesny odtwarzacz muzyczny skupiający się na streamingu z darmowych źródeł. Oparty na platformie Electron.\n\n- pianobar — Oparta na konsoli nakładka na internetowe radio Pandora.\n\n- Pithos — Pulpitowy klient Python/GTK Pandora Radio.\n\n- Spotify — Własna usługa strumieniowania muzyki. Obsługuje lokalne odtwarzanie i strumieniowanie z ogromnej biblioteki Spotify (wymaga bezpłatnego konta).\n\n- spotify-qt — Lekki klient Spotify wykorzystujący Qt.\n\n- spotify-tui — Spotify dla terminala napisany w Rust.\n\n- YouTube Music — Oparty na Electronie wrapper wokół YouTube Music z wbudowanymi dodatkami.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Beets — Organizator biblioteki muzycznej, tagger i wiele więcej.\n\n- Demlo — Partiowy tagger muzyki, koder, renamer i wiele więcej.\n\n- id3 — Narzędzie wiersza poleceń do edycji tagów ID3 1.x i 2.x.\n\n- id3v2 — Edytor wiersza poleceń dla tagów id3v2.\n\n- MP3Info — Przeglądarka informacji technicznych MP3 i edytor znaczników ID3 1.x.\n\n- MP3Unicode — Narzędzie wiersza poleceń do konwersji znaczników ID3 w plikach mp3 pomiędzy różnymi kodowaniami.\n\n- Taffy — Prosty edytor tagów z wiersza poleceń dla wielu formatów audio.\n\n- Tagutil — Narzędzie CLI do edycji tagów plików muzycznych. Jego celem jest zapewnienie zarówno łatwego do skryptowania interfejsu, jak i łatwości użytkowania interaktywnie.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Audio Tag Tool — Narzędzie do edycji znaczników w plikach MP3 i Ogg Vorbis.\n\n- Coquillo — Edytor metadanych dla różnych formatów audio.\n\n- EasyTag — Narzędzie do przeglądania, edycji i zapisu tagów ID3 plików muzycznych, obsługuje wiele formatów audio.\n\n- Ex Falso — Wieloplatformowy, darmowy i otwarty edytor znaczników audio i organizator bibliotek. Działa z exfalso.\n\n- GabTag — Narzędzie do tagowania audio napisane w GTK.\n\n- Kid3 — Edytor znaczników plików MP3, Ogg/Vorbis, FLAC, MPC, MP4/AAC, MP2, Speex, TrueAudio, WavPack, WMA, WAV i AIFF.\n\n- MP3Info GUI — Przeglądarka informacji technicznych MP3 i edytor tagów ID3 1.x. Interfejs graficzny można uruchomić za pomocą polecenia gmp3info.\n\n- NickvisionTagger — Edytor tagów plików muzycznych GTK. Może wczytywać tagi z bazy danych MusicBrainz. Działa z plikami mp3, ogg, flac, wma i wav. Konwertuje nazwy plików na tagi i tagi na nazwy plików.\n\n- Picard — Wieloplatformowy edytor tagów audio napisany w Pythonie (oficjalny tagger MusicBrainz).\n\n- NTag — Graficzny edytor tagów skoncentrowany na codziennych zastosowaniach.\n\n- Puddletag — Zamiennik słynnego programu MP3tag dla systemu Windows.\n\n- Tag Editor — Edytor tagów z graficznym interfejsem użytkownika Qt i interfejsem wiersza poleceń obsługujący MP4/M4A/AAC (iTunes), ID3v1/ID3v2, Vorbis, Opus, FLAC i Matroska.\n\n- Thunar Media Tags Plugin — Dodaje specjalne funkcje dla plików multimedialnych do menedżera plików Thunar, w tym możliwość edycji tagów.\n\n"
    },
    {
      "title": "Odtwarzacze tekstów",
      "level": 4,
      "content": "- Floodlight Presenter — Program do prezentacji i wyświetlania tekstów piosenek i multimediów dla kościołów.\n\n- Give Me Lyrics — Wyświetlanie tekstu odtwarzanego utworu z dowolnej aplikacji.\n\n- OSD Lyrics — Program Lyric jest kompatybilny z różnymi odtwarzaczami multimedialnymi.\n\n"
    },
    {
      "title": "Programy do pobierania tekstów",
      "level": 4,
      "content": "- clyrics — Rozszerzalny fetcher tekstów, z obsługą demonów cmus i mocp.\n\n- glyrc — Wyszukiwarka metadanych związanych z muzyką z wiersza poleceń, w tym obsługa pobierania tekstów piosenek.\n\n"
    },
    {
      "title": "Edytory tekstów piosenek",
      "level": 4,
      "content": "- Karaoke Lyrics Editor — Edytor tekstów i eksporter CD+G/video dla Karaoke.\n\n- LyricsX — Edytor tekstów.\n\n"
    },
    {
      "title": "Konwertery audio",
      "level": 3,
      "content": "- Ecasound — Narzędzia wiersza poleceń przeznaczone do wielościeżkowego przetwarzania dźwięku. Może być używany do prostych zadań, takich jak odtwarzanie dźwięku, nagrywanie i konwersja formatów, a także do wielościeżkowego przetwarzania efektów, miksowania, nagrywania i recyklingu sygnału.\n\n- FFaudioConverter — Wsadowy konwerter audio i procesor efektów. Może konwertować pliki lub całe foldery zawierające pliki muzyczne i wideo do innych formatów audio za pomocą FFmpeg.\n\n- Flacon — Wyodrębnia poszczególne ścieżki z jednego dużego pliku audio zawierającego cały album muzyczny i zapisuje je jako osobne pliki audio.\n\n- fre:ac — Konwerter audio i ripper CD z obsługą różnych popularnych formatów i koderów.\n\n- Gnac — Konwerter audio dla środowiska GNOME.\n\n- SoundConverter — Graficzna aplikacja do konwersji plików audio do różnych formatów.\n\n- soundKonverter — Oparty na Qt interfejs GUI do różnych konwerterów audio.\n\n- SoX — Narzędzie wiersza poleceń, które może konwertować różne formaty komputerowych plików audio do innych formatów.\n\n"
    },
    {
      "title": "Edytory audio",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of digital audio editors.\n\n- Audacity — Program umożliwiający manipulowanie cyfrowymi kształtami fali audio.\n\n- GNOME Sound Recorder — Zapewnia prosty sposób nagrywania i odtwarzania dźwięku. Część gnome-extra.\n\n- Gnome Wave Cleaner — Cyfrowy edytor audio do odszumiania, usuwania szumów i wzmacniania plików audio.\n\n- KRecorder — Konwergentna aplikacja do nagrywania dźwięku dla Plasmy. Część kde-utilities.\n\n- Kwave — Edytor dźwięku dla KDE. Część kde-multimedia.\n\n- mhWaveEdit — Graficzny program do edycji, odtwarzania i nagrywania plików dźwiękowych.\n\n- Mp3splt — Narzędzie do dzielenia plików mp3, ogg vorbis i natywnych plików FLAC, wybierając pozycję początkową i końcową, bez dekodowania.\n\n- ocenaudio — Zastrzeżony, wieloplatformowy, łatwy w użyciu, szybki i funkcjonalny edytor audio.\n\n- Play it Slowly — Odtwarzanie plików audio z inną prędkością lub w innej wysokości.\n\n- Polyphone — Edytor fontów dźwiękowych do tworzenia i edycji instrumentów muzycznych opartych na samplach w formacie sf2.\n\n- Snd — Zaawansowany edytor dźwięku wzorowany luźno na Emacsie.\n\n- Swami — Edytor SoundFont\n\n- Sweep — Edytor audio i narzędzie do odtwarzania na żywo.\n\n- WaveSurfer — Narzędzie do wizualizacji i manipulacji dźwiękiem. Typowe zastosowania to analiza mowy/dźwięku i adnotacja/transkrypcja dźwięku.\n\n"
    },
    {
      "title": "Cyfrowe stacje robocze audio",
      "level": 3,
      "content": "See also Professional audio.\n\n- Ardour — Wielokanałowy rejestrator z twardym dyskiem i cyfrowa stacja robocza audio.\n\n- Bitwig Studio — Profesjonalna cyfrowa stacja robocza audio.\n\n- Frinika — Cyfrowa stacja robocza audio z sekwencerem, syntezatorami, efektami w czasie rzeczywistym i nagrywaniem dźwięku.\n\n- LMMS — Cyfrowa stacja robocza audio, która umożliwia tworzenie muzyki za pomocą komputera.\n\n- MusE — Sekwencer MIDI/Audio (cyfrowa stacja robocza audio) z możliwością nagrywania i edycji, ma być kompletnym wielościeżkowym wirtualnym studiem dla systemu Linux.\n\n- Non — Modułowa cyfrowa stacja robocza audio składająca się z czterech głównych części: Timeline, Sequencer, Mixer i Session Manager.\n\n- Qtractor — Oparta na Qt aplikacja do nagrywania na twardym dysku i cyfrowej stacji roboczej audio, której celem jest dostarczenie oprogramowania do cyfrowej stacji roboczej audio wystarczająco prostego dla przeciętnego użytkownika domowego, a jednocześnie wystarczająco wydajnego dla użytkownika profesjonalnego.\n\n- REAPER — Opatentowana cyfrowa stacja robocza audio, oferująca pełny zestaw narzędzi do wielościeżkowego nagrywania audio i MIDI, edycji, przetwarzania, miksowania i masteringu.\n\n- Rosegarden — Cyfrowa stacja robocza audio opracowana przy użyciu ALSA i Qt, która działa jako sekwencer audio i MIDI, zapis nutowy oraz narzędzie do komponowania i edycji muzyki.\n\n- Tracktion Waveform — Autorska cyfrowa stacja robocza audio, zaprojektowana specjalnie z myślą o potrzebach współczesnych producentów muzycznych.\n\n- Zrythm — Wysoce zautomatyzowana i intuicyjna cyfrowa stacja robocza audio.\n\n"
    },
    {
      "title": "Analizatory audio",
      "level": 3,
      "content": "- audioprism — Narzędzie spektrogramu dla wejścia PulseAudio i plików WAV.\n\n- BRP-PACU — Dwukanałowe narzędzie do analizy akustycznej oparte na FFT, pomagające inżynierom analizować profesjonalne systemy dźwiękowe na żywo przy użyciu funkcji transferu.\n\n- Baudline — Własny analizator czasowo-częstotliwościowy i spektrogramowy\n\n- FMIT — Graficzne narzędzie do strojenia instrumentów muzycznych, z historią błędów i głośności oraz zaawansowanymi funkcjami.\n\n- Friture — Analizator dźwięku w czasie rzeczywistym.\n\n- Mousai — Prosta aplikacja do identyfikacji utworów za pomocą API audd.io.\n\n- rtspeccy — Analizator widma audio w czasie rzeczywistym.\n\n- SongRec — Nieoficjalny klient Shazam do rozpoznawania dźwięku z dowolnego pliku audio lub z mikrofonu, napisany w Rust.\n\n- Sonic Visualiser — Przeglądanie, analizowanie i dodawanie adnotacji do zawartości muzycznych plików audio.\n\n- Spek — Ogołocony interfejs dla wyjścia PNG spektogramu ffmpeg, pomaga analizować pliki audio, pokazując ich spektrogram.\n\n"
    },
    {
      "title": "Edytory nutowe",
      "level": 3,
      "content": "Zobacz także LilyPond#Front-ends oraz Wikipedia:Comparison of scorewriters.\n\n- Canorus — Edytor nutowy. Obsługuje nieograniczoną liczbę i długość pięciolinii, polifonię, odtwarzanie nut MIDI, oznaczenia akordów, teksty, filtry importu/eksportu do formatów takich jak MIDI, MusicXML, ABC Music, MusiXTeX i LilyPond.\n\n- Impro-Visor — Program do notacji muzycznej zaprojektowany, aby pomóc muzykom jazzowym komponować i słyszeć solówki podobne do tych, które mogą być improwizowane.\n\n- LilyPond — Program do grawerowania muzyki, poświęcony produkcji najwyższej jakości nut.\n\n- MuseScore — Tworzenie, odtwarzanie i drukowanie nut.\n\n- TuxGuitar — Wielościeżkowy edytor i odtwarzacz tabulatur gitarowych.\n\n"
    },
    {
      "title": "Środowiska syntezy audio",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of audio synthesis environments.\n\n- Blue — Środowisko do komponowania muzyki dla Csound, napisane w Javie.\n\n- Cabbage — Framework do tworzenia oprogramowania audio przy użyciu prostych znaczników tekstowych i języka syntezy dźwięku Csound.\n\n- Cardinal — Wtyczka wirtualnego syntezatora modularnego oparta na VCV Rack, zawiera wiele zwirtualizowanych modułów Eurorack.\n\n- ChucK — Silnie synchronizowany, współbieżny i działający w locie język programowania muzyki.\n\n- Csound — System przetwarzania dźwięku i muzyki.\n\n- CsoundQt — Frontend dla Csound z edytorem podświetlania z autouzupełnianiem, interaktywnymi widżetami i zintegrowaną pomocą.\n\n- FoxDot — Kodowanie na żywo z Pythonem i SuperColliderem.\n\n- Pure Data — Środowisko muzyczne i multimedialne działające w czasie rzeczywistym.\n\n- Sonic Pi — Oparte na kodzie narzędzie do tworzenia i odtwarzania muzyki.\n\n- SuperCollider — Platforma do syntezy dźwięku i kompozycji algorytmicznej, używana przez muzyków, artystów i badaczy pracujących z dźwiękiem.\n\n- VCV Rack — Wirtualny Eurorack DAW. Użyj systemu wtyczek, aby dodać więcej Eurorack emulowanych modułów.\n\n"
    },
    {
      "title": "Generatory dźwięku",
      "level": 3,
      "content": "Ta sekcja zawiera automaty perkusyjne, samplery programowe i syntezatory programowe.\n\n- ADLMIDI — Syntezator OPL3/OPN2 wykorzystujący ADLMIDI.\n\n- ADLplug — Syntezator FM Yamaha OPL3 dla ADLMIDI.\n\n- Agordejo — Menedżer sesji muzycznych i produkcji audio oparty na NSM.\n\n- ams — Alsa Modular Synth. Syntezator modularny czasu rzeczywistego i procesor efektów.\n\n- amsynth — Analog Modelling SYNTHesizer. Łatwy w użyciu syntezator programowy o klasycznej topologii syntezatora subtraktywnego.\n\n- DIN — Syntezator dźwięku i instrument muzyczny.\n\n- Drumlabooh — Automat perkusyjny LV2/VSTi z obsługą zestawów Hydrogen, SFZ, Drumlabooh.\n\n- Drumstick — Zestaw narzędzi MIDI: siatka perkusyjna, odtwarzacz MIDI, wirtualne pianino.\n\n- Element — Modułowy host wtyczek audio LV2/VST3.\n\n- FluidSynth — Syntezator programowy czasu rzeczywistego oparty na specyfikacji SoundFont 2.\n\n- Geonkick — Syntezator, który może syntetyzować elementy perkusji. Najbardziej podstawowe przykłady to: kicki, snare'y, hit-haty, shakery, clap'y.\n\n- Gigedit — Graficzny edytor instrumentów wirtualnych opartych na samplach, bazujący na formacie plików GigaStudio/Gigasampler.\n\n- GrandOrgue — Aplikacja do odtwarzania próbek wirtualnych organów piszczałkowych obsługująca format plików zgodny z HW1.\n\n- GSequencer — Zapewnia różne narzędzia do odtwarzania, tworzenia, edycji i miksowania własnej muzyki. Zawiera sekwencer krokowy, rolkę pianina, automatyzację i edytor kształtu fali.\n\n- Helm — Syntezator programowy do tworzenia muzyki elektronicznej na komputerze.\n\n- Hydrogen — Zaawansowany automat perkusyjny do tworzenia sekwencji perkusyjnych.\n\n- JSampler — GUI napisane w Javie dla samplera audio LinuxSampler.\n\n- OPNplug — Syntezator FM Yamaha OPN2 dla OPNMIDI.\n\n- Patroneo — Łatwy w użyciu sekwencer midi oparty na wzorach.\n\n- PySynth — Zestaw prostych syntezatorów muzycznych i skryptów pomocniczych napisanych w Pythonie 3.\n\n- QMidiArp — Zaawansowany arpeggiator MIDI, programowalny sekwencer krokowy i LFO.\n\n- QmidiCtl — Aplikacja zdalnego kontrolera MIDI, która wysyła dane MIDI przez sieć, wykorzystując UDP/IP multicast.\n\n- QmidiNet — Aplikacja bramy sieciowej MIDI, która wysyła i odbiera dane MIDI przez sieć, wykorzystując UDP/IP multicast.\n\n- QMidiRoute — Router i procesor MIDI dla ALSA.\n\n- Qsampler — GUI Qt dla samplera audio LinuxSampler.\n\n- Qsynth — GUI Qt dla Fluidsynth.\n\n- Qwertone — Prosty syntezator muzyczny (jak zabawkowe pianino), ale oparty na zwykłej klawiaturze qwerty do wprowadzania danych.\n\n- QXGEdit — GUI Qt do edycji plików MIDI System Exclusive dla urządzeń XG (np. Yamaha DB50XG).\n\n- setBfree — Organy z kołem tonowym DSP.\n\n- SpectMorph — Analizowanie próbek instrumentów muzycznych i łączenie ich (morfing).\n\n- Surge XT — Wieloplatformowy, hybrydowy syntezator subtraktywny. Instaluje samodzielną aplikację (surge-xt-standalone), wtyczki (surge-xt-clap, surge-xt-vst3) i wspólne pliki (surge-xt-common).\n\n- TiMidity++ — Syntezator programowy, który może odtwarzać pliki MIDI, konwertując je na dane fali PCM.\n\n- Vee One Suite — Oldschoolowe instrumenty programowe: synthv1, polifoniczny syntezator subtraktywny; samplv1, polifoniczny syntezator samplujący; drumkv1, kolejny sampler zestawu perkusyjnego; padthv1, polifoniczny syntezator addytywny.\n\n- VMPK — Wirtualna klawiatura fortepianowa MIDI. Generator i odbiornik zdarzeń MIDI. Może używać midi SoundFonts do samodzielnego generowania dźwięku lub może być używany do sterowania syntezatorem MIDI.\n\n- Yoshimi — Syntezator programowy, rozwidlenie ZynAddSubFX.\n\n- ZynAddSubFX — W pełni funkcjonalny syntezator programowy zdolny do tworzenia niezliczonej liczby instrumentów, od niektórych powszechnie słyszanych z drogiego sprzętu po ciekawe dźwięki, które można zwiększyć do niesamowitego wszechświata dźwięków.\n\n"
    },
    {
      "title": "Trackery muzyczne",
      "level": 3,
      "content": "- Buzztrax — Studio muzyczne do komponowania utworów przy użyciu wyłącznie komputera z kartą dźwiękową.\n\n- FamiStudio — Bardzo prosty edytor muzyczny dla Nintendo Entertainment System lub Famicom.\n\n- FastTracker II — Klon trackera o tej samej nazwie, przy użyciu SDL2 i języka C.\n\n- Furnace — Tracker chiptune kompatybilny z modułami DefleMask. Emuluje różne układy dźwiękowe.\n\n- klystrack — Tracker do tworzenia chiptunów w stylu C64/NES/Amiga na nowoczesnej platformie.\n\n- MilkyTracker — Aplikacja muzyczna do tworzenia plików modułów .MOD i .XM.\n\n- OpenMPT — Oprogramowanie Tracker do tworzenia i odtwarzania świetnej muzyki na komputerze.\n\n- ProTracker 2 — Klon oryginalnego trackera z amigi. Napisany przy użyciu SDL2 w C.\n\n- Radium — Edytor muzyczny z nowym typem interfejsu.\n\n- Schism Tracker — Twórz wysokiej jakości muzykę bez specjalistycznego, drogiego sprzętu i z unikalnym \"czuciem palców\", które trudno jest częściowo odtworzyć.\n\n- SunVox — Mały, szybki i potężny syntezator modularny z sekwencerem opartym na wzorach (tracker).\n\n"
    },
    {
      "title": "DJ",
      "level": 3,
      "content": "- Giada — Minimalistyczne, hardcorowe narzędzie audio dla DJ-ów, wykonawców na żywo i muzyków elektronicznych.\n\n- IDJC — Potężny, ale łatwy w użyciu klient źródłowy dla osób zainteresowanych strumieniowaniem audycji radiowych na żywo przez Internet przy użyciu serwerów Shoutcast lub Icecast.\n\n- Linux Show Player — Wydajne i bogate w funkcje oprogramowanie do układania list utworów. Zaprojektowane z myślą o sztukach teatralnych i występach muzycznych na żywo.\n\n- Luppp — Narzędzie do tworzenia muzyki, przeznaczone do użytku na żywo. Skupia się ono na przetwarzaniu w czasie rzeczywistym oraz szybkim i intuicyjnym przepływie pracy.\n\n- Mixxx — Integruje narzędzia potrzebne DJ-om do wykonywania kreatywnych miksów na żywo z cyfrowymi plikami muzycznymi.\n\n- Seq24 — Minimalny sekwencer MIDI oparty na pętlach do występów na żywo z bardzo prostym interfejsem do edycji i odtwarzania \"pętli\" MIDI.\n\n- xwax — Digital Vinyl System (DVS) dla systemu Linux. Umożliwia on DJ-om i turntablistom odtwarzanie cyfrowych plików audio (MP3, Ogg Vorbis, FLAC, AAC i innych), sterowanych za pomocą zwykłej pary gramofonów poprzez kodowane czasowo płyty winylowe.\n\n"
    },
    {
      "title": "Efekty audio",
      "level": 3,
      "content": "- Calf Plugin Pack for JACK — Przetwarzanie i tworzenie dźwięków za pomocą zestawu wtyczek z interfejsem JACK. (calfjackhost)\n\n- Carla — Host wtyczek audio z obsługą wielu sterowników audio i formatów wtyczek.\n\n- guitarix — Wirtualny wzmacniacz gitarowy dla JACK.\n\n- EasyEffects — Zastosuj efekty do aplikacji audio i źródeł wejściowych przez PipeWire (lub PulseAudio ze starszym pakietem).\n\n- Rakarrack — Bogato wyposażony procesor multi-efektów emulujący pedał efektów gitarowych.\n\n"
    },
    {
      "title": "Wizualizatory audio",
      "level": 3,
      "content": "- Barva — Wizualizator dla PulseAudio, który pulsuje tło terminala.\n\n- C.A.V.A. — Oparty na konsoli wizualizator audio dla ALSA, MPD i PulseAudio.\n\n- Cavalcade — GTK GUI dla C.A.V.A.\n\n- cli-visualizer — Wysoce konfigurowalny wizualizator audio oparty na CLI.\n\n- GLava — Wizualizator widma audio OpenGL. Jego głównym zastosowaniem są okna pulpitu lub tła.\n\n- GLMViz — W pełni konfigurowalny wizualizator muzyki OpenGL.\n\n- Le Biniou — Przyjazne dla użytkownika, potężne narzędzie do wizualizacji muzyki / VJingu.\n\n- projectM — Wizualizer muzyczny wykorzystujący akcelerowane 3D iteracyjne renderowanie oparte na obrazie.\n\n- VSXu — Oparte na OpenGL (akcelerowane sprzętowo), modułowe środowisko programistyczne, którego głównym celem jest wizualizacja muzyki i tworzenie efektów graficznych w czasie rzeczywistym.\n\n"
    },
    {
      "title": "Zdalne audio",
      "level": 3,
      "content": "- jammr — Graj w jam sessions z muzykami z całego świata przez Internet.\n\n- Jamulus — Umożliwia muzykom wykonywanie jam sessions w czasie rzeczywistym przez Internet.\n\n- netaudio — Lista, konfiguracja i kontrola sieciowych urządzeń audio Audinate Dante.\n\n- Noson — Szybki i inteligentny kontroler dla urządzeń SONOS.\n\n- SonoBus — Aplikacja do strumieniowego przesyłania wysokiej jakości dźwięku peer-to-peer o niskich opóźnieniach między urządzeniami przez Internet lub sieć lokalną.\n\n- Upplay — Oparty na Qt punkt kontroli dźwięku UPnP.\n\n"
    },
    {
      "title": "Regulacja głośności",
      "level": 3,
      "content": "Zobacz także PulseAudio#Front-ends i JACK Audio Connection Kit#Comparison of JACK control GUIs.\n\n- alsamixer — Mikser karty dźwiękowej dla sterownika karty dźwiękowej ALSA, z interfejsem ncurses.\n\n- AlsaVolume — Zmieniacz głośności Tray ALSA napisany przy użyciu gtkmm.\n\n- Emixer — Narzędzie do kontrolowania poziomów głośności. Część Enlightenment.\n\n- GNOME ALSA Mixer — Mikser ALSA dla środowiska GNOME.\n\n- GVolWheel — Mikser audio, który pozwala kontrolować głośność za pomocą ikony w zasobniku.\n\n- KMix — Program do regulacji głośności KDE. Część kde-multimedia.\n\n- MATE Volume Control — Aplikacja miksera audio i aplet zasobnika systemowego dla MATE do miksowania dźwięku i dostosowywania poziomów głośności różnych urządzeń miksera audio.\n\n- PNMixer — Rozwinięcie Obmixera. Ma wiele nowych funkcji, takich jak wybór kanału ALSA, wykrywanie połączenia / rozłączenia, skróty itp.\n\n- QasTools — Kolekcja aplikacji desktopowych dla linuksowego systemu dźwiękowego ALSA. Zawiera QasMixer (mikser), QasHctl (mikser HCTL) i QasConfig (przeglądarka konfiguracji).\n\n- Retrovol — Aplet zasobnika ustawień głośności w stylu retro.\n\n- Volctl — Kontrola głośności apletu zasobnika systemowego i menu ekranowego dla PulseAudio.\n\n- Volnoti — Lekki demon powiadamiania o woluminach dla GNU/Linux i innych systemów operacyjnych POSIX.\n\n- Volume Icon — Kolejna regulacja głośności w zasobniku systemowym z wyborem kanałów, motywami i zewnętrznym mikserem.\n\n- Xfce ALSA Panel Plugin — Prosta wtyczka kontroli głośności ALSA dla panelu Xfce4.\n\n"
    },
    {
      "title": "CD ripping",
      "level": 3,
      "content": "See Optical disc drive#Audio CD.\n\n"
    },
    {
      "title": "Odtwarzacze wideo",
      "level": 3,
      "content": "See also Wikipedia:Comparison of video player software.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- FFplay — Bardzo prosty i przenośny odtwarzacz multimedialny wykorzystujący biblioteki FFmpeg i SDL. Używany jest głównie jako tester dla różnych API FFmpeg.\n\n- gst-play-1.0 — Proste narzędzie do testowania odtwarzania z wiersza poleceń dla GStreamer.\n\n- MPlayer — Odtwarzacz wideo obsługujący pełną i wszechstronną gamę formatów wideo i audio.\n\n- mpv — Odtwarzacz filmów oparty na MPlayer i mplayer2.\n\n- VLC media player — Wersja wiersza poleceń słynnego odtwarzacza wideo, który może płynnie odtwarzać filmy w wysokiej rozdzielczości na TTY. Interfejs rc można uruchomić za pomocą vlc -I rc, a interfejs ncurses za pomocą vlc -I ncurses.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Cinema — Odtwarzacz wideo i menedżer do oglądania lokalnych plików wideo.\n\n- Clapper — Odtwarzacz multimedialny GNOME zbudowany przy użyciu GJS z zestawem narzędzi GTK4 i obsługiwany przez GStreamer z renderowaniem OpenGL.\n\n- Glide — Prosty i minimalistyczny odtwarzacz multimedialny oparty na GStreamer do obsługi multimediów i GTK do interfejsu użytkownika.\n\n- GNOME Videos — Odtwarzacz multimediów (audio i wideo) dla środowiska GNOME, korzystający z GStreamer. Część gnome.\n\n- Identity — Program do porównywania wielu wersji obrazu lub wideo.\n\n- Movie Monad — Darmowy i prosty w użyciu odtwarzacz wideo stworzony w Haskellu przy użyciu GStreamer i GTK. Prekompilowany i bez zależności od Haskella w czasie wykonywania.\n\n- Pantheon Videos — Odtwarzacz wideo i biblioteka zaprojektowana dla podstawowego systemu operacyjnego przy użyciu GStreamer.\n\n- Parole — Nowoczesny odtwarzacz multimedialny oparty na frameworku GStreamer.\n\n- Rage — Odtwarzacz wideo i audio napisany przy użyciu bibliotek Enlightenment Foundation z kilkoma dodatkowymi bajerami. Używa GStreamer\n\n- Snappy — Potężny odtwarzacz multimedialny z minimalistycznym interfejsem, który wykorzystuje GStreamer.\n\n- Spivak — Odtwarzacz karaoke oparty na GStreamer i Qt5.\n\n- Baka MPlayer — Darmowy i otwarty, wieloplatformowy odtwarzacz multimedialny oparty na mpv (Qt 5).\n\n- Bomi — bomi to odtwarzacz z graficznym interfejsem użytkownika (GUI) oparty na mpv dla systemu Linux.\n\n- Celluloid — Prosta nakładka GTK dla mpv, dawniej GNOME MPV.\n\n- Deepin Movie — Odtwarzacz filmów dla Deepin desktop oparty na mpv.\n\n- Haruna Video Player — Odtwarzacz wideo Qt/QML zbudowany na bazie mpv.\n\n- Kawaii-Player — Menedżer audio/wideo i odtwarzacz multimedialny (oparty na mpv) z funkcją przesyłania z komputera na komputer, wraz z funkcjami przenośnego serwera multimediów i serwera strumieniowego przesyłania torrentów.\n\n- Media Player Classic Qute Theater — Klon Media Player Classic ponownie zaimplementowany w Qt i oparty na mpv.\n\n- Minitube — Aplikacja desktopowa YouTube napisana w C++ przy użyciu mpv i Qt.\n\n- MoonPlayer — Odtwarzacz wideo do odtwarzania i pobierania filmów online z serwisów YouTube, Youku itp.\n\n- mpv — Odtwarzacz filmów oparty na MPlayer i mplayer2.\n\n- mpvz — Graficzny interfejs użytkownika oparty na Qt5/QML dla libmpv. Oparty na motywie Tethys dla Bomi.\n\n- ImPlay — Wieloplatformowy odtwarzacz multimedialny dla komputerów stacjonarnych, zbudowany na bazie mpv i ImGui.\n\n- PlasmaTube — Odtwarzacz wideo YouTube dla KDE oparty na mpv i yt-dlp. Część kde-multimedia.\n\n- SMPlayer — Odtwarzacz multimedialny Qt z dodatkowymi funkcjami (motywy CSS, integracja z YouTube itp.) oparty na mpv. Może używać MPlayer jako alternatywnego backendu.\n\n- xt7-player-mpv — Qt/Gambas GUI do mpv z bogatym zestawem konfigurowalnych opcji, w tym filtrów i sterowników, obsługą wtyczek ladspa, a także zarządzaniem bibliotekami/listami odtwarzania, YouTube, radiami online, podcastami, DVB-T i nie tylko.\n\n- Clip — Odtwarzacz wideo i menedżer kolekcji wykorzystujący FFmpeg jako backend. Część maui.\n\n- Dragon Player — Prosty odtwarzacz wideo dla KDE oparty na Phonon. Część grupy kde-multimedia.\n\n- Electronplayer — Aplikacja korzystająca z frameworka Electron. Służy do oglądania Netflix, YouTube, Twitch, Floatplane, Hulu, Amazon Prime Video i innych. Przede wszystkim izoluje pliki cookie z tych witryn od głównej przeglądarki internetowej.\n\n- FreeTube — Desktopowy odtwarzacz YouTube stworzony z myślą o prywatności. Korzystaj z YouTube bez reklam i uniemożliw Google śledzenie Cię za pomocą plików cookie i JavaScript. Oparty na platformie Electron.\n\n- GNOME MPlayer — Proste GUI oparte na GTK dla MPlayer.\n\n- Kaffeine — Bardzo wszechstronny odtwarzacz multimedialny KDE, który domyślnie wykorzystuje VLC jako backend i ma doskonałą obsługę telewizji cyfrowej (DVB-T, DVB-C, DVB-S).\n\n- KMPlayer — Prosty odtwarzacz wideo oparty na Phononie dla KDE i wtyczka odtwarzacza wideo dla Konquerora. Może używać MPlayer jako alternatywnego backendu.\n\n- Kodi — Odtwarzacz multimedialny i centrum rozrywki dla mediów cyfrowych.\n\n- QMPlay2 — Odtwarzacz wideo oparty na Qt. Może odtwarzać i przesyłać strumieniowo wszystkie formaty obsługiwane przez FFmpeg i libmodplug. Posiada zintegrowany system modułów, który zawiera przeglądarkę YouTube.\n\n- QtAV Player — Prosty odtwarzacz multimedialny oparty na QtAV i FFmpeg. Uruchamiany z Player lub QMLPlayer.\n\n- Stremio — Rozszerzalne centrum multimedialne.\n\n- tvtime — Wysokiej jakości aplikacja telewizyjna do użytku z kartami przechwytywania wideo.\n\n- VLC media player — Wersja wiersza poleceń słynnego odtwarzacza wideo, który może płynnie odtwarzać filmy w wysokiej rozdzielczości na TTY. Interfejs rc można uruchomić za pomocą vlc -I rc, a interfejs ncurses za pomocą vlc -I ncurses.\n\n- xine — Darmowy odtwarzacz multimedialny.\n\n- Xjadeo — Odtwarzacz wideo wyświetlający klip wideo zsynchronizowany z zewnętrznym źródłem czasu (MTC, LTC, JACK-transport).\n\n- YUView — Oparty na Qt odtwarzacz YUV z zaawansowanym zestawem narzędzi analitycznych.\n\n"
    },
    {
      "title": "Konwertery wideo",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of video converters oraz Codecs and containers#Container format tools.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Avidemux CLI — Darmowy edytor wideo przeznaczony do prostych zadań cięcia, filtrowania i kodowania.\n\n- FFmpeg — Kompletne, wieloplatformowe rozwiązanie do nagrywania, konwertowania i strumieniowania audio i wideo.\n\n- HandBrake CLI — Prosty, ale wydajny transkoder wideo, idealny do wsadowego zgrywania plików mkv/x264.\n\n- MEncoder — Darmowe narzędzie do dekodowania, kodowania i filtrowania wideo z wiersza poleceń.\n\n- Transcode — Narzędzie wiersza poleceń do przetwarzania strumieni wideo.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Ciano — Prosty konwerter plików multimedialnych wykorzystujący FFmpeg i ImageMagick.\n\n- FF Multi Converter — Prosta aplikacja graficzna, która umożliwia konwertowanie plików audio, wideo, obrazów i dokumentów między wszystkimi popularnymi formatami, przy użyciu innych narzędzi wiersza poleceń.\n\n- HandBrake — Prosty, ale wydajny transkoder wideo, idealny do wsadowego zgrywania plików mkv/x264. Wersja GTK.\n\n- QWinFF — GUI Qt5 dla FFmpeg, który może odczytywać pliki audio i wideo w różnych formatach i konwertować je do innych formatów.\n\n- Transmageddon — Prosta aplikacja Python do transkodowania wideo do formatów obsługiwanych przez GStreamer.\n\n- WinFF — Graficzny konwerter wsadowy wideo i audio wykorzystujący FFmpeg.\n\n"
    },
    {
      "title": "Edytory wideo",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of video editing software.\n\n- Avidemux — Darmowy edytor wideo przeznaczony do prostych zadań cięcia, filtrowania i kodowania.\n\n- Blender — W pełni zintegrowany pakiet do tworzenia grafiki 3D z wbudowanym nieliniowym edytorem wideo.\n\n- Cinelerra (Community Version) — Zaawansowane środowisko edycji i kompozycji wideo.\n\n- Cinelerra GG Infinity — Profesjonalne środowisko do montażu i kompozycji wideo.\n\n- DaVinci Resolve — Autorski pakiet oprogramowania do postprodukcji audio-wideo.\n\n- Flowblade — Wielościeżkowy, nieliniowy edytor wideo dla Linuxa, zaprojektowany w celu zapewnienia szybkiej i solidnej edycji.\n\n- Kdenlive — Nieliniowy edytor wideo przeznaczony do podstawowych i półprofesjonalnych zastosowań. Część kde-multimedia.\n\n- Lightworks — Profesjonalny, autorski system do nieliniowej edycji i masteringu cyfrowych materiałów wideo w różnych formatach.\n\n- LiVES — Edytor wideo i platforma VJ (występy na żywo).\n\n- LosslessCut — Narzędzie GUI do bezstratnego przycinania plików wideo/audio. Oparte na platformie Electron.\n\n- Natron — Oprogramowanie open-source do tworzenia kompozycji. Oparte na grafach węzłowych. Funkcjonalnością przypomina Adobe After Effects i Nuke firmy The Foundry.\n\n- Olive — Nieliniowy edytor wideo mający na celu zapewnienie w pełni funkcjonalnej alternatywy dla wysokiej klasy profesjonalnego oprogramowania do edycji wideo\n\n- OpenShot — Nieliniowy edytor wideo oparty na frameworku MLT.\n\n- Pitivi — Edytor wideo zaprojektowany tak, aby był intuicyjny i dobrze integrował się z pulpitem GNOME.\n\n- Shotcut — Shotcut to darmowy, wieloplatformowy edytor wideo o otwartym kodzie źródłowym.\n\n- V2Mixer — darmowy wieloplatformowy edytor filmów, mikser\n\n- VapourSynth Editor — Edytor skryptów VapourSynth.\n\n- VidCutter — Szybki, bezstratny program do cięcia i łączenia multimediów z opcjami SmartCut z dokładnością co do klatki, obsługiwany przez mpv, FFmpeg za pośrednictwem eleganckiego graficznego interfejsu użytkownika Qt5.\n\n- Video Trimmer — Pozwala wyciąć fragment filmu, podając znaczniki czasu rozpoczęcia i zakończenia. Wideo nigdy nie jest ponownie kodowane, więc proces jest bardzo szybki i nie obniża jakości wideo.\n\n"
    },
    {
      "title": "Odtwarzacze napisów",
      "level": 4,
      "content": "- Penguin Subtitle Player — Samodzielny odtwarzacz napisów, który zapewnia półprzezroczyste okno, które zawsze pozostaje na górze, dzięki czemu napisy mogą być wyświetlane na górze wideo bez blokowania czegokolwiek.\n\n- SubtitlesPrinter — Drukowanie napisów nad ekranem X, niezależnie od odtwarzacza wideo.\n\n"
    },
    {
      "title": "Programy do pobierania napisów",
      "level": 4,
      "content": "- QNapi — Klient Qt do pobierania napisów do filmów z serwisów NapiProjekt, OpenSubtitles, Napisy24.\n\n- subdl — Narzędzie wiersza poleceń do pobierania napisów z opensubtitles.org.\n\n"
    },
    {
      "title": "Edytory napisów",
      "level": 4,
      "content": "Zobacz także Wikipedia:Comparison of subtitle editors.\n\n- Aegisub — Edytor napisów.\n\n- Gaupol — W pełni funkcjonalny edytor napisów.\n\n- Gnome Subtitles — Edytor napisów wideo dla środowiska GNOME.\n\n- Jubler — Wieloplatformowy edytor napisów o otwartym kodzie źródłowym napisany w Javie.\n\n- Subtitle Composer — Edytor napisów dla KDE obsługujący różne formaty, posiada różne backendy odtwarzaczy, potrafi wyświetlać formę fali.\n\n- Subtitle Edit — Program do edycji napisów. Napisany w języku C# przy użyciu mono.\n\n- Subtitle Editor — Narzędzie GTK 3 do edycji napisów dla GNU/Linux/*BSD.\n\n"
    },
    {
      "title": "Screencast",
      "level": 3,
      "content": "Zobacz Screen capture#Screencast software.\n\n"
    },
    {
      "title": "Miracast",
      "level": 3,
      "content": "Miracast to standard połączeń bezprzewodowych z urządzeń wysyłających do odbiorników wyświetlających głównie przy użyciu Wi-Fi Direct. Użyj iw dev by sprawdzić wsparcie sprzętowe. Użyj iw reg get, aby upewnić się, że domena regulacyjna nie jest ustawiona na „Global”, ponieważ może to zablokować niektóre funkcje.\n\n- GNOME Network Displays — Aplikacja GTK do przesyłania pulpitu na zdalny ekran. Nie jest specyficzna dla środowiska GNOME, zależy od PipeWire.\n\n- MiracleCast — Narzędzia wiersza poleceń do podłączania zewnętrznych monitorów do systemu za pośrednictwem specyfikacji Wi-Fi Display, znanej również jako Miracast.\n\n"
    },
    {
      "title": "Kamerka internetowa",
      "level": 3,
      "content": "Zobacz także FFmpeg#Recording webcam i Wikipedia:Comparison of webcam software.\n\n- Booth — Konwergentna aplikacja aparatu fotograficznego.\n\n- Cheese — Rób zdjęcia i nagrywaj filmy kamerą internetową z zabawnymi efektami graficznymi. Część gnome-extra.\n\n- Deepin Camera — Narzędzie do wyświetlania obrazu z kamery, robienia zdjęć i nagrywania filmów.\n\n- fswebcam — Małe i proste oprogramowanie do generowania obrazów z kamery internetowej z wiersza poleceń.\n\n- Guvcview — Prosty interfejs do przechwytywania i przeglądania wideo z urządzeń v4l2.\n\n- cameractrls — Wiersz poleceń i aplikacja graficzna do konfigurowania urządzeń v4l2.\n\n- Kamoso — Rejestrator kamery internetowej od społeczności KDE. Część kde-multimedia.\n\n- MJPG-streamer — Aplikacja wiersza poleceń, która może być używana do przesyłania strumieniowego M-JPEG przez sieć opartą na protokole IP z kamery internetowej do różnych typów przeglądarek.\n\n- Motion — Wysoce konfigurowalny program monitorujący sygnały wideo z wielu typów kamer. Jest w stanie wykryć, czy znaczna część obrazu uległa zmianie; innymi słowy, może wykryć ruch.\n\n- Pantheon Camera — Aplikacja aparatu przeznaczona dla elementary OS.\n\n- QtCAM — Oprogramowanie kamery internetowej z ponad 10 ustawieniami kontroli obrazu, ustawieniami rozszerzeń i przełączaniem przestrzeni kolorów.\n\n- v4l2loopback — Moduł jądra umożliwiający tworzenie wirtualnych urządzeń wideo (v4l2). Może to być używane do tworzenia wirtualnych kamer internetowych z wideo przekazywanym przez programy takie jak FFmpeg.\n\n- Snapshot — Rób zdjęcia i nagrywaj filmy. Część gnome.\n\n- v4l2ucp — Uniwersalny panel sterowania dla urządzeń V4L2.\n\n- v4l-utils — Zapewnia szereg narzędzi dla urządzeń multimedialnych.\n\n- Webcamoid — W pełni funkcjonalny pakiet kamer internetowych.\n\n"
    },
    {
      "title": "Authoring DVD",
      "level": 3,
      "content": "Zobacz także Wikipedia:List of DVD authoring applications.\n\n- Bombono DVD — Program do authoringu DVD z ładnym i przejrzystym GUI.\n\n- Devede — Program do tworzenia płyt VideoDVD i CD.\n\n- DVDStyler — Aplikacja do tworzenia profesjonalnych płyt DVD.\n\n"
    },
    {
      "title": "Zgrywanie DVD",
      "level": 3,
      "content": "Zobacz Optical disc drive#DVD-Video.\n\n"
    },
    {
      "title": "Miniatury wideo",
      "level": 3,
      "content": "- vcsi — Tworzenie arkuszy kontaktów wideo. Arkusz kontaktów wideo to obraz składający się z miniatur nagrań wideo rozmieszczonych na siatce.\n\n- Video Contact Sheet — Skrypt Bash przeznaczony do tworzenia arkuszy kontaktowych wideo (podglądów) filmów. Można użyć dowolnego wideo obsługiwanego przez mplayer i ffmpeg.\n\n"
    },
    {
      "title": "Osobiste rejestratory wideo",
      "level": 2,
      "content": "- MythTV — Domowy projekt PVR.\n\n"
    },
    {
      "title": "Menedżery kolekcji",
      "level": 2,
      "content": "- GCstar — Aplikacja GNOME do porządkowania różnych kolekcji (gier planszowych, komiksów, filmów, znaczków itp.).\n\n- Griffith — Aplikacja do zarządzania kolekcją filmów.\n\n- MediaElch — Menedżer multimediów dla Kodi. Informacje o filmach, programach telewizyjnych, koncertach i muzyce są przechowywane jako pliki nfo.\n\n- Tellico — Aplikacja KDE do organizowania różnych kolekcji (książek, wideo, muzyki, monet itp.).\n\n- tinyMediaManager — Narzędzie do zarządzania multimediami zapewniające metadane dla Kodi.\n\n"
    },
    {
      "title": "Serwery multimediów",
      "level": 2,
      "content": "- Airsonic — Internetowy streamer multimediów, zapewniający wszechobecny dostęp do muzyki. (Widelec Subsonic.)\n\n- DMS — Serwer multimediów cyfrowych UPnP DLNA, który obejmuje podstawowe transkodowanie wideo (a więc z minimalnymi zależnościami).\n\n- Emby — Własny serwer multimediów, który automatycznie konwertuje i strumieniuje multimedia w locie, aby odtwarzać je na dowolnym urządzeniu.\n\n- Gerbera — Serwer multimediów UPnP do strumieniowego przesyłania multimediów do urządzeń w sieci domowej. (Fork of MediaTomb.)\n\n- Icecast — Serwer mediów strumieniowych (audio/wideo), który obecnie obsługuje strumienie Ogg (Vorbis i Theora), Opus, WebM i MP3.\n\n- Jellyfin — System multimedialny, który zapewnia kontrolę nad zarządzaniem i strumieniowaniem multimediów.\n\n- OwnTone — DAAP (iTunes) i serwer multimediów MPD z obsługą urządzeń AirPlay, Apple Remote, Chromecast, Spotify i radia internetowego.\n\n- Plex — Własny serwer multimediów, który organizuje osobiste kolekcje wideo, muzyki i zdjęć oraz przesyła je strumieniowo do wszystkich urządzeń.\n\n- ReadyMedia — Proste oprogramowanie serwera multimediów, które ma być w pełni zgodne z klientami DLNA/UPnP-AV.\n\n- Rygel — UPnP AV MediaServer i MediaRenderer, który umożliwia łatwe udostępnianie audio, wideo i zdjęć oraz sterowanie odtwarzaczem multimediów w sieci domowej. Część gnome.\n\n- Serviio — Własny serwer multimediów, który umożliwia strumieniowe przesyłanie plików multimedialnych (muzyki, wideo lub obrazów) do urządzeń renderujących (np. telewizora, odtwarzacza Bluray, konsoli do gier lub telefonu komórkowego) w podłączonej sieci domowej.\n\n- Subsonic — Własny serwer multimediów do przesyłania strumieniowego z własnego komputera.\n\n- Tvheadend — Serwer telewizyjny i nagrywarka obsługująca DVB-S, DVB-S2, DVB-C, DVB-T, ATSC, ISDB-T, IPTV, SAT>IP i HDHomeRun jako źródła wejściowe.\n\n- Universal Media Server — Serwer multimediów UPnP, który jest w stanie udostępniać wideo, audio i obrazy między większością nowoczesnych urządzeń. (Fork PS3 Media Server.)\n\n"
    },
    {
      "title": "Metadane",
      "level": 2,
      "content": "- CoreInfo — Prosta przeglądarka metadanych mediów oparta na bibliotece mediainfo. Część C-Suite.\n\n- DV Analyzer — Techniczne narzędzie do kontroli jakości i raportowania, które analizuje strumienie DV w celu zgłaszania błędów.\n\n- ExifTool — Aplikacja wiersza poleceń do odczytu, zapisu i edycji meta informacji w szerokiej gamie plików.\n\n- ExifCleaner — Aplikacja komputerowa do czyszczenia metadanych z obrazów, filmów, plików PDF i innych plików.\n\n- Exiv2 — Narzędzie wiersza poleceń do zarządzania metadanymi obrazów. Zapewnia szybki i łatwy dostęp do odczytu i zapisu metadanych Exif, IPTC i XMP oraz profilu ICC osadzonych w obrazach cyfrowych w różnych formatach.\n\n- ffprobe — Zbieranie informacji ze strumieni multimedialnych i drukowanie ich w sposób czytelny dla człowieka i maszyny.\n\n- jExifToolGUI — Graficzny interfejs Java/Swing dla ExifTool, który odczytuje i zapisuje wszelkiego rodzaju znaczniki metadanych z/do plików graficznych.\n\n- jhead — Narzędzie do manipulacji nagłówkiem Exif jpeg.\n\n- mat2 — Narzędzie do usuwania metadanych, obsługujące szeroki zakres powszechnie używanych formatów plików.\n\n- MediaConch — Sprawdzanie implementacji, sprawdzanie polityki, raportowanie i naprawianie.\n\n- MediaInfo — Wygodne, ujednolicone wyświetlanie najistotniejszych danych technicznych i znaczników dla plików wideo i audio.\n\n- sndfile-info — Uzyskiwanie informacji o zawartości pliku audio.\n\n"
    },
    {
      "title": "Menedżery urządzeń mobilnych",
      "level": 2,
      "content": "- Android 2 Linux Notifications — Wyświetlanie powiadomień z telefonu Android na pulpicie przy użyciu połączenia LAN.\n\n- Android File Transfer — Interaktywny klient Media Transfer Protocol z graficznym interfejsem Qt5.\n\n- gMTP — Prosty klient odtwarzacza MP3 i multimediów dla Media Transfer Protocol.\n\n- gnokii — Narzędzia i sterownik przestrzeni użytkownika do użytku z telefonami komórkowymi.\n\n- GNOME Phone Manager — Sterowanie telefonem komórkowym z poziomu pulpitu GNOME.\n\n- gtkpod — GUI dla iPoda firmy Apple wykorzystujący GTK. Umożliwia importowanie istniejącej bazy danych iTunes, dodawanie utworów, podcastów, filmów i okładek oraz edycję tagów ID3.\n\n- KDE Connect — Zapewnia integrację między urządzeniami. Część kde-network.\n\n- Modem Manager GUI — Sterowanie funkcjami modemu szerokopasmowego EDGE/3G/4G.\n\n- Sachesi — Firmware, ekstraktor, wyszukiwarka i instalator dla Blackberry 10.\n\n- Ttwatch — Linux TomTom GPS Watch Utilities.\n\n- Wammu — Zarządzanie danymi w telefonie komórkowym, takimi jak kontakty, kalendarz czy wiadomości.\n\n"
    },
    {
      "title": "Przewodniki telewizyjne",
      "level": 2,
      "content": "- Telly Skout — Konwergentny przewodnik telewizyjny oparty na Kirigami.\n\n- TV-Browser — Oparty na Javie przewodnik telewizyjny, który można łatwo rozszerzyć za pomocą wtyczek.\n\n- XMLTV — Zestaw narzędzi do pobierania list programów telewizyjnych i formatowania ich w formacie xml.\n\n"
    },
    {
      "title": "Nagrywanie dysków optycznych",
      "level": 2,
      "content": "Zobacz Optical disc drive#Burning CD/DVD/BD with a GUI.\n\n"
    }
  ]
}