{
  "title": "List of applications (Polski)/Internet (Polski)",
  "url": "https://wiki.archlinux.org/title/List_of_applications_(Polski)/Internet_(Polski)",
  "sections": [
    {
      "title": "Menedżery sieci",
      "level": 3,
      "content": "Zobacz Network configuration#Network managers.\n\n"
    },
    {
      "title": "Klienty VPN",
      "level": 3,
      "content": "- GlobalProtect-openconnect — Klient GlobalProtect VPN (GUI) dla systemu Linux, oparty na OpenConnect i zbudowany z Qt5, obsługuje tryb autoryzacji SAML.\n\n- Libreswan — Jest to wolna implementacja najczęściej obsługiwanego i ustandaryzowanego protokołu VPN opartego na (\"IPsec\") i Internet Key Exchange (\"IKE\").\n\n- Mullvad — Klient GUI dla usługi Mullvad VPN\n\n- Nebula — Sieć VPN typu mesh\n\n- NetworkManager — Obsługuje różne protokoły (np. MS, Cisco, Fortinet) za pośrednictwem systemu wtyczek.\n\n- OpenConnect — Obsługuje sieci VPN Cisco i Juniper.\n\n- Openswan — Rozwiązanie VPN oparte na protokole IPsec.\n\n- OpenVPN — Do łączenia się z VPNami OpenVPN.\n\n- PPTP Client — Do łączenia się z VPNami PPTP, takimi jak VPNy Microsoftu (MPPE, niebezpieczne).\n\n- RiseupVPN — Klient GUI dla usługi Riseup VPN z riseup.net.\n\n- strongSwan — Rozwiązanie VPN oparte na protokole IPsec.\n\n- tinc — tinc to darmowy demon VPN.\n\n- vopono — Wrapper OpenVPN i Wireguard do uruchamiania aplikacji z tunelami VPN w sieciowych przestrzeniach nazw.\n\n- vpnc — Do łączenia się z koncentratorami VPN Cisco 3000.\n\n- WireGuard — Bezpieczny tunel sieciowy nowej generacji.\n\n"
    },
    {
      "title": "Serwery proxy",
      "level": 3,
      "content": "- Brook — Proxy koncentrujące się na silnym szyfrowaniu i niewykrywalności.\n\n- Clash — Tunel oparty na regułach w Go.\n\n- Dante — Serwer SOCKS i klient SOCKS, implementujący RFC:1928 i powiązane standardy.\n\n- Geph — Modułowy system obchodzenia cenzury internetowej zaprojektowany specjalnie do radzenia sobie z filtrowaniem krajowym.\n\n- NaïveProxy — Serwer proxy wykorzystujący stos sieciowy Chrome do kamuflowania ruchu z silną odpornością na temperaturę i niską wykrywalnością.\n\n- Privoxy — Niebuforujący internetowy serwer proxy z zaawansowanymi funkcjami filtrowania w celu zwiększenia prywatności, modyfikowania danych stron internetowych i nagłówków HTTP, kontrolowania dostępu oraz usuwania reklam i innych nieprzyjemnych śmieci internetowych.\n\n- V2Ray — V2Ray jest rdzeniem Projektu V, który jest zestawem narzędzi pomagających zbudować własną sieć prywatności przez Internet.\n\n- Nekoray — Interfejs graficzny oparty na Qt wieloplatformowy menedżer konfiguracji proxy (backend: v2ray / sing-box)\n\n- Shadowsocks — Bezpieczny serwer proxy socks5, zaprojektowany w celu ochrony ruchu internetowego.\n\n- Squid — Buforujący serwer proxy dla sieci Web obsługujący protokoły HTTP, HTTPS, FTP i inne.\n\n- Stunnel — Serwer i klient do dodawania i usuwania szyfrowania TLS do przepływu danych TCP.\n\n- Tinyproxy — Lekki demon proxy HTTP/HTTPS.\n\n- Trojan — Nieidentyfikowalny mechanizm, który pomaga ominąć GFW.\n\n- Varnish — Akcelerator HTTP o wysokiej wydajności.\n\n- XX-Net — Łatwe w użyciu narzędzie proxy.\n\n- Ziproxy — Przekazujący (bez buforowania) kompresujący serwer proxy HTTP.\n\n"
    },
    {
      "title": "Sieci anonimizujące",
      "level": 3,
      "content": "- Arti — Implementacja w Rust anonimizującej sieci nakładkowej Tor.\n\n- Freenet — Szyfrowana sieć bez cenzury.\n\n- GNUnet — Framework dla bezpiecznych sieci peer-to-peer.\n\n- I2P — Rozproszona, anonimowa sieć.\n\n- Lantern — Oprogramowanie peer-to-peer do omijania cenzury internetowej.\n\n- Lokinet — Anonimowa, zdecentralizowana i oparta na protokole IP sieć nakładkowa dla Internetu.\n\n- Tor — Anonimizująca sieć nakładkowa.\n\n"
    },
    {
      "title": "Tunele sieciowe",
      "level": 3,
      "content": "- 6tunnel — Tuneluje połączenia IPv6 dla aplikacji korzystających wyłącznie z protokołu IPv4.\n\n- iodine — Tunelowanie danych IPv4 przez serwer DNS.\n\n- isatapd — Tworzy i utrzymuje tunel ISATAP (RFC:5214).\n\n- Ping Tunnel — Narzędzie do niezawodnego tunelowania połączeń TCP przez pakiety żądań i odpowiedzi echa ICMP.\n\n- Tuntox — Tunelowanie połączeń TCP przez protokół Tox.\n\n"
    },
    {
      "title": "Przeglądarki internetowe",
      "level": 2,
      "content": "Zobacz także Wikipedia:pl:Porównanie przeglądarek internetowych.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 3,
      "content": "- browsh — W pełni nowoczesna przeglądarka tekstowa. Działa jako nakładka na bezgłowego Firefoksa.\n\n- ELinks — Zaawansowana i bogata w funkcje przeglądarka internetowa w trybie tekstowym z obsługą przewijania kółkiem myszy, ramkami i tabelami, rozszerzalna za pomocą Lua i Guile (fork links).\n\n- Links — Przeglądarka internetowa z trybem graficznym i tekstowym. Zawiera wersję konsolową podobną do Lynx.\n\n- Lynx — Przeglądarka tekstu dla sieci World Wide Web.\n\n- w3m — Pager/przeglądarka internetowa oparta na tekście. Posiada wiązania klawiszy podobne do vima i jest w stanie wyświetlać obrazy.\n\n"
    },
    {
      "title": "Bazowane na Gecko",
      "level": 4,
      "content": "See also Wikipedia:Gecko (software).\n\n- Firefox — Rozszerzalna przeglądarka Mozilli oparta na Gecko z szybkim renderowaniem.\n\n- SeaMonkey — Kontynuacja pakietu Mozilla Internet Suite.\n\n- Dot — Fork Firefoksa skupiający się na prywatności i bardziej eleganckim interfejsie użytkownika.\n\n- FireDragon — Fork Floorp, który zawiera poprawki integracyjne KDE i niestandardowy branding dla Garudy.\n\n- Floorp — Oparta na Firefoksie przeglądarka z doskonałą ochroną prywatności, opracowana przez społeczność studentów w Japonii.\n\n- GNU IceCat — Dostosowana wersja Firefoksa ESR dystrybuowana przez Projekt GNU, pozbawiona niewolnych komponentów i z dodatkowymi rozszerzeniami prywatności. Cykl wydawniczy może być opóźniony w porównaniu do Mozilla Firefox.\n\n- LibreWolf — Fork Firefoksa, skupiający się na prywatności, bezpieczeństwie i wolności.\n\n- Mercury — Fork Firefoksa z optymalizacjami kompilatora i poprawkami z Librewolf, Waterfox i GNU IceCat.\n\n- Mullvad Browser — Skoncentrowana na prywatności przeglądarka internetowa opracowana przez Mullvad VPN i Tor Project.\n\n- Pulse Browser — Eksperymentalny fork Firefoksa, który poprawia koncentrację i zwiększa produktywność pracy dzięki hiper minimalistycznemu interfejsowi użytkownika i wbudowanym narzędziom.\n\n- Tor Browser Launcher — Bezpieczne i łatwe pobieranie, weryfikowanie, instalowanie i uruchamianie przeglądarki Tor Browser, będącej forkiem Firefoksa ESR.\n\n- Waterfox Classic — Zoptymalizowany fork Firefoksa 56, bez gromadzenia danych i pozwalający na niepodpisane rozszerzenia i wtyczki NPAPI.\n\n"
    },
    {
      "title": "Bazowane na Blinku",
      "level": 4,
      "content": "Zobacz także Wikipedia:pl:Blink (silnik).\n\n- Chromium — Przeglądarka internetowa opracowana przez Google, projekt open source stojący za Google Chrome.\n\n- Brave — Przeglądarka internetowa z wbudowanym blokowaniem reklam i trackerów.\n\n- Iridium — Skoncentrowany na prywatności patchset dla Chromium. Zobacz różnice w stosunku do Chromium.\n\n- Ungoogled Chromium — Modyfikacje Google Chromium w celu usunięcia integracji Google i zwiększenia prywatności, kontroli i przejrzystości\n\n- Thorium — Thorium rozwija okresowo synchronizowany fork przeglądarki Chromium, rozszerzony o dodatkowe poprawki optymalizujące wydajność, poprawiające użyteczność i zwiększające bezpieczeństwo. Według testów przeprowadzonych przez deweloperów, Thorium wyprzedza zwykłe Chromium o 8-40%, głównie dzięki włączeniu dodatkowych optymalizacji podczas kompilacji.\n\n- Google Chrome — Zastrzeżona przeglądarka internetowa opracowana przez Google.\n\n- Microsoft Edge — Zastrzeżona przeglądarka internetowa opracowana przez Microsoft.\n\n- Opera — Autorska przeglądarka opracowana przez Opera Software.\n\n- Slimjet — Szybka, inteligentna i wydajna przeglądarka oparta na Chromium.\n\n- Vivaldi — Zaawansowana przeglądarka stworzona z myślą o zaawansowanych użytkownikach.\n\n- Yandex Browser — Autorska przeglądarka, która łączy w sobie minimalistyczny design z zaawansowaną technologią, aby uczynić sieć szybszą, bezpieczniejszą i łatwiejszą.\n\n- Angelfish — Przeglądarka internetowa dla Plasma Mobile. Część kde-network.\n\n- Dooble — Kolorowa przeglądarka internetowa.\n\n- Eric — Oparta na QtWebEngine przeglądarka HTML, będąca częścią zestawu narzędzi programistycznych eric6, może zostać uruchomiona za pomocą polecenia eric6_browser.\n\n- Falkon — Przeglądarka internetowa oparta na QtWebEngine, napisana we frameworku Qt. Część kde-network.\n\n- Fiery — Konwergentna przeglądarka internetowa. Część maui.\n\n- Konqueror — Przeglądarka internetowa oparta na zestawie narzędzi Qt i Qt WebEngine. Część kde-network.\n\n- Liri Browser — Minimalistyczna przeglądarka internetowa Material Design napisana dla Liri.\n\n- Otter Browser — Przeglądarka mająca na celu odtworzenie klasycznego interfejsu użytkownika Opery (12.x) przy użyciu Qt5.\n\n- qutebrowser — Sterowana klawiaturą przeglądarka podobna do vima oparta na PyQt5 i QtWebEngine.\n\n- Beaker — Przeglądarka internetowa peer-to-peer z narzędziami do tworzenia i hostowania stron internetowych.\n\n- Catalyst — Minimalna przeglądarka internetowa FOSS bez gromadzenia danych.\n\n- Franz — Przeglądarka wiadomości dla WhatsApp, Facebook Messenger, Slack, Telegram i wielu innych usług internetowych.\n\n- Hamsket — Alternatywa dla Franza na licencji GPL, sforkowana z ostatnich otwartych źródeł Rambox.\n\n- Min — Szybka, minimalistyczna przeglądarka, która chroni prywatność użytkownika. Zawiera interfejs zaprojektowany tak, aby zminimalizować rozpraszanie uwagi.\n\n- Vieb — Minimalistyczna przeglądarka oparta na Electronie z powiązaniami klawiszy inspirowanymi Vimem i wbudowanym blokerem reklam.\n\n"
    },
    {
      "title": "Bazowane na WebKitGTK",
      "level": 4,
      "content": "Zobacz także Wikipedia:pl:WebKit.\n\nWiększość z nich obsługuje blokowanie reklam poprzez wyebadblock.\n\n- Badwolf — Minimalistyczna przeglądarka skupiająca się na prywatności.\n\n- Eolie — Prosta przeglądarka internetowa dla środowiska GNOME.\n\n- GNOME Web — Przeglądarka korzystająca z silnika renderującego WebKitGTK. Część gnome.\n\n- Luakit — Szybki, mały, oparty na webkit framework przeglądarki rozszerzalny przez Lua.\n\n- Midori — Lekka przeglądarka internetowa oparta na GTK i WebKit.\n\n- Nyxt — Zorientowana na klawiaturę, nieskończenie rozszerzalna przeglądarka zaprojektowana dla zaawansowanych użytkowników. Posiada znajome wiązania klawiszy (Emacs, VI, CUA) i funkcje rozmytego wyszukiwania między kartami, wielokrotnego wyboru, historii jako drzewa i nie tylko.\n\n- surf — Lekka przeglądarka oparta na WebKit, zgodna z filozofią suckless (zasadniczo sama przeglądarka jest pojedynczym plikiem źródłowym C).\n\n- Surfer — Prosta przeglądarka internetowa oparta na klawiaturze, napisana w języku C. Obsługuje niestandardowe skrypty JS.\n\n- Tangram — Integracja aplikacji internetowych z pulpitem, w szczególności ze środowiskiem GNOME.\n\n- Vimb — Przeglądarka internetowa podobna do Vima, napisana w C, inspirowana Pentadactylem i Vimprobable. Zawiera stronę podręcznika i instrukcje dotyczące typowych konfiguracji. Obsługuje niestandardowe skrypty JS, tryb ciemny i obsługuje żądania geolokalizacji.\n\n- wyeb — Przeglądarka internetowa podobna do vima inspirowana dwb i luakit z Adblockiem.\n\n"
    },
    {
      "title": "Inne",
      "level": 4,
      "content": "- Dillo — Mała, szybka graficzna przeglądarka internetowa zbudowana na FLTK. Używa własnego silnika układu.\n\n- Ladybird — Przeglądarka internetowa zbudowana od podstaw przy użyciu SerenityOS LibWeb.\n\n- Links — Przeglądarka internetowa z trybem graficznym i tekstowym. Zawiera wersję konsolową podobną do Lynx.\n\n- NetSurf — Przeglądarka Featherweight napisana w języku C, wyróżniająca się powoli rozwijającą się obsługą JavaScript i szybkim renderowaniem dzięki własnemu silnikowi układu.\n\n- Pale Moon — Fork Firefoksa skupiający się na szybkości, z interfejsem sprzed Firefoksa 29. Używa silnika układu Goanna, forka Gecko. Dodatki do Firefoksa mogą nie być kompatybilne. Nie obsługuje nowszych funkcji Firefoksa, takich jak WebExtensions, cache2, e10s i OTMC. Wiele starych 93 598 wersji 19 450 dodatków do Firefoksa stworzonych przez 14 274 deweloperów w ciągu ostatnich 15 lat przy użyciu technologii XUL/XPCOM w Archiwum dodatków klasycznych nadal działa.\n\n"
    },
    {
      "title": "Przeglądarki Gemini",
      "level": 3,
      "content": "Zobacz także Wikipedia:Gemini (protocol)#Software.\n\n- Amfora — Przeglądarka terminalowa dla protokołu Gemini.\n\n- Bombabillo — Nieinternetowy klient terminala, obsługujący Gopher, Gemini i wiele innych.\n\n- Castor — Graficzny klient dla protokołów Gemini, Gopher i Finger, napisany w Rust z GTK.\n\n- Geopard — Graficzny klient gemini napisany w języku rust, wykorzystujący zestaw narzędzi gtk4.\n\n- Kristall — Przeglądarka Gemini oparta na Qt.\n\n- Lagrange — Pulpitowy klient GUI do przeglądania przestrzeni Gemini, oferujący nowoczesne udogodnienia znane z przeglądarek internetowych.\n\n- Telescope — przeglądarka podobna do w3m dla Gemini.\n\n"
    },
    {
      "title": "Serwery WWW",
      "level": 2,
      "content": "serwer WWW obsługuje strony internetowe HTML i inne pliki za pośrednictwem protokołu HTTP do klientów, takich jak przeglądarki internetowe. Główne serwery internetowe mogą być połączone z programami do obsługi dynamicznej zawartości (aplikacji internetowych).\n\nZobacz także Category:Web server and Wikipedia:Comparison of web server software.\n\n- Apache HTTP Server — Wysokowydajny serwer HTTP oparty na systemie Unix.\n\n- Caddy — Serwer HTTP/2 z automatycznym HTTPS.\n\n- Hiawatha — Bezpieczny i zaawansowany serwer WWW.\n\n- Lighttpd — Bezpieczny, szybki, zgodny i bardzo elastyczny serwer WWW.\n\n- nginx — Lekki serwer HTTP i serwer proxy IMAP/POP3.\n\n- sthttpd — Obsługiwany fork serwera internetowego thttpd.\n\n- Traefik — Nowoczesny reverse proxy i load balancer, który ułatwia wdrażanie mikrousług.\n\n- yaws — Serwer internetowy/framework napisany w języku Erlang.\n\n"
    },
    {
      "title": "Statyczne serwery WWW",
      "level": 3,
      "content": "- darkhttpd — Mały i bezpieczny statyczny serwer WWW, napisany w języku C, nie obsługuje HTTPS ani Auth.\n\n- miniserve — Rust alternative to darkhttpd with UTF-8, optional HTTP authentication, file uploading, and more.\n\n- quark — Niezwykle mały i prosty serwer http get-only. Obsługuje tylko statyczne strony na jednym hoście.\n\n- serve — Statyczne wyświetlanie plików i katalogów.\n\n- Webfs — Prosty i natychmiastowy serwer internetowy dla głównie statycznych treści.\n\nModuł biblioteki standardowej Python http.server może być również używany z wiersza poleceń.\n\n"
    },
    {
      "title": "Specjalistyczne serwery WWW",
      "level": 3,
      "content": "- chezdav — Serwer WebDAV umożliwiający udostępnianie określonego katalogu.\n\n- Mongoose — Wbudowana biblioteka serwera WWW, obsługuje WebSocket i MQTT.\n\n- OnionShare — Umożliwia bezpieczne, anonimowe wysyłanie i odbieranie plików. Działa poprzez uruchomienie serwera internetowego, udostępnienie go jako usługi cebulowej Tor i wygenerowanie niemożliwego do odgadnięcia adresu internetowego, dzięki czemu inni mogą pobierać lub przesyłać pliki do Ciebie.\n\n- Transfer More — Minimalistyczny serwer HTTP typu open-source do tymczasowego przechowywania i udostępniania plików, napisany w języku Crystal i oparty na Kemal.\n\n- VServer — Aplikacja GTK, która otwiera serwer http w wybranym folderze i udostępnia pliki.\n\n- webhook — Mały serwer do tworzenia punktów końcowych HTTP (hooków)\n\n- Woof — Serwer internetowy ad-hoc z jednym plikiem; Web Offer One File.\n\n"
    },
    {
      "title": "Serwery WSGI",
      "level": 3,
      "content": "- Gunicorn — Serwer HTTP WSGI w języku Python dla systemu UNIX.\n\n- uWSGI — Szybki, samonaprawiający się i przyjazny dla programistów oraz administratorów serwer kontenerów aplikacji napisany w języku C.\n\n- Waitress — Serwer WSGI dla Pythona 3.\n\nApache obsługuje również WSGI za pomocą mod_wsgi.\n\n"
    },
    {
      "title": "Testowanie wydajności",
      "level": 3,
      "content": "- http_load — Narzędzie do testowania wydajności serwerów internetowych, działające w pojedynczym procesie.\n\n- httperf — Może generować różne obciążenia HTTP, napisane w języku C.\n\n- httping — A \"ping\"-like tool for HTTP requests\n\n- siege — Narzędzie do testowania regresji i porównywania HTTP.\n\n- vegeta — Narzędzie do testowania obciążenia HTTP, napisane w języku Go.\n\n- Web Bench — Narzędzie do testów porównawczych, używa funkcji fork() do symulacji wielu klientów.\n\n"
    },
    {
      "title": "Menedżery pobierania",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of download managers.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- aria2 — Lekkie narzędzie do pobierania plików obsługujące protokoły HTTP/S, FTP, SFTP, BitTorrent i Metalink. Może działać jako demon kontrolowany przez wbudowany interfejs JSON-RPC lub XML-RPC.\n\n- Axel — Lekki akcelerator pobierania z wiersza poleceń zajmujący mniej niż 250 kB na dysku. Obsługuje protokoły HTTP/S i FTP.\n\n- cURL — Narzędzie i biblioteka do pobierania adresów URL. Obsługuje protokoły HTTP, FTP i SFTP.\n\n- HTTPie — Przyjazny dla człowieka klient HTTP wiersza poleceń dla ery API.\n\n- HTTrack — Łatwa w użyciu przeglądarka offline. Umożliwia pobranie strony World Wide Web z Internetu do lokalnego katalogu, budując rekursywnie wszystkie katalogi, pobierając HTML, obrazy i inne pliki z serwera na komputer.\n\n- LFTP — Zaawansowany program do przesyłania plików. Obsługuje protokoły HTTP, FTP, SFTP, FISH i BitTorrent.\n\n- Plowshare — Zestaw narzędzi wiersza poleceń zaprojektowanych do zarządzania witrynami do udostępniania plików (aka Hosters).\n\n- RTMPDump — Pobieranie filmów FLV przez RTMP (zastrzeżony protokół Adobe dla odtwarzaczy wideo Flash)\n\n- snarf — Narzędzie do pobierania adresów URL z wiersza poleceń. Obsługuje protokoły HTTP i FTP.\n\n- Streamlink — Uruchamiaj strumienie z różnych serwisów streamingowych w niestandardowym odtwarzaczu wideo lub zapisuj je w pliku.\n\n- Streamripper — Nagrywa i dzieli strumieniowe pliki mp3 na ścieżki.\n\n- yewtube — Odtwarzacz i downloader YouTube oparty na terminalu.\n\n- You-Get — Pobieranie treści multimedialnych (wideo, audio, obrazów) z Internetu.\n\n- youtube-dl — Pobieranie filmów z YouTube i wielu innych stron internetowych.\n\n- youtube-viewer — Narzędzie wiersza poleceń do przeglądania filmów z YouTube.\n\n- ytfzf — Skrypt POSIX do wyszukiwania i oglądania filmów youtube z terminala.\n\n- yt-dlp — Fork youtube-dl z dodatkowymi funkcjami i poprawkami.\n\n- Wget — Narzędzie sieciowe do pobierania plików z Internetu. Obsługuje protokoły HTTP i FTP.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- ClipGrab — Downloader i konwerter dla YouTube, Vimeo i wielu innych serwisów wideo online.\n\n- FatRat — Menedżer pobierania oparty na Qt z obsługą HTTP, FTP, SFTP, BitTorrent i Metalink.\n\n- Forklift — Proste GUI dla youtube-dl przy użyciu PyGObject.\n\n- gtk-youtube-viewer — Narzędzie GTK do przeglądania filmów z YouTube. Zobacz opcjonalne zależności dla GUI.\n\n- Gwget — Menedżer pobierania dla środowiska GNOME. Obsługuje protokoły HTTP i FTP.\n\n- Gydl — GUI wrapper wokół już istniejącego programu youtube-dl do pobierania treści z serwisów takich jak YouTube.\n\n- Gyre — GTK3 downloader dla filmów z Coub.\n\n- JDownloader — Oparty na Javie downloader dla witryn hostujących jednym kliknięciem.\n\n- KGet — Menedżer pobierania dla KDE. Obsługuje protokoły HTTP, FTP, BitTorrent i Metalink. Część kde-network.\n\n- MegaBasterd — Kolejny nieoficjalny zestaw MEGA do pobierania/przesyłania/streamingu.\n\n- Motrix — W pełni funkcjonalny menedżer pobierania, który obsługuje pobieranie HTTP, FTP, BitTorrent, Magnet itp. Oparty na platformie Electron.\n\n- Persepolis — Graficzny interfejs menedżera pobierania aria2 z wieloma funkcjami. Obsługuje protokoły HTTP i FTP.\n\n- pyLoad — Downloader napisany w Pythonie i zaprojektowany tak, aby był niezwykle lekki, łatwy do rozszerzenia i w pełni zarządzalny przez Internet.\n\n- Steadyflow — Prosty menedżer pobierania dla środowiska GNOME. Obsługuje protokoły HTTP i FTP.\n\n- Streamtuner2 — Internetowa stacja radiowa i przeglądarka wideo. Po prostu wyświetla listę stacji w kategoriach z różnych katalogów i uruchamia preferowane aplikacje multimedialne do odtwarzania.\n\n- uGet — Menedżer pobierania GTK z klasyfikacją pobierania i importem HTML. Obsługuje protokoły HTTP, FTP, BitTorrent, Metalink, YouTube i Mega.\n\n- Video Downloader — Aplikacja GTK do pobierania filmów z serwisów takich jak YouTube i wielu innych (oparta na youtube-dl).\n\n- Xtreme Download Manager — Potężne narzędzie zwiększające prędkość pobierania nawet o 500%. Obsługuje protokoły HTTP i FTP. Video grabber działa w sposób ogólny i nie jest ograniczony do określonych stron internetowych.\n\n- youtubedl-gui — Prosty w użyciu interfejs graficzny dla youtube-dl.\n\n"
    },
    {
      "title": "Przesyłanie plików przez sieć LAN",
      "level": 3,
      "content": "Zobacz także #Komunikatory LAN.\n\n- LAN Share — Wieloplatformowa aplikacja do przesyłania plików w sieci lokalnej, zbudowana przy użyciu frameworka Qt GUI. Może być używana do natychmiastowego przesyłania całego folderu, jednego lub więcej plików, dużych lub małych, bez dodatkowej konfiguracji.\n\n- NitroShare — Wieloplatformowa aplikacja do przesyłania plików w sieci, zbudowana przy użyciu frameworka Qt GUI. Została zaprojektowana tak, aby przesyłanie plików z jednego urządzenia do drugiego w sieci lokalnej było niezwykle proste.\n\n- Teleport — Natywna aplikacja GTK3 do łatwego udostępniania plików w sieci lokalnej.\n\n- Warpinator — Aplikacja GTK do udostępniania plików w sieci LAN.\n\n"
    },
    {
      "title": "Serwery pamięci masowej w chmurze",
      "level": 3,
      "content": "- Cozy — Osobista chmura, którą można zhakować, hostować i usunąć.\n\n- Nextcloud — Serwer w chmurze do centralnego przechowywania plików na sprzęcie kontrolowanym przez użytkownika.\n\n- Pydio — Dojrzała aplikacja internetowa typu open source do udostępniania i synchronizacji plików.\n\n- Seafile — Narzędzie do przechowywania plików i współpracy online z zaawansowaną obsługą synchronizacji plików, ochrony prywatności i pracy zespołowej.\n\n"
    },
    {
      "title": "Klienty synchronizacji z chmurą",
      "level": 3,
      "content": "- Niektóre programy do synchronizacji i tworzenia kopii zapasowych zapewniają bezpośrednią obsługę niektórych usług przechowywania danych w chmurze.\n- Niektóre Systemy plików FUSE zapewniają sposób montowania pamięci masowej w chmurze jako systemu plików. Dostęp do Dysku Google można uzyskać również przez gvfs-google dla aplikacji opartych na GVFS (takich jak Nautilus) oraz przez kio-gdrive dla aplikacji opartych na KIO (takich jak Dolphin).\n- Zobacz Data-at-rest encryption#Cloud-storage optimized, aby osiągnąć przechowywanie zero-knowledge (przezroczyste szyfrowanie po stronie klienta) w dowolnej usłudze chmurowej innej firmy.\n\n"
    },
    {
      "title": "Klienty wieloprotokołowe",
      "level": 4,
      "content": "- CloudCross — Synchronizacja lokalnych plików i folderów z wieloma dostawcami usług w chmurze. Dostępne jest wsparcie dla Mail.ru Cloud, Yandex Disk, Google Drive, OneDrive i Dropbox.\n\n- Rclone — Klient synchronizacji, kopiowania i montowania dla wielu dostawców.\n\n- Rclone Browser — Klient GUI dla Rclone.\n\n"
    },
    {
      "title": "Klienty Dysku Google",
      "level": 4,
      "content": "- drive — Niewielki program do pobierania lub przesyłania plików z Dysku Google.\n\n- DriveSync — Narzędzie wiersza poleceń, które synchronizuje pliki Dysku Google z folderem lokalnym na komputerze.\n\n- gdrive — Narzędzie wiersza poleceń do interakcji z Dyskiem Google.\n\n- Grive — Klient Dysku Google z obsługą nowego interfejsu Drive REST API i częściową synchronizacją.\n\n- Insync — Nieoficjalny klient Google Drive na komputery stacjonarne.\n\n- VGrive — Oparty na GTK klient GUI (back-end i front-end) dla Dysku Google wykonany w Vala.\n\n"
    },
    {
      "title": "Inne klienty synchronizacji",
      "level": 4,
      "content": "- aws-cli — CLI dla Amazon Web Services, w tym wydajne przesyłanie plików do i z Amazon S3.\n\n- Backblaze B2 — Backblaze B2 - klient wiersza poleceń o otwartym kodzie źródłowym.\n\n- Baidu Netdisk — Własny klient usługi przechowywania danych w chmurze uruchomionej przez Baidu (wcześniej Baidu Cloud).\n\n- Cozy Drive — Klient desktopowy dla Cozy.\n\n- Dropbox — Własny klient komputerowy dla Dropbox.\n\n- Mega Sync Client — Własnościowy (choć kod źródłowy jest dostępny) klient desktopowy do synchronizacji plików z Mega.\n\n- Megatools — Nieoficjalne CLI dla Mega.\n\n- Nextcloud Client — Klient desktopowy dla Nextcloud.\n\n- Nutstore — Własny klient desktopowy dla Nutstore.\n\n- OneDrive — Nieoficjalne CLI dla OneDrive.\n\n- OneDrive — Nieoficjalne CLI dla OneDrive.\n\n- ownCloud Desktop Client — Klient synchronizacji pulpitu dla ownCloud.\n\n- pCloud Drive — Własny klient synchronizacji pulpitu dla pCloud. Oparty na platformie Electron.\n\n- PydioSync — Klient desktopowy dla Pydio.\n\n- S3cmd — Nieoficjalne CLI dla Amazon S3.\n\n- Seafile Client — Klient GUI dla Seafile.\n\n- Versiobit — Klient synchronizacji plików na pulpicie z wersjonowaniem i kompleksowym szyfrowaniem.\n\n- SpiderOak One — Własny klient dla SpiderOak One.\n\n- Synology Drive — Opatentowany klient GUI do synchronizacji i udostępniania plików między scentralizowanym serwerem Synology NAS a wieloma komputerami klienckimi.\n\n- Tresorit — Własny klient synchronizacji pulpitu dla Tresorit.\n\n- Yandex Disk — Własne CLI dla Yandex Disk.\n\n"
    },
    {
      "title": "Klienty FTP",
      "level": 4,
      "content": "Zobacz także Wikipedia:Comparison of FTP client software.\n\n- CurlFtpFS — to system plików umożliwiający dostęp do hostów FTP oparty na FUSE i libcurl.\n\n- FileZilla — Szybki i niezawodny klient FTP, FTPS i SFTP.\n\n- ftp — Prosty klient ftp dostarczany przez GNU Inetutils\n\n- lftp — Zaawansowany klient FTP oparty na wierszu poleceń\n\n- ncftp — Zestaw darmowych aplikacji implementujących protokół FTP.\n\n- tnftp — Klient FTP z kilkoma zaawansowanymi funkcjami dla NetBSD.\n\nNiektóre menedżery plików, takie jak Dolphin, GNOME Files i Thunar również oferują funkcjonalność FTP.\n\n"
    },
    {
      "title": "Serwery FTP",
      "level": 4,
      "content": "Zobacz także Wikipedia:List of FTP server software.\n\n- bftpd — Mały, łatwy w konfiguracji serwer FTP\n\n- ftpd — Prosty serwer ftp dostarczany przez GNU Inetutils\n\n- proFTPd — Bezpieczny i konfigurowalny serwer FTP\n\n- Pure-FTPd — Darmowy (na licencji BSD), bezpieczny i zgodny ze standardami serwer FTP o jakości produkcyjnej.\n\n- SSH — SFTP to protokół sieciowy, który zapewnia dostęp do plików, transfer plików i zarządzanie plikami za pośrednictwem dowolnego niezawodnego strumienia danych.\n\n- vsftpd — Lekki, stabilny i bezpieczny serwer FTP dla systemów typu UNIX.\n\n"
    },
    {
      "title": "Klienty BitTorrent",
      "level": 3,
      "content": "Niektóre menedżery pobierania są również w stanie połączyć się z siecią BitTorrent: Aria2, LFTP, FatRat, KGet, MLDonkey, uGet.\n\nSee also Wikipedia:Comparison of BitTorrent clients.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Ctorrent — CTorrent to klient BitTorrent zaimplementowany w C++, który jest lekki i szybki.\n\n- Deluge — Klient BitTorrent z wieloma interfejsami użytkownika w modelu klient/serwer. Pakiet ten zawiera klienta konsoli.\n\n- peerflix — Klient strumieniowania torrentów dla node.js.\n\n- rTorrent — Prosty i lekki klient BitTorrent ncurses.\n\n- Transmission CLI — Prosty i łatwy w użyciu klient BitTorrent z wersją demona i wieloma front-endami. Pakiet ten zawiera backend, demona, interfejs wiersza poleceń i interfejs Web UI.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Deluge (Interfejs GTK) — Przyjazny dla użytkownika klient BitTorrent napisany w Pythonie przy użyciu GTK.\n\n- Fragments — Łatwy w użyciu klient BitTorrent dla środowiska graficznego GNOME.\n\n- FrostWire — Łatwy w użyciu program do pobierania plików z chmury, klient BitTorrent i odtwarzacz multimediów.\n\n- Ktorrent — Bogaty w funkcje klient BitTorrent dla środowiska KDE. Część kde-network.\n\n- Powder Player — Hybryda pomiędzy klientem strumieniowania BitTorrent i odtwarzaczem. Oparta na platformie Electron.\n\n- qBittorrent — Klient BitTorrent o otwartym kodzie źródłowym (GPLv2) ze zintegrowaną wyszukiwarką torrentów, która bardzo przypomina µTorrent.\n\n- Tixati — Autorski program do udostępniania plików peer-to-peer wykorzystujący popularny protokół BitTorrent.\n\n- Torrential — Prosty klient torrent dla podstawowego systemu operacyjnego.\n\n- Transmission — Prosty i łatwy w użyciu klient BitTorrent z wersją demona i wieloma nakładkami.\n\n- Transmission Remote — Klient GTK do zdalnego zarządzania klientem Transmission BitTorrent przy użyciu protokołu HTTP RPC.\n\n- Tremotesf — Klient Qt do zdalnego zarządzania klientem Transmission BitTorrent przy użyciu protokołu HTTP RPC.\n\n- Tribler — klient BitTorrent czwartej generacji systemu udostępniania plików.\n\n- Vuze — Bogaty w funkcje klient BitTorrent napisany w Javie (wcześniej Azureus).\n\n- WebTorrent Desktop — Aplikacja do przesyłania strumieniowego BitTorrent. Oparta na platformie Electron.\n\n"
    },
    {
      "title": "Inne sieci P2P",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of file-sharing applications.\n\n- aMule — Dobrze znany klient eDonkey/Kad z wersją demona oraz interfejsami GTK, webowym i CLI.\n\n- EiskaltDC++ — Direct Connect i klient ADC.\n\n- gtk-gnutella — Serwer/klient GTK dla sieci peer-to-peer Gnutella.\n\n- KaMule — Graficzny interfejs KDE dla aMule.\n\n- LBRY — Przeglądarka i portfel dla LBRY, zdecentralizowanego, kontrolowanego przez użytkowników rynku treści. Oparta na platformie Electron.\n\n- lbt — Mały zestaw narzędzi wiersza poleceń dla LBRY.\n\n- MLDonkey — Wieloprotokołowy klient P2P obsługujący protokoły HTTP, FTP, BitTorrent, Direct Connect, eDonkey i FastTrack.\n\n- ncdc — Nowoczesny i lekki klient Direct Connect i ADC z przyjaznym interfejsem ncurses.\n\n- Nicotine+ — Graficzny klient dla sieci P2P Soulseek.\n\n- Send Anywhere — Własna usługa udostępniania plików, w ramach której użytkownicy mogą bezpośrednio udostępniać treści cyfrowe w czasie rzeczywistym. Oparty na platformie Electron.\n\n- IPFS — IPFS to sieć P2P umożliwiająca udostępnianie i odbieranie plików.\n\n"
    },
    {
      "title": "Usługi Pastebin",
      "level": 3,
      "content": "Zobacz także Wikipedia:pl:Pastebin.\n\nUsługi Pastebin są często używane do cytowania tekstu lub obrazów podczas współpracy i rozwiązywania problemów. Klienty Pastebin zapewniają wygodny sposób publikowania z wiersza poleceń.\n\nNote: **Nie** \n\n"
    },
    {
      "title": "Bez dedykowanego klienta",
      "level": 4,
      "content": "Niektóre usługi mogą być używane z bardziej ogólnym narzędziem wiersza poleceń, takim jak cURL. W przypadku rozszerzeń, takich jak numery linii, można użyć więcej narzędzi wiersza poleceń. Takich jak cat -n.\n\n- 0x0.st to usługa hostingu plików. Przykłady użycia to:\n\n```\n$ polecenie | curl -F 'file=@-' 0x0.st\n```\n\n```\n$ curl -F 'file=@-' 0x0.st < plik\n```\n\n- termbin.com współpracuje z nc.\n\n"
    },
    {
      "title": "Z dedykowanym klientem",
      "level": 4,
      "content": "- Fb-client — Klient dla pastebin paste.xinu.at.\n\n- Gist — Interfejs wiersza poleceń dla usługi pastebin gist.github.com.\n\n- imgur — Klient CLI, który może przesłać obraz do usługi udostępniania obrazów imgur.com.\n\n- Pastebinit — Naprawdę mały skrypt Pythona, który działa jako klient Pastebin (zobacz pastebinit -l dla listy serwerów).\n\n- ruby-haste — Klient dla hastebin.com.\n\n- Wgetpaste — Skrypt Bash, który automatyzuje wklejanie do wielu usług pastebin.\n\n"
    },
    {
      "title": "Klienty Email",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of email clients\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- aerc — Asynchroniczny klient poczty e-mail, w trakcie opracowywania.\n\n- alot — Eksperymentalny terminal MUA oparty na notmuch mail. Jest napisany w Pythonie przy użyciu zestawu narzędzi urwid.\n\n- Alpine — Szybki, łatwy w użyciu i licencjonowany przez Apache klient poczty e-mail oparty na Pine.\n\n- S-nail — system przetwarzania poczty ze składnią poleceń przypominającą ed z liniami zastąpionymi przez wiadomości. Zapewnia funkcjonalność mailx.\n\n- mu/mu4e — Indeksator poczty e-mail (mu) i klient dla emacsa (mu4e). Oparty na Xapian dla szybkiego wyszukiwania.\n\n- Mutt — Mały, ale bardzo wydajny klient poczty tekstowej.\n\n- NeoMutt — Czytnik poczty z wiersza poleceń (lub MUA). Jest to rozwidlenie Mutt z dodatkowymi funkcjami.\n\n- nmh — Modułowy system obsługi poczty.\n\n- notmuch — Szybki indeksator poczty zbudowany na bazie xapian.\n\n- sendemail — Lekki klient poczty elektronicznej SMTP napisany w Perlu.\n\n- Sup — Klient poczty CLI z bardzo szybkim wyszukiwaniem, tagowaniem, wątkowaniem i działaniem podobnym do GMail.\n\n- swaks — Swiss Army Knife SMTP; Testowanie SMTP z wiersza poleceń, w tym TLS i AUTH, może być używane do wysyłania wiadomości e-mail.\n\n- Wanderlust — Klient poczty e-mail i czytnik wiadomości dla Emacsa.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Balsa — Prosty i lekki klient poczty e-mail dla środowiska GNOME.\n\n- Betterbird — Fork thunderbird.\n\n- Claws Mail — Lekki klient poczty e-mail i czytnik wiadomości oparty na GTK.\n\n- ElectronMail — Nieoficjalna aplikacja desktopowa dla kilku dostawców szyfrowanej poczty e-mail (takich jak ProtonMail, Tutanota). Oparta na platformie Electron.\n\n- Evolution — Dojrzały i bogaty w funkcje klient poczty e-mail, będący częścią projektu GNOME. Część gnome-extra.\n\n- Geary — Prosty klient pocztowy zbudowany w Vala. Część gnome-extra.\n\n- Kmail — Dojrzały i bogaty w funkcje klient poczty e-mail. Część kde-pim.\n\n- Kube — Nowoczesny klient do komunikacji i współpracy zbudowany przy użyciu QtQuick.\n\n- Mailspring — Fork Nylas Mail stworzony przez jednego z oryginalnych autorów. Płatna wersja \"Pro\" wymaga Mailspring ID i ma dodatkowe funkcje, takie jak drzemka, wyślij później. Oparta na platformie Electron.\n\n- SeaMonkey Mail & Newsgroups — Klient poczty e-mail wchodzący w skład pakietu SeaMonkey.\n\n- Sylpheed — Lekki i przyjazny dla użytkownika klient poczty elektronicznej GTK.\n\n- Thunderbird — Bogaty w funkcje klient poczty e-mail od Mozilli napisany w GTK.\n\n- Tutanota — Klient poczty e-mail dla usługi pocztowej Tutanota. Oparty na platformie Electron.\n\n- Viagee — Umożliwia ona obsługę akcji poczty stacjonarnej, takich jak \"Wyślij plik jako e-mail\" lub łącza internetowe \"mailto\", przez klienta internetowego Gmail.\n\n"
    },
    {
      "title": "Przeglądarkowe",
      "level": 4,
      "content": "- Nextcloud Mail — Aplikacja internetowa do obsługi poczty e-mail dla NextCloud.\n\n- Roundcube — Oparta na przeglądarce wielojęzyczna aplikacja kliencka IMAP z natywnym interfejsem użytkownika podobnym do aplikacji.\n\n- SquirrelMail — Poczta internetowa dla świrów (Webmail for Nuts)!\n\n"
    },
    {
      "title": "Powiadamiacze pocztowe",
      "level": 3,
      "content": "- Ayatana Webmail — Powiadomienia i akcje poczty internetowej dla dowolnego pulpitu.\n\n- Bubblemail — Usługa powiadamiania o nowej i nieprzeczytanej poczcie dla lokalnych skrzynek pocztowych, kont pop, imap i gnome online. Rozwinięcie Mailnag.\n\n- Gnubiff — Program do powiadamiania o nowej poczcie..\n\n- Mailnag — Rozszerzalny demon powiadomień pocztowych.\n\n"
    },
    {
      "title": "Serwery pocztowe",
      "level": 3,
      "content": "Zobacz Mail server.\n\n- DavMail — Brama wymiany POP/IMAP/SMTP/Caldav/Carddav/LDAP umożliwiająca użytkownikom korzystanie z dowolnego klienta poczty/kalendarza z serwerem Exchange.\n\n- Modoboa — Modułowa platforma do hostingu i zarządzania pocztą, napisana w języku Python.\n\n"
    },
    {
      "title": "Agenci pobierania poczty",
      "level": 3,
      "content": "Zobacz także Wikipedia:pl:Mail Retrival Agent.\n\n- fdm — Program do odbierania i dostarczania poczty.\n\n- Fetchmail — Narzędzie do zdalnego pobierania poczty e-mail.\n\n- getmail — Program do pobierania poczty POP3/IMAP4 z niezawodnym dostarczaniem Maildir i poleceń.\n\n- hydroxide — Zewnętrzny, open-source'owy mostek ProtonMail CardDAV, IMAP i SMTP\n\n- imapsync — Narzędzie do synchronizacji, kopiowania lub migracji IMAP\n\n- isync — Synchronizator skrzynek pocztowych IMAP i MailDir\n\n- mpop — Mały, szybki klient POP3 nadający się jako zamiennik fetchmaila\n\n- vomit — Rust utility to sync between Maildir mailbox and IMAP mailbox\n\n- OfflineIMAP — Synchronizuje wiadomości e-mail między dwoma repozytoriami.\n\n"
    },
    {
      "title": "Klienty komunikatorów internetowych",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of instant messaging clients oraz Wikipedia:Comparison of VoIP software.\n\nTa sekcja zawiera listę wszystkich programów klienckich z obsługą natychmiastowych wiadomości.\n\n"
    },
    {
      "title": "Klienty korzystające z wielu protokołów",
      "level": 4,
      "content": "Liczba sieci obsługiwanych przez te klienty jest bardzo duża, ale (jak każdy klient wieloprotokołowy) zazwyczaj mają one bardzo ograniczoną obsługę funkcji specyficznych dla sieci lub nie mają jej wcale.\n\n- BitlBee — Brama IRC do popularnych sieci czatu (XMPP i ICQ).\n\n- EKG2 — Klient XMPP, Gadu-Gadu, ICQ i IRC oparty na Ncurses.\n\n- Finch — Klient czatu oparty na Ncurses, korzystający z libpurple i obsługujący wszystkie jego protokoły (Bonjour, Gadu-Gadu, Groupwise, ICQ, IRC, SIMPLE, XMPP, Zephyr).\n\n- WeeChat — Modułowy, lekki klient IRC oparty na ncurses. Wiele innych protokołów jest obsługiwanych przez wtyczki.\n\n- Jitsi — Telefon audio/wideo VoIP i komunikator internetowy napisany w Javie, obsługujący protokoły takie jak SIP, XMPP, ICQ, IRC i wiele innych przydatnych funkcji.\n\n- Lith — Klient WeeChat Relay, umożliwiający łączenie się z działającą instancją WeeChat z dowolnego miejsca.\n\n- Pidgin — Wieloprotokołowy komunikator internetowy z obsługą audio, który wykorzystuje libpurple i obsługuje wszystkie jego protokoły (Bonjour, Gadu-Gadu, Groupwise, ICQ, IRC, SIMPLE, XMPP, Zephyr).\n\n- Smuxi — Wieloplatformowy klient IRC, który obsługuje również XMPP.\n\n- Thunderbird — Bogaty w funkcje klient poczty e-mail od Mozilli napisany w GTK.\n\n"
    },
    {
      "title": "Klienty IRC",
      "level": 4,
      "content": "Zobacz także Wikipedia:Comparison of Internet Relay Chat clients.\n\n- BitchX — Konsolowy klient IRC opracowany na podstawie popularnego ircII.\n\n- catgirl — Terminalowy klient IRC obsługujący tylko protokół TLS.\n\n- ERC — Potężny, modułowy i rozszerzalny klient IRC dla Emacs.\n\n- ii — Lekki jak piórko klient IRC, dosłownie odczytaj konwersację: tail -f i zapisz z powrotem twoje odpowiedzi do pliku: echo.\n\n- ircii — Najstarszy utrzymywany klient IRC, który twierdzi, że jest mały i szybki dzięki ograniczonemu zestawowi funkcji.\n\n- Irssi — Wysoce konfigurowalny klient IRC oparty na ncurses.\n\n- pork — Programowalny, oparty na ncurses klient IRC, który w większości wygląda i działa jak ircII.\n\n- ScrollZ — Zaawansowany klient IRC oparty na ircII.\n\n- senpai — An IRC client that works best with bouncers (e.g. soju-gitAUR): no logs are kept, history is fetched from the server via CHATHISTORY, networks are fetched from the server via bouncer-networks.\n\n- sic — Niezwykle prosty klient IRC, podobny do ii.\n\n- tiny — klient IRC napisany w języku Rust z przejrzystym interfejsem\n\n- ChatZilla — Czysty, łatwy w użyciu i wysoce rozszerzalny klient Internet Relay Chat (IRC), zbudowany na platformie Mozilla przy użyciu XULRunner. Wchodzi w skład pakietu SeaMonkey.\n\n- Halloy — Klient IRC o otwartym kodzie źródłowym napisany w języku Rust, z biblioteką GUI iced.\n\n- HexChat — Fork XChat dla systemów Linux i Windows.\n\n- Konversation — Oparty na Qt klient IRC dla pulpitu KDE. Część kde-network.\n\n- KVIrc — Oparty na Qt klient IRC z rozbudowaną obsługą motywów.\n\n- Loqui — Klient IRC GTK.\n\n- LostIRC — Prosty klient IRC GTK z automatycznym uzupełnianiem zakładek, obsługą wielu serwerów, logowaniem i innymi funkcjami.\n\n- Polari — Prosty klient IRC projektu GNOME. Część gnome-extra.\n\n- Quassel — Nowoczesny, wieloplatformowy, rozproszony klient IRC.\n\n- Srain — Nowoczesny, piękny klient IRC napisany w GTK 3.\n\n"
    },
    {
      "title": "Klienty XMPP",
      "level": 4,
      "content": "Zobacz także Wikipedia:XMPP.\n\n- Freetalk — Klient XMPP oparty na konsoli.\n\n- jabber.el — Minimalny klient XMPP dla Emacsa.\n\n- MCabber — Mały klient konsoli XMPP, zawiera funkcje: SSL, PGP, MUC, OTR i UTF8.\n\n- Poezio — Klient XMPP z obsługą IRC\n\n- Profanity — Konsolowy klient XMPP zainspirowany przez Irssi.\n\n- Converse.js — Internetowy klient czatu XMPP napisany w JavaScript.\n\n- Dino — Nowoczesny, łatwy w użyciu klient XMPP z obsługą PGP i OMEMO.\n\n- Gajim — Klient XMPP z obsługą audio napisany w Pythonie przy użyciu GTK.\n\n- Kaidan — Prosty, przyjazny dla użytkownika klient Jabber/XMPP zapewniający nowoczesny interfejs użytkownika wykorzystujący Kirigami i QtQuick.\n\n- Libervia (Salut à Toi) — Frontend webowy dla Salut à Toi, wielofunkcyjnego klienta XMPP\n\n- Nextcloud JavaScript XMPP Client — Aplikacja czatu dla Nextcloud z XMPP, szyfrowaniem end-to-end, połączeniami wideo, transferem plików i czatem grupowym.\n\n- Psi — Klient XMPP oparty na Qt.\n\n- Spark — Wieloplatformowy klient do współpracy XMPP w czasie rzeczywistym, zoptymalizowany pod kątem biznesu i organizacji.\n\n- Swift — Klient XMPP napisany w C++ z Qt i Swiften.\n\n- Tkabber — Łatwy do zhakowania, bogaty w funkcje klient XMPP autorstwa autora serwera XMPP ejabberd.\n\n- Vacuum IM — W pełni funkcjonalny, wieloplatformowy klient XMPP.\n\n"
    },
    {
      "title": "Klienty SIP",
      "level": 4,
      "content": "Zobacz także Wikipedia:List of SIP software#Clients.\n\n- Blink — Najnowocześniejszy, łatwy w użyciu klient SIP.\n\n- baresip — przenośny i modułowy agent użytkownika SIP z obsługą audio i wideo\n\n- Jami — Kompatybilny z protokołem SIP telefon programowy i komunikator internetowy dla zdecentralizowanej sieci Jami. Wcześniej znany jako Ring i SFLphone.\n\n- Linphone — Aplikacja telefoniczna VoIP (klient SIP) do swobodnego komunikowania się z ludźmi przez Internet za pomocą głosu, wideo i tekstowych wiadomości błyskawicznych.\n\n- Twinkle — Telefon programowy Qt do komunikacji VoIP i IM przy użyciu protokołu SIP.\n\n- Zoiper — Zastrzeżony telefon programowy VoIP SIP i IAX2\n\n"
    },
    {
      "title": "Klienty Matrix",
      "level": 4,
      "content": "Zobacz także Matrix i Matrix Clients.\n\n- Cinny — Cinny to klient matrix skupiający się przede wszystkim na prostym, eleganckim i bezpiecznym interfejsie. Aplikacja desktopowa została stworzona przy użyciu Tauri.\n\n- Element — Błyszczący klient Matrix z naciskiem na wydajność i użyteczność. Aplikacja webowa i desktopowa oparta na platformie Electron.\n\n- FluffyChat — Wieloplatformowy klient Matrix z prostym i przejrzystym interfejsem użytkownika napisanym w Dart/Flutter.\n\n- Fractal — Klient Matrix dla środowiska GNOME napisany w języku Rust.\n\n- Gomuks — Klient Terminal Matrix napisany w Go przy użyciu mautrix i mauview.\n\n- Moment — Fantazyjny, konfigurowalny, obsługiwany za pomocą klawiatury klient czatu Matrix do szyfrowanej i zdecentralizowanej komunikacji. Napisany w Qt/QML + Python z nio, fork porzuconego Mirage.\n\n- Neochat — Klient KDE dla protokołu Matrix.\n\n- nheko — Klient stacjonarny dla protokołu Matrix.\n\n- Quaternion — Oparty na Qt5 klient IM dla protokołu Matrix.\n\n- QuickMedia — Inspirowany rofi natywny klient usług sieciowych. Obsługuje Matrix i kilka innych witryn.\n\n- SchildiChat — Klient Matrix oparty na Element z bardziej tradycyjną obsługą wiadomości błyskawicznych. Oparty na platformie Electron.\n\n- Spectral — Oparty na Qt5 wieloplatformowy klient Glossy dla Matrix.\n\n- Syphon — Zorientowany na prywatność, wieloplatformowy klient Matrix z obsługą E2EE, obecnie w wersji alfa.\n\n"
    },
    {
      "title": "Klienty Tox",
      "level": 4,
      "content": "Zobacz także Tox i porównanie klientów\n\n- ratox — Klient tox oparty na FIFO.\n\n- Toxic — klient Tox oparty na ncurses\n\n- Toxygen — Klient Tox napisany w czystym Pythonie3.\n\n- Venom — nowoczesny klient Tox dla pulpitu GNU/Linux\n\n- µTox — Lekki klient Tox.\n\n"
    },
    {
      "title": "Komunikatory LAN",
      "level": 4,
      "content": "Zobacz także Avahi#Link-Local (Bonjour/Zeroconf) chat i Wikipedia:Comparison of LAN messengers.\n\n- BeeBEEP — Bezpieczny komunikator sieci LAN.\n\n- iptux — Oprogramowanie do komunikacji LAN, kompatybilne z IP Messenger.\n\n"
    },
    {
      "title": "Klienty P2P do przesyłania wiadomości",
      "level": 4,
      "content": "Zobacz także Ring i Tox.\n\n- Briar — Briar to aplikacja do przesyłania wiadomości przeznaczona dla aktywistów, dziennikarzy i wszystkich innych osób, które potrzebują bezpiecznego, łatwego i niezawodnego sposobu komunikacji.\n\n- Patchwork — Zdecentralizowana aplikacja do przesyłania i udostępniania wiadomości zbudowana na bazie Secure Scuttlebutt (SSB). Oparta na platformie Electron.\n\n- RetroShare — Bezserwerowy szyfrowany komunikator internetowy z funkcją udostępniania plików, grupami czatów i pocztą.\n\n- Ricochet — Anonimowy komunikator internetowy peer-to-peer oparty na ukrytych usługach Tor.\n\n"
    },
    {
      "title": "Inne klienty IM",
      "level": 4,
      "content": "- Caprine — Nieoficjalna aplikacja Facebook Messenger. Oparta na platformie Electron.\n\n- Chatterino — Klient czatu dla czatu Twitch.\n\n- Delta Chat — Zorientowana na prywatność aplikacja do czatowania oparta na poczcie e-mail. Oparta na platformie Electron.\n\n- Discord — Opatentowana aplikacja do czatu głosowego i tekstowego dla graczy, która jest bezpłatna i działa zarówno na komputerze stacjonarnym, jak i telefonie. Oparta na platformie Electron.\n\n- Flare — Nieoficjalny klient Signal oparty na GTK.\n\n- Gitter — Produkt komunikacyjny dla społeczności i zespołów na GitLab i GitHub.\n\n- Jitsi Meet — Aplikacja desktopowa dla Jitsi Meet. Oparta na platformie Electron.\n\n- Kotatogram Desktop — Eksperymentalny fork Telegram Desktop.\n\n- Matterhorn — Klient konsoli dla systemu czatu Mattermost.\n\n- Mattermost Desktop — Aplikacja desktopowa dla Mattermost. Oparta na platformie Electron.\n\n- Microsoft Teams — Oficjalny, zastrzeżony klient dla Microsoft Teams. Oparty na platformie Electron.\n\n- Mumble — Aplikacja do rozmów głosowych podobna do TeamSpeak.\n\n- Paper Plane — Czatuj przez Telegram na nowoczesnym i eleganckim kliencie.\n\n- QQ — Własne oprogramowanie do obsługi wiadomości błyskawicznych opracowane przez firmę Tencent (imitujące ICQ).\n\n- Rocket.Chat Desktop — Aplikacja desktopowa dla Rocket.Chat. Oparta na platformie Electron.\n\n- Ruqola — Klient Rocket.Chat dla pulpitu KDE.\n\n- Session Desktop — Komunikator oparty na routingu cebulowym. Oparty na platformie Electron.\n\n- Signal Desktop — Aplikacja desktopowa dla prywatnego komunikatora Signal. Oparta na platformie Electron.\n\n- Skype — Popularna, ale zastrzeżona aplikacja do komunikacji głosowej i wideo. Oparta na platformie Electron.\n\n- Slack — Własny klient Slack dla komputerów stacjonarnych. Oparty na platformie Electron.\n\n- teams-for-linux — Nieoficjalny klient Microsoft Teams dla systemu Linux. Oparty na platformie Electron.\n\n- TeamSpeak — Autorska aplikacja VoIP, której grupą docelową są gracze.\n\n- TeamTalk — Własna aplikacja VoIP z czatem wideo, udostępnianiem plików i pulpitu. Udostępnianie pulpitu nie działa jednak w systemie Linux. Pakiet AUR jest tylko serwerem, ale klient jest tworzony w procesie make.\n\n- Telegram Desktop — Oficjalny klient Telegram na komputery.\n\n- Viber — Zastrzeżone wieloplatformowe oprogramowanie IM i VoIP.\n\n- Wire — Nowoczesny, prywatny komunikator. Oparty na platformie Electron.\n\n- Zoom — Własna aplikacja do wideokonferencji, spotkań online i wiadomości grupowych.\n\n- Zulip — Klient desktopowy dla czatu grupowego Zulip. Oparty na platformie Electron.\n\n"
    },
    {
      "title": "Serwery komunikatorów internetowych",
      "level": 3,
      "content": "Zobacz także Wikipedia:Comparison of instant messaging protocols.\n\n"
    },
    {
      "title": "Serwery IRC",
      "level": 4,
      "content": "- InspIRCd — Stabilny, nowoczesny i lekki demon IRC.\n\n- IRCD-Hybrid — Lekki, wysokowydajny demon czatu przekaźnika internetowego.\n\n- miniircd — Mały i wolny od konfiguracji serwer IRC, odpowiedni do użytku prywatnego.\n\n- ngIRCd — Darmowy, przenośny i lekki serwer Internet Relay Chat dla małych lub prywatnych sieci.\n\n- Ergo — Nowoczesny i prosty w konfiguracji serwer IRC napisany w języku Go. Łączy w sobie funkcje IRCd, frameworka usług i bouncera.\n\n- UnrealIRCd — Serwer IRC o otwartym kodzie źródłowym.\n\n"
    },
    {
      "title": "Serwery XMPP",
      "level": 4,
      "content": "- Prosody — Serwer XMPP napisany w języku programowania Lua. Prosody został zaprojektowany jako lekki i wysoce rozszerzalny. Jest licencjonowany na podstawie liberalnej licencji Licencja MIT.\n\n- Ejabberd — Solidny, skalowalny i rozszerzalny serwer XMPP napisany w języku Erlang\n\n- Jabberd2 — Serwer XMPP napisany w języku C na licencji GNU General Public License. Został zainspirowany przez jabberd14.\n\n- Openfire — Wieloplatformowy serwer XMPP IM napisany w Javie\n\n"
    },
    {
      "title": "Serwery SIP",
      "level": 4,
      "content": "Zobacz także Wikipedia:List of SIP software#Servers.\n\n- Asterisk — Kompletne rozwiązanie PBX.\n\n- Kamailio — Solidny serwer SIP.\n\n- openSIPS — SIP proxy/serwer dla głosu, wideo, IM, obecności i innych rozszerzeń SIP.\n\n- Repro — Darmowy serwer SIP o otwartym kodzie źródłowym.\n\n- Yate — Zaawansowany, dojrzały, elastyczny serwer telefonii, który jest używany do VoIP i sieci stacjonarnych, a także dla tradycyjnych operatorów komórkowych i MVNO.\n\n"
    },
    {
      "title": "Inne serwery IM",
      "level": 4,
      "content": "- Mattermost — Serwer chmury prywatnej typu open source, alternatywa dla Slack.\n\n- Murmur — Serwer aplikacji czatu głosowego dla Mumble.\n\n- Nextcloud Talk — Aplikacja do wideokonferencji i audio dla Nextcloud.\n\n- Rocket.Chat — Serwer czatu internetowego, opracowany w JavaScript, przy użyciu frameworka Meteor fullstack.\n\n- Synapse — Referencyjny serwer domowy dla protokołu Matrix.\n\n- TeamSpeak Server — Zastrzeżony serwer konferencyjny VoIP.\n\n- uMurmur — Minimalistyczny serwer Mumble.\n\n"
    },
    {
      "title": "Oprogramowanie do współpracy",
      "level": 3,
      "content": "Zobacz także Wikipedia:pl:Oprogramowanie do pracy grupowej.\n\n- Citadel/UX — Obejmuje serwer poczty e-mail i list mailingowych, komunikatory internetowe, książki adresowe, kalendarz/planowanie, tablice ogłoszeń oraz silniki wiki i blogów.\n\n- SOGo — Serwer oprogramowania do pracy grupowej oparty na OpenGroupware.org (OGo) i serwerze aplikacji SOPE.\n\n"
    },
    {
      "title": "Serwery do skracania linków",
      "level": 3,
      "content": "- microbin — Niewielki, samodzielny, konfigurowalny wklejak i skracacz adresów URL napisany w języku Rust.\n\n- shlink — Samozwańczy, ostateczny, hostowany skracacz adresów URL.\n\n- YOURLS — Samoobsługowa usługa skracania linków napisana w PHP.\n\n"
    },
    {
      "title": "Agregatory wiadomości",
      "level": 3,
      "content": "Agregatory kanałów internetowych. Niektóre klienty Email mogą również działać jako agregatory wiadomości: Claws Mail Evolution, SeaMonkey Mail & Newsgroups, Thunderbird.\n\nZobacz także Wikipedia:Comparison of feed aggregators.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- Canto — Agregator RSS Ncurses.\n\n- Ditch The Bell — Wysoce konfigurowalny, oparty na systemie Linux powiadamiacz pulpitu dla kanałów RSS/Atom.\n\n- Gnus — Klient poczty e-mail, NNTP i RSS dla Emacsa.\n\n- feed2imap-go — feed2imap ponownie zaimplementowany w Go, który agreguje RSS/Atom/jsonfeed do folderów skrzynki pocztowej IMAP.\n\n- Newsboat — Agregator RSS Ncurses z układem i powiązaniami klawiszy podobnymi do klienta poczty e-mail Mutt.\n\n- Newsraft — Czytnik kanałów z interfejsem użytkownika ncurses. Jest mocno inspirowany Newsboat i stara się być jego lekkim odpowiednikiem.\n\n- Rawdog — \"RSS Aggregator Without Delusions Of Grandeur\", który przetwarza kanały RSS/CDF/Atom na statyczną stronę HTML z artykułami w porządku chronologicznym.\n\n- rss2email — Agregacja kanałów RSS/Atom do skrzynki pocztowej IMAP/Maildir jako zadanie cronjob.\n\n- sfeed — Zorientowany na Crontab, skryptowanlny agregator kanałów z narzędziem parsera RSS/Atom oraz prostym czytnikiem ncurses.\n\n- Snownews — Czytnik wiadomości RSS w trybie tekstowym.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- Akregator — Agregator wiadomości dla KDE, część kde-pim.\n\n- Alligator — Oparty na Kirigami czytnik kanałów RSS/Atom dla urządzeń mobilnych. Część kde-network.\n\n- Feeds — Czytnik kanałów RSS/Atom dla środowiska GNOME.\n\n- Fluent Reader — Nowoczesny desktopowy czytnik RSS zbudowany przy użyciu React i Fluent UI. Oparty na platformie Electron.\n\n- HackUp — Czytaj Hacker News z pulpitu.\n\n- Liferea — Agregator wiadomości GTK dla internetowych kanałów informacyjnych i blogów.\n\n- Newsflash — Nowoczesny czytnik kanałów zaprojektowany dla środowiska GNOME. Duchowy następca FeedReader.\n\n- Nextcloud News — Czytnik kanałów RSS/Atom dla Nextcloud.\n\n- Raven — Prosty desktopowy czytnik RSS stworzony przy użyciu VueJS. Oparty na platformie Electron.\n\n- RSS Guard — Bardzo mały czytnik wiadomości RSS i ATOM opracowany przy użyciu frameworka Qt.\n\n- selfoss — Nowy wielofunkcyjny czytnik RSS, transmisja na żywo, mashup, agregacja aplikacji internetowych.\n\n- Tickr — Czytnik RSS oparty na GTK, który wyświetla kanały jako płynnie przewijaną linię na pulpicie, znaną ze stacji telewizyjnych.\n\n- Tiny Tiny RSS — Internetowy agregator kanałów informacyjnych (RSS/Atom).\n\n"
    },
    {
      "title": "Klienty do podcastów",
      "level": 3,
      "content": "Niektóre odtwarzacze multimedialne mogą również działać jako klient podcastów: Amarok, Cantata, Clementine, Goggles Music Manager, Rhythmbox, VLC media player. git-annex może również funkcjonować jako podcatcher..\n\nZobacz także Wikipedia:List of podcatchers.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- castero — Klient podcastu TUI dla terminala.\n\n- castget — Prosty program do pobierania załączników RSS z wiersza poleceń, przeznaczony głównie do automatycznego, nienadzorowanego pobierania podcastów.\n\n- gpo — Interfejs trybu tekstowego gPodder.\n\n- Greg — Agregator podcastów działający w wierszu poleceń.\n\n- pcd — Minimalny klient podcastów napisany w Go\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- CPod — Prosta, piękna aplikacja do podcastów. Oparta na platformie Electron.\n\n- GNOME Podcasts — Klient podcastów dla środowiska GNOME Desktop napisany w języku Rust.\n\n- gPodder — Klient podcastów i agregator mediów (interfejs GTK).\n\n- Vocal — Prosty klient podcastów dla Modern Desktop (GTK).\n\n- Kasts — Konwergentna aplikacja do podcastów, która wygląda dobrze na komputerach stacjonarnych i urządzeniach mobilnych. Część kde-multimedia.\n\n- Pocket Casts — Opakowanie Electron wokół aplikacji internetowej Pocket Casts z obsługą MPRIS (sterowanie multimediami).\n\n"
    },
    {
      "title": "Czytniki wiadomości Usenet",
      "level": 3,
      "content": "Niektóre klienty Email są również w stanie działać jako czytnik wiadomości Usenet: Claws Mail, Evolution, NeoMutt, SeaMonkey Mail & Newsgroups, Sylpheed, Thunderbird.\n\nZobacz także: Wikipedia:List of Usenet newsreaders, Wikipedia:Comparison of Usenet newsreaders.\n\n"
    },
    {
      "title": "Konsolowe",
      "level": 4,
      "content": "- nn — Alternatywny, bardziej przyjazny dla użytkownika (oparty na curses) czytnik wiadomości Usenet dla systemu UNIX.\n\n- slrn — Tekstowy klient wiadomości.\n\n- tin — Wieloplatformowy czytnik wiadomości UseNet oparty na protokole NNTP i buforze.\n\n- trn — Tekstowy czytnik wiadomości Usenet z wątkami.\n\n"
    },
    {
      "title": "Graficzne",
      "level": 4,
      "content": "- NZBGet — Program do pobierania plików binarnych Usenet .nzb z interfejsem WWW i CLI.\n\n- Pan — Czytnik wiadomości Usenet GTK, który dobrze radzi sobie zarówno z tekstem, jak i plikami binarnymi.\n\n- SABnzbd — Napisana w Pythonie aplikacja webowa binarnego czytnika wiadomości o otwartym kodzie źródłowym.\n\n- XRN — Czytnik wiadomości Usenet dla X Window System.\n\n"
    },
    {
      "title": "Klienty mikroblogów",
      "level": 3,
      "content": "- Choqok — Klient mikroblogowania dla KDE, który obsługuje Mastodon, Pump.io i GNU social.\n\n- Dianara — Klient Pump.io napisany w Qt.\n\n- Lemmy-UI — Oficjalna aplikacja internetowa dla lemmy.\n\n- Lemoa — Natywny klient Gtk dla Lemmy.\n\n- Mikutter — Prosty, potężny klient Mastodon wykorzystujący GTK i Ruby.\n\n- Pumpa — Klient Pump.io napisany w C++ i Qt.\n\n- Tokodon — Klient Mastodon dla środowiska KDE. Część kde-network.\n\n- toot — Narzędzie CLI i TUI do interakcji z instancjami Mastodon.\n\n- tuba — Klient GTK4 dla Mastodona.\n\n- Whalebird — Aplikacja kliencka Mastodon. Oparta na platformie Electron.\n\n"
    },
    {
      "title": "Silniki blogów",
      "level": 3,
      "content": "Zobacz także Wikipedia:Blog software and Wikipedia:List of content management systems.\n\n- Diaspora — Rozproszona sieć społecznościowa świadoma prywatności.\n\n- Drupal — Oparta na PHP platforma zarządzania treścią.\n\n- Joomla — System zarządzania treścią php (CMS), który umożliwia tworzenie stron internetowych i rozbudowanych aplikacji online.\n\n- Wordpress — Narzędzie blogowe i platforma publikacyjna.\n\n"
    },
    {
      "title": "Generatory stron statycznych",
      "level": 3,
      "content": "- Hexo — Szybki, prosty i potężny framework blogowy.\n\n- Hugo — Hugo to generator statycznych stron HTML i CSS napisany w języku Go. Jest zoptymalizowany pod kątem szybkości, łatwości użytkowania i konfigurowalności.\n\n- Jekyll — Statyczny silnik blogowy napisany w Rubim, obsługujący Markdown, tekstylia i inne formaty.\n\n- Nikola — Statyczny generator stron napisany w Pythonie, z przyrostowymi przebudowami i wieloma formatami znaczników.\n\n- Pelican — Generator statycznych stron internetowych oparty na Pythonie.\n\n- Zola — Opiniowany generator stron statycznych napisany w języku Rust.\n\n"
    },
    {
      "title": "Oprogramowanie galerii",
      "level": 3,
      "content": "- fgallery — Generator statycznych galerii zdjęć bez zbędnych dodatków oraz o stylowym, minimalistycznym wyglądzie.\n\n- jAlbum — Bezpłatne, wieloplatformowe oprogramowanie do zarządzania i tworzenia cyfrowych albumów lub galerii zdjęć.\n\n- jolly — Narzędzie do statycznego generowania galerii z obrazów.\n\n- llgal — Łatwy i szybki generator galerii online oparty na iGal.\n\n- thumbsup — Statyczna galeria internetowa dla wszystkich zdjęć i filmów.\n\n- Photoview — Galeria zdjęć dla samodzielnie hostowanych serwerów osobistych.\n\n- Piwigo — Aplikacja internetowa do zarządzania kolekcją zdjęć i innych multimediów.\n\n- revela — Generator statycznej galerii obrazów...\n\n- Sigal — Prosty generator galerii statycznych.\n\n- ZenphotoCMS — CMS dla samodzielnie hostowanych stron internetowych z galeriami.\n\n"
    },
    {
      "title": "Pulpit zdalny",
      "level": 2,
      "content": "Zobacz także Wikipedia:Remote desktop software oraz Wikipedia:Comparison of remote desktop software.\n\nZobacz także Chrome Remote Desktop dla rozwiązania opartego na przeglądarce internetowej.\n\n"
    },
    {
      "title": "Klienty pulpitu zdalnego",
      "level": 3,
      "content": "- AnyDesk — Zastrzeżone oprogramowanie do zdalnego pulpitu.\n\n- GNOME Connections — Klient zdalnego pulpitu dla środowiska GNOME. Obsługuje protokoły RDP i VNC. Część gnome.\n\n- GVncViewer — Prosty klient VNC na Gtk-VNC. Uruchamiany za pomocą gvncviewer.\n\n- KRDC — Klient pulpitu zdalnego dla KDE. Obsługuje RDP i VNC. Część kde-network.\n\n- Remmina — Klient zdalnego pulpitu napisany w GTK. Obsługuje protokoły RDP, VNC, NX, XDMCP i SSH.\n\n- Remote Viewer — Prosty klient zdalnego wyświetlania. Obsługuje SPICE i VNC.\n\n- RustDesk — Oprogramowanie do zdalnego pulpitu, open source, napisane w języku Rust.\n\n- Sunlogin Remote Control — Autorskie oprogramowanie obsługujące zdalne sterowanie urządzeniami mobilnymi, systemami Windows, Mac, Linux i innymi. Wykorzystuje własny, zastrzeżony protokół.\n\n- ToDesk — Własny klient zdalnego pulpitu, który nadaje się do zdalnej pracy zespołowej. Korzysta z własnego protokołu.\n\n- TeamViewer — Zastrzeżony klient pulpitu zdalnego. Używa własnego, zastrzeżonego protokołu.\n\n- vncviewer (TigerVNC) — Przeglądarka VNC dla X.\n\n- Vinagre — Przeglądarka pulpitu zdalnego dla środowiska GNOME. Obsługuje protokoły RDP, VNC, SPICE i SSH.\n\n- xfreerdp — Klient FreeRDP X11. Uruchamiany z xfreerdp.\n\n- X2Go Client — Graficzny klient (Qt5) dla systemu X2Go, który wykorzystuje protokół NX technology.\n\n"
    },
    {
      "title": "Serwery pulpitu zdalnego",
      "level": 3,
      "content": "- freerdp-shadow-cli — Narzędzie do udostępniania ekranu X za pośrednictwem protokołu RDP.\n\n- kmsvnc — Serwer VNC dla urządzeń GNU/Linux obsługujących DRM/KMS.\n\n- Krfb — Serwer VNC dla KDE. Część kde-network.\n\n- NoMachine — Autorski serwer i klient zdalnego pulpitu oparty na Technologia NX.\n\n- wayvnc — Serwer VNC dla kompozytorów wayland opartych na wlroots (takich jak sway).\n\n- x0vncserver (TigerVNC) — Serwer VNC dla wyświetlaczy X.\n\n- x11vnc — Serwer VNC dla rzeczywistych wyświetlaczy X.\n\n- X2Go Server — Oprogramowanie open source do zdalnego pulpitu, które wykorzystuje protokół NX technology.\n\n- Xpra — Wieloplatformowy system przekierowywania ekranów i aplikacji.\n\n- Xrdp — Demon obsługujący protokół RDP. Używa Xvnc, X11rdp lub xorgxrdp jako backendu.\n\n"
    }
  ]
}