{
  "title": "LMMS (Русский)",
  "url": "https://wiki.archlinux.org/title/LMMS_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "LMMS — это свободная кроссплатформенная программа, позволяющая писать музыку на компьютере. Это касается создания мелодий и ритмов, синтеза и микширования звуков и аранжировки сэмплов. Вы можете весело провести время с помощью своей MIDI-клавиатуры и многого другого — и всё это в удобном и современном интерфейсе. Кроме того, LMMS поставляется со многими готовыми к использованию плагинами инструментов и эффектов, предустановками и сэмплами.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет lmms. Также доступны разрабатываемая версия lmms-gitAUR и скомпилированная бета-версия lmms-beta-binAUR[ссылка недействительна: package not found]. Информацию о релизах можно почитать здесь: [1].\n\nЕсли вы хотите использовать несколько аудиоприложений одновременно, но ваше оборудование не поддерживает это, то вам потребуется либо использовать звуковой сервер пользовательского режима, либо настроить ALSA dmix.\n\n"
    },
    {
      "title": "MIDI и soundfont-банки",
      "level": 2,
      "content": "В зависимости от ваших настроек и способа установки может понадобиться ручная настройка soundfont-банка и Timidity.\n\nЗатем вам нужно отредактировать файл настроек FluidSynth: /etc/conf.d/fluidsynth. В качестве аудиодрайвера выберите звуковой сервер, который вы установили.\n\nЗапустите пользовательскую службу fluidsynth.service.\n\nКогда LMMS запустится, он предложит вам ввести настройки. Перейдите в настройки звука, выберите тот же интерфейс, который вы установили для FluidSynth, и перезапустите LMMS.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "У некоторых пользователей есть проблемы с работой drag-and-drop на Wayland. Для решения можно попробовать установить переменную окружения QT_QPA_PLATFORM=xcb, чтобы LMMS работал через Xwayland.\n\n"
    }
  ]
}