{
  "title": "Locale (Português)",
  "url": "https://wiki.archlinux.org/title/Locale_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Variáveis de ambiente\n- Localização\n\nLocales, por vezes chamados em português de localidades, são usados pelo glibc e outros programas ou bibliotecas conscientes de locales para renderizar texto, exibindo corretamente valores monetários regionais, formatos de hora e data, idiossincrasias alfabéticas e outros padrões específicas para locales.\n\n"
    },
    {
      "title": "Gerando locales",
      "level": 2,
      "content": "Nomes de locales geralmente possuem a forma idioma[território][.código][@modificador], sendo idioma um código de idiomas da ISO 639, território um código de países da ISO 3166 e .código uma codificação de caracteres ou identificador de codificação como ISO-8859-1 ou UTF-8. Veja setlocale(3).\n\nPara uma lista de locales habilitados, execute:\n\n```\n$ locale -a\n```\n\nAntes que um locale possa ser habilitado no sistema, ele deve ser gerado. Isso pode ser alcançado descomentando as entradas corretas em /etc/locale.gen e executando locale-gen. Da mesma forma, comentar entradas desabilita seus respectivos locales. Ao fazer alterações, considere quaisquer localizações necessárias para outros usuários no sistema, bem como #Variáveis específicas.\n\nPor exemplo, descomente pt_BR.UTF-8 UTF-8 para português brasileiro:\n\n```\n/etc/locale.gen\n```\n\n```\n...\n#ps_AF UTF-8  \npt_BR.UTF-8 UTF-8  \n#pt_BR ISO-8859-1\n...\n```\n\nSalve o arquivo e gere o locale:\n\n```\n# locale-gen\n```\n\n- locale-gen também é executado em toda atualização de glibc. [1]\n- UTF-8 é recomendado sobre outras codificações de caracteres. [2]\n\n"
    },
    {
      "title": "Configurando o locale",
      "level": 2,
      "content": "Para exibir o locale atualmente configurado e suas configurações ambientais relacionadas, digite:\n\n```\n$ locale\n```\n\nO locale a ser usado, escolhido dentre os previamente gerados, é configurado em arquivos locale.conf. Cada um desses arquivos deve conter uma lista, separada por nova linha, de atribuições de variáveis de ambiente, tendo o mesmo formato que a saída de locale.\n\nPara listar os locales disponíveis que foram gerados previamente, execute:\n\n```\n$ localedef --list-archive\n```\n\nAlternativamente, use localectl(1):\n\n```\n$ localectl list-locales\n```\n\n"
    },
    {
      "title": "Configurando o locale do sistema",
      "level": 3,
      "content": "Para configurar o locale do sistema, escreva variável LANG no /etc/locale.conf, sendo que pt_BR.UTF-8 pertence à primeira coluna de uma entrada não comentada em /etc/locale.gen:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=pt_BR.UTF-8\n```\n\nAlternativamente, execute:\n\n```\n# localectl set-locale LANG=pt_BR.UTF-8\n```\n\nVeja #Variáveis e locale.conf(5) para detalhes.\n\n"
    },
    {
      "title": "Sobrepondo locale do sistema por sessão de usuário",
      "level": 3,
      "content": "O locale para todo sistema pode ser sobrescrito em cada sessão de usuário criando ou editando $XDG_CONFIG_HOME/locale.conf (normalmente ~/.config/locale.conf).\n\nA precedência desses arquivos locale.conf é configurada em /etc/profile.d/locale.sh.\n\n- Isso também pode permitir manter os logs em /var/log/ em inglês enquanto usa o idioma local na variável do usuário.\n- Você pode criar um arquivo /etc/skel/.config/locale.conf para que qualquer novos usuários adicionados usando useradd e a opção -m vai ter ~/.config/locale.conf gerado automaticamente.\n\n"
    },
    {
      "title": "Fazer alterações de locale imediatas",
      "level": 3,
      "content": "Uma vez que os arquivos locale.conf de sistema e de usuários terem sido criados ou editados, seus novos valores terão efeito para novas sessões na autenticação. Para fazer o ambiente atual usar as novas configurações, desconfigure LANG e carregue /etc/profile.d/locale.sh:\n\n```\n$ unset LANG\n$ source /etc/profile.d/locale.sh\n```\n\n"
    },
    {
      "title": "Outros usos",
      "level": 3,
      "content": "As variáveis de locale também podem ser definidas com os métodos padrão como explicado em Variáveis de ambiente.\n\nPor exemplo, para testar ou depurar um aplicativo em particular durante o desenvolvimento, ele poderia ser iniciado com alguma coisa como:\n\n```\n$ LANG=C ./meu_aplicativo.sh\n```\n\nDa mesma forma, para definir o locale para todos os processo executados pela shell atual (por exemplo, durante a instalação do sistema):\n\n```\n$ export LANG=C\n```\n\n"
    },
    {
      "title": "Variáveis",
      "level": 2,
      "content": "Os arquivos locale.conf oferecem suporte às seguintes variáveis de ambiente.\n\n- LANG\n- LANGUAGE\n- LC_ADDRESS\n- LC_COLLATE\n- LC_CTYPE\n- LC_IDENTIFICATION\n- LC_MEASUREMENT\n- LC_MESSAGES\n- LC_MONETARY\n- LC_NAME\n- LC_NUMERIC\n- LC_PAPER\n- LC_TELEPHONE\n- LC_TIME\n\nO significado completo das variáveis LC_* acima pode ser localizado na página man locale(7), enquanto os detalhes de suas definições estão descritas em locale(5).\n\n"
    },
    {
      "title": "LANG: locale padrão",
      "level": 3,
      "content": "O locale configurado para essa variável será usado para todas as variáveis LC_* que não forem configuradas explicitamente.\n\n"
    },
    {
      "title": "LANGUAGE: locales reservas",
      "level": 3,
      "content": "Os programas que usam gettext para traduções respeitam a opção LANGUAGE além das variáveis usuais. Isso permite que usuários para especificar uma lista de locales que serão usados naquela ordem. Se uma tradução para o locale preferido não está disponível, outro de um locale similar será usado em vez do padrão. Por exemplo, um usuário australiano pode querer usar a ortografia britânica em vez da americana:\n\n```\nlocale.conf\n```\n\n```\nLANG=en_AU.UTF-8\nLANGUAGE=en_AU:en_GB:en\n```\n\n"
    },
    {
      "title": "LC_TIME: formato de data e hora",
      "level": 3,
      "content": "Se LC_TIME estiver configurado para en_US.UTF-8, por exemplo, o formato de data será \"MM/DD/AAAA\". Caso prefira usar o formato de data da ISO 8601 de \"AAAA-MM-DD\", use:\n\n```\nlocale.conf\n```\n\n```\nLC_TIME=en_DK.UTF-8\n```\n\nVocê pode imprimir o carimbo de data/hora (em ingês, timestamp) atual usando o formato de data e hora de seu locale com date +\"%c\".\n\nglibc 2.29 corrigiu um erro, en_US.UTF-8 começou a mostrar no formato de 12 horas, como era a intenção. Se você quiser usar o formato de 24 horas, use LC_TIME=C.UTF-8.\n\n"
    },
    {
      "title": "LC_COLLATE: colação",
      "level": 3,
      "content": "Essa variável governa as regras de colação usadas para ordenação e expressões regulares.\n\nConfigurar o valor para C pode, por exemplo, fazer o comando ls ordenar arquivos iniciados com ponto primeiro, seguidos por nomes de arquivos em maiúsculo e minúsculo:\n\n```\nlocale.conf\n```\n\n```\nLC_COLLATE=C\n```\n\nVeja também [4].\n\nPara evitar problemas potenciais, o Arch costumava definir LC_COLLATE=C em /etc/profile, mas esse método está agora obsoleto.\n\n"
    },
    {
      "title": "LC_ALL: solução de problemas",
      "level": 3,
      "content": "O locale configurado para essa variável sempre sobrescreverá LANG e todas outras variáveis LC_*, independentemente de estarem definidas ou não. Se LC_ALL for definido para C, também vai sobrescrever LANGUAGE.\n\nLC_ALL é a única variável LC_* que não pode ser definida em arquivos locale.conf: ela é feita para ser usada apenas para propósito de testar ou solucionar problemas, por exemplo, em /etc/profile.\n\n"
    },
    {
      "title": "Solução de problemas",
      "level": 2,
      "content": "Para problemas de codificação, confira Character encoding#Troubleshooting.\n\n"
    },
    {
      "title": "Meu sistema ainda está usando o idioma errado",
      "level": 3,
      "content": "É possível que as variáveis de ambiente sejam redefinidas em outros arquivos além de locale.conf. Veja Variáveis de ambiente#Definindo variáveis para detalhes.\n\nSe você está usando um ambiente gráfico, como o GNOME, suas configurações de idioma podem estar sobrescrevendo as configurações em locale.conf.\n\nKDE Plasma também permite alterar o idioma da interface de usuário por meio de configurações do sistema. Se o ambiente gráfico ainda está usando o idioma padrão após a modificação, excluir o arquivo em ~/.config/plasma-localerc (anteriormente: ~/.config/plasma-locale-settings.sh) deve resolver o problema.\n\nSe você estiver usando um gerenciador de exibição em combinação com accountsservice, siga as instruções em Gerenciador de exibição#Definir o idioma para sessão de usuário.\n\nLightDM usará automaticamente accountsservice para definir o locale de um usuário se estiver instalado. Caso contrário, LightDM armazena a configuração da sessão do usuário em ~/.dmrc. É possível que uma configuração de locale indesejada também seja recuperada de lá.\n\n"
    },
    {
      "title": "Usar um locale personalizado causa problemas",
      "level": 3,
      "content": "Ao instalar um locale que não é oficialmente suportado (por exemplo, locale-en_xxAUR), alguns problemas podem ocorrer, como teclas compostas ou \"dead keys\" não funcionarem em alguns aplicativos ou aplicativos relatando locales ausentes. Depois de instalar um código de idioma personalizado, será necessária intervenção manual para resolver esses problemas. Existem duas abordagens (substitua en_XX.UTF-8 pelo identificador de seu locale personalizado):\n\n"
    },
    {
      "title": "Definir LC_CTYPE",
      "level": 4,
      "content": "Defina LC_CTYPE para um locale oficialmente suportado, como en_US.UTF-8:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_XX.UTF-8\nLC_CTYPE=en_US.UTF-8\n```\n\n"
    },
    {
      "title": "Modificar o banco de dados Xlib",
      "level": 4,
      "content": "Modifique o banco de dados Xlib adicionando o seguinte:\n\n```\n/usr/share/X11/locale/locale.dir\n```\n\n```\nen_US.UTF-8/XLC_LOCALE en_XX.UTF-8\nen_US.UTF-8/XLC_LOCALE: en_XX.UTF-8\n```\n\n```\n/usr/share/X11/locale/compose.dir\n```\n\n```\nen_US.UTF-8/Compose en_XX.UTF-8\nen_US.UTF-8/Compose: en_XX.UTF-8\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Locales - glibc wiki\n- Gentoo:Localization/Guide\n- Artigo wiki do Gentoo supostamente de 2008, ou anterior\n- Teste de colação interativa da ICU\n- Free Standards Group Open Internationalisation Initiative\n- Definição de Locale da The Single UNIX Specification por The Open Group\n- Variáveis de ambiente de local\n\n"
    }
  ]
}