{
  "title": "Localization/Simplified Chinese (简体中文)",
  "url": "https://wiki.archlinux.org/title/Localization/Simplified_Chinese_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Localization/Chinese\n- Localization (正體中文)/Traditional Chinese (正體中文)\n- Installation guide\n- General recommendations\n\nAccording to \"The Arch Way\": We cannot configure everything for you, because \"Preferences and needs are different for everyone\", but we will try to ensure the configuration to be convenient and simple. In fact, it is even easier than some Chinese versions of Linux.\n\nThis article provides Chinese cultural guidance for various common software as much as possible. But in practical applications, you may encounter all kinds of issues. Do not be discouraged when you are in trouble. Solving problems is a pleasure in itself. You can seek help through various platforms:\n\n- Google and other search engines\n- Arch official forum\n- Ubuntu Chinese Forum Unix-like OS area\n- IRC channel: #archlinux-cn\n\n"
    },
    {
      "title": "Basic Chinese support",
      "level": 2,
      "content": "To properly display Chinese, you must set the locale correctly and install the appropriate Chinese fonts.\n\n"
    },
    {
      "title": "Install Chinese locale",
      "level": 4,
      "content": "In Linux, locales are used to set up different environments for running programs. Commonly used Chinese locales are (the most intuitive is the number of words that can be displayed):\n\n```\nzh_CN.GB2312\nzh_CN.GBK\nzh_CN.GB18030\nzh_CN.UTF-8\nzh_TW.BIG-5\nzh_TW.UTF-8\n```\n\nIt is recommended to use UTF-8 locale. You need to modify /etc/locale.gen to set the locales that can be used in the system (erase the comment symbol \"#\" before the corresponding item):\n\n```\nen_US.UTF-8 UTF-8\nzh_CN.UTF-8 UTF-8\n```\n\nAfter executing locale-gen, the selected locales can be used in the system. You may use locale to view the currently used locale(s), and locale -a to view the currently available locales.\n\n"
    },
    {
      "title": "Enable Chinese locales",
      "level": 4,
      "content": "To avoid the tty garbled text issue mentioned above, globally set the LANG locale to en_US.UTF-8 in /etc/locale.conf:\n\n```\nLANG=en_US.UTF-8\n```\n\nYou may set your own user environment variables in ~/.bashrc, ~/.xinitrc, or ~/.xprofile.\n\n- .bashrc: Settings are applied everytime you log in using the terminal.\n- .xinitrc: Settings are applied everytime you use startx or SLiM to start the X interface.\n- .xprofile: Settings are applied everytime you log in using a display manager such as GDM.\n\nIt is not recommended to set a global Chinese locale in /etc/locale.conf because it causes tty to display garbled characters.\n\nAs mentioned earlier, Chinese locale can be set separately in ~/.xinitrc or ~/.xprofile. Prepend the following two lines to one of the two files (if you are not sure which file to use, prepend to both):\n\n```\nexport LANG=zh_CN.UTF-8\nexport LANGUAGE=zh_CN:en_US\n```\n\nNote: **before** \n\n- Be sure to put them before the exec _example_WM_or_DE_ line in ~/.xinitrc.\n- This method is suitable for SLiM users or for people who do not use a graphical login interface (aka greeter). GDM and SDDM users can configure the display language in GNOME or KDE settings.\n- It is not recommended to override all locale settings with a global export LC_ALL. LC_ALL should be reserved for diagnostic debugging purposes only. LC_ALL will bring unnecessary difficulties for diagnosing language settings issues.\n\n"
    },
    {
      "title": "Install fonts",
      "level": 4,
      "content": "In addition to locales, Chinese fonts are also required.\n\nCommonly used free (GPL or compatible copyright) Chinese fonts include:\n\n- adobe-source-han-sans-cn-fonts\n- adobe-source-han-serif-cn-fonts\n- noto-fonts-cjk\n- wqy-microhei\n- wqy-microhei-lite\n- wqy-bitmapfont\n- wqy-zenhei\n- ttf-arphic-ukai\n- ttf-arphic-uming\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nSystem fonts will be installed to /usr/share/fonts by default. If you do not have root authority or plan to use certain fonts yourself, you can directly copy these fonts to ~/.fonts (or its subdirectories) and add the path to /etc/fonts/local.conf. For details, go over the following chapters.\n\nSee also: [1]\n\n"
    },
    {
      "title": "Chinese fonts configuration",
      "level": 4,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nThe setting file of fontconfig is ~/.fonts.conf (user) or /etc/fonts/conf.d (global). It is recommended to modify the former.\n\nFor Chinese fonts settings, see Fonts (简体中文) and Font configuration (简体中文).\n\nFont Configuration (简体中文)/Chinese (简体中文) provides a demonstration of Chinese fontconfig.\n\nSee also:\n\n- fontconfig 用户手册[dead link 2022-09-21 ⓘ]\n- Debian 中文支持\n- Fontconfig wiki page\n\nAfter installing Noto Sans CJK adobe-source-han-sans-otc-fonts (Source Han Sans, lit. Siyuan Bold), or Noto Serif CJK adobe-source-han-serif-otc-fonts (Source Han Serif, lit. Siyuan Song), in some cases (framework undefined area), rendered Chinese characters do not match the standard form, such as 门, 关, and 复.\n\nThis is because different default fonts can be set in each program, such as Arial or Tahoma, and the attributes of these fonts are controlled by fontconfig. The order of use is based on the regional code and the default order of A-Z. Since ja-JP is before zh_{CN,HK,SG,TW}, Japanese fonts are used first.\n\nYou can use the following methods to solve the issue (taking simplified Chinese as an example):\n\n- Make sure your desktop environment is using a correct locale setting. For example, KDE may misconfigure its own locale config file and you should fix that.\n- Only install fonts that follows Simplified Chinese standard. For Noto CJK fonts this means to only install the CN variant, which are Noto Sans CJK CN and Noto Serif CJK CN, adobe-source-han-sans-cn-fonts and adobe-source-han-serif-cn-fonts, or noto-fonts-scAUR.\n- Add LANG=zh_CN.UTF-8 to locale.conf to set Simplified Chinese as the default language. Since the Locale is defined for CJK priority, the default priority is ignored.\n- Manually adjust the priority so that the Chinese fonts are set before the Japanese fonts. [2]:\n\nCreate a file under /etc/fonts/conf.d/ or /etc/fonts/conf.avail/, such as 64-language-selector-prefer.conf, or modify or create ~/.fonts.conf (only effective for the user):\n\nIf noto-fonts-cjk is installed, write:\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n  <alias>\n    <family>sans-serif</family>\n    <prefer>\n      <family>Noto Sans</family>\n      <family>Noto Sans CJK SC</family>\n      <family>Noto Sans CJK TC</family>\n      <family>Noto Sans CJK JP</family>\n    </prefer>\n  </alias>\n  <alias>\n    <family>serif</family>\n    <prefer>\n      <family>Noto Serif</family>\n      <family>Noto Serif CJK SC</family>\n      <family>Noto Serif CJK TC</family>\n      <family>Noto Serif CJK JP</family>\n    </prefer>\n  </alias>\n  <alias>\n    <family>monospace</family>\n    <prefer>\n      <family>Noto Sans Mono</family>\n      <family>Noto Sans Mono CJK SC</family>\n      <family>Noto Sans Mono CJK TC</family>\n      <family>Noto Sans Mono CJK JP</family>\n    </prefer>\n  </alias>\n</fontconfig>\n```\n\nIf you have installed adobe-source-han-sans-otc-fonts:\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n  <alias>\n    <family>sans-serif</family>\n    <prefer>\n      <family>Source Han Sans SC</family>\n      <family>Source Han Sans TC</family>\n      <family>Source Han Sans HW</family>\n      <family>Source Han Sans K</family>\n    </prefer>\n  </alias>\n  <alias>\n    <family>monospace</family>\n    <prefer>\n      <family>Source Han Sans SC</family>\n      <family>Source Han Sans TC</family>\n      <family>Source Han Sans HW</family>\n      <family>Source Han Sans K</family>\n    </prefer>\n  </alias>\n</fontconfig>\n```\n\nNote that if you create an xml file under /etc/fonts/conf.avail, for example:\n\n```\n# ln -s /etc/fonts/conf.avail/64-language-selector-prefer.conf /etc/fonts/conf.d/64-language-selector-prefer.conf\n```\n\nyou have to update the font cache to take effect:\n\n```\n# fc-cache -fv\n```\n\nExecute the following command to check. If NotoSansCJK-Regular.ttc: \"Noto Sans CJK SC\" \"Regular\" appears, the settings are successfully applied:\n\n```\n# fc-match -s | grep 'Noto Sans CJK'\n```\n\n"
    },
    {
      "title": "Chinese input method",
      "level": 3,
      "content": "Commonly used Chinese input method frameworks are IBus, fcitx5 and scim. For specific installation and configuration, please refer to the respective articles.\n\n"
    },
    {
      "title": "Bootloader Chinese support",
      "level": 3,
      "content": "See GRUB2 (简体中文).\n\n"
    },
    {
      "title": "Firefox",
      "level": 3,
      "content": "Simplified Chinese installation: firefox-i18n-zh-cn。\n\nTraditional Chinese installation: firefox-i18n-zh-tw。\n\n"
    },
    {
      "title": "Libreoffice",
      "level": 3,
      "content": "Simplified Chinese installation: libreoffice-fresh-zh-cn or libreoffice-still-zh-cn.\n\nTraditional Chinese installation: libreoffice-fresh-zh-tw or libreoffice-still-zh-cn.\n\n"
    },
    {
      "title": "PDF reader",
      "level": 3,
      "content": "Most PDF viewers already support Chinese. However, for poppler-based readers and image processing tools that can handle PDF files, poppler-data needs to be installed.\n\n"
    },
    {
      "title": "Java",
      "level": 3,
      "content": "For Sun Java users, create a fallback directory under /opt/java/jre/lib/fonts, then link or copy several Chinese fonts to the directory to allow java programs to display Chinese correctly. For example, if jreAUR and opendesktop-fonts have been installed, use the following command:\n\n```\n# ln -s /usr/share/fonts/TTF/odosung.ttc /opt/java/jre/lib/fonts/fallback/\n# cd /opt/java/jre/lib/fonts/fallback/\n# mkfontdir\n# mkfontscale\n```\n\n"
    },
    {
      "title": "vim",
      "level": 3,
      "content": "If the locale is utf8-encoded, using vim to open other Chinese encoded files may be garbled. The following settings need to be made in ~/.vimrc:\n\n```\n~/.vimrc\n```\n\n```\n...\nset fileencodings=utf8,cp936,gb18030,big5\n...\n```\n\n"
    },
    {
      "title": "MPlayer",
      "level": 4,
      "content": "To allow MPlayer to display Chinese subtitles correctly, the key is to make sure the encoding of the subtitle file is consistent with the encoding used in mplayer's configurations. If the subtitle file is encoded as gbk, use subcp=cp936; If the subtitle file is encoded as utf-8, use subcp=utf8. If the subtitle file is encoded as utf-8 and set to subcp=cp936, some garbled characters will appear. Another simpler method is to set to subcp=enca:zh:ucs-2, so that enca is responsible for the encoding and display of subtitles.\n\nModify ~/.mplayer/config:\n\n```\n~/.mplayer/config\n```\n\n```\nfont='文泉驿正黑'\nsubcp=enca:zh:ucs-2\n```\n\nUse the following command to manually load subtitles:\n\n```\n$ mplayer xxx.avi -sub xxxxx.srt\n```\n\nIf a graphical front end (such as SMPlayer) is used, it will work as long as you set the default subtitle encoding and font in the settings dialog box.\n\n"
    },
    {
      "title": "xine",
      "level": 4,
      "content": "Xine can also display Chinese subtitles, but you need to make your own Chinese fonts. For details, please refer to [3].\n\n"
    },
    {
      "title": "gstreamer",
      "level": 4,
      "content": "In totem 1.4.0, since gstreamer0.10 is used, it should be able to automatically load srt subtitles with the same name.\n\n"
    },
    {
      "title": "LaTeX",
      "level": 3,
      "content": "You need to install CJK packages and the appropriate fonts. For details, please refer to [4].\n\n"
    },
    {
      "title": "Garbled problem",
      "level": 2,
      "content": "The basic principle to avoid garbled characters is to use utf-8 instead of gbk/gb2312.\n\nFor troubleshooting instructions see Character encoding#Troubleshooting.\n\n"
    },
    {
      "title": "Translation software",
      "level": 2,
      "content": "- stardict: StarDict.\n- sdcv: command line StarDict.\n- ydcvAUR: Youdao dictionary on the command line.\n- youdao-dictAUR: Youdao dictionary (graphic interface), screen word translation.\n- GoldenDict: There is no dictionary by default, you can download the corresponding dictionary package (supports Babylon's thesaurus format .BGL, StarDict no longer maintained thesaurus format (.ifo/.dict/.idx/.syn), dictd words Library format (.index/.dict(.dz), ABBYY Lingvo's thesaurus format (.dsl/.lsa/.dat), mdict's thesaurus format, etc. The thesaurus files of these dictionaries can be downloaded and imported on the Internet Use of GoldenDict (may have copyright issues).\n- moedictAUR: A multi-platform Chinese dictionary. In addition to Chinese characters, words, idioms, etc., it also contains Hakka, Hokkien, simple foreign language translations, stroke order writing, etc. moedict online address\n- linedictAUR: An online English-Chinese dictionary that gets results by crawling Youdao translation webpage, some support English-Chinese translation, imitating dmenu to display the results at the top of the screen. It is rather easy to use. The API used by ydcvAUR has expired, and the new API is free to use the frequency limit, so linedictAUR is a good alternative.\n\n"
    }
  ]
}