{
  "title": "Locale (Français)",
  "url": "https://wiki.archlinux.org/title/Locale_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Environment variables\n- Localization\n\nLes Locales, aussi appelés paramètres régionaux, sont utilisées par glibc et d'autres programmes ou bibliothèques tenant compte des spécificités locales pour rendre le texte, afficher correctement les valeurs monétaires régionales, les formats d'heure et de date, les idiosyncrasies alphabétiques et d'autres normes spécifiques locales.\n\n"
    },
    {
      "title": "Génération de locales",
      "level": 2,
      "content": "Les noms de locales sont généralement de la forme language[_territory][. codeset][@modifier], où language est un code de langage ISO 639, territory est un code de pays ISO 3166, et codeset est un jeu de caractères ou un identifiant d'encodage comme ISO-8859-1 ou UTF-8. Consultez setlocale(3).\n\nPour obtenir une liste des locales activées, exécutez :\n\n```\n$ locale -a\n```\n\nAvant qu'une locale puisse être activée sur le système, elle doit être générée. Ceci peut être réalisé en décommentant les entrées applicables dans /etc/locale.gen, et en exécutant locale-gen. De manière équivalente, commenter les entrées désactive leurs locales respectives. Lorsque vous effectuez des modifications, tenez compte des localisations requises par les autres utilisateurs du système, ainsi que des #Variables spécifiques.\n\nPar exemple, décommentez en_US.UTF-8 UTF-8 pour l'anglais américain :\n\n```\n/etc/locale.gen\n```\n\n```\n...\n#fr_SG ISO-8859-1\nfr_US.UTF-8 UTF-8\n#fr_US ISO-8859-1\n...\n```\n\nSauvegardez le fichier, et générez la locale :\n\n```\n# locale-gen\n```\n\n- locale-gen s'exécute également à chaque mise à jour de glibc. [1]\n- UTF-8 est recommandé par rapport aux autres jeux de caractères. [2]\n\n"
    },
    {
      "title": "Définition de la locale",
      "level": 2,
      "content": "Pour afficher la locale actuellement définie et les paramètres environnementaux associés, tapez :\n\n```\n$ locale\n```\n\nLa locale à utiliser, choisie parmi celles générées précédemment, est définie dans les fichiers locale.conf. Chacun de ces fichiers doit contenir une liste d'affectations de variables d'environnement séparées par des nouvelles lignes, ayant le même format que celui fourni par locale.\n\nPour lister les locales disponibles qui ont été précédemment générées, exécutez :\n\n```\n$ localedef --list-archive\n```\n\nAlternativement, en utilisant localectl(1) :\n\n```\n$ localectl list-locales\n```\n\n"
    },
    {
      "title": "Définir la locale système",
      "level": 3,
      "content": "Pour définir la locale système, écrivez la variable LANG dans /etc/locale.conf, où en_US.UTF-8 appartient à la première colonne d'une entrée non commentée dans /etc/locale.gen :\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_US.UTF-8\n```\n\nAlternativement, exécutez :\n\n```\n# localectl set-locale LANG=en_US.UTF-8\n```\n\nConsultez #Variables et locale.conf(5) pour plus de détails.\n\n"
    },
    {
      "title": "Remplacer la locale du système par session utilisateur",
      "level": 3,
      "content": "La locale système peut être remplacée dans chaque session utilisateur en créant ou en modifiant $XDG_CONFIG_HOME/locale.conf. (généralement ~/.config/locale.conf).\n\nLa priorité de ces fichiers locale.conf est définie dans /etc/profile.d/locale.sh.\n\n- Cela peut également permettre de conserver les journaux dans /var/log/ en anglais tout en utilisant la langue locale dans l'environnement utilisateur.\n- Vous pouvez créer un fichier /etc/skel/.config/locale.conf de sorte que tous les nouveaux utilisateurs ajoutés à l'aide de useradd et de l'option -m verront ~/.config/locale.conf automatiquement générés.\n\n"
    },
    {
      "title": "Rendre les changements de locale immédiats",
      "level": 3,
      "content": "Une fois que les fichiers locale.conf du système et de l'utilisateur ont été créés ou modifiés, leurs nouvelles valeurs prendront effet pour les nouvelles sessions à la connexion. Pour que l'environnement actuel utilise les nouveaux paramètres, il suffit d'annuler l'option LANG et de sourcer /etc/profile.d/locale.sh :\n\n```\n$ unset LANG\n$ source /etc/profile.d/locale.sh\n```\n\n"
    },
    {
      "title": "Autres utilisations",
      "level": 3,
      "content": "Les variables de locale peuvent également être définies avec les méthodes standard comme expliqué dans les variables d'environnement.\n\nPar exemple, afin de tester ou de déboguer une application particulière pendant le développement, elle peut être lancée avec quelque chose comme :\n\n```\n$ LANG=C ./my_application.sh\n```\n\nDe même, pour définir la locale de tous les processus exécutés à partir du shell actuel (par exemple, lors de l'installation du système) :\n\n```\n$ export LANG=C\n```\n\n"
    },
    {
      "title": "Variables",
      "level": 2,
      "content": "Les fichiers locale.conf prennent en charge les variables d'environnement suivantes.\n\n- LANG\n- LANGUAGE\n- LC_ADDRESS\n- LC_COLLATE\n- LC_CTYPE\n- LC_IDENTIFICATION\n- LC_MEASUREMENT\n- LC_MESSAGES\n- LC_MONETARY\n- LC_NAME\n- LC_NUMERIC\n- LC_PAPER\n- LC_TELEPHONE\n- LC_TIME\n\nLa signification complète des variables LC_* ci-dessus se trouve sur la page de manuel locale(7), tandis que les détails de leur définition sont décrits sur locale(5).\n\n"
    },
    {
      "title": "LANG : locale par défaut",
      "level": 3,
      "content": "La locale définie pour cette variable sera utilisée pour toutes les variables LC_* qui ne sont pas explicitement définies.\n\n"
    },
    {
      "title": "LANGUAGE : locales de repli",
      "level": 3,
      "content": "Les programmes qui utilisent gettext pour les traductions respectent l'option LANGUAGE en plus des variables habituelles. Cela permet aux utilisateurs de spécifier une liste de locales qui seront utilisées dans cet ordre. Si une traduction pour la locale préférée n'est pas disponible, une autre d'une locale similaire sera utilisée à la place de la locale par défaut. Par exemple, un utilisateur australien peut vouloir utiliser l'orthographe britannique plutôt que l'orthographe américaine :\n\n```\nlocale.conf\n```\n\n```\nLANG=fr_AU.UTF-8\nLANGUAGE=fr_AU:en_GB:en\n```\n\n"
    },
    {
      "title": "LC_TIME : format de date et d'heure",
      "level": 3,
      "content": "Si LC_TIME est défini sur en_US.UTF-8, par exemple, le format de la date sera \"MM/JJ/AAAA\". Si vous souhaitez utiliser le format de date ISO 8601 \"YYYY-MM-DD\", utilisez :\n\n```\nlocale.conf\n```\n\n```\nLC_TIME=fr_DK.UTF-8\n```\n\nglibc 2.29 a corrigé un bogue, fr_US.UTF-8 a commencé à s'afficher au format 12 heures, comme prévu. Si vous souhaitez utiliser le format 24 heures, utilisez LC_TIME=fr_GB.UTF-8.\n\n"
    },
    {
      "title": "LC_COLLATE : collation",
      "level": 3,
      "content": "Cette variable régit les règles de collation utilisées pour le tri et les expressions régulières.\n\nEn donnant à cette variable la valeur C, la commande ls peut par exemple trier les fichiers à points en premier, puis les noms de fichiers en majuscules et en minuscules :\n\n```\nlocale.conf\n```\n\n```\nLC_COLLATE=C\n```\n\nConsultez également [4].\n\nPour contourner les problèmes potentiels, Arch avait l'habitude de définir LC_COLLATE=C dans /etc/profile, mais cette méthode est maintenant dépréciée.\n\n"
    },
    {
      "title": "LC_ALL : dépannage",
      "level": 3,
      "content": "La locale définie pour cette variable remplacera toujours LANG et toutes les autres variables LC_*, qu'elles soient définies ou non. Si LC_ALL est défini sur C, il remplacera également LANGUAGE.\n\nLC_ALL est la seule variable LC_* qui ne peut pas être définie dans les fichiers locale.conf : elle est destinée à être utilisée uniquement à des fins de test ou de dépannage, par exemple dans /etc/profile.\n\n"
    },
    {
      "title": "Mon terminal ne prend pas en charge UTF-8",
      "level": 3,
      "content": "Voici une liste de quelques terminaux (pas tous) qui prennent en charge UTF-8 :\n\n- gnustep-terminal\n- konsole\n- mlterm\n- rxvt-unicode\n- st\n- Terminaux basés sur VTE.\n- xterm - Exécuté avec l'argument -u8 ou la ressource de configuration xterm*utf8 : 2.\n\n"
    },
    {
      "title": "Gnome-terminal ou rxvt-unicode",
      "level": 4,
      "content": "Vous devez lancer ces applications à partir d'une locale UTF-8 ou elles ne prendront plus en charge l'UTF-8. Activez la locale en_US.UTF-8 (ou votre alternative UTF-8 locale) selon les instructions ci-dessus et définissez-la comme locale par défaut, puis redémarrez.\n\n"
    },
    {
      "title": "Mon système utilise toujours la mauvaise langue",
      "level": 3,
      "content": "Il est possible que les variables d'environnement soient redéfinies dans d'autres fichiers que locale.conf. Consultez Environment variables#Defining variables pour plus de détails.\n\nSi vous utilisez un environnement de bureau, tel que GNOME, ses paramètres linguistiques peuvent remplacer les paramètres de locale.conf.\n\nKDE Plasma permet également de modifier la langue de l'interface utilisateur via les paramètres système. Si l'environnement de bureau utilise toujours la langue par défaut après la modification, supprimez le fichier ~/.config/plasma-localerc (précédemment : ~/.config/plasma-locale-settings.sh) devrait résoudre le problème.\n\nSi vous utilisez un gestionnaire d'affichage en combinaison avec accountsservice, suivez les instructions dans Display manager (Français)#Définir la langue de la session utilisateur.\n\nLightDM utilisera automatiquement accountsservice pour définir les paramètres régionaux d'un utilisateur s'il est installé. Sinon, LightDM stocke la configuration de la session utilisateur dans ~/.dmrc. Il est possible qu'un paramètre local non désiré soit récupéré à partir de là également.\n\n"
    },
    {
      "title": "Encodage incorrect pour les fichiers extraits",
      "level": 3,
      "content": "Les anciennes versions de Windows (XP, Vista et 7) utilisent un encodage différent pour le contenu des fichiers compressés. Pour dézipper, utilisez la commande :\n\n```\n$ unzip -O CP936 fichier.zip\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Gentoo:Localization/Guide\n- Article du wiki Gentoo censé dater de 2008 ou plus tôt[dead link 2023-05-06 ⓘ].\n- Test de collationnement interactif de l'ICU.\n- Initiative d'internationalisation ouverte du groupe de normalisation libre (Free Standards Group).\n- The Single UNIX Specification définition de Locale par The Open Group\n- Variables d'environnement Locale\n\n"
    }
  ]
}