{
  "title": "Locate (Português)",
  "url": "https://wiki.archlinux.org/title/Locate_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artigo ou esta seção precisa de tradução.** Este artigo ou esta seção precisa de tradução.\n\nEste artigo ou esta seção precisa de tradução.\n\nArtigos relacionados\n\n- find\n- Utilitários principais\n- Busca de arquivos\n\nmlocate (Merging Locate) é uma versão mais segura do utilitário locate, que mostra apenas arquivos acessíveis ao usuário.\n\nlocate é uma ferramenta Unix comum para encontrar rapidamente arquivos pelo nome. Ele oferece melhorias de velocidade em relação à ferramenta find, pesquisando um arquivo de banco de dados pré-compilado, em vez do sistema de arquivos diretamente. A desvantagem dessa abordagem é que as alterações feitas desde a construção do arquivo de banco de dados não podem ser detectadas pelo locate. Esse problema pode ser minimizado por atualizações de banco de dados agendadas.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote mlocate[link quebrado: replaced by plocate].\n\nEnquanto o GNU findutils também uma implementação do locate, o pacote findutils do Arch não inclui.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Antes que locate(1)[link inativo 2024-10-13] possa ser usado, o banco de dados precisará ser criado, isso é feito com o comando updatedb(8), que (como o nome sugere) atualiza o banco de dados.\n\nO pacote contém uma unidade updatedb.timer, que invoca uma atualização do banco de dados todos os dias. O timer é ativado logo após a instalação, inicie manualmente se você quiser usá-lo antes de reinicializar. Você também pode executar manualmente updatedb como root a qualquer momento.\n\nPara economizar tempo, updatedb pode ser (e por padrão é) configurado para ignorar certos sistemas de arquivos e caminhos editando /etc/updatedb.conf. updatedb.conf(5) descreve a semântica deste arquivo. Vale a pena notar que entre os caminhos ignorados na configuração padrão (PRUNEPATHS) estão /media e /mnt, então locate pode não descobrir arquivos em dispositivos externos.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Como locate funciona e rescreva-o em um minuto\n\n"
    }
  ]
}