{
  "title": "Locale (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Locale_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "İlgili makaleler\n\n- Environment variables\n- Localization\n\nYerel ayarlar, glibc paketi tarafından kullanılır ve diğer yerel ayarlara duyarlı programlar veya kütüphaneler tarafından metin renderlama, bölgesel para birimi değerlerinin doğru şekilde görüntülenmesi, tarih ve saat formatları, alfabetik özellikler ve diğer yerel spesifik standartlar için kullanılır.\n\n"
    },
    {
      "title": "Yerel ayar oluşturma",
      "level": 2,
      "content": "Yerel adlar genellikle şu şekilde olur:dil[_bölge][.karakterseti][@eklenti], burada dil bir ISO 639 dil kodu( örneğin, İngilizce için \"en\" ve Türkçe için \"tr\" ), bölge bir ISO 3166 ülke kodu( örneğin, Amerika Birleşik Devletleri için \"US\" ve Türkiye için \"TR\" ), karakterseti ise Karakter seti yani ISO-8859-1 veya UTF-8 gibi, karakter kodlamasını belirtir. Daha fazlası için setlocale(3).\n\nEtkin yerel ayarların bir listesini almak için şunu çalıştırın:\n\n```\n$ locale --all-locales\n```\n\nBir yerel ayarın sistemde etkinleştirilebilmesi için önce oluşturulması gerekir.Bu, /etc/locale.gen dosyasındaki ilgili girdilerin yorumu kaldırıldıktan sonra locale-gen çalıştırılarak gerçekleştirilebilir. Aynı zamanda, istenmeyen girdilere yorum ekleyerek devre dışı bırakabilirsiniz. Bunu yaparken diğer kullanıcılar ve belirli bazı #Değişkenler.\n\nÖrneğin Türkçe için , tr_TR.UTF-8 UTF-8 girdisini yorumdan çıkaralım.( Ve genellikle çeşitli araçlar için yedek olarak kullanılan en_US.UTF-8 UTF-8 satırınıda.):\n\n```\n/etc/locale.gen\n```\n\n```\n...\n#tr_CY ISO-8859-9  \ntr_TR.UTF-8 UTF-8  \n#tr_TR ISO-8859-9  \n...\n#en_SG ISO-8859-1\nen_US.UTF-8 UTF-8\n#en_US ISO-8859-1\n...\n```\n\nDosyayı kaydedin ve aşağıdaki komudu çalıştırarak yerel ayarı oluşturun:\n\n```\n# locale-gen\n```\n\n- locale-gen ayrıca glibc her güncellendiğinde de çalıştırılır. [1]\n- UTF-8 diğer karakter setlerine göre daha çok önerilir. [2]\n\n"
    },
    {
      "title": "Yerel ayar ayarlama",
      "level": 2,
      "content": "Geçerli yerel ayarı ve ilgili ortam değişkenlerini görüntülemek için şunu yazın:\n\n```\n$ locale\n```\n\nKullanılacak yerel ayar, önceden oluşturulmuş olanlar arasından seçilir ve locale.conf dosyasında ayarlanır. Bu dosyaların her biri, locale komutunun çıktısı ile aynı formatta ve ortam değişkenlerinin atamalarının satırlarla ayrılmış bir listesini içermelidir.\n\nDaha önce oluşturulmuş olan mevcut yerel ayarları listelemek için şunu çalıştırın:\n\n```\n$ localedef --list-archive\n```\n\nAlternatif olarak, localectl(1) kullanılabilir:\n\n```\n$ localectl list-locales\n```\n\n"
    },
    {
      "title": "Sistem yerel ayarını yapılandırma",
      "level": 3,
      "content": "Sistem yerel ayarını yapılandırmak için, LANG değişkenini /etc/locale.conf dosyasına yazın, burada kullandığımız en_US.UTF-8, /etc/locale.gen dosyasındaki yorumdan çıkarılmış girdilerin ilk sütunudur :\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_US.UTF-8\n```\n\nAlternatif olarak, çalıştırabiliriz :\n\n```\n# localectl set-locale LANG=en_US.UTF-8\n```\n\nDetayları görmek için #Değişkenler ve locale.conf(5).\n\n"
    },
    {
      "title": "Kullanıcı oturumu başına sistem yerel ayarını geçersiz kılma",
      "level": 3,
      "content": "Sistem genelindeki yerel ayar, $XDG_CONFIG_HOME/locale.conf (genellikle ~/.config/locale.conf) dosyası oluşturularak veya düzenlenerek her bir kullanıcı için ayrı ayrı geçersiz kılınabilir.\n\nÖncelikli locale.conf dosyası /etc/profile.d/locale.sh içinde tanımlıdır .\n\n- Bu, kullanıcı ortamında yerel dili kullanırken günlükleri /var/log/ içinde İngilizce olarak tutmanıza da olanak tanıyabilir.\n- Bir /etc/skel/.config/locale.conf dosyası oluşturabilirsiniz, böylece useradd ve -m seçeneği kullanılarak eklenen tüm yeni kullanıcılar ~/.config/locale.conf dosyasını otomatik olarak oluşturacaktır. Daha fazlasını öğrenmek için Users and groups#Changing user defaults.\n\n"
    },
    {
      "title": "Yerel ayar değişikliklerini mevcut oturumda kullanma/uygulama",
      "level": 3,
      "content": "Sistem ve kullanıcı locale.conf dosyaları oluşturulduktan veya düzenlendikten sonra yapılan değişikliklerin çalışabilmesi için tekrardan oturum açılması gerekir. Mevcut ortamın yeni ayarları kullanmasını sağlamak için LANG ayarını kaldırın ve /etc/profile.d/locale.sh kaynağını kullanın:\n\n```\n$ unset LANG\n$ source /etc/profile.d/locale.sh\n```\n\n"
    },
    {
      "title": "Diğer kullanımlar",
      "level": 3,
      "content": "Yerel değişkenler Ortam değişkenleri bölümünde açıklandığı gibi standart yöntemlerle de tanımlanabilir.\n\nÖrneğin, geliştirme sırasında belirli bir uygulamayı test etmek veya hata ayıklamak için, uygulama aşağıdaki gibi bir şeyle başlatılabilir:\n\n```\n$ LANG=C ./my_application.sh\n```\n\nBenzer şekilde, geçerli kabuktan çalıştırılan tüm işlemler için yerel ayarı ayarlamak için (örneğin, sistem kurulumu sırasında):\n\n```\n$ export LANG=C\n```\n\n"
    },
    {
      "title": "Değişkenler",
      "level": 2,
      "content": "locale.conf dosyaları aşağıdaki ortam değişkenlerini destekler.\n\n- LANG\n- LANGUAGE\n- LC_ADDRESS\n- LC_COLLATE\n- LC_CTYPE\n- LC_IDENTIFICATION\n- LC_MEASUREMENT\n- LC_MESSAGES\n- LC_MONETARY\n- LC_NAME\n- LC_NUMERIC\n- LC_PAPER\n- LC_TELEPHONE\n- LC_TIME\n\nYukarıdaki LC_* değişkenlerinin tam anlamı locale(7) sayfasında bulunabilirken, tanımlarının ayrıntıları locale(5) sayfasında açıklanmıştır.\n\n"
    },
    {
      "title": "LANG: varsayılan yerel ayar",
      "level": 3,
      "content": "Bu değişken için ayarlanan yerel ayar, ayarlanmamış tüm LC_* değişkenleri için kullanılacaktır.\n\n"
    },
    {
      "title": "LANGUAGE: yedek yerel ayarlar",
      "level": 3,
      "content": "Çeviriler için gettext kullanan programlar, normal değişkenlere ek olarak LANGUAGE seçeneğinide dikkate alır. Bu, kullanıcıların belirli bir sırayla kullanılacak yerel ayar listesi belirtmelerine olanak tanır. Tercih edilen yerel ayar için bir çeviri mevcut değilse, varsayılan yerine benzer bir yerel ayarın başka bir çevirisi kullanılacaktır. Örneğin, Avustralyalı bir kullanıcı ABD yazımı yerine İngiliz yazımına geri dönmek isteyebilir:\n\n```\nlocale.conf\n```\n\n```\nLANG=en_AU.UTF-8\nLANGUAGE=en_AU:en_GB:en\n```\n\n"
    },
    {
      "title": "LC_TIME: tarih ve saat biçimi",
      "level": 3,
      "content": "Eğer LC_TIME en_US.UTF-8 olarak ayarlanmışsa, örneğin, tarih biçimi “MM/DD/YYYY” olacaktır. Eğer ISO 8601 tarih biçimi olan “YYYY-MM-DD” kullanılmak isteniyorsa:\n\n```\nlocale.conf\n```\n\n```\nLC_TIME=en_DK.UTF-8\n```\n\nGeçerli zaman damgasını yerel tarih ve saat biçiminizi kullanarak date +“%c” ile yazdırabilirsiniz.\n\nglibc 2.29 sürümünde bir hatayı düzeltti, en_US.UTF-8 amaçlandığı gibi 12 saat biçiminde gösterilmeye başlandı. Eğer 24 saat formatını kullanmak istiyorsanız, LC_TIME=C.UTF-8 kullanın.\n\n"
    },
    {
      "title": "LC_COLLATE: sıralama",
      "level": 3,
      "content": "Bu değişken, sıralama ve düzenli ifadeler için kullanılan dizilim kurallarını yönetir.\n\nDeğeri C olarak ayarlamak, örneğin ls komutunun nokta ile başlayan dosyaları önce sıralamasını, ardından büyük harfli ve küçük harfli dosya adlarının sıralanmasını sağlar:\n\n```\nlocale.conf\n```\n\n```\nLC_COLLATE=C\n```\n\nAyrıca bakabilirsiniz. [4].\n\nArch, olası sorunları çözmek için /etc/profile içindeki LC_COLLATE=C ayarını kullanırdı, ancak bu yöntem artık kullanılmamaktadır.\n\n"
    },
    {
      "title": "LC_ALL: sorun giderme",
      "level": 3,
      "content": "Bu değişken için ayarlanan yerel ayar, ayarlanmış olsun ya da olmasın LANG ve diğer tüm LC_* değişkenlerini her zaman geçersiz kılacaktır. Eğer LC_ALL değişkeni C veya C.UTF-8 olarak ayarlanmışsa, LANGUAGE değişkenini de geçersiz kılacaktır.\n\nLC_ALL, locale.conf dosyalarında ayarlanamayan tek LC_* değişkenidir: yalnızca test veya sorun giderme için kullanılması amaçlanmıştır, örneğin /etc/profile dosyası içinde.\n\n"
    },
    {
      "title": "Sorun Giderme",
      "level": 2,
      "content": "Karakter Kodlama sorunları için Character encoding#Troubleshooting kısmına göz atın.\n\n"
    },
    {
      "title": "Sistemim hala yanlış dil kullanıyor",
      "level": 3,
      "content": "Ortam değişkenlerinin locale.conf dışında başka dosyalarda yeniden tanımlanmış olması mümkündür. Ayrıntılar için Environment variables#Defining variables bölümüne bakınız.\n\nEğer GNOME gibi bir masaüstü ortamı kullanıyorsanız, bu ortamın dil ayarları locale.conf içindeki ayarları geçersiz kılıyor olabilir.\n\nKDE Plasma ayrıca sistem ayarları aracılığıyla arayüzün dilini değiştirmeye izin verir. Değişiklikten sonra masaüstü ortamı hala varsayılan dili kullanıyorsa, adresindeki dosyayı silin ~/.config/plasma-localerc\n\n(önceden): ~/.config/plasma-locale-settings.sh\n\nsorunu çözmelidir.\n\nEğer accountsservice ile birlikte bir görüntü yöneticisi kullanıyorsanız, Display manager#Set language for user session bölümündeki talimatları izleyin.\n\nLightDM yüklüyse kullanıcının yerel ayarını ayarlamak için otomatik olarak accountsservice kullanacaktır. Aksi takdirde, LightDM kullanıcı oturumu yapılandırmasını ~/.dmrc içinde saklar. İstenmeyen bir yerel ayarın oradan da alınması mümkündür.\n\n"
    },
    {
      "title": "Özel bir yerel ayar kullanmak sorunlara neden oldu",
      "level": 3,
      "content": "Resmi olarak desteklenmeyen bir yerel ayarı yüklerken (örneğin, locale-en_xxAUR), bazı uygulamalarda çalışmayan dead/compose tuşları veya eksik yerel ayarları bildiren uygulamalar gibi bazı sorunlar ortaya çıkabilir. Özel bir yerel ayar yükledikten sonra, bu sorunları çözmek için manuel müdahale gerekir. iki yaklaşım vardır (en_XX.UTF-8'i indirmiş olduğunuz özel yerel ayarınızın tanımlayıcısıyla değiştirin):\n\n"
    },
    {
      "title": "LC_CTYPE'ı ayarla",
      "level": 4,
      "content": "LC_CTYPE öğesini resmi olarak desteklenen bir yerel ayara (en_US.UTF-8 gibi) ayarlayın, örn:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=en_XX.UTF-8\nLC_CTYPE=en_US.UTF-8\n```\n\n"
    },
    {
      "title": "Xlib veritabanını değiştirme",
      "level": 4,
      "content": "Aşağıdakileri ekleyerek Xlib veritabanını değiştirin:\n\n```\n/usr/share/X11/locale/locale.dir\n```\n\n```\nen_US.UTF-8/XLC_LOCALE en_XX.UTF-8\nen_US.UTF-8/XLC_LOCALE: en_XX.UTF-8\n```\n\n```\n/usr/share/X11/locale/compose.dir\n```\n\n```\nen_US.UTF-8/Compose en_XX.UTF-8\nen_US.UTF-8/Compose: en_XX.UTF-8\n```\n\n"
    },
    {
      "title": "ABD yerel ayarı ile metrik ölçümler",
      "level": 4,
      "content": "Bazı araçlarda, nvme-cli gibi, birim türü locale ayarlarına göre seçilir; bu nedenle, ABD yerel ayarları kullanılıyorsa sıcaklıklar Fahrenheit cinsinden gösterilir. Örneğin sıcaklıkları Celsius cinsinden almak ve aynı zamanda ABD yerel ayarıyla Metrik ölçümleri kullanmak istiyorsanız, LC_MEASUREMENT=metric öğesini /etc/locale.conf öğesine ekleyin, paket sadece ülke yerine LC_MEASUREMENT öğesini ararsa işe yarayacaktır. [5]\n\n"
    },
    {
      "title": "Ayrıca bkz.",
      "level": 2,
      "content": "- Locales - glibc wiki\n- Gentoo:Localization/Guide\n- Supposedly 2008, or earlier, Gentoo wiki article\n- ICU's interactive collation testing\n- Free Standards Group Open Internationalisation Initiative\n- The POSIX definition of a locale\n- Locale environment variables\n\n"
    }
  ]
}