{
  "title": "Localization (Español)/Chinese (Español)",
  "url": "https://wiki.archlinux.org/title/Localization_(Espa%C3%B1ol)/Chinese_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-05-31** \n\nEste artículo describe cómo configurar un entorno de idioma Chino.\n\n"
    },
    {
      "title": "Fuentes",
      "level": 2,
      "content": "- Fuentes adobe source han. adobe-source-han-sans-cn-fonts - Fuentes de chino simplificado OpenType/CFF Sans. adobe-source-han-sans-tw-fonts - Fuentes de chino tradicional OpenType/CFF Sans. adobe-source-han-serif-cn-fonts - Fuentes de chino simplificado OpenType/CFF Serif. adobe-source-han-serif-tw-fonts - Fuentes de chino tradicional OpenType/CFF Serif.\n\n- adobe-source-han-sans-cn-fonts - Fuentes de chino simplificado OpenType/CFF Sans.\n- adobe-source-han-sans-tw-fonts - Fuentes de chino tradicional OpenType/CFF Sans.\n- adobe-source-han-serif-cn-fonts - Fuentes de chino simplificado OpenType/CFF Serif.\n- adobe-source-han-serif-tw-fonts - Fuentes de chino tradicional OpenType/CFF Serif.\n\n- Fuentes noto, chino. noto-fonts-scAUR - Fuentes Noto CJK-SC para chino simplificado. noto-fonts-tcAUR - Fuentes Noto CJK-TC para chino tradicional.\n\n- noto-fonts-scAUR - Fuentes Noto CJK-SC para chino simplificado.\n- noto-fonts-tcAUR - Fuentes Noto CJK-TC para chino tradicional.\n\n- Fuentes wqy wqy-microhei - La Familia tipográfica WenQuanYi Micro Hei (también conocida como Hei, Gothic o Dotum) es un estilo sans-serif derivado de Droid Sans Fallback, ofrece una gran calidad CJK y un gran contorno, además es extremadamente compacto (~5M). wqy-zenhei - Estilo Hei Ti (sans-serif) Contorno chino con incrustaciones con Bitmapped Song Ti (también soporta japonés (parcialmente) y caracteres coreanos). wqy-bitmapfont - Fuente china Bitmapped Song Ti (serif).\n\n- wqy-microhei - La Familia tipográfica WenQuanYi Micro Hei (también conocida como Hei, Gothic o Dotum) es un estilo sans-serif derivado de Droid Sans Fallback, ofrece una gran calidad CJK y un gran contorno, además es extremadamente compacto (~5M).\n- wqy-zenhei - Estilo Hei Ti (sans-serif) Contorno chino con incrustaciones con Bitmapped Song Ti (también soporta japonés (parcialmente) y caracteres coreanos).\n- wqy-bitmapfont - Fuente china Bitmapped Song Ti (serif).\n\n- Fuentes arficas. ttf-arphic-ukai - Fuente Unicode kaiti (trazos de pincel) (se sugiere habilitar anti-aliasing). ttf-arphic-uming - Fuente Unicode mingti (impresa).\n\n- ttf-arphic-ukai - Fuente Unicode kaiti (trazos de pincel) (se sugiere habilitar anti-aliasing).\n- ttf-arphic-uming - Fuente Unicode mingti (impresa).\n\n- opendesktop-fonts - Fuente New Sung, anteriormente era el paquete ttf-fireflysung.\n\n- ttf-hannom - Fuentes ttf chinas and vietnamitas.\n\n- Fuentes estándar del ministerio de educación de la república china en Taiwan. ttf-twAUR - Fuentes chinas tradicionales Kai y Song del ministerio de educación de Taiwan. ttf-twcns-fontsAUR Fuentes chinas TrueType por el ministerio de educación del gobierno de Taiwan, soporta el estándar CNS11643, incluido el tipo de letra kai y sung.\n\n- ttf-twAUR - Fuentes chinas tradicionales Kai y Song del ministerio de educación de Taiwan.\n- ttf-twcns-fontsAUR Fuentes chinas TrueType por el ministerio de educación del gobierno de Taiwan, soporta el estándar CNS11643, incluido el tipo de letra kai y sung.\n\n- Fuentes chinas de Windows ttf-ms-win8-zh_cnAUR - Fuentes de chino simplificado de windows 8. ttf-ms-win8-zh_twAUR - Fuentes de chino tradicional de windows 8. ttf-ms-win10-zh_cnAUR - Fuentes de chino simplificado de windows 10. ttf-ms-win10-zh_twAUR - Fuentes de chino tradicional de windows 10.\n\n- ttf-ms-win8-zh_cnAUR - Fuentes de chino simplificado de windows 8.\n- ttf-ms-win8-zh_twAUR - Fuentes de chino tradicional de windows 8.\n- ttf-ms-win10-zh_cnAUR - Fuentes de chino simplificado de windows 10.\n- ttf-ms-win10-zh_twAUR - Fuentes de chino tradicional de windows 10.\n\n- ttf-i.bmingAUR - Fuente CJK serif que enfatiza en un estilo de letra antiguo.\n\n"
    },
    {
      "title": "Métodos de entrada",
      "level": 2,
      "content": "Los siguientes motores de métodos de entrada (ME) están disponibles para el idioma Chino:\n\nTable content:\nMotor | Fcitx | IBus | SCIM | uim | gcin | hime-gitAUR\nWubi | built-in | ibus-table | scim-tablesAUR | built-in | ? | ?\nlibchewing | fcitx-chewing | ibus-chewing | scim-chewingAUR | uim-chewing | optdepends | optdepends\nlibgooglepinyin | fcitx-googlepinyin | ibus-googlepinyinAUR | – | – | – | –\nlibpinyin | fcitx-libpinyin | ibus-libpinyin | – | – | – | –\nsunpinyin | fcitx-sunpinyin | ibus-sunpinyin | – | – | – | –\nRime | fcitx-rime | ibus-rime | – | – | – | –\n\n"
    }
  ]
}