{
  "title": "Locale (Русский)",
  "url": "https://wiki.archlinux.org/title/Locale_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Переменные окружения\n- Локализация\n\nЛокали определяют язык, который использует система, а также региональные особенности, такие как денежные знаки, формат чисел, даты и времени и наборы символов. Они используются glibc и некоторыми другими программами или библиотеками для рендеринга текста.\n\n"
    },
    {
      "title": "Генерирование локалей",
      "level": 2,
      "content": "Имена локалей обычно имеют вид [язык][_ТЕРРИТОРИЯ][.НАБОР_СИМВОЛОВ][@модификатор], где язык это код языка ISO 639, ТЕРРИТОРИЯ это код страны ISO 3166 и НАБОР_СИМВОЛОВ это кодировка вроде ISO-8859-1 или UTF-8. Смотрите setlocale(3).\n\nЧтобы вывести список всех доступных и сгенерированных локалей, выполните:\n\n```\n$ locale -a\n```\n\nПеред тем, как локаль сможет быть использована в системе, она должна быть сгенерирована. Локали, которые вы можете сгенерировать перечислены в файле /etc/locale.gen. Чтобы сгенерировать локаль, первым делом раскомментируйте соответствующую строку в файле (а для удаления наоборот, закомментируйте); вы можете раскомментировать несколько локалей, в зависимости от ваших потребностей.\n\nНапример, для русской локали раскомментируйте ru_RU.UTF-8 UTF-8:\n\n```\n/etc/locale.gen\n```\n\n```\n...\n#ro_RO ISO-8859-2  \n#ru_RU.KOI8-R KOI8-R  \nru_RU.UTF-8 UTF-8  \n#ru_RU ISO-8859-5  \n#ru_UA.UTF-8 UTF-8\n...\n```\n\nПосле сохранения файла сгенерируйте выбранные локали командой:\n\n```\n# locale-gen\n```\n\n- locale-gen также запускается каждый раз при обновлении glibc. [1]\n- UTF-8 предпочтительнее других кодировок. [2]\n\n"
    },
    {
      "title": "Установка локали",
      "level": 2,
      "content": "Чтобы отобразить текущую локаль и связанные с ней переменные окружения, наберите:\n\n```\n$ locale\n```\n\nИспользуемая локаль, выбранная среди сгенерированных в системе, устанавливается в файлах locale.conf, каждый из которых должен содержать список переменных окружения в том же формате, в каком их выводит команда locale.\n\nЧтобы посмотреть список доступных ранее сгенерированных локалей, выполните:\n\n```\n$ localedef --list-archive\n```\n\nТакже можно использовать localectl(1):\n\n```\n$ localectl list-locales\n```\n\n"
    },
    {
      "title": "Установка системной локали",
      "level": 3,
      "content": "- Системная локаль устанавливается с помощью переменной LANG в файле /etc/locale.conf. Значением должен быть первый столбец из раскомментированной записи в /etc/locale.gen:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=ru_RU.UTF-8\n```\n\nВы можете установить ее также при помощи localectl:\n\n```\n# localectl set-locale LANG=ru_RU.UTF-8\n```\n\nПодробнее смотрите #Переменные окружения and locale.conf(5).\n\n"
    },
    {
      "title": "Переопределение системной локали в пользовательском сеансе",
      "level": 3,
      "content": "- Системная локаль может переопределяться в каждом пользовательском сеансе с помощью файла ~/.config/locale.conf (обычно ~/$XDG_CONFIG_HOME/locale.conf).\n\n- Это позволяет вести системные логи в /var/log/ на английском, при использовании местного языке в рабочей среде пользователя.\n- Вы можете создать файл /etc/skel/.config/locale.conf, тогда для всех новых пользователей, добавленных командой useradd с опцией -m сразу будет автоматически сгенерирован файл ~/.config/locale.conf.\n\n"
    },
    {
      "title": "Немедленное применение изменений локали",
      "level": 3,
      "content": "После внесения изменений в файлы locale.conf, они вступят в силу после перезагрузки системы, и для отдельных сеансов пользователей — при входе. Чтобы принудительно обновить локаль в текущем окружении без перезагрузки, выполните:\n\n```\n$ unset LANG\n$ source /etc/profile.d/locale.sh\n```\n\n"
    },
    {
      "title": "Дополнительно",
      "level": 3,
      "content": "Переменные окружения настроек локали могут также быть установлены обычным способом, как указано на странице переменные окружения.\n\nНапример, чтобы проверить, как работает конкретное приложение с какой-нибудь локалью, вы можете запустить его следующим образом:\n\n```\n$ LANG=С ./my_application.sh\n```\n\nАналогично, для установки локали всем процессам, запускаемом из текущей командной оболочки (например, в процессе установки системы):\n\n```\n$ export LANG=C\n```\n\n"
    },
    {
      "title": "Переменные окружения",
      "level": 2,
      "content": "Файлы locale.conf могут содержать следующие переменные окружения:\n\n- LANG\n- LANGUAGE\n- LC_ADDRESS\n- LC_COLLATE\n- LC_CTYPE\n- LC_IDENTIFICATION\n- LC_MEASUREMENT\n- LC_MESSAGES\n- LC_MONETARY\n- LC_NAME\n- LC_NUMERIC\n- LC_PAPER\n- LC_TELEPHONE\n- LC_TIME\n\nПолное объяснение этих переменных можно узнать в locale(7), детали описаны в locale(5).\n\n"
    },
    {
      "title": "LANG: локаль по умолчанию",
      "level": 3,
      "content": "Локаль, установленная в этой переменной используется в качестве значения для всех остальных LC_*-переменных, которые не установлены явно.\n\n"
    },
    {
      "title": "LANGUAGE: запасные локали",
      "level": 3,
      "content": "Программы, использующие gettext для перевода, учитывают также переменную LANGUAGE в дополнение к стандартным переменным. Это позволяет пользователям установить список локалей, которые будут использоваться в указанном порядке для поиска перевода. Если перевод для более предпочтительной локали (которая идет раньше в списке) недоступен, будет произведена попытка получить перевод для следующей, и так далее. Например, пользователь из Австралии может предпочесть британский вариант перевода американскому:\n\n```\nlocale.conf\n```\n\n```\nLANG=en_AU\nLANGUAGE=en_AU:en_GB:en\n```\n\n"
    },
    {
      "title": "LC_TIME: формат даты и времени",
      "level": 3,
      "content": "Например, если переменная LC_TIME имеет значение en_US.UTF-8, будет использован формат даты ММ/ДД/ГГГГ. Если вы хотите использовать формат ISO 8601 (ГГГГ-ММ-ДД), установите:\n\n```\nlocale.conf\n```\n\n```\nLC_TIME=en_DK.UTF-8\n```\n\nВы можете распечатать текущую метку времени, используя формат даты и времени вашего региона с помощью date +\"%c\".\n\nglibc 2.29 исправляет ошибку, en_US.UTF-8 начал отображаться в 12-часовом формате, как и предполагалось. Если вы хотите использовать 24-часовой формат, используйте LC_TIME=C.UTF-8.\n\n"
    },
    {
      "title": "LC_COLLATE: порядок сортировки",
      "level": 3,
      "content": "Эта переменная отвечает за правила определения сравнения наборов символов, которые используются для сортировки и регулярных выражений.\n\nУстановка значения LC_COLLATE=C, например, приведет к тому, что команда ls будет располагать файлы, имена которых начинаются с точки, первыми, за ними последуют имена, начинающиеся с цифры, затем с заглавной и, наконец, со строчной буквы:\n\n```\n/etc/locale.conf\n```\n\n```\nLC_COLLATE=C\n```\n\nСмотрите также https://superuser.com/a/448294.\n\nЧтобы избежать возможных проблем, в Arch переменная установлена как LC_COLLATE=C в /etc/profile, однако этот метод сейчас устарел.\n\n"
    },
    {
      "title": "LC_ALL: решение проблем",
      "level": 3,
      "content": "Переменная LC_ALL переопределяет своим значением все LC_*-переменные, включая LANG, независимо от того, установлены они или нет.\n\nПеременная LC_ALL — единственная из всех LC_-переменных, которую нельзя установить в /etc/locale.conf: она предназначена только в целях проверки при решении проблем.\n\n"
    },
    {
      "title": "Запуск приложения с другой локалью в терминале",
      "level": 3,
      "content": "Например, чтобы запустить программу abiword на иврите:\n\n```\n# env LANG=he_IL.UTF-8 abiword &\n```\n\n"
    },
    {
      "title": "Запуск приложения с другой локалью из меню",
      "level": 3,
      "content": "Скопируйте файл .desktop в домашний каталог пользователя:\n\n```\n$ cp /usr/share/applications/abiword.desktop ~/.local/share/applications/\n```\n\nИ отредактируйте команду в опции Exec:\n\n```\n~/.local/share/applications/abiword.desktop\n```\n\n```\nExec=env LANG=he_IL.UTF-8 abiword %U\n```\n\n"
    },
    {
      "title": "Эмулятор терминала не поддерживает UTF-8",
      "level": 3,
      "content": "Небольшой список терминалов с поддержкой UTF-8:\n\n- gnustep-terminal\n- konsole\n- mlterm\n- rxvt-unicode (Русский)\n- st\n- эмуляторы на основе VTE\n- xterm — необходимо запускать с опцией -u8 или с настройкой xterm*utf8: 2. Также вы можете запускать uxterm, который предоставляется пакетом xterm.\n\n"
    },
    {
      "title": "gnome-terminal или rxvt-unicode не поддерживают UTF-8",
      "level": 4,
      "content": "Чтобы заработала поддержка UTF-8 в этих приложениях, необходимо запускать их с локалью, в которой установлена кодировка UTF-8, например ru_RU.UTF-8. Включите эту локаль в системе, установите ее как системную локаль по умолчанию в соответствиями с инструкциями в предыдущих разделах и перезагрузите компьютер.\n\n"
    },
    {
      "title": "Моя система использует неверный язык",
      "level": 3,
      "content": "Возможно, некоторые переменные окружения из locale.conf. Подробнее смотрите на странице Переменные окружения#Установка переменных.\n\nЕсли вы используете окружение рабочего стола, такое как GNOME, его настройки могут перекрывать locale.conf.\n\nKDE Plasma также позволяет изменить язык интерфейса через свои настройки. Если он всё равно использует язык по умолчанию после изменения, удаление файла ~/.config/plasma-localerc (ранее ~/.config/plasma-locale-settings.sh) должно помочь.\n\nЕсли вы используете экранный менеджер вместе с accountsservice, смотрите Display manager (Русский)#Установка языка.\n\nLightDM автоматически использует accountsservice для выбора локали, если он установлен. В противном случае LightDM читает настройки сеанса из ~/.dmrc. Возможно, что нежелательные настройки локали прочитались оттуда.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Руководство по локализации Gentoo Linux\n- http://wikigentoo.ksiezyc.pl/Locales.htm[устаревшая ссылка 2023-05-06 ⓘ]\n- Интерактивная проверка сортировки от ICU\n- Инициатива Free Standards Group создания открытого стандарта интернационализации\n- О локалях в The Single UNIX Specification от The Open Group\n- Переменные окружения для настройки локали на Ubuntu Help.\n\n"
    }
  ]
}