{
  "title": "Logwatch (Español)",
  "url": "https://wiki.archlinux.org/title/Logwatch_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-09** \n\nLogwatch es un potente y versátil parser y analizador de registros. Logwatch está diseñado para dar un informe unificado de toda la actividad en un servidor, que puede ser entregado a través de la línea de comandos o por correo electrónico.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete logwatch.\n\nAdemás de los binarios, scripts y archivos de configuración de logwatch, el paquete pacman solía incluir una tarea cron que se instalaba como /etc/cron.daily/0logwatch. Es necesario iniciar/activar logwatch.timer para generar regularmente informes de logwatch.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Logwatch tiene un enfoque de configuración por niveles. Hay varios lugares donde se pueden especificar los detalles de configuración, y cada uno sustituye al anterior:\n\n- /usr/share/logwatch/default.conf/*\n- /etc/logwatch/conf/dist.conf/*\n- /etc/logwatch/conf/*\n- Los argumentos de la línea de comandos / script\n\nLogwatch analizará todas estas ubicaciones cuando se requiera.\n\nDentro de estos directorios, hay varias áreas de configuración. Los archivos logwatch.conf son donde se encuentran la mayoría de las configuraciones de alto nivel, que permiten establecer dónde se envían los informes, cómo se organizan, etc. El archivo conf en /usr/share/logwatch/default.conf/logwatch.conf contiene todas las configuraciones por defecto y comentarios sobre lo que hacen. Se recomienda dejar la configuración por defecto y en su lugar redefinir una variable de ajuste que desee cambiar en /etc/logwatch/conf/logwatch.conf.\n\nDentro del directorio logfiles/ de cualquiera de las ubicaciones de conf hay archivos de configuración que detallan archivos de registro específicos. Por defecto, la mayoría de los archivos de registro comunes que se encuentran en un sistema Linux ya están contemplados. Si cuenta con alguna aplicación esotérica que no tenga ya un archivo de registro conf, copie uno existente del directorio default.conf/logfiles/ y personalícelo para su aplicación.\n\nLa carpeta services/ contiene definiciones conf similares, pero estas definen los distintos servicios reportados por logwatch. Esto es necesario porque a menudo varios servicios reportarán al mismo registro (por ejemplo, messages, dmesg, boot, etc.). Para más información, examine algunos de los archivos services/conf predeterminados.\n\nTenga en cuenta que si desea que los mensajes de logwatch se envíen por correo electrónico, es necesario instalar un paquete que proporcione un frontend de sendmail. Postfix es una buena opción.\n\nExiste un útil documento suministrado con el paquete para ofrecer más información sobre la configuración. Se puede encontrar en /usr/share/logwatch/HOWTO-Customize-LogWatch.\n\n"
    },
    {
      "title": "Soporte de systemd journal",
      "level": 2,
      "content": "Las anteriores versiones de Logwatch no permiten consultar el registro de systemd directamente. Por esta razón, se requiere un logger como syslog-ng para duplicar la salida de journal en archivos de registro externos (como en /var/log). Se está desarrollando un parche para soportar el registro de systemd. De manera alternativa, un script personalizado podría duplicar parte de la funcionalidad de logwatch consultando directamente el registro y enviando correos electrónicos, como lo hace un script de Python en esta entrada de blog.\n\n"
    }
  ]
}