{
  "title": "Lsblk (Русский)",
  "url": "https://wiki.archlinux.org/title/Lsblk_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Постоянные имена для блочных устройств\n\nИз Википедии:\n\nВ Linux они располагаются в каталоге /dev в соответствии с Filesystem Hierarchy Standard.\n\nВ Arch Linux файлами устройств управляет udev.\n\n"
    },
    {
      "title": "Блочные устройства",
      "level": 2,
      "content": "Блочное устройство — это специальный файл, обеспечивающий буферизованный доступ к устройству.\n\n"
    },
    {
      "title": "Имена блочных устройств",
      "level": 3,
      "content": "Начало имени устройства указывает на подсистему ядра, используемую для управления этим блочным устройством.\n\n"
    },
    {
      "title": "SCSI",
      "level": 4,
      "content": "Устройства хранения, такие как жёсткие диски, SSD и флэш-накопители, которые поддерживают команду SCSI (SCSI, SAS, UASP), соединение ATA (PATA, SATA) или USB Mass Storage, обрабатываются драйвером SCSI. Все они имеют одну и ту же схему именования.\n\nИмя этих устройств начинается с sd. Затем следует строчная буква, начиная с a для первого обнаруженного устройства (sda), b для второго (sdb) и так далее.\n\nПримеры:\n\n- /dev/sda - устройство a, первое обнаруженное устройство.\n- /dev/sde - устройство e, пятое обнаруженное устройство.\n\n"
    },
    {
      "title": "NVMe",
      "level": 4,
      "content": "Имя устройств хранения, подключенных через NVM Express (NVMe), начинается с nvme. Затем следует порядковый номер контроллера устройства: nvme0 для первого обнаруженного контроллера NVMe, nvme1 для второго и так далее. Далее идет буква «n» и число, начинающееся с 1, обозначающее устройство на контроллере: nvme0n1 для первого обнаруженного устройства на первом обнаруженном контроллере, nvme0n2 для второго обнаруженного устройства на первом обнаруженном контроллере и так далее.\n\nПримеры:\n\n- /dev/nvme0n1 - устройство 1 на контроллере 0, первое обнаруженное устройство на первом обнаруженном контроллере.\n- /dev/nvme2n5 - устройство 5 на контроллере 2, пятое обнаруженное устройство на третьем обнаруженном контроллере.\n\n"
    },
    {
      "title": "MMC",
      "level": 4,
      "content": "SD-карты, карты MMC и устройства хранения данных eMMC обрабатываются драйвером mmc, и имена этих устройств начинаются с mmcblk. Затем следует порядковый номер устройства: mmcblk0 для первого обнаруженного устройства, mmcblk1 для второго и так далее.\n\nПримеры:\n\n- /dev/mmcblk0 - устройство 0, первое обнаруженное устройство.\n- /dev/mmcblk4 - устройство 4, пятое обнаруженное устройство.\n\n"
    },
    {
      "title": "Привод оптических дисков SCSI",
      "level": 4,
      "content": "Имена приводов оптических дисков, которые подключаются с через интерфейс, поддерживаемый драйвером SCSI, начинаются с sr. Затем следует порядковый номер устройства: sr0 для первого обнаруженного устройства, sr1 для второго и так далее.\n\nUdev также предоставляет /dev/cdrom, который является символической ссылкой на /dev/sr0. Имя всегда будет cdrom независимо от поддерживаемых приводом типов дисков или вставленного носителя.\n\nПримеры:\n\n- /dev/sr0 - привод оптических дисков 0, первый обнаруженный.\n- /dev/sr4 - привод оптических дисков 4, пятый обнаруженный.\n- /dev/cdrom - символическая ссылка на /dev/sr0.\n\n"
    },
    {
      "title": "virtio-blk",
      "level": 4,
      "content": "Имена дисков, подключенных к интерфейсу блочного устройства virtio (virtio-blk), начинаются с vd. Затем следует строчная буква, начиная с a для первого обнаруженного устройства (vda), b для второго (vdb) и так далее.\n\nПримеры:\n\n- /dev/vda - устройство a, первое обнаруженное устройство.\n- /dev/vde - устройство e, пятое обнаруженное устройство.\n\n"
    },
    {
      "title": "Разделы",
      "level": 4,
      "content": "Имена разделов представляют собой комбинацию имени устройства диска и номера раздела, присвоенного им в таблице разделов: /dev/устройствораздел. Для дисков, имя устройства которых заканчивается цифрой, имя диска и номер раздела разделяются буквой «p»: /dev/устройствоpраздел.\n\nПримеры:\n\n- /dev/sda1 - раздел 1 на устройстве /dev/sda.\n- /dev/nvme2n5p3 - раздел 3 на устройстве /dev/nvme2n5.\n- /dev/mmcblk3p4 - раздел 4 на устройстве /dev/mmcblk3.\n- /dev/vda1 - раздел 1 на устройстве /dev/vda.\n- /dev/loop0p2 - раздел 2 на устройстве /dev/loop0.\n\n"
    },
    {
      "title": "lsblk",
      "level": 4,
      "content": "Пакет util-linux предоставляет утилиту lsblk(8), которая выводит список блочных устройств, например:\n\n```\n$ lsblk -f\n```\n\n```\nNAME   FSTYPE   LABEL       UUID                                 MOUNTPOINT\nsda\n├─sda1 vfat                 C4DA-2C4D                            /boot\n├─sda2 swap                 5b1564b2-2e2c-452c-bcfa-d1f572ae99f2 [SWAP]\n└─sda3 ext4                 56adc99b-a61e-46af-aab7-a6d07e504652 /\n```\n\nЭтот пример показывает только одно доступное устройство (sda), которое имеет три раздела (от sda1 до sda3), каждый из которых имеет свою файловую систему.\n\n"
    },
    {
      "title": "wipefs",
      "level": 4,
      "content": "wipefs может отображать сигнатуры файловой системы, RAID или таблицы разделов (магические строки) с указанного устройства и стирать их, чтобы сделать невидимыми для libblkid(3). Он не стирает ни сами файловые системы, ни какие-либо другие данные с устройства.\n\nСмотрите wipefs(8) для получения дополнительной информации.\n\nНапример, чтобы стереть все сигнатуры с устройства /dev/sdb и создать резервную копию ~/wipefs-sdb-смещение.bak для каждой сигнатуры:\n\n```\n# wipefs --all --backup /dev/sdb\n```\n\n"
    },
    {
      "title": "Псевдоустройства",
      "level": 2,
      "content": "Эти файлы устройств не соответствуют никакому физическому устройству.\n\n- /dev/random, смотрите random(4)\n- /dev/shm\n- /dev/null, /dev/zero, смотрите null(4)\n- /dev/full, смотрите full(4)\n- /dev/ttyX, где X является числом\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Linux allocated devices — документация ядра\n- Gentoo:Device file\n\n"
    }
  ]
}