{
  "title": "LXDE (Français)",
  "url": "https://wiki.archlinux.org/title/LXDE_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- Display manager\n- Window manager\n- Openbox\n- PCManFM\n- LXDM\n- LXQt\n- File manager functionality#Mounting\n\nTraduit de la page d'accueil du projet :\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "LXDE nécessite au moins lxde-common, lxsession et Openbox. (ou un autre gestionnaire de fenêtres) pour être installé. Le groupe lxde contient le bureau complet.\n\n"
    },
    {
      "title": "Version GTK 3",
      "level": 3,
      "content": "Une version GTK 3 expérimentale de LXDE peut être installée avec le groupe lxde-gtk3.\n\nBien qu'elle fonctionne en général, il existe quelques problèmes connus avec gpicview, lxappearance-obconf, lxlauncher et lxpanel.\n\n"
    },
    {
      "title": "Connexion graphique",
      "level": 3,
      "content": "LXDM est le gestionnaire d'affichage par défaut pour LXDE et est installé en tant que partie du groupe lxde. Consultez également Gestionnaire d'affichage.\n\n"
    },
    {
      "title": "Console",
      "level": 3,
      "content": "Pour utiliser startx, ajoutez à xinitrc :\n\n```\n~/.xinitrc\n```\n\n```\nexec startlxde\n```\n\nConsultez également Xinit (Français)#Démarrage automatique de X à la connexion.\n\n"
    },
    {
      "title": "Modification du menu d'application",
      "level": 3,
      "content": "Le menu des applications fonctionne en résolvant les fichiers .desktop situés dans /usr/share/applications/ et ~/.local/share/applications/. Pour ajouter ou modifier un élément de menu, consultez Desktop entries. Des éditeurs de menu tiers peuvent être trouvés dans l'AUR. (par exemple, lxmedAUR). Il en existe également des officiels comme alacarte. (GNOME), mozo. (MATE), etc.\n\n"
    },
    {
      "title": "Démarrage automatique",
      "level": 3,
      "content": "LXDE implémente XDG Autostart. Les applications peuvent être lancées automatiquement de plusieurs façons :\n\n- Avec les fichiers .desktop\n- Via LXsession\n\nChaque ligne de ~/.config/lxsession/LXDE/autostart représente une commande à exécuter. Si une ligne commence par @ et que la commande qui suit plante, la commande est automatiquement ré-exécutée. Par exemple :\n\n```\n~/.config/lxsession/LXDE/autostart\n```\n\n```\n@lxterminal\n@leafpad\n```\n\nNote: **pas** \n\n- Ces commandes ne se terminent pas par le symbole &.\n- Il existe également un fichier global de démarrage automatique à /etc/xdg/lxsession/LXDE/autostart. Si les deux fichiers sont présents, LXsession exécute uniquement le fichier local à partir de la v0.4.9\n\n"
    },
    {
      "title": "Raccourcis clavier",
      "level": 3,
      "content": "Les raccourcis entre la souris et les touches (c'est-à-dire les raccourcis clavier) sont implémentés avec Openbox. Les utilisateurs de LXDE doivent suivre le wiki d'Openbox[dead link 2024-10-12 ⓘ] pour modifier ~/.config/openbox/lxde-rc.xml.\n\nLe paquet obkeyAUR fournit une interface graphique facultative pour modifier les liaisons de touches. Bien qu'il édite rc.xml par défaut, vous pouvez le diriger vers la configuration LXDE comme suit :\n\n```\n$ obkey ~/.config/openbox/lxde-rc.xml\n```\n\nConsultez [1] pour plus d'informations.\n\n"
    },
    {
      "title": "Curseurs",
      "level": 3,
      "content": "lxappearance est un outil graphique permettant de définir l'apparence de GTK, y compris le thème du curseur. Les paramètres configurés avec LXAppearance sont écrits dans ~/.gtkrc-2.0, ~/.config/gtk-3.0/settings.ini et ~/.icons/default/index.theme. Consultez également Cursor themes.\n\n"
    },
    {
      "title": "Heure de l'applet horloge numérique",
      "level": 3,
      "content": "Vous pouvez faire un clic droit sur l'applet d'horloge numérique sur le panneau et définir la façon dont elle affiche l'heure actuelle en utilisant le format strftime. Consultez strftime(3) pour plus de détails.\n\n"
    },
    {
      "title": "Paramètres de police",
      "level": 3,
      "content": "lxappearance-obconf configure les paramètres Openbox. Consultez également Font configuration.\n\n"
    },
    {
      "title": "Disposition du clavier",
      "level": 3,
      "content": "lxpanel inclut une applet de disposition du clavier. Consultez Configuration du clavier dans Xorg pour des instructions génériques et #Démarrage automatique pour lancer automatiquement setxkbmap dans LXDE.\n\n"
    },
    {
      "title": "Verrouillage de l'écran",
      "level": 3,
      "content": "LXDE n'est pas livré avec un verrouillage d'écran qui lui est propre. Consultez List of applications/Security#Screen lockers et #Démarrage automatique pour savoir comment les démarrer.\n\nL'icône Verrouillage d'écran exécute un script (situé à /usr/bin/lxlock) qui recherche un certain nombre de verrouillages d'écran bien connus et utilise le premier qu'il trouve pour verrouiller l'écran. Visitez lxlock sur GitHub.\n\n/etc/xdg/lxsession/LXDE/autostart (du paquet lxde-common) liste XScreenSaver qui sera lancé automatiquement.\n\nConsultez DPMS pour savoir comment contrôler l'écran de veille sans programme externe.\n\n"
    },
    {
      "title": "Icônes de LXPanel",
      "level": 3,
      "content": "Pour modifier les icônes par défaut des applications, consultez Desktop entries#Icons.\n\n"
    },
    {
      "title": "Menus du panneau LXPanel",
      "level": 3,
      "content": "Les menus du panneau peuvent être configurés dans /etc/xdg/menus/lxde-applications.menu selon le format xdg-menu pour fonctionner avec des applications d'autres sessions (notamment MATE) afin d'ajouter certaines des fonctionnalités qui manquent à LXDE.\n\n"
    },
    {
      "title": "Utiliser un gestionnaire de fenêtres différent",
      "level": 3,
      "content": "LXsession utilise le gestionnaire de fenêtres défini dans ~/.config/lxsession/LXDE/desktop.conf. (Openbox par défaut). Si ce fichier n'existe pas, il cherche dans /etc/xdg/lxsession/LXDE/desktop.conf à la place.\n\nRemplacez openbox-lxde dans l'un ou l'autre fichier par un gestionnaire de fenêtres de votre choix :\n\nPour metacity :\n\n```\nwindow_manager=metacity\n```\n\nPour compiz :\n\n```\nwindow_manager=compiz\n```\n\nVous pouvez également utiliser WM --replace comme défini dans #Démarrage automatique, où WM est le nom de l'exécutable du gestionnaire de fenêtres à démarrer. Cela signifie que openbox sera lancé en premier à chaque connexion et sera ensuite immédiatement remplacé. Notez qu'Openbox et LXDE ne partagent pas le même rc.xml et que les raccourcis clavier peuvent différer. Consultez xbindkeys.\n\n"
    },
    {
      "title": "Utilisation d'un compositeur",
      "level": 3,
      "content": "LXDE n'active pas la composition par défaut, ce qui peut entraîner des problèmes de «tearing». Ceux-ci peuvent être résolus au prix d'une certaine performance graphique en installant un compositeur, tel que picom.\n\n"
    },
    {
      "title": "LXPanel plante",
      "level": 3,
      "content": "Avec certains thèmes GTK, le lancement de lxpanel entraînera l'erreur suivante :\n\n```\nlxpanel: cairo-scaled-font.c:459: _cairo_scaled_glyph_page_destroy: Assertion `!scaled_font->cache_frozen' failed.\n```\n\nDans ce cas, installez ttf-dejavu.\n\nSi lxpanel se bloque lors de la navigation sur des pages web unicode particulières, installez ttf-droid.\n\n"
    },
    {
      "title": "Taille de l'icône de la barre des tâches de LXPanel",
      "level": 3,
      "content": "Les icônes des applications en cours d'exécution ne correspondent pas à la Taille des icônes définie dans Paramètres du panneau > Géométrie mais sont plus petites de 4px, ce qui rend certaines d'entre elles floues. Pour avoir des icônes claires de 32px dans la barre des tâches, la taille de l'icône doit être de 36px, ce qui rendrait floues les icônes du reste des applets actives du panneau. Pour contourner ce problème, créez des panneaux supplémentaires et faites en sorte qu'ils forment ensemble un seul panneau continu en ajustant l'alignement et la marge dans Panel Settings > Geometry.\n\n"
    },
    {
      "title": "Fausse transparence dans LXTerminal",
      "level": 3,
      "content": "Les versions récentes de la bibliothère VTE nécessitent un gestionnaire de fenêtre gérant la composition pour permettre la transparence de l'arrière-plan. La version GTK 2 de VTE, non maintenue, a une fausse transparence, où l'image de fond du bureau apparaît à travers le terminal. Si vous préférez la fausse transparence, la version GTK 2 de LXTerminal peut être installée avec le paquet lxterminal-gtk2AUR.\n\n"
    },
    {
      "title": "Les thèmes de LibreOffice ne fonctionnent pas",
      "level": 3,
      "content": "LXDE remplace la variable d'environnement SAL_USE_VCLPLUGIN utilisée pour applique des thèmes LibreOffice dans /usr/bin/startlxde. Changez la ligne dans ce fichier pour définir le thème. Bug en amont\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- LXDE (Sourceforge)\n- Forum LXDE\n\n"
    }
  ]
}