{
  "title": "LXDE (Русский)",
  "url": "https://wiki.archlinux.org/title/LXDE_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Среда рабочего стола\n- Экранный менеджер\n- Оконный менеджер\n- Openbox (Русский)\n- PCManFM (Русский)\n- LXDM (Русский)\n- LXQt (Русский)\n- Файловый менеджер#Монтирование\n\nLightweight X11 Desktop Environment: \"Одно из главных достоинств LXDE - небольшие требования к железу. Философия LXDE - это лёгкость, полезность и практичность.\"\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "LXDE модульный и вы можете выбирать только те пакеты, которые вам нужны.\n\nМинимально необходимые пакеты для запуска LXDE: lxde-common, lxsession и какой-нибудь оконный менеджер (например Openbox). Группа lxde содержит полное окружение рабочего стола.\n\n"
    },
    {
      "title": "Версия GTK 3",
      "level": 3,
      "content": "Экспериментальную сборку с GTK 3 можно установить с помощью группы lxde-gtk3.\n\nХотя в целом всё работает, есть известные проблемы с gpicview, lxappearance-obconf, lxlauncher и lxpanel.\n\n"
    },
    {
      "title": "Графическая форма входа",
      "level": 3,
      "content": "Стандартным экранным менеджером для LXDE является LXDM, он устанавливается как часть группы lxde. Смотрите также Экранный менеджер.\n\n"
    },
    {
      "title": "Консоль",
      "level": 3,
      "content": "Для использования команды startx необходимо добавить в файл ~/.xinitrc команду запуска LXDE:\n\n```\n~/.xinitrc\n```\n\n```\nexec startlxde\n```\n\nСмотрите также Автозапуск X при входе в систему.\n\n"
    },
    {
      "title": "Редактирование меню приложений",
      "level": 3,
      "content": "Меню приложений работает путём чтения .desktop файлов, расположенных в /usr/share/applications и ~/.local/share/applications/. Для добавления или изменения пунктов меню смотрите Ярлыки приложений. Сторонние редакторы меню вы можете найти в AUR - lxmedAUR. Также есть alacarte (GNOME), mozo (MATE) и т. д.\n\n"
    },
    {
      "title": "Автозапуск программ",
      "level": 3,
      "content": "LXDE реализует XDG Autostart. Сделать автозапуск программы можно:\n\n- Через .desktop файлы\n- Через LXSession\n\nКаждая строка в файле ~/.config/lxsession/LXDE/autostart представляет собой команду, которая будет выполнена. Если строка начинается с символа @, то указанная команда будет автоматически перезапущена, если она падает. Например, чтобы выполнить lxterminal и leafpad автоматически при запуске:\n\n```\n~/.config/lxsession/LXDE/autostart\n```\n\n```\n@lxterminal\n@leafpad\n```\n\nNote: **не нужно** \n\nСуществует также глобальный файл автозапуска /etc/xdg/lxsession/LXDE/autostart.\n\n"
    },
    {
      "title": "Горячие клавиши",
      "level": 3,
      "content": "Управление горячими клавишами осуществляется через Openbox и подробно описаны здесь[устаревшая ссылка 2024-10-12 ⓘ]. Пользователи LXDE должны следовать этим инструкциям, чтобы отредактировать файл ~/.config/openbox/lxde-rc.xml\n\nДополнительный графический интерфейс для редактирования горячих клавиш - obkeyAUR доступен в AUR. Поумолчанию obkey редактирует файл rc.xml, Но вы можете использовать его в LXDE таким образом:\n\n```\n$ obkey ~/.config/openbox/lxde-rc.xml\n```\n\nБольше информации о obkey здесь.\n\n"
    },
    {
      "title": "Курсоры",
      "level": 3,
      "content": "Основная статья: Темы курсора.\n\nlxappearance предоставляет графический интерфейс для изменения настроек внешнего вида, в том числе тем курсора. Настройки, изменённые через LXAppearance, записываются ~/.gtkrc-2.0, ~/.config/gtk-3.0/settings.ini и ~/.icons/default/index.theme Смотрите раздел Темы курсора#Настройка.\n\n"
    },
    {
      "title": "Апплет цифровых часов",
      "level": 3,
      "content": "Вы можете щёлкнуть правой кнопкой мыши апплет цифровых часов на панели и настроить отображение текущего времени в формате strftime. Подробнее смотрите strftime(3).\n\n"
    },
    {
      "title": "Настройка шрифтов",
      "level": 3,
      "content": "lxappearance-obconf изменяет настройки Openbox. Смотрите также Настройка шрифтов.\n\n"
    },
    {
      "title": "Раскладка клавиатуры",
      "level": 3,
      "content": "lxpanel предоставляет апплет раскладки клавиатуры. Смотрите Конфигурация клавиатуры в Xorg для базовых инструкций and #Автозапуск программ для автоматического запуска setxkbmap в LXDE.\n\n"
    },
    {
      "title": "Блокировка экрана",
      "level": 3,
      "content": "LXDE не имеет собственного блокировщика экрана. Вы можете установить сторонний блокировщик (смотрите List of applications/Security#Screen lockers) и добавить его в #Автозапуск программ.\n\nЗначок Screen Lock запускает скрипт (находящийся в /usr/bin/lxlock), который ищет один из известных блокировщиков экрана и запускает первый найденный. Смотрите lxlock на GitHub.\n\nВ файле /etc/xdg/lxsession/LXDE/autostart (из пакета lxde-common) прописан XScreenSaver, который будет запускаться автоматически.\n\nДля управления хранителем экрана без внешних программ смотрите DPMS.\n\n"
    },
    {
      "title": "Значки LXPanel",
      "level": 3,
      "content": "Для изменения значков приложений смотрите Ярлыки приложений#Значки.\n\n"
    },
    {
      "title": "Меню LXPanel",
      "level": 3,
      "content": "The panel's menus can be configured in /etc/xdg/menus/lxde-applications.menu as per the xdg-menu format to work with applications from other sessions (notably MATE) to add some of the function-ability that LXDE lacks.\n\n"
    },
    {
      "title": "Замена оконного менеджера",
      "level": 3,
      "content": "LXDE будет пытаться использовать оконный менеджер из пользовательского файла конфигурации lxsession ~/.config/lxsession/LXDE/desktop.conf. Если его не существует, будет пытаться использовать глобальный файл конфигурации /etc/xdg/lxsession/LXDE/desktop.conf.\n\nЗамените команду openbox-lxde на ваш менеджер окон:\n\n```\n[Session]\nwindow_manager=openbox-lxde\n```\n\nДля metacity:\n\n```\nwindow_manager=metacity\n```\n\nДля compiz:\n\n```\nwindow_manager=compiz\n```\n\nВ качестве альтернативы можно прописать в #Автозапуск программ команду WM --replace, где WM это название оконного менеджера для запуска. Это означает, что после логина сперва запустится openbox, но затем будет сразу заменён другим оконным менеджером. Имейте в виду, что Openbox и LXDE не ипользуют общий rc.xml и горячие клавиши могут различаться. Смотрите Xbindkeys (Русский).\n\n"
    },
    {
      "title": "Использование композитного менеджера",
      "level": 3,
      "content": "LXDE не включает композитинг по умолчанию, что может привести к появлению тиринга. Это можно исправить ценой небольшого падения производительности графики, установив какой-нибудь композитный менеджер, например picom.\n\n"
    },
    {
      "title": "NTFS с китайскими символами",
      "level": 3,
      "content": "Для использования файловой системы NTFS нужно установить пакет NTFS-3G. Как правило, PCManFM хорошо работает с NTFS, однако есть одна ошибка, влияющая на пользователей NTFS: если у вас есть файлы или каталоги, имена которых содержат нелатинские символы (например, китайские символы), могут исчезнуть при открытии (или автомонтировании) тома NTFS. Это происходит из-за того, что помощник монтирования lxsession неправильно анализирует политики и параметры локали. Для этого есть обходной путь:\n\nСоздайте Bash-скрипт /usr/local/bin/mount.ntfs-3g со следующим содержимым:\n\n```\n#!/bin/bash\n/usr/bin/ntfs-3g $1 $2 -o locale=en_US.UTF-8\n```\n\nИ сделайте его исполняемым:\n\n```\n# chmod +x /usr/local/bin/mount.ntfs-3g\n```\n\n"
    },
    {
      "title": "LXPanel падает",
      "level": 3,
      "content": "При использовании некоторых тем GTK запуск lxpanel может привести к такой ошибке:\n\n```\nlxpanel: cairo-scaled-font.c:459: _cairo_scaled_glyph_page_destroy: Assertion `!scaled_font->cache_frozen' failed.\n```\n\nВ таком случае установите ttf-dejavu.\n\nЕсли lxpanel падает при посещении некоторых юникодных веб-страниц, установите ttf-droid.\n\n"
    },
    {
      "title": "Размер значков на панели задач LXPanel",
      "level": 3,
      "content": "Значки запущенных приложений не соответствуют параметру Icon size, заданному в Panel Settings > Geometry, но на 4 пикселя меньше, что делает некоторые из них размытыми. Чтобы иметь чёткие 32-пиксельные значки на панели задач, установленный Icon size должен быть 36 пикселей, что приведёт к размытию значков остальных апплетов панели. Чтобы обойти это, создайте дополнительные панели и заставьте их выглядеть как одна непрерывная панель, отрегулировав выравнивание и отступ в Panel Settings > Geometry.\n\n"
    },
    {
      "title": "Ненастоящая прозрачность в LXTerminal",
      "level": 3,
      "content": "Последние версии виджета терминала VTE требуют композитный оконный менеджер для отображения полупрозрачного фона. Неподдерживаемая GTK2-версия VTE имеет ненастоящую прозрачность, в которой на фоне терминала просто рисуется кусочек фонового рисунка рабочего стола. Если вы предпочитаете ненастоящую прозрачность, можно установить GTK2-версию of LXTerminal с помощью пакета lxterminal-gtk2AUR.\n\n"
    },
    {
      "title": "Темы LibreOffice не работают",
      "level": 3,
      "content": "LXDE переопределяет переменную окружения SAL_USE_VCLPLUGIN, которую использует LibreOffice, в /usr/bin/startlxde. Чтобы выбрать тему, измените соответствующую строку в этом файле. Upstream bug\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- LXDE (Sourceforge)\n- Форум LXDE\n\n"
    }
  ]
}