{
  "title": "LXDE (Español)",
  "url": "https://wiki.archlinux.org/title/LXDE_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-03-04** \n\nArtículos relacionados\n\n- Desktop environment (Español)\n- Display manager (Español)\n- Window manager (Español)\n- Openbox (Español)\n- PCManFM\n- LXDM\n- LXQt\n- File manager functionality#Mounting\n\nTraducido desde la pagina del proyecto:\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "LXDE requiere que por lo menos este instalado lxde-common, lxsession y Openbox (u otro gestor de ventanas). El grupo lxde contiene el escritorio completo.\n\n"
    },
    {
      "title": "GTK 3 versión",
      "level": 3,
      "content": "Puede instalar una compilación experimental de LXDE con GTK 3 con el grupo lxde-gtk3.\n\nAunque funciona mayormente, hay problemas conocidos con gpicview, lxappearance-obconf, lxlauncher y lxpanel.\n\n"
    },
    {
      "title": "Inicio grafico",
      "level": 3,
      "content": "LXDM es el gestor de inicio por defecto de LXDE y es instalado como parte del grupo lxde. Vea también Display manager.\n\n"
    },
    {
      "title": "Consola",
      "level": 3,
      "content": "Para usar startx, añada a xinitrc:\n\n```\n~/.xinitrc\n```\n\n```\nexec startlxde\n```\n\nVea también Start X at login.\n\n"
    },
    {
      "title": "Editando el menú de aplicaciones",
      "level": 3,
      "content": "El menú de aplicaciones funciona indexando los archivos .desktop ubicados en /usr/share/applications/ y ~/.local/share/applications/. Para añadir o editar un ítem del menú, vea desktop entries. Puede encontrar editores de menús en el AUR (p.ej. lxmedAUR). También hay oficiales, como alacarte (gnome), mozo (mate), etc..\n\n"
    },
    {
      "title": "Inicio automático",
      "level": 3,
      "content": "LXDE Implementa XDG Autostart. Puede iniciar aplicaciones de manera automática de las siguientes maneras:\n\n- Con los archivos .desktop\n- A través de LXsession\n\nCada linea en ~/.config/lxsession/LXDE/autostart representa un comando que se va a ejecutar. Si la linea empieza con @, y el comando que la sigue falla, el comando es reejecutado automáticamente. Por ejemplo:\n\n```\n~/.config/lxsession/LXDE/autostart\n```\n\n```\n@lxterminal\n@leafpad\n```\n\nTambién hay un archivo de autoinicio global en /etc/xdg/lxsession/LXDE/autostart.\n\n"
    },
    {
      "title": "Atajos",
      "level": 3,
      "content": "Los atajos de teclado y ratón son implementados con Openbox. Los usuarios de LXDE deben seguir la wiki de Openbox[enlace roto 2024-10-12] (en inglés) para editar ~/.config/openbox/lxde-rc.xml.\n\nUna interfaz grafica opcional para editar los atajos es proveída por el paquete obkeyAUR. Aunque edita rc.xml por defecto, puede hacer que edite el archivo de configuración de LXDE así:\n\n```\n$ obkey ~/.config/openbox/lxde-rc.xml\n```\n\nVea [1] para más información.\n\n"
    },
    {
      "title": "Cursores",
      "level": 3,
      "content": "lxappearance es una herramienta grafica para cambiar el aspecto y estilo de GTK, incluyendo el tema del cursor. Los ajustes establecidos con LXAppearance son escritos en ~/.gtkrc-2.0, ~/.config/gtk-3.0/settings.ini y ~/.icons/default/index.theme. Vea también Temas del cursor.\n\n"
    },
    {
      "title": "Applet de reloj digital",
      "level": 3,
      "content": "Puede cambiar la forma en que se muestra la hora al presionar con el botón derecho del ratón y ocupando el formato strftime. Vea strftime(3) para los detalles.\n\n"
    },
    {
      "title": "Configuración de las fuentes",
      "level": 3,
      "content": "lxappearance-obconf establece la configuración de Openbox. Vea Configuración de fuentes.\n\n"
    },
    {
      "title": "Distribución del teclado",
      "level": 3,
      "content": "lxpanel incluye un applet de la distribución del teclado. Vea Keyboard configuration in Xorg para instrucciones genéricas, y #Inicio automático para iniciar setxkbmap automáticamente en LXDE.\n\n"
    },
    {
      "title": "Bloqueo de pantalla",
      "level": 3,
      "content": "LXDE no viene con su propio bloqueador de pantalla. Vea List of applications/Security (Español)#Aplicaciones para bloquear la pantalla e #Inicio automático para ver como iniciarlo.\n\nEl icono Screen Lock ejecuta un script (ubicado en /usr/bin/lxlock) que busca entre un numero de bloqueadores muy conocidos y ocupa el primero que encuentra para bloquear la pantalla. Vea lxlock en GitHub.\n\n/etc/xdg/lxsession/LXDE/autostart (de el paquete lxde-common) lista XScreenSaver, el que va a ser ejecutado automáticamente.\n\nVea DPMS para ver como controlar el salvapantallas sin programas externos.\n\n"
    },
    {
      "title": "Iconos de LXPanel",
      "level": 3,
      "content": "Los iconos que usa LXpanel por defecto están en /usr/share/pixmaps/ y cualquier icono personalizado debe guardarse ahí.\n\nPara camiar los iconos por defecto de las aplicaciones, vea Desktop entries.\n\n"
    },
    {
      "title": "Menú de LXPanel",
      "level": 3,
      "content": "El menú del panel puede ser configurado en /etc/xdg/menus/lxde-applications.menu siguiendo el formato xdg-menu para usarlo con las aplicaciones de otra sesión (notablemente MATE) para añadir alguna de la funcionalidad faltante de LXDE.\n\n"
    },
    {
      "title": "Usando un gestor de ventanas diferente",
      "level": 3,
      "content": "LXsession usa el gestor de ventanas definido en ~/.config/lxsession/LXDE/desktop.conf (por defecto Openbox). si este archivo no existe, busca en /etc/xdg/lxsession/LXDE/desktop.conf.\n\nReemplace openbox-lxde en cualquiera de los dos archivos con su gestor de ventanas deseado:\n\nPara usar metacity:\n\n```\nwindow_manager=metacity\n```\n\nPara usar compiz:\n\n```\nwindow_manager=compiz\n```\n\nAlternativamente use WM --replace como se define en #Inicio automático, donde WM e el nombre del gestor de ventanas a ejecutar. Esto significa que openbox va a ser ejecutado en cada inicio de sesión y va a ser reemplazado inmediatamente. Tome nota que Openbox y LXDE no comparten el mismo rc.xml y los atajos de teclado pueden diferir. Vea xbindkeys.\n\n"
    },
    {
      "title": "Usando un compositor",
      "level": 3,
      "content": "LXDE no tiene la composición habilitada por defecto, lo cual puede producir artefactos visuales. Estos pueden ser arreglados al costo de un poco de rendimiento grafico instalando un compositor, como picom.\n\n"
    },
    {
      "title": "Algunas aplicaciones no inician",
      "level": 3,
      "content": "GTK3 LXDE posee algunos problemas que pueden impedir que las aplicaciones se inicien (notablemente lxappearance). Hasta que esto sea arreglado, puede usar JWM para evitar la violación de acceso con gtk3:\n\n- Abra una terminal y ejecute jwm.\n- Puede que se produzca algún error grafico, pero ahora debería poder ejecutar la aplicación normalmente.\n- Cuando termine, vuelva a iniciar sesión para reiniciar el escritorio.\n\n"
    },
    {
      "title": "NTFS con caracteres chinos",
      "level": 3,
      "content": "Para usar un dispositivo de almacenamiento con un sistema de archivos NTFS, tiene que instalar el paquete NTFS-3G.Generalmente, PCManFM funciona bien con sistemas de archivos NTFS, aunque hay un bug que afecta a los que usan NTFS en el que si se tiene archivos o directorios en un sistema de archivos NTFS, el nombre de los que tienen caracteres no latinos (p.ej. caracteres chinos) puede desaparecer al abrir (o auto-montar) el volumen NTFS. Esto sucede porque el asistente de montado de lxsession no esta interpretando las políticas y opciones de locales correctamente. Puede solucionarlo temporalmente así:\n\nCree un /usr/local/bin/mount.ntfs-3g nuevo con un script de Bash que contenga:\n\n```\n#!/bin/bash\n/usr/bin/ntfs-3g $1 $2 -o locale=en_US.UTF-8\n```\n\nY hágalo ejecutable:\n\n```\n# chmod +x /usr/local/bin/mount.ntfs-3g\n```\n\n"
    },
    {
      "title": "LXPanel falla",
      "level": 3,
      "content": "Con algunos temas para GTK, al iniciar lxpanel se produce el siguiente error:\n\n```\nlxpanel: cairo-scaled-font.c:459: _cairo_scaled_glyph_page_destroy: Assertion `!scaled_font->cache_frozen' failed.\n```\n\nEn este caso, instale ttf-dejavu.\n\nSi lxpanel falla cuando se navegan ciertas paginas con caracteres unicode, instale ttf-droid.\n\n"
    },
    {
      "title": "Arreglar el tamaño de los iconos de la barra de tareas LXPanel",
      "level": 3,
      "content": "Los iconos de las aplicaciones ejecutándose no son del Icon size establecido en Panel Settings > Geometry, si no que son 4px más pequeños lo que hace que algunos estén borrosos. Para que los iconos midan 32px y no se vean borrosos, Icon size debe estar establecido a 36px en la barra de tareas, esto hará que los iconos de los applets en el panel estén borrosos. Para arreglarlo, cree paneles adicionales y ubiquelos para que parezcan un solo panel ajustando la alineación y el margen en Panel Settings > Geometry.\n\n"
    },
    {
      "title": "Transparencia falsa en LXTerminal",
      "level": 3,
      "content": "La ultima versión de la librería de widgets de VTE requiere un gestor de ventanas compositor para el fondo transparente. La versión no mantenida de VTE GTK2 tiene transparencia falsa, donde la imagen de fondo de pantalla se muestra a través de la terminal. Si prefiere la transparencia falsa, puede instalar la versión GTK 2 de LXTerminal con el paquete lxterminal-gtk2AUR.\n\n"
    },
    {
      "title": "No se le puede cambiar el tema a LibreOffice",
      "level": 3,
      "content": "LXDE cambia la variable de entorno SAL_USE_VCLPLUGIN que es usada para establecer el tema de LibreOffice en /usr/bin/startlxde. Cambie esa linea en el archivo para cambiar el tema. Reporte del bug.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Guiá de LXDE para Linux\n- LXDE (Sourceforge)\n- Foros de LXDE\n\n"
    }
  ]
}