{
  "title": "LXDM (Русский)",
  "url": "https://wiki.archlinux.org/title/LXDM_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- LXDE\n- Display manager (Русский)\n\nLXDM - это легкий экранный менеджер для lxde. Пользовательский интерфейс реализован с помощью GTK+ 2.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите lxdm или lxdm-gitAUR[ссылка недействительна: package not found]. Затем, включите lxdm.service для автоматического запуска при загрузке системы.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Конфигурационные файлы для lxdm расположены в /etc/lxdm/. Основной файл конфигурации - lxdm.conf. Другой файл Xsession - это системный файл конфигурации сеанса х и обычно не редактируется. Другими файлами в этой папке являются все сценарии оболочки, которые запускаются, когда в lxdm происходят определенные изменения:\n\n1. LoginReady выполняется с привилегиями root, когда lxdm готов показать окно входа в систему.\n1. PreLogin запускается как root, прежде чем регистрировать пользователя.\n1. PostLogin запускается как зарегистрированный пользователь сразу после его входа в систему.\n1. PostLogout запускается как зарегистрированный пользователь сразу после его выхода из системы.\n1. PreReboot запускается как root перед перезагрузкой с lxdm.\n1. PreShutdown запускается как root до отключения питания с помощью lxdm.\n\n"
    },
    {
      "title": "Сеанс по умолчанию",
      "level": 3,
      "content": "Можно указать, какой сеанс будет загружен, когда пользователи выбирают сеанс по умолчанию из списка. Обратите внимание, что пользовательский параметр предпочитает глобальные настройки.\n\n"
    },
    {
      "title": "Глобальные настройки",
      "level": 3,
      "content": "Отредактируйте /etc/lxdm/lxdm.conf изменив эту директиву, установив нужный сеанс или DE:\n\n```\nsession=/usr/bin/startlxde\n```\n\nПример для использования Xfce:\n\n```\nsession=/usr/bin/startxfce4\n```\n\nПример для использования Openbox:\n\n```\nsession=/usr/bin/openbox-session\n```\n\nПример для использования GNOME:\n\n```\nsession=/usr/bin/gnome-session\n```\n\nЭто полезно для тем, у которых нет видимого окна выбора сеанса, и при возникновении проблем с использованием автологина.\n\n"
    },
    {
      "title": "Настройки пользователя",
      "level": 3,
      "content": "Чтобы определить предпочтительный сеанс для каждого пользователя, просто отредактируйте ~/.dmrc. Пример: пользователь1 хочет использовать xfce4, пользователь2 Cinnamon, а пользователь3 GNOME:\n\nПользователь1:\n\n```\n[Desktop]\nSession=xfce\n```\n\nПользователь2:\n\n```\n[Desktop]\nSession=cinnamon\n```\n\nПользователь3:\n\n```\n[Desktop]\nSession=gnome\n```\n\n"
    },
    {
      "title": "Автоматический вход в систему",
      "level": 3,
      "content": "Для автоматического входа в систему отредактируйте соответствующую директиву в /etc/lxdm/lxdm.conf:\n\n```\n#autologin=dgod\n```\n\n"
    },
    {
      "title": "Последние используемые опции",
      "level": 3,
      "content": "Lxdm хранит информацию о последних используемых опциях в:\n\n```\n/var/lib/lxdm/lxdm.conf\n```\n\n```\n[base]\nlast_session=/usr/share/xsessions/xfce.desktop\nlast_lang=\nlast_langs=ru_RU.UTF-8\n```\n\n"
    },
    {
      "title": "Добавление пользовательских иконок",
      "level": 3,
      "content": "Пользовательский значок 96x96 px (jpg или png) может быть дополнительно отображен на экране входа в систему. Просто скопируйте нужное изображение в $HOME/.face. Пакет gnome-control-center предоставляет некоторые значки по умолчанию, подходящие для lxdm. Посмотрите в /usr/share/pixmaps/faces после установки этого пакета.\n\n"
    },
    {
      "title": "Одновременные пользователи и их переключение",
      "level": 3,
      "content": "LXDM позволяет одновременно регистрировать нескольких пользователей в разных tty. Следующая команда используется, чтобы позволить другому пользователю войти в систему, не отключая текущего:\n\n```\n$ lxdm -c USER_SWITCH\n```\n\n"
    },
    {
      "title": "Темы",
      "level": 3,
      "content": "Темы LXDM расположены в /usr/share/lxdm/themes. Существует только одна тема, предоставляемая LXDM, а именно Industrial. Чтобы отобразить фоновое изображение, содержащееся в файле wave.svg темы, убедитесь, что вы установили librsvg.\n\nПакет lxdm-themesAUR предоставляет 6 дополнительных тем. Archlinux, ArchlinuxFull, ArchlinuxTop, Arch-Dark, Arch-Stripes и IndustrialArch. Темы ArchStripes и ArchDark также доступны в lxdm-gitAUR[ссылка недействительна: package not found] (с другими названиями, чтобы избежать конфликтов).\n\nВы можете изменить тему в /etc/lxdm/lxdm.conf:\n\n```\n## the theme of greeter\ntheme=theme_name\n```\n\nLXDM также можно настроить для использования темы GTK (сохраненной в /usr/share/themes) в указанном файле конфигурации:\n\n```\n## GTK theme\ngtk_theme=gtk_theme_name\n```\n\n"
    },
    {
      "title": "Расширенные настройки сеанса",
      "level": 3,
      "content": "После входа в систему LXDM будет загружать все следующие файлы (загруженные по порядку сверху):\n\n1. /etc/profile\n1. ~/.profile\n1. /etc/xprofile\n1. ~/.xprofile\n\nЭти файлы могут использоваться для запуска служб, которые должны устанавливать определенные переменные среды, чтобы клиенты могли использовать эту службу, например, ssh-agent. Подробнее см Xprofile. Обратите внимание, что LXDM не читает ~/.xinitrc, поэтому для тех, кто переходит от DM, который использует этот файл, например SLiM, придется перемещать свои настройки в другое место (например, ~/.xprofile). Также обратите внимание, что LXDM не читает ~/.bash_profile. Если вы все еще хотите использовать файл ~/.xinitrc, вы можете добавить строку в файл события /etc/lxdm/PostLogin:\n\n```\nsource ~/.xinitrc\n```\n\nLXDM также использует Xresources, Xkbmap, и Xmodmap. Подробнее о файлах пользовательских настроек см /etc/lxdm/Xsession.\n\n"
    },
    {
      "title": "Исправление проблемы с черным фоном",
      "level": 3,
      "content": "Когда LXDM использует тему Industrial, а фоновое изображение установлено на черный, может происходить мигание до запуска LXDM. Это вызвано свойством bg_color выбранной темы. Чтобы этого избежать замените тему по умолчанию на темную (Например gtk_theme=Adwaita-dark).\n\n"
    }
  ]
}