{
  "title": "LXDM (Français)",
  "url": "https://wiki.archlinux.org/title/LXDM_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- LXDE (Français)\n- Display manager (Français)\n\nLXDM est un gestionnaire d'affichage léger pour l'environnement de bureau LXDE.\n\nLXDM ne prend pas en charge le protocole XDMCP. Une alternative qui le fait est LightDM.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet lxdm, ou lxdm-gtk3 pour la version GTK3. Le paquet de développement est lxdm-gitAUR[broken link: package not found].\n\nActivez l'unité lxdm.service fournie pour démarrer LXDM au démarrage.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Les fichiers de configuration de LXDM sont tous situés dans /etc/lxdm/. Le principal fichier de configuration est lxdm.conf. Son format est documenté dans ses commentaires. Un autre fichier, Xsession, est le fichier de configuration de la session x pour l'ensemble du système et ne doit généralement pas être modifié. Tous les autres fichiers de ce répertoire sont des scripts shell, qui sont exécutés lorsque certains événements se produisent dans LXDM.\n\nIl s'agit de :\n\n1. LoginReady est exécuté avec les privilèges de root lorsque LXDM est prêt à afficher la fenêtre de connexion.\n1. PreLogin est exécuté en tant que root avant de connecter un utilisateur.\n1. PostLogin est exécuté en tant qu'utilisateur connecté juste après la connexion.\n1. PostLogout est exécuté en tant qu'utilisateur connecté juste après sa déconnexion.\n1. PreReboot est exécuté en tant que root avant le redémarrage avec LXDM.\n1. PreShutdown est exécuté en tant que root avant la mise hors tension avec LXDM.\n\n"
    },
    {
      "title": "Session par défaut",
      "level": 3,
      "content": "La session par défaut peut être définie globalement, ainsi qu'au niveau d'un utilisateur individuel. Les préférences individuelles des utilisateurs ont la priorité sur les préférences définies globalement pour l'utilisateur en question.\n\n"
    },
    {
      "title": "Globalement",
      "level": 4,
      "content": "Modifiez /etc/lxdm/lxdm.conf et changez la ligne de session en n'importe quelle session ou DE souhaitée :\n\n```\nsession=/usr/bin/startlxde\n```\n\nExemple utilisant Xfce :\n\n```\nsession=/usr/bin/startxfce4\n```\n\nExemple d'utilisation de Openbox :\n\n```\nsession=/usr/bin/openbox-session\n```\n\nExemple d'utilisation de GNOME :\n\n```\nsession=/usr/bin/gnome-session\n```\n\nCeci est utile pour les thèmes qui n'ont pas de boîte de sélection de session visible, et si vous avez des difficultés à utiliser l'authentification.\n\n"
    },
    {
      "title": "Par utilisateur",
      "level": 4,
      "content": "Pour définir la session préférée d'un utilisateur, il suffit de modifier son ~/.dmrc respectif pour définir la sélection.\n\nExemple : l'utilisateur 1 veut Xfce4, l'utilisateur 2 veut Cinnamon, et l'utilisateur 3 veut GNOME :\n\nPour l'utilisateur 1 :\n\n```\n[Bureau]\nSession=xfce\n```\n\nPour l'utilisateur 2 :\n\n```\n[Bureau]\nSession=cinnamon\n```\n\nPour l'utilisateur 3 :\n\n```\n[Bureau]\nSession=gnome\n```\n\nLa liste des sessions installées peut être affichée en utilisant la commande :\n\n```\n$ ls /usr/share/xsessions/\n```\n\n"
    },
    {
      "title": "Autologin",
      "level": 3,
      "content": "Pour se connecter à un compte automatiquement au démarrage, sans fournir de mot de passe, trouvez la ligne dans /etc/lxdm/lxdm.conf qui ressemble à ceci :\n\n```\n#autologin=dgod\n```\n\nDécommentez-la, en remplaçant dgod par l'utilisateur cible.\n\n"
    },
    {
      "title": "Options utilisées précédemment",
      "level": 3,
      "content": "Les options LXDM précédemment utilisées peuvent être trouvées dans :\n\n```\n/var/lib/lxdm/lxdm.conf\n```\n\n```\n[base]\nlast_session=/usr/share/xsessions/LXDE.desktop\nlast_lang=sv_SE.UTF-8\nlast_langs=sv_SE.UTF-8 fa_IR.UTF-8 en_US.UTF-8\n```\n\n"
    },
    {
      "title": "Ajout d'icônes de visage",
      "level": 3,
      "content": "Une image de 96x96 px (jpg ou png) peut optionnellement être affichée par utilisateur, remplaçant l'icône de base. Copiez ou faites un lien symbolique de l'image cible vers $HOME/.face. Le paquet gnome-control-center fournit quelques icônes par défaut adaptées à l'écran LXDM. Regardez sous /usr/share/pixmaps/faces après avoir installé ce paquet.\n\n- Les utilisateurs n'ont pas besoin de garder gnome-control-center installé pour utiliser les icônes de visage. Installez-le, copiez les images ailleurs, puis supprimez-le.\n- Le répertoire personnel de l'utilisateur doit avoir des droits r-x pour les autres et le fichier .face doit avoir des droits r-- pour les autres. Cela peut être indésirable du point de vue de la sécurité et de l'accès si votre système a d'autres utilisateurs : cela signifie que n'importe qui d'autre peut parcourir votre répertoire personnel.\n- Un outil graphique lxdm-config fourni avec lxdm peut être utilisé pour placer un fichier .face dans le répertoire personnel, avec d'autres configurations.\n\n"
    },
    {
      "title": "Utilisateurs simultanés et changement d'utilisateur",
      "level": 3,
      "content": "LXDM permet à plusieurs utilisateurs d'être connectés à différents TTYs simultanément. La commande suivante est utilisée pour permettre à un autre utilisateur de se connecter sans déconnecter l'utilisateur actuel :\n\n```\n$ lxdm -c USER_SWITCH\n```\n\n"
    },
    {
      "title": "Thèmes",
      "level": 3,
      "content": "Les thèmes de LXDM sont situés dans /usr/share/lxdm/themes.\n\nIl n'y a qu'un seul thème fourni avec LXDM : Industrial. Pour afficher le fichier de fond wave.svg qui fait partie de ce thème, installez librsvg.\n\nlxdm-themesAUR fournit 6 thèmes supplémentaires : Archlinux, ArchlinuxFull, ArchlinuxTop, Arch-Dark, Arch-Stripes et IndustrialArch. Les thèmes ArchStripes et ArchDark sont également empaquetés avec lxdm-gitAUR[broken link: package not found] (avec des noms différents pour éviter les conflits de fichiers).\n\nLe choix du thème est configurable dans /etc/lxdm/lxdm.conf :\n\n```\n## the theme of greeter\ntheme=theme_name\n```\n\nVous pouvez également configurer LXDM pour utiliser un thème GTK (stocké dans /usr/share/themes) dans /etc/lxdm/lxdm.conf :\n\n```\n## GTK theme\ngtk_theme=gtk_theme_name\n```\n\n"
    },
    {
      "title": "Configuration avancée de la session",
      "level": 3,
      "content": "Après qu'un utilisateur se soit connecté, LXDM source tous les fichiers suivants, dans l'ordre ci-dessous :\n\n1. /etc/profile\n1. ~/.profile\n1. /etc/xprofile\n1. ~/.xprofile\n\nCes fichiers peuvent être utilisés pour définir les variables d'environnement de la session et pour démarrer des services qui doivent définir certaines variables d'environnement pour que les clients de la session puissent utiliser le service, comme ssh-agent. Consultez Xprofile pour plus de détails.\n\nNotez que LXDM ne source pas ~/.xinitrc, donc ceux qui migrent depuis un DM qui utilise ce fichier, comme SLiM, devront déplacer leurs paramètres ailleurs - probablement ~/.xprofile. Notez également que LXDM ne source pas non plus ~/.bash_profile.\n\nSi vous voulez toujours utiliser votre fichier ~/.xinitrc, vous pouvez ajouter une ligne au fichier d'événements /etc/lxdm/PostLogin :\n\n```\nsource ~/.xinitrc\n```\n\nLXDM utilise également .Xresources, .Xkbmap, et .Xmodmap. Consultez /etc/lxdm/Xsession pour plus de détails sur la façon dont LXDM utilise des fichiers de configuration pour l'ensemble du système et par utilisateur pour configurer la session. [1]\n\n"
    },
    {
      "title": "Flash blanc",
      "level": 3,
      "content": "Lors de l'utilisation du theme=Industrial LXDM par défaut et d'une image d'arrière-plan sombre (par exemple, bg=/usr/share/backgrounds/img.png), il peut y avoir un court flash blanc avant le démarrage de LXDM. Ceci est dû à la propriété bg_color: du thème GTK sélectionné. Pour éviter cela, remplacez gtk_theme=Adwaita par gtk_theme=Adwaita-dark ou par un autre thème sombre.\n\n"
    },
    {
      "title": "Problème de déconnexion",
      "level": 3,
      "content": "Si vous avez eu des problèmes pour vous déconnecter en utilisant LXDM (par exemple, blocage, blocage de l'affichage, etc.), essayez de décommenter l'option reset=1 dans /etc/lxdm/lxdm.conf pour rafraîchir xserver à chaque déconnexion.\n\n"
    }
  ]
}