{
  "title": "LXDM (Italiano)",
  "url": "https://wiki.archlinux.org/title/LXDM_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- LXDE\n- Display manager\n\nLXDM is a lightweight display manager for the LXDE desktop environment.\n\nLXDM does not support the XDMCP protocol. An alternative that does is LightDM.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the lxdm package, or lxdm-gtk3 for the GTK3 version.\n\nEnable the provided lxdm.service unit to start LXDM at boot.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The configuration files for LXDM are all located in /etc/lxdm/. The main configuration file is lxdm.conf. Its format is documented in its comments. Another file, Xsession, is the systemwide x session configuration file and should generally not be edited. All other files in this directory are shell scripts, which are run when certain events happen in LXDM.\n\nThese are:\n\n1. LoginReady is executed with root privileges when LXDM is ready to show the login window.\n1. PreLogin is run as root before logging a user in.\n1. PostLogin is run as the logged-in user right after they have logged in.\n1. PostLogout is run as the logged-in user right after they have logged out.\n1. PreReboot is run as root before rebooting with LXDM.\n1. PreShutdown is run as root before poweroff with LXDM.\n\n"
    },
    {
      "title": "Default session",
      "level": 3,
      "content": "The default session can be set globally, as well as set at an individual-user level. Individual user preferences take precedence over globally set preferences for the user in question.\n\n"
    },
    {
      "title": "Globally",
      "level": 4,
      "content": "Edit /etc/lxdm/lxdm.conf and change the session line to whatever session or DE is desired:\n\n```\nsession=/usr/bin/startlxde\n```\n\nExample using Xfce:\n\n```\nsession=/usr/bin/startxfce4\n```\n\nExample using Openbox:\n\n```\nsession=/usr/bin/openbox-session\n```\n\nExample using GNOME:\n\n```\nsession=/usr/bin/gnome-session\n```\n\nThis is useful for themes that have no visible session selection box, and if experiencing trouble using autologin.\n\n"
    },
    {
      "title": "Per user",
      "level": 4,
      "content": "To define an individual user's preferred session, simply edit their respective ~/.dmrc to define the selection.\n\nExample: user1 wants Xfce4, user2 wants Cinnamon, and user3 wants GNOME:\n\nFor user1:\n\n```\n[Desktop]\nSession=xfce\n```\n\nFor user2:\n\n```\n[Desktop]\nSession=cinnamon\n```\n\nFor user3:\n\n```\n[Desktop]\nSession=gnome\n```\n\nThe list of installed sessions can be displayed by using command:\n\n```\n$ ls /usr/share/xsessions/\n```\n\n"
    },
    {
      "title": "Autologin",
      "level": 3,
      "content": "To log in to one account automatically on startup, without providing a password, find the line in /etc/lxdm/lxdm.conf that looks like this:\n\n```\n#autologin=dgod\n```\n\nUncomment it, substituting the target user instead of dgod.\n\n"
    },
    {
      "title": "Last used options",
      "level": 3,
      "content": "Previously used LXDM options can be found in:\n\n```\n/var/lib/lxdm/lxdm.conf\n```\n\n```\n[base]\nlast_session=/usr/share/xsessions/LXDE.desktop\nlast_lang=sv_SE.UTF-8\nlast_langs=sv_SE.UTF-8 fa_IR.UTF-8 en_US.UTF-8\n```\n\n"
    },
    {
      "title": "Adding face icons",
      "level": 3,
      "content": "A 96x96 px image (jpg or png) can optionally be displayed on a per-user basis, replacing the stock icon. Copy or symlink the target image to $HOME/.face. The gnome-control-center package supplies some default icons suitable for the lxdm screen. Look under /usr/share/pixmaps/faces after installing that package.\n\n- Users need not keep gnome-control-center installed to use face icons. Install it, copy the images elsewhere, and remove it.\n- The user home directory must have r-x permissions for others and the .face file must have r-- permissions for others. This may be undesirable from a security and access perspective if your system has other users: it means anyone else can browse your home directory.\n- A graphical tool lxdm-config shipped with lxdm can be used to place a .face file in the home directory, along with other configuration.\n\n"
    },
    {
      "title": "Simultaneous users and switching users",
      "level": 3,
      "content": "LXDM allows multiple users to be logged into different TTYs simultaneously. The following command is used to allow another user to log in without logging out the current user:\n\n```\n$ lxdm -c USER_SWITCH\n```\n\n"
    },
    {
      "title": "Themes",
      "level": 3,
      "content": "The LXDM themes are located in /usr/share/lxdm/themes.\n\nThere is only one theme provided with LXDM: Industrial. To display the background file wave.svg which is part of this theme, install librsvg.\n\nlxdm-themesAUR provides 6 extra themes: Archlinux, ArchlinuxFull, ArchlinuxTop, Arch-Dark, Arch-Stripes, and IndustrialArch.\n\nChoice of theme is configurable in /etc/lxdm/lxdm.conf:\n\n```\n## the theme of greeter\ntheme=theme_name\n```\n\nYou can also configure LXDM to use a GTK theme (stored in /usr/share/themes) in /etc/lxdm/lxdm.conf:\n\n```\n## GTK theme\ngtk_theme=gtk_theme_name\n```\n\n"
    },
    {
      "title": "Advanced Session Configuration",
      "level": 3,
      "content": "After a user logs on, LXDM sources all of the following files, in the below order:\n\n1. /etc/profile\n1. ~/.profile\n1. /etc/xprofile\n1. ~/.xprofile\n\nThese files can be used to set session environment variables and to start services which must set certain environment variables in order for clients in the session to be able to use the service, like ssh-agent. See Xprofile for details.\n\nNote that LXDM does not source ~/.xinitrc, so those migrating from a DM that does use this file, like SLiM, will have to move their settings elsewhere — probably ~/.xprofile. Also note LXDM does not source ~/.bash_profile.\n\nIf you still want to use your ~/.xinitrc file, you can add a line to the /etc/lxdm/PostLogin event file:\n\n```\nsource ~/.xinitrc\n```\n\nLXDM also makes use of .Xresources, .Xkbmap, and .Xmodmap. See /etc/lxdm/Xsession for details on how LXDM uses system-wide and per-user configuration files to configure the session.[1]\n\n"
    },
    {
      "title": "White flash",
      "level": 3,
      "content": "When using the default LXDM theme=Industrial and a dark background image (e.g. bg=/usr/share/backgrounds/img.png) there may be a short bright flash before LXDM starts. This is caused by the bg_color: property of the selected GTK theme. To avoid this change gtk_theme=Adwaita to gtk_theme=Adwaita-dark or to another dark theme.\n\n"
    },
    {
      "title": "Logout Issue",
      "level": 3,
      "content": "If you had trouble logging out when using lxdm (e.g. stuck, display freeze, etc..) try uncomment the reset=1 option in /etc/lxdm/lxdm.conf to refresh xserver on every logout.\n\n"
    }
  ]
}