{
  "title": "LXQt (Français)",
  "url": "https://wiki.archlinux.org/title/LXQt_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- LXDE (Français)\n- Desktop environment\n- Window manager (Français)\n\nDébut 2013, Hong Jen Yee \"PCMan\" a commencé à porter les composants de LXDE vers Qt. La première préversion de LXDE-Qt a été publiée le 3 juillet 2013. Le 21 juillet, il a été annoncé que Razor-qt (un bureau de conception similaire à LXDE) et LXDE fusionnaient.\n\nLe résultat est LXQt, un bureau construit sur Qt qui utilise en partie des composants de Razor-qt et LXDE. Bien que le développement soit principalement axé sur LXQt, la version GTK 2 de LXDE sera également maintenue.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Tout d'abord, installez et configurez Xorg. Ensuite, installez le groupe lxqt et un thème d'icônes (par exemple, breeze-icons ou oxygen-icons).\n\nPour des fonctionnalités supplémentaires, vous pouvez installer les éléments suivants :\n\n- L'applet de Connman pour LXQt — Applet de ConnMan pour LXQt.\n\n- nm-tray — Une interface simple basé sur Qt pour NetworkManager.\n\n- SDDM — Le gestionnaire d'affichage recommandé pour LXQt.\n\n- Un logiciel de verrouillage d'écran, si nécessaire. Par exemple, slock ou XScreenSaver. Les deux s'intègrent à bien LXQt, d'autres peuvent aussi être adaptés. Si vous utilisez LightDM comme gestionnaire d'affichage, vous pouvez utiliser light-locker. Si vous voulez désactiver le verrouillage de l'écran lors de la suspension/veille, modifiez la case à cocher LXQt > Préférences > Paramètres de LXQt > Paramètres de session > Verrouiller l'écran avant la suspension/veille. Astuce: LXQt utilise xdg-screensaver de xdg-utils pour le verrouillage de l'écran qui ne fonctionne qu'avec XScreenSaver et xautolockAUR dans la session LXQt. Vous pouvez l'utiliser seul ou avec un autre verrou d'écran. Par exemple, avec slock, vous pouvez suivre slock#Lock on suspend ainsi qu'installer le patch xdg-utils-slockAUR pour obtenir le résultat attendues par LXQt. Pour betterlockscreenAUR installez xdg-utils-betterlockscreenAUR[broken link: package not found].\n- Vous pouvez maintenant éditer ~/.config/lxqt/lxqt.conf et ajouter l'économiseur d'écran de votre choix, plus besoin de xautolock, par exemple pour utiliser i3lock ajoutez ce qui suit:\n\n- Si vous utilisez LightDM comme gestionnaire d'affichage, vous pouvez utiliser light-locker.\n- Si vous voulez désactiver le verrouillage de l'écran lors de la suspension/veille, modifiez la case à cocher LXQt > Préférences > Paramètres de LXQt > Paramètres de session > Verrouiller l'écran avant la suspension/veille. Astuce: LXQt utilise xdg-screensaver de xdg-utils pour le verrouillage de l'écran qui ne fonctionne qu'avec XScreenSaver et xautolockAUR dans la session LXQt. Vous pouvez l'utiliser seul ou avec un autre verrou d'écran. Par exemple, avec slock, vous pouvez suivre slock#Lock on suspend ainsi qu'installer le patch xdg-utils-slockAUR pour obtenir le résultat attendues par LXQt. Pour betterlockscreenAUR installez xdg-utils-betterlockscreenAUR[broken link: package not found].\n\n```\n[Screensaver]\nlock_command=i3lock\n```\n\n- Pour la prise en charge audio, consultez General recommendations (Français)#Système son.\n- Certains plugins de panneau LXQt nécessitent des paquets supplémentaires pour fonctionner, vérifiez le dépendances optionnelles pour lxqt-panel.\n\n"
    },
    {
      "title": "Utilisation de xinit",
      "level": 3,
      "content": "Ajoutez la ligne suivante à Xinitrc :\n\n```\n~/.xinitrc\n```\n\n```\nexec startlxqt\n```\n\n"
    },
    {
      "title": "Connexion graphique",
      "level": 3,
      "content": "Choisissez LXQt Desktop dans le menu du gestionnaire d'affichage de votre choix.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "LXQt en général essaie de fournir des interfaces graphiques pour changer ses paramètres. Les fichiers de configuration se trouvent dans ~/.config/lxqt. Ce répertoire est initialisé automatiquement. La configuration par défaut pour les nouveaux utilisateurs se trouve dans /usr/share/lxqt.\n\n"
    },
    {
      "title": "Luminosité de l'écran",
      "level": 3,
      "content": "Si vous constatez que LXQt utilise le contrôle du contraste de l'écran au lieu du contrôle de la luminosité de l'écran pour les raccourcis clavier de la luminosité de l'écran, vous pouvez changer la commande pour utiliser xbacklight à la place sous le centre de configuration LXQt > touches de raccourci\n\n```\nxbacklight -inc 10\nxbacklight -dec 10\n```\n\nSi vous utilisez le pilote Intel kernel modesetting, xbacklight ne fonctionnera pas, mais vous pouvez utiliser la commande suivante à la place\n\n```\npkexec lxqt-backlight_backend --inc\npkexec lxqt-backlight_backend --dec\n```\n\nVous devrez peut-être créer deux scripts pour l'augmentation et la diminution de la luminosité de l'écran et faire pointer le raccourci clavier vers le chemin des scripts pour que cela fonctionne.\n\nUne autre façon de modifier la luminosité de l'écran est d'utiliser brightnessctl\n\n```\nbrightnessctl -d intel_backlight set +5%\nbrightnessctl -d intel_backlight set 5%-\n```\n\n"
    },
    {
      "title": "Widgets du panneau",
      "level": 3,
      "content": "Si vous ne pouvez pas ajouter les widgets CPU et Statistiques système au panneau, assurez-vous que libstatgrab et libsysstat sont installés.\n\n"
    },
    {
      "title": "Utiliser un autre gestionnaire de fenêtres",
      "level": 3,
      "content": "Bien que Openbox soit le gestionnaire de fenêtres par défaut pour LXQt, vous pouvez spécifier un gestionnaire de fenêtres différent à utiliser avec LXQt via Session Settings, lxqt-config-session ; ou en éditant ~/.config/lxqt/session.conf. Modifiez la ligne suivante :\n\n```\nwindow_manager=openbox\n```\n\nen un gestionnaire de fenêtres de votre choix :\n\n```\nwindow_manager=votre_gestionnaire_de_fenêtres.\n```\n\n"
    },
    {
      "title": "Démarrage automatique",
      "level": 3,
      "content": "Pour que les applications X démarrent à la connexion, cliquez sur le menu principal de LXQt > Préférences > Paramètres LXQt > Paramètres de session. On peut aussi le lancer avec :\n\n```\n$ lxqt-config-session\n```\n\nDans cette fenêtre, cliquez sur AutoStart sur le côté gauche. Ici, vous pouvez ajouter une nouvelle application au démarrage automatique global (lancé dans toutes les sessions implémentant la spécification XDG Autostart) ou à votre démarrage automatique local (appelé LXQt Autostart) (Consultez le bug 746 lié à cette option). Pour chaque élément que vous ajoutez, lxqt-config-session créera une entrée de bureau (fichier .desktop) dans le répertoire XDG Autostart approprié.\n\nLa distinction entre \"Global Autostart\" et \"LXQt Autostart\" ne dépend pas du répertoire dans lequel se trouve le fichier .desktop correspondant, mais plutôt du paramètre OnlyShowIn. S'il est OnlyShowIn=true, il est considéré comme un \"LXQt Autostart\". En outre, si X-LXQt-Module=true, l'élément n'est pas affiché dans lxqt-config-session.\n\n"
    },
    {
      "title": "Variables d'environnement de configuration",
      "level": 3,
      "content": "Les variables d'environnement pour la session LXQt peuvent être définies dans les paramètres de la session.\n\n"
    },
    {
      "title": "Modification du menu de l'application",
      "level": 3,
      "content": "Il est possible de modifier les entrées du menu en éditant leurs fichiers .desktop stockés dans les fichiers /usr/share/applications/lxqt-*.desktop. Consultez Desktop entries.\n\n"
    },
    {
      "title": "Compositeur d'écran",
      "level": 3,
      "content": "Vous pouvez ajouter un compositeur comme picom à démarrer automatiquement avec une commande comme la suivante\n\n```\npicom --vsync -r 12 --no-fading-openclose -b\n```\n\n"
    },
    {
      "title": "Personnaliser Leave",
      "level": 3,
      "content": "On peut personnaliser les options disponibles sous Leave simplement en copiant le fichier du paquet fourni .desktop dans ~/.local/share/applications et en le modifiant pour qu'il contienne la directive NoDisplay=true. Référence : #876.\n\nLa liste complète des fichiers à envisager de masquer comprend :\n\n```\nlxqt-hibernate.desktop\nlxqt-leave.desktop\nlxqt-lockscreen.desktop\nlxqt-logout.desktop\nlxqt-reboot.desktop\nlxqt-shutdown.desktop\nlxqt-suspend.desktop\n```\n\nExemple : supprimer l'option d'hibernation.\n\n```\n$ mkdir -p ~/.local/share/applications\n$ sed '/OnlyShowIn/aNoDisplay=true' </usr/share/applications/lxqt-hibernate.desktop >~/.local/share/applications/lxqt-hibernate.desktop\n```\n\n"
    },
    {
      "title": "Les icônes du bureau sont regroupées",
      "level": 3,
      "content": "Lorsque vous déplacez des icônes sur le bureau, il est possible de les placer un peu trop près les unes des autres, ce qui les relie. Si vous ne pouvez pas les séparer, arrêtez Desktop dans Session Settings, supprimez ~/.config/pcmanfm-qt/lxqt/desktop-items-0.conf et relancez Desktop.\n\n"
    },
    {
      "title": "Exécuter LXQt avec xrdp",
      "level": 3,
      "content": "Exécuter LXQt avec xrdp pour la connexion à distance a l'avantage d'être rapide et pratique, tout en minimisant la consommation de ressources sur le serveur. La mise en place de xrdp est plutôt facile, et nécessite seulement que l'utilisateur ajuste le fichier ~/.xinitrc. Puisque LXQt semble dépendre de certaines fonctionnalités du service D-Bus, ce fichier devrait avoir la ligne suivante à la fin [1] :\n\n```\nexec dbus-run-session -- startlxqt\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Page d'accueil de LXQt\n- Développement de LXQt\n- LXQt sur deviantART\n- wiki LXQt sur GitHub\n\n"
    }
  ]
}