{
  "title": "LXQt (Русский)",
  "url": "https://wiki.archlinux.org/title/LXQt_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- LXDE (Русский)\n- Среда рабочего стола\n- Оконный менеджер\n\nВ начале 2013 года Hong Jen Yee «PCMan» приступил к портированию компонентов LXDE на Qt. Первую превью-версию LXDE-Qt показали 3 июля 2013 года, а 21 июля было анонсировано слияние Razor-qt (среды, схожей с LXDE по внешнему виду) и LXDE.\n\nРезультатом стала LXQt — среда рабочего стола, основанная на Qt и частично использующая компоненты Razor-qt и LXDE. Хотя разработка и сосредоточена на LXQt, работа над GTK-версией LXDE будет продолжаться.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Сперва установите и настройте Xorg. После этого установите группу пакетов lxqt и какую-нибудь тему значков (например, breeze-icons или oxygen-icons).\n\nДля дополнительных функций также можно установить:\n\n- LXQt Connman applet — LXQt-апплет для ConnMan.\n\n- nm-tray — Простой Qt-фронтенд для NetworkManager.\n\n- SDDM — Экранный менеджер, предпочтительный для LXQt.\n\n- Блокировщик экрана при необходимости. К примеру, slock или XScreenSaver. Оба поддерживают LXQt, другие блокировщики, возможно, тоже. Если вы используете LightDM, можно взять light-locker. Отключение блокировки экрана в ждущем или спящем режиме находится здесь: Настройки LXQt > Настройки сеанса > Основные настройки > Заблокировать экран перед переходом в спящий/ждущий режим. Совет: LXQt использует xdg-screensaver из xdg-utils для блокировки экрана, который работает только с XScreenSaver и xautolockAUR. Вы можете использовать их или любой другой совместимый блокировщик. К примеру, в случае с slock воспользуйтесь инструкцией Slock#Lock on suspend или пропатченным пакетом xdg-utils-slockAUR для совместимости с LXQt. Для betterlockscreenAUR установите xdg-utils-betterlockscreenAUR[ссылка недействительна: package not found] Также в файле настроек ~/.config/lxqt/lxqt.conf можно указать свою команду блокировки вместо xautolock, например: [Screensaver] lock_command=i3lock\n- Для звука смотрите Основные рекомендации#Звук.\n- Некоторые плагины панели LXQt для работы требуют дополнительные пакеты. Обратитесь к дополнительным зависимостям пакета lxqt-panel.\n\n- Если вы используете LightDM, можно взять light-locker.\n- Отключение блокировки экрана в ждущем или спящем режиме находится здесь: Настройки LXQt > Настройки сеанса > Основные настройки > Заблокировать экран перед переходом в спящий/ждущий режим. Совет: LXQt использует xdg-screensaver из xdg-utils для блокировки экрана, который работает только с XScreenSaver и xautolockAUR. Вы можете использовать их или любой другой совместимый блокировщик. К примеру, в случае с slock воспользуйтесь инструкцией Slock#Lock on suspend или пропатченным пакетом xdg-utils-slockAUR для совместимости с LXQt. Для betterlockscreenAUR установите xdg-utils-betterlockscreenAUR[ссылка недействительна: package not found]\n- Также в файле настроек ~/.config/lxqt/lxqt.conf можно указать свою команду блокировки вместо xautolock, например: [Screensaver] lock_command=i3lock\n\n```\n[Screensaver]\nlock_command=i3lock\n```\n\n"
    },
    {
      "title": "С использованием xinit",
      "level": 3,
      "content": "Добавьте к Xinitrc строчку:\n\n```\n~/.xinitrc\n```\n\n```\nexec startlxqt\n```\n\n"
    },
    {
      "title": "Графический вход",
      "level": 3,
      "content": "Выберите LXQt Desktop из меню вашего менеджера входа.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Для управления собственными настройками LXQt стремится предоставить графический интерфейс. Файлы конфигурации располагаются в каталоге ~/.config/lxqt, который создаётся автоматически. Конфигурация по умолчанию для новых пользователей находится в /usr/share/lxqt.\n\n"
    },
    {
      "title": "Яркость экрана",
      "level": 3,
      "content": "Если LXQt регулирует контрастность экрана вместо яркости при использовании горячих клавиш для изменения яркости, вы можете заменить команду на xbacklight через Настройки LXQt > Сочетания клавиш:\n\n```\nxbacklight -inc 10\nxbacklight -dec 10\n```\n\nЕсли вы используете режим ядра Intel modesettings, xbacklight не будет работать, но вы можете попробовать следующее:\n\n```\npkexec lxqt-backlight_backend --inc\npkexec lxqt-backlight_backend --dec\n```\n\nМожет понадобиться создать два скрипта для увеличения и уменьшения яркости экрана и указать пути к ним в настройках сочетаний клавиш, чтобы всё заработало.\n\nЕщё один способ изменения яркости — с помощью brightnessctl:\n\n```\nbrightnessctl -d intel_backlight set +5%\nbrightnessctl -d intel_backlight set 5%-\n```\n\n"
    },
    {
      "title": "Виджеты панелей",
      "level": 3,
      "content": "Для работы виджетов «Монитор загрузки процессора» и «Системная статистика» нужно установить пакеты libstatgrab и libsysstat.\n\n"
    },
    {
      "title": "Использование другого менеджера окон",
      "level": 3,
      "content": "Хотя по умолчанию в качестве оконного менеджера в LXQt используется Openbox, вы можете указать другой оконный менеджер через Настройки LXQt > Настройки сеанса > Основные настройки (команда lxqt-config-session) или изменить в файле ~/.config/lxqt/session.conf эту строчку:\n\n```\nwindow_manager=openbox\n```\n\nуказав в ней нужный вам оконный менеджер:\n\n```\nwindow_manager=нужный_оконный_менеджер\n```\n\n"
    },
    {
      "title": "Автозапуск приложений",
      "level": 3,
      "content": "Настроить автозапуск приложений при входе можно через Настройки LXQt > Настройки сеанса > Автозапуск (команда lxqt-config-session).\n\nЗдесь вы можете добавить новое приложение либо в общий автозапуск (запускаемый во всех сеансах, реализующих спецификацию XDG Autostart), либо в автозапуск только для LXQt (однако есть баг, связанный с этой опцией). Для каждого добавленного вами элемента lxqt-config-session создаст файл .desktop в соответствующем каталоге XDG Autostart.\n\nВарианты «Общий автозапуск» и «Автозапуск только для LXQt» отличаются не каталогом, в котором находится файл .desktop, а параметром OnlyShowIn, записанном в этом файле. Если он OnlyShowIn=true, то это «Автозапуск только для LXQt». Кроме того, если есть параметр X-LXQt-Module=true, то lxqt-config-session не отобразит этот файл.\n\n"
    },
    {
      "title": "Настройка переменных окружения",
      "level": 3,
      "content": "Переменные окружения для LXQt также можно задать через «Настройки сеанса» на вкладке «Окружение».\n\n"
    },
    {
      "title": "Редактирование меню приложений",
      "level": 3,
      "content": "Редактировать меню приложений можно путём изменения файлов .desktop, расположенных в /usr/share/applications/lxqt-*.desktop. Подробнее в статье Ярлыки приложений.\n\n"
    },
    {
      "title": "Композитный менеджер окон",
      "level": 3,
      "content": "Вы можете добавить композитор, например picom, в автозапуск приложений с помощью примерно такой команды:\n\n```\npicom --vsync -r 12 --no-fading-openclose -b\n```\n\n"
    },
    {
      "title": "Настройка меню выхода",
      "level": 3,
      "content": "Вы можете скрыть пункты из меню «Выйти», скопировав соответствующий файл .desktop в каталог ~/.local/share/applications и добавив параметр NoDisplay=true. Подробнее: #876.\n\nПолный список файлов, которые можно скрыть:\n\n```\nlxqt-hibernate.desktop\nlxqt-leave.desktop\nlxqt-lockscreen.desktop\nlxqt-logout.desktop\nlxqt-reboot.desktop\nlxqt-shutdown.desktop\nlxqt-suspend.desktop\n```\n\nПример: удаление спящего режима.\n\n```\n$ mkdir -p ~/.local/share/applications\n$ sed '/OnlyShowIn/aNoDisplay=true' </usr/share/applications/lxqt-hibernate.desktop >~/.local/share/applications/lxqt-hibernate.desktop\n```\n\n"
    },
    {
      "title": "Значки на рабочем столе группируются",
      "level": 3,
      "content": "При перемещении значков на рабочем столе их можно расположить настолько близко, что они соединятся друг с другом. Если разделить их не получается, отключите модуль «Рабочий стол» в «Настройках сеанса», удалите ~/.config/pcmanfm-qt/lxqt/desktop-items-0.conf и запустите модуль снова.\n\n"
    },
    {
      "title": "Запуск LXQt через xrdp",
      "level": 3,
      "content": "Запуск LXQt при удалённом входе через xrdp хорош тем, что он быстрый и удобный, а также минимизирует потребление ресурсов на сервере. Настройка xrdp довольно проста и требует от пользователя лишь редактирования файла ~/.xinitrc. Поскольку для работы LXQt нужен D-Bus, в конце этого файла должна быть следующая строка [1]:\n\n```\nexec dbus-run-session -- startlxqt\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Сайт LXQt\n- Репозиторий LXQt на GitHub\n- LXQt на deviantART\n- Вики LXQt на GitHub\n\n"
    }
  ]
}