{
  "title": "MAC Address Spoofing (Español)",
  "url": "https://wiki.archlinux.org/title/MAC_Address_Spoofing_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-11** \n\nEste artículo proporciona varios métodos para falsificar una dirección de control de acceso al medio (MAC).\n\n"
    },
    {
      "title": "Manualmente",
      "level": 2,
      "content": "Hay dos métodos para falsificar una dirección MAC: instalando y configurando ya sea iproute2 o macchanger. Ambos se describen a continuación.\n\n"
    },
    {
      "title": "iproute2",
      "level": 3,
      "content": "Primero, puede verificar su dirección MAC actual con el comando:\n\n```\n# ip link show interfaz\n```\n\ndonde interfaz es el nombre de su interfaz de red.\n\nLa sección que nos interesa en este momento es la que tiene \"link/ether\" seguido de un número de 6 bytes. Probablemente se verá algo como esto:\n\n```\nlink/ether 00:1d:98:5a:d1:3a\n```\n\nEl primer paso para falsificar la dirección MAC es desactivar la interfaz de red. Se puede lograr con el comando:\n\n```\n# ip link set dev interfaz down\n```\n\nA continuación, falsificaremos nuestra MAC. Cualquier valor hexadecimal servirá, pero algunas redes pueden configurarse para negarse a asignar direcciones IP a un cliente cuya MAC no coincida con ninguno de los proveedores conocidos. Por lo tanto, a menos que controle las redes a las que se está conectando, utilice el prefijo MAC de cualquier proveedor real (básicamente, los primeros tres bytes) y utilice valores aleatorios para los siguientes tres bytes. Para obtener más información, véase Wikipedia:es:Identificador único de organización.\n\nPara cambiar la MAC, necesitamos ejecutar el comando:\n\n```\n# ip link set dev interfaz address XX:XX:XX:XX:XX:XX\n```\n\nDonde cualquier valor de 6 bytes será suficiente para XX:XX:XX:XX:XX:XX.\n\nEl último paso es volver a activar la interfaz de red. Esto se puede lograr ejecutando el comando:\n\n```\n# ip link set dev interfaz up\n```\n\nSi desea verificar que su MAC ha sido falsificada, simplemente ejecute nuevamente ip link show interfaz y verifique el valor para 'link/ether'. Si funcionó, 'link/ether' debería ser la dirección a la que decidió cambiarla.\n\n"
    },
    {
      "title": "macchanger",
      "level": 3,
      "content": "Otro método utiliza macchanger (también conocido como el Cambiador de MAC de GNU). Proporciona una variedad de funciones, como cambiar la dirección para que coincida con un determinado proveedor o al azar.\n\nInstale el paquete macchanger.\n\nLa falsificación se realiza por interfaz, especifique el nombre del interfaz de red como interfaz en cada uno de los siguientes comandos.\n\nLa dirección MAC se puede falsificar con una dirección completamente aleatoria:\n\n```\n# macchanger -r interfaz\n```\n\nPara hacer aleatorio solo los bytes específicos de dispositivo de la dirección MAC actual (es decir, de modo que si la dirección MAC se verificara se registraría como si fuera del mismo proveedor), ejecutaría el comando:\n\n```\n# macchanger -e interfaz\n```\n\nPara cambiar la dirección MAC a un valor específico, debe ejecutar:\n\n```\n# macchanger --mac=XX:XX:XX:XX:XX:XX interfaz\n```\n\nDonde XX:XX:XX:XX:XX:XX es la MAC a la que desea cambiar.\n\nFinalmente, para devolver la dirección MAC a su valor de hardware original y permanente:\n\n```\n# macchanger -p interfaz\n```\n\n"
    },
    {
      "title": "systemd-networkd",
      "level": 3,
      "content": "systemd-networkd soporta la falsificación de direcciones MAC a través de archivos link (véase systemd.link(5) para los detalles).\n\nPara establecer una dirección MAC estática falsificada:\n\n```\n/etc/systemd/network/00-default.link\n```\n\n```\n[Match]\nMACAddress=MAC original\n\n[Link]\nMACAddress=MAC falsificada\nNamePolicy=kernel database onboard slot path\n```\n\nPara hacer aleatoria la dirección MAC en cada arranque, establezca MACAddressPolicy=random en lugar de MACAddress=MAC falsificada.\n\n"
    },
    {
      "title": "systemd-udevd",
      "level": 3,
      "content": "Udev le permite realizar la falsificación de la dirección MAC mediante la creación de reglas udev. Utilice el atributo address para que coincida con el dispositivo correcto por su dirección MAC original y cámbielo utilizando la orden ip:\n\n```\n/etc/udev/rules.d/75-mac-spoof.rules\n```\n\n```\nACTION==\"add\", SUBSYSTEM==\"net\", ATTR{address}==\"XX:XX:XX:XX:XX:XX\", RUN+=\"/usr/bin/ip link set dev $name address YY:YY:YY:YY:YY:YY\"\n```\n\nDonde XX:XX:XX:XX:XX:XX es la dirección MAC original e YY:YY:YY:YY:YY:YY es la nueva.\n\n"
    },
    {
      "title": "Crear la unidad",
      "level": 4,
      "content": "A continuación, encontrará dos ejemplos de unidades systemd para cambiar una dirección MAC durante el arranque, uno configura una MAC estática utilizando ip y el otro utiliza macchanger para asignar una dirección MAC aleatoria. El network-pre.target de systemd se utiliza para asegurar que la MAC se cambie antes que un gestor de red como Netctl o NetworkManager, comience el servicio systemd-networkd o dhcpcd.\n\nLa unidad systemd configura una dirección MAC predefinida:\n\n```\n/etc/systemd/system/macspoof@.service\n```\n\n```\n[Unit]\nDescription=Cambio de dirección MAC %I\nWants=network-pre.target\nBefore=network-pre.target\nBindsTo=sys-subsystem-net-devices-%i.device\nAfter=sys-subsystem-net-devices-%i.device\n\n[Service]\nType=oneshot\nExecStart=/usr/bin/ip link set dev %i address 36:aa:88:c8:75:3a\nExecStart=/usr/bin/ip link set dev %i up\n\n[Install]\nWantedBy=multi-user.target\n```\n\nLa unidad systemd establece una dirección aleatoria mientras se conservan los bytes originales del proveedor NIC. Asegúrese de que macchanger está instalado:\n\n```\n/etc/systemd/system/macspoof@.service\n```\n\n```\n[Unit]\nDescription=macchanger en %I\nWants=network-pre.target\nBefore=network-pre.target\nBindsTo=sys-subsystem-net-devices-%i.device\nAfter=sys-subsystem-net-devices-%i.device\n\n[Service]\nExecStart=/usr/bin/macchanger -e %I\nType=oneshot\n\n[Install]\nWantedBy=multi-user.target\n```\n\nSe puede establecer una dirección completamente aleatoria utilizando la opción -r, véase #macchanger.\n\n"
    },
    {
      "title": "Activar el servicio",
      "level": 4,
      "content": "Añada la interfaz de red deseada al nombre del servicio (por ejemplo eth0) y active el servicio (por ejemplo macspoof@eth0.service).\n\nReinicie, o detenga e inicie los servicios requeridos en el orden correcto. Si tiene el control de su red, verifique que el enrutador haya recogido la MAC falsificada mediante el examen de las tablas de direcciones DHCP o estáticas dentro del enrutador.\n\n"
    },
    {
      "title": "Interfaces netctl",
      "level": 3,
      "content": "Puede utilizar un hook de netctl para ejecutar una orden cada vez que un perfil netctl es re-/iniciado para una interfaz de red específica. Reemplace interfaz en consecuencia:\n\n```\n/etc/netctl/interfaces/interfaz\n```\n\n```\n#!/usr/bin/env sh\n/usr/bin/macchanger -r interfaz\n```\n\nHaga el script ejecutable:\n\n```\nchmod +x /etc/netctl/interfaces/interfaz\n```\n\nFuente: akendo.eu (archive)\n\n"
    },
    {
      "title": "NetworkManager",
      "level": 3,
      "content": "Véase NetworkManager#Configuring MAC address randomization.\n\n"
    },
    {
      "title": "wpa_supplicant",
      "level": 3,
      "content": "wpa_supplicant puede utilizar una dirección MAC aleatoria para cada conexión ESS (AP) (véase [1] for details).\n\nAñada esto a su configuración:\n\n```\n/etc/wpa_supplicant/wpa_supplicant-wlan0.conf\n```\n\n```\nmac_addr=1\npreassoc_mac_addr=1\ngas_rand_mac_addr=1\n```\n\n"
    },
    {
      "title": "iwd",
      "level": 3,
      "content": "Para aleatorizar la dirección MAC cuando se inicia iwd (véase iwd.config(5) para más detalles):\n\n```\n/etc/iwd/main.conf\n```\n\n```\n[General]\nAddressRandomization=once\nAddressRandomizationRange=nic\n```\n\nEspecificar AddressRandomizationRange permite controlar qué parte de la dirección es aleatoria. Si se establece en nic, solo los octetos específicos del NIC (los últimos tres octetos) son aleatorios. La dirección mac permanente de la interfaz de red se utiliza para los 3 octetos iniciales. Si se establece en full, los seis octetos de la dirección son aleatorios.\n\n"
    },
    {
      "title": "La conexión a la red DHCPv4 falla",
      "level": 3,
      "content": "Si no puede conectarse a una red DHCPv4 y está utilizando dhcpcd, que es el predeterminado para NetworkManager, es posible que deba modificar la configuración dhcpcd para obtener un arrendamiento (lease).\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Wikipedia:es:MAC spoofing\n- Página en GitHub de Macchanger\n- Artículo en DebianAdmin con más opciones de macchanger\n\n"
    }
  ]
}