{
  "title": "Mail server (Español)",
  "url": "https://wiki.archlinux.org/title/Mail_server_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-12** \n\nUn servidor de correo consta de varios componentes. Un agente de transferencia de correos (MTA) recibe y envía correos electrónicos a través de SMTP. Los correos electrónicos recibidos y aceptados se pasan luego a un agente de entrega de correos (MDA), que almacena el correo en un buzón (generalmente en mbox o Maildir. Si desea que los usuarios puedan acceder de forma remota a su correo mediante clientes de correo electrónico (MUA), debe ejecutar un servidor POP3 y/o IMAP.\n\n"
    },
    {
      "title": "Software",
      "level": 2,
      "content": "Todos estos programas, excepto Sendmail, incluyen un agente de entrega de correos.\n\n- dma — Agente de transporte de correo diminuto.\n\n- Exim — Un agente de transferencia de correos altamente configurable.\n\n- OpenSMTPD — Un agente de transferencia de correos, parte del proyecto OpenBSD.\n\n- Postfix — Un agente de transferencia de correos, destinado a ser rápido, fácil de administrar y seguro.\n\n- Sendmail — Un conocido agente de transferencia de correos.\n\n"
    },
    {
      "title": "Servidores POP3/IMAP",
      "level": 3,
      "content": "- Courier — Un agente de transferencia de correos, que proporciona servicios de POP3, IMAP, correo web y listas de correo como componentes individuales.\n\n- Cyrus IMAP — Un agente de transferencia de correos con un formato de cola de correos personalizado, proporciona servicios POP3 e IMAP.\n\n- Dovecot — Un servidor IMAP y POP3 escrito para ser seguro, rápido y fácil de configurar.\n\n- UW IMAP — Un servidor IMAP/POP.\n\n"
    },
    {
      "title": "MDAs autónomos",
      "level": 3,
      "content": "- fdm — Un programa simple para entregar y filtrar correos.\n\n- Procmail — Un programa para filtrar, clasificar y almacenar correos electrónicos (sin mantenimiento).\n\n- Maildrop — Un filtro de correos/agente de entrega de correos utilizado por el servidor de correos Courier.\n\nVéase también Wikipedia:Comparison of e-mail servers.\n\n"
    },
    {
      "title": "Puertos",
      "level": 2,
      "content": "Table content:\nPropósito | Puerto | Protocolo | Cifrado\nAceptar correos de otros MTAs. | 25 | SMTP | STARTTLS\nAceptar envíos de MUAs. | 587 | SMTP | STARTTLS\n465 | SMTPS | implicit TLS\nPermitir a MUAs acceder al correo. | 110 | POP3 | STARTTLS\n995 | POP3S | implicit TLS\n143 | IMAP | STARTTLS\n993 | IMAPS | implicit TLS\n\n"
    },
    {
      "title": "Registro MX",
      "level": 2,
      "content": "El alojamiento de un servidor de correos requiere un nombre de dominio con un registro MX que apunte al nombre de dominio de su agente de transferencia de correos. El nombre de dominio utilizado como el valor del registro MX debe asignarse a al menos un registro de direcciones (A, AAAA) y no debe tener un registro CNAME para cumplir con el RFC 2181, de lo contrario no podrá recibir correos de algunos servidores de correo. La configuración de los registros DNS se realiza generalmente desde la interfaz de configuración de su registrador de nombres de dominio.\n\n"
    },
    {
      "title": "TLS",
      "level": 2,
      "content": "Para obtener un certificado, véase OpenSSL#Usage.\n\n"
    },
    {
      "title": "Autenticación",
      "level": 2,
      "content": "Hay varias técnicas de autenticación de correo.\n\n"
    },
    {
      "title": "Marco de políticas del remitente",
      "level": 3,
      "content": "De Wikipedia:\n\nPara permitir que otros intercambiadores de correo validen los correos aparentemente enviados desde su dominio, debe establecer un registro TXT de DNS como se explica en el artículo de Wikipedia (también hay un asistente en línea). Para validar el correo entrante usando SPF, debe configurar su agente de transferencia de correos para utilizar una implementación de SPF. Hay varias impleementaciones SPF disponibles: libspf2, perl-mail-spf y perl-mail-spf-query.\n\nTable content:\nCourier | Sí, incorporado\nPostfix | Sí\nSendmail | mediante Milter y spfmilter-acmeAUR\nExim | experimental, requiere libspf2\nOpenSMTPD | No\nCyrus IMAP | ?\n\nLos siguientes sitios web le permiten validar su registro SPF:\n\n- Verificador de registro SPF\n- Prueba de correo electrónico SPF\n\n"
    },
    {
      "title": "Esquema de reescritura del remitente",
      "level": 3,
      "content": "El esquema de reescritura del remitente (SRS) es un esquema seguro para permitir rebotes (bounces) reenviables para correos electrónicos reenviados del servidor sin romper el #Marco de políticas del remitente.\n\nPara Postfix, véase Esquema de reescritura del remitente.\n\n"
    },
    {
      "title": "DKIM",
      "level": 3,
      "content": "El correo identificado por claves de dominio (DKIM) es un método de autenticación de correo electrónico a nivel de dominio diseñado para detectar la falsificación de correos electrónicos.\n\nLas implementaciones DKIM disponibles son OpenDKIM y perl-mail-dkim.\n\n"
    },
    {
      "title": "Prueba",
      "level": 2,
      "content": "Hay varias opciones para ayudarle a probar registros DNS, capacidad de entrega y soporte de cifrado.\n\n"
    },
    {
      "title": "Herramientas dedicadas",
      "level": 3,
      "content": "- swaksAUR\n\n"
    },
    {
      "title": "Sitios web dedicados",
      "level": 3,
      "content": "Hay varios sitios web útiles que pueden ayudarle a hacer pruebas.\n\n- https://mxtoolbox.com/\n- https://ismyemailworking.com/\n- https://www.mail-tester.com/ (¡Solo 3 intentos gratis!)\n- https://www.checktls.com/\n- https://pingability.com/zoneinfo.jsp\n\n"
    },
    {
      "title": "Consejos y trucos",
      "level": 2,
      "content": "La mayoría de los servidores de correo pueden configurarse para eliminar las direcciones IP de los usuarios y el agente de usuario del correo saliente.\n\nLos extras disponibles que normalmente se pueden integrar son:\n\n- ClamAV para detectar virus en los correos electrónicos\n- SpamAssassin para identificar y filtrar el spam\n- Sieve – un lenguaje de programación de filtrado de correo\n- webmail como Roundcube o Squirrelmail\n\n"
    }
  ]
}