{
  "title": "Main Page (Ελληνικά)",
  "url": "https://wiki.archlinux.org/title/Main_Page_(%CE%95%CE%BB%CE%BB%CE%B7%CE%BD%CE%B9%CE%BA%CE%AC)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Καλώς ήλθατε στο ArchWiki: την πηγή σας για την τεκμηρίωση του Arch Linux στο διαδίκτυο.\n\nΕπισκεφτείτε το Table of contents για να δείτε την λίστα με τις ενότητες του ArchWiki (στα Ελληνικά). Εναλλακτικά επισκευτείτε το Table of contents στην αγγλική έκδοση.\n\n"
    },
    {
      "title": "Ξεκινήστε",
      "level": 2,
      "content": "Οι παρακάτω σύνδεσμοι είναι χρήσιμοι για όσους μόλις ξεκινούν με το Arch Linux.\n\n"
    },
    {
      "title": "Τα Νέα του Arch",
      "level": 2,
      "content": "Ελέγξτε την σελίδα Wiki News για τα τελευταία γεγονότα στο wiki.\n\nΑν είστε πρόθυμοι να συνεισφέρετε στο Wiki, παρακαλώ διαβάσετε αυτή τη λίστα για ιδέες.\n\n"
    },
    {
      "title": "Διεθνοποίηση/Μετάφραση",
      "level": 2,
      "content": "Αισθάνεστε πιο άνετα όταν διαβάζετε άρθρα στην μητρική σας γλώσσα; Κάνετε κλικ εδώ, για μια λίστα με τις διαθέσιμες κατηγορίες γλωσσών και άλλες πληροφορίες διεθνοποίησης/μετάφρασης. Αν θέλετε να μάθετε περισσότερα σχετικά με την μετάφραση στην Ελληνική γλώσσα, επισκεφτείτε την σελίδα της ομάδας μετάφρασης του Arch Wiki στα Ελληνικά, κάνοντας κλικ εδώ.\n\n"
    },
    {
      "title": "Βοήθεια",
      "level": 2,
      "content": "Αν ψάχνετε για συγκεκριμένες πληροφορίες, χρησιμοποιείστε το κουτί αναζήτησης στα αριστερά. Εναλλακτικά χρησιμοποιείστε την ιδιότητα του Google να ψάχνει σε sites προσαρτώντας στους όρους αναζήτησης site:wiki.archlinux.org (π.χ. search this site for \"Arch Linux\"[dead link 2023-09-16 ⓘ]).\n\nΠρέπει να δημιουργήσετε έναν λογαριασμό για να επεξεργαστείτε αυτό το Wiki. Μόλις το κάνετε μπορείτε να «παίξετε» με το Sandbox ή την σελίδα χρήστη σας για να εξοικειωθείτε με την επεξεργασία του Wiki. Η διαθέσιμη σύνταξη υπάρχει στην Category:Help μαζί με άλλες βοηθητικές πηγές.\n\n"
    }
  ]
}