{
  "title": "Main page (Indonesia)",
  "url": "https://wiki.archlinux.org/title/Main_page_(Indonesia)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Selamat datang di ArchWiki,tempat terbaik untuk belajar tentang Arch Linux\n\nKunjungi Daftar Isi yang menyajikan daftar kategori ArchWiki.\n\n"
    },
    {
      "title": "Berkenalan dengan Arch Linux",
      "level": 2,
      "content": "Berikut adalah daftar artikel yang dapat Anda baca agar lebih paham tentang Arch Linux :\n\nPerkenalan Arch Linux\n\nPrinsip/Filosofi Arch (The Arch Way)\n\nPerbandingan Arch Linux dengan distro GNU/Linux dan OS lain.\n\nTanya Jawab (FAQ)\n\n"
    },
    {
      "title": "Mulai menginstall Arch Linux",
      "level": 2,
      "content": "Panduan Arch Linux (untuk pengguna berpengalaman)\n\nRekomendasi Umum\n\n"
    },
    {
      "title": "Ikut terlibat dengan Arch Linux",
      "level": 2,
      "content": "Tutorial berkontribusi di ArchWiki\n\nBerkontribusi untuk Arch Linux\n\n"
    },
    {
      "title": "Kabar Terbaru Wiki",
      "level": 2,
      "content": "Cek halaman Wiki News untuk mengetahui pembaruan wiki.\n\nJika berminat dan mampu berkontribusi ke wiki, silakan lihat daftar ini untuk lebih jelasnya. Khususnya, mereka yang butuh bantuan mengatur ulang kategori non-bahasa Inggris. Silakan koordinasikan aktivitas anda dengan admin dan sysops.\n\n"
    },
    {
      "title": "Internasionalisasi",
      "level": 2,
      "content": "Lebih nyaman membaca artikel dalam bahasa Anda sendiri? Klik di sini untuk mengetahui kategori daftar bahasa yang tersedia dan informasi internasionalisasi lain.\n\n"
    },
    {
      "title": "Bantuan",
      "level": 2,
      "content": "Jika mencari informasi spesifik, coba gunakan kotak telusur di sebelah kiri. Cara lain, gunakan fitur penelusuran site dari Google dengan akhiran site:wiki.archlinux.org terhadap istilah penelusuran (misal telusuri situs ini dengan kata kunci \"Arch Linux\"[dead link 2023-09-16 ⓘ]).\n\nAnda harus membuat sebuah akun untuk mengedit wiki ini. Setelah memilikinya, anda dapat menelusuri Sandbox atau halaman pengguna anda untuk membiasakan diri dengan penulisan kode (markup) ArchWiki. Sintaks yang bisa digunakan ada di Kategori Bantuan Wiki bersama dengan sumber bermanfaat lain.\n\n"
    }
  ]
}