{
  "title": "Main page (עברית)",
  "url": "https://wiki.archlinux.org/title/Main_page_(%D7%A2%D7%91%D7%A8%D7%99%D7%AA)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "ברוכים הבאים לארץ' וויקי ( ArchWiki ) : המקור שלך עבור מסמכי ארץ' לינוקס על רשת האינטרנט.\n\nבאפשרותיך לבקר בתוכן העניינים כדי לקבל רשימה של כל הקטגורוית של ארץ, לינוקס. ראה גם: דפים מסודרים לפי נושא ו דפים מסודרים לפי סוג.\n\n"
    },
    {
      "title": "ראשית כל",
      "level": 2,
      "content": "הקישורים הבאים, שימושיים לאלה המתחילים להתשמש בארץ' לינוקס.\n\nסקירה קצרה על ארץ' לינוקס, מתאר מה אפשר לצפות מארץ' לינוקס כמערכת.\n\nמתאר את העקרונות והפילוסופיה מאחורי ארץ' לינוקס.\n\nמסכם את הדומה והשונה בין הפצות אחרות וארץ' לינוקס\n\nמסביר את הדרכים שמשתמשי ארץ' (חדשים וגם מנוסים) יוכלו לתרום לקהילת הארץ'\n\nכללים לחברי הפורום .\n\nמדריך קצר לעריכה ותרומה לארץ' וויקי\n\nמדריך שעובר על כך תהליך ההתקנה והקונפיגרציה של ארץ' לינוקס, נכתב עבור משתמשים חדשים ולא מנוסים.\n\nמדריך התקנה כללי יותר, בהנחה שהמשתמש יותר מנוכב בכל הקשור ל - UNIX/GNU/Linux וכל שביניהם.\n\nרשימה של שאלות ותשובות נפוצות\n\nאינדקס מקוצר של מאמרים פופולריים וכאלה שאנשים מפנים אליהם לעיתים קורבות\n\n"
    },
    {
      "title": "חדשות וויקי",
      "level": 2,
      "content": "לחץ כאן כדי לקבל מידע על החדש בווקי באם אתם מוכנים ומסגולים לעזור ולתרום לוויקי אנא קרא את הרשימה הבאה לרעיונות. בעיקר יש צורך באנשים בכדי לסווג את הדפים שאינם באנגלית. אנא תאם את הפעליוית עם הadmins and sysops\n\n"
    },
    {
      "title": "שפות",
      "level": 2,
      "content": "יותר קל לך לקרוא בשפת האם שלך? אנא לחץ כאן לרשימה של שפות\n\n"
    },
    {
      "title": "עזרה",
      "level": 2,
      "content": "באם אתה מחפש עזרה בנושא מסוים, נסה להתשמש בקופסאת החיפוש מצד שמאל, לחלופין, אפשר לשתמש ב\"האתר\" של גוגל על ידי הוספה של site:wiki.archlinux.org (לדוגמא חיפוש באתר הזה של הערך \"ארץ' לינוקס\" (באנגלית)[dead link 2023-09-16 ⓘ]) עלייך להירשם בכדי לערוך את הוויקי. כאשר סיימת, תוכל לשחק עם ה Sandbox (ארגז חול) או בדף המשתמש שלך בכדי להתרגל לממשק. התחביר הזמין נמצא ב wiki help category בנוסף לעוד ממשאבים יעילים\n\n- המדריך והתוכן נכתבו בלשון זכר לנוחיות בלבד.\n\n"
    }
  ]
}