{
  "title": "Man (Español)",
  "url": "https://wiki.archlinux.org/title/Man_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-01** \n\nArtículos relacionados\n\n- Color output in console#man\n\nLas man pages (abreviatura de «manual pages» o páginas de manual) es una forma de documentación que está disponible en casi todos los sistemas operativos derivados de UNIX, incluyendo Arch Linux. Para acceder a estas, use el comando man.\n\nA pesar de la amplia cantidad de temas que estas pueden abordar, están diseñadas para ser independientes entre si; limitándose a simplemente hacer mención a otras páginas de manual cuando sea necesario. Esta es una diferencia notable con el uso de enlaces en el intento de GNU por reemplazar este tradicional formato: los documentos de información.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "El paquete man-db es la implementación de man en Arch Linux, y less es el paginador que se usa por defecto. También puede utilizar mandoc.\n\nman-pages provee tanto las páginas de manual del sistema operativo Linux como de POSIX.1 (véase [1][enlace roto 2023-05-06]).\n\nEstán disponibles las siguientes traducciones:\n\n- man-pages-cs para el checo\n- man-pages-da para el denés\n- man-pages-de para el alemán\n- man-pages-el para el griego\n- man-pages-es para el español\n- man-pages-fi para el finés\n- man-pages-fr para el francés\n- man-pages-hu para el húngaro\n- man-pages-id para el indonesio\n- man-pages-it para el italiano\n- man-pages-jaAUR para el japonés\n- man-pages-mk para el macedonio\n- man-pages-nl para el holandés\n- man-pages-pl para el polaco\n- man-pages-pt_br para el portugués de brasil\n- man-pages-ro para el rumano\n- man-pages-ru para el ruso\n- man-pages-sr para el serbio\n- man-pages-sv para el sueco\n- man-pages-trAUR para el turco\n- man-pages-uk para el ucraniano\n- man-pages-vi para el vietnamita\n- man-pages-zh_cn para el chino simplificado\n- man-pages-zh_tw para el chino tradicional\n\nTambién puede buscar todas las páginas man localizadas disponibles en los repositorios oficiales y ?K=man-pages- en AUR.\n\nTambién puede usar otras aplicaciones para ver las páginas de manual:\n\n- GNOME Help — Visor para la documentación de GNOME. Puede mostrar páginas de manual con yelp man:<name> o el atajo de teclado (no documentado) Ctrl+L desde una ventana ya abierta.\n\n- KHelpCenter — Aplicación para visualizar la documentación de las aplicaciones de KDE. Las páginas de manual están en «Páginas de manual de UNIX» o puede acceder a estas ejecutando khelpcenter man:<nombre>.\n\n- Konqueror — Gestor de archivos y navegador de KDE. Puede mostrar páginas de manual con man:<nombre>.\n\n- xman — Provee una visualización organizada de las páginas de manual.\n\n"
    },
    {
      "title": "Acceder a las páginas del manual",
      "level": 2,
      "content": "Para leer una página del manual, introduzca:\n\n```\n$ man nombre_de_página\n```\n\nLos manuales se clasifican en varias secciones. Cada sección tiene una introducción, como intro(1), intro(2), etc. Para obtener una lista completa, véase man-pages(7) § Secciones de las páginas del manual.\n\nPara referirse a las páginas, utilice su nombre y el numero de sección en paréntesis. Pueden haber distintas páginas con el mismo nombre, como man(1) y man(7). En estos casos, para acceder a una o la otra, ingrese el numero de la sección y el nombre de la página del manual; por ejemplo use:\n\n```\n$ man 5 passwd\n```\n\nPara leer la página acerca del archivo /etc/passwd, en vez de la que trata la orden passwd.\n\nDe igual manera, puede escribir el nombre y el numero de sección separados por un punto:\n\n```\n$ man passwd.5\n```\n\n"
    },
    {
      "title": "Búsqueda de manuales",
      "level": 2,
      "content": "Para buscar una página del manual sin saber su nombre exacto, puede usar cualquiera de los siguientes comandos:\n\n```\n$ man -k expresión\n$ man --apropos expresión\n$ apropos expresión\n```\n\nNote que expresión es interpretado como una expresión regular por defecto.\n\nPara buscar palabras clave dentro del texto completo de las páginas, ocupe la opción -K.\n\nPuede ver una descripcion de una línea de las páginas del manual usando el comando whatis. Por ejemplo, para una breve descripción de las páginas del manual de ls en distintas secciones, escriba:\n\n```\n$ whatis ls\n```\n\n```\nls (1)               - lista el contenido de un directorio\nls (1p)              - list directory contents\n```\n\n"
    },
    {
      "title": "Ancho de página",
      "level": 2,
      "content": "El ancho de la página es controlado por la variable de entorno MANWIDTH.\n\nSi el numero de columnas en la terminal es muy pequeño (p.ej cuando se usa una ventana estrecha), los saltos de línea van a quedar mal ubicados, lo cual puede resultar en un texto desagradable de leer. Puede arreglar esto estableciendo MANWIDTH al invocar man. En Bash puede hacerlo de la siguiente manera:\n\n```\n~/.bashrc\n```\n\n```\nman() {\n    local width=$(tput cols)\n    [ $width -gt $MANWIDTH ] && width=$MANWIDTH\n    env MANWIDTH=$width \\\n    man \"$@\"\n}\n```\n\n"
    },
    {
      "title": "Leyendo páginas del manual locales",
      "level": 2,
      "content": "En vez de usar la interfaz estándar, usar navegadores como lynx y Firefox para ver las páginas del manual permite a los usuarios sacarle partido al principal beneficio de las páginas info: el texto con hipervínculos. Para hacerlo, tiene varias formas:\n\n"
    },
    {
      "title": "mandoc",
      "level": 4,
      "content": "Instale el paquete mandoc. Para convertir una página, por ejemplo free(1), ejecute:\n\n```\n$ mandoc -Thtml -Ostyle=style.css /usr/share/man/man1/free.1.gz > free.html\n```\n\nAhora abra el fichero llamado free.html en su navegador favorito.\n\n"
    },
    {
      "title": "man2html",
      "level": 4,
      "content": "Primero, instale man2html desde los repositorios oficiales.\n\nAhora, convierta de esta forma una página del manual:\n\n```\n$ man free | man2html -compress -cgiurl man$section/$title.$section$subsection.html > ~/man/free.html\n```\n\nOtro uso para man2html es exportar texto con formato mínimo y listo para imprimir:\n\n```\n$ man free | man2html -bare > ~/free.txt\n```\n\n"
    },
    {
      "title": "man -H",
      "level": 4,
      "content": "La implementación de man-db de Arch Linux también puede hacer esto sin necesidad de otros paquetes:\n\n```\n$ man -H free\n```\n\nEsto buscará la variable de entorno BROWSER para determinar que navegador usa por defecto. Sino, puede pasar como argumento el binario a la opción -H.\n\n"
    },
    {
      "title": "roffit",
      "level": 4,
      "content": "Primero instale roffitAUR desde el AUR.\n\nPara convertir una página del manual:\n\n```\n$ gunzip -c /usr/share/man/man1/free.1.gz | roffit > free.html\n```\n\n"
    },
    {
      "title": "Conversión a PDF",
      "level": 3,
      "content": "Las páginas del manual siempre han sido imprimibles: están escritas en troff(1), que esencialmente es un lenguaje de composición tipográfica. Por esto, usted puede convertir las páginas del manual a cualquier formato según los dispositivos de salida que groff (usado por man-db) soporte. Para ver una lista de estos dispositivos, vea la opción -T en groff(1) o mandoc(1) si ocupa mandoc.\n\nUse el siguiente comando para convertir en PDF:\n\n```\n$ man -Tpdf pagina_del_manual > nombre_de_archivo\n```\n\nLimitaciones: Las fuentes están generalmente limitadas a Times a tamaños prefijados. Algunas páginas del manual están específicamente diseñadas para verlas en terminal, y por ello no se visualizarán correctamente en PS o en PDF.\n\n"
    },
    {
      "title": "Páginas del manual en línea",
      "level": 2,
      "content": "Existen numerosas bases de datos de páginas de manual en línea, incluyendo:\n\n- Arch manual pages—Aloja las páginas de manual de los paquetes de Arch Linux. Se usa para los enlaces a páginas de manual en esta wiki. También puede acceder a las páginas directamente con con el bang de DuckDuckGo !archman.\n- man7.org—«The Linux man-pages project». Fuente de las páginas del paquete man-pages.\n- manned.org—Colección de páginas del manual de distintas distribuciones Linux, BSD, etc. y las correspondientes para varias versiones de los programas.\n- linux.die.net\n- man.cx\n- Páginas del manual de Debian\n- Páginas del manual de Ubuntu\n- Páginas del manual de DragonFlyBSD\n- Páginas del manual de FreeBSD\n- Páginas del manual de NetBSD\n- Páginas del manual de OpenBSD\n- Plan 9 Manual — Volume 1\n- Inferno Manual — Volume 1\n- Repositorio de páginas de manual en los foros de UNIX y Linux\n\nTenga en cuenta que aunque man-pages proporciona páginas de manual para POSIX.1 (véase [2][enlace roto 2023-05-06]), también existe una referencia oficial en línea:\n\n- POSIX.1-2017\n\nTambién está disponible una tabla de comparación entre estas de las bases de datos en línea.\n\n"
    },
    {
      "title": "Páginas del manual de especial interés",
      "level": 2,
      "content": "A continuación se muestra una lista no exhaustiva de páginas de especial interés que podrían ayudarle a comprender muchas cosas en mayor profundidad. Algunas de ellas podrían servir como buena referencia (como la tabla ASCII).\n\n- ascii(7)\n- boot(7)\n- charsets(7)\n- chmod(1)\n- credentials(7)\n- fstab(5)\n- file-hierarchy(7)\n- systemd(1)\n- locale(1p), locale(5), locale(7)\n- printf(3)\n- proc(5)\n- regex(7)\n- signal(7)\n- term(5), term(7)\n- termcap(5)\n- terminfo(5)\n- utf-8(7)\n\nDe formas más general, eche un vistazo a las páginas de la categoría 7 (misceláneos):\n\n```\n$ man -s 7 -k \".*\"\n```\n\nPáginas específicas de Arch Linux:\n\n- alpm-hooks(5)\n- libalpm(3)\n- makepkg(8)\n- makepkg.conf(5)\n- makepkg-template(1)\n- mkinitcpio(8)\n- pacman(8)\n- pacman.conf(5)\n- pacman-conf(8)\n- pacman-key(8)\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Gentoo:man page\n- Write The Fine Manual with pod2man (guía para escribir páginas del manual en inglés)\n- History of UNIX Manpages (Historia de las páginas del manual de UNIX; en inglés)\n\n"
    }
  ]
}