{
  "title": "Man page (Português)",
  "url": "https://wiki.archlinux.org/title/Man_page_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Color output in console#man\n\nPáginas man — abreviação para \"páginas de manual\" e tradução de man pages em inglês — são a forma de documentação que está disponível na maioria dos sistemas operacionais tipo UNIX, incluindo o Arch Linux. O comando usado para exibi-los é man.\n\nApesar de seu escopo, páginas man são projetadas para serem documentos autocontidos, consequentemente limitando-as a fazer referência a outras páginas man ao discutir assuntos relatados. Esse é um contraste nítido com os documentos info compatíveis com hiperlinks, a tentativa do GNU de substituir o formato tradicional de página man.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "man-db implementa man no Arch Linux, e o less é o paginador padrão usado com man. mandoc também pode ser usado.\n\nman-pages fornece as páginas man do Linux e do POSIX.1 (veja [1][link inativo 2023-05-06 ⓘ]).\n\nAlgumas páginas man localizadas também estão disponíveis:\n\n- man-pages-cs para tcheco\n- man-pages-da para dinamarquês\n- man-pages-de para alemão\n- man-pages-es para espanhol\n- man-pages-fr para francês\n- man-pages-hu para húngaro\n- man-pages-it para italiano\n- man-pages-jaAUR para japonês\n- man-pages-mk para macedônio\n- man-pages-nl para holandês\n- man-pages-pl para polonês\n- man-pages-pt_br para português brasileiro\n- man-pages-ro para romeno\n- man-pages-ru para russo\n- man-pages-trAUR para turco\n- man-pages-zh_cn para chinês simplificado\n- man-pages-zh_tw para chinês tradicional\n\nVocê também pode pesquisar todas as páginas de manual localizadas disponíveis nos repositórios oficiais e no AUR.\n\nVocê pode usar alguns aplicativos para visualizar páginas man:\n\n- GNOME Help — Visualização de ajuda para o GNOME. Ele pode mostrar páginas man via yelp man:<nome> ou a combinação de teclas não documentada Ctrl+L a partir de uma janela existente.\n\n- KHelpCenter — Aplicativo para mostrar documentação dos aplicativos do KDE. Páginas man estão em Páginas de manual do UNIX ou executando khelpcenter man:<nome>.\n\n- Konqueror — Gerenciador de arquivos e navegador web do KDE. Ele pode mostrar páginas man via man:<nome>.\n\n- xman — Fornece um visual categorizado em páginas man.\n\n"
    },
    {
      "title": "Acessando páginas man",
      "level": 2,
      "content": "Para ler uma página man, basta digitar:\n\n```\n$ man nome_página\n```\n\nManuais são ordenados em diversas seções. Cada seção tem uma introdução, tal como intro(1), intro(2) e por aí vai. Para uma listagem completa, veja a seção intitulada \"Sections of the manual pages\" no man-pages(7).\n\nPáginas man geralmente são referenciadas por seu nome, seguido do número de sua seção em parênteses. Geralmente há múltiplas páginas man com o mesmo nome, tal como man(1) e man(7). Neste caso, forneça ao man o número da seção seguido pelo nome da página man. Por exemplo:\n\n```\n$ man 5 passwd\n```\n\npara ler a página man sobre /etc/passwd, em vez do utilitário passwd.\n\nOu, de forma equivalente, a página man seguida pelo número da seção, separado por um ponto:\n\n```\n$ man passwd.5\n```\n\n"
    },
    {
      "title": "Pesquisando por manuais",
      "level": 2,
      "content": "As páginas man podem ser pesquisadas quando o nome exato de uma página não é conhecido usando qualquer um dos seguintes comandos equivalentes:\n\n```\n$ man -k expressão\n$ man --apropos expressão\n$ apropos expressão\n```\n\nexpressão é interpretada como uma expressão regular por padrão.\n\nPara pesquisar palavras-chaves em textos de páginas inteiras, use a opção -K.\n\nDescrições de uma linha podem ser exibidas usando o comando whatis. Por exemplo, para uma descrição breve das seções de página man sobre ls, digite:\n\n```\n$ whatis ls\n```\n\n```\nls (1p)              - list directory contents\nls (1)               - list directory contents\n```\n\n"
    },
    {
      "title": "Largura de página",
      "level": 2,
      "content": "A largura de páginas man é controlada pela variável de ambiente MANWIDTH.\n\nSe o número de colunas no terminal é pequeno demais (ex.: a largura da janela é estreita), as quebras de linha ficarão erradas. Isso pode ser bem incômodo para ler. Você pode corrigir isso definindo MANWIDTH na invocação de man. Com Bash, isso seria:\n\n```\n~/.bashrc\n```\n\n```\nman() {\n    local width=$(tput cols)\n    [ $width -gt $MANWIDTH ] && width=$MANWIDTH\n    env MANWIDTH=$width \\\n    man \"$@\"\n}\n```\n\n"
    },
    {
      "title": "Lendo páginas man locais",
      "level": 2,
      "content": "Em vez da interface padrão, o uso de navegadores como lynx e Firefox para visualizar páginas man permite que os usuários colham o principal benefício de texto hiperlink das páginas info. As alternativas incluem o seguinte:\n\n"
    },
    {
      "title": "mandoc",
      "level": 4,
      "content": "Instale o pacote mandoc. Para converter uma página, por exemplo free(1):\n\n```\n$ mandoc -Thtml -Ostyle=style.css /usr/share/man/man1/free.1.gz > free.html\n```\n\nAgora, abra o arquivo chamado free.html em seu navegador favorito.\n\n"
    },
    {
      "title": "man2html",
      "level": 4,
      "content": "Primeiro, instale man2html dos repositórios oficiais.\n\nAgora, converta uma página man:\n\n```\n$ man free | man2html -compress -cgiurl man$section/$title.$section$subsection.html > ~/man/free.html\n```\n\nOutro uso para man2html é exportar para texto não tratado, no formato de impressão:\n\n```\n$ man free | man2html -bare > ~/free.txt\n```\n\n"
    },
    {
      "title": "man -H",
      "level": 4,
      "content": "A implementação de man-db também tem a capacidade de fazer isso por conta própria:\n\n```\n$ man -H free\n```\n\nIsso vai ler sua variável de ambiente BROWSER para determinar o navegador. Você pode sobrepor isso passando o executável para a opção -H.\n\n"
    },
    {
      "title": "roffit",
      "level": 4,
      "content": "Primeiro, instale roffitAUR do AUR.\n\nPara converter uma página man:\n\n```\n$ gunzip -c /usr/share/man/man1/free.1.gz | roffit > free.html\n```\n\n"
    },
    {
      "title": "Conversão para PDF",
      "level": 3,
      "content": "Páginas man sempre foram imprimíveis: elas são escritas em troff(1), que é fundamentalmente uma linguagem de formatação de texto. Portanto, você pode facilmente converter páginas man para qualquer um dos formatos suportados como dispositivos de saída por groff, que é usado por man-db. Para uma lista de dispositivos de saída, veja a opção -T em groff(1) (ou mandoc(1) se você usar o pacote mandoc).\n\nIsso vai produzir um arquivo PDF:\n\n```\n$ man -Tpdf página_man > arquivo\n```\n\nRessalvas: Fontes são geralmente limitadas a Times em tamanhos fixos. Algumas páginas man foram projetadas especificamente para ver no terminal e não ficarão bem na forma de PS ou PDF.\n\n"
    },
    {
      "title": "Páginas man online",
      "level": 2,
      "content": "Há vários bancos de dado online de páginas man, incluindo:\n\n- Páginas de manual do Arch — contém páginas man de pacotes do Arch Linux. Usado para links de páginas man do wiki. Você também pode usar o bang !archman do DuckDuckGo para pesquisar pelas páginas de manual do Arch diretamente.\n- man7.org — O projeto man-pages do Linux. Upstream do pacote man-pages.\n- manned.org — coleção de várias distribuições Linux, BSD, etc. com múltiplas versões de pacotes\n- linux.die.net\n- man.cx\n- Páginas man do Debian\n- Páginas man do Ubuntu\n- Páginas man do DragonFlyBSD\n- Páginas man do FreeBSD\n- Páginas man do NetBSD\n- Páginas man do OpenBSD\n- Manual do Plan 9 — Volume 1\n- Manual do Inferno — Volume 1\n- Repositório de páginas man do UNIX and Linux Forums\n\nObserve que enquanto man-pages fornece as páginas man para POSIX.1 (veja [2][link inativo 2023-05-06 ⓘ]), uma referência online oficial também existe:\n\n- POSIX.1-2017\n\nHá também uma tabela comparativa dos bancos de dados online.\n\n"
    },
    {
      "title": "Páginas man notáveis",
      "level": 2,
      "content": "Aqui está uma lista não exaustiva de páginas dignas de nota que podem lhe ajudar a entender muitas coisas em profundidade. Alguns deles podem servir como uma boa referência (como a tabela ASCII).\n\n- ascii(7)\n- boot(7)\n- charsets(7)\n- chmod(1)\n- credentials(7)\n- fstab(5)\n- file-hierarchy(7)\n- systemd(1)\n- locale(1p), locale(5), locale(7)\n- printf(3)\n- proc(5)\n- regex(7)\n- signal(7)\n- term(5), term(7)\n- termcap(5)\n- terminfo(5)\n- utf-8(7)\n\nDe forma mais geral, dê uma olhada nas páginas de categoria 7 (miscelânea):\n\n```\n$ man -s 7 -k \".*\"\n```\n\nPáginas específicas do Arch Linux:\n\n- alpm-hooks(5)\n- libalpm(3)\n- makepkg(8)\n- makepkg.conf(5)\n- makepkg-template(1)\n- mkinitcpio(8)\n- pacman(8)\n- pacman.conf(5)\n- pacman-conf(8)\n- pacman-key(8)\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Gentoo:man page\n- Escrevendo o bom manual com pod2man\n\n"
    }
  ]
}