{
  "title": "Man Page (Русский)",
  "url": "https://wiki.archlinux.org/title/Man_Page_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Color output in console (Русский)#man\n\nman-страницы (от англ. manual — руководство) — справочные страницы, которые предоставляются почти всеми *nix-дистрибутивами, включая Arch Linux. Для их отображения служит команда man.\n\nman-страницы изначально подразумевались как самодостаточные документы. Они ограничены в возможностях ссылаться друг на друга, в отличие от поддерживающих гиперссылки info-файлов — попытки GNU создать замену традиционному формату man-страниц.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "man-db реализует man в Arch Linux, а less является просмотрщиком по умолчанию. Также можно использовать mandoc.\n\nman-pages предоставляет руководства Linux.\n\nРусский перевод доступен в man-pages-ru.\n\nМожно использовать приложения для просмотра руководств:\n\n- GNOME Help — Просмотрщик справки для GNOME. Он позволяет смотреть man-страницы через yelp man:<name> или недокументированным сочетанием клавиш Ctrl+L в существующем окне.\n\n- KHelpCenter — Приложения для документации KDE Applications. Man-страницы доступны в UNIX manual pages или при запуске khelpcenter man:<name>.\n\n- Konqueror — Файловый менеджер KDE и веб-браузер. Он может отображать man-страницы через man:<name>.\n\n- xman — Обеспечивает просмотр man-страниц по категориям.\n\n"
    },
    {
      "title": "Доступ к man-страницам",
      "level": 2,
      "content": "Чтобы отобразить man-страницу, наберите\n\n```\n$ man имя_страницы\n```\n\nСтраницы разделены на несколько разделов. Полный список разделов смотрите в man-pages(7).\n\nНа man-страницы принято ссылаться по имени, с указанием номера раздела в скобках. Часто существуют сразу несколько man-страниц с одинаковыми именами, но в разных категориях, например man(1) и man(7). В таком случае, команде man необходимо передать номер конкретного раздела перед именем man-страницы, например:\n\n```\n$ man 5 passwd\n```\n\nотобразит man-страницу по файлу /etc/passwd вместо утилиты passwd.\n\nИли можно указать номер раздела после названия страницы, отделив его точкой:\n\n```\n$ man passwd.5\n```\n\n"
    },
    {
      "title": "Поиск по страницам",
      "level": 2,
      "content": "Хотя команда man позволяет отображать man-страницы, возникает сложность, когда вы не знаете точного названия желаемой страницы. К счастью, вы можете воспользоваться поиском с помощью одной из этих эквивалентных команд:\n\n```\n$ man -k выражение\n$ man --apropos выражение\n$ apropos выражение\n```\n\nвыражение по умолчанию интерпретируется как регулярное выражение.\n\nЕсли вы хотите произвести более углубленный поиск по всему содержимому страниц, используйте опцию -K:\n\n```\n$ man -K password\n```\n\nВместо того, чтобы отображать man-страницу целиком, вы можете вывести лишь ее краткое описание, используя команду whatis. Например,\n\n```\n$ whatis ls\n```\n\n```\nls (1p)              - list directory contents\nls (1)               - list directory contents\n```\n\n"
    },
    {
      "title": "Ширина страницы",
      "level": 2,
      "content": "Ширина man-страниц регулируется переменной окружения MANWIDTH.\n\nЕсли ширина терминала слишком маленькая, переносы строк могут сломаться, что затруднит чтение. Можно исправить это установкой значения MANWIDTH при запуске man. В bash это можно сделать примерно так:\n\n```\n~/.bashrc\n```\n\n```\nman() {\n    local width=$(tput cols)\n    [ $width -gt $MANWIDTH ] && width=$MANWIDTH\n    env MANWIDTH=$width \\\n    man \"$@\"\n}\n```\n\n"
    },
    {
      "title": "Просмотр локальных страниц",
      "level": 2,
      "content": "Кроме утилиты man, для чтения man-страниц вы также можете использовать веб-браузер, например lynx или Firefox. Просмотр страниц в браузере позволяет воспользоваться основным преимуществом info-страниц — гиперссылками.\n\n"
    },
    {
      "title": "mandoc",
      "level": 4,
      "content": "Установите пакет mandoc. Чтобы конвертировать страницу, для примера, free(1), наберите:\n\n```\n$ mandoc -Thtml -Ostyle=style.css /usr/share/man/man1/free.1.gz > free.html\n```\n\nПолучившийся файл free.html теперь можно открыть в любом веб-браузере.\n\n"
    },
    {
      "title": "man2html",
      "level": 4,
      "content": "Установите man2html из официальных репозиториев.\n\nСконвертируйте страницу командой:\n\n```\n$ man free | man2html -compress -cgiurl man$section/$title.$section$subsection.html > ~/man/free.html\n```\n\nДругая полезная функция man2html — экспорт в обычный текстовый файл, который можно распечатать:\n\n```\n$ man free | man2html -bare > ~/free.txt\n```\n\n"
    },
    {
      "title": "man -H",
      "level": 4,
      "content": "Реализация утилиты man от GNU, также позволяет открыть страницу в веб-браузере:\n\n```\n$ man -H free\n```\n\nКоманда запустит браузер, установленный в переменной окружения BROWSER. Вы можете указать браузер явно, передав путь до исполняемого файла сразу после опции -H.\n\n"
    },
    {
      "title": "roffit",
      "level": 4,
      "content": "Установите пакет roffitAUR.\n\nДля конвертирования страницы выполните:\n\n```\n$ gunzip -c /usr/share/man/man1/free.1.gz | roffit > free.html\n```\n\n"
    },
    {
      "title": "Конвертирование в PDF",
      "level": 3,
      "content": "Man-страницы всегда были удобны для печати: они написаны в формате troff, который является типографским языком. Таким образом вы можете легко сконвертировать man-страницы в любой из форматов, который поддерживается в groff, который используется в man-db. Чтобы узнать список доступных устройств вывода, смотрите опцию -T в groff(1) (или mandoc(1) если вы используете пакет mandoc).\n\nЭта команда создаст PDF-файл:\n\n```\n$ man -Tpdf имястраницы > имяфайла\n```\n\nОбратите внимание, что шрифты главным образом ограничены набором Times и имеют жестко заданные размеры. Документ не будет содержать гиперссылок. Некоторые man-страницы форматировались так, чтобы выглядеть хорошо в терминале, однако могут отображаться некорректно в форме PostScript или PDF-документов.\n\n"
    },
    {
      "title": "Просмотр онлайн-страниц",
      "level": 2,
      "content": "Существуют множество онлайн-хранилищ man-страниц; вот небольшой список:\n\n- Arch manual pages содержит man-страницы пакетов Arch Linux. Используется для ссылок на man-страницы в этой вики. Также можно использовать !archman DuckDuckGo bang для прямого поиска по man-страницам Arch.\n- Man7.org. Первоисточник страниц для man-pages.\n- manned.org — коллекция из разных дистрибутивов Linux, BSD и т.д. Множество версий пакетов.\n- man-страницы на die.net\n- man.cx\n- man-страницы Debian GNU/Linux\n- репозиторий man-страниц Ubuntu\n- man-страницы DragonFlyBSD\n- man-страницы FreeBSD Hypertext\n- man-страницы NetBSD\n- man-страницы OpenBSD\n- Руководство Plan 9 — Том 1\n- Руководство Inferno — Том 1\n- man-страницы форума The UNIX and Linux Forums\n\nТакже есть сравнительная таблица.\n\n"
    },
    {
      "title": "Полезные страницы",
      "level": 2,
      "content": "Здесь приведен небольшой список полезных man-страниц, которые могут помочь вам получить более углубленные знания о множестве полезных вещей. Некоторые из них могут служить хорошими справочниками (например, таблица ASCII).\n\n- ascii(7)\n- boot(7)\n- charsets(7)\n- chmod(1)\n- credentials(7)\n- fstab(5)\n- hier(7)\n- systemd(1)\n- locale(1p), locale(5), locale(7)\n- printf(3)\n- proc(5)\n- regex(7)\n- signal(7)\n- term(5), term(7)\n- termcap(5)\n- terminfo(5)\n- utf-8(7)\n\nВам могут быть интересны также и другие страницы седьмой категории:\n\n```\n$ man -s 7 -k \".*\"\n```\n\nА также страницы, относящиеся непосредственно к Arch Linux:\n\n- alpm-hooks(5)\n- libalpm(3)\n- makepkg(8)\n- makepkg.conf(5)\n- makepkg-template(1)\n- mkinitcpio(8)\n- pacman(8)\n- pacman.conf(5)\n- pacman-conf(8)\n- pacman-key(8)\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Gentoo:man page\n- Write The Fine Manual with pod2man\n- History of UNIX Manpages\n\n"
    }
  ]
}