{
  "title": "Man page (Indonesia)",
  "url": "https://wiki.archlinux.org/title/Man_page_(Indonesia)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nman pages—singkatan untuk \"halaman panduan\" -adalah dokumentasi ekstensif yang telah terpasang dengan hampir semua substansial sistem operasi mirip-UNIX, termasuk Arch Linux. Perintah yang digunakan untuk menampilkannya adalah man.\n\nTerlepas dari ruang lingkupnya, halaman panduan dirancang untuk menjadi dokumen serba lengkap,secara konsekuen membatasi dirinya untuk mengacu ke halaman panduan yang lain ketika membahas subjek terkait. Hal ini sangat kontras dengan info berkas hyperlink-aware, upaya GNU menggantikan format tradisional pada halaman panduan.\n\nless adalah halaman bawaan yang digunakan dengan man.\n\n"
    },
    {
      "title": "Mengakses halaman panduan",
      "level": 2,
      "content": "Untuk membaca halaman panduan, secara sederhana ketikkan:\n\n```\n$ man nama_halaman\n```\n\nPanduan-panduan diurutkan menjadi beberapa bagian. Untuk daftar lengkapnya, lihat bagian berjudul \"Sections of the manual pages\" in man-pages(7).\n\nHalaman panduan biasanya dirujuk berdasarkan namanya, diikuti dengan jumlah bagiannya dalam tanda kurung. Sering kali ada beberapa halaman panduan dengan nama yang sama, seperti man(1) dan man(7). Dalam hal ini, memberikan nomor bagian pada man yang diikuti dengan nama halaman panduan, misalnya:\n\n```\n$ man 5 passwd\n```\n\nuntuk membaca halaman manual pada /etc/passwd, darpiada utilitas passwd.\n\nDeskripsi satu-baris (one-line) dari halaman panduan dapat ditampilkan dengan menggunakan perintah whatis. Misalnya, untuk penjelasan singkat dari bagian halaman panduan mengenai ls, ketik:\n\n```\n$ whatis ls\n```\n\n```\nls (1p)              - list directory contents\nls (1)               - list directory contents\n```\n\n"
    },
    {
      "title": "Format",
      "level": 2,
      "content": "Semua halaman panduan mengikuti format yang cukup standar, yang membantu dalam melakukan navigasi pada halaman panduan. Lihat bagian yang berjudul \"Sections within a manual page\" dalam man-pages(7).\n\n"
    },
    {
      "title": "Mencari panduan",
      "level": 2,
      "content": "Walaupun utilitas man memungkinkan pengguna untuk menampilkan halaman panduan, dan mencari isinya melalui less, masalah muncul ketika pengguna mengetahui bahwa bukan nama yang tepat dari halaman panduan yang diinginkan! Untungnya, opsi -k atau opsi --apropos dapat digunakan untuk mencari deskripsi halaman panduan pada kasus kata kunci tertentu.\n\nFitur penelitian disediakan oleh cache yang didedikasikan. Secara bawaan, Anda mungkin tidak memiliki cache apapun yang dibangun dan semua pencarian Anda, akan memberi Anda hasil nothing appropriate (yang tidak tepat). Anda dapat membuat atau memperbarui cache dengan menjalankan perintah\n\n```\n# mandb\n```\n\nAnda harus menjalankan perintah tersebut, setiap kali halaman panduan baru terpasang.\n\nSekarang Anda dapat memulai pencarian Anda. Misal, untuk mencari halaman panduan yang berkaitan dengan \"password\":\n\n```\n$ man -k password\n```\n\natau:\n\n```\n$ man --apropos password\n```\n\nHal ini sama dengan memanggil perintah apropos:\n\n```\n$ apropos password\n```\n\nKata kunci yang diberikan diinterpretasikan sebagai ekspresi reguler secara bawaan.\n\nJika Anda ingin melakukan pencarian yang lebih mendalam dengan menyesuaikan kata kunci yang ditemukan di seluruh artikel, Anda dapat menggunakan opsi -K:\n\n```\n$ man -K password\n```\n\n"
    },
    {
      "title": "Halaman panduan berwarna",
      "level": 2,
      "content": "Lihat Color output in console#man.\n\n"
    },
    {
      "title": "Lebar halaman dinamis",
      "level": 2,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nLebar halaman panduan dikendalikan oleh variable konfigurasi MANWIDTH.\n\nJika jumlah kolom pada terminal terlalu kecil (misal lebar layarnya sempit), jeda baris akan tidak akurat. Hal ini dapat sangat mengganggu ketika dibaca. Anda dapat memperbaiki hal ini dengan mengatur MANWIDTH pada invokasi man. Dengan Bash, akan menjadi seperti berikut:\n\n```\n~/.bashrc\n```\n\n```\nman() {\n    local width=$(tput cols)\n    [ $width -gt $MANWIDTH ] && width=$MANWIDTH\n    env MANWIDTH=$width \\\n    man \"$@\"\n}\n```\n\nJangan ragu untuk mengombinasikan fungsi ini dengan color settings.\n\n"
    },
    {
      "title": "Membaca halaman panduan lokal",
      "level": 2,
      "content": "Sebagai ganti antarmuka yang standar, menggunakan peramban seperti lynx dan Firefox untuk melihat halaman panduan yang memungkinkan pengguna mendapatkan manfaat utama halaman informasi dari teks hyperlink. Alternatifnya meliputi sebagai berikut:\n\n- Para pengguna KDE dapat membaca halaman panduan di Konqueror menggunakan man:<name>.\n- xorg-xman menyajikan tampilan halaman panduan yang terkategorikan pada X.\n- Bantuan Peramban (Help Browseer) GNOME yelp dapat digunakan melalui yelp man:<name>.\n\n"
    },
    {
      "title": "mandoc",
      "level": 4,
      "content": "Pasang mandoc dari AUR. Untuk mengonversikan sebuah halaman, misalnya free(1):\n\n```\n$ gunzip -c /usr/share/man/man1/free.1.gz | mandoc -Thtml -Ostyle=style.css 1> free.html\n```\n\nBuka berkas yang bernama free.html pada peramban Anda.\n\n"
    },
    {
      "title": "man2html",
      "level": 4,
      "content": "Pertama, pasang man2html dari repositori resmi.\n\nLalu, konversikan halaman panduan:\n\n```\n$ man free | man2html -compress -cgiurl man$section/$title.$section$subsection.html > ~/man/free.html\n```\n\nPenggunaan lain dari man2html adalah mengonversi ke berkas raw, teks yang kompatibel dengan mesin cetak:\n\n```\n$ man free | man2html -bare > ~/free.txt\n```\n\n"
    },
    {
      "title": "man -H",
      "level": 4,
      "content": "Implementasi GNU pada pandual di dalam repositori Archjuga juga memiliki kemampuan untuk melakukan hal tersebut dengan cara:\n\n```\n$ man -H free\n```\n\nHal ini akan membaca BROWSER environment variable Anda untuk menentukan peramban. Anda dapat mengganti ini dengan cara melewati biner ke opsi -H.\n\n"
    },
    {
      "title": "roffit",
      "level": 4,
      "content": "Pertama-tama pasang roffitAUR dariAUR.\n\nUntuk mengonversi halaman panduan:\n\n```\n$ gunzip -c /usr/share/man/man1/free.1.gz | roffit > free.html\n```\n\n"
    },
    {
      "title": "Mengonversi ke PDF",
      "level": 3,
      "content": "Halaman panduan selalu bisa dicetak: ditulis dalam troff, yang pada dasarnya merupakan suatu bahasa penyusunan huruf (typesetting). Jika Anda telah memasang ghostscript, mengonversi sebuah halaman panduan ke PDF sangatlah mudah: man -t <manpage> | ps2pdf - <pdf>. Berikut hasil dari pencarian gambar google memberikan Anda gambaran akan terlihat seperti apa hasilnya; mungkin bukan kesukaan semua orang.\n\nCaveats: Huruf-huruf umumnya terbatas pada Times dengan ukuran hardcoded. Tidak ada hyperlink. Beberapa halaman panduan didesain khusus untuk tampilan terminal, dan tidak akan terlihat baik pada format PS atau PDF.\n\nBerikut skrip dalam bahasa perl untuk mengonversi halaman panduan ke PDF, penyimpanan sementara PDF di dalam direktori $HOME/.manpdf/, dan secara khusus gunakan penampil PDF, seperti mupdf.\n\n```\nUsage: manpdf [<section>] <manpage>\n```\n\n```\n#!/usr/bin/perl\nuse File::stat;\n\n$pdfdir = $ENV{\"HOME\"}.\"/.manpdf\";\n-d $pdfdir || mkdir $pdfdir || die \"can't create $pdfdir\";\n$manpage = $ARGV[0];\nchop($manpath = `man -w $manpage`);\ndie if $?;\n\n$maninfo = stat($manpath) or die;\n$manpath =~ s@.*/man./(.*)(\\.(gz|bz2))?$@$1@;\n$pdfpath = \"$pdfdir/$manpath.pdf\";\n$pdftime = 0;\nif (-f $pdfpath) {\n    $pdfinfo = stat($pdfpath) or die;\n    $pdftime = $pdfinfo->mtime;\n}\nif (!-f $pdfpath || $maninfo->mtime > $pdftime) {\n    system \"man -t $manpage | ps2pdf -dPDFSETTINGS=/screen - $pdfpath\";\n}\ndie if !-f $pdfpath;\nif (!fork) {\n    open(STDOUT, \"/dev/null\");\n    open(STDERR, \"/dev/null\");\n    exec \"mupdf\", \"-r\", \"96\", $pdfpath;\n    #exec \"acroread\", $pdfpath;\n}\n```\n\n"
    },
    {
      "title": "Halaman Panduan berbasis Online",
      "level": 2,
      "content": "Ada beberapa basis datas halaman panduan yang berbasis online, termasuk:\n\n- Man7.org. Upstream for Arch Linux's man-pages.\n- manned.org—collection from various Linux distributions, BSD, etc., with multiple package versions.\n- linux.die.net\n- man.cx—Man pages extracted from Debian testing.\n- Debian man pages\n- Ubuntu man pages\n- DragonFlyBSD man pages\n- FreeBSD man pages\n- NetBSD man pages\n- OpenBSD man pages\n- Plan 9 Manual — Volume 1\n- Inferno Manual — Volume 1\n- The UNIX and Linux forums man page repository\n\n"
    },
    {
      "title": "Halaman panduan penting",
      "level": 2,
      "content": "Berikut daftar non-komplit dari halaman penting yang dapat membantu Anda memahami banyak hal secara lebih mendalam. Beberapa dari daftar di bawah ini dapat menjadi referensi yang bagus (seperti tabel ASCII).\n\n- ascii(7)\n- boot(7)\n- charsets(7)\n- chmod(1)\n- credentials(7)\n- fstab(5)\n- hier(7)\n- systemd(1)\n- locale(1p), locale(5), locale(7)\n- printf(3)\n- proc(5)\n- regex(7)\n- signal(7)\n- term(5), term(7)\n- termcap(5)\n- terminfo(5)\n- utf-8(7)\n\nSecara lebih umum, lihatlah kategori 7 pada halaman panduan:\n\n```\n$ man -s 7 -k \".*\"\n```\n\nHalaman khusus Arch Linux:\n\n- alpm-hooks(5)\n- libalpm(3)\n- makepkg(8)\n- makepkg.conf(5)\n- makepkg-template(1)\n- mkinitcpio(8)\n- pacman(8)\n- pacman.conf(5)\n- pacman-conf(8)\n- pacman-key(8)\n\n"
    },
    {
      "title": "Lihat juga",
      "level": 2,
      "content": "- man page - Gentoo wiki article\n- Setting colors for less dan solving related problems (thread di StackExchange)\n- Write The Fine Manual with pod2man\n\n"
    }
  ]
}