{
  "title": "MATE (한국어)",
  "url": "https://wiki.archlinux.org/title/MATE_(%ED%95%9C%EA%B5%AD%EC%96%B4)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Cinnamon\n- Desktop environment\n- Display manager\n- GNOME\n- Uniform look for Qt and GTK applications\n\nFrom MATE homepage:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "MATE can be installed with one of the following:\n\n- The mate group contains the core desktop environment required for the standard MATE experience.\n- The mate-extra group contains additional utilities and applications that integrate well with the MATE desktop. Installing just the mate-extra group will not pull in the whole mate group via dependencies. If you want to install all MATE packages then you will need to explicitly install both groups.\n\nThe base desktop consists of marco, mate-panel and mate-session-manager.\n\n"
    },
    {
      "title": "MATE applications",
      "level": 3,
      "content": "MATE is largely composed of GNOME 2 applications and utilities, forked and renamed to avoid conflicting with their GNOME 3 counterparts. Below is a list of common GNOME applications which have been renamed in MATE.\n\nTable content:\nApplication | GNOME 2 | MATE\nMenu editor | Alacarte | mozo\nFile manager | Nautilus | caja\nWindow manager | Metacity | marco\nText editor | Gedit | pluma\nImage viewer | Eye of GNOME | Eye of MATE (eom)\nDocument viewer | Evince | atril\nArchive manager | File Roller | engrampa\n\nOther applications and core components prefixed with GNOME (such as GNOME Terminal, GNOME Panel, GNOME Menus, etc.) have had the prefix changed to MATE so they become MATE Panel, MATE Menus etc.\n\n"
    },
    {
      "title": "Additional MATE packages",
      "level": 3,
      "content": "There are a number of other unofficial MATE applications that are contributed to and maintained by the MATE community and therefore not included in the mate or mate-extra groups.\n\n- Dock Applet — Application dock for the MATE panel.\n\n- Online Radio Applet — A MATE panel applet to let you play your favourite online radio station with a single click.\n\n- MATE Menu — Advanced menu for MATE Panel, a fork of MintMenu.\n\n- MATE Tweak — Tweak tool for MATE, a fork of mintDesktop.\n\n- BriskMenu — Modern, efficient menu for the MATE Desktop Environment from SolusOS distribution.\n\nAdditional packages need to be installed to take advantage of some of Caja's advanced features - see File manager functionality.\n\n"
    },
    {
      "title": "Starting MATE",
      "level": 2,
      "content": "Choose MATE from the menu in a display manager of choice.\n\nAlternatively, to start MATE with startx, append exec mate-session to your ~/.xinitrc file.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "MATE can be configured with its Control Center application (mate-control-center) provided by the mate-control-center package. To manage some hardware, you may need to install additional tools.\n\n"
    },
    {
      "title": "Accessibility",
      "level": 3,
      "content": "MATE is well suited for use by individuals with sight or mobility impairment. Install orca, espeakAUR (Screen reader for individuals who are blind or visually impaired) and onboard (On-screen keyboard useful for mobility impaired users)\n\nBefore starting MATE for the first time, enter the following command as the user who needs accessibility features:\n\n```\n$ gsettings set org.mate.interface accessibility true\n```\n\nOnce you start MATE, you can configure the accessibility applications via System > Preferences > Assistive Technologies, although if you need Orca, you will need to run it from the Alt-F2 run window in order to start getting speech.\n\n"
    },
    {
      "title": "Notifications",
      "level": 3,
      "content": "To disable the notification on battery discharge, run:\n\n```\n$ gsettings set org.mate.power-manager notify-discharging false\n```\n\nSee Backlight#Kernel command-line options.\n\n"
    },
    {
      "title": "Disabling compositing",
      "level": 3,
      "content": "Compositing is enabled by default. To disable it, navigate to Look and Feel > Windows > General in the System Preferences and tick the box alongside Enable software compositing window manager. Alternatively, you can run the following from the terminal:\n\n```\n$ gsettings set org.mate.Marco.general compositing-manager false\n```\n\n"
    },
    {
      "title": "Disabling new window centering",
      "level": 3,
      "content": "By default, new windows are placed in the center. To disable centering new windows, navigate to run Windows > Placement in the System Preferences and tick the box alongside Center new windows. Alternatively, you can run the following from the terminal:\n\n```\n$ gsettings set org.mate.Marco.general center-new-windows false\n```\n\n"
    },
    {
      "title": "Disabling window snapping",
      "level": 3,
      "content": "Window snapping is enabled by default. To disable it, navigate to run Windows > Placement in the System Preferences and tick the box alongside Enable window tiling. Alternatively, you can run the following from the terminal:\n\n```\n$ gsettings set org.mate.Marco.general allow-tiling false\n```\n\n"
    },
    {
      "title": "Undecorating maximized windows",
      "level": 3,
      "content": "Hiding the decorations of maximized windows is possible with the use of mate-tweakAUR tool; after installation navigate to Look and Feel > MATE Tweak > Windows in the System Preferences and enable Undecorate maximized windows in the Window Behaviour section.\n\n"
    },
    {
      "title": "Show or hide desktop icons",
      "level": 3,
      "content": "By default, MATE shows multiple icons on the desktop: the content of your desktop directory, computer, home and network directories, the trash and mounted drives. You can show or hide them individually or all at once using gsettings.\n\n"
    },
    {
      "title": "Hide all desktop icons",
      "level": 4,
      "content": "```\n$ gsettings set org.mate.background show-desktop-icons false\n```\n\nDoing so may cause some graphics artifacts on secondary monitors.\n\n"
    },
    {
      "title": "Hide individual icons",
      "level": 4,
      "content": "Hide computer icon:\n\n```\n$ gsettings set org.mate.caja.desktop computer-icon-visible false\n```\n\nHide user directory icon:\n\n```\n$ gsettings set org.mate.caja.desktop home-icon-visible false\n```\n\nHide network icon:\n\n```\n$ gsettings set org.mate.caja.desktop network-icon-visible false\n```\n\nHide trash icon:\n\n```\n$ gsettings set org.mate.caja.desktop trash-icon-visible false\n```\n\nHide mounted volumes:\n\n```\n$ gsettings set org.mate.caja.desktop volumes-visible false\n```\n\nReplace false with true for the icons to reappear.\n\n"
    },
    {
      "title": "Use a different window manager",
      "level": 3,
      "content": "The marco window manager can be replaced with another window manager via either of the following methods:\n\nExecute the following to specify a different window manager for MATE:\n\n```\n$ gsettings set org.mate.session.required-components windowmanager wm-name\n```\n\nYou can autostart a window manager of your choice using mate-session-properties. This means that the autostarted window manager will replace the default window manager at login. Navigate to Startup Applications in the System Preferences. In the dialog click Add. The command should take the syntax wm-name --replace.\n\n"
    },
    {
      "title": "Prevent Caja from managing the desktop",
      "level": 3,
      "content": "To prevent Caja from managing the desktop, execute the following:\n\n```\n$ gsettings set org.mate.background show-desktop-icons false\n$ killall caja  # Caja will be restarted by session manager\n```\n\n"
    },
    {
      "title": "Change window decoration button order",
      "level": 3,
      "content": "You can change the button order using the graphical dconf-editor or the gsettings command line tool:\n\n```\n$ gsettings set org.mate.Marco.general button-layout 'close,maximize,minimize:'\n```\n\nand put menu, close, minimize and maximize in your desired order, separated by commas. The colon is used to specify on which side of the titlebar the window buttons will appear and must be used for the changes to apply.\n\n"
    },
    {
      "title": "Auto open file manager after drive mount",
      "level": 3,
      "content": "By default, MATE automatically opens a new file manager window when a drive is mounted. To disable this:\n\n```\n$ gsettings set org.mate.media-handling automount-open false\n```\n\nAnd to disable automounting:\n\n```\n$ gsettings set org.mate.media-handling automount false\n```\n\n"
    },
    {
      "title": "Spatial view in Caja",
      "level": 3,
      "content": "To ensure that each new folder opens in a new window (known as spatial view), open Caja's preferences dialog, click on the behaviour tab and tick the 'Open each folder in its own window' option. Alternatively, execute the following command which achieves the same effect:\n\n```\n$ gsettings set org.mate.caja.preferences always-use-browser false\n```\n\n"
    },
    {
      "title": "Change font DPI setting",
      "level": 3,
      "content": "You can alter the DPI (dots per inch) of the fonts in MATE by right-clicking on the desktop and choosing Change desktop background > Fonts > Details > Resolution.\n\n"
    },
    {
      "title": "Change applications menu icon",
      "level": 3,
      "content": "By default, the applications menu icon is set to start-here. To use a different icon, copy your icon to a folder such as /usr/local/share/pixmaps and execute the following:\n\n```\n$ gsettings set org.mate.panel.menubar icon-name icon\n```\n\nwhere icon is the name of your icon. Do not include the file extension in the icon name. Finally, restart MATE Panel.\n\n"
    },
    {
      "title": "Panel speed settings",
      "level": 3,
      "content": "To adjust the amount of time it takes for the panel to disappear or reappear when autohide is enabled, execute the following:\n\n```\n$ dconf write /org/mate/panel/toplevels/panel/(un)hide-delay time\n```\n\nwhere panel is either top or bottom and time is a value in miliseconds, e.g. 300.\n\nTo set the speed at which panel animations occur, execute the following:\n\n```\n$ dconf write /org/mate/panel/toplevels/panel/animation-speed value\n```\n\nwhere panel is either top or bottom and value is either \"'fast'\", \"'medium'\" or \"'slow'\".\n\n"
    },
    {
      "title": "Set the terminal for caja-open-terminal",
      "level": 3,
      "content": "The caja-open-terminal extension uses GSettings to determine which terminal to use - mate-terminal is the default. To change the terminal that will be used, run the following command\n\n```\n$ gsettings set org.mate.applications-terminal exec my-terminal\n```\n\nwhere my-terminal is the name of the terminal executable to be launched, for example: xterm.\n\n"
    },
    {
      "title": "Toggling compositing",
      "level": 3,
      "content": "Some software may have issues rendering graphics when working on an environment using the NVIDIA proprietary drivers and a compositing window manager.\n\nTo easily toggle the compositing feature, save the following script somewhere within the Home directory:\n\n```\n~/.scripts/compositing.sh\n```\n\n```\n#!/bin/sh\nif [ \"$(gsettings get org.mate.Marco.general compositing-manager)\" = \"true\" ]\nthen\n  gsettings set org.mate.Marco.general compositing-manager false\nelse\n  gsettings set org.mate.Marco.general compositing-manager true\nfi\n```\n\nand then create a custom keyboard shortcut that executes the file, e.g. Ctrl+Alt+C, to sh ~/.scripts/compositing.sh.\n\n"
    },
    {
      "title": "Vertical sync for compositing",
      "level": 3,
      "content": "Mate's window manager, marco, supports tear-free software compositing via DRI3/Xpresent. [1]\n\nIf your graphics driver does not support DRI3 (e.g. the Nvidia Proprietary driver), marco does not support vertical synchronization via OpenGL, which may cause video tearing with enabled compositing. [2] In this case, consider a different composite manager with OpenGL support such as picom.\n\n"
    },
    {
      "title": "Consistent cursor theme",
      "level": 3,
      "content": "See Cursor themes#Desktop environments.\n\n"
    },
    {
      "title": "Use of gradient backgrounds with LightDM",
      "level": 3,
      "content": "If you wish to use the default MATE (1.8) Stripes background as the LightDM background as well so as to make for seamless transition from LightDM to MATE, you will find that it is runtime-constructed from a grayscale PNG upon which MATE layers a vertical blue-to-green gradient, something which LightDM does not currently support. If insistent, you can work around this by temporarily setting /org/mate/desktop/background/show-desktop-icons to false, either through the dconf-editor tool available from the System Tools menu or by running\n\n```\n$ gsettings set org.mate.background show-desktop-icons false\n```\n\nfrom the Alt-F2 Run Application dialog, then running killall mate-panel from said dialog and hitting Print Screen before the panel reappears. You are then presented with a Save As dialog for exactly that fully rendered, screen-sized PNG that you need for LightDM. Run\n\n```\n$ gsettings set org.mate.background show-desktop-icons true\n```\n\nto have your desktop icons reappear, if desired.\n\n"
    },
    {
      "title": "Enabling panel shadow",
      "level": 3,
      "content": "Due to a race condition, the panel shadow does not appear after logging in to the MATE desktop, even with compositing enabled. [3]\n\nCopy /usr/share/applications/marco.desktop and add a delay:\n\n```\n~/.local/share/applications/marco.desktop\n```\n\n```\nX-MATE-Autostart-Phase=Applications\nX-MATE-Autostart-Delay=2\nX-MATE-Provides=windowmanager\nX-MATE-Autostart-Notify=true\n```\n\nIf this has no effect, increase the delay duration.\n\n"
    },
    {
      "title": "Logout/shutdown delayed by at-spi-registryd",
      "level": 3,
      "content": "When logging out or shutting down, you may find that you are presented with an A program is still running: at-spi-registryd.desktop popup. As a workaround, you can prevent at-spi-registryd from starting - see GTK#Suppress warning about accessibility bus - though this may have an effect on some accessibility features.\n\n"
    },
    {
      "title": "Caja's text file preview",
      "level": 3,
      "content": "Since the migration to GTK 3 this feature is not working.[4]\n\n"
    },
    {
      "title": "GTK 2 applications seem to ignore default MATE themes",
      "level": 3,
      "content": "Themes that come with mate-themes need optional dependencies gtk-engines and gtk-engine-murrine for GTK 2 themes to function properly.\n\n"
    },
    {
      "title": "Extra decoration on CSD applications",
      "level": 3,
      "content": "An extra decoration can appear on CSD applications (Firefox, Visual Studio Code...) when they are unmaximized.[5]\n\nUninstalling the package mate-netbook solves the issue.\n\n"
    },
    {
      "title": "Keyboard layout selector",
      "level": 3,
      "content": "When multiple keyboard layouts are enabled, a layout selection icon is displayed in the system tray. Because of a bug ([6]), depending on the currently used theme, it sometimes happens to be displayed with white font on bright background (or in some other barely legible configuration, such as with green font).\n\nThis issue can be worked around by manually setting the font color (e.g., '0 0 0' for black):\n\n```\n$ gsettings set org.mate.peripherals-keyboard-xkb.indicator foreground-color '0 0 0'\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- MATE homepage\n- MATE wiki for Arch Linux\n- MATE desktop screenshots\n- The MATE Desktop Environment - Arch Linux forum discussion about MATE (Thread closed on 2017-01-05)\n\n"
    }
  ]
}