{
  "title": "Mediatomb",
  "url": "https://wiki.archlinux.org/title/Mediatomb",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Streaming media\n\nGerbera is an open source UPnP media server with a web interface. It allows you to stream your digital media through your home network and listen to/watch it on a variety of UPnP compatible devices. It is a fork of the now-defunct MediaTomb.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the gerbera package.\n\nBy default, Gerbera sets up its own sqlite database. Alternatively, to use it with an external MariaDB server, uncomment the line containing WITH_MYSQL prior to building and see the official documentation for more information.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Gerbera may be configured and run per-user or as a system-wide daemon.\n\n"
    },
    {
      "title": "Per-user",
      "level": 3,
      "content": "To create the configuration file for the current user:\n\n```\n$ mkdir -p ~/.config/gerbera\n$ gerbera --create-config > ~/.config/gerbera/config.xml\n```\n\nThen run gerbera to start it.\n\n"
    },
    {
      "title": "System-wide",
      "level": 3,
      "content": "The system-wide configuration file should be created by the gerbera user:\n\n```\n[gerbera]$ gerbera --create-config > /etc/gerbera/config.xml\n```\n\nThen start/enable gerbera.service to start the daemon.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "The daemon listens on port 50500 by default. To access the web interface and begin importing media, navigate to http://localhost:50500/ in your favorite browser.\n\nIf running a per-user instance, the default port is 49152. However, it is possible that the port will change upon server restart. The URL for the web interface is output during startup. Users may also specify the port manually:\n\n```\n$ gerbera -p 50500\n```\n\n"
    },
    {
      "title": "Hiding full paths from media players",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nBy default, full directory paths will be shown on devices when they are browsing through folders.\n\nFor example, if you add the directory /media/my_media/video_data/videos/movies, anyone connecting will have to navigate to the 'movies' directory from the root.\n\nTo hide all of that and only show the directory added, you can change the import script.\n\nFor example, this script will automatically truncate the whole directory structure specified in the variable video_root. Any directories added directly under the video root path will show up on UPnP devices starting from the that folder rather than /.\n\n```\nfunction addVideo(obj)\n{\n   var video_root = \"/media/main_core/Server_Core_Folder/FTP_Services/Media/\";\n\n   var absolute_path = obj.location;\n\n   var relative_path = absolute_path;\n\n   if(absolute_path.indexOf(video_root) == 0)\n      relative_path = absolute_path.replace(video_root, \"\")\n\n  var chain = new Array();\n\n  var pathSplit = relative_path.split(\"/\");\n\n  for(var i = 0; i < pathSplit.length - 1; i++) \n      chain.push(pathSplit[i]);\n\n  addCdsObject(obj, createContainerChain(chain));\n}\n```\n\nTo also hide the default PC Directory folder from UPnP device directory listings, add the following directly under the server node of your config.xml file.\n\n```\n<pc-directory upnp-hide=\"yes\"/>\n```\n\n"
    },
    {
      "title": "Playstation 3 Support",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nThe following notes assume MediaTomb is running as a system-wide daemon. For a per-user install, the locations of the configuration file will be different (see above).\n\nFor PlayStation 3 support, users must set <protocolInfo extend=\"yes\"/>. An \"avi\" mimetype mapping should also be uncommented for DivX support.\n\n```\n/var/lib/mediatomb/.mediatomb/config.xml\n```\n\n```\n...\n\n<protocolInfo extend=\"yes\"/>\n\n...\n\n<map from=\"avi\" to=\"video/divx\"/>\n\n...\n```\n\nWhen importing media to the database, MediaTomb will create a virtual container layout as defined by the <virtual-layout type=\"...\"> option. That is, media will be organized according to metadata (album, artist, etc.) through creation of virtual database objects. If your media is already organized on the file system, you may disable this feature to significantly improve import performance:\n\n```\n/var/lib/mediatomb/.mediatomb/config.xml\n```\n\n```\n...\n\n<virtual-layout type=\"disabled\"/>\n\n...\n```\n\nUsers may customize the import script to fine-tune the virtual layout. The Scripting section of the MediaTomb wiki provides several examples. Starting with the built-in script available at /usr/share/mediatomb/js/import.js:\n\n```\n$ cp /usr/share/mediatomb/js/import.js /var/lib/mediatomb/.mediatomb/\n```\n\n... and edit /var/lib/mediatomb/.mediatomb/import.js as desired. To utilize the customized script, users must set <virtual-layout type=\"js\"> and specify the script's location.\n\n```\n/var/lib/mediatomb/.mediatomb/config.xml\n```\n\n```\n...\n\n<virtual-layout type=\"js\">\n  <import-script>/var/lib/mediatomb/.mediatomb/import.js</import-script>\n</virtual-layout>\n\n...\n```\n\nYou may have to specify a network interface before MediaTomb will be recognized:\n\n```\n/var/lib/mediatomb/.mediatomb/config.xml\n```\n\n```\n<server>\n...\n  <interface>network interface</interface>\n...\n</server>\n```\n\nAfter configuring MediaTomb to your liking, restart mediatomb.service.\n\n"
    },
    {
      "title": "Gerbera does not provide content even though it is added in the webfrontend",
      "level": 3,
      "content": "Be aware of the fact that the user Gerbera runs under, has to have read rights on the files that are added to be able to provide them.\n\nSo if Gerbera runs under the user 'gerbera' the (video-)files either have to be owned by the user 'gerbera' and need to be readable or the files and the user 'gerbera' have to belong to the same group with the file being readable ('gerbera' has to be in the group to which the file belongs (the file then needs the read rights for the group to be set)).\n\n"
    },
    {
      "title": "The Client loses connection after 30 Minutes",
      "level": 3,
      "content": "Apparently this is related to SSNP message only being sent once which results in the Client dropping its connection in 30 minutes since it thinks the server is gone.\n\nIn the config.xml add the alive tag:\n\n```\n<alive>180</alive>\n```\n\nDefault is 180. See https://docs.gerbera.io/en/stable/config-server.html#alive.\n\n"
    }
  ]
}