{
  "title": "Meta package (Español)",
  "url": "https://wiki.archlinux.org/title/Meta_package_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-11** \n\nUn meta paquete y un grupo de paquetes pueden ser definidos por el empaquetador para denotar un conjunto de paquetes relacionados. Ambos pueden permitir instalar o desinstalar este conjunto de paquetes simultáneamente utilizando el nombre del meta paquete o grupo como sustituto del nombre de cada paquete individual. Si bien un grupo no es un paquete, se puede instalar de manera similar a un paquete, véase Instalar grupos de paquetes y PKGBUILD (Español)#groups.\n\n"
    },
    {
      "title": "Diferencia entre meta paquete y grupo de paquetes",
      "level": 2,
      "content": "La diferencia entre un meta paquete y un paquete normal es que un meta paquete está vacío y existe únicamente para vincular paquetes relacionados mediante dependencias. Un meta paquete, a menudo (aunque no siempre) titulado con el sufijo \"-meta\", proporciona una funcionalidad similar a un grupo de paquetes, ya que permite instalar o desinstalar múltiples paquetes relacionados simultáneamente.\n\nCada solución tiene ventajas y desventajas:\n\nmeta paquete:\n\n- Los meta paquetes se pueden instalar como cualquier otro paquete (véase Instalar paquetes específicos).\n- Los meta paquetes se pueden eliminar como cualquier otro paquete (véase Desinstalar paquetes).\n- Los nuevos paquetes miembros se instalarán cuando el meta paquete en sí se actualice con un nuevo conjunto de dependencias.\n- Los usuarios no pueden elegir qué dependencias del meta paquete desean instalar.\n- Los usuarios no pueden eliminar las dependencias del meta paquete sin tener que desinstalar el meta paquete en sí.\n\ngrupo:\n\n- Los grupos de paquetes solicitarán a los usuarios que seleccionen los paquetes del grupo que desean instalar (véase Instalar grupos de paquetes).\n- Los usuarios no pueden desinstalar un grupo porque instalaron una lista de paquetes.\n\nEn cambio, pacman -R nombre_de_grupo intenta eliminar a todos los miembros del grupo.\n\n- Los nuevos miembros del grupo no se instalarán automáticamente.\n- Los usuarios pueden elegir qué miembros del grupo desean instalar.\n- Los usuarios pueden desinstalar miembros del grupo sin tener que eliminar todo el grupo.\n\n"
    },
    {
      "title": "Meta paquetes",
      "level": 2,
      "content": "El meta paquete más importante es base. Contiene un conjunto mínimo de paquetes que define una instalación básica de Arch Linux. Incluye:\n\n- básicos como glibc y bash,\n- cosas relacionadas con la distribución como pacman y systemd\n- herramientas POSIX como core utilities, procesos y utilidades de compresión y archivado\n- herramientas de red como iproute2\n\nEl kernel es una dependencia opcional. Véase el anuncio cuando se introdujo, y el razonamiento de por qué base es un meta paquete.\n\n"
    },
    {
      "title": "Grupos",
      "level": 2,
      "content": "El grupo de paquetes más importante es base-devel. Contiene herramientas necesarias para construir muchos paquetes como GCC y make. Véase también makepkg (Español)#Utilización.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Listado de todos los grupos de paquetes\n- Ejemplos: GNOME (Español)#Instalación KDE (Español)#Instalación i3#Installation\n\n- GNOME (Español)#Instalación\n- KDE (Español)#Instalación\n- i3#Installation\n\n"
    }
  ]
}