{
  "title": "Metric-compatible fonts (Español)",
  "url": "https://wiki.archlinux.org/title/Metric-compatible_fonts_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Fonts (Español)\n- Microsoft fonts (Español)\n\nFuentes métricamente compatibles son fuentes que emparejan las métricas (i.e. dimensiones de glifos) de otra fuente (usualmente genéricas como Helvetica, Times o Courier). Debido a sus métricas parejas, reemplazar una fuente con otra fuente alternativa métricamente compatible no cambia el formato de un documento o página web. Dichas fuentes son usualmente desarrolladas por sistemas FOSS para mostrar páginas correctamente.\n\n"
    },
    {
      "title": "Lista de fuentes métricamente compatibles",
      "level": 2,
      "content": "En la siguiente tabla, familias de fuentes comunmente especificadas son mostradas en negrita. Esta tabla está a grandes rasgos basada en 30-metric-aliases.conf de fontconfig y en páginas de Wikipedia para cada fuente.\n\nTable content:\nPostScript | URW | GUST | GNU | Microsoft | Liberation | CrOS | StarOffice\nHelvetica | Nimbus Sans, A030 | TeX Gyre Heros | FreeSans | Arial | Liberation Sans | Arimo | Albany\nTimes | Nimbus Roman | TeX Gyre Termes | FreeSerif | Times New Roman | Liberation Serif | Tinos | Thorndale\nCourier | Nimbus Mono | TeX Gyre Cursor | FreeMono | Courier New | Liberation Mono | Cousine | Cumberland\nHelvetica Condensed | Nimbus Sans Narrow | TeX Gyre Heros Cn |  | Arial Narrow | Liberation Sans Narrow |  | \n |  |  |  | Georgia |  | Gelasio | \nWingdings (PS3) | URWDings, New Dingbats |  |  | Wingdings |  |  | \n\nTable content:\nMicrosoft | CrOS\nCambria | Caladea\nCalibri | Carlito\nSymbol | SymbolNeu\n\nTable content:\nMicrosoft | FOSS\nSegoe UI | Selawik\nTahoma | Wine Tahoma\n\nTable content:\nMicrosoft | Type Design\nConsolas | DMCA Sans Serif\n\nTable content:\nGNU | Type Design\nUnifont | Kissinger 2\n\nTable content:\nPostScript | URW | GUST | Windows\nITC Avant Garde Gothic | URW Gothic | TeX Gyre Adventor | Century Gothic\nITC Bookman | Bookman URW | TeX Gyre Bonum | Bookman Old Style\nITC Zapf Chancery | Chancery URW, Z003 | TeX Gyre Chorus | Monotype Corsiva\nPalatino | Palladio URW, P052 | TeX Gyre Pagella | Palatino Linotype, Book Antiqua\nNew Century Schoolbook | Century SchoolBook URW, C059 | TeX Gyre Schola | Century Schoolbook\nITC Zapf Dingbats | Dingbats, D050000L\n\nTable content:\nPostScript | URW\nOptima | URW Classico\nAntique Olive | Antique Olive\nUnivers | URW Classic Sans, U001\nClarendon Bold Condensed | Clarendon URW Bold Condensed, C011 Bold Condensed\nCoronet | Coronet\nLetter Gothic | Letter Gothic\nMarigold | Mauritius\nAlbertus | Algiers, A028\nGaramond | Garamond No. 8\n\n"
    },
    {
      "title": "PostScript",
      "level": 3,
      "content": "El lenguaje PostScript define 35 fuentes principales en PostScript 2. URW sacó versiones open-source/clones de estas 35 fuentes para w:ghostscript, disponibles como gsfonts. Proyectos incluyendo TeX Gyre de GUST y GNU FreeFont sacan versiones mejoradas de estas fuentes.\n\nPostScript 3 define 101 fuentes adicionales, muchas de las cuales las dispone URW baja la AFPL en GhostPDL[enlace roto 2025-01-22]. La AFPL prohibe uso comercial. Muchos de los nombres de fuentes duales son causados por una actualización por lotes[enlace roto 2025-01-22].\n\n"
    },
    {
      "title": "Garamond",
      "level": 4,
      "content": "Garamond No.8 de URW's solo provee un tamaño óptico (8pt). Se puede usar EB Garamond para tener más características de OpenType, incluyendo el tamaño de 12pt. Sin embargo, no es garantizado que sea idénticamente metrado.\n\n"
    },
    {
      "title": "Microsoft",
      "level": 3,
      "content": "Microsoft encanasta varias fuentes con Microsoft Windows y Microsoft Office. Si bien algunas de estas fuentes son solo versiones inferiores (o parecidas) de las familias PostScript correspondientes; Cambria y Calibri (la fuente por defecto desde MS Office 2007) son independientes de otras familias. Microsoft solía proveer muchas de sus fuentes principales en su proyecto Core fonts for the Web. A pesar de que este proyecto ya no está disponible en el sitio de Microsoft, los términos de la licencia que permitieron a esas fuentes ser distribuidos por sitios de terceras partes hacen a paquetes como ttf-ms-fontsAUR posible. Ver también Microsoft fonts (Español).\n\nAntes de la introducción de Arial y Times New Roman, Microsoft usaba dos fuentes bitmap llamadas Helv y Tms Rmn en Windows 1.0, cada una siendo imitaciones sin licencia de fuentes más conocidas ya cubiertas acá. Luego fueron renombradas a MS Sans Serif y MS Serif desde Windows 3.1, y MS Sans Serif fue eventualmente vectorizada a \"Microsoft Sans Serif\". Documentos que usan estas fuentes son raros, pero interfaces de usuarios que usan Microsoft Sans Serif puede ser ocasionalmente encontradas en aplicaciones Mono (Español) libgdiplus. Es generalmente seguro asumir que esas fuentes son métricamente compatibles con Helvetica y Times cuando se intenta reemplazarlas.\n\n"
    },
    {
      "title": "TeX Gyre",
      "level": 3,
      "content": "TeX Gyre (tex-gyre-fonts) es un remake y extensión de las 35 fuentes base de PostScript distribuidas con Ghostscript 4.00. El proyecto provee soporte par TeX y también el formato multi plataforma OpenType para las fuentes. Un proyecto relacionado, TeX Gyre Math provee las correspondientes fuentes OpenType matemáticas.\n\n"
    },
    {
      "title": "GNU FreeFont",
      "level": 3,
      "content": "GNU FreeFont (gnu-free-fonts) es una familia outline que pretende cubrir tanto como sea posible del Conjunto de Caracteres Universal (UCS). La mayoría de los caracteres latinos provienen de las fuentes (Nimbus) de URW. Este conjunto de fuentes es sacado bajo GPL v3+ + FE.\n\n"
    },
    {
      "title": "Liberation",
      "level": 3,
      "content": "Las fuentes Liberation proveen cuatro familias Liberation Sans, Liberation Serif, y Liberation Mono, que intentan ser métricamente compatibles con fuentes comunes de Microsoft Windows. Desde la versión 2.0.0, este conjunto de fuentes es sacada bajo SIL OFL, y es basada en las fuentes principales de #Chrome OS. Están disponible como ttf-liberation.\n\nVersiones más antiguas de esta fuente, licenciadas bajo GPL están basadas en las fuentes de Ascender Corporation, que están licenciadas por Red Hat, Inc. Estas versiones de Liberation también incluyen Liberation Sans Narrow que corresponde a Arial Narrow. Esta fuente está disponible como ttf-liberation-sans-narrowAUR.\n\n"
    },
    {
      "title": "Ume",
      "level": 3,
      "content": "Ume Fonts (Japanonés) (ttf-umeAUR) es un proyecto que provee fuentes métricamente compatibles con las fuentes MS Japanese tales como: Ume Gothic (MS Gothic), Ume UI Gothic (MS UI Gothic), Ume P Gothic (MS PGothic), ...\n\n"
    },
    {
      "title": "Google",
      "level": 3,
      "content": "Google provee un gran número de fuentes[enlace roto 2025-03-15], incluyendo diferentes familias de fuentes métricamente compatibles.\n\nGelasio[enlace roto 2024-01-13] (ttf-gelasio-ibAUR), la alternativa de Google para Georgia, puede ser encontrada en FontLibrary bajo SIL OFL.\n\n"
    },
    {
      "title": "Chrome OS",
      "level": 4,
      "content": "Google provee fuentes métricamente compatibles open-source con su sistema operativo, Chrome OS, bajo Apache License 2.0. CrOS core (croscore, ttf-croscore) es una colección de Arimo (sans), Tinos (serif) y Cousine (mono), también licenciado por Ascender Corporation. Un conjunto extra de fuentes, CrOS extra (crosextra) provee Carlito (ttf-carlito) y Caladea (ttf-caladea) para emparejar las fuentes por defecto de Microsoft Word.\n\nYa que mapeos de glifos de Symbol son usualmente implementados en navegadores, Google ya no provee SymbolNeu en croscore > 1.23.0. Puede obtener esta fuente en croscorefonts-1.23.0.tar.gz.\n\n"
    },
    {
      "title": "Noto",
      "level": 4,
      "content": "Las fuentes Noto de Google están disponibles via noto-fonts. Están licenciadas bajo SIL OFL. Las fuentes Noto están diseñadas para suplementar la cobertura de glifos para Roboto (ttf-roboto), el typeface estándar para Android, y son verticalmente (i.e. misma altura en línea para el mismo tamaño de fuente) métricamente compatibles con Roboto.\n\n"
    },
    {
      "title": "DMCA Sans Serif",
      "level": 4,
      "content": "DMCA Sans Serif (ttf-dmcasansserifAUR) es una alternativa san serif de propósito general a [Wikipedia:Consolas|Consolas]] de Microsoft. Usa la misma métrica (1884/2048 top, 514/2048 bottom, 1126/2048 width) y está en el dominio público. Versión 9.0 tiene 3309 caracteres, lo cual es el conjunto de caracteres Subset3+.\n\n"
    },
    {
      "title": "Kissinger 2",
      "level": 4,
      "content": "Kissinger 2 es un competidor de dominio público de Unifont. A diferencia de Unifont, Kissinger 2 está separada entre fuentes de anchura media (8×16) y anchura completa (16×16), con algunos caracteres teniendo glifos en ambas anchuras. La versión dev4 tiene 8450 caracteres de anchura media, 14724 caracteres de anchura completa, 21911 en total y 1263 solapadas; sin embargo, usuarios pueden contribuir glifos mediante el método descrito en el sitio web oficial.\n\n"
    },
    {
      "title": "Selawik",
      "level": 4,
      "content": "Selawik (ttf-selawikAUR) es la alternatvia open-source de Microsoft para su fuente Segoe UI. Desafortunadamente no empareja los parámetros de interletraje de Segoe UI. Fue desarrollo para uso en el framwork WinJS, que está ahora abandonado.\n\n"
    },
    {
      "title": "Wine Tahoma",
      "level": 4,
      "content": "El proyecto Wine (Español) desarrolló y fuente métricamente compatible para reemplazar a Tahoma de Microsoft, disponible como ttf-tahomaAUR. Su nombre en los datos TTF es simplemente \"Tahoma\", así que no hace falta configuración.\n\n"
    },
    {
      "title": "Ejemplo de configuración",
      "level": 2,
      "content": "Para consistencia de fuentes, todas las aplicaciones deberían estar configuradas para usar los aliases de serif, sans-serif y monospace; las cuales son mapeadas a fuentes particulares por fontconfig. Font configuration#Set default or fallback fonts explica las dos formas de lograr esta configuración, ambas son cubiertas con un ejemplo para fuentes métricamente compatibles abajo.\n\n"
    },
    {
      "title": "Ejemplo para el método 'binding'",
      "level": 3,
      "content": "El siguiente ejemplo de configuración usa las fuentes #Liberation.\n\n```\n/etc/fonts/local.conf\n```\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n    <match target=\"pattern\">\n        <test qual=\"any\" name=\"family\"><string>serif</string></test>\n        <edit name=\"family\" mode=\"assign\" binding=\"same\"><string>Liberation Serif</string></edit>\n    </match>\n    <match target=\"pattern\">\n        <test qual=\"any\" name=\"family\"><string>sans-serif</string></test>\n        <edit name=\"family\" mode=\"assign\" binding=\"same\"><string>Liberation Sans</string></edit>\n    </match>\n    <match target=\"pattern\">\n        <test qual=\"any\" name=\"family\"><string>monospace</string></test>\n        <edit name=\"family\" mode=\"assign\" binding=\"same\"><string>Liberation Mono</string></edit>\n    </match>\n</fontconfig>\n```\n\n"
    },
    {
      "title": "Example for prefer method",
      "level": 3,
      "content": "The following example configuration uses the #Chrome OS fonts, adding additional aliases for other fonts frequently required to refer.\n\n```\n/etc/fonts/local.conf\n```\n\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n \n  <!-- Prefer fonts for generics -->\n  <alias>\n    <family>serif</family>\n    <prefer><family>Tinos</family></prefer>\n  </alias>\n  <alias>\n    <family>sans-serif</family>\n    <prefer><family>Arimo</family></prefer>\n  </alias>\n  <alias>\n    <family>sans</family>\n    <prefer><family>Arimo</family></prefer>\n  </alias>\n  <alias>\n    <family>monospace</family>\n    <prefer><family>Cousine</family></prefer>\n  </alias>\n   \n  <!-- Map specific families to CrOS ones -->\n  <match>\n    <test name=\"family\"><string>Arial</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"strong\">\n      <string>Arimo</string>\n    </edit>\n  </match>\n  <match>\n    <test name=\"family\"><string>Helvetica</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"strong\">\n      <string>Arimo</string>\n    </edit>\n  </match>\n  <match>\n    <test name=\"family\"><string>Times</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"strong\">\n      <string>Tinos</string>\n    </edit>\n  </match>\n  <match>\n    <test name=\"family\"><string>Times New Roman</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"strong\">\n      <string>Tinos</string>\n    </edit>\n  </match>\n  <match>\n    <test name=\"family\"><string>Courier</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"strong\">\n      <string>Cousine</string>\n    </edit>\n  </match>\n  <match>\n    <test name=\"family\"><string>Courier New</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"strong\">\n      <string>Cousine</string>\n    </edit>\n  </match>\n  <match>\n    <test name=\"family\"><string>Calibri</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"strong\">\n      <string>Carlito</string>\n    </edit>\n  </match>\n  <match>\n    <test name=\"family\"><string>Cambria</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"strong\">\n      <string>Caladea</string>\n    </edit>\n  </match> \n</fontconfig>\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Debian Wiki - Substituting Calibri and Cambria fonts\n\n"
    }
  ]
}