{
  "title": "Microsoft Surface Pro 9",
  "url": "https://wiki.archlinux.org/title/Microsoft_Surface_Pro_9",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section does not follow the Laptop page guidelines.** This article or section does not follow the Laptop page guidelines.\n\nThis article or section does not follow the Laptop page guidelines.\n\nTable content:\nHardware | PCI/USB ID | Working?\nTouchpad |  | Yes\nKeyboard |  | Yes\nTouchscreen |  | Yes\nDigitizer Pen | 8086:51d0 | Yes\nGPU | 8086:46a8 | Yes\nWebcam |  | No\nBluetooth | 8087:0033 | Yes\nAudio | 8086:9dc8 | Yes\nWireless | 8086:51f0 | Yes\nThunderbolt 4 | 8086:461f | Yes\n8086:462f | Yes\nTPM |  | Yes\n\nThis page aims to document specific information on getting Arch Linux working on the Microsoft Surface Pro 9 tablet with Intel Processor.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Hold Volume Up key on the tablet to enter UEFI setup utility. Disable Secure Boot, enable booting from the external USB devices, then boot from the installation media.\n\nSince the Linux kernel does not ship required drivers to use the detachable keyboard, touchscreen and stylus, you have two options to control the operating system:\n\n- Plug in a USB keyboard into a free USB port and continue the installation process as usual.\n- Remaster the Archiso and include drivers and kernel from the linux-surface project.\n\n"
    },
    {
      "title": "Secure Boot",
      "level": 2,
      "content": "It is possible to set the tablet to use only user-provided keys in UEFI setup utility, but the default options allow only either using MS keys, or MS + 3rd Party CA, or disabling the Secure Boot.\n\nThe procedure of setting up the secure boot is as follows:\n\n- Disable Secure Boot\n- Follow Secure Boot for general setup until the key enrollment.\n- Make sure that enrolling keys is the last action you'd do with the Secure Boot before shutting down the machine. In other words, for example, either sbctl enroll-keys (only 3rd Party CA only), or sbctl enroll-keys -m (MS + 3rd Party CA) commands must be entered before shutting down.\n- Shutdown the tablet. Do not reboot, do not reboot into the UEFI firmware setup directly.\n- Turn the tablet back on and hold \"Volume Down\" key.\n- Navigate to the \"Security\" section in the menu. If it says that it needs the reboot to access the settings, select the \"Reboot to UEFI\" option on the same page.\n- After the reboot, navigate to the \"Security\" section again. Verify that the Secure Boot is enabled automatically. If the text says \"Secure Boot is Enabled with custom key configuration\", then it means that UEFI enabled the hidden option to use only third-party CAs and keys automatically. Never select any other option there if you want to keep using your own keys.\n- Reboot to the operating system and verify that the Secure Boot is enabled. E.g. sbctl status should tell that the Secure Boot is enabled.\n\n"
    }
  ]
}