{
  "title": "Micro (Русский)",
  "url": "https://wiki.archlinux.org/title/Micro_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "micro — это текстовый редактор на базе терминала, который призван быть простым в использовании и интуитивно понятным, но при этом использовать все возможности современных терминалов. Он поставляется в виде одного статического двоичного файла и без каких-либо зависимостей.\n\nКак следует из названия, micro стремится стать своего рода преемником редактора nano, поскольку его легко установить и использовать, но micro также стремится сделать так, чтобы его было приятно использовать на постоянной основе.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет micro.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Micro использует $MICRO_CONFIG_HOME или $XDG_CONFIG_HOME/micro как директорий с настройками. Если эти переменные не указаны, в качестве каталога конфигурации используется ~/.config/micro Основные настройки задаются в файле settings.json, и со всеми параметрами вы можете ознакомиться здесь\n\n"
    },
    {
      "title": "Подсветка синтаксиса",
      "level": 3,
      "content": "Подсветку можно изменить как в файле настоек, так и в командной строке micro. Для этого зажмите Ctrl-e и введите команду\n\n```\nset colorscheme [название]\n```\n\n"
    },
    {
      "title": "Плагины",
      "level": 3,
      "content": "Если вам нужно установить плагин то воспользуйтесь командой\n\n```\nplugin install [название]\n```\n\nв micro. Для удаления plugin remove [название]. Справочник доступен по команде help plugins\n\n"
    },
    {
      "title": "Замена vi на micro",
      "level": 3,
      "content": "Чтобы заменить vi на micro в качестве стандартного текстового редактора при использовании таких команд, как visudo, задайте переменные окружения VISUAL и EDITOR, например:\n\n```\nexport VISUAL=micro\nexport EDITOR=micro\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Домашняя страница micro — официальный сайт (англ.)\n\n"
    }
  ]
}