{
  "title": "Migrate installation to new hardware (Polski)",
  "url": "https://wiki.archlinux.org/title/Migrate_installation_to_new_hardware_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Moving an existing install into (or out of) a virtual machine\n\nW tym artykule omówiono kroki wymagane do przeniesienia systemu Arch Linux na nowy sprzęt. Celem jest osiągnięcie takiej samej instalacji ArchLinux, jeśli chodzi o zainstalowane oprogramowanie i konfigurację, która jest niezależna od sprzętu.\n\nIstnieją dwa różne podejścia do migracji instalacji:\n\n1. Bottom to top: Zainstaluj świeży system Arch Linux na nowym sprzęcie, a następnie przywróć zainstalowane pakiety i pliki konfiguracyjne, m.in. jak opisano w dotfiles.\n1. Top to bottom: Sklonuj stary dysk twardy na nowy dysk twardy lub umieść stary dysk twardy w nowym systemie; w razie potrzeby zmodyfikuj pliki konfiguracyjne.\n\nPodejście od góry do dołu zapewnia dokładniejsze odtworzenie oryginalnego systemu niż podejście od dołu do góry.\n\n"
    },
    {
      "title": "Dostosuj się do nowego sprzętu",
      "level": 2,
      "content": "Zanim zaczniesz, zbadaj aspekty nowego sprzętu i sporządź listę różnic. Wspólne różnice to\n\n"
    },
    {
      "title": "Hard drive vs. SSD",
      "level": 3,
      "content": "Zobacz artykuł SSD.\n\n"
    },
    {
      "title": "Dostawca procesora",
      "level": 3,
      "content": "Jeśli zmienisz procesor na procesor innego dostawcy (np. Intel na AMD), zmień konfigurację mikrokod.\n\n"
    },
    {
      "title": "GPU",
      "level": 3,
      "content": "Jeśli zmieniłeś GPU na GPU innego dostawcy (np. z firmy AMD na NVIDIA), zmień sterownik graficzny.\n\n"
    },
    {
      "title": "UEFI vs. MBR boot code booting",
      "level": 3,
      "content": "Jeśli przełączysz się na nowszą płytę główną z UEFI, może być preferowane lub wymagane przełączenie rozruchu z „MBR boot code” na rozruch UEFI. W takim przypadku potrzebny jest EFI system partition.\n\n"
    },
    {
      "title": "W starym systemie",
      "level": 3,
      "content": "We define here a minimal configuration that carries over from the old to the new system which differentiates this approach from the Installation guide. Think about the configuration files from /etc and dotfiles in /home that you want to copy to the new system, as well as user data files. If you will not have access to the old system from the new system then backup up all the files that you want to copy over.\n\n"
    },
    {
      "title": "Lista zainstalowanych pakietów",
      "level": 4,
      "content": "```\n$ pacman -Qqen > pkglist.txt\n$ pacman -Qqem > pkglist_aur.txt\n```\n\ndaje ładną listę jawnie zainstalowanych pakietów z repozytoriów i AUR. Dołącz go do kopii zapasowej, jeśli ją wykonasz.\n\nMożesz również użyć następującego skryptu, aby uzyskać lepszy przegląd plików binarnych i bibliotek zainstalowanych bez wiedzy pacmana (np. instalowanych przez Steam, Desura lub przy użyciu ich własnych metod instalacji):\n\n```\nfind / -regextype posix-extended -regex \"/(sys|srv|proc)|.*/\\.ccache/.*\" -prune -o -type f \\\n-exec bash -c 'file \"{}\" | grep -E \"(32|64)-bit\"' \\; | \\\nawk -F: '{print $1}' | \\\nwhile read -r bin; \\\ndo pacman -Qo \"$bin\" &>/dev/null || echo \"$bin\"; \\\ndone\n```\n\n"
    },
    {
      "title": "pacman cache",
      "level": 4,
      "content": "Rozważ utworzenie kopii zapasowej /var/cache/pacman/pkg/ jeśli nie zmieniasz architektur (na przykład z x86 na x86_64).\n\n"
    },
    {
      "title": "Instrukcja instalacji pierwsza połowa",
      "level": 4,
      "content": "Podstawowe informacje na temat instalacji nowego systemu można znaleźć w Installation guide. Postępuj zgodnie z pierwszą połową instrukcji instalacji, ale z wyłączeniem polecenia pacstrap.\n\n"
    },
    {
      "title": "Skopiuj pamięć podręczną pacmana",
      "level": 4,
      "content": "Skopiuj pamięć podręczną pacman znalezioną w /var/cache/pacman/pkg/ ze starego do nowego systemu lub z kopii zapasowej do nowego systemu.\n\n"
    },
    {
      "title": "Instrukcja instalacji druga połowa",
      "level": 4,
      "content": "Kontynuuj korzystanie z przewodnika instalacji od, włącznie z poleceniem pacstrap, aż do końca, ale nie uruchamiaj ponownie. Nie pomijaj polecenia pacstrap, ponieważ wykonuje ono dodatkową pracę poza instalacją pakietów.\n\n"
    },
    {
      "title": "Zainstaluj wcześniej zainstalowane oprogramowanie",
      "level": 4,
      "content": "Edytuj pkglist.txt (i pkglist_aur.txt) i usuń sterowniki, które nie są potrzebne w nowym systemie. Następnie zainstaluj inne wcześniej zainstalowane oprogramowanie za pomocą\n\n```\n# pacman -S --needed - < pkglist.txt\n```\n\n"
    },
    {
      "title": "Od góry do dołu",
      "level": 2,
      "content": "Istnieją dwie opcje podejścia od góry do dołu: możesz zachować dysk, na którym system jest już zainstalowany, i zmodyfikować jego zawartość lub skopiować system na nowy dysk. Jeśli zachowasz dysk i zmodyfikujesz go, a następnie umieścisz go z powrotem w starym systemie, modyfikacje prawdopodobnie uniemożliwią uruchomienie starego systemu.\n\n"
    },
    {
      "title": "Oczyść stary system",
      "level": 3,
      "content": "Warto również wyczyścić system przed sklonowaniem, jak opisano w System maintenance#Clean the filesystem Upewnij się, że stary system nadal działa zgodnie z oczekiwaniami po oczyszczeniu, zanim przejdziesz dalej.\n\n"
    },
    {
      "title": "Skopiuj system na nowy dysk",
      "level": 3,
      "content": "Istnieją dwie podstawowe metody kopiowania systemu na nowy dysk, disk cloning i kopiowanie plików.\n\n"
    },
    {
      "title": "Klonowanie dysku",
      "level": 4,
      "content": "Wymagane jest używanie działającego systemu Linux zamiast starego systemu Arch Linux; na przykład możesz użyć nośnika instalacyjnego Arch Linux USB flash installation media. Zostaną odtworzone układ partycji i systemy plików starego systemu.\n\n"
    },
    {
      "title": "Kopiowanie plików",
      "level": 4,
      "content": "- Utwórz nowe partycje i systemy plików na nowym dysku. Możesz skorzystać z okazji, aby wybrać inny układ partycji i/lub systemy plików niż wcześniej.\n- Dla każdego systemu plików skopiuj pliki ze starego na nowy dysk, używając rsync lub innych narzędzi, które zachowują uprawnienia, atrybuty itp., zobacz rsync#Full system backup rsync#File system cloning aby uzyskać więcej informacji.\n\n"
    },
    {
      "title": "Transport options",
      "level": 4,
      "content": "Istnieje wiele różnych metod przenoszenia danych między dwoma dyskami:\n\n- Podłącz oryginalny i docelowy dysk twardy do tego samego komputera, starego lub nowego. Łącze danych: stary HDD -> komputer -> nowy HDD.\n- Korzystaj z tymczasowych urządzeń pamięci masowej, takich jak zewnętrzne dyski twarde lub kopie zapasowe w chmurze. Łącze danych: stary dysk twardy -> stary komputer -> pamięć -> nowy komputer -> nowy dysk twardy. Zobacz artykuł System backup.\n- Przesyłaj dane przez sieć, na przykład za pomocą rsync. Łącze danych: stary dysk twardy -> stary komputer -> sieć -> nowy komputer -> nowy dysk twardy.\n\nW przypadku dwóch pierwszych opcji należy wziąć pod uwagę, że do podłączenia dysków twardych mogą być potrzebne adaptery (PATA->SATA, USB-HDD-Cases, itp.) i wybrać wystarczająco szybkie połączenie.\n\nDwie ostatnie opcje wymagają użycia działającego systemu Linux na nowym komputerze, ponieważ w tym momencie nie można uruchomić systemu z nowego dysku twardego.\n\n"
    },
    {
      "title": "Zaktualizuj fstab",
      "level": 3,
      "content": "Jeśli używasz obrazu instalacyjnego Arch Linux, zamontuj nową partycję główną do /mnt i inne wymagane partycje, tak jak podczas normalnej instalacji (zobacz Installation guide#Mount the file systems).\n\nWstaw dowolny komentarz, taki jak #end of old fstab na końcu /mnt/etc/fstab. Wygeneruj nowy plik fstab, jak wskazano w Przewodniku Installation guide#Fstab, dołączając go do bieżącego pliku fstab. Ogólnie zawsze przeglądaj plik fstab utworzony przez genfstab. W takim przypadku sprawdź starsze wpisy fstab przed komentarzem, jeśli są nieaktualne lub zduplikowane, usuń je, a jeśli stare wpisy nadal będą przydatne, zachowaj je. Na przykład można zachować wpisy montowania dla dysków sieciowych. Ogólnie zaleca się używanie Persistent block device naming.\n\n"
    },
    {
      "title": "Zainstaluj ponownie program ładujący",
      "level": 3,
      "content": "Może zajść potrzeba ponownej instalacji i/lub ponownej konfiguracji boot loadera z następujących powodów:\n\n- Różne dyski, układ partycji lub system plików\n- Dodawanie wpisów rozruchowych UEFI do nowej pamięci NVRAM na płycie głównej\n- Migracja z rozruchu „MBR boot code” do rozruchu UEFI\n- Migracja z USB do SATA/NVMe\n- Aktualizacja wiersza poleceń jądra W przypadku innego GPU zaktualizuj tryb bufora ramki Zaktualizuj obraz Microcode initramfs\n\n- W przypadku innego GPU zaktualizuj tryb bufora ramki\n- Zaktualizuj obraz Microcode initramfs\n\nJeśli używasz środowiska Live Arch Linux, przed ponowną instalacją programu ładującego, wykonaj chroot w nowym systemie:\n\n```\n# arch-chroot /mnt\n```\n\nZapoznaj się z artykułem dotyczącym boot loader, aby dowiedzieć się, jak go (ponownie) zainstalować.\n\n"
    },
    {
      "title": "Regeneracja obrazu jądra",
      "level": 3,
      "content": "Zaleca się zregenerowanie obrazu initramfs za pomocą mkinitcpio, chociaż początkowo awaryjny obraz initramfs może działać.\n\n"
    },
    {
      "title": "Skonfiguruj ponownie dźwięk",
      "level": 3,
      "content": "- alsamixer volume save settings\n\n- save settings\n\n"
    },
    {
      "title": "Zmień konfigurację sieci",
      "level": 3,
      "content": "Jeśli stara instalacja i migrowana instalacja będą współistnieć w tej samej sieci, ustaw nową nazwę hosta z hostnamectl.\n\nRozważ również zmiany konfiguracji, które są wymagane po zmianie nazwy hosta:\n\n- /etc/hosts\n- other apps using hostname: synergy, nut (network ups tools)\n- grep -Ri 'hostname' /etc (jako użytkownik root) powinien dać kilka wskazówek na temat plików do aktualizacji\n\nNazwy interfejsów sieciowych mogą ulec zmianie podczas używania dhcpcd z nazwanymi interfejsami sieciowymi.\n\n- Uruchomienie dmesg | grep 'renamed from eth' jako root może pomóc znaleźć nową nazwę interfejsu\n- usuwać stary: disable dhcpcd@enpXs0.service\n- aktywuj nowy: enable dhcpcd@enpXs0.service\n\n"
    },
    {
      "title": "Zobacz też",
      "level": 2,
      "content": "- Howto clone a linux system\n- [1]\n- [2]\n\n"
    }
  ]
}