{
  "title": "Minecraft (日本語)",
  "url": "https://wiki.archlinux.org/title/Minecraft_(%E6%97%A5%E6%9C%AC%E8%AA%9E)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Minecraft はブロックを壊したり配置するゲームです。夜行性のモンスターから身を守るために建物を建てるだけでなく、ゲームが成長するにつれて様々な素晴らしい想像力溢れるものが作られてきました。\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 クライアント 1.1 インストール 1.2 起動 1.3 補助プログラム\n- 2 Bedrock Edition サーバ 2.1 インストール 2.1.1 サーバーの起動 2.1.2 サーバー設定\n- 3 Java Edition サーバー 3.1 インストール 3.2 セットアップ 3.2.1 イントロダクション 3.2.2 サーバーの起動 3.2.3 サーバー管理スクリプト 3.2.4 設定 3.3 Spigot (Craftbukkit) 3.4 Cuberite 3.5 ヒントとテクニック\n- 4 Minecraft Mod Launcher 4.1 Feed The Beast 4.2 Technic Launcher\n- 5 Other programs and editors\n- 6 Troubleshooting 6.1 Server on ARM devices 6.2 Client Wayland support 6.3 Client or server does not start 6.4 Broken fonts with MinecraftForge 6.5 MultiMC unable to build 6.6 Cannot change pulseaudio sink\n- 7 参照\n\n- 1.1 インストール\n- 1.2 起動\n- 1.3 補助プログラム\n\n- 2.1 インストール 2.1.1 サーバーの起動 2.1.2 サーバー設定\n\n- 2.1.1 サーバーの起動\n- 2.1.2 サーバー設定\n\n- 3.1 インストール\n- 3.2 セットアップ 3.2.1 イントロダクション 3.2.2 サーバーの起動 3.2.3 サーバー管理スクリプト 3.2.4 設定\n- 3.3 Spigot (Craftbukkit)\n- 3.4 Cuberite\n- 3.5 ヒントとテクニック\n\n- 3.2.1 イントロダクション\n- 3.2.2 サーバーの起動\n- 3.2.3 サーバー管理スクリプト\n- 3.2.4 設定\n\n- 4.1 Feed The Beast\n- 4.2 Technic Launcher\n\n- 6.1 Server on ARM devices\n- 6.2 Client Wayland support\n- 6.3 Client or server does not start\n- 6.4 Broken fonts with MinecraftForge\n- 6.5 MultiMC unable to build\n- 6.6 Cannot change pulseaudio sink\n\n"
    },
    {
      "title": "インストール",
      "level": 3,
      "content": "minecraft-launcherAUR もしくは minecraftAUR パッケージをインストールしてください。前者はtar.gz、後者はdebファイルからインストールされます。公式ダウンロードサイト からランチャーを取得することもできます。\n\n"
    },
    {
      "title": "起動",
      "level": 3,
      "content": "以下のコマンドでランチャーを立ち上げることができます:\n\n```\n$ minecraft-launcher\n```\n\n"
    },
    {
      "title": "補助プログラム",
      "level": 3,
      "content": "Minecraft をより便利にするプログラムとエディタ がいくつかあります。一番よく使われるプログラムはマップジェネレータです。このプログラムを使えば Minecraft ワールドファイルをロードして 2D イメージとしてレンダリングでき、全体から細部に至るまでワールドマップを編集できます。\n\n- AMIDST (Advanced Minecraft Interface and Data/Structure Tracking) は Minecraft ワールドの構造物・バイオーム・プレイヤーを探すのを助けるプログラムです。ワールドからバイオームを引き抜いたり、シードを与えたりランダムシードを作成したり既存のワールドのシードを読み込むことで、特定の場所がどうなっているか表示することができます (ワールド上のプレイヤーの位置も表示します)。amidstAUR は AUR からインストールできます。メインの開発者が多忙のため、AMIDST は現在メンテナンスがされていない状態なので注意してください。AMIDST のフォークとして \"Amidst Exporter\" が存在し、AUR パッケージは amidstexporterAUR です。特筆すべき点として、1.8 以上のワールドで存在する海の要塞を計算するパッチが含まれています。\n\n- Mapcrafter は 3D 等角投影法でワールドをマップにレンダリングする高パフォーマンスな Minecraft マップレンダラーです。ウェブブラウザでマップを表示することができ、サーバーのプレイヤーのためにウェブサーバーでホストすることができます。Mapcrafter にはレンダリングするワールドや、day/night/cave などのレンダリングモードを指定するためのシンプルな設定ファイルフォーマットがあります。mapcrafter-gitAUR は AUR からインストールできます。\n\n- Minutor は最小主義の Minecraft マップジェネレータです。最小主義だからといって作れるワールドに制限があるわけではありません。シンプルな GTK+ ベースのインターフェースでワールドを見ることができます。いくつかのレンダリングモードがあり、カスタムカラーモードや Z レベルでスライスできる機能もあります。minutorAUR[リンク切れ: アーカイブ: aur-mirror] は AUR から入手可能です。\n\n"
    },
    {
      "title": "Bedrock Edition サーバ",
      "level": 2,
      "content": "このバージョンでは、Bedrock Edition Minecraftのホスティングが可能で、現在は、Windows 10 とモバイル、Amazon FireOS、FireTV、Anroid、iOS、Xbox One、Playstation 4、Nintendo Switch、Samsung Gear VR デバイスがサポートされています。\n\n"
    },
    {
      "title": "インストール",
      "level": 3,
      "content": "Bedrock マインクラフトサーバーは、minecraft-bedrock-serverAUR パッケージでインストールできます。 これは、systemd ユニットファイルを提供します。このパッケージは 独立した minecraft-bedrock アカウントを作成します。\n\n"
    },
    {
      "title": "サーバーの起動",
      "level": 4,
      "content": "To start the server you may either use systemd or run it directly from the command line. Either way the server is encapsulated in a GNU Screen session which is owned by the minecraft-bedrock user. Using systemd you may start and enable the included minecraft-bedrock-server.service. Alternatively run the following as the minecraft-bedrock user inside the /opt/minecraft-bedrock-server directory:\n\n```\n$ LD_LIBRARY_PATH=. ./bedrock_server\n```\n\n"
    },
    {
      "title": "サーバー設定",
      "level": 4,
      "content": "Open server.properties with your favorite text editor and you may edit your server settings. The file has explanations under each option to guide you through configuring the server to your needs.\n\nMost importantly, server-port determines the UDP port at which the server will listen for incoming connections. Default port is 19132 for IPv4, and 19133 for IPv6. UDP ports 43351 for IPv4 and 51885 for IPv6 are also required to be forwarded for authentication.\n\n"
    },
    {
      "title": "インストール",
      "level": 3,
      "content": "Arch Linux で Minecraft サーバーをインストールする一番簡単な方法は minecraft-serverAUR パッケージを使うことです。パッケージには systemd のユニットファイルや小さな制御スクリプトが付属しています。\n\n"
    },
    {
      "title": "イントロダクション",
      "level": 4,
      "content": "パッケージのインストール時に minecraft ユーザーとグループが作成されます。Minecraft 専用のユーザーを作成することはセキュリティを確保するために奨励されていることです。非特権ユーザーのアカウントで Minecraft を動作させることで、Minecraft サーバーの脆弱性を突かれたとしても、他のユーザーに影響ありません。ただし、Minecraft サーバーの設定を変更するために、あなたの使用しているユーザーを minecraft グループに追加して、/srv/minecraft ディレクトリにグループの書き込み権限を追加することは問題ありません。/srv/minecraft ディレクトリの全てのファイルの所有者が minecraft ユーザーになっていること、または他の方法でユーザーが読み書き権限を持てるようにしてください。特定のファイルにアクセスできないとサーバーはエラーを吐き出します。もしくは、ログにエラーメッセージを書き込むことすらできない可能性もあります。\n\nサーバーには自動的にバックアップを取るための systemd のサービスとタイマーが付いています。バックアップはサーバーのルートディレクトリ直下のbackup フォルダに保存されます。使用する systemd ファイルは /usr/lib/systemd/system/minecraftd-backup.timer と /usr/lib/systemd/system/minecraftd-backup.service です。ユニットファイルは簡単に修正することができ、バックアップの間隔などをカスタマイズできます。\n\n"
    },
    {
      "title": "サーバーの起動",
      "level": 4,
      "content": "サーバーを起動するときは systemd を使用するかコマンドラインから直接起動します。どちらの方法でもサーバーは minecraft ユーザーによって所有される screen セッションでカプセル化されます。systemd を使用する場合、パッケージに含まれている minecraftd.service を起動・有効化します。あるいは次のコマンドを実行:\n\n```\n# minecraftd start\n```\n\n"
    },
    {
      "title": "サーバー管理スクリプト",
      "level": 4,
      "content": "パッケージに含まれている minecraftd スクリプトを使うことでサーバーを簡単に制御できます。start, stop, restart などの基本的なコマンドを使えるだけでなく console でセッションにアタッチすることも可能です。さらに、status でステータス情報を表示したり、backup でサーバーのワールドディレクトリをバックアップしたり、restore でバックアップからワールドデータを復旧したり、あるいは command <server command> のようにしてサーバーコンソールでコマンドを実行できます。\n\n"
    },
    {
      "title": "設定",
      "level": 4,
      "content": "デフォルト設定 (最大使用メモリやスレッド数など) を変更したい場合、/etc/conf.d/minecraft ファイルを編集してください。\n\n上級ユーザーは /etc/conf.d/minecraft で IDLE_SERVER を有効 (true) にすると良いでしょう。オンラインのプライヤーがいなくなった場合に IDLE_IF_TIME に指定された時間 (デフォルトでは20分) 経過すると管理スクリプトによってサーバーが停止されます。サーバーが停止されると idle_server は netcat を使って Minecraft のポートを監視して、接続があったらすぐにサーバーを起動します。初めてゲームに参加するときのロード時間が長くなりますが、CPU やメモリの使用量を大幅に減らすことができ、リソースの無駄使いがなくなります。\n\n"
    },
    {
      "title": "Spigot (Craftbukkit)",
      "level": 3,
      "content": "Spigot は世界で最も使われている mod 適用済みの Minecraft サーバーです。AUR の spigotAUR パッケージでインストールできます。spigot の PKGBUILD は minecraft-serverAUR パッケージのファイルを使ってビルドします。 spigot サーバーは systemd ユニットファイルと spigot スクリプト、そしてスクリプトの設定ファイルから成ります。バイナリの名前は spigot で、minecraftd と全く同じコマンドが使えます。設定ファイルの場所は /etc/conf.d/spigot です。\n\nminecraftd を spigot に置き換えてセットアップを読んでください。\n\nSpigot は Bukkit の系列であり、Bukkit の活動停止によって人気が増しています。\n\n"
    },
    {
      "title": "Cuberite",
      "level": 3,
      "content": "Cuberite は C++ と Lua で書かれている高速な Minecraft 互換サーバーです。標準の Minecraft サーバーよりも高い性能を発揮することができ、様々な mod を適用できます。cuberiteAUR パッケージが AUR からインストールできます。プログラムにはシンプルなウェブインターフェイスが存在し、デフォルトでは port 8080 からアクセスします。ブラウザからほとんどのサーバー制御を簡単に行うことが可能です。そのため、管理スクリプトは必要ありません。さらに、パッケージにはサーバーを起動 (cuberite.service) したりバックアップ (cuberite-backup.service) するための systemd ファイルが付属しています。\n\nminecraftd を cuberite に置き換えてセットアップを読んでください。\n\n"
    },
    {
      "title": "ヒントとテクニック",
      "level": 3,
      "content": "- サーバーを改造することで サーバーラッパー などの機能を追加できます。\n- ワールド作成ツール を使って定期的にマップを生成する systemd タイマーや cron ジョブを設定することもできます。\n- 定期的なバックアップのために rsync を使ってもいいかもしれません。\n\n"
    },
    {
      "title": "Minecraft Mod Launcher",
      "level": 2,
      "content": "Minecraft のゲームプレイを強化したり Mod を追加する Mod パックが含まれた様々なランチャーで起動することができます。\n\n"
    },
    {
      "title": "Feed The Beast",
      "level": 3,
      "content": "feedthebeastAUR[リンク切れ: パッケージが存在しません] には Feed The Beast ランチャーが含まれています。Feed The Beast の公式ページは: feed-the-beast.com。\n\n"
    },
    {
      "title": "Technic Launcher",
      "level": 3,
      "content": "minecraft-technic-launcherAUR には Technic Launcher が含まれています。Technic Launcher の公式ページは: technicpack.net。\n\n"
    },
    {
      "title": "Other programs and editors",
      "level": 2,
      "content": "There are several programs and editors which can make your Minecraft experience a little easier to navigate. The most common of these programs are map generators. Using one of these programs will allow you to load up a Minecraft world file and render it as a 2D image, providing you with a top-down map of the world.\n\n- AMIDST (Advanced Minecraft Interface and Data/Structure Tracking) (amidstAUR) is a program that aids in the process of finding structures, biomes, and players in Minecraft worlds. It can draw the biomes of a world out and show where points of interest are likely to be by either giving it a seed, telling it to make a random seed, or having it read the seed from an existing world (in which case it can also show where players in that world are). The project has been forked in the past, of which the most notable one is \"Amidst Exporter\" (amidstexporterAUR) which includes a patch for calculating Ocean Monument locations in 1.8+ worlds.\n\n- Mapcrafter (mapcrafter-gitAUR) is a high performance Minecraft map renderer written in C++ which renders worlds to maps with an 3D-isometric perspective. You can view these maps in any webbrowser hence they are easily deployed on one's server. Mapcrafter has a simple configuration file format to specify worlds to render, different rendermodes such as day/night/cave and can also render worlds from different rotations.\n\n- Minutor (minutor-gitAUR) is a minimalistic map generator for Minecraft. You are provided with a simple GTK based interface for viewing your world. Several rendering modes are available, as well as custom coloring modes and the ability to slice through z-levels.\n\n"
    },
    {
      "title": "Server on ARM devices",
      "level": 3,
      "content": "Minecraft server should run without any issues on ARM devices with latest Java, such as jre-openjdk-headless. However, if you encounter any issues, try using jdk-armAUR instead. Also consider #Cuberite server as an alternative.\n\n"
    },
    {
      "title": "Client Wayland support",
      "level": 3,
      "content": "Wayland and other window managers are currently not supported with Minecraft, as Minecraft has the prerequisite of xorg-xrandr and should be opened with xorg.\n\n"
    },
    {
      "title": "Client or server does not start",
      "level": 3,
      "content": "It might be the problem with Java version. Java version 8 is guaranteed to work well in all cases.\n\nBoth Minecraft server and the actual game work perfectly fine with the latest version of Java, such as jre-openjdk, but the Minecraft game launcher (and possibly all other mods) might only work with the Java version 8.\n\n"
    },
    {
      "title": "Broken fonts with MinecraftForge",
      "level": 3,
      "content": "Force Unicode fonts from the language menu.\n\nSince you cannot read any of the menu options: in the main menu, choose the bottom-left most button is Options, second-from-the-bottom on the left side is the Language Button. From there, the Force Unicode Font button is on the bottom, on the left side.\n\n"
    },
    {
      "title": "MultiMC unable to build",
      "level": 3,
      "content": "If you are trying to install multimc5AUR and get an error similar to:\n\n```\nNo CMAKE_Java_COMPILER could be found.\nTell CMake where to find the compiler by setting either the environment\nvariable \"JAVA_COMPILER\" or the CMake cache entry CMAKE_Java_COMPILER to\nthe full path to the compiler, or to the compiler name if it is in the\nPATH.\n```\n\nThe error could be caused by Java missing, which can be fixed by installing jdk8-openjdk. If the error is not fixed by that or Java was properly installed in the first place, the wrong version could still be the default environment:\n\n```\n$ archlinux-java status\n```\n\n```\nAvailable Java environments:\n  java-13-openjdk (default)\n  java-8-openjdk\n```\n\nYou can set the default java version using archlinux-java set <version>.\n\n"
    },
    {
      "title": "Cannot change pulseaudio sink",
      "level": 3,
      "content": "If you are unable to switch audio output device (indicated by DONT_MOVE flag in the output of pacmd list-sink-inputs) then the following openalsoft config may help\n\n```\n~/.alsoftrc\n```\n\n```\n[pulse]\nallow-moves=yes\n```\n\n"
    },
    {
      "title": "参照",
      "level": 2,
      "content": "- Minecraft 公式サイト\n- Minecraft コミュニティリンク\n- Minecraft Wiki\n- Minecraft クライアントとサーバーのダウンロードリンク\n- クラフトレシピ\n- ブロックとアイテムのデータ値\n- Reddit Minecraft コミュニティ\n- Minecraft Skins\n\n"
    }
  ]
}