{
  "title": "Miroir",
  "url": "https://wiki.archlinux.org/title/Miroir",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Unofficial mirrors\n- pacman (Français)\n\nCette page vous montre comment choisir et configurer vos miroirs, et vous donne la liste des miroirs actuellement disponibles.\n\n"
    },
    {
      "title": "Miroirs officiels",
      "level": 2,
      "content": "La liste officielle des miroirs d'Arch Linux est disponible via le paquet pacman-mirrorlist. Pour obtenir une liste de miroirs encore plus à jour, utilisez la page Pacman Mirrorlist Generator (en).\n\nVérifiez l'état des miroirs en visitant la page Mirror Status (en). Il est recommandé de n'utiliser que les miroirs qui sont à jour, c'est-à-dire qui ne sont pas désynchronisés.\n\nSi vous souhaitez que votre miroir soit ajouté à la liste officielle, consultez la page DeveloperWiki:NewMirrors. En attendant, ajoutez-le à l'article Miroirs non officiels (en).\n\n"
    },
    {
      "title": "Miroirs prêts pour IPv6",
      "level": 3,
      "content": "Le Pacman Mirrorlist Generator (en) peut également être utilisé pour trouver une liste des miroirs IPv6 actifs.\n\n"
    },
    {
      "title": "Activation d'un miroir spécifique",
      "level": 2,
      "content": "Pour activer les miroirs, éditez /etc/pacman.d/mirrorlist et localisez votre région géographique. Décommentez les miroirs que vous souhaitez utiliser.\n\nPar exemple :\n\n```\n## Worldwide\n#Server = https://geo.mirror.pkgbuild.com/$repo/os/$arch\n#Server = http://mirror.rackspace.com/archlinux/$repo/os/$arch\nServer = https://mirror.rackspace.com/archlinux/$repo/os/$arch\n```\n\nConsultez #Tri des miroirs pour des outils d'aide au choix des miroirs.\n\nIl est également possible de spécifier des miroirs dans /etc/pacman.conf. Pour le dépôt core, la configuration par défaut est la suivante :\n\n```\n[core]\nInclude = /etc/pacman.d/mirrorlist\n```\n\nPour utiliser le miroir kernel.org comme miroir par défaut, ajoutez-le avant la ligne Include :\n\n```\n[core]\nhttps://mirrors.kernel.org/archlinux/$repo/os/$arch\nInclude = /etc/pacman.d/mirrorlist\n```\n\npacman essayera désormais de se connecter à ce miroir en premier. Procédez de la même manière pour core-testing, extra, et extra-testing, le cas échéant.\n\n"
    },
    {
      "title": "Forcer pacman à rafraîchir les listes de paquets",
      "level": 3,
      "content": "Les miroirs peuvent être désynchronisés et la liste des paquets de l'ancien miroir peut ne pas correspondre à la liste des paquets du nouveau miroir, même si les dates des listes peuvent le suggérer.\n\nAprès avoir créé/édité /etc/pacman.d/mirrorlist, lancez la commande suivante :\n\n```\n# pacman -Syyu\n```\n\nLe passage de deux drapeaux --refresh/-y force pacman à rafraîchir toutes les listes de paquets, même si elles sont considérées comme à jour. Utiliser pacman -Syyu est un gaspillage inutile de bande passante dans la plupart des cas, mais peut parfois résoudre des problèmes lors du passage d'un miroir cassé à un miroir fonctionnel. Consultez également Is -Syy safe ? (forum en).\n\nNote: **lastsync** Ceci n'est pas nécessaire si vous utilisez des miroirs synchronisés avec succès ou la vérification de l'horodatage du fichier lastsync du miroir pour s'assurer que les listes de paquets sont à jour.\n\n```\n# pacman -Syyuu\n```\n\nCeci n'est pas nécessaire si vous utilisez des miroirs synchronisés avec succès ou la vérification de l'horodatage du fichier lastsync du miroir pour s'assurer que les listes de paquets sont à jour.\n\n"
    },
    {
      "title": "Tri des miroirs",
      "level": 2,
      "content": "Lors du téléchargement des paquets, pacman utilise les miroirs dans l'ordre où ils sont listés dans /etc/pacman.d/mirrorlist. L'ordre dans lequel les serveurs apparaissent dans la liste définit leur priorité.\n\nIl n'est pas optimal de classer les miroirs uniquement en fonction de leur vitesse, car les serveurs les plus rapides peuvent se désynchroniser. Faites plutôt une liste de miroirs triés par leur vitesse, puis supprimez ceux de la liste qui sont désynchronisés en fonction de leur status.\n\nIl est recommandé de répéter régulièrement ce processus pour garder la liste des miroirs à jour.\n\n"
    },
    {
      "title": "Classement d'une liste de miroirs existante",
      "level": 4,
      "content": "Le paquet pacman-contrib fournit un script Bash, /usr/bin/rankmirrors, qui peut être utilisé pour classer les miroirs en fonction de leur vitesse de connexion et d'ouverture afin de profiter de l'utilisation du miroir local le plus rapide.\n\nSauvegardez la /etc/pacman.d/mirrorlist existante :\n\n```\n# cp /etc/pacman.d/mirrorlist /etc/pacman.d/mirrorlist.backup\n```\n\nPour préparer mirrorlist.backup à être classé avec rankmirrors, les actions suivantes peuvent être effectuées :\n\n- Editer mirrorlist.backup et décommenter les serveurs à tester.\n\n- Si les serveurs du fichier sont regroupés par pays, on peut extraire tous les serveurs d'un pays spécifique en utilisant : $ awk '/^## Nom du pays$/{f=1 ; next}f==0{next}/^$/{exit}{print substr($0, 1);}' /etc/pacman.d/mirrorlist.backup\n\n```\n$ awk '/^## Nom du pays$/{f=1 ; next}f==0{next}/^$/{exit}{print substr($0, 1);}' /etc/pacman.d/mirrorlist.backup\n```\n\n- Pour décommenter chaque miroir, exécutez la ligne sed suivante : # sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n\n```\n# sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n```\n\n- Enfin, classez les miroirs, ici avec l'opérande -n 6 pour n'afficher que les 6 miroirs les plus rapides : # rankmirrors -n 6 /etc/pacman.d/mirrorlist.backup > /etc/pacman.d/mirrorlist\n\n```\n# rankmirrors -n 6 /etc/pacman.d/mirrorlist.backup > /etc/pacman.d/mirrorlist\n```\n\n"
    },
    {
      "title": "Récupérer et classer une liste de miroirs en direct",
      "level": 4,
      "content": "Afin de commencer avec une liste restreinte de miroirs à jour basés dans certains pays et de la transmettre à rankmirrors, on peut récupérer la liste depuis le Pacman Mirrorlist Generator. La commande ci-dessous récupère les miroirs à jour en France ou au Royaume-Uni qui prennent en charge le protocole https, elle décompose les serveurs de la liste, les classe et affiche les 5 plus rapides.\n\n```\n$ curl -s \"https://archlinux.org/mirrorlist/?country=FR&country=GB&protocol=https&use_mirror_status=on\" | sed -e 's/^#Server/Server/' -e '/^#/d' | rankmirrors -n 5 -\n```\n\nOutils existants :\n\nRate Mirrors — Il récupère les miroirs, ignore les miroirs obsolètes/synchronisés, puis utilise des informations sur les câbles sous-marins et les échanges Internet pour passer d'un pays à l'autre et trouver des miroirs rapides. Et il est assez rapide pour être lancé avant chaque mise à jour. Il prends également en charge les listes de miroirs personnalisées alimentées par stdin.\n\n"
    },
    {
      "title": "Classement côté serveur",
      "level": 3,
      "content": "Le Pacman Mirrorlist Generator officiel fournit un moyen facile d'obtenir une liste classée de miroirs. Comme tout le classement est effectué sur un seul serveur qui prend en compte plusieurs facteurs, la charge sur les miroirs et les clients est considérablement réduite par rapport au classement sur chaque client individuel.\n\nUne autre alternative populaire est l'outil suivant :\n\nReflector — Récupère la dernière liste de miroirs depuis la page MirrorStatus, la filtre et la trie par vitesse et écrase /etc/pacman.d/mirrorlist. Fournit une automatisation avec un service et un timer systemd.\n\n"
    },
    {
      "title": "Liste de miroir manquante",
      "level": 3,
      "content": "Si vous rencontrez l'erreur suivante :\n\n```\nerror: config file /etc/pacman.d/mirrorlist could not be read: No such file or directory\n```\n\nObtenez la liste des miroirs directement depuis le site web :\n\n```\n# curl -o /etc/pacman.d/mirrorlist https://archlinux.org/mirrorlist/all/\n```\n\nAssurez-vous de décommenter un miroir préféré comme décrit ci-dessus, puis :\n\n```\n# pacman -Syu pacman-mirrorlist\n```\n\n"
    },
    {
      "title": "Miroirs qui se comportent mal",
      "level": 3,
      "content": "Si vous êtes certain qu'un miroir ne fonctionne pas correctement et que cela n'apparaît pas sur la page mirrors status page (en), changez de miroir et envisagez l'ouverture d'un rapport de bug (en). Pour les miroirs, le problème doit être ouvert dans le projet \"Arch Linux\" (consultez la liste juste en dessous de la boîte de connexion, ou recherchez \"switch\" sur la page), avec le type de tâche \"Bug report\", catégorie \"Mirrors\".\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- GitHub archweb mirrorlist.py - code source du générateur de liste de miroirs archweb\n\n"
    }
  ]
}