{
  "title": "Mirrors (Español)",
  "url": "https://wiki.archlinux.org/title/Mirrors_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-10-20** \n\nArtículos relacionados\n\n- Servidores de réplicas no oficiales\n- pacman\n\nEsta página es una guía para seleccionar y configurar los servidores de réplicas, y obtener un listado de los servidores de réplicas disponibles actuales.\n\n"
    },
    {
      "title": "Servidores de réplicas oficiales",
      "level": 2,
      "content": "La lista servidores de réplicas oficial de Arch Linux está disponible en el paquete pacman-mirrorlist. Para obtener una lista aún más actualizada de servidores de réplicas, utilice la página Pacman Mirrorlist Generator.\n\nVerifique el estado de los servidores de réplicas visitando la página Mirror Status. Se recomienda usar solo servidores de réplicas que estén actualizados, es decir, que estén sincronizados.\n\nSi desea que su servidor de réplica se añada a la lista oficial, consulte DeveloperWiki:NewMirrors. Mientras tanto, agréguelo al artículo Unofficial mirrors.\n\n"
    },
    {
      "title": "Servidores de réplicas preparados para IPv6",
      "level": 3,
      "content": "El Pacman Mirrorlist Generator también se puede utilizar para encontrar una lista de los servidores de réplicas IPv6 actuales.\n\n"
    },
    {
      "title": "Activar un servidor de réplica específico",
      "level": 2,
      "content": "Para activar los servidores de réplicas, edite /etc/pacman.d/mirrorlist y localice su región geográfica. Descomente los servidores de réplicas que le gustaría usar.\n\nPor ejemplo:\n\n```\n## Worldwide\n#Server = https://geo.mirror.pkgbuild.com/$repo/os/$arch\n#Server = http://mirror.rackspace.com/archlinux/$repo/os/$arch\nServer = https://mirror.rackspace.com/archlinux/$repo/os/$arch\n```\n\nVéase #Ordenar los servidores de réplicas para conocer herramientas que ayudan a elegir servidores de réplicas.\n\nTambién es posible especificar servidores de réplicas en /etc/pacman.conf. Para el repositorio [core], la configuración predeterminada sería:\n\n```\n[core]\nInclude = /etc/pacman.d/mirrorlist\n```\n\nPara usar el servidor de réplica kernel.org como servidor predeterminado, agréguelo antes de la línea Include:\n\n```\n[core]\nServer = https://mirrors.kernel.org/archlinux/$repo/os/$arch\nInclude = /etc/pacman.d/mirrorlist\n```\n\npacman ahora intentará conectarse a este servidor de réplica primero. Proceda a hacer lo mismo para [core-testing], [extra], y [extra-testing], si procede.\n\n"
    },
    {
      "title": "Forzar a pacman a actualizar las listas de paquetes",
      "level": 3,
      "content": "Los servidores de réplicas pueden no estar sincronizados y la lista de paquetes del servidor antiguo puede no corresponder con la lista de paquetes del servidor nuevo, aunque las fechas de las listas puedan sugerir que sí lo están.\n\nDespués de crear/editar /etc/pacman.d/mirrorlist, emita la siguiente orden:\n\n```\n# pacman -Syyu\n```\n\nPasar dos indicadores --refresh/-y obliga a pacman a actualizar todas las listas de paquetes, incluso si se consideran actualizadas. Emitir pacman -Syyu es un desperdicio innecesario de ancho de banda en la mayoría de los casos, pero a veces puede solucionar problemas al cambiar de un servidor de réplica roto a otro que funcione. Vea también Is -Syy safe?.\n\nNote: **lastsync** \n\n```\n# pacman -Syyuu\n```\n\n"
    },
    {
      "title": "Ordenar los servidores de réplicas",
      "level": 2,
      "content": "Al descargar paquetes, pacman usa los servidores de réplicas en el orden en que se enumeran en /etc/pacman.d/mirrorlist. El orden de los servidores que aparecen en la lista establece su prioridad.\n\nNo es óptimo clasificar los servidores de réplicas basándose solo en la velocidad, ya que los servidores más rápidos pueden estar desincronizados. En su lugar, haga una lista de servidores de réplicas ordenados por su velocidad, y luego elimine aquellos de la lista que no estén sincronizados de acuerdo con su estado.\n\nSe recomienda repetir este proceso regularmente para mantener actualizada la lista de servidores de réplicas.\n\n"
    },
    {
      "title": "Clasificación de una lista servidores de réplicas existente",
      "level": 4,
      "content": "El paquete pacman-contrib proporciona un script de Bash, /usr/bin/rankmirrors, que se puede utilizar para clasificar los servidores de réplicas según su conexión y velocidades de apertura para aprovechar el uso del servidor de réplica local más rápido.\n\nHaga una copia de seguridad del archivo /etc/pacman.d/mirrorlist existente:\n\n```\n# cp /etc/pacman.d/mirrorlist /etc/pacman.d/mirrorlist.backup\n```\n\nPara preparar mirrorlist.backup para clasificarlo con rankmirrors, se pueden realizar las siguientes acciones:\n\n- Edite mirrorlist.backup y descomente los servidores que se probarán.\n\n- Si los servidores en el archivo están agrupados por país, se pueden extraer todos los servidores de un país específico utilizando: $ awk '/^## Nombre del país$/{f=1; next}f==0{next}/^$/{exit}{print substr($0, 1);}' /etc/pacman.d/mirrorlist.backup\n\n```\n$ awk '/^## Nombre del país$/{f=1; next}f==0{next}/^$/{exit}{print substr($0, 1);}' /etc/pacman.d/mirrorlist.backup\n```\n\n- Para descomentar cada servidor de réplica, ejecute la siguiente línea con sed: # sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n\n```\n# sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n```\n\n- Por último, clasifique los servidores de réplicas, aquí con el operando -n 6 para generar solo los 6 servidores de réplicas más rápidos: # rankmirrors -n 6 /etc/pacman.d/mirrorlist.backup > /etc/pacman.d/mirrorlist\n\n```\n# rankmirrors -n 6 /etc/pacman.d/mirrorlist.backup > /etc/pacman.d/mirrorlist\n```\n\n"
    },
    {
      "title": "Obtener y ordenar una lista de servidores de réplicas funcionales",
      "level": 4,
      "content": "Para comenzar con una lista reducida de servidores de réplicas actualizados basados en algunos países y que sirvan de fuente a rankmirrors, se puede obtener la lista de Pacman Mirrorlist Generator. La siguiente orden muestra los servidores de réplicas actualizados de Francia o Reino Unido que admiten el protocolo https, los descomenta en la lista y luego los clasifica y genera el 5 más rápido:\n\n```\n$ curl -s \"https://archlinux.org/mirrorlist/?country=FR&country=GB&protocol=https&use_mirror_status=on\" | sed -e 's/^#Server/Server/' -e '/^#/d' | rankmirrors -n 5 -\n```\n\nHerramientas existentes:\n\nRate Mirrors — Obtiene servidores de réplicas, omite los obsoletos/sincronizados, luego usa información sobre cables submarinos e intercambios de Internet para saltar entre países y encontrar servidores de réplicas rápidos. Y es lo suficientemente rápido como para ejecutarlo antes de cada actualización. También admite listas de réplicas personalizadas alimentadas a través de stdin.\n\n"
    },
    {
      "title": "Clasificación del lado del servidor",
      "level": 3,
      "content": "El Pacman Mirrorlist Generator oficial proporciona una manera fácil de obtener una lista clasificada de servidores de réplicas. Debido a que toda la clasificación se realiza en un único servidor que tiene en cuenta múltiples factores, la cantidad de carga en los servidores de réplicas y los clientes es significativamente menor en comparación con la clasificación en cada cliente individual.\n\nOtra alternativa popular es la siguiente herramienta:\n\nReflector — Recupera la última lista servidores de réplicas de la página MirrorStatus, los filtra y los ordena por velocidad, y sobrescribe el archivo /etc/pacman.d/mirrorlist. Proporciona automatización con un servicio systemd y un temporizador.\n\n"
    },
    {
      "title": "Falta la lista de servidores de réplicas",
      "level": 3,
      "content": "En caso de que encuentre el siguiente error:\n\n```\nerror: config file /etc/pacman.d/mirrorlist could not be read: No such file or directory\n```\n\nObtenga la lista servidores de réplicas directamente desde el sitio web:\n\n```\n# curl -o /etc/pacman.d/mirrorlist https://archlinux.org/mirrorlist/all/\n```\n\nAsegúrese de descomentar un servidor de réplica preferido como se describió anteriormente, así:\n\n```\n# pacman -Syu pacman-mirrorlist\n```\n\n"
    },
    {
      "title": "Servidores de réplicas que se portan mal",
      "level": 3,
      "content": "Si está seguro de que un servidor de réplicas no funciona correctamente y eso no se refleja en la página de estado de los servidores de réplicas, cambie el servidor y considere abrir un informe de error. Para los servidores de réplicas, el problema debe abrirse en el proyecto \"Arch Linux\" (véase la lista justo debajo del cuadro de inicio de sesión, o busque \"switch\" (cambiar) en la página), con el tipo de tarea \"Bug report\" (Informe de error), categoría \"Mirrors\" (Servidores de réplicas).\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- GitHub archweb mirrorlist.py — código fuente del generador demirrorlist de archweb\n\n"
    }
  ]
}