{
  "title": "Mirrors (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Mirrors_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "İlgili makaleler\n\n- Unofficial mirrors\n- pacman\n- DeveloperWiki:NewMirrors\n\nBu makale yansımalarınızı seçmede, yapılandırmada ve güncel yansımalarınızı listelemede rehber olması amacı ile oluşturulmuştur.\n\n"
    },
    {
      "title": "Resmî yansımalar",
      "level": 2,
      "content": "Resmî Arch Linux yansıma listesine pacman-mirrorlist paketi ile ulaşabilirsiniz. Daha da güncel bir yansıma listesi edinmek için Pacman Yansıma Listesi Oluşturucu'yu kullanabilirsiniz.\n\nYansımaların durumunu Yansıma Durumu sayfasından kontrol edebilirsiniz. Sadece güncel olan, yani senkronizasyonu bozulmuş olmayan yansımaları kullanmanız tavsiye edilir.\n\nEğer kişisel yansımanızın resmî listeye eklenmesini istiyorsanız, DeveloperWiki:NewMirrors makalesine bakın. Bu süre zarfında yansımanızı Unofficial mirrors makalesine ekleyebilirsiniz.\n\n"
    },
    {
      "title": "IPv6 yansımalar",
      "level": 3,
      "content": "Güncel IPv6 yansımaların listesi için de Pacman Yansıma Listesi Oluşturucu kullanılabilir.\n\n"
    },
    {
      "title": "Belirli bir yansımayı aktif hâle getirme",
      "level": 2,
      "content": "Yansımaları aktif hale getirmek için /etc/pacman.d/mirrorlist dosyasını düzenlemeniz gerekmektedir. Dosyanın içerisinde kendi bölgenizi veya kullanmak istediğiniz diğer yansımaları bulun ve yorum blokundan çıkarın.\n\nÖrneğin:\n\n```\n## Worldwide\n#Server = https://geo.mirror.pkgbuild.com/$repo/os/$arch\n#Server = http://mirror.rackspace.com/archlinux/$repo/os/$arch\nServer = https://mirror.rackspace.com/archlinux/$repo/os/$arch\n```\n\nYansıma seçmede yardımcı olacak bazı araçlar için #Yansımaları sıralama bölümüne bakın.\n\nYansımaları /etc/pacman.conf içerisinde belirtmek de mümkündür. Örneğin core deposu için varsayılan ayarlar şu şekildedir:\n\n```\n[core]\nInclude = /etc/pacman.d/mirrorlist\n```\n\nkernel.org yansımasını varsayılan olarak ayarlamak için, Include satırından önce şunu ekleyin:\n\n```\n[core]\nServer = https://mirrors.kernel.org/archlinux/$repo/os/$arch\nInclude = /etc/pacman.d/mirrorlist\n```\n\nBu değişiklikler ile pacman öncelikle belirttiğiniz yansımaya bağlanmaya çalışacaktır. Eğer mümkünse aynı değişikliği core-testing, extra ve extra-testing için de yapmanız gerekmektedir.\n\n"
    },
    {
      "title": "pacman'i paket listesini yenilemeye zorlama",
      "level": 3,
      "content": "Yansımalar senkronize olmayabilir ve eski yansımanın paket listesi, listelerin tarihleri öyle olduğunu gösterse bile, yeni yansımanın paket listesine karşılık gelmeyebilir.\n\n/etc/pacman.d/mirrorlist dosyasını oluşturduktan/düzenledikten sonra, aşağıdaki komutu çalıştırın:\n\n```\n# pacman -Syyu\n```\n\nİki tane --refresh/-y bayrağı kullanmak pacman'i, güncel gözüküyorlarsa bile, tüm paket listelerini yenilemeye zorlar.\n\nNote: Bu, başarılı bir şekilde senkronize edilen yansımaları kullanırken veya paket listelerinin güncel olduğundan emin olmak için yansımaların lastsync dosyasının zaman damgasını kontrol etmişseniz gerekli değildir.\n\n```\n# pacman -Syyuu\n```\n\nBu, başarılı bir şekilde senkronize edilen yansımaları kullanırken veya paket listelerinin güncel olduğundan emin olmak için yansımaların lastsync dosyasının zaman damgasını kontrol etmişseniz gerekli değildir.\n\n"
    },
    {
      "title": "Yansımaları sıralama",
      "level": 2,
      "content": "Pacman herhangi bir paket indirirken yansımaları /etc/pacman.d/mirrorlist dosyasında sıralandığı hâlleriyle kullanır. Sunucuların listedeki sırasına göre öncelikleri ayarlanır.\n\nEn hızlı sunucular bazen senkronize olmayabileceğinden, yansımaları yalnızca hıza göre sıralamak uygun değildir. Bunun yerine, hızlarına göre sıralanmış bir yansıma listesi oluşturun, ardından yansımaların durumlarına göre senkronize olmayanları listeden çıkarın.\n\nYansımalar listesini güncel tutmak için bu işlemin düzenli olarak tekrarlanması önerilir.\n\n"
    },
    {
      "title": "Elde bulunan bir yansıma listesini sıralama",
      "level": 4,
      "content": "pacman-contrib paketi, en hızlı yerel yansımayı kullanmanın avantajından yararlanmak için yansımaları bağlantı ve açılış hızlarına göre sıralamak için kullanılabilecek /usr/bin/rankmirrors adlı bir Bash betiği sağlar.\n\nHâlihazırda /etc/pacman.d/mirrorlist konumunda bulunan yansıma listesi dosyasını yedekleyin:\n\n```\n# cp /etc/pacman.d/mirrorlist /etc/pacman.d/mirrorlist.backup\n```\n\nmirrorlist.backup dosyasını rankmirrors ile sıralamak için aşağıdaki yönergeler takip edilebilir:\n\n- mirrorlist.backup dosyasını bir metin düzenleyicisi ile açın ve test etmek istediğiniz sunucuları yorum blokundan çıkarın.\n- Dosyanın içerisindeki sunucular ülkeye göre gruplanmış ise şu komut ile belli bir ülke için olan sunucular seçilebilir: $ awk '/^## Ülke ismi (İngilizce haliyle)$/{f=1; next}f==0{next}/^$/{exit}{print substr($0, 1);}' /etc/pacman.d/mirrorlist.backup\n- Tüm yansımaları yorum satırından çıkarmak için şu sed komutunu girin: # sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n- Son olarak, -n 6 miktar belirtme bayrağı ile sadece en hızlı 6 yansımanın çıktısını almak için şu komutu kullanın: # rankmirrors -n 6 /etc/pacman.d/mirrorlist.backup > /etc/pacman.d/mirrorlist\n\n```\n$ awk '/^## Ülke ismi (İngilizce haliyle)$/{f=1; next}f==0{next}/^$/{exit}{print substr($0, 1);}' /etc/pacman.d/mirrorlist.backup\n```\n\n```\n# sed -i 's/^#Server/Server/' /etc/pacman.d/mirrorlist.backup\n```\n\n```\n# rankmirrors -n 6 /etc/pacman.d/mirrorlist.backup > /etc/pacman.d/mirrorlist\n```\n\n"
    },
    {
      "title": "Canlı bir yansıma listesini çekip sıralama",
      "level": 4,
      "content": "Bazı ülkelerde bulunan güncel yansımaların kısa bir listesiyle başlamak ve bunu rankmirrors'a sağlamak için Pacman Yansıma Listesi Oluşturucu'dan liste edinilebilir. Aşağıdaki komut; https protokolünü destekleyen, Fransa veya Birleşik Krallık'taki güncel yansımaları çeker, listedeki sunucuları yorum blokundan çıkarır, ardından bunları sıralar ve en hızlı 5 yansımanın çıktısını verir.\n\n```\n$ curl -s \"https://archlinux.org/mirrorlist/?country=FR&country=GB&protocol=https&use_mirror_status=on\" | sed -e 's/^#Server/Server/' -e '/^#/d' | rankmirrors -n 5 -\n```\n\nMevcut araçlar:\n\n"
    },
    {
      "title": "Sunucu taraflı sıralama",
      "level": 3,
      "content": "Resmî Pacman Yansıma Listesi Oluşturucu, sıralanmış bir yansıma listesi elde etmek için kolay bir yol sağlar. Tüm sıralama işlemleri tek bir sunucuda yapıldığı ve birden fazla faktör göz önünde bulundurulduğu için, yansımalara ve kullanıcı tarafına binen yük, her kullanıcının kendi sıralamasını yapmasına kıyasla, oldukça azdır.\n\nBir diğer popüler alternatif ise aşağıdaki araçtır:\n\n- ghostmirror — Diğer yansıma yazılımlarından farklı olarak GhostMirror, yansımaların senkronize olup olmadığını kontrol eder, basit bir ping testine ek olarak gerçek bir hız testi yapar, bunların hepsini systemd ile otomatikleştirir, ve eğer doğru yapılandırılmış ise, elle yansıma düzenlemeye \"güle güle\" demenize olanak sağlar.\n\n- Reflector — En son yansıma listesini MirrorStatus sayfasından alır, bunları hıza göre filtreler, sıralar ve /etc/pacman.d/mirrorlist üzerine yazar. Bulundurduğu systemd servisi ve zamanlayıcısı ile otomasyon sağlar.\n\n- mirro-rs — TUI'ye sahip bir Arch Linux yansıma listesi yöneticisi.\n\n- rate-mirrors — Günlük kullanıma uygun, kullanıcı taraflı, harita farkındalığına sahip yansıma sıralama aracı.\n\n- shiny-mirrors — Rust ile yazılmış bir Reflector alternatifi.\n\n"
    },
    {
      "title": "Kayıp mirrorlist",
      "level": 3,
      "content": "Eğer aşağıdaki hata ile karşılaşırsanız:\n\n```\nerror: config file /etc/pacman.d/mirrorlist could not be read: No such file or directory\n```\n\nYansıma listesini websiteden direkt olarak edinin:\n\n```\n# curl -o /etc/pacman.d/mirrorlist https://archlinux.org/mirrorlist/all/\n```\n\n#Belirli bir yansımayı aktif hâle getirme bölümünde de belirtildiği gibi tercih ettiğiniz yansımaları yorum blokundan çıkarın ve şu komutu çalıştırın:\n\n```\n# pacman -Syu pacman-mirrorlist\n```\n\n"
    },
    {
      "title": "Beklenildiği gibi davranmayan yansımalar",
      "level": 3,
      "content": "Eğer belli bir yansıma, yansıma durum bilgisi sayfasındakinin aksine beklenildiği gibi çalışmıyorsa, yansımayı değiştirin ve bir hata bildirisi oluşturmayı gözden geçirin. Yansımalar için bu hata bildirileri Arch Linux GitLab projesindeki arch-mirrors deposunda oluşturulmalıdır. Aynı zamanda mirrors@archlinux.org adresine mail de gönderebilirsiniz.\n\n"
    },
    {
      "title": "Ayrıca bakınız",
      "level": 2,
      "content": "- GitHub archweb mirrorlist.py - archweb yansıma listesi oluşturucunun kaynak kodu\n\n"
    }
  ]
}