{
  "title": "Mlocate (Español)",
  "url": "https://wiki.archlinux.org/title/Mlocate_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nNote: **2020-12-11** \n\nArtículos relacionados\n\n- find\n- Core utilities (Español)\n- List of applications/Utilities#File searching\n\nmlocate (Merging Locate) es una versión más segura de la utilidad locate, que solo muestra los archivos accesibles para el usuario.\n\nplocate (Posting Locate) es un locate basado en listas de publicaciones, que consume la base de datos de mlocate con anticipación y hace un índice mucho más rápido (y más pequeño) de él.\n\nlocate es una herramienta común de Unix para buscar rápidamente archivos por nombre. Ofrece mejoras de velocidad sobre la herramienta find al buscar en un archivo de base de datos preconstruido, en lugar del sistema de archivos directamente. La desventaja de este enfoque es que los cambios realizados desde la construcción del archivo de la base de datos no pueden ser detectados por locate. Este problema se puede minimizar mediante actualizaciones programadas de la base de datos.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete mlocate[enlace roto: replaced by plocate]. También se puede instalar plocate para hacer (con update-plocate.sh) un índice más rápido fuera de la base de datos mlocate[enlace roto: replaced by plocate].\n\nMientras que GNU findutils incluye también una implementación de locate, el paquete de Arch findutils no lo hace.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Antes de que se pueda utilizar locate(1)[enlace roto 2024-10-13], deberá crearse la base de datos, esto se hace con el comando updatedb(8), que (como su nombre indica) actualiza la base de datos.\n\nEl paquete contiene una unidad updatedb.timer, que invoca una actualización de la base de datos cada día. El temporizador se habilita justo después de la instalación, inícielo manualmente si desea utilizarlo antes de reiniciar. También puede ejecutar manualmente updatedb como superusuario (root) en cualquier momento.\n\nPara ahorrar tiempo, updatedb puede (y está así por defecto) configurarse para ignorar ciertos sistemas de archivos y rutas editando /etc/updatedb.conf. updatedb.conf(5) describe la semántica de este archivo. Vale la pena señalar que entre las rutas ignoradas en la configuración predeterminada (PRUNEPATHS) están /media y /mnt, por lo que locate puede no descubrir archivos en dispositivos externos.\n\n"
    },
    {
      "title": "Véase tambien",
      "level": 2,
      "content": "- Cómo funciona locate y reescribirlo en un minuto\n\n"
    }
  ]
}