{
  "title": "Moksha (Español)",
  "url": "https://wiki.archlinux.org/title/Moksha_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-10-02** \n\nArtículos relacionados\n\n- Comparación de entornos de escritorio\n- Freedesktop.org\n\nUn entorno de escritorio (desktop environment, o DE) es una implementación de la metáfora de escritorio hecha de un conjunto de programas, que comparten una interfaz gráfica de usuario (GUI) común.\n\n"
    },
    {
      "title": "Visión general",
      "level": 2,
      "content": "Un entorno de escritorio agrupa una variedad de componentes para proporcionar elementos de interfaz gráfica de usuario comunes, como iconos, barras de herramientas, fondos de pantalla y widgets de escritorio. Además, la mayoría de los entornos de escritorio incluyen un conjunto de aplicaciones y utilidades integradas. Lo que es más importante, los entornos de escritorio proporcionan su propio gestor de ventanas que generalmente se puede reemplazar por otro compatible.\n\nEl usuario es libre de configurar su entorno GUI de varias maneras. Los entornos de escritorio simplemente proporcionan un medio completo y conveniente para realizar esta tarea. Tenga en cuenta que los usuarios pueden mezclar y combinar aplicaciones de múltiples entornos de escritorio. Por ejemplo, un usuario de KDE puede instalar y ejecutar aplicaciones GNOME como el navegador web Epiphany, en caso de que lo prefiera al navegador web Konqueror de KDE. Un inconveniente de este enfoque es que muchas aplicaciones proporcionadas por proyectos de entorno de escritorio dependen en gran medida de las bibliotecas subyacentes al entorno de escritorio respectivo. Como resultado, la instalación de aplicaciones desde una variedad de entornos de escritorio requerirá la instalación de una mayor cantidad de dependencias. Los usuarios que buscan conservar espacio en disco a menudo evitan estos entornos mixtos o eligen alternativas que dependen solo de unas pocas bibliotecas externas.\n\nAdemás, las aplicaciones proporcionadas por los entornos de escritorio tienden a integrarse mejor con sus entornos nativos. Superficialmente, mezclar entornos con diferentes conjuntos de herramientas (toolkits) de widgets dará como resultado discrepancias visuales (es decir, las interfaces utilizarán diferentes estilos de iconos y widgets). En términos de usabilidad, es posible que los entornos mixtos no se comporten de manera similar (p. ej., iconos de un solo clic versus iconos de doble clic; funcionalidad de arrastrar y soltar), lo que puede causar confusión o un comportamiento inesperado.\n\n"
    },
    {
      "title": "Soportados oficialmente",
      "level": 3,
      "content": "- Budgie — Budgie es un entorno de escritorio diseñado pensando en el usuario moderno, se centra en la simplicidad y la elegancia.\n\n- Cinnamon — Cinnamon se esfuerza por proporcionar una experiencia de usuario tradicional. Cinnamon es una bifurcación de GNOME 3.\n\n- Cutefish — Cutefish es un entorno de escritorio nuevo y moderno.\n\n- Deepin — La interfaz y las aplicaciones de escritorio de Deepin cuentan con un diseño intuitivo y elegante. Moverse, compartir y buscar, etc. se ha convertido simplemente en una experiencia alegre.\n\n- Enlightenment — El shell de escritorio de Enlightenment proporciona un administrador de ventanas eficiente basado en las Enlightenment Foundation Libraries junto con otros componentes de escritorio esenciales como un administrador de archivos, iconos de escritorio y widgets. Admite temas, sin dejar de ser capaz de funcionar en hardware antiguo o dispositivos integrados.\n\n- GNOME — El entorno de escritorio GNOME es un escritorio atractivo e intuitivo con una sesión moderna (GNOME) y clásica (GNOME Classic).\n\n- GNOME Flashback — GNOME Flashback es un shell para GNOME 3 que inicialmente se llamó modo de respaldo de GNOME. El diseño del escritorio y la tecnología subyacente es similar a GNOME 2.\n\n- KDE Plasma — El entorno de escritorio KDE Plasma es un entorno de trabajo conocido. Plasma ofrece todas las herramientas necesarias para una experiencia informática de escritorio moderna para que pueda ser productivo desde el principio.\n\n- LXDE — El entorno de escritorio ligero X11 (LXDE) es un entorno de escritorio rápido y que ahorra energía. Viene con una interfaz moderna, compatibilidad con varios idiomas, atajos de teclado estándar y características adicionales como exploración de archivos con pestañas. Diseñado fundamentalmente para ser liviano, LXDE se esfuerza por consumir menos CPU y RAM que otros entornos.\n\n- LXQt — LXQt es el port Qt y la próxima versión de LXDE, el entorno de escritorio ligero. Es el producto de la fusión entre los proyectos LXDE-Qt y Razor-qt: un entorno de escritorio ligero, modular, ultra-rápido y fácil de utilizar.\n\n- MATE — Mate proporciona un escritorio intuitivo y atractivo para los usuarios de Linux utilizando metáforas tradicionales. MATE comenzó como una bifurcación de GNOME 2, pero ahora utiliza GTK 3.\n\n- Sugar — Sugar Learning Platform es un entorno informático compuesto por actividades diseñadas para ayudar a los niños de 5 a 12 años a aprender juntos a través de la expresión de medios enriquecidos. Sugar es el componente central de un esfuerzo mundial para brindar a todos los niños la oportunidad de una educación de calidad . Actualmente lo utilizan casi un millón de niños en todo el mundo que hablan 25 idiomas en más de 40 países. Sugar proporciona los medios para ayudar a las personas a llevar una vida plena a través del acceso a una educación de calidad que muchos no ven en la actualidad.\n\n- UKUI — UKUI es un entorno de escritorio ligero de Linux, desarrollado en base a GTK y Qt. UKUI es el entorno de escritorio predeterminado para Ubuntu kylin.\n\n- Xfce — Xfce incorpora la filosofía UNIX tradicional de modularidad y reutilización. Consta de una serie de componentes que proporcionan la funcionalidad completa que uno puede esperar de un entorno de escritorio moderno, sin dejar de ser relativamente ligero. Se empaquetan por separado y puede elegir entre los paquetes disponibles para crear el entorno de trabajo personal óptimo.\n\n"
    },
    {
      "title": "Soportados extraoficialmente",
      "level": 3,
      "content": "- CDE — Common Desktop Environment es un entorno de escritorio para Unix y OpenVMS, basado en el kit de herramientas de widgets de Motif. Formaba parte del estándar de producto de estación de trabajo UNIX98 y durante mucho tiempo fue el escritorio Unix \"clásico\" asociado con las estaciones de trabajo Unix comerciales. A pesar de ser un entorno heredado, también se mantiene vivo con soporte para sistemas Linux.\n\n- EDE — El \"Entorno de escritorio Equinox\" es un entorno de escritorio diseñado para ser simple, extremadamente ligero y rápido.\n\n- KDE 1 — \"portado hacia adelante\" para trabajar en sistemas modernos. Principalmente por nostalgia, pero ahora realmente funciona y se puede utilizar diariamente. También hay un número creciente de aplicaciones de KDE 1 en AUR.\n\n- Liri — Liri es un entorno de escritorio con un diseño y características modernas. Liri es la unión entre Hawaii, Papyros y el proyecto Liri. Altamente experimental.\n\n- Lumina — Lumina es un entorno de escritorio ligero escrito en Qt 5 para FreeBSD que utiliza Fluxbox para la gestión de ventanas.\n\n- Maui Shell — Maui Shell es un shell convergente para computadoras de escritorio, tabletas y teléfonos.\n\n- Moksha — Esta bifurcación de Enlightenment se usa actualmente como entorno de escritorio predeterminado en Bodhi Linux basado en Ubuntu.\n\n- Pantheon — Pantheon es el entorno de escritorio predeterminado creado originalmente para la distribución del sistema operativo elemental. Está escrito desde cero utilizando Vala y el kit de herramientas GTK3. Con respecto a la usabilidad y la apariencia, el escritorio tiene algunas similitudes con GNOME Shell y macOS.\n\n- PaperDE — Entorno de escritorio construido sobre Qt/Wayland y wayfire.\n\n- Phosh — Phosh es una interfaz de usuario shell Wayland basada en GNOME, útil en dispositivos móviles.\n\n- Plasma Mobile — Plasma Mobile es un entorno de escritorio centrado en dispositivos móviles construido sobre la pila KDE Plasma y Wayland.\n\n- theDesk — theDesk es un entorno de escritorio que intenta ser lo más transparente posible. Utiliza Qt 5 como su conjunto de herramientas de widgets y KWin como su administrador de ventanas.\n\n- Trinity — El proyecto Trinity Desktop Environment (TDE) es un entorno de escritorio de computadora para sistemas operativos similares a Unix con el objetivo principal de conservar el estilo informático general de KDE 3.5.\n\n"
    },
    {
      "title": "Entornos personalizados",
      "level": 2,
      "content": "Los entornos de escritorio representan la forma más sencilla de instalar un entorno gráfico \"completo\". Sin embargo, los usuarios son libres de crear y personalizar su entorno gráfico de cualquier forma si ninguno de los entornos de escritorio populares cumple con sus requisitos. En general, crear un entorno personalizado implica la selección de un gestor de ventanas o compositor adecuado, una barra de tareas y varias aplicaciones (una selección minimalista generalmente incluye un emulador de terminal, administrador de archivos y editor de texto).\n\nOtros componentes que suelen proporcionar los entornos de escritorio son:\n\n- Compositor de escritorio (Xorg)\n- Sistema de notificaciones\n- Gestor de pantalla\n- Bloqueador de pantalla\n- Lanzador de aplicaciones\n- Control de sonido\n- Control de brillo\n- Control de medios\n- Agente de autenticación Polkit\n- Administración de energía\n- Capturar de pantalla\n- Temperatura de la pantalla\n- Colocador de fondos de pantalla\n- Diálogo de cierre de sesión\n- Aplicaciones predeterminadas\n\n"
    },
    {
      "title": "Utilizar un administrador de ventanas diferente",
      "level": 3,
      "content": "Si el entorno de escritorio tiene un artículo, véase su sección Utilizar un administrador de ventanas diferente, de lo contrario véase la documentación oficial.\n\n- Budgie (Español)#Usar un gestor de ventanas distinto\n- Cinnamon#Use a different window manager\n- GNOME (Español)#Utilizar un gestor de ventanas diferente\n- KDE (Español)#Usar un gestor de ventanas diferente\n- LXDE (Español)#Usando un gestor de ventanas diferente\n- LXQt#Use a different window manager\n- MATE#Use a different window manager\n- Xfce#Use a different window manager\n\n"
    }
  ]
}