{
  "title": "Mono (Polski)",
  "url": "https://wiki.archlinux.org/title/Mono_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Z Wikipedii:\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiet mono.\n\nJeśli potrzebujesz obsługi VisualBasic.Net, musisz zainstalować interpreter VisualBasic.Net z pakietem mono-basicAUR.\n\n"
    },
    {
      "title": "Uruchamianie aplikacji Mono",
      "level": 2,
      "content": "Pliki binarne Mono można uruchomić ręcznie wywołując mono:\n\n```\n$ mono nazwa_programu.exe\n```\n\nMożna również wykonywać pliki binarne Mono bezpośrednio, tak jak natywne pliki binarne:\n\n```\n$ chmod 755 nazwa_programu.exe\n$ ./nazwa_programu.exe\n```\n\n"
    },
    {
      "title": "Testowanie Mono",
      "level": 2,
      "content": "Make a new file:\n\n```\ntest.cs\n```\n\n```\nusing System;\n\npublic class Test {\n public static void Main(string[] args) {\n  Console.WriteLine(\"Hello World!\");\n }\n}\n```\n\nNastępnie uruchom:\n\n```\n$ mcs test.cs\n$ mono test.exe\nHello world!\n```\n\n"
    },
    {
      "title": "Programowanie",
      "level": 2,
      "content": "OmniSharp zapewnia wtyczki/integracje programistyczne .NET/Mono dla kilku edytorów, w tym Vim, Emacs i Visual Studio Code.\n\nAlternatywnie, można zainstalować riderAUR. Jeśli zainstalujesz Ridera nie z AUR, będziesz musiał zainstalować mono-msbuild, ponieważ ostatnie wersje Ridera porzuciły wsparcie xbuild na rzecz MSBuild z net-core.\n\nJeśli chcesz mieć przeglądarkę dokumentacji API i kilka narzędzi do testowania i programowania, musisz zainstalować mono-tools.\n\n"
    },
    {
      "title": "Otrzymuję błąd, gdy próbuję uruchomić pliki Mono bezpośrednio: \"cannot execute binary file\"",
      "level": 3,
      "content": "Obsługa binfmt_misc dla Mono nie została jeszcze skonfigurowana, jak wyjaśniono szczegółowo na stronie Mono Project website.\n\nAby to naprawić, zrestartuj usługę systemd-binfmt.\n\n"
    },
    {
      "title": "Otrzymuję błąd uzgadniania TLS (lub podobny oparty na certyfikacie)",
      "level": 3,
      "content": "Może to być spowodowane brakiem certyfikatów w magazynie certyfikatów Mono lub nieaktualnymi uszkodzonymi certyfikatami pozostającymi w magazynie certyfikatów Mono.\n\nJeśli to możliwe, upewnij się, że systemowy magazyn certyfikatów jest w dobrym stanie, uruchamiając curl -vI lub podobne polecenie, aby zreplikować nieudane żądanie poza Mono.\n\n- cert-sync /etc/ssl/certs/ca-certificates.crt synchronizuje magazyn mono z magazynem systemowym, dodając brakujące certyfikaty.\n- Aby usunąć uszkodzone certyfikaty (jeśli powyższe nie pomogło), należy usunąć katalog /usr/share/.mono, a następnie ponownie uruchomić cert-sync /etc/ssl/certs/ca-certificates.crt.\n- W ostateczności, starsze narzędzie mozroots --import --ask-remove omija systemowy magazyn certyfikatów i bezpośrednio pobiera magazyn zaufania Mozilli. To również nie usuwa uszkodzonych certyfikatów i może powodować inne problemy, jeśli polegasz na prywatnych urzędach certyfikacji.\n\nZarówno cert-sync jak i mozroots są częścią pakietu mono.\n\n"
    },
    {
      "title": "Zobacz także",
      "level": 2,
      "content": "- Oficjalna strona Mono\n- Podręcznik Mono\n- Dokumentacja API Mono\n- ECMA-334: Specyfikacja języka C#\n- ECMA-335: Common Language Infrastructure (CLI)\n- Instrukcje uruchamiania aplikacji Mono\n\n"
    }
  ]
}