{
  "title": "Moving an existing install into (or out of) a virtual machine (Português)",
  "url": "https://wiki.archlinux.org/title/Moving_an_existing_install_into_(or_out_of)_a_virtual_machine_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- VirtualBox\n- VMware\n- QEMU\n- Migrar instalação para novo hardware\n\nEste artigo descreve como transferir sua instalação atual do Arch Linux para dentro ou fora de um ambiente virtual (por exemplo, QEMU, VirtualBox, VMware). Uma máquina virtual (\"VM\", abreviadamente) usa hardware diferente, que precisa ser endereçado regenerando a imagem initramfs e possivelmente ajustando o fstab - especialmente se for um SSD.\n\n"
    },
    {
      "title": "Movendo para fora da uma VM",
      "level": 2,
      "content": "Mover para fora de um ambiente virtual é relativamente fácil.\n\n"
    },
    {
      "title": "Configure uma pasta compartilhada",
      "level": 3,
      "content": "A configuração de uma pasta compartilhada entre a máquina virtual convidada e o host depende do hipervisor usado. Por favor, refira-se à sua página wiki ou manual específico.\n\nSe você ainda não possui uma partição ext4, veja Sistemas de arquivos.\n\nSe você estiver no Windows, instale Ext2Fsd para poder montar volumes ext.\n\n"
    },
    {
      "title": "Transfira o sistema",
      "level": 3,
      "content": "Na máquina virtual, abra um terminal e transfira o sistema:\n\n```\n# rsync -aAXHSv /* /caminho/para/pasta/compartilhada --exclude={/dev/*,/proc/*,/sys/*,/tmp/*,/run/*,/mnt/*,/media/*,/lost+found,/home/*/.gvfs}\n```\n\nIsso também pode ser feito com o disco de inicialização do clonezilla ou dd de um live-cd Linux aleatório. Se você estiver usando o Virtualbox, precisará conectar a unidade de destino através de USB (ou cabo SATA para USB), caso contrário, use uma unidade USB externa para salvar a imagem do disco (com dd ou clonezilla).\n\n"
    },
    {
      "title": "Entre em chroot e reinstale o gerenciador de boot",
      "level": 3,
      "content": "Inicialize uma distribuição GNU/Linux \"live\", monte a partição root e faça chroot nela.\n\nReinstale seu gerenciador de boot: Syslinux, GRUB ou systemd-boot. Não se esqueça de atualizar o arquivo de configuração: syslinux.cfg para o Syslinux, grub.cfg para o Grub ou as entradas de inicialização do systemd-boot localizadas em /boot/loader/entries/.\n\n"
    },
    {
      "title": "Ajuste o fstab",
      "level": 3,
      "content": "Como toda a sua árvore raiz foi transferida para uma única partição, edite o arquivo fstab para refletir a(s) partição(ões) correta(s).\n\nVerifique com o comando blkid, já que lsblk não é muito útil dentro de um chroot.\n\n"
    },
    {
      "title": "Regenere a imagem initramfs",
      "level": 3,
      "content": "Como o hardware mudou, enquanto você ainda está no chroot, gere novamente a imagem do initramfs:\n\n```\n# mkinitcpio -p linux\n```\n\nE é basicamente isso.\n\nÉ provável que você precise configurar a rede, já que a máquina virtual provavelmente estava usando as configurações de rede do sistema operacional do host. Veja Configuração de rede.\n\n"
    },
    {
      "title": "Movendo para dentro de uma VM",
      "level": 2,
      "content": "Mover para dentro de um ambiente virtual exige um pouco mais de esforço.\n\n"
    },
    {
      "title": "Crie o contêiner",
      "level": 3,
      "content": "Isso criará uma imagem bruta de 10 GB:\n\n```\n# dd if=/dev/zero of=/media/Backup/backup.img bs=1024 count=10482381\n```\n\n```\n# fallocate -l 10GiB -o 1024 /media/Backup/backup.img\n```\n\nSe você quiser criar um com o tamanho exato de sua partição raiz, execute fdisk -l e use o valor da coluna Blocos para o parâmetro count=. Note que você irá transferir toda a sua árvore raiz, de modo que inclua as pastas /boot e /home. Se você tiver partições separadas para essas, precisará considerá-las ao criar o contêiner.\n\nParticione o arquivo /media/Backup/backup.img executando sua ferramenta de particionamento favorita. Crie uma tabela de partição nela (por exemplo, msdos), escolha o esquema de partição e crie as partições.\n\nAgora carregue o módulo necessário e monte-o como um dispositivo de loopback, em /dev/loop5 (por exemplo):\n\n```\n# modprobe loop\n# losetup --partscan /dev/loop5 /media/Backup/backup.img\n```\n\nEm seguida, crie um sistema de arquivos nas partições, que aparecerá como /dev/loop5p1, /dev/loop5p2, etc.\n\n"
    },
    {
      "title": "Transfira o sistema",
      "level": 3,
      "content": "Monte o dispositivo de loopback e transfira o sistema:\n\n```\n# mkdir /mnt/Virtual\n# mount /dev/loop5p1 /mnt/Virtual\n# rsync -aAXv /* /mnt/Virtual --exclude={/dev/*,/proc/*,/sys/*,/tmp/*,/run/*,/mnt/*,/media/*,/lost+found,/home/*/.gvfs}\n```\n\n"
    },
    {
      "title": "Converta o contêiner para um formato compatível",
      "level": 3,
      "content": "Escolha o comando apropriado, dependendo da máquina virtual desejada.\n\nPara converter em um contêiner de KVM, use qemu-desktop com a seguinte linha de comando:\n\n```\n$ qemu-img convert -c -f raw -O qcow /media/backup.img /media/backup.qcow2\n```\n\nPara converter em um contêiner do VirtualBox, use o virtualbox com a seguinte linha de comando:\n\n```\n$ VBoxManage convertfromraw --format VDI /media/backup.img /media/backup.vdi\n```\n\nPara converter em um contêiner do VMware, use o virtualbox com a seguinte linha de comando:\n\n```\n$ VBoxManage convertfromraw --format VMDK /media/backup.img /media/backup.vmdk\n```\n\n"
    },
    {
      "title": "Entre em chroot e reinstale o gerenciador de boot",
      "level": 3,
      "content": "Conecte o contêiner à VM, juntamente com um LiveCD do Linux (por exemplo, o ISO do Arch Linux mais recente) no CD-ROM virtual da VM, em seguida, inicie a VM e faça chroot nela:\n\n```\n# mount /dev/sda1 /mnt\n# arch-chroot /mnt /bin/bash\n```\n\nReinstale o Syslinux ou o GRUB. Não esqueça de atualizar seu arquivo de configuração:\n\n- Para o Syslinux, deve ser APPEND root=/dev/sda1 ro no syslinux.cfg.\n\n- Para o GRUB, é recomendado que você gere de novo automaticamente um grub.cfg.\n\n"
    },
    {
      "title": "Ajuste o fstab",
      "level": 3,
      "content": "Como toda a sua árvore raiz foi transferida para uma única partição, edite o arquivo fstab. Você pode usar o UUID ou o rótulo, se quiser, mas eles são mais úteis em configurações de várias unidades e várias unidades (para evitar confusões). Por enquanto, /dev/sda1 para todo o seu sistema está ótimo.\n\n```\n/etc/fstab\n```\n\n```\ntmpfs                    /tmp      tmpfs     nodev,nosuid          0   0\n/dev/sda1                /         ext4      defaults,noatime      0   1\n```\n\n"
    },
    {
      "title": "Desabilite quaisquer arquivos relacionados ao Xorg",
      "level": 3,
      "content": "Ter uma entrada nvidia, nouveau, radeon, intel, etc. na seção Device de uma dos arquivos de configuração do Xorg evitará que ele seja iniciado, já que você estará usando hardware emulado (incluindo a placa de vídeo). Portanto, é recomendável mover/renomear ou excluir o seguinte:\n\n```\n# mv /etc/X11/xorg.conf /etc/X11/xorg.conf.bak\n# mv /etc/X11/xorg.conf.d/10-monitor /etc/X11/xorg.conf.d/10-monitor.bak\n```\n\n"
    },
    {
      "title": "Regenere a imagem initramfs",
      "level": 3,
      "content": "Como o hardware mudou, enquanto você ainda está no chroot, gere novamente a imagem do initramfs e faça um desligamento adequado:\n\n```\n# mkinitcpio -p linux\n# exit\n# umount -R /mnt\n# poweroff\n```\n\nPor fim, retire o LiveCD (o arquivo ISO), para que você não inicialize novamente nele e inicie a máquina virtual.\n\nAproveite o seu novo ambiente virtual.\n\n"
    },
    {
      "title": "\"mount: o dispositivo especial /dev/loop5p1 não existe\"",
      "level": 3,
      "content": "Use losetup --partscan, por exemplo:\n\n```\n# losetup --partscan /dev/loop5 /media/Backup/backup.img\n```\n\nIsso deve criar nós de dispositivo para cada partição que você criou dentro do dispositivo de loop.\n\n"
    },
    {
      "title": "\"Waiting 10 seconds for device /dev/sda1; ERROR: Unable to find root device '/dev/sda1'\"",
      "level": 3,
      "content": "```\nWaiting 10 seconds for device /dev/sda1 ...\nERROR: Unable to find root device '/dev/sda1'.\nYou are being dropped to a recovery shell\n    Type 'exit' to try and continue booting\nsh: cannot access tty; job control turned off\n[rootfs /]# _\n```\n\nIsso provavelmente significa que você não executou poweroff como você foi orientado e fechou a VM com o botão \"Fechar\", que é o equivalente a uma queda de energia. Agora você precisa gerar novamente sua imagem de initramfs. Para fazer isso, você pode iniciar a VM usando a entrada reserva. Se você não tiver uma entrada reserva, pressione Tab (para Syslinux) ou e (para GRUB) e renomeie-a para initramfs-linux-fallback.img. Depois de inicializar, abra um terminal e execute:\n\n```\n# mkinitcpio -p linux\n# poweroff\n```\n\n"
    },
    {
      "title": "\"Missing operating system. FATAL: INT18: BOOT FAILURE\"",
      "level": 3,
      "content": "- Você precisa instalar ou reinstalar um gerenciador de boot. Veja Processo de inicialização do Arch#Gerenciador de boot.\n\n- Você está usando um sistema de arquivos Btrfs com compressão para /boot, do qual o Syslinux atualmente não consegue inicializar.\n\n- A ordem de inicialização do BIOS ou das configurações da VM não está configurada corretamente. Certifique-se de que a unidade que contém o gerenciador de boot seja a primeira a ser inicializada.\n\n"
    },
    {
      "title": "Me pedem a senha do root, para manutenção",
      "level": 3,
      "content": "```\n:: Checking Filesystems                        [BUSY]\nfsck.ext4: Unable to resolve '...'\n```\n\nIsso significa que você esqueceu de adicionar o UUID da unidade, o rótulo ou o nome do dispositivo em /etc/fstab. O UUID é diferente toda vez que você o formata (ou, neste caso, cria um do zero), e eles provavelmente não coincidem. Verifique com blkid.\n\n"
    }
  ]
}