{
  "title": "MPlayer (Français)",
  "url": "https://wiki.archlinux.org/title/MPlayer_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles apparentés\n\n- mpv\n\nMPlayer est un lecteur de films populaire pour GNU/Linux. Il prend en charge la plupart des formats vidéo et audio et est donc très polyvalent, même s'il est surtout utilisé pour visionner des vidéos.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet mplayer. Une variante notable est mplayer-vaapiAUR[broken link: package not found] qui active la VA-API.\n\nCertains lecteurs vidéo peuvent utiliser MPlayer comme backend.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Les fichiers de configuration du système sont situés dans le répertoire /etc/mplayer/, tandis que les paramètres locaux de l'utilisateur sont stockés dans le répertoire ~/.mplayer/. Les fichiers par défaut dans le répertoire /etc/mplayer/ sont :\n\n- codecs.conf - Contient la configuration des codecs.\n- example.conf - Est un exemple de mplayer.conf, qui n'est pas automatiquement créé après l'installation.\n- input.conf - Contient la configuration d'un raccourci clavier.\n\nUn fichier config est créé par défaut dans le répertoire ~/.mplayer/.\n\nConsultez aussi : Exemple de fichier de configuration MPlayer, mplayer(1).\n\n"
    },
    {
      "title": "Raccourcis clavier",
      "level": 3,
      "content": "Les raccourcis clavier du système sont configurés via /etc/mplayer/input.conf. Les raccourcis clavier personnels sont stockés dans ~/.mplayer/input.conf. Pour une liste complète des raccourcis clavier, consultez le site mplayer(1).\n\nConsultez également : LQWiki:Symboles du clavier XF86.\n\n"
    },
    {
      "title": "Accélération vidéo matérielle",
      "level": 3,
      "content": "Consultez la page anglaise concernant l'accélération matérielle des vidéos.\n\n"
    },
    {
      "title": "Activation de VDPAU",
      "level": 4,
      "content": "Ajoutez les éléments suivants aux fichiers de configuration du système (/etc/mplayer/mplayer.conf) ou de l'utilisateur (~/.mplayer/config) :\n\n```\nvo=vdpau,\nvc=ffh264vdpau,ffmpeg12vdpau,ffodivxvdpau,ffwmv3vdpau,ffvc1vdpau,ffhevcvdpau\n```\n\n- Les virgules de fin sont importantes ! Elles indiquent à MPlayer de se rabattre sur d'autres pilotes et codecs si ceux spécifiés ne sont pas trouvés.\n- L'option -vo sélectionne le pilote de sortie vidéo VDPAU, l'option -vc sélectionne les codecs vidéo VDPAU.\n- Le codec ffodivxvdpau n'est pris en charge que par les séries les plus récentes de matériel NVIDIA. Pensez à l'omettre en fonction de votre matériel spécifique. Consultez Hardware video acceleration#NVIDIA pour plus d'informations.\n\n"
    },
    {
      "title": "Activer VA-API",
      "level": 4,
      "content": "Ceci nécessite mplayer-vaapiAUR[broken link: package not found].\n\n```\n$ mplayer -vo vaapi -va vaapi foobar.mpeg.\n```\n\n- -vo - Sélectionne le pilote de sortie vidéo vaapi\n- -va - Sélectionnez le pilote du décodeur vidéo vaapi\n\nLecteurs basés sur MPlayer :\n\n- gnome-mplayer : Pour activer l'accélération matérielle : Edit > Preferences > Player, puis définissez Video Output sur vaapi.\n- smplayer : Pour activer l'accélération matérielle : Options > Préférences > Général > Vidéo, puis définissez le pilote de sortie sur vaapi.\n\n"
    },
    {
      "title": "Vidéo translucide avec les cartes Radeon et Composite activé",
      "level": 3,
      "content": "Pour obtenir une sortie vidéo translucide sous X, vous devez activer la vidéo texturée dans MPlayer :\n\n```\n$ mplayer -vo xv:adaptor=1 file (fichier)\n```\n\nOu ajoutez la ligne suivante à ~/.mplayer/config :\n\n```\nvo=xv:adaptor=1\n```\n\nVous pouvez utiliser xvinfo pour vérifier les modes vidéo pris en charge par votre carte graphique.\n\n"
    },
    {
      "title": "Regarder une vidéo en streaming",
      "level": 3,
      "content": "Si vous voulez lire un flux vidéo (par exemple un lien ASX), utilisez :\n\n```\n$ mplayer -playlist link-to-stream.asx\n```\n\nL'option -playlist est nécessaire car ces flux sont en fait des listes de lecture et ne peuvent être lus sans elle.\n\n"
    },
    {
      "title": "Streaming DVB-T",
      "level": 4,
      "content": "Consultez DVB-T pour plus d'informations.\n\n"
    },
    {
      "title": "Lecture d'un DVD",
      "level": 3,
      "content": "Pour lire un DVD avec MPlayer :\n\n```\n$ mplayer dvd://N\n```\n\noù N est le numéro du titre souhaité. Commencez par 1 et remontez si vous n'êtes pas sûr. Pour commencer à un chapitre spécifique, utilisez l'option '-chapter'. Par exemple, en ajoutant '-chapter 5' à la commande, la lecture du DVD commence au chapitre 5 du titre.\n\nMplayer vérifie /dev/dvd par défaut. Dites-lui d'utiliser /dev/sr0 avec l'option dvd-device sur la ligne de commande, ou la variable dvd-device dans ~/.mplayer/config.\n\nPour lire un fichier image DVD :\n\n```\n$ mplayer -dvd-device movie.iso dvd:// N\n```\n\nPour activer le menu du DVD, utilisez :\n\n```\n$ mplayer dvdnav://\n```\n\nPour activer la prise en charge de la souris dans les menus de DVD, utilisez :\n\n```\n$ mplayer -mouse-movements dvdnav://\n```\n\nPour trouver la langue audio, lancez MPlayer avec le paramètre -v pour afficher les ID audio. Une piste audio est sélectionnée avec -aid audio_id. Définissez une langue audio par défaut en éditant ~/.mplayer/config et en ajoutant la ligne alang=en pour l'anglais.\n\nAvec MPlayer, le DVD pouvait être réglé sur un faible volume. Pour augmenter le volume maximal à 400 %, utilisez softvol=yes et softvol-max=400. Le volume de démarrage est par défaut égal à 100 % du volume du logiciel et les niveaux globaux du mixeur restent inchangés. En utilisant les touches 9 et 0, le volume peut être ajusté entre 0 et 400 %.\n\n```\nalang=fr\nsoftvol=yes\nsoftvol-max=400\n```\n\n"
    },
    {
      "title": "Prise en charge de JACK",
      "level": 3,
      "content": "Pour que la sortie audio de MPlayer soit dirigée vers JACK comme comportement par défaut, éditez ~/.mplayer/config et ajoutez :\n\n```\nao=jack\n```\n\nSi JACK n'est pas toujours en cours d'exécution, vous pouvez faire en sorte que la sortie de MPlayer soit dirigée vers JACK en fonction des besoins en invoquant MPlayer à partir de la ligne de commande comme suit\n\n```\n$ mplayer -ao jack path/to/file (chemin/vers/fichier)\n```\n\n"
    },
    {
      "title": "Sous-titres avancés",
      "level": 3,
      "content": "Pour que les sous-titres au format SubStation Alpha avancé (ass) ou SubStation Alpha (ssa) s'affichent correctement, vous devez modifier ~/.mplayer/config et ajouter :\n\n```\nass=true\n```\n\nou ajouter -ass à la ligne de commande :\n\n```\n$ mplayer -ass path/to/subtitledVideo.mkv.\n```\n\nUne indication possible de la nécessité d'activer cette option est que vous obtenez des nombres apparaissant avec vos sous-titres. Cela est dû au fait que les informations de positionnement sont interprétées comme quelque chose à afficher. Mplayer se plaindra également si les sous-titres sont trop longs ou comportent trop de lignes.\n\nL'activation de ass active également toutes les polices intégrées. Comme indiqué dans la note du manuel de mplayer, l'ajout de embeddedfonts=true n'est pas nécessaire si fontconfig est une version 2.4.2 ou plus récente. Fontconfig sera également utilisé pour sélectionner la police à utiliser lorsqu'il n'y a pas de polices intégrées. Cela peut entraîner l'utilisation d'une police différente de celle utilisée pour le rendu des sous-titres OSD.\n\n"
    },
    {
      "title": "Radio Internet",
      "level": 3,
      "content": "Voici un exemple de script pour un démarrage/arrêt facile de la lecture d'une station de radio prédéfinie. [1]\n\n```\n#!/bin/bash\nXX=\"X\"$1;\nPLAYIT='mplayer  -loop 0 -playlist http://*.*.*.*:8000/listen.pls';\n\nif [ \"$XX\" == \"Xstop\" ]; then\n  killall mplayer;\nelse\n  if [ 'EX' == 'EX'\"$(pidof mplayer)\" ]; then\n    if [ \"$UID\" -ne 0 ]; then\n      nohup $PLAYIT &> /dev/null & disown;\n    else\n      echo The \"root\" user is not allowed to run this script.\n    fi\n  else\n    echo mplayer is already running by user: $(ps -eo user,comm | grep -i \"mplayer\"$ | sed 's/ mplayer/,/m') | sed \"s/ ,$/./m\";\n  fi\nfi\n```\n\nPour plus de détails sur une instance de mplayer en cours d'exécution :\n\n```\n$ ps -eo pcpu,pid,user,comm | grep -i \"mplayer\"$ | sed \"s/ mplayer$//m\"\n```\n\n"
    },
    {
      "title": "Codecs binaires supplémentaires",
      "level": 3,
      "content": "Si vous devez lire des médias encodés avec les codecs cook, drvc ou sipr, vous pouvez installer le pack de codecs binaires \"essentiels\" avec le paquet codecs64AUR. Consultez http://www.mplayerhq.hu/design7/dload.html pour plus d'informations.\n\n"
    },
    {
      "title": "MPlayer ne parvient pas à ouvrir les fichiers contenant des espaces",
      "level": 3,
      "content": "MPlayer peut échouer à ouvrir un fichier contenant des espaces (par exemple 'The Movie') en disant qu'il n'a pas pu ouvrir le fichier file:///The%20Movie. (où tous les espaces sont convertis en %20). Ce problème peut être résolu en modifiant la ligne suivante dans /usr/share/applications/mplayer.desktop :\n\n```\nExec=mplayer %U\n```\n\nen :\n\n```\nExec=mplayer \"%F\"\n```\n\nSi vous utilisez un frontend/GUI pour MPlayer, entrez son nom dans Exec=gui_name \"%F\".\n\n"
    },
    {
      "title": "MPlayer a une police noire ou de couleur étrange pour l'OSD et les sous-titres",
      "level": 3,
      "content": "Il semble y avoir un problème avec les couleurs de l'OSD et des sous-titres lors de l'utilisation de la sortie vdpau, que mplayer peut utiliser par défaut. Vous pouvez contourner ce problème en utilisant xv à la place de vdpau :\n\nComme option de ligne de commande :\n\n```\nmplayer -vo xv\n```\n\nEn ajoutant la ligne suivante à votre fichier ~/.mplayer/config :\n\n```\nvo=xv\n```\n\nConsultez le fil de discussion original forums pour plus de détails.\n\n"
    },
    {
      "title": "SMPlayer : Pas de vidéo",
      "level": 3,
      "content": "SMPlayer peut avoir des difficultés à ouvrir certains MP4 (et probablement FLV). S'il ne lit que l'audio sans aucune vidéo, une solution possible est d'ajouter les lignes suivantes à votre fichier ~/.mplayer/config :\n\n```\n[extension.mp4]\ndemuxer=mov\n```\n\nSi le problème persiste, c'est que SMPlayer conserve les paramètres de ce fichier spécifique. La suppression des paramètres de tous les fichiers que SMPlayer conserve résoudra ce problème :\n\n```\n$ rm -rf ~/.config/smplayer/file_settings\n```\n\n"
    },
    {
      "title": "SMPlayer : échec de la reprise de la lecture après une pause",
      "level": 3,
      "content": "SMPlayer peut arrêter de lire une vidéo après l'avoir mise en pause si votre pilote de sortie audio est mal configuré. Vous pouvez résoudre ce problème en configurant spécifiquement votre pilote audio. Par exemple, si vous utilisez PulseAudio, cela peut être fait en démarrant MPlayer avec l'argument -ao pulse ou en ajoutant ce qui suit à votre fichier ~/.mplayer/config :\n\n```\nao=pulse\n```\n\nVous pouvez également modifier ce paramètre à partir de SMPlayer en allant dans Options > Préférences > Général > Audio et en définissant l'option Output Driver sur pulse.\n\n"
    },
    {
      "title": "SMPlayer : pas de vidéo lors de l'utilisation de la transparence sous GNOME",
      "level": 3,
      "content": "Ce problème peut survenir sous GNOME lorsque vous utilisez Compiz pour fournir de la transparence : SMPlayer démarre avec un écran transparent avec une lecture audio, mais pas de vidéo. Pour résoudre ce problème, créez (en tant que root) un fichier avec le contenu suivant :\n\n```\n/usr/local/bin/smplayer.helper\n```\n\n```\nexport XLIB_SKIP_ARGB_VISUALS=1\nexec smplayer.real \"$@\"\n```\n\nEnsuite, rendez-le exécutable puis faites-en un lien :\n\n```\n# ln -sf /usr/local/bin/smplayer.helper /usr/local/bin/smplayer\n```\n\n"
    },
    {
      "title": "SMPlayer : Police OSD trop grande / texte des sous-titres trop petit",
      "level": 3,
      "content": "Depuis SMPlayer 0.8.2.1 (avec MPlayer2 20121128-1), le rapport entre la police des sous-titres et celle de l'OSD est très étrange. Cela peut avoir pour conséquence que le texte OSD remplit tout l'écran alors que les sous-titres sont très petits et illisibles. Ce problème peut être résolu en ajoutant :\n\n```\n-subfont-osd-scale 2\n```\n\nou aux options supplémentaires passées à MPlayer par SMPlayer. Ces options se trouvent dans Options > Preferences > Advanced > Options for MPlayer. Ceci peut également être réalisé en ajoutant la ligne suivante à ~/.mplayer/config :\n\n```\nsubfont-osd-scale=2\n```\n\n"
    },
    {
      "title": "Mplayer affiche des points d'interrogation pour certains caractères dans les sous-titres",
      "level": 3,
      "content": "Si le codepage des sous-titres est utf8, essayez d'utiliser :\n\n```\n-subcp utf8\n```\n\nVous pouvez trouver la page de code des sous-titres avec :\n\n```\nfile subtitles.srt\n```\n\nConsultez https://www.linuxquestions.org/questions/slackware-14/mplayer-shows-question-marks-for-some-characters-on-subtitle-works-fine-on-xine-906077/.\n\n"
    },
    {
      "title": "Lecture hachée des CD audio",
      "level": 3,
      "content": "La lecture du CDDA peut être interrompue toutes les quelques secondes lorsque le CDROM fait tourner le CD. Pour contourner ce problème, vous devez mettre en cache ou en mémoire tampon à l'avance en utilisant l'option -cache :\n\n```\nmplayer cdda://:1 -cache 1024\n```\n\nL'option :1 permet de réduire la vitesse du CDROM pour une rotation constante et moins de bruit.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- FAQ MPlayer\n- Conseils sur MPlayer\n- Comment configurer MPlayer\n- playerctl : Un utilitaire en ligne de commande et une bibliothèque pour contrôler les lecteurs multimédias.\n\n"
    }
  ]
}