{
  "title": "Mpv (Español)",
  "url": "https://wiki.archlinux.org/title/Mpv_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artículos relacionados\n\n- MPlayer (Español)\n- youtube-dl (Español)\n\nNote: **2020-06-16** \n\nmpv es un reproductor multimedia basado en MPlayer y el ahora sin mantenimiento mplayer2. Soporta una gran variedad de formatos de video, codecs de audio y video, asi como subtítulos. Una lista, aunque incompleta, de las diferencias entre mpv y otros reproductores se puede encontrar aquí.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete mpv o la version de desarrollo mpv-gitAUR.\n\n"
    },
    {
      "title": "Interfaces gráficas",
      "level": 3,
      "content": "Vea una lista de aplicaciones basadas en mpv.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "mpv trae valores predeterminados que debieran funcionar correctamente en computadoras con tarjetas de video más viejas o débiles. Sin embargo, en computadoras con tarjetas de video más recientes mpv permite hacer una gran cantidad de configuraciones para lograr una mejor calidad de video, limitadas únicamente por la capacidad del componente. Esto requiere la creación de archivos de configuración que no vienen incluidos en la instalación por defecto.\n\nPara ayudarlo a comenzar mpv proporciona muestras de archivos de configuración con ajustes predeterminados. Cópielos para usarlos como punto de partida:\n\n```\n$ cp -r /usr/share/doc/mpv ~/.config/\n```\n\nmpv.conf contiene la mayoría de los ajustes de mpv, input.conf contiene los enlaces de tecla (key binding). Lea ambos para formar una idea de cómo funcionan y qué opciones están disponibles.\n\n"
    },
    {
      "title": "Ajustes generales",
      "level": 3,
      "content": "Añada los siguientes ajustes en ~/.config/mpv/mpv.conf.\n\n"
    },
    {
      "title": "Configuraciones de subtítulos",
      "level": 4,
      "content": "Habilite la búsqueda difusa:\n\n```\nsub-auto=fuzzy\n```\n\nCambie la fuente:\n\n```\nsub-font=\"Nombre_de_fuente\"\n```\n\nPonga en negrita los subtítulos para incrementar la legibilidad:\n\n```\nsub-bold=yes\n```\n\n"
    },
    {
      "title": "Configuraciones para calidad alta",
      "level": 4,
      "content": "Esto carga opciones de OpenGL de alta calidad al ser usado con vo=gpu como método de salida de video (valor por defecto). La mayoría de los usuarios puede hacerle funcionar sin problemas, pero no está activado por defecto para evitar causar problemas al grupo de usuarios que no les funciona:\n\n```\nprofile=gpu-hq\n```\n\nEl perfil gpu-hq utiliza por defecto el filtro de escala spline36 para velocidad y calidad media. Para obtener la mejor calidad en la salida de video, el manual dice que si el hardware puede hacerle funcionar, la opción ewa_lanczossharp es la aconsejada.\n\n```\nprofile=gpu-hq\nscale=ewa_lanczossharp\ncscale=ewa_lanczossharp\n```\n\nEstas últimas tres opciones son un poco más complicadas. La primera hace un remuestreo (resample) del audio si este se desincroniza con el video en vez de botar los cuadros (frames) ─un leve aumento en el tono del sonido es usualmente menos notorio que una caída en los cuadros─. La wiki de mpv tiene un artículo en profundidad al respecto titulado Display Synchronization. El resto de las opciones esencialmente vuelven más suave el movimiento en la pantalla cambiando la forma en que los cuadros son mostrados para que así los cuadros por segundo de la fuente se muevan mejor con la tasa de refresco de la pantalla ─no confundir con la técnica SVP que convierte los videos a 60 cuadros por segundo─. La wiki de mpv tiene un artículo en produndidad al respecto titulado Interpolation, aunque es comunmente conocido como smoothmotion.\n\n```\nprofile=gpu-hq\nscale=ewa_lanczossharp\ncscale=ewa_lanczossharp\nvideo-sync=display-resample\ninterpolation\ntscale=oversample\n```\n\nEl usuario puede realizar más ajustes que los ya mencionados, pero su dificultad aumenta, requiere tarjetas de video más potentes y están en constante desarrollo. Como breve visión general, es posible cargar shaders especiales que realicen técnicas de escala y afilado, incluyendo también las que usan redes neuronales profundas entrenadas con imagenes tanto de origen animado como fotográfico. La wiki de mpv abarca este tópico, en particular la sección user shader's.\n\nPara encontrar otras opciones de interés, se recomienda revisar mpv(1). También es recomendable ejecutar mpv desde la consola de comandos para revisar posibles errores ocacionados por la configuración.\n\n"
    },
    {
      "title": "Perfiles personalizados",
      "level": 4,
      "content": "En mpv.conf es posible crear perfiles que son esencialmente grupos de opciones con las que puede:\n\n- Rápidamente cambiar entre diferentes configuraciones sin tener que reescribir el archivo.\n- Crear perfiles especiales para contenido especial.\n- Anidar perfiles, de modo que se construyan perfiles complejos a partir de otros más simples.\n\nCrear un perfil es fácil. El área al comienzo de mpv.conf se llama nivel superior, cualquier opción escrita allí tendrá efecto una vez que mpv sea iniciado. Sin embargo, una vez se define un perfil escribiendo su nombre entre corchetes, toda opción debajo formará parte de este y será delimitado únicamente por el comienzo de otro perfil. A continuación un ejemplo de mpv.conf:\n\n```\nprofile=miperfil2         #Nivel superior, carga miperfil2\nontop=yes                 #Siempre sobre el resto\n\n[miperfil1]               #Un perfil simple, el nivel superior termina aquí\nprofile-desc=\"un perfil\"  #Descripción opcional del perfil\nfs=yes                    #Empezar a pantalla completa\n\n[miperfil2]               #Otro perfil simple\nprofile=gpu-hq            #Un perfil incorporado en mpv\nlog-file=~~/log           #Asigna una ubicación para escribir el registro, ~~/ se traduce a ~/.config/mpv\n```\n\nSólo hay dos lineas en el nivel superior y dos perfiles separados definidos debajo de este. Cuando mpv comienza, este lee la primera línea, carga las opciones en miperfil2 ─lo que significa que va a cargar las opciones en gpu-hq y log-file=~~/log)─ y termina de iniciarse. Note que miperfil1 nunca es cargado porque no es llamado en el nivel superior.\n\nAlternativamente se puede llamar a mpv desde la línea de comando con:\n\n```\n$ mpv --profile=miperfil1 video.mkv\n```\n\ny con ello ignoraría todas las opciones a excepción de las incluidas en miperfil1.\n\nCiertos tipos de perfiles serán automáticamente cargados en base a la extensión del archivo o el protocolo usado.\n\nEstos perfiles serán cargados para todos los archivos con una extensión emparejada (para todos los archivos .mkv y .gif respectivamente):\n\n```\n[extension.mkv]\nkeep-open\nvolume-max=150\n\n[extension.gif]\nosc=no\nloop-file\n```\n\nEste perfil será automáticamente cargado cuando cualquier transmisión http o https sea reproducida (e.g. mpv https://example.com/video.mp4):\n\n```\n[protocol.https]\nspeed=2\nkeep-open\n\n[protocol.http]\nprofile=protocol.https\n```\n\nEjecute mpv --list-protocols para ver los diferentes protocolos soportados por mpv.\n\n"
    },
    {
      "title": "Atajos de teclado",
      "level": 3,
      "content": "Los atajos de teclado son bastante directos dado los ejemplos en /usr/share/doc/mpv/input.conf y la sección relevante en el manual.\n\nAñada los siguientes ejemplos a ~/.config/mpv/input.conf:\n\n```\nshift+s         screenshot each-frame\nShift+UP        seek  600\nShift+DOWN      seek -600\n=               cycle video-unscaled\n-               cycle-values window-scale 2 3 1 .5\nWHEEL_UP        add volume 5\nWHEEL_DOWN      add volume -5\nWHEEL_LEFT      ignore\nWHEEL_RIGHT     ignore\nAlt+RIGHT       add video-rotate 90\nAlt+LEFT        add video-rotate -90\nAlt+-           add video-zoom -0.25\nAlt+=           add video-zoom 0.25\nAlt+j           add video-pan-x -0.05\nAlt+l           add video-pan-x 0.05\nAlt+i           add video-pan-y 0.05\nAlt+k           add video-pan-y -0.05\nAlt+BS          set video-zoom 0; set video-pan-x 0; set video-pan-y 0\n```\n\nPara intentar reproducir los atajos de teclado de MPC-HC en mpv, vea [1].\n\n"
    },
    {
      "title": "Archivos de configuración adicionales",
      "level": 3,
      "content": "También hay otros archivos y directorios de configuración que pueden ser creados, entre ellos se encuentran:\n\n- ~/.config/mpv/script-opts/osc.conf que administra los On Screen Controller (controles en pantalla).\n- ~/.config/mpv/scripts/script-name.lua para scripts Lua. Vea [2] para un ejemplo.\n\nVea mpv(1) § FILES para mayor información.\n\n"
    },
    {
      "title": "Scripts",
      "level": 2,
      "content": "El reproductor mpv tiene una una gran variedad de scripts que extienden su funcionalidad. Para este propósito, tiene ataduras (bindings) para Lua y JavaScript — añadido recientemente —.\n\nLos scripts son típicamente instalados poniendo archivos en el directorio ~/.config/mpv/scripts/ — puede necesitar crearlo primero — . Después de ello serán automáticamente cargados cuando mpv comience — este comportamiento puede ser alterado con otras opciones de mpv —. Algunos scripts vienen con su propia instalación e instrucciones de configuración, por lo que debe estar atento. Además, algunos scripts pueden estar viejos, quebrados y sin mantención.\n\n"
    },
    {
      "title": "JavaScript",
      "level": 3,
      "content": "JavaScript (ES5 via MuJS) tiene soporte como lenguaje script en mpv desde el año 2014. Actualmente pocos scripts se encuentran disponibles, pero existe documentación para los usuarios interesados en crear los propios.\n\nPara comenzar, ponga en el directorio scripts un script con extensión de archivo .js, e.g.:\n\n```\n~/.config/mpv/scripts/fullscreen-off-on-pause.js\n```\n\n```\nfunction onPauseChange (prop, enabled) {\n    if (enabled) {\n        mp.set_property('fullscreen', 'no')\n    }\n}\n\nmp.observe_property('pause', 'bool', onPauseChange)\n```\n\nPara mayores detalles, e.g. en el uso de require para cargar módulos CommonJS, vea la documentación.\n\nEl soporte de JavaScript se encuentra disponible en el paquete mpv, así como en algunos paquetes de AUR, e.g. mpv-fullAUR y mpv-full-gitAUR.\n\n"
    },
    {
      "title": "Lua",
      "level": 3,
      "content": "Hay muchos scripts en Lua interesantes para mpv. Si está interesado en crear uno propio, la documentación relevante puede encontrarse aquí.\n\n"
    },
    {
      "title": "mpv-stats",
      "level": 4,
      "content": "mpv-stats — o simplemente stats — es un script en Lua que tiene como salida muchos datos estadísticos en tiempo real mostrando el estado de funcionamiento de mpv. Es muy útil para asegurar que el hardware soporta las configuraciones hechas o para comparar entre varias. Desde la versión v0.28.0 el script se encuentra incluído en mpv y se puede alternar su encendido/apagado con las teclas i y I — configuración por defecto —.\n\n"
    },
    {
      "title": "mpv-webm",
      "level": 4,
      "content": "mpv-webm — o simplemente webm — es un script en Lua muy fácil de usar que permite crear archivos WebM mientras se miran videos. Incluye varias característica y no requiere dependencias adicionales — se basa en su totalidad en mpv —.\n\n"
    },
    {
      "title": "mpv-mpris",
      "level": 4,
      "content": "El complemento en C mpv-mpris permite a otras aplicaciones integrarse con mpv mediante el protocolo MPRIS. Por ejemplo, con mpv-mpris instalado, kdeconnect puede automáticamente pausar la reproducción de un video en mpv cuando haya una llamada telefónica entrante. Otro ejemplo son los botones — reproducir/pausar, entre otros — en dispositivos de audio conectados por bluetooth.\n\nInstale mpv-mpris y siga las instrucciones de postinstalación mostradas por Pacman.\n\n"
    },
    {
      "title": "Vapoursynth",
      "level": 2,
      "content": "Vapoursynth es una alternativa a AviSynth que puede ser utilizada en Linux y permite la manipulación de videos mediante scripts de python. Los scripts de python de Vapoursynth pueden ser usados como filtros de video para mpv.\n\nPara usar filtros de vapoursynth debe instalar el paquete vapoursynth (o vapoursynth-gitAUR) y compilar mpv con la bandera de construcción (build flag) --enable-vapoursynth.\n\nEsto es más fácil de hacer si primero se instala Vapoursynth y luego se instala ─o reinstala─ mpv-gitAUR. El script de configuración para mpv-gitAUR autodetectará Vapoursynth ─siempre que se encuentre instalado previamente─ y automaticamente compliará mpv con soporte para Vapoursynth sin tener que configurar manualmente ninguna opción ─lo que también vuelve muy fácil actualizar mpv─.\n\n"
    },
    {
      "title": "SVP 4 Linux (SmoothVideoProject)",
      "level": 3,
      "content": "SmoothVideoProject SVP es un programa conocido principalmente por convertir videos a 60 cuadros por segundo. Es gratuito [como la cerveza] y con todas las opciones disponibles para Linux de 64bit (cuesta dinero para Windows y OS X y es incompatible con Linux de 32bit).\n\nTiene tres características principales y cada una puede activarse/desactivarse a elección personal ─no se fuerza el uso de motion interpolation─.\n\n1. Motion interpolation (video de youtube) - Un algoritmo que convierte videos a 60 cuadros por segundo. Esto crea el controversial \"efecto telenovela\" (soap opera effect) que no le agrada a todas las personas. Desafortunadamente el algoritmo no es perfecto e introduce extraños artefactos (artifacts). El algoritmo puede ser afinado ─mediante un control deslizante─ para escoger entre rendimiento y calidad. También tiene ajustes de reducción de artefactos que interpolan los cuadros actuales con los generados, aminorando la percepción de los artefactos. La detección de los cuadros por segundo se puede establecer a modo manual o automático ─el modo manual parece resolver problemas de rendimiento a algunos usuarios─-\n1. Black bar lighting (video de youtube) - Si la imagen tiene una relación de aspecto que produce barras negras en la pantalla, entonces SVP iluminará las barras negras con \"luces\" generadas por el contenido en pantalla. Tiene un cierto grado de personalización, pero los valores por defecto están bastante cerca de lo óptimo.\n1. LED ambient lighting control (video de youtube) - Tiene la habilidad de controlar iluminación ambiental LED anexada al televisor.\n\nUna vez se tenga mpv compilado con el sopote a Vapoursynth es bastante simple hacer funcionar SVP en conjunto con mpv. Simplemente instale svp-binAUR, abra el programa SVP para dejarle evaluar el rendimiento del sistema ─se aconseja cerrar previamente otros programas para no afectar la precisión de la lectura─, y finalmente añada el siguiente perfil de mpv a mpv.conf[3]:\n\n```\nmpv.conf\n```\n\n```\n[svp]\ninput-ipc-server=/tmp/mpvsocket     # Recibe entrada (input) desde SVP\nhr-seek-framedrop=no                # Arregla desincronización de audio\nresume-playback=no                  # No es compatible con SVP\n\n# Puede arreglar el efecto tartamudez (stuttering) en algunos casos, en otros probablemente provocarlo. Inténtelo en caso de experimentarlo.\n#opengl-early-flush=yes\n```\n\nLuego, antes de abrir el respectivo archivo con mpv utilizando el perfil previamente indicado, el programa SVP debe estar ejecutándose en segundo plano para poder utilizar la función SVP. Para el uso en mpv puede hacer:\n\n```\n$ mpv --profile=svp video.mkv\n```\n\no establecer profile=svp en el nivel superior de la configuración de mpv.P\n\nPara utilizar decodificación por hardware debe emplear un decodificador copy-back, pues los decodificadores normales no son compatibles con Vapoursynth ─escoja una opción hwdec que termine en -copy─. Por ejemplo:\n\n```\nhwdec=auto-copy\nhwdec-codecs=all\n```\n\nDe todos modos, la decodificación por hardware no es aconsejada por los desarrolladores de mpv y es probable que no genere una diferencia significativa en el rendimiento.\n\n"
    },
    {
      "title": "Aceleración de video por hardware",
      "level": 4,
      "content": "Vea Hardware video acceleration.\n\nLa decodificación de video acelerada por hardware está disponible mediante la opción --hwdec=API. Para un listado de todas las APIs soportadas y otras opciones requeridas vea la sección relevante del manual.\n\nPara Wayland (Español) utilice la opción --gpu-context=wayland. Para un listado de otras APIs de GPU disponibles vea el manual.\n\n"
    },
    {
      "title": "Cambiar rápidamente entre relaciones de aspecto",
      "level": 4,
      "content": "Puede cambiar entre distintas relaciones de aspecto utilizando Shift+a.\n\n"
    },
    {
      "title": "Ignorando relaciones de aspecto",
      "level": 4,
      "content": "Puede ignorar relaciones de aspecto utilizando --keepaspect=no. Para volverlo permanente añada la línea keepaspect=no al archivo de configuraciones.\n\n"
    },
    {
      "title": "Dibujar a la ventana raíz",
      "level": 4,
      "content": "Ejecute mpv con --wid=0. mpv dibujará a la ventana con un ID de número 0.\n\n"
    },
    {
      "title": "Siempre mostrar la ventana de la aplicación",
      "level": 4,
      "content": "Para mostrar la ventana de la aplicación, incluso para archivos de audios cuando son ejecutados desde la línea de órdenes, utilice la opción --force-window. Para volver la opción permanente añada la línea force-window=yes al archivo de configuración.\n\n"
    },
    {
      "title": "Desactivar la salida de video",
      "level": 4,
      "content": "Para desactivar la salida de video cuando se ejecuta desde la línea de órdenes utilice la opción --vid=no, o su alias --no-video.\n\n"
    },
    {
      "title": "El volumen está muy bajo",
      "level": 4,
      "content": "Escriba volume-max=value en su archivo de configuración con una cantidad razonable, como volume-max=150, que le permitirá aumentar el volumen hasta en un 150% ─lo que es el doble de ruidoso─. Aumentar demasiado el volumen provocará artefactos de recorte (clipping artefacts). Adicionalmente ─o de forma alternativa─ puede utilizar dynamic range compression con af=acompressor.\n\n"
    },
    {
      "title": "Mejorando mpv como reproductor de música con scripts en Lua",
      "level": 4,
      "content": "El desarrollo de scripts en Lua de mpv está documentado en DOCS/man/lua.rst y se muestra ejemplos en TOOLS/lua sobre el repositorio de mpv. Esta publicación de blog introduce el script music.lua que muestra cómo scripts en Lua pueden ser utilizados para mejorar mpv como reproductor de música.\n\n"
    },
    {
      "title": "Guardar la posición al salir",
      "level": 3,
      "content": "Puede guardar la posición y cerrar el programa con la combinación de teclas Shift+q. Esta puede ser cambiada estableciendo quit_watch_later en el archivo de configuración de atajos de teclado.\n\nPara guardar automáticamente la posición de reproducción actual al momento de cerrar el programa, inicie mpv con --save-position-on-quit, o añada save-position-on-quit al archivo de configuraciones.\n\n"
    },
    {
      "title": "Reproducir un DVD",
      "level": 3,
      "content": "El reproductor mpv no soporta menús de DVD. Para reproducir el stream principal con el título más largo de un vídeo de DVD, use la orden:\n\n```\n$ mpv dvd://\n```\n\nUn especificador de título opcional es un número, comenzando desde el 0, que selecciona entre streams separados de video en el DVD:\n\n```\n$ mpv dvd://[título]\n```\n\nUn DVD que ha sido copiado a un sistema de archivos local ─con una herramiento como dvdbackup─ es acomodada especificando la ruta a la copia local: --dvd-device=PATH.\n\nDVDs which have been copied on to a local file system (by e.g. the dvdbackup tool) are accommodated by specifying the path to the local copy: --dvd-device=PATH.\n\nVea el siguiente ejemplo de desktop file para reproducir DVDs desde un sistema de archivos local:\n\n```\n[Desktop Entry]\nType=Application\nName=mpv Media Player DVD\nGenericName=Multimedia player\nComment=Play movies and songs\nIcon=mpv\nExec=mpv dvd:// --player-operation-mode=pseudo-gui --force-window --idle --dvd-device=%f\nTerminal=false\nCategories=AudioVideo;Audio;Video;Player;TV;\n# (MimeType and X-KDE-Protocols omitted, see orginianl mpv.desktop file)\n```\n\nReemplazando la línea Exec con\n\n```\nExec=mpv dvd://0 dvd://1 dvd://2 dvd://3 dvd://4 dvd://5 dvd://6 dvd://7 dvd://8 dvd://9 --player-operation-mode=pseudo-gui --force-window --idle --dvd-device=%f\n```\n\nel reproductor mpv pondrá en cola los títulos desde el 0 al 9 en una lista de reproducción, lo que permite reproducir los títulos consecutivamente o saltar entre ellos desde la interfaz gráfica de mpv.\n\nInstale libdvdcss para solucionar el error:\n\n```\n[dvdnav] Error getting next block from DVD 1 (Error reading from DVD.)\n```\n\n"
    },
    {
      "title": "Restaurar un OSC antiguo",
      "level": 3,
      "content": "Desde la versión 0.21.0, mpv ha reemplazado los controles en pantalla por una barra al fondo. Si desea restaurar los controles en pantalla, puede editar las configuraciones de mpv como se describe aquí.\n\n"
    },
    {
      "title": "Capturas de pantalla reproducibles",
      "level": 3,
      "content": "La opción de plantilla de capturas puede incluir el código de tiempo preciso (HH:MM:SS.mmm) del marco capturado. El nombre del archivo hace fácil saber el origen de la captura de pantalla. Se establece así:\n\n```\n~/.config/mpv/mpv.conf\n```\n\n```\nscreenshot-template=\"%F - [%P]v%#01n\"\n```\n\nEsto se expande a nombre_de_archivo - [HH:MM:SS.mmm]vnúmero.jpg. Ejemplo del resultado:\n\n```\nGunsmith Cats/\n├── Gunsmith Cats - 01 - [00:00:50.217]v1.jpg\n├── Gunsmith Cats - 01 - [00:22:55.874]v1.jpg\n├── Gunsmith Cats - 02 - [00:12:09.729]v1.jpg\n├── Gunsmith Cats - 02 - [00:12:09.729]v2.jpg\n├── Gunsmith Cats - 02 - [00:15:05.778]v1.jpg\n└── Gunsmith Cats - 03 - [00:03:20.001]v1.jpg\n```\n\nUn bonus es que se ordena bien ya que alfabéticamente el código de tiempo es ordenado en el número del episodio.\n\nVea mpv(1) § screenshot-template para más información.\n\n"
    },
    {
      "title": "Crear una única captura de pantalla",
      "level": 3,
      "content": "Un ejemplo de creación de una única captura de pantalla en un tiempo dado (HH:MM:SS):\n\n```\n$ mpv --no-audio --start=00:01:30 --frames=1 /path/to/video/file --o=/ruta/a/la/captura_de_pantalla.png\n```\n\nLas capturas de pantallas serán guardadas en /ruta/a/la/captura_de_pantalla.png\n\n"
    },
    {
      "title": "Ver transmisiones de Twitch.tv mediante mpv",
      "level": 4,
      "content": "Si youtube-dl se encuentra instalado, entoncesmpv puede abrir directamente un livestream de Twitch.\n\nVéase también Streamlink#Twitch.\n\nOtra alternativa basada en Livestreamer es este script en Lua: https://gist.github.com/ChrisK2/8701184fe3ea7701c9cc\n\n"
    },
    {
      "title": "youtube-dl y escogiendo formatos",
      "level": 4,
      "content": "El --ytdl-format predeterminado es bestvideo+bestaudio/best. Para videos de youtube que tienen resoluciones 4k disponibles esto significa que su dispositivo trabajará más de lo habitual decodificando 4k en VP9, incluso cuando el monitor conectado tenga una resolución inferior.\n\nAjustando el selector de formato adecuado en youtube-dl puede arreglar esto de forma simple. En la siguiente configuración de ejemplo sólo los videos con una resolución vertical menor o igual a 1080 pixeles serán considerada.\n\n```\nytdl-format=\"bestvideo[height<=?1080]+bestaudio/best\"\n```\n\nPuede añadir lo siguiente al selector de formato si desdea evitar por completo cierto códec al no poder decodificarlo mediante hardware. En el siguiente ejemplo adicionalmente escogeremos ignorar por completo VP9:\n\n```\nytdl-format=\"bestvideo[height<=?1080][vcodec!=vp9]+bestaudio/best\"\n```\n\nUtilice lo siguiente si prefiere obtener la mejor calidad con códecs de código abierto (VP9 y Opus):\n\n```\nytdl-format=\"((bestvideo[vcodec^=vp9]/bestvideo)+(bestaudio[acodec=opus]/bestaudio[acodec=vorbis]/bestaudio[acodec=aac]/bestaudio))/best\"\n```\n\n"
    },
    {
      "title": "Audio en youtube-dl con búsqueda",
      "level": 4,
      "content": "Para encontrar un stream de audio desde un emulador de terminal con la órden yta search terms ponga la siguiente función en su .bashrc:\n\n```\nfunction yta() {\n    mpv --ytdl-format=bestaudio ytdl://ytsearch:\"$*\"\n}\n```\n\n"
    },
    {
      "title": "Usar un plugin de navegador",
      "level": 4,
      "content": "Con la ayuda de mozpluggerAUR, mpv puede utilizarse en un navegador soportado para reproducir videos. Vea Browser plugins#MozPlugger para detalles de configuración. Esto en tándem con un script como ViewTube, permite usar mpv en lugar del reproductor de video integrado en el sitio.\n\nPuede ser necesario especificar un agente de usuario (user agent) para streaming por HTTP, e.g. user-agent=\"Mozilla/5.0 (X11; Linux x86_64; rv:49.0) Gecko/20100101 Firefox/49.0\".\n\nBrowser plugins#Multimedia playback muestra otras formas más fáciles para reproducir videos.\n\n"
    },
    {
      "title": "Depuración general",
      "level": 3,
      "content": "Para la solución de problemas en la reproducción de mpv ─o su total mal funcionamiento─ hay tres primeros pasos que debiera seguir:\n\n1. Ejecutar mpv desde la línea de órdenes ─la bandera -v incrementa el detalle desplegado─. Si tiene suerte encontrará un mensaje de error indicándole el problema.$ mpv -v video.mkv\n1. Haga que mpv cree un archivo de registro. Podrá resultar dificultoso tamizarlo, pero si algo está quebrado lo encontrará allí.$ mpv -v --log-file=./log video.mkv\n1. Ejecute mpv sin configuraciones. Si el programa funciona correctamente, entonces allí radica el problema ─es posible que su hardware no pueda manejar los ajustes seleccionados─.$ mpv --no-config video.mkv\n\nUn cuarto paso que puede intentar, si lo anterior no surte efecto, es instalar el script mpv-stats y utilizarlo para ver exactamente cómo está funcionando mpv.\n\n"
    },
    {
      "title": "Arreglar reproducción desigual y desgarro",
      "level": 3,
      "content": "De forma predeterminada, mpv utiliza la configuración de dispositivo de salida de video OpenGL en hardware que lo soporta. Por ejemplo, cuando se intenta reproducir videos en un monitor de resolución 4k utilizando una tarjeta Intel de la serie HD4XXX o similar, utilizar cualquier configuración con una salida OpenGL volverá la reproducción de video poco fidedigna al punto en que se detiene en su totalidad de a momentos y presenta desgarros mayores. Para resolver este comportamiento, utilizar el dispositivo de salida de video XV ─solamente para Xorg (Español)─ puede ayudar:\n\n```\n~/.config/mpv/mpv/conf\n```\n\n```\nvo=xv\n```\n\nEs posible incrementar aún más el rendimiento ─especialmente en hardware con menor potencia─, pero esto conlleva a una reducción drástica de la calidad en la mayoría de los casos.\n\nLa siguiente opción puede ser considerada para incrementar el rendimiento de la reproducción de video:\n\n```\n~/.config/mpv/mpv.conf\n```\n\n```\nvd-lavc-fast\nvd-lavc-skiploopfilter=<skipvalue>\nvd-lavc-skipframe=<skipvalue>\nvd-lavc-framedrop=<skipvalue>\nvd-lavc-threads=<threads>\n```\n\n"
    },
    {
      "title": "Problemas con compositores de ventanas",
      "level": 3,
      "content": "Tal como es descrito en mpv(1) § Window, mpv por defecto deshabilita cualquier compositor de ventanas activo mientras está en modo de pantalla completa. Esto se hace para prevenir potenciales problemas de rendimiento durante la reproducción.\n\nPara compositores tales como KWin o Mutter, puede resultar ventajoso el desactivar la composición de ventanas aun cuando se esté en modo de ventana. Esto puede lograrse estableciendo la opción x11-bypass-compositor=yes.\n\nHay dos desventajas al deshabilitar composición:\n\n- Rehabilitar la composición puede introducir entrecortadas por un periodo de tiempo, particularmente si se usa KWin.\n- Cualquier efecto provisto por composición estará temporariamente no disponible (hasta que mpv lo rehabilite), lo cual en Plasma evita que el cambiador de aplicaciones por defecto funcione.\n\nPara evitar estos problemas, puede intentar mantener su compositor habilitado con x11-bypass-compositor=no.\n\n"
    },
    {
      "title": "No hay barra de volumen, no se puede modificar el volumen",
      "level": 3,
      "content": "Haga girar la rueda del ratón sobre el ícono del volumen.\n\n"
    },
    {
      "title": "Pantalla blanca en GNOME (Wayland)",
      "level": 3,
      "content": "Es posible que mpv no pueda suspender los ajustes de ahorro de energía de GNOME si utilizar Wayland hace que el salvador de pantalla apaque el monitor durante una reproducción de video. Un método para evitar esto consiste en añadir gnome-session-inhibit al inicio de la línea Exec= en mpv.desktop.\n\n"
    },
    {
      "title": "El tema del cursor no es respetado en GNOME Wayland",
      "level": 3,
      "content": "En Wayland, los clientes pueden mostrar distintos temas de cursores porque no hay un único archivo de configuración para aquello. Para el tema del cursor, las apliaciones Qt usualmente aceptar el valor que está establecido para la variable de entorno XCURSOR_THEME. No obstante, en el caso específico de mpv, el tema del cursor que se muestra necesita ser establecido en ~/.icons/default/index.theme. Como GNOME no actualiza este archivo cuando el tema del cursor es cambiado desde GNOME Tweaks, lo deberá hacer manualmente. Vea Cursor themes (Español)#Especificación XDG para mayor información.\n\n"
    },
    {
      "title": "Mensaje de error sobre librerías CUDA faltantes en GPUs AMD",
      "level": 3,
      "content": "Mientras se usa aceleración de hardware VAAPI en GPUs AMD en las versiones v0.34.1 o más antiguas, quizás se vea persistentemente un error que diga Cannot load libcuda.so.1. Esto puede ser suprimido estableciendo gpu-hwdec-interop=vaapi.\n\nReportes de defectos relacionados: Github issue #9691, Github issue #8765\n\nEste problema fue arreglado upstream en pull request #9842.\n\n"
    },
    {
      "title": "Incapacidad de reproducir audio si PipeWire está enmascarado",
      "level": 3,
      "content": "Si mpv se crashea o no puede reproducir audio en sistemas donde PipeWire está emascarado, sin reportar salidas o una tubería rota, establezca la opción --ao para emparejar su entorno. Establézcala en mpv.conf para que sea persistente.\n\n"
    }
  ]
}