{
  "title": "Mpv (Русский)",
  "url": "https://wiki.archlinux.org/title/Mpv_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- MPlayer (Русский)\n- youtube-dl\n\nmpv — мультимедийный плеер, основанный на MPlayer и ныне неподдерживаемом mplayer2. Плеер поддерживает обширный набор видеоформатов, аудио- и видеокодеков и форматов субтитров. Всеобъемлющий (однако не исчерпывающий) список различий между mpv и вышеупомянутыми плеерами доступен здесь.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет mpv из официальных репозиториев или mpv-gitAUR из AUR.\n\n"
    },
    {
      "title": "Графические оболочки",
      "level": 3,
      "content": "Смотрите List of applications/Multimedia#mpv-based.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "mpv поставляется с хорошими универсальными настройками по умолчанию, которые должны хорошо работать на компьютерах со слабыми/старыми видеокартами. Однако если у вас компьютер с более современной видеокартой, то mpv позволяет вам сделать много настроек для достижения лучшего качества видео (ограниченного только мощностью вашей видеокарты). Для этого нужно создать несколько конфигурационных файлов (по умолчанию они не существуют).\n\nЧтобы помочь вам начать работу, mpv предоставляет примеры конфигурационных файлов с настройками по умолчанию. Скопируйте их, чтобы использовать в качестве отправной точки:\n\n```\n$ cp -r /usr/share/doc/mpv/ ~/.config/\n```\n\nОсновные настройки mpv находятся в файле mpv.conf, сочетания клавиш — в input.conf. Полистайте оба файла, чтобы получить представление о том, как они работают и какие варианты доступны.\n\n"
    },
    {
      "title": "Основные настройки",
      "level": 3,
      "content": "Добавляются в файл ~/.config/mpv/mpv.conf.\n\n"
    },
    {
      "title": "Настройка субтитров",
      "level": 4,
      "content": "Включить нечёткий поиск:\n\n```\nsub-auto=fuzzy\n```\n\nСделать субтитры полужирными для повышения читабельности:\n\n```\nsub-bold=yes\n```\n\n"
    },
    {
      "title": "Настройки для более высокого качества",
      "level": 4,
      "content": "Это загружает опции OpenGL высокого качества при использовании vo=gpu в качестве видеовыхода (по умолчанию). У большинства пользователей они работают без проблем, но они не включены по умолчанию, чтобы не создавать проблем для тех немногих пользователей, у которых они не работают:\n\n```\nprofile=gpu-hq\n```\n\nПрофиль gpu-hq по умолчанию использует фильтр масштабирования spline36 для среднего качества и скорости. Для получения видео наилучшего качества в руководстве указано, что стоит использовать ewa_lanczossharp, если ваше оборудование может работать с ним.\n\n```\nprofile=gpu-hq\nscale=ewa_lanczossharp\ncscale=ewa_lanczossharp\n```\n\nПоследние три опции немного сложнее. Первая опция делает так, что если аудио и видео рассинхронизируются, то вместо того, чтобы отбрасывать кадры видео, он передискретизирует аудио (небольшое изменение высоты звука часто менее заметно, чем отброшенные кадры). В mpv wiki есть подробная статья об этом под названием Display Synchronization. Оставшиеся две опции, по сути, делают движение более плавным на вашем дисплее, изменяя способ отображения кадров так, чтобы частота кадров источника лучше сочеталась с частотой обновления вашего дисплея (не путать с техникой SVP, которая фактически преобразует видео в 60 кадров в секунду). В mpv wiki есть подробная статья об этом под названием Interpolation, хотя она также широко известна как smoothmotion.\n\n```\nprofile=gpu-hq\nscale=ewa_lanczossharp\ncscale=ewa_lanczossharp\nvideo-sync=display-resample\ninterpolation\ntscale=oversample\n```\n\nПосле этого можно сделать ещё много чего, но всё становится сложнее, требует более мощных видеокарт и находится в постоянном развитии. В качестве краткого обзора можно загрузить специальные шейдеры, которые выполняют экзотические техники масштабирования и повышения резкости, включая некоторые, которые используют глубинные нейронные сети, обученные на изображениях (как для реального мира, так и для анимированного контента). Чтобы узнать больше об этом, загляните в mpv wiki, особенно в раздел пользовательских шейдеров.\n\nСуществует также множество других вариантов, которые могут оказаться полезны. Стоит взглянуть на mpv(1). Также полезно запустить mpv из командной строки, чтобы проверить сообщения об ошибках в конфигурации.\n\n"
    },
    {
      "title": "Пользовательские профили",
      "level": 4,
      "content": "Можно создавать профили, которые по сути являются просто «группами опций», с помощью которых вы можете:\n\n- Быстро переключаться между различными конфигурациями без необходимости переписывать файл.\n- Создавать специальные профили для специального содержимого.\n- объединять профили, чтобы из более простых профилей можно было создавать более сложные.\n\nСоздать профиль очень просто. Область в верхней части файла mpv.conf называется верхним уровнем (top level), и все опции, которые вы туда запишете, вступят в силу после запуска mpv. Однако, как только вы определите профиль, написав его имя в квадратных скобках, все опции, которые вы напишете ниже него (пока вы не определите новый профиль), будут считаться частью этого профиля. Пример:\n\n```\nprofile=myprofile2        #Верхний уровень, загрузка профиля myprofile2\nontop=yes                 #Поверх всех окон\n\n[myprofile1]              #Простой профиль, верхний уровень заканчивается здесь\nprofile-desc=\"a profile\"  #Опциональное описание профиля\nfs=yes                    #Запуск в полноэкранном режиме\n\n[myprofile2]              #Другой простой профиль\nprofile=gpu-hq            #Загрузка встроенного в mpv профиля\nlog-file=~~/log           #Куда записывать журналы, ~~/ преобразуется ~/.config/mpv\n```\n\nВ области верхнего уровня есть только две строки, а под ними определены два отдельных профиля. Когда mpv запускается, он видит первую строку, загружает опции из профиля myprofile2 (что означает, что он загружает опции из профиля gpu-hq и опцию log-file=~~/log), после этого он загружает опцию ontop=yes и завершает запуск. Обратите внимание, что myprofile1 никогда не загружается, потому что он никогда не вызывается в области верхнего уровня.\n\nМожно выбрать используемый профиль, запустив mpv из командной строки с опцией:\n\n```\n$ mpv --profile=myprofile1 video.mkv\n```\n\nи он будет игнорировать все опции, кроме описанных в профиле myprofile1.\n\n"
    },
    {
      "title": "Сочетания клавиш",
      "level": 3,
      "content": "Сочетания клавиш задаются просто; смотрите примеры в /usr/share/doc/mpv/input.conf и соответствующий раздел в руководстве.\n\nДобавьте следующие примеры в ~/.config/mpv/input.conf:\n\n```\nshift+s         screenshot each-frame\nShift+UP        seek  600\nShift+DOWN      seek -600\n=               cycle video-unscaled\n-               cycle-values window-scale 2 3 1 .5\nWHEEL_UP        add volume 5\nWHEEL_DOWN      add volume -5\nWHEEL_LEFT      ignore\nWHEEL_RIGHT     ignore\nAlt+RIGHT       add video-rotate 90\nAlt+LEFT        add video-rotate -90\nAlt+-           add video-zoom -0.25\nAlt+=           add video-zoom 0.25\nAlt+j           add video-pan-x -0.05\nAlt+l           add video-pan-x 0.05\nAlt+i           add video-pan-y 0.05\nAlt+k           add video-pan-y -0.05\nAlt+BS          set video-zoom 0; set video-pan-x 0; set video-pan-y 0\n```\n\nЧтобы попытаться повторить сочетания клавиш из MPC-HC в mpv, смотрите [1].\n\n"
    },
    {
      "title": "Дополнительные файлы конфигурации",
      "level": 3,
      "content": "Кроме того, можно создать ещё несколько конфигурационных файлов и каталогов, среди которых:\n\n- ~/.config/mpv/script-opts/osc.conf управляет наэкранным меню (On Screen Controller).\n- ~/.config/mpv/scripts/имя-скрипта.lua для скриптов Lua. Пример можно посмотреть здесь.\n\nСмотрите https://mpv.io/manual/master/#files для более подробной информации.\n\n"
    },
    {
      "title": "Скрипты",
      "level": 2,
      "content": "mpv поддерживает большое количество скриптов, которые расширяют его функциональность. В нем даже есть внутренние сочетания клавиш для Lua и Javascript (добавленные недавно).\n\nЧтобы установить скрипты, поместите их в папку ~/.config/mpv/scripts/ (возможно, ее нужно будет сначала создать), после чего они будут автоматически загружены при запуске mpv (это поведение может быть изменено в настройках). Некоторые скрипты поставляются со своими собственными инструкциями по установке и настройке, обращайте на это внимание. Какие-то скрипты могут быть старыми, сломанными или уже не поддерживаться.\n\n"
    },
    {
      "title": "JavaScript",
      "level": 3,
      "content": "JavaScript (ES5 через MuJS) поддерживается в качестве языка скриптов mpv с 2014 года. В связи с тем, что поддержка Javascript появилась относительно недавно, скриптов еще не очень много, но существует документация для всех, кто заинтересован создать свой.\n\nЧтобы начать работу, поместите скрипт с расширением .js в каталог scripts, например:\n\n```\n~/.config/mpv/scripts/fullscreen-off-on-pause.js\n```\n\n```\nfunction onPauseChange (prop, enabled) {\n    if (enabled) {\n        mp.set_property('fullscreen', 'no')\n    }\n}\n\nmp.observe_property('pause', 'bool', onPauseChange)\n```\n\nПодробности, например об использовании require для загрузки модулей CommonJS, можно почитать в документации.\n\nПоддержка JavaScript есть как в пакете mpv, так и в некоторых пакетах из AUR, например mpv-fullAUR и mpv-full-gitAUR.\n\n"
    },
    {
      "title": "Lua",
      "level": 3,
      "content": "Скриптов на Lua для mpv достаточно много. Если хотите написать свой, соответствующая документация может быть найдена здесь. Также есть примеры в TOOLS/lua.\n\n"
    },
    {
      "title": "mpv-ytdlAutoFormat",
      "level": 4,
      "content": "mpv-ytdlautoformat — это Lua-скрипт для автоматического изменения ytdl-format для Youtube, Twitch или выбранных вами доменов на 480p или другое качество по вашему выбору.\n\n"
    },
    {
      "title": "mpv-stats",
      "level": 4,
      "content": "mpv-stats (или просто stats) это Lua-скрипт, который выводит большое количество текущей статистики, показывающей состояние работы mpv в момент воспроизведения. Он очень полезен, чтобы убедиться, что ваше оборудование справляется с настройками, и для сравнения различных конфигураций. С версии v0.28.0 скрипт встроен в mpv и доступен по нажатию клавиши i или I (по умолчанию).\n\n"
    },
    {
      "title": "mpv-webm",
      "level": 4,
      "content": "mpv-webm (или просто webm) это очень простой в использовании Lua-скрипт, который позволяет создавать webm ролики во время просмотра видео. Он многофункционален и не имеет никаких дополнительных зависимостей (полностью полагается на mpv).\n\n"
    },
    {
      "title": "mpv-mpris",
      "level": 4,
      "content": "Плагин mpv-mpris позволяет другим приложениям интегрироваться с mpv через протокол MPRIS. Например, с установленным mpv-mpris kdeconnect может автоматически приостанавливать воспроизведение видео в mpv при поступлении телефонного звонка. Другой пример — кнопки (воспроизведение/пауза и т.д.) на аудиоустройствах bluetooth.\n\nДля использования плагина установите пакет mpv-mpris.\n\n"
    },
    {
      "title": "Vapoursynth",
      "level": 2,
      "content": "Vapoursynth — это альтернатива AviSynth, которая может быть использована в Linux и позволяет манипулировать видео с помощью скриптов python. Python-скрипты Vapoursynth могут быть использованы в качестве видеофильтров для mpv.\n\nЧтобы использовать фильтры vapoursynth, установите пакет vapoursynth (или vapoursynth-gitAUR) и скомпилируйте mpv с флагом сборки --enable-vapoursynth.\n\nЭто проще сделать, сначала установив Vapoursynth, а затем установив (или переустановив, если он уже установлен) mpv-gitAUR. Конфигурационный скрипт для mpv-gitAUR автоматически определит Vapoursynth (если он уже установлен) и скомпилирует mpv с поддержкой Vapoursynth без необходимости вручную изменять какие-либо настройки (это также упрощает обновление mpv).\n\n"
    },
    {
      "title": "SVP 4 Linux (SmoothVideoProject)",
      "level": 3,
      "content": "SmoothVideoProject SVP — это программа, которая в первую очередь известна тем, что конвертирует видео в 60 кадров в секунду. Она бесплатная (но не свободная) и полнофункциональная для 64-разрядного Linux (версии для Windows и OS X платные, 32-разрядный Linux не поддерживается).\n\nУ неё есть три основные функции, и каждую из них можно отключить/включить по своему усмотрению.\n\n1. Интерполяция движения (видео на youtube) — алгоритм, который преобразует видео в 60 кадров в секунду. Это создает несколько спорный «эффект мыльной оперы», который одни любят, а другие ненавидят. К сожалению, алгоритм не идеален и иногда вносит странные артефакты. Алгоритм можно настроить (с помощью ползунка) как на производительность, так и на качество. Также есть настройки уменьшения артефактов, которые интерполируют реальные кадры с генерируемыми кадрами, уменьшая заметность артефактов. Определение частоты кадров можно установить в автоматическом или ручном режиме (ручной режим, похоже, решает проблемы производительности для некоторых пользователей).\n1. Подсветка чёрных полос (видео на youtube) — если изображение имеет соотношение сторон, которое приводит к появлению чёрных полос на вашем экране, то SVP подсветит чёрные полосы «светом», генерируемым на основе содержимого экрана. Эта функция имеет настройки, но значения по умолчанию довольно близки к оптимальным.\n1. Управление LED-подсветкой (видео на youtube) — Возможность управления светодиодной подсветкой, подключенной к телевизору.\n\nПосле компиляции mpv с поддержкой Vapoursynth установите svp-binAUR, откройте программу SVP, чтобы она оценила производительность вашей системы (желательно закрыть другие программы, чтобы она получила точные данные), и, наконец, добавьте следующий профиль mpv в ваш mpv.conf[2]:\n\n```\nmpv.conf\n```\n\n```\n[svp]\ninput-ipc-server=/tmp/mpvsocket     # Получение данных от SVP\nhr-seek-framedrop=no                # Исправление рассинхронизации аудио\nresume-playback=no                  # Несовместимо с SVP\n\n# В некоторых случаях может устранить подвисания, в других случаях, возможно, вызывает их. Попробуйте в случае проблем.\n#opengl-early-flush=yes\n```\n\nДля использования программа SVP должна быть запущена в фоновом режиме. Теперь для запуска mpv либо используйте команду:\n\n```\n$ mpv --profile=svp video.mkv\n```\n\nЛибо пропишите profile=svp в верхний уровень настроек mpv.\n\nЕсли вы хотите использовать аппаратное декодирование, то вы должны использовать copy-back декодер, поскольку обычные декодеры не совместимы с Vapoursynth (выберите опцию hwdec, которая заканчивается на -copy). Например:\n\n```\nhwdec=auto-copy\nhwdec-codecs=all\n```\n\nВ любом случае, аппаратное декодирование не рекомендуется разработчиками mpv и вряд ли даст существенную разницу в производительности.\n\n"
    },
    {
      "title": "Аппаратное декодирование",
      "level": 3,
      "content": "Смотрите статью Аппаратное ускорение видео.\n\nАппаратное декодирование видео включается через опцию --hwdec=API. Список всех поддерживаемых API и другие необходимые опции смотрите в соответствующем разделе руководства.\n\nЧтобы была доступна программная обработка видеофильтрами, выберите API с именем, оканчивающимся на -copy.\n\nДля Wayland используйте опцию --gpu-context=wayland. Список других доступных GPU API смотрите в руководстве.\n\nДля решения проблем, связанных с аппаратным декодированием, может потребоваться настройка logging level. Например, --msg-level=vd=v,vo=v,vo/gpu/vaapi-egl=trace включает следующее:\n\n- Подробные (verbose) сообщения от модулей видеодекодера (vd) и видеовывода (vo).\n- Ещё более подробные (trace) сообщения для модуля, отвечающего за декодирование видео. Здесь, после однократного запуска mpv без каких-либо настроек уровней журнала, эмпирически было определено, что интересующий нас модуль — vo/gpu/vaapi-egl.\n\n"
    },
    {
      "title": "Воспроизведение с предыдущего места",
      "level": 3,
      "content": "Стандартной комбинацией клавиш для выхода из mpv с сохранением текущей позиции является Shift+q. Это можно изменить, добавив строку quit_watch_later в файл настроек сочетаний клавиш.\n\nЧтобы всегда сохранять текущую позицию при выходе, запустите mpv с опцией --save-position-on-quit или добавьте save-position-on-quit в файл конфигурации.\n\n"
    },
    {
      "title": "Звук слишком тихий",
      "level": 3,
      "content": "Установите параметр volume-max=значение в вашем файле настроек на желаемый уровень, например volume-max=150, что более чем в два раза громче. Слишком сильное увеличение громкости может привести к клиппингу. Дополнительно (или вместо этого), вы можете воспользоваться компрессором аудиосигнала с af=acompressor.\n\n"
    },
    {
      "title": "Выбор аудиовывода",
      "level": 3,
      "content": "Следующая команда покажет список доступных устройств для вывода аудио:\n\n```\n$ mpv --audio-device=help\n```\n\nДобавьте нужное устройство в ~/.config/mpv/mpv.conf, например:\n\n```\naudio-device=alsa/hdmi:CARD=NVidia,DEV=1\n```\n\n"
    },
    {
      "title": "HD Audio passthrough",
      "level": 3,
      "content": "Чтобы включить прямую передачу (passthrough) HD аудиокодеков, таких как TrueHD и DTS-MA, на AV-ресивер, добавьте следующее в ~/.config/mpv/mpv.conf\n\n```\naudio-spdif=ac3,eac3,dts-hd,truehd\n```\n\n"
    },
    {
      "title": "Более высокое качество звука при просмотре ускоренного контента",
      "level": 3,
      "content": "Если вы регулярно просматриваете ускоренный контент, используйте следующий фильтр для улучшения качества звука:\n\n```\naf=scaletempo2\n```\n\n"
    },
    {
      "title": "Нормализация громкости",
      "level": 3,
      "content": "Разные источники могут иметь разную или непостоянную громкость, поэтому может потребоваться настройка автоматической нормализации громкости. Например:\n\n```\n~/.config/mpv/input.conf\n```\n\n```\nn cycle_values af loudnorm=I=-30 loudnorm=I=-15 anull\n```\n\nЭто настраивает клавишу n на переключение настроек аудиофильтра (af) по указанным значениям:\n\n- loudnorm=I=-30: настройка громкости с I=-30, мягкая громкость, может подойти для фоновой музыки\n- loudnorm=I=-15: более громкий звук, может подойти для просматриваемого видео\n- anull: отключение аудиофильтра\n\nФильтрация звука в mpv обеспечивается бэкендом FFmpeg. Смотрите Wikipedia:EBU R 128 и ffmpeg loudnorm filter для подробностей.\n\nСмотрите также [3] и [4], где упоминаются различные опции.\n\n"
    },
    {
      "title": "Воспроизведение DVD",
      "level": 3,
      "content": "mpv не поддерживает меню DVD. Чтобы запустить основной поток с самым длинным заголовком видео DVD, используйте команду:\n\n```\n$ mpv dvd://\n```\n\nНеобязательный спецификатор title — это число (начиная с 0), которое позволяет выбрать видеопоток на DVD:\n\n```\n$ mpv dvd://[title]\n```\n\nDVD, которые были скопированы на локальную файловую систему (например, с помощью dvdbackup), можно использовать, указав путь к локальной копии: --dvd-device=ПУТЬ.\n\nМожно использовать такой ярлык для просмотра DVD с локальной файловой системы:\n\n```\n[Desktop Entry]\nType=Application\nName=mpv Media Player DVD \nName[ru]=DVD-проигрыватель mpv\nGenericName=Multimedia player\nComment=Play movies and songs\nComment[ru]=Воспроизвести фильмы и музыку\nIcon=mpv\nExec=mpv dvd:// --player-operation-mode=pseudo-gui --force-window --idle --dvd-device=%f\nTerminal=false\nCategories=AudioVideo;Audio;Video;Player;TV;\n# (MimeType и X-KDE-Protocols опущены, смотрите оригинальный файл mpv.desktop)\n```\n\nЕсли заменить строку Exec на\n\n```\nExec=mpv dvd://0 dvd://1 dvd://2 dvd://3 dvd://4 dvd://5 dvd://6 dvd://7 dvd://8 dvd://9  --player-operation-mode=pseudo-gui --force-window --idle --dvd-device=%f\n```\n\nто плеер mpv поместит в плейлист DVD title с 0 по 9, что позволяет пользователю воспроизводить их последовательно или переходить по ним вперёд и назад с помощью графического интерфейса mpv.\n\nУстановите libdvdcss для исправления следующей ошибки:\n\n```\n[dvdnav] Error getting next block from DVD 1 (Error reading from DVD.)\n```\n\n"
    },
    {
      "title": "Быстрое переключение соотношений сторон",
      "level": 3,
      "content": "Используйте сочетание клавиш Shift+a.\n\n"
    },
    {
      "title": "Игнорирование соотношения сторон",
      "level": 3,
      "content": "Используйте опцию --keepaspect=no или добавьте keepaspect=no в файл настроек.\n\n"
    },
    {
      "title": "Отрисовка на корневом окне",
      "level": 3,
      "content": "Запустите mpv с опцией --wid=0 файл.mp4. Таким образом mpv будет отрисован в фоне экрана (окне с идентификатором 0).\n\n"
    },
    {
      "title": "Всегда отображать окно приложения",
      "level": 3,
      "content": "Чтобы окно отображалось даже при воспроизведении аудио при запуске mpv через командную строку, используйте опцию --force-window. Чтобы сделать это постоянным, добавьте force-window=yes в файл настроек.\n\n"
    },
    {
      "title": "Отключение вывода видео",
      "level": 3,
      "content": "Используйте --vid=no или псевдоним --no-video.\n\n"
    },
    {
      "title": "Восстановление старого OSC",
      "level": 3,
      "content": "С версии 0.21.0 в mpv экранные элементы управления заменены на нижнюю панель. Если вы хотите вернуть старое экранное управление, вы можете отредактировать настройки mpv как описано здесь.\n\n"
    },
    {
      "title": "Использование как плагин браузера",
      "level": 3,
      "content": "С помощью mozpluggerAUR mpv можно использовать для воспроизведения видео в поддерживаемых браузерах. Инструкции по настройке смотрите на странице Browser plugins#MozPlugger. Плагин в связке с пользовательским скриптом ViewTube[устаревшая ссылка 2025-03-15 ⓘ] позволяет использовать mpv для просмотра видео на различных сайтах, заменяя интегрированный в сайт плеер.\n\nДля HTTP-стриминга может понадобиться указать корректный user agent, например user-agent=\"Mozilla/5.0 (X11; Linux x86_64; rv:49.0) Gecko/20100101 Firefox/49.0\".\n\nДругие способы просмотра видео описаны в статье Browser plugins#Multimedia playback.\n\n"
    },
    {
      "title": "Использование mpv для проигрывания музыки",
      "level": 3,
      "content": "В этой статье (англ.) представлен скрипт music.lua, в котором показано, как при помощи скриптов добавить функциональность в mpv, которая делает его удобнее в качестве проигрывателя музыки.\n\n"
    },
    {
      "title": "Просмотр стримов Twitch.tv через mpv",
      "level": 3,
      "content": "Если установлен youtube-dl, mpv сможет напрямую показывать стримы Twitch.\n\nДругой вариант — Streamlink#Twitch.\n\nЕщё один вариант, основанный на Livestreamer — этот Lua-скрипт: https://gist.github.com/ChrisK2/8701184fe3ea7701c9cc\n\n"
    },
    {
      "title": "youtube-dl и выбор формата",
      "level": 3,
      "content": "Значение --ytdl-format по умолчанию — bestvideo+bestaudio/best. Для видео youtube с разрешением 4K это может означать, что ваше устройство будет пытаться программно декодировать 4K VP9 видео, даже если подключенный монитор имеет гораздо меньшее разрешение.\n\nУстановка правильных селекторов формата youtube-dl поможет исправить эту ситуацию. В следующем примере будут рассматриваться только видео с вертикальным разрешением 1080 пикселей или меньше.\n\n```\nytdl-format=\"bestvideo[height<=?1080]+bestaudio/best\"\n```\n\nЕсли вы хотите полностью избежать определённого кодека из-за невозможности его аппаратного декодирования, вы можете добавить это в селектор форматов. Например, мы можем дополнительно выбрать игнорирование VP9 следующим образом:\n\n```\nytdl-format=\"bestvideo[height<=?1080][vcodec!=vp9]+bestaudio/best\"\n```\n\nЕсли вы предпочитаете открытые кодеки наилучшего качества (VP9 и Opus), используйте:\n\n```\nytdl-format=\"((bestvideo[vcodec^=vp9]/bestvideo)+(bestaudio[acodec=opus]/bestaudio[acodec=vorbis]/bestaudio[acodec=aac]/bestaudio))/best\"\n```\n\n"
    },
    {
      "title": "Поиск аудио с youtube-dl",
      "level": 3,
      "content": "Добавьте следующую функцию в .bashrc, и с помощью команды yta поисковый запрос вы сможете воспроизвести первый результат поиска на YouTube:\n\n```\nfunction yta() {\n    mpv --ytdl-format=bestaudio ytdl://ytsearch:\"$*\"\n}\n```\n\n"
    },
    {
      "title": "Воспроизводимые скриншоты",
      "level": 3,
      "content": "Опция шаблона имени файла может включать точный временной код (HH:MM:SS.mmm) кадра скриншота. Содержательное имя файла позволяет легко определить происхождение скриншота. Оно задаётся следующим образом:\n\n```\n~/.config/mpv/mpv.conf\n```\n\n```\nscreenshot-template=\"%F - [%P]v%#01n\"\n```\n\nВ результате будут получаться имена в формате имя - [HH:MM:SS.mmm]vномер.jpg, например:\n\n```\nGunsmith Cats/\n├── Gunsmith Cats - 01 - [00:00:50.217]v1.jpg\n├── Gunsmith Cats - 01 - [00:22:55.874]v1.jpg\n├── Gunsmith Cats - 02 - [00:12:09.729]v1.jpg\n├── Gunsmith Cats - 02 - [00:12:09.729]v2.jpg\n├── Gunsmith Cats - 02 - [00:15:05.778]v1.jpg\n└── Gunsmith Cats - 03 - [00:03:20.001]v1.jpg\n```\n\nБонусом является хорошая сортировка, поскольку в алфавитном порядке таймкод сортируется с учётом номера эпизода.\n\n"
    },
    {
      "title": "Создание одного скриншота",
      "level": 3,
      "content": "Чтобы создать один скриншот по указанному времени (HH:MM:SS):\n\n```\n$ mpv --no-audio --start=00:01:30 --frames=1 /путь/к/видео/файлу --o=/путь/к/скриншоту.png\n```\n\n"
    },
    {
      "title": "Вывод в терминал (libcaca)",
      "level": 3,
      "content": "Поддержка libcaca была отключена из-за уязвимостей (смотрите FS#70962). Если она вам нужна, установите mpv-cacaAUR[ссылка недействительна: package not found].\n\n"
    },
    {
      "title": "Автоматическое определение кодировки",
      "level": 3,
      "content": "Для автоопределения кодировки текста в метаданных файла, добавьте metadata-codepage=auto в файл настроек.\n\n"
    },
    {
      "title": "Начальная отладка",
      "level": 3,
      "content": "Если у вас возникают проблемы с воспроизведением в mpv (или он совсем не работает), то первые три вещи, которые вы должны сделать, это:\n\n1. Запустите mpv из командной строки (флаг -v включит более подробный вывод). Там может оказаться информативное сообщение об ошибке. $ mpv -v video.mkv\n1. Проанализируйте файл журнала mpv. В нём может быть тяжело разобраться, но если что-то сломалось, там вы сможете это увидеть.$ mpv -v --log-file=./log video.mkv\n1. Запустите mpv со стандартными настройками. Если воспроизведение заработает, то проблема где-то в вашем файле конфигурации (возможно, ваше оборудование недостаточно мощное для таких настроек).$ mpv --no-config video.mkv\n\nЕсли mpv запускается, но не работает достаточно хорошо, то четвертая вещь, на которую стоит обратить внимание - установить скрипт mpv-stats и использовать его для отладки работы плеера.\n\n"
    },
    {
      "title": "Исправление отрывистого воспроизведения и разрыва кадров",
      "level": 3,
      "content": "По умолчанию mpv использует настройки вывода OpenGL на аппаратном обеспечении, которое их поддерживает. В таких случаях, как попытка воспроизведения видео на 4K-дисплее с использованием карты Intel HD4XXX или аналогичной, вы обнаружите, что воспроизведение видео отрывистое, вплоть до того, что местами может останавливаться совсем, и с разрывами кадров при использовании любых параметров opengl. Если у вас возникают какие-либо из этих проблем, использование видеовывода XV (XVideo) может помочь:\n\n```\n~/.config/mpv/mpv.conf\n```\n\n```\nvo=xv\n```\n\nЭто VO устарело и вызовет проблемы в последних версиях mpv. В частности, наэкранное меню может выглядеть размытым.\n\nМожно увеличить производительность воспроизведения еще больше (особенно на более слабом оборудовании), но в большинстве случаев это значительно снижает качество видео.\n\nСледующие параметры можно попробовать, чтобы улучшить производительность воспроизведения:\n\n```\n~/.config/mpv/mpv.conf\n```\n\n```\nvd-lavc-fast\nvd-lavc-skiploopfilter=<skipvalue>\nvd-lavc-skipframe=<skipvalue>\nvd-lavc-framedrop=<skipvalue>\nvd-lavc-threads=<threads>\n```\n\n"
    },
    {
      "title": "Проблемы с композитными менеджерами",
      "level": 3,
      "content": "Композитные оконные менеджеры, такие как KWin или Mutter, могут вызвать проблемы в плавности воспроизведения. В таких случаях можно установить x11-bypass-compositor=yes, чтобы mpv также отключил композитинг окон при воспроизведении в оконном режиме (если поддерживается композитным менеджером).\n\nПри использовании KWin и аппаратного декодирования вы также можете установить x11-bypass-compositor=no, чтобы оставить композитинг включенным в полноэкранном режиме, так как повторное включение композитинга после выхода из полноэкранного режима может приводить к зависанию в течение определенного периода времени.\n\n"
    },
    {
      "title": "Невозможно изменить громкость",
      "level": 3,
      "content": "Вращайте колесико мыши над значком громкости.\n\n"
    },
    {
      "title": "Чёрный экран в GNOME (Wayland)",
      "level": 3,
      "content": "mpv может не приостановить настройки энергосбережения GNOME при использовании Wayland, что приводит к отключению монитора во время воспроизведения видео. Обходным решением является добавление gnome-session-inhibit в начало строки Exec= в mpv.desktop.\n\nДля блокировки хранителя экрана только во время воспроизведения можно использовать mpv lua скрипт, основанный на gnome-session-inhibit.\n\nДля flatpak-приложения io.mpv.Mpv используйте этот mpv lua скрипт.\n\n"
    },
    {
      "title": "Использование mpv с композитором",
      "level": 3,
      "content": "Если вы используете композитор (например, в KDE Plasma 5) и обнаружили, что композитинг отключен (например, в Plasma из-за этого вы не можете увидеть миниатюры окон в стандартном переключателе приложений), когда mpv воспроизводит видео, попробуйте x11-bypass-compositor=no\n\n"
    },
    {
      "title": "Игнорируется тема курсора в GNOME Wayland",
      "level": 3,
      "content": "На Wayland клиенты могут отображать разные темы курсора, поскольку для них нет универсальной настройки. Для темы курсора приложения Qt обычно принимают значение, установленное в переменной окружения XCURSOR_THEME. Однако в случае с mpv отображаемая тема курсора должна быть той, которая установлена в ~/.icons/default/index.theme. Поскольку GNOME не обновляет этот файл при изменении темы курсора с помощью GNOME Tweaks, вам придётся сделать это вручную. Дополнительную информацию смотрите в разделе Темы курсора#Спецификация XDG.\n\n"
    }
  ]
}