{
  "title": "Multiboot USB drive (Español)",
  "url": "https://wiki.archlinux.org/title/Multiboot_USB_drive_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-11-08** \n\nArtículos relacionados\n\n- GRUB (Español)\n- Syslinux (Español)\n- Archiso (Español)\n\nUna unidad flash USB multiarranque permite arrancar múltiples archivos ISO desde un único dispositivo. Los archivos ISO se pueden copiar al dispositivo y arrancar directamente sin descomprimirlos primero. Hay varios métodos disponibles, pero es posible que no funcionen con todas las imágenes ISO.\n\n"
    },
    {
      "title": "Utilizar GRUB y dispositivos loopback",
      "level": 2,
      "content": "Ventajas:\n\n- solo se requiere una partición;\n- todos los archivos ISO se encuentran en un directorio;\n- añadir y eliminar archivos ISO es simple.\n\nDesventajas:\n\n- no todas las imágenes ISO son compatibles;\n- el menú de arranque original para el archivo ISO no se muestra;\n- puede ser difícil encontrar una entrada de arranque que funcione.\n\n"
    },
    {
      "title": "Preparación",
      "level": 3,
      "content": "Cree, al menos, una partición y un sistema de archivos compatible con GRUB en la unidad USB. Consulte Partitioning (Español) y File systems (Español)#Crear un sistema de archivos. Elija el tamaño en función del tamaño total de los archivos ISO que desea almacenar en la unidad y planifique el espacio adicional para el cargador de arranque.\n\n"
    },
    {
      "title": "Instalación simple",
      "level": 4,
      "content": "Monte el sistema de archivos en la unidad USB:\n\n```\n# mount /dev/sdXY /mnt\n```\n\nCree el directorio /boot:\n\n```\n# mkdir /mnt/boot\n```\n\nInstale GRUB en la unidad USB:\n\n```\n# grub-install --target=i386-pc --recheck --boot-directory=/mnt/boot /dev/sdX\n```\n\nEn caso de que desee arrancar imágenes ISO en modo UEFI, debe instalar grub para el objetivo UEFI :\n\n```\n# grub-install --target x86_64-efi --removable --boot-directory=/mnt/boot --efi-directory=/mnt\n```\n\nPara UEFI, la partición debe ser la primera en una tabla de particiones MBR y formateada con FAT32.\n\n"
    },
    {
      "title": "Arranque híbrido UEFI GPT + BIOS GPT/MBR",
      "level": 4,
      "content": "Esta configuración es útil para crear una memoria USB universal, que arranque en todos los equipos. En primer lugar, debe crear una tabla de particionado GPT en su dispositivo. Necesita al menos 3 particiones:\n\n1. Una partición «BIOS boot partition» (código tipo para gdisk EF02). Esta partición debe tener un tamaño de 1 MiB.\n1. Una partición «EFI System partition» (código tipo para gdisk EF00 con un sistema de archivos FAT32). Esta partición puede ser tan pequeña como 50 MiB.\n\n1. Una partición de datos (use un sistema de archivos compatible con GRUB). Esta partición puede ocupar el resto del espacio de su disco.\n\nA continuación, debe crear una tabla de particionado MBR híbrida, ya que la configuración del indicador de arranque («boot») en la partición «MBR protective» podría no ser suficiente.\n\nEjemplo de creación de tabla de particionado híbrida MBR utilizando gdisk:\n\n```\n# gdisk /dev/sdX\n\nCommand (? for help): r\nRecovery/transformation command (? for help): h\n\nWARNING! Hybrid MBRs are flaky and dangerous! If you decide not to use one,\njust hit the Enter key at the below prompt and your MBR partition table will\nbe untouched.\n\nType from one to three GPT partition numbers, separated by spaces, to be added to the hybrid MBR, in sequence: 1 2 3\nPlace EFI GPT (0xEE) partition first in MBR (good for GRUB)? (Y/N): N\n\nCreating entry for GPT partition #1 (MBR partition #1)\nEnter an MBR hex code (default EF):\nSet the bootable flag? (Y/N): N\n\nCreating entry for GPT partition #2 (MBR partition #2)\nEnter an MBR hex code (default EF):\nSet the bootable flag? (Y/N): N\n\nCreating entry for GPT partition #3 (MBR partition #3)\nEnter an MBR hex code (default 83):\nSet the bootable flag? (Y/N): Y\n\nRecovery/transformation command (? for help): x\nExpert command (? for help): h\nExpert command (? for help): w\n\nFinal checks complete. About to write GPT data. THIS WILL OVERWRITE EXISTING\nPARTITIONS!!\n\nDo you want to proceed? (Y/N): Y\n```\n\nNo se olvide de formatear las particiones:\n\n```\n# mkfs.fat -F32 /dev/sdX2\n# mkfs.ext4 /dev/sdX3\n```\n\nAhora puede instalar GRUB para que sea compatible tanto con EFI + GPT como con BIOS + GPT/MBR. La configuración de GRUB (--boot-directory) se puede mantener en el mismo lugar.\n\nPrimero, debe montar la partición EFI del sistema (ESP) y la partición de datos de su unidad USB. Luego, puede instalar GRUB para UEFI con la orden:\n\n```\n# grub-install --target=x86_64-efi --recheck --removable --efi-directory=/EFI_MOUNTPOINT --boot-directory=/DATA_MOUNTPOINT/boot\n```\n\nY para BIOS con:\n\n```\n# grub-install --target=i386-pc --recheck --boot-directory=/DATA_MOUNTPOINT/boot /dev/sdX\n```\n\nComo respaldo adicional, también puede instalar GRUB en el «MBR-bootable» de su partición de datos:\n\n```\n# grub-install --target=i386-pc --recheck --boot-directory=/DATA_MOUNTPOINT/boot /dev/sdX3\n```\n\n"
    },
    {
      "title": "Utilizar una plantilla",
      "level": 4,
      "content": "Hay algunos proyectos git que proporcionan archivos de configuración de GRUB preexistentes, y un archivo grub.cfg genérico que se puede utilizar para cargar las otras entradas de arranque bajo demanda, mostrándolas solo si los archivos ISO especificados —o carpetas que los contienen— están presentes en el disco.\n\nUSB multiarranque: https://github.com/aguslr/multibootusb\n\nGLIM (GRUB2 Live ISO Multiboot): https://github.com/thias/glim\n\n"
    },
    {
      "title": "Configuración manual",
      "level": 4,
      "content": "Para el propósito de la unidad USB multiarranque, es más fácil modificar el archivo grub.cfg manualmente en lugar de generarlo automáticamente. Alternativamente, realice los siguientes cambios en /etc/grub.d/40_custom o /mnt/boot/grub/custom.cfg y genere /mnt/boot/grub/grub.cfg utilizando la orden grub-mkconfig.\n\nComo se recomienda utilizar un nombre permanente en lugar de /dev/sdxY para identificar la partición en la unidad USB donde se encuentran los archivos de imágenes, defina una variable de conveniencia para mantener el valor. Si las imágenes ISO están en la misma partición que GRUB, use lo siguiente para leer el UUID en el momento del arranque:\n\n```\n/mnt/boot/grub/grub.cfg\n```\n\n```\n# ruta a la partición que contiene imágenes ISO (usando UUID)\nprobe -u $root --set=rootuuid\nset imgdevpath=\"/dev/disk/by-uuid/$rootuuid\"\n```\n\nO especifique el UUID explícitamente:\n\n```\n/mnt/boot/grub/grub.cfg\n```\n\n```\n# ruta a la partición que contiene imágenes ISO (usando UUID)\nset imgdevpath=\"/dev/disk/by-uuid/UUID_value\"\n```\n\nAlternativamente, use la etiqueta del dispositivo en lugar de UUID:\n\n```\n/mnt/boot/grub/grub.cfg\n```\n\n```\n# ruta a la partición que contiene imágenes ISO (usando etiquetas)\nset imgdevpath=\"/dev/disk/by-label/label_value\"\n```\n\nEl UUID o la etiqueta necesarios se pueden encontrar utilizando lsblk -f. No utilice la misma etiqueta que la ISO de Arch para el dispositivo USB, de lo contrario, el proceso de arranque fallará.\n\nPara completar la configuración, se debe agregar una entrada de arranque para cada imagen ISO debajo de este encabezado, consulte la siguiente sección para ver ejemplos.\n\n"
    },
    {
      "title": "Entradas de arranque",
      "level": 3,
      "content": "Se supone que las imágenes ISO se almacenan en el directorio boot/iso/ en el mismo sistema de archivos donde está instalado GRUB. De lo contrario, sería necesario prefijar la ruta al archivo ISO con la identificación del dispositivo al utilizar la orden loopback, por ejemplo, loopback loop (hd1,2)$isofile. Como esta identificación de dispositivos no es persistente, no se utiliza en los ejemplos de esta sección.\n\nSe pueden utilizar nombres de dispositivo de bloque persistente como tal. Reemplace UUID de acuerdo con el UUID de su sistema de archivos.\n\n```\n# definir globalmente (es decir, fuera de cualquier menuentry)\ninsmod search_fs_uuid\nsearch --no-floppy --set=isopart --fs-uuid 123-456\n# luego usar dentro de cada menuentry en su lugar\nloopback loop ($isopart)$isofile\n```\n\n"
    },
    {
      "title": "Lanzamiento mensual de Arch Linu",
      "level": 4,
      "content": "Vea también archiso (Español).\n\n```\nmenuentry '[loopback]archlinux-2017.10.01-x86_64.iso' {\n\tset isofile='/boot/iso/archlinux-2017.10.01-x86_64.iso'\n\tloopback loop $isofile\n\tlinux (loop)/arch/boot/x86_64/vmlinuz img_dev=$imgdevpath img_loop=$isofile earlymodules=loop\n\tinitrd (loop)/arch/boot/intel_ucode.img (loop)/arch/boot/amd_ucode.img (loop)/arch/boot/x86_64/archiso.img\n}\n```\n\nConsulte README.bootparams para ver las opciones de archiso admitidas en la línea de órdenes del kernel.\n\n"
    },
    {
      "title": "Archboot",
      "level": 4,
      "content": "Vea también Archboot.\n\n```\nmenuentry '[loopback]archlinux-2014.11-1-archboot' {\n\tset isofile='/boot/iso/archlinux-2014.11-1-archboot.iso'\n\tloopback loop $isofile\n\tlinux (loop)/boot/vmlinuz_x86_64 iso_loop_dev=$imgdevpath iso_loop_path=$isofile\n\tinitrd (loop)/boot/initramfs_x86_64.img\n}\n```\n\n"
    },
    {
      "title": "Utilizar Syslinux y memdisk",
      "level": 2,
      "content": "Usando el módulo memdisk, la imagen ISO se carga en la memoria y esta carga el gestor de arranque. Asegúrese de que el sistema que arrancará esta unidad USB tenga suficiente memoria para el archivo de imagen y el sistema operativo que se va a ejecutar.\n\n"
    },
    {
      "title": "Preparación",
      "level": 3,
      "content": "Asegúrese de que la unidad USB esté correctamente particionada y que haya una partición con un sistema de archivos compatible con Syslinux, por ejemplo fat32 o ext4. Luego instale Syslinux en esta partición, vea Syslinux#BIOS systems.\n\n"
    },
    {
      "title": "Instalar el módulo memdisk",
      "level": 3,
      "content": "El módulo memdisk no se instalará durante la instalación de Syslinux, por lo que se debe instalar manualmente. Monte la partición donde esté ubicado Syslinux en /mnt/ y copie el módulo memdisk en el mismo directorio donde esté instalado Syslinux:\n\n```\n# cp /usr/lib/syslinux/bios/memdisk /mnt/boot/syslinux/\n```\n\n"
    },
    {
      "title": "Configuración",
      "level": 3,
      "content": "Después de copiar los archivos ISO en la unidad USB, edite el archivo de configuración de Syslinux y cree entradas de menú para las imágenes ISO. La entrada básica se verá así:\n\n```\nboot/syslinux/syslinux.cfg\n```\n\n```\nLABEL some_label\n    LINUX memdisk\n    INITRD /path/to/image.iso\n    APPEND iso\n```\n\nConsulte memdisk en la wiki de Syslinux para más opciones de configuración.\n\n"
    },
    {
      "title": "Precaución para sistemas de 32 bits",
      "level": 3,
      "content": "Al arrancar un sistema de 32 bits desde una imagen de más de 128MiB, es necesario aumentar el uso máximo de memoria virtual («vmalloc»). Esto se hace agregando vmalloc=valueM a los parámetros del kernel, donde value debe ser más grande que el tamaño de la imagen ISO en MiB.[1]\n\nPor ejemplo, al arrancar el sistema de 32 bits desde la ISO de instalación de Arch, presione la tecla Tab sobre la entrada Boot Arch Linux (i686) y agregue vmalloc=768M al final. Si omite este paso, se producirá el siguiente error durante el arranque:\n\n```\nmodprobe: ERROR: could not insert 'phram': Input/output error\n```\n\n"
    },
    {
      "title": "Herramientas automatizadas",
      "level": 2,
      "content": "- liveusb-builder — Un conjunto de scripts para crear un dispositivo USB multiarranque para distribuciones GNU/Linux\n\n- MultiBootUSB — Un software multiplataforma escrito en Python con interfaces CLI y GUI que permite instalar y eliminar múltiples imágenes de Linux live en una memoria USB.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- GRUB: https://help.ubuntu.com/community/Grub2/ISOBoot/Examples https://help.ubuntu.com/community/Grub2/ISOBoot GRUB Live ISO Multiboot — Configuraciones de GRUB para el arranque de imágenes ISO\n- Syslinux: Arrancar una imagen ISO\n\n- https://help.ubuntu.com/community/Grub2/ISOBoot/Examples\n- https://help.ubuntu.com/community/Grub2/ISOBoot\n- GRUB Live ISO Multiboot — Configuraciones de GRUB para el arranque de imágenes ISO\n\n- Arrancar una imagen ISO\n\n"
    }
  ]
}