{
  "title": "Mídia de instalação",
  "url": "https://wiki.archlinux.org/title/M%C3%ADdia_de_instala%C3%A7%C3%A3o",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Este documento é um guia para instalação do Arch Linux usando o sistema live inicializado de uma mídia de instalação feita a partir da imagem de instalação oficial. A mídia de instalação fornece recursos de acessibilidade que são descritas na página Instalar Arch Linux com opções de acessibilidade. Para meios alternativos de instalação, consulte Category:Installation process (Português).\n\nAntes de instalar, é recomendável ler rapidamente o FAQ. Para convenções usadas neste documento, veja Help:Leitura. Em especial, exemplos de código podem conter objetos reservados (formatados em italics) que devem ser substituídos manualmente.\n\nEste guia é mantido conciso e é recomendado que você siga as instruções na ordem apresentada por seção. Para instruções mais detalhadas, veja os respectivos artigos ArchWiki ou as páginas man dos vários programas, ambos relacionados neste guia. Para uma ajuda interativa, o canal IRC e os fóruns também estão disponíveis.\n\nArch Linux deve funcionar em qualquer máquina compatível com x86_64 com um mínimo de 512 MiB de RAM, apesar de que mais memória é necessária para inicializar o sistema live para instalação[1]. Uma instalação básica deve ocupar menos de 2 GiB de espaço em disco. Como o processo de instalação precisa obter pacotes de repositório remoto, esse guia presume que uma conexão com a Internet esteja disponível.\n\n"
    },
    {
      "title": "Obter uma imagem de instalação",
      "level": 3,
      "content": "Visite a página Download e, dependendo de como você deseja inicializar, obtenha o arquivo ISO ou a imagem netboot, e a respectiva assinatura PGP.\n\n"
    },
    {
      "title": "Verificar a assinatura",
      "level": 3,
      "content": "É recomendável verificar a assinatura da imagem antes de usá-la, especialmente ao fazer o download de um espelho HTTP, no qual os downloads geralmente são propensos a serem interceptados para servir imagens maliciosas.\n\nEm um sistema com GnuPG instalado, faça isso baixando a assinatura PGP da ISO (em Checksums na página de Download) para o diretório da ISO e verificando-a com:\n\n```\n$ gpg --keyserver-options auto-key-retrieve --verify archlinux-versão-x86_64.iso.sig\n```\n\nAlternativamente, de uma instalação existente de Arch Linux, execute:\n\n```\n$ pacman-key -v archlinux-versão-x86_64.iso.sig\n```\n\n- A assinatura em si pode ser manipulada se for baixada de um site espelho, ao invés de archlinux.org como acima. Nesse caso, certifique-se de que a chave pública, que é usada para decodificar a assinatura, seja assinada por outra chave confiável. O comando gpg produzirá a impressão digital da chave pública.\n- Outro método para verificar a autenticidade da assinatura é garantir que a impressão digital da chave pública seja idêntica à impressão digital da chave do desenvolvedor do Arch Linux que assinou o arquivo ISO. Veja Wikipedia:pt:Criptografia de chave pública para mais informações sobre o processo de chave pública para autenticar chaves.\n\n"
    },
    {
      "title": "Preparar uma mídia de instalação",
      "level": 3,
      "content": "A ISO pode ser fornecida à máquina de destino através de um unidade flash USB, um disco óptico ou uma rede com PXE: siga o artigo apropriado para preparar você mesmo um meio de instalação a partir do arquivo ISO.\n\nPara a imagem netboot, siga Netboot#Boot from a USB flash drive para preparar uma unidade flash USB para uma inicialização em UEFI.\n\n"
    },
    {
      "title": "Inicializar o ambiente live",
      "level": 3,
      "content": "1. Aponte o dispositivo de inicialização atual para aquele que possui a mídia de instalação do Arch Linux. Normalmente, isso é obtido pressionando uma tecla durante a fase POST, conforme indicado na tela inicial. Consulte o manual da sua placa-mãe para obter detalhes.\n1. Quando o menu do gerenciador de boot da mídia de instalação aparecer, Se você usou a ISO, selecione Arch Linux install medium e pressione Enter para entrar no ambiente de instalação. Se você usou a imagem Netboot, escolha uma espelho geograficamente próximo a você a partir do menu Mirror e selecione Boot Arch Linux e pressione Enter. Dica: A imagem ISO usa systemd-boot para inicializar no modo UEFI e syslinux para inicializar em BIOS. Use e ou Tab, respectivamente, para inserir os parâmetros de inicialização. A imagem Netboot usa iPXE e os parâmetros de inicializaçao podem ser especificados no menu Boot options. Veja README.bootparams para uma lista. Um exemplo comum de parâmetro de inicialização definido manualmente seria o tamanho da fonte. Para melhor legibilidade em telas HiDPI, quando ainda não são reconhecidas como tal, usar fbcon=font:TER16x32 pode ajudar. Veja HiDPI#Linux console (tty) para uma explicação detalhada.\n1. \n1. Você será autenticado no primeiro console virtual como o usuário root e será apresentado um prompt de shell Zsh.\n\n- Se você usou a ISO, selecione Arch Linux install medium e pressione Enter para entrar no ambiente de instalação.\n- Se você usou a imagem Netboot, escolha uma espelho geograficamente próximo a você a partir do menu Mirror e selecione Boot Arch Linux e pressione Enter. Dica: A imagem ISO usa systemd-boot para inicializar no modo UEFI e syslinux para inicializar em BIOS. Use e ou Tab, respectivamente, para inserir os parâmetros de inicialização. A imagem Netboot usa iPXE e os parâmetros de inicializaçao podem ser especificados no menu Boot options. Veja README.bootparams para uma lista. Um exemplo comum de parâmetro de inicialização definido manualmente seria o tamanho da fonte. Para melhor legibilidade em telas HiDPI, quando ainda não são reconhecidas como tal, usar fbcon=font:TER16x32 pode ajudar. Veja HiDPI#Linux console (tty) para uma explicação detalhada.\n\n- A imagem ISO usa systemd-boot para inicializar no modo UEFI e syslinux para inicializar em BIOS. Use e ou Tab, respectivamente, para inserir os parâmetros de inicialização. A imagem Netboot usa iPXE e os parâmetros de inicializaçao podem ser especificados no menu Boot options. Veja README.bootparams para uma lista.\n- Um exemplo comum de parâmetro de inicialização definido manualmente seria o tamanho da fonte. Para melhor legibilidade em telas HiDPI, quando ainda não são reconhecidas como tal, usar fbcon=font:TER16x32 pode ajudar. Veja HiDPI#Linux console (tty) para uma explicação detalhada.\n\nPara trocar para um console diferente — por exemplo, para ver este guia com Lynx junto com a instalação — use o atalho Alt+seta. Para editar arquivos de configuração, mcedit(1), nano e vim estão disponíveis. Veja pkglist.x86_64.txt para uma lista dos pacotes incluídos na mídia de instalação.\n\n"
    },
    {
      "title": "Definir o layout e fonte do teclado do console",
      "level": 3,
      "content": "O mapa de teclas de console padrão é US. Layouts disponíveis podem ser listados com:\n\n```\n# localectl list-keymaps\n```\n\nPara definir o layout de teclado, passe seu nome para loadkeys(1). Por exemplo, para definir um layout de teclado ABNT (brasileiro):\n\n```\n# loadkeys br-abnt2\n```\n\nOu para definir para um layout de teclado de português de Portugal:\n\n```\n# loadkeys pt-latin1\n```\n\nFontes de console estão localizadas em /usr/share/kbd/consolefonts/ e, de forma semelhante, podem ser definidas com setfont(8), omitindo caminho e extensão de arquivo. Por exemplo, para usar uma das maiores fontes adequadas para telas HiDPI, execute:\n\n```\n# setfont ter-132b\n```\n\n"
    },
    {
      "title": "Definir o idioma do ambiente live",
      "level": 3,
      "content": "Note: **apenas** \n\nO ambiente live vem em inglês (locale en_US.UTF-8) por padrão, mas você pode alterá-lo para executar as etapas de instalação usando o idioma desejado.\n\nPara português brasileiro, descomente pt_BR.UTF-8 UTF-8 e qualquer outro locale desejado em /etc/locale.gen e gere-os com:\n\n```\n# locale-gen\n```\n\nEntão, exporte a variável LANG acrescentando o idioma e codificação desejados. Por exemplo, para português brasileiro seria:\n\n```\n# export LANG=pt_BR.UTF-8\n```\n\nPara português de Portugal, use pt_PT.UTF-8 UTF-8 em vez do \"pt_BR\".\n\n"
    },
    {
      "title": "Verificar o modo de inicialização",
      "level": 3,
      "content": "Para verificar o modo de inicialização, verifique o número de bits do UEFI:\n\n```\n# cat /sys/firmware/efi/fw_platform_size\n```\n\n- Se o comando retornar 64, o sistema foi inicializado no modo UEFI e tem um UEFI x64 de 64 bits.\n\n- Se o comando retornar 32, o sistema foi inicializado no modo UEFI e tem um UEFI IA32 de 32 bits. Mesmo que exista o suporte para tal, isto irá limitar a escolha de gerenciador de boot para algum que suporte inicialização em modo misto.\n\n- Se for retornado que o arquivo/ficheiro ou diretório não existe, com a mensagem Arquivo/Ficheiro ou diretório inexistente, o sistema pode ter sido inicializado no modo BIOS (ou CSM).\n\nSe o sistema não inicializou no modo que você queria (UEFI vs BIOS), consulte o manual da sua placa-mãe.\n\n"
    },
    {
      "title": "Conectar à internet",
      "level": 3,
      "content": "Para configurar uma conexão de rede no ambiente live, siga as etapas abaixo:\n\n1. Certifique-se que sua interface de rede esteja listada e ativada, por exemplo, com ip-link(8): # ip link\n1. Para rede sem fio e WWAN, certifique-se que a placa de rede não esteja bloqueada com rfkill.\n1. Conecte-se à rede: Ethernet — conecte o cabo. Wi-Fi — autentique-se à rede sem fio usando iwctl. Modem de internet móvel — conecte-se à rede móvel com o utilitário mmcli.\n1. Configure sua conexão de rede: DHCP: atribuição de endereço de IP e servidor DNS dinâmicos (fornecidos por systemd-networkd e systemd-resolved) deve usar sem qualquer esforço as interfaces de rede Ethernet, WLAN e WWAN. Endereço IP estático: siga Configuração de rede#Endereço IP estático\n1. A conexão pode ser verificada com ping: # ping archlinux.org\n\n```\n# ip link\n```\n\n- Ethernet — conecte o cabo.\n- Wi-Fi — autentique-se à rede sem fio usando iwctl.\n- Modem de internet móvel — conecte-se à rede móvel com o utilitário mmcli.\n\n- DHCP: atribuição de endereço de IP e servidor DNS dinâmicos (fornecidos por systemd-networkd e systemd-resolved) deve usar sem qualquer esforço as interfaces de rede Ethernet, WLAN e WWAN.\n- Endereço IP estático: siga Configuração de rede#Endereço IP estático\n\n```\n# ping archlinux.org\n```\n\n"
    },
    {
      "title": "Atualizar o relógio do sistema",
      "level": 3,
      "content": "No ambiente live, systemd-timesyncd está habilitado por padrão e o horário será sincronizado automaticamente assim que a conexão com a Internet for estabelecida.\n\nUse timedatectl(1) para garantir que o relógio do sistema está sincronizado:\n\n```\n# timedatectl\n```\n\n"
    },
    {
      "title": "Partição dos discos",
      "level": 3,
      "content": "Quando reconhecido pelo sistema live, discos são atribuídos a um dispositivo de bloco tal como /dev/sda, /dev/nvme0n1 ou /dev/mmcblk0. Para identificar esses dispositivos, use lsblk ou fdisk.\n\n```\n# fdisk -l\n```\n\nResultados terminando em rom, loop ou airootfs podem ser ignorados. Dispositivos mmcblk* terminando em rpbm, boot0 e boot1 também podem ser ignorados.\n\nAs seguintes partições são exigidas para um dispositivo escolhido:\n\n- Uma partição para o diretório raiz /.\n- Para inicializar no modo UEFI: uma partição de sistema EFI.\n\nUse fdisk ou parted para modificar tabelas de partição. Por exemplo:\n\n```\n# fdisk /dev/o_disco_a_ser_particionado\n```\n\n- Reserve um tempo para planejar um esquema de particionamento de longo prazo para evitar procedimentos de conversão ou reparticionamento arriscados e complicados no futuro.\n- Se você quiser criar algum dispositivo de bloco empilhado para LVM, criptografia de sistema ou RAID, faça isso agora.\n- Se o disco do qual você deseja inicializar já tiver uma partição de sistema EFI, não crie outra, apenas use a partição existente.\n- O espaço Swap pode ser configurado em um arquivo swap para sistemas de arquivos que o suportem. Alternativamente, swap baseada em disco pode ser totalmente evitada configurando swap na zram após instalar seu sistema.\n\n"
    },
    {
      "title": "Exemplos de layouts",
      "level": 4,
      "content": "Table content:\nPonto de montagem no sistema instalado | Partição | Tipo de partição | Tamanho sugerido\n/boot1 | /dev/partição_de_sistema_efi | Partição de sistema EFI | 1 GiB\n[SWAP] | /dev/partição_swap | Linux swap | Pelo menos 4 GiB\n/ | /dev/partição_raiz | Linux x86-64 root (/) | Restante do dispositivo. Pelo menos 23-32 GiB.\n\n1. Outros pontos de montagem, como /efi, são possíveis, desde que o gerenciador de boot usado seja capaz de carregar as imagens do kernel e do initramfs da raiz volume. Veja o aviso em Processo de inicialização do Arch#Gerenciador de boot.\n\nTable content:\nPonto de montagem no sistema instalado | Partição | Tipo de partição | Tamanho sugerido\n[SWAP] | /dev/partição_swap | Linux swap | Pelo menos 4 GiB\n/ | /dev/partição_raiz | Linux | Restante do dispositivo. Pelo menos 23-32 GiB.\n\nVeja também Particionamento#Exemplos de leiaute.\n\n"
    },
    {
      "title": "Formatar as partições",
      "level": 3,
      "content": "Assim que as partições tenham sido criadas, cada uma deve ser formatada com um sistema de arquivos adequado. Veja Sistemas de arquivos#Criar um sistema de arquivos para detalhes.\n\nPor exemplo, se a partição raiz está em /dev/sdX1 e receberá o sistema de arquivos Ext4, execute:\n\n```\n# mkfs.ext4 /dev/partição_raiz\n```\n\nSe você criou uma partição para swap (por exemplo, /dev/sda3), inicialize-a com mkswap(8):\n\n```\n# mkswap /dev/partição_swap\n```\n\nSe você criou uma partição de sistema EFI, formate-o para FAT32 usando mkfs.fat(8).\n\n```\n# mkfs.fat -F 32 /dev/partição_de_sistema_efi\n```\n\n"
    },
    {
      "title": "Montar os sistemas de arquivos",
      "level": 3,
      "content": "Monte o volume raiz em /mnt. Por exemplo, se o volume raiz for /dev/partição_raiz:\n\n```\n# mount /dev/partição_raiz /mnt\n```\n\nCrie quaisquer pontos de montagem restantes sob /mnt/ (tal como /mnt/boot para /boot/) e monte os volumes na ordem hierárquica correspondente.\n\nPara sistemas UEFI, monte a partição de sistema EFI:\n\n```\n# mount --mkdir /dev/partição_de_sistema_efi /mnt/boot\n```\n\nSe você criou uma volume swap, habilite-o com swapon(8):\n\n```\n# swapon /dev/partição_swap\n```\n\ngenfstab(8) vai detectar os sistemas de arquivos montados e espaços swap.\n\n"
    },
    {
      "title": "Selecionar os espelhos",
      "level": 3,
      "content": "Pacotes a serem instalados devem ser baixados de espelhos (mirrors), que são definidos na /etc/pacman.d/mirrorlist. No sistema live, após se conectar À internet, o reflector atualizar a lista de espelhos escolhendo 20 espelhos HTTPS sincronizados mais recentemente e ordenando-os por taxa de download.\n\nQuanto mais alto um espelho está posicionado na lista, mais prioritário ele será ao baixar um pacote. Você pode querer inspecionar o arquivo para ver se ele está satisfatório. Se não estiver, edite o arquivo e mova espelhos geograficamente mais perto para o topo da lista, apesar de que outros critérios devem ser levados em consideração.\n\nEsse arquivo será posteriormente copiado para o novo sistema por pacstrap, então é melhor fazer direito.\n\n"
    },
    {
      "title": "Instalar os pacotes essenciais",
      "level": 3,
      "content": "Use o script pacstrap(8) para instalar o pacote base, um kernel Linux e um firmware para hardwares comuns:\n\n```\n# pacstrap -K /mnt base linux linux-firmware\n```\n\n- Você pode substituir linux pelo pacote de kernel de sua escolha, ou você poderia omiti-lo completamente quando estiver instalando em um contêiner.\n- Você poderia omitir a instalação do pacote de firmware quando estiver instalando em uma máquina virtual ou contêiner.\n\nO pacote base não inclui todas as ferramentas da instalação live. Então a instalação de mais pacotes pode ser necessário para um sistema base completamente funcional. Para instalar outros pacotes ou grupos de pacotes, acrescente os nomes ao comando pacstrap acima (separados por espaço) ou use o pacman para instalar eles enquanto estiver em chroot no novo sistema. Em especial, considere instalar:\n\n- Atualizações de microcódigos de CPU — amd-ucode ou intel-ucode — para correções de bugs de hardware ou correções de segurança,\n- utilitários de espaço do usuário para sistemas de arquivos que serão usados no sistema — para fins de, p. ex., criação do sistema de arquivos e fsck,\n- utilitários para acessar e gerenciar RAID ou LVM caso eles sejam usados no sistema,\n- firmwares específicos para outros dispositivos não incluídos em linux-firmware (p.ex., sof-firmware para áudio onboard), linux-firmware-marvell para Marvell sem fio e qualquer um dos vários pacotes de firmware para Broadcom wireless),\n- softwares necessários para rede (p.ex., um gerenciador de rede ou um cliente DHCP autônomo, software de autenticação por Wi-Fi, ModemManager para conexões de banda larga móvel),\n- um editor de texto,\n- um editor de texto de console (por exemplo, nano) para permitir a edição de arquivos de configuração no console,\n- pacotes necessários para acessar documentação em páginas man e info: man-db, man-pages and texinfo.\n\nPara uma comparação, pacotes disponíveis no sistema live podem ser encontrados em pkglist.x86_64.txt.\n\n"
    },
    {
      "title": "Fstab",
      "level": 3,
      "content": "Gere um arquivo fstab (use -U ou -L para definir por UUID ou rótulos, respectivamente):\n\n```\n# genfstab -U /mnt >> /mnt/etc/fstab\n```\n\nVerifique o arquivo /mnt/etc/fstab resultante e edite-o caso haja erros.\n\n"
    },
    {
      "title": "Chroot",
      "level": 3,
      "content": "Mude a raiz para novo sistema:\n\n```\n# arch-chroot /mnt\n```\n\n"
    },
    {
      "title": "Horário",
      "level": 3,
      "content": "Defina o fuso horário:\n\n```\n# ln -sf /usr/share/zoneinfo/Região/Cidade /etc/localtime\n```\n\nPor exemplo, para definir para o fuso horário de Brasília (BRT ou BRST), execute:\n\n```\n# ln -sf /usr/share/zoneinfo/America/Sao_Paulo /etc/localtime\n```\n\nExecute hwclock(8) para gerar /etc/adjtime:\n\n```\n# hwclock --systohc\n```\n\nEsse comando presume que o relógio de hardware está definido para UTC. Veja System time#Time standard para mais detalhes.\n\nPara evitar desvios do relógio e garantir a hora precisa, configure a sincronização de horário usando um cliente de Network Time Protocol (NTP), como systemd-timesyncd.\n\n"
    },
    {
      "title": "Localização",
      "level": 3,
      "content": "Edite /etc/locale.gen e descomente pt_BR.UTF-8 UTF-8 e qualquer outros locales UTF-8 necessário. Gere os locales executando:\n\n```\n# locale-gen\n```\n\nCrie o arquivo locale.conf(5) e defina a variável LANG adequadamente:\n\n```\n/etc/locale.conf\n```\n\n```\nLANG=pt_BR.UTF-8\n```\n\nSe você definir o layout do teclado do console, torne as alterações persistentes em vconsole.conf(5):\n\n```\n/etc/vconsole.conf\n```\n\n```\nKEYMAP=br-abnt2\n```\n\n"
    },
    {
      "title": "Configuração de rede",
      "level": 3,
      "content": "Crie o arquivo hostname:\n\n```\n/etc/hostname\n```\n\n```\nseuhostname\n```\n\nConclua a configuração de rede para o ambiente recém-instalado. Isso pode incluir a instalação de um software gerenciador de rede adequado, configurando-o se necessário e habilitando sua unidade systemd para que ela seja iniciada na inicialização.\n\n"
    },
    {
      "title": "Initramfs",
      "level": 3,
      "content": "A criação de novo initramfs geralmente não é necessário porque mkinitcpio foi executado na instalação do pacote de kernel com pacstrap.\n\nPara LVM, criptografia de sistema ou RAID, modifique o mkinitcpio.conf(5) e recrie a imagem initramfs:\n\n```\n# mkinitcpio -P\n```\n\n"
    },
    {
      "title": "Senha do root",
      "level": 3,
      "content": "Defina a senha do root (também conhecido como \"superusuário\"):\n\n```\n# passwd\n```\n\n"
    },
    {
      "title": "Gerenciador de boot",
      "level": 3,
      "content": "Escolha e instale um gerenciador de boot compatível com Linux.\n\n"
    },
    {
      "title": "Reiniciar",
      "level": 2,
      "content": "Saia de ambiente chroot digitando exit ou pressionando Ctrl+D.\n\nOpcionalmente, desmonte todas as partições com umount -R /mnt: isso permite noticiar quaisquer partições \"ocupadas\" e localizar a causa com o fuser(1).\n\nFinalmente, reinicie a máquina digitando reboot: quaisquer partições que ainda estejam montadas serão desmontadas automaticamente por systemd. Lembre-se de remover a mídia de instalação e, então, se autenticando no novo sistema com a conta de root.\n\n"
    },
    {
      "title": "Pós-instalação",
      "level": 2,
      "content": "Veja Recomendações gerais por instruções de gerenciamento de sistema e tutoriais pós-instalação (como a criação de contas de usuário sem privilégios de superusuário, instalar uma interface gráfica de usuário, som ou um touchpad).\n\nPara uma lista de aplicativos que podem ser de seu interesse, veja Lista de aplicativos.\n\n"
    }
  ]
}