{
  "title": "Nano (Français)",
  "url": "https://wiki.archlinux.org/title/Nano_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GNU nano (ou nano) est un éditeur de texte qui vise à introduire une interface simple et des options de commande intuitives pour l'édition de texte en mode console. Il prend en charge des fonctionnalités telles que la coloration de la syntaxe, les conversions de types de fichiers DOS/Mac, la vérification orthographique et l'encodage UTF-8. Ouvert avec un tampon vide, nano occupe généralement moins de 4 Mo de mémoire résidente.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet nano.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "L'aspect, la convivialité et les fonctions de nano sont généralement contrôlés au moyen d'arguments de ligne de commande ou de paramètres de configuration dans le fichier ~/.config/nano/nanorc.\n\nUn exemple de fichier de configuration est installé lors de l'installation du programme et se trouve à /etc/nanorc. Pour personnaliser la configuration de nano, créez d'abord une copie locale dans ~/.config/nano/nanorc :\n\n```\n$ cp /etc/nanorc ~/.config/nano/nanorc\n```\n\nProcédez au paramétrage de nano en activant ou désactivant des commandes dans le fichier ~/.config/nano/nanorc.\n\n"
    },
    {
      "title": "Coloration syntaxique",
      "level": 3,
      "content": "Nano est livré avec des règles prédéfinies de coloration syntaxique, définies dans /usr/share/nano/*.nanorc. Pour les activer, ajoutez la ligne suivante à votre ~/.config/nano/nanorc ou à /etc/nanorc :\n\n```\ninclude \"/usr/share/nano/*.nanorc\"\n```\n\nPour les améliorations de la coloration syntaxique qui remplacent et étendent les valeurs par défaut, installez nano-syntax-highlighting ou nano-syntax-highlighting-gitAUR et, en plus du paramètre ci-dessus, ajoutez également :\n\n```\ninclude \"/usr/share/nano-syntax-highlighting/*.nanorc\"\n```\n\n"
    },
    {
      "title": "Forth",
      "level": 4,
      "content": "Consultez https://paste.xinu.at/wc17YG/ pour la coloration syntaxique de Forth.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 4,
      "content": "Enregistrez https://paste.xinu.at/4ss/ (similaire à l'ancien serveur svntogit d'Arch) dans /etc/nano/pkgbuild.nanorc et incluez-le :\n\n```\ninclude \"/etc/nano/pkgbuild.nanorc\"\n```\n\n"
    },
    {
      "title": "Suspension",
      "level": 3,
      "content": "Note: **Cet article ou section a besoin d'être traduit(e).** Cet article ou section a besoin d'être traduit(e).\n\nCet article ou section a besoin d'être traduit(e).\n\nContrairement à la plupart des programmes interactifs, la suspension n'est pas activée par défaut. Pour changer cela, dé-commentez la ligne set suspendable dans /etc/nanorc. Cela vous permettra d'utiliser les touches Ctrl+z pour envoyer nano en arrière-plan.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "Les raccourcis peuvent être visualisés depuis l'intérieur de nano. Consultez les fichiers d'aide en ligne de nano via Ctrl+g dans nano et le manuel des commandes de nano pour des descriptions complètes et une assistance supplémentaire.\n\nConsultez également le pense-bête pour nano.\n\n"
    },
    {
      "title": "Fonctions spéciales",
      "level": 3,
      "content": "Les raccourcis clavier représentant les fonctions les plus utilisées sont répertoriés sur les deux lignes inférieures de l'écran de nano.\n\nIls peuvent être activés par :\n\n- Ctrl pour les raccourcis basés sur ^.\n- Meta (généralement Alt) (généralement Alt) ou Esc pour les raccourcis basés sur M-.\n\n"
    },
    {
      "title": "Remplacer vi par nano",
      "level": 3,
      "content": "Pour remplacer vi par nano comme éditeur de texte par défaut pour des commandes telles que visudo, définissez les paramètres VISUAL et EDITOR variables d'environnement, par exemple :\n\n```\nexport VISUAL=nano\nexport EDITOR=nano\n```\n\n"
    },
    {
      "title": "Raccourcis clavier interceptés",
      "level": 3,
      "content": "Certains gestionnaires de fenêtres ont des raccourcis clavier qui entrent en conflit avec nano, par exemple Alt+Enter. Supprimez-les ou re-définissez-les avec Super par exemple (avec dconf pour mutter, muffin et marco) et redémarrez le gestionnaire de fenêtres.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- nano (text editor) - Entrée Wikipedia\n- Page d'accueil de GNU nano - Site officiel\n- Bugs GNU nano - Rapport de bug\n- Fichiers de coloration syntaxique améliorés pour Nano\n\n"
    }
  ]
}