{
  "title": "Nano (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Nano_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GNU nano (veya nano) çeşitli metin düzenleyicilerinden edinilen alışkanlıkları komut satırı üzerinden sürdürebilmenizi, anlaşılır bir arayüz ile hedefleyen bir metin düzenleyicisidir. nano, sözdizimi vurgulama (syntax highlighting), DOS/Mac dosya tiplerine dönüştürme, yazım denetimi ve UTF-8 dönüşüm biçimi gibi özellikleri desteklemektedir. nano boş bir dosya ile açıldığında birkaç MiB bellek kaplamaktadır.\n\n"
    },
    {
      "title": "Kurulum",
      "level": 2,
      "content": "nano paketini kurunuz.\n\n"
    },
    {
      "title": "Yapılandırma",
      "level": 2,
      "content": "nano'nun kullanımı ve görünüşü genellikle nano komutuna ekleyeceğiniz argümanlar ile veya ~/.config/nano/nanorc dosyasına bu argümanlar eklenerek kontrol edilir.\n\nÖrnek bir yapılandırma dosyası nano kurulduktan sonra /etc/nanorc konumunda bulunabilir. nano yapılandırmanızı kişiselleştirebilmek için ~/.config/nano/nanorc konumuna bu dosyanın kopyasını oluşturabilirsiniz.\n\n```\n$ cp /etc/nanorc ~/.config/nano/nanorc\n```\n\nDosyayı kopyaladıktan sonra istediğiniz komutları ~/.config/nano/nanorc dosyasına ekleyerek kişiselleştirmeye başlayabilirsiniz.\n\n"
    },
    {
      "title": "Sözdizimi Vurgulama",
      "level": 3,
      "content": "Nano, önceden belirlenmiş sözdizimi vurgulama kuralları ile gelmektedir, bu kurallar /usr/share/nano/*.nanorc ve /usr/share/nano/extra/*.nanorc konumlarında bulunabilir. Etkinleştirmek için ~/.config/nano/nanorc veya /etc/nanorc dosyalarına şu satırı ekleyin:\n\n```\ninclude \"/usr/share/nano/*.nanorc\"\ninclude \"/usr/share/nano/extra/*.nanorc\"\n```\n\nVarsayılan sözdizimi vurgulamalarını yerine daha detaylı sözdizimi vurgulamaları için nano-syntax-highlighting veya nano-syntax-highlighting-gitAUR paketlerinden birini kurun ve üstteki ayarların altına şu satırı ekleyin:\n\n```\ninclude \"/usr/share/nano-syntax-highlighting/*.nanorc\"\n```\n\n"
    },
    {
      "title": "Forth",
      "level": 4,
      "content": "Forth vurgulamaları için https://paste.xinu.at/wc17YG/ bağlantısındaki nota göz atın.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 4,
      "content": "https://paste.xinu.at/4ss/ bağlantısındaki metni (Arch'ın eski svntogit sunucusundakine benzer şekilde) /etc/nano/pkgbuild.nanorc dosyasına ekleyin ve yapılandırmalarınız arasına aşağıdaki satırı ekleyin:\n\n```\ninclude \"/etc/nano/pkgbuild.nanorc\"\n```\n\n"
    },
    {
      "title": "Askıya alma",
      "level": 3,
      "content": "Askıya alma varsayılan olarak etkindir, ancak varsayılan tuş kombinasyonu ^Z (Ctrl+Z)'den ^T^Z (Ctrl+T, Ctrl+Z)'ye değiştirilmiştir ve eski tuş kombinasyonu kullanılmak isteniyorsa ilgili değişiklikler yapılmalıdır. Değişiklik yapmak için yerel yapılandırma dosyanızda Key bindings bölümünü kontrol edin.\n\n"
    },
    {
      "title": "Kullanım",
      "level": 2,
      "content": "Klavye kısayol tuşları nano içerisinde görüntülenebilir. Online nano yardım dosyalarını incelemek için nano içerisindeyken Ctrl+g tuşlarına basın. Ayrıca nano Command Manual sayfasında nano'ya dair bütün bir rehbere ulaşabilir veya ek destek alabilirsiniz.\n\nnano kopya kağıdına da göz atabilirsiniz.\n\n"
    },
    {
      "title": "Özel işlevler",
      "level": 3,
      "content": "Sıkça kullanılan işlevler ve bu işlevleri belirten klavye kısayolları nano'nun en alt iki satırında listelenmiştir.\n\nBu kombinasyonlar şu şekilde kullanılabilir:\n\n- ^ temelli kısayollar için Ctrl\n- M- temelli kısayollar için Meta (genellikle Alt) veya Esc\n\n"
    },
    {
      "title": "vi'yi nano ile değiştirme",
      "level": 3,
      "content": "visudo gibi komutlar için varsayılan metin editörünü vi'den nano'ya değiştirmek için, VISUAL ve EDITOR ortam değişkenlerini nano olacak şekilde ayarlayınız, örneğin:\n\n```\nexport VISUAL=nano\nexport EDITOR=nano\n```\n\n"
    },
    {
      "title": "Gaspedilmiş tuş kombinasyonları",
      "level": 3,
      "content": "Bazı pencere yöneticileri, nano ile çakışan tuş kombinasyonlarına sahiptir, örneğin Alt+Enter. Bu kısayolları pencere yöneticinizden kaldırın veya farklı bir tuşa işaretleyin, örneğin Super (mutter, muffin ve marco için dconf) tuşuna işaretleyip pencere yöneticisini tekrar başlatabilirsiniz.\n\n"
    },
    {
      "title": "Ayrıca bakınız",
      "level": 2,
      "content": "- GNU nano - Wikipedia Makalesi\n- GNU nano Homepage - Resmî Site\n- GNU nano Bugs - Hata Raporlama\n- Geliştirilmiş Nano Sözdizimi Vurgulama Dosyaları\n\n"
    }
  ]
}