{
  "title": "Nano",
  "url": "https://wiki.archlinux.org/title/Nano",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GNU nano (or nano) is a text editor which aims to introduce a simple interface and intuitive command options to console based text editing. nano supports features including colorized syntax highlighting, DOS/Mac file type conversions, spellchecking and UTF-8 encoding. nano opened with an empty buffer typically occupies a few MiB of resident memory.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the nano package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The look, feel, and function of nano is typically controlled by way of either command-line arguments, or configuration commands within the file ~/.config/nano/nanorc.\n\nA sample configuration file is installed upon program installation and is located at /etc/nanorc. To customize your nano configuration, first create a local copy at ~/.config/nano/nanorc:\n\n```\n$ cp /etc/nanorc ~/.config/nano/nanorc\n```\n\nProceed to establish the nano console environment by setting and/or unsetting commands within ~/.config/nano/nanorc file.\n\n"
    },
    {
      "title": "Syntax highlighting",
      "level": 3,
      "content": "Nano ships with predefined syntax highlighting rules, defined in /usr/share/nano/*.nanorc and /usr/share/nano/extra/*.nanorc. To enable them, add the following line to your ~/.config/nano/nanorc or to /etc/nanorc:\n\n```\ninclude \"/usr/share/nano/*.nanorc\"\ninclude \"/usr/share/nano/extra/*.nanorc\"\n```\n\nFor syntax highlighting enhancements which replace and expand the defaults, install nano-syntax-highlighting or nano-syntax-highlighting-gitAUR and, additionally to the above setting, also add:\n\n```\ninclude \"/usr/share/nano-syntax-highlighting/*.nanorc\"\n```\n\n"
    },
    {
      "title": "Forth",
      "level": 4,
      "content": "See https://paste.xinu.at/wc17YG/ for Forth highlighting.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 4,
      "content": "Save https://paste.xinu.at/4ss/ (similar to Arch's old svntogit server) to /etc/nano/pkgbuild.nanorc and include it:\n\n```\ninclude \"/etc/nano/pkgbuild.nanorc\"\n```\n\n"
    },
    {
      "title": "Suspension",
      "level": 3,
      "content": "Suspending (i.e. sending nano to the background) is enabled by default, however the default keybind is changed from Ctrl+z to Ctrl+t Ctrl+z and it must be changed if the old behavior is desired. This can be done by checking the Key bindings section.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Shortcuts can be viewed from inside nano. See the nano online help files via Ctrl+g within nano and the nano Command Manual for complete descriptions and additional support.\n\nSee also the cheatsheet for nano.\n\n"
    },
    {
      "title": "Special functions",
      "level": 3,
      "content": "Keyboard shortcuts representing commonly used functions are listed along the bottom two lines of the nano screen.\n\nThey can be toggled by:\n\n- Ctrl for ^ based shortcuts\n- Meta (typically Alt) or Esc for M- based shortcuts\n\n"
    },
    {
      "title": "Replacing vi with nano",
      "level": 3,
      "content": "To replace vi with nano as the default text editor for commands such as visudo, set the VISUAL and EDITOR environment variables, for example:\n\n```\nexport VISUAL=nano\nexport EDITOR=nano\n```\n\n"
    },
    {
      "title": "Hijacked keybindings",
      "level": 3,
      "content": "Some window managers have keybindings that conflict with nano, for example Alt+Enter. Remove or remap them to e.g Super (with dconf for mutter, muffin and marco) and restart the window manager.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- nano (text editor) - Wikipedia Entry\n- GNU nano Homepage - Official Site\n- GNU nano Bugs - Bug Reporting\n- Improved Nano Syntax Highlighting Files\n\n"
    }
  ]
}