{
  "title": "Nano (Русский)",
  "url": "https://wiki.archlinux.org/title/Nano_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GNU nano (или просто \"nano\") — текстовый редактор с простым и интуитивно понятным интерфейсом, включающим в себя основные команды для редактирования текста. Nano поддерживает подсветку синтаксиса, конвертацию файлов DOS/Mac, проверку орфографии и кодировку UTF-8. Программа Nano (с пустым буфером) занимает в оперативной памяти менее 4 Мб.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет nano.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Вид, поведение и функции nano управляются посредством аргументов командной строки или настроек в файле ~/.config/nano/nanorc.\n\nПример конфигурационного файла находится в /etc/nanorc. Чтобы настроить nano, сначала скопируйте данный файл в ~/.config/nano/nanorc:\n\n```\n$ cp /etc/nanorc ~/.config/nano/nanorc\n```\n\nПродолжите настройку nano путём установки и/или отключения команд в файле ~/.config/nano/nanorc.\n\n"
    },
    {
      "title": "Подсветка синтаксиса",
      "level": 3,
      "content": "Nano поставляется с предопределенными правилами подсветки синтаксиса, заданными в /usr/share/nano/*.nanorc. Чтобы включить их, добавьте следующую строку в ~/.config/nano/nanorc или /etc/nanorc:\n\n```\ninclude \"/usr/share/nano/*.nanorc\"\n```\n\nДля получения улучшенной подсветки синтаксиса, расширяющей стандартные возможности, установите nano-syntax-highlighting или nano-syntax-highlighting-gitAUR и добавьте следующий параметр в дополнение к вышеуказанному:\n\n```\ninclude \"/usr/share/nano-syntax-highlighting/*.nanorc\"\n```\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 4,
      "content": "Сохраните https://paste.xinu.at/4ss/ в /etc/nano/pkgbuild.nanorc и включите его:\n\n```\ninclude \"/etc/nano/pkgbuild.nanorc\"\n```\n\n"
    },
    {
      "title": "Forth",
      "level": 4,
      "content": "См. https://paste.xinu.at/wc17YG/ для получения конфигурации подсветки синтаксиса языка программирования Forth.\n\n"
    },
    {
      "title": "Фоновый режим",
      "level": 3,
      "content": "В отличие от большинства интерактивных программ, фоновый режим не включен по умолчанию. Чтобы изменить это, раскомментируйте строку 'set suspend' в /etc/nanorc. Это позволит использовать сочетание клавиш Ctrl+z для отправки nano в фоновый режим.\n\n"
    },
    {
      "title": "Перенос текста",
      "level": 3,
      "content": "До версии 4.0, в отличие от многих текстовых редакторов, nano автоматически вставлял перенос строки. Чтобы изменить это поведение, добавьте следующую строку в ~/.config/nano/nanorc\n\n```\nset nowrap\n```\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Сочетания клавиш можно просмотреть из nano. См. справочные файлы nano онлайн с помощью Ctrl+g из nano или nano Command Manual (англ.) для получения полных описаний и дополнительной поддержки.\n\nСм. также шпаргалку о nano (англ.).\n\n"
    },
    {
      "title": "Специальные функции",
      "level": 3,
      "content": "Сочетания клавиш с наиболее используемыми функциями приведены на двух строках внизу экрана nano.\n\nИх можно переключать следующим образом:\n\n- Ctrl для включения сочетаний клавиш, основанных на ^\n- Meta (обычно Alt) или Esc для включения сочетаний клавиш, основанных на M-\n\n"
    },
    {
      "title": "Замена vi на nano",
      "level": 3,
      "content": "Чтобы заменить vi на nano в качестве стандартного текстового редактора при использовании таких команд, как visudo, задайте переменные окружения VISUAL и EDITOR, например:\n\n```\nexport VISUAL=nano\nexport EDITOR=nano\n```\n\n"
    },
    {
      "title": "Оконный менеджер перехватывает горячие клавиши",
      "level": 3,
      "content": "Некоторые оконные менеджеры используют сочетания клавиш, конфликтующие с nano, например, Alt+Enter. Удалите и переназначьте их, к примеру, на Super (с помощью dconf для mutter, muffin и marco) и перезапустите оконный менеджер.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- nano — статья в Википедии\n- Домашняя страница GNU nano — официальный сайт (англ.)\n- GNU nano Bugs — отчёты об ошибках (англ.)\n- Улучшенные файлы подсветки синтаксиса (англ.)\n\n"
    }
  ]
}