{
  "title": "Nano (Italiano)",
  "url": "https://wiki.archlinux.org/title/Nano_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GNU nano (o nano) è un editor di testo che mira a introdurre un'interfaccia semplice e opzioni di comando intuitive nell'editing di testo basato su console. nano supporta funzioni quali l'evidenziazione colorata della sintassi, la conversione dei tipi di file DOS/Mac, il controllo ortografico e la codifica UTF-8. nano aperto con un buffer vuoto occupa tipicamente pochi MiB di memoria residente.\n\n"
    },
    {
      "title": "Installazione",
      "level": 2,
      "content": "Installare il pacchetto nano.\n\n"
    },
    {
      "title": "Configurazione",
      "level": 2,
      "content": "L'aspetto, la percezione e il funzionamento di nano sono tipicamente controllati tramite argomenti della riga di comando o comandi di configurazione all'interno del file ~/.config/nano/nanorc.\n\nUn file di configurazione di esempio viene installato al momento dell'installazione del programma e si trova in /etc/nanorc. Per personalizzare la configurazione di nano, creare prima una copia locale in ~/.config/nano/nanorc:\n\n```\n$ cp /etc/nanorc ~/.config/nano/nanorc\n```\n\nProcedere alla creazione dell'ambiente della console nano impostando e/o disattivando i comandi all'interno del file ~/.config/nano/nanorc.\n\n"
    },
    {
      "title": "Evidenziazione della sintassi",
      "level": 3,
      "content": "Nano viene fornito con regole predefinite di syntax highlighting, definite in /usr/share/nano/*.nanorc e /usr/share/nano/extra/*.nanorc. Per abilitarli, aggiungere la seguente riga al proprio ~/.config/nano/nanorc o a /etc/nanorc:\n\n```\ninclude \"/usr/share/nano/*.nanorc\"\ninclude \"/usr/share/nano/extra/*.nanorc\"\n```\n\nPer i miglioramenti dell'evidenziazione della sintassi che sostituiscono ed espandono le impostazioni predefinite, installare nano-syntax-highlighting o nano-syntax-highlighting-gitAUR e, oltre all'impostazione precedente, aggiungere anche:\n\n```\ninclude \"/usr/share/nano-syntax-highlighting/*.nanorc\"\n```\n\n"
    },
    {
      "title": "Forth",
      "level": 4,
      "content": "Vedere https://paste.xinu.at/wc17YG/ per l'evidenziazione di Forth.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 4,
      "content": "Salvare https://paste.xinu.at/4ss/ (simile al vecchio server svntogit di Arch) in /etc/nano/pkgbuild.nanorc e includerlo:\n\n```\ninclude \"/etc/nano/pkgbuild.nanorc\"\n```\n\n"
    },
    {
      "title": "Sospensione",
      "level": 3,
      "content": "La sospensione (cioè l'invio di nano in background) è abilitata per impostazione predefinita, tuttavia il keybind predefinito è cambiato da Ctrl+z a Ctrl+t. Se si vuole mantenere il vecchio comportamento Ctrl+z deve essere cambiato. Questo può essere fatto controllando la sezione Key bindings.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Le scorciatoie possono essere visualizzate dall'interno di nano. Si vedano i file di aiuto in linea di nano tramite Ctrl+g all'interno di nano e il nano Command Manual per descrizioni complete e ulteriore supporto.\n\nSi veda anche il cheatsheet per nano.\n\n"
    },
    {
      "title": "Funzioni speciali",
      "level": 3,
      "content": "Le scorciatoie da tastiera che rappresentano le funzioni più utilizzate sono elencate lungo le due righe inferiori della schermata di nano.\n\nPossono essere attivate con:\n\n- Ctrl per le scorciatoie basate su ^\n- Meta (tipicamente Alt) o Esc per le scorciatoie basate su M-.\n\n"
    },
    {
      "title": "Sostituzione di vi con nano",
      "level": 3,
      "content": "Per sostituire vi con nano come editor di testo predefinito per comandi come visudo, impostare le variabili VISUAL e EDITOR environment variables, ad esempio:\n\n```\nexport VISUAL=nano\nexport EDITOR=nano\n```\n\n"
    },
    {
      "title": "Keybindings dirottati (Hijacked keybindings)",
      "level": 3,
      "content": "Alcuni gestori di finestre hanno dei keybindings che entrano in conflitto con nano, ad esempio Alt+Enter. Rimuoveteli o rimappateli, ad esempio, a Super. (con dconf per mutter, muffin e marco) e riavviare il gestore di finestre.\n\n"
    },
    {
      "title": "Vedi anche...",
      "level": 2,
      "content": "- Nano (editor) - Voce di Wikipedia\n- GNU nano Homepage - Sito ufficiale\n- GNU nano Bugs - Segnalazione di bug\n- Miglioramento dei file di evidenziazione della sintassi di Nano\n\n"
    }
  ]
}