{
  "title": "Nano (Português)",
  "url": "https://wiki.archlinux.org/title/Nano_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GNU nano (ou nano) é um editor de texto que visa introduzir uma interface simples e opções de comando intuitivas para edição de texto baseada em console. nano suporta recursos incluindo realce de sintaxe colorido, conversões de tipo de arquivo DOS/Mac, verificação ortográfica e codificação UTF-8. nano aberto com um buffer vazio normalmente ocupa menos de 4 MB de memória residente.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote nano.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "A aparência, a funcionalidade e a função do nano são normalmente controladas por meio de argumentos de linha de comando ou comandos de configuração no arquivo ~/.config/nano/nanorc.\n\nUm arquivo de configuração de amostra é instalado durante a instalação do programa e está localizado em /etc/nanorc. Para personalizar sua configuração nano, primeiro crie uma cópia local em ~/.config/nano/nanorc:\n\n```\n$ cp /etc/nanorc ~/.config/nano/nanorc\n```\n\nProssiga para estabelecer o ambiente do console nano configurando e/ou desativando comandos no arquivo ~/.config/nano/nanorc.\n\n"
    },
    {
      "title": "Realce de sintaxe",
      "level": 3,
      "content": "O Nano vem com regras predefinidas de realce de sintaxe, definidas em /usr/share/nano/*.nanorc e /usr/share/nano/extra/*.nanorc. Para habilitá-los, adicione a seguinte linha ao ~/.config/nano/nanorc ou ao /etc/nanorc:\n\n```\ninclude \"/usr/share/nano/*.nanorc\"\ninclude \"/usr/share/nano/extra/*.nanorc\"\n```\n\nPara melhorias no realce de sintaxe que substituem e expandem as configurações padrão, instale nano-syntax-highlighting ou nano-syntax-highlighting-gitAUR e, adicionalmente à configuração acima, também adicionar:\n\n```\ninclude \"/usr/share/nano-syntax-highlighting/*.nanorc\"\n```\n\n```\n# sed -i 's/icolor brightnormal/icolor normal/g' /usr/share/nano-syntax-highlighting/nanorc.nanorc\n```\n\n"
    },
    {
      "title": "Forth",
      "level": 4,
      "content": "Veja https://paste.xinu.at/wc17YG/ para realce de Forth.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 4,
      "content": "Salve https://paste.xinu.at/4ss/ (semelhante ao antigo do servidor svntogit do Arch) em /etc/nano/pkgbuild.nanorc e inclua-o:\n\n```\ninclude \"/etc/nano/pkgbuild.nanorc\"\n```\n\n"
    },
    {
      "title": "Suspensão",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nAo contrário da maioria dos programas interativos, a suspensão não está habilitada por padrão. Para alterar isso, remova o comentário da linha set suspendable em /etc/nanorc. Isso permitirá que você use as teclas Ctrl+z para enviar o nano para segundo plano.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "Os atalhos podem ser visualizados de dentro do nano. Consulte os arquivos de ajuda on-line do nano via Ctrl+g dentro do nano e o Command Manual do nano para descrições completas e suporte adicional.\n\nVeja também a folha de dicas para nano.\n\n"
    },
    {
      "title": "Funções especiais",
      "level": 3,
      "content": "Os atalhos de teclado que representam funções comumente usadas estão listados nas duas linhas inferiores da tela nano.\n\nEles podem ser alternados por:\n\n- Ctrl para atalhos baseados em ^\n- Meta (geralmente Alt) ou Esc para atalhos baseados em M-\n\n"
    },
    {
      "title": "Substituir vi com nano",
      "level": 3,
      "content": "Para substituir vi por nano como editor de texto padrão para comandos como visudo, defina as variáveis de ambiente VISUAL e EDITOR, por exemplo:\n\n```\nexport VISUAL=nano\nexport EDITOR=nano\n```\n\n"
    },
    {
      "title": "Atalhos de teclado sequestradas",
      "level": 3,
      "content": "Alguns gerenciadores de janela possuem atalhos de teclado que entram em conflito com o nano, por exemplo Alt+Enter. Remova ou remapeie-os para, por exemplo, Super (com dconf para mutter, muffin e marco) e reinicie o gerenciador de janelas.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- nano (editor de texto) - Página na Wikipédia\n- GNU nano Homepage - Site oficial\n- GNU nano Bugs - Relatório de bugs\n- Arquivos de realce de sintaxe melhorada para o Nano\n\n"
    }
  ]
}