{
  "title": "Ncmpcpp (Español)",
  "url": "https://wiki.archlinux.org/title/Ncmpcpp_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-02-19** \n\nArtículos relacionados\n\n- Music Player Daemon (Español)\n\nNcmpcpp es un cliente de mpd (compatible con mopidy) con una interfaz de usuario muy similar a la de ncmpc, pero que proporciona nuevas características útiles como el soporte de expresiones regulares para búsquedas en la biblioteca, formato de canciones extendido, filtrado de elementos, la posibilidad de ordenar las listas de reproducción y un navegador de archivos local.\n\nPara utilizarlo, un servidor de mpd funcional debe estar presente en el sistema ya que ncmpcpp/mpd trabajan juntos en una relación cliente/servidor.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale desde los repositorios oficiales.\n\n"
    },
    {
      "title": "Configuración básica",
      "level": 2,
      "content": "La interfaz gráfica de usuario de \"ncmpcpp\" es altamente personalizable. Edite ~/.ncmpcpp/config a su gusto. Si, después de la instalación, no se ha creado ~/.ncmpcpp/config, simplemente copie el ejemplo de configuración, cambie los permisos y edite como mínimo las tres opciones de configuración siguientes:\n\n- mpd_host - Should point to the host on which mpd resides, can be \"localhost\", \"127.0.0.1\" or \"::1\" if on the same machine. To connect with a password, write \"password@host\"\n- mpd_port - The default of mpd should be \"6600\"\n- mpd_music_dir - The same directory value as specified in \"music_directory\" in mpd.conf\n\nComo referencia, consulte los siguientes ejemplos:\n\n- Ejemplo de configuración en /usr/share/doc/ncmpcpp/config.\n- Muestra tu .ncmpcpp/config\n\n"
    },
    {
      "title": "Permitir la visualización",
      "level": 2,
      "content": "Para la visualización, añada unas líneas en /etc/mpd.conf para permitir la generación de datos fast Fourier transform:\n\n```\naudio_output {\n    type                    \"fifo\"\n    name                    \"my_fifo\"\n    path                    \"/tmp/mpd.fifo\"\n    format                  \"44100:16:2\"\n}\n```\n\nHay que añadir líneas adicionales a ~/.ncmpcpp/config\n\nvisualizer_fifo_path = \"/tmp/mpd.fifo\"\n\n```\nvisualizer_output_name = \"my_fifo\"\nvisualizer_sync_interval = \"30\" \nvisualizer_in_stereo = \"yes\"\nvisualizer_type = \"spectrum\"\nvisualizer_look = \"+|\"\n```\n\n- visualizer_sync_interval - Establece el intervalo para sincronizar el visualizador con la salida de audio de mpd. Debe ser mayor de 10 para evitar tratar de sincronizar con demasiada frecuencia, algo que congela la visualización. El valor recomendado es 30, pero puede reducirse si el audio se aleja en apariencia con la visualización.\n- tipo_visualizer - Configure la visualización a un analizador o a un formulario de spectrum/{{ic|ellipse}/wave_filled.\n- visualizer_look - Establece la apariencia del visualizador (el string debe tener exactamente dos caracteres de longitud: el primero es para la onda y el segundo para el espectro de spectrum, wave_filled y ellipse).\n\n"
    },
    {
      "title": "Ejecutar ncmpcpp",
      "level": 3,
      "content": "Ejecute ncmpcpp en una shell:\n\n```\n$ ncmpcpp\n```\n\n"
    },
    {
      "title": "Diferentes puntos de vista",
      "level": 3,
      "content": "Lista parcial de opiniones dentro de ncmpcpp:\n\n- 1 - Lista de reproducción actual\n- 2 - Navegador del sistema de archivos\n- 3 - Búsqueda en la base de datos\n- 4 - Biblioteca\n- 5 - Editor de listas de reproducción\n- 6 - Editor de etiquetas (muy poderoso)\n- 7 - Selector de salida\n- 8 - Visualizador de música\n- = - Reloj\n- F1 - Ayuda\n\n"
    },
    {
      "title": "Otras claves de UI",
      "level": 3,
      "content": "- q - Salir\n- f - Buscar hacia adelante\n- b - Buscar hacia atrás\n- \\ - Cambiar entre la visión clásica y la alternativa\n- # - Mostrar la tasa de bits del archivo\n- i - Mostrar información de la canción\n- I - Mostrar información del artista (guardada en ~/.ncmpcpp/artists/ARTIST.txt)\n- L - Mezclar entre las bases de datos líricas disponibles\n- l - Recuperar las letras de la canción actual Mostrar/esconder las letras\n- > - Próxima pista\n- < - Pista anterior\n- p - Reproducir/Pausar\n- + - Aumentar el volumen 2%\n- -} - Disminuir el volumen 2%\n\n"
    },
    {
      "title": "Modos de reproducción",
      "level": 3,
      "content": "Observe el panel de control en la parte superior derecha; se muestra en modo alternativo:\n\n```\n1:40/5:59 1082 kbps                            ──┤ La Gitana ├──                                       Vol: 98%\n[playing]                       Los Planetas - Zona temporalmente autónoma (2017)                     [-z-c--]\n```\n\nY ahora en el modo clásico:\n\n```\n─────────────────────────────────────────────────────────────────────────────────────────────────────────[zc]─\n```\n\nEsto corresponde a los modos de reproducción. Ordenados de izquierda a derecha, son:\n\n- r - modo bucle [r-----] (Repite la lista de reproducción después de llegar al final)\n- z - modo aleatorio [-z----]\n- y - modo uno solo [--s---] (Sólo toca una pista y luego se detiene)\n- R - modo consumido [---c--] (Elimina la pista actual de la lista de reproducción después de llegar al final)\n- x - modo crossfade [----x-]\n\nEl \"-\" final sólo se activa cuando el usuario fuerza una actualización a la base de datos a través de u.\n\nPara hacer bucle de una sola pista, active los modos simple y repetido.\n\n"
    },
    {
      "title": "Remapear las claves",
      "level": 3,
      "content": "Una lista de los enlaces de teclas y sus respectivas funciones está disponible desde el mismo npmpcpp pulsando F1. Los usuarios pueden reasignar cualquiera de las claves por defecto simplemente copiando /usr/share/doc/ncmpcpp/bindings a ~/.ncmpcpp/ y editándolo.\n\n"
    },
    {
      "title": "Etiquetas automáticas de nombre de archivo y viceversa",
      "level": 3,
      "content": "En el Editor de Etiquetas puede seleccionar un directorio con música y luego seleccionar la opción Nombre del archivo en la sección del medio. Esto abre una pequeña ventana con dos opciones: Obtener etiquetas del nombre de archivo y renombrar archivos. Si elige Obtener etiquetas del nombre del archivo, se muestra un popup con dos ventanas. En el lado izquierdo puede introducir un patrón que extrae la información seleccionada de los nombres de archivo. También puede pulsar Previsión para ver cómo sería el resultado. En el lado derecho se puede ver el texto que contiene todas las posibles palabras clave a utilizar para la extracción.\n\nUn ejemplo sencillo sería el patrón: %a - %t. Si sus archivos se nombran de acuerdo con este patrón (Artista - Título), entonces este patrón extraería esta información y establecería las etiquetas para el archivo.\n\nLa otra opción Renombrar archivos hace exactamente lo contrario. Toma las Etiquetas de los archivos de audio y crea un nombre de archivo a partir de ellos.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "dotshare.it configurations\n\n"
    }
  ]
}