{
  "title": "Neovim (Español)",
  "url": "https://wiki.archlinux.org/title/Neovim_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-08-20** \n\nNeovim es un fork de Vim que apunta a mejorar la experiencia del usuario, el ecosistema de extensiones y las interfaces gráficas.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale neovim con pacman.\n\nEs también posible instalar una de las interfaces gráficas (varias están en los repositorios oficiales o en la AUR).\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "La configuración local de usuario de Nvim está localizada en $XDG_CONFIG_HOME/nvim/init.vim, que por defecto viene a ser ~/.config/nvim/init.vim. De existir, el archivo global de configuración es cargado desde $XDG_CONFIG_DIRS/nvim/sysinit.vim (por defecto /etc/xdg/nvim/sysinit.vim), de lo contrario, se carga desde /usr/share/nvim/sysinit.vim, archivo que no debe ser editado por el usuario. [1]. Por defecto, la configuración global no existe. Si usted ha creado la configuración, es probable que necesite tenerla para servirse de otras funcionalidades, como la instalación de extensiones de Vim a través de pacman.\n\nNvim es compatible con la mayoría de las opciones de Vim. Sin embargo, hay opciones específicas de Nvim. Para una lista completa, visite el archivo de ayuda de Neovim.\n\nEl directorio de datos de Nvim está ubicado en ~/.local/share/nvim/ y contiende intercambio (swap) de archivos abiertos, el archivo ShaDa (datos compartidos) y el directorio de extensiones.\n\n"
    },
    {
      "title": "Migrando desde Vim",
      "level": 3,
      "content": "Si usted desea migrar desde Vim, simplemente copie ~/.vimrc en ~/.config/nvim/init.vim. De estar disponibles, también copie ~/.vim/autoload/ en ~/.local/share/nvim/site/autoload/.\n\n"
    },
    {
      "title": "Compartiendo configuración entre Vim y Nvim",
      "level": 3,
      "content": "Neovim usa $XDG_CONFIG_HOME/nvim en lugar de ~/.vim como su ruta de configuración principal y $XDG_CONFIG_HOME/nvim/init.vim en lugar de ~/.vimrc como su archivo de configuración principal.\n\nSi usted desea continuar utilizando Vim y su configuración en Nvim, visite nvim-a-vim o escriba el comando :help nvim-from-vim.\n\n"
    },
    {
      "title": "Cargar extensiones de Vim",
      "level": 4,
      "content": "Si usted desea utilizar extensiones, definiciones sintácticas u otras extensiones que están instaladas para Vim, puede agregar la ruta del runtime por defecto en rtp. Por ejemplo, usted puede correr este comando y agregarlo a la configuración de Nvim.\n\n```\nset rtp^=/usr/share/vim/vimfiles/\n```\n\n"
    },
    {
      "title": "Reemplazando vi y vim con nvim",
      "level": 3,
      "content": "Designar $VISUAL y $EDITOR environment variables (Español) debería ser suficiente en la mayoría de los casos.\n\nPuede que algunas aplicaciones forcen vi y vim como sus editores por defecto. En ese caso instale neovim-symlinksAUR o neovim-drop-inAUR.\n\n"
    },
    {
      "title": "Enlazar simbólicamente init.vim a .vimrc",
      "level": 3,
      "content": "Como nvim es completamente compatible con el estándar de vim, usted puede enlazar nvim/init.vim hacia su viejo .vimrc para conservar la configuración:\n\n```\n$ ln -s ~/.vimrc ~/.config/nvim/init.vim\n```\n\nSi usted quiere líneas específicas por versión, puede usar un bloque if en su .vimrc configuración:\n\n```\nif has('nvim')\n    \" Comandos específicos de Nvim\nelse\n    \" Comandos estándar de Vim\nendif\n```\n\n"
    },
    {
      "title": "Añadiendo soporte true color",
      "level": 3,
      "content": "Los READMEs de de este proyecto explican cómo añadir soporte de 24-bits \"True Color\" al resaltado sintáctico y revisar cómo luce en tiempo real. Viene con el resaltado del autor para C++.\n\n"
    },
    {
      "title": "El cursor pierde la posición en que estaba al cerrarse",
      "level": 3,
      "content": "Visite neovim FAQ.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Repositorio en Github\n- Wiki en Github\n\n"
    }
  ]
}