{
  "title": "Neovim (Português)",
  "url": "https://wiki.archlinux.org/title/Neovim_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O Neovim é um fork do Vim com o objetivo de melhorar a experiência do usuário, plugins e GUIs.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote neovim.\n\nTambém é possível instalar um das muitas GUIs e outros projetos relacionados (EN) (a maioria deles está no repositório oficial ou no AUR).\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "O arquivo de configuração específico do usuário do Nvim está localizado em $XDG_CONFIG_HOME/nvim/init.vim, por padrão ~/.config/nvim/init.vim. O arquivo de configuração global é carregado a partir do $XDG_CONFIG_DIRS/nvim/sysinit.vim (por padrão /etc/xdg/nvim/sysinit.vim) se existir, ou se não existir, o /usr/share/nvim/sysinit.vim que não deve ser editado pelo usuário. [1] Por padrão, o antigo arquivo de configuração global não existe. Se você criar o arquivo anterior, poderá desejar que ele seja fonte do último se ainda desejar a funcionalidade que ele fornece, o que permite que os pacotes vim instalados pelo pacman funcionem com o Nvim.\n\nO Nvim é compatível com a maioria das opções do Vim, no entanto, existem opções específicas para o Nvim. Para obter uma lista completa das opções do Nvim, consulte o Neovim ajuda (EN).\n\nO diretório de dados do Nvim está localizado em ~/.local/share/nvim/ e contém swap para arquivos abertos, o arquivo ShaDa (Shared Data), e o diretório do site para plugins.\n\n"
    },
    {
      "title": "Migrando do Vim",
      "level": 3,
      "content": "Se você deseja migrar sua configuração existente do Vim para o Nvim, basta copiar o seu ~/.vimrc para ~/.config/nvim/init.vim. Se aplicável, copie o conteúdo do ~/.vim/autoload/ para o ~/.local/share/nvim/site/autoload/.\n\n"
    },
    {
      "title": "Configuração compartilhada entre Vim e Nvim",
      "level": 3,
      "content": "O Neovim usa $XDG_CONFIG_HOME/nvim ao invés de ~/.vim como seu principal diretório de configuração e $XDG_CONFIG_HOME/nvim/init.vim ao invés de ~/.vimrc como seu principal arquivo de configuração.\n\nSe você deseja continuar usando o Vim e deseja criar sua configuração existente do Vim no Nvim, consulte o nvim-from-vim ou o comando do neovim :help nvim-from-vim.\n\n"
    },
    {
      "title": "Carregando complementos do vim",
      "level": 4,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nSe você deseja usar plug-ins, definições de sintaxe ou outros addons instalados para o vim, é possível adicionar o caminho de tempo de execução do vim padrão ao neovim, adicionando-o ao diretório rtp. Por exemplo, você pode executar o seguinte no nvim ou adicioná-lo à sua configuração do neovim:\n\n```\nset rtp^=/usr/share/vim/vimfiles/\n```\n\n"
    },
    {
      "title": "Substituindo Vi e Vim por NeoVim",
      "level": 3,
      "content": "As variáveis $VISUAL e $EDITOR environment variables deve ser suficiente na maioria dos casos.\n\nAlguns aplicativos podem codificar vi ou vim como editor padrão, para usar neovim em seu lugar, instale neovim-symlinksAUR ou neovim-drop-inAUR.\n\n"
    },
    {
      "title": "Ligando o init.vim para .vimrc",
      "level": 3,
      "content": "Como o neovim é compatível principalmente com o vim padrão, você pode vincular o nvim/init.vim para o seu antigo .vimrc para manter as opções de configuração antigas:\n\n```\n$ ln -s ~/.vimrc ~/.config/nvim/init.vim\n```\n\nSe você deseja que algumas linhas sejam específicas para cada versão, você pode usar um if para bloquear o seu arquivo .vimrc:\n\n```\nif has('nvim')\n    \" Neovim specific commands\nelse\n    \" Standard vim specific commands\nendif\n```\n\n"
    },
    {
      "title": "Adicionando suporte de cores verdadeiras ao neovim",
      "level": 3,
      "content": "Os READMEs desse projeto (EN) explica como adicionar o suporte \"True Color\" de 24 bits ao realce da sintaxe e como usar um seletor de cores para ver como fica em tempo real. Vem com o destaque da sintaxe do autor (se instalado) para C++.\n\n"
    },
    {
      "title": "O cursor não é restaurado para o estado anterior após a saída",
      "level": 3,
      "content": "Se depois de sair do cursor neovim ainda estiver piscando, veja a solução em FAQ neovim (EN).\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Repositório do Github\n- Wiki Github\n\n"
    }
  ]
}