{
  "title": "Nestopia",
  "url": "https://wiki.archlinux.org/title/Nestopia",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "An emulator is a program which serves to replicate the functions of another platform or system so as to allow applications and games to be run in environments they were not programmed for.\n\nNote: **illegal** \n\n"
    },
    {
      "title": "Multi-system",
      "level": 2,
      "content": "- ares — Multi-system emulator by Near with experimental Nintendo 64 and PlayStation support.\n\n- BizHawk — A multi-system emulator on .NET. Features rerecording and tools for TASing. (Mono runtime)\n\n- higan — Multisystem emulator focusing on accuracy, supporting SNES, NES, GB, GBC, GBA.\n\n- Fightcade — The best way to play your favorite retro games with or against any other player in the world.\n\n- FinalBurn Neo — Emulator for Arcade Games & Select Consoles. Based on FinalBurn and MAME.\n\n- GNOME Games — GNOME application to browse your local video games library and to easily pick and play a game from it. It is also a frontend to libretro. Part of gnome-extra.\n\n- MAME — Multiple Arcade Machine Emulator.\n\n- mednafen — Command-line driven multisystem emulator.\n\n- RetroArch — Frontend to libretro (emulation library, using modified versions of existing emulators as plugins).\n\n"
    },
    {
      "title": "Nintendo",
      "level": 2,
      "content": "- bsnes — Super Nintendo emulator focusing on performance, features, and ease of use.\n\n- Cemu — Wii U emulator.\n\n- DeSmuME — Nintendo DS emulator.\n\n- Dolphin — Very capable GameCube and Wii emulator.\n\n- FCEUX — NTSC and PAL 8 bit Nintendo/Famicom emulator that is an evolution of the original FCE Ultra emulator. It is accurate, compatible and actively maintained.\n\n- GBCC — A Game Boy Color emulator written in C\n\n- GBE+ — DMG/GBC/GBA emulator and experimental NDS emulator.\n\n- GearBoy — GameBoy and GameBoy Color emulator.\n\n- melonDS — Nintendo DS emulator.\n\n- Mesen — Multi-system emulator (NES, SNES, Game Boy and PC Engine)\n\n- mGBA — A Nintendo Gameboy Advance Emulator focusing on both speed and accuracy.\n\n- Mupen64Plus — Highly compatible Nintendo 64 emulator with plugin system.\n\n- NanoBoy Advance — Accuracy-focused Game Boy Advance emulator.\n\n- Nestopia — Very accurate NES emulator.\n\n- NooDS — A (hopefully!) speedy NDS emulator.\n\n- puNES — Qt-based Nintendo Entertaiment System emulator and NSF/NSFe Music Player\n\n- SameBoy — An accuracy-focused Game Boy/Game Boy Color emulator\n\n- SkyEmu — Game Boy, Game Boy Color, and Game Boy Advanced Emulator.\n\n- Snes9x — Portable, freeware Super Nintendo Entertainment System (SNES) emulator.\n\n- Suyu — Actively developed Switch emulator, fork of yuzu.\n\n- Visual Boy Advance — Game Boy emulator with Game Boy Advance, Game Boy Color, and Super Game Boy support.\n\n- ZSNES — Highly compatible Super Nintendo emulator.\n\n"
    },
    {
      "title": "Sony",
      "level": 2,
      "content": "- DuckStation — DuckStation is an simulator/emulator of the Sony PlayStation(TM) console, focusing on playability, speed, and long-term maintainability.\n\n- ePSXe — Emulator for the PlayStation video game console for x86-based PC hardware.\n\n- PCSXR — PlayStation emulator; Debian fork of the abandoned original PCSX\n\n- PCSX2 — PlayStation 2 emulator. It is still being maintained and developed. It requires BIOS files.\n\n- PPSSPP — PlayStation Portable emulator.\n\n- Vita3K — Experimental PlayStation Vita emulator.\n\n- RPCS3 — Experimental open-source Sony PlayStation 3 emulator and debugger.\n\n"
    },
    {
      "title": "Sega",
      "level": 2,
      "content": "- BlastEm — Genesis and Sega CD Emulator focused on accuracy.\n\n- FlyCast — Sega Dreamcast Emulator\n\n- Kega Fusion — An emulator of classic Sega consoles like Genesis/Mega Drive, Master System, Sega CD. Game Gear, 32X.\n\n- Kronos — Hardware-accelerated Sega Saturn emulator forked from uoYabause.\n\n- Yabause — A Sega Saturn emulator.\n\n"
    },
    {
      "title": "Other consoles",
      "level": 2,
      "content": "- Stella — Atari 2600 VCS emulator.\n\n- Supermodel — A Sega Model 3 Arcade Emulator\n\n- Virtual Jaguar — A portable Atari Jaguar emulator\n\n- xemu — An original Xbox emulator (fork of XQEMU).\n\n- Xenia — Xenia is an experimental emulator for the Xbox 360.\n\n"
    },
    {
      "title": "Personal computers",
      "level": 2,
      "content": "- 86Box — Emulator of x86-based machines based on PCem.\n\n- ARAnyM — Atari Running on Any Machine\n\n- Atari++ — An emulator of Atari 400/800/400XL/800XL/130XE/5200\n\n- Atari800 — An emulator of the Atari 800/800XL/130XE/5200 with various extensions\n\n- Basilisk II — Open Source 68k Macintosh Emulator\n\n- BeebEM — BBC Micro Emulator\n\n- box64 — Linux Userspace x86_64 Emulator with a twist\n\n- CaPriCe32 — An emulator of the Amstrad CPC 8bit home computer range (CPC 464, 664, 6128)\n\n- CLK — A latency hating emulator for 8 and 16 bit platforms\n\n- Denise — Highly accurate C64/Amiga emulator\n\n- DOSBox — Open-source DOS emulator which primarily focuses on running DOS Games.\n\n- DOSEmu — Open-source DOS emulator.\n\n- EasyRPG Player — RPG Maker 2000/2003 interpreter.\n\n- fMSX — Portable MSX Emulator.\n\n- FS-UAE — Amiga Emulator.\n\n- Fuse-emulator — ZX Spectrum emulator.\n\n- Hatari — An Atari ST and STE emulator.\n\n- LinApple — Apple 2e emulator\n\n- Mini vMac — a miniature early Macintosh emulator\n\n- OpenMSX — The MSX emulator that aims for perfection.\n\n- PCem — Emulator for various IBM PC computers and clones.\n\n- ScummVM — Virtual machine for old school adventures.\n\n- Vice — Versatile Commodore 8-bit Emulator.\n\n- X Neko Project II — PC-9801 emulator.\n\n- ZEsarUX — A Zx80/Zx81/Z88, Zx Spectrum 16/48/128/+2/+2A and ZX-Uno emulator with ULAPlus support\n\n"
    },
    {
      "title": "Fantasy computers",
      "level": 2,
      "content": "- Lowres-NX — Open source fantasy game console and Basic interpreter.\n\n- microw8 — WebAssembly based fantasy console.\n\n- Pico8 — A fantasy console for making, sharing and playing tiny games and other computer programs that supports the Lua language (multiple architectures supported, but binary only).\n\n- Pixel Vision 8 — 8-bit fantasy game console that supports the Lua language.\n\n- TIC-80 — A GPL-licensed fantasy computer for making, playing and sharing tiny games that supports multiple languages.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Emulation General wiki\n- Wikipedia:List of video game console emulators\n\n"
    }
  ]
}