{
  "title": "Netboot (Lietuviškai)",
  "url": "https://wiki.archlinux.org/title/Netboot_(Lietuvi%C5%A1kai)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Netboot atvaizdai tai ypač maži (<1MB) atvaizdai, kurie gali būti naudojami parsisiųsti naujausio leidimo Arch Linux, sistemos įkrovimo metu. Netboot atvaizdo atnaujinti nebūtina, naujausias leidimas bus prieinamas automatiškai. Netboot atvaizdus galima parsisiųsti iš Arch Linux tinklalapio.\n\n"
    },
    {
      "title": "BIOS",
      "level": 2,
      "content": "Norint netboot naudoti ant kompiuterio su BIOS, jums reikės ipxe.lkrn arba ipxe.pxe atvaizdo.\n\n"
    },
    {
      "title": "ipxe.lkrn naudojimas",
      "level": 3,
      "content": "ipxe.lkrn atvaizdas gali būti užkraunamas kaip Linux branduolys. Bet kuris Linux įkroviklis (kaip Grub ar syslinux) gali būti panaudotas užkrauti jį iš kietojo disko, CD ar USB laikmenos.\n\nAtvaizdą galima išbandyti su qemu naudojantis sekančia komanda:\n\n```\nqemu-system-x86_64 -enable-kvm -m 1G -kernel ipxe.lkrn\n```\n\n"
    },
    {
      "title": "ipxe.pxe naudojimas",
      "level": 3,
      "content": "ipxe.pxe atvaizdas yra PXE atvaizdas. Jis gali būti grandiniškai užkrautas iš egzistuojančios PXE aplinkos. Tai leidžia sukonfigūruoti DHCP serverį taip kad kraunant iš tinklo visados bus užkraunama Arch Linux netboot.\n\n"
    },
    {
      "title": "UEFI",
      "level": 2,
      "content": "ipxe.efi atvaizdas gali būti naudojamas paleisti Arch Linux netboot UEFI rėžimu. Pailaikoma tik 64 Bit'ų UEFI. ipxe.efi atvaizdas prie įkrovimo pasirinkimų gali būti pridėtas per efibootmgr, grandiniškai užkrautas per systemd-boot ar tiesiogiai paleistas per UEFI apvalkalą.\n\n"
    },
    {
      "title": "Įdiegimas su efibootmgr",
      "level": 3,
      "content": "Pirmiausiai įdiekite efibootmgr paketą, tada parsisiųskite UEFI netboot atvaizdą.\n\nDarant prielaidą, kad jūsų EFI sistemos particija (ESP) yra prijungta po esp, jūs turėtumėte ją perkelti kaip - kartu duodant ir draugišką vardą:\n\n```\n# mkdir esp/EFI/arch_netboot\n# mv ipxe.*.efi esp/EFI/arch_netboot/arch_netboot.efi\n```\n\nTuomet galite sukurti įkrovimo įrašą:\n\n```\n# efibootmgr --create --disk /dev/sda --part 1 --loader /EFI/arch_netboot/arch_netboot.efi --label \"Arch Linux Netboot\"\n```\n\n"
    }
  ]
}