{
  "title": "Network Time Protocol daemon (Русский)",
  "url": "https://wiki.archlinux.org/title/Network_Time_Protocol_daemon_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- NTPSec\n- Chrony\n- Синхронизация времени\n\nNetwork Time Protocol является одним из самых распространённых методов для синхронизации системных часов на GNU/Linux с серверами времени в интернете. Он разработан для смягчения последствий переменной задержки в сети и обычно может поддерживать время с точностью до десятков миллисекунд при синхронизации через интернет. Точность в локальных сетях даже лучше, до одной миллисекунды.\n\nThe NTP Project предоставляет эталонную реализацию протокола, которая называется просто NTP. Эта статья описывает, как установить и запустить демон NTP: как клиент, так и сервер.\n\nСмотрите Синхронизация времени для информации о других реализациях NTP.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет ntp. По умолчанию ntpd работает в режиме клиента и не требует дополнительной настройки. Вы можете перейти к разделу #Использование, если вас устраивает стандартный файл конфигурации Arch. Для настройки сервера смотрите #Режим сервера NTP.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Основной демон ntpd настраивается в файле /etc/ntp.conf. Смотрите ntp.conf(5) для дополнительной информации.\n\n"
    },
    {
      "title": "Подключение к серверам NTP",
      "level": 3,
      "content": "NTP-серверы выстроены в многоуровневую иерархию; уровни называются слоями (англ. strata). Устройства, которые считаются самостоятельными источниками времени, считаются первичными (stratum 0); серверы, непосредственно подключённые к stratum 0 устройствам, считаются источниками stratum 1; серверы, подключенные к stratum 1 серверам, считаются источниками stratum 2 и так далее.\n\nВажно понимать, что слой сервера не может рассматриваться как показатель его точности или надёжности. Обычно для синхронизации пользовательских машин используются stratum 2 серверы. Если вы ещё не знаете, к каким серверам вы собираетесь подключиться, вам следует выбрать пул серверов, расположенный недалеко от вашего местоположения, из списка серверов на pool.ntp.org (альтернативная ссылка).\n\nНачиная с ntp version 4.2.7.p465-2, Arch Linux использует свой собственный стандартный пул NTP-серверов, который предоставляет the NTP Pool Project (смотрите FS#41700). Измените его под свои нужды, например если вы хотите использовать сервера своей страны:\n\n```\n/etc/ntp.conf\n```\n\n```\nserver 0.ru.pool.ntp.org iburst\nserver 1.ru.pool.ntp.org iburst\nserver 2.ru.pool.ntp.org iburst\nserver 3.ru.pool.ntp.org iburst\n```\n\nОпция 'iburst' рекомендуется, с ее помощью посылается шквал пакетов, если не удается установить соединение с сервером с первого раза. Напротив, опцию 'burst' не используйте никогда без особого разрешения, так как Вы можете попасть в \"черный список\".\n\n"
    },
    {
      "title": "Режим сервера NTP",
      "level": 3,
      "content": "При настройке своего NTP-сервера проверьте, что у вас включен orphan mode[устаревшая ссылка 2022-09-22 ⓘ], чтобы в случае пропажи интернета он продолжил обслуживать сеть; включите orphan mode с помощью параметра tos (может настроить до stratum 15), чтобы он никогда не использовался, пока интернет доступен:\n\n```\ntos orphan 15\n```\n\nЗатем определите правила, которые позволят клиентам подключиться к вашему сервису (localhost тоже считается клиентом) с помощью команды restrict; в файле уже должна быть примерно такая строка:\n\n```\nrestrict default nomodify nopeer noquery\n```\n\nОна запрещает всем модифицировать что-либо и предотвращает запрос статуса вашего сервера: nomodify запрещает перенастройку ntpd (через ntpq или ntpdc), а noquery важен для предотвращения дампа статуса ntpd (тоже через ntpq или ntpdc).\n\nМожете также добавить следующие опции:\n\n```\nrestrict default kod nomodify notrap nopeer noquery\n```\n\nЕсли вы хотите изменить что-то из этого, читайте полную документацию по опции \"restrict\" в ntp.conf(5), подробные инструкции по ntp и #Использование.\n\nТеперь нужно указать ntpd, какие подключения к Вашему серверу разрешены; если Вы не конфигурируете сервер NTP, следующей строки будет достаточно:\n\n```\nrestrict 127.0.0.1\n```\n\nЕсли Вы желаете принудительно определить адреса по протоколу IPv6, напишите -6 перед IP-адресом или именем хоста (-4 принудительно устанавливает протокол IPv4), например:\n\n```\nrestrict -6 default kod nomodify notrap nopeer noquery\nrestrict -6 ::1    # ::1 - это 127.0.0.1 в шестой версии протокола IP\n```\n\nНаконец, установите файл-буфер (в котором будет находиться погрешность часов системы) и журнал (лог):\n\n```\ndriftfile /var/lib/ntp/ntp.drift\nlogfile /var/log/ntp.log\n```\n\nПримерная конфигурация выглядит так:\n\n```\n/etc/ntp.conf\n```\n\n```\nserver 0.ru.pool.ntp.org iburst\nserver 1.ru.pool.ntp.org iburst\nserver 2.ru.pool.ntp.org iburst\nserver 3.ru.pool.ntp.org iburst\ntos orphan 15\n\nrestrict default kod nomodify notrap nopeer noquery\nrestrict -6 default kod nomodify notrap nopeer noquery\n\nrestrict 127.0.0.1\nrestrict -6 ::1  \n\ndriftfile /var/lib/ntp/ntp.drift\nlogfile /var/log/ntp.log\n```\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "По умолчанию пакет настроен на режим клиента и использует отдельные пользователя и группу для избавления от root-прав. При ручном запуске через консоль всегда указывайте опцию -u:\n\n```\n# ntpd -u ntp:ntp\n```\n\nОпция -u используется в двух systemd-службах. Они также используют опцию -g, которая отключает порог (panic-gate). Таким образом они будут синхронизировать время даже если время на NTP-серверах очень сильно отличается от локального системного времени.\n\nBoth services are tied to the system's resolver, and will start synchronizing when an active network connection is detected.\n\n"
    },
    {
      "title": "Запуск ntpd при загрузке системы",
      "level": 3,
      "content": "Включите службу ntpd.service. Смотрите также #Запуск в chroot.\n\nИспользуйте ntpq для просмотра списка настроенных пиров и статуса синхронизации:\n\n```\n$ ntpq -p\n```\n\nЗадержка, смещение и джиттер должны быть отличны от нуля. Серверы, с которыми синхронизируется ntpd, отмечены звёздочкой. Может потребоваться несколько минут, прежде чем ntpd выберет сервер для синхронизации; попробуйте проверить через 17 минут (1024 секунды).\n\n"
    },
    {
      "title": "Синхронизация один раз при загрузке",
      "level": 3,
      "content": "В качестве альтернативы включите службу ntpdate.service для однократной синхронизации (опция -q) в non-forking режиме (опция -n) при загрузке системы вместо запуска постоянно работающего демона в фоне. Этот метод не рекомендуется на серверах и в целом на машинах, которые работают без перезагрузки более нескольких дней.\n\nЕсли синхронизированное время нужно записать в аппаратные часы компьютера, создайте drop-in файл для этой службы:\n\n```\n/etc/systemd/system/ntpdate.service.d/hwclock.conf\n```\n\n```\n[Service]\nExecStart=/usr/bin/hwclock -w\n```\n\n"
    },
    {
      "title": "Запуск ntpd при подключении сети",
      "level": 3,
      "content": "ntpd может быть запущен вашим менеджером сети, чтобы демон запускался только при появлении интернета.\n\nДобавьте следующие строки в ваш профиль netctl:\n\n```\nExecUpPost='/usr/bin/ntpd || true'\nExecDownPre='killall ntpd || true'\n```\n\nntpd можно включать/выключать вместе со стартом сетевого соединения с помощью диспетчерских скриптов. Пакет networkmanager-dispatcher-ntpdAUR устанавливает скрипты, настроенные на запуск и остановку ntpd.service одновременно с соединением.\n\nKDE может использовать NTP (ntp должен быть установлен) путём нажатия правой кнопкой мыши по часам и выбору синхронизации даты/времени. Однако при этлм демон ntp должен быть отключен. [2]\n\n"
    },
    {
      "title": "Использование ntpd с GPS",
      "level": 3,
      "content": "Многие статьи предлагают настраивать ntpd на получение времени из GPS через общую память, однако как минимум с версии 4.2.8 появился гораздо более хороший метод. Он подключается напрямую к gpsd, так что gpsd должен быть установлен.\n\nДобавьте следующие строки в /etc/ntp.conf:\n\n```\n/etc/ntp.conf\n```\n\n```\n#=========================================================\n#  GPSD native ntpd driver\n#=========================================================\n# This driver exists from at least ntp version 4.2.8\n# Details at\n#   https://www.eecis.udel.edu/~mills/ntp/html/drivers/driver46.html\nserver 127.127.46.0 \nfudge 127.127.46.0 time1 0.0 time2 0.0 refid GPS\n```\n\nДля проверки сперва убедитесь, что gpsd работает:\n\n```\n$ cgps -s\n```\n\nЗатем подождите несколько минут и запустите ntpq -p. Он должен показать, что ntpd общается с gpsd:\n\n```\n$ ntpq -p\n```\n\n```\nremote           refid            st t when poll reach   delay   offset  jitter\n ==================================================================================\n*GPSD_JSON(0)    .GPS.            0 l   55   64  377    0.000    2.556  14.109\n```\n\n- Если reach равен 0, это означает, что ntpd не смог пообщаться с gpsd. Подождите несколько минут и попробуйте снова.\n- GPS-устройство должно поддерживать PPS. Вы можете проверить своё устройство с помощью команды ppscheck /dev/gps0.\n\n"
    },
    {
      "title": "Запуск в chroot",
      "level": 3,
      "content": "Создайте каталог /etc/systemd/system/ntpd.service.d/ (если его ещё нет) и drop-in файл customexec.conf в нём со следующим содержимым:\n\n```\n[Service]\nExecStart=\nExecStart=/usr/bin/ntpd -g -u ntp:ntp -i /var/lib/ntp\n```\n\nЗатем измените /etc/ntp.conf, прописав пути относительно chroot. Измените:\n\n```\ndriftfile       /var/lib/ntp/ntp.drift\n```\n\nна:\n\n```\ndriftfile       /ntp.drift\n```\n\nСоздайте необходимое chroot-окружение, чтобы getaddrinfo() работал:\n\n```\n# mkdir /var/lib/ntp/etc /var/lib/ntp/lib /var/lib/ntp/proc\n# mkdir /var/lib/ntp/usr /var/lib/ntp/usr/lib\n# touch /var/lib/ntp/etc/resolv.conf /var/lib/ntp/etc/services\n```\n\nи пропишите bind mount для упомянутых файлов:\n\n```\n/etc/fstab\n```\n\n```\n...\n#ntpd chroot mounts\n/etc/resolv.conf  /var/lib/ntp/etc/resolv.conf none bind 0 0\n/etc/services\t  /var/lib/ntp/etc/services none bind 0 0\n/lib\t\t  /var/lib/ntp/lib none bind 0 0\n/usr/lib\t  /var/lib/ntp/usr/lib none bind 0 0\n/proc\t\t  /var/lib/ntp/proc none bind 0 0\n```\n\n```\n# mount -a\n```\n\nЗатем перезапустите демон ntpd. После перезапуска вы можете проверить, действительно ли он запустился в chroot, посмотрев, куда ведёт символьная ссылка /proc/{PID}/root:\n\n```\n# ps -C ntpd | awk '{print $1}' | sed 1d | while read -r PID; do ls -l /proc/$PID/root; done\n```\n\nДолжно ссылаться на /var/lib/ntp вместо /.\n\nСкорее всего придётся немного подождать, чтобы проверить корректность настройки driftfile, так как ntpd пишет и читает не очень часто. Если вы ошиблись, демон отпечатает ошибку в журнале; если всё в порядке, он обновит метку времени. Если вы не наблюдаете ошибок в течение суток и время при этом обновляется, значит всё хорошо.\n\n"
    },
    {
      "title": "Ограничение прослушивающих сокетов",
      "level": 3,
      "content": "Вы можете ограничить сокеты, которые прослушивает ntpd, используя опцию interface:\n\n```\ninterface [listen | ignore | drop] [all | ipv4 | ipv6 | wildcard | name | address[/prefixlen]]\n```\n\nпримерно так:\n\n```\n/etc/ntp.conf\n```\n\n```\ninterface listen lo\ninterface listen enp3s0\ninterface ignore enp5s0\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- https://www.ntp.org/\n- https://support.ntp.org/\n- https://www.pool.ntp.org/\n- https://www.eecis.udel.edu/~mills/ntp/html/index.html\n- https://www.akadia.com/services/ntp_synchronize.html\n- ВНИИФТРИ - список серверов NTP Государственного эталона времени и частоты (ГЭВЧ) Российской Федерации.\n\n"
    }
  ]
}