{
  "title": "Network Debugging (Nederlands)",
  "url": "https://wiki.archlinux.org/title/Network_Debugging_(Nederlands)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- VLAN\n\nNote: **This article or section is a candidate for merging with Network Configuration.** This article or section is a candidate for merging with Network Configuration.\n\nThis article or section is a candidate for merging with Network Configuration.\n\n"
    },
    {
      "title": "Ping & Tracepath/Traceroute",
      "level": 2,
      "content": "Note: **This article or section is a candidate for merging with Network configuration#Ping.** This article or section is a candidate for merging with Network configuration#Ping.\n\nThis article or section is a candidate for merging with Network configuration#Ping.\n\nThe ping command can help test connectivity towards a specific host.\n\nThe first step would be verifying connectivity towards the default gateway (replace the ip address with your own default gateway):\n\n```\n$ ping -c4 192.168.1.1\n```\n\nWhen erasing the \"-c4\" parameter, the ping will continue endlessly. It can be aborted by hitting \"Control-C\".\n\n```\nPING 192.168.1.1 (192.168.1.1) 56(84) bytes of data.\n64 bytes from 192.168.1.1: icmp_req=1 ttl=64 time=0.193 ms\n64 bytes from 192.168.1.1: icmp_req=2 ttl=64 time=0.190 ms\n64 bytes from 192.168.1.1: icmp_req=3 ttl=64 time=0.192 ms\n64 bytes from 192.168.1.1: icmp_req=4 ttl=64 time=0.189 ms\n\n--- 192.168.1.1 ping statistics ---\n4 packets transmitted, 4 received, 0% packet loss, time 2999ms\nrtt min/avg/max/mdev = 0.165/0.184/0.193/0.014 ms\n```\n\nThe output above indicated the default gateway is reachable. When instead a \"Destination Host Unreachable\" message is displayed, doublecheck the ip address, netmask and default gateway config. This message can also be displayed when ICMP traffic is not permitted towards the default gateway (blocked by a firewall, router,...).\n\nThe next step is verifying connectivity towards the configured dns server(s). When no reply is received, tracepath or traceroute can be used to verify the routing towards said server and get an idea of where the issue lies.\n\n```\n$ traceroute 8.8.4.4\n```\n\nTraceroute also used ICMP to determine the path and hence there can be \"no reply\" answers as well when ICMP traffic is blocked.\n\n"
    },
    {
      "title": "Tcpdump",
      "level": 2,
      "content": "tcpdump, and its underlying library libpcap, are multi-platform user space interfaces to the packets on the network. It should be emphasized they do see, they can capture, any inbound packets that reach the local NIC. No matter if the local software firewall is blocking those packets, or not. On the other hand, they can only see outbound packets the firewall passes through: [1]\n\nA short, unintimidating introduction to tcpdump, with examples, is at: [2]\n\n"
    }
  ]
}