{
  "title": "Network Debugging (Español)",
  "url": "https://wiki.archlinux.org/title/Network_Debugging_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-09** \n\nArtículos relacionados\n\n- VLAN\n\n"
    },
    {
      "title": "Estado del enlace",
      "level": 2,
      "content": "En el resumen de ip a ya se muestra el estado del enlace, aunque también se puede mostrar ejecutando la orden:\n\n```\n$ ip link show dev eth0\n```\n\nEsto proporcionará una salida similar a:\n\n```\n2: eth0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc pfifo_fast state DOWN qlen 1000\n   link/ether 70:5a:b6:8a:a0:87 brd ff:ff:ff:ff:ff:ff\n```\n\nEs posible activar una interfaz de red al ejecutar:\n\n```\n# ip link set dev eth0 up\n```\n\n"
    },
    {
      "title": "RTNETLINK: No se puede asignar la dirección solicitada",
      "level": 3,
      "content": "Si obtiene este error al intentar configurar una interfaz, lo más probable es que la dirección MAC no sea válida. Para configurar una MAC que funcione, véase MAC address spoofing (Español).\n\n"
    },
    {
      "title": "Dirección IP",
      "level": 2,
      "content": "En el resumen proporcionada por ip a, la dirección ip ya se muestra, pero también puede mostrarse al ejecutar:\n\n```\n$ ip addr show dev eth0\n```\n\nEsto proporcionará una salida similar a:\n\n```\n2: eth0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc pfifo_fast state UP qlen 1000\n   link/ether 70:5a:b6:8a:a0:87 brd ff:ff:ff:ff:ff:ff\n   inet 192.168.1.143/24 brd 192.168.1.255 scope global eth0\n   inet6 fe80::725a:b6ff:fe8a:a087/64 scope link \n      valid_lft forever preferred_lft forever\n```\n\nPara añadir una dirección ip temporal ejecute:\n\n```\n# ip addr add 192.168.1.143/24 dev eth0\n```\n\nPara eliminar una dirección ip:\n\n```\n# ip addr del 192.168.1.143/24 dev eth0\n```\n\n"
    },
    {
      "title": "Ping y Tracepath/Traceroute",
      "level": 2,
      "content": "La orden ping puede ayudar a probar la conexión hacia un host específico.\n\nEl primer paso sería verificar la conexión hacia la puerta de enlace predeterminada (sustituya la dirección IP por su propia puerta de enlace predeterminada):\n\n```\n$ ping -c4 192.168.1.1\n```\n\nAl eliminar el parámetro \"-c4\", el ping continuará hasta el infinito. Se puede detener pulsando \"Control-C\".\n\n```\nPING 192.168.1.1 (192.168.1.1) 56(84) bytes of data.\n64 bytes from 192.168.1.1: icmp_req=1 ttl=64 time=0.193 ms\n64 bytes from 192.168.1.1: icmp_req=2 ttl=64 time=0.190 ms\n64 bytes from 192.168.1.1: icmp_req=3 ttl=64 time=0.192 ms\n64 bytes from 192.168.1.1: icmp_req=4 ttl=64 time=0.189 ms\n\n--- 192.168.1.1 ping statistics ---\n4 packets transmitted, 4 received, 0% packet loss, time 2999ms\nrtt min/avg/max/mdev = 0.165/0.184/0.193/0.014 ms\n```\n\nLa anterior salida indica que la puerta de enlace predeterminada es accesible. Si por el contrario aparece el mensaje \"Destination Host Unreachable\", compruebe de nuevo la dirección IP, la máscara de red y la configuración de la puerta de enlace predeterminada. Este mensaje también puede aparecer cuando no se permite el tráfico ICMP hacia la puerta de enlace predeterminada (bloqueado por un cortafuegos, router,...).\n\nEl siguiente paso es verificar la conexión hacia los servidores dns configurados. Cuando no se recibe respuesta, es posible utilizar tracepath o traceroute para verificar el enrutamiento hacia dicho servidor y observar dónde está el problema.\n\n```\n$ traceroute 8.8.4.4\n```\n\nTraceroute también utiliza ICMP para determinar la ruta y por lo tanto puede haber respuestas \"sin respuesta\" cuando el tráfico ICMP se encuentra bloqueado.\n\n"
    },
    {
      "title": "Tcpdump",
      "level": 2,
      "content": "tcpdump, y su librería subyacente libpcap, son interfaces de usuario multiplataforma para los paquetes en red. Se debe enfatizar que ven y pueden capturar cualquier paquete entrante. No importa si el cortafuegos está bloqueando esos paquetes o no. Por otro lado, pueden ver, y por lo tanto capturar, sólo los paquetes salientes que pasan a través del cortafuegos [1].\n\nUna introducción a tcpdump, corta y no muy complicada, incluyendo ejemplos, se puede encontrar en [2].\n\n"
    }
  ]
}