{
  "title": "NetworkManager (Français)",
  "url": "https://wiki.archlinux.org/title/NetworkManager_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Network configuration (Français)\n- Network configuration (Français)/Wireless (Français)\n\nNetworkManager est un programme permettant de détecter et de configurer les systèmes pour qu'ils se connectent automatiquement aux réseaux. La fonction de NetworkManager peut être utile pour les réseaux sans fil et câblés. Pour les réseaux sans fil, NetworkManager préfère les réseaux sans fil connus et a la capacité de passer au réseau le plus fiable. Les applications adaptées à NetworkManager peuvent passer du mode en ligne au mode hors ligne. NetworkManager préfère également les connexions câblées aux connexions sans fil, prend en charge les connexions par modem et certains types de VPN. NetworkManager a été développé à l'origine par Red Hat et est maintenant hébergé par le projet GNOME.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "NetworkManager peut être installé avec le paquet networkmanager, qui contient un daemon, une interface en ligne de commande (nmcli) et une interface basée sur curses (nmtui).\n\n"
    },
    {
      "title": "Activer NetworkManager",
      "level": 3,
      "content": "Après l'installation, démarrez et activez NetworkManager.service. Une fois le daemon NetworkManager démarré, il se connectera automatiquement à toutes les \"connexions système\" disponibles qui ont déjà été configurées. Toute \"connexion utilisateur\" ou connexion non configurée devra être configurée et connectée par nmcli ou une applet.\n\n- Vous devez vous assurer qu'aucun autre service souhaitant configurer le réseau n'est en cours d'exécution ; en effet, plusieurs services réseau entreront en conflit. Vous pouvez trouver une liste des services en cours d'exécution avec systemctl --type=service et ensuite arrêtez-les. Consultez #Configuration pour activer le service NetworkManager.\n- Si systemd-resolved n'est pas démarré, un message d'erreur commencera à inonder vos journaux. Consultez #Unité dbus-org.freedesktop.resolve1.service non trouvée pour plus d'informations.\n\n"
    },
    {
      "title": "Interfaces supplémentaires",
      "level": 3,
      "content": "- nm-connection-editor pour une interface utilisateur graphique,\n- network-manager-applet pour une applet de la barre d'état système (nm-applet).\n\n"
    },
    {
      "title": "Prise en charge du haut débit mobile",
      "level": 3,
      "content": "NetworkManager utilise ModemManager pour prendre en charge les connexions mobiles à large bande.\n\nInstallez modemmanager et usb_modeswitch. Ensuite, activez et démarrez ModemManager.service.\n\nRedémarrez si besoin NetworkManager.service pour qu'il détecte ModemManager. Après l'avoir redémarré, rebranchez le modem et il devrait être reconnu.\n\nAjoutez des connexions à partir d'une interface (par exemple, nm-connection-editor) et sélectionnez le haut débit mobile comme type de connexion. Après avoir sélectionné votre FAI et votre plan de facturation, les APN et d'autres paramètres devraient être remplis automatiquement en utilisant les informations de mobile-broadband-provider-info.\n\n"
    },
    {
      "title": "Prise en charge de PPPoE / DSL",
      "level": 3,
      "content": "Installez Le paquet rp-pppoe pour prendre en charge les connexions PPPoE / DSL. Pour ajouter réellement une connexion PPPoE, utilisez nm-connection-editor et ajoutez une nouvelle connexion DSL/PPPoE.\n\n"
    },
    {
      "title": "Prise en charge du VPN",
      "level": 3,
      "content": "NetworkManager depuis la version 1.16 a un support natif pour WireGuard, tout ce dont il a besoin est le module noyau wireguard. Lisez le post du blog WireGuard dans NetworkManager pour plus de détails.\n\nLa prise en charge des autres types de VPN est basée sur un système de plug-in. Ils sont fournis dans les paquets suivants :\n\n- networkmanager-openconnect pour OpenConnect\n- networkmanager-openvpn pour OpenVPN\n- networkmanager-pptp pour PPTP Client\n- networkmanager-strongswan pour strongSwan\n- networkmanager-vpnc\n- networkmanager-fortisslvpn-gitAUR[broken link: package not found]\n- networkmanager-iodine-gitAUR\n- networkmanager-libreswanAUR\n- networkmanager-l2tp\n- networkmanager-ssh-gitAUR\n- network-manager-sstp\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "NetworkManager est fourni avec nmcli(1) et nmtui(1).\n\n"
    },
    {
      "title": "Exemples avec nmcli",
      "level": 3,
      "content": "Liste des réseaux Wi-Fi à proximité :\n\n```\n$ nmcli device wifi list\n```\n\nSe connecter à un réseau Wi-Fi :\n\n```\n$ nmcli device wifi connect SSID_ou_BSSID password password\n```\n\nSe connecter à un réseau Wi-Fi caché :\n\n```\n$ nmcli device wifi connect SSID_ou_BSSID password password hidden yes\n```\n\nSe connecter à un réseau Wi-Fi sur l'interface wlan1 :\n\n```\n$ nmcli device wifi connect SSID_ou_BSSID password password ifname wlan1 profile_name\n```\n\nDéconnecter une interface :\n\n```\n$ nmcli device disconnect ifname eth0\n```\n\nObtenir une liste des connexions avec leurs noms, UUIDs, types et périphériques :\n\n```\n$ nmcli connection show\n```\n\nActiver une connexion (c'est-à-dire se connecter à un réseau avec un profil existant) :\n\n```\n$ nmcli connection up name_or_uuid\n```\n\nSupprimer une connexion :\n\n```\n$ nmcli connection delete name_or_uuid\n```\n\nConsulter la liste des périphériques réseau et leur état :\n\n```\n$ nmcli device\n```\n\nDésactiver le Wi-Fi :\n\n```\n$ nmcli radio wifi off\n```\n\n"
    },
    {
      "title": "Modifier une connexion",
      "level": 3,
      "content": "Pour une liste complète des paramètres, consultez nm-settings(5).\n\nTout d'abord, vous devez obtenir la liste des connexions :\n\n```\n$ nmcli connection\n```\n\n```\nNAME UUID TYPE DEVICE\nConnexion filaire 2 e7054040-a421-3bef-965d-bb7d60b7cecf ethernet enp5s0\nWired connection 1 997f2782-f0fc-301d-bfba-15421a2735d8 ethernet enp0s25\nMY-HOME-WIFI-5G 92a0f7b3-2eba-49ab-a899-24d83978f308 wifi --\n```\n\nVous pouvez ici utiliser la première colonne comme connection-id utilisé plus tard. Dans cet exemple, nous choisissons Wired connection 2 comme identifiant de connexion.\n\nVous avez trois méthodes pour configurer une connexion Wired connection 2 après qu'elle ait été créée :\n\nPour supprimer un paramètre, passez-lui un champ vide (\"\") comme ceci :\n\n"
    },
    {
      "title": "Interfaces",
      "level": 2,
      "content": "Pour configurer et avoir un accès facile à NetworkManager, la plupart des utilisateurs voudront installer une applet. Cette interface graphique réside généralement dans la barre d'état système (ou la zone de notification) et permet la sélection du réseau et la configuration de NetworkManager. Divers environnements de bureau ont leur propre applet. Sinon, vous pouvez utiliser #nm-applet.\n\n"
    },
    {
      "title": "GNOME",
      "level": 3,
      "content": "GNOME possède un outil intégré, accessible à partir des paramètres du réseau.\n\n"
    },
    {
      "title": "KDE Plasma",
      "level": 3,
      "content": "Installez le paquet plasma-nm. Ensuite, ajoutez-le à la barre des tâches de KDE via le menu Options du panneau > Ajouter des widgets > Réseaux.\n\n"
    },
    {
      "title": "nm-applet",
      "level": 3,
      "content": "network-manager-applet est une interface GTK 3 qui fonctionne sous les environnements Xorg avec une barre d'état système («systray»).\n\nPour stocker les secrets de connexion, installez et configurez GNOME/Keyring.\n\nSoyez conscient qu'après avoir coché la case Mettre à la disposition des autres utilisateurs pour une connexion, NetworkManager stocke le mot de passe en texte simple, bien que le fichier correspondant ne soit accessible qu'à root (ou aux autres utilisateurs via nm-applet). Consultez #Mots de passe Wi-Fi chiffrés.\n\nAfin d'exécuter nm-applet sans systray, vous pouvez utiliser trayer ou stalonetray. Par exemple, vous pouvez ajouter un script comme celui-ci dans votre chemin :\n\n```\nnmgui\n```\n\n```\n#!/bin/sh\nnm-applet 2>&1 > /dev/null &\nstalonetray 2>&1 > /dev/null\nkillall nm-applet\n```\n\nLorsque vous fermez la fenêtre stalonetray, elle ferme également nm-applet, de sorte qu'aucune mémoire supplémentaire n'est utilisée une fois que vous avez terminé les paramètres réseau.\n\nL'applet peut afficher des notifications pour des événements tels que la connexion ou la déconnexion d'un réseau WiFi. Pour que ces notifications s'affichent, assurez-vous qu'un serveur de notification est installé - consultez Desktop notifications. Si vous utilisez l'applet sans serveur de notification, vous risquez de retrouver certains messages dans stdout/stderr, et l'applet risque de se bloquer. Consultez [1].\n\nAfin d'exécuter nm-applet avec ces notifications désactivées, démarrez l'applet avec la commande suivante :\n\n```\n$ nm-applet --no-agent\n```\n\n```\nExec=nm-applet --no-agent\n```\n\n"
    },
    {
      "title": "Appindicateur",
      "level": 4,
      "content": "Depuis la version 1.18.0, la prise en charge d'Appindicator est disponible dans le paquet officiel network-manager-applet. Pour utiliser nm-applet dans un environnement Appindicator, démarrez l'applet avec la commande suivante :\n\n```\n$ nm-applet --indicator\n```\n\n"
    },
    {
      "title": "networkmanager-dmenu",
      "level": 3,
      "content": "Il existe également networkmanager-dmenu-gitAUR qui est un petit script permettant de gérer les connexions NetworkManager avec dmenu ou rofi au lieu de nm-applet. Il fournit toutes les fonctionnalités essentielles telles que la connexion à des connexions NetworkManager wifi ou filaires existantes, la connexion à de nouvelles connexions wifi, la demande de phrase de passe si nécessaire, la connexion à des connexions VPN existantes, l'activation/désactivation du réseau, le lancement de l'interface graphique nm-connection-editor, la connexion à des réseaux Bluetooth.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "NetworkManager nécessite quelques étapes supplémentaires pour pouvoir fonctionner correctement. Assurez-vous que vous avez configuré /etc/hosts comme décrit dans la section Network configuration#Set the hostname.\n\nNetworkManager a un fichier de configuration global : /etc/NetworkManager/NetworkManager.conf. Des fichiers de configuration supplémentaires peuvent être placés dans /etc/NetworkManager/conf.d/. En général, aucune configuration n'est nécessaire pour les valeurs par défaut globales.\n\nAprès avoir modifié un fichier de configuration, les changements peuvent être appliqués en exécutant :\n\n```\n# nmcli general reload\n```\n\n"
    },
    {
      "title": "NetworkManager-wait-online",
      "level": 3,
      "content": "L'activation de NetworkManager.service active également NetworkManager-wait-online.service, qui est un service système à action unique qui attend que le réseau soit configuré. Ce dernier a WantedBy=network-online.target, donc il ne se terminera que lorsque network-online.target lui-même sera activé ou déclenché par une autre unité. Consultez également Systemd (Français)#Exécution des services après le démarrage du réseau.\n\nPar défaut, NetworkManager-wait-online.service attend la fin du démarrage de NetworkManager, plutôt que d'attendre spécifiquement la connectivité réseau (consultez nm-online(1)). Si NetworkManager-wait-online.service se termine avant que le réseau ne soit réellement opérationnel, ce qui entraîne l'échec des services au démarrage, étendez l'unité pour supprimer le -s de la ligne ExecStart :\n\n```\n[Service]\nExecStart=\nExecStart=/usr/bin/nm-online -q\n```\n\nSachez que cela peut causer d'autres problèmes.\n\nDans certains cas, le service n'arrivera toujours pas à démarrer correctement au démarrage parce que le délai d'attente est trop court. Éditez le service pour modifier NM_ONLINE_TIMEOUT de 60 à une valeur plus élevée.\n\n"
    },
    {
      "title": "Configurer les permissions de PolicyKit",
      "level": 3,
      "content": "Par défaut, tous les utilisateurs des sessions locales actives sont autorisés à modifier la plupart des paramètres réseau sans mot de passe. Consultez General troubleshooting (Français)#Permissions de session pour vérifier votre type de session. Dans la plupart des cas, tout devrait fonctionner sans problème.\n\nCertaines actions (comme la modification du nom d'hôte du système) nécessitent un mot de passe administrateur. Dans ce cas, vous devez vous ajouter au groupe wheel et exécuter un Agent d'authentification Polkit qui vous demandera votre mot de passe.\n\nPour les sessions à distance (par exemple, headless VNC), vous avez plusieurs options pour obtenir les privilèges nécessaires à l'utilisation de NetworkManager :\n\n1. Ajoutez vous au groupe wheel. Vous devrez saisir votre mot de passe pour chaque action. Notez que d'autres autorisations peuvent être accordées à votre compte utilisateur, comme la possibilité d'utiliser sudo sans saisir le mot de passe root.\n1. Ajoutez vous au groupe network et créez /etc/polkit-1/rules.d/50-org.freedesktop.NetworkManager.rules avec le contenu suivant : polkit.addRule(function(action, subject) { si (action.id.indexOf(\"org.freedesktop.NetworkManager.\") == 0 && subject.isInGroup(\"network\")) { return polkit.Result.YES ; } }) ; Tous les utilisateurs du groupe network pourront ajouter et supprimer des réseaux sans mot de passe (ce qui signifie que vous n'avez pas besoin d'exécuter un agent d'authentification Polkit, donc cette option fonctionnera également dans les sessions SSH).\n\n```\npolkit.addRule(function(action, subject) {\n  si (action.id.indexOf(\"org.freedesktop.NetworkManager.\") == 0 && subject.isInGroup(\"network\")) {\n    return polkit.Result.YES ;\n  }\n}) ;\n```\n\n"
    },
    {
      "title": "Paramètres du proxy",
      "level": 3,
      "content": "NetworkManager ne gère pas directement les paramètres de proxy, mais si vous utilisez GNOME ou KDE, vous pouvez utiliser proxydriverAUR[broken link: package not found] qui gère les paramètres de proxy en utilisant les informations de NetworkManager.\n\nPour que proxydriver puisse modifier les paramètres du proxy, vous devez exécuter cette commande, dans le cadre du processus de démarrage de GNOME (consultez GNOME#Autostart).\n\n```\n$ xhost +si:localuser:username\n```\n\nConsultez également l'article concernant les paramètres du proxy.\n\n"
    },
    {
      "title": "Vérification de la connectivité",
      "level": 3,
      "content": "NetworkManager peut essayer d'atteindre un serveur web après s'être connecté à un réseau afin de déterminer s'il est par exemple derrière un portail captif. L'hôte par défaut (configuré dans /usr/lib/NetworkManager/conf.d/20-connectivity.conf) est ping.archlinux.org (un alias CNAME de redirect.archlinux.org). Pour utiliser un autre serveur Web ou pour désactiver la vérification de la connectivité, créez /etc/NetworkManager/conf.d/20-connectivity.conf, consultez NetworkManager.conf(5) § CONNECTIVITY SECTION. Vous trouverez ci-dessous un exemple d'utilisation des serveurs GNOME (il ne nécessite pas l'utilisation de GNOME) :\n\n```\n/etc/NetworkManager/conf.d/20-connectivity.conf\n```\n\n```\n[connectivity]\nuri=http://nmcheck.gnome.org/check_network_status.txt\n```\n\nPour désactiver la vérification de la connectivité de NetworkManager, utilisez la configuration suivante. Cela peut être utile lorsque vous êtes connecté à un VPN qui bloque les vérifications de connectivité.\n\n```\n/etc/NetworkManager/conf.d/20-connectivity.conf\n```\n\n```\n[connectivity] \nenabled=false\n```\n\n"
    },
    {
      "title": "Portails captifs",
      "level": 3,
      "content": "Pour ceux qui se trouvent derrière un portail captif, le gestionnaire de bureau peut ouvrir automatiquement une fenêtre demandant des informations d'identification. Si votre bureau ne le fait pas, vous pouvez utiliser le paquet capnet-assist (cependant, il a actuellement un script de répartition NetworkManager cassé). Sinon, vous pouvez créer un script de répartition NetworkManager avec le contenu suivant :\n\n```\n/etc/NetworkManager/dispatcher.d/90-open_captive_portal\n```\n\n```\n#!/bin/sh -e\n# Script to dispatch NetworkManager events\n#\n# Runs shows a login webpage on walled garden networks.\n# See NetworkManager(8) for further documentation of the dispatcher events.\n\nPATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin\n\nif [ -x \"/usr/bin/logger\" ]; then\n    logger=\"/usr/bin/logger -s -t captive-portal\"\nelse\n    logger=\":\"\nfi\n\nwait_for_process() {\n    PNAME=$1\n    while [ -z \"$(/usr/bin/pgrep $PNAME)\" ]; do\n        sleep 3;\n    done\n}\n\n#launch the browser, but on boot we need to wait that nm-applet starts\nstart_browser() {\n    local user=\"$1\"\n    local display=\"$2\"\n\n    export DISPLAY=\"$display\"\n    wait_for_process nm-applet\n\n    export XAUTHORITY=\"/home/$user/.Xauthority\"\n\n    $logger \"Running browser as '$user' with display '$display' to login in captive portal\"\n    sudo -u \"$user\" --preserve-env=DISPLAY,XAUTHORITY -H xdg-open http://capnet.elementary.io 2>&1 > /dev/null\n}\n\n# Run the right scripts\ncase \"$2\" in\n    connectivity-change)\n    $logger -p user.debug \"dispatcher script triggered on connectivity change: $CONNECTIVITY_STATE\"\n    if [ \"$CONNECTIVITY_STATE\" = \"PORTAL\" ]; then\n        # Match last column of who's output with ' :[at least one digit] '\n        who | awk '$NF ~ /\\(:[0-9]+\\)/ { print $1 \" \" substr($NF, 2, length($NF)-2) };' | \\\n        while read user display; do\n            start_browser $user $display || $logger -p user.err \"Failed for user: '$user' display: '$display'\"\n        done\n    fi\n    ;;\n    *)\n    # In a down phase\n    exit 0\n    ;;\nesac\n```\n\nRedémarrez NetworkManager.service ou redémarrez totalement pour que cela commence à fonctionner. Une fois que vous l'aurez fait, le script du répartiteur devrait ouvrir une fenêtre de connexion dès qu'il aura détecté que vous êtes derrière un portail captif.\n\nUne autre solution est captive-browser-gitAUR basée sur Google Chrome.\n\n"
    },
    {
      "title": "Client DHCP",
      "level": 3,
      "content": "Par défaut, NetworkManager utilise son client DHCP interne. Le plugin DHCPv4 interne est basé sur la bibliothèque n-dhcp4 de nettools, tandis que le plugin DHCPv6 interne est fait à partir du code basé sur systemd-networkd.\n\nPour utiliser un client DHCP différent, installez l'une des alternatives :\n\n- dhclient - dhclient.\n- dhcpcd - dhcpcd.\n\nPour changer le client DHCP, définissez l'option main.dhcp=dhcp_client_name avec un fichier de configuration dans /etc/NetworkManager/conf.d/. Par exemple :\n\n```\n/etc/NetworkManager/conf.d/dhcp-client.conf\n```\n\n```\n[main]\ndhcp=dhclient\n```\n\n- NetworkManager ne prend pas en charge l'utilisation de dhcpcd pour IPv6. Consultez le rapport n°5 de NetworkManager. Si dhcpcd est défini comme client DHCP, NetworkManager utilisera le client DHCP interne pour DHCPv6.\n- N'activez pas les unités systemd livrées avec les paquets dhclient et dhcpcd. Elles entreront en conflit avec NetworkManager, consultez la note dans #Installation pour plus de détails.\n\n"
    },
    {
      "title": "Gestion des DNS",
      "level": 3,
      "content": "La gestion DNS de NetworkManager est décrite dans la page wiki du projet GNOME-Projects/NetworkManager/DNS.\n\n"
    },
    {
      "title": "Mise en cache du DNS et transfert conditionnel",
      "level": 4,
      "content": "NetworkManager dispose d'un plugin pour activer la mise en cache du DNS et la redirection conditionnelle (previously appelé \"split DNS\" dans la documentation de NetworkManager) en utilisant dnsmasq ou systemd-resolved. L'avantage de cette configuration est que les recherches DNS sont mises en cache, ce qui réduit les temps de résolution, et que les recherches DNS des hôtes VPN sont acheminées vers les serveurs DNS du VPN concerné. Ceci est particulièrement utile si vous êtes connecté à plus d'un VPN.\n\nAssurez-vous que dnsmasq a été installé. Définissez ensuite main.dns=dnsmasq avec un fichier de configuration dans /etc/NetworkManager/conf.d/ :\n\n```\n/etc/NetworkManager/conf.d/dns.conf\n```\n\n```\n[main]\ndns=dnsmasq\n```\n\nExécutez maintenant nmcli general reload en tant que root. NetworkManager démarrera automatiquement dnsmasq et ajoutera 127.0.0.1 à /etc/resolv.conf. Les serveurs DNS originaux se trouvent dans /run/NetworkManager/no-stub-resolv.conf. Vous pouvez vérifier que dnsmasq est utilisé en effectuant deux fois la même recherche DNS avec drill example.com et en vérifiant les temps de serveur et de requête.\n\n- Vous n'avez pas besoin de démarrer dnsmasq.service ou de modifier /etc/dnsmasq.conf. NetworkManager démarrera dnsmasq sans utiliser le service systemd et sans lire le(s) fichier(s) de configuration par défaut de dnsmasq.\n- L'instance de dnsmasq démarrée par NetworkManager sera liée à 127.0.0.1:53, vous ne pouvez pas exécuter un autre logiciel (y compris dnsmasq.service) sur la même adresse et le même port.\n\nDes configurations personnalisées peuvent être créées pour dnsmasq en créant des fichiers de configuration dans /etc/NetworkManager/dnsmasq.d/. Par exemple, pour modifier la taille du cache DNS (qui est stocké en RAM) :\n\n```\n/etc/NetworkManager/dnsmasq.d/cache.conf\n```\n\n```\ncache-size=1000\n```\n\nVous pouvez vérifier la syntaxe du fichier de configuration avec :\n\n```\n$ dnsmasq --test --conf-file=/dev/null --conf-dir=/etc/NetworkManager/dnsmasq.d\n```\n\nConsultez dnsmasq(8) pour connaître toutes les options disponibles.\n\nL'activation de dnsmasq dans NetworkManager peut interrompre les recherches DNS en IPv6 uniquement (c'est-à-dire drill -6 [hostname]) qui fonctionneraient autrement. Afin de résoudre ce problème, la création du fichier suivant configurera dnsmasq pour qu'il écoute également le loopback IPv6 :\n\n```\n/etc/NetworkManager/dnsmasq.d/ipv6-listen.conf\n```\n\n```\nlisten-address=::1\n```\n\nEn outre, dnsmasq ne donne pas non plus la priorité aux DNS IPv6 en amont. Malheureusement, NetworkManager ne le fait pas (Bug remonté chez Ubuntu). Une solution de contournement serait de désactiver le DNS IPv4 dans la configuration de NetworkManager, en supposant qu'il en existe une.\n\nL'instance dnsmasq lancée par NetworkManager par défaut ne validera pas DNSSEC puisqu'elle est lancée avec l'option --proxy-dnssec. Elle fera confiance aux informations DNSSEC qu'elle obtient du serveur DNS en amont.\n\nPour que dnsmasq valide correctement les DNSSEC, ce qui casse la résolution DNS avec les serveurs de noms qui ne les prennent pas en charge, créez le fichier de configuration suivant :\n\n```\n/etc/NetworkManager/dnsmasq.d/dnssec.conf\n```\n\n```\nconf-file=/usr/share/dnsmasq/trust-anchors.conf\ndnssec\n```\n\nNetworkManager peut utiliser systemd-resolved comme résolveur et cache DNS. Assurez-vous que systemd-resolved est correctement configuré et que systemd-resolved.service est démarré avant de l'utiliser.\n\nsystemd-resolved sera utilisé automatiquement si /etc/resolv.conf est un symlink vers /run/systemd/resolve/stub-resolv.conf, /run/systemd/resolve/resolv.conf ou /usr/lib/systemd/resolv.conf.\n\nVous pouvez l'activer explicitement en définissant main.dns=systemd-resolved avec un fichier de configuration dans /etc/NetworkManager/conf.d/ :\n\n```\n/etc/NetworkManager/conf.d/dns.conf\n```\n\n```\n[main]\ndns=systemd-resolved\n```\n\nSi openresolv a un client pour votre résolveur DNS local, configurez le client et configurez NetworkManager pour utiliser openresolv.\n\nParce que NetworkManager annonce une seule \"interface\" à resolvconf, il n'est pas possible d'implémenter le transfert conditionnel entre deux connexions NetworkManager. Consultez le rapport n°153 de NetworkManager.\n\nCe problème peut être partiellement atténué si vous définissez private_interfaces=\"*\" dans /etc/resolvconf.conf [4]. Toutes les requêtes pour des domaines qui ne sont pas dans la liste des domaines de recherche ne seront pas transférées. Elles seront traitées selon la configuration du résolveur local, par exemple, transférées vers un autre serveur DNS ou résolues récursivement à partir de la racine DNS.\n\n"
    },
    {
      "title": "Serveurs DNS personnalisés",
      "level": 4,
      "content": "Pour définir des serveurs DNS pour toutes les connexions, spécifiez-les dans NetworkManager.conf(5) en utilisant la syntaxe servers=serveripaddress1,serveripaddress2,serveripaddress3 dans une section nommée [global-dns-domain-*]. Par exemple :\n\n```\n/etc/NetworkManager/conf.d/dns-servers.conf\n```\n\n```\n[global-dns-domain-*]\nservers=::1,127.0.0.1\n```\n\n- Si vous utilisez NetworkManager's dnsmasq or systemd-resolved plugin ou openresolv subscribers, ne spécifiez pas d'adresses de bouclage avec l'option servers=, car cela peut interrompre la résolution DNS.\n- Les serveurs spécifiés ne sont pas envoyés à systemd-resolved, les serveurs DNS de la connexion sont utilisés à la place.\n\nLa configuration dépend du type de l'interface utilisée ; le processus implique généralement un clic droit sur l'applet, l'édition (ou la création) d'un profil, puis la sélection du type DHCP comme Automatique (spécifier les adresses). Les adresses DNS doivent être saisies et se présentent généralement sous cette forme : 127.0.0.1, DNS-server-one, ....\n\nPour configurer des serveurs DNS par connexion, vous pouvez utiliser le champ dns (et les dns-search et dns-options associés) dans les paramètres de connexion.\n\nSi method est défini sur auto (lorsque vous utilisez DHCP), vous devez définir ignore-auto-dns sur yes.\n\n"
    },
    {
      "title": "/etc/resolv.conf",
      "level": 4,
      "content": "Le mode de gestion de NetworkManager /etc/resolv.conf est configuré avec le paramètre main.rc-manager. networkmanager lui attribue la valeur symlink au lieu de la valeur par défaut en amont auto. Ce paramètre et ses valeurs sont documentés dans la page de manuel NetworkManager.conf(5).\n\nNetworkManager offre également des crochets via des scripts dits \"dispatcher\" qui peuvent être utilisés pour modifier le fichier /etc/resolv.conf après des changements de réseau. Consultez #Services réseau avec le répartiteur NetworkManager et NetworkManager(8) pour plus d'informations.\n\n- Si NetworkManager est configuré pour utiliser dnsmasq ou systemd-resolved, les adresses de bouclage appropriées seront écrites dans /etc/resolv.conf.\n- Le fichier resolv.conf que NetworkManager écrit ou écrirait dans /etc/resolv.conf se trouve à /run/NetworkManager/resolv.conf.\n- Un fichier resolv.conf contenant les serveurs de noms et les domaines de recherche acquis se trouve à /run/NetworkManager/no-stub-resolv.conf.\n\nPour empêcher NetworkManager de toucher à /etc/resolv.conf, définissez main.dns=none avec un fichier de configuration dans /etc/NetworkManager/conf.d/ :\n\n```\n/etc/NetworkManager/conf.d/dns.conf\n```\n\n```\n[main]\ndns=none\n```\n\nAprès cela, /etc/resolv.conf peut être un lien symbolique cassé que vous devrez supprimer. Il suffit alors de créer un nouveau fichier /etc/resolv.conf.\n\n- Ne définissez pas main.rc-manager=resolvconf lorsque vous utilisez systemd-resolved, assurez-vous plutôt de créer correctement le lien symbolique /etc/resolv.conf ou de configurer NetworkManager pour utiliser systemd-resolved explicitement.\n- Assurez-vous que le paquet systemd-resolvconf n'est pas installé lorsque systemd-resolved n'est pas utilisé. Si systemd-resolved.service n'est pas démarré, il cassera tous les logiciels de réseau (pas seulement NetworkManager) qui utilisent resolvconf.\n\nPour configurer NetworkManager afin d'utiliser openresolv, définissez main.rc-manager=resolvconf avec un fichier de configuration dans /etc/NetworkManager/conf.d/ :\n\n```\n/etc/NetworkManager/conf.d/rc-manager.conf\n```\n\n```\n[main]\nrc-manager=resolvconf\n```\n\n"
    },
    {
      "title": "Pare-feu",
      "level": 3,
      "content": "Vous pouvez assigner une zone firewalld en fonction de votre connexion actuelle. Par exemple, un pare-feu restrictif lorsque vous êtes au travail, et un autre moins restrictif lorsque vous êtes à la maison.\n\nCela peut également être fait avec le répartiteur NetworkManager.\n\n"
    },
    {
      "title": "Services réseau avec le répartiteur NetworkManager",
      "level": 2,
      "content": "Il existe un certain nombre de services réseau que vous ne voudrez pas voir fonctionner avant que NetworkManager ne fasse apparaître une interface. NetworkManager a la capacité de démarrer les services lorsque vous vous connectez à un réseau et de les arrêter lorsque vous vous déconnectez (par exemple, lorsque vous utilisez NFS, SMB et NTPd).\n\nPour activer cette fonctionnalité, activez et démarrez NetworkManager-dispatcher.service.\n\nUne fois le service activé, des scripts peuvent être ajoutés au répertoire /etc/NetworkManager/dispatcher.d.\n\nLes scripts doivent appartenir à root, sinon le dispatcher ne les exécutera pas. Pour plus de sécurité, définissez la propriété du groupe à root également :\n\n```\n# chown root:root /etc/NetworkManager/dispatcher.d/10-script.sh\n```\n\nAssurez-vous que le fichier est exécutable.\n\nLes scripts seront exécutés dans l'ordre alphabétique au moment de la connexion, et dans l'ordre alphabétique inverse au moment de la déconnexion. Pour s'assurer de l'ordre dans lequel ils seront exécutés, il est courant d'utiliser des caractères numériques avant le nom du script (par exemple, 10-portmap ou 30-netfs). (ce qui assure que le portmapper est en place avant que les montages NFS soient tentés).\n\nLes scripts recevront les arguments suivants :\n\n- Nom de l'interface: e.g. eth0\n- Action : up, down, vpn-up, vpn-down, ... (consultez NetworkManager(8) pour la liste complète)\n\n"
    },
    {
      "title": "Éviter le délai d'attente du répartiteur",
      "level": 3,
      "content": "Si ce qui précède fonctionne, alors cette section n'est pas pertinente. Cependant, il existe un problème général lié à l'exécution de scripts de répartiteur qui prennent plus de temps à être exécutés. Initialement, un délai d'attente interne de trois secondes seulement était utilisé. Si le script appelé n'était pas terminé à temps, il était tué. Plus tard, le délai d'attente a été étendu à environ 20 secondes (consultez le Bugtracker pour plus d'informations). Si le délai d'attente pose toujours problème, une solution consiste à utiliser un fichier de substitution pour NetworkManager-dispatcher.service pour qu'il reste actif après la sortie :\n\n```\n/etc/systemd/system/NetworkManager-dispatcher.service.d/remain_after_exit.conf\n```\n\n```\n[Service]\nRemainAfterExit=yes\n```\n\nMaintenant, démarrez et activez le service NetworkManager-dispatcher modifié.\n\nNote: **doit** \n\n"
    },
    {
      "title": "Monter un répertoire distant avec sshfs",
      "level": 4,
      "content": "Comme le script est exécuté dans un environnement très restrictif, vous devez exporter SSH_AUTH_SOCK afin de vous connecter à votre agent SSH. Il existe différentes façons de procéder, consultez ce message pour plus d'informations. L'exemple ci-dessous fonctionne avec GNOME Keyring, et vous demandera le mot de passe s'il n'est pas déjà déverrouillé. Si NetworkManager se connecte automatiquement à la connexion, il est probable que gnome-keyring n'ait pas encore démarré et que l'exportation échoue (d'où le sleep). Le UUID à faire correspondre peut être trouvé avec la commande nmcli connection status ou nmcli connection list.\n\n```\n#!/bin/sh\nUSER='username'\nREMOTE='user@host:/remote/path'\nLOCAL='/local/path'\n\ninterface=$1 status=$2\nif [ \"$CONNECTION_UUID\" = \"uuid\" ]; then\n  case $status in\n    up)\n      # sleep 10\n      SSH_AUTH_SOCK=$(find /tmp -maxdepth 1 -type s -user \"$USER\" -name 'ssh')\n      export SSH_AUTH_SOCK\n      su \"$USER\" -c \"sshfs $REMOTE $LOCAL\"\n      ;;\n    down)\n      fusermount -u \"$LOCAL\"\n      ;;\n  esac\nfi\n```\n\n"
    },
    {
      "title": "Montage de partages SMB",
      "level": 4,
      "content": "Certains partages SMB ne sont disponibles que sur certains réseaux ou emplacements (par exemple, à la maison). Vous pouvez utiliser le répartiteur pour monter uniquement les partages SMB qui sont présents à votre emplacement actuel.\n\nLe script suivant vérifiera si nous sommes connectés à un réseau spécifique et montera les partages en conséquence :\n\n```\n/etc/NetworkManager/dispatcher.d/30-mount-smb.sh\n```\n\n```\n#!/bin/sh\n\n# Find the connection UUID with \"nmcli connection show\" in terminal.\n# All NetworkManager connection types are supported: wireless, VPN, wired...\nif [ \"$2\" = \"up\" ]; then\n  if [ \"$CONNECTION_UUID\" = \"uuid\" ]; then\n    mount /your/mount/point & \n    # add more shares as needed\n  fi\nfi\n```\n\nLe script suivant démontera tous les partages SMB avant une déconnexion initiée par logiciel d'un réseau spécifique :\n\n```\n/etc/NetworkManager/dispatcher.d/pre-down.d/30-umount-smb.sh\n```\n\n```\n#!/bin/sh\n\nif [ \"$CONNECTION_UUID\" = \"uuid\" ]; then\n  umount -a -l -t cifs\nfi\n```\n\nLe script suivant tentera de démonter tous les partages SMB suite à une déconnexion inattendue d'un réseau spécifique :\n\n```\n/etc/NetworkManager/dispatcher.d/40-umount-smb.sh\n```\n\n```\n#!/bin/sh\n\nif [ \"$CONNECTION_UUID\" = \"uuid\" ] ; then\n  if [ \"$2\" = \"down\" ] ; then\n    umount -a -l -t cifs\n  fi\nfi\n```\n\n- Depuis NetworkManager 0.9.8, les événements pre-down et down ne sont pas exécutés lors de l'arrêt ou du redémarrage, consultez ce rapport de bug pour plus d'informations.\n- Les scripts umount précédents sont toujours susceptibles de laisser les applications accédant au montage en suspens.\n\nUne alternative est d'utiliser le script consulté dans NFS#Using a NetworkManager dispatcher :\n\n```\n/etc/NetworkManager/dispatcher.d/30-smb.sh\n```\n\n```\n#!/bin/sh\n\n# Find the connection UUID with \"nmcli con show\" in terminal.\n# All NetworkManager connection types are supported: wireless, VPN, wired...\nWANTED_CON_UUID=\"CHANGE-ME-NOW-9c7eff15-010a-4b1c-a786-9b4efa218ba9\"\n\nif [ \"$CONNECTION_UUID\" = \"$WANTED_CON_UUID\" ]; then\n    \n    # Script parameter $1: NetworkManager connection name, not used\n    # Script parameter $2: dispatched event\n    \n    case \"$2\" in\n        \"up\")\n            mount -a -t cifs\n            ;;\n        \"down\"|\"pre-down\"|\"vpn-pre-down\")\n            umount -l -a -t cifs >/dev/null\n            ;;\n    esac\nfi\n```\n\nCréez un lien symbolique dans /etc/NetworkManager/dispatcher.d/pre-down/ pour attraper les événements pre-down :\n\n```\n# ln -s ../30-smb.sh /etc/NetworkManager/dispatcher.d/pre-down.d/30-smb.sh\n```\n\n"
    },
    {
      "title": "Montage des partages NFS",
      "level": 4,
      "content": "Consultez NFS#Using a NetworkManager dispatcher.\n\n"
    },
    {
      "title": "Utiliser le distributeur pour basculer automatiquement le sans fil en fonction du câble LAN branché",
      "level": 4,
      "content": "L'idée est d'activer le Wi-Fi uniquement lorsque le câble LAN est débranché (par exemple, lors du détachement du dock d'un ordinateur portable), et que le Wi-Fi soit automatiquement désactivé, une fois le câble LAN rebranché.\n\nCréez le script dispatcher suivant [5], en remplaçant LAN_interface par le vôtre.\n\nNotez qu'il existe une sécurité intégrée pour le cas où l'interface LAN a été connectée lors de la dernière mise sous tension de l'ordinateur, puis déconnectée alors que l'ordinateur était éteint. Dans ce cas, la radio serait toujours éteinte lorsque l'ordinateur est rallumé et avec une interface LAN déconnectée, vous n'auriez pas de réseau.\n\n```\n/etc/NetworkManager/dispatcher.d/wlan_auto_toggle.sh\n```\n\n```\n#!/bin/sh\n\nif [ \"$1\" = \"LAN_interface\" ] ; then\n    case \"$2\" in\n        up)\n            nmcli radio wifi off\n            ; ;\n        down)\n            nmcli radio wifi on\n            ; ;\n    esac\nelif [ \"$(nmcli -g GENERAL.STATE device show LAN_interface)\" = \"20 (indisponible)\" ] ; then\n    nmcli radio wifi on\nfi\n```\n\n"
    },
    {
      "title": "Utiliser le dispatcher pour se connecter à un VPN après l'établissement d'une connexion réseau",
      "level": 4,
      "content": "Dans cet exemple, nous voulons nous connecter automatiquement à une connexion VPN préalablement définie après nous être connectés à un réseau Wi-Fi spécifique. La première chose à faire est de créer le script dispatcher qui définit ce qu'il faut faire après que nous soyons connectés au réseau.\n\n```\n/etc/NetworkManager/dispatcher.d/vpn-up\n```\n\n```\n#!/bin/sh\nVPN_NAME=\"name of VPN connection defined in NetworkManager\"\nESSID=\"Wi-Fi network ESSID (not connection name)\"\n\ninterface=$1 status=$2\ncase $status in\n  up|vpn-down)\n    if iwgetid | grep -qs \":\\\"$ESSID\\\"\"; then\n      nmcli connection up id \"$VPN_NAME\"\n    fi\n    ;;\n  down)\n    if iwgetid | grep -qs \":\\\"$ESSID\\\"\"; then\n      if nmcli connection show --active | grep \"$VPN_NAME\"; then\n        nmcli connection down id \"$VPN_NAME\"\n      fi\n    fi\n    ;;\nesac\n```\n\nSi vous souhaitez tenter de vous connecter automatiquement au VPN pour tous les réseaux Wi-Fi, vous pouvez utiliser la définition suivante de l'ESSID : ESSID=$(iwgetid -r). N'oubliez pas de définir les autorisations du script en adéquation.\n\nLa tentative de connexion avec le script ci-dessus peut encore échouer avec NetworkManager-dispatcher.service se plaignant de l'absence de secrets VPN valides, à cause de la façon dont les secrets VPN sont stockés. Heureusement, il existe différentes options pour donner au script ci-dessus l'accès à votre mot de passe VPN.\n\n1 : L'une d'entre elles nécessite l'édition du fichier de configuration de la connexion VPN pour que NetworkManager stocke les secrets par lui-même plutôt que dans un trousseau qui sera inaccessible pour root : ouvrez /etc/NetworkManager/system-connections/name of your VPN connection et changez les password-flags et secret-flags de 1 à 0.\n\nSi cela ne suffit pas, vous devrez peut-être créer un fichier de mots de passe dans un emplacement sûr, avec les mêmes autorisations et le même propriétaire que le script du répartiteur, contenant les éléments suivants :\n\n```\n/path/to/passwd-file\n```\n\n```\nvpn.secrets.password:YOUR_PASSWORD\n```\n\nLe script doit être modifié en conséquence, afin qu'il récupère le mot de passe dans le fichier :\n\n```\n/etc/NetworkManager/dispatcher.d/vpn-up\n```\n\n```\n#!/bin/sh\nVPN_NAME=\"name of VPN connection defined in NetworkManager\"\nESSID=\"Wi-Fi network ESSID (not connection name)\"\n\ninterface=$1 status=$2\ncase $status in\n  up|vpn-down)\n    if iwgetid | grep -qs \":\\\"$ESSID\\\"\"; then\n      nmcli connection up id \"$VPN_NAME\" passwd-file /path/to/passwd-file\n    fi\n    ;;\n  down)\n    if iwgetid | grep -qs \":\\\"$ESSID\\\"\"; then\n      if nmcli connection show --active | grep \"$VPN_NAME\"; then\n        nmcli connection down id \"$VPN_NAME\"\n      fi\n    fi\n    ;;\nesac\n```\n\n2 : Alternativement, changez les password-flags et mettez le mot de passe directement dans le fichier de configuration en ajoutant la section vpn-secrets :\n\n```\n[vpn]\n ....\n password-flags=0\n \n [vpn-secrets]\n mot de passe=votre_mot_de_passe.\n```\n\n"
    },
    {
      "title": "Utiliser dispatcher pour désactiver IPv6 sur les connexions de fournisseurs VPN",
      "level": 4,
      "content": "De nombreux fournisseurs de VPN commerciaux ne prennent en charge que l'IPv4. Cela signifie que tout le trafic IPv6 contourne le VPN et le rend pratiquement inutile. Pour éviter cela, dispatcher peut être utilisé pour désactiver tout le trafic IPv6 pendant la durée d'une connexion VPN.\n\n```\n/etc/NetworkManager/dispatcher.d/10-vpn-ipv6\n```\n\n```\n#!/bin/sh\n\ncase \"$2\" dans\n\tvpn-up)\n\t\techo 1 > /proc/sys/net/ipv6/conf/all/disable_ipv6\n\t\t; ;\n\tvpn-down)\n\t\techo 0 > /proc/sys/net/ipv6/conf/all/disable_ipv6\n\t\t; ;\nesac\n```\n\n"
    },
    {
      "title": "OpenNTPD",
      "level": 4,
      "content": "Consultez OpenNTPD#Using NetworkManager dispatcher.\n\n"
    },
    {
      "title": "Configurer dynamiquement les serveurs NTP reçus via DHCP avec systemd-timesyncd",
      "level": 4,
      "content": "Lors de l'itinérance entre différents réseaux (par exemple, la LAN d'une entreprise, le WiFi à la maison, divers autres WiFi de temps en temps), vous pourriez vouloir définir le(s) serveur(s) NTP utilisé(s) par timesyncd à ceux fournis par DHCP. Cependant, NetworkManager lui-même n'est pas capable de communiquer avec systemd-timesyncd pour définir le(s) serveur(s) NTP.\n\nLe répartiteur peut contourner ce problème.\n\nCréez le répertoire «overlay» (de recouvrement) pour votre configuration systemd-timesyncd /etc/systemd/timesyncd.conf.d s'il n'existe pas déjà. A l'intérieur de /etc/NetworkManager/dispatcher.d, mettez ce qui suit :\n\n```\n/etc/NetworkManager/dispatcher.d/10-update-timesyncd\n```\n\n```\n#!/bin/sh\n\n[ -z \"$CONNECTION_UUID\" ] && exit 0\nINTERFACE=\"$1\"\nACTION=\"$2\"\n\ncase $ACTION in\nup | dhcp4-change | dhcp6-change)\n    [ -n \"$DHCP4_NTP_SERVERS\" ] || exit\n    mkdir -p /etc/systemd/timesyncd.conf.d\n    cat <<-THE_END >\"/etc/systemd/timesyncd.conf.d/${CONNECTION_UUID}.conf\"\n        [Time]\n        NTP=$DHCP4_NTP_SERVERS\n    THE_END\n    systemctl restart systemd-timesyncd.service\n    ;;\ndown)\n    rm -f \"/etc/systemd/timesyncd.conf.d/${CONNECTION_UUID}.conf\"\n    systemctl restart systemd-timesyncd.service\n    ;;\nesac\n```\n\nChaque fois que NetworkManager établit une nouvelle connexion réseau (ACTION=up) ou obtient une mise à jour pour une connexion existante (ACTION=dhcp4-change ou ACTION=dhcp6-change) et que les données de connexion fournies contiennent des informations sur le ou les serveurs NTP (DHCP4_NTP_SERVERS), un fichier de configuration de superposition spécifique à la connexion est écrit dans /etc/systemd/timesyncd. conf.d, contenant le ou les serveurs NTP fournis. Lorsqu'une connexion est supprimée (ACTION=down), le fichier de recouvrement spécifique à la connexion est supprimé. Après chaque modification de la configuration de systemd-timesyncd, ce service est redémarré pour prendre en compte la configuration mise à jour. L'utilisation de fichiers de configuration spécifiques à la connexion est intentionnelle afin que lorsque deux ou plusieurs connexions sont gérées par NetworkManager en parallèle, les différents noms de serveurs NTP dans la configuration ne soient pas écrasés car les actions up, dhcp4-change, dhcp6-change et down pourraient intervenir dans un ordre arbitraire.\n\n"
    },
    {
      "title": "Test",
      "level": 2,
      "content": "Les applets NetworkManager sont conçus pour se charger lors de la connexion, donc aucune autre configuration ne devrait être nécessaire pour la plupart des utilisateurs. Si vous avez déjà désactivé vos anciens paramètres réseau et vous êtes déconnecté de votre réseau, vous pouvez maintenant tester si NetworkManager fonctionnera. Démarrez d'abord NetworkManager.service.\n\nCertains applets vous fourniront un fichier .desktop afin que l'applet NetworkManager puisse être chargé via le menu de l'application. Si ce n'est pas le cas, vous devrez soit découvrir la commande à utiliser, soit vous déconnecter et vous reconnecter pour lancer l'applet. Une fois l'applet lancée, elle commencera probablement à interroger les connexions réseau pour une auto-configuration avec un serveur DHCP.\n\nPour démarrer l'applet GNOME dans des gestionnaires de fenêtres non conformes à xdg comme awesome :\n\n```\nnm-applet --sm-disable &.\n```\n\nPour les adresses IP statiques, vous devrez configurer NetworkManager pour les comprendre. Le processus consiste généralement à cliquer avec le bouton droit de la souris sur l'applet et à sélectionner quelque chose comme 'Edit Connections'.\n\n"
    },
    {
      "title": "Mots de passe Wi-Fi chiffrés",
      "level": 3,
      "content": "Par défaut, NetworkManager stocke les mots de passe en texte clair dans les fichiers de connexion à /etc/NetworkManager/system-connections/. Pour imprimer les mots de passe stockés, utilisez la commande suivante :\n\n```\n# grep -r '^psk=' /etc/NetworkManager/system-connections/}}.\n```\n\nLes mots de passe sont accessibles à l'utilisateur root dans le système de fichiers et aux utilisateurs ayant accès aux paramètres via l'interface graphique (par exemple, nm-applet).\n\nIl est préférable d'enregistrer les mots de passe sous forme chiffrée dans un trousseau de clés plutôt qu'en texte clair. L'inconvénient de l'utilisation d'un trousseau de clés est que les connexions doivent être configurées pour chaque utilisateur.\n\n"
    },
    {
      "title": "Utilisation du porte-clés GNOME",
      "level": 4,
      "content": "Le daemon du porte-clés doit être lancé et le porte-clés doit être déverrouillé pour que ce qui suit fonctionne.\n\nDe plus, NetworkManager doit être configuré pour ne pas stocker le mot de passe de tous les utilisateurs. En utilisant le network-manager-applet de GNOME, exécutez nm-connection-editor à partir d'un terminal, sélectionnez une connexion réseau, cliquez sur Edit, sélectionnez l'onglet Wifi-Security et cliquez sur l'icône de droite du mot de passe et cochez Store the password only for this user.\n\n"
    },
    {
      "title": "Utilisation du portefeuille KDE",
      "level": 4,
      "content": "En utilisant plasma-nm de KDE, cliquez sur l'applet, cliquez sur l'icône Settings en haut à droite, cliquez sur une connexion réseau, dans l'onglet General settings, décochez all users may connect to this network. Si l'option est cochée, les mots de passe seront toujours stockés en texte clair, même si un daemon de trousseau de clés est en cours d'exécution.\n\nSi l'option était sélectionnée précédemment et que vous la décochez, vous devrez peut-être utiliser l'option reset pour faire disparaître le mot de passe du fichier. Sinon, supprimez d'abord la connexion et configurez-la à nouveau.\n\n"
    },
    {
      "title": "Partage de la connexion Internet par Wi-Fi",
      "level": 3,
      "content": "Vous pouvez partager votre connexion Internet (par exemple 3G ou filaire) en quelques clics. Veuillez noter qu'un pare-feu peut interférer avec le partage d'Internet.\n\nVous aurez besoin d'une carte Wi-Fi qui prend en charge le mode AP, consultez Software access point#Wi-Fi device must support AP mode pour plus de détails.\n\nInstallez le paquet dnsmasq pour pouvoir réellement partager la connexion. Notez que NetworkManager démarre sa propre instance de dnsmasq, indépendamment de dnsmasq.service, en tant que serveur DHCP. Consultez #dnsmasq pour les avertissements.\n\nCréez la connexion partagée :\n\n- Cliquez sur l'applet et choisissez Create new wireless network.\n- Suivez l'assistant (choisissez WPA2 ou supérieur, assurez-vous d'utiliser un mot de passe d'au moins 8 caractères, les longueurs inférieures échoueront). Choisissez soit Hotspot ou Ad-hoc comme mode Wi-Fi.\n\n- Choisissez soit Hotspot ou Ad-hoc comme mode Wi-Fi.\n\nLa connexion sera enregistrée et restera stockée pour la prochaine fois que vous en aurez besoin.\n\n"
    },
    {
      "title": "Partage d'une connexion Internet via Ethernet",
      "level": 3,
      "content": "Scénario : votre appareil dispose d'une connexion Internet par Wi-Fi et vous souhaitez partager la connexion Internet avec d'autres appareils par Ethernet.\n\nConfiguration requise :\n\n- Installez les paquets dnsmasq et nm-connection-editor pour pouvoir réellement partager la connexion. Notez que NetworkManager démarre sa propre instance de dnsmasq, indépendamment de dnsmasq.service, en tant que serveur DHCP. Consultez #dnsmasq pour les mises en garde.\n- Votre appareil connecté à Internet et les autres appareils sont connectés par un câble Ethernet approprié (cela signifie généralement un câble croisé ou un commutateur entre les deux).\n- Le partage d'Internet n'est pas bloqué par un pare-feu.\n\nÉtapes :\n\n- Lancez nm-connection-editor dans le terminal.\n- Ajoutez une nouvelle connexion Ethernet.\n- Donnez-lui un nom sensé. Par exemple \"Internet partagé\".\n- Allez dans \"Paramètres IPv4\".\n- Pour \"Method :\", sélectionnez \"Shared to other computers\".\n- Sauvegardez.\n\nMaintenant vous devriez avoir une nouvelle option \"Shared Internet\" sous les connexions câblées dans NetworkManager.\n\n"
    },
    {
      "title": "Se connecter au réseau avec un secret au démarrage",
      "level": 3,
      "content": "Par défaut, NetworkManager ne se connectera pas aux réseaux nécessitant un secret automatiquement au démarrage. Cela est dû au fait qu'il verrouille ces connexions à l'utilisateur qui les établit par défaut, ne se connectant qu'après qu'il se soit connecté. Pour changer cela, faites ce qui suit :\n\n1. Cliquez du bouton droit de la souris sur l'icône nm-applet dans votre panneau et sélectionnez \"Éditer les connexions\", puis ouvrez l'onglet \"Sans fil\".\n1. Sélectionnez la connexion avec laquelle vous voulez travailler et cliquez sur le bouton \"Modifier\".\n1. Cochez les cases \"Connecter automatiquement\" et \"Disponible pour tous les utilisateurs\".\n1. En outre, assurez-vous que sous \"Sécurité Wi-Fi\", \"Stocker le mot de passe pour tous les utilisateurs (non chiffré)\" est sélectionné.\n\nDéconnectez-vous et reconnectez-vous pour terminer.\n\n"
    },
    {
      "title": "OpenConnect avec mot de passe dans KWallet",
      "level": 3,
      "content": "Bien que vous puissiez saisir les deux valeurs au moment de la connexion, plasma-nm 0.9.3.2-1 et plus sont capables de récupérer le nom d'utilisateur et le mot de passe OpenConnect directement à partir de KWallet.\n\nOuvrez \"KDE Wallet Manager\" et recherchez votre connexion VPN OpenConnect sous \"Network Management|Maps\". Cliquez sur \"Show values\" et entrez vos informations d'identification dans la clé \"VpnSecrets\" dans ce formulaire (remplacez username et password en conséquence) :\n\n```\nform:main:username%SEP%username%SEP%form:main:password%SEP%password.\n```\n\nLa prochaine fois que vous vous connecterez, le nom d'utilisateur et le mot de passe devraient apparaître dans la boîte de dialogue \"Secrets VPN\".\n\n"
    },
    {
      "title": "Ignorer des périphériques spécifiques",
      "level": 3,
      "content": "Parfois, on peut souhaiter que NetworkManager ignore des périphériques spécifiques et n'essaie pas de configurer des adresses et des routes pour eux. Vous pouvez rapidement et facilement ignorer les dispositifs par MAC ou nom d'interface en utilisant ce qui suit dans /etc/NetworkManager/conf.d/unmanaged.conf :\n\n```\n[keyfile]\nunmanaged-devices=mac:00:22:68:1c:59:b1;mac:00:1E:65:30:D1:C4;interface-name:eth0\n```\n\nAprès avoir modifié le fichier, exécutez nmcli general reload en tant que root. Ensuite, vous devriez être en mesure de configurer les interfaces sans que NetworkManager ne modifie ce que vous avez défini.\n\n"
    },
    {
      "title": "Configuration de la randomisation des adresses MAC",
      "level": 3,
      "content": "La randomisation de l'adresse MAC peut être utilisée pour améliorer la confidentialité en ne divulguant pas votre adresse MAC réelle au réseau.\n\nNetworkManager prend en charge deux types de randomisation des adresses MAC : la randomisation pendant le balayage ou pour les connexions réseau. Les deux modes peuvent être configurés en modifiant /etc/NetworkManager/NetworkManager.conf ou en créant un fichier de configuration distinct dans /etc/NetworkManager/conf.d/, ce qui est recommandé car le fichier de configuration susmentionné peut être écrasé par NetworkManager.\n\nLa randomisation pendant l'analyse Wi-Fi est activée par défaut, mais elle peut être désactivée en ajoutant les lignes suivantes à /etc/NetworkManager/NetworkManager.conf ou à un fichier de configuration dédié sous /etc/NetworkManager/conf.d :\n\n```\n/etc/NetworkManager/conf.d/wifi_rand_mac.conf\n```\n\n```\n[périphérique]\nwifi.scan-rand-mac-address=no\n```\n\nLa randomisation MAC pour les connexions réseau peut être réglée sur différents modes pour les interfaces sans fil et Ethernet. Consultez le post du blog de GNOME pour plus de détails sur les différents modes.\n\nEn termes de randomisation MAC, les modes les plus importants sont stable et random. stable génère une adresse MAC aléatoire lorsque vous vous connectez à un nouveau réseau et associe les deux de manière permanente. Cela signifie que vous utiliserez la même adresse MAC chaque fois que vous vous connecterez à ce réseau. En revanche, random génère une nouvelle adresse MAC à chaque fois que vous vous connectez à un réseau, nouveau ou déjà connu. Vous pouvez configurer la randomisation MAC en ajoutant la configuration souhaitée sous /etc/NetworkManager/conf.d :\n\n```\n/etc/NetworkManager/conf.d/wifi_rand_mac.conf\n```\n\n```\n[device-mac-randomization]\n# \"yes\" est déjà la valeur par défaut pour le scan\nwifi.scan-rand-mac-address=yes\n \n[connection-mac-randomization]\n# Randomiser le MAC pour chaque connexion ethernet\nethernet.cloned-mac-address=random\n# Générer un MAC aléatoire pour chaque WiFi et associer les deux de façon permanente.\nwifi.cloned-mac-address=stable\n```\n\nConsultez l'article suivant du blog de GNOME pour plus de détails.\n\n"
    },
    {
      "title": "Activer les extensions de confidentialité IPv6",
      "level": 3,
      "content": "Consultez IPv6#NetworkManager.\n\n"
    },
    {
      "title": "Configurer un DUID unique par connexion",
      "level": 3,
      "content": "L'identifiant unique DHCPv6 (DUID) est une valeur utilisée par le client DHCPv6 pour s'identifier auprès des serveurs DHCPv6. NetworkManager prend en charge 3 types de DUID :\n\n- DUID-UUID (RFC 6355) : généré à partir d'un Universally Unique IDentifier (UUID).\n- DUID-LL (RFC 3315) : généré à partir de l'adresse Link-Layer (soit l'adresse MAC).\n- DUID-LLT (RFC 3315) : généré à partir de l'adresse Link-Layer plus un timestamp.\n\nSi le client DHCP du NetworkManager interne est utilisé (par défaut), il s'identifiera avec un DUID-UUID global et permanent généré à partir du machine-id (/etc/machine-id). Cela signifie que toutes les connexions partagent le même UUID, ce qui peut constituer une atteinte à la vie privée.\n\nHeureusement, NetworkManager est capable de fournir des DUIDs uniques par connexion, dérivés du stable-id de la connexion et d'une clé unique par hôte. Vous pouvez activer cela en ajoutant la configuration suivante sous /etc/NetworkManager/conf.d :\n\n```\n/etc/NetworkManager/conf.d/duid.conf\n```\n\n```\n[connexion]\nipv6.dhcp-duid=stable-uuid\n```\n\nLes valeurs stable-ll et stable-llt sont également prises en charge. Pour plus d'informations, lisez la description de dhcp-duid dans nm-settings(5) § ipv6 setting.\n\n"
    },
    {
      "title": "Travailler avec des connexions câblées",
      "level": 3,
      "content": "Par défaut, NetworkManager génère un profil de connexion pour chaque connexion Ethernet filaire qu'il trouve. Au moment où il génère la connexion, il ne sait pas s'il y aura d'autres adaptateurs Ethernet disponibles. Par conséquent, il appelle la première connexion filaire \"Connexion filaire 1\". Vous pouvez éviter de générer cette connexion en configurant no-auto-default. (consultez NetworkManager.conf(5)), ou en la supprimant tout simplement. NetworkManager se souviendra alors de ne plus générer de connexion pour cette interface.\n\nVous pouvez également modifier la connexion (et la persister sur le disque) ou la supprimer. NetworkManager ne générera pas à nouveau une nouvelle connexion. Ensuite, vous pouvez changer le nom en ce que vous voulez. Vous pouvez utiliser quelque chose comme nm-connection-editor pour cette tâche.\n\n"
    },
    {
      "title": "Utiliser iwd comme backend Wi-Fi",
      "level": 3,
      "content": "- N'activez pas iwd.service ou ne configurez pas manuellement iwd. NetworkManager le lancera et le gérera lui-même.\n- Prenez en compte les problèmes connus avant de passer à iwd.\n\nPour activer le backend expérimental iwd[dead link 2024-10-12 ⓘ], installez iwd puis créez le fichier de configuration suivant :\n\n```\n/etc/NetworkManager/conf.d/wifi_backend.conf\n```\n\n```\n[device]\nwifi.backend=iwd\n```\n\nAlternativement, vous pouvez installer networkmanager-iwdAUR, un paquet modifié configuré pour construire NetworkManager travaillant exclusivement avec iwd, avec la différence principale que iwd est requis et que wpa_supplicant peut être désinstallé après la construction.\n\n"
    },
    {
      "title": "Exécution dans un espace de nom de réseau",
      "level": 3,
      "content": "Si vous souhaitez exécuter NetworkManager à l'intérieur d'un espace de noms réseau (par exemple, pour gérer un périphérique spécifique qui doit être utilisé par des applications sélectionnées), mettez le périphérique hors service avant de le déplacer vers l'espace de noms :\n\n```\n$ ip link set dev MY_DEVICE down\n$ ip link set dev MY_DEVICE netns MY_NAMESPACE\n$ ip netns exec MON_Espace_de_Nom. NetworkManager\n...\n$ ip netns exec MY_NAMESPACE killall NetworkManager\n```\n\nsinon NetworkManager échouera plus tard à établir la connexion avec une erreur device is strictly unmanaged.\n\n"
    },
    {
      "title": "Connexion automatique au VPN",
      "level": 3,
      "content": "NetworkManager peut être configuré pour se connecter automatiquement à un VPN lors de la connexion à l'Internet, sur une base par réseau. La connexion VPN elle-même peut être ajoutée dans l'interface NetworkManager de GNOME, mais pour qu'elle utilise automatiquement le VPN, il faut utiliser nmcli. D'autres interfaces peuvent ne pas avoir cette limitation.\n\nTout d'abord, assurez-vous de rendre la connexion VPN disponible pour tous les utilisateurs. Dans GNOME, il suffit de cocher une case dans l'onglet details. Sous l'onglet Identity, dans le champ du mot de passe, cliquez sur l'icône à droite dans le champ, et réglez-le sur Store the password for all users.\n\nTrouvez ensuite l'UUID de la connexion VPN, et ajoutez-le à connection.secondaries de la connexion Internet :\n\n```\n# UUID=$(nmcli --get-values connection.uuid connection show name-of-VPN-connection)\n# nmcli connection modify name-of-Internet-connection connection.secondaries \"$UUID\"\n```\n\nMaintenant, lorsque NetworkManager est redémarré et que vous vous connectez à la connexion Internet que vous avez configurée, vous devriez être automatiquement connecté au VPN.\n\n"
    },
    {
      "title": "Pas d'invite pour le mot de passe des réseaux Wi-Fi sécurisés",
      "level": 3,
      "content": "Lorsque vous essayez de vous connecter à un réseau Wi-Fi sécurisé, aucune demande de mot de passe ne s'affiche et aucune connexion n'est établie. Cela se produit lorsqu'aucun paquet de trousseau de clés n'est installé. Une solution simple consiste à installer gnome-keyring. Si vous souhaitez que les mots de passe soient stockés sous forme chiffrée, suivez GNOME Keyring pour configurer le gnome-keyring-daemon.\n\n"
    },
    {
      "title": "Gestion du réseau désactivée",
      "level": 3,
      "content": "Lorsque NetworkManager s'arrête mais que le fichier pid (état) n'est pas supprimé, vous consulterez un message Gestion réseau désactivée. Si cela se produit, supprimez le fichier manuellement :\n\n```\n# rm /var/lib/NetworkManager/NetworkManager.state\n```\n\n"
    },
    {
      "title": "Problèmes avec le client DHCP interne",
      "level": 3,
      "content": "Si vous avez des problèmes pour obtenir une adresse IP en utilisant le client DHCP interne, envisagez d'utiliser un autre client DHCP, consultez #Client DHCP pour les instructions. Cette solution de contournement pourrait résoudre les problèmes des grands réseaux sans fil comme eduroam.\n\n"
    },
    {
      "title": "Problèmes DHCP avec dhclient",
      "level": 3,
      "content": "Si vous avez des problèmes pour obtenir une adresse IP via DHCP, essayez d'ajouter ce qui suit à votre /etc/dhclient.conf :\n\n```\ninterface \"eth0\" {\n   send dhcp-client-identifier 01:aa:bb:cc:dd:ee:ff ;\n }\n```\n\nOù aa:bb:cc:dd:ee:ff est l'adresse MAC de cette NIC. L'adresse MAC peut être trouvée en utilisant la commande ip link show interface du paquet iproute2.\n\n"
    },
    {
      "title": "Modem 3G non détecté",
      "level": 3,
      "content": "Consultez Mobile broadband modem#NetworkManager.\n\n"
    },
    {
      "title": "Désactiver le WLAN sur les ordinateurs portables",
      "level": 3,
      "content": "Parfois, NetworkManager ne fonctionne pas lorsque vous désactivez votre adaptateur Wi-Fi avec un interrupteur sur votre ordinateur portable et que vous essayez de le réactiver par la suite. Ceci est souvent un problème avec rfkill. Pour vérifier si le pilote notifie rfkill de l'état de l'adaptateur sans fil, utilisez :\n\n```\n$ watch -n1 rfkill list all\n```\n\nSi un identifiant reste bloqué après avoir allumé l'adaptateur, vous pouvez essayer de le débloquer manuellement avec (où X est le numéro de l'identifiant fourni par la sortie ci-dessus) :\n\n```\n# rfkill event unblock X\n```\n\n"
    },
    {
      "title": "Les paramètres d'adresse IP statique se transforment en DHCP",
      "level": 3,
      "content": "En raison d'un bogue non résolu, lors de la modification des connexions par défaut à une adresse IP statique, nm-applet peut ne pas stocker correctement le changement de configuration, et reviendra au DHCP automatique.\n\nPour contourner ce problème, vous devez modifier la connexion par défaut (par exemple \"Auto eth0\") dans nm-applet, changer le nom de la connexion (par exemple \"my eth0\"), décocher la case \"Available to all users\", modifier les paramètres de votre adresse IP statique comme vous le souhaitez, et cliquer sur Appliquer. Cela permettra d'enregistrer une nouvelle connexion avec le nom donné.\n\nEnsuite, vous voudrez faire en sorte que la connexion par défaut ne se connecte pas automatiquement. Pour ce faire, exécutez nm-connection-editor. (not en tant que root). Dans l'éditeur de connexion, modifiez la connexion par défaut (par exemple \"Auto eth0\") et décochez \"Connecter automatiquement\". Cliquez sur Appliquer et fermez l'éditeur de connexion.\n\n"
    },
    {
      "title": "Impossible de modifier les connexions en tant qu'utilisateur normal",
      "level": 3,
      "content": "Consultez #Configurer les permissions de PolicyKit.\n\n"
    },
    {
      "title": "Oublier le réseau sans fil caché",
      "level": 3,
      "content": "Comme les réseaux cachés ne sont pas affichés dans la liste de sélection de la vue Sans fil, ils ne peuvent pas être oubliés (supprimés) avec l'interface graphique. Vous pouvez en supprimer un avec la commande suivante :\n\n```\n# rm /etc/NetworkManager/system-connections/SSID\n```\n\nCela fonctionne également pour toute autre connexion.\n\n"
    },
    {
      "title": "Le VPN ne fonctionne pas dans GNOME",
      "level": 3,
      "content": "Lorsque vous configurez des connexions OpenConnect ou vpnc dans NetworkManager en utilisant GNOME, il arrive que vous ne consultiez jamais la boîte de dialogue et que l'erreur suivante apparaisse dans /var/log/errors.log :\n\n```\nlocalhost NetworkManager[399]: <error> [1361719690.10506] [nm-vpn-connection.c:1405] get_secrets_cb(): Failed to request VPN secrets #3: (6) No agents were available for this request.\n```\n\nCeci est dû au fait que l'applet NetworkManager de GNOME s'attend à ce que les scripts de dialogue se trouvent dans /usr/lib/gnome-shell, alors que les paquets de NetworkManager les placent dans /usr/lib/networkmanager. Comme correction \"temporaire\" (ce bogue existe depuis un certain temps maintenant), faites le(s) lien(s) symbolique(s) suivant(s) :\n\n- Pour OpenConnect : ln -s /usr/lib/networkmanager/nm-openconnect-auth-dialog /usr/lib/gnome-shell/\n- Pour le VPNC (c'est-à-dire le VPN Cisco) : ln -s /usr/lib/networkmanager/nm-vpnc-auth-dialog /usr/lib/gnome-shell/.\n\nIl peut être nécessaire d'effectuer cette opération pour d'autres plugins VPN de NetworkManager, mais ce sont les deux plus courants.\n\n"
    },
    {
      "title": "Impossible de se connecter aux réseaux sans fil européens visibles",
      "level": 3,
      "content": "Les puces WLAN sont livrées avec un domaine réglementaire par défaut. Si votre point d'accès ne fonctionne pas dans ces limites, vous ne pourrez pas vous connecter au réseau. Il est facile de résoudre ce problème :\n\n1. Installez wireless-regdb\n1. Décommentez le code pays correct dans /etc/conf.d/wireless-regdom.\n1. Redémarrez le système, car le paramètre n'est lu qu'au démarrage.\n\n"
    },
    {
      "title": "La connexion automatique au VPN au démarrage ne fonctionne pas",
      "level": 3,
      "content": "Le problème se produit lorsque le système (c'est-à-dire NetworkManager s'exécutant en tant qu'utilisateur root) tente d'établir une connexion VPN, mais le mot de passe n'est pas accessible car il est stocké dans le trousseau GNOME d'un utilisateur particulier.\n\nUne solution est de garder le mot de passe de votre VPN en clair, comme décrit dans l'étape (2.) de #Utiliser le dispatcher pour se connecter à un VPN après l'établissement d'une connexion réseau.\n\nVous n'avez plus besoin d'utiliser le répartiteur décrit à l'étape (1.) pour vous connecter automatiquement, si vous utilisez la nouvelle option \"auto-connect VPN\" de l'interface graphique nm-applet.\n\n"
    },
    {
      "title": "Goulot d'étranglement Systemd",
      "level": 3,
      "content": "Avec le temps, les fichiers journaux (/var/log/journal) peuvent devenir très volumineux. Cela peut avoir un impact important sur les performances de démarrage lors de l'utilisation de NetworkManager, consultez : Systemd (Français)#Le temps de démarrage augmente avec le temps.\n\n"
    },
    {
      "title": "Déconnexions régulières du réseau, latence et paquets perdus (WiFi)",
      "level": 3,
      "content": "NetworkManager effectue un scan toutes les 2 minutes.\n\nCertains pilotes WiFi ont des problèmes lors de la recherche de stations de base lorsqu'ils sont connectés/associés. Les symptômes incluent des déconnexions/reconnexions VPN et des paquets perdus, des pages Web qui ne se chargent pas puis se rafraîchissent correctement.\n\nL'exécution de journalctl -f en tant que root indiquera que cela se produit, des messages comme les suivants seront contenus dans les journaux à intervalles réguliers.\n\n```\nNetworkManager[410] : <info> (wlp3s0) : roamed from BSSID 00:14:48:11:20:CF (my-wifi-name) to (none) ((none))\n```\n\nSi le roaming n'est pas important, le comportement de balayage périodique peut être désactivé en verrouillant le BSSID du point d'accès dans le profil de connexion WiFi.\n\n"
    },
    {
      "title": "Impossible d'allumer le Wi-Fi avec un ordinateur portable Lenovo (IdeaPad, Legion, etc.)",
      "level": 3,
      "content": "Il y a un problème avec le module ideapad_laptop sur certains modèles Lenovo, le pilote Wi-Fi signalant à tort un blocage logiciel. La carte peut toujours être manipulée avec netctl, mais les gestionnaires comme NetworkManager ne fonctionnent pas. Vous pouvez vérifier que c'est bien là le problème en consultant la sortie de rfkill list après avoir basculé votre commutateur matériel et en consultant la persistance du blocage logiciel.\n\nDécharger le module ideapad_laptop devrait résoudre ce problème. (attention : ceci peut désactiver le clavier et le touchpad de l'ordinateur portable aussi !).\n\n"
    },
    {
      "title": "Désactiver l'envoi du nom d'hôte",
      "level": 3,
      "content": "NetworkManager envoie par défaut le nom d'hôte au serveur DHCP. L'envoi du nom d'hôte ne peut être désactivé que par connexion et non globalement (Rapport n°584).\n\nPour désactiver l'envoi du nom d'hôte au serveur DHCP pour une connexion spécifique, ajoutez ce qui suit à votre fichier de connexion réseau :\n\n```\n/etc/NetworkManager/system-connections/your_connection_file\n```\n\n```\n...\n[ipv4]\ndhcp-send-hostname=false\n...\n[ipv6]\ndhcp-send-hostname=false\n...\n```\n\n"
    },
    {
      "title": "nm-applet disparaît dans i3wm",
      "level": 3,
      "content": "Si vous utilisez le xfce4-notifyd.service pour les notifications, éditez l'unité et ajoutez ce qui suit :\n\n```\n/etc/systemd/user/xfce4-notifyd.service.d/display_env.conf\n```\n\n```\n[Service]\nEnvironnement=\"DISPLAY=:0.0\"\n```\n\nAprès avoir rechargé les daemons, redémarrez xfce4-notifyd.service. Quittez i3 et redémarrez-le. L'applet devrait apparaître dans la zone de notification.\n\n"
    },
    {
      "title": "Les icônes de la barre d'état système de nm-applet s'affichent mal",
      "level": 3,
      "content": "Actuellement, les icônes de la barre d'état système de nm-applet sont dessinées l'une sur l'autre, c'est-à-dire que l'icône indiquant la puissance du réseau sans fil peut s'afficher au-dessus de l'icône indiquant l'absence de connexion filaire. Il s'agit apparemment d'un bogue/problème de GTK3 : https://gitlab.gnome.org/GNOME/gtk/issues/1280 .\n\nUne version corrigée de GTK3 existe dans AUR, qui apparemment corrige le bogue de l'icône de la barre d'état : gtk3-classicAUR.\n\n"
    },
    {
      "title": "Unité dbus-org.freedesktop.resolve1.service non trouvée",
      "level": 3,
      "content": "Si systemd-resolved.service n'est pas démarré, NetworkManager essaiera de le démarrer en utilisant D-Bus et échouera :\n\n```\ndbus-daemon[991]: [system] Activating via systemd: service name='org.freedesktop.resolve1' unit='dbus-org.freedesktop.resolve1.service' requested by ':1.23' (uid=0 pid=1012 comm=\"/usr/bin/NetworkManager --no-daemon \")\ndbus-daemon[991]: [system] Activation via systemd failed for unit 'dbus-org.freedesktop.resolve1.service': Unit dbus-org.freedesktop.resolve1.service not found.\ndbus-daemon[991]: [system] Activating via systemd: service name='org.freedesktop.resolve1' unit='dbus-org.freedesktop.resolve1.service' requested by ':1.23' (uid=0 pid=1012 comm=\"/usr/bin/NetworkManager --no-daemon \")\n```\n\nCeci est dû au fait que NetworkManager essaiera d'envoyer les informations DNS à systemd-resolved sans tenir compte du paramètre main.dns= dans NetworkManager.conf(5). [7]\n\nCeci peut être désactivé avec un fichier de configuration dans /etc/NetworkManager/conf.d/ :\n\n```\n/etc/NetworkManager/conf.d/no-systemd-resolved.conf\n```\n\n```\n[main]\nsystemd-resolved=false\n```\n\nConsultez FS#62138.\n\n"
    },
    {
      "title": "Les secrets étaient requis, mais non fournis",
      "level": 3,
      "content": "Si vous tentez de vous connecter à un réseau en utilisant nmcli device wifi connect SSID password password et que vous recevez l'erreur suivante :\n\n```\nError: Connection activation failed: (7) Secrets were required, but not provided\n```\n\nCette erreur peut avoir de nombreuses causes et vous devez lire le journal (filtrez-le avec -u NetworkManager). Par exemple, si NetworkManager a pris trop de temps pour établir la connexion, il croira que le mot de passe est incorrect :\n\n```\nNetworkManager[1372]: <warn>  [1643991888.3808] device (wlan0): Activation: (wifi) association took too long\nNetworkManager[1372]: <info>  [1643991888.3809] device (wlan0): state change: config -> need-auth (reason 'none', sys-iface-state: 'managed')\nNetworkManager[1372]: <warn>  [1643991888.3838] device (wlan0): Activation: (wifi) asking for new secrets\n```\n\nVous pouvez essayer de supprimer le profil de connexion et d'en créer un nouveau :\n\n```\n$ nmcli connection delete SSID (supprimer le SSID)\n$ nmcli device wifi connect SSID password mot de passe.\n```\n\nVous pouvez également essayer de désactiver la randomisation des adresses MAC :\n\n```\n/etc/NetworkManager/conf.d/wifi_rand_mac.conf\n```\n\n```\n[device]\nwifi.scan-rand-mac-address=no\n```\n\n"
    },
    {
      "title": "Connexion WPA Enterprise avec iwd",
      "level": 3,
      "content": "Si vous essayez de vous connecter à un réseau WPA Enterprise comme 'eduroam' avec NetworkManager avec le backend iwd, vous obtiendrez l'erreur suivante de NetworkManager :\n\n```\nConnection 'eduroam' is not avialable on device wlan0 because profile is not compatible with device (802.1x connections must have IWD provisioning files)\n```\n\nCeci est dû au fait que NetworkManager ne peut pas configurer un réseau WPA Enterprise. Vous devez donc le configurer en utilisant un fichier de configuration iwd /var/lib/iwd/essid.8021x comme décrit dans iwd#WPA Enterprise.\n\n"
    },
    {
      "title": "Échec de la demande de secrets VPN",
      "level": 3,
      "content": "Si vous obtenez cette erreur :\n\n```\nFailed to request VPN secrets #1 : No agents were available for this request.\n```\n\nC'est soit parce que le mot de passe est vide ou que vous devez configurer les permissions PolicyKit.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- NetworkManager pour les administrateurs Partie 1\n- Wikipedia:NetworkManager\n- Site officiel de NetworkManager\n\n"
    }
  ]
}