{
  "title": "NetworkManager (Português)",
  "url": "https://wiki.archlinux.org/title/NetworkManager_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Configuração de rede\n- Configuração de rede sem fio\n\nO NetworkManager é um programa que provê a detecção e configuração automática de redes para computadores. As funcionalidades do NetworkManager são úteis para redes sem fio e cabeadas. Nas redes sem fio, o NetworkManager terá preferência pelas redes que já conhece, e possui a habilidade para trocar para a rede mais confiável sempre que disponível. Aplicativos preparados para o NetworkManager podem trocar do modo online para o offline. O NetworkManager tem preferência pelas redes cabeadas em detrimento das redes sem fio, e possui suporte a certos tipos de VPN. Foi originalmente desenvolvido pela Red Hat e agora, é hospedado no projeto GNOME.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "O NetworkManager pode ser instalado com o pacote networkmanager, que contém um daemon, uma interface de linha de comando (nmcli) e uma interface baseada em curses (nmtui).\n\n"
    },
    {
      "title": "Habilitar NetworkManager",
      "level": 3,
      "content": "Após a instalação, você deve iniciar/habilitar NetworkManager.service. Uma vez iniciado o daemon do NetworkManager, ele se conectará automaticamente a todas as \"conexões do sistema\" disponíveis que já foram configuradas. Quaisquer \"conexões de usuário\" ou conexões não configuradas precisarão de nmcli ou um miniaplicativo para configurar e conectar.\n\n"
    },
    {
      "title": "Interfaces adicionais",
      "level": 3,
      "content": "- nm-connection-editor para uma interface gráfica de usuário,\n- network-manager-applet para um miniaplicativo de bandeja de sistema (nm-applet).\n\n"
    },
    {
      "title": "Suporte a banda larga móvel",
      "level": 3,
      "content": "Instale os pacotes modemmanager, mobile-broadband-provider-info e usb_modeswitch para um suporte a conexão de banda larga móvel. Veja USB 3G Modem#NetworkManager para detalhes.\n\n"
    },
    {
      "title": "Suporte a PPPoE / DSL",
      "level": 3,
      "content": "Instale o pacote rp-pppoe para suporte a conexão PPPoE/DSL. Para realmente adicionar uma conexão PPPoE, use nm-connection-editor e adicione uma nova conexão DSL/PPPoE.\n\n"
    },
    {
      "title": "Suporte a VPN",
      "level": 3,
      "content": "O NetworkManager desde a versão 1.16 tem suporte nativo ao WireGuard, precisando apenas de seu módulo de kernel wireguard. Leia o WireGuard na publicação de blog do NetworkManager.\n\nO suporte para outros tipos de VPN é baseado em um sistema de plug-in. Eles são fornecidos nos seguintes pacotes:\n\n- networkmanager-openconnect para OpenConnect\n- networkmanager-openvpn para OpenVPN\n- networkmanager-pptp para PPTP Client\n- networkmanager-strongswan para strongSwan\n- networkmanager-vpnc\n- networkmanager-fortisslvpn-gitAUR[link quebrado: package not found]\n- networkmanager-iodine-gitAUR\n- networkmanager-libreswanAUR\n- networkmanager-l2tp\n- networkmanager-ssh-gitAUR\n- network-manager-sstp\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "NetworkManager vem com nmcli(1) e nmtui(1).\n\n"
    },
    {
      "title": "Exemplos de nmcli",
      "level": 3,
      "content": "Lista redes wifi próximas:\n\n```\n$ nmcli device wifi list\n```\n\nConecta a uma rede wifi:\n\n```\n$ nmcli device wifi connect SSID password senha\n```\n\nConecta a uma rede oculta:\n\n```\n$ nmcli device wifi connect SSID password senha hidden yes\n```\n\nConecta a um wifi na interface de rede wlan1:\n\n```\n$ nmcli device wifi connect SSID password senha ifname wlan1 nome_perfil\n```\n\nDesconecta uma interface:\n\n```\n$ nmcli device disconnect ifname eth0\n```\n\nReconecta uma interface marcada como desconectada:\n\n```\n$ nmcli connection up uuid UUID\n```\n\nObtém uma lista de UUIDs:\n\n```\n$ nmcli connection show\n```\n\nVê uma lista de dispositivos de rede e seus estados:\n\n```\n$ nmcli device\n```\n\nDesliga o wifi:\n\n```\n$ nmcli radio wifi off\n```\n\n"
    },
    {
      "title": "Editar uma conexão",
      "level": 3,
      "content": "Para uma lista compreensiva de configurações, veja nm-settings(5).\n\nEm primeiro lugar você precisa obter lista de conexões:\n\n```\n$ nmcli connection\n```\n\n```\nNAME                UUID                                  TYPE      DEVICE\nConexão cabeada 2   e7054040-a421-3bef-965d-bb7d60b7cecf  ethernet  enp5s0\nConexão cabeada 1   997f2782-f0fc-301d-bfba-15421a2735d8  ethernet  enp0s25\nMEU-WIFI-DE-CASA    92a0f7b3-2eba-49ab-a899-24d83978f308  wifi       --\n```\n\nAqui você pode usar a primeira coluna como ID de conexão usada posteriormente. Neste exemplo, escolhemos Conexão cabeada 2 como um ID de conexão.\n\nVocê pode ter três métodos para configurar uma conexão após Conexão cabeada 2 ter sido criada:\n\n"
    },
    {
      "title": "Front-ends",
      "level": 2,
      "content": "Para configurar e ter acesso fácil ao NetworkManager, a maioria dos usuários desejará instalar um applet. Esse front-end da GUI geralmente reside na bandeja do sistema (ou na área de notificação) e permite a seleção de rede e a configuração do NetworkManager. Vários ambientes de área de trabalho possuem seu próprio applet. Caso contrário, você pode usar #nm-applet.\n\n"
    },
    {
      "title": "GNOME",
      "level": 3,
      "content": "O GNOME tem uma ferramenta embutida, acessível a partir das configurações de Rede.\n\n"
    },
    {
      "title": "KDE Plasma",
      "level": 3,
      "content": "Instale o pacote plasma-nm. Em seguida, adicione-o à barra de tarefas do KDE por meio do menu Opções de painel > Adicionar widgets > Redes.\n\n"
    },
    {
      "title": "nm-applet",
      "level": 3,
      "content": "network-manager-applet é um front-end em GTK 3 que funciona sob ambientes Xorg com uma bandeja de sistema.\n\nPara armazenar conexões secretas, instale e configure GNOME/Keyring.\n\nEsteja ciente de que depois de ativar a opção caixa de seleção Disponibilizar para outros usuários para uma conexão, o NetworkManager armazena a senha em texto simples, embora o respectivo arquivo seja acessível apenas para root (ou outros usuários via nm-applet). Veja #Senhas de Wi-Fi criptografadas.\n\nPara executar nm-applet sem uma bandeja do sistema, você pode usar trayer ou stalonetray. Por exemplo, você pode adicionar um script como este em seu caminho:\n\n```\nnmgui\n```\n\n```\n#!/bin/sh\nnm-applet    2>&1 > /dev/null &\nstalonetray  2>&1 > /dev/null\nkillall nm-applet\n```\n\nQuando você fecha a janela stalonetray, ela fecha nm-applet também, então nenhuma memória extra é usada quando você terminar as configurações de rede.\n\nO applet pode mostrar notificações de eventos, como conexão ou desconexão de uma rede WiFi. Para que essas notificações sejam exibidas, verifique se você tem um servidor de notificação instalado - consulte Notificações na área de trabalho. Se você usar o applet sem um servidor de notificação, poderá ver algumas mensagens em stdout/stderr e o aplicativo poderá ser interrompido. Veja [1].\n\nPara executar nm-applet com tais notificações desabilitadas, inicie o miniaplicativo com o seguinte comando:\n\n```\n$ nm-applet --no-agent\n```\n\n```\nExec=nm-applet --no-agent\n```\n\n"
    },
    {
      "title": "Appindicator",
      "level": 4,
      "content": "Desde a versão 1.18.0, o suporte do Appindicator está disponível no pacote oficial network-manager-applet. Para usar o nm-applet em um ambiente Appindicator, inicie o miniaplicativo com o seguinte comando:\n\n```\n$ nm-applet --indicator\n```\n\n"
    },
    {
      "title": "networkmanager-dmenu",
      "level": 3,
      "content": "Como alternativa, existe o networkmanager-dmenu-gitAUR, que é um pequeno script para gerenciar as conexões do NetworkManager com o dmenu ou rofi em vez do nm-applet. Ele fornece todos os recursos essenciais, como conexão com conexões Wi-Fi ou com fio existentes do NetworkManager, conexão a novas conexões Wi-Fi, solicitações de senha, se necessário, conexão VPN existente, habilitação/desabilitação de rede e inicialização da interface gráfica nm-connection-editor, conexão a redes Bluetooth.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "O NetworkManager exigirá algumas etapas adicionais para poder funcionar corretamente. Certifique-se de ter configurado /etc/hosts como descrito na seção Configuração de rede#Configurando um hostname.\n\nO NetworkManager possui um arquivo de configuração global em /etc/NetworkManager/NetworkManager.conf. Arquivos de configuração adicionais podem ser colocados em /etc/NetworkManager/conf.d/. Geralmente, nenhuma configuração precisa ser feita para os padrões globais.\n\nApós editar um arquivo de configuração, as alterações podem ser aplicadas executando:\n\n```\n# nmcli general reload\n```\n\n"
    },
    {
      "title": "Habilitar NetworkManager Wait Online",
      "level": 3,
      "content": "Se você tiver serviços que falham se eles forem iniciados antes que a rede esteja ativa, você pode usar o NetworkManager-wait-online.service além do NetworkManager.service. Isso, no entanto, raramente é necessário porque a maioria dos daemons em rede é inicializada corretamente, mesmo que a rede ainda não tenha sido configurada.\n\nEm alguns casos, o serviço ainda falhará ao iniciar com sucesso na inicialização devido à configuração de tempo limite em /usr/lib/systemd/system/NetworkManager-wait-online.service ser muito curta. Altere o tempo limite padrão de 30 para um valor mais alto.\n\n"
    },
    {
      "title": "Configurar as permissões de PolicyKit",
      "level": 3,
      "content": "Veja Solução de problemas gerais#Permissões de sessão para como configurar uma sessão de trabalho.\n\nCom uma sessão de trabalho, você tem várias opções para conceder os privilégios necessários ao NetworkManager:\n\n- Opção 1. Execute um agente de autenticação Polkit ao efetuar login, como /usr/lib/polkit-gnome/polkit-gnome-authentication-agent-1 (parte do polkit-gnome). Você será solicitado a fornecer sua senha sempre que adicionar ou remover uma conexão de rede.\n- Opção 2. Adicione a si próprio ao grupo wheel. Você não precisará inserir sua senha, mas a sua conta de usuário também poderá receber outras permissões, como a capacidade de usar o sudo sem digitar a senha do root.\n- Opção 3. Adicione a si próprio ao grupo network e crie o seguinte arquivo:\n\n```\n/etc/polkit-1/rules.d/50-org.freedesktop.NetworkManager.rules\n```\n\n```\npolkit.addRule(function(action, subject) {\n  if (action.id.indexOf(\"org.freedesktop.NetworkManager.\") == 0 && subject.isInGroup(\"network\")) {\n    return polkit.Result.YES;\n  }\n});\n```\n\n"
    },
    {
      "title": "Configurações de proxy",
      "level": 3,
      "content": "O NetworkManager não lida diretamente com configurações de proxy, mas se você estiver usando o GNOME ou KDE, você pode usar o proxydriver que lida com configurações de proxy usando Informações do NetworkManager. O proxydriver é encontrado no pacote proxydriverAUR[link quebrado: package not found].\n\nPara que o proxydriver possa alterar as configurações do proxy, você precisaria executar este comando, como parte do processo de inicialização do GNOME (veja GNOME (Português)#Inicialização automática):\n\n```\nxhost +si:localuser:nome_de_usuário\n```\n\nVeja também as configurações de proxy.\n\n"
    },
    {
      "title": "Verificando conectividade",
      "level": 3,
      "content": "NetworkManager pode tentar alcançar uma página na Internet ao conectar a uma rede. networkmanager está configurado por padrão em /usr/lib/NetworkManager/conf.d/20-connectivity.conf para verificar a conectividade com o archlinux.org. Para usar um servidor web diferente ou desabilitar a verificação de conectividade, crie /etc/NetworkManager/conf.d/20-connectivity.conf, veja NetworkManager.conf(5) § CONNECTIVITY SECTION. Segue abaixo um exemplo de uso de servidores do GNOME (não requer o uso de GNOME em si):\n\n```\n/etc/NetworkManager/conf.d/20-connectivity.conf\n```\n\n```\n[connectivity]\nuri=http://nmcheck.gnome.org/check_network_status.txt\n```\n\n"
    },
    {
      "title": "Portais cativos",
      "level": 3,
      "content": "Para aqueles que estão por trás de um portal cativo (captive portal), o gerenciador de desktop pode abrir automaticamente uma janela solicitando credenciais. Se sua área de trabalho não funcionar, você pode usar o pacote capnet-assist (no entanto, atualmente ele possui um script de dispatcher quebrado do NetworkManager). Como alternativa, você pode criar um script de expedidor do NetworkManager com o seguinte conteúdo:\n\n```\n/etc/NetworkManager/dispatcher.d/90-open_captive_portal\n```\n\n```\n#!/bin/sh -e\n# Script to dispatch NetworkManager events\n#\n# Runs shows a login webpage on walled garden networks.\n# See NetworkManager(8) for further documentation of the dispatcher events.\n\nPATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin\n\nif [ -x \"/usr/bin/logger\" ]; then\n    logger=\"/usr/bin/logger -s -t captive-portal\"\nelse\n    logger=\":\"\nfi\n\nwait_for_process() {\n    PNAME=$1\n    while [ -z \"$(/usr/bin/pgrep $PNAME)\" ]; do\n        sleep 3;\n    done\n}\n\n#launch the browser, but on boot we need to wait that nm-applet starts\nstart_browser() {\n    local user=\"$1\"\n    local display=\"$2\"\n\n    export DISPLAY=\"$display\"\n    wait_for_process nm-applet\n\n    export XAUTHORITY=\"/home/$user/.Xauthority\"\n\n    $logger \"Running browser as '$user' with display '$display' to login in captive portal\"\n    sudo -u \"$user\" --preserve-env=DISPLAY,XAUTHORITY -H xdg-open http://capnet.elementary.io 2>&1 > /dev/null\n}\n\n# Run the right scripts\ncase \"$2\" in\n    connectivity-change)\n    $logger -p user.debug \"dispatcher script triggered on connectivity change: $CONNECTIVITY_STATE\"\n    if [ \"$CONNECTIVITY_STATE\" = \"PORTAL\" ]; then\n        # Match last column of who's output with ' :[at least one digit] '\n        who | awk '$NF ~ /\\(:[0-9]+\\)/ { print $1 \" \" substr($NF, 2, length($NF)-2) };' | \\\n        while read user display; do\n            start_browser $user $display || $logger -p user.err \"Failed for user: '$user' display: '$display'\"\n        done\n    fi\n    ;;\n    *)\n    # In a down phase\n    exit 0\n    ;;\nesac\n```\n\nVocê precisará reiniciar NetworkManager.service ou reiniciar para que isso comece a funcionar. Depois disso, o script do expedidor deve abrir uma janela de login assim que detectar que você está atrás de um portal cativo.\n\nOutra solução é o captive-browser-gitAUR, baseado no Google Chrome.\n\n"
    },
    {
      "title": "Cliente DHCP",
      "level": 3,
      "content": "Por padrão, o NetworkManager usa seu cliente DHCP interno. O plugin DHCPv4 interno baseado na biblioteca n-dhcp4 do nettools, enquanto o plugin DHCPv6 interno é feito de código baseado systemd-networkd.\n\nPara usar o cliente DHCP da ISC, instale dhclient. Para alterar o backend do cliente DHCP, defina a opção main.dhcp=nome_cliente_dhcp com um arquivo de configuração em /etc/NetworkManager/conf.d/. Por exemplo:\n\n```\n/etc/NetworkManager/conf.d/dhcp-client.conf\n```\n\n```\n[main]\ndhcp=dhclient\n```\n\n- Não ative as units systemd enviadas com os pacotes dhclient e dhcpcd. Eles entrarão em conflito com o NetworkManager; consulte a nota em #Instalação para mais detalhes.\n- O NetworkManger não suporta dhcpcd ≥ 9.0.0. Veja FS#66231.\n\n"
    },
    {
      "title": "Gerenciamento de DNS",
      "level": 3,
      "content": "O gerenciamento de DNS do NetworkManager é descrito na página wiki do projeto GNOME — Projects/NetworkManager/DNS.\n\n"
    },
    {
      "title": "Cache de DNS e encaminhamento condicional",
      "level": 4,
      "content": "O NetworkManager possui um plugin para habilitar o cache DNS e encaminhamento condicional (anteriormente chamado \"DNS dividido\" na documentação do NetworkManager) usando dnsmasq ou systemd-resolved. As vantagens dessa configuração são que as pesquisas de DNS serão armazenadas em cache, encurtando os tempos de resolução e as pesquisas de DNS dos hosts de VPN serão roteadas para os servidores DNS da VPN relevantes. Isso é especialmente útil se você estiver conectado a mais de uma VPN.\n\nCertifique-se que dnsmasq está instalado. Então, defina main.dns=dnsmasq com um arquivo de configuração em /etc/NetworkManager/conf.d/:\n\n```\n/etc/NetworkManager/conf.d/dns.conf\n```\n\n```\n[main]\ndns=dnsmasq\n```\n\nAgora, execute nmcli general reload como root. NetworkManager vai iniciar automaticamente o dnsmasq e adicionar 127.0.0.1 ao /etc/resolv.conf. Os servidores DNS originais podem ser localizados no /run/NetworkManager/no-stub-resolv.conf. Você pode verificar se dnsmasq está sendo usado fazendo a mesma procura DNS duas vezes com drill example.com e verificando o servidor e tempos de consulta.\n\n- Você não precisa iniciar dnsmasq.service ou editar /etc/dnsmasq.conf. O NetworkManager iniciará o dnsmasq sem usar o serviço systemd e sem ler o(s) arquivo(s) de configuração padrão do dnsmasq.\n- A instância do dnsmasq iniciada pelo NetworkManager será vinculada a 127.0.0.1:53, você pode executar qualquer software (incluindo dnsmasq.service) no mesmo endereço e porta.\n\nConfigurações personalizadas podem ser criadas para o dnsmasq criando arquivos de configuração em /etc/NetworkManager/dnsmasq.d/. Por exemplo, para alterar o tamanho do cache DNS (armazenado na RAM):\n\n```\n/etc/NetworkManager/dnsmasq.d/cache.conf\n```\n\n```\ncache-size=1000\n```\n\nVeja dnsmasq(8) para todas as opções disponíveis.\n\nHabilitar o dnsmasq no NetworkManager pode interromper as pesquisas de DNS somente do IPv6 (ou seja, drill -6 [hostname}) que, de outra forma, funcionariam. Para resolver isso, a criação do arquivo a seguir configurará o dnsmasq para também ouvir o loopback do IPv6:\n\n```\n/etc/NetworkManager/dnsmasq.d/ipv6-listen.conf\n```\n\n```\nlisten-address=::1\n```\n\nAlém disso, o dnsmasq também não prioriza o DNS IPv6 upstream. Infelizmente, o NetworkManager não faz isso (Bug do Ubuntu). Uma solução alternativa seria desabilitar o DNS IPv4 na configuração do NetworkManager, supondo que exista.\n\nA instância dnsmasq iniciada pelo NetworkManager por padrão não validará DNSSEC desde que seja iniciada com a opção --proxy-dnssec. Ele irá confiar em qualquer informação DNSSEC obtida do servidor DNS upstream.\n\nPara que o dnsmasq valide corretamente o DNSSEC, quebrando assim a resolução de DNS com servidores de nomes que não suportam ele, crie o seguinte arquivo de configuração:\n\n```\n/etc/NetworkManager/dnsmasq.d/dnssec.conf\n```\n\n```\nconf-file=/usr/share/dnsmasq/trust-anchors.conf\ndnssec\n```\n\nO NetworkManager pode usar o systemd-resolved como um resolvedor e cache de DNS. Certifique-se de que systemd-resolved esteja configurado corretamente e que systemd-resolved.service esteja iniciado antes de usá-lo.\n\nsystemd-resolved vai ser usado automaticamente se /etc/resolv.conf é um link simbólico para /run/systemd/resolve/stub-resolv.conf, /run/systemd/resolve/resolv.conf ou /usr/lib/systemd/resolv.conf.\n\nVocê pode habilitá-lo explicitamente definindo main.dns=systemd-resolved com um arquivo de configuração em /etc/NetworkManager/conf.d/:\n\n```\n/etc/NetworkManager/conf.d/dns.conf\n```\n\n```\n[main]\ndns=systemd-resolved\n```\n\nSe o openresolv tem um assinante para seu resolvedor de DNS local, configure o assinante e configure o NetworkManager para usar o openresolv.\n\nPorque o NetworkManager anuncia uma única \"interface\" para o resolvconf, não é possível implementar encaminhamento condicional entre duas conexões do NetworkManager. Veja issue 153 do NetworkManager.\n\nIsso pode ser parcialmente mitigado se você definir private=\"*\" no /etc/resolvconf.conf[3]. Quaisquer consultas por domínios que não estejam na lista de domínios de pesquisa não serão encaminhados. Elas serão tratadas conforme a configuração do resolvedor local. Por exemplo, encaminhadas para outro servidor DNS ou resolvidas recursivamente a partir da raiz do DNS.\n\n"
    },
    {
      "title": "Servidores DNS personalizados",
      "level": 4,
      "content": "Para definir servidores DNS para todas as conexões, especifique-as em NetworkManager.conf(5) usando a sintaxe servers=endereçoservidorip1,endereçoservidorip2,endereçoservidorip3 em uma seção chamada [global-dns-domain-*]. Por exemplo:\n\n```\n/etc/NetworkManager/conf.d/dns-servers.conf\n```\n\n```\n[global-dns-domain-*]\nservers=::1,127.0.0.1\n```\n\n- Se você usa plugin de dnsmasq ou systemd-resolved do NetworkManager ou assinantes de openresolv, então não especifique endereços de loopback com a opção servers=, pois isso pode quebrar a resolução de DNS.\n- Os servidores especificados não são enviados para systemd-resolved, os servidores DNS da conexão são usados.\n\nA configuração vai depender do tipo de front-end usado; o processo geralmente envolve clicar com botão direito no miniaplicativo, editar (ou criar) um perfil e, então, escolher o tipo de DHCP como Automático (especifique endereços). OS endereços DNS precisarão ser inseridos e são geralmente dessa formato: 127.0.0.1, Servidor-DNS-um, ....\n\nPara configurar servidores DNS por conexão, você pode usar o campo dns (e os dns-search e dns-options associados) nas configurações da conexão.\n\nSe method estiver definido para auto (quando você usa DHCP), você precisa definir ignore-auto-dns para yes.\n\n"
    },
    {
      "title": "/etc/resolv.conf",
      "level": 4,
      "content": "Por padrão, /etc/resolv.conf é gerenciado pelo NetworkManager a menos que ele seja um link simbólico.\n\nEle pode ser configurado para escrever por meio do openresolv ou para não tocar.\n\nO uso do openresolv permite que o NetworkManager coexista com outro software com suporte a resolvconf ou, por exemplo, para executar um cache DNS local e um resolvedor de DNS dividido para o qual o openresolv tem um assinante.\n\nO NetworkManager também oferece hooks via os scripts dispatchers que podem ser usados para alterar o /etc/resolv.conf após as alterações de rede. Veja #Serviços de rede com o NetworkManager dispatcher e NetworkManager(8) para mais informações.\n\n- Se o NetworkManager estiver configurado para usar dnsmasq ou systemd-resolved, os endereços loopback apropriados serão escritos em /etc/resolv.conf.\n- O arquivo resolv.conf que o NetworkManager escreve, ou que escreveria em /etc/resolv.conf, pode ser encontrado em /run/NetworkManager/resolv.conf.\n- Um arquivo resolv.conf com os servidores de nome obtidos e domínios de pesquisa podem ser encontrados em /run/NetworkManager/no-stub-resolv.conf.\n\nPara evitar que o NetworkManager toque no /etc/resolv.conf, defina main.dns=none com um arquivo de configuração em /etc/NetworkManager/conf.d/:\n\n```\n/etc/NetworkManager/conf.d/dns.conf\n```\n\n```\n[main]\ndns=none\n```\n\nApós isso, o /etc/resolv.conf pode ser um link simbólico quebrado que você precisará remover. Então, basta criar um novo arquivo /etc/resolv.conf.\n\nPara configurar o NetworkManager para usar openresolv, defina main.rc-manager=resolvconf com um arquivo de configuração em /etc/NetworkManager/conf.d/:\n\n```\n/etc/NetworkManager/conf.d/rc-manager.conf\n```\n\n```\n[main]\nrc-manager=resolvconf\n```\n\n"
    },
    {
      "title": "Firewall",
      "level": 3,
      "content": "Você pode atribuir uma zona firewalld com base na sua conexão atual. Por exemplo, um firewall restritivo no trabalho e um menos restritivo no domicílio.\n\nIsso também pode ser feito com o NetworkManager dispatcher.\n\n"
    },
    {
      "title": "Configuração de 802.1x / PEAP",
      "level": 3,
      "content": "Uma rede PEAP e 802.1x pode ser adicionada adicionando um arquivo de configuração ao /etc/NetworkManager/system-connections/nome.\n\nAqui está um exemplo de arquivo de configuração para IPv4 com IPv6 desativado:\n\n```\n/etc/NetworkManager/system-connections/nome\n```\n\n```\n[ipv6]\nmethod=ignore\n\n[ipv4]\nmethod=auto\n\n[connection]\n#id=XXXXXXXXX\n#uuid=XXXXXXXXX\ntype=802-11-wireless\n#timestamp=XXXX\n\n[802-11-wireless-security]\nkey-mgmt=wpa-eap\n\n[802-11-wireless]\nssid=ssid\nmode=infrastructure\n#seen-bssids=XXXXXXXXX\nsecurity=802-11-wireless-security\n\n[802-1x]\neap=peap;\nidentity=user\npassword=password\nphase2-auth=mschapv2\n```\n\nA cerquilha (#) define comentários.\n\n"
    },
    {
      "title": "Serviços de rede com o NetworkManager dispatcher",
      "level": 2,
      "content": "Existem alguns serviços de rede que você não desejará executar até que o NetworkManager exiba uma interface. O NetworkManager tem a capacidade de iniciar serviços quando você se conecta a uma rede e os interrompe quando você desconecta (por exemplo, ao usar NFS, SMB e NTPd).\n\nPara ativar o recurso, você precisa habilitar e iniciar o NetworkManager-dispatcher.service.\n\nQuando o serviço estiver ativo, os scripts poderão ser adicionados ao diretório /etc/NetworkManager/dispatcher.d.\n\nOs scripts devem pertencer ao root, caso contrário o distribuidor não os executará. Para maior segurança, defina o proprietário e grupo para root:\n\n```\n# chown root:root /etc/NetworkManager/dispatcher.d/10-script.sh\n```\n\nCertifique-se que o arquivo tem as permissões corretas:\n\n```\n# chmod 755 /etc/NetworkManager/dispatcher.d/10-script.sh\n```\n\nOs scripts serão executados em ordem alfabética no momento da conexão e em ordem alfabética inversa no momento da desconexão. Para garantir a ordem em que aparecem, é comum usar caracteres numéricos antes do nome do script (por exemplo, 10-portmap ou 30-netfs (o que garante que portmapper esteja ativo antes que as montagens do NFS sejam tentadas).\n\nScripts vão receber os seguintes argumentos:\n\n- Nome da interface: p. ex., eth0\n- Status da interface: up ou down\n- Status da VPN: vpn-up ou vpn-down\n\n"
    },
    {
      "title": "Evitando o esgotamento de tempo limite do dispatcher",
      "level": 3,
      "content": "Se o acima está funcionando, então esta seção não é relevante. No entanto, há um problema geral relacionado à execução de scripts do dispatcher que demoram mais para serem executados. Inicialmente, foi utilizado um tempo limite interno de apenas três segundos. Se o script chamado não foi concluído a tempo, ele foi morto. Mais tarde, o tempo limite foi estendido para cerca de 20 segundos (veja o Rastreador de erros para mais informações). Se o tempo limite ainda criar o problema, uma solução alternativa poderá ser modificar o arquivo de serviço do distribuidor /usr/lib/systemd/system/NetworkManager-dispatcher.service para permanecer ativo após a saída:\n\n```\n/etc/systemd/system/NetworkManager-dispatcher.service.d/remain_after_exit.conf\n```\n\n```\n[Service]\nRemainAfterExit=yes\n```\n\nAgora, inicie e habilite o serviço modificado NetworkManager-dispatcher service.\n\nNote: **tem** \n\n"
    },
    {
      "title": "Montar pasta remota com sshfs",
      "level": 4,
      "content": "Como o script é executado em um ambiente muito restritivo, você precisa exportar SSH_AUTH_SOCK para se conectar ao seu agente SSH. Existem diferentes maneiras de conseguir isso, veja esta mensagem para obter mais informações. O exemplo abaixo funciona com GNOME Keyring, e irá pedir a senha se você ainda não estiver desbloqueado. Caso o NetworkManager conecte-se automaticamente no login, é provável que o gnome-keyring ainda não tenha iniciado e a exportação irá falhar (daí o sleep). O UUID para correspondência pode ser encontrado com o comando nmcli connection status ou nmcli connection list.\n\n```\n#!/bin/sh\nUSER='nome_de_usuário'\nREMOTE='usuário@host:/caminho/remoto'\nLOCAL='/caminho/local'\n\ninterface=$1 status=$2\nif [ \"$CONNECTION_UUID\" = \"uuid\" ]; then\n  case $status in\n    up)\n      SSH_AUTH_SOCK=$(find /tmp -maxdepth 1 -type s -user \"$USER\" -name 'ssh')\n      export SSH_AUTH_SOCK\n      su \"$USER\" -c \"sshfs $REMOTE $LOCAL\"\n      ;;\n    down)\n      fusermount -u \"$LOCAL\"\n      ;;\n  esac\nfi\n```\n\n"
    },
    {
      "title": "Montagem de compartilhamentos SMB",
      "level": 4,
      "content": "Alguns compartilhamentos SMB estão disponíveis apenas em determinadas redes ou locais (por exemplo, em casa). Você pode usar o distribuidor para montar apenas compartilhamentos SMB que estejam presentes em seu local atual.\n\nO script a seguir verificará se nos conectamos a uma rede específica e montamos os compartilhamentos de acordo:\n\n```\n/etc/NetworkManager/dispatcher.d/30-mount-smb.sh\n```\n\n```\n#!/bin/sh\n\n# Localiza o UUID de conexão com \"nmcli connection show\" no terminal.\n# Todos os tipos de conexão do NetworkManager têm suporte: sem fio, VPN, com fio...\nif [ \"$2\" = \"up\" ]; then\n  if [ \"$CONNECTION_UUID\" = \"uuid\" ]; then\n    mount /seu/ponto/de/montagem &\n    # adicione mais compartilhamentos conforme necessário\n  fi\nfi\n```\n\nO script a seguir desmontará todos os compartilhamentos SMB antes de um software ter iniciado a desconexão de uma rede específica:\n\n```\n/etc/NetworkManager/dispatcher.d/pre-down.d/30-umount-smb.sh\n```\n\n```\n#!/bin/sh\n\nif [ \"$CONNECTION_UUID\" = \"uuid\" ]; then\n  umount -a -l -t cifs\nfi\n```\n\nO script a seguir tentará desmontar todos os compartilhamentos SMB após uma desconexão inesperada de uma rede específica:\n\n```\n/etc/NetworkManager/dispatcher.d/40-umount-smb.sh\n```\n\n```\n#!/bin/sh\n\nif [ \"$CONNECTION_UUID\" = \"uuid\" ]; then\n  if [ \"$2\" = \"down\" ]; then\n    umount -a -l -t cifs\n  fi\nfi\n```\n\n- Desde o NetworkManager 0.9.8, os eventos pre-down e down não são executados no desligamento ou reinicialização, veja este relatório de erro para mais informações.\n- Os scripts de umount anteriores ainda são propensos a deixar os aplicativos que realmente acessam a montagem para \"travar\".\n\nUma alternativa é usar o script como visto em NFS#Using a NetworkManager dispatcher:\n\n```\n/etc/NetworkManager/dispatcher.d/30-smb.sh\n```\n\n```\n#!/bin/bash\n\n# Descubra O UUID da conexão com \"nmcli con show\" no terminal.\n# Todos os tipos de conexão do NetworkManager têm suporte: wireless, VPN, wired...\nWANTED_CON_UUID=\"CHANGE-ME-NOW-9c7eff15-010a-4b1c-a786-9b4efa218ba9\"\n\nif [[ \"$CONNECTION_UUID\" == \"$WANTED_CON_UUID\" ]]; then\n    \n    # Parâmetro do script $1: Nome da conexão do NetworkManager, não usado\n    # Parâmetro do script $2: eventos despachado\n    \n    case \"$2\" in\n        \"up\")\n            mount -a -t cifs\n            ;;\n        \"pre-down\");&\n        \"vpn-pre-down\")\n            umount -l -a -t cifs >/dev/null\n            ;;\n    esac\nfi\n```\n\nCrie um link simbólico dentro de /etc/NetworkManager/dispatcher.d/pre-down para pegar os eventos pre-down:\n\n```\n# ln -s ../30-smb.sh /etc/NetworkManager/dispatcher.d/pre-down.d/30-smb.sh\n```\n\n"
    },
    {
      "title": "Montagem de compartilhamentos NFS",
      "level": 4,
      "content": "Veja NFS#Using a NetworkManager dispatcher.\n\n"
    },
    {
      "title": "Usar dispatcher para ativar rede sem fio automaticamente dependendo de cabo LAN estar conectado",
      "level": 4,
      "content": "A ideia é ligar o Wi-Fi apenas quando o cabo LAN estiver desconectado (por exemplo, ao desconectá-lo de um laptop) e para que o Wi-Fi seja desativado automaticamente, assim que o cabo LAN for conectado novamente.\n\nCrie o seguinte script de dispatcher[4], substituindo LAN_interface pelo seu.\n\n```\n/etc/NetworkManager/dispatcher.d/wlan_auto_toggle.sh\n```\n\n```\n#!/bin/sh\n\nif [ \"$1\" = \"LAN_interface\" ]; then\n    case \"$2\" in\n        up)\n            nmcli radio wifi off\n            ;;\n        down)\n            nmcli radio wifi on\n            ;;\n    esac\nfi\n```\n\n"
    },
    {
      "title": "Usar dispatcher para conectar a uma VPN após uma conexão de rede ser estabelecida",
      "level": 4,
      "content": "Neste exemplo, queremos nos conectar automaticamente a uma conexão VPN definida anteriormente após a conexão a uma rede Wi-Fi específica. A primeira coisa a fazer é criar o script de dispatcher que define o que fazer depois de estarmos conectados à rede.\n\n```\n/etc/NetworkManager/dispatcher.d/vpn-up\n```\n\n```\n#!/bin/sh\nVPN_NAME=\"nome da conexão VPN definido no NetworkManager\"\nESSID=\"ESSID da rede Wi-Fi (não o nome da conexão)\"\n\ninterface=$1 status=$2\ncase $status in\n  up|vpn-down)\n    if iwgetid | grep -qs \":\\\"$ESSID\\\"\"; then\n      nmcli connection up id \"$VPN_NAME\"\n    fi\n    ;;\n  down)\n    if iwgetid | grep -qs \":\\\"$ESSID\\\"\"; then\n      if nmcli connection show --active | grep \"$VPN_NAME\"; then\n        nmcli connection down id \"$VPN_NAME\"\n      fi\n    fi\n    ;;\nesac\n```\n\nSe você quiser se conectar automaticamente à VPN para todas as redes Wi-Fi, use a seguinte definição do ESSID: ESSID=$(iwgetid -r). Lembre-se de definir as permissões do script de acordo com isso.\n\nA tentativa de se conectar com o script acima ainda pode falhar com NetworkManager-dispatcher.service reclamando sobre \"nenhum segredo de VPN válido\", por causa de como os segredos VPN são armazenados. Felizmente, existem diferentes opções para fornecer ao script acima acesso à sua senha de VPN.\n\n1: Um deles requer a edição do arquivo de configuração de conexão VPN para fazer com que o NetworkManager armazene os segredos por si só, em vez de dentro de um chaveiro que será inacessível por root: abra /etc/NetworkManager/system-connections/nome de sua conexão VPN e altere as password-flags e secret-flags de 1 para 0.\n\nSe isso não funcionar sozinho, talvez seja necessário criar um passwd-file em um local seguro com as mesmas permissões e propriedade que o script do dispatcher, contendo o seguinte:\n\n```\n/caminho/para/arquivo-passwd\n```\n\n```\nvpn.secrets.password:SUA_SENHA\n```\n\nO script deve ser alterado de acordo, para que obtenha a senha do arquivo:\n\n```\n/etc/NetworkManager/dispatcher.d/vpn-up\n```\n\n```\n#!/bin/sh\nVPN_NAME=\"nome de conexão VPN definida no NetworkManager\"\nESSID=\"ESSID de rede Wi-Fi (nenhum nome de conexão)\"\n\ninterface=$1 status=$2\ncase $status in\n  up|vpn-down)\n    if iwgetid | grep -qs \":\\\"$ESSID\\\"\"; then\n      nmcli connection up id \"$VPN_NAME\" passwd-file /path/to/passwd-file\n    fi\n    ;;\n  down)\n    if iwgetid | grep -qs \":\\\"$ESSID\\\"\"; then\n      if nmcli connection show --active | grep \"$VPN_NAME\"; then\n        nmcli connection down id \"$VPN_NAME\"\n      fi\n    fi\n    ;;\nesac\n```\n\n2: Alternativamente, altere a password-flags e coloque a senha diretamente no arquivo de configuração adicionando a seção vpn-secrets:\n\n```\n[vpn]\n ....\n password-flags=0\n \n [vpn-secrets]\n password=senha_senha\n```\n\n"
    },
    {
      "title": "Usar dispatcher para desabilitar IPv6 em conexões de provedor de VPN",
      "level": 4,
      "content": "Muitos provedores de VPN comercial possuem suporte apenas a IPv4. Isso significa que todo o tráfego IPv6 ignora a VPN e acaba por se tornar virtualmente desnecessário. Para evitar isso, o dispatcher pode ser usado para desabilitar todo o tráfego IPv5 para o período em que a conexão VPN está ativa.\n\n```\n/etc/NetworkManager/dispatcher.d/10-vpn-ipv6\n```\n\n```\n#!/bin/sh\n\ncase \"$2\" in\n    vpn-up)\n        echo 1 > /proc/sys/net/ipv6/conf/all/disable_ipv6\n        ;;\n    vpn-down)\n        echo 0 > /proc/sys/net/ipv6/conf/all/disable_ipv6\n        ;;\nesac\n```\n\n"
    },
    {
      "title": "OpenNTPD",
      "level": 4,
      "content": "Veja OpenNTPD#Using NetworkManager dispatcher.\n\n"
    },
    {
      "title": "Testando",
      "level": 2,
      "content": "Os miniaplicativos do NetworkManager são projetados para serem carregados no início da sessão, portanto, nenhuma configuração adicional deve ser necessária para a maioria dos usuários. Se você já desativou suas configurações de rede anteriores e desconectou-se da sua rede, agora pode testar se o NetworkManager funcionará. O primeiro passo é iniciar NetworkManager.service.\n\nAlguns miniaplicativos fornecerão um arquivo .desktop para que o miniaplicativo NetworkManager possa ser carregado através do menu do aplicativo. Se isso não acontecer, você terá que descobrir o comando para usar ou efetuar logout e efetuar login novamente para iniciar o miniaplicativo. Depois que o applet é iniciado, ele provavelmente começará a pesquisar conexões de rede com a autoconfiguração com um servidor DHCP.\n\nPara iniciar o miniaplicativo do GNOME nos gerenciadores de janela não compatíveis com xdg, como awesome:\n\n```\nnm-applet --sm-disable &\n```\n\nPara endereços IP estáticos, você terá que configurar o NetworkManager para entendê-los. O processo geralmente envolve clicar com o botão direito do mouse no applet e selecionar algo como 'Editar conexões'.\n\n"
    },
    {
      "title": "Senhas de Wi-Fi criptografadas",
      "level": 3,
      "content": "Por padrão, o NetworkManager armazena senhas em texto não criptografado nos arquivos de conexão em /etc/NetworkManager/system-connections/. Para imprimir as senhas armazenadas, use o seguinte comando:\n\n```\n# grep -r '^psk=' /etc/NetworkManager/system-connections/\n```\n\nAs senhas são acessíveis ao usuário root no sistema de arquivos e aos usuários com acesso às configurações através da GUI (por exemplo, nm-applet).\n\nÉ preferível salvar as senhas em formato criptografado em um chaveiro, em vez de texto não criptografado. A desvantagem de usar um chaveiro é que as conexões precisam ser configuradas para cada usuário.\n\n"
    },
    {
      "title": "Usando GNOME Keyring",
      "level": 4,
      "content": "O daemon do conjunto de chaves deve ser iniciado e o chaveiro precisa ser desbloqueado para que o seguinte funcione.\n\nAlém disso, o NetworkManager precisa ser configurado para não armazenar a senha para todos os usuários. Usando o GNOME nm-applet, execute nm-connection-editor em um terminal, selecione uma conexão de rede, clique em Editar, selecione Segurança Wi-Fi e clique no ícone à direita da senha e marque Armazenar a senha somente para este usuário.\n\n"
    },
    {
      "title": "Usando KDE Wallet",
      "level": 4,
      "content": "Usando o plasma-nm do KDE, clique no applet, clique no ícone Configurações na parte superior direita, clique em uma conexão de rede, na guia Configurações gerais, desmarque Todos os usuários podem se conectar nesta rede. Se a opção estiver marcada, as senhas ainda serão armazenadas em texto não criptografado, mesmo que um daemon de chaveiro esteja em execução.\n\nSe a opção foi selecionada anteriormente e você desmarcá-la, você pode ter que usar a opção reset primeiro para fazer a senha desaparecer do arquivo. Como alternativa, exclua a conexão primeiro e configure-a novamente.\n\n"
    },
    {
      "title": "Compartilhando conexão internet pelo Wi-Fi",
      "level": 3,
      "content": "Você pode compartilhar sua conexão com a Internet (por exemplo, 3G ou com fio) com apenas alguns cliques. Por favor, note que um firewall pode interferir no compartilhamento de internet.\n\nVocê precisará de uma placa Wi-Fi que tenha suporte ao modo AP. Veja Software access point#Wi-Fi device must support AP mode para detalhes.\n\nInstale o pacote dnsmasq para poder realmente compartilhar a conexão.\n\nCrie a conexão compartilhada:\n\n- Clique no miniaplicativo e escolha Criar nova rede sem fio.\n- Siga o assistente (escolha WPA2 ou superior, certifique-se de usar pelo menos 8 caracteres, pois tamanhos menores falharão). Escolha Hotspot ou Ad-hoc como modo Wi-Fi.\n\n- Escolha Hotspot ou Ad-hoc como modo Wi-Fi.\n\nA conexão será salva e permanecerá armazenada para a próxima vez que você precisar dela.\n\n"
    },
    {
      "title": "Compartilhando conexão internet por Ethernet",
      "level": 3,
      "content": "Cenário: o seu dispositivo está conectado à Internet através de wi-fi e pretende compartilhar a conexão à Internet a outros dispositivos através da rede ethernet.\n\nRequisitos:\n\n- Instale o pacote dnsmasq para ser capaz de compartilhar a conexão.\n- Seu dispositivo conectado à internet e outros dispositivos estarem conectados por um cabo ethernet adequado (isso geralmente significa um cabo cross ou um switch entre eles).\n- Compartilhamento de Internet não estar bloqueado por um firewall.\n\nEtapas:\n\n- Executar nm-connection-editor do terminal.\n- Adicionar uma nova conexão ethernet.\n- Dê um nome sensato. Por exemplo, \"Internet compartilhada\"\n- Acesse \"Configurações IPv4\".\n- Para \"Método:\" selecione \"Compartilhado com outros computadores\".\n- Salve\n\nAgora, você deve ter uma nova opção \"Internet compartilhada\" sob as conexões cabeadas no NetworkManager.\n\n"
    },
    {
      "title": "Verificando se a conectividade está ativa dentro de um script ou trabalho cron",
      "level": 3,
      "content": "Alguns trabalhos de cron exigem conectividade para serem bem-sucedidos. Você pode evitar a execução desses trabalhos quando a rede estiver inoperante. Para isso, adicione um teste if para redes que consulte a nm-tool do NetworkManager e verifique o estado da rede. O teste mostrado aqui é bem-sucedido se qualquer interface estiver ativa e falhará se todos estiverem inativos. Isso é conveniente para laptops que podem ser conectados, podem estar sem fio ou podem estar fora da rede.\n\n```\nif [ $(nm-tool|grep State|cut -f2 -d' ') == \"connected\" ]; then\n    #Qualquer coisa que você deseje fazer se a rede estiver online\nelse\n    #Qualquer coisa que você deseje fazer se a rede estiver offline - note, isso e qualquer outra coisa acima é opcional\nfi\n```\n\nIsso é útil para um script cron.hourly que executa o fpupdate para a atualização da assinatura do scanner de vírus F-Prot, como exemplo. Outra maneira que pode ser útil, com uma pequena modificação, é diferenciar entre redes usando várias partes da saída do nm-tool; por exemplo, como a rede sem fio ativa é denotada com um asterisco, você pode usar o nome da rede e, em seguida, o grep para um asterisco literal.\n\n"
    },
    {
      "title": "Conectar a uma rede com segredo na inicialização",
      "level": 3,
      "content": "Por padrão, o NetworkManager não se conectará a redes que exigem um segredo automaticamente na inicialização. Isso ocorre porque ele bloqueia essas conexões para o usuário que faz isso por padrão, conectando-se somente depois de terem efetuado login. Para alterar isso, faça o seguinte:\n\n1. Clique com o botão direito do mouse no ícone do nm-applet em seu painel e selecione Editar conexões e abra a guia Sem fio\n1. Selecione a conexão com a qual você deseja trabalhar e clique no botão Editar\n1. Marque as caixas \"Conectar automaticamente\" e \"Disponível para todos os usuários\"\n1. Adicionalmente, certifique-se que em \"Segurança Wi-Fi\", \"Armazenar senha para todos os usuários (não criptografado)\" esteja selecionado\n\nEncerre e inicie novamente a sessão para completar.\n\n"
    },
    {
      "title": "OpenConnect com senha no KWallet",
      "level": 3,
      "content": "Enquanto você pode digitar os dois valores no momento da conexão, o plasma-nm 0.9.3.2-1 e acima são capazes de obter o nome de usuário e a senha do OpenConnect diretamente do KWallet.\n\nAbra o \"Gerenciador de carteiras do KDE\" e procure a sua conexão OpenConnect VPN em \"Gerenciamento de rede | Mapas\". Clique em \"Mostrar valores\" e insira suas credenciais na chave \"VpnSecrets\" neste formulário (substitua \"nome_de_usuário\" e \"senha\"):\n\n```\nform:main:username%SEP%nome_de_usuário%SEP%form:main:password%SEP%senha\n```\n\nDa próxima vez que você se conectar, o nome de usuário e a senha deverão aparecer na caixa de diálogo \"Segredos de VPN\".\n\n"
    },
    {
      "title": "Ignorar dispositivos específicos",
      "level": 3,
      "content": "Às vezes, pode ser desejado que o NetworkManager ignore dispositivos específicos e não tente configurar endereços e rotas para eles. Você pode rapidamente e facilmente ignorar dispositivos por MAC ou por nome de interface usando o seguinte em /etc/NetworkManager/conf.d/unmanaged.conf:\n\n```\n[keyfile]\nunmanaged-devices=mac:00:22:68:1c:59:b1;mac:00:1E:65:30:D1:C4;interface-name:eth0\n```\n\nApós editar o arquivo, execute nmcli general reload como root. Em seguida, você deve ser capaz de configurar interfaces sem o NetworkManager alterar o que você definiu.\n\n"
    },
    {
      "title": "Configurando aleatorização de endereço MAC",
      "level": 3,
      "content": "A aleatorização de MAC pode ser usada para aumentar a privacidade, não revelando seu endereço MAC real à rede.\n\nO NetworkManager oferece suporte a dois tipos de aleatorização de endereços MAC: aleatorização durante a digitalização e para conexões de rede. Ambos os modos podem ser configurados modificando o /etc/NetworkManager/NetworkManager.conf ou criando um arquivo de configuração separado no /etc/NetworkManager/conf.d/, que é recomendado já que o primeiro arquivo de configuração acima pode ser substituído pelo NetworkManager.\n\nA aleatorização durante a varredura de Wi-Fi é ativada por padrão, mas pode ser desativada adicionando as seguintes linhas ao /etc/NetworkManager/NetworkManager.conf ou a um arquivo de configuração dedicado em /etc/NetworkManager/conf.d:\n\n```\n/etc/NetworkManager/conf.d/wifi_rand_mac.conf\n```\n\n```\n[device]\nwifi.scan-rand-mac-address=no\n```\n\nA aleatorização de MAC para conexões de rede pode ser definida para modos diferentes para interfaces sem fio e Ethernet. Veja a publicação de blog do GNOME para mais detalhes sobre os diferentes modos.\n\nEm termos de aleatorização de MAC, os modos mais importantes são stable e random. stable gera um endereço MAC aleatório quando você se conecta a uma nova rede e associa os dois permanentemente. Isso significa que você usará o mesmo endereço MAC sempre que se conectar a essa rede. Em contraste, random irá gerar um novo endereço MAC toda vez que você se conectar a uma rede, nova ou previamente conhecida. Você pode configurar a aleatorização do MAC adicionando a configuração desejada em /etc/NetworkManager/conf.d:\n\n```\n/etc/NetworkManager/conf.d/wifi_rand_mac.conf\n```\n\n```\n[device-mac-randomization]\n# \"yes\" já é o padrão para fazer varredura\nwifi.scan-rand-mac-address=yes\n \n[connection-mac-randomization]\n# Aleatoriza o MAC para cada conexão ethernet\nethernet.cloned-mac-address=random\n# Gera um MAC aleatório para cada WiFi e associa a dois permanentemente.\nwifi.cloned-mac-address=stable\n```\n\nVeja a seguinte publicação de blog do GNOME para mais detalhes.\n\n"
    },
    {
      "title": "Habilitar extensões de privacidade IPv6",
      "level": 3,
      "content": "Veja IPv6 (Português)#NetworkManager.\n\n"
    },
    {
      "title": "Trabalhando com conexões cabeadas",
      "level": 3,
      "content": "Por padrão, o NetworkManager gera um perfil de conexão para cada conexão Ethernet com fio que encontrar. No momento em que gera a conexão, ele não sabe se haverá mais adaptadores Ethernet disponíveis. Por isso, ele chama a primeira conexão com fio \"Conexão cabeada 1\". Você pode evitar gerar essa conexão, configurando no-auto-default (consulte NetworkManager.conf(5)) ou simplesmente excluindo-a. Em seguida, o NetworkManager se lembrará de não gerar uma conexão para essa interface novamente.\n\nVocê também pode editar a conexão (e persistir no disco) ou excluí-la. O NetworkManager não irá gerar novamente uma nova conexão. Então, você pode mudar o nome para o que você quiser. Você pode usar algo como o nm-connection-editor para esta tarefa.\n\n"
    },
    {
      "title": "Usando iwd como o backend de Wi-Fi",
      "level": 3,
      "content": "Instale networkmanager-iwdAUR ou habilite o backend experimental iwd criando o seguinte arquivo de configuração:\n\n```\n/etc/NetworkManager/conf.d/wifi_backend.conf\n```\n\n```\n[device]\nwifi.backend=iwd\n```\n\n"
    },
    {
      "title": "Executando em um espaço de nomes de rede",
      "level": 3,
      "content": "Se você deseja executar o NetworkManager dentro de um espaço de nomes de rede (por exemplo, para gerenciar um dispositivo específico que deve ser usado por aplicativos selecionados), abaixe o dispositivo antes de movê-lo para o espaço de nomes:\n\n```\n$ ip link set dev MEU_DISPOSITIVO down\n$ ip link set dev MEU_DISPOSITIVO netns MEU_ESPAÇO_DE_NOMES\n$ ip netns exec MEU_ESPAÇO_DE_NOMES NetworkManager\n...\n$ ip netns exec MEU_ESPAÇO_DE_NOMES killall NetworkManager\n```\n\ncaso contrário, o NetworkManager falhará posteriormente ao estabelecer a conexão com um erro device is strictly unmanaged.\n\n"
    },
    {
      "title": "Nenhum prompt para senha de redes Wi-Fi seguras",
      "level": 3,
      "content": "Ao tentar se conectar a uma rede Wi-Fi protegida, nenhum prompt de senha é exibido e nenhuma conexão é estabelecida. Isso acontece quando nenhum pacote de chaveiro é instalado. Uma solução fácil é instalar o gnome-keyring. Se você quiser que as senhas sejam armazenadas em formato criptografado, siga GNOME Keyring para configurar o gnome-keyring-daemon.\n\n"
    },
    {
      "title": "Gerenciamento de rede desabilitado",
      "level": 3,
      "content": "Quando o NetworkManager for desligado, mas o arquivo pid (estado) não for removido, você verá uma mensagem Network management disabled. Se isso acontecer, remova o arquivo manualmente:\n\n```\n# rm /var/lib/NetworkManager/NetworkManager.state\n```\n\n"
    },
    {
      "title": "Problemas com cliente DHCP interno",
      "level": 3,
      "content": "Se você tiver problemas para obter um endereço IP usando o cliente DHCP interno, considere usar outro cliente DHCP, consulte #Cliente DHCP para obter instruções. Essa solução alternativa pode resolver problemas em grandes redes sem fio, como o eduroam.\n\n"
    },
    {
      "title": "Problemas DHCP com dhclient",
      "level": 3,
      "content": "Se você tiver problemas ao obter um endereço IP via DHCP, tente adicionar o seguinte ao seu /etc/dhclient.conf:\n\n```\ninterface \"eth0\" {\n   send dhcp-client-identifier 01:aa:bb:cc:dd:ee:ff;\n }\n```\n\nsendo aa:bb:cc:dd:ee:ff o endereço MAC desta NIC. O endereço MAC pode ser localizado usando o comando ip link show interface com o pacote iproute2.\n\n"
    },
    {
      "title": "Modem 3G não detectado",
      "level": 3,
      "content": "Veja USB 3G Modem#NetworkManager.\n\n"
    },
    {
      "title": "Desligando WLAN em laptops",
      "level": 3,
      "content": "Às vezes o NetworkManager não funciona quando você desabilita o seu adaptador Wi-Fi com um botão em seu laptop e tenta habilitá-lo novamente depois. Isso geralmente é um problema com rfkill. Para verificar se o driver notifica rfkill sobre o status do adaptador sem fio, use:\n\n```\n$ watch -n1 rfkill list all\n```\n\nSe um identificador permanecer bloqueado depois de ligar o adaptador, você pode tentar desbloqueá-lo manualmente (onde X é o número do identificador fornecido pela saída acima):\n\n```\n# rfkill event unblock X\n```\n\n"
    },
    {
      "title": "Reversão de configurações de endereço IP estático para DHCP",
      "level": 3,
      "content": "Devido a um erro não resolvido, ao alterar as conexões padrão para um endereço IP estático, o nm-applet pode não armazenar adequadamente a alteração de configuração e voltará ao DHCP automático.\n\nPara contornar este problema você tem que editar a conexão padrão (por exemplo, \"Auto eth0\") em nm-applet, alterar o nome da conexão (por exemplo \"meu eth0\"), desmarque a caixa de seleção \"Disponível para todos os usuários\", altere suas configurações de endereço IP estático conforme desejado e clique em Aplicar. Isso salvará uma nova conexão com o nome fornecido.\n\nEm seguida, você desejará fazer com que a conexão padrão não seja conectada automaticamente. Para fazer isso, execute nm-connection-editor (não como root). No editor de conexão, edite a conexão padrão (por exemplo, \"Auto eth0\") e desmarque \"Conectar automaticamente\". Clique em Aplicar e feche o editor de conexão.\n\n"
    },
    {
      "title": "Não é possível editar conexões como usuário normal",
      "level": 3,
      "content": "Veja #Configurar as permissões de PolicyKit.\n\n"
    },
    {
      "title": "Esquecer rede sem fio oculta",
      "level": 3,
      "content": "Como as redes ocultas não são exibidas na lista de seleção da tela de redes sem fio, elas não podem ser esquecidas (removidas) com a GUI. Você pode excluir um com o seguinte comando:\n\n```\n# rm /etc/NetworkManager/system-connections/SSID\n```\n\nIsso funciona para qualquer outra conexão.\n\n"
    },
    {
      "title": "VPN não funciona no GNOME",
      "level": 3,
      "content": "Ao configurar conexões OpenConnect ou vpnc no NetworkManager enquanto estiver usando o GNOME, você algumas vezes nunca verá a caixa de diálogo aparecer e o seguinte erro aparecerá em /var/log/errors.log:\n\n```\nlocalhost NetworkManager[399]: <error> [1361719690.10506] [nm-vpn-connection.c:1405] get_secrets_cb(): Failed to request VPN secrets #3: (6) No agents were available for this request.\n```\n\nIsso é causado pelo fato do miniaplicativo de NM do GNOME esperar que os scripts de diálogo estejam em /usr/lib/gnome-shell, quando os pacotes do NetworkManager os colocam em /usr/lib/networkmanager. Como uma correção \"temporária\" (este bug já existe há algum tempo), faça os seguintes links simbólicos:\n\n- Para OpenConnect: ln -s /usr/lib/networkmanager/nm-openconnect-auth-dialog /usr/lib/gnome-shell/\n- Para VPNC (isto é, Cisco VPN): ln -s /usr/lib/networkmanager/nm-vpnc-auth-dialog /usr/lib/gnome-shell/\n\nIsso pode precisar ser feito para qualquer outro plug-in de VPN do NM, mas esses são os dois mais comuns.\n\n"
    },
    {
      "title": "Impossibilidade de se conectar a redes sem fio europeias visíveis",
      "level": 3,
      "content": "Os chips WLAN são fornecidos com um padrão domínio regulatório. Se o seu ponto de acesso não operar dentro dessas limitações, você não conseguirá se conectar à rede. Consertar isso é fácil:\n\n1. Instale wireless-regdb\n1. Descomente o código de país correto em /etc/conf.d/wireless-regdom\n1. Reinicie o sistema, pois a configuração está como somente leitura na inicialização\n\n"
    },
    {
      "title": "Conexão automática a VPN na inicialização não funciona",
      "level": 3,
      "content": "O problema ocorre quando o sistema (ou seja, o NetworkManager em execução como usuário root) tenta estabelecer uma conexão VPN, mas a senha não está acessível porque está armazenada no GNOME Keyring de um usuário específico.\n\nUma solução é manter a senha em sua VPN em texto simples, conforme descrito na etapa (2.) de #Usar dispatcher para conectar a uma VPN após uma conexão de rede ser estabelecida.\n\nVocê não precisa mais usar o dispatcher descrito na etapa (1.) para se conectar automaticamente, se você usar a nova opção \"autoconectar VPN\" na interface gráfica do nm-applet.\n\n"
    },
    {
      "title": "Gargalo no systemd",
      "level": 3,
      "content": "Com o tempo, os arquivos de log (/var/log/journal) podem se tornar muito grandes. Isso pode ter um grande impacto no desempenho da inicialização ao usar o NetworkManager, consulte: Systemd (Português)#Tempo de inicialização aumentando com o tempo.\n\n"
    },
    {
      "title": "Desconexões de rede regulares, latência, pacotes perdidos (WiFi)",
      "level": 3,
      "content": "O NetworkManager faz uma varredura a cada 2 minutos.\n\nAlguns drivers de WiFi apresentam problemas ao procurar estações base enquanto conectados/associados. Os sintomas incluem desconexões/reconexões de VPN e perda de pacotes, páginas da Web que não podem ser carregadas e, em seguida, atualizadas corretamente.\n\nA execução journalctl -f indicará que isso está ocorrendo, mensagens como as seguintes estarão contidas nos logs em intervalos regulares.\n\n```\nNetworkManager[410]: <info>  (wlp3s0): roamed from BSSID 00:14:48:11:20:CF (my-wifi-name) to (none) ((none))\n```\n\nSe o roaming não for importante, o comportamento de varredura periódica poderá ser desabilitado bloqueando o BSSID do ponto de acesso no perfil de conexão WiFi.\n\n"
    },
    {
      "title": "Impossibilidade de ligar o Wi-Fi com laptop Lenovo (IdeaPad, Legion, etc.)",
      "level": 3,
      "content": "Há um problema com o módulo ideapad_laptop em alguns modelos da Lenovo, devido ao driver wi-fi relatar incorretamente um bloco virtual. A placa ainda pode ser manipulada com netctl, mas os gerenciadores como o NetworkManager quebram. Você pode verificar se este é o problema, verificando a saída de rfkill list depois de alternar sua chave de hardware e ver que o bloco de software persiste.\n\nDescarregar o módulo ideapad_laptop deve corrigir isso. (atenção: isso também pode desabilitar o teclado e o touchpad do laptop!).\n\n"
    },
    {
      "title": "Desligar envido de hostname",
      "level": 3,
      "content": "O NetworkManager, por padrão, envia o nome do host para o servidor DHCP. O envio de nome de host só pode ser desativado por conexão não globalmente (Bug 768076 do GNOME).\n\nPara desabilitar o envio do seu nome de host para o servidor DHCP para uma conexão específica, adicione o seguinte ao seu arquivo de conexão de rede:\n\n```\n/etc/NetworkManager/system-connections/seu_arquivo_de_conexão\n```\n\n```\n...\n[ipv4]\ndhcp-send-hostname=false\n...\n[ipv6]\ndhcp-send-hostname=false\n...\n```\n\n"
    },
    {
      "title": "nm-applet desaparece no i3wm",
      "level": 3,
      "content": "Se você usar o xfce4-notifyd.service para notificações, deverá editar a unidade e adicionar o seguinte:\n\n```\n/etc/systemd/user/xfce4-notifyd.service.d/display_env.conf\n```\n\n```\n[Service]\nEnvironment=\"DISPLAY=:0.0\"\n```\n\nDepois de recarregar os daemons, reinicie o xfce4-notifyd.service. Saia do i3 e reinicie-o novamente, e o miniaplicativo deverá aparecer na área de notificação.\n\n"
    },
    {
      "title": "Ícones de bandeja do nm-applet exibidos incorretamente",
      "level": 3,
      "content": "Atualmente, os ícones da área de notificação do nm-applet são desenhados uns em cima dos outros, ou seja, o ícone exibindo a força sem fio pode ser exibido na parte superior do ícone, indicando que não há conexão com fio. Isso aparentemente é um problema/bug do GTK3: https://gitlab.gnome.org/GNOME/gtk/issues/1280 .\n\nUma versão corrigida do GTK3 existe no AUR, que aparentemente corrige o erro do ícone da área de notificação: gtk3-classicAUR .\n\n"
    },
    {
      "title": "Unit dbus-org.freedesktop.resolve1.service não encontrado",
      "level": 3,
      "content": "Se systemd-resolved.service não tiver sido iniciado, NetworkManager vai tentar iniciá-lo usando D-Bus e vai falhar:\n\n```\ndbus-daemon[991]: [system] Activating via systemd: service name='org.freedesktop.resolve1' unit='dbus-org.freedesktop.resolve1.service' requested by ':1.23' (uid=0 pid=1012 comm=\"/usr/bin/NetworkManager --no-daemon \")\ndbus-daemon[991]: [system] Activation via systemd failed for unit 'dbus-org.freedesktop.resolve1.service': Unit dbus-org.freedesktop.resolve1.service not found.\ndbus-daemon[991]: [system] Activating via systemd: service name='org.freedesktop.resolve1' unit='dbus-org.freedesktop.resolve1.service' requested by ':1.23' (uid=0 pid=1012 comm=\"/usr/bin/NetworkManager --no-daemon \")\n```\n\nIsso é porque o NetworkManager vai tentar enviar informações DNS para systemd-resolved independentemente da configuração main.dns= no NetworkManager.conf(5).[6]\n\nIsso pode ser desabilitado com um arquivo de configuração em /etc/NetworkManager/conf.d/:\n\n```\n/etc/NetworkManager/conf.d/no-systemd-resolved.conf\n```\n\n```\n[main]\nsystemd-resolved=false\n```\n\nVeja FS#62138.\n\n"
    },
    {
      "title": "Segredos eram necessários, mas não fornecidos",
      "level": 3,
      "content": "Se você tenta se conectar a uma rede usando o dispositivo nmcli device wifi connect SSID password senha e recebe o seguinte erro:\n\n```\nErro: Ativação da conexão falhou: (7) Segredos foram requisitados, mas não fornecidos\n```\n\nO erro pode ser resolvido excluindo o perfil de conexão e criando um novo:\n\n```\n$ nmcli connection delete SSID\n$ nmcli device wifi connect SSID password senha\n```\n\n"
    },
    {
      "title": "Conexão WPA Empresarial com o NetworkManager",
      "level": 3,
      "content": "Se você tentar se conectar a uma rede WPA Empresarial como 'eduroam' com o NetworkManager com o backend iwd, o NetworkManager receberá o seguinte erro:\n\n```\nConnection 'eduroam' is not avialable on device wlan0 because profile is not compatible with device (802.1x connections must have IWD provisioning files)\n```\n\nIsso ocorre porque o NetworkManager não consegue configurar uma rede WPA Enterprise. Portanto, você deve configurá-lo usando um arquivo de configuração do iwd /var/lib/iwd/essid.8021x como descrito em iwd (Português)#WPA Empresarial.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- NetworkManager para Administradores Parte 1\n- Wikipedia:pt:NetworkManager\n\n"
    }
  ]
}