{
  "title": "NFC (Polski)",
  "url": "https://wiki.archlinux.org/title/NFC_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Obsługa urządzeń NFC pod Linuxem stała się względnie prosta. Ta strona opisuje jak szybko skonfigurować najpopularniejsze czytniki NFC.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiety ccid, libnfc, acsccid, pcsclite i pcsc-tools.\n\nPo zainstalowaniu pakietu pcsclite możesz włączyć gniazdo pcscd.socket, które automatycznie uruchomi usługę pcscd, gdy zażąda tego jakaś aplikacja. Usługę pcscd.service możesz też włączyć ręcznie, nie używając gniazda.\n\nInstalacja pakietu libnfc skutkuje stworzeniem nowych reguł udev i dodaniem modułów jądra do czarnej listy, a po takich zmianach sterownik musi zostać załadowany ponownie. W tym celu, koniecznie odłącz czytnik kart i podłącz go ponownie po zainstalowaniu pakietu.\n\n"
    },
    {
      "title": "Odczyt danych z kart NFC",
      "level": 2,
      "content": "To już prawdopodobnie wszystko, co potrzebne, aby wykonać próbny odczyt. Podłącz czytnik NFC i za pomocą polecenia pcsc_scan uruchom program, który spróbuje połączyć się z czytnikiem i wykryć znajdujące się w nim karty. Gdy spróbujesz odczytać kartę po odnalezieniu jej przez program, w terminalu powinny pojawić się informacje o zdarzeniach.\n\n```\n$ pcsc_scan\n```\n\n```\nUsing reader plug'n play mechanism\nScanning present readers...\n0: ACS ACR122U 00 00\n \nSun Sep  5 05:15:10 2021\n Reader 0: ACS ACR122U 00 00\n  Event number: 0\n  Card state: Card removed,\n```\n\n"
    },
    {
      "title": "Wspierane urządzenia",
      "level": 2,
      "content": "Pod adresem https://ccid.apdu.fr/#readers znajduje się lista czytników wspieranych przez ccid, a pod adresem https://nfc-tools.github.io/resources/ - przez libnfc.\n\n"
    },
    {
      "title": "Rozwiązywanie problemów",
      "level": 2,
      "content": "Jeżeli coś nie działa prawidłowo, sprawdź logi usługi pcscd.service.\n\n"
    }
  ]
}