{
  "title": "Nmap (Русский)",
  "url": "https://wiki.archlinux.org/title/Nmap_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "С официального сайта:\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет nmap.\n\nТакже есть графический интерфейс zenmapAUR, но в этой статье рассматривается только использование командной строки.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Смотрите nmap(1).\n\n"
    },
    {
      "title": "Определение цели сканирования",
      "level": 3,
      "content": "Есть несколько способов задать цель, которую Nmap должен будет просканировать. Самый простой способ — написать адрес или домен:\n\n```\n$ nmap scanme.nmap.org\n$ nmap 74.207.244.221\n```\n\n"
    },
    {
      "title": "Определение нескольких целей",
      "level": 4,
      "content": "С помощью CIDR-нотации можно задать диапазон адресов. Следующий пример будет сканировать все 256 IP-адресов, начинающихся на 10.1.1:\n\n```\n$ nmap 10.1.1.0/24\n```\n\nМожно задать диапазон через дефис. Пример сканирования 10.1.50.1, 10.1.51.1 и 10.1.52.1:\n\n```\n$ nmap 10.1.50-52.1\n```\n\nЗадать определённые значения через запятую:\n\n```\n$ nmap 10.1.50,51,52,57,59.1\n```\n\nВсё вместе:\n\n```\n$ nmap 10.1,2.50-52.1/30 10.1.1.1 10.1.1.2\n```\n\n"
    },
    {
      "title": "Сканирование с целью составления списка",
      "level": 3,
      "content": "Опция -sL (list scan) полезна для проверки, что вы задали правильные цели сканирования, перед выполнением реального сканирования:\n\n```\n$ nmap -sL 10.1,2.50-52.1/30 10.1.1.1 10.1.1.2\n```\n\nЗапуск с этой опцией просто выведет список всех прописанных адресов без отправки им каких-либо пакетов.\n\n"
    },
    {
      "title": "Опции по умолчанию",
      "level": 3,
      "content": "Если вы укажете только IP-адрес или домен без дополнительных опций:\n\n```\n$ nmap 74.207.244.221\n```\n\nNmap сделает следующее:\n\n1. Домен будет преобразован в IP-адрес или, наоборот, IP-адрес будет преобразован в домен с помощью reverse-DNS (для отключения добавьте опцию -n).\n1. Выполнится пинг-сканирование с использованием TCP ACK:80 и ICMP. Это эквивалентно -PA -PE (для отключения добавьте опцию -PN).\n1. Выполнится сканирование 1000 самых популярных портов. При запуске от имени root используется скрытное SYN-сканирование. При запуске от имени пользователя используется сканирование с помощью системного вызова connect.\n\n"
    },
    {
      "title": "Пинг-сканирование",
      "level": 2,
      "content": "Пинг-сканирование (ping scan, обнаружение хостов) — это метод определения, работают ли указанные компьютеры. По умолчанию Nmap выполняет пинг-сканирование перед сканированием портов, чтобы не тратить время на хосты, которых даже нет в сети. Чтобы выполнить только пинг-сканирование, используйте опцию:\n\n```\n$ nmap -sn 10.1.1.1/8\n```\n\nNmap проверит доступность каждого указанного хоста и выведет список ответивших хостов.\n\nNmap использует разные типы пингования при запуске с правами пользователя или root и при сканировании своей или сторонней подсети:\n\nTable content:\n | Внешний IP | Локальный IP\nОбычный пользователь | TCP SYN на портах 80 и 443 | TCP SYN на портах 80 и 443 и ARP\nСуперпользователь | TCP SYN на портах 80 и 443 и IGMP | ARP\n\n"
    },
    {
      "title": "Типы пинг-сканирования",
      "level": 3,
      "content": "Table content:\nОпция | Тип\n-Pn | Отключение пинг-сканирования\n-PS | TCP SYN (по умолчанию на порту 80)\n-PA | TCP ACK (по умолчанию на порту 80)\n-PU | UDP\n-PY | SCTP INIT\n-PE | ICMP Echo\n-PP | ICMP timestamp\n-PM | ICMP address mask\n-PO | Other IP protocol\n-PR | ARP сканирование\n\n-Pn полезен, когда сканируемый хост защищён межсетевым экраном, который блокирует доступ к TCP-портам 80 и 443 и IGMP-запросы, но может принимать подключения на других менее распространённых портах.\n\n"
    },
    {
      "title": "Сканирование портов",
      "level": 2,
      "content": "Порт может быть в трёх основных состояниях:\n\n- открыт (open) — на хосте есть программа, которая слушает этот порт и успешно ответила на запрос\n- закрыт (closed) — хост ответил, что этот порт никто не слушает\n- фильтруется (filtered) — хост вообще не ответил. Это может означать, что запрос был заблокирован межсетевым экраном\n\nВ дополнение к ним существует ещё 3 состояния, в которых Nmap может классифицировать порт. Они используются, когда Nmap не может достоверно определить состояние, но подозревает два из трех возможных состояний:\n\n- open|closed (unfiltered) — порт открыт или закрыт (при ACK-сканировании)\n- closed|filtered) — порт закрыт или фильтруется (при сканировании IP ID idle типа)\n- open|filtered — порт открыт или фильтруется (например, при UDP-сканировании)\n\nПо умолчанию Nmap сканирует 1000 самых популярных портов, указанных в файле /usr/share/nmap/nmap-services. Можно задать сканирование другого количества популярных портов:\n\n```\n$ nmap --top-ports 1000 10.1.1.1\n```\n\nЧтобы задать свои номера портов, используйте опцию -p:\n\n```\n$ nmap -p -25,135-137 10.1.1.1\n```\n\nОпределение портов с дефисами и запятыми работает так же, как и #Определение цели сканирования. Кроме того, можно указать все порты до/после заданного, пропуская начальный/конечный порт при использовании дефиса. Например, для сканирования всех возможных 65535 портов (кроме порта 0):\n\n```\n$ nmap -p -\n```\n\n"
    },
    {
      "title": "Типы сканирования",
      "level": 3,
      "content": "Table content:\nОпция | Тип\n-sP | Только пинг-сканирование\n-sS | TCP SYN (скрытное) (По умолчанию при запуске суперпользователем)\n-sT | TCP с системным вызовом connect (По умолчанию при запуске обычным пользователем)\n-sA | TCP ACK\n-sF | TCP FIN\n-sX | TCP FIN, SYN, ACK\n-sW | TCP window\n-sM | TCP сканирование Мэймона (Maimon)\n-sU | UDP-сканирование\n-sI | «Ленивое» idle сканирование\n-b | FTP bounce сканирование\n-sO | Сканирование других IP-протоколов\n\n"
    },
    {
      "title": "Модуль PSD для iptables",
      "level": 3,
      "content": "PSD — модуль расширения для iptables. Он также применяется в некоторых коммерческих маршрутизаторах, использующих Linux.\n\nУ него есть 4 параметра:\n\n- --psd-weight-threshold порог, по умолчанию: 21\n\n- --psd-delay-threshold задержка, по умолчанию: 300 (3 секунды)\n\n- --psd-lo-ports-weight вес, по умолчанию: 3\n\n- --psd-hi-ports-weight вес, по умолчанию: 1\n\nПринцип действия PSD простой. Если запросы с одного IP набрали суммарный вес, превышающий заданный порог в течение заданной задержки, то IP классифицируется как сканер портов. В математическом выражении:\n\n```\nlo_ports_weight * REQUESTS_LOW + hi_ports_weight * REQUESTS_HIGH >= threshold\n```\n\nгде\n\n```\nREQUESTS_LOW = число запросов к привилегированным (от 0 до 1023) портам в течение заданной задержки\nREQUESTS_HI = число запросов к непривилегированным (от 1024 до 65535) портам в течение заданной задержки\n```\n\nПримеры при использовании параметров по умолчанию:\n\n- Если хост обратился как минимум к 7 привилегированным портам в течение 3 секунд, он считается сканером портов.\n- Если хост обратился как минимум к 21 непривилегированным портам в течение 3 секунд, он считается сканером портов.\n- Если хост обратился к 4 привилегированным и к 9 непривилегированным портам в течение 3 секунд, он считается сканером портов, потому что 4*3 + 9*1 >= 21.\n\n"
    },
    {
      "title": "Избегание обнаружения",
      "level": 3,
      "content": "Простейший способ обойти PSD — просто сканировать медленно. Для параметров PSD по умолчанию достаточно добавить такую опцию:\n\n```\n$ nmap --scan-delay 3.1 192.168.56.1\n```\n\nЕщё одним интересным фактом о PSD является то, что он не определяет запрос как сканирование порта, если установлены флаги ack или rst (смотрите функцию is_portscan в xt_psd.c).\n\nТакже, если вы сканируете порт хоста, а на нём запущена служба HTTP(S), nmap по умолчанию будет использовать User-Agent Mozilla/5.0 (compatible; Nmap Scripting Engine; https://nmap.org/book/nse.html). Таким образом, ваши действия будут легко обнаружены, особенно если администратор или робот следят за появлением такого User-Agent в журналах сервера. К счастью, nmap позволяет нам легко изменить эту строку: просто добавьте опцию -script-args http.useragent=\"какой угодно user agent\". Источник\n\n"
    },
    {
      "title": "Ограничение скорости сканирования",
      "level": 3,
      "content": "Сканирование Nmap происходит быстро. Хотя это обычно желательно, иногда это может стать проблемой. Например, когда вы хотите протестировать межсетевой экран вашей системы, не отключая активированные правила обнаружения флуда, или когда вы хотите провести длительное тестирование для определённого порта/сервиса. Следующие опции определяют скорость, с которой Nmap отправляет пакеты.\n\nЧтобы отправлять пакеты не чаще, чем каждые 3,333 секунды:\n\n```\n$ nmap --max-rate 0.3 192.168.56.1\n```\n\nЧтобы отправлять пакеты раз в 3,1 секунды:\n\n```\n$ nmap --scan-delay 3.1 192.168.56.1\n```\n\nЕсть и другие опции, которые подробно описаны в nmap(1).\n\n"
    },
    {
      "title": "Считывание целей из файла",
      "level": 3,
      "content": "Если нужно просканировать большое количество несмежных адресов, то прописывать их все в командной строке обычно неудобно. По этой причине Nmap поддерживает чтение целей из файла с помощью опции -iL (input from a list file):\n\n```\naddresses.txt\n```\n\n```\n10.1.1.1 10.1.1.2 10.1.1-10.3\n10.3.1.3 10.3.1.50 10.3.2.55\n10.1.1.100\n...\n```\n\n```\n$ nmap -iL addresses.txt\n```\n\nАдреса нужно разделять пробельными символами.\n\nТакже можно считывать список из стандартного ввода (- означает стандартный ввод во многих консольных инструментах):\n\n```\n$ echo \"10.1.1.1 10.1.1.2 10.1.1-10.3\" | nmap -iL -\n```\n\n"
    },
    {
      "title": "Исключение целей из сканирования",
      "level": 3,
      "content": "```\n$ nmap 10.1.1.1-10 --exclude 10.1.1.5,7\n```\n\nИли считывание из файла:\n\n```\n$ nmap 10.1.1.1-10 --excludefile excludeaddr.txt\n```\n\n"
    },
    {
      "title": "Подмена",
      "level": 3,
      "content": "Подмена исходящего IP-адреса:\n\n```\n$ nmap -S 192.168.56.35 -e vboxnet0 192.168.56.11\n```\n\nПодмена MAC-адреса:\n\n```\n$ nmap --spoof-mac 01:02:03:04:05:06 192.168.56.11\n```\n\nПодмена исходящего порта:\n\n```\n$ nmap --source-port 22 192.168.56.11\n```\n\n"
    },
    {
      "title": "Ускорение сканирования",
      "level": 3,
      "content": "По умолчанию nmap выполняет DNS/reverse-DNS запросы. Чтобы отключить это, используйте опцию -n:\n\n```\n$ nmap -n 192.168.56.0/24\n```\n\nЭто ускоряет сканирование примерно в 2 раза.\n\n"
    },
    {
      "title": "Сканирование порта 0",
      "level": 3,
      "content": "По умолчанию порт с номером 0 не сканируется, даже если указать опцию -p -. Чтобы просканировать и его тоже, явно задайте диапазон с его использованием. Например, чтобы просканировать абсолютно все порты:\n\n```\n$ nmap -p 0-65535\n```\n\nИмейте в виду, что этот номер порта считается недействительным в стандартах RFC. Однако он может использоваться, например, вредоносными программами, чтобы спрятаться более наивных сканеров портов.\n\n"
    },
    {
      "title": "Форматы вывода файлов",
      "level": 3,
      "content": "Помимо вывода в терминал, Nmap умеет записывать результаты сканирования в файл:\n\n- -oN файл\n\n- -oX файл\n\n- -oG файл\n\n- -oA имя\n\nНапример, чтобы записать вывод в терминал, в файл и в XML-файл:\n\n```\n$ nmap -oN output.txt -oX output.xml scanme.nmap.org\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Wikipedia:ru:nmap\n- Официальный сайт\n- Nmap Network Scanning book\n\n"
    }
  ]
}