{
  "title": "Nouveau (Français)",
  "url": "https://wiki.archlinux.org/title/Nouveau_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- NVIDIA (Français)\n- Xorg (Français)\n- Bumblebee (Français)\n\nCet article traite du pilote libre Nouveau[dead link 2025-04-06 ⓘ] pour les cartes graphiques NVIDIA. Pour des informations sur le pilote propriétaire, consultez NVIDIA.\n\nTrouvez le nom de code[dead link 2025-04-06 ⓘ] de votre carte (une liste plus détaillée est disponible sur Wikipedia), et comparez-le au tableau des fonctionnalités pour savoir lesquelles sont prises en charge.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet mesa, qui fournit le pilote DRI pour l'accélération 3D.\n\n- Pour prendre en charge les applications 32 bits, installez également le paquet lib32-mesa du dépôt multilib.\n- Pour le pilote DDX (qui fournit l'accélération 2D dans Xorg), installez le paquet xf86-video-nouveau.\n\nConsultez également Hardware video acceleration.\n\n"
    },
    {
      "title": "Chargement",
      "level": 2,
      "content": "Le module du noyau Nouveau devrait se charger automatiquement au démarrage du système. Si ce n'est pas le cas, alors :\n\n- Assurez-vous que vous n'avez pas nomodeset ou vga= en tant que paramètre du noyau, puisque Nouveau requiert le «kernel mode-setting».\n- Vérifiez également que vous n'avez pas désactivé Nouveau en utilisant une technique de liste noire de modprobe dans /etc/modprobe.d/ ou /usr/lib/modprobe.d/.\n- Si tout ce qui précède ne permet toujours pas de charger nouveau, vérifiez dmesg pour une erreur d'opcode. Ajoutez nouveau.config=NvBios=PRAMIN à vos paramètres du noyau pour empêcher le déchargement du module. [1]\n- Vérifiez si /etc/X11/xorg.conf existe et fait référence au pilote nvidia. C'est probablement une bonne idée de renommer le fichier.\n\n"
    },
    {
      "title": "Activer le KMS précoce",
      "level": 3,
      "content": "Le Kernel mode setting (KMS) est requis par le pilote Nouveau. Par défaut, le KMS est effectué après le chargement des autres modules du noyau. Vous consulterez le texte \"Loading modules\" et la taille du texte peut changer, éventuellement avec un scintillement indésirable. Consultez la page Nouveau KernelModeSetting pour plus de détails.\n\nIl est également possible de lancer le KMS le plus tôt possible dans le processus de démarrage, lorsque l'initramfs est chargé.\n\nPour ce faire, ajoutez nouveau au tableau MODULES dans /etc/mkinitcpio.conf. (les noms des modules sont séparés par des espaces) :\n\n```\nMODULES=(... nouveau ...)\n```\n\nSi vous utilisez un fichier EDID personnalisé, vous devez également l'intégrer dans initramfs :\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nFILES=\"/lib/firmware/edid/your_edid.bin\"\n```\n\nRe-générez l'initramfs pour finir.\n\n"
    },
    {
      "title": "Garder le pilote NVIDIA installé",
      "level": 3,
      "content": "Si vous voulez garder le pilote propriétaire NVIDIA installé (et n'utilisez pas OpenGL), mais que vous voulez utiliser le pilote Nouveau, commentez la liste noire de nouveau dans /etc/modprobe.d/nouveau_blacklist.conf, /usr/lib/modprobe.d/nvidia.conf, ou /usr/lib/modprobe.d/nvidia-dkms.conf en le modifiant comme suit :\n\n```\n#blacklist nouveau\n```\n\nEt dites à Xorg de charger nouveau au lieu de nvidia en créant le fichier /etc/X11/xorg.conf.d/20-nouveau.conf avec le contenu suivant :\n\n```\nSection \"Device\"\n    Identifier \"Nvidia card\"\n    Driver \"nouveau\"\nEndSection\n```\n\nSi vous avez déjà utilisé le pilote NVIDIA, et que vous voulez tester Nouveau sans redémarrage, assurez-vous que le module 'nvidia' n'est plus chargé :\n\n```\n# rmmod nvidia\n```\n\nChargez ensuite le module 'nouveau' :\n\n```\n# modprobe nouveau\n```\n\nEt vérifiez qu'il est bien chargé en regardant les messages du noyau :\n\n```\n# dmesg\n```\n\n"
    },
    {
      "title": "Installation des derniers paquets de développement",
      "level": 3,
      "content": "Pour obtenir les dernières améliorations de Nouveau:\n\n- linux-gitAUR\n- libdrm-gitAUR\n- lib32-libdrm-gitAUR\n- lib32-mesa-gitAUR\n- mesa-gitAUR\n- xf86-video-nouveau-gitAUR\n\n"
    },
    {
      "title": "Dual head",
      "level": 3,
      "content": "Consultez Multihead#RandR pour savoir comment configurer plusieurs moniteurs en utilisant RandR.\n\n"
    },
    {
      "title": "Réglage de la résolution de la console",
      "level": 3,
      "content": "Vous pouvez passer la résolution à nouveau avec l'option de ligne de noyau video= (consultez KMS).\n\n"
    },
    {
      "title": "Gestion de l'alimentation",
      "level": 3,
      "content": "L'absence d'une gestion de l'énergie appropriée dans le pilote nouveau est l'une des causes les plus importantes des problèmes de performance, puisque la plupart des cartes resteront dans leur état de faible puissance avec des horloges plus basses pendant leur utilisation. Une prise en charge expérimentale du re-cadencage du GPU est disponible pour certaines cartes (consultez la page Nouveau PowerManagement) et depuis le noyau 4.5, elle peut être contrôlée par une interface debugfs située à /sys/kernel/debug/dri/*/pstate.\n\nPar exemple, pour vérifier les états d'alimentation disponibles et le paramètre actuel pour la première carte de votre système, exécutez :\n\n```\n# cat /sys/kernel/debug/dri/0/pstate\n```\n\nIl est également possible de définir/forcer manuellement un certain état d'alimentation en écrivant dans ladite interface :\n\n```\n# echo pstate > /sys/kernel/debug/dri/0/pstate\n```\n\n"
    },
    {
      "title": "Contrôle des ventilateurs",
      "level": 4,
      "content": "S'il est implémenté pour votre carte, vous pouvez configurer le contrôle du ventilateur via /sys.\n\n```\n$ find /sys -name pwm1_enable\n/sys/devices/pci0000:00/0000:00:01.0/0000:01:00.0/hwmon/hwmon1/pwm1_enable\n$ readlink /sys/devices/pci0000:00/0000:00:01.0/0000:01:00.0/driver\n../../../../bus/pci/drivers/nouveau\n```\n\npwm1_enable peut être réglé sur 0, 1 ou 2, ce qui signifie NONE, MANUAL et AUTO. S'il est réglé sur le contrôle manuel du ventilateur, vous pouvez régler pwm1 manuellement, par exemple sur 40 pour 40%.\n\nVous pouvez également le définir par une règle udev :\n\n```\n$ cat /etc/udev/rules.d/50-nouveau-hwmon.rules\nACTION==\"add\", SUBSYSTEM==\"hwmon\", DRIVERS==\"nouveau\", ATTR{pwm1_enable}=\"2\"\n```\n\nSources :\n\n- https://floppym.blogspot.de/2013/07/fan-control-with-nouveau.html\n- https://web.archive.org/web/20141031191559/https://kalgan.cc/blog/posts/Controlling_nVidia_cards_fans_with_nouveau_in_Debian/\n\n"
    },
    {
      "title": "Optimus",
      "level": 3,
      "content": "Vous avez deux solutions pour utiliser Optimus sur un ordinateur portable (aka graphique hybride, lorsque vous avez deux GPU sur votre ordinateur portable) : bumblebee et PRIME.\n\n"
    },
    {
      "title": "Synchronisation verticale",
      "level": 3,
      "content": "Les compositeurs Xorg sont sujets à des problèmes d'affichage avec Nouveau. Contrairement à la plupart d'entre eux, Picom offre de nombreuses options à régler pour obtenir un résultat plus fluide et sans déchirure. Une configuration qui devrait donner un bon résultat serait la suivante :\n\n```\n$ picom -b --unredir-if-possible --backend xr_glx_hybrid --vsync --use-damage --glx-no-stencil\n```\n\n"
    },
    {
      "title": "Dépannage",
      "level": 2,
      "content": "Ajoutez drm.debug=14 et log_buf_len=16M à vos paramètres du noyau pour activer le débogage vidéo :\n\nCréer un journal Xorg verbeux :\n\n```\n$ startx -- -logverbose 9 -verbose 9\n```\n\nAffichez les paramètres et les valeurs du module vidéo chargé :\n\n```\n$ modinfo -p video\n```\n\n"
    },
    {
      "title": "Désactiver MSI",
      "level": 3,
      "content": "Si vous avez toujours des problèmes pour charger le module ou démarrer le serveur X, ajoutez nouveau.config=NvMSI=0 à vos paramètres du noyau.\n\nSource : https://bugs.freedesktop.org/show_bug.cgi?id=78441\n\n"
    },
    {
      "title": "Problème de sortie fantôme",
      "level": 3,
      "content": "Il est possible pour le pilote nouveau de détecter des sorties \"fantômes\". Par exemple, VGA-1 et LVDS-1 sont affichés comme connectés mais seul LVDS-1 est présent.\n\nCela provoque des problèmes d'affichage et/ou empêche la suspension à la fermeture du couvercle.\n\n"
    },
    {
      "title": "Paramètres du noyau",
      "level": 4,
      "content": "Le problème peut être résolu en désactivant la sortie fantôme (VGA-1 dans les exemples donnés) avec les paramètres du noyau :\n\n```\nvideo=VGA-1:d\n```\n\nAvec d = désactivation.\n\nLe nouveau module du noyau a également une option pour désactiver la détection de la sortie TV [2] :\n\n```\ntv_disable=1\n```\n\n"
    },
    {
      "title": "Configuration Xorg",
      "level": 4,
      "content": "La sortie fantôme peut être désactivée dans Xorg en ajoutant ce qui suit à /etc/X11/xorg.conf.d/20-nouveau.conf :\n\n```\nSection \"Monitor\"\nIdentifier \"VGA-1\"\nOption \"Ignore\" \"1\"\nEndSection\n```\n\nSource : https://web.archive.org/web/20170118202740/http://gentoo-en.vfose.ru/wiki/Nouveau#Phantom_and_unpopulated_output_connector_issues\n\n"
    },
    {
      "title": "Xrandr",
      "level": 4,
      "content": "Xrandr peut désactiver la sortie :\n\n```\n$ xrandr --output VGA-1 --off\n```\n\nCeci peut être ajouté à la configuration de xinit.\n\n"
    },
    {
      "title": "Blocages aléatoires avec messages d'erreur du noyau",
      "level": 3,
      "content": "Des puces NVIDIA spécifiques avec Nouveau peuvent provoquer des blocages aléatoires du système et, plus fréquemment, de nombreux messages du noyau, consultés avec dmesg. Essayez d'ajouter nouveau.noaccel=1 aux paramètres du noyau. Consultez Fedora:Common kernel problems#Systems with nVidia adapters using the nouveau driver lock up randomly pour plus d'informations.\n\nComme alternative, vous pouvez également utiliser la variable d'environnement QT_XCB_FORCE_SOFTWARE_OPENGL=1 pour désactiver l'accélération OpenGL dans les applications Qt.\n\n"
    },
    {
      "title": "Flat Panel Table Invalid",
      "level": 3,
      "content": "Les cartes graphiques NVIDIA avec des chipsets récents peuvent causer des problèmes de démarrage - cela inclut l'impossibilité de démarrer X11 et le gel indéfini de lspci [3] [4] [5] [6] [7].\n\nCela peut casser les distributions «live» ou les supports d'installation. Cela peut être détecté soit en exécutant lspci, soit en vérifiant le journal systemd pour l'erreur :\n\n```\nnouveau E[     DRM]Pointer to flat panel table invalid\n```\n\nLe système peut démarrer si le pilote Nouveau est désactivé en passant les paramètres du noyau suivants :\n\n```\nmodprobe.blacklist=nouveau\n```\n\nLe pilote Nouveau peut alors être chargé en utilisant\n\n```\n# modprobe nouveau\n```\n\nLe système devrait alors fonctionner correctement. Si vous avez une autre carte graphique NVIDIA, ou si vous voulez simplement être sûr, vous pouvez désactiver la carte incriminée en utilisant :\n\n```\n$ echo 1 > /sys/bus/pci/devices/[id du périphérique de la carte]/remove\n```\n\n"
    }
  ]
}