{
  "title": "Nouveau (Українська)",
  "url": "https://wiki.archlinux.org/title/Nouveau_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Повʼязані статті\n\n- NVIDIA\n- Xorg (Українська)\n- Bumblebee\n\nУ цій статті розглядається відкритий драйвер Nouveau[мертве посилання 2025-04-06 ⓘ] для відеокарт Nvidia. Якщо ви хочете ознайомитися із пропієтарним драйвером, перегляньте сторінку NVIDIA.\n\nЩоб визначити функції, які Nouveau підтримує з вашою відеокартою, спочатку знайдіть її в цьому списку (кодові назви Nouveau)[мертве посилання 2025-04-06 ⓘ]. Порівняйте потрібну кодову назву з таблицею функцій (Feature Matrix).\n\n"
    },
    {
      "title": "Встановлення",
      "level": 2,
      "content": "- Для драйвера DDX (який надає 2D прискорення в сесії X.org) встановіть пакунок xf86-video-nouveau\n- Для підтримки 3D-прискорення, встановіть пакунок mesa, який надає драйвер DRI\n- Для підтримки 32-бітних програм встановіть пакунок lib32-mesa (репозитарій multilib).\n\n(Необов'язково) Щоб отримати останні вдосконалення Nouveau, встановіть такі пакети:\n\n- linux-gitAUR\n- libdrm-gitAUR\n- lib32-libdrm-gitAUR\n- lib32-mesa-gitAUR\n- mesa-gitAUR\n\n"
    },
    {
      "title": "Апаратне прискорення відео",
      "level": 3,
      "content": "Nouveau[мертве посилання 2025-04-06 ⓘ] підтримує як і VA-API, так і VDPAU\n\n- Підтримка є від серії GeForce 8[мертве посилання 2025-04-06 ⓘ] і до Kepler (NV108)[мертве посилання 2025-04-06 ⓘ] (Але ви ще можете спробувати це все завести на Maxwell).\n\nАле для його роботи потрібно встановити пакет прошивок nouveau-fwAUR, отриманих з бінарного драйвера NVIDIA\n\nЗа деталями звертайтеся до сторінки Hardware video acceleration\n\n"
    },
    {
      "title": "Підготовка до встановлення Mesa NVK Vulkan Драйвера",
      "level": 2,
      "content": "Для драйвера NVK необхідне ядро версії 6.7 та више і mesa версії 24.1 та вище.\n\nПерш ніж використовувати NVK, ви повинні видалити пропієтарний драйвер. Необхідно видалити ці пакунки з переліку (та їх lib32 і модулі DKMS):\n\n- nvidia, nvidia-open, nvidia-lts, nvidia-betaAUR\n- nvidia-settings, nvidia-utils\n- egl-wayland\n\nЯкщо ви використовуєте гібридний ноутбук або систему з двома графічним процесором, переконайтеся, що ви не внесли Nouveau до чорного списку менеджером графічного процесора в /etc/modprobe.d.\n\n"
    },
    {
      "title": "Встановлення Mesa NVK",
      "level": 3,
      "content": "Для підтримки Vulkan (Turing NV160[мертве посилання 2025-04-06 ⓘ] та новіших), встановіть пакунок vulkan-nouveau.\n\nДля підтримки 32-бітної версії Vulkan встановіть пакет lib32-vulkan-nouveau\n\nЯкщо хочете мати найновішу версію NVK, встановіть пакунок vulkan-nouveau-gitAUR та lib32-vulkan-nouveau-gitAUR, для підтримки 32-бітної версії Vulkan\n\n"
    },
    {
      "title": "Використання Mesa NVK",
      "level": 4,
      "content": "Щоб переконатися, що все працює vulkaninfo з vulkan-tools можна використовувати. Він повинен повідомити, що графічний процесор NVIDIA у вашій системі використовує драйвер NVK.\n\n```\n$ vulkaninfo\n...\nGPU id : 0 (NVIDIA GeForce RTX 3050 Ti Laptop GPU (NVK GA107)):\n      Surface type = VK_KHR_wayland_surface\n        Formats: count = 8\n...\n```\n\n"
    },
    {
      "title": "Використання NVK на відеокартах NVF0-NV140 і новіші",
      "level": 4,
      "content": "Якщо визначено до 1 або true, це дозволить перерахувати та використовувати всі GPU Kepler та новіші, включаючи графічні процесори, для яких апаратна підтримка погано протестована або повністю зламана. Джерело\n\n```\n$ NVK_I_WANT_A_BROKEN_VULKAN_DRIVER=1 програма\n```\n\n"
    },
    {
      "title": "Використання Zink",
      "level": 4,
      "content": "Так як виникають проблеми при реалізації нативного OpenGL для драйверу Nouveau, було прийнято рішення використовувати драйвер Zink.\n\nZink — це драйвер Gallium, який генерує виклики API Vulkan замість того, щоб орієнтуватися на конкретну архітектуру GPU. Це можна використовувати для отримання повної підтримки OpenGL на пристроях, які підтримують лише Vulkan.\n\nНайкраще він зараз працює на відеокартах NV160[мертве посилання 2025-04-06 ⓘ] і вище, та надає OpenGL 4.6 Просто додайте цю змінну перед командою запуску:\n\n```\n$ NOUVEAU_USE_ZINK=1 програма\n```\n\nЯк альтернативу, ви можете використовувати змінну MESA_LOADER_DRIVER_OVERRIDE=zink:\n\n```\n$ MESA_LOADER_DRIVER_OVERRIDE=zink програма\n```\n\nТакож, якщо у вас відеокарта нижча за NV160[мертве посилання 2025-04-06 ⓘ], то ви можете комбінувати дві змінні\n\n```\n$ NVK_I_WANT_A_BROKEN_VULKAN_DRIVER=1 NOUVEAU_USE_ZINK=1 програма\n```\n\n"
    },
    {
      "title": "Завантаження в систему",
      "level": 2,
      "content": "Модуль ядра Nouveau повинен завантажуватися автоматично під час завантаження системи. Якщо це не так, перевірте наступне:\n\n- Переконайтеся, що у вас немає зайвих параметрів ядра, на кшталт nomodeset або vga=, оскільки драйвер вимагає Kernel mode setting\n- Перконайтеся, що ви або якісь інші утиліти не занесли драйвер Nouveau в чорний список в /etc/modprobe.d/ або /usr/lib/modprobe.d/.\n- Перевірте файл /etc/X11/xorg.conf або подібні в теці /etc/X11/xorg.conf.d/. Ймовірно, там залишилися якісь конфіги.\n\n"
    },
    {
      "title": "Kernel Mode Setting",
      "level": 3,
      "content": "Налаштування режиму ядра (KMS) підтримується Nouveau і увімкнуто за замовчуванням, починаючи з mkinitcpio v32. Для інших налаштувань див. Налаштування режиму ядра, щоб отримати інструкції щодо того, як увімкнути KMS якнайшвидше під час процесу завантаження.\n\n"
    },
    {
      "title": "Залишити встановленим драйвер NVIDIA",
      "level": 3,
      "content": "Якщо ви хочете залишити встановленим пропрієтарний драйвер NVIDIA (і не використовуєте OpenGL), але бажаєте використовувати драйвер Nouveau, виконайте наступні кроки:\n\nЗакоментуйте чорний список для драйвера Nouveau у файлах /etc/modprobe.d/nouveau_blacklist.conf та /usr/lib/modprobe.d/nvidia-utils.conf, змінивши їх так:\n\n```\n#blacklist nouveau\n```\n\nТакож, можливо, вам потрібно буде закоментувати інші файли конфігурації, які пріоритезують пропрієтарний драйвер, наприклад, у systemd-modules-load /usr/lib/modules-load.d/nvidia-utils.conf, та у Udev /usr/lib/udev/rules.d/60-nvidia.rules. Перевірте, які файли встановив драйвер, за допомогою наступної команди:\n\n```\n# pacman -Ql nvidia-utils | grep conf\n```\n\nПотім переконайтеся, що ви вимкнули всі служби з префіксом nvidia-, які можуть викликати nvidia-modprobe для завантаження модуля під час завантаження системи. Наприклад:\n\n```\n$ systemctl status nvidia-persistenced.service\n```\n\nІ якщо ви використовуєте Xorg, скажіть Xorg завантажити nouveau замість NVIDIA, створивши файл /etc/X11/xorg.conf.d/20-nouveau.conf з таким вмістом:\n\n```\nSection \"Device\"\n    Identifier \"Nvidia card\"\n    Driver \"nouveau\"\nEndSection\n```\n\nПерезавантажте систему, щоб зміни набрали чинності. І перевірте, чи все завантажилось правильно, переглянувши повідомлення ядра:\n\n```\n# dmesg\n```\n\n"
    },
    {
      "title": "Монітори",
      "level": 3,
      "content": "Завітайте на сторінку Multihead#RandR, де написано як налаштувати декілька моніторів за допомогою RandR.\n\n"
    },
    {
      "title": "Налаштування роздільної здатності консолі",
      "level": 3,
      "content": "Ви можете виставити роздільну здатність за допомогою video= в параметрах ядра (дивіться додатково: KMS).\n\n"
    },
    {
      "title": "Керування живленням (reclocking)",
      "level": 3,
      "content": "Відсутність належного керування живленням у драйвері nouveau є однією з найважливіших причин проблем із продуктивністю, оскільки під час використання більшість карт залишатимуться в стані низького енергоспоживання з нижчою тактовою частотою. Експериментальна підтримка керування живленням графічного процесора доступна від NV40[мертве посилання 2025-04-06 ⓘ], і до новіших відеокарт (не враховуючи NV130[мертве посилання 2025-04-06 ⓘ] та NV140[мертве посилання 2025-04-06 ⓘ]).\n\nЦя частина вікі (4.4 та 4.4.2) буде відноситися тільки для серії відеокарт від NV40[мертве посилання 2025-04-06 ⓘ], і до NV120[мертве посилання 2025-04-06 ⓘ]. Для NV160[мертве посилання 2025-04-06 ⓘ] дивіться пункт 4.4.1\n\nДля підтримки керування живленням потрібне ядро 4.5 та вище, керувати живленням можна через інтерфейс debugfs, який розташований за шляхом /sys/kernel/debug/dri/*/pstate\n\nЩоб перевірити доступні рівні та поточне значення, виконайте:\n\n```\n# cat /sys/kernel/debug/dri/0/pstate\n```\n\nЩоб виставити потрібний параметр, виконайте\n\n```\n# echo pstate > /sys/kernel/debug/dri/0/pstate\n```\n\n"
    },
    {
      "title": "Керування живленням для NV160 та вище",
      "level": 4,
      "content": "Вам потрібно мати ядро 6.7 та вище. Додайте nouveau.config=NvGspRm=1 до параметрів ядра Linux. Це надає вам змогу використовувати автоматичне керування живленням.\n\n"
    },
    {
      "title": "Додаткові утиліти",
      "level": 4,
      "content": "Встановіть пакунок nouveau-reclockingAUR\n\nПро пакунок:\n\n- Ця утиліта на Lua має допомогти спростити процес reclocking та зробити це легше, без додаткових зусиль в терміналі. Зауважте, що якщо ваш графічний процесор не підтримує reclocking, то ця утиліта напевно для вас марна витрата часу. Джерело\n\nДля перевірки, передивіться доступні профілі\n\n```\n# nouveau-reclocking --list\n```\n\nЯкщо у вас відобразився список pstate, то можна спробувати виставити максимальне число:\n\n```\n# nouveau-reclocking --max\n```\n\nЗбережіть профіль, щоб він не скинувся та автоматично застосовувався після перезавантаження:\n\n```\n# nouveau-reclocking --save\n```\n\n"
    },
    {
      "title": "Керування вентиляторами",
      "level": 3,
      "content": "Якщо це реалізовано для вашої карти, ви можете налаштувати керування вентилятором через /sys\n\n```\n$ find /sys -name pwm1_enable\n/sys/devices/pci0000:00/0000:00:01.0/0000:01:00.0/hwmon/hwmon1/pwm1_enable\n$ readlink /sys/devices/pci0000:00/0000:00:01.0/0000:01:00.0/driver\n../../../../bus/pci/drivers/nouveau\n```\n\npwm1_enable можна встановити на 0, 1 або 2, що означає НЕМАЄ, РУЧНИЙ і АВТОМАТИЧНИЙ контроль вентилятора. Якщо встановлено ручне керування вентилятором, ви можете встановити pwm1 вручну, наприклад до 40 на 40%.\n\nВи також можете встановити це за правилом udev:\n\n```\n$ cat /etc/udev/rules.d/50-nouveau-hwmon.rules\nACTION==\"add\", SUBSYSTEM==\"hwmon\", DRIVERS==\"nouveau\", ATTR{pwm1_enable}=\"2\"\n```\n\nДжерела:\n\n- https://floppym.blogspot.de/2013/07/fan-control-with-nouveau.html\n- https://web.archive.org/web/20141031191559/https://kalgan.cc/blog/posts/Controlling_nVidia_cards_fans_with_nouveau_in_Debian/\n\n"
    },
    {
      "title": "Optimus",
      "level": 3,
      "content": "У вас є два рішення для використання Optimus на ноутбуці (гібридна графіка, коли у вас два графічних процесори на вашому ноутбуці): bumblebee та PRIME\n\n"
    },
    {
      "title": "Вертикальна синхронізація",
      "level": 3,
      "content": "Композитори Xorg схильні виявляти проблеми з Nouveau. На відміну від більшості з них, Picom пропонує безліч варіантів налаштування для більш гладкого результату без розривів. Конфігурація, яка, як очікується, дасть хороший результат, буде такою:\n\n```\n$ picom -b --unredir-if-possible --backend xr_glx_hybrid --vsync --use-damage --glx-no-stencil\n```\n\n"
    },
    {
      "title": "Усунення несправностей",
      "level": 2,
      "content": "Щоб отримати додаткову інформацію в логах, додайте drm.debug=14 та log_buf_len=16M до параметрів ядра Створіть докладний журнал Xorg:\n\n```\n$ startx -- -logverbose 9 -verbose 9\n```\n\nПереглянути параметри та значення завантаженого відеомодуля:\n\n```\n$ modinfo -p video\n```\n\n"
    },
    {
      "title": "Вимкніть MSI",
      "level": 3,
      "content": "Якщо у вас все ще виникають проблеми із завантаженням модуля або запуском X-сервера, додайте nouveau.config=NvMSI=0 до ваших параметрів ядра. Джерело: [1]\n\n"
    },
    {
      "title": "Фантомний відеовихід",
      "level": 3,
      "content": "Драйвер nouveau може виявити «фантомні» виходи. Наприклад, і VGA-1, і LVDS-1 відображаються як підключені, але присутній лише LVDS-1. Це спричиняє проблеми з відображенням і/або запобігає призупиненню під час закриття кришки.\n\n"
    },
    {
      "title": "Параметри ядра",
      "level": 4,
      "content": "Проблему можна також подолати, вимкнувши фантомний вихід (VGA-1 у наведених прикладах) за допомогою параметрів ядра:\n\n```\nvideo=VGA-1:d\n```\n\nДе d = вимкнено\n\nМодуль ядра nouveau також має можливість вимкнути виявлення ТВ-виходу\n\n```\ntv_disable=1\n```\n\n"
    },
    {
      "title": "xorg.conf",
      "level": 4,
      "content": "Фантомний вихід також можна вимкнути в Xorg, додавши наступне до /etc/X11/xorg.conf.d/20-nouveau.conf:\n\n```\nSection \"Monitor\"\n   Identifier \"VGA-1\"\n   Option \"Ignore\" \"1\"\nEndSection\n```\n\nДжерело вирішення\n\n"
    },
    {
      "title": "Xrandr",
      "level": 4,
      "content": "Xrandr може вимкнути вихід:\n\n```\n$ xrandr --output VGA-1 --off\n```\n\nЦе можна додати до конфігурації xinit.\n\n"
    },
    {
      "title": "Випадкові блокування з повідомленнями про помилки ядра",
      "level": 3,
      "content": "Окремі мікросхеми Nvidia з Nouveau можуть спричиняти випадкові блокування системи та частіше викидати багато повідомлень ядра, що спостерігається за допомогою dmesg . Спробуйте додати nouveau.noaccel=1 до параметрів ядра. Джерело.\n\nЗауважте, що використання параметра ядро nouveau.noaccel=1 може спричинити ~%100 використання ЦП на Wayland, якщо немає iGPU або iGPU вимкнено на заводі. Ви можете перейти до сеансу X11 або віддати перевагу додаванню LIBGL_ALWAYS_SOFTWARE=1 змінна середовища для wayland, щоб повністю вимкнути апаратне прискорення OpenGL.\n\nЯк альтернативу ви також можете використовувати QT_XCB_FORCE_SOFTWARE_OPENGL=1 змінна середовища , щоб вимкнути прискорення OpenGL у програмах Qt.\n\n"
    },
    {
      "title": "Таблиця плоскої панелі недійсна (Flat Panel Table Invalid)",
      "level": 3,
      "content": "Відеокарти NVIDIA з останніми наборами мікросхем можуть спричинити проблеми із запуском, зокрема неможливість запуску X11 і зависання lspci на невизначений час [2][3][4][5][6].\n\nЦе може порушити дію живих дистрибутивів/інсталяційних носіїв. Це можна виявити, запустивши lspci або перевіривши журнал systemd на наявність помилки:\n\n```\nnouveau E[     DRM]Pointer to flat panel table invalid\n```\n\nСистема може запуститися, якщо драйвер Nouveau вимкнено шляхом передачі таких параметрів ядра:\n\n```\nmodprobe.blacklist=nouveau\n```\n\nПотім драйвер Nouveau можна завантажити за допомогою\n\n```\n# modprobe nouveau\n```\n\nПісля цього система повинна працювати правильно. Якщо у вас є інша графічна карта Nvidia або ви просто хочете бути в безпеці, ви можете вимкнути несправну карту за допомогою:\n\n```\n$ echo 1 > /sys/bus/pci/devices/[card device id]/remove\n```\n\n"
    }
  ]
}