{
  "title": "NTFS",
  "url": "https://wiki.archlinux.org/title/NTFS",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- File systems\n- NTFS-3G\n- Ufsd\n\nFrom Wikipedia:\n\nThe ntfs3 kernel driver provides read and write support for the file system.\n\nThere are no userspace utilities alongside the kernel driver. To format partitions or perform maintenance you still need a Windows machine or external tools like NTFS-3G.\n\n"
    },
    {
      "title": "Improving performance",
      "level": 3,
      "content": "You can enable the prealloc mount(8) option to decrease fragmentation in case of parallel write operations (most useful for HDD).\n\n"
    },
    {
      "title": "Prevent creation of names not allowed by Windows",
      "level": 3,
      "content": "NTFS itself does not have restrictions for characters and names used, but Windows does.\n\nSince the kernel version 6.2, ntfs3 supports windows_names mount(8) option. Use it to strictly maintain compatibility.\n\n"
    },
    {
      "title": "Explicit file system type required to mount",
      "level": 3,
      "content": "ntfs3 requires the file system type to mount.\n\nTo be able to mount the file system, specify its type as ntfs3. For example, using mount(8)'s -t/--types option:\n\n```\n# mount -t ntfs3 /dev/sdxY /mnt\n```\n\n"
    },
    {
      "title": "unknown filesystem type 'ntfs'",
      "level": 3,
      "content": "When mounting NTFS, you can encounter an error such as:\n\n```\nmount: /mnt: unknown filesystem type 'ntfs'\n```\n\nSee #Explicit file system type required to mount.\n\nIf you want to use ntfs3 as the default driver for ntfs partitions, such udev rule does the trick:\n\n```\n/etc/udev/rules.d/ntfs3_by_default.rules\n```\n\n```\nSUBSYSTEM==\"block\", ENV{ID_FS_TYPE}==\"ntfs\", ENV{ID_FS_TYPE}=\"ntfs3\"\n```\n\nAlthough, this method is not recommended and can confuse some 3rd party tools.\n\n"
    },
    {
      "title": "Unable to mount with ntfs3 with partition marked dirty",
      "level": 3,
      "content": "When trying to mount a good NTFS partition (i.e. which successfully mounts with NTFS-3G and for which ntfsfix --no-action does not report any error), you may get the following error:\n\n```\nmount: /mnt: wrong fs type, bad option, bad superblock on /dev/sdb1, missing codepage or helper program, or other error.\n       dmesg(1) may have more information after failed mount system call.\n```\n\nntfs3 will not mount a partition where the volume is marked dirty without the force option. dmesg explicitly helps recognizing the situation, saying:\n\n```\nsdb1: volume is dirty and \"force\" flag is not set!\n```\n\nYou can try passing the --clear-dirty argument to ntfsfix(8) to clean it. [1]\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- NTFS3 kernel documentation\n- NTFS3 Driver FAQ – Paragon Software Group\n- NTFS3 performance comparison\n\n"
    }
  ]
}