{
  "title": "NTFS (Русский)",
  "url": "https://wiki.archlinux.org/title/NTFS_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Файловые системы\n- NTFS-3G (Русский)\n\nВикипедия:\n\nВ ядре Linux есть драйвер ntfs3, реализующий возможность чтения и записи для этой файловой системы.\n\n- Все официальные ядра с версии 5.15 собираются с CONFIG_NTFS3_FS=m и таким образом имеют в своём составе этот драйвер. В Linux < 5.15 для работы с NTFS можно использовать NTFS-3G — файловую систему FUSE. Также есть бэкпорт ntfs3-dkmsAUR[ссылка недействительна: package not found].\n- Paragon — автор модуля ядра — ещё не выпустил пользовательские инструменты для работы с NTFS3.\n\n"
    },
    {
      "title": "Увеличение производительности",
      "level": 3,
      "content": "Можно использовать параметр монтирования prealloc для уменьшения фрагментации при параллельных операциях записи (полезно для HDD).\n\n"
    },
    {
      "title": "Запрет использования имён, не разрешённых в Windows",
      "level": 3,
      "content": "Сама NTFS не имеет ограничений на используемые символы и имена, но в Windows они есть.\n\nНачиная с версии ядра 6.2, ntfs3 поддерживает параметр монтирования windows_names. Используйте его для обеспечения совместимости с Windows.\n\n"
    },
    {
      "title": "Необходимо явно указывать тип файловой системы при монтировании",
      "level": 3,
      "content": "При монтировании всегда указывайте тип ntfs3:\n\n```\n# mount -t ntfs3 /dev/sdxY /mnt\n```\n\n"
    },
    {
      "title": "unknown filesystem type 'ntfs'",
      "level": 3,
      "content": "При монтировании NTFS вы можете получить такую ошибку:\n\n```\nmount: /mnt: unknown filesystem type 'ntfs'\n```\n\nСмотрите #Необходимо явно указывать тип файловой системы при монтировании.\n\nЕсли вы хотите, чтобы ntfs3 использовался по умолчанию для всех разделов ntfs, можно создать правило udev:\n\n```\n/etc/udev/rules.d/ntfs3_by_default.rules\n```\n\n```\nSUBSYSTEM==\"block\", ENV{ID_FS_TYPE}==\"ntfs\", ENV{ID_FS_TYPE}=\"ntfs3\"\n```\n\nОднако это не рекомендуется, так как может вызвать проблемы со сторонними инструментами.\n\n"
    },
    {
      "title": "Поддержка udisks",
      "level": 3,
      "content": "udisks поддерживает NTFS3, но на старых версиях udisks или ядра имелись некоторые проблемы. Смотрите ntfs3 PR и issue 932.\n\nПроблемы могут проявляться в виде следующих ошибок, когда NTFS-3G не установлен и udisks пытается использовать драйвер NTFS3 c параметрами монтирования, которые он не распознаёт:\n\n```\nntfs3: Unknown parameter 'windows_names'\n```\n\nили\n\n```\nFilesystem type ntfs3,ntfs not configured in kernel\n```\n\nВ качестве обходного пути добавьте следующую опцию в секции [defaults] в файле /etc/udisks2/mount_options.conf:\n\n```\nntfs_defaults=uid=$UID,gid=$GID,defaults,prealloc\n```\n\nСмотрите также: Cannot mount NTFS with the new ntfs3 module from Linux 5.15\n\n"
    },
    {
      "title": "Не удаётся примонтировать раздел, отмеченный как dirty, с помощью ntfs3",
      "level": 3,
      "content": "При попытке смонтировать хороший NTFS-раздел (то есть который успешно монтируется с помощью NTFS-3G и для которого ntfsfix --no-action не сообщает никаких ошибок), вы можете получить следующую ошибку:\n\n```\nmount: /mnt: wrong fs type, bad option, bad superblock on /dev/sdb1, missing codepage or helper program, or other error.\n       dmesg(1) may have more information after failed mount system call.\n```\n\nntfs3 не будет монтировать раздел, который отмечен как «грязный» (dirty), без опции force. dmesg помогает распознать эту ситуацию:\n\n```\nsdb1: volume is dirty and \"force\" flag is not set!\n```\n\nПопробуйте запустить ntfsfix с аргументом --clear-dirty для сброса этой отметки. [1]\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- NTFS3 — документация ядра\n- NTFS3 Driver FAQ – Paragon Software Group\n- Сравнение производительности NTFS3\n\n"
    }
  ]
}