{
  "title": "NTFS-3G (Русский)",
  "url": "https://wiki.archlinux.org/title/NTFS-3G_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Файловые системы\n- NTFS (Русский)\n\nNTFS-3G — свободная реализация файловой системы NTFS с поддержкой чтения и записи данных. Для упрощения разработки и обеспечения лучшей переносимости NTFS-3G использует драйвер файловой системы FUSE.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет ntfs-3g.\n\n"
    },
    {
      "title": "Ручное монтирование",
      "level": 2,
      "content": "Вручную примонтировать раздел с NTFS можно двумя способами. Традиционный:\n\n```\n# mount /dev/раздел-с-NTFS /точка/монтирования\n```\n\nПри этом тип файловой системы (в данном случае ntfs-3g) явно сообщать необязательно. По умолчанию команда mount будет использовать программу /usr/bin/mount.ntfs, которая является символической ссылкой на /usr/bin/ntfs-3g и появляется после установки пакета ntfs-3g.\n\nВторой способ — напрямую вызвать ntfs-3g:\n\n```\n# ntfs-3g /dev/раздел-с-NTFS /точка/монтирования\n```\n\nСписок доступных опций описан в ntfs-3g(8).\n\n"
    },
    {
      "title": "Форматирование",
      "level": 2,
      "content": "```\n# mkfs.ntfs -Q -L меткаДиска /dev/sdXY\n```\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Можно настроить автоматическое монтирование разделов NTFS или заранее указать параметры монтирования и выполнять его вручную в удобное для вас время. Настройки задаются в файле fstab или с помощью правил udev.\n\n"
    },
    {
      "title": "Настройки по умолчанию",
      "level": 3,
      "content": "При использовании стандартных настроек разделы с NTFS будут монтироваться при загрузке системы. При использовании этого метода если родительская папка, в которую монтируется раздел, имеет соответствующие права доступа (например, /run/media/<пользователь>/), то пользователь или группа смогут выполнять чтение и запись в этом разделе.\n\n```\n/etc/fstab\n```\n\n```\n# <file system>\t\t<dir>\t\t<type>\t<options>\t<dump>\t<pass>\n/dev/NTFS-part\t\t/mnt/windows\tntfs-3g\tdefaults\t0\t0\n```\n\n"
    },
    {
      "title": "Linux-совместимые права доступа",
      "level": 3,
      "content": "Как правило, права доступа в Linux устанавливаются как 755 для каталогов и 644 для файлов. Если вы постоянно используете NTFS-раздел, рекомендуется использовать эти права доступа и на нём. Следующий пример показывает, как можно присвоить такие права разделу для работы с ним из-под непривилегированного пользователя:\n\n```\n# Монтировать системный раздел Windows с Linux-совместимыми правами доступа,\n# то есть 755 для каталогов (dmask=022) и 644 для файлов (fmask=133)\n/dev/NTFS-раздел  /mnt/windows  ntfs-3g uid=userid,gid=groupid,dmask=022,fmask=133 0 0\n```\n\nЕсли права доступа Windows тоже имеют значение для вас, можно использовать команду ntfsusermap(8) для сопоставления пользователей Windows с пользователями Linux. ntfs-3g обработает перевод этих разрешений.\n\nNote: Для начала вам нужно знать SID нужного Windows-пользователя. Вы можете определить его либо с помощью мастера ntfsusermap, либо выполнив wmic useraccount get в Windows, чтобы получить точный список пользователей. Затем пересортируйте файл UserMapping таким образом, чтобы SID нужного Windows-пользователя находился над SID служебной учётной записи.\n\nДля начала вам нужно знать SID нужного Windows-пользователя. Вы можете определить его либо с помощью мастера ntfsusermap, либо выполнив wmic useraccount get в Windows, чтобы получить точный список пользователей. Затем пересортируйте файл UserMapping таким образом, чтобы SID нужного Windows-пользователя находился над SID служебной учётной записи.\n\n"
    },
    {
      "title": "Разрешение доступа пользователю/группе",
      "level": 3,
      "content": "Через файл /etc/fstab можно передать драйверу ntfs-3g и другие параметры монтирования, например разрешить доступ на чтение данных определённому пользователю или группе. Чтобы дать доступ к разделу пользователям, входящим в группу groupid (можно указать как id, так и имя группы), используйте следующие параметры:\n\n```\n/dev/NTFS-раздел  /mnt/windows  ntfs-3g   gid=groupid,umask=0022    0       0\n```\n\nВ этом случае запись данных на раздел будет возможна только для пользователя root. Чтобы разрешить запись непривилегированному пользователю, нужно указать, кому из них следует дать такой доступ. Для этого используйте параметр uid (в качестве значения можно указать как id, так и имя пользователя):\n\n```\n/dev/NTFS-раздел  /mnt/windows  ntfs-3g   uid=userid,gid=groupid,umask=0022    0       0\n```\n\nЕсли у вас однопользовательская система, для большего удобства можно дать себе полный доступ к разделу:\n\n```\n/dev/NTFS-раздел  /mnt/windows  ntfs-3g   uid=userid,gid=groupid    0       0\n```\n\n"
    },
    {
      "title": "Основные параметры NTFS-3G",
      "level": 3,
      "content": "В большинстве случаев для работы должно хватить параметров, описанных выше. Далее описываются параметры, общие для многих файловых систем Linux. Полный список доступных параметров можно посмотреть в ntfs-3g(8) § OPTIONS.\n\nСледующая опция специфична для ntfs-3g:\n\n"
    },
    {
      "title": "Монтирование разделов от имени обычного пользователя",
      "level": 3,
      "content": "По умолчанию ntfs-3g требует права суперпользователя для монтирования файловой системы, если он является блочным устройством, даже если добавить параметр user в /etc/fstab (с причинами можно ознакомиться в ntfs-3g-faq).\n\n- Пакет ntfs-3g не имеет встроенной поддержки FUSE. Пересоберите пакет с помощью ABS для включения поддержки FUSE. Полное объяснение заключается в том, что \"user\" и \"users\" работают через монтирование setuid, не сбрасывая привилегии setuid, чтобы блочное устройство можно было использовать без root. Однако в ntfs-3g есть жёстко закодированное ограничение, которое не позволяет использовать setuid, если используется внешняя libfuse. Нет никаких веских технических причин не разрешать setuid для внешнего FUSE, кроме недоверия к библиотеке. Этот патч устраняет указанное ограничение.\n- Похоже, есть проблема с правами на размонтирование, поэтому вам всё равно понадобятся права root для размонтирования. Вы также можете использовать fusermount -u /точка/монтирования для размонтирования файловой системы без прав root. Кроме того, если вы используете опцию users (множественное число) в /etc/fstab вместо опции user, вы сможете монтировать и размонтировать файловую систему с помощью команд mount и umount.\n\n- Полное объяснение заключается в том, что \"user\" и \"users\" работают через монтирование setuid, не сбрасывая привилегии setuid, чтобы блочное устройство можно было использовать без root. Однако в ntfs-3g есть жёстко закодированное ограничение, которое не позволяет использовать setuid, если используется внешняя libfuse.\n- Нет никаких веских технических причин не разрешать setuid для внешнего FUSE, кроме недоверия к библиотеке. Этот патч устраняет указанное ограничение.\n\nДля неблочных файлов, таких как обычные образы дисков, ntfs-3g в командной строке должен работать из коробки с правами обычного пользователя, поскольку базовые вызовы FUSE перенаправляются на setuid-root fusermount, когда прямое взаимодействие с ядром недоступно.\n\n"
    },
    {
      "title": "Изменение размера раздела NTFS",
      "level": 2,
      "content": "Некоторые пользователи с установленной системой Windows хотели бы оставить её при установке Arch Linux. Часто для того, чтобы освободить место на диске под установку Arch Linux, возникает необходимость изменить размер системного раздела, на котором установлена Windows. Эту задачу можно выполнить одним из двух способов:\n\n1. Воспользоваться встроенным в Windows средством управления разделами. Для его запуска нажмите Win+R, введите в появившееся окно diskmgmt.msc и нажмите Enter. Кликните по разделу, размер которого нужно уменьшить, правой кнопкой мыши, и выберите в меню пункт Сжать том. Укажите количество места, которое нужно освободить, и нажмите OK. После завершения операции за изменённым разделом появится свободное место, в котором можно будет создать необходимые разделы в процессе установки системы.\n1. Воспользоваться сторонним LiveCD. Для этого скачайте ISO-образ любого дистрибутива, в состав которого входят ntfs-3g и gparted, запишите его на компакт-диск (например, с помощью InfraRecorder) или USB-накопитель (смотрите статью Установочный образ на USB-накопителе), после чего загрузитесь с подготовленного носителя.\n\nЕсть много образов, подходящих для этой задачи. Этот список не является исчерпывающим, но с него можно начать:\n\n- GParted — Небольшой загрузочный дистрибутив GNU/Linux для компьютеров на базе x86. Он позволяет вам использовать все функции последних версий приложения GParted. Не включает дополнительные пакеты, которые может включать System Rescue CD, и схемы шифрования диска могут не поддерживаться.\n\n- Parted Magic — Очень хорошее комплексное решение для управления жёсткими дисками. С помощью редактора разделов вы можете изменять размер, копировать и перемещать разделы. Вы можете увеличить или уменьшить размер диска C:. Можно освободить место для новых операционных систем. Можно попытаться восстановить данные с потерянных разделов.\n\nОбратите внимание, что важными программами для изменения размера разделов NTFS являются ntfs-3g и инструменты типа (G)parted или fdisk, который входит в состав пакета util-linux. Если вы не являетесь «продвинутым» пользователем, рекомендуется использовать инструмент вроде GParted для выполнения любых операций по изменению размера разделов, чтобы минимизировать вероятность потери данных из-за ошибки пользователя.\n\nДля изменения размера NTFS-раздела из-под существующей системы Arch Linux установите пакеты ntfs-3g и gparted и запустите программу gparted. Если в системе отсутствует графический пользовательский интерфейс, можно использовать программу parted, входящую в состав пакета parted. Собственно изменение размера файловой системы выполняется программой ntfsresize(8).\n\n"
    },
    {
      "title": "Unsupported reparse point",
      "level": 3,
      "content": "При монтировании файловой системы NTFS в Windows 10 и чтении файлов или каталогов вы можете\n\n1. увидеть неработающие символические ссылки на 'unsupported reparse point' или\n1. увидеть сообщение об ошибке cannot access какой-то-файл: Input/output error (в этом случае вы увидите сообщение Could not load plugin /usr/lib64/ntfs-3g/ntfs-plugin-80000017.so: Success в журнале).\n\nПричиной этого являются NTFS reparse points, которые Microsoft использует для расширения файловой системы. NTFS-3G не поддерживает некоторые их типы по умолчанию. Можно использовать плагины NTFS-3G для обеспечения совместимости с некоторыми reparse points:\n\n- Сжатие системы (также известное как «Compact OS»): обеспечивает более сильное, оптимизированное для исполняемых файлов преобразование, чем старый LZ77 в NTFS. Плагин ntfs-3g-system-compression-gitAUR обеспечивает возможность только чтения, а если нужна запись, то отключите сжатие через Windows командой compact.exe /CompactOS:never.\n- Дедупликация файлов: это функция Windows Server 2012, обеспечивающая оффлайн-дедупликацию на уровне блоков. Ещё нет пакета в AUR.\n- Файлы OneDrive: Файлы OneDrive хранятся в Windows в виде специального тома. Плагин ntfs-3g-onedrive-binAUR предоставляет доступ на чтение и запись только для файлов, помеченных как «доступные локально».\n\nДополнительные сведения есть на этой странице, а ссылки на скачивание доступны в archive.org.\n\n"
    },
    {
      "title": "Повреждённая файловая система NTFS",
      "level": 3,
      "content": "Если в файловой системе NTFS есть ошибки, ntfs-3g смонтирует её в режиме только для чтения. Для штатного исправления файловой системы NTFS загрузите Windows и запустите chkdsk.\n\nМожно использовать команду ntfsfix, идущую в составе пакета ntfs-3g, однако она умеет исправлять только некоторые виды ошибок. Там, где она не справляется, chkdsk обычно отрабатывает успешно.\n\nДля исправления файловой системы NTFS раздел должен быть отмонтирован. Пример ремонта NTFS-раздела /dev/sda2:\n\n```\n# umount /dev/sda2\n# ntfsfix /dev/sda2\nMounting volume... OK\nProcessing of $MFT and $MFTMirr completed successfully.\nNTFS volume version is 3.1.\nNTFS partition /dev/sda2 was processed successfully.\n# mount /dev/sda2\n```\n\nЕсли всё прошло без ошибок, раздел будет доступен для записи.\n\n"
    },
    {
      "title": "Искажаются китайские имена файлов на Windows-разделе",
      "level": 3,
      "content": "Смотрите Кодировка#Неправильная кодировка при монтировании.\n\n"
    },
    {
      "title": "Metadata kept in Windows cache, refused to mount",
      "level": 3,
      "content": "Если вместе с Arch Linux на компьютере используется Windows 8 или новее, при монтировании системного раздела может возникнуть следующая ошибка:\n\n```\nThe disk contains an unclean file system (0, 0).\nMetadata kept in Windows cache, refused to mount.\nFailed to mount '/dev/sdc1': Operation not permitted\nThe NTFS partition is in an unsafe state. Please resume and shutdown\nWindows fully (no hibernation or fast restarting), or mount the volume\nread-only with the 'ro' mount option.\n```\n\nПроблема вызвана новой функцией Windows 8 под названием «быстрый запуск» («fast startup»). Когда эта функция включена, часть метаданных файловых систем всех используемых разделов при загрузке восстанавливается к тому состоянию, в котором они находились при завершении работы Windows. В результате изменения содержимого разделов, совершённые из Linux, могут быть утеряны. Это может произойти с любым разделом жёсткого диска, когда работа Windows завершается выбором пункта «Завершение работы» или «Гибернация». Однако завершение работы Windows с помощью пункта «Перезагрузка» не должно вызывать таких проблем.\n\nЧтобы получить возможность беспроблемно записывать данные на раздел из других операционных систем, убедитесь, что функция «быстрый запуск» отключена. Для этого загрузите Windows и выполните следующую команду в командной строке, запущенной от имени администратора:\n\n```\npowercfg /h off\n```\n\nЧтобы проверить текущее значение параметра, зайдите в Панель управления -> Оборудование и звук -> Электропитание -> Действия кнопок питания. Флажок Включить быстрый запуск должен быть снят либо отсутствовать.\n\n"
    },
    {
      "title": "Удаление метаданных спящего режима Windows",
      "level": 4,
      "content": "В качестве альтернативы вышеописанному методу чистого выключения существует способ полного уничтожения метаданных NTFS, сохранённых после спящего режима. Этот способ применим только в том случае, если вы не можете или не хотите загрузиться в Windows и полностью выключить её. Для этого нужно запустить ntfsfix, входящий в состав ntfs-3g.\n\n```\n# ntfsfix /dev/раздел_NTFS\n```\n\n"
    },
    {
      "title": "Отказ в монтировании",
      "level": 3,
      "content": "Если, даже следуя этому руководству, вам не удаётся примонтировать раздел NTFS, попробуйте отредактировать файл /etc/fstab, указав UUID вместо имён устройств для всех разделов NTFS. С примером можно ознакомиться в разделе fstab (Русский)#По UUID.\n\n"
    },
    {
      "title": "Отказ в монтировании в Windows",
      "level": 3,
      "content": "Windows не распознает раздел NTFS, для которого не задан соответствующий тип раздела. Частая ошибка при создании раздела NTFS для работы с Windows — забыть установить тип раздела как NTFS. Используйте fdisk или один из инструментов разметки, чтобы исправить тип раздела на правильный.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- ntfs-3g(8)\n\n"
    }
  ]
}