{
  "title": "Ntop (Español)",
  "url": "https://wiki.archlinux.org/title/Ntop_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2015-04-22** \n\nNtop es una herramienta de monitorización de tráfico de red basada en libcap, que ofrece estadísticas de red estilo RMON mediante a través del navegador de red.\n\n"
    },
    {
      "title": "Instalación y configuración",
      "level": 2,
      "content": "Instale ntopAUR desde los repositorios oficiales. En la primera ejecución de ntop, debe configurar la contraseña de administrador:\n\n```\n# ntop\n```\n\nSeguidamente, tiene que editar el archivo de configuración (/etc/conf.d/ntop) y adaptarlo a sus necesidades. A continuación tiene un ejemplo de archivo de configuración, enfocándose en el host para conseguir tanta información de las conexiones de hosts como sea posible:\n\n```\n/etc/conf.d/ntop\n```\n\n```\n# Parameters que se suministrarán a ntop.\nNTOP_ARGS=\"-K -W 2323 -i enp1s0,wlp2s0 -M -s -4 -6 -s -u ntop -c -r 30 --w3c -t 3 -a /var/log/ntop/http.log -O /var/log/ntop/ -q --skip-version-check 0\"\n\n# ubicación del archivo de log.\nNTOP_LOG=\"/var/log/ntop/ntop.log\"\n```\n\nInicie el servicio ntop de systemd y si desea iniciar ntop en el arranque, habilítelo.\n\n"
    },
    {
      "title": "Interfaz web",
      "level": 3,
      "content": "Para acceder a la interfaz web de ntop, Introduzca http://127.0.0.1:3000/ en su navegador. Para efectuar cambios en el servidor, tendrá que introducir su usuario (por defecto = admin) y su contraseña.\n\nSi usa ntop no solo en su máquina local, sino también con múltiples usuarios en la red, lo más indicado es que solo permita conexiones SSL (https).\n\n```\n# ntop -W 4223\n```\n\nSe permite el uso de parámetros adicionales. Vaya ahora a la siguiente dirección en el navegador https://127.0.0.1:4223/.\n\nTambién puede suministrar a ntop su propio certificado SSL. Tan solo debe colocarlo en el directorio de configuración de ntop y nombrarlo como ntop-cert.pem\n\n```\n# cd /etc/ntop/\n# openssl req -x509 -nodes -days 365 \n  \\-subj '/C=US/L=Portland/CN=swim' \n  \\-newkey rsa:1024 -keyout ntop-cert.pem -out ntop-cert.pem\n```\n\n"
    },
    {
      "title": "Usuario y grupo",
      "level": 3,
      "content": "Para que el parámetro -u funcione correctamente y para asegurar un poco más su instalación de ntop, debería crear un usuario y grupo dedicados.\n\n```\n# useradd -M -s /usr/bin/false ntop\n# passwd -l ntop\n```\n\n"
    },
    {
      "title": "**ERROR** RRD: Disabled - unable to create base directory (err 13, /var/lib/ntop/rrd)",
      "level": 3,
      "content": "El directorio /var/lib/ntop/rrd/ puede no existir. Créelo y asegúrese que pertence al usuario nobody.\n\n"
    },
    {
      "title": "Please enable make sure that the ntop html/ directory is properly installed",
      "level": 3,
      "content": "Si recibe este aviso mientras trata de acceder a la interfaz web, edite /etc/conf.d/ntop incluyendo su IP y reinicie el demonio. Por ejemplo:\n\n```\nNTOP_ARGS=\"-i enp1s0 -w 127.0.0.1:3000\"\n```\n\nEsta es la IP que usará para acceder a la interfaz web.\n\n"
    }
  ]
}