{
  "title": "NVIDIA Optimus (Русский)",
  "url": "https://wiki.archlinux.org/title/NVIDIA_Optimus_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Bumblebee (Русский)\n- Nouveau (Русский)\n- NVIDIA (Русский)\n- PRIME\n\nNVIDIA Optimus — технология, обеспечивающая совместную работу интегрированной графики и дискретной графики NVIDIA на ноутбуках.\n\n"
    },
    {
      "title": "Доступные методы",
      "level": 2,
      "content": "Есть несколько способов организовать работу интегрированной и дискретной графики:\n\n- #Использование только встроенной графики — позволяет сэкономить энергию за счёт полного отключения графики NVIDIA.\n- #Использование только графики NVIDIA — даёт более высокую производительность, но и быстрее расходует заряд батареи. Здесь используется тот же базовый процесс, что и в вариантах с optimus-manager и nvidia-xrun. Его следует использовать для решения проблем и проверки общей функциональности, прежде чем прибегать к одному из более автоматизированных подходов.\n- Использование и интегрированной, и дискретной графики (с отключением дискретной графики, когда она не используется): #Использование PRIME render offload — официальный метод NVIDIA для поддержки переключаемой графики. #Использование optimus-manager — переключает графику одной командой (для применения изменений нужно перезайти в систему). Также поддерживает гибридный режим с PRIME render offload. Позволяет получить максимальную производительность графики NVIDIA и отключает её, когда она не используется. С версии 1.4 также поддерживается комбинация AMD+NVIDIA. #Использование nvidia-xrun — запускает отдельную X-сессию на другом TTY с графикой NVIDIA. Позволяет получить максимальную производительность графики NVIDIA и отключает её, когда она не используется. #Использование Bumblebee — подобно Windows, позволяет запускать отдельные приложения на графике NVIDIA, используя интегрированную графику для всего остального. Однако реализация Bumblebee имеет проблемы с производительностью. #Использование switcheroo-control — похоже на Bumblebee, но для GNOME. Позволяет задать предпочтительную графику через ярлыки приложений, а также позволяет вручную запускать любое приложение на NVIDIA через меню правой кнопки мыши. #Использование nouveau — по сравнению с проприетарным драйвером NVIDIA хуже производительность и могут быть проблемы с ждущим режимом. #Использование EnvyControl — похоже на optimus-manager, но не требует обширной настройки или наличия демона, работающего в фоновом режиме, а также установки патченого GDM, если вы используете GNOME. #Использование NVidia-eXec — похоже на Bumblebee, но без проблем с производительностью. Работает как на Xorg, так и на Wayland. Этот пакет является экспериментальным и в настоящее время тестируется только под GNOME/GDM. #Использование nvidia-switch — похоже на nvidia-xrun, но не требует изменения TTY, переключения будут осуществляться при входе и выходе в экранном менеджере. Этот пакет тестируется в Debian, но, как и nvidia-xrun, он должен работать во всех Linux-системах.\n\n- #Использование PRIME render offload — официальный метод NVIDIA для поддержки переключаемой графики.\n- #Использование optimus-manager — переключает графику одной командой (для применения изменений нужно перезайти в систему). Также поддерживает гибридный режим с PRIME render offload. Позволяет получить максимальную производительность графики NVIDIA и отключает её, когда она не используется. С версии 1.4 также поддерживается комбинация AMD+NVIDIA.\n- #Использование nvidia-xrun — запускает отдельную X-сессию на другом TTY с графикой NVIDIA. Позволяет получить максимальную производительность графики NVIDIA и отключает её, когда она не используется.\n- #Использование Bumblebee — подобно Windows, позволяет запускать отдельные приложения на графике NVIDIA, используя интегрированную графику для всего остального. Однако реализация Bumblebee имеет проблемы с производительностью.\n- #Использование switcheroo-control — похоже на Bumblebee, но для GNOME. Позволяет задать предпочтительную графику через ярлыки приложений, а также позволяет вручную запускать любое приложение на NVIDIA через меню правой кнопки мыши.\n- #Использование nouveau — по сравнению с проприетарным драйвером NVIDIA хуже производительность и могут быть проблемы с ждущим режимом.\n- #Использование EnvyControl — похоже на optimus-manager, но не требует обширной настройки или наличия демона, работающего в фоновом режиме, а также установки патченого GDM, если вы используете GNOME.\n- #Использование NVidia-eXec — похоже на Bumblebee, но без проблем с производительностью. Работает как на Xorg, так и на Wayland. Этот пакет является экспериментальным и в настоящее время тестируется только под GNOME/GDM.\n- #Использование nvidia-switch — похоже на nvidia-xrun, но не требует изменения TTY, переключения будут осуществляться при входе и выходе в экранном менеджере. Этот пакет тестируется в Debian, но, как и nvidia-xrun, он должен работать во всех Linux-системах.\n\n"
    },
    {
      "title": "Использование только встроенной графики",
      "level": 2,
      "content": "Если вы хотите использовать только определённый GPU без переключения между ними, поищите соответствующую настройку в BIOS — там должна быть опция отключения одного из GPU. Некоторые ноутбуки позволяют отключить только дискретную графику или наоборот, но проверить всё равно стоит.\n\nЕсли BIOS не позволяет отключить графику NVIDIA, её можно отключить через Linux, как описано в разделе Гибридная графика#Полное отключение питания дискретного GPU.\n\n"
    },
    {
      "title": "Использование дискретной графики только для CUDA",
      "level": 3,
      "content": "Если вы хотите использовать графику NVIDIA для CUDA, но не для рендеринга, достаточно перед запуском CUDA-приложения убедиться, что дискретная графика NVIDIA включена. Подробнее в разделе Гибридная графика#Полное отключение питания дискретного GPU.\n\nПри запуске CUDA-приложения автоматически подгрузятся нужные модули ядра. Перед отключением дискретной графики модули nvidia нужно будет выгрузить:\n\n```\n# rmmod nvidia_uvm\n# rmmod nvidia\n```\n\n"
    },
    {
      "title": "Использование только графики NVIDIA",
      "level": 2,
      "content": "Проприетарный драйвер NVIDIA может быть настроен как «primary rendering provider». Он также имеет заметные проблемы с разрывом экрана, если не включить prime sync, включив NVIDIA (Русский)#DRM kernel mode setting, смотрите [1] для более подробной информации. Он позволяет использовать дискретную графику и имеет (по состоянию на январь 2017 года) заметное преимущество в производительности по сравнению с драйвером nouveau.\n\nСначала установите драйвер NVIDIA и xorg-xrandr. Затем настройте /etc/X11/xorg.conf.d/10-nvidia-drm-outputclass.conf, параметры которого будут объединены со стандартным /usr/share/X11/xorg.conf.d/10-nvidia-drm-outputclass.conf для обеспечения совместимости с этой установкой.\n\n```\n/etc/X11/xorg.conf.d/10-nvidia-drm-outputclass.conf\n```\n\n```\nSection \"OutputClass\"\n    Identifier \"intel\"\n    MatchDriver \"i915\"\n    Driver \"modesetting\"\nEndSection\n\nSection \"OutputClass\"\n    Identifier \"nvidia\"\n    MatchDriver \"nvidia-drm\"\n    Driver \"nvidia\"\n    Option \"AllowEmptyInitialConfiguration\"\n    Option \"PrimaryGPU\" \"yes\"\n    ModulePath \"/usr/lib/nvidia/xorg\"\n    ModulePath \"/usr/lib/xorg/modules\"\nEndSection\n```\n\nЗатем добавьте эти две строки в начале файла ~/.xinitrc:\n\n```\n~/.xinitrc\n```\n\n```\nxrandr --setprovideroutputsource modesetting NVIDIA-0\nxrandr --auto\n```\n\nПерезагрузитесь для загрузки драйверов, и после этого X должен успешно запуститься.\n\nЕсли DPI экрана неверный, добавьте также такую строку:\n\n```\nxrandr --dpi 96\n```\n\nЕсли при загрузке X появился черный экран, удостоверьтесь, что в файле ~/.xinitrc нет & перед xrandr. Если & есть, то видимо оконный менеджер запускается раньше, чем команда xrandr завершает выполнение, что и приводит к черному экрану.\n\n"
    },
    {
      "title": "Экранные менеджеры",
      "level": 3,
      "content": "Если вы используете экранный менеджер, то вместо ~/.xinitrc нужно создать или отредактировать тот скрипт настройки дисплея, который используется вашим экранным менеджером.\n\n"
    },
    {
      "title": "LightDM",
      "level": 4,
      "content": "Для LightDM:\n\n```\n/etc/lightdm/display_setup.sh\n```\n\n```\n#!/bin/sh\nxrandr --setprovideroutputsource modesetting NVIDIA-0\nxrandr --auto\n```\n\nСделайте скрипт исполняемым.\n\nТеперь настройте LightDM для запуска скрипта, отредактировав раздел [Seat:*] в /etc/lightdm/lightdm.conf:\n\n```\n/etc/lightdm/lightdm.conf\n```\n\n```\n[Seat:*]\ndisplay-setup-script=/etc/lightdm/display_setup.sh\n```\n\nПосле перезагрузки экранный менеджер должен успешно запуститься.\n\n"
    },
    {
      "title": "SDDM",
      "level": 4,
      "content": "Для SDDM (который используется по умолчанию для KDE):\n\n```\n/usr/share/sddm/scripts/Xsetup\n```\n\n```\nxrandr --setprovideroutputsource modesetting NVIDIA-0\nxrandr --auto\n```\n\n"
    },
    {
      "title": "GDM",
      "level": 4,
      "content": "Для GDM создайте два файла .desktop:\n\n```\n/usr/share/gdm/greeter/autostart/optimus.desktop\n/etc/xdg/autostart/optimus.desktop\n```\n\n```\n[Desktop Entry]\nType=Application\nName=Optimus\nExec=sh -c \"xrandr --setprovideroutputsource modesetting NVIDIA-0; xrandr --auto\"\nNoDisplay=true\nX-GNOME-Autostart-Phase=DisplayServer\n```\n\nУбедитесь, что GDM использует X в качестве бэкенда по умолчанию.\n\n"
    },
    {
      "title": "Проверка 3D",
      "level": 3,
      "content": "Чтобы проверить, что графика NVIDIA действительно используется, установите mesa-utils и запустите:\n\n```\n$ glxinfo | grep NVIDIA\n```\n\n"
    },
    {
      "title": "Дополнительная информация",
      "level": 3,
      "content": "Более подробная информация есть в официальной документации NVIDIA: [2].\n\n"
    },
    {
      "title": "Использование PRIME render offload",
      "level": 3,
      "content": "С выходом драйвера NVIDIA версии 435.17 появилась возможность использовать PRIME Render Offload. xf86-video-modesetting, xf86-video-amdgpu (450.57), и xf86-video-intel (455.38) официально поддерживаются как iGPU драйвера.\n\nЧтобы запустить программу на карточке от NVIDIA, вы можете использовать prime-run - скрипт из nvidia-prime:\n\n```\n$ prime-run glxinfo | grep \"OpenGL renderer\"\n$ prime-run vulkaninfo\n```\n\nПодробнее в разделе PRIME#PRIME render offload.\n\n"
    },
    {
      "title": "Использование nouveau",
      "level": 3,
      "content": "Смотрите статьи PRIME и Nouveau (Русский).\n\n"
    },
    {
      "title": "Использование Bumblebee",
      "level": 3,
      "content": "Смотрите статью Bumblebee (Русский).\n\n"
    },
    {
      "title": "Использование switcheroo-control",
      "level": 3,
      "content": "Смотрите раздел PRIME#GNOME integration.\n\n"
    },
    {
      "title": "Использование nvidia-xrun",
      "level": 3,
      "content": "Смотрите статью nvidia-xrun (Русский).\n\n"
    },
    {
      "title": "Использование optimus-manager",
      "level": 3,
      "content": "Смотрите официальную документацию Optimus-manager.\n\n"
    },
    {
      "title": "Использование EnvyControl",
      "level": 3,
      "content": "Смотрите официальную документацию EnvyControl.\n\n"
    },
    {
      "title": "Использование NVidia-eXec",
      "level": 3,
      "content": "Смотрите официальную документацию NVidia-eXec.\n\n"
    },
    {
      "title": "Использование nvidia-switch",
      "level": 3,
      "content": "Смотрите официальную документацию nvidia-switch.\n\n"
    },
    {
      "title": "Тиринг и неработающий VSync",
      "level": 3,
      "content": "Включите DRM kernel mode setting, который в свою очередь включит синхронизацию PRIME и исправит разрывы изображения.\n\nСм. также подробности в обсуждении на официальном форуме.\n\n"
    },
    {
      "title": "Failed to initialize the NVIDIA GPU at PCI:1:0:0 (GPU fallen off the bus / RmInitAdapter failed!)",
      "level": 3,
      "content": "Добавьте параметр ядра rcutree.gp_init_delay=1. [3] [4]\n\n"
    },
    {
      "title": "Неправильное разрешение экрана, ошибки EDID в Xorg.log",
      "level": 3,
      "content": "Эта ошибка возникает когда драйвер nvidia не определяет EDID для дисплея. Необходимо вручную указать путь к файлу EDID или предоставить ту же информацию подобным образом.\n\nДля предоставления пути к файлу EDID отредактируйте раздел \"Device\" для NVIDIA в Xorg.conf, добавив эти строки. Не забудьте изменить поля в соответствии с вашей системой:\n\n```\n/etc/X11/xorg.conf\n```\n\n```\nSection \"Device\"\n    Option \"ConnectedMonitor\" \"CRT-0\"\n    Option \"CustomEDID\" \"CRT-0:/sys/class/drm/card0-LVDS-1/edid\"\n    Option \"IgnoreEDID\" \"false\"\n    Option \"UseEDID\" \"true\"\nEndSection\n```\n\nЕсли Xorg не запускается попробуйте поменять ссылки CRT на DFB. card0 это идентификатор чипа Intel, который подключен к дисплею с помощью LVDS. Если расположение аппаратных средств отличается, значение пользовательского EDID может быть другим. Путь же будет начинаться с /sys/class/drm.\n\nТакже можно сгенерировать EDID с помощью инструментов вроде read-edid и настроить драйвер на использование сгенерированного файла. Можно использовать даже modelines, но тогда не забудьте изменить UseEDID и IgnoreEDID.\n\n"
    },
    {
      "title": "Неправильное разрешение без ошибок EDID",
      "level": 3,
      "content": "nvidia-xconfig мог сгенерировать неверные настройки в xorg.conf, в частности, неверную частоту обновления монитора, что ограничивает возможные разрешения. Попробуйте закомментировать строки HorizSync/VertRefresh. Если это поможет, то, вероятно, вы также можете удалить всё остальное не упомянутое в этой статье.\n\n"
    },
    {
      "title": "Проблема блокировки (lspci зависает)",
      "level": 3,
      "content": "Симптомы: lspci виснет, переход в ждущий режим виснет, выключение виснет, optirun виснет.\n\nСлучается на некоторых новых ноутбуках с GTX 965M или подобными, когда используется bbswitch (например, через Bumblebee) или nouveau.\n\nПри включении питания дискретной графики может произойти сбой и зависание в коде ACPI (kernel bug 156341).\n\nПри использовании nouveau отключение управления питанием позволяет избежать этой проблемы. Для отключения добавьте параметр ядра nouveau.runpm=0.\n\nОбходные пути для некоторых моделей описаны в issue 764 на GitHub. В других случаях вы можете попробовать загрузиться с параметром ядра acpi_osi=\"!Windows 2015\" или acpi_osi=! acpi_osi=\"Windows 2009\". (Возможно, стоит сообщить о вашей модели ноутбука в ранее упомянутом issue.)\n\n"
    },
    {
      "title": "No screens found",
      "level": 3,
      "content": "Проверьте вывод этой команды:\n\n```\n$ lspci | grep VGA\n```\n\n```\n00:02.0 VGA compatible controller: Intel Corporation Core Processor Integrated Graphics Controller (rev 02)\n01:00.0 VGA compatible controller: nVidia Corporation Device 0df4 (rev a1)\n```\n\nДрайверы NVIDIA поддерживают Optimus с версии 319.12 Beta [5] с ядрами 3.9 и новее.\n\nДругое решение — установить драйвер Intel для управления экранами, а графику NVIDIA использовать только для запуска 3D-программ через Bumblebee.\n\n"
    },
    {
      "title": "Случайные зависания \"(EE) NVIDIA(GPU-0): WAIT\"",
      "level": 3,
      "content": "При использовании проприетарных драйверов в системе с интегрированной графикой AMD и дискретной графикой NVIDIA в качестве единственной используемой пользователи сообщают о зависаниях до 10 секунд со следующими ошибками в журнале Xorg:\n\n```\n[   219.796] (EE) NVIDIA(GPU-0): WAIT (2, 8, 0x8000, 0x0002e1c4, 0x0002e1cc)\n[   226.796] (EE) NVIDIA(GPU-0): WAIT (1, 8, 0x8000, 0x0002e1c4, 0x0002e1cc)\n```\n\nТочная причина происходящего ещё не известна, но, похоже, она связана с конфликтом в том, как интегрированная и выделенная карты взаимодействуют с Xorg.\n\nОбходным решением является использование переключаемой графики — смотрите раздел PRIME#PRIME render offload.\n\n"
    },
    {
      "title": "\"No Devices detected\" при использовании optimus-manager",
      "level": 3,
      "content": "В некоторых случаях lspci отображает PCI domain в первой колонке вывода, из-за чего optimus-manager имеет проблемы с обработкой BusID.\n\nЕсли у вас чёрный экран и графический интерфейс не появляется или появляется частично или Xorg падает с ошибкой (EE) - No Devices detected, смотрите issue 471 на GitHub.\n\n"
    },
    {
      "title": "Xorg: изображение на внешнем мониторе обновляется только при перемещении мыши",
      "level": 3,
      "content": "Обходным решением является удаление драйвера Xorg для встроенной графики (например, xf86-video-amdgpu или xf86-video-intel) [6]. Это должно сработать, если порт внешнего монитора (HDMI/DP/USB-C) подключен напрямую к графике NVIDIA.\n\n"
    },
    {
      "title": "Низкое энергопотребление (TDP)",
      "level": 3,
      "content": "Начиная с версии драйвера 530.41 графика NVIDIA может оставаться на низком уровне энергопотребления (GitHub issue 483). В драйвере была отключена возможность ручной установки лимита энергопотребления с через nvidia-smi, из-за чего многие ноутбуки остаются с плохой производительностью.\n\nЧтобы обойти эту проблему (для поколения Ampere и новее), запустите/включите службу nvidia-powerd.service, которая включает DynamicBoost.\n\n"
    },
    {
      "title": "Графика NVIDIA не отключается или отключается ненадолго",
      "level": 3,
      "content": "Если вы используете мониторинг температуры, он скорее всего вызывает nvidia-smi для её получения, что приводит к пробуждению дискретной графики и повышению энергопотребления.\n\nПроверьте состояние графики:\n\n```\n$ cat /sys/bus/pci/devices/0000\\:01\\:00.0/power/runtime_status\n```\n\nЕсли состояние active, то перепроверьте, нет ли у вас запущенных инструментов мониторинга, использующих nvidia-smi.\n\n"
    }
  ]
}