{
  "title": "Nápověda:Vyhledávání",
  "url": "https://wiki.archlinux.org/title/N%C3%A1pov%C4%9Bda:Vyhled%C3%A1v%C3%A1n%C3%AD",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Související články\n\n- Nápověda:Čtení\n\nOficiální MediaWiki instance ArchWiki je dostupná online na https://wiki.archlinux.org pomocí libovolného webového prohlížeče.\n\nPoznamenejte, že některé překlady se nacházejí na jiných doménách; vizte Nápověda:i18n#Jazyky.\n\n"
    },
    {
      "title": "Vyhledávání",
      "level": 2,
      "content": "MediaWiki podporuje fulltextové vyhledávání; vizte vyhledávací lištu nahoře. Tento způsob je omezený skutečností, že se indexují pouze slova delší než tři písmena. Chcete-li vyhledávat kratší slova (s jedním až třemi písmeny), je možné omezení obejít využitím Googlovského sitesearch. Zadejte do vyhledávače položky a budete je vyhledávat na ArchWiki.\n\nSamozřejmě můžete docílit toho samého doplněním site:wiki.archlinux.org k vyhledávání Googlem:\n\n```\nco hledáte site:wiki.archlinux.org\n```\n\nNevýhoda je, že výsledky budou trochu zastaralé; Google indexuje ArchWiki jednou za den až tři dny.\n\n"
    },
    {
      "title": "DuckDuckGo \"Bangy\"",
      "level": 3,
      "content": "Též můžete použít DuckDuckGo \"bangy\" k přímému vyhledávání na Arch Wiki. Pokud jste si nastavili DuckDuckGo jako výchozí vyhledávač, můžete do URL lišty psát věci jako:\n\n```\n!archwiki co hledáte\n```\n\nnebo krátce\n\n```\n!aw co hledáte\n```\n\n"
    },
    {
      "title": "Vyhledávaní příbuzných článků",
      "level": 2,
      "content": "Každý článek na ArchWiki je zařazen do kategorie. Kategorie každé stránky jsou zobrazeny nahoře. Například tato stránka se nachází v kategorii Category:Help (Čeština). Můžete se podívat na hierarchii kategorií v Table of contents (Čeština).\n\nDodatečně mnoho článků odkazuje přímo na příbuzné články pomocí tabulky Související články.\n\n"
    },
    {
      "title": "Využívání wiki offline",
      "level": 2,
      "content": "- arch-wiki-docs — Stránky z ArchWiki přizpůsobené offline vyhledávání.\n\n- arch-wiki-lite — Arch-wiki-lite poskytuje nejplynulejší možný zážitek pro osobu bez přístupu k internetu nebo možnosti vůbec spustit grafický webový prohlížeč.\n\n- arch-wiki-man — ArchWiki jakožto man stránky.\n\n- wikiman — Offline vyhledávací nástroj pro návody, Arch Wiki, Gentoo Wiki a jiné zdroje dokumentace.\n\n"
    },
    {
      "title": "Alternativní online vyhledávače",
      "level": 2,
      "content": "- Wikicurses — Jednoduchý curses rozhraní pro MediaWiki stránky jako ArchWiki nebo Wikipedie.\n\n"
    }
  ]
}