{
  "title": "Obecná doporučení",
  "url": "https://wiki.archlinux.org/title/Obecn%C3%A1_doporu%C4%8Den%C3%AD",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Související články\n\n- Často kladené otázky\n- Instalační příručka\n- Seznam aplikací\n\nTato stránka je soupis často užívaných článků a důležitých ponaučení pro zlepšování a přidávaní vymožeností do Arch systému. Článek předpokládá, že si uživatelé přečetli instalační příručku a řídili se podle ní, aby si obstarali základní instalaci Arch GNU/Linuxu. Též se očekává, že si přečetli a pochopili pojmy ze článků #Správa systému a #Správa balíčků, neboť je to nezbytně důležité pro pochopení tohoto článku i jiných na této wiki.\n\n"
    },
    {
      "title": "Správa systému",
      "level": 2,
      "content": "Zde se budeme zabývat administrativními úkony a správou systému. Vizte Základní utility a :Kategorie:Správa systému pro více poznatků.\n\n"
    },
    {
      "title": "Uživatelé a skupiny",
      "level": 3,
      "content": "Nová instalace obsahuje pouze jeden superuživatelský účet, jenž je lépe znám jakožto \"root\". Dlouhodobé užívání root účtu, obzvlášť pokud jej využíváte skrz SSH na síti, je nebezpečné. Namísto toho byste si měli vytvořit a používat neoprávněné účty pro většinu záležitostí; root byste měli použít jenom pro správu systému. Vizte Uživatelé a skupiny#Správa uživatelů pro podrobnosti.\n\nUživatelé a skupiny jsou ústrojí pro řízení přístupu; administrátoři mohou důkladně nastavit skupiny či vlastníka a dávat či odebírat přístup uživatelů k systémovým službám nebo zdrojům. Přečtěte si Uživatelé a skupiny pro podrobnosti ohledně některých bezpečnostních rizik.\n\n"
    },
    {
      "title": "Bezpečnost",
      "level": 3,
      "content": "Přečtěte si Bezpečnost pro rady, jak řádně zabezpečit systém.\n\nPro seznam aplikací, jež jsou určeny pro povolování některých příkazů nebo interaktivního shellu jiným uživatelem (třeba rootem), vizte článek ohledně stupňování práv.\n\n"
    },
    {
      "title": "Spravování služeb",
      "level": 3,
      "content": "Arch GNU/Linux využívá systemd jako inicializační proces. Systemd spravuje systém i služby. Abyste se mohli starat o údržbu svého systému, doporučujeme se naučit s ním pracovat.\n\nDorozumění se systemd zařizuje příkaz systemctl. Vizte systemd#Základní užívání systemctl pro více znalostí.\n\nŽurnalový systém je též poskytnutý přes příkaz journalctl. Vizte žurnál pro další podrobnosti.\n\n"
    },
    {
      "title": "Údržba systému",
      "level": 3,
      "content": "Arch je rolling-release systém a často se mění balíčky, tudíž uživatelé si musí vyhradit čas pro správu systému.\n\n"
    },
    {
      "title": "Správa balíčků",
      "level": 2,
      "content": "Tato část obsahuje užitečné skutečnosti týkající se správy balíčků. Vizte Často kladené otázky: Správa balíčků a :Kategorie:Správa balíčků pro další články.\n\nNote: **před** \n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman je package manager (správce balíčků) Arch GNU/Linuxu: doporučujeme se s ním seznámit před čtením jiných článků.\n\nK povolení stahování balíčků souběžně, vizte pacman#Povolování souběžného stahování.\n\nVizte pacman/Tips and tricks|pacman/Tipy a triky]] pro rady, jak lépe zacházet s pacmanem a jak obecně spravovat balíčky.\n\n"
    },
    {
      "title": "Repozitáře",
      "level": 3,
      "content": "Vizte článek Oficiální repozitáře pro podrobnosti ohledně každého udržovaného repozitáře.\n\nPokud plánujete používat 32bitové aplikace, určitě budete chtít povolit multilib repozitář.\n\nČlánek Neoficiální uživatelské repozitáře vypisuje několik jiných nepodporovaných repozitářů.\n\nMěli byste zvážit instalaci služby pkgstats.\n\n"
    },
    {
      "title": "Zrcadla",
      "level": 3,
      "content": "Navštivte Zrcadla pro návod, jak využít nejrychlejších zrcadel oficiálních repozitářů. Jak je vysvětleno v článku, je dobrý nápad často kontrolovat stránku Stav zrcadel pro seznam zrcadel, která byla nedávno sladěna. Toto může být automatizované pomocí Reflectoru.\n\n"
    },
    {
      "title": "Arch Sestavovací Systém",
      "level": 3,
      "content": "Ports je systém původně využívaný BSD distribucemi skládající se ze sestavovacích skriptů, které se nachází v stromovém adresáři lokálního systému. Jednoduše řečeno každý port obsahuje skript v adresáři intuitivně pojmenovaném podle instalovatelné aplikace.\n\nArch Sestavovací Systém nabízí to samé poskytováním sestavovacích skriptů, jež jsou nazývané PKGBUILDy a jež jsou naplněny podrobnostmi pro daný software: integrity hashe, URL projektu, verze, license a sestavovací instrukce. Tyto PKGBUILDy jsou pak rozebrané makepkg, programem, jenž vytváří balíčky spravovatelné pacmanem.\n\nKaždý balíček v repozitářích (včetně těch z AUR) je možné ručně zkompilovat pomocí makepkg.\n\n"
    },
    {
      "title": "Arch Uživatelský Repozitář",
      "level": 3,
      "content": "Zatímco Arch Sestavovací Systém umožňuje kompilovat si software z oficiálních repozitářů ručně, Arch Uživatelský Repozitář je to samé pro balíčky uložené uživateli. Je to nepodporovaný repozitář sestavovacích skriptů dostupných skrz webové rozhraní nebo Aurweb RPC rozhraní.\n\n"
    },
    {
      "title": "Bootování",
      "level": 2,
      "content": "Zde se vyskytují podrobnosti ohledně spouštění počítače. Důkladná poučení naleznete v článku Arch bootovací postup nebo :Kategorie:Bootovací postup.\n\n"
    },
    {
      "title": "Samovolné rozpoznávání hardwaru",
      "level": 3,
      "content": "Hardware ve výchozím stavu by měl být rozeznán udevem při spouštění. Systém se bude zapínat podstatně rychleji po vypnutí mimovolného načítání modulů; pak ale musíte ručně určit, které moduly načíst (jak je popsáno v Kernelové moduly). Xorg by měl rozpoznat potřebné ovladače přes udev, ale též se nabízí možnost nastavit X server ručně.\n\n"
    },
    {
      "title": "Mikrokód",
      "level": 3,
      "content": "Procesory se mohou chovat vadně; kernel je dokáže spravit aktualizací mikrokódu při bootování. Vizte Mikrokód pro podrobnosti.\n\n"
    },
    {
      "title": "Uchovávání bootovacích zpráv",
      "level": 3,
      "content": "Jakmile se zobrazí přihlašovací pobídka, zprávy z bootování jsou odstraněny; uživatelé si je nemohou přečíst. Vypněte mazání bootovacích zpráv, přejete-li si je vidět.\n\n"
    },
    {
      "title": "Zapnutí Num Locku",
      "level": 3,
      "content": "Num Lock je přepínač na většině klávesnicí. Pro spuštění Num Locku po zapnutí, vizte Zapnutí numlocku při bootování.\n\n"
    },
    {
      "title": "Grafické uživatelské rozhraní",
      "level": 2,
      "content": "Tato část poskytuje návod pro uživatele, kteří chtějí spouštět aplikace s grafickým rozhraním. Vizte :Kategorie:Grafická uživatelská rozhraní pro dodatečná poučení.\n\n"
    },
    {
      "title": "Zobrazovací server",
      "level": 3,
      "content": "Xorg je veřejné svobodné provedení X Oknového Systému (často X11 nebo X). Je potřebný pro spouštění aplikací s grafickým uživatelským rozhraním. Většina uživatelů jej bude chtít nainstalovat.\n\nWayland je novější náhradní prokotol zobrazovacího serveru; Weston je příkladné provedení.\n\n"
    },
    {
      "title": "Zobrazovací ovladače",
      "level": 3,
      "content": "Základní nastavení zobrazovacích ovladačů bude vhodné pro většinu grafických karet, nicméně výkon se může zlepšit a nové vymoženosti mohou být dodány instalací vhodných ovladačů pro AMD a NVIDIA výrobky.\n\n"
    },
    {
      "title": "Plochová prostředí",
      "level": 3,
      "content": "Zatímco zobrazovací server poskytuje základní vývojové prostředí pro tvorbu grafických rozhraní, další součásti mohou být potřebné pro úplný uživatelský zážitek. Plochová prostředí jako KDE, GNOME, Xfce, Cinnamon či LXDE poskytují širokou škálu dobře integrovaných aplikací, například správce oken nebo kompozitor, aplikační lištu, správce souborů, terminálový emulátor, text editory, ikonky a jiné utility. Méně zkušení uživatelé ocení povědomé prostředí. Vizte :Kategorie:Plochová prostředí pro dodatečná ponaučení.\n\n"
    },
    {
      "title": "Správce oken a kompozitory",
      "level": 3,
      "content": "Plně vybavená plochová prostředí poskytují úplné a soudržné grafické uživatelské rozhraní, nicméně vyžadují mnoho systémových zdrojů. Uživatelé, pro něž je výkon důležitý, by mohli spíše upřednostňovat samotný správce oken nebo kompozitor a ručně vybírat dodatky. Pomocí Xorgu většina plochových prostředí umožňuje užití jiných správců oken. Dynamické, skládací i obkládací správce oken se liší v způsobu spravování oken.\n\n"
    },
    {
      "title": "Správce zobrazení",
      "level": 3,
      "content": "Většina plochových prostředí poskytuje správce zobrazení pro mimovolné spouštění grafického prostředí a spravování uživatelského přihlašování. Uživatelé bez plochového prostředí jej mohou nainstalovat zvlášť. Též můžete zapnout X hned po přihlášení místo užití správce zobrazení.\n\n"
    },
    {
      "title": "Uživatelské adresáře",
      "level": 3,
      "content": "Dobře známé adresáře jako \"Downloads\" (Stahování) či \"Music\" (Hudba) jsou stvořeny xdg-user-dirs-update.service uživatelskou službou, jíž nabízí xdg-user-dirs a je ve výchozím nastavení povolena. Pokud Vaše plochové prostředí nebo správce oken nevyužívají tento balíček, můžete jej nainstalovat a spustit xdg-user-dirs-update ručně (podle XDG uživatelské adresáře#Vytváření základních adresářů).\n\n"
    },
    {
      "title": "Řízení spotřeby",
      "level": 2,
      "content": "Tato část může být užitečná pro vlastníka laptopů nebo pro uživatele, pro něž je tato možnost podstatná. Vizte :Kategorie:Řízení spotřeby pro podrobnosti.\n\nVizte Řízení spotřeby pro obecný přehled.\n\n"
    },
    {
      "title": "ACPI události",
      "level": 3,
      "content": "Uživatelé si mohou určit, jak systém odpoví na ACPI události jako například zmáčknutí tlačítka napájení nebo uzavření notebookového víka. Pro novější (doporučenou) metodu skrz systemd, vizte Power management#ACPI events. Pro starý způsob vizte acpid.\n\n"
    },
    {
      "title": "CPU škálování frekvence",
      "level": 3,
      "content": "Novodobé procesory dokážou změnit svou frekvenci a volty, aby snížily svou teplotu a spotřebu energie. Díky menší teplotě je pak systém tišší a prodlouží životnost hardwaru. Vizte CPU škálování frekvence pro podrobnosti.\n\n"
    },
    {
      "title": "Laptopy",
      "level": 3,
      "content": "Pro články týkající se přenosných počítačů s instalačními příručky určenými pro daný model, vizte :Kategorie:Laptopy. Pro obecný přehled článků a doporučení týkajících se laptopů, vizte oddělení Laptopy.\n\n"
    },
    {
      "title": "Spánek a hibernace",
      "level": 3,
      "content": "Vizte hlavní článek: Řízení spotřeby/Spánek a hibernace.\n\n"
    },
    {
      "title": "Multimédia",
      "level": 2,
      "content": "Vizte :Kategorie:Multimédia pro dodatečné zdroje.\n\n"
    },
    {
      "title": "Zvukový systém",
      "level": 3,
      "content": "ALSA je kernelový zvukový systém, jenž by měl být provozuschopný ve výchozím stavu (pouze musí být povolen). Zvukové servery jako PipeWire nebo PulseAudio mohou poskytovat dodatečné možnosti a podporu pro složitější nastavení audia.\n\nVizte Profesionální audio pro pokročilé audio potřeby.\n\n"
    },
    {
      "title": "Sítě",
      "level": 2,
      "content": "Tato část se zabývá jednoduchou síťařinou. Vizte Nastavování sítě, chcete-li si přečíst úplnou příručku, nebo :Kategorie:Sítě pro podstatné články.\n\n"
    },
    {
      "title": "Sladění času",
      "level": 3,
      "content": "Network Time Protocol (NTP) je protokol pro sladění času počítačových systémů přes paketově-přepojovány datové sítě s náhodným opožděním. Vizte Sladění času pro provedení tohoto protokolu.\n\n"
    },
    {
      "title": "DNS bezpečnost",
      "level": 3,
      "content": "Pro lepší zapezpečení při prohlížení webu, hraní online, připojování se k SSH službám a podobné zvažte užívání DNSSEC-povoleného DNS resolveru, jenž dokáže potvrzovat podepsané DNS záznamy, a zašifrovaný protokol jako DNS přes TLS, DNS přes HTTPS nebo DNSCrypt. Vizte Domain name resolution pro podrobnosti.\n\n"
    },
    {
      "title": "Nastavování Firewallu",
      "level": 3,
      "content": "Firewall poskytuje dodatečnou vrstvu zabezpečení pro Linuxový síťový zásobník. Zatímco základní Arch kernel dokáže užít Netfilterovských iptables a nftables, ani jedny nejsou ve výchozím stavu povolené. Doporučujeme nastavit alespoň nějakou obdobu firewallu. Vizte :Kategorie:Firewally pro dostupné příručky.\n\n"
    },
    {
      "title": "Síťové sdílení",
      "level": 3,
      "content": "Ke sdílení souborů mezi počítači v síti, zkonzultujte NFS a SSHFS články.\n\nUžijte Samba k připojení na Windowsovou síť. K nastavení stroje pro ověřování pomocí Active Directory, přečtěte si Integrace Active Directory.\n\nVizte také :Kategorie:Síťové sdílení.\n\n"
    },
    {
      "title": "Vstupní zařízení",
      "level": 2,
      "content": "Tato část obsahuje populární rady pro vstupní zařízení. Vizte :Kategorie:Vstupní zařízení pro další podrobnosti.\n\n"
    },
    {
      "title": "Klávesnicová rozložení",
      "level": 3,
      "content": "Neanglická či nestandardní klávesnicová rozložení se nemusí chovat, jak by měla. Potřebné kroky k nastavení klávesnicového rozložení se liší mezi virtuální konzolí a Xorgem; jsou popsány v Konfigurace klávesnice v konzoli a Konfigurace klávesnice v Xorgu.\n\n"
    },
    {
      "title": "Tlačítka myši",
      "level": 3,
      "content": "Vlastnitelé složitějších nebo neobvyklých myší mohou shledat, že ne všechna tlačítka jsou rozeznána, nebo mohou chtít jim přiřadit jiné funkce. Návody na konfiguraci naleznete v Tlačítka myši.\n\n"
    },
    {
      "title": "Laptopové touchpady",
      "level": 3,
      "content": "Mnoho laptopů využívá Synaptics] nebo ALPS touchpad zařízení. Pro tato zařízení (i některá další) můžete využít Synaptics vstupový ovladač nebo libinput; vizte Touchpad Synaptics a libinput pro příručky k instalaci a podrobnosti nastavení.\n\n"
    },
    {
      "title": "TrackPoint",
      "level": 3,
      "content": "Vizte článek TrackPoint pro nastavení svého TrackPoint zařízení.\n\n"
    },
    {
      "title": "Optimalizace",
      "level": 2,
      "content": "Tento oddíl shrnuje užitečné úpravy, nástroje a možnosti pro zlepšení výkonu systému a aplikací.\n\n"
    },
    {
      "title": "Benchmarking",
      "level": 3,
      "content": "Při benchmarkingu standardizovaně měříme výkon a porovnáváme jej k výsledkům z jiných systémů nebo přijatým standardům.\n\n"
    },
    {
      "title": "Zlepšování výkonu",
      "level": 3,
      "content": "Článek Zlepšování výkonu je dobrý souhrn poznatků pro zlepšování výkonu Arch GNU/Linuxového zařízení.\n\n"
    },
    {
      "title": "Polovodičové disky",
      "level": 3,
      "content": "Polovodičové disky pokŕyvá mnohá hlediska polovodičových disků včetně nastavení pro maximalizaci životnosti disků.\n\n"
    },
    {
      "title": "Systémové služby",
      "level": 2,
      "content": "Tato část popisuje daemony.\n\n"
    },
    {
      "title": "Indexování souborů a vyhledávání",
      "level": 3,
      "content": "Většina distribucí poskytuje locate příkaz k rychlému vyhledávání souborů. Arch GNU/Linux nabízí několik alternativ, vizte locate pro podrobnosti.\n\nPlochové vyhledávací enginy poskytují podobnou službu s lepší integrací do plochových prostředí.\n\n"
    },
    {
      "title": "Lokální doručování mailů",
      "level": 3,
      "content": "Základní nastavení neposkytuje způsob, jak sladit mail. Seznam agentů pro doručování klientů je dostupný v Mail server článku.\n\n"
    },
    {
      "title": "Tisk",
      "level": 3,
      "content": "CUPS je standardní svobodný systém pro tisk vyvíjen OpenPrintingem pro Linux. Vizte :Kategorie:Tisk pro články ohledně tisku.\n\n"
    },
    {
      "title": "Vzhled",
      "level": 2,
      "content": "Tato část obsahuje změny pro nádherný vzhled. Vizte kategorii :Kategorie:Eye Candy pro více.\n\n"
    },
    {
      "title": "Fonty",
      "level": 3,
      "content": "Pokud budete chtít TrueType fonty, jelikož pouze neškálovatelné bitmapové fonty jsou dostupné po základní instalaci Arch systému. Existují obecné rodiny fontů, jež pokrývají většinu Unicode včetně metrické kompatibility s fonty z jiných operačních systémů.\n\nNaleznete mnoho informací ohledně fontů v článcích Fonty a Konfigurace Fontů.\n\nPokud trávíte mnoho času pracováním přes konzoly (například mimo X server), vyplatí se Vám změnit font pro čitelnost; vizte Linux konzole#Fonty.\n\n"
    },
    {
      "title": "GTK a Qt vzhledy",
      "level": 3,
      "content": "Velká součást aplikací grafického uživatelského rozhraní Linuxových systémů je založena na GTK a Qt vývojovích prostředích. Vizte články týkající se soudržného vzhledu Qt a GTK aplikací pro nápady jak zlepšit vzhled nainstalovaných aplikací.\n\n"
    },
    {
      "title": "Konzolová vylepšení",
      "level": 2,
      "content": "Tato část aplikuje malé změny, jež zlepšují praktičnost mnoho konzolových programů. Vizte :Kategorie:Příkazové řádky pro podrobnosti.\n\n"
    },
    {
      "title": "Doplňování tabulátorem",
      "level": 3,
      "content": "Doporučujeme řádně nastavit doplňování tabulátorem co nejdříve podle příručky pro Vámi vybraný shell.\n\n"
    },
    {
      "title": "Aliasy",
      "level": 3,
      "content": "Aliasy Vám mohou pomoci ušetřit čas, užíváte-li příkazovou řádku částo; je to obzvlášť nápomocné pro opakované úlohy, které se příliš neliší v podrobnostech. Časté užitečné aliasy můžete nalézt v Bash#Aliasy; jsou také přenosné na zsh.\n\n"
    },
    {
      "title": "Alternativní shelly",
      "level": 3,
      "content": "Bash je výchozí shell na Arch systému. Živé instalační médium nicméně využívá zsh s grml-zsh-config dodatkovým balíčkem. Vizte Příkazová řádka#Seznam shellů pro souhrn možností.\n\n"
    },
    {
      "title": "Bash dodatky",
      "level": 3,
      "content": "Seznam užitečných Bash nastavení, maker pro vyhledávání history a Readline je dostupný na Bash#Tipy a triky.\n\n"
    },
    {
      "title": "Vybarvené výstupy",
      "level": 3,
      "content": "Tuto již pokrývá Barevné výstupy v příkazové řádce.\n\n"
    },
    {
      "title": "Kompresované soubory",
      "level": 3,
      "content": "S kompresovanými soubory nebo archívy se budete setkávat často na GNU/Linux systému. Tar je jeden z nejpoužívanějších archivačních nástrojů a uživatelé by měli být obeznámeni s jeho syntaxem (třeba Arch Linux balíčky jsou pouze zstd kompresované tarbally). Vizte Archivace a komprese.\n\n"
    },
    {
      "title": "Konzolová pobídka",
      "level": 3,
      "content": "Konzolová pobídka (PS1) může být libovolně upravena podle potřeb. Vizte Bash/Nastavení pobídky nebo Zsh#Pobídky pokud používáte Bash či Zsh.\n\n"
    },
    {
      "title": "Emacs shell",
      "level": 3,
      "content": "Emacs je znám svými vymoženostmi, jež nemají vůbec nic společného s jednoduchou textovou manipulací. Jedna z takových vymožeností je úplná náhrada shellu. Zkonzultujte Emacs#Problémy s barevným výstupem pro opravu znetvořených písmen, které se mohou objevit po povolení barevného výstupu.\n\n"
    },
    {
      "title": "Podpora pro myš",
      "level": 3,
      "content": "Někteří mohou upřednosťovat používání myši s konzolí pro kopírování/vkládání textu namísto tradičního kopírovacího režimu z GNU Screenu. Zkonzultujte článek \"General purpose mouse\" pro důkladný návod. Poznamenejte, že toto již můžete dělat v terminálových emulátorech se schránkou.\n\n"
    },
    {
      "title": "Správa relací",
      "level": 3,
      "content": "Užitím terminálových multiplexerů jako tmux či GNU Screen můžete spouštět programy pod relacemi tvořené panely, s nimiž můžete libovolně zacházet, tudíž vypne-li uživatel terminálový emulátor, ukončí X nebo se odhlásí, programy z dané relace mohou pokračovat v pozadí, dokud terminálový multiplexer je zapnutý. Nicméně zacházení s programy vyžaduje se znovu připojit k relaci.\n\n"
    }
  ]
}