{
  "title": "Oblogout (Русский)",
  "url": "https://wiki.archlinux.org/title/Oblogout_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Openbox (Русский)\n- Оконный менеджер\n\nOblogout — это необязательный настраиваемый скрипт для выхода из системы, который представляет графический интерфейс (кнопки) для выключения, перезагрузки и блокировки системы.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет oblogout-py3-gitAUR.\n\nХотя Oblogout можно использовать со многими оконными менеджерами, данная статья фокусируется на оконном менеджере Openbox. Он может быть запущен с помощью сочетания клавиш или через пункт меню.\n\n"
    },
    {
      "title": "Сочетание клавиш",
      "level": 2,
      "content": "Чтобы запустить скрипт по нажатию сочетания клавиш (например, Super+x), измените файл ~/.config/openbox/rc.xml, в раздел <keyboard> добавив следующее:\n\n```\n<keybind key=\"W-x\">\n <action name=\"Execute\">\n  <startupnotify>\n   <enabled>true</enabled>\n  </startupnotify>\n  <command>oblogout</command>\n </action>\n</keybind>\n```\n\n"
    },
    {
      "title": "Блокировка экрана",
      "level": 2,
      "content": "Может понадобиться изменить опцию lock = в секции [commands] файле /etc/oblogout.conf, чтобы использовался правильный инструмент блокировки экрана.\n\nНапример, если вы используете XScreenSaver (для которого должен быть настроен автозапуск в файле ~/.config/openbox/autostart), то файл /etc/oblogout.conf нужно изменить примерно так:\n\n```\nlock = xscreensaver-command --lock\n```\n\nВ другом случае — например, при использовании пакета xlockmore — команда может выглядеть так:\n\n```\nlock = xlock -mode blank\n```\n\n"
    },
    {
      "title": "Тема кнопок",
      "level": 2,
      "content": "По умолчанию кнопки используют тему oxygen. Доступны и другие темы, в том числе предустановленная foom. Для изменения темы отредактируйте опцию buttontheme = в секции [looks] файле /etc/oblogout.conf. Пример выбора темы foom:\n\n```\nbuttontheme = foom\n```\n\n"
    },
    {
      "title": "Отображение кнопок",
      "level": 2,
      "content": "Доступные стандартные кнопки — cancel, logout, restart, shutdown, suspend, hibernate и lock. Для каждой кнопки можно назначить сочетание клавиш (например, после запуска oblogout можно выключить систему нажатием клавиши s).\n\nВидимость и порядок кнопок можно настроить. Для этого измените опцию buttons = в секции [looks] файле /etc/oblogout.conf. Следующий пример удаляет кнопки ждущего и спящего режимов:\n\n```\nbuttons = cancel, logout, lock, restart, shutdown\n#buttons = cancel, logout, restart, shutdown, suspend, hibernate, lock\n```\n\nПосле удаления кнопок также стоит отключить соответствующие сочетания клавиш в секции [shortcuts], так как они продолжат работать даже после скрытия кнопок. Следующий пример отключает сочетания клавиш ждущего и спящего режимов путём комментирования соответствующих строк:\n\n```\n[shortcuts]\ncancel = Escape\nshutdown = S\nrestart = R\n#suspend = U\nlogout = L\nlock = K\n#hibernate = H\n```\n\n"
    },
    {
      "title": "Несколько мониторов",
      "level": 2,
      "content": "При использовании нескольких мониторов oblogout может занимать все мониторы. Если вы хотите, чтобы oblogout отображался только на одном мониторе, вы можете создать правило для приложения в файле Openbox rc.xml, чтобы установить положение и размер oblogout.\n\nНапример, если у вас два монитора и вы хотите, чтобы oblogout отображался только на первом мониторе, добавьте это в раздел applications в файле rc.xml:\n\n```\n~/.config/openbox/rc.xml\n```\n\n```\n<applications>\n  <application class=\"oblogout\">\n    <position force=\"yes\">\n      <monitor>1</monitor>\n    </position>\n    <fullscreen>yes</fullscreen>\n  </application>\n  ...\n</applications>\n```\n\n"
    }
  ]
}