{
  "title": "One Time PassWord (Čeština)",
  "url": "https://wiki.archlinux.org/title/One_Time_PassWord_(%C4%8Ce%C5%A1tina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Související články\n\n- Secure Shell\n- Pam abl\n- Google Authenticator\n\nNote: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nOne Time PassWord (OTPW) je PAM modul, který zprostředkuje použití hesel \"na jedno použití\" k přihlášení do systému. Tohle se hodí zejména v kontextu Secure shell, a to umožnění přihlášení z veřejných nebo sdílených počítačů, za pomoci jednorázových hesel, které nebudou nikdy fungovat znova.\n\nInstrukce pro instalaci OTPW a konfiguraci SSH používat OTPW k přihlášení jsou níže.\n\n"
    },
    {
      "title": "Instalace",
      "level": 2,
      "content": "Instalujte otpwAUR balíček z AUR.\n\n"
    },
    {
      "title": "PAM Konfigurace",
      "level": 3,
      "content": "Vytvořte PAM konfigurační soubor pro otpw:\n\n```\n/etc/pam.d/ssh-otpw\n```\n\n```\nauth sufficient pam_otpw.so\nsession optional pam_otpw.so\n```\n\nDále upravte PAM kofigurační soubor pro ssh aby zahrnul otpw. Pokud chcete zakázat statické heslo zakomentujte druhý tučný řádek.Zde je upravená verze /etc/pam.d/sshd jako vzor:\n\n```\n/etc/pam.d/sshd\n```\n\n```\n#%PAM-1.0\n#auth     required  pam_securetty.so     #zakázat vzdálený root\n\nauth      include   ssh-otpw\n#auth      include   system-remote-login #POZNÁMKA:Toto musí být zneplatněno pro zakázání přihlášní heslem.\naccount   include   system-remote-login\npassword  include   system-remote-login\nsession   include   system-remote-login\n```\n\n"
    },
    {
      "title": "Konfigurace sshd",
      "level": 3,
      "content": "OTPW používá interaktivní přihlášení pro SHH připojení, které je povoleno přidáním těchto řádek do /etc/ssh/sshd_config:\n\n```\nUsePAM yes\nUsePrivilegeSeparation yes\nChallengeResponseAuthentication yes\n```\n\nChcete-li povolit také přihlašování statickými hesly, zajistěte, aby {{ic|/etc/ssh/sshd_config} obsahoval následující řádek:\n\n```\nPasswordAuthentication yes\n```\n\nV opačném případě jej nastavte na no. Viz výše uvedené informace o úpravě souboru /etc/pam.d/sshd, abyste úplně deaktivovali autorizaci statickým heslem, neboť PAM jinak povolí statické heslo, pokud OTPW selže (např. Když uživatel vyčerpá hesla).\n\nPokud povolíte ověření pomocí hesla, pak po selhání jedné metody ověření se klienti ssh vrátí zpět do druhé. Všimněte si, že ve výchozím nastavení ssh umožňuje tři pokusy o heslo na přihlašovací metodu.\n\n"
    },
    {
      "title": "Konfigurace OTPW",
      "level": 3,
      "content": "OTPW je nakonfigurován nezávisle pro každý uživatelský účet. Pokud daný účet nemá OTPW nakonfigurován, bude tento účet jednoduše používat statické heslo jako obvykle. Chcete-li nakonfigurovat protokol OTPW pro účet, spusťte jej jako:\n\n```\n$ otpw-gen > ~/otpw_passwords\n```\n\notpw-gen požádá o předponu hesla, která musí být zadána na začátku všech otpw hesel. Tímto způsobem zajistíte, že pokud někdo jiný dostane váš seznam OTPW, nemůže ho použít k přihlášení k vašemu účtu, dokud nebude vědět i vaší předponu.\n\nPo spuštění výše uvedeného příkazu by měl být v domovském adresáři uživatele soubor otpw_passwords, který obsahuje všechna uživatelská hesla OTPW. Bude také obsahovat soubor ~/.otpw, který obsahuje hashe hesel. otpw_passwords lze při přihlášení tisknout a odkazovat.\n\n"
    },
    {
      "title": "Použití",
      "level": 2,
      "content": "Po dokončení výše uvedené konfigurace by měl ssh automaticky používat OTPW pro uživatele, kteří jej nakonfigurovali. Příkaz k přihlášení OTPW vypadá takto:\n\n```\nPassword 041:\n```\n\nChcete-li se přihlásit, jednoduše vyhledejte heslo 41 v seznamu {{Ic|otpw_passwords}, například:\n\n```\n041 lYr0 g7QR\n```\n\nA zadejte předponu, po které následují obě poloviny hesla. Mezery jsou zde pro čitelnost a mohou nebo nemusí být zahrnuty do zadaného hesla. Nezadávejte mezeru mezi předčíslí a heslo.\n\nChcete-li zadat klientovi ssh, který způsob přihlášení chcete použít, přidejte -o PreferredAuthentication=keyboard-interactive pro použití OTPW nebo -o PreferredAuthentication=password statického hesla. Tyto volby mohou být také uvedeny v ~/.ssh/config per-server.\n\n"
    }
  ]
}