{
  "title": "OpenPGP (Italiano)",
  "url": "https://wiki.archlinux.org/title/OpenPGP_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articoli correlati\n\n- OpenPGP-card-tools\n- GnuPG\n- Smartcards\n\nOpenPGP è uno standard aperto per operazioni criptografiche. Si tratta di un sistema basato su principi conosciuti della criptografia. OpenPGP rende possibile lo scambio di file e messaggi fra un mittende ed un destinatario, con la convalida della loro identità.\n\n"
    },
    {
      "title": "Applicazioni",
      "level": 3,
      "content": "Vi è una serie di applicazioni di posta elettronica che offrono funzionalità OpenPGP, per esempio Thunderbird.\n\nProgrammi generici da terminale per operazioni OpenPGP includono gnugp[broken link: package not found] e sequoia-sq.\n\n"
    },
    {
      "title": "Librerie",
      "level": 3,
      "content": "Vi è un numero di librerie per diversi linguaggi di programmazione.\n\n"
    },
    {
      "title": "Sicurezza hardware",
      "level": 2,
      "content": "Le chiavi private OpenPGP possono essere gestite su hardware specializzato.\n\nL' OpenPGP card standard definisce un'applicazione per questo scopo. Questo standard è implementato in molti dispositivi, inclusi quasi tutti i modelli Nitrokey e YubiKey.\n\nGli utenti possono usare queste smartcards con programmi tipo GnuPG o OpenPGP-card-tools.\n\n"
    },
    {
      "title": "Standardizzazione",
      "level": 2,
      "content": "La standardizzazione di OpenPGP avviene all'interno del gruppo OpenPGP IETF.\n\nLo standard IETF ratificato più recentemente è RFC4880. Questo standard definisce formati \"OpenPGP versione 4\".\n\nRFC6637 definisce un'estensione per la criptografia di curve elliptiche (ECC).\n\nVi è un'estensione popolare basata su di Curve 25519, definita in RFC4880bis, non ancora finalizzata come parte dello standard.\n\nIl lavoro iniziato in RFC4880bis viene continuato, con una specificazione aggiornata in sviluppo, denominata crypto refresh (vedere Charter 02 del gruppo OpenPGP IETF per dettagli). Il nuovo standard definisce nuovi formati per chiavi e firme \"OpenPGP versione 6\" e permette crittaggio moderno basato su AEAD\n\nIl lavoro ancora da compiere si centrerà su aree ad esempio crittaggio post-quantum (PQC) e forward secrecy (vedi Charter 04 del gruppo OpenPGP IETF per dettagli).\n\n"
    },
    {
      "title": "Link esterni",
      "level": 2,
      "content": "- https://www.openpgp.org/\n- https://openpgp.dev/book/\n- https://gnupg.org/ftp/specs/OpenPGP-smart-card-application-3.4.1.pdf\n- https://tests.sequoia-pgp.org/\n\n"
    }
  ]
}