{
  "title": "OpenOffice (Ελληνικά)",
  "url": "https://wiki.archlinux.org/title/OpenOffice_(%CE%95%CE%BB%CE%BB%CE%B7%CE%BD%CE%B9%CE%BA%CE%AC)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From Why Apache OpenOffice:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the openoffice-binAUR package or compile it from source. It is recommended to also install Java.\n\n"
    },
    {
      "title": "Microsoft fonts",
      "level": 3,
      "content": "Official Microsoft fonts are useful to prevent pagination problems. Check the Microsoft fonts wiki page.\n\n"
    },
    {
      "title": "Extension management and spell checking",
      "level": 3,
      "content": "The Arch package is now shipped with some dictionaries. Check Extension manager if your language is already there simply by loading up any OpenOffice program (Writer for example) and access the Extension Manager from the Tools menu. From there enter the following location to install a spell check dictionary:\n\n```\n/usr/lib/openoffice/share/extension/install/\n```\n\nAlternatively, there are several ways to accomplish this:\n\n- Use the Extension manager from OpenOffice menu for download and installation - installs only for the user into their ~/.openoffice.org/3/user/uno_packages/cache\n- Download the extension and install it using /usr/lib/openoffice/program/unopkg add extension for the user\n- Download the extension and install it using /usr/lib/openoffice/program/unopkg add --shared extension for every user on the system (requires root permission)\n\n"
    },
    {
      "title": "Spellchecker",
      "level": 4,
      "content": "For spellchecking you will need hunspell and dictionary for hunspell (like hunspell-en_us, hunspell-de, etc), for hyphenation rules you will need hyphen (hyphen-en, hyphen-de, etc) and for a thesaurus, libmythes.\n\n"
    },
    {
      "title": "Other extensions installed by default",
      "level": 4,
      "content": "- pdfimport.oxt - Ability to import PDF files in Draw and Impress\n- presenter-screen.oxt - When using two displays this plugin provides more control over slideshow\n- sun-presentation-minimizer.oxt - Reduce file size of current presentation\n- wiki-publisher.oxt - Allows to create Wiki articles on MediaWiki servers without having to know the syntax of the MediaWiki markup language\n\n"
    },
    {
      "title": "Installing macros",
      "level": 3,
      "content": "In most Linux distributions, the default path for macros is:\n\n```\n~/.openoffice.org/3/user/Scripts/\n```\n\nThe path for this directory in Arch Linux is:\n\n```\n~/.config/.openoffice.org/3/user/Scripts/\n```\n\nMacros are not guaranted to work in both OpenOffice and LibreOffice, but it is possible to choose a common directory for them. Choose the path in Tools > Options > LibreOffice/OpenOffice > Paths The default path for LibreOffice macros in Arch Linux is:\n\n```\n~/.config/libreoffice/4/user/Scripts/\n```\n\n"
    },
    {
      "title": "Install TrueType fonts",
      "level": 3,
      "content": "To add fonts to those already available in OpenOffice, run spadmin.\n\n"
    },
    {
      "title": "Theme",
      "level": 2,
      "content": "OpenOffice supports to use several toolkits for drawing and integrates into different desktop environments in a clean way. To choose by hand, you need to set the OOO_FORCE_DESKTOP environment variable. Its possible values are gnome and kde4.\n\nTo configure the look for anytime OpenOffice gets started, you can export the OOO_FORCE_DESKTOP variable in /etc/profile.d/openoffice.sh, or in /usr/bin/soffice. Alternatively you can put the variable in any OpenOffice desktop file in Exec line between Exec and the command, then copy them to $XDG_DATA_HOME/applications in order to prevent overwriting on update.\n\n"
    },
    {
      "title": "KDE4/Qt4 look and feel",
      "level": 3,
      "content": "Check Uniform look for Qt and GTK applications for a broad application, general tips and other methods to achieve it.\n\n"
    },
    {
      "title": "Use different configuration from general theme",
      "level": 4,
      "content": "Do not select Use my KDE style in GTK applications. Instead choose a native syle and font for GTK 2 applications.\n\nUse a program like gtk-chtheme to select a style (in general different from KDE) and a font (may be the same as your KDE general system font). There are also other GTK engine packages available.\n\nThere are two relevant parts of the OpenOffice options dialog, View and Fonts:\n\n- View Set scale to 100% Set use system font OFF (otherwise replacement table will not be used) Set antialiasing OFF\n\n- Set scale to 100%\n- Set use system font OFF (otherwise replacement table will not be used)\n- Set antialiasing OFF\n\n- Fonts Select Use replacement table Replace Andale Sans UI (you must type this in -- it is not in the drop down list) with another font (your KDE system font or another if this looks bad) Press the tick symbol to update the list Select Always and Screen only Press OK\n\n- Select Use replacement table\n- Replace Andale Sans UI (you must type this in -- it is not in the drop down list) with another font (your KDE system font or another if this looks bad)\n- Press the tick symbol to update the list\n- Select Always and Screen only\n- Press OK\n\nWhen choosing fonts for OpenOffice note that the poor font rendering engine included in the package may not render a particular font in the same way as other applications on the desktop.\n\n"
    },
    {
      "title": "Speed up OpenOffice",
      "level": 2,
      "content": "Some settings may improve OpenOffice's loading time and responsiveness. However, some also increase RAM usage, so use them carefully. They can all be accessed under Tools > Options.\n\n- Under Memory: Reduce the number of Undo > Number of steps to a figure lower than 100, to something like 40 or 50 steps Under Graphics cache, set Use for OpenOffice to 128 MB (up from the original 20MB). Set Memory per object to 20MB (up from the default 5MB) If you use OpenOffice often, check OpenOffice Quickstarter\n- Under Java, uncheck Use a Java runtime environment\n\n- Reduce the number of Undo > Number of steps to a figure lower than 100, to something like 40 or 50 steps\n- Under Graphics cache, set Use for OpenOffice to 128 MB (up from the original 20MB).\n- Set Memory per object to 20MB (up from the default 5MB)\n- If you use OpenOffice often, check OpenOffice Quickstarter\n\n"
    },
    {
      "title": "Font substitution",
      "level": 3,
      "content": "These settings can be changed in the OpenOffice options. From the drop-down menu, select Tools > Options > OpenOffice > Fonts. Check the box that says Apply Replacement Table. Type Andale Sans UI in the font box and choose your desired font for the Replace with option. When done, click the checkmark. Then choose the Always and Screen only options in the box below. Click OK. You will then need to go to Tools > Options > OpenOffice > View, and uncheck Use system font for user interface. If you use a non-antialised font, such as Arial, you will also need to uncheck Screen font antialiasing before menu fonts render correctly.\n\n"
    },
    {
      "title": "Anti-aliasing",
      "level": 3,
      "content": "Execute:\n\n```\n$ echo \"Xft.lcdfilter: lcddefault\" | xrdb -merge\n```\n\nTo make the change persistent, add Xft.lcdfilter: lcddefault to your ~/.Xresources file[1].\n\nIf this does not work, make sure you are running $ xrdb -merge ~/.Xresources every time you launch Xorg. If you do not have this file, you will have to create it.\n\n"
    },
    {
      "title": "Spell checking problems",
      "level": 3,
      "content": "As of OpenOffice 3.0.0-2, various dictionaries may be buggy due to a character encoding problem. To solve this issue, follow the following instructions.\n\nFind where the particular openoffice distribution places its dictionary files; e.g., pacman -Ql openoffice-base. Most distibutions follow the convention of installing these to /usr/lib/openoffice/share/extension/install. Once the directory has been found, assign it to a shell variable:\n\n```\ndroot=\"/usr/lib/openoffice/share/extension/install\"\n```\n\nInstall unzip and zip packages in order to be able to extract and compress the dictionary files.\n\nFor reference, get a list of languages whose dictionary files are packaged with the base distribution:\n\n```\ncd \"$droot\" && ls | sed -rn 's,^dict-(..)\\.oxt$,\\1,p'\n```\n\nDefine a list of languages whose dictionary files are to be fixed:\n\n```\nlang=\"en es\"\n```\n\nExtract the target languages' dictionary files and convert the erroneous encoding to UTF-8:\n\n```\ntmp=\"/tmp/dictfix-$USER-$$\"\n\nmkdir \"$tmp\"\ncd \"$tmp\"\n\nfor i in $lang; do\n    i=\"$droot/dict-$i.oxt\"\n    unzip \"$i\" -d oxt.tmp\n    iconv -f ISO-8859-15 -t UTF-8 oxt.tmp/dictionaries.xcu > dict.tmp\n    mv dict.tmp oxt.tmp/dictionaries.xcu\n    (cd oxt.tmp && zip -r \"$i\" .)\ndone\n\nrm -rf \"$tmp\"\n```\n\nFinally, use the OpenOffice extension manager (available through the Tools menu) to install the dictionary from the resulting dict-xx.oxt file(s).\n\n"
    },
    {
      "title": "Dark GTK themes, icons and GTK-Qt Engine",
      "level": 3,
      "content": "Older OpenOffice/LibreOffice versions would start in High Contrast Mode if you use dark GTK themes. This might prevent you from changing High Contrast Icons or Calc cell background coloring is completely disabled.\n\nIn newer version of OpenOffice / LibreOffice ( > 3.2.x), possible solutions may be:\n\n- You could manually configure UI colors via Tools > Options > Appearance, yet Impress and Calc may stay dark.\n- Another solution is to disable Automatically detect high-contrast mode of operation system in LibreOffice > Accessibility (> LO 4.1.x).\n\nNow the colors can be configured in Options > Appearance and the selection of another iconset is possible again.\n\n"
    },
    {
      "title": "Hanging when using NFSv3 shares",
      "level": 3,
      "content": "If OpenOffice hangs when trying to open/save a document located on a NFSv3 share, try prepending the following lines with a # in /usr/lib/openoffice/program/soffice.:\n\n```\nSAL_ENABLE_FILE_LOCKING=1\nexport SAL_ENABLE_FILE_LOCKING\n```\n\nIf you wish to avoid /usr/lib/openoffice/program/soffice overwriting on update just copy it in /usr/local/bin. Original post here.\n\n"
    },
    {
      "title": "Fixing Java framework error",
      "level": 3,
      "content": "You may get the following error when you try to run OpenOffice:\n\n```\n[Java framework] Error in function createSettingsDocument (elements.cxx).\njavaldx failed!\n```\n\nIf so, give yourself ownership of ~/.config/ like so:\n\n```\n# chown -vR username:users ~/.config\n```\n\nPost on Arch Linux Forums.\n\n"
    },
    {
      "title": "OpenOffice does not detect my certificates",
      "level": 3,
      "content": "If you cannot see the certificates when trying to sign a document, you will need to have the certificates configured in Firefox (or Thunderbird). If after that OpenOffice still does not show them, set the MOZILLA_CERTIFICATE_FOLDER environment variable pointing to your Firefox (or Thunderbird) folder.\n\n```\nexport MOZILLA_CERTIFICATE_FOLDER=$HOME/.mozilla/firefox/XXXXXX.default/\n```\n\nSee more about certificate detection.\n\n"
    }
  ]
}