{
  "title": "Open Sound System (简体中文)",
  "url": "https://wiki.archlinux.org/title/Open_Sound_System_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Sound system\n\nThe Open Sound System (OSS) is an alternative sound architecture for Unix-like and POSIX-compatible systems. OSS version 3 was the original sound system for Linux, but was superseded by the Advanced Linux Sound Architecture (ALSA) in 2002 when OSS version 4 became proprietary software. OSSv4 became free software again in 2007 when 4Front Technologies released its source code and provided it under the GPL license.\n\n"
    },
    {
      "title": "Comparison with ALSA",
      "level": 2,
      "content": "Some advantages and disadvantages compared to using the Advanced Linux Sound Architecture.\n\n"
    },
    {
      "title": "OSS advantages for users",
      "level": 3,
      "content": "- Native per-application volume control without requiring a sound server atop it.\n- Some legacy (i.e. before 2002) cards can have better support.\n\n"
    },
    {
      "title": "OSS advantages for developers",
      "level": 3,
      "content": "- Support for drivers in userspace.\n- Cross-platform (OSS runs on BSDs and Solaris).\n- Smaller and easier to use API.\n\n"
    },
    {
      "title": "ALSA advantages over OSS",
      "level": 3,
      "content": "- Better support for USB audio devices.\n- Support for Bluetooth audio devices.\n- Support for AC'97 and HD Audio dial-up soft-modems such as Si3055.\n- Better support for MIDI devices.\n- Support for suspend.\n- Better support for jack detection.\n- Better support for modern hardware.\n\n- OSS has experimental output support for USB audio devices, but no input.\n- OSS supports MIDI devices with the help of a software synthesizer such as Timidity or FluidSynth.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the ossAUR package or the package with non-free drivers oss-nonfreeAUR. There is also a development version of OSS available with the oss-gitAUR package.\n\nThis will install the OSS, run the OSS install script (temporarily disabling the ALSA modules) and install the OSS kernel modules. Since ALSA is enabled by default, you need to disable it so it does not conflict with OSS. You can do this by blacklisting the soundcore module.\n\nAfter blacklisting the module, you can enable oss.service to start at boot.\n\nTo start using OSS without needing to reboot, check if any ALSA modules are still loaded (ALSA modules start with \"snd\"):\n\n```\n# lsmod | grep snd\n```\n\nRemove the ALSA modules as follows:\n\n```\n# lsmod | awk ' { print $1 } ' | grep snd | xargs rmmod\n```\n\nThen restart OSS:\n\n```\n# soundoff && soundon\n```\n\nTo completely remove ALSA from your system, you can compile a custom kernel and disable ALSA in its configuration. See Gentoo:ALSA#Kernel for the details.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nIn case you are not part of the audio group, add yourself and relogin for the changes to take effect:\n\n```\n# gpasswd -a $USER audio\n```\n\nIn case OSS is not able to detect your card when starting it, run:\n\n```\n# ossdetect -v\n# soundoff && soundon\n```\n\n"
    },
    {
      "title": "Testing",
      "level": 2,
      "content": "Test OSS by running:\n\n```\n$ osstest\n```\n\nYou should be able to hear music during the test process. If there is no audio, try to adjust the volume or refer to the #Troubleshooting section.\n\nIf you want to hear sounds from more than one application simultaneously, you need vmix, OSS's software mixer.\n\nCheck that vmix is enabled by running:\n\n```\n$ ossmix -a | grep -i vmix\n```\n\nYou should see a line like vmix0-enable ON|OFF (currently ON). If you do not see any lines beginning with vmix, it probably means that vmix has not been attached to your sound device. To attach vmix, issue the command:\n\n```\n$ vmixctl attach device\n```\n\nwhere device is your sound device, e.g. /dev/oss/oss_envy240/pcm0.\n\nTo avoid having to issue this command manually in the future, you can add it to /usr/lib/oss/soundon.user, as suggested by the official documentation.\n\nIf you get a \"Device or resource busy\" error, you need to add vmix_no_autoattach=1 to /usr/lib/oss/conf/osscore.conf and then reboot.\n\nSee which devices are detected by running:\n\n```\n$ ossinfo\n```\n\nYou should be able to see your devices listed under Device Objects or Audio Devices. If the device that you want to use is not at the top of one of these sections, you have to edit /usr/lib/oss/etc/installed_drivers and place the driver for your device at the very top. It may be required to restart OSS:\n\n```\n# soundoff && soundon\n```\n\nIf this does not work, comment all drivers listed except the ones for your device.\n\n"
    },
    {
      "title": "Volume control mixer",
      "level": 2,
      "content": "To control the volume of various devices, mixers levels will need to be set. There are two mixers:\n\n"
    },
    {
      "title": "Color definitions",
      "level": 3,
      "content": "For high definition (HD) audio, ossxmix will color jack configurations by their pre-defined jack colors:\n\nTable content:\nColor | Type | Connector\ngreen | front channels (stereo output) | 3.5mm TRS\nblack | rear channels (stereo output) | 3.5mm TRS\ngrey | side channels (stereo output) | 3.5mm TRS\ngold | center and subwoofer (dual output) | 3.5mm TRS\nblue | line level (stereo input) | 3.5mm TRS\npink | microphone (mono input) | 3.5mm TS\n\n"
    },
    {
      "title": "Saving mixer levels",
      "level": 3,
      "content": "Mixer levels are saved when you shut off your computer. If you want to save the mixer level immediately, execute as root:\n\n```\n# savemixer\n```\n\nsavemixer can be used to write mixer levels to a file with the -f switch and restore by the -L switch.\n\n"
    },
    {
      "title": "Other mixers",
      "level": 3,
      "content": "Other mixers that have support for OSS:\n\n- Gnome Volume Control — for GNOME.\n\n- Kmix — for KDE.\n\n"
    },
    {
      "title": "GStreamer-based",
      "level": 3,
      "content": "If you have problems with applications that use GStreamer for audio, you can try removing pulseaudio and installing the gst-plugins-good package which is needed by oss4sink and oss4src.\n\n"
    },
    {
      "title": "OpenAL-based",
      "level": 3,
      "content": "By default OpenAL uses ALSA. To change this, simply define the usage of OSS in /etc/openal/alsound.conf:\n\n```\n/etc/openal/alsound.conf\n```\n\n```\ndrivers=oss\n```\n\n"
    },
    {
      "title": "Audacity",
      "level": 3,
      "content": "If Audacity starts, but it complains that it cannot open the device or simply does not play anything, then you may be using vmix which prevents Audacity from having exclusive access to your sound device. To fix this, before running Audacity, run:\n\n```\n$ ossmix vmix0-enable OFF\n```\n\nYou can restore vmix after closing Audacity with:\n\n```\n$ ossmix vmix0-enable ON\n```\n\n"
    },
    {
      "title": "Gajim",
      "level": 3,
      "content": "By default, Gajim uses aplay -q to play a sound. For OSS you can change it to the equivalent ossplay -qq by going to Edit > Preferences > Advanced, opening the Advanced Configuration Editor and modifying the soundplayer variable accordingly.\n\n"
    },
    {
      "title": "MOC",
      "level": 3,
      "content": "To use MOC with OSS v4.1 you must change OSSMixerDevice to /dev/ossmix in your configuration file (located in ~/.moc). For issues with the interface try changing the OSSMixerChannel by pressing w in mocp (to change to the sofware mixer).\n\n"
    },
    {
      "title": "MPD",
      "level": 3,
      "content": "MPD is configured through /etc/mpd.conf or ~/.mpdconf. Check both of these files, looking for something that looks like:\n\n```\n/etc/mpd.conf\n```\n\n```\n...\naudio_output {\n    type    \"alsa\"\n    name    \"Some Device Name\"\n}\n...\n```\n\nIf you find an uncommented (the lines do not begin with #'s) ALSA configuration like the one above, comment all of it out, or delete it, and add the following:\n\n```\n/etc/mpd.conf\n```\n\n```\n...\naudio_output {\n    type    \"oss\"\n    name    \"My OSS Device\"\n}\n...\n```\n\nFurther configuration might not be necessary for all users. However, if you experience issues (in that MPD does not work properly after it has been restarted), or if you like having specific (i.e. more user-configured, less auto-configured) configuration files, the audio output for OSS can be more specifically configured by finding the card identifier:\n\n```\n$ ossinfo | grep /dev/dsp\n```\n\nLook for the line that says something similar to /dev/dsp -> /dev/oss/CARD_IDENTIFIER/pcm0. Take note of what your CARD_IDENTIFIER is, and add these lines to your OSS audio_output in your MPD configuration file:\n\n```\n/etc/mpd.conf\n```\n\n```\n...\naudio_output {\n    type            \"oss\"\n    name            \"My OSS Device\"\n    device          \"/dev/oss/<SOME_CARD_IDENTIFIER>/pcm0\"\n    mixer_device    \"/dev/oss/<SOME_CARD_IDENTIFIER>/mix0\"\n}\n...\n```\n\nSee also: Music Player Daemon#System-wide configuration.\n\n"
    },
    {
      "title": "MPlayer",
      "level": 3,
      "content": "If you are using a GUI (SMplayer, GNOME MPlayer, etc.) you can select OSS as the default output in the settings dialogs. If you use MPlayer from the command-line, you should specify the sound output:\n\n```\n$ mplayer -ao oss /some/file/to/play.mkv\n```\n\nIf you do not want to bother typing it over and over again add ao=oss to your configuration file (at ~/.mplayer/config).\n\nSee also: MPlayer#Configuration.\n\n"
    },
    {
      "title": "VLC media player",
      "level": 3,
      "content": "You can select OSS as the default output in the audio settings.\n\n"
    },
    {
      "title": "Wine",
      "level": 3,
      "content": "To set OSS support in Wine start:\n\n```\n$ winecfg\n```\n\nand go to the Audio tab and select the OSS Driver.\n\nSee also: Wine#Sound.\n\n"
    },
    {
      "title": "Other applications",
      "level": 3,
      "content": "- If you can not get sound from an application not listed here, try looking at the Configuring Applications for OSSv4 page.\n- Search for OSS specific packages with pacman or by looking in the AUR.\n\nSee also: ossapps.\n\n"
    },
    {
      "title": "More convenient and precise volume control",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with #Keyboard volume control.** This article or section is a candidate for merging with #Keyboard volume control.\n\nThis article or section is a candidate for merging with #Keyboard volume control.\n\nThe volume lever of ossxmix is very small, making it difficult to finely control the volume.\n\nRun ossmix to find the control you want to control (refer to ossxmix), this example is codec1.jack.green.front.\n\nBind the following commands to the keyboard shortcuts of the desktop environment.\n\nIncrease the volume by 1 (the volume can be between 0 and 100):\n\n```\n$ ossmix codec1.jack.green.front +1\n```\n\nDecrease the volume by 1 (The -- is needed on some systems so that the -1 will not be mistaken for a parameter.):\n\n```\n$ ossmix -- codec1.jack.green.front -1\n```\n\nThen you can easily control the volume.\n\n"
    },
    {
      "title": "Keyboard volume control",
      "level": 3,
      "content": "An easy way to mute/unmute and increase/decrease the volume is to use the ossvol script.\n\nDownload the script and place it at /usr/bin/ossvol.\n\nOnce you installed it, type:\n\n```\n$ ossvol -t\n```\n\nto toggle mute, or:\n\n```\n$ ossvol -h\n```\n\nto see the available commands.\n\nNote: **Bad mixer control name(987) 'vol'** \n\nIf you want to use multimedia keys with ossvol, map the following commands to your volume keys: XF86AudioRaiseVolume, XF86AudioLowerVolume and XF86AudioMute:\n\nTo mute/unmute the volume:\n\n```\n$ ossvol -t\n```\n\nTo lower the volume:\n\n```\n$ ossvol -d 2\n```\n\nTo raise the volume:\n\n```\n$ ossvol -i 2\n```\n\n"
    },
    {
      "title": "Changing the sample rate",
      "level": 3,
      "content": "Changing the output sample rate is not obvious at first. Sample rates can only be changed by root and vmix must be unused by any programs when a change is requested. Before you follow any of these steps, ensure you are going through a receiver/amplifier and using quality speakers and not simply computer speakers. If you are only using computer speakers, do not bother changing anything here as you will not notice a difference.\n\nBy default the sample rate is 48000hz. There are several conditions in which you may want to change this. This all depends on your usage patterns. You want the sample rate you are using to match the media you use the most. If your computer has to change the sampling rate of the media to suit the hardware it is likely, though not guaranteed, that you will have a loss in audio quality. This is most noticeable in down sampling (ie. 96000hz → 48000hz). There is an article about this issue in Stereophile which was discussed on Apple's CoreAudio API mailing list if you wish to learn more about this issue.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nSome example sample rates:\n\nTo check what your sample rate is currently set to, run:\n\n```\n$ ossmix | grep rate\n```\n\nYou are likely to see vmix0-rate <decimal value> (currently 48000) (Read-only).\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nIf you do not see a vmix0-rate (or vmix1-rate, etc.) being outputted, then it probably means that vmix is disabled. In that case, OSS will use the rate requested by the program which uses the device, so this section does not apply. Exception to this are Envy24 (and Envy24HT) cards that have a special setting envy24.rate which has a similar function (see the oss_envy24 manpage).\n\nTo change your sample rate:\n\n1. First, make sure your card is able to use the new rate. Run ossinfo -v2 and see if the wanted rate is in the Native sample rates output.\n1. As root, run /usr/lib/oss/scripts/killprocs.sh. Be aware, this will close any program that currently has an open sound channel.\n1. After all programs occupying vmix are terminated, run as root: vmixctl rate /dev/dsp 96000 replacing the rate with your desired sample rate (and ossmix envy24.rate 96000 if applicable).\n1. Run ossmix | grep rate and check for vmix0-rate <decimal value> (currently 96000) (Read-only) to see if you were successful.\n1. To make the changes permanent add the following to the soundon.user file:\n\n```\n/usr/lib/oss/soundon.user\n```\n\n```\n#!/bin/sh\n\nvmixctl rate /dev/dsp 96000\n# ossmix envy24.rate 96000 # uncomment if you have an Envy24(HT) card\n\nexit 0\n```\n\nand make it executable.\n\n"
    },
    {
      "title": "Disable virtual mixing and COOKEDMODE to reduce distortion",
      "level": 3,
      "content": "vmix is a virtual mixer audio that mixes multiple audio streams but can reduce the sound quality. Simply unchecking vmix-things in OSS Mixer GUI does not always work.\n\nTurn off COOKEDMODE to disable format conversions for all applications and devices.\n\nEdit the following:\n\n```\n/usr/lib/oss/conf/osscore.conf\n```\n\n```\ncooked_enable=0\nvmix_disabled=1\n```\n\nRestart oss.service or your computer ifyou encounter errors.\n\nAfter that you can still control the volume via ossmix or ossxmix.\n\n"
    },
    {
      "title": "KDE",
      "level": 4,
      "content": "Create an application launcher file named ossxmix.desktop in you local application launchers directory (~/.local/share/applications/ with:\n\n```\n~/.local/share/applications/ossxmix.desktop\n```\n\n```\n[Desktop Entry]\nName=Open Sound System Mixer\nGenericName=Audio Mixer\nExec=ossxmix -b\nIcon=audio-card\nCategories=Application;GTK;AudioVideo;Player;\nTerminal=false\nType=Application\nEncoding=UTF-8\n```\n\nTo have it autostart with your system, add it to the list in System Settings > System Administration > Startup and Shutdown > Autostart.\n\n"
    },
    {
      "title": "GNOME",
      "level": 4,
      "content": "As root create a file /usr/local/bin/ossxmix_bg with the following content:\n\n```\n/usr/local/bin/ossxmix_bg\n```\n\n```\n#!/bin/sh\n\nexec /usr/bin/ossxmix -b\n```\n\nThen go to System > Preferences > Start Up Applications and:\n\n- Click Add, type OSSMIX in the Name field and /usr/local/bin/ossxmix_bg in Command field then click Add Button.\n- Login and logout to see the changes.\n\n"
    },
    {
      "title": "Record sound output from a program",
      "level": 3,
      "content": "See upstream article on Recording sound output of a program.\n\n"
    },
    {
      "title": "Suspend and hibernation",
      "level": 3,
      "content": "OSS does not automatically support suspend, it must be manually stopped prior to suspending or hibernating and restarted afterwards.\n\nOSS provides soundon and soundoff to enable and disable OSS, although they only stop OSS if all processes that use sound are terminated first.\n\nThe following script is a rather basic method of automatically unloading OSS prior to suspending and reloading afterwards.\n\n```\n/usr/lib/systemd/system-sleep/50osssound.sh\n```\n\n```\n#!/bin/sh\nsuspend_osssound()\n{\n    /usr/lib/oss/scripts/killprocs.sh\n    /usr/bin/soundoff\n}\n \nresume_osssound()\n{\n    /usr/bin/soundon\n}\n \ncase $1 in\n    pre)\n        suspend_osssound\n \t;;\n    post)\n \tresume_osssound\n \t;;\n    *) exit $NA\n \t;;\nesac\n```\n\nSave the contents of this script (as root) into /usr/lib/systemd/system-sleep/50osssound.sh and make it executable.\n\nWith this, all your applications should be fine.\n\n"
    },
    {
      "title": "Changing the default sound output",
      "level": 3,
      "content": "When running osstest, the first test passes for the first channel, but not for the stereo or right channel, it sounds distorted/hisses. If this is what your sound is like, then it is set to the wrong output.\n\n```\n*** Scanning sound adapter #-1 ***\n/dev/oss/oss_hdaudio0/pcm0 (audio engine 0): HD Audio play front\n- Performing audio playback test... \n<left> OK <right> OK <stereo> OK <measured srate 47991.00 Hz (-0.02%)>\n```\n\nThe left sounded good, the right and stereo were the distorted ones.\n\nLet the test continue until you get a working output:\n\n```\n/dev/oss/oss_hdaudio0/spdout0 (audio engine 5): HD Audio play spdif-out \n- Performing audio playback test... \n<left> OK <right> OK <stereo> OK <measured srate 47991.00 Hz (-0.02%)>\n```\n\nIf this passed the test on all left, right and stereo, proceed to next step.\n\nFor the command to change the default output see upstream's wiki article. Change it to what works for you, for example:\n\n```\n# ln -sf /dev/oss/oss_hdaudio0/spdout0 /dev/dsp_multich\n```\n\nFor surround sound (4.0-7.1) choose dsp_multich, for only 2 channels, dsp is sufficient. See this for all available devices.\n\n"
    },
    {
      "title": "ALSA emulation",
      "level": 3,
      "content": "You can instruct alsa-lib to use OSS as its audio output system. This works as a sort of ALSA emulation.\n\nNote, however, that this method may introduce additional latency in your sound output, and that the emulation is not complete and does not work with all applications. It does not work, for example, with programs that try to detect devices using ALSA.\n\nSo, as most applications support OSS directly, use this method only as a last resort.\n\nIn the future, more complete methods may be available for emulating ALSA, such as libsalsa and cuckoo.\n\n"
    },
    {
      "title": "Instructions",
      "level": 4,
      "content": "- Install the alsa-plugins package.\n\n- Edit /etc/asound.conf as follows.\n\n```\npcm.oss {\n   type oss\n    device /dev/dsp\n}\n\npcm.!default {\n    type oss\n    device /dev/dsp\n}\n\nctl.oss {\n    type oss\n    device /dev/mixer\n}\n\nctl.!default {\n    type oss\n    device /dev/mixer\n}\n```\n\n"
    },
    {
      "title": "Settings for a specific driver",
      "level": 3,
      "content": "If something is not working, there is a possibility that some of your OSS settings are driver specific or just wrong for your driver.\n\nTo solve this:\n\n- Find out which driver is used\n\n```\n$ lspci -vnn | grep -i -A 15 audio\n```\n\n```\n00:1e.2 Multimedia audio controller [0401]: Intel Corporation 82801FB/FBM/FR/FW/FRW (ICH6 Family) AC'97 Audio Controller [8086:266e] (rev 03)\nSubsystem: Hewlett-Packard Company NX6110/NC6120 [103c:099c]\nFlags: bus master, medium devsel, latency 0, IRQ 21\nI/O ports at 2100 [size=256]\nI/O ports at 2200 [size=64]\nMemory at d0581000 (32-bit, non-prefetchable) [size=512]\nMemory at d0582000 (32-bit, non-prefetchable) [size=256]\nCapabilities: <access denied>\nKernel driver in use: *oss_ich*\nKernel modules: snd-intel8x0\n```\n\n- Locate configuration file for device in:\n\n```\n# cd /usr/lib/oss/conf/\n```\n\n- Try changing defaults. There are only few settings, and they are self explanatory\n\nFor example, the setting:\n\n```\nich_jacksense = 1\n```\n\nin oss_ich.conf turns on jack-sense (which is responsible for recognizing plugged headphones and muting the speaker). Other settings for jack-sense can be found in hdaudio.conf where you have to change the hdaudio_jacksense variable.\n\n- Restart the oss.service for changes take effects.\n\n"
    },
    {
      "title": "Understanding the problem",
      "level": 4,
      "content": "If you have a HD Audio sound device, it is very likely that you will have to adjust some mixer settings before your sound works.\n\nHD Audio devices are very powerful in the sense that they can contain a lot of small circuits (called widgets) that can be adjusted by software at any time. These controls are exposed to the mixer, and they can be used, for example, to turn the earphone jack into a sound input jack instead of a sound output jack.\n\nHowever, there are also bad side effects, mainly because the HD Audio standard is more flexible than it perhaps should be, and because the vendors often only care to get their official drivers working.\n\nWhen using HD Audio devices, you often find disorganized mixer controls, that do not work at all by default, and you are forced to try every mixer control combination possible, until it works.\n\n"
    },
    {
      "title": "Solution",
      "level": 4,
      "content": "Open ossxmix and try to change every mixer control in the middle area, that contains the sound card specific controls, as explained in the #Volume control mixer section.\n\nYou will probably want to setup a program to record/play continuously in the background (e.g. ossrecord - | ossplay - for recording or osstest -lV for playing), while changing mixer settings in ossxmix in the foreground.\n\n- Raise every volume control slider.\n- In each option box, try to change the selected option, trying all the possible combinations.\n- If you get noise, try to lower and/or mute some volume controls, until you find the source of the noise.\n- Editing /usr/lib/oss/conf/oss_hdaudio.conf, uncommenting and changing hdaudio_noskip=0 to a value from 0-7 can give you more jack options in ossxmix.\n\nNote: **oss** \n\n"
    },
    {
      "title": "MMS sound cracking in Totem",
      "level": 3,
      "content": "If you hear various cracks or strange noises in Totem during playback, you can try using another backend such as FFmpeg. This will not fix the issue that somehow pops up in GStreamer when playing MMS streams but it will give you the option to play it with good sound quality. Playing it in MPlayer is simple:\n\n```\n# mplayer mmsh://yourstreamurl\n```\n\n"
    },
    {
      "title": "Microphone playing through output channels",
      "level": 3,
      "content": "By default, OSS plays back the microphone through the speakers. To disable this in ossxmix find the \"Misc\" section and uncheck every \"input-mix-mute\" box.\n\n"
    },
    {
      "title": "Add additional HD Audio sound cards support",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nOSS provides a \"generic\" codec driver that should be able to parse 99% of all HDAudio codecs.\n\nIf the device are not listed in the oss_hdaudio.c source file, add them to it, recompile and start the drivers.\n\nTo find the device/vendor IDs for device type 403, do the following:\n\n```\n$ lspci -vnn | grep Audio\n```\n\n```\n00:1f.3 Audio device [0403]: Intel Corporation Sunrise Point-H HD Audio [8086:a170] (rev 31)\n```\n\nIn this example, \"Vendor ID\" is \"8086\" and \"Device ID\" is \"a170\".\n\nChange 5 lines of code in the source code, taking \"the latest source package\"(currently \"oss-v4.2-build2020-src-gpl.tar.bz2\") as an example:\n\n```\noss-v4.2-build2020-src-gpl/devlists/Linux\n```\n\n```\noss_hdaudio     pci8086,a170    Intel High Definition Audio (PCH_C)\n```\n\n```\noss-v4.2-build2020-src-gpl/kernel/drv/oss_hdaudio/.devices\n```\n\n```\noss_hdaudio     pci8086,a170    Intel High Definition Audio (PCH_C)\n```\n\n```\noss-v4.2-build2020-src-gpl/kernel/drv/oss_hdaudio/oss_hdaudio.c\n```\n\n```\n#define INTEL_DEVICE_PCH_C      0xa170\n    case INTEL_DEVICE_PCH_C:\t\t#Don't add it, it's already there\n```\n\nIt is better to modify the existing \"Controller\" (\"PCH_C\" in this example), appending a new line of code may fail. It does not matter if it is PCH_C.\n\nThe last line of code is a bit complicated. This example is an ALC1150 sound card chip. The \"Vendor_id\" of \"ALC1150\" is \"0x10ec0900\", you can get it through a search engine, or try the following:\n\n```\n# cat /sys/class/sound/card0/device/hdaudioC0D0/vendor_id\n```\n\n```\n0x10ec0900\n```\n\n```\n# cat /sys/class/sound/card0/device/sound/card0/hwC0D0/vendor_id\n```\n\n```\n0x10ec0900\n```\n\nFor sound card chips of different manufacturers, different paragraphs need to be modified. In the example, the paragraph of Realtek manufacturer:\n\n```\noss-v4.2-build2020-src-gpl/kernel/drv/oss_hdaudio/hdaudio_codecids.h\n```\n\n```\n{0x10ec0889, \"ALC889\", VF_ALC88X_HACK, (char **) &alc883remap}, \n  {0x10ec0900, \"ALC1150\", VF_ALC88X_HACK, (char **) &alc883remap}, \n  {0x10ec0899, \"ALC899\", VF_ALC88X_HACK, (char **) &alc883remap},\n```\n\nIt is very important that on the hardware of this example, modifying the second-to-last line works, but modifying the same code on the first-to-last line fails. You will need to try and modify the same code over and over on different lines to work on your hardware.\n\nFor example, try on the 4th last line:\n\n```\n{0x10ec0887, \"ALC887\", VF_ALC88X_HACK, (char **) &alc883remap}, \n {0x10ec0900, \"ALC1150\", VF_ALC88X_HACK, (char **) &alc883remap}, \n {0x10ec0889, \"ALC889\", VF_ALC88X_HACK, (char **) &alc883remap}, \n {0x10ec0892, \"ALC892\", VF_ALC88X_HACK, (char **) &alc883remap}, \n {0x10ec0899, \"ALC899\", VF_ALC88X_HACK, (char **) &alc883remap},\n```\n\n- Dependency packages required for compiling OSS do not need to be installed one by one, the base-devel meta package provides the tools for creating packages.\n- You also need to install the toolkit for building kernel modules, which are built during the install phase.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official Website\n- OSS Wiki\n- OSS Forum\n- Developer Information\n- Git repository\n- opensound-devel mailing list\n\n"
    }
  ]
}