{
  "title": "Openbox (Français)",
  "url": "https://wiki.archlinux.org/title/Openbox_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Desktop environment\n- Display manager (Français)\n- File manager functionality\n- Xdg-menu\n- Oblogout\n- Window manager (Français)\n\nOpenbox[dead link 2024-10-12 ⓘ] est un gestionnaire de fenêtres léger, puissant et hautement configurable avec un support étendu des standards. Il peut être construit et exécuté indépendamment comme la base d'un environnement de bureau unique ou dans d'autres environnements de bureau intégrés tels que KDE et Xfce, comme une alternative aux gestionnaires de fenêtres qu'ils fournissent. L'environnement de bureau LXDE est lui-même construit autour d'Openbox.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet openbox. Installez également les polices TTF telles que ttf-dejavu et ttf-liberation.\n\n"
    },
    {
      "title": "Autonome",
      "level": 3,
      "content": "Lancez openbox ou openbox-session avec xinit. Notez que seule openbox-session fournit un démarrage automatique.\n\nNote: **clic droit** \n\n"
    },
    {
      "title": "Autres environnements de bureau",
      "level": 3,
      "content": "- Lorsque vous remplacez le gestionnaire de fenêtres natif d'un environnement de bureau par Openbox, gardez à l'esprit qu'Openbox ne fournit aucun effet de composition (comme la transparence). Voir #Effets de composition.\n- Openbox fonctionne avec les applications GNOME (mais consultez GTK#Client-side decorations). [1]\n\nConsultez Desktop environment#Use a different window manager.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Quatre fichiers clés forment la base de la configuration d'Openbox[dead link 2024-10-12 ⓘ], chacun ayant un rôle unique. Il s'agit de : rc.xml, menu.xml, autostart, et environment. Bien que ces fichiers soient abordés plus en détail ci-dessous, pour commencer à configurer Openbox, il sera d'abord nécessaire de créer un profil Openbox local (i.e. pour votre compte utilisateur spécifique) basé sur ces fichiers. Ceci peut être fait en les copiant du profil global /etc/xdg/openbox (applicable à tous les utilisateurs) comme modèle :\n\n```\n$ mkdir -p ~/.config/openbox\n$ cp -a /etc/xdg/openbox/ ~/.config/\n```\n\n"
    },
    {
      "title": "rc.xml",
      "level": 3,
      "content": "~/.config/openbox/rc.xml est le fichier de configuration principal, responsable de la détermination du comportement et des paramètres de la session globale, notamment :\n\n- Les raccourcis clavier (par exemple, démarrage des applications ; contrôle du volume)\n- Les thèmes\n- Les paramètres du bureau et du bureau virtuel, et\n- Les paramètres des fenêtres d'application.\n\nCe fichier est également préconfiguré, ce qui signifie qu'il ne sera nécessaire de modifier le contenu existant que pour personnaliser le comportement en fonction des préférences personnelles.\n\n"
    },
    {
      "title": "menu.xml",
      "level": 3,
      "content": "~/.config/openbox/menu.xml définit le type et le comportement du menu du bureau, accessible par un clic droit sur l'arrière-plan. Bien que le menu fourni par défaut soit un menu statique (ce qui signifie qu'il ne sera pas automatiquement mis à jour lorsque de nouvelles applications seront installées), il est possible d'utiliser des menus dynamiques qui seront également mis à jour automatiquement.\n\nLes options disponibles sont discutées en détail ci-dessous dans la section #Menus.\n\n"
    },
    {
      "title": "Démarrage automatique",
      "level": 3,
      "content": "openbox-session fournit deux mécanismes de démarrage automatique : XDG Autostart (qui ne fonctionne que si python-pyxdg est installé) et le mécanisme de démarrage automatique propre à Openbox[dead link 2024-10-12 ⓘ].\n\nLe mécanisme de démarrage automatique propre à Openbox :\n\n- sources /etc/xdg/openbox/environnement.\n- sources ~/.config/openbox/environment\n- exécute /etc/xdg/openbox/autostart\n- exécute ~/.config/openbox/autostart.\n\nLes problèmes concernant les commandes dans ~/.config/openbox/autostart qui sont exécutées dans le désordre (ou carrément sautées) sont souvent résolus par l'ajout de petits délais. Par exemple :\n\n```\nxset -b\n(sleep 3s && nm-applet) &\n(sleep 3s && conky) &\n```\n\n"
    },
    {
      "title": "environnement",
      "level": 3,
      "content": "~/.config/openbox/environment peut être utilisé pour exporter et définir des variables d'environnement pertinentes, par exemple pour :\n\n- Définir de nouveaux chemins d'accès (par exemple, exécuter des commandes qui, autrement, nécessiteraient de lister l'ensemble des chemins d'accès avec elles).\n- Changer les paramètres de langue, et\n- Définir d'autres variables à utiliser (par exemple, le correctif pour les thèmes GTK pourrait être listé ici).\n\n"
    },
    {
      "title": "Thèmes",
      "level": 3,
      "content": "Installez obconfAUR[broken link: package not found] et/ou lxappearance-obconf pour obtenir une interface graphique permettant de configurer les paramètres visuels et les thèmes.\n\nUne bonne sélection de thèmes est disponible dans le paquet openbox-themesAUR ou dans l'AUR. Certains thèmes GTK sont également fournis avec un thème Openbox. Les thèmes spécifiques à Openbox et les thèmes compatibles avec Openbox seront installés dans le répertoire /usr/share/themes et seront également immédiatement disponibles pour la sélection.\n\nbox-look.org est une source excellente et populaire de thèmes. deviantART.com est une autre excellente ressource. De nombreux autres thèmes peuvent être trouvés en ligne.\n\n"
    },
    {
      "title": "Modifier ou créer",
      "level": 4,
      "content": "Le processus de création de nouveaux thèmes ou de modification de thèmes existants est traité en détail sur le site officiel openbox.org[dead link 2024-10-12 ⓘ]. obthemeAUR est une interface graphique conviviale pour le faire.\n\n"
    },
    {
      "title": "Configuration de l'interface graphique",
      "level": 3,
      "content": "Plusieurs applications GUI sont disponibles pour configurer rapidement et facilement votre bureau Openbox.\n\n- ObConf — Un outil de configuration basé sur GTK3 pour le gestionnaire de fenêtres Openbox.\n\n- LXAppearance ObConf — Plugin pour LXAppearance pour configurer Openbox. Notez que toutes les options de configuration d'Openbox ne sont pas disponibles dans ce plugin, vous voudrez probablement installer obconf de toute façon.\n\n- LXInput — Configuration du clavier et de la souris de LXDE\n\n- LXRandR — Configuration des moniteurs de LXDE\n\n- obkey — Configuration des raccourcis clavier d'Openbox\n\n- obapps — Outil graphique permettant de configurer les paramètres des applications dans Openbox\n\nLes programmes et applications relatifs à la configuration du menu de bureau d'Openbox sont abordés dans la section #Menus.\n\n"
    },
    {
      "title": "Reconfiguration d'Openbox",
      "level": 2,
      "content": "Openbox ne reflète pas toujours automatiquement les modifications apportées à ses fichiers de configuration au cours d'une session. Par conséquent, il sera nécessaire de recharger manuellement ces fichiers après qu'ils aient été modifiés. Pour ce faire, entrez la commande suivante :\n\n```\n$ openbox --reconfigure\n```\n\nSi vous avez l'intention d'ajouter cette commande en tant que raccourci clavier à ~/.config/openbox/rc.xml, il suffira d'indiquer la commande comme reconfigure. Un exemple a été fourni ci-dessous, en utilisant le raccourci Super+F11 :\n\n```\n<keybind key=\"W-F11\">\n  <action name=\"Reconfigure\">\n</keybind>\n```\n\n"
    },
    {
      "title": "Raccourcis clavier",
      "level": 2,
      "content": "Tous les raccourcis clavier doivent être ajoutés au fichier ~/.config/openbox/rc.xml, et sous la rubrique <!-- Keybindings for running aplications -->. Bien qu'un bref aperçu ait été fourni ici, une explication plus approfondie des raccourcis clavier peut être trouvée à openbox.org[dead link 2024-10-12 ⓘ].\n\nLes raccourcis clavier peuvent être ajoutés au fichier de configuration en utilisant la syntaxe suivante :\n\n```\n<keybind key=\"'my-key-combination\">\n  <action name=\"my-action\">\n    ...\n  </action>\n</keybind>\n```\n\nLe nom de l'action pour exécuter une commande externe est Execute. Utilisez la syntaxe suivante pour définir une commande externe à exécuter :\n\n```\n<action name=\"Execute\">\n  <command>ma-commande</command>\n</action>\n```\n\nConsultez le wiki d'Openbox[dead link 2024-10-12 ⓘ] pour obtenir une liste de toutes les actions disponibles.\n\nSi l'utilisation de touches alphanumériques standard pour les raccourcis est évidente, des noms spéciaux sont attribués à d'autres types de touches, tels que modifiers, multimedia and navigation.\n\n"
    },
    {
      "title": "Modificateurs",
      "level": 3,
      "content": "Les touches modifiers jouent un rôle important dans les raccourcis (par exemple, maintenir la touche Shift ou Ctrl en combinaison avec une autre touche pour entreprendre une action). L'utilisation de modificateurs permet d'éviter les raccourcis clavier conflictuels, c'est-à-dire que deux actions ou plus sont liées à la même touche ou combinaison de touches. La syntaxe pour utiliser un modificateur avec une autre touche est la suivante :\n\n```\n\"<modificateur>-<touche>\"\n```\n\nLes codes des modificateurs sont les suivants :\n\n- S : Shift\n- C : Ctrl\n- A : Alt\n- W : Super\n- M : Meta\n- H : Hyper (Si elle est associée à quelque chose)\n\n"
    },
    {
      "title": "Touches multimédia",
      "level": 3,
      "content": "Lorsqu'elles sont disponibles, il est possible de configurer les touches multimedia appropriées pour qu'elles remplissent les fonctions auxquelles elles sont destinées, comme le contrôle du volume et/ou de la luminosité de l'écran. Ces touches sont généralement intégrées aux touches function et sont identifiées par leurs symboles appropriés. Consultez Extra keyboard keys pour plus de détails.\n\nLes codes multimédias de volume et de luminosité sont les suivants (notez que des commandes devront leur être assignées pour qu'ils fonctionnent réellement) :\n\n- XF86AudioRaiseVolume : Augmente le volume\n- XF86AudioLowerVolume : Diminuer le volume\n- XF86AudioMute : Couper / rétablir le volume\n- XF86MonBrightnessUp : Augmenter la luminosité de l'écran\n- XF86MonBrightnessDown : Diminuer la luminosité de l'écran\n\nPour une liste complète des touches multimédia de XF86, consultez LQWiki:XF86 keyboard symbols.\n\n"
    },
    {
      "title": "Contrôle du volume",
      "level": 4,
      "content": "Les commandes à utiliser pour contrôler le volume dépendent de l'utilisation de ALSA, PulseAudio ou OSS pour le son.\n\n- ALSA : consultez Advanced Linux Sound Architecture (Français)#Contrôle du volume au clavier.\n- PulseAudio : consultez PulseAudio#Keyboard volume control.\n- OSS : consultez OSS#Keyboard volume control.\n\n"
    },
    {
      "title": "Touches de navigation",
      "level": 3,
      "content": "Ce sont les touches directionnelles / flèches, généralement utilisées pour déplacer le curseur vers le haut, le bas, la gauche ou la droite. Les codes de navigation (évidents) sont les suivants :\n\n- Up : Haut\n- Down : Bas\n- Left : Gauche\n- Right : Droite\n\n"
    },
    {
      "title": "Menus",
      "level": 2,
      "content": "Il est possible d'utiliser trois types de menus dans Openbox : static, pipes (dynamique) et generators (statique ou dynamique). Ils peuvent être utilisés seuls ou dans n'importe quelle combinaison.\n\n"
    },
    {
      "title": "Statique",
      "level": 3,
      "content": "Comme son nom l'indique, ce type de menu par défaut ne change en aucune façon et peut être modifié manuellement et/ou (re)généré automatiquement à l'aide d'un logiciel approprié.\n\nRapide et efficace, ce type de menu peut être utilisé pour sélectionner des applications, mais il peut également être utile pour accéder à des fonctions spécifiques et/ou effectuer des tâches spécifiques (par exemple, la configuration du bureau), laissant l'accès aux applications à un autre processus (par exemple, les applications synapse ou xfce4-appfinder).\n\nLe fichier ~/.config/openbox/menu.xml sera la seule source de contenu statique du menu du bureau.\n\n"
    },
    {
      "title": "menumaker",
      "level": 4,
      "content": "menumaker génère automatiquement des menus xml pour plusieurs gestionnaires de fenêtres, dont Openbox, Fluxbox, IceWM et Xfce. Il recherchera tous les programmes exécutables installés et créera par conséquent un fichier de menu pour eux. Il est également possible de configurer MenuMaker pour exclure certains types d'applications (par exemple, celles relatives à GNOME ou KDE), si vous le souhaitez.\n\nUne fois installé et exécuté, il génère automatiquement un nouveau fichier ~/.config/openbox/menu.xml. Pour éviter d'écraser un fichier existant, entrez :\n\n```\n$ mmaker -v OpenBox3\n```\n\nSinon, pour écraser un fichier existant, ajoutez l'argument force (f) :\n\n```\n$ mmaker -vf OpenBox3\n```\n\nUne fois qu'un nouveau fichier ~/.config/openbox/menu.xml a été généré, il peut être édité manuellement ou configuré à l'aide d'un éditeur de menu GUI, tel que obmenuAUR.\n\n"
    },
    {
      "title": "obmenu",
      "level": 4,
      "content": "obmenuAUR est une application GUI \"conviviale\" permettant de modifier ~/.config/openbox/menu.xml, sans avoir besoin de coder en xml.\n\n"
    },
    {
      "title": "xdg-menu",
      "level": 4,
      "content": "archlinux-xdg-menu générera automatiquement un menu basé sur les fichiers xdg contenus dans le répertoire /etc/xdg/ pour de nombreux gestionnaires de fenêtres, dont Openbox. Consultez l'article Xdg-menu#OpenBox pour plus d'informations.\n\n"
    },
    {
      "title": "options du menu de déconnexion",
      "level": 4,
      "content": "Le fichier ~/.config/openbox/menu.xml peut être modifié afin de fournir un sous-menu avec les mêmes options que celles fournies par oblogout. L'exemple de script ci-dessous fournira toutes ces options, à l'exception de la possibilité de verrouiller l'écran :\n\n```\n<menu id=\"exit-menu\" label=\"Exit\">\n\t<item label=\"Log Out\">\n\t\t<action name=\"Execute\">\n\t\t\t<command>openbox --exit</command>\n\t\t</action>\n\t</item>\n\t<item label=\"Shutdown\">\n\t\t<action name=\"Execute\">\n\t\t\t<command>systemctl poweroff</command>\n\t\t</action>\n\t</item>\n\t<item label=\"Restart\">\n\t\t<action name=\"Execute\">\n\t\t        <command>systemctl reboot</command>\n\t\t</action>\n\t</item>\n\t<item label=\"Suspendre\">\n\t\t<action name=\"Execute\">\n\t\t        <command>systemctl suspend</command>\n\t\t</action>\n\t</item>\n\t<item label=\"Hibernate\">\n\t\t<action name=\"Execute\">\n\t\t        <command>systemctl hibernate</command>\n\t\t</action>\n\t</item>\n</menu>\n```\n\nUne fois les entrées composées, ajoutez la ligne suivante pour présenter le sous-menu à l'endroit souhaité dans le menu principal du bureau (généralement comme dernière entrée) :\n\n```\n<menu id=\"exit-menu\"/>\n```\n\n"
    },
    {
      "title": "Pipes",
      "level": 3,
      "content": "Ce type de menu est essentiellement un script qui fournit des listes dynamiques et actualisées à la volée au fur et à mesure de son exécution. Ces listes peuvent être utilisées à des fins multiples, notamment pour répertorier des applications, fournir des informations et des fonctions de contrôle. Des menus pipe préconfigurés peuvent être installés, mais pas à partir des dépôts officiels. Les utilisateurs plus expérimentés peuvent également modifier et/ou créer leurs propres scripts personnalisés. Là encore, ~/.config/openbox/menu.xml peut contenir et contiendra généralement plusieurs menus pipe.\n\n"
    },
    {
      "title": "Exemples",
      "level": 4,
      "content": "- openbox-xdgmenuAUR[broken link: package not found] : convertisseur rapide de xdg-menu en xml-pipe-menu\n- obfilebrowserAUR : Navigateur d'applications et de fichiers\n- obdevicemenuAUR[broken link: package not found] : Gestion des supports amovibles avec Udisks.\n- wifi pipe menu : Réseau sans fil avec Netctl.\n\nOpenbox.org[dead link 2024-10-12 ⓘ] fournit également une autre liste de menus pipe.\n\n"
    },
    {
      "title": "Générateurs",
      "level": 3,
      "content": "Ce type de menu s'apparente à ceux fournis par les barres de tâches des environnements de bureau tels que Xfce ou LXDE. Se mettant automatiquement à jour à la volée, ce type de menu peut être puissant et très pratique. Il peut également être possible d'ajouter des catégories et des entrées de menu personnalisées ; lisez la documentation de votre menu dynamique pour déterminer si et comment cela peut être fait.\n\nUn générateur de menu devra être exécuté à partir du fichier ~/.config/openbox/menu.xml.\n\n"
    },
    {
      "title": "obmenu-generator",
      "level": 4,
      "content": "obmenu-generatorAUR est fortement recommandé bien qu'il s'agisse d'un paquet non officiel. Avec la possibilité d'être utilisé comme un menu statique ou dynamique, il est hautement configurable, puissant et polyvalent. Les catégories de menu et les entrées individuelles peuvent également être facilement cachées, personnalisées et/ou ajoutées. Le site officiel fournit de plus amples informations et des captures d'écran.\n\nVous trouverez ci-dessous un exemple d'exécution dynamique d'obmenu-generator sans icônes dans ~/.config/openbox/menu.xml :\n\n```\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<openbox_menu>\n    <menu id=\"root-menu\" label=\"OpenBox 3\" execute=\"/usr/bin/obmenu-generator\">\n    </menu>\n</openbox_menu>\n```\n\nPour iconifier automatiquement les entrées, on ajouterait l'option -i :\n\n```\n<menu id=\"root-menu\" label=\"OpenBox 3\" execute=\"/usr/bin/obmenu-generator -i\">\n```\n\n"
    },
    {
      "title": "openbox-menu",
      "level": 4,
      "content": "openbox-menuAUR utilise le cache de menu de LXDE. menu-cache pour créer des menus dynamiques. La page officielle fournit des informations supplémentaires et des captures d'écran.\n\n"
    },
    {
      "title": "Icônes de menu",
      "level": 3,
      "content": "Pour afficher des icônes à côté des entrées de menu, il faudra s'assurer qu'elles sont activées dans la section <menu> du fichier ~/.config/openbox/rc.xml :\n\n```\n<showIcons>yes</showIcons>\n```\n\nEn cas d'utilisation d'un menu statique, il sera alors nécessaire de modifier le fichier ~/.config/openbox/menu.xml pour fournir à la fois la commande icon =, ainsi que le chemin complet et le nom de l'icône pour chaque entrée. Voici un exemple de la syntaxe utilisée pour fournir une icône pour une catégorie :\n\n```\n<menu id=\"apps-menu\" label=\"[nom du label]\" icon=\"[chemin d'accès à l'icône]/[nom de l'icône]\">\n```\n\n"
    },
    {
      "title": "Menu du bureau en tant que menu de panneau",
      "level": 3,
      "content": "xdotool est un paquet qui peut émettre des commandes pour simuler des pressions de touches / des raccourcis, ce qui signifie qu'il est possible de l'utiliser pour invoquer des actions liées à des raccourcis sans avoir à appuyer sur les touches qui leur sont assignées. Comme cela inclut la possibilité d'invoquer un raccourci clavier assigné pour le menu du bureau Openbox, il est donc possible d'utiliser XDoTool pour transformer le menu du bureau Openbox en un menu de panneau. En particulier lorsque le menu du bureau est fortement personnalisé et riche en fonctionnalités, cela peut s'avérer très utile pour :\n\n- Remplacer un menu panneau existant\n- Implémenter un menu panneau là où ce n'est pas prévu ou possible (par exemple pour Tint2)\n- Compenser la perte d'accès au menu du bureau due à l'utilisation d'une application comme xfdesktop pour gérer le bureau.\n\nUne fois XDoTool installé - s'il n'est pas déjà présent - il sera nécessaire de créer un raccourci pour accéder au menu racine dans ~/.config/openbox/rc.xml, et encore sous l'en-tête <!-- Keybindings for running aplications -->. Par exemple, le code suivant fera apparaître le menu en appuyant sur Ctrl+m :\n\n```\n<keybind key=\"C-m\">\n    <action name=\"ShowMenu\">\n       <menu>menu racine</menu>\n    </action>\n</keybind>\n```\n\nOpenbox doit ensuite être reconfiguré. Dans ce cas, XDoTool sera utilisé pour simuler la combinaison Ctrl+m pour accéder au menu du bureau avec la commande suivante (notez l'utilisation de + à la place de -) :\n\n```\nxdotool key control+m\n```\n\nLa façon dont cette commande peut être utilisée en tant que lanceur de panneau / icône dépend largement des caractéristiques du panneau utilisé. Alors que certains panneaux permettent d'exécuter la commande ci-dessus directement lors du processus de création d'un nouveau lanceur, d'autres peuvent nécessiter l'utilisation d'un script exécutable. Par exemple, un script exécutable personnalisé appelé obpanelmenu.sh sera créé dans le répertoire ~/.config et la commande XDoTool appropriée sera ajoutée au fichier (pour simuler la pression des touches Ctrl+m dans cet exemple) :\n\n```\n~/.config/obpanelmenu.sh\n```\n\n```\nxdotool key control+m\n```\n\nUne fois que le fichier a été enregistré et fermé, il peut être transformé en script exécutable.\n\nL'exécuter fera apparaître le menu du bureau Openbox. Par conséquent, si vous utilisez un panneau qui prend en charge la fonctionnalité de glisser-déposer pour ajouter de nouveaux lanceurs, faites simplement glisser le script exécutable sur celui-ci avant de modifier l'icône selon vos goûts personnels.\n\n"
    },
    {
      "title": "Menu conforme à XDG",
      "level": 3,
      "content": "Un menu conforme à la norme XDG est basé sur la norme freedesktop.org. Le menu est défini dans des fichiers de menu qui résident dans /etc/xdg/menus. Les nouvelles applications apparaîtront automatiquement dans le menu.\n\n"
    },
    {
      "title": "Exemple",
      "level": 4,
      "content": "Le paquet archlinux-menusAUR fournit un menu conforme à XDG spécifique à Arch Linux.\n\n"
    },
    {
      "title": "Thèmes de curseurs et d'icônes",
      "level": 3,
      "content": "Voir Cursor themes et Icons pour plus de détails.\n\n"
    },
    {
      "title": "Icônes et fonds d'écran du bureau",
      "level": 3,
      "content": "Openbox ne gère pas nativement l'utilisation d'icônes de bureau ou de fonds d'écran.\n\nVoir PCManFM, SpaceFM et Idesk.\n\n{Vous devrez peut-être modifier ~/.conkyrc et définir own_window_type sur normal.}}\n\nVoir List of applications/Other#Wallpaper setters.\n\n"
    },
    {
      "title": "Effets de composition",
      "level": 3,
      "content": "Openbox ne fournit pas de prise en charge native pour la composition, et nécessite donc un compositeur externe à cet effet.\n\nBien que le compositeur ne soit pas un composant nécessaire, il peut spécifiquement éviter des problèmes tels que la distorsion de l'écran avec oblogout, et des problèmes visuels avec la transparence des fenêtres de terminal. Voir Xorg (Français)#Liste des gestionnaires de composites pour les choix courants.\n\n"
    },
    {
      "title": "oblogout",
      "level": 3,
      "content": "Voir l'article Oblogout pour un aperçu de l'utilisation de ce script de déconnexion graphique utile.\n\n"
    },
    {
      "title": "Lancer une commande complexe avec un raccourci clavier",
      "level": 3,
      "content": "Si vous devez exécuter une commande complexe, utilisez la fonctionnalité du shell.\n\nLorsque vous écrivez vos propres scripts, assurez-vous d'échapper les caractères spéciaux xml, tels que \"&\" (\"&amp ;\"), \"<\" (\"&lt ;\"), \">\" (\"&gt ;\") et autres (voir plus en détail sur Entités prédéfinies en XML).\n\nCet exemple éteint immédiatement l'écran et le verrouille avec slock. Il a été repris de cette discussion.\n\n```\n<keybind key=\"W-l\">\n   <action name=\"Execute\">\n     </commande>sh -c 'slock &amp ; (sleep .5 &amp;&amp ; xset dpms force off)'</commande>\n   </action>\n </keybind>\n```\n\nParfois, on a besoin de spécifier une variable d'environnement pour l'application :\n\n```\n<keybind key=\"A-F7\">\n   <action name=\"Execute\">\n     <command>sh -c \"LC_ALL=C obconf\"</command>\n   </action>\n </keybind>\n```\n\nUn autre exemple lancera l'application en préservant toutes les sorties stdout et stderr dans un fichier :\n\n```\n<keybind key=\"A-f\">\n   <action name=\"Execute\">\n     <command>sh -c sh -c \"exec gimp &gt;/tmp/gimp.out 2&gt;&amp;1\"</command>.\n   </action>\n </keybind>\n```\n\nActivez la capture d'écran :\n\n```\n<keybind key=\"Print\">\n   <action name=\"Execute\">\n     <command>gnome-screenshot -c</command>\n   </action>\n </keybind>\n <keybind key=\"A-Print\">\n   <action name=\"Execute\">\n     <command>gnome-screenshot -c -w</command>\n   </action>\n </keybind>\n <keybind key=\"W-Print\">\n   <action name=\"Execute\">\n     <command>gnome-screenshot -i</command>\n   </action>\n </keybind>\n```\n\n"
    },
    {
      "title": "Lanceurs d'applications",
      "level": 3,
      "content": "Étant donné l'absence d'un environnement de bureau avec une installation Openbox simple, il peut être utile d'installer un ou plusieurs lanceurs d'applications en complément du système de menu Openbox et des touches de raccourci. Des listes de tels lanceurs peuvent être trouvées à Category:Application launchers et List of applications/Other#Application launchers ; des exemples populaires sont Gmrun et dmenu.\n\n"
    },
    {
      "title": "Changer de bureau à l'aide de la souris",
      "level": 3,
      "content": "Il est possible de changer de bureau en déplaçant le curseur de la souris vers les bords de l'écran. Installez d'abord xdotool et ajoutez les deux lignes suivantes à votre ~/.xinitrc :\n\n```\nxdotool behave_screen_edge --delay 500 left set_desktop --relative -- -1 &\nxdotool behave_screen_edge --delay 500 right set_desktop --relative -- +1 &\n```\n\n"
    },
    {
      "title": "Définir les applications par défaut / associations de fichiers",
      "level": 3,
      "content": "Voir l'article Default applications.\n\n"
    },
    {
      "title": "Transparence des fenêtres ad-hoc",
      "level": 3,
      "content": "Le programme transset-dfAUR peut activer la transparence des fenêtres à la volée.\n\nPar exemple, l'utilisation du code suivant dans la section <mouse> du fichier ~/.config/openbox/rc.xml permettra de contrôler la transparence des fenêtres de l'application en faisant passer le pointeur de la souris sur la barre de titre et en faisant défiler avec le bouton du milieu :\n\n```\n<context name=\"Titlebar\">\n    ...\n    <mousebind button=\"Up\" action=\"Click\">\n        <action name=\"Execute\" >\n        <execute>transset-df -p .2 --inc </execute>\n        </action>\n    </mousebind>\n    <mousebind button=\"Down\" action=\"Click\">\n        <action name=\"Execute\" >\n        <execute>transset-df -p .2 --dec </execute>\n        </action>\n    </mousebind>\n    ...\n</context>\n```\n\n"
    },
    {
      "title": "Utilisation de obxprop pour une configuration plus rapide",
      "level": 3,
      "content": "Le paquet openbox fournit un binaire obxprop qui peut analyser les valeurs pertinentes pour les paramètres des applications dans rc.xml. Officiellement, obxprop | grep \"^_OB_APP\" est recommandé pour cette tâche. Lancez le processus en exécutant la commande indiquée, puis cliquez sur une fenêtre pour voir ses propriétés dans le terminal.\n\n"
    },
    {
      "title": "Valeurs Xprop pour les applications",
      "level": 3,
      "content": "xorg-xprop peut être utilisé pour relayer les valeurs des propriétés pour les applications sélectionnées. Lorsque vous utilisez fréquemment des paramètres par application, l'alias bash suivant peut être utile :\n\n```\nalias xp='xprop | grep \"WM_WINDOW_ROLE\\|WM_CLASS\" && echo \"WM_CLASS(STRING) = \\\"NAME\\\", \\\"CLASS\\\"\".\n```\n\nPour utiliser Xorg-XProp, exécutez en utilisant l'alias donné xp, et cliquez sur le programme actif que vous souhaitez définir avec des paramètres par application. Les résultats affichés seront uniquement les informations dont Openbox a besoin, à savoir les valeurs WM_WINDOW_ROLE et WM_CLASS (nom et classe) :\n\n```\nWM_WINDOW_ROLE(STRING) = \"roster\".\nWM_CLASS(CHIFFRE) = \"gajim.py\", \"Gajim.py\".\nWM_CLASS(STRING) = \"NAME\", \"CLASS\" (NOM)\n```\n\n"
    },
    {
      "title": "Passage d'une disposition de clavier à une autre",
      "level": 3,
      "content": "Voir la section de l'article passage d'une disposition de clavier à une autre pour les instructions.\n\n"
    },
    {
      "title": "Définir la disposition de la grille pour les bureaux virtuels",
      "level": 3,
      "content": "Installez obsetlayoutAUR. Pour définir une grille 2x2 par exemple :\n\n```\nobsetlayout 0 2 2 0\n```\n\nExécutez-le sans arguments pour savoir ce que signifient les arguments.\n\n"
    },
    {
      "title": "Activer les coins actifs",
      "level": 3,
      "content": "lead-gitAUR fournit des coins actifs pour openbox et d'autres gestionnaires de fenêtres légers. Démarrez l'application avec une entrée dans le fichier autostart :\n\n```\nlead &\n```\n\nLes commandes peuvent être éditées dans le fichier de configuration ~/.config/lead/lead.conf (remplacez eDP1 par le nom de votre sortie écran, que vous pouvez trouver en utilisant xrandr) :\n\n```\n[eDP1]\nbottom=\nbottomLeft=chromium\nbottomRight=thunar\nleft=\nright=\ntop=\ntopLeft=mlde.californium toggle\ntopRight=skippy-xd\n```\n\nPour plus d'informations, voir [2].\n\n"
    },
    {
      "title": "L'ancrage des fenêtres",
      "level": 3,
      "content": "De nombreux environnements de bureau et gestionnaires de fenêtres supportent l'ancrage des fenêtres (par exemple «Aero snap» sous Windows 7), par lequel les fenêtres se mettent automatiquement en place lorsqu'elles sont déplacées vers le bord de l'écran. Cet effet peut également être simulé dans Openbox par l'utilisation de raccourcis sur les fenêtres focalisées.\n\nComme l'illustre l'exemple ci-dessous, des pourcentages doivent être utilisés pour déterminer la taille des fenêtres (voir openbox.org[dead link 2024-10-12 ⓘ] pour plus d'informations). Dans ce cas, la touche super est utilisée conjointement avec les touches navigation :\n\n```\n<keybind key=\"W-Left\">\n    <action name=\"Unmaximize\"/>\n    <action name=\"MaximizeVert\"/>\n    <action name=\"MoveResizeTo\">\n        <width>50%</width>\n    </action>\n    <action name=\"MoveToEdge\"><direction>west</direction></action>\n</keybind>\n<keybind key=\"W-Right\">\n    <action name=\"Unmaximize\"/>\n    <action name=\"MaximizeVert\"/>\n    <action name=\"MoveResizeTo\">\n        <width>50%</width>\n    </action>\n    <action name=\"MoveToEdge\"><direction>east</direction></action>\n</keybind>\n```\n\nCependant, il convient de noter qu'une fois qu'une fenêtre a été 'ancrée' à un bord, elle restera maximisée verticalement à moins d'être maximisée ultérieurement puis restaurée. La solution consiste à implémenter des raccourcis clavier supplémentaires - dans ce cas, en utilisant les touches down et up - pour ce faire. Cela rendra également plus rapide la traction des fenêtres 'ancrées' depuis les bords de l'écran :\n\n```\n<keybind key=\"W-Down\">\n   <action name=\"Unmaximize\">\n</keybind>\n<keybind key=\"W-Up\">\n   <action name=\"Maximize\">\n</keybind>\n```\n\nCe discussion sur le forum Ubuntu fournit plus d'informations. Des applications telles que opensnapAUR sont également disponibles pour simuler automatiquement le comportement d'ancrage des fenêtres sans utiliser de keybind. Une autre option est d'utiliser bunsen-utilities-gitAUR qui fournit les commandes bl-aerosnap --left et bl-aerosnap --right qui ancreront la fenêtre active sur le bord gauche ou droit respectivement si elle n'est pas ancrée et la restaureront à sa taille et position originales sinon. Il suffit d'associer ces commandes à la combinaison de touches de votre choix.\n\n"
    },
    {
      "title": "Transition en douceur du gestionnaire d'affichage",
      "level": 3,
      "content": "Les utilisateurs de gestionnaires d'écran peuvent rencontrer un scintillement pendant la transition entre le gestionnaire d'écran et le bureau Openbox. Ce scintillement est dû au fait qu'Openbox définit la couleur de la fenêtre racine lors du démarrage. Il y a donc un bref moment où l'affichage clignote dans une couleur grise, entre l'arrière-plan du gestionnaire d'affichage et le fond d'écran du bureau.\n\nIl est possible de désactiver le réglage de la couleur de fond de la fenêtre racine en modifiant le script de démarrage d'Openbox qui se trouve dans /usr/lib/openbox/openbox-autostart. Il suffit de commenter (ou de supprimer) le bloc commençant par # Set a background color.\n\n"
    },
    {
      "title": "Décorations de fenêtres",
      "level": 3,
      "content": "Pour supprimer les décorations de fenêtres pour toutes ou certaines applications, utilisez l'option <decor> dans la section <applications> de rc.xml (utilisateur : ~/.config/openbox/ ou système : /etc/xdg/openbox/). Exemple pour Firefox, y compris les variantes comme Firefox-Beta et Firefox-Nightly :\n\n```\n<application class=\"Firefox*\">\n   <decor>no</decor>\n </application>\n```\n\nOn pourrait également désactiver les décorations pour toutes les applications (en utilisant la classe \"*\"), puis les activer (en utilisant yes) pour les applications individuelles. Pour appliquer les changements, redémarrez votre session de bureau, et donc Openbox. Reference: FAQ Openbox[dead link 2024-10-12 ⓘ]\n\n"
    },
    {
      "title": "Firefox",
      "level": 3,
      "content": "Les navigateurs basés sur Mozilla peuvent ignorer les règles d'application (par exemple, <desktop>), sauf si class=\"Firefox\" est utilisé. Voir #Valeurs Xprop pour les applications.\n\n"
    },
    {
      "title": "Thèmes manquants",
      "level": 3,
      "content": "Si, pour une raison quelconque, le thème nouvellement extrait ne peut être sélectionné, ouvrez le répertoire du thème pour vous assurer qu'il est compatible avec Openbox - il devrait y avoir un répertoire openbox-3 et un fichier themerc à l'intérieur. Un fichier .obt (OpenBox Theme) peut également être présent dans certains cas, qui peut alors être chargé manuellement dans obconfAUR[broken link: package not found].\n\nUn thème peut également ne pas être accessible en raison de mauvaises permissions. Voir File permissions and attributes pour en savoir plus.\n\n"
    },
    {
      "title": "Arrêter la bascule continue des bureaux",
      "level": 3,
      "content": "Par défaut, Openbox bascule du dernier bureau vers le premier bureau lors du défilement de la molette de la souris. Utilisez <wrap>no</wrap> dans la section mousebind pour désactiver ce comportement.\n\n```\n<context name=\"Desktop\">\n     <mousebind button=\"Up\" action=\"Click\">\n       <action name=\"GoToDesktop\">\n         <to>previous</to>\n         <wrap>no</wrap>\n       </action>\n     </mousebind>\n     <mousebind button=\"Down\" action=\"Click\">\n       <action name=\"GoToDesktop\">\n         <to>next</to>\n         <wrap>no</wrap>\n       </action>\n     </mousebind>\n   </context>\n```\n\n"
    },
    {
      "title": "Les fenêtres se chargent derrière la fenêtre active",
      "level": 3,
      "content": "Certaines fenêtres d'application (telles que les fenêtres Firefox) peuvent se charger derrière la fenêtre actuellement active, vous obligeant à passer à la fenêtre que vous venez de créer pour l'avoir au premier plan. Pour corriger ce comportement, ajoutez ceci à votre fichier ~/.config/openbox/rc.xml, entre les balises <openbox_config> et </openbox_config> :\n\n```\n<applications>\n  <application class=\"*\">\n    <focus>yes</focus>\n  </application>\n</applications>\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Openbox Website - Site web officiel\n- Box-Look.org - Une bonne ressource pour les thèmes et les œuvres d'art connexes.\n- Openbox Hacks and Configs Thread (Fil de discussion sur les bidouillages et les configurations d'Openbox) @ Forums Arch Linux\n- Openbox Screenshots Thread @ Arch Linux Forums\n- Un guide Openbox\n\n"
    }
  ]
}