{
  "title": "Optical disc drive (Español)",
  "url": "https://wiki.archlinux.org/title/Optical_disc_drive_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nNote: **2013-12-23** \n\nArtículos relacionados\n\n- Codecs (Español)\n- MPlayer\n- dvdbackup\n- MEncoder\n- BluRay\n\nSegún Wikipedia\n\n"
    },
    {
      "title": "Grabación",
      "level": 2,
      "content": "El proceso de grabación de las unidades de disco óptico consiste en la creación o la obtención de una imagen y escribirla en un soporte óptico. La imagen puede ser cualquier archivo de datos, en principio. Si, a continuación, desea montar el medio resultante, se tratará, por lo general, de un archivo de imagen del sistema de archivos ISO 9660. Los CD de audio y multimedia se queman con frecuencia desde un archivo BIN, bajo el control de un archivo TOC o un archivo CUE, que describen el trazado de la pista deseada.\n\n"
    },
    {
      "title": "Instalar utilidades de grabación",
      "level": 3,
      "content": "Si desea utilizar programas con interfaz gráfica siga esta sección.\n\nLos programas enumerados aquí son los backends utilizados por la mayoría de los programas GUI gratuitos para grabar CD, DVD y BD. Están orientados a su utilización en la líneas de órdenes. Los usuarios que utilicen interfaces gráficas pueden servirse del conocimiento de aquellos cuando intenten resolver problemas o para crear scripts para actividades de grabación.\n\nNecesitará, al menos, un programa para la creación de imágenes de sistemas de archivos y un programa que sea capaz de grabar los datos en el tipo de soporte deseado.\n\nLos programas disponibles para la creación de imágenes ISO 9660 son:\n\n- genisoimage del paquete cdrtools\n- mkisofs del paquete cdrtools\n- xorriso y xorrisofs del paquete libisoburn\n\nLa elección tradicional es genisoimage.\n\nLos programas disponibles para grabar las imágenes en un soporte óptico son:\n\n- cdrdao del paquete cdrdao (CD únicamente, TOC/CUE/BIN únicamente)\n- cdrecord del paquete cdrtools\n- cdrskin del paquete libburn\n- growisofs del paquete dvd+rw-tools (DVD y BD únicamente)\n- wodim del paquete cdrtools (CD únicamente, DVD obsoleto)\n- xorriso y xorrecord del paquete libisoburn\n\nLas elecciones tradicionales son wodim para CD y growisofs para DVD y Blu-ray Disc. Para growisofs y BD-R consulte la solución de errores a continuación. Para escribir archivos TOC/CUE/BIN a CD, instale cdrdao.\n\nLos programas GUI gratuitos para grabar CD, DVD y BD dependen, al menos, de uno de los paquetes anteriores.\n\nLos programas genisoimage, mkisofs, y xorrisofs son compatibles con las opciones genisoimage y se muestran en este documento.\n\nLos programas cdrecord, cdrskin y wodim son compatibles con las opciones wodim mostradas aquí. El programa xorrecord da soporte a aquellos que no se ocupan de los CD de audio.\n\n- La instalación de los paquetes cdrtools y cdrtools entrará en conflicto. Instale únicamente uno de ellos.\n- Si desea instalar cdrtools, asegúrese de que genera un paquete usando makepkg e instálelo con pacman. En cambio, los wrappers de pacman podrán resolver esto para cdrkit.\n\n"
    },
    {
      "title": "Crear una imagen ISO con archivos presentes en el disco duro",
      "level": 3,
      "content": "Esto se puede lograr mediante el uso tanto de mkisofs o su fork cdrkit de genisoimage.\n\nLa manera más simple de crear una imagen ISO es copiar los archivos necesarios a una carpeta, por ejemplo ./for_iso.\n\nLuego, utilizar mkisofs o genisoimage de la manera indicada en el siguiente ejemplo:\n\n```\n$ genisoimage -V \"ARCHIVE_2013_07_27\" -J -r -o isoimage.iso ./for_iso\n```\n\nCada una de las etiquetas/parámetros usados en el ejemplo se explican a continuación:\n\n"
    },
    {
      "title": "graft-points",
      "level": 4,
      "content": "También es posible utilizar genisoimage o mkisofs para recolectar archivos y directorios de varias rutas:\n\n```\n$ genisoimage -V \"BACKUP_2013_07_27\" -J -r -o backup_2013_07_27.iso \\\n  -graft-points \\\n  /photos=/home/user/photos \\\n  /mail=/home/user/mail \\\n  /photos/holidays=/home/user/holidays/photos\n```\n\nEn el siguiente ejemplo se ponen los directorios del disco /home/user/photos, /home/user/mail y /home/user/holidays/photos, en la imagen ISO como /photos, /mail y /photos/holidays, respectivamente.\n\nLos programas mkisofs y xorrisofs aceptan las mismas opciones. Para copias de respaldo seguras considere utilizar xorrisofs con la opción --for_backup, que registra las ACL eventuales y almacena una suma de comprobación MD5 para cada archivo de datos.\n\nConsulte los manuales de los programas ISO 9660 para obtener más información acerca de sus opciones:\n\n- genisoimage\n\n- mkisofs\n\n- xorrisofs\n\n- por un lado, como crear un archivo (que no es tan distinto, salvando las diferencias, de la creación de un archivo comprimido ZIP o TAR — por ejemplo, .tar.gz —);\n- por otro, como crear y poblar un sistema de archivos para el volumen, que se articula en forma de una imagen de «disco» (archivo) y que conserva, tanto como sea posible, el contenido, nombre, estructura/jerarquía/colocación relativa a los directorios, y, posiblemente, otros metadatos/propiedades (aspectos) generales del sistema de archivos tales como marca de tiempo, propietarios, permisos.\n\n"
    },
    {
      "title": "Montar una imagen ISO",
      "level": 3,
      "content": "Para probar si la imagen ISO es adecuada, puede montarla (como root):\n\n```\n# mount -t iso9660 -o ro,loop=/dev/loop0 cd_image /cdrom\n```\n\nDeberá cargar primero el módulo loop:\n\n```\n# modprobe loop\n```\n\nNo se olvide de desmontar la imagen cuando la comprobación de la imagen haya terminado:\n\n```\n# umount /cdrom\n```\n\nVéase también montar imágenes como usuario normal para montar sin privilegios de root.\n\n"
    },
    {
      "title": "Convertir imagen img/ccd en una imagen ISO",
      "level": 3,
      "content": "Para convertir una imagen img/ccd, puede usar ccd2iso:\n\n```\n$ ccd2iso ~/image.img ~/image.iso\n```\n\n"
    },
    {
      "title": "Conocer el nombre de la unidad óptica",
      "level": 3,
      "content": "Para el resto de esta sección se supone que el nombre de su dispositivo de grabación es /dev/sr0.\n\nCompruebe esta condición con:\n\n```\n$ wodim dev=/dev/sr0 -checkdrive\n```\n\nQue debe mostar el «Vendor_info» y la «Identification» de la unidad.\n\nSi no se encuentra ninguna unidad, compruebe si existe algún /dev/sr* y si tiene permisos de lectura/escritura (wr-) para usted y a su grupo. En el caso de que no exita /dev/sr* inténtelo con: loading module sr_mod manually.\n\n"
    },
    {
      "title": "Leer una imagen ISO desde un CD, DVD o BD",
      "level": 3,
      "content": "Se debe determinar el tamaño del sistema de archivos de la ISO antes de copiarlo al disco duro. La mayoría de los soportes ópticos admiten más datos de lo que se escribe en ellos con la ejecución de las grabadores más reciente.\n\nUtilice el programa isosize del paquete util-linux para obtener el tamaño de la imagen:\n\n```\n$ blocks=$(expr $(isosize /dev/sr0) / 2048)\n```\n\nEcha un vistazo al número obtenido de bloques para determinar si es aceptable:\n\n```\n$ echo \"That would be $(expr $blocks / 512) MB\"\n```\n\n```\nThat would be 589 MB\n```\n\nA continuación, copie el importe determinado de los datos del soporte al disco duro:\n\n```\n$ dd if=/dev/sr0 of=isoimage.iso bs=2048 count=$blocks\n```\n\nOmita count=$blocks si no determina el tamaño. Probablemente obtendrá más datos de los necesarios. El archivo resultante, sin embargo, será montable. Dicha imagen debe encajar en un soporte del mismo tipo que el soporte desde el que ha copiado la imagen.\n\nSi el soporte original fuese arrancable, entoces la copia será una imagen de arranque. Puede usarla como un pseudo CD para una máquina virtual o grabarla en un disco óptico que se convertirá en arrancable.\n\n"
    },
    {
      "title": "Borrar CD-RW y DVD-RW",
      "level": 3,
      "content": "Los soportes ​​CD-RW que contienen datos deben ser previamente borrados antes de poder grabarlos. Esto se hace así:\n\n```\n$ wodim -v dev=/dev/sr0 blank=fast\n```\n\nLos DVD-RW sin formatear necesitan el mismo tratamiento anterior antes de usarlos. Sin embargo, el borrado rápido les priva de la capacidad multisesión y del registro de los flujos de longitud imprevistos. Así que debe borrarlos formateándolos como sigue:\n\n```\n$ dvd+rw-format -blank=full /dev/sr0\n```\n\ndvd+rw-format forma parte del paquete dvd+rw-tools. Otras órdenes alternativas para la operación anterior serían:\n\n```\n$ cdrecord -v dev=/dev/sr0 blank=all\n$ cdrskin -v dev=/dev/sr0 blank=all\n$ xorriso -outdev /dev/sr0 -blank as_needed\n```\n\nLos soportes DVD-RW formateados se pueden sobrescribir sin ser previamente borrados. Así que considere la posibilidad de aplicar el formato una vez durante su vida útil:\n\n```\n$ dvd+rw-format -force /dev/sr0\n```\n\nOtras órdenes alternativas a la anterior:\n\n```\n$ cdrskin -v dev=/dev/sr0 blank=format_overwrite\n$ xorriso -outdev /dev/sr0 -format as_needed\n```\n\nEl resto de los soportes solo pueden escribirse una vez (CD-R, DVD-R, DVD+R, BD-R) o son sobrescribibles sin necesidad de borrarle los datos (DVD-RAM, DVD+RW, BD-RE).\n\n"
    },
    {
      "title": "Grabar una imagen ISO al CD, DVD o BD",
      "level": 3,
      "content": "Para grabar rápidamente en un CD una imagen ISO (archivo isoimage.iso):\n\n```\n$ wodim -v -sao dev=/dev/sr0 isoimage.iso\n```\n\ny en un DVD o BD:\n\n```\n$ growisofs -dvd-compat -Z /dev/sr0=isoimage.iso\n```\n\nLos programas cdrecord, cdrskin y xorrecord pueden ser usados ​​en todo tipo de soportes ópticos con las opciones wodim.\n\nNote: Así que, en caso de duda, haga:\n\n- Asegúrese de que el soporte óptico no está montado cuando comience la grabación. El montaje puede realizarse automáticamente si el soporte contiene un sistema de archivos legible. En el mejor de los casos, impedirá que los programas de grabación utilicen la grabadora. En el peor de los casos, habrá grabados erróneos perturbando las operaciones de lectura de la unidad.\n\nAsí que, en caso de duda, haga:\n\n```\n# umount /dev/sr0\n```\n\n- growisofs tiene un pequeño error en los soportes BD-R en blanco. Emite un mensaje de error después de finalizar la grabación. Los programas como k3b terminarán la grabación advirtiendo que falló.Para evitar esto, o bien: formatee el BD-R en blanco con dvd+rw-format /dev/sr0 antes de ejecutar growisofs, o utilice la opción -use-the-force-luke=spare:none con growisofs.\n\n- formatee el BD-R en blanco con dvd+rw-format /dev/sr0 antes de ejecutar growisofs,\n- o utilice la opción -use-the-force-luke=spare:none con growisofs.\n\n"
    },
    {
      "title": "Verificar la imagen ISO grabada",
      "level": 3,
      "content": "Puede verificar la integridad del soporte grabado para asegurarse de que no contiene errores. Siempre, antes de verificar la imagen del soporte, expúlselo del dispositivo de grabación y vuelva a ponerlo de nuevo. El kernel podrá acceder sobre el contenido del soporte solo después de esa reinserción.\n\nCalcule primero la suma md5 de la imagen ISO original:\n\n```\n$ md5sum isoimage.iso\n```\n\n```\ne5643e18e05f5646046bb2e4236986d8 isoimage.iso\n```\n\nDespués, calcule la suma md5 del sistema de archivos ISO presente en el soporte óptico.\n\nHay que tener en cuenta que, aunque algunos tipos de soportes contienen exactamente la misma cantidad de datos que se han presentado en el programa de grabación, otros, en cambio, contienen apéndices que arrastran basura cuando se está leyendo. Por lo tanto, se debe limitar la lectura al tamaño del archivo de la imagen ISO.\n\n```\n$ blocks=$(expr $(du -b isoimage.iso | awk '{print $1}') / 2048)\n```\n\n```\n$ dd if=/dev/sr0 bs=2048 count=$blocks | md5sum\n```\n\n```\n43992+0 records in\n 43992+0 records out\n 90095616 bytes (90 MB) copied, 0.359539 s, 251 MB/s\n e5643e18e05f5646046bb2e4236986d8  -\n```\n\nAmbas salidas deben producir la misma suma MD5 (aquí: e5643e18e05f5646046bb2e4236986d8). Si no coinciden, probablemente también reciba un mensaje de error de entrada/salida al ejecutar dd. dmesg podría ayudarle a contar respecto a los errores SCSI y a los números de bloques, si está interesado.\n\n"
    },
    {
      "title": "ISO 9660 y grabación al vuelo (On-The-Fly)",
      "level": 3,
      "content": "No es necesario almacenar un sistema de archivos ISO emergente en el disco duro antes de escribirlo en un soporte óptico. Solo las unidades de CD muy antiguas en ordenadores viejos podrían sufrir errores de grabación debido al búfer vacío.\n\nSi se omite la opción -o de genisoimage se escribirá la imagen ISO en la salida estándar. Esto puede canalizarse hacia la salida estándar del programa de grabación.\n\n```\n$ genisoimage -V \"ARCHIVE_2013_07_27\" -J -r ./for_iso | \\\n  wodim -v dev=/dev/sr0 -waiti -\n```\n\nLa opción -waiti no es realmente necesaria aquí. Evita que wodim escriba en el soporte antes de que genisoimage inicie la grabación. Esto permitirá a genisoimage leer el soporte óptico sin perturbar una grabación ya iniciada. Véase la sección siguiente sobre multisesión.\n\nRespecto a los DVD y BD puede dejar que growisofs gestione genisoimage para realizar la grabación sobre la marcha.\n\n```\n$ export MKISOFS=\"genisoimage\"\n$ growisofs -Z /dev/sr0 -V \"ARCHIVE_2013_07_27\" -r -J ./for_iso\n```\n\n"
    },
    {
      "title": "Multisesión",
      "level": 3,
      "content": "Multisesión ISO 9660 significa que un soporte con el sistema de archivos legible sigue siendo modificable en su primera alineación del bloque no utilizado, y que un nuevo árbol de directorios ISO se escribirá a esa parte del disco no utilizada. El nuevo árbol es acompañado por los bloques de contenido de archivos de datos que acaba de agregar o sobrescribir. Los bloques de los archivos de datos, que quedarán como tal en el árbol antiguo de la ISO, no se escribirán de nuevo.\n\nLinux y muchos otros sistemas operativos montan el árbol de directorios en el último período de sesiones del soporte. Este árbol más reciente, normalmente, mostrará los archivos de las sesiones anteriores, también.\n\n"
    },
    {
      "title": "Multisesión con wodim",
      "level": 4,
      "content": "Los CD-R y CD-RW pueden permanecer abiertos para escribirse (conocido como «appendable» -con capacidad para ampliarse, ampliable-) si utilizan la opción -multi de wodim:\n\n```\n$ wodim -v -multi dev=/dev/sr0 isoimage.iso\n```\n\nPosteriormente, el soporte puede ser preguntado por los parámetros de la próxima sesión:\n\n```\n$ m=$(wodim dev=/dev/sr0 -msinfo)\n```\n\nCon la ayuda de estos parámetros y del soporte reutilizable insertado en la unidad puede realizar la sesión ISO complementaria:\n\n```\n$ genisoimage -M /dev/sr0 -C \"$m\" \\\n   -V \"ARCHIVE_2013_07_28\" -J -r -o session2.iso ./more_for_iso\n```\n\nPor último, agregue la sesión al soporte y manténgalo con capacidad de ampliarse, de nuevo:\n\n```\n$ wodim -v -multi dev=/dev/sr0 session2.iso\n```\n\nLos programas cdrskin y xorrecord pueden hacer esto también con los DVD-R, DVD+R, BD-R, y DVD-RW sin formatear. El programa cdrecord no tiene capacidad multisesión con, al menos, los DVD-R y DVD-RW. Todos los programas, por supuesto, puede realizar esta operación para los CD-R y CD-RW.\n\nLa mayoría de los tipos de soporte reutilizables no registran un historial de sesiones que sería reconocible para un kernel de montaje. Pero con la norma ISO 9660, es posible lograr el efecto multisesión, incluso en tales soportes.\n\ngrowisofs y xorriso pueden hacer esto y ahorrarnos la mayor parte de la complejidad.\n\n"
    },
    {
      "title": "Multisesión con growisofs",
      "level": 4,
      "content": "growisofs acepta la mayoría de los argumentos de estos programas para un programa que sea compatible con mkisofs. Véanse los ejemplos anteriores sobre genisoimage. La opción -o está vetada y la opción -C está obsoleta. Por defecto, el nombre usado para el probrama instalado es «mkisofs». Se puede elegir entre un programa u otro definiendo MKISOFS como la variable del entorno:\n\n```\n$ export MKISOFS=\"genisoimage\"\n$ export MKISOFS=\"xorrisofs\"\n```\n\nSi deseacomenzar con un nuevo sistema de archivos ISO en el soporte óptico, expréselo mediante la opción -Z\n\n```\n$ growisofs -Z /dev/sr0 -V \"ARCHIVE_2013_07_27\" -r -J ./for_iso\n```\n\nSi desea añadir más archivos como una nueva sesión a un sistema de archivos ISO existente, expréselo mediante la opción -M\n\n```\n$ growisofs -M /dev/sr0 -V \"ARCHIVE_2013_07_28\" -r -J ./more_for_iso\n```\n\nPara más detalles, véase el manual de growisofs(1) y los manuales de genisoimage, mkisofs y xorrisofs.\n\n"
    },
    {
      "title": "Multisesión con xorriso",
      "level": 4,
      "content": "xorriso necesita inicarse con un nuevo sistema de archivos ISO en un soporte óptico en blanco. Por lo tanto, es conveniente vaciarlo si contiene datos. La orden -blank as_needed se aplica a todo tipo de soportes reutilizables e incluso a las imágenes ISO de archivos de datos presentes en el disco duro. No causa errores si se aplica a un soporte en blanco escribible una sola vez.\n\n```\n$ xorriso -outdev /dev/sr0 -blank as_needed \\\n          -volid \"ARCHIVE_2013_07_27\" -joliet on -add ./for_iso --\n```\n\nEn el soporte escribible non-blank xorriso añade los archivos del disco recién indicados si se usa la orden -dev en lugar de -outdev. Por supuesto, ninguna orden -blank debe aparecer aquí:\n\n```\n$ xorriso -dev /dev/sr0 \\\n          -volid \"ARCHIVE_2013_07_28\" -joliet on -add ./more_for_iso --\n```\n\nPara más detalles vea la página del manual y especialmente sus ejemplos.\n\n"
    },
    {
      "title": "Defect Management en BD (Blu-ray disc)",
      "level": 3,
      "content": "BD-RE y el soporte BD-R formateado se escriben normalmente con Defect Management activado. Esta función lee los bloques escritos, durante su almacenamiento en el búfer. En caso de mala calidad de lectura de los bloques, estos se escriben de nuevo o son redirigidos a la Spare Area donde los datos se almacenan en bloques de repuesto.\n\nEsta comprobación de lectura reduce la velocidad de escritura a la mitad como máximo de la velocidad nominal que puede alcanzar la unidad y el soporte BD. A veces incluso más. El uso intensivo de la «Zona de Repuesto» provoca grandes retrasos durante las operaciones de lectura. De modo que la activación de Defect Management no siempre es deseable.\n\ncdrecord no formatea BD-R. Sin embargo, no tiene medios para evitar Defect Management en soportes BD-RE.\n\ngrowisofs formatea BD-R por defecto. Esto se puede evitar mediante la opción -use-the-force-luke=spare:none. Sin embargo, ello no evita Defect Management en los soportes BD-RE.\n\ncdrskin, xorriso, y xorrecord no formatean BD-R por defecto. Lo hacen con cdrskin blank=format_if_needed, xorriso -format as_needed y xorrecord blank=format_overwrite, respectivamente. Estos tres programas pueden desactivar Defect Management en BD-RE y en BD-R ya formateada con cdrskin stream_recording=on, xorriso -stream_recording on y xorrecord stream_recording=on, respectivamente.\n\n"
    },
    {
      "title": "Grabar un CD de audio",
      "level": 3,
      "content": "Crea sus pistas de audio y guardarlas sin comprimir, como archivos WAV estéreos de 16-bit. Para convertir MP3 a WAV, compruebe que lame está instalado, muévase con la orden cd al directorio donde tiene los archivos MP3, y ejecute:\n\n```\n$ for i in *.mp3; do lame --decode \"$i\" \"$(basename \"$i\" .mp3)\".wav; done\n```\n\nEn el caso de que obtenga un error cuando intente grabar los archivos WAV convertidos con lame, pruebe con el decodificador mpg123:\n\n```\n$ for i in *.mp3; do mpg123 --rate 44100 --stereo --buffer 3072 --resync -w $(basename $i .mp3).wav $i; done\n```\n\nNomine los archivos de audio de manera tal que las pistas aparezcan listadas en el orden deseado cuando se presenten por orden alfabético, como, por ejemplo 01.wav, 02.wav, 03.wav, etc. Utilice la siguiente orden para simular la grabación de los archivos wav como un CD de audio:\n\n```\n$ wodim -dummy -v -pad speed=1 dev=/dev/sr0 -dao -swab *.wav\n```\n\nEn caso de detectar errores o pistas vacías como:\n\n```\nTrack 01: audio    0 MB (00:00.00) no preemp pad\n```\n\npruebe con otro decodificador (por ejemplo, mpg123) o pruebe utilizando cdrecord del paquete cdrtools.\n\nTenga en cuenta que cdrtools también contiene una orden cdrecord, pero es solo un enlace simbólico a wodim. Si funcionó todo puede quitar la etiqueta dummy para grabar el CD real:\n\nPara probar el nuevo CD de audio, utilice MPlayer:\n\n```\n$ mplayer cdda://\n```\n\n"
    },
    {
      "title": "Grabar una imagen bin/cue",
      "level": 3,
      "content": "Para grabar una imagen bin/cue ejecute:\n\n```\n$ cdrdao write --device /dev/sr0 image.cue\n```\n\n"
    },
    {
      "title": "TOC/CUE/BIN para discos en modalidad mixta",
      "level": 4,
      "content": "La imágenes ISO solo almacenan una única pista de datos. Si desea crear una imagen de un disco de modo mixto (pista de datos con varias pistas de audio), entonces necesitará crear un emparejamiento TOC/BIN:\n\n```\n$ cdrdao read-cd --read-raw --datafile IMAGE.bin --driver generic-mmc:0x20000 --device /dev/cdrom IMAGE.toc\n```\n\nAlgunos programas de software solo emparejan CUE/BIN, por lo que puede hacer una hoja CUE con toc2cue (parte de cdrdao):\n\n```\n$ toc2cue IMAGE.toc IMAGE.cue\n```\n\n"
    },
    {
      "title": "Problemas con los backend de grabación",
      "level": 3,
      "content": "Si tiene algún problema, puede pedir asesoramiento a la lista de correo cdwrite@other.debian.org. O pida asesoramiento a las direcciones de correo electrónico de apoyo que suelen encontrarse al final de las páginas del manual del programa.\n\nComente las líneas de órdenes que ha probado, el tipo de soporte (por ejemplo, CD-R, DVD+RW, etc.), y los síntomas de los fallos (mensajes del programa, expectativas del usuario no obtenidas, etc.). Probablemente querrá respuestas sobre la versión más reciente o en desarrollo del programa afectado y la realización de pruebas de funcionamiento. Pero la respuesta bien podría ser, que la unidad no tolera el soporte en particular.\n\n"
    },
    {
      "title": "Grabar CD/DVD/BD con una GUI",
      "level": 3,
      "content": "Wikipedia - Comparativa de software de creación de discos Existen varias aplicaciones disponibles para grabar los CD en un entorno gráfico.\n\n"
    },
    {
      "title": "Programas GUI libres",
      "level": 4,
      "content": "- AcetoneISO — Herramienta para ISO todo en uno (soporta BIN, MDF, NRG, IMG, DAA, DMG, CDI, B5I, BWI, PDI e ISO).\n\n- BashBurn — Frontend de menú basado en terminal para herramientas de grabación de CD/DVD.\n\n- Brasero — Aplicación de grabación de discos del escritorio de GNOME que está diseñado para ser lo más simple posible. Parte de gnome-extra.\n\n- cdw — Frontend ncurses para cdrecord, mkisofs, growisofs, dvd+rw-mediainfo, dvd+rw-format y xorriso.\n\n- Graveman — Aplicación de grabación de CD/DVD basada en GTK. Es necesario configurarla para que apunte al dispositivo correcto.\n\n- isomaster — Editor de imágenes ISO.\n\n- K3b — Aplicación de grabación de CD, rica en características y fácil de manejar, basado en KDElibs.\n\n- X-CD-Roast — Frontend ligero de cdrtools para escribir CD y DVD.\n\n- Xfburn — Frontend sencillo para las bibliotecas libburnia con soporte para CD/DVD(-RW), imágenes ISO y BurnFree.\n\n- xorriso-tcltk — Frontend gráfico para grabar ISO y herramienta de grabación de xorriso para CD/DVD/BD.\n\n"
    },
    {
      "title": "Nero Linux",
      "level": 4,
      "content": "Nero Linux es una suite comercial de grabación creada por Nero para Windows - Nero AG. La mayor ventaja de Nero Linux es que tiene la interfaz similar a la versión de windows. Por lo tanto, los usuarios que migran desde windows les va a resultar fácil operar con él. La versión de Linux incluye ahora Nero Express, un asistente que dirige a los usuarios a través del proceso de grabación de CD y DVD paso a paso, con el que los usuarios de la versión de Windows estarán familiarizados. Otra novedad en la versión 4 es la gestión de defectos de discos Blu -ray, la integración de Isolinux para crear un dispositivo de arranque y el apoyo a Musepack y formatos de audio AIFF...\n\nNero Linux 4 se vende a £17.99 con una versión de prueba gratuita también disponible.\n\n- Nero Linux 4\n- Paquete nerolinuxAUR[enlace roto: package not found] desde AUR.\n\nNero Linux ofrece algunas características, como:\n\n- Fácil, interfaz de usuario estilo «wizard» para guiar la grabación con Nero Linux Express 4.\n- Soporte de grabación completo para Blu-ray.\n- Soporte surning de audio CD (CD-DA), ISO 9660 (soporte Joliet), CD-text, ISOLINUX arrancable, disco multisesión, DVD-Vídeo y miniDVD, soporte doble capa DVD.\n- Grabación avanzada con Nero Burning ROM y cliente de línea de órdenes.\n\n```\n/etc/modules-load.d/sg.config\n```\n\n```\nsg\n```\n\n"
    },
    {
      "title": "Reproducir DVD",
      "level": 2,
      "content": "DVD, también conocido como Digital Versatile Disc or Digital Video Disc, es un formato de soporte de almacenamiento de disco óptico utilizado para vídeo y almacenamiento de datos.\n\nSi desea reproducir DVD encriptados, debe instalar los paquetes libdvd*:\n\n- libdvdread\n- libdvdcss\n- libdvdnav\n\nAdemás, debe instalar el software reproductor. Los reproductores más populares de DVD son MPlayer, xine y VLC. Véase el listado de reproductores de vídeo y las instrucciones específicas para MPlayer.\n\n```\n# gpasswd -a NOMBREDEUSUARIO optical\n```\n\n"
    },
    {
      "title": "Ripear DVD",
      "level": 2,
      "content": "Ripear es el proceso de copiar el contenido de audio o vídeo al disco duro, normalmente desde soportes extraíbles o transmisiones multimedias.\n\nA menudo, el proceso de extracción de un DVD puede ser dividido en dos subtareas:\n\n1. La extracción de datos - Copiar los datos de audio y/o de vídeo al disco duro,\n1. Transcodificar - Convertir los datos extraídos a un abanico de formatos.\n\nAlgunas utilidades realizan ambas tareas, mientras que otras se centran en uno u otro aspecto:\n\n- dvdbackup — Herramienta para la extracción pura de datos pero no los transcodifica. Es útil para crear copias exactas de DVD encriptados en combinación con libdvdcss o para descifrar vídeos de otras utilidades que no pueden leer DVD encriptados.\n\n- FFmpeg — Completa y libre solución de audio y vídeo de Internet live para Linux/Unix, capaz de hacer un ripeado directo en cualquier formato (audio/vídeo) de una imagen de ISO de DVD-Video, basta con seleccionar la entrada como imagen ISO y continuar con las opciones deseadas. También permite downmixing, shrinking, spliting, seleccionar streams entre otras características.\n\n- HandBrake — Multiproceso transcodificador de vídeo, que ofrece tanto una interfaz gráfica como en línea de órdenes con muchas configuraciones preestablecidas.\n\n- Hybrid — Fronted multiplataforma basado en Qt útil para muchas herramientas que puede convertir casi todas la entradas a x264/Xvid/VP8 + ac3/ogg/mp3/aac/flac contenidas en formato mp4/m2ts/mkv/webm/mov/avi, en un Blu-ray o una estructura AVCHD.\n\n- MEncoder — Herramienta libre en línea de órdenes para decodificar, codificar y filtar vídeo lanzado bajo licencia GNU General Public License. Es parecido a MPlayer y puede convertir todos los formatos que MPlayer reconoce en una variedad de formatos comprimidos y sin comprimir utilizando diferentes códecs. Programas Wrapper como h264encAUR y undvdAUR[enlace roto: package not found] pueden proporcionar una interfaz de asistencia. Están disponibles muchos frontends.\n\n- Transcode — Ripeador y codificador de vídeo/DVD para terminal/consola\n\n"
    },
    {
      "title": "dvd::rip",
      "level": 3,
      "content": "dvd::rip es un frontend para transcodeAUR, que se utiliza para extraer y transcodificar sobre la marcha.\n\nSe deben instalar los siguientes paquetes:\n\n- dvdripAUR: frontend GTK para transcodeAUR, que realiza la extracción y codificación\n- libdv: códec para vídeo DV\n- xvidcore: si desea codificar sus archivos ripeados como XviD, he aquí un códec de vídeo MPEG-4 de código abierto (alternativa gratis de DivX)\n- divx4linuxAUR[enlace roto: package not found]: si desea codificar sus archivos ripeados como DivX (disponible en AUR)\n\nLas preferencias de dvd::rip están, en su mayoría, mejor documentadas/explicadas. Si necesita ayuda, consulte https://www.exit1.org/dvdrip/doc/gui-gui_pref.cipp.\n\nRipear un DVD es, a menudo, tan simple como elegir su códec preferido, seleccionar los títulos deseados y clicar sobre el botón «Rip».\n\n"
    },
    {
      "title": "K3b y el error sobre el locale",
      "level": 3,
      "content": "Cuando ejecute K3B , si aparece el siguiente mensaje:\n\n```\nSystem locale charset is ANSI_X3.4-1968\nYour system's locale charset (i.e. the charset used to encode file names) is \nset to ANSI_X3.4-1968. It is highly unlikely that this has been done intentionally.\nMost likely the locale is not set at all. An invalid setting will result in\nproblems when creating data projects.Solution: To properly set the locale \ncharset make sure the LC_* environment variables are set. Normally the distribution \nsetup tools take care of this.\n```\n\nsignificará que su locale no está bien ajustado.\n\nPara arreglarlo:\n\n- Quite /etc/locale.gen\n- Reinstale glibc\n- Edite /etc/locale.gen, descomente todas las líneas que correspondan a su idioma ADEMÁS de la opción en_US, para la compatibilidad:\n\n```\nes_ES.UTF-8 UTF-8\nes_ES ISO-8859-1\n```\n\n- Reconstruya los perfiles con locale-gen:\n\n```\n# locale-gen\n```\n\n```\nGenerating locales...\nen_US.UTF-8... done\nen_US.ISO-8859-1... done\nes_ES.UTF-8... done\nes_ES.ISO-8859-1... done\nGeneration complete.\n```\n\nMás información aquí.\n\n"
    },
    {
      "title": "Brasero falla al encontrar discos en blanco",
      "level": 3,
      "content": "Brasero utiliza gvfs para gestionar grabadoras de CD/DVD. Asegurese también de que los permisos de su sesión no están rotos.\n\n"
    },
    {
      "title": "Brasero falla al normalizar el CD de audio",
      "level": 3,
      "content": "Al intentar grabar puede pararse en el primer paso llamado Normalización.\n\nComo solución alternativa se puede deshabilitar el plugin de normalización mediante el menú Editar > Plugins\n\n"
    },
    {
      "title": "VLC: Error «... could not open the disc /dev/dvd»",
      "level": 3,
      "content": "Si recibe el error «vlc dvdread could not open the disc \"/dev/dvd\"» puede ser porque no hay ningún nodo de dispositivo /dev/dvd en su sistema. Udev no creará más /dev/dvd y, en su lugar, utilizará /dev/sr0. Para solucionar este problema, edite el archivo de configuración de VLC (~/.config/vlc/vlcrc):\n\n```\n# DVD device (string)                                                           \ndvd=/dev/sr0\n```\n\n"
    },
    {
      "title": "Unidad DVD con ruidos",
      "level": 3,
      "content": "Si la reproducción de vídeos de DVD provoca que el sistema sea muy ruidoso, puede ser porque el disco está girando más rápido de lo que necesita. Para cambiar temporalmente la velocidad de la unidad, como usuario root, ejecute:\n\n```\n# eject -x 12 /dev/dvd\n```\n\nEn ocasiones:\n\n```\n# hdparm -E12 /dev/dvd\n```\n\nSe puede utilizar cualquier velocidad que sea compatible con la unidad, o 0 para la velocidad máxima.\n\nConfiguración de la velocidad de unidades de CD-ROM y DVD-ROM\n\n"
    },
    {
      "title": "La reproducción no funciona con el equipo nuevo (unidad DVD nueva)",
      "level": 3,
      "content": "Si la reproducción no funciona y tiene un equipo nuevo (nueva unidad DVD) la razón podría ser que el código de la región no esté ajustado. Puede leer y establecer el código de la región con regionsetAUR disponible en AUR.\n\n"
    },
    {
      "title": "Ninguno de los programas descritos puede ripear/codificar un DVD en el disco duro",
      "level": 3,
      "content": "Asegúrese de la región de su lector DVD está configurada correctamente, de lo contrario obtendrá un montón de errores inexplicables relacionados con CSS. Utilice regionsetAUR para hacerlo.\n\n"
    },
    {
      "title": "El registro del programa GUI indica problemas con el programa del backend",
      "level": 3,
      "content": "Si utiliza un programa gráfico y experimenta problemas que el registro de dicho programa culpa a algún programa backend, intente reproducir el problema accediendo a los argumentos del programa backend. Si tiene éxito con la reproducción o no, puede informar de las líneas registradas y de sus propias conclusiones a los lugares mencionados en esta sección.\n\n"
    },
    {
      "title": "Caso especial: medium error / write error",
      "level": 4,
      "content": "Estos son algunos mensajes típicos de la unidad que no tolera el soporte. La única forma de resolverlo es mediante el uso de una unidad diferente o un soporte diferente. Un programa diferente difícilmente ayudará.\n\nK3b con el backend wodim:\n\n```\nSense Bytes: 70 00 03 00 00 00 00 12 00 00 00 00 0C 00 00 00\nSense Key: 0x3 Medium Error, Segment 0\nSense Code: 0x0C Qual 0x00 (write error) Fru 0x0\n```\n\nBrasero con el backend growisofs:\n\n```\nBraseroGrowisofs stderr: :-[ WRITE@LBA=0h failed with SK=3h/ASC=0Ch/ACQ=00h]: Input/output error\n```\n\nBrasero con el backend libburn:\n\n```\nBraseroLibburn Libburn reported an error SCSI error on write(16976,16): [3 0C 00] Write error\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- RIAA and actual laws allow backup of physically obtained media under these conditions RIAA - the law.\n- Convert any Movie to DVD Video\n- Main page of the project Libburnia\n\n"
    }
  ]
}