{
  "title": "OSS (Español)",
  "url": "https://wiki.archlinux.org/title/OSS_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **La traducción de este artículo o sección no refleja el texto original.** La traducción de este artículo o sección no refleja el texto original.\n\nLa traducción de este artículo o sección no refleja el texto original.\n\nNote: **2013-10-04** \n\nEl Open Sound System (OSS) es una arquitectura de sonido alternativa para sistemas compatibles con UNIX y POSIX. OSS versión 3 era el sistema original de sonido para Linux y estaba incluido en el kernel hasta que fue reemplazado por Advanced Linux Sound Architecture (ALSA) en 2002, año en que la versión 4 de OSS se convirtió en un producto propietario. Luego, OSSv4 volvió a ser software libre en 2007 cuando 4Front Technologies liberó el código bajo licencia GPL.\n\n"
    },
    {
      "title": "Comparaciones con ALSA",
      "level": 2,
      "content": "A continuación se relacionan algunas ventajas y desventajas de OSS comparado con el uso de Advanced Linux Sound Architecture.\n\n"
    },
    {
      "title": "Ventajas de OSS (usuarios)",
      "level": 3,
      "content": "- Control sobre el nivel del volumen de cada aplicación.\n- Menor latencia debido a que todo se ejecuta dentro del kernel de Linux. El tiempo de respuesta inicial en las aplicaciones de audio, en la mayoría de los casos, es mejor.\n- OSS siempre dispone de mezcla de sonido, ALSA no.\n- La mezcla de sonido es de mayor calidad, debido a que OSS usa de forma más precisa las matemáticas en su mezcla de sonido.\n- Algunas tarjetas de sonido antiguas tienen mejor soporte.\n\n"
    },
    {
      "title": "Ventajas de OSS (desarrolladores)",
      "level": 3,
      "content": "- Suporte para el controlador en el espacio del usuario.\n- Accesibilidad. OSS también funciona con BSDs y Solaris.\n- El API es más limpio, más fácil de usar.\n\n"
    },
    {
      "title": "Ventajas de ALSA sobre OSS",
      "level": 3,
      "content": "- Mejor soporte para aparatos de audio USB.\n- Soporte para aparatos de audio Bluetooth.\n- Soporte para el software de modems AC'97 y HD Audio.\n- Mejor soporte para aparatos MIDI.\n- Soporte para suspender.\n- Mejor soporte para detección de clavijas (jack).\n\n- OSS tiene soporte de salida experimental para dispositivos de audio USB, pero no de entrada.\n- OSS soporta dispositivos MIDI con la ayuda de un sintetizador de software como Timidity o FluidSynth.\n\n"
    },
    {
      "title": "Instalacion",
      "level": 2,
      "content": "Instale ossAUR que está disponible en AUR. También hay una versión de desarrollo de OSS disponible en AUR con el paquete oss-gitAUR.\n\nEsto instalará OSS, ejecute el script de instalación de OSS (desactivando temporalmente los módulos de ALSA) e instale los módulos del kernel de OSS. Dado que ALSA está activado por defecto en los scripts de arranque, es necesario desactivarlo para que no entre en conflicto con OSS. Se puede hacer esto mediante la inclusión del módulo en blacklist:\n\n```\n/etc/modprobe.d/alsa_blacklist.conf\n```\n\n```\ninstall soundcore /bin/false\n```\n\nDespués del blacklisting del modulo, puede activar el daemon oss para que se inicie al arranque.\n\nSi su usuario no forma parte del grupo de audio, añádalo, y reinicie sesión para que los cambios tengan efecto:\n\n```\n# gpasswd -a $USER audio\n```\n\nEn caso de que OSS no pueda detectar su tarjeta de sonido cuando reinicie, ejecute:\n\n```\n# ossdetect -v\n# soundoff && soundon\n```\n\n"
    },
    {
      "title": "Comprobación",
      "level": 2,
      "content": "Comprobar OSS, ejecutando:\n\n```\n$ osstest\n```\n\nDebería oir música durante la prueba. Si no hay sonido, trate de ajustar el nivel del volumen o consulte la sección de solución de problemas.\n\nPara escuchar sonidos procedentes de más de una aplicación simultáneamente es necesario usar vmix, el software de mezcla de OSS.\n\nComprobar que vmix está habilitado, ejecutando:\n\n```\n$ ossmix -a | grep -i vmix\n```\n\nDebería ser posible ver una línea del tipo vmix0-enable ON|OFF (currently ON). Si no ve ninguna línea que inicie con vmix, probablemente significa que vmix no se ha conectado con el dispositivo de audio. Para conectar vmix, ejecute la orden:\n\n```\n$ vmixctl attach device\n```\n\ndonde device es la tarjeta de audio, por ejemplo, /dev/oss/oss_envy240/pcm0.\n\nPara evitar tener que volver a ejecutar esta orden manualmente en el futuro, puede agregarla en /usr/lib/oss/soundon.user, como se sugiere en este artículo.\n\nSi recibe el error «Device or resource busy» («Dispositivo o recurso ocupado»), debe agregar vmix_no_autoattach=1 en /usr/lib/oss/conf/osscore.conf y, seguidamente, reiniciar.\n\nVer qué dispositivos son reconocidos, ejecutando:\n\n```\n$ ossinfo\n```\n\nDebería ver una lista de los dispositivos en Device Objects o Audio Devices. Si el dispositivo que desea utilizar no se encuentra en la parte superior de estas secciones, debe editar el archivo /usr/lib/oss/etc/installed_drivers y colocar el controlador para el dispositivo en la parte superior. Puede ser necesario hacer un:\n\n```\n$ soundoff && soundon\n```\n\nSi esto no funciona, comente todos los controladores, excepto los que figuran para el dispositivo propio.\n\n"
    },
    {
      "title": "Control del Volumen con el Mezclador",
      "level": 2,
      "content": "Para controlar el nivel del volumen de los diferentes aparatos, se tienen que ajustar los niveles con los mixers. Hay dos mixers:\n\n- ossmix: un mixer en línea de comandos, similar al mixe de audio mixerctl de BSD.\n- ossxmix: un mixer gráfico basado en GTK+.\n\nLos controles primarios de ossxmix tendrán el siguiente aspecto:\n\n```\n/ High Definition Audio ALC262 \\    --------------------------------> 1\n/________________________________\\________________________________\n|                                                                 \\\n| [x] vmix0-enable [vmix0-rate: 48.000kHz]      vmix0-channels    |--> 2\n|                                               [ Stereo [v] ]    |\n|                                                                 |\n|  __codec1______________________________________________________ |\n| |  _jack______________________________________________________ ||--> 3\n| | |  _int-speaker_________________   _green_________________  |||\n| | | |                             | |                       | |||\n| | | |  _mode_____ | |             | |  _mode_____   | |     | |||\n| | | | [ mix [v] ] o o [x] [ ]mute | | [ mix  [v] ]  o o [x] | |||\n| | | |             | |             | |               | |     | |||\n| | | |_____________________________| |_______________________| |||\n| | |___________________________________________________________|||\n| |______________________________________________________________||\n| ___vmix0______________________________________________________  |\n| |  __mocp___  O O   _firefox_  O O  __pcm7___  O O            | |--> 4\n| | |         | O O  |         | x x |         | O O            | |\n| | | | |     | x O  | | |     | x x | | |     | O O            | |\n| | | o o [x] | x x  | o o [x] | x x | o o [x] | O O            | |\n| | | | |     | x x  | | |     | x x | | |     | O O            | |\n| | |_________| x x  |_________| x x |_________| O O            | |\n| |_____________________________________________________________| |\n|_________________________________________________________________|\n```\n\n1. Una pestaña por cada tarjeta de sonido.\n1. La configuración especifica de vmix (mixer virtual) aparece abajo. Eso incluye frecuencia de muestreo («sampling rate») y prioridad del mexclador («mixer priority»).\n1. Estas son las configuraciones (entrada y salida) de las tomas («jack») de la tarjeta de sonido. Cada controlador del mixer, que se muestra aquí, lo provee su propia tarjeta de sonido.\n1. Los controles del mezclador y los medidores del sonido de la aplicación vmix. Si la aplicación no produce ningún sonido será etiquetada como pcm08, pcm09..., y, en cuanto reproduzca algún sonido, aparecerá el nombre de la aplicación.\n\n"
    },
    {
      "title": "Definiciones de los Colores",
      "level": 3,
      "content": "Para el audio de alta definición (HD), ossxmix mostrará la configuración de cada toma (jack) coloreada según los siguientes colores predefinidos:\n\nTable content:\nColor | Tipo | Conector\nverde | canal frontal (salida estéreo) | 3.5mm TRS\nnegro | canal posterior (salida estéreo) | 3.5mm TRS\ngris | canal lateral (salida estéreo) | 3.5mm TRS\namarillo | central y subwoofer (salida dual) | 3.5mm TRS\nazul | línea de nivel (entrada estéreo) | 3.5mm TRS\nrosa | micrófono (entrada mono) | 3.5mm TS\n\n"
    },
    {
      "title": "Guardar los Niveles del Mezclador",
      "level": 3,
      "content": "Los niveles del mezclador se guardan cuando se apaga el equipo. Si desea guardar el nivel de sonido de inmediato, ejecute, como root:\n\n```\n# savemixer\n```\n\nsavemixer se puede utilizar para guardar los niveles del mixer en un archivo con el parámetro -f y restaurarlos con el parámetro -L.\n\n"
    },
    {
      "title": "Otros Mezcladores",
      "level": 3,
      "content": "Otras mixer soportados por OSS:\n\n- Gnome Volume Control — para GNOME.\n\n- Kmix — para KDE.\n\n- VolWheel — para LXDE.\n\n- Añada lo siguiente al archivo autostart de LXDE :\n\n```\necho \"volwheel\" >> ~/.config/lxsession/LXDE/autostart\n```\n\n- Pulse sobre el icono de la bandeja del sistema, eliga Preferencias y cambie: Driver: OSS. Default Channel: vmix0-outvol (averigue qué canal de salida va a utilizar desde ossmix). Default Mixer: ossxmix. En la pestaña MiniMixer (opcional), añada vmix0-outvol y opcionalmente otros.\n\n- Driver: OSS.\n- Default Channel: vmix0-outvol (averigue qué canal de salida va a utilizar desde ossmix).\n- Default Mixer: ossxmix.\n- En la pestaña MiniMixer (opcional), añada vmix0-outvol y opcionalmente otros.\n\n"
    },
    {
      "title": "Aplicaciones que usan Gstreamer",
      "level": 3,
      "content": "Si tiene problemas con las aplicaciones que usan Gstreamer para audio, pruebe eliminando pulseaudio, e instalando el paquete gstreamer0.10-good-pluginsAUR[enlace roto: package not found] que es requerido por oss4sink y oss4src.\n\nPuede cambiar la configuración de GStreamer a fin de enviar el sonido a OSS, en lugar de a ALSA por defecto, con gstreamer-properties. Después de iniciar gstreamer-properties, se tienen que modificar las opciones de la siguiente manera:\n\n- en la sección Default Output: si OSS no está disponible como un plugin, cambie Plugin por Custom y Pipeline por oss4sink.\n- en la sección Default Input: si OSS no está disponible, cambie Plugin por Custom y Pipeline por oss4src.\n\nPara algunas aplicaciones (por ejemplo, Rhythmbox, Totem) las configuraciones ajustadas para gstreamer-properties no tienen ningún efecto, ya que se basan en musicaudiosink en lugar de audiosink (el cual es modificado por gstreamer-properties).\n\nUna posible solución puede consistir en ajustar los valores para audiosink con gstreamer-properties y usar gconf-editor para copiar el valor de /system/gstreamer/0.10/default/audiosink a musicaudiosink (en el mismo lugar).\n\nSi está utilizando Phonon con el backend GStreamer tendrá que establecer la variable del entorno correspondiente:\n\n```\nexport PHONON_GST_AUDIOSINK=oss4sink\n```\n\nAgregue esta orden al archivo ~/.bashrc para cargarlo al iniciar sesión.\n\n"
    },
    {
      "title": "Aplicaciones que usan OpenAL",
      "level": 3,
      "content": "Por defecto OpenAL utiliza ALSA. Para cambiar esto, simplemente defina que va a usar OSS en /etc/openal/alsound.conf:\n\n```\n/etc/openal/alsound.conf\n```\n\n```\ndrivers=oss\n```\n\n"
    },
    {
      "title": "Audacity",
      "level": 3,
      "content": "Si Audacity se inicia, pero se queja de que no puede abrir el dispositivo o simplemente no funciona nada, entonces puede que esté utilizando vmix, ya que Audacity espera hasta tener el acceso exclusivo al dispositivo de sonido. Para solucionar este problema, antes de iniciar audacity, ejecute:\n\n```\n$ ossmix vmix0-enable OFF\n```\n\nPuede restaurar vmix, después de terminar con audacity, ejecutando:\n\n```\n$ ossmix vmix0-enable ON\n```\n\n"
    },
    {
      "title": "Gajim",
      "level": 3,
      "content": "Por defecto, Gajim usa aplay -q para reproducir sonido. Para OSS puede cambiarlo por el equivalente ossplay -qq, para lo cual vaya a Editar > Preferencias > Avanzado, y abra Editar Configuración Avanzada y modifique la variable soundplayer en consecuencia.\n\n"
    },
    {
      "title": "MOC",
      "level": 3,
      "content": "Para utilizar MOC con OSS v4.1 debe cambiar la sección OSSMixerDevice en /dev/ossmix del archivo de configuración (ubicado en ~/.moc). Si tiene problemas con la interfaz pruebe cambiando OSSMixerChannel presionando w en mocp (para cambiar a mixer software).\n\n"
    },
    {
      "title": "MPD",
      "level": 3,
      "content": "MPD se configura a través de /etc/mpd.conf o ~/.mpdconf. Compruebe ambos archivos, en busca de algo que se parezca a:\n\n```\n/etc/mpd.conf\n```\n\n```\n...\naudio_output {\n    type    \"alsa\"\n    name    \"Some Device Name\"\n}\n...\n```\n\nSi encuentra una configuración de ALSA no comentada (esto es, las líneas que comienzan sin almohadilla #) como la de arriba, comente todas las salidas, o bórrelas, y añada lo siguiente:\n\n```\n/etc/mpd.conf\n```\n\n```\n...\naudio_output {\n    type    \"oss\"\n    name    \"Nombre del Dispositivo OSS\"\n}\n...\n```\n\nNo deberían ser necesarias configuraciones ulteriores para los demás usuarios. Sin embargo, si experimenta problemas (MPD no funciona correctamente después de que se haya reiniciado), o si prefiere tener un archivo de configuración específico (es decir, más configurado por el usuario, menos configurado automáticamente), la salida de audio para OSS puede ser específicamente configurada de la siguiente manera:\n\n- Primeramente ejecute:\n\n```\n$ ossinfo | grep /dev/dsp\n```\n\n- Busque una línea similar a /dev/dsp -> /dev/oss/<SOME_CARD_IDENTIFIER>/pcm0. Tome nota de <SOME_CARD_IDENTIFIER> y añada las líneas resaltadas en negrita a audio_output de OSS en el archivo de configuración MPD:\n\n```\n/etc/mpd.conf\n```\n\n```\n...\naudio_output {\n    type            \"oss\"\n    name            \"Nombre del Dispositivo OSS\"\n    device          \"/dev/oss/<SOME_CARD_IDENTIFIER>/pcm0\"\n    mixer_device    \"/dev/oss/<SOME_CARD_IDENTIFIER>/mix0\"\n}\n...\n```\n\nConsulte también: Music Player Daemon#System-wide configuration.\n\n"
    },
    {
      "title": "Mplayer",
      "level": 3,
      "content": "Si está utilizando la interfaz gráfica de usuario (SMplayer, GNOME MPlayer, etc.), es necesario cambiar la configuración de la salida de OSS en los ajustes de audio. Si usa MPlayer, desde la línea de comandos debe especificar la salida de sonido:\n\n```\n$ mplayer -ao oss /some/file/to/play.mkv\n```\n\nSi no quiere molestarse en escribirla una y otra vez, agregue ao=oss al propio archivo de configuración (~/.mplayer/config).\n\nConsulte también: MPlayer#Configuration.\n\n"
    },
    {
      "title": "VLC media player",
      "level": 3,
      "content": "Puede seleccionar OSS como la salida por defecto en las configuraciones de audio.\n\n"
    },
    {
      "title": "Wine",
      "level": 3,
      "content": "Para proporcionar soporte de OSS en Wine inicie:\n\n```\n$ winecfg\n```\n\ny, en la pestaña Audio, seleccione OSS Driver.\n\nConsulte también: Wine#Sound.\n\n"
    },
    {
      "title": "Otras aplicaciones",
      "level": 3,
      "content": "- Si no puede hacer funcionar una aplicación no listada aquí, pruebe buscando en la página Configurar Aplicaciones para OSSv4.\n- Busque los paquetes específicos para OSS usando pacman -Ss -- -oss o busque en AUR.\n\n"
    },
    {
      "title": "Usar las teclas multimedia con OSS",
      "level": 3,
      "content": "Una forma fácil de activar/desactivar el sonido y de subir/bajar el volumen es utilizar la secuencia de comandos (script) ossvol.\n\nDescárguelo y colóquelo en /usr/bin/ossvol.\n\nUna vez instalado, escriba:\n\n```\n$ ossvol -t\n```\n\npara silenciarlo, o:\n\n```\n$ ossvol -h\n```\n\npara ver los comandos disponibles.\n\nNote: **Bad mixer control name(987) 'vol'** \n\nSi desea utilizar las teclas multimedia con ossvol, consulte Extra keyboard keys y asegúrese de que están correctamente configuradas. Después puede utilizar, por ejemplo, Xbindkeys para asociarlo al script ossvol. Añada lo siguiente al archivo ~/.xbindkeysrc:\n\n```\n~/.xbindkeysrc\n```\n\n```\n# Toggle mute\n\"ossvol -t\"\n    m:0x0 + c:121\n    XF86AudioMute\n\n# Lower volume\n\"ossvol -d 2\"\n    m:0x0 + c:122\n    XF86AudioLowerVolume\n\n# Raise volume\n\"ossvol -i 2\"\n    m:0x0 + c:123\n    XF86AudioRaiseVolume\n```\n\ny, opcionalmente, cambie las teclas multimedia con los atajos que prefiera.\n\n"
    },
    {
      "title": "Modificar la frecuencia de muestreo",
      "level": 3,
      "content": "El cambio de la frecuencia de muestreo de salida no se hace evidente al principio. Las frecuencias de muestreo solo pueden ser modificadas por el superusuario y vmix no debe ser usado por ningún programa cuando se solicita un cambio. Antes de seguir alguno de estos pasos, asegúrese de utilizar un receptor/amplificador y altavoces de calidad y no simplemente lo altavoces del PC. Si está utilizando solamente los altavoces del ordenador, no se moleste en cambiar nada aquí, ya que no notará la diferencia.\n\nPor defecto, la frecuencia de muestreo es 48000Hz. Hay varias condiciones en las que es posible que desee cambiar esta situación. Depende todo de la utilización que se haga. Es conveniente ajustar la frecuencia de muestreo correspondiente a la fuente utilizada más a menudo. Si el equipo tiene que cambiar la frecuencia de muestreo de una fuente para adaptarla a la del hardware, es probable, aunque no se garantiza, que va a tener una pérdida de calidad de audio. Esto es más notable en el downsampling (submuestreo) (es decir, 96000Hz → 48000Hz ). Hay un artículo sobre este tema en «Stereophile» que ha sido discutido en la lista de correo «CoreAudio API» de Apple, por si desea obtener más información acerca de este tema.\n\nAlgunos ejemplos de frecuencias de muestreo:\n\nPara comprobar cuál es su frecuencia de muestreo actualmente configurada, ejecute\n\n```\nossmix | grep rate\n```\n\nProbablemente verá una salida como esta \"vmix0-rate <decimal value> (currently 48000) (Read-only)\"\n\nSi no ve vmix0-rate (o vmix1-rate, etc.), probablemente significa que vmix está desactivado. En ese caso, OSS usará la frecuencia requerida por el programa que utiliza el dispositivo, ignorando esta sección. Una excepción es la tarjeta Envy24 (y Envy24HT) que tiene un valor especial envy24.rate, lo que supone una función similar (consulte la página del manual de oss_envy24).\n\nPasos para efectuar el cambio:\n\n1. Primero, asegúrese de que su tarjeta es capaz de utilizar la nueva frecuencia. Ejecute ossinfo -v2 y vea si la frecuencia deseada está presente en Native sample rates.\n1. Como root, ejecute /usr/lib/oss/scripts/killprocs.sh. Tenga en cuenta que esto cerrará cualquier programa que actualmente tenga un canal de sonido abierto.\n1. Después que todos los programas que estaba utilizando vmix finalicen, ejecute como root: vmixctl rate /dev/dsp 96000, sustituyendo la frecuencia presente por la frecuencia deseada (y ossmix envy24.rate 96000 si fuera aplicable).\n1. Ejecute ossmix | grep rate y compruebe vmix0-rate <decimal value> (currently 96000) (Read-only) para ver si todo ha salido correctamente.\n1. Haga que los cambios sean permanentes añadiendo lo siguiente al archivo soundon.user:\n\n```\n/usr/lib/oss/soundon.user\n```\n\n```\n#!/bin/sh\n\nvmixctl rate /dev/dsp 96000\n# ossmix envy24.rate 96000 # uncomment if you have an Envy24(HT) card\n\nexit 0\n```\n\ny hágalo ejecutable:\n\n```\n# chmod +x /usr/lib/oss/soundon.user\n```\n\n"
    },
    {
      "title": "Un sencillo applet para la bandeja del sistema",
      "level": 3,
      "content": "Para aquellos que quieran un applet ligero de OSS en la bandeja del sistema consulte esto[enlace roto 2023-05-06].\n\nPara instalarlo:\n\n- Descargue el script[enlace roto 2022-09-22] con cualquier nombre que desee (por ejemplo ossvolctl)\n- Hágalo ejecutable:\n\n```\n$ chmod +x ossvolctl\n```\n\n- Y copielo en /usr/bin:\n\n```\n# cp ossvolctl /usr/bin/ossvolctl\n```\n\no:\n\n```\n# install -Dm755 ossvolctl /usr/bin/ossvolctl\n```\n\n"
    },
    {
      "title": "KDE",
      "level": 4,
      "content": "Cree un archivo para lanzar aplicaciones con el nombre ossxmix.desktop en el directorio local para lanzar aplicaciones (~/.local/share/applications/ e introduzca:\n\n```\n~/.local/share/applications/ossxmix.desktop\n```\n\n```\n[Desktop Entry]\nName=Open Sound System Mixer\nGenericName=Audio Mixer\nExec=ossxmix -b\nIcon=audio-card\nCategories=Application;GTK;AudioVideo;Player;\nTerminal=false\nType=Application\nEncoding=UTF-8\n```\n\nPara que se inicie automáticamente con el sistema, añádalo a la lista autostart del sistema en System Settings > System Administration > Startup and Shutdown > Autostart.\n\n"
    },
    {
      "title": "Gnome",
      "level": 4,
      "content": "Como root, cree el archivo /usr/local/bin/ossxmix_bg, con el siguiente contenido:\n\n```\n/usr/local/bin/ossxmix_bg\n```\n\n```\n#!/bin/sh\n\nexec /usr/bin/ossxmix -b\n```\n\nVaya a System > Preferences > Aplicaciones Start Up y:\n\n- Pinche en Agregar, escriba OSSMIX en el campo Nombre y la ruta /usr/local/bin/ossxmix_bg en el campo Comando; a continuación, pinche en el botón Agregar.\n\n- Reinicie la sesión para ver los cambios.\n\n"
    },
    {
      "title": "Guardar la salida de audio de un programa",
      "level": 3,
      "content": "- Grabar la salida de sonido de un programa.\n\n"
    },
    {
      "title": "Suspensión e hibernación",
      "level": 3,
      "content": "OSS no admite automáticamente la suspensión, lo que significa que es necesario detener manualmente OSS antes de suspender o hibernar y reiniciar después.\n\nOSS proporciona soundon y soundOff para activar y desactivar OSS, aunque todos los procesos que estén utilizando el sonido deben cesar primero.\n\nEl script siguiente es un método bastante básico para cerrar automáticamente OSS antes de la suspensión y recargarlo después.\n\n```\n/etc/pm/sleep.d/50osssound\n```\n\n```\n#!/bin/sh\n. \"${PM_FUNCTIONS}\"\n \nsuspend_osssound()\n{\n    /usr/lib/oss/scripts/killprocs.sh\n    /usr/sbin/soundoff\n}\n \nresume_osssound()\n{\n    /usr/sbin/soundon\n}\n \ncase \"$1\" in\n    hibernate|suspend)\n        suspend_osssound\n \t;;\n    thaw|resume)\n \tresume_osssound\n \t;;\n    *) exit $NA\n \t;;\nesac\n```\n\nGuarde el contenido del script (como root) en /etc/pm/sleep.d/50ossound y hágalo ejecutable:\n\n```\nchmod a+x /etc/pm/sleep.d/50ossound\n```\n\n"
    },
    {
      "title": "Cambiar la salida de sonido predeterminada",
      "level": 3,
      "content": "Cuando se ejecuta osstest, la primera prueba se supera por el primer canal, pero no por el canal de la derecha o por los canales estéreos, en los cuales el sonido sale distorsionado y/o silbante. Si sucede esto es que ha sido asignada la salida de audio equivocada.\n\n```\n*** Scanning sound adapter #-1 ***\n/dev/oss/oss_hdaudio0/pcm0 (audio engine 0): HD Audio play front\n- Performing audio playback test... \n<left> OK <right> OK <stereo> OK <measured srate 47991.00 Hz (-0.02%)>\n```\n\nLa izquierda suena bien, el derecho y estéreo suenan distorsionados.\n\nDeje que la prueba continúe hasta obtener una salida que funcione:\n\n```\n/dev/oss/oss_hdaudio0/spdout0 (audio engine 5): HD Audio play spdif-out \n- Performing audio playback test... \n<left> OK <right> OK <stereo> OK <measured srate 47991.00 Hz (-0.02%)>\n```\n\nSi se supera la prueba en todos los canales, izquierdo, derecho y estéreo, proceda con el siguiente paso.\n\nPara cambiar las órdenes de salida por defecto consulte este artículo de la wiki de OSS. Cambie la configuración por la que se ajuste a su caso, por ejemplo:\n\n```\n# ln -sf /dev/oss/oss_hdaudio0/spdout0 /dev/dsp_multich\n```\n\nPara obtener un sonido envolvente (4.0-7.1) seleccione dsp_multich, con solo 2 canales, dsp debería funcionar. Consulte esto para conocer todos los dispositivos disponibles.\n\n"
    },
    {
      "title": "Creative Sound Blaster X-Fi Surround 5.1 USB SB1090",
      "level": 3,
      "content": "Esta información proviene del 4front-tech foro.\n\nEs sorprendente saber que la tarjeta externa no funciona solo a causa de la ausencia del valor de retorno true en la función write_control_value(...) en ossusb_audio.c.\n\nPara solucionar este problema, es necesario una recompilación de OSS, por ahora.\n\n- Obtenga la última versión de OSS desde los AUR\n\nhttps://aur.archlinux.org/cgit/aur.git/tree/?h=oss\n\n- Extráigalo.\n- Para ir a la carpeta de destino utilice la orden cd\n- Ejecute makepkg --nobuild\n- Vaya a la carpeta src/kernel/drv/oss_usb/ con la orden cd y edite ossusb_audio.c: añada return 1;. Debería quedar así:\n\n- Debería quedar así:\n\n```\nossusb_audio.c\n```\n\n```\nstatic int\nwrite_control_value (ossusb_devc * devc, udi_endpoint_handle_t * endpoint,\n                     int ctl, int l, unsigned int v)\n{\n     return 1;\n...\n```\n\n- Vaya a la carpeta src/kernel/setup con cd y edite srcconf_linux.inc, busque -Werror y elimínelo, de lo contrario OSS no se compilará.\n- Haga makepkg --noextract\n\nAhora hay que instalar el paquete con pacman -U. Remueva primero OSS si ya está instalado.\n\n"
    },
    {
      "title": "Emular ALSA",
      "level": 3,
      "content": "Es posible configurar alsa-lib para utilizar OSS como su sistema de audio de salida. Esto funciona como una especie de emulación de ALSA.\n\nNótese, sin embargo, que este método puede introducir una latencia adicional en el sonido de salida, y que la emulación no es completa y no funciona con todas las aplicaciones. No funciona, por ejemplo, con los programas que tratan de detectar los dispositivos que usan ALSA.\n\nAsí que, como la mayoría de las aplicaciones son compatibles con OSS directamente, utilice este método solo como último recurso.\n\nEn el futuro, estarán disponibles métodos más completos para emular ALSA, como libsalsa y cuckoo.\n\n"
    },
    {
      "title": "Instrucciones",
      "level": 4,
      "content": "- Instale el paquete alsa-plugins, disponible en los repositorios oficiales.:\n\n- Modifique el archivo /etc/asound.conf como sigue:\n\n```\npcm.oss {\n   type oss\n    device /dev/dsp\n}\n\npcm.!default {\n    type oss\n    device /dev/dsp\n}\n\nctl.oss {\n    type oss\n    device /dev/mixer\n}\n\nctl.!default {\n    type oss\n    device /dev/mixer\n}\n```\n\n"
    },
    {
      "title": "Configurar el controlador específico",
      "level": 3,
      "content": "Si algo no funciona, existe la posibilidad de que se deba a algunos ajustes de OSS para el controlador específico o simplemente son inadecuados para el controlador.\n\nPara solucionarlo:\n\n- Averigüe qué controlador se utiliza:\n\n```\n$ lspci -vnn | grep -i -A 15 audio\n```\n\n```\n00:1e.2 Multimedia audio controller [0401]: Intel Corporation 82801FB/FBM/FR/FW/FRW (ICH6 Family) AC'97 Audio Controller [8086:266e] (rev 03)\nSubsystem: Hewlett-Packard Company NX6110/NC6120 [103c:099c]\nFlags: bus master, medium devsel, latency 0, IRQ 21\nI/O ports at 2100 [size=256]\nI/O ports at 2200 [size=64]\nMemory at d0581000 (32-bit, non-prefetchable) [size=512]\nMemory at d0582000 (32-bit, non-prefetchable) [size=256]\nCapabilities: <access denied>\nKernel driver in use: *oss_ich*\nKernel modules: snd-intel8x0\n```\n\n- Localice el archivo de configuración del dispositivo en:\n\n```\n# cd /usr/lib/oss/conf/\n```\n\n- Trate de cambiar los valores predeterminados. Hay solo unos pocos ajustes, y son fáciles de entender.\n\nPor ejemplo, al configurar:\n\n```\nich_jacksense = 1\n```\n\nen oss_ich.conf, enciende jack-sense (que es responsable de reconocer los auriculares conectados y silenciar el altavoz). Otros ajustes parajack-sense se encuentra en hdaudio.conf donde hay que cambiar la variable hdaudio_jacksense.\n\n- Reinicie el daemon oss para que los cambios surtan efecto.\n\n"
    },
    {
      "title": "Conocer la causa del problema",
      "level": 4,
      "content": "Si se dispone de un dispositivo de sonido HD Audio, es muy probable que tenga que ajustar algunos parámetros del mezclador antes de que el audio funcione correctamente.\n\nLos dispositivos HD Audio son muy potentes en el sentido de que pueden contener una gran variedad de pequeños circuitos (llamados widgets) que pueden ser ajustado vía software en cualquier momento. Estos controles están disponibles en el mixer, y se pueden utilizar, por ejemplo, para activar una toma de auriculares reasignándolo como una toma de entrada de sonido en lugar de una toma de salida de sonido.\n\nSin embargo, esto es un problema secundario, el gran problemas está, sobre todo, en que el estándar HD Audio es más flexible de lo que, tal vez, debería ser, ya que los vendedores, a menudo, solo se preocupan de conseguir el correcto funcionamiento de sus driver oficiales.\n\nLuego, cuando se utilizan dispositivos HD Audio, a menudo se encuentran controles del mezclador desorganizados que no funcionan en absoluto para ninguna de las configuraciones por defecto, siendo necesario probar todas las combinaciones posibles de los controles del mixer hasta alcanzar una configuración que funcione.\n\n"
    },
    {
      "title": "Cómo resolverlo",
      "level": 4,
      "content": "Abra ossxmix y trate de cambiar todos los controles del mezclador en el área central («middle area»), que contiene los controles específicos de las tarjetas de sonido, tal como se explica en la sección anterior Control de volumen.\n\nProbablemente esté interesado en configurar un programa para grabar/reproducir continuamente en segundo plano (por ejemplo, ossrecord - | ossplay - para grabar, o osstest -lV para reproducir), mientras se está cambiando la configuración del mezclador con ossxmix en primer plano.\n\n- Suba cada deslizador de los controles del volumen.\n- En cada cuadro de opción, trate de cambiar la opción seleccionada, probando todas las combinaciones posibles.\n- Si se obtiene ruido, trate de bajar y/o silenciar algunos controles del volumen, hasta encontrar la fuente del ruido.\n- Edite el archivo /usr/lib/oss/conf/oss_hdaudio.conf, quite los comentarios (#) y modifique hdaudio_noskip=0 con un valor de 0 a 7, lo cual le va a permitir disponer de más opciones relativas a las clavijas en ossxmix.\n\nNote: **oss** \n\n"
    },
    {
      "title": "Sonido distorsionado con los MMS en Totem",
      "level": 3,
      "content": "Si los flujos tienen un sonido distorsionado o producen ruidos extraños en Totem, es posible probar reproducir con otro backend como FFmpeg. Esto no va a solucionar el problema, que de alguna manera aparece en GStreamer durante la reproducción de secuencias de MMS, pero se le dará la opción de reproducir con buena calidad de sonido. Reproducir con MPlayer es simple:\n\n```\n# mplayer mmsh://yourstreamurl\n```\n\n"
    },
    {
      "title": "El Micrófono funciona a través de los altavoces",
      "level": 3,
      "content": "OSS, por defecto, reproduce el micrófono a través de los altavoces. Para deshabilitar esta función busque en ossxmix la sección Misc. Marque cada input-mix-mute para desactivarla.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Web oficial\n- Wiki de OSS\n- Foro de OSS\n- Información sobre desarrollo\n- Repositorio Git\n- Lista de correo de opensound-devel\n\n"
    }
  ]
}