{
  "title": "Packet Tracer (Português)",
  "url": "https://wiki.archlinux.org/title/Packet_Tracer_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Cisco Packet Tracer é um poderoso programa de simulação de rede que permite aos alunos experimentar o comportamento da rede e fazer perguntas do tipo “e se”. Como parte integrante da experiência de aprendizado abrangente da Networking Academy, o Packet Tracer fornece recursos de simulação, visualização, autoria, avaliação e colaboração e facilita o ensino e o aprendizado de conceitos tecnológicos complexos. Fonte\n\n"
    },
    {
      "title": "Aviso legal",
      "level": 2,
      "content": "Entenda se você tem permissão da Cisco Systems para usar este software. Se você não atender à elegibilidade, interrompa seu progresso e considere alternativas como GNS3.\n\n"
    },
    {
      "title": "Baixar o tarball do pacote fonte",
      "level": 3,
      "content": "packettracerAUR não pode ser instalado usando métodos automatizados (por exemplo, auxiliares do AUR) porque o tarball do software deve ser baixado antes de compilar o pacote.\n\nEntão, primeiro adquira os arquivos de compilação para o pacote packettracerAUR.\n\n"
    },
    {
      "title": "Baixar o pacote deb do Packet Tracer",
      "level": 3,
      "content": "É hora de baixar o pacote deb do Packet Tracer distribuído no site da Cisco para que possa ser usado para compilar o packettracerAUR para Arch Linux.\n\n1. Faça login em Cisco Networking Academy (netcad) usando sua conta Cisco. Registre uma conta se você não tiver.\n1. Uma vez no portal Networking Academy, baixe o Packet Tracer no menu Resources > Download Packet Tracer (você deve acessar aqui). O nome do arquivo baixado deve ser algo como PacketTracer_800_amd64_build212_final.deb.\n1. Coloque o arquivo .deb dentro da pasta onde os arquivos de compilação do packettracerAUR estão localizados—que é a mesma pasta onde o arquivo PKGBUILD está localizado.\n\n"
    },
    {
      "title": "Compilar e instalar",
      "level": 3,
      "content": "Com todos os arquivos de compilação e o arquivo deb prontos, é hora de compilar e instalar:\n\n1. Altere o diretório para onde os arquivos de compilação (por exemplo, PKGBUILD) estão (se você ainda não estiver lá)\n1. Compile o pacote; alternativamente, compile em um \"chroot\" limpo\n1. Instale o pacote.\n\n"
    },
    {
      "title": "Contrato de licença de usuário final",
      "level": 3,
      "content": "Por fim, leia o arquivo de direitos autorais em /usr/share/licenses/packettracer/COPYRIGHT para o contrato de licença de usuário final (em inglês, End-user License Agreement - EULA) e o contrato suplementar de licença de usuário final (em inglês, Supplemental End-user License Agreement - SEULA) e desinstale se você não concordar com eles. Se você concordar, o programa pode ser encontrado na maioria dos sistemas de menu na categoria Internet, ou você executa o binário packettracer.\n\n"
    },
    {
      "title": "Verificação do ambiente de avaliação",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nA verificação do ambiente de avaliação (Assessment Environment Check) baseada no Cisco Packet Tracer é usada para confirmar que os alunos podem iniciar as atividades do rastreador de pacotes para avaliações como prática e exames finais. É fundamental que você tenha uma versão funcional do Java instalada. Realize a verificação em https://assessment.netacad.net/check/check.html para confirmar se essa capacidade é funcional ou não.\n\n```\njavaws PT-Assessment-Client.jnlp\n```\n\n"
    },
    {
      "title": "Travamentos no Wayland",
      "level": 3,
      "content": "Se o Packet Tracer travar quando iniciado em uma sessão Wayland, tente executá-lo com a variável de ambiente QT_QPA_PLATFORM definida como xcb. Veja Wayland (Português)#Qt para mais detalhes.\n\n"
    },
    {
      "title": "Tamanho incorreto da interface de usuário",
      "level": 3,
      "content": "Se o Packet Tracer renderizar o tamanho incorreto, tente modificar a variável de ambiente QT_DEVICE_PIXEL_RATIO e reinicie ou faça logout.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- GNS3\n- Cisco Packet Tracer - Networking Academy\n- Cisco Packet Tracer-based Assessment Environment Check\n- Packet Tracer -- vídeo para visualização do processo de instalação\n\n"
    }
  ]
}