{
  "title": "Packager (Español)",
  "url": "https://wiki.archlinux.org/title/Packager_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nNote: **2020-03-10** \n\nEsta página está destinada a desmitificar los términos comunes utilizados en la comunidad Arch Linux. Siéntase libre de agregar o modificar cualquier término, pero utilice la opción de edición de esa sección en particular. Si decide agregar uno, póngalo en orden alfabético.\n\n"
    },
    {
      "title": "ABS",
      "level": 2,
      "content": "ABS significa Arch Build System y puede usarse para:\n\n- La creación de nuevos paquetes para software que aún no dispone de ellos.\n- Personalizar/modificar paquetes existentes para satisfacer sus necesidades: Habilitar/deshabilitar opciones de tiempo de compilación. Aplicar cambios de código fuente a través de parches.\n- Reconstruir todo su sistema usando marcadores, \"a la Gentoo\"\n- Hacer que los módulos del núcleo funcionen con su núcleo personalizado.\n\n- Habilitar/deshabilitar opciones de tiempo de compilación.\n- Aplicar cambios de código fuente a través de parches.\n\nABS no es necesario para usar Arch Linux, pero es útil.\n\n"
    },
    {
      "title": "Arch Linux",
      "level": 2,
      "content": "Esto puede referirse a:\n\n- Arch Linux\n- Arch (Linux implícito)\n- archlinux (nombre UNIX)\n\nArchlinux, ArchLinux, archLinux, aRcHlInUx, etc. son todas ellas raras y más extrañas mutaciones.\n\nOficialmente, el 'Arch' en \"Arch Linux\" se pronuncia /ˈɑrtʃ/ como en \"archienemigo\" o \"archivo\". No \"Ark\".\n\n"
    },
    {
      "title": "Arch Linux Archive",
      "level": 2,
      "content": "El Arch Linux Archive (ALA), formalmente conocido como Arch Linux Rollback Machine (ARM), almacena instantáneas de repositorios oficiales, imágenes ISO y archivos de arranque a lo largo del tiempo.\n\n"
    },
    {
      "title": "AUR",
      "level": 2,
      "content": "El Arch User Repository (repositorio de usuarios de Arch), es un repositorio manejado por la comunidad de usuarios de Arch. Contiene descripciones de paquetes (PKGBUILDs) que le permiten compilar un paquete a partir de código fuente con makepkg y luego instalarlo vía pacman. El AUR fue creado para organizar y compartir nuevos paquetes de la comunidad y para ayudar a acelerar la inclusión de paquetes populares en el repositorio community.\n\nUna buena cantidad de paquetes nuevos que ingresan a los repositorios oficiales nacen en el AUR. En la AUR, los usuarios pueden contribuir con sus propias compilaciones de paquetes (PKGBUILD y archivos relacionados). La comunidad AUR tiene la capacidad de votar a favor o en contra de los paquetes en AUR. Si un paquete se vuelve lo suficientemente popular — siempre que tenga una licencia compatible y una buena técnica de empaque — puede incluírse en el repositorio community (accesible directamente a través de pacman o abs).\n\nPuede acceder aquí al repositorio comunitario de usuarios de Arch Linux.\n\n"
    },
    {
      "title": "bbs",
      "level": 2,
      "content": "Bulletin board bystem (sistema de tablón de anuncios), aunque en el caso de Arch es solo el foro de soporte ubicado en https://bbs.archlinux.org.\n\n"
    },
    {
      "title": "communitiy/[community]",
      "level": 2,
      "content": "El repositorio community es donde los paquetes prefabricados se encuentran disponibles gracias a los usuarios de confianza (UC). Una gran mayoría de los paquetes de community, provienen del AUR.\n\n"
    },
    {
      "title": "core/[core]",
      "level": 2,
      "content": "El repositorio core contiene los pocos paquetes necesarios para un sistema Arch. Tiene todo lo necesario para disponer de un sistema de línea de comandos funcional.\n\n"
    },
    {
      "title": "custom/user repository",
      "level": 2,
      "content": "Cualquiera puede crear un repositorio y dejarlo online a disposición de otros usuarios. Para crearlo, se necesitan una serie de paquetes y un archivo de base de datos compatible con pacman para los mismos. Hospede sus archivos en algún servidor y cualquier persona podrá utilizarlo como un repositorio más.\n\nVéase repositorio local personalizado.\n\n"
    },
    {
      "title": "Developer",
      "level": 2,
      "content": "Desarrollador, semidiós trabajando para la mejora de Arch sin afán de lucro. Los Desarroladores sólo son superados por Judd Vinet y Aaron Griffin, quienes a su vez son superados por los tacos.\n\n"
    },
    {
      "title": "extra/[extra]",
      "level": 2,
      "content": "El conjunto de paquetes oficiales de Arch está bastante simplificado, sin embargo lo complementamos con un repositorio «extra» más grande y completo que contiene mucho del material que nunca llegó a nuestro grupo de paquetes esenciales. Este repositorio está en constante crecimiento con la ayuda de paquetes enviados por nuestra sólida comunidad. Aquí es donde se encuentran entornos de escritorio, gestores de ventanas y programas comunes.\n\n"
    },
    {
      "title": "initramfs",
      "level": 2,
      "content": "Véase mkinitcpio\n\n"
    },
    {
      "title": "initrd",
      "level": 2,
      "content": "Obsoleto. Hoy en día se usa frecuentemente como sinónimo de initramfs.\n\n"
    },
    {
      "title": "KISS",
      "level": 2,
      "content": "Acrónimo de Keep It Simple, Stupid (mantenlo simple, idiota). La simplicidad es un principio fundamental que Arch Linux procura mantener.\n\n"
    },
    {
      "title": "makepkg",
      "level": 2,
      "content": "Makepg creará paquetes para usted y leerá los metadatos requeridos por un archivo PKGBUILD. Todo lo que necesita es una plataforma Linux con capacidad de compilación, curl y algunos scripts. La ventaja de una compilación basada en script es que realmente solo haces el trabajo una vez. En cuanto está disponible el script de compilación para un paquete, solo se necesita ejecutar makepkg y este hará el resto: descargar y validar los archivos fuente, verificar las dependencias, configurar los ajustes de tiempo de compilación, compilar el paquete, instalarlo en una raíz temporal, hacer personalizaciones, generar metainformación y empaquetar todo para que pacman lo use.\n\n"
    },
    {
      "title": "namcap",
      "level": 2,
      "content": "Namcap es una utilidad de análisis de paquetes que busca problemas con los paquetes de Arch Linux o sus archivos PKGBUILD. Puede aplicar reglas a la lista de archivos, a los propios archivos o a archivos PKGBUILD individuales.\n\nLas reglas devuelven listas de mensajes. Cada mensaje puede ser uno de estos tres tipos: error, advertencia o información (piense en ellos como notas o comentarios). Los errores (designados por 'E:') son avisos que namcap está muy seguro de que están mal y deben corregirse. Las advertencias (designadas por 'W:') son cosas que namcap cree que deberían cambiarse, pero si sabe lo que está haciendo, puede dejarlas. La información (denominada 'I:') solo se muestra cuando se utiliza el argumento de información. Los mensajes informativos brindan información que podría ser útil pero que no es algo que deba cambiarse.\n\n"
    },
    {
      "title": "package",
      "level": 2,
      "content": "Un paquete es un archivo que contiene:\n\n- Todos los archivos (compilados) de una aplicación.\n- Metadatos acerca de la aplicación, como su nombre, versión, dependencias, ...\n- Archivos de instalación y directivas de pacman\n- Opcionalmente archivos extra para hacer su vida más fácil, tal como un script de inico/parada.\n\nEl administrador de paquetes de Arch pacman puede instalar, actualizar y eliminar esos paquetes. El uso de paquetes en lugar de compilar e instalar programas tiene varios beneficios:\n\n- Fácilmente actualizable: pacman actualizará paquetes existentes tan pronto como haya actualizaciones disponibles.\n- Comprobación de dependencias: pacman maneja las dependencias por usted, sólo necesita especificar el programa y pacman lo instala junto a cualquier otro programa que necesite.\n- Eliminación limpia: pacman conserva una lista de todos los archivos de un paquete. De ese modo, nunca quedan archvos olvidados o a la deriva cuando decidimos suprimir un paquete.\n\n"
    },
    {
      "title": "Package maintainer",
      "level": 2,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nVéase Mantenedor de paquetes.\n\n"
    },
    {
      "title": "pacman",
      "level": 2,
      "content": "El gestor de paquetes Pacman es una de las principales características distintivas de Arch Linux. Combina un formato de paquete binario simple con un build system fácil de usar. El objetivo de pacman es hacer posible administrar fácilmente los paquetes, ya sean de los repositorios oficiales o de las propias compilaciones del usuario.\n\npacman mantiene el sistema actualizado al sincronizar las listas de paquetes con el servidor maestro. Este modelo de servidor/cliente también permite al usuario descargar/instalar paquetes con un comando simple, completo con todas las dependencias requeridas.\n\nN.B.: Pacman fue escrito por Judd Vinet, el creador de Arch Linux. También se usa como una herramienta de administración de paquetes por otras distribuciones, como FrugalWare, Rubix, UfficioZero (en Italia, basado en Ubuntu) y, por supuesto, distribuciones basadas en Arch como Archie y AEGIS.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 2,
      "content": "Los PKGBUILDSs son pequeños scripts que se usan para compilar paquetes de Arch Linux. Ver Creating packages (Español) para más detalles.\n\n"
    },
    {
      "title": "repository/repo",
      "level": 2,
      "content": "El repositorio posee los paquetes pre-compilados de (normalmente) uno o más PKGBUILDs. Los repositorios oficiales están divididos en diferentes secciones para facilitar su mantenimiento. Pacman usa estos repositorios para buscar paquetes e instalarlos. Un repositorio puede ser local (por ejemplo en su propio PC) o remoto (los paquetes se descargan desde un servidor externo antes de ser instalados).\n\n"
    },
    {
      "title": "RTFM",
      "level": 2,
      "content": "RTFM, «Read The Fine Manual» (Lee el buen manual). Con este simple mensaje se responde a muchos usuarios novatos de Linux/Arch quienes preguntan sobre alguna funcionalidad de un programa cuando está claramente definida en su propio manual.\n\nNote: **R** \n\nA menudo se usa cuando un usuario no intenta encontrar una solución al problema por sí mismo. Si alguien le dice esto, no está tratando de ofenderle; simplemente está frustrado debido a su falta de esfuerzo.\n\nLo mejor que puede hacer si le dicen que haga esto es leer la página del manual.\n\n- Para leer la página del manual del programa para un programa en particular llamado PROGRAM-NAME, escriba esto en la línea de comando: man PROGRAM-NAME.\n\nSi no encuentra la respuesta a su pregunta en el manual del programa, hay más formas de encontrarla. Usted puede:\n\n- buscar en wiki\n- buscar en wiki\n- buscar en forum\n- buscar en mailing lists\n- buscar en web\n\n"
    },
    {
      "title": "testing/[testing]",
      "level": 2,
      "content": "Este es el repositorio donde se almacena la mayoría de paquetes/actualizaciones antes de su publicación en los repositorios principales, de modo que allí pueden ser probados en busca de errores o cualquier problema que se encuentre. Por defecto se encuentra deshabilitado pero se puede activar en /etc/pacman.conf\n\n"
    },
    {
      "title": "The Arch Way",
      "level": 2,
      "content": "El término no oficial usado tradicionalmente para referirse a los principios de Arch Linux fundamentales.\n\n"
    },
    {
      "title": "TU, Trusted User",
      "level": 2,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nUn usuario de confianza es alguien que mantiene el AUR y el repositorio [community]. Los usuarios de confianza pueden mover un paquete al repositorio [community] si ha sido votado como popular. Los usuario de confianza son elegidos por mayoría de votos entre los usuarios de confianza existentes.\n\nLos usuarios de confianza velan por las AUR Trusted User Guidelines y las TU by-laws\n\n"
    },
    {
      "title": "udev",
      "level": 2,
      "content": "udev proporciona un directorio dinámico de dispositivos que contiene sólo los archivos para dispositivos realmente presentes. Crea o elimina archivos de nodo de dispositivo en el directorio /dev, o renombra las interfaces de red.\n\nPor lo general, udev se ejecuta como udevd(8) y recibe uevents directamente del kernel si se agrega/elimina un dispositivo al/del sistema.\n\nSi udev recibe un evento de dispositivo, hace coincidir sus reglas configuradas con los atributos de dispositivo disponibles proporcionados en sysfs para identificar el dispositivo. Las reglas que coinciden pueden proporcionar información adicional del dispositivo o especificar un nombre de nodo del dispositivo y múltiples nombres de enlaces simbólicos e indicar a udev que ejecute programas adicionales como parte del manejo de eventos del dispositivo.\n\n"
    },
    {
      "title": "wiki",
      "level": 2,
      "content": "¡Esto! Un lugar donde encontrar documentación sobre Arch Linux. Cualquiera puede añadir y modificar la documentación.\n\n"
    }
  ]
}