{
  "title": "Package Maintainers (Français)",
  "url": "https://wiki.archlinux.org/title/Package_Maintainers_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Les Mainteneurs de paquets (précédemment appelé Trusted Users soit « Utilisateurs de confiance ») est un rôle officiel de l'équipe d'Arch Linux. Les mainteneurs de paquets remplissent les tâches suivantes :\n\n- Maintenir les paquets dans les dépôts officiels (à part le dépôt core).\n- Maintenir, gérer et surveiller le fonctionnement de l'AUR.\n\nLe terme générique « mainteneur de paquet » est également utilisé pour décrire toute personne qui maintient un paquet, quel que soit le dépôt, comme décrit dans Arch terminology#Package maintainer.\n\n"
    },
    {
      "title": "Comment puis-je devenir un Mainteneur de Paquets ?",
      "level": 2,
      "content": "Les exigences minimales pour devenir un Mainteneur de Paquets sont les suivantes :\n\n- connaître les bases des scripts shell\n- maintenir quelques paquets dans l'AUR avec des PKGBUILDs propres et de haute qualité\n- un minimum de participation à la communauté (liste de diffusion, forums, IRC)\n- maîtrise de la recherche sur le web\n- une idée générale du type de paquets que vous voulez maintenir (en fait, pourquoi voulez-vous devenir Mainteneur de Paquets ?).\n\nMême si vous pouvez devenir Mainteneur de Paquets en remplissant simplement ces conditions minimales, les personnes qui vous jugeront lors de la procédure de vote standard pourraient en attendre plus de vous. Par exemple :\n\n- implication dans le bug tracker (rapport, recherche, information)\n- patches pour les projets Arch\n- participation à quelques projets open-source (même si ce sont les vôtres).\n\nSi vous vous sentez toujours prêt à devenir un Mainteneur de Paquets après avoir lu ces lignes, la première étape est de trouver deux Mainteneur de Paquets qui acceptent de vous parrainer. Une fois parrainé, vous devez écrire une demande pleine d'inspiration signée avec votre clé GPG à la liste de diffusion aur-general.\n\nPour plus d'informations, voir le Règlement des Mainteneur de Paquets (en) et Directives pour les Mainteneur de Paquets (en).\n\n"
    },
    {
      "title": "Mainteneur de Paquets en activité",
      "level": 2,
      "content": "Consultez https://archlinux.org/people/package-maintainers/\n\n"
    },
    {
      "title": "Mainteneur de Paquets précédents",
      "level": 2,
      "content": "Consultez https://archlinux.org/people/package-maintainer-fellows/\n\n"
    }
  ]
}