{
  "title": "Pacman (বাংলা)",
  "url": "https://wiki.archlinux.org/title/Pacman_(%E0%A6%AC%E0%A6%BE%E0%A6%82%E0%A6%B2%E0%A6%BE)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\npacman প্যাকেজ ম্যানেজার হচ্ছে আর্চ লিনাক্সের নিজস্ব একটি উপাদান। এটি প্যাকেজের সাধারণ বাইনারি অবস্থাকে একটি সহজে ব্যবহারযোগ্য বিল্ড সিস্টেমে একত্রিত করে। প্যাকম্যান এর উদ্দেশ্য হচ্ছে প্যাকেজ ব্যবহারকে সহজলভ্য করা, হোক সেগুলো ওফিশিয়াল রিপোজিটরি থেকে অথবা ব্যবহারকারীর নিজস্ব তৈরি। প্যাকম্যান প্রধান সার্ভাররের সাথে প্যাকেজগুলোর সিঙ্ক্রোনাইজেশনের মাধ্যমে সিস্টেমকে হালনাগাদ রাখে। এছাড়া এই সার্ভার/ক্লায়েন্ট মডেল ব্যবহারকারীকে সাধারণ একটি কমান্ডের মাধ্যমে প্যাকেজসমূহ ডাউনলোড/ইন্সটল করার অনুমতি দেয়, এমনকি দরকারি নির্ভরশীল প্যাকেজগুলো (Package dependencies) সহ।\n\nপ্যাকম্যান প্যাকেজ ম্যানেজার লিখা/তৈরি করা হয়েছে সি প্রোগ্রামিং ল্যাঙ্গুয়েজ দ্বারা এবং এটি প্যাকেজিংয়ের জন্য bsdtar(1) টার ফরমেট ব্যবহার করে।\n\n"
    },
    {
      "title": "ব্যবহার",
      "level": 2,
      "content": "প্যাকম্যান হচ্ছে আর্চ লিনাক্সের প্যাকেজ ম্যানেজার বা ব্যবস্থাপক, যা সিস্টেমে নতুন প্যাকেজ ইন্সটল, হালনাগাদ এবং প্যাকেজ মুছে ফেলার কাজ সম্পাদন করে। আরে জানতে পড়ুন pacman(8)।\n\n"
    },
    {
      "title": "প্যাকেজ ইন্সটল করা",
      "level": 3,
      "content": "একটি প্যাকেজ হচ্ছে এমন সংরক্ষণাগার যেখানে রয়েছে:\n\n- সফটওয়্যারটির সকল সংকলিত (কম্পাইলড) ফাইলসমূহ।\n- সফটওয়্যারটির সকল খুঁটিনাটি তথ্য, যেমন সফটওয়্যারটির নাম, সফটওয়্যারটির সংস্করণ (ভার্সন) এবং সফটওয়্যারটি কোন কোন প্যাকেজগুলোর ওপর নির্ভরশীল (Dependency)।\n- ইন্সটলেশন ফাইল এবং প্যাকম্যানের জন্য দিকনির্দেশনা সমূহ।\n- (ঐচ্ছিক) অতিরিক্ত কিছু ফাইলস (Optional dependency) যা সফটওয়্যারটির ব্যবহারকে সহজ করতে পারে।\n\nসফটওয়্যার নিজে সংকলন (কম্পাইল) ও ইন্সটল না করে শুধুমাত্র প্যাকেজ ব্যবহারে রয়েছে বিভিন্ন সুবিধা:\n\n- সহজেই হালনাগাদ করা যায়: প্যাকম্যান সিস্টেমে বিদ্যমান প্যাকেজগুলোকে যত তাড়াতাড়ি হালনাগাদ আসে সেগুলোকে হালনাগাদ করে।\n- নির্ভরশীল প্যাকেজগুলো (Dependency) সামলানো: প্যাকম্যান স্বয়ংক্রিয়ভাবে সফটওয়্যারের ডিপেন্ডেন্সিগুলো সামাল দেয়, অর্থাৎ কোন প্যাকেজগুলো এই প্রোগ্রামটির জন্য প্রয়োজন। আপনাকে শুধুমাত্র প্রোগ্রামটির নাম বলে দিতে হবে এবং প্যাকম্যান প্রোগ্রামটিসহ এর সকল প্রয়োজনীয় প্যাকেজগুলো ইন্সটল করে নিবে।\n- পুরোপুরি মুছে ফেলা: একটি প্যাকেজে কতগুলো ফাইল রয়েছে প্যাকম্যানের কাছে সেটির সব তালিকা রয়েছে; এজন্য, কোনো প্যাকেজ মুছে ফেলার সময় অনাকাঙ্ক্ষিতভাবে এর কোনো ফাইল সিস্টেমে থেকে যাওয়ার সম্ভাবনা থাকে না।\n\n- প্যাকেজের হঠাৎ হঠাৎ অপশনাল ডিপেন্ডেন্সি থাকতে পারে, যেগুলো আ্যপলিকেশনটিকে বাড়তি কিছু সুবিধা দিয়ে থাকে কিন্তু আ্যপলিকেশনটি ব্যবহার করার জন্য অবশ্যই যে লাগবে তা না। যখন প্যাকেজ ইন্সটল করবেন, প্যাকম্যান প্যাকেজটির অপশনাল ডিপেন্ডেন্সিগুলোর তালিকা দেখাবে, কিন্তু সেগুলো pacman.log ফাইলে পাওয়া যাবে না। প্যাকেজের অপশনাল ডিপেন্ডেন্সি দেখার জন্য Pacman#Querying package databases কমান্ড ব্যবহার করুন।\n\n- কিছু কিছু ক্ষেত্রে দেখা যায় যে, আপনি একটি প্যাকেজ ইন্সটল করছেন যেটি আপনার বিশেষভাবে কোনো দরকার নেই, দরকার অন্যান্য প্যাকেজের (অপশনাল) ডিপেন্ডেন্সি হিসেবে, সেক্ষেত্রে ইন্সটল করার সময় --asdeps অপশনটি ব্যবহার করবেন। বিস্তারিত জানতে Pacman#Installation reason অংশটি দেখুন।\n\nNote: **u** \n\n"
    },
    {
      "title": "প্যাকেজ ইন্সটল করার পদ্ধতি",
      "level": 4,
      "content": "নির্দিষ্ট একটি প্যাকজ অথবা প্যাকেজের তালিকা (ডিপেন্ডেন্সি সহ) ইন্সটল করার জন্য এই কমান্ডটি ব্যবহার করুন:\n\n```\n# pacman -S package_name1 package_name2 ...\n```\n\nregex (Regular Expression) দিয়ে প্যাকেজসমূহ ইন্সটল করতে (আরো জানতে এই ফোরাম থ্রেডটি দেখুন):\n\n```\n# pacman -S $(pacman -Ssq package_regex)\n```\n\nকখনও কখনও একটি প্যাকেজের একাধিক ভার্শন বিভিন্ন রিপোজিটরিতে (e.g extra and testing) থাকতে পারে। ধরা যাক, extra রিপোজিটরির ভার্শনটি ইন্সটল করতে প্যাকেজের নামের আগে রিপোজিটরি অবশ্যই সংজ্ঞায়িত থাকতে হবে:\n\n```\n# pacman -S extra/package_name\n```\n\nএকই প্যাটার্নযুক্ত নামের প্যাকেজ ইন্সটল করার জন্য\n\n"
    }
  ]
}