{
  "title": "Pacman (Polski)",
  "url": "https://wiki.archlinux.org/title/Pacman_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article is being considered for redirection to pacman.** This article is being considered for redirection to pacman.\n\nThis article is being considered for redirection to pacman.\n\nNote: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nMenedżer pakietów pacman jest jedną z głównych cech wyróżniających Arch Linux. Łączy prosty format pakietu binarnego z łatwym w użyciu systemem budowania. Celem pacman jest umożliwienie łatwego zarządzania pakietami, niezależnie od tego, czy pochodzą one z oficjalnych repozytoriów, czy z własnych kompilacji użytkownika.\n\nPacman zapewnia aktualność systemu poprzez synchronizację list pakietów z serwerem głównym. Ten model serwer/klient umożliwia również użytkownikowi pobieranie/instalowanie pakietów za pomocą prostego polecenia, wraz ze wszystkimi wymaganymi zależnościami.\n\nPacman jest napisany w języku programowania C i do pakowania używa formatu bsdtar(1) tar.\n\n"
    },
    {
      "title": "Stosowanie",
      "level": 2,
      "content": "Poniżej znajduje się tylko niewielka próbka operacji, które może wykonać pacman. Aby przeczytać więcej przykładów, zobacz pacman(8).\n\n"
    },
    {
      "title": "Instalowanie pakietu",
      "level": 3,
      "content": "A package is an archive containing:\n\n- wszystkie (skompilowane) pliki aplikacji\n- metadane dotyczące aplikacji, takie jak nazwa aplikacji, wersja, zależności itp.\n- pliki instalacyjne i dyrektywy dla pacman.\n- (opcjonalnie) dodatkowe pliki ułatwiające życie, takie jak skrypt start/stop\n\nMenedżer pakietów Archa pacman może instalować, aktualizować i usuwać te pakiety. Korzystanie z pakietów zamiast samodzielnego kompilowania i instalowania programów ma wiele zalet:\n\n- łatwo aktualizowalny: pacman zaktualizuje istniejące pakiety, gdy tylko będą dostępne aktualizacje\n- sprawdzanie zależności: pacman obsługuje zależności za Ciebie, wystarczy określić program, a pacman zainstaluje go razem z każdym innym potrzebnym programem\n- czyste usuwanie: pacman ma listę wszystkich plików w pakiecie; w ten sposób żadne pliki nie zostaną przypadkowo pozostawione, gdy zdecydujesz się usunąć pakiet.\n\n- Pakiety często mają opcjonalne zależności, które są pakietami, które zapewniają dodatkową funkcjonalność aplikacji, ale nie są ściśle wymagane do jej uruchomienia. Podczas instalacji pakietu, pacman wyświetli listę opcjonalnych zależności pakietu, ale nie zostaną one znalezione w pacman.log. Użyj polecenia #Odpytywanie baz danych pakietów, aby wyświetlić opcjonalne zależności pakietu.\n- Podczas instalowania pakietu, który jest wymagany tylko jako (opcjonalna) zależność od innego pakietu (tzn. nie jest wymagany przez Ciebie wprost), zaleca się użycie opcji --asdeps. Aby uzyskać szczegółowe informacje, zobacz sekcję #Powód instalacji.\n\nNote: **not** \n\n"
    },
    {
      "title": "Instalowanie określonych pakietów",
      "level": 4,
      "content": "Aby zainstalować pojedynczy pakiet lub listę pakietów, w tym zależności, wydaj następujące polecenie:\n\n```\n# pacman -S package_name1 package_name2 ...\n```\n\nAby zainstalować listę pakietów z wyrażeniem regularnym (zobacz ten wątek na forum):\n\n```\n# pacman -S $(pacman -Ssq package_regex)\n```\n\nCzasami istnieje wiele wersji pakietu w różnych repozytoriach (np. extra i testing). Aby zainstalować wersję z extra repozytorium w tym przykładzie, repozytorium musi być zdefiniowane przed nazwą pakietu:\n\n```\n# pacman -S extra/package_name\n```\n\nAby zainstalować kilka pakietów o podobnych wzorach w nazwach, można użyć rozwinięcia nawiasów klamrowych. Na przykład:\n\n```\n# pacman -S plasma-{desktop,mediacenter,nm}\n```\n\nMożna to rozszerzyć na dowolną liczbę potrzebnych poziomów:\n\n```\n# pacman -S plasma-{workspace{,-wallpapers},pa}\n```\n\nPakiet wirtualny to specjalny pakiet, który sam nie istnieje, ale jest dostarczany przez jeden lub więcej innych pakietów. Pakiety wirtualne pozwalają innym pakietom nie nazywać określonego pakietu jako zależności, w przypadku kilku kandydatów. Pakiety wirtualne nie mogą być instalowane według ich nazwy, zamiast tego są instalowane w twoim systemie, gdy zainstalowałeś pakiet dostarczający pakiet wirtualny.\n\n"
    },
    {
      "title": "Instalowanie grup pakietów",
      "level": 4,
      "content": "Niektóre pakiety należą do grupy pakietów, z których wszystkie mogą być instalowane jednocześnie. Na przykład wydając polecenie:\n\n```\n# pacman -S gnome\n```\n\npoprosi Cię o wybranie pakietów z gnome gnome, które chcesz zainstalować.\n\nCzasami grupa pakietów będzie zawierać dużą liczbę pakietów, a może być tylko kilka, które chcesz lub nie chcesz instalować. Zamiast wprowadzać wszystkie liczby oprócz tych, których nie chcesz, czasami wygodniej jest wybrać lub wykluczyć pakiety lub zakresy pakietów o następującej składni:\n\n```\nEnter a selection (default=all): 1-10 15\n```\n\nktóry wybierze pakiety od 1 do 10 i 15 do instalacji lub:\n\n```\nEnter a selection (default=all): ^5-8 ^2\n```\n\nktóry wybierze wszystkie pakiety z wyjątkiem 5 do 8 i 2 do instalacji.\n\nAby zobaczyć, jakie pakiety należą do grupy gnome, uruchom:\n\n```\n# pacman -Sg gnome\n```\n\nOdwiedź także https://archlinux.org/groups/, aby zobaczyć, jakie grupy pakietów są dostępne.\n\n"
    },
    {
      "title": "Usuwanie pakietów",
      "level": 3,
      "content": "Aby usunąć pojedynczy pakiet, pozostawiając zainstalowane wszystkie jego zależności:\n\n```\n# pacman -R package_name\n```\n\nAby usunąć pakiet i jego zależności, które nie są wymagane przez żaden inny zainstalowany pakiet:\n\n```\n# pacman -Rs package_name\n```\n\nPowyższe może czasami odmówić uruchomienia podczas usuwania grupy zawierającej w inny sposób potrzebne pakiety. W takim przypadku spróbuj:\n\n```\n# pacman -Rsu package_name\n```\n\nAby usunąć pakiet, jego zależności i wszystkie pakiety zależne od pakietu docelowego:\n\n```\n# pacman -Rsc package_name\n```\n\nAby usunąć pakiet, który jest wymagany przez inny pakiet, bez usuwania pakietu zależnego:\n\n```\n# pacman -Rdd package_name\n```\n\nPacman zapisuje ważne pliki konfiguracyjne podczas usuwania niektórych aplikacji i nazywa je rozszerzeniem: .pacsave. Aby zapobiec tworzeniu tych plików kopii zapasowej, użyj opcji -n :\n\n```\n# pacman -Rn package_name\n```\n\n"
    },
    {
      "title": "Aktualizacja pakietów",
      "level": 3,
      "content": "- Oczekuje się, że użytkownicy będą postępować zgodnie ze wskazówkami w sekcji System maintenance#Upgrading the system, aby regularnie aktualizować swoje systemy i nie uruchamiać na ślepo następującego polecenia.\n\n- Arch obsługuje tylko pełne aktualizacje systemu. Zobacz Konserwacja systemu Częściowe aktualizacje są nieobsługiwane i Instalowanie pakietów[broken link: invalid section], aby uzyskać szczegółowe informacje.\n\nPacman może zaktualizować wszystkie pakiety w systemie za pomocą tylko jednej komendy. Może to zająć trochę czasu, w zależności od aktualnego stanu systemu. Poniższe polecenie synchronizuje bazy danych repozytoriów i aktualizuje pakiety systemu, z wyłączeniem pakietów „lokalnych”, których nie ma w skonfigurowanych repozytoriach:\n\n```\n# pacman -Syu\n```\n\n"
    },
    {
      "title": "Odpytywanie baz danych pakietów",
      "level": 3,
      "content": "Pacman wysyła zapytanie do lokalnej bazy danych pakietów z flagą -Q, bazy danych synchronizacji z flagą -S i bazy danych plików z flagą -F. Zobacz pacman -Q --help, pacman -S --help i pacman -F --help dla odpowiednich podopcji każdej flagi.\n\nPacman może wyszukiwać pakiety w bazie danych, przeszukując zarówno ich nazwy jak i opisy:\n\n```\n$ pacman -Ss string1 string2 ...\n```\n\nCzasami wbudowane ERE (Rozszerzone Wyrażenia Regularne) -s może powodować wiele niepożądanych wyników, więc musi być ograniczone tylko do nazwy pakietu; nie opis ani żadne inne pole:\n\n```\n$ pacman -Ss '^vim-'\n```\n\nAby wyszukać już zainstalowane pakiety:\n\n```\n$ pacman -Qs string1 string2 ...\n```\n\nAby wyszukać nazwy plików pakietów w pakietach zdalnych:\n\n```\n$ pacman -F string1 string2 ...\n```\n\nAby wyświetlić obszerne informacje o danym pakiecie:\n\n```\n$ pacman -Si package_name\n```\n\nW przypadku pakietów instalowanych lokalnie:\n\n```\n$ pacman -Qi package_name\n```\n\nPrzekazanie dwóch flag -i spowoduje również wyświetlenie listy plików kopii zapasowych i stanów ich modyfikacji:\n\n```\n$ pacman -Qii package_name\n```\n\nAby pobrać listę plików zainstalowanych przez pakiet:\n\n```\n$ pacman -Ql package_name\n```\n\nAby pobrać listę plików zainstalowanych przez pakiet zdalny:\n\n```\n$ pacman -Fl package_name\n```\n\nAby zweryfikować obecność plików zainstalowanych przez pakiet:\n\n```\n$ pacman -Qk package_name\n```\n\nDwukrotne przekazanie k spowoduje dokładniejsze sprawdzenie.\n\nAby móc sprawdzić bazę danych, aby dowiedzieć się, czy należy dany plik w systemie plików:\n\n```\n$ pacman -Qo /path/to/file_name\n```\n\nAby wysłać zapytanie do bazy danych, aby dowiedzieć się, do którego zdalnego pakietu należy plik:\n\n```\n$ pacman -F /path/to/file_name\n```\n\nAby wyświetlić wszystkie pakiety, które nie są już wymagane jako zależności (sieroty):\n\n```\n$ pacman -Qdt\n```\n\nAby wyświetlić listę wszystkich pakietów zainstalowanych jawnie i niewymaganych jako zależności:\n\n```\n$ pacman -Qet\n```\n\nZobacz Pacman/Tips and tricks, aby uzyskać więcej przykładów.\n\n"
    },
    {
      "title": "Pactree",
      "level": 4,
      "content": "Aby wyświetlić drzewo zależności pakietu:\n\n```\n$ pactree package_name\n```\n\nAby wyświetlić zależne drzewo pakietu, należy przekazać flagę reverse -r do pactree lub użyć whoneeds z pkgtoolsAUR\n\n"
    },
    {
      "title": "Struktura bazy danych",
      "level": 4,
      "content": "Bazy danych pacmana zwykle znajdują się w /var/lib/pacman/sync. Dla każdego repozytorium określonego w /etc/pacman.conf znajdzie się tam odpowiedni plik bazy danych. Pliki bazy danych to spakowane archiwa tar gzip zawierające jeden katalog na każdy pakiet, na przykład dla pakietu, which:\n\n```\n$ tree which-2.21-5\n```\n\n```\nwhich-2.21-5\n|-- desc\n```\n\nPlik desc zawiera metadane, takie jak opis pakietu, zależności, rozmiar pliku i skrót MD5.\n\n"
    },
    {
      "title": "Czyszczenie pamięci podręcznej pakietów",
      "level": 3,
      "content": "Pacman przechowuje pobrane pakiety w /var/cache/pacman/pkg/ i nie usuwa automatycznie starych lub odinstalowanych wersji. Ma to pewne zalety:\n\n1. Pozwala na obniżenie wersji pakietu bez konieczności odzyskiwania poprzedniej wersji za pomocą innych środków, takich jak Arch Linux Archive.\n1. Odinstalowany pakiet można łatwo ponownie zainstalować bezpośrednio z katalogu pamięci podręcznej, bez konieczności ponownego pobierania z repozytorium.\n\nJednak konieczne jest okresowe czyszczenie pamięci podręcznej, aby zapobiec nieskończonemu wzrostowi rozmiaru katalogu.\n\nSkrypt paccache(8), dostarczony w pakiecie pacman-contrib, domyślnie usuwa wszystkie buforowane wersje zainstalowanych i odinstalowanych pakietów, z wyjątkiem ostatnich trzech:\n\n```\n# paccache -r\n```\n\nEnable and start paccache.timer to discard unused packages weekly.\n\nMożesz także określić, ile ostatnich wersji chcesz zachować. Aby zachować tylko jedną poprzednią wersję, użyj:\n\n```\n# paccache -rk1\n```\n\nDodaj przełącznik -u/--uninstalled, aby ograniczyć działanie paccache do odinstalowanych pakietów. Na przykład, aby usunąć wszystkie buforowane wersje odinstalowanych pakietów, użyj następującego:\n\n```\n# paccache -ruk0\n```\n\nZobacz paccache -h, aby uzyskać więcej opcji.\n\nPacman ma również kilka wbudowanych opcji czyszczenia pamięci podręcznej i pozostałych plików bazy danych z repozytoriów, które nie są już wymienione w pliku konfiguracyjnym /etc/pacman.conf. Jednak pacman nie oferuje możliwości zachowania kilku poprzednich wersji i dlatego jest bardziej agresywny niż domyślne opcje paccache.\n\nAby usunąć wszystkie pakiety z pamięci podręcznej, które nie są obecnie zainstalowane, oraz nieużywaną bazę danych synchronizacji, wykonaj:\n\n```\n# pacman -Sc\n```\n\nAby usunąć wszystkie pliki z pamięci podręcznej, użyj dwukrotnie czystego przełącznika, jest to najbardziej agresywne podejście i nie pozostawi nic w katalogu pamięci podręcznej:\n\n```\n# pacman -Scc\n```\n\npkgcachecleanAUR and pacleanerAUR are two further alternatives to clean the cache.\n\n"
    },
    {
      "title": "Dodatkowe polecenia",
      "level": 3,
      "content": "Pobierz pakiet bez instalowania:\n\n```\n# pacman -Sw package_name\n```\n\nZainstaluj pakiet „lokalny”, który nie pochodzi ze zdalnego repozytorium (np. pakiet pochodzi z AUR):\n\n```\n# pacman -U /path/to/package/package_name-version.pkg.tar.zst\n```\n\nAby zachować kopię lokalnego pakietu w pamięci podręcznej pacman, użyj:\n\n```\n# pacman -U file:///path/to/package/package_name-version.pkg.tar.zst\n```\n\nZainstaluj pakiet „zdalny” (nie z repozytorium określonego w plikach konfiguracyjnych „pacmana”):\n\n```\n# pacman -U http://www.example.com/repo/example.pkg.tar.zst\n```\n\nTo inhibit the -S, -U and -R actions, -p can be used.\n\nPacman zawsze wyświetla listę pakietów do zainstalowania lub usunięcia i prosi o pozwolenie przed podjęciem działań.\n\n"
    },
    {
      "title": "Powód instalacji",
      "level": 3,
      "content": "Baza danych pacman dzieli zainstalowane pakiety na dwie grupy, w zależności od powodu instalacji:\n\n- zainstalowane-jawnie: pakiety, które zostały dosłownie przekazane do ogólnego polecenia pacman -S lub -U;\n- zależności: pakiety, które pomimo tego, że nigdy (ogólnie) nie zostały przekazane do polecenia instalacji pacmana, zostały zainstalowane niejawnie, ponieważ były wymagane przez pakiety zainstalowane jawnie.\n\nPodczas instalacji pakietu można wymusić „zależność” jego powodu instalacji z:\n\n```\n# pacman -S --asdeps package_name\n```\n\nPolecenie jest zwykle używane, ponieważ pakiety zainstalowane jawnie mogą oferować pakiety opcjonalne, zwykle dla nieistotnych funkcji, co do których użytkownik może według własnego uznania.\n\nJednak podczas ponownej instalacji pakietu domyślnie zachowywany jest bieżący powód instalacji.\n\nThe list of explicitly-installed packages can be shown with pacman -Qe, while the complementary list of dependencies can be shown with pacman -Qd.\n\nAby zmienić powód instalacji już zainstalowanego pakietu, wykonaj:\n\n```\n# pacman -D --asdeps package_name\n```\n\nUżyj --asexplicit, aby wykonać odwrotną operację.\n\n"
    },
    {
      "title": "Wyszukaj pakiet zawierający określony plik",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with pacman/Tips and tricks.** This article or section is a candidate for merging with pacman/Tips and tricks.\n\nThis article or section is a candidate for merging with pacman/Tips and tricks.\n\nZsynchronizuj bazę danych plików:\n\n```\n# pacman -Fy\n```\n\nWyszukaj pakiet zawierający plik, np.:\n\n```\n$ pacman -F pacman\n```\n\n```\ncore/pacman 5.2.1-1 (base base-devel) [installed]\n    usr/bin/pacman\n    usr/share/bash-completion/completions/pacman\nextra/xscreensaver 5.43-1\n    usr/lib/xscreensaver/pacman\n```\n\nAby uzyskać zaawansowane funkcje, zainstaluj pakiet pkgfile, który korzysta z oddzielnej bazy danych ze wszystkimi plikami i powiązanymi z nimi pakietami.\n\n"
    },
    {
      "title": "Co się dzieje podczas instalacji/aktualizacji/usuwania pakietu?",
      "level": 3,
      "content": "Po pomyślnym przebiegu transakcji przepływ pracy obejmuje pięć etapów wysokiego poziomu oraz punkty zaczepienia przed/po transakcji:\n\n1. Zainicjuj transakcję, jeśli nie ma blokady bazy danych\n1. Wybierz, które pakiety zostaną dodane lub usunięte w transakcji\n1. Przygotuj transakcję w oparciu o flagi, wykonując testy poprawności w bazach danych synchronizacji, pakietach i ich zależnościach\n1. Zatwierdź transakcję: W stosownych przypadkach pobierz pakiety (_alpm_sync_load) Jeśli mają zastosowanie istniejące wcześniej hooki pacman PreTransaction, są one wykonywane. Usuwane są pakiety, które mają zostać zastąpione, są w konflikcie lub są wyraźnie przeznaczone do usunięcia Jeśli są pakiety do dodania, każdy pakiet jest zatwierdzony If the package has an install script, its pre_install function is executed (or pre_upgrade or pre_remove in the case of an upgraded or removed package). Pacman deletes all the files from a pre-existing version of the package (in the case of an upgraded or removed package). However, files that were marked as configuration files in the package are kept (see /Pacnew and Pacsave). Pacman rozpakowuje pakiet i zrzuca swoje pliki do systemu plików (w przypadku zainstalowanego lub zaktualizowanego pakietu). Pliki, które zastąpiłyby zachowane i ręcznie zmodyfikowane pliki konfiguracyjne (patrz poprzedni krok), są przechowywane pod nową nazwą (.pacnew). If the package has an install script, its post_install function is executed (or post_upgrade or post_remove in the case of an upgraded or removed package). If pacman PostTransaction hooks that exist at the end of the transaction apply, they are executed.\n1. Release the transaction and transaction resource (i.e. database lock)\n\n1. W stosownych przypadkach pobierz pakiety (_alpm_sync_load)\n1. Jeśli mają zastosowanie istniejące wcześniej hooki pacman PreTransaction, są one wykonywane.\n1. Usuwane są pakiety, które mają zostać zastąpione, są w konflikcie lub są wyraźnie przeznaczone do usunięcia\n1. Jeśli są pakiety do dodania, każdy pakiet jest zatwierdzony If the package has an install script, its pre_install function is executed (or pre_upgrade or pre_remove in the case of an upgraded or removed package). Pacman deletes all the files from a pre-existing version of the package (in the case of an upgraded or removed package). However, files that were marked as configuration files in the package are kept (see /Pacnew and Pacsave). Pacman rozpakowuje pakiet i zrzuca swoje pliki do systemu plików (w przypadku zainstalowanego lub zaktualizowanego pakietu). Pliki, które zastąpiłyby zachowane i ręcznie zmodyfikowane pliki konfiguracyjne (patrz poprzedni krok), są przechowywane pod nową nazwą (.pacnew). If the package has an install script, its post_install function is executed (or post_upgrade or post_remove in the case of an upgraded or removed package).\n1. If pacman PostTransaction hooks that exist at the end of the transaction apply, they are executed.\n\n1. If the package has an install script, its pre_install function is executed (or pre_upgrade or pre_remove in the case of an upgraded or removed package).\n1. Pacman deletes all the files from a pre-existing version of the package (in the case of an upgraded or removed package). However, files that were marked as configuration files in the package are kept (see /Pacnew and Pacsave).\n1. Pacman rozpakowuje pakiet i zrzuca swoje pliki do systemu plików (w przypadku zainstalowanego lub zaktualizowanego pakietu). Pliki, które zastąpiłyby zachowane i ręcznie zmodyfikowane pliki konfiguracyjne (patrz poprzedni krok), są przechowywane pod nową nazwą (.pacnew).\n1. If the package has an install script, its post_install function is executed (or post_upgrade or post_remove in the case of an upgraded or removed package).\n\n"
    },
    {
      "title": "Konfiguracja",
      "level": 2,
      "content": "Ustawienia Pacmana znajdują się w /etc/pacman.conf: jest to miejsce, w którym użytkownik konfiguruje program, aby działał w żądany sposób. Szczegółowe informacje o pliku konfiguracyjnym można znaleźć w pacman.conf(5).\n\n"
    },
    {
      "title": "Opcje ogólne",
      "level": 3,
      "content": "Opcje ogólne znajdują się w sekcji [options]. Przeczytaj pacman.conf(5) lub zajrzyj do domyślnego pliku pacman.conf, aby dowiedzieć się, co można tutaj zrobić.\n\n"
    },
    {
      "title": "Porównanie wersji przed aktualizacją",
      "level": 4,
      "content": "Aby zobaczyć stare i nowe wersje dostępnych pakietów, odkomentuj wiersz \"VerbosePkgLists\" w /etc/pacman.conf Wyjście pacman -Syu będzie wyglądać tak:\n\n```\nPackage (6)             Old Version  New Version  Net Change  Download Size\n\nextra/libmariadbclient  10.1.9-4     10.1.10-1      0.03 MiB       4.35 MiB\nextra/libpng            1.6.19-1     1.6.20-1       0.00 MiB       0.23 MiB\nextra/mariadb           10.1.9-4     10.1.10-1      0.26 MiB      13.80 MiB\n```\n\n"
    },
    {
      "title": "Włączanie równoległego pobierania",
      "level": 4,
      "content": "Pacman 6.0 wprowadził opcję równoległego pobierania pakietów. ParallelDownloads w [options] musi być ustawiony na dodatnią liczbę całkowitą w /etc/pacman.conf, aby użyć tej funkcji 5). W przeciwnym razie pakiety będą pobierane sekwencyjnie, jeśli ta opcja nie jest ustawiona.\n\n"
    },
    {
      "title": "Pomiń pakiet od aktualizacji",
      "level": 4,
      "content": "Aby konkretny pakiet został pominięty podczas upgrading[broken link: invalid section] systemu, dodaj tę linię w sekcji [options]:\n\n```\nIgnorePkg=linux\n```\n\nFor multiple packages use a space-separated list, or use additional IgnorePkg lines. Also, glob patterns can be used. If you want to skip packages just once, you can also use the --ignore option on the command-line - this time with a comma-separated list.\n\nIt will still be possible to upgrade the ignored packages using pacman -S: in this case pacman will remind you that the packages have been included in an IgnorePkg statement.\n\n"
    },
    {
      "title": "Pomiń grupę pakietów przed aktualizacją",
      "level": 4,
      "content": "Podobnie jak w przypadku pakietów, możliwe jest również pominięcie całej grupy pakietów:\n\n```\nIgnoreGroup=gnome\n```\n\n"
    },
    {
      "title": "Pomiń aktualizację pliku",
      "level": 4,
      "content": "Wszystkie pliki wymienione z dyrektywą NoUpgrade nigdy nie zostaną dotknięte podczas instalacji/uaktualnienia pakietu, a nowe pliki zostaną zainstalowane z rozszerzeniem .pacnew.\n\n```\nNoUpgrade=path/to/file\n```\n\nWiele plików można określić w następujący sposób:\n\n```\nNoUpgrade=path/to/file1 path/to/file2\n```\n\n"
    },
    {
      "title": "Pomiń instalację plików w systemie",
      "level": 4,
      "content": "Aby zawsze pomijać instalację określonych katalogów, wymień je w NoExtract. Na przykład, aby uniknąć instalacji jednostek systemd, użyj tego:\n\n```\nNoExtract=usr/lib/systemd/system/*\n```\n\nPóźniejsze reguły zastępują poprzednie i możesz je zanegować, dołączając !.\n\n"
    },
    {
      "title": "Zachowaj kilka plików konfiguracyjnych",
      "level": 4,
      "content": "Jeśli masz kilka plików konfiguracyjnych (np. konfigurację główną i konfigurację z włączonym repozytorium testing) i musisz dzielić opcje pomiędzy konfiguracjami, możesz użyć opcji Include zadeklarowanej w plikach konfiguracyjnych, np.:\n\n```\nInclude = /path/to/common/settings\n```\n\ngdzie /path/to/common/settings ustawień zawiera te same opcje dla obu konfiguracji.\n\n"
    },
    {
      "title": "Hooks",
      "level": 4,
      "content": "Pacman może uruchamiać hooki przed i po transakcji z katalogu /usr/share/libalpm/hooks/; więcej katalogów można określić za pomocą opcji HookDir w pacman.conf, która domyślnie to /etc/pacman.d/hooks. Nazwy plików przechwytujących muszą mieć przyrostek .hook. Haki Pacmana nie są interaktywne.\n\nHaki Pacman są używane na przykład w połączeniu z systemd-sysusers i systemd-tmpfiles do automatycznego tworzenia użytkowników systemu i plików podczas instalacji pakietów. Na przykład tomcat8 określa, że chce użytkownika systemowego o nazwie tomcat8 i określonych katalogów należących do tego użytkownika. Pacman przechwytuje systemd-sysusers.hook i systemd-tmpfiles.hook wywołuje systemd-sysusers i systemd-tmpfiles, gdy pacman stwierdzi, że tomcat8 zawiera pliki określające użytkowników i pliki tmp.\n\nWięcej informacji o hakach alpm znajdziesz w alpm-hooks(5).\n\n"
    },
    {
      "title": "Repozytoria i mirrory",
      "level": 3,
      "content": "Oprócz specjalnej sekcji [options[broken link: invalid section]], każda inna [section] w pacman.conf definiuje repozytorium pakietów, które ma być używane. Repozytorium to logiczny zbiór pakietów, które są fizycznie przechowywane na jednym lub kilku serwerach: z tego powodu każdy serwer jest nazywany mirrorem repozytorium.\n\nRepozytoria rozróżnia się na oficjalne i nieoficjalne. Kolejność repozytoriów w pliku konfiguracyjnym ma znaczenie; repozytoria wymienione jako pierwsze będą miały pierwszeństwo przed tymi wymienionymi później w pliku, gdy pakiety w dwóch repozytoriach mają identyczne nazwy, niezależnie od numeru wersji. Aby korzystać z repozytorium po jego dodaniu, musisz najpierw upgrade[broken link: invalid section] cały system.\n\nKażda sekcja repozytorium umożliwia zdefiniowanie listy swoich serwerów lustrzanych bezpośrednio lub w dedykowanym pliku zewnętrznym poprzez dyrektywę Include; na przykład serwery lustrzane oficjalnych repozytoriów znajdują się w /etc/pacman.d/mirrorlist. Zobacz artykuł Mirrors, aby dowiedzieć się jak skonfigurować mirror.\n\n"
    },
    {
      "title": "Katalog cache pakietów",
      "level": 4,
      "content": "Pacman przechowuje pobrane pliki pakietów w pamięci podręcznej, w katalogu oznaczonym CacheDir w sekcji [options[broken link: invalid section]] pliku pacman.conf (domyślnie/var/cache/pacman/pkg/, jeśli nie jest ustawiony).\n\nKatalog Cachej może z czasem się rozrastać, nawet przy zachowaniu tylko najświeższych wersji zainstalowanych pakietów.\n\nJeśli chcesz przenieść ten katalog w bardziej dogodne miejsce, wykonaj jedną z następujących czynności:\n\n- Ustaw opcję CacheDir w pacman.conf na nowy katalog. Pamiętaj o zachowaniu końcowego ukośnika. To jest zalecane rozwiązanie.\n- Zamontuj dedykowaną partycję lub np. Btrfs subvolume w /var/cache/pacman/pkg/.\n- Zamontuj wybrany katalog w /var/cache/pacman/pkg/.\n\nNote: **Nie dowiązuj symbolicznie** \n\n"
    },
    {
      "title": "Package security",
      "level": 4,
      "content": "Pacman obsługuje podpisy pakietów, które dodają dodatkową warstwę bezpieczeństwa do pakietów. Domyślna konfiguracja, SigLevel = Required DatabaseOptional, umożliwia weryfikację podpisu dla wszystkich pakietów na poziomie globalnym. Można to zastąpić wierszami SigLevel dla poszczególnych repozytorium. Aby uzyskać więcej informacji na temat podpisywania pakietów i weryfikacji podpisów, spójrz na pacman-key\n\n"
    },
    {
      "title": "\"Failed to commit transaction (conflicting files)\" error",
      "level": 3,
      "content": "Jeśli zobaczysz następujący błąd: [1]\n\n```\nerror: could not prepare transaction\nerror: failed to commit transaction (conflicting files)\npackage: /path/to/file exists in filesystem\nErrors occurred, no packages were upgraded.\n```\n\nDzieje się tak, ponieważ pacman wykrył konflikt plików i zgodnie z projektem nie nadpisze plików. Jest to zgodne z projektem, a nie wada.\n\nThe problem is usually trivial to solve. A safe way is to first check if another package owns the file (pacman -Qo /path/to/file). If the file is owned by another package, file a bug report. If the file is not owned by another package, rename the file which 'exists in filesystem' and re-issue the update command. If all goes well, the file may then be removed.\n\nIf you had installed a program manually without using pacman, for example through make install, you have to remove/uninstall this program with all of its files. See also Pacman tips#Identify files not owned by any package.\n\nEvery installed package provides a /var/lib/pacman/local/package-version/files file that contains metadata about this package. If this file gets corrupted, is empty or goes missing, it results in file exists in filesystem errors when trying to update the package. Such an error usually concerns only one package. Instead of manually renaming and later removing all the files that belong to the package in question, you may explicitly run pacman -S --overwrite glob package to force pacman to overwrite files that match glob.\n\n"
    },
    {
      "title": "\"Failed to commit transaction (invalid or corrupted package)\" error",
      "level": 3,
      "content": "Poszukaj plików .part (częściowo pobranych pakietów) w /var/cache/pacman/pkg/ i usuń je (często spowodowane użyciem niestandardowego XferCommand w pacman.conf).\n\n```\n# find /var/cache/pacman/pkg/ -iname \"*.part\" -delete\n```\n\nTen sam błąd może się również pojawić, jeśli archlinux-keyring jest nieaktualny, co uniemożliwia pacmanowi weryfikację podpisów. Zobacz Pacman/Package signing#Upgrade system regularly, aby poznać poprawkę i sposoby jej uniknięcia w przyszłości.\n\n"
    },
    {
      "title": "\"Failed to init transaction (unable to lock database)\" error",
      "level": 3,
      "content": "Kiedy pacman zamierza zmienić bazę danych pakietów, na przykład zainstalować pakiet, tworzy plik blokady w /var/lib/pacman/db.lck. Zapobiega to jednoczesnej próbie zmiany bazy danych pakietów przez inną instancję pacmana.\n\nJeśli pacman zostanie przerwany podczas zmiany bazy danych, ten przestarzały plik blokady może pozostać. Jeśli masz pewność, że żadne instancje pacmana nie są uruchomione, usuń plik blokady:\n\n```\n# rm /var/lib/pacman/db.lck\n```\n\n"
    },
    {
      "title": "Packages cannot be retrieved on installation",
      "level": 3,
      "content": "Ten błąd objawia się jako Not found in sync db, Target not found lub Failed retrieving file.\n\nPo pierwsze, upewnij się, że pakiet rzeczywiście istnieje. Jeśli masz pewność, że pakiet istnieje, Twoja lista pakietów może być nieaktualna. Spróbuj uruchomić pacman -Syu, aby wymusić odświeżenie wszystkich list pakietów i aktualizację. Upewnij się również, że wybrane serwery lustrzane są aktualne, a repozytoria[broken link: invalid section] są poprawnie skonfigurowane.\n\nMoże się również zdarzyć, że repozytorium zawierające pakiet nie jest włączone w twoim systemie, np. pakiet może znajdować się w repozytorium multilib, ale multilib nie jest włączony w twoim pacman.conf.\n\nZobacz też FAQ#Why is there only a single version of each shared library in the official repositories?.\n\n"
    },
    {
      "title": "Pacman ulega awarii podczas aktualizacji",
      "level": 3,
      "content": "W przypadku awarii pacmana z błędem „zapisu do bazy danych” podczas usuwania pakietów, a ponowna instalacja lub aktualizacja pakietów nie powiedzie się, wykonaj następujące czynności:\n\n1. Uruchom komputer za pomocą nośnika instalacyjnego Arch. Najlepiej używać najnowszego nośnika, aby wersja pacmana była zgodna/była nowsza niż system.\n1. Zamontuj główny system plików systemu, np. mount /dev/sdaX /mnt jako root i sprawdź, czy w mount jest wystarczająca ilość miejsca za pomocą df -h\n1. Zamontuj również systemy plików proc, sys i dev: mount -t proc proc /mnt/proc; mount --rbind /sys /mnt/sys; mount --rbind /dev /mnt/dev\n1. Jeśli system używa domyślnych lokalizacji baz danych i katalogów, możesz teraz zaktualizować systemową bazę danych pacman i zaktualizować ją przez pacman --sysroot /mnt -Syu jako root. Alternatywnie, jeśli nie możesz zaktualizować/uaktualnić, zapoznaj się z Pacman/Tips and tricks#Reinstalling all packages.\n1. Po aktualizacji, jeden ze sposobów, aby dokładnie sprawdzić, czy pakiety nie są uaktualnione, ale nadal są uszkodzone: find /mnt/usr/lib -size 0\n1. Po czym następuje ponowna instalacja wciąż uszkodzonego pakietu przez pacman --sysroot /mnt -S package.\n\n- Alternatywnie, jeśli nie możesz zaktualizować/uaktualnić, zapoznaj się z Pacman/Tips and tricks#Reinstalling all packages.\n\n"
    },
    {
      "title": "pacman: command not found",
      "level": 4,
      "content": "Jeśli /var/cache/pacman/pkg jest dowiązaniem symbolicznym, pacman spróbuje zamiast tego utworzyć katalog, a tym samym usunie to dowiązanie symboliczne podczas samodzielnej aktualizacji. Spowoduje to niepowodzenie aktualizacji. W rezultacie brakuje /usr/bin/pacman i innej zawartości pakietu pacman.\n\nNigdy nie dowiązuj symbolicznie /var/cache/pacman/pkg, ponieważ jest kontrolowany przez pacmana. Zamiast tego użyj opcji CacheDir lub montowania powiązania; zobacz #Package cache directory[broken link: invalid section].\n\nJeśli już napotkałeś ten problem i zepsułeś system, możesz ręcznie wyodrębnić zawartość /usr z pakietu, aby przywrócić pacman, a następnie zainstalować go ponownie; zobacz FS#73306 i powiązany wątek na forum, aby uzyskać szczegółowe informacje.\n\n"
    },
    {
      "title": "Korzystanie z pacman-static",
      "level": 4,
      "content": "pacman-staticAUR jest statycznie skompilowaną wersją pacmana, więc będzie mógł działać nawet wtedy, gdy biblioteki w systemie nie działają. Może się to również przydać, gdy przeprowadzono częściową aktualizację i pacman nie może już działać.\n\nPrzypięty komentarz i PKGBUILD umożliwiają bezpośrednie pobranie pliku binarnego, którego można użyć do ponownej instalacji pacmana lub aktualizacji całego systemu w przypadku aktualizacji częściowych.\n\n"
    },
    {
      "title": "Korzystanie z zewnętrznego pacmana",
      "level": 4,
      "content": "Jeśli nawet pacman-static nie działa, możliwe jest odzyskanie za pomocą zewnętrznego pacmana. Jedną z najłatwiejszych metod jest użycie archiso i po prostu użycie --sysroot lub --root do określenia punktu montowania. Zobacz Chroot#Using chroot, aby dowiedzieć się, jak zamontować niezbędne systemy plików wymagane przez --sysroot.\n\n"
    },
    {
      "title": "Poprzez ręczne wyodrębnianie",
      "level": 4,
      "content": "Nawet jeśli pacman jest strasznie zepsuty, możesz go naprawić ręcznie, pobierając najnowsze pakiety i rozpakowując je we właściwych lokalizacjach. Wstępne kroki do wykonania to:\n\n1. Określ zależności pacman do zainstalowania\n1. Pobierz każdy pakiet z wybranego mirrora\n1. Wypakuj każdy pakiet do roota\n1. Zainstaluj ponownie te pakiety za pomocą pacman pacman -S --overwrite, aby odpowiednio zaktualizować bazę danych pakietów\n1. Wykonaj pełną aktualizację systemu\n\nJeśli masz pod ręką zdrowy system Arch, możesz zobaczyć pełną listę zależności z:\n\n```\n$ pacman -Q $(pactree -u pacman)\n```\n\nAle w zależności od problemu może być konieczne zaktualizowanie tylko kilku z nich. Przykładem wyodrębniania pakietu jest\n\n```\n# tar -xvpwf package.tar.zst -C / --exclude .PKGINFO --exclude .INSTALL --exclude .MTREE --exclude .BUILDINFO\n```\n\nZwróć uwagę na użycie flagi w dla trybu interaktywnego. Uruchamianie w trybie nieinteraktywnym jest bardzo ryzykowne, ponieważ możesz nadpisać ważny plik. Zadbaj również o wyodrębnienie pakietów we właściwej kolejności (tj. najpierw zależności). Ten post na forum zawiera przykład tego procesu, w którym uszkodzonych jest tylko kilka zależności od pacmana.\n\n"
    },
    {
      "title": "\"Unable to find root device\" error after rebooting",
      "level": 3,
      "content": "Najprawdopodobniej initramfs został uszkodzony podczas aktualizacji jądra (przyczyną może być niewłaściwe użycie opcji --overwrite w pacman). Istnieją dwie opcje; najpierw wypróbuj wpis Fallback.\n\nPo uruchomieniu systemu uruchom to polecenie (dla podstawowego jądra linux) z konsoli lub terminala, aby odbudować obraz initramfs:\n\n```\n# mkinitcpio -p linux\n```\n\nJeśli to nie zadziała, z bieżącego wydania Arch (CD/DVD lub pamieci USB), zamontuj partycje root i boot odpowiednio do /mnt i /mnt/boot. Następnie wykonaj chroot za pomocą arch-chroot:\n\n```\n# arch-chroot /mnt\n# pacman -Syu mkinitcpio systemd linux\n```\n\n- If you do not have a current release or if you only have some other \"live\" Linux distribution laying around, you can chroot using the old fashioned way. Obviously, there will be more typing than simply running the arch-chroot script.\n- If pacman fails with Could not resolve host, please check your internet connection.\n- If you cannot enter the arch-chroot or chroot environment but need to re-install packages you can use the command pacman --sysroot /mnt -Syu foo bar to use pacman on your root partition.\n\nPonowna instalacja jądra (pakietu linux) spowoduje automatyczne ponowne wygenerowanie obrazu initramfs za pomocą polecenia mkinitcpio -p linux. Nie ma potrzeby robienia tego osobno.\n\nNastępnie zalecane jest uruchomienie exit, umount /mnt/{boot,} i reboot.\n\n"
    },
    {
      "title": "\"Warning: current locale is invalid; using default \"C\" locale\" error",
      "level": 3,
      "content": "Jak mówi komunikat o błędzie, Twoje ustawienia regionalne nie są poprawnie skonfigurowane. Zobacz Locale.\n\n"
    },
    {
      "title": "Pacman nie uwzględnia ustawień proxy",
      "level": 3,
      "content": "Make sure that the relevant environment variables ($http_proxy, $ftp_proxy etc.) are set up. If you use pacman with sudo, you need to configure sudo to pass these environment variables to pacman. Also, ensure the configuration of dirmngr has honor-http-proxy in /etc/pacman.d/gnupg/dirmngr.conf to honor the proxy when refreshing the keys.\n\n"
    },
    {
      "title": "Jak ponownie zainstalować wszystkie pakiety, zachowując informacje o tym, czy coś zostało zainstalowane jawnie, czy jako zależność?",
      "level": 3,
      "content": "Aby ponownie zainstalować wszystkie pakiety natywne: pacman -Qnq | pacman -S - lub pacman -S $(pacman -Qnq) (opcja -S domyślnie zachowuje przyczynę instalacji).\n\nBędziesz musiał ponownie zainstalować wszystkie obce pakiety, które można wyświetlić za pomocą pacman -Qmq\n\n"
    },
    {
      "title": "\"Cannot open shared object file\" error",
      "level": 3,
      "content": "Wygląda na to, że poprzednia transakcja pacman została usunięta lub uszkodzone biblioteki współdzielone potrzebne do samego pacmana.\n\nAby wyjść z tej sytuacji, musisz ręcznie rozpakować wymagane biblioteki do systemu plików. Najpierw znajdź pakiet zawierający pominiętą bibliotekę, a następnie zlokalizuj go w pamięci podręcznej pacmana (/var/cache/pacman/pkg/). Rozpakuj wymaganą bibliotekę współdzieloną do systemu plików. Umożliwi to uruchomienie pacmana.\n\nTeraz musisz ponownie zainstalować[broken link: invalid section] uszkodzony pakiet. Zauważ, że musisz użyć flagi --overwrite, ponieważ właśnie rozpakowujesz pliki systemowe, a pacman o tym nie wie. Pacman poprawnie zastąpi nasz plik biblioteki współdzielonej jednym z pakietu.\n\nTo wszystko. Zaktualizuj resztę systemu.\n\n"
    },
    {
      "title": "Freeze of package downloads",
      "level": 3,
      "content": "Zgłoszono pewne problemy dotyczące problemów z siecią, które uniemożliwiają pacmanowi aktualizację/synchronizację repozytoriów. [2] [3] Podczas instalacji Arch Linux natywnie problemy te zostały rozwiązane przez zastąpienie domyślnego programu do pobierania plików pacman alternatywą (zobacz Improve pacman performance, aby uzyskać więcej informacji). Podczas instalowania Arch Linux jako systemu gościa w VirtualBox problem ten został również rozwiązany poprzez użycie interfejsu hosta zamiast NAT we właściwościach komputera.\n\n"
    },
    {
      "title": "Failed retrieving file 'core.db' from mirror",
      "level": 3,
      "content": "Jeśli otrzymasz ten komunikat o błędzie z poprawnymi serwerami lustrzanymi, spróbuj ustawić inny serwer nazw.\n\n"
    },
    {
      "title": "error: 'local-package.pkg.tar': permission denied",
      "level": 3,
      "content": "Jeśli chcesz zainstalować pakiet sshfs mount za pomocą pacman -U i pojawi się ten błąd, przenieś pakiet do katalogu lokalnego i spróbuj ponownie zainstalować.\n\n"
    },
    {
      "title": "error: could not determine cachedir mount point /var/cache/pacman/pkg",
      "level": 3,
      "content": "Podczas wykonywania np. pacman -Syu w środowisku chroot pojawia się błąd:\n\n```\nerror: could not determine cachedir mount point /var/cache/pacman/pkg\nerror: failed to commit transaction (not enough free disk space)\n```\n\nJest to często spowodowane tym, że katalog chroot nie jest punktem montowania w momencie wejścia do chroota. Zobacz notatkę w sekcji Zainstaluj Arch Linux z istniejącego systemu Install Arch Linux from existing Linux#Downloading basic tools dla rozwiązania i arch-chroot(8), aby uzyskać wyjaśnienie i przykład użycia montowania z wiązaniem, aby katalog chroot stał się punktem montowania. :\n\n"
    },
    {
      "title": "error: GPGME error: No data",
      "level": 3,
      "content": "Jeśli nie możesz zaktualizować pakietów i otrzymasz ten błąd, spróbuj rm -r /var/lib/pacman/sync/ przed próbą aktualizacji.\n\n"
    }
  ]
}