{
  "title": "Pacman (Português)/Package signing (Português)",
  "url": "https://wiki.archlinux.org/title/Pacman_(Portugu%C3%AAs)/Package_signing_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- GnuPG\n- DeveloperWiki:Package signing\n\nPara determinar se os pacotes são autênticos, o pacman usa chaves GnuPG em um modelo de rede de confiança. As Chaves Mestras de Assinatura (Master Signing Keys) são encontradas aqui. Pelo menos três dessas Chaves Mestras de Assinatura são usadas para assinar as chaves de Desenvolvedores e de Mantenedores de Pacote. Elas são, então, usadas para assinar seus pacotes. Cada usuário também possui uma chave PGP única, a qual é gerada quando você configura pacman-key. É essa rede de confiança que liga a chave do usuário às chaves mestras.\n\nExemplos de redes de confiança:\n\n- Pacotes personalizados: Pacotes feitos e assinados com uma chave local.\n- Pacotes não oficiais: Pacotes feitos e assinados por um desenvolvedor. Então, uma chave local foi usada assinar aquela chave de desenvolvedor.\n- Pacotes oficiais: Pacotes feitos e assinados por um desenvolvedor. A chave do desenvolvedor foi assinada pelas chaves mestras do Arch Linux. Você usou sua chave para assinar as chaves mestras e você confia nelas como garantia dos desenvolvedores.\n\n"
    },
    {
      "title": "Configurando o pacman",
      "level": 3,
      "content": "A opção SigLevel no /etc/pacman.conf determina o nível de confiança exigido para instalar um pacote com pacman -S. Para uma explicação detalhada de SigLevel, veja pacman.conf(5) § PACKAGE AND DATABASE SIGNATURE CHECKING e os comentários no arquivo. É possível configurar uma verificação de assinatura global ou por repositório. Se SigLevel estiver definido globalmente na seção [options], todos os pacotes instalados com pacman -S vão exigir assinatura. Com a configuração LocalFileSigLevel do pacman.conf padrão, quaisquer pacotes que você compile e instale com pacman -U, não precisarão ser assinados usando makepkg.\n\nPara pacotes remotos, a configuração padrão terá suporte apenas à instalação de pacotes que estão assinados pelas chaves confiadas:\n\n```\n/etc/pacman.conf\n```\n\n```\nSigLevel = Required DatabaseOptional\n```\n\nIsso porque TrustedOnly é um parâmetro padrão compilado no pacman. A configuração padrão é idêntica a usar a opção global de:\n\n```\nSigLevel = Required DatabaseOptional TrustedOnly\n```\n\nA linha acima pode ser obtida a nível de repositório mais abaixo na configuração, p.ex.:\n\n```\n[core]\nSigLevel = PackageRequired\nInclude = /etc/pacman.d/mirrorlist\n```\n\nadiciona explicitamente verificação de assinatura para pacotes do repositório, mas não exige que o banco de dados seja assinado. Optional aqui desligaria um Required global para esse repositório.\n\n"
    },
    {
      "title": "Inicializando o chaveiro",
      "level": 3,
      "content": "Para inicializar o chaveiro (keyring) do pacman, execute:\n\n```\n# pacman-key --init\n```\n\n"
    },
    {
      "title": "Verificando as chaves mestras",
      "level": 3,
      "content": "A configuração inicial de chaves é alcançada usando:\n\n```\n# pacman-key --populate\n```\n\nTire um tempo para verificar as Chaves Mestras de Assinatura quando solicitado, pois estes são usados para coassinar (e, portanto, confiar) todas as outras chaves do empacotador.\n\nAs chaves PGP são muito grandes (2048 bits ou mais) para que os humanos trabalhem com elas, então eles geralmente são hashed para criar uma impressão digital de 40 dígitos que pode ser usada para verificar manualmente que duas chaves são iguais. Os últimos oito dígitos da impressão digital servem como um nome para a chave conhecida como \"ID da chave (curta)\" (os últimos dezesseis dígitos da impressão digital seriam 'ID da chave longa').\n\n"
    },
    {
      "title": "Adicionando as chaves de desenvolvedor",
      "level": 3,
      "content": "As chaves oficiais de Desenvolvedores e de Mantenedores de pacote são assinadas pelas chaves mestras, então você não precisa usar pacman-key para assiná-las você mesmo. Sempre que o pacman encontra uma chave que ele não reconhece, ele solicitará fazer o download de um chaveiro (keyserver) configurado no /etc/pacman.d/gnupg/gpg.conf (ou usando a opção --keyserver na linha de comando). O Wikipédia mantém uma lista de servidores de chave.\n\nDepois de ter baixado uma chave do desenvolvedor, você não terá que baixá-la novamente e pode ser usada para verificar quaisquer outros pacotes assinados por esse desenvolvedor.\n\n"
    },
    {
      "title": "Adicionando chaves não oficiais",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n}}\n\nEsse método pode ser usado para adicionar uma chave ao chaveiro do pacman, ou para permitir repositórios não oficiais de usuários assinados.\n\nPrimeiro, obtenha o ID de chave (id-chave) de seu dono. Então, adicione-o ao chaveiro usando um dos métodos abaixo:\n\n1. Se a chave estiver localizado em um servidor de chave, importe-a com: # pacman-key --recv-keysid-chave\n1. Caso contrário, se um link para um arquivo de chave for fornecido, baixe-a e então execute: # pacman-key --add /caminho/para/arquivo/de/chave\n\n```\n# pacman-key --recv-keysid-chave\n```\n\n```\n# pacman-key --add /caminho/para/arquivo/de/chave\n```\n\nÉ recomendado verificar a impressão digital, assim como qualquer chave mestra ou outra chave que você vai assinar:\n\n```\n$ pacman-key --finger id-chave\n```\n\nFinalmente, você deve assinar localmente a chave importada:\n\n```\n# pacman-key --lsign-key id-chave\n```\n\nAgora, você confia nessa chave para assinar pacotes.\n\n"
    },
    {
      "title": "Depurando com gpg",
      "level": 3,
      "content": "Para fins de depuração, você pode acessar o chaveiro do pacman diretamente com gpg, p.ex.:\n\n```\n# gpg --homedir /etc/pacman.d/gnupg --list-keys\n```\n\n"
    },
    {
      "title": "Atualize o sistema regularmente",
      "level": 3,
      "content": "Atualizar o sistema regularmente via pacman (Português)#Atualizando pacotes previne a maioria dos erros de assinatura. Se o atraso for inevitável e a atualização do sistema for atrasada por um longo período, sincronize manualmente o banco de dados do pacote e atualize o pacote archlinux-keyring antes da atualização do sistema:\n\n```\n# pacman -Sy archlinux-keyring && pacman -Su\n```\n\nEste comando não é considerado uma atualização parcial, pois sincroniza o banco de dados do pacote e atualiza o pacote de chaveiro primeiro. Ambos devem ser processados antes de iniciar a atualização do sistema para garantir que as assinaturas de todos os pacotes atualizados possam ser verificadas corretamente.\n\n"
    },
    {
      "title": "Atualize o horário do sistema regularmente",
      "level": 3,
      "content": "Quando o horário do sistema estiver com defeito, as chaves de assinatura podem ser consideradas expiradas (ou inválidas) e as verificações de assinatura nos pacotes falharão. Sincronize o relógio do sistema regularmente usando o Network Time Protocol daemon.\n\n"
    },
    {
      "title": "Erros de assinatura inválida",
      "level": 3,
      "content": "O pacman-key depende do horário do sistema. Se o relógio do sistema não estiver sincronizado, instalação/atualização do sistema pode falhar com:\n\n```\nerro: pacote: assinatura de \"Usuário <email@archlinux.org>\" é inválida\nerro: falha ao submeter transação (pacote inválido ou corrompido (assinatura PGP))\nOcorreram erros e, portanto, nenhum pacote foi atualizado.\n```\n\nSe estiver usando ntpd, corrija o horário do sistema (como root) com ntpd -qg seguido por hwclock -w.\n\nOutros clientes NTP podem ser usados. Consulte sincronização de tempo.\n\nSe a correção do relógio do sistema não resolver a falha, tente uma das seguintes abordagens:\n\n"
    },
    {
      "title": "Removendo pacotes do cache",
      "level": 4,
      "content": "Alguns pacotes podem estar corrompidos ou não assinados, causando falha. Remova cada pacote incorreto do cache do sistema rm /var/cache/pacman/pkg/pkgname para que ele seja baixado recentemente, ou apague todo o cache.\n\n"
    },
    {
      "title": "Redefinindo todas as chaves",
      "level": 4,
      "content": "Remova ou redefina todas as chaves instaladas em seu sistema removendo o diretório /etc/pacman.d/gnupg (como root) e executando novamente pacman-key --init seguido por pacman-key --populate para adicionar novamente as chaves padrão.\n\n"
    },
    {
      "title": "Desabilitando a verificação de assinatura",
      "level": 4,
      "content": "Se você não estiver preocupado com a assinatura do pacote, poderá desabilitar completamente a verificação de assinatura PGP. Edite /etc/pacman.conf para ter as seguintes linhas no [options]:\n\n```\nSigLevel = Never\n#LocalFileSigLevel = Optional\n#RemoteFileSigLevel = Required\n```\n\nVocê precisa comentar quaisquer configurações específicas de SigLevel do repositório porque elas substituem as configurações globais. Isso resultará em nenhuma verificação de assinatura, que era o comportamento antes do pacman 4. Se você fizer isso, você não precisa configurar um chaveiro com pacman-key. Você pode alterar essas opções posteriormente se decidir habilitar a verificação do pacote.\n\n"
    },
    {
      "title": "Não foi possível importar chaves",
      "level": 3,
      "content": "Existem várias fontes possíveis deste problema:\n\n- Um pacote archlinux-keyring desatualizado.\n- O relógio está definido com uma data incorreta.\n- Seu provedor de internet bloqueou a porta usada para importar chaves PGP.\n- Seu cache do pacman contém cópia de pacotes não assinados de tentativas anteriores.\n- dirmngr não está configurado corretamente.\n\nVocê pode estar travado por causa do pacote archlinux-keyring estar desatualizado, ao fazer uma sincronização de atualização.\n\nAbaixo estão algumas soluções que podem funcionar dependendo do seu caso.\n\n"
    },
    {
      "title": "Atualize o sistema",
      "level": 4,
      "content": "Veja se atualizar o sistema consegue corrigir isso primeiro.\n\n"
    },
    {
      "title": "Altere o servidor de chaves",
      "level": 4,
      "content": "Se você suspeitar que algo não está funcionando corretamente com o servidor de chaves, tente mudar para o servidor de chaves do Ubuntu. Para fazer isso, edite /etc/pacman.d/gnupg/gpg.conf e altere a linha keyserver para:\n\n```\nkeyserver hkp://keyserver.ubuntu.com\n```\n\n"
    },
    {
      "title": "Limpe os pacotes em cache",
      "level": 4,
      "content": "Se você suspeita que seu cache do pacman em /var/cache/pacman/pkg/ pode conter pacotes não assinados, tente apagar o cache manualmente ou executar:\n\n```\n# pacman -Sc\n```\n\no que remove todos os pacotes em cache que não foram instalados.\n\n"
    },
    {
      "title": "Assinatura tem confiança desconhecida",
      "level": 3,
      "content": "Algumas vezes ao executar pacman -Syu, você pode encontrar esse erro:\n\n```\nerror: nome-pacote: a assinatura de \"empacotador\" tem confiança desconhecida\n```\n\nIsso ocorre porque a chave do empacotador usada no pacote nome-pacote não está presente e/ou não é confiável no banco de dados gpg local do pacman-key. O Pacman parece não conseguir sempre verificar se a chave foi recebida e marcada como confiável antes de continuar. Isso também pode ocorrer porque uma chave expirou desde que foi adicionada ao seu chaveiro.\n\nMitigue:\n\n- Atualizando manualmente o pacote archlinux-keyring antes de atualizar o sistema ou\n- atualizando suas chaves com pacman-key --refresh-keys ou\n- assinando manualmente a chave não confiável localmente (não recomendado) ou\n- definindo temporariamente SigLevel com TrustAll (não recomendado).\n\nAs duas últimas opções acima quebram a cadeia de confianças e devem ser usadas com cuidado.\n\n"
    },
    {
      "title": "Atualizando chaves via proxy",
      "level": 3,
      "content": "Para usar um proxy ao atualizar chaves, a opção honor-http-proxy deve ser configurar em ambos /etc/gnupg/dirmngr.conf e /etc/pacman.d/gnupg/dirmngr.conf. Veja GnuPG#Use a keyserver para mais informações.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- DeveloperWiki:Package Signing Proposal for Pacman\n- Pacman Package Signing – 1: Makepkg and Repo-add\n- Pacman Package Signing – 2: Pacman-key\n- Pacman Package Signing – 3: Pacman\n- Pacman Package Signing – 4: Arch Linux\n\n"
    }
  ]
}