{
  "title": "Pacman/Restore local database (Español)",
  "url": "https://wiki.archlinux.org/title/Pacman/Restore_local_database_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-11-24** \n\nSeñales de que pacman necesita una restauración de la base de datos local:\n\n- pacman -Q no da absolutamente ninguna salida, y pacman -Syu informa erróneamente que el sistema está actualizado.\n- Al intentar instalar un paquete utilizando pacman -S paquete, se genera una lista de dependencias ya satisfechas.\n\nLo más probable es que esto se deba a que la base de datos de software instalado por pacman, /var/lib/pacman/local, se haya corrompido o eliminado. Si bien este es un problema grave, puede restaurarse siguiendo las instrucciones siguientes.\n\nEn primer lugar, asegúrese de que el archivo de registro de pacman esté presente:\n\n```\n$ ls /var/log/pacman.log\n```\n\nSi no existe, no será posible continuar con este método. Puede usar el script de detección de paquetes de Xyne para recrear la base de datos. Si no es así, entonces la solución más factible será reinstalar todo el sistema.\n\n"
    },
    {
      "title": "Generar la lista de recuperación de paquetes",
      "level": 2,
      "content": "Instale el paquete pacutils para obtener paclog.\n\nCree un script de filtro de registro y hágalo ejecutable:\n\n```\npacrecover\n```\n\n```\n#!/bin/bash -e\n\n. /etc/makepkg.conf\n\nPKGCACHE=$((grep -m 1 '^CacheDir' /etc/pacman.conf || echo 'CacheDir = /var/cache/pacman/pkg') | sed 's/CacheDir = //')\n\npkgdirs=(\"$@\" \"$PKGDEST\" \"$PKGCACHE\")\n\nwhile read -r -a parampart; do\n  pkgname=\"${parampart[0]}-${parampart[1]}-*.pkg.tar.{xz,zst}\"\n  for pkgdir in ${pkgdirs[@]}; do\n    pkgpath=\"$pkgdir\"/$pkgname\n    [ -f $pkgpath ] && { echo $pkgpath; break; };\n  done || echo ${parampart[0]} 1>&2\ndone\n```\n\nEjecute el script (opcionalmente, pasando directorios adicionales con paquetes como parámetros):\n\n```\n$ paclog --pkglist --logfile=/var/log/pacman.log | ./pacrecover >files.list 2>pkglist.orig\n```\n\nDe esta manera, se crearán dos archivos: files.list con los archivos de paquetes que todavía están presentes en el equipo, y pkglist.orig, paquetes que se deben descargar. La operación posterior puede dar lugar a discrepancia entres los archivos de versiones anteriores aún presentes en el equipo, y los archivos que se encuentran con una nueva versión. Dichos desajustes deberán ser arreglados manualmente.\n\nHe aquí una forma de restringir automáticamente la segunda lista a los paquetes disponibles en un repositorio:\n\n```\n$ { cat pkglist.orig; pacman -Slq; } | sort | uniq -d > pkglist\n```\n\nNote: **repita la orden anterior** \n\nCompruebe si falta algún paquete base importante y agréguelo a la lista:\n\n```\n$ comm -23 <(pacman -Sgq base | sort) pkglist.orig >> pkglist\n```\n\nContinúe una vez que el contenido de ambas listas sea satisfactorio, ya que se utilizarán para restaurar la base de datos de paquetes instalada por pacman (/var/lib/pacman/local/).\n\n"
    },
    {
      "title": "Realizar la recuperación",
      "level": 2,
      "content": "Defina una función de bash para fines de recuperación:\n\n```\nrecovery-pacman() {\n    pacman \"$@\"       \\\n    --log /dev/null   \\\n    --noscriptlet     \\\n    --dbonly          \\\n    --overwrite \"*\"   \\\n    --nodeps          \\\n    --needed\n}\n```\n\n--log /dev/null permite evitar la saturación innecesaria del registro de pacman, --needed ahorrará tiempo al omitir instalar paquetes ya presentes en la base de datos, --nodeps permitirá la instalación de paquetes almacenados en caché, incluso si los paquetes que se instalan dependen de versiones más nuevas. El resto de opciones permitirá que pacman funcione sin leer/escribir el sistema de archivos.\n\nRefresque la base de datos:\n\n```\n# pacman -Sy\n```\n\nInicie la generación de la base de datos instalando archivos de paquetes disponibles localmente desde files.list:\n\n```\n# recovery-pacman -U $(< files.list)\n```\n\nInstale el resto desde pkglist:\n\n```\n# recovery-pacman -S $(< pkglist)\n```\n\nActualice la base de datos local para que los paquetes que no son requeridos por cualquier otro paquete se marquen como instalados explícitamente y el resto como dependencias. Necesitará tener más cuidado en el futuro al eliminar paquetes, pero con la base de datos original perdida es lo mejor que podemos hacer.\n\n```\n# pacman -D --asdeps $(pacman -Qq)\n# pacman -D --asexplicit $(pacman -Qtq)\n```\n\nOpcionalmente, compruebe todos los paquetes instalados con daños:\n\n```\n# pacman -Qk\n```\n\nOpcionalmente Pacman/Tips and tricks (Español)#Identificar archivos que no pertenecen a ningún paquete.\n\nActualice todos los paquetes:\n\n```\n# pacman -Su\n```\n\n"
    }
  ]
}