{
  "title": "Pacman/Подпись пакета",
  "url": "https://wiki.archlinux.org/title/Pacman/%D0%9F%D0%BE%D0%B4%D0%BF%D0%B8%D1%81%D1%8C_%D0%BF%D0%B0%D0%BA%D0%B5%D1%82%D0%B0",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- GnuPG (Русский)\n\nДля проверки подлинности пакетов pacman использует ключи GnuPG и сеть доверия. Действующие мастер-ключи Arch Linux можно найти здесь. Ключи разработчиков и сопровождающих пакетов, которыми они подписывают свои пакеты, должны быть подписаны минимум тремя мастер-ключами. У каждого пользователя также есть свой уникальный PGP-ключ, сгенерированный при настройке утилиты pacman-key. Сеть доверия связывает ключи пользователей и мастер-ключи.\n\nПримеры сетей доверия:\n\n- Пользовательские пакеты: обычный пользователь создаёт пакет и подписывает его своим локальным ключом.\n- Неофициальные пакеты: разработчик создаёт пакет и подписывает его ключом разработчика; обычный пользователь подписывает ключ разработчика локальным ключом.\n- Официальные пакеты: разработчик создаёт пакет и подписывает его ключом разработчика, подписанным мастер-ключами Arch Linux; обычный пользователь подписывает локальным ключом мастер-ключ и доверяет последнему поручиться за разработчика.\n\n"
    },
    {
      "title": "Настройка pacman",
      "level": 3,
      "content": "Опция SigLevel в файле /etc/pacman.conf определяет уровень доверия, необходимый для установки пакета через pacman -S. Подробную информацию о SigLevel можно найти в руководстве pacman.conf(5) § PACKAGE AND DATABASE SIGNATURE CHECKING и в комментариях в самом файле. Можно настроить проверку подписи как глобально, так для каждого репозитория в отдельности. Если задать SigLevel глобально в разделе [options], то все пакеты, устанавливаемые через pacman -S, должны быть подписаны. При стандартном значении LocalFileSigLevel пакеты, которые вы собрали сами и устанавливаете через pacman -U, подписывать не требуется.\n\nНастройка по умолчанию позволяет устанавливать только те скачиваемые пакеты, которые подписаны доверенными ключами:\n\n```\n/etc/pacman.conf\n```\n\n```\nSigLevel = Required DatabaseOptional\n```\n\nПараметр TrustedOnly используется в pacman по умолчанию, то есть настройка ниже аналогична предыдущей:\n\n```\nSigLevel = Required DatabaseOptional TrustedOnly\n```\n\nТо же самое можно задать и для отдельного репозитория далее в файле конфигурации:\n\n```\n[core]\nSigLevel = PackageRequired\nInclude = /etc/pacman.d/mirrorlist\n```\n\nЗдесь явно задаётся проверка подписи для пакетов из этого репозитория, но подпись базы данных не проверяется. Если задать здесь значение Optional, то для этого репозитория глобальное значение Required будет отключено.\n\n"
    },
    {
      "title": "Инициализация связки ключей",
      "level": 3,
      "content": "Для инициализации связки ключей pacman выполните:\n\n```\n# pacman-key --init\n```\n\n"
    },
    {
      "title": "Проверка мастер-ключей",
      "level": 3,
      "content": "Первоначальная настройка ключей выполняется командой:\n\n```\n# pacman-key --populate\n```\n\nПри появлении запроса необходимо проверить подлинность мастер-ключей, поскольку они используются для подписи всех пакетов совместно с ключами разработчиков.\n\nPGP-ключи довольно велики (2048 бит или больше), что делает их неудобными для восприятия людьми. Поэтому на основе ключа вычисляется 40-разрядная шестнадцатеричная хэш-сумма, по которой можно проверить его подлинность. Также нужно помнить, что последние восемь цифр хэш-суммы часто используют как имя или (короткий) ID ключа, а последние шестнадцать — как длинный ID ключа.\n\n"
    },
    {
      "title": "Добавление ключей разработчика",
      "level": 3,
      "content": "Ключи официальных разработчиков и сопровождающих пакетов подписываются мастер-ключами, так что вам не нужно использовать pacman-key, чтобы подписывать их самостоятельно. Когда pacman встречает в подписи пакета ключ, который не удаётся распознать, то предлагает скачать его с сервера ключей, указанного в параметре keyserver в файле /etc/pacman.d/gnupg/gpg.conf или в опции --keyserver командной строки. Перечень серверов ключей можно найти в Википедии.\n\nКлюч разработчика нужно скачать всего единожды, после этого он будет использоваться для проверки любого пакета от этого разработчика.\n\n"
    },
    {
      "title": "Добавление неофициальных ключей",
      "level": 3,
      "content": "Этим способом можно добавить в связку ключей pacman свой ключ или включить подписанный неофициальный репозиторий.\n\nВ первую очередь получите у владельца ключа его ID (keyid). Добавьте полученный ключ в связку:\n\n1. Если ключ находится на сервере ключей, импортируйте его командой: # pacman-key --recv-keys keyid\n1. Если у вас есть ссылка на файл ключа, скачайте его и выполните: # pacman-key --add /путь/к/скачанному/файлу/ключа\n\n```\n# pacman-key --recv-keys keyid\n```\n\n```\n# pacman-key --add /путь/к/скачанному/файлу/ключа\n```\n\nВсегда старайтесь проверять отпечаток — как мастер-ключей, так любых других ключей, которые вы собираетесь подписать:\n\n```\n$ pacman-key --finger keyid\n```\n\nНаконец, подпишите импортированный ключ локально:\n\n```\n# pacman-key --lsign-key keyid\n```\n\nТеперь этот ключ будет считаться доверенным.\n\n"
    },
    {
      "title": "Отладка при помощи gpg",
      "level": 3,
      "content": "При отладке доступ к связке ключей pacman можно получить напрямую с помощью gpg, например:\n\n```\n# gpg --homedir /etc/pacman.d/gnupg --list-keys\n```\n\n"
    },
    {
      "title": "Регулярно обновляйте систему",
      "level": 3,
      "content": "Регулярное обновление системы позволяет избежать большинства ошибок, связанных с подписью. Если вы вынуждены отложить обновление на длительный срок, то перед обновлением системы синхронизируйте базу данных пакетов вручную и обновите пакет archlinux-keyring:\n\n```\n# pacman -Sy archlinux-keyring && pacman -Su\n```\n\nЭта команда не считается частичным обновлением, поскольку сначала синхронизируется база данных пакетов и обновляется пакет с ключами. Обе команды должны быть выполнены непосредственно перед началом обновления системы для работы проверки подписей всех обновляемых пакетов.\n\n"
    },
    {
      "title": "Регулярно синхронизируйте системные часы",
      "level": 3,
      "content": "Если время в системе будет неправильным, подписи могут считаться просроченными (или недействительными), и проверка подписи пакетов окончится неудачей. Регулярно синхронизируйте системные часы с помощью Network Time Protocol.\n\n"
    },
    {
      "title": "Подпись некорректна",
      "level": 3,
      "content": "Работа pacman-key зависит от настроек системного времени. Если системные часы неверны, при обновлении вы получите следующую ошибку:\n\n```\nошибка: НазваниеПакета: подпись от \"Пользователь <email@archlinux.org>\" некорректна\nошибка: не удалось завершить транзакцию (неверный или поврежденный пакет)\nОбнаружены ошибки, пакеты не обновлены.\n```\n\nПроверьте правильность системного времени. Например, если вы используете ntpd, выполните синхронизацию времени командами ntpd -qg и hwclock -w (запускайте от имени root).\n\nДругие клиенты NTP перечислены в разделе System time (Русский)#Синхронизация времени.\n\nЕсли системное время правильное, а ошибка всё равно есть, попробуйте следующее:\n\n"
    },
    {
      "title": "Удаление пакетов из кэша",
      "level": 4,
      "content": "Пакеты могли оказаться повреждены или не подписаны. Попробуйте удалить каждый проблемный пакет из кэша командой rm /var/cache/pacman/pkg/плохой_пакет* или сделайте полную очистку кэша, чтобы пакеты скачались заново.\n\n"
    },
    {
      "title": "Сброс ключей",
      "level": 4,
      "content": "Для сброса всех установленных в системе ключей удалите каталог /etc/pacman.d/gnupg. После этого выполните команды pacman-key --init и pacman-key --populate, чтобы добавить базовый набор ключей заново.\n\n"
    },
    {
      "title": "Отключение проверки подписи",
      "level": 4,
      "content": "Если подписи пакетов вас не интересуют, можно полностью отключить их проверку. Отредактируйте файл /etc/pacman.conf, раскомментировав следующую строку в разделе [options]:\n\n```\nSigLevel = Never\n#LocalFileSigLevel = Optional\n#RemoteFileSigLevel = Required\n```\n\nТакже необходимо закомментировать все параметры SigLevel в настройках репозиториев, потому что они имеют приоритет над глобальными настройками. В результате подпись пакетов проверяться не будет, как это было в pacman до четвёртой версии. В этом случае устанавливать связку ключей при помощи pacman-key не нужно. Позже при необходимости можно будет включить проверку подписи пакетов обратно.\n\n"
    },
    {
      "title": "Не удаётся импортировать ключи",
      "level": 3,
      "content": "Возможные причины:\n\n- Устаревший пакет archlinux-keyring;\n- Неправильные настройки даты и времени;\n- Интернет-провайдер блокирует порт, используемый для импорта PGP-ключей;\n- Кэш pacman содержит неподписанные пакеты, оставшиеся с предыдущих попыток;\n- Демон dirmngr не был правильно настроен.\n\nДавно не обновлявшийся пакет archlinux-keyring может привести к проблемам при синхронизации обновлений.\n\nНиже приведено несколько возможных решений.\n\n"
    },
    {
      "title": "Обновление системы",
      "level": 4,
      "content": "Прежде всего попробуйте обновить систему.\n\n"
    },
    {
      "title": "Смена сервера ключей",
      "level": 4,
      "content": "Если вы предполагаете, что проблема связана с сервером ключей, то можно попробовать переключиться на сервер ключей Ubuntu. Отредактируйте файл /etc/pacman.d/gnupg/gpg.conf, изменив значение keyserver:\n\n```\nkeyserver hkp://keyserver.ubuntu.com\n```\n\n"
    },
    {
      "title": "Удаление кэшированных пакетов",
      "level": 4,
      "content": "Возможно, кэш pacman в каталоге /var/cache/pacman/pkg/ содержит неподписанные пакеты. Очистите кеш вручную:\n\n```\n# pacman -Sc\n```\n\nчто удалит все пакеты в кэше, которые не были установлены.\n\n"
    },
    {
      "title": "Не удаётся опознать подпись пакета",
      "level": 3,
      "content": "Иногда при выполнении pacman -Syu вы можете столкнуться со следующей ошибкой:\n\n```\nerror: название_пакета: signature from \"создатель_пакета\" is unknown trust\n```\n\nТакое происходит, когда ключ создателя пакета отсутствует в локальной базе данных pacman-key или не является доверенным. Pacman не всегда имеет возможность проверить, был ли ключ скачан и является ли он доверенным, перед тем как продолжить обновление. Также возможно, что срок действия ключа истёк.\n\nВозможные решения:\n\n- Вручную обновить пакет archlinux-keyring перед обновлением системы;\n- обновить ключи командой pacman-key --refresh-keys;\n- сбросить ключи;\n- вручную подписать недоверенный ключ локально (не рекомендуется);\n- временно установить параметр SigLevel в значение TrustAll (не рекомендуется).\n\nПоследние два варианта ломают цепочку доверия и должны использоваться с осторожностью.\n\n"
    },
    {
      "title": "Обновление ключей через прокси",
      "level": 3,
      "content": "Чтобы можно было обновлять ключи через прокси-сервер, задайте параметр honor-http-proxy в файлах /etc/gnupg/dirmngr.conf и /etc/pacman.d/gnupg/dirmngr.conf. Подробнее смотрите GnuPG (Русский)#Использование сервера ключей.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- DeveloperWiki:Package Signing Proposal for Pacman\n- Pacman Package Signing – 1: Makepkg and Repo-add\n- Pacman Package Signing – 2: Pacman-key\n- Pacman Package Signing – 3: Pacman\n- Pacman Package Signing – 4: Arch Linux\n\n"
    }
  ]
}