{
  "title": "Pacman (Suomi)",
  "url": "https://wiki.archlinux.org/title/Pacman_(Suomi)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Aiheeseen liittyen\n\n- Creating packages\n- Downgrading packages\n- pacman/Package signing\n- pacman/Pacnew and Pacsave\n- pacman/Restore local database\n- pacman (Suomi)/Rosetta (Suomi)\n- pacman/Tips and tricks\n- FAQ (Suomi)#Paketinhallinta\n- System maintenance\n- Arch build system\n- Official repositories\n- Arch User Repository\n\nPacman-paketinhallintajärjestelmä on yksi tunnusosaisimmista ominaisuuksista Arch Linuxissa. Se yhdistää yksinkertaisen binääripakettiformaatin ja helppokäyttöisen koontijärjestelmän. Tavoitteena pacman paketinhallintajärjestelmällä on tehdä mahdolliseksi pakettien helppo hallinta, olivat ne sitten virallisista pakettivarastoista tai käyttäjän omista koonneista.\n\nPacman pitää järjestelmän ajan tasalla synkronisoimalla pakettilistoja isäntä palvelimen kanssa. Tämä palvelin/asiakasohjelma malli antaa myös mahdollisuuden käyttäjälle ladata/asentaa paketteja yksinkertaisella komennolla, jotka tulevat sitten kaikkien tarvittavien riippuvuuksien kanssa kokonaisuutena.\n\nPacman on kirjoitettu C-ohjelmointikielellä ja käyttää bsdtar(1) tar formaattia paketeissa.\n\n"
    },
    {
      "title": "Käyttö",
      "level": 2,
      "content": "Seuraavat mallit ovat vain osa asioista, mitä pacman voi tehdä ja suorittaa. Enemmän esimerkkejä löytyy pacman(8) manuaalista.\n\n"
    },
    {
      "title": "Pakettien asennus",
      "level": 3,
      "content": "Paketti on arkisto, joka sisältää:\n\n- kaikki (käännetyt) tiedostot sovelluksesta\n- metadataa liittyen sovellukseen, kuten sovelluksen nimen, version, riippuvuudet, ...\n- asennus tiedostot ja toimintaohjeet pacmanille\n- (vaihtoehtoisesti) lisätiedostoja elämän helpottamiseksi, kuten käynnistys/pysäytys skriptit\n\nArchin paketinhallintajärjestelmä pacman voi asentaa, päivittää, ja poistaa näitä paketteja. Pakettien käyttö ohjelmien kääntämisen ja asentamisen sijaan tuo paljon etuja:\n\n- helposti päivitettävä: pacman päivittää olemassa olevat paketit niin pian, kuin päivityksiä on vain saatavilla\n- riippuvuuksien tarkistelu: pacman käsittelee riippuvuudet käyttäjän puolesta, täytyy vain tarkentaa ohjelma ja pacman asentaa sen kaikkien muiden tarvittavien ohjelmien kanssa\n- puhdas poistaminen: pacmanilla on lista jokaisesta tiedostosta paketissa; tällä ominaisuudella varmistetaan se, ettei yhtäkään tiedostoa jätetä järjestelmään, kun jokin ohjelma päätetään poistaa.\n\n- Paketeilla on usein vaihtoehtoisia riippuvuuksia, jotka ovat paketteja tuomassa lisätoiminnallisuutta sovellukseen, mutta näitä ei varsinaisesti tarvita ohjelman toimimiseen. Kun pakettia asennetaan, pacman listaa paketin vaihtoehtoiset riippuvuudet, mutta ne eivät löydyt pacman.log tiedostosta. Käytä #Kysely pakettitietokannassa komentoja näyttääksesi vaihtoehtoisia riippuvuuksia paketista.\n- Kun asennetaan paketti, joka tarvitaan vain vaihtoehtoisena riippuvuutena johonkin muuhun pakettiin (eli toisin sanoen ei tarvita muutoin erityisesti), kehotetaan käyttämään --asdeps merkintää. Lisätiedolle, katso #Asennuksen syy kohta.\n\nNote: **älä** \n\n"
    },
    {
      "title": "Tiettyjen pakettien asentaminen",
      "level": 4,
      "content": "Yhden tai useamman paketin asentamiseen, mukaanlukien riippuvuudet, käytä seuraavaa komentoa:\n\n```\n# pacman -S paketin_nimi1 paketin_nimi2 ...\n```\n\nUseiden pakettien asentamiseen regexin avulla (katso tämä foorumi keskustelu):\n\n```\n# pacman -S $(pacman -Ssq paketti_regex)\n```\n\nJoskus paketista on olemassa useita versioita eri pakettivarastoissa (esim. extra ja testing). Paketin asentamiseen extra pakettivarastosta tässä esimerkissä, pakettivarasto täytyy määrittää paketin nimen edessä:\n\n```\n# pacman -S extra/paketin_nimi\n```\n\nUseiden pakettien asentamiseksi käyttäen samantapaisia nimiä voidaan käyttää aaltosulkeita. Esimerkiksi:\n\n```\n# pacman -S plasma-{desktop,mediacenter,nm}\n```\n\nTämä voidaan laajentaa hyvinkin monelle tasolle:\n\n```\n# pacman -S plasma-{workspace{,-wallpapers},pa}\n```\n\nVirtuaali paketti erityinen paketti, joka ei ole olemassa yksisteen, vaan sen antaa yksi tai useampi toinen paketti. Virtuaali paketti ei salli paketteja nimeämään erityistä pakettia riippuvuutena, siinä tapauksessa kun ehdokkaita on useita. Virtuaali pakettia ei pystytä asentamaan sen nimellä, sen sijaan ne asennetaan järjestelmään, kun asennetaan paketti joka sitten antaa tämän virtuaalisen paketin.\n\n"
    },
    {
      "title": "Pakettiryhmien asentaminen",
      "level": 4,
      "content": "Jotkin paketit kuuluvat pakettiryhmään, jotka voidaan asentaa kaikki samanaikaisesti. Esimerkiksi, tällä komennolla:\n\n```\n# pacman -S gnome\n```\n\nohjataan valitsemaan paketteja gnome ryhmästä, joita haluat asentaa.\n\nJoskus pakettiryhmä sisältää paljon paketteja ja saattaa olla että vain muutama niistä halutaan asentaa. Numeroiden erikseen kirjoittamisen sijaan voi joskus olla kätevämpää valita tai erotella paketit tai valikoima paketteja seuraavalla syntaksilla:\n\n```\nEnter a selection (default=all): 1-10 15\n```\n\njoka valitsee paketit 1 - 10 ja 15 asennusta varten, tai:\n\n```\nEnter a selection (default=all): ^5-8 ^2\n```\n\njoka valitsee kaikki paketit paitsi 5 - 8 ja 2 asennusta varten.\n\nNähdäksesi mitä kuuluu gnome pakettiryhmään, suorita:\n\n```\n# pacman -Sg gnome\n```\n\nVieraile myös sivulla https://archlinux.org/groups/ nähdäksesi mitä pakettiryhmiä on saatavilla.\n\n"
    },
    {
      "title": "Pakettien poistaminen",
      "level": 3,
      "content": "Yhden paketin poistamista varten, jättäen kaikki riippuvuudet asennettuna:\n\n```\n# pacman -R paketin_nimi\n```\n\nPaketin ja sen riippuvuuksien poistaminen, joita mikään muu paketti ei tarvitse:\n\n```\n# pacman -Rs paketin_nimi\n```\n\nYläpuolella oleva ei välttämättä aina toimi kun paketti kuuluu johonkin pakettiryhmään. Siinä tapauksessa koita:\n\n```\n# pacman -Rsu paketin_nimi\n```\n\nPaketin, sen riippuvuuksien ja kaikkien pakettien, jotka riippuvat tästä poistettavasta paketista, poistamiseen:\n\n```\n# pacman -Rsc paketin_nimi\n```\n\nPelkä paketin poistamiseen, eikä pakettien poistamiseen joiden toiminta riippuu kyseisestä paketista:\n\n```\n# pacman -Rdd paketin_nimi\n```\n\nPacman tallentaa tärkeät konfiguraatio tiedostot, kun poistetaan tiettyjä sovelluksia ja nimeää ne liitteellä: .pacsave. Näiden tiedostojen muodostamisen välttämiseksi voidaan käyttää -n merkkiä:\n\n```\n# pacman -Rn paketin_nimi\n```\n\n"
    },
    {
      "title": "Pakettien päivitys",
      "level": 3,
      "content": "- Käyttäjien oletetaan seuraavan ohjeistusta System maintenance#Upgrading the system osassa järjestelmän päivitykseen säännöllisesti eikä vain sokeasti suorittamaan seuraavaa komentoa.\n- Arch tukee vain täysiä järjestelmäpäivityksiä. Katso System maintenance#Partial upgrades are unsupported ja #Pakettien asennus lisätiedolle.\n\nPacman voi päivittää kaikki paketit järjestelmässä yhdellä komennolla. Tämän suorittaminen voi kumminkin viedä aikaa, riippuen siitä onko järjestelmä kuinka ajan tasalla. Seuraava komento synkronoi pakketivarastojen tietokannat ja päivittää järjestelmän paketit, poislukien \"paikalliset\" paketit jotka eivät ole konfiguroiduissa pakettivarastoissa:\n\n```\n# pacman -Syu\n```\n\n"
    },
    {
      "title": "Kysely pakettitietokannassa",
      "level": 3,
      "content": "Pacman kyselee paikallista pakettitietokantaa -Q merkillä, synkronoi tietokanna -S merkillä ja tiedosto tietokannan -F merkillä. Katso pacman -Q --help, pacman -S --help ja pacman -F --help jokaisen komennon omille vaihtoehdoille.\n\nPacman voi etsiä paketteja tietokannasta, etsien niin myös pakettien nimiä kuin kuvauksia:\n\n```\n$ pacman -Ss merkkijono1 merkkijono2 ...\n```\n\nJoskus, -sn sisään rakennettu ERE (Extended Regular Expressions) voi aiheuttaa ei-toivottuja tuloksia, joten se pitää rajata vastaamaan paketin nimeä; ei paketin kuvausta tai mitään muuta kenttää:\n\n```\n$ pacman -Ss '^vim-'\n```\n\nJo asennetujen pakettien hakeminen:\n\n```\n$ pacman -Qs merkkijono1 merkkijono2 ...\n```\n\nPaketti tiedostojen nimien hakeminen etäpaketeista:\n\n```\n$ pacman -F merkkijono1 merkkijono2 ...\n```\n\nLaajamittaisen lisätiedon näyttäminen annetusta paketista:\n\n```\n$ pacman -Si paketin_nimi\n```\n\nPaikallisten pakettien hakeminen:\n\n```\n$ pacman -Qi paketin_nimi\n```\n\nKaksi -i merkkiä näyttää listan varmuuskopioista ja näiden muokkaustilasta:\n\n```\n$ pacman -Qii paketin_nimi\n```\n\nHae lista paketin asentamista tiedostoista:\n\n```\n$ pacman -Ql paketin_nimi\n```\n\nHae lista etäpaketin asentamista tiedostoista:\n\n```\n$ pacman -Fl paketin_nimi\n```\n\nTodenna paketin asentamien tiedostojen olemassa olo:\n\n```\n$ pacman -Qk paketin_nimi\n```\n\nKaksi k merkkiä tekee läpikotaisen todennuksen.\n\nKyselemällä tietokantaa, jotta saadaan selville mille paketille tiedosto kuuluu:\n\n```\n$ pacman -Qo /polku/kyseiselle/tiedostolle\n```\n\nKyselemällä tietokantaa, jotta saadaan selville mille etäpaketille tiedosto kuuluu:\n\n```\n$ pacman -F /polku/kyseiselle/tiedostolle\n```\n\nListaa kaikki paketit joita ei enää tarvita riippuvuuksina (orvot):\n\n```\n$ pacman -Qdt\n```\n\nListaa kaikki erityisesti erikseen asennetut paketit, joita ei tarvita riippuvuuksina:\n\n```\n$ pacman -Qet\n```\n\nKatso Pacman/Tips and tricks lisä esimerkeillä.\n\n"
    },
    {
      "title": "Pactree",
      "level": 4,
      "content": "Nähdäksesi riippuvuuden puumallin halutusta paketista:\n\n```\n$ pactree paketin_nimi\n```\n\nNähdäksesi riippuu-puumallin halutusta paketista, anna reverse merkki -r pactree komennolle, tai käytä whoneeds pkgtoolsAUR paketista.\n\n"
    },
    {
      "title": "Tietokannan rakenne",
      "level": 4,
      "content": "Pacman tietokannat löytyvät normaalisti polusta /var/lib/pacman/sync. Jokaista määriteltyä pakettivarastoa kohden, tiedostossa /etc/pacman.conf, on olemassa vastaava tietokanta tiedosto samassa sijainnissa. Tietokanta tiedostot on gzipattu tar-arkistoiksi sisältäen polun jokaiselle paketille, kuten esimerkiksi which paketille:\n\n```\n$ tree which-2.21-5\n```\n\n```\nwhich-2.21-5\n|-- desc\n```\n\ndesc tiedosto sisältää metadataa kuten paketin kuvauksen, riippuvuudet, tiedoston koon ja MD5 tarkisteen.\n\n"
    },
    {
      "title": "Pakettien kätkömuistin putsaaminen",
      "level": 3,
      "content": "Pacman säilyttää ladattuja paketteja polussa /var/cache/pacman/pkg/ ja ei poista vanhoja tai poistettuja paketteja automaattisesti. Tässä käytännössä on joitain etuja:\n\n1. Tälläin pystytään palauttamaan paketti ilman paketin hakemista erikseen ja asentamista muilla tavoilla, kuten esimerkiksi Arch Linux Archiven kautta.\n1. Paketti, jonka asennus on poistettu, voidaan suoraan uudelleen asentaa kätkömuistikansiosta, ilman uutta latausta pakettitietokannasta.\n\nOn kumminkin tarpeellista putsata kjätkömuistia ajoittain näin välttämällä tämän loputtoman kasvun.\n\npaccache(8) skripti, joka tulee paketin pacman-contrib mukana, poistaa kaikki kätketyt versiot asennetuista ja poistetuista paketeista, paitsi 3 kaikkein tuoreinta, oletukselta:\n\n```\n# paccache -r\n```\n\nAktivoi ja käynnistä paccache.timer poistaaksesi käyttämättömiä paketteja viikoittain.\n\nVoidaan myös määrittää kuinka monta versiota halutaan pitää. Vain yhden menneen version pitämistä varten voidaan suorittaa:\n\n```\n# paccache -rk1\n```\n\nLisää -u/--uninstalled merkki rajaamaan paccache toimintaa poistetuille paketeille. Esimerkiksi jos halutaan poistaa kaikki poistetut versiot, käytä seuraavaa:\n\n```\n# paccache -ruk0\n```\n\nTai voit yhdistää sen molemmille asennetuille poistetuille paketeille. Esimerkiksi pitääksesi viimeisimmät kaksi asennettua pakettia, mutta poistaaksesi kaikki poistetut paketit kätkömuistista, käytä seuraavaa:\n\n```\n# paccache -rk2 -ruk0\n```\n\nKatso paccache -h lisäasetuksille.\n\nPacman sisältää myös sisään rakennetun asetuksen kätkömuistin ja tietokanta tiedostojen jäämien putsaamiseen pakettivarastoista, joita ei enää ole listattuna konfiguraatiossa /etc/pacman.conf. Pacman ei kumminkaan onnistu tarjoamaan mahdollisuutta pitää tiettyä määrää edellisiä versioita ja on siksi aggressiivisempi kuin paccachen oletusasetukset.\n\nPoistaaksesi kaikki kätketyt paketit, jotka eivät ole asennettuna, ja käyttämättömät synkronointi tietokannat, suorita:\n\n```\n# pacman -Sc\n```\n\nKaikkien tiedostojen poistamiseen kätkömuistista, käytä \"clean\" merkintää kahdesti, tämä on kaikkein agresiivisin lähestymistapa ja ei jätä mitään jälkeensä koko kansioon:\n\n```\n# pacman -Scc\n```\n\npkgcachecleanAUR ja pacleanerAUR ovat kaksi muuta vaihtoehtoista ohjelmaa putsaamiseen.\n\n"
    },
    {
      "title": "Muita komentoja",
      "level": 3,
      "content": "Lataa paketti ilman asennusta:\n\n```\n# pacman -Sw paketin_nimi\n```\n\nAsenna 'paikallinen' paketti, joka ei tuke etänä pakettivarastosta (esim. paketti on AUR:sta):\n\n```\n# pacman -U /polku/halutulle/paketille/paketin_nimi-versio.pkg.tar.zst\n```\n\nPitääksesi kopion asennetusta paketista pacmanin kätkömuistissa, käytä:\n\n```\n# pacman -U file:///polku/halutulle/paketille/paketin_nimi-versio.pkg.tar.zst\n```\n\nAsenna 'etä' paketti (ei pakettivarastosta, joka on määriteltynä pacmanin konfiguraatio tiedostossa):\n\n```\n# pacman -U http://www.esimerkki.com/repo/esimerkki.pkg.tar.zst\n```\n\nHillitäksesi -S, -U ja -R tapahtumien käyttöä, voidaan myös käyttää -p.\n\nPacman listaa asennettavat tai poistettavat paketit aina ja kysyy käyttäjältä lupaa ennenkuin mitään muutoksia tehdään.\n\n"
    },
    {
      "title": "Asennuksen syy",
      "level": 3,
      "content": "Pacman tietokanta jakaa asennetut paketit kahteen ryhmään syyn mukaan, miksi ne on asennettu:\n\n- selvästi asennetut: paketit, jotka kirjaimellisesti annettiin yleisinä pacman -S tai -U komentoina;\n- riippuvuudet: paketit ,joita ei erikseen ole asennettu (yleisesti) antamalla erillistä argumenttia pacman asennus komennolle. Nämä on asennettu epäsuorasti toisen paketin tarvitsemana joka on selvästi asennettu.\n\nKun pakettia asennetaan, on mahdollista pakottaa sen asennus syy riippuvuudeksi komennolla:\n\n```\n# pacman -S --asdeps paketin_nimi\n```\n\nKun uudelleen asennetaan pakettia, kuitenkin, sen hetkinen asennus syy pidetään oletukselta.\n\nLista selvästi asennetuista paketeista voidaan näyttää komennolla pacman -Qe ja täydentävä lista riippuvuuksista voidaan näyttää komennolla pacman -Qd.\n\nVaihtaaksesi aiemmin asennetun paketin asennus syytä, suorita:\n\n```\n# pacman -D --asdeps paketin_nimi\n```\n\nKäytä --asexplicit tehdäksesi vastakkaisen operaation.\n\n"
    },
    {
      "title": "Etsi pakettia joka sisältää tietyn tiedoston",
      "level": 3,
      "content": "Synkronoi tiedostotietokanta:\n\n```\n# pacman -Fy\n```\n\nEtsi pakettia, joka sisältää tiedoston kuten:\n\n```\n$ pacman -F pacman\n```\n\n```\ncore/pacman 5.2.1-1 (base base-devel) [installed]\n    usr/bin/pacman\n    usr/share/bash-completion/completions/pacman\nextra/xscreensaver 5.43-1\n    usr/lib/xscreensaver/pacman\n```\n\nEdistyneempää toimintaa varten voidaan asentaa pkgfile, joka käyttää erillistä tietokantaa kaikilla tiedostoilla ja niihin liittyvillä paketeilla.\n\n"
    },
    {
      "title": "Konfiguraatio",
      "level": 2,
      "content": "Pacmanin asetukset löytyvät /etc/pacman.conf tiedostosta: tämä on se paikka minne käyttäjä konfiguroi ohjelman toimimaan halutulla tavalla. Syvällisemmin tietoa tästä löytyy pacman.conf(5) manuaalisivulta.\n\n"
    },
    {
      "title": "Yleiset asetukset",
      "level": 3,
      "content": "Yleiset asetukset löytyvät [options] osassa. Lue pacman.conf(5) tai katso oletus pacman.conf tiedostoon lisätiedolle mitä on mahdollista tehdä.\n\n"
    },
    {
      "title": "Versioiden vertaaminen ennen päivitystä",
      "level": 4,
      "content": "Vanhojen ja uusien versioiden näkeminen saatavilla olevista paketeista, poista kommentointi \"VerbosePkgLists\" riviltä tiedostossa /etc/pacman.conf. Ulostulo komennolla pacman -Syu on seuraavanlainen:\n\n```\nPackage (6)             Old Version  New Version  Net Change  Download Size\n\nextra/libmariadbclient  10.1.9-4     10.1.10-1      0.03 MiB       4.35 MiB\nextra/libpng            1.6.19-1     1.6.20-1       0.00 MiB       0.23 MiB\nextra/mariadb           10.1.9-4     10.1.10-1      0.26 MiB      13.80 MiB\n```\n\n"
    },
    {
      "title": "Ohita paketin päivittäminen",
      "level": 4,
      "content": "Tietyn paketin ohittamista varten järjestelmän päivityksessä, määritä tämä seuraavasti:\n\n```\nIgnorePkg=linux\n```\n\nUseampia paketteja varten käytä välilyönnillä eroteltu lista, tai käytä useampia IgnorePkg rivejä. Myös glob mallia voidaan käyttää. Jos halutaan ohittaa paketteja vain kerran, voidaan myös käyttää --ignore merkintää komentorivillä - mutta tämän listan paketit pitää erotella pilkulla.\n\nOn silti mahdollista päivittää sivuutettu paketti käyttämällä pacman -S: tässä tapauksessa pacman muistuttaa siitä, että paketti on sisälletty IgnorePkg lauseessa.\n\n"
    },
    {
      "title": "Ohita pakettiryhmä päivityksessä",
      "level": 4,
      "content": "Kuten yksitäisten pakettienkin kanssa, on pakettien ryhmien ohittaminen myös mahdollista:\n\n```\nIgnoreGroup=gnome\n```\n\n"
    },
    {
      "title": "Ohita tiedostojen päivittäminen",
      "level": 4,
      "content": "Kaikki tiedostot, jotka listataan NoUpgrade direktiivillä, jätetään kokonaan huomioimatta paketin asennuksesta/päivityksestä, ja uudet tiedostot asennetaan .pacnew laajennuksella.\n\n```\nNoUpgrade=polku/kyseiseen/tiedostoon\n```\n\n"
    },
    {
      "title": "Ohita tiedostoja asennuksessa",
      "level": 4,
      "content": "Ohittaaksesi asennuksen aina joidenkin tiettyjen polkujen kohdalla, listaa ne NoExtract alle. Esimerkiksi, systemd yksiköiden asennuksen välttämiseksi kokeile seuraavaa:\n\n```\nNoExtract=usr/lib/systemd/system/*\n```\n\nMyöhemmät säännöt menevät aikaisempien päälle ja voit kieltää säännön lisäämällä alkuun ! merkin.\n\n"
    },
    {
      "title": "Ylläpidä useita konfiguraatio tiedostoja",
      "level": 4,
      "content": "Jos on olemassa useita konfiguraatio tiedostoja (esim. pääkonfiguraatio ja konfiguraatio, jossa testing pakettivarasto on aktivoituna) ja asetuksia halutaan jakaa konfiguraatioiden välillä, voidaan käyttää Include asetusta, joka aina määritetään itse konfigurointi tiedostoissa, esim.:\n\n```\nInclude = /polku/yleisiin/asetuksiin\n```\n\nmissä /polku/yleisiin/asetuksiin tiedosto sisältää samat asetukset molemmille konfiguraatioille.\n\n"
    },
    {
      "title": "Hookit",
      "level": 4,
      "content": "Pacman voi suorittaa esi- ja jälki toimia hookien avulla /usr/share/libalpm/hooks/ polusta; useampia polkuja voidaan määrittää HookDir asetuksella pacman.conf tiedostossa, joka oletukselta on /etc/pacman.d/hooks. Hook tiedostojen nimet pitää olla nimettynä .hook päätteellä. Pacman hookit eivät ole interaktiivisia.\n\nPacman hookeja käytetään, esimerkiksi, yhdessä systemd-sysusers ja systemd-tmpfiles kanssa automaattisesti luomaan järjestelmän käyttäjiä ja tiedostoja pakettien asennuksen aikana. Esimerkiksi, tomcat8 määrittää, että tämä haluaa järjestelmän käyttäjän nimellä tomcat8 ja joitain tämän käyttäjän omistamia polkuja, omistukseensa. Pacman hookit systemd-sysusers.hook ja systemd-tmpfiles.hook herättävät systemd-sysusers ja systemd-tmpfiles, kun pacman päättää, että tomcat8 sisältää tiedostoja, jotka määrittävät käyttäjiä ja tmp tiedostoja.\n\nLisätiedolle alpm hookeille, katso alpm-hooks(5).\n\n"
    },
    {
      "title": "Pakettivarastot ja peilit",
      "level": 3,
      "content": "Erityisen [options] osan lisäksi, jokainen [section] tiedostossa pacman.conf määrittää pakettiriippuvuuden käytettäväksi. Pakettivarasto on looginen kokoelma paketteja, jotka ovat fyysisesti varastoituna yhdellä tai useammalla palvelimella: tästä syystä jokainen palvelin on peilinä pakettivarastolle.\n\nPakettivarastot jaetaan virallisiin ja epävirallisiin pakettivarastoihin. Pakettivarastojen järjestyksellä konfiguraatio tiedostossa on merkitystä; pakettivarastot listattuna ensimmäisenä ovat arvojärjestyksen päällimäiset ja joita käytetään ennen myöhemmin listattuja pakettivarastoja, kun paketeilla on identtinen nimi näissä varastoissa. Versionumeroa ei huomioida tässä tapauksessa. Pakettivaraston käyttöä varten, sen jälkeen kun se on lisätty, pitää ensin päivittää koko järjestelmä.\n\nJokainen pakettivarasto osa sallii peililistan määrittämisen, joko suoraan tiedostoon tai erillisessä tähän tarkoitukseen tarkoitetussa tiedostossa Include toimintaohjeella: esimerkiksi, peilit virallisille pakettivarastoille ovat sisälletynä /etc/pacman.d/mirrorlist tiedostosta. Katso Mirrors artikkeli peilien konfiguroinille.\n\n"
    },
    {
      "title": "Paketin turvallisuus",
      "level": 4,
      "content": "Pacman tukee pakettien allekirjoituksia, mikä luo lisäturvakerroksen paketeille. Oletus konfiguraatiossa, SigLevel = Required DatabaseOptional, aktivoidaan allekirjoitus varmenne kaikille paketeille globaalilla tasolla: tämä voidaan ohittaa pakettivarastoa kohden SigLevel riveillä. Lisätietoa pakettien allekirjoituksista ja näiden varmentamisesta löytyy artikkelista pacman-key.\n\n"
    },
    {
      "title": "\"Failed to commit transaction (invalid or corrupted package)\" virheilmoitus",
      "level": 3,
      "content": "Katso .part tiedostoja (osittain ladattu tiedosto) polusta /var/cache/pacman/pkg/ ja poista ne (johtuu usein oman komennon XferCommand käytöstä tiedostossa pacman.conf).\n\n```\n# find /var/cache/pacman/pkg/ -iname \"*.part\" -delete\n```\n\n"
    },
    {
      "title": "Paketteja ei voida hakea asennuksessa",
      "level": 3,
      "content": "Tämä virhe ilmenee ilmoituksena Not found in sync db, Target not found tai Failed retrieving file.\n\nEnsin, varmistu siitä että paketti on oikeasti olemassa. Jos olet varma sen olemassa olosta, pakettilistasi saattaa olla päivittämättä. Yritä suorittaa komento pacman -Syu päivityksen pakottamiseksi kaikille pakettilistoille ja lopulta päivittääksesi järjestelmä. Varmistu myös siitä, että valitut peilit ovat ajan tasalla ja pakettivarastot ovat oikein konfiguroitu.\n\nVoi olla mahdollista myös ettei pakettivarastoa, joka sisältää tämän paketin, ole aktivoituna järjestelmässäsi, esimerkiksi kyseinen paketti voisi olla multilib pakettivarastossa, mutta multilib ei ole aktivoituna pacman.conf tiedostossa.\n\nKatso myös Frequently asked questions (Suomi)#Miksi virallisissa varastoissa on vain yksi versio jokaista jaettua kirjastoa?.\n\n"
    },
    {
      "title": "Signature from \"Käyttäjä <email@esimerkki.org>\" is unknown trust, installation failed",
      "level": 3,
      "content": "Mahdollisia ratkaisutapoja:\n\n- Päivitä avaimet, toisin sanoen suorita pacman-key --refresh-keys\n- Manuaalisesti päivitä archlinux-keyring paketti ensin, toisin sanoen suorita pacman -Sy archlinux-keyring && pacman -Su\n- Seuraa ohjeita täältä.\n\n"
    },
    {
      "title": "\"Warning: current locale is invalid; using default \"C\" locale\" virheilmoitus",
      "level": 3,
      "content": "Kuten virheilmoituksessa sanotaan, paikallistusasetukset eivät ole oikein konfiguroituna. Katso Locale.\n\n"
    },
    {
      "title": "Pacman ei kunnioita välityspalvelimen asetuksia",
      "level": 3,
      "content": "Varmistu siitä että tarpeelliset ympäristömuuttujat ($http_proxy, $ftp_proxy jne.) ovat asetettuna. Jos käytät pacmania sudon kanssa, täytyy konfiguroida sudo antamaan nämä ympäristömuuttujat pacmaniin. Varmista myös, että dirmngr konfiguraatiossa honor-http-proxy on /etc/pacman.d/gnupg/dirmngr.conf tiedostossa kunniottamassa välityspalvelinta kun avaimia päivitetään.\n\n"
    },
    {
      "title": "Kuinka asennan kaikki paketit uudelleen, pitämällä tiedon siitä mitkä paketit ovat erityisesti asennettuna tai riippuvuutena?",
      "level": 3,
      "content": "Asentaaksesi uudelleen kaikki alkuperäiset paketit: pacman -Qnq | pacman -S - tai pacman -S $(pacman -Qnq) (-S asetus säilyttää asennus syyt oletukselta).\n\nSen jälkeen pitää uudelleen asentaa kaikki ulkopuoliset paketit, jotka voidaan listata komennolla pacman -Qmq.\n\n"
    },
    {
      "title": "Katso myös",
      "level": 2,
      "content": "- Pacman Kotisivu\n- libalpm(3)\n- pacman(8)\n- pacman.conf(5)\n- repo-add(8)\n\n"
    }
  ]
}