{
  "title": "Pacman (Français)/Restore local database (Français)",
  "url": "https://wiki.archlinux.org/title/Pacman_(Fran%C3%A7ais)/Restore_local_database_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Signes indiquant que pacman a besoin d'une restauration de la base de données locale :\n\n- pacman -Q n'indique rien, et pacman -Syu indique à tort que le système est à jour.\n- Lorsque l'on essaie d'installer un paquet à l'aide de pacman -S package et produit une liste des dépendances déjà satisfaites.\n\nLa base de données de pacman sur les logiciels installés, /var/lib/pacman/local, a probablement été corrompue ou supprimée. Bien que cela soit un sérieux problème, il est possible de la restaurer en suivant les instructions ci-dessous.\n\nVérifiez tout d'abord que le fichier de log de pacman est bien présent :\n\n```\n$ ls /var/log/pacman.log\n```\n\nS'il n'existe pas, on ne pourra pas continuer avec cette méthode. Vous pouvez éventuellement utiliser le script de détection des paquets de Xyne pour recréer le base de donnée. Sinon, la solution la plus probable est de réinstaller l'ensemble du système.\n\n"
    },
    {
      "title": "Générer la liste de récupération des paquets",
      "level": 2,
      "content": "Installez le paquet pacman-contrib pour obtenir paclog-pkglist.\n\nCréez le script de filtrage des logs et rendez-le exécutable :\n\n```\npacrecover\n```\n\n```\n#!/bin/bash -e\n\n. /etc/makepkg.conf\n\nPKGCACHE=$((grep -m 1 '^CacheDir' /etc/pacman.conf || echo 'CacheDir = /var/cache/pacman/pkg') | sed 's/CacheDir = //')\n\npkgdirs=(\"$@\" \"$PKGDEST\" \"$PKGCACHE\")\n\nwhile read -r -a parampart; do\n  pkgname=\"${parampart[0]}-${parampart[1]}-*.pkg.tar.{xz,zst}\"\n  for pkgdir in ${pkgdirs[@]}; do\n    pkgpath=\"$pkgdir\"/$pkgname\n    [ -f $pkgpath ] && { echo $pkgpath; break; };\n  done || echo ${parampart[0]} 1>&2\ndone\n```\n\nExécutez le script (en passant éventuellement des répertoires supplémentaires avec des paquets en tant que paramètres) :\n\n```\n$ paclog-pkglist /var/log/pacman.log | ./pacrecover >files.list 2>pkglist.orig\n```\n\nDe cette manière, deux fichiers seront créés : files.list avec les fichiers des paquets encore présents sur la machine et pkglist.orig, à partir duquel les paquets doivent être téléchargés. L'opération ultérieure peut entraîner des incohérences entre les fichiers des anciennes versions du paquet, encore présents sur la machine, et les fichiers trouvés dans la nouvelle version. Ces disparités devront être corrigées manuellement.\n\nVoici un moyen de restreindre automatiquement la deuxième liste aux paquets disponibles dans un dépôt :\n\n```\n$ { cat pkglist.orig; pacman -Slq; } | sort | uniq -d > pkglist\n```\n\nNote: **réessayez la commande précédente** \n\nVérifiez si certains paquets de base sont manquants et ajoutez-les à la liste :\n\n```\n$ comm -23 <(pacman -Sgq base | sort) pkglist.orig >> pkglist\n```\n\nProcédez une fois que le contenu des deux listes vous semble satisfaisant, car elles seront utilisées pour restaurer la base de données des paquets installés par pacman ; /var/lib/pacman/local/.\n\n"
    },
    {
      "title": "Effectuer la récupération",
      "level": 2,
      "content": "Créez la fonction Bash pour la récupération :\n\n```\nrecovery-pacman() {\n    pacman \"$@\"  \\\n    --log /dev/null   \\\n    --noscriptlet     \\\n    --dbonly          \\\n    --overwrite \"*\"   \\\n    --nodeps          \\\n    --needed\n}\n```\n\n--log /dev/null permet d'éviter de polluer inutilement les logs de pacman, --needed permet de gagner du temps en sautant les paquets déjà présents dans la base de données, --nodeps permet d'installer les paquets mis en cache, même si les paquets en cours d'installation dépendent de versions plus récentes. Le reste des options permet à pacman de fonctionner sans lire/écrire le système de fichiers.\n\nAlimenter la base de données de synchronisation :\n\n```\n# pacman -Sy\n```\n\nLancez la génération de la base de données en installant les fichiers de paquets disponibles localement à partir de files.list:\n\n```\n# recovery-pacman -U $(< files.list)\n```\n\nInstaller le reste à partir de pkglist:\n\n```\n# recovery-pacman -S $(< pkglist)\n```\n\nMettez à jour la base de données locale de manière que les paquets qui ne sont pas requis par un autre paquet soient marqués comme explicitement installés et les autres comme des dépendances. Vous devrez faire très attention à l'avenir lorsque vous supprimerez des paquets, la base de données originale ayant été perdue, c'est le mieux que nous puissions faire.\n\n```\n# pacman -D --asdeps $(pacman -Qq)\n# pacman -D --asexplicit $(pacman -Qtq)\n```\n\nFacultativement, vérifier que tous les paquets installés ne sont pas corrompus :\n\n```\n# pacman -Qk\n```\n\nAccessoirement, voir pacman (Français)/Tips and tricks (Français)#Recherche des fichiers n'appartenant à aucun paquet.\n\nMettez à jour tous les paquets :\n\n```\n# pacman -Su\n```\n\n"
    }
  ]
}