{
  "title": "Pacserve (Português)",
  "url": "https://wiki.archlinux.org/title/Pacserve_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Pacserve permite compartilhar facilmente pacotes do pacman entre computadores. Isso é muito útil se você tiver uma conexão lenta com a Internet, com várias máquinas funcionando com o Arch Linux.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale pacserveAUR.\n\nFinalmente, inicie/habilite pacserve.service.\n\nNo caso de você usar iptables, você provavelmente terá que inciar pacserve-ports.service também. Para outros firewalls, abra a porta TCP 15678 e a porta UDP 15679. A porta UDP pode ser limitada a tráfego multicast apenas.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "O pacserve.service pode ser configurado editando PACSERVE_ARGS em /etc/pacserve/pacserve.service.conf. Execute pacserve --help para ver as opções disponíveis.\n\n"
    },
    {
      "title": "Avahi",
      "level": 3,
      "content": "Para anunciar ou descobrir o Pacserve usando mDNS, adicione a opção --avahi a PACSERVE_ARGS em /etc/pacserve/pacserve.service.conf.\n\n"
    },
    {
      "title": "Uso autônomo",
      "level": 2,
      "content": "Em vez de pacman, use o wrapper pacsrv para executar uma atualização, instalar pacotes e assim por diante. Ele irá baixar automaticamente todos os pacotes da LAN, se alguém os hospedar com o pacserve lá. Caso contrário, basta baixá-los dos espelhos da internet, como geralmente. Por exemplo:\n\n```\n# pacsrv -Syu\n# pacsrv -S openssh\n```\n\n"
    },
    {
      "title": "Configurar o Pacman para usar Pacserve",
      "level": 2,
      "content": "Se você estiver executando o daemon do pacserve e deseja que o pacman use o wrapper, insira a seguinte linha (antes de quaisquer outras linhas Include) em cada repositório no /etc/pacman.conf.\n\n```\nInclude = /etc/pacman.d/pacserve\n```\n\nAqui está um exemplo para o repositório do Xyne:\n\n```\n/etc/pacman.conf\n```\n\n```\n...\n[xyne-x86_64]\nSigLevel = Required\nInclude  = /etc/pacman.d/pacserve\nServer   = http://xyne.archlinux.ca/repos/xyne\n...\n```\n\nAlternativamente (para somente espelhos oficiais), você pode inserir a linha Include em cima do arquivo mirrorlist do Pacman ou deixar o pacman.conf-insert_pacserve gerar um arquivo pacman.conf para você.\n\n"
    },
    {
      "title": "Problemas se usar baixadores externos no pacman.conf",
      "level": 3,
      "content": "Se você estiver usando um baixador externo, como o wget, pacsrv pode retornar erros ao baixar. Para contornar esses erros, basta colocar entre aspas simples as strings de url e de formatação de saída (%u e %o):\n\n```\nXferCommand = /usr/bin/wget --timeout=6 --passive-ftp -c -O '%o' '%u'\n```\n\n"
    },
    {
      "title": "Máquinas não veem uma a outra",
      "level": 3,
      "content": "A detecção de peers depende da versão do python3-threaded_serversAUR. Quadros multicast TCP provenientes de uma versão diferente do serviço são descartados. Nesse caso, journalctl -u pacserve avisa sobre esses quadros não reconhecidos. Atualize este pacote primeiro e depois reinicie o pacserve.service.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Tópico do pacserve no fórum do Arch Linux\n\n"
    }
  ]
}