{
  "title": "PAM (Русский)",
  "url": "https://wiki.archlinux.org/title/PAM_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Безопасность\n- pam_mount\n- pam_usb\n- pam_abl\n- pam_oath\n\nLinux Pluggable Authentication Modules (PAM) — фреймворк для аутентификации пользователей в системе. Со страницы проекта:\n\nВ этой статье объясняются базовые настройки Arch Linux по умолчанию для PAM для аутентификации локальных и удалённых пользователей. Внесение изменений в настройки по умолчанию описывается в отдельных статьях.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Пакет pam является зависимостью мета-пакета base и таким образом уже установлен в Arch по умолчанию. Модули PAM устанавливаются в /usr/lib/security.\n\nВ репозиториях доступны дополнительные пакеты, примеры есть в разделе #Руководства по настройке.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "PAM использует несколько путей в /etc; список стандартных файлов настроек можно посмотреть с помощью команды pacman --query --list pam | grep /etc. Они настраивают либо #Параметры безопасности для модулей, либо #Базовый стек PAM.\n\n"
    },
    {
      "title": "Параметры безопасности",
      "level": 3,
      "content": "Каталог /etc/security содержит системные настройки переменных, предлагаемых методами аутентификации. При базовой установке он заполняется стандартными файлами конфигурации из апстрима.\n\nArch Linux не предоставляет специфичную для дистрибутива конфигурацию этих файлов. Например, файл /etc/security/pwquality.conf можно использовать для определения общесистемных значений по умолчанию для контроля качества паролей. Однако для его использования нужно в #Базовый стек PAM включить модуль pam_pwquality.so, который по умолчанию отключен.\n\nНекоторые возможности описаны в разделе #Настройка параметров безопасности.\n\n"
    },
    {
      "title": "Базовый стек PAM",
      "level": 3,
      "content": "Настройки в каталоге /etc/pam.d/ связывают приложения с определёнными системными схемами аутентификации. Во время установки базовой системы в этот каталог добавляются настройки:\n\n- из пакета pambase, который содержит базовый стек специфичной для Arch Linux конфигурации PAM для использования приложениями, и\n- из других базовых пакетов. Например, util-linux добавляет конфигурацию для программы login и других программ, пакет shadow добавляет стандартные настройки Arch Linux для защиты и изменения базы данных пользователей (смотрите Пользователи и группы).\n\nРазличные файлы настроек базовой установки связываются вместе и складываются во время выполнения. Например, при входе локального пользователя в систему программа login считывает политику system-local-login, которая, в свою очередь, считывает другие политики:\n\n```\n/etc/pam.d/\n```\n\n```\nlogin -> system-local-login -> system-login -> system-auth\n```\n\nДругие приложения могут применять другие политики. Например, openssh устанавливает свою собственную PAM-политику sshd:\n\n```\n/etc/pam.d/\n```\n\n```\nsshd -> system-remote-login -> system-login -> system-auth\n```\n\nСледовательно, выбор файла для настройки в стеке имеет значение. В приведённом выше примере можно затребовать специальный метод аутентификации или только для sshd путём изменения одноимённого файла, или для всех удалённых входов путём изменения файла system-remote-login; оба изменения не повлияют на локальные входы. Изменение настроек system-login или system-auth повлияет и на локальные, и на удалённые входы.\n\nКак и в случае с sshd, любое приложение, использующее pam, должно установить свою политику в /etc/pam.d, чтобы интегрироваться в стек PAM и полагаться на него должным образом. Если приложение этого не сделает, будет применяться политика по умолчанию /etc/pam.d/other, запрещающая вход и выводящая предупреждение в журнал.\n\n```\n$ ldd /usr/bin/login | grep pam\n```\n\n```\nlibpam.so.0 => /usr/lib/libpam.so.0 (0x000003d8c32d6000)\nlibpam_misc.so.0 => /usr/lib/libpam_misc.so.0 (0x000003d8c30d2000)\n```\n\nСправочные страницы pam(8) и pam.d(5) описывают стандартизированное содержимое файлов настроек. В частности, они объясняют четыре группы PAM: account, auth, password и session, а также управляющие значения, которые могут быть использованы для настройки стека и поведения модулей.\n\nКроме того, в /usr/share/doc/Linux-PAM/index.html устанавливается обширная документация установлена, которая, помимо различных руководств, содержит man-страницы для каждого из стандартных модулей.\n\n"
    },
    {
      "title": "Руководства по настройке",
      "level": 2,
      "content": "В этом разделе представлен обзор статей, описывающих, как изменять конфигурацию PAM и как интегрировать специальные новые модули PAM в стек PAM. Обратите внимание, что man-страницы для модулей обычно не имеют расширения .so в своём названии.\n\n"
    },
    {
      "title": "Настройка параметров безопасности",
      "level": 3,
      "content": "В следующих разделах описаны примеры изменения параметров PAM по умолчанию:\n\n- Безопасность#Требования к паролю с pam_pwquality\n\n- Безопасность#Блокировка из-за неудачных попыток входа\n\n- Безопасность#Доступ только для конкретных пользователей\n\n- Realtime process management#Configuring PAM и Безопасность#Ограничение на количество процессов\n\n- Переменные окружения#С помощью pam_env\n\n"
    },
    {
      "title": "Настройка стека PAM и модулей",
      "level": 3,
      "content": "Следующие статьи описывают, как изменить #Базовый стек PAM для специальных случаев использования.\n\nМодули PAM, доступные в официальных репозиториях:\n\n- pam_mount\n\n- ECryptfs#Auto-mounting\n\n- Dm-crypt/Mounting at login\n\n- Интеграция Active Directory#Настройка PAM\n\n- LDAP authentication\n\n- YubiKey#Linux user authentication with PAM\n\n- pam_oath\n\n- fprint\n\nМодули PAM, доступные в пользовательском репозитории Arch:\n\n- pam_autologin\n\n- pam_usb\n\n- Ключи SSH#pam_ssh\n\n- pam_abl\n\n- EncFS\n\n- Google Authenticator (Русский)\n\n- Very Secure FTP Daemon#PAM with virtual users\n\n"
    },
    {
      "title": "Дополнительные пакеты PAM",
      "level": 2,
      "content": "Помимо упомянутых выше пакетов, в пользовательском репозитории Arch есть дополнительные модули и инструменты PAM.\n\n- Pamtester — Программа для тестирования подключаемых модулей аутентификации (PAM)\n\nХотя в AUR есть тег PAM, не все доступные пакеты его содержат. Поэтому может понадобиться поиск по описанию пакета.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- linux-pam.org - сайт проекта\n- Understanding and configuring PAM - вводная статья\n\n"
    }
  ]
}