{
  "title": "PAM (Español)",
  "url": "https://wiki.archlinux.org/title/PAM_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-12-11** \n\nArtículos relacionados\n\n- Security (Español)\n- pam_mount\n- pam_usb\n- pam_abl\n- pam_oath\n- Universal 2nd Factor\n\nLos módulos de autenticación conectables de Linux (Linux Pluggable Authentication Modules, o simplemente PAM) proporcionan un marco para la autenticación de usuarios en todo el sistema. Para citar el proyecto:\n\nEste artículo explica los valores predeterminados de configuración base de Arch Linux para PAM para autenticar usuarios locales y remotos. La aplicación de cambios a los valores predeterminados está sujeta a artículos especializados reticulados por tema.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "El paquete pam es una dependencia del meta paquete base y, por lo tanto, instalado normalmente en un sistema Arch. Los módulos PAM están instalados exclusivamente en /usr/lib/security.\n\nLos repositorios contienen una serie de paquetes PAM opcionales, en #Configuración guiada se muestran unos ejemplos.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Un número de rutas en /etc son relevantes para PAM, ejecute pacman --query --list pam | grep /etc para ver los archivos de configuración por defecto creados. Se relacionan con los #Parámetros de seguridad para los módulos, o la configuración #Apilado base de PAM.\n\n"
    },
    {
      "title": "Parámetros de seguridad",
      "level": 3,
      "content": "La ruta /etc/security contiene la configuración específica del sistema para las variables que ofrecen los métodos de autenticación. La instalación básica instala los archivos de configuración predeterminados.\n\nNote que Arch Linux no proporciona una configuración específica de distribución para estos archivos. Por ejemplo, el archivo /etc/security/pwquality.conf se puede utilizar para definir los valores predeterminados de todo el sistema para la calidad de la contraseña. Sin embargo, para activarlo, el módulo pam_pwquality.so debe añadirse al #Apilado base de PAM de los módulos, que no es el caso por defecto.\n\nVéase #Configuración de los parámetros de seguridad para algunas de las posibilidades.\n\n"
    },
    {
      "title": "Apilado base de PAM",
      "level": 3,
      "content": "La ruta /etc/pam.d/ es exclusiva de la configuración de PAM para vincular las aplicaciones a los esquemas individuales de autenticación de los sistemas. Durante la instalación de la base del sistema se genera:\n\n- el paquete pambase, que contiene la pila base de la configuración PAM específica de Arch Linux para ser utilizada por las aplicaciones, y\n- otros paquetes base. Por ejemplo, util-linux añade la configuración para el inicio de sesión central y otros programas, el paquete shadow añade los valores predeterminados de Arch Linux para proteger y modificar la base de datos del usuario (véase Usuarios y grupos).\n\nLos diferentes archivos de configuración de la instalación base se enlazan y apilan durante el tiempo de ejecución. Por ejemplo, en el inicio de sesión de un usuario local, la aplicación login carga la política system-local-login, que a su vez carga otros:\n\n```\n/etc/pam.d/\n```\n\n```\nlogin -> system-local-login -> system-login -> system-auth\n```\n\nPara una aplicación diferente, se puede aplicar una ruta diferente. Por ejemplo, openssh instala su política de PAM sshd:\n\n```\n/etc/pam.d/\n```\n\n```\nsshd -> system-remote-login -> system-login -> system-auth\n```\n\nEn consecuencia, la elección del archivo de configuración en la pila es importante. Para el ejemplo anterior, se podría requerir un método de autenticación especial solo para sshd o para todos los inicios de sesión remotos cambiando system-remote-login; ambos cambios no afectarían los inicios de sesión locales. Aplicar el cambio a system-login o system-auth en cambio afectaría los inicios de sesión locales y remotos.\n\nAl igual que en el ejemplo de sshd, se requiere que cualquier aplicación consciente de PAM instale su política en /etc/pam.d para integrar y confiar en la pila de PAM apropiadamente. Si una aplicación no lo hace, se aplica la política predeterminada para denegar de /etc/pam.d/other y se registra una advertencia.\n\nNote: **debe** \n\n```\n$ ldd /usr/bin/login | grep pam\n```\n\n```\nlibpam.so.0 => /usr/lib/libpam.so.0 (0x000003d8c32d6000)\nlibpam_misc.so.0 => /usr/lib/libpam_misc.so.0 (0x000003d8c30d2000)\n```\n\nLas páginas del manual del paquete PAM pam(8) y pam.d(5) describen el contenido estandarizado de los archivos de configuración. En particular, explican los cuatro grupos de PAM: gestión de cuentas, autenticación, contraseña y sesión, así como los valores de control que pueden utilizarse para configurar el apilamiento y el comportamiento de los módulos.\n\nAdemás, se ha instalado una extensa documentación en /usr/share/doc/Linux-PAM/index.html que, entre varias guías, contiene páginas de manual navegables para cada uno de los módulos estándar.\n\nNote: **ningún usuario** \n\n"
    },
    {
      "title": "Ejemplos",
      "level": 4,
      "content": "Dos ejemplos breves para ilustrar la advertencia anterior.\n\nPrimero, tomamos las siguientes dos líneas:\n\n```\n/etc/pam.d/system-auth\n```\n\n```\nauth      required  pam_unix.so     try_first_pass nullok\nauth      optional  pam_permit.so\n```\n\nDe pam_unix(8): \"El componente de autenticación pam_unix.so realiza la tarea de verificar las credenciales (contraseña) de los usuarios. La acción predeterminada de este módulo es no permitir que el usuario acceda a un servicio si su contraseña oficial está en blanco.\" - siendo lo último para lo que se utiliza pam_permit.so. Basta con intercambiar los valores de control required y optional para desactivar la autenticación de contraseña, es decir, cualquier usuario puede iniciar sesión sin proporcionar una contraseña.\n\nSegundo, como ejemplo contrario, por configuración predeterminada de pam_nologin.so en /etc/pam.d/login, creando el siguiente archivo:\n\n```\n# touch /etc/nologin\n```\n\nda como resultado que ningún usuario que no sea root pueda iniciar sesión (si se permiten inicios de sesión del superusuario, otro valor predeterminado para Arch Linux). Para volver a permitir los inicios de sesión, elimine el archivo. Posiblemente, desde la consola con la que lo creó.\n\nCon eso como fondo, véase #Configuración del apilado y los módulos de PAM para configuraciones de casos de uso particulares.\n\n"
    },
    {
      "title": "Configuración guiada",
      "level": 2,
      "content": "Esta sección proporciona una descripción general del contenido que detalla cómo aplicar cambios a la configuración de PAM y cómo integrar nuevos módulos PAM especiales en la pila de PAM. Tenga en cuenta que, por lo general, se puede acceder a las páginas del manual de los módulos al eliminar la extensión .so.\n\n"
    },
    {
      "title": "Configuración de los parámetros de seguridad",
      "level": 3,
      "content": "Las siguientes secciones describen ejemplos para cambiar la configuración predeterminada de parámetros de PAM:\n\n- Security#Enforcing strong passwords with pam_pwquality\n\n- Security#Lock out user after three failed login attempts\n\n- Security#Allow only certain users\n\n- Realtime process management#Configuring PAM and Security#Limit amount of processes\n\n- Environment variables#Using pam_env\n\n"
    },
    {
      "title": "Configuración del apilado y los módulos de PAM",
      "level": 3,
      "content": "Los siguientes artículos detallan cómo cambiar el #Apilado base de PAM para casos de uso especiales.\n\nMódulos PAM de los repositorios oficiales:\n\n- pam_mount\n\n- ECryptfs#Auto-mounting\n\n- Dm-crypt/Mounting at login (Español)\n\n- Active Directory integration (Español)#Configurar PAM\n\n- LDAP authentication\n\n- YubiKey#Linux user authentication with PAM\n\n- pam_oath\n\n- fprint\n\nMódulos PAM del repositorio de usuarios de Arch:\n\n- pam_usb\n\n- SSH keys#pam_ssh\n\n- pam_abl\n\n- EncFS\n\n- Google Authenticator\n\n- Very Secure FTP Daemon#PAM with virtual users\n\n"
    },
    {
      "title": "Otros paquetes de PAM",
      "level": 2,
      "content": "Aparte de los paquetes mencionados hasta ahora, el repositorio de usuarios de Arch Contiene varios módulos y herramientas PAM adicionales.\n\nLas utilidades de propósito general relacionadas con PAM son:\n\n- Pamtester — Programa para probar la instalación de los módulos de autenticación conectables (PAM)\n\nTenga en cuenta que AUR cuenta con una etiqueta de palabra clave para PAM, pero no todos los paquetes disponibles se actualizan para incluirlo. Por lo tanto, puede ser necesario buscar en la descripción del paquete.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- linux-pam.org - La página de inicio del proyecto\n- Entendiendo y configurando PAM - Un artículo introductorio\n\n"
    }
  ]
}