{
  "title": "Parental control (Français)",
  "url": "https://wiki.archlinux.org/title/Parental_control_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Il existe plusieurs méthodes pour protéger et limiter l'activité des enfants sur un ordinateur.\n\n"
    },
    {
      "title": "Applications",
      "level": 2,
      "content": "- timekpr-next — Timekpr-nExT, une nouvelle application de gestion du temps d'écran, simple et facile à utiliser, qui permet d'optimiser le temps passé devant l'ordinateur.\n\n- timeoutd — Alternative légère à timekpr, il analyse /var/run/utmp toutes les minutes et vérifie /etc/timeouts à la recherche d'une entrée correspondant à un utilisateur restreint.\n\n- logkeys — Un service qui enregistre les frappes de touches dans un fichier journal en vue d'une inspection ultérieure.\n\n"
    },
    {
      "title": "Liste blanche avec Tinyproxy et Firehol",
      "level": 2,
      "content": "La section suivante vous permettra de filtrer l'accès de n'importe quel utilisateur à l'internet avec une liste blanche d'url en utilisant fireholAUR et tinyproxy (ou tinyproxy-gitAUR). (ou tinyproxy-gitAUR).\n\n/etc/tinyproxy/tinyproxy.conf comprend les modifications suivantes :\n\n```\nFilterURLs On\nFilterDefaultDeny Yes\nFilter \"/etc/tinyproxy/whitelist\"\n```\n\n/etc/tinyproxy/whitelist doit contenir les url qui ne seront accessibles qu'aux utilisateurs sélectionnés. Un exemple simple :\n\n```\n(www|wiki|static).archlinux.org\ngoogle.com\n```\n\n/etc/firehol/firehol.conf doit contenir la ligne suivante :\n\n```\ntransparent_proxy \"80 443\" 8888 \"nobody root bin moncompte\"\n```\n\nOù moncompte est le compte qui ne doit pas être filtré par Tinyproxy.\n\n"
    },
    {
      "title": "Contrôle Parental OpenDNS",
      "level": 2,
      "content": "OpenDNS fournit des services DNS gratuits comme alternative aux serveurs par défaut de votre FAI. En outre, ils offrent des capacités de filtrage optionnelles. Différents niveaux de filtrage sont possibles ; voir la page principale d'OpenDNS pour plus de détails.\n\nPour les adresses IP dynamiques, c'est une bonne idée de les maintenir à jour sur OpenDNS. Utilisez ddclient et éditez /etc/ddclient/ddclient.conf comme suit :\n\n```\n# OpenDNS.com account-configuration\nuse=web, web=myip.dnsomatic.com\nserver=updates.opendns.com\nprotocol=dyndns2\nlogin=myopendns@email.address\npassword=myopendnspassword\nmyhostname\n```\n\nVous pouvez même parfois configurer votre routeur pour qu'il utilise OpenDNS, ce qui permet d'étendre la protection à tous les appareils connectés à ce routeur.\n\n"
    },
    {
      "title": "Modifier /etc/hosts",
      "level": 2,
      "content": "Vous pouvez configurer votre fichier /etc/hosts pour bloquer l'accès à certains domaines. Une approche plus draconienne consiste à n'autoriser que les domaines explicitement mentionnés dans /etc/hosts, comme décrit ici. Si vous faites cela, n'oubliez pas que cela affectera l'ensemble de votre système, par exemple pacman peut être incapable de se connecter au serveur de mise à jour à moins que vous ne fassiez une liaison appropriée dans votre /etc/hosts.\n\n"
    },
    {
      "title": "Liste de blocage utilisant named",
      "level": 2,
      "content": "Voir également : BIND\n\nCréer un fichier de zone stub (\"/var/named/denied.zone\") qui redirige tout vers localhost.\n\n```\n@                               1D IN SOA   ns1.example.com. root.example.com. (\n                                   42    ; serial (yyyymmdd##)\n                                   3H    ; refresh\n                                   15M   ; retry\n                                   1W    ; expiry\n                                   1D )  ; minimum ttl\n                               1D  IN  NS      ns.example.com.\n                      1D  IN  A       127.0.0.1\n                      1D  IN  AAAA    ::1\n\n*                      1D  IN  A       127.0.0.1\n*                      1D  IN  AAAA    ::1\n```\n\nAjoutez :\n\n```\nzone \"SOME-DOMAIN-1.TLD\" IN { type master; file \"denied.zone\"; };\n...\nzone \"SOME-DOMAIN-N.TLD\" IN { type master; file \"denied.zone\"; };\n```\n\nà named.conf.\n\nLes versions récentes de named supportent DoT et DoH, vous pouvez donc exposer named à l'internet et l'utiliser en dehors de votre réseau local.\n\n(Par exemple, Firefox peut utiliser DoH, les appareils Android ont un paramètre global \"serveur DNS privé\" pour DoT).\n\n"
    },
    {
      "title": "Squid",
      "level": 2,
      "content": "Squid est un proxy d'accès aux fonctionnalités qui prend en charge l'autorisation, la mise en cache, le bumping TLS, la transparence avec le pare-feu, les listes d'accès basées sur le MAC, l'IP, le domaine et le SNI TLS.\n\nIl existe un article séparé.\n\nEn combinaison avec nftables, Squid peut être utilisé pour contrôler entièrement les sites web sur lesquels les enfants peuvent naviguer (voir [1]).\n\n"
    },
    {
      "title": "Extension pour navigateur",
      "level": 2,
      "content": "Il existe plusieurs extensions pour les navigateurs web qui permettent de filtrer le contenu des sites web. Certains d'entre eux peuvent même bloquer des pages en l'examinant, et pas seulement leur URL. Sachez toutefois que ce n'est pas une méthode très sûre. Le démarrage de Firefox en mode sans échec, la manipulation du répertoire de profil de Firefox ou du gestionnaire de profil de Firefox sont des moyens évidents d'essayer de désactiver les extensions sur Firefox. Si tout cela échoue, l'enfant peut simplement utiliser un autre navigateur.\n\n"
    }
  ]
}