{
  "title": "Parted (Türkçe)",
  "url": "https://wiki.archlinux.org/title/Parted_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "İlgili makaleler\n\n- fdisk (Türkçe)\n- GPT fdisk (Türkçe)\n- Partitioning (Türkçe)\n\nGNU Parted bölümleme tablolarının oluşturulması ve değiştirilmesini sağlayan bir programdır. GParted ise parted için grafiksel bir arayüzdür.\n\n"
    },
    {
      "title": "Kurulum",
      "level": 2,
      "content": "Aşağıdaki paketlerden birini kurun:\n\n- parted – yalnızca komut satırı.\n- gparted – parted için grafiksel ön uç.\n\n"
    },
    {
      "title": "Kullanım",
      "level": 2,
      "content": "Parted iki moda sahiptir: komut satırı ve interaktif. Parted her zaman şu komutla başlatılmalıdır:\n\n```\n# parted device\n```\n\ndevice burada /dev/sda, /dev/nvme0n1, /dev/mmcblk0 gibi bir blok aygıtı ismidir. Eğer device argümanı belirtilmez ise, parted hangi aygıtı istediğinizi tahmin etmeyi dener.\n\n"
    },
    {
      "title": "Komut satırı modu",
      "level": 3,
      "content": "Komut satırı modunda, yukarıda verilen komutun ardına bir veya daha fazla parted komutu yerleştirilir. Örneğin:\n\n```\n# parted /dev/sda mklabel gpt mkpart P1 ext3 1MiB 8MiB\n```\n\n"
    },
    {
      "title": "İnteraktif mod",
      "level": 3,
      "content": "İnteraktif mod, otomatik olarak bütün komutları başta belirtilen aygıta uygulayarak işimizi kolaylaştırır ve bizi gereksiz tekrardan kurtarır.\n\nBir cihazda interaktif çalışmaya başlamak için, aşağıdaki komutu çalıştırın:\n\n```\n# parted /dev/sdx\n```\n\nFark edeceksiniz ki komut satırı istemi bir kareden (#), (parted)'a dönmüştür; bu da demek oluyor ki bu yeni istem aşağıda verilen örnekleri çalıştırırken yeniden yazılacak bir komut değildir.\n\nMevcut bütün komutların bir listesini görmek için:\n\n```\n(parted) help\n```\n\nİşiniz bittiğinde, veya başka bir cihaza geçmek istediğinizde, şu komut ile parted'dan çıkabilirsiniz:\n\n```\n(parted) quit\n```\n\nÇıktıktan sonra, komut satırı istemi tekrar eski haline (#) dönecektir.\n\nBir komuta parametre verilmezse, parted sizden isteyecektir. Örneğin:\n\n```\n(parted) mklabel\nNew disk label type? gpt\n```\n\n"
    },
    {
      "title": "Yuvarlama",
      "level": 2,
      "content": "Birçok bölümleme sistemi karmaşık kısıtlamalara sahip olduğundan, Parted istediğinizden biraz farklı bir sonuç verebilir. (Örneğin, bir bölümü 10.4Mb'de olmak yerine 10.352Mb'de başlatır) Eğer hesaplanan değerler istenilenden çok sapmışsa Parted doğrulama isteyecektir. Eğer ne istediğinizden eminseniz veya Parted'ın tam olarak ne yaptığından emin olmak istiyorsanız bölümlerin bitiş noktalarını sektör halinde (\"s\" ekiyle) belirtebilirsiniz ve \"unit s\" komutuyla bitiş noktalarının sektör halinde gösterilmesini sağlayabilirsiniz.\n\nparted-2.4'den itibaren, başlangıç ya da bitiş noktaları \"MiB\", \"GiB\", \"TiB\" gibi IEC binary birimleriyle belirtildiğinde parted bu değerleri byte'a (\"B\") çevirerek alır. Bu kayda değer bir sapmaya neden olmaz; buna karşılık \"4GB\" de başlaması istenilen bir bölüm, o noktadan öncesine ya da sonrasına 500MB'e kadar sapabilmektedir. Sonuç olarak, bölüm oluştururken byte (\"B\"), sektör (\"s\") veya \"MiB\" gibi IEC binary birimleri kullanılmalıdır, ve \"MB\", \"GB\" gibi birimler kullanılmamalıdır.\n\n"
    },
    {
      "title": "Yeni bölümleme tablosu oluşturma",
      "level": 3,
      "content": "- Bölümlendirme öncesi NVMe ve Advanced Format sürücülerinizin optimum mantıksal sektör boyutunu kullandığına emin olun.\n- SSD bölümlendirme öncesi SSD bellek hücresi temizliği yapmayı göz önünde bulundurun.\n\nDaha önceden bölümlendirilmemiş bir diski bölümlemek istediğinizde veya diskin bölümleme tipini değiştirmek istediğinizde yeni bir bölümleme tablosu oluşturmanız gerekir. Ayrıca disk bölümleme tablosunu yeniden oluşturmak bölüm düzeninin en baştan yeniden yapılması istenildiğinde de kolaylık sağlar.\n\nYeni bölümleme tablosunun oluşturulacağı aygıtı açın:\n\n```\n# parted /dev/sdx\n```\n\nSonra GUID Bölümleme Tablosu oluşturmak için aşağıdaki komutu kullanın:\n\n```\n(parted) mklabel gpt\n```\n\nBunun yerine Master Boot Record/MS-DOS bölümleme tablosu kullanmak isterseniz aşağıdaki komutu kullanın:\n\n```\n(parted) mklabel msdos\n```\n\n"
    },
    {
      "title": "Bölüm düzenleri",
      "level": 3,
      "content": "Aygıtların kaç bölüme ayrılacağını, bu bölümlerin boyutunu ve bölümlerin kurulu sistemde hangi dizine (mount point'e) bağlanacağına karar verebilirsiniz. Zorunlu olan bölümler için Bölüm düzenleri'ne bakın.\n\nAşağıdaki komut bölüm oluşturmak için kullanılacaktır:\n\n```\n(parted) mkpart part-type-or-part-label fs-type start end\n```\n\n- part-type-or-part-label bölümleme tablosunun türüne bağlı olarak farklı algılanır: MBR düzeni: part-type yani bölüm türü olarak alınır, bu da primary, extended veya logical'den herhangi biri olabilir. GPT düzeni: part-label yani bölüm etiketi olarak alınır, bu da bölümün PARTLABEL niteliğini ayarlar. Eğer bir bölüm etiketi oluşturmak istemiyorsanız tırnak içinde boş dizgi (\"\") yazabilirsiniz. Not: İnternetteki birçok öğretici video, GPT düzeni için bile olsa mkpart primary ile başlayan komutlar kullanıyor. Bu yanlış bir uygulamadır ve bölüme etiketi olarak \"primary\" ayarlamanıza sebep olur.\n- fs-type yani dosya sistemi türü, help mkpart ile listesini alabildiğiniz bölümlerden birini alır. Bu listeden kullanacağınız dosya sistemine en yakın olanı seçin. Bu ayar yalnızca bir belirteç görevi görür. mkpart komutu gerçekten dosya sistemini oluşturmayacaktır, fs-type parametresi yalnızca parted tarafından GPT bölümler için bölüm türü GUID'inin, ve MBR bölümlerde bölüm türü ID'sinin ayarlanmasını sağlar. İpucu: parted linux dosya sistemi biçimlerinin hepsini aynı \"Linux filesystem\" bölüm türü (GUID 0FC63DAF-8483-4772-8E79-3D69D8477DE4 veya ID 0x83) olarak kaydeder, yani ext4 biçimli bir bölüm için, örneğin, ext2 kullanılmasında hiçbir sakınca yoktur.\n- start aygıtın başlangıcından, oluşturulacak bölümün başına olan mesafedir. Bir sayı ardında birimden oluşur, örneğin 1MiB bölümün 1 MiB noktasında başlayacağı anlamına gelir.\n- end aygıtın başlangıcından (bölümün değil), oluşturulacak bölümün sonuna olan mesafedir. start ile aynı sözdizimine sahiptir. Örneğin 100% bölümü cihazın sonunda bitir anlamına gelir (yani kalan bütün alanı kullan).\n\n- MBR düzeni: part-type yani bölüm türü olarak alınır, bu da primary, extended veya logical'den herhangi biri olabilir.\n- GPT düzeni: part-label yani bölüm etiketi olarak alınır, bu da bölümün PARTLABEL niteliğini ayarlar. Eğer bir bölüm etiketi oluşturmak istemiyorsanız tırnak içinde boş dizgi (\"\") yazabilirsiniz. Not: İnternetteki birçok öğretici video, GPT düzeni için bile olsa mkpart primary ile başlayan komutlar kullanıyor. Bu yanlış bir uygulamadır ve bölüme etiketi olarak \"primary\" ayarlamanıza sebep olur.\n\n- MBR ve GPT arasında geçişe izin vermek için MBR düzenindeki bir diskte diskin başlangıcında en az 33 tane 512-byte'lık sektör (16.5 KiB) boşluk bıraklılması önerilir.\n- Aygıtta kullanılmayacak boşluk bırakmak istemiyorsanız, her bölümün diğerinin bittiği yerde başladığından emin olun.\n\n```\nWarning: The resulting partition is not properly aligned for best performance.\nIgnore/Cancel?\n```\n\nAşağıdaki komut /boot dizinini taşayacak bölümü önyüklenebilir olarak işaretlemeye yarar:\n\n```\n(parted) set partition boot on\n```\n\n- partition işaretlenecek bölümün numarasıdır (print komutunun çıktısından bakabilirsiniz).\n- esp GPT düzeninde boot ile aynıdır. [2]\n\n"
    },
    {
      "title": "UEFI/GPT örnekleri",
      "level": 4,
      "content": "Her şartta, önyüklenebilir bir EFI sistem bölümü zorunludur.\n\nEğer yeni bir EFI sistem bölümü oluşturuyorsanız, aşağıdaki komutu kullanın (tavsiye edilen boyut en az 300 MiB'dır):\n\n```\n(parted) mkpart \"EFI system partition\" fat32 1MiB 301MiB\n(parted) set 1 esp on\n```\n\nBölüm düzeninin kalanı tamamen size kalır. Örneğin kalan alanın %100'ünü kullanan bir diğer bölüm için:\n\n```\n(parted) mkpart \"my partition label\" ext4 301MiB 100%\n```\n\n/ (20 GiB) ve /home (kalan alan) dizinleri ayrı bölümlerde tutmak isterseniz:\n\n```\n(parted) mkpart \"root partition\" ext4 301MiB 20.5GiB\n(parted) mkpart \"home partition\" ext4 20.5GiB 100%\n```\n\nVe ayrı ayrı / (20 GiB), swap (4 GiB), and /home (kalan alan) bölümleri isterseniz:\n\n```\n(parted) mkpart \"root partition\" ext4 301MiB 20.5GiB\n(parted) mkpart \"swap partition\" linux-swap 20.5GiB 24.5GiB\n(parted) mkpart \"home partition\" ext4 24.5GiB 100%\n```\n\n"
    },
    {
      "title": "BIOS/MBR örnekleri",
      "level": 4,
      "content": "Bütün disk alanını kullanan tek bir birincil bölüm isterseniz aşağıdaki komutu kullanın:\n\n```\n(parted) mkpart primary ext4 1MiB 100%\n(parted) set 1 boot on\n```\n\nAşağıdaki örnekte, 20 GiB'lik / bölümü, ardından kalan bütün alanı kullanan bir /home bölümü oluşturulur:\n\n```\n(parted) mkpart primary ext4 1MiB 20GiB\n(parted) set 1 boot on\n(parted) mkpart primary ext4 20GiB 100%\n```\n\nSon olarak aşağıdaki örnekte, ayrı ayrı /boot (100 MiB), / (20 GiB), swap (4 GiB) ve /home (kalan alan) bölümleri oluşturur:\n\n```\n(parted) mkpart primary ext3 1MiB 100MiB\n(parted) set 1 boot on\n(parted) mkpart primary ext3 100MiB 20GiB\n(parted) mkpart primary linux-swap 20GiB 24GiB\n(parted) mkpart primary ext3 24GiB 100%\n```\n\n"
    },
    {
      "title": "Bölüm boyutlarının değiştirilmesi",
      "level": 3,
      "content": "- parted ile yalnızca bölüm sonları hareket ettirilebilir.\n- parted v3.2 itibariyle resizepart #İnteraktif mod kullanımı gerektirebilir.[3]\n- Bu yönergeler ext2, ext3, ext4 veya btrfs dosya sistemlerine ait bölümler için geçerlidir.\n\nBir bölümü büyütüyorsanız önce bölümü sonra dosya sisteminin boyutunu değiştirmeniz gerekir. Ancak küçültüyorsanız veri kaybını önlemek için önce dosya sistemini ondan sonra bölümün boyutunu değiştirmeniz gerekir.\n\n"
    },
    {
      "title": "Bölümlerin büyütülmesi",
      "level": 4,
      "content": "Bir bölümü büyütmek için (parted interaktif modda):\n\n```\n(parted) resizepart number end\n```\n\nnumber burada büyütülecek bölümün numarasıdır ve end bölümün biteceği yeni bitiş noktasıdır (Önceki boyutundan büyük olması gerekir).\n\nBundan sonra, (ext2/3/4) dosya sisteminin boyutunu değiştirmek için (Eğer size girilmez ise bölümün boyutunu kullanılır):\n\n```\n# resize2fs /dev/sdaX size\n```\n\nVeya Btrfs dosya sistemini büyütmek için:\n\n```\n# btrfs filesystem resize size /path/to/mount/point\n```\n\n/path/to/mount/point burada büyütülen bölümün bağlama noktasıdır. size ise dosya sisteminin yeni boyutu (16G) veya yeni boyutun önceki boyutuyla olan farkıdır (+1G). max kullanarak da bölümde kalan bütün alanı kullanabilirsiniz.\n\n"
    },
    {
      "title": "Bölümlerin küçültülmesi",
      "level": 4,
      "content": "Bölüm üzerindeki ext2/3/4 dosya sistemini küçültmek için:\n\n```\n# resize2fs /dev/sdaX size\n```\n\nBtrfs dosya sistemini küçültmek için:\n\n```\n# btrfs filesystem resize size /path/to/mount/point\n```\n\n/path/to/mount/point burada küçültülecek bölümün bağlama noktasıdır ve size da bölümün yeni boyutudur.\n\nBundan sonra bölümü küçültmek için (parted interaktif modunda):\n\n```\n(parted) resizepart number end\n```\n\nnumber burada küçültülecek bölümün numarasıdır ve end de bölümün yeni sonudur (bu da önceki sondan daha önce olmalıdır).\n\nBittiğinde, util-linux'dan resizepart komutunu kullanarak çekirdeğe yeni boyutu bildirin:\n\n```\n# resizepart device number size\n```\n\ndevice burada bölümü taşayan aygıt, number bölümün sayısı ve size da bölümün 512-byte sektörler halinde yeni boyutudur.\n\n"
    },
    {
      "title": "Uyarılar",
      "level": 2,
      "content": "rm, mklabel, mkpart gibi doğuştan tehlikeli komutlar dışında tehlikeli olabilecek herhangi bir şey yapılmadan önce Parted sizi uyaracaktır.\n\n"
    },
    {
      "title": "Hizalama",
      "level": 3,
      "content": "Bir bölüm oluşturulurken parted hatalı hizalamayı uyarabilir ancak doğrusunu size söylemez. Örneğin:\n\n```\n(parted) mkpart primary fat16 0 32M\nWarning: The resulting partition is not properly aligned for best performance.\nIgnore/Cancel?\n```\n\nBu uyarı bölümün başlangıcının hizalanmadığı anlamına gelir. \"Ignore\" diyerek devam edin ve \"print\" ile bölüm tablosunu yazdırın. Bölümün nerede başladığını görün ve hata ortadan kalkana kadar bu bölümün başını 2'nin katlarına yuvarlayarak yeniden oluşturun. Örnek olarak, 512 byte sektörlere ait bir flaş bellekte, Parted bölümlerin 2048'in katı olan sektörlerde başlamasını isteyecektir, bu da 1 MiB hizalama anlamına gelir.\n\nparted'ın sizin için doğru hizalamayı hesaplamasını denemesini istiyorsanız, başlangıç noktasını sabit bir değer yerine 0% olarak girin. Örneğin bir büyük ext4 bölümü için:\n\n```\n(parted) mkpart primary ext4 0% 100%\n```\n\n"
    },
    {
      "title": "Hizalamayı kontrol etme",
      "level": 3,
      "content": "Önceden bölümlendirilmiş bir diskte parted\\'ı bölümün hizasının doğru olup olmadığını kontrol etmek için kullanabilirsiniz. Örneğin /dev/sda üzerindeki 1. bölümü doğrulamak için:\n\n```\n# parted /dev/sda\n(parted) align-check optimal 1\n1 aligned\n```\n\n"
    },
    {
      "title": "Ayrıca bakınız",
      "level": 2,
      "content": "- GNU parted - Parted Kullanıcı Kılavuzu\n- How to align partitions for best performance using parted\n- Resize an ext3/ext4 partition\n- Resmi GParted forumları[dead link 2025-01-22 ⓘ]\n\n"
    }
  ]
}