{
  "title": "Parted (Русский)",
  "url": "https://wiki.archlinux.org/title/Parted_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- fdisk (Русский)\n- gdisk\n- Разметка дисков\n\nGNU Parted - это программа для создания и редактирования таблиц разделов. GParted это GUI для неё.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет parted. Для графического интерфейса установите пакет gparted, графический интерфейс для parted.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Parted имеет два режима: коммандная строка и интерактивный. Parted всегда должен начинаться с:\n\n```\n# parted device\n```\n\nгде device это жёсткий диск, который нужно отредактировать (например /dev/sda). Если не указать device аргумент, parted может предположить какое устройство вы хотите.\n\n"
    },
    {
      "title": "Режим командной строки",
      "level": 3,
      "content": "В режиме командной строки, он принимает одну или более команд. Например:\n\n```\n# parted /dev/sda mklabel gpt mkpart P1 ext3 1MiB 8MiB\n```\n\n"
    },
    {
      "title": "Интерактивный режим",
      "level": 3,
      "content": "Интерактивный режим упрощает процесс разбиения и уменьшает ненужное повторение с помощью автоматического применения всех команд разбиения на указанное устройство.\n\nЧтобы начать работу с устройством, выполните:\n\n```\n# parted /dev/sdx\n```\n\nВы заметите что префикс командной строки (#) отличается от (parted): это также означает, что новая строка не является командой, которую нужно вводить вручную при запуске команд в примерах.\n\nЧтобы увидеть список доступных команд, введите:\n\n```\n(parted) help\n```\n\nКогда закончите, или если хотите сделать таблицу разделов или схему для другого устройства, выйдите из parted с помощью:\n\n```\n(parted) quit\n```\n\nПосле выхода, префикс командной строки измениться обратно на #.\n\nЕсли вы не указываете параметр команде, Parted подскажет вам его. Например:\n\n```\n(parted) mklabel\nNew disk label type? gpt\n```\n\n"
    },
    {
      "title": "Округление",
      "level": 2,
      "content": "Поскольку многие системы разделов имеют сложные ограничения, Parted обычно будет делать что-то немного другое, чем вы просили. (Например, создание раздела начиная с 10.352Mb, не с 10.4Mb) Если рассчитанные значения слишком сильно отличаются, Parted попросит у вас подтверждения. Если вы точно знаете, что хотите, или точно видите, что делает Parted, это может помочь указать конечные точки разделов в секторах. (с помощью \"s\" суффикса) и указать \"unit s\" команду, чтобы конечные точки раздела отображались в секторах.\n\nВ parted-2.4, когда вы указываете начало и/или конец значения с использованием двоичных единиц IEC, например “MiB”, “GiB”, “TiB”, и т.д., parted обрабатывает эти значения как точные и равны тому же числу, указанному в байтах (то есть с суффиксом \"B\"), в том, что он не дает “полезный” диапазон. Сравните это с запросом на запуск раздела “4GB”, который может фактически разрешиться в некотором секторе до 500MB до или после этого момента. Таким образом, при создании раздела лучше указывать единицы байтов (“B”), сектора (“s”), или двоичные блоки IEC, такие как “MiB”, но не “MB”, “GB”, и т.д.\n\n"
    },
    {
      "title": "Создание новой таблицы разделов",
      "level": 3,
      "content": "Вам нужно (пере)создать таблицу разделов устройства, если она никогда ранее не разбивалась, или когда вы хотите изменить тип этих таблиц разделов. Пересоздание таблицы разделов устройства также будет полезно когда схема разделов требует реконструкции с нуля.\n\nОткройте каждое устройство, таблица разделов которого должна быть (пере)создана с помощью:\n\n```\n# parted /dev/sdx\n```\n\nЗатем, чтобы создать новую GUID Partition Table, используйте следующую команду:\n\n```\n(parted) mklabel gpt\n```\n\nЧтобы создать новую Master Boot Record/MS-DOS таблицу разделов, используйте:\n\n```\n(parted) mklabel msdos\n```\n\n"
    },
    {
      "title": "Схемы разделов",
      "level": 3,
      "content": "Вы можете выбрать количество и размер разделов, на которые должны быть разделены устройства, и какие каталоги будут использоваться для монтирования разделов в установленной системе (также известной как mount points). Смотрите Разбиение#Схема разметки для необходимых разделов.\n\nСледующая команда будет использоваться для создания разделов:\n\n```\n(parted) mkpart part-type-or-part-label fs-type start end\n```\n\n- part-type-or-part-label интерпретируется по-разному в зависимости от таблицы разделов: MBR: параметр интерпретируется как part-type, который может быть primary, extended или logical. GPT: параметр интерпретируется как part-label, который устанавливает PARTLABEL атрибут раздела. Метка раздела должна быть установлена всегда, так как mkpart не разрешает создавать разделы без метки. Примечание: Во многих туториалах в интернете используются команды которые начинаются с mkpart primary даже для GPT. Они не правильные, это установило бы \"primary\" как метку раздела.\n- fs-type - идентификатор, выбранный из числа перечисленных путем ввода help mkpart как наиболее близкое соответствие к файловой системе, которую вы будете использовать. Команда mkpart фактически не создает файловую систему: fs-type параметр будет просто использоваться parted чтобы установить 1-байтовый код, который используется загрузчиками для \"предварительного просмотра\" какие данные находятся в разделе, и при необходимости действовать соответствующим образом. Смотрите также Wikipedia:Раздел_диска#Виды_разделов.\n\n- MBR: параметр интерпретируется как part-type, который может быть primary, extended или logical.\n- GPT: параметр интерпретируется как part-label, который устанавливает PARTLABEL атрибут раздела. Метка раздела должна быть установлена всегда, так как mkpart не разрешает создавать разделы без метки. Примечание: Во многих туториалах в интернете используются команды которые начинаются с mkpart primary даже для GPT. Они не правильные, это установило бы \"primary\" как метку раздела.\n\n- start это начало раздела от начала устройства. Он состоит из числа, за которым следует unit, например 1MiB означает начало с 1 MiB.\n- end конец раздела от начала устройства (not из start значения). Он имеет тот же синтаксис, что и start, например 100% означает конец в конце устройства (использовать все оставшееся пространство).\n\n```\nWarning: The resulting partition is not properly aligned for best performance.\nIgnore/Cancel?\n```\n\nСледующая команда будет использоваться для отметки раздела, содержащего /boot директорию как загрузочную:\n\n```\n(parted) set partition boot on\n```\n\n- partition - номер раздела, который должен быть отмечен (смотрите вывод команды print).\n- esp это назначения для boot на GPT. [1]\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "UEFI/GPT примеры",
      "level": 4,
      "content": "В каждом случае специальный загрузочный EFI system partition (Русский) is required.\n\nПри создании нового системного раздела EFI используйте следующие команды (рекомендуемый размер - не менее 260 MiB):\n\n```\n(parted) mkpart \"EFI system partition\" fat32 1MiB 261MiB\n(parted) set 1 esp on\n```\n\nОставшаяся схема разделов полностью зависит от вас. Для другого раздела, использующего 100% оставшегося пространства\n\n```\n(parted) mkpart \"my partition label\" ext4 261MiB 100%\n```\n\nДля / (20 GiB) и /home (все оставшееся пространство) разделов:\n\n```\n(parted) mkpart \"root partition\" ext4 261MiB 20.5GiB\n(parted) mkpart \"home partition\" ext4 20.5GiB 100%\n```\n\nДля / (20 GiB), swap (4 GiB), и /home (все оставшееся пространство) разделов:\n\n```\n(parted) mkpart \"root partition\" ext4 261MiB 20.5GiB\n(parted) mkpart \"swap partition\" linux-swap 20.5GiB 24.5GiB\n(parted) mkpart \"home partition\" ext4 24.5GiB 100%\n```\n\n"
    },
    {
      "title": "BIOS/MBR примеры",
      "level": 4,
      "content": "Для минимального одного основного раздела, использующего все доступное дисковое пространство, будет использоваться следующая команда:\n\n```\n(parted) mkpart primary ext4 1MiB 100%\n(parted) set 1 boot on\n```\n\nВ следующем случае, 20 GiB / будет создан раздел, за которым последует /home раздел, используя все оставшееся пространство:\n\n```\n(parted) mkpart primary ext4 1MiB 20GiB\n(parted) set 1 boot on\n(parted) mkpart primary ext4 20GiB 100%\n```\n\nВ последнем примере, /boot (100 MiB), / (20 GiB), swap (4 GiB), and /home (все оставшееся пространство) разделы будут созданы:\n\n```\n(parted) mkpart primary ext3 1MiB 100MiB\n(parted) set 1 boot on\n(parted) mkpart primary ext3 100MiB 20GiB\n(parted) mkpart primary linux-swap 20GiB 24GiB\n(parted) mkpart primary ext3 24GiB 100%\n```\n\n"
    },
    {
      "title": "Изменения размера разделов",
      "level": 3,
      "content": "- Вы можете переместить конец раздела только с помощью parted.\n- В parted v4.2 resizepart может потребоваться использование #Интерактивный режим.[2]\n- Эти инструкции применимы к разделам, имеющим ext2, ext3, ext4, или btrfs файловые системы.\n\nЕсли вы увеличиваете раздел, вы должны сначала изменить размер раздела, а затем изменить размер файловой системы на нем, в то время как для сжатия файловая система должна быть изменена перед разделом, чтобы избежать потери данных.\n\n"
    },
    {
      "title": "Увеличение размера разделов",
      "level": 4,
      "content": "Чтобы увеличить размер (в интерактивном режиме parted):\n\n```\n(parted) resizepart number end\n```\n\nГде number - номер раздела, который вы увеличиваете, и end - новый конец раздела (который должен быть больше старого).\n\nЗатем чтобы увеличить (ext2/3/4) файловую систему на разделах:\n\n```\n# resize2fs /dev/sdaX [size]\n```\n\nИли увеличить Btrfs файловую систему:\n\n```\n# btrfs filesystem resize /dev/sdaX [size]\n```\n\nГде sdaX обозначает раздел, который вы увеличиваете, и [size] - новый размер раздела. Примечание; [size] опциональный, по умолчанию: заполнить оставшееся место на разделе.\n\n"
    },
    {
      "title": "Сжатие разделов",
      "level": 4,
      "content": "Чтобы сжать ext2/3/4 файловую систему на разделе:\n\n```\n# resize2fs /dev/sdaX size\n```\n\nЧтобы сжать Btrfs файловую систему:\n\n```\n# btrfs filesystem resize /dev/sdaX size\n```\n\nГде sdaX обозначает раздел, который вы сжимаете, и size - новый размер раздела.\n\nЗатем сожмите раздел (в интерактивном режиме parted):\n\n```\n(parted) resizepart number end\n```\n\nГде number - номер раздела, который вы сжимаете, и end - новый конец раздела (который должен быть меньше старого конца).\n\nКогда закончите, используйте resizepart команду из util-linux сообщающая ядру о новом размере:\n\n```\n# resizepart device number size\n```\n\nГде device - устройство, на котором находиться раздел, number - номер раздела и size - новый размер раздела, в 512-байт секторах.\n\n"
    },
    {
      "title": "Предупреждения",
      "level": 2,
      "content": "Parted will always warn you before doing something that is potentially dangerous, unless the command is one of those that is inherently dangerous (e.g. rm, mklabel and mkpart).\n\n"
    },
    {
      "title": "Выравнивание",
      "level": 3,
      "content": "При создании раздела, parted может предупредить о неправильном выравнивании раздела, но не поможет с правильным выравнивание. Например:\n\n```\n(parted) mkpart primary fat16 0 32M\nWarning: The resulting partition is not properly aligned for best performance.\nIgnore/Cancel?\n```\n\nПредупреждение означает, что начало раздела не выровнено. Введите \"Ignore\" что проигнорировать, вывести таблицу разделов по секторам, чтобы увидеть, где она начинается, и удалить/пересоздать раздел с начала сектора округляя до увеличения степени до 2, пока предупреждение не прекратится. В качестве одного из примеров, на флешке с секторами 512B, Parted найдёт разделы начинающиеся на секторах которые кратны 2048, что соответствует выравниванию в 1 MiB.\n\nЕсли вы хотите parted может попытаться рассчитать для вас правильное выравнивание, укажите начальную позицию как 0% вместо некоторого конкретного значения. Чтобы сделать один большой ext4 раздел, ваша команда должна выглядить так:\n\n```\n(parted) mkpart primary ext4 0% 100%\n```\n\n"
    },
    {
      "title": "Dual boot с Windows XP",
      "level": 3,
      "content": "Если вы имеете Windows XP разделы которые вы хотите переместить с диска на диск, а также ваш загрузочный раздел, вы можете легко сделать это с помощью GParted и оставаться на Windows счастливым, просто удалив следующий ключ реестра ДО перемещения раздела:\n\n```\nHKEY_LOCAL_MACHINE\\SYSTEM\\MountedDevices\n```\n\nСсылка на источник здесь[устаревшая ссылка 2025-01-22 ⓘ].\n\n"
    },
    {
      "title": "Проверка выравнивания",
      "level": 3,
      "content": "На существующем размеченном диске, вы можите использовать parted чтобы проверить выравнивание разделов на диске. Например, проверить выравнивание раздела 1 на /dev/sda:\n\n```\n# parted /dev/sda\n(parted) align-check optimal 1\n1 aligned\n```\n\n"
    },
    {
      "title": "Раздел FAT32 после изменения размера, не распознается в Windows",
      "level": 3,
      "content": "По состоянию на декабрь 2018 г, в parted была ошибка, patched in git 2016-04-15, но всё ещё присутствовала в Arch Linux (и ряду других дистрибутивов) из-за того, что не было официального релиза parted с 2014-07-28.[3] Эта проблема была решена в upstream после выпуска новой разделенной версии в 2019-08-12, и решена в Arch с 3.3-1 выпуска parted в 2019-10-11.[4]\n\nДля старых сборок, однострочный обходной путь был упомянут в отчете об ошибке, но в отчете также указывалось, что он не работал должным образом для всех. [5][6]\n\nСледует отметить, что этот вопрос во многом не коснулся gparted, поскольку проект включил патч в свою сборку от gparted версии 0.26.0-1 (выпущенной в 2016-04-29).[7]\n\n"
    },
    {
      "title": "gparted на Wayland вызывает ошибку \"cannot open display: :0\"",
      "level": 3,
      "content": "Установить xorg-xhost.\n\nДанная проблема возникает потому, что xwayland получает отказ в доступе от gparted запущенном от имени root. разработчики gparted реализовали [8][устаревшая ссылка 2025-01-22 ⓘ] небольшой обходной путь, который временно добавляет root в список пользователей, которым разрешёно подключаться xwayland пока приложение запущено.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- GNU parted - Parted User's Manual\n- How to align partitions for best performance using parted\n- Resize an ext3/ext4 partition\n- Official GParted forums[устаревшая ссылка 2025-01-22 ⓘ]\n\n"
    }
  ]
}