{
  "title": "Pawm (Italiano)",
  "url": "https://wiki.archlinux.org/title/Pawm_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Window manager\n\nPAWM is an X11 stacking window manager. It is a very small, fast, and simple window manager. It is based on Xlib and needs no other external libraries to compile it. It provides an initial windowing environment for minimalist desktops or for single use purposes such as:\n\n- A web browser terminal computer.\n- Testing gui based programs.\n\nPAWM was written by David Gómez and Raúl Núñez de Arenas Coronado. PAWM was written with the objective of creating a tiny window manager that would execute any X application, but still keep it simple and intuitive to use.\n\nPAWM stands for Puto Amo Window Manager.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the pawmAUR package.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Run pawm with xinit.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "By default, PAWM looks blue, plain and kind of dated. By editing the file /etc/pawm.conf you can customize the scheme of your PAWM.\n\nColors are changed through hexadecimal values. Fonts can be changed either through X Logical Font Description or Xft fonts[1].\n\nYou may also adjust the behavior of any modules added.\n\n"
    },
    {
      "title": "Icons",
      "level": 3,
      "content": "PAWM only supports .xpm format. Programs like GIMP can convert images appropriately.\n\n- Window icons (Minimize, Maximize, Close) must be 20x20 pixels.\n- Pashut icons (Shutdown icon on pabar) must be 20x20 pixels.\n- Paicon icons (Launch/Shortcut) may be of any size.\n\nAny icons used in PAWM must be put in /usr/share/pawm/icons/\n\n"
    },
    {
      "title": "Application launcher",
      "level": 3,
      "content": "First, create a directory ~/.pawm . This allows each user to have a unique application set.\n\nThere are 3 ways to launch programs in PAWM.\n\n- Add it to the ~/.xinitrc file.\n- Execute the program from console with the -display parameter.\n- Use the PAWM application launcher\n\nThis article covers the third option.\n\n"
    },
    {
      "title": "Creating new launcher files",
      "level": 4,
      "content": "Create a new file in the directory. For our example we will use the sakura terminal emulator.\n\nThe filename must start with app with up to 20 characters after it (e.g. appSakura).\n\nThe launcher apps have 4 lines that need editing.\n\n1. The name of the image you want to use.\n1. The initial icon screen position. As you move it, PAWM will edit the X Y coordinates accordingly.\n1. Icon text. This is optional.\n1. Application binary. This can be either relative or absolute path.\n\nThe finished file will look like this:\n\n```\nappSakura\n```\n\n```\nsakura.xpm\n40 40\nSakura\nsakura\n```\n\nWhen you next start PAWM your icons will be there. As well, any icon changes including position will be preserved.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "As PAWM is minimalistic, the controls are as well.\n\n- Double clicking a titlebar scrolls the window up or down respectively.\n- There are Minimize, Restore/Maximize, Close buttons.\n- You can drag windows around.\n- You can drag Launcher icons around.\n- Clicking on open applications on the PABar will minimize and restore.\n- Alt+Tab switches between windows.\n- Clicking on a Launcher executes the program.\n- Clicking on the power button brings up a dialog to quit PAWM.\n- Reloading PAWM refreshes any changes made.\n\n"
    }
  ]
}