{
  "title": "PC speaker (Español)",
  "url": "https://wiki.archlinux.org/title/PC_speaker_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2024-02-10** \n\nRelated articles\n\n- Kernel modules\n- Advanced Linux Sound Architecture\n\nDesde el primer IBM PC, la mayoría de los PC llevan incorporado un altavoz de PC (o beeper) que puede producir pitidos. Este altavoz no tiene capacidad de reproducción de alta calidad y sólo sirve como medio sencillo de retroalimentación auditiva en forma de pitidos. Algunos programas, como navegadores web, editores y terminales, pueden emitir pitidos que el usuario puede o no desear. De ahí que este artículo sirva de guía sobre cómo configurar o incluso desactivar esos pitidos.\n\nPara situaciones en las que no se dispone de tarjeta de sonido o altavoces y se desea una simple notificación de audio, vea #Beep.\n\n"
    },
    {
      "title": "Mecanismo",
      "level": 2,
      "content": "El altavoz del PC suele ser una unidad física conectada al bloque de conexiones frontal de la placa base. Algunos fabricantes de placas base no las suministran con altavoz, mientras que otros pueden tenerlo soldado directamente en la placa. Los portátiles no suelen tener altavoz de PC físico, sino que el avisador acústico se envía a los altavoces internos del portátil. En algunos casos, el pitido se escucha en la salida normal (es decir, altavoces, auriculares) de la tarjeta de sonido, que tiende a ser inesperadamente alta.\n\nAl arrancar, la BIOS generará un pitido durante POST. Los modelos de placa base más recientes omiten el pitido POST en favor de arrancar rápidamente el sistema operativo. La BIOS normalmente permite alternar los pitidos POST pero no puede configurar el altavoz del PC para que se apague completamente.\n\nUna vez que el sistema ha arrancado en Linux y el modulo de kernel pcspkr está cargado, el altavoz del PC puede ser utilizado por el entorno, ser invocado manualmente por el usuario, y ser configurado hasta cierto punto. Debido a que el altavoz de PC es controlado directamente por la CPU, junto con el hecho de que están construidos sólo para pitar, los altavoces de PC no pueden ser utilizados para reproducir archivos de audio. Si realmente desea esto, desactivar el modulo de kernel pcspkr e instalar snd-pcsp-dkmsAUR proporcionara una salida de audio rudimentaria.\n\n"
    },
    {
      "title": "Desactivar el altavoz del PC",
      "level": 2,
      "content": "Apagar un caso particular de un sonido, dejando los demás operativos, es posible si y sólo si se puede identificar qué parte del entorno genera el sonido en particular. Esto permite personalizar la selección de sonidos. No dudes en añadir a esta página wiki cualquier configuración que pueda ser útil para otros usuarios.\n\n"
    },
    {
      "title": "Físicamente",
      "level": 3,
      "content": "Al quitar el altavoz del PC el sistema no podrá producir pitidos. Esto puede conseguirse retirando físicamente la unidad de la placa madre (si es posible). Algunos fabricantes pueden proporcionar un \"jumper\" para desconectarlo.\n\n"
    },
    {
      "title": "Globalmente",
      "level": 3,
      "content": "El altavoz del PC se puede desactivar des-cargando los módulos de kernel pcspkr y snd_pcsp:\n\n```\n# rmmod pcspkr\n# rmmod snd_pcsp\n```\n\nPoner los módulos pcspkr y snd_pcsp dentro de la lista negra evitará que udev los cargue al iniciar. Cree el archivo:\n\n```\n/etc/modprobe.d/nobeep.conf\n```\n\n```\nblacklist pcspkr\nblacklist snd_pcsp\n```\n\nLa lista negra en la línea de ordenes del kernel es otra forma. Simplemente añada module_blacklist=pcspkr,snd_pcsp a la línea del kernel de su gestor de arranque.\n\n"
    },
    {
      "title": "Consola",
      "level": 3,
      "content": "Puede añadir este comando en /etc/profile o en un archivo dedicado como /etc/profile.d/disable-beep.sh:\n\n```\nsetterm -blength 0\n```\n\nOtra forma es descomentar o añadir esta línea en /etc/inputrc o ~/.inputrc:\n\n```\nset bell-style none\n```\n\n"
    },
    {
      "title": "Pager less",
      "level": 4,
      "content": "Para desactivar el altavoz del PC en el pager less, puede ejecutarlo con less -q para silenciar el altavoz del PC para eventos de fin de línea o less -Q para silenciarlo por completo. Para páginas man, ejecuta man -P \"less -Q\" o establece las variables de entorno $MANPAGER o $PAGER.\n\nAlternativamente, puede añadir estas líneas a su archivo ~/.bashrc:\n\n```\nalias less='less -Q'\nalias man='man -P \"less -Q\"'\n```\n\n"
    },
    {
      "title": "Xorg",
      "level": 3,
      "content": "```\n$ xset -b\n```\n\nPuede añadir este comando a un archivo de inicio como /etc/xprofile para hacerlo permanente. Consulte xprofile (Español) para obtener más información.\n\n"
    },
    {
      "title": "ALSA",
      "level": 3,
      "content": "En la mayoría de las tarjetas de sonido, el altavoz del PC aparece como un canal ALSA, denominado Altavoz del PC, Bip del PC o Bip. Para silenciar el altavoz, utilice alsamixer o amixer. por ejemplo:\n\n```\n$ amixer set 'PC Speaker' 0% mute\n```\n\nPara des-silenciar el canal, vea ALSA#Unmuting the channels.\n\n"
    },
    {
      "title": "GNOME",
      "level": 3,
      "content": "Usando GSettings:\n\n```\n$ gsettings set org.gnome.desktop.wm.preferences audible-bell false\n```\n\n"
    },
    {
      "title": "KDE Plasma",
      "level": 3,
      "content": "Los ajustes de notificación de timbre pueden modificarse en Preferencias del sistema > Accesibilidad > Timbre.\n\n"
    },
    {
      "title": "Cinnamon",
      "level": 3,
      "content": "Cinnamon parece reproducir un sonido de \"gota de agua\". Para desactivarlo, configúrelo en gsettings(1):\n\n```\n$ gsettings set org.cinnamon.desktop.wm.preferences audible-bell false\n```\n\n"
    },
    {
      "title": "GTK",
      "level": 3,
      "content": "Añada esta línea a ~/.gtkrc-2.0:\n\n```\ngtk-error-bell = 0\n```\n\nAñade la misma línea a la sección [Settings] de $XDG_CONFIG_HOME/gtk-3.0/settings.ini:\n\n```\n[Settings]\ngtk-error-bell = 0\n```\n\nEsto está documentado en el \"Gnome Developer Handbook\".\n\n"
    },
    {
      "title": "PulseAudio",
      "level": 3,
      "content": "Reproducir un sonido en lugar del pitido del altavoz del PC usando PulseAudio.\n\n"
    },
    {
      "title": "Live ISO de Arch Linux",
      "level": 3,
      "content": "Puede parchear la imagen ISO en vivo de Arch Linux (y otras imágenes en vivo que reproducen una sonido al iniciar a través de GRUB) con el siguiente comando.\n\n- Los nombres de los archivos de entrada y salida tienen que ser diferentes o se borrará la imagen.\n- Aunque esto ha sido probado en archlinux-2023.12.01-x86_64.iso y no tiene ningún efecto secundario sobre ella, ejecutar este comando podría corromper su imagen. Sólo ejecútelo si puede permitirse descargar una imagen nueva en ese caso.\n\n```\ncat archlinux.iso | perl -pe 's/^play (([0-9]+ ?)+)/#lay \\1/g' > archlinux-nobeep.iso\n```\n\n"
    },
    {
      "title": "Beep",
      "level": 2,
      "content": "Un usuario puede crear un breve tono audible cuando inicia sesión en una consola virtual. Vea Wikipedia:Bell character#Usage (en Ingles) para más detalles.\n\nBeep es un programa avanzado de pitido de altavoces para PC. Es útil para situaciones en las que no se dispone de tarjeta de sonido y/o altavoces, y se desea una simple notificación de audio.\n\n"
    },
    {
      "title": "Instalación",
      "level": 3,
      "content": "Instale el paquete beep.\n\nPuede que también necesite des-silenciar el altavoz del PC en ALSA (Español).\n\n"
    },
    {
      "title": "Ejecutar como usuario no root",
      "level": 3,
      "content": "beep utiliza /dev/input/by-path/platform-pcspkr-event-spkr para controlar el altavoz del PC. Para acceder a él como usuario no root, hay que establecer los permisos adecuados. Cree /etc/udev/rules.d/70-pcspkr-beep.rules y añada la siguiente regla:\n\n```\nACTION==\"add\", SUBSYSTEM==\"input\", ATTRS{name}==\"PC Speaker\", ENV{DEVNAME}!=\"\", TAG+=\"uaccess\"\n```\n\nEso permitirá a cualquier usuario, que haya iniciado sesión en la consola virtual activa en ese momento, utilizar el altavoz del PC.\n\nComo alternativa, se puede crear un nuevo grupo de usuarios (por ejemplo, beep) con la regla correspondiente para establecer los permisos adecuados en el archivo del dispositivo:\n\n```\nACTION==\"add\", SUBSYSTEM==\"input\", ATTRS{name}==\"PC Speaker\", ENV{DEVNAME}!=\"\", GROUP=\"beep\", MODE=\"0620\"\n```\n\nCon esa solución cualquier usuario del grupo beep podrá controlar el altavoz.\n\nPara forzar la recarga de las reglas y el archivo de dispositivo para aplicar el nuevo permiso de usuario sin reiniciar, ejecute:\n\n```\n# udevadm control --reload && rmmod pcspkr && modprobe pcspkr\n```\n\n"
    },
    {
      "title": "Trucos y consejos",
      "level": 3,
      "content": "Aunque mucha gente está contenta con el sonido de pitido tradicional, a algunos les puede gustar cambiar un poco sus propiedades. El siguiente ejemplo reproduce un sonido ligeramente más agudo y corto y lo repite dos veces.\n\n```\n# beep -f 5000 -l 50 -r 2\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- xset(1), setterm(1), bash(1)\n- https://github.com/NaWer/beep y https://github.com/ShaneMcC/beeps - repositorios que recopilan scripts bash que reproducen música variada usando beep.\n\n"
    }
  ]
}