{
  "title": "PCManFM (Русский)",
  "url": "https://wiki.archlinux.org/title/PCManFM_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- LXDE (Русский)\n- Openbox (Русский)\n- Функциональность файлового менеджера\n- SpaceFM (Русский)\n- Thunar (Русский)\n- GNOME Files\n- Nemo\n\nPCManFM — это свободный файловый менеджер, который используется по умолчанию в LXDE.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет pcmanfm или pcmanfm-gtk3 для GTK3 версии или pcmanfm-gitAUR для разрабатываемой версии.\n\nQt-варианты доступны в пакетах pcmanfm-qt и pcmanfm-qt-gitAUR.\n\nТакже рекомендуется установить gvfs для поддержки корзины, монтирования с помощью udisks и удаленных файловых систем.\n\n"
    },
    {
      "title": "Управление рабочим столом",
      "level": 2,
      "content": "Команда, позволяющая PCManFM устанавливать обои и разрешать использование значков на рабочем столе:\n\n```\n$ pcmanfm --desktop\n```\n\nСобственное меню рабочего стола оконного менеджера будет заменено на меню, которое предоставляет сам PCManFM. Однако его можно легко восстановить из самого меню PCManFM, выбрав Параметры рабочего стола, а затем включив опцию При клике на рабочем столе показывать контекстное меню менеджера рабочего стола на вкладке Дополнительно.\n\n"
    },
    {
      "title": "Настройки рабочего стола",
      "level": 3,
      "content": "При использовании родного меню рабочего стола, предоставляемого оконным менеджером, введите следующую команду, чтобы в любое время установить или изменить настройки рабочего стола:\n\n```\n$ pcmanfm --desktop-pref\n```\n\nСтоит рассмотреть возможность добавления этой команды в привязку клавиш или в собственное меню рабочего стола для удобного доступа.\n\n"
    },
    {
      "title": "Создание новых значков",
      "level": 3,
      "content": "Пользовательский контент, такой как текстовые файлы, документы, изображения и т.д., можно перетаскивать прямо на рабочий стол. Чтобы создать ярлыки для приложений, необходимо будет скопировать их файлы .desktop в сам каталог ~/Рабочий стол. Не перетаскивайте файлы туда, так как они будут перемещены полностью. Синтаксис команды для этого таков:\n\n```\n$ cp /usr/share/applications/имя-приложения.desktop ~/'Рабочий стол'\n```\n\nНапример, если у вас установлен lxterminal, для создания его ярлыка на рабочем столе будет использоваться следующая команда:\n\n```\n$ cp /usr/share/applications/lxterminal.desktop ~/'Рабочий стол'\n```\n\nДля тех, кто использовал программу xdg-user-dir для создания своих каталогов $HOME, дальнейшая настройка не потребуется.\n\n"
    },
    {
      "title": "Режим демона",
      "level": 2,
      "content": "Чтобы запустить PCManFM в фоновом режиме (например, для автоматического подключения съемного носителя), используйте:\n\n```\n$ pcmanfm -d\n```\n\nВ случае сбоя автоматического монтирования смотрите udisks.\n\n"
    },
    {
      "title": "Автозапуск",
      "level": 2,
      "content": "Способ автоматического запуска PCManFM в качестве демона или для управления рабочим столом в качестве оконного менеджера зависит от конкретного оконного менеджера. Например, чтобы включить управление рабочим столом для Openbox, добавьте следующую команду в файл ~/.config/openbox/autostart:\n\n```\npcmanfm --desktop &\n```\n\nПросмотрите соответствующую статью вики и/или официальную домашнюю страницу используемого вами или предполагаемого оконного менеджера. Если оконный менеджер не предоставляет файл автозапуска, PCManFM можно запустить автоматически, отредактировав один или оба из следующих файлов:\n\n- xinitrc: При использовании SLiM или команды startx\n- xprofile: При использовании экранного менеджера, такого как LXDM или LightDM\n\n"
    },
    {
      "title": "Дополнительные возможности и функциональность",
      "level": 2,
      "content": "Менее опытные пользователи должны знать, что один только файловый менеджер, особенно при установке в автономный оконный менеджер, такой как Openbox, не обеспечит всех тех возможностей, к которым привыкли пользователи полнофункциональных сред рабочего стола, таких как Xfce и KDE. Ознакомьтесь со статьей функциональность файлового менеджера для получения дополнительной информации.\n\n"
    },
    {
      "title": "Получение миниатюр для других типов файлов",
      "level": 3,
      "content": "Смотрите Функциональность файлового менеджера#Использование PCManFM для получения превью для других типов файлов.\n\n"
    },
    {
      "title": "Эмулятор терминала по умолчанию",
      "level": 3,
      "content": "Вы можете настроить, какой эмулятор терминала PCManFM должен использоваться по умолчанию при использовании пункта меню Инструменты > Открыть текущую папку в терминале, в разделе Правка > Параметры > Расширенные.\n\n"
    },
    {
      "title": "Интеграция архиватора",
      "level": 3,
      "content": "Можно выбрать встроенный архиватор в разделе Правка > Параметры > Расширенные. PCManFM поддерживает file-roller, xarchiver (или xarchiver-gtk2), engrampa и ark.\n\n"
    },
    {
      "title": "Добавление своих пунктов в контекстное меню",
      "level": 3,
      "content": "PCManFM поддерживает Desktop file specification extension (DES-EMA), позволяющий добавлять произвольные пункты в контекстное меню файлов и каталогов. Чтобы добавить свой пункт, создайте каталог ~/.local/share/file-manager/actions/ (если его ещё нет) и в нём файл с расширением .desktop:\n\n```\n~/.local/share/file-manager/actions/действие.desktop\n```\n\n```\n[Desktop Entry]\nType=Action\nProfiles=id_профиля\nName=Название действия на английском\nName[ru]=Название действия на русском\nIcon=название значка\n# Пример: Icon=text-editor\n \n[X-Action-Profile id_профиля]\nMimeTypes=MIME-типы (через точку с запятой)\nExec=команда и аргументы\n# Пример: Exec=gedit %f\n```\n\nК одному действию можно привязать один или несколько профилей, перечислив их id через точку с запятой. Профили позволяют указать, какие команды для каких типов файлов выполнять — таким образом одно и то же действие может запускать разные команды в зависимости от типа выбранного файла. Помимо конкретных MIME-типов (например, text/plain для текстовых файлов), можно использовать следующие общие типы:\n\n- all/allfiles — любые файлы;\n- inode/directory — любые каталоги;\n- all/all — любые файлы и каталоги.\n\n"
    },
    {
      "title": "Шаблоны",
      "level": 3,
      "content": "PCManFM добавляет файлы из каталога ~/Шаблоны в качестве пунктов контекстного меню Создать новый... при запуске.\n\n"
    },
    {
      "title": "Миниатюры",
      "level": 3,
      "content": "Как и некоторые другие файловые менеджеры (например, Nautilus) PCManFM будет загружать миниатюры всех файлов в папке. Чтобы не нагружать жесткий диск, ограничьте количество изображений в папке до 100.\n\n"
    },
    {
      "title": "При выборе \"Открыть с помощью\" открывается пустое окно",
      "level": 3,
      "content": "Если вы не видите никаких приложений для выбора в диалоговом окне открытия с помощью, вы можете попробовать удалить gnome-menus и вместо этого установить lxmenu-data. Кроме того, экспортируйте следующие переменные окружения:\n\n```\nexport XDG_MENU_PREFIX=lxde-\nexport XDG_CURRENT_DESKTOP=LXDE\n```\n\n"
    },
    {
      "title": "Нет \"Приложений\"",
      "level": 3,
      "content": "Вы можете попробовать этот метод: Удалите все файлы в папке $HOME/.cache/menus и снова запустите PCManFM.\n\nPCManFM требует, чтобы была установлена переменная окружения XDG_MENU_PREFIX. Значение переменной должно совпадать с началом файла, находящегося в каталоге /etc/xdg/menus/. Например, вы можете задать значение в вашем файле .xinitrc с помощью строки:\n\n```\nexport XDG_MENU_PREFIX=\"lxde-\"\n```\n\nДополнительную информацию смотрите в этих темах: [1], и особенно в этом сообщении на форумах Linux Mint: [2]\n\n"
    },
    {
      "title": "Нет значков",
      "level": 3,
      "content": "Если вы используете оконный менеджер вместо среды рабочего стола и у вас нет значков для папок и файлов, укажите тему значков GTK.\n\nЕсли у вас установлен, например, oxygen-icons отредактируйте ~/.gtkrc-2.0 или /etc/gtk-2.0/gtkrc и добавьте следующую строку:\n\n```\ngtk-icon-theme-name = \"oxygen\"\n```\n\nВ противном случае используйте другой (gnome, hicolor, и locolor не работают). Чтобы посмотреть список установленных тем значков:\n\n```\n$ ls ~/.icons/ /usr/share/icons/\n```\n\nЕсли ни одна из уже установленных тем не подходит, установите подходящую. Список пакетов значков, доступных в репозиториях, можно получить с помощью команды:\n\n```\n$ pacman -Ss icon-theme\n```\n\n"
    },
    {
      "title": "Не работает переход к предыдущей/следующей папке с помощью кнопок мыши",
      "level": 3,
      "content": "Для решения проблемы можно использовать Xbindkeys.\n\nУстановите xbindkeys, xvkbdAUR и отредактируйте файл ~/.xbindkeysrc следующим образом:\n\n```\n# Пример .xbindkeysrc для мыши G9x.\n\"/usr/bin/xvkbd -text '\\[Alt_L]\\[Left]'\"\n b:8\n\"/usr/bin/xvkbd -text '\\[Alt_L]\\[Right]'\"\n b:9\n```\n\nУзнать правильные коды кнопок для вашей мыши можно с помощью xorg-xev.\n\nДобавьте:\n\n```\nxbindkeys &\n```\n\nв ваш ~/.xinitrc для запуска xbindkeys при входе.\n\n"
    },
    {
      "title": "Параметр --desktop не работает или вызывает сбой X-сервера",
      "level": 3,
      "content": "Убедитесь, что вы являетесь владельцем и имеете права на запись в ~/.config/pcmanfm.\n\nУстановка обоев с помощью параметра --desktop-pref или редактирование ~/.config/pcmanfm/default/pcmanfm.config решает проблему.\n\n"
    },
    {
      "title": "Настройки терминала не сохраняются",
      "level": 3,
      "content": "Убедитесь, что у вас есть права доступа к файлу конфигурации libfm:\n\n```\nchmod -R 750 ~/.config/libfm\nchmod 640 ~/.config/libfm/libfm.conf\n```\n\n"
    },
    {
      "title": "PCManFM не запоминает настройки сортировки файлов",
      "level": 3,
      "content": "Вы можете использовать Вид > Сортировать файлы, чтобы изменить порядок, в котором PCManFM отображает файлы, но PCManFM не запомнит это при следующем запуске. Для сохранения изменений откройте Правка > Параметры и затем просто закройте. Это действие запишет текущие значения sort_type и sort_by в файл ~/.config/pcmanfm/LXDE/pcmanfm.conf.\n\n"
    },
    {
      "title": "Ошибка \"Не авторизован\" при попытке смонтировать диск",
      "level": 3,
      "content": "Добавьте правило polkit в /etc/polkit-1/rules.d/00-mount-internal.rules:\n\n```\npolkit.addRule(function(action, subject) {\n   if ((action.id == \"org.freedesktop.udisks2.filesystem-mount-system\" &&\n      subject.local && subject.active && subject.isInGroup(\"storage\")))\n      {\n         return polkit.Result.YES;\n      }\n});\n```\n\nИ добавьте своего пользователя в группу storage:\n\n```\n# usermod -aG storage пользователь\n```\n\n"
    },
    {
      "title": "Операция не поддерживается",
      "level": 3,
      "content": "Смотрите раздел Устранение часто встречающихся неполадок#Разрешения сессии.\n\n"
    },
    {
      "title": "Теряются пароли при перезагрузке системы",
      "level": 3,
      "content": "Установите приложение для управления ключами, например gnome-keyring, kde-wallet или lxqt_walletAUR для общих сетевых ресурсов или агент SSH, если это необходимо.\n\n"
    }
  ]
}