{
  "title": "PCManFM (Italiano)",
  "url": "https://wiki.archlinux.org/title/PCManFM_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nArticoli correlati\n\n- LXDE (Italiano)\n- Openbox (Italiano)\n- File manager functionality\n- Thunar (Italiano)\n- GNOME Files\n- Nemo\n\nDal sito[link interrotto 2022-09-22] del progetto:\n\n"
    },
    {
      "title": "Installazione",
      "level": 2,
      "content": "pcmanfm è disponibile negli official repositories.\n\nSi consiglia di installare gvfs per il supporto del Cestino, del montaggio con Udisk e dei filesystem remoti.\n\nVarianti di PCManFM degne di nota sono:\n\n- pcmanfm-gitAUR - Development version.\n- pcmanfm-qt - New Qt implementation.\n- pcmanfm-qt-gitAUR - New Qt implementation, development version.\n\n"
    },
    {
      "title": "Gestione Desktop",
      "level": 2,
      "content": "Il comando per consentire a PCManFM di impostare sfondi e usare icone sul desktop è:\n\n```\npcmanfm --desktop\n```\n\nIl menu del desktop nativo del window manager verrà sostituito con quello fornito da PCManFM. Tuttavia, può essere facilmente ripristinato dal menu di PCManFM selezionando Preferenze della Scrivania e abilitando Mostra i menù forniti dai Windows Manager nella scheda Avanzate.\n\n"
    },
    {
      "title": "Preferenze del desktop",
      "level": 3,
      "content": "Se si utilizza il menu del desktop nativo offerto da un gestore di finestre, immettere il seguente comando per impostare o modificare le preferenze del desktop in qualsiasi momento:\n\n```\n$ pcmanfm --desktop-pref\n```\n\nVale la pena di considerare l'aggiunta di questo comando per effettuare un keybind del menu del desktop nativo per un facile accesso.\n\n"
    },
    {
      "title": "Creare nuove icone",
      "level": 3,
      "content": "I Contenuti dell'utente come files di testo, documenti, immagini e così via possono essere trascinati direttamente sul desktop. Non è ivece possibile trascinare applicazioni sul Desktop, se si vuole creare un collegamento ad un applicazione sul Desktop sarà necessario copiare il suo file .desktop nella cartella ~/Desktop.:\n\n```\ncp /usr/share/applications/<nome applicazione>.desktop ~/Desktop\n```\n\nPer esempio per creare un collegamento sul desktop per lxterminal- se installato - sarebbe stato utilizzato il seguente comando:\n\n```\ncp /usr/share/applications/lxterminal.desktop ~/Desktop\n```\n\nPer coloro che hanno utilizzato il programma XDG user directories per creare la loro $HOME, non sarà richiesta alcuna ulteriore configurazione.\n\n"
    },
    {
      "title": "Modalità Daemon",
      "level": 2,
      "content": "La sessione o comando di avvio automatico per eseguire PCManFM come demone/ processo in background (cioè per l'automount di supporti rimovibili come CD/DVD e flash-drive USB) è :\n\n```\npcmanfm -d\n```\n\n"
    },
    {
      "title": "Avvio automatico",
      "level": 2,
      "content": "La maniera in cui PCManFM può essere avviato come daemon o come gestore del desktop in combinazione con un window manager indipendente, varia in base al window manager stesso. Per esempio, per abilitare la gestione del desktop da parte di PCManFM utilizzando Openbox, sarà necessario aggiungere questa riga al file ~/.config/openbox/autostart\n\n```\npcmanfm --desktop &\n```\n\nRivedere l'articolo wiki pertinente e/o l'home page ufficiale per uno specifico window manager. Se un window manager non fornisce un file autostart, PCManFM può essere alternativamente autoavviato modificando uno o entrambi dei seguenti file :\n\n- xinitrc: Quando si usa SLiM come display manager o il comando Startx\n- xprofile: Quando si usa un display manager come LXDM or LightDM\n\n"
    },
    {
      "title": "Ulteriori caratteristiche e funzionalità",
      "level": 2,
      "content": "Gli utenti meno esperti dovrebbero essere consapevoli che un file manager da solo - soprattutto quando installato in un autonomo Window manager come Openbox - non fornirà le caratteristiche e le funzionalità di ambienti desktop completi come Xfce e KDE. Rivedere l'articolo File manager functionality per ulteriori informazioni.\n\n"
    },
    {
      "title": "Un clic per aprire cartelle e files",
      "level": 3,
      "content": "Aprire PCManFM in modalità File Explorer, andare in Modifica> Preferenze>Generali>Comportamento, e selezionare Apri i file con un solo click. Questa opzione funziona anche con le icone del desktop.\n\n"
    },
    {
      "title": "Aprire ed estrarre archivi con PCManFM",
      "level": 3,
      "content": "Installare file-roller o xarchiver dagli official repositories.\n\nAprire PCManFM in modalità File Explorer, andare in Modifica> Preferenze>Avanzate, selezionare Integrazione Archivi e selezionare l'archiviatore installato.\n\n"
    },
    {
      "title": "Apertura finestra di dialogo vuota",
      "level": 3,
      "content": "Se nella finestra di dialogo non sono presenti tutte le applicazioni installate, allora si può provare a rimuovere gnome-menus e installare al suo posto lxmenu-data. Inoltre, è necessario esportare le seguenti variabili :\n\n```\nexport XDG_MENU_PREFIX=lxde-\nexport XDG_CURRENT_DESKTOP=LXDE\n```\n\n"
    },
    {
      "title": "Nessuna \"Applicazione\"",
      "level": 3,
      "content": "Si può provare questo metodo: Eliminare tutti i file presenti nella cartella $HOME/.cache/menu ed eseguire nuovamente PCManFM.\n\nPCManFM richiede la variabile di ambiente XDG_MENU_PREFIX da impostare. Il valore della variabile deve essere contenuta all'inizio di un file presente nella cartella /etc/xdg/menus/. Ad esempio è possibile impostare il valore nel file xinitrc con la riga:\n\n```\nexport XDG_MENU_PREFIX=\"lxde-\"\n```\n\nVedere questi thread per maggiori informazioni: [1], e in particolare questo post dal forum Linux Mint: [2]\n\n"
    },
    {
      "title": "Nessuna icona",
      "level": 3,
      "content": "Se si utilizza un WM invece di un DE e non avete le icone per le cartelle e i files, è necessario specificare il tema di icone GTK+ usato.\n\nSe si dispone ad esempio di oxygen-icons installato, modificare ~/.gtkrc-2.0 o /etc/gtk-2.0/gtkrc e aggiungere la seguente riga:\n\n```\ngtk-icon-theme-name = \"oxygen\"\n```\n\nAltrimenti, utilizzare un diverso tema (gnome, hicolor, e locolor non funzionano). Per elencare tutti i temi di icone installati, digitare il seguente comando:\n\n```\n$ ls ~/.icons/ /usr/share/icons/\n```\n\nSe nessuno di essi è adatto, installarne un altro. Per elencare tutti i pacchetti di icone installabili:\n\n```\n$ pacman -Ss icon-theme\n```\n\n"
    },
    {
      "title": "Nessuna funzionalità \"Cartella precedente/successiva\" con i pulsanti del mouse",
      "level": 3,
      "content": "Un metodo per risolvere questo problema è usare Xbindkeys.\n\nInstallare xbindkeys e modificare ~/.xbindkeysrc aggiungendo le seguenti righe:\n\n```\n# Sample .xbindkeysrc for a G9x mouse.\n\"/usr/bin/xvkbd -text '\\[Alt_L]\\[Left]'\"\n b:8\n\"/usr/bin/xvkbd -text '\\[Alt_L]\\[Right]'\"\n b:9\n```\n\nAltri Codici pulsante possono essere ottenuti con il pacchetto xorg-xev.\n\nAggiungere:\n\n```\nxbindkeys &\n```\n\nal proprio ~/.xinitrc per eseguire xbindkeys al log-in.\n\n"
    },
    {
      "title": "Paramentri --desktop non funzionano o crash del X-server",
      "level": 3,
      "content": "Assicurarsi di avere i permessi di proprietà e di scrittura su ~/.config/pcmanfm.\n\nImpostare lo sfondo utilizzando il parametro --desktop-pref o modificando ~/.config/pcmanfm/default/pcmanfm.config per risolvere il problema.\n\n"
    },
    {
      "title": "Mancato salvataggio delle configurazioni avanzati dell'Emulatore di terminale",
      "level": 3,
      "content": "Assicurarsi di avere i permessi sul file di configurazione libfm :\n\n```\n$ chmod -R 750 ~/.config/libfm\n$ chmod 640 ~/.config/libfm/libfm.conf\n```\n\n"
    },
    {
      "title": "Memorizzare impostazioni Ordine files preferite",
      "level": 3,
      "content": "È possibile utilizzare Visualizza>Ordina file per cambiare l' ordine in cui PCManFM elenca i file, ma le impostazioni saranno cancellate al successivo avvio di PCManFM. Per memorizzarle, andare su Modifica> Preferenze e Chiudi. Questo scriverà i valori sort_type e sort_by correnti in ~/.config/pcmanfm/LXDE/pcmanfm.conf.\n\n"
    },
    {
      "title": "Errore \"Non autorizzato\" all'accesso/montaggio di unità USB",
      "level": 3,
      "content": "Creare questa regola polkit in /etc/polkit-1/rules.d/00-mount-internal.rules\n\n```\npolkit.addRule(function(action, subject) {\n     if ((action.id == \"org.freedesktop.udisks2.filesystem-mount-system\" &&\n        subject.local && subject.active && subject.isInGroup(\"storage\")))\n        {\n           return polkit.Result.YES;\n        }\n  });\n```\n\nE aggiungere il proprio utente al gruppo storage:\n\n```\n# usermod -aG storage username\n```\n\n"
    }
  ]
}