{
  "title": "Permitir a los Usuarios Apagar el equipo",
  "url": "https://wiki.archlinux.org/title/Permitir_a_los_Usuarios_Apagar_el_equipo",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-11-08** \n\n"
    },
    {
      "title": "Eventos de botones y de tapa",
      "level": 2,
      "content": "El presionado de los botones de suspensión, apagado e hibernación y los eventos de cierre de la tapa se controlan mediante logind como se describe en la página Gestión de energía#Eventos de ACPI.\n\n"
    },
    {
      "title": "Utilizar systemd-logind",
      "level": 2,
      "content": "Si está utilizando systemd (el cual está implementado de manera predeterminada en Arch Linux) e instala polkit, los usuarios con sesión no remota pueden emitir comandos relacionados con la alimentación eléctrica siempre que la sesión no esté rota.\n\nPara comprobar si su sesión está activa\n\n```\n$ loginctl show-session $XDG_SESSION_ID --property=Active\n```\n\nEl usuario puede usar entonces los comandos systemctl en la línea de comandos, o añadirlos a los menús:\n\n```\n$ systemctl poweroff\n$ systemctl reboot\n```\n\nTambién se pueden usar otros comandos, incluyendo systemctl suspend y systemctl hibernate. Veáse la sección System Commands en systemctl(1).\n\n"
    },
    {
      "title": "Utilizar sudo",
      "level": 2,
      "content": "Instale sudo, y otorgue al usuario privilegios sudo. El usuario podrá usar entonces los comandos sudo systemctl (por ejemplo, sudo systemctl poweroff, sudo systemctl reboot, sudo systemctl suspend y sudo systemctl hibernate). Véase la sección System Commands en systemctl(1)\n\n"
    },
    {
      "title": "Usuarios sin privilegios sudo",
      "level": 3,
      "content": "Si a los usuarios solo se les permite usar comandos de apagado, pero no tienen otros privilegios sudo, entonces, como root, agregue lo siguiente al final de /etc/sudoers usando el comando visudo . Sustituya usuario por su nombre de usuario y nombre_del_host por el nombre de host de la máquina.\n\n```\nusuario nombre_del_host =NOPASSWD: /usr/bin/systemctl poweroff,/usr/bin/systemctl halt,/usr/bin/systemctl reboot\n```\n\nAhora su usuario puede apagar con sudo systemctl poweroff, y reiniciar con sudo systemctl reboot. Los usuarios que deseen apagar un sistema también pueden usar sudo systemctl halt. Use la etiqueta NOPASSWD: solo si no desea que se le solicite su contraseña.\n\n"
    },
    {
      "title": "Crear alias",
      "level": 2,
      "content": "Para su comodidad, puede agregar estos alias a su ~/.bashrc de su usuario si lo tiene habilitado (o a /etc/bash.bashrc para una configuración global de todo el sistema):\n\n```\nalias reboot=\"sudo systemctl reboot\"\nalias poweroff=\"sudo systemctl poweroff\"\nalias halt=\"sudo systemctl halt\"\n```\n\nEsto también se puede hacer instalando systemd-sysvcompat. Este paquete crea enlaces simbólicos del respectivo nombre a systemctl.\n\n"
    }
  ]
}