{
  "title": "PHP (Español)",
  "url": "https://wiki.archlinux.org/title/PHP_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-14** \n\nPHP es un lenguaje de secuencias de órdenes de uso general muy utilizado que es especialmente adecuado para el desarrollo web y puede integrarse en HTML.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete php del repositorio oficial.\n\n"
    },
    {
      "title": "Ejecución",
      "level": 2,
      "content": "Si bien PHP se puede ejecutar de forma independiente, generalmente se utiliza con servidores web. Eso requiere instalar paquetes adicionales y editar archivos de configuración. Para configuraciones comunes, véase Apache HTTP Server, nginx, lighttpd y Hiawatha. Para ejecutar scripts PHP como CGI simple, necesita el paquete php-cgi.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "El archivo principal de configuración de PHP está bien documentado y ubicado en /etc/php/php.ini.\n\n- Se recomienda configurar su zona horaria (lista de zonas horarias) en /etc/php/php.ini así:\n\n```\ndate.timezone = Europe/Madrid\n```\n\n- Si quiere mostrar los errores para depurar su código PHP, cambie display_errors a On en /etc/php/php.ini:\n\n```\ndisplay_errors = On\n```\n\n- La directiva open_basedir limita las rutas a las que puede acceder PHP, aumentando así la seguridad a costa de interferir potencialmente con la ejecución normal del programa. A partir de PHP 7.0, ya no está configurado de forma predeterminada para que coincida más estrechamente con el flujo ascendente, por lo que los usuarios que deseen usarlo deben configurarlo manualmente. Todos los enlaces simbólicos están resueltos, por lo que no es posible evitar esta restricción con un enlace simbólico. Los paquetes Arch predeterminados para ciertas aplicaciones web como nextcloud y phpmyadmin instalan las aplicaciones web en /usr/share/webapps y crean un enlace simbólico que apunta a los archivos de configuración reales para dichas aplicaciones web en /etc/webapps. Por lo tanto, si está configurando open_basedir, asegúrese de que ambas carpetas estén en open_basedir. Obviamente, esto será diferente para las aplicaciones web instaladas en otras ubicaciones. Por ejemplo:\n\n```\nopen_basedir = /srv/http/:/var/www/:/home/:/tmp/:/var/tmp/:/var/cache/:/usr/share/pear/:/usr/share/webapps/:/etc/webapps/\n```\n\n"
    },
    {
      "title": "Extensiones",
      "level": 2,
      "content": "También se pueden encontrar varias extensiones PHP de uso común en los repositorios oficiales:\n\n```\n$ pacman -Ss php-\n```\n\nLas extensiones para versiones actuales y anteriores de PHP también están disponibles en AUR con el prefijo php-* y php56-*, por ejemplo php-imagick, php-redis y php56-mcryptAUR.\n\n"
    },
    {
      "title": "gd",
      "level": 3,
      "content": "Para php-gd descomente en /etc/php/php.ini la línea:\n\n```\nextension=gd\n```\n\n"
    },
    {
      "title": "Imagemagick",
      "level": 3,
      "content": "Instale) el paquete imagemagick y una de las bibliotecas de extensión PHP enumeradas.\n\nInstale php-imagick, creará el archivo /etc/php/conf.d/imagick.ini para configurar la extensión.\n\n"
    },
    {
      "title": "PECL",
      "level": 4,
      "content": "Asegúrese de que se haya instalado el paquete php-pearAUR:\n\n```\n# pecl install imagick\n```\n\nCree /etc/php/conf.d/imagick.ini y active la extensión:\n\n```\n/etc/php/conf.d/imagick.ini\n```\n\n```\nextension=imagick\n```\n\n"
    },
    {
      "title": "Multihilo",
      "level": 3,
      "content": "Si desea tener POSIX multihilo, necesitará la extensión paralelo. Para instalar la extensión usando pecl, se requiere que use una versión compilada de PHP con la opción de soporte de seguridad de subprocesos --enable-maintenance-zts. Actualmente, la forma más limpia de hacer esto sería reconstruir el paquete original con la opción. Las instrucciones se pueden encontrar en la página PHP pthreads extension.\n\n"
    },
    {
      "title": "PCNTL",
      "level": 3,
      "content": "PCNTL le permite crear procesos directamente en la máquina del lado del servidor. Si bien esto puede verse como algo que desearía, también le da a PHP el poder de estropear las cosas realmente. Por lo tanto, es una extensión de PHP que no se puede cargar como otra extensión más conveniente. Esto se debe al gran poder que le da a PHP. Para activarlo, PCNTL debe estar compilado en PHP.\n\nEl paquete php en Arch Linux está actualmente construido con \"--enable-pcntl\", por lo que debería estar disponible por defecto.\n\n"
    },
    {
      "title": "MySQL/MariaDB",
      "level": 3,
      "content": "Instale y configure MySQL/MariaDB como se describe en MariaDB.\n\nDescomente las líneas siguientes en /etc/php/php.ini:\n\n```\nextension=pdo_mysql\nextension=mysqli\n```\n\nPuede añadir usuarios menores de MySQL con privilegios para sus scripts web. Es posible que también quiera editar /etc/my.cnf.d/server.cnf y añadir la línea de la sección mysqld skip-networking para que solo se pueda acceder al servidor MySQL por localhost, según MariaDB#Enable access locally only via Unix sockets. Debe reiniciar MySQL para que los cambios surtan efecto.\n\n"
    },
    {
      "title": "Redis",
      "level": 3,
      "content": "Instale y configure Redis, luego instale php-redis.\n\nDescomente la línea del paquete, por ejemplo /etc/php/conf.d/redis.ini. También asegúrese de que la extensión igbinary esté activada (también descomentada) en /etc/php/conf.d/igbinary.ini\n\n"
    },
    {
      "title": "PostgreSQL",
      "level": 3,
      "content": "Instale y configure PostgreSQL, luego instale el paquete php-pgsql y descomente las siguientes líneas en /etc/php/php.ini:\n\n```\nextension=pdo_pgsql\nextension=pgsql\n```\n\n"
    },
    {
      "title": "Sqlite",
      "level": 3,
      "content": "Instale y configure SQLite, luego instale el paquete php-sqlite y descomente las siguientes líneas en /etc/php/php.ini:\n\n```\nextension=pdo_sqlite\nextension=sqlite3\n```\n\n"
    },
    {
      "title": "XDebug",
      "level": 3,
      "content": "XDebug le permite depurar fácilmente el código php usando la función var_dump() modificada. Instale xdebug y descomente las líneas en /etc/php/conf.d/xdebug.ini.\n\n```\nzend_extension=xdebug\nxdebug.mode=debug\n```\n\n"
    },
    {
      "title": "IMAP",
      "level": 3,
      "content": "Instale php-imapAUR y descomente en /etc/php/php.ini la línea:\n\n```\nextension=imap\n```\n\n"
    },
    {
      "title": "Caching",
      "level": 2,
      "content": "Hay dos tipos de almacenamiento en caché en PHP: caché de código de operación/código de bytes (opcode) y caché de área de usuario/datos de usuario (userland). Ambos permiten ganancias sustanciales en la velocidad de las aplicaciones y, por lo tanto, deben activarse siempre que sea posible.\n\n- Zend OPCache proporciona solo caché de código de operación.\n- APCu proporciona solo caché de área de usuario.\n\n"
    },
    {
      "title": "OPCache",
      "level": 3,
      "content": "OPCache viene incluido con la distribución PHP estándar, por lo tanto, para activarlo simplemente tiene que añadir o descomentar la siguiente línea en su archivo de configuración PHP:\n\n```\n/etc/php/php.ini\n```\n\n```\nzend_extension=opcache\n```\n\nPuede encontrar una lista de sus opciones y configuraciones sugeridas en el sitio web de PHP.\n\n"
    },
    {
      "title": "APCu",
      "level": 3,
      "content": "APCu se puede instalar con el paquete php-apcu. Luego puede activarlo descomentando la siguiente línea en /etc/php/conf.d/apcu.ini, o añadiéndola a su archivo de configuración PHP:\n\n```\nextension=apcu\n```\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nSu autor recomienda algunas configuraciones sugeridas, entre las cuales:\n\n- apc.enabled=1 y apc.shm_size=32M no son realmente necesarios ya que representan los valores por defecto;\n- apc.ttl=7200 por otro lado parece bastante beneficiosa;\n- finalmente, apc.enable_cli=1, que aunque no es recomendada por el manual puede ser requerido por algún software como ownCloud.\n\nNote: **o** \n\n"
    },
    {
      "title": "Herramientas de desarrollo",
      "level": 2,
      "content": "- Visual Studio Code — Editor de código para programar PHP y otros lenguajes.\n\n- Aptana Studio — IDE para programación en PHP y desarrollo web. No tiene depurador de PHP.\n\n- Eclipse PDT — La variante PHP de Eclipse.\n\n- Komodo — IDE con buena integración para PHP+HTML+JavaScript.\n\n- Netbeans — IDE para muchos lenguajes, incluido PHP. Incluye funciones como depuración, refactorización, creación de plantillas de código, autocompletar, funciones XML y funciones de desarrollo y diseño web.\n\n- JetBrains PhpStorm — IDE comercial multiplataforma para PHP construido sobre la plataforma IntelliJ IDEA de JetBrains. Puede obtener una licencia gratuita de Jetbrains para estudiantes.[1].\n\n- Zend Studio — IDE PHP oficial, basado en eclipse. El IDE tiene autocompletado, formato de código avanzado, editor de html WYSIWYG, refactorización y todas las funciones de eclipse, como el acceso a la base de datos y la integración de control de versiones y todo lo que pueda obtener de otros complementos de eclipse.\n\n"
    },
    {
      "title": "Compositor",
      "level": 3,
      "content": "Composer es un administrador de dependencias para PHP. Se puede instalar con el paquete composer.\n\n"
    },
    {
      "title": "Permitir instalaciones a nivel de usuario",
      "level": 4,
      "content": "Para permitir instalaciones de paquetes globales para el usuario actual (por ejemplo $ composer global require \"package/name\"), es posible que quiera especificar una ubicación predeterminada mediante una variable de entorno:\n\n```\nPATH=\"$HOME/.config/composer/vendor/bin:$PATH\"\n```\n\n"
    },
    {
      "title": "Box",
      "level": 3,
      "content": "Box es una aplicación para construir y administrar Phars. Se puede instalar con el paquete php-boxAUR.\n\n"
    },
    {
      "title": "PDepend",
      "level": 3,
      "content": "PHP Depend (pdepend) es una herramienta de métricas software para php. Se puede instalar con el paquete pdependAUR.\n\n"
    },
    {
      "title": "PHP Coding Standards Fixer",
      "level": 3,
      "content": "PHP Coding Standards Fixer es un corrector de código del estándar de codificación PSR-1 y PSR-2. Se puede instalar con el paquete php-cs-fixerAUR.\n\n"
    },
    {
      "title": "PHP-CodeSniffer",
      "level": 3,
      "content": "PHP CodeSniffer \"tokeniza\" archivos PHP, JavaScript y CSS y detecta violaciones de un conjunto definido de estándares de codificación. Se puede instalar con el paquete php-codesnifferAUR.\n\n"
    },
    {
      "title": "phpcov",
      "level": 3,
      "content": "phpcov es una interfaz de línea de órdenes para la biblioteca PHP_CodeCoverage. Se puede instalar con el paquete phpcovAUR.\n\n"
    },
    {
      "title": "phpDox",
      "level": 3,
      "content": "phpDox es el generador de documentación para proyectos PHP. Esto incluye, pero no se limita a, la documentación de la API. Se puede instalar con el paquete phpdoxAUR.\n\n"
    },
    {
      "title": "PHPLoc",
      "level": 3,
      "content": "PHPLoc es una herramienta para medir rápidamente el tamaño de un proyecto PHP. Se puede instalar con el paquete phplocAUR.\n\n"
    },
    {
      "title": "PhpMetrics",
      "level": 3,
      "content": "PhpMetrics proporciona varias métricas sobre proyectos PHP. Se puede instalar con el paquete phpmetricsAUR.\n\n"
    },
    {
      "title": "phptok",
      "level": 3,
      "content": "phptok es una herramienta para descargar rápidamente los \"tokens\" de un archivo de código fuente PHP. Se puede instalar con el paquete phptokAUR[enlace roto: package not found].\n\n"
    },
    {
      "title": "PHPUnit",
      "level": 3,
      "content": "PHPUnit es un marco de pruebas para PHP orientado a programadores. Se puede instalar con el paquete phpunitAUR.\n\n"
    },
    {
      "title": "PHPUnit Skeleton Generator",
      "level": 3,
      "content": "PHPUnit Skeleton Generator es una herramienta que puede generar estructuras de clases de prueba a partir de clases de código de producción y viceversa. Se puede instalar con el paquete phpunit-skeleton-generatorAUR[enlace roto: package not found].\n\n"
    },
    {
      "title": "Producer",
      "level": 3,
      "content": "Producer es una herramienta de control de calidad de línea de órdenes para validar y luego publicar su paquete de biblioteca PHP. Se puede instalar con el paquete producerAUR.\n\n"
    },
    {
      "title": "PHP Fatal error: Class 'ZipArchive' not found",
      "level": 3,
      "content": "Asegúrese de que la extensión zip esté activada.\n\n```\n/etc/php/php.ini\n```\n\n```\nextension=zip\n```\n\n"
    },
    {
      "title": "/etc/php/php.ini not parsed",
      "level": 3,
      "content": "Si su php.ini no se analiza, el archivo ini recibe el nombre del sapi que está utilizando. Por ejemplo, si está utilizando uwsgi, el archivo se llamaría /etc/php/php-uwsgi.ini. Si está usando cli, es /etc/php/php-cli.ini.\n\n"
    },
    {
      "title": "PHP Warning: PHP Startup: <module>: Unable to initialize module",
      "level": 3,
      "content": "Cuando se ejecuta php, este error indica que el módulo mencionado anteriormente está desactualizado. Esto rara vez sucederá en Arch Linux, ya que los encargados del mantenimiento se aseguran de que el núcleo PHP y todos los módulos solo estén disponibles en versiones compatibles.\n\nEsto puede suceder junto con un módulo compilado de AUR. Por lo general, puede confirmar esto mirando las fechas de los archivos /usr/lib/php/modules/.\n\nPara solucionarlo, busque una actualización compatible para su módulo, probablemente buscando en AUR usando su nombre común.\n\nSi corresponde, marque el paquete AUR desactualizado como outdated (desactualizado).\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Sitio web oficial de PHP\n\n"
    }
  ]
}