{
  "title": "Pidgin (简体中文)",
  "url": "https://wiki.archlinux.org/title/Pidgin_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Pidgin is a chat program which lets you log into accounts on multiple chat networks simultaneously. It is compatible with Jabber/XMPP, Bonjour, Gadu-Gadu, IRC, Novell GroupWise Messenger, Lotus Sametime, SILC, SIMPLE, and Zephyr, and many more chat networks with plugins.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the pidgin package. A notable variant is pidgin-miniAUR.\n\nYou may also want to install additional plugins from the purple-plugin-pack.\n\n"
    },
    {
      "title": "Spellcheck",
      "level": 2,
      "content": "The aspell package will be installed as a dependency, but to prevent all of your text from showing up as incorrect you will need to install an aspell dictionary. See the aspell article.\n\nNote: **switch spell** \n\n"
    },
    {
      "title": "AIM",
      "level": 3,
      "content": "Pidgin has out-of-the-box support for AOL Instant Messenger (AIM). Although AIM has officially ceased, unofficial AIM-based servers like AIM Phoenix operate and can be used on Pidgin by changing the server address in the AIM protocol account settings.\n\n"
    },
    {
      "title": "Discord plugin",
      "level": 3,
      "content": "Install the purple-discord-gitAUR package.\n\nThen add a new account, select Discord as the protocol, enter your Discord login e-mail address and its password.\n\n"
    },
    {
      "title": "IRC",
      "level": 3,
      "content": "This is a small tutorial for connecting to the Libera Chat network. It works for other IRC networks as long as you substitute the port numbers and other specific settings.\n\nGo to Accounts > Manage Accounts > Add. Fill/select the following options:\n\n```\nProtocol: IRC\nUsername: your nick\n```\n\nNow go to Buddies > New instant message (or hit Ctrl+m), fill 'libera.chat' in the textbox and username@irc.libera.chat, then click 'Ok'. Type:\n\n```\n/join #archlinux\n```\n\nThe channel can be substituted with any other channel.\n\nThis final step will add your channel to 'Buddies': go to Buddies > Add chat, fill the correct channel in the textbox named channel (#archlinux).\n\n"
    },
    {
      "title": "Sametime protocol",
      "level": 3,
      "content": "Install the libpurple-meanwhileAUR package. The 'Sametime' protocol will be available when creating an account.\n\n"
    },
    {
      "title": "Skype plugin",
      "level": 3,
      "content": "Install the purple-skypeweb or purple-skypeweb-gitAUR package.\n\n"
    },
    {
      "title": "Slack plugin",
      "level": 3,
      "content": "Install the slack-libpurple-gitAUR package.\n\n"
    },
    {
      "title": "Rocket.Chat plugin",
      "level": 3,
      "content": "Install the purple-rocketchat-gitAUR package.\n\n"
    },
    {
      "title": "Telegram plugin",
      "level": 3,
      "content": "Install the telegram-tdlib-purple-gitAUR or telegram-purple-gitAUR package.\n\nEnter your Telegram phone number when creating the account, after which you will receive an SMS text message with a confirmation code, which you will have to enter to authorize your Telegram protocol account on Pidgin.\n\n"
    },
    {
      "title": "XMPP",
      "level": 3,
      "content": "Pidgin has out-of-the-box support for the XMPP/Jabber chat protocol. Some additional plugins exist for support of XMPP extensions such as OMEMO (libpurple-lurch) or Message Carbons (libpurple-carbonsAUR).\n\n"
    },
    {
      "title": "WhatsApp plugin",
      "level": 3,
      "content": "The purple-gowhatsappAUR package provides support for WhatsAppWeb.\n\n"
    },
    {
      "title": "Security",
      "level": 2,
      "content": "Pidgin uses Libpurple 2 which stores passwords unencrypted (in plaintext) in $HOME/.purple/account.xml, see [1]. You can store them in a keyring by using a plugin like:\n\n- purple-gnome-keyringAUR\n- pidgin-kwallet\n\n"
    },
    {
      "title": "Privacy",
      "level": 2,
      "content": "Pidgin has some privacy rules set by default. Namely, the whole world cannot send you messages; only your contacts or people selected from a list. Adjust this, and other settings in Tools > Privacy.\n\n"
    },
    {
      "title": "Pidgin-OTR",
      "level": 3,
      "content": "This is a plugin that brings Off-The-Record (OTR) messaging to Pidgin. OTR is a cryptographic protocol that will encrypt your instant messages.\n\nFirst you need to install pidgin-otr from the official repositories. Once this has been done, OTR has been added to Pidgin.\n\n1. To enable OTR, start Pidgin and go to Tools > Plugins or press Ctrl+u. Scroll down to the entry entitled \"Off-The-Record Messaging\". If the checkbox beside it is not checked, check it.\n1. Next, click on the plugin entry and select \"Configure plugin\" at the bottom. Select which account you wish to generate a key for, then click \"Generate\". You will have now generated a private key. If you are not sure what the other options do, leave them, the default options will work fine.\n1. The next step is to contact a buddy who also has OTR installed. In the chat window, a new icon should appear to the top right of your text input box. Click on it, and select \"Start private conversation\". This will start an 'Unverified' session. Unverified sessions are encrypted, but not verified - that is, you have started a private conversation with someone using your buddy's account who has OTR, but who might not be your buddy. The steps for verification of a buddy are beyond the scope of this section; however, they might be added in the future.\n\n"
    },
    {
      "title": "Pidgin-Encryption",
      "level": 3,
      "content": "pidgin-encryptionAUR transparently encrypts your instant messages with RSA encryption. Easy-to-use, but very secure.\n\nYou can enable it the same way as Pidgin-OTR.\n\nNow you can open conversation window and new icon should appear beside menu. Press it to enable or disable encryption. Also if you want to make encryption enabled by default right-click on a buddy's name (in your buddy list), and select Turn Auto-Encrypt On. Now, whenever a new conversation window for that buddy is opened, encryption will start out as enabled.\n\n"
    },
    {
      "title": "Pidgin-GPG",
      "level": 3,
      "content": "Pidgin-GPG transparently encrypt conversations using GPG, and taking advantage of all the features of a pre-existing WoT.\n\nThe plugin is available on AUR as pidgin-gpg-gitAUR. It can be enabled the same way as the previously mentioned ones.\n\n"
    },
    {
      "title": "Other packages",
      "level": 2,
      "content": "Arch has other Pidgin-related packages. Here are the most popular (for a thorough list, search the AUR):\n\n- pidgin-libnotifyAUR - Libnotify support, for theme-consistent notifications\n- pidgin-latexAUR - A small latex plugin for pidgin. Put math between $$ and have it rendered (recepient also needs to have this installed)\n\n"
    },
    {
      "title": "Auto logout on suspend",
      "level": 2,
      "content": "If you suspend your computer pidgin seems to stay connected for about 15 minutes. To prevent message loss, it is needed to set your status offline before suspending or hibernating. The status message will not be changed.\n\nTherefore create a new systemd unit pidgin-suspend in /etc/systemd/system Take the following snippet and replace myuser with your user.\n\n```\n[Unit]\nDescription=Suspend Pidgin\nBefore=sleep.target\nStopWhenUnneeded=yes\n\n[Service]\nType=oneshot\nUser=myuser\nRemainAfterExit=yes\nEnvironment=DISPLAY=:0\nExecStart=-/usr/bin/purple-remote setstatus?status=offline\nExecStop=-/usr/bin/purple-remote setstatus?status=available\n\n[Install]\nWantedBy=sleep.target\n```\n\n"
    },
    {
      "title": "Minimize to tray",
      "level": 2,
      "content": "To make use of the Xfce system tray go to preferences and enable the system tray in the section \"Interface\". You can now close the main window and run pidgin minimized. You will also be able to see message notifications in the tray.\n\n"
    },
    {
      "title": "Backup",
      "level": 2,
      "content": "Save ~/.purple to backup all message logs, accounts and other application data.\n\n"
    },
    {
      "title": "Version Match for Sametime",
      "level": 3,
      "content": "There was an issue if you would connect to the Sametime via Pidgin, it prompt \"Version Match\". A potential solution on the client side is to fake the version in accounts.xml. Insert/change the lines:\n\n```\naccounts.xml\n```\n\n```\n<setting name='fake_client_id' type='bool'>1</setting>\n<setting name='client_minor' type='int'>8511</setting>\n```\n\nin the <settings> section of Sametime account in accounts.xml which is located in $HOME/.purple/ folder.\n\n"
    },
    {
      "title": "Browser error",
      "level": 3,
      "content": "If clicking a link within Pidgin creates an error message about trying to use 'sensible-browser' to open a link, try editing ~/.purple/prefs.xml. Find the line referencing 'sensible-browser' and change it to this:\n\n```\n<pref name='command' type='path' value='firefox'/>\n```\n\nThis example assumes you use Firefox.\n\nAs an alternative if the method above does not work you can set the desired browser in the pidgin preferences in the section \"Browser\".\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Using Pidgin\n- Wikipedia:Pidgin_(software)\n- History import Kopete to Pidgin\n- Connecting to HipChat using Pidgin\n- finch, a console based libpurple client, essentially Pidgin in a terminal\n\n"
    }
  ]
}