{
  "title": "PipeWire (Suomi)",
  "url": "https://wiki.archlinux.org/title/PipeWire_(Suomi)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Aiheeseen liittyen\n\n- PipeWire/Examples\n\nNote: **Tämä artikkeli tai osa vaatii Suomennosta.** Tämä artikkeli tai osa vaatii Suomennosta.\n\nTämä artikkeli tai osa vaatii Suomennosta.\n\nPipeWire on uusi multimedia runko GNOMEn kehittäjiltä. Pääkehittäjänä toimii Wim Taymans.\n\nPipeWire tukee säiliöitä kuten Flatpakkia ja ei turvaudu käyttäjäryhmien ääneen tai kuvaan, vaan käyttää ennemminkin PolKit tyyppistä turvamallia kysyen Flatpakkia tai Waylandia oikeudelle nauhoittaa näyttöä tai ääntä.\n\n"
    },
    {
      "title": "Asennus",
      "level": 2,
      "content": "Asenna pipewire paketti virallisesta pakettivarastosta.\n\nPipewire käyttää Systemd/User palvelimen hallintaan ja automaattiseen kannan aktivointiin. Katso vastaava Systemd/User lisätiedolle käynnistymis käyttäytymisestä ja palvelujen kirjauksista.\n\nVaihtoehtoisesti voidaan asentaa pipewire-docs paketti dokumenteille. Muita paketteja, kuten pipewire-alsa, pipewire-pulse, ja pipewire-jack, ei normaalisti tarvita ellei niitä haluta käyttää PulseAudio/JACK tilalla. Saatavilla on myös lib32-pipewire ja lib32-pipewire-jack multilib tuelle.\n\n"
    },
    {
      "title": "WebRTC näytönjakaminen",
      "level": 3,
      "content": "Valtaosa selaimista aikaisemmin luotti X11 työpöydän (tai sovelluksien) sieppaukseen kun WebRTC:tä käytettiin (esim. googlen Hangoutit); mutta jos käytetään Waylandia, työpöydän jakaminen on periaatteessa rikki, mutta pipewire pystyy antamaan tuen tätä käyttötapausta varten Waylandin alla.\n\nTämä vaatii xdg-desktop-portal ja yhden sen taustaohjelman asennettuna [1]. Saatavilla olevat taustaohjelmat:\n\n- xdg-desktop-portal-gtk GNOME:lle.\n- xdg-desktop-portal-kde KDE:lle.\n- xdg-desktop-portal-wlr Wlroots-pohjainen latoja (esim. Sway tai dwl)\n\nFirefox (84+) tukee tätä kun taas Chromiumissa (73+) täytyy aktivoida WebRTC PipeWire tuki avaamalla seuraava osoite chromium välilehdellä:\n\n```\nchrome://flags/#enable-webrtc-pipewire-capturer\n```\n\nJotta xdg-desktop-portal-wlr saadaan toimimaan, täytyy XDG_CURRENT_DESKTOP[2] asettaa:\n\n```\nexport XDG_CURRENT_DESKTOP=sway\n```\n\n"
    },
    {
      "title": "Video",
      "level": 3,
      "content": "Vaikka kyseinen ohjelma ei ole vielä tuotantovalmis, on kumminkin turvallista kokeilla sitä vapaasti. Valtaosa sovelluksista, jotka luottavat GStreamerin hoitavan esim. kuvan suoratoistoa, näiden pitäisi toimia suorilteen PipeWiren GStreamer lisäosan ansiosta. Sovellukset, kuten esim. cheese, pystyvät siitä syystä jo jakamaan videokuva syötettä käyttäen tätä.\n\n"
    },
    {
      "title": "Audio",
      "level": 3,
      "content": "PipeWirea voidaan käyttää audio palvelimena, joka voidaan rinnastaa PulseAudioon tai JACKiin. Sen tarkoituksena on korvata molemmat PulseAudio ja JACK, tarjoamalla PulseAudio-yhteensopiva palvelin toteutus ja ABI-yhteensopivat kirjastot JACK asiakasohjelmille. Katso tämä blogi kirjaus lisätiedolle.\n\n"
    },
    {
      "title": "ALSA/Legacy sovellukset",
      "level": 3,
      "content": "Asenna pipewire-alsa reitittääksesi kaikki sovellukset käyttäen ALSA APIa PipeWiren kautta.\n\n"
    },
    {
      "title": "PulseAudio asiakasohjelmat",
      "level": 3,
      "content": "Asenna pipewire-pulse. Normaalisti enempää työtä ei tarvita, sillä pipewire-pulse.socket pitäisi olla aktivoituna suoraan paketista. Jos PipeWire ei toimi oikein Järjestelmän käynnistyttyä, kokeile myös käyttäjäpalveluiden pipewire-pulse.service ja pipewire.service aktivointia. Katso Systemd/User.\n\nKirjaudu uudelleen sisään tai käynnistä uudelleen nähdäksesi vaikutuksen.\n\nTarkistaaksesi, että korvaava paketti toimii, suorita seuraava komento ja tarkista ulostulo:\n\n```\n$ pactl info\n```\n\n```\n...\nServer Name: PulseAudio (on PipeWire 0.3.16)\n...\n```\n\n"
    },
    {
      "title": "JACK asiakasohjelmat",
      "level": 4,
      "content": "Asenna pipewire-jack ja käytä pw-jack komentoa, jotta JACK asiakasohjelmat käynnistyvät yhteensopivien kirjastojen kanssa alkuperäisten sijasta libjack*:\n\n```\npw-jack application\n```\n\n"
    },
    {
      "title": "Bluetooth laitteet",
      "level": 4,
      "content": "PipeWire käsittelee Bluetooth audiolaitteita, jos pipewire-pulse paketti on asennettuna. Erityisemmin, mediatilan taustaprosessi tarkastelee /etc/pipewire/media-session.d/with-pulseaudio, ja aktivoi sen bluez5 moduulin automaattisesti, jos tiedosto on olemassa.\n\n"
    },
    {
      "title": "Käytä PipeWirea alkuperäisen JACKin päällä",
      "level": 4,
      "content": "PipeWire voi myös pyöriä JACK asiakasohjelmana alkuperäisen JACK taustaprosessin päällä jos näin halutaan. Katso JACK ja PipeWire lisätiedolle.\n\n"
    },
    {
      "title": "Rätisevä ääni Source Engine pohjaisissa peleissä",
      "level": 3,
      "content": "Oletus pituus äänipuskurille (joka on käytännössä ääniviive) on 0.025 sekunttia. Joillekkin komponenteille, tämä pituus on liian pieni, joten tälläistä rätinää voi ilmetä. PulseAudiolla ei ole tätä ongelmaa, koska se nostaa puskurin kokoa automaattisesti, kun puskurin xrun havaitaan. PipeWire ei tee tätä ja ei välttämättä ikinä tulekkaan tekemään tätä. Tapa millä tämän voi korjata on edelleen meneillään.\n\nTällä hetkellä, toimiva väliaikainen korjaustapa on avata pelin sisäinen konsoli ja painamalla ` nappia (nappi joka on vasemmalla puollella 1:stä) ja kirjoittamalla konsoliin snd_mixahead 0.03. Arvoa kannattaa itse kokeilla, mikä toimii parhaiten.\n\nAiheeseen liittyvä ongelma: https://gitlab.freedesktop.org/pipewire/pipewire/-/issues/401\n\nLähde: https://csgoguru.com/improve-your-csgo-sound-settings/\n\n"
    },
    {
      "title": "Pipewire ei tunnista mikrofonia",
      "level": 3,
      "content": "pipewire-media-session ei tunnista ALSA PCM laitteita oletukselta. Lisää tämä sen käynnistysasetuksiin pipewiren config tiedostossa:\n\n```\n/etc/pipewire/pipewire.conf\n```\n\n```\n...\nexec /usr/bin/pipewire-media-session -e alsa-pcm\n...\n```\n\nKäynnistä pipewire uudelleen ja tarkista saatavilla olevat laitteet:\n\n```\n$ pw-record --list-targets\n```\n\n```\nAvailable targets (\"*\" denotes default): 62\n\t58: description=\"Built-in Audio\" prio=1872\n\t60: description=\"Built-in Audio\" prio=2000\n*\t62: description=\"Built-in Audio (Loopback PCM)\" prio=1984\n```\n\n"
    },
    {
      "title": "Ei ääntä Bluetooth laitteessa",
      "level": 3,
      "content": "7.12.2020 lähtien, jos ääntä ei ole kun Bluetooth laite on yhdistetty, täytyy vaihtaa oletus \"nieluun\" ja/tai siirtää nielun syöte oikeaan nieluun. Käytä pactl set-default-sink asettaaksesi nielun ja pactl list sinks listataksesi saatavilla olevat nielut. Tämä voidaan automatisoida udev kanssa käyttäen vastaavaa skriptiä kuin tämä.\n\nKatso tämä Reddit keskustelu syvemmälle keskustelulle asiasta. Skriptin tekijän mukaan, kuuloke profiililla (HSP) saattaa vielä olla ongelmia.\n\n"
    },
    {
      "title": "Katso myös",
      "level": 2,
      "content": "- Wiki — PipeWire Wiki Freedesktop GitLab\n- Pipewire Päivityksen Blogi Viesti — Blogi viesti tammikuulta 2018, josta näkyy Pipewiren tilanne siihen aikaan\n- PipeWiren Loppukesän Päivitys 2020 — Blogi viesti syyskuulta 2020\n\n"
    }
  ]
}