{
  "title": "PipeWire/Examples (Русский)",
  "url": "https://wiki.archlinux.org/title/PipeWire/Examples_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- PipeWire (Русский)\n- PulseAudio/Примеры\n\n"
    },
    {
      "title": "Разделение на front/rear",
      "level": 3,
      "content": "Если PipeWire используется как замена PulseAudio или JACK, вы можете использовать этот способ разделения каналов. Используя его, можно одновременно использовать раздельные каналы для колонок и наушников.\n\nПрисоедините колонки к line-out выходу, а наушники к порту на задней панели. В pavucontrol переключите звуковую карту на использование как Analog Surround 4.0. Используйте следующие команды чтобы создать новые звуковые потоки для колонок и наушников, привяжите колонки к передним каналам, а наушники к задним:\n\n```\npactl load-module module-null-sink sink_name=speakers object.linger=1 media.class=Audio/Sink channel_map=FL,FR\n pactl load-module module-null-sink sink_name=headphones object.linger=1 media.class=Audio/Sink channel_map=RL,RR\n```\n\nПараметр object.linger=1 сохраняет каналы активными даже после отключения устройств. Так же вы можете использовать имя канала sink_name каким желаете нужным.\n\nЧтобы выгрузить модуль, используйте pw-cli destroy ID, где ID можно узнать командой pactl load-module. Выгрузка отдельных модулей через pactl unload-module на данный момент не поддерживается [1], но можно выгрузить все module-null-sink модули командой pactl unload-module module-null-sink.\n\nИспользуя jack_connect, присоедините созданные каналы к портам звуковой карты. Найти нужные имена каналов можно командой jack_lsp -c.\n\n```\npw-jack jack_connect speakers:monitor_0  HDA\\ ATI\\ SB:playback_FL\n pw-jack jack_connect speakers:monitor_1  HDA\\ ATI\\ SB:playback_FR\n pw-jack jack_connect headphones:monitor_0  HDA\\ ATI\\ SB:playback_RL\n pw-jack jack_connect headphones:monitor_1  HDA\\ ATI\\ SB:playback_RR\n```\n\nЕсли вы хотите управлять громкостью каждого устройства по отдельности, используйте утилиты alsa (напр. amixer). Так же можете взять для примера скрипт, упрощающий процесс.\n\n"
    }
  ]
}