{
  "title": "PipeWire (Português)",
  "url": "https://wiki.archlinux.org/title/PipeWire_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- PipeWire/Exemplos (Português)\n\nPipeWire é um novo framework low-level de multimídia. Seu objetivo é oferecer a captura e a reprodução tanto para áudio quanto para vídeo com latência mínima e suporte para PulseAudio-, JACK-, ALSA- e programas baseados em GStreamer.\n\nO daemon baseado no framework pode ser configurado para ser tanto um servidor de áudio (com funcionalidades do JACK e PulseAudio) quanto um servidor de captura de vídeo.\n\nPipeWire também oferece suporte para containers como Flatpak e não depende dos user groups audio e vídeo, e em seu lugar usa us sistema de segurança similar ao Polkit, pedindo permissão para Flatpak ou Wayland para poder gravar a tela ou áudio.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote pipewire através dos repositórios oficiais.\n\nPipewire usa systemd/User para a manutenção do servidor e da ativação automática dos sockets.\n\nOpcionalmente, instale pipewire-docs para revisar a documentação. Outros pacotes, como pipewire-alsa, pipewire-pulse, e pipewire-jack normalmente não são necessários, a menos que o usuário queira usar Pipewire como um substituto para PulseAudio/JACK. Outros pacotes disponíveis são lib32-pipewire, e lib32-pipewire-jack para suporte a multilib.\n\n"
    },
    {
      "title": "GUI",
      "level": 3,
      "content": "- Helvum — Patchbay para pipewire baseada em GTK, inspirada pela ferramenta catia, para o JACK.\n\n"
    },
    {
      "title": "Compartilhamento de tela por WebRTC",
      "level": 3,
      "content": "A maioria dos navegadores costumava depender do X11 para a captura do desktop (ou de programas individuais) ao usar WebRTC (por exemplo, no Google Hangouts). Com Wayland, o mecanismo de compartilhamento é lidado de maneira diferente por motivos de segurança. PipeWire permite o compartilhamento de conteúdo usando Wayland com controles de acesso bem definidos.\n\nIsso requer xdg-desktop-portal e um de seus backends para ser instalado. Os backends disponíveis são:\n\n- xdg-desktop-portal-gtk para GNOME.\n- xdg-desktop-portal-kde para KDE.\n- xdg-desktop-portal-wlr para compositores baseados em wlroots (por exemplo Sway, ou dwl)\n\nFirefox (84+) oferece suporte para esse método por padrão, enquanto que no Chromium (73+) o usuário precisa habilitar suporte a WebRTC PipeWire habilitando a flag correspondente (experimental) na seguinte URL:\n\n```\nchrome://flags/#enable-webrtc-pipewire-capturer\n```\n\nPara xdg-desktop-portal-wlr funcionar você precisa instalar pipewire-media-session [1] e garantir que XDG_CURRENT_DESKTOP=sway está ativado na sessão [2].\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nLembrando que a única funcionalidade suportada é o compartilhamento do deskop inteiro e não de um app/janela específicos [4][5].\n\n"
    },
    {
      "title": "Vídeo",
      "level": 3,
      "content": "Por mais que o software ainda não esteja pronto para produção, é totalmente seguro de se usar. A maioria dos programas que dependem do GStreamer para lidar, por exemplo, com transmissões de vídeo devem funcionar perfeitamente graças ao plugin GStreamer PipeWire. Programas como, por exemplo cheese são capazes de compartilhar vídeo capturado ao serem usados por conta disso.\n\n"
    },
    {
      "title": "Áudio",
      "level": 3,
      "content": "PipeWire pode ser utilizado como um servidor de áudio, similar ao PulseAudio e JACK. Seu objetivo é substituir tanto o PulseAudio quanto o JACK, ao prover uma implementação de servidor compatível com PulseAudio e bibliotecas compatíveis com clients JACK. Ver esta entrada no blog para mais informações.\n\n"
    },
    {
      "title": "ALSA/Programas legados",
      "level": 4,
      "content": "Instale pipewire-alsa para rotear todos os programas que usem a API ALSA através do PipeWire.\n\n"
    },
    {
      "title": "Clients PulseAudio",
      "level": 4,
      "content": "Instale pipewire-pulse. O mesmo irá substituir pulseaudio e pulseaudio-bluetooth. Normalmente não é necessária mais nenhuma ação, já que o serviço de usuário pipewire-pulse.socket deve ser habilitado automaticamente pelo pacote. Se o PipeWire não funcionar corretamente na inicialização do sistema, confirme que os serviços Systemd/User pipewire-pulse.service, pipewire.service, e pipewire-media-session.service estão funcionando.\n\nReinicie ou encerre e entre novamente na sessão para surtir efeito.\n\nPara conferir se a substituição está funcionando, rode o seguinte comando e confira o resultado:\n\n```\n$ pactl info\n```\n\n```\n...\nServer Name: PulseAudio (on PipeWire 0.3.16)\n...\n```\n\n"
    },
    {
      "title": "Clients JACK",
      "level": 4,
      "content": "Instale pipewire-jack e use pw-jack para abrir clients JACK com as bibliotecas compatíveis ao invés da original libjack*:\n\n```\npw-jack application\n```\n\nTambém é possível requerir um tamanho de buffer customizado ao definir um quociente de tamanho de buffer/taxa de amostra (o qual define a latência de bloco em segundos):\n\n```\nPIPEWIRE_LATENCY=\"128/48000\" pw-jack application\n```\n\n"
    },
    {
      "title": "Dispositivos Bluetooth",
      "level": 4,
      "content": "PipeWire lida com dispositivos de áudio Bluetooth se o pacote pipewire-pulse estiver instalado. Mais especificamente, o deamon de sessão de mídia checa por /etc/pipewire/media-session.d/with-pulseaudio, e habilita seu módulo bluez5 automaticamente se o arquivo existir.\n\n"
    },
    {
      "title": "Rodar PipeWire em cima do JACK nativo",
      "level": 4,
      "content": "PipeWire também pode ser usado como um client JACK em cima do daemon JACK nativo se desejado. Ver JACK and PipeWire para mais informações.\n\n"
    },
    {
      "title": "PulseEffects",
      "level": 3,
      "content": "Note: **A tradução deste artigo ou desta seção não reflete o texto original.** A tradução deste artigo ou desta seção não reflete o texto original.\n\nA tradução deste artigo ou desta seção não reflete o texto original.\n\nPulseEffects é um programa em GTK que disponibiliza uma vasta quantidade de efeitos e filtros de áudio para transmissões de saída de áudio e de entrada de microfone em programas individuais. Efeitos notáveis incluem um equalizador de entrada/saída, equalizador de volume de entrada e melhorias de grave, além de um de-esser para entrada de um plug-in de redução de ruído. Ver a página no GitHub para uma lista completa de efeitos.\n\nPara usar o PulseEffects com PipeWire, instale easyeffects.\n\nVer Community Presets para uma coleção de configurações de presets.\n\n"
    },
    {
      "title": "Microfone não é detectado por PipeWire",
      "level": 3,
      "content": "O módulo alsa-monitor do PipeWire usa alsa-card-profiles para detectar dispositivos por padrão. Se isso não estiver funcionando para você, tente desligar api.alsa.use-acp, ou opcionalmente ligue api.alsa.use-ucm em /etc/pipewire/media-session.d/alsa-monitor.conf, embaixo de rules -> a primeira regra -> actions -> update-props:\n\n```\n...\nupdate-props = {\n    api.alsa.use-acp = false\n...\n```\n\nEntão reinicie o pipewire e confira os dispositivos disponíveis:\n\n```\n$ pw-record --list-targets\n```\n\n```\nAvailable targets (\"*\" denotes default): 62\n\t58: description=\"Built-in Audio\" prio=1872\n\t60: description=\"Built-in Audio\" prio=2000\n*\t62: description=\"Built-in Audio (Loopback PCM)\" prio=1984\n```\n\n"
    },
    {
      "title": "Sem som após conectar um dispositivo Bluetooth",
      "level": 3,
      "content": "Até 07-12-2020, se não houver som após conectar um dispositivo Bluetooth, você pode precisar trocar o sink padrão e/ou mover um input de sink para o sink correto. Use pactl list sinks para listar os sinks disponíveis e pactl set-default-sink para trocar o sink padrão para o dispositivo Bluetooth. Isso pode ser automatizado via udev usando um script similar a este.\n\nVer essa discussão no Reddit para mais informações sobre o problema. De acordo com o autor do script, o perfil de headset (HSP) pode ainda apresentar problemas.\n\n"
    },
    {
      "title": "Volume baixo",
      "level": 3,
      "content": "Caso, após substituir PulseAudio com PipeWire, seu som funcionar corretamente mas após reiniciar o volume estiver intoleravelmente baixo:\n\nAbra alsamixer, aperte F6 para selecionar a placa de som correta, e confirme que os volumes ALSA estão em 100%. alsactl deve manter essa configuração após reiniciar o sistema.\n\n"
    },
    {
      "title": "Aumentar RLIMIT_MEMLOCK",
      "level": 3,
      "content": "```\nDec 13 11:11:11 HOST pipewire-pulse[99999]: Failed to mlock memory 0x7f4f659d8000 32832: This is not a problem but for best performance, consider increasing RLIMIT_MEMLOCK\n```\n\nInstale realtime-privileges e adicione seu usuário ao grupo realtime.\n\nOutra alternativa é aumentar o memlock de 64kB para 128kB, o que parece ser o suficiente para corrigir isso. Se você estiver usando pipewire-pulse sob systemd/User, adicione:\n\n```\nusername\tsoft\tmemlock\t64\nusername\thard\tmemlock\t128\n```\n\nem /etc/security/limits.d/username.conf\n\n"
    },
    {
      "title": "Modificar a taxa de amostra",
      "level": 3,
      "content": "Por padrão PipeWire define uma taxa de amostra global de 48kHz. Se você precisar modificá-la (por exemplo, se possuir um DAC que suporte um valor maior) você podê fazê-lo modificando a linha default.clock.rate = 48000 no arquivo de configuração /etc/pipewire/pipewire.conf. Por exemplo, se você quiser 192kHz, descomente e modifique a linha 48000 para default.clock.rate = 192000.\n\n"
    },
    {
      "title": "Placa de som externa não é ativada após reconectar",
      "level": 3,
      "content": "Cheque se ~/.config/pipewire-media-session/default-profile possui alguma entrada com o perfil padrão \"off\" e a remova. Se isso não ajudar, remova todos os arquivos de ~/.config/pipewire-media-session/ e reinicie PipeWire usando systemctl --user restart pipewire.service.\n\n"
    },
    {
      "title": "Sem som ou pactl info mostra Failure: Connection refused",
      "level": 3,
      "content": "Isso significa que os programas não estão sendo capazes de conectar com o serviço PipeWire-Pulse, confirme que /etc/pipewire/pipewire-pulse.conf existe e não é está vazio, e reinicie PipeWire-Pulse usando systemctl --user restart pipewire-pulse.service.\n\nSe isso não resolver o problema, rode o comando strace -f -o /tmp/pipe.txt pactl info e cole em /tmp/pipe.txt para ajudar na busca por ajuda no IRC (OFTC #pipewire) ou em listas de mensagens.\n\n"
    },
    {
      "title": "Qualidade de áudio baixa usando Bluetooth",
      "level": 3,
      "content": "No caso de a reprodução via Bluetooth travar ou cortar, confira pipewire.service usando systemctl --user status pipewire.service. Se houver erros como este,\n\n```\nFeb 17 18:23:01 HOST pipewire[249297]: (bluez_input.18:54:CF:04:00:56.a2dp-sink-60) client too slow! rate:512/48000 pos:370688 status:triggered\n```\n\nconfira o codec atualmente selecionado usando pactl list sinks e tente modificá-lo configurando bluez5.codecs para usar um dentre sbc aac ldac aptx aptx_hd em\n\n```\n/etc/pipewire/media-session.d/bluez-monitor.conf\n```\n\n```\n...\nproperties = {\n  ...\n  bluez5.codecs = [sbc]\n...\n```\n\nTente habilitar suporte a mSBC (fixes mic on Sony 1000XM3):\n\n```\n/etc/pipewire/media-session.d/bluez-monitor.conf\n```\n\n```\n...\nrules = [\n  ...\n  actions = {\n    ...\n    update-props = {\n     ...\n     bluez5.msbc-support = true\n...\n```\n\nReinicie PipeWire usando systemctl --user restart pipewire.service para as mudanças fazerem efeito.\n\n"
    },
    {
      "title": "Sem dispositivos detectados após atualizar PipeWire e reiniciar (git / >=0.3.23)",
      "level": 3,
      "content": "Até o commit 012a68f8[6] um novo serviço do systemd foi adicionado, desabilitado por padrão, significando que não há pipewire-media-session rodando ao inicializar o sistema. Para habilitar o serviço, rode: systemctl --user enable --now pipewire-media-session.service\n\nSe o usuário do gerenciador de pacotes não tiver preparado as mudanças no arquivo de configuração após a atualização, então outra instância de pipewire-media-session possa estar rodando em pipewire.service. Para conferir, rode: systemctl --user status pipewire.service\n\nSe o resultado mostrar pipewire e pipewire-media-session rodando, atualize as configurações do seu sistema e/ou usuário:\n\n```\n/etc/pipewire/pipewire.conf and/or ~/.config/pipewire/pipewire.conf\n```\n\n```\ncontext.exec = {\n  ...\n  # Line below should be commented out\n  #\"/usr/bin/pipewire-media-session\" = { args = \"\" }\n  ...\n}\n```\n\n"
    },
    {
      "title": "Atraso no áudio notável ao começar a tocar áudio",
      "level": 3,
      "content": "Isso é causado pela suspensão dos nós quando inativo. Isso pode ser desabilitado editando /etc/pipewire/media-session.d/*-monitor.conf dependendo de onde o atraso ocorre e mudar session.suspend-timeout-seconds para 0 para desabilitar ou experimentar com outros valores e encontrar o que funciona para você. Outra alternativa é comentar a linha suspend-node em /etc/pipewire/media-session.d/media-session.conf. Reinicie os serviços do systemd pipewire e pipewire-pulse para aplicar as mudanças ou reinicie o sistema.\n\n"
    },
    {
      "title": "Áudio cortando quando várias fontes de áudio começam a tocar",
      "level": 3,
      "content": "Esse problema pode ser tipicamente diagnosticado ao rodar journalctl --user -b -u pipewire-pulse e procurar por linhas similares a:\n\n```\npipewire-pulse[21740]: pulse-server 0x56009b9d5de0: [Nightly] UNDERFLOW channel:0 offset:370676 underrun:940\n```\n\nDe acordo com o https://gitlab.freedesktop.org/pipewire/pipewire/-/wikis/Troubleshooting#underrununderflow-and-broken-pipe-errors guia oficial de solucão de problemas do PipeWire], para resolver esse problema edite /etc/pipewire/media-session.d/alsa-monitor.conf, descomente a linha api.alsa.headroom = 0 e modifique seu valor para 1024.\n\n"
    },
    {
      "title": "O microfone soa distorcido",
      "level": 3,
      "content": "Esse problema as vezes é causado pelas configurações de \"boost\" do microfone. Experimente navegar até a placa de som que está tendo problemas após rodar alsamixer e use as setas do teclado para reduzir as possíveis opções de \"Mic Boost\" ou \"Internal Mic Boost\".\n\n"
    },
    {
      "title": "Ver também",
      "level": 2,
      "content": "- Wiki — PipeWire Wiki on Freedesktop GitLab\n- Pipewire Update Blog Post — Blog post from January 2018 outlining the state of PipeWire at the time\n- PipeWire Late Summer Update 2020 — Blog post from September 2020\n\n"
    }
  ]
}