{
  "title": "Plymouth (Русский)",
  "url": "https://wiki.archlinux.org/title/Plymouth_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Тихая загрузка\n\nPlymouth — это проект Fedora и один из официальных проектов freedesktop.org, реализующий графический экран загрузки системы без бегущих надписей (логов) на экране. Он использует kernel mode setting (KMS, установка разрешения и глубины цвета на уровне ядра) для обеспечения родного разрешения экрана на раннем этапе загрузки, после чего отображает красивый экран загрузки вплоть до появления менеджера входа.\n\n"
    },
    {
      "title": "Подготовка",
      "level": 2,
      "content": "Plymouth главным образом использует KMS (Kernel Mode Setting) для отображения графики. На EFI/UEFI системах plymouth может использовать EFI framebuffer.\n\nЕсли вы не можете использовать KMS, например, из-за использования проприетарного драйвера или не хотите использовать EFI framebuffer, обратите внимание на Uvesafb, поскольку он поддерживает широкоформатные разрешения. Если у вас не настроены ни KMS ни framebuffer, то Plymouth вернётся в текстовый режим.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет plymouth. Разрабатываемая версия доступна в пакете plymouth-gitAUR.\n\nПо умолчанию Plymouth записывает сообщения загрузки в /var/log/boot.log и не показывает графический экран загрузки.\n\n- Для отображения графического экрана загрузки добавьте splash в параметры ядра.\n- Для обеспечения тихой загрузки также добавьте quiet.\n- Для отключения записи лога добавьте plymouth.nolog.\n\nДля раннего запуска Plymouth нужно добавить его в initramfs.\n\n"
    },
    {
      "title": "mkinitcpio",
      "level": 3,
      "content": "Добавьте plymouth в массив HOOKS в mkinitcpio.conf.\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=(... plymouth ...)\n```\n\n"
    },
    {
      "title": "dracut",
      "level": 3,
      "content": "После установки Plymouth dracut автоматически обнаружит его и добавит в ваши образы initramfs. Если автоопределение не сработало, вы можете заставить dracut добавить Plymouth с помощью следующей строки в конфигурации dracut:\n\n```\n/etc/dracut.conf.d/myflags.conf\n```\n\n```\nadd_dracutmodules+=\" plymouth \"\n```\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Plymouth настраивается через файл /etc/plymouth/plymouthd.conf. Значения по умолчанию описаны в файле /usr/share/plymouth/plymouthd.defaults.\n\n"
    },
    {
      "title": "Выбор темы",
      "level": 3,
      "content": "Plymouth поставляется со следующими темами:\n\n1. BGRT: Вариант Spinner, который использует OEM-логотип, если он доступен (BGRT означает Boot Graphics Resource Table)\n1. Fade-in: \"Простая тема с затухающими и разгорающимися мерцающими звездами\"\n1. Glow: \"Производственная тема, показывающая процесс загрузки в виде круговой диаграммы\"\n1. Script: \"Пример скрипта\" (Несмотря на описание, выглядит очень симпатичной темой с логотипом Arch)\n1. Solar: \"Космическая тема, голубая звезда с протуберанцами\"\n1. Spinner: \"Простая тема с вращающимся индикатором загрузки\"\n1. Spinfinity: \"Простая тема, показывающая вращающийся знак бесконечности в центре экрана\"\n1. Tribar: \"Текстовый режим с трёхцветной полосой прогресса\"\n1. (Text: \"Текстовый режим с трёхцветной полосой прогресса\")\n1. (Details: \"Резервная тема с подробностями загрузки\")\n\nПо умолчанию используется тема bgrt. Чтобы выбрать другую, пропишите её в настройках, например:\n\n```\n/etc/plymouth/plymouthd.conf\n```\n\n```\n[Daemon]\nTheme=fade-in\n```\n\nили выберите тему с помощью команды:\n\n```\n# plymouth-set-default-theme -R тема\n```\n\nПри каждой смене темы необходимо пересобирать initrd. Это произойдёт автоматически при выборе темы командой plymouth-set-default-theme с опцией -R (в противном случае пересоберите образ initramfs самостоятельно).\n\n"
    },
    {
      "title": "Установка новых тем",
      "level": 3,
      "content": "Дополнительные темы доступны в AUR. [1] Также plymouth-kcm добавляет интеграцию с настройками KDE Plasma и предлагает темы, отсутствующие в AUR.\n\nСписок установленных тем можно получить командой:\n\n```\n$ plymouth-set-default-theme -l\n```\n\nили:\n\n```\n$ ls /usr/share/plymouth/themes\n```\n\n```\nbgrt  details  fade-in  glow  script  solar  spinfinity  spinner  text  tribar\n```\n\n"
    },
    {
      "title": "Задержка отображения",
      "level": 3,
      "content": "Plymouth позволяет добавить задержку перед отображением графического экрана загрузки:\n\n```\n/etc/plymouth/plymouthd.conf\n```\n\n```\n[Daemon]\nShowDelay=5\n```\n\nЕсли система загружается настолько быстро, что загрузочная анимация успевает лишь моргнуть до запуска DM, можно установить задержку появления экрана загрузки в параметре ShowDelay (в секундах) больше чем длительность загрузки системы, чтобы вместо мерцания отображался просто пустой экран. По умолчанию время задержки 0 секунд.\n\n"
    },
    {
      "title": "HiDPI",
      "level": 3,
      "content": "Пропишите коэффициент масштабирования (целое число) в настройках:\n\n```\n/etc/plymouth/plymouthd.conf\n```\n\n```\nDeviceScale=коэффициент-масштабирования\n```\n\nи пересоберите initrd.\n\n"
    },
    {
      "title": "Отображение сообщений ядра",
      "level": 3,
      "content": "Чтобы включить отображение сообщений ядра во время загрузки, нажмите Esc.\n\n"
    },
    {
      "title": "Плавный переход к экранному менеджеру",
      "level": 3,
      "content": "GDM поддерживает плавный переход из коробки.\n\nДля других экранных менеджеров можно создать drop-in файл для юнита display-manager.service:\n\n```\n/etc/systemd/system/display-manager.service.d/plymouth.conf\n```\n\n```\n[Unit]\nConflicts=plymouth-quit.service\nAfter=plymouth-quit.service rc-local.service plymouth-start.service systemd-user-sessions.service\nOnFailure=plymouth-quit.service\n\n[Service]\nExecStartPre=-/usr/bin/plymouth deactivate\nExecStartPost=-/usr/bin/sleep 30\nExecStartPost=-/usr/bin/plymouth quit --retain-splash\n```\n\n"
    },
    {
      "title": "Предпросмотр тем",
      "level": 3,
      "content": "Для просмотра тем без перезагрузки и пересборки initrd можно перейти в терминал нажатием Ctrl+Alt+F6, войти как root и набрать:\n\n```\n# plymouthd\n# plymouth --show-splash\n```\n\nДля выхода из просмотра нажать Ctrl+Alt+F6 снова и набрать:\n\n```\n# plymouth --quit\n```\n\n"
    },
    {
      "title": "Изменение фонового изображения темы",
      "level": 3,
      "content": "В некоторых темах (таких как spinner и bgrt) можно изменить фоновое изображение. Для этого следует заменить файл /usr/share/plymouth/themes/theme/background-tile.png на собственный. Во избежание перезаписи изменённой темы при обновлении plymouth, все действия проводите над копией темы. После изменения не забудьте пересобрать initrd.\n\n"
    },
    {
      "title": "Отсутствующее BGRT изображение",
      "level": 3,
      "content": "Если вы используете тему BGRT, но UEFI не предоставляет логотип производителя, вы можете поместить запасное изображение в /usr/share/plymouth/themes/spinner/bgrt-fallback.png.\n\n"
    },
    {
      "title": "Замедление загрузки системы для отображения анимации",
      "level": 3,
      "content": "Если ваша система загружается настолько быстро, что анимация толком не успевает отобразиться, вы можете замедлить загрузку, создав drop-in файл для службы plymouth-quit.service и добавив туда ExecStartPre=/usr/bin/sleep 5. Смотрите этот пост на reddit.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Если у вас возникают проблемы во время загрузки, вы можете временно отключить Plymouth с помощью следующих параметров ядра:\n\n```\nplymouth.enable=0 disablehooks=plymouth\n```\n\nДля записи отладочных сообщений в /var/log/plymouth-debug.log добавьте параметр ядра:\n\n```\nplymouth.debug\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Оригинальная спецификация\n- Обсуждение на форуме\n\n"
    }
  ]
}