{
  "title": "Plymouth (Español)",
  "url": "https://wiki.archlinux.org/title/Plymouth_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nPlymouth es un proyecto de Fedora que consiste en proporcionar un proceso de arranque gráfico sin parpadeo. Se basa en la configuración del modo del kernel (kernel mode setting -KMS-) para ajustar la resolución nativa de la pantalla tan pronto como sea posible, proporcionando, a continuación, una pantalla de bienvenida visual amigable que se mantiene hasta el inicio del administrador de sesión.\n\n"
    },
    {
      "title": "Preparación",
      "level": 2,
      "content": "Plymouth utiliza principalmente KMS (Kernel Mode Setting) para mostrar gráficos. Si no puede usar KMS por ejemplo, porque esté usando un controlador propietario, o si no desea utilizar EFI framebuffer, se recomienda utilizar Uvesafb ya que puede funcionar con resoluciones de pantalla ancha.\n\nSi no puede usar KMS, ni framebuffer, Plymouth caerá y la pantalla volverá de nuevo a modo de texto.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Plymouth no está actualmente disponible en los Repositorios Oficiales, y tendrá que ser instalado desde AUR.\n\nLa versión estable se llama plymouth y la versión git plymouth-gitAUR.\n\n"
    },
    {
      "title": "Incluir plymouth en initcpio",
      "level": 3,
      "content": "Añada Plymouth a la matriz HOOKS en /etc/mkinitcpio.conf. Se debe añadir después de base y udev para que funcione:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=\"base udev plymouth [...] \"\n```\n\nNote: **encrypt** \n\n"
    },
    {
      "title": "Habilitar transición de plymouth con el Gestor de pantalla",
      "level": 3,
      "content": "Para obtener una transición más suave al terminar la animación y pasar al gestor de pantallas es necesario reemplazar el servicio de systemd que inicia su gestor de pantalla con el que ofrece plymouth. Ejemplo:\n\n```\n# systemctl disable [display_manager].service && systemctl enable [display_manager]-plymouth.service\n```\n\nPlymouth ofrece soporte para los siguientes gestores de pantalla:\n\n1. gdm-plymouth.service GDM\n1. sddm-plymouth.service SDDM\n1. lightdm-plymouth.service LightDM\n1. lxdm-plymouth.service LXDM\n1. slim-plymouth.service SLiM\n\n"
    },
    {
      "title": "En la línea de órdenes del kernel",
      "level": 3,
      "content": "Ahora tiene que configurar quiet splash en la línea de órdenes del kernel, como parámetros de su gestor de arranque. Vea Kernel parameters para más información.\n\nDe modo que quedarían como sigue:\n\nPara Grub2:\n\n```\n/etc/default/grub\n```\n\n```\nGRUB_CMDLINE_LINUX_DEFAULT=\"quiet splash\"   \nGRUB_CMDLINE_LINUX=\"splash\"\n```\n\nY regeneramos el archivo grub:\n\n```\n# grub-mkconfig -o /boot/grub/grub.cfg\n```\n\n"
    },
    {
      "title": "Cambiar el tema",
      "level": 3,
      "content": "Plymouth viene con una selección de temas:\n\n1. Fade-in: «Tema simple en el que salen y se desvanecen estrellas brillantes»\n1. Glow: «Tema corporativo con el progreso de arranque en modo de gráfico circular seguido de un logo brillante emergente»\n1. Script: «Plugin de ejemplo de secuencias de órdenes» (A pesar de la descripción parece ser un tema bastante bonito con el logotipo de Arch)\n1. Solar: «Tema del espacio en tono azul con la violenta quema de la estrella solar»\n1. Spinfinity: «Tema simple que muestra un signo de infinito que gira en el centro de la pantalla»\n1. (Text: «Tema en modo texto con una barra de progreso tricolor»)\n1. (Details: «Tema en modo texto de fallback»)\n\nPor defecto, no hay seleccionado ningún tema, debe seleccionarlo editando /etc/plymouth/plymouthd.conf.\n\nPor ejemplo:\n\n```\n[Daemon]\nTheme=spinner\n```\n\nTodos los temas instalados se pueden enumerar utilizando la siguiente orden:\n\n```\n$ ls /usr/share/plymouth/themes\ndetails  glow    solar       spinner  tribar\nfade-in  script  spinfinity  text\n```\n\nLos temas pueden ser visto de antemano sin reconstruirlos, pulsando Ctrl+Alt+F2 para cambiar de consola. Acceda como root y escriba:\n\n```\n# plymouthd\n# plymouth --show-splash\n```\n\nPara salir de la vista previa, pulse Ctrl+Alt+F2 de nuevo y escriba:\n\n```\n# plymouth --quit\n```\n\nCada vez que se cambia un tema, la imagen del kernel debe ser reconstruida con:\n\n```\n# mkinitcpio -p <el nombre de su kernel; por ejemplo, linux>\n```\n\nReinicie para aplicar los cambios.\n\n"
    },
    {
      "title": "Mostrar mensajes del kernel",
      "level": 3,
      "content": "Durante el arranque puedes ver los mensajes de arranque presionando la tecla Home o también Esc.\n\n"
    },
    {
      "title": "Agregar el logo de Arch en los temas spinner y BGRT",
      "level": 3,
      "content": "Para agregar el logo de Arch en los temas spinner y BGRT simplemente copie el logo y ṕeguelo en el directorio del tema spinner y BGRT con el siguiente nombre: watermark.png.\n\n```\n# cp -r /usr/share/plymouth/arch-logo.png /usr/share/plymouth/themes/spinner/watermark.png\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "Original Spec\n\nA related forum thread\n\n"
    }
  ]
}