{
  "title": "Plymouth (Italiano)",
  "url": "https://wiki.archlinux.org/title/Plymouth_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Silent boot\n\nPlymouth is a project from Fedora and now listed among the freedesktop.org's official resources providing a flicker-free graphical boot process. It relies on kernel mode setting (KMS) to set the native resolution of the display as early as possible, then provides an eye-candy splash screen leading all the way up to the login manager.\n\n"
    },
    {
      "title": "Preparation",
      "level": 2,
      "content": "Plymouth primarily uses KMS to display graphics, but on UEFI systems it can utilize the EFI framebuffer.\n\nIf you cannot use KMS, e.g. because you are using a proprietary driver, or if you do not want to use the EFI framebuffer, consider using Uvesafb as it works with widescreen resolutions. If you have neither KMS nor a framebuffer, Plymouth will fall back to text-mode.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Plymouth is available with the stable package plymouth. For the development version, use plymouth-gitAUR.\n\nBy default, Plymouth logs the boot messages into /var/log/boot.log, and does not show the graphical splash screen.\n\n- If you want to see the splash screen, append splash to the kernel parameters.\n- If you want silent boot, append quiet too.\n- If you want to disable the logging, append plymouth.boot-log=/dev/null. Alternatively, add plymouth.nolog which also disables console redirection.\n\nTo start Plymouth on early boot, you must configure your initramfs generator to create images including Plymouth.\n\n"
    },
    {
      "title": "mkinitcpio",
      "level": 3,
      "content": "Add plymouth to the HOOKS array in mkinitcpio.conf.\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=(... plymouth ...)\n```\n\nIf you are using the systemd hook, it must be before plymouth.\n\nFurthermore make sure you place plymouth before the encrypt or sd-encrypt hook if your system is encrypted with dm-crypt.\n\nFinally, regenerate the initramfs.\n\n"
    },
    {
      "title": "dracut",
      "level": 3,
      "content": "After installing Plymouth, dracut will automatically detect it and add it to your initramfs images. If autodetection fails, you can force dracut to include Plymouth by adding the following line to your dracut configuration:\n\n```\n/etc/dracut.conf.d/myflags.conf\n```\n\n```\nadd_dracutmodules+=\" plymouth \"\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Plymouth can be configured in file /etc/plymouth/plymouthd.conf. You can see the default values in /usr/share/plymouth/plymouthd.defaults.\n\n"
    },
    {
      "title": "Changing the theme",
      "level": 3,
      "content": "Plymouth comes with a selection of themes:\n\n1. BGRT: A variation of Spinner that keeps the OEM logo if available (BGRT stands for Boot Graphics Resource Table)\n1. Fade-in: \"Simple theme that fades in and out with shimmering stars\"\n1. Glow: \"Corporate theme with pie chart boot progress followed by a glowing emerging logo\"\n1. Script: \"Script example plugin\" (Despite the description seems to be a quite nice Arch logo theme)\n1. Solar: \"Space theme with violent flaring blue star\"\n1. Spinner: \"Simple theme with a loading spinner\"\n1. Spinfinity: \"Simple theme that shows a rotating infinity sign in the center of the screen\"\n1. Tribar: \"Text mode theme with tricolor progress bar\"\n1. Text: \"Text mode theme with tricolor progress bar\"\n1. Details: \"Verbose fallback theme\"\n\nArch sets the default theme to bgrt[1]. This can be confirmed by running:\n\n```\n$ plymouth-set-default-theme\n```\n\nThe theme can be changed by editing the configuration file:\n\n```\n/etc/plymouth/plymouthd.conf\n```\n\n```\n[Daemon]\nTheme=theme\n```\n\nor by running:\n\n```\n# plymouth-set-default-theme -R theme\n```\n\nEvery time a theme is changed, the initrd must be rebuilt. The -R option ensures that it is rebuilt (otherwise regenerate the initramfs manually).\n\n"
    },
    {
      "title": "Install new themes",
      "level": 3,
      "content": "You can install other themes from AUR. [2], alternatively plymouth-kcm provides integration into KDE Plasma's settings and offers themes not available on the AUR.\n\nAll currently installed themes can be listed by using this command:\n\n```\n$ plymouth-set-default-theme -l\n```\n\nor:\n\n```\n$ ls /usr/share/plymouth/themes\n```\n\n```\nbgrt  details  fade-in  glow  script  solar  spinfinity  spinner  text  tribar\n```\n\n"
    },
    {
      "title": "Show delay",
      "level": 3,
      "content": "Plymouth has a configuration option to delay the splash screen:\n\n```\n/etc/plymouth/plymouthd.conf\n```\n\n```\n[Daemon]\nShowDelay=5\n```\n\nOn systems that boot quickly, you may only see a flicker of your splash theme before your DM or login prompt is ready. You can set ShowDelay to an interval (in seconds) longer than your boot time to prevent this flicker and only show a blank screen. The default is 0 seconds, so you should not need to change this to a different value to see your splash earlier during boot.\n\n"
    },
    {
      "title": "HiDPI",
      "level": 3,
      "content": "Edit the configuration file:\n\n```\n/etc/plymouth/plymouthd.conf\n```\n\n```\n[Daemon]\nDeviceScale=an-integer-scaling-factor\n```\n\nand regenerate the initramfs.\n\n"
    },
    {
      "title": "Show boot messages",
      "level": 3,
      "content": "During boot you can switch to boot messages by pressing the Esc key.\n\n"
    },
    {
      "title": "Smooth transition",
      "level": 3,
      "content": "GDM supports smooth transition out of the box.\n\n"
    },
    {
      "title": "Preview themes",
      "level": 3,
      "content": "The currently configured theme can be previewed by running[3]:\n\n```\n# plymouthd; plymouth --show-splash; sleep 5; plymouth --quit\n```\n\nNote: **do not remove it** \n\n"
    },
    {
      "title": "Change background image",
      "level": 3,
      "content": "You can add a background image for two-step-based themes (such as spinner and bgrt). Just place your desired image into /usr/share/plymouth/themes/spinner/background-tile.png. Do not forget to regenerate the initrd once the theme changed.\n\n"
    },
    {
      "title": "Missing BGRT image",
      "level": 3,
      "content": "In case you are using the BGRT theme but the UEFI does not provide a vendor logo, you can place a fallback image into /usr/share/plymouth/themes/spinner/bgrt-fallback.png to show it instead.\n\nAlternatively, set the following to keep the firmware background:\n\n```\n/etc/plymouth/plymouthd.conf\n```\n\n```\nUseFirmwareBackground=true\n```\n\n"
    },
    {
      "title": "Slow down boot to show the full animation",
      "level": 3,
      "content": "On systems with a very fast boot time, it might be necessary to add a delay to plymouth-quit.service with a drop-in snippet containing ExecStartPre=/usr/bin/sleep 5 if showing the whole animation is desired. See this reddit post.\n\nAlternatively, it is possible to use a new systemd service starting at the same time as plymouth and waiting the whole duration needed for the animation. This method will ensure that inconsistencies in the boot time will not be perceived, as it is not time added after the animation but a delay running during the animation.\n\n```\n/etc/systemd/system/plymouth-wait-for-animation.service\n```\n\n```\n[Unit]\nDescription=Waits for Plymouth animation to finish\nBefore=plymouth-quit.service display-manager.service\n\n[Service]\nType=oneshot\nExecStart=/usr/bin/sleep duration_of_your_animation\n\n[Install]\nWantedBy=plymouth-start.service\n```\n\nThen enable the service.\n\n"
    },
    {
      "title": "Using SimpleDRM",
      "level": 3,
      "content": "On devices using UEFI, Plymouth is able to use the SimpleDRM driver to display the boot splash on the UEFI framebuffer. This allows the boot splash to appear on faster machines where loading the GPU driver takes too long (for example, systems with AMD GPUs), and also removes any flicker between the motherboard splash screen and Plymouth.\n\nTo enable SimpleDRM, append plymouth.use-simpledrm to your kernel parameters. See Plymouth issue 264 for more information about this option.\n\n"
    },
    {
      "title": "Disable with kernel parameters",
      "level": 3,
      "content": "If you experience problems during boot, you can temporary disable Plymouth with the following kernel parameters:\n\n```\nplymouth.enable=0 disablehooks=plymouth\n```\n\n"
    },
    {
      "title": "Debugging",
      "level": 3,
      "content": "To write debug output into /var/log/plymouth-debug.log, add the following kernel parameter:\n\n```\nplymouth.debug\n```\n\n"
    },
    {
      "title": "Password prompt does not update",
      "level": 3,
      "content": "When using systemd instead of udev hooks in Mkinitcpio, the password prompt may not update on themes that handle it via Plymouth scripting.\n\nYou can try switching to development version plymouth-gitAUR or using substitutes from Mkinitcpio#Common hooks.\n\n"
    },
    {
      "title": "Display is not centered",
      "level": 3,
      "content": "Certain themes may have trouble centering the display when there is more than one monitor enabled during boot.\n\nYou can use Kernel mode setting#Forcing modes to disable specific monitors.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Original specification\n- Related forum thread\n- Gentoo:Plymouth/Theme creation\n\n"
    }
  ]
}