{
  "title": "Plymouth (Português)",
  "url": "https://wiki.archlinux.org/title/Plymouth_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artigo ou esta seção precisa de tradução.** Este artigo ou esta seção precisa de tradução.\n\nEste artigo ou esta seção precisa de tradução.\n\nArtigos relacionados\n\n- Inicialização silenciosa\n\nPlymouth é um projeto da Fedora e agora listado entre os recursos oficiais do freedesktop.org que fornece um processo de inicialização gráfico sem cintilação. Baseia-se no modo de configuração do kernel (KMS) para definir uma resolução nativa da tela assim que possível, fornecendo então uma tela de boas vindas atrativa, até chegar no gerenciador de login.\n\n"
    },
    {
      "title": "Preparação",
      "level": 2,
      "content": "Plymouth usa principalmente KMS (Kernel Mode Setting) para exibir imagens. Em sistemas EFI/UEFI, plymouth pode utilizar o framebuffer EFI. Se você não puder usar KMS (p.ex., porque está usando um driver proprietário) ou se você não quiser usar um framebuffer EFI, considere usar Uvesafb, pois ele funciona com resoluções widescreen.\n\nCaso não tenha KMS nem framebuffer, plymouth entrará recorrerá ao modo de texto.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Plymouth está disponível através do AUR: o pacote estável é plymouth e a versão de desenvolvimento é plymouth-gitAUR.\n\nSe também usa o GDM, você deve também instalar o gdm-plymouthAUR[link quebrado: package not found], que compila gdm juntamente com o suporte a plymouth.\n\n"
    },
    {
      "title": "O hook do plymouth",
      "level": 3,
      "content": "Adicione plymouth ao vetor HOOKS em mkinitcpio.conf. Tem que ser adicionado após base e udev para funcionar:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=(base udev plymouth [...])\n```\n\nNote: **deve** \n\n- Se usa criptografia no disco rígido com o hook encrypt, você deve substituir o hook encrypt com plymouth-encrypt e adicioná-lo após o hook plymouth para conseguir inserir senhas quando solicitado pelo TTY.\n- O uso dos parâmetros PARTUUID ou PARTLABEL em cryptdevice= não funciona com o hook plymouth-encrypt.\n- Para uma raiz ZFS criptografada[link quebrado: seção inválida], você deve instalar plymouth-zfsAUR e substituir o hook zfs com plymouth-zfs\n\nApós adicionar o hook plymouth-encrypt, se a entrada for para plano de fundo em modo de texto em vez de ir para a solicitação de senha, é necessário adicionar o driver gráfico (kernel) ao seu initramfs. Por exemplo, se estiver usando intel:\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nMODULES=(i915 [...])\n```\n\n"
    },
    {
      "title": "Hook alternativo Plymouth (systemd)",
      "level": 3,
      "content": "Se o seu mkinitcpio.conf inclui o hook systemd, então substitua plymouth por sd-plymouth. Além disso, se utilizar criptografia nos discos rígidos, utilize sd-encrypt em vez de encrypt ou de plymouth-encrypt\n\n```\n/etc/mkinitcpio.conf\n```\n\n```\nHOOKS=(base systemd sd-plymouth [...] sd-encrypt [...])\n```\n\nNeste caso poderá ser necessário utilizar plymouth-gitAUR em vez de plymouth.\n\n"
    },
    {
      "title": "Linha de comando do kernel",
      "level": 3,
      "content": "Neste momento precisa de adicionar os parâmetros do kernel quiet splash loglevel=3 rd.udev.log_priority=3 vt.global_cursor_default=0. Veja Inicialização silenciosa para outros parâmetros para limitar a saída para o console.\n\nRecompile a sua imagem initrd (veja o artigo mkinitcpio para mais detalhes), por exemplo:\n\n```\n# mkinitcpio -p linux\n```\n\n"
    },
    {
      "title": "Transição suave",
      "level": 3,
      "content": "Para ativar a \"transição suave\" (em inglês, smooth transition), se houver suporte a ela, basta:\n\n1. Desabilitar seu gerenciador de exibição (p.ex., gdm.service)\n1. Habilitar a respectiva unit de plymouth-DM (units GDM, LXDM, SLiM, LightDM, SDDM incluídos) (p.ex., gdm-plymouth.service)\n\n"
    },
    {
      "title": "Atraso na apresentação",
      "level": 3,
      "content": "Plymouth tem uma opção de configuração para atrasar a tela de apresentação:\n\n```\n/etc/plymouth/plymouthd.conf\n```\n\n```\n[Daemon]\nTheme=spinner\nShowDelay=5\n```\n\nEm sistemas que iniciem muito rápido, pode apenas ser possível ver uma tremulação de seu tema de apresentação antes do seu gerenciador de exibição ou seu prompt de login estar pronto. Pode-se definir ShowDelay para um intervalo (em segundos) maior que seu tempo de inicialização para evitar essa tremulação e apresentar uma tela branca. Por padrão é 5 segundos, mas pode definir para um valor mais baixo para poder ver a sua tela de apresentação durante a inicialização.\n\n"
    },
    {
      "title": "Mudar o tema",
      "level": 3,
      "content": "Plymouth vem com uma vasta seleção de temas:\n\n1. Fade-in: \"Tema simples com uma transição gradual com estrelas brilhantes\"\n1. Glow: \"Tema corporativo com um gráfico que apresenta o progresso da inicialização, seguido de um brilhante logo\"\n1. Script: \"Plugin com um script de exemplo\" (Apesar da descrição, parece ser um bom tema com o logo do Arch)\n1. Solar: \"Tema do espaço com uma estrela azul rodeada de efeitos\"\n1. Spinner: \"Temas simples com uma roda de progresso\"\n1. Spinfinity: \"Tema simples que apresenta um símbolo rodando infinitamente no centro da tela\"\n1. (Text: \"Tema com uma barra tricolor apresentando o progresso através de texto\")\n1. (Details: \"Tema em modo texto reserva\")\n\nA versão de desenvolvimento do Plymouth (plymouth-gitAUR) também vem com o tema BGRT, que é uma variação do Spinner que mantém o logo OEM se disponível.\n\nAdicionalmente, pode-se instalar outros temas do AUR, bastando olhar no vetor \"Necessário para\" em plymouth\n\nTodos os temas atualmente instalados podem ser vistos através do comando:\n\n```\n$ plymouth-set-default-theme -l\n```\n\nou:\n\n```\n$ ls /usr/share/plymouth/themes\n```\n\n```\ndetails  glow    solar       spinner  tribar\nfade-in  script  spinfinity  text\n```\n\nPor padrão, o tema spinner está selecionado. Este tema pode ser mudado editando /etc/plymouth/plymouthd.conf, por exemplo:\n\n```\n/etc/plymouth/plymouthd.conf\n```\n\n```\n[Daemon]\nTheme=spinner\nShowDelay=5\n```\n\nOs temas podem ser pré-visualizados sem recompilação, pressione Ctrl+Alt+F2 para alterar para o console, faça login como root e escreva:\n\n```\n# plymouthd\n# plymouth --show-splash\n```\n\nPara sair da tela de pré-visualização, pressione Ctrl+Alt+F2 e digite:\n\n```\n# plymouth --quit\n```\n\nCada vez que um tema é alterado, a imagem do kernel terá de ser recompilada:\n\n```\n# plymouth-set-default-theme -R <tema>\n```\n\nReinicie para aplicar as alterações.\n\n"
    },
    {
      "title": "Mostrar mensagens do kernel",
      "level": 3,
      "content": "Durante a inicialização, é possível alterar para as mensagens do kernel pressionando a tecla \"Home\" (ou \"Escape\").\n\n"
    },
    {
      "title": "Adicionar o Arch Logo para temas BGRT e spinner",
      "level": 3,
      "content": "Para adicionar o Arch Logo aos temas spinner e BGRT copie o logo Arch o diretório de tema do spinner com nome watermark.png:\n\n```\n# cp /usr/share/plymouth/arch-logo.png /usr/share/plymouth/themes/spinner/watermark.png\n```\n\n"
    },
    {
      "title": "Substituir o logo Arch e criar temas próprios",
      "level": 3,
      "content": "Os seguintes temas usam o logo Arch Linux fornecido por Plymouth em /usr/share/plymouth/arch-logo.png: fade-in, script, solar, spinfinity. Se quiser usar outro logo, pode usar um deles ou um dos outros temas em AUR, editar o arquivo *.plymouth (talvez *.script, também) e substituir esta imagem com uma da sua escolha. Deverá criar um pacote do seu tema criado, porque alterações em /usr/share/plymouth poderão não ser persistentes através de atualizações de pacotes.\n\nDepois de instalado e selecionado o seu tema, deverá faze rebuild à imagem initrd e usar o novo splash.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Especificação original\n- Tópico relacionado mp fórum\n\n"
    }
  ]
}