{
  "title": "Podman (Português)",
  "url": "https://wiki.archlinux.org/title/Podman_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- systemd-nspawn\n- Linux Containers\n- Docker\n- Buildah\n- Vagrant\n\nPodman é uma alternativa ao Docker, fornecendo uma interface similar.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote podman. Além disso, se você deseja criar imagens de contêiner, consulte Buildah.\n\nAo contrário do Docker, o Podman não requer um daemon, mas existe um que fornece uma API para serviços como o cockpit via cockpit-podman.\n\nPor padrão, só é possível executar contêineres do Podman como root. Consulte Podman sem root para configurar contêineres em execução sem ser o usuário root.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Arquivos de configuração para configurar como os contêineres se comportam estão localizados em /etc/containers. Para configurar a interface da ponte de rede usada pelo Podman, consulte /etc/cni/net.d/87-podman-bridge.conflist\n\n"
    },
    {
      "title": "Podman sem root",
      "level": 3,
      "content": "Por padrão somente root pode rodar contêineres (ou namespaces no kernelspeak).\n\nPara permitir operações sem root de contêineres Podman, primeiro determine que usuário(s) e grupo(s) você quer usar para os contêineres, e adicione as entradas correspondentes para /etc/subuid e /etc/subgid respectivamente.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nO seguinte exemplo habilita o usuário e grupo podman a rodar contêineres Podman (ou outros tipos de contêineres nesse caso). Alocando os UIDs e GIDs do 165536 a 169631 para o usuário e grupo podman respectivamente. Para isso, você pode editar os arquivos diretamente ou usar usermod(8). Veja subuid(5) e subgid(5) para mais informação.\n\n```\n# usermod --add-subuids 165536-231072 --add-subgids 165536-231072 username\n```\n\n```\n/etc/subuid\n```\n\n```\nusername:165536:65536\n```\n\n```\n/etc/subgid\n```\n\n```\nusername:165536:65536\n```\n\nPodman sem root usa processo de pausa para manter namespaces do usuário rodando. Isto previne qualquer mudança aos arquivos /etc/subuid e /etc/subgid de serem propagados para os contêineres sem root enquanto o processo de pausa está rodando. Para estas mudanças serem propagadas é necessário executar:\n\n```\n$ podman system migrate\n```\n\nDepois disso, o usuário/grupo podman pode iniciar e executar contêineres podman.\n\n"
    },
    {
      "title": "Arch Linux",
      "level": 3,
      "content": "O comando a seguir obtém a imagem x86_64 do Arch Linux do Docker Hub. Esta é uma versão simplificada do núcleo do Arch sem rede, etc.\n\n```\n# podman pull docker.io/archlinux\n```\n\nVeja também README.md.\n\nPara uma base completa do Arch, clone o repositório do link abaixo e compile sua própria imagem.\n\n```\n$ git clone https://gitlab.archlinux.org/archlinux/archlinux-docker.git\n```\n\nCertifique-se que o pacote devtools esteja instalado.\n\nEdite o arquivo packages de forma que ele contenha 'base'. Então, execute:\n\n```\n# make rootfs\n# podman build -t archlinux .\n```\n\n"
    },
    {
      "title": "Alpine Linux",
      "level": 3,
      "content": "Alpine Linux é uma escolha popular para imagens de contêineres pequenos, especialmente para software compilado como binários estáticos. O comando a seguir obtém a imagem mais recente do Alpine Linux em Docker Hub:\n\n```\n# podman pull docker.io/alpine\n```\n\nO Alpine Linux usa a implementação libc musl libc em vez da implementação libc glibc usada pela maioria das distribuições Linux. Como o Arch Linux usa glibc, existem várias diferenças funcionais entre um host do Arch Linux e um contêiner Alpine Linux que podem afetar o desempenho e a correção do software. Uma lista dessas diferenças está documentada aqui.\n\nObserve que o software vinculado dinamicamente e compilado no Arch Linux (ou em qualquer outro sistema que use glibc) pode ter bugs e problemas de desempenho quando executado no Alpine Linux (ou em qualquer outro sistema usando uma libc diferente). Consulte [1], [2] e [3] para exemplos.\n\n"
    },
    {
      "title": "CentOS",
      "level": 3,
      "content": "O comando a seguir baixa a imagem mais recente do CentOs do Docker Hub:\n\n```\n# podman pull docker.io/centos\n```\n\nConsulte a página do Docker Hub para obter uma lista completa das tags disponíveis para cada versão do CentOS.\n\n"
    },
    {
      "title": "Debian",
      "level": 3,
      "content": "O comando a seguir baixa a imagem mais recente do Debian do Docker Hub:\n\n```\n# podman pull docker.io/debian\n```\n\nConsulte a página do Docker Hub para obter uma lista completa das tags disponíveis, incluindo ambas versões padrão e slim para cada lançamento do Debian.\n\n"
    },
    {
      "title": "Contêineres são terminados no logout do shell",
      "level": 3,
      "content": "Pode acontecer de quando você deslogar da máquina contêineres do Podman serem parados. Para prevenir isso, a persistência de processos do usuário deve ser habilitada para os contêineres executados por ele:\n\n```\n$ loginctl enable-linger\n```\n\nVocê pode também criar units de usuário do systemd como descrito: https://docs.podman.io/en/latest/markdown/podman-auto-update.1.html#examples\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Site oficial\n\n"
    }
  ]
}