{
  "title": "Polkit (Français)",
  "url": "https://wiki.archlinux.org/title/Polkit_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- General troubleshooting (Français)#Permissions de session\n- Sudo (Français)\n- Users and groups (Français)\n\nTraduit de la page d'accueil de polkit :\n\nPolkit est utilisé pour contrôler les privilèges à l'échelle du système. Il fournit un moyen organisé pour les processus non privilégiés de communiquer avec les processus privilégiés. Contrairement à des systèmes tels que sudo, il n'accorde pas l'autorisation root à un processus entier, mais permet plutôt un niveau de contrôle plus fin de la politique système centralisée.\n\nPolkit fonctionne en délimitant des actions distinctes, par exemple l'exécution de GParted, et en délimitant les utilisateurs par groupe ou par nom, par exemple les membres du groupe wheel. Il définit ensuite comment - le cas échéant - ces utilisateurs sont autorisés à effectuer ces actions, par exemple en s'identifiant comme membres du groupe en tapant leur mot de passe.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet polkit.\n\n"
    },
    {
      "title": "Agents d'authentification",
      "level": 3,
      "content": "Un agent d'authentification est utilisé pour que l'utilisateur d'une session prouve qu'il est bien l'utilisateur (en s'authentifiant en tant qu'utilisateur) ou un utilisateur administratif (en s'authentifiant en tant qu'administrateur). Le paquet polkit contient un agent d'authentification textuel appelé 'pkttyagent', qui est utilisé comme solution de repli générale.\n\nSi vous utilisez un environnement graphique, assurez-vous qu'un agent d'authentification graphique est installé et démarré automatiquement à la connexion.\n\nCinnamon, Deepin, GNOME, GNOME Flashback, KDE, LXDE, LXQt, MATE, theShell et Xfce ont déjà un agent d'authentification. Dans les autres environnements de bureau, vous devez choisir l'une des implémentations suivantes :\n\n- lxqt-policykit, qui fournit /usr/bin/lxqt-policykit-agent}.\n- lxsession ou lxsession-gtk3, qui fournit /usr/bin/lxpolkit.\n- mate-polkit, qui fournit /usr/lib/mate-polkit/polkit-mate-authentication-agent-1\n- polkit-efl-gitAUR[broken link: package not found], qui fournit /usr/bin/polkit-efl-authentification-agent-1.\n- polkit-gnome, qui fournit /usr/lib/polkit-gnome/polkit-gnome-authentication-agent-1\n- polkit-kde-agent, qui fournit /usr/lib/polkit-kde-authentification-agent-1.\n- ts-polkitagentAUR, qui fournit /usr/lib/ts-polkitagent.\n- xfce-polkitAUR ou xfce-polkit-gitAUR, qui fournit /usr/lib/xfce-polkit/xfce-polkit.\n- polkit-dumb-agent-gitAUR[broken link: package not found], agent indépendant de bureau minimaliste qui fournit /usr/bin/polkit-dumb-agent.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Les définitions de Polkit peuvent être divisées en deux sortes :\n\n- Les Actions sont définies dans des fichiers XML .policy situés dans /usr/share/polkit-1/actions. Chaque action est associée à un ensemble de permissions par défaut (par exemple, vous devez vous identifier en tant qu'administrateur pour utiliser l'action GParted). Les valeurs par défaut peuvent être remplacées mais éditer les fichiers d'actions n'est PAS la bonne méthode.\n- Les règles d'autorisation sont définies dans les fichiers .rules JavaScript. On les trouve à deux endroits : /usr/share/polkit-1/rules.d pour les paquets tiers peuvent utiliser (bien que peu, voire aucun, ne le fasse) /etc/polkit-1/rules.d pour la configuration locale.\n\n- /usr/share/polkit-1/rules.d pour les paquets tiers peuvent utiliser (bien que peu, voire aucun, ne le fasse)\n- /etc/polkit-1/rules.d pour la configuration locale.\n\nPolkit fonctionne au-dessus des systèmes de permissions existants dans Linux - appartenance à un groupe, statut d'administrateur - il ne les remplace pas. Les fichiers .rules désignent un sous-ensemble d'utilisateurs, font référence à une (ou plusieurs) des actions spécifiées dans les fichiers actions, et déterminent avec quelles restrictions ces actions peuvent être effectuées par ces utilisateurs. Par exemple, un fichier de règles peut annuler l'obligation par défaut pour tous les utilisateurs de s'authentifier en tant qu'administrateur lorsqu'ils utilisent GParted, en déterminant qu'un utilisateur spécifique n'a pas besoin de le faire. Un autre exemple : Un certain utilisateur n'est pas du tout autorisé à utiliser GParted.\n\n"
    },
    {
      "title": "Actions",
      "level": 3,
      "content": "Les actions disponibles via polkit dépendent des paquets que vous avez installés. Certaines sont utilisées dans plusieurs environnements de bureau (org.freedesktop.*), certaines sont spécifiques à un DE (org.gnome.*) et d'autres sont spécifiques à un seul programme (org.gnome.gparted.policy). La commande pkaction liste toutes les actions définies dans /usr/share/polkit-1/actions} pour une référence rapide.\n\nPour avoir une idée de ce que polkit peut faire, voici quelques groupes d'actions couramment utilisés :\n\n- Les actions de systemd-logind (org.freedesktop.login1.policy) régies par polkit comprennent la mise hors tension, le redémarrage, la suspension et l'hibernation du système, y compris lorsque d'autres utilisateurs peuvent encore être connectés.\n- Les actions de udisks (org.freedesktop.udisks2.policy) régies par polkit comprennent le montage de systèmes de fichiers et le déverrouillage de périphériques chiffrés.\n- Les actions de NetworkManager (org.freedesktop.NetworkManager.policy) régies par polkit incluent l'activation et la désactivation du réseau, du wifi ou du haut débit mobile.\n\nChaque action est définie dans une balise <action> dans un fichier .policy. Le fichier org.gnome.gparted.policy contient une seule action et ressemble à ceci :\n\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE policyconfig PUBLIC\n \"-//freedesktop//DTD PolicyKit Policy Configuration 1.0//FR\"\n \"http://www.freedesktop.org/software/polkit/policyconfig-1.dtd\">\n<policyconfig>\n\n  <action id=\"org.gnome.gparted\">\n    <message>Une authentification est nécessaire pour exécuter l'éditeur de partition GParted</message>.\n    <icon_name>gparted</icon_name>\n    <defaults>\n      <allow_any>auth_admin</allow_any>\n      <allow_inactive>auth_admin</allow_inactive>\n      <allow_active>auth_admin</allow_active>\n    </defaults>\n    <annotate key=\"org.freedesktop.policykit.exec.path\">/usr/bin/gparted</annotate>\n    <annotate key=\"org.freedesktop.policykit.exec.allow_gui\">true</annotate>\n  </action>\n\n</policyconfig>\n```\n\nL'attribut id est la commande réelle envoyée à D-Bus, la balise message est l'explication à l'utilisateur lorsque l'authentification est requise et le icon_name est en quelque sorte évident.\n\nLa balise defaults est l'endroit où se trouvent les permissions ou leur absence. Elle contient trois paramètres : allow_any, allow_inactive, et allow_active. Les sessions inactives sont généralement des sessions à distance (SSH, VNC, etc.) alors que les sessions actives sont connectées directement à la machine sur un TTY ou un écran X. allow_any est le paramètre qui englobe les deux scénarios.\n\nPour chacun de ces paramètres, les options suivantes sont disponibles :\n\n- no : L'utilisateur n'est pas autorisé à effectuer l'action. Il n'y a donc pas besoin d'authentification.\n- oui : L'utilisateur est autorisé à effectuer l'action sans aucune authentification.\n- auth_self : L'authentification est nécessaire mais l'utilisateur ne doit pas nécessairement être un utilisateur administratif.\n- auth_admin : L'authentification en tant qu'utilisateur administratif est requise.\n- auth_self_keep : Identique à auth_self mais, comme sudo, l'autorisation dure quelques minutes.\n- auth_admin_keep : Identique à auth_admin mais, comme sudo, l'autorisation dure quelques minutes.\n\nCe sont les paramètres par défaut et, à moins qu'ils ne soient remplacés dans une configuration ultérieure, ils seront valables pour tous les utilisateurs.\n\nComme on peut le consulter dans l'action GParted, les utilisateurs doivent s'authentifier en tant qu'administrateurs pour pouvoir utiliser GParted, que la session soit active ou inactive.\n\n"
    },
    {
      "title": "Règles d'autorisation",
      "level": 3,
      "content": "Les règles d'autorisation qui supplantent les paramètres par défaut sont disposées dans un ensemble de répertoires comme décrit ci-dessus. Pour tout ce qui concerne la configuration personnelle d'un seul système, seul /etc/polkit-1/rules.d doit être utilisé.\n\nLa méthode addRule() est utilisée pour ajouter une fonction qui peut être appelée chaque fois qu'un contrôle d'autorisation pour l'action et le sujet est effectué. Les fonctions sont appelées dans l'ordre où elles ont été ajoutées jusqu'à ce qu'une des fonctions renvoie une valeur. Ainsi, pour ajouter une règle d'autorisation qui est traitée avant les autres règles, mettez-la dans un fichier dans /etc/polkit-1/rules.d avec un nom qui trie avant les autres fichiers de règles, par exemple 00-early-checks.rules.\n\nLa disposition des fichiers .rules est assez explicite :\n\n```\n/* Autoriser les utilisateurs du groupe admin à exécuter GParted sans authentification */\npolkit.addRule(function(action, subject) {\n    si (action.id == \"org.gnome.gparted\" &&\n        subject.isInGroup(\"admin\")) {\n        return polkit.Result.YES ;\n    }\n}) ;\n```\n\nDans la fonction, nous vérifions l'ID de l'action spécifiée (org.gnome.gparted) et le groupe de l'utilisateur (admin), puis nous retournons la valeur \"yes\".\n\n"
    },
    {
      "title": "Identités d'administrateur",
      "level": 3,
      "content": "La méthode addAdminRule() est utilisée pour ajouter une fonction qui peut être appelée lorsque l'authentification de l'administrateur est requise. La fonction est utilisée pour spécifier quelles identités peuvent être utilisées pour l'authentification de l'administrateur pour le contrôle des autorisations identifié par l'action et le sujet. Les fonctions ajoutées sont appelées dans l'ordre où elles ont été ajoutées jusqu'à ce que l'une des fonctions renvoie une valeur.\n\nLa configuration par défaut des identités de l'administrateur est contenue dans le fichier 50-default.rules. Toute modification de cette configuration doit être effectuée en copiant le fichier dans, par exemple, 40-default.rules et en modifiant ce fichier.\n\n```\n/etc/polkit-1/rules.d/50-default.rules\n```\n\n```\npolkit.addAdminRule(function(action, subject) {\n    return [\"unix-group:wheel\"] ;\n});\n```\n\nLa seule partie à modifier (une fois copiée) est le tableau de retour de la fonction : en tant que qui un utilisateur doit-il s'authentifier lorsqu'on lui demande de s'authentifier en tant qu'utilisateur administratif ? S'il est membre du groupe désigné comme admins, il doit seulement entrer son propre mot de passe. Si un autre utilisateur, par exemple root, est la seule identité d'administrateur, il devra saisir le mot de passe de root. Le format de l'identification de l'utilisateur est le même que celui utilisé pour désigner les autorités.\n\nLa valeur par défaut de l'Arch est de faire de tous les membres du groupe wheel des administrateurs. Une règle comme celle ci-dessous fera que polkit demandera le mot de passe root au lieu du mot de passe de l'utilisateur pour l'authentification de l'administrateur.\n\n```\n/etc/polkit-1/rules.d/49-rootpw_global.rules\n```\n\n```\n].\n/* Toujours authentifier les administrateurs en demandant le mot de passe root\n * Mot de passe root, similaire à l'option rootpw de sudo.\n */\npolkit.addAdminRule(function(action, subject) {\n    return [\"unix-user:root\"] ;\n}) ;\n```\n\n"
    },
    {
      "title": "Débogage/journalisation",
      "level": 3,
      "content": "La règle suivante enregistre des informations détaillées sur tout accès demandé.\n\n```\n/etc/polkit-1/rules.d/00-log-access.rules\n```\n\n```\npolkit.addRule(function(action, subject) {\n    polkit.log(\"action=\" + action) ;\n    polkit.log(\"subject=\" + subject) ;\n});\n```\n\n"
    },
    {
      "title": "Désactiver la suspension et la mise en veille prolongée",
      "level": 3,
      "content": "La règle suivante désactive la suspension et la mise en veille prolongée pour tous les utilisateurs.\n\n```\n/etc/polkit-1/rules.d/10-disable-suspend.rules\n```\n\n```\npolkit.addRule(function(action, subject) {\n    si (action.id == \"org.freedesktop.login1.suspend\" ||\n        action.id == \"org.freedesktop.login1.suspend-multiple-sessions\" ||\n        action.id == \"org.freedesktop.login1.hibernate\" ||\n        action.id == \"org.freedesktop.login1.hibernate-multiple-sessions\")\n    {\n        return polkit.Result.NO ;\n    }\n});\n```\n\n"
    },
    {
      "title": "Contournement de l'invite de mot de passe",
      "level": 3,
      "content": "Pour obtenir quelque chose de similaire à l'option sudo NOPASSWD et obtenir une autorisation uniquement basée sur l'identité user/group, vous pouvez créer des règles personnalisées dans /etc/polkit-1/rules.d/. Cela vous permet de remplacer l'authentification par mot de passe soit pour des actions spécifiques, soit globalement. Consultez [1] pour un exemple de règle.\n\n"
    },
    {
      "title": "Globalement",
      "level": 4,
      "content": "Créez le fichier suivant en tant que root :\n\n```\n/etc/polkit-1/rules.d/49-nopasswd_global.rules\n```\n\n```\n].\n/* Autoriser les membres du groupe wheel à exécuter toute action\n * sans authentification par mot de passe, similaire à \"sudo NOPASSWD :\"\n */\npolkit.addRule(function(action, subject) {\n    if (subject.isInGroup(\"wheel\")) {\n        return polkit.Result.YES ;\n    }\n}) ;\n```\n\nRemplacez wheel par tout groupe de votre choix.\n\nIl en résultera une authentification automatique pour 'toute action nécessitant des droits d'administrateur via Polkit. Il faut donc faire attention au groupe auquel vous choisissez de donner ces droits.\n\nIl existe également AUTH_ADMIN_KEEP qui permet de conserver l'autorisation pendant 5 minutes. Cependant, l'autorisation est par processus, donc si un nouveau processus demande une autorisation dans les 5 minutes, le nouveau processus demandera à nouveau le mot de passe de toute façon.\n\n"
    },
    {
      "title": "Pour des actions spécifiques",
      "level": 4,
      "content": "Créez le fichier suivant en tant que root :\n\n```\n/etc/polkit-1/rules.d/49-nopasswd_limited.rules\n```\n\n```\n/* Permet aux membres du groupe wheel d'exécuter les actions définies \n * sans authentification par mot de passe, similaire à \"sudo NOPASSWD :\"\n */\npolkit.addRule(function(action, subject) {\n    si ((action.id == \"org.gnome.gparted\" ||\n\t action.id == \"org.libvirt.unix.manage\") &&\n        subject.isInGroup(\"wheel\"))\n    {\n        return polkit.Result.YES ;\n    }\n}) ;\n```\n\nLes action.id sélectionnés ici ne sont que des exemples (de travail) pour GParted et Libvirt, mais vous pouvez les remplacer par n'importe quels autres de votre choix tant qu'ils existent (personnalisés ou fournis par un paquet), et vous pouvez également définir n'importe quel groupe à la place de wheel.\n\nL'opérateur || est utilisé pour délimiter les actions (OU logique), et && signifie ET logique et doit être conservé comme dernier opérateur.\n\n"
    },
    {
      "title": "Udisks",
      "level": 4,
      "content": "Les gestionnaires de fichiers peuvent demander un mot de passe lorsqu'ils essaient de monter un périphérique de stockage, ou produire une erreur de type Non autorisé ou similaire. Consultez Udisks#Configuration pour plus de détails.\n\n"
    },
    {
      "title": "Autoriser la gestion d'unités systemd individuelles par des utilisateurs réguliers",
      "level": 3,
      "content": "En vérifiant certaines valeurs passées à la vérification de la politique de polkit, vous pouvez donner à des utilisateurs ou groupes spécifiques la possibilité de gérer des unités spécifiques. Par exemple, vous pourriez vouloir que les utilisateurs réguliers puissent démarrer et arrêter wpa_supplicant :\n\n```\n/etc/polkit-1/rules.d/10-wifimanagement.rules\n```\n\n```\npolkit.addRule(function(action, subject) {\n    if (action.id == \"org.freedesktop.systemd1.manage-units\") {\n        if (action.lookup(\"unit\") == \"wpa_supplicant.service\") {\n            var verb = action.lookup(\"verb\");\n            if (verb == \"start\" || verb == \"stop\" || verb == \"restart\") {\n                return polkit.Result.YES;\n            }\n        }\n    }\n});\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Manuel de Polkit\n- Autorisation avec PolKit[dead link 2023-06-17 ⓘ] (guide de sécurité d'openSUSE Leap)\n\n"
    }
  ]
}