{
  "title": "Power management (Português)",
  "url": "https://wiki.archlinux.org/title/Power_management_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Gestão de energia/Suspensão e hibernação\n- Power management/Wakeup triggers\n- Escala de frequência do CPU\n- Display Power Management Signaling\n- Hybrid graphics\n- sysctl\n\nGestão de energia, ou gerenciamento de energia, é um recurso que desliga ou troca o comportamento dos componentes do sistema para um estado de economia de energia quando inativo.\n\nEm Arch Linux, a gestão de energia consiste em duas partes principais:\n\n1. Configuração do kernel Linux, o mesmo interage com o hardware por meio de: Parâmetros de kernel Módulos de kernel Regras udev\n1. Configuração de ferramentas do espaço de usuário (userspace), que interage com o kernel e reage aos respectivos eventos. Muitas destas ferramentas permitem a modificação da configuração de kernel em um ambiente amigável, ou também chamado de user-friendly, para facilitar o gerenciamento por um usuário padrão. Veja as opções logo abaixo.\n\n- Parâmetros de kernel\n- Módulos de kernel\n- Regras udev\n\n"
    },
    {
      "title": "Ferramentas do espaço de usuário (userspace)",
      "level": 2,
      "content": "Estas ferramentas permitem alterar muitas definições sem a necessidade de editar arquivos de configuração manualmente. Apenas escolha uma delas para evitar possíveis conflitos, pois todas funcionam de maneira similar. Visite as categorias listadas em inglês e dê uma olhada de forma geral nas opções de gestão de energia que existem em Arch Linux.\n\nA seguir estão listados os scripts desenvolvidos e as ferramentas projetadas mais populares para ajudar na gestão de energia:\n\n"
    },
    {
      "title": "Console",
      "level": 3,
      "content": "- acpid — Um daemon que entrega gerenciamento energético em eventos ACPI com suporte a netlink.\n\n- Laptop Mode Tools — Utilitário para definir a economia de energia em notebooks/laptops. Considerado por muitos a mais efetiva para gestão de energia, apesar de requerer um pouco de configuração.\n\n- libsmbios — Conjunto de bibliotecas e ferramentas para interagir com tabelas Dell SMBIOS.\n\n- powertop — Uma ferramenta para diagnosticar problemas com o consumo e gestão de energia e ajudar a configurar a economia de energia.\n\n- powerstat — Uma ferramenta que mede o consumo de energia ao usar ACPI ou a interface RAPL da Intel.\n\n- systemd — Um gerenciador de sistema e de serviço.\n\n- TLP — Gestão de energia avançada para sistemas Linux.\n\n- TuneD — Um daemon que monitora e cria configurações de adaptação para dispositivos no sistema.\n\n- UPower — Uma abstração para contagem de dispositivos de energia, escuta de eventos dos mesmos e consulta de histórico e estatísticas.\n\n- power-profiles-daemon — Faz com que o manuseio dos perfis de energia esteja disponível pelo D-Bus\n\n"
    },
    {
      "title": "Gráfico",
      "level": 3,
      "content": "- batsignal — Monitoramento de bateria leve que usa libnotify para alertar os níveis baixos de bateria.\n\n- cbatticon — Ícone rápido e leve que permanece na bandeja do sistema.\n\n- GNOME Power Statistics — Exibe para o GNOME informações e estatísticas do uso de energia do sistema.\n\n- KDE Power Devil — Módulo de gestão de energia para o Plasma.\n\n- LXQt Power Management — Módulo de gestão de energia para o LXQt.\n\n- MATE Power Management — Módulo de gestão de energia para o MATE.\n\n- MATE Power Statistics — Exibe para o MATE informações e estatísticas do uso de energia do sistema.\n\n- poweralertd — Daemon de entrega de notificações do UPower.\n\n- powerkit — Gestor de energia desktop independente.\n\n- Xfce Power Manager — Gestor de energia para o Xfce.\n\n- vattery — Aplicativo de monitoramento da bateria escrito em Vala que exibe status de bateria em notebooks/laptops na bandeja do sistema.\n\n"
    },
    {
      "title": "Eventos ACPI",
      "level": 2,
      "content": "O systemd gerencia alguns eventos ACPI relacionados à energia, tais ações de eventos podem ser configuradas em /etc/systemd/logind.conf ou /etc/systemd/logind.conf.d/*.conf — veja em logind.conf(5). Normalmente o daemon acpid é usado somente com o propósito de reagir aos eventos ACPI, e em função disso, em sistemas sem gestor de energia dedicado é comum que o systemd faça a substituição do acpid.\n\nA ação especificada para cada evento pode ser uma das seguintes opções: ignore, poweroff, reboot, halt, suspend, hibernate, hybrid-sleep, suspend-then-hibernate, lock ou kexec; respectivamente as opções significam \"ignorar\", \"desligar\", \"reiniciar\", \"interromper/descontinuar\", \"suspender\", \"hibernar\", \"suspensão híbrida\" \"suspender então hibernar\", \"bloquear\" e \"kexec\". Em caso de hibernação e suspensão garanta que as configurações sejam apropriadamente definidas, se caso não configurado o systemd usará as ações de evento padronizadas.\n\nTable content:\nManipulador de evento | Descrição de como acionar o evento | Ação padrão\nHandlePowerKey | Tecla/botão de energia (power on/off) é pressionado. | poweroff\nHandleSuspendKey | Tecla/botão de suspensão é pressionado. | suspend\nHandleHibernateKey | Tecla/botão de hibernação é pressionado. | hibernate\nHandleLidSwitch | A tampa é fechada, exceto nos casos abaixo. | suspend\nHandleLidSwitchDocked | A tampa é fechada enquanto o sistema está inserido em um dock station (régua de recarga), ou quando mais de um display está conectado. | ignore\nHandleLidSwitchExternalPower | A tampa é fechada enquanto o sistema está conectado a uma fonte externa de energia. | A ação é definida por: HandleLidSwitch\n\nPara aplicar qualquer mudança, recarregue systemd-logind.\n\n- Systemd não pode modificar eventos ACPI de carregamento e bateria, portanto se você usa Laptop Mode Tools ou outras ferramentas similares o acpid ainda é requisito.\n- Ao realizar a abertura/fechamento da tampa sucessivamente em um curto período de tempo, logind irá aumentar o tempo de espera para suspender em até 90 segundos, com o intuito de detectar possíveis docks. [1] Este tempo é agora configurável desde a versão 220 do systemd. [2] Você pode usar por exemplo a opção HoldoffTimeoutSec=30s em logind.conf ou no respectivo arquivo drop-in para alterar o tempo de espera.\n\n"
    },
    {
      "title": "Gestores de energia",
      "level": 3,
      "content": "Alguns ambientes de desktop incluem gestores de energia que inibem (temporariamente desligam) algumas ou todas as configurações ACPI do systemd. Se tais gestores de energia estão ativos, então as ações dos eventos ACPI podem ser configuradas nestes gestores de energia por si só. Modificações em /etc/systemd/logind.conf ou /etc/systemd/logind.conf.d/*.conf precisam ser feitas somente se o comportamento desejado para um evento em particular não estiver restrito pelo gerenciador de energia.\n\nNote que se o gestor de energia não inibe apropriadamente os eventos do systemd, você pode acabar em uma situação complicada, cujo systemd suspende o sistema e quando acordado o outro gerenciador de energia o suspende de volta. Os gestores de energia de GNOME, MATE, Plasma e Xfce proporcionam os comandos necessários já inibidos. Se os comandos inibidos não estão funcionando, como por exemplo sob uso do acpid ou outros manipuladores de eventos ACPI, defina a opção Handle para ignore no systemd. Veja também sobre em systemd-inhibit(1).\n\n"
    },
    {
      "title": "xss-lock",
      "level": 3,
      "content": "xss-lock subscreve em systemd-events as opções suspend, hibernate, lock-session e unlock-session; respectivamente os termos significam \"suspender\", \"hibernar\", \"bloquear sessão\" e \"desbloquear sessão\". As opções são usadas para definir as ações apropriadas de cada evento, para tal é só executar o bloqueio e esperar o usuário desbloquear ou matar o processo. O xss-lock também reage com eventos DPMS e consegue executar ou matar o bloqueio em resposta.\n\nAutoinicie o programa usando algo como o exemplo abaixo:\n\n```\n$ xss-lock -- i3lock -n -i background_image.png &\n```\n\n"
    },
    {
      "title": "Economia de energia",
      "level": 2,
      "content": "Esta seção é uma referência para criar scripts customizados e configurações de economia de energia, bem como por regras udev. Antes tenha certeza que as definições não estão a ser gerenciadas por outro utilitário para evitar conflitos.\n\nPraticamente todas as funcionalidades listadas aqui merecem o uso mesmo que o computador esteja conectado diretamente a uma fonte de alimentação ou pela bateria. Muitos tem impacto de performance negligenciável e só não são habilitados por padrão porque é comum a quebra de hardware/drivers. Reduzir o gasto de energia significa diminuir o calor, logo isso gera maior desempenho de um processador Intel ou AMD moderno, graças ao overclocking dinâmico.\n\n"
    },
    {
      "title": "Visualizando configurações de energia",
      "level": 3,
      "content": "Este script faz o print das configurações de energia e de uma variedade de outras propriedades para dispositivos USB e PCI. Note que são necessárias permissões de root para que seja possível ver todas as configurações.\n\n```\n#!/bin/bash\n\nfor i in $(find /sys/devices/ -name \"bMaxPower\")\ndo\n\tbusdir=${i%/*}\n\tbusnum=$(<$busdir/busnum)\n\tdevnum=$(<$busdir/devnum)\n\ttitle=$(lsusb -s $busnum:$devnum)\n\n\tprintf \"\\n\\n+++ %s\\n  -%s\\n\" \"$title\" \"$busdir\"\n\n\tfor ff in $(find $busdir/power/ -type f ! -empty 2>/dev/null)\n\tdo\n\t\tv=$(cat $ff 2>/dev/null|tr -d \"\\n\")\n\t\t[[ ${#v} -gt 0 ]] && echo -e \" ${ff##*/}=$v\";\n\t\tv=;\n\tdone | sort -g;\ndone;\n\nprintf \"\\n\\n\\n+++ %s\\n\" \"Kernel Modules\"\nfor mod in $(lspci -k | sed -n '/in use:/s,^.*: ,,p' | sort -u)\ndo\n\techo \"+ $mod\";\n\tsystool -v -m $mod 2> /dev/null | sed -n \"/Parameters:/,/^$/p\";\ndone\n```\n\n"
    },
    {
      "title": "Processadores com suporte ao Intel Hardware P-state",
      "level": 3,
      "content": "As preferências de energia disponíveis de um processador com suporte ao Intel Hardware P-state (HWP) são default, performance, balance_performance, balance_power e power; respectivamente \"padrão/normal\", \"desempenho\", \"desempenho balanceado\", \"economia de energia balanceada\" e \"economia de energia\" (os dois últimos termos definem uma maior eficiência energética).\n\nAs opções válidas do sistema podem ser vistas da seguinte forma:\n\n```\n$ cat /sys/devices/system/cpu/cpufreq/policy*/energy_performance_available_preferences\n```\n\nPara reduzir o gasto energético, você pode editar a configuração ao criar o seguinte arquivo:\n\n```\n/etc/tmpfiles.d/energy_performance_preference.conf\n```\n\n```\nw /sys/devices/system/cpu/cpufreq/policy*/energy_performance_preference - - - - balance_power\n```\n\nVeja o manual x86_energy_perf_policy(8) para consultar mais detalhes sobre o protocolo de desempenho energético da Intel. Consulte igualmente os manuais systemd-tmpfiles(8) e tmpfiles.d(5) para mais detalhes sobre arquivos/diretórios temporários.\n\n"
    },
    {
      "title": "Áudio",
      "level": 3,
      "content": "Se a economia de energia está ativada ou não isto irá depender do dispositivo em específico. Por exemplo, estará ativo com HD Audio. Identifique o módulo em uso e então execute:\n\n```\n$ modinfo --field=parm nome_módulo | column --separator=':' --table --table-columns-limit=2\n```\n\nE busque por um parâmetro de kernel como power_save, do qual possa ajustar ou desabilitar a funcionalidade de economia de energia.\n\n- Advanced Linux Sound Architecture/Troubleshooting#Power saving\n- PipeWire#Noticeable audio delay or audible pop/crack when starting playback, ou veja a página traduzida em: PipeWire (Português)#Atraso no áudio notável ao começar a tocar áudio\n- PulseAudio/Troubleshooting#Pops when starting and stopping playback\n\n"
    },
    {
      "title": "Retroiluminação - Backlight",
      "level": 3,
      "content": "Veja a página em inglês sobre Backlight.\n\n"
    },
    {
      "title": "Bluetooth",
      "level": 3,
      "content": "Para desativar completamente o Bluetooth crie uma lista negra com os módulos btusb e bluetooth.\n\nDe forma alternativa, crie o seguinte arquivo de regras udev:\n\n```\n/etc/udev/rules.d/50-bluetooth.rules\n```\n\n```\n# desabilita bluetooth\nSUBSYSTEM==\"rfkill\", ATTR{type}==\"bluetooth\", ATTR{state}=\"0\"\n```\n\nPara desligar o Bluetooth somente temporariamente, use rfkill(8):\n\n```\n# rfkill block bluetooth\n```\n\n"
    },
    {
      "title": "Webcam",
      "level": 3,
      "content": "Se você não irá usar uma webcam integrada, então crie uma lista negra para bloquear o módulo uvcvideo.\n\n"
    },
    {
      "title": "Parâmetros de kernel",
      "level": 3,
      "content": "Esta seção visa o uso de configurações em /etc/sysctl.d/, que significa usar \"um diretório drop-in para os parâmetros sysctl de kernel.\" Veja mais em Os novos arquivos de configuração e mais especificamente no manual em sysctl.d(5).\n\n"
    },
    {
      "title": "Desativar NMI do watchdog",
      "level": 4,
      "content": "O NMI do watchdog é um recurso de debugging (depuração) para capturar travamentos de hardware que causam pânico no kernel. Em alguns sistemas isto pode gerar várias interrupções, consequentemente é notável um aumento no consumo de energia. Para listar estas interrupções por core de CPU desde o último boot, você pode usar:\n\n```\n$ grep NMI /proc/interrupts\n```\n\n```\nNMI:     22     58     24     23     24     39     22     30   Non-maskable interrupts\n```\n\nPara desativar o detector de travamento rígido (hardlockup), use:\n\n```\n/etc/sysctl.d/disable_watchdog.conf\n```\n\n```\nkernel.nmi_watchdog = 0\n```\n\nOu adicione nmi_watchdog=0 em uma linha de comando do kernel.\n\nAlternativamente, adicione nowatchdog na linha de comando do kernel para desativar o detector de travamento rígido e suave (hardlockup/softlockup). Veja mais sobre em [3].\n\n"
    },
    {
      "title": "Tempo de resposta da escrita (writeback)",
      "level": 4,
      "content": "Aumentar tempo de writeback da memória virtual suja ajuda a agregar o conjunto das E/S (I/O) do disco, e portanto reduz a duração de escritas pelo disco e aumenta a economia de energia. Para definir o valor em 60 segundos (o padrão é 5 secs):\n\n```\n/etc/sysctl.d/dirty.conf\n```\n\n```\nvm.dirty_writeback_centisecs = 6000\n```\n\nPara fazer o mesmo com a alocação de registro (journal commits) nos sistemas de arquivos suportados (por exemplo ext4, btrfs...), use a opção commit=60 em fstab.\n\nNote que este valor é modificado como um efeito colateral das configurações do modo notebook/laptop, descrito na seção abaixo. Veja também sobre outros parâmetros que afetam a performance de E/S (I/O) e a economia de energia em sysctl#Virtual memory.\n\n"
    },
    {
      "title": "Modo notebook/laptop",
      "level": 4,
      "content": "Veja sobre O valor sensível de \"knob\" em 5 segundos - modo laptop na documentação do kernel para mais detalhes sobre a configuração a seguir:\n\n```\n/etc/sysctl.d/laptop.conf\n```\n\n```\nvm.laptop_mode = 5\n```\n\n"
    },
    {
      "title": "Interfaces de rede",
      "level": 3,
      "content": "O Wake-on-LAN pode ser um recurso muito útil, porém se não for usado o efeito é a drenagem extra de energia a espera de um pacote mágico enquanto o sistema é suspenso. Você pode adaptar a regra udev para desabilitar o recurso em todas as interfaces de Ethernet. Para habilitar a economia de energia com o uso de iw em todas as interfaces sem fio:\n\n```\n/etc/udev/rules.d/81-wifi-powersave.rules\n```\n\n```\nACTION==\"add\", SUBSYSTEM==\"net\", KERNEL==\"wl*\", RUN+=\"/usr/bin/iw dev $name set power_save on\"\n```\n\nO nome para o arquivo de configuração é importante, com o uso de nomes de dispositivos persistentes em systemd, a regra de rede acima, chamada pela lexicografia derivada de 80-net-setup-link.rules, é aplicada após o dispositivo ser renomeado com um nome persistente, por exemplo wlan0 é renomeado como wlp3s0. Esteja ciente que o comando RUN é executado depois que todas as regras foram processadas e as mesmas devem usar o nome persistente, disponível em $name e do qual corresponde a um determinado dispositivo.\n\n"
    },
    {
      "title": "Placas de internet sem fio da Intel (iwlwifi)",
      "level": 4,
      "content": "Funções de economia de energia adicionais com o driver iwlwifi das placas de internet sem fio da Intel podem ser ativadas ao passar os parâmetros corretos ao módulo de kernel, além de serem modificações persistentes ao incrementar as linhas abaixo para o arquivo /etc/modprobe.d/iwlwifi.conf:\n\n```\noptions iwlwifi power_save=1\n```\n\nEsta opção provavelmente aumentará a latência média:\n\n```\noptions iwlwifi uapsd_disable=0\n```\n\nEm kernels < 5.4 (abaixo da versão 5.4) você até pode usar a opção abaixo, mas é provável que diminua o processamento máximo da placa:\n\n```\noptions iwlwifi d0i3_disable=0\n```\n\nDependendo da sua placa de internet sem fio um dos módulos abaixo será aplicável:\n\n```\noptions iwlmvm power_scheme=3\n```\n\n```\noptions iwldvm force_cam=0\n```\n\nVocê pode verificar qual deles é relevante ao investigar qual destes módulos está sendo usado com:\n\n```\n# lsmod | grep '^iwl.vm'\n```\n\nTenha em mente que essas opções de economia de energia são experimentais e podem causar instabilidade no sistema.\n\n"
    },
    {
      "title": "Gestão de energia de estado ativo",
      "level": 4,
      "content": "Trecho traduzido e retirado da Wikipédia:\n\nNo boot a BIOS ativa ou desativa o uso de ASPM baseado no suporte do hardware disponível. Para verificar o suporte:\n\n```\n# lspci -vv | grep 'ASPM.*abled;'\n```\n\nBusque por protocolos disponíveis e o padrão atual do sistema com:\n\n```\n$ cat /sys/module/pcie_aspm/parameters/policy\n```\n\n```\n[default] performance powersave powersupersave\n```\n\nASPM pode estar desabilitado pelas seguintes razões [4]:\n\n1. A BIOS determinou que isto precisava acontecer.\n1. PCIE requer ASPM, mas L0s é opcional, então talvez o L0s esteja inativo e apenas L1 está ativo.\n1. Você possui uma BIOS bugada.\n1. Você não possui uma BIOS e os desenvolvedores do seu sistema podem não ter proporcionado ainda o controle com ASPM.\n\nSe você acredita que seu hardware possui o suporte para ASPM, apesar do que foi listado acima, existe a alternativa de forçar a ativação para o kernel administrar com a opção pcie_aspm=force definida nos parâmetros de kernel.\n\n- Forçar a ativação de ASPM em um sistema sem suporte pode na realidade aumentar o consumo de energia. A longo prazo pode causar congelamentos ou pânicos de kernel no sistema, portanto tenha certeza que você tem um jeito de refazer a opção se ela estiver sendo inconveniente.\n- Embora o ASPM tenha sido imposto a força para tomar lugar no funcionamento do kernel, há uma chance de não dar certo e continuar desabilitado no hardware. Para verificar se esse é o caso, execute dmesg | grep ASPM como root. Consulte se possível o artigo específico do seu hardware na Wiki para mais informações.\n\nContanto que ASPM seja suportado e ativado, é possível selecionar o protocolo desejado para a sessão atual. Por exemplo, a troca de powersupersave para a sessão atual é feita com uso de:\n\n```\n# echo powersupersave > /sys/module/pcie_aspm/parameters/policy\n```\n\nPara configurar a ativação de um estado especifico de ASPM a partir do boot do sistema (usando powersupersave, por exemplo), adicione pcie_aspm.policy=powersupersave como um parâmetro de kernel.\n\n"
    },
    {
      "title": "Gestão de energia do tempo de execução PCI (PCI runtime)",
      "level": 4,
      "content": "```\n/etc/udev/rules.d/pci_pm.rules\n```\n\n```\nSUBSYSTEM==\"pci\", ATTR{power/control}=\"auto\"\n```\n\nA regra acima desliga todos os dispositivos em desuso exceto pelo dispositivo ata PCI. É preciso criar regras para cada um destes, de forma similar a demonstração abaixo.\n\n```\n/etc/udev/rules.d/pci_pm_ata.rules\n```\n\n```\nACTION==\"add\",SUBSYSTEM==\"pci\",TEST==\"ata1/power/control\",ATTR{ata1/power/control}=\"auto\"\nACTION==\"add\",SUBSYSTEM==\"pci\",TEST==\"ata2/power/control\",ATTR{ata2/power/control}=\"auto\"\nACTION==\"add\",SUBSYSTEM==\"pci\",TEST==\"ata3/power/control\",ATTR{ata3/power/control}=\"auto\"\n#similares...\n```\n\nAlguns dispositivos podem não conseguir mais acordar. Para permitir somente a gestão de energia do tempo de execução de dispositivos que são conhecidos por operar normalmente, faça uma combinação simples entre vendor e device IDs (use lspci -nn para pegar estes valores):\n\n```\n/etc/udev/rules.d/pci_pm.rules\n```\n\n```\n# lista branca para autossuspensão pci \nSUBSYSTEM==\"pci\", ATTR{vendor}==\"0x1234\", ATTR{device}==\"0x1234\", ATTR{power/control}=\"auto\"\n```\n\nComo segunda opção, coloque na lista negra dispositivos não operantes com a gestão de energia do tempo de execução PCI e mantenha ativo para todos os outros hardwares:\n\n```\n/etc/udev/rules.d/pci_pm.rules\n```\n\n```\n# lista negra para a gestão de energia do tempo de execução pci\nSUBSYSTEM==\"pci\", ATTR{vendor}==\"0x1234\", ATTR{device}==\"0x1234\", ATTR{power/control}=\"on\", GOTO=\"pci_pm_end\"\n\nSUBSYSTEM==\"pci\", ATTR{power/control}=\"auto\"\nLABEL=\"pci_pm_end\"\n```\n\n"
    },
    {
      "title": "Autossuspensão USB",
      "level": 4,
      "content": "O kernel Linux pode automaticamente suspender dispositivos USB quando não estão sendo usados. Às vezes a prática traz uma pequena economia de energia, porém alguns dispositivos USB não são compatíveis com a economia de energia USB e começam a mudar de comportamento (comum em teclados e microfones USB). Regras udev baseadas na filtragem por lista branca ou lista negra ajudam a mitigar o problema.\n\nO mais simples exemplo, entretanto um pouco inútil, é ativando a autossuspensão para todos os dispositivos USB:\n\n```\n/etc/udev/rules.d/50-usb_power_save.rules\n```\n\n```\nACTION==\"add\", SUBSYSTEM==\"usb\", TEST==\"power/control\", ATTR{power/control}=\"auto\"\n```\n\nPara permitir a autossuspensão de somente alguns dispositivos com o funcionamento conhecido, simplesmente busque a combinação entre vendor e product IDs (use lsusb para pegar estes valores):\n\n```\n/etc/udev/rules.d/50-usb_power_save.rules\n```\n\n```\n# lista branca para autosusspensão de USBs\nACTION==\"add\", SUBSYSTEM==\"usb\", TEST==\"power/control\", ATTR{idVendor}==\"05c6\", ATTR{idProduct}==\"9205\", ATTR{power/control}=\"auto\"\n```\n\nComo solução oposta, e se você achar melhor, opte por criar uma lista negra para os dispositivos que não reagem bem com a autossuspensão USB e habilite para todos os outros dispositivos:\n\n```\n/etc/udev/rules.d/50-usb_power_save.rules\n```\n\n```\n# lista negra para autossuspensão de USBs\nACTION==\"add\", SUBSYSTEM==\"usb\", ATTR{idVendor}==\"05c6\", ATTR{idProduct}==\"9205\", GOTO=\"power_usb_rules_end\"\n\nACTION==\"add\", SUBSYSTEM==\"usb\", TEST==\"power/control\", ATTR{power/control}=\"auto\"\nLABEL=\"power_usb_rules_end\"\n```\n\nO tempo de espera ocioso padrão da autossuspensão é controlado pelo parâmetro autosuspend, pertencente ao já embutido (built-in) módulo de kernel usbcore. Para definir um tempo de espera de 5 segundos ao invés do padrão de 2 segundos, adicione o seguinte parâmetro de kernel ao seu bootloader:\n\n```\nusbcore.autosuspend=5\n```\n\nDe forma semelhante ao power/control, o tempo de espera pode ser refinado para cada dispositivo ao definir o atributo power/autosuspend. Isto significa que, se desejado de outra forma, a autossupensão pode ser desativada ao defini-la para -1 (e com isso jamais autossuspender):\n\n```\n/etc/udev/rules.d/50-usb_power_save.rules\n```\n\n```\nACTION==\"add\", SUBSYSTEM==\"usb\", ATTR{idVendor}==\"05c6\", ATTR{idProduct}==\"9205\", ATTR{power/autosuspend}=\"-1\"\n```\n\nVeja a documentação do kernel Linux para mais informações sobre a gestão de energia em dispositivos USB.\n\n"
    },
    {
      "title": "Gerenciamento de energia do link ativo SATA",
      "level": 4,
      "content": "A configuração atual do Active Link Power Management (ALPM) pode ser lida pelo ou definida com /sys/class/scsi_host/host*/link_power_management_policy da seguinte forma:\n\n```\n$ grep . /sys/class/scsi_host/host*/link_power_management_policy\n$ echo \"med_power_with_dipm\" >/sys/class/scsi_host/hostN/link_power_management_policy\n```\n\nTable content:\nConfiguração | Descrição | Economia de energia\nmax_performance | atual padrão | Nenhum\nmedium_power | - | ~1.0 Watts\nmed_power_with_dipm | configuração recomendada1 | ~1.5 Watts\nmin_power | ATENÇÃO: possível perda de dados2 | ~1.5 Watts\n\n1. Desde a versão 4.15 do Linux há uma configuração chamada med_power_with_dipm que corresponde ao comportamento das configurações de driver IRST do Windows e não deve causar perda de dados com SSDs ou HDDs recentes. A economia de energia pode ser significante, cerca de 1.0 até 1.5 Watts (quando ocioso). Isto se tornou a definição padrão para notebooks/laptops baseados em Intel na versão 4.6 do Linux [5].\n1. Atenção: A definição min_power do Gerenciamento de energia do Link Ativo SATA pode levar a perda de dados em alguns dispositivos. Não habilite esta opção a não ser que você faça backups frequentemente.\n\nVocê pode configurar de forma persistente as definições em link_power_management_policy ao adicionar um arquivo de regras udev, por exemplo:\n\n```\n/etc/udev/rules.d/hd_power_save.rules\n```\n\n```\nACTION==\"add\", SUBSYSTEM==\"scsi_host\", KERNEL==\"host*\", ATTR{link_power_management_policy}=\"med_power_with_dipm\"\n```\n\n- Isto adiciona uma latência ao acessar uma unidade que esteja ociosa, então esta pode ser uma das poucas definições que valem a pena trocar baseado em quando você estiver conectado a um carregador/fonte de alimentação ou não.\n- Nem todas as combinações dos controladores que gerenciam o SATA e os dispositivos de armazenamento funcionam bem com o padrão med_power_with_dipm configurado. Por exemplo: Desde o linux-6.8.1, os controladores do Intel 7 Series Chipset irão experienciar timeouts e degradação do link ao acessar SSDs da Crucial M550 (com o firmware MU02). Desde o linux-6.9.6, os controladores da AMD 600 Series Chipset SATA usados com os drives de disco óptico HL-DT-ST BDDVDRW GGC-H20L apresentam um efeito incômodo em que o ROM drive irá reinicializar de forma barulhenta em torno de apenas alguns minutos.\n\n- Desde o linux-6.8.1, os controladores do Intel 7 Series Chipset irão experienciar timeouts e degradação do link ao acessar SSDs da Crucial M550 (com o firmware MU02).\n- Desde o linux-6.9.6, os controladores da AMD 600 Series Chipset SATA usados com os drives de disco óptico HL-DT-ST BDDVDRW GGC-H20L apresentam um efeito incômodo em que o ROM drive irá reinicializar de forma barulhenta em torno de apenas alguns minutos.\n\n"
    },
    {
      "title": "Unidade de disco rígido",
      "level": 3,
      "content": "Veja a paǵina hdparm#Power management configuration para saber quais configurações podem ser usadas nos parâmetros do dispositivo.\n\nEconomia de energia não é efetiva se muitos programas estão frequentemente escrevendo no disco; é possível localizar todos os programas, e como, ou quando, eles escrevem no disco para limitar o uso do driver. Use iotop para descobrir quais programas usam o disco com frequência. Veja na seção Melhorando o desempenho#Dispositivos de armazenamento para mais dicas.\n\nPequenos ajustes, como a opção noatime, podem ser benéficos. Se houver memória RAM o suficiente disponível, considere desabilitar ou limitar swappiness, pois o mesmo permite limitar uma boa porção de escrituras no disco.\n\nPara dispositivos Seagate com tecnologia PowerChoice, truques para configurar APM via hdparm não irão funcionar por conta do recurso EPC (Condição de Energia Estendida). Ao invés de configurar APM, considere instalar openseachestAUR e desativar totalmente o EPC da seguinte maneira, demonstrada logo abaixo, (troque o X pela letra real do dispositivo):\n\n```\n# openSeaChest_PowerControl --scan\n# openSeaChest_PowerControl -d /dev/sdX -i\n# openSeaChest_PowerControl -d /dev/sdX --showEPCSettings\n# openSeaChest_PowerControl -d /dev/sdX --EPCfeature disable\n# openSeaChest_PowerControl -d /dev/sdX --showEPCSettings\n```\n\nO último comando invocado pode disponibilizar o seguinte resumo:\n\n```\n==========================================================================================\n openSeaChest_PowerControl - openSeaChest drive utilities - NVMe Enabled\n Copyright (c) 2014-2023 Seagate Technology LLC and/or its Affiliates, All Rights Reserved\n openSeaChest_PowerControl Version: 3.3.1-4_1_1 X86_64\n Build Date: Jul  4 2023\n Today: Tue Jul  4 17:49:36 2023        User: root\n==========================================================================================\n\n/dev/sdX - ST1000NM0008-2F2100 - ZFA19JG2 - SN02 - ATA\n\n\n===EPC Settings===\n        * = timer is enabled\n        C column = Changeable\n        S column = Savable\n        All times are in 100 milliseconds\n\nName       Current Timer Default Timer Saved Timer   Recovery Time C S\nIdle A      0            *10           *10           1             Y Y\nIdle B      0            *1200         *1200         3             Y Y\nIdle C      0             6000          6000         16            Y Y\nStandby Z   0             9000          9000         46            Y Y\n```\n\nOs zeros na primeira coluna confirmam a desativação e a interrupção do relógio de disco e do disco giratório de forma bem sucedida.\n\n"
    },
    {
      "title": "Usando um script e uma regra udev",
      "level": 3,
      "content": "Desde que usuários do systemd possam suspender e hibernar através de systemctl suspend ou systemctl hibernate e manipular eventos ACPI com /etc/systemd/logind.conf, então pode ser interessante remover pm-utils e acpid. Há apenas uma coisa que systemd não pode fazer (até a versão 204 pelo menos): a gestão de energia depende que exista diferenciação entre um sistema conectado pela fonte de alimentação ou pela bateria para funcionar melhor. Para preencher esta lacuna você pode criar uma única regra udev que executa um script enquanto a fonte de alimentação estiver conectada e o desativa quando ausente:\n\n```\n/etc/udev/rules.d/powersave.rules\n```\n\n```\nSUBSYSTEM==\"power_supply\", ATTR{online}==\"0\", RUN+=\"/caminho/para/seu/script true\"\nSUBSYSTEM==\"power_supply\", ATTR{online}==\"1\", RUN+=\"/caminho/para/seu/script false\"\n```\n\nExemplos de powersave scripts:\n\n- ftw, pacote: ftw-gitAUR\n- powersave\n- throttlectl, de throttlectlAUR\n\nÉ esperado que a regra udev logo acima já baste, mas se as suas configurações de energia não forem atualizadas depois de um ciclo de suspensão ou hibernação, então adicione o script em /usr/lib/systemd/system-sleep/ com o conteúdo abaixo:\n\n```\n/usr/lib/systemd/system-sleep/00powersave\n```\n\n```\n#!/bin/sh\n\ncase $1 in\n    pre) /caminho/para/seu/script false ;;\n    post)       \n\tif cat /sys/class/power_supply/AC0/online | grep 0 > /dev/null 2>&1\n\tthen\n    \t\t/caminho/para/seu/script true\t\n\telse\n    \t\t/caminho/para/seu/script false\n\tfi\n    ;;\nesac\nexit 0\n```\n\nUm pequeno lembrete: Logo após que criar, deixe seu script com as devidas permissões de execução!\n\n"
    },
    {
      "title": "Eventos de botão e tampa",
      "level": 3,
      "content": "Os eventos suspend, poweroff e hibernate; respectivamente \"suspender\", \"desligar\" e \"hibernar\", quando acionados ao pressionar um botão ou ao fechar a tampa, são manipulados pelo logind, como descrito pela seção #Eventos ACPI.\n\n"
    },
    {
      "title": "Usando systemd-logind",
      "level": 3,
      "content": "Se você estiver usando polkit, neste caso usuários em sessões não remotas podem emitir comandos relacionados à gestão de energia contanto que a sessão não esteja quebrada.\n\nPara checar se a sessão está ativa:\n\n```\n$ loginctl show-session $XDG_SESSION_ID --property=Active\n```\n\nO usuário pode então digitar comandos de systemctl ou adicioná-los aos menus:\n\n```\n$ systemctl poweroff\n$ systemctl reboot\n```\n\nOutros comandos podem ser usados igualmente, incluindo systemctl suspend e systemctl hibernate. Veja a seção System Commands em systemctl(1).\n\n"
    },
    {
      "title": "Usando sudo",
      "level": 3,
      "content": "Instale sudo e permita ao usuário privilégios de sudo, assim o usuário poderá usar comandos de sudo systemctl (por exemplo sudo systemctl poweroff, sudo systemctl reboot, sudo systemctl suspend e sudo systemctl hibernate). Veja a seção System Commands em systemctl(1).\n\n"
    },
    {
      "title": "Usuários sem privilégios de sudo",
      "level": 4,
      "content": "Se usuários devem apenas conseguir usar comandos de desligamento e, entretanto, não ter outros privilégios de sudo, então, como root, adicione os determinados comandos no final de /etc/sudoers usando o comando visudo. Substitua user pelo nome de usuário e hostname pelo nome de host da máquina.\n\n```\nuser hostname =NOPASSWD: /usr/bin/systemctl poweroff,/usr/bin/systemctl halt,/usr/bin/systemctl reboot\n```\n\nAgora usuários podem desligar com sudo systemctl poweroff e reiniciar com sudo systemctl reboot. Usuários que desejem desligar o sistema podem também usar sudo systemctl halt. Defina a tag NOPASSWD: apenas se não for esperada a solicitação de senha.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- ThinkWiki:How to reduce power consumption\n- How to get longer battery life on Linux\n\n"
    }
  ]
}