{
  "title": "Powertop (Français)",
  "url": "https://wiki.archlinux.org/title/Powertop_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Power saving\n- Laptop Mode Tools (Français)\n- TLP\n\npowertop est un outil fourni par Intel pour activer différents modes d'économie d'énergie dans l'espace utilisateur, le noyau et le matériel. Il est possible de surveiller les processus et de montrer lesquels d'entre eux utilisent le CPU et le réveillent à partir de ses états d'inactivité, ce qui permet d'identifier les applications ayant des besoins énergétiques particulièrement élevés.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet powertop.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "Powertop propose quelques méthodes pour réduire davantage la consommation d'énergie. Cependant, en mode interactif, powertop n'affiche pas les paramètres. Pour connaître ceux qui sont suggérés, procédez comme suit :\n\n1. Si vous avez modifié des paramètres (par exemple dans powertop), redémarrez le système pour que les paramètres soient dans leur état par défaut.\n1. Utilisez powertop pour produire un rapport sur les paramètres : # powertop --html=powerreport.html (en tant qu'utilisateur root)\n1. Ouvrez le rapport dans votre navigateur Web préféré. L'onglet \"Tuning\" du rapport montre maintenant les paramètres réels suggérés par l'outil à appliquer pour économiser de l'énergie. Vous pouvez extraire les commandes avec $ awk -F '</?td ?>' '/tune/ { print $4 }' powerreport.html\n\n```\n# powertop --html=powerreport.html\n```\n\n```\n$ awk -F '</?td ?>' '/tune/ { print $4 }' powerreport.html\n```\n\n"
    },
    {
      "title": "Appliquer les paramètres",
      "level": 3,
      "content": "Il y a deux façons d'appliquer automatiquement les paramètres suggérés :\n\n- Recommandé : Vous pouvez appliquer ces paramètres au démarrage en utilisant les paramètres de module, règles udev et sysctl. Pour plus de détails, consultez la page gestion de l'énergie (en).\n- Vous pouvez utiliser la fonction --auto-tune de powertop qui définit toutes les options réglables à leur paramètre BON. Ceci peut être combiné avec le service systemd pour avoir les options réglées au démarrage. N'oubliez pas d'activer et démarrer le service.\n\n```\n/etc/systemd/system/powertop.service\n```\n\n```\n[Unit]\nDescription=Réglages Powertop\n\n[Service]\nType=oneshot\nRemainAfterExit=yes\nExecStart=/usr/bin/powertop --auto-tune\n\n[Install]\nWantedBy=multi-user.target\n```\n\n"
    },
    {
      "title": "Erreur : Cannot load from file",
      "level": 3,
      "content": "Si vous recevez une erreur comme celle-ci au démarrage de powertop, il est probable que powertop n'a pas encore collecté suffisamment de données de mesure. Pour résoudre ce problème, laissez powertop fonctionner pendant un certain temps en le connectant uniquement à la batterie.\n\n```\nLoaded 39 prior measurements\nCannot load from file /var/cache/powertop/saved_parameters.powertop\nCannot load from file /var/cache/powertop/saved_parameters.powertop\n```\n\n"
    },
    {
      "title": "Calibrage pour éviter les mesures imprécises",
      "level": 3,
      "content": "Si vous rencontrez des mesures imprécises, il est probable que vous deviez d'abord calibrer powertop. Ceci peut être fait en exécutant powertop avec le paramètre --calibrate.\n\n```\n# powertop --calibrate\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Site officiel (en)[dead link 2023-09-16 ⓘ]\n- Article Wikipedia (en)\n\n"
    }
  ]
}