{
  "title": "Powerpill (Português)",
  "url": "https://wiki.archlinux.org/title/Powerpill_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O Powerpill é um wrapper do pacman que usa downloads paralelos e segmentados para tentar acelerar downloads para o pacman. Internamente, usa Aria2 e Reflector para conseguir isso. O Powerpill também pode usar rsync para espelhos oficiais que oferecem suporte a ele. Isso pode ser eficiente para usuários que já usam largura de banda total ao fazer o download a partir de um único espelho. Também há suporte ao Pacserve através do arquivo de configuração e será usado antes de baixar de espelhos externos. Exemplo: deseja-se atualizar e executa-se pacman -Syu, o qual retorna uma lista de 20 pacotes que estão disponíveis para atualização total de 200 mega. Se o usuário os baixar via pacman, eles serão baixados um após o outro. Se o usuário os baixar através do powerpill, eles serão baixados simultaneamente em muitos casos várias vezes mais rápido (dependendo da velocidade da conexão, da disponibilidade de pacotes nos servidores e da velocidade do servidor/carga, etc.)\n\nUm teste de pacman vs. powerpill em um sistema revelou uma aceleração de 4x no cenário acimia, sendo que o pacman baixa em uma média de 300 kB/s e o powerpill baixa na média de 1.2 MB/s.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote powerpillAUR.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Powerpill tem um único arquivo de configuração /etc/powerpill/powerpill.json que você pode editar como quiser. Veja a página man powerpill.json(1) para detalhes.\n\n"
    },
    {
      "title": "Usando Reflector",
      "level": 2,
      "content": "Por padrão, o Powerpill está configurado para usar Reflector para obter a lista atual de espelhos da API Web do servidor do Arch Linux e usá-los para downloads paralelos. Isto é para se certificar de que existem servidores suficientes na lista para melhorias de velocidade significativas.\n\n"
    },
    {
      "title": "Usando rsync",
      "level": 2,
      "content": "O suporte a Rsync está disponível para alguns espelhos. Quando ativado, as sincronizações de base de dados (pacman -Sy) e outras operações podem ser muito mais rápidas porque uma única conexão é usada. O próprio protocolo rsync também acelera as verificações de atualização e, às vezes, as transferências de arquivos.\n\nPara localizar um espelho adequado com suporte a rsync, use o reflector:\n\n```\n$ reflector -p rsync\n```\n\nAlternativamente, você pode localizar os n servidores mais rápidos com a opção -f n e os m servidores mais recentemente sincronizados com a opção -l m:\n\n```\n$ reflector -p rsync -f n -l m\n```\n\nSelecione o(s) espelho(s) que você deseja usar. A opção -c também pode ser usada para filtrar por sua nacionalidade (reflector --list-countries para ver uma lista completa, usando aspas em volta do nome, e há diferenciação de maiúsculo e minúsculo!). Uma vez feito, edite /etc/powerpill/powerpill.json, role para baixo para a seção rsync e adicione quantos servidores você quiser ao campo de servidor.\n\nApós isso, toda a base de dados e pacotes oficiais será baixada do servidor rsync quando possível.\n\n"
    },
    {
      "title": "Uso básico",
      "level": 2,
      "content": "Para a maioria das operações, o powerpill funciona da mesma forma que o pacman, já que é um script wrapper para o pacman.\n\n"
    },
    {
      "title": "Atualizando o sistema",
      "level": 3,
      "content": "Para atualizar seu sistema (sincronizar e atualizar pacotes instalados) usando o, basta passar as opções -Syu como você faria com o pacman:\n\n```\n# powerpill -Syu\n```\n\n"
    },
    {
      "title": "Instalação de pacotes",
      "level": 3,
      "content": "Para instalar um pacote e suas dependências, basta usar o powerpill com a opção -S como você faria com o pacman:\n\n```\n# powerpill -S pacote\n```\n\nVocê também pode instalar múltiplos pacotes com ele como você faria com o pacman:\n\n```\n# powerpill -S pacote1 pacote2 pacote3\n```\n\n"
    },
    {
      "title": "Solução de problemas",
      "level": 2,
      "content": "No caso de você obter um [err] para arquivos <repo>.db.sig:\n\n```\nb5d7d7|ERR |       0B/s|/var/lib/pacman/sync/extra.db.sig\n   899e91|ERR |       0B/s|/var/lib/pacman/sync/multilib.db.sig\n   8fcc32|ERR |       0B/s|/var/lib/pacman/sync/core.db.sig\n   85eb3d|ERR |       0B/s|/var/lib/pacman/sync/community.db.sig\n```\n\nÉ porque os arquivos de assinatura estão faltando para aquele repo e você não definiu\n\n```\nSigLevel = PackageRequired\n```\n\nexplicitamente no /etc/pacman.conf, conforme explicado nesta publicação do fórum do Arch\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Powerpill - página oficial do projeto\n- powerpill reborn - powerpill está de volta :)\n\n"
    }
  ]
}