{
  "title": "Powerpill (Italiano)",
  "url": "https://wiki.archlinux.org/title/Powerpill_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nPowerpill is a pacman wrapper that uses parallel and segmented downloading to try to speed up downloads for Pacman. Internally it uses Aria2 and Reflector to achieve this. Powerpill can also use rsync for official mirrors that support it. This can be efficient for users who already use full bandwidth when downloading from a single mirror. Pacserve is also supported via the configuration file and will be used before downloading from external mirrors. Example: One wants to update and issues a pacman -Syu which returns a list of 20 packages that are available for update totaling 200 megs. If the user downloads them via pacman, they will come down one-at-a-time. If the user downloads them via powerpill, they will come down simultaneously in many cases several times faster (depending on one's connection speed, the availability of packages on servers, and speed from server/load, etc.)\n\nA test of pacman vs. powerpill on one system revealed a 4x speed up in the above scenario where the pacman downloads averages 300 kB/sec and the powerpill downloads averaged 1.2 MB/sec.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the powerpillAUR package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Powerpill has a single configure file /etc/powerpill/powerpill.json you can edit to your liking. Refer to the powerpill.json(1) man page for details.\n\n"
    },
    {
      "title": "Using Reflector",
      "level": 2,
      "content": "By default, Powerpill is configured to use Reflector to retrieve the current list of mirrors from the Arch Linux server's web API and use them for parallel downloads. This is to make sure that there are enough servers in the list for significant speed improvements.\n\n"
    },
    {
      "title": "Using rsync",
      "level": 2,
      "content": "Rsync support is available for some mirrors. When enabled, database synchronizations (pacman -Sy) and other operations may be much faster because a single connection is used. The rsync protocol itself also speeds up update checks and sometimes file transfers.\n\nTo find a suitable mirror with rsync support, use reflector:\n\n```\n$ reflector -p rsync\n```\n\nAlternatively, you can find the n fastest servers with the flag -f n, and the m most recently synchronized servers with the flag -l m:\n\n```\n$ reflector -p rsync -f n -l m\n```\n\nSelect the mirror(s) you want to use. The -c option may also be used to filter by your nationality (reflector --list-countries to see a complete list, use quotes around the name, and this is case-sensitive!). Once done, edit /etc/powerpill/powerpill.json, scroll down to the rsync section, and add as many servers as you would like to the server field.\n\nAfter that, all official database and packages will be downloaded from the rsync server whenever possible.\n\nNote that there is a check to see if the databases and packages are in an official repository with reflector, so its installation is necessary for rsync feature to function.\n\n"
    },
    {
      "title": "Basic usage",
      "level": 2,
      "content": "For most operations, powerpill works just like pacman since it is a wrapper script for pacman.\n\n"
    },
    {
      "title": "System updating",
      "level": 3,
      "content": "To update your system (sync and update installed packages) using powerpill, simply pass the -Syu options to it as you would with pacman:\n\n```\n# powerpill -Syu\n```\n\n"
    },
    {
      "title": "Installation of packages",
      "level": 3,
      "content": "To install a package and its deps, simply use powerpill with the -S option as you would with pacman:\n\n```\n# powerpill -S package\n```\n\nYou may also install multiple packages with it the same way you would with pacman:\n\n```\n# powerpill -S package1 package2 package3\n```\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "In case you get an [err] for <repo>.db.sig files:\n\n```\nb5d7d7|ERR |       0B/s|/var/lib/pacman/sync/extra.db.sig\n   899e91|ERR |       0B/s|/var/lib/pacman/sync/multilib.db.sig\n   8fcc32|ERR |       0B/s|/var/lib/pacman/sync/core.db.sig\n   85eb3d|ERR |       0B/s|/var/lib/pacman/sync/community.db.sig\n```\n\nIt is because signature files are missing for that repository and you have not set\n\n```\nSigLevel = PackageRequired\n```\n\nexplicitly in /etc/pacman.conf as explained in this forum post.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Powerpill - official project page\n- powerpill reborn - powerpill is back :)\n\n"
    }
  ]
}