{
  "title": "Powerpill (Русский)",
  "url": "https://wiki.archlinux.org/title/Powerpill_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Powerpill — это оболочка pacman, которая использует параллельную и сегментированную загрузку, чтобы ускорить загрузку пакетов. Для достижения этой цели используются Aria2 и Reflector. Powerpill также может использовать rsync для официальных зеркал, которые его поддерживают. Это может быть эффективно для пользователей, которые уже используют полную полосу пропускания при скачивании с одного зеркала. Pacserve также поддерживается с помощью файла настроек и будет использоваться перед загрузкой из внешних зеркал. Пример: выполняете команду pacman -Syu, сообщается список из 20 пакетов, которые доступны для обновления, общим размером 200 МБ. Если загружать их с помощью pacman, они будут загружаться в порядке очереди по одному. Если загружать их с помощью Powerpill, они будут загружаться одновременно, во многих случаях в несколько раз быстрее (в зависимости от скорости соединения, наличии пакетов на серверах, и скоростью от сервера / нагрузки, и т.д.)\n\nИспытание \"Pacman против Powerpill\" на одной системе показало 4Х ускорение, загрузка Pacman в среднем 300 кБ / сек, и powerpill загрузка в среднем 1.2 Мб / сек.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет powerpillAUR\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Powerpill имеет один файл настроек /etc/powerpill/powerpill.json — отредактируйте его по своему вкусу. Смотрите powerpill.json(1) для более подробной информации.\n\n"
    },
    {
      "title": "С помощью Reflector",
      "level": 2,
      "content": "По умолчанию, Powerpill настроен на использование Reflector чтобы получить текущий список зеркал из веб-API сервера Arch Linux и использовать их для параллельных загрузок. Для значительных улучшений скорости, убедитесь, что есть достаточно серверов в списке.\n\n"
    },
    {
      "title": "С помощью rsync",
      "level": 2,
      "content": "Некоторые зеркала поддерживают rsync. Когда он включен, синхронизация базы данных (pacman -Sy) и другие операции могут выполняться значительно быстрее, так как используется одно соединение. Сам протокол rsync также ускоряет проверку обновлений, а иногда и передачу файлов.\n\nЧтобы найти подходящее зеркало с поддержкой rsync, используйте reflector:\n\n```\n$ reflector -p rsync\n```\n\nТакже можно найти n самых быстрых серверов (опция -f) и m недавно обновлённых серверов (опция -l):\n\n```\n$ reflector -p rsync -f n -l m\n```\n\nВыберите зеркала, которые вы хотите использовать. Опция -c также может быть использована для фильтрации по вашей стране (reflector --list-countries чтобы увидеть полный список, используйте имя в кавычках с учётом регистра!). После этого отредактируйте /etc/powerpill/powerpill.json, прокрутив вниз до секции rsync и добавив столько серверов, сколько хотите, в поле server.\n\nПосле этого все официальные базы данных и пакеты будут загружены из rsync-сервера, когда это возможно.\n\nОбратите внимание, что есть проверка, находятся ли базы данных и пакеты в официальном репозитории, через Reflector, поэтому его установка необходима для работы функции rsync.\n\n"
    },
    {
      "title": "Основы использования",
      "level": 2,
      "content": "Большинство операций в powerpill работают так же, как и в pacman, так как он является скриптом-обёрткой для pacman.\n\n"
    },
    {
      "title": "Обновление системы",
      "level": 3,
      "content": "Чтобы обновить систему (синхронизировать и обновить установленные пакеты) используйте powerpill и опцию -Syu - как вы делаете это с pacman:\n\n```\n# powerpill -Syu\n```\n\n"
    },
    {
      "title": "Установка пакетов",
      "level": 3,
      "content": "Чтобы установить пакет и его зависимости, просто используйте powerpill (вместо pacman) с опцией -S:\n\n```\n# powerpill -S package\n```\n\nВы также можете установить несколько пакетов, как и при работе с pacman:\n\n```\n# powerpill -S package1 package2 package3\n```\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Если вы получаете [err] для файлов <repo>.db.sig:\n\n```\nb5d7d7|ERR |       0B/s|/var/lib/pacman/sync/extra.db.sig\n   899e91|ERR |       0B/s|/var/lib/pacman/sync/multilib.db.sig\n   8fcc32|ERR |       0B/s|/var/lib/pacman/sync/core.db.sig\n   85eb3d|ERR |       0B/s|/var/lib/pacman/sync/community.db.sig\n```\n\nЭто происходит потому, что нет файлов подписей для этого репозитория, и вы не установили:\n\n```\nSigLevel = PackageRequired\n```\n\nв /etc/pacman.conf как описано в этом посте из форума Arch (En)\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Powerpill - официальная страница проекта\n- Быстрая загрузка пакетов, при помощи Powerpill - тема на форуме archlinux.org.ru\n- powerpill reborn - powerpill is back :)\n\n"
    }
  ]
}