{
  "title": "Preload (Português)",
  "url": "https://wiki.archlinux.org/title/Preload_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O pré-carregamento é a ação de colocar e manter os arquivos de destino na RAM. O benefício é que os aplicativos pré-carregados iniciam mais rapidamente porque a leitura na RAM é sempre mais rápida que no disco rígido. No entanto, parte da sua RAM será dedicada a essa tarefa, mas não mais do que se você mantivesse o aplicativo aberto. Portanto, o pré-carregamento é melhor usado com aplicativos grandes e usados com frequência, como Firefox e LibreOffice.\n\n"
    },
    {
      "title": "Go-preload",
      "level": 2,
      "content": "gopreload-gitAUR é um pequeno daemon criado no fórum do Gentoo. Para usá-lo, primeiro execute este comando em um terminal para cada programa que você deseja pré-carregar na inicialização:\n\n```\n# gopreload-prepare programa\n```\n\nPara usuários comuns, torne-se o dono de /usr/share/gopreload/enabled e /usr/share/gopreload/disabled:\n\n```\n# chown usuário:users /usr/share/gopreload/enabled /usr/share/gopreload/disabled\n```\n\ne execute gopreload para cada programa que você deseja pré-carregar:\n\n```\n$ gopreload-prepare programa\n```\n\nEm seguida, conforme as instruções, pressione Enter quando o programa estiver totalmente carregado. Isso adicionará uma lista de arquivos necessários pelo programa em /usr/share/gopreload/enabled. Para carregar todas as listas na inicialização, habilite o arquivo de serviço do systemd gopreload.service.\n\nPara desativar o carregamento de um programa, remova a lista apropriada em /usr/share/gopreload/enabled ou mova-a para /usr/share/gopreload/disabled.\n\nÉ recomendável executar o gopreload-prepare após as atualizações do sistema para atualizar as listas de arquivos. Para a tarefa, a seguinte ferramenta em lote é útil:\n\n```\n# gopreload-batch-refresh.sh\n```\n\nApenas deixe funcionar sem usar o sistema.\n\n"
    },
    {
      "title": "Configuração",
      "level": 3,
      "content": "O arquivo de configuração está localizado em /etc/gopreload.conf\n\n"
    },
    {
      "title": "Preload",
      "level": 2,
      "content": "preload é um programa escrito por Behdad Esfahbod que roda como um daemon e registra estatísticas sobre o uso de programas usando cadeias de Markov; os arquivos dos programas mais usados são, durante o tempo livre do computador, carregados na memória. Isso resulta em tempos de inicialização mais rápidos, pois menos dados precisam ser buscados no disco.\n\n"
    },
    {
      "title": "Instalação",
      "level": 3,
      "content": "Instale o pacote preloadAUR. Agora inicie o serviço systemd preload, e/ou habilite-o para começar na inicialização.\n\n"
    },
    {
      "title": "Configuração",
      "level": 3,
      "content": "O arquivo de configuração está localizado em /etc/preload.conf, contendo configurações padrão que devem ser adequadas para usuários comuns. A opção cycle permite configurar com que frequência executar ping no sistema de pré-carregamento para atualizar seu modelo de quais aplicativos e bibliotecas armazenar em cache.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Wikipedia:pt:Preload\n- Melhorando o desempenho da inicialização\n\n"
    }
  ]
}