{
  "title": "Preload (Español)",
  "url": "https://wiki.archlinux.org/title/Preload_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-13** \n\nLa precarga es la acción de colocar y mantener archivos de destino en la RAM. El beneficio es que las aplicaciones precargadas se inician más rápidamente porque la lectura desde la RAM siempre es más rápida que desde el disco duro. Sin embargo, parte de su RAM se dedicará a esta tarea, pero no más que si dejara abierta la aplicación. Por lo tanto, la precarga se usa mejor con aplicaciones grandes y de uso frecuente como Firefox y LibreOffice.\n\n"
    },
    {
      "title": "Go-preload",
      "level": 2,
      "content": "gopreload-gitAUR es un pequeño demonio creado en el foro de Gentoo. Para utilizarlo, primero ejecute esta orden en una terminal para cada programa que desee precargar en el arranque:\n\n```\n# gopreload-prepare programa\n```\n\nPara los usuarios habituales, tome posesión de /usr/share/gopreload/enabled y /usr/share/gopreload/disabled:\n\n```\n# chown usuario:users /usr/share/gopreload/enabled /usr/share/gopreload/disabled\n```\n\nY luego gopreload para cada programa que desee precargar:\n\n```\n$ gopreload-prepare programa\n```\n\nPosteriormente, según las instrucciones, presione Intro cuando el programa esté completamente cargado. Esto añadirá una lista de archivos que necesita el programa en /usr/share/gopreload/enabled. Para cargar todas las listas en el arranque, active gopreload.service.\n\nPara desactivar la carga de un programa, elimine la lista apropiada en /usr/share/gopreload/enabled o muévala a /usr/share/gopreload/disabled.\n\nSe recomienda ejecutar gopreload-prepare después de las actualizaciones del sistema para actualizar las listas de archivos. Para esta tarea, la siguiente herramienta sería útil:\n\n```\n# gopreload-batch-refresh.sh\n```\n\nDéjelo ejecutarse sin utilizar el sistema.\n\n"
    },
    {
      "title": "Configuración",
      "level": 3,
      "content": "El archivo de configuración se encuentra en /etc/gopreload.conf\n\n"
    },
    {
      "title": "Preload",
      "level": 2,
      "content": "preload es un programa escrito por Behdad Esfahbod que se ejecuta como un demonio y registra estadísticas sobre el uso de programas que utilizan cadenas de Markov; Los archivos de los programas más utilizados se cargan en la memoria durante el tiempo libre de la computadora. Esto da como resultado tiempos de inicio más rápidos, ya que se necesitan recuperar menos datos del disco.\n\n"
    },
    {
      "title": "Instalación",
      "level": 3,
      "content": "Instale el paquete preloadAUR. Ahora puede iniciar el servicio preload y/o activarlo para que se inicie en el arranque.\n\n"
    },
    {
      "title": "Configuración",
      "level": 3,
      "content": "El archivo de configuración se encuentra en /etc/preload.conf, contiene configuraciones predeterminadas que deberían ser adecuadas para usuarios normales. La opción cycle le permite configurar la frecuencia de avisos al sistema de precarga para actualizar su modelo de qué aplicaciones y bibliotecas almacenar en caché.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- wikipedia:Preload (software)\n- Improving performance (Español)/Boot process (Español)\n\n"
    }
  ]
}