{
  "title": "Printing",
  "url": "https://wiki.archlinux.org/title/Printing",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- CUPS/Printer sharing\n- CUPS/Printer-specific problems\n- CUPS/Troubleshooting\n- Samba\n- LPRng\n\nCUPS is the standards-based, open source printing system developed by OpenPrinting for Linux® and other Unix®-like operating systems.\n\nArch Linux packages the OpenPrinting CUPS fork, not the Apple CUPS fork.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the cups package.\n\nOptionally, install the cups-pdf package if you intend to \"print\" into a PDF document. By default, PDF files are stored in /var/spool/cups-pdf/username/. The location can be changed in /etc/cups/cups-pdf.conf.\n\nThen enable and start cups.service or alternatively use socket activation to only start CUPS when a program wants to use the service.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "Print steps",
      "level": 3,
      "content": "It is important to know how CUPS works if wanting to solve related issues:\n\n1. An application sends a PDF file to CUPS when 'print' has been selected (in case the application sends another format, it is converted to PDF first).\n1. CUPS then looks at the printer's PPD file (printer description file) and figures out what filters it needs to use to convert the PDF file to a language that the printer understands (like PJL, PCL, bitmap or native PDF).\n1. The filter converts the PDF file to a format understood by the printer.\n1. Then it is sent to the back-end. For example, if the printer is connected to a USB port, it uses the USB back-end.\n\n"
    },
    {
      "title": "Connection interfaces",
      "level": 2,
      "content": "Additional steps for printer detection are listed below for various connection interfaces.\n\n"
    },
    {
      "title": "USB",
      "level": 3,
      "content": "To see if your USB printer is detected, make sure you have the usbutils package installed, then:\n\n```\n$ lsusb\n```\n\n```\n(...)\nBus 001 Device 007: ID 03f0:1004 Hewlett-Packard DeskJet 970c/970cse\n```\n\n"
    },
    {
      "title": "Parallel port",
      "level": 3,
      "content": "To use a parallel port printer, the lp, parport and parport_pc kernel modules are required.\n\n```\n# dmesg | grep -i parport\n```\n\n```\nparport0: Printer, Hewlett-Packard HP LaserJet 2100 Series\nlp0: using parport0 (polling)\n```\n\n"
    },
    {
      "title": "Adding known location printers",
      "level": 4,
      "content": "It is not required to rely on dynamic printer discovery on the network (DNS-SD/mDNS) when the address of the printer is known (e.g. obtained via printers display or other network scanning approaches). A CUPS queue can be directly added to use the printer. Documentation for adding the queue with lpadmin can be found in following sections and official documentation at Setting up printers.\n\n"
    },
    {
      "title": "Printer discovery",
      "level": 4,
      "content": "To discover, make use of discovered or share printers using DNS-SD/mDNS, setup .local hostname resolution with Avahi and restart cups.service.\n\nTo share printers with Samba, e.g. if the system is to be a print server for Windows clients, the samba package will be required.\n\n"
    },
    {
      "title": "Printer drivers",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nMost recent printers (2010+) support driverless usage by implementing AirPrint and/or IPP_Everywhere (c.f. below).\n\nThe drivers for a printer may come from any of the sources shown below. See CUPS/Printer-specific problems for an incomplete list of drivers that others have managed to get working.\n\nTo drive a printer, CUPS needs a PPD file and, for most printers, some filters. For details on how CUPS uses PPDs and filters, see [1].\n\nThe OpenPrinting Printer List provides driver recommendations for many printers. It also supplies PPD files for each printer, but most are available through foomatic or the recommended driver package.\n\nWhen a PPD file is provided to CUPS, the CUPS server will regenerate the PPD files and save them in /etc/cups/ppd/.\n\nTo test if they are working before creating a PKGBUILD, PPD files can be manually added to /usr/share/cups/model, the driver should be available after the next restart of the cups service.\n\n"
    },
    {
      "title": "AirPrint and IPP Everywhere",
      "level": 3,
      "content": "CUPS includes support for AirPrint and IPP Everywhere printers. These should be discovered automatically if avahi-daemon.service is running without any extra configuration.\n\n"
    },
    {
      "title": "OpenPrinting CUPS filters",
      "level": 3,
      "content": "The Linux Foundation's OpenPrinting workgroup provides cups-filters. Those are backends, filters, and other binaries that were once part of CUPS but have been dropped from the project. They are available in the cups-filters package that is a dependency of cups.\n\nNon-PDF printers require ghostscript to be installed. For PostScript printers, gsfonts may also be required.\n\n"
    },
    {
      "title": "Foomatic",
      "level": 3,
      "content": "The Linux Foundation's OpenPrinting workgroup's foomatic provides PPDs for many printer drivers, both free and non-free. For more information about what foomatic does, see Foomatic from the Developer's View.\n\nTo use foomatic, install foomatic-db-engine and at least one of:\n\n- foomatic-db — a collection of XML files used by foomatic-db-engine to generate PPD files.\n- foomatic-db-ppds — prebuilt PPD files.\n- foomatic-db-nonfree — a collection of XML files from printer manufacturers under non-free licenses used by foomatic-db-engine to generate PPD files.\n- foomatic-db-nonfree-ppds — prebuilt PPD files under non-free licenses.\n\nThe foomatic PPDs may require additional filters, such as min12xxwAUR.\n\n"
    },
    {
      "title": "Gutenprint",
      "level": 3,
      "content": "The Gutenprint project provides drivers for Canon, Epson, Lexmark, Sony, Olympus, Brother, HP, Ricoh, PCL printers and some generic printers for use with CUPS and GIMP.\n\nInstall gutenprint and foomatic-db-gutenprint-ppds.\n\n"
    },
    {
      "title": "Manufacturer-specific drivers",
      "level": 3,
      "content": "Many printer manufacturers supply their own Linux drivers. These are often available in the official Arch repositories or in the AUR.\n\nSome of those drivers are described in more detail in CUPS/Printer-specific problems.\n\n"
    },
    {
      "title": "Printer URI",
      "level": 2,
      "content": "Listed below are additional steps to manually generate the URI if required. Some printers or drivers may need a special URI as described in CUPS/Printer-specific problems.\n\n"
    },
    {
      "title": "USB",
      "level": 3,
      "content": "CUPS should be able to automatically generate a URI for USB printers, for example usb://HP/DESKJET%20940C?serial=CN16E6C364BH.\n\nIf it does not, see CUPS/Troubleshooting#USB printers for troubleshooting steps.\n\n"
    },
    {
      "title": "Parallel port",
      "level": 3,
      "content": "The URI should be of the form parallel:device. For instance, if the printer is connected on /dev/lp0, use parallel:/dev/lp0. If you are using a USB to parallel port adapter, use parallel:/dev/usb/lp0 as the printer URI.\n\n"
    },
    {
      "title": "Network",
      "level": 3,
      "content": "If you have set up Avahi as in #Network, CUPS should detect the printer URI. You can also use avahi-discover to find the name of your printer and its address (for instance, BRN30055C6B4C7A.local/10.10.0.155:631).\n\nThe URI can also be generated manually, without using Avahi. A list of the available URI schemes for networked printers is available in the CUPS documentation. As exact details of the URIs differ between printers, check either the manual of the printer or CUPS/Printer-specific problems.\n\nThe URI for printers on SMB shares is described in the smbspool(8) man page.\n\nNote: For example, smb://BEN-DESKTOP/HP Color LaserJet CP1510 series PCL6 becomes smb://BEN-DESKTOP/HP%20Color%20LaserJet%20CP1510%20series%20PCL6.\n\nFor example, smb://BEN-DESKTOP/HP Color LaserJet CP1510 series PCL6 becomes smb://BEN-DESKTOP/HP%20Color%20LaserJet%20CP1510%20series%20PCL6.\n\nThis result string can be obtained by running the following command:\n\n```\n$ python -c 'from urllib.parse import quote; print(\"smb://\" + quote(\"BEN-DESKTOP/HP Color LaserJet CP1510 series PCL6\"))'\n```\n\nRemote CUPS print servers can be accessed through a URI of the form ipp://hostname:631/printers/queue_name. See CUPS/Printer sharing#Printer sharing for details on setting up the remote print server.\n\nSee CUPS/Troubleshooting#Networking issues for additional issues and solutions.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "CUPS can be fully controlled using the lp* and cups* CLI tools. Alternatively, the #Web interface or one of several #GUI applications can be used.\n\n- The queue name is a short but descriptive name used on the system to identify the queue. This name should not contain spaces or any special characters. For instance, a print queue corresponding to a HP LaserJet 5P could be named \"hpljet5p\". More than one queue can be associated with each physical printer.\n- The location is a description of the printer's physical location (for instance \"bedroom\", or \"kitchen\"). This is to aid in maintaining several printers.\n- The description is a full description of the print queue. A common use is a full printer name (like \"HP LaserJet 5P\").\n\n"
    },
    {
      "title": "CLI tools",
      "level": 3,
      "content": "See CUPS local documentation for more tips on the command-line tools.\n\nUse SNMP to find a URI:\n\n```\n$ /usr/lib/cups/backend/snmp ip_address\n```\n\n"
    },
    {
      "title": "lp*",
      "level": 4,
      "content": "The lpinfo command lists the URI of the printers connected to your system with the -v flag, and lists all of the available drivers (or \"models\", in CUPS parlance) installed on your system with -m.\n\nThe lpadmin utility creates a new queue with -p queue_name. The -E flag added to -p enables and accepts jobs on the printer. The -v flag specifies the device URI. The -m flag specifies the driver (or \"model\", in CUPS parlance) or PPD file to use.\n\nYou can also use the -x flag to remove a printer (read #cups* beforehand).\n\nExamples :\n\n```\n# lpadmin -p HP_DESKJET_940C -E -v \"usb://HP/DESKJET%20940C?serial=CN16E6C364BH\" -m drv:///HP/hp-deskjet_940c.ppd.gz\n```\n\nFor a driver-less queue (Apple AirPrint or IPP Everywhere):\n\n```\n# lpadmin -p AirPrint -E -v \"ipp://10.0.1.25/ipp/print\" -m everywhere\n```\n\nFor a raw queue; no PPD or filter:\n\n```\n# lpadmin -p SHARED_PRINTER -m raw\n```\n\nWhen specifying a PPD instead of a model:\n\n```\n# lpadmin -p Test_Printer -E -v \"ipp://10.0.1.3/ipp/print\" -m pxlmono.ppd\n```\n\n- When specifying the PPD, use just the file name and not the full path (for instance, pxlmono.ppd instead of /usr/share/ppd/cupsfilters/pxlmono.ppd). Alternatively, the full path can be used with the -P command line switch.\n- As of 2021, many recent printers support driverless printing setup and when specifying -m everywhere, as in the second example above, the printer will be defined and a .ppd file will be created in /etc/cups/ppd/ by querying the printer on the network.\n\nThe lpq utility checks the queue. Add the -a flag to check on all queue.\n\nThe lprm utility clears the queue. Add a - to remove all entries instead of only the last one by default.\n\nThe lpr utility prints. Use -# N to print the file N times, use the -p flag to add a header.\n\nExamples of test prints using lpr:\n\n```\n$ lpr /usr/share/cups/data/testprint\n$ echo 'Hello, world!' | lpr -p\n```\n\nThe lpstat utility, used with the -s flag, checks the status. The -p flag allows to specify which queue to check.\n\nThe lpoptions utility uses the same -p queue_name flag as lpadmin shown above. With the -l flag, it lists the options. The -d flag sets the default printer with the argument queue_name. The -o flag sets options to a value:\n\n```\n$ lpoptions -p HP_DESKJET_940C -o PageSize=A4\n$ lpoptions -p HP_DESKJET_940C -o cupsIPPSupplies=true -o Duplex=DuplexNoTumble\n```\n\n"
    },
    {
      "title": "cups*",
      "level": 4,
      "content": "The cupsaccept, cupsdisable, cupsenable and cupsreject utilities do as they are called. Respectively: setting the printer to accept jobs, disabling a printer, activating a printer, setting the printer to reject all incoming tasks.\n\nAs an example of their usage, we will cleanly remove a printer:\n\n```\n# cupsreject queue_name\n# cupsdisable queue_name\n# lpadmin -x queue_name\n```\n\n"
    },
    {
      "title": "ink",
      "level": 4,
      "content": "Install inkAUR to view the ink levels.\n\nAdd your user to the additional lp user group, log out and log in again.\n\nFor usage information, run ink without options.\n\n"
    },
    {
      "title": "Web interface",
      "level": 3,
      "content": "The CUPS server can be fully administered through the web interface, available on http://localhost:631/.\n\nTo perform administrative tasks from the web interface, authentication is required; see #Permissions.\n\nGo to the Administration page.\n\nGo to the Printers page, and select a queue to modify.\n\nGo to the Printers page, and select a queue.\n\n"
    },
    {
      "title": "GUI applications",
      "level": 3,
      "content": "If your user does not have sufficient privileges to administer CUPS, the applications will request the root password when they start. To give users administrative privileges without needing root access, see #Configuration.\n\n- Deepin Print Manager — Printer configuration interface for Deepin desktop.\n\n- GtkLP — GTK interface for CUPS.\n\n- print-manager — Tool for managing print jobs and printers (KDE).\n\n- system-config-printer — GTK printer configuration tool and status applet.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "The CUPS server configuration is located in /etc/cups/cupsd.conf and /etc/cups/cups-files.conf (see cupsd.conf(5) and cups-files.conf(5)). After editing either file, restart cups.service to apply any changes. The default configuration is sufficient for most users.\n\n"
    },
    {
      "title": "Groups",
      "level": 4,
      "content": "User groups with printer administration privileges are defined in SystemGroup in the /etc/cups/cups-files.conf. The sys and root and wheel groups are used by default.\n\nCUPS helper programs are run as the cups user and group. This allows the helper programs to access printer devices and read configuration files in /etc/cups/, which are owned by the cups group.\n\n"
    },
    {
      "title": "Allowing admin authentication through PolicyKit",
      "level": 4,
      "content": "PolicyKit can be configured to allow users to configure printers using a GUI without the admin password.\n\nHere is an example that allows members of the wheel user group to administer printers without a password:\n\n```\n/etc/polkit-1/rules.d/49-allow-passwordless-printer-admin.rules\n```\n\n```\npolkit.addRule(function(action, subject) { \n    if (action.id == \"org.opensuse.cupspkhelper.mechanism.all-edit\" && \n        subject.isInGroup(\"wheel\")){ \n        return polkit.Result.YES; \n    } \n});\n```\n\n"
    },
    {
      "title": "Default paper size",
      "level": 3,
      "content": "cups is built with libpaper support and libpaper defaults to the Letter paper size (called PageSize in lpoptions). To avoid having to change the paper size for each print queue you add, edit /etc/papersize and set your system default paper size. See paper(1).\n\n"
    },
    {
      "title": "Archival PDF/A",
      "level": 3,
      "content": "To save PDF files in the highly compatible format, normally called Archival PDF, or PDF/A, or PDFA, or ISO 19005.\n\nThere is currently no option, so it must be added to the command used by cups to call gs.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\n```\n/etc/cups/cups.conf\n```\n\n```\n# GSCall %s -q -dCompatibilityLevel=%s -dNOPAUSE -dBATCH -dSAFER  -sDEVICE=pdfwrite -sOutputFile=\"%s\" -dAutoRotatePages=/PageByPage -dAutoFilterColorImages=false -dColorImageFilter=/FlateEncode -dPDFSETTINGS=/prepress -c .setpdfwrite -f %s\n\t\t\t\n# the above line shows the default for the GSCall value. Add -dPDFA before -dNOPAUSE and remove the comment prefix: (do not copy the line from here as it might have changed. use the \"default\" from your own file)\nGSCall %s -q -dCompatibilityLevel=%s -dPDFA -dNOPAUSE -dBATCH -dSAFER  -sDEVICE=pdfwrite -sOutputFile=\"%s\" -dAutoRotatePages=/PageByPage -dAutoFilterColorImages=false -dColorImageFilter=/FlateEncode -dPDFSETTINGS=/prepress -c .setpdfwrite -f %s\n```\n\n"
    },
    {
      "title": "Log files",
      "level": 3,
      "content": "By default, all logs are sent to files in /var/log/cups/.\n\nThe log level can be changed in /etc/cups/cupsd.conf. See cupsd.conf documentation.\n\nBy changing the values of the AccessLog, ErrorLog, and PageLog directives in /etc/cups/cups-files.conf to syslog, CUPS can be made to log to the systemd journal instead. See Fedora:Changes/CupsJournalLogging for information on the original proposed change.\n\n"
    },
    {
      "title": "cups-browsed",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nCUPS can use Avahi browsing to discover unknown shared printers in your network. This can be useful in large setups where the server is unknown. To use this feature, set up .local hostname resolution, and start both avahi-daemon.service and cups-browsed.service. Jobs are sent directly to the printer without any processing so the created queues may not work, however driverless printers such as those supporting IPP Everywhere or AirPrint should work out of the box.\n\n- Searching for network printers may significantly increase the time it takes for your computer to boot.\n- cups-browsed.service is only needed to dynamically add and remove printers as they appear and disappear from a network. It is not required if you simply want to add a DNS-SD/mDNS supporting network printer to CUPS.\n\n"
    },
    {
      "title": "Print servers and remote administration",
      "level": 3,
      "content": "See CUPS/Printer sharing and CUPS/Printer sharing#Remote administration.\n\n"
    },
    {
      "title": "Without a local CUPS server",
      "level": 3,
      "content": "CUPS can be configured to directly connect to remote printer servers instead of running a local print server. This requires installation of the libcups package. Some applications will still require the cups package for printing.\n\nTo use a remote CUPS server, set the CUPS_SERVER environment variable to printerserver.mydomain:port. For instance, if you want to use a different print server for a single Firefox instance (substitute printserver.mydomain:port with your print server name/port):\n\n```\n$ CUPS_SERVER=printserver.mydomain:port firefox\n```\n\nTo make this configuration permanent create configuration file /etc/cups/client.conf and add a hostname of the remote CUPS server to it:\n\n```\nServerName server\n```\n\nYou can also specify a custom port:\n\n```\nServerName server:port\n```\n\nSee [4] for details.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "See CUPS/Troubleshooting and CUPS/Printer-specific problems.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Official CUPS documentation, locally installed\n- Wikipedia:CUPS\n- OpenPrinting homepage\n- OpenSuSE Concepts printing guide - explains the full printing workflow\n- OpenSuSE CUPS in a Nutshell - a quick CUPS overview\n- Gentoo:Printing\n- Debian's Printing portal - detailed technical guides\n- Debian's printing overview - a basic view of the CUPS printing system\n- CUPS printing-architecture and printing-users mailing lists\n- CUPS mailing list (Apple fork)\n- CUPS issues tracker\n- CUPS issues tracker (Apple fork)\n\n"
    }
  ]
}