{
  "title": "Privoxy (Italiano)",
  "url": "https://wiki.archlinux.org/title/Privoxy_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Tor\n\nPrivoxy is a filtering proxy for the HTTP protocol, frequently used in combination with Tor. Privoxy is a web proxy with advanced filtering capabilities for protecting privacy, filtering web page content, managing cookies, controlling access, and removing ads, banners, pop-ups, etc. It supports both stand-alone systems and multi-user networks.\n\n"
    },
    {
      "title": "Installation and setup",
      "level": 2,
      "content": "Install the privoxy package.\n\nWhen Privoxy is used in conjunction with Tor the two applications need to exchange information through a chain, which requires the specification of forwarding rules.\n\nFinally, if you plan to make Privoxy available to other computers in your network, just add the following to /etc/privoxy/config:\n\n```\nlisten-address [SERVER-IP]:[PORT]\n```\n\nFor example:\n\n```\nlisten-address 192.168.1.1:8118\n```\n\n"
    },
    {
      "title": "i2p",
      "level": 2,
      "content": "To forward .i2p sites through the I2P router, add the following to /etc/privoxy/config:\n\n```\nforward .i2p localhost:4444\n```\n\n"
    },
    {
      "title": "Forwarding through tor",
      "level": 2,
      "content": "Edit your /etc/privoxy/config file and add this line at the end (be sure to include the . at the end\n\n```\nforward-socks5 / localhost:9050 .\n```\n\nThis example uses the default port used by Tor. If you changed the port number modify the example accordingly. The same basic example is valid for other targets. If you plan on chaining to another proxy specify the method (here SOCKS5) and the port to suit your needs. Refer to section 5 of the manual inside /etc/privoxy/config for a complete list of options and examples.\n\nThe above will forward all browser traffic through Tor. To only forward .onion sites through Tor, use this instead:\n\n```\nforward-socks4a .onion localhost:9050 .\n```\n\n"
    },
    {
      "title": "Ad Blocking with Privoxy",
      "level": 2,
      "content": "Using an ad blocking extension in a web browser can increase page load time. Additionally, extensions like AdBlock Plus are not supported by all browsers. A useful alternative is to install system-wide ad blocking by setting a proxy address in your preferred browser.\n\nYou can use adblock plus filters. The privoxy blocklist script automatically downloads adblock plus filters, converts them to a privoxy friendly format, and edits privoxy's configuration file to include those filters:\n\n1. Run the script once to create /etc/conf.d/privoxy-blacklist\n1. Edit /etc/conf.d/privoxy-blacklist to uncomment the line PRIVOXY_USER= and the two lines below it.\n1. Run the script again to download and install the blocklists.\n1. Restart privoxy.\n\nTo block tracking via embedded Facebook \"Like\" button, Twitter \"follow\", and Google Plus \"+1\", edit /etc/privoxy/user.action and add these lines to the end:\n\n```\n{+block-as-image{Facebook \"like\" and similar tracking URLs.}}\nwww.facebook.com/(extern|plugins)/(login_status|like(box)?|activity|fan)\\.php\nplatform.twitter.com/widgets/follow_button?\nplusone.google.com\n```\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Start and enable privoxy.service.\n\nConfigure your program to use Privoxy. The default address is:\n\n```\nlocalhost:8118\n```\n\nFor Firefox, go to:\n\n```\nPreferences > General > Network Settings > Settings\n```\n\nFor Chromium you can use:\n\n```\n$ chromium --proxy-server=\"localhost:8118\"\n```\n\nAlternatively you can set http_proxy environment variable, which is respected by Firefox, Chromium and other applications:\n\n```\nhttp_proxy=\"http://localhost:8118\"\n```\n\nPrivoxy can be tested by accessing either http://config.privoxy.org or http://p.p.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Privoxy Official Website\n\n"
    }
  ]
}