{
  "title": "Prosody (Русский)",
  "url": "https://wiki.archlinux.org/title/Prosody_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Цитата с официального сайта:\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет prosody.\n\n"
    },
    {
      "title": "Опциональные зависимости",
      "level": 3,
      "content": "Опциональные зависимости prosody не являются обязательными для работы программы, однако добавляют полезные функции. Некоторые из этих зависимостей собираются и устанавливаются из AUR. Если вы не знакомы с процессом компиляции и установки пакетов из AUR, см. Arch User Repository (Русский)#Установка и обновление пакетов. Начиная с Prosody версии 0.11.2 необходима установка Lua 5.2.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Основной конфигурационный файл находится в /etc/prosody/prosody.cfg.lua. Информацию по настройке Prosody можно найти в документации Prosody. После внесения любых изменений синтаксис конфигурационного файла можно проверить запустив команду:\n\n```\n# luac5.2 -p /etc/prosody/prosody.cfg.lua\n```\n\nОтсутствие вывода означает, что синтаксис верный.\n\n"
    },
    {
      "title": "Аутентификация",
      "level": 3,
      "content": "В настройках по умолчанию используется mod_auth_internal_hashed. Если вы удалите эту строку, то по умолчанию будет использоваться mod_auth_internal_plain.\n\n"
    },
    {
      "title": "Логирование",
      "level": 3,
      "content": "Пакет prosody изначально настроен на сохранение логов в системном журнале. Это значит, что по умолчанию сообщения логов Prosody доступны в журнале systemd.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Запустите/включите службу prosody.service.\n\nПо умолчанию Prosody использует XMPP порты 5222 и 5269 для общения клиент-сервер и сервер-сервер соответственно. При необходимости настройте брандмауэр.\n\nВы можете управлять пользователями Prosody при помощи программы prosodyctl. Для добавления пользователя:\n\n```\n# prosodyctl adduser JID\n```\n\nСм. prosodyctl(1) для более подробной информации.\n\n"
    },
    {
      "title": "Регистрация пользователей",
      "level": 4,
      "content": "Prosody поддерживает стандарт XMPP с регистрацией через сторонний клиент, что даёт пользователям возможность самостоятельно регистрироваться за пределами клиента XMPP, а также изменять свои пароли. Хотя эта функция повышает удобство для пользователей, она лишает администраторов возможности модерировать процесс регистрации новых пользователей. В связи с этим модуль register доступен в конфигурации по умолчанию, однако строка allow_registration имеет аргумент false. Таким образом существующие пользователи могут изменять свои пароли вне клиента, но самостоятельная регистрация новых пользователей невозможна.\n\n"
    },
    {
      "title": "Шифрование потоков",
      "level": 4,
      "content": "В Prosody могут использоваться сертификаты TLS для шифрования сообщений между клиентом и сервером (если установлены необходимые зависимости). Для настройки использования этих сертификатов в Prosody см. соответствующий раздел prosody.cfg.lua.\n\nДля обязательного шифрования сообщений между клиентом и сервером добавьте следующие строки в ваш конфигурационный файл:\n\n```\n/etc/prosody/prosody.cfg.lua\n```\n\n```\nHost \"*\"\n\n    c2s_require_encryption = true\n```\n\nТо же самое вы можете сделать для обмена сообщениями между сервером и сервером:\n\n```\n/etc/prosody/prosody.cfg.lua\n```\n\n```\nHost \"*\"\n\n    s2s_require_encryption = true\n```\n\nХотя шифрование между клиентом и сервером является хорошей идеей, следует помнить, что некоторые популярные сервисы XMPP, например Google Talk/Gmail, не поддерживают шифрование между сервером и сервером.\n\n"
    },
    {
      "title": "Списки пользователей",
      "level": 3,
      "content": "Увидеть список зарегистрированных пользователей можно при помощи команды\n\n```\n# ls -l /var/lib/prosody/*/accounts/*\n```\n\nв качестве альтернативы вы можете скачать модуль mod_listusers.lua и использовать следующую команду\n\n```\n# prosodyctl mod_listusers\n```\n\n"
    },
    {
      "title": "Удаление",
      "level": 2,
      "content": "После удаления пакетов Prosody через pacman в файловой системе могут остаться каталоги /etc/prosody и /var/lib/prosody, которые вы также можете удалить, если не планируете заново устанавливать Prosody.\n\n"
    },
    {
      "title": "Компоненты",
      "level": 3,
      "content": "Prosody поддерживает компоненты XMPP, которые предоставляют дополнительные возможности для клиентов. Эти компоненты могут предоставляться внутри, при помощи специальных модулей Prosody, или внешне, при помощи протокола, указанного в XEP-0114.\n\nNote: **приведёт** \n\nПо умолчанию Prosody проверяет наличие внешних компонентов. Если вы не планируете использовать какие-либо внешние компоненты в Prosody, вы можете отключить эту функцию, добавив следующую строку в конфигурационный файл:\n\n```\n/etc/prosody/prosody.cfg.lua\n```\n\n```\ncomponent_ports = {}\n```\n\n"
    },
    {
      "title": "Многопользовательский чат",
      "level": 4,
      "content": "Одним из основных компонентов серверов XMPP является многопользовательский чат (MUC), позволяющий пользователям общаться в режиме конференции. Многопользовательский чат предоставляется в виде внутреннего компонента вместе с Prosody. Для его активации в конфигурационный файл необходимо добавить следующую строку:\n\n```\n/etc/prosody/prosody.cfg.lua\n```\n\n```\nComponent \"conference.example.com\" \"muc\"\n```\n\nБлагодаря этому компонент многопользовательского чата активируется на стороне хоста conference.example.com.\n\n"
    },
    {
      "title": "Модули Prosody",
      "level": 3,
      "content": "Модули Prosody - это набор дополнительных модулей, предоставляемых отдельно от Prosody. Эти модели находятся на разных стадиях разработки, от экспериментальной до стабильной. Для более подробной информации смотрите вики-страницу, на которой размещена информация о модулях. Примером дополнительного модуля является pastebin, который преобразует длинные сообщения (например, данные логов) в ссылку на фрагмент текста, хранящийся на внутреннем HTTP-сервере Prosody (предоставляемом основным модулем httpserver).\n\nДля подключения дополнительного модуля необходимо скачать двоичный файл из источника. В качестве более простой альтернативы можно воспользоваться инструментом Mercurial и клонировать весь репозиторий:\n\n$ hg clone https://hg.prosody.im/prosody-modules/ prosody-modules\n\n$ hg clone http://0-8.prosody-modules.googlecode.com/hg/ prosody-modules\n\nТеперь можно копировать модуль (и все необходимые файлы) в каталог модулей Prosody /usr/lib/prosody/modules. Для активации модуля его необходимо добавить в список modules_enabled в файле prosody.cfg.lua для хоста или компонента, которые будут использовать этот модуль. Например, чтобы использовать модуль pastebin для компонента многопользовательского чата необходимо добавить следующие строки:\n\n```\n/etc/prosody/prosody.cfg.lua\n```\n\n```\nComponent \"conference.example.com\" \"muc\"\n    modules_enabled = { \"pastebin\" }\n```\n\n"
    },
    {
      "title": "Командная строка",
      "level": 3,
      "content": "Note: **не** \n\nПри помощи модуля console пользователю предоставляется терминал с протоколом telnet, через который можно осуществлять операции и запросы от имени администратора. Подключиться к терминалу можно при помощи команды:\n\n$ telnet localhost 5582\n\nВам также потребуется программа для работы с telnet, включённая в пакет inetutils. Используйте команду help в терминале для получения более подробной информации об использовании.\n\nИспользование символа > в начале команды позволяет выполнять команды на языке Lua через консоль напрямую на сервере. К примеру, проверить сжатие соединения клиента можно следующей командой:\n\n> full_sessions[\"romeo@montague.lit/Resource\"].compressed\n\nФлаг true означает наличие сжатия, а флаг nil означает его отсутствие.\n\n"
    },
    {
      "title": "Устранение неполадок",
      "level": 2,
      "content": "Одним из базовых принципов Prosody является простота конфигурации и использования. Однако, как и в случае любого сложного ПО, это не избавляет от сбоев. В случае возникновения проблем у пользователя есть множество путей её решения:\n\n- Изучите список известных проблемОзнакомьтесь с информацией о вашей версии Prosody в соответствующем разделе release notes чтобы найти жалобы на такую же проблему. Кроме того, проверьте issue tracker на наличие возможного решения вашей проблемы.\n- Проверьте синтаксис конфигурацииЗапустите luac5.1 -p /etc/prosody/prosody.cfg.lua для поиска каких-либо ошибок в синтаксисе конфигурационного файла. Пустой вывод означает отсутствие ошибок.\n- Проверьте логВ лог попадают только серьёзные сбои, поэтому их следует проверять всегда. Если вы полагаете, что ваша проблема не настолько серьёзная (например, проблема совместимости протокола между клиентами и серверами Prosody), вы можете включить уровень логирования debug.\n- Проверьте праваПри установке пакета Prosody в систему добавляется новый пользователь и группа prosody, которые получают необходимые права. Не будет лишним проверить их правильность. Следует убедиться, что пользователь prosody является владельцем /etc/prosody и /var/lib/prosody и у него есть необходимые права на чтение и запись всех расположенных там файлов.\n- Проверьте прослушиваемые портыПри решении проблем с подключением следует убедиться, что Prosody прослушивает соединения. Для этого нужно запустить команду ss -tul и проверить xmpp-client (port 5222) и xmpp-server (port 5269).\n- Перезапустите сервисКак и во многих других случаях, стоит попробовать перезапустить prosody.service и посмотреть на результат.\n\nЕсли вы не можете решить возникающую проблему самостоятельно, существует множество ресурсов, на которых можно поискать помощь. Ниже приведены некоторые из них:\n\n1. XMPP Conference: prosody@conference.prosody.im\n1. Почтовая рассылка: prosody-users@googlegroups.com, web-интерфейс\n1. Arch Forums (проблемы с пакетами)\n\n"
    },
    {
      "title": "Разработка",
      "level": 2,
      "content": "Поддержка пакетов Prosody для разработчиков осуществляется в AUR, prosody-hgAUR. prosody-hg отслеживает репозиторий Mercurial для Prosody, и всегда содержит актуальный код. Оба пакета схожи со стабильной версией.\n\n"
    },
    {
      "title": "Обратная связь",
      "level": 2,
      "content": "- Почтовая рассылка: prosody-dev, prosody-users\n- Конференция: prosody@conference.prosody.im\n- Блог: Prosodical Thoughts\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальная документация\n- Prosodical Thoughts (Блог)\n- Issue Tracker\n- Prosody Modules (Дополнительные модули)\n\n"
    }
  ]
}