{
  "title": "PulseAudio/Примеры",
  "url": "https://wiki.archlinux.org/title/PulseAudio/%D0%9F%D1%80%D0%B8%D0%BC%D0%B5%D1%80%D1%8B",
  "sections": [
    {
      "title": "Настройка стандартных устройств ввода",
      "level": 2,
      "content": "Показать доступные устройства ввода:\n\n```\n$ pacmd list-sources | grep -e device.string -e 'name:'\n```\n\n```\nname: <input>\n device.string = \"hw:2\"\nname: <oss_input.dsp>\n device.string = \"/dev/dsp\"\nname: <alsa_output.pci-0000_04_01.0.analog-stereo.monitor>\nname: <combined.monitor>\n```\n\nЧтобы установить их как устройства по умолчанию для всей системы, добавьте названия источников в файл /etc/pulse/default.pa\n\n```\nset-default-source alsa_output.pci-0000_04_01.0.analog-stereo.monitor\n```\n\nДля временного использования\n\n```\n$ pacmd \"set-default-source alsa_output.pci-0000_04_01.0.analog-stereo.monitor\"\n```\n\n"
    },
    {
      "title": "Установка стандартного устройства вывода",
      "level": 2,
      "content": "Определите правильное имя нового источника, который содержит * в начале индекса:\n\n```\n$ pacmd list-sinks | grep -e 'name:' -e 'index'\n```\n\n```\n* index: 0\n\tname: <alsa_output.pci-0000_04_01.0.analog-stereo>\n    index: 1\n\tname: <combined>\n```\n\nДля установки его как устройства по умолчанию для всей системы, добавьте следующее в /etc/pulse/default.pa\n\n```\nset-default-sink alsa_output.pci-0000_04_01.0.analog-stereo\n```\n\nКогда вы закончите, можете выйти/войти в систему или перезапустить PulseAudio вручную, чтобы изменения вступили в силу.\n\n- Устройства вывода, которые установлены по умолчанию отмечены * в начале индекса.\n- Нумерация устройств вывода не гарантируется быть постоянной, поэтому все устройства вывода в файле default.pa должны быть идентифицированы по имени.\n- Для быстрой идентификации во время выполнения (например, для управления громкости звука), вы можете использовать индекс устройства вывода вместо имени устройства вывода:$ pactl set-sink-volume 0 +3% $ pactl set-sink-volume 0 -- -3% $ pactl set-sink-mute 0 toggle\n- Чтобы избежать ненужных изменений в 100% нормальном звуке, лучше использовать альтернативные утилиты менеджмента звука. См. тему на форуме (Англ.) для доп. информации\n\n```\n$ pactl set-sink-volume 0 +3%\n$ pactl set-sink-volume 0 -- -3%\n$ pactl set-sink-mute 0 toggle\n```\n\n"
    },
    {
      "title": "Одновременный HDMI и аналоговый вывод",
      "level": 2,
      "content": "PulseAudio позволяет одновременный вывод в множество источников. В этом примере, некоторые приложения настроены использовать HDMI, в то время как некоторые настроены использовать аналоговый вывод. Отправлять звук можно в несколько приложений сразу.\n\n```\n$ aplay -l\n**** List of PLAYBACK Hardware Devices ****\ncard 0: Intel [HDA Intel], device 0: ALC889A Analog [ALC889A Analog]\n  Subdevices: 0/1\n  Subdevice #0: subdevice #0\ncard 0: Intel [HDA Intel], device 1: ALC889A Digital [ALC889A Digital]\n  Subdevices: 1/1\n  Subdevice #0: subdevice #0\ncard 0: Intel [HDA Intel], device 3: HDMI 0 [HDMI 0]\n  Subdevices: 0/1\n  Subdevice #0: subdevice #0\n```\n\nИли используя команду pacmd:\n\n```\n$ pacmd list-sinks  | grep -e 'name:'  -e 'alsa.device ' -e 'alsa.subdevice '\n```\n\n```\nname: <alsa_output.pci-0000_00_1b.0.analog-stereo>\n\t\talsa.subdevice = \"0\"\n\t\talsa.device = \"0\"\n```\n\nГлавное в файле конфигурации вроде этого - понять, что устройство, выбранное в pavucontrol в Configuration > Internal Audio - стандартное. Используйте pavucontrol > Configuration и выберите HDMI в качестве профиля.\n\nЧтобы установить аналоговое утройство как вторичное устройство вывода, добавьте следующее в начало конфигурационного фала /etc/pulse/default.pa, перед тем, как начнётся загрузка модулей:\n\n```\n### Загрузите аналогое устройство\nload-module module-alsa-sink device=hw:0,0\nload-module module-combine-sink sink_name=combined\nset-default-sink combined\n```\n\nПерезапустите PulseAudio, запустите pavucontrol и выберите пункт \"Output Devices\". Вы должны увидеть следующие настройки:\n\n1. Internal Audio Digital Stereo (HDMI)\n1. Internal Audio\n1. Simultaneous output to Internal Audio Digital Stereo (HDMI), Internal Audio\n\nТеперь запустите программу, которая будет использовать PulseAudio, такую как MPlayer, VLC, mpd, и т.д. и переключитесь во вкладку \"Воспроизведение\". Выпадающий список должен предоставить выбор из трёх устройств.\n\nТак же см. этот пост и PulseAudio FAQ для вариаций по этой теме.\n\n"
    },
    {
      "title": "Настройка HDMI вывода",
      "level": 2,
      "content": "Как выделено в ftp://download.nvidia.com/XFree86/gpu-hdmi-audio-document/gpu-hdmi-audio.html#_issues_in_pulseaudio, пока HDMI порт - первое устройство вывода, PulseAudio не сможет использовать любое другое аудио при использовании некоторых видеокарт с поддержкой HDMI. Это происходит из-за бага PulseAudio, из-за которого он может выбрать только первый HDMI, как устройство вывода. Обход этой проблемы, написан ниже - найти, какой HDMI вывод работает с помощью aplay из ALSA.\n\nПроблема в основном возникает с некоторыми картами от nVidia и некоторыми другими, см. эту тему на форуме\n\n"
    },
    {
      "title": "Поиск HDMI вывода",
      "level": 3,
      "content": "Далее найдите рабочий вывод из списка доступных карт\n\n```\n# aplay -l\n```\n\n```\nпримерный вывод:\n **** List of PLAYBACK Hardware Devices ****\n card 0: NVidia [HDA NVidia], device 0: ALC1200 Analog [ALC1200 Analog]\n   Subdevices: 1/1\n   Subdevice #0: subdevice #0\n card 0: NVidia [HDA NVidia], device 3: ALC1200 Digital [ALC1200 Digital]\n   Subdevices: 1/1\n   Subdevice #0: subdevice #0\n card 1: NVidia_1 [HDA NVidia], device 3: HDMI 0 [HDMI 0]\n   Subdevices: 1/1\n   Subdevice #0: subdevice #0\n card 1: NVidia_1 [HDA NVidia], device 7: HDMI 0 [HDMI 0]\n   Subdevices: 0/1\n   Subdevice #0: subdevice #0\n card 1: NVidia_1 [HDA NVidia], device 8: HDMI 0 [HDMI 0]\n   Subdevices: 1/1\n   Subdevice #0: subdevice #0\n card 1: NVidia_1 [HDA NVidia], device 9: HDMI 0 [HDMI 0]\n   Subdevices: 1/1\n   Subdevice #0: subdevice #0\n```\n\n"
    },
    {
      "title": "Проверка на правильную карту",
      "level": 3,
      "content": "Теперь, когда у вас есть список карт, пользователям нужно проверить, какая из них выводит на ТВ/Монитор\n\n```\n# aplay -D plughw:1,3 /usr/share/sounds/alsa/Front_Right.wav\n```\n\nГде 1 - карта, а 3 - устройство-замена в предыдущих разделах. Если звука нет, попробуйте другое устройство-замену (на моей карте пришлось использовать карту 1 устройство 7)\n\n"
    },
    {
      "title": "Ручная настройка PulseAudio, чтобы он находил HDMI Nvidia",
      "level": 3,
      "content": "Чтобы заставить PulseAudio находить HDMI, нужно отредактировать /etc/pulse/default.pa:\n\n```\n# load-module module-alsa-sink device=hw:1,7\n```\n\nгде 1 - карта, а 7 - устройство,найденное в предыдущем разделе перезапустите pulse audio\n\n```\n$ pulseaudio -k\n $ pulseaudio --start\n```\n\nоткройте менеджер настройки аудио, убедитесь в том, что во вкладке \"hardware\" - графическая карта с HDMI установлена как \"Digital Stereo (HDMI) Output\" (Моя карта называлась \"GF100 High Definition Audio Controller\")\n\nДалее, откройте вкладку вывода. Теперь там должно быть два выхода HDMI для графической карты. Проверьте, какой работает, выбрав один из них, а затем воспроизведите любое аудио. Например, запустите фильм с помощью VLC, и если выход не работает, выберите следующий.\n\n"
    },
    {
      "title": "Автоматическое переключение звука на HDMI",
      "level": 3,
      "content": "Создайте скрипт для переключения на желаемый профиль при присоединении кабеля HDMI:\n\n```\n/usr/local/bin/hdmi_sound_toggle.sh\n```\n\n```\n#!/bin/bash\nUSER_NAME=$(w -hs | awk -v vt=tty$(fgconsole) '$0 ~ vt {print $1}')\nUSER_ID=$(id -u \"$USER_NAME\")\nHDMI_STATUS=$(</sys/class/drm/card0/*HDMI*/status)\n\nexport PULSE_SERVER=\"unix:/run/user/\"$USER_ID\"/pulse/native\"\n\nif [[ $HDMI_STATUS == connected ]]\nthen\n   sudo -u \"$USER_NAME\" pactl --server \"$PULSE_SERVER\" set-card-profile 0 output:hdmi-stereo+input:analog-stereo\nelse\n   sudo -u \"$USER_NAME\" pactl --server \"$PULSE_SERVER\" set-card-profile 0 output:analog-stereo+input:analog-stereo\nfi\n```\n\nСделайте скрипт исполняемым:\n\n```\nchmod +x /usr/local/bin/hdmi_sound_toggle.sh\n```\n\nСоздайте правило udev для запуска этого сценария, когда статус HDMI изменится:\n\n```\n/etc/udev/rules.d/99-hdmi_sound.rules\n```\n\n```\nKERNEL==\"card0\", SUBSYSTEM==\"drm\", ACTION==\"change\", RUN+=\"/usr/bin/systemctl start hdmi_sound_toggle.service\"\n```\n\nИ, наконец, создайте файл .service требуемый правилом udev:\n\n```\n/etc/systemd/system/hdmi_sound_toggle.service\n```\n\n```\n[Unit]\nDescription=hdmi sound hotplug\n\n[Service]\nType=simple\nRemainAfterExit=no\nExecStart=/usr/local/bin/hdmi_sound_toggle.sh\n\n[Install]\nWantedBy=multi-user.target\n```\n\nДля того чтобы внесённые изменения вступили в силу, не забудьте перезагрузить правила udev:\n\n```\nudevadm control --reload-rules\n```\n\nТакже, вам необходимо перезагрузить компоненты systemd.\n\n```\nsystemctl daemon-reload\n```\n\nМожет потребоваться перезагрузка.\n\n"
    },
    {
      "title": "Настройка объёмного звука",
      "level": 2,
      "content": "У многих людей есть звуковая карта с поддержкой объёмного звука, но устройства воспроизведения поддерживают только 2 канала. PulseAudio не может выставить звуковую настройку для объёмного звука по умолчанию. Чтобы включить все каналы, измените /etc/pulse/daemon.conf: раскомментируйте строку default-sample-channels и выставьте значение 6 для 5.1 или 8 для 7.1 и т.д.\n\n```\n# Стандартное\ndefault-sample-channels=2\n# Для 5.1\ndefault-sample-channels=6\n# Для 7.1\ndefault-sample-channels=8\n```\n\nЕсли каналы неправлено назначены или регуляция звука для отдельных каналов в pavucontrol работает неправильно, и у вас есть HDMI и аналоговая звуковая карта, попробуйте добавить эту строку в /etc/pulse/default.pa\n\n```\nload-module module-combine channels=6 channel_map=front-left,front-right,rear-left,rear-right,front-center,lfe\n```\n\nОбратите внимание, что это пример для настройки 5.1.\n\nПосле этого перезапустите PulseAudio\n\n"
    },
    {
      "title": "Отключение UCM/\"HiFi\"",
      "level": 3,
      "content": "В большинстве руководств по настройке объёмного звука в PulseAudio говорится, что нужно выбрать правильный профиль объёмного звука для вашей карты/HDMI-выхода, что можно сделать на вкладке «Конфигурация» в pavucontrol. Однако вы можете обнаружить, что единственным профилем для вашей карты является «HiFi: Play HiFi quality Music», который не является профилем для объёмного звука. Из-за этого вы можете потратить кучу времени, пытаясь создать профиль для вашей карты или правильно настроить правила udev, но всё это не поможет.\n\nНа самом деле это связано с тем, что у вас установлен alsa-ucm-conf, поэтому PulseAudio игнорирует свои собственные профили и пытается использовать вместо них профили ALSA Use Case Manager. К сожалению, если ALSA UCM не имеет нужного вам профиля, вы останетесь с 2-канальным «HiFi» по умолчанию. К счастью, это можно исправить, переключившись обратно на профили PulseAudio, которые по умолчанию используют конфигурацию объёмного звука для звуковых карт/HDMI-выходов с поддержкой объёмного звука.\n\nСамый простой способ сделать это — отредактировать файл /etc/pulse/default.pa:\n\n```\nload-module module-udev-detect use_ucm=0\n```\n\nПосле редактирования перезагрузите пользовательский юнит pulseaudio.service.\n\nПосле этого ваша установка PulseAudio будет игнорировать UCM и использовать профили PulseAudio, среди которых, если вы изменили свои default-sample-channels в соответствии с приведёнными выше инструкциями, будет и профиль объёмного звука. Вы можете проверить это на вкладке «Конфигурация» в pavucontrol, где больше не должно быть профиля «HiFi».\n\n"
    },
    {
      "title": "Разделение передний/задний",
      "level": 3,
      "content": "Подключите устройство к переднему аналоговому выходу и наушники - к заднему. Будет полезно разделить передний/задний устройства вывода. Добавьте следующее в /etc/pulse/default.pa:\n\n```\nload-module module-remap-sink sink_name=speakers remix=no master=alsa_output.pci-0000_05_00.0.analog-surround-40 channels=2 master_channel_map=front-left,front-right channel_map=front-left,front-right\n load-module module-remap-sink sink_name=headphones remix=no master=alsa_output.pci-0000_05_00.0.analog-surround-40 channels=2 master_channel_map=rear-left,rear-right channel_map=front-left,front-right\n```\n\nУбедитесь, что заменили alsa_output.pci-0000_05_00.0.analog-surround-40 названием своей звуковой картой, которое можно увидеть в 'pacmd list-sinks'. Теперь у вас есть 2 дополнительных устройства вывода, которые можно использовать раздельно. Вы можете подобрать название 'sink_name' сами, важно, чтобы оно не совпадало с существующими именами. Параметр 'remix' контролирует, в каком из устройств стоит поднять/опустить стандартный звук для совпадением с каналами устройств вывода.\n\n"
    },
    {
      "title": "Разделение 7.1 на 5.1+2.0",
      "level": 3,
      "content": "По примеру выше, вы также можете поделить 7.1 на 5.1 и стерео. Установите режим карты на 7.1, затем добавьте эти строки в /etc/pulse/default.pa:\n\n```\nload-module module-remap-sink sink_name=Surround remix=no master=alsa_output.pci-0000_00_14.2.analog-surround-71 channels=6 master_channel_map=front-left,front-right,rear-left,rear-right,front-center,lfe channel_map=front-left,front-right,rear-left,rear-right,front-center,lfe\n load-module module-remap-sink sink_name=Stereo remix=yes master=alsa_output.pci-0000_00_14.2.analog-surround-71 channels=2 master_channel_map=front-left,front-right channel_map=front-left,front-right\n```\n\nУбедитесь, что заменили alsa_output.pci-0000_00_14.2 именем своей звуковой карты, которое можно получить, запустив 'pacmd list-sinks'. Эта конфигурация будет использовать передние/задние/центральные+lfe(зелёный/черный/оранжевый) разъемы для 5.1 и боковой (серый) разъем для стерео. Это также уменьшит любое аудио до стерео для стерео выхода, но не затронет 5.1.\n\n"
    },
    {
      "title": "Отключение ремиксинга LFE",
      "level": 3,
      "content": "По умолчанию, PusleAudio преобразует число каналов в соответствии с default-sample-channels и, начиная с версии 7, также преобразует канал LFE. Если вы хотите отключить преобразование LFE, раскомментируйте строку:\n\n```\n; enable-lfe-remixing = yes\n```\n\nи замените yes на no :\n\n```\nenable-lfe-remixing = no\n```\n\nзатем перезапустите PulseAudio.\n\n"
    },
    {
      "title": "Бинауральные наушники",
      "level": 3,
      "content": "ladspa-bs2bAUR предоставляет плагин для симуляции объемного стереозвучания в наушниках. Для его использования найдите свои наушники с помощью команды:\n\n```\n$ pacmd list-sinks | grep -e 'name:'\n```\n\n```\nname: <alsa_output.pci-0000_00_1b.0.iec958-ac3-surround-51>\n\tname: <alsa_output.pci-0000_00_1b.0.iec958-ac3-surround-51.equalizer>\n\tname: <bluez_sink.00_1F_82_28_93_51>\n```\n\nЗагрузите плагин (новое sink_name задается произвольно, master=название устройства вывода (наушников)):\n\n```\npacmd load-module module-ladspa-sink sink_name=binaural master=bluez_sink.00_1F_82_28_93_51 plugin=bs2b label=bs2b control=700,4.5\n```\n\nИспользуйте pavucontrol для передачи потока на новое устройство вывода или:\n\n```\npactl move-sink-input $INPUTID $BINAURALSINKNAME\n```\n\n"
    },
    {
      "title": "PulseAudio через сеть",
      "level": 2,
      "content": "Одна из уникальных функций PulseAudio - возможность передачи аудио от клиентов через TCP к серверу, запущенному PulseAudio демоном в локальной сети. Убедитесь, что серверная и клиентская системы синхронизированы по времени (например, посредством NTP), в противном случае аудио поток будет 'заикаться' или вовсе не работать.\n\nЧтобы сделать это доступным, нужно включить module-native-protocol-tcp.\n\n"
    },
    {
      "title": "Поддержка TCP (звук через сеть)",
      "level": 3,
      "content": "Чтобы включить TCP модуль, добавьте это (или раскомментируйте, если уже есть) в /etc/pulse/default.pa на клиенте и сервере:\n\n```\nload-module module-native-protocol-tcp\n```\n\nЧтобы это работало, клиент и сервер должны разделять общий cookie. Убедитесь, что клиент и сервер разделяют один cookie файл в ~/.config/pulse/cookie. Не важно, чей файл они используют (клиента/сервера), просто удостоверьтесь, что это один и тот же файл.\n\nОбратите внимание, если с подключением возникают проблемы, используйте (на сервере)\n\n```\npacmd list-modules\n```\n\n"
    },
    {
      "title": "Поддержка TCP с анонимными клиентами",
      "level": 3,
      "content": "Если отсутствует возможность копировать cookie файл с клиентских машин, анонимные клиенты могут получить доступ к серверу, если добавить следующий параметр в module-native-protocol-tcp на сервере(снова в /etc/pulse/default.pa):\n\n```\nload-module module-native-protocol-tcp auth-ip-acl=127.0.0.1;192.168.0.0/24 auth-anonymous=1\n```\n\nИзмените LAN IP подсети для клиентов, которым вы желаете предоставить доступ.\n\n"
    },
    {
      "title": "Zeroconf (Avahi)",
      "level": 3,
      "content": "Чтобы удалённый PulseAudio сервер появился в списке устройств PulseAudio Device Chooser (pasystray), загрузите нужные модули zeroconf и включите Avahi daemon.\n\nУстановите на клиенте и сервере pulseaudio-zeroconf.\n\nНа обеих машинах запустите и включите systemd юнит avahi-daemon.\n\nНа сервере добавьте load-module module-zeroconf-publish в файл /etc/pulse/default.pa, на клиенте - load-module module-zeroconf-discover в /etc/pulse/default.pa. Теперь перенаправьте любой поток или весь аудио выход на удаленный сервер PulseAudio, выбрав соответствующее устройство вывода.\n\nЕсли вы испытываете проблемы с удаленной синхронизацией на клиентской машине, попробуйте перезапустить демон Avahi на сервере, чтобы переотправить доступные интерфейсы.\n\n"
    },
    {
      "title": "Переключение PulseAudio сервера используя локальные клиенты Х",
      "level": 3,
      "content": "Чтобы переключатся между серверами на клиенте в пределах X, можно использовать команду pax11publish. Например, чтобы переключится со стандартного сервера на хост foo:\n\n```\n$ pax11publish -e -S foo\n```\n\nИ чтобы вернутся обратно:\n\n```\n$ pax11publish -e -r\n```\n\nЭто отредактирует переменные PulseAudio в корневом окне X11, что сообщит клиентским библиотекам PulseAudio о том, что нужно соединяться с сервером PulseAudio, а не с localhost, вместо того чтобы заставлять сервер PulseAudio вещать аудио (как описано выше). Таким образом, программы больше не будут взаимодействовать с локальным процессом pulseaudio, который затем может быть остановлен. Такие программы, как pactl, pacmd или pavucontrol также необходимо будет запустить с соответствующим PULSE_SERVER окружением/переменным X, для управления удалённым сервером PulseAudio.\n\nОбратите внимание, что переключение станет заметным, когда программы использующие Pulse будут перезапущены, или их клиентская библиотека PulseAudio переинициализирована (может быть достаточно полной остановки и перезапуска воспроизведения). Для того чтобы эти изменения оставались постоянными, отредактируйте default-server в ~/.config/pulse/client.conf или /etc/pulse/client.conf.\n\n"
    },
    {
      "title": "Выбор сервера",
      "level": 3,
      "content": "Запустите программу PulseAudio Volume Control pavucontrol. Во вкладке Устройства вывода вы должны увидеть список локальных и удаленных устройств вывода. На вкладке Проигрывание, слева от кнопки \"X\" Заглушить звук (Mute Audio), вы должны увидеть выпадающий список устройств вывода. Список содержит доступные устройства вывода, и в нем выделено текущее устройство. Переключение устройства вывода позволит аудиопотоку сменить сервер PulseAudio, связанный с этим устройством. Данное управление остается неясным до самого момента его использования, и является особенно полезным при работы с удаленным автономным звуковым сервером.\n\nАналогично, на вкладке Устройства ввода отображены локальные и удаленные устройства ввода. И на вкладке Запись расположен выпадающий список, содержащий доступные устройства ввода.\n\nДля направления аудиопотока, запускайте pavucontrol локально или на удаленной машине, в зависимости от его связей. Например, запускайте pavucontrol на удаленной машине для направления аудио вывода на локальную. И запускайте pavucontrol локально для направления аудио вывода на удаленную машину.\n\nС настройкой одновременных выводов или вводов дело обстоит иначе. Для этого ознакомьтесь с информацией о \"monitor\" и \"module-combine-sink\".\n\n"
    },
    {
      "title": "Если всё остальное не работает",
      "level": 3,
      "content": "Это НЕ постоянное решение, лишь временное исправление проблемы\n\nНа сервере:\n\n```\n$ paprefs\n```\n\nВ Network Access -> Включите доступ к локальным устройствам звука (Также включите 'Allow discover' и 'Don't require authentication').\n\nНа клиенте:\n\n```\n$ export PULSE_SERVER=server.ip && mplayer test.mp3\n```\n\n"
    },
    {
      "title": "ALSA monitor source",
      "level": 2,
      "content": "Чтобы иметь возможность записывать из monitor source (a.k.a. \"What-U-Hear\", \"Stereo Mix\"), используйте pactl list чтобы найти имя источника в PulseAudio (напр.alsa_output.pci-0000_00_1b.0.analog-stereo.monitor). Затем добавьте следующие строки в /etc/asound.conf или ~/.asoundrc:\n\n```\npcm.pulse_monitor {\n  type pulse\n  device alsa_output.pci-0000_00_1b.0.analog-stereo.monitor\n}\n\nctl.pulse_monitor {\n  type pulse\n  device alsa_output.pci-0000_00_1b.0.analog-stereo.monitor\n}\n```\n\nТеперь вы можете выбрать pulse_monitor как устройство записи.\n\nКак альтернативу, вы можете использовать pavucontrol.Чтобы сделать это: убедитесь, что он настроен показывать ВСЕ устройства ввода, затем выберите \"Monitor of [ваша звуковая карта]\" как устройство записи.\n\n"
    },
    {
      "title": "Наблюдение конкретного вывода",
      "level": 2,
      "content": "Есть возможность наблюдать конкретный вывод, например, чтобы передавать аудио из плеера в VOIP-приложение. Просто создайте пустое устройство вывода:\n\n```\npactl load-module module-null-sink sink_name=<имя>\n```\n\nВ Настройках Звука Pulseaudio (pavucontrol), во вкладе \"Playback\", измените устройство вывода приложния на <имя>, и во вкладке записи измените устройство ввода приложения на \"Monitor of <имя>\". Теперь аудио будет поступать из одного приложения в другое.\n\n"
    },
    {
      "title": "PulseAudio через JACK",
      "level": 2,
      "content": "JACK Audio Connection Kit популярен для работы со звуком и широко поддерживается аудиоприложениями Linux. Он занимает совместную с PulseAudio нишу, но с акцентом в сторону профессиональной работы со звуком. Он может предложить аудиомониторинг с низкой временной задержкой вместе с большим контролем за вводом и выводом множественных звуковых устройств ввода-вывода.\n\n"
    },
    {
      "title": "Метод KXStudio",
      "level": 3,
      "content": "Это рекомендуемый способ, так как он был официально одобрен разработчиками JACK.\n\nЭта настройка работает с обоими пакетами jack2-dbus и jack2.\n\nВ текущий момент JACK обладает способностью переключаться между ALSA, PulseAudio и JACK. Это дает вам возможность одновременно запускать JACK и PulseAudio и получать их вывод без каких-либо дополнительных настроек или команд терминала.\n\nПеред началом последующих действий рекомендуется удалить пакет qjackctl, если вы его используете.\n\nНачните с установки cadenceAUR из AUR или pulseaudio-jack. Как только вы установите и запустите его, в нижнем правом углу экрана должен появиться JACK bridge configuration. ALSA audio bridge следует настроить как ALSA -> PulseAudio -> JACK и включить PulseAudio bridge. Убедитесь с помощью pavucontrol, что все устройства ввода и вывода, не относящиеся к JACK, выключены (muted). Воспользуйтесь кнопкой Force Restart для запуска JACK, и, если все запустилось успешно, вывод программ PulseAudio будет перенаправлен через JACK.\n\n"
    },
    {
      "title": "Ручная настройка устройств вывода",
      "level": 3,
      "content": "Этот способ позволяет обеспечить одновременную работу JACK и PulseAudio и обмен выводом между собой. В этом случае используется ручная настройка систем, которая обеспечивает связь между JACK и PulseAudio. Эта конфигурация не опирается на скрипты или команды, и полностью основана на работе с настройками.\n\nРассматриваемый метод работает только с jackdbus (JACK2 скомпилированный с поддержкой D-Bus). Вам также потребуется пакет pulseaudio-jack. Убедитесь, что файл /etc/pulse/default.pa содержит строку:\n\n```\nload-module module-jackdbus-detect options\n```\n\nГде options может быть любой опцией, поддерживаемой этим модулем, обычно channels=2.\n\nКак описано на странице Jack-DBUS Packaging:\n\nАвтозапуск сервера реализован в качестве вызова D-Bus, который автоматически активирует сервис JACK D-Bus, если он еще не был запущен, и запускает сервер JACK. Правильное взаимодействие с PulseAudio обеспечивается механизмом \"получения/отдачи\" (\"acquire/release\") звуковой карты, основанным на D-Bus. Когда запускается сервер JACK, он запрашивает получение звуковой карты у данного D-Bus сервиса, и PulseAudio безоговорочно отдает управление над ней. В тот момент, когда сервер JACK заканчивает свою работу, он освобождает звуковую карту, которая вновь может быть занята PulseAudio.\n\nmodule-jackdbus-detect.so динамически загружает и выгружает модули module-jack-sink и module-jack-source, когда jackdbus запускается и останавливается.\n\nЕсли PulseAudio не работает, проверьте с помощью pavucontrol, появились ли соответствующие программы на вкладке воспроизведения. Если нет, то добавьте следующее в файл ~/.asoundrc или /etc/asound.conf для перенаправления ALSA на PulseAudio:\n\n```\npcm.pulse {\n    type pulse\n}\n\nctl.pulse {\n    type pulse\n}\n\npcm.!default {\n    type pulse\n}\nctl.!default {\n    type pulse\n}\n```\n\nВ случае, если он все также не работает, проверьте с помощью pavucontrol вкладку воспроизведения и убедитесь, что соответствующие программы осуществляют вывод через PulseAudio JACK Sink, а не через звуковую карту (которую в текущий момент контролирует JACK, и это не сработает). Также убедитесь, что на графике JACK PulseAudio JACK Source соединен с системным аудио выходом.\n\n"
    },
    {
      "title": "Настройка с помощью скриптов",
      "level": 3,
      "content": "Этот способ позволяет JACK и PulseAudio осуществлять вывод одновременно. Основной упор здесь делается на использование скриптов, автоматически запускаемых QJackCTL, для управления особенностями поведения устройств вывода JACK и PulseAudio.\n\nИдея данного подхода строится на том, что прерывание PulseAudio - это плохо, так как может повлечь за собой аварийную остановку приложений, которые используют PulseAudio, и сломать весь вывод звука в целом.\n\nПошагово наши действия можно расписать так:\n\n1. PulseAudio освобождает звуковую карту\n1. запускается JACK и принимает управление звуковой картой на себя\n1. скрипт перенаправляет PulseAudio на JACK\n1. приложения PulseAudio вручную направляются на вывод JACK (pavucontrol может помочь справится с данной задачей)\n1. используются требуемые приложения JACK\n1. скриптом происходит остановка перенаправления PulseAudio на JACK\n1. останавливается JACK и освобождается звуковая карта\n1. PulseAudio возвращает управление звуковой картой и перенаправляет звук на нее напрямую\n\nС помощью QJackCTL настройте следующие скрипты:\n\npulse-jack-pre-start.sh скрипт должен быть настроен как исполняемый и выполняться из скрипта запуска системы\n\n```\n#!/bin/bash\npacmd suspend true\n```\n\npulse-jack-post-start.sh также нужно сделать исполняемым и выполнять после запуска системы\n\n```\n#!/bin/bash\npactl load-module module-jack-sink channels=2\npactl load-module module-jack-source channels=2\npacmd set-default-sink jack_out\npacmd set-default-source jack_in\n```\n\npulse-jack-pre-stop.sh \"должен выполняться при выключении системы\"\n\n```\n#!/bin/bash\nSINKID=$(pactl list | grep -B 1 \"Name: module-jack-sink\" | grep Module | sed 's/[^0-9]//g')\nSOURCEID=$(pactl list | grep -B 1 \"Name: module-jack-source\" | grep Module | sed 's/[^0-9]//g')\npactl unload-module $SINKID\npactl unload-module $SOURCEID\nsleep 5\n```\n\npulse-jack-post-stop.sh \"должен выполняться после выключения системы\"\n\n```\n#!/bin/bash\npacmd suspend false\n```\n\n"
    },
    {
      "title": "Путем остановки PulseAudio",
      "level": 3,
      "content": "Этот способ основывается на скрипте, который автоматически прерывает выполнение PulseAudio, когда запускается JACK, и автоматически запускает PulseAudio, когда JACK завершает работу. Такой подход дает выигрыш в производительности за счет меньшей нагрузки на ЦПУ, в отличии от вариантов, в которых запущены обе программы. Но он может приводить к ошибкам в запущенных приложениях, использующих PulseAudio, и не позволяет осуществлять одновременный вывод (с JACK и PulseAudio).\n\nПри использовании предыдущего метода, применяется QjackCtl для выполнения скриптов загрузки/выгрузки PulseAudio во время запуска и остановки системы. Это приводит к выключению модулей PulseAudio, которые отвечают за автоматическое распознавание аппаратных устройств, и может стать одной из причин, по которой пользователи могут захотеть воспользоваться текущим вариантом. Рассматриваемая настройка подготовлена для связки PulseAudio и JACK, хотя и может быть изменена для загрузки/выгрузки иных не-JACK конфигураций, но корректный запуск/остановка PulseAudio при использовании его программами может стать проблемой.\n\nСледующий пример можно использовать и изменять, при необходимости, как стартовый скрипт, запускающий демон PulseAudio и загружающий программу padevchooser (при необходимости, требуется сборка из AUR). Назовем его jack_startup:\n\n```\n#!/bin/bash\t\n#Load PulseAudio and PulseAudio Device Chooser\npulseaudio -D\npadevchooser&\n```\n\nАналогичный скрипт для остановки PulseAudio и Pulse Audio Device Chooser, который назовем jack_shutdown и также разместим в домашней директории:\n\n```\n#!/bin/bash\t\n#Kill PulseAudio and PulseAudio Device Chooser\t\t\npulseaudio --kill\t\nkillall padevchooser\n```\n\nОба скрипта сделаем исполняемыми:\n\n```\nchmod +x jack_startup jack_shutdown\n```\n\nзатем запустим QjackCtl, нажмем на кнопку Setup и перейдем на вкладку Options, где отметим обе опции \"Execute Script after Startup:\" и \"Execute Script on Shutdown:\", в которые добавим адреса до наших скриптов (с помощью кнопки ... или вписав путь до файлов) ~/jack_startup и ~/jack_shutdown, при условии, что они располагаются в домашней директории. Сохраним изменения.\n\n"
    },
    {
      "title": "PulseAudio через OSS",
      "level": 2,
      "content": "Добавьте следующее в /etc/pulse/default.pa:\n\n```\nload-module module-oss\n```\n\nЗатем запустите PulseAudio как обычно, убедитесь что все источники объявлены для OSS усройств.\n\n"
    },
    {
      "title": "Запуск PulseAudio из chroot",
      "level": 2,
      "content": "Так как chroot представляет собственный root для запуска/остановки приложений, PulseAudio должен быть установлен из самого chroot (pacman -S pulseaudio в окружении chroot).\n\nPulseAudio, если не настроен на подключения к конкретному серверу (это можно сделать в /etc/pulse/client.conf, через переменную окружения PULSE_SERVER, или через локальные настройки X11, используя module-x11-publish), будет пытаться подключится к локальному pulse серверу, если у него не получится - он создаст новый. Каждый pulse сервер имеет уникальный ID, основанный на машинном id значении в /var/lib/dbus. Чтобы дать приложениям из chroot доступ к pulse серверу, следующие директории должны быть смонтированный в chroot:-\n\n```\n/run\n/var/lib/dbus\n/tmp\n~/config/.pulse\n```\n\n/dev/shm также должен быть смонтирован для эффективного использования. Заметьте, что монтирование /home также обычно означает общий доступ к каталогу ~/.pulse.\n\nPulseAduio выберет путь к сокету через XDG_RUNTIME_DIR, так что удостовертесь что перенесли его тоже с помощью sudo, когда используете chroot (см. Sudo#Environment variables).\n\n"
    },
    {
      "title": "Отключение автоматического запуска сервера PulseAudio",
      "level": 2,
      "content": "Некоторые пользователи предпочитают вручную запускать сервер PulseAudio, перед запуском определенных программ, а затем останавливать сервер PulseAudio, когда они завершены. Для достижения такого результата, отредактируйте ~/.config/pulse/client.conf или /etc/pulse/client.conf и измените autospawn = yes на autospawn = no. Убедитесь что строка не закомментирована.\n\n```\n/etc/pulse/client.conf\n```\n\n```\nautospawn = no\n```\n\nТеперь вы можете вручную запустить PulseAudio сервер командой\n\n```\n$ pulseaudio --start\n```\n\nИ остановить его\n\n```\n$ pulseaudio --kill\n```\n\nЭтот параметр также учитывается стандартным скриптом pulseaudio при запуске сеанса рабочего стола start-pulseaudio-x11 который выполняется из /etc/xdg/autostart/pulseaudio.desktop.\n\n"
    },
    {
      "title": "Отключение демона pulseaudio полностью",
      "level": 2,
      "content": "Чтобы отключить демон PulseAudio полностью, и тем самым предотвратить его запуск, добавьте daemon-binary=/bin/true в файл настроек.\n\n```\n~/.config/pulse/client.conf #or /etc/pulse/client.conf\n```\n\n```\ndaemon-binary=/bin/true\n```\n\n"
    },
    {
      "title": "Изменить стерео на моно",
      "level": 2,
      "content": "Изменить стерео устройство вывода на моно устройство вывода можно путём создания виртуального устройства вывода. Это будет полезно если у вас только один динамик. Добавьте в /etc/pulse/default.pa:\n\n```\nload-module module-remap-sink master=alsa_output.pci-0000_00_1f.5.analog-stereo sink_name=mono channels=2 channel_map=mono,mono\n# Optional: Select new remap as default\nset-default-sink mono\n```\n\n(замените имя звуковой карты alsa_output.pci-0000_00_1f.5.analog-stereo показанным в pacmd list-sinks)\n\nПереключайтесь между виртуальным моно устройством и настоящим стерео устройством.\n\n"
    },
    {
      "title": "Поменять левый/правый каналы",
      "level": 2,
      "content": "Это тоже самое, что инвертировать стерео, когда левый и правый канал меняются местами.\n\nВо-первых, определите звуковую карту, в которой вы хотите произвести изменение:\n\n```\n$ cat /proc/asound/cards\n```\n\nи запомните строку с именем для устройства, которое вы хотите использовать (оно заключено в квадратные скобки, например [Intel]).\n\nОтредактируйте /etc/pulse/default.pa и закомментируйте строки, которые содержат module-hal-detect и module-detect.\n\nНайдите закомментированную строку, которая начинается с \"#load-module module-alsa-sink\", раскомментируйте ее и измените на\n\n```\nload-module module-alsa-sink device=hw:[device name] channel_map=right,left\n```\n\nПерезапустите демон PulseAudio\n\n```\npulseaudio -k; pulseaudio -D\n```\n\nДокументация переназначения модуля устройства\n\n"
    },
    {
      "title": "PulseAudio в качестве ненавязчивого проводника ALSA",
      "level": 2,
      "content": "Некоторые пользователи по различным причинам не хотят всё время запускать PulseAudio. Этот пример превратит полноценный звуковой сервер в ненавязчивый проводник к устройствам ALSA, который автоматически запускает и останавливает себя, когда дело сделано, позволяя приложениям требующим PulseAudio, полностью функционировать, не трогая настройки ALSA, не устанавливая себя по умолчанию как устройства ALSA.\n\nЭта настройка позволит клиентам, использующим PA, производить автозапуск демона в тот момент, когда он им понадобится, а также завершать его работу как только все клиенты отсоединяться.\n\nСам демон использует простую статическую настройку, которая использует только настроенные вами pcm.!default устройства ALSA. Никаких замен ALSA, никаких игр с уровнями микшера, ничего, кроме записи/воспроизведения. Также убедитесь, что pulseaudio-alsa не установлен, так как стандартные клиенты ALSA по умолчанию не привязаны к Pulse. Функции alsamixer продолжают работать должным образом, как и любые другие клиенты ALSA . Также убедитесь, что общие фрэймворки, как Xine, Gstreamer и Phonon настроены на использование ALSA: по умолчанию, если они обнаружат установленный PulseAudio, они будут пытаться использовать его перед ALSA.\n\n```\n/etc/pulse/daemon.conf\n```\n\n```\n# Replace these with the proper values\nexit-idle-time = 0 # Exit as soon as unneeded\nflat-volumes = yes # Prevent messing with the master volume\n```\n\n```\n/etc/pulse/client.conf\n```\n\n```\n# Replace these with the proper values\n\n# Applications that uses PulseAudio *directly* will spawn it,\n# use it, and pulse will exit itself when done because of the\n# exit-idle-time setting in daemon.conf\nautospawn = yes\n```\n\n```\n/etc/pulse/default.pa\n```\n\n```\n# Replace the *entire* content of this file with these few lines and\n# read the comments\n\n.fail\n    # Set tsched=0 here if you experience glitchy playback. This will\n    # revert back to interrupt-based scheduling and should fix it.\n    #\n    # Replace the device= part if you want pulse to use a specific device\n    # such as \"dmix\" and \"dsnoop\" so it doesn't lock an hw: device.\n    \n    # INPUT/RECORD\n    load-module module-alsa-source device=\"default\" tsched=1\n    \n    # OUTPUT/PLAYBACK\n    load-module module-alsa-sink device=\"default\" tsched=1 \n    \n    # Accept clients -- very important\n    load-module module-native-protocol-unix\n\n.nofail\n.ifexists module-x11-publish.so\n    # Publish to X11 so the clients know how to connect to Pulse. Will\n    # clear itself on unload.\n    load-module module-x11-publish\n.endif\n```\n\n"
    },
    {
      "title": "Наушники и колонки подключены одновременно и переключаются приложением на лету",
      "level": 2,
      "content": "Pulseaudio устроен так, что он автоматически отключает Line Out, когда подключены наушники и начинает использовать их ползунок для управления. Подобное поведение вы можете наблюдать в alsamixer. Мы же хотим разделить управление наушников и Line Out, и заставить их работать одновременно. Это очень полезно в том случае, если вы хотите переназначить гнезда Realtek, например, зеленое использовать для наушников, а голубое - для динамиков (при помощи hdajackretask из alsa-tools).\n\nДля этого вам потребуется отредактировать непосредственно конфигурацию Pulseaudio mixer:\n\n1. Мы сообщаем pulseaudio, что наушники всегда подключены. Редактируем:\n\n/usr/share/pulseaudio/alsa-mixer/paths/analog-output-lineout.conf\n\nНаходим:\n\n```\n[Jack Headphone]\nstate.plugged = no\nstate.unplugged = unknown\n```\n\nИзменяем no на yes\n\n2. По умолчанию, громкость Line Out управляется только через Master, а не через ползунок Line Out. Мы хотим соединить Line Out с Master.\n\nДобавьте этот блок в конец файла:\n\n```\n[Element Line Out]\nswitch = mute\nvolume = merge\n```\n\n3. Нам нужно полностью отключать Line Out, когда мы используем наушники. Редактируем:\n\n/usr/share/pulseaudio/alsa-mixer/paths/analog-output-headphones.conf\n\nДобавляем блок в конец файла:\n\n```\n[Element Line Out]\nswitch = off\nvolume = off\n```\n\n4. Как и Pulseaudio, Alsa самостоятельно отключает динамики, когда подключаются наушники. Откройте alsamixer (для Realtek HDA alsamixer -c0) и измените Auto-Mute mode на disabled.\n\n5. Перезапустите Pulseaudio\n\n```\n$ pulseaudio -k\n$ pulseaudio --start\n```\n\nТеперь у вас есть два порта на одно устройство вывода в pulseaudio. Они заглушают друг друга, таким образом вы можете переключиться на наушники, и это отключит звук в динамиках и наоборот. Для переключения между портами вы можете использовать звуковой микшер Gnome или Plasma, или установить подходящее расширение рабочего стола.\n\n"
    },
    {
      "title": "Одновременное использование PulseAudio несколькими пользователями",
      "level": 2,
      "content": "Иногда желательно запускать программы как другой пользователь, находясь в системе как основной пользователь, например, для изоляции программы. Тем не менее, PulseAudio по умолчанию не будет поддерживать соединения второго пользователя, поскольку демон PulseAudio уже запущен для основного. Но может быть создан сокет PulseAudio UNIX для поддержки соединений других пользователей демоном PulseAudio, запущенным основным пользователем.\n\nВо-первых, отредактируйте файл /etc/pulse/default.pa или ~/.config/pulse/default.pa и добавьте указание для создания unix сокета:\n\n```\n~/.config/pulse/default.pa\n```\n\n```\nload-module module-native-protocol-unix auth-anonymous=1 socket=/tmp/pulse-socket\n```\n\nЗатем, укажите PulseAudio в качестве клиента для сокета UNIX, только что созданного вторым пользователем:\n\n```\n/home/secondaryuser/.config/pulse/client.conf\n```\n\n```\ndefault-server = unix:/tmp/pulse-socket\n```\n\nТеперь, после перезапуска демона PulseAudio, приложения, запущенные от имени второго пользователя, должны без проблем проигрывать звук через демон PulseAudio, запущенный основным пользователем.\n\n"
    }
  ]
}