{
  "title": "PulseAudio (Русский)",
  "url": "https://wiki.archlinux.org/title/PulseAudio_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- PulseAudio/Примеры\n- PulseAudio/Решение проблем\n- PipeWire (Русский)\n\nPulseAudio — это многофункциональный звуковой сервер, предназначенный для работы в качестве прослойки между приложениями и аппаратными устройствами через ALSA или OSS. Он также с лёгкостью может передавать аудио по сети между локальными устройствами, используя Avahi, если тот доступен. Несмотря на то, что основная цель заключена в простоте настройки звука, его модульная архитектура позволяет более опытным пользователям настраивать демон в соответствии со своими нуждами.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет pulseaudio.\n\nНекоторые модули PulseAudio были отделены от основного пакета и должны быть установлены самостоятельно, если требуются:\n\n- pulseaudio-alsa для работы PulseAudio с ALSA, смотрите раздел #ALSA\n- pulseaudio-bluetooth: поддержка Bluetooth (Bluez), смотрите статью Bluetooth наушники\n- pulseaudio-equalizer: эквалайзер устройств вывода (qpaeq)\n- pulseaudio-jack: определение устройств вывода, источников JACK и jackdbus\n- pulseaudio-lirc: инфракрасный контроль громкости (LIRC)\n- pulseaudio-zeroconf: поддержка Zeroconf (Avahi/DNS-SD)\n\n"
    },
    {
      "title": "Интерфейсы",
      "level": 3,
      "content": "Существует множество интерфейсов для управления демоном PulseAudio:\n\n"
    },
    {
      "title": "Консольные",
      "level": 4,
      "content": "- ncpamixer — Микшер на базе ncurses, вдохновлённый pavucontrol.\n\n- pacmixer — Микшер, похожий на Alsamixer.\n\n- PAmix — Микшер на базе ncurses, похожий на to pavucontrol.\n\n- pamixer — Интерфейс командной строки.\n\n- pavolume — Простой регулятор громкости командной строки с сообщениями libnotify.\n\n- Ponymix — Интерфейс командной строки.\n\n- pulseaudio-ctl — Управление громкостью PulseAudio из командной оболочки или с помощью сочетаний клавиш.\n\n- pulsemixer — Микшер CLI и curses.\n\n"
    },
    {
      "title": "Графические",
      "level": 4,
      "content": "- KMix — KDE-приложение для регулировки громкости, поддерживающее несколько платформ, в том числе PulseAudio, настраиваемый апплет в системном трее.\n\n- MicTray — Лёгкое приложение для системного трея, позволяющее управлять состоянием и громкостью микрофона с помощью PulseAudio.\n\n- pa-applet — Апплет системного трея с панелью громкости.\n\n- pasystray — Апплет системного трея.\n\n- plasma-pa — Апплет KDE Plasma для управления громкостью звука с помощью PulseAudio\n\n- PulseAudio Equalizer — Многополосный эквалайзер на основе LADSPA.\n\n- PulseAudio Graph Control — Интерфейс управления громкостью и графом, основанный на Electron.\n\n- PulseAudio Manager — Простой GTK фронтенд. Разработка прекращена.\n\n- PulseAudio Preferences — Простой диалог конфигурации GTK.\n\n- PulseAudio Volume Control — Простой GTK-инструмент управления громкостью («микшер»).\n\n- PulseAudio Volume Control (Qt) — Микшер для PulseAudio (Qt-порт pavucontrol).\n\n- PulseAudio Volume Control (Sandsmark) — Лёгкий форк pavucontrol из LXQt, в котором реализованы недостающие функции pavucontrol, исправлены ошибки и удалены ненужные зависимости.\n\n- PulseAudio Volume Meter — Простой GTK-измеритель громкости для PulseAudio. Разработка прекращена.\n\n- PulseEffects — Аудиоэффекты для приложений PulseAudio.\n\n- Volctl — Апплет для управления громкостью отдельных приложений.\n\n- Xfce PulseAudio Panel Plugin — Плагин PulseAudio для панели Xfce 4.\n\n- pa-notify — Демон уведомления о громкости для PulseAudio или PipeWire.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "По умолчанию PulseAudio настроен на автоматическое обнаружение всех звуковых карт и управление ими. Он берёт под свой контроль все обнаруженные устройства ALSA и перенаправляет все аудиопотоки на себя, делая демон PulseAudio центральной точкой настроек. Демон, в основном, должен работать «из коробки», требуя только нескольких незначительных изменений настроек.\n\nХотя PulseAudio обычно прекрасно работает из коробки и требует лишь минимальной настройки, опытные пользователи могут изменить почти каждый аспект демона, либо изменив стандартный файл настроек для отключения модулей, либо написав свой собственный с нуля.\n\nPulseAudio работает как демон сервера, который может работать как общесистемно, так и отдельно для каждого пользователя, с помощью архитектуры клиент/сервер. Без своих модулей демон сам по себе ничего не делает, кроме обеспечения API и размещения динамически загружаемых модулей. Вся маршрутизация аудио и обработка задач обрабатывается различными модулями, в том числе сам протокол PulseAudio (реализуется модулем module-native-protocol-unix). Клиенты обращаются к серверу через один из модулей протоколов, которые принимают звук из внешних источников, направляют его через PulseAudio и в конечном итоге выводят через другой модуль. Модуль вывода не обязательно должен быть фактическим звуковым выходом: он может записывать аудиопоток в файл, передавать его на сервер вещания, такой как Icecast, или даже просто отбрасывать его.\n\nВы можете найти подробный список всех доступных модулей в Загружаемые Модули Pulseaudio (Англ.). Чтобы включить их, Вы можете добавить строку load-module имя-модуля-из-списка в ~/.config/pulse/default.pa.\n\n"
    },
    {
      "title": "Файлы настроек",
      "level": 3,
      "content": "PulseAudio будет сначала смотреть файлы настроек в домашнем каталоге ~/.config/pulse/, а если не найдёт их там, то в общесистемном /etc/pulse/.\n\n- Настоятельно советуем не редактировать общесистемные файлы настроек, вместо них редактируйте пользовательские. Создайте каталог ~/.config/pulse, затем скопируйте (cp /etc/pulse/ ~/.config/pulse) файлы настроек системы в него, и редактируйте согласно Вашим требованиям.\n- Убедитесь, что Вы держите пользовательские настройки в синхронизации с изменениями в пакетных файлах /etc/pulse/. Иначе, PulseAudio может отказаться запускаться из-за ошибки в настройках.\n- Нет необходимости добавлять Вашего пользователя к группе audio, поскольку он использует udev и logind для динамичного предоставления доступа к \"в настоящее время активному\" пользователю. Исключение составляют клиентские (headless) машины, в которых нет понятия текущий \"активный\" пользователь.\n\n"
    },
    {
      "title": "daemon.conf",
      "level": 4,
      "content": "Это основной файл для настройки демона. Он определяет основные настройки, такие как: частоты дискретизации по умолчанию, используемые модулями, методы повторной выборки, планирование в реальном времени, и другие различные настройки, связанные с серверным процессом. Они не могут быть изменены на лету без перезапуска демона PulseAudio. Значения по умолчанию подходят для большинства пользователей. Дополнительная информация доступна в man-странице pulse-daemon.conf(5). Boolean-опции принимают такие значения: true, yes, on и 1 — истина; false, no, off и 0 — ложь.\n\nTable content:\nОпция | Описание\ndaemonize | Управляет тем, будет ли сервер переходить в режим демона и возвращать управление. Установите значение no при отладке, чтобы вы могли видеть отладочную информацию в терминале.\nresample-method | Какой метод частоты дискретизации (resampler) использовать, когда звук с несовместимыми частотами дискретизации должен быть передан между модулями (например, воспроизведение звука на 96 кГц на аппаратном обеспечении, поддерживающим только 48 кГц). Список доступных resampler'ов можно посмотреть с помощью команды $ pulseaudio --dump-resample-methods. Выберите и используйте лучший компромисс между загрузкой процессора и качеством звука. Совет: В некоторых случаях PulseAudio будет генерировать высокую нагрузку на процессор. Это может произойти, когда несколько потоков передискретизируются (индивидуально). Если такая ситуация возникает часто, стоит подумать о создании дополнительного устройства вывода (sink) с соответствующей частотой дискретизации, аудиопоток из которого затем будет передан в основное устройство вывода (main sink), благодаря чему передискретизация будет выполняться только один раз.\navoid-resampling | Со значением avoid-resampling = yes PulseAudio автоматически настроит частоту дискретизации оборудования в соответствии с той, которую использует приложение, если оборудование её поддерживает (необходим PA 11 или новее) Важно: Включение этой функции может привести к искажению звука, поэтому по умолчанию она отключена. Подробнее в примечаниях к выпуску.\nenable-remixing | Когда вход и выход имеют разное количество каналов (например, вывод 6-канального фильма в стереовывод), PulseAudio может либо перемикшировать все каналы (по умолчанию, yes), либо просто тривиально сопоставить каналы по их названию (левый идет к левому, правый к правому, все остальные игнорируются) (no)\nsystem-instance | Если yes, то демон будет запускаться как как общесистемный экземпляр. Крайне нежелательно, поскольку это может привести к проблемам безопасности. Полезно в системах с несколькими пользователями и (headless) системах, не имеющих никаких настоящих локальных пользователей. Значение по умолчанию no.\nflat-volumes | flat-volumes масштабирует громкость устройства с громкостью \"самого громкого\" приложения. Например, повышение громкости вызова VoIP повысит аппаратную громкость и скорректирует звук аудиоплеера, таким образом, что понижать громкость аудиоплеера вручную нет необходимости. Значение по умолчанию yes, но в сборке для Arch - no. Примечание: Поведение значения по умолчанию, иногда, может сбивать с толку, и некоторые приложения не зная об этой функции, могут регулировать свою громкость к 100% при запуске, потенциально создавая неожиданно громкий звук. Для восстановления классического поведения (ALSA), установите это значение в no.\nrealtime-scheduling | Если ваше ядро поддерживает планирование в режиме реального времени (например, Realtime kernel или Linux-ck), установите значение yes, чтобы PulseAudio мог обеспечить воспроизведение с низкой задержкой без глюков. Ещё можно настроить realtime-priority, чтобы он использовал правильный приоритет, особенно когда JACK тоже запущен в системе.\nnice-level | Поскольку PulseAudio работает в пространстве пользователя и активно использует межпроцессное взаимодействие, звук может пропадать, если демону не хватает процессорного времени для его обработки. Значение по умолчанию обычно подходит, но его можно настроить, чтобы задать PulseAudio приоритет выше (или ниже) других приложений.\nexit-idle-time | Если вы хотите держать PulseAudio запущенным только при необходимости, а в остальное время использовать ALSA, можно установить задержку в секундах, после которой демон будет автоматически выключаться после отключения всех клиентов. Установите значение -1, чтобы отключить эту функцию.\nlog-level | При отладке можно повысить уровень логирования демона, чтобы узнать, почему конкретный модуль не загружается. При высоком уровне иногда выводится полезная информация, например, обнаруженная минимальная задержка для системы, которую можно использовать для настройки default-fragments и default-fragment-size-msec.\ndefault-sample-format | Обычно этот параметр менять не нужно, но если родной формат вашей звуковой карты отличается, производительность и качество можно улучшить, установив здесь нужный формат.\ndefault-sample-rate | Частота дискретизации по умолчанию, которую использует PulseAudio, если она не изменена на уровне модуля. Измените это значение, если ваша звуковая карта не поддерживает частоту 44100 Гц или если вы хотите повысить дискретизацию всего звука. Смотрите предыдущее примечание об использовании процессора.\nalternate-sample-rate | Для устранения распространённого ограничения, когда фильмы с частотой 48000 Гц без необходимости преобразовывались в 44100 Гц, некоторые модули поддерживают динамическое переключение частоты дискретизации, чтобы избежать передискретизации, когда это возможно. Более подробную информацию смотрите в документации. Обычно это не нужно изменять.\ndefault-channels | Количество каналов по умолчанию, если оно не указано. Обычно не нужно ничего менять, так как вы можете настроить больше каналов в настройках отдельных модулей.\ndefault-fragments | Аудиосэмплы разделяются на множество фрагментов длиной по default-fragment-size-msec мс. Чем больше буфер, тем менее вероятен пропуск звука, когда система будет перегружена. С другой стороны это увеличит общую величину задержки. Увеличьте это значение, если у вас есть проблемы.\ndefault-fragment-size-msec | Размер каждого фрагмента в миллисекундах. Это количество данных, которое будет обработано демоном за один раз.\n\n"
    },
    {
      "title": "default.pa",
      "level": 4,
      "content": "Этот файл является сценарием запуска и используется для настройки модулей. Он анализируется и читается после завершения инициализации демона. Дополнительные команды могут быть отправлены во время выполнения с помощью pactl(1) или pacmd(1). Сценарий запуска также может быть загружен через командную строку путём запуска PulseAudio в терминале с параметром pulseaudio -nC. Это заставит демона загрузить модуль CLI и принимать настройки непосредственно из командной строки, выдавать получающуюся информацию или сообщения об ошибках на том же терминале. Это может быть полезно при отладке демона или тестирования различных модулей, перед постоянной установкой их на диск. Синтаксис описан в pulse-cli-syntax(5).\n\n- Вместо того, чтобы копировать этот файл, в начало файла ~/.config/pulse/default.pa можно добавить .include /etc/pulse/default.pa и ниже просто переопределять стандартные настройки.\n- Список доступных устройств вывода можно посмотреть с помощью команды pacmd list-sinks | grep -Ei 'index:|name:'. Устройство вывода, используемое по умолчанию, отмечено звёздочкой (*).\n- Отредактируйте ~/.config/pulse/default.pa, добавив/изменив в нём команду set-default-sink так, чтобы использовалась имя устройства вместо его номера, так как нумерация устройств может меняться.\n\n"
    },
    {
      "title": "client.conf",
      "level": 4,
      "content": "Это файл настроек, читающийся каждым клиентским приложением PulseAudio. Он используется для настройки опций во время выполнения для отдельных клиентов. Может использоваться чтобы устанавливать и настраивать устройство вывода по умолчанию и для статического запуска, а также позволять (или запрещать) клиентам автоматический запуск сервера, если он в настоящее время не работает. Если автозапуск включен, клиенты будут автоматически запускать PulseAudio, если он ещё не запущен, когда клиент пытается подключиться к нему. Это может быть полезно, если вы хотите сэкономить ресурсы системы и не хотите, чтобы PulseAudio был всегда запущен. В противном случае его следует запускать при входе в сеанс.\n\n"
    },
    {
      "title": "Команда настроек",
      "level": 3,
      "content": "Основная команда для настройки сервера во время выполнения — pacmd. Выполните pacmd --help для просмотра доступных опций; для входа в интерактивный режим выполните pacmd и Ctrl+d для выхода. Все изменения будут применены сразу.\n\nПосле того, как новые настройки были проверены и удовлетворили Ваши потребности, соответственно отредактируйте default.pa, чтобы изменения стали постоянными. Для некоторых основных настроек, смотрите PulseAudio/Examples (Русский).\n\nВажно понимать, что набор источников («sources»: процессы, устройства захвата) и выводов («sinks»: звуковые карты, серверы, другие процессы), которые можно выбрать в PulseAudio, зависит от текущих выбранных профилей устройств. Эти профили являются теми «pcm», которые выводятся командой aplay -L или, более конкретно, командой pacmd list-cards: в её выводе, помимо прочего, есть строка «index:», список «profiles:» и строка «active profile: <...>». Профили соответствуют различным конфигурациям ввода/вывода звуковой карты, в частности, количеству доступных каналов ввода/вывода.\n\nВыбрать активный профиль («active profile») можно с помощью команды pacmd set-card-profile INDEX PROFILE без запятой, разделяющей INDEX и PROFILE; INDEX — это просто число из строки «index:», а PROFILE — значение из списка «profiles:» до первого двоеточия с пробелом. Пример: pacmd set-card-profile 0 output:analog-stereo+input:analog-stereo.\n\nБолее удобный способ выбрать профиль — через графический интерфейс, например в pavucontrol на вкладке «Конфигурация» или в параметрах KDE в разделе «Звуковые устройства». Каждая звуковая карта, то есть устройство из списка aplay -l или pacmd list-cards, будет иметь свой собственный выбираемый профиль. После выбора профиля доступные в нём источники (sources) и выводы (sinks) можно посмотреть с помощью команды pacmd list-sources и pacmd list-sinks. Имейте в виду, что индекс («index») доступных источников и выводов изменятся каждый раз, когда изменяется профиль карты.\n\nВыбранный профиль может вызывать проблемы в некоторых приложениях, особенно Adobe Flash Player, обычно /usr/lib/mozilla/plugins/libflashplayer.so и /usr/lib/PepperFlash/libpepflashplayer.so. Часто, эти флэш-плееры будут работать только тогда, когда выбран один из профилей Стерео, иначе видео будет проигрываться без звука или просто откажется воспроизводиться. Когда всё остальное перестало работать, можно попробовать выбрать другой профиль.\n\nКонечно, при настройке некоторых вариаций Surround Sound (Объёмного Звука) в PulseAudio, должен быть выбран соответствующий профиль Surround. Прежде чем объёмный звук будет работать, сделайте такие вещи, как переназначение каналов динамиков (speaker channels).\n\nЕсли единственным профилем, который у вас есть, является «HiFi», это означает, что вы используете профили ALSA Use Case Manager вместо профилей pulseaudio. Возвращение к использованию профилей pulseaudio описано в разделе PulseAudio/Примеры#Отключение UCM/\"HiFi\".\n\n"
    },
    {
      "title": "Подключение и аутентификация",
      "level": 3,
      "content": "Так как PulseAudio работает как демон, запускаемый от имени текущего пользователя, клиентам нужно знать, где найти сокет демона для подключения к нему, а также общий файл со случайным cookie, который клиенты используют для аутентификации. По умолчанию клиенты должны находить демон без проблем, используя переменные окружения, свойства корневого окна X11 и, наконец, пробуя расположение по умолчанию (unix:/run/user/$ID/pulse/native). Однако, если у вас есть клиенты, которым нужен доступ к PulseAudio вне вашего сеанса X11, например mpd, запущенный под другим пользователем, нужно будет указать ему, как подключиться к вашему экземпляру PulseAudio. Полный пример есть в разделе PulseAudio/Примеры#Одновременное использование PulseAudio несколькими пользователями. По умолчанию для аутентификации используется файл cookie, содержащий случайные байты, чтобы исключить утечку звука от одного пользователя к другому в многопользовательской системе. Если вы уже контролируете, кто может получить доступ к серверу, с помощью прав доступа пользователей/групп, вы можете отключить куки, передав auth-cookie-enabled=0 в параметрах для module-native-protocol-unix.\n\n"
    },
    {
      "title": "Переменные окружения",
      "level": 4,
      "content": "Эти две переменные важны для того, чтобы клиенты libpulse могли найти PulseAudio, если вы переместили его сокет в другое место. Более подробную информацию и другие полезные переменные окружения, которые будут считывать клиенты, смотрите в pulseaudio(1).\n\nTable content:\nПеременная | Описание\nPULSE_SERVER | Определяет, где находится сервер. Он принимает префикс протокола, например unix: или tcp, после которого идёт путь или IP сервера. Пример: unix:/home/pulse/native-sock.\nPULSE_COOKIE | Пут к файлу, содержащему случайный файл cookie, сгенерированный PulseAudio. Этот файл будет считываться клиентами, а его содержимое отправляться на сервер, поэтому файл должен быть доступен для чтения всем клиентам. Это не обязательно должен быть один и тот же файл; главное, чтобы его содержимое совпадало с содержимым того файла, который использует демон.\n\n"
    },
    {
      "title": "Свойства X11",
      "level": 4,
      "content": "PulseAudio также использует свойства корневого окна X11 для поиска демона. Поскольку переменные окружения не могут быть изменены после запуска дочерних процессов, свойства X11 более гибкие, поскольку их легче изменить, так как они являются глобально общими. Пока у приложений есть доступ к переменной окружения DISPLAY=, они могут считывать актуальные значения свойств X11. Посмотреть их можно с помощью команды с помощью команды xprop -root, а команда pax11publish -d покажет только свойства, специфичные для PulseAudio. pax11publish также можно использовать для обновления свойств из переменных окружения (pax11publish -e, или pax11publish -r для их полного удаления). Если возможно, рекомендуется позволить PulseAudio сделать это самостоятельно с помощью модуля module-x11-publish или команды start-pulseaudio-x11. Следующая таблица приведена только для информации; вам никогда не понадобится устанавливать эти свойства вручную.\n\nTable content:\nСвойство | Описание\nPULSE_SERVER | Строка (xprop -root -f PULSE_SERVER 8s -set PULSE_SERVER \"unix:/tmp/pulse-sock\"), работает аналогично переменной окружения с таким же названием.\nPULSE_COOKIE | Строка, содержащая шестнадцатеричное представление значения cookie для аутентификации.\n\n"
    },
    {
      "title": "Запуск",
      "level": 2,
      "content": "Arch предоставляет юнит pulseaudio.socket, который включен по умолчанию для пользовательского экземпляра systemd. Это значит, что по необходимости PulseAudio запустится автоматически.\n\n- Для отключения pulseaudio.socket удостоверьтесь, что $XDG_CONFIG_HOME/systemd/user существует, и замаскируйте пользовательский юнит pulseaudio.socket.\n- Многие среды рабочего стола поддерживают XDG Autostart. В этом случае PulseAudio будет запущен автоматически независимо от состояния активации сокета.\n\nДля получения дополнительной информации посмотрите PulseAudio: Выполнение.\n\n"
    },
    {
      "title": "Остановка",
      "level": 2,
      "content": "Остановите пользовательские юниты pulseaudio.socket и pulseaudio.service.\n\n"
    },
    {
      "title": "ALSA",
      "level": 3,
      "content": "Note: **Не** \n\nЕсли у вас есть приложения, которые совсем не поддерживают PulseAudio, но используют ALSA, они будут пытаться получить доступ напрямую к звуковой карте через ALSA, минуя PulseAudio. Таким образом, звуковая карта перестанет быть доступной для PulseAudio. Вследствие чего, все приложения, использующие PulseAudio, перестанут работать, как описано здесь. Чтобы этого избежать, вам необходимо установить пакет pulseaudio-alsa. Он содержит файл /etc/alsa/conf.d/99-pulseaudio-default.conf настраивающий ALSA на использование PulseAudio. Также убедитесь, что файл ~/.asoundrc отсутствует, иначе он будет переопределять настройки из файла /etc/asound.conf.\n\nТакже может понадобиться установить lib32-libpulse и lib32-alsa-plugins, если вы используете программы multilib, например Wine или Steam.\n\nЧтобы запретить приложениям ALSA использовать эмуляцию OSS в обход PulseAudio (тем самым не давая другим приложениям воспроизводить звук), убедитесь, что модуль snd_pcm_oss не загружается при загрузке системы. Если он в настоящее время загружен (lsmod | grep oss), отключите его, выполнив:\n\n```\n# rmmod snd_pcm_oss\n```\n\n"
    },
    {
      "title": "Включение DTS через ALSA",
      "level": 4,
      "content": "Для включения PulseAudio DTS (Digital Theater System) через ALSA установите пакет dcaencAUR и включите его:\n\n```\n/etc/asound.conf\n```\n\n```\n<confdir:pcm/dca.conf>\n```\n\nЗатем перезапустите PulseAudio. Если есть проблемы с громкостью, попробуйте поиграться с настройками, описанными на странице проекта.\n\n"
    },
    {
      "title": "Раскрытие источников, устройств вывода и микшеров PulseAudio для ALSA",
      "level": 4,
      "content": "Хотя pulseaudio-alsa содержит файл настроек, позволяющий приложениям ALSA использовать устройство по умолчанию из PulseAudio, в ALSA-плагине pulse есть дополнительные возможности:\n\n```\n~/.asoundrc (or /etc/asound.conf)\n```\n\n```\n# Create an alsa input/output using specific PulseAudio sources/sinks\npcm.pulse-example1 {\n    type pulse\n    device \"my-combined-sink\" # name of a source or sink\n    fallback \"pulse-example2\" # if combined not available\n}\n\npcm.pulse-example2 {\n    type pulse\n    device \"other-sound-card\" # name of a source or sink\n    # example: device \"alsa_output.pci-0000_00_1b.0.analog-stereo\"\n}\n\n# Create an alsa mixer using specific PulseAudio sources/sinks\n# these can be tested with \"alsamixer -D pulse-example3\"\nctl.pulse-example3 {\n    type pulse\n    device \"my-output\" # name of source or sink to control\n\n    # example: always control the laptop speakers:\n    # device \"alsa_output.pci-0000_00_1b.0.analog-stereo\"\n    fallback \"pulse-example4\" # supports fallback too\n}\n\n# Mixers also can control a specific source and sink, separately:\nctl.pulse-example4 {\n    type pulse\n    sink \"my-usb-headphones\"\n    source \"my-internal-mic\"\n    \n    # example: output to HDMI, record using internal\n    sink \"alsa_output.pci-0000_01_00.1.hdmi-stereo-extra1\"\n    source \"alsa_input.pci-0000_00_1b.0.analog-stereo\"\n}\n\n# These can override the default mixer (example: for pnmixer integration)\nctl.!default {\n    type pulse\n    sink \"alsa_output.pci-0000_01_00.1.hdmi-stereo-extra1\"\n    source \"alsa_input.pci-0000_00_1b.0.analog-stereo\"\n}\n```\n\nДля знакомства со всеми доступными настройками доступен исходный код.\n\n"
    },
    {
      "title": "ALSA/dmix без захвата аппаратного устройства",
      "level": 4,
      "content": "Note: **не** \n\nВы, возможно, захотите использовать ALSA непосредственно в большинстве Ваших приложений, при этом, если есть необходимость, иметь возможность использовать приложения требующие PulseAudio. Следующие шаги позволяют Вам заставлять PulseAudio использовать dmix вместо того, чтобы \"захватывать\" устройство ALSA.\n\n- Удалите пакет pulseaudio-alsa, обеспечивающий уровень совместимости между приложениями ALSA и PulseAudio. После этого Ваши приложения ALSA будут использовать ALSA напрямую, без \"зацепки\" Pulse.\n\n- Создайте файл настроек в каталоге /etc/pulse/default.pa.d/ для выгрузки модулей автоматического обнаружения и статической загрузки нужных модулей бэкенда. Добавьте параметры device как показано ниже:\n\n```\n/etc/pulse/default.pa.d/load-audio-drivers-statically.pa\n```\n\n```\nunload-module module-udev-detect\nunload-module module-detect\nload-module module-alsa-sink device=dmix\nload-module module-alsa-source device=dsnoop\n```\n\n- Дополнительно: если вы используете kmix, вы можете управлять громкостью ALSA вместо громкости PulseAudio, установив переменную окружения KMIX_PULSEAUDIO_DISABLE=1.\n\n- Теперь, перезагрузите свой компьютер и попытайтесь запустить одновременно приложения ALSA и PulseAudio. Они оба должны воспроизводить звук одновременно.\n\n"
    },
    {
      "title": "OSS",
      "level": 3,
      "content": "Есть несколько способов заставить работать OSS-программы через PulseAudio:\n\n"
    },
    {
      "title": "ossp",
      "level": 4,
      "content": "Установите пакет ossp и запустите службу osspd.service.\n\n"
    },
    {
      "title": "Оболочка padsp",
      "level": 4,
      "content": "Программы, использующие OSS, могут работать с PulseAudio при запуске через padsp (входит в состав PulseAudio):\n\n```\n$ padsp OSSпрограмма\n```\n\nНесколько примеров:\n\n```\n$ padsp aumix\n$ padsp sox foo.wav -t ossdsp /dev/dsp\n```\n\nВы можете также добавить пользовательский сценарий оболочки:\n\n```\n/usr/local/bin/OSSProgram\n```\n\n```\n#!/bin/sh\nexec padsp /usr/bin/OSSprogram \"$@\"\n```\n\nУбедитесь, что /usr/local/bin, идёт до /usr/bin в Вашем PATH.\n\n"
    },
    {
      "title": "GStreamer",
      "level": 3,
      "content": "Установите gst-plugins-good или gstreamer0.10-good-pluginsAUR[ссылка недействительна: package not found], если нужная вам программа использует старую реализацию GStreamer.\n\n"
    },
    {
      "title": "OpenAL",
      "level": 3,
      "content": "Приложение OpenAL должно использовать PulseAudio по умолчанию, но может быть настроено так, чтобы использовать именно его:\n\n```\n/etc/openal/alsoft.conf\n```\n\n```\ndrivers=pulse,alsa\n```\n\nПо умолчанию OpenAL не позволяет pulseaudio перемещать аудиопотоки на другое устройство. Чтобы изменить это, добавьте параметр allow-moves:\n\n```\n/etc/openal/alsoft.conf\n```\n\n```\n[pulse]\nallow-moves=true\n```\n\n"
    },
    {
      "title": "libao",
      "level": 3,
      "content": "Отредактируйте файл настроек libao:\n\n```\n/etc/libao.conf\n```\n\n```\ndefault_driver=pulse\n```\n\nОбязательно удалите опцию alsa драйвера dev=default или настройте его для определения конкретного имени устройства вывода Pulse (sink) или его числа.\n\n"
    },
    {
      "title": "PulseEffects",
      "level": 3,
      "content": "PulseEffects — это GTK-инструмент для применения аудиоэффектов (например, шумоподавления, эквалайзера и т.д.) к входному и выходному аудиосигналу.\n\nДля работы плагинов может понадобиться установка дополнительной зависимости lsp-plugins. Если плагины PulseEffects отображаются серым цветом, попытка запуска демона приводит к ошибке или на вкладке Настройки > PulseAudio не отображаются устройства, попробуйте очистить кэш как описано в [3].\n\nКоллекцию предустановок PulseEffects можно найти в community presets.\n\n"
    },
    {
      "title": "Эквалайзер",
      "level": 3,
      "content": "Если вы хотите использовать другой эквалайзер вместо #PulseEffects, есть следующие варианты.\n\n"
    },
    {
      "title": "Модуль LADSPA",
      "level": 4,
      "content": "Установите pulseaudio-equalizer-ladspa — эквалайзер, основанный на LADSPA swh-plugins. Графический интерфейс запускается командой pulseaudio-equalizer-gtk.\n\n"
    },
    {
      "title": "Встроенный модуль",
      "level": 4,
      "content": "В PulseAudio есть свой 10-полосный эквалайзер. Для его использования установите pulseaudio-equalizer и загрузите нужные модули:\n\n```\n$ pactl load-module module-equalizer-sink\n$ pactl load-module module-dbus-protocol\n```\n\nГрафический интерфейс можно запустить с помощью команды qpaeq.\n\nДля автозапуска эквалайзера при старте PulseAudio создайте .pa файл в каталоге /etc/pulse/default.pa.d/ или ~/.config/pulse/default.pa со следующими строками:\n\n```\n### Load the integrated PulseAudio equalizer and D-Bus module\nload-module module-equalizer-sink\nload-module module-dbus-protocol\n```\n\n"
    },
    {
      "title": "Компрессия",
      "level": 3,
      "content": "Выполнить сжатие динамического диапазона звука (компрессию) можно с помощью #PulseEffects, однако он может создавать много накладных расходов и задержек, поэтому, если вам не нужно ничего кроме компрессии, можно использовать module-ladspa-sink.\n\n"
    },
    {
      "title": "Плагин Стива Хэрриса",
      "level": 4,
      "content": "В наборе плагинов Steve Harris LADSPA есть модули для компрессии. Установите swh-plugins и измените файл настроек PulseAudio следующим образом:\n\n```\n~/.config/pulse/default.pa\n```\n\n```\n.include /etc/pulse/default.pa\n\nset-default-sink название_основного_вывода\n\nload-module module-ladspa-sink sink_name=shw_sc4 sink_master=название_основного_вывода plugin=sc4_1882 label=sc4 control=,,,,,,,,\nset-default-sink shw_sc4\n```\n\nУзнать название основного вывода можно с помощью команды pacmd list-sinks. Перезапустите PulseAudio для применения изменений. В приведённой выше конфигурации пустые параметры управления задают значения по умолчанию.\n\nЧтобы настроить модуль с помощью пользовательских параметров управления, заполните их, соблюдая правильный порядок.\n\nTable content:\nПараметр | Описание\nRMS/peak (0/1) | Переключение между определением пиковых (peak) или среднеквадратичных (RMS) значений. RMS обычно лучше для тонкой, музыкальной компрессии, а peak — для более тяжёлой, быстрой компрессии и перкуссии.\nВремя атаки (мс) | Время атаки в миллисекундах.\nВремя спада (мс) | Время восстановления в миллисекундах.\nПорог (дБ) | Уровень сигнала, при превышении которого компрессор начинает ослаблять сигнал.\nСоотношение (1:n) | Коэффициент ослабления сигнала, используемый, когда уровень сигнала превышает порог. 1 означает отсутствие компрессии; более высокие значения — более сильная компрессия.\nРадиус изгиба (дБ) | Расстояние от порога, на котором начинается кривая изгиба сигнала.\nMakeup gain (дБ) | Регулирует усиление входного сигнала в децибелах.\nАмплитуда (дБ) | Уровень входного сигнала, в децибелах.\nGain reduction (dB) | Степень снижения усиления, применяемая к входному сигналу, в децибелах.\n\nДругие плагины описаны здесь: Steve Harris' LADSPA Plugin Documentation.\n\n"
    },
    {
      "title": "Плагин Calf",
      "level": 4,
      "content": "Есть более профессиональный компрессор от Calf Studio Gear. Установите calf-ladspaAUR и измените конфигурацию следующим образом:\n\n```\n~/.config/pulse/default.pa\n```\n\n```\n.include /etc/pulse/default.pa\n\nset-default-sink your_card_sink_name\n\nload-module module-ladspa-sink sink_name=calf_comp_x2 sink_master=your_card_sink_name plugin=veal label=Compressor control=,,,,,,,,,,\nset-default-sink calf_comp_x2\n```\n\nПлагин имеет 11 параметров. Если вы хотите вставить пользовательские значения, ознакомьтесь со следующей таблицей и не забудьте указать их в правильном порядке.\n\nTable content:\nControl option | Default | Min | Max | Type | Info\nBypass | 0 | 0 | 1 | Bool | \nLevel in | 1 | 0.015625 | 64 | Float db | \nThreshold | 0.125 | 0.000976563 | 1 | Float dbFs | For example, to set -18 db, the right value is 10^(-18/20) = 0.158\nRatio | 2 | 1 | 20 | Float | \nAttack | 20 | 0.01 | 2000 | Float ms | \nRelease | 250 | 0.01 | 2000 | Float ms | \nMakeup | 1 | 1 | 64 | Float db | \nKnee | 2.828427125 | 1 | 8 | Float db | \nRMS/Peak | 0 | 0 | 1 | Bool | 0 = RMS; 1 = Peak\nStereo Link | 0 | 0 | 1 | Bool | 0 = Average; 1 = Max\nMix | 1 | 0 | 1 | Float | Percentage\nОписание каждого параметра доступно в документации.\n\n"
    },
    {
      "title": "Подавление эхо и шума микрофона",
      "level": 3,
      "content": "По умолчанию Arch не загружает модуль шумоподавления PulseAudio, поэтому нужно вручную добавить его в /etc/pulse/default.pa.d/. Сперва проверьте наличие модуля с помощью pacmd и ввода list-modules. Если там нет строки name: <module-echo-cancel>, создайте файл:\n\n```\n/etc/pulse/default.pa.d/noise-cancellation.pa\n```\n\n```\n### Включить шумоподавление\nload-module module-echo-cancel use_master_format=1 aec_method=webrtc aec_args=\"analog_gain_control=0\\ digital_gain_control=1\" source_name=echoCancel_source sink_name=echoCancel_sink\nset-default-source echoCancel_source\nset-default-sink echoCancel_sink\n```\n\nЗатем перезапустите PulseAudio:\n\n```\n$ pulseaudio -k\n$ pulseaudio --start\n```\n\nи через pavucontrol проверьте, что модуль активировался. На вкладке Запись должен появиться источник Echo-Cancel Source Stream.\n\nДобавление beamforming=1 в aec_args также может значительно уменьшить фоновый шум, если у вас более одного микрофона (что часто встречается на многих новых ноутбуках). Однако для beamforming необходимо указать mic_geometry (смотрите ниже).\n\nЕсли вы хотите, чтобы существующие потоки автоматически перемещались на новые источник и вывод, необходимо предварительно загрузить module-switch-on-connect с параметром ignore_virtual=no.\n\n"
    },
    {
      "title": "Возможные 'aec_args' для 'aec_method=webrtc'",
      "level": 4,
      "content": "Ниже представлен список возможных значений 'aec_args' для 'aec_method=webrtc' со значениями, используемыми по умолчанию [5][6]:\n\n- analog_gain_control=1 - Аналоговая АРУ - 'Автоматическая Регулировка Усиления' осуществляется путем прямого изменения громкости - скорее всего приведет к искажениям.\n- digital_gain_control=0 - Цифровая АРУ - 'Автоматическая Регулировка Усиления' осуществляется постобработкой (более высокая нагрузка на процессор).\n- experimental_agc=0 - Позволяет включить экспериментальный механизм АРУ webrtc.\n- agc_start_volume=85 - Уровень начальной громкости при использовании АРУ - Возможные значения 0-255 - Слишком низкий уровень начальной громкости может вовсе нивелировать возможность алгоритма АРУ повысить уровень громкости до достаточного значения [7].\n- high_pass_filter=1 - ?\n- noise_suppression=1 - Подавитель шума.\n- voice_detection=1 - VAD - Обнаружение голосовой активности.\n- extended_filter=0 - Расширенный фильтр, более сложный и устойчивый к неверной задержке ответа от аппаратных устройств, чем обычный фильтр. Расширенный фильтр по умолчанию не активен, так как даёт худшие результаты при обычном разговоре [8]. Включите этот параметр, если ваш микрофон или динамик имеет большую задержку, например, если вы используете беспроводной микрофон или некоторые телевизоры HDMI в качестве динамика.\n- intelligibility_enhancer=0 - Некоторая настройка для webrtc усилителя разбора сигнала.\n- drift_compensation=0 - Компенсация отклонений позволяет избежать эффекта эха между различными устройствами (такими как колонки вашего ноутбука и микрофоном USB вебкамеры). - работает только с \"mobile=0\".\n- beamforming=0 - Это может значительно снизить фоновый шум. Смотрите [9][10] mic_geometry=x1,y1,z1,x2,y2,z2 - Работает только с \"beamforming=1\". target_direction=a,e,r - Работает только с \"beamforming=1\". Примечание: Если модуль не хочет загружаться с этим параметром, установите азимут (a) на желаемое значение, а высоту (e) и радиус (r) установите на 0.\n- mobile=0 - ? routing_mode=speakerphone - Возможные значения \"quiet-earpiece-or-headset,earpiece,loud-earpiece,speakerphone,loud-speakerphone\" - работает только с \"mobile=1\". comfort_noise=1 - ? - работает только с \"mobile=1\".\n\n- mic_geometry=x1,y1,z1,x2,y2,z2 - Работает только с \"beamforming=1\".\n- target_direction=a,e,r - Работает только с \"beamforming=1\". Примечание: Если модуль не хочет загружаться с этим параметром, установите азимут (a) на желаемое значение, а высоту (e) и радиус (r) установите на 0.\n\n- routing_mode=speakerphone - Возможные значения \"quiet-earpiece-or-headset,earpiece,loud-earpiece,speakerphone,loud-speakerphone\" - работает только с \"mobile=1\".\n- comfort_noise=1 - ? - работает только с \"mobile=1\".\n\n"
    },
    {
      "title": "Отключение постобработки звука в некоторых приложениях",
      "level": 4,
      "content": "Если вы используете module-echo-cancel, то, вероятно, дополнительная обработка звука, встроенная в некоторых приложениях, вам не нужна. Вот как её можно отключить:\n\n- Mumble: Настройки -> Исходящий звук Подавление эха -> Отключено Подавление шума -> Выключено Макс. усиление -> 1.0\n- TeamSpeak: Tools -> Options -> Capture Отключите: 'Typing attenuation', 'Remove background noise', 'Echo cancellation' и 'Echo reduction (Ducking)'\n- Firefox: смотрите Firefox/Tweaks#Disable WebRTC audio post processing\n- Steam: В окне \"Список друзей\" -> Настройки списка друзей (шестерёнка) -> Голосовые чаты -> Дополнительные настройки Отключите: \"Эхоподавление\", \"Шумоподавление\", \"Автоматическая регулировка звука и усиления\"\n- Skype: Tools -> Settings... -> Audio & Video -> Microphone -> Automatically adjust microphone settings -> off\n\n1. Настройки -> Исходящий звук\n1. Подавление эха -> Отключено\n1. Подавление шума -> Выключено\n1. Макс. усиление -> 1.0\n\n1. Tools -> Options -> Capture\n1. Отключите: 'Typing attenuation', 'Remove background noise', 'Echo cancellation' и 'Echo reduction (Ducking)'\n\n1. В окне \"Список друзей\" -> Настройки списка друзей (шестерёнка) -> Голосовые чаты -> Дополнительные настройки\n1. Отключите: \"Эхоподавление\", \"Шумоподавление\", \"Автоматическая регулировка звука и усиления\"\n\n1. Tools -> Settings... -> Audio & Video -> Microphone -> Automatically adjust microphone settings -> off\n\n"
    },
    {
      "title": "Скрипт для перезагрузки module-echo-cancel",
      "level": 4,
      "content": "Поскольку module-echo-cancel не всегда нужен или должен быть перезагружен после изменения source_master или sink_master, было бы неплохо иметь простой способ загрузить или перезагрузить module-echo-cancel.\n\nСоздайте следующий скрипт и сделайте его исполняемым:\n\n```\nechoCancelEnable.sh\n```\n\n```\n#!/bin/sh\naecArgs=\"$*\"\n# Если в скрипт не переданы \"aec_args\", то используются по умолчанию эти:\n[ -z \"$aecArgs\" ] && aecArgs=\"analog_gain_control=0 digital_gain_control=1\"\nnewSourceName=\"echoCancelSource\"\nnewSinkName=\"echoCancelSink\"\n\n# \"module-switch-on-connect\" с опцией \"ignore_virtual=no\" (PulseAudio 12 и новее) нужен\n# для автоматического перемещения существующих потоков на новый (виртуальный) источник\n# и выход по умолчанию.\nif ! pactl list modules short | grep \"module-switch-on-connect.*ignore_virtual=no\" >/dev/null 2>&1; then\n\techo Load module \\\"module-switch-on-connect\\\" with \\\"ignore_virtual=no\\\"\n\tpactl unload-module module-switch-on-connect 2>/dev/null\n\tpactl load-module module-switch-on-connect ignore_virtual=no\nfi\n\n# Перезагрузка \"module-echo-cancel\"\necho Reload \\\"module-echo-cancel\\\" with \\\"aec_args=$aecArgs\\\"\npactl unload-module module-echo-cancel 2>/dev/null\nif pactl load-module module-echo-cancel use_master_format=1 aec_method=webrtc aec_args=\\\"$aecArgs\\\" source_name=$newSourceName sink_name=$newSinkName; then\n\t# Установка новых источника и выхода по умолчанию, если module-echo-cancel успешно загрузился.\n\tpacmd set-default-source $newSourceName\n\tpacmd set-default-sink $newSinkName\nfi\n```\n\nДля более удобного запуска через графический интерфейс можно создать ярлык.\n\n"
    },
    {
      "title": "Подавление шума с помощью рекуррентной нейронной сети (RNNoise)",
      "level": 3,
      "content": "Пакет noise-suppression-for-voice предоставляет подавление шума в реальном времени на основе RNNoise: Learning Noise Suppression [11]. Подробнее о настройке можно почитать в репозитории на GitHub [12]. Можно установить графический интерфейс Cadmus (cadmus-debAUR или cadmus-appimageAUR).\n\nДругой альтернативой является noisetorchAUR, который также построен на базе RNNoise. Здесь есть шумоподавление не только входа, но и выхода.\n\n"
    },
    {
      "title": "QEMU",
      "level": 3,
      "content": "Обратитесь к QEMU#Creating an audio backend для детального описания настройки pulseaudio в QEMU.\n\n"
    },
    {
      "title": "AlsaMixer.app",
      "level": 3,
      "content": "Сделайте alsamixer.appAUR dockapp для использования pulseaudio windowmakerAUR, например:\n\n```\n$ AlsaMixer.app --device pulse\n```\n\nВот два примера, где первый - для ALSA, и другой - для pulseaudio. Вы можете запустить несколько его экземпляров. Используйте опцию выбора -w, кнопок управления для привязки к колесику мышки.\n\n```\n# AlsaMixer.app -3 Mic -1 Master -2 PCM --card 0 -w 1\n# AlsaMixer.app --device pulse -1 Capture -2 Master -w 2\n```\n\n"
    },
    {
      "title": "XMMS2",
      "level": 3,
      "content": "Сделайте переключение на вывод pulseaudio\n\n```\n$ nyxmms2 server config output.plugin pulse\n```\n\nи на alsa\n\n```\n$ nyxmms2 server config output.plugin alsa\n```\n\nДля того, чтобы xmms2 использовал другое устройство вывода, например:\n\n```\n$ nyxmms2 server config pulse.sink alsa_output.pci-0000_04_01.0.analog-stereo.monitor\n```\n\nСмотрите также официальное руководство [13][устаревшая ссылка 2024-03-03 ⓘ].\n\n"
    },
    {
      "title": "Рабочая область KDE Plasma и Qt4",
      "level": 3,
      "content": "PulseAudio будет автоматически использоваться приложениями KDE/Qt4. Это поддерживается по умолчанию в микшере звука KDE. Для получения дополнительной информации посмотрите страницу KDE, в wiki PulseAudio.\n\nОдин полезный совет с этой страницы заключён в том, что следует загружать load-module module-device-manager. Обычно это происходит автоматически при входе в систему с помощью скрипта /usr/bin/start-pulseaudio-x11, но если этого не произошло, вы можете добавить его вручную в файл настроек в каталоге /etc/pulse/default.pa.d/. О возможных конфликтах с module-switch-on-connect смотрите в разделе #Переключение при подключении.\n\nЕсли бэкэнд phonon-gstreamer используется для Phonon, GStreamer должен также быть настроен, как описано в разделе #GStreamer.\n\n"
    },
    {
      "title": "Audacious",
      "level": 3,
      "content": "Audacious изначально поддерживает PulseAudio. Для его использования зайдите в Настройки… → Звук → Настройки вывода и выберите модуль «Вывод PulseAudio».\n\n"
    },
    {
      "title": "Music Player Daemon (MPD)",
      "level": 3,
      "content": "Настройте MPD на использование PulseAudio. Смотрите также раздел Music Player Daemon/Tips and tricks#PulseAudio.\n\n"
    },
    {
      "title": "MPlayer",
      "level": 3,
      "content": "MPlayer изначально поддерживает вывод PulseAudio с опцией -ao pulse. Он также может быть настроен для использования вывода PulseAudio по умолчанию, в ~/.mplayer/config для конкретного пользователя, или для всей системы /etc/mplayer/mplayer.conf:\n\n```\n/etc/mplayer/mplayer.conf\n```\n\n```\nao=pulse\n```\n\n"
    },
    {
      "title": "mpv",
      "level": 3,
      "content": "mpv поддерживает PulseAudio аналогично #MPlayer. Пользовательский файл настроек находится в ~/.config/mpv/mpv.conf, общесистемный — в /etc/mpv/mpv.conf.\n\n"
    },
    {
      "title": "guvcview",
      "level": 3,
      "content": "guvcview при использовании входа PulseAudio от Веб-камеры, может перевести аудиовход в \"приостановленный\" режим, в результате чего звук не будет записываться. Вы можете проверить это путем выполнения:\n\n```\n$ pactl list sources\n```\n\nЕсли источник аудиосигналов \"suspended\" (приостановлен), создайте следующий файл .pa:\n\n```\n/etc/pulse/default.pa.d/no-module-suspend-on-idle.pa\n```\n\n```\nunload-module module-suspend-on-idle\n```\n\nИ затем перезапустите PulseAudio или компьютер, и источник будет просто оставаться неактивным, а не переходить в «приостановленный» режим. Теперь guvcview будет писать звук правильно.\n\n"
    },
    {
      "title": "Сетевой звук",
      "level": 2,
      "content": "Одна из уникальных особенностей PulseAudio — способность надёжно передавать аудиопоток от клиентов на сервер, на котором запущен демон PulseAudio, по протоколу TCP в пределах локальной сети. Важно, чтобы время на сервере и клиенте совпадало (например, можно использовать NTP для синхронизации), иначе аудиопоток может быть прерывистым или вообще не работать. Подробности доступны в официальной документации PulseAudio.\n\nВключите модуль TCP на сервере (компьютере, который выполняет фактический вывод звука) путём создания следующего файла .pa:\n\n```\n/etc/pulse/default.pa.d/tcp.pa\n```\n\n```\nload-module module-native-protocol-tcp\n```\n\nИли можно использовать графическое приложение paprefs (root не требуется). Перейдите в раздел Network Server и поставьте галочку Enable network access to local sound devices.\n\nЧтобы убедиться, что module-native-protocol-tcp на сервере загружен, можно использовать команду:\n\n```\n$ pacmd list-modules | grep module-native-protocol-tcp\n```\n\nЧтобы сервер разрешил клиенту подключаться к себе, они должны использовать одинаковый cookie. Скопируйте файл ~/.config/pulse/cookie с одного компьютера на другой. Неважно, чей именно файл cookie вы используете (сервера или клиента); главное, чтобы у сервера и клиента этот файл был одинаковый.\n\nЕсли копирование файла cookie не подходит, можно разрешить доступ к серверу анонимным клиентам, добавив опцию auth-anonymous в module-native-protocol-tcp на сервере (опять же в /etc/pulse/default.pa.d/):\n\n```\nload-module module-native-protocol-tcp auth-anonymous=1\n```\n\nТакже можно выполнять аутентификацию по IP-адресу:\n\n```\nload-module module-native-protocol-tcp auth-ip-acl=127.0.0.1;192.168.0.0/24\n```\n\nИзмените подсеть на ту, с которой подключаются клиенты, которым нужно предоставить доступ.\n\n"
    },
    {
      "title": "Запуск общесистемного экземпляра при загрузке системы",
      "level": 3,
      "content": "Демон PulseAudio обычно запускается как пользовательская служба, когда пользователь входит в систему и пытается воспроизвести какой-либо звук. Для запуска выделенного сервера PulseAudio, принимающего клиентские соединения по TCP, демон должен запускаться при загрузке как системная служба. Обратите внимание, что в большинстве случаев использования настольных компьютеров системный режим, скорее всего, не является правильным выбором.\n\nЧтобы запустить PulseAudio как системную службу, сначала нужно настроить пользователей и группы, необходимые для общесистемного экземпляра сервера PulseAudio [14]:\n\n1. Добавьте пользователя pulse. Демон PulseAudio будет переключаться на него после запуска. # useradd -d /var/run/pulse -s /usr/bin/nologin -G audio pulse\n1. Опционально добавьте пользователя pulse в группу bluetooth, если он у вас есть (bluez) и вы хотите позволить PulseAudio использовать bluetooth. # usermod -aG bluetooth pulse\n1. Добавьте группу pulse-access, которая будет использоваться для контроля доступа к серверу PulseAudio. # groupadd pulse-access\n1. Добавьте в группу pulse-access пользователей, которым вы хотите предоставить доступ к общесистемному экземпляру PulseAudio. # usermod -aG pulse-access root\n\n```\n# useradd -d /var/run/pulse -s /usr/bin/nologin -G audio pulse\n```\n\n```\n# usermod -aG bluetooth pulse\n```\n\n```\n# groupadd pulse-access\n```\n\n```\n# usermod -aG pulse-access root\n```\n\nВ каталоге /etc/systemd/system создайте юнит pulseaudio.service:\n\n```\n/etc/systemd/system/pulseaudio.service\n```\n\n```\n[Unit]\nDescription=Sound Service\n\n[Service]\n# Имейте в виду, что notify будет работать только с опцией --daemonize=no\nType=notify\nExecStart=/usr/bin/pulseaudio --daemonize=no --exit-idle-time=-1 --disallow-exit=true --system --disallow-module-loading\nRestart=always\n\n[Install]\nWantedBy=default.target\n```\n\nЗатем включите общесистемную службу pulseaudio.service. Также нужно отключить пользователькую службу PulseAudio:\n\n```\n# systemctl --global mask pulseaudio.socket\n```\n\nЭто необходимо, даже если вы получаете доступ к системе по SSH, чтобы служба PulseAudio на уровне пользователя никогда не запускалась.\n\n"
    },
    {
      "title": "Выбор сервера",
      "level": 3,
      "content": "Для однократного использования в оболочке или для отдельной команды можно прописать имя хоста или IP-адрес нужного сервера PulseAudio в переменной окружения $PULSE_SERVER.\n\n```\n$ env PULSE_SERVER=домен-или-ip-сервера mplayer test.mp3\n```\n\nПостоянную настройку можно записать в файл ~/.pulse/client.conf или /etc/pulse/client.conf.\n\n```\ndefault-server = домен-или-ip-сервера\n```\n\nТакже можно указать несколько серверов через пробел, к которым клиент PulseAudio будет пытаться подключаться по очереди [15]:\n\n```\ndefault-server = сервер1 запасной-сервер\n```\n\n"
    },
    {
      "title": "Регулировка звука клавиатурой",
      "level": 3,
      "content": "Привяжите следующие команды к своим кнопкам регулировки громкости: XF86AudioRaiseVolume, XF86AudioLowerVolume, XF86AudioMute. Подробнее это рассмотрено здесь: Горячие клавиши#Xorg.\n\nВо-первых, найдите устройство вывода, которое является источником звука, которым вы хотите управлять. Для отображения списка доступных выводов используйте команду:\n\n```\n$ pactl list sinks short\n```\n\nПредположим, что используется источник 0, тогда для увеличения громкости:\n\n```\n$ sh -c \"pactl set-sink-mute 0 false ; pactl set-sink-volume 0 +5%\"\n```\n\nДля понижения громкости:\n\n```\n$ sh -c \"pactl set-sink-mute 0 false ; pactl set-sink-volume 0 -5%\"\n```\n\nОтключить/включить звук:\n\n```\n$ pactl set-sink-mute 0 toggle\n```\n\nОтключить/включить микрофон:\n\n```\n$ pactl set-source-mute 1 toggle\n```\n\n- Чтобы клавиатурные сокращения всегда работали с устройством вывода по умолчанию, установите @DEFAULT_SINK@ как номер устройства вывода, например, pactl set-sink-mute @DEFAULT_SINK@ toggle.\n- Для более продвинутого управления, например, для ограничения максимальной громкости, используйте один из консольных интерфейсов.\n\n"
    },
    {
      "title": "Проигрывание звука через неинтерактивную оболочку (служба systemd, cron)",
      "level": 3,
      "content": "Установите XDG_RUNTIME_DIR перед командой (замените user_id на ID пользователя, запускающего PulseAudio):\n\n```\n$ XDG_RUNTIME_DIR=/run/user/user_id paplay /usr/share/sounds/freedesktop/stereo/complete.oga\n```\n\nИли используйте machinectl:\n\n```\n# machinectl shell .host --uid=user_id /usr/bin/paplay /usr/share/sounds/freedesktop/stereo/complete.oga\n```\n\n"
    },
    {
      "title": "Сигналы событий X11",
      "level": 3,
      "content": "Для передачи pulseaudio управления сигналами событий X11, выполните следующие команды после запуска сеанса X11:\n\n```\n$ pactl upload-sample /usr/share/sounds/freedesktop/stereo/bell.oga bell-window-system\n$ pactl load-module module-x11-bell display=$DISPLAY\n```\n\nИли пропишите настройки в /etc/pulse/default.pa.d/ или ~/.config/pulse/default.pa:\n\n```\n~/.config/pulse/default.pa\n```\n\n```\n.include /etc/pulse/default.pa\n\n# audible bell\nload-sample-lazy bell-window-system /usr/share/sounds/freedesktop/stereo/bell.oga\nload-module module-x11-bell\n```\n\nДля настройки уровня громкости сигналов X11 запустите команду:\n\n```\n$ xset b 100\n```\n\n100 - это уровень в процентах. Для корректной работы потребуется пакет xorg-xset. Чтобы узнать как запускать данные команды автоматически при загрузке сессии X11, ознакомьтесь с разделом Autostarting (Русский).\n\n"
    },
    {
      "title": "Переключение при подключении",
      "level": 3,
      "content": "Модуль switch-on-connect переключает вывод звука на новые устройства при их подключении. Например, если вы подключите USB-гарнитуру, то звук будет переведён на неё. Если вы её отключите, то звук вернётся на последнее используемое устройство.\n\nПо умолчанию этот модуль отключен, так как его поведение слишком агрессивное, но его можно включить добавлением строки load-module module-switch-on-connect в файл ~/.config/pulse/default.pa.\n\n"
    },
    {
      "title": "Скрипт для переключения аналоговых выходов",
      "level": 3,
      "content": "Некоторые звуковые карты обладают несколькими аналоговыми выходами, которые можно переключать через профили Pulseaudio. Но переключение вручную может быть неудобным, и вы можете использовать для этого следующую команду:\n\n```\n$ pactl set-sink-port 'number of the card' 'port'\n```\n\nТаким образом, выбранный вами порт станет выходом по умолчанию. Пример:\n\n```\n$ pactl set-sink-port 0 \"analog-output;output-speaker\"\n```\n\nСписок портов можно получить, используя:\n\n```\n$ pactl list\n```\n\nТекущий выход можно отобразить командой:\n\n```\n$ pactl list sinks | grep \"active profile\"| cut -d ' ' -f 3-\n```\n\nЭти операции можно автоматизировать простым скриптом. Затем пользователь может назначить его на ярлык:\n\n```\n~/pa.sh (или любое другое название)\n```\n\n```\n#!/bin/sh\n# Этот скрипт использует уведомления kdialog для предупреждения пользователя о том, что текущий профиль изменён. Пользователь может доработать его для своих нужд или совсем изменить.\n\nCURRENT_PROFILE=$(pactl list sinks | grep \"active profile\"| cut -d ' ' -f 3-)\n\nif [ \"$CURRENT_PROFILE\" = \"analog-output;output-speaker\" ] ; then\n        pactl set-sink-port 0 \"analog-output;output-headphones-1\"\n        kdialog --title \"Pulseaudio\" --passivepopup \"Headphone\" 2 & \nelse \n        pactl set-sink-port 0 \"analog-output;output-speaker\"      \n        kdialog --title \"Pulseaudio\" --passivepopup  \"Speaker\" 2 &\nfi\n```\n\nЭтот скрипт предназначен для переключения между двумя профилями. Сначала он проверяет текущий профиль, а затем заменяет его. Пользователям необходимо изменить поле 'active profile' в соответствии с языком, который предоставил pactl. Пользователям, возможно, понадобится изменить номер карты и выхода для настройки под свою конкретную систему.\n\n"
    },
    {
      "title": "Отключение заглушения медиа при голосовом вызове (module-role-cork)",
      "level": 3,
      "content": "При голосовом вызове (например, в Microsoft Teams и, возможно, других подобных программах) любые мультимедийные приложения могут быть заглушены. Чтобы отключить это поведение, можно отключить этот модуль в конфигурации PulseAudio:\n\n```\n/etc/pulse/default.pa.d/no-cork.pa\n```\n\n```\nunload-module module-role-cork\n```\n\n"
    },
    {
      "title": "Продвинутая настройка и сценарии использования",
      "level": 2,
      "content": "Смотрите PulseAudio/Примеры.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Смотрите PulseAudio/Решение проблем.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальный сайт PulseAudio с документацией\n- Pulseaudio under the hood\n\n"
    }
  ]
}