{
  "title": "PuTTY (Português)",
  "url": "https://wiki.archlinux.org/title/PuTTY_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- ssh\n- telnet\n- Proxy settings\n\nPuTTY é uma port do popular cliente de interface gráfica para conexão SSH, Telnet, Rlogin e serial para Windows. Ele tem suporte para opções avançadas de log e termcap, bem como uma aparência muito configurável e a capacidade de encaminhar portas ou criar um túnel SOCKS através de um destino SSH. Para começar, simplesmente execute o PuTTY, digite o nome do host do host ao qual você gostaria de se conectar e pressione Open para abrir.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale putty.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "As configurações podem ser modificadas através das abas à esquerda, no entanto, elas serão redefinidas se não forem salvas. Para salvar suas configurações, digite um nome na caixa, em \"Saved Sessions\", e clique em \"Save\". Para carregá-las novamente mais tarde, clique no nome do seu salvamento e clique em \"Load\". Isso permite que você mantenha de forma persistente suas configurações visuais, termcap e de conexão entre as conexões e também permite que você mantenha um salvamento por host usado regularmente. O salvamento \"Default Settings\" é automaticamente carregado toda vez que você inicia o PuTTY, então salve sob esse nome com cuidado.\n\n"
    },
    {
      "title": "Importando chaves",
      "level": 2,
      "content": "O PuTTY usa seu próprio formato para armazenar as chaves privadas no lado do cliente. Para importar uma chave que você gerou anteriormente, você precisa usar o comando puttygen.\n\n```\n$ puttygen arquivo-de-chave -o saída-chave-de-chave.ppk\n```\n\nsendo arquivo-de-chave um arquivo de chave privada existente e saída-arquivo-de-chave.ppk o arquivo que receberá a chave.\n\nSe o arquivo-de-chave estiver protegido com uma senha, você será solicitado a inseri-la, mas a chave ainda será protegida posteriormente no saída-arquivo-de-chave.ppk.\n\nApós isso, você pode importá-la para fazer uma conexão SSH: Connection > SSH > Auth > Private key file for authentication e clique em Browse... para adicioná-la.\n\n"
    },
    {
      "title": "Suporte a 256 cores",
      "level": 2,
      "content": "Settings > Connection > Data : Terminal-type string = putty-256color\n\nPara testar suporte a cor, execute o seguinte comando[2]:\n\n```\nfor code in {0..255}; do echo -e \"\\e[38;05;${code}m $code: Test\"; done\n```\n\nVeja 256colours para detalhes.\n\n"
    }
  ]
}