{
  "title": "Python (Українська)",
  "url": "https://wiki.archlinux.org/title/Python_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Уся інформація взята з What is Python?:\n\n"
    },
    {
      "title": "Встановлення",
      "level": 2,
      "content": "Встановіть python пакети\n\n"
    },
    {
      "title": "Інші Версії",
      "level": 3,
      "content": "Минулі та майбутні версії Python доступні через AUR. Можливо використовувати якщо старі застосунки не запускаються на новій версії python, або ви хочете отримати більш нову версію, або ще щось.\n\n- Python 3.12: python312AUR Альфа реліз\n- Python 3.10: python310AUR\n- Python 3.9: python39AUR\n- Python 3.8: python38AUR\n- Python 3.7: python37AUR\n- Python 3.6: python36AUR (не підтримується)\n- Python 2.7: python2AUR (не підтримується)\n\nКожен з цих пакетів інсталює окремий бінарний файл, котрий називається за номером, наприклад python3.7 це Python 3.7, з можливістю використовувати одразу декілька версій на одному пристрої. Також для зручного встановлення ви можете використовувати pyenv.\n\nРізні модулі, котрі використовуються для кожної версії python, на AUR треба шукати як python<версія без пробілів>, тобто для Python 3.7 треба писати python37.\n\nТакож ви можете завантажити вихідний код з сайту https://www.python.org/downloads/.\n\n"
    },
    {
      "title": "Альтернативні Імплементації",
      "level": 3,
      "content": "З пакетом python автоматично встановлюється CPython. Ця імплементація допомагає запускати С код всередені коду python. Також ця імплементація повністю сумісна зі старими версія python.\n\nІнші імплементації котрі доступні в Arch Linux:\n\n- PyPy — Це python заміна CPython. PyPy набаго краще оптимізований, потербує менше пам'яті і ресурсів процесора.\n\n- Jython — Це імплементація python написана на Java. Вона допомагає запускати python код всередині коду Java, або використовувати бібліотеки Java в коді python.\n\n- micropython — Це імплементація python для мікроконтролерів. Вона допомагає запускати деякі бібліотеки та оптимізований код на мікроконтролері.\n\n- IronPython — Це імплементація python для інтеграції з .NET. Це дозволяє використовувати бібліотеки .NET і також суміщати написаний вами код між Python та .NET.\n\nБільше про Імплементації Тут. Також існують Stackless, Pyston[мертве посилання 2025-03-15 ⓘ] та Cinder, ці імплементації вже використовують різні технологічні компанії для своїх задач. Також є багато історично важливих імплементацій для Python.\n\n"
    },
    {
      "title": "Альтернативні Оболонки",
      "level": 3,
      "content": "У python є власна оболонка для запуску своїх команд. По суті це як термінал, котрий існує тільки для самого python. Але як і імплементації, оболонки також мають різні варіації.\n\n- bpython — Приємний інтерфейс для інтерпретатора python.\n\n- IPython — Потужна і сучасна оболонка python.\n\n- Jupyter — Веб додаток для обчислень від IPython.\n\n- ptpython — Розширений python REPL, котрий зроблений на prompt-toolkit.\n\n"
    },
    {
      "title": "Пакетні Менеджери Python",
      "level": 2,
      "content": "Ці пакетні менеджери Python можна встановити в Arch Linux.\n\n- Official repositories і AUR — містять величезну кількість популярних репозиторієв для Python. Це бажаний шлях для встановлення в саму систему.\n- pip(1) — Офіційний встановлювач пакетів для Python. Ви можете використовувати для встановлення пакетів цей -> Python Package Index або цей index.\n\n- pipx — Тісно пов'язаний з pip, але створений для того щоб користувачи могли запускати на ізольованому від основного оточенні для кожної програми та пов'язаною з неї пакетів, для зменшення кількості конфліктів між системою та пакетами. Зосереджено на пакетах які можна запускати у командному рядку. Ви можете завантажити pipx тут Python Package Index або тут\n\n- Anaconda — це open source пакетний менеджер системи та оточення, створений для програм Python. Ви можете встановити його з Anaconda repositories.\n\n- Miniconda — Це полегшена альтернатива Anaconda, яка встановлює пакетний менеджер, але не встановлює пакети наукових обчислень по стандарту.\n\n"
    }
  ]
}