{
  "title": "Qutebrowser (Polski)",
  "url": "https://wiki.archlinux.org/title/Qutebrowser_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "qutebrowser jest przeglądarką skoncentrowaną na klawiaturze opierającą się na Pythonie i PyQt5.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiet qutebrowser albo qutebrowser-gitAUR.\n\n"
    },
    {
      "title": "Podstawowe użycie",
      "level": 2,
      "content": "Użyj : aby dostać się do wiersza poleceń. Możesz użyć Tab żeby autouzupełnić.\n\nPrzy pierwszym uruchomieniu qutebrowser, strona szybkiego startu się pojawia. Jest ona później dostępna przez :help. Zobacz ściągawke ze skrótami klawiszowymi.\n\n"
    },
    {
      "title": "Konfiguracja użytkownika",
      "level": 3,
      "content": "Qutebrowser może być skonfigurowane przez interfejs, wiersz poleceń qutebrowser lub skrypt Pythona. Własna dokumentacja qutebrowsera wyjaśnia w detalach jak skonfigurować qutebrowser tymi trzema metodami. Żeby otworzyć strone pomocy, wpisz :help i potem wybierz Configuring qutebrowser.\n\nŻeby odnaleść ścieżke gdzie plik konfiguracyjny jest zlokalizowany, otwórz specjalną strone qute://version. Na Arch Linuxie, ten plik zazwyczaj znajduje się w $XDG_CONFIG_HOME/qutebrowser/. Konfiguracja stworzona przez qutebrowser będzie znajdować się w autoconfig.yml (który nie powinien być dotykany przez użytkownika) a skrypt Pythona użytkownika znajduje się w config.py.\n\n"
    },
    {
      "title": "Konfiguracja w Qutebrowser",
      "level": 4,
      "content": "Żeby skonfigurować pojedyńczą rzecz możesz poprostu wpisać :set i imie nazwy elementu konfiguracji i nowej wartości do której chcesz ustawić. Na przykład możesz napisać\n\n```\n:set auto_save.session true\n```\n\nżeby otworzyć poprzednie karty kiedy otworzysz spowrotem qutebrowser.\n\nŻeby otworzyć interfejs ustawien qutebrowsera, wpisz\n\n```\n:set\n```\n\nbez żadnych dodatkowych argumentów. Tam możesz zedytować różne ustawienia korzystająć z interfejsu. Kiedy skończysz napisz :set ponownie żeby zapisać swoją konfiguracje.\n\nDla przykładu pod url.searchengines możesz ustawić swoją wyszukiwarke. Jeśli jeszcze nie zmieniłeś tego ustawienia wcześniej to powinno ono wyglądać tak\n\n```\n{\"DEFAULT\": \"https://duckduckgo.com/?q={}\"}\n```\n\nTo ustawi DuckDuckGo jako twoją domyślną wyszukiwarke. Symbol zastępczy {} będzie zastąpiony twoim wynikiem wyszukiwania. Żeby dodać skrót do szybkiego wyszukiwania w Arch Wiki możesz użyć\n\n```\n{\"DEFAULT\": \"https://duckduckgo.com/?q={}\", \"wa\": \"https://wiki.archlinux.org/?search={}\"}\n```\n\nJak opisane przez komentarz w intefejsie qutebrowser, możesz przeszukać Arch Wiki wpisując o wa <searchterm>. Zauważ że argumenty potrzebne przez wyszukiwarki różnią się. Dla przykładu żeby ustawić Startpage użyj https://www.startpage.com/do/metasearch.pl?query={}\n\n"
    },
    {
      "title": "Skróty klawiszowe",
      "level": 3,
      "content": "Skróty klawiszowe siedzą w $XDG_CONFIG_HOME/qutebrowser/keys.conf.\n\nMożesz zedytować skróty klawiszowe bezpośrednio z przeglądarki korzystając z :bind key command lub możesz bezpośrednio w pliku. Zauważ że tam jest dużo skrótów klawiszowych. Jeżeli zauważysz opóźnienie na swoim ustawionym skrócie klawiszowym, prawdopodobnie jest to z powodu że istnieje skrót klawiszowy korzystający z tego samego pierwszego klawisza.\n\n"
    },
    {
      "title": "Odtwarzanie wideo",
      "level": 3,
      "content": "Zobacz Browser plugins#Multimedia playback.\n\n"
    },
    {
      "title": "Włącz sprawdzanie pisowni",
      "level": 3,
      "content": "Pierw, pobierz właściwy słownik używając skrypt dictcli.py który przychodzi załączony z qutebrowser.\n\nDla przykładu, dla Polskiego (PL):\n\n```\n# /usr/share/qutebrowser/scripts/dictcli.py install pl-PL\n```\n\nSkrypt ma również inne funkcje, mogą być wyświetlone wpisując --help.\n\nPotem ustaw w qutebrowser:\n\n```\n:set spellcheck.languages [\"pl-PL\"]\n```\n\n"
    },
    {
      "title": "Zmniejsz odciski przeglądarki",
      "level": 3,
      "content": "Strony mogą być w stanie zidentyfikować ciebie bazując na zebranych informacjach jak rozmiar ekranu, agent użytkownika, nagłówki HTTP_ACCEPT i więcej. Zobacz [1] dla więcej informacji jak i również przetestowania wyjątkowości twojej przeglądarki. Poniżej jest kilka małych króków które mogą być podjęte żeby nasza instalacja qutebrowsera była bardziej pospolita.\n\nDodatkowo zobacz Firefox/Privacy#Configuration dla więcej pomysłów.\n\n"
    },
    {
      "title": "Ustaw pospolity agent użytkownika",
      "level": 4,
      "content": "Kilkanaście agentów użytkownika jest do wybrania jako opcje gdy wpiszemy set content.headers.user_agent. Kolejnym bardziej pospolitym agentem użytkownika jest:\n\n```\nMozilla/5.0 (Windows NT 6.1; rv:52.0) Gecko/20100101 Firefox/52.0\n```\n\n- Zmiana Linux x86_64 na nie-Linuxową platforme może stworzyć twoją przeglądarke bardziej unikatową, odkiedy strony mogą również zdobyć twoją platforme przez Javascript i to nie może być zmienione w qutebrowser.\n- Zmiana twojego agenta użytkownika z domyślnego może uniemożliwić prawidłowe działanie niektórych witryn. Dla przykładu, CAPTCHA wspomni że twoja przeglądarka nie jest wspierana jeżeli agent użytkownika jest zapisany jako nieaktualna przeglądarka.\n\n"
    },
    {
      "title": "Ustaw pospolity nagłówek HTTP_ACCEPT",
      "level": 4,
      "content": "Następujący jest pospolitym nagłówkiem HTTP_ACCEPT (domyślny Firefoxa). Wpisz te komendy w wierszu polecenia\n\n```\nset content.headers.accept_language en-US,en;q=0.5\nset content.headers.custom '{\"accept\": \"text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8\"}'\n```\n\n"
    },
    {
      "title": "Wyłącz czytanie z płótna",
      "level": 4,
      "content": "Ta opcja nie jest obecnie dostępna w qutebrowserze inaczej niż określając ją w wierszu poleceń jak:\n\n```\n$ qutebrowser --qt-flag disable-reading-from-canvas\n```\n\nZobacz issue #2235 dla więcej informacji.\n\n"
    },
    {
      "title": "Wyłączanie WebGL",
      "level": 4,
      "content": "Ustaw content.webgl na false żeby wyłączyć WebGL.\n\n"
    },
    {
      "title": "Zarządzanie sesjami jak w dwb",
      "level": 3,
      "content": "Żeby ustawić qutebrowser, żeby zarządzać sieciami bardziej jak w dwb z flagą --restore opcją (wiele jednocześnie aktywnych sesji), możesz użyć ten skrypt[dead link 2024-12-15 ⓘ]. Korzysta on z --basedir żeby oddzielić dane, cache i śrowisko wykonawcze dla każdej sesji, zostawiając konfiguracje podzieloną.\n\n"
    },
    {
      "title": "Blokowanie stron",
      "level": 3,
      "content": "Ustaw c.content.host_blocking.lists.append( str(config.configdir) + \"/blockedHosts\") w swoim config.py i stwórz plik nazwany blockedHosts w tym samym folderze co twój plik konfiguracyjny. Wprowadź strony które chciałbyś zablokować, jedną pod drugą; 127.0.0.1 www.google.com dla przykładu. To zachowa wbudowaną liste adblocka dodając twoją obok. Zrestartuj qutebrowser :restart i wpisz :adblock-update. Żeby usunąć liste wbudowaną w qutebrowser usuń ~/.local/share/qutebrowser/blocked-hosts.\n\n"
    },
    {
      "title": "Zobacz również",
      "level": 2,
      "content": "- Repozytorium na GitHubie\n- Strona główna\n- Wątek BBS\n- Przykład nowego configu\n\n"
    }
  ]
}