{
  "title": "Rar (Español)",
  "url": "https://wiki.archlinux.org/title/Rar_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-03-18** \n\nRAR (y UNRAR) es el puerto de Linux de la versión de línea de órdenes de WinRAR disponible en las plataformas i686 y x86-64.\n\n"
    },
    {
      "title": "Características clave",
      "level": 2,
      "content": "- Cantidades variables de redundancia (\"registro de recuperación\" o \"volúmenes de recuperación\" que se muestran a continuación) pueden ser añadidas a un archivo, haciéndolo mas resistente a la corrupción. Incluso si algunas partes de un archivo están dañadas, es un posible recuperar completamente los datos almacenados si existe un registro de recuperación suficientemente grande. Por si mismo, TAR no tiene esta capacidad.\n- RAR es capaz de manejar eficientemente volúmenes divididos. El soporte integrado para archivos multi-volumen permite al programa de desmpaquetado que simplemente solicite al usuario por el siguiente archivo .parteXXX del archivo RAR, sin la necesidad de copiar manualmente y volver a unir las partes, o para extraer un archivo único sin necesitar todas las partes. RAR no soporta cintas, ya que utiliza operaciones de búsqueda y renombrado en sus archivos.\n- Los archivos RAR pueden ser un formato sólido, en donde todos los archivos comprimidos son tratados como un bloque de datos único. Los formatos de compresión mas utilizados actualmente (con excepción del viejo ZIP) permiten un estructuración sólida.\n- Fuertes capacidades de cifrado. Las versiones anteriores del formato de archivo usaban un algoritmo propietario; las versiones recientes usan el algoritmo de cifrado AES, un cifrado de bloque adoptado como estándar de cifrado por el gobierno de Estados Unidos. Las únicas formas conocidas para recuperar un archivo cifrado son a través de diccionario o ataques de fuerza bruta. En versiones recientes, la protección con contraseña también puede proteger opcionalmente los nombres de archivo, de modo que los nombres de archivos contenidos en el archivo no se mostrarán sin la contraseña correcta.\n\n"
    },
    {
      "title": "RAR",
      "level": 3,
      "content": "Obtenga rarAUR (paquete completo sin UNRAR) disponible en AUR (Español).\n\n"
    },
    {
      "title": "UNRAR",
      "level": 3,
      "content": "unrar es provisto por separado y reside en los repositorios oficiales. Instálelo vía pacman como siempre.\n\n"
    },
    {
      "title": "Archivo de configuración",
      "level": 2,
      "content": "RAR para Linux lee la información de configuración desde el archivo ~/.rarrc (es decir, en el directorio de inicio del usuario) o si desea definir un conjunto de opciones globales para todos los usuarios en el directorio /etc.\n\nLa sintaxis del archivo es simplemente la siguiente cadena:\n\n```\nswitches=any RAR switches, separated by spaces\n```\n\nPor ejemplo:\n\n```\nswitches=-m5 -rr5 -ol -msjpg;mp3;avi;zip;rar;tar;gz;jpg\n```\n\nPara una listado completo y explicaciones de los modificadores de rar, consulte la página del manual.\n\n"
    },
    {
      "title": "Sintaxis General",
      "level": 3,
      "content": "```\n$ rar command -switch 1 -switch N archive files.rar @listfiles...\n```\n\nPara un listado completo de órdenes y modificadores, consulte la última seccción de éste artículo o simplemente ejecute rar.\n\n"
    },
    {
      "title": "Compresión recursiva de una estructura directorios completa",
      "level": 3,
      "content": "- Tarea: respaldar /home/darkhorse en /media/data/darkhorse-backup.rar usando registros de recuperación del 10 %:\n\n```\n$ rar a -r -rr10 /media/data/darkhorse-backup.rar /home/darkhorse\n```\n\n- Explicado:\n\nTable content:\nModificador | Acción\na | agrega archivos a los archivos comprimidos.\n-r | recursión de subdirectorios (incluye a todos los directorios/archivos bajo el directorio principal).\n-rr10 | agrega registros de recuperación al archivo. Ésto eleva a un 10% que el archivo comprimido llegue a ser corrupto o inutilizable, y que llegue a ser capaz de recuperar los datos por paridad.\n\n"
    },
    {
      "title": "Archivos en Modo Mixto",
      "level": 3,
      "content": "Puede usar también archivos en modo mixto de lo cual significa que los tipos de archivo que especifique no sean comprimidos - simplemente se almacenan.\n\n- Tarea: respaldar /home/darkhorse en /media/data/darkhorse-backup.rar:\n\n```\n$ rar a -r -rr10 -s -m5 -msjpg;mp3;tar /media/data/darkhorse-backup.rar /home/darkhorse\n```\n\n- Explicación:\n\nTable content:\nModificador | Acción\na | agrega archivos al archivo comprimido.\n-r | recursión de subdirectorios (incluye a todos los directorios/archivos bajo el directorio principal).\n-rr10 | agrega registros de recuperación al archivo. Ésto eleva a un 10% que el archivo comprimido llegue a ser corrupto o inutilizable, y que llegue a ser capaz de recuperar los datos por paridad.\n-m5 | Usa el nivel mas alto de compresión (m0 = almacena ... m3 = default ... m5 = máximo nivel de compresión.\n-msjpg;mp3;tar | ignora la opción de compresión y almacena todos los archivos .jpg y .mp3 y .tar.\n\n"
    },
    {
      "title": "Compresión recursiva de muchas estructuras de directorio usando una lista",
      "level": 3,
      "content": "- Tarea: comprimir /home/darkhorse y /home/palomino y /home/seabiscuit en /media/data/homes-backup.rar.\n\nPrimero cree una lista (un simpe archivo de texto) que contenga los distintos objetivos. En este ejemplo, la lista será de tres largas líneas. La nombré 'home-list' en éste ejemplo pero puede llamarlo como quiera.\n\n```\n/home/darkhorse\n/home/palomino\n/home/seabiscuit\n```\n\n```\n$ rar a -r -rr10 -s /media/data/homes-backup.rar @/path/to/home-list\n```\n\n"
    },
    {
      "title": "Sintaxis General",
      "level": 3,
      "content": "```\n$ unrar command -switch 1 -switch N archive files... @listfiles... path_to_extract\\\n```\n\nPara una lista completa de órdenes y modificadores simplemente ejecute:\n\n```\n$ unrar h\n```\n\nPara extraer en un nueva carpeta:\n\n```\n$ unrar x /media/data/homes-backup.rar homes-backup/\n```\n\nPara archivos multi-partes, ejecute:\n\n```\n$ unrar x homes-backup.part1.rar homes-backup/\n```\n\n"
    }
  ]
}