{
  "title": "Recommandations générales",
  "url": "https://wiki.archlinux.org/title/Recommandations_g%C3%A9n%C3%A9rales",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Frequently asked questions (Français)\n- Installation guide (Français)\n- List of applications\n\nCe document indexe différents articles, et d'importantes informations pour améliorer et ajouter des fonctionnalités après l'installation d'un système Arch. Il est présupposé que le lecteur a suivi le guide d'installation de base. Avoir lu et compris les paragraphes #Administration du système et #Gestion des paquets est nécessaire pour suivre les autres sections de cette page, et les autres articles du wiki.\n\n"
    },
    {
      "title": "Administration du système",
      "level": 2,
      "content": "Cette section traite des tâches administratives et de la gestion du système. Consultez Core utilities et Category:System administration pour en savoir plus.\n\n"
    },
    {
      "title": "Utilisateurs et groupes",
      "level": 3,
      "content": "Une installation nouvelle ne crée pas d'autre utilisateur que le super-utilisateur (aussi appelé \"root\"). Être connecté en tant que root durant une durée prolongée engendre une vulnérabilité du système. De même, exposer le compte root via SSH n'est pas une pratique sûre. A l'inverse, vous devriez plutôt créer un utilisateur non-privilégié pour la majorité des utilisations, et réserver le compte administrateur pour l'administration du système. Consultez Users and groups (Français)#Gestion des utilisateurs pour plus de détails.\n\nLes administrateurs devraient régler «au plus juste» les autorisations d'accès aux ressources du système, et refuser celles-ci aux utilisateurs et services n'en ayant pas besoin pour limiter les risques. Voir Utilisateurs et Groupes pour plus de détails.\n\n"
    },
    {
      "title": "Sécurité",
      "level": 3,
      "content": "Lisez Security pour des recommandations et les meilleures pratiques sur le durcissement du système.\n\nPour une liste d'applications permettant d'exécuter des commandes ou de lancer un shell interactif en tant qu'autre utilisateur (par exemple, root), consultez List of applications/Security#Privilege elevation.\n\n"
    },
    {
      "title": "Gestion des services",
      "level": 3,
      "content": "Arch Linux utilise systemd comme gestionnaire d'initialisation et de services. Afin de maintenir votre Arch en bon état, il vous est recommandé d'apprendre les bases de son utilisation.\n\nLes interactions avec systemd passent pas la commande systemctl. Voir Systemd (Français)#Utilisation basique de systemctl pour les fondamentaux de son utilisation.\n\n"
    },
    {
      "title": "Maintenance du système",
      "level": 3,
      "content": "Par sa nature de rolling release, Arch a besoin d'une maintenance régulière.\n\n"
    },
    {
      "title": "Gestion des paquets",
      "level": 2,
      "content": "Cette section contient des informations utiles relatives à la gestion des paquets. Consultez Frequently asked questions (Français)#Gestion des paquets et Category:Package management pour en savoir plus.\n\nNote: **avant** \n\n"
    },
    {
      "title": "pacman",
      "level": 3,
      "content": "pacman est le gestionnaire de paquets d'Arch Linux. Tous les utilisateurs d'Arch doivent être à l'aise avec son utilisation avant de lire tout autre article de ce wiki;\n\nConsultez la page Pacman Trucs et Astuces pour améliorer vos interactions avec ce dernier.\n\n"
    },
    {
      "title": "Dépôts",
      "level": 3,
      "content": "Consultez la page Dépôts pour comprendre les objectifs des différents dépôts officiels.\n\nSi vous prévoyez d'utiliser des applications 32 bits, vous aurez besoin d'activer le dépôt multilib.\n\nL'article Dépôts non officiels des utilisateurs liste plusieurs autres dépôts non pris en charge officiellement.\n\nEnfin, si vous souhaitez aider les développeurs d'Arch à prioriser leurs efforts sur les paquets les plus utilisés, vous pouvez envisager l'installation du service pkgstats (en).\n\n"
    },
    {
      "title": "Miroirs",
      "level": 3,
      "content": "Consultez l'article Miroirs pour savoir comment tirer pleinement parti de l'utilisation des miroirs les plus rapides et les plus à jour des dépôts officiels. Comme expliqué dans l'article, un conseil particulièrement judicieux est de vérifier régulièrement l'État des miroirs pour obtenir une liste des miroirs qui ont été récemment synchronisés.\n\n"
    },
    {
      "title": "Arch Build System",
      "level": 3,
      "content": "Les Ports sont un système initialement utilisé par les distributions BSD consistant en des scripts de construction qui résident dans une arborescence de répertoires sur le système local. En termes simples, chaque port contient un script dans un répertoire nommé intuitivement d'après l'application tierce installable.\n\nLe Système de construction d'Arch (ABS) offre la même fonctionnalité en fournissant des scripts de construction appelés PKGBUILDs, qui sont remplis d'informations pour un logiciel donné : hachage d'intégrité, URL du projet, version, licence et instructions de construction. Ces PKGBUILDs sont analysés par makepkg, le programme qui génère les paquets qui peuvent être gérés proprement par pacman.\n\nTous les paquets des dépôts ainsi que ceux présents dans l'AUR sont soumis à une recompilation avec makepkg.\n\n"
    },
    {
      "title": "Arch User Repository",
      "level": 3,
      "content": "Alors que le système de construction Arch permet de construire des logiciels disponibles dans les dépôts officiels, le Dépôt des utilisateurs d'Arch (AUR) est l'équivalent pour les paquets soumis par les utilisateurs. Il s'agit d'un dépôt non pris en charge de scripts de construction accessible par l'interface web ou par l'interface RPC Aurweb.\n\n"
    },
    {
      "title": "Démarrage",
      "level": 2,
      "content": "Cette section concerne les informations relatives au processus de démarrage (aussi dit processus de boot). Une vue générale et théorique dudit processus peut être trouvé à la page Processus de boot. Pour le reste consultez la catégorie Category:Boot process (Français).\n\n"
    },
    {
      "title": "Auto-détection du matériel",
      "level": 3,
      "content": "Le matériel est normalement détecté automatiquement lors du démarrage par udev. Une amélioration potentielle du temps de démarrage peut être réalisée en désactivant le chargement automatique des modules, tel que décrit dans la page Kernel modules.\n\nDe la même manière, Xorg est capable de détecter automatiquement le matériel grâce à udev, mais l'utilisateur a la possibilité de configurer le serveur X «à la main».\n\n"
    },
    {
      "title": "Microcode",
      "level": 3,
      "content": "Certain processeurs ont des comportements erronés que le noyau peut corriger en mettant à jour le microcode. Consultez microcode (en) pour plus de détails;\n\n"
    },
    {
      "title": "Conserver les messages du démarrage",
      "level": 3,
      "content": "Une fois que l'invite de connexion apparaît, les messages du démarrage sont effacés, laissant les utilisateurs dans l'impossibilité de récupérer ces informations. Pour surmonter cette limitation, vous pouvez désactiver l'effacement des messages de démarrage.\n\n"
    },
    {
      "title": "Activation du pavé numérique",
      "level": 3,
      "content": "Num Lock est une touche présente sur la plupart des claviers. Pour activer le Num Lock au démarrage, consultez Activation de Num Lock au démarrage.\n\n"
    },
    {
      "title": "Interface graphique",
      "level": 2,
      "content": "Cette section contient diverses pistes pour les utilisateurs souhaitant faire tourner une interface graphique sur leur système. Voir Category:Graphical user interfaces (Français) pour de plus amples informations.\n\n"
    },
    {
      "title": "Serveur graphique",
      "level": 3,
      "content": "Xorg est une implémentation open-source du X Window system (couramment appelé X11 ou X). Celui-ci est nécessaire au fonctionnement des applications dotées d'interfaces graphiques, aussi la majorité des utilisateurs voudront l'installer.\n\nWayland est une alternative plus récente au serveur X et Weston est l'implémentation de référence d'un environnement graphique basé sur Wayland.\n\n"
    },
    {
      "title": "Pilotes graphiques",
      "level": 3,
      "content": "Le pilote d'affichage modesetting par défaut fonctionne avec la plupart des cartes vidéo, mais les performances peuvent être améliorées et des fonctionnalités supplémentaires exploitées en installant le pilote approprié pour les cartes AMD ou NVIDIA.\n\n"
    },
    {
      "title": "Environnements de bureau",
      "level": 3,
      "content": "Bien que Xorg fournisse l'infrastructure de base à la réalisation d'un environnement graphique, divers composants supplémentaires sont nécessaires pour une expérience utilisateur satisfaisante. Les environnements de bureau tels Gnome, KDE, ou encore Xfce incluent divers clients X, comme un gestionnaire de fenêtres, un gestionnaire de fichier, un émulateur de terminal, un éditeur de textes, des icônes et bien d'autres utilitaires. Les utilisateurs les moins expérimentés souhaiterons installer un tel environnement de bureau pour obtenir une expérience utilisateur qui leur soit familière. Consultez Category:Desktop environments (Français) pour plus d'informations.\n\n"
    },
    {
      "title": "Gestionnaires de fenêtres",
      "level": 3,
      "content": "Les environnements de bureau fournissent une expérience utilisateur complète et cohérente, cependant, ils ont tendance à consommer une grande quantité de ressources système. Les utilisateurs à la recherche de performances, ou d'un environnement de travail simple (et/ou minimaliste) peuvent choisir d'installer un Gestionnaire de fenêtres seul, et y ajouter «à la main» seulement quelques éléments choisis.\n\nIl est bon de noter que de nombreux environnements de bureau autorisent l'utilisation d'un gestionnaire de fenêtres alternatif. Il existe divers types de gestionnaires de fenêtres qui se différencient sur leur gestion du placement des fenêtres.\n\n"
    },
    {
      "title": "Gestionnaire de connexions",
      "level": 3,
      "content": "Beaucoup d'environnements de bureau disposent d'un gestionnaire de connexions démarrant automatiquement l'environnement graphique et gérant la connexion des divers utilisateurs. Les utilisateurs n'installant pas un environnement de bureau complet peuvent en installer un séparément. (voir Category:Display managers (Français))\n\nIl reste toutefois possible de [[démarrer X à la connexion comme alternative à un gestionnaire de connexion.\n\n"
    },
    {
      "title": "Répertoires utilisateurs",
      "level": 3,
      "content": "Les dossiers comme Téléchargements ou Musique sont créés par le service xdg-user-dirs-update.service qui est activé par défaut lors de l'installation du paquet xdg-user-dirs. Si votre gestionnaire de fenêtres ou votre environnement de bureau n'installe pas ce paquet, vous pouvez l'installer manuellement et lancer la commande xdg-user-dirs-update comme indiqué dans XDG user directories#Creating default directories.\n\n"
    },
    {
      "title": "Gestion de l'énergie",
      "level": 2,
      "content": "Cette section peut être utile aux propriétaires d'ordinateurs portables ou aux utilisateurs qui cherchent à contrôler la gestion de l'énergie. Consultez Category:Power management (Français) pour en savoir plus.\n\nConsultez Gestion de l'alimentation pour un aperçu plus général.\n\n"
    },
    {
      "title": "Événements ACPI",
      "level": 3,
      "content": "Les utilisateurs peuvent configurer la manière dont le système réagit aux événements ACPI tels que l'appui sur le bouton d'alimentation ou la fermeture du couvercle d'un ordinateur portable. Pour la méthode recommandée utilisant systemd, consultez Power management#ACPI events. Pour l'ancienne méthode, consultez acpid.\n\n"
    },
    {
      "title": "Mise à l'échelle de la fréquence du CPU",
      "level": 3,
      "content": "Les processeurs modernes peuvent diminuer leur fréquence et leur tension pour réduire la chaleur et la consommation d'énergie. Moins de chaleur entraîne un système plus silencieux et prolonge la durée de vie du matériel. Consultez Mise à l'échelle de la fréquence du processeur pour plus de détails.\n\n"
    },
    {
      "title": "Ordinateurs portables",
      "level": 3,
      "content": "Pour les articles relatifs aux ordinateurs portables ainsi que les guides d'installation spécifiques aux modèles, veuillez consulter Category:Laptops. Pour un aperçu général des articles et recommandations relatifs aux ordinateurs portables, consultez Ordinateur portable.\n\n"
    },
    {
      "title": "Suspension et hibernation",
      "level": 3,
      "content": "Consultez l'article principal : Gestion de l'alimentation/Suspension et mise en veille prolongée.\n\n"
    },
    {
      "title": "Multimédia",
      "level": 2,
      "content": "La Category:Multimedia (Français) offre des ressources complémentaires.\n\n"
    },
    {
      "title": "Système son",
      "level": 3,
      "content": "ALSA est un système de son du noyau qui devrait fonctionner dès le départ (il suffit qu'il ne soit pas réglé en muet). Les serveurs de son tels que PulseAudio et PipeWire peuvent offrir des fonctionnalités supplémentaires et prendre en charge une configuration audio plus complexe.\n\nConsultez Professional audio (Français) pour connaître les exigences audio avancées.\n\n"
    },
    {
      "title": "Mise en réseau",
      "level": 2,
      "content": "Cette section se limite aux procédures de mise en réseau simples. Consultez Configuration réseau pour un guide de configuration complet et Category:Networking (Français) pour des articles connexes.\n\n"
    },
    {
      "title": "Synchronisation de l'horloge",
      "level": 3,
      "content": "Le protocole Network Time Protocol (NTP) est un protocole permettant de synchroniser les horloges des systèmes informatiques sur des réseaux de données à commutation de paquets et à latence variable. Consultez Synchronisation du temps pour connaître les implémentations de ce protocole.\n\n"
    },
    {
      "title": "Sécurité DNS",
      "level": 3,
      "content": "Pour une meilleure sécurité lors de la navigation sur le web, du paiement en ligne, de la connexion à des services SSH et d'autres tâches similaires, envisagez d'utiliser un résolveur DNS avec DNSSEC qui peut valider des enregistrements signés DNS, et un protocole chiffré tel que DNS over TLS, DNS over HTTPS ou DNSCrypt. Consultez Résolution de noms de domaine pour plus de détails.\n\n"
    },
    {
      "title": "Configuration d'un pare-feu",
      "level": 3,
      "content": "Un pare-feu peut fournir une couche supplémentaire de protection au dessus de la pile réseau Linux. Bien que le noyau Arch soit capable d'utiliser Netfilter, iptables et nftables, aucun n'est activé par défaut. Il est fortement recommandé de mettre en place une forme de pare-feu. Consultez Category:Firewalls (Français) pour les guides disponibles.\n\n"
    },
    {
      "title": "Partage réseau",
      "level": 3,
      "content": "Pour partager des fichiers entre les machines d'un réseau, suivez l'article NFS ou SSHFS.\n\nUtilisez Samba pour rejoindre un réseau Windows. Pour configurer la machine afin qu'elle utilise Active Directory pour l'authentification, lisez Intégration Active Directory.\n\nConsultez également Category:Network sharing (Français).\n\n"
    },
    {
      "title": "Périphériques d'entrée",
      "level": 2,
      "content": "Cette section contient des conseils populaires de configuration des périphériques d'entrée. Consultez Category:Input devices (Français) pour en savoir plus.\n\n"
    },
    {
      "title": "Disposition des claviers",
      "level": 3,
      "content": "Les claviers non anglais ou autrement non standard peuvent ne pas fonctionner comme prévu par défaut. Les étapes nécessaires pour configurer le clavier sont différentes pour la console virtuelle et Xorg, elles sont décrites respectivement dans Configuration du clavier dans la console et Configuration du clavier dans Xorg.\n\n"
    },
    {
      "title": "Boutons de la souris",
      "level": 3,
      "content": "Les propriétaires de souris avancées ou inhabituelles peuvent constater que tous les boutons de la souris ne sont pas reconnus par défaut, ou peuvent souhaiter attribuer des actions différentes pour les boutons supplémentaires. Vous trouverez des instructions dans Boutons de la souris.\n\n"
    },
    {
      "title": "Pavés tactiles pour ordinateurs portables",
      "level": 3,
      "content": "De nombreux ordinateurs portables utilisent des dispositifs de pointage \"touchpad\" Synaptics ou ALPS. Pour ceux-ci, et plusieurs autres modèles de pavés tactiles, vous pouvez utiliser le pilote d'entrée Synaptics ou libinput ; consultez Touchpad Synaptics et libinput pour les détails d'installation et de configuration.\n\n"
    },
    {
      "title": "TrackPoints",
      "level": 3,
      "content": "Consultez l'article TrackPoint pour configurer votre périphérique TrackPoint.\n\n"
    },
    {
      "title": "Optimisation",
      "level": 2,
      "content": "Cette section vise à résumer les réglages, les outils et les options disponibles utiles pour améliorer les performances du système et des applications.\n\n"
    },
    {
      "title": "Benchmarking",
      "level": 3,
      "content": "Le «benchmarking» est l'action de mesurer les performances et de comparer les résultats à ceux d'un autre système ou à une norme largement acceptée par le biais d'une procédure unifiée.\n\n"
    },
    {
      "title": "Amélioration des performances",
      "level": 3,
      "content": "L'article Amélioration des performances rassemble des informations et constitue un récapitulatif de base sur l'amélioration des performances dans Arch Linux.\n\n"
    },
    {
      "title": "SSD",
      "level": 3,
      "content": "L'article SSD couvre de nombreux aspects des SSD, y compris leur configuration pour maximiser leur durée de vie.\n\n"
    },
    {
      "title": "Services système",
      "level": 2,
      "content": "Cette section concerne les daemons.\n\n"
    },
    {
      "title": "Index et recherche de fichiers",
      "level": 3,
      "content": "La plupart des distributions ont une commande locate disponible pour pouvoir rechercher rapidement des fichiers. Arch Linux fournit plusieurs alternatives, consultez locate pour plus de détails.\n\nLes moteurs de recherche de bureau fournissent un service similaire, tout en étant mieux intégré dans les environnements de bureau.\n\n"
    },
    {
      "title": "Distribution locale du courrier",
      "level": 3,
      "content": "Une configuration par défaut ne fournit pas de moyen de synchroniser le courrier. Une liste d'agents de distribution du courrier est disponible dans l'article Serveur de courrier.\n\n"
    },
    {
      "title": "Impression",
      "level": 3,
      "content": "CUPS est un système d'impression open source basé sur des standards, développé par OpenPrinting pour Linux. Consultez Category:Printers (Français) pour des articles spécifiques aux imprimantes.\n\n"
    },
    {
      "title": "Apparence",
      "level": 2,
      "content": "Cette section contient les améliorations fréquemment demandées pour rendre l'expérience d'Arch plus agréable sur le plan esthétique. Consultez Category:Eye candy pour en savoir plus.\n\n"
    },
    {
      "title": "Polices",
      "level": 3,
      "content": "Vous pouvez souhaiter installer un jeu de polices TrueType, car seules les polices bitmap non extensibles sont incluses dans un système Arch de base. Il existe plusieurs familles de polices à usage général offrant une large couverture Unicode et même compatibles dans leur métrique avec les polices d'autres systèmes d'exploitation.\n\nUne pléthore d'informations sur le sujet peut être trouvée dans les articles Polices et Configuration des polices.\n\nS'ils passent beaucoup de temps à travailler depuis la console virtuelle (c'est-à-dire en dehors d'un serveur X), les utilisateurs peuvent souhaiter changer la police de la console pour améliorer la lisibilité ; consultez Linux console#Fonts.\n\n"
    },
    {
      "title": "Thèmes GTK et Qt",
      "level": 3,
      "content": "Une grande partie des applications avec une interface graphique pour les systèmes Linux sont basées sur les boîtes à outils GTK ou Qt. Consultez ces articles et Uniform look for Qt and GTK applications pour trouver des idées pour améliorer l'apparence de vos programmes installés et l'adapter à votre goût.\n\n"
    },
    {
      "title": "Améliorations de la console",
      "level": 2,
      "content": "Cette section s'applique aux petites modifications qui améliorent l'aspect pratique des programmes en console. Consultez Category:Command-line shells (Français) pour en savoir plus.\n\n"
    },
    {
      "title": "Améliorations de la complétion par tabulation",
      "level": 3,
      "content": "Il est recommandé de configurer correctement et immédiatement la complétion étendue avec tab, comme indiqué dans l'article de votre shell préféré.\n\n"
    },
    {
      "title": "Alias",
      "level": 3,
      "content": "L'alias d'une commande, ou d'un groupe de commandes, est un moyen de gagner du temps lors de l'utilisation de la console. C'est particulièrement utile pour les tâches répétitives qui ne nécessitent pas de modification importante de leurs paramètres entre les exécutions. Des alias communs permettant de gagner du temps peuvent être trouvés dans Bash#Aliases, qui sont facilement portables dans Zsh également.\n\n"
    },
    {
      "title": "Les shells alternatifs",
      "level": 3,
      "content": "Bash est l'interpréteur de commandes installé par défaut dans un système Arch. Le médium d'installation en direct, cependant, utilise Zsh avec le paquet additionnel grml-zsh-config. Consultez Command-line shell#List of shells pour plus d'alternatives.\n\n"
    },
    {
      "title": "Ajouts à Bash",
      "level": 3,
      "content": "Une liste de divers paramètres Bash, de recherche d'historique et de macros Readline est disponible dans Bash#Tips and tricks.\n\n"
    },
    {
      "title": "Sortie colorée",
      "level": 3,
      "content": "Cette section est traitée dans Sortie couleur en console.\n\n"
    },
    {
      "title": "Fichiers compressés",
      "level": 3,
      "content": "Les fichiers compressés, ou archives, sont fréquemment rencontrés sur un système GNU/Linux. Tar est l'un des outils d'archivage les plus utilisés, et les utilisateurs doivent être familiers avec sa syntaxe (les paquets Arch Linux, par exemple, sont simplement des archives zstd compressés). Consultez Archivage et compression.\n\n"
    },
    {
      "title": "Invite de la console",
      "level": 3,
      "content": "L'invite de la console (PS1) peut être personnalisée dans une large mesure. Consultez Bash/Prompt customization ou Zsh#Prompts si vous utilisez Bash ou Zsh, respectivement.\n\n"
    },
    {
      "title": "Emacs",
      "level": 3,
      "content": "Emacs est connu pour ses options qui vont au-delà des fonctions d'édition de texte ordinaire, l'une d'entre elles étant un remplacement complet de l'interpréteur de commandes. Consultez Emacs#Colored output issues pour une correction concernant les caractères déformés qui peuvent résulter de l'activation des couleurs.\n\n"
    },
    {
      "title": "Prise en charge de la souris",
      "level": 3,
      "content": "L'utilisation d'une souris avec la console pour les opérations de copier-coller peut être préférée au mode de copie traditionnel de GNU Screen. Reportez-vous à Souris à usage général pour des instructions complètes. Notez que vous pouvez déjà faire cela dans les émulateurs de terminal avec le presse-papiers.\n\n"
    },
    {
      "title": "Gestion des sessions",
      "level": 3,
      "content": "À l'aide de multiplexeurs de terminaux tels que tmux ou GNU Screen, les programmes peuvent être exécutés dans des sessions composées d'onglets et de volets qui peuvent être détachés à volonté. Ainsi, lorsque l'utilisateur ferme l'émulateur de terminal, termine X ou se déconnecte, les programmes associés à la session continuent de s'exécuter en arrière-plan tant que le serveur du multiplexeur de terminaux est actif. Pour interagir avec les programmes, il faut se rattacher à la session.\n\n"
    }
  ]
}