{
  "title": "Reflector (Français)",
  "url": "https://wiki.archlinux.org/title/Reflector_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Mirrors (Français)\n- pacman (Français)\n\nReflector est un script Python qui peut récupérer la dernière liste de miroirs sur la page Arch Linux Mirror Status, filtrer les miroirs les plus récents, les trier par vitesse et écraser le fichier /etc/pacman.d/mirrorlist.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet reflector.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "- Dans les exemples suivants, /etc/pacman.d/mirrorlist sera écrasé. Faites une sauvegarde avant de continuer.\n- Assurez-vous que la /etc/pacman.d/mirrorlist résultante ne contient pas d'entrées que vous considérez comme non fiables avant de synchroniser ou de mettre à jour avec pacman.\n\nPour consulter toutes les options disponibles, exécutez la commande suivante :\n\n```\n$ reflector --help\n```\n\n"
    },
    {
      "title": "Exemples",
      "level": 3,
      "content": "Consultez reflector(1) § EXAMPLES. Les exemples écrasant /etc/pacman.d/mirrorlist doivent être exécutés en tant que root.\n\n"
    },
    {
      "title": "Service systemd",
      "level": 3,
      "content": "Reflector est livré avec reflector.service. Le service exécutera reflector avec les paramètres spécifiés dans /etc/xdg/reflector/reflector.conf. Les options par défaut de ce fichier devraient servir de bon point de départ et d'exemple.\n\nPar exemple, pour sélectionner les 5 miroirs les plus à jour de France et d'Allemagne qui prennent en charge HTTPS et écraser /etc/pacman.d/mirrorlist, utilisez\n\n```\n/etc/xdg/reflector/reflector.conf\n```\n\n```\n--save /etc/pacman.d/mirrorlist\n--pays France,Allemagne\n--protocole https\n--latest 5\n```\n\nActivez reflector.service pour exécuter Reflector au démarrage. Pour l'exécuter immédiatement, démarrez le service.\n\n"
    },
    {
      "title": "Minuterie systemd",
      "level": 3,
      "content": "Reflector fournit un timer systemd. (reflector.timer) qui démarre le #Service systemd reflector.service chaque semaine. L'horaire peut être modifié en éditant reflector.timer.\n\nEditez d'abord le fichier de configuration comme décrit dans #Service systemd. Après avoir mis à jour le fichier de configuration, démarrez et activez reflector.timer.\n\nPour rafraîchir la liste des miroirs avant la date prévue, démarrez reflector.service.\n\n"
    },
    {
      "title": "Hook de pacman",
      "level": 3,
      "content": "pacman-mirrorlist n'est pas mis à jour régulièrement, invoquer reflector uniquement parce qu'un miroir dans une partie du globe a été ajouté ou supprimé n'est pas pertinent. Utilisez plutôt l'automatisation basée sur une minuterie. Si vous voulez que mirrorlist.pacnew ne soit pas installé du tout, utilisez NoExtract dans pacman.conf.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Fil de discussion sur Reflector dans les forums Arch Linux.\n- Page du projet en amont incluant le journal des modifications.\n\n"
    }
  ]
}