{
  "title": "Reflector (Ελληνικά)",
  "url": "https://wiki.archlinux.org/title/Reflector_(%CE%95%CE%BB%CE%BB%CE%B7%CE%BD%CE%B9%CE%BA%CE%AC)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Mirrors\n- Pacman\n\nO Reflector είναι ένα Python script που μπορεί να λάβει την πιο πρόσφατη λίστα mirrors από την σελίδα Arch Linux Mirror Status, να φιλτράρει τους πιο ενημερωμένους mirrors, να τους ταξινομήσει κατά ταχύτητα και να αντικαταστήσει το αρχείο /etc/pacman.d/mirrorlist.\n\n"
    },
    {
      "title": "Εγκατάσταση",
      "level": 2,
      "content": "Εγκατάσταση του πακέτου reflector.\n\n"
    },
    {
      "title": "Χρήση",
      "level": 2,
      "content": "- Στα παρακάτω παραδείγματα το /etc/pacman.d/mirrorlist θα αντικατασταθεί. Δημιουργήστε ένα αντίγραφο ασφαλείας πριν προχωρήσετε.\n- Βεβαιωθείτε ότι το αρχείο /etc/pacman.d/mirrorlist που προκύπτει δεν περιέχει καταχωρήσεις που θεωρείτε αναξιόπιστες πριν τον συγχρονισμό ή την ενημέρωση με τον pacman.\n\nΓια να δείτε όλες τις διαθέσιμες επιλογές, εκτελέστε την ακόλουθη εντολή:\n\n```\n$ reflector --help\n```\n\n"
    },
    {
      "title": "Παραδείγματα",
      "level": 3,
      "content": "Δείτε reflector(1) § EXAMPLES. Παραδείγματα που αντικαθιστούν το /etc/pacman.d/mirrorlist πρέπει να εκτελεστούν ως root.\n\n"
    },
    {
      "title": "systemd service",
      "level": 3,
      "content": "Ο Reflector έρχετε με την υπηρεσία reflector.service. Αυτή η υπηρεσία εκτελεί τον reflector με παραμέτρους που ορίζονται στο /etc/xdg/reflector/reflector.conf. Οι προεπιλογές σε αυτό το αρχείο είναι ένα καλό σημείο εκκίνησης και παράδειγμα.\n\nΓια παράδειγμα, για την επιλογή των 5 πιο ενημερωμένων mirrors από Γαλλία και Γερμανία που υποστηρίζουν το πρωτόκολλο HTTPS και αντικαθιστούν το /etc/pacman.d/mirrorlist, θέστε\n\n```\n/etc/xdg/reflector/reflector.conf\n```\n\n```\n--save /etc/pacman.d/mirrorlist\n--country France,Germany\n--protocol https\n--latest 5\n```\n\nΚάνετε ενεργοποίηση (enable) της υπηρεσίας reflector.service για την εκτέλεση του Reflector στην εκκίνηση του συστήματος. Για την άμεση εκτέλεση του, κάνετε έναρξη (start) της υπηρεσίας.\n\n"
    },
    {
      "title": "systemd timer",
      "level": 3,
      "content": "Ο Reflector παρέχει έναν χρονομετρητή systemd timer, τον reflector.timer που εκκινεί την υπηρεσία #systemd service reflector.service εβδομαδιαία. Το χρονοδιάγραμμα μπορεί να τροποποιηθεί με επεξεργασία (edit) του reflector.timer.\n\nΠρώτα επεξεργαστετε το αρχείο ρυθμίσεων όπως περιγράφεται στην ενότητα #systemd service. Αφού έχετε ενημερώσει το αρχείο των ρυθμίσεων, κάνετε έναρξη (start) και ενεργοποίηση (enable) του reflector.timer.\n\nΓια την ανανέωση της mirrorlist νωρίτερα το χρονοδιαγράμματος, κάνετε εκκίνηση (start) της υπηρεσίας reflector.service.\n\n"
    },
    {
      "title": "pacman hook",
      "level": 3,
      "content": "Η pacman-mirrorlist δεν ανανεώνεται συχνά, καθώς δεν είναι επιθυμητή η χρήση του reflector μόνο επειδή κάποιος mirror, σε κάποιο σημείο του κόσμου προστέθηκε ή αφαιρέθηκε. Χρησιμοποιήστε αντιθέτως έναν αυτοματισμό βασισμένο σε χρονομετρητή (timer). Αν επιθυμείτε την εγκατάσταση του mirrorlist.pacnew, χρησιμοποιήστε NoExtract στο pacman.conf.\n\n"
    },
    {
      "title": "Δείτε επίσης",
      "level": 2,
      "content": "- Το νήμα του Reflector στα φόρουμ του Arch Linux\n- Upstream project page including changelog\n\n"
    }
  ]
}