{
  "title": "Reflector (Català)",
  "url": "https://wiki.archlinux.org/title/Reflector_(Catal%C3%A0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles relacionats\n\n- Miralls\n- Pacman\n\nReflector és un script de Python que pot obtenir la llista de miralls més actualitzada de la pàgina Arch Linux Mirror Status, filtrar els miralls més actualitzats, ordenar-los per velocitat i sobreescriure el fitxer /etc/pacman.d/mirrorlist.\n\n"
    },
    {
      "title": "Instal·lació",
      "level": 2,
      "content": "Instal·leu el paquet reflector.\n\n"
    },
    {
      "title": "Ús",
      "level": 2,
      "content": "- En els següents exemples, se sobreescriurà /etc/pacman.d/mirrorlist. Feu una còpia de seguretat abans de continuar.\n- Assegureu-vos que el fitxer /etc/pacman.d/mirrorlist resultant no conté entrades que no considereu de confiança abans de sincronitzar o actualitzar amb pacman.\n\nPer a veure totes les opcions disponibles, executeu la comanda següent:\n\n```\n$ reflector --help\n```\n\n"
    },
    {
      "title": "Exemples",
      "level": 3,
      "content": "Vegeu reflector(1) § EXAMPLES (en anglès). Els exemples que sobreescriuen /etc/pacman.d/mirrorlist han d'executar-se com a root.\n\n"
    },
    {
      "title": "Servei de systemd",
      "level": 3,
      "content": "Reflector inclou el servei reflector.service. Aquest executa relfector amb els paràmetres especificats a /etc/xdg/reflector/reflector.conf. Les opcions per defecte d'aquest fitxer haurien de ser un bon punt de partida i un bon exemple.\n\nPer exemple, per a seleccionar els 5 miralls més actualitzats de França i Alemanya que suporten HTTPS i sobreescriure /etc/pacman.d/mirrorlist, useu\n\n```\n/etc/xdg/reflector/reflector.conf\n```\n\n```\n--save /etc/pacman.d/mirrorlist\n--country France,Germany\n--protocol https\n--latest 5\n```\n\nActiveu reflector.service per a executar Reflector a l'arrencada. Per a executar-lo immediatament, inicieu el servei.\n\n"
    },
    {
      "title": "Temporitzador de systemd",
      "level": 3,
      "content": "Reflector ofereix un temporitzador de systemd que inicia el #Servei de systemd reflector.service setmanalment. La programació pot canviar-se editant reflector.timer.\n\nPrimer editeu el fitxer de configuració com s'explica a #Servei de systemd. Despres d'actualitzar el fitxer de configuració, inicieu i activeu reflector.timer.\n\nPer a refrescar la llista de miralls abans del programat, inicieu reflector.service.\n\n"
    },
    {
      "title": "Ganxo de pacman",
      "level": 3,
      "content": "pacman-mirrorlist no s'actualitza freqüentment, executar reflector només perquè s'ha afegit o eliminat algun mirall en alguna part del món no és rellevant. En comptes d'això, utilitzeu l'automatització basada en temporitzador. Si no voleu que s'instal·li mirrorlist.pacnew, useu NoExtract a pacman.conf.\n\n"
    },
    {
      "title": "Vegeu també",
      "level": 2,
      "content": "- Fil (en anglès) sobre Reflector als Fòrums d'Arch Linux\n- Pàgina del projecte incloent-hi el registre de canvis\n\n"
    }
  ]
}