{
  "title": "Reset root password (Português)",
  "url": "https://wiki.archlinux.org/title/Reset_root_password_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Este guia irá mostrar-lhe como redefinir uma senha de root esquecida. Vários métodos estão listados para ajudá-lo a realizar isso.\n\n"
    },
    {
      "title": "Usando o sudo",
      "level": 2,
      "content": "Se você instalou o sudo e configurou permissões para o grupo wheel ou um usuário cuja senha você se lembra, você pode alterar a senha do root executando sudo passwd root.\n\n"
    },
    {
      "title": "Usando o shell de depuração",
      "level": 2,
      "content": "1. Anexe systemd.debug_shell aos parâmetros do kernel.\n1. Isso vai fazer uma inicialização normal, mas inicia debug-shell.service, o qual executa um shell de root (/bin/sh) no tty9. Pressione Ctrl+Alt+F9 para acessá-lo.\n1. Use o comando passwd para criar uma nova senha para o usuário root.\n1. Quando finalizar, pare debug-shell.service.\n\n"
    },
    {
      "title": "Usando bash como init",
      "level": 2,
      "content": "1. Anexe o parâmetro do kernel init=/bin/bash à entrada de inicialização do seu gerenciador de boot.\n1. Seu sistema de arquivos raiz está montado como somente leitura agora, então remonte-o como leitura/escrita: mount -n -o remount,rw /.\n1. Use o comando passwd para criar uma nova senha para o usuário root.\n1. Reinicialize digitando reboot -f e não perca sua senha novamente!\n\n"
    },
    {
      "title": "Usando um LiveCD",
      "level": 2,
      "content": "Com um LiveCD, alguns métodos estão disponíveis: alterar a raiz e usar o comando passwd, ou apagar a entrada do campo da senha diretamente editando o arquivo de senha. Qualquer LiveCD compatível com Linux pode ser usado, embora para mudar de raiz deve corresponder ao tipo de arquitetura instalada. Aqui, descrevemos apenas como redefinir sua senha com chroot, uma vez que a edição manual do arquivo de senha é significativamente mais arriscada.\n\n"
    },
    {
      "title": "Alterando a raiz",
      "level": 3,
      "content": "1. Inicie o LiveCD e monte a partição raiz de seu sistema principal.\n1. Use o comando passwd --root PONTO_DE_MONTAGEM NOME_USUÁRIO para definir a nova senha (você não será perguntado sobre a anterior).\n1. Desmonte a partição raiz.\n1. Reinicie e insira sua nova senha.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- How To Reset A Forgotten Root Password With Knoppix\n- Early Debug Shell\n\n"
    }
  ]
}