{
  "title": "Reset lost root password (Italiano)",
  "url": "https://wiki.archlinux.org/title/Reset_lost_root_password_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "This guide will show you how to reset a forgotten root password. Several methods are listed to help you accomplish this.\n\n"
    },
    {
      "title": "Using sudo",
      "level": 2,
      "content": "If you have installed sudo and have configured permissions for either the wheel group or a user whose password you recall, you can change the root password by running sudo passwd root.\n\n"
    },
    {
      "title": "Using the debug shell",
      "level": 2,
      "content": "1. Append systemd.debug_shell to the kernel parameters.\n1. This will do a normal boot but start debug-shell.service which runs a root shell (/bin/sh) on tty9. Press Ctrl+Alt+F9 to access it.\n1. Use the passwd command to create a new password for the root user.\n1. When done, stop debug-shell.service.\n\n"
    },
    {
      "title": "Using bash as init",
      "level": 2,
      "content": "1. Append the init=/bin/bash kernel parameter to your boot loader's boot entry.\n1. Your root file system is mounted as read-only now, so remount it as read/write: mount -n -o remount,rw /.\n1. Use the passwd command to create a new password for the root user.\n1. Reboot by typing reboot -f and do not lose your password again!\n\n"
    },
    {
      "title": "Using a LiveCD",
      "level": 2,
      "content": "With a LiveCD a couple methods are available: change root and use the passwd command, or erase the password field entry directly editing the password file. Any Linux capable LiveCD can be used, albeit to change root it must match your installed architecture type. Here we only describe how to reset your password with chroot, since manual editing the password file is significantly more risky.\n\n"
    },
    {
      "title": "Change root",
      "level": 3,
      "content": "1. Boot the LiveCD and mount the root partition of your main system.\n1. Use the passwd --root MOUNT_POINT USER_NAME command to set the new password (you will not be prompted for an old one).\n1. Unmount the root partition.\n1. Reboot, and enter your new password.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- How To Reset A Forgotten Root Password With Knoppix\n- Early Debug Shell\n\n"
    }
  ]
}