{
  "title": "Resolv.conf (Português)",
  "url": "https://wiki.archlinux.org/title/Resolv.conf_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Configuração de rede\n- Servidores DNS sobre HTTPS\n\nEm geral, um nome de domínio representa um endereço IP e está associado a ele no Sistema de Nomes de Domínio, ou Domain Name System (DNS). Esse artigo explica como para configurar resolução de nome de domínio e resolver nomes de domínio.\n\n"
    },
    {
      "title": "Name Service Switch",
      "level": 2,
      "content": "O recurso Name Service Switch (NSS) é parte da biblioteca C do GNU (glibc) e apoia a API getaddrinfo(3), usada para resolver nomes de domínio. O NSS permite que bancos de dados do sistema sejam fornecidos por serviços separados, cuja ordem de pesquisa pode ser configurada pelo administrador no nsswitch.conf(5). O banco de dados responsável pela resolução de nomes de domínio é o banco de dados hosts, para o qual a glibc oferece os seguintes serviços:\n\n- file: lê o arquivo /etc/hosts, veja hosts(5)\n- dns: o resolvedor do glibc que lê /etc/resolv.conf, veja resolv.conf(5)\n\nSystemd fornece três serviços NSS para resolução de hostname:\n\n- nss-resolve(8) - um resolvedor de tronco de DNS em cache, descrito em systemd-resolved\n- nss-myhostname(8) - fornece resolução de hostname sem ter que editar /etc/hosts, descrito em Configuração de rede#Resolução de hostname local\n- nss-mymachines(8) - fornece resolução de hostname para os nomes de contêineres locais de systemd-machined(8)\n\n"
    },
    {
      "title": "Resolva um nome de domínio usando NSS",
      "level": 3,
      "content": "Bancos de dados NSS podem ser consultados com getent(1). Um nome de domínio pode ser resolvido por meio do NSS usando:\n\n```\n$ getent hosts nome_domínio\n```\n\n"
    },
    {
      "title": "Resolvedor do glibc",
      "level": 2,
      "content": "O resolvedor do glibc lê /etc/resolv.conf para toda resolução para determinar os servidores de nome e opções para usar.\n\nresolv.conf(5) lista servidores de nomes juntos com algumas opções de configuração.\n\nServidores de nome (nameservers) listados primeiros são tentados primeiro, até os três servidores podem ser listados. Linhas iniciando com um cerquilha (#) são ignoradas.\n\n"
    },
    {
      "title": "Sobrescrita do /etc/resolv.conf",
      "level": 3,
      "content": "Gerenciadores de rede tendem a sobrescrever /etc/resolv.conf, para particularidades veja a seção correspondente:\n\n- dhcpcd#/etc/resolv.conf\n- netctl#/etc/resolv.conf\n- NetworkManager (Português)#/etc/resolv.conf\n\nPara evitar que programas sobrescrevam /etc/resolv.conf, também é possível protegê-lo contra gravação definindo o atributo de arquivo imutável:\n\n```\n# chattr +i /etc/resolv.conf\n```\n\n"
    },
    {
      "title": "Limitar o tempo de pesquisa",
      "level": 3,
      "content": "Se você for confrontado com uma consulta de hostname muito longa (seja no pacman ou enquanto navega), frequentemente ajuda a definir um pequeno tempo limite após o qual um servidor de nomes alternativo é usado. Para fazer isso, coloque o seguinte em /etc/resolv.conf:\n\n```\noptions timeout:1\n```\n\n"
    },
    {
      "title": "Pesquisa de hostname atrasada com IPv6",
      "level": 3,
      "content": "Se você tiver um atraso de 5 segundos ao resolver os hostname, isso pode ser devido a um mau comportamento do servidor DNS/Firewall e somente dando uma resposta a uma solicitação paralela A e AAAA.[1] Você pode corrigir isso configurando a seguinte opção no /etc/resolv.conf:\n\n```\noptions single-request\n```\n\n"
    },
    {
      "title": "Nomes de domínio local",
      "level": 3,
      "content": "Para ser capaz de usar o hostname de máquinas locais sem o nome de domínio totalmente qualificado, adicione uma linha ao /etc/resolv.conf com o domínio local, como:\n\n```\ndomain exemplo.org\n```\n\nDessa forma, você pode se referir a hosts locais como maquinaprincipal1.exemplo.org como simplesmente maquinaprincipal1 ao usar o comando ssh, mas o comando drill ainda requer os nomes de domínio totalmente qualificados para realizar pesquisas.\n\n"
    },
    {
      "title": "Utilitários de pesquisa",
      "level": 2,
      "content": "Para consultar servidores DNS específicos e registros DNS/DNSSEC, você pode usar utilitários de pesquisa de DNS dedicados. Essas ferramentas implementam o próprio DNS e não usam NSS.\n\n- ldns fornece drill(1), que é uma ferramenta projetada para obter informações do DNS.\n\nPor exemplo, para consultar um servidor de nomes específico com drill por registros TXT de um domínio:\n\n```\n$ drill @servidor-de-nome TXT domínio\n```\n\nA menos que um servidor DNS seja especificado, drill vai usar os servidores de nome definidos em /etc/resolv.conf.\n\n- bind fornece dig(1), host(1), nslookup(1) e um monte de ferramentas dnssec-.\n\n"
    },
    {
      "title": "Desempenho de resolvedor",
      "level": 2,
      "content": "O resolvedor do Glibc não armazena em cache as consultas. Para implementar um cache local, use systemd-resolved ou configure um cache local servidor DNS e use-o como o servidor de nome configurando 127.0.0.1 e ::1 como os servidores de nomes em /etc/resolv.conf ou em /etc/resolvconf.conf se estiver usando openresolv (Português).\n\n- Os utilitários de pesquisa drill ou dig relatam o tempo de consulta.\n- Um roteador geralmente configura seu próprio resolvedor de cache como o servidor DNS da rede, fornecendo assim o cache DNS para toda a rede.\n- Se demorar muito para mudar para o próximo servidor DNS, você pode tentar diminuir o tempo limite.\n\n"
    },
    {
      "title": "Privacidade e segurança",
      "level": 2,
      "content": "O protocolo DNS não é criptografado e não leva em conta a confidencialidade, integridade ou autenticação, portanto, se você usar uma rede não confiável ou um ISP mal-intencionado, suas consultas DNS poderão ser interceptadas e as respostas manipuladas. Além disso, os servidores DNS podem realizar redirecionamento de DNS (DNS hijacking).\n\nVocê precisa confiar em seu servidor DNS para tratar suas consultas de maneira confidencial. Os servidores DNS são fornecidos por ISPs e terceiros. Como alternativa, você pode executar seu próprio servidor de nome recursivo, o que, no entanto, exige mais esforço. Se você usa um cliente DHCP em redes não confiáveis, defina os servidores de nomes estáticos para evitar o uso e a sujeição a servidores DNS arbitrários. Para proteger sua comunicação com um servidor DNS remoto, você pode usar um protocolo criptografado, como DNS sobre TLS (RFC 7858), DNS sobre HTTPS (RFC 8484) ou DNSCrypt, desde que o servidor upstream e seu resolvedor possuam suporte ao protocolo. Uma alternativa pode ser um software dedicado para criptografar e descriptografar a comunicação, tal como stunnel Para verificar se as respostas são realmente de servidores de nome autoritativos, você pode validar DNSSEC, desde que ambos os servidores upstream e seu resolvedor tenha suporte a isso.\n\n"
    },
    {
      "title": "DNS a nível de aplicativo",
      "level": 3,
      "content": "Esteja ciente de que alguns softwares cliente, como os principais navegadores web[2][3], estão começando a implementar DNS sobre HTTPS. Embora a criptografia de consultas possa ser vista como um bônus, isso também significa que o software avisa sobre a configuração do resolvedor do sistema.[4]\n\nA Mozilla propôs desabilitar o DNS a nível de aplicativo se o resolvedor do sistema não puder resolver o domínio \"use-application-dns.net\". Atualmente, essa verificação está implementada apenas no Firefox.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "Configurando DNS sobre HTTPS no Firefox",
      "level": 4,
      "content": "Para configurar DNS sobre HTTPS no Firefox (com base em [5]):\n\n1. abra Configurações de rede nas Preferências\n1. clique em Configurações\n1. marque Ativar DNS sobre HTTPS\n\n"
    },
    {
      "title": "Serviços DNS de terceiros",
      "level": 2,
      "content": "Existem vários serviços DNS de terceiros disponíveis, alguns dos quais também possuem software dedicado:\n\n- dingo — Um cliente DNS para o DNS do Google por HTTPS\n\n- opennic-up — Automatiza a renovação de servidores DNS com os servidores OpenNIC mais responsivos\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "Servidores DNS",
      "level": 2,
      "content": "Os servidores DNS podem ser autoritativos e recursivos. Se eles não forem, eles são chamados de stub resolvers e simplesmente encaminham todas as consultas para outro servidor de nomes recursivo. Os stub resolvers são normalmente usados para introduzir o cache de DNS no host ou na rede local. Observe que o mesmo também pode ser obtido com um servidor de nomes completo. Esta seção compara os servidores DNS disponíveis, para uma comparação mais detalhada, consulte o Wikipedia:Comparison of DNS server software.\n\nTable content:\nNome | Pacote | Capacidades | resolvconf | Protocolos suportados\nAutoritativo | Recursivo | Cache | ValidaDNSSEC | DNS | DNSCrypt | DNSpor TLS | DNSpor HTTPS\ndnscrypt-proxy | dnscrypt-proxy | Não | Não | Sim | Não | Não | Servidor | Resolvedor | Não | Sim\nRescached | rescached-gitAUR | Não | Não | Sim | Não | Sim | Sim | Não | Não | Limitado1\nStubby | stubby | Não | Não | Não | Sim | Não | Servidor | Não | Resolvedor | Não\nsystemd-resolved | systemd | Não | Não | Sim | Sim | Sim | servidor limitado e resolvedor | Não | Sim | Não\ndnsmasq | dnsmasq | Parcial 2 | Não | Sim | Sim | Sim | Sim | Não | Não | Não\nBIND | bind | Sim | Sim | Sim | Sim | Sim | Sim | Não | stunnel#DNS over TLS | Não\nKnot Resolver | knot-resolver | Não | Sim | Sim | Sim | Não | Sim | Não | Sim | Servidor\nMaraDNS | maradnsAUR | Sim | Sim | Sim | Não | Não | Sim | Não | Não | Não\npdnsd | pdnsd | Sim | Sim | Permanente | Não | Sim | Sim | Não | Não | Não\nPowerDNS Recursor | powerdns-recursor | Não | Sim | Sim | Sim | Sim | Sim | Não | Não | Não\nUnbound | unbound | Parcial | Sim | Sim | Sim | Sim | Sim | Servidor | Sim | Servidor\nDeadwood | maradnsAUR | ? | ? | ? | ? | ? | ? | ? | ? | ?\nCoreDNS | corednsAUR ou coredns-binAUR | ? | ? | ? | ? | ? | ? | ? | ? | ?\n\n1. Só encaminha usando DNS por HTTPS quando Rescached em si é consultado usando DNS por HTTPS.[6]\n1. Do Wikipédia: dnsmasq tem um suporte autoritativo limitado, sendo destinado a rede interna em vez de uso público na Internet.\n\n"
    },
    {
      "title": "Servidores apenas autoritativos",
      "level": 3,
      "content": "Table content:\nNome | Pacote | DNSSEC | Balanceamentogeográfico\ngdnsd | gdnsd | Não | Sim\nKnot DNS | knot | Sim | Sim\nNSD | nsd | Não | Não\nPowerDNS | powerdns | Sim | Sim\n\n"
    },
    {
      "title": "Encaminhamento condicional",
      "level": 3,
      "content": "É possível usar resolvedores de DNS específicos ao consultar nomes de domínio específicos. Isso é particularmente útil ao se conectar a uma VPN, para que as consultas à rede VPN sejam resolvidas pelo DNS da VPN, enquanto as consultas à Internet ainda serão resolvidas pelo seu resolvedor DNS padrão. Também pode ser usado em redes locais.\n\nPara implementá-lo, você precisa usar um resolvedor local porque o glibc não oferece suporte a isso.\n\nEm um ambiente dinâmico (laptops e algumas extensões de desktops), você precisa configurar seu resolvedor com base na(s) rede(s) à(s) qual(is) você está conectado. A melhor maneira de fazer isso é usar openresolv porque ele possui suporte a vários assinantes. Alguns gerenciadores de rede possuem suporte, seja através do openresolv, ou configurando o resolvedor diretamente.\n\n"
    },
    {
      "title": "Suporte a combinação de softwares",
      "level": 4,
      "content": "Table content:\nSoftware | Suporte ?\ndhcpcd | Desconhecido\niwd | Desconhecido\n\nTable content:\nSoftware | Suporte ?\nNetworkManager | Parcial\nnetctl | Desconhecido\n\nTable content:\nSoftware | Suporte ?\nOpenConnect | Desconhecido\nOpenVPN | Desconhecido\nstrongSwan | Desconhecido\nWireGuard | Desconhecido\n\nTable content:\nSoftware | Suporte ?\nBIND | Desconhecido\ndnsmasq | Sim\npdnsd | Desconhecido\npowerdns-recursor | Desconhecido\nUnbound | Desconhecido\n\nNetworkManager possui suporte a encaminhamento condicional sem o openresolv.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Linux Network Administrators Guide\n- Debian Handbook\n- RFC:7706 - Diminuindo o tempo de acesso a servidores raiz executando um com loopback (inglês)\n- Visão geral de sistema de nomes de domínio - Diagrama sobre DNS\n- Serviços alternativos de DNS\n\n"
    }
  ]
}