{
  "title": "RethinkDB (Español)",
  "url": "https://wiki.archlinux.org/title/RethinkDB_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-02-20** \n\nRethinkDB es una base de datos orientada a documentos similar a MongoDB, pero tiene como objetivo superar la escalabilidad y la limitación práctica de esta última. [1] [2] RethinkDB está diseñado para almacenar documentos JSON y escalar a múltiples máquinas con muy poco esfuerzo. Tiene un lenguaje de consulta agradable que admite consultas como la unión de tablas (joins) y agrupar por (group by). Es fácil de configurar y aprender. Para más información, véase la página oficial.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale rethinkdbAUR desde el repositorio oficial.\n\nCree y establezca permisos de usuario para la carpeta RethinkDB:\n\n```\n# mkdir /var/lib/rethinkdb/default\n# chown -R rethinkdb:rethinkdb /var/lib/rethinkdb/\n```\n\nAhora puede iniciar `rethinkdb` desde la línea de comandos:\n\n```\n# rethinkdb\n```\n\nO en su lugar, puede ejecutarlo como un servicio `systemd`. Habilite la instancia `rethinkdb` predeterminada como\n\n```\n# systemctl enable rethinkdb@default\n```\n\ne iníciela:\n\n```\n# systemctl start rethinkdb@default\n```\n\nRethinkDB's admin UI is now available on port 8080.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "RethinkDB tiene soporte para varias instancias, lo que significa que puede ejecutar varias instancias de bases de datos independientes en la misma máquina. El servicio `systemd` también admite la configuración de varias instancias.\n\nPara crear una nueva instancia de RethinkDB, cree su archivo de configuración:\n\n```\n# cd /etc/rethinkdb\n# cp default.conf.sample instances.d/<NOMBRE>.conf\n```\n\nDonde <NOMBRE> representa la configuración que usará más adelante. Cambie las opciones de configuración en el nuevo archivo de configuración. Entonces inicie el servicio:\n\n```\n# systemctl enable rethinkdb@<NOMBRE>\n# systemctl start rethinkdb@<NOMBRE>\n```\n\nLa instancia 'default' (predeterminada) se crea en el momento de la instalación para su comodidad. Sus datos se almacenan en `/var/lib/rethinkdb/default`.\n\n"
    }
  ]
}