{
  "title": "RetroArch (Español)",
  "url": "https://wiki.archlinux.org/title/RetroArch_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2017-09-14** \n\nRetroArch es un emulador multisistema, modular, impulsado por línea de comandos, diseñado para ser rápido, ligero y portátil. Algunas de sus características se pueden encontrar en algunos otros emuladores, como el rebobinado en tiempo real y el ocultamiento de juego basado en la API libretro.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "1. Instale el paquete retroarch o, alternativamente , retroarch-gitAUR para la versión de desarrollo. 2. Instale el paquete retroarch-assets-xmb para mostrar correctamente los elementos del menú XMB.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "RetroArch utiliza bibliotecas separadas, llamadas \"emulator cores\" o \"emulator implementations\", disponibles tanto en libretro como en el libretro GitHub repository. Cada paquete básico de libretro instalará una biblioteca en /usr/lib/libretro. La sintaxis para elegir uno al ejecutar “retroarch” es:\n\n```\n$ retroarch --libretro /usr/lib/libretro/libretro-core.so path/to/rom\n```\n\nSe puede definir un núcleo de emulación predeterminado en la configuración, evitando la necesidad de especificarlo en cada ejecución.\n\n```\n/etc/retroarch.cfg or ~/.config/retroarch/retroarch.cfg\n```\n\n```\nlibretro_path = \"/usr/lib/libretro/libretro-core.so\"\n```\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "RetroArch proporciona un archivo de configuración guía muy bien comentado ubicado en /etc/retroarch.cfg. Copie el archivo de configuración guía en su directorio personal\n\n```\n$ cp /etc/retroarch.cfg ~ / .config / retroarch / retroarch.cfg\n```\n\nTambién soporta archivos de configuración divididos usando la directiva #include \"foo.cfg\" dentro del archivo de configuración principal, retroarch.cfg. Esto puede anularse utilizando el parámetro --appendconfig /path/to/config y es beneficioso si se requieren diferentes combinaciones de claves, configuraciones de vídeo o ajustes de audio para las diversas implementaciones.\n\n"
    },
    {
      "title": "Actualizador en línea",
      "level": 2,
      "content": "Las versiones recientes de RetroArch han introducido un menú incorporado para actualizar los archivos de núcleo y varios activos de RetroArch Buildbot . Se puede acceder desde el menú principal en \"Online Updater\".\n\n```\nActualizador en línea\n```\n\n```\nActualizar núcleo \nActualizar archivos de información principal\nActualizar activos\nActualizar perfiles de Autoconfig\nActualizar trucos\nActualizar bases de datos\nActualizar superposiciones\nActualizar GLSL Shaders\n```\n\nEstos núcleos y activos se mantienen actualizados y se pueden extraer del actualizador en cualquier momento.\n\n"
    },
    {
      "title": "No se encontraron núcleos",
      "level": 3,
      "content": "Por defecto, RetroArch intentará encontrar núcleos en /usr/lib/libretro. Los núcleos descargados con el actualizador en línea incorporado fallarán al guardar a menos que retroarch se ejecute como root (no recomendado, ya que puede sobrescribir los núcleos instalados por pacman), ya que el usuario estándar no tiene permiso para modificar este directorio. Para usar núcleos desde el Online Updater, edite estas líneas:\n\n```\n~/.config/retroarch/retroarch.cfg\n```\n\n```\nlibretro_directory = \"~/.config/retroarch/cores\"\nlibretro_info_path = \"~/.config/retroarch/cores/info\"\n```\n\n"
    },
    {
      "title": "Los dispositivos de entrada no funcionan",
      "level": 3,
      "content": "Puede encontrar problemas si se ejecuta en una CLI o en un servidor de presentación que no sea Xorg o si utiliza el controlador de entrada udev, ya que los nodos / dev / input están limitados sólo al acceso de root. Intente agregar su usuario al grupo \"input\" y luego volver a iniciar sesión, por ejemplo\n\n```\n# usermod -a -G nombre de usuario de entrada\n```\n\nAlternativamente, agregue manualmente una regla en /etc/udev/rules.d/99-evdev.rules, con KERNEL==\"event*\", NAME=\"input/%k\", MODE=\"666\" como su contenido. Vuelva a cargar las reglas de udev ejecutando:\n\n```\n# udevadm control --reload-rules\n```\n\nSi el reinicio del sistema o la sustitución de los dispositivos no son opciones, los permisos pueden forzarse mediante:\n\n```\n# chmod 666 / dev / input / event *\n```\n\n"
    },
    {
      "title": "Rendimiento de vídeo deficiente",
      "level": 3,
      "content": "Si se presenta un rendimiento de vídeo deficiente, RetroArch se puede ejecutar en un subproceso independiente estableciendo video_threaded = true en ~/.config/retroarch/retroarch.cfg . Sin embargo, esta solución no debe utilizarse si ajustando la resolución de vídeo o tasa de actualización de RetroArch corrige el problema, ya que hace el perfecionamiento de V-Sync imposible, y aumenta ligeramente la latencia.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Official Website\n- RetroArch wiki on GitHub\n- Documentation for developers\n\n"
    }
  ]
}