{
  "title": "RetroArch (Русский)",
  "url": "https://wiki.archlinux.org/title/RetroArch_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "RetroArch — это эталонная реализация libretro API. Это модульный фронтенд для эмуляторов видеоигровых систем, игровых движков, видеоигр, медиаплееров и других приложений, который предлагает несколько необычных технических возможностей, таких как поддержка многопроходных шейдеров, перемотка в реальном времени и запись видео (с помощью FFmpeg), а также имеет управляемый геймером пользовательский интерфейс поверх полнофункционального интерфейса командной строки.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет retroarch. Разрабатываемая версия доступна в пакете retroarch-gitAUR.\n\n- Установите retroarch-assets-xmb чтобы получить шрифты и значки для графического интерфейса RetroArch. Вы также можете установить retroarch-assets-ozone для более удобного графического интерфейса.\n- Установите retroarch-standalone-serviceAUR чтобы получить системного пользователя, системный сервис и конфигурацию RetroArch для автономного геймбокса. Затем запустите и/или включите retroarch-standalone.service.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "RetroArch полагается на отдельные библиотеки, называемые «ядрами», для большей части своей функциональности. Они могут быть скачаны отдельно для пользователя в само́м RetroArch (через libretro Buildbot), или вы можете установить их для всей системы из libretro или из AUR.\n\nПо умолчанию RetroArch настроен на загрузку ядер из каталога пользователя. Если они установлены в другом месте (например, в системе из пакета) — перенастройте каталоги, как описано в разделе #Настройка.\n\nКоманда для запуска конкретного ядра:\n\n```\n$ retroarch --libretro /путь/к/какому_нибудь_core_libretro.so /путь/к/rom\n```\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "При первом запуске RetroArch создаётся пользовательский файл настроек ~/.config/retroarch/retroarch.cfg.\n\nЕсли вы устанавливаете компоненты RetroArch в свой домашний каталог, нужно указать соответствующие пути в этом файле. Например,\n\n```\n~/.config/retroarch/retroarch.cfg\n```\n\n```\nlibretro_directory = \"~/.config/retroarch/cores\"\nlibretro_info_path = \"~/.config/retroarch/cores/info\"\n```\n\nЕсли вы устанавливаете какие-либо компоненты RetroArch в систему с помощью pacman, вам следует указать их в глобальном файле настроек и включить его в свой пользовательский файл. Например,\n\n```\n/etc/retroarch.cfg\n```\n\n```\n# для retroarch-assets-xmb\nassets_directory = \"/usr/share/retroarch/assets\"\n# для libretro-core-info\nlibretro_info_path = \"/usr/share/libretro/info\"\n# для ядер libretro\nlibretro_directory = \"/usr/lib/libretro\"\n```\n\n```\n~/.config/retroarch/retroarch.cfg\n```\n\n```\n#include \"/etc/retroarch.cfg\"\n```\n\nNote: **и** \n\nЕсли вы хотите переопределить файл настроек (например, при запуске определённых ядер), вы можете использовать опцию командной строки --appendconfig /путь/к/настройкам.\n\n"
    },
    {
      "title": "Включение \"Online Updater\"",
      "level": 3,
      "content": "Если вы предпочитаете устанавливать все компоненты RetroArch с помощью встроенного механизма обновления вместо pacman, вы можете включить его в файле настроек:\n\n```\n~/.config/retroarch/retroarch.cfg\n```\n\n```\nmenu_show_core_updater = \"true\"\n```\n\n"
    },
    {
      "title": "Включение \"SaveRAM Autosave Interval\"",
      "level": 3,
      "content": "По умолчанию RetroArch записывает SRAM на диск только при штатном выходе, что означает риск потери данных сохранения при использовании ядер, подверженных сбоям. Чтобы изменить это поведение, в файле ~/.config/retroarch/retroarch.cfg установите autosave_interval в n.\n\n```\n~/.config/retroarch/retroarch.cfg\n```\n\n```\nautosave_interval = \"600\"\n```\n\nВ данном примере RetroArch будет записывать изменения SRAM на диск каждые 600 секунд.\n\n"
    },
    {
      "title": "Фильтры и шейдеры",
      "level": 3,
      "content": "RetroArch может загружать BSNES XML фильтры[устаревшая ссылка 2023-05-06 ⓘ] и CG шейдеры. Они задаются в retroarch.cfg в video_bsnes_shader и video_cg_shader соответственно. Шейдеры также могут быть получены и обновлены непосредственно в RetroArch с помощью Online Updater.\n\n"
    },
    {
      "title": "Сброс настроек к значениям по умолчанию",
      "level": 3,
      "content": "Чтобы сбросить настройки или сочетания клавиш к значениям по умолчанию через графический интерфейс, выделите их и нажмите Start. Чтобы удалить кнопку из сочетания клавиш, выделите его и нажмите Y.\n\n"
    },
    {
      "title": "Ядра не найдены",
      "level": 3,
      "content": "По умолчанию RetroArch ищет ядра в ~/.config/retroarch/cores, куда их устанавливает Online Updater. Ядра, установленные с помощью pacman, помещаются в /usr/lib/libretro и поэтому не отображаются в графическом интерфейсе RetroArch. Вам следует выбрать один из способов установки ядер (pacman или Online Updater) и указать соответствующий каталог, как описано в разделе #Настройка.\n\n"
    },
    {
      "title": "Не работают устройства ввода",
      "level": 3,
      "content": "Вы можете столкнуться с проблемами при работе с CLI или экранным сервером, отличным от Xorg, или при использовании драйвера ввода udev, поскольку файлы устройств /dev/input доступны только для root. Попробуйте добавить своего пользователя в группу input, а затем снова войти в систему.\n\nИли же вручную добавьте правило в /etc/udev/rules.d/99-evdev.rules с содержимым KERNEL==\"event*\", NAME=\"input/%k\", MODE=\"666\". Затем перезагрузите правила udev, выполнив:\n\n```\n# udevadm control --reload-rules\n```\n\nЕсли перезагрузка системы или переподключение устройств не подходят, можно принудительно установить права доступа, выполнив:\n\n```\n# chmod 666 /dev/input/event*\n```\n\n"
    },
    {
      "title": "Низкая производительность видео",
      "level": 3,
      "content": "При низкой производительности видео RetroArch может быть запущен в отдельном потоке с помощью установки video_threaded = true в файле настроек ~/.config/retroarch/retroarch.cfg.\n\nОднако, это решение не следует использовать, если настройка разрешения/частоты обновления видео в RetroArch устраняет проблему, так как это делает невозможной идеальную V-Sync и немного увеличивает задержку.\n\n"
    },
    {
      "title": "Проблемы со звуком при использовании ALSA",
      "level": 3,
      "content": "При использовании ALSA значение audio_out_rate должно соответствовать стандартной частоте дискретизации системы, обычно 48000.\n\n"
    },
    {
      "title": "Данные сохранения теряются при каждом сбое RetroArch",
      "level": 3,
      "content": "Смотрите раздел #Включение \"SaveRAM Autosave Interval\".\n\n"
    },
    {
      "title": "При запуске игры из плейлиста появляется сообщение \"No Items\"",
      "level": 3,
      "content": "Если RetroArch сообщает «libretro core requires contents, but nothing provided», попробуйте загрузить игру, вручную выбрав путь к ROM из Main Menu -> Load Content. Запуск игры из 'playlist' выглядит ненадёжным.\n\nНеобходимо принудительно запустить RetroArch в Xwayland.\n\n```\n$ WAYLAND_DISPLAY=\"\" retroarch\n```\n\nВы можете проверить журнал с опцией --verbose, там должно быть Found vulkan context: \"vk_x\" вместо \"vk_wayland\".\n\n"
    },
    {
      "title": "Файлы BIOS отсутствуют или не принимаются",
      "level": 3,
      "content": "Ядра RetroArch ищут файлы BIOS в месте, заданном опцией system_directory в retroarch.cfg.\n\nВ графическом интерфейсе меню Settings->Directory->System/BIOS также показывает каталог.\n\nНекоторые ядра требуют наличия файлов непосредственно в этом каталоге. Другим ядрам требуется подкаталог в этом каталоге с определённым именем для их специфических файлов BIOS. Некоторые ядра даже ищут свои файлы в том же каталоге, что и ROM-файл, который они пытаются запустить.\n\nКаждое установленное ядро предоставляет информацию о необходимых файлах, их MD5-хэшах и каталог, в который они должны быть помещены. Вы можете найти эту информацию в графическом интерфейсе в разделе Settings->Core->Manage Core. Выберите здесь ядро, чтобы получить информацию о необходимых файлах BIOS для этого конкретного ядра. RetroArch описывает их как файлы «firmware» на страницах информации о ядре.\n\nБолее подробную информацию о файлах BIOS для многих поддерживаемых ядер можно найти в официальной документации. (https://docs.libretro.com/library/bios/)\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальный сайт\n- RetroArch wiki на GitHub\n- Документация для разработчиков\n\n"
    }
  ]
}