{
  "title": "Rofi (Русский)",
  "url": "https://wiki.archlinux.org/title/Rofi_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- List of applications/Other#Application launchers\n\nRofi — переключатель окон, диалоговое окно для запуска приложений и ssh, а также замена dmenu. Разрабатывался как клон simpleswitcher, написанного Sean Pringle, а затем расширенного Dave Davenport.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет rofi для использования с оконным сервером Xorg.\n\nПоддержка для Wayland-композиторов в основной ветке приостановлена на неопределенный срок [1]. Для поддержки Wayland, вместо этого, установите rofi-lbonn-waylandAUR[ссылка недействительна: package not found] или rofi-lbonn-wayland-gitAUR для разработчиков. Обратите внимание, для этих пакетов требуется композитор Wayland, поддерживающий протокол Layer Shell. Сюда входят wlroots-based композиторы, такие как Sway, и некоторые Mir-based композиторы, но не входит, например, mutter, композитор для Gnome.\n\nЧтобы узнать больше о rofi и его использовании, смотрите rofi(1).\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Существует два способа для задания параметров настроек:\n\n- Локальная настройка. Обычно, в зависимости от XDG, располагается в ~/.config/rofi/config.rasi.\n- Параметры командной строки:\n\n```\n$ rofi -combi-modi window,drun,ssh -theme solarized -font \"hack 10\" -show combi\n```\n\nможно выразить в файле настроек следующим образом:\n\n```\nconfiguration {\n modi: \"window,drun,ssh,combi\";\n font: \"hack 10\";\n combi-modi: \"window,drun,ssh\";\n }\n@theme \"solarized\"\n```\n\nЧтобы получить полный список параметров файла config.rasi, выполните rofi -dump-config. Вы также можете записать вывод команды непосредственно в файл настроек с помощью rofi -dump-config > ~/.config/rofi/config.rasi\n\n"
    },
    {
      "title": "Значки",
      "level": 3,
      "content": "Можно использовать значки для отображения с соответствующими элементами. Предполагая, что у вас установлен papirus-icon-theme, с -show-icons и определением темы значков с -icon-theme, можно настроить отображение значков rofi и выполнить следующее:\n\n```\n$ rofi -combi-modi window,drun,ssh -theme solarized -font \"hack 10\" -show combi -icon-theme \"Papirus\" -show-icons\n```\n\n"
    },
    {
      "title": "Пользовательские темы",
      "level": 2,
      "content": "Вы можете просмотреть и применить темы для rofi с помощью\n\n```\n$ rofi-theme-selector\n```\n\nrofi-theme(5) содержит подробные инструкции о том, как создать тему rofi, используя пользовательский CSS-подобный язык. Эта страница содержит дополнительную информацию о системе компоновки, используемой rofi, точном синтаксисе, используемом для темы rofi, а также дополнительные инструкции по оформлению большинства свойств rofi. Система тем rofi может быть простой (тема dmenu по умолчанию содержит около 30 строк CSS), но она достаточно гибкая для создания различных интерактивных, widget-like апплетов и меню, вроде rofi-advanced.\n\n"
    },
    {
      "title": "Предоставляемые темы",
      "level": 3,
      "content": "Rofi поставляется с несколькими официальными темами, хранящимися в /usr/share/rofi/themes; пользовательские темы можно найти в репозитории rofi-themes.\n\nЗагрузите официальную либо скачайте пользовательскую .rasi-тему и поместите её в ~/.config/rofi/example.rasi. После этого загрузите тему с помощью параметра командной строки:\n\n```\n$ rofi options -theme example\n```\n\nили с помощью файла настроек вне блока configuration { }:\n\n```\n@theme \"example\"\n```\n\n"
    },
    {
      "title": "Rofi как замена dmenu",
      "level": 3,
      "content": "Вызванный как dmenu (через символическую ссылку), rofi ведет себя подобно dmenu. Программы, вызывающие dmenu (например passmenu из pass), будут использовать rofi вместо dmenu. Точное поведение rofi в dmenu-режиме описано в rofi-dmenu(5).\n\nЧтобы rofi приобрёл внешний вид, похожий на внешний вид dmenu, скопируйте файл /usr/share/rofi/themes/dmenu.rasi, поставляемый по умолчанию в пакете rofi, в каталог конфигурации rofi (обычно это ~/.config/rofi) и включите его, добавив @theme dmenu в конец config.rasi, или с помощью опции -theme dmenu в командной строке.\n\n"
    },
    {
      "title": "Выполнение команд оболочки из rofi",
      "level": 3,
      "content": "Если вы хотите запускать команды оболочки или ваши собственные скрипты непосредственно из rofi с просмотром вывода, убедитесь, что сделано следующее.\n\nОпределите -run-shell-command '{terminal} -e SHELL -ic \"{cmd} && read\", где SHELL — ваша оболочка (например bash, zsh). Это позволит вам ввести команду на панели ввода, а затем Shift+Enter. Терминал остается открытым до следующего нажатия клавиши.\n\nПример для i3 с использованием экранированной последовательности:\n\n```\nbindsym $mod+d exec --no-startup-id rofi -show drun -run-shell-command '{terminal} -e zsh -ic \"{cmd} && read\"'\n```\n\n"
    },
    {
      "title": "Интеграция выбора Unicode",
      "level": 3,
      "content": "Установите rofimoji для выбора смайликов/символов Unicode, интегрированного в rofi. Смотрите README проекта для использования и настройки.\n\n"
    },
    {
      "title": "Меню выбора эмодзи",
      "level": 3,
      "content": "Установите rofi-emoji для средства выбора смайликов, интегрированного с rofi. Смотрите README проекта для подробностей использования.\n\nЕсли вы столкнулись с проблемами рендеринга эмодзи (например, в виде прямоугольников), установите ttf-symbolaAUR, noto-fonts-cjk и/или noto-fonts-emoji\n\n"
    },
    {
      "title": "Rofi как меню управления питанием",
      "level": 3,
      "content": "Rofi можно использовать для управления питанием с помощью systemd. Клонируйте репозиторий rofi-power-menu. Чтобы запустить его, укажите rofi, где найти исполняемый файл rofi-power-menu. Например, если исполняемый файл находится в $HOME/.rofi-power-menu:\n\n```\n$ rofi -show p -modi p:$HOME/.rofi-power-menu\n```\n\nВы также можете поместить исполняемый файл в PATH и передать только его имя.\n\nДля отображения символов по умолчанию вам может потребоваться ttf-nerd-fonts-symbols.\n\nДля подробностей читайте файл README в репозитории.\n\n"
    },
    {
      "title": "Rofi как менеджер буфера обмена",
      "level": 3,
      "content": "Rofi можно использовать как менеджер буфера обмена X11 с помощью Greenclip. Установите пакет rofi-greenclipAUR.\n\n"
    }
  ]
}