{
  "title": "Roles (Español)",
  "url": "https://wiki.archlinux.org/title/Roles_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-10-23** \n\nArchWiki diferencia dos tipos de grupos con el objeto de definir independientemente los niveles de acceso y los roles de los usuarios. Comparado con la conveción, popular en otros proyectos de MediaWiki, donde cada función o rol está representada por un grupo con su propio conjunto de derechos, este enfoque es más flexible y permite ajustar el nivel de acceso para cada usuario, independientemente de sus funciones.\n\n"
    },
    {
      "title": "Niveles de acceso",
      "level": 2,
      "content": "Los niveles de acceso son grupos con un conjunto de derechos otrogados: su propósito es definir el alcance de los permisos que los usuarios tienen en el wiki.\n\nMediaWiki asigna automáticamente los siguientes niveles de acceso:\n\n- user es el grupo predeterminado para todos los usuarios.\n- autoconfirmed es un grupo creado automáticamente para usuarios con al menos 20 ediciones realizadas y pasados 3 días desde la fecha de creación de su cuenta. [1]. Antes de que se alcancen estos umbrales, las acciones del usuario están sujetas a algunas restricciones dirigidas a prevenir ataques de spam.\n\nLos siguientes niveles de acceso pueden ser asignados manualmente por un bureaucrat (burócrata). Los miembros con roles específicos pueden solicitar la asignación «temporal» o «permanente» correspondientes a dichos niveles, por ejemplo, después de la adquisición o el cambio de un rol o función, o para abordar necesidades individuales específicamente justificadas. Las asignaciones permanentes solo son posibles después de haber sido discutidas internamente y tras la aprobación por parte de los Administradores.\n\n- privileged es un grupo para miembros comunitarios de confianza con el fin de permitir editar la mayoría de las páginas protegidas, como las del espacio de nombres DeveloperWiki.\n- cosysop es un grupo de usuarios en los que se ha confiado para participar en el mantenimiento de la wiki. También pueden editar la mayoría de las páginas protegidas.\n- sysop es un grupo para usuarios altamente fiables que son responsables de tareas administrativas como la eliminación de páginas o el bloqueo de usuarios. También tienen todos los derechos de los grupos checkuser, interface-admin y suppress que son creados automáticamente por MediaWiki.\n- bureaucrat es un grupo de usuarios que pueden otorgar niveles de acceso y roles a otros usuarios.\n- bot es un grupo para ArchWiki:Bots.\n\n"
    },
    {
      "title": "Roles",
      "level": 2,
      "content": "Los roles son grupos sin un conjunto de derechos otorgados. El propósito de los roles es aclarar la función del usuario en la wiki dentro de la comunidad de Arch. En general, los roles no se eliminan de los usuarios que pueden quedar inactivos. Los Administradores se reservan el derecho de realizar variaciones por usuario en los niveles de acceso predeterminados para cada rol.\n\n- Maintainers (maintainer, mantenedores) es un grupo para los miembros del equipo de mantenimiento. Todos los mantenedores tienen al menos el nivel de acceso cosysop. Los mantenedores con el nivel de acceso sysop se denominan Administrators (administradores). También hay un grupo Administrator fellows (administrator_fellow) para administradores retirados.\n- Translators (translator) es un grupo para los miembros más productivos de un equipo de traducción o para traductores individuales.\n- Arch Linux Developers (archdev) es un grupo para desarrolladores de Arch. Todos los Arch Linux Developers reciben el nivel de acceso privilegiado de forma predeterminada.\n- ⧼group-archtu⧽ (archtu) es un grupo para usuarios de confianza de Arch.\n- Arch Linux Support Staff (archstaff) es un grupo para usuarios con otros roles dentro de la comunidad Arch Linux: El equipo de pruebas de Arch se asegura de que los paquetes enviados a los repositorios de pruebas sean funcionales. El Equipo de seguridad del Arch rastrea los problemas de seguridad con paquetes en security.archlinux.org}. Los moderadores del foro moderan los Foros de Arch Linux. Los operadores de canales de IRC moderan los principales canales de IRC.\n\n- Todos los mantenedores tienen al menos el nivel de acceso cosysop. Los mantenedores con el nivel de acceso sysop se denominan Administrators (administradores). También hay un grupo Administrator fellows (administrator_fellow) para administradores retirados.\n\n- Todos los Arch Linux Developers reciben el nivel de acceso privilegiado de forma predeterminada.\n\n- El equipo de pruebas de Arch se asegura de que los paquetes enviados a los repositorios de pruebas sean funcionales.\n- El Equipo de seguridad del Arch rastrea los problemas de seguridad con paquetes en security.archlinux.org}.\n- Los moderadores del foro moderan los Foros de Arch Linux.\n- Los operadores de canales de IRC moderan los principales canales de IRC.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Original pull request\n\n"
    }
  ]
}