{
  "title": "RTorrent (Français)",
  "url": "https://wiki.archlinux.org/title/RTorrent_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "rTorrent est un client BitTorrent écrit en C++ et utilisant la bibliothèque logicielle libTorrent (qui ne doit pas être confondue avec libtorrent-rasterbar). Celle-ci est développée conjointement au client. rTorrent fournit un environnement en mode texte grâce à la bibliothèque ncurses. Combiné avec un multiplexeur de terminal, comme GNU Screen ou Tmux et Secure Shell, il peut s'avérer pratique pour une utilisation à distance.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet rtorrent.\n\n"
    },
    {
      "title": "Paquets non-officiels",
      "level": 3,
      "content": "- rtorrent-gitAUR - Branche principale du dépôt Git du paquet.\n- rtorrent-psAUR - Version contenant l'ensemble des correctifs rtorrent-ps.\n- rtorrent-pyro-gitAUR - Autre branche du dépôt Git du paquet avec l'ensemble des correctifs rtorrent-ps.\n- rtorrent-vi-colorAUR - Version avec des raccourcis claviers inspirés de Vi.\n\n"
    },
    {
      "title": "Raccourcis clavier",
      "level": 2,
      "content": "La navigation au sein de rTorrent se fait exclusivement à l'aide de raccourcis clavier. Un résumé de ceux-ci est disponible ci-dessous. Un guide plus complet est disponible sur le wiki de rTorrent (voir: Guide utilisateur de rTorrent).\n\nTable content:\nCmd | Action\nCtrl-q | Quitte l'application.\nCtrl-s | Démarre le téléchargement. Lance la vérification d'intégrité sauf si celle-ci a déjà été effectuée.\nCtrl-d | Arrête un téléchargement en cours ou supprime un téléchargement arrêté.\nCtrl-k | Arrête et ferme les fichiers d'un téléchargement en cours.\nCtrl-r | Commence la vérification d'intégrité. Démarre le téléchargement si le fichier est introuvable.\nCtrl-o | Spécifie le répertoire de téléchargement pour un torrent ajouté mais pas encore démarré.\nLeft | Retour au menu précédent.\nRight | Aller au menu suivant.\nBackspace | Ajoute et démarre le téléchargement du torrent spécifié.\nReturn | Ajoute et mais ne démarre pas le téléchargement du torrent spécifié.\na|s|d | Augmente la limite générale d'envoi de 1|5|50 Ko/s.\nA|S|D | Augmente la limite générale de téléchargement de 1|5|50 Ko/s.\nz|x|c | Diminue la limite générale d'envoi de 1|5|50 Ko/s.\nZ|X|C | Diminue la limite générale de téléchargement de 1|5|50 Ko/s.\n\n"
    },
    {
      "title": "Raccourcis clavier redondants",
      "level": 3,
      "content": "Ctrl-s est souvent utilisé pour contrôler l'arrêt de l'affichage au sein d'un terminal tandis que Ctrl-q est utilisé pour le démarrer. Ces raccourcis clavier peuvent interférer avec rTorrent. Il est possible de vérifier si ces derniers sont configurés :\n\n```\n$ stty -a\n```\n\n```\n...\nswtch = <undef>; start = ^Q; stop = ^S; susp = ^Z; rprnt = ^R; werase = ^W; lnext = ^V;\n...\n```\n\nPour supprimer ces raccourcis, il faut changer les options du terminal afin de supprimer ces définitions (ici stop et start):\n\n```\n# stty stop undef\n# stty start undef\n```\n\nPour les supprimer automatiquement au démarrage, il est possible d'ajouter les deux commandes au fichier ~/.bashrc.\n\n"
    }
  ]
}