{
  "title": "S.M.A.R.T. (Русский)",
  "url": "https://wiki.archlinux.org/title/S.M.A.R.T._(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "S.M.A.R.T. (Self-Monitoring, Analysis, and Reporting Technology) — дополнительный компонент, встроенный во многие современные устройства хранения данных, с помощью которого они отслеживают, хранят и анализируют состояние своей работы. Собирается статистика (температура, количество переназначенных секторов, ошибки поиска...), которую программное обеспечение может использовать для оценки состояния устройства, прогнозирования возможных сбоев в его работе и уведомления о небезопасных значениях.\n\n"
    },
    {
      "title": "Smartmontools",
      "level": 2,
      "content": "Пакет smartmontools содержит две утилиты для анализа и мониторинга устройств хранения данных: smartctl и smartd. Для их использования установите пакет smartmontools.\n\nДля эффективного использования этих инструментов поддержка SMART должна быть доступна и включена на каждом устройстве хранения данных. Можно использовать #smartctl для проверки наличия и включения поддержки SMART. После этого вы можете вручную выполнить #Запуск теста и #Просмотр результатов теста или использовать #smartd для автоматического запуска тестов и отправки уведомлений по электронной почте.\n\n"
    },
    {
      "title": "smartctl",
      "level": 3,
      "content": "smartctl — инструмент командной строки для управления системой SMART, встроенной в большинство ATA/SATA и SCSI/SAS жёстких дисков и твердотельных накопителей.\n\nОпция -i/--info выводит различную информацию об устройстве, в том числе о том, доступен ли SMART и включен ли он:\n\n```\n# smartctl --info /dev/sda | grep 'SMART support is:'\n```\n\n```\nSMART support is: Available - device has SMART capability.\nSMART support is: Enabled\n```\n\nЕсли SMART доступен, но не включен, вы можете включить его:\n\n```\n# smartctl --smart=on /dev/устройство\n```\n\nМожет потребоваться указать тип устройства. Например, опция --device=ata укажет smartctl, что тип устройства — ATA, что предотвратит попытки отправки SCSI-команд на это устройство.\n\n"
    },
    {
      "title": "Запуск теста",
      "level": 4,
      "content": "Существует три типа самотестирования, которые может выполнить устройство (все они безопасны для хранящихся на устройстве данных):\n\n- Короткий (Short): выполняет тесты, которые с высокой вероятностью обнаруживают проблемы устройства,\n- Расширенный (Extended) или долгий (Long): аналогичен короткому, но без ограничения времени и с полным исследованием поверхности диска,\n- Транспортировка (Conveyance): выявляет наличие повреждений, которые устройство могло получить во время транспортировки.\n\nОпция -c/--capabilities выводит, какие тесты поддерживает устройство и приблизительное время выполнения каждого теста. Например:\n\n```\n# smartctl -c /dev/sda\n```\n\n```\n...\nShort self-test routine\nrecommended polling time:        (   1) minutes.\nExtended self-test routine\nrecommended polling time:        (  74) minutes.\nConveyance self-test routine\nrecommended polling time:        (   2) minutes.\n...\n```\n\nДля запуска теста используйте опцию -t/--test=название:\n\n```\n# smartctl -t short /dev/устройство\n# smartctl -t long /dev/устройство\n# smartctl -t conveyance /dev/устройство\n```\n\n"
    },
    {
      "title": "Просмотр результатов теста",
      "level": 4,
      "content": "Посмотреть общее состояние здоровья устройства можно с помощью флага -H. Если устройство сообщает об отказе, это означает либо то, что устройство уже вышло из строя, либо то, что оно прогнозирует свой отказ в течение следующих 24 часов. Если это произошло — как можно скорее скопируйте данные с диска в безопасное место.\n\n```\n# smartctl -H /dev/устройство\n```\n\nМожно также просмотреть список последних результатов тестирования и подробную информацию об устройстве:\n\n```\n# smartctl -l selftest /dev/устройство\n# smartctl -a /dev/устройство\n```\n\n"
    },
    {
      "title": "Генерация таблицы с атрибутами всех дисков",
      "level": 4,
      "content": "```\n#!/bin/bash\nfunction drives_csv {\n\tdeclare -A drive_values\n\tfor d in `smartctl --scan -d scsi | cut -d' ' -f1`; do\n\t\tdrive_values[\"-Drive-----------------\"]=\"${drive_values[-Drive-----------------]},$d\"\n\t\tfor l in `smartctl -A $d | grep ATTRIBUTE_NAME -A30 | grep -v ATTRIBUTE_NAME | column -H1,3,4,5,6,7,8,9,11,12,13,14,15 -t -o, | sed 's/ //g'`; do\n\t\t\tkey=`echo $l | cut -d',' -f1`\n\t\t\tvalue=`echo $l | cut -d',' -f2`\n\t\t\texisting=${drive_values[\"$key\"]}\n\t\t\tdrive_values[\"${key}\"]=\"${existing},${value}\"\n\t\t\t#~ echo \"${key},${drive_values[$key]}\"\n\t\tdone\n\tdone\n\tfor key in \"${!drive_values[@]}\"; do\n\t\techo \"${key}${drive_values[$key]}\"\n\tdone | sort\n}\ndrives_csv | column -s, -t\n```\n\n"
    },
    {
      "title": "smartd",
      "level": 3,
      "content": "Демон smartd отслеживает состояние SMART и отправляет уведомления, когда что-то идёт не так. Он управляется через systemd и настраивается в файле /etc/smartd.conf. Синтаксис конфигурационного файла эзотеричен, и в данной статье представлено лишь краткое описание. Для получения более полной информации читайте примеры и комментарии в конфигурационном файле или в smartd.conf(5).\n\n"
    },
    {
      "title": "Управление демоном",
      "level": 4,
      "content": "Чтобы запустить демон, проверить его состояние, сделать его автозапуск при загрузке системы и прочитать последние записи в журнале, просто запустите/включите systemd-службу smartd.service.\n\n"
    },
    {
      "title": "Определение устройств для мониторинга",
      "level": 4,
      "content": "Чтобы отслеживать все возможные ошибки SMART на всех дисках, в файле конфигурации должен быть следующий параметр:\n\n```\n/etc/smartd.conf\n```\n\n```\nDEVICESCAN -a\n```\n\nОн уже есть в конфигурации smartd по умолчанию, а параметр -a, который является параметром по умолчанию, может быть опущен.\n\nЧтобы отслеживать все возможные ошибки SMART на /dev/sda и /dev/sdb и игнорировать все остальные устройства:\n\n```\n/etc/smartd.conf\n```\n\n```\n/dev/sda -a\n/dev/sdb -a\n```\n\nЧтобы отслеживать все возможные ошибки SMART на подключенных внешних дисках (к примеу, USB-дисках для резервного копирования), лучше указать UUID устройства, так как при перезагрузке /dev/sdX диска может измениться.\n\nСначала необходимо получить UUID диска для мониторинга: ls -lah /dev/disk/by-uuid/ теперь найдите диск, который вы хотите отслеживать:\n\n```\n$ ls -lah /dev/disk/by-uuid/\n```\n\n```\nlrwxrwxrwx 1 root root   9 Nov  5 22:41 820cdd8a-866a-444d-833c-1edb0f4becac -> ../../sde\nlrwxrwxrwx 1 root root  10 Nov  5 22:41 b51b87f3-425e-4fe7-883f-f4ff1689189e -> ../../sdf2\nlrwxrwxrwx 1 root root   9 Nov  5 22:42 ea2199dd-8f9f-4065-a7ba-71bde11a462c -> ../../sda\nlrwxrwxrwx 1 root root  10 Nov  5 22:41 fe9e886a-8031-439f-a909-ad06c494fadb -> ../../sdf1\n```\n\nК примеру, если нужный вам диск в данный момент является /dev/sde, то вы можете взять отсюда его UUID и в настройках smartd просто указать путь в /dev/disk/by-uuid/:\n\n```\n/etc/smartd.conf\n```\n\n```\n/dev/disk/by-uuid/820cdd8a-866a-444d-833c-1edb0f4becac -a\n```\n\nТакже может понадобиться добавить опцию -d removable для работы smartd.\n\nТеперь этот диск будет корректно отслеживаться, даже если его путь /dev/sdX изменится после перезагрузки.\n\n"
    },
    {
      "title": "Уведомление о возможных проблемах",
      "level": 4,
      "content": "Для получения email при появлении новых ошибок укажите адрес своей электронной почты в опции -m:\n\n```\n/etc/smartd.conf\n```\n\n```\nDEVICESCAN -m address@domain.com\n```\n\nЧтобы иметь возможность отправлять почту в интернет (то есть не на локальный почтовый аккаунт root), необходимо установить и настроить MTA (Mail Transport Agent) или MUA (Mail User Agent). Распространёнными MUA являются msmtp и Postfix, но, вероятно, подойдёт и самый простой dma. Распространёнными MTA являются sendmail и Postfix. Достаточно просто настроить S-nail, если вам не нужно ничего другого, но нужно следовать этим инструкциям.\n\nОпция -M test включит отправку тестового письма при каждом запуске демона smartd:\n\n```\n/etc/smartd.conf\n```\n\n```\nDEVICESCAN -m address@domain.com -M test\n```\n\nДоставка электронных писем может занять довольно много времени. Чтобы быть уверенным, что вы будете немедленно предупреждены о сбое жёсткого диска, можно указать скрипт, который будет выполняться в дополнение к отправке письма:\n\n```\n/etc/smartd.conf\n```\n\n```\nDEVICESCAN -m address@domain.com -M exec /usr/local/bin/smartdnotify\n```\n\nДля отправки письма и системного уведомления можно использовать примерно такой скрипт /usr/local/bin/smartdnotify:\n\n```\n#!/bin/sh\n# Отправка письма\necho \"$SMARTD_MESSAGE\" | mail -s \"$SMARTD_FAILTYPE\" \"$SMARTD_ADDRESS\"\n# Отправка системного уведомления\nwall \"$SMARTD_MESSAGE\"\n```\n\nЕсли вы работаете в среде рабочего стола, вы можете захотеть получать всплывающее уведомление на рабочем столе. Для этого можно использовать такой скрипт (замените X_user и X_userid на пользователя и userid, под которым запущен X, соответственно):\n\n```\n/usr/local/bin/smartdnotify\n```\n\n```\n#!/bin/sh\n\nsudo -u X_user DISPLAY=:0 DBUS_SESSION_BUS_ADDRESS=unix:path=/run/user/X_userid/bus notify-send \"S.M.A.R.T Error ($SMARTD_FAILTYPE)\" \"$SMARTD_MESSAGE\" --icon=dialog-warning -u critical\n```\n\nДля работы скрипта нужны libnotify и совместимая среда рабочего стола. Смотрите статью Desktop notifications (Русский) для более подробной информации.\n\nТакже можно добавлять скрипты в каталог /usr/share/smartmontools/smartd_warning.d/.\n\nСкрипт, который уведомляет всех вошедших пользователей через libnotify:\n\n```\n/usr/share/smartmontools/smartd_warning.d/smartdnotify\n```\n\n```\n#!/bin/sh\n\nIFS=$'\\n'\nfor LINE in `w -hs`\ndo\n    USER=`echo $LINE | awk '{print $1}'`\n    USER_ID=`id -u $USER`\n    DISP_ID=`echo $LINE | awk '{print $8}'`\n    sudo -u $USER DISPLAY=$DISP_ID DBUS_SESSION_BUS_ADDRESS=unix:path=/run/user/$USER_ID/bus notify-send \"S.M.A.R.T Error ($SMARTD_FAILTYPE)\" \"$SMARTD_MESSAGE\" --icon=dialog-warning -u critical\ndone\n```\n\nДля работы скрипта нужны libnotify и procps-ng и совместимая среда рабочего стола.\n\nДля запуска скрипта из этого каталога укажите его название в таком формате:\n\n```\n/etc/smartd.conf\n```\n\n```\nDEVICESCAN -m @smartdnotify\n```\n\n"
    },
    {
      "title": "Управление питанием",
      "level": 4,
      "content": "Можно проинструктировать smartd, как обращаться с дисками в режиме пониженного энергопотребления. Обычно в ответ на команды SMART, выдаваемые smartd, пластины диска раскручиваются. Поэтому если эта опция не используется, то диск, находящийся в режиме пониженного энергопотребления, может быть раскручен и переведён в режим повышенного энергопотребления, если smartd его периодически опрашивает.\n\n```\n/etc/smartd.conf\n```\n\n```\nDEVICESCAN -n standby,15,q\n```\n\nПодробнее в smartmontools wiki.\n\nИногда опция -n не работает. Вы можете увидеть подобное сообщение в системном журнале:\n\n```\n# journalctl -u smartd\n```\n\n```\nCHECK POWER MODE: incomplete response, ATA output registers missing\nDevice: /dev/sdb [SAT], no ATA CHECK POWER STATUS support, ignoring -n Directive\n```\n\nВ качестве альтернативы можно использовать опцию -i. Она определяет, как часто smartd раскручивает диски для проверки их состояния. По умолчанию это 30 минут. Для изменения создайте и измените файл /etc/default/smartmontools.\n\n```\n/etc/default/smartmontools\n```\n\n```\nSMARTD_ARGS=\"-i 10800\"  Проверка каждые 10800 секунд (3 часа)\n```\n\nСмотрите smartd(8) для более подробной информации.\n\n"
    },
    {
      "title": "Выполнение тестов по расписанию",
      "level": 4,
      "content": "smartd может запускать самотестирование дисков по расписанию. Следующая конфигурация /etc/smartd.conf будет запускать короткий тест каждый день между 2-3 часами ночи и расширенный тест еженедельно по субботам между 3-4 часами утра:\n\n```\n/etc/smartd.conf\n```\n\n```\nDEVICESCAN -s (S/../.././02|L/../../6/03)\n```\n\n"
    },
    {
      "title": "Оповещение об изменении температуры",
      "level": 4,
      "content": "smartd может отслеживать температуру дисков и предупреждать, если она повышается слишком быстро или достигает верхнего предела. Приведённый ниже пример будет записывать изменение температуры на 4 градуса и более, достижение температуры 35 градусов и отправлять предупреждение при достижении температуры 40:\n\n```\n/etc/smartd.conf\n```\n\n```\nDEVICESCAN -W 4,35,40\n```\n\n- Посмотреть текущую температуру диска можно с помощью команды smartctl -A /dev/устройство | grep Temperature_Celsius\n- Если у вас есть диски, которые намного горячее/холоднее других, удалите DEVICESCAN и определите отдельную конфигурацию для каждого устройства с нужными настройками температуры.\n\n"
    },
    {
      "title": "Полный пример smartd.conf",
      "level": 4,
      "content": "Объединение всего вышеперечисленного даст следующий пример конфигурации:\n\n- DEVICESCAN — smartd отслеживает все диски, которые найдёт\n- -a — отслеживание всех атрибутов\n- -o on — включение SMART Automatic Offline Testing\n- -S on — включение автоматического сохранения атрибутов\n- -n standby,q — не проверять диск, если он в режиме пониженного энергопотребления, и подавлять сообщение об этом в журнале, чтобы не вызвать запись на диск\n- -s ... — выполнение коротких и расширенных тестов по расписанию\n- -W ... — отслеживание температуры\n- -m ... — уведомления на почту\n\n```\n/etc/smartd.conf\n```\n\n```\nDEVICESCAN -a -o on -S on -n standby,q -s (S/../.././02|L/../../6/03) -W 4,35,40 -m <пользователь или email>\n```\n\n"
    },
    {
      "title": "Консольные приложения",
      "level": 2,
      "content": "- skdump — утилита для мониторинга и управления устройствами SMART для мониторинга и отчёта о состоянии жёсткого диска.\n\n- iostat -x (из пакета sysstat) также предоставляет некоторые показатели состояния диска: в частности, высокие значения в столбце f_await означают, что диск не отвечает быстро на запросы и может выйти из строя.\n\n"
    },
    {
      "title": "Графические приложения",
      "level": 2,
      "content": "- DisKMonitor — Инструменты KDE для мониторинга состояния SMART-устройств и MDRaid.\n\n- Plasma Disks — Мониторинг состояния жёстких дисков для KDE Plasma.\n\n- Gnome Disks — GNOME-фронтенд, который использует libatasmart для мониторинга и уведомления о состоянии дисков (часть рабочего стола gnome, который также включает в себя gsd-disk-utility-notify).\n\n- GSmartControl — GNOME-фронтенд для утилиты smartctl.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Сайт Smartmontools\n- Smartmontools на Ubuntu Wiki\n- Gentoo: smartmontools\n\n"
    }
  ]
}