{
  "title": "Samba (Português)",
  "url": "https://wiki.archlinux.org/title/Samba_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Active Directory Integration\n- Samba/Active Directory domain controller\n- NFS\n\nSamba é a suíte de programas padrão de interoperabilidade do Windows com Linux e Unix. Desde 1992, Samba vem provendo seguros, estáveis e rápidos serviços de arquivo e impressão para todos os clientes usando o protocolo SMB/CIFS, como todas as versões do DOS e Windows, OS/2, Linux e muitos outros.\n\nPara compartilhar arquivos através do Samba, veja a seção #Servidor; para acessar arquivos compartilhados através do Samba em outras máquinas, veja a seção #Cliente.\n\n"
    },
    {
      "title": "Instalação",
      "level": 3,
      "content": "Instale o pacote samba.\n\nSamba é configurado pelo arquivo de configuração /etc/samba/smb.conf, o qual é extensivamente documentado em smb.conf(5).\n\nPelo fato do pacote samba não prover este arquivo, um deverá ser criado antes de iniciar o serviço smb.service.\n\nUm exemplo documentado smb.conf.default do repositório git do Samba pode ser usado para configurar /etc/samba/smb.conf.\n\n- A configuração padrão ajusta log file para uma localização não gravável, o que irá causar erros - aplica-se uma das seguintes soluções: Altere a localização do arquivo de log para um caminho gravável: log file = /var/log/samba/%m.log Altere o log para uma solução de back-end sem arquivo: logging = syslog com syslog only = yes, ou use logging = systemd\n- Se necessário; o workgroup especificado na seção [global] precisa equivaler ao grupo de trabalho do Windows (por padrão WORKGROUP).\n\n- Altere a localização do arquivo de log para um caminho gravável: log file = /var/log/samba/%m.log\n- Altere o log para uma solução de back-end sem arquivo: logging = syslog com syslog only = yes, ou use logging = systemd\n\n"
    },
    {
      "title": "Ativando e iniciando serviços",
      "level": 4,
      "content": "Para prover compartilhamento básico de arquivos via SMB, ative/inicie smb.service. Veja smbd(8) para mais detalhes.\n\nSe você deseja tornar o seu servidor acessível via NetBIOS hostname, ajuste o nome desejado através da opção netbios name em smb.conf e ative/inicie nmb.service. Veja nmbd(8) para detalhes.\n\n"
    },
    {
      "title": "Tornar a rede detectável",
      "level": 4,
      "content": "Instale o pacote avahi, então ative/inicie avahi-daemon.service para tornar o servidor samba detectável com Zeroconf. Isto deve funcionar para a maioria dos gerenciadores de arquivos não-Windws (como Finder do macOS, vários gerenciadores de arquivos baseados em interface gráfica do Linux e BSD etc.)\n\nSe avahi-daemon.service não estiver em execução, o servidor continuará acessível, apenas não detectável, isto é, não aparecerá nos gerenciadores de arquivos, mas você poderá conectar-se ao servidor diretamente pelo IP ou domínio.\n\nO Windows Explorer depende do protocolo WS-Discovery; veja #Windows 1709 ou mais recente não mostra o servidor Samba na rede.\n\n"
    },
    {
      "title": "Configurar firewall",
      "level": 4,
      "content": "Se você estiver usando um firewall, não se esqueça de abrir as portas necessárias (normalmente 137-139 + 445). Para uma lista completa, veja uso de portas pelo Samba.\n\nUm perfil de aplicativo Ufw para SMB/CIFS é incluído por padrão com a instalação padrão do UFW em ufw-fileserver.\n\nPermita ao Samba executar ufw allow CIFS como root.\n\nCaso tenha excluído o perfil, crie/edite /etc/ufw/applications.d/samba e adicione o seguinte conteúdo:\n\n```\n[Samba]\ntitle=LanManager-like file and printer server for Unix\ndescription=The Samba software suite is a collection of programs that implements the SMB/CIFS protocol for unix systems, allowing you to serve files and printers to Windows, NT, OS/2 and DOS clients. This protocol is sometimes also referred to as the LanManager or NetBIOS protocol.\nports=137,138/udp|139,445/tcp\n```\n\nEm seguida, carregue o perfil no UFW executando ufw app update Samba como root.\n\nEntão finalmente dê permissão ao Samba executando ufw allow Samba como root.\n\nPara configurar firewalld para permitir Samba na zona home, execute:\n\n```\n# firewall-cmd --permanent --add-service={samba,samba-client,samba-dc} --zone=home\n```\n\nOs três serviços listados são:\n\n- samba: para compartilhar arquivos com terceiros.\n- samba-client: para navegar por compartilhamentos em outras máquinas na rede.\n- samba-dc: para Samba/Active Directory domain controller.\n\n--permanent garante que as mudanças continuem após o reinício do serviço firewalld.service.\n\n"
    },
    {
      "title": "Gerenciamento de usuários",
      "level": 4,
      "content": "A seguinte seção descreve como criar um banco de dados local (tdbsam) de usuários do Samba. Para autenticação de usuários e outros propósitos, Samba também pode ser vinculado a um domínio do Active Directory, pode servir como um controlador de domínio do Active Directory ou pode ser usado com um servidor LDAP.\n\nSamba requer uma conta de usuário Linux - você poderá usar uma existente ou criar uma nova.\n\nEmbora o nome de usuário seja compartilhado com o sistema Linux, o Samba usa uma senha separada daquela das contas de usuário do Linux. Substitua samba_user com a conta de usuário Samba escolhida:\n\n```\n# smbpasswd -a samba_user\n```\n\nDependendo da função do servidor, permissões de arquivo e atributos existentes podem precisar ser alterados para a conta de usuário do Samba.\n\nSe você deseja que o novo usuário tenha permissão apenas para acessar remotamente os compartilhamentos do servidor de arquivos através do Samba, você pode restringir outras opções de login：\n\n- disabling shell - usermod --shell /usr/bin/nologin --lock samba_user\n- disabling SSH logons - edit /etc/ssh/sshd_config, change option AllowUsers\n\nVeja também segurança para aumentar a segurança do seu sistema.\n\nUsuários do Samba podem ser listados usando o comando pdbedit(8):\n\n```\n# pdbedit -L -v\n```\n\nPara alterar uma senha do usuário, use smbpasswd:\n\n```\n# smbpasswd samba_user\n```\n\n"
    },
    {
      "title": "Criando um compartilhamento anônimo",
      "level": 4,
      "content": "1. Crie um usuário Linux para o qual os usuários anônimos do Samba serão mapeados.\n\n```\n# useradd guest -s /bin/nologin\n```\n\n2. Adicione o seguinte ao /etc/samba/smb.conf:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n...\n[global]\nsecurity = user\nmap to guest = bad user\nguest account = guest\n\n[guest_share]\n    comment = guest share\n    path = /tmp/\n    public = yes\n    only guest = yes\n    writable = yes\n    printable = no\n```\n\nUsuários anônimos serão agora mapeados ao usuário Linux guest e terão a capacidade de acessar quaisquer diretórios definidos em guest_share.path, o qual é configurado para ser /tmp/ no exemplo acima.\n\nCertifique-se de que o usuário Linux guest possui as permissões apropriadas para acessar arquivos em guest_share.path.\n\nAlém disso, certifique-se de que os compartilhamentos foram definidos adequadamente de acordo com a seção Share Definitions de smb.conf.default.\n\n"
    },
    {
      "title": "Ativar seguimento de links simbólicos",
      "level": 3,
      "content": "```\n/etc/samba/smb.conf\n```\n\n```\n...\n[global]\n   follow symlinks = yes\n   wide links = yes\n   unix extensions = no\n```\n\nEntão, reinicie smb.service.\n\n"
    },
    {
      "title": "Ativar compartilhamentos de usuário",
      "level": 4,
      "content": "Compartilhamentos de usuário é um recurso que dá a usuários não-root a capacidade de adicionar, modificar e excluir suas próprias definições de compartilhamento. Veja smb.conf(5) § USERSHARES.\n\n1. Crie um diretório para compartilhamentos de usuário: # mkdir /var/lib/samba/usershares\n1. Crie um grupo de usuários: # groupadd -r sambashare\n1. Altere o proprietário do diretório para root e o grupo para sambashare: # chown root:sambashare /var/lib/samba/usershares\n1. Altere as permissões do diretório usershares para que os usuários do grupo sambashare possam criar arquivos. Este comando também ajusta o sticky bit, o qual é importante para prevenir que usuários excluam compartilhamentos de outros usuários: # chmod 1770 /var/lib/samba/usershares\n\n```\n# mkdir /var/lib/samba/usershares\n```\n\n```\n# groupadd -r sambashare\n```\n\n```\n# chown root:sambashare /var/lib/samba/usershares\n```\n\n```\n# chmod 1770 /var/lib/samba/usershares\n```\n\nAjuste os seguintes parâmetros no arquivo de configuração smb.conf:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  usershare path = /var/lib/samba/usershares\n  usershare max shares = 100\n  usershare allow guests = yes\n  usershare owner only = yes\n```\n\nAdicione o usuário ao grupo sambashare. Substitua your_username pelo nome de seu usuário:\n\n```\n# gpasswd sambashare -a your_username\n```\n\nReinicie os serviços smb.service e nmb.service.\n\nFaça logout e login novamente.\n\nSe desejar compartilhar caminhos dentro de seu diretório home, você deve torná-lo acessível para o grupo others.\n\nNa interface gráfica, você pode usar Thunar ou Dolphin - clique com o botão direito em qualquer diretório e compartilhe-o na rede.\n\nNa linha de comando, use um dos seguintes comandos, substituindo o que está em itálico sharename, user, ... :\n\n```\n# net usershare add sharename abspath [comment] [user:{R|D|F}] [guest_ok={y|n}]\n# net usershare delete sharename\n# net usershare list wildcard-sharename\n# net usershare info wildcard-sharename\n```\n\n"
    },
    {
      "title": "Ajustar e forçar permissões",
      "level": 4,
      "content": "Permissões podem ser aplicadas para ambos servidor e compartilhamentos:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  ;inherit owner = unix only ; Inherit ownership of the parent directory for new files and directories\n  ;inherit permissions = yes ; Inherit permissions of the parent directory for new files and directories\n  create mask = 0664\n  directory mask = 2755\n  force create mode = 0644\n  force directory mode = 2755\n  ...\n\n[media]\n  comment = Media share accessible by greg and pcusers\n  path = /path/to/media\n  valid users = greg @pcusers\n  force group = +pcusers\n  public = no\n  writable = yes\n  create mask = 0664\n  directory mask = 2775\n  force create mode = 0664\n  force directory mode = 2775\n\n[public]\n  comment = Public share where archie has write access\n  path = /path/to/public\n  public = yes\n  read only = yes\n  write list = archie\n  printable = no\n\n[guests]\n  comment = Allow all users to read/write\n  path = /path/to/guests\n  public = yes\n  only guest = yes\n  writable = yes\n  printable = no\n```\n\nVeja smb.conf(5) para uma visão geral de possíveis bandeiras de permissão e configurações.\n\n"
    },
    {
      "title": "Restringir protocolos para maior segurança",
      "level": 4,
      "content": "Acrescente server min protocol e server max protocol em /etc/samba/smb.conf para forçar o uso de um protocolo mínimo e máximo:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  server min protocol = SMB2_02\n  ; server max protocol = SMB3\n```\n\nVeja server max protocol em smb.conf(5) para uma visão geral de protocolos suportados.\n\nPara compatibilidade com clientes e/ou servidores mais antigos, você pode precisar definir client min protocol = CORE ou server min protocol = CORE, mas observe que isto torna o seu sistema mais vulnerável a exploits no SMB1 incluindo ataques de ransonware.\n\nClientes usando mount.cifs podem necessitar que seja especificado o vers=* correto, por exemplo:\n\n```\n# mount -t cifs //SERVER/sharename /mnt/mountpoint -o username=username,password=password,iocharset=utf8,vers=3.1.1\n```\n\nVeja mount.cifs(8) para mais informações.\n\n"
    },
    {
      "title": "Usar criptografia de transporte SMB nativa",
      "level": 4,
      "content": "A criptografia de transporte SMB nativa está disponível na versão SMB 3.0 ou mais recente. Os clientes que oferecem suporte a esse tipo de criptografia incluem Windows 8 e mais recente, Windows server 2012 e mais recente e smbclient do Samba 4.1 e mais recente.\n\nPara usar a criptografia de transporte SMB nativa por padrão, defina o parâmetro server smb encrypt globalmente e/ou por compartilhamento. Valores possíveis são off, enabled (valor padrão), desired, ou required:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  server smb encrypt = desired\n```\n\nPara configurar a criptografia no lado do cliente, use a opção client smb encrypt.\n\nVeja smb.conf(5) para maiores informações, especialmente os parágrafos Effects for SMB1 e Effects for SMB2.\n\n"
    },
    {
      "title": "Desativar compartilhamento de impressora",
      "level": 4,
      "content": "Por padrão, o Samba compartilha impressoras configuradas usando CUPS.\n\nSe você não quiser que as impressoras sejam compartilhadas, use as seguintes configurações:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  load printers = no\n  printing = bsd\n  printcap name = /dev/null\n  disable spoolss = yes\n  show add printer wizard = no\n```\n\n"
    },
    {
      "title": "Bloquear certas extensões de arquivo em um compartilhamento do Samba",
      "level": 4,
      "content": "O Samba oferece uma opção para bloquear arquivos com determinados padrões, como extensões de arquivo. Esta opção pode ser usada para evitar a disseminação de vírus ou para dissuadir os usuários de desperdiçar espaço com determinados arquivos. Mais informações sobre esta opção podem ser encontradas em smb.conf(5).\n\n```\n/etc/samba/smb.conf\n```\n\n```\n...\n[myshare]\n  comment = Private\n  path = /mnt/data\n  read only = no\n  veto files = /*.exe/*.com/*.dll/*.bat/*.vbs/*.tmp/*.mp3/*.avi/*.mp4/*.wmv/*.wma/\n```\n\n"
    },
    {
      "title": "Melhorar o desempenho",
      "level": 4,
      "content": "As configurações padrão devem ser suficientes para a maioria dos usuários. No entanto, definir 'socket options' corretamente poderá melhorar o desempenho, mas errar pode torná-lo mais lento. Teste o efeito antes de fazer grandes alterações.\n\nLeia smb.conf(5) no manual antes de aplicar quaisquer opções listadas abaixo.\n\nAs seguintes configurações deverão ser acrescentadas à seção [global] de /etc/samba/smb.conf.\n\nDefinir deadtime é útil para impedir que os recursos de um servidor sejam esgotados por um grande número de conexões inativas:\n\n```\ndeadtime = 30\n```\n\nO uso de sendfile pode tornar o uso mais eficiente das CPUs do sistema e fazer com que o Samba seja mais rápido:\n\n```\nuse sendfile = yes\n```\n\nDefinir um tamanho mínimo de receivefile permite gravações de cópia zero diretamente dos buffers de soquete de rede no cache de buffer do sistema de arquivos (se disponível). Pode melhorar o desempenho, mas o teste do usuário é recomendado:\n\n```\nmin receivefile size = 16384\n```\n\nAumentar o tamanho dos buffers de recebimento/envio e as bandeiras de otimização de soquete podem ser úteis para melhorar o rendimento. Recomenda-se testar cada bandeira separadamente, pois pode causar problemas em algumas redes:\n\n```\nsocket options = IPTOS_LOWDELAY TCP_NODELAY IPTOS_THROUGHPUT SO_RCVBUF=131072 SO_SNDBUF=131072\n```\n\n"
    },
    {
      "title": "Ativar acesso para dispositivos/clientes antigos",
      "level": 4,
      "content": "Últimas versões do Samba oferecem métodos de autenticação mais antigos e protocolos que continuam sendo usados por clientes antigos (câmeras de vigilância , etc). Estes dispositivos normalmente requerem que o servidor do Samba permita autenticação NTMLv1 e a versão do protocolo NT1, conhecida como CIFS. Para que estes dispositivos trabalhem com a última versão do Samba, você precisa adicionar estes dois parâmetros de configuração dentro da seção [global]:\n\n```\nserver min protocol = NT1\nntlm auth = yes\n```\n\nO acesso anônimo/convidado a um comopartilhamento requer apenas o primeiro parâmetro. Se o dispositivo antigo irá acessar com usuário e senha, você precisará também adicionar a segunda linha.\n\n"
    },
    {
      "title": "Ativar busca Spotlight",
      "level": 4,
      "content": "Spotlight permite que os clientes suportados (por exemplo, MacOS Finder) para rapidamente procurar por arquivos compartilhados.\n\nInstale e inicie/ative OpenSearch. Instale fs2es-indexerAUR, configure os diretórios que deseja que sejam indexados em /etc/fs2es-indexer/config.yml e inicie/ative fs2es-indexer.service para indexação periódica.\n\nEdite smb.conf como descrito na wiki do Samba para ativar Spotlight por compartilhamento, e reinicie smb.service para aplicar as alterações.\n\n"
    },
    {
      "title": "Cliente",
      "level": 2,
      "content": "Instale smbclient para uma interface de linha de comando ftp. Veja smbclient(1) para os comandos comumente usados.\n\nPara uma alternativa leve (sem suporte para listar ações públicas, etc.), instale cifs-utils que provê /usr/bin/mount.cifs.\n\nDependendo do ambiente desktop, métodos de interface gráfica estarão disponíveis. Veja #Configuração do gerenciador de arquivos para uso com um gerenciador de arquivos.\n\n- smbclient requer um arquivo /etc/samba/smb.conf (veja #Instalação), o qual você pode criar como um arquivo vazio usando o utilitário touch.\n- Após a instalação de cifs-utils ou smbclient, carregue o módulo do kernel cifs ou reinicie o sistema para prevenir falhas na montagem.\n\n"
    },
    {
      "title": "Listar compartilhamentos públicos",
      "level": 3,
      "content": "O seguinte comando lista compartilhamentos públicos em um servidor:\n\n```\n$ smbclient -L hostname -U%\n```\n\nAlternativamente, executar $ smbtree -N irá exibir um diagrama de árvore de todos os compartilhamentos. Ele usa consultas de transmissão e, portanto, não é aconselhável em uma rede com muitos computadores, mas pode ser útil para diagnosticar se você tiver o nome de compartilhamento correto. A opção -N (-no-pass) suprime a solicitação de senha.\n\n"
    },
    {
      "title": "Hostnames NetBIOS/WINS",
      "level": 3,
      "content": "Clientes Samba lidam com hostnames NetBIOS automaticamente por padrão (o comportamento é controlado pela opção name resolve order em smb.conf). Outros programas (incluindo mount.cifs) tipicamente usam Name Service Switch, o qual não lida com NetBIOS por padrão.\n\nO pacote smbclient fornece um controlador libnss para resolver hostnames NetBIOS. Para usa-lo, instale juntamente com o pacote samba (o qual fornece a daemon winbindd), inicie/ative winbind.service e adicione wins à linha hosts em nsswitch.conf(5):\n\n```\n/etc/nsswitch.conf\n```\n\n```\n...\nhosts: mymachines resolve [!UNAVAIL=return] files myhostname dns wins\n...\n```\n\nAgora, durante a resolução de host (por exemplo, ao usar mount.cifs ou simplesmente ping netbios-name), winbindd irá resolver o nome do host enviando consultas usando Serviço de Nomes NetBIOS (NBNS, também conhecido como protocolo WINS).\n\nPor padrão, ele envia uma consulta de transmissão para sua rede local. Caso tenha um servidor WINS, você poderá adicionar wins server = wins-server-ip ao smb.conf e reiniciar winbind.service, então winbindd e outros clientes Samba irão enviar consultas unicast para o IP especificado.\n\nSe desejar resolver sou nome de host local (especificado na opção netbios name em smb.conf), inicie/ative nmb.service, o qual lidará com as consultas recebidas.\n\nVocê pode testar a resolução WINS com nmblookup. Por padrão, ela transmite consultas para sua rede local independentemente da opção wins server.\n\nObserve que a resolução WINS exige tráfego de entrada oriundo da porta 137.\n\n"
    },
    {
      "title": "Desativar o suporte a NetBIOS/WINS",
      "level": 4,
      "content": "Quando não se usa resolução de nome de host NetBIOS/WINS, pode ser preferível desativar este protocolo:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  disable netbios = yes\n  dns proxy = no\n```\n\nFinalmente desative/pare winbind.service.\n\n"
    },
    {
      "title": "Montagem manual",
      "level": 3,
      "content": "Monte o compartilhamento usando mount.cifs como type. Nem todas as opções listadas abaixo são necessárias ou desejáveis:\n\n```\n# mount --mkdir -t cifs //SERVER/sharename /mnt/mountpoint -o username=username,password=password,workgroup=workgroup,iocharset=utf8,uid=username,gid=group\n```\n\nAs opções uid e gid correspondem ao local (por exemplo, cliente) usuário/grupo de usuários que terão acesso de leitura/gravação no caminho fornecido.\n\n- Caso uid e gid usados não equivalham ao usuário do servidor, as opções forceuid e forcegid poderão ser úteis. No entanto, observe que as permissões atribuídas a um arquivo quando forceuid ou forcegid que estão em vigor podem não refletir as permissões reais (do servidor). Veja a seção File And Directory Ownership And Permissions em mount.cifs(8) § FILE AND DIRECTORY OWNERSHIP AND PERMISSIONS para mais informações.\n- Para montar um compartilhamento Windows sem autenticação, use \"username=*\".\n\n- SERVER — O nome do servidor.\n- sharename — O diretório compartilhado.\n- mountpoint — O diretório local onde o compartilhamento será montado.\n- [-o options] — Veja mount.cifs(8) para mais informações.\n\nNote: **/** \n\n- Abstenha-se de usar uma / seguinte. //SERVER/sharename/ não irá funcionar.\n- Se sua montagem não ficar estável, com engasgos e travamentos, tente ativar uma versão diferente do protocolo SMB com a opção vers=. Por exemplo, vers=2.0 para uma montagem do Windows Vista.\n- Se estiver excedendo o tempo limite em um compartilhamento de rede montado com cifs em um desligamento, veja wpa_supplicant#Problem with mounted network shares (cifs) and shutdown.\n\n"
    },
    {
      "title": "Armazenando senhas de compartilhamentos",
      "level": 4,
      "content": "Armazenar senhas em um arquivo legível por todos não é recomendado. Um método mais seguro é usar um arquivo de credenciais, por exemplo, dentro de /etc/samba/credentials:\n\n```\n/etc/samba/credentials/share\n```\n\n```\nusername=myuser\npassword=mypass\n```\n\nPara o comando de montagem, substitua username=myuser,password=mypass por credentials=/etc/samba/credentials/share.\n\nO arquivo de credencial deve ser explicitamente legível/gravável por root:\n\n```\n# chown root:root /etc/samba/credentials\n# chmod 700 /etc/samba/credentials\n# chmod 600 /etc/samba/credentials/share\n```\n\n"
    },
    {
      "title": "Using NetworkManager and GIO/gvfs",
      "level": 4,
      "content": "NetworkManager pode ser configurado para executar um script quando ocorrerem alterações no status de rede do sistema. Este script usa o comando gio para que ele monte os compartilhamentos do Samba automaticamente, da mesma forma que seu gerenciador de arquivos faz, conforme explicado abaixo. O script também desmonta com segurança os compartilhamentos do Samba antes que a conexão de rede relevante seja desabilitada, ouvindo os eventos pre-down e vpn-pre-down. Torne o script executável executable após criá-lo.\n\n```\n/etc/NetworkManager/dispatcher.d/30-samba.sh\n```\n\n```\n#!/bin/sh\n\n# Find the connection UUID with \"nmcli con show\" in terminal.\n# All NetworkManager connection types are supported: wireless, VPN, wired...\nWANTED_CON_UUID=\"CHANGE-ME-NOW-9c7eff15-010a-4b1c-a786-9b4efa218ba9\"\n\n# The user the share will be mounted under\nUSER=\"yourusername\"\n# The path that appears in your file manager when you manually mount the share you want\nSMB_URL=\"smb://servername/share\"\n\n# Get runtime user directory. If it does not exist, do nothing and just exit\nXDG_RUNTIME_DIR=$(loginctl show-user --property=RuntimePath --value \"$USER\") || exit 0\n\nif [ \"$CONNECTION_UUID\" = \"$WANTED_CON_UUID\" ]; then\n    \n    # Script parameter $1: network interface name, not used\n    # Script parameter $2: dispatched event\n    \n    case \"$2\" in\n        \"up\"|\"vpn-up\")\n            su $USER -c \"DBUS_SESSION_BUS_ADDRESS=unix:path=$XDG_RUNTIME_DIR/bus gio mount $SMB_URL\"\n            ;;\n        \"pre-down\"|\"vpn-pre-down\")\n            su $USER -c \"DBUS_SESSION_BUS_ADDRESS=unix:path=$XDG_RUNTIME_DIR/bus gio mount -uf $SMB_URL\"\n            ;;\n    esac\nfi\n```\n\nCria um link simbólico dentro de /etc/NetworkManager/dispatcher.d/pre-down para capturar os eventos pre-down:\n\n```\n# ln -s /etc/NetworkManager/dispatcher.d/30-samba.sh /etc/NetworkManager/dispatcher.d/pre-down.d/30-samba.sh\n```\n\n"
    },
    {
      "title": "Como uma entrada de montagem",
      "level": 4,
      "content": "Este á um simples exemplo de uma entrada de montagem no fstab do tipo cifs que requer autenticação:\n\n```\n/etc/fstab\n```\n\n```\n//SERVER/sharename /mnt/mountpoint cifs _netdev,nofail,username=myuser,password=mypass 0 0\n```\n\nNote: **s** \n\n- Espaços no nome do compartilhamento deverão ser substituídos por \\040 (código ASCII para espaços, em octal). Por exemplo, //SERVER/nome do compartilhamento na linha de comando deve ser //SERVER/nome\\040do\\040compartilhamento em /etc/fstab.\n- Para permitir que os usuários o montem desde que o ponto de montagem resida em um diretório controlado pelo usuário; ou seja, dentro do diretório home, acrescente a opção de montagem users. A opção é users (no plural). Para outros tipos de sistema de arquivos manipulados pelo mount, esta opção geralmente é user; sem o \"s\".\n\n"
    },
    {
      "title": "Como unit do systemd",
      "level": 4,
      "content": "Crie um novo arquivo .mount dentro de /etc/systemd/system, por exemplo mnt-myshare.mount. Veja systemd.mount(5) para detalhes.\n\nWhat= caminho para o compartilhamento\n\nWhere= caminho para montar o compartilhamento\n\nOptions= opções de montagem do compartilhamento\n\n- Unidades de montagem em rede adquirem automaticamente dependências After em remote-fs-pre.target, network.target e network-online.target, e ganham uma dependência Before em remote-fs.target, a menos que a opção de montagem nofail esteja definida. Para este último, uma unidade Wants é adicionada também.\n- Acrescente noauto em Options para impedir a montagem automática durante a inicialização (a menos que seja puxado por alguma outra unidade).\n- Caso queira usar um nome de host para o servidor que deseja compartilhar (em vez de um endereço IP), adicione nss-lookup.target a After. Isso pode evitar erros de montagem no momento da inicialização que não surgem ao testar a unidade.\n\n```\n/etc/systemd/system/mnt-myshare.mount\n```\n\n```\n[Unit]\nDescription=Mount Share at boot\n\n[Mount]\nWhat=//server/share\nWhere=/mnt/myshare\nOptions=_netdev,credentials=/etc/samba/credentials/myshare,iocharset=utf8,rw\nType=cifs\nTimeoutSec=30\n\n[Install]\nWantedBy=multi-user.target\n```\n\n- Caso o sistema fique inalcançável, acrescente ForceUnmount=true em [Mount], permitendo que a montagem seja forçada.\n- Se seu compartilhamento tiver grupos com acesso somente leitura, acrescente uid=username ou gid=group em Options=, para especificar seu usuário/grupo permitindo escrita no compartilhamento.\n\nPara usar mnt-myshare.mount, inicie a unit e ative a mesma para que execute durante a inicialização do sistema.\n\nPara automaticamente montar um compartilhamento (quando acessado, como autofs), uma maneira é usar a seguinte unit de de montagem automática:\n\n```\n/etc/systemd/system/mnt-myshare.automount\n```\n\n```\n[Unit]\nDescription=Automount myshare\n\n[Automount]\nWhere=/mnt/myshare\n\n[Install]\nWantedBy=multi-user.target\n```\n\nDesative/pare a unit mnt-myshare.mount e ative/inicie mnt-myshare.automount para montagem automática do compartilhamento quando o caminho de montagem estiver sendo acessado.\n\n"
    },
    {
      "title": "smbnetfs",
      "level": 4,
      "content": "Primeiro, verifique se você consegue visualizar todos os compartilhamentos que você está interessado em montar:\n\n```\n$ smbtree -U remote_user\n```\n\nSe isso não funcionar, localize e modifique apropriadamente a seguinte linha em /etc/samba/smb.conf:\n\n```\ndomain master = auto\n```\n\nAgora reinicie smb.service e nmb.service.\n\nSe tudo funcionar como esperado, instale smbnetfs.\n\nEntão, adicione a seguinte linha ao /etc/fuse.conf:\n\n```\nuser_allow_other\n```\n\nAgora copie o diretório /etc/smbnetfs/.smb para o seu diretório home:\n\n```\n$ cp -a /etc/smbnetfs/.smb ~\n```\n\nEntão crie um link para smb.conf:\n\n```\n$ ln -sf /etc/samba/smb.conf ~/.smb/smb.conf\n```\n\nCaso um usuário e senha sejam solicitados para acessar alguma das pastas do compartilhamento, edite ~/.smb/smbnetfs.auth para incluir uma ou mais entradas, assim:\n\n```\n~/.smb/smbnetfs.auth\n```\n\n```\nauth\t\t\t\"hostname\" \"username\" \"password\"\n```\n\nTambém é possível adicionar entradas para hosts específicos a serem montados pelo smbnetfs, se necessário. Mais detalhes podem ser encontrados em ~/.smb/smbnetfs.conf.\n\nSe estiver usando Dolphin ou GNOME Files, talvez queira adicionar o seguinte ao ~/.smb/smbnetfs.conf para evitar erros \"disco cheio\" já que smbnetfs por padrão relatará 0 bytes de espaço livre:\n\n```\n~/.smb/smbnetfs.conf\n```\n\n```\nfree_space_size 1073741824\n```\n\nAo terminar a configuração, será necessário executar\n\n```\n$ chmod 600 ~/.smb/smbnetfs.*\n```\n\nCaso contrário, smbnetfs reclamará de 'permissões de arquivo de configuração inseguras'.\n\nFinalmente, para montar sua vizinhança de rede Samba em um diretório de sua escolha, chame\n\n```\n$ smbnetfs mount_point\n```\n\nO pacote Arch Linux também mantém um modo de operação adicional em todo o sistema para smbnetfs. Para habilitá-lo, você precisa fazer as referidas modificações no diretório /etc/smbnetfs/.smb.\n\nEntão, você podera iniciar/ativar a daemon smbnetfs como o usual. O ponto de montagem de todo o sistema está em /mnt/smbnet/.\n\n"
    },
    {
      "title": "autofs",
      "level": 4,
      "content": "Veja Autofs para informações sobre montagem automática baseada em kernel para Linux.\n\n"
    },
    {
      "title": "GNOME Files, Nemo, Caja, Thunar e PCManFM",
      "level": 4,
      "content": "Para acessar compartilhamentos samba pelos gerenciadores de arquivos GNOME Files, Nemo, Caja, Thunar ou PCManFM, instale o pacote gvfs-smb.\n\nPressione Ctrl+l e insira smb://nome_do_servidor/compartilhamento na barra de locais para acessar seu compartilhamento.\n\nO compartilhamento montado estará provavelmente em /run/user/seu_UID/gvfs ou ~/.gvfs no sistema de arquivos.\n\n"
    },
    {
      "title": "KDE",
      "level": 4,
      "content": "Aplicações do KDE (como Dolphin) tem a capacidade de navegar por compartilhamentos do Samba embutida. Use o caminho smb://nome_do_servidor/compartilhamento para navegar pelos arquivos. Caso deseje acessar arquivos por uma aplicação que não seja do KDE, você pode instalar kio-fuse.\n\nPara usar uma interface gráfica nas Configurações do Sistema KDE, você precisará instalar o pacote kdenetwork-filesharing.\n\n"
    },
    {
      "title": "Outros ambientes gráficos",
      "level": 4,
      "content": "Existem vários programas úteis, mas eles podem precisar ter pacotes criados para eles. Isso pode ser feito com o sistema de compilação do pacote Arch. Uma vantagem desses outros é que eles não exigem que um ambiente específico seja instalado para suportá-los e, portanto, trazem menos bagagem.\n\n- pyneighborhoodAUR\n- LinNeighborhood, RUmba, xffm-samba plugin para Xffm não estão disponíveis nos repositórios oficiais ou no AUR. Como eles não são oficialmente (nem mesmo extraoficialmente suportados), eles podem estar obsoletos e poderão sequer funcionar.\n\n"
    },
    {
      "title": "Descobrindo compartilhamentos de rede",
      "level": 3,
      "content": "Se nada for conhecido sobre outros sistemas na rede local e ferramentas automatizadas como smbnetfs não estiverem disponíveis, você poderá investigar manualmente os compartilhamentos do Samba.\n\nPrimeiro, instale os pacotes nmap e smbclient.\n\nUse nmap para varrer sua rede local para encontrar sistemas com a porta TCP 445 aberta, que é a porta usada pelo protocolo SMB. Observe que talvez seja necessário usar -Pn ou definir um tipo de varredura ping personalizada (por exemplo, -PS445) porque sistemas Windows são geralmente protegidos por firewall.\n\n```\n$ nmap -p 445 \"192.168.1.*\"\n```\n\n```\nStarting Nmap 7.92 ( https://nmap.org ) at 2022-03-13 12:00 UTC\nNmap scan report for 192.168.1.1\nHost is up (0.0011s latency).\n\nPORT    STATE  SERVICE\n445/tcp open  microsoft-ds\n\nNmap scan report for 192.168.1.2\nHost is up (0.00011s latency).\n\nPORT    STATE SERVICE\n445/tcp open  microsoft-ds\n\nNmap done: 256 IP addresses (2 hosts up) scanned in 2.45 seconds\n```\n\nO primeiro resultado é o outro sistema; o segundo é o cliente de onde esta verificação foi realizada.\n\nAgora você pode se conectar a esses endereços IP diretamente, mas se quiser usar nomes de host NetBIOS, você pode usar nmblookup(1) para verificar os nomes NetBIOS. Observe que isso não funcionará se o NetBIOS estiver desabilitado no servidor.\n\n```\n$ nmblookup -A 192.168.1.1\n```\n\n```\nLooking up status of 192.168.1.1\n        PUTER           <00> -         B <ACTIVE>\n        HOMENET         <00> - <GROUP> B <ACTIVE>\n        PUTER           <03> -         B <ACTIVE>\n        PUTER           <20> -         B <ACTIVE>\n        HOMENET         <1e> - <GROUP> B <ACTIVE>\n        USERNAME        <03> -         B <ACTIVE>\n        HOMENET         <1d> -         B <ACTIVE>\n        MSBROWSE        <01> - <GROUP> B <ACTIVE>\n```\n\nIndependentemente da saída, obser em <20>, que corresponde ao host com serviços abertos.\n\nUse smbclient(1) para listar quais serviços são compartilhados nesses sistemas. Você pode usar o nome do host NetBIOS (PUTER neste exemplo) em vez do IP quando disponível. Se for solicitada uma senha, pressionar enter ainda deve exibir a lista:\n\n```\n$ smbclient -L \\\\192.168.1.1\n```\n\n```\nSharename       Type      Comment\n---------       ----      -------\nMY_MUSIC        Disk\nSHAREDDOCS      Disk\nPRINTER$        Disk\nPRINTER         Printer\nIPC$            IPC       Remote Inter Process Communication\n\nServer               Comment\n---------            -------\nPUTER\n\nWorkgroup            Master\n---------            -------\nHOMENET               PUTER\n```\n\n"
    },
    {
      "title": "Controle remoto de um computador Windows",
      "level": 3,
      "content": "Samba oferece uma coletânea de ferramentas para comunicação com Windows. Isso pode ser útil se o acesso a um computador Windows por meio da área de trabalho remota não for uma opção, como mostrado em alguns exemplos.\n\nEnviar o comando shutdown com comentário:\n\n```\n$ net rpc shutdown -C \"comment\" -I IPADDRESS -U USERNAME%PASSWORD\n```\n\nEm vez disso, um desligamento forçado pode ser invocado alterando -C com comentário por um simples -f. Para um reinício, somente adicione -r, seguida de um -C ou -f.\n\nParar e reiniciar serviços:\n\n```\n$ net rpc service stop SERVICENAME -I IPADDRESS -U USERNAME%PASSWORD\n```\n\nPara ver todos os possíveis comandos da gama net rpc:\n\n```\n$ net rpc\n```\n\n"
    },
    {
      "title": "Falha ao iniciar o servidor Samba SMB/CIFS",
      "level": 3,
      "content": "Possíveis soluções:\n\n- Verifique erros de sintaxe no arquivo smb.conf com testparm(1).\n- Defina permissões corretas para /var/cache/samba/ e reinicie smb.service:\n\n```\n# chmod 0755 /var/cache/samba/msg\n```\n\n"
    },
    {
      "title": "Problemas de permissão com SELinux",
      "level": 3,
      "content": "SELinux não permite que o samba acesse os diretórios pessoais do usuário por padrão, para resolver isso, execute:\n\n```\n# setsebool -P samba_enable_home_dirs 1\n```\n\nSimilarmente, samba_export_all_ro e samba_export_all_rw fazem com que Samba seja capaz de ler ou \"ler e gravar\" todos os arquivos.\n\n"
    },
    {
      "title": "Problemas de permissão com AppArmor",
      "level": 3,
      "content": "Se estiver usando um caminho de compartilhamento localizado fora de um diretório home ou de compartilhamentos do usuário, coloque-o na lista de permissões em /etc/apparmor.d/local/usr.sbin.smbd. Por exemplo:\n\n```\n/etc/apparmor.d/local/usr.sbin.smbd\n```\n\n```\n\"/data/\" rk,\n\"/data/**\" lrwk,\n```\n\n"
    },
    {
      "title": "Dialeto não especificado na montagem",
      "level": 3,
      "content": "O cliente está usando uma versão não suportada do SMB/CIFS que é requerida pelo servidor.\n\nVeja #Restringir protocolos para maior segurança para mais informações.\n\n"
    },
    {
      "title": "Impossível sobrescrever arquivos, erros de permissão",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nPossíveis soluções:\n\n- Acrescente a opção de montagem nodfs à entrada no /etc/fstab.\n- Adicione msdfs root = no à seção [global] do /etc/samba/smb.conf, no servidor.\n\n"
    },
    {
      "title": "Os clientes Windows continuam pedindo senha mesmo quando os compartilhamentos do Samba são criados com permissões de convidado",
      "level": 3,
      "content": "Defina map to guest dentro da seção global de /etc/samba/smb.conf:\n\n```\nmap to guest = Bad Password\n```\n\nSe estiver usando Samba inferior a 4.10.10, use Bad User em vez de Bad Password.\n\n"
    },
    {
      "title": "Problemas de conectividade com Windows 7 - mount error(12): cannot allocate memory",
      "level": 3,
      "content": "Um bug conhecido do Windows 7 que causa \"mount error(12): cannot allocate memory\" em um compartilhamento cifs perfeito no Linux, no fim das contas pode ser corrigido definindo algumas chaves de registro na caixa do Windows da seguinte maneira:\n\n- HKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Memory Management\\LargeSystemCache (set to 1)\n- HKLM\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters\\Size (set to 3)\n\nComo alternativa, inicie o prompt de comando no modo administrador e execute o seguinte:\n\n```\nreg add \"HKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Memory Management\" /v \"LargeSystemCache\" /t REG_DWORD /d 1 /f\nreg add \"HKLM\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters\" /v \"Size\" /t REG_DWORD /d 3 /f\n```\n\nSiga um destes procedimentos para que as configurações tenham efeito:\n\n- Reinicie o Windows\n- Reinicie o serviço de servidor via services.msc\n- A partir de um prompt de comando, execute: 'net stop lanmanserver' e 'net start lanmanserver' - O servidor irá reiniciar automaticamente depois de pará-lo.\n\nArtigo original.\n\n"
    },
    {
      "title": "Problemas de conectividade com Windows 10 1709 e superiores - \"Windows cannot access\" 0x80004005",
      "level": 3,
      "content": "Este erro afeta algumas máquinas que executam o Windows 10 versão 1709 e posterior. Não está relacionado à desativação do SMB1 nesta versão, mas ao fato de a Microsoft desabilitar logons inseguros para convidados nesta versão para alguns, mas não para outros.\n\nPara corrigir, abra o editor de Diretivas de Grupo (gpedit.msc). Navegue até Configuração do computador\\modelos administrativos\\rede\\Estação de trabalho Lanman > Habilitar logons de convidados inseguros e habilite-o. Como alternativa, altere o seguinte valor no registro:\n\n```\n[HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\LanmanWorkstation\\Parameters]\n\"AllowInsecureGuestAuth\"=dword:1\n```\n\n"
    },
    {
      "title": "Erro: Failed to retrieve printer list: NT_STATUS_UNSUCCESSFUL",
      "level": 3,
      "content": "Se você é um usuário doméstico e usa o samba apenas para compartilhamento de arquivos de um servidor ou NAS, provavelmente não está interessado em compartilhar impressoras por meio dele. Nesse caso, você pode evitar que esse erro ocorra adicionando as seguintes linhas ao seu /etc/samba/smb.conf:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  load printers = No\n  printing = bsd\n  printcap name = /dev/null\n  disable spoolss = Yes\n```\n\nReinicie o serviço do samba, smb.service, e então verifique os logs:\n\n```\n# cat /var/log/samba/smbd.log\n```\n\ne o erro não deverá mais estar aparecendo.\n\n"
    },
    {
      "title": "Falha ao compartilhar uma pasta",
      "level": 3,
      "content": "Isso significa que enquanto você está compartilhando uma pasta do Dolphin (gerenciador de arquivos) e tudo parece bem no início, depois de reiniciar o Dolphin o ícone de compartilhamento desapareceu da pasta compartilhada, e também algumas saídas como esta do terminal (Konsole):\n\n```\n‘net usershare’ returned error 255: net usershare: usershares are currently disabled\n```\n\nPara corrigir isto, ative o compartilhamento do usuário conforme descrito em #Ativar compartilhamentos de usuário.\n\n"
    },
    {
      "title": "\"Nevagação\" da rede falha com \"Failed to retrieve share list from server\"",
      "level": 3,
      "content": "E você está usando um firewall (iptables) porque não confia na sua rede local (escola, universidade, hotel). Isso pode ser devido ao seguinte: Quando o smbclient está navegando na rede local, ele envia uma solicitação de transmissão na porta udp 137. Os servidores na rede respondem ao seu cliente, mas como o endereço de origem desta resposta é diferente do destino endereço que o iptables viu ao enviar a solicitação para a listagem, o iptables não reconhecerá a resposta como \"ESTABLISHED\" ou \"RELATED\" e, portanto, o pacote será descartado. Uma possível solução é adicionar:\n\n```\niptables -t raw -A OUTPUT -p udp -m udp --dport 137 -j CT --helper netbios-ns\n```\n\nàs definições de seu iptables.\n\nPara Uncomplicated Firewall, será preciso adicionar nf_conntrack_netbios_ns ao final da seguinte linha em /etc/default/ufw\n\n```\nIPT_MODULES=\"nf_conntrack_ftp nf_nat_ftp nf_conntrack_irc nf_nat_irc\"\n```\n\ne então executar o seguinte comando como root:\n\n```\necho 1 > /proc/sys/net/netfilter/nf_conntrack_helper\nufw allow CIFS\nufw reload\n```\n\nPara tornar esta alteração persistente às reinicializações, adicione a seguinte linha ao final de /etc/ufw/sysctl.conf:\n\n```\nnet.netfilter.nf_conntrack_helper=1\n```\n\n"
    },
    {
      "title": "Protocolo de negociação falhou: NT_STATUS_INVALID_NETWORK_RESPONSE",
      "level": 3,
      "content": "O cliente provavelmente não tem acesso a compartilhamentos. Certifique-se de que o endereço IP dos clientes esteja na linha hosts allow = em /etc/samba/smb.conf.\n\nUm outro problema pode ser o fato de que o cliente usa uma versão de protocolo inválida. Para verificar isso, tente conectar com o smbclient onde você especifica a versão máxima do protocolo manualmente:\n\n```\n$ smbclient -U <user name> -L //<server name> -m <protocol version: e. g. SMB2> -W <domain name>\n```\n\nSe o comando foi bem-sucedido, crie um arquivo de configuração:\n\n```\n~/.smb/smb.conf\n```\n\n```\n[global]\n  workgroup = <domain name>\n  client max protocol = SMB2\n```\n\n"
    },
    {
      "title": "Falha na conexão com o servidor: (Erro NT_STATUS_UNSUCCESSFUL)",
      "level": 3,
      "content": "Você provavelmente está passando um nome de servidor errado para smbclient. Para descobrir o nome do servidor, execute hostnamectl no servidor e veja a linha \"Transient hostname\"\n\n"
    },
    {
      "title": "Falha na conexão com o servidor: (Erro NT_STATUS_CONNECTION_REFUSED)",
      "level": 3,
      "content": "Certifique-se de que o servidor foi iniciado. Os diretórios compartilhados devem existir e ser acessíveis.\n\n"
    },
    {
      "title": "Falha com o protocolo de negociação: NT_STATUS_CONNECTION_RESET",
      "level": 3,
      "content": "Provavelmente o servidor está configurado para não aceitar o protocolo SMB1. Adicione a opção client max protocol = SMB2 em /etc/samba/smb.conf. Ou simplesmente passe o argumento -m SMB2 para smbclient.\n\n"
    },
    {
      "title": "Erro de senha quando as credenciais corretas são informadas (error 1326)",
      "level": 3,
      "content": "Samba 4.5 possui autenticação NTLMv1 desativada por padrão. É recomendável instalar as atualizações mais recentes disponíveis em clientes e negar acesso a clientes não suportados.\n\nSe você ainda precisar de suporte para clientes muito antigos sem suporte ao NTLMV2 (por exemplo, Windows XP), é possível forçar a ativação do NTLMV1, embora isso não seja recomendável, por razões de segurança:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  lanman auth = yes\n  ntlm auth = yes\n```\n\nSe os clientes NTLMV2 não conseguirem autenticar quando o NTLMV1 tiver sido ativado, crie o seguinte arquivo no cliente:\n\n```\n/home/user/.smb/smb.conf\n```\n\n```\n[global]\n  sec = ntlmv2\n  client ntlmv2 auth = yes\n```\n\nEsta mudança também afeta os compartilhamentos de samba montados com mount.cifs. Se após a atualização para o Samba 4.5 sua montagem falhar, adicione a opção sec=ntlmssp ao seu comando de montagem, por exemplo.\n\n```\nmount.cifs //server/share /mnt/point -o sec=ntlmssp,...\n```\n\nVeja a página de manual do mount.cifs(8): ntlmssp - Use o hash de senha NTLMv2 encapsulado como mensagem Raw NTLMSSP. O padrão nas versões principais do kernel anteriores à v3.8 era sec=ntlm. Na v3.8, o padrão foi alterado para sec=ntlmssp.\n\n"
    },
    {
      "title": "Mapeando com caracteres reservador do Windows",
      "level": 3,
      "content": "Iniciando com o kernel 3.18, o módulo cifs usa a opção \"mapposix\" por padrão. Ao montar um compartilhamento usando extensões unix e uma configuração padrão do Samba, arquivos e diretórios contendo um dos sete caracteres reservados do Windows : \\ * < > ? estão listados, mas não podem ser acessados.\n\nPossíveis soluções são:\n\n- Usar a não documentada opção de montagem nomapposix para cifs\n\n```\n# mount.cifs //server/share /mnt/point -o nomapposix\n```\n\n- Configurar o Samba para remapear o estilo de caracteres mapposix (\"SFM\", Services for Mac) para os nativos corretos usando fruit\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  vfs objects = catia fruit\n  fruit:encoding = native\n```\n\n- Manualmente remapear os caracteres proibidos usando catia\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\n  vfs objects = catia\n  catia:mappings = 0x22:0xf022, 0x2a:0xf02a, 0x2f:0xf02f, 0x3a:0xf03a, 0x3c:0xf03c, 0x3e:0xf03e, 0x3f:0xf03f, 0x5c:0xf05c, 0x7c:0xf07c, 0x20:0xf020\n```\n\nA última abordagem (usando catia ou fruit) tem a desvantagem de filtrar arquivos com caracteres não imprimíveis.\n\n"
    },
    {
      "title": "Pasta compartilhada dentro do ambiente gráfico não está disponível para convidados",
      "level": 3,
      "content": "Esta seção pressupõe:\n\n1. Compartilhamentos do usuário são configurados seguindo a seção anterior\n1. Uma pasta compartilhada foi criada como um usuário não root da interface gráfica\n1. O acesso de convidados foi definido para a pasta compartilhada durante a criação\n1. O serviço Samba foi reiniciado pelo menos uma vez desde a última modificação do arquivo /etc/samba/smb.conf\n\nApenas para fins de esclarecimento, nas seguintes subseções assume-se:\n\n- A pasta compartilhada está localizada dentro do caminho do diretório inicial do usuário (/home/yourUser/Shared)\n- O nome da pasta compartilhada é MySharedFiles\n- O acesso de convidado é somente leitura.\n- Os usuários do Windows acessarão o conteúdo da pasta compartilhada sem o prompt de login\n\n"
    },
    {
      "title": "Verifique a correta configuração do samba",
      "level": 4,
      "content": "Execute o seguinte comando em um terminal para testar a correção do arquivo de configuração:\n\n```\n$ testparm\n```\n\n"
    },
    {
      "title": "Verifique a criação correta da pasta compartilhada",
      "level": 4,
      "content": "Execute os seguintes comandos a partir de um terminal:\n\n```\n$ cd /var/lib/samba/usershare\n$ ls\n```\n\nSe tudo estiver bem, você notará um arquivo chamado mysharedfiles\n\nLeia o conteúdo do arquivo usando o seguinte comando:\n\n```\n$ cat mysharedfiles\n```\n\nA saída do terminal deve exibir algo assim:\n\n```\n/var/lib/samba/usershare/mysharedfiles\n```\n\n```\npath=/home/yourUser/Shared\ncomment=\nusershare_acl=S-1-1-0:r\nguest_ok=y\nsharename=MySharedFiles\n```\n\n"
    },
    {
      "title": "Verifique o acesso à pasta pelo convidado",
      "level": 4,
      "content": "Execute o seguinte comando a partir de um terminal. Se for solicitada uma senha, basta pressionar Enter:\n\n```\n$ smbclient -L localhost\n```\n\nSe tudo estiver bem, MySharedFiles deve ser exibido na coluna Sharename\n\nExecute o seguinte comando para acessar a pasta compartilhada como convidado (login anônimo)\n\n```\n$ smbclient -N //localhost/MySharedFiles\n```\n\nSe tudo estiver bem, o prompt do cliente samba será exibido:\n\n```\nsmb: \\>\n```\n\nNo prompt do samba, verifique se o convidado pode listar o conteúdo do diretório:\n\n```\nsmb: \\> ls\n```\n\nSe o erro NTFS_STATUS_ACCESS_DENIED for exibido, o problema provavelmente está nas permissões do diretório Unix. Certifique-se de que seu usuário do samba tenha acesso à pasta e a todas as pastas pai. Você pode testar isso usando sudo no usuário e tentar listar o diretório de montagem e todos os seus pais.\n\n"
    },
    {
      "title": "Mount error: Host is down",
      "level": 3,
      "content": "Este erro pode ser visto ao montar compartilhamentos de servidores Synology NAS. Use a opção de montagem vers=1.0 para resolvê-lo.\n\n"
    },
    {
      "title": "Software caused connection abort",
      "level": 3,
      "content": "Os gerenciadores de arquivos que utilizam gvfs-smb podem mostrar o erro Software caused connection abort ao gravar um arquivo em um compartilhamento/servidor. Isso pode ser devido ao servidor executando SMB/CIFS versão 1, que muitos roteadores usam para compartilhamento de unidade USB (por exemplo, roteadores Belkin). Para gravar nesses compartilhamentos, especifique a versão CIFS com a opção vers=1.0. Por exemplo:\n\n```\n/etc/fstab\n```\n\n```\n//SERVER/sharename /mnt/mountpoint cifs _netdev,guest,file_mode=0777,dir_mode=0777,vers=1.0 0 0\n```\n\nIsso também pode acontecer após atualizar o Samba para a versão 4.11, que desativa o SMB1 como padrão, e acessar qualquer compartilhamento do Samba. Você pode reativá-lo adicionando\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\nclient min protocol = CORE\n```\n\n"
    },
    {
      "title": "Problemas de conexão (devido a erros de autenticação)",
      "level": 3,
      "content": "Certifique-se de não deixar nenhum caractere de espaço antes de seu nome de usuário no arquivo de configuração do cliente Samba da seguinte forma:\n\n```\n~/.samba\n```\n\n```\nusername= user\npassword=pass\n```\n\nO formato correto é o seguinte:\n\n```\n~/.samba\n```\n\n```\nusername=user\npassword=pass\n```\n\n"
    },
    {
      "title": "Windows 1709 ou mais recente não mostra o servidor Samba na rede",
      "level": 3,
      "content": "Com o Windows 10 versão 1511, o suporte para SMBv1 e, portanto, a descoberta de dispositivos NetBIOS foi desabilitado por padrão. Dependendo da edição real, as versões posteriores do Windows a partir da versão 1709 (\"Fall Creators Update\") não permitem mais a instalação do cliente SMBv1. Isso faz com que os hosts que executam o Samba não sejam listados nas visualizações \"Rede (Vizinhança)\" do Explorer. Embora não haja problemas de conectividade e o Samba ainda funcione bem, os usuários podem querer que seus hosts Samba sejam listados pelo Windows automaticamente. wsdd implementa uma daemon de host do Web Service Discovery. Isso permite que hosts (Samba), como seu dispositivo NAS local, sejam encontrados por Clientes de Descoberta de Serviços da Web, como o Windows. As configurações padrão devem funcionar para a maioria das instalações, tudo o que você precisa fazer é ativar o wsdd.service.\n\nSe estiver com a configuração padrão, anunciar-se na rede com o nome do host da máquina no grupo \"WORKGROUP\" deve ser tudo o que você precisa na maioria dos casos. Caso seja necessário, você pode alterar as opções de configuração passando argumentos adicionais para wsdd adicionando-os em /etc/conf.d/wsdd (consulte a página de manual para wsdd para obter detalhes).\n\nwsdd2AUR faz a mesma coisa, mas é escrito em C em vez de Python. Por padrão, ele procurará os valores netbios name e workgroup em smb.conf.\n\n"
    },
    {
      "title": "Arquivos IOS não podem mais ser copiados para o compartilhamento Samba no Arch Linux começando com IOS 14.5",
      "level": 3,
      "content": "Começando com o IOS 14.5 tentando transferir de um dispositivo executando o IOS usando o aplicativo \"Files\" para um compartilhamento de samba no Arch Linux resultará no erro:\n\n```\nThe operation couldn't be completed\nOperation canceled\n```\n\nPara corrigir esse problema, adicione o seguinte à seção global do seu smb.conf e reinicie smb.service. Comentário opcional:\n\n```\n## addition for IOS Files transfer-to server\nvfs object = fruit streams_xattr\n```\n\nVeja https://apple.stackexchange.com/q/424681 Apple.Stackexchange.com - \"The operation couldn't be completed\"/\"Operation canceled\" error message when saving to a Samba share via Files app.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Official website\n- Samba: An Introduction\n- Samba 3.2.x HOWTO and Reference Guide (outdated but still most extensive documentation)\n- Wikipedia\n- Gentoo:Samba/Guide\n- Debian:Samba/ServerSimple\n- KSMBD[link inativo 2023-06-17 ⓘ] - A linux kernel server which implements SMB3 protocol in kernel space for sharing files over network.\n\n"
    }
  ]
}