{
  "title": "Sauvegarde des données avec BORG",
  "url": "https://wiki.archlinux.org/title/Sauvegarde_des_donn%C3%A9es_avec_BORG",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- System backup\n- Synchronization and backup programs\n\nBorgBackup (abrégé : Borg) est un programme de sauvegarde par déduplication. En option, il prend en charge la compression et le chiffrement authentifié.\n\nL'objectif principal de Borg est de fournir un moyen efficace et sûr de sauvegarder des données. La technique de déduplication des données utilisée rend Borg approprié pour les sauvegardes quotidiennes puisque seules les modifications sont stockées. La technique de chiffrement authentifié permet d'effectuer des sauvegardes vers des cibles qui ne sont pas entièrement fiables.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet borg. La version de développement est disponible avec borg-gitAUR.\n\nPour des fonctionnalités supplémentaires, installez les paquets suivants :\n\n"
    },
    {
      "title": "Documentation",
      "level": 2,
      "content": "La documentation officielle propose un guide de démarrage. En supplément des exemples fournis dans ces liens, consultez également borg(1) et apropos borg.\n\nUne aide est aussi disponible par les commandes, soit générale :\n\n```\n$ borg help\n```\n\nsoit circonstanciée :\n\n```\n$ borg help command\n```\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "Le concept principal sur lequel se fonde Borg est la dé-duplication : plutôt qu'accumuler les fichiers comme dans l'archivage classique par TAR, la dé-duplication vérifie par hashage l'identité des fichiers, quels que soient leurs noms, pour ne les copier qu'une fois. Elle occupe ainsi, même sans compression, une place minimale pour des sauvegardes incrémentales répétées.\n\nLa compression des fichiers est facultative et prend en charge plusieurs algorithmes (zstd est recommandé) et intensités.\n\nLes archives créées avec Borg peuvent être montées comme des systèmes de fichiers avec FUSE pour parcourir et restaurer des fichiers individuels.\n\nLes archives peuvent être créées localement, ou sur des systèmes distants en utilisant SSHFS, NFS, Samba, ou des solutions de montage similaires. Le transfert via SSH est pris en charge, mais l'hôte distant doit avoir Borg disponible.\n\n"
    },
    {
      "title": "Création de dépôts",
      "level": 3,
      "content": "Les dépôts Borg peuvent être chiffrés ou rendus inviolables. Pour plus d'informations sur les modes et les options, consultez la documentation officielle sur la configuration d'un dépôt.\n\nPour créer un dépôt Borg sans chiffrement ou authentification :\n\n```\n$ borg init --encryption=none /path/to/repo\n```\n\n"
    },
    {
      "title": "Création d'archives",
      "level": 3,
      "content": "Des instances d'archives individuelles peuvent être créées dans le dépôt avec la commande borg create. Un nom unique doit être attribué à chaque archive. Borg inclut une liste de noms génériques pour faciliter l'ajout de chaînes telles que des dates, des heures, des noms d'utilisateur et des noms d'hôte.\n\nPour créer une archive du répertoire archivable-dir avec le nom d'hôte de la machine source et la date du jour :\n\n```\n$ borg create /path/to/repo::{hostname}-{now:%Y-%m-%d} archivable-dir\n```\n\nBorg prend en charge de nombreuses options d'inclusion et d'exclusion. Pour exclure les fichiers .pyc de l'archive :\n\n```\n$ borg create ... --exclude '*.pyc' /path/to/repo::archive-name\n```\n\nPlus d'informations peuvent être trouvées sur la page de documentation de borg create.\n\n"
    },
    {
      "title": "Élagage des archives",
      "level": 3,
      "content": "La suppression des anciennes archives ne se fait pas automatiquement, mais peut être effectuée manuellement avec la commande borg prune. Le nombre d'archives à conserver doit être spécifié, et peut être limité par l'heure de création de l'archive.\n\nPour conserver uniquement les 7 dernières archives quotidiennes, les quatre dernières archives hebdomadaires et les trois dernières archives mensuelles :\n\n```\n$ borg prune --keep-daily=7 --keep-weekly=4 --keep-monthly=3 /path/to/repo\n```\n\nPour ne conserver que les 10 dernières archives, quelle que soit leur date de création :\n\n```\n$ borg prune --keep-last=10 /path/to/repo\n```\n\nPour conserver toutes les archives des 30 derniers jours, quel que soit le nombre d'archives qu'elles contiennent :\n\n```\n$ borg prune --keep-within=30d /path/to/repo\n```\n\nPlus d'informations sont disponibles sur la page de documentation de borg prune.\n\n"
    },
    {
      "title": "Restauration à partir d'une archive",
      "level": 3,
      "content": "Pour restaurer à partir d'une archive :\n\n```\n$ borg extract /path/to/repo::archive-name' path/to/restore\n```\n\nAlternativement, un dép peut être monté pour une restauration interactive :\n\n```\n$ borg mount /path/to/repo::archive-name::::: :.\n```\n\n"
    },
    {
      "title": "Exclusions des caches",
      "level": 3,
      "content": "La taille des archives peut être réduite en excluant les répertoires de cache. Les répertoires qui adhèrent à la Cache Directory Archiving Standard peuvent être automatiquement exclus en ajoutant --exclude-caches à la commande de création d'archives :\n\n```\n$ borg create ... --exclude-caches /path/to/repo::nom-de-l'archive\n```\n\n"
    },
    {
      "title": "Lister les fichiers affectés",
      "level": 3,
      "content": "De nombreuses opérations dans Borg supportent l'indicateur --list pour lister les fichiers ou archives affectés. S'il est associé à --dry-run, l'utilisateur peut vérifier les effets d'une commande donnée.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Documentation officielle (en)\n\n"
    }
  ]
}