{
  "title": "Scribus (Español)",
  "url": "https://wiki.archlinux.org/title/Scribus_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\n"
    },
    {
      "title": "Lectores de documentos",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: List of PDF software.\n\n"
    },
    {
      "title": "Consola",
      "level": 4,
      "content": "- fbdjvu — Visor similar a DjVu para fbpdf.\n\n- fbpdf — Pequeño visor de PDF framebuffer basado en MuPDF, con teclas de atajo para Vim y escrito en C.\n\n- jfbview — Visor de imagen y PDF framebuffer. Las características incluyen controles al estilo Vim, zoom, un visor TOC (outline), rápido renderizado multihilo y precaché asíncrono.\n\n"
    },
    {
      "title": "Interfaz gráfica",
      "level": 4,
      "content": "- apvlv — Visor ligero de PDF/DjVu/UMD/TXT con teclas de atajo para Vim.\n\n- Chrome — Navegador web con un visor PDF integrado.\n\n- ePDFView — Visor de documentos PDF ligero que usa las bibliotecas Poppler y GTK+. Desarrollo detenido.\n\n- Evince — Visor de documentos para múltiples formatos de documentos. Soporta PDF, PostScript, DjVu, TIFF y DVI.\n\n- Firefox — Navegador web de código abierto con un visor de PDF integrado.\n\n- Foxit Reader — Pequeño y rápido (comparado con Acrobat) visor PDF. (Código cerrado).\n\n- llpp — Lector de PDF muy rápido basado en MuPDF, que admite el desplazamiento continuo de la página, marcadores y búsqueda de texto a través de todo el documento.\n\n- MuPDF — Muy rápido visor de PDF y XPS, con un conjunto de herramientas escritas en C. Las características incluyen soporte para fuentes CJK.\n\n- Okular — Potente visualizador de KDE.\n\n- qpdfview — Visor de PDF con pestañas, que usa las bibliotecas Poppler y Qt.\n\n- Xournal — Aplicación para visualizar PDF y tomar notas.\n\n- Xpdf — Visor que puede decodificar LZW y leer archivos PDF encriptados.\n\n- zathura — Visor ComicBook altamente personalizable y funcional (basado en plugin) para PDF/DjVu/PostScript/ComicBook.\n\nVéase el artículo de Wikipedia sobre este asunto para obtener más información: CHM.\n\n- GnoCHM — Visor CHM pensado para integrarse con GNOME, basado en pychm.\n\n- Kchmviewer — Visor CHM basado en Qt que utiliza chmlib y toma algunas ideas de xCHM. Independiente de KDE, pero puede ser compilado para integrarse en él.\n\n- xCHM — Ligero visor CHM, basado en chmlib.\n\n"
    },
    {
      "title": "Suites de ofimática",
      "level": 3,
      "content": "Véanse los artículos de Wikipedia sobre este asunto para obtener más información: Comparison of office suites, MPlayer frontends y mpv.\n\n- Calligra — Fork de KOffice desarrollado activamente, la suite de ofimática de KDE. Soporta la mayoría de las características de OpenOffice al tiempo que ofrece también versiones para smartphones (Calligra Mobile) y tabletas (Calligra Activo).\n\n- LibreOffice — Fork de OpenOffice desarrollado muy activamente.\n\n- OpenOffice — Suite de programas de ofimática de código abierto con procesador de textos, hojas de cálculo, presentaciones, gráficas, bases de datos y más, distribuido bajo licencia Apache.\n\n"
    },
    {
      "title": "Indexadores",
      "level": 3,
      "content": "Véanse los artículos de Wikipedia sobre este asunto para obtener más información: Indexación y List of search engines#Desktop search engines.\n\n- Recoll — Completa herramienta de búsqueda de textos que utiliza el backend Xapian.\n\n- Strigi — Motor de búsqueda de rápido rastreo en el escritorio, con una interfaz gráfica Qt.\n\n- Tracker — Indexador todo en uno, herramienta de búsqueda y base de datos de metadatos.\n\n"
    },
    {
      "title": "Procesadores de texto",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of word processors.\n\n- Abiword — Procesador de texto completo.\n\n- Calligra Words — Potente procesador de textos incluido en la suite Calligra.\n\n- gLabels — Programa para crear etiquetas y tarjetas de visita.\n\n- LibreOffice Writer — Procesador de texto con todas las funciones, incluido en la suite LibreOffice.\n\n- Markdown — Herramienta de conversión de texto a HTML que permite escribir usando un sencillo formato de texto plano.\n\n- OpenOffice Writer — Procesador de texto con todas las funciones, incluido en la suite OpenOffice.\n\n- Pandoc — Navaja suiza para convertir de un formato de marcadores en otro (compatibles con Markdown).\n\n- Scribus — Programa de autoedición.\n\n- Ted — Procesador de texto bajado en GTK+, mejorado y fácil de usar (con soporte para notas a pie de página).\n\n- txt2tags — Un simplisimo, KISS-compliant, ligero lenguaje de macado para la creación de contenido en formato de archivos de texto plano.\n\n"
    },
    {
      "title": "Hojas de cálculo",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of spreadsheet software.\n\n- Calligra Sheets — Poderosa hoja de cálculo incluida en la suite Calligra.\n\n- Gnumeric — Programa de hoja de cálculo que forma parte del escritorio GNOME .\n\n- LibreOffice Calc — Hoja de cálculo con todas las funciones incluida en la suite LibreOffice.\n\n- OpenOffice Calc — Hoja de cálculo con todas las funciones incluida en la suite OpenOffice.\n\n- sc-im — Planilla de cálculo con interfaz basada en ncurses. Fork de sc.\n\n"
    },
    {
      "title": "Documentos científicos",
      "level": 3,
      "content": "Con LaTeX, la creación de cualquier documento científico, artículo, diario, etc. está a la orden del día.\n\nVéase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of TeX editors.\n\n- AUCTeX — Paquete con extensiones para escribir y formatear archivos TeX en Emacs.\n\n- Gummi — Editor TeX/LaTeX ligero, basado en GTK+.\n\n- Kile — Editor TeX/LaTeX amigable, para el escritorio KDE, con muchas características.\n\n- LyX — Procesador de documentos que fomenta un acercamiento a la escritura basada en la estructura del propio documentos (WYSIWYM) y no simplemente a su aspecto (WYSIWYG).\n\n- TeXmacs — Plataforma de edición de WYSIWYW con especiales características para científicos.\n\n- Texmaker — Multiplataforma de edición LaTeX IDE, ligero y fácil de usar.\n\n"
    },
    {
      "title": "Software de reconocimiento óptico de caracteres (siglas en inglés OCR)",
      "level": 3,
      "content": "Véase el artículo de Wikipedia sobre este asunto para obtener más información: Comparison of optical character recognition software.\n\nVéase el artículo de ArchWiki sobre este asunto para obtener más información: Optical Character Recognition#OCR software.\n\n"
    }
  ]
}