{
  "title": "SDDM (Français)",
  "url": "https://wiki.archlinux.org/title/SDDM_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Display manager (Français)\n- KDE (Français)\n\nLe Simple Desktop Display Manager (SDDM) est un gestionnaire d'affichage. Il est recommandé pour les environnements de bureau KDE Plasma et LXQt.\n\nSelon Wikipedia:Simple Desktop Display Manager :\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet sddm. En option, installez sddm-kcm pour le KConfig Module.\n\nSuivez Display manager (Français)#Chargement du gestionnaire d'affichage pour lancer SDDM au démarrage.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Le fichier de configuration par défaut pour SDDM est /usr/lib/sddm/sddm.conf.d/default.conf. Pour toute modification, créez un ou plusieurs fichiers de configuration dans /etc/sddm.conf.d/. Consultez sddm.conf(5) pour toutes les options.\n\nLe paquet sddm-kcm (inclus dans le groupe plasma) fournit une interface graphique pour configurer SDDM dans les paramètres système de Plasma. Il y a également une sddm-config-editor-gitAUR[broken link: package not found] basée sur Qt disponible dans l'AUR.\n\nTout devrait fonctionner dès le départ, car Arch Linux utilise systemd et SDDM utilise par défaut systemd-logind pour la gestion des sessions.\n\n"
    },
    {
      "title": "Autologin",
      "level": 3,
      "content": "SDDM prend en charge la connexion automatique via son fichier de configuration, par exemple :\n\n```\n/etc/sddm.conf.d/autologin.conf\n```\n\n```\n[Autologin]\nUser=john\nSession=plasma\n```\n\nCette configuration permet de démarrer une session KDE Plasma pour l'utilisateur john au démarrage du système. Les types de session disponibles se trouvent dans /usr/share/xsessions/ pour X et dans /usr/share/wayland-sessions/ pour Wayland.\n\nUne option permettant de se connecter automatiquement à KDE Plasma tout en verrouillant simultanément la session n'est pas disponible [2].\n\nVous pouvez ajouter un script qui active l'économiseur d'écran de KDE au démarrage automatique comme solution de contournement :\n\n```\n#!/bin/sh\n/usr/bin/dbus-send --session --type=method_call --dest=org.freedesktop.ScreenSaver /ScreenSaver org.freedesktop.ScreenSaver.Lock &\n```\n\n"
    },
    {
      "title": "Déverrouiller KDE Wallet automatiquement à la connexion",
      "level": 3,
      "content": "Consultez KDE Wallet#Unlock KDE Wallet automatically on login.\n\n"
    },
    {
      "title": "Paramètres du thème",
      "level": 3,
      "content": "Les paramètres du thème peuvent être modifiés dans la section [Theme]. Si vous utilisez les paramètres système de Plasma, les thèmes peuvent afficher des aperçus.\n\nRéglez-les sur breeze pour obtenir le thème Plasma par défaut.\n\nCertains thèmes sont disponibles dans l'AUR, par exemple archlinux-themes-sddmAUR.\n\n"
    },
    {
      "title": "Thème actuel",
      "level": 4,
      "content": "Définissez le thème actuel grâce à la valeur Current, par exemple Current=archlinux-simplyblack.\n\n"
    },
    {
      "title": "Modification des thèmes",
      "level": 4,
      "content": "Le répertoire par défaut des thèmes SDDM est /usr/share/sddm/themes/. Vous pouvez ajouter vos thèmes personnalisés à ce répertoire dans un sous-répertoire séparé. Notez que SDDM exige que les noms de ces sous-répertoires soient les mêmes que ceux des thèmes. Étudiez les fichiers installés pour modifier ou créer votre propre thème.\n\n"
    },
    {
      "title": "Personnalisation d'un thème",
      "level": 4,
      "content": "Pour remplacer les paramètres du fichier de configuration theme.conf, créez un fichier personnalisé theme.conf.user dans le même répertoire. Par exemple, pour modifier l'arrière-plan du thème :\n\n```\n/usr/share/sddm/themes/name/theme.conf.user\n```\n\n```\n[General]\nbackground=/path/to/background.png.\n```\n\n"
    },
    {
      "title": "Tester (prévisualiser) un thème",
      "level": 4,
      "content": "Vous pouvez prévisualiser un thème SDDM si nécessaire. Ceci est particulièrement utile si vous n'êtes pas sûr de l'aspect du thème s'il est sélectionné ou si vous venez de modifier un thème et que vous voulez consulter son aspect sans vous déconnecter. Vous pouvez exécuter quelque chose comme ceci :\n\n```\n$ sddm-greeter --test-mode --theme /usr/share/sddm/themes/breeze\n```\n\nCela devrait ouvrir une nouvelle fenêtre pour chaque moniteur que vous avez connecté et afficher un aperçu du thème.\n\n"
    },
    {
      "title": "Curseur de la souris",
      "level": 4,
      "content": "Pour définir le thème du curseur de la souris, définissez CursorTheme sur votre thème de curseur préféré.\n\nLes noms de thèmes de curseur de souris Plasma valides sont breeze_cursors, Breeze_Snow et breeze-dark.\n\n"
    },
    {
      "title": "Icône de l'utilisateur (avatar)",
      "level": 4,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nSDDM lit l'icône de l'utilisateur (alias \"avatar\") sous forme d'image PNG à partir de ~/.face.icon pour chaque utilisateur, ou de l'emplacement commun à tous les utilisateurs spécifié par FacesDir dans un fichier de configuration SDDM. Le paramètre de configuration peut être placé soit directement dans /etc/sddm.conf, soit, mieux encore, dans un fichier sous /etc/sddm.conf.d/ tel que /etc/sddm.conf.d/avatar.conf.\n\nPour utiliser l'option d'emplacement FacesDir, placez une image PNG pour chaque utilisateur nommée username.face.icon à l'emplacement spécifié par la clé FacesDir dans le fichier de configuration. L'emplacement par défaut de FacesDir est /usr/share/sddm/faces/. Vous pouvez modifier l'emplacement par défaut de FacesDir en fonction de vos besoins. Voici un exemple :\n\n```\n/etc/sddm.conf.d/avatar.conf\n```\n\n```\n[Theme]\nFacesDir=/var/lib/AccountsService/icons/\n```\n\nL'autre option consiste à placer une image PNG nommée .face.icon à la racine de votre répertoire personnel. Dans ce cas, aucune modification du fichier de configuration SDDM n'est nécessaire. Cependant, vous devez vous assurer que l'utilisateur sddm peut lire le(s) fichier(s) image(s) PNG pour les icônes de l'utilisateur.\n\nPour définir les autorisations appropriées, exécutez :\n\n```\n$ setfacl -m u:sddm:x ~/\n$ setfacl -m u:sddm:r ~/.face.icon\n```\n\nVous pouvez vérifier les permissions avec :\n\n```\n$ getfacl ~/\n$ getfacl ~/.face.icon\n```\n\nConsultez SDDM README : No User Icon.\n\n"
    },
    {
      "title": "Numlock",
      "level": 3,
      "content": "Si vous voulez imposer l'activation de Numlock, définissez Numlock=on dans la section [General].\n\n"
    },
    {
      "title": "Rotation de l'affichage",
      "level": 3,
      "content": "Consultez Xrandr#Configuration.\n\n"
    },
    {
      "title": "Paramètres DPI",
      "level": 3,
      "content": "Il est parfois utile de configurer les paramètres PPI corrects du moniteur au niveau du \"Display Manager\". [3] Pour ce faire, vous devez ajouter à ServerArguments le paramètre -dpi your_dpi à la fin de la chaîne. Par exemple :\n\n```\n/etc/sddm.conf.d/dpi.conf\n```\n\n```\n[X11]\nServerArguments=-nolisten tcp -dpi 94\n```\n\n"
    },
    {
      "title": "Activer HiDPI",
      "level": 3,
      "content": "Créez le fichier suivant :\n\n```\n/etc/sddm.conf.d/hidpi.conf\n```\n\n```\n[Wayland]\nEnableHiDPI=true\n\n[X11]\nEnableHiDPI=true\n```\n\n"
    },
    {
      "title": "Activer le clavier virtuel",
      "level": 3,
      "content": "Installez qt5-virtualkeyboard.\n\nCréez le fichier suivant :\n\n```\n/etc/sddm.conf.d/virtualkbd.conf\n```\n\n```\n[General]\nInputMethod=qtvirtualkeyboard\n```\n\nSDDM affiche maintenant un bouton dans le coin inférieur gauche de l'écran de connexion pour ouvrir le clavier virtuel.\n\n"
    },
    {
      "title": "Utilisation d'un lecteur d'empreintes digitales",
      "level": 3,
      "content": "SDDM fonctionne avec un lecteur d'empreintes digitales lorsque vous utilisez fprint. Après avoir installé fprint et ajouté des signatures d'empreintes digitales, ajoutez ce qui suit en haut de /etc/pam.d/sddm :\n\n```\n/etc/pam.d/sddm\n```\n\n```\nauth \t\t\tsufficient  \tpam_fprintd.so\n```\n\nAfin d'utiliser un mot de passe ou une empreinte digitale, vous pouvez ajouter ce qui suit en haut du fichier :\n\n```\n/etc/pam.d/sddm\n```\n\n```\nauth \t\t\t[success=1 new_authtok_reqd=1 default=ignore]  \tpam_unix.so try_first_pass likeauth nullok\nauth \t\t\tsufficient  \tpam_fprintd.so\n```\n\nNotez que KWallet ne peut pas être déverrouillé à l'aide d'un lecteur d'empreintes digitales (consultez KDE Wallet#Unlock KDE Wallet automatically on login), mais la première ligne garantit qu'une connexion par mot de passe déverrouillera automatiquement KWallet.\n\nNote: Pour utiliser soit un mot de passe, soit une empreinte digitale, vous pouvez ajouter ce qui suit en haut du fichier :\n\nPour utiliser soit un mot de passe, soit une empreinte digitale, vous pouvez ajouter ce qui suit en haut du fichier :\n\n```\n/etc/pam.d/kde\n```\n\n```\nauth sufficient pam_unix.so try_first_pass likeauth nullok\nauth sufficient pam_fprintd.so\n```\n\nLa première ligne est différente de la configuration correspondante /etc/pam.d/sddm car l'écran de verrouillage KDE n'a pas besoin d'exécuter le module pam KWallet.\n\nSi vous appuyez maintenant sur entrée dans le champ vide du mot de passe, le lecteur d'empreintes digitales devrait commencer à fonctionner.\n\n"
    },
    {
      "title": "Exécution sous Wayland",
      "level": 3,
      "content": "SDDM peut fonctionner sans root sous Wayland, mais actuellement seulement en utilisant le paquet sddm-gitAUR.\n\nCréez un nouveau fichier de configuration dans le répertoire /etc/sddm.conf.d/, nommez-le comme /etc/sddm.conf.d/10-wayland.conf.\n\nAjoutez ce qui suit au nouveau fichier :\n\n```\n/etc/sddm.conf.d/10-wayland.conf\n```\n\n```\n[General]\nDisplayServer=wayland\nGreeterEnvironment=QT_WAYLAND_SHELL_INTEGRATION=layer-shell\n\n[Wayland]\nCompositorCommand=\n```\n\nEnsuite, vous aurez besoin d'un compositeur Wayland (tel que le compositeur KWin de KDE) pour rendre SDDM, et entrer le programme et les arguments pertinents comme paramètre de CompositorCommand.\n\n"
    },
    {
      "title": "KDE / KWin",
      "level": 4,
      "content": "Note: **déconnexion** \n\nAjoutez ce qui suit comme paramètre à CompositorCommand dans le fichier de configuration SDDM créé ci-dessus (par exemple /etc/sddm.conf.d/10-wayland.conf) :\n\n```\n/etc/sddm.conf.d/10-wayland.conf\n```\n\n```\n[Wayland]\nCompositorCommand=kwin_wayland --no-lockscreen\n```\n\nPour activer la prise en charge des claviers virtuels (par exemple, en utilisant qt5-virtualkeyboard ou maliit-keyboard), ajoutez l'option --inputmethod avec le clavier approprié à la commande kwin_wayland, comme suit (en remplaçant maliit-keyboard par qtvirtualkeyboard si nécessaire) :\n\n```\n/etc/sddm.conf.d/10-wayland.conf\n```\n\n```\n[Wayland]\nCompositorCommand=kwin_wayland --no-lockscreen --inputmethod maliit-keyboard\n```\n\n"
    },
    {
      "title": "Écran vide avec curseur, mais aucun greeter ne s'affiche",
      "level": 3,
      "content": "Le greeter se bloque s'il n'y a pas d'espace disque disponible. Vérifiez votre espace disque avec df -h.\n\nSi l'espace disque n'est pas le problème, cela peut être dû à un bug. Passez à un autre TTY, puis essayez loginctl unlock-session session_id ou redémarrez SDDM.\n\n"
    },
    {
      "title": "Long temps de chargement avant que SDDM n'affiche le greeter",
      "level": 3,
      "content": "Un pool d'entropie faible peut causer un long temps de chargement de SDDM (rapport de bug). Consultez Random number generation pour des suggestions afin d'augmenter le pool d'entropie.\n\n"
    },
    {
      "title": "Blocage après la connexion",
      "level": 3,
      "content": "Essayez de supprimer ~/.Xauthority et de vous connecter à nouveau sans redémarrer. Si vous redémarrez sans vous connecter, le fichier sera recréé et le problème persistera.\n\n"
    },
    {
      "title": "SDDM démarre sur tty1 au lieu de tty7",
      "level": 3,
      "content": "SDDM suit la convention de systemd de démarrer la première session graphique sur tty1. Si vous préférez l'ancienne convention où tty1 à tty6 sont réservés aux consoles texte, changez la valeur par défaut de la variable MinimumVT, qui se trouve dans la section [X11] :\n\n```\n/etc/sddm.conf.d/tty.conf\n```\n\n```\n[X11]\nMinimumVT=7\n```\n\n"
    },
    {
      "title": "Un ou plusieurs utilisateurs ne s'affichent pas sur le greeter",
      "level": 3,
      "content": "Par défaut, SDDM est configuré pour afficher uniquement les utilisateurs dont l'UID est compris entre 1000 et 60513. Si les UID des utilisateurs souhaités sont en dehors de cette plage, vous devrez modifier la plage.\n\nPar exemple, pour un UID de 501, définissez MinimumUid et masquez ceux dont les shells sont utilisés par les utilisateurs du système :\n\n```\n/etc/sddm.conf.d/uid.conf\n```\n\n```\n[Utilisateurs]\nHideShells=/usr/bin/nologin,/sbin/nologin,/bin/false,/usr/bin/git-shell\nMinimumUid=500\n```\n\nPour les utilisateurs ayant un UID supérieur, définissez MaximumUid à la valeur appropriée.\n\n"
    },
    {
      "title": "Les avatars des utilisateurs ne s'affichent pas sur le greeter",
      "level": 3,
      "content": "Les avatars des utilisateurs ne s'affichent pas sur le greeter si le nombre d'utilisateurs dépasse le paramètre DisableAvatarsThreshold ou si les avatars ne sont pas du tout activés comme le contrôle le paramètre EnableAvatars. Pour contourner ce problème, ajoutez les lignes suivantes à votre configuration sddm :\n\n```\n/etc/sddm.conf.d/avatars.conf\n```\n\n```\n[Theme]\nEnableAvatars=true # activer les avatars\nDisableAvatarsThreshold=7 # définit le seuil pour le nombre d'utilisateurs. Les avatars ne sont pas affichés si ce seuil est dépassé.\n```\n\n"
    },
    {
      "title": "SDDM charge uniquement la disposition de clavier américaine",
      "level": 3,
      "content": "SDDM charge la disposition du clavier spécifiée dans /etc/X11/xorg.conf.d/00-keyboard.conf. Vous pouvez générer ce fichier de configuration par la commande localectl set-x11-keymap. Consultez Configuration du clavier dans Xorg pour plus d'informations.\n\nUne autre façon de définir la disposition du clavier qui ne sera définie que dans SDDM et non dans les sessions suivantes est d'invoquer une commande setxkbmap dans le script de démarrage de SDDM, situé à /usr/share/sddm/scripts/Xsetup. Consultez Xorg (Français)/Keyboard configuration (Français)#Utilisation de setxkbmap pour des exemples.\n\nSDDM peut également afficher de manière incorrecte la disposition US mais passera immédiatement à la disposition correcte dès que vous commencerez à taper votre mot de passe [4]. Cela ne semble pas être un bogue dans SDDM mais dans le serveur X. [5]\n\n"
    },
    {
      "title": "La résolution de l'écran est trop faible",
      "level": 3,
      "content": "Le problème peut être causé par l'utilisation de HiDPI pour les moniteurs avec des EDID corrompus. [6]. Si vous avez #Activer HiDPI|activé HiDPI]], essayez de le désactiver.\n\nSi même ce qui précède échoue, vous pouvez essayer de définir la taille de votre écran dans un fichier de configuration Xorg :\n\n```\n/etc/X11/xorg.conf.d/90-monitor.conf\n```\n\n```\nSection \"Monitor\" (Moniteur)\n        Identifiant \"<moniteur par défaut>\"\n        DisplaySize 345 194 # en millimètres\nEndSection\n```\n\n"
    },
    {
      "title": "Temps de chargement long sur le répertoire personnel d'autofs",
      "level": 3,
      "content": "SDDM essaie par défaut d'afficher les avatars des utilisateurs en accédant au fichier ~/.face.icon. Si votre répertoire personnel est un autofs, par exemple si vous utilisez dm-crypt, cela le fera attendre pendant 60 secondes, jusqu'à ce qu'autofs signale que le répertoire ne peut pas être monté.\n\nVous pouvez désactiver les avatars en créant le fichier de configuration suivant :\n\n```\n/etc/sddm.conf.d/avatar.conf\n```\n\n```\n[Theme]\nEnableAvatars=false\n```\n\n"
    },
    {
      "title": "Fichier d'autorité X (aka MIT-MAGIC-COOKIE)",
      "level": 3,
      "content": "SDDM utilise un nouvel UUID aléatoire pour le fichier d'authentification, comme décrit en détail sur [7]. Ainsi, afin de trouver ce fichier, on peut utiliser un script :\n\n```\n# find /var/run/sddm/ -type f\n```\n\nCela peut être nécessaire si l'on a besoin de lancer x11vnc alors qu'aucun utilisateur n'est connecté. Par exemple :\n\n```\n# x11vnc -display :0 -auth \"$( find /var/run/sddm/ -type f )\"\n```\n\n"
    },
    {
      "title": "Chevauchement des greeters sur une configuration multi-écrans",
      "level": 3,
      "content": "Il arrive que la disposition du moniteur X ne soit pas configurée correctement sur une configuration multi-écrans, ce qui entraîne un chevauchement des greeters. Pour résoudre ce problème, ajoutez les lignes suivantes pour ordonner la disposition de votre greeter sddm de gauche à droite :\n\n```\n/usr/share/sddm/scripts/Xsetup\n```\n\n```\nfor next in $(xrandr --listmonitors | grep -E \" *[0-9]+ :.*\" | cut -d\" \" -f6) ; do\n  [ -z \"$current\" ] && current=$next && continuer\n  xrandr --output $current --auto --output $next --auto --right-of $current\n  current=$next\ndone\n```\n\n"
    }
  ]
}