{
  "title": "SDDM (Русский)",
  "url": "https://wiki.archlinux.org/title/SDDM_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Экранный менеджер\n- KDE (Русский)\n\nSimple Desktop Display Manager (SDDM) – предпочтительный экранный менеджер для KDE Plasma.\n\nИз Википедии:\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет sddm. Опционально установите пакет sddm-kcm для использования модуля KCM.\n\nТеперь следуйте инструкциям из раздела Экранный менеджер#Запуск экранного менеджера, чтобы запускать SDDM при загрузке.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Настройки SDDM по умолчанию хранятся в файле /usr/lib/sddm/sddm.conf.d/default.conf. Для каких-либо изменений создайте конфигурационный файл(ы) в директории /etc/sddm.conf.d/. Для получения полного списка настроек смотрите страницу справочного руководства sddm.conf(5).\n\nПакет sddm-kcm (входящий в группу plasma) предлагает графический интерфейс для конфигурации SDDM в Параметрах системы KDE Plasma. Также в AUR (Русский) доступен редактор настроек sddm-config-editor-gitAUR[ссылка недействительна: package not found] на основе Qt (Русский).\n\nВсё должно работать \"из коробки\", так как Arch Linux использует systemd (Русский) и SDDM по умолчанию использует systemd-logind для управления сессиями.\n\n"
    },
    {
      "title": "Автоматический вход в систему",
      "level": 3,
      "content": "SDDM поддерживает автоматический вход. Для этого настройте конфигурационный файл, например:\n\n```\n/etc/sddm.conf.d/autologin.conf\n```\n\n```\n[Autologin]\nUser=ivan\nSession=plasma.desktop\n```\n\nЭта конфигурация позволит автоматически запускать KDE Plasma для пользователя ivan при загрузке системы. Все доступные сеансы доступны в директории /usr/share/xsessions/ (для Xorg) и /usr/share/wayland-sessions/ (для Wayland).\n\nТакже недоступна возможность автоматического входа в KDE Plasma с одновременной блокировкой сеанса [2].\n\nВы можете добавить скрипт, который активирует скринсейвер KDE при автозапуске в качестве обходного пути:\n\n```\n#!/bin/sh\n/usr/bin/dbus-send --session --type=method_call --dest=org.freedesktop.ScreenSaver /ScreenSaver org.freedesktop.ScreenSaver.Lock &\n```\n\n"
    },
    {
      "title": "Автоматическая разблокировка KDE Wallet при входе в систему",
      "level": 3,
      "content": "Смотрите KDE Wallet#Unlock KDE Wallet automatically on login.\n\n"
    },
    {
      "title": "Настройки темы",
      "level": 3,
      "content": "Настройки темы могут быть изменены в секции [Theme]. Также можно увидеть предпросмотр тем, если вы используете приложение Параметры системы в KDE Plasma.\n\nЗадайте значение breeze для стандартной темы KDE Plasma.\n\nТакже некоторые темы доступны в AUR (Русский), например, archlinux-themes-sddmAUR.\n\n"
    },
    {
      "title": "Текущая тема",
      "level": 4,
      "content": "Установите текущую тему с помощью значения Current, например, Current=archlinux-simplyblack.\n\n"
    },
    {
      "title": "Редактирование тем",
      "level": 4,
      "content": "Каталогом тем для SDDM по умолчанию является /usr/share/sddm/themes/. Вы можете добавить свои собственные темы в отдельный подкаталог этой директории. Заметьте, что названия подкаталогов должны совпадать с названием самой темы. Изучите установленные файлы для их изменения или создания собственной темы.\n\n"
    },
    {
      "title": "Тестирование (предпросмотр) темы",
      "level": 4,
      "content": "В случае необходимости, вы можете предварительно просматривать тему SDDM. Это особенно полезно в случае, когда вы не уверены в том, как тема будет смотреться (в частности, после её редактирования) без необходимости выхода из аккаунта. Вы можете выполнить команду вроде следующей:\n\n```\n$ sddm-greeter --test-mode --theme /usr/share/sddm/themes/breeze\n```\n\nЭта команда откроет новое окно для каждого подключённого монитора с предварительным просмотром темы.\n\n"
    },
    {
      "title": "Курсор мыши",
      "level": 4,
      "content": "Чтобы задать тему для курсора мыши, установите CursorTheme на предпочитаемую вами тему курсора.\n\nДопустимыми значениями для Plasma (Русский) являются breeze_cursors, Breeze_Snow и breeze-dark.\n\n"
    },
    {
      "title": "Аватар пользователя",
      "level": 4,
      "content": "SDDM считывает иконку пользователя (аватар) как изображение PNG ~/.face.icon для каждого пользователя. Также можно задать единую директорию для аватаров всех пользователей используя переменную FacesDir в файле конфигурации SDDM. Данный файл должен располагаться в /etc/sddm.conf или, лучше, в /etc/sddm.conf.d/, например, /etc/sddm.conf.d/avatar.conf.\n\nДля использования функции FacesDir, разместите изображение PNG под названием username.face.icon в директории, указанной параметром FacesDir в файле конфигурации. По умолчанию используется директория /usr/share/sddm/faces/. Вы можете изменить стандартное значение FacesDir, например:\n\n```\n/etc/sddm.conf.d/avatar.conf\n```\n\n```\n[Theme]\nFacesDir=/var/lib/AccountsService/icons/\n```\n\nТакже можно разместить PNG-изображение под названием .face.icon в корне вашей домашней директории. В таком случае не потребуется вносить какие-либо изменения в файл конфигурации SDDM. Тем не менее, вам нужно убедиться, что пользователь sddm имеет права на чтение аватаров.\n\nДля задания корректных прав, выполните следующую команду:\n\n```\n$ setfacl -m u:sddm:x ~/\n$ setfacl -m u:sddm:r ~/.face.icon\n```\n\nВы можете проверить права с помощью данной команды:\n\n```\n$ getfacl ~/\n$ getfacl ~/.face.icon\n```\n\nСмотрите также: SDDM README: No User Icon.\n\n"
    },
    {
      "title": "Numlock",
      "level": 3,
      "content": "Если вы хотите, чтобы Numlock автоматически включался, пропишите Numlock=on в секции [General].\n\n"
    },
    {
      "title": "Поворот экрана",
      "level": 3,
      "content": "Смотрите Xrandr#Configuration.\n\n"
    },
    {
      "title": "Настройки DPI",
      "level": 3,
      "content": "Иногда требуется задать корректные настройки PPI монитора на уровне экранного менеджера. [3] Для этого нужно добавить параметр -dpi ваш_dpi в конце строки ServerArguments.\n\nНапример:\n\n```\n/etc/sddm.conf.d/dpi.conf\n```\n\n```\n[X11]\nServerArguments=-nolisten tcp -dpi 94\n```\n\n"
    },
    {
      "title": "Включение HiDPI",
      "level": 3,
      "content": "Создайте следующий файл:\n\n```\n/etc/sddm.conf.d/hidpi.conf\n```\n\n```\n[Wayland]\nEnableHiDPI=true\n\n[X11]\nEnableHiDPI=true\n```\n\n"
    },
    {
      "title": "Включение виртуальной клавиатуры",
      "level": 3,
      "content": "Установите пакет qt5-virtualkeyboard.\n\nСоздайте следующий файл:\n\n```\n/etc/sddm.conf.d/virtualkbd.conf\n```\n\n```\n[General]\nInputMethod=qtvirtualkeyboard\n```\n\nТеперь SDDM отображает кнопку открытия виртуальной клавиатуры в нижнем левом углу экрана входа.\n\n"
    },
    {
      "title": "Использование сканера отпечатка пальцев",
      "level": 3,
      "content": "SDDM использует сканер отпечатков пальцев с помощью fprint. После установки fprint и регистрации отпечатка, добавьте строку auth sufficient pam_fprintd.so в начало файла /etc/pam.d/sddm.\n\nNote: Также экран блокировки KDE позволяет включить вход по отпечаткам пальцев, при этом оставив возможность использовать пароль. Добавьте следующее содержание в начало секции аутентификации:\n\nТакже экран блокировки KDE позволяет включить вход по отпечаткам пальцев, при этом оставив возможность использовать пароль. Добавьте следующее содержание в начало секции аутентификации:\n\n```\n/etc/pam.d/kde\n```\n\n```\nauth \t\t\tsufficient  \tpam_unix.so try_first_pass likeauth nullok\nauth \t\t\tsufficient  \tpam_fprintd.so\n```\n\nДанный метод работает также и с SDDM (/etc/pam.d/sddm), но требует отдельной разблокировки KWallet.\n\nТеперь сканер отпечатков пальцев должен включаться по нажатию на клавишу Enter в пустом поле пароля пользователя.\n\n"
    },
    {
      "title": "Пустой экран с курсором, но без экрана приветствия",
      "level": 3,
      "content": "Проверьте свободное дисковое пространство с помощью команды df -h. В случае его отсутствия экран приветствия аварийно завершает работу.\n\nЕсли же проблема не в отсутствии свободного места, она может быть связана с данной ошибкой. Переключитесь в другой TTY и перезапустите SDDM.\n\n"
    },
    {
      "title": "Долгая загрузка перед отображением экрана приветствия SDDM",
      "level": 3,
      "content": "Низкий уровень энтропии в системе может стать причиной долгой загрузки SDDM (Отчет об ошибке). Смотрите статью Random number generation для получения информации о повышении уровня энтропии.\n\n"
    },
    {
      "title": "Зависания после входа",
      "level": 3,
      "content": "Попробуйте удалить файл ~/.Xauthority и перезайти в систему без перезагрузки. Перезагрузка до повторного входа в систему пересоздаст данный файл и проблема сохранится.\n\n"
    },
    {
      "title": "SDDM запускается на tty1 вместо tty7",
      "level": 3,
      "content": "SDDM следует конвенции systemd, в которой первая графическая сессия запускается на tty1. Если вы предпочитаете старую конвенцию, в которой терминалы с первого по шестой зарезервированы для текстовых консолей, измените стандартное значение переменной MinimumVT в секции [X11]:\n\n```\n/etc/sddm.conf.d/tty.conf\n```\n\n```\n[X11]\nMinimumVT=7\n```\n\n"
    },
    {
      "title": "Один или более пользователей не отображаются на экране приветствия",
      "level": 3,
      "content": "По умолчанию, SDDM отображает только тех пользователей, чей UID находится в диапазоне от 1000 до 65000. Если UID нужных вам пользователей ниже данного значения, вам потребуется изменить этот диапазон. Например, для пользователя с UID равным 501 файл конфигурации будет выглядеть следующим образом:\n\n```\n/etc/sddm.conf.d/uid.conf\n```\n\n```\n[Users]\nHideShells=/sbin/nologin,/bin/false\n# Скрытые пользователи. Это для того, если какие-либо системные пользователи попадают в ваш диапазон. Смотрите /etc/passwd в вашей системе.\nHideUsers=git,sddm,systemd-journal-remote,systemd-journal-upload\n\n# Максимальный user id для отображаемых пользователей\nMaximumUid=65000\n\n# Минимальный user id для отображаемых пользователей\nMinimumUid=500 #Мой UID равен 501\n```\n\n"
    },
    {
      "title": "Аватары пользователей не отображаются на экране приветствия",
      "level": 3,
      "content": "Иконки пользователей не отображаются на экране приветствия, если количество пользователей превышает значение параметра DisableAvatarsThreshold или аватары совсем отключены параметром EnableAvatars. Данное поведение настраивается следующей конфигурацией SDDM:\n\n```\n/etc/sddm.conf.d/avatars.conf\n```\n\n```\n[Theme]\nEnableAvatars=true # Включение иконок пользователей\nDisableAvatarsThreshold=7 # Задание лимита количества пользователей, при котором аватарки отображаются\n```\n\n"
    },
    {
      "title": "SDDM загружает только английскую (US) раскладку клавиатуры",
      "level": 3,
      "content": "SDDM загружает раскладку клавиатуры, заданную в файле /etc/X11/xorg.conf.d/00-keyboard.conf. Вы можете сгенерировать этот конфигурационный файл командой localectl set-x11-keymap. Смотрите Keyboard configuration in Xorg (Русский) для дополнительной информации.\n\nТакже SDDM может некорректно отображать раскладку как английскую, но моментально изменит её на правильную после начала ввода пароля [4]. Похоже, что это баг не SDDM, а libxcb (версии 1.13-1 по состоянию на 2018) [5].\n\n"
    },
    {
      "title": "Слишком низкое разрешение экрана",
      "level": 3,
      "content": "Проблема может быть вызвана использованием HiDPI с мониторами с повреждённой информацией EDID [6]. Попробуйте отключить HiDPI, если он у вас включён.\n\nЕсли же решение выше не помогает, можно попробовать задать размер экрана в файле конфигурации Xorg. Например:\n\n```\n/etc/X11/xorg.conf.d/90-monitor.conf\n```\n\n```\nSection \"Monitor\"\n        Identifier      \"<default monitor>\"\n        DisplaySize     345 194 # in millimeters\nEndSection\n```\n\n"
    },
    {
      "title": "Долгая загрузка с домашней директорией на autofs",
      "level": 3,
      "content": "По умолчанию, SDDM пытается отобразить аватарки пользователей считывая файл ~/.face.icon. Если ваша домашняя директория имеет тип файловой системы autofs, например, в случае использования Dm-crypt (Русский), придётся ждать 60 секунд, пока autofs не сообщит, что директория не может быть смонтирована.\n\nВы можете отключить отображение аватарок отредактировав /etc/sddm.conf:\n\n```\n/etc/sddm.conf\n```\n\n```\n[Theme]\nEnableAvatars=false\n```\n\n"
    }
  ]
}