{
  "title": "Servidor de e-mail",
  "url": "https://wiki.archlinux.org/title/Servidor_de_e-mail",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Um servidor de e-mail consiste em vários componentes. Um agente de transferência de e-mail (MTA) recebe e envia e-mails via SMTP. E-mails recebidos e aceitos são então passados para um agente de entrega de e-mail (MDA), que armazena o e-mail em uma caixa de correio (geralmente nos formatos mbox ou Maildir). Se você quiser que os usuários possam acessar remotamente seus e-mails usando clientes de e-mail (MUA), será necessário executar um servidor POP3 e/ou IMAP.\n\n"
    },
    {
      "title": "Software",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nTodos esses softwares, exceto o Sendmail, incluem um agente de entrega de e-mail.\n\n- dma — Agente de transporte de correio minúsculo.\n\n- Exim — Um agente de transferência de e-mail altamente configurável.\n\n- OpenSMTPD — Um agente de transferência de e-mail, parte do projeto OpenBSD.\n\n- Postfix — Um agente de transferência de e-mail, destinado a ser rápido, fácil de administrar e seguro.\n\n- Sendmail — Um agente de transferência de e-mail bem conhecido.\n\n"
    },
    {
      "title": "Servidores POP3/IMAP",
      "level": 3,
      "content": "- Courier — Um agente de transferência de e-mail, fornecendo serviços POP3, IMAP, webmail e lista de discussão como componentes individuais.\n\n- Cyrus IMAP — Um agente de transferência de e-mail com um formato de spool de email personalizado fornece serviços POP3 e IMAP.\n\n- Dovecot — Um servidor IMAP e POP3 escrito para ser seguro, rápido e simples de configurar.\n\n- UW IMAP — Um servidor IMAP/POP.\n\n"
    },
    {
      "title": "MDAs autônomos",
      "level": 3,
      "content": "- fdm — Um programa simples para entregar e filtrar mensagens.\n\n- Procmail — Um programa para filtrar, classificar e armazenar email (não-mantido).\n\n- Maildrop — Um agente de transferência de e-mail/filtro de e-mail usado pelo Courier Mail Server.\n\nVeja também Wikipedia:Comparison of e-mail servers.\n\n"
    },
    {
      "title": "Portas",
      "level": 2,
      "content": "Table content:\nPropósito | Porta | Protocolo | Criptografia\nAceitar e-mail de outros MTAs. | 25 | SMTP | STARTTLS\nAceitar submissões a partir de MUAs. | 587 | SMTP | STARTTLS\n465 | SMTPS | TLS implícito\nPermitir que MUAs acessem e-mails. | 110 | POP3 | STARTTLS\n995 | POP3S | TLS implícito\n143 | IMAP | STARTTLS\n993 | IMAPS | TLS implícito\n\n"
    },
    {
      "title": "Registro MX",
      "level": 2,
      "content": "Hospedar um servidor de e-mail requer um nome de domínio com um registro MX apontando para o nome de domínio do seu agente de transferência de e-mail. O nome de domínio usado como o valor do registro MX deve ser mapeado para pelo menos um endereço de registro (A, AAAA) e não deve ter um registro CNAME para estar em conformidade com RFC 2181, do contrário você pode não receber mensagens de alguns servidores de e-mail. A configuração de registros DNS geralmente é feita a partir da interface de configuração do seu registrador de nomes de domínio.\n\n"
    },
    {
      "title": "TLS",
      "level": 2,
      "content": "Para obter um certificado, veja OpenSSL#Usage.\n\n"
    },
    {
      "title": "Autenticação",
      "level": 2,
      "content": "Há várias técnicas autenticação por e-mail.\n\n"
    },
    {
      "title": "Sender Policy Framework",
      "level": 3,
      "content": "Do Wikipédia:\n\nPara permitir que outros trocadores de e-mail validem e-mails aparentemente enviados de seu domínio, você precisa definir um registro DNS TXT, conforme explicado no artigo da Wikipédia (há também um assistente online). Para validar as mensagens recebidas usando o SPF, você precisa configurar seu agente de transferência de e-mail para usar uma implementação SPF. Existem várias implementações SPF disponíveis: libspf2, perl-mail-spf e perl-mail-spf-query.\n\nTable content:\nCourier | Sim, embutido\nPostfix | Sim\nSendmail | por meio do Milter e do spfmilter-acmeAUR\nExim | experimental, exibe libspf2\nOpenSMTPD | Não\nCyrus IMAP | ?\n\nOs seguintes sites permitem você validar seu registro SPF:\n\n- SPF Record Checker\n- SPF Email test\n\n"
    },
    {
      "title": "Sender Rewriting Scheme",
      "level": 3,
      "content": "O Sender Rewriting Scheme (SRS) é um esquema seguro para permitir retornos encaminháveis para e-mails encaminhados no servidor sem quebrar a Sender Policy Framework.\n\nPara Postfix, veja Postfix#Sender Rewriting Scheme.\n\n"
    },
    {
      "title": "DKIM",
      "level": 3,
      "content": "DomainKeys Identified Mail (DKIM) é um método de autenticação de e-mail no nível do domínio projetado para detectar falsificação de e-mail.\n\nA implementações DKIM disponíveis são OpenDKIM e perl-mail-dkim.\n\n"
    },
    {
      "title": "Teste",
      "level": 2,
      "content": "Há várias opções para ajudar você a testar registros DNS, capacidade de entrega e suporte a criptografia.\n\n"
    },
    {
      "title": "Ferramentas dedicadas",
      "level": 3,
      "content": "- swaksAUR\n\n"
    },
    {
      "title": "Sites de teste",
      "level": 3,
      "content": "Existem vários sites úteis que podem ajudá-lo a testar.\n\n- https://mxtoolbox.com/\n- https://ismyemailworking.com/\n- https://www.mail-tester.com/ (3 tentativas de graça apenas!)\n- https://www.checktls.com/\n- https://pingability.com/zoneinfo.jsp\n\n"
    },
    {
      "title": "Dicas e truques",
      "level": 2,
      "content": "A maioria dos servidores de e-mail pode ser configurada para remover os endereços IP dos usuários e os agentes de usuário do e-mail de saída.\n\nExtras disponíveis que geralmente podem ser integrados são:\n\n- ClamAV para verificação de e-mails por vírus\n- SpamAssassin para identificar e filtrar spam\n- Sieve – uma linguagem de programação para filtrar e-mail\n- webmail como o Roundcube ou o Squirrelmail\n\n"
    }
  ]
}