{
  "title": "Sftpman",
  "url": "https://wiki.archlinux.org/title/Sftpman",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- SSH\n- SSHFS\n\nYou can use sftpman (an SSHFS helper) to mount a remote system - accessible via SSH - to a local folder.\n\nsftpman offers both a command-line tool (sftpman) and an iced-based frontend (sftpman-iced, see screenshot), each packaged separately.\n\nWith sftpman, you first setup (define) your remote filesystems and then you mount/unmount them easily (with one command or click).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "There are 2 packages you may wish to install.\n\n- sftpmanAUR - provides the command-line application sftpman and is also used internally (as a library) by the GUI frontend.\n\n- sftpman-icedAUR - provides the sftpman-iced application, an iced-based GUI frontend to sftpman.\n\n"
    },
    {
      "title": "Defining filesystems",
      "level": 2,
      "content": "Each filesystem managed by sftpman needs to have a unique name/id which will be used when managing the system and also in its mount path. A system with an id of my-machine will be mounted locally to /mnt/sshfs/my-machine.\n\nAuthentication with the remote filesystem during mounting can be performed using passwords, SSH keys or by delegating it to an authentication-agent.\n\nTo define a new remote filesystem with password-based authentication using the command-line tool, do:\n\n```\n$ sftpman create \\\n--id \"my-machine\" \\\n--host \"HOSTNAME_OR_IP\" \\\n--user \"USERNAME\" \\\n--auth_type=password \\\n--remote_path \"/REMOTE_PATH\"\n```\n\nOr the equivalent in case you want to authenticate with SSH Keys (recommended):\n\n```\n$ sftpman create \\\n--id \"my-machine\" \\\n--host \"HOSTNAME_OR_IP\" \\\n--user \"USERNAME\" \\\n--auth_type=publickey \\\n--ssh_key \"/PATH/TO/PRIVATE_KEY\" \\\n--mount_point \"/REMOTE_PATH\"\n```\n\nThe above setup is the minimum for defining a new filesystem that sftpman can mount. Depending on your environment, you may need to configure additional options (like --port, which defaults to 22). To see a full list of available options do:\n\n```\n$ sftpman create --help\n```\n\nYou can also use the GUI application to define new filesystems more easily.\n\n"
    },
    {
      "title": "Mounting/Unmounting",
      "level": 3,
      "content": "Once you have defined several filesystems, you can mount them by using their ids.\n\nTo mount:\n\n```\n$ sftpman mount my-machine\n```\n\nwhich mounts the filesystem to /mnt/sshfs/my-machine\n\nTo unmount:\n\n```\n$ sftpman umount my-machine\n```\n\n"
    },
    {
      "title": "Removing defined filesystems",
      "level": 3,
      "content": "To remove a defined filesystem from sftpman's list do:\n\n```\n$ sftpman rm machine-id\n```\n\n"
    },
    {
      "title": "Learning more",
      "level": 3,
      "content": "To see a list of more commands and options that sftpman supports, consult the help:\n\n```\n$ sftpman help\n```\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "sftpman can perform some basic checks on the environment, which may catch some potential problems:\n\n```\n$ sftpman preflight_check\n```\n\nIf the GUI application does not ask you for a password while mounting (when using password-based authentication or for password-protected ssh keys), you will need to install an ssh askpass tool, see #Mounting/Unmounting.\n\nWhen doing authentication using keys, start small and make sure SSH-ing actually works by trying it manually, before trying to use sshfs and a helper around sshfs (like sftpman). Some common problems can be solved by consulting Using SSH Keys#Troubleshooting.\n\nAlso see SSHFS#Troubleshooting.\n\n"
    }
  ]
}