{
  "title": "Silent boot (Português)",
  "url": "https://wiki.archlinux.org/title/Silent_boot_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Plymouth\n\nEsta página é para aqueles que preferem limitar a verbosidade de seu sistema a um mínimo estrito, seja por estética ou por outros motivos. Seguir este guia removerá todo o texto do processo de inicialização. Demonstração em vídeo\n\n"
    },
    {
      "title": "Parâmetros do kernel",
      "level": 2,
      "content": "Altere os parâmetros do kernel usando as opções de configuração do seu gerenciador de inicialização, para incluir os seguintes parâmetros:\n\n```\nquiet vga=current\n```\n\nvga=current é o argumento do kernel para evitar comportamentos estranhos, como FS#32309.\n\nSe você ainda estiver recebendo mensagens impressas para o console, pode ser que o dmesg envie a você o que acha que são mensagens importantes. Você pode alterar o nível em que essas mensagens serão impressas usando quiet loglevel=<nível>, sendo <nível> qualquer número entre 0 e 7, em que 0 é o mais crítico e 7 é o nível de depuração da impressão.\n\n```\nquiet loglevel=3 vga=current\n```\n\nNote que isto parece funcionar apenas se quiet e loglevel=<nível> forem usados, e eles devem estar nessa ordem (quiet primeiro). O parâmetro de loglevel só alterará o que é impresso no console, os níveis do próprio dmesg não serão afetados e ainda estarão disponíveis através do diário, bem como do comando dmesg. Para obter mais informações, consulte o arquivo Documentation/kernel-parameters.txt do pacote linux-docs.\n\nSe você também quiser impedir o systemd de imprimir seu número de versão ao inicializar, você também deve anexar udev.log_priority=3 à sua linha de comando do kernel (systemd-udevd.service(8) § KERNEL COMMAND LINE). Se systemd for usado em um initramfs, anexe rd.udev.log_priority=3.\n\nSe você estiver usando o hook systemd no initramfs, você poderá receber mensagens systemd durante a inicialização do initramfs. Você pode passar rd.systemd.show_status=false para desativá-los, ou rd.systemd.show_status=auto para suprimir somente mensagens bem-sucedidas (portanto, em caso de erros você ainda pode vê-los). Na verdade, auto já foi passado para systemd.show_status=auto quando quiet é usado, no entanto por algum motivo algumas vezes systemd dentro do initramfs não entende isso. Abaixo estão os parâmetros que você precisa passar para o seu kernel para obter uma inicialização completamente limpa com o systemd em seu initramfs:\n\n```\nquiet loglevel=3 rd.systemd.show_status=auto rd.udev.log_priority=3\n```\n\nTambém touch ~/.hushlogin para remover a última mensagem de login.\n\n"
    },
    {
      "title": "Remover o cursor piscando do console",
      "level": 2,
      "content": "O cursor do console na inicialização continua piscando se você seguir estas instruções. Isto pode ser resolvido passando vt.global_cursor_default=0 ao kernel [1].\n\nPara recuperar o cursor no TTY, execute:\n\n```\n# setterm -cursor on >> /etc/issue\n```\n\n"
    },
    {
      "title": "sysctl",
      "level": 2,
      "content": "Para ocultar quaisquer mensagens do kernel do console, adicione ou modifique a linha kernel.printk de acordo com [2]:\n\n```\n/etc/sysctl.d/20-quiet-printk.conf\n```\n\n```\nkernel.printk = 3 3 3 3\n```\n\n"
    },
    {
      "title": "agetty",
      "level": 2,
      "content": "Para ocultar o problema de agetty exibido e a linha de prompt \"login:\" do console[3], crie um trecho drop-in para getty@tty1.service.\n\n```\n/etc/systemd/system/getty@tty1.service.d/skip-prompt.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=-/usr/bin/agetty --skip-login --nonewline --noissue --autologin nome_de_usuário --noclear %I  $TERM\n```\n\n"
    },
    {
      "title": "startx",
      "level": 2,
      "content": "Para ocultar mensagens do startx, você pode redirecionar sua saída para /dev/null, em seu .bash_profile, como:\n\n```\n$ [[ $(fgconsole 2>/dev/null) == 1 ]] && exec startx -- vt1 &> /dev/null\n```\n\n"
    },
    {
      "title": "fsck",
      "level": 2,
      "content": "Para ocultar as mensagens do fsck durante a inicialização, deixe o systemd verificar o sistema de arquivos raiz. Para isso, substitua o hook udev com systemd:\n\n```\nHOOKS=( base systemd fsck ...)\n```\n\nem /etc/mkinitcpio.conf e, então, execute:\n\n```\nmkinitcpio -p linux\n```\n\nAgora, edite systemd-fsck-root.service e systemd-fsck@.service:\n\n```\n# systemctl edit --full systemd-fsck-root.service\n# systemctl edit --full systemd-fsck@.service\n```\n\nConfigurando StandardOutput e StandardError assim:\n\n```\n(...)\n\n[Service]\nType=oneshot\nRemainAfterExit=yes\nExecStart=/usr/lib/systemd/systemd-fsck\nStandardOutput=null\nStandardError=journal+console\nTimeoutSec=0\n```\n\nVeja systemd-fsck@.service(8) para mais informações sobre as opções que você pode passar para systemd-fsck - você pode alterar com qual frequência o serviço vai verificar (ou não) seus sistemas de arquivos.\n\n"
    },
    {
      "title": "Silenciar o GRUB",
      "level": 2,
      "content": "Para ocultar as mensagens de boas-vindas e de inicialização do GRUB, você pode instalar o pacote não oficial grub-silentAUR.\n\nApós a instalação, é necessário reinstalar o GRUB na partição necessária primeiro.\n\nEntão, pegue um exemplo, como /etc/default/grub.silent, e faça as alterações necessárias para /etc/default/grub.\n\nAs três linhas abaixo são necessárias:\n\n```\nGRUB_DEFAULT=0\nGRUB_TIMEOUT=0\nGRUB_RECORDFAIL_TIMEOUT=$GRUB_TIMEOUT\n```\n\nFinalmente, gere novamente o arquivo grub.cfg.\n\n"
    },
    {
      "title": "Retendo ou desabilitando o logotipo do fornecedor do BIOS",
      "level": 2,
      "content": "Os modernos sistemas UEFI exibem um logotipo de fornecedor na inicialização até entregar o controle ao gerenciador de boot; por exemplo, Os laptops da Lenovo exibem um logotipo vermelho brilhante da Lenovo. Esse logotipo de fornecedor é normalmente apagado pelo gerenciador de boot (se o GRUB padrão for usado) ou pelo kernel.\n\nPara evitar que o kernel apague o logotipo de fornecedor, o Linux 4.19 introduziu uma nova opção de configuração FRAMEBUFFER_CONSOLE_DEFERRED_TAKEOVER que retém o conteúdo do framebuffer até que o texto precise ser impresso no console framebuffer. A partir de novembro de 2018 (Linux 4.19.1), os kernels oficiais do Arch Linux são compilados com CONFIG_FRAMEBUFFER_CONSOLE_DEFERRED_TAKEOVER = y.\n\nQuando combinado com um nível de log baixo (para impedir que o texto seja impresso), o logotipo do fornecedor pode ser mantido enquanto o sistema é inicializado. Observe que o GRUB na configuração padrão substitui a tela; considere usar a inicialização EFISTUB para inicializar diretamente no kernel e, assim, alavancar o controle diferido.\n\nDemonstração em vídeo\n\nA linha de comando do kernel deve usar loglevel=3 ou rd.udev.log_priority=3 como mencionado acima. Observe que, se você costuma receber mensagens de Core temperature above threshold, cpu clock throttled no log do kernel, você precisa usar o nível de log 2 para silenciá-las no momento da inicialização. Alternativamente, se você compilar seu próprio kernel, ajuste o nível de log da mensagem em arch/x86/kernel/cpu/mcheck/therm_throt.c.\n\nSe você usar Intel graphics, defina i915.fastboot=1 na linha de comando do kernel para evitar configurações desnecessárias de modos (e de supressão de tela) na inicialização.\n\nLeia mais sobre isso em:\n\n- Phoronix: Linux 4.19 Adds Deferred Console Takeover Support For FBDEV - Cleaner Boot Process\n- Hans de Goede: Adding deferred fbcon console takeover to the Fedora kernels\n\n"
    },
    {
      "title": "Desabilitando o controle obtido",
      "level": 3,
      "content": "Se o novo comportamento causar problema, você pode desabilitar o controle obtido por meio do parâmetro do kernel fbcon=nodefer.\n\n"
    }
  ]
}