{
  "title": "SLiM (Français)",
  "url": "https://wiki.archlinux.org/title/SLiM_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles apparentés\n\n- Gestionnaire d'affichage\n\nSLiM est un acronyme pour Simple Login Manager. Léger et facilement configurable, SLiM nécessite un minimum de dépendances, et aucun des environnements de bureau GNOME ou KDE. Il contribue donc à un système léger pour les utilisateurs qui aiment aussi utiliser des bureaux légers tels que Xfce, Openbox, et Fluxbox.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet slim.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "SLiM peut détecter automatiquement les environnements de bureau et les gestionnaires de fenêtres installés grâce à l'utilisation de sessiondir /usr/share/xsessions/ dans /etc/slim.conf. Ceux qui effectuent une mise à jour à partir d'une version antérieure à 1.3.6-2 doivent modifier /etc/slim.conf et xinitrc en conséquence. Consultez ci-dessous.\n\n"
    },
    {
      "title": "Activation de SLiM",
      "level": 3,
      "content": "Activez slim.service. Cela suppose qu'un gestionnaire d'affichage précédemment activé a d'abord été désactivé. Sinon, changez la cible par défaut.\n\n"
    },
    {
      "title": "Environnements",
      "level": 3,
      "content": "Pour configurer SLiM 1.3.6-2 (ou une version ultérieure) afin de charger un environnement, modifiez à la fois /etc/slim.conf et ~/.xinitrc.\n\nCommencez par éditer /etc/slim.conf : Si vous n'utilisez qu'un seul environnement, vous pouvez commenter sessiondir /usr/share/xsessions/. Ceci désactivera la détection automatique des environnements installés :\n\n```\n# Définir le répertoire qui contient les xsessions.\n# slim lit xsession depuis ce répertoire, et sera capable de sélectionner.\n# sessiondir /usr/share/xsessions/\n```\n\nSi vous souhaitez détecter automatiquement les environnements de bureau installés, laissez la ligne non commentée.\n\nEnsuite, éditez xinitrc :\n\n```\n$HOME/.xinitrc\n```\n\n```\n#!/bin/sh\nif [ -d /etc/X11/xinit/xinitrc.d ] ; then\n for f in /etc/X11/xinit/xinitrc.d/?*.sh ; do\n  [ -x \"$f\" ] && . \"$f\"\n done\n unset f\nfi\nexec $1\n```\n\n"
    },
    {
      "title": "Définir le nom d'utilisateur par défaut",
      "level": 3,
      "content": "SLiM peut être configuré pour définir automatiquement un nom d'utilisateur souhaité, qui sera donc déjà complété. Le champ du mot de passe sera également déjà ciblé par défaut. Modifiez la ligne suivante dans /etc/slim.conf :\n\n```\n# default_user simone\n```\n\nDécommentez cette ligne, et remplacez \"simone\" par le nom d'utilisateur de votre choix :\n\n```\ndefault_user votre_nom_d'utilisateur\n```\n\n"
    },
    {
      "title": "Enable Autologin",
      "level": 3,
      "content": "Note: **Ne** \n\n- Ne définissez pas cette option pour le compte root.\n- Si la connexion automatique est activée, le trousseau de clés GNOME ne sera pas déverrouillé automatiquement à la connexion. Cela entraînera un mauvais comportement des applications qui en dépendent, telles que Chrome/Chromium et NetworkManager (consultez https://bbs.archlinux.org/viewtopic.php?id=167579).\n\nModifiez /etc/slim.conf pour décommenter la commande auto_login et remplacer no par yes :\n\n```\nauto_login yes\n```\n\n"
    },
    {
      "title": "Thèmes",
      "level": 3,
      "content": "Installez le paquet slim-themes. Le paquet archlinux-themes-slim contient plusieurs thèmes différents (slimthemes.png). Consultez le répertoire /usr/share/slim/themes pour consulter les thèmes disponibles. Entrez le nom du thème sur la ligne current_theme dans /etc/slim.conf :\n\n```\n#current_theme default\ncurrent_theme archlinux-simplyblack\n```\n\nVous pouvez prévisualiser un thème pendant que Xorg fonctionne avec :\n\n```\n$ slim -p /usr/share/slim/themes/<nom du thème>\n```\n\nPour fermer, tapez \"exit\" dans la ligne de connexion et appuyez sur Entrée.\n\nDes paquets de thèmes supplémentaires peuvent être trouvés dans l'AUR. Consultez la [documentation du thème https://github.com/iwamatsu/slim/blob/master/THEMES] pour savoir comment personnaliser votre thème ou créer le vôtre. SLiM ne prend pas en charge les répertoires de thèmes alternatifs, il est donc recommandé de créer un paquet pour votre thème personnalisé afin que pacman en soit informé.\n\n"
    },
    {
      "title": "Fond d'écran personnalisé",
      "level": 4,
      "content": "SLiM est codé en dur pour charger background.png ou background.jpg (dans cet ordre) à partir du répertoire de votre thème. Il suffit d'écraser le fichier approprié\n\n```\n# cp /path/to/new_background.jpg /usr/share/slim/themes/<theme_name>/background.jpg\n```\n\n"
    },
    {
      "title": "Configuration du double écran",
      "level": 4,
      "content": "Vous pouvez personnaliser le thème slim dans /usr/share/slim/themes/<votre-theme>/slim.theme pour modifier ces valeurs en pourcentage. La boîte elle-même fait 450 pixels par 250 pixels :\n\n```\ninput_panel_x 50\ninput_panel_y 50\n```\n\nen valeurs de pixels :\n\n```\n# Ces paramètres placent le panneau \"archlinux-simplyblack\" au centre d'un écran 1440x900\ninput_panel_x 495\ninput_panel_y 325\n```\n\n```\n# Ces paramètres placent le panneau \"archlinux-retro\" au centre d'un écran 1680x1050\ninput_panel_x 615\ninput_panel_y 400\n```\n\nSi votre thème comporte une image d'arrière-plan, vous devez utiliser le paramètre background_style (stretch, tile, center ou color) pour qu'elle s'affiche correctement.\n\n"
    },
    {
      "title": "Changer le curseur",
      "level": 3,
      "content": "Après l'installation, éditez /etc/slim.conf et décommentez la ligne :\n\n```\ncursor   left_ptr\n```\n\nCela vous donnera une flèche normale à la place. Ce paramètre est transmis à xsetroot -cursor_name. Vous pouvez consulter les noms de curseurs possibles ou dans /usr/share/icons/votre-cursor-theme/cursors/.\n\nPour changer le thème de curseur utilisé à l'écran de connexion, consultez Cursor themes#The default cursor theme.\n\n"
    },
    {
      "title": "Faire correspondre le fond d'écran de SLiM et celui du bureau",
      "level": 3,
      "content": "Pour partager un fond d'écran entre SLiM et votre bureau, renommez le fond d'écran du thème utilisé, puis créez un lien du fichier de fond d'écran de votre bureau vers le thème SLiM par défaut :\n\n```\n# mv /usr/share/slim/themes/default/background.jpg{,.bck}\n# ln -s /path/to/mywallpaper.jpg /usr/share/slim/themes/default/background.jpg\n```\n\n"
    },
    {
      "title": "Arrêter, redémarrer, suspendre, quitter, lancer un terminal à partir de SLiM",
      "level": 3,
      "content": "Vous pouvez arrêter, redémarrer, suspendre, quitter ou même lancer un terminal à partir de l'écran de connexion SLiM. Pour ce faire, utilisez les valeurs dans le champ nom d'utilisateur, et le mot de passe root dans le champ mot de passe :\n\n- Pour lancer un terminal, entrez console comme nom d'utilisateur (par défaut, xterm qui doit être installé séparément... éditez /etc/slim.conf pour changer la préférence du terminal).\n- Pour l'arrêt, entrez halt comme nom d'utilisateur.\n- Pour rebooter, entrez reboot comme nom d'utilisateur.\n- Pour sortir de bash, entrez exit comme nom d'utilisateur.\n- Pour suspendre, entrez suspend comme nom d'utilisateur. La suspension est désactivée par défaut, éditez /etc/slim.conf en tant que root pour décommenter la ligne suspend_cmd et, si nécessaire, modifiez la commande suspend elle-même (en changeant par exemple /usr/sbin/suspend en sudo /usr/sbin/pm-suspend).\n\n"
    },
    {
      "title": "Erreur de mise hors tension avec Splashy",
      "level": 3,
      "content": "Si vous utilisez Splashy et SLiM, il arrive que vous ne puissiez pas vous éteindre ou redémarrer à partir du menu dans GNOME, Xfce, LXDE ou autres. Vérifiez vos /etc/slim.conf et /etc/splash.conf ; définissez le DEFAULT_TTY=7 comme xserver_arguments vt07.\n\n"
    },
    {
      "title": "L'icône de la barre d'état système ne fonctionne pas",
      "level": 3,
      "content": "Si l'icône de la zone de notification lors de la mise hors tension échoue, cela peut être dû au fait que vous n'avez pas les privilèges root. Pour lancer une icône de la barre d'état avec les privilèges de l'utilisateur root, assurez-vous que SLiM lance le programme. Modifiez /etc/slim.conf comme suit :\n\n```\nsessionstart_cmd /path/to/tray/icon/program &\n```\n\n"
    },
    {
      "title": "Informations de connexion avec SLiM",
      "level": 3,
      "content": "Par défaut, SLiM ne parvient pas à enregistrer les connexions à utmp et wtmp, ce qui entraîne des erreurs dans les informations de connexion de who, last, etc. Pour corriger cela, modifiez votre slim.conf comme suit :\n\n```\nsessionstart_cmd /usr/bin/sessreg -a -l $DISPLAY %user\nsessionstop_cmd /usr/bin/sessreg -d -l $DISPLAY %user\n```\n\n"
    },
    {
      "title": "Commandes de connexion SLiM personnalisées",
      "level": 3,
      "content": "Vous pouvez également utiliser les commandes sessionstart_cmd/sessionstop_cmd dans /etc/slim.conf pour enregistrer des informations spécifiques, telles que la session, l'utilisateur ou le thème utilisé par slim :\n\n```\nsessionstop_cmd /usr/bin/logger -i -t ASKAPACHE \"(sessionstop_cmd : u:%user s:%session t:%theme)\"\nsessionstart_cmd /usr/bin/logger -i -t ASKAPACHE \"(sessionstart_cmd : u:%user s:%session t:%theme)\"\n```\n\nOu si vous voulez jouer une chanson au chargement de slim (et que vous avez installé le programme beep)\n\n```\nsessionstart_cmd /usr/bin/beep -f 659 -l 460 -n -f 784 -l 340 -n -f 659 -l 230 -n -f 659 -l 110\n```\n\n"
    },
    {
      "title": "Porte-clés GNOME",
      "level": 3,
      "content": "Consultez GNOME/Keyring#Using the keyring pour utiliser GNOME Keyring dans une session personnalisée.\n\n"
    },
    {
      "title": "Réglage du DPI avec SLiM",
      "level": 3,
      "content": "Le serveur Xorg récupère généralement le DPI mais s'il ne le fait pas, vous pouvez le spécifier à SLiM. Si vous définissez la DPI avec l'argument -dpi 96 dans /etc/X11/xinit/xserverrc, cela ne fonctionnera pas avec SLiM. Pour corriger cela, changez votre slim.conf de :\n\n```\nxserver_arguments -nolisten tcp vt07\n```\n\nen\n\n```\nxserver_arguments -nolisten tcp vt07 -dpi 96\n```\n\n"
    },
    {
      "title": "Utiliser un thème aléatoire",
      "level": 3,
      "content": "Utilisez la variable current_theme comme une liste séparée par des virgules pour spécifier un ensemble parmi lequel choisir. La sélection est aléatoire.\n\n"
    },
    {
      "title": "Déplacer la session entière vers un autre VT",
      "level": 3,
      "content": "Si les terminaux tty 3-6 ne sont pas utilisés et sont commentés (Vous pouvez utiliser screen et donc n'avoir besoin que d'un seul terminal), modifiez /etc/slim.conf pour déplacer le serveur X :\n\n```\nxserver_arguments -nolisten tcp vt07\n```\n\nChangez simplement le vt07 en vt03 par exemple car aucun agetty n'est lancé à cet endroit.\n\n"
    },
    {
      "title": "Monter automatiquement votre /home chiffré à la connexion",
      "level": 3,
      "content": "Pour monter automatiquement une partition chiffrée à la connexion de l'utilisateur avec SLiM, configurez pam_mount comme suit :\n\n```\n/etc/pam.d/slim\n```\n\n```\nauth            requisite       pam_nologin.so\nauth            required        pam_env.so\nauth            required        pam_unix.so\nauth            optional        pam_mount.so\naccount         required        pam_unix.so\npassword        required        pam_unix.so\npassword        optional        pam_mount.so\nsession         required        pam_limits.so\nsession         required        pam_unix.so\nsession         optional        pam_mount.so\nsession         optional        pam_loginuid.so\nsession         optional        pam_ck_connector.so\n```\n\n"
    },
    {
      "title": "Changer la disposition du clavier",
      "level": 3,
      "content": "Éditez /etc/X11/xorg.conf.d/10-evdev.conf, trouvez la section suivante, ajoutez les deux lignes en gras, et remplacez dvorak par votre clavier préféré :\n\n```\nSection  \"InputClass\"\n          Identifier \"evdev keyboard catchall\"\n          MatchIsKeyboard \"on\"\n          MatchDevicePath \"/dev/input/event*\"\n          Driver \"evdev\"\n\n          # Keyboard layouts\n          Option \"XkbLayout\" \"dvorak\"\nEndSection\n```\n\n"
    },
    {
      "title": "Verrouillage d'écran",
      "level": 3,
      "content": "Slim inclut slimlock, une fonction de verrouillage d'écran. Pour l'utiliser, il suffit d'exécuter slimlock.\n\nSlimlock lit certaines configurations à partir de /etc/slim.conf et de son propre fichier de configuration /etc/slimlock.conf.\n\nPour empêcher la commutation VT pendant le verrouillage, mettez tty_lock à 1 dans slimlock.conf. Cela nécessite également que vous ayez un accès en écriture sur /dev/console et que slimlock ait la capacité sys_sys_tty_config. Une façon d'y parvenir est de définir slimlock comme suid root :\n\n```\n# chmod +4000 /usr/bin/slimlock\n# chown root: /usr/bin/slimlock\n```\n\nUne alternative est de setcap et de permettre à votre uid d'écrire sur /dev/console.\n\n```\n# setcap cap_sys_tty_config+ep /usr/bin/slimlock\n# chmod o+rw /dev/console\n```\n\nVous pouvez utiliser xss-lock pour verrouiller l'écran automatiquement :\n\n```\n$ xss-lock -- /usr/bin/slimlock &\n```\n\n"
    },
    {
      "title": "Arrêt ou redémarrage bloqué",
      "level": 3,
      "content": "Il y a un bogue ou un problème connu avec la combinaison de SLiM, Xfce et systemd qui ne permet pas au système de s'éteindre correctement et systemd attend que le service SLiM se termine, mais finit par se terminer.\n\nPour accélérer le processus d'arrêt, ces lignes peuvent aider lors de l'édition de slim.service :\n\n```\n[Service]\nExecStart=/usr/bin/slim -nodaemon\nRestart=on-failure\nTimeoutStopSec=5s\nIgnoreSIGPIPE=no\nExecStop=/bin/kill -TERM -${MAINPID}\n```\n\nConsultez le FS#32380.\n\n"
    },
    {
      "title": "Problème d'identification",
      "level": 3,
      "content": "Si votre mot de passe contient des caractères non ASCII (é, è, ç, à, etc.) et que la locale de votre système est en Unicode (fr_FR.UTF-8 par exemple), vous ne pourrez pas vous connecter à votre session avec le paquet du dépôt officiel (bugs chez Debian, bug#532060 et chez NixOS, bug#29802.\n\nUne version corrigée disponible sur AUR prend en charge Unicode et résout ce problème : slim-unicodeAUR.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- SLiM sur SourceForge\n- SLiM sur GitHub\n\n"
    }
  ]
}