{
  "title": "Snap (Polski)",
  "url": "https://wiki.archlinux.org/title/Snap_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nPowiązane artykuły\n\n- Flatpak\n\nSnap to system wdrażania oprogramowania i zarządzania pakietami. Pakiety nazywają się \"snapami\", a narzędziem do ich używania jest snapd, który działa w wielu dystrybucjach GNU/Linuxa i umożliwia w ten sposób proste wdrażanie oprogramowania niezależnie od dystrybucji. Snap został pierwotnie zaprojektowany i stworzony przez Canonical.\n\nsnapd jest demonem REST API dla zarządzania pakietami snap. Użytkownicy mogą zarządzać nim korzystając z klienta snap, który jest częścią tego samego pakietu.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj snapdAUR lub pakiet snapd-gitAUR.\n\n"
    },
    {
      "title": "Konfiguracja",
      "level": 2,
      "content": "Aby uruchomić demona snapd, gdy snap spróbuje go użyć, uruchom i/lub włącz snapd.socket.\n\n"
    },
    {
      "title": "Użycie",
      "level": 2,
      "content": "Narzędzie snap służy do zarządzania snapami.\n\n"
    },
    {
      "title": "Wyszukiwanie",
      "level": 3,
      "content": "Aby znaleźć snapy do zainstalowania, możesz wyszukać je w sklepie Snap:\n\n```\n$ snap find szukany termin\n```\n\n"
    },
    {
      "title": "Instalowanie",
      "level": 3,
      "content": "Po znalezieniu szukanego snapa możesz go zainstalować za pomocą:\n\n```\n# snap install nazwa-snapa\n```\n\nWymaga to uprawnień root'a. Instalacja snapów dla tylko jednego użytkownika nie jest jeszcze możliwa. Spowoduje to pobranie snapa do /var/lib/snapd/snaps i zainstalowanie go w /var/lib/snapd/snap/nazwa-snapa, aby udostępnić je systemowi.\n\nUtworzy także jednostki montowania dla każdego snapa i doda je do /etc/systemd/system/multi-user.target.wants/ jako linki symbolizczne, aby wszystkie snapy były dostępne po uruchomieniu systemu. Gdy to zrobisz, powinieneś znaleźć go na liście zainstalowanych snapów wraz z numerem wersji, wersją i deweloperem używając:\n\n```\n$ snap list\n```\n\nMożesz również zainstalować snapy z lokalnego dysku za pomocą:\n\n```\n# snap install --dangerous /ścieżka/do/snapa\n```\n\n"
    },
    {
      "title": "Aktualizowanie",
      "level": 3,
      "content": "Żeby zaktualizować swoje snapy ręcznie wpisz:\n\n```\n# snap refresh\n```\n\nSnapy są automatycznie odświeżane zgodnie z ustawieniem snap refresh.timer.\n\nŻeby zobaczyć ostatnie odświeżenie użyj:\n\n```\n# snap refresh --time\n```\n\nŻeby ustawić inny czas odświeżania, np. 2 razy w ciągu dnia:\n\n```\n# snap set core refresh.timer=0:00~24:00/2\n```\n\nZobacz strone dokumentacji dla więcej informacji o zmienianiu czasu odświeżania.\n\n"
    },
    {
      "title": "Usuwanie",
      "level": 3,
      "content": "Snapy mogą być usunięte poprzez wpisanie tej komendy:\n\n```\n# snap remove nazwa_snapa\n```\n\n"
    },
    {
      "title": "Klasyczne snapy",
      "level": 3,
      "content": "Niektóre snapy (np. Skype i Pycharm) używają klasycznego ograniczenia. Jednak klasyczne ograniczenie wymaga katalogu /snap, który nie jest zgodny z FHS. Dlatego pakiet snapd nie jest dostarczany z tym katalogiem. Jednakże, jeśli użytkownik tego chce, może ręcznie utworzyć link symboliczny z /snap do /var/lib/snapd/snap, aby umożliwić instalację klasycznych snapów:\n\n```\n# ln -s /var/lib/snapd/snap /snap\n```\n\n"
    },
    {
      "title": "Wsparcie",
      "level": 2,
      "content": "Listy dyskusyjne związane z Arch Linuxem i inne oficjalne kanały wsparcia dla Arch Linuxa nie są odpowiednim miejscem, aby prosić o pomoc ze snapami na Arch Linuxie. Odpowiednim miejscem do poproszenia o pomoc jest forum Snapcraft.\n\n"
    },
    {
      "title": "Zobacz również",
      "level": 2,
      "content": "- Oficjalna strona\n- Repozytorium na GitHubie\n- Artykuł na Arstechnica (06/16) o snapach Ubuntu które stają się dostępne dla Archa i innych dystrybucji.\n\n"
    }
  ]
}