{
  "title": "Software access point (Русский)",
  "url": "https://wiki.archlinux.org/title/Software_access_point_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Настройка сети\n- Настройка беспроводной сети\n- Ad-hoc networking\n- Раздача интернета\n- Router\n\nПрограммная точка доступа используется, если вы хотите чтобы Ваш компьютер выступал в качестве точки доступа для беспроводной локальной сети. Это решит проблему выбора отдельного беспроводного маршрутизатора(WI-FI).\n\n"
    },
    {
      "title": "Поддержка режима AP устройством Wi-Fi",
      "level": 3,
      "content": "Вам понадобится nl80211[устаревшая ссылка 2024-10-12 ⓘ] совместимое беспроводное устройство, поддерживающее рабочий режим[устаревшая ссылка 2024-10-12 ⓘ] AP. Это можно проверить, выполнив команду iw list , которая должна вывести AP в секции Supported interface modes:\n\n```\n$ iw list\n```\n\n```\nWiphy phy1\n...\n\tSupported interface modes:\n\t\t * IBSS\n\t\t * managed\n\t\t * AP\n\t\t * AP/VLAN\n\t\t * WDS\n\t\t * monitor\n\t\t * mesh point\n...\n```\n\n"
    },
    {
      "title": "Беспроводной клиент и программная точка доступа на одном Wi-Fi устройстве",
      "level": 3,
      "content": "Создание программной AP не зависит от конкретного типа устройства (Ethernet, Wi-Fi, ...). Многие беспроводные устройства даже могут быть одновременно использованы как точки доступа и как беспроводные \"клиенты\". Используя эту возможность вы можете создавать программые AP действующие как \"беспроводной ретранслятор\" для существующей сети, используя единственное Wi-Fi устройство. Эта возможность указана в следующей секции вывода iw list:\n\n```\n$ iw list\n```\n\n```\nWiphy phy1\n...\n        valid interface combinations:\n                 * #{ managed } <= 2048, #{ AP, mesh point } <= 8, #{ P2P-client, P2P-GO } <= 1,\n                   total <= 2048, #channels <= 1, STA/AP BI must match\n...\n```\n\nОграничение #channels <= 1 означает, что ваша программная AP должна работать на том же канале, что и ваше Wi-Fi клиентскоее соединение; смотрите channel свойство в hostapd.conf ниже.\n\nЕсли вы собираетесь использовать этот способ, возможно потому что Ethernet-соединение недоступно, вам необходимо создать два отдельных виртуальных интерфейса. Виртуальные интерфейсы для физического устройства wlan0 могут быть созданы так: сначала, \"виртуальные интерфейсы\" создаются непосредственно для самого сетевого соединения (wlan0_sta) и для программной AP/hostapd \"беспроводного ретранслятора\":\n\n```\n# iw dev wlan0 interface add wlan0_sta type managed addr 12:34:56:78:ab:cd  \n# iw dev wlan0 interface add wlan0_ap  type managed addr 12:34:56:78:ab:ce\n```\n\nСлучайные MAC адреса могут быть сгенерированы при использовании macchanger.\n\n"
    },
    {
      "title": "Конфигурация",
      "level": 2,
      "content": "Настройка точки доступа включает в себя два основных пункта:\n\n- Настройка канального уровня Wi-Fi, так что беспроводные клиенты могут использовать вашу \"программную точку доступа\" и принимать/отправлять IP пакеты от/до вашей машины; это то, что пакет hostapd должен сделать за вас.\n- Настройка сетевой конфигурации на вашем компьютере, так что ваша машина будет правильно передавать IP пакеты от/до вашего собственного интернет соединения от/до беспроводных клиентов.\n\n"
    },
    {
      "title": "Канальный уровень Wi-Fi",
      "level": 3,
      "content": "Точку доступа Wi-Fi можно поднять с помощью пакета hostapd, который также поддерживает WPA2.\n\nСкорректируйте настройки hostapd конфигурационного файла, если необходимо. В первую очередь измените ssid и wpa_passphrase. Больше информации на hostapd Linux documentation page[устаревшая ссылка 2024-10-12 ⓘ].\n\n```\n/etc/hostapd/hostapd.conf\n```\n\n```\ninterface=wlan0_ap\nbridge=br0\n\n# SSID to be used in IEEE 802.11 management frames\nssid=YourWiFiName\n# Driver interface type (hostap/wired/none/nl80211/bsd)\ndriver=nl80211\n# Country code (ISO/IEC 3166-1)\ncountry_code=US\n\n# Operation mode (a = IEEE 802.11a (5 GHz), b = IEEE 802.11b (2.4 GHz)\nhw_mode=g\n# Channel number\nchannel=7\n# Maximum number of stations allowed\nmax_num_sta=5\n\n# Bit field: bit0 = WPA, bit1 = WPA2\nwpa=2\n# Bit field: 1=wpa, 2=wep, 3=both\nauth_algs=1\n\n# Set of accepted cipher suites; disabling insecure TKIP\nwpa_pairwise=CCMP\n# Set of accepted key management algorithms\nwpa_key_mgmt=WPA-PSK\nwpa_passphrase=Somepassphrase\n\n# hostapd event logger configuration\nlogger_stdout=-1\nlogger_stdout_level=2\n\n# Uncomment and modify the following section if your device supports 802.11n\n## Enable 802.11n support\n#ieee80211n=1\n## QoS support\n#wmm_enabled=1\n## Use \"iw list\" to show device capabilities and modify ht_capab accordingly\n#ht_capab=[HT40+][SHORT-GI-40][TX-STBC][RX-STBC1][DSSS_CCK-40]\n```\n\nДля автозапуска hostapd в качестве службы запустите hostapd.service.\n\nЕсли вы запускаете hostapd в момент загрузки системы, убедитесь в том, что беспроводной сетевой интерфейс поднялся первым, иначе это не удастся. Для этого отредактируйте конфигурацию юнита, указав привязку и время запуска после поднятия вашего сетевого интерфейса:\n\n```\n/etc/systemd/system/hostapd.service.d/override.conf\n```\n\n```\n[Unit]\nBindsTo=sys-subsystem-net-devices-wlan0.device\nAfter=sys-subsystem-net-devices-wlan0.device\n```\n\nТакже убедитесь, что интерфейс не управляется другими менеджерами сети. Если вы используете NetworkManager, смотрите NetworkManager#Ignore specific devices.\n\nNote: **Не** \n\n"
    },
    {
      "title": "Конфигурация сети",
      "level": 3,
      "content": "Есть два основных способа реализации:\n\n1. bridge: создав сеть типа мост на своём компьютере (беспроводные клиенты будут подключаться для доступа к тому же сетевому интерфейсу и к той же подсети, которые используются на вашем компьютере)\n1. NAT: используя IP перенаправление/маскарадинг и DHCP сервис (беспроводные клиенты будут использовать выделенные подсети, данные от/до этих подсетей будут обработаны NAT -- подобно тому как это используется в обычном Wi-Fi роутере, который подключён по DSL или проводному модему)\n\nОбращаться с мостом проще, но он требует, чтобы любой сервис который нужен вашим беспроводным клиентам (вроде DHCP) был доступен на внешнем интерфейсе вашего компьютера. Это означает, что он не будет работать если у вас dial-up соединение (например, через PPPoE или 3G modem), или если вы используете проводной модем, который поддерживает всего один IP адрес до вас посредством DHCP.\n\nNAT более универсален, так как он явно разделяет Wi-Fi клиентов вашего компьютера и полностью проницаем наружу. Он будет работать с любым видом сетевого соединения, и (если необходимо) вы можете ввести политики использования трафика используя обычные методы iptables.\n\nКонечно, возможно скомбинировать оба способа. Для этого изучение обеих статей будет необходимым. Например, имея мост, связанный с ethernet-устройством и беспроводным устройством, имеющим статический ip и раздающий адреса при помощи DHCP, можно создать NAT настроенный на клонирование трафика на дополнительное сетевое устройство - это может быть ppp или ethernet.\n\n"
    },
    {
      "title": "Настройка моста",
      "level": 4,
      "content": "Вам необходимо создать сетевой \"мост\" и присоединить к нему свой интерфейс (например, eth0). Вам не следует добавлять к мосту беспроводной интерфейс (например, wlan0); hostapd добавит его самостоятельно.\n\nСмотри Network bridge.\n\n"
    },
    {
      "title": "Настройка NAT",
      "level": 4,
      "content": "Смотрите Раздача интернета для получения дополнительной информации.\n\nУчтите, что в той статье используется устройство net0 для подключения к локальной сети. В нашем случае в качестве его будет выступать беспроводное устройство (напр. wlan0).\n\n"
    },
    {
      "title": "linux-wifi-hotspot",
      "level": 3,
      "content": "Пакет linux-wifi-hotspotAUR включает в себя скрипт, который может создать точку доступа для раздачи интернета посредством моста/NAT. Он сочитает в себе hostapd, dnsmasq и iptables для создания точки доступа. Поддерживает интерфейс командной строки и графический интерфейс. Базовый синтаксис для создания виртуальной сети посредством NAT следующий:\n\n```\n# create_ap wlan0 eth0 MyAccessPoint MyPassPhrase\n```\n\nДругой подход с использованием шаблона конфигурации, который предложен в /etc/create_ap.conf, может быть адаптирован под ваши нужды и запущен со скриптом:\n\n```\n# create_ap --config /etc/create_ap.conf\n```\n\nЧтобы использовать графический интерфейс, запустите в терминале:\n\n```\n# wihotspot\n```\n\nВключите/запустите службу create_ap.service для запуска скрипта в момент загрузки системы с конфигурацией, описанной в /etc/create_ap.conf.\n\nПодробнее смотрите linux-wifi-hotspot на GitHub.\n\n"
    },
    {
      "title": "RADIUS",
      "level": 3,
      "content": "Смотрите [1][устаревшая ссылка 2024-03-03 ⓘ] инструкции для запуска сервера FreeRADIUS для WPA2 Enterprise.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "WLAN очень медленно работает",
      "level": 3,
      "content": "Частые причины более низкой, чем ожидалось, пропускной способности включают:\n\n- Неправильный режим работы с hw_mode ниже поддерживаемого может искусственно ограничивать маршрутизатор. Убедитесь, что выбран современный режим работы.\n- Переполненный или нагруженный другими шумами канал channel может сильно ухудшить производительность, особенно в густонаселенных областях. Попробуйте изменить канал или даже переключать частоты.\n- Это может быть вызвано наличием слабой энтропией. Попробуйте установить haveged.\n\n"
    },
    {
      "title": "Вмешательство NetworkManager",
      "level": 3,
      "content": "hostapd может не работать, если устройство управляется NetworkManager. Вы можете замаскировать устройство используя MAC:\n\n```\n/etc/NetworkManager/conf.d/unmanaged.conf\n```\n\n```\n[keyfile]\nunmanaged-devices=mac:hwaddr\n```\n\nЛибо имя интерфейса:\n\n```\n/etc/NetworkManager/conf.d/unmanaged.conf\n```\n\n```\n[keyfile]\nunmanaged-devices=interface-name:ifname\n```\n\n"
    },
    {
      "title": "Не удаётся запустить режим AP в диапазоне 5Ghz",
      "level": 3,
      "content": "По-видимому, со специальным кодом страны 00 (глобальный), все доступные частоты в диапазоне 5Ghz будут с установленным флагом no-ir (no-initiating-radiation), тем самым предотвратив hostapd использовать их. Вам понадобится установить wireless-regdb и выставить код вашей страны, чтобы hostapd стали доступны разрешённые в вашей стране частоты.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Hostapd : The Linux Way to create Virtual Wi-Fi Access Point (англ.)\n- руководство и скрипт для конфигурирования подсети с DHCP и DNS (англ.)\n\n"
    }
  ]
}