{
  "title": "Solo",
  "url": "https://wiki.archlinux.org/title/Solo",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Smartcards\n- Universal 2nd Factor\n\nThe Solo (or SoloKey) is a small USB security token supporting Universal 2nd Factor (U2F) requests, thus acting as a second factor for authentication. It also supports the newer FIDO2 standard allowing for passwordless logins.\n\nCompared to a YubiKey it offers less features, but supports firmware upgrades to extend the functionality in the future. The key-hardware and software are released as open source. The keys are distributed in different form factors and two versions: Solo V1 (STM32L432 chip) and Solo V2 (LPC55S69 chip).\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Special drivers are not required for the key to work. It is recommended to install the Solo software and upgrade the firmware of your Solo.\n\n"
    },
    {
      "title": "Upgrading the firmware",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nManaging your Solo V1, e.g. upgrading the firmware or setting a PIN, can be performed with the solo1AUR package. After installing the package, first check if your key is detected:\n\n```\n$ solo ls\n```\n\n```\n:: Solos\n123456XXXXXX: SoloKeys Solo 3.0.1\n```\n\nThen you can use solo key update to perform a firmware upgrade, solo key set-pin to set a PIN, and solo key change-pin to change your pin.\n\n"
    },
    {
      "title": "Test the Solo in your browser",
      "level": 3,
      "content": "Visit the Webauthn demo, type in a username and click on \"Register\". Your Solo's LED will flash until you click it. After that, you can login to the page only using your Solo, no need for username or password.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- SoloKeys Official Website\n- Solo Technical Documentation\n\n"
    }
  ]
}