{
  "title": "Som",
  "url": "https://wiki.archlinux.org/title/Som",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Esse artigo é sobre gerenciamento básico de som. Para tópicos avançados, veja áudio profissional.\n\n"
    },
    {
      "title": "Informações gerais",
      "level": 2,
      "content": "O sistema de som do Arch consiste em vários níveis:\n\n- Drivers e interface – suporte e controle de hardware\n- API (bibliotecas) de modo de usuário – utilizado e exigido por aplicativos\n- (opcional) Servidores de som de modo de usuário – melhor para desktop complexos, necessário para vários apps de áudio simultâneos e vital para as capacidades mais avançadas, por exemplo, áudio pro\n- (opcional) Frameworks de som – ambientes de aplicativos de alto nível não envolvendo processos de servidor\n\nUma instalação padrão do Arch já inclui o sistema de som do kernel (ALSA), e muitos utilitários para ele podem ser instalados a partir dos repositórios oficiais. Se você quiser recursos adicionais, pode alternar para OSS ou instalar um dos vários servidores de som.\n\n"
    },
    {
      "title": "Drivers e interface",
      "level": 2,
      "content": "- ALSA — Um componente do kernel do Linux que fornece drivers de dispositivo e suporte de nível mais baixo para hardware de áudio.\n\n- Open Sound System (OSS) — Uma arquitetura de som alternativa para sistemas compatíveis com Unix e POSIX. O OSS versão 3 foi o sistema de som original para Linux e está no kernel, mas foi substituído pelo ALSA em 2002, quando o OSS versão 4 se tornou software proprietário. O OSSv4 tornou-se software livre novamente em 2007, quando a 4Front Technologies divulgou seu código-fonte e o forneceu sob a GPL. O OSS não possui suporte a uma variedade tão grande de hardware como o ALSA, mas é melhor para alguns.\n\n"
    },
    {
      "title": "Servidores de som",
      "level": 2,
      "content": "- PulseAudio — Um servidor de som muito popular, utilizável pela maioria dos aplicativos de desktop comuns hoje em dia. Muito bom em lidar com várias entradas simultâneas e também pode fazer áudio de rede. Muito fácil de começar a trabalhar, na verdade, muitas vezes tudo o que tem a fazer é instalar o pacote e ele será executado automaticamente. Não destinado a aplicativos pro audio de baixa latência.\n\n- JACK Audio Connection Kit — A edição mais antiga de um servidor de som para uso profissional de áudio, especialmente para aplicativos de baixa latência, incluindo gravação, efeitos, síntese em tempo real e muitos outros. Embora esta edição seja a mais antiga, ela mantém uma equipe de desenvolvimento muito ativa e dedicada, e a edição a ser usada não é clara, a tentativa e o erro geralmente são úteis.\n\n- JACK2 — Esta é a edição mais recente do JACK, projetada explicitamente para sistemas multiprocessados e também inclui transporte pela rede.\n\n- Network Audio System — Este é um servidor de som suportado por alguns dos principais aplicativos.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- MIDI\n- Codecs\n- Áudio profissional\n- PC speaker\n\n"
    }
  ]
}