{
  "title": "Sound server (Español)",
  "url": "https://wiki.archlinux.org/title/Sound_server_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-01** \n\nArtículos relacionados\n\n- MIDI\n- Codecs\n- Audio profesional\n- Altavoz de PC\n\nEste artículo trata sobre la gestión básica del sonido. Para cuestiones más avanzadas, véase professional audio.\n\n"
    },
    {
      "title": "Información general",
      "level": 2,
      "content": "El sistema de sonido de Arch consta de varios niveles:\n\n- Controladores e interfaz—control y soporte del hardware\n- APIs de modo de usuario (librerías)—utilizadas y requeridas por los programas\n- (opcional) Servidores de sonido en modo usuario—lo mejor para un escritorio complejo, necesario para múltiples programas de audio simultáneos, y fundamental para propiedades más avanzadas, como, por ejemplo, el audio profesional\n- (opcional) Frameworks de sonido—entornos de aplicación de alto nivel que no involucran procesos de servidor\n\nUna instalación por defecto de Arch ya incluye el sistema de sonido del kernel (ALSA), y muchas utilidades para el mismo pueden ser instaladas a través de los repositorios oficiales. Si desea disponer de características adicionales, puede instalar uno de los diversos servidores de sonido.\n\n"
    },
    {
      "title": "Controladores e interfaz",
      "level": 2,
      "content": "- ALSA — El componente por defecto del kernel de Linux que proporciona controladores de dispositivos y soporte de bajo nivel para el hardware de audio.\n\n- OSS — Una arquitectura de sonido alternativa para sistemas tipo Unix y compatibles con POSIX que ha sido reemplazado por ALSA debido a un cambio de licencia, pero se abrió en 2007.\n\n"
    },
    {
      "title": "Servidores de sonido",
      "level": 2,
      "content": "- JACK Audio Connection Kit — Servidor de sonido para uso profesional, especialmente para aplicaciones de baja latencia, incluyendo grabación, efectos, síntesis en tiempo real, y muchas otras.\n\n- Network Audio System — Un sistema de transporte de audio cliente-servidor de código abierto y transparente para la red.\n\n- PipeWire — Framework multimedia que pretende sustituir a PulseAudio y JACK. Soporta contenedores como Flatpak.\n\n- PulseAudio — Sistema de sonido de propósito general destinado al audio sin necesidad de configuración. Permite múltiples entradas simultáneas, puede manejar configuraciones complejas, y es compatible con la red.\n\n"
    }
  ]
}