{
  "title": "SpaceFM (Русский)",
  "url": "https://wiki.archlinux.org/title/SpaceFM_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Функциональность файлового менеджера\n- PCManFM (Русский)\n- Оконный менеджер\n\nSpaceFM (форк PCManFM) — это лёгкий, очень настраиваемый, десктоп-независимый, мультипанельный менеджер файлов c поддержкой вкладок и управления рабочим столом. Имеет виртуальную файловую систему, диспетчер устройств udev, настраиваемую систему меню и интеграцию bash.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет spacefmAUR.\n\nЕсли же вы хотите использовать версию на GTK 2, используйте пакет spacefm-gtk2AUR.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Смотрите Пользовательскую документацию (En).\n\n"
    },
    {
      "title": "Поиск файлов",
      "level": 3,
      "content": "В SpaceFM есть встроенный поиск файлов похожий на catfish:\n\n```\n$ spacefm -f\n```\n\n"
    },
    {
      "title": "Управление рабочим столом",
      "level": 3,
      "content": "SpaceFM включает в себя легкий менеджер рабочего стола. [1]. Он заменяет меню рабочего стола, добавляет значки на рабочем столе и устанавливает обои.\n\nЧтобы вернуть родное меню используемого вами оконного менеджера, откройте настройки рабочего стола:\n\n```\n$ spacefm --desktop-pref\n```\n\nи включите опцию Меню диспетчера окон по правому щелчку во вкладке Рабочий стол. Для быстрого доступа к настройкам рабочего стола можно создать сочетание клавиш для этой команды или добавить её в родное меню оконного менеджера.\n\nДля запуска SpaceFM в качестве демона без управления рабочим столом [2], воспользуйтесь:\n\n```\n$ spacefm -d\n```\n\nКак именно SpaceFM может быть автоматически запущен в качестве процесса-демона или для управления рабочим столом для автономного оконного менеджера, зависит от самого́ оконного менеджера. Если оконный менеджер не предоставляет возможность автозапуска, отредактируйте xinitrc или xprofile.\n\n"
    },
    {
      "title": "Монтирование удалённых хостов",
      "level": 3,
      "content": "SpaceFM поддерживает монтирование удалённых хостов udevil. Чтобы добавить удаленный хост, добавьте URL доступа в адресной строке. Должно всплыть окно терминала, показывающее процесс монтирования (это полезно для отслеживания ошибок).\n\nОбзор поддерживаемых удаленных хостов доступен в udevil help. Например, чтобы монтировать удалённый FTP сервер:\n\n```\nftp://user:pass@sys.domain/share\n```\n\n"
    },
    {
      "title": "Открыть архив приложением вместо распаковывания",
      "level": 3,
      "content": "По умолчанию, SpaceFM настроен на извлечение архива по двойному щелчку по нём. Если вы хотите открывать архив программой по умолчанию, такой как file-roller, тогда выберите архив, щелкните правой кнопкой мыши, в контекстном меню выберите: Открыть > По умолчанию для архива > Открыть с помощью.\n\n"
    },
    {
      "title": "Показать пользовательскую команду контекстного меню только на определённых файлах / папках",
      "level": 3,
      "content": "Если вы хотите использовать команду в пользовательском меню, которое должно быть показано только при выборе файлов или папок, добавьте следующие правила в окне Свойства элемента меню > Контекст:\n\n```\nMIME Type equals true\nFile Is Dir equals true\nFile Is Text equals true\n```\n\n"
    },
    {
      "title": "Не меняется размер колонок",
      "level": 3,
      "content": "Это встречалось только в первых версиях SpaceFM (GTK 2). [3]\n\n"
    },
    {
      "title": "Ошибки сегментации",
      "level": 3,
      "content": "Если SpaceFM падает с ошибками, например:\n\n```\nlocalhost kernel: [245086.687050] spacefm[30684]: segfault at 3e8000003e8 ip 00007fc95c586866 sp 00007fffb1dc9cc0 error 4 in libgtk-x11-2.0.so.0.2400.24[7fc95c446000+435000]\n```\n\nSpaceFM использует различные элементы интерфейса, и, таким образом, чтобы изменить восприимчивую к неисправности тему (особенно в GTK 3). Попробуйте другую тему, например Raleigh (тема по умолчанию). Для этого в SpaceFM (только для GTK 2):\n\n```\nGTK2_RC_FILES=/usr/share/themes/Raleigh/gtk-2.0/gtkrc spacefm\n```\n\nСмотрите [4] для подробностей.\n\n"
    }
  ]
}