{
  "title": "Speech Recognition (日本語)",
  "url": "https://wiki.archlinux.org/title/Speech_Recognition_(%E6%97%A5%E6%9C%AC%E8%AA%9E)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "インターネット – マルチメディア – ユーティリティ – ドキュメント – セキュリティ – サイエンス – その他\n\n"
    },
    {
      "title": "目次",
      "level": 2,
      "content": "- 1 その他 1.1 Organization 1.1.1 Personal information managers 1.1.2 Time management 1.1.2.1 コンソール 1.1.2.2 グラフィカル 1.1.3 Timers 1.1.3.1 Countdown timers and stopwatch 1.1.3.2 Break timers 1.1.3.3 Pomodoro timers 1.1.4 Time trackers 1.1.5 Task management 1.1.5.1 コンソール 1.1.5.2 グラフィカル 1.1.6 Contacts management 1.1.6.1 Console 1.1.6.2 Graphical 1.1.7 ファイナンス 1.1.7.1 Console 1.1.7.2 Graphical 1.1.8 暗号通貨 1.1.9 プロジェクト管理 1.1.10 レシピ管理 1.2 教育 1.2.1 フラッシュカード 1.2.2 タッチタイピング 1.2.2.1 コンソール 1.2.2.2 グラフィカル 1.3 アクセシビリティ 1.3.1 Speech synthesizers 1.3.2 音声認識 1.3.3 Screen magnifiers 1.3.4 On-screen annotation 1.3.5 マウス 1.4 Display managers 1.5 デスクトップ環境 1.5.1 ウィンドウマネージャ 1.5.1.1 コンソール 1.5.1.2 グラフィカル 1.5.1.3 コンポジットマネージャ 1.5.2 Wayland Compositors 1.5.3 ウィンドウタイル 1.5.4 タスクバー 1.5.5 System tray 1.5.6 アプリケーションランチャー 1.5.7 アプリケーションメニューエディタ 1.5.8 壁紙設定 1.5.9 仮想デスクトップのページャ 1.5.10 デスクトップウィジェット 1.5.11 デスクトップ通知 1.5.12 クリップボードマネージャ 1.5.13 ログアウト UI\n\n- 1.1 Organization 1.1.1 Personal information managers 1.1.2 Time management 1.1.2.1 コンソール 1.1.2.2 グラフィカル 1.1.3 Timers 1.1.3.1 Countdown timers and stopwatch 1.1.3.2 Break timers 1.1.3.3 Pomodoro timers 1.1.4 Time trackers 1.1.5 Task management 1.1.5.1 コンソール 1.1.5.2 グラフィカル 1.1.6 Contacts management 1.1.6.1 Console 1.1.6.2 Graphical 1.1.7 ファイナンス 1.1.7.1 Console 1.1.7.2 Graphical 1.1.8 暗号通貨 1.1.9 プロジェクト管理 1.1.10 レシピ管理\n- 1.2 教育 1.2.1 フラッシュカード 1.2.2 タッチタイピング 1.2.2.1 コンソール 1.2.2.2 グラフィカル\n- 1.3 アクセシビリティ 1.3.1 Speech synthesizers 1.3.2 音声認識 1.3.3 Screen magnifiers 1.3.4 On-screen annotation 1.3.5 マウス\n- 1.4 Display managers\n- 1.5 デスクトップ環境 1.5.1 ウィンドウマネージャ 1.5.1.1 コンソール 1.5.1.2 グラフィカル 1.5.1.3 コンポジットマネージャ 1.5.2 Wayland Compositors 1.5.3 ウィンドウタイル 1.5.4 タスクバー 1.5.5 System tray 1.5.6 アプリケーションランチャー 1.5.7 アプリケーションメニューエディタ 1.5.8 壁紙設定 1.5.9 仮想デスクトップのページャ 1.5.10 デスクトップウィジェット 1.5.11 デスクトップ通知 1.5.12 クリップボードマネージャ 1.5.13 ログアウト UI\n\n- 1.1.1 Personal information managers\n- 1.1.2 Time management 1.1.2.1 コンソール 1.1.2.2 グラフィカル\n- 1.1.3 Timers 1.1.3.1 Countdown timers and stopwatch 1.1.3.2 Break timers 1.1.3.3 Pomodoro timers\n- 1.1.4 Time trackers\n- 1.1.5 Task management 1.1.5.1 コンソール 1.1.5.2 グラフィカル\n- 1.1.6 Contacts management 1.1.6.1 Console 1.1.6.2 Graphical\n- 1.1.7 ファイナンス 1.1.7.1 Console 1.1.7.2 Graphical\n- 1.1.8 暗号通貨\n- 1.1.9 プロジェクト管理\n- 1.1.10 レシピ管理\n\n- 1.1.2.1 コンソール\n- 1.1.2.2 グラフィカル\n\n- 1.1.3.1 Countdown timers and stopwatch\n- 1.1.3.2 Break timers\n- 1.1.3.3 Pomodoro timers\n\n- 1.1.5.1 コンソール\n- 1.1.5.2 グラフィカル\n\n- 1.1.6.1 Console\n- 1.1.6.2 Graphical\n\n- 1.1.7.1 Console\n- 1.1.7.2 Graphical\n\n- 1.2.1 フラッシュカード\n- 1.2.2 タッチタイピング 1.2.2.1 コンソール 1.2.2.2 グラフィカル\n\n- 1.2.2.1 コンソール\n- 1.2.2.2 グラフィカル\n\n- 1.3.1 Speech synthesizers\n- 1.3.2 音声認識\n- 1.3.3 Screen magnifiers\n- 1.3.4 On-screen annotation\n- 1.3.5 マウス\n\n- 1.5.1 ウィンドウマネージャ 1.5.1.1 コンソール 1.5.1.2 グラフィカル 1.5.1.3 コンポジットマネージャ\n- 1.5.2 Wayland Compositors\n- 1.5.3 ウィンドウタイル\n- 1.5.4 タスクバー\n- 1.5.5 System tray\n- 1.5.6 アプリケーションランチャー\n- 1.5.7 アプリケーションメニューエディタ\n- 1.5.8 壁紙設定\n- 1.5.9 仮想デスクトップのページャ\n- 1.5.10 デスクトップウィジェット\n- 1.5.11 デスクトップ通知\n- 1.5.12 クリップボードマネージャ\n- 1.5.13 ログアウト UI\n\n- 1.5.1.1 コンソール\n- 1.5.1.2 グラフィカル\n- 1.5.1.3 コンポジットマネージャ\n\n"
    },
    {
      "title": "Personal information managers",
      "level": 4,
      "content": "These applications support time, task and contacts management.\n\n- Evolution — Personal information management application that provides integrated mail, calendaring and address book functionality. Part of gnome-extra.\n\n- Kontact — Integrated solution to your personal information management.\n\n- Osmo — GTK パーソナルオーガナイザ。カレンダー、タスク管理、アドレス帳のモジュールを含む。\n\n- SeaMonkey Mail & Newsgroups with Lightning — Extension to SeaMonkey that provides calendar and task support.\n\n- Thunderbird with Lightning — カレンダーとタスクを加える Mozilla Thunderbird 拡張。\n\n"
    },
    {
      "title": "Time management",
      "level": 4,
      "content": "- Calcurse — テキストベースの ncurses カレンダー・スケジューリングシステム。(supports CalDAV)\n\n- ccal — A console program which writes a calendar together with Chinese calendar to standard output.\n\n- khal — Command-line (non-interactive) and ncurses (interactive) calendar system (supports CalDAV)\n\n- mail2rem — Maildir から Remind カレンダーに .ics カレンダーをインポートするための小さなスクリプト。\n\n- Pal — インタラクティブなインターフェースとそうでないインターフェースを持つとても軽量なカレンダー。\n\n- pcal — A tool to create pdf calendars from pcal input which can be exported by some calendar programs.\n\n- Remind — 高度に洗練されたテキストベースのカレンダー・通知システム。\n\n- When — シンプルなパーソナルカレンダープログラム。\n\n- Wyrd — UNIX や Linux コンピュータで使われるカレンダー・アラームプログラムの Remind のテキストベースのフロントエンド。\n\n- chinese-calendar — Chinese traditional calendar for Ubuntu Kylin.\n\n- CoreTime — Very simple Clock/Calendar application which shows a clock, supports alarms, reminders, a stop watch and a timer. Part of C-Suite.\n\n- Day Planner — 時間の管理や予定作成を助けるプログラム。アポイントや誕生日などを管理できます。\n\n- Deepin Calendar — Calendar application for Deepin.\n\n- etmtk (Event and Task Manager) — \"Getting Things Done!\" アプローチによってイベント・タスク・活動・リマインダー・プロジェクトなどを管理するシンプルなアプリケーション。\n\n- Gahshomar — Persian (Jalali/Farsi) calendar.\n\n- GNOME Calendar — GNOME のカレンダーアプリケーション。\n\n- KAlarm — Personal alarm message, command and email scheduler, part of kdepim[リンク切れ: package not found].\n\n- KOrganizer — カレンダー・スケジューリングプログラム, part of kdepim[リンク切れ: package not found].\n\n- Kalendar — A calendar application using Akonadi to sync with external services (NextCloud, GMail, ...).\n\n- Nextcloud Calendar — Calendar app for Nextcloud.\n\n- Outspline — 高度な時間管理機能がある拡張性に優れたアウトライナー。複雑に発生するイベントをサポート。\n\n- Pantheon Calendar — Desktop calendar app designed for elementary OS.\n\n- TkRemind — 洗練されたカレンダー・アラームプログラム。\n\n"
    },
    {
      "title": "Timers",
      "level": 4,
      "content": "- GNOME Clocks — GNOME の時計アプリケーション, including alarm, stopwatch and timer functionality.\n\n- Hourglass — Simple time keeping application designed for elementary OS.\n\n- Kronometer — Stopwatch application for KDE.\n\n- KTeaTime — Handy timer for steeping tea.\n\n- pystopwatch — Stopwatch written in Python with a clock and two countdown functions that can minimize to the tray.\n\n- termdown — Countdown timer and stopwatch in your terminal.\n\n- GNOME Break Timer — コンピュータの使用時間を記録して、定期的に休憩を促すプログラム。\n\n- RSI Break — Takes care of your health and regularly breaks your work to avoid repetitive strain injury (RSI).\n\n- Safe Eyes — Tool to reduce and prevent repetitive strain injury (RSI).\n\n- Workrave — RSI を補助するツール。\n\nSee Wikipedia:Pomodoro Technique for an introduction.\n\n- flow — Pomodoro app that blocks distractions while you work.\n\n- Gnomato — Timer for the Pomodoro Technique.\n\n- GNOME Pomodoro — Time management utility for GNOME based on the Pomodoro Technique.\n\n- Pilorama — Eye-candy timeboxing tool written in QML\n\n- Pomodoro-Logger — Pomodoro timer and logger with Kanban board for task management and tracking.\n\n- Solanum — A pomodoro timer for the GNOME desktop\n\n- Tomate — Timer for the Pomodoro Technique.\n\n- Tomato — Simple, usable and efficient pomodoro app designed for elementaryOS.\n\n- Tomighty — Desktop timer for the Pomodoro Technique.\n\n"
    },
    {
      "title": "Time trackers",
      "level": 4,
      "content": "- ActivityWatch — A self/local-hosted, cross-platform, client-server, privacy-focused active window tracker.\n\n- Hamster — 一日のアクティビティにどれくらい時間がかかったかを記録するタイムトラッキングアプリケーション。\n\n- Kapow — Punch clock to track time spent on projects.\n\n- KTimeTracker — Todo management and time tracking application.\n\n- Tider — 軽量なタイムトラッキングアプリケーション (GTK)。\n\n- Timenaut — Time tracker that tracks active windows and lets you sort them into categories. Based on the Electron platform.\n\n- Timewarrior — A command-line time-tracking application.\n\n- Timetrack — Simple time-tracking app for GNOME.\n\n- Wakatime — Open source plugins for metrics about your programming with intuitive web-interface.\n\n"
    },
    {
      "title": "Task management",
      "level": 4,
      "content": "- DevTodo — タスクリストを管理するための小さなコマンドラインアプリケーション。\n\n- Taskbook — Tasks, boards & notes for the command-line habitat.\n\n- Taskwarrior — lua によるカスタマイズ性その他をサポートするコマンドラインの To-do リストアプリケーション。\n\n- todoman — Command-line To-do list manager (supports CalDAV)\n\n- Todo.txt — 小さなコマンドライン To-do マネージャ。\n\n- TuDu — Vimの様なキーバインドを備えた Ncurses ベースの階層的な To-do リストマネージャ。\n\n- Agenda — Simple, fast, no-nonsense to-do (task) list for elementary OS.\n\n- Effitask — Graphical task manager, based on the Todo.txt format.\n\n- Getting Things GNOME! — GNOME デスクトップ向けのパーソナルタスク・To-do リスト管理アプリケーション inspired by the Getting Things Done (GTD) methodology.\n\n- Go For It! — Simple and stylish productivity app, featuring a to-do list, merged with a timer that keeps your focus on the current task. To-do lists are stored in the Todo.txt format.\n\n- GNOME To Do — Personal task manager for GNOME.\n\n- Nextcloud Tasks — Tasks app for Nextcloud.\n\n- Planner — Task manager with Todoist support.\n\n- ptask — GTK task manager based on Taskwarrior.\n\n- QTodoTxt — todo.txt ファイルの UI クライアント。\n\n- sleek — todo.txt app with modern GUI. Based on the Electron platform.\n\n- Task Coach — パーソナルタスクと To-do リストを管理するシンプルな To-do マネージャ。\n\n- Tasque — Easy quick task management app written in C#.\n\n- Zanshin — To-do management application for KDE.\n\n"
    },
    {
      "title": "Contacts management",
      "level": 4,
      "content": "- Abook — Text-based contacts manager designed for use with mutt.\n\n- Khard — Command-line addressbook that is able to sync with CardDAV-servers.\n\n- Communicator — Integrated address book and dialer application features the search for and view of contacts, edit contact details, and make new contacts, favorites, and dialer pad.\n\n- GNOME Contacts — Contacts manager for GNOME.\n\n- KAddressBook — Address book manager for KDE.\n\n- LDAP Administration Tool — Browse LDAP-based directories and add/edit/delete entries contained within.\n\n- Nextcloud Contacts — Contacts app for Nextcloud.\n\n- phpLDAPadmin — LDAP client webapp. Its hierarchical tree-viewer and advanced search functionality make it intuitive to browse and administer your LDAP directory.\n\n- Thunderbird with CardBook extension — address book based on the CardDAV and vCard standards.\n\n"
    },
    {
      "title": "ファイナンス",
      "level": 4,
      "content": "See also Wikipedia:Comparison of accounting software.\n\n- Beancount — 金融取引記録をテキスト ファイルで定義し、メモリ内で読み取り、そこからさまざまなレポートを生成し、Web インターフェイスを提供できる複式簿記のコンピューター言語。\n\n- esniper — eBay オークションでスナイプするためのシンプルで軽量なツール。\n\n- hledger — 複式簿記を使ってお金や時間、商品を追跡するための会計プログラム。シンプルで編集しやすいファイルフォーマットを使います。Ledger と互換性があります。\n\n- Ledger — Ledger はパワフルな、複式記帳法の会計システムで、UNIX コマンドラインからアクセスします。\n\n- BillReminder — Small and quick accounting application designed to allow for easy tracking of bills.\n\n- Eqonomize! — Cross-platform personal accounting software, with focus on efficiency and ease of use for the small household economy.\n\n- GnuCash — 複式簿記システムを実装した小さなビジネスの会計向けのファイナンスアプリケーション。\n\n- Grisbi — パーソナルファイナンスシステム。サードパーティ・支出・レシートのカテゴリと予算・会計年度など組織の運営に役立つ情報を管理します。\n\n- HomeBank — パワフルなフィルタリングツールやグラフでお金の使い道を分析できる使いやすいファイナンスマネージャ。\n\n- KMyMoney — Microsoft Money に似たパーソナルファイナンスマネージャ。収入と支出のカテゴリ分配や銀行口座の調整、“QIF” ファイルフォーマットのインポート・エクスポートをサポート。\n\n- Kresus — セルフホスト型の個人財務管理ソフトウェア。毎日、すべての新しい銀行取引を自動的に取得し、それらを分類し、チャートで調査し、予算を設定することができます。\n\n- Manager — 中小企業向けのプロプライエタリ会計ソフトウェア。\n\n- Money Manager EX — 使いやすい個人用ファイナンススイート。\n\n- Odoo — 純粋に python で作られたオープンソースの ERP システム。以前は OpenERP として知られていました。\n\n- Skrooge — KDE デスクトップ向けのパーソナルファイナンスマネージャ。\n\n"
    },
    {
      "title": "暗号通貨",
      "level": 4,
      "content": "- ARK デスクトップウォレット — ARK 用のウォレット。\n\n- Atomic ウォレット — Bitcoin、Ethereum、XRP、Litecoin、XLM、その他300以上のコインとトークンを管理。\n\n- Bitcoin Core — Bitcoin P2Pネットワークに接続。\n\n- Cake ウォレット — マルチ通貨ウォレット。\n\n- Sparrow ウォレット — 高度なBitcoinクライアント。\n\n- Coinomi — Bitcoin、Ethereum、その他1,770以上のブロックチェーン資産を安全に保管、管理、交換。\n\n- Cointop — 暗号通貨を追跡するためのターミナルベースのアプリケーション。\n\n- Electrum — 軽量なBitcoinクライアント。\n\n- Etherwall — Ethereumウォレット。\n\n- Exodus — ブロックチェーン資産を安全に保管、管理、交換するための統合型プロプライエタリアプリケーション。Electronプラットフォームベース。\n\n- Mist — Ethereum Dappブラウザ。\n\n- Monero — Moneroウォレット。\n\n- Feather ウォレット — 軽量Moneroウォレット。\n\n- Dogecoin Core — Dogecoin Coreウォレット、Dogecoin P2Pネットワークへの接続を可能にする。\n\n"
    },
    {
      "title": "プロジェクト管理",
      "level": 4,
      "content": "Wikipedia:ja:プロジェクト管理ツールの比較 も参照してください。\n\n- Calligra Plan — 複数のリソースを使用して中規模のプロジェクトを管理することを目的としたプロジェクト管理アプリケーション。\n\n- GanttProject — ガントチャート、リソース管理、カレンダー機能を備えたプロジェクトスケジューリングアプリケーション。\n\n- Planner — GNOME 用のプロジェクト管理アプリケーション。\n\n- ProjectLibre — Microsoft Project の代替となるプロジェクト管理ソフトウェア。\n\n- TaskJuggler — モダンで強力なプロジェクト管理ツール。その新しいプロジェクト計画および追跡アプローチは、一般的に使用されているガントチャート編集ツールよりも柔軟で優れています。\n\n"
    },
    {
      "title": "レシピ管理",
      "level": 4,
      "content": "- GNOME Recipes — GNOME 用のレシピ管理アプリケーション。\n\n- Gourmand — シンプルでありながら強力なレシピ管理アプリケーション。\n\n- KRecipes — 個人のレシピコレクションを素早く簡単に整理するために設計された KDE アプリケーション。\n\n"
    },
    {
      "title": "教育",
      "level": 3,
      "content": "See also ゲーム一覧#教育.\n\n- Moodle — オープンソースの学習管理システム。\n\n- OpenBoard — Interactive whiteboard software for schools and universities.\n\n"
    },
    {
      "title": "フラッシュカード",
      "level": 4,
      "content": "See also Wikipedia:List of flashcard software.\n\n- Anki — 物事を記憶するのを楽にするプログラム。\n\n- jVLT — Vocabulary learning tool.\n\n- KWordQuiz — Tool that gives you a powerful way to master new vocabularies. Part of kde-education.\n\n- Mnemosyne — 学習を最適化するフラッシュカードツール。\n\n- Parley — Program to help you memorize things. It uses the spaced repetition learning method, also known as flash cards. Part of kde-education.\n\n- Pauker — Flash card based learning tool using shortterm and longterm memory training.\n\n- OpenTeacher — Open source application that helps you learn a variety of subjects\n\n- StudyFlash — Learn flashcards inside your terminal\n\n"
    },
    {
      "title": "タッチタイピング",
      "level": 4,
      "content": "- Dvorak 7min — Dvorak キーボードレイアウトに慣れるためのシンプルな ncurses ベースのタイピングチューター。\n\n- GNU Typist — 汎用のタイピングチューター。\n\n- psani-profi — タッチタイピングを教えるプログラム（チェコ語）。\n\n- Typing Trainer — 英語とハンガリー語に対応した ncurses ベースのタイピングトレーナープログラム。\n\n- Typespeed — タイピング速度をテストし、指の CPS（秒間入力数）を測定します。\n\n- typiskt — ターミナル（Bash）でのタッチタイピングトレーニング。\n\n- Amphetype — 画面上のキーボードを必要としないが、速度と精度を向上させたい人向けのレイアウト非依存のタイピングプログラム。\n\n- Klavaro — キーボードや言語に依存しないタッチタイピングを教えるプログラム。\n\n- KTouch — タッチタイピングを学び、練習するためのプログラム。kde-education の一部。\n\n- TIPP10 — インテリジェントなタッチタイピングチューター。\n\n- TypingTest — 多くのカスタマイズが可能なタイピングテストデスクトッププログラム。\n\n"
    },
    {
      "title": "アクセシビリティ",
      "level": 3,
      "content": "See アクセシビリティ for tips on operating the desktop and Category:アクセシビリティ for all available articles. See also On-screen keyboards.\n\n"
    },
    {
      "title": "Speech synthesizers",
      "level": 4,
      "content": "See also Wikipedia:Comparison of speech synthesizers and listening comparison of the different engines.\n\n- Ekho — Chinese text-to-speech (TTS) software for Cantonese, Mandarin, Zhaoan Hakka, Tibetan, Ngangien and Korean.\n\n- eSpeak — Compact speech synthesizer for more than 50 languages.\n\n- eSpeak NG — Fork of eSpeak (due to inactivity of original maintainer).\n\n- Festival — General framework for building speech synthesis systems as well as including examples of various modules. As a whole it offers full text to speech.\n\n- Flite — Lightweight speech synthesis engine.\n\n- Gespeaker — GTK frontend for espeak. It allows you to play a text in many languages with settings for voice, pitch, volume and speed.\n\n- KMouth — Speech synthesizer frontend which enables persons that cannot speak to let their computer speak.\n\n- MaryTTS — Multilingual text-to-speech synthesis platform written in Java.\n\n- MBROLA — Proprietary phonemes-to-audio program which supports more than 70 languages. Mbrola-voices can also be used with eSpeak.\n\n- Mimic — Mycroft プロジェクトの音声合成システム(based on Flite)。\n\n- Open JTalk — Japanese text-to-speech synthesis system.\n\n- Orca — 視力がない人のためのスクリーンリーダー, using eSpeak (via Speech Dispatcher).\n\n- RHVoice — Cross-platform (including Android) text-to-speech from a blind Russian-speaking developer, based on HTS (ru, ka, uk, ky, tt, en, pt, eo)\n\n- SOPS — Orca スクリーンリーダーのプラグイン拡張。\n\n- Speech Dispatcher — Common interface to speech synthesis. It has backends for eSpeak, Festival, and a few other speech synthesizers.\n\n- SVOX Pico — The text-to-speech engine used on Android phones. (en-US, en-GB, de-DE, es-ES, fr-FR, it-IT)\n\n"
    },
    {
      "title": "音声認識",
      "level": 4,
      "content": "See also Wikipedia:Speech recognition software for Linux.\n\n- Blather — Speech recognizer that will run commands when a user speaks preset commands, uses PocketSphinx.\n\n- Julius — Large vocabulary continuous speech recognition engine.\n\n- Kaldi — Speech recognition toolkit.\n\n- Kalliope — Modular always-on voice controlled personal assistant designed for home automation.\n\n- Kaylee — Somewhat fancy voice command recognition program that performs actions when a user speaks loosely preset sentences.\n\n- Mycroft — Hackable voice assistant.\n\n- Simon — Speech recognition program that can replace your mouse and keyboard.\n\n- nerd-dictation — Light weight manually activated dictation using the VOSK-API\n\n"
    },
    {
      "title": "Screen magnifiers",
      "level": 4,
      "content": "- KMag — Small KDE utility to magnify a part of the screen.\n\n- Magnus — Very simple desktop magnifier, showing the area around the mouse pointer in a separate window magnified two, three, four, or five times.\n\n- Virtual Magnifying Glass — Simple, customizable and easy-to-use screen magnification tool.\n\n- xzoom — Zoom, rotate and mirror area of X display.\n\n"
    },
    {
      "title": "On-screen annotation",
      "level": 4,
      "content": "- Gromit-MPX — Tool to make annotations on the screen.\n\n- Pylote — Tool to draw on the screen.\n\n- Screenkey — Tool to display pressed keys.\n\n"
    },
    {
      "title": "マウス",
      "level": 4,
      "content": "- Easystroke — マウスジェスチャーを使用してコマンドやホットキーを起動します。\n\n- KMouseTool — マウスカーソルが少し停止すると、マウスをクリックします。ボタンを押すのが痛い反復性ストレス障害の人々を支援するために設計されました。\n\n- Mousetweaks — ポインティングデバイス向けのアクセシビリティ強化機能。\n\n"
    },
    {
      "title": "Display managers",
      "level": 3,
      "content": "See the main article: ディスプレイマネージャ#ディスプレイマネージャ一覧.\n\n"
    },
    {
      "title": "デスクトップ環境",
      "level": 3,
      "content": "See the main article: デスクトップ環境#デスクトップ環境の一覧.\n\n"
    },
    {
      "title": "ウィンドウマネージャ",
      "level": 4,
      "content": "See also アプリケーション一覧/ユーティリティ#Terminal multiplexers, which offer some of the functions of window managers for the console.\n\n- twin — テキストモード・ウィンドウマネージャ。\n\n- Wmutils — A set of tools for X windows manipulation.\n\nSee the main article: ウィンドウマネージャ#ウィンドウマネージャ一覧.\n\nSee the main article: Xorg#コンポジット.\n\n"
    },
    {
      "title": "Wayland Compositors",
      "level": 4,
      "content": "See the main article: Wayland#Compositors.\n\n"
    },
    {
      "title": "ウィンドウタイル",
      "level": 4,
      "content": "- QuickTile — Compiz Grid プラグインの代わりになる軽量なスタンドアロンプログラム。\n\n- wumwum — ウィンドウマネージャマネージャ。emwh 準拠のウィンドウマネージャをタイル型ウィンドウマネージャに変えます。\n\n"
    },
    {
      "title": "タスクバー",
      "level": 4,
      "content": "See also Wikipedia:Taskbar.\n\n- Avant Window Navigator — 画面の下に表示される軽量なドック。\n\n- Bmpanel — 軽量な、NETWM 準拠のパネル。\n\n- Cairo-Dock — 細かくカスタマイズできるドックとランチャー。\n\n- CoreAction — Side bar with some handy gadgets like system loads, calendar, calculator, notes etc. Part of C-Suite.\n\n- Dash to Panel — A fully customizable icon taskbar for gnome-shell. Moves the dash into the GNOME main panel, similar to KDE Plasma and Windows 10.\n\n- Docky — フル機能のドックアプリケーション。通常のアプリケーションを開きウィンドウを簡単に素早く管理します。\n\n- fbpanel — 軽量な、NETWM 準拠のデスクトップパネル。\n\n- GNOME Panel — GNOME Flashback デスクトップに含まれているパネル。\n\n- Latte — Dock based on Plasma frameworks that provides an elegant and intuitive experience for your tasks and plasmoids.\n\n- Lemonbar — A featherweight bar based on XCB. Provides UTF-8 support, background and foreground colors, text alignment, and not much more.\n\n- LXPanel — LXDE デスクトップの軽量 X11 デスクトップパネル。\n\n- MATE Panel — MATE デスクトップに含まれているパネル。\n\n- nwg-dock — GTK-based dock designed for the Sway window manager.\n\n- nwg-panel — GTK-based panel designed for the Sway window manager.\n\n- PerlPanel — OpenBox などの軽量なウィンドウマネージャや、iDesk などのデスクトップ描写プログラムに最適なパネル。\n\n- Plank — Pantheon デスクトップ環境のエレガントでシンプル、クリーンなドック。\n\n- Polybar — a fast and easy-to-use tool for creating status bars.\n\n- Tint2 — Openbox 用に開発されているシンプルなパネル・タスクバー。\n\n- Vala Panel — Gtk3 panel for compositing window managers\n\n- Xfce Panel — Xfce デスクトップのパネル。\n\n- xmobar — A lightweight, text-based, status bar written in Haskell.\n\n- Waybar — A customizable taskbar for Wlroots-based Wayland compositors.\n\n- yambar — A modular and lightweight status panel for X11 and Wayland that goes to great lengths to be both CPU and battery efficient.\n\n"
    },
    {
      "title": "System tray",
      "level": 4,
      "content": "- AllTray — Dock other applications into the system tray (notification area).\n\n- Docker — システムトレイとして動作するドック。\n\n- KDocker — Dock any application in the system tray (notification area).\n\n- Stalonetray — スタンドアローン freedesktop.org and KDE システムトレイ (notification area) for Xorg. It has full XEMBED support and minimal dependencies: an X11 lib only. Stalonetray works with virtually any EWMH-compliant window manager.\n\n- Trayer — 軽量な GTK ベースのシステムトレイ (notification area).\n\n"
    },
    {
      "title": "アプリケーションランチャー",
      "level": 4,
      "content": "See also Wikipedia:Comparison of desktop application launchers.\n\n- Albert — Sophisticated, plugin based standalone keyboard launcher.\n\n- Application Finder — Xfce の使いやすいアプリケーションランチャ。\n\n- Bashrun2 — 小さな xterm のウィンドウで特別な Bash セッションを使用してダイアログを実行する、風変わりなベアボーン風の方法を提供します。\n\n- bemenu — Lightweight dynamic menu inspired by dmenu. Works natively on Wayland.\n\n- dmenu — アプリケーションランチャーとしても使える高速で軽量な X 用ダイナミックメニュー。\n\n- dmenu-extended — ファイルやフォルダを素早く開くための dmenu の拡張。\n\n- dmenu2 — 多数のパッチを適用して画面選択・輝度・透過度設定などのオプションを追加した dmenu の Unmaintained フォーク。\n\n- dswitcher — dmenu ベースのウィンドウスイッチャ。ワークスペースや最小化と関係なく動作します。\n\n- Fehlstart — 小さな GTK ベースのアプリケーションランチャー。\n\n- Gmrun — 軽量な GTK ベースのアプリケーションランチャー。ターミナルからのプログラムの起動など便利な機能があります。\n\n- GNOME Do — 元は GNOME デスクトップ用に開発されていた、Quicksilver にインスパイアされ多くのプラグインを持つアプリケーションランチャー。\n\n- Gnome-Pie — Circular application launcher (pie menu) for Linux. It is made of several pies, each consisting of multiple slices.\n\n- j4-dmenu-desktop — 超高速な dmenu アプリケーションランチャー。\n\n- jgmenu — Simple, independent, contemporary-looking X11 menu, designed for scripting, ricing and tweaking.\n\n- higgins — デスクトップを選ばないアプリケーションランチャー、ファイルファインダー、電卓もろもろ。プラグインを使うことで簡単・自由に拡張できます。\n\n- Kupfer — GNOME デスクトップ用の便利なコマンド・アクセスツール。アプリケーションの起動、ドキュメントの開閉など様々な種類のオブジェクトにアクセスし実行できます。\n\n- launch — Simple command for launching applications from a terminal emulator.\n\n- Launchy — プラグインによって機能を拡張できる人気の高いクロスプラットフォームのアプリケーションランチャー。\n\n- Lighthouse — X 上で動作するシンプルかつスクリプタブルなポップアップダイアログ。\n\n- nwg-drawer — Sway コンポジター用に設計された GTK ベースのアプリケーションドロワー。\n\n- nwg-menu — GTK-based application menu designed for the Sway compositor.\n\n- rofi — superswitcher ベースのポップアップウィンドウスイッチャ。xlib と pango にのみ依存。\n\n- rlaunch — An extremely fast and light-weight dmenu-like application launcher written in Rust\n\n- Synapse — Synapse は Vala で書かれたセマンティックランチャーで、アプリケーションを起動するだけでなく Zeitgeist エンジンを使うことで関連ドキュメントやファイルを探してアクセスすることができます。\n\n- Ulauncher — Modern and shiny launcher that provides fuzzy search, extensions, and themes\n\n- Whippet — コントロールフリークのための、ランチャと xdg-open の代替。名前や mimetype で関連付けられたファイル・URL を開きます。SQLite データベースを使ってアプリケーションと関連付けはカスタマイズ可能。メニューの管理は dmenu を使用。\n\n- wofi — GTK-based popup window switcher for Wayland compositors such as sway. Inspired by rofi.\n\n"
    },
    {
      "title": "アプリケーションメニューエディタ",
      "level": 4,
      "content": "- Alacarte — メインメニューからアプリケーションを追加または削除します。\n\n- AppEditor — アプリケーションメニュー内のアプリケーションエントリを編集します。\n\n- Ezame — デスクトップおよびメニューファイルエディタ。\n\n- KMenuEdit — KDE アプリケーションランチャーのひとつを編集します。\n\n- lxmed — Java で作成されたアプリケーションメニューエディタ。\n\n- MenuLibre — モダンな機能を提供し、クリーンで使いやすいインターフェースを備えた高度なメニューエディタ。\n\n- Meow — Java で作成されたアプリケーションメニューエディタ。\n\n- Mozo — メインメニューに表示されるアプリケーションを変更します。\n\n"
    },
    {
      "title": "壁紙設定",
      "level": 4,
      "content": "See also Wikipedia:Wallpaper (computing).\n\n- bgs — imlib2 ベースの極めて高速で小さな壁紙設定プログラム。\n\n- esetroot — Eterm の root 壁紙設定プログラム、別個にパッケージされています。\n\n- feh — 軽量で強力な画像ビューア。デスクトップの壁紙の管理にも使えます。\n\n- Fondo — Find a variety of the most beautiful wallpapers from Unsplash.com.\n\n- habak — 壁紙を変更するアプリ。\n\n- hsetroot — 背景を作成するツール。\n\n- HydraPaper — GTK utility to set two different backgrounds for each monitor on GNOME.\n\n- LiveWallpaper — Animated 3D wallpapers.\n\n- Nitrogen — X ウィンドウの高速で軽量なデスクトップ背景ブラウザと設定プログラム。\n\n- oguri — An animated wallpaper daemon for Wayland compositors.\n\n- pacwall — A live wallpaper that shows the dependency graph and status of installed packages.\n\n- pybgsetter — 複数のバックエンド (hsetroot, Esetroot, habak, feh) が使ってデスクトップの壁紙を設定。\n\n- pywal — Changes the wallpaper and creates matching colorschemes for various applications (rofi, i3, terminals)\n\n- swaybg — Wallpaper tool for Wayland compositors.\n\n- Variety — Changes the wallpaper on a regular interval using user-specified or automatically downloaded images.\n\n- xli — X 向けの画像表示プログラム。\n\n- xwallpaper — Minimalistic wallpaper setting utility for X.\n\n"
    },
    {
      "title": "仮想デスクトップのページャ",
      "level": 4,
      "content": "Wikipedia:Pager (GUI) も参照してください。\n\n- bbpager — blackbox などのウィンドウマネージャ向けのドッカブルページャ。\n\n- fbpager — Fluxbox の仮想デスクトップページャ。\n\n- IPager — 透過度などを設定できるページャ、元々は Fluxbox のために開発されていました。\n\n- Neap — 素朴で軽量なページャ。パネルの通知エリアで動作します。\n\n- Netwmpager — NetWM/EWMH 互換のページャ。\n\n"
    },
    {
      "title": "デスクトップウィジェット",
      "level": 4,
      "content": "- gDesklets — デスクトップにミニプログラム（デスクレット）を表示するシステム。\n\n- GPhotoFrame — GNOME デスクトップ用のフォトフレームガジェット。\n\n- KRuler — 画面上にピクセルを測定する定規を表示します。kde-graphics の一部。\n\n- Screenlets — 小さなオーナードローンアプリケーションで構成されるウィジェットフレームワーク。\n\n"
    },
    {
      "title": "デスクトップ通知",
      "level": 4,
      "content": "こちらを参照: 通知サーバー\n\n"
    },
    {
      "title": "クリップボードマネージャ",
      "level": 4,
      "content": "こちらを参照 クリップボード#クリップボードマネージャの一覧\n\n"
    },
    {
      "title": "ログアウト UI",
      "level": 4,
      "content": "- clearine — X11 ウィンドウマネージャ用の美しいログアウト UI\n\n- nwg-bar — wlroots ベースのコンポジタ用の設定可能なボタンバー\n\n- oblogout — Openbox のログアウトスクリプト\n\n- wlogout — Wayland 用のログアウトメニュー\n\n"
    }
  ]
}