{
  "title": "Sshfs (Русский)",
  "url": "https://wiki.archlinux.org/title/Sshfs_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- SCP and SFTP\n- SFTP chroot\n- Pure-FTPd\n- sftpman\n\nSSHFS — клиент файловой системы на основе FUSE для монтирования удалённых каталогов через SSH-соединение.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет sshfs.\n\n- Если часто приходится монтировать файловые системы sshfs, то вас могут заинтересовать помощники sshfs, такие как qsshfsAUR[ссылка недействительна: package not found], sftpman, sshmntAUR или fmount.py.\n- Можно использовать Google Authenticator c sshfs для дополнительной безопасности.\n- Также можно использовать SSH keys вместо традиционного ввода пароля.\n\n"
    },
    {
      "title": "Монтирование",
      "level": 3,
      "content": "Для того, чтобы примонтировать каталог, используя SSH, пользователь должен иметь доступ к нему. Монтирование удаленной директории:\n\n```\n$ sshfs [user@]host:[dir] mountpoint [options]\n```\n\nНапример:\n\n```\n$ sshfs myuser@mycomputer:/remote/path /local/path -C -p 9876\n```\n\nГде -p 9876 является номером порта, -C - использование сжатия. Для дополнительных опций смотрите раздел #Опции.\n\nЕсли не указан путь, то по умолчанию он указывает на удаленную домашнюю директорию пользователя. Имя пользователя по умолчанию и опции могут быть заданы в ~/.ssh/config. Смотрите OpenSSH#Клиент.\n\nSSH запросит пароль, если необходимо. Если вы не хотите постоянно вводить пароль, прочитайте SSH keys.\n\n"
    },
    {
      "title": "Размонтирование",
      "level": 3,
      "content": "Чтобы размонтировать удаленную систему:\n\n```\n$ fusermount3 -u mountpoint\n```\n\nНапример:\n\n```\n$ fusermount3 -u /local/path\n```\n\n"
    },
    {
      "title": "Опции",
      "level": 2,
      "content": "sshfs может автоматически конвертировать ваш и удаленный идентификатор пользователя. Используйте параметр idmap=user, чтобы перевести UID подключаемого пользователя к удаленному пользователю myuser (GID остается нетронутым):\n\n```\n$ sshfs myuser@mycomputer:/remote/path /local/path -o idmap=user\n```\n\nЕсли вам требуется более точный контроль над переводом идентификаторов между локальным и удаленным пользователем, то обратите внимание на idmap=file, uidfile и gidfile.\n\nПолный список опций вы можете найти в sshfs(1).\n\n"
    },
    {
      "title": "Изменение корневого каталога",
      "level": 2,
      "content": "Вы можете привязать определенного пользователя к конкретной директории на удаленной системе. Это может быть выполнено путем редактирования /etc/ssh/sshd_config:\n\n```\n/etc/ssh/sshd_config\n```\n\n```\n...\nMatch User \"someuser\"\n       ChrootDirectory \"/chroot/%u\"\n       ForceCommand internal-sftp\n       AllowTcpForwarding no\n       X11Forwarding no\n...\n```\n\nNote: **должен** \n\nСмотрите SFTP chroot. Также обратите внимание в sshd_config(5) на Match, ChrootDirectory и ForceCommand.\n\n"
    },
    {
      "title": "Автомонтирование",
      "level": 2,
      "content": "Автоматическое монтирование происходит при загрузке или по запросу (для получения доступа к каталогу). В любом случае настройка будет происходить в fstab.\n\nNote: **Самое главное** Чтобы разрешить суперпользователю использовать ключ SSH обычного пользователя, нужно указать полный путь в опции IdentityFile.\n\nЧтобы разрешить суперпользователю использовать ключ SSH обычного пользователя, нужно указать полный путь в опции IdentityFile.\n\n"
    },
    {
      "title": "По запросу",
      "level": 3,
      "content": "Посредством systemd можно монтировать по запросу, используя /etc/fstab.\n\nНапример:\n\n```\nuser@host:/remote/folder /mount/point  fuse.sshfs noauto,x-systemd.automount,_netdev,users,idmap=user,IdentityFile=/home/user/.ssh/id_rsa,allow_other,reconnect 0 0\n```\n\nГлавные опции - noauto,x-systemd.automount,_netdev.\n\n- noauto - монтирование не будет происходит при загрузке.\n- x-systemd.automount - делает магию, связанную с запросом.\n- _netdev - показывает, что это сетевое устройство, а не блочное (без этой опции может появится ошибка \"No such device\")\n\n"
    },
    {
      "title": "При загрузке",
      "level": 3,
      "content": "Пример того, как использовать sshfs для монтировании удаленной файловой системы при помощи /etc/fstab\n\n```\nUSERNAME@HOSTNAME_OR_IP:/REMOTE/DIRECTORY  /LOCAL/MOUNTPOINT  fuse.sshfs  defaults,_netdev  0  0\n```\n\nДля примера возьмите линию из fstab\n\n```\nllib@192.168.1.200:/home/llib/FAH  /media/FAH2  fuse.sshfs  defaults,_netdev  0  0\n```\n\nВыше приведенная строка будет работать только в том случае, если вы используете SSH ключ. Смотрите SSH keys.\n\nЕсли вы не единственный пользователь, использующий sshfs:\n\n```\nuser@domain.org:/home/user  /media/user   fuse.sshfs    defaults,allow_other,_netdev    0  0\n```\n\nОчень важно убедится в том, что параметр _netdev установлен, чтобы быть уверенным в доступности сети перед монтированием.\n\n"
    },
    {
      "title": "Безопасный доступ пользователей",
      "level": 3,
      "content": "Когда используется автомонтирование через fstab, файловая система будет монтироваться от суперпользователя. По умолчанию, это приводит к нежелательным результатам, если вы хотите получать доступ как обычный пользователь и ограничить доступ другим пользователям.\n\nПример конфигурации:\n\n```\nUSERNAME@HOSTNAME_OR_IP:/REMOTE/DIRECTORY  /LOCAL/MOUNTPOINT  fuse.sshfs noauto,x-systemd.automount,_netdev,user,idmap=user,follow_symlinks,identityfile=/home/USERNAME/.ssh/id_rsa,allow_other,default_permissions,uid=USER_ID_N,gid=USER_GID_N 0\n```\n\nОписание опций:\n\n- allow_other - позволяет другим пользователям, отличным от монтирующего (то есть обычным пользователям), получать доступ к тому, что монтируется.\n- default_permissions - позволяет ядру проверять права, иначе говоря использовать актуальные права на удаленной файловой системе. А также запрещает доступ всем, кроме объявленных в allow_other.\n- uid, gid - устанавливает владельца файлов в соответствии с переданными значениями; uid - это числовой идентификатор пользователя, gid - числовой идентификатор группы пользователя.\n\n"
    },
    {
      "title": "Контрольный список",
      "level": 3,
      "content": "Для начала, прочитайте следующую страницу вики OpenSSH#Проверка. Пункты, которые следует проверить:\n\n1. Получает ли ваш логин SSH дополнительную информацию от сервера, например, файл /etc/issue? Это может запутать SSHFS. Вам следует временно отключить серверный файл /etc/issue:\n\n```\n$ mv /etc/issue /etc/issue.orig\n```\n\n2. Имейте в виду, что большинство статей по устранению неполадок, связанных с SSH, не связаны с Systemd. Часто определения в /etc/fstab ошибочно начинаются с sshfs#user@host:/mnt/server/folder ... fuse ... вместо того, чтобы использовать следующий синтаксис user@host:/mnt/server/folder ... fuse.sshfs ... x-systemd, ....\n\n3. Убедитесь в том, что владелец исходной папки и ее содержимого на сервере владеет соответствующий пользователь:\n\n```\n$ chown -R USER_S: /mnt/servers/folder\n```\n\n4. Серверный идентификатор пользователя может отличаться от соответствующего клиентского. Очевидно, что имена пользователей будут одинаковыми. Вам просто нужно позаботиться о клиентском идентификаторе. SSHFS будет преобразовывать идентификатор пользователя посредством следующего параметра:\n\n```\nuid=USER_C_ID,gid=GROUP_C_ID\n```\n\n5. Проверьте, чтобы клиент имел права на целевую точку монтирования (каталог). Данная директория должна иметь такой же идентификатор, как в настройках монтирования SSHFS.\n\n```\n$ chown -R USER_C: /mnt/client/folder\n```\n\n6. Проверьте, что точка монтирования (папка) пуста. По умолчанию, вы не можете монтировать каталоги SSHFS в непустые директории.\n\n"
    },
    {
      "title": "Сброс соединения пиром",
      "level": 3,
      "content": "- Если вы пытаетесь получить доступ к удаленной машине, используя имя хоста, то попробуйте использовать ее адрес или доменной имя, смотря, что исправит проблему. Убедитесь в том, что вы изменили /etc/hosts в соответствии со свойствами сервера.\n- Если вы используете нестандартные имена ключей и передаете их как -i .ssh/my_key, то это не будет работать. Вам следует использовать -o IdentityFile=/home/user/.ssh/my_key с указанием полного пути к ключу.\n- Если ваш файл /root/.ssh/config является символической ссылкой, то вы получите сообщение об ошибке. Смотрите эту тему\n- Добавление опции 'sshfs_debug' (как в 'sshfs -o sshfs_debug user@server ...') может помочь в решении проблемы.\n- Если это не помогло выявить ничего полезного, то вы можете также попробовать добавить опцию 'debug'\n- Если вы пытаетесь использовать sshfs в роутере, работающем на DD-WRT или чем-то подобном, то решение проблемы здесь. (обратите внимание, что опция osftp_server=/opt/libexec/sftp-server может быть использована в командах SSH вместо патча dropbear)\n- Если это случается только при загрузке, то возможно, что причиной является systemd, который пытается выполнить монтирование до того, как сеть станет доступна. Это можно исправить, включив 'wait-online'-службу для вашего сетевого соединения (например, systemd-networkd-wait-online.service).\n- Старая тема на форуме: sshfs: Connection reset by peer.\n- Убедитесь, что ваш пользователь можешь зайти на сервер (особенно при использовании AllowUsers).\n- Убедитесь в том, что Subsystem sftp /usr/lib/ssh/sftp-server включен в /etc/ssh/sshd_config.\n\n"
    },
    {
      "title": "Удаленный хост отключен",
      "level": 3,
      "content": "Если это сообщение появляется непосредственно после попытки использовать sshfs:\n\n- Сначала убедитесь, что на удаленном компьютере установлен sftp! Ничего не будет работать, пока пакет не будет установлен.\n- Затем попробуйте проверить корректность пути к Subsystem sftp, указанного в /etc/ssh/sshd_config на удаленной машине.\n\n"
    },
    {
      "title": "Проблемы с монтированием fstab",
      "level": 3,
      "content": "Для получения подробной отладочной информации, добавьте следующее в параметры монтирования:\n\n```\nssh_command=ssh\\040-vv,sshfs_debug,debug\n```\n\nЧтобы видеть отладочную информацию, запустив при этом mount -av, удалите следующее:\n\n```\nnoauto,x-systemd.automount\n```\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Как монтировать файловую систему SSH, находящуюся в chroot-среде, с специальными владельцами и вопросами доступа.\n\n"
    }
  ]
}