{
  "title": "Start X at Boot (Русский)",
  "url": "https://wiki.archlinux.org/title/Start_X_at_Boot_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Экранный менеджер\n- Xorg (Русский)\n- xprofile (Русский)\n- Ресурсы Х\n\nИз Википедии:\n\nxinit обычно используется для запуска оконного менеджера или среды рабочего стола. Хотя можно использовать xinit и для запуска других графических приложений без оконного менеджера, многие приложения ожидают наличия оконного менеджера, совместимого с EWMH. Экранные менеджеры, как правило, сами запускают Xorg и выполняют source файла xprofile.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет xorg-xinit.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "xinit и startx принимают необязательный аргумент клиентской программы; смотрите раздел #Переопределение xinitrc. Если его не указать, то по умолчанию они ищут ~/.xinitrc для его запуска в качестве скрипта, запускающего клиентские программы.\n\n"
    },
    {
      "title": "xinitrc",
      "level": 3,
      "content": "~/.xinitrc удобен для запуска программ, зависящих от X, и установки переменных окружения при запуске X-сервера. Если он присутствует в домашнем каталоге пользователя, startx и xinit выполнят его. Иначе startx выполнит по умолчанию /etc/X11/xinit/xinitrc.\n\nСтандартный xinitrc запустит базовую среду с Twm, xorg-xclock и Xterm (при условии, что необходимые пакеты установлены). Поэтому, чтобы запустить другой оконный менеджер или среду рабочего стола, сначала создайте копию стандартного xinitrc в вашем домашнем каталоге:\n\n```\n$ cp /etc/X11/xinit/xinitrc ~/.xinitrc\n```\n\nЗатем отредактируйте этот файл и замените программы по умолчанию нужными вам командами. Помните, что строки после команды exec будут игнорироваться. Например, чтобы запустить xscreensaver в фоновом режиме, а затем запустить openbox, пропишите:\n\n```\n~/.xinitrc\n```\n\n```\n...\nxscreensaver &\nexec openbox-session\n```\n\nДлительно работающие программы, запускаемые перед оконным менеджером, такие как хранитель экрана и обои, должны либо сами переходить в фоновый режим, либо запускаться в фоновом режиме с помощью добавления знака & в скрипте. Если этого не будет, то скрипт будет останавливаться и ждать завершения работы каждой программы перед запуском оконного менеджера или среды рабочего стола. Обратите внимание, что некоторые программы не следует уводить фон, чтобы не возникало гонки, как, например, в случае с xrdb. Команда exec заменяет процесс скрипта на процесс оконного менеджера, так что X не завершится, даже если этот процесс перейдёт в фоновый режим.\n\n"
    },
    {
      "title": "xserverrc",
      "level": 3,
      "content": "Файл xserverrc — это скрипт, отвечающий за запуск X-сервера. И startx, и xinit запускают ~/.xserverrc, если он существует, иначе startx запустит стандартный /etc/X11/xinit/xserverrc.\n\nДля поддержания аутентифицированного сеанса с logind и предотвращения обхода блокировщика экрана путём переключения терминалов Xorg должен запускаться на том же виртуальном терминале, в котором был выполнен вход в систему [1]. Поэтому рекомендуется указывать vt$XDG_VTNR в файле ~/.xserverrc:\n\n```\n~/.xserverrc\n```\n\n```\n#!/bin/sh\n\nexec /usr/bin/Xorg -nolisten tcp \"$@\" vt$XDG_VTNR\n```\n\nСписок всех доступных опций есть в Xserver(1).\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Для запуска Xorg от имени обычного пользователя, выполните:\n\n```\n$ startx\n```\n\nИли если настроен #xserverrc:\n\n```\n$ xinit -- :1\n```\n\nВыбранный вами оконный менеджер (или окружение рабочего стола) теперь запустится правильно.\n\nДля выхода из X, запустите функцию выхода вашего оконного менеджера (при условии, что он есть). Если нет такой возможности, запустите:\n\n```\n$ pkill -15 Xorg\n```\n\n```\n$ pkill -15 -t tty\"$XDG_VTNR\" Xorg\n```\n\nСмотрите также signal(7).\n\n"
    },
    {
      "title": "Переопределение xinitrc",
      "level": 3,
      "content": "Если у вас есть рабочий ~/.xinitrc, но хотите попробовать другие WM/DE, вы можете запустить его используя startx с указанием пути к оконному менеджеру:\n\n```\n$ startx /full/path/to/window-manager\n```\n\nЕсли оконный менеджер принимает аргументы, они должны быть взяты в кавычки в качестве части первого параметра startx:\n\n```\n$ startx \"/full/path/to/window-manager --key value\"\n```\n\nОбратите внимание что требуется полный путь. По желанию, вы можете также переопределить /etc/X11/xinit/xserverrc файл (который хранит значение по умолчанию X сервера) с пользовательскими опциями, путем добавления их после --, например:\n\n```\n$ startx /usr/bin/enlightenment -- -br +bs -dpi 96\n```\n\nСмотрите также startx(1).\n\n"
    },
    {
      "title": "Автозапуск X при входе в систему",
      "level": 3,
      "content": "Убедитесь, что startx корректно настроен.\n\nВ настройках вашей оболочки входа (например, ~/.bash_profile для Bash или ~/.zprofile для Zsh) добавьте следующий код:\n\n```\nif [ -z \"$DISPLAY\" ] && [ \"$XDG_VTNR\" -eq 1 ]; then\n  exec startx\nfi\n```\n\nВы можете заменить -eq 1 на -le 3 (от vt1 до vt3) если вы хотите использовать графические логины на более чем одном VT.\n\nАльтернативные способы определения виртуального терминала — \"$(tty)\" = \"/dev/tty1\", что не позволяет выполнять сравнение с помощью -le, и \"$(fgconsole 2>/dev/null || echo -1)\" -eq 1, что не работает в последовательной консоли.\n\nКоманда exec обеспечивает выход пользователя из системы при выходе из X-сервера или его аварийном завершении. Если вы хотите оставаться в системе в системе после завершения сеанса X, удалите exec.\n\nСмотрите также Fish (Русский)#Запуск X при входе и systemd/Пользователь#Автоматический логин в Xorg без экранного менеджера.\n\n"
    },
    {
      "title": "Переключение между средами рабочего стола/оконными менеджерами",
      "level": 3,
      "content": "Если вы часто переключаетесь между различными средами рабочего стола или оконными менеджерами, может оказаться удобно использовать экранный менеджер или добавить в ~/.xinitrc код, упрощающий переключение.\n\nВ следующем примере ~/.xinitrc показано как запустить конкретную DE/WM с аргументом:\n\n```\n~/.xinitrc\n```\n\n```\n...\n\n# По умолчанию используем Xfce\nsession=${1:-xfce}\n\ncase $session in\n    i3|i3wm           ) exec i3;;\n    kde               ) exec startplasma-x11;;\n    xfce|xfce4        ) exec startxfce4;;\n    # Если аргумент не соответствует известному сеансу,\n    # пытаемся выполнить его как обычную команду\n    *                 ) exec $1;;\nesac\n```\n\nТеперь передать аргумент session можно так:\n\n```\n$ xinit session\n```\n\nили\n\n```\n$ startx ~/.xinitrc session\n```\n\n"
    },
    {
      "title": "Запуск приложений без оконного менеджера",
      "level": 3,
      "content": "Можно запустить только определенные приложения без оконного менеджера. Хотя, это будет полезно только для одного приложения, запущенного в полноэкранном режиме. Например:\n\n```\n~/.xinitrc\n```\n\n```\n...\n\nexec chromium\n```\n\nВ качестве альтернативы можно запустить исполняемый файл напрямую из командной строки, как показано в разделе #Переопределение xinitrc.\n\nС помощью этого метода необходимо установить геометрию каждого окна приложения с помощью своих собственных файлов настроек, если вообще возможно.\n\nСмотрите также Display manager (Русский)#Запуск приложений без оконного менеджера.\n\n"
    },
    {
      "title": "Перенаправление вывода при использовании startx",
      "level": 3,
      "content": "Смотрите Xorg (Русский)#Перенаправление журнала сеанса.\n\n"
    }
  ]
}