{
  "title": "Steam (Русский)/Troubleshooting (Русский)",
  "url": "https://wiki.archlinux.org/title/Steam_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)/Troubleshooting_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Введение",
      "level": 2,
      "content": "1. Убедитесь, что вы выполнили все шаги из раздела Steam (Русский)#Установка.\n1. Если клиент Steam / игра не запускается и/или появляется сообщение об ошибке библиотеки, смотрите разделы #Steam runtime и #Отладка библиотек.\n1. Если проблема связана с сетью, убедитесь, что вы пробросили необходимые порты для Steam.\n1. Если проблема связана с конкретной игрой, поищите соответствующий раздел в статье Steam/Game-specific troubleshooting.\n\n"
    },
    {
      "title": "Связанные интернет-ресурсы",
      "level": 3,
      "content": "- Multimedia and Games / Arch Linux Forums\n- ValveSoftware/steam-for-linux — Отслеживание проблем клиента Steam для Linux\n- Сообщество Steam\n- Часто задаваемые вопросы в Steam Support\n\n"
    },
    {
      "title": "Steam runtime",
      "level": 2,
      "content": "Steam для Linux поставляется с собственным набором библиотек, называемым Steam runtime. По умолчанию Steam запускает все приложения Steam в своей среде, которая находится по адресу ~/.steam/root/ubuntu12_32/steam-runtime/.\n\nЕсли вы будете использовать библиотеки из Steam runtime вместе с системными библиотеками, вы столкнётесь с проблемой несовместимости бинарных файлов, смотрите steam-for-linux issue #4768. Это может привести к проблемам с запуском клиента Steam и игр (что проявляется как крах, зависание или тихое завершение), проблемы со звуком и различные другие проблемы.\n\nПакет steam предлагает два способа запуска Steam:\n\n- steam-runtime (псевдоним steam), который переопределяет библиотеки времени выполнения, известные как вызывающие проблемы, с помощью переменной окружения LD_PRELOAD (смотрите ld.so(8)).\n- /usr/lib/steam/steam, стандартный скрипт запуска Steam\n\nПоскольку библиотеки в Steam runtime более старые, в них могут отсутствовать новые возможности, например, в OpenAL-версии Steam runtime отсутствует поддержка HRTF и surround71.\n\n"
    },
    {
      "title": "Steam native runtime",
      "level": 3,
      "content": "Пакет steam-native-runtime зависит от более чем 130 пакетов и представляет собой нативную замену Steam runtime, однако для некоторых игр могут потребоваться дополнительные пакеты.\n\nПакет предоставляет скрипт steam-native, который запускает Steam с переменной окружения STEAM_RUNTIME=0, заставляя его игнорировать свой runtime и использовать только системные библиотеки.\n\nВы также можете использовать Steam native runtime без установки steam-native-runtime, установив вручную только те пакеты, которые вам нужны. Смотрите раздел #Поиск библиотек, которых не хватает в runtime.\n\n"
    },
    {
      "title": "Отладка библиотек",
      "level": 2,
      "content": "Чтобы увидеть разделяемые библиотеки, требуемые программой или разделяемой библиотекой, выполните команду ldd, смотрите ldd(1). Переменные окружения LD_LIBRARY_PATH и LD_PRELOAD могут изменять то, какие разделяемые библиотеки загружаются, смотрите ld.so(8). Поэтому для корректной отладки программы или разделяемой библиотеки важно, чтобы эти переменные окружения в вашей среде отладки соответствовали окружению, которое вы хотите отлаживать.\n\nЕсли вы обнаружили недостающую библиотеку, вы можете использовать pacman или pkgfile, чтобы найти пакеты, в которых есть нужная библиотека.\n\n"
    },
    {
      "title": "Поиск библиотек, которых не хватает игре",
      "level": 3,
      "content": "Если игра не запускается, возможная причина — отсутствие необходимых библиотек. Вы можете узнать, какие библиотеки она запрашивает, запустив ldd исполняемый_файл_игры. исполняемый_файл_игры, скорее всего, находится где-то в ~/.steam/root/steamapps/common/. Обратите внимание, что большинство из этих «недостающих» библиотек на самом деле входят в состав Steam и их не нужно устанавливать глобально.\n\n"
    },
    {
      "title": "Поиск библиотек, которых не хватает в runtime",
      "level": 3,
      "content": "Если отдельные игры или сам Steam не запускаются при использовании steam-native — возможно, не хватает библиотек. Чтобы найти необходимые библиотеки, выполните:\n\n```\n$ cd ~/.steam/root/ubuntu12_32\n$ file * | grep ELF | cut -d: -f1 | LD_LIBRARY_PATH=. xargs ldd | grep 'not found' | sort | uniq\n```\n\nВ качестве альтернативы запустите Steam через steam-runtime и используйте следующую команду, чтобы посмотреть, какие несистемные библиотеки использует Steam (не все из них являются частью Steam runtime):\n\n```\n$ for i in $(pgrep steam); do sed '/\\.local/!d;s/.*  //g' /proc/$i/maps; done | sort | uniq\n```\n\n"
    },
    {
      "title": "Отладка Steam",
      "level": 2,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nПрограмма запуска Steam перенаправляет свои stdout и stderr в /tmp/dumps/USER_stdout.txt. Это означает, что вам не нужно запускать Steam из командной строки, чтобы увидеть этот вывод.\n\nМожно отлаживать Steam, чтобы получить больше информации, которая может быть полезна для выяснения причин, почему что-то не работает.\n\nВ переменную окружения DEBUGGER можно установить одно из значений gdb, cgdb, valgrind, callgrind, strace, а затем запустить steam.\n\nНапример, с gdb:\n\n```\n$ DEBUGGER=gdb steam\n```\n\nоткроется gdb, затем введите run, который запустит steam, и когда произойдет сбой, вы можете ввести backtrace, чтобы увидеть стек вызовов.\n\n"
    },
    {
      "title": "'GLBCXX_3.X.XX' не найден при использовании Bumblebee",
      "level": 3,
      "content": "Эта ошибка, скорее всего, вызвана тем, что Steam использует свой собственный устаревший пакет libstdc++.so.6. Смотрите раздел #Поиск библиотек, которых не хватает в runtime о том, как обойти плохую библиотеку. Смотрите также steam-for-linux issue 3773.\n\n"
    },
    {
      "title": "Steam>Warning: failed to init SDL thread priority manager: SDL not found",
      "level": 3,
      "content": "Решение: установить пакет lib32-sdl2AUR.\n\n"
    },
    {
      "title": "Игра сразу падает",
      "level": 3,
      "content": "Скорее всего, это связано с проблемами #Steam runtime; смотрите раздел #Отладка библиотек.\n\nВозможно, поможет отключение внутриигрового оверлея Steam в свойствах игры.\n\nИ наконец, если эти способы не помогают, проверьте вывод Steam на наличие ошибок в игре. Вы можете столкнуться со следующим:\n\n- munmap_chunk(): invalid pointer\n- free(): invalid pointer.\n\nВ этих случаях попробуйте заменить файл libsteam_api.so в проблемной игре на файл из рабочей игры. Эта ошибка обычно возникает в играх, которые давно не обновлялись, если Steam runtime не используется. Эта ошибка встречалась в играх AYIM, Bastion и Monaco.\n\n"
    },
    {
      "title": "Игра и Steam падают после запуска игры",
      "level": 3,
      "content": "Если выводится следующая ошибка:\n\n```\nfailed to dlopen engine.so error=/home/GAMEPATH/bin/libgcc_s.so.1: version `GCC_7.0.0' not found (required by /usr/lib32/libopenal.so.1)\n```\n\nперемещение несовместимой библиотеки может быть обходным решением.\n\n```\nmv .local/share/Steam/steamapps/common/GAME/bin/libgcc_s.so.1 .local/share/Steam/steamapps/common/GAME/bin/libgcc_s.so.1.b\n```\n\n"
    },
    {
      "title": "Version `CURL_OPENSSL_3` not found",
      "level": 3,
      "content": "Это происходит потому, что curl сам по себе не совместим с предыдущими версиями. Вам необходимо установить библиотеки совместимости:\n\nМожет появиться одно из следующих сообщений:\n\n```\n# Nuclear Throne\n./nuclearthrone: /usr/lib32/libcurl.so.4: version `CURL_OPENSSL_3' not found (required by ./nuclearthrone)\n\n# Devil Daggers\n./devildaggers: /usr/lib/libcurl.so.4: version `CURL_OPENSSL_3' not found (required by ./devildaggers)\n```\n\nУстановите libcurl-compat или lib32-libcurl-compat и вручную создайте символическую ссылку на библиотеку совместимости:\n\n```\n# Nuclear Throne\n$ ln -s /usr/lib32/libcurl-compat.so.4.4.0 \"LIBRARY/steamapps/common/Nuclear Throne/lib/libcurl.so.4\"\n\n# Devil Daggers\n$ ln -s /usr/lib/libcurl-compat.so.4.4.0 LIBRARY/steamapps/common/devildaggers/lib64/libcurl.so.4\n```\n\n"
    },
    {
      "title": "Библиотека игр Steam не отображается в native runtime (чёрный экран)",
      "level": 3,
      "content": "После обновления Steam Friends UI клиентский webview не работает корректно в native runtime.\n\n```\n./steamwebhelper: error while loading shared libraries: libpcre.so.3: cannot open shared object file: No such file or directory\n```\n\nЭто можно решить, предварительно загрузив библиотеки glib; они не требуют libpcre и selinux для работы.\n\n```\n$ LD_PRELOAD=\"/usr/lib/libgio-2.0.so.0 /usr/lib/libglib-2.0.so.0\" steam-native\n```\n\nВ качестве альтернативы вы можете создать символическую ссылку на родную библиотеку Arch libpcre.\n\n```\n# ln -s /usr/lib/libpcre.so /usr/lib64/libpcre.so.3\n```\n\nПосле обновления от 3/3/2022 есть сообщения о том, что эти обходные пути не помогают.\n\nОбходное решение — запустить Steam с опцией -no-cef-sandbox. Более подробную информацию можно найти в steam-for-linux issue #8451 и steam-for-linux issue #8420.\n\n"
    },
    {
      "title": "Steam: An X Error occurred",
      "level": 3,
      "content": "При использовании видеокарты NVidia и проприетарных драйверов Steam может не запуститься и (при запуске из терминала) выдать ошибку вида:\n\n```\nSteam: An X Error occurred\nX Error of failed request:  GLXBadContext\nMajor opcode of failed request:  151\nSerial number of failed request:  51\nxerror_handler: X failed, continuing\n```\n\nУстановите пакет lib32-nvidia-utils (или lib32-nvidia-390xx-utilsAUR, если используется старая видеокарта).\n\nЕсли пакет lib32-nvidia-utils уже установлен, убедитесь, что версия этого пакета соответствует версии пакета nvidia с помощью команды\n\n```\n# pacman -Qs nvidia\n```\n\nЕсли версии не совпадают — возможно, придётся изменить зеркала, которые вы используете для установки драйверов.\n\nЕсли вы используете AMD, включили 10-битную глубину цвета и столкнулись с этой проблемой — скорее всего, придётся отключить 10-битную глубину цвета.\n\nДругая проблема, вызывающая это сообщение об ошибке, может быть решена удалением файла config.vdf:\n\n```\n$ rm ~/.local/share/Steam/config/config.vdf\n```\n\n"
    },
    {
      "title": "Steam: Не удалось настроить инструмент совместимости",
      "level": 3,
      "content": "Если вы пытаетесь запустить нативную игру с помощью Proton, но сразу после запуска игры получаете ошибку Steam compatibility tool, возможно, вам придётся переустановить среду выполнения.\n\n1. Перейдите в библиотеку Steam.\n1. В выпадающем списке над списком игр отметьте опцию Инструменты, чтобы сделать их видимыми.\n1. Найдите Proton, щёлкните правой кнопкой мыши на каждом установленном инструменте, выберите Свойства, откройте вкладку Локальные файлы и выберите Проверить целостность файлов инструмента на каждой установленной версии Proton.\n1. Найдите Steam Linux Runtime и повторите ту же процедуру. Если таковых нет, установите последнюю версию Steam Linux Runtime - Soldier.\n\n"
    },
    {
      "title": "Игра запускается, но сразу же закрывается при использовании нестандартного ядра",
      "level": 3,
      "content": "Убедитесь, что вы включили User namespaces в разделе General setup -> Namespaces support.\n\n"
    },
    {
      "title": "Проблемы со звуком",
      "level": 2,
      "content": "Если приведённые ниже разделы не помогают решить проблему, возможно, поможет использование #Steam native runtime.\n\n"
    },
    {
      "title": "Настройка PulseAudio",
      "level": 3,
      "content": "Игры, которые явно зависят от ALSA, могут нарушить работу PulseAudio. Следуйте указаниям, описанным в разделе PulseAudio (Русский)#ALSA, чтобы заставить эти игры использовать PulseAudio.\n\n"
    },
    {
      "title": "Нет звука или ошибка сегментирования 756",
      "level": 3,
      "content": "Если ещё не выполнена #Настройка PulseAudio — выполните её и посмотрите, решит ли это проблему. Если у вас нет звука в видео, которое воспроизводится в клиенте Steam, возможно, не работают библиотеки ALSA, поставляемые со Steam.\n\nПопытка воспроизвести видео в клиенте Steam приводит к ошибке, подобной следующей:\n\n```\nALSA lib pcm_dmix.c:1018:(snd_pcm_dmix_open) unable to open slave\n```\n\nОбходным решением является переименование или удаление папки alsa-lib и файлов libasound.so.*. Их можно найти здесь:\n\n```\n~/.steam/steam/ubuntu12_32/steam-runtime/i386/usr/lib/i386-linux-gnu/\n```\n\nАльтернативным обходным решением является добавление библиотеки libasound.so.* в переменную окружения LD_PRELOAD:\n\n```\n$ LD_PRELOAD='/usr/$LIB/libasound.so.2 '${LD_PRELOAD} steam\n```\n\nЕсли звука всё равно нет, может помочь добавление библиотек PulseAudio в LD_PRELOAD:\n\n```\n$ LD_PRELOAD='/usr/$LIB/libpulse.so.0 /usr/$LIB/libpulse-simple.so.0 '${LD_PRELOAD} steam\n```\n\nИмейте в виду, что их имена могут измениться со временем. Если это так, то загляните в\n\n```\n~/.steam/ubuntu12_32/steam-runtime/i386/usr/lib/i386-linux-gnu\n```\n\nи найдите новые библиотеки и их версии.\n\nСообщения об ошибках на GitHub: #3376 и #3504\n\n"
    },
    {
      "title": "Звуковой движок FMOD",
      "level": 3,
      "content": "Пакет промежуточного звукового ПО FMOD немного глючит, и в результате игры, использующие его, могут иметь проблемы со звуком.\n\nОбычно это происходит, когда неиспользуемое звуковое устройство используется по умолчанию для ALSA. Смотрите Advanced Linux Sound Architecture#Set the default sound card.\n\n"
    },
    {
      "title": "PulseAudio и OpenAL: не получается переместить аудиопоток на другое устройство",
      "level": 3,
      "content": "Если вы используете PulseAudio и не можете переместить аудиопоток на другое устройство, это может быть связано с тем, что последние версии OpenAL по умолчанию запрещают перемещение аудиопотоков. Попробуйте добавить следующее в файл ~/.alsoftrc:\n\n```\n[pulse]\nallow-moves=true\n```\n\n"
    },
    {
      "title": "Невозможно просмотреть файловую систему для добавления папки библиотеки или папка библиотеки отображается как пустая",
      "level": 3,
      "content": "Если при попытке добавить папку библиотеки в окне выбора файлов пусто, или если ранее установленная папка теперь отображается с 0 установленных игр, это может быть результатом неправильной временной метки в корневом каталоге или в папке библиотеки. Временные метки можно проверить с помощью stat:\n\n```\n$ stat путь\n```\n\nЕсли временная метка находится в будущем, выполните команду\n\n```\n$ touch путь\n```\n\nчтобы сбросить её на текущую дату, а затем перезапустите Steam.\n\n"
    },
    {
      "title": "Невозможно добавить папку библиотеки из-за отсутствия прав на исполнение",
      "level": 3,
      "content": "Если вы добавляете ещё одну папку библиотеки Steam, находящуюся на другом диске, может появиться сообщение об ошибке:\n\n```\nФайловая система, используемая для новой папки библиотеки Steam, должна быть смонтирована с правами на исполнение\n```\n\nУбедитесь, что вы монтируете файловую систему с правильными флагами в /etc/fstab, по необходимости добавив exec в список параметров монтирования. Этот параметр должен быть после любого параметра user или users, поскольку они могут подразумевать noexec.\n\nЭта ошибка также может возникнуть, если папка библиотеки не содержит каталога steamapps. В предыдущих версиях вместо этого использовался SteamApps, поэтому убедитесь, что имя полностью записано в нижнем регистре.\n\nЭта ошибка также может возникать из-за проблем со Steam runtime и может быть исправлена как описано в разделе #Поиск библиотек, которых не хватает в runtime или из-за отсутствия свободного места на устройстве. Для отладки может быть полезно запустить Steam в консоли и посмотреть вывод.\n\n"
    },
    {
      "title": "Необычно низкая скорость загрузки",
      "level": 3,
      "content": "Если скорость загрузки в Steam (игр, программ...) через клиент необычно низкая, но при этом просмотр магазина Steam и потоковое видео работают нормально, может помочь установка программы кэширования DNS, например dnsmasq [1].\n\nЕщё одним способом, который может помочь, может быть отключение IPv6. Смотрите [2] для более подробной информации.\n\n"
    },
    {
      "title": "Ошибка \"Needs to be online\"",
      "level": 3,
      "content": "Если лаунчер Steam отказывается запускаться с ошибкой «Fatal Error: Steam needs to be online to update», хотя интернет на самом деле работает, то, возможно, возникли проблемы с разрешением доменных имён.\n\nПопробуйте установить lib32-systemd, lib32-libcurl-compat, nss-mdns, lib32-nss, lib32-glu или lib32-dbus.\n\nЭто также может быть просто некорректная работа разрешения DNS, которая не всегда очевидна, поскольку современные браузеры используют свои собственные DNS-серверы. Смотрите статью Разрешение доменных имён.\n\nSteam может иметь проблемы, если для разрешения используется systemd-resolved. Убедитесь, что установлен пакет lib32-systemd.\n\nЕсли разрешение DNS работает, но лаунчер Steam по-прежнему показывает то же сообщение об ошибке, можно попробовать включить кэширование DNS, например, с помощью «Name Service Caching Daemon» (nscd.service).\n\nОднако неясно, почему запуск nscd решает проблему. Подробнее на странице обсуждения.\n\n"
    },
    {
      "title": "Steam забывает пароль",
      "level": 3,
      "content": "Steam для Linux имеет ошибку, из-за которой он забывает пароль некоторых пользователей.\n\nВ качестве обходного пути, после входа в Steam, выполните команду\n\n```\n# chattr +i ~/.steam/registry.vdf\n```\n\nЭто установит бит неизменяемости файла, так что Steam не сможет изменить, удалить или переименовать его, а значит больше не сможет забыть ваш аккаунт.\n\n"
    },
    {
      "title": "Отключение сохранения дампов памяти",
      "level": 3,
      "content": "Каждый раз, когда Steam падает, он записывает дамп памяти в /tmp/dumps/. Если Steam застревает в цикле падений, файлы дампов могут начать занимать много места. Если /tmp монтируется как tmpfs, может начаться излишнее потребление памяти и подкачки.\n\nЧтобы предотвратить это, сделайте символическую ссылку /tmp/dumps, ведущую на /dev/null:\n\n```\n# ln -s /dev/null /tmp/dumps\n```\n\nИли, в качестве альтернативы, создайте и измените разрешения на /tmp/dumps. Тогда Steam не сможет записывать файлы дампов в этот каталог.\n\n```\n# mkdir /tmp/dumps\n# chmod 600 /tmp/dumps\n```\n\nЭто также имеет дополнительное преимущество: Steam не будет загружать эти дампы на серверы Valve.\n\n"
    },
    {
      "title": "Проблема с лицензией Steam при воспроизведении видео",
      "level": 3,
      "content": "Steam использует Google Widevine DRM для некоторых видео. Если он не установлен, вы получите следующую ошибку:\n\n```\nThis video requires a license to play which cannot be retrieved. This may be a temporary network condition. Please restart the video to try again.\n```\n\nДля решения этой проблемы следуйте рекомендациям на странице поддержки Потоковое видео в Steam.\n\n"
    },
    {
      "title": "Нет контекстного меню для приглашения друзей",
      "level": 3,
      "content": "После обновления Steam Friends UI в меню правой кнопки мыши могут отсутствовать пункты «Присоединиться к игре», «Пригласить в игру» и «Посмотреть информацию об игре».\n\nЧтобы исправить это, возможно, потребуется установить lsof.\n\n"
    },
    {
      "title": "Медленный и неотзывчивый интерфейс",
      "level": 3,
      "content": "Если интерфейс Steam работает медленно, возможно, вам поможет отключение опции Рендеринг веб-страниц с помощью видеокарты на вкладке Интерфейс в настройках Steam.\n\nСписок друзей также может вызывать эту проблему. На странице https://github.com/ValveSoftware/steam-for-linux/issues/7245 упоминаются два способа обойти проблемы:\n\n- Перемещение списка друзей на другой монитор [3].\n- Отключение анимированных аватаров. Откройте настройки списка друзей (нажмите на шестерёнку в правом верхнем углу списка) и на вкладке Список друзей отключите пункт Включить анимированные аватары и анимированные рамки аватаров для списка друзей и чата [4].\n\n"
    },
    {
      "title": "Не удаётся корректно запустить Steam",
      "level": 3,
      "content": "Попробуйте выполнить:\n\n```\n$ steam-runtime --reset\n```\n\nЭто может устранить различные проблемы, возникающие при сломанной установке.\n\n"
    },
    {
      "title": "Отсутствует меню в панели задач",
      "level": 3,
      "content": "Если при нажатии на значок Steam в панели задач не появляется меню, возможно, необходимо установить пакеты libappindicator-gtk2 и lib32-libappindicator-gtk2 и перезапустить Steam.\n\n"
    },
    {
      "title": "Ошибка \"Ваш браузер не поддерживает минимальный набор функций, необходимых для просмотра этой трансляции\"",
      "level": 3,
      "content": "Если при попытке просмотра потока/трансляции вы получаете ошибку «Ваш браузер не поддерживает минимальный набор функций, необходимых для просмотра этой трансляции», попробуйте выполнить следующие два шага:\n\n1. Перейдите в Сообщество -> Трансляции. Если на странице появится сообщение «Обновление Steam», подождите несколько минут, чтобы увидеть, завершится ли процесс, и отмените его через некоторое время, если он не завершится. Теперь проверьте, можете ли вы смотреть трансляции, например, нажав на одну из тех, что отображаются в разделе Сообщество -> Трансляции.\n1. Запустите трансляцию в режиме Big Picture (Вид -> Режим Big Picture). Если трансляция нормально запускается в режиме Big Picture, проверьте, работает ли она после переключения обратно в основной интерфейс.\n\n"
    },
    {
      "title": "Использование системных рамок и заголовка окна",
      "level": 3,
      "content": "В настоящее время Steam пытается сам управлять своими окнами, но делает это некорректно, смотрите steam-for-linux#1040. В качестве обходного пути вы можете использовать проект steamwm. Запустите steam следующим образом: ./steamwm.cpp steam. Также проект предоставляет скин, который убирает неестественные кнопки управления и рамки, но оставляет стандартные декорации скина.\n\n"
    },
    {
      "title": "Проблемы со Steam Remote Play",
      "level": 2,
      "content": "Смотрите Steam (Русский)#Steam Remote Play.\n\n"
    },
    {
      "title": "Remote Play не работает с хоста Arch Linux на гостя Arch Linux",
      "level": 3,
      "content": "Возможно, отсутствует lib32-libcanberra. Как только вы установите его, всё должно заработать.\n\nПосле этого Steam больше не будет падать при попытке запустить игру через Remote Play.\n\n"
    },
    {
      "title": "Аппаратное декодирование недоступно",
      "level": 3,
      "content": "Аппаратное декодирование Remote Play использует vaapi, но steam требует libva2_32bit, в то время как Arch по умолчанию использует 64bit.\n\nБазовый набор — libva и lib32-libva. Пользователям графики Intel также потребуются libva-intel-driver и lib32-libva-intel-driver.\n\nДля получения дополнительной информации о vaapi смотрите статью Аппаратное ускорение видео.\n\nТакже может потребоваться удалить версию libva, которую предоставляет Steam runtime, чтобы заставить использовать системные библиотеки. Текущую используемую библиотеку можно найти с помощью команды:\n\n```\n$ pgrep steam | xargs -I {} cat /proc/{}/maps | grep libva\n```\n\nЕсли используемая библиотека находится в ~/.local/Share/steam, значит Steam всё ещё использует свою версию libva. Удалите файлы библиотеки libva в ~/.local/share/Steam/ubuntu12_32/steam-runtime/i386/usr/lib/i386-linux-gnu/libva*, чтобы Steam стал использовать системные библиотеки.\n\n"
    },
    {
      "title": "Режим Big Picture сворачивает себя после потери фокуса",
      "level": 3,
      "content": "Это может произойти, если вы играете в игру через Remote Play или если у вас многомониторная установка и вы выводите мышь за пределы окна Big Picture. Чтобы предотвратить это, установите переменную окружения SDL_VIDEO_MINIMIZE_ON_FOCUS_LOSS=0 и перезапустите Steam.\n\nСмотрите также steam-for-linux issue 4769.\n\n"
    },
    {
      "title": "Библиотека Steam в разделе NTFS",
      "level": 3,
      "content": "Если ваша библиотека Steam находится в разделе NTFS, то вполне вероятно, что игры, находящиеся там, не могут запуститься.\n\nПроблема в том, что Wine использует двоеточие в своём каталоге $WINEPREFIX/dosdevices, а NTFS, похоже, не поддерживает это.\n\nРешение проблемы: переместите каталоги steamapps/common/Proton x.y и steamapps/compatdata на диск без NTFS, затем создайте символическую ссылку в их исходных местах.\n\n```\n$ mv SteamLibrary/steamapps/common/Proton\\ x.y /home/user/dir/\n$ mv SteamLibrary/steamapps/compatdata /home/user/dir/\n$ ln -s /home/user/dir/Proton\\ x.y/ SteamLibrary/steamapps/common/Proton\\ x.y\n$ ln -s /home/user/dir/compatdata/ SteamLibrary/steamapps/compatdata\n```\n\n"
    },
    {
      "title": "Wrong ELF class",
      "level": 3,
      "content": "Если в консольном выводе Steam вы увидите следующее сообщение\n\n```\nERROR: ld.so: object '~/.local/share/Steam/ubuntu12_32/gameoverlayrenderer.so' from LD_PRELOAD cannot be preloaded (wrong ELF class: ELFCLASS32): ignored.\n```\n\nможно это игнорировать. На самом деле это не является ошибкой: Steam включает как 64-, так и 32-битные версии некоторых библиотек, и только одна версия будет успешно загружена. Эта «ошибка» отображается даже тогда, когда Steam (и внутриигровой оверлей) работает идеально.\n\n"
    },
    {
      "title": "Настройка нескольких мониторов",
      "level": 3,
      "content": "Наличие нескольких мониторов может помешать запуску игр. Попробуйте отключить все дополнительные мониторы, а затем запустите игру. Вы сможете включить их после успешного запуска игры.\n\nТакже вы можете попробовать запустить Steam с установленной переменной окружения:\n\n```\n$ export LD_LIBRARY_PATH=/usr/lib32/nvidia:/usr/lib/nvidia:$LD_LIBRARY_PATH\n```\n\n"
    },
    {
      "title": "Текст повреждён или отсутствует",
      "level": 3,
      "content": "Попробуйте установить lib32-fontconfig, ttf-liberation и wqy-zenhei (для азиатских символов), затем перезапустите Steam и посмотрите, решилась ли проблема.\n\n```\n$ fc-match -v Arial\n```\n\n"
    },
    {
      "title": "SetLocale('en_US.UTF-8') не срабатывает при запуске игры или ввод не-ASCII символов не работает в клиенте Steam",
      "level": 3,
      "content": "Сгенерируйте локаль en_US.UTF-8 UTF-8. Смотрите Локали#Генерирование локалей.\n\n"
    },
    {
      "title": "Missing libc",
      "level": 3,
      "content": "Это может быть связано с повреждением исполняемого файла Steam. Проверьте вывод:\n\n```\n$ ldd ~/.local/share/Steam/ubuntu12_32/steam\n```\n\nЕсли ldd утверждает, что это не динамический исполняемый файл, то Steam, скорее всего, повредил двоичный файл во время обновления. Следующие действия должны устранить проблему:\n\n```\n$ cd ~/.local/share/Steam/\n$ ./steam.sh --reset\n```\n\nЕсли это не помогло, попробуйте удалить каталог ~/.local/share/Steam/ и запустите Steam снова, попросив его переустановить себя.\n\nЭто также может возникнуть из-за ошибки в Steam, которая возникает, когда каталог $HOME заканчивается на слеш (Valve GitHub issue 3730). Это можно исправить, отредактировав /etc/passwd и изменив /home/пользователь/ на /home/пользователь. После этого перелогиньтесь и запустите Steam, и он должен будет успешно починить себя.\n\n"
    },
    {
      "title": "Игры не запускаются на старом оборудовании Intel",
      "level": 3,
      "content": "На старом оборудовании Intel, не поддерживающем OpenGL 3, таком как чипы Intel GMA или процессоры Westmere, игры могут сразу же аварийно завершаться при запуске. Это проявляется как ошибка gameoverlayrenderer.so в /tmp/dumps/mobile_stdout.txt, но в файле /tmp/gameoverlayrenderer.log видна ошибка GLXBadFBConfig.\n\nЭто можно исправить, заставив игру использовать более позднюю версию OpenGL, чем она хочет. Добавьте MESA_GL_VERSION_OVERRIDE=3.1 MESA_GLSL_VERSION_OVERRIDE=140 в её параметры запуска.\n\n"
    },
    {
      "title": "Mesa: Игра не запускается, жалуясь на версию OpenGL, поддерживаемую картой",
      "level": 3,
      "content": "Некоторые игры неправильно используют OpenGL выше 3.0. В Mesa приложение должно запросить определённый core profile. Если оно не делает такого запроса, доступны только OpenGL 3.0 и ниже.\n\nЭто можно исправить, заставив игру использовать ту версию OpenGL, которая ей действительно нужна. Добавьте MESA_GL_VERSION_OVERRIDE=4.1 MESA_GLSL_VERSION_OVERRIDE=410 в её параметры запуска.\n\n"
    },
    {
      "title": "Игры 2K не запускаются на разделах XFS",
      "level": 3,
      "content": "Если вы запускаете игры, изданные 2K, такие как Civilization 5, на разделах XFS, то игра может не запускаться или работать неправильно из-за того, как игра загружает файлы при запуске. [5]\n\n"
    },
    {
      "title": "Контроллер Steam не определяется корректно",
      "level": 3,
      "content": "Смотрите Gamepad#Steam Controller.\n\n"
    },
    {
      "title": "Контроллер Steam приводит к падению игры",
      "level": 3,
      "content": "Смотрите Gamepad#Steam Controller makes a game crash or not recognized.\n\n"
    },
    {
      "title": "Steam зависает на \"Installing breakpad exception handler...\"",
      "level": 3,
      "content": "BBS#177245\n\nЕсли у вас графический процессор Nvidia и Steam выдаёт следующее сообщение:\n\n```\nRunning Steam on arch rolling 64-bit\nSTEAM_RUNTIME is enabled automatically\nInstalling breakpad exception handler for appid(steam)/version(0_client)\n```\n\nи после этого больше ничего не происходит, убедитесь, что у вас установлены правильные драйверы, а также их 32-битные версии (64-битный и 32-битный варианты должны иметь одинаковые версии): смотрите NVIDIA (Русский)#Установка.\n\n"
    },
    {
      "title": "Завершение автономных композиторов при запуске игр",
      "level": 3,
      "content": "С помощью подстановки %command% в параметрах запуска можно завершить автономные композиторы (такие как Xcompmgr или picom), использование которого может вызывать лаги и разрывы в некоторых играх на некоторых системах, и запустить их снова после завершения игры.\n\n```\nkillall композитор && %command%; nohup композитор &\n```\n\nКонечно, вы также можете добавлять свои опции к %command% или композитор.\n\nSteam будет следить за всеми процессами, запущенными после %command%, из-за чего он будет считать, что вы находитесь в игре. Поэтому в этом примере мы запускаем композитор через nohup, чтобы не был привязан к Steam (он будет продолжать работать, если вы закроете Steam), а после него ставим амперсанд, чтобы эта команда запуска не дожидалась завершения работы процесса и завершила свою работу, тем самым оповестив Steam о закрытии игры.\n\nЕсли ваш композитор поддерживает запуск в режиме демона, то можно использовать это. Например, picom(1) имеет опцию --daemon / -b для запуска в фоне:\n\n```\nkillall picom && %command%; picom -b\n```\n\n"
    },
    {
      "title": "Symbol lookup error при использовании DRI3",
      "level": 3,
      "content": "Steam выдаёт эту ошибку и завершает работу.\n\n```\nsymbol lookup error: /usr/lib/libxcb-dri3.so.0: undefined symbol: xcb_send_request_with_fds\n```\n\nЧтобы обойти эту проблему, запустите Steam с переменной окружения LIBGL_DRI3_DISABLE=1, отключив DRI3 для Steam.\n\n"
    },
    {
      "title": "Запуск игр на ноутбуках Nvidia optimus",
      "level": 3,
      "content": "Чтобы иметь возможность играть в игры, требующие использования видеокарты Nvidia (например, Hitman 2016) на ноутбуке с поддержкой optimus, нужно запускать игру с префиксом primusrun в параметрах запуска. В противном случае игра не будет работать.\n\nЩёлкните правой кнопкой мыши игру в библиотеке Steam и выберите Свойства > Общие > Параметры запуска. Измените параметры на\n\n```\nprimusrun %command%\n```\n\nРаньше запуск всего Steam через primusrun работал. Однако Steam изменил поведение, и теперь запуск Steam с primusrun не влияет на запуск игр. В результате вам нужно установить параметры запуска для каждой игры отдельно (и вам НЕ нужно запускать сам Steam через primusrun).\n\nДля primusrun по умолчанию включена вертикальная синхронизация, что может привести к ощутимому инпут-лагу, немного снизить производительность и привязать частоту кадров игры к частоте обновления монитора. Для отключения вертикальной синхронизации в primusrun значение опции vblank_mode по умолчанию должно быть переопределено переменной окружения.\n\n```\nvblank_mode=0 primusrun %command%\n```\n\nТо же самое с optirun, который использует primus в качестве моста.\n\n```\nvblank_mode=0 optirun -b primus %command%\n```\n\nЕсли это не сработало, попробуйте:\n\n```\nLD_PRELOAD=\"libpthread.so.0 libGL.so.1\" __GL_THREADED_OPTIMIZATIONS=1 optirun %command%\n```\n\nСмотрите Bumblebee#Primusrun mouse delay (disable VSYNC) для более подробной информации.\n\n"
    },
    {
      "title": "HiDPI",
      "level": 3,
      "content": "Поддержка HiDPI должна работать из коробки, хотя на некоторых системах может понадобиться установить переменную окружения GDK_SCALE=, чтобы задать нужный коэффициент масштабирования.\n\n"
    },
    {
      "title": "Поддержка протоколов в KDE Plasma",
      "level": 3,
      "content": "Если вы получаете ошибку после запуска игры через веб-браузер (или открытия ссылки через xdg-open)\n\n```\nError — KIOExec\nFile not found: steam://run/440\n```\n\nПерейдите в Параметры системы -> Приложения -> Привязки файлов, добавьте новую, выберите группу inode и назовите её vnd.kde.service.steam, затем в разделе Приоритет приложений добавьте Steam. Примените изменения, и после этого всё должно работать.\n\n"
    },
    {
      "title": "Игра падает при использовании Steam Linux Runtime - Soldier",
      "level": 3,
      "content": "Начиная с Proton 5.13, Steam по умолчанию использует Steam Linux Runtime - Soldier. Некоторые игры падают при его использовании.\n\nЧтобы обойти это, вы можете:\n\n- Вручную собрать Proton без Steam Runtime.\n- Заменить скрипт точки входа в Soldier:\n\n```\n~/.steam/steam/steamapps/common/SteamLinuxRuntime_soldier/_v2-entry-point\n```\n\n```\n#!/bin/bash\n\nshift 2\nexec \"${@}\"\n```\n\n"
    },
    {
      "title": "Игры, запущенные с Proton 5.13+, не имеют подключения к интернету",
      "level": 3,
      "content": "Если вы используете systemd-resolved для разрешения доменных имён, убедитесь, что вы создали символическую ссылку resolv.conf, как описано в разделе systemd-resolved (Русский)#DNS.\n\nФайл должен содержать что-то подобное:\n\n```\n/etc/resolv.conf\n```\n\n```\n# This is /run/systemd/resolve/stub-resolv.conf managed by man:systemd-resolved(8).\n# Do not edit.\n```\n\n"
    },
    {
      "title": "\"could not determine 32/64 bit of java\"",
      "level": 3,
      "content": "Забытая установка пакета linux-steam-integrationAUR вызвала это, по крайней мере, в одной игре. Раньше были конфликты между версиями некоторых библиотек из системы и из Steam runtime, и этот пакет помог разрешить некоторые из них. Неясно, помогает ли он до сих пор, но его удаление устранило описанное выше сообщение об ошибке в Project Zomboid. Решение было найдено, когда было замечено, что выполнение команды projectzomboid.sh из командной строки работает, но изменение параметров запуска на sh -xc 'echo %command%; declare -p' показало, что Steam пытается выполнить точно такую же команду, но в preload и path вставлено множество библиотек с префиксом lsi-.\n\n"
    },
    {
      "title": "Дёргания в Vulkan",
      "level": 3,
      "content": "Если вы заметили постоянное сильное дёргание каждые 1-2 секунды, возможно, в настройках вертикальной синхронизации есть конфликты. Ручная настройка vsync в параметрах, возможно, исправит ситуацию.\n\nЗайдите в свойства игры и настройте параметры запуска:\n\n```\nDXVK_FRAME_RATE=60 %command%\n```\n\n"
    },
    {
      "title": "Принудительное использование Wine Direct3D в Proton",
      "level": 3,
      "content": "В некоторых случаях игра может не работать с DXVK, который используется по умолчанию. Можно попробовать принудительно запустить приложение с Direct3D, установив параметры запуска:\n\n```\nPROTON_USE_WINED3D=1 %command%\n```\n\n"
    }
  ]
}