{
  "title": "Steam (Русский)",
  "url": "https://wiki.archlinux.org/title/Steam_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Steam/Решение проблем\n- Steam/Game-specific troubleshooting\n- Gaming (Русский)\n- Gamepad (Русский)\n- Список игр\n\nSteam — это популярная платформа для распространения игр, созданная компанией Valve.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Включите репозиторий multilib и установите пакет steam.\n\nДля запуска Steam на Arch Linux должны быть выполнены следующие требования:\n\n- Установлена 32-битная версия драйвера OpenGL.\n- Сгенерирована локаль en_US.UTF-8, предотвращающая ошибку недопустимого указателя.\n- Графический интерфейс активно использует шрифт Arial; смотрите статью Шрифты Microsoft. В качестве альтернативы можно использовать ttf-liberation или шрифты, которые предоставляет Steam.\n- Установите wqy-zenhei, чтобы добавить поддержку азиатских языков.\n- Если для управления сетью используется systemd-networkd, установите lib32-systemd, чтобы Steam мог подключаться к своим серверам.\n- Если для DNS используется systemd-resolved, выполните эти шаги для настройки /etc/resolv.conf, чтобы Steam мог выполнять разрешение доменных имён.\n\n"
    },
    {
      "title": "SteamCMD",
      "level": 3,
      "content": "Установите steamcmdAUR для версии Steam для командной строки.\n\n"
    },
    {
      "title": "Альтернативная установка Flatpak",
      "level": 3,
      "content": "Steam также может быть установлен с помощью Flatpak как com.valvesoftware.Steam из Flathub. Самый простой способ установить его для текущего пользователя — использовать репозиторий Flathub:\n\n```\n$ flatpak --user remote-add --if-not-exists flathub https://dl.flathub.org/repo/flathub.flatpakrepo\n$ flatpak --user install flathub com.valvesoftware.Steam\n$ flatpak run com.valvesoftware.Steam\n```\n\nВ настоящее время приложение Flatpak не поддерживает темы. Также в настоящее время нельзя запускать игры через optirun/primusrun, подробнее смотрите Issue#869.\n\nSteam, установленный через Flatpak, не может получить доступ к вашему домашнему каталогу, и переопределение этого приведёт к тому, что Steam не запустится, так как это небезопасно. Однако вы можете свободно добавлять каталоги, находящиеся за пределами домашнего каталога. Если вы хотите добавить внешнюю библиотеку, выполните следующую команду для её добавления:\n\n```\n$ flatpak override --user com.valvesoftware.Steam --filesystem=/путь/к/каталогу\n```\n\nЗапуск Steam с помощью Flatpak может предупредить вас об установке пакета steam-devices. В настоящее время этот пакет не существует, но вместо него можно установить game-devices-udevAUR; смотрите Gamepad#Device permissions.\n\n"
    },
    {
      "title": "Проблемы с азиатскими шрифтами в Flatpak",
      "level": 4,
      "content": "Если у вас возникли проблемы с отображением азиатских шрифтов в игре, это связано с тем, что org.freedesktop.Platform не содержит их. Сначала попробуйте смонтировать локальный шрифт:\n\n```\n$ flatpak run --filesystem=~/.local/share/fonts --filesystem=~/.config/fontconfig com.valvesoftware.Steam\n```\n\nЕсли это не сработает, попробуйте этот хак: сделайте шрифты доступными, напрямую скопировав файлы шрифтов в каталоги org.freedesktop.Platform, например:\n\n```\n# замените ? на вашу версию и хэш\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/?/?/files/etc/fonts/conf.avail\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/?/?/files/etc/fonts/conf.d\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/?/?/files/share/fonts\n```\n\n"
    },
    {
      "title": "Структура каталогов",
      "level": 2,
      "content": "По умолчанию Steam устанавливается в каталог ~/.local/share/Steam. Если Steam не может найти его, он предложит вам переустановить его или выбрать новое место. В этой статье используется символическая ссылка ~/.steam/root для обозначения места установки.\n\n"
    },
    {
      "title": "Папки библиотеки",
      "level": 3,
      "content": "Каждое приложение Steam имеет уникальный AppID, который можно найти, посмотрев адрес страницы приложения в магазине Steam или посетив SteamDB.\n\nSteam устанавливает игры в каталог БИБЛИОТЕКА/steamapps/common/. БИБЛИОТЕКА обычно располагается в ~/.steam/root, но можно добавить дополнительные папки (Steam > Настройки > Загрузки > Папки библиотеки Steam).\n\nЧтобы Steam распознал игру, в каталоге БИБЛИОТЕКА/steamapps/ должен быть файл appmanifest_AppId.acf. Файл appmanifest использует формат KeyValues, и его свойство installdir определяет название каталога игры.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "```\nsteam [ -options ] [ steam:// URL ]\n```\n\nДоступные опции описаны здесь: Command Line Options article on the Valve Developer Wiki.\n\nSteam также принимает Steam URL; смотрите Steam browser procotol.\n\n"
    },
    {
      "title": "Параметры запуска",
      "level": 2,
      "content": "При запуске игры Steam выполняет её команду запуска в оболочке Bash. Для изменения команды Steam предоставляет параметры запуска, которые можно установить для игры, щёлкнув на ней правой кнопкой мыши в библиотеке, выбрав Свойства и открыв вкладку Общие.\n\nПо умолчанию Steam просто добавляет прописанные вами параметры к стандартной команде запуска. Чтобы установить переменные окружения или передать команду запуска в качестве аргумента другой команде, используйте подстановку %command%.\n\n"
    },
    {
      "title": "Примеры",
      "level": 3,
      "content": "- только аргументы: -foo\n- переменные окружения: FOO=bar BAZ=bar %command% -baz\n- совершенно другая команда: othercommand # %command%\n\n"
    },
    {
      "title": "Запуск в свёрнутом виде",
      "level": 3,
      "content": "Можно сделать так, чтобы при запуске Steam сворачивался в системный трей, а не перехватывал фокус в своё окно. Просто добавьте -silent в список аргументов при запуске. Чтобы Steam всегда запускался свёрнутым при запуске через ярлык, отредактируйте его, как описано в статье Ярлыки приложений#Изменение ярлыков.\n\n"
    },
    {
      "title": "Компактный режим",
      "level": 3,
      "content": "Можно сократить потребление ОЗУ до 5 раз, отключив Web-составляющую (~1100 МБ → 210 МБ). Уменьшение функциональности может компенсировать Big Picture. Для тех, кто использует Steam Community только через браузер, это изменение будет особенно полезно.\n\nВыберите Вид > Компактный режим. Steam сразу переключится в компактный режим и будет использовать его по умолчанию при следующих запусках. Этот режим отображает список игр без использования веб-компонентов, но браузер всё равно инициализируется.\n\nЧтобы браузер совсем не инициализировался, запустите Steam с аргументом -no-browser. Чтобы этот аргумент всегда использовался при запуске через ярлык, отредактируйте его, как описано в статье Ярлыки приложений#Изменение ярлыков.\n\n"
    },
    {
      "title": "Пользовательский интерфейс Steam Deck",
      "level": 3,
      "content": "Запустите Steam один раз с параметрами запуска -steamdeck -gamepadui. Это позволит загрузить обновление Steam Deck и выполнить шаги по настройке Steam Deck. Последующие запуски требуют только опции -gamepadui.\n\nПользовательский интерфейс Steam Deck ожидает, что будет запущен NetworkManager. Если он не запущен, вы можете получить ложные ошибки сети.\n\n"
    },
    {
      "title": "Патч fsync",
      "level": 3,
      "content": "Патчи fsync от Valve улучшают производительность многопоточных приложений, запускаемых через Proton или Wine. Эти патчи есть в ванильном ядре, начиная с Linux 5.16, так что никаких дополнительных действий не требуется, кроме использования свежей версии Proton или пропатченной сборки Wine. Более ранние версии ядра с поддержкой fsync доступны одним из следующих способов:\n\n- Установите ядро linux-zen, которое содержит патчи fsync с релиза 5.2 [2]\n\n"
    },
    {
      "title": "Proton Steam-Play",
      "level": 3,
      "content": "Компания Valve разработала инструмент совместимости для Steam Play на основе Wine и дополнительных компонентов под названием Proton. Он позволяет запускать многие игры Windows (смотрите список совместимости).\n\nОн имеет открытый исходный код и доступен на GitHub. Steam устанавливает свои собственные версии Proton, когда включен Steam Play.\n\nProton должен быть включен в клиенте Steam: Steam > Настройки > Steam Play. В этом диалоге вы можете включить Steam Play для игр, которые были и не были внесены в белый список Valve.\n\nЧтобы принудительно включить Proton или определённую версию Proton для отдельной игры, щёлкните правой кнопкой мыши на игре, нажмите Свойства > Совместимость > Принудительно использовать определённый инструмент совместимости Steam Play и выберите нужную версию. Это также можно использовать для того, чтобы заставить игры, имеющие порт для Linux, использовать версию для Windows.\n\nВы также можете установить Proton из AUR с помощью protonAUR[ссылка недействительна: package not found] или proton-gitAUR[ссылка недействительна: package not found], но для их работы со Steam требуется дополнительная настройка. Подробности о том, как Steam распознает установки Proton, смотрите на Proton GitHub.\n\nProton поддерживает интеграцию с Easy Anti Cheat, если разработчик игры активирует её, однако для EAC может потребоваться пропатченная версия библиотеки glibc: если другие пользователи сообщают, что игра работает, а у вас она не работает, попробуйте использовать Flatpak-версию Steam, так как с ней поставляется уже пропатченный glibc.\n\n"
    },
    {
      "title": "Steam Input",
      "level": 3,
      "content": "Если контроллер подключен во время работы Steam, поведение Steam по умолчанию заключается в том, чтобы оставить его в покое и позволить играм использовать его как есть. Доступ к устройствам геймпада evdev и joystick предоставляется ядром, и игры могут использовать их с помощью таких API, как SDL2, как если бы Steam не участвовал в процессе.\n\nПодсистема Steam Input предлагает слой абстракции, который позволяет использовать более продвинутые функции, такие как переназначение кнопок и осей, специфичные для игры профили и выполнение более высокоуровневого сопоставления кнопок на основе игровых действий. Steam Input Configurator (SIC) — это часть системы, которая реализует эту функциональность. Чтобы включить Steam Input для контроллера, перейдите в Steam > Настройки > Контроллер > Основные настройки контроллера. [3] Откроется меню настроек Big Picture, где вы можете включить одну из опций Польз. настройки, соответствующую вашему контроллеру.\n\n"
    },
    {
      "title": "Steam Input Configurator",
      "level": 4,
      "content": "Когда SIC включен для контроллера, появляется несколько различных устройств, связанных с этим контроллером:\n\n- Виртуальный контроллер Steam, используемый играми, которые используют API ввода Steam. Все переназначения и функции, специфичные для Steam, работают. Не следует путать с Valve Steam Controller, физическим контроллером.\n- Устройство evdev, представляющее эмулированный контроллер Xbox 360, используется в играх, не поддерживающих Steam Input. Работают базовые переназначения. [4]\n- Оригинальное evdev-устройство контроллера, чей ввод передаётся в SIC. Переназначения не работают, но игры должны по умолчанию использовать контроллер 360.\n- Аналоги джойстиков двух вышеупомянутых устройств.\n\n- Не следует путать с Valve Steam Controller, физическим контроллером.\n\nПоведение SIC зависит от контекста:\n\n- При запуске игры, которая поддерживает Steam Input API, она использует SIC в родном режиме (native mode). Игра получает «действия», а не сырой ввод. Это работает для игр, запущенных в Proton, которые использовали бы Steam Input в Windows. Хотя теоретически эмулированный контроллер 360 в данном случае не нужен, он всё равно присутствует. Игра может решить обеспечить как поддержку Steam Input, так и традиционные библиотеки API ввода, которые под капотом используют evdev и joystick. Когда игра запускается с помощью Steam и с включенным SIC для контроллера, Steam Input имеет более высокий приоритет. Игра также может поддерживать только Steam Input. Например, в игре Among Us геймпад не будет работать, если у вас не запущен SIC.\n- При запуске игры, которая не поддерживает Steam Input, она (неосознанно) использует SIC в legacy mode. Игра получает ожидаемый ею сырой ввод от того, что выглядит как контроллер 360, но на самом деле SIC подделывает его, чтобы эмулировать желаемое поведение native mode. Это происходит с Linux-играми, использующими evdev или joystick, а также с играми для Windows, запускаемыми через Proton, которые используют DirectInput или XInput.\n- При запуске игры, которая не поддерживает ни Steam Input, ни другие API геймпада, SIC может активировать профиль, эмулирующий поддержку геймпада, как описано ниже.\n- Когда в фокусе находится Big Picture, действует текущий профиль Big Picture, настраиваемый через Steam > Настройки > Контроллер > Настройки для режима Big Picture.\n- Когда в фокусе находится что-либо другое, действует текущий профиль рабочего стола, настраиваемый через Steam > Настройки > Контроллер > Настройки для ПК.\n- Когда что-либо в фокусе, дополнительные глобальные сочетания клавиш можно настроить через Steam > Настройки > Контроллер > Настройки при зажатой кнопке Steam.\n\n- Это работает для игр, запущенных в Proton, которые использовали бы Steam Input в Windows.\n- Хотя теоретически эмулированный контроллер 360 в данном случае не нужен, он всё равно присутствует.\n- Игра может решить обеспечить как поддержку Steam Input, так и традиционные библиотеки API ввода, которые под капотом используют evdev и joystick. Когда игра запускается с помощью Steam и с включенным SIC для контроллера, Steam Input имеет более высокий приоритет.\n- Игра также может поддерживать только Steam Input. Например, в игре Among Us геймпад не будет работать, если у вас не запущен SIC.\n\n- Это происходит с Linux-играми, использующими evdev или joystick, а также с играми для Windows, запускаемыми через Proton, которые используют DirectInput или XInput.\n\nИгры оцениваются по тому, насколько полно они поддерживают геймпад. Игра может иметь один из трёх значков в интерфейсе Big Picture: [5]\n\n- Полностью заполненный значок геймпада, указывающий на то, что игра имеет полную поддержку контроллера. Этого можно добиться, даже если игра не использует Steam Input API; основное внимание уделяется доступности независимо от API.\n- Наполовину заполненный значок геймпада, указывающий на то, что игра имеет частичную поддержку геймпада. Даже если игра использует Steam Input API, есть случаи, как в Team Fortress 2, когда некоторые части игры всё ещё недоступны, что оправдывает эту оценку.\n- Значок клавиатуры, указывающий на то, что игра не имеет встроенной поддержки геймпада.\n\nВ случаях, когда игра не имеет полной поддержки геймпада, SIC пытается заполнить пробелы. Например, в Bloons Tower Defense 5, игре, требующей наведения курсора и нажатия, Steam автоматически активирует профиль Клавиатура (WASD) и мышь, позволяя вам использовать геймпад для перемещения и нажатия.\n\n"
    },
    {
      "title": "Рекомендации по использованию Steam Input",
      "level": 4,
      "content": "Подведём итоги, что все это означает для использования:\n\n- Включение «Польз. настройки» в настройках Big Picture является рекомендуемым для расширенной поддержки геймпада, такой как переназначение по своему вкусу, или автоматические исправления, такие как ремаппинг кнопок в стиле Nintendo или клавиатуры/мыши.\n- Для некоторых игр включение этой опции является обязательным, если они не поддерживают традиционные API геймпада.\n- По умолчанию, если вы включили эту функцию, контроллер не будет работать с играми не из Steam, поскольку контроллер 360 имеет приоритет над оригинальным устройством контроллера, а в профиле Desktop по умолчанию кнопки отключены. Чтобы исправить это, вы можете: Установить профиль рабочего стола на шаблон Геймпад. Это перенаправит ввод в контроллер 360, сделав устройство по умолчанию пригодным для использования в других программах. Заставить другую игру использовать оригинальное устройство, если она это поддерживает. Обратите внимание, что игра не получит никакой пользы от переназначений, настроенных в Steam Input. Полностью отключить функциональность контроллера, чтобы Steam вообще не создавал контроллер 360. Обратите внимание, что тогда игры Steam не получат преимущества от расширенной поддержки геймпада. Закрывать Steam перед запуском игр не из Steam.\n\n- Установить профиль рабочего стола на шаблон Геймпад. Это перенаправит ввод в контроллер 360, сделав устройство по умолчанию пригодным для использования в других программах.\n- Заставить другую игру использовать оригинальное устройство, если она это поддерживает. Обратите внимание, что игра не получит никакой пользы от переназначений, настроенных в Steam Input.\n- Полностью отключить функциональность контроллера, чтобы Steam вообще не создавал контроллер 360. Обратите внимание, что тогда игры Steam не получат преимущества от расширенной поддержки геймпада.\n- Закрывать Steam перед запуском игр не из Steam.\n\n"
    },
    {
      "title": "Режим Big Picture без оконного менеджера",
      "level": 3,
      "content": "Чтобы запустить Steam в режиме Big Picture из экранного менеджера, вы можете:\n\n- Установить steamos-compositorAUR[ссылка недействительна: package not found]\n- Или установить steamos-compositor-plusAUR, который скрывает раздражающее мигание цветов при запуске игр Proton и добавляет исправление для игр, запускающихся в фоновом режиме\n- Вручную добавить запись Steam (но вы потеряете преимущества steam compositor: в основном вы не сможете управлять режимом Big Picture с клавиатуры или геймпада):\n\nсоздайте файл /usr/share/xsessions/steam-big-picture.desktop со следующим содержимым:\n\n```\n/usr/share/xsessions/steam-big-picture.desktop\n```\n\n```\n[Desktop Entry]\nName=Steam Big Picture Mode\nComment=Start Steam in Big Picture Mode\nExec=/usr/bin/steam -bigpicture\nTryExec=/usr/bin/steam\nIcon=\nType=Application\n```\n\n"
    },
    {
      "title": "Скины Steam",
      "level": 3,
      "content": "Интерфейс Steam может быть настроен с помощью скинов. Скины могут перезаписывать специфические для интерфейса файлы в ~/.steam/root.\n\nЧтобы установить скин:\n\n1. Поместите его каталог в ~/.steam/root/skins.\n1. Откройте Steam > Настройки > Интерфейс и выберите его.\n1. Перезапустите Steam.\n\nОбширный список скинов можно найти в этом сообщении на форумах Steam.\n\n"
    },
    {
      "title": "Создание скинов",
      "level": 4,
      "content": "Почти все стили Steam определены в ~/.steam/root/resource/styles/steam.styles (в файле более 3500 строк). Чтобы скин был распознан, ему необходим собственный resource/styles/steam.styles. Когда обновление Steam изменяет официальный steam.styles, ваш скин может стать устаревшим, что может привести к визуальным ошибкам.\n\nСмотрите ~/.steam/root/skins/skins_readme.txt, чтобы узнать, как создавать скины.\n\n"
    },
    {
      "title": "Изменение положения уведомлений Steam",
      "level": 3,
      "content": "По умолчанию уведомление Steam расположено внизу справа.\n\nВы можете изменить положение уведомлений Steam, изменив Notifications.PanelPosition в\n\n- resource/styles/steam.styles для уведомлений на рабочем столе, и\n- resource/styles/gameoverlay.styles для внутриигровых уведомлений.\n\nОба файла перезаписываются Steam при запуске, а steam.styles считывается только при запуске.\n\n"
    },
    {
      "title": "Использование скина",
      "level": 4,
      "content": "Вы можете создать скин, чтобы изменить положение уведомления по своему вкусу. Например, чтобы изменить положение уведомления на правое верхнее:\n\n```\n$ cd ~/.steam/root/skins\n$ mkdir -p Top-Right/resource\n$ cp -r ~/.steam/root/resource/styles Top-Right/resource\n$ sed -i '/Notifications.PanelPosition/ s/\"[A-Za-z]*\"/\"TopRight\"/' Top-Right/resource/styles/*\n```\n\n"
    },
    {
      "title": "Изменение на лету",
      "level": 4,
      "content": "gameoverlay.styles может быть перезаписан во время работы Steam, что позволяет менять положение уведомления для игр по отдельности.\n\n```\n~/.steam/notifpos.sh\n```\n\n```\nsed -i \"/Notifications.PanelPosition/ s/\\\"[A-Za-z]*\\\"/\\\"$1\\\"/\" ~/.steam/root/resource/styles/gameoverlay.styles\n```\n\nТеперь в #Параметры запуска можно прописать что-то вроде:\n\n```\n~/.steam/notifpos.sh TopLeft && %command%\n```\n\n"
    },
    {
      "title": "Steam Remote Play",
      "level": 3,
      "content": "Steam имеет встроенную поддержку удалённой игры.\n\nСмотрите это руководство сообщества Steam о том, как настроить headless-сервер для стриминга на Linux.\n\n"
    },
    {
      "title": "Совместное использование игр с Windows при использовании Proton",
      "level": 3,
      "content": "Если вы используете Proton (Steam Play) для запуска игр, но по каким-то причинам сохраняете установку Windows (например, если у какой-то игры есть проблемы с анти-читом или если вы хотите провести сравнительные тесты с Windows), вы можете захотеть хранить ваши игры в общем разделе вместо того, чтобы держать две копии игры по одной на каждую ОС. Как это настроить, описано в вики проекта на GitHub: https://github.com/ValveSoftware/Proton/wiki/Using-a-NTFS-disk-with-Linux-and-Windows\n\nЧтобы добавить другую папку для библиотеки, нажмите на Steam → Настройки → Загрузки → Папки библиотеки Steam, затем на кнопку ⊕.\n\n"
    },
    {
      "title": "Слои совместимости, отличные от Proton",
      "level": 3,
      "content": "Существуют средства совместимости, отличные от Proton/Wine.\n\n- Luxtorpeda — Запуск игр с использованием нативных Linux-движков.\n\n- Boxtron — Запуск DOS игр с помощью нативного DOSBox\n\nВы также можете использовать protonup-qtAUR для управления ими:\n\n1. Закройте Steam\n1. Установите пакет protonup-qtAUR\n1. Откройте protonup-qt и установите необходимые инструменты\n1. Запустите Steam\n1. В окне свойств игры на вкладке «Совместимость» выберите «Принудительно использовать определённый инструмент совместимости Steam Play» и выберите нужный инструмент.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Смотрите Steam/Решение проблем.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Gentoo:Steam\n- Большой список игр без DRM на Steam на PCGamingWiki\n- Список игр без DRM в Fandom\n- Linux-игры в магазине Steam\n- Proton Инструмент совместимости для Steam Play на основе Wine и дополнительных компонентов.\n\n"
    }
  ]
}