{
  "title": "Steam (Português)",
  "url": "https://wiki.archlinux.org/title/Steam_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Steam/Troubleshooting\n- Steam/Game-specific troubleshooting\n- Gaming\n- Gamepad\n- List of games\n\nSteam é uma plataforma de distribuição de jogos criado pela Valve.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Habilite o repositório multilib e instale o pacote steam.\n\nOs seguintes requisitos devem ser cumpridos para executar o Steam no Arch Linux:\n\n- Instalado versão 32-bit do driver gráfico OpenGL.\n- Gerado o locale pt_BR.UTF-8, evitando um erro de ponteiro inválido.\n- A GUI utiliza muito a fonte Arial. Veja Microsoft fonts. Uma alternativa é usar ttf-liberation ou fontes fornecidas pelo Steam.\n- Instale wqy-zenhei para adicionar suporte à linguas asiáticas.\n- Se você estiver usando systemd-networkd para gerenciamento de rede, instale lib32-systemd para que o Steam seja capaz de conectar-se aos seus servidores.\n\n"
    },
    {
      "title": "SteamCMD",
      "level": 3,
      "content": "Instale steamcmdAUR para a versão de linha de comando do Steam.\n\n"
    },
    {
      "title": "Instalação alternativa pelo Flatpak",
      "level": 3,
      "content": "Steam também pode ser instalado com o Flatpak como com.valvesoftware.Steam do Flathub. A forma mais fácil de instalá-lo para o usuário atual é usando o repositório Flathub e o comando flatpak:\n\n```\nflatpak --user remote-add --if-not-exists flathub https://dl.flathub.org/repo/flathub.flatpakrepo\n flatpak --user install flathub com.valvesoftware.Steam\n flatpak run com.valvesoftware.Steam\n```\n\nA aplicação Flatpak atualmente não suporta temas. Você também não pode rodar jogos via optirun/primusrun, veja Issue#869 para mais detalhes.\n\nSteam instalado via Flatpak não é capaz de acessar seu diretório pessoal e alterar isso fará com que o Steam não inicie, por não ser seguro. Porém, você pode adicionar diretórios fora do diretório pessoal livremente. Se você quiser adicionar uma biblioteca externa, rode o seguinte comando para adicionar:\n\n```\nflatpak override com.valvesoftware.Steam --filesystem=/path/to/directory\n```\n\n"
    },
    {
      "title": "Problemas com fontes asiáticas pelo Flatpak",
      "level": 4,
      "content": "Se você está tendo problemas em fazer com que fontes asiáticas apareçam em jogos, é porque org.freedesktop.Platform não as inclue. Primeiramente, tente montar sua fonte local:\n\n```\nflatpak run --filesystem=~/.local/share/fonts --filesystem=~/.config/fontconfig  com.valvesoftware.Steam\n```\n\nSe isso não funcionar, considere essa modificação: copie diretamente os arquivos da fonte nos diretórios do org.freedesktop.Platform, por exemplo:\n\n```\n# substitua ? com sua versão e hash\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/?/?/files/etc/fonts/conf.avail\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/?/?/files/etc/fonts/conf.d\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/?/?/files/share/fonts\n```\n\n"
    },
    {
      "title": "Estrutura do diretório",
      "level": 2,
      "content": "A localização da instalação padrão do Steam é ~/.local/share/Steam. Se o Steam não puder encontrar o diretório, solicitará que você reinstale ou selecione um novo diretório. Esse artigo usa o symlink ~/.steam/root para se referir ao diretório da instalação.\n\n"
    },
    {
      "title": "Pastas da biblioteca",
      "level": 3,
      "content": "Toda aplicação Steam tem um AppID único, que você pode descobrir olhando o caminho de sua página na Loja Steam ou visitando o site SteamDB.\n\nO Steam instala os jogos em um diretório em LIBRARY/steamapps/common/. LIBRARY normalmente é ~/.steam/root, mas você também pode ter múltiplas pastas de biblioteca (Steam > Configurações > Downloads > Pastas de Biblioteca).\n\nPara o Steam reconhecer um jogo, ele precisa ter um arquivo appmanifest_AppId.acf em LIBRARY/steamapps/. O arquivo appmanifest usa o formato KeyValues e a sua propriedade installdir determina o nome do diretório do jogo.\n\n"
    },
    {
      "title": "Utilização",
      "level": 2,
      "content": "```\nsteam [ -options ] [ steam:// URL ]\n```\n\nPara as opções de linha de comando disponíveis, veja o artigo de Opções de Linha de Comando na Valve Developer Wiki.\n\nO Steam também aceita opcionalmente um Steam URL, veja o protocolo do Steam browser.\n\n"
    },
    {
      "title": "Opções de inicialização",
      "level": 2,
      "content": "Quando você inicia um jogo, o Steam executa seu comando de inicialização em uma shell Bash Para deixar você alterar o comando de inicialização, o Steam providencia opcções de inicialização, que podem ser definidos para um jogo clicando-o com o botão direito em sua biblioteca, selecionando Propriedades e clicando em Definir opções de inicialização.\n\nPor padrão, o Steam apenas anexa suas opções no comando de inicialização. Para definir variáveis de ambiente ou passar o comando de inicialização como um argumento de outro comando, você pode utilizar o substituto %command%.\n\n"
    },
    {
      "title": "Exemplos",
      "level": 3,
      "content": "- apenas argumentos: -foo\n- variáveis de ambiente: FOO=bar BAZ=bar %command% -baz\n- comando completamente diferente: outrocomando # %command%\n\n"
    },
    {
      "title": "Steam Deck UI",
      "level": 3,
      "content": "Start Steam once with launch options -steamdeck -gamepadui. It should download the Steam Deck update and take you through the Steam Deck setup steps. Subsequent launches require only the -gamepadui option.\n\n"
    },
    {
      "title": "Iniciar minimizado",
      "level": 3,
      "content": "É possível com que o Steam inicie minimizado na bandeja do sistema, adicionando -silent na lista de argumentos no arquivo de inicialização automática.\n\n```\n~/.config/autostart/steam.desktop\n```\n\n```\n...\nExec=/usr/bin/steam -silent\n...\n```\n\n"
    },
    {
      "title": "Patch Fsync",
      "level": 3,
      "content": "A Valve lançou um patch especial para o kernel que deve ajudar a aumentar o FPS em aplicações com muitos processos. Existem alguns métodos de obter e utilizar esse patch:\n\n- Instalar o kernel linux-zen que inclue os patches fsync desde a versão 5.2. [2]\n\n"
    },
    {
      "title": "Proton Steam-Play",
      "level": 3,
      "content": "A Valve desenvolveu uma ferramenta de compatibilidade para o Steam Play baseado no Wine e componentes adicionais. Ela permite iniciar vários jogos do Windows (veja a lista de compatibilidade).\n\nÉ de código aberto e disponível no GitHub. O Steam irá instalar suas próprias versões do Proton quando o Steam Play estiver habilitado.\n\nO Proton precisa ser habilitado no cliente Steam: Steam > Configurações > Steam Play. Você pode habilitar o Steam Play tanto para jogos que foram permitidos pela Valve e para os que não foram.\n\nSe preciso, para forçar o Proton a ser habilitado ou uma versão específica do Proton para um jogo, clique com o botão direito no jogo, clique em Propriedades > Geral > Forçar o uso de uma ferramenta específica de compatibilidade do Steam Play, e selecione a versão desejada. Isso também pode ser usado para forçar jogos que tem uma versão para Linux a usar a versão para Windows.\n\nVocê também pode instalar o Proton da AUR com protonAUR[link quebrado: package not found] ou proton-gitAUR[link quebrado: package not found], mas é necessário configuração adicional para funcionar com o Steam. Veja o GitHub do Proton para detalhes de como o Steam reconhece instalações do Proton.\n\n"
    },
    {
      "title": "Modo Big Picture sem um window manager",
      "level": 3,
      "content": "Para iniciar o Steam no modo Big Picture de um Display manager, você pode: To start Steam in Big Picture Mode from a Display manager, you can either:\n\n- Instalar steamos-compositorAUR[link quebrado: package not found]\n- Alternativamente, instalar steamos-compositor-plusAUR, que esconde as cores piscando na inicialização de jogos pelo Proton e adiciona uma correção para jogos que iniciam em segundo plano.\n- Manualmente adicionar uma entrada para o Steam (mas você perde as vantagens do compostitor steam: principalmente, você não pode controlar o modo Big Picture com o teclado ou controle):\n\nCrie um arquivo /usr/share/xsessions/steam-big-picture.desktop com o seguinte conteúdo:\n\n```\n/usr/share/xsessions/steam-big-picture.desktop\n```\n\n```\n[Desktop Entry]\nName=Steam Big Picture Mode\nComment=Start Steam in Big Picture Mode\nExec=/usr/bin/steam -bigpicture\nTryExec=/usr/bin/steam\nIcon=\nType=Application\n```\n\n"
    },
    {
      "title": "Temas Steam",
      "level": 3,
      "content": "A interface do Steam pode ser customizado usando temas. Temas podem sobrescrever arquivos específicos de interface no ~/.steam/root.\n\nPara instalar um tema:\n\n1. Coloque seu diretório em ~/.steam/root/skins.\n1. Abra Steam > Configurações > Interface e selecione-o.\n1. Reinicie o Steam.\n\nUma lista extensiva de temas pode ser encontrado nesse post nos fóruns da Steam.\n\n"
    },
    {
      "title": "Criando temas",
      "level": 4,
      "content": "Quase todos temas do Steam são definidos em ~/.steam/root/resource/styles/steam.styles (o arquivo tem mais de 3.500 linhas). Para um tema ser reconhecido ele precisa de seu próprio resource/styles/steam.styles. Quando uma atualização do Steam muda o steam.styles oficial, seu tema pode ficar desatualizado, potencialmente resultando em erros visuais.\n\nVeja ~/.steam/root/skins/skins_readme.txt para uma introdução em como criar temas.\n\n"
    },
    {
      "title": "Alterando a posição da notificação do Steam",
      "level": 3,
      "content": "A posição padrão da notificação do Steam é no canto inferior direito.\n\nVocê pode mudar a posição da notificação do Steam alterando o Notifications.PanelPosition em\n\n- resource/styles/steam.styles para notificações da desktop, e\n- resource/styles/gameoverlay.styles para notificações no jogo.\n\nOs dois arquivos são sobrescrevidos pelo Steam na inicialização e steam.styles é lido apenas na inicialização.\n\n"
    },
    {
      "title": "Usando um tema",
      "level": 4,
      "content": "Você pode criar um tema para mudar a posição da notificação do seu jeito. Por exemplo, para mudar a posição para o canto superior direito:\n\n```\n$ cd ~/.steam/root/skins\n$ mkdir -p Top-Right/resource\n$ cp -r ~/.steam/root/resource/styles Top-Right/resource\n$ sed -i '/Notifications.PanelPosition/ s/\"[A-Za-z]*\"/\"TopRight\"/' Top-Right/resource/styles/*\n```\n\n"
    },
    {
      "title": "Live patching",
      "level": 4,
      "content": "gameoverlay.styles pode ser sobrescrito enquando o Steam está rodando, permitindo que você tenha posições de notificação específicas para cada jogo.\n\n```\n~/.steam/notifpos.sh\n```\n\n```\nsed -i \"/Notifications.PanelPosition/ s/\\\"[A-Za-z]*\\\"/\\\"$1\\\"/\" ~/.steam/root/resource/styles/gameoverlay.styles\n```\n\nE as #Opções de inicialização devem ser algo como:\n\n```\n~/.steam/notifpos.sh TopLeft && %command%\n```\n\n"
    },
    {
      "title": "Steam Remote Play",
      "level": 3,
      "content": "O Steam tem suporte embutido para remote play.\n\nVeja esse guia na Comunidade Steam de como configurar um servidor headless de streaming no Linux.\n\n"
    },
    {
      "title": "Steam Controller",
      "level": 3,
      "content": "Normalmente um Steam Controller requer o uso da sobreposição Steam. Porém, em jogos não-Steam nativos para Linux a sobreposição pode não ser prática. Para isso, enquanto o cliente Steam está rodando, ele irá manter uma \"configuração de desktop\". Com seu Steam Controller, altere sua configuração de desktop para um controle genérico de XBOX. Desde que o cliente Steam esteja rodando, você pode usar o seu Steam Controller em outros jogos, como jogos da GOG, como um controle de XBOX. Certifique-se de selecionar seu tipo de controle para mapear nas configurações gerais do controle.\n\n"
    },
    {
      "title": "Solução de problemas",
      "level": 2,
      "content": "Veja Steam/Troubleshooting.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Gentoo:Steam\n- The Big List of DRM-Free Games on Steam no PCGamingWiki\n- List of DRM-free games no Fandom\n- Loja Linux do Steam\n- Proton Ferramenta de compatibilidade para Steam Play baseado no Wine e componentes adicionais.\n\n"
    }
  ]
}