{
  "title": "Steam (Français)",
  "url": "https://wiki.archlinux.org/title/Steam_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Articles apparentés\n\n- Steam/Troubleshooting\n- Steam/Game-specific troubleshooting\n- Gaming\n- Gamepad\n- List of games\n- Gamescope\n\nSteam est une plateforme populaire de distribution de jeux créée par Valve.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Activez le dépôt multilib et installez le paquet steam (recommendé) ou le paquet steam-native-runtime pour utiliser Steam avec les bibliothèques système native. Voir la section Steam/Troubleshooting#Steam runtime (en).\n\nPour exécuter Steam sur Arch Linux :\n\n- Vous devez avoir installé la version 32-bit des polites graphiques OpenGL.\n- Si vous ne l'avez pas fait pendant l'installation, vous devrez générer les locales en_US.UTF-8 pour éviter des erreurs de pointeurs.\n- Si vous avez besoin d'ajouter des dossiers de bibliothèque ou d'ajouter des jeux non-Steam à votre bibliothèque Steam, installez XDG Desktop Portal (en) avec un backend fournissant un sélecteur de fichiers.\n\n- L'interface graphique utilisant largement la police Arial, vous devez soit : Utiliser l'alternative libre ttf-liberation. Ajouter Microsoft fonts(en) pour installer les polices originales. Appliquer la solution de contournement Steam/Troubleshooting#Text is corrupt or missing (en) pour utiliser une autre police de caractères.\n- Si vous avez besoin d'un support CJK, installez wqy-zenhei.\n- Si vous utilisez systemd-networkd pour la gestion du réseau, installez lib32-systemd pour que Steam soit en mesure de se connecter à ses serveurs.\n- Si vous utilisez systemd-resolved pour le DNS, suivez les étapes pour corriger /etc/resolv.conf pour que Steam soit capable de résoudre ses noms de domaines.\n- Si vous utilisez le mode Big Picture (l'interface utilisateur du Steam Deck), NetworkManager peut être nécessaire pour que les panneaux liés au réseau fonctionnent correctement.\n- vm.max_map_count doit être augmenté afin de faire fonctionner certains jeux sans plantage. plus d'information, voir la section Gaming#Increase vm.max_map_count (en).\n\n- Utiliser l'alternative libre ttf-liberation.\n- Ajouter Microsoft fonts(en) pour installer les polices originales.\n- Appliquer la solution de contournement Steam/Troubleshooting#Text is corrupt or missing (en) pour utiliser une autre police de caractères.\n\n"
    },
    {
      "title": "SteamCMD",
      "level": 3,
      "content": "Installez steamcmdAUR pour obtenir la version de Steam en ligne de commande.\n\n"
    },
    {
      "title": "Structure du dossier",
      "level": 2,
      "content": "L'emplacement d'installation par défaut de Steam est ~/.local/share/Steam. Si Steam ne le trouve pas, il vous demandera de le réinstaller ou de sélectionner le nouvel emplacement. Cet article utilise le lien symbolique ~/.steam/root pour faire référence à l'emplacement d'installation.\n\n"
    },
    {
      "title": "Bibliothèque Steam",
      "level": 3,
      "content": "Chaque application Steam possède un identifiant unique, que vous pouvez trouver en consultant le chemin d'accès à la page Steam Store ou en visitant SteamDB.\n\nSteam installe les jeux dans le dossier LIBRARY/steamapps/common/. Le dossier LIBRARY se situe normalement dans ~/.steam/root, mais vous pouvez aussi avoir plusieurs dossiers de bibliothèque (Steam > Paramètres > Stockage > ⊕ Ajouter un disque).\n\nPour que Steam reconnaisse un jeu, il doit y avoir un fichier appmanifest_AppId.acf dans LIBRARY/steamapps/. Le fichier appmanifest utilise le format KeyValues et sa propriété installdir détermine le nom du répertoire du jeu.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "```\nsteam [ -options ] [ steam:// URL ]\n```\n\nPour les options de ligne de commande disponibles, voir l'article sur les options de ligne de commande sur le Developer Wiki de Valve.\n\nSteam accepte également une URL Steam optionnelle, Steam browser procotol.\n\n"
    },
    {
      "title": "Options de lancement",
      "level": 2,
      "content": "Lorsque vous lancez un jeu Steam, Steam exécute sa commande de lancement avec /bin/sh.\n\nPour vous permettre de modifier la commande de lancement, Steam fournit des options de lancement. Ces options peuvent être définies pour un jeu en faisant un clic droit sur celui-ci dans votre bibliothèque, cliquez sur Propriété..., dans l'onglet Général se trouve les Options de lancement.\n\nPar défaut, Steam ajoute simplement votre chaîne d'options à la commande de lancement. Pour définir des variables d'environnement ou passer la commande de lancement comme argument d'une autre commande, vous pouvez utiliser le substitut %command%.\n\n"
    },
    {
      "title": "Exemples",
      "level": 3,
      "content": "- Un argument seul : -truc\n- Des variables d'environnements : TOTO=tutu TRUC=machin %command% -truc\n- Une commande complètement différente : unecommande # %command%\n\n"
    },
    {
      "title": "Démarrage minimisé",
      "level": 3,
      "content": "Il est possible de faire en sorte que Steam démarre en étant minimisé dans la barre d'état système, plutôt que de prendre le focus. Ajoutez -silent à la liste des arguments de la ligne de commande. Consultez Desktop entries#Modify desktop files (en) pour appliquer ce comportement par défaut.\n\n"
    },
    {
      "title": "Mode réduit",
      "level": 3,
      "content": "Steam supporte une interface alternative et minimale avec seulement votre liste de jeux. Les vues du magasin, de la communauté et la galerie d'étagère de jeux sont cachés. Vous pouvez y accéder en sélectionnant Affichage > Mode réduit. Pour revenir à l'interface standard, sélectionnez Affichage > Mode large.\n\n"
    },
    {
      "title": "Proton Steam-Play",
      "level": 3,
      "content": "Valve a développé un outil de compatibilité pour Steam Play basé sur Wine et des composants supplémentaires, nommé Proton. Il permet de lancer de nombreux jeux Windows (voir la liste des jeux compatible).\n\nC'est un logiciel libre disponible sur GitHub. Steam installera ses propres versions de Proton lorsque Steam Play est activé.\n\nProton doit être activé sur le client Steam : Steam > Paramètres > Compatibilité. Vous pouvez activer Steam Play pour les jeux qui ont été ou non inscrits sur la liste blanche de Valve dans cette boîte de dialogue.\n\nProton supporte l'intégration Easy Anti Cheat si le développeur l'active, cependant EAC peut nécessiter une version patchée(en) particulière de glibc : si un jeu est signalé comme fonctionnant mais n'est pas dans votre machine, essayez d'utiliser Steam Flatpak parce qu'il est livré avec glibc patché.\n\n"
    },
    {
      "title": "Forcer l'utilisation de Proton",
      "level": 4,
      "content": "Si nécessaire, pour forcer l'utilisation de Proton ou une version spécifique de Proton pour un jeu, faites un clic droit sur le jeu, cliquez sur Propriétés > Compatibilité > Forcer l'utilisation d'un outil de compatibilité Steam Play spécifique, puis sélectionnez la version désirée. Cette méthode peut également être utilisée pour forcer les jeux qui ont un portage Linux à utiliser la version Windows.\n\n"
    },
    {
      "title": "Utiliser Proton en dehors de Steam",
      "level": 4,
      "content": "Vous pouvez installer Proton depuis AUR avec protonAUR[broken link: package not found] ou proton-gitAUR[broken link: package not found], mais une configuration supplémentaire est nécessaire pour qu'ils fonctionnent avec Steam. Le GitHub de Proton donne plus de détails sur la façon dont Steam reconnaît les installations Proton.\n\n"
    },
    {
      "title": "Steam Input",
      "level": 3,
      "content": "Lorsqu'une manette est branchée alors que Steam est en cours d'exécution, le comportement par défaut de Steam est de la laisser tranquille et de laisser les jeux l'utiliser telle quelle. Le noyau expose les périphériques evdev et joystick du gamepad, et les jeux peuvent les utiliser via des API telles que SDL2, indépendamment de Steam.\n\nLe sous-système Configurateur de Steam Input offre une couche d'abstraction. Il permet des fonctionnalités plus avancées telles que le mappage des boutons et des axes, l'existence de profils spécifiques au jeu et la réalisation de mappages de boutons de plus haut niveau en fonction des actions du jeu. Le Configurateur de Steam Input (CSI) est la partie du système qui met en œuvre cette fonctionnalité. Pour activer la fonction Steam Input pour une manette, allez dans Steam > Paramètres > Contrôleur > Paramètres généraux. [2] Cela ouvrira un menu à partir des paramètres de Big Picture, où vous pourrez activer l'option Configuration correspondant à votre manette.\n\n"
    },
    {
      "title": "Configurateur de Steam Input",
      "level": 4,
      "content": "Lorsque le CSI est activé pour un contrôleur, il existe plusieurs dispositifs de contrôle différents :\n\n- Le Steam Controller virtuel, utilisé par les jeux qui utilisent l'API Steam Input. Toutes les fonctions de rebinding et les fonctions spécifiques à Steam sont fonctionnelles. À ne pas confondre avec le contrôleur physique Valve Steam Controller.\n- Un périphérique evdev représentant un contrôleur Xbox 360 émulé, utilisé par les jeux qui ne prennent pas en charge Steam Input. Le rebinding de base est en vigueur. steam_controller/steam_input_gamepad_emulation_bestpractices\n- Le périphérique evdev de la manette d'origine, dont les entrées sont transmises par le CSI. Les rebindings ne sont pas en vigueur, mais les jeux devraient utiliser par défaut la manette 360 à la place.\n- Les joysticks analogiques aux deux dispositifs ci-dessus.\n\n- À ne pas confondre avec le contrôleur physique Valve Steam Controller.\n\nLe comportement du CSI dépend du contexte :\n\n- Lors du lancement d'un jeu qui prend en charge l'API Steam Input, il utilise le CSI en mode natif. Le jeu reçoit des \"actions\" plutôt que des entrées brutes à gérer. Cette méthode fonctionne pour les jeux qui tournent dans Proton et qui utiliseraient Steam Input sous Windows. Même si, en théorie, elle n'est pas nécessaire, la manette 360 émulée reste présente. Un jeu peut choisir de prendre en charge à la fois l'entrée Steam et les bibliothèques d'API d'entrée classiques qui s'en remettent à evdev et au joystick. Lorsque le jeu est lancé avec Steam et que CSI est activé pour la manette, Steam Input est prioritaire. Un jeu peut également choisir de ne prendre en charge que Steam Input. Par exemple, dans Among Us, une manette de jeu ne fonctionnera que si CSI est activée\n- Lors du lancement d'un jeu qui ne prend pas en charge Steam Input, il utilise (sans le savoir) le CSI en mode hérité. Le jeu reçoit les entrées brutes de bas niveau attendues de ce qui semble être une manette 360, mais elles sont en fait manipulées par le CSI pour émuler le comportement souhaité du mode natif. C'est le cas pour les jeux natifs qui utilisent evdev ou un joystick, ainsi que pour les jeux Windows fonctionnant via Proton qui utilisent DirectInput ou XInput.\n- Lors du lancement d'un jeu qui ne prend pas en charge Steam Input ou d'autres API de manette de jeu, CSI peut activer un profil qui émule la prise en charge de la manette de jeu, comme décrit ci-dessous.\n- When Big Picture has focus, the current Big Picture profile is in effect, configurable via Steam > Settings > Controller > Big Picture Configuration.\n- When anything else has focus, the current Desktop profile is in effect, configurable via Steam > Settings > Controller > Desktop Configuration.\n- When anything has focus, additional global bindings can be configured via Steam > Settings > Controller > Guide Button Chord Configuration.\n\n- Cette méthode fonctionne pour les jeux qui tournent dans Proton et qui utiliseraient Steam Input sous Windows.\n- Même si, en théorie, elle n'est pas nécessaire, la manette 360 émulée reste présente.\n- Un jeu peut choisir de prendre en charge à la fois l'entrée Steam et les bibliothèques d'API d'entrée classiques qui s'en remettent à evdev et au joystick. Lorsque le jeu est lancé avec Steam et que CSI est activé pour la manette, Steam Input est prioritaire.\n- Un jeu peut également choisir de ne prendre en charge que Steam Input. Par exemple, dans Among Us, une manette de jeu ne fonctionnera que si CSI est activée\n\n- C'est le cas pour les jeux natifs qui utilisent evdev ou un joystick, ainsi que pour les jeux Windows fonctionnant via Proton qui utilisent DirectInput ou XInput.\n\nLes jeux sont évalués en fonction de l'étendue de leur prise en charge de la manette de jeu. Un jeu peut avoir l'une des trois icônes de l'interface utilisateur Big Picture : [3]\n\n- Une icône de manette de jeu entière, indiquant que le jeu prend en charge toutes les manettes. Cela est possible même si le jeu n'utilise pas l'API Steam Input ; l'accent est mis sur l'accessibilité quelle que soit l'API.\n- Icône de manette de jeu à moitié remplie, indiquant que le jeu prend partiellement en charge les manettes de jeu. Même si le jeu utilise l'API d'entrée Steam, il y a des cas comme Team Fortress 2 où certaines parties sont encore inaccessibles, ce qui justifie cette note.\n- Une icône de clavier, indiquant que le jeu n'est pas compatible avec les manettes de jeu.\n\nDans les cas où le jeu ne prend pas totalement en charge la manette de jeu, CSI tente de combler les lacunes. Par exemple, dans Bloons Tower Defense 5, un jeu qui nécessite de pointer et de cliquer, Steam active automatiquement le profil \"Clavier et souris\", ce qui vous permet d'utiliser votre manette de jeu pour vous déplacer et cliquer.\n\n"
    },
    {
      "title": "Utilisation recommandée Steam Input",
      "level": 4,
      "content": "Pour résumer :\n\n- L'activation de l'option \" Prise en charge de la configuration \" dans les paramètres de Big Picture est \" recommandée \" pour améliorer la prise en charge des manettes de jeu, comme le rebinding à sa guise, ou les corrections automatisées comme le remappage des boutons à la sauce Nintendo ou la combinaison clavier/souris.\n- Pour certains jeux, l'activation de cette fonction est \"obligatoire\" s'ils ne prennent pas en charge les API traditionnelles de la manette de jeu.\n- Par défaut, si vous avez activé cette option, la manette ne fonctionnera pas avec les jeux non-Steam, car la manette 360 a la priorité sur le périphérique d'origine, mais les boutons sont désactivés dans le profil de bureau par défaut. Pour résoudre ce problème, vous pouvez soit : Régler le profil de votre bureau sur le modèle Gamepad. Cela transmettra les entrées à la manette 360, rendant le périphérique par défaut utilisable pour d'autres programmes. Demander à l'autre jeu d'utiliser le périphérique d'origine s'il le prend en charge. Notez que le jeu ne profitera d'aucun réajustement de Steam Input. Désactiver l'ensemble de la fonctionnalité pour la manette afin que Steam ne génère pas de manette 360 du tout. Notez que les jeux Steam ne bénéficieront alors pas de la prise en charge optimisée pour les manettes. Fermer Steam lorsque vous utilisez les autres jeux.\n\n- Régler le profil de votre bureau sur le modèle Gamepad. Cela transmettra les entrées à la manette 360, rendant le périphérique par défaut utilisable pour d'autres programmes.\n- Demander à l'autre jeu d'utiliser le périphérique d'origine s'il le prend en charge. Notez que le jeu ne profitera d'aucun réajustement de Steam Input.\n- Désactiver l'ensemble de la fonctionnalité pour la manette afin que Steam ne génère pas de manette 360 du tout. Notez que les jeux Steam ne bénéficieront alors pas de la prise en charge optimisée pour les manettes.\n- Fermer Steam lorsque vous utilisez les autres jeux.\n\n"
    },
    {
      "title": "HiDPI",
      "level": 3,
      "content": "Se référer à HiDPI#Steam(en).\n\n"
    },
    {
      "title": "Mode Big Picture sans gestionnaire de fenêtres",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\n.\n\nPour démarrer Steam en mode Big Picture à partir d'un Gestionnaire d'affichage, vous pouvez soit :\n\n- installer steamos-compositor-plusAUR, qui cache le clignotement gênant des couleurs au démarrage des jeux Proton et ajoute un correctif pour les jeux qui se lancent en arrière-plan\n- Ajouter manuellement une entrée Steam (mais vous perdez les avantages du compositeur Steam : notamment vous ne pourrez pas contrôler le mode Big Picture avec le clavier ou le gamepad) :\n\ncréer un fichier /usr/share/xsessions/steam-big-picture.desktop avec le contenu suivant :\n\n```\n/usr/share/xsessions/steam-big-picture.desktop\n```\n\n```\n[Desktop Entry]\nName=Steam Big Picture Mode\nComment=Start Steam in Big Picture Mode\nExec=/usr/bin/steam -bigpicture\nTryExec=/usr/bin/steam\nIcon=\nType=Application\n```\n\n"
    },
    {
      "title": "Les skins Steam",
      "level": 3,
      "content": "L'interface de Steam peut être personnalisée à l'aide de skins. Suivez ce guide Steam pour plus d'informations.\n\nLes skins mis à jour pour l'interface utilisateur 2023 sont les suivants :\n\n- Adwaita for Steam\n- Shiina's Steam Skins\n- Zehn\n- D'autres skins sont disponibles dans le guide mentionné ci-dessus.\n\n"
    },
    {
      "title": "Modifier la position de la notification de Steam",
      "level": 3,
      "content": "La position par défaut des notifications Steam est en bas à droite.\n\nVous pouvez modifier la position de la notification Steam en modifiant Notifications.PanelPosition dans :\n\n- resource/styles/steam.styles pour les notifications de bureau,\n- resource/styles/gameoverlay.styles pour les notifications dans le jeu.\n\nLes deux fichiers sont écrasés par Steam au démarrage et steam.styles n'est lu qu'au démarrage.\n\n"
    },
    {
      "title": "Utilisation d'un skin",
      "level": 4,
      "content": "Vous pouvez créer un skin pour modifier la position de la notification à votre convenance. Par exemple, pour changer la position en haut à droite :\n\n```\n$ cd ~/.steam/root/skins\n$ mkdir -p Top-Right/resource\n$ cp -r ~/.steam/root/resource/styles Top-Right/resource\n$ sed -i '/Notifications.PanelPosition/ s/\"[A-Za-z]*\"/\"TopRight\"/' Top-Right/resource/styles/*\n```\n\n"
    },
    {
      "title": "Live patching",
      "level": 4,
      "content": "gameoverlay.styles peut être écrasé lorsque Steam est en cours d'exécution, ce qui vous permet d'avoir des positions de notification spécifiques au jeu.\n\n```\n~/.steam/notifpos.sh\n```\n\n```\nsed -i \"/Notifications.PanelPosition/ s/\\\"[A-Za-z]*\\\"/\\\"$1\\\"/\" ~/.steam/root/resource/styles/gameoverlay.styles\n```\n\nEt les #Options de lancement devraient ressembler à ceci : ~/.steam/root/resource/styles/gameoverlay.styles }} :\n\n```\n~/.steam/notifpos.sh TopLeft && %command%\n```\n\n"
    },
    {
      "title": "Steam Remote Play",
      "level": 3,
      "content": "Steam intègre la prise en charge de remote play.\n\nVoir ce guide de la communauté Steam(en) sur la façon de configurer un serveur de streaming headless sous Linux.\n\n"
    },
    {
      "title": "Partager des jeux avec Windows en utilisant Proton",
      "level": 3,
      "content": "Si vous utilisez Proton (Steam Play) pour lancer vos jeux, et que vous conservez une installation Windows pour une raison ou une autre (par exemple, si un jeu a des problèmes avec l'anti cheat ou si vous voulez faire des tests comparatifs avec Windows), vous pouvez vouloir stocker vos jeux dans une partition commune au lieu de conserver deux copies du jeu, une par OS.\n\nPour ajouter un autre dossier à la bibliothèque Steam > Paramètres > Stockage > ⊕ Ajouter un disque (se référer à la section #Bibliothèque Steam)\n\nIl existe trois systèmes de fichiers, qui peuvent être lus/écrits à la fois par Windows et Linux.\n\n"
    },
    {
      "title": "NTFS",
      "level": 4,
      "content": "Consultez https://github.com/ValveSoftware/Proton/wiki/Using-a-NTFS-disk-with-Linux-and-Windows pour plus d'informations sur la façon de configurer cela. Pour lancer des jeux à partir d'un disque NTFS, suivez les étapes de Steam/Troubleshooting#Steam Library in NTFS partition (en).\n\nL'utilisation de NTFS présente des inconvénients. Il arrive souvent que le dossier shaders cache soit corrompu. Les messages disant ntfs3 : sdb6 ino=1921f, steamapprun_pipeline_cache Looks like your dir is corrupt. Vous ne pouvez pas réparer cela à partir de Linux. Vous devez démarrer sous Windows et utiliser chkdsk pour cela.\n\n"
    },
    {
      "title": "EXFAT",
      "level": 4,
      "content": "Ce système de fichiers présente l'inconvénient de ne pas être sensible à la casse. Vous obtiendrez un message de ce type : SteamLibrary has both 'SteamApps' and 'steamapps' directories. This will cause problems. Please fix manually and only keep 'steamapps' Voir issue #7665.\n\n"
    },
    {
      "title": "UDF",
      "level": 4,
      "content": "Ce système de fichiers peut être utilisé sans problème. La seule chose à retenir est que Linux n'a pas encore pris en charge l'écriture de udf 2.50+. Il suffit donc de créer une partition formatée udf dans Gparded, et elle sera 2.01.\n\n"
    },
    {
      "title": "Précompilation des shaders plus rapide",
      "level": 3,
      "content": "Dans certaines circonstances, la précompilation des shaders peut n'utiliser qu'un seul cœur, mais cela peut être modifié par l'utilisateur, par exemple pour utiliser 8 cœurs :\n\n```\n~/.steam/steam/steam_dev.cfg\n```\n\n```\nunShaderBackgroundProcessingThreads 8\n```\n\n"
    },
    {
      "title": "Couches de compatibilité autres que Proton",
      "level": 3,
      "content": "Il existe des outils de compatibilité autres que Proton/Wine.\n\n- Luxtorpeda — Exécuter des jeux à partir de moteurs Linux natifs.\n\n- Boxtron — Exécuter des jeux DOS en utilisant DOSBox nativement sur Linux\n\nVous pouvez également utiliser protonup-qtAUR pour les gérer :\n\n1. Fermer Steam\n1. Installer protonup-qtAUR\n1. Ouvrir protonup-qt et installer les outils désirés\n1. Démarrer Steam\n1. Dans la fenêtre propriétés du jeu, sélectionnez Forcer l'utilisation d'un outil de compatibilité Steam Play spécifique et sélectionnez l'outil désiré.\n\n"
    },
    {
      "title": "Désactiver HTTP2 pour des téléchargement plus rapide",
      "level": 3,
      "content": "Certains systèmes et configurations semblent avoir des problèmes avec HTTP2. La désactivation de HTTP2 permettra probablement des téléchargements plus rapides sur ces configurations.\n\nVous pouvez utiliser la commande de console @nClientDownloadEnableHTTP2PlatformLinux 0 ou la définir dans steam_dev.cfg comme suit :\n\n```\n~/.steam/steam/steam_dev.cfg\n```\n\n```\n@nClientDownloadEnableHTTP2PlatformLinux 0\n```\n\n"
    },
    {
      "title": "Exécuter des jeux avec un GPU discret",
      "level": 3,
      "content": "Sur les ordinateurs portables dotés de cartes graphiques hybrides (en anglais), Steam exécute par défaut les jeux à l'aide du GPU intégré. Voir PRIME#PRIME GPU offloading pour passer au GPU discret plus puissant pour des jeux spécifiques.\n\n"
    },
    {
      "title": "Flatpak",
      "level": 3,
      "content": "Steam peut également être installé avec Flatpak en tant que com.valvesoftware.Steam à partir de Flathub. La façon la plus simple de l'installer est d'utiliser le dépôt Flathub :\n\n```\n$ flatpak --user remote-add --if-not-exists flathub https://dl.flathub.org/repo/flathub.flatpakrepo\n$ flatpak --user install flathub com.valvesoftware.Steam\n$ flatpak run com.valvesoftware.Steam\n```\n\nL'application Flatpak ne prend actuellement pas en charge les thèmes. Vous ne pouvez pas non plus exécuter de jeux via optirun/primusrun, consulter Issue#869 pour plus de détails.\n\nSteam installé via Flatpak n'est pas en mesure d'accéder à votre répertoire personnel et le fait de surcharger ce répertoire empêchera Steam de fonctionner car il n'est pas sûr. Cependant, vous pouvez librement ajouter des répertoires en dehors du répertoire personnel. Si vous souhaitez ajouter une bibliothèque externe, exécutez la commande suivante pour l'ajouter :\n\n```\n$ flatpak override --user com.valvesoftware.Steam --filesystem=/path/to/directory\n```\n\nLe lancement de Steam avec Flatpak peut vous avertir de l'installation du paquet steam-devices. Ce paquet n'existe pas actuellement mais game-devices-udevAUR peut être installé à la place, voir Gamepad#Device permissions.\n\n"
    },
    {
      "title": "Problèmes de polices asiatiques avec Flatpak",
      "level": 4,
      "content": "Si vous avez des problèmes pour afficher les polices de caractères asiatiques dans le jeu, c'est parce que org.freedesktop.Platform ne les inclut pas. Essayez d'abord de monter votre police locale :\n\n```\n$ flatpak run --filesystem=~/.local/share/fonts --filesystem=~/.config/fontconfig com.valvesoftware.Steam\n```\n\nSi cela ne fonctionne pas, envisagez cette astuce : rendez les polices disponibles en copiant directement les fichiers de polices dans les répertoires de org.freedesktop.Platform, par exemple :\n\n```\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/version/hash/files/etc/fonts/conf.avail\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/version/hash/files/etc/fonts/conf.d\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/version/hash/files/share/fonts\n```\n\n"
    },
    {
      "title": "Problèmes de démarrage/exécution du Steam Flatpak",
      "level": 4,
      "content": "Après le lancement, Steam essaiera de télécharger les fichiers. Vous verrez une barre de progression. S'il se bloque, vous pouvez essayer de donner des permissions supplémentaires pour le paquet flatpak :\n\n```\n$ flatpak permission-set background background com.valvesoftware.Steam yes\n$ flatpak run com.valvesoftware.Steam\n```\n\nAutre moyen de contrôler les autorisations : installer flatseal.\n\n"
    },
    {
      "title": "Résolution des problèmes",
      "level": 2,
      "content": "Consultez la page Steam/Troubleshooting (en anglais).\n\n"
    },
    {
      "title": "Voir également",
      "level": 2,
      "content": "- Gentoo:Steam\n- The Big List of DRM-Free Games on Steam sur PCGamingWiki (en)\n- Le magasin Linux sur Steam\n- Proton Outil de compatibilité pour Steam Play basé sur Wine et des composants supplémentaires.\n- ProtonDB, les rapports de compatibilité avec Linux\n- are we anti cheat yet Une liste complète de jeux utilisant des anti-cheats et leur compatibilité avec GNU/Linux ou Wine/Proton.\n\n"
    }
  ]
}