{
  "title": "Steam (Suomi)",
  "url": "https://wiki.archlinux.org/title/Steam_(Suomi)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Aiheeseen liittyen\n\n- Steam/Troubleshooting\n- Steam/Game-specific troubleshooting\n- Gaming\n- Gamepad\n- List of games\n\nSteam on suosittu pelien jakeluun erikoistunut alusta Valvelta.\n\n"
    },
    {
      "title": "Asennus",
      "level": 2,
      "content": "Aktivoi multilib paketinjakelu ja asenna steam paketti.\n\nSeuraavat vaatimukset on täytyttävä Steamin suorittamiseen Arch Linuxissa:\n\n- 32-bittinen versio OpenGL näytönajurista asennettuna.\n- Luotu en_US.UTF-8 paikallistus asetukset, \"väärä osoitin\"-virheilmoituksen korjaamiseksi.\n- Käyttöliittymä käyttää vahvasti Arial fonttia. Katso Microsoft fonts. Vaihtoehtoisesti voidaan sen sijaan käyttää ttf-liberation tai Steamin antamia fontteja.\n- Asenna wqy-zenhei aasialaisten kielien tueksi.\n\n"
    },
    {
      "title": "SteamCMD",
      "level": 3,
      "content": "Asenna steamcmdAUR komentorivi versiolle Steamista.\n\n"
    },
    {
      "title": "Vaihtoehtoinen Flatpak-asennus",
      "level": 3,
      "content": "Steam voidaan myös asentaa Flatpak:in kautta, joka löytyy com.valvesoftware.Steam nimellä Flathubista. Paras tapa asentaa tämä nykyiselle käyttäjälle on Flathub paketinjakelun ja flatpak komennon avulla:\n\n```\nflatpak --user remote-add --if-not-exists flathub https://dl.flathub.org/repo/flathub.flatpakrepo\n flatpak --user install flathub com.valvesoftware.Steam\n flatpak run com.valvesoftware.Steam\n```\n\nFlatpak sovellus ei toistaiseksi tue teemoja. Pelejä ei myöskään voi käyttää optirun/primusrun kanssa, katso Issue#869 lisätiedoille.\n\nSteam asennetuna Flatpakkina ei pääse käsiksi kotipolkuun ja tämän ohittaminen aiheuttaa ongelmia Steamin käynnistämisessä, koska se ei ole turvallista. Polkuja kotipolun ulkopuolelta pystytään lisäämään huoletta. Jos halutaan lisätä ulkopuolinen kirjasto, täytyy suorittaa seuraava komento tämän lisäämiseksi:\n\n```\nflatpak override com.valvesoftware.Steam --filesystem=/polku/kyseiseen/kansioon\n```\n\n"
    },
    {
      "title": "Aasialaisten fonttien ongelmat Flatpakissa",
      "level": 4,
      "content": "Jos aasialaisten fonttien käytössä on ongelmia, se johtuu org.freedesktop.Platform:ista joka ei sisällä näitä. Koita asentaa paikallisfontti komennolla:\n\n```\nflatpak run --filesystem=~/.local/share/fonts --filesystem=~/.config/fontconfig  com.valvesoftware.Steam\n```\n\nJos se ei toimi, harkitse tätä ohituskeinoa: tee fontti löydettäväksi suoraan kopioimalla se org.freedesktop.Platform:ien polkuihin, esim.\n\n```\n# Vaihda ? omalla versiolla ja hash arvolla\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/?/?/files/etc/fonts/conf.avail\n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/?/?/files/etc/fonts/conf.d \n/var/lib/flatpak/runtime/org.freedesktop.Platform/x86_64/?/?/files/share/fonts\n```\n\n"
    },
    {
      "title": "Polkurakenne",
      "level": 2,
      "content": "Steam asentaa oletukselta polkuun ~/.local/share/Steam. Jos Steam ei löydä tätä polkua, Steam pyytää asentamaan sen tai valitsemaan jonkin toisen polun. Tässä artikkelissa käytetään ~/.steam/root symbolista linkkiä referoimaan asennus sijaintiin.\n\n"
    },
    {
      "title": "Kirjastokansiot",
      "level": 3,
      "content": "Jokaisella Steam-sovelluksella on erityinen AppID, joka löytyy sen Steam kaupan sivun polusta.\n\nSteam asentaa pelejä KIRJASTO/steamapps/common/ alla olevaan polkuun. KIRJASTO normaalisti on ~/.steam/root, mutta on myös mahdollista, että kirjasto kansioita on useita (Steam > Asetukset > Lataukset > Steam Kirjastokansiot).\n\nJotta Steam pystyy tunnistamaan eri pelit, niillä täytyy olla appmanifest_AppId.acf tiedosto KIRJASTO/steamapps/ polussa. Appmanifest tiedosto käyttää KeyValue muotoa ja sen installdir ominaisuus on päättellä pelin polun nimi.\n\n"
    },
    {
      "title": "Käyttö",
      "level": 2,
      "content": "```\nsteam [ -options ] [ steam:// URL ]\n```\n\nSaatavilla oleville komentorivi asetuksille, katso Komentorivin Asetukset artikkeli Valven kehittäjien wikissä.\n\nSteam hyväksyy myös vaihtoehtoisen Steam URL:än, katso Steam selaimen protokolla.\n\n"
    },
    {
      "title": "Käynnistysasetukset",
      "level": 2,
      "content": "Kun Steam-peli käynnistetään, Steam suorittaa kyseisen pelin käynnistyskomennon Bash komentotulkissa. Tämän komennon muuttamiseen Steam antaa käynnistysasetukset, joita voidaan muuttaa kun hiiren oikealla näppäimellä klikataan pelistä omassa kirjastossa ja valitsemalla Ominaisuudet ja klikkaamalla Määritä käynnistysasetukset.\n\nOletukselta Steam yksinkertaisesti lisää asetus merkkijonon käynnistys omentoon. Ympäristömuuttujien asettamiseksi tai käynnistyskomennon antaminen argumenttina jossain toisessa komennossa voidaan käyttää %command% korviketta.\n\n"
    },
    {
      "title": "Esimerkkejä",
      "level": 3,
      "content": "- vain argumentit: -foo\n- ympäristömuuttujat: FOO=bar BAZ=bar %command% -baz\n- jokin aivan toinen komento: othercommand # %command%\n\n"
    },
    {
      "title": "Käynnistä Pienennettynä",
      "level": 3,
      "content": "On mahdollista käynnistää Steam pienennettynä järjestelmän kelkkaan, sen sijasta että siihen kohdennettaisiin. Yksinkertaisesti lisää -silent argumenttilistaan autostart-tiedostossa.\n\n```\n~/.config/autostart/steam.desktop\n```\n\n```\n...\nExec=/usr/bin/steam -silent\n...\n```\n\n"
    },
    {
      "title": "Fsync paikkaus",
      "level": 3,
      "content": "Valve on julkaissut erityisen kerneli paikkauksen, jolla pystytään nostamaan FPS:ää massiivisesti säkeistetyissä sovelluksissa. On olemassa muutamia tapoja ottaa tämä käyttöön:\n\n- Asenna linux-zen kernelin, joka sisältää fsync paikkaukset aina 5.2 julkaisusta[2]\n\n"
    },
    {
      "title": "Proton Steam-Play",
      "level": 3,
      "content": "Valve kehitti yhteensopivuustyökalun Steam Play:hin perustuen Wineen ja muihin komponentteihin. Se antaa mahdollisuuden pelata monia Windows-pelejä (katso yhteensopivuuslista).\n\nSe on avointa lähdekoodia ja löytyy Githubista. Steam asentaa oman versionsa Protonista kun Steam Play on aktivoituna.\n\nProton pitää olla aktivoituna Steam asiakasohjelmassa: Steam > Asetukset > Steam Play. Steam Play voidaan aktivoida peleille jotka on tai ei ole Valven omalla valkoisella listalla siinä dialogissa.\n\nJos Protonin käyttö tai jokin Proton versio halutaan pakottaa johonkin peliin voi muutoksia tehdä klikkaamalla hiiren oikealla näppäimellä pelistä, sen jälkeen klikataan Ominaisuudet > Yleinen > Pakota tietyn Steam Play -yhteensopivuustyökalun käyttö, jonka jälkeen valitaan haluttu versio. Tällä tavalla pystytään myös pakottamaan pelit, joilla on Linux-portti, käyttämään Windows-versiota.\n\nProtonin voi myös asentaa AUR:stä protonAUR[broken link: package not found] tai proton-gitAUR[broken link: package not found], mutta pientä lisäjärjestelyä tarvitaan sen toimimiseen Steamissa. Katso Proton Github lisätiedolle siitä, miten Steam tunnistaa Proton-asennukset.\n\n"
    },
    {
      "title": "Televisiotilan käyttö ilman ikkunointiohjelmaa",
      "level": 3,
      "content": "Steamin käynnistäminen televisiotilassa graafisessa kirjautumisohjelmassa, voidaan joko:\n\n- Asentaa steamos-compositorAUR[broken link: package not found]\n- Vaihtoehtoisesti, asentaa steamos-compositor-plusAUR, joka piilottaa ärsyttävän värien välkkymisen Proton-pelien käynnistyksessä ja lisää korjauksen peleille jotka käynnistyvät taustalla\n- Manuaalisesti voidaan lisätä Steam kirjaus (mutta siinä hävitään steam latojan edut: eli et pysty hallitsemaan televisiotilaa näppäimistöllä tai peliohjaimella):\n\nluodaan /usr/share/xsessions/steam-big-picture.desktop tiedosto tällä sisällöllä:\n\n```\n/usr/share/xsessions/steam-big-picture.desktop\n```\n\n```\n[Desktop Entry]\nName=Steam Big Picture Mode\nComment=Start Steam in Big Picture Mode\nExec=/usr/bin/steam -bigpicture\nTryExec=/usr/bin/steam\nIcon=\nType=Application\n```\n\n"
    },
    {
      "title": "Steam käyttöliittymän ulkoasu",
      "level": 3,
      "content": "Steamin käyttöliittymän ulkoasua voidaan muokata käyttämällä ulkoasukansiota eli ns. skinejä. Skineillä ylikirjoitetaan käyttöliittymäkohtaiset tiedostot polussa ~/.steam/root.\n\nUlkoasun asennus:\n\n1. Laita sen kansio ~/.steam/root/skins.\n1. Avaa Steam > Asetukset > Käyttöliittymä ja valitse se.\n1. Uudelleen käynnistä Steam.\n\nLaaja lista ulkoasuista löytyy tästä Steam foorumi postauksesta.\n\n"
    },
    {
      "title": "Ulkoasun luominen",
      "level": 4,
      "content": "Kaikki Steam-tyylit on määritetty ~/.steam/root/resource/styles/steam.styles (tiedosto on yli 3,500 riviä pitkä). Ulkoasun tunnistamista varten se tarvitsee sen oman resource/styles/steam.styles . Kun Steam-päivitys muuttaa virallista steam.styles oma ulkoasu voi vanhentua, jolloin potentiaalisesti voi esiintyä visuaalisia bugeja.\n\nKatso ~/.steam/root/skins/skins_readme.txt ohjeille siitä, miten ulkoasu luodaan.\n\n"
    },
    {
      "title": "Steam-ilmoituksen paikan vaihtaminen",
      "level": 3,
      "content": "Oletuksena Steamin ilmoitusten paikka on oikealla alhaalla.\n\nIlmoitusten paikkaa voi vaihtaa Steamissa muuttamalla Notifications.PanelPosition tiedostoissa\n\n- resource/styles/steam.styles työpöytä ilmoituksille, ja\n- resource/styles/gameoverlay.styles pelin sisäisille ilmoituksille\n\nMolemmat tiedostot ylikirjoitetaan Steamin käynnistyessä ja steam.styles luetaankin vain käynnistyksessä.\n\n"
    },
    {
      "title": "Ulkoasun käyttö",
      "level": 4,
      "content": "Voidaan luoda ulkoasu vaihtamaan ilmoituksen paikkaa haluttuun paikkaa. Esimerkiksi, jos halutaan vaihtaa paikka ylhäälle oikealle:\n\n```\n$ cd ~/.steam/root/skins\n$ mkdir -p Top-Right/resource\n$ cp -r ~/.steam/root/resource/styles Top-Right/resource\n$ sed -i '/Notifications.PanelPosition/ s/\"[A-Za-z]*\"/\"TopRight\"/' Top-Right/resource/styles/*\n```\n\n"
    },
    {
      "title": "Live paikkailu",
      "level": 4,
      "content": "gameoverlay.styles voidaan ylikirjoittaa silloin kun Steam on käynnissä, jolloin saadaan pelikohtainen ilmoituksen paikka.\n\n```\n~/.steam/notifpos.sh\n```\n\n```\nsed -i \"/Notifications.PanelPosition/ s/\\\"[A-Za-z]*\\\"/\\\"$1\\\"/\" ~/.steam/root/resource/styles/gameoverlay.styles\n```\n\nJa #Käynnistysasetukset pitäisi olla jotain seuraavaa:\n\n```\n~/.steam/notifpos.sh TopLeft && %command%\n```\n\n"
    },
    {
      "title": "Steam Remote Play",
      "level": 3,
      "content": "Steamilla on sisäänrakennettu tuki etäpelaamiselle.\n\nKatso tämä Steamin yhteisön ohjekirja päättömän streamaus palvelimen pystyttämisestä Linuxilla.\n\n"
    },
    {
      "title": "Steam-ohjain",
      "level": 3,
      "content": "Normaalisti Steam ohjain tarvitsee Steam-päällyksen käyttöä. Ei Steam alkuperäisille Linux peleille päällys ei ole välttämättä hyödyllinen. Siksi silloin kun Steam asiakasohjelma on käynnissä se pitää yllä \"työpöytä konfiguraatiota\". Steam ohjaimelle voidaan konfiguroida työpöydän konfiguraatiossa se yleisesti XBOX ohjaimena. Niin kauan kun Steam on käynnissä voidaan käyttää Steam ohjainta muissa peleissä, kuten GOG peleissä, XBOX ohjaimena. Muista katsoa \"general controller settings\" oman ohjaimen varalle.\n\n"
    },
    {
      "title": "Windows-pelien jakaminen käyttämällä Protonia / muita yhteensopivuustasoja",
      "level": 3,
      "content": "Protonin myötä yhteensopivuus peleille on noussut Valven ansiosta. Voidaan käyttää omia haarukoituja versioita kuten Proton GE tai muita, lisäämään pelien määrää, jotka sitten vastaavasti toimivat. Tätä voidaan viedä pidemmälle luomalla Steam-kirjasto NTFS levylle, ainoana asiana jää sen hetkisen käyttäjän käyttäjä id:n (uid) ja ryhmä id:n (gid) pakottaminen tälle, jolloin Steam pystyy kirjoittamaan tiedostoja tarpeen mukaan. Täytyy vielä varmistaa, ettei fstab tiedostossa lue noexec asetusta tai Steam ei pysty tunnistamaan pelejä.\n\n"
    },
    {
      "title": "Vianmääritys",
      "level": 2,
      "content": "Katso Steam/Troubleshooting.\n\n"
    },
    {
      "title": "Katso myös",
      "level": 2,
      "content": "- Gentoo Wiki artikkeli\n- Suuri lista DRM-vapaista peleistä Steamissa PCGamingWikissä\n- Lista DRM-vapaista peleistä Wikiassa\n- Steam Linux kauppa\n- Proton yhteensopivuus työkalu Steam Playlle perustuen Wineen ja muihin komponentteihin.\n\n"
    }
  ]
}