{
  "title": "Streamlink (Français)",
  "url": "https://wiki.archlinux.org/title/Streamlink_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Streamlink est un utilitaire en ligne de commande écrit en Python qui vous permet de regarder des flux vidéo en ligne avec des lecteurs vidéo populaires, tels que VLC, MPlayer ou mpv ; voir Player compatibility pour la liste complète.\n\nCe projet est issu de Livestreamer, qui n'est plus maintenu.\n\nLa prise en charge de divers services de diffusion en continu est assurée par des modules d'extension, qui peuvent être facilement ajoutés si nécessaire. De nombreux services de streaming vidéo populaires sont pris en charge dès le départ, notamment Dailymotion, Livestream, Twitch, UStream, YouTube Live et bien d'autres ; voir Plugins pour la liste complète.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installer le paquet streamlink ou streamlink-gitAUR.\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "Le paquet fournit un utilitaire en ligne de commande streamlink, qui est assez facile à utiliser :\n\n```\n$ streamlink -p \"Votre_lecteur\" \"url\" \"stream\"\n```\n\n- Votre_lecteur - nom de l'exécutable de votre lecteur multimédia, par exemple, vlc. Vous pouvez également spécifier un chemin complet si nécessaire : /usr/bin/vlc. Par défaut, VLC sera utilisé s'il peut être trouvé dans son emplacement par défaut.\n- url - Adresse URL du stream. Vous pouvez omettre le protocole (http://) pour les URL HTTP.\n- stream - flux vidéo à lire à partir d'une URL donnée. Cette option permet principalement de sélectionner la qualité vidéo. Utilisez best pour la meilleure qualité et worst pour la moins bonne. Certains plugins peuvent proposer des options de qualité supplémentaires.\n\nPar exemple :\n\n```\n$ streamlink -p mpv dailymotion.com/embed/video/x1b1h6o worst\n```\n\nVoir streamlink(1) pour la liste complète des options disponibles.\n\nPour enregistrer un flux vidéo sur votre disque dur :\n\n```\nstreamlink -o ~/$current_time.m2t \"STREAM URL\" best,high\n```\n\n```\n$ streamlink -p player twitch.tv/nom_de_la_chaîne qualité\n```\n\nPar exemple\n\n```\n$ streamlink -p vlc twitch.tv/archlinux medium\n```\n\nLes qualités de flux disponibles sont : source, high, medium, low et mobile.\n\n"
    },
    {
      "title": "Voir également",
      "level": 2,
      "content": "- Dépôt Streamlink sur GitHub\n- Documentation Streamlink\n\n"
    }
  ]
}