{
  "title": "Streamlink (Polski)",
  "url": "https://wiki.archlinux.org/title/Streamlink_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Streamlink to narzędzie wiersza poleceń napisane w Python, które umożliwia oglądanie strumieni wideo online w popularnych odtwarzaczach wideo, takich jak VLC, MPlayer lub mpv; zobacz Player compatibility , aby uzyskać pełną listę.\n\nTen projekt został rozwidlony z Livestreamer, który nie jest już utrzymywany.\n\nWsparcie dla różnych usług przesyłania strumieniowego zapewniają wtyczki, które w razie potrzeby można łatwo dodać. Wiele popularnych usług przesyłania strumieniowego wideo jest obsługiwanych od razu, w tym Dailymotion, Livestream, Twitch, UStream, YouTube Live i wiele innych; zobacz Plugins, aby uzyskać pełną listę.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiet streamlink lub streamlink-gitAUR.\n\n"
    },
    {
      "title": "Używanie",
      "level": 2,
      "content": "Pakiet zawiera narzędzie wiersza poleceń 'streamlink, które jest dość łatwe w użyciu:\n\n```\n$ streamlink -p your_player url stream\n```\n\n- your_player - nazwa pliku wykonywalnego twojego odtwarzacza multimedialnego, na przykład vlc. W razie potrzeby możesz również podać pełną ścieżkę: /usr/bin/vlc. Domyślnie VLC będzie używany, jeśli można go znaleźć w domyślnej lokalizacji.\n- url URL strumienia. Możesz pominąć protokół (http://) dla adresów URL HTTP.\n- stream - strumień do odtworzenia według podanego adresu URL. Za pomocą tej opcji możesz przede wszystkim wybrać jakość wideo. Użyj best dla najwyższej i worst dla najniższej dostępnej jakości. Określone wtyczki mogą mieć dodatkowe opcje jakości.\n\nNa przykład:\n\n```\n$ streamlink -p mpv dailymotion.com/embed/video/x1b1h6o worst\n```\n\nZobacz stronę streamlink(1) aby zobaczyć pełną listę dostępnych opcji.\n\nAby zapisać strumień na dysku twardym\n\n```\n$ streamlink -o ~/$current_time.m2t \"STREAM URL\" best,high\n```\n\n"
    },
    {
      "title": "Twitch",
      "level": 3,
      "content": "```\n$ streamlink -p player twitch.tv/name_of_channel quality\n```\n\nNa przykład:\n\n```\n$ streamlink -p vlc twitch.tv/archlinux medium\n```\n\nDostępne jakości strumienia to: source, high, medium, low i mobile.\n\n"
    },
    {
      "title": "Zobacz też",
      "level": 2,
      "content": "- Streamlink repository on GitHub\n- Streamlink documentation\n\n"
    }
  ]
}