{
  "title": "Streamlink (Português)",
  "url": "https://wiki.archlinux.org/title/Streamlink_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Streamlink é uma utilidade de linha de comando escrita em Python (Português) que lhe permite assistir streams de video online em players de video populares, como o VLC, MPlayer ou mpv; veja Compatibilidade de player para a lista completa.\n\nEste projeto é um fork de Livestreamer, que não é mais mantido.\n\nO suporte para vários serviços de streaming é fornecido por plugins, que podem ser facilmente adicionados se necessário. Muitos serviços de streaming de video populares são suportados, incluindo Dailymotion, Livestream, Twitch, UStream, YouTube Live e muitos outros; veja Plugins para a lista completa.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote streamlink ou streamlink-gitAUR.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "O pacote fornece uma utilidade de linha de comando streamlink, que é bem fácil de usar:\n\n```\n$ streamlink -p seu_player url stream\n```\n\n- seu_player - nome do executável do seu media player, por exemplo, vlc. Você também pode especificar o caminho completo se precisar: /usr/bin/vlc. Por padrão, o VLC vai ser usado se puder ser achado na localização padrão.\n- url - endereço URL da stream. Você pode omitir o protocolo (http://) para URLs HTTP.\n- stream - stream para reproduzir a URL fornecida. Você pode selecionar a qualidade de video com esta opção. Use best para a maior e worst para a menor qualidade disponível. Plugins específicos podem ter outras opções de qualidade.\n\nPor exemplo:\n\n```\n$ streamlink -p mpv dailymotion.com/embed/video/x1b1h6o worst\n```\n\nVeja a streamlink(1) para a lista completa de opções disponíveis.\n\nPara salvar a stream no seu HDD\n\n```\n$ streamlink -o ~/$current_time.m2t \"STREAM URL\" best,high\n```\n\n"
    },
    {
      "title": "Twitch",
      "level": 3,
      "content": "```\n$ streamlink -p player twitch.tv/nome_do_canal qualidade\n```\n\nPor exemplo:\n\n```\n$ streamlink -p vlc twitch.tv/archlinux medium\n```\n\nAs qualidades de stream disponíveis são: source, high, medium, low e mobile.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Repositório do Streamlink no GitHub\n- Documentação do Streamlink\n\n"
    }
  ]
}