{
  "title": "Su (Русский)",
  "url": "https://wiki.archlinux.org/title/Su_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Пользователи и группы\n- sudo (Русский)\n- Список приложений/Безопасность#Повышение привилегий\n\nsu (substitute user) — это основная утилита, которая используется для выполнения программ от имени друого пользователя в системе, по умолчанию root.\n\nПоведение su можно настроить с помощью PAM.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "su входит в состав пакета util-linux.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Чтобы выполнить вход в другого пользователя, передайте имя пользователя, которым вы хотите стать, в команду su:\n\n```\n# su пользователь\n```\n\nВам будет предложено ввести пароль пользователя, которым вы пытаетесь стать.\n\nЕсли имя пользователя не указано, su по умолчанию будет root, и пароль, который вам будет предложено ввести, должен быть паролем root.\n\nПолная документация доступна в su(1).\n\n"
    },
    {
      "title": "Оболочка входа",
      "level": 3,
      "content": "По умолчанию su остаётся в текущем каталоге и сохраняет переменные окружения исходного пользователя (а не переключается на переменные нового пользователя).\n\nОбратите внимание на следующие важные противоположные соображения:\n\n- Иногда системному администратору может быть полезно использовать учётную запись обычного пользователя, а не свою собственную. В частности, иногда наиболее эффективным способом решения проблемы пользователя является вход в учётную запись этого пользователя для воспроизведения или отладки проблемы.\n- Однако во многих ситуациях нежелательно и даже может быть опасно, чтобы пользователь root работал из учётной записи обычного пользователя и с переменными окружения этой учётной записи, а не из root. Случайно используя окружение обычного пользователя, root может установить программу или внести другие изменения в систему, которые поведут себя не так, как если бы они были сделаны в полном окружении root. Например, может быть установлена программа, которая даст обычному пользователю возможность случайно повредить систему или получить несанкционированный доступ к данным.\n\nТаким образом, рекомендуется, чтобы администраторы и другие пользователи, которым разрешено использовать su (а предполагается, что таких пользователей очень мало, если вообще есть), приобрели привычку всегда запускать команду su с опцией -l/--login. Это даёт два эффекта:\n\n- Переходит из текущего каталога в домашний каталог нового пользователя (например, в каталог /root в случае пользователя root) путём входа от имени этого пользователя.\n- Изменяет переменные окружения на переменные окружения нового пользователя, как это прописано в настройках его оболочки. Например, считывается его ~/.bashrc и, возможно, другие dot-файлы оболочки bash. То есть, текущий каталог и окружение будут изменены на те, которые ожидались бы, если бы новый пользователь действительно вошёл в новый сеанс (а не просто взял на себя управление существующим сеансом).\n\nТаким образом, администраторам обычно следует использовать su следующим образом:\n\n```\n$ su -l\n```\n\nТакой же результат получается при добавлении имени пользователя root:\n\n```\n$ su -l root\n```\n\nАналогично, то же самое можно сделать для любого другого пользователя (например, для пользователя с именем archie):\n\n```\n# su -l archie\n```\n\nМожно прописать псевдоним в ~/.bashrc:\n\n```\nalias su=\"su -l\"\n```\n\n"
    },
    {
      "title": "su и wheel",
      "level": 3,
      "content": "По умолчанию BSD su позволяет стать root только пользователям из группы wheel. Это не является поведением по умолчанию в GNU su, но может быть имитировано с помощью PAM. Раскомментируйте соответствующую строку в /etc/pam.d/su и /etc/pam.d/su-l:\n\n```\nauth required pam_wheel.so use_uid\n```\n\n"
    }
  ]
}