{
  "title": "Su (Español)",
  "url": "https://wiki.archlinux.org/title/Su_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-07** \n\nArtículos relacionados\n\n- Usuarios y grupos\n- sudo\n- Aplicaciones de elevación de privilegios\n\nLa utilidad su (usuario sustituto) se utiliza para asumir la identidad de otro usuario en el sistema, el superusuario (root) por defecto.\n\nVéase PAM para las formas de configurar el comportamiento de su.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "su es parte del paquete util-linux.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Para asumir el inicio de sesión de otro usuario, pase el nombre de usuario que desea convertir a su, como sigue:\n\n```\n$ su usuario\n```\n\nPor defecto, cuando se ejecuta como un usuario regular, Se le pedirá la contraseña del usuario que está invocando. Cuando se ejecuta su como superusuario (root), no se requiere contraseña.\n\nSi no se pasa ningún nombre de usuario, su asume que es el superusuario (root) y la contraseña por la que se le preguntará será la de superusuario.\n\nPara más información, véase su(1).\n\n"
    },
    {
      "title": "Intérprete de inicio de sesión",
      "level": 3,
      "content": "El comportamiento predeterminado de su es permanecer dentro del directorio vigente y de mantener las variables del entorno del usuario original (en lugar de cambiar a los del nuevo usuario).\n\nConsideraciones importantes a tener en cuenta:\n\n- A veces puede ser ventajoso para un administrador del sistema utilizar la cuenta shell de un usuario normal y no la suya propia. En particular, a veces, la manera más eficiente para resolver el problema de un usuario, es iniciar sesión en la cuenta de ese usuario a fin de reproducir o depurar el problema.\n- Sin embargo, en muchas situaciones no es deseable, o incluso puede ser peligroso para el superusuario, estar operando desde la cuenta de la shell de un usuario normal y con las variables del entorno de esa cuenta, más que desde las suyas propias. Podría darse el caso de que, sin intención, desde la cuenta shell de un usuario normal, el superusuario instalara un programa o hiciera cambios en el sistema que no tendrían el mismo resultado que si se hicieran durante el uso de la cuenta del superusuario. Por ejemplo, podría instalar un programa de modo que el mismo le diera al usuario normal el poder para dañar accidentalmente el sistema u obtener acceso no autorizado a determinados datos.\n\nPor lo tanto, es recomendable que los usuarios administradores, así como cualquier otro usuario que esté autorizado para utilizar su (y se sugiere que sean muy pocos, si los hay) adquieran el hábito de ejecutar siempre su con la opción -l/--login. Esto tiene dos efectos:\n\n1. Cambiar desde el directorio en curso al directorio home del nuevo usuario (por ejemplo, a /root en el caso de que el usuario destinatario sea el superusuario) para acceder como ese usuario.\n1. Cambiar las variables del entorno a las del nuevo usuario según lo indicado en sus configuraciones de intérprete preferidas. Como su ~/.bashrc, y posiblemente otros archivos de puntos, para un intérprete bash. Es decir, el directorio y el entorno actuales se cambiarán a lo que se esperaría si el nuevo usuario hubiera iniciado sesión en una nueva sesión (en lugar de simplemente tomar el control de una sesión existente).\n\nPor lo tanto, los administradores generalmente deben utilizar su de la siguiente manera:\n\n```\n$ su -l\n```\n\nUn resultado idéntico se produce añadiendo el nombre del superusuario:\n\n```\n$ su -l root\n```\n\nDel mismo modo, lo anterior se puede hacer con cualquier otro usuario (por ejemplo, para un usuario llamado archie):\n\n```\n# su -l archie\n```\n\nEs posible que desee añadir un alias en ~/.bashrc como sigue:\n\n```\nalias su='su -l'\n```\n\n"
    },
    {
      "title": "su y wheel",
      "level": 3,
      "content": "su de BSD permite únicamente a los miembros del grupo de usuario wheel asumir la identidad del superusuario por defecto. Este no es el comportamiento por defecto de su en GNU, pero dicho comportamiento puede ser imitado usando PAM. Descomente la línea apropiada en /etc/pam.d/su y /etc/pam.d/su-l:\n\n```\nauth required pam_wheel.so use_uid\n```\n\n"
    }
  ]
}