{
  "title": "Sudo (Español)",
  "url": "https://wiki.archlinux.org/title/Sudo_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-07** \n\nArtículos relacionados\n\n- Usuarios y grupos\n- su\n- doas\n\nSudo permite al administrador del sistema delegar autoridad para otorgar a ciertos usuarios (o grupos de usuarios) la capacidad de ejecutar órdenes como superusuario (root) u otro mientras proporciona un registro de auditoría de las órdenes y sus argumentos.\n\nSudo es una alternativa a su para ejecutar órdenes como superusuario. A diferencia de su, que lanza un shell de superusuario que permite que todas las demás órdenes tengan acceso de superusuario, sudo ofrece una elevación temporal de privilegios a una sola orden. Al activar los privilegios de superusuario solo cuando es necesario, el uso de sudo reduce la probabilidad de que un error tipográfico o en una orden invocada arruine el sistema.\n\nSudo también se puede usar para ejecutar órdenes como otros usuarios; además, sudo registra todas las órdenes y los intentos de acceso fallidos para la auditoría de seguridad.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete sudo.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Para comenzar a usar sudo como un usuario sin privilegios, debe estar configurado correctamente. Véase la sección configuración.\n\nPara usar sudo, simplemente anteponga sudo y un espacio a ls orden y sus argumentos:\n\n```\n$ sudo orden\n```\n\nPor ejemplo, para usar pacman:\n\n```\n$ sudo pacman -Syu\n```\n\nVéase sudo(8) para más información.\n\n"
    },
    {
      "title": "Estructura por defecto",
      "level": 3,
      "content": "sudoers(5) § SUDOERS OPTIONS lista todas las opciones que se pueden utilizar con la orden Defaults en el archivo /etc/sudoers.\n\nVéase [1] para obtener una lista de opciones (analizadas desde el código fuente de la versión 1.8.7) en un formato optimizado para sudoers.\n\nVéase sudoers(5) para más información, como configurar el tiempo de espera de la contraseña.\n\n"
    },
    {
      "title": "Ver la configuración actual",
      "level": 3,
      "content": "Ejecute sudo -ll para visualizar la configuración actual de sudo, o sudo -lU usuario para un usuario específico.\n\n"
    },
    {
      "title": "Utilizando visudo",
      "level": 3,
      "content": "El archivo de configuración de sudo es /etc/sudoers. Siempre debe editarse con la orden visudo(8). visudo bloquea el archivo sudoers, guarda los cambios en un archivo temporal y comprueba los errores sintácticos antes de copiarlo en /etc/sudoers.\n\nNote: **siempre** \n\n- ¡Es imperativo que el archivo sudoers no tenga errores de sintaxis! Cualquier error hará sudo inutilizable. Modifíquelo siempre con visudo para evitar errores.\n- visudo(8) advierte que configurar visudo para respetar las variables de entorno del usuario para su editor de elección puede ser un agujero de seguridad, ya que permite al usuario con privilegios visudo ejecutar arbitrariamente órdenes como superusuario sin iniciar sesión simplemente estableciendo esa variable con cualquier cosa.\n\nEl editor predeterminado para visudo es vi. El paquete sudo se compila con --with-env-editor de forma predeterminada y respeta el uso de las variables SUDO_EDITOR y EDITOR. EDITOR no se usa cuando se establece VISUAL.\n\nPara establecer nano como el editor de visudo durante la sesión actual de shell exporte EDITOR=nano; para usar un editor diferente una vez, simplemente configure la variable antes de llamar a visudo:\n\n```\n# EDITOR=nano visudo\n```\n\nAlternativamente, puede editar una copia del archivo /etc/sudoers y verificarlo utilizando visudo -c /copia/de/sudoers. Esto podría ser útil en caso de que quiera eludir el bloqueo del archivo con visudo.\n\nPara cambiar el editor permanentemente, véase la sección variables de entorno por usuario. Para cambiar el editor elegido solo para visudo de forma permanente en todo el sistema, añada lo siguiente a /etc/sudoers (suponiendo que nano es su editor preferido):\n\n```\n# Restablece el entorno predeterminado\nDefaults      env_reset\n# Establece el EDITOR predeterminado a una versión restringida de nano, y no permite a visudo usar EDITOR/VISUAL.\nDefaults      editor=/usr/bin/rnano, !env_editor\n```\n\n"
    },
    {
      "title": "Ejemplos de entradas",
      "level": 3,
      "content": "Para permitir a un usuario normal obtener privilegios de superusuario (root) cuando anteponga sudo a una orden, añada la siguiente línea:\n\n```\nNOMBRE_DE_USUARIO   ALL=(ALL:ALL) ALL\n```\n\nPara permitir a un usuario ejecutar todas las órdenes como cualquier usuario, pero únicamente en la máquina con el nombre NOMBRE_DEL_EQUIPO:\n\n```\nNOMBRE_DE_USUARIO   NOMBRE_DE_EQUIPO=(ALL:ALL) ALL\n```\n\nPara permitir que los miembros del grupo wheel tengan acceso a sudo:\n\n```\n%wheel      ALL=(ALL:ALL) ALL\n```\n\nPara desactivar la solicitud de contraseña para el usuario NOMBRE_DE_USUARIO:\n\n```\nDefaults:NOMBRE_DE_USUARIO      !authenticate\n```\n\nPara activar las órdenes definidas explícitamente solo para el usuario NOMBRE_DE_USUARIO en el equipo NOMBRE_DEL_EQUIPO:\n\n```\nNOMBRE_DE_USUARIO NOMBRE_DEL_EQUIPO=/usr/bin/halt,/usr/bin/poweroff,/usr/bin/reboot,/usr/bin/pacman -Syu\n```\n\nPara activar, sin necesidad de contraseña, las órdenes definidas explícitamente solo para el usuario NOMBRE_DE_USUARIO en el equipo NOMBRE_DEL_EQUIPO:\n\n```\nNOMBRE_DE_USUARIO NOMBRE_DEL_EQUIPO= NOPASSWD: /usr/bin/halt,/usr/bin/poweroff,/usr/bin/reboot,/usr/bin/pacman -Syu\n```\n\nUn ejemplo detallado de sudoers está disponible en /usr/share/doc/sudo/examples/sudoers. Por otro lado, véase sudoers(5) para obtener información detallada.\n\n"
    },
    {
      "title": "Permisos de archivo predeterminados de sudoers",
      "level": 3,
      "content": "El propietario y el grupo para el archivo sudoers deben ser ambos 0. Los permisos de los archivos deben establecerse en 0440. Estos permisos se establecen de forma predeterminada, pero si los cambia accidentalmente, deberían ser cambiados de nuevo inmediatamente o sudo fallará.\n\n```\n# chown -c root:root /etc/sudoers\n# chmod -c 0440 /etc/sudoers\n```\n\n"
    },
    {
      "title": "Desactivar el tiempo de espera al solicitar la contraseña",
      "level": 3,
      "content": "Una molestia común es un proceso de larga duración que se ejecuta con permisos normales en segundo plano en un terminal y se eleva solo cuando es necesario. Esto lleva a una solicitud de contraseña de sudo que pasa desapercibida y se agota el tiempo, en cuyo caso el proceso muere y el trabajo realizado se pierde o, en el mejor de los casos, se almacena en caché. Un consejo común es activar sudo sin contraseña o extender el tiempo de espera de sudo para recordar una contraseña. Ambos tienen implicaciones negativas de seguridad. El tiempo de espera para introducir la contraseña también se puede desactivar y, dado que eso no sirve para ningún propósito de seguridad razonable, debería ser la solución aquí:\n\n```\nDefaults passwd_timeout=0\n```\n\n"
    },
    {
      "title": "Añadir una campana en el terminal a la solicitud de la contraseña",
      "level": 3,
      "content": "Para llamar la atención sobre un indicador de sudo en un terminal en segundo plano, los usuarios pueden hacer simplemente que muestre un carácter de campana:\n\n```\nDefaults passprompt=\"^G[sudo] password for %p: \"\n```\n\nTenga en cuenta que ^G es literalmente un carácter de campana. Por ejemplo en vim, se introduce mediante la secuencia Ctrl+v Ctrl+g, or in nano, Alt+v Ctrl+g.\n\n"
    },
    {
      "title": "Transferir alias",
      "level": 3,
      "content": "Los alias en Zsh y Bash normalmente solo se expanden para la primera palabra de una orden. Esto significa que sus alias normalmente no se expandirán cuando ejecute la orden sudo. Una forma de hacer que la siguiente palabra se expanda es hacer un alias para sudo que termine con un espacio. Añada lo siguiente a su archivo de configuración del intérprete de línea de órdenes:\n\n```\nalias sudo='sudo '\n```\n\nzshmisc(1) § ALIASING describe cómo funciona esto:\n\nAsí como bash(1) § ALIASES:\n\n"
    },
    {
      "title": "Desactivar sudo por cada terminal",
      "level": 3,
      "content": "Si le molesta que sudo, de forma predeterminada, requiera introducir la contraseña cada vez que abra un nuevo terminal, configure timestamp_type a global:\n\n```\nDefaults timestamp_type=global\n```\n\n"
    },
    {
      "title": "Reducir la cantidad de veces que tiene que escribir una contraseña",
      "level": 3,
      "content": "Si le molesta tener que volver a escribir su contraseña cada 5 minutos (predeterminado), puede cambiar esto estableciendo un valor más largo para timestamp_timeout (en minutos):\n\n```\nDefaults timestamp_timeout=10\n```\n\nSi está utilizando muchas órdenes sudo en una línea, es más lógico actualizar el tiempo de espera cada vez que utilice sudo que aumentar timestamp_timeout. Se puede actualizar el tiempo de espera con sudo -v (mientras que sudo -K se revoca inmediatamente).\n\nEs posible que quiera automatizar esto añadiendo lo siguiente a su .bashrc:\n\n```\nalias sudo='sudo -v; sudo '\n```\n\nTambién es posible utilizar una función bash; para obtener más detalles, véase stackexchange.\n\n"
    },
    {
      "title": "Variables de entorno",
      "level": 3,
      "content": "Si se tienen muchas variables de entorno, o exporta la configuración del proxy a través de export http_proxy=\"...\", al usar sudo estas variables no se pasan a la cuenta de superusuario, a menos que ejecute sudo con la opción -E.\n\n```\n$ sudo -E pacman -Syu\n```\n\nLa forma recomendada de preservar las variables de entorno es añadiendo a env_keep:\n\n```\n/etc/sudoers\n```\n\n```\nDefaults env_keep += \"ftp_proxy http_proxy https_proxy no_proxy\"\n```\n\n"
    },
    {
      "title": "Contraseña de superusuario",
      "level": 3,
      "content": "Los usuarios pueden configurar sudo para solicitar la contraseña del superusuario en lugar de la contraseña de usuario añadiendo targetpw (usuario de destino, predeterminado a superusuario) o rootpw a la línea Defaults en /etc/sudoers:\n\n```\nDefaults targetpw\n```\n\nPara evitar exponer su contraseña de superusuario a los usuarios, puede restringirla a un grupo específico:\n\n```\nDefaults:%wheel targetpw\n%wheel ALL=(ALL) ALL\n```\n\n"
    },
    {
      "title": "Desactivar el acceso de superusuario",
      "level": 3,
      "content": "Los usuarios pueden querer desactivar el inicio de sesión del superusuario. Sin este, los atacantes deben primero adivinar un nombre de usuario configurado como sudoer, así como su contraseña. Véase por ejemplo Denegar.\n\n- Tenga cuidado, puede bloquearse al desactivar el inicio de sesión del superusuario. Sudo no se instala automáticamente y su configuración predeterminada no permite el acceso al superusuario sin contraseña ni con su propia contraseña. Asegúrese de que el usuario esté configurado correctamente como un sudoer antes de desactivar la cuenta de superusuario.\n- Si ha cambiado su archivo sudoers para utilizar rootpw como predeterminado, entonces no desactive el inicio de sesión del superusuario con ninguno de las siguientes órdenes.\n- Si ya está bloqueado, véase como reiniciar la contraseña del superusuario para obtener ayuda.\n\nLa cuenta puede ser bloqueada mediante passwd:\n\n```\n# passwd -l root\n```\n\nUna orden similar desbloquea al superusuario.\n\n```\n$ sudo passwd -u root\n```\n\nAlternativamente, edite /etc/shadow y reemplace la contraseña cifrada del superusuario (root) con \"!\":\n\n```\nroot:!:12345::::::\n```\n\nPara activar de nuevo el acceso del superusuario:\n\n```\n$ sudo passwd root\n```\n\n"
    },
    {
      "title": "kdesu",
      "level": 4,
      "content": "kdesu puede ser utilizado bajo KDE para lanzar aplicaciones gráficas con privilegios de superusuario. Es posible que, por defecto, kdesu trate de usar su incluso si la cuenta de superusuario está desactivada. Afortunadamente se puede invocar kdesu para usar sudo en lugar de su. Cree/modifique el archivo ~/.config/kdesurc:\n\n```\n[super-user-command]\nsuper-user-command=sudo\n```\n\no utilice la siguiente orden:\n\n```\n$ kwriteconfig5 --file kdesurc --group super-user-command --key super-user-command sudo\n```\n\n"
    },
    {
      "title": "Ejemplo de protección con sudo",
      "level": 3,
      "content": "Digamos que crea tres usuarios: admin, devel y archie. El usuario \"admin\" se utiliza para journalctl, systemctl, mount, kill e iptables; \"devel\" se utiliza para instalar paquetes y modificar archivos de configuración; y \"archie\" es el usuario con el que inicia sesión. Para permitir que \"archie\" reinicie, apague y utilice netctl, haríamos lo siguiente:\n\nModifique /etc/pam.d/su y /etc/pam.d/su-l. Requriera que el usuario esté en el grupo wheel, pero no ponga a nadie en él.\n\n```\n#%PAM-1.0\nauth            sufficient      pam_rootok.so\n# Descomente la siguiente línea para confiar implícitamente en los usuarios del grupo \"wheel\".\n#auth           sufficient      pam_wheel.so trust use_uid\n# Descomente la siguiente línea para requerir que un usuario esté en el grupo \"wheel\".\nauth            required        pam_wheel.so use_uid\nauth            required        pam_unix.so\naccount         required        pam_unix.so\nsession         required        pam_unix.so\n```\n\nLimite el inicio de sesión de SSH al grupo 'ssh'. Solo \"archie\" será parte de este grupo.\n\n1. groupadd -r ssh\n\n```\n# gpasswd -a archie ssh\n# echo 'AllowGroups ssh' >> /etc/ssh/sshd_config\n```\n\nReinicie sshd.service.\n\nAñada usuarios a otros grupos.\n\n```\n# for g in power network ;do ;gpasswd -a archie $g ;done\n# for g in network power storage ;do ;gpasswd -a admin $g ;done\n```\n\nAjuste los permisos en las configuraciones para que \"devel\" pueda modificarlos.\n\n```\n# chown -R devel:root /etc/{http,openvpn,cups,zsh,vim,screenrc}\n```\n\n```\nCmnd_Alias  POWER       =   /usr/bin/shutdown -h now, /usr/bin/halt, /usr/bin/poweroff, /usr/bin/reboot\nCmnd_Alias  STORAGE     =   /usr/bin/mount -o nosuid\\,nodev\\,noexec, /usr/bin/umount\nCmnd_Alias  SYSTEMD     =   /usr/bin/journalctl, /usr/bin/systemctl\nCmnd_Alias  KILL        =   /usr/bin/kill, /usr/bin/killall\nCmnd_Alias  PKGMAN      =   /usr/bin/pacman\nCmnd_Alias  NETWORK     =   /usr/bin/netctl\nCmnd_Alias  FIREWALL    =   /usr/bin/iptables, /usr/bin/ip6tables\nCmnd_Alias  SHELL       =   /usr/bin/zsh, /usr/bin/bash\n%power      ALL         =   (root)  NOPASSWD: POWER\n%network    ALL         =   (root)  NETWORK\n%storage    ALL         =   (root)  STORAGE\nroot        ALL         =   (ALL)   ALL\nadmin       ALL         =   (root)  SYSTEMD, KILL, FIREWALL\ndevel       ALL         =   (root)  PKGMAN\narchie      ALL         =   (devel) SHELL, (admin) SHELL\n```\n\nCon esta configuración, casi nunca necesitará iniciar sesión como superusuario.\n\n\"archie\" se puede conectar a sus redes inalámbricas domésticas:\n\n```\n$ sudo netctl start home\n$ sudo poweroff\n```\n\n\"archie\" no puede utilizar netctl como cualquier otro usuario.\n\n```\n$ sudo -u admin -- netctl start home\n```\n\nCuando \"archie\" necesite utilizar journalctl o terminar la ejecución de un proceso pueden cambiar a dicho usuario:\n\n```\n$ sudo -i -u devel\n$ sudo -i -u admin\n```\n\nPero \"archie\" no puede cambiar a superusuario:\n\n```\n$ sudo -i -u root\n```\n\nSi \"archie\" quiere iniciar una sesión gnu-screen como \"admin\" pueden hacerlo así:\n\n```\n$ sudo -i -u admin\n[admin]$ chown admin:tty `echo $TTY`\n[admin]$ screen\n```\n\n"
    },
    {
      "title": "Configurar sudo mediante archivos complementarios en /etc/sudoers.d",
      "level": 3,
      "content": "sudo analiza los archivos contenidos en el directorio /etc/sudoers.d/. Esto significa que en lugar de modificar /etc/sudoers, puede cambiar la configuración mediante archivos independientes y soltarlos en ese directorio. Esto tiene dos ventajas:\n\n- No hay necesidad de modificar un archivo sudoers.pacnew;\n- Si hay un problema con una nueva entrada, puede eliminar el archivo afectado en lugar de modificar /etc/sudoers (pero véase la advertencia a continuación).\n\nEl formato para las entradas en estos archivos complementarios es el mismo que para /etc/sudoers. Para modificarlos directamente, utilice visudo -f /etc/sudoers.d/nombre_archivo. Véase sudoers(5) § Incluir otros archivos desde sudoers para más información.\n\nLos archivos en el directorio /etc/sudoers.d/ se analizan en orden lexicográfico, los nombres de archivo que contienen . o ~ se omiten. Para evitar problemas de clasificación, los nombres de los archivos deben comenzar con dos dígitos, por ejemplo 01_foo.\n\n"
    },
    {
      "title": "Edición de archivos",
      "level": 3,
      "content": "sudo -e o sudoedit le permite modificar un archivo como otro usuario mientras ejecuta el editor de texto como su usuario.\n\nEsto es especialmente útil para modificar archivos como superusuario sin elevar el privilegio de su editor de texto. Véase sudo(8) § e para más detalles.\n\nTenga en cuenta que puede configurar el editor para cualquier programa, por lo que, por ejemplo, uno puede usar meld para administrar archivos pacnew:\n\n```\n$ SUDO_EDITOR=meld sudo -e /etc/archivo{,.pacnew}\n```\n\n"
    },
    {
      "title": "Activar insultos",
      "level": 3,
      "content": "Los usuarios pueden activar el huevo de Pascua de insultos en sudo añadiendo la siguiente línea en el archivo sudoers con visudo.\n\n```\n/etc/sudoers\n```\n\n```\nDefaults insults\n```\n\nAl introducir una contraseña incorrecta se reemplazará el mensaje Inténtelo de nuevo. por insultos en tono de humor.\n\n"
    },
    {
      "title": "Problemas de SSH sin TTY",
      "level": 3,
      "content": "SSH no asigna una tty de forma predeterminada cuando ejecuta una orden remota. Sin una tty asignada, sudo no puede evitar que se muestre la contraseña. Puede utilizar la opción de ssh -t para forzar la asignación de una tty.\n\nLa opción requiretty de Defaults permite al usuario ejecutar sudo solo si tiene una tty.\n\n```\n# Desactive \"ssh hostname sudo <cmd>\", ya que mostrará la contraseña en texto claro. Se tiene que ejecutar \"ssh -t hostname sudo <cmd>\".\n#\n#Defaults    requiretty\n```\n\n"
    },
    {
      "title": "Umask permisiva",
      "level": 3,
      "content": "Sudo unirá el valor umask del usuario con su propia umask (que por defecto es 0022). Esto evita que sudo cree archivos con permisos más abiertos que los que permite el umask del usuario. Si bien este es un valor predeterminado cuando no se usa umask personalizada, esto puede llevar a situaciones en las que una utilidad ejecutada por sudo puede crear archivos con permisos diferentes que si se ejecutara directamente desde el superusuario (root). Si surgen errores a partir de esto, sudo proporciona un medio para reparar la umask, incluso si la umask deseada es más permisiva que la umask que el usuario ha especificado. Añadir esto (usando visudo) anulará el comportamiento predeterminado de sudo:\n\n```\nDefaults umask = 0022\nDefaults umask_override\n```\n\nEsto establece el umask de sudo en umask predeterminado del superusuario (0022) y anula el comportamiento predefinido, utilizando siempre la umask indicada, independientemente de la umask definida del usuario.\n\n"
    }
  ]
}