{
  "title": "Sugar (Español)",
  "url": "https://wiki.archlinux.org/title/Sugar_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-02-09** \n\nProducto de la iniciativa de OLPC, Sugar es un entorno de escritorio similar a KDE y GNOME, pero orientado hacia los niños y la educación.\n\nSugar tiene una taxonomía especial para nombrar las partes de su sistema. La interfaz gráfica en sí misma constituye el grupo Glucose. Este es el sistema central y cabe esperar que esté presente cuando se instale Sugar. Pero para usar realmente el entorno, necesita actividades (alguna clase de aplicaciones). Las actividades base son parte de Fructose. Luego, Sucrose está constituido por glucose y fructose y representa lo que debería distribuirse como un entorno de escritorio básico Sugar. Las actividades extra son parte de Honey. Tenga en cuenta que Ribose (el sistema operativo subyacente) se reemplaza aquí por Arch.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "- Para el sistema central (Glucose), instale sugar. Proporciona la interfaz gráfica y una sesión de escritorio, pero no es muy útil por sí sola.\n- El grupo sugar-fructose contiene las actividades básicas (Fructose) que incluyen un navegador web, un editor de texto, un reproductor multimedia y un emulador de terminal.\n- El paquete sugar-runner proporciona un script de ayuda que hace posible lanzar Sugar dentro de otro entorno de escritorio, o directamente desde la línea de comandos.\n\n"
    },
    {
      "title": "Desde la biblioteca de actividades",
      "level": 3,
      "content": "La Biblioteca de Actividades Sugar proporciona muchos paquetes de actividades empaquetados como archivos zip con la extensión \".xo\". Estos paquetes se pueden descargar e instalar en el directorio del usuario desde Sugar, pero la instalación no garantiza que se cumplan las dependencias. Por lo tanto, no es la forma recomendada de instalar actividades, ya que es probable que no se inicien debido a las dependencias faltantes. Dependencias comúnmente utilizadas:\n\n- Para las actividades web, instale webkit2gtk desde los repositorios oficiales.\n- Para actividades basadas en GTK+ 2, instale sugar-toolkit-gtk2AUR[enlace roto: package not found] desde AUR.\n\nPara comprobar por qué la actividad no se inicia, consulte el archivo de registro ubicado en ~/.sugar/default/logs/[app_id]-1.log.\n\n"
    },
    {
      "title": "Iniciar Sugar",
      "level": 2,
      "content": "Sugar puede iniciarse gráficamente usando un gestor de pantalla, o manualmente desde la consola.\n\nGráficamente\n\nSeleccione la sesión Sugar en el menú de sesión del gestor de pantalla.\n\nManualmente\n\nSi sugar-runner está instalado, Sugar se puede iniciar con el comando sugar-runner.\n\nUn método alternativo es agregar exec sugar al archivo ~/.xinitrc. Después de eso, Sugar se puede iniciar con el comando startx (véase xinitrc para detalles adicionales). Después de configurar el archivo ~/.xinitrc, también se puede configurar para que se inicie automáticamente X al inicio de sesión.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página web oficial de Sugar\n- Actividades para Sugar\n\n"
    }
  ]
}