{
  "title": "Supergfxctl",
  "url": "https://wiki.archlinux.org/title/Supergfxctl",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nRelated articles\n\n- ASUS Linux\n- asusctl\n\nsupergfxctlAUR is a useful utility provided by ASUS Linux. It helps with managing GPU switching functionality on hybrid laptops.\n\nWhile supergfxctl was originally designed with ASUS Optimus laptops in mind, it has since evolved into a standalone tool that functions with any laptops with hybrid graphics.\n\n"
    },
    {
      "title": "Pre-installation",
      "level": 2,
      "content": "For Optimus laptops make sure that the NVIDIA drivers are installed. Do not install xf86-video-intel. Remove optimus-manager-gitAUR and bumblebee if they are installed and make sure no residual configs for NVIDIA, Intel and/or any PRIME managers are located in the following locations:\n\n- /etc/X11/xorg.conf.d/\n- /etc/modprobe.d/\n- /etc/udev/rules.d/\n\n"
    },
    {
      "title": "Initramfs and kernel parameters",
      "level": 3,
      "content": "If your laptop has a dedicated NVIDIA GPU then you need to set some kernel parameters, see NVIDIA#DRM kernel mode setting for instructions. If your laptop has a dedicated AMD GPU then no extra steps are required.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installation can be done through ASUS Linux's own repository. You can also install the supergfxctlAUR package. Then, enable supergfxd.service.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Settings are stored at /etc/supergfxd.conf. An example configuration file is as follows:\n\n```\nsupergfxd.conf\n```\n\n```\n{\n  \"mode\": \"Hybrid\",\n  \"vfio_enable\": false,\n  \"vfio_save\": false,\n  \"always_reboot\": false,\n  \"no_logind\": false,\n  \"logout_timeout_s\": 180,\n  \"hotplug_type\": \"None\"\n}\n```\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "Supergfxctl supports the following modes, Integrated, Hybrid and VFIO. It has the ability to detect if a mux switch is in use for AsusMuxDgpu mode. There is also an NvidiaNoModeSet option that reboots the system with the NVIDIA GPU kernel module disabled.\n\nUsing the MUX switch requires that you are running asusctl, for details please see asusctl#Using the MUX switch.\n\n"
    },
    {
      "title": "Show supported modes",
      "level": 3,
      "content": "The following command is used to display all the modes your laptop supports:\n\n```\n$ supergfxctl -s\n```\n\n"
    },
    {
      "title": "Get current mode",
      "level": 3,
      "content": "The following command is used to query the current GPU mode:\n\n```\n$ supergfxctl -g\n```\n\n"
    },
    {
      "title": "Switch modes",
      "level": 3,
      "content": "The following command is used to switch the current GPU mode to Hybrid:\n\n```\n$ supergfxctl -m hybrid\n```\n\n"
    },
    {
      "title": "Using supergfxctl for GPU passthrough (VFIO)",
      "level": 3,
      "content": "VFIO GPU passthrough can be enabled by editing /etc/supergfxd.conf. In this configuration file, it is also recommended to change the hotplug_type value to Asus, instead of None as is documented upstream.\n\n```\n/etc/supergfxd.conf\n```\n\n```\n{\n\"vfio_enable\": true,\n\"hotplug_type\": \"Asus\"\n}\n```\n\nSee the ASUS Linux VFIO guide for details.\n\n"
    },
    {
      "title": "Using supergfxctl and the MUX switch",
      "level": 3,
      "content": "If the system is in Hybrid mode, prime-run from nvidia-prime can be used to run programs on the discrete GPU. This does not break applications while the MUX switch is enabled, so it can be used wherever more graphics performance is needed.\n\n"
    },
    {
      "title": "Using supergfxctl with a Wayland client",
      "level": 3,
      "content": "Since Wayland supports multiple GPUs simultaneously, users do not need to install supergfxctl unless they want to use VFIO or further limit power consumption. AsusMuxDgpu mode can be switched with asusctl, see asusctl#Using the MUX switch for details.\n\n"
    },
    {
      "title": "Graphical utilities",
      "level": 2,
      "content": "Users of GNOME & KDE can make use of desktop environment add-ons to control supergfxctl from their desktop. The following is a list of these including links:\n\nTable content:\nName | Desktop | Link\nsupergfxctl-gex | Gnome | https://extensions.gnome.org/extension/5344/supergfxctl-gex/\nGPU Supergfxctl Switch | Gnome (46) | https://extensions.gnome.org/extension/7018/gpu-supergfxctl-switch/\nplasma6-applets-supergfxctl | KDE Plasma | plasma6-applets-supergfxctlAUR\nrog-control-center | Any | rog-control-centerAUR\n\n"
    }
  ]
}