{
  "title": "Surf (Polski)",
  "url": "https://wiki.archlinux.org/title/Surf_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "surf jest prostą przeglądarką internetową opartą na WebKit/GTK+. Jest w stanie wyświetlać strony internetowe i śledzić linki. Obsługuje protokół XEmbed, który umożliwia osadzenie jej w innej aplikacji. Ponadto można wskazać surf do innego URI, ustawiając jego XProperties.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiet surfAUR lub surf-gitAUR dla wersji \"rozwojowej\".\n\nOpcjonalnie zainstaluj także pakiet dmenu dla paska adresu URL lub rofi, który jest kompatybily z dmenu.\n\n"
    },
    {
      "title": "Konfiguracja",
      "level": 2,
      "content": "surf jest konfigurowany poprzez plik config.h. Przykładowy plik config.def.h jest dołączony do źródła i powinien być pomocny.\n\nPodobnie jak w przypadku innych pakietów, takich jak dwm, rozważ użycie Arch Build System (ABS) i utrzymywanie własnego PKGBUILD ze źródłami i sumami md5 dla własnej konfiguracji i plików źródłowych.\n\n"
    },
    {
      "title": "Poprawki i dodatkowe funkcje",
      "level": 3,
      "content": "Istnieje wiele stworzonych przez połeczność poprawek dostępnych z oficjalnej witryny, które znacznie rozszerzają funkcjonalność surf. Poprawki można zastosować zarówno do źródłowego pliku surf.c, jak i pliku config.h:\n\n```\n$ cd src/surf-[version]/\n$ patch -p1 < path/to/patch.diff\n```\n\n"
    },
    {
      "title": "Korzystanie z kart",
      "level": 3,
      "content": "Program tabbed-gitAUR może być użyty z surf żeby stworzyć prostą obsługe kart.\n\nPodstawowa konfiguracja:\n\n```\n$ tabbed surf -e\n```\n\nŻeby osiągnąć efekt podobny do Firefoxa lub Chromium, gdy po zamknięciu ostatniej karty, przeglądarka sie zamyka, użyj zamiast tego:\n\n```\n$ tabbed -c surf -e\n```\n\nZobacz stronę man aby uzyskać więcej informacji.\n\n"
    },
    {
      "title": "Niewyraźna czcionka na GitHubie",
      "level": 3,
      "content": "Zainstaluj gnu-free-fonts lub dodaj to do ~/.config/fontconfig/fonts.conf wśrodku tagów fontconfig-tags:\n\n```\n<selectfont>\n   <rejectfont>\n     <pattern>\n       <patelt name=\"family\">\n         <string>Clean</string>\n       </patelt>\n     </pattern>\n   </rejectfont>\n </selectfont>\n```\n\n"
    },
    {
      "title": "Zobacz również",
      "level": 2,
      "content": "- Oficjalna strona surf\n- dmenu - Prosty program uruchamiający aplikacje od twórców dwm\n- Wątek o modyfikacji surf\n\n"
    }
  ]
}