{
  "title": "Swap (Français)",
  "url": "https://wiki.archlinux.org/title/Swap_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- fstab (Français)\n- Power management/Suspend and hibernate#Hibernation\n- Zswap\n- Swap on video ram\n- ZFS#Swap volume\n- dm-crypt/Swap encryption\n\nCette page fournit une introduction à l'espace d'échange («swap») sur GNU/Linux. Elle couvre la création et l'activation des partitions swap et des fichiers swap.\n\nExtrait de All about Linux swap space :\n\nLa prise en charge de l'espace d'échange est assurée par le noyau Linux et les utilitaires de l'espace utilisateur du paquet util-linux.\n\n"
    },
    {
      "title": "Espace de pagination",
      "level": 2,
      "content": "L'espace de pagination peut prendre la forme d'une partition de disque ou d'un fichier. Les utilisateurs peuvent créer un espace de pagination pendant l'installation ou à tout moment par la suite. L'espace d'échange peut être utilisé à deux fins, pour étendre la mémoire virtuelle au-delà de la mémoire physique installée (RAM), et aussi pour prendre en charge la suspension sur disque.\n\nL'intérêt d'étendre la mémoire virtuelle avec le swap dépend de la quantité de mémoire physique installée. Si la quantité de mémoire physique est inférieure à la quantité de mémoire requise pour exécuter tous les programmes souhaités, alors il peut être bénéfique d'activer l'échange. Cela permet d'éviter le situations d'insuffisance de mémoire, où le mécanisme «OOM killer» du noyau Linux tentera automatiquement de libérer de la mémoire en tuant les processus. Pour augmenter la quantité de mémoire virtuelle à la quantité requise, ajoutez la différence nécessaire (ou plus) comme espace d'échange.\n\nLe plus gros inconvénient de l'activation de l'espace d'échange est sa baisse de performance, consultez la section #Performance. Par conséquent, l'activation de l'espace de pagination est une question de préférence personnelle : certains préfèrent que les programmes soient tués plutôt que d'utiliser du «swap» et d'autres préfèrent utiliser la «swap» et un système plus lent lorsque la mémoire physique est épuisée.\n\nPour vérifier l'état du swap, utilisez :\n\n```\n$ swapon --show\n```\n\nOu pour afficher la mémoire physique ainsi que l'utilisation de l'espace de pagination :\n\n```\n$ free -h\n```\n\n"
    },
    {
      "title": "Partition de swap",
      "level": 2,
      "content": "Une partition de swap peut être créée avec la plupart des outils de partitionnement GNU/Linux. Les partitions de swap sont désignées comme étant de type 82 en MBR et 0657FD6D-A4AB-43C4-84E5-0933C84B4F4F en GPT.\n\nPour configurer une partition comme «Linux swap», on utilise la commande mkswap(8). Par exemple :\n\n```\n# mkswap /dev/sdxy\n```\n\nPour activer le périphérique pour la pagination :\n\n```\n# swapon /dev/sdxy\n```\n\nPour activer cette partition swap au démarrage, ajoutez une entrée à /etc/fstab :\n\n```\nUUID=device_UUID none swap defaults 0 0\n```\n\noù device_UUID est l'UUID de l'espace d'échange.\n\nConsultez fstab (Français) pour la syntaxe du fichier.\n\n"
    },
    {
      "title": "Activation par systemd",
      "level": 3,
      "content": "systemd active les partitions d'échange selon deux mécanismes différents. Tous deux sont des exécutables dans /usr/lib/systemd/system-generators. Les générateurs sont exécutés au démarrage et créent des unités systemd natives pour les montages. Le premier, systemd-fstab-generator, lit le fstab pour générer des unités, y compris une unité pour le swap. Le second, systemd-gpt-auto-generator inspecte le disque racine pour générer des unités. Il fonctionne sur les disques GPT uniquement, et peut identifier les partitions d'échange par leur type GUID, consultez Systemd (Français)#Montage automatique d'une partition GPT pour plus d'informations.\n\n"
    },
    {
      "title": "Désactivation de la swap",
      "level": 3,
      "content": "Pour désactiver un espace d'échange spécifique :\n\n```\n# swapoff /dev/sdxy\n```\n\nVous pouvez également utiliser le paramètre -a pour désactiver tout l'espace d'échange.\n\nComme l'espace d'échange est géré par systemd, il sera réactivé au prochain démarrage du système. Pour désactiver définitivement l'activation automatique la swap détecté, exécutez systemctl --type swap pour trouver l'unité .swap responsable et masquez-la.\n\n"
    },
    {
      "title": "Fichier d'échange",
      "level": 2,
      "content": "En tant qu'alternative à la création d'une partition entière, un fichier d'échange offre la possibilité de varier sa taille à la volée, et est plus facilement supprimé. Cela peut être particulièrement souhaitable si l'espace disque est limité (par exemple, un SSD de taille modeste).\n\n"
    },
    {
      "title": "Création de fichiers d'échange",
      "level": 4,
      "content": "Utilisez dd pour créer un fichier swap de la taille de votre choix. Par exemple, pour créer un fichier swap de 512 MiB :\n\n```\n# dd if=/dev/zero of=/swapfile bs=1M count=512 status=progress\n```\n\nDéfinissez les bonnes permissions (un fichier swap lisible par tous est une énorme vulnérabilité locale) :\n\n```\n# chmod 0600 /swapfile\n```\n\nAprès avoir créé le fichier de taille correcte, formatez-le en swap :\n\n```\n# mkswap -U clear /swapfile\n```\n\nActivez le fichier d'échange :\n\n```\n# swapon /swapfile\n```\n\nEnfin, modifiez la configuration fstab pour ajouter une entrée pour le fichier d'échange :\n\n```\n/etc/fstab\n```\n\n```\n/swapfile none swap defaults 0 0\n```\n\nPour plus d'informations, consultez Fstab (Français)#Utilisation.\n\n- Le fichier d'échange doit être spécifié par son emplacement sur le système de fichiers, et non par son UUID ou son LABEL.\n- Lorsque vous utilisez Btrfs, n'oubliez pas d'ajouter également le sous-volume créé à la liste, et de supprimez les options discard,autodefrag du sous-volume monté en premier (qui contrôlera ces paramètres pour l'ensemble du FS).\n- La compression doit également être désactivée, mais l'attribut No_COW (précédemment défini avec chattr +C) s'en charge.\n\n"
    },
    {
      "title": "Supprimer le fichier swap",
      "level": 4,
      "content": "Pour supprimer un fichier swap, il faut d'abord le désactiver, puis le supprimer :\n\n```\n# swapoff /swapfile\n# rm -f /swapfile\n```\n\nEnfin, supprimez l'entrée correspondante de /etc/fstab.\n\n"
    },
    {
      "title": "systemd-swap",
      "level": 4,
      "content": "systemd-swap est un script permettant de créer un espace de pagination hybride à partir de ZRAM swap, de fichiers de pagination et de partitions de pagination. Il n'est pas affilié au projet systemd.\n\nInstallez le paquet systemd-swapAUR. Décommentez et définissez swapfc_enabled=1 dans la section Swap File Chunked de /etc/systemd/swap.conf. Démarrez et activez le service systemd-swap.\n\nVisitez la page GitHub de l'auteur pour plus d'informations et pour mettre en place la configuration recommandée.\n\n- Si le journal continue à afficher l'avertissement suivant systemd-swap[...] : WARN : swapFC : ENOSPC et qu'aucun fichier d'échange n'est créé, vous devez décommenter et définir swapfc_force_preallocated=1 dans /etc/systemd/swap.conf.\n- Le fichier d'échange créé par systemd-swap ne peut pas être facilement utilisé pour l'hibernation. Consultez systemd-swap issue 85.\n\n"
    },
    {
      "title": "Chiffrement de la swap",
      "level": 2,
      "content": "Consultez Dm-crypt/Swap encryption.\n\n"
    },
    {
      "title": "Performance",
      "level": 2,
      "content": "Les opérations de swap sont généralement beaucoup plus lentes que l'accès direct aux données en RAM. Désactiver entièrement le swap pour améliorer les performances peut parfois conduire à une dégradation, car cela diminue la mémoire disponible pour les caches du système de fichier virtuel (VFS), entraînant des utilisations du disque plus fréquentes et plus coûteuses.\n\nLes valeurs de swap peuvent être ajustées pour améliorer les performances :\n\n"
    },
    {
      "title": "Swappiness",
      "level": 3,
      "content": "Le paramètre sysctl swappiness représente la préférence (ou l'évitement) du noyau pour l'espace swap. Swappiness peut avoir une valeur entre 0 et 200 (max 100 si Linux < 5.8), la valeur par défaut est 60. Une valeur basse fait que le noyau évite le swapping, une valeur élevée fait que le noyau essaie d'utiliser l'espace de swap, et une valeur de 100 signifie que le coût d'E/S est supposé être égal. L'utilisation d'une valeur faible sur une mémoire suffisante est connue pour améliorer la réactivité sur de nombreux systèmes.\n\nPour vérifier la valeur actuelle de swapiness :\n\n```\n$ sysctl vm.swappiness\n```\n\nAlternativement, les fichiers /sys/fs/cgroup/memory/memory.swappiness (spécifique aux cgroup v1) ou /proc/sys/vm/swappiness peuvent être lus afin d'obtenir la valeur entière brute.\n\nPour définir temporairement la valeur de swappiness :\n\n```\n# sysctl -w vm.swappiness=10\n```\n\nPour définir la valeur de permutation de manière permanente, créez un fichier de configuration sysctl.d(5). Par exemple :\n\n```\n/etc/sysctl.d/99-swappiness.conf\n```\n\n```\nvm.swappiness=10\n```\n\nPour que le chargeur d'amorçage définisse la «swappiness» lors du chargement du noyau, ajoutez un paramètre du noyau, par exemple sysctl.vm.swappiness=10.\n\nPour tester et en savoir plus sur les raisons pour lesquelles cela peut fonctionner, jetez un œil à cet article.\n\n"
    },
    {
      "title": "Pression du cache VFS",
      "level": 3,
      "content": "Un autre paramètre sysctl qui affecte les performances de swap est vm.vfs_cache_pressure, qui contrôle la tendance du noyau à récupérer la mémoire qui est utilisée pour la mise en cache des caches VFS, par rapport au pagecache et au swap. L'augmentation de cette valeur augmente la vitesse à laquelle les caches VFS sont récupérés [1]. Pour plus d'informations, consultez la documentation du noyau Linux.\n\n"
    },
    {
      "title": "Priorité",
      "level": 3,
      "content": "Si vous avez plus d'un fichier d'échange ou d'une partition d'échange, vous devriez envisager d'attribuer une valeur de priorité (0 à 32767) pour chaque zone d'échange. Le système utilisera les zones d'échange de priorité supérieure avant d'utiliser les zones d'échange de priorité inférieure. Par exemple, si vous avez un disque plus rapide (/dev/sda) et un disque plus lent (/dev/sdb), attribuez une priorité plus élevée à la zone d'échange située sur le périphérique le plus rapide. Les priorités peuvent être attribuées dans fstab via le paramètre pri :\n\n```\n/dev/sda1 none swap defaults,pri=100 0 0\n/dev/sdb2 none swap defaults,pri=10 0 0\n```\n\nOu via le paramètre --priority de swapon :\n\n```\n# swapon --priority 100 /dev/sda1\n```\n\nSi deux zones ou plus ont la même priorité, et qu'il s'agit de la plus haute priorité disponible, les pages sont allouées entre elles en alternance stricte.\n\n"
    },
    {
      "title": "Utilisation de zswap ou zram",
      "level": 3,
      "content": "Zswap est une fonctionnalité du noyau Linux qui fournit un cache en écriture compressé pour les pages échangées, ZRAM crée un bloc d'échange virtuel compressé en mémoire comme alternative à un fichier ou une partition d'échange sur le disque. Les deux approches augmentent les performances et diminue les opérations d'entrée/sortie sur disque.\n\n"
    },
    {
      "title": "Striping",
      "level": 3,
      "content": "Il n'est pas nécessaire d'utiliser RAID améliorer les performance du swap. Le noyau lui-même peut répartir le swap sur plusieurs périphériques, si vous leur donnez simplement la même priorité dans le fichier /etc/fstab. Reportez-vous à The Software-RAID HOWTO pour plus de détails.\n\n"
    }
  ]
}