{
  "title": "Swap (Magyar)",
  "url": "https://wiki.archlinux.org/title/Swap_(Magyar)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Swap on video ram\n- fstab\n\nEz az oldal a cserehely és a lapozás használatához nyújt bevezetőt GNU/Linux-on. Emellett tárgyalja a cserehelyek és a cserefájlok készítésének és aktiválásának módját.\n\nA All about Linux swap space (Mindent a Linux cserehelyről):\n\n"
    },
    {
      "title": "Cserehely",
      "level": 2,
      "content": "A cserehely leggyakrabban egy lemezpartíció, de akár egy fájl is lehet. A felhasználó az Arch Linux telepítése során, de akár később is létrehozhatja, ha szükségessé válna. A cserehely általában tanácsos az 1 GB-nál kevesebb RAM-mal rendelkező rendszereknél, de inkább személyes választás kérdése a RAM-mal bővel ellátott rendszerek esetében (bár a lemezre való felfüggesztéskor még mindig szükség van rá).\n\nHogy leellenőrizzük a cserehely állapotát, futtassuk ezt a parancsot:\n\n```\n$ swapon -s\n```\n\nvagy ezt:\n\n```\n$ free -m\n```\n\n"
    },
    {
      "title": "Cserehely (külön partíció)",
      "level": 2,
      "content": "A cserehely, vagy \"swap\" partíció létrehozható a legtöbb GNU/Linux particionáló eszközzel (mint pl.: fdisk, cfdisk). A cserehelyek típusa a82.\n\nHogy efféle partíción cserehelyet hozzunk létre (mintha fájlrendszert formáznánk), a mkswap parancs használandó. Például:\n\n```\n# mkswap /dev/sda2\n```\n\nA mkswap eszköz alapértelmezetten UUID-t is létrehoz, de ha saját UUID-t akarunk adni neki, használjuk a -U zászlót.:\n\n```\n# mkswap -U saját_UUID /dev/sda2\n```\n\nAktiváljuk a lapozást a partíción:\n\n```\n# swapon /dev/sda2\n```\n\nHogy rendszerindításkor hasznájuk ezt a partíciót, jegyezzük be az fstab fájlunkba:\n\n```\n/dev/sda2 none swap defaults 0 0\n```\n\n"
    },
    {
      "title": "Cserefájl",
      "level": 2,
      "content": "A teljes partíció létrehozása melletti alternatívaként a cserefájl lehetővé teszi méretének menet közbeni változtatását is, no meg persze jóval könnyebben eltávolítható. Ez rendkívül fontos lehet, ha a szabad hely az elsődleges szempont (pl. kisebb méretű SSD-knél).\n\n"
    },
    {
      "title": "Cserefájl létrehozása",
      "level": 3,
      "content": "Note: Következő hibaüzenetett kaphatjuk mikor aktiválni szeretnénk a cserehelyet: fallocate failed: Operation not supported\n\n```\nfallocate -l 512M /swapfile\n```\n\nKövetkező hibaüzenetett kaphatjuk mikor aktiválni szeretnénk a cserehelyet: fallocate failed: Operation not supported\n\nRoot-ként használjuk a dd parancsot a cserefájl létrehozásához, mely tetszőleges méretű lehet (M = Megabájt, G = Gigabájt). Például egy 512 MiB cserefájlt létrehozása:\n\n```\n# dd if=/dev/zero of=/swapfile bs=1M count=512\n```\n\nAdjuk meg a megfelelő engedélyeket (a mindenki által olvasható cserefájl hatalmas biztonsági rés)\n\n```\n# chmod 600 /swapfile\n```\n\nMiután megfelelő mérettel létrehoztuk, hozzuk létre rajta a swap fájlrendszert:\n\n```\n# mkswap /swapfile\n```\n\nAktiváljuk:\n\n```\n# swapon /swapfile\n```\n\nSzerkesszük az /etc/fstab-ot, s hozzunk létre bejegyzést a cserefájlról:\n\n```\n/swapfile none swap defaults 0 0\n```\n\n"
    },
    {
      "title": "Cserefájl eltávolítása",
      "level": 3,
      "content": "A cserefájl eltávolításához kapcsoljuk ki rajta a lapozást:.\n\nRoot-ként:\n\n```\n# swapoff -a\n```\n\nTávolítsuk el:\n\n```\n# rm -f /swapfile\n```\n\n"
    },
    {
      "title": "Cserehely USB eszközön",
      "level": 2,
      "content": "Hála a Linux által kínált modularitásnak, több cserehelyet is használhatunk, akár több eszközön is. A merevlemezünk nagyon megtelt, ideiglenesen USB eszközt is használhatunk erre a célra. Ennek a módszernek nagyon komoly hátrányai vannak:\n\n- Az USB eszközök lassabbak, mint egy merevlemez.\n- A flash-memóriák korlátozott számú írási ciklust bírnak ki. Cserehelyként használva igen hamar tönkremennek.\n- Ha más eszközt is csatlakoztatunk, a cserehely nem használható.\n\nHogy cserehelyként használható legyen, az USB flash eszközt először particionáljuk cserehelyként. Ehhez grafikus és konzol alapú eszközöket egyaránt használhatunk (GParted, fdisk). Bizonyosodjunk meg róla, hogy a partíciót cserehelyként jelöltök meg, mielőtt a partíciós táblát kiírnánk.\n\nEzek után nyissuk meg az /etc/fstab-ot.\n\nAdjunk hozzá egy új bejegyzést, a már létező \"swap\" bejegyzés alatt, mely a mostani cserehelyet az USB meghajtóra helyezi át\n\n```\nUUID=... none swap defaults,pri=10 0 0\n```\n\nahol az UUID az alábbi parancs kimenetéből állapítható meg\n\n```\nls -l /dev/disk/by-uuid/ | grep /dev/sdc1\n```\n\nAz sdc1-et helyettesítsük a fentebb létrehozott swap partíció betűjelével. sdb1\n\nVégezetül adjuk a\n\n```\npri=0\n```\n\nparamétert az eredeti swap bejegyzés mögé, hogy az fstab megtanulja: csak akkor kell használni a merevlemez eredeti cserehelyét, ha az USB eszköz megtelt.\n\nEz az útmutató másfajta memóriakártyákkal is működik, mint például az SD kártyák, stb.\n\n"
    },
    {
      "title": "a teljesítmény hangolása",
      "level": 2,
      "content": "A cserehely értékeit hangolhatjuk, hogy nagyobb teljesítményre tegyünk szert.\n\n"
    },
    {
      "title": "Swappiness (lapozhatóság)",
      "level": 3,
      "content": "A swappiness sysctl paraméter jelképezi a rendszermag hajlandóságát, hogy használja, vagy épp kerülje a cserehelyet. Ennek értéke 0 és 200 közötti lehet. Az alapértelmezett értéke 60. Ha alacsonyra állítjuk, csökkenti a lapozás használatát, ezzel sokszor reaktívabbá a rendszert.\n\nA csere teljesítményét befolyásoló másik sysctl paraméter az vm.vfs_cache_pressure, amely szabályozza a kern hajlandóságát a VFS gyorsítótárak gyorsítótárazásához használt memória visszaszerzésére, a pagecache és a swap függvényében.\n\nAktuális értékek lekérdezése:\n\n```\nsysctl vm.swappiness\nsysctl vm.vfs_cache_pressure\n```\n\nAz értékek végleges beállítása:\n\n```\n/etc/sysctl.d/99-sysctl.conf\n```\n\n```\nvm.swappiness=10\nvm.vfs_cache_pressure=50\n```\n\nHogy teszteljük, és megtanuljuk, ez miért is így működik, ebben a cikkben nézzünk körül.\n\nA pontos leírás a swappiness. A pontos leírás a vfs_cache_pressure.\n\n"
    },
    {
      "title": "Prioritás",
      "level": 3,
      "content": "Ha több mint egy cserefájllal vagy partícióval dolgozunk, jobb, ha mindegyikük számára megadunk egy bizonyos prioritási értéket (0-tól 32767-ig). A rendszer elsőként a magasabb prioritási értékú cserehelyet fogja használni, s csak utána az alacsonyabbakat. Így ha például van egy gyorsabb lemezünk (/dev/sda) és egy lassabb (/dev/sdb), a magasabb értéket adjuk meg a cserehelynek, mely a gyorsabb lemezen található. Ezt az fstab-ban a pri paraméterrel tehetjük meg:\n\n```\n/dev/sda1 none swap defaults,pri=100 0 0\n/dev/sdb2 none swap defaults,pri=10  0 0\n```\n\nVagy a -p (vagy --priority) paraméterrel, amikor a swapon parancsot használjuk:\n\n```\n# swapon -p 100 /dev/sda1\n```\n\nHa két, vagy több helynek ugyanakkor a prioritása, s ezek legmagasabb prioritású elérhető eszközök, a lapozás allokációja round-robin alapon oszlik meg köztük.\n\n"
    }
  ]
}