{
  "title": "Sway (Português)",
  "url": "https://wiki.archlinux.org/title/Sway_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **A tradução deste artigo ou desta seção não reflete o texto original.** A tradução deste artigo ou desta seção não reflete o texto original.\n\nA tradução deste artigo ou desta seção não reflete o texto original.\n\nArtigos relacionados\n\n- Gerenciador de janela\n\nNote: **Este artigo ou esta seção precisa de tradução.** Este artigo ou esta seção precisa de tradução.\n\nEste artigo ou esta seção precisa de tradução.\n\nsway é um compositor para Wayland feito para ser totalmente compatível com o i3. De acordo com o site oficial:\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "sway pode ser instalado com o pacote sway. A versão de desenvolvimento pode ser instalada usando wlroots-gitAUR e sway-gitAUR. É aconselhável sempre atualizar o wlroots quando você atualiza o sway, devido a forte dependência.\n\nVocê pode instalar também swaylock e swayidle para bloqueio de tela e gerenciador de inatividade.\n\nO lançador de aplicativos padrão é o dmenu e o terminal padrão é o alacritty. Antes de executar sway é recomendado instalar ambos ou definir um novo lançador e terminal na configuração.\n\n"
    },
    {
      "title": "Manualmente",
      "level": 3,
      "content": "Para iniciar o Sway, simplesmente execute sway no console do Linux.\n\n"
    },
    {
      "title": "Por um gerenciador de login",
      "level": 3,
      "content": "A sessão do sway está localizada em /usr/share/wayland-sessions/sway.desktop, ela é automaticamente reconhecida por qualquer gerenciador de login moderno como GDM e SDDM.\n\nÉ também possível rodar sway como um serviço de usuário do systemd através do gerenciador de login.\n\nVocê também pode usar gerenciador de login somente texto, veja Gerenciadores de exibição#Console.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Se você já usa o i3, então copie sua configuração para ~/.config/sway/config e deve funcionar sem problemas. Caso contrário, copie o arquivo de exemplo da configuração para ~/.config/sway/config. Ele está localizado em /etc/sway/config, a menos que a flag DFALLBACK_CONFIG_DIR tenha sido configurada. Veja sway(5) para informações sobre a configuração.\n\n"
    },
    {
      "title": "Teclado",
      "level": 3,
      "content": "Por padrão, sway inicia com o teclado US QWERTY. Para configuração por input:\n\n```\n~/.config/sway/config\n```\n\n```\ninput * {\n    xkb_layout \"us,de,ru\"\n    xkb_variant \"colemak,,typewriter\"\n    xkb_options \"grp:win_space_toggle\"\n} \n\ninput <identificador> xkb_model \"pc101\"\n```\n\nMais detalhes estão disponíveis em xkeyboard-config(7) e sway-input(5).\n\nO teclado pode também ser configurado usando variáveis de ambiente (XKB_DEFAULT_LAYOUT, XKB_DEFAULT_VARIANT, etc.) quando iniciar o sway, suas opções de configuração tem precedência sobre váriaveis de ambiente.\n\n"
    },
    {
      "title": "Atraso e taxa de digitação",
      "level": 3,
      "content": "Para mudar o atraso e taxa de digitação você pode adicionar as seguintes linhas para sua seção input:\n\n```\n~/.config/sway/config\n```\n\n```\ninput <identifier> repeat_delay 300\ninput <identifier> repeat_rate 30\n```\n\n"
    },
    {
      "title": "Barra de status",
      "level": 3,
      "content": "sway vem com uma barra de status padrão na forma de swaybar que é executada em um ambiente Wayland puro. swaybar pode chamar um script ou outro programa para mostrar informações na barra de status. Veja sway-bar(5) e swaybar-protocol(7) para detalhes.\n\nInstalar o programa i3status é uma maneira simples de conseguir uma barra de status prática e padrão sob o Wayland. Tudo que se tem a fazer é adicionar o seguinte trecho no final da sua configuração do sway:\n\n```\n~/.config/sway/config\n```\n\n```\nbar {\n    status_command i3status\n}\n```\n\nSe você quer que o i3status tenha saída colorida, você pode ajustar da seguinte maneira a configuração dele:\n\n```\n~/.config/i3status/config\n```\n\n```\ngeneral {\n    colors = true\n    interval = 5\n}\n```\n\nEm ambos os exemplos, os arquivos de configuração instalados a nível de sistema foram copiados para o diretório do usuário e então modificados.\n\n"
    },
    {
      "title": "Papel de parede",
      "level": 3,
      "content": "Desde a versão 1.1.1 o gerenciamento de papel de parede do projeto SwayWM foi movido para swaybg, que é necessário para executar o comando output.\n\nEsta linha, que pode ser adicionada ao final da sua configuração do sway, define o papel de parede em todas as telas (output seleciona todos com nome \"*\"):\n\n```\n~/.config/sway/config\n```\n\n```\noutput \"*\" bg /caminho/para/arquivo fill\n```\n\nVocê tem que mudar o nome do arquivo e caminho de acordo com seu papel de parede.\n\nVocê pode usar o azote como um frontend GTK3 para swaybg.\n\nCores sólidas podem ser definidas como a seguir:\n\n```\noutput * bg #000000 solid_color\n```\n\n"
    },
    {
      "title": "Dispositivos de entrada",
      "level": 3,
      "content": "É possível realizar a configuração de específicos dispositivos de entrada. Por exemplo para habilitar toque-para-clicar e deslize natural para um touchpad, adicione um bloco de input:\n\n```\n~/.config/sway/config\n```\n\n```\ninput \"2:14:ETPS/2_Elantech_Touchpad\" {\n    tap enabled\n    natural_scroll enabled\n}\n```\n\nO identificador do dispositivo pode ser consultado com:\n\n```\n$ swaymsg -t get_inputs\n```\n\nA saída do comando, algumas vezes tem um \"\\\" para escapar símbolos como \"/\" (por exemplo, \"2:14:ETPS\\/2_Elantech_Touchpad\") e isto precisa ser removido.\n\nMais documentação e opções como perfis de aceleração podem ser encontradas em sway-input(5).\n\n"
    },
    {
      "title": "HiDPI",
      "level": 3,
      "content": "Configure o fator de escala das suas telas com o comando output em seu arquivo de configuração. O fator de escala pode ser fracionário, mas é normalmente 2 para telas HiDPI.\n\n```\noutput <nome> scale <fator>\n```\n\nVocê pode encontrar o nome da sua tela com o seguinte comando:\n\n```\n$ swaymsg -t get_outputs\n```\n\n"
    },
    {
      "title": "Atalhos customizados",
      "level": 3,
      "content": "Teclas especiais no seu teclado podem ser usadas para executar comandos, por exemplo para controlar o volume, o brilho do monitor ou tocadores de mídias:\n\n```\n~/.config/sway/config\n```\n\n```\nbindsym XF86AudioRaiseVolume exec pactl set-sink-volume @DEFAULT_SINK@ +5%\nbindsym XF86AudioLowerVolume exec pactl set-sink-volume @DEFAULT_SINK@ -5%\nbindsym XF86AudioMute exec pactl set-sink-mute @DEFAULT_SINK@ toggle\nbindsym XF86AudioMicMute exec pactl set-source-mute @DEFAULT_SOURCE@ toggle\nbindsym XF86MonBrightnessDown exec brightnessctl set 5%-\nbindsym XF86MonBrightnessUp exec brightnessctl set 5%+\nbindsym XF86AudioPlay exec playerctl play-pause\nbindsym XF86AudioNext exec playerctl next\nbindsym XF86AudioPrev exec playerctl previous\t\nbindsym XF86Search exec $menu\n```\n\nVeja PulseAudio#Keyboard volume control, Advanced Linux Sound Architecture#Keyboard volume control, Backlight#Backlight utilities e MPRIS para detalhes e utilitários alternativos.\n\nPara permitir que um atalho seja executado enquanto a tela está bloqueada, adicione o parâmetro --locked para o bindsym.\n\n```\nbindsym --locked XF86AudioPlay exec playerctl play-pause\n```\n\n"
    },
    {
      "title": "Barras Indicadoras gráficas",
      "level": 4,
      "content": "É geralmente desejável ter um nível atual de alguma configuração com valor-porcentagem, como brilho e volume, sendo indicada por uma barra gráfica. Uma boa opção que traz essa facilidade no Sway é o wob (alternativamente wob-gitAUR), que oferece um subconjunto da funcionalidade da popular ferramenta do X xobAUR mas como um utilitário nativo do Wayland implementando o protocolo layer-shell. Veja o site do projeto para exemplos de uso.\n\n"
    },
    {
      "title": "Janelas flutuantes",
      "level": 3,
      "content": "Para janelas flutuantes ou atribuição de caracteristicas, os seguintes atributos podem estar disponíveis: app_id, class, instance e title. O seguinte comando irá listar as propriedades de todas as janelas abertas.\n\n```\n$ swaymsg -t get_tree\n```\n\nPara conseguir o app_id de todas as janelas abertas, use:\n\n```\n$ swaymsg -t get_tree | grep \"app_id\"\n```\n\nPara conseguir o app_id da janela atualmente focada, use:\n\n```\n$ swaymsg -t get_tree | jq -r '..|try select(.focused == true)'\n```\n\nSe o app_id for nulo para algumas janelas, você pode usar os atributos class e/ou o instance. Com isso você pode criar regras para seus programas gráficos. Você pode pesquisar a saída e criar regras polidas para suas janelas.\n\n```\n~/.config/sway/config\n```\n\n```\nfor_window [app_id=\"galculator\"] floating enable\nassign [class=\"firefox\"] -> 3\nassign [class=\"^Urxvt$\" instance=\"^htop$\"] -> 9\n```\n\nÉ similar ao uso do xorg-xprop para descobrir o class ou wm_name no X11.\n\n"
    },
    {
      "title": "Xresources",
      "level": 3,
      "content": "Copie ~/.Xresources para ~/.Xdefaults para usá-lo no Sway.\n\n"
    },
    {
      "title": "Xwayland",
      "level": 3,
      "content": "Se um programa falhar na execução com a mensagem de erro \"cannot open display,\" provavelmente o programa que você está usando depende do X11. Para usar a camada de compatibilidade Xwayland para executar programas que dependem do X11, é necessário instalar o pacote xorg-xwayland.\n\nSe você quer desabilitar Xwayland totalmente e executar uma sessão Wayland \"pura\", desinstale o pacote xorg-xwayland e defina a seguinte opção na configuração:\n\n```\n~/.config/sway/config\n```\n\n```\nxwayland disable\n```\n\n"
    },
    {
      "title": "Iniciar automaticamente após login",
      "level": 3,
      "content": "Para rodar sway no tty1 ao logar com teclado padrão US, edite:\n\n```\n~/.bash_profile\n```\n\n```\nif [[ -z $DISPLAY ]] && [[ $(tty) = /dev/tty1 ]]; then\n  XKB_DEFAULT_LAYOUT=us exec sway\nfi\n```\n\nPara rodar sway no tty1 ao logar com teclado padrão BR, edite:\n\n```\n~/.bash_profile\n```\n\n```\nif [[ -z $DISPLAY ]] && [[ $(tty) = /dev/tty1 ]]; then\n  XKB_DEFAULT_LAYOUT=br exec sway\nfi\n```\n\n"
    },
    {
      "title": "Habilitar CapsLock/NumLock",
      "level": 3,
      "content": "Para habilitar o capslock e/ou numlock adicione as seguintes linhas no seu arquivo de configuração do sway:\n\n```\n~/.config/sway/config\n```\n\n```\ninput * xkb_capslock enable\ninput * xkb_numlock enable\n```\n\n"
    },
    {
      "title": "Layout atual do teclado",
      "level": 3,
      "content": "O layout do teclado atual pode ser descoberto com o comando a seguir, onde identificador_kbd precisa ser trocado com o identificador do seu teclado:\n\n```\n$ swaymsg -t get_inputs | jq -r '.[] | select(.identifier == \"identificador_kbd\") | .xkb_active_layout_name'\n```\n\n"
    },
    {
      "title": "Alternar luz de fundo",
      "level": 3,
      "content": "Para desligar (e ligar) suas telas com uma tecla (por exemplo, Pause), crie um atalho na sua config do Sway para o seguinte script:\n\n```\n#!/bin/sh\nread lcd < /tmp/lcd\n    if [ \"$lcd\" -eq \"0\" ]; then\n        swaymsg \"output * dpms on\"\n        echo 1 > /tmp/lcd\n    else\n        swaymsg \"output * dpms off\"\n        echo 0 > /tmp/lcd\n    fi\n```\n\n"
    },
    {
      "title": "Captura e compartilhamento de tela",
      "level": 3,
      "content": "Veja Screen capture#Wayland.\n\n"
    },
    {
      "title": "Controle swaynag com o teclado",
      "level": 3,
      "content": "Swaynag, o programa de aviso/prompt padrão que vem no sway, somente suporta interação do usuário com o mouse. Um programa auxiliar como swaynagmodeAUR pode ser usado para habilitar interação via atalhos do teclado.\n\nSwaynagmode funciona lançando swaynag, e então escutando sinais que podem acionar ações como selecionar o próximo botão, fechar o prompt, ou aceitar o botão selecionado. Estes sinais são enviados ao lançar outra instância do script swaynagmode com controle de argumento, como swaynagmode --select right ou swaynagmode --confirm.\n\nSwaynagmode por padrão aciona o modo do sway nag ao inicializar, seguido por default na saída. Isto facilita a definição de atalhos na sua configuração do sway:\n\n```\n~/.config/sway/config\n```\n\n```\nset $nag exec swaynagmode\nmode \"nag\" {\n  bindsym {\n    Ctrl+d    mode \"default\"\n\n    Ctrl+c    $nag --exit\n    q         $nag --exit\n    Escape    $nag --exit\n\n    Return    $nag --confirm\n\n    Tab       $nag --select prev\n    Shift+Tab $nag --select next\n\n    Left      $nag --select next\n    Right     $nag --select prev\n\n    Up        $nag --select next\n    Down      $nag --select prev\n  }\n}\n```\n\nNote que, a partir da versão do sway 1.2, diferencia-se maiúsculo/minúsculo em nomes de modos.\n\nVocê pode configurar o sway para usar swaynagmode com o comando de configuração swaynag_command swaynagmode.\n\n"
    },
    {
      "title": "Mudar o tema e tamanho do cursor",
      "level": 3,
      "content": "Para definir temas de cursor e tamanho:\n\n```\n~/.config/sway/config\n```\n\n```\nseat seat0 xcursor_theme tema_do_cursor tamanho_do_cursor\n```\n\nOnde tema_do_cursor pode ser definido ou trocado por um valor específico como default, Adwaita ou Simple-and-Soft, e tamanho_do_cursor um valor como 48.\n\nVocê pode inspecionar os seus valores com echo $XCURSOR_SIZE e echo $XCURSOR_THEME.\n\nVocê precisa reiniciar o programa para ver as mudanças.\n\n"
    },
    {
      "title": "Lançadores de aplicativos",
      "level": 3,
      "content": "i3-dmenu-desktop, dmenu, e rofi todos funcionam relativamente bem no Sway, no entanto, rodam sob Xwayland e sofrem do mesmo problema, onde eles podem não responder se o cursor é movido para uma janela nativa do Wayland. O motivo para isso acontecer é que clientes/janelas do Wayland não tem acesso a dispositivos de entrada a menos que eles possuam foco na tela. O servidor Xwayland é um cliente para o compositor Wayland, então um de seus clientes deve ter foco para ter acesso a entrada do usuario. No entanto, uma vez que um de seus clientes tem foco, pode captar as entradas e fazê-la disponível para todos os clientes Xwayland através do protocolo X11. Mover o cursor para uma janela Xwayland e pressionar a tecla Escape deve resolver, algumas vezes rodar pkill resolve também.\n\nbemenu é o substituto nativo do dmenu para Wayland que pode opcionalmente ser combinado com j4-dmenu-desktop para prover um lançador de arquivos desktop nativo do Wayland (como i3-dmenu-desktop faz):\n\n```\nj4-dmenu-desktop --dmenu='bemenu -i --nb \"#3f3f3f\" --nf \"#dcdccc\" --fn \"pango:DejaVu Sans Mono 12\"' --term='termite'\n```\n\nVocê pode precisar configurar a variavel de ambiente BEMENU_BACKEND para \"wayland\" se você escolhe desabilitar o Xwayland.\n\nVocê pode combinar seu terminal flutuante com fzf como discutido em uma issue do GitHub.\n\nO binário krunner provido pelo pacote plasma-workspace também serve como um lançador, oferece suporte a Xwayland e Wayland nativo.\n\nrofi-lbonn-wayland-gitAUR é um fork do rofi que funciona no Wayland e também tem uma opção -x11 caso você precise executá-lo na sessão X11.\n\nwofi-hgAUR é um lançador de aplicativos, que provê as mesmas funcionalidades do rofi e roda no Wayland. wofi não tem algumas funcionalidades do rofi como modo SSH e um modo de troca de janelas. É baseado na biblioteca wlroots e usa GTK3 para renderização. Funciona bem com o sway.\n\n"
    },
    {
      "title": "Virtualização",
      "level": 3,
      "content": "Sway funciona no VirtualBox e VMware ESXi.\n\n"
    },
    {
      "title": "Não consegue iniciar o Sway pelo tty",
      "level": 4,
      "content": "Para ESXi, você precisa habilitar o suporte a 3D em Hardware Configuration > Video card settings. Veja também VMware#Enable 3D graphics on Intel, Optimus and AMD.\n\n"
    },
    {
      "title": "Cursor invisível",
      "level": 4,
      "content": "Quando usar o controlador de gráficos VMSVGA, o cursor vai ficar invisível. Para corrigir isto declare a seguinte váriavel de ambiente (como discutido em [2]):\n\n```\n$ export WLR_NO_HARDWARE_CURSORS=1\n```\n\n"
    },
    {
      "title": "Sway socket não detectado",
      "level": 3,
      "content": "Usando um argumento do swaymsg, como swaymsg -t get_outputs, irá algumas vezes retornar a mensagem:\n\n```\nsway socket not detected.\nERROR: Unable to connect to\n```\n\nQuando roda dentro de um terminal multiplex (como GNU Screen ou tmux). Isto significa que swaymsg não pôde se conectar ao socket provido pelo SWAYSOCK.\n\nPara ver qual o atual valor do SWAYSOCK, digite:\n\n```\n$ env | grep -F \"SWAYSOCK\"\n```\n\n```\nSWAYSOCK=/run/user/1000/sway-ipc.1000.4981.sock\n```\n\nPara resolver este problema, você pode tentar definir o socket baseado no atual processo do sway:\n\n```\n$ export SWAYSOCK=/run/user/$(id -u)/sway-ipc.$(id -u).$(pgrep -x sway).sock\n```\n\nPara evitar este erro, rode o comando fora de um multiplex.\n\n"
    },
    {
      "title": "Não foi possível pegar o caminho do socket",
      "level": 3,
      "content": "Solicitar mensagens do swaymsg -t no tty pode retornar a seguinte mensagem:\n\n```\nUnable to retrieve socket path\n```\n\nA variável de ambiente SWAYSOCK é configurada depois do lançamento do Sway, então uma resolução para este erro é solicitar swaymsg -t [message] dentro de um terminal no Sway.\n\n"
    },
    {
      "title": "Atalhos e formato do teclado",
      "level": 3,
      "content": "Por padrão, se voce esta usando mais do que um formato de teclado, exemplo input * xkb_layout \"us,ru\", atalhos podem se tornar quebrados quando você troca para um teclado secundário.\n\nGraças ao https://github.com/swaywm/sway/pull/3058, tudo que você precisa fazer é adicionar --to-code a linhas do bindsym como esta:\n\n```\nbindsym --to-code {\n  $mod+$left focus left\n  $mod+$down focus down\n  $mod+$up focus up\n  $mod+$right focus right\n}\n```\n\n"
    },
    {
      "title": "Programas java",
      "level": 3,
      "content": "Alguns programas baseados no Java irão mostrar uma tela branca quando abertos, por exemplo qualquer editor Intellij. Para solucionar isto, o programa pode ser iniciado com a variável de ambiente _JAVA_AWT_WM_NONREPARENTING configurada para 1.\n\nSe você rodar o programa por um lançador como rofi ou dmenu, você pode querer modificar a entrada desktop do aplicativo como descrito em Desktop entries#Modify environment variables.\n\nAlguns problemas com aplicações Java foram concertadas no OpenJDK 11 e Sway 1.5. No entanto, certas aplicações precisam de configuração adicional para usar as versões mais novas do OpenJDK, no caso das IDEs JetBrains você deve definir STUDIO_JDK=/usr/lib/jvm/java-11-openjdk-amd64/. [3]\n\n"
    },
    {
      "title": "Rolar na borda",
      "level": 3,
      "content": "Se usar a roda de rolagem do mouse na borda de um aplicativo, você poderá usar border none para o app_id (por exemplo, Firefox).\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Projeto no GitHub\n- Wiki oficial do Sway\n- Página git no sr.ht\n- Site\n- Anunciando o lançamento do sway 1.0\n\n"
    }
  ]
}