{
  "title": "Sway (Español)",
  "url": "https://wiki.archlinux.org/title/Sway_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2024-06-03** \n\nArtículos relacionados\n\n- Window manager (Español)\n\nSway (proveniente de S'irCmpwn's Way'land compositor [1]) es un compositor para Wayland (Español) diseñado para ser totalmente compatible con i3. Según el sitio web oficial:\n\nSi le interesan los efectos visuales llamativos consulte swayfxAUR, un fork de sway.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Sway puede ser instalado con el paquete sway. La versión de desarrollo se puede instalar con sway-gitAUR. Se aconseja actualizar siempre wlroots cuando se actualice sway, debido a que ambos paquetes dependen uno del otro.\n\nTambién se recomienda instalar swaylock, swayidle y swaybg para bloquear la pantalla, configurar un gestor de inactividad y establecer fondos de pantalla respectivamente. Igualmente puede encontrar las versiones de desarrollo de estos paquetes en el AUR, como swaylock-gitAUR, swayidle-gitAUR y swaybg-gitAUR. Estos ofrecen las últimas funciones y actualizaciones de sus respectivos repositorios Git de los proyectos.\n\nEl lanzador de aplicaciones por defecto es wmenu (aunque la configuración por defecto aún utiliza dmenu_path con dmenu) y el emulador de terminal por defecto es foot. Antes de iniciar sway se aconseja instalar estos paquetes o establecer un nuevo lanzador y terminal en el archivo de configuración. Para más versiones de programas compatibles con i3 se recomienda consultar la guía de migración en la wiki de sway.\n\n"
    },
    {
      "title": "Inicio",
      "level": 2,
      "content": "Antes de que Sway pueda iniciarse, este necesita acceder a tus dispositivos de hardware como el teclado, el ratón y la tarjeta gráfica. El conjunto de estos dispositivos de hardware se llama seat, como se menciona en sd-login(3).\n\nEn Arch Linux, Sway puede obtener acceso a seat utilizando\n\n- systemd-logind(8) y polkit, o\n- seatd, que se instalará junto a Sway como una dependencia de wlroots\n\nSi polkit ya está instalado en su sistema, Sway debería obtener automáticamente el acceso a seat.\n\nAlternativamente, si polkit no está instalado en su sistema y quiere usar seatd en su lugar, deberá agregarse al grupo de usuarios seat y active seatd.service, vuelve a iniciar la sesión y elige uno de los siguientes métodos para iniciar Sway.\n\n"
    },
    {
      "title": "Manualmente",
      "level": 3,
      "content": "Para iniciar Sway, ejecute sway en la consola.\n\n"
    },
    {
      "title": "Automáticamente al ingresar a una TTY",
      "level": 3,
      "content": "De forma similar al servidor gráfico X, Sway puede iniciar automáticamente al agregar el siguiente código en su archivo de inicio de la shell (véase Command-line shell (Español)#Intérprete de línea de órdenes de inicio de sesión):\n\n```\nif [ -z \"${WAYLAND_DISPLAY}\" ] && [ \"${XDG_VTNR}\" -eq 1 ]; then\n  exec sway\nfi\n```\n\nPara más detalles, consulte Xinit (Español)#Inicio automático de X al inicio de sesión\n\n"
    },
    {
      "title": "Desde un gestor de pantallas",
      "level": 3,
      "content": "La sesión de sway se encuentra en /usr/share/wayland-sessions/sway.desktop. Esta es reconocida automáticamente por gestores de pantalla modernos como GDM y SDDM.\n\nSe puede iniciar sway como servicio de usuario de systemd a través del gestor de pantallas.\n\nTambién puede usar un gestor de sesiones de consola, consulte Display manager (Español)#Consola.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Si usted ya usa i3, es posible copiar el archivo de configuración existente a ~/.config/sway/config y que este funcione de forma inmediata en sway. De otra forma, copie el archivo de configuración muestra ubicado en /etc/sway/config a ~/.config/sway/config. Consulte sway(5) para conocer más de la configuración.\n\n"
    },
    {
      "title": "Mapa de teclado",
      "level": 3,
      "content": "Por defecto, sway inicia con la distribución de teclado US QWERTY. Para configurar por dispositivo de entrada:\n\n```\n~/.config/sway/config\n```\n\n```\ninput * {\n    xkb_layout \"us,de,ru\"\n    xkb_variant \"colemak,,typewriter\"\n    xkb_options \"grp:win_space_toggle\"\n}\n\ninput <identifier> xkb_model \"pc101\"\n```\n\nPara más detalles véase xkeyboard-config(7) y sway-input(5).\n\nEl mapa de teclado también puede ser configurado usando variables de entorno (XKB_DEFAULT_LAYOUT, XKB_DEFAULT_VARIANT, etc.) al iniciar sway. Las opciones de configuración se priorizan ante las variables de ambiente.\n\n"
    },
    {
      "title": "Tasa y retardo tipográfico",
      "level": 3,
      "content": "Para modificar la tasa y retardo tipográfico, agregue las siguientes lineas a la sección input de configuración:\n\n```\n~/.config/sway/config\n```\n\n```\ninput <identifier> repeat_delay 300\ninput <identifier> repeat_rate 30\n```\n\n"
    },
    {
      "title": "Barra de estado",
      "level": 3,
      "content": "Sway incluye una barra de estado, swaybar, que se ejecuta en un ambiente de Wayland (Español) puro. swaybar puede ejecutar un script o algún otro programa para mostrar información en la barra de estado. Consulte sway-bar(5) y swaybar-protocol(7) para más detalles.\n\nInstalar i3status es una opción para tener una barra de estado práctica por defecto en Wayland. Agregue el siguiente segmento de código al final de su archivo de configuración de sway:\n\n```\n~/.config/sway/config\n```\n\n```\nbar {\n    status_command i3status\n}\n```\n\nPara habilitar los colores en la salida de i3status necesitará modificar el siguiente segmento en la configuración de i3status:\n\n```\n~/.config/i3status/config\n```\n\n```\ngeneral {\n    colors = true\n    interval = 5\n}\n```\n\n"
    },
    {
      "title": "Outputs",
      "level": 3,
      "content": "El comando output de sway permite configurar detalladamente diferentes salidas de pantalla (outputs en inglés). Esto incluye ajustes como el fondo de pantalla, factor de escala, posición, entre otros. Usted puede combinar múltiples comandos en una sola linea, de acuerdo a sus necesidades.\n\n```\n~/.config/sway/config\n```\n\n```\noutput HDMI-A-1 mode 1920x1080 pos 1920 0 bg ~/wallpaper.png stretch\n```\n\nPodemos referirnos a una salida de pantalla en específico utilizando sus nombres designados, también podemos referirnos a cualquier salida con \"*\", o mediante el uso de nombres específicos de las pantallas (usualmente una cadena de caracteres que consiste del nombre de la empresa, modelo y número de serie). Por ejemplo:\n\n```\n~/.config/sway/config\n```\n\n```\noutput \"Alguna Compañía ABC123 0x00000000\" pos 1920 0\n```\n\nSe puede obtener una lista de los nombres de las salidas e información adicional con la orden:\n\n```\n$ swaymsg -t get_outputs\n```\n\nPara conocer más acerca de las opciones de configuración, consulte sway-output(5).\n\n"
    },
    {
      "title": "Fondo de pantalla",
      "level": 4,
      "content": "La visualización de un fondo de pantalla en sway es gestionada por un programa dedicado. El ejemplo más simple es swaybg, que sway puede gestionar directamente. El paquete swaybg debe ser instalado para poder ejecutar la orden output ... bg.\n\nLa siguiente linea configura una imagen como fondo en todas las pantallas (output aplicará el comando a todas las pantallas \"*\"), esta puede ser colocada en cualquier parte del archivo de configuración:\n\n```\n~/.config/sway/config\n```\n\n```\noutput \"*\" bg /ruta/a/imagen fill\n```\n\nNo olvide reemplazar /ruta/a/imagen con la ruta de una imagen existente.\n\nPuede usar colores sin transparencias como fondo:\n\n```\noutput * bg #000000 color\n```\n\nConsulte la wiki de Sway para utilidades y herramientas adicionales de administración de fondo de pantalla.\n\n"
    },
    {
      "title": "HiDPI",
      "level": 4,
      "content": "Configure el factor de escala de pantallas con el comando output en su archivo de configuración. El factor de escala puede ser fraccional, aunque este suele ser un factor de 2 para pantallas HiDPI.\n\n```\n~/.config/sway/config\n```\n\n```\noutput <nombre> scale <factor>\n```\n\nPuede encontrar el nombre de la pantalla con ejecutando el comando:\n\n```\n$ swaymsg -t get_outputs\n```\n\n"
    },
    {
      "title": "Dispositivos de entrada",
      "level": 3,
      "content": "Es posible modificar individualmente la configuracion de los dispositivos de entrada. Por ejemplo, para activar \"toque para hacer clic\" y desplazamiento natural en todos los touchpads:\n\n```\n~/.config/sway/config\n```\n\n```\ninput type:touchpad {\n    tap enabled\n    natural_scroll enabled\n}\n```\n\nPara configurar un touchpad específico, use swaymsg -t get_inputs para obtener el identificador del dispositivo deseado y reemplácelo por type:touchpad.\n\nPuede encontrar más documentación en sway-input(5) y configuración adicional como perfiles de aceleración o cómo desactivar la entrada de dispositivos.\n\n"
    },
    {
      "title": "Asignación de pantallas táctiles",
      "level": 4,
      "content": "Los objetivos entradas táctiles de las pantallas táctiles usadas en entornos multipantalla pueden ser asignados a una sola pantalla.\n\n```\n~/.config/sway/config\n```\n\n```\nset $display1       \"Dell Inc. DELL P2414H VHVTW542165L\"\nset $display2       \"Dell Inc. DELL P2418HT MYDM775F152L\"\nset $display2-touch \"8146:24835:Melfas_LGD_AIT_Touch_Controller\"\n\t\ninput $display2-touch map_to_output $display2\n```\n\n"
    },
    {
      "title": "Atajos de teclado personalizados",
      "level": 3,
      "content": "Las teclas especiales en su teclado pueden ser utilizadas para ejecutar órdenes, por ejemplo, para controlar el volumen, brillo del monitor o reproductores de música:\n\n```\n~/.config/sway/config\n```\n\n```\nbindsym XF86AudioRaiseVolume exec pactl set-sink-volume @DEFAULT_SINK@ +5%\nbindsym XF86AudioLowerVolume exec pactl set-sink-volume @DEFAULT_SINK@ -5%\nbindsym XF86AudioMute exec pactl set-sink-mute @DEFAULT_SINK@ toggle\nbindsym XF86AudioMicMute exec pactl set-source-mute @DEFAULT_SOURCE@ toggle\nbindsym XF86MonBrightnessDown exec brightnessctl set 5%-\nbindsym XF86MonBrightnessUp exec brightnessctl set 5%+\nbindsym XF86AudioPlay exec playerctl play-pause\nbindsym XF86AudioNext exec playerctl next\nbindsym XF86AudioPrev exec playerctl previous\nbindsym XF86Search exec bemenu-run\n```\n\nPara más detalles y programas adicionales véase:\n\n- PulseAudio#Keyboard volume control\n- WirePlumber#Keyboard volume control\n- Advanced Linux Sound Architecture#Keyboard volume control\n- Backlight#Backlight utilities\n- MPRIS\n\nPara permitir que un atajo de teclado se pueda ejecutar mientras que la pantalla está bloqueada, agregue el parámetro --locked a bindsym.\n\n```\nbindsym --locked XF86AudioPlay exec playerctl play-pause\n```\n\n"
    },
    {
      "title": "Indicadores gráficos de la barra de estado",
      "level": 4,
      "content": "A menudo es deseable que el porcentaje actual de algún valor, como el brillo o el volumen, sea indicado por una barra gráfica cuando se ajusta. Una opción para proporcionar esto en Sway es wob (o wob-gitAUR), que proporciona un subconjunto de funciones de la popular herramienta xobAUR pero como una utilidad nativa de Wayland que implementa el protocolo layer-shell. Consulte el sitio web del proyecto para ver ejemplos de uso.\n\n"
    },
    {
      "title": "Vista general de los espacios de trabajo",
      "level": 4,
      "content": "Si usa un gran número de espacios de trabajo con varias ventanas y le es difícil recordar la ubicación de estos, entonces sovAUR puede ser de ayuda. Es una ventana superpuesta (overlay) que muestra los esquemas de los espacios de trabajo, para hacer su navegación más sencilla. Muestra los nombres de los programas y ventanas, además soporta configuraciones de múltiples pantallas. Consulte la página del proyecto para más información.\n\n"
    },
    {
      "title": "Idle",
      "level": 3,
      "content": "Sway tiene un demonio de inactividad (idle) llamado swayidle que administra la inactividad de las sesiones. Existen muchas formas de iniciar y configurar el demonio. La más sencilla es usar el archivo de configuración de sway. swayidle acepta múltiples argumentos para configurar eventos como timeout (es decir, periodo de inactividad), resume (al reanudar de suspensión), before-sleep, etc. Consulte swayidle(1) para más conocer detalles de los eventos. Es posible asignar una acción a un evento. Para asignar múltiples acciones a un evento sólo repita el accionador (trigger).\n\nLa siguientes lineas indican a swayidle bloquear la pantalla después de 30 minutos de inactividad y apagar la pantalla cinco segundos después del bloqueo:\n\n```\n~/.config/sway/config\n```\n\n```\nexec swayidle -w \\\n\ttimeout 1800 'swaylock -f' \\\n\ttimeout 1805 'swaymsg \"output * dpms off\"' \\\n\tresume 'swaymsg \"output * dpms on\"'\n```\n\nPara apagar una pantalla bloqueada con más anticipación, como después de 10 segundos, filtre con grep el proceso del bloqueo de pantalla de la lista de procesos y ejecute swaymsg \"output * dpms off\" de la siguiente forma:\n\n```\ntimeout 10 'if pgrep -x swaylock; then swaymsg \"output * dpms off\"; fi'\n```\n\nPara suspender y pausar medios de reproducción, anteceda las siguientes instrucciones al comando swayidle:\n\n```\nbefore-sleep 'playerctl pause; swaylock'\n```\n\nSi no desea que swaylock se active mientras se reproducen vídeos en Firefox, Chrome o VLC puede usar idlehack-gitAUR para escuchar las peticiones de inhibición del dbus e invocar swayidle-inhibit. Programas como Firefox, Chrome y VLC emiten estos eventos para evitar que el sistema quede inactivo.\n\n"
    },
    {
      "title": "Ventanas flotantes",
      "level": 3,
      "content": "Para habilitar ventanas flotantes o asignaciones de modos, abra la aplicación y use los atributos app_ip, class, instance y title para habilitarla. El siguiente comando listará las propiedades de todas las ventanas abiertas.\n\n```\n$ swaymsg -t get_tree\n```\n\nPara obtener app_id de todas las ventanas abiertas escriba:\n\n```\n$ swaymsg -t get_tree | grep \"app_id\"\n```\n\nY para el app_id de la ventana enfocada:\n\n```\n$ swaymsg -t get_tree | jq -r '..|try select(.focused == true)'\n```\n\nLas ventanas de X11 no cuentan con app_id. Sin embargo, puede usar atributos como class, window_type, window_role y/o instance para obtenerlas. Busque en la salida del comando swaymsg -t get_tree y configure reglas específicas para esas ventanas.\n\n```\n~/.config/sway/config\n```\n\n```\nfor_window [app_id=\"galculator\"] floating enable\nfor_window [window_type=\"dialog\"] floating enable\nfor_window [window_role=\"dialog\"] floating enable\nassign [class=\"firefox\"] -> 3\nassign [class=\"^Urxvt$\" instance=\"^htop$\"] -> 9\n```\n\nEste proceso es similar a usar xorg-xprop para conocer los atributos class o wm_name en X11.\n\nAl usar múltiples pantallas algunas ventanas flotantes pueden incrementar su tamaño más allá de una pantalla. Este comando centra y redimensiona la ventana flotantes al 80% del tamaño de la pantalla actual:\n\n```\n$ swaymsg move position center; swaymsg resize set 80ppt 80ppt\n```\n\n"
    },
    {
      "title": "Portapapeles",
      "level": 3,
      "content": "Note: **This article or section is a candidate for merging with Clipboard.** This article or section is a candidate for merging with Clipboard.\n\nThis article or section is a candidate for merging with Clipboard.\n\nPor defecto, el portapapeles es vaciado cuando una ventana se cierra. Este comportamiento puede ser sorpresivo.\n\nUn \"gestor de portapapeles\" debe de ser instalado para que el contenido copiado se comparta entre las ventanas.\n\nUn ejemplo de un gestor de portapapeles diseñado para waylando es clipman, el cual puede ser instalado con el paquete clipmanAUR or clipman-gitAUR.\n\nPara iniciar clipman simultáneamente a Sway, agregue la siguiente línea a su archivo de configuración:\n\n```\n~/.config/sway/config\n```\n\n```\nexec wl-paste -t text --watch clipman store --no-persist\n```\n\n"
    },
    {
      "title": "Xresources",
      "level": 3,
      "content": "Copie ~/.Xresources a ~/.Xdefaults para usarlos en Sway.\n\n"
    },
    {
      "title": "Xwayland",
      "level": 3,
      "content": "Consulte Wayland (Español)#Xwayland para más detalles y un resumen de los paquetes disponibles.\n\nXwayland se encuentra habilitado por defecto.\n\nSi desea deshabilitarlo y ejecutar una sesión de Wayland \"pura\", modifique su archivos de configuración con los siguientes valores:\n\n```\n~/.config/sway/config\n```\n\n```\nxwayland disable\n```\n\nPara identificar qué ventanas están utilizando Xwayland, agregue la siguiente linea:\n\n```\n~/.config/sway/config\n```\n\n```\nfor_window [shell=\"xwayland\"] title_format \"[Xwayland] %title\"\n```\n\n"
    },
    {
      "title": "Usar otro renderizador de wlroots",
      "level": 3,
      "content": "Es posible usar otro renderizador de wlroots al asignar la variable de ambiente WLR_RENDERER. La lista de renderizadores disponibles está en la documentación de wlroots.\n\n"
    },
    {
      "title": "Inicio automático",
      "level": 3,
      "content": "Consulte i3#Autostart y modifique el nombre del archivo de configuración acorde al de sway.\n\n"
    },
    {
      "title": "Habilita BloqMayus/BloqNum al inicio",
      "level": 3,
      "content": "Sway desactiva las teclas BloqMayus (CapsLock) y BloqNum (NumLock) al iniciar. Para que sean activadas al inicio, modifique las configuraciones de entrada xkb_capslock y/o xkb_numlock a enable para sus teclados. Por ejemplo, para aplicarlo en todos los teclados, incluya las siguientes lineas en su configuración:\n\n```\n~/.config/sway/config\n```\n\n```\ninput type:keyboard xkb_capslock enabled\ninput type:keyboard xkb_numlock enabled\n```\n\nEn cualquier caso, BloqMayus y BloqNum pueden ser alternadas al presionar las teclas correspondientes en el teclado.\n\n"
    },
    {
      "title": "Distribución de teclado actual",
      "level": 3,
      "content": "La distribución de teclado actual puede ser obtenida de la siguiente forma, donde kbd_identifier debe de ser reemplazado por el identificador del teclado actual:\n\n```\n$ swaymsg -t get_inputs | jq -r '.[] | select(.identifier == \"kbd_identifier\") | .xkb_active_layout_name'\n```\n\n"
    },
    {
      "title": "Tecla de composición",
      "level": 3,
      "content": "Para configurar PrintScreen (tecla de imprimir pantalla) como tecla de composición:\n\n```\n$ swaymsg 'input * xkb_options compose:prsc'\n```\n\nLas combinaciones disponibles para asignar a la tecla de composición se muestran en Xorg/Keyboard configuration#Configuring compose key. Estas incluso pueden ser configuradas en el archivo XCompose. Es necesario reiniciar las aplicaciones para que lo cambios se vean reflejados.\n\nNote: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nPuede buscar nombres de teclas en /usr/include/X11/keysymdef.h, o usar algún depurador como xev(1): xkbcli-interactive-wayland(1) (en /usr/lib/xkbcommon/).\n\n"
    },
    {
      "title": "Alternar iluminación",
      "level": 3,
      "content": "Para apagar (y encender) su pantalla con una tecla (por ejemplo, Pause), agregue el siguiente script a su archivo de configuración de Sway:\n\n```\n#!/bin/sh\nread lcd < /tmp/lcd\n    if [ \"$lcd\" -eq \"0\" ]; then\n        swaymsg \"output * dpms on\"\n        echo 1 > /tmp/lcd\n    else\n        swaymsg \"output * dpms off\"\n        echo 0 > /tmp/lcd\n    fi\n```\n\nO use la opción toggle directamente, puede que deba especificar una pantalla específica si tiene múltiples pantallas:\n\n```\n$ swaymsg \"output nombre_pantalla dpms toggle\"\n```\n\n"
    },
    {
      "title": "Capturar y compartir pantalla",
      "level": 3,
      "content": "Véase Screen capture#Wayland.\n\n"
    },
    {
      "title": "Ajuste de temperatura de color",
      "level": 3,
      "content": "Véase Backlight#Wayland.\n\n"
    },
    {
      "title": "Controlar swaynag con el teclado",
      "level": 3,
      "content": "Swaynag es el programa de avisos incluido por defecto en sway, este sólo permite interacciones con el ratón. Un programa como swaynagmodeAUR puede ser usado para permitir la interacción a través del teclado.\n\nSwaynagmode funciona ejecutando swaynag primero, luego escucha por señales que activan aciones, como seleccionar el siguiente botón, ignorar el prompt o aceptar el botón seleccionado. Estas señales son enviadas lanzando otra instancia del script swaynagmode con argumentos de control, como swaynagmode --select right o swaynagmode --confirm.\n\nSwaynagmode activa por defecto el modo sway nag al iniciar seguido de default al finalizar. Esto permite definir atajos de teclado fácilmente en su archivo de configuración:\n\n```\n~/.config/sway/config\n```\n\n```\nset $nag exec swaynagmode\nmode \"nag\" {\n  bindsym {\n    Ctrl+d    mode \"default\"\n\n    Ctrl+c    $nag --exit\n    q         $nag --exit\n    Escape    $nag --exit\n\n    Return    $nag --confirm\n\n    Tab       $nag --select prev\n    Shift+Tab $nag --select next\n\n    Left      $nag --select next\n    Right     $nag --select prev\n\n    Up        $nag --select next\n    Down      $nag --select prev\n  }\n}\n```\n\nTome en cuenta que desde la versión 1.2 de sway, los nombres de los modos diferencian entre mayúsculas y minúsculas (case-sensitive)\n\nPuede configurar sway para que use swaynagmode con el comando de configuración swaynag_command swaynagmode.\n\n"
    },
    {
      "title": "Cambiar el tema y tamaño del cursor",
      "level": 3,
      "content": "Para modificar el tamaño y tema del cursor:\n\n```\n~/.config/sway/config\n```\n\n```\nseat seat0 xcursor_theme my_cursor_theme my_cursor_size\n```\n\nDonde my_cursor_theme puede asignarse o ser reemplazado por un valor específico como default, Adwaita o Simple-and-Soft, y my_cursor_size con valores como 48.\n\nPara ver los valores ejecute echo $XCURSOR_SIZE y echo $XCURSOR_THEME.\n\nPuede que necesite reiniciar las aplicaciones para ver reflejado el cambio.\n\n"
    },
    {
      "title": "Administrar demonios de Sway con systemd",
      "level": 3,
      "content": "Systemd provee graphical-session.target, la cual es una unidad de usuario de systemd que es activada cuando una sesión grafica es ejecutada, ya sea en Xorg o Wayland. Los servicios de usuario que deben de ejecutarse en todos los entornos gráficos pueden vincularse a este target. También permite que el target de un gestor de ventanas en particular sea vinculado a graphical-session.target para iniciar y detener servicio que deberían de iniciar sólo al usar ese gestor de ventanas. Véase systemd.special(7).\n\nAlgunos usuarios quizá quieran iniciar algunos servicios/demonios (como swayidle o kanshi) sólo cuando el gestor de ventanas es Sway, y finalizar estos servicios cuando Sway se detiene. Además, usuarios que ejecuten systemd-oomd.service(8) puede que necesiten cgroups separados, para que un servicio no consuma toda la memoria y detenga la sesión de Sway (Consulte el reporte del bug de Fedora).\n\nAlgunas o todas estas funciones las proveen los paquetes de Sway en Arch. Por ejemplo, el paquete sway incluye el archivo sway-session.target, tanto sway como sway-gitAUR proveen el archivo 50-systemd-user.conf (véase #Configuración).\n\nSi usted busca usar su propio método o un paquete específico como sway-systemd-gitAUR o sway-services-gitAUR para proveer dichas funciones, considere eliminar los archivos que brindan la misma funcionalidad.\n\nEstas funciones pueden brindarse mediante un método propio al crear un sway-session.target dejando los demonios/servicios necesitado por sway-session.target. Este target de systemd debería de ser un target de usuario (véase systemd/User). Por ejemplo:\n\n```\n~/.config/systemd/user/sway-session.target\n```\n\n```\n[Unit]\nDescription=Sway compositor session\nDocumentation=man:systemd.special\nBindsTo=graphical-session.target\nWants=graphical-session-pre.target\nAfter=graphical-session-pre.target\n```\n\nLuego agregue la siguiente linea al archivo de configuración de Sway (por ejemplo, agregue al final de ~/.config/sway/config, o en un nuevo archivo en /etc/sway/config.d/):\n\n```\n~/.config/sway/config\n```\n\n```\n...\n...\n...\nexec_always \"systemctl --user start sway-session.target\"\n```\n\nCon la linea anterior en el archivo de configuración, cuando Sway inicie también se activa sway-session.target.\n\nFinalmente, enlace los servicios necesitados a sway-session.target. Por ejemplo, agregue kanshi (o el servicio kanshi-gitAUR):\n\n```\n~/.config/systemd/user/kanshi.service\n```\n\n```\n[Unit]\nDescription=Dynamic output configuration for Wayland compositors\nDocumentation=https://sr.ht/~emersion/kanshi\nBindsTo=sway-session.target\n\n[Service]\nType=simple\nExecStart=/usr/bin/kanshi\n\n[Install]\nWantedBy=sway-session.target\n```\n\nCuando esta unidad de usuario sea activada, sólo se iniciará cuando Sway se ejecuta y se detendrá cuando Sway no se ejecute.\n\nLa creación e importación del archivo sway-session.target al entorno puede ser lograda al instalar sway-systemd-gitAUR. Además de separar los servicios en cgroups, sway-systemd también coloca cada aplicación gráfica (GUI) en su propio cgroup. Esto habilita la limitación de recursos por cgroup en aplicaciones individuales. Consulte README de sway-systemd.\n\n"
    },
    {
      "title": "Cambiar la resolución de pantalla después del inicio",
      "level": 3,
      "content": "Puede utilizar la aplicaciones gráficas como wdisplaysAUR, swayrandr-gitAUR o el programa de línea de comandos wlr-randr para cambiar la resolución, rotar, asignar un factor de escala y ordenar otras pantallas.\n\n"
    },
    {
      "title": "Crear salidas de video headless",
      "level": 3,
      "content": "Para crear salidas de video que no estén vinculadas a una interfaz de video física, HEADLESS-1, HEADLESS-2, etc.:\n\n```\n$ swaymsg create_output\n```\n\nMostrar una descripción de la salida de video:\n\n```\n$ swaymsg -pt get_outputs | grep -A 10 HEADLESS\n```\n\nPara configurar la nueva salida de video use el comando output, por ejemplo:\n\n```\n~/.config/sway/config\n```\n\n```\noutput HEADLESS-1 {\npos 1920,0\nmode 1280x720@75Hz\n}\n```\n\n"
    },
    {
      "title": "Cambiar la tecla modificadora a BloqMayus y mantener Super",
      "level": 3,
      "content": "Para cambiar la tecla modificadora a BloqMayus y mantener la tecla Super funcionando en un teclado con distribución estadounidense, creé el archivo ~/.config/xkb/symbols/custom con los siguientes contenidos:\n\n```\n~/.config/xkb/symbols/custom\n```\n\n```\nxkb_symbols \"basic\" {\n    include \"us\"\n    name[Group1]= \"English (US Custom)\";\n    key <CAPS> { [ Hyper_L ] };\n    modifier_map Mod4 { Hyper_L };\n    key <LWIN> { [ Super_L ] };\n    modifier_map Mod5 { Super_L };\n};\n```\n\nPara otros lenguajes edite la segunda y tercera línea. Luego agregue esta disposición de teclado en su archivo de configuración de sway, preferentemente al inicio del archivo.\n\n```\n~/.config/sway/config\n```\n\n```\ninput * xkb_layout custom\nset $mod Mod4\nset $super Mod5\n```\n\n"
    },
    {
      "title": "Lanzadores de aplicaciones",
      "level": 3,
      "content": "dmenu y rofi funcionan relativamente bien en Sway, sin embargo, estos se ejecutan bajo Xwayland, lo que puede ocasionar que dejen de responder si el cursor se mueve a una ventana nativa de Wayland. Esto se debe a que los clientes/ventanas de Wayland no tienen acceso a los dispositivos de entrada a menos que tengan enfoque de la pantalla. El servidor Xwayland es un cliente del compositor de Wayland, por lo que unos de los clientes de Xwayland debe estar enfocado para que tenga acceso a la entrada del usuario. Sin embargo, cuando un cliente está enfocado puede recolectar la entrada y hacerla disponible a todos los clientes de Xwayland a través del protocolo X11. Por esta razón, mover el cursor a una ventana de Xwayland y presionar la tecla Esc debería corregir el problema, también ejecutar pkill ayuda.\n\nbemenu es un reemplazo de dmenu nativo de Wayland. Opcionalmente puede ser usado con j4-dmenu-desktop para proveer una solución nativa de Wayland para lanzar archivos de escritorio (desktop files) (como i3-dmenu-desktop):\n\n```\nj4-dmenu-desktop --dmenu='bemenu -i --nb \"#3f3f3f\" --nf \"#dcdccc\" --fn \"pango:DejaVu Sans Mono 12\"' --term='termite'\n```\n\nNecesitará configurar la variable de entorno BEMENU_BACKEND a \"wayland\" si decide no desactivar Xwayland.\n\nTambién puede crear su propio lanzador de aplicaciones usando una terminal flotante ejecutando fzf como se discute en este issue de GitHub.\n\nIgualmente el binario krunner del paquete plasma-workspace puede servir como un lanzador, ofreciendo soporte para Xwayland y Wayland nativo.\n\nrofi-wayland es un fork de rofi que se ejecuta en Wayland y tiene una bandera -x11 por si es necesario utilizarlo en una sesión de X11.\n\nwofi es un lanzador de comandos, que provee algunas características de rofi bajo Wayland. Sin embargo, rofi carece de un modo SSH y modo \"alternar ventana\". Está basado en la biblioteca wlroots y usa GTK3 para el renderizado. Funciona bastante bien en sway.\n\nfuzzel es otro lanzador de aplicaciones para compositores de Wayland basados en wlroots, es muy parecido al modo drun de rofi.\n\n"
    },
    {
      "title": "Virtualización",
      "level": 3,
      "content": "Sway funciona con VirtualBox (Español) y VMware ESXi.\n\nPara que Sway funcione en QEMU (Español), este debe de iniciarse con la bandera -vga qxl. Véase también QEMU#qxl.\n\n"
    },
    {
      "title": "No es posible iniciar Sway desde una tty",
      "level": 4,
      "content": "Para ESXi necesita habilitar el soporte 3D en el menú Hardware Configuration > Video card settings. Véase VMware#Enable 3D graphics on Intel, Optimus and AMD para más detalles.\n\n"
    },
    {
      "title": "El cursor no es visible",
      "level": 4,
      "content": "Cuando ciertos controladores gráficos están en uso (como los controladores gráficos VMSVGA o NVIDIA), el cursor se vuelve invisible. Esto puede ser arreglado usando software de cursores, como se menciona en [3]:\n\n```\n$ export WLR_NO_HARDWARE_CURSORS=1\n```\n\n"
    },
    {
      "title": "El socket de Sway no es detectado",
      "level": 3,
      "content": "Al invocar swaymsg con algún argumento, como swaymsg -t get_outputs, puede devolver un mensaje de error:\n\n```\nsway socket not detected.\nERROR: Unable to connect to\n```\n\ncuando se ejecuta el comando dentro de un multiplexador de terminal (como GNU Screen or tmux). Esto significa que swaymsg no pudo conectarse al socket designado en SWAYSOCK.\n\nPara conocer el valor actual de SWAYSOCK escriba:\n\n```\n$ env | grep -F \"SWAYSOCK\"\n```\n\n```\nSWAYSOCK=/run/user/1000/sway-ipc.1000.4981.sock\n```\n\nUna forma de solucionar este problema es intentar conectarse a un socked del proceso de ejecución de sway:\n\n```\n$ export SWAYSOCK=/run/user/$(id -u)/sway-ipc.$(id -u).$(pgrep -x sway).sock\n```\n\nPara evitar ese error simplemente ejecute el comando fuera de un multiplexador.\n\n"
    },
    {
      "title": "Falló la conexión al servidor Wayland",
      "level": 3,
      "content": "Tmux crea variables de entorno locales para cada sesión (para visualizarlas escriba: tmux show-environment). Debido a esto, si intenta volver a conectarse a una sesión previa de tmux usando tmux-resurrect o tmux-continuum, o si su servidor de tmux inicia antes que sway, entonces las variables de entorno estarán desactualizadas.\n\nPuede usar update-environment en .tmux.conf para indicarle a tmux que actualice las variables cuando se reconecta a la sesión:\n\n```\nset-option -g update-environment \"DISPLAY WAYLAND_DISPLAY SWAYSOCK SSH_AUTH_SOCK\"\n```\n\n"
    },
    {
      "title": "No fue posible recuperar la ruta del socket",
      "level": 3,
      "content": "Al solicitar mensajes desde una tty con swaymsg -t puede devolver el siguiente mensaje:\n\n```\nUnable to retrieve socket path\n```\n\nLa variable de entorno SWAYSOCK se asigna después de iniciar Sway, por esta razón la solución es ejecutar swaymsg -t [message] en una terminal dentro de Sway.\n\n"
    },
    {
      "title": "Atajos de teclado y distribuciones de teclado",
      "level": 3,
      "content": "Por defecto si usa mas de una distribución de teclado, por ejemplo input * xkb_layout \"us,ru\", los atajos de teclado pueden fallar cuando cambia a una distribución de teclado secundaria.\n\nGracias a https://github.com/swaywm/sway/pull/3058, sólo necesita agregar la bandera --to-code a lineas con el comando bindsym como:\n\n```\nbindsym --to-code {\n  $mod+$left focus left\n  $mod+$down focus down\n  $mod+$up focus up\n  $mod+$right focus right\n}\n```\n\nAlternativamente puede crear la variable set $mybind bindsym --to-code y reemplazar todas las ocurrencias de bindsym con $mybind de esta forma: $mybind $mod+w accion\n\n"
    },
    {
      "title": "Aplicaciones en Java",
      "level": 3,
      "content": "Algunas aplicaciones desarrolladas en Java mostrarán una ventana en blanco cuando inician, por ejemplo cualquier editor de JetBrains como IntelliJ, CLion, or PyCharm. Para evitar esto, la aplicación debe de ser iniciada con la variable de entorno _JAVA_AWT_WM_NONREPARENTING asignada a 1.\n\nEn caso de iniciar la aplicación usando lanzadores de aplicaciones como rofi o dmenu se recomienda modificar el archivo de aplicación como se muestra en Desktop entries#Modify environment variables.\n\nAlgunos errores han sido corregidos en OpenJDK 11 y Sway 1.5. Sin embargo, ciertas aplicaciones requieren configuración adicional para funcionar correctamente con versiones más recientes de OpenJDK, por ejemplo, en el caso de Android Studio se debe asignar la variable STUDIO_JDK=/usr/lib/jvm/java-11-openjdk/. [4]\n\nEl JRE tiene una lista de gestores de ventanas conocidos, en la cual Sway no se encuentra. Si experimenta paneles grises, menús mal ubicados o ventanas con dimensiones incorrectas, consulte Java#Impersonate another window manager (en inglés).\n\n"
    },
    {
      "title": "Desplazamiento en el borde",
      "level": 3,
      "content": "Si usar la rueda de desplazamiento del ratón (scroll) en el borde de una aplicación provoca un fallo en sway, puede usar border none para el app_id correspondiente (por ejemplo, Firefox).\n\n"
    },
    {
      "title": "Program cannot open display",
      "level": 3,
      "content": "Si al iniciar un programa se muestra el mensaje de error \"cannot open display\", es posible que el programa funcione sólo bajo X11. Usted puede usar Xwayland para ejecutar programas de X11 en Wayland, consulte #Xwayland para más detalles.\n\n"
    },
    {
      "title": "El ratón no funciona en aplicaciones de WINE",
      "level": 3,
      "content": "Cuando ejecuta programas WINE espera que exista una pantalla principal sea asignada, esto puede causar errores (como clics que no son registrados) debido a que no existe el concepto de una pantalla principal en Wayland. Para evitar esto, agregue esta linea a su configuración de Sway para asignar una pantalla principal que sea usada por Xwayland mediante xrandr:\n\n```\n~/.config/sway/config\n```\n\n```\n...\nexec_always xrandr --output XWAYLAND0 --primary\n...\n```\n\nEl desplazamiento (offset) de la posición de pantalla debe de ser 0,0 para que esto funcione, debido a un bug [5] en sway.\n\nTome en cuenta que XWAYLAND0 (o cualquier nombre de pantalla de XWAYLAND) puede no representar su pantalla y sea susceptible a cambiar en diferentes sesiones. En su lugar, especifique la primer pantalla XWAYLAND usando la siguiente linea:\n\n```\nexec_always xrandr --output $(xrandr | grep -m 1 XWAYLAND | awk '{print $1;}') --primary\n```\n\nQuizá necesite modificar estas instrucciones a sus necesidades. Para identificar los nombres asignados a las pantallas use el comando xrandr sin argumentos.\n\n"
    },
    {
      "title": "Flickering en videojuegos con GPUs de NVIDIA",
      "level": 3,
      "content": "Aunque los controladores gráficos propietarios como NVIDIA no cuentan con soporte oficial, es posible usarlos incluyendo para videojuegos. Al hacer uso de ellos usted puede encontrar flickering (parpadeo) en la parte superior de la pantalla, que puede ser arreglado al reemplazar wlroots con wlroots-nvidiaAUR, o compilando manualmente su propia versión con el parche.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Proyecto en GitHub\n- Wiki de Sway mantenida por usuarios\n- Sitio web\n- Anuncio de lanzamiento de Sway 1.0\n\n"
    }
  ]
}