{
  "title": "Sxhkd (Español)",
  "url": "https://wiki.archlinux.org/title/Sxhkd_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2020-11-27** \n\nArtículos relacionados\n\n- Xbindkeys\n- Xmodmap\n\nsxhkd es un demonio simple de teclas de acceso directo para X, hecho por el desarrollador de bspwm, que reacciona a los eventos de entrada ejecutando comandos.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale sxhkd o sxhkd-gitAUR.\n\n"
    },
    {
      "title": "Archivo de configuración",
      "level": 3,
      "content": "El archivo de configuración por defecto de sxhkd es $XDG_CONFIG_HOME/sxhkd/sxhkdrc. Se puede especificar un archivo de configuración alternativo con la opción -c.\n\nCada linea del archivo de configuración se interpreta así:\n\n- Si empieza con #, es ignorada.\n- Si empieza con uno o mas espacios, es leída como un comando.\n- Si no, es interpretada como una tecla de acceso directo: cada nombre de tecla es separado por espacios y/o +.\n\nSintaxis general:\n\n```\n[MODIFICADOR + ]*[@|!]KEYSYM\n    COMANDO\n```\n\nDonde MODIFICADOR es uno de los siguientes nombres: super, hyper, meta, alt, control, ctrl, shift, mode_switch, lock, mod1, mod2, mod3, mod4, mod5. Si @ es añadida al inicio del keysym, el comando será ejecutado en los eventos de soltado de teclas, si no, en eventos de presionado de teclas. Si ! es añadido al inicio del keysym, el comando será ejecutado en los eventos de modificación de movimiento y debe contener dos especificaciones de conversión enteras las cuales serán remplazadas por las coordenadas x e y del puntero en relación a la ventana raíz referencial (las únicas teclas de botón validas para este tipo de teclas de acceso rápido son: button1, ..., button5). Los nombres KEYSYM son los que obtienes de xev.\n\nLas teclas de botón pueden ser definidas usando uno de los siguientes nombres keysym: button1, button2, button3, ..., button24. La tecla de acceso rápido puede contener una secuencia en la forma de {STRING_1,…,STRING_N}, en ese caso, el comando también debe contener una secuencia con N elementos: el emparejamiento de las dos secuencias generan N teclas de acceso rápido. Si el comando incluye llaves ({, }) ej. awk '{print $1}', escapelas con una barra inversa \\ ej. awk '\\{print $1\\}'. Además, las secuencias pueden contener rangos en la forma de A-Z donde A y Z son caracteres alfanuméricos.\n\nLo que es ejecutado actualmente es SHELL -c COMANDO, lo que significa que puede ocupar variables de entorno en el COMANDO. SHELL será el contenido de la primera variable de entorno definida en la siguiente lista: SXHKD_SHELL, SHELL. Si sxhkd recibe una señal SIGUSR1, va a volver a cargar su archivo de configuración.\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Después de configurarlo, usted puede querer hacer que empiece automáticamente.\n\n"
    },
    {
      "title": "Ejemplo",
      "level": 2,
      "content": "```\n$XDG_CONFIG_HOME/sxhkd/sxhkdrc\n```\n\n```\n# Al presionar el botón 1 del mouse, presionar Alt_R+F1\nbutton1\n    xte \"keydown Alt_R\" \"keydown F1\" \"keyup Alt_R\" \"keyup F1\"\n\n# Al presionar el botón 2 del mouse, esperar 3 segundos y después presionar Alt_R+F2\nbutton2\n    xte \"sleep 3\" \"keydown Alt_R\" \"keydown F2\" \"keyup Alt_R\" \"keyup F2\"\n```\n\nVuelva a cargar el servicio de sxhkd del usuario\n\n```\n$ systemctl --user restart sxhkd\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Pagina oficial - incluye opciones de configuración, combinaciones de ejemplo, y código fuente.\n- Hilo del foro de ArchLinux\n\n"
    }
  ]
}