{
  "title": "Systemd-homed (Português)",
  "url": "https://wiki.archlinux.org/title/Systemd-homed_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- fscrypt\n- Segurança\n- PAM\n- Usuários e grupos\n\nsystemd-homed é um serviço do systemd que fornece contas de usuário humanas e que são independentes da configuração atual do sistema.\n\nEle permite portabilidade ao poder mover todas as informações relacionadas ao usuário para um meio de armazenamento, opcionalmente criptografado, e cria um arquivo ~/.identity que contém informação com assinatura sobre o usuário, senha, quais grupos o usuário pertence, UID/GID e outros arquivos que estariam dispersas em vários arquivos no /.\n\nEsta abordagem permite não apenas portabilidade do diretório pessoal do usuário, mas também fornece segurança gerenciando a criptografia do /home ao se autenticar com o usuário e também ao suspender a máquina pois a pasta é bloqueada novamente.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "systemd-homed é parte do systemd e portanto, vem empacotado junto ao pacote.\n\nPara utilizar o systemd-homed, você deve habilitar e iniciar o systemd-homed.service.\n\n"
    },
    {
      "title": "homectl",
      "level": 3,
      "content": "homectl é o principal utilitário que você irá utilizar. Com ele, você pode criar, atualizar e inspecionar usuários; os diretórios pessoais destes; assim como os arquivos ~/.identity controlados pelo serviço systemd-homed(8).\n\nA maneira mais simples de utilizar o homectl é:\n\n```\n# homectl create nome-do-usuário\n```\n\nEste comando irá criar o nome específico do usuário, utilizando um UID livre, criará um grupo com o mesmo nome, e GID igual ao UID, definirá o usuário como membro deste grupo, e definirá o shell padrão do usuário como /bin/bash.\n\nO diretório pessoal do usuário é montado em /home/nome-do-usuário. O mecanismo de armazento é escolhido nesta ordem:\n\n1. luks se houver suporte;\n1. subvolume se não houver suporte a LUKS e houver suporte a subvolume;\n1. directory (diretório) se não houver suporte a nenhum dos dois mecanismos acima e outra opção não for escolhida.\n\nO caminho do arquivo de imagem do usuário quando utilizado com LUKS é /home/nome-do-usuário.home. O caminho do arquivo de imagem do usuário quando utilizado com diretório é /home/nome-do-usuário.homedir.\n\n"
    },
    {
      "title": "userdbctl",
      "level": 3,
      "content": "Uma ferramenta de consulta para inspecionar usuários, grupos e membros de grupos fornecidos tanto por mecanismos clássicos de unix quanto por systemd-homed.\n\n"
    },
    {
      "title": "Directory ou subvolume do Btrfs",
      "level": 3,
      "content": "Um diretório pessoal de usuário é armazenado em /home/usuário.homedir e montado em /home/usuário utilizando a opção --bind do mount(8) ao ser desbloqueado quando o usuário se autentica. Quanto este método é utilizado, nenhuma criptografia é fornecida. Para utilizar este mecanismo, utilize --storage=directory ou --storage=subvolume no comando homectl.\n\n"
    },
    {
      "title": "Diretório pessoal com fscrypt",
      "level": 3,
      "content": "Um diretório pessoal de usuário é armazenado da mesma forma que o método acima, mas uma criptografia de sistema de arquivos nativa é usada. Para usar este mecanismo, utilize --storage=fscrypt no comando homectl.\n\n"
    },
    {
      "title": "Servidor CIFS",
      "level": 3,
      "content": "O diretório é montado à partir de um servidor CIFS (Common Internet File System - Sistema de arquivos comum da internet) ao autenticar. Note que CIFS é implementado pelo protocolo Samba. Utilize --storage=cifs no comando homectl. A senha local do usuário é utilizada para se autenticar ao serviço de CIFS.\n\n"
    },
    {
      "title": "Diretório pessoal com LUKS",
      "level": 3,
      "content": "Um diretório pessoal do usuário é armazenado em um sistema de arquivos do Linux, dentro de um volume criptografado com LUKS (Linux Unified Key Setup - Configuração Unificada de Chaves do Linux) dentro de um arquivo loopback ou qualquer mídia removível. Para utilizar este mecanismo, use --storage=luks no comando homectl.\n\nSe estiver utilizando uma mídia removível, assegure-se que estas condições são atendidas:\n\n- A imagem contém uma tabela de particionamento em GPT. Por enquanto, deve apenas conter uma única partição, e esta partição deve ter o tipo UUID 773f91ef-66d4-49b5-bd83-d683bf40ad16. O rótulo da partição deve ser o nome do usuário.\n\n- Esta partição deve conter um volume LUKS2, cujo rótulo deve ser o nome do usuário. O volume LUKS2 deve conter o campo de token do tipo systemd-homed. Os dados em JSON deste token devem ter um campo de registro, contendo um texto com dados codificados em base64. Este arquivo é o registro de usuário em JSON, com a mesma serialização que ~/.identity, só que criptografado. Os dados em JSON deste token devem também ter um campo iv (initialization vector - vetor de inicialização), que contém um binário de vetor de inicialização codificado em base64 para a criptografia. A criptografia utilizada é a mesma que o próprio volume em LUKS2 usa, desbloqueada pela mesma key (chave) de volume, mas baseada no seu próprio IV.\n\n- Dentro deste volume de LUKS2 deve haver um sistema de arquivos Linux, sendo um dos seguintes: EXT4, BTRFS e XFS. O rótulo do sistema de arquivos deve ser o nome do usuário.\n\n- Este sistema de arquivos deve conter um único diretório, nomeado a partir do usuário, este diretório se tornará o diretório pessoal do usuário quando ativado. Ele contém uma segunda cópia do registro no arquivo ~/.identity, como nos outros mecanismos de armazenamento.\n\n"
    },
    {
      "title": "Habilitando módulos do PAM",
      "level": 2,
      "content": "Já que não existem registros de usuários do tipo systemd-homed em bancos de dados NSS do UNIX (como /etc/passwd, /etc/shadow e /etc/group), o módulo do PAM pam_unix.so não irá autorizar estes usuários sequer a autenticação para entrar no sistema. Portanto será necessário usar um módulo pam_systemd_home.so. Enquanto o usuário do systemd-homed estiver autenticado, o PAM sintetizará os registros NSS para ele.\n\nApenas um dos dois módulos irá permitir a autorização, então o PAM deve ser instruído para desconsiderar a falha do outro. Para isto ocorrer, é necessário um valor de controle chamado sufficient. porém, o valor de controle deste módulo, ao ocorrer com sucesso, fará com que o resto da pilha (stack) seja ignorada. Uma maneira de resolver isto, é através de uma subpilha (substack):\n\n```\n/etc/pam.d/nss-auth\n```\n\n```\n#%PAM-1.0\n\nauth     sufficient pam_unix.so try_first_pass nullok\nauth     sufficient pam_systemd_home.so\nauth     required   pam_deny.so\n\naccount  sufficient pam_unix.so\naccount  sufficient pam_systemd_home.so\naccount  required   pam_deny.so\n\npassword sufficient pam_unix.so try_first_pass nullok sha512 shadow\npassword sufficient pam_systemd_home.so\npassword required   pam_deny.so\n```\n\nSubstitua pam_unix.so no arquivo /etc/pam.d/system-auth, com a configuração criada utilizando o valor de controle substack:\n\n```\n/etc/pam.d/system-auth\n```\n\n```\n#%PAM-1.0\n\nauth      substack   nss-auth\nauth      optional   pam_permit.so\nauth      required   pam_env.so\n\naccount   substack   nss-auth\naccount   optional   pam_permit.so\naccount   required   pam_time.so\n\npassword  substack   nss-auth\npassword  optional   pam_permit.so\n\nsession   required  pam_limits.so\nsession   optional  pam_systemd_home.so\nsession   required  pam_unix.so\nsession   optional  pam_permit.so\n```\n\n"
    },
    {
      "title": "Propriedades de registro de usuário",
      "level": 2,
      "content": "Consulte o registro completo de usuário com:\n\n```\n# homectl inspect nome-do-usuário\n```\n\nModifique ou acrescente no registro completo de usuário com:\n\n```\n# homectl update nome-do-usuário --propriedade=VALOR\n```\n\nÉ possível modificar e acrescentar várias propriedades:\n\n- --timezone=FUSO-HORÁRIO\n- --language=IDIOMA\n- --member-of=GRUPO1,GRUPO2,GRUPO-N\n- --real-name=NOME\n- --email-address=EMAIL\n- --ssh-authorized-keys=LINHA_COM_CHAVE_AUTORIZADA ou @/arquivo/com/chaves\n\nConsulte homectl(1) para mais opções.\n\n"
    },
    {
      "title": "Criação",
      "level": 3,
      "content": "Criação simples de um usuário com criptografia LUKS:\n\n```\n# homectl create nome-do-usuário --storage=luks\n```\n\nCriação simples de um usuário com criptografia fscrypt:\n\n```\n# homectl create nome-do-usuário --storage=fscrypt\n```\n\nCriação simples de um usuário com UID, shell e grupos específicos:\n\n```\n# homectl create nome-do-usuário --shell=/bin/zsh --uid=1001 -G wheel,storage,games\n```\n\nOutras opções podem ser encontradas em homectl(1) § USER RECORD PROPERTIES.\n\n"
    },
    {
      "title": "Deleção",
      "level": 3,
      "content": "É possível fazer a deleção de vários usuários ao mesmo tempo, como root, você pode rodar o comando abaixo que irá deletar os 2 usuários de uma única vez:\n\n```\n# homectl remove nome-do-usuário1 nome-do-usuário2\n```\n\n"
    },
    {
      "title": "Desbloquear remotamente através de SSH",
      "level": 2,
      "content": "Para permitir que o serviço de SSH dependa de registros de usuários contendo as chaves autorizadas, o arquivo sshd_config precisa conter as seguintes linhas\n\n```\nAuthorizedKeysCommand /usr/bin/userdbctl ssh-authorized-keys %u\nAuthorizedKeysCommandUser root\n```\n\nVocê pode receber a mensagem de erro Home of user nome-do-usuario is currently not active, please log in locally first., neste caso, você precisa ativar o diretório pessoal do usuário com o comando homectl activate nome-do-usuario.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- https://systemd.io/HOME_DIRECTORY/\n\n"
    }
  ]
}