{
  "title": "Systemd (Español)/Journal (Español)",
  "url": "https://wiki.archlinux.org/title/Systemd_(Espa%C3%B1ol)/Journal_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-09-20** \n\nsystemd tiene un sistema de registro («log») propio llamado journal. Por tanto, ya no es necesario hacer funcionar el demonio syslog. Para leer el registro, utilice:\n\n```\n# journalctl\n```\n\nEn Arch Linux, el directorio /var/log/journal/ es parte del paquete systemd, y journal (cuando Storage= está definido a auto en /etc/systemd/journald.conf) escribirá en /var/log/journal/. Si usted o algún programa eliminan ese directorio, systemd no lo volverá a crear automáticamente y en su lugar escribirá sus registros en /run/systemd/journal de una manera no persistente. Sin embargo, la carpeta se volverá a crear cuando establezca Storage=persistent y reinicie systemd-journald.service (o reinicie el equipo).\n\nEl journald de systemd clasifica los mensajes por #Nivel de prioridad y #Nivel del recurso. La clasificación del registro corresponde al protocolo clásico de Syslog (RFC 5424).\n\n"
    },
    {
      "title": "Nivel de prioridad",
      "level": 2,
      "content": "Se utiliza el código de severidad de syslog (en systemd llamado prioridad) para marcar la importancia de un mensaje RFC 5424 Section 6.2.1.\n\nTable content:\nValor | Severidad | Palabra clave | Descripción | Ejemplos\n0 | Emergencia | emerg | El sistema está inutilizable | Bug importante del kernel, núcleo de systemd volcado.Este nivel no debe ser utilizado por las aplicaciones.\n1 | Alerta | alert | Debe corregirse inmediatamente | El subsistema vital parece no funcionar. Pérdida de datos. kernel: BUG: unable to handle kernel paging request at ffffc90403238ffc.\n2 | Crítico | crit | Condiciones criticas | Quiebra, volcado del núcleo. Tales como:systemd-coredump[25319]: Process 25310 (plugin-containe) of user 1000 dumped core Error en la aplicación principal del sistema, como X11.\n3 | Error | err | Condiciones de error | Se informa de error no grave:kernel: usb 1-3: 3:1: cannot get freq at ep 0x84,systemd[1]: Failed unmounting /var.,libvirtd[1720]: internal error: Failed to initialize a valid firewall backend).\n4 | Advertencia | warning | Puede indicar que se producirá un error si no se toman medidas. | Un sistema de archivos no root tiene solo 1GB libre.org.freedesktop. Notifications[1860]: (process:5999): Gtk-WARNING **: Locale not supported by C library. Using the fallback 'C' locale.\n5 | Aviso | notice | Eventos que son inusuales, pero que no presuponen un error. | systemd[1]: var.mount: Directory /var to mount over is not empty, mounting anyway. gcr-prompter[4997]: Gtk: GtkDialog mapped without a transient parent. This is discouraged.\n6 | Informativo | info | Mensajes de operaciones normales que no requieren ninguna acción. | lvm[585]: 7 logical volume(s) in volume group \"archvg\" now active.\n7 | Depuración errores | debug | Información útil para los desarrolladores para depurar errores de la aplicación. | kdeinit5[1900]: powerdevil: Scheduling inhibition from \":1.14\" \"firefox\" with cookie 13 and reason \"screen\".\n\nSi no puede encontrar un mensaje en el nivel de prioridad esperado, puede buscar también un par de niveles por encima y por debajo: estas reglas son recomendaciones y el desarrollador de la aplicación afectada puede tener una percepción diferente de la importancia del problema con respecto a la suya.\n\n"
    },
    {
      "title": "Nivel del recurso",
      "level": 2,
      "content": "Se utiliza un código de recursos de syslog para especificar el tipo de programa que está registrando el mensaje RFC 5424 Section 6.2.1.\n\nTable content:\nCódigo del recurso | Palabra clave | Descripción | Información\n0 | kern | mensajes del kernel\n1 | user | mensajes a nivel de usuario\n2 | mail | sistema de correo | El arcaico POSIX todavía se admite y se usa a veces (para más información mail(1))\n3 | daemon | demonios del sistema | Todos los demonios, incluyendo systemd y sus subsistemas\n4 | auth | mensajes de seguridad/autorización | También tenga en cuenta los diferentes recursos del código 10\n5 | syslog | mensajes generados internamente por syslogd | Para las implementaciones de syslogd (no utilizadas por systemd, consulte el código 3)\n6 | lpr | impresora de línea]] (subsistema arcaico)\n7 | news | subsistema de noticias de la red (subsistema arcaico)\n8 | uucp | subsistema UUCP (subsistema arcaico)\n9 |  | demonio para el reloj del sistema | systemd-timesyncd\n10 | authpriv | mensajes de seguridad/autorización | También tenga en cuenta los diferentes recursos del código 4\n11 | ftp | subsistema FTP\n12 | - | subsistema NTP\n13 | - | auditoría de registro\n14 | - | alerta de registro\n15 | cron | demonio de programación\n16 | local0 | uso local 0 (local0)\n17 | local1 | uso local 1 (local1)\n18 | local2 | uso local 2 (local2)\n19 | local3 | uso local 3 (local3)\n20 | local4 | uso local 4 (local4)\n21 | local5 | uso local 5 (local5)\n22 | local6 | uso local 6 (local6)\n23 | local7 | uso local 7 (local7)\n\nPor lo tanto, son códigos útiles para observar: 0,1,3,4,9,10,15.\n\n"
    },
    {
      "title": "Filtrar la salida",
      "level": 2,
      "content": "journalctl le permite filtrar los resultados por campos específicos. Tenga en cuenta que si hay muchos mensajes para mostrar o el filtrado que hay que hacer abarca mucho tiempo, la salida de esta orden puede retrasarse durante bastante tiempo.\n\nEjemplos:\n\n- Mostrar todos los mensajes del arranque: # journalctl -b Sin embargo, a veces a uno le interesan no los mensajes actuales, sino los mensajes desde el arranque anterior (por ejemplo, si ocurrió un fallo del sistema irrecuperable). Esto es posible pasando el parámetro -b: journalctl -b -0 muestra los mensajes del arranque actual, journalctl -b -1 muestra los mensajes del arranque anterior, journalctl -b -2 muestra los mensajes desde los dos últimos arranques y así sucesivamente. Véase journalctl(1) para una descripción completa, dado que los argumentos que se pueden pasar a la orden hacen que el filtrado pueda ser mucho más potente.\n- Mostrar todos los mensajes de fecha (y hora opcional): # journalctl --since=\"2012-10-30 18:17:16\"\n- Mostrar todos los mensajes desde hace 20 minutos: # journalctl --since \"20 min ago\"\n- Seguir los mensajes nuevos: # journalctl -f\n- Mostrar todos los mensajes por un ejecutable específico: # journalctl /usr/lib/systemd/systemd\n- Mostrar todos los mensajes para un proceso específico: # journalctl _PID=1\n- Mostrar todos los mensajes por una unidad específica: # journalctl -u man-db.service\n- Mostrar el búfer del kernel # journalctl -k\n- Mostrar solo mensajes de error, críticos y de prioridad de alerta # journalctl -p err..alert También se pueden usar números, journalctl -p 3..1. Si se utiliza un solo número/palabra clave, journalctl -p 3 —también se incluyen todos los niveles de prioridad más altos—.\n- Mostrar el equivalente de auth.log para filtrar en el código de instalación de syslog: # journalctl SYSLOG_FACILITY=10\n- Si el directorio de journal (de manera predeterminada, ubicado en /var/log/journal) contiene una gran cantidad de datos de registro, entonces journalctl puede tardar varios minutos en filtrar la salida. Puede acelerarlo significativamente usando la opción --file para forzar a journalctl a buscar solo en el journal más reciente: # journalctl --file /var/log/journal/*/system.journal -f\n\n```\n# journalctl -b\n```\n\n```\n# journalctl --since=\"2012-10-30 18:17:16\"\n```\n\n```\n# journalctl --since \"20 min ago\"\n```\n\n```\n# journalctl -f\n```\n\n```\n# journalctl /usr/lib/systemd/systemd\n```\n\n```\n# journalctl _PID=1\n```\n\n```\n# journalctl -u man-db.service\n```\n\n```\n# journalctl -k\n```\n\n```\n# journalctl -p err..alert\n```\n\n```\n# journalctl SYSLOG_FACILITY=10\n```\n\n```\n# journalctl --file /var/log/journal/*/system.journal -f\n```\n\nVéase journalctl(1), systemd.journal-fields(7) o esta entrada de blog de Lennert para obtener más detalles.\n\nNote: Al omitir la opción S, la salida se ajustará en lugar de truncarla. Por ejemplo, inicie journalctl de la siguiente manera:\n\nAl omitir la opción S, la salida se ajustará en lugar de truncarla. Por ejemplo, inicie journalctl de la siguiente manera:\n\n```\n$ SYSTEMD_LESS=FRXMK journalctl\n```\n\n```\n$ strings /mnt/arch/var/log/journal/af4967d77fba44c6b093d0e9862f6ddd/system.journal | grep -i message\n```\n\n"
    },
    {
      "title": "Límite del tamaño de journal",
      "level": 2,
      "content": "Si journal se ha creado como permanente (no volátil), el límite de su tamaño se establece con un valor predeterminado correspondiente al 10% del tamaño del sistema de archivos pero limitado a 4 GiB. Por ejemplo, con /var/log/journal alojado en una partición raíz de 20 GiB, esto permitiría almacenar hasta 2 GiB de datos en journal. En una de 50 GiB, tendría un máximo de 4 GiB.\n\nEl tamaño máximo del journal permanente puede ser controlado descomentando y modificando la correspondiente línea:\n\n```\n/etc/systemd/journald.conf\n```\n\n```\nSystemMaxUse=50M\n```\n\nTambién es posible utilizar el mecanismo de sobrescribir la configuración con fragmentos insertados en lugar de editar el archivo de configuración global. En este caso, no olvide colocar el reemplazo debajo del encabezado de [Journal]:\n\n```\n/etc/systemd/journald.conf.d/00-journal-size.conf\n```\n\n```\n[Journal]\nSystemMaxUse=50M\n```\n\nReinicie el servicio systemd-journald.service después de cambiar esta configuración para aplicar inmediatamente el nuevo límite.\n\nVea journald.conf(5) para más información.\n\n"
    },
    {
      "title": "Limpiar manualmente archivos journal",
      "level": 2,
      "content": "Los archivos journal se pueden eliminar globalmente de /var/log/journal/ utilizando por ejemplo rm, o se pueden recortar de acuerdo con varios criterios usando journalctl. Ejemplos:\n\n- Eliminar los archivos journal archivados hasta que el espacio en disco que utilizan esté por debajo de 100M: # journalctl --vacuum-size=100M\n- Hacer que todos los archivos journal no contengan datos de más de 2 semanas. # journalctl --vacuum-time=2weeks\n\n```\n# journalctl --vacuum-size=100M\n```\n\n```\n# journalctl --vacuum-time=2weeks\n```\n\nVea journalctl(1) para más información.\n\n"
    },
    {
      "title": "Journald coexistiendo con syslog",
      "level": 2,
      "content": "La compatibilidad con una implementación clásica, syslog, no reconocida por journald, se puede proporcionar al permitir que systemd reenvíe todos los mensajes a través del socket /run/systemd/journal/syslog. Para hacer que el demonio syslog funcione con journal, debe vincularse a este socket en lugar de a /dev/log (anuncio oficial).\n\nEl journald.conf predeterminado para reenviar al socket es ForwardToSyslog=no para evitar la sobrecarga del sistema, porque rsyslog o syslog-ng tiran de los mensajes de journal por sí mismo.\n\nVea Syslog-ng#Overview y Syslog-ng#syslog-ng and systemd journal, o rsyslog respectivamente, para obtener detalles sobre la configuración.\n\n"
    },
    {
      "title": "Reenviar journald a /dev/tty12",
      "level": 2,
      "content": "Cree un directorio inclusivo /etc/systemd/journald.conf.d y cree un archivo fw-tty12.conf en él:\n\n```\n/etc/systemd/journald.conf.d/fw-tty12.conf\n```\n\n```\n[Journal]\nForwardToConsole=yes\nTTYPath=/dev/tty12\nMaxLevelConsole=info\n```\n\nDepués reinicie systemd-journald.service.\n\n"
    },
    {
      "title": "Especificar un journal diferente para visulizar",
      "level": 2,
      "content": "Puede ser necesario verificar los registros de un sistema inoperativo, arrancado desde un sistema live para recuperar un sistema operativo. En tal caso, se puede montar el disco, por ejemplo en /mnt, y especificar la ruta de journal a través de -D/--directory, así:\n\n```\n$ journalctl -D /mnt/var/log/journal -xe\n```\n\n"
    }
  ]
}