{
  "title": "System backup (Español)",
  "url": "https://wiki.archlinux.org/title/System_backup_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-12-16** \n\nArtículos relacionados\n\n- Synchronization and backup programs\n- System maintenance#Backup\n- Disk cloning\n- Migrate installation to new hardware\n- File recovery\n\nEs importante hacer regularmente una copia de seguridad de los datos del sistema y del usuario, almacenados, por ejemplo, en /etc, /home, /var y, para las instalaciones del servidor, también en /srv.\n\n"
    },
    {
      "title": "Utilizar instantáneas de Btrfs",
      "level": 2,
      "content": "Véanse Btrfs (Español)#Instantáneas y Snapper.\n\n"
    },
    {
      "title": "Utilizar instantáneas de LVM",
      "level": 2,
      "content": "Véanse LVM (Español)#Instantáneas/Snapshots y Create root filesystem snapshots with LVM.\n\n"
    },
    {
      "title": "Utilizar rsync",
      "level": 2,
      "content": "Véase rsync#As a backup utility.\n\n"
    },
    {
      "title": "Utilizar tar",
      "level": 2,
      "content": "Véase Full system backup with tar.\n\n"
    },
    {
      "title": "Copia de seguridad arrancable",
      "level": 2,
      "content": "Tener una copia de seguridad arrancable puede ser útil en caso de que el sistema de archivos se corrompa o si una actualización rompe el sistema. La copia de seguridad también se puede usar como un banco de pruebas para realizar actualizaciones, con el repositorio testing activado, etc. Si transfirió el sistema a una partición o unidad diferente y desea iniciarlo, el proceso es tan simple como actualizar el archivo /etc/fstab para la copia de seguridad y el archivo de configuración para el gestor de arranque.\n\nEsta sección asume que realizó una copia de seguridad del sistema en otra unidad o partición, que su gestor de arranque actual funciona bien y que igualmente desea arrancar desde la copia de seguridad.\n\n"
    },
    {
      "title": "Actualizar el archivo fstab",
      "level": 3,
      "content": "Sin reiniciar, modifique fstab para la copia de seguridad comentando o eliminando las entradas existentes. Agregue una entrada para la partición que contiene la copia de seguridad como en el ejemplo que sigue:\n\n```\n/dev/sdaX    /             ext4      defaults                 0   1\n```\n\nRecuerde utilizar el nombre del dispositivo y el tipo de sistema de archivos adecuados.\n\n"
    },
    {
      "title": "Actualizar el archivo de configuración del gestor de arranque",
      "level": 3,
      "content": "Para Syslinux (Español), todo lo que necesita hacer es duplicar la entrada actual, con la excepción de que apuntará a una unidad o partición diferente.\n\nPara GRUB (Español), es recomendable generar el archivo de configuración principal automáticamente. Si desea instalar todos los archivos de GRUB en otro lugar que no sea /boot, como por ejemplo /mnt/newroot/boot, utilice el parámetro --boot-directory.\n\nVerifique también la nueva entrada del menú en /boot/grub/grub.cfg. Asegúrese de que el UUID coincida con el de la nueva partición, de lo contrario aún podría iniciar el sistema anterior. Encuentre el UUID de una partición con la orden lsblk:\n\n```\n$ lsblk -no NAME,UUID /dev/sdb3\n```\n\ndonde debe sustituir «/dev/sdb3» por la partición deseada. Para listar los UUID de las particiones que GRUB cree que puede iniciar, utilice la orden grep:\n\n```\n# grep UUID= /boot/grub/grub.cfg\n```\n\n"
    },
    {
      "title": "Primer arranque",
      "level": 3,
      "content": "Reinicie el equipo y seleccione la entrada adecuada en el gestor de arranque. Esto cargará el sistema por primera vez. Deberían detectarse todos los periféricos y rellenarse las carpetas vacías en /.\n\nAhora puede reeditar /etc/fstab para agregar las particiones y los puntos de montaje eliminados anteriormente.\n\n"
    }
  ]
}