{
  "title": "Systemd FAQ (Italiano)",
  "url": "https://wiki.archlinux.org/title/Systemd_FAQ_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- systemd\n- systemd/User\n\n"
    },
    {
      "title": "FAQ",
      "level": 2,
      "content": "For an up-to-date list of known issues, look at the upstream TODO.\n\n"
    },
    {
      "title": "Why do I get log messages on my console?",
      "level": 3,
      "content": "You must set the kernel loglevel yourself. Historically, /etc/rc.sysinit did this for us and set dmesg's loglevel to 3, which was a reasonably quiet loglevel. Either add loglevel=3 or quiet to your kernel parameters.\n\n"
    },
    {
      "title": "How do I change the default number of gettys?",
      "level": 3,
      "content": "Currently, only one getty is launched by default. If you switch to another TTY, a getty will be launched there (socket-activation style). In other words, Ctl+Alt+F2 will launch a new getty on tty2.\n\nBy default, the number of auto-activated gettys is capped at six. Thus F7 through F12 will not launch a getty.\n\nIf you want to change this behavior, then edit /etc/systemd/logind.conf and change the value of NAutoVTs. If you want all Fx keys to start a getty, increase the value of NAutoVTs to 12. If you are forwarding journald to tty12, increase the value of NAutoVTs to 11 (thus leaving tty12 free).\n\nYou can also pre-activate gettys which will be running from boot.\n\nTo add another pre-activated getty, enable and start getty@ttyX.service.\n\nTo remove a getty, disable and stop the relevant getty@ttyX.service.\n\nsystemd does not use the /etc/inittab file.\n\n"
    },
    {
      "title": "How do I get more verbose output during boot?",
      "level": 3,
      "content": "If you see no output at all in console after the initram message, this means you have the quiet parameter in your kernel line. It is best to remove it, at least the first time you boot with systemd, to see if everything is ok. Then, you will see a list [ OK ] in green or [ FAILED ] in red.\n\nAny messages are logged to the system log and if you want to find out about the status of your system, use systemctl or look at the boot/system log with journalctl.\n\n"
    },
    {
      "title": "How do I avoid clearing the console after boot?",
      "level": 3,
      "content": "Create a directory called /etc/systemd/system/getty@.service.d and place nodisallocate.conf in there to override the TTYVTDisallocate option to no.\n\n```\n/etc/systemd/system/getty@.service.d/nodisallocate.conf\n```\n\n```\n[Service]\nTTYVTDisallocate=no\n```\n\n"
    },
    {
      "title": "What kernel options are required for systemd?",
      "level": 3,
      "content": "Kernels prior to 3.0 are unsupported.\n\nIf you use a custom kernel, you will need to make sure that systemd's options are selected.\n\nIf you are compiling a new kernel for use with an installed version of systemd, the required and recommended options are listed in the systemd README file /usr/share/doc/systemd/README.\n\nIf you are preparing to install a new version of systemd and are running a custom kernel, the most recent version of the file can be found in the systemd GitHub repository.\n\n"
    },
    {
      "title": "What other units does a unit depend on?",
      "level": 3,
      "content": "For example, if you want to figure out which services a target like multi-user.target pulls in, use something like this:\n\n```\n$ systemctl show -p \"Wants\" multi-user.target\n```\n\n```\nWants=rc-local.service avahi-daemon.service rpcbind.service NetworkManager.service acpid.service dbus.service atd.service crond.service auditd.service ntpd.service udisks.service bluetooth.service org.cups.cupsd.service wpa_supplicant.service getty.target modem-manager.service portreserve.service abrtd.service yum-updatesd.service upowerd.service test-first.service pcscd.service rsyslog.service haldaemon.service remote-fs.target plymouth-quit.service systemd-update-utmp-runlevel.service sendmail.service lvm2-monitor.service cpuspeed.service udev-post.service mdmonitor.service iscsid.service livesys.service livesys-late.service irqbalance.service iscsi.service\n```\n\nInstead of Wants you might also try WantedBy, Requires, RequiredBy, Conflicts, ConflictedBy, Before, After for the respective types of dependencies and their inverse.\n\n"
    },
    {
      "title": "My computer shuts down, but the power stays on",
      "level": 3,
      "content": "Use systemctl poweroff instead of systemctl halt.\n\n"
    },
    {
      "title": "How can I make a script start during the boot process?",
      "level": 3,
      "content": "Create a new file as /etc/systemd/system/myscript.service and add the following contents:\n\n```\n/etc/systemd/system/myscript.service\n```\n\n```\n[Unit]\nDescription=My script\n \n[Service]\nExecStart=/usr/bin/my-script\n \n[Install]\nWantedBy=multi-user.target\n```\n\nThis example assumes you want your script to start up when the target multi-user is launched. Make sure the script is executable.\n\nEnable myscript.service to start the service at boot.\n\nNote: **not** \n\n"
    },
    {
      "title": "Service unit active state is \"active (exited)\" in green",
      "level": 3,
      "content": "This is the expected behaviour for oneshot services that also use RemainAfterExit=yes. See systemd.service(5) ยง OPTIONS for more information. Some examples of oneshot services that behave this way are systemd-user-sessions.services, nftables.service, and iptables.service.\n\n"
    },
    {
      "title": "Failure to enable unit due to preexisting symlink",
      "level": 3,
      "content": "You may encounter the following error when attempting to enable a unit:\n\n```\nFailed to enable unit: File /etc/systemd/system/symlink already exists and is a symlink to file.\n```\n\nThis can occur when the symlink created by enabling a unit already exists in /etc/systemd/system/. This typically happens when switching from one display manager to another one (for instance GDM to SDDM, which can be enabled with gdm.service and sddm.service, respectively) and the corresponding symlink /etc/systemd/system/display-manager.service already exists.\n\nTo solve this problem, either first disable the relevant display manager before enabling the new one, or use the -f/--force option when enabling the new one to overwrite any existing conflicting symlinks (per systemctl(1) ยง OPTIONS).\n\n"
    }
  ]
}