{
  "title": "System maintenance (Español)",
  "url": "https://wiki.archlinux.org/title/System_maintenance_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-10-14** \n\nArtículos relacionados\n\n- General recommendations (Español)\n\nPara el correcto funcionamiento de Arch durante un cierto periodo de tiempo es necesario el mantenimiento regular del sistema. El mantenimiento oportuno es una práctica a la que muchos usuarios se acostumbran.\n\n"
    },
    {
      "title": "Servicios systemd fallidos",
      "level": 3,
      "content": "Compruebe si los servicios systemd se encuentran en un estado fallido:\n\n```\n$ systemctl --failed\n```\n\nConsulte Systemd (Español)#Analizar el estado del sistema para obtener más información.\n\n"
    },
    {
      "title": "Archivos de registro",
      "level": 3,
      "content": "Busque errores en los archivos de registro ubicados en /var/log, así como errores de alta prioridad en el journal de systemd:\n\n```\n# journalctl -p 3 -xb\n```\n\nConsulte Systemd (Español)/Journal (Español) para obtener más información. Consulte Xorg#Troubleshooting para obtener información sobre dónde y cómo Xorg (Español) registra errores.\n\n"
    },
    {
      "title": "Realizar copias de respaldo",
      "level": 2,
      "content": "Cree copias de seguridad de datos importantes a intervalos regulares. Consulte Synchronization and backup programs para encontrar muchas aplicaciones alternativas que pueden adaptarse mejor a su caso. Consulte Category:System recovery (Español) para otros artículos de interés.\n\nLas copias de seguridad pueden automatizarse con systemd (Español)/Timers (Español).\n\n"
    },
    {
      "title": "Archivos de configuración",
      "level": 3,
      "content": "Antes de editar cualquier archivo de configuración, cree una copia de seguridad para que pueda volver a una versión anterior en caso de problemas. Editores como vim (Español) y emacs (Español) pueden hacer esto automáticamente, así como herramientas como etckeeper (Español) que mantienen el directorio /etc en un sistema de control de versiones (VCS); vea el artículo Dotfiles (Español)#Rastrear dotfiles directamente con Git para más información.\n\n"
    },
    {
      "title": "Lista de paquetes instalados",
      "level": 3,
      "content": "Mantenga una lista de todos los paquetes instalados, de modo que si una re-instalación completa es inevitable, sea más fácil volver a crear el entorno original.\n\nConsulte los consejos de pacman (Español)/Tips and tricks (Español)#Listar paquetes instalados para obtener más detalles.\n\n"
    },
    {
      "title": "Base de datos de pacman",
      "level": 3,
      "content": "Consulte las sugerencias de pacman (Español)/Tips and tricks (Español)#Realizar copia de seguridad de la base de datos de pacman.\n\n"
    },
    {
      "title": "Encabezados LUKS",
      "level": 3,
      "content": "Puede tener sentido revisar y sincronizar periódicamente las copias de seguridad de encabezados de partición encriptada LUKS, especialmente si se han revocado frases de acceso. Véase dm-crypt (Español)/Device encryption (Español)#Copia de seguridad y restauración.\n\n"
    },
    {
      "title": "Datos del sistema y del usuario",
      "level": 3,
      "content": "Consulte System backup (Español).\n\n"
    },
    {
      "title": "Actualizar el sistema",
      "level": 2,
      "content": "Se recomienda realizar actualizaciones completas del sistema con cierta regularidad como se indica en Pacman (Español)#Actualizar paquetes, para disfrutar de las últimas correcciones de errores y actualizaciones de seguridad, y también para evitar tener que lidiar con demasiadas actualizaciones de paquetes que requieren intervención manual de una sola vez. Cuando se solicita apoyo de la comunidad, generalmente se asumirá que el sistema está actualizado.\n\nAsegúrese de tener un medio de instalación de Arch Linux en otro CD/USB «live» para que pueda rescatar fácilmente su sistema si hay algún problema después de actualizarlo. Si está ejecutando Arch en un entorno de producción o no puede permitirse estar un tiempo inactivo por cualquier razón, pruebe primero los cambios en los archivos de configuración, así como las actualizaciones de los paquetes de software, en un sistema duplicado no crítico. Luego, si no surgen problemas, implemente los cambios en el sistema de producción.\n\nSi el sistema tiene paquetes de AUR (Español), actualice cuidadosamente todos ellos.\n\nPacman es una potente herramienta de gestión de paquetes, pero no intenta manejar todos los casos posibles. Los usuarios deben ser vigilantes y asumir la responsabilidad de mantener su propio sistema.\n\n"
    },
    {
      "title": "Leer antes de actualizar el sistema",
      "level": 3,
      "content": "Antes de actualizar, se espera que los usuarios visiten la página principal de Arch Linux para ver las últimas noticias o, alternativamente, suscríbase al RSS feed, las listas de correo de arch-announce o seguir @archlinux en Twitter (actualmente inactiva). Cuando las actualizaciones requieren intervención del usuario fuera de lo común (más de lo que se puede manejar simplemente siguiendo las instrucciones dadas por pacman), se realizará una publicación de noticias apropiada.\n\nAntes de actualizar un software fundamental (como el Kernel (Español), xorg (Español), systemd (Español) o glibc) a una nueva versión, revise el forum apropiado para ver si ha habido problemas informados.\n\nLos usuarios también deben ser conscientes de que la actualización de paquetes puede plantear problemas inesperados que podrían requerir una intervención inmediata; por lo tanto, se desaconseja actualizar un sistema estable poco antes de que sea necesario para llevar a cabo una tarea importante. Es aconsejable antes de actualizar el sistema, esperar cuando se tenga tiempo suficiente para poder hacer frente a posibles problemas posteriores a la actualización.\n\n"
    },
    {
      "title": "Evitar ciertas órdenes de pacman",
      "level": 3,
      "content": "Evite realizar actualizaciones parciales. En otras palabras, nunca ejecute pacman -Sy; en su lugar, siempre use pacman -Syu.\n\nEn general, evite usar la opción --overwrite con pacman. La opción --overwrite toma un argumento que contiene un glob.Cuando se utiliza, pacman omitirá las comprobaciones de conflictos de archivos para archivos que coincidan con el glob. En un sistema mantenido adecuadamente, solo debe usarse cuando los desarrolladores de Arch lo recomienden explícitamente. Consulte la sección #Leer antes de actualizar el sistema.\n\nEvite usar la opción -d con pacman. pacman -Rdd paquete esta orden omite las verificaciones de dependencia durante la eliminación del paquete. Como resultado, un paquete que proporciona una dependencia crítica podría ser eliminado, resultando en una falla del sistema.\n\n"
    },
    {
      "title": "Las actualizaciones parciales no son compatibles",
      "level": 3,
      "content": "Arch Linux es una distribución rolling release. Esto significa que cuando las nuevas versiones de las bibliotecas se envían a los repositorios, los desarrolladores y usuarios de confianza reconstruyen todos los paquetes de los repositorios que necesitan ser reconstruidos con esas bibliotecas. Por ejemplo, si dos paquetes dependen de la misma biblioteca, actualizar solo un paquete también podría actualizar la biblioteca (como dependencia), lo que podría romper el otro paquete que depende de una versión anterior de la biblioteca.\n\nEs por eso que las actualizaciones parciales no son compatibles. No utilice pacman -Sy paquete o cualquier equivalente, como pacman -Sy seguido de pacman -S paquete. Actualice siempre (con pacman -Syu) antes de instalar un paquete. Tenga mucho cuidado al usar IgnorePkg e IgnoreGroup por la misma razón. Si el sistema tiene paquetes instalados localmente (como paquetes AUR (Español)), los usuarios tendrán que reconstruirlos cuando sus dependencias reciban una advertencia soname (bumps).\n\nSi se ha creado un escenario de actualización parcial y se rompen los binarios porque no pueden encontrar las bibliotecas a las que están vinculadas, no «solucione» el problema simplemente mediante enlaces simbólicos. Las bibliotecas reciben advertencias soname(bumps) cuando no son compatibles con versiones anteriores. Simplemente la orden pacman -Syu conectada a un servidor de réplica correctamente sincronizado, solucionará el problema mientras pacman no esté roto.\n\nEl script de bash checkupdates, incluido con el paquete pacman-contrib, proporciona una forma segura de comprobar las actualizaciones de los paquetes instalados sin ejecutar una actualización del sistema al mismo tiempo.\n\n"
    },
    {
      "title": "Avisos sobre las alertas durante una actualización",
      "level": 3,
      "content": "Al actualizar el sistema, asegúrese de prestar atención a los avisos de alerta proporcionados por pacman (Español). Si es requerida alguna acción adicional al usuario, encárguese de ello cuidadosamente de inmediato. Si una alerta pacman le resulta confusa y/o desconoce lo que está haciendo, busque en los foros y las publicaciones recientes para obtener instrucciones más detalladas.\n\n"
    },
    {
      "title": "Atender con diligencia los nuevos archivos de configuración",
      "level": 3,
      "content": "Cuando se invoca pacman, pueden crearse archivos .pacnew y .pacsave. Pacman proporciona avisos cuando esto sucede y los usuarios deben tratar estos archivos con prontitud. Los usuarios son remitidos a la página de la wiki Pacman (Español)/Pacnew and Pacsave (Español) para obtener instrucciones detalladas.\n\nAdemás, piense en otros archivos de configuración que puede haber copiado o creado. Si un paquete tiene una configuración de ejemplo que ha copiado en su directorio principal, compruebe si se ha creado un nuevo.\n\n"
    },
    {
      "title": "Revertir actualizaciones rotas",
      "level": 3,
      "content": "Si se espera/conoce que una actualización de paquete cause problemas, los empaquetadores se asegurarán de que pacman muestre un mensaje apropiado cuando se actualice el paquete. Si experimenta problemas después de una actualización, compruebe la salida de pacman consultando /var/log/pacman.log.\n\nEn este punto, solo después de asegurarse de que no hay información disponible a través de pacman, no hay noticias relativas en https://archlinux.org/, y no hay posts del foro con respecto a la actualización, considere buscar ayuda en el forum, además de en los canales Arch IRC channels (Español), o Downgrading packages (Español) el paquete ofensivo.\n\n"
    },
    {
      "title": "Verificar paquetes huérfanos y descartados",
      "level": 3,
      "content": "Después de una actualización, es posible que pueda tener paquetes que ya no sean necesarios o que ya no estén en los repositorios oficiales\n\nUtilice pacman -Qtd para verificar los paquetes que se instalaron como una dependencia, de modo que ningún otro paquete dependa de ellos ahora. Si todavía se necesita un paquete huérfano, se recomienda cambiar el motivo de instalación a explícito. En otro caso, si el paquete ya no es necesario, se puede eliminar.\n\nAdemás, es posible que algunos paquetes ya no estén en los repositorios remotos, pero aún pueden estar en su sistema local. Para enumerar todos los paquetes foráneos, utilice pacman -Qm. Tenga en cuenta que esta lista incluirá paquetes que se hayan instalado manualmente (por ejemplo, desde AUR (Español)). Para excluir paquetes que están (todavía) disponibles en AUR, use la herramienta ancient-packagesAUR.\n\n"
    },
    {
      "title": "Utilizar el gestor de paquetes para instalar software",
      "level": 2,
      "content": "Pacman (Español) hace un trabajo mucho mejor que usted en el registro de archivos. Si instala las cosas manualmente, tarde o temprano olvidará lo que hizo, olvidará dónde instaló, instalará software conflictivo, lo instalará en ubicaciones incorrectas, etc.\n\n- Instale paquetes de los repositorios oficiales utilizando el método de la sección Pacman (Español)#Instalar paquetes.\n\n- Si el programa que desea no está disponible, compruebe si alguien ha creado un paquete en la AUR (Español). Siga el método en ese artículo para la instalación.\n\n- Por último, si el programa que desea no está en los repositorios oficiales o en AUR, aprenda a crear un paquete para ello.\n\nPara limpiar los archivos instalados incorrectamente, vea Pacman (Español)/Tips and tricks (Español)#Identificar archivos que no pertenecen a ningún paquete.\n\n"
    },
    {
      "title": "Elegir controladores de código abierto",
      "level": 3,
      "content": "Intente instalar siempre los controladores de código abierto antes de recurrir a controladores propietarios. La mayoría de las veces, los controladores de código abierto son más estables y fiables que los controladores propietarios. Los errores del controlador de código abierto se solucionan con más facilidad y rapidez. Mientras que los controladores propietarios pueden ofrecer más características y capacidades, todo ello en contra de la estabilidad. Para evitar este dilema, intente elegir los componentes de hardware conocidos por tener compatibilidad con el controlador de código abierto maduro con funciones completas.\n\n"
    },
    {
      "title": "Tenga cuidado con los paquetes no oficiales",
      "level": 3,
      "content": "Use con precaución los paquetes de AUR (Español) o un repositorio de usuarios no oficial. La mayoría son suministrados por usuarios normales y por lo tanto pueden carecer de los mismos estándares que se tienen en los repositorios oficiales. Tenga cuidado con los AUR helpers (Español) que automatizan la instalación de paquetes de AUR. Siempre revise los PKGBUILDs por precaución y para encontrar signos de error o código malicioso antes de construir y/o instalar el paquete.\n\nPara simplificar el mantenimiento, limite la cantidad de paquetes no oficiales usados. Hacer controles periódicos de los que están en uso real, y eliminar (o reemplazar con sus homólogos oficiales) cualquier otro. Consulte pacman (Español)/Tips and tricks (Español)#Mantenimiento para órdenes útiles.\n\n"
    },
    {
      "title": "Actualizar la lista de servidores de réplicas",
      "level": 3,
      "content": "Actualice la lista de servidores de réplicas de pacman, ya que la calidad de los espejos puede variar con el tiempo, y algunos podrían quedar sin conexión o su velocidad de descarga podría degradarse.\n\nConsulte mirrors (Español) para más detalles.\n\n"
    },
    {
      "title": "Limpiar archivos del sistema",
      "level": 2,
      "content": "Al buscar archivos para eliminar, es importante encontrar los archivos que ocupan más espacio en disco. Los programas que ayudan con esto se encuentran en:\n\n- List of applications (Español)/Utilities (Español)#Programas de visualización sobre la utilización del disco (visualizar utilización del disco).\n- List of applications/Utilities#Disk cleaning (limpiar el disco).\n\n"
    },
    {
      "title": "Caché de paquetes",
      "level": 3,
      "content": "Elimine archivos .pkg no deseados de /var/cache/pacman/pkg/ para liberar espacio en disco.\n\nConsulte Pacman (Español)#Limpiar la memoria caché de los paquetes para obtener más información.\n\n"
    },
    {
      "title": "Paquetes no utilizados (huérfanos)",
      "level": 3,
      "content": "Retire los paquetes no utilizados del sistema para liberar espacio en disco y simplificar el mantenimiento.\n\nConsulte Pacman (Español)/Tips and tricks (Español)#Eliminar paquetes no utilizados (huérfanos) para más detalles.\n\n"
    },
    {
      "title": "Archivos de configuración antiguos",
      "level": 3,
      "content": "Los archivos de configuración antiguos pueden entrar en conflicto con las versiones de software más recientes o corromperse con el tiempo. Elimine las configuraciones innecesarias periódicamente, en particular en su carpeta de inicio y ~/.config. Por razones similares, tenga cuidado al compartir carpetas de inicio entre instalaciones.\n\nBusque las siguientes carpetas:\n\n- ~/.config/ -- donde las aplicaciones guardan su configuración\n- ~/.cache/ -- el caché de algunos programas puede crecer en tamaño\n- ~/.local/share/ -- los archivos antiguos pueden estar ahí\n\nConsulte la ayuda XDG Base Directory support para obtener más información.\n\nPara mantener el directorio personal limpio de archivos temporales creados en el lugar incorrecto, es una buena idea administrar una lista de archivos no deseados y eliminarlos regularmente, por ejemplo con rmshit.py.\n\nrmlint-gitAUR se puede usar para encontrar y opcionalmente eliminar archivos duplicados, archivos vacíos, directorios vacíos recursivos y enlaces simbólicos rotos.\n\n"
    },
    {
      "title": "Enlaces simbólicos rotos",
      "level": 3,
      "content": "Es posible que haya enlaces simbólicos viejos y rotos en su sistema; debería eliminarlos. Ejemplos para lograr esto se pueden encontrar aquí y aquí.\n\nPara listar rápidamente todos los enlaces simbólicos rotos de su sistema, utilice:\n\n```\n# find -xtype l -print\n```\n\nA continuación, inspeccione y elimine las entradas innecesarias de dicha lista.\n\n"
    },
    {
      "title": "Consejos y trucos",
      "level": 2,
      "content": "Los siguientes consejos generalmente no son necesarios, pero ciertos usuarios pueden encontrarlos útiles.\n\n"
    },
    {
      "title": "Usar paquetes de software probado",
      "level": 3,
      "content": "Los lanzamientos continuos de Arch pueden ser una bendición para los usuarios que quieran probar las últimas características y obtener actualizaciones de upstream tan pronto como sea posible, pero también pueden dificultar el mantenimiento del sistema. Para simplificar el mantenimiento y mejorar la estabilidad, intente evitar software de vanguardia e instale solo software maduro y probado. Tales paquetes son menos propensos a recibir actualizaciones difíciles como cambios importantes de configuración o remociones de características. Preferir software que tiene una comunidad de desarrollo fuerte y activa, así como un número elevado de usuarios competentes, con el fin de simplificar el apoyo en caso de un problema.\n\nEvite cualquier uso del repositorio de pruebas, incluso los paquetes individuales de las pruebas. Estos paquetes son experimentales y no son adecuados para un sistema estable. Del mismo modo, evitar los paquetes de desarrollo que se construyen directamente a partir de fuentes. Estos se encuentran generalmente en AUR (Español), con nombres como: «dev», «devel», «svn», «cvs», «git», etc.\n\n"
    },
    {
      "title": "Instalar el paquete linux-lts",
      "level": 3,
      "content": "El paquete linux-lts es un paquete alternativo de kernel de Arch, y está disponible en el repositorio core. Esta versión particular del kernel tiene soporte a largo plazo (LTS) desde upstream, incluyendo arreglos de seguridad y algunas funciones backports. Es útil si prefiere la estabilidad de las actualizaciones menos frecuentes del kernel o si desea un kernel de fallback en caso de que una nueva versión del kernel cause problemas.\n\nPara que esté disponible como una opción de arranque, necesitará actualizar el archivo de configuración de su cargador de arranque para usar el kernel LTS y el disco ram: vmlinuz-linux-lts y initramfs-linux-lts.img.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Arch News Bash Script\n\n"
    }
  ]
}