{
  "title": "System recovery (العربية)",
  "url": "https://wiki.archlinux.org/title/System_recovery_(%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nتُعنى هذه المقالة بإنشاء أقراص إنقاذ للنظام. حيث تُستخدم في الحالات الطارئة لإصلاح النظام أو للتجربة. يتطلب منك بناء قرص إنقاذ أن تكون على دراية بالمهام الإدارية.\n\n"
    },
    {
      "title": "عملية الإقلاع",
      "level": 2,
      "content": "عند بدء عملية الإقلاع، يبدأ الحاسوب بتنفيذ الشبفرة الموجودة في ذاكرة ال ROM (وهي تكون ال BIOS عادةً)، فينظر إلى القطاع 0 والأسطوانة 0 من قرص الإقلاع (الذي قد يكون القرص الصلب أو قرصاً مرناً ‎/dev/fd0‎\n\n- أو أي شيء آخر). أما ما يحتويه هذا القطاع (المدعو MBR) فهو أحد اثنين:\n- شيفرة برنامج إقلاع مثل LILO أو Grub، مهمته تحديد موقع النواة وتحميلها ثم تنفيذها لبدء عملية الإقلاع الصحيحة.\n- بداية نواة نظام تشغيل، مثل لينكس.\n\nعندما يبدأ تنفيذ النواة، سواءً عن طريق تحميلها مباشرة أو من خلال برنامج الإقلاع، وبعد عملية التعرف على العتاد، تستشير النواة شيئاً يسمى ramdisk لتعرف مكان نظام ملفات الجذر **rootfs**، وهو النظام الذي تضمه النواة في الموقع '/'. أما إن فشلت النواة في إيجاد نظام ملفات الجذر، فإنها تتوقف عن العمل.\n\nوالآن وبعد إيجاد نظام ملفات الجذر، يُنفذ البرنامج **init** (الموجود عادة في ‎/bin‎ أو ‎/sbin‎)، ومهمته هي تحديد البرامج والخدمات التي ينبغي أن تبدأ مع إقلاع النظام، أما ملف إعداده فهو ‎/etc/inittab‎. يستطيع برنامج **init** الإقلاع عادة وفق 7 أنماط مختلفة (من النمط 0 حتى النمط 6)، وتختلف هذه الأنماط بين توزيعة وأخرى، ولكنها تتفق في أن النمط 0 يعني إيقاف التشغيل والنمط 1 يعني الإقلاع في النمط الفردي (من أجل إصلاح النظام) والنمط 6 من أجل إعادة الإقلاع. يمكن بالطبع تغيير مفاهيم أرقام الأنماط من خلال تعديل الملف inittab، أما برامج وسكربتات الإقلاع فهي موجودة غالباً ضمن المجلد ‎/etc/rc.d‎.\n\nوأخيراً تسلم سكربتات بداية التشغيل القياد إلى البرنامج **login**، والذي يطلب من المستخدم إدخال اسمه وكلمة مروره.\n\n"
    },
    {
      "title": "قرص إقلاع",
      "level": 3,
      "content": "هو قرص يحتوي على نواة النظام مع/بدون برنامج الإقلاع (مثل LILO أو Grub). وفي هذه الحالة، يطلب هذا القرص قرصاً آخر هو قرص الجذر (الذي يحتوي على نظام ملفات الجذر)، أو يبحث عنه في القرص الصلب إن كان مُعداً لذلك (تحصل هذه الحالة عند تجربة الانوية الجديدة، حيث توضع النواة الجديدة على قرص إقلاع وتُجرّب من خلاله).\n\n"
    },
    {
      "title": "قرص جذر",
      "level": 3,
      "content": "هو قرص يحتوي على نظام ملفات الجذر، ولا يحتوي بالضرورة على نواة النظام أو برنامج الإقلاع.\n\nيمكن لقرص الجذر أن يكون مستقلاً عن بقية الأقراص. عند تحميل النواة، يُنسخ قرص الجذر إلى ال ramdisk مما يجعل الوصول إلى واستخدام قرص الجر أسرع.\n\n"
    },
    {
      "title": "قرص إقلاع/جذر",
      "level": 3,
      "content": "هو قرص يحتوي كلاً من قرص إقلاع وقرص جذر، وبما أنّ حجم القرص محدود، فإنّ ذلك يتطلب تضمين القرص نواة محدودة ونظام ملفات جذر صغير الحجم. فائدته أنه يتضمن نظام الإنقاذ في قرص واحد فقط.\n\n"
    },
    {
      "title": "قرص أدوات",
      "level": 3,
      "content": "وهو قرص يحتوي نظام ملفات لا يُضمّ بالضرورة كجذر. يُستخدم هذا القرص لتضمين المزيد من الأدوات والبرامج التي لم تتسع في قرص الجذر.\n\n"
    },
    {
      "title": "محتويات نظام ملفات الجذر العامة",
      "level": 3,
      "content": "- بنية نظام الملفات الأساسية.\n- المجلدات المطلوبة الاساسية: ‎/bin‎ و ‎/etc‎ و ‎/lib‎ و ‎/proc‎ و ‎/usr‎ و ‎/dev‎ و ‎/tmp‎.\n- مجموعة الأدوات الاساسية: sh و ls و cp و mv و rm و ...\n- الحد الأدنى من ملفات الإعدادات: rc و inittab و fstab، إلخ.\n- ملفات الأجهزة: ‎/dev/hd*‎ و ‎/dev/tty*‎ و ‎/dev/fd0‎، إلخ.\n- مكتبة التشغيل لتزويد الوظائف الأساسية التي تستخدمها الأدوات.\n\nويجب على قرص الإنقاذ لكي يستحق هذا الاسم أن يستطيع القيام بشيئين على الأقل: فحص أنظمة الملفات والتعديل عليها، وإمكانية القيام بعمليات النسخ الاحتياطي والاسترجاع.\n\n"
    },
    {
      "title": "إنشاء نظام الملفات",
      "level": 3,
      "content": "لبناء نظام الملفات، عليك استخدام جهاز كبير كفاية ليتسع للملفات قبل ضغطها. سيكون حجم ٤ ميغابايت كافياً في الغالب، ولديك أحد الخيارات الثلاثة كأماكن وضعها:\n\n- استخدام ramdisk (أي الجهاز ‎/dev/ram0‎ مثلاً). في هذه الحالة تقوم الذاكرة بمحاكاة الجهاز. إن لم تجد لديك جهازاً يُدعى ‎/dev/ram‎ أو ‎/dev/ram0‎ أو حتى ‎/dev/ramdisk‎، فعليك إنشاؤه بتُعنى هذه المقالة بإنشاء أقراص إنقاذ للنظام. حيث تُستخدم في الحالات الطارئة لإصلاح النظام أو للتجربة. يتطلب منك بناء قرص إنقاذ أن تكون على دراية بالمهام الإدارية.\n\n- إن كان لديك قسم (partition) غير مستعمل من قرصك الصلب، فلا ضرر في استخدامه.\n\n- استخدام جهاز loopback، وذلك إما عن طريق الأمر losetup أو الخيار ‎-o loop‎ مع الأمر mount عند ضمّ نظام الملفات.\n\n"
    }
  ]
}