{
  "title": "Sıkça sorulan sorular",
  "url": "https://wiki.archlinux.org/title/S%C4%B1k%C3%A7a_sorulan_sorular",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "İlgili makaleler\n\n- Arch terminology\n- Arch User Repository#Frequently asked questions\n- General troubleshooting\n\n"
    },
    {
      "title": "Arch Linux nedir?",
      "level": 3,
      "content": "Detaylı bilgi için Arch Linux sayfasını ziyaret edin.\n\n"
    },
    {
      "title": "Arch Linux'u neden kullanmak istemeyeyim ?",
      "level": 3,
      "content": "Arch Linux'u kullanmak istemeyeceğiniz durumlar olabilir, bunlardan bazıları:\n\n- 'kendin yap' ilkesinde bir GNU/Linux dağıtımı için zamanınız, yetkinliğiniz ve isteğiniz yoksa.\n- x86_64 işlemci mimarisi dışında bir işlemci mimarisine sahipseniz.\n- bir işletim sisteminin kendi işini görmesi, kendi kendine ayarlarını yapması veya bazı varsayılan yazılımları ve masaüstü ortamınıda beraberinde getirmesi gerektirdiğini inanıyorsanız.\n- yuvarlanan sürüm yapısına sahip olan bir GNU/Linux dağıtımı istemiyorsanız.\n- şu anda kullandığınız işletim sisteminden memnunsanız.\n\nArch Linux kullanmayı birdaha gözden geçirmelisiniz.\n\n"
    },
    {
      "title": "Arch Linux'u neden kullanmak istemeliyim?",
      "level": 3,
      "content": "Because Arch is the best.\n\n"
    },
    {
      "title": "Arch ARM mimarili işlemcileri destekliyor mu ?",
      "level": 3,
      "content": "Hayır, fakat Arch Linux ARM projesi birçok ARM platformlarına Arch Linux'u çalıştırma imkanı sağlıyor. Lütfen bakınız [1][dead link 2024-01-13 ⓘ].\n\n"
    },
    {
      "title": "Arch Linux FHS'yi takip ediyor mu?",
      "level": 3,
      "content": "Not: FHS yani file system hierarchy inglizce olarak Türkçesi ise dosya sistemi hiyerarşisi olarak adlandırılır.\n\nArch Linux systemd servis yöneticisini kullanarak işletim sistemleri için file system hierarchy yapısını takip etmektedir. Klasörlendirme ve isimlemdirme için ayrıca bakınız file-hierarchy(7). /bin, /sbin ve /usr/sbin sembolik bağıntı olarak /usr/bin'e ve /lib, /lib64'da sembolik bağıntı olarak /usr/lib'e bağlıdır.\n\n"
    },
    {
      "title": "GNU/Linux için tamamen acemiyim. Gerçekten Arch Linux kullanmalı mıyım ?",
      "level": 3,
      "content": "Öncelikle bilmen gerekir ki Arch Linux tasarım olarak DIY (Do-It-Yourself) yani 'kendi işini kendin hallet' olarak tasarlanmıştır. Yani acemi olarak Arch kullanmak istersen, bu yeni sistemi öğrenmek ve uyum sağlamak için zamanının çoğunda bu işlemleri isteyerek şahsen gerçekleştirmen gerekir, çünkü sistemi bir bütün olarak kullanabilir hale getiren kişi kullanıcı (yani siz) olacaktır.\n\nHerhangi bir şekilde yardım istemeden önce, sorununla alakalı konuya Google vasıtasıyla senin göz atman ya da foruma ve Arch Wiki tarafından sağlanan zengin içeriklere senin bakman beklenmektedir. Her şeyden önce bilmelisin ki bu kaynakların ulaşabilir olmasının bir sebebi var. Binlerce gönüllü insanın buradaki değerli bilgileri birleştirmek için ciddi bir zaman harcadığını belirtmek isteriz.\n\nLütfen Arch terminolojisi ve Yükleme rehberine bir göz at.\n\n"
    },
    {
      "title": "Arch Linux kullanım olarak nasıl tasarlandı ? Bir sunucu olarak mı ? Bir iş istasyonu olarak mı ? Yoksa normal masaüstü kullanımı için mi ?",
      "level": 3,
      "content": "Arch herhangi bir şekilde bir kullanım tarzı baz alınarak yahut kullanıcı tiplerine göre tasarlanmamıştır. Arch'ın kullanımında kendi işini kendin hallet ilkesinden zevk alan, kendi özel ihtiyaçlarına veya spesifik durumlara uygun halde sistemin çalışmasını sağlamak isteyen yetkin kullanıcılar hedef alınır. Bundan dolayı seçimler kullanıcıya kaldığı için Arch istenilen her türlü amaç için sanal olarak kullanılabilir. Bir çok kullanıcı Arch'ı masaüstü ya da iş istasyonu olarak kullanıyor. Örneğin archlinux.org sunucu olarak Arch Linux kullanmaktadır.\n\n"
    },
    {
      "title": "Arch'ı gerçekten beğendim, fakat geliştirici ekibinin X özelliğini uygulaması lazım",
      "level": 3,
      "content": "Topluluğa dahil olarak çözümlerini ve geliştirdğin kodları paylaşarak destekleyebilirsin. Hem topluluk tarafından hem geliştirici ekibi tarafından beğenilirse ileri dönük zamanda birleştirilme ihtimali var.\n\n"
    },
    {
      "title": "Yeni sürüm ne zaman ulaşılabilir olur ?",
      "level": 3,
      "content": "Arch Linux sürümleri basit yükleme ve kurtarma için canlı ortam oluşturur ve bu oluşum sağlanırken base grubu ve başka diğer paketleri içerir. Sürümler genellikle her ayın ilk yarısında yayımlanır.\n\n"
    },
    {
      "title": "Arch Linux kararlı bir dağıtım mı ? Sık bir şekilde bozulma meydana gelir mi ?",
      "level": 3,
      "content": "Yuvarlanan sistemin kararlı olması tamamen kullanıcının sorumluluğundadır. Kullanıcının sistemi güncellemek istediği zaman gerekli değişiklikleri ve birleştirmeleri yapması zorunludur. Arch Linux 'kendi işini kendin hallet' ilkesini benimseyen bir dağıtım olduğu için, yardım istendiği zaman, düzgün bilgilenmemiş ve üretken olmayan bir kullanıcıya ait bozulma şikayetleri olarak değerlendirilecektir, çünkü bunlardan kesinlikle Arch geliştiricileri sorumlu değillerdir.\n\nBu konuda belirtilen görüşleri ve ipuçları için lütfen Sistem bakımı sayfasını ziyaret ediniz.\n\n"
    },
    {
      "title": "Arch'ın daha çok basında olmasına ihtiyacı var (reklam vb.)",
      "level": 3,
      "content": "Arch kendi yağında kavrulan bir dağıtımdır ve gerekli miktarda basında da yer almaktadır. Arch Linux'un hedefi çok büyük olmak değildir, aksine organik ve yönetilebilirliği yüksek şekilde büyüyen bir kullanıcı havuzuna sahiptir.\n\n"
    },
    {
      "title": "Arch'ın daha fazla geliştiriciye ihtiyacı var",
      "level": 3,
      "content": "Doğru olabilir. Gönüllü olarak katkıda bulanabilirsiniz. Forumlar, IRC kanalları ve mail listesi ziyaret ederek ne yapılması gerektiğine bakın.\n\n"
    },
    {
      "title": "Arch'ın bir kurulum sihirbazına ihtiyacı var. Belki grafiksel kullanıcı arayüzlü bir sihirbaz?",
      "level": 3,
      "content": "Kurulum işleminin sık yapılması gerekmediği için (makalenin devamını okuyun ve yuvarlanan sürümün ne anlama geldiğini öğrenin), bu kullanıcıların veya geliştiricilerin yüksek bir önceliği değildir. Kurulum rehberi komut satırı metodunu kullanmak üzere sürekli olarak güncelleniyor.\n\n"
    },
    {
      "title": "Arch'ı kurdum, ve şu anda kabuk ekranındayım. Ne yapmam gerekiyor?",
      "level": 3,
      "content": "Genel öneriler'e göz atın.\n\n"
    },
    {
      "title": "Hangi masaüstü ortamı veya pencere yöneticisini kullanmalıyım?",
      "level": 3,
      "content": "Size en uygun olanı seçin. Masaüstü ortamı ve Pencere yöneticisi makalelerine göz atın.\n\n"
    },
    {
      "title": "Arch'ı diğer \"minimal\" dağıtımlardan ayıran nedir?",
      "level": 3,
      "content": "Diğer dağıtımlarla karşılaştırıldığında Arch'a göz atın.\n\n"
    },
    {
      "title": "Neden internetim diğer işletim sistemlerine göre daha yavaş ?",
      "level": 3,
      "content": "Ağınızı düzgün bir şekilde yapılandırdığınıza emin misiniz ? Ağ yapılandırmaları sayfasına gözatmanızda bir fayda var.\n\nBilmenizde yarar var ki Arch Linux trafik yapılandırmaları aktif olarak gelmemektedir. Bundan dolayı bir uygulama internetinizi tam kapasite olarak kullanabilir.\n\n"
    },
    {
      "title": "Niçin Arch benim tüm RAM kapasitemi kullanıyor ?",
      "level": 3,
      "content": "Temel olarak, kullanılmayan RAM harcanan RAM'dir.\n\nBir çok yeni kullanıcı bir önceki hafıza kullanımlarına göre Linux çekirdeğinin nasıl farklı kullandığını fark edicekelerdir. Veriye ulaşmada RAM depolama aygıtlarına göre daha hızlı ulaştığından sebeple, çekirdek o anlık ulaşılmış olan veriyi önbellekleme işlemini yapar. Önbelleklenen veri sadece sistemde yeterli miktarda bellek kullanımı yapamadığında ve yeni veriler yüklenmesi gerektiğinde temizlenmektedir.\n\nBu farklılığı free komutunu kullanarak gözlemleye biliriz:\n\n```\n$ free -h\n```\n\n```\ntotal        used        free      shared  buff/cache   available\nMem:           2.8G        1.1G        283M        224M        1.4G        1.2G\nSwap:          3.0G        881M        2.1G\n```\n\n\"free\" ve \"available\" arasındaki bellek farkının ne kadar önemli olduğunu bilmemiz gerekiyor. Yukarıda verilen örnekte, 2.8G RAM kapasitesine sahip olan bir dizüstü görünüşe göre hemen hemen tüm belleği kullanıyor gibi ve sadece 283M boş kapasitesi var. Dikkat etmek gerekir ki 1.4G olan \"buff/cache\". Yani hala 1.2G ulaşılabilir yeni uygulamaları açabilecek, swap yapmadan kullanbileceğimiz bir bellek var. Detaylı bilgi için man free(1). Sonuç olarak tüm fındık fıstığı sistem kullandığı için performansımızı daha elverişli hale getirmiş oluyoruz :)\n\nŞuradaki tadından yenmeyecek olan yazıyı eğer merakınız tavan yaptıysa okuyabilirsiniz!\n\n"
    },
    {
      "title": "Bütün boş alan nereye gitti ?",
      "level": 3,
      "content": "Bu sorunun cevabı kurmuş olduğunuz sisteminize bağlıdır. Burada bazı sorunun cevabı için yardımcı olabilecek uygulamaları bulabilirsiniz.\n\n"
    },
    {
      "title": "Paket yönetimi",
      "level": 2,
      "content": "Daha fazla cevap için pacman, pacman/İpuçları ve püf noktaları ve Resmi depolar sayfalarına göz atın.\n\n"
    },
    {
      "title": "X pakette hata buldum. Ne yapmalıyım?",
      "level": 3,
      "content": "İlk olarak, bu hatanın Arch ekibi tarafından düzeltilebilecek bir hata olduğuna emin olmalısın. Öyle olmadığı durumda (örn. Firefox'un Mozilla ekibinin hatasından dolayı çökmesi); bu hatalara giriş hatası denir. Eğer bu bir Arch problemi ise, yapabileceğiniz bir kaç adım söz konusu:\n\n1. Bilgi için forumlarda arama yapın. Birinin bu konuda bildirim yapıp yapmadığını kontrol edin.\n1. https://bugs.archlinux.org adresine detaylı bilgi ile birlikte bir hata bildirimi yapın.\n1. Eğer istersen, sorunu detaylandırıp halihazırda raporladığına dair bilgi vereceğin bir forum gönderisi oluşturabilirsin. Bu, aynı hatayı bir çok kişi tarafından verilmesinin önüne geçecektir.\n\n"
    },
    {
      "title": "Arch paketlerinin karmaşık isimlendirme kuralı var. \".pkg.tar.gz\" ve \".pkg.tar.xz\" çok uzun ve/veya kafa karıştırıcı",
      "level": 3,
      "content": "Bu Arch mailing listesinde tartışılmıştı. .pac uzantısı desteklendi. Ancak yakın bir zamanda paket uzantısını değiştirmek gibi bir planımız yok. Arch geliştiricilerinden Tobias Kieslich'e göre, \"Bir paket, gziplenmiş [xz] bir tar arşividir! Ve bu herhangi bir tar uyumlu uygulama tarafından açılabilir, incelenebilir ve manipüle edilebilir. Dahası, mime-type'ları çoğu uygulama tararfından otomatik algılanabilir.\"\n\n"
    },
    {
      "title": "Pacman'in diğer uygulamalar tarafından kolayca paket bilgilerine erişilmesini sağlayan bir kütüphaneye ihtiyacı var",
      "level": 3,
      "content": "Pacman libalpm(3) - \"Arch Linux Paket Yönerimi\" kütüphanesinin bir ön yüzüdür. Bu kütüphane alternatif ön yüzler geliştirilmesine de müsade etmektedir. Mesela bir grafiksel kullanıcı arayüz önyüzü, yazılabilir.\n\n"
    },
    {
      "title": "Pacman'in X özelliğe ihtiyacı var!",
      "level": 3,
      "content": "Eğer fikrinin kayda değer olduğunu düşünüyorsan, bunu pacman-dev'de tartışabilirsin. Ayrıca halihazırda bulunan özellik istekleri için de https://bugs.archlinux.org sayfasını ziyaret edebilirsin.\n\nAslında, pacman'e veya Arch Linux'a özellik eklemenin en iyi yolu kendiniz yazmanızdır. Bu yama veya kod belki kabul edilebilir veya reddedilebilir, ama diğerleri bundan memnun olabilir, test edebilir ve harcadığınız emeğe katkıda bulunabilirler.\n\n"
    },
    {
      "title": "X paketini yükledim. Nasıl başlatacağım?",
      "level": 3,
      "content": "Eğer KDE veya GNOME gibi bir masaüstü ortamı kullanıyorsanız, program menüde otomatik olarak gösterilecektir. Eğer programı uçbirimden çalıştırmak istiyorsanız ve ikili dosyanın adını bilmiyorsanız, şu komutu uygulayın:\n\n```\n$ pacman -Qlq package_name | grep /usr/bin/\n```\n\n"
    },
    {
      "title": "Neden her paylaşımlı kütüphanenin resmi depolarda tek bir sürümü var?",
      "level": 3,
      "content": "Debian gibi bir kaç dağıtımda, paylaşımlı kütüphanelerin farklı sürümleri bulunur. libfoo1, libfoo2, libfoo3 ve daha fazlası. Bu durumda uygulamaların aynı sistemde libfoonun farklı sürümleri ile derlenmesi söz konusudur.\n\nArch gibi dağıtımlarda ise, sadece en son kararlı sürüm resmi olarak desteklenir. Güncellenmeyen yazılımların desteğine son verilerek paket geliştiricileri, yeni sürümlerin istenildiği gibi çalışmasına daha fazla zaman ayırabilmektedirler. Paylaşımlı bir kütüphanenin yeni bir sürümü üst servis sağlayıcılarda mevcut olduğu gibi depolara eklenmekte ve bu değişiklikten etkilenen paketler, yeni sürümü kullanacak şekilde tekrar derlenmektedir.\n\n"
    },
    {
      "title": "Tam bir sistem yükseltmesi gerçekleştirirken paylaşımlı bir kütüphanenin güncellemesi bulunup, kütüphaneye bağımlı olan uygulamaların güncellemesi bulunmuyor ise ne yapmalıyım?",
      "level": 3,
      "content": "Bu durumun hiç yaşanmaması gerekmektedir. foobaz adı verilen bir uygulamanın resmi depoların birinde olduğu farz edilsin ve libbaz adı verilen paylaşımlı bir kütüphanenin yeni sürümüne karşılık başarıyla derlendiğinde uygulama, libbaz ile birlikte güncellenecektir. Ancak derleme işlemi başarız olursa, foobaz paketinin sürümlü bir bağımlılığı olacaktır (örn. libbaz 1.5) ve libbaz paketinin yükseltilmesi sırasında ortaya çıkan çakışma nedeni ile pacman tarafından kaldırılacaktır.\n\nEğer foobaz paketi kendi derlediğiniz ve AUR'dan yüklediğiniz bir paket ise foobaz paketini libbaz paketinin yeni sürümüne karşılık tekrar derlemeyi denemelisiniz. Derleme işlemi başarısız olursa bu hatayı foobaz paketinin geliştiricilerine bildirmelisiniz.\n\n"
    },
    {
      "title": "Depoda önemli bir çekirdek güncellemesinin olup, bazı sürücü paketlerinin güncellenmemiş olma ihtimali mümkün müdür?",
      "level": 3,
      "content": "Hayır, bu durum mümkün değildir. Önemli çekirdek güncellemeleri (örn. linux 3.5.0-1\\'dan linux 3.6.0-1\\'e) gerçekleştirilirken tüm desteklenen çekirdek sürücü paketlerinin yeniden derlenmiş sürümleri ile birlite gelir. Diğer taraftan, eğer sisteminizde desteklenmeyen bir sürücü yüklüyse (örn. AUR'dan) çekirdek güncellemesi, sürücüyü yeni çekirdeğe göre yeniden derlemediğiniz takdirde bazı şeyleri bozabilir. Yükledikleri desteklenmeyen sürücü paketlerinin güncellenmesinden kullanıcılar sorumludur.\n\n"
    },
    {
      "title": "Yükseltmeden önce ne yapmalı?",
      "level": 3,
      "content": "Sistem bakımı#Sistemi yükseltmek kısmını takip edin.\n\n"
    },
    {
      "title": "Bir sistem güncellemesi yayınlandı, ancak pacman sistemin güncel olduğunu söylüyor",
      "level": 3,
      "content": "pacman yansımaları anında senkronize olmaz. Güncellemenin sizin için hazır olması 24 saate kadar sürebilir. Sabırlı olun veya başka yansımaları deneyin. Bu sayfadan güncel yansımalara erişebilirsiniz.\n\n"
    },
    {
      "title": "Üst servis sağlayıcı projesi X yeni sürümünü yayımladı. Arch paketinin bu yeni sürüme güncellenmesi ne kadar sürer?",
      "level": 3,
      "content": "Paket güncellemeleri hazır olduğu an yayımlanmaktadır. Bu belirsiz zaman, üst servis sağlayıcının birkaç saat sonra küçük bir hata güncellemesi yayımlaması kadar kısa veya büyük bir paket grubunun birkaç haftadan sonra ana güncellemesini yayımlaması kadar uzun da olabilir. Üst servis sağlayıcının yeni sürümünden Arch'ın yeni bir paket yayımlamasına kadar geçen süre, belirli paketlere ve bu paketlerini geliştiricilerinin müsait olmasına göre değişiklik göstermektedir. Ek olarak, bazı paketler |test deposunda bir süre kalmaktadır ve bu durum paketin güncellenmesinden önce geçen süreyi uzatabilmektedir. Paket geliştiricilieri, depolara kararlı güncellemeleri ulaştırmak için hızlı bir şekilde çalışmaya gayret etmektedirler. Eğer resmi depolarda güncel olmayan bir paket bulursanız o paketin, paket sitesindeki sayfasına gidin ve bu durumu etiketleyin.\n\n"
    },
    {
      "title": "Hali hazırda kurulu bir kütüphanenin eski bir sürümüne ihtiyacım olursa, daha yeni olan sürüme sembolik bir bağlantı kurabilir miyim?",
      "level": 3,
      "content": "Eğer şanslı iseniz, belirli bir süre için bu işe yarayabilir. Ancak ne olursa olsun, bu uygun bir çözüm değildir. Çünkü:\n\n- Kütüphaneler rastgele sürüm değiştirmezler - API/ABI'da değiştirilmiş olacaktır (muhtemelen bazı şeyler çıkartılmış olacak) ve bu değişikliklerin kullanıma etki edip etmemesi sadece bir şans meselesidir.\n- Kurulan sembolik bağlantıyı paket yöneticisi fark edemeyecektir. Derhal sistem kütüphane dosyalarını kırmaya çalışan acemiler, teşhis edemeyecekleri/düzeltemeyecekleri bir değişiklik yaparak büyük risk altına girebilirler ki, normal bir durumda paket yöneticisi bu tarz değişikliklere karşı koruma sağlamaktadır.\n- Eski kütüphane dosyasını, dosya sistemine atmanın en hafif bedeli ise, dosyalar takip edilemez, unutulur, ve potansiyel güvenlik hataları fark edilemez/yamalanamaz.\n\nBunu yapmak yerine, örneğin, gerekli kütüphane sürümünü sağlayan bir uyumluluk paketi kullanın/yazın.\n\n"
    },
    {
      "title": "İşlemcimin x86_64 mimarisine sahip olduğunu nasıl anlarım?",
      "level": 3,
      "content": "Eğer işlemciniz x86_64 mimarisine sahipse,/proc/cpuinfo içinde lm flag'i olacaktır. Aşağıdaki komutun çıktısı ile bunu öğrenebilirsiniz,\n\n```\n$ grep -w lm /proc/cpuinfo\n```\n\nWindows üzerinde ise ücretsiz bir yazılım olan CPU-Z ile işlemcinizin x86_64 mimarisine sahip olup olmadığını öğrenebilirsiniz. \"AMD64\" ve Intel'in 64 bit çözümü olan \"EM64T\" mimarisine sahip olan bir işlemci x86_64 komut setini ve kütüphanelerini çalıştırabilir.\n\n"
    },
    {
      "title": "Neden 64-bit?",
      "level": 3,
      "content": "Çoğu durumda daha hızlıdır ve Address space layout randomization (ASLR) özelliği ve Position-independent code (PIC) , NX Bit (Fiziksel Adres Uzantısı (Physical Address Extension, PAE)'nin devre dışı olması sebebiyle stok i386 çekirdeğinde bulunmamaktadır) özellikleri ile daha güvenlidir. Ayrıca x86_64 komut setini çalıştıramayan bir işlemci bilgisayarınızdaki 4 GB'tan daha fazla RAM'i algılayamaz.\n\nEk olarak yazılımcılar da yavaş yavaş 32 bit desteğini gevşetip, çekmeye başladılar. 32 bit yazılımın yakın bir gelecekte var olmayacağını söyleyebiliriz.\n\n32 bitten kaçınmayı istemeniz için sıralayabileceğimiz daha birçok neden bulunmakta ama çekirdek, kullanıcı alanı ve bireysel programlar arasında 64 bitin 32 bite göre daha iyi yaptığı her şeyi sıralamamız pek de uygun değil.\n\n"
    }
  ]
}