{
  "title": "TalkingArch (Español)",
  "url": "https://wiki.archlinux.org/title/TalkingArch_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-14** \n\nEl medio de instalación oficial de Arch Linux admite varias funciones de Accesibilidad:\n\n- la voz es proporcionada por el paquete espeakup\n- el soporte de terminal braille es manejado por el paquete brltty\n\nEste documento describe cómo instalar Arch Linux utilizando estas características.\n\n"
    },
    {
      "title": "Arrancar el entorno en vivo",
      "level": 3,
      "content": "Cuando el medio de instalación comience a arrancar, presione Abajo seguido por Intro para arrancar con la voz activada.\n\nLas pantallas braille USB deben detectarse automáticamente mediante udev.\n\n"
    },
    {
      "title": "Múltiples tarjetas de sonido",
      "level": 3,
      "content": "Si su computadora tiene varias tarjetas de sonido, escuchará el siguiente mensaje: Please select your sound card for speech output.\n\nNote: **(del traductor)** \n\nCuando escuche un pitido en la salida que le gustaría utilizar, presione Intro para seleccionar la tarjeta.\n\n"
    },
    {
      "title": "Instalar paquetes esenciales",
      "level": 3,
      "content": "Para el soporte de voz en el sistema instalado, necesita espeakup y alsa-utils. Si utiliza una pantalla braille, debe instalar brltty.\n\nAñada los paquetes necesarios a la llamada pacstrap(8) al instalar:\n\n```\n# pacstrap /mnt base linux linux-firmware espeakup alsa-utils\n```\n\n"
    },
    {
      "title": "Tarjeta de sonido",
      "level": 3,
      "content": "Si se detectaron #Múltiples tarjetas de sonido, necesita copiar el archivo /etc/asound.conf que se ha generado en el medio de instalación.\n\n```\n# cp /etc/asound.conf /mnt/etc/\n```\n\n"
    },
    {
      "title": "Activar los servicios",
      "level": 3,
      "content": "Para tener soporte de voz después de arrancar el sistema instalado, necesita activar espeakup.service.\n\n"
    },
    {
      "title": "Reiniciar",
      "level": 2,
      "content": "Después de arrancar el sistema recién instalado, este debería comenzar a hablar automáticamente.\n\n"
    }
  ]
}