{
  "title": "Telegram (Português)",
  "url": "https://wiki.archlinux.org/title/Telegram_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Telegram é um serviço de mensagens instantâneas multiplataforma baseado em nuvem com criptografia ponto a ponto opcional. A criação de conta requer um número de telefone.\n\nOs clientes oficiais são de código aberto, mas o código para versões recentes nem sempre é publicado imediatamente. O código do lado do servidor é proprietário.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Você pode usar um dos seguintes métodos para usar o Telegram no Arch:\n\n"
    },
    {
      "title": "Plugins de cliente de bate-papo",
      "level": 3,
      "content": "- Ao usar os pacotes telegram-purpleAUR[link quebrado: package not found] ou telegram-purple-gitAUR, uma conexão com o Telegram por meio de software de mensageria (gráficos ou de linha de comando) baseados em libpurple tal como Pidgin é fornecida.\n- Aplicativos de mensageria que estão usando Telepathy tal como empathyAUR[link quebrado: package not found] (o mensageiro padrão do GNOME) pode fazer uso do pacote telepathy-hazeAUR[link quebrado: package not found], que fornece possibilidade de usar libpurple e, portanto, telegram-purpleAUR[link quebrado: package not found] para se conectar ao Telegram.\n\n"
    },
    {
      "title": "Clientes gráficos",
      "level": 3,
      "content": "O aplicativo oficial:\n\n- telegram-desktop — compilado pelo Arch Linux\n- telegram-desktop-binAUR — compilado pelo upstream\n\nClientes de terceiros:\n\n- kepka-gitAUR[link quebrado: package not found]\n- kotatogram-desktop-binAUR, kotatogram-desktopAUR, kotatogram-desktop-dynamic-binAUR[link quebrado: package not found]\n\n"
    },
    {
      "title": "Clientes de linha de comando",
      "level": 3,
      "content": "- telegram-cli-gitAUR fornece interface de linha de comando para conectar e usar o Telegram. Para mais informações sobre o programa, visite sua página no Github.\n- nctelegram-gitAUR[link quebrado: package not found] é uma interface de linha de comando para o Telegram baseado em Ncurses e precisa de telegram-cli-gitAUR para funcionar. Para mais informações sobre o programa, visite sua página no Github.\n- python-telegram-sendAUR não é um cliente completo, mas é uma ferramenta de linha de comando para enviar diretamente mensagens ou arquivos via Telegram.\n- telega.el -cliente Telegram do GNU Emacs.\n\n"
    },
    {
      "title": "Clientes web",
      "level": 3,
      "content": "- O Telegram Web oficial.\n- franzAUR é um aplicativo web código aberto que pode ser usado para interface web de vários software de mensageria instantânea como o Telegram, WhatsApp, Facebook e mais.\n- rambox-binAUR é uma alternativa ao Franz, também código aberto. Oferece todos os recursos de sua contraparte.\n- Use o aplicativo Telegram da Chrome Web Store para o Chromium, para conectar ao Telegram em seu navegador por meio da interface web.\n\n"
    },
    {
      "title": "Diálogos GTK no Telegram Desktop",
      "level": 3,
      "content": "Se você deseja usar diálogos de arquivos do GTK em vez dos do Qt, defina a variável de ambiente QT_QPA_PLATFORMTHEME com gtk3.\n\n"
    },
    {
      "title": "Suporte a Wayland",
      "level": 3,
      "content": "Veja Wayland (Português)#Qt para instruções. Além disso, Wayland não suporta posicionamento absoluto, portanto, as notificações estão posicionadas incorretamente. A única correção é ativar as notificações nativas nas configurações.\n\n"
    },
    {
      "title": "Recursos do Telegram sobre o Arch Linux",
      "level": 3,
      "content": "- Arch Linux - Grupo não oficial para discutir tudo sobre o Arch Linux.\n- ArchWikiBot - Bot inline para pesquisar por páginas do ArchWiki.\n- Planet Arch Linux & News - Canal com atualizações recentes do Planet Arch e Latest News em um só lugar.\n- Arch Linux: Recent package updates - Canal com atualizações recentes de pacotes em repositórios do Arch Linux.\n- Arch Linux News - Canal com notícias do site do Arch (não atualizado desde 2018).\n- Planet Arch - Canal com publicações do site do Planet Arch (não atualizado desde 2018).\n\n"
    },
    {
      "title": "Contador de mensagens não lidas para o Telegram Desktop",
      "level": 3,
      "content": "Por padrão, somente o ícone na bandeja do sistema mostrará o número de mensagens não lidas. Se você quiser ter o ícone do aplicativo real para exibir também o contador de mensagens não lidas, poderá usar a integração do selo Unity, que também pode ser gerenciada pelo KDE e pelo GNOME. Para ativar a integração do Unity, você terá que instalar o libunityAUR e iniciar o Telegram Desktop com a variável de ambiente XDG_CURRENT_DESKTOP configurada para Unity, por exemplo, copie o arquivo .desktop para ~/.local/share/applications/ e altere a linha Exec para iniciar o Telegram Desktop com o conjunto de variáveis de ambiente.\n\n"
    },
    {
      "title": "Telegram e Plasma",
      "level": 3,
      "content": "No KDE Plasma, a sessão da área de trabalho é restaurada no login por padrão. Isso faz com que o Telegram seja iniciado automaticamente no login, se não tiver sido fechado no logout.\n\nPara alterar esse comportamento, você pode desativar o início automático do Telegram em Configurações do sistema > Espaço de trabalho > Inicialização e desligamento > Iniciar automaticamente.\n\nAlém disso, você pode desativar a restauração da sessão alterando a opção em Configurações do sistema > Espaço de trabalho > Inicialização e desligamento > Sessão do Desktop > Na inicialização. Você pode excluir o Telegram ou selecionar a opção \"Iniciar com uma sessão vazia\". Isso deve impedir o Telegram de iniciar automaticamente.\n\n"
    },
    {
      "title": "Problema com fontes",
      "level": 3,
      "content": "Se você tiver problema com fontes, ttf-opensans pode corrigir.\n\n"
    }
  ]
}