{
  "title": "Telegram (Русский)",
  "url": "https://wiki.archlinux.org/title/Telegram_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Telegram — облачный кроссплатформенный мессенджер с опциональным end-to-end шифрованием. Для создания аккаунта требуется номер телефона.\n\nХотя официальные приложения и имеют открытый исходный код, они обновляются не сразу же после выхода новых версий приложений. Серверная часть Telegram является проприетарной.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Вы можете использовать Telegram в Arch Linux одним из способов ниже:\n\n"
    },
    {
      "title": "Плагины для других приложений",
      "level": 3,
      "content": "- При использовании пакетов telegram-purpleAUR[ссылка недействительна: package not found] или telegram-purple-gitAUR подключиться к Telegram можно из приложений (графических или консольных), основанных на libpurple, к примеру, Pidgin.\n- В приложениях на основе Telepathy (к примеру, empathyAUR[ссылка недействительна: package not found], мессенджер по умолчанию в GNOME) можно использовать пакет telepathy-hazeAUR[ссылка недействительна: package not found] с совместимостью с libpurple, а затем telegram-purpleAUR[ссылка недействительна: package not found] для подключения к Telegram.\n\n"
    },
    {
      "title": "Графические приложения",
      "level": 3,
      "content": "Официальное приложение:\n\n- telegram-desktop — сборка Arch Linux\n- telegram-desktop-binAUR — сборка Telegram\n\nНеофициальные клиенты:\n\n- kotatogram-desktop-binAUR, kotatogram-desktopAUR, kotatogram-desktop-dynamic-binAUR[ссылка недействительна: package not found]\n\n"
    },
    {
      "title": "Приложения для терминала",
      "level": 3,
      "content": "- telegram-cli-gitAUR — позволяет использовать Telegram при помощи командной строки. Для получения дополнительной информации о программе обратитесь к официальной странице на Github.\n- nctelegram-gitAUR[ссылка недействительна: package not found] — основанный на Ncurses клиент для командной строки, требует telegram-cli-gitAUR. Для получения дополнительной информации о программе обратитесь к официальной странице на Github.\n- python-telegram-sendAUR — утилита для отправки сообщений и файлов с помощью Telegram (не полнофункциональный клиент).\n- telega.el — клиент Telegram для GNU Emacs.\n- TelegramTUI — клиент Telegram с псевдографическим интерфейсом пользователя.\n\n"
    },
    {
      "title": "Web-приложения",
      "level": 3,
      "content": "- Официальный Telegram Web.\n- franzAUR — веб-приложение с открытым исходным кодом, предоставляющее доступ к различным мессенджерам, таким как Telegram, WhatsApp, Facebook и другим.\n- rambox-binAUR — альтернатива Franz (также с открытым исходным кодом), предоставляет все его возможности.\n- Приложение Telegram Chrome app для Chromium — позволяет общаться в Telegram из браузера.\n\n"
    },
    {
      "title": "GTK-диалоги в Telegram Desktop",
      "level": 3,
      "content": "Если необходимо использовать файловые диалоги GTK вместо стандартных диалогов Qt, задайте переменным окружения QT_QPA_PLATFORMTHEME и TDESKTOP_I_KNOW_ABOUT_GTK_INCOMPATIBILITY значения gtk3 и 1 соответственно. См. [1] (англ.) для получения более подробной информации.\n\n"
    },
    {
      "title": "Поддержка Wayland",
      "level": 3,
      "content": "См. Wayland#Qt для получения более подробной информации. Следует отметить, что Wayland не поддерживает абсолютное позиционирование, из-за чего уведомления неправильно располагаются на экране. В качестве решения проблемы можно включить нативные уведомления в настройках Telegram Desktop.\n\n"
    },
    {
      "title": "Ресурсы в Telegram про Arch Linux",
      "level": 3,
      "content": "- Arch Linux RU — неофициальная группа сообщества Arch Linux в СНГ.\n- archlinux_ru — неофициальная группа русскоговорящего сообщества Arch Linux.\n- Arch Linux — неофициальная группа для обсуждения всего об Arch Linux (на английском).\n- ArchWikiBot — встроенный бот для поиска в ArchWiki.\n- Planet Arch Linux & News — канал с последними публикациями Planet Arch и новостями с сайта Arch Linux.\n- Arch Linux: Recent package updates — канал с последними обновлениями пакетов в репозиториях Arch Linux.\n- Arch Linux News — канал с новостями с официального сайта Arch Linux (не обновляется с 2018).\n- Planet Arch — канал с публикациями с сайта Planet Arch (не обновляется с 2018).\n\n"
    },
    {
      "title": "Счётчик непрочитанных сообщений для Telegram Desktop",
      "level": 3,
      "content": "По умолчанию, количество непрочитанных сообщений будет отображаться только на иконке Telegram Desktop в системном трее. Если же вы хотите также включить счётчик непосредственно на иконке самого приложения, можно задействовать интеграцию значков Unity, которая поддерживается как в GNOME, так и в KDE Plasma. Для этого нужно установить libunityAUR и запустить Telegram Desktop с переменной окружения XDG_CURRENT_DESKTOP со значением Unity. Например, скопируйте файл .desktop в ~/.local/share/applications/ и измените строку Exec для запуска Telegram Desktop с вышеуказанной переменной окружения.\n\n"
    },
    {
      "title": "Telegram и Plasma",
      "level": 3,
      "content": "По умолчанию KDE Plasma восстанавливает предыдущую сессию во время входа в систему, из-за чего Telegram автоматически запускается, если он не был закрыт перед завершением сессии.\n\nДанное поведение возможно изменить, отключив автоматический запуск Telegram в разделе Параметры системы > Рабочая среда > Запуск и завершение > Автозапуск.\n\nТакже возможно отключить восстановление сессии в разделе Параметры системы > Рабочая среда > Запуск и завершение > Управление сеансами > При входе в систему, где можно исключить Telegram или выбрать опцию \"Начинать с пустого сеанса\".\n\n"
    },
    {
      "title": "Проблемы со шрифтами",
      "level": 3,
      "content": "Установите пакет ttf-opensans.\n\n"
    }
  ]
}