{
  "title": "Telegram (Italiano)",
  "url": "https://wiki.archlinux.org/title/Telegram_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Telegram is a cloud-based cross-platform instant messaging service with optional end-to-end encryption. Account creation requires a phone number.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "You can use one of following methods in order to use Telegram:\n\n"
    },
    {
      "title": "Graphical clients",
      "level": 3,
      "content": "- Telegram Desktop — The official application built by Arch Linux.\n\n- Kotatogram — Unofficial experimental Telegram Desktop fork.\n\n- 64Gram — Unofficial feature-rich Telegram Desktop fork.\n\n- Materialgram — Telegram Desktop fork with material icons and some improvements.\n\n- Ayugram — Desktop Telegram client with good customization and Ghost mode.\n\n"
    },
    {
      "title": "Web-based clients",
      "level": 3,
      "content": "Two official browser-agnostic clients exist: Telegram WebK and Telegram WebA, while the Telegram Chrome app for Chromium-based browser is also available. There are also third-party clients:\n\n- Franz — An open-source web-based application that can be used for various instant messaging software.\n\n- Hamsket — A GPL-licensed alternative to Franz, forked from the last open sources of Rambox.\n\n"
    },
    {
      "title": "Chat client plugins",
      "level": 3,
      "content": "Some multi-purpose chat clients provide a plugin for Telegram:\n\n- Pidgin — libpurple Telegram plugin implemented using official tdlib client library. Needs TD_API_ID and TD_API_HASH env vars to be set for makepkg.\n\n"
    },
    {
      "title": "Command-line clients",
      "level": 3,
      "content": "- Telegram messenger CLI — A command-line interface for Telegram which uses the readline interface.\n\n- tg — Telegram terminal client.\n\n- nchat — A terminal-based chat client with support for Telegram.\n\n- telega.el — GNU Emacs Telegram client.\n\n- telegram-send — A command-line tool to directly send messages or files via Telegram.\n\n"
    },
    {
      "title": "File chooser style",
      "level": 3,
      "content": "See Qt#Configuration of Qt 5/6 applications under environments other than KDE Plasma\n\n"
    },
    {
      "title": "Wayland support",
      "level": 3,
      "content": "See GNOME/Troubleshooting#Cursor size or theme issues on Wayland.\n\nSee Wayland#Qt for generic instructions.\n\n"
    },
    {
      "title": "xdg-open scheme handler",
      "level": 3,
      "content": "If you want to use xdg-open for t.me links and receive an error not finding a handler for tg, run:\n\n```\n$ xdg-mime default org.telegram.desktop.desktop application/x-xdg-protocol-tg\n$ xdg-mime default org.telegram.desktop.desktop x-scheme-handler/tg\n```\n\n"
    },
    {
      "title": "Real-time priority",
      "level": 3,
      "content": "Note: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nIf you get the following error:\n\n```\n$ telegram-desktop\n```\n\n```\n[ALSOFT] (EE) Failed to set real-time priority for thread: Operation not permitted (1)\n```\n\nInstall realtime-privileges, add yourself to the realtime group and reboot. See Realtime process management#Configuring PAM for details.\n\n"
    },
    {
      "title": "HiDPI scaling",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nNote: **This article or section is out of date.** This article or section is out of date.\n\nThis article or section is out of date.\n\nIf you have Qt scaling enabled on your system, and the scaling factor is not an integer, you may encounter problems like pixelated images and icons. you may need to disable high-DPI scaling for Telegram separately.\n\nUnset QT_SCREEN_SCALE_FACTORS environment variable as follows:\n\n```\n$HOME/.local/share/applications/org.telegram.desktop.desktop\n```\n\n```\n...\nExec=env -u QT_SCREEN_SCALE_FACTORS telegram-desktop -- %u\n...\nDBusActivatable=false\n...\n```\n\nYou may need to perform Desktop entries#Update database of desktop entries afterwards.\n\nAlso consider disabling Default interface scale in Settings and enabling Enable precise High DPI scaling in Settings -> Advanced -> Experimental settings to avoid incorrect scaling when launch by xdg-open (e.g. opening tg:// link).\n\n"
    },
    {
      "title": "Audio backend",
      "level": 3,
      "content": "As Telegram makes use of OpenAL, it is possible to configure the audio settings by editing its config files, i.e. ~/.config/alsoft.conf, or the environment variables listed here.\n\nIn case sound is not working due to an invalid audio backend being used, it can be overwritten by setting the environment variable ALSOFT_DRIVERS or the drivers property in the [general] section of the OpenAL config. The drivers value \"pulse,\" for example would try pulseaudio first and then fallback to the default driver list.\n\n"
    },
    {
      "title": "Fcitx support for Qt 6 Telegram",
      "level": 3,
      "content": "Telegram-desktop is built against Qt 6 since 3.4.2-2. Users upgrading from an older version might notice Fcitx stop working for this application. To make it work again, install fcitx-qt6 or the fcitx-im group. If using Fcitx5, install fcitx5-im.\n\n"
    },
    {
      "title": "Changing the default file browser",
      "level": 3,
      "content": "Telegram Desktop uses the File Manager DBus Interface to open the file browser. The spec does not allow to choose the preferred one, ensure you have only one file browser installed.\n\nDo not confuse file browsers with file dialogs which are parts of toolkits and is covered by #File chooser style.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Arch Linux - Unofficial group for discussing everything about Arch Linux.\n- ArchWikiBot - Inline bot for searching through ArchWiki pages.\n- Planet Arch Linux & News - Channel with recent Planet Arch updates and Latest News in one place.\n- Arch Linux: Recent package updates - Channel with recent package updates in Arch Linux repositories.\n\n"
    }
  ]
}