{
  "title": "Telnet (Español)",
  "url": "https://wiki.archlinux.org/title/Telnet_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-02-09** \n\nTelnet es el protocolo tradicional para hacer conexiones remotas de consola a través de TCP. Telnet no es seguro y actualmente se utiliza principalmente para conectarse a equipos antiguos. El tráfico de Telnet se puede detectar fácilmente para obtener contraseñas y las conexiones nunca deben realizarse a través de una red que no sea de confianza, incluyendo Internet, a menos que esté encriptada con SSH o tunelizada a través de una VPN. Para una alternativa segura véase SSH.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "El paquete inetutils.\n\nUn servidor telnet puede configurarse con sockets de systemd o xinetd. Telnetd via systemd requiere solo el paquete inetutils. Para configurar un servidor telnet con xinetd, instale también xinetdAUR.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "Para habilitar las conexiones del servidor telnet en systemd, habilite telnet.socket (si desea que el servidor telnet arranque en cada inicio), e inicie telnet.socket para probar la conectividad.\n\nPara habilitar las conexiones del servidor telnet en xinetd, edite /etc/xinetd.d/telnet, cambie disable = yes a disable = no y reinicie el servicio xinetd.\n\nHabilite systemd xinetd service si desea iniciarlo en el momento del arranque.\n\n"
    },
    {
      "title": "Probando la configuración",
      "level": 3,
      "content": "Intente abrir una conexión telnet a su servidor:\n\n```\n$ telnet localhost\n```\n\nIntente un inicio de sesión root para ver si su configuración lo permite y las implicaciones de seguridad que eso conlleva.\n\nSi la sesión se desconecta antes de recibir un mensaje de inicio de sesión, intente instalar inetutils-gitAUR en lugar del inetutils actual y reinicie telnet.socket.\n\n"
    }
  ]
}