{
  "title": "Telnet (Русский)",
  "url": "https://wiki.archlinux.org/title/Telnet_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Telnet — это традиционный протокол для удалённого подключения к консоли через TCP, который в настоящее время используется в основном для подключения к устаревшему оборудованию. Telnet использует незашифрованное соединение, что небезопасно, поскольку соединения можно легко перехватить и даже манипулировать ими. При подключении через недоверенные сети используйте VPN для защиты соединения. По возможности рекомендуется использовать более безопасную альтернативу — SSH.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет inetutils.\n\nВ его состав входит telnet-клиент. Сервер telnet может быть настроен с помощью сокетов systemd или xinetd. telnetd через systemd требует только пакет inetutils. Чтобы настроить telnet-сервер с помощью xinetd, установите также xinetdAUR.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Чтобы включить telnet-сервер с помощью systemd, включите telnet.socket (если сервер должен запускаться при каждой загрузке системы) и запустите telnet.socket для проверки соединения.\n\nЧтобы включить telnet-сервер с помощью xinetd, отредактируйте /etc/xinetd.d/telnet, изменив в нём disable = yes на disable = no, и перезапустите службу xinetd.\n\nВключите systemd-службу xinetd для автоматического запуска во время загрузки системы.\n\n"
    },
    {
      "title": "Проверка",
      "level": 3,
      "content": "Попробуйте подключиться к telnet-серверу:\n\n```\n$ telnet localhost\n```\n\nПопробуйте войти под логином root, чтобы проверить, позволяет ли ваша конфигурация это сделать и какие последствия для безопасности это влечёт.\n\nЕсли сеанс отключается без запроса логина, попробуйте установить inetutils-gitAUR вместо текущего inetutils и перезапустить telnet-сервер.\n\n"
    }
  ]
}