{
  "title": "Termite (Português)",
  "url": "https://wiki.archlinux.org/title/Termite_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O Termite é um emulador de terminal mínimo baseado em VTE. É uma aplicação modal, similar ao Vim, com um modo de inserção e modo de seleção em que as combinações de teclas têm funções diferentes. Termite é baseado na biblioteca VTE.\n\nO arquivo de configuração permite alterar as cores e definir algumas opções. Termite suporta transparência, juntamente com as paletas de 256 cores e cores reais (16 milhões de cores). Tem uma aparência semelhante ao urxvt.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote termiteAUR.\n\n"
    },
    {
      "title": "Uso",
      "level": 2,
      "content": "o termite começa no modo de inserção por padrão. O texto pode ser selecionado usando o mouse ou usando o modo de seleção keys. No modo de inserção, Ctrl+Shift+c é usado para copiar o texto selecionado para a área de transferência do X, Ctrl+Shift+v para colar. Ctrl+Tab inicia a conclusão da rolagem e Ctrl+Shift+Up / Ctrl+Shift+Down role a tela para cima ou para baixo.\n\nCtrl+Shift+Space entra no modo de seleção, semelhante ao modo normal do vim. Muitos comandos são parecido com o do Vim, por exemplo v para o modo visual, Shift+v para o modo de linha visual, Ctrl+v para o modo de bloqueio visual, y para copiar (\"puxão\") texto selecionado, / e ? para pesquisar, w, b, ^, $ para movimento, e Escape para voltar ao modo de inserção.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "O Termite procura por arquivos de configurações em $XDG_CONFIG_HOME/termite/config, ~/.config/termite/config, $XDG_CONFIG_DIRS/termite/config e /etc/xdg/termite.cfg. O arquivo de configuração é usado para alterar opções como fonte, cores, dicas de janela etc. A sintaxe do arquivo de configuração é inspirada em Especificação de entrada do XDG Desktop(inglês) arquivos .desktop (inspirado na Microsoft Windows arquivos .ini), com três seções: opções, cores, e dicas.\n\nPara começar a personalizar o termite, copie primeiro o arquivo de exemplo base para o diretório inicial:\n\n```\n$ cp /etc/xdg/termite/config ~/.config/termite/config\n```\n\n"
    },
    {
      "title": "Fontes",
      "level": 3,
      "content": "As fontes são especificadas no formato font=<nome_da_fonte> <tamanho_da_fonte> debaixo da sessão options. <nome_da_fonte> é especificado de acordo com fontconfig, não use Xft. Use fc-list para ver quais fontes estão disponíveis no sistema (veja também Font configuration#Font paths).\n\n```\n~/.config/termite/config\n```\n\n```\n[options]\nfont = Monospace 9\nfont = xos4 Terminus 12px\nfont = Droid Sans Mono 8\n```\n\n"
    },
    {
      "title": "Cores",
      "level": 3,
      "content": "As cores consistem em um valor hexadecimal de 24 bits (por exemplo.: #4a32b1), ou um vetor rgba (por exemplo.: rgba(16, 32, 64, 0.5)). Propriedades válidas para cores são foreground, foreground_bold, foreground_dim, background, cursor, cursor_foreground, e colorN (onde N é um número inteiro de zero a 254; usado para atribuir um valor de cor de 24 bits ao terminal colorN).\n\nUma incrível coleção de esquemas de cores do termite pode ser encontrada aqui: Temas para o termite.\n\n```\n~/.config/termite/config\n```\n\n```\n[colors]\nforeground = #dcdccc\nbackground  = #3f3f3f\n```\n\n"
    },
    {
      "title": "Recarregar a configuração sem sair",
      "level": 3,
      "content": "Você pode recarregar o arquivo de configuração do Termite sem sair pressionando Ctrl+Shift+r de dentro do termite.\n\nComo alternativa, você pode enviar um USR1 sinal para todas as instâncias do termite:\n\n```\n$ killall -USR1 termite\n```\n\n"
    },
    {
      "title": "Transparência",
      "level": 2,
      "content": "A partir da versão 9, o Termite suporta transparência verdadeira por meio de definições de cores que especificam um valor de canal alfa [2]. Isso requer que um compositor esteja em execução, como o Picom ou o pacote xcompmgr. A maioria dos compositores não requer configuração especial para que o Termite use a transparência.\n\n```\n~/.config/termite/config\n```\n\n```\n[colors]\nbackground = rgba(63, 63, 63, 0.8)\n```\n\n```\n~/.picom.conf\n```\n\n```\nopacity-rule = [\n  \"0:_NET_WM_STATE@:32a *= '_NET_WM_STATE_HIDDEN'\"\n];\n```\n\n"
    },
    {
      "title": "Ctrl+Shift+t",
      "level": 3,
      "content": "Se a abertura de uma nova guia através de Ctrl+Shift+t falha com no directory uri set, carregue /etc/profile.d/vte.sh. Veja GNOME/Tips and tricks#New terminals adopt current directory.\n\nSe continuar a falhar, verifique se o hostname é válido. Consulte hostname(7).\n\n"
    },
    {
      "title": "Erro SSH remoto",
      "level": 3,
      "content": "Quando o Termite está usando a conexão SSH remota, às vezes ocorre o erro: Error opening terminal: xterm-termite. ou Open terminal failed: missing or unsuitable terminal: xterm-termite.\n\nEste erro pode ocorrer ao tentar editar o arquivo com vim ou nano. Para corrigir esse problema, você deve executar este comando no sistema remoto:\n\n```\n$ export TERM=xterm-color\n```\n\nComo alternativa, siga as instruções no manual do Termite GitHub. Isso permitirá que você use todos os recursos do Termite ao usar o SSH, enquanto o acima pode não. [3]\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Termite readme\n\n"
    }
  ]
}