{
  "title": "Terminal as a transparent wallpaper (Español)",
  "url": "https://wiki.archlinux.org/title/Terminal_as_a_transparent_wallpaper_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-16** \n\nHay dos formas principales de configurar un terminal de Linux para que funcione de manera transparente sobre un fondo de escritorio, sin bordes, sin barras de menú o sin barras de herramientas. Esto es muy popular entre los desarrolladores por su practicidad y frescura. Por ejemplo: puede usarse para ver el código fuente o para obtener un estado interactivo de proceso del sistema con htop. Algo así como conky, pero no exactamente.\n\n"
    },
    {
      "title": "Usar Tilda",
      "level": 2,
      "content": "Tilda es un emulador de terminal desplegable, altamente personalizable y basado en GTK, inspirado en terminales que aparecen en juegos como Quake, Doom y Half-Life, donde el terminal no tiene borde y se oculta del escritorio hasta que se pulsa un atajo de teclado. Para conseguir el aspecto deseado, edite la configuración de la siguiente manera:\n\n1. En la pestaña General, desmarque Siempre visible.\n1. En Apariencia, puede editar la altura y la anchura a su gusto, pero asegúrese de marcar Activar transparencia y hacer que el Nivel de transparencia sea del 100%.\n1. En la pestaña Colores, escoja Verde sobre negro o Personalizar.\n1. En Desplazamiento, seleccione Desactivado.\n\n"
    },
    {
      "title": "Openbox, Compiz y similares",
      "level": 3,
      "content": "Es relativamente sencillo crear un terminal en el escritorio con gestores de ventanas versátiles como Openbox. Tilda es altamente configurable y podría ser su terminal de elección. Haga clic con el botón derecho del ratón en Tilda y configure el tamaño según sus necesidades, luego establezca la transparencia al 100%, desmarque la opción de iniciar Tilda oculto.\n\nAhora sólo queda configurar Tilda como se muestra a continuación según el gestor de ventanas. Para Compiz, esto se hace con el plugin \"Rules for Windows\", para Openbox, añada a la sección \"applications\" de rc.xml las siguientes líneas:\n\n```\n<application name=\"tilda\">\n<layer>below</layer>\n</application>\n```\n\nAhora ya dispone de un terminal transparente del tamaño que elija en su escritorio, que no aparecerá en la lista de tareas y estará permanentemente por debajo.\n\n"
    },
    {
      "title": "Gnome",
      "level": 3,
      "content": "Se propone instalar el paquete devilspie, el cual proporciona control sobre la colocación y el comportamiento de la ventana de la terminal. Se puede configurar para detectar las ventanas a medida que se crean, y hacer coincidir la ventana con un conjunto de reglas. Si la ventana coincide con las reglas, puede realizar una serie de acciones en esa ventana.\n\nSiga los siguientes pasos para configurar devilspie para captar el emulador de terminal sobre la marcha y configurar el estilo como desee:\n\n```\n~/.devilspie/DesktopConsole.ds\n```\n\n```\n(if\n(matches (window_name) \"DesktopConsole_1\")\n(begin\n(stick)\n(below)\n(undecorate)\n(skip_pager)\n(skip_tasklist)\n(wintype \"dock\")\n(geometry \"+240+250\")\n(geometry \"954×680\")\n)\n)\n```\n\nPara obtener más detalles, véase la lista completa de opciones.\n\nEdite el Perfil: para conseguir el aspecto deseado es necesario editar las configuraciones por defecto:\n\nEn la pestaña General, desmarque \"Mostrar la barra de menús por defecto en las nuevas terminales\".\n\nEn la pestaña Colores, elija \"Verde sobre negro\" (elija lo que desee, es sólo una recomendación).\n\nEn la pestaña Efectos, elija \"Fondo transparente\". Asegúrese de que el desplazamiento se establece en \"Ninguno\".\n\nEn la pestaña Desplazamiento, seleccione \"Desactivado\".\n\nNavegue a Sistemas > Preferencias > Sesiones. Añada una nueva sesión usando el signo +. En la primera se pondrá, \"devilspie\", tanto en el nombre como en la orden. En la segunda sesión se pondrá \"gnome-terminal\" en el nombre y \"gnome-terminal --window-with-profile=DesktopConsole_1 --title=DesktopConsole_1\", en la orden. Aquí básicamente se está llamando a gnome-terminal con el perfil personalizado que creamos anteriormente.\n\nPuede personalizarlo aún más para adaptarlo a sus necesidades y estilo, incluso puede tener más de un terminal. Todo depende de la imaginación de cada uno.\n\n"
    },
    {
      "title": "Xfce4",
      "level": 3,
      "content": "Al usar wmctrl, esto es lo que se puede lograr con las opciones de línea de comandos por defecto de xfce4-terminal. El script de ejemplo que se muestra a continuación es bastante autoexplicativo...\n\n```\n#!/bin/bash\nxfce4-terminal --hide-borders --hide-toolbar --hide-menubar --title=desktopconsole --geometry=130x44+0+0 &\nsleep 5\nwmctrl -r desktopconsole -b add,below,sticky\nwmctrl -r desktopconsole -b add,skip_taskbar,skip_pager\n```\n\nNombrando el terminal con --title se puede identificar fácilmente su ventana y añadir/quitar propiedades a través de wmctrl. A la hora de establecer el tamaño y la posición con la opción --geometry, se sigue esta regla: (Ancho-en-caracteres)x(altura-en-caracteres)+x+y, siendo x e y la posición en píxeles desplazada desde la esquina superior izquierda de la pantalla (que comienza en +0+0). La transparencia y desactivación de la barra de desplazamiento pueden establecerse a través del menú preferencias del terminal, en las pestañas apariencia y general. Una vez que el usuario haya adaptado el script a sus necesidades, puede simplemente marcarlo como ejecutable (o hacer \"chmod a+x /ruta/al/script.sh\") y añadirlo al inicio en el Menú Aplicaciones > Configuración > Sesión e Inicio > Inicio automático de aplicaciones.\n\n"
    }
  ]
}