{
  "title": "TerraTec Aureon 7.1 (Русский)",
  "url": "https://wiki.archlinux.org/title/TerraTec_Aureon_7.1_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Terratec Aureon 7.1 USB - это бюджетная внешняя звуковая карта, которая поддерживает оптический и цифровой выход посредством S/PDIF с полной поддержкой объемного звука 5.1/7.1. Для использования этой карты установите ALSA, который её поддерживает. Настройка осуществляется по шагам:\n\n"
    },
    {
      "title": "Настройка карты как устройства, используемого по умолчанию",
      "level": 3,
      "content": "Если вы используете несколько звуковых карт, то вам необходимо установить карту Terratec как устройство по умолчанию. Создайте следующий файл\n\n```\n/etc/modprobe.d/alsa.conf\n```\n\n```\noptions snd slots=snd_usb_audio\n```\n\nДля применения изменений может потребоваться перезагрузка операционной системы.\n\n"
    },
    {
      "title": "Активация управления громкостью звука",
      "level": 3,
      "content": "Эта звуковая карта не имеет аппаратного управления громкостью звука, по этой причине вам понадобится создать свою программу, которая возьмет эти функции на себя. Создайте следующий файл в вашей домашней директории\n\n```\n.asoundrc\n```\n\n```\npcm.softvol {\n        type softvol\n        slave {\n                pcm \"dmix\"\n        }\n        control {\n                name \"Master\"\n                card 0\n        }\n}\n\npcm.!default {\n        type plug\n        slave.pcm \"softvol\"\n}\n```\n\nВновь перезапустите alsa, затем откройте любой музыкальный проигрыватель, запустите этот файл и закройте проигрыватель. Проверьте alsamixer, в нем должен отобразиться ползунок управления громкостью Master.\n\n"
    },
    {
      "title": "Горячие клавиши",
      "level": 3,
      "content": "Звуковая карта может управляться горячими клавишами для изменения уровня громкости и отключения звука. Для перехвата кодов клавиш установите Xbindkeys и используйте следующий конфигурационный файл:\n\n```\n.xbindkeysrc\n```\n\n```\n#Volume up\n\"amixer set 'Master' 5+\"\n    m:0x0 + c:123\n    XF86AudioRaiseVolume\n\n#Volume down\n\"amixer set 'Master' 5-\"\n    m:0x0 + c:122\n    XF86AudioLowerVolume\n\n#Mute\n\"/media/disk/programs/mute.sh\"\n    m:0x0 + c:121\n    XF86AudioMute\n```\n\nКак вы могли заметить, alsamixer не подерживает отключение громкости для данной карты, поэтому для этих целей вы можете воспользоваться простым скриптом mute.sh, который записывает текущее значение громкости в файл volume.txt. Убедитесь, что верно указали путь до него в скрипте.\n\n```\n#!/bin/bash\nvar=$(amixer get Master | grep \"Front Left:\")\nvar=$(echo \"$var\" | sed -ne 's/^[^[]*\\[\\([^]]*\\)\\].*/\\1/p')\nif [ $var == \"0%\" ]\nthen\n        volume=$(cat volume.txt)\n        amixer set 'Master' $volume\nelse\n        rm volume.txt\n        echo $var > volume.txt\n        amixer set 'Master' 0%\nfi\n```\n\n"
    },
    {
      "title": "Настройка mplayer для объемного звучания (дополнительно)",
      "level": 3,
      "content": "Добавьте следующие настройки кодека для mplayer:\n\n```\n.mplayer/config\n```\n\n```\nac=hwac3,hwdts,a52,dts,\nao=alsa\n```\n\nKodi, который также может быть использован для воспроизведения медиа, как и большинство приемников, не поддерживает кодек формата AAC. Он преобразует его в общий формат (вероятно AC3) в режиме реально времени. Таким образом вы сможете воспроизводить большинство медиафайлов с объемным звучанием. Kodi также обладает простой системой настройки с использованием графического интерфейса.\n\n"
    },
    {
      "title": "Советы",
      "level": 3,
      "content": "Для изменения уровня громкости с помощью alsamixer и горячих клавиш, используйте следующую команду (пример): amixer set 'Master' 5+.\n\n"
    }
  ]
}