{
  "title": "TeXLive (Italiano)",
  "url": "https://wiki.archlinux.org/title/TeXLive_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- TeX Live/FAQ\n- TeX Live/CJK\n- Tectonic\n\nAccording to Wikipedia:\n\nTeX Live includes:\n\n- many TeX engines, such as: pdfTeX XeTeX LuaTeX\n- basic macro packages (called formats in TeX parlance), such as: LaTeX ConTeXt\n- many user-produced packages\n\n- pdfTeX\n- XeTeX\n- LuaTeX\n\n- LaTeX\n- ConTeXt\n\nAlternatives to TeX Live include MikTex and Tectonic, they come with a minimal install, downloading the necessary packages on the go.\n\n"
    },
    {
      "title": "Arch-packaged TeX Live vs native TeX Live",
      "level": 2,
      "content": "There are multiple ways to install TeX Live. While a snapshot of TeX Live should be available from the Arch Linux package repositories (as described below), that snapshot is in most cases updated only once a year. In contrast, TeX Live itself is a rolling release distribution, based on the model of the user having to upgrade once a year, but with individual package upgrades available on a sub-daily basis.\n\nThe advantages of having a native and up-to-date TeX Live installation include having access to the latest features and bug fixes and to the relevant documentation. While it is possible to upgrade or install an individual package without having native TeX Live (see TEXMFLOCAL and TEXMFHOME), this requires extra care - it is necessary to ensure that the versions of all relevant packages are mutually compatible.\n\n"
    },
    {
      "title": "Installation",
      "level": 4,
      "content": "See the quickinstall documentation, and, if necessary, the full documentation. The process boils down to:\n\n1. downloading the netinstall archive\n1. unpacking the archive and changing to the newly created directory\n1. running the install script, perl ./install-tl, which starts an interactive installation procedure within a text interface setting the wanted installation path or paths optionally, choosing a subset of the package collections provided by TeX Live optionally, choosing the Letter paper size as the default, as opposed to A4 waiting for everything to download\n1. As the install script will notify you at the end of the process, it's necessary to add the TeX Live installation to the system executable and documentation paths: PATH, MANPATH, INFOPATH. The install script prints the exact additions that are required before exiting.\n\n1. setting the wanted installation path or paths\n1. optionally, choosing a subset of the package collections provided by TeX Live\n1. optionally, choosing the Letter paper size as the default, as opposed to A4\n1. waiting for everything to download\n\nOr, alternatively, install the texlive-installerAUR package and run install-tl while following above procedure.\n\n"
    },
    {
      "title": "Updating",
      "level": 4,
      "content": "See the tlmgr documentation, tlmgr update --all upgrades all packages from the collections chosen during the installation. It will also install any packages that are newly added to an installed TeX Live collection.\n\nOnce a year, when there's a new TeX Live release, tlmgr update --all will fail and it will be necessary to install TeX Live anew.\n\n"
    },
    {
      "title": "Arch-packaged TeX Live",
      "level": 3,
      "content": "- The texlive group contains most TeX Live packages, categorised based on upstream collections (see [1]). texlive-basic, the core installation, based on the medium upstream install scheme. The package includes pacman hooks to automate mktexlsr, fmtutil and updmap. texlive-latex contains essential LaTeX packages. (For instance, if you intend to use pdflatex, then you need this package). texlive-latexrecommended and texlive-latexextra contain many useful LaTeX packages, such as polyglossia, amsmath and graphicx. texlive-fontsrecommended contains essential fonts (including the default Latin Modern) texlive-fontsextra contains additional fonts, which can be viewed on the LaTeX Font Catalogue. texlive-xetex and texlive-luatex contain packages for XeTeX and LuaTeX respectively. texlive-bibtexextra contains the BibLaTeX package and additional BibTeX styles and bibliography databases. texlive-mathscience contains essential packages for mathematics, natural sciences and computer science.\n- The texlive-lang group contains packages providing character sets and features for languages with non-Latin characters.\n- biber provides an alternative bibliography processing backend for BibLaTeX.\n\n- texlive-basic, the core installation, based on the medium upstream install scheme. The package includes pacman hooks to automate mktexlsr, fmtutil and updmap.\n- texlive-latex contains essential LaTeX packages. (For instance, if you intend to use pdflatex, then you need this package).\n- texlive-latexrecommended and texlive-latexextra contain many useful LaTeX packages, such as polyglossia, amsmath and graphicx.\n- texlive-fontsrecommended contains essential fonts (including the default Latin Modern)\n- texlive-fontsextra contains additional fonts, which can be viewed on the LaTeX Font Catalogue.\n- texlive-xetex and texlive-luatex contain packages for XeTeX and LuaTeX respectively.\n- texlive-bibtexextra contains the BibLaTeX package and additional BibTeX styles and bibliography databases.\n- texlive-mathscience contains essential packages for mathematics, natural sciences and computer science.\n\nNote that some tools in texlive-binextra have optional dependencies which are not automatically installed. For example, latexindent depends on perl-yaml-tiny and perl-file-homedir.\n\n```\n$ pacman -F soul.sty\n```\n\n```\nextra/texlive-plaingeneric 2023.66594-19 (texlive)\n    usr/share/texmf-dist/tex/generic/soul/soul.sty\n```\n\nWhenever there is a need to install a TeX package available on CTAN, run the following to determine whether it is included in an Arch texlive- package:\n\n```\n$ tlmgr info ctan_package_name | grep collection\n```\n\nThis will potentially list the name of a TeX Live collection which corresponds to an Arch texlive- package (also check the texlive group to confirm whether such package exists). For instance, an output of collection: collection-plaingeneric means that TeX package is included in texlive-plaingeneric.\n\nAlternatively, tlmgr can be used to manually install a single TeX package (see below).\n\n"
    },
    {
      "title": "tllocalmgr",
      "level": 4,
      "content": "The tllocalmgr utility, provided by tllocalmgrAUR, lets you install (and update) packages from CTAN as pacman packages. See its usage (-h) for details.\n\n"
    },
    {
      "title": "tlmgr",
      "level": 4,
      "content": "With texlive-basic the tlmgr utility should work out of the box. If you still have issues or you're using the old package texlive-core then you should follow the following procedure in order to make tlmgr work.\n\n- While texlive-basic provides the tlmgr script in TEXMFDIST, it is broken (FS#74404). You can fix it as described below.\n- The texconfig(1) command is mostly broken because it partially depends on tlmgr (FS#59094). The interactive mode of texconfig requires dialog.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nThe tlmgr utility is the standard way of installing and updating packages from CTAN. It requires minor fixes as follows:\n\nFirst, edit TEXMFDIST/scripts/texlive/tlmgr.pl and replace $Master = \"$Master/../..\"; with $Master = \"${Master}/../../..\";. The path prefix TEXMFDIST is not a predefined environment variable, it is defined below in this article. Replace it with the correct value.\n\nThis can also be done from the command line with:\n\n```\n# sed -i 's/\\$Master = \"\\$Master\\/..\\/..\";/\\$Master = \"\\$Master\\/..\\/..\\/..\";/' \"$TEXMFDIST/scripts/texlive/tlmgr.pl\"\n```\n\nCreate an alias for the perl script (which you can add in your shell init file).\n\n```\nalias tlmgr=\"$TEXMFDIST/scripts/texlive/tlmgr.pl --usermode\"\n```\n\nNow you can initialize it in user mode (which will use ~/texmf as install prefix):\n\n```\n$ tlmgr init-usertree\n```\n\nSet your preferred mirror. You need to append /systems/texlive/tlnet to the path of the mirror. For example:\n\n```\n$ tlmgr option repository http://mirrors.rit.edu/CTAN/systems/texlive/tlnet\n```\n\nNow you can install CTAN packages as usual:\n\n```\n$ tlmgr install package_name\n```\n\n"
    },
    {
      "title": "Package documentation",
      "level": 4,
      "content": "The packages in the official repositories do not contain the documentation or source files of font/macro packages.\n\nFor offline access with texdoc, install the whole TeX Live documentation and source files with texlive-doc.\n\nYou can also access the documentation online at:\n\n- https://tug.org/texlive/Contents/live/doc.html\n- https://ctan.org/ – the central place for all kinds of material around TeX\n- https://texdoc.org/ (http://texdoc.org/pkg/packagename directly yields the relevant PDF)\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "See the following resources:\n\n- Wikibooks:LaTeX\n- The Not So Short In­tro­duc­tion to LaTeX 2ε\n- Getting to Grips with LaTeX – Andrew Roberts\n- The TeX FAQ\n\nSome use a TeX editor for creating documents.\n\n"
    },
    {
      "title": "High-level wrappers for compiling documents",
      "level": 3,
      "content": "It almost always makes more sense to use a higher-level automation tool such as latexmk(1) (used by Overleaf [3]), rubber(1) or arara(1), instead of calling things like pdflatex(1) directly, mostly because lower-level tools need to be run multiple times in general for completely compiling a single document.\n\n"
    },
    {
      "title": "texmf trees and Kpathsea",
      "level": 3,
      "content": "texmf trees (texmf stands for TeX and Metafont) should follow the TeX Directory Structure, or files may not be found.[4]\n\nTeX Live uses the Kpathsea library to lookup paths by filename across multiple texmf trees and the current working directory.\n\nKpathsea searches the following variables in the reverse order (later trees override earlier ones).\n\nTable content:\nVariables | Arch default 1) | Used by [5]\nTEXMFDIST | /usr/share/texmf-dist | files of the original distribution\nTEXMFLOCAL | /usr/local/share/texmf:/usr/share/texmf | administrators for system-wide installation of additional or updated macros, fonts, etc.\nTEXMFSYSVAR | /var/lib/texmf | updmap and fmtutil (user mode) to store (cached) runtime data\nTEXMFSYSCONFIG | /etc/texmf | updmap and fmtutil (user mode) to store modified configuration data\nTEXMFHOME | ~/texmf | users for their own individual installations of additional or updated macros, fonts, etc.\nTEXMFVAR | ~/.texlive/texmf-var | updmap and fmtutil (sys mode) to store (cached) runtime data\nTEXMFCONFIG | ~/.texlive/texmf-config | updmap and fmtutil (sys mode) to store modified configuration data\nTEXMFCACHE | $TEXMFSYSVAR;$TEXMFVAR | ConTeXt MkIV and LuaLaTeX to store (cached) runtime data\n\nKpathsea provides the kpsewhich(1) command to lookup paths. When run with the --var-brace-value=VARIABLE argument it can also print the values of variables.\n\nKpathsea uses filename databases (ls-R) to speed up searches in system-wide texmf trees (configured with the TEXMFDBS variable). This means that when system-wide file trees are changed, mktexlsr(1) or texhash (a symlink) need to be run as root. Fortunately the texlive-basic automates this with a pacman hook targeting all default system-wide texmf trees but /usr/local/share/texmf.[7] So as long as you install system-wide packages via pacman you should not need to run mktexlsr or texhash at all.\n\n"
    },
    {
      "title": "Changing default paper size",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nIt is currently impossible to set the default page size using the texlive tools, because they do not work with the standard Arch package.\n\nUsually, you would run texconfig or tlmgr, which are also capable of changing other useful settings.\n\nYou can edit the configuration files as follows.\n\n- To set the paper size for the pdftex family of commands (pdftex, pdflatex, etc) edit /etc/texmf/tex/generic/tex-ini-files/pdftexconfig.tex file.\n\nwhich can also be discovered by running kpsewhich pdftexconfig.tex. Change the two lines that specify the pdfpageheight and pdfpagewidth. For example, to use letter size, change\n\n```\n\\pdfpageheight = 297 true mm\n\\pdfpagewidth  = 210 true mm\n```\n\nto\n\n```\n\\pdfpageheight = 11 true in\n\\pdfpagewidth  = 8.5 true in\n```\n\nUnfortunately, this will not have any effect until the binary .fmt files are rebuilt. You can do this with fmtutil-sys. Re-installing texlive-bin with pacman will also do this for you.\n\n- For dvips, you can use the -t option to specify the paper size: dvips -t letter foo.dvi. To change the default, edit /etc/texmf/dvips/config/config.ps file.\n\nwhich can also be discovered with kpsewhich config.ps. The end of this file has sections that list all the paper sizes that dvips knows about. The first listed paper size will be the default. Just move the one that you want to be the default to the top of the list. The behavior of dvips will be affected as soon as the file file is changed.\n\n"
    },
    {
      "title": "Making fonts available to Fontconfig",
      "level": 3,
      "content": "By default, the fonts that come with the various TeX Live packages are not automatically available to Fontconfig. If you want to use them with, say XeTeX or LibreOffice, the easiest approach is to create a symlink in the font directory to a subdirectory in your user's font path. Run the following for an OpenType font:\n\n```\n$ ln -s /usr/share/texmf-dist/fonts/opentype/public/some_fonts_you_want ~/font_path/OTF/\n```\n\nTo make them available to fontconfig, run:\n\n```\n$ fc-cache ~/font_path\n$ mkfontscale ~/font_path/OTF\n$ mkfontdir ~/font_path/OTF\n```\n\nSimilar steps follow for TrueType fonts and Type 1 fonts. In the lines above, substitute opentype with truetype or type1 and substitute OTF with TTF or Type1.\n\nAlternatively, texlive-basic contains the file /usr/share/fontconfig/conf.avail/09-texlive-fonts.conf that contains a list of the font directories used by TeX Live. You can use this file with:\n\n```\n# ln -s /usr/share/fontconfig/conf.avail/09-texlive-fonts.conf /etc/fonts/conf.d/09-texlive-fonts.conf\n```\n\nAnd then update fontconfig:\n\n```\n$ fc-cache && mkfontscale && mkfontdir\n```\n\n- This may cause conflicts with XeTeX/XeLaTeX if the same fonts are (separately) available to both TeX and Fontconfig, i.e. if multiple copies of the same font are available on the search path.\n- Type 1 fonts will not be available in LibreOffice 5.3 and later.\n\n"
    },
    {
      "title": "Updating babelbib language definitions",
      "level": 3,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nIf you have the very specific problem of babelbib not having the latest language definitions that you need, and you do not want to recompile everything, you can get them manually from https://www.tug.org/texlive/devsrc/Master/texmf-dist/tex/latex/babelbib/ and put them in /usr/share/texmf-dist/tex/latex/babelbib/. For example:\n\n```\n$ cd /usr/share/texmf-dist/tex/latex/babelbib/ \n# wget https://www.tug.org/texlive/devsrc/Master/texmf-dist/tex/latex/babelbib/romanian.bdf\n# wget [...all-other-language-files...]\n# wget https://www.tug.org/texlive/devsrc/Master/texmf-dist/tex/latex/babelbib/babelbib.sty\n```\n\nAfterwards, you need to run texhash to update the TeX database:\n\n```\n# texhash\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- TeX Live documentation\n- Question and answer sites TeX - LaTeX Stack Exchange TopTeX (TeX site on TopAnswers)\n- Detexify LaTeX handwritten symbol recognition\n\n- TeX - LaTeX Stack Exchange\n- TopTeX (TeX site on TopAnswers)\n\n"
    }
  ]
}