{
  "title": "The Arch Way (Ελληνικά)",
  "url": "https://wiki.archlinux.org/title/The_Arch_Way_(%CE%95%CE%BB%CE%BB%CE%B7%CE%BD%CE%B9%CE%BA%CE%AC)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Αυτή η σελίδα στοχεύει στην απομυθοποίηση κοινών όρων που χρησιμοποιούνται στην κοινότητα του Arch Linux. Είστε ελεύθεροι να προσθέσετε ή να τροποποιήσετε οποιονδήποτε όρο, αλλά παρακαλώ κάντε χρηση την επιλογή επεξεργασίας της συγκεκριμένης ενότητας. Αν αποφασίσετε να κάνετε προσθήκη, τοποθετήστε την κατά αλφαβητική σειρά.\n\n"
    },
    {
      "title": "ABS",
      "level": 2,
      "content": "ABS είναι τα αρχικά του Arch build system.\n\n"
    },
    {
      "title": "Arch Linux",
      "level": 2,
      "content": "Το Arch μπορεί να αναφέρετε ως:\n\n- Arch Linux\n- Arch (το Linux εννοείται)\n- archlinux (όνομα UNIX)\n\nΤα Archlinux, ArchLinux, archLinux, aRcHlInUx, etc. είναι όλα παράξενες παραλλαγές.\n\nΕπίσημα, το 'Arch' στο \"Arch Linux\" προφέρεται ως /ɑːrtʃ/ όπως στην λέξη \"archer\"/bowman, ή \"archnemesis\" και όχι όπως στις λέξεις \"ark\" ή \"archangel\".\n\n"
    },
    {
      "title": "Arch Linux Archive",
      "level": 2,
      "content": "To Arch Linux Archive (a.k.a ALA) γνωστό παλαιότερα και ως Arch Linux Rollback Machine (a.k.a ARM) αποθηκεύει τα στιγμυότυπα των επίσημων αποθετηρίων, εικόνες ISO και bootstrap tarballs διαχρονικά.\n\n"
    },
    {
      "title": "AUR",
      "level": 2,
      "content": "Το Arch User Repository (AUR) είναι ένα αποθετήριο καθοδηγούμενο από την κοινότητα χρηστών του Arch. Περιέχει περιγραφές πακέτων (PKGBUILDs) που επιτρέπουν την μεταγλώττιση ενός πακέτου από τον πηγαίο κώδικα με το makepkg και μετά την εγκατάστασή του με τον pacman. Το AUR δημιουργήθηκε για να οργανώσει, να διαμοιράσει νέα πακέτα της κοινότητας και να επισπεύσει την εισαγωγή δημοφιλών πακέτων στο extra repository.\n\nΈνας μεγάλος αριθμός νέων πακέτων που εισάγονται στα επίσημα αποθετήρια ξεκινούν από το AUR. Στο AUR, οι χρήστες μπορούν να συνεισφέρουν με τα δικά τους builds πακέτων (PKGBUILD και συναφή αρχεία). Η AUR κοινότητα δίνει δυνατότητα ψηφοφορίας υπέρ ή κατά πακέτων του AUR. Αν ένα πακέτο γίνει δημοφιλές, υπό την προϋπόθεση ότι έχει μία συμβατή άδεια και καλή τεχνική πακεταρίσματος, μπορεί να εισέλθει στο αποθετήριο extra (απευθείας προσβάσιμο από τον pacman ή στο ABS).\n\nΜπορείτε να έχετε πρόσβαση στο Arch Linux User Community Repository εδώ.\n\n"
    },
    {
      "title": "bbs",
      "level": 2,
      "content": "Bulletin board system, αλλά στην περίπτωση του Arch είναι απλά ένα φόρουμ υποστήριξης που βρίσκεται εδώ.\n\n"
    },
    {
      "title": "core/[core]",
      "level": 2,
      "content": "Το αποθετήριο core περιέχει πακέτα απολύτως απαραίτητα για το σύστημα Arch Linux. Το core έχει τα πάντα που χρειάζονται για ένα σύστημα που λειτουργεί με command-line.\n\n"
    },
    {
      "title": "custom/user repository",
      "level": 2,
      "content": "Anyone can create a repository and put it online for other users. To create a repository, you need a set of packages and a pacman-compatible database file for your packages. Host your files online and everyone will be able to use your repository by adding it as a regular repository.\n\nSee Custom local repository.\n\n"
    },
    {
      "title": "Developer",
      "level": 2,
      "content": "Half-gods working to improve Arch for no financial gain. Developers are outranked only by our gods, Judd Vinet and Aaron Griffin, who in turn are outranked by tacos.\n\n"
    },
    {
      "title": "extra/[extra]",
      "level": 2,
      "content": "Arch's core package set is fairly streamlined, but we supplement this with a larger, more complete extra repository. This repository is constantly growing with the help of packages submitted from our strong community. This is where desktop environments, window managers and common programs are found.\n\n"
    },
    {
      "title": "initramfs/initrd",
      "level": 2,
      "content": "Δείτε mkinitcpio.\n\n"
    },
    {
      "title": "KISS",
      "level": 2,
      "content": "Το ακρωνύμιο του Keep It Simple, Stupid. H Απλότητα είναι μία κύρια αρχή, την οποία προσπαθεί να πετύχει το Arch Linux.\n\n"
    },
    {
      "title": "makepkg",
      "level": 2,
      "content": "makepkg will build packages for you. makepkg will read the metadata required from a PKGBUILD file. All it needs is a build-capable Linux platform, curl, and some build scripts. The advantage to a script-based build is that you only really do the work once. Once you have the build script for a package, you just need to run makepkg and it will do the rest: download and validate source files, check dependencies, configure the build time settings, build the package, install the package into a temporary root, make customization, generate meta-info, and package the whole thing up for pacman to use.\n\n"
    },
    {
      "title": "namcap",
      "level": 2,
      "content": "Το namcap είναι ένα βοηθητικό πρόγραμμα ανάλυσης πακέτων που αναζητεί προβλήματα σε πακέτα του Arch Linux ή σε αρχεία PKGBUILD. Μπορεί να εφαρμόσει κανόνες στην λίστα αρχείων, στα αρχεία καθαυτά ή στα επιμέρους PKGBUILDs.\n\nΟι κανόνες επιστρέφουν λίστα μηνυμάτων. Το κάθε μήνυμα μπορεί να έχει έναν από τους ακόλουθους τύπους: σφάλμα, προειδοποίηση ή πληροφορία (θεωρήστε τα σαν σημειώσεις ή σχόλια). Τα σφάλματα (αναπαρίστανται ως 'E:') είναι τα πράγματα εκείνα τα οποία το namcap είναι βέβαιο ότι είναι λάθος και πρέπει να διορθωθούν. Οι προειδοποίησεις (αναπαρίστανται ως 'W:') είναι πράγματα που το namcap θεωρεί ότι πρέπει να τροποποιηθούν, αλλά αν γνωρίζετε τι κάνετε μπορείτε να τα παραβλέψετε. Οι πληροφορίες (αναπαρίστανται ως 'I:') εμφανίζονται μόνο όταν χρησιμοποιείτε το επιχείρημα info. Τα μηνύματα πληροφοριών δίνουν στοιχεία που μπορεί να είναι χρήσιμα, αλλά δεν χρειάζονται αλλαγή.\n\n"
    },
    {
      "title": "package",
      "level": 2,
      "content": "Δείτε pacman#Installing packages.\n\n"
    },
    {
      "title": "Package maintainer",
      "level": 2,
      "content": "Ο ρόλος ενός συντηρητή πακέτων είναι η ενημέρωση πακέτων με τις νέες τους εκδόσεις, όταν αυτές γίνονται διαθέσιμες upstream, η διευθέτηση ερωτήσεων υποστήριξης και η επίλυση bugs που σχετίζονται με τα συγκεκριμένα πακέτα. Ο όρος ισχύει για:\n\n- Προσωπικό του Arch, προηγουμένως αποκαλούμενο Trusted Users (TU) που συντηρούν πακέτα στο αποθετήριο extra και επιβλέπουν το AUR. Εκλέγονται με ένα πλειοψηφικό σύστημα ψηφοφορίας από υπάρχοντες συντηρητές πακέτων και ακολοθούν τις οδηγίες AUR Package Maintainer guidelines και κανονισμούς συντήρησης πακέτων.\n- Developers που διατηρούν πακέτα στα official repositories (core ειδικότερα).\n- Όλοι οι χρήστες που διατηρούν PKGBUILDs στο AUR.\n\nΟ συντηρητής ενός πακέτου είναι το άτομο υπεύθυνο για το πακέτο. Οι προηγούμενοι συντηρητές πρέπει να απαριθμούνται ως συνεισφέροντες στο PKGBUILD μαζί με όλους όσους έχουν συνεισφέρει στο πακέτο.\n\n"
    },
    {
      "title": "pacman",
      "level": 2,
      "content": "Δείτε pacman.\n\n"
    },
    {
      "title": "PKGBUILD",
      "level": 2,
      "content": "Τα PKGBUILDs είναι μικρά scripts που χρησιμοποιούνται στο χτίσιμο των πακέτων του Arch Linux. Δείτε την ενότητα Creating packages για περισσότερες λεπτομέρειες.\n\n"
    },
    {
      "title": "Αποθετήριο (repo)",
      "level": 2,
      "content": "Ένα αποθετήριο έχει ήδη μεταγλωτισμένα πακέτα από ένα ή (συνήθως) περισσότερα PKGBUILDs. Τα Official repositories διαχωρίζονται σε διαφορετικά τμήματα για ευκολία συντήρησης. Ο Pacman χρησιμοποιεί αυτά τα αποθετήρια για αναζήτηση πακέτων και εγκατάστασή τους. Ένα αποθετήριο μπορεί να είναι τοπικό (π.χ στον υπολογιστή σας) ή απομακρυσμένο (π.χ τα πακέτα λαμβάνονται πριν εγκατασταθούν).\n\n"
    },
    {
      "title": "RTFM",
      "level": 2,
      "content": "RTFM είναι τα αρχικά του \"Read The Friendly Manual\". Αυτό το απλό μήνυμα είναι η απάνηση σε πολλούς νέους χρήστες του Linux/Arch που ρωτούν για τις λειτουργίες ενός προγράμματος όταν αυτές είναι σαφώς ορισμένες στο εγχειρίδιο αυτού.\n\nΑυτό το ακρωνύμιο είναι μια συμβουλή και όχι προσβολή. Χρησιμοποιείται συχνά όταν ένας χρήστης αποτυγχάνει να κάνει οποιαδήποτε προσπάθεια εύρεσης λύσης στο πρόβλημα μόνος του. Αν κάποιος σας το πει, δεν προσπαθεί να σας προσβάλει. Απλά αισθάνεται απογοητευμένος με την έλλειψη προσπάθειας.\n\nΤο καλύτερο πράγμα που μπορείτε να κάνετε είναι να διαβάσετε το εγχειρίδιο. Για το διάβασμα μιας σελίδας του εγχειριδίου ενός προγράμματος με το όνομα PROGRAM-NAME, πληκτρολογήστε την εξής εντολή στο τερματικό: man PROGRAM-NAME.\n\nΑν δεν βρίσκετε την απάντηση της ερώτησης σας στο εγχειρίδιο του προγράμματος, υπάρχουν περισσότεροι τρόποι εύρεσης της απάντησης. Μπορείτε να κάνετε αναζήτηση:\n\n- στο wiki\n- στο φόρουμ\n- στις λίστες αλληλογραφίας\n- στο διαδίκτυο\n\n"
    },
    {
      "title": "Αποθετήρια testing",
      "level": 2,
      "content": "Υπάρχουν αποθετήρια όπου μείζονα πακέτα/ενημερώσεις διατηρούνται πριν την έκδοσή τους στα κύρια αποθετήρια, έτσι ώστε να ελεγχθούν για bugs και να βρεθούν προβλήματα ενημερώσεων. Είναι απενεργοποιημένα ως προεπιλογή, αλλά μπορούν να ενεργοποιηθούν στο /etc/pacman.conf.\n\n"
    },
    {
      "title": "The Arch Way",
      "level": 2,
      "content": "Ένας ανεπίσημος όρος που χρησιμοποιείται παραδοσιακά για να αναφερθεί στις κύριες αρχές του Arch Linux.\n\n"
    },
    {
      "title": "Εμπιστευμένος Χρήστης, Trusted User (TU)",
      "level": 2,
      "content": "Δείτε #Package maintainer.\n\n"
    },
    {
      "title": "wiki",
      "level": 2,
      "content": "Το wiki είναι ένα μέρος εύρεσης τεκμηρίωσης σχετικά με το Arch Linux. Οποιοσδήποτε μπορεί να συμμετέχει στην τεκμηρίωση.\n\n"
    }
  ]
}