{
  "title": "Thunar (Русский)",
  "url": "https://wiki.archlinux.org/title/Thunar_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Xfce (Русский)\n- Функциональность файлового менеджера\n- GNOME Files\n- PCManFM (Русский)\n- Nemo\n\nС домашней страницы проекта:\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет thunar. Он является частью группы xfce4, поэтому если вы используете Xfce, то скорее всего Thunar у вас уже есть.\n\n"
    },
    {
      "title": "Плагины и дополнения",
      "level": 3,
      "content": "- Gnome Virtual File System — Для поддержки корзины, монтирования съемных носителей и удаленных файловых систем (mtp/smb). Для получения дополнительной информации смотрите Функциональность файлового менеджера#Монтирование.\n\n- Thunar Archive Plugin — Плагин, который позволяет создавать и распаковывать архивы через контекстное меню. Он не создает и не распаковывает напрямую архивы, вместо этого он действует как интерфейс для других программ, таких как File Roller (file-roller), Ark (ark) или Xarchiver (xarchiver). Является частью группы xfce4-goodies.\n\n- Thunar Media Tags Plugin — Плагин, который позволяет просматривать подробную информацию о медиафайлах. Кроме того, в него включена функция массового переименования файлов и редактирования тегов мультимедиа. Поддерживает тэги ID3 (система формата MP3-файла) и Ogg/Vorbis. Является частью группы xfce4-goodies.\n\n- Thunar Shares Plugin — Плагин, который позволяет быстро открыть общий доступ к папке из Thunar, используя Samba. Не требует права суперпользователя. Также смотрите как настроить направления.\n\n- Thunar Volume Manager — Автоматическое управление съемными устройствами в Thunar. Является частью группы xfce4.\n\n- Tumbler — Дополнительная программа для создания миниатюр. Также установите ffmpegthumbnailer, чтобы включить поддержку миниатюр для видеофайлов.\n\n- RAW Thumbnailer — Легкий и быстрый просмотрщик изображений raw, который необходим для отображения миниатюр raw.\n\n- libgsf — GNOME Structured File Library - это библиотека для чтения и записи структурированных форматов файлов. Установите ее, если вам нужна поддержка миниатюр odf.\n\n"
    },
    {
      "title": "Thunar Volume Manager",
      "level": 2,
      "content": "Хотя Thunar и поддерживает автоматическое монтирование и размонтирование съемных носителей (требуется пакет gvfs), Thunar Volume Manager обеспечивает дополнительные возможности, такие как автозапуск команд или открытие окна Thunar для подмонтированного устройства.\n\n"
    },
    {
      "title": "Установка",
      "level": 3,
      "content": "Thunar Volume Manager можно установить из официальных репозиториев из пакета thunar-volman.\n\n"
    },
    {
      "title": "Настройка",
      "level": 3,
      "content": "Thunar Volume Manager можно настроить на выполнение определённых действий, например когда подключена фотокамера или аудиоплеер. После установки плагина выполните:\n\n1. Запустите Thunar и перейдите к Правка > Параметры\n1. Во вкладке 'Дополнительно', отметьте флажком 'Включить управление томами'\n1. Щёлкните 'Настроить' и проверьте следующие пункты: Подключать обнаруженные съемные устройства Подключать вставленные съемные носители\n1. Также сделайте необходимые изменения (смотрите пример ниже)\n\n- Подключать обнаруженные съемные устройства\n- Подключать вставленные съемные носители\n\nВот пример настройки - запуска Amarok для проигрывания аудио с вставленного диска.\n\n```\nМультимедиа - Аудиодиски: amarok --cdplay %d\n```\n\n"
    },
    {
      "title": "Автомонтирование больших внешних накопителей",
      "level": 3,
      "content": "Если Thunar отказывается монтировать большие съемные носители (размером > 1 ТБ), хотя были установлены thunar-volman и gvfs, попробуйте установить другую программу, например, udevilAUR или udiskie. Рекомендуется использовать последнюю, поскольку она использует udisks2 и, следовательно, совместима с gvfs. Чтобы запустить udiskie с поддержкой udisks2, добавьте следующую строку в файл автозапуска:\n\n```\nudiskie -2 &\n```\n\n"
    },
    {
      "title": "Использование Thunar для просмотра удаленных мест",
      "level": 3,
      "content": "Начиная с Xfce 4.8 (Thunar 1.2), вы можете просматривать удаленные местоположения (например, FTP-серверы или общие папки Samba) непосредственно в Thunar. Чтобы включить эту функциональность, убедитесь, что установлены пакеты gvfs, gvfs-smb и sshfs. В боковой панели Thunar видна закладка 'Сеть', и удаленные местоположения можно открыть там, используя следующие схемы URI в панели для отображения текущего файлового пути (выбранной с помощью Ctrl+l): smb://, ftp://, ssh://, sftp://, davs:// и за которыми следует имя хоста сервера или IP-адрес.\n\nДля общего доступа через NFS нет схемы URI, но Thunar может выдать команду mount, если вы правильно настроили fstab.\n\n```\n/etc/fstab\n```\n\n```\n# nas1 server\nnas1:/c/home\t\t/media/nas1/home\tnfs\tnoauto,user,_netdev,bg  0 0\n```\n\nЗдесь важны параметры: noauto, который запрещает монтировать до тех пор, пока вы не нажмете на нее, user, который позволяет любому пользователю монтировать (и отключать) общий доступ, _netdev, который устанавливает подключение к сети необходимым условием, и, наконец, bg, который устанавливает операцию монтирования в фоне, поэтому, если вашему серверу требуется некоторое время отклика, вам не придется иметь дело с сообщениями тайм-аута и повторно нажимать, пока это не сработает.\n\n"
    },
    {
      "title": "Запуск в режиме демона",
      "level": 3,
      "content": "Thunar может запускаться в режиме демона. Это даёт несколько преимуществ, включая более быстрый запуск Thunar и его выполнение в фоне. При работе в фоне Thunar может автоматически монтировать съемные носители и при их подсоединение вызывать необходимые действия (например, при подсоединение флешки откроется Thunar с ее содержимым).\n\nУбедитесь, что команда thunar --daemon запускается при входе в систему. Для получения дополнительной информации смотрите Xfce и Автозапуск.\n\n"
    },
    {
      "title": "Решение проблемы с медленным первым запуском",
      "level": 3,
      "content": "У некоторых людей по-прежнему возникают проблемы с тем, что Thunar долго запускается в первый раз. Это связано с тем, что gvfs проверяет сеть, предотвращая запуск Thunar до завершения этой проверки. Чтобы изменить это поведение, отредактируйте /usr/share/gvfs/mounts/network.mount и замените AutoMount=true на AutoMount=false.\n\n"
    },
    {
      "title": "Скрытие закладок в боковой панели",
      "level": 3,
      "content": "Существует меню для скрытия закладок в боковой панели.\n\nЩелкните правой кнопкой мыши в боковой панели, где нет закладок, например, по надписи Устройства. Затем вы увидете меню, в котором вы можете снять флажки с элементов, которые вы не хотите отображать.\n\n"
    },
    {
      "title": "Создание горячих клавиш в Thunar",
      "level": 3,
      "content": "Для получения дополнительной информации смотрите GTK+ (Русский)#Горячие клавиши,\n\n"
    },
    {
      "title": "Отображение разделов, определенных в fstab",
      "level": 3,
      "content": "По умолчанию Thunar не будет показывать в устройствах какие-либо разделы, определенные в /etc/fstab, кроме корневого раздела.\n\nМы можем изменить это, добавив параметр x-gvfs-show в fstab для раздела, который мы хотим видеть.\n\n"
    },
    {
      "title": "Особые действия",
      "level": 2,
      "content": "В этом разделе рассматриваются полезные особые действия, которые можно настроить через Правка -> Особые действия. Их настройки хранятся в ~/.config/Thunar/uca.xml. Дополнительные примеры перечислены в вики thunar. Кроме того, на этих сайтах [1][2][3] представлены неплохие подборки особых действий.\n\n"
    },
    {
      "title": "Поиск файлов и папок",
      "level": 3,
      "content": "Для использования этого действия необходим catfish. Необходима также необязательную зависимость plocate для него.\n\nTable content:\nИмя | Команда | Шаблон имени файла | Появляться, если выделение содержит\nПоиск | catfish --path=%f | * | Каталоги\n\n"
    },
    {
      "title": "Поиск вирусов",
      "level": 3,
      "content": "Для использования этого действия необходимы пакеты clamav и clamtk.\n\nTable content:\nИмя | Команда | Шаблон имени файла | Появляться, если выделение содержит\nПоиск вирусов | clamtk %F | * | Выберите все\n\n"
    },
    {
      "title": "Ссылка на Dropbox",
      "level": 3,
      "content": "Table content:\nИмя | Команда | Шаблон имени файла | Появляться, если выделение содержит\nz | ln -s %f /путь/до/папки_Dropbox | * | Каталоги, другие файлы\n\nОбратите внимание, что при использовании большого количества особых действий для создания ссылок на файлы и папки в определенные места может быть удобнее поместить их в контекстного меню Отправить на, чтобы избежать раздувания главного меню. Это довольно легко сделать - для каждого действия требуется файл .desktop в каталоге ~/.local/share/Thunar/sendto. Предположим, что мы хотим поместить вышеуказанное действие создания ссылки на Dropbox в Отправить на, мы создаем dropbox_folder.desktop со следующим содержимым. Новое действие будет включено после перезапуска Thunar.\n\n```\n[Desktop Entry]\nType=Application\nVersion=1.0\nEncoding=UTF-8\nExec=ln -s %f /путь/до/папки_Dropbox\nIcon=/usr/share/icons/dropbox.png\nName=Dropbox\n```\n\n"
    },
    {
      "title": "Tumblerd зависает, сильно нагружает ЦП",
      "level": 3,
      "content": "Tumblerd - служба, следящая за файловой системой и уведомляющая систему, когда нужно показать миниатюру вместо пиктограммы формата файла. Она может застрять в цикле, нагружая при этом на 100% ЦП системы, для получения дополнительной информации смотрите сообщение об ошибке. Следующий скрипт является временным решением, чтобы этого не происходило. Скопируйте и вставьте его в файл с расширением .sh, сохраните его где-нибудь в своем домашнем каталоге, сделайте исполняемым, а затем включите его в автозапуск.\n\n```\n#!/bin/bash\nperiod=20\ntumblerpath=\"/usr/lib/*/tumbler-1/tumblerd\" # здесь * используется для выбора архитектуры (32- или 64-битной)\ncpu_threshold=50\nmem_threshold=20\nmax_strikes=2                               # максимальное количество вышеперечисленных cpu/mem-threshold в строке\nlog=\"/tmp/tumblerd-watcher.log\"\n\nif [[ -n \"${log}\" ]]; then\n    cat /dev/null > \"${log}\"\n    exec >\"${log}\" 2>&1\nfi\n\n\nstrikes=0\nwhile sleep \"${period}\"; do\n    while read pid; do\n\tcpu_usage=$(ps --no-headers -o pcpu -f \"${pid}\"|cut -f1 -d.)\n\tmem_usage=$(ps --no-headers -o pmem -f \"${pid}\"|cut -f1 -d.)\n\n\tif [[ $cpu_usage -gt $cpu_threshold ]] || [[ $mem_usage -gt $mem_threshold ]]; then\n\t    echo \"$(date +\"%F %T\") PID: $pid CPU: $cpu_usage/$cpu_threshold %cpu MEM: $mem_usage/$mem_threshold STRIKES: ${strikes} NPROCS: $(pgrep -c -f ${tumblerpath})\"\n\t    (( strikes++ ))\n\t    if [[ ${strikes} -ge ${max_strikes} ]]; then\n\t\tkill \"${pid}\"\n\t\techo \"$(date +\"%F %T\") PID: $pid KILLED; NPROCS: $(pgrep -c -f ${tumblerpath})\"\n\t\tstrikes=0\n\t    fi\n\telse\n\t    strikes=0\n\tfi\n    done < <(pgrep -f ${tumblerpath})\ndone\n```\n\n"
    },
    {
      "title": "Исчезают иконки корзины/сети",
      "level": 3,
      "content": "Убедитесь что, все экземпляры Thunar запускаются после gvfs. [4] Для thunar --daemon вы можете создать скрипт, который ждет, пока включится GVFS:\n\n```\n/usr/local/bin/Thunar\n```\n\n```\n#!/bin/bash\nif [[ $1 == --daemon ]]; then\n  until pgrep gvfs >/dev/null; do\n    sleep 1\n  done\n  exec /usr/bin/Thunar \"$@\"\nelse\n  exec /usr/bin/Thunar \"$@\"\nfi\n```\n\n"
    },
    {
      "title": "Не авторизирован для монтирования файловых систем",
      "level": 3,
      "content": "Для получения дополнительной информации смотрите Функциональность файлового менеджера#Решение проблем.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Страницу проекта Thunar.\n- Страницу проекта Thunar Volume Manager.\n- Список плагинов.\n- Список настроек, которые доступны только через xfconf-query (например, отображения полного пути в заголовке).\n\n"
    }
  ]
}