{
  "title": "Thunar (Español)",
  "url": "https://wiki.archlinux.org/title/Thunar_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artículos relacionados\n\n- Xfce\n\nDesde la página principal del proyecto:\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete thunar disponible desde los repositorios oficiales. Este paquete es parte del grupo xfce4, por lo que al ejecutar Xfce4, es probable que ya tenga instalado Thunar.\n\n"
    },
    {
      "title": "Montaje automático",
      "level": 3,
      "content": "Thunar utiliza GVFS para el montaje automático, consulte GVFS para más detalles para conseguir que funcione.\n\n"
    },
    {
      "title": "Plugins y addons",
      "level": 3,
      "content": "- ffmpegthumbnailer — Programa externo para generar imágenes en miniatura. Para que esto funcione, debe instalar tumbler.\n\n- Thunar Archive Plugin — Plugin que permite crear y extraer archivos comprimidos utilizando los elementos del menú contextual. No crea o extraer directamente los archivos, sino que actúa como interfaz para otros programas como File Roller, Ark, o Xarchiver. Es parte de xfce4-goodies.\n\n- Thunar Media Tags Plugin — PProgramas que le permite ver la información detallada acerca de los archivos multimedia. También tiene otras opciones como posibilidad de cambiar el nombre y permitir la edición de etiquetas de los archivos multimedia. Es compatible con ID3 (sistema de formato de archivo MP3) y etiquetas Ogg/Vorbis. Es parte de xfce4-goodies.\n\n- Thunar Shares Plugin — Programas que permite compartir rápidamente una carpeta con Samba desde Thunar sin necesidad de acceso como root. Véase también how to configure directions.\n\n- Thunar Volume Manager — Gestión automática de los dispositivos extraibles en Thunar. Parte del grupo xfce4.\n\n- Tumbler — Programa externo para generar imágenes en miniaturas. Instale también ffmpegthumbnailer para activar la miniaturización de vídeo.\n\n"
    },
    {
      "title": "Administrador del Volumen Thunar",
      "level": 2,
      "content": "Mientras Thunar soporta el montaje y desmontaje automático de medios extraíbles, el admnistrador de volúmenes Thunar permite funcionalidades extendidas, tales como la posibilidad de ejecutar comandos particulares para la conexión de un dispositivo periférico o abrir automáticamente una ventana de Thunar al montar el volumen.\n\n"
    },
    {
      "title": "Instalación",
      "level": 3,
      "content": "Thunar Volume Manager se puede instalar con el paquete thunar-volman disponible en los repositorios oficiales.\n\n"
    },
    {
      "title": "Configuración",
      "level": 3,
      "content": "También se puede configurar para ejecutar ciertas acciones al conectar cámaras y reproductores de audio. Una vez instalado el plugin:\n\n1. Lance Thunar y abra Editar -> Preferencias\n1. Bajo la pestaña \"Avanzado\", marque la casilla \"Habilitar la administración de volúmenes\"\n1. Pinche en configurar y verifique los siguientes elementos: Montar unidades extraíbles (discos duros) cuando se enciendan. Montar medios extraíbles (USB) cuando se inserten.\n1. Haga adicionalmente también los cambios que desee (vea el ejemplo a continuación)\n\n- Montar unidades extraíbles (discos duros) cuando se enciendan.\n- Montar medios extraíbles (USB) cuando se inserten.\n\nHe aquí un ejemplo de ajuste para hacer que Amarok se abra para reproducir un CD de audio al insertarlo.\n\n```\nMultimedia - CD Audio: amarok --cdplay %d\n```\n\n"
    },
    {
      "title": "Usar Thunar para explorar zonas remotas",
      "level": 3,
      "content": "Desde Xfce 4.8 (Thunar 1.2), es posible explorar carpetas en zonas remotas (como servidores FTP o Samba para compartir ficheros) directamente en Thunar, similar a la funcionalidad de GNOME y KDE. Los paquetes gvfs y gvfs-smb son necesarios para habilitar esta funcionalidad. Ambos paquetes están disponibles en los repositorios oficiales.\n\nDespués de reiniciar Xfce se agrega un enlace de \"Red\" a la barra lateral de Thunar y las ubicaciones remotas se pueden abrir con los siguientes esquemas de URI en el campo de diálogo (abierto con Ctrl+L): smb://, ftp://, ssh://, sftp://\n\n"
    },
    {
      "title": "GVFS necesita D-Bus y polkit",
      "level": 3,
      "content": "Si utiliza un gestor de ventanas independiente, asegúrese que D-Bus es lanzado en el inicio de sesión, y que se está ejecutando un agente de autenticación de polkit. De lo contrario, GVFS no estará activo. Véase General troubleshooting#Session permissions para obtener más detalles.\n\n"
    },
    {
      "title": "Iniciar en modo demonio",
      "level": 3,
      "content": "Thunar puede ejecutarse en modo demonio. Este comportamiento tiene varias ventajas, incluyendo un inicio más rápido de Thunar, haciendo que Thunar se inicialice en segundo plano y sólo se abra una ventana cuando sea necesario (por ejemplo, cuando una unidad USB se inserta).\n\nAsegúrese de que la orden thunar --daemon está iniciada en el inicio de sesión.\n\n"
    },
    {
      "title": "Ajustar el tema de iconos",
      "level": 3,
      "content": "Al usar Thunar fuera de Gnome o Xfce, ciertos paquetes y configuraciones que se utilizan para controlar los iconos pueden estar ausentes. Los gestores de ventanas como Awesome y Xmonad no vienen con el administrador XSETTINGS, que es donde Thunar busca primero su configuración de icono. Es posible instalar y ejecutar xfce-mcs-manager mediante un script de inicio si se va a utilizar Xfce4 conjuntamente con muchas aplicaciones de Gnome. La configuración de gtk-icon-theme-name para gtk2 se puede ajustar para un usuario mediante la adición de algo parecido a lo siguiente en ~/.gtkrc-2.0:\n\n```\ngtk-icon-theme-name = \"Tango\"\n```\n\nPor supuesto, al instalar el paquete gnome-icon-themeAUR dará a Thunar un tema de iconos diferente a los iconos predeterminados para el resto de los elementos.\n\n"
    },
    {
      "title": "Resolver problemas con el arranque lento \"en frío\"",
      "level": 3,
      "content": "Algunas usuarios todavía tienen problemas con Thunar que tarda mucho tiempo para iniciar la primera vez. Esto es debido a que gvfs verifica la red, impidiendo a Thunar que arranque hasta que gvfs finalice sus operaciones. Para cambiar este comportamiento, edite el archivo usr/share/gvfs/mounts/network.mount y modifique automount=true a automount=false.\n\n"
    },
    {
      "title": "Acciones personalizadas",
      "level": 2,
      "content": "Esta sección trata de acciones personalizadas útiles que se pueden obtener a través del menú Editar -> Configuración de acciones personalizadas. Se enumeran más ejemplos en la wiki de thunar.\n\n"
    },
    {
      "title": "Escanear virus",
      "level": 3,
      "content": "Para utilizar esta acción es necesario tener instalado clamav y clamtk.\n\nTable content:\nNombre | Comando | Patrones de archivos | Aparecerá si está en la selección\nAnalizar en busca de virus | clamtk %F | * | Seleccionar todo\n\n"
    },
    {
      "title": "Enlace a Dropbox",
      "level": 3,
      "content": "Table content:\nNombre | Comando | Patrones de archivos | Aparecerá si está en la selección\nEnlace a Dropbox | ln -s %f /ruta/a/Carpeta_Dropbox | * | Directorios, otros archivos\n\nTenga en cuenta que cuando se utilizan muchos enlaces simbólicos de archivos y carpetas a un lugar particular, podría ser útil ponerlos en la carpeta Enviar a del menú contextual para evitar que el mismo menú se sobredimensione. Esto es bastante fácil de lograr y requiere un archivo .desktop en ~/.local/share/Thunar/sendto para cada acción a realizar. Por ejemplo, si quiere un enlace simbólico a la carpeta dropbox en Enviar a, creamos un archivo dropbox_folder.desktop con el contenido de abajo. La nueva acción personalizada se activará después de reiniciar Thunar.\n\n```\n[Desktop Entry]\nType=Application\nVersion=1.0\nEncoding=UTF-8\nExec=ln -s %f /percorso/alla/cartella/dropbox\nIcon=/usr/share/icons/dropbox.png\nName=Dropbox\n```\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página del proyecto Thunar.\n- Página del proyecto Thunar Volume Manager.\n- Lista de plugins.\n\n"
    }
  ]
}