{
  "title": "Thunderbolt (Polski)",
  "url": "https://wiki.archlinux.org/title/Thunderbolt_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Powiązane artykuły\n\n- External GPU\n\nThunderbolt 3 działa od razu z najnowszymi wersjami jądra Linux [1]. Kernel Linux, zaczynając od wersji 4.13, wspiera również Thunderbolt Security.\n\n"
    },
    {
      "title": "Aktualizacje oprogramowania układowego",
      "level": 2,
      "content": "Producenci często wypuszczają aktualizacje oprogramowania układowego dla portów i urządzeń Thunderbolt, aby te działały poprawnie. Więcej informacji można znaleźć na https://thunderbolttechnology.net/updates.\n\n"
    },
    {
      "title": "Autoryzacja urządzeń użytkownika",
      "level": 2,
      "content": "Nowoczesne urządzenia Thunderbolt implementują tryby bezpieczeństwa, które wymagają autoryzacji użytkownika podczas podłączania urządzeń - ma to na celu ochronę przed złośliwymi urządzeniami wykonującymi ataki DMA lub w inny sposób ingerującymi w sprzęt (patrz Thunderstrike 2).\n\nAktualnie obsługiwanymi trybami na Linuxie są:\n\n- none - Brak zabezpieczeń, wszystkie urządzenia są domyślnie połączone i inicjalizowane. W ustawieniach BIOSu jest to zazwyczaj nazwane Legacy mode.\n- user - Wymagana jest autoryzacja przez użytkownika za każdym razem, gdy urządzenie zostaje podłączone. W ustawieniach BIOSu to ustawienie jest zazwyczaj nazywane Unique ID.\n- secure - Wymagana jst autoryzacja użytkownika, ale urządzenie zostaje zapamiętane i nie wymaga ponownej autoryzacji. W ustawieniach BIOSu to ustawienie jest zazwyczaj nazywane One time saved key.\n- dponly - Thunderbolt działa tylko na DisplayPort, wszystkie inne urządzenia nie są autoryzowane. W ustawieniach BIOSu tryb ten zazwyczaj nazywa się Display Port Only.\n\nPoziom bezpieczeństwa jest normalnie konfigurowany na poziome oprogramowania układowego; zalecane jest, aby ustawić ten poziom na przynajmniej secure. Stan tego ustawienia może być odczytany za pomocą:\n\n```\n$ cat /sys/bus/thunderbolt/devices/domain0/security\n```\n\n"
    },
    {
      "title": "Interfejsy graficzne",
      "level": 3,
      "content": "- GNOME natywnie obsługuje autoryzowanie urządzeń poprzez interfejs graficzny od wersji 3.30\n- Integracja z Plasma jest możliwa dzięki temu repozytorium git oraz dzięki pakietowi plasma-thunderbolt.\n\n"
    },
    {
      "title": "Automatyczne podłączanie urządzeń",
      "level": 3,
      "content": "Użytkownicy, którzy chcą po prostu podłączyć dowolne urządzenie bez jakiejkolwiek ręcznej pracy, mogą utworzyć regułę udev jak w 99-removable.rules:\n\n```\n/etc/udev/rules.d/99-removable.rules\n```\n\n```\nACTION==\"add\", SUBSYSTEM==\"thunderbolt\", ATTR{authorized}==\"0\", ATTR{authorized}=\"1\"\n```\n\n"
    },
    {
      "title": "Wymuszanie zasilania",
      "level": 3,
      "content": "Wielu producentów OEM zawiera metodę, której można użyć do wymuszenia włączenia zasilania kontrolera Thunderbolt. Jeśli jest to obsługiwane przez maszynę, zostanie to ujawnione przez magistralę WMI z atrybutem sysfs o nazwie force_power [2].\n\nWymuszenie zasilania może być szczególnie przydatne, gdy podłączone urządzenie utraci połączenie lub kontroler sam się wyłączy.\n\nAby wymusić włączenie/wyłączenie zasilania, wpisz 1 lub 0 do tego atrybutu, np. wymuś zasilanie:\n\n```\n# echo 1 > /sys/bus/wmi/devices/86CCFD48-205E-4A77-9C48-2021CBEDE341/force_power\n```\n\n"
    },
    {
      "title": "Magistrale PCI nie są zarejestrowane",
      "level": 3,
      "content": "Czasami podczas podłączania urządzenia Thunderbolt magistrale PCI mogą nie zostać zarejestrowane. Objawia się to działającymi ekranami, podczas gdy urządzenia USB nie rejestrują się na komputerze. Można to rozwiązać poprzez ponowne skanowanie PCI:\n\n```\n# echo 1 > /sys/bus/pci/rescan\n```\n\n"
    },
    {
      "title": "Zwiększenie rozmiaru magistrali hot-plug i pamięci",
      "level": 3,
      "content": "Niektóre BIOS-y mogą zgłaszać zbyt mały rozmiar magistrali i pamięci do jądra, co powoduje, że sterowniki nie ładują się. Dodaj poniższe polecenie do wiersza poleceń jądra, aby ręcznie ustawić rozmiar.\n\n```\npci=hpbussize=0x33,hpmemsize=256M\n```\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Podręcznik użytkownika i administratora jądra Linux dla Thunderbolt\n- strona bolt na GitHub\n- Przedstawiamy bolt: Poziomy bezpieczeństwa Thunderbolt 3 dla GNU/Linux\n- Obsługa Thunderbolt w środowisku GNOME\n- tbtadm\n\n"
    }
  ]
}