{
  "title": "Thunderbird (简体中文)/Enigmail (简体中文)",
  "url": "https://wiki.archlinux.org/title/Thunderbird_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)/Enigmail_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Firefox\n\nThunderbird is an open source email, news, and chat client previously developed by the Mozilla Foundation.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the thunderbird package, with a language pack if required.\n\nOther versions include:\n\n- Thunderbird Beta — Cutting edge features with relatively-good stability.\n\n- Thunderbird Nightly/Daily — Experience the newest innovations with nightly releases (for those that want to work with breakages).\n\n- Betterbird — Betterbird is a fine-tuned version of Mozilla Thunderbird, Thunderbird on steroids.\n\nA version overview, both past and future, can be read on MozillaWiki:Releases.\n\n"
    },
    {
      "title": "Securing",
      "level": 2,
      "content": "- Thunderbird sends your system's internal IP address to the configured SMTP server as an argument to the HELO/ELHO SMTP command. This value can be overridden by setting mail.smtpserver.default.hello_argument to, for example, localhost. Setting this value may increase the spam score of messages you send. See [1] and [2].\n- To hide Thunderbird's User Agent, set mailnews.headers.useMinimalUserAgent to false and create a new empty general.useragent.override string entry in the #Config editor.\n- JavaScript is disabled for message content but not for RSS news feeds. To disable set javascript.enabled to false in the #Config editor.\n\n- Setting javascript.enabled to false also turns off Javascript in OAuth dialogs.\n- Setting general.useragent.override to an empty string is known to break Duo MFA. See web-bugs#104558.\n\n"
    },
    {
      "title": "Extensions",
      "level": 2,
      "content": "- Birdtray — System tray new mail notification which does not require extensions. Run Thunderbird with a system tray icon.\n\n- SysTray-X — system tray extension. Similar to FireTray but works with Thunderbird 68+.\n\n- SOGo Connector — Lets you sync address books via CardDAV\n\n- Cardbook — A new addressbook for Thunderbird based on the CARDDav and VCARD standards.\n\n"
    },
    {
      "title": "OpenPGP: signing and encryption",
      "level": 3,
      "content": "From Thunderbird 78.2.1 onwards, this functionality is integrated into Thunderbird. This was previously provided by the Enigmail add-on, which is not compatible with Thunderbird 78+. To migrate keys from Enigmail to Thunderbird, as well as learn what is currently supported, see Thunderbird OpenPGP FAQ. Before migration, make sure that a strong passphrase is used for the master password. Otherwise the private key will not be properly protected.\n\n"
    },
    {
      "title": "Config editor",
      "level": 3,
      "content": "Thunderbird can be extensively configured by clicking the Thunderbird Menu > Settings > General and looking for the Config Editor button at the bottom of the page. Alternatively, if the menu bar is toggled the Config Editor button can be found by clicking Edit > Settings > General\n\n"
    },
    {
      "title": "Set the default browser",
      "level": 3,
      "content": "Thunderbird uses the default browser as defined by the XDG MIME Applications. This is commonly modified by desktop environments (for example GNOME's Control Center: Details > Default Applications > Web).\n\nThis can be overridden with network.protocol-handler.warn-external in the #Config editor\n\nIf the following is all set to false (default), set them to true and Thunderbird will ask you which application to use when you click on a link (remember to also check \"Remember my choice for .. links\").\n\n```\nnetwork.protocol-handler.warn-external.http\nnetwork.protocol-handler.warn-external.https\n```\n\n"
    },
    {
      "title": "Plain text mode and font uniformity",
      "level": 3,
      "content": "Plain Text mode lets you view all your emails without HTML rendering and is available in View > Message Body As. This defaults to the Monospace font but the size is still inherited from original system fontconfig settings. The following example will overwrite this with Ubuntu Mono of 10 pixels (available in: ttf-ubuntu-font-family).\n\nRemember to run fc-cache -fv to update system font cache. See Font configuration for more information.\n\n```\n~/.config/fontconfig/fonts.conf\n```\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n  <match target=\"pattern\">\n    <test qual=\"any\" name=\"family\"><string>monospace</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"same\"><string>Ubuntu Mono</string></edit>\n    <!-- For Thunderbird, lowering default font size to 10 for uniformity -->\n    <edit name=\"pixelsize\" mode=\"assign\"><int>10</int></edit>\n  </match>\n</fontconfig>\n```\n\n"
    },
    {
      "title": "Migrate profile to another system",
      "level": 3,
      "content": "Before you start with Importing or Exporting tasks, backup your complete ~/.thunderbird profile:\n\n```\n$ cp -R ~/.thunderbird /to/backup/folder/\n```\n\nWith migration you just copy your current Thunderbird profile to another PC or a new Thunderbird installation:\n\n1. Install Thunderbird on the target PC.\n1. Start Thunderbird without doing anything and quit it.\n1. Copy the profile content from your backup folder into the target profile folder: $ cp -R /to/backup/folder/.thunderbird/<oldrandomnumber>.default-release/* ~/.thunderbird/<newrandomnumber>.default-release/\n\n```\n$ cp -R /to/backup/folder/.thunderbird/<oldrandomnumber>.default-release/* ~/.thunderbird/<newrandomnumber>.default-release/\n```\n\n"
    },
    {
      "title": "Export and import",
      "level": 3,
      "content": "Before you start with Importing or Exporting tasks, backup your complete ~/.thunderbird profile:\n\n```\n$ cp -R ~/.thunderbird /to/backup/folder/\n```\n\nIf your accounts are broken or you want to join two different Thunderbird installations, you can install ImportExportTools NG add-on for both Thunderbird installations and following this just export and import all your data to the new installation.\n\n"
    },
    {
      "title": "Change the default sorting order",
      "level": 3,
      "content": "Thunderbird (up to at least 31.4.0-1) sorts mail by date with the oldest on top without any threading. While this can be changed per folder, it is easier to set a sane default instead as described here.\n\nSet these preferences in the #Config editor:\n\n```\nmailnews.default_sort_order = 2 (descending)\nmailnews.default_view_flags = 1 (Threaded view)\n```\n\n"
    },
    {
      "title": "Maildir support",
      "level": 3,
      "content": "The default message store format is mbox. To enable the use of Maildir, see MozillaWiki:Thunderbird/Maildir. You basically have to set the following preference in the #Config editor:\n\n```\nmail.serverDefaultStoreContractID = @mozilla.org/msgstore/maildirstore;1\n```\n\nSome limitations up to at least 31.4.0-1: only the \"tmp\" and \"cur\" directories are supported. The \"new\" directory is completely ignored. The read state of mails are stored in a separate \".msf\" file, so initially all local mail using Maildir will be marked as unread even when located in the \"cur\" directory. It is also possible to change this setting in the regular user interface now: Go to Menu > Settings > General > Indexing > Message Store Type for new accounts and choose File per message (maildir).\n\n"
    },
    {
      "title": "Spell checking",
      "level": 3,
      "content": "Install hunspell and a hunspell language dictionary and restart Thunderbird.\n\nSee the Firefox article for how to set the default spell checking language.\n\n"
    },
    {
      "title": "Native notifications",
      "level": 3,
      "content": "Make sure that mail.biff.use_system_alert in the #Config editor is set to \"true\" (default). This option means that extensions (such as Gnome Integration) are not needed for these newer versions of Thunderbird.\n\nYou might also need to install a notification server.\n\n"
    },
    {
      "title": "Sound",
      "level": 3,
      "content": "Thunderbird can be configured to play sounds when new emails are received and when calendar reminders are dispatched. This requires libcanberra.\n\n"
    },
    {
      "title": "Theming tweaks",
      "level": 3,
      "content": "Thunderbird should conform to GTK#Themes as defined on your system. However, two tweaks are desirable for full consistency. These are most beneficial for dark themes.\n\n1. To view the body of emails with colors following your theme: Go to Menu > Settings > General Find the Language & Appearance section Click the Colors button Check Use system colors Set the option for Override the colors specified by the content with my selection above to Always or Only with High Contrast themes\n1. To view Lightning calendar with colors following your theme: Go to Menu > Preferences > Preferences Select the Calendar tab Check Optimize colors for accessibility\n\n1. Go to Menu > Settings > General\n1. Find the Language & Appearance section\n1. Click the Colors button\n1. Check Use system colors\n1. Set the option for Override the colors specified by the content with my selection above to Always or Only with High Contrast themes\n\n1. Go to Menu > Preferences > Preferences\n1. Select the Calendar tab\n1. Check Optimize colors for accessibility\n\nFurther customization can be attained by creating and editing a userchrome.css. See Firefox/Tweaks#General user interface CSS settings and Mozillazine's userchrome page.\n\n"
    },
    {
      "title": "Keyboard bindings",
      "level": 3,
      "content": "Thunderbird unfortunately lacks an easy way to disable single-key bindings, such that pressing e.g. \"a\" on the keyboard will not archive a message. The tbkeys-lite extension provides a means of editing and deleting such bindings and is available for Thunderbird 68.0 onwards.\n\n"
    },
    {
      "title": "Use OpenPGP with external GnuPG",
      "level": 3,
      "content": "Starting with v78.1, Thunderbird now ships with integrated OpenPGP support previously provided by Add-Ons like Enigmail. It will offer you to migrate your existing Enigmail keys into Thunderbird upon the first start after the update. If you do not want to store your private keys inside Thunderbird, it is possible to use Thunderbird with an external GnuPG installation in order to keep your keys safe or use a Smartcard.\n\nTo view any OpenPGP keys stored inside Thunderbird:\n\n1. Go to Menu > Tools > OpenPGP Key Manager\n1. Disable View > Display Keys From Other People for better visibility of your own keys. Private keys are displayed in bold.\n1. Review present keys and possibly delete them.\n1. Import public keys of any external private keys you want to use using File > Import public key(s) from file. See GnuPG#Export your public key.\n\nTo enable external GnuPG support in Thunderbird:\n\n1. Ensure you have relevant keys available or created.\n1. Open the #Config editor\n1. Search for mail.openpgp.allow_external_gnupg and set its value to true\n1. Go to Menu > Account Settings and select the account you want to use.\n1. Click Manage Identities and select the Identity you want to edit.\n1. Click Edit > End-To-End Encryption > Add Key.\n1. Select Use your external key through GnuPG and paste your key ID from GnuPG. Note: The Secret Key ID is the last 16 characters of your primary key's fingerprint.\n\nRefer to MozillaWiki:Thunderbird:OpenPGP:Smartcards for further instructions and specialized configurations.\n\n"
    },
    {
      "title": "Wayland",
      "level": 3,
      "content": "Starting with version 128, Thunderbird defaults to Wayland instead of XWayland and does not require any configuration. Older versions of Thunderbird support opting into Wayland mode via an environment variable.\n\n```\n$ MOZ_ENABLE_WAYLAND=1 thunderbird\n```\n\n"
    },
    {
      "title": "Tor",
      "level": 3,
      "content": "To route the connection to the server through the Tor network the proxy settings must be set accordingly.\n\n1. Make sure you have tor installed and that the process is running.\n1. In Thunderbird go to Menu > Settings > General. In the Network & Disk Space > Connection section, click on the Settings... button.\n1. Select Manual proxy configuration, enter localhost as SOCKS Host and 9050 as Port (9050 is the default; it may be configured differently in /etc/tor/torrc). Select Proxy DNS when using SOCKS v5.\n\n"
    },
    {
      "title": "LDAP Segfault",
      "level": 3,
      "content": "An LDAP clash (Bugzilla#292127) arises on systems configured to use it to fetch user information. A possible workaround consists of renaming the conflicting bundled LDAP library.\n\n"
    },
    {
      "title": "Error: Incoming server already exists",
      "level": 3,
      "content": "If you want to reinstall a previously deleted account with the same account data, you might get a popup with \"Incoming server already exists\". See bug Bugzilla#1121151 for details. Unfortunately, if you get this error you can now only clean reinstall Thunderbird:\n\n1. Make a backup of your current profile: $ cp -R ~/.thunderbird /to/backup/folder/\n1. Export all your Accounts, Calendar and Feeds via an add-on like it is written in Export section of this Wiki.\n1. Close Thunderbird\n1. Remove all your data by deleting your current Thunderbird folder rm -R ~/.thunderbird/.\n1. Start Thunderbird\n1. Create your mail accounts, feeds and calendars (empty).\n1. Install the ImportExportTools NG add-on\n1. Import all your data.\n\n```\n$ cp -R ~/.thunderbird /to/backup/folder/\n```\n\n"
    },
    {
      "title": "Thunderbird UI freezes when receiving a new message",
      "level": 3,
      "content": "If Thunderbird is configured to show an alert when a new message arrives, or at launch, the lack of a notification daemon may freeze the interface (white screen) for many seconds. You can solve this issue by disabling alerts or installing a notification server.\n\n"
    },
    {
      "title": "LC_TIME environment variable not respected",
      "level": 3,
      "content": "Thunderbird should use the LC_TIME environment variable for localization, but it might not do so in all contexts. Some problems can be mitigated by setting Menu > Preferences > Preferences > Advanced > Date and Time Formatting to Regional settings locale, a setting which was introduced in Thunderbird 56.\n\nWith version 60, Gecko started using the CLDR project for localization, including datetime formatting, which uses different settings than most other software based purely on LC_TIME. There is a bug report for this issue that includes workarounds with varying effects. To achieve ISO-8601-formatted dates in Thunderbird and a week beginning on Monday, use LC_TIME=lt_LT thunderbird.\n\nStarting in Thunderbird version 91, one can set a number of preferences to make Thunderbird compliant with ISO-8601. Most programs can be set to ISO-8601 by setting your region locale to en_DK, but by default Thunderbird ignores regional locale preferences. See [3] for details.\n\n"
    },
    {
      "title": "Authentication failure while connecting to server imap.gmail.com error when using OAuth2 with G Suite account",
      "level": 3,
      "content": "Sometimes Thunderbird fails to log in to G Suite with Authentication failure while connecting to server imap.gmail.com error. It can be fixed with setting general.useragent.compatMode.firefox setting to true in #Config editor and then passing authentication stage again.\n\n"
    },
    {
      "title": "Outlook 365 SMTP fails to authenticate with OAuth2 authentication",
      "level": 3,
      "content": "Apparently by default, SMTP authentication is disabled for Outlook 365 accounts. Use the Microsoft 365 admin center to enable it. Refer to: Enable SMTP AUTH for specific mailboxes.\n\n"
    },
    {
      "title": "Difficulties using Thunderbird to access Outlook 365 accounts",
      "level": 3,
      "content": "Version 102.7.0 of Thunderbird included changes to the OAUTH2 implementation that affected access to Outlook 365 accounts (see [4] and [5]). Affected users should directly upgrade to 102.7.1 or newer.\n\n"
    },
    {
      "title": "Cannot login to access Outlook 365 accounts",
      "level": 3,
      "content": "If, after being redirected to your institution's login page, inserting credentials and pressing the login button, you are being redirected to the same login page, try to:\n\n1. Remove cookies and cache with Menu > Tools > Clear Recent History, on Time range to clear select Everything, on History select Browsing History, Cookies, Cache, click Ok.\n1. Enable cookies with Edit > Settings > Privacy & Security and under Web Content check Accept cookies from sites\n\n"
    }
  ]
}