{
  "title": "Thunderbird (Русский)",
  "url": "https://wiki.archlinux.org/title/Thunderbird_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Firefox (Русский)\n\nThunderbird это клиент электронной почты с открытым исходным кодом, который имеет также функцию чтения новостей, чат (например, IRC или XMPP), ранее разрабатываемый Mozilla Foundation.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет thunderbird, а также языковой пакет по необходимости (например, thunderbird-i18n-ru для русского языка).\n\nВ репозиториях AUR представлены и другие версии:\n\n- Thunderbird Beta — бета версия для исследования новых версий на ошибки.\n\n- Thunderbird Nightly — самая новая версия с обновлениями сразу из репозитория исходного кода (очень нестабильна и не рекомендуется к использованию в личной жизни).\n\nСмотрите сведения об обновлениях на странице Thunderbird Release Notes на сайте Mozilla.\n\n"
    },
    {
      "title": "Приватность",
      "level": 2,
      "content": "- Thunderbird посылает IP вашего устройства на SMTP сервер в теле аргумента HELO/ELHO. Это поведение можно изменить настройкой mail.smtpserver.default.hello_argument в редакторе настроек. Установите, например, localhost или 127.0.0.1. Будьте аккуратны: такое изменение увеличит ваш рейтинг спамера. Смотрите также статьи replace IP address with name in headers и mail and news settings на mozillaZine.\n\n- Чтобы скрыть user agent (смотри страницу Firefox user agent string reference на MDN), установите пустое значение настройки general.useragent.override в редакторе настроек.\n\n- Thunderbird хоть и не загружает картинки в письмах по умолчанию, однако специально настроенное письмо (в виде HTML) может передать ваш IP или геолокацию. Отключите рендер HTML в меню Вид > Тело сообщения в виде > Простого текста.\n\n- По умолчанию JavaScript выключен для сообщений, но для RSS он включен. Установите false настройке javascript.enabled в редакторе настроек.\n\n"
    },
    {
      "title": "Расширения",
      "level": 2,
      "content": "- Birdtray — Уведомляет о новой почте в системном трее. Запускает Thunderbird в виде иконки в системном трее.\n\n- SysTray-X — Держит Thunderbird в системном трее.\n\n- SOGo Connector — Позволяет синхронизировать адресную книгу по стандарту cardDAV\n\n- CardBook — Адресная книга, работающая по стандартам cardDAV и vCard.\n\n"
    },
    {
      "title": "OpenPGP: подпись и шифрование",
      "level": 3,
      "content": "С версии 78.2.1 поддержка OpenPGP встроена в Thunderbird. Ранее для неё использовалось расширение Enigmail, который с версиями 78+ несовместим. Для переноса ключей из Enigmail в Thunderbird смотрите Thunderbird OpenPGP FAQ. Перед переносом убедитесь, что в качестве мастер-пароля используется надёжная парольная фраза, иначе закрытый ключ не будет должным образом защищён.\n\n"
    },
    {
      "title": "Редактор настроек",
      "level": 3,
      "content": "Thunderbird имеет редактор настроек как about:config в Firefox. Его можно найти в настройках, раздел «Дополнительные», вкладка «Основные», кнопка «Редактор настроек».\n\n"
    },
    {
      "title": "Установка браузера по умолчанию",
      "level": 3,
      "content": "Thunderbird использует настройки из XDG MIME Applications. Обычно настройка браузера по умолчанию производится при помощи утилит сред рабочего стола.\n\nЭто поведение может быть форсировано установкой настройки network.protocol-handler.warn-external в значение true в редакторе настроек, и тогда каждый раз по клику на ссылку будет появляться диалог с выбором программы. Установите галочку Запомнить мой выбор, чтобы задать браузер по умолчанию.\n\nТакже можно дополнительно настроить браузеры для разных протоколов:\n\n```\nnetwork.protocol-handler.warn-external.http\nnetwork.protocol-handler.warn-external.https\n```\n\n"
    },
    {
      "title": "Режим простого текста и однородность шрифтов",
      "level": 3,
      "content": "Режим простого текста позволяет просматривать все письма без оформления HTML. Включается в меню Вид > Тело сообщения в виде > Простого текста. Обычно такой текст рендерится моноширным шрифтом, а размер шрифта устанавливается системными настройками. Изменить это поведение можно в конфигурационном файле ~/.config/fontconfig/fonts.conf. Далее приведён пример, как сменить шрифт на Ubuntu Mono, 10 пикселей (шрифт доступен в виде пакета ttf-ubuntu-font-family).\n\n```\n~/.config/fontconfig/fonts.conf\n```\n\n```\n<?xml version=\"1.0\"?>\n<!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">\n<fontconfig>\n  <match target=\"pattern\">\n    <test qual=\"any\" name=\"family\"><string>monospace</string></test>\n    <edit name=\"family\" mode=\"assign\" binding=\"same\"><string>Ubuntu Mono</string></edit>\n    <!-- уменьшение размера шрифта по умолчанию до 10 для равномерности -->\n    <edit name=\"pixelsize\" mode=\"assign\"><int>10</int></edit>\n  </match>\n</fontconfig>\n```\n\nНе забудьте выполнить команду fc-cache -fv и перезагрузить программу чтобы обновить системные шрифты. Смотрите также статью Font configuration.\n\n"
    },
    {
      "title": "Миграция профиля",
      "level": 3,
      "content": "- Расширение ImportExportTools NG позволяет удобно импортировать и экспортировать профили.\n- Смотрите статью Перемещение данных Thunderbird на новый компьютер на сайте Mozilla Support.\n\nПеред началом сделайте резервную копию профиля:\n\n```\n$ cp -R ~/.thunderbird /путь/к/копии/\n```\n\nДалее приведены шаги по переносу\n\n1. Установите Thunderbird на новом устройстве.\n1. Запустите Thunderbird, ничего не делайте и просто выйдите, чтобы на новом устройстве создалась папка профиля.\n1. Скопируйте содержимое старого профиля из вашей резеврной копии в новый профиль: $ cp -R /путь/к/копии/.thunderbird/староеслучайноечисло.default/* ~/.thunderbird/новоеслучайноечисло.default/\n\n```\n$ cp -R /путь/к/копии/.thunderbird/староеслучайноечисло.default/* ~/.thunderbird/новоеслучайноечисло.default/\n```\n\n"
    },
    {
      "title": "Экспорт и импорт",
      "level": 3,
      "content": "Перед совершением действий над профилем стоит сделать резервную копию своего профиля из папки ~/.thunderbird:\n\n```\n$ cp -R ~/.thunderbird /backup/folder/\n```\n\nЕсли сломался аккаунт или требуется объединить два аккаунта следуйте по шагам:\n\n1. создайте новый профиль\n1. установите расширение ImportExportTools NG\n1. импортируйте свои профили следуя подсказкам мастера из расширения\n\n"
    },
    {
      "title": "Смена сортировки по умолчанию",
      "level": 3,
      "content": "По умолчанию Thunderbird сортирует письма по дате от старых к новым без группирования по теме. Для отдельной папки это можно настроить в интерфейсе, однако если нужно настроить это во всей почте, есть способ, описанный в ответе на сайте SuperUser (платформа Stack Exchange).\n\nПример настройки в редакторе настроек:\n\n```\nmailnews.default_sort_order = 2 // (от старых к новым)\nmailnews.default_view_flags = 1 // (группировка по теме)\n```\n\n"
    },
    {
      "title": "Поддержка Maildir",
      "level": 3,
      "content": "По умолчанию письма хранятся в формате mbox. Maildir — это формат хранения электронной почты, не требующий монопольного захвата общего файла (поведение mbox) при чтении, добавлении или изменении сообщений. Каждое сообщение хранится в отдельном файле с уникальным именем, а каждая папка представляет собой каталог на диске. Смотри статью Thunderbird/Maildir на MozillaWiki. Пример настройки в редакторе настроек:\n\n```\nmail.serverDefaultStoreContractID = @mozilla.org/msgstore/maildirstore;1\n```\n\nНекоторые ограничения: поддерживаются только каталоги «tmp» и «cur». Каталог «new» полностью игнорируется. Состояние чтения писем хранится в отдельном файле «.msf», поэтому изначально вся локальная почта, использующая Maildir, будет помечена как непрочитанная, даже если она находится в каталоге «cur». Также можно изменить этот параметр в обычном пользовательском интерфейсе: откройте Меню > Настройки > Основные > Индексация > Тип хранилища сообщений для новых учётных записей и выберите Каждое сообщение в отдельном файле (maildir).\n\n"
    },
    {
      "title": "Проверка орфографии",
      "level": 3,
      "content": "Установите пакет hunspell и языковой пакет hunspell-ru, а после — перезагрузите программу.\n\nСмотри также раздел Firefox (Русский)#Firefox не запоминает язык проверки орфографии по умолчанию.\n\n"
    },
    {
      "title": "Системные уведомления",
      "level": 3,
      "content": "Thunderbird по умолчанию использует собственные несистемные уведомления. Чтобы форсировать системные уведомления, установите в редакторе настроек параметр mail.biff.use_system_alert в значение true. Некоторые расширения используют именно их (например, ранние версии Gnome Integration).\n\nРекомендуется также установить пакет libnotify.\n\n"
    },
    {
      "title": "Установка темы",
      "level": 3,
      "content": "Thunderbird применяет текущую тему GTK, однако для полной согласованности желательно сделать две настройки. Это особенно полезно для тёмных тем.\n\n1. Чтобы читать письма в выбранной теме: Откройте Меню > Настройки > Основные Пролистайте до раздела Язык и внешний вид нажмите на кнопку Цвета… отметьте галочку Использовать системные цвета для параметра Заменять цвета, указанные содержимым, на выбранные мной выше цвета на Всегда или Только с высококонтрастными темами.\n1. Чтобы смотреть календарь в выбранной теме: перейдите в меню настроек, вкладка «календарь» отметьте галочку «Optimize colors for accessibility»\n\n1. Откройте Меню > Настройки > Основные\n1. Пролистайте до раздела Язык и внешний вид\n1. нажмите на кнопку Цвета…\n1. отметьте галочку Использовать системные цвета\n1. для параметра Заменять цвета, указанные содержимым, на выбранные мной выше цвета на Всегда или Только с высококонтрастными темами.\n\n1. перейдите в меню настроек, вкладка «календарь»\n1. отметьте галочку «Optimize colors for accessibility»\n\nКо всему этому можно использовать кастомный userchrome.css. Подробнее смотрите раздел Firefox/Tweaks#General user interface CSS settings и статью UserChrome.css на mozillaZine.\n\n"
    },
    {
      "title": "Сочетания клавиш",
      "level": 3,
      "content": "В Thunderbird, к сожалению, отсутствует простой способ отключить одноклавишные сочетания, например, чтобы нажатие «a» на клавиатуре не архивировало сообщение. Расширение tbkeys-lite позволяет изменять или удалять такие сочетания и доступно для Thunderbird 68.0 и более поздних версий.\n\n"
    },
    {
      "title": "Использование OpenPGP с внешним GnuPG",
      "level": 3,
      "content": "Начиная с версии 78.1, Thunderbird поставляется со встроенной поддержкой OpenPGP, которая ранее предоставлялась сторонними расширениями вроде Enigmail. Он предложит вам перенести существующие ключи Enigmail в Thunderbird при первом запуске после обновления. Если вы не хотите хранить свои закрытые ключи внутри Thunderbird, можно использовать Thunderbird с внешней установкой GnuPG для обеспечения безопасности ваших ключей или использования смарт-карты.\n\n1. Чтобы просмотреть ключи OpenPGP, хранящиеся в Thunderbird: Зайдите в Меню > Инструменты > Менеджер ключей OpenPGP. Отключите Вид > Показать ключи других людей, чтобы не отвлекали. Закрытые ключи выделены жирным шрифтом. Просмотрите существующие ключи и, если нужно, удалите их. Импортируйте открытые ключи любых внешних закрытых ключей, которые вы хотите использовать, используя Файл > Импорт открытых ключей из файла. Смотрите GnuPG (Русский)#Управление ключами.\n1. Чтобы включить поддержку внешнего GnuPG в Thunderbird: Убедитесь, что у вас установлены gnupg и библиотека gpgme и доступны или созданы соответствующие ключи. Откройте #Редактор настроек. Найдите mail.openpgp.allow_external_gnupg и установите для него значение true.\n1. Перейдите в Меню > Параметры учётной записи и выберите учётную запись, которую хотите использовать. Затем нажмите Дополнительные адреса электронной почты... и выберите адрес, для которого вы хотите изменить параметры OpenPGP. Щелкните Нажмите Изменить > Сквозное шифрование > Добавить ключ. Выберите Использовать внешний ключ из GnuPG и введите идентификатор своего ключа из GnuPG (последние 16 символов отпечатка вашего первичного ключа).\n\n1. Зайдите в Меню > Инструменты > Менеджер ключей OpenPGP.\n1. Отключите Вид > Показать ключи других людей, чтобы не отвлекали. Закрытые ключи выделены жирным шрифтом.\n1. Просмотрите существующие ключи и, если нужно, удалите их.\n1. Импортируйте открытые ключи любых внешних закрытых ключей, которые вы хотите использовать, используя Файл > Импорт открытых ключей из файла. Смотрите GnuPG (Русский)#Управление ключами.\n\n1. Убедитесь, что у вас установлены gnupg и библиотека gpgme и доступны или созданы соответствующие ключи.\n1. Откройте #Редактор настроек.\n1. Найдите mail.openpgp.allow_external_gnupg и установите для него значение true.\n\nОбратитесь к MozillaWiki:Thunderbird:OpenPGP:Smartcards для дальнейших инструкций и специальных конфигураций.\n\n"
    },
    {
      "title": "Ошибка сегментации LDAP",
      "level": 3,
      "content": "Ошибка LDAP clash (Bugzilla#292127) при работе с OpenLDAP возникает, когда система сконфигурирована на получение информации. Возможно, поможет обходной путь, состоящий в переименовании конфликтующей библиотеки LDAP.\n\n"
    },
    {
      "title": "Ошибка: Incoming server already exists",
      "level": 3,
      "content": "Если вы хотите пересоздать ранее удалённую учётную запись с теми же данными, вы можете получить всплывающее окно с сообщением \"Incoming server already exists\" (смотрите Bugzilla#1121151) К сожалению, это можно исправить только полной переустановкой Thunderbird:\n\n1. Сделайте резервную копию текущего профиля: $ cp -R ~/.thunderbird /путь/к/копии/\n1. Экспортируйте учётные записи, календарь и ленту через расширение, как описано в разделе #Экспорт и импорт.\n1. Закройте Thunderbird.\n1. Удалите старый профиль: rm -R ~/.thunderbird/\n1. Запустите Thunderbird.\n1. Создайте нужные учётные записи, календари и ленты (пустые).\n1. Установите расширение ImportExportTools NG.\n1. И с помощью него импортируйте данные, которые вы экспортировали ранее.\n\n```\n$ cp -R ~/.thunderbird /путь/к/копии/\n```\n\n"
    },
    {
      "title": "Thunderbird лагает при получении нового письма",
      "level": 3,
      "content": "Интерфейс может подлагивать на несколько секунд при получении нового письма. Для устранения проблемы следует установить сервер уведомлений.\n\n"
    },
    {
      "title": "Не учитывается переменная окружения LC_TIME",
      "level": 3,
      "content": "Thunderbird использует переменную окружения LC_TIME не во всех возможных случаях. Начиная с версии Thunderbird 56 можно сменить поведение в настройках, раздел «Дополнительные», вкладка «Основные», выберите из списка «Формат даты и времени» вариант «Формат языка из региональных стандартов».\n\nНачиная с версии Gecko 60 в движке используется стандарт CLDR для локализации, туда же включено форматирование дат, которое обычно настраивается при помощи LC_TIME. Однако встречается баг Bugzilla#1426907. Чтобы форсировать использование формата ISO 8601 (начало недели с понедельника), установите LC_TIME=lt_LT thunderbird.\n\nС версии 91 можно установить ряд настроек, чтобы сделать Thunderbird совместимым с ISO 8601. Большинство программ можно настроить на использование ISO 8601, установив локаль вашего региона на en_DK, но по умолчанию Thunderbird игнорирует региональные настройки локали. Смотрите [1] для подробностей.\n\n"
    },
    {
      "title": "Не авторизуется к IMAP при использовании OAuth2 в аккаунте G Suite",
      "level": 3,
      "content": "Если при авторизации к IMAP серверу использовать аккаунт G Suite со включённым OAuth2, может появиться ошибка Authentication failure while connecting to server imap.gmail.com. Для устранения этой ошибки установите значение настройки general.useragent.compatMode.firefox на true в редакторе настроек и перелогиньтесь.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- основной репозиторий исходного кода (используется Mercurial)\n- список багов на Bugzilla\n- страница локализации на Pontoon\n\n"
    }
  ]
}