{
  "title": "Thunar (العربية)",
  "url": "https://wiki.archlinux.org/title/Thunar_(%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Xfce\n- File manager functionality\n- GNOME Files\n- PCManFM\n- Nemo\n\nFrom the project home page:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the thunar package. Thunar is part of the xfce4 group and the default file manager of the Xfce desktop environment.\n\n"
    },
    {
      "title": "Plugins and addons",
      "level": 3,
      "content": "- Gnome Virtual File System — If installed, Thunar will show the trash can, removable media, and remote filesystems (mtp/smb). See File manager functionality#Mounting for more details.\n\n- Thunar Archive Plugin — Plugin which allows you to create and extract archive files using contextual menu items. It does not create or extract archives directly, but instead acts as a frontend for other programs such as File Roller (file-roller), Ark (ark), Xarchiver (xarchiver) or Engrampa (engrampa). Part of xfce4-goodies.\n\n- Thunar Media Tags Plugin — Plugin which allows you to view detailed information about media files. It also has a bulk renamer and allows editing of media tags. It supports ID3 (the MP3 file format's system) and Ogg/Vorbis tags. Part of xfce4-goodies.\n\n- Thunar Shares Plugin — Plugin which allows you to quickly share a folder using Samba from Thunar without requiring root access. See also how to configure directions.\n\n- Thunar Volume Manager — Automatic management of removable devices in Thunar. Part of xfce4.\n\n- Tumbler — External program to generate thumbnails. Also install ffmpegthumbnailer to enable video thumbnailing.\n\n- libgsf — The GNOME Structured File Library is a utility library for reading and writing structured file formats. Install if you need support for odf thumbnails.\n\n- RAW thumbnailer — A lightweight and fast raw image thumbnailer that is needed to display raw thumbnails.\n\n- Extra thumbnailers — Customized thumbnailers for Tumbler.\n\n- Folder thumbnailer — Support for custom folder thumbnails through Tumbler.\n\n- STL thumbnailer — Support for generating STL thumbnails for Tumbler.\n\n- webp-pixbuf-loader — Optional dep for gdk-pixbuf2 which adds support for generating webp thumbnails to the default thumbnailers.\n\n"
    },
    {
      "title": "Configuring keybindings",
      "level": 3,
      "content": "To configure the keybindings, edit the file ~/.config/Thunar/accels.scm. To configure Thunar's hidden variables, use xfconf-query -c thunar -l -v.\n\n"
    },
    {
      "title": "Change the default sorting behavior",
      "level": 3,
      "content": "In Thunar it is possible to change the default sorting order. The /etc/xdg/xfce4/xfconf/xfce-perchannel-xml/thunar.xml file has to be edited, most likely even created. This is what the contents should be like for sort by name, ascending:\n\n```\n/etc/xdg/xfce4/xfconf/xfce-perchannel-xml/thunar.xml\n```\n\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n\n<channel name=\"thunar\" version=\"1.0\">\n  <property name=\"last-sort-order\" type=\"string\" value=\"GTK_SORT_ASCENDING\" locked=\"*\" unlocked=\"root\"/>\n  <property name=\"last-sort-column\" type=\"string\" value=\"THUNAR_COLUMN_NAME\" locked=\"*\" unlocked=\"root\"/>\n</channel>\n```\n\n"
    },
    {
      "title": "Thunar Volume Manager",
      "level": 2,
      "content": "If both gvfs and thunar-volman are installed, Thunar can be configured to run commands automatically when media are connected. For mobile devices, which generally follow MTP, an additional gvfs-mtp package is required.\n\n"
    },
    {
      "title": "Configuration",
      "level": 3,
      "content": "It can also be configured to execute certain actions when cameras and audio players are connected. After installing the plugin:\n\n1. Launch Thunar and go to Edit > Preferences\n1. Under the 'Advanced' tab, check 'Enable Volume Management'\n1. Click configure and check the following items: Mount removable drives when hot-plugged. Mount removable media when inserted.\n1. Also make desired changes (see the example below)\n\n- Mount removable drives when hot-plugged.\n- Mount removable media when inserted.\n\nHere is an example setting for making Amarok play an audio CD.\n\n```\nMultimedia - Audio CDs: amarok --cdplay %d\n```\n\n"
    },
    {
      "title": "Custom actions",
      "level": 2,
      "content": "This section covers useful custom actions which can be accessed through Edit -> Configure custom actions and which are stored in ~/.config/Thunar/uca.xml. More examples are listed in the Thunar wiki. Furthermore, this blog post provides a comprehensive collection of custom actions.\n\n"
    },
    {
      "title": "Open Terminal Here",
      "level": 3,
      "content": "Open Terminal Here is the sole action on installation. Tell exo which terminal to use:\n\n```\n~/.config/xfce4/helpers.rc\n```\n\n```\nTerminalEmulator=terminal\n```\n\nTable content:\nName | Command | File patterns | Appears if selection contains\nOpen Terminal Here | exo-open --working-directory %f --launch TerminalEmulator | * | Directories\n\n"
    },
    {
      "title": "Search for files and folders",
      "level": 3,
      "content": "To use this action, you need to have catfish installed. The plocate and zeitgeist dependencies are optional for users that want to use a prebuilt index database.\n\nTable content:\nName | Command | File patterns | Appears if selection contains\nSearch | catfish --path=%f | * | Directories\n\n"
    },
    {
      "title": "Scan for viruses",
      "level": 3,
      "content": "To use this action, you need to have clamav and clamtk installed.\n\nTable content:\nName | Command | File patterns | Appears if selection contains\nScan for virus | clamtk %F | * | Select all\n\n"
    },
    {
      "title": "Link to Dropbox",
      "level": 3,
      "content": "Table content:\nName | Command | File patterns | Appears if selection contains\nLink to Dropbox | ln -s %f /path/to/DropboxFolder | * | Directories, other files\n\nPlease note that when using many custom actions to symlink files and folder to a particular place, it might be useful to put them into the Send To folder of the context menu to avoid that the menu itself gets bloated. This is fairly easy to achieve and requires a .desktop file in ~/.local/share/Thunar/sendto for each action to perform. Say we want to put the above Dropbox symlink action into Send To, we create a dropbox_folder.desktop with the following content. The new applied action will be active after restarting Thunar.\n\n```\n[Desktop Entry]\nType=Application\nVersion=1.0\nEncoding=UTF-8\nExec=ln -s %f /path/to/DropboxFolder\nIcon=/usr/share/icons/dropbox.png\nName=Dropbox\n```\n\n"
    },
    {
      "title": "Using Thunar to browse remote locations",
      "level": 3,
      "content": "Since Xfce 4.8 (Thunar 1.2) it is possible to browse remote locations (such as FTP servers or Samba shares) directly in Thunar. To enable this functionality, ensure that gvfs and sshfs (as well as gvfs-smb if you need SMB/CIFS support) are installed. A 'Network' entry is visible in Thunar's side bar and remote locations can be opened by using the following URI schemes in the location dialog (opened with Ctrl+l): smb://, ftp://, ssh://, sftp://, davs:// & followed by the server hostname or IP address.\n\nThere is no URI scheme for NFS shares, but Thunar can issue a mount command if you setup your fstab properly.\n\n```\n/etc/fstab\n```\n\n```\n# nas1 server\nnas1:/c/home\t\t/media/nas1/home\tnfs\tnoauto,user,_netdev,bg  0 0\n```\n\nWhat is important here is the noauto which prevents the share from being mounted until you click on it, user which allows any user to mount (and unmount) the share, _netdev which makes network connectivity a pre-requisite, and finally, bg which puts the mounting operation in the background so if your server requires some spin-up time, you will not have to deal with time out messages and re-clicking until it works.\n\n- If you want to permanently store passphrases of remote filesystem locations, you have to install GNOME Keyring.\n- It can be necessary to specify the mountpoint as a subfolder to /media in order for Thunar to display the new device for any non-root user.\n\n"
    },
    {
      "title": "Starting in daemon mode",
      "level": 3,
      "content": "Thunar may be run in daemon mode. This has several advantages, including a faster startup for Thunar, Thunar running in the background and only opening a window when necessary (for instance, when a flash drive is inserted), and letting Thunar handle automatic mounting of removable media.\n\nMake sure the command thunar --daemon is autostarted on login. See Xfce and Autostarting for more details.\n\n"
    },
    {
      "title": "Solving problem with slow cold start",
      "level": 3,
      "content": "Some people still have problems with Thunar taking a long time to start for the first time. This is due to gvfs checking the network, preventing Thunar from starting until gvfs finishes its operations. To change this behaviour, edit /usr/share/gvfs/mounts/network.mount and change AutoMount=true to AutoMount=false.\n\n"
    },
    {
      "title": "Hide Shortcuts in Side Pane",
      "level": 3,
      "content": "There is a hidden menu to hide Shortcuts in the Side Pane.\n\nRight click in the Side Pane where there are no shortcuts, like on the DEVICES section label. Then you will get a pop-up menu where you can uncheck items you do not want displayed.\n\n"
    },
    {
      "title": "Assign keyboard shortcuts in Thunar",
      "level": 3,
      "content": "See GTK#Keyboard shortcuts,\n\n"
    },
    {
      "title": "Showing partitions defined in fstab",
      "level": 3,
      "content": "By default, Thunar will not show in devices any partitions defined in /etc/fstab besides the root partition.\n\nWe can change that by adding the option x-gvfs-show to fstab for the partition we wish to show.\n\n"
    },
    {
      "title": "Automounting of large external drives",
      "level": 3,
      "content": "Note: **This article or section is being considered for removal.** This article or section is being considered for removal.\n\nThis article or section is being considered for removal.\n\nIf Thunar refuses to mount large removable media (size > 1TB) although thunar-volman and gvfs have been installed, then try installing a different automounter such as udevilAUR or udiskie. The latter should be preferred as it uses udisks2 and thus is compatible with gvfs. To start udiskie with udisks2 support, add the following line to your autostart file:\n\n```\nudiskie -2 &\n```\n\n"
    },
    {
      "title": "Tumblerd hangs up, uses too much CPU",
      "level": 3,
      "content": "Tumblerd, the service that watches the file system and notifies the system when a thumbnail needs to be made, may get stuck in a loop, using 100% of the system's CPU; see the bug report. The following script is a temporary workaround to stop this from happening. Copy, and paste this into a .sh file, save it somewhere in your home directory, mark the file as executable and then set up the system to autostart it at system startup.\n\n```\n#!/bin/bash\nperiod=20\ntumblerpath=\"/usr/lib/*/tumbler-1/tumblerd\" # The * here should find the right one, whether 32 and 64-bit\ncpu_threshold=50\nmem_threshold=20\nmax_strikes=2                               # max number of above cpu/mem-threshold's in a row\nlog=\"/tmp/tumblerd-watcher.log\"\n\nif [[ -n \"${log}\" ]]; then\n    cat /dev/null > \"${log}\"\n    exec >\"${log}\" 2>&1\nfi\n\nstrikes=0\nwhile sleep \"${period}\"; do\n    while read pid; do\n\tcpu_usage=$(ps --no-headers -o pcpu -f \"${pid}\"|cut -f1 -d.)\n\tmem_usage=$(ps --no-headers -o pmem -f \"${pid}\"|cut -f1 -d.)\n\n\tif [[ $cpu_usage -gt $cpu_threshold ]] || [[ $mem_usage -gt $mem_threshold ]]; then\n\t    echo \"$(date +\"%F %T\") PID: $pid CPU: $cpu_usage/$cpu_threshold %cpu MEM: $mem_usage/$mem_threshold STRIKES: ${strikes} NPROCS: $(pgrep -c -f ${tumblerpath})\"\n\t    (( strikes++ ))\n\t    if [[ ${strikes} -ge ${max_strikes} ]]; then\n\t\tkill \"${pid}\"\n\t\techo \"$(date +\"%F %T\") PID: $pid KILLED; NPROCS: $(pgrep -c -f ${tumblerpath})\"\n\t\tstrikes=0\n\t    fi\n\telse\n\t    strikes=0\n\tfi\n    done < <(pgrep -f ${tumblerpath})\ndone\n```\n\n"
    },
    {
      "title": "Trash/network icons disappear randomly",
      "level": 3,
      "content": "Make sure all Thunar instances start after gvfs. [1] For thunar --daemon, you can create a wrapper that waits until GVFS is active:\n\n```\n/usr/local/bin/Thunar\n```\n\n```\n#!/bin/bash\nif [[ $1 == --daemon ]]; then\n  until pgrep gvfs >/dev/null; do\n    sleep 1\n  done\n  exec /usr/bin/Thunar \"$@\"\nelse\n  exec /usr/bin/Thunar \"$@\"\nfi\n```\n\n"
    },
    {
      "title": "Not authenticated to mount filesystems",
      "level": 3,
      "content": "See File manager functionality#Troubleshooting.\n\n"
    },
    {
      "title": "Thunar new window or tab being too slow to open",
      "level": 3,
      "content": "It might be the case that you have many files under the folder that you have set to be the XDG_TEMPLATES_DIR. See XDG user directories.\n\nThe solution is to move files from whatever folder is the XDG_TEMPLATES_DIR to another one, or set the XDG_TEMPLATES_DIR to another folder.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Thunar project page\n- Thunar Volume Manager project page\n- This list of plugins\n- Several settings, like showing the full path in the title, are available through xfconf-query. See this list for more details.\n\n"
    }
  ]
}