{
  "title": "Transmission (Italiano)",
  "url": "https://wiki.archlinux.org/title/Transmission_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Transmission is a light-weight and cross-platform BitTorrent client.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "There are three packages providing the transmission client:\n\n- transmission-cli – The daemon, with CLI tools and a #Web interface.\n- transmission-gtk – The graphical interface utilizing GTK 4.\n- transmission-qt – The graphical interface utilizing Qt 6.\n\nThere are also various third-party clients to connect to the daemon with:\n\n- tremcAUR or tremc-gitAUR – Curses interface for the daemon.\n- stigAUR or stig-gitAUR – Curses interface for the daemon.\n- transmission-remote-gtk – GTK 3 graphical interface for the daemon.\n- transgui-qtAUR, transgui-gtkAUR – Graphical interface for the daemon developed with Lazarus.\n- trgui-ngAUR, or trgui-ng-gitAUR or trgui-ng-binAUR – A rewrite of the transgui project using Tauri.\n\n"
    },
    {
      "title": "Configuring the GUI version",
      "level": 2,
      "content": "Both GUI versions, transmission-gtk and transmission-qt, can function autonomously without a formal back-end daemon.\n\nGUI versions are configured to work out-of-the-box, but the user may wish to change some of the settings. The default path to the GUI configuration files is ~/.config/transmission.\n\nA guide to configuration options can be found on Transmission's Github.\n\n"
    },
    {
      "title": "Transmission daemon and CLI",
      "level": 2,
      "content": "The commands for transmission-cli are:\n\n"
    },
    {
      "title": "Starting and stopping the daemon",
      "level": 3,
      "content": "Transmission's daemon can be run:\n\n- As the user transmission, by starting/enabling transmission.service. The user can be changed as explained in #Choosing a user.\n- As your own user, by running under your user name:\n\n```\n$ transmission-daemon\n```\n\nStarting the daemon will create an initial configuration file. See #Configuring the daemon.\n\nThe Transmission daemon can be stopped with:\n\n```\n$ transmission-remote --exit\n```\n\nAn alternative option is:\n\n```\n$ pkill -3 transmission-daemon\n```\n\n"
    },
    {
      "title": "Reducing journal spam",
      "level": 3,
      "content": "Running transmission-daemon can lead to a lot of unwanted journal entries. Output can be filtered by starting it with a small wrapper script. The following example also provides some notifications:\n\n```\ntranswrap.sh\n```\n\n```\n#!/bin/zsh\nkillall transmission-daemon 2> /dev/null\ntransmission-daemon --foreground --log-info 2>&1 | while read line; do\n\techo $line |\n\t\tgrep -v \"announcer.c:\\|platform.c:\\|announce done (tr-dht.c:\" |\n\t\tgrep -v \"Saved.*variant.c:\" |\n\t\twhile read line; do\n\t\t\techo $line | grep -q \"Queued for verification (verify.c:\" &&\n\t\t\t\tnotify-send --app-name=\"Transmission Started\" \"${line#* * }\"\n\t\t\techo $line | grep -q \"changed from .Incomplete. to .Complete.\" &&\n\t\t\t\tnotify-send --app-name=\"Transmission Complete\" \"${line#* * }\"\n\t\t\techo $line | systemd-cat --identifier=\"TransWrap\" --priority=5\n\t\tdone 2>&1 > /dev/null\n\tdone&disown\n```\n\n"
    },
    {
      "title": "Netctl",
      "level": 4,
      "content": "It may be desirable to run transmission only on certain networks. The following script checks that the connection is to a list of authorized networks and then proceeds to launch transmission-daemon.\n\n```\n/etc/netctl/hooks/90-transmission.sh\n```\n\n```\n#!/bin/bash\n\n# The SSIDs for which we enable this.\ndeclare -A ssids=(\n    [\"network_1\"]=y\n    [\"network_2\"]=y\n)\n\nif [[ ${ssids[$SSID]} ]]; then\n    case $ACTION in\n        CONNECT|REESTABLISHED)\n            # Need to wait, otherwise doesn't seem to bind to 9091.\n            sleep 30\n            systemctl start transmission\n            ;;\n        *)\n            systemctl stop transmission\n            ;;\n    esac\nfi\n```\n\n"
    },
    {
      "title": "Choosing a user",
      "level": 3,
      "content": "Choose how you want to run transmission:\n\n- As a separate user, transmission by default (recommended for increased security).\n\nBy default, transmission creates a user and a group transmission, with its home files at /var/lib/transmission/, and runs as this \"user\". This is a security precaution, so transmission, and its downloads, have no access to files outside of /var/lib/transmission/. Configuration, operation, and access to downloads needs to be done with \"root\" privileges (e.g. by using sudo).\n\n- Under your own user. To set this up, override the provided service file and specify your username:\n\n```\n/etc/systemd/system/transmission.service.d/username.conf\n```\n\n```\n[Service]\nUser=your_username\n```\n\n"
    },
    {
      "title": "Configuring the daemon",
      "level": 3,
      "content": "Create an initial configuration file by starting the daemon.\n\n- If running Transmission under the username transmission, the configuration file will be located at /var/lib/transmission/.config/transmission-daemon/settings.json.\n\n- If running Transmission under your own username, the configuration file will be located at ~/.config/transmission-daemon/settings.json.\n\nOne can customize the daemon by using a Transmission client or using the included web interface accessible via http://localhost:9091 in a supported browser.\n\nA guide to configuration options can be found on the Transmission web site: https://github.com/transmission/transmission/blob/main/docs/Editing-Configuration-Files.md\n\n- If you want to edit the configuration manually using a text editor, stop the daemon first; otherwise, it would overwrite its configuration file when it closes.\n- Alternatively, the daemon can be instructed to reload its configuration with SIGHUP, by running kill -s SIGHUP $(pidof transmission-daemon).\n\nA recommendation for those running under username transmission is to create a shared download directory with the correct permissions to allow access to both the transmission user and system users, and then to update the configuration file accordingly. For example:\n\n```\n# mkdir /mnt/data/torrents\n# chown -R facade:transmission /mnt/data/torrents\n# chmod -R 775 /mnt/data/torrents\n```\n\nNow /mnt/data/torrents will be accessible for the system user facade and for the transmission group to which the transmission user belongs. Making the target directory world read/writable is highly discouraged (i.e. do not chmod the directory to 777). Instead, give individual users/groups appropriate permissions to the appropriate directories.\n\nAn alternative is to add your user to the transmission group (#usermod -a -G transmission yourusername) and then modify the permissions on the /var/lib/transmission and /var/lib/transmission/Downloads directories to allow rwx access by members of the transmission group.\n\n"
    },
    {
      "title": "Host whitelist",
      "level": 4,
      "content": "If you plan to access the Transmission daemon over the network using the server's hostname, you need to add this hostname to rpc-host-whitelist in settings.json. Otherwise, you will get a \"421 Misdirected Request\" error when accessing the server.\n\nIf you connect to the daemon using the server's IP-address, this is not required.\n\n"
    },
    {
      "title": "Watch dir",
      "level": 4,
      "content": "If you want to Automatically add .torrent files from a folder, but you find that the watch-dir and watch-dir-enabled options set in the configuration file do not work, you can start the transmission daemon with the flag -c /path/to/watch/dir.\n\nIf you are using systemd, edit the transmission.service unit as described in systemd#Editing provided units.\n\n"
    },
    {
      "title": "Enable IPv6",
      "level": 4,
      "content": "By default, the daemon only listens for IPv4 connections. To also listen for IPv6 connections, change the rpc-bind-address option to \"::\" in settings.json.\n\n"
    },
    {
      "title": "CLI Examples",
      "level": 4,
      "content": "If you want to remove all finished torrents you can use the following command with your own username and password:\n\n```\n# transmission-remote -n 'username:password' -l | grep 100% | awk '{print $1}'| paste -d, -s | xargs -i transmission-remote -t {} -r\n```\n\nSeed a torrent which has already been downloaded:\n\n```\n# transmission-remote [HOST] --torrent=example.torrent -a example.torrent --verify --download-dir=/dir/to/folder --start\n```\n\n"
    },
    {
      "title": "Notification",
      "level": 2,
      "content": "Stop transmission-daemon and add these in .config/transmission-daemon/settings.json:\n\n```\n\"script-torrent-added-enabled\": true,\n   \"script-torrent-added-filename\": \"path/to/transmission-handler.sh\",\n   \"script-torrent-done-enabled\": true,\n   \"script-torrent-done-filename\": \"path/to/transmission-handler.sh\",\n```\n\n```\ntransmission-handler.sh\n```\n\n```\n#!/bin/bash\n\npercentage=$(transmission-remote -t $TR_TORRENT_ID -l | awk -v ID=\"$TR_TORRENT_ID\" '$0 ~ ID{print $2}')\n\nif [ $percentage != \"100%\" ]\nthen\n     notify-send --app-name=\"Transmission Started\" \"Transmission: started $TR_TORRENT_NAME\"\nelse\n     notify-send --app-name=\"Transmission Complete\" \"Transmission: downloaded $TR_TORRENT_NAME\"\nfi\n```\n\n"
    },
    {
      "title": "The GUI way",
      "level": 3,
      "content": "Once Transmission is installed, you can easily set up the web interface. All you need to do is click the edit menu and select preferences. Click the Remote tab and enable Allow remote access.\n\nHere, you have the opportunity to change the default listening port from 9091.\n\nCheck the Use authentication and fill in a username and password so that authentication can be used.\n\nTo increase security, you can restrict access from any IP address by enabling Only allow these IP addresses.\n\nNow you are ready to launch the web interface by either clicking on the Open web client, which makes your default web browser open it, or manually reaching http://TARGET_IP_ADDRESS:PORT with any supported web browser.\n\nIf you have not changed the listening port, the default one is 9091. In this case, the link is http://localhost:9091\n\n"
    },
    {
      "title": "The CLI way",
      "level": 3,
      "content": "You do not need a graphical interface to set up the web interface, the daemon offers the very same options. You can reach the web interface without specifing any flags. See #Starting and stopping the daemon\n\nNevertheless, you can specify everything that you see in the previous section:\n\n```\n$ transmission-daemon --auth --username arch --password linux --port 9091 --allowed \"127.0.0.1\"\n```\n\nis equivalent to\n\n```\n$ transmission-daemon -t -u arch -v linux -p 9091 -a \"127.0.0.1\"\n```\n\n"
    },
    {
      "title": "Optional web UI theme",
      "level": 3,
      "content": "If the default user interface of the web app seems outdated and less fancy than expected, try using https://git.eigenlab.org/sbiego/transmission-web-soft-theme for a simple CSS theme.\n\nhttps://github.com/ronggang/transmission-web-control also provides a full replacement that can coexist with the default UI.\n\n"
    },
    {
      "title": "Usage as makepkg DLAGENT",
      "level": 2,
      "content": "Transmission can be used as magnet download agent for makepkg with the transmission-dlagentAUR download agent.\n\nMagnet URIs need their prefix to be changed from magnet:? to magnet://.\n\n"
    },
    {
      "title": "Cannot access the daemon over the network",
      "level": 3,
      "content": "The daemon is started after network.service was initialised. However, if you enable the service dhcpcd as opposed to the device-specific service, such as dhcpcd@enp1s0.service for example, it may happen that Transmission is started too early and cannot bind to the network interface. Thus, the web interface is unreachable. A possible solution is to add the Requires line to the unit's configuration file:\n\n```\n/etc/systemd/system/transmission.service.d/fixdep.conf\n```\n\n```\n[Unit]\nRequires=network.target\n```\n\n"
    },
    {
      "title": "Web interface cannot be reached",
      "level": 3,
      "content": "```\n404: Not Found\n\nCouldn't find Transmission's web interface files!\n\nUsers: to tell Transmission where to look, set the TRANSMISSION_WEB_HOME environment variable to the folder where the web interface's index.html is located.\n\nPackage Builders: to set a custom default at compile time, #define PACKAGE_DATA_DIR in libtransmission/platform.c or tweak tr_getClutchDir () by hand.\n```\n\nEven if you use the graphical interface, you still need to install transmission-cli in order for web interface to work.\n\n"
    },
    {
      "title": "Failed to set send/receive buffer",
      "level": 3,
      "content": "Transmission might display either of these messages in the journal on startup:\n\n```\nUDP Failed to set receive buffer: requested 4194304, got 425984\nUDP Failed to set send buffer: requested 1048576, got 425984\n```\n\nThese can be fixed by setting net.core.rmem_max=4194304 and net.core.wmem_max=1048576 with sysctl.\n\n"
    },
    {
      "title": "transmission-remote frequently times out or web interface is unresponsive",
      "level": 3,
      "content": "Transmission does not handle disk IO asynchronously, causing it to become unresponsive when doing heavy writes, see [1]. Consider putting transmission's download directory on faster storage, such as an ssd instead of an hdd.\n\n"
    },
    {
      "title": "Missing tray icon for transmission-gtk",
      "level": 3,
      "content": "Tray icon for GTK 4 version is not working for now. There is an option to use the GTK 3 version transmission-gtk3AUR.\n\n"
    },
    {
      "title": "401: Unauthorized",
      "level": 3,
      "content": "The following error may appear when using transmission-remote after setting a username and password for the web interface:\n\n```\n< h1>401: Unauthorized\\Unauthorized User\n```\n\nThis happens because a username and password were set. After this, all commands from transmission-remote must be authenticated. See: transmission-remote commands are erroring with Unauthorized user\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Transmission wiki (old)\n- Transmission documentation on GitHub\n- Headless Usage\n\n"
    }
  ]
}