{
  "title": "Twm (Italiano)",
  "url": "https://wiki.archlinux.org/title/Twm_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Window manager (Italiano)\n\ntwm è un window manager per Xorg. È un programma piccolo, che utilizza Xlib invece di una libreria di widget, e quindi richiede poche risorse di sistema. Anche se semplice, è altamente configurabile: caratteri, colori, larghezza dei bordi, barra del titolo etc. possono essere impostati dall'utente.\n\ntwm è stato scritto da Tom LaStrange, uno sviluppatore che era frustrato dalle limitazioni di uwm (Ultrix Window Manager), unico gestore di finestre per X11 al momento del suo rilascio. [1]\n\nTWM ha sostituito uwm come window manager predefinito di X11 dalla pubblicazione di X11R4 nel 1989.[2]\n\nNegli anni l'acronimo twm ha indicato Tom's Window Manager, Tab Window Manager e più recentemente di Timeless Window Manager.\n\n"
    },
    {
      "title": "Installazione",
      "level": 2,
      "content": "Installare xorg-twm, disponibile nei repository ufficiali.\n\n"
    },
    {
      "title": "Avvio",
      "level": 2,
      "content": "Eseguire twm con Xinit.\n\nÈ possibile avviare twm tramite un display manager. Il file twm.desktop non esiste, quindi deve essere creato al percorso /usr/share/xsessions/. Nel nuovo file /usr/share/xsessions/twm.desktop inserire:\n\n```\n/usr/share/xsessions/twm.desktop\n```\n\n```\n[Desktop Entry]\nName=twm\nComment=xorg-twm\nTryExec=twm\nExec=twm\nType=Application\n```\n\n"
    },
    {
      "title": "Configurazione",
      "level": 2,
      "content": "Per impostazione predefinita, twm appare molto datato e poco intuitivo. Modificando il file ~/.twmrc è possibile personalizzare twm per renderlo più user-friendly.\n\nLa pagina twm(1) spiega in dettaglio quali comandi possono essere utilizzati nel file ~/.twmrc.\n\n"
    },
    {
      "title": "Esempi di file .twmrc",
      "level": 3,
      "content": "Diversi file ~/.twmrc sono stati pubblicati online. Ad esempio:\n\n- Sample .twmrc file (Physics Department Unix Login Mini-Howto, W&M University tramite Wayback Machine)\n- sample twmrc files[link interrotto 2024-11-06] (Apple Open Source/X11/X11-0.46.4)\n- system.twmrc[link interrotto 2024-11-06] (Apple Open Source/X11/X11-0.46.4)\n- twm configs - 1 (custompc.plus.com)\n- twm configs - 2 (custompc.plus.com)\n\nAnche una ricerca su Google per \"twmrc\" può essere utilizzata per qualche nuova idea.\n\n"
    },
    {
      "title": "Strumenti per la configurazione",
      "level": 3,
      "content": "Switch Twm Scheme[link interrotto 2024-07-30] è una raccolta di script per facilitare la creazione e l'utilizzo di diverse configurazioni di twm.\n\n"
    },
    {
      "title": "Versione modificata",
      "level": 3,
      "content": "Esiste una versione modificata, non presente nei repository, con funzionalità aggiornate come la trasparenza. Una descrizione ed uno script di compilazione sono disponibile sulla mailing list di xorg. Può essere provato installando xcompmgr, eseguendo lo script di compilazione, mettendo i file risultanti twm e dot.twmrc nelle cartelle apposite, e modificando il file ~/.xinitrc in modo che le ultime due righe siano:\n\n```\nxcompmgr -o 0.3  -c -r 8 -t -10 -l -12 &\n/path-to-directory/twm -visual TrueColor -depth 32 -f /path-to-directory/dot.twmrc\n```\n\n"
    },
    {
      "title": "Barre del titolo e menù troppo grandi",
      "level": 3,
      "content": "Può capitare che le barre del titolo ed i menù di twm siano troppo larghi - il doppio di quanto ci si aspetterebbe. È un problema di localizzazione che capita quando viene utilizzata una localizzazione UTF-8. Per risolvere il problema impostare la localizzazione a C. Vedere anche [3].\n\n"
    },
    {
      "title": "Altre risorse",
      "level": 2,
      "content": "- Graham's TWM Page!\n- Graham's TWM Page 2\n- TWM -- Revised Edition -- Again\n- twm(1) su man\n- twm official Gitlab\n- twm on Wikipedia\n- X Window System User's Guide - Ch. 3 Using the twm Window Manager\n- X Window System User's Guide - Ch. 10 Customizing the twm Window Manager\n\n"
    }
  ]
}