{
  "title": "Twm (Español)",
  "url": "https://wiki.archlinux.org/title/Twm_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-11-08** \n\nArtículos relacionados\n\n- Gestor de ventanas\n\ntwm es un gestor de ventanas para Xorg. Es un programa pequeño, construido con Xlib en lugar de una librería de widget, y por ello, es muy liviano con los recursos del sistema. Incluso siendo simple, es altamente configurable; Tipos de letras, colores, ancho del borde, botones de la barra de títulos, etc. pueden ser modificados por el usuario.\n\ntwm fue escrito por Tom LaStrange, un desarrollador frustrado por las limitaciones de uwm (Ultrix Window Manager), el único gestor de ventanas que exisitía cuando X11 fue lanzado. [[1]\n\ntwm suplantó a uwm como el gestor de ventanas predeterminado proporcionado por X11 desde el lanzamiento de X11R4 en 1989.[2]\n\ntwm ha significado Tom's Window Manager, Tab Window Manager y recientemente Timeless Window Manager.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "twm es provisto por el paquete xorg-twm.\n\n"
    },
    {
      "title": "Ejecución",
      "level": 2,
      "content": "Ejecute twm con xinit.\n\nTambién puede ejecutar twm con un gestor de pantalla. El archivo twm.desktop no existe, asi que debe ser creado en /usr/share/xsession/. En el archivo recién creado /usr/share/xsessions/twm.desktop, copie y pegue lo siguiente:\n\n```\n/usr/share/xsessions/twm.desktop\n```\n\n```\n[Desktop Entry]\nName=twm\nComment=xorg-twm\nTryExec=twm\nExec=twm\nType=Application\n```\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "De manera predeterminada, twm se ve muy anticuado y poco intuitivo. Al crear el archivo ~/.twmrc, uno puede personalizar twm para hacerlo un poco más amigable.\n\ntwm(1) da de manera muy detallada los comandos que pueden ser utilizados en su archivo ~/.twmrc.\n\n"
    },
    {
      "title": "Ejemplos de .twmrc",
      "level": 3,
      "content": "Muchos archivos ~/.twmrc han sido publicados en linea. Algunos ejemplos incluyen:\n\n- Archivo .twmrc de muestra (Mini-Howto de inicio de sesión de Unix del Departamento de Física, W&M University a través de Wayback Machine)\n- Archivos twmrc[enlace roto 2023-05-06] ('Apple Open Source/X11/X11-0.46.4 )\n- system.twmrc[enlace roto 2024-11-06] ('Apple Open Source/X11/X11- 0.46.4)\n- twm configs - 1 (custompc.plus.com)\n- twm configs - 2 (custompc.plus.com)\n\nUna búsqueda en google de \"twmrc\" puede también ser de utilidad para encontrar nuevas ideas.\n\n"
    },
    {
      "title": "Herramientas de configuración",
      "level": 3,
      "content": "Switch Twm Scheme[enlace roto 2024-07-30] es una colección de scripts para facilitar la creación y el cambio entre configuraciones twm.\n\n"
    },
    {
      "title": "Versión parchada",
      "level": 3,
      "content": "Existe una versión parchada, que no se encuentra en los repositorios, con funciones actualizadas como transparencia. Una descripción y un script de compilación se encuentran en la lista de correos de xorg. Se puede probar instalando xcompmgr, ejecutando el script de compilación, colocando los archivos twm y dot.twmrc resultantes en un directorio conveniente y editando el archivo ~/.xinitrc para que las últimas dos lineas sean\n\n```\nxcompmgr -o 0.3  -c -r 8 -t -10 -l -12 &\n/ruta-al-directorio/twm -visual TrueColor -depth 32 -f /ruta-al-directorio/dot.twmrc\n```\n\n"
    },
    {
      "title": "Títulos de ventanas y menús agrandados",
      "level": 3,
      "content": "Usted puede haber encontrado que la barras de título y las entradas del menú en TWM son demasiado grandes - el doble de lo que uno esperaría. Este es un problema con los locales en TWM que sucede cuando un locale UTF-8 es utilizado. Cambiando el locale a C se arregla el problema. Véase [3]\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Página TWM de Graham!\n- Página TWM de Graham 2\n- TWM -- Edición revisada -- Again\n- Página de manual twm(1)\n- Gitlab oficial de twm\n- twm en Wikipedia\n- Guía de usuario del sistema X Window - Ch. 3 Uso del gestor de ventanas twm\n- Guía de usuario del sistema X Window - Ch. 10 Personalización del gestor de ventanas twm\n\n"
    }
  ]
}