{
  "title": "Työpöytäympäristö",
  "url": "https://wiki.archlinux.org/title/Ty%C3%B6p%C3%B6yt%C3%A4ymp%C3%A4rist%C3%B6",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Aiheeseen liittyen\n\n- Comparison of desktop environments\n- Category:Freedesktop.org\n\nTyöpöytäympäristö (engl. Desktop Environment, DE) on toteutus työpöytä-metaforasta. Se koostuu ohjelmista, jotka jakavat saman graafisen käyttöliittymän (GUI).\n\n"
    },
    {
      "title": "Yleiskatsaus",
      "level": 2,
      "content": "Työpöytäympäristö niputtaa yhteen kokoelman eri komponentteja antaakseen yleisiä graafisen käyttöliittymän elementtejä kuten kuvakkeita, työkalurivejä, taustakuvia sekä erilaisia pienoisohjelmia työpöydälle. Sen lisäksi monet käyttöliittymät sisältävät kasan integroituja sovelluksia sekä apuvälineitä. Kaikkein tärkeimpänä kumminkin on työpöytäympäristön sisältämä (tämän oma) ikkunointiohjelma (window manager), joka voidaan kumminkin korvata jollain toisella yhteensopivalla ikkunointiohjelmalla.\n\nKäyttäjä on vapaa konfiguroimaan käyttämänsä graafisen ympäristön monellakin eri tavalla. Työpöytäympäristöt tarjoavat täyden ja kätevän tavan saavuttaa tämä. Huomioi, että käyttäjät ovat vapaita asentamaan tai vaihtamaan sovelluksia useistakin eri työpöytäympäristöistä. Esimerkiksi, KDE käyttäjä voi asentaa GNOME sovelluksia kuten Epiphany verkkoselaimen, jos tämä on käyttäjälle suosiollisempi kuin KDE:n Konqueror verkkoselain. Yksi haittapuoli tälläisessä lähestymisessä on se, että monien työpöytäympäristöjen käyttämät sovellukset nojaavat työpöytäympäristön omiin kirjastoihin. Tällöin saatta asennettavan ohjelman riippuvuudet lisätä koodin määrää varsinkin, jos asennettavia ohjelmia on useammasta työpöytäympäristöstä. Käyttäjien, joiden tallennustila on vähäinen, kannattaa välttää tälläistä sekoittelua ja hakea vaihtoehtoisia ohjelmia, joilla ei ole riippuvuuksia muiden työpöytäympäristöjen kirjastoihin.\n\nSen lisäksi, Työpöytäympäristön tarjoamat ohjelmat usein integroituvat paremmin oman alkuperäisen ympäristönsä kanssa. Ympäristön sekoittaminen toisten pienoisohjelma työkalusarjojen kanssa voi aiheuttaa pieniä epäjohdonmukaisuuksia (mikäli käyttöliittymät käyttävät erilaisia kuvakkeen ja pienoisohjelmien tyylejä). Käytettävyyden kannalta, sekoitetut ympäristöt eivät ehkä käyttäydy samalla tavalla (kuten kuvakkeiden klikkaukset yhdesti ja kahdesti; kuvakkeiden siirtämistoiminnallisuus) mahdollisesti aiheuttamalla hämmenystä tai odottamatonta käytöstä.\n\nEnnen työpöytäympäristön asentamista, toimiva X-palvelimen asennus vaaditaan. Katso Xorg-artikkeli lisätietoa varten. Jotkin työpöytäympäristöt saattavat vaihtoehtoisesti tukea Waylandia , mutta valtaosa näistä on vielä koevaiheessa.\n\n"
    },
    {
      "title": "Virallisesti tuetut",
      "level": 3,
      "content": "- Budgie — Budgie on työpöytäympäristö suunniteltu modernille käyttäjälle. Budgie on yksinkertainen ja hienostunut.\n\n- Cinnamon — Cinnamon pyrkii tarjoamaan perinteisen käyttökokemuksen. Cinnamon on haarauma GNOME 3:sta.\n\n- Deepin — Deepin työpöytäliittymän ja ohjelmien piirteenä on intuitiivinen ja hienostunut muotoilu.\n\n- Enlightenment — Enlightenment ympäristö tarjoaa tehokkaan ikkunointiohjelman perustuen Enlightenment Foundation Libraries ja muihin tarpeellisiin työpöytä komponentteihin kuten tiedostoselain, työpöydän kuvakkeet ja pienoisohjelmat. Se tukee erinäisiä teemoja vaikka se pystyy myös toimimaan vanhemmissakin tietokoneissa tai sulautetuissa laitteissa.\n\n- GNOME — GNOME työpöytäympäristö on kiehtova ja intuitiivinen työpöytä, josta löytyy molemmat moderni (GNOME) ja klassinen (GNOME Classic) istunto.\n\n- GNOME Flashback — GNOME Flashback on istunto GNOME 3:n päälle, jota alun perin kutsuttiin GNOME fallback-asetukseksi. Työpöytä asetelma ja alla oleva teknologia on samanlainen kuin GNOME 2:ssa.\n\n- KDE Plasma — KDE Plasma työpöytäympäristö on hyvin tuttu työympäristö. Plasma tarjoaa kaikki työkalut, joita tarvitaan modernin työpöydän tietojenkäsittelykokemukseen, joten voit olla tehokas työssäsi heti alusta alkaen.\n\n- LXDE — Lightweight X11 Desktop Environment on nopea ja energiatehokas työpöytäympäristö. Sen mukana tulee moderni käyttöliittymä, kielituki monille kielille, standardit näppäinoikotiet ja muita ominaisuuksia kuten välisivutettu tiedostoselain. Keskeisesti suunniteltu hyvin kevyeksi, LXDE pyrkii olemaan vähemmän suoritinta ja muistia syövä kuin muut ympäristöt.\n\n- LXQt — LXQt on Qt porttaus ja tuleva versio LXDE:stä. Se on kahden projektin, LXDE-Qt ja Razor-qt projektien, tuote: kevyt, modulaarinen, supernopea ja käyttäjäystävällinen työpöytäympäristö.\n\n- MATE — MATE tarjoaa intuitiivisen ja miellyttävän työpöydän Linux käyttäjille. MATE sai alkunsa haarautumana GNOME 2:sta, mutta käyttää nykyään GTK 3 pohjana.\n\n- Sugar — Sugar Learning Platform on tietokoneympäristö, joka koostuu eri lapsille suunnatuista toiminnoista, jotka auttavat oppimaan hyvin toiminnallisesti ja vuorovaikutteisesti. Sugar on ydin komponenttina maailmanlaajuisessa projektissa joka tarjoaa jokaiselle lapselle mahdollisuuden tasokkaaseen oppimiseen — sitä käyttää noin miljoona lasta maailmanlaajuisesti 25 eri kielellä yli 40:ssä maassa. Sugar tarjoaa tavan auttaa ihmisiä saavuttamaan paremmat mahdollisuudet elämälle tasokkaan opetuksen kautta joka monelta uupuu vielä tänä päivänä.\n\n- UKUI — UKUI on kevyt Linux työpöytäympäristö, joka perustuu GTK:hon ja Qt:hen. UKUI on oletus työpöytäympäristö Ubuntu Kylin:issä.\n\n- Xfce — Xfce on osana perinteistä UNIX philosophy modularisuutta ja uudelleen käytettävyyttä. Se koostuu useista komponenteista jotka mahdollistavat täyden toiminnallisuuden joka on odotettavissa modernista työpöytäympäristöstä ja silti pysyen melko kevyenä. Kaikki komponentit on pakattu erikseen ja voit valita näistä itsellesi sopivimmat luodaksesi optimaalisen yksilöllisen työympäristön.\n\n"
    },
    {
      "title": "Epävirallisesti tuettu",
      "level": 3,
      "content": "- EDE — \"Equinox Desktop Environment\" on työpöytäympäristö suunniteltu yksinkertaiseksi, erittäin kevyeksi ja nopeaksi.\n\n- Liri — Liri on työpöytäympäristö modernilla suunnitelulla ja ominaisuuksilla. Liri on yhdistelmä Hawaii, Papyros ja Liri Project. Erittäin kokeellinen.\n\n- Lumina — Lumina on kevyt työpöytäympäristö kirjoitettu Qt 5:llä FreeBSD:lle joka käyttää Fluxboxia ikkunointiin.\n\n- Moksha — Haarauma Enlightenment:ista, joka on tällä hetkellä käytössä oletukselta työpöytäympäristönä Ubuntuun perustuvassa Bodhi Linuxissa.\n\n- Pantheon — Pantheon on oletus työpöytäympäristö alun perin luotu elementary OS-jakeluun. Se on kirjoitettu puhtaalta pöydältä käyttäen Valaa ja GTK3 toolkittiä. Käytettävyydeltä ja näyttävyydeltään työpöydällä on joitain samanlaisuuksia GNOME Shell ja macOS:än kanssa.\n\n- Phosh — Phosh on Wayland käyttöympäristö perustuen GNOME:en, käytännöllinen mobiililaitteissa.\n\n- Trinity — Trinity Desktop Environment (TDE) projekti on tietokone työpöytäympäristö Unix tyyppisille käyttöjärjestelmille ensisijaisena tavoitteena pitää kokonaisuudessa KDE 3.5 tyyli.\n\n"
    },
    {
      "title": "Mukautetut ympäristöt",
      "level": 2,
      "content": "Työpöytäympäristöt on helppo tapa asentaa kokonainen graafinen ympäristö. Käyttäjät ovat kumminkin vapaita rakentamaan ja mukauttamaan heidän oman graafisen ympäristön haluamallaan tavalla, jos mikään saatavilla oleva suosittu työpöytäympäristö ei tapaa heidän vaatimuksia. Usein mukautetun ympäristön rakentamiseen sisältyy sopiva ikkunointiohjelma, tehtäväpalkki ja useita sovelluksia tai ohjelmia (minimaalinen valikoima yleensä sisältää terminaaliemulaattorin, tiedostoselaimen, sekä tekstieditorin).\n\nMuut työpöytäympäristön tarjoamat komponentit ovat:\n\n- Sovellusten käynnistämiä: List of applications/Other#Application launchers\n- Äänenvoimakkuuden säätäminen: List of applications/Multimedia#Volume control\n- Leikepöydän hallinta: Clipboard manager\n- Työpöytä latoja: Xorg#Composite\n- Työpöydän taustakuvan asetus sekä kuvakkeet: List of applications/Other#Wallpaper setters sekä Openbox#Desktop icons and wallpapers\n- Näytön hallinta: Display manager#List of display managers\n- Näytön virransäästö-asetukset: Display Power Management Signaling\n- Uloskirjautumis-dialogi: Oblogout\n- Liittämistyökalut: List of applications/Utilities#Mount tools\n- Ilmoitus taustaprosessi: Desktop notifications\n- Polkit todentaminen: Polkit#Authentication agents\n- Näytön lukitsimia: List of applications/Security#Screen lockers\n- Oletusohjelmat: XDG MIME Applications#mimeapps.list\n\n"
    },
    {
      "title": "Muiden ikkunointijärjestelmien käyttö",
      "level": 3,
      "content": "Jos työpöytäympäristölle on artikkeli, paina linkkiä Use a different window manager, muussa tapauksessa hae tietoa viralliselta sivustolta.\n\n- Budgie#Use a different window manager\n- Cinnamon#Use a different window manager\n- GNOME#Use a different window manager\n- KDE#Use a different window manager\n- LXDE#Use a different window manager\n- LXQt#Use a different window manager\n- MATE#Use a different window manager\n- Xfce#Use a different window manager\n\n"
    }
  ]
}