{
  "title": "Udisks (Русский)",
  "url": "https://wiki.archlinux.org/title/Udisks_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- udev (Русский)\n- mount (Русский)\n- Polkit\n- Функциональность файлового менеджера\n\nudisks состоит из двух основых элементов: демона udisksd, который предоставляет интерфейсы D-Bus для управления устройствами хранения, и утилиты командной строки udisksctl, с помощью которой пользователь взаимодействует с демоном.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет udisks2.\n\nДемон udisksd(8) запускается через D-Bus \"по требованию\" и включать его вручную не нужно. Управлять демоном можно утилитой udisksctl(1).\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Набор действий, которые пользователь может выполнять с udisks, определяется разрешениями Polkit. Если пользовательский сеанс неактивен или не существует вовсе (например, при управлении udisks из службы systemd/Пользователь), необходимо соответствующим образом настроить Polkit.\n\nВ [2] описаны стандартные настройки прав для группы storage, в [3] приведён пример с более жёсткими ограничениями. Если вы используете Dolphin, то стоит также изучить [4].\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Следующая команда выполнит монтирование съёмного устройства, например, /dev/sdc:\n\n```\n$ udisksctl mount -b /dev/sdc1\n```\n\nРазмонтирование:\n\n```\n$ udisksctl unmount -b /dev/sdc1\n```\n\nСмотрите udisksctl help для более подробной информации.\n\n"
    },
    {
      "title": "Программы для монтирования",
      "level": 3,
      "content": "Существует ряд программ-обёрток для udisks, которые позволяют настроить автоматическое монтирование устройств. Смотрите также List of applications/Utilities#Mount tools.\n\n- bashmount — Сценарий Bash для монтирования и управления съёмными устройствами обычным пользователем с помощью udisks2.\n\n- udiskie — Программа автоматического монтирования для udisks2 с уведомлениями, иконкой в системном трее и поддержкой защищённых паролем LUKS-устройств. Подробнее см. udiskie wiki\n\n- udisksvm — Обёртка для udisks2 с графическим интерфейсом, написанная на Python3 с использованием фреймворка Qt5. Монтирование/размонтирование съёмных устройств и извлечение CD/DVD кликами мыши. Подробнее см. README.\n\n- udevil — Включает в себя devmon, который совместим с udisks и udisks2.\n\n"
    },
    {
      "title": "udevadm monitor",
      "level": 4,
      "content": "Команду udevadm monitor можно использовать для отслеживания связанных с блочными устройствами событий, а также для монтирования носителя при создании нового блочного устройства. Неактуальные точки монтирования удаляются демоном udiskd в автоматическом режиме, поэтому специальных действий по их удалению предпринимать не нужно.\n\n```\n#!/bin/sh\n\npathtoname() {\n    udevadm info -p /sys/\"$1\" | awk -v FS== '/DEVNAME/ {print $2}'\n}\n\nstdbuf -oL -- udevadm monitor --udev -s block | while read -r -- _ _ event devpath _; do\n        if [ \"$event\" = add ]; then\n            devname=$(pathtoname \"$devpath\")\n            udisksctl mount --block-device \"$devname\" --no-user-interaction\n        fi\ndone\n```\n\n"
    },
    {
      "title": "Монтирование в /media (udisks2)",
      "level": 3,
      "content": "По умолчанию udisks2 монтирует съёмные устройства в каталог /run/media/$USER/, который находится под управлением ACL. Если вы желаете изменить каталог монтирования на /media, создайте следующее правило udev:\n\n```\n/etc/udev/rules.d/99-udisks2.rules\n```\n\n```\n# UDISKS_FILESYSTEM_SHARED\n# ==1: mount filesystem to a shared directory (/media/VolumeName)\n# ==0: mount filesystem to a private directory (/run/media/$USER/VolumeName)\n# See udisks(8)\nENV{ID_FS_USAGE}==\"filesystem|other|crypto\", ENV{UDISKS_FILESYSTEM_SHARED}=\"1\"\n```\n\nПоскольку каталог /media в отличие от /run не монтируется по умолчанию с файловой системой tmpfs, возможно, вы также захотите создать сниппет в каталоге tmpfiles.d, который будет удалять устаревшие точки монтирования при каждой загрузке:\n\n```\n/etc/tmpfiles.d/media.conf\n```\n\n```\nD /media 0755 root root 0 -\n```\n\n"
    },
    {
      "title": "Монтирование петлевых устройств",
      "level": 3,
      "content": "Для монтирования ISO-образов воспользуйтесь следующей командой:\n\n```\n$ udisksctl loop-setup -r -f image.iso\n```\n\nЭто создаст петлевое устройство и сделает образ готовым к монтированию. После размонтирования udev удалит петлевое устройство.\n\n"
    },
    {
      "title": "Сокрытие отдельных разделов",
      "level": 3,
      "content": "Если вы не хотите, чтобы определённые разделы или носители отображались на рабочем столе, можно создать правило udev, например, /etc/udev/rules.d/10-local.rules:\n\n```\nKERNEL==\"sda1\", ENV{UDISKS_PRESENTATION_HIDE}=\"1\"\nKERNEL==\"sda2\", ENV{UDISKS_PRESENTATION_HIDE}=\"1\"\n```\n\nВ результате на рабочем столе будут отображаться все разделы, кроме sda1 и sda2. Имейте в виду, что это не сработает, если вы используете udisks2, потому что переменная UDISKS_PRESENTATION_HIDE больше не поддерживается. Вместо неё используйте UDISKS_IGNORE:\n\n```\nKERNEL==\"sda1\", ENV{UDISKS_IGNORE}=\"1\"\nKERNEL==\"sda2\", ENV{UDISKS_IGNORE}=\"1\"\n```\n\nПоскольку названия блочных устройств могут изменяться от загрузки к загрузке, то имеет смысл использовать UUID раздела или устройства, который можно узнать командой blkid /dev/sdX:\n\n```\n# blkid /dev/sdX\n```\n\n```\n/dev/sdX: LABEL=\"Filesystem Label\" UUID=\"XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXXX\" UUID_SUB=\"YYYYYYYY-YYYY-YYYY-YYYY-YYYYYYYYYYYY\" TYPE=\"btrfs\"\n```\n\nПосле этого можно создать следующее правило:\n\n```\nSUBSYSTEM==\"block\", ENV{ID_FS_UUID}==\"XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXXX\", ENV{UDISKS_IGNORE}=\"1\"\n```\n\nПомимо обычного применения, этим правилом можно также скрыть целую файловую систему btrfs с несколькими устройствами, поскольку в этой системе UUID всех устройств совпадает, а различия определяются на основании SUB_UUID.\n\n"
    },
    {
      "title": "Применение настроек ATA (udisks2)",
      "level": 3,
      "content": "При запуске системы и при подключении устройства демон udiskd применяет настройки из файла /etc/udisks2/ИДЕНТИФИКАТОР.conf, где ИДЕНТИФИКАТОР — значение параметра Drive:Id для данного устройства. В настоящее время в udisks существует поддержка настроек ATA. Список доступных опций можно посмотреть в руководстве udisks(8). Данные настройки по сути не отличаются от настроек hdparm, за тем исключением, что настройки ATA сохранятся при последующих автозапусках демона udisks.\n\nНапример, следующие настройки установят для устройства время ожидания 240 (20 минут):\n\n```\n/etc/udisks2/DriveId.conf\n```\n\n```\n[ATA]\nStandbyTimeout=240\n```\n\nЗначение DriveId можно узнать командой udevadm info --query=all --name=sdx | grep ID_SERIAL | sed \"s/_/-/g\".\n\nВ качестве альтернативы для работы с файлом настроек можно использовать какую-нибудь графическую утилиту, например gnome-disk-utility.\n\nДля некоторых жёстких дисков после размонтирования, но перед физическим отключением питания может понадобиться отправить команду отключения для корректного завершения работы. Смотрите hdparm#Power off a hard disk drive, чтобы решить, требуется ли выполнять команду hdparm -Y для вашего диска.\n\n"
    },
    {
      "title": "Скрытые устройства (udisks2)",
      "level": 3,
      "content": "udisks2 по умолчанию скрывает от пользователя некоторые устройства. Если такое поведение нежелательно, скопируйте файл /usr/lib/udev/rules.d/80-udisks2.rules в /etc/udev/rules.d/80-udisks2.rules и удалите в файле-копии следующий раздел:\n\n```\n# ------------------------------------------------------------------------\n# ------------------------------------------------------------------------\n# ------------------------------------------------------------------------\n# Devices which should not be display in the user interface\n[...]\n```\n\n"
    },
    {
      "title": "Устройства не остаются размонтированными (udisks)",
      "level": 3,
      "content": "udisks либо заново монтирует устройства по истечении некоторого периода, либо опрашивает такие устройства. Это может вызвать нежелательные эффекты, например, при форматировании дисков, совместной работе с ними в виртуальной машине, при работе в режиме энергосбережения или при удалении устройства, которое не было ранее отключено с параметром --detach.\n\nСледующая команда отключит опрашивание выбранного CD/DVD устройства:\n\n```\n# udisks --inhibit-polling /dev/sr0\n```\n\nТо же самое, но для всех устройств одновременно.\n\n```\n# udisks --inhibit-all-polling\n```\n\nПодробнее см. udisks(8).\n\n"
    },
    {
      "title": "Неправильно работает таймер ожидания (udisks2)",
      "level": 3,
      "content": "Демон udisks регулярно опрашивает устройства с целью сбора S.M.A.R.T.-данных. Жесткие диски, время ожидания которых больше интервала опрашивания, могут не успевать войти в режим standby. Устройства, которые уже вошли в этот режим, данной проблеме не подвержены. Судя по всему, в настоящий момент в udisks2 не предусмотрено способа отключить опрашивание устройств или изменить интервал. См. [5] и [6].\n\nТем не менее, время ожидания в udisks2 изменить можно. Подробнее см. #Применение настроек ATA (udisks2).\n\nДругие возможные обходные решения заключаются в задании отдельной задержки перед интервалом опрашивания (10 минут) или в ручном переводе диска в замедленный режим командой hdparm -y /dev/sdx.\n\n"
    },
    {
      "title": "Не удаётся смонтировать NTFS-раздел",
      "level": 3,
      "content": "Если монтирование NTFS-раздела завершается неудачно с ошибкой\n\n```\nError mounting /dev/sdXY at [...]: wrong fs type, bad option, bad superblock on /dev/sdXY, missing codepage or helper program\n```\n\nили какой-то другой, а команды journalctl/dmesg находят в логах ядра сообщение\n\n```\nntfs: (device sdXY): parse_options(): Unrecognized mount option windows_names.\n```\n\nто проблема скорее всего в том, что udisks пытается использовать драйвер NTFS, который не понимает текущие опции монтирования.\n\nДля решения проблемы установите NTFS-3G в качестве опциональной зависимости.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Gentoo:udisks (англ.)\n- Введение в udisks[устаревшая ссылка 2025-04-06 ⓘ] (англ.)\n\n"
    }
  ]
}