{
  "title": "UKUI (Português)",
  "url": "https://wiki.archlinux.org/title/UKUI_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Comparação entre ambientes de desktop\n- Category:Freedesktop.org (Português)\n\nUm ambiente de desktop ou ambiente de trabalho (em inglês, desktop environment ou DE) é uma implementação da metáfora de escritório feita por um conjunto de programas, que compartilham uma interface gráfica de usuário (GUI) comum.\n\n"
    },
    {
      "title": "Visão geral",
      "level": 2,
      "content": "Um ambiente de desktop reúne uma variedade de componentes para fornecer elementos comuns de interface gráfica do usuário, como ícones, barras de ferramentas, papéis de parede e widgets da área de trabalho. Além disso, a maioria dos ambientes de desktop inclui um conjunto de aplicativos e utilitários integrados. Mais importante ainda, os ambientes de desktop fornecem seu próprio gerenciador de janela, que normalmente pode ser substituído por outro compatível.\n\nO usuário é livre para configurar seu ambiente de GUI de várias maneiras. Ambientes de desktop simplesmente fornecem um meio completo e conveniente de realizar essa tarefa. Observe que os usuários estão livres para misturar e combinar aplicativos de vários ambientes de desktop. Por exemplo, um usuário do KDE pode instalar e executar aplicativos do GNOME como o navegador Epiphany, caso ele/ela prefira este ao navegador web Konqueror do KDE. Uma desvantagem dessa abordagem é que muitos aplicativos fornecidos por projetos de ambiente de desktop dependem muito das respectivas bibliotecas subjacentes do DE. Como resultado, a instalação de aplicativos de uma variedade de ambientes de desktop exigirá a instalação de um maior número de dependências. Os usuários que buscam economizar espaço em disco geralmente evitam esses ambientes mistos ou escolhem alternativas que dependem apenas de algumas bibliotecas externas.\n\nAlém disso, os aplicativos fornecidos por DE tendem a se integrar melhor com seus ambientes nativos. Superficialmente, a mistura de ambientes com kits de ferramentas (toolkits) de widgets diferentes resultará em discrepâncias visuais (ou seja, as interfaces usarão ícones e estilos de widgets diferentes). Em termos de usabilidade, os ambientes mistos podem não se comportar de maneira semelhante (por exemplo, clique único versus ícones de clique duplo; funcionalidade arrastar e soltar), potencialmente causando confusão ou comportamento inesperado.\n\nAntes de instalar um ambiente de desktop, é necessária uma instalação funcional do servidor X. Veja Xorg para informações detalhadas. Alguns ambientes de desktop também podem oferecer suporte ao Wayland como uma alternativa ao X, mas a maioria deles ainda é experimental.\n\n"
    },
    {
      "title": "Com suporte oficial",
      "level": 3,
      "content": "- Budgie — Budgie é um ambiente de desktop projetado com o usuário moderno em mente, ele se concentra na simplicidade e elegância.\n\n- Cinnamon — O Cinnamon se esforça para fornecer uma experiência de usuário tradicional. Cinnamon é um fork do GNOME 3.\n\n- Deepin — A interface e os aplicativos de desktop do Deepin apresentam um design intuitivo e elegante. Movimentar-se, compartilhar e pesquisar etc. tornou-se simplesmente uma experiência divertida.\n\n- Enlightenment — O shell de desktop Enlightenment fornece um eficiente gerenciador de janelas baseado nas Bibliotecas Fundamentais do Enlightenment (Enlightenment Foundation Libraries) juntamente com outros componentes essenciais da área de trabalho, como um gerenciador de arquivos, ícones da área de trabalho e widgets. Possui suporte a temas, enquanto ainda é capaz de executar em hardwares mais antigos ou dispositivos embarcados.\n\n- GNOME — O ambiente de desktop GNOME é um desktop atrativo e intuitivo com tanto uma sessão moderna (GNOME) e uma clássica (GNOME Clássico).\n\n- GNOME Flashback — GNOME Flashback é um shell para o GNOME 3 que foi inicialmente chamado de modo flashback do GNOME. O layout de desktop e a tecnologia subjacente é similar a do GNOME 2.\n\n- KDE Plasma — O ambiente de desktop Plasma do KDE é um ambiente de trabalho familiar. O Plasma oferece todas as ferramentas necessárias para uma experiência de computação moderna, para que você possa ser produtivo desde o início.\n\n- LXDE — O Lightweight X11 Desktop Environment (ambiente de desktop X11 leve) é um ambiente de desktop rápido e que economiza energia. Ele vem com uma interface moderna, suporte a vários idiomas, atalhos de teclado padrão e recursos adicionais, como a navegação por arquivos com guias. Fundamentalmente projetado para ser leve, o LXDE se esforça para ter menos CPU e RAM do que outros ambientes.\n\n- LXQt — O LXQt é o port do Qt e a próxima versão do LXDE, o Lightweight Desktop Environment. É o produto da fusão entre os projetos LXDE-Qt e Razor-qt: Um ambiente de desktop leve, modular, extremamente rápido e fácil de usar.\n\n- MATE — O Mate fornece um ambiente de desktop intuitivo e atraente para usuários de Linux que usam metáforas tradicionais. O MATE começou como um fork do GNOME 2, mas agora usa o GTK 3.\n\n- Sugar — A Sugar Learning Platform (plataforma de aprendizagem Sugar) é um ambiente computacional composto por Atividades projetadas para ajudar crianças de 5 a 12 anos de idade a aprenderem juntas por meio de expressão de mídia rica. O Sugar é o principal componente de um esforço mundial para oferecer a todas as crianças a oportunidade de uma educação de qualidade – atualmente é usado por quase um milhão de crianças em todo o mundo, falando 25 idiomas em mais de 40 países. Sugar fornece os meios para ajudar as pessoas a levarem vidas completas através do acesso a uma educação de qualidade que atualmente é desperdiçada por muitos.\n\n- UKUI — UKUI é um ambiente de desktop leve, desenvolvido com baso no GTK e no Qt. UKUI é o ambiente de destkop padrão do kylin Ubuntu.\n\n- Xfce — O Xfce incorpora a tradicional filosofia Unix de modularidade e reutilização. Ele consiste em vários componentes que fornecem a funcionalidade completa que se pode esperar de um ambiente de desktop moderno, mantendo-se relativamente leve. Eles são empacotados separadamente e você pode escolher entre os pacotes disponíveis para criar o melhor ambiente de trabalho pessoal.\n\n"
    },
    {
      "title": "Sem suporte oficial",
      "level": 3,
      "content": "- EDE — O \"Equinox Desktop Environment\" é um ambiente de desktop projetado para ser simples, extremamente leve e rápido.\n\n- Liri — O Liri é um ambiente de desktop com design e recursos modernos. Liri é a fusão entre Hawaii, Papyros e o Projeto Liri. Altamente experimental.\n\n- Lumina — Lumina é um ambiente de desktop leve escrito em Qt 5 para o FreeBSD que usa o Fluxbox para gerenciamento de janelas.\n\n- Moksha — Fork do Enlightenment atualmente usado como ambiente de desktop padrão no Bodhi Linux baseado em Ubuntu.\n\n- Pantheon — O Pantheon é o ambiente de área de trabalho padrão originalmente criado para a distribuição do ElementaryOS. Ele é escrito do zero usando Vala e o kit de ferramentas GTK3. Com relação à usabilidade e aparência, a área de trabalho tem algumas semelhanças com o GNOME Shell e o macOS.\n\n- Phosh — Phosh é uma interface de usuário de shell em Wayland baseada no GNOME, útil em dispositivos móveis.\n\n- Trinity — O projeto Trinity Desktop Environment (TDE) é um ambiente de desktop do computador para sistemas operacionais tipo Unix com o objetivo principal de manter o estilo de computação geral do KDE 3.5.\n\n"
    },
    {
      "title": "Ambientes personalizados",
      "level": 2,
      "content": "Os ambientes de desktop representam o meio mais simples de instalar um ambiente gráfico completo. No entanto, os usuários são livres para criar e personalizar seu ambiente gráfico de várias maneiras, se nenhum dos ambientes populares de desktop atender aos seus requisitos. Geralmente, a criação de um ambiente personalizado envolve a seleção de um gerenciador de janela, uma barra de tarefas e um número de aplicativos (uma seleção minimalista geralmente inclui um emulador de terminal, gerenciador de arquivos e editor de texto).\n\nOutros componentes geralmente fornecidos por ambientes de área de trabalho são:\n\n- Iniciador de aplicativo: List of applications/Other#Application launchers\n- Controle de volume de áudio: List of applications/Multimedia#Volume control\n- Gerenciador de área de transferência\n- Compositor de desktop: Xorg#Composição\n- Definidor de papel de parede e ícone da área de trabalho: List of applications/Other#Wallpaper setters e Openbox#Desktop icons and wallpapers\n- Gerenciador de exibição: Gerenciadores de exibição#Lista de gerenciadores de exibição\n- Configurações de tela de economia de energia: Display Power Management Signaling\n- Diálogo de logout: Oblogout\n- Ferramenta de montagem: List of applications/Utilities#Mount tools\n- Daemon de notificação: Desktop notifications\n- Agente de autenticação de Polkit: Polkit#Authentication agents\n- Bloqueador de tela: List of applications/Security#Screen lockers\n- Aplicativos padrão: XDG MIME Applications#mimeapps.list\n\n"
    },
    {
      "title": "Usar um gerenciador de janela diferente",
      "level": 3,
      "content": "Se o ambiente de desktop tem um artigo, veja sua seção Usar um gerenciador de janela diferente (ou, no artigo original, Use a diferent window manager), do contrário consulte a documentação oficial.\n\n- Budgie#Use a different window manager\n- Cinnamon#Use a different window manager\n- GNOME (Português)#Usar um gerenciador de janela diferente\n- KDE (Português)#Usar um gerenciador de janela diferente\n- LXDE#Use a different window manager\n- LXQt#Use a different window manager\n- MATE#Use a different window manager\n- Xfce#Use a different window manager\n\n"
    }
  ]
}