{
  "title": "Umask (Español)",
  "url": "https://wiki.archlinux.org/title/Umask_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-12** \n\nArtículos relacionados\n\n- Permisos y atributos de archivo\n\nLa utilidad umask se utiliza para controlar la máscara del modo de creación de archivos, que determina el valor inicial de los bits de permisos para los archivos recién creados. El comportamiento de esta utilidad está estandarizado por POSIX y se describe en el Manual del programador POSIX. Debido a que umask afecta el entorno de ejecución actual del shell, generalmente se implementa como una orden integrada en el shell.\n\n"
    },
    {
      "title": "Significado de la máscara de modo",
      "level": 2,
      "content": "La máscara de modo contiene los bits de permiso que no deben establecerse en un archivo recién creado, por lo tanto, es la negación lógica de los bits de permiso establecidos en un archivo recién creado. Si algún bit de la máscara se establece en 1, el permiso correspondiente para el archivo recién creado se desactivará. Por lo tanto, la máscara actúa como un filtro para eliminar los bits de permiso y ayuda a configurar el acceso predeterminado a los archivos.\n\nEl valor resultante para los bits de permiso que se establecerán en un archivo recién creado se calcula utilizando la adjunción lógica bit a bit, que se puede expresar en notación lógica:\n\n```\nR: (D & (~M))\n```\n\nEs decir, los permisos resultantes R son el resultado de conjunción bit a bit de los permisos predeterminados D y la negación bit a bit de la máscara del modo de creación de archivos M.\n\n- Linux no permite que se cree un archivo con permisos de ejecución, los permisos de creación predeterminados son 777 para directorios y solo 666 para archivos.\n- En Linux, solo se utilizan los bits de permiso de archivo de la máscara; véase umask(2). Los bits \"suid\", \"sgid\" y \"pegajoso\" de la máscara se ignoran.\n\nPor ejemplo, supongamos que la máscara del modo de creación de archivos es 027. Aquí la representación bit a bit de cada dígito representa:\n\n- 0 representa los bits del permiso de usuario no establecido en un archivo recién creado\n- 2 representa los bits del permiso de grupo no establecido en un archivo recién creado\n- 7 representa los bits del permiso de otros no establecido en un archivo recién creado\n\nCon la información proporcionada por la tabla a continuación, esto significa que para un archivo recién creado, por ejemplo, propiedad del usuario Usuario1 y del grupo Grupo1, Usuario1 tiene todas las permisos (valor octal 7) para el archivo recién creado, otros usuarios del grupo Grupo1 no tienen permisos de escritura (valor octal 5) y cualquier otro el usuario no tiene ningún permiso (valor octal 0) para el archivo recién creado. Entonces, con la máscara 027 tomada para este ejemplo, los archivos se crearán con permisos 750.\n\nTable content:\nOctal | Binary | Significado\n0 | 000 | sin permisos\n1 | 001 | solo ejecución\n2 | 010 | solo escritura\n3 | 011 | escritura y ejecución\n4 | 100 | solo lectura\n5 | 101 | lectura y ejecución\n6 | 110 | lectura y escritura\n7 | 111 | lectura, escritura y ejecución\n\n"
    },
    {
      "title": "Mostrar el valor de la máscara actual",
      "level": 2,
      "content": "Para mostrar la máscara actual, simplemente invoque umask sin especificar ningún argumento. El estilo de salida predeterminado depende de la implementación, pero generalmente es octal:\n\n```\n$ umask\n```\n\n```\n0027\n```\n\nCuando se utiliza la opción -S, estandarizada por POSIX, la máscara se mostrará con notación simbólica. Sin embargo, el valor de notación simbólica siempre será el complemento lógico del valor octal, es decir, los bits de permiso que se establecerán en el archivo recién creado:\n\n```\n$ umask -S\n```\n\n```\nu=rwx,g=rx,o=\n```\n\n"
    },
    {
      "title": "Establecer el valor de la máscara",
      "level": 2,
      "content": "Puede establecer el valor de umask mediante la orden umask. La cadena que especifica la máscara de modo sigue las mismas reglas sintácticas que el argumento de modo de chmod (véase Manual del programador POSIX para más detalles).\n\nEl valor de umask de todo el sistema se puede establecer en /etc/profile o en los archivos de configuración predeterminados del shell, por ejemplo /etc/bash.bashrc. La mayoría de las distribuciones Linux, incluido Arch, establecen un valor predeterminado 022 de umask (véase /etc/profile). También se puede configurar umask con pam_umask.so pero puede ser anulado por /etc/profile o similar.\n\nSi necesita establecer un valor diferente, puede editar directamente dicho archivo, afectando así a todos los usuarios, o llamar a umask desde el archivo de configuración de usuario de su shell, por ejemplo ~/.bashrc para cambiar solo su umask, sin embargo, estos cambios solo tendrán efecto después del próximo inicio de sesión. Para cambiar su umask solo durante su sesión actual, simplemente ejecute umask y escriba el valor deseado. Por ejemplo, ejecutar umask 077 le dará permisos de lectura y escritura para archivos nuevos, y permisos de lectura, escritura y ejecución para carpetas nuevas.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Manual del programador POSIX: umask (también disponible como umask(1p)) chmod (descripción extendida) (también disponible como chmod(1p))\n- 027 umask: un compromiso entre seguridad y simplicidad\n\n- umask (también disponible como umask(1p))\n- chmod (descripción extendida) (también disponible como chmod(1p))\n\n"
    }
  ]
}