{
  "title": "Unreal Engine 4 (Русский)",
  "url": "https://wiki.archlinux.org/title/Unreal_Engine_4_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Unreal Tournament 4 (Русский)\n\nUnreal Engine 4 - последняя версия движка для видеоигр, созданная Epic Games\n\nСодержимое этой статьи было первоначально написано на этой странице и адаптировано специально для Arch Linux.\n\n"
    },
    {
      "title": "Минимальные требования",
      "level": 2,
      "content": "- Intel или Amd CPU@2.5GHz Quad Core 64 бит\n- GPU: NVIDIA GeForce GTX 470 или AMD Radeon 6870 HD series\n- RAM: 8 GB\n\n"
    },
    {
      "title": "Установка из AUR",
      "level": 3,
      "content": "Unreal Engine 4 доступен в AUR как пакет unreal-engineAUR.\n\nПакет весит 22 ГБ после установки, поэтому для сборки требуется около 100 ГБ свободного места. Существует около 7 ГБ исходных файлов для загрузки, а компиляция может занять несколько часов.\n\nПоскольку репозиторий является приватным, вы можете настроить SSH-ключ, чтобы ваша учетная запись GitHub использовалась для загрузки источника.\n\nТак-же рекомендуется увеличить размер папки tmp (исходный размер 7.8), либо сменить каталог сборки.\n\nДля уменьшения размера загрузки, вы можете скачать релиз как tar.gz[устаревшая ссылка 2020-08-06 ⓘ] после входа в github.com, а затем использовать этот файл в качестве источника в PKGBUILD.\n\n"
    },
    {
      "title": "Получение",
      "level": 4,
      "content": "Сначала зарегистрируйтесь на UnrealEngine.com и перечислите свою учетную запись GitHub в свою учетную запись Epic Games. После регистрации вы сможете просмотреть исходный код[устаревшая ссылка 2020-08-06 ⓘ].\n\n"
    },
    {
      "title": "Компиляция",
      "level": 4,
      "content": "Для компиляции вручную смотрите неофициальные инструкции по сборке на Linux.\n\n"
    },
    {
      "title": "Проблемы с компиляцией",
      "level": 3,
      "content": "Если компиляция не удалась, попробуйте собрать редактор с помощью профиля Debug:\n\n```\n$ make UE4Editor-Linux-Debug\n```\n\n"
    },
    {
      "title": "Проблемы во время выполнения",
      "level": 3,
      "content": "Если редактор не запускается из меню, или что-то не работает правильно, запустите его в консоли и проверьте вывод на наличие ошибок.\n\n```\n$ cd /opt/unreal-engine/Engine/Binaries/Linux/\n$ ./UE4Editor\n```\n\n"
    },
    {
      "title": "Проблемы с проектом кода на C++",
      "level": 3,
      "content": "После создания проекта кода новый проект открывается в текстовом редакторе, а не в UE4Editor, как это должно быть. После повторного запуска редактора новый проект появляется и может быть открыт, но при первом запуске для компиляции требуется около получаса, и поскольку это происходит в фоновом режиме (без GUI), это может показаться недействительным. Использование ЦП должно показывать, что оно все еще компилируется, и вы можете запустить редактор с консоли, чтобы увидеть прогресс.\n\n"
    },
    {
      "title": "Отключение всплывающих подсказок",
      "level": 3,
      "content": "Наведение указателя мыши на всплывающие подсказки UE4 может оказаться очень медленной процедурой. Их можно отключить, добавив\n\n```\nEngine/Config/ConsoleVariables.ini\n```\n\n```\nSlate.AllowToolTips=0\n```\n\n"
    },
    {
      "title": "Случайное зависание под KDE",
      "level": 3,
      "content": "Отключите содержимое индексного файла в параметрах поиска файлов KDE.\n\n"
    },
    {
      "title": "Пустой огромный квадрат в Blueprint",
      "level": 3,
      "content": "Если вы используете мультимониторную конфигурацию и переместили blueprint на второй экран, и при вызове контекстного меню (ПКМ в blueprint) у вас проявляется данный баг, то откройте Edit Preferences -> User interface и поставьте галочку напротив Enable Window Animation и перезапустите UnrealEngine.\n\n"
    },
    {
      "title": "Стартовый контент",
      "level": 3,
      "content": "Проект StarterContent установлен в /opt/unreal-engine/Samples/StarterContent/StarterContent.uproject, вы можете перейти к нему с панели запуска.\n\n"
    },
    {
      "title": "Приложения marketplace",
      "level": 3,
      "content": "Лаунчер с Unreal Marketplace недоступен для Linux еще [1], поэтому приложения, такие как проект ContentExamples, не могут быть установлены из Linux[2].\n\nПриложения marketplace можно загрузить с помощью лаунчера в Windows (в Mac также может работать), они хранятся в:\n\n```\n/Program Files (x86)/Epic Games/Launcher/VaultCache/\n```\n\n"
    }
  ]
}