{
  "title": "UP Board (Português)",
  "url": "https://wiki.archlinux.org/title/UP_Board_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "A UP Board é um dispositivo SOC baseado em Intel da Aaeon. Existe um dispositivo complementar, o UP Core, que usa o mesmo chipset e dispositivos. A instalação do Arch não é diferente, exceto se você não tem o barramento GPIO para ativar.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "A UP Board apresenta uma configuração somente UEFI (sem emulação de BIOS). O processo de instalação padrão do UEFI pode ser seguido. systemd-boot funciona bem como um simples gerenciador de inicialização.\n\n"
    },
    {
      "title": "GPIO",
      "level": 2,
      "content": "Os pinos GPIO na UP Board são roteados por meio de um CPLD que requer um driver personalizado. Este driver ainda não foi adicionado ao kernel principal, então é necessário compilar um kernel personalizado ou aplicar patches nele para adicionar a funcionalidade. Veja a página do wiki oficial da UP para mais informações.\n\n"
    },
    {
      "title": "Som",
      "level": 2,
      "content": "A partir de agosto de 2016, o kernel da linha principal não suporta som através de HDMI para dispositivos baseados em trilhas como o UP Board. Existem planos para adicionar suporte ao kernel da linha principal, conforme observado aqui, mas nesse meio tempo, se você deseja ter som, precisará patchear manualmente seu kernel. Atualmente, não há pacote AUR incluindo esses patches.\n\n"
    },
    {
      "title": "Compilação",
      "level": 3,
      "content": "Sem quaisquer otimizações, a compilação na UP Board leva de 5 a 6 horas. Configurar o seu MAKEFLAGS de antemão irá melhorar drasticamente o tempo de compilação. Se você estiver usando o ABS, a página makepkg contém informações sobre como definir a variável lá.\n\n"
    },
    {
      "title": "Manual",
      "level": 4,
      "content": "- Faça o download de uma cópia do kernel corrigido de aqui e as fontes de kernel mais recentes em https://www.kernel.org.\n\n- Depois de extrair o arquivo, você precisará remover a referência em linha em um dos arquivos de cabeçalho. Você pode fazer isso com sed assim:\n\n```\n$ sed -i 's/inline//g' sound-byt-cht-hdmi-v4.7/sound/hdmi_audio/intel_mid_hdmi_audio.h\n```\n\n- Em seguida, você precisará criar um patch para as duas pastas que foram alteradas, sound/ e drivers/gpu/drm/i915:\n\n```\n$ diff -ENwbur {linux-4.7.2,sound-byt-cht-hdmi-v4.7}/drivers/gpu/drm/i915 >> cherry.patch\n$ diff -ENwbur {linux-4.7.2,sound-byt-cht-hdmi-v4.7}/sound >> cherry.patch\n```\n\n- Uma vez que o patch foi criado, você pode movê-lo para o diretório de fontes do kernel e executar:\n\n```\n$ patch -p1 < cherry.patch\n```\n\n- Por fim, você precisará garantir que a opção CONFIG_SUPPORT_HDMI=y esteja na .config.\n\n"
    },
    {
      "title": "Arch Build System",
      "level": 4,
      "content": "Se você deseja construir o kernel usando o ABS, siga os passos fornecidos em Kernels/Arch Build System. Lembre-se de adicionar o patch à função prepare e executar updpkgsums para atualizar a soma de verificação do arquivo de configuração alterado.\n\n"
    },
    {
      "title": "Reinicialização causando kernel panic",
      "level": 3,
      "content": "Reiniciar a placa várias vezes sem desconectar a energia, algo que poderia acontecer se usado como um servidor, pode falhar com um kernel panic. Esta é possivelmente por causa de um erro, como discutido no tópico de fórum \"UPboard Ubilinux Freezing\" e relatado em Bug 106721 no rastreador de erros do Freedesktop.org\n\nPara tornar a reinicialização da placa mais confiável, tente adicionar o seguinte à sua configuração em /etc/default/grub.\n\n```\n/etc/default/grub\n```\n\n```\nGRUB_CMDLINE_LINUX_DEFAULT=\"reboot=efi,cold fsck.mode=force fsck.repair=yes\"\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Página Inicial\n\n"
    }
  ]
}