{
  "title": "Urxvt (Русский)",
  "url": "https://wiki.archlinux.org/title/Urxvt_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- rxvt-unicode/Советы и хитрости\n\nrxvt-unicode — это очень настраиваемый эмулятор терминала, форк rxvt. Среди возможностей rxvt-unicode — поддержка многих языков через Юникод, прозрачность, способность отображать различные типы шрифтов и поддержка расширений Perl.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет rxvt-unicode. Версия с поддержкой 24-битного цвета доступна в пакете rxvt-unicode-truecolorAUR.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Доступные настройки и значения описаны в urxvt(1) и urxvt(7).\n\n"
    },
    {
      "title": "Xresources",
      "level": 3,
      "content": "Rxvt-unicode управляется с помощью аргументов командной строки или Xresources. Аргументы командной строки имеют приоритет над параметрами ресурсов. Смотрите статью Ресурсы X для более подробной информации.\n\nurxvt --help Отобразит все доступные ресурсы rxvt. Страница пользовательского руководства man page содержит полное объяснение каждого ресурса.\n\n"
    },
    {
      "title": "Позиция полосы прокрутки",
      "level": 3,
      "content": "По умолчанию, когда появляется вывод оболочки, вид прокрутки автоматически переходит к нижней части буфера для отображения нового вывода. Если вы хотите, увидеть предыдущий выход (например, сообщения компилятора), установите следующие параметры в ~/.Xresources:\n\n```\n! Не прокручивать при выводе\nURxvt*scrollTtyOutput: false\n\n! прокручивать по отношению к буферу (прокрутка мышью или Shift+Page Up)\nURxvt*scrollWithBuffer: true\n\n! прокрутка по нажатию клавиши\nURxvt*scrollTtyKeypress: true\n```\n\n"
    },
    {
      "title": "Прокрутка буфера в дополнительном экране",
      "level": 3,
      "content": "Когда вы прокручиваете постранично во вторичном экране (например less без опции-X), будет хорошей идеей отключить прокрутку буфера, чтобы иметь возможность постранично прокручивать сам вторичный экран, а не буфер терминала: это неизменяемое поведение по умолчанию в konsole и терминалах на основе vte.\n\nЧтобы отключить буфер прокрутки вторичного экрана в urxvt:\n\n```\nURxvt.secondaryScreen: 1\nURxvt.secondaryScroll: 0\n```\n\nЭта настройка работает как и ожидалось, за исключением прокрутки колесом мыши. Когда вы листаете постранично вторичный экран колесом мыши - и там было что-то в буфере прокрутки вместо страницы вторичного экрана - колесом мыши будет прокручиваться буфер прокрутки. Чтобы решить эту проблему, необходимо ввести новый параметр в rxvt-unicode[1]. Патченный rxvt-unicode доступен в пакете rxvt-unicode-better-wheel-scrollingAUR[ссылка недействительна: package not found]. После его установки добавьте следующую строку в файл настроек:\n\n```\nURxvt.secondaryWheel: 1\n```\n\n"
    },
    {
      "title": "Методы декларации шрифта",
      "level": 3,
      "content": "```\nURxvt.font: 9x15\n```\n\nТоже самое что и:\n\n```\nURxvt.font: -misc-fixed-medium-r-normal--15-140-75-75-c-90-iso8859-1\n```\n\nИ, для того же шрифта bold (толстый):\n\n```\nURxvt.font: 9x15bold\n```\n\nТоже самое что и:\n\n```\nURxvt.font: -misc-fixed-bold-r-normal--15-140-75-75-c-90-iso8859-1\n```\n\nПолный список коротких имен для основных шрифтов X может быть найден в /usr/share/fonts/misc/fonts.alias (также есть файлы fonts.alias в некоторых других подкаталогах /usr/share/fonts/, но они упакованы отдельно от реальных шрифтов, и могут перечислять шрифты которые на самом деле не установлены). Стоит отметить, что эти короткие псевдонимы выбираются для версии ISO-8859-1 а не версии ISO-10646-1 (Юникод), и скорее версии 75 DPI чем 100 DPI, так что лучше избегать их, и вместо них выбирать шрифты по полному имени.\n\n```\nURxvt.font: xft:monaco:size=10\n```\n\nИли\n\n```\nURxvt.font: xft:monaco:bold:size=10\n```\n\nХорошим способом для тестирования шрифтов прямо в терминале до совершения изменений в файле настроек является вывод escape-кодов в терминале, например:\n\n```\n$ printf '\\e]710;%s\\007' \"xft:Terminus:pixelsize=12\"\n```\n\n"
    },
    {
      "title": "Расстояние шрифта",
      "level": 3,
      "content": "По умолчанию, расстояние между символами слишком широкое. Это контролируется параметром:\n\n```\n~/.Xresources\n```\n\n```\nURxvt.letterSpace: -1\n```\n\nСуществуют некоторые споры [2][3] о том, как urxvt рассчитывает ширину символов. rxvt-unicode-patchedAUR[ссылка недействительна: package not found] изменяет расчёт, обычно приводя к более узкому расстоянию между символами.\n\n"
    },
    {
      "title": "Цвета",
      "level": 3,
      "content": "По умолчанию, rxvt-unicode собран с поддержкой цвета. В дополнении к стандартным цветам переднего плана и цвету фона, rxvt может отображать до 256 цветов (плюс high-intensity bold/blinking/underlined (высокоинтенсивный жирный/мигающий/подчёркнутый) и любое сочетание из них).\n\nТакже можно указать значения цветов foreground (передний план/шрифт), background (фон), cursorColor (цвет курсора), cursorColor2 (цвет курсора2), colorBD, colorUL как число 0-15 — удобное сокращение ссылки на цвет color0-color15. Смотрите #Xresources для более подробной информации.\n\n"
    },
    {
      "title": "Печать",
      "level": 3,
      "content": "По умолчанию rxvt-unicode распечатывает дамп экрана через lpr при нажатии PrintScreen. При использовании Ctrl+PrintScreen или Shift-PrintScreen в распечатку также будет включена обратная прокрутка терминала. Это поведение можно изменить или полностью отключить, исходя из личных предпочтений и потребностей.\n\n```\n~/.Xresources\n```\n\n```\n! Запрет печати содержимого терминала при нажатии PrintScreen.\nURxvt.print-pipe: \"cat > /dev/null\"\n```\n\n"
    },
    {
      "title": "Применение настроек",
      "level": 3,
      "content": "После изменения настроек выполните xrdb ~/.Xresources для их применения. Новые настройки применяется к новым терминалам.\n\n"
    },
    {
      "title": "Вырезать и вставить",
      "level": 2,
      "content": "Rxvt-unicode использует буферы вырезания, которые по умолчанию загружаются в буфер PRIMARY. Смотрите Selecting and pasting text для более подробной информации.\n\nДоступ к буферу CLIPBOARD можно получить с помощью сочетаний клавиш ALT-CTRL-c и ALT-CTRL-v для копирования и вставки соответственно.\n\nЕсли вы хотите скопировать в буфер PRIMARY, а также убедиться, что в буфер CLIPBOARD помещается то же содержимое, вы можете добавить следующее:\n\n```\nURxvt.perl-ext-common:  ...,selection-to-clipboard,...\n```\n\nи\n\n```\nURxvt.clipboard.autocopy: true\nURxvt.keysym.M-c: perl:clipboard:copy\nURxvt.keysym.M-v: perl:clipboard:paste\n```\n\nСмотрите также Буфер обмена#Менеджеры.\n\n"
    },
    {
      "title": "Perl расширения",
      "level": 2,
      "content": "Вы можете включить расширения perl в URxvt с помощью такой строки:\n\n```\nURxvt.perl-ext-common: имя_расширения_1,имя_расширения_2,...\n```\n\nОбратите внимание, что между именами расширения не должно быть пробелов.\n\n"
    },
    {
      "title": "Кликабельные ссылки (URL-адреса)",
      "level": 3,
      "content": "Вы можете сделать URL-адреса в терминале кликабельными, используя расширение matcher. Например, для открытия ссылок в веб-браузере по умолчанию левой кнопкой мыши, добавьте следуюшее в.Xresources:\n\n```\nURxvt.perl-ext-common: default,matcher\nURxvt.url-launcher: /usr/bin/xdg-open\nURxvt.matcher.button: 1\n```\n\nС rxvt-unicode 9.14, также можно использовать matcher для открытия списка последних (в настоящее время ограничено до 10) URL-адресов с помощью клавиатуры:\n\n```\nURxvt.keysym.C-Delete: perl:matcher:last\nURxvt.keysym.M-Delete: perl:matcher:list\n```\n\nСоответствующие ссылки могут быть окрашены с помощью #Цвета переднего плана (foreground) или фона (background), например, в синий:\n\n```\nURxvt.matcher.rend.0: Uline Bold fg5\n```\n\nВ качестве альтернативы, используйте colorUL для цвета #RRGGBB. Это, окрасит весь подчеркнутый текст, только для ссылок matches:\n\n```\nURxvt.colorUL: #4682B4\n```\n\n"
    },
    {
      "title": "Yankable URL'ы (без мыши)",
      "level": 3,
      "content": "Кроме того, вы можете выбрать и открыть URL в веб-браузере, не используя мышь. Установите пакет urxvt-perls и настройте как надо .Xresources. Пример показан ниже:\n\n```\nURxvt.perl-ext: default,url-select\nURxvt.keysym.M-u: perl:url-select:select_next\nURxvt.url-select.launcher: /usr/bin/xdg-open\nURxvt.url-select.underline: true\n```\n\nОсновные команды:\n\nTable content:\nКлавиша | Описание\nAlt+u | Вход в режим выбора. Будет выбран последний URL на вашем экране. Вы можете повторить Alt+u для выбора следующего upward URL.\nk | Select next upward URL\nj | Select next downward URL\nReturn | Открыть выбранный URL в браузере и выйти из режима выбора\no | Открыть выбранный URL в браузере без выхода из режима выбора\ny | Скопировать (yank) выбранные URL выйти из режима выбора\nEsc | Отменить режим выбора URL\n\n"
    },
    {
      "title": "Простые вкладки",
      "level": 3,
      "content": "Чтобы добавить вкладки в urxvt, добавьте следующую строку в ваш ~/.Xresources:\n\n```\nURxvt.perl-ext-common: ...,tabbed,...\n```\n\nДля управления вкладками используйте:\n\nTable content:\nКлавиши | Описание\nShift+Down | Новая вкладка\nShift+Left | Перейти к левой вкладке\nShift+Right | Перейти к правой вкладке\nCtrl+Left | Переместить вкладку влево\nCtrl+Right | Переместить вкладку вправо\nCtrl+d | Закрыть вкладку\n\nВы можете изменить цвета вкладок, следующими значениями:\n\n```\nURxvt.tabbed.tabbar-fg: 2\nURxvt.tabbed.tabbar-bg: 0\nURxvt.tabbed.tab-fg: 3\nURxvt.tabbed.tab-bg: 0\n```\n\nЕсли вам нужно переименовать вкладку, вам, вероятно, лучше установить urxvt-tabbedexAUR.\n\n"
    },
    {
      "title": "Полноэкранный",
      "level": 3,
      "content": "Вы можете установить пакет urxvt-fullscreenAUR, а затем назначить клавишу (или сочетание клавиш), чтобы привести urxvt в полноэкранный режим.\n\n```\n~/.Xresources\n```\n\n```\n...\nURxvt.perl-ext-common: ...,fullscreen,...\nURxvt.keysym.F11: perl:fullscreen:switch\n...\n```\n\n"
    },
    {
      "title": "Изменение размера шрифта на лету",
      "level": 3,
      "content": "Установите urxvt-resize-font-gitAUR и добавьте его список расширений Perl в файле ~/.Xresources:\n\n```\nURxvt.perl-ext-common:  ...,resize-font,...\n```\n\nГорячие клавиши по умолчанию:\n\n- Ctrl++ (или Ctrl+Shift+=) — увеличить размер\n- Ctrl+- — уменьшить размер\n- Ctrl+= — сбросить размер\n- Ctrl+? — посмотреть текущий размер\n\nГорячие клавиши можно изменить, например, так:\n\n```\nURxvt.keysym.C-Down:  resize-font:smaller\n URxvt.keysym.C-Up:    resize-font:bigger\n```\n\nЧтобы заработало назначение Ctrl+Shift, нужно сперва отключить стандартные назначения (смотрите обсуждение здесь):\n\n```\nURxvt.iso14755: false\n URxvt.iso14755_52: false\n```\n\n"
    },
    {
      "title": "Подтверждение вставки",
      "level": 3,
      "content": "Расширение confirm-paste включено по умолчанию и отображает диалог подтверждения при попытке вставить текст, содержащий управляющие символы.\n\nОтключить его можно следующим образом:\n\n```\nURxvt.perl-ext-common:-confirm-paste\n```\n\n"
    },
    {
      "title": "Отключение расширений Perl",
      "level": 3,
      "content": "Если вы не используете функции расширения Perl, вы можете улучшить безопасность и скорость, отключив расширения Perl полностью.\n\n```\nURxvt.perl-ext:\nURxvt.perl-ext-common:\n```\n\nЧтобы выборочно отключить расширение, укажите имя расширения с дефисом перед ним. Например:\n\n```\nUrxvt.perl-ext-common:-extension\n```\n\n"
    },
    {
      "title": "Прозрачность не работает после обновления, начиная с версии 9.09",
      "level": 3,
      "content": "Разработчики rxvt-Unicode удалили код совместимости для многих нестандартных установщиков обоев с этим обновлением. Использование несовместимых установщиков обоев, ломает поддержку прозрачности. Рекомендуемые установщики обоев:\n\n- feh\n- hsetroot\n- esetroot\n\nДля того, чтобы работала истинная прозрачность, убедитесь что закомментированы URxvt.tintColor и URxvt.inheritPixmap.\n\n"
    },
    {
      "title": "Удалённые хосты",
      "level": 3,
      "content": "При подключении к удалённому хосту вы можете столкнуться с проблемами при запуске программ в текстовом режиме под rxvt-unicode. Это можно исправить путём установки rxvt-unicode-terminfo на удалённом хосте или с помощью копирования /usr/share/terminfo/r/rxvt-unicode с локального компьютера на ваш хост в ~/.terminfo/r/rxvt-unicode; то же самое для rxvt-unicode-256color.\n\nНекоторые удалённые системы не изменяют название автоматически, если вы не укажете TERM=xterm. Для решения добавьте на удалённой машине в .bashrc строку:\n\n```\nPROMPT_COMMAND='echo -ne \"\\033]0;${USER}@${HOSTNAME}:${PWD}\\007\"'\n```\n\nЕщё можно попробовать добавить в .Xresources:\n\n```\nURxvt*termName: rxvt\n```\n\nЭто полезно при подключении к удалённым хостам, на которых отсутствуют права администратора и нет возможности установить определения terminfo для rxvt-unicode.\n\n"
    },
    {
      "title": "Использование rxvt-unicode в качестве терминала gmrun",
      "level": 3,
      "content": "В отличие от некоторых других терминалов, urxvt ожидает аргументы -e определённые отдельно, а не сгруппированные вместе с кавычками. Это вызывает проблемы с gmrun, который предполагает противоположное поведение. Это можно обойти, указав \"eval\" перед значением терминала в .gmrunrc:\n\n```\nTerminal = eval urxvt\nTermExec = ${Terminal} -e\n```\n\n(gmrun использует /bin/sh чтобы выполнять команды, так что \"eval\" здесь понимается.) \"eval\" имеет побочный эффект \"разрыва\" аргументов -e таким же образом, что $@ делает в Bash, что делает команды понятными для urxvt.\n\n"
    },
    {
      "title": "Моя цифровая клавиатура действует странно и производит странный вывод (например, в VIM)",
      "level": 3,
      "content": "Похоже, есть проблема у некоторых пользователей Debian GNU/Linux, хотя никаких конкретных подробностей не сообщалось. Вполне возможно, что это вызвано установкой неправильного TERM, хотя подробностей, как это может произойти, неизвестно, так как TERM=rxvt должен предложить совместимую раскладку.\n\nТем не менее, с помощью программы xmodmap (xorg-xmodmap), вы можете переназначить клавиши цифровой клавиатуры обратно.\n\n1. Посмотрите в xev код клавиши (keycode), который генерирует ваша цифровая клавиатура.\n\n- Запустите программу xev\n- Нажмите цифру на вашей цифровой клавиатуре, смотрите ... keycode xxx ... в выводе xev. Например, клавиша 1 на некоторых клавиатурах также известна как калавиша \"End\", что имеет 'keycode 87'.\n\n2. Создайте или измените ваш файл xmodmap, обычно ~/.Xmodmap, с содержимым, представляющим свой код клавиш.\n\nПример Xmodmap файла с номером keycode:\n\n```\nkeycode 63 = KP_Multiply\nkeycode 79 = Home KP_7\nkeycode 80 = Up KP_8\nkeycode 81 = Prior KP_9\nkeycode 82 = KP_Subtract\nkeycode 83 = Left KP_4\nkeycode 84 = KP_5\nkeycode 85 = Right KP_6\nkeycode 86 = KP_Add\nkeycode 87 = End KP_1\nkeycode 88 = Down KP_2\nkeycode 89 = Next KP_3\nkeycode 90 = Insert KP_0\nkeycode 91 = Delete KP_Decimal\nkeycode 112 = Prior\nkeycode 117 = Next\n```\n\n3. Загрузите ваш файл xmodmap при запуске X сессии.\n\nНапример добавьте в файл ~/.xinitrc:\n\n```\n...\nxmodmap ~/.Xmodmap\n...\n```\n\n"
    },
    {
      "title": "Горячие клавиши не работают",
      "level": 3,
      "content": "Смотрите Get Alt key to work in terminal.\n\n"
    },
    {
      "title": "Низкая производительность при рисовании глифов",
      "level": 3,
      "content": "Некоторые программы, такие как alsamixer и xprop не хорошо выполняются с некоторыми графическими драйверами, и как следствие перерисовывают очень медленно. Опция \"skipBuiltinGlyphs\" в ~/.Xresources или параметр командной строки -sbg может это исправить. Одним из возможных решений является добавление следующей строки в ~/.Xresources:\n\n```\nURxvt*skipBuiltinGlyphs:    true\n```\n\n"
    },
    {
      "title": "Очень длинные строки замедляют работу",
      "level": 3,
      "content": "Виновником может быть плагин matcher. Он сопоставляет каждую строку с регулярным выражением, и, если у вас большое значение saveLines, это может усугубить проблему.\n\nЕсть несколько простых обходных путей:\n\n- Уменьшить saveLines\n- Отключить плагин matcher\n\nЕсли ни один из этих вариантов не устраивает, можно пойти на компромисс, отключив сопоставление URL после определённой точки отсечения:\n\n1. Скопируйте /usr/lib/urxvt/perl/matcher в ~/.urxvt/ext/ (создайте каталог, если его ещё нет)\n1. В файле ~/.urxvt/ext/matcher найдите строку my ($self, $row) = @_; в on_line_update sub. Это должна быть строка 270.\n1. После этой строки вставьте return () if $row < -100;. Это отключает сопоставление URL в любой строке, которая начинается более чем на 100 строк дальше верхней границы терминала.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- rxvt-unicode - Официальный сайт\n- Source Code - Browseable CVS\n- rxvt-unicode FAQ - Оффициальные ЧАВО\n- rxvt-unicode Reference - Официальная страница руководства\n- urxvtperl - Официальная справка расширений Perl\n\n"
    }
  ]
}