{
  "title": "USB storage devices (Русский)",
  "url": "https://wiki.archlinux.org/title/USB_storage_devices_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Монтирование\n\nВ этом документе описываются способы использования различных USB накопителей в Linux. Это также касается и других устройств, таких как цифровые камеры или телефоны, которые распознаются как обычные USB накопители.\n\nЕсли у вас свежая система со стандартным ядром Arch и современная среда рабочего стола, USB устройство должно автоматически появляться на рабочем столе при подключении, и лезть в консоль не потребуется.\n\n"
    },
    {
      "title": "Автоматическое монтирование с помощью udisks",
      "level": 2,
      "content": "Это самый простой и самый часто используемый метод. Он используется во многих средах рабочего стола, но может применяться и отдельно.\n\nПодробности и вспомогательные программы описаны в статье udisks (Русский).\n\n"
    },
    {
      "title": "Где взять ядро, поддерживающее usb_storage",
      "level": 3,
      "content": "Если не используется самодельное (самосборное) ядро, то делать ничего не требуется, все официальные ядра Arch Linux настроены как нужно. В случае самосборного ядра следует убедиться, что при компиляции была включена поддержка SCSI, SCSI-Disk и usb_storage. Если установлена последняя версия udev, то можно просто подключить носитель, и система автоматически подгрузит все необходимые модули ядра.\n\n"
    },
    {
      "title": "Опознавание устройств",
      "level": 3,
      "content": "Самое первое, что нужно знать об устройстве, так это его идентификатор, присвоенный ядром. Смотрите fstab (Русский)#Определение файловой системы для подробностей.\n\n"
    },
    {
      "title": "Монтирование USB флэш-памяти",
      "level": 3,
      "content": "Для этого нужно создать папку, в которую в дальнейшем будет монтироваться флэшка:\n\n```\n# mkdir /mnt/usbstick\n```\n\n"
    },
    {
      "title": "От имени суперпользователя (root)",
      "level": 4,
      "content": "Монтировать устройство рутом при помощи команды (только нужно заменить device_node найденным устройством, как было показано выше):\n\n```\n# mount device_node /mnt/usbstick\n```\n\nили\n\n```\n# mount -U UUID /mnt/usbstick\n```\n\nЕсли mount не распознаёт формат устройства (файловой системы), то можно попробовать с ключом -t <тип файловой системы>, а также глянуть в mount(8) для просвещения. Если монтирование не работает и на устройстве нет важных данных, можно попробовать отформатировать его или даже пересоздать таблицу разделов.\n\n"
    },
    {
      "title": "Разрешить запись обычным пользователям",
      "level": 4,
      "content": "Чтобы непривилегированные пользователи могли записывать данные на USB носитель, нужно прописать следующую команду:\n\n```\n# mount -o gid=users,fmask=113,dmask=002 /dev/sda1 /mnt/usbstick\n```\n\nЕсли это не сработало, убедитесь, что файловая система монтируема и доступна для записи суперпользователю (смотрите предыдущий раздел).\n\n"
    },
    {
      "title": "От имени обычного пользователя посредством fstab",
      "level": 4,
      "content": "Если вы хотите, чтобы обычный пользователь имел право монтировать и размонтировать устройство, смотрите FAT (Русский)#Запись на FAT32 в качестве обычного пользователя.\n\n"
    },
    {
      "title": "Инструменты монтирования",
      "level": 4,
      "content": "Есть множество инструментов, облегчающих монтирование от имени обычного пользователя.\n\n"
    },
    {
      "title": "Никакие устройства хранения USB не распознаются системой",
      "level": 3,
      "content": "Если вы подключили USB-накопитель к компьютеру, но он не отображается в списке lsblk или dmesg, убедитесь, что в BIOS включена функция XHCI Handoff и EHCI Handoff.\n\n"
    },
    {
      "title": "Устройство USB определилось, но его не получается примонтировать",
      "level": 3,
      "content": "Если вы недавно обновили ядро, модули для USB-накопителя для вашего текущего ядра были удалены и заменены модулями для свежеустановленного ядра. Эти модули не смогут загрузиться, пока вы не перезагрузитесь и не запустите новое ядро или не выполните откат пакета ядра до версии, соответствующей текущей версии ядра.\n\n"
    },
    {
      "title": "Устройство не выключается после размонтирования всех разделов",
      "level": 3,
      "content": "Невыключение питания устройства может привести к тому, что:\n\n- жёсткий диск не припаркует свою головку, издаст слабый царапающий звук при раскручивании и может деградировать [2], или\n- твердотельный диск (особенно старый) не сбросит буферы кэша или не обновит таблицы отображения, что может привести к потере данных [3].\n\nПосле размонтирования разделов устройство всё ещё включено. Чтобы безопасно извлечь его, необходимо сначала попросить систему выключить его: [4]\n\n```\n# echo 1 > /sys/block/имя_диска/device/delete\n```\n\nЕсли вы используете udisks, можно использовать следующие команды: [5]\n\n```\n$ udisksctl unmount -b /dev/sdXY\n$ udisksctl power-off -b /dev/sdX\n```\n\n"
    }
  ]
}