{
  "title": "USB storage devices (Español)",
  "url": "https://wiki.archlinux.org/title/USB_storage_devices_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2021-02-15** \n\nArtículos relacionados\n\n- Montaje\n\nEste artículo describe cómo utilizar las memorias USB en Linux. También es válido para otros dispositivos (como las cámaras digitales) que actúan como si fueran un simple dispositivo de almacenamiento USB.\n\nSi dispone de un sistema actualizado con el kernel estándar de Arch y un entorno de escritorio moderno, su dispositivo debería simplemente aparecer en el escritorio, sin necesidad de abrir la terminal.\n\n"
    },
    {
      "title": "Montaje automático con udisks",
      "level": 2,
      "content": "Se trata del método más fácil y habitual. Es utilizado por muchos entornos de escritorio, pero también puede usarse por separado.\n\nVéase Udisks para obtener más información, incluyendo la lista de ayudantes de montaje.\n\n"
    },
    {
      "title": "Conseguir un kernel que soporte usb_storage",
      "level": 3,
      "content": "Si no está usando un kernel personalizado, no se preocupe, ya que todos los kernels por defecto de Arch Linux están correctamente configurados. Si usa un kernel personalizado, asegúrese de que está compilado con SCSI-Support, SCSI-Disk-Support y usb_storage. Si utiliza la última versión de udev, simplemente conecte el dispositivo y el sistema cargará automáticamente todos los módulos del kernel necesarios.\n\n"
    },
    {
      "title": "Identificar el dispositivo",
      "level": 3,
      "content": "Lo primero que se necesita para acceder a un dispositivo de almacenamiento es conocer el identificador asignado por el kernel. Véase Fstab (Español)#Identificación de sistemas de archivos para obtener más detalles.\n\n"
    },
    {
      "title": "Montar la memoria USB",
      "level": 3,
      "content": "Hay que crear el directorio en el que se va a montar el dispositivo:\n\n```\n# mkdir /mnt/usbstick\n```\n\n"
    },
    {
      "title": "Como root",
      "level": 4,
      "content": "Monte el dispositivo como root con la siguiente orden (no olvide sustituir device_node por la ruta que ha encontrado):\n\n```\n# mount device_node /mnt/usbstick\n```\n\no bien\n\n```\n# mount -U UUID /mnt/usbstick\n```\n\nSi mount no reconoce el sistema de archivos del dispositivo, intente usar la opción -t. Véase mount(8) para obtener más detalles. Si el montaje no funciona, pruebe a recrear el sistema de archivos o incluso reparticionar el disco.\n\n"
    },
    {
      "title": "Permitir la escritura a usuarios normales",
      "level": 4,
      "content": "Si desea permitir que los usuarios no root puedan escribir en la memoria USB, ejecute la siguiente orden:\n\n```\n# mount -o gid=users,fmask=113,dmask=002 /dev/sda1 /mnt/usbstick\n```\n\nSi no funciona, asegúrese de que el sistema de archivos es montable y escribible como root. Véase la sección anterior para más detalles.\n\n"
    },
    {
      "title": "Como usuario normal con fstab",
      "level": 4,
      "content": "Véase FAT (Español)#Escribir en FAT32 como usuario normal si desea que un usuario normal realice el montaje/desmontaje.\n\n"
    },
    {
      "title": "Herramientas de montaje",
      "level": 4,
      "content": "Existen múltiples herramientas de montaje que facilitan la acción de montaje como usuario normal.\n\n"
    },
    {
      "title": "El sistema no reconoce ningún dispositivo de almacenamiento USB",
      "level": 3,
      "content": "Si ha conectado su dispositivo de almacenamiento USB al ordenador y no aparece en la lista de lsblk o dmesg, asegúrese de que la BIOS tiene activados tanto XHCI Handoff como EHCI Handoff.\n\n"
    },
    {
      "title": "El dispositivo USB es detectado pero no es posible montarlo",
      "level": 3,
      "content": "Si ha actualizado recientemente su kernel, los módulos para el almacenamiento USB del kernel actualmente en ejecución fueron eliminados y reemplazados por módulos para el kernel recién instalado. Estos módulos no se cargarán hasta que reinicie y ejecute el nuevo kernel.\n\n"
    },
    {
      "title": "El dispositivo no se apaga después de desmontar todas las particiones",
      "level": 3,
      "content": "Si no se apaga un dispositivo, esto puede resultar en:\n\n- que una unidad de disco duro no aparque su cabeza, emitiendo un débil sonido de rascado mientras gira y degradando el dispositivo [2], o bien\n- que una unidad de estado sólido (especialmente las más antiguas) no vacíe sus búferes de caché ni actualice sus tablas de asignación, perdiendo datos [3].\n\nCuando desmonta las particiones, el dispositivo sigue encendido. Debe pedirle al sistema que lo apague primero para poder retirarlo de forma segura: [4]\n\n```\n# echo 1 > /sys/block/nombre_del_disco/device/delete\n```\n\nSi usa udisks, puede ejecutar las siguientes órdenes: [5]\n\n```\n$ udisksctl unmount -b /dev/sdXY\n$ udisksctl power-off -b /dev/sdX\n```\n\n"
    }
  ]
}