{
  "title": "USB flash installation medium (Türkçe)",
  "url": "https://wiki.archlinux.org/title/USB_flash_installation_medium_(T%C3%BCrk%C3%A7e)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "İlgili makaleler\n\n- DVD Burning\n- Archiso\n- Multiboot USB drive\n\nBu sayfa bir Arch Linux Kurulum USB diskinin (flaş disk, flaş bellek şeklinde de bildiğimiz araç) nasıl oluşturulabileceği üzerine, çeşitli işletim sistemlerinde kullanılabilecek yöntemlerden bahseder. Kurulum ortamı hem BIOS'u hem de UEFI'yı destekler. Bu öğreticinin sonucunda oluşacak olan şey Arch Linux'u kurmak için, sistem kurtarma işlemleri için ve diğer sistem bakım işlemleri için kullanabileceğiniz bir canlı USBdir. Canlı sistem / için Overlayfs kullandığından dolayı canlı sistemin kendisine yaptığınız tüm değişiklikler bilgisayar kapatıldığında sıfırlanacaktır.\n\nEğer bir USB diske tam bir Arch Linux kurulumu (kalıcı ayarlar ile) yapmak istiyorsanız, Install Arch Linux on a removable medium sayfasına bakın. Eğer Arch Linux USB diskinizi sistem kurtarma diski olarak kullanmak istiyorsanız chroot sayfasına bakın.\n\nAşağıdaki yönergelerden herhangi birini takip etmeden önce ISO dosyasını https://archlinux.org/download/ sayfasından indirin ve doğruluğunu test edin\n\n"
    },
    {
      "title": "Başlıca komut satırı araçlarını kullanarak",
      "level": 4,
      "content": "Kullanılacak araçlar coreutils (base meta-paketinden çekilen) paketinin bir parçası olduğu için bu yöntem kolaylığı ve evrensel ulaşılabilirliği sebebiyle önerilir.\n\nUSB diskinin ismini ls -l /dev/disk/by-id/usb-* ile bulun ve lsblk komutu ile bağlı (mounted) olmadığını doğrulayın.\n\nAşağıdaki komutlardan herhangi birini /dev/disk/by-id/usb-Benim_flash_diskim şeklindeki yerleri kendi USB diskinizin adı ile değiştirerek (ör. /dev/disk/by-id/usb-Kingston_DataTraveler_2.0_408D5C1654FDB471E98BED5C-0:0) giriniz. (Disk bölüm numarası girmeyiniz, yani /dev/disk/by-id/usb-Kingston_DataTraveler_2.0_408D5C1654FDB471E98BED5C-0:0-part1 veya /dev/sdb1 benzeri bir şey kullanmayınız)\n\n- cat(1) komutunu kullanarak: # cat dizin/yolu/archlinux-sürüm-x86_64.iso > /dev/disk/by-id/usb-Benim_flash_diskim\n- cp(1) komutunu kullanarak: # cp dizin/yolu/archlinux-sürüm-x86_64.iso /dev/disk/by-id/usb-Benim_flash_diskim\n- dd komutunu kullanarak:# dd bs=4M if=dizin/yolu/archlinux-sürüm-x86_64.iso of=/dev/disk/by-id/usb-Benim_flash_diskim conv=fsync oflag=direct status=progress\n- tee(1) komutunu kullanarak: # tee < dizin/yolu/archlinux-sürüm-x86_64.iso > /dev/disk/by-id/usb-Benim_flash_diskim\n- pv komutunu kullanarak: # pv dizin/yolu/archlinux-sürüm-x86_64.iso -Yo /dev/disk/by-id/usb-Benim_flash_diskim\n\n```\n# cat dizin/yolu/archlinux-sürüm-x86_64.iso > /dev/disk/by-id/usb-Benim_flash_diskim\n```\n\n```\n# cp dizin/yolu/archlinux-sürüm-x86_64.iso /dev/disk/by-id/usb-Benim_flash_diskim\n```\n\n```\n# dd bs=4M if=dizin/yolu/archlinux-sürüm-x86_64.iso of=/dev/disk/by-id/usb-Benim_flash_diskim conv=fsync oflag=direct status=progress\n```\n\n```\n# tee < dizin/yolu/archlinux-sürüm-x86_64.iso > /dev/disk/by-id/usb-Benim_flash_diskim\n```\n\n```\n# pv dizin/yolu/archlinux-sürüm-x86_64.iso -Yo /dev/disk/by-id/usb-Benim_flash_diskim\n```\n\nBu yöntemler hakkındaki karşılaştırmaları [1] ve [2] bağlantılarına tıklayarak inceleyebilir ve dd'nin neden en uyumsuz yol olabileceği hakkında bilgi alabilirsiniz.\n\n- İlgili komutun ardından sync komutunu kök izni ile çalıştırmak, verilerin diske tamamen yazılmasını ve diski çıkarmadan önce verilerin arabellekte kalmamasını sağlar.\n- Eğer Arch ISO, USB'yi UEFI modunda çalıştırırken takılı kalıyor veya yüklenemiyor ise kurulum ortamı oluşturma sürecini bir veya birden fazla kez tekrarlamanız tavsiye edilir. Eğer işe yaramıyorsa anakartınızın yazılımını güncellemeniz gerekiyor olabilir.\n\n"
    },
    {
      "title": "KDE ISO Kalıbı Yazıcısı'nı kullanarak",
      "level": 4,
      "content": "KDE ISO Kalıbı Yazıcısı, isoimagewriter paketi ile indirilebilir. Aynı zamanda Windows'ta da kullanılabilir. Program açıldıktan sonra USB disk otomatik olarak algılanır ve ilgili ISO dosyasını seçmeniz gerekir. Dosyanın doğruluğundan emin olmak için .sig uzantılı bir imza dosyasının kullanılması önerilir ancak bu aşama \"Oluştur\" butonuna basarak atlanabilir.\n\n"
    },
    {
      "title": "GNOME Diskler'i kullanarak",
      "level": 4,
      "content": "GNOME masaüstü ortamı barındıran Linux dağıtımları nautilus ve gnome-disk-utility programlarını kullanarak kolayca canlı USB oluşturabilirler. .iso dosyasına sağ tıklayıp Disk Görüntü Yazıcısı ile Açın seçeneğine tıklayın. GNOME Disk Utility açıldığında Hedef olarak takmış olduğunuz flaş belleği seçip Geri yüklemeyi başlat butonuna tıklayın.\n\n"
    },
    {
      "title": "MultiWriter kullanarak",
      "level": 4,
      "content": "gnome-multi-writer; kolay, GTK3 temelli, görsel arayüze sahip, ISO dosyasını bir veya birden fazla USB cihaza yazabilen bir araçtır.\n\n"
    },
    {
      "title": "Kindd kullanarak",
      "level": 4,
      "content": "Kindd, Qt temelli, komut satırı aracı olan dd için görsel önyüzüdür (frontend). kinddAUR AUR paketiyle erişilebilir.\n\n"
    },
    {
      "title": "Popsicle kullanarak",
      "level": 4,
      "content": "Popsicle, PopOS geliştirici ekibi tarafından yazılmış, birden fazla USB cihazına paralel olarak ISO dosyası yazmaya yarayan bir araçtır. Rust ile yazılmıştır ve arayüzü GTK'dır. popsicleAUR AUR paketiyle erişilebilir.\n\n"
    },
    {
      "title": "SUSE Studio ImageWriter kullanarak",
      "level": 4,
      "content": "SUSE Studio ImageWriter, openSUSE geliştirici ekibi tarafından yazılmış Qt temelli bir araçtır. imagewriterAUR adıyla ulaşılabilir.\n\n"
    },
    {
      "title": "xorriso-dd-target kullanarak",
      "level": 4,
      "content": "xorriso-dd-target, (libisoburn paketiyle edinilebilir), yanlış bir cihaz üzerine yazma riskini düşürmek amacıyla yazılımış bir kabuk betiğidir (shell script). Aracı en güvenli modda kullanmak için -plug_test seçeneği (flag) kullanılabilir. sudo ile kök izni alabilen bir sıradan kullanıcı şu komutu kullanabilir:\n\n```\n$ xorriso-dd-target -with_sudo -plug_test -DO_WRITE -image_file archlinux-sürüm-x86_64.iso\n```\n\nDetaylar için xorriso-dd-target(1) sayfasına bakın.\n\n"
    },
    {
      "title": "USBImager kullanarak",
      "level": 4,
      "content": "USBImager, sıkıştırılmış disk yansımalarını doğrulayıp USB disklere yazan, yedekler oluşturan, grafiksel arayüze sahip çok platformlu bir araçtır. usbimagerAUR paketiyle ulaşılabilir hâldedir.\n\n"
    },
    {
      "title": "KDE ISO Kalıbı Yazıcısı'nı kullanarak",
      "level": 4,
      "content": "KDE ISO Kalıbı Yazıcısı .exe olarak isoimagewriter sayfasından indirilebilir. Program açıldıktan sonra USB disk otomatik olarak algılanır ve ilgili ISO dosyasını seçmeniz gerekir. Dosyanın doğruluğundan emin olmak için .sig uzantılı bir imza dosyasının kullanılması önerilir ancak bu aşama \"Oluştur\" butonuna basarak atlanabilir.\n\n"
    },
    {
      "title": "win32diskimager kullanarak",
      "level": 4,
      "content": "win32diskimager görsel arayüzlü, USB disklere ve SD/CF kartlara imaj yazdırmaya yarayan bir başka araçtır. Aracı açtıktan sonra ISO kalıbını, ve hedef olarak da USB diskinizin harfini seçerek (eğer diskinize harf atanmamışsa başta harf atamanız gerekebilir) kurulum ortamını kolayca cihazınıza yazabilirsiniz.\n\n"
    },
    {
      "title": "USBwriter kullanarak",
      "level": 4,
      "content": "Bu yöntem karışık bazı yönergeler gerektirmeyip Linux'ta bulunan dd gibi oldukça kolay bir yöntemdir. Arch Linux ISO'sunu indirip yönetici yetkileri ile USBwriter'ı çalıştırıp, gerekli ayarlamaları yapıp USB diskinize ISO dosyasını yazdırabilirsiniz.\n\n"
    },
    {
      "title": "USBImager kullanarak",
      "level": 4,
      "content": "USBImager, sıkıştırılmış disk yansımalarını doğrulayıp USB disklere yazan, yedekler oluşturan, grafiksel arayüze sahip çok platformlu bir araçtır.\n\n"
    },
    {
      "title": "Rufus kullanarak",
      "level": 4,
      "content": "Rufus çok amaçlı bir USB ISO yazıcısıdır. Görsel kullanıcı arayüzü sunar. USB diskiniz doğru bir şekilde biçimlendirilmemişse bile kurulum ortamına uygun şekilde biçimlendirip diskinizi hazırlayabilir.\n\nKısaca Arch Linux ISO'sunu seçin, sonrasında kurulum ortamını oluşturmak istediğiniz USB diski seçin ve BAŞLAT'a tıklayın.\n\nNote: **DD İmajı modu** \n\n"
    },
    {
      "title": "Cygwin kullanarak",
      "level": 4,
      "content": "Cygwin kurulumunuzun dd paketini içerdiğinden emin olun.\n\nKurulum kalıbı dosyasını ev dizinine getirin:\n\n```\nC:\\cygwin\\home\\Kullanıcı\\\n```\n\nCygwin'i yönetici olarak çalıştırın (Cygwin'in donanıma erişebilmesi için gereklidir). Kalıbı USB diskinize yazdırmak için şu komutu kullanın:\n\n```\ndd if=archlinux-sürüm-x86_64.iso of=\\\\.\\x: bs=4M\n```\n\nBurada archlinux-sürüm-x86_64.iso, cygwin dizininden başlayarak ISO kalıbına giden dizin yolunu ifade eder, ayrıca \\\\.\\x: şeklinde belirtilen seçenekteki x yerine de USB diskinize tanımlanmış olan harfi girmeniz gerekmektedir.\n\nCygwin 6.0'da, doğru disk bölümünü bulmak için şu komut girilebilir:\n\n```\ncat /proc/partitions\n```\n\nBu komutun çıktısından elde edeceğiniz bilgi ile ISO dosyasını diske yazabilirsiniz. Örneğin:\n\n```\ndd if=archlinux-sürüm-x86_64.iso of=/dev/sdb bs=4M\n```\n\n"
    },
    {
      "title": "Windows için dd kullanarak",
      "level": 4,
      "content": "Windows için GPL lisanslı bir dd bulunmaktadır, programa http://www.chrysocome.net/dd adresinden ulaşabilirsiniz. Bu yöntemin Cygwin üzerinden dd kullanmaya kıyasla avantajı, indirme boyutunun çok daha düşük olmasıdır. Yukarıda Cygwin için belirtilmiş yolun aynısını kullanarak yazdırma işlemini gerçekleştirebilirsiniz.\n\nBaşlamak için, Windows için dd'nin en son sürümün indirin. İndirmiş olduğunuz arşivi İndirilenler klasöründe veya başka bir yerde çıkarın.\n\nKomut İstemi programını yönetici olarak çalıştırın ve (cd komutu ile) İndirilenler dizinine girin.\n\nEğer Arch Linux ISO'nuz başka bir yerde bulunuyorsa cd'ye tam konumu girmeniz gerekebilir. Kolaylık olması için Arch Linux ISO'sunu, çalıştırılabilir dd dosyası ile aynı konuma koyabilirsiniz. Komutun basitçe kullanım şekli şu şekilde görünecektir:\n\n```\n# dd if=archlinux-sürüm-x86_64.iso od=\\\\.\\x: bs=4M\n```\n\n"
    },
    {
      "title": "flashnul kullanarak",
      "level": 4,
      "content": "flashnul bir taşınabilir belleğin (USB bellek, IDE-Flash, SD kart, MMC kart, Memory Stick, SmartMedia kart, XD kart, CompactFlash gibi) işlevselliğini ve bakımını teyit etmek için kullanılabilecek bir araçtır. Aynı zamanda ISO yazdırmak için de kullanılabilir.\n\nKomut istemini açın, flashnul programını -p bayrağı ile çağırın ve hangi dizinin USB diskinize ait olduğunu saptayın:\n\n```\nC:\\>flashnul -p\n```\n\n```\nAvaible physical drives:\nAvaible logical disks:\nC:\\\nD:\\\nE:\\\n```\n\nHangi cihazın sizin diskiniz olduğu saptadıktan sonra kurulum kalıbını USB diskinize yazabilirsiniz, bunun için diskinze ait dizini ve -L ile kalıba giden yolu girmeniz gerekecektir:\n\n```\nC:\\>flashnul E: -L kalıba\\giden\\yol\\archlinux-sürüm-x86_64.iso\n```\n\nDiskinize kurulum kalıbının verilerini yazmaya emin olduğunuzda, \"yes\" yazın ve yazma işlemi için biraz bekleyin. Eğer \"access denied\" yani \"erişim reddedildi\" hatası alıyorsanız açık olan tüm \"Dosyalarım\" yani explorer.exe programını kapatın\n\n"
    },
    {
      "title": "macOS için dd kullanarak",
      "level": 4,
      "content": "Öncelikle USB diskinizi tanımlamanız gerekmektedir. /Applications/Utilities/Terminal dizinini açın ve aşağıdaki komut ile tüm depolama cihazlarını listeleyin:\n\n```\n$ diskutil list\n```\n\nUSB cihazınız /dev/disk2 (external, physical) gibi bir şekilde gözükecektir. Bu cihazlardan hangisinin sizin cihazınız olduğunu anlamak için ismini ve boyutunu kontrol edebilirsiniz. Seçtiğiniz cihazın içerisindeki tüm veriler silineceği için doğru cihazı seçmiş olduğunuzdan emin olun ve buradan sonraki komutlarda /dev/diskX şeklinde belirtilmiş olan yer tutucularında X'i yani disk numarasını kendinizinki ile değiştirin.\n\nmacOS'te USB diskler bilgisayara otomatik olarak bağlanır, ve dd ile blok yazma işlemine başlamadan önce diskin bağlantısını kesmeniz (fiziksel anlamda çıkarmak değil, yazılımsal anlamda bağlantıyı kesmeniz) gerekir. Bunun için Terminal uygulamasını açın ve şu komutu girin:\n\n```\n$ diskutil unmountDisk /dev/diskX\n```\n\nŞimdi ise ISO kalıbını cihaza kopyalayın.\n\n- BSD'den türetilmiş dd, yani macOS'te bulunan dd küçük harfli m son eki kullanır. Bu kullanım şekli, bu makalenin başka bir bölümünde de kullanılan GNU'ya ait olan dd ile farklılık gösterir.\n- dd komutu, Linux'takiyle benzer özelliklere sahiptir ancak 'disk' parametresinden önce girilen 'r' harfi \"raw\" modda transfer gerçekleştirir ve işlemin daha da hızlı olmasını sağlar\n- macOS'in yeni sürümlerinde dd komutu, ilerleme durumunu gösteren status=progress parametresini destekler. Bununla birlikte ilerleme durumunu aşağıda gösterildiği üzere elle de görüntülenebilir.\n\n```\n# dd if=path/to/archlinux-sürüm-x86_64.iso of=/dev/rdiskX bs=1m\n```\n\nKomut sessiz bir şekilde çalışacaktır. İlerlemeyi görüntülemek için, Ctrl+t tuşuna basarak SIGINFO gönderin. Unutmayın ki diskX burada s1 son ekini içermemelidir yoksa USB cihazınız sadece UEFI modda açılacaktır ve Legacy (eski) modda açılmayacaktır. İşlem tamamlandığında macOS diskin cihaz tarafından okunamadığı hakkında bir uyarıda bulunacaktır. Yoksay seçeneğine tıklayın. Uyarıya dikkate almanıza gerek yoktur ve USB cihazınız önyüklenebilir olacaktır.\n\n"
    },
    {
      "title": "USBImager kullanarak",
      "level": 4,
      "content": "USBImager, sıkıştırılmış disk yansımalarını doğrulayıp USB disklere yazan, yedekler oluşturan, grafiksel arayüze sahip çok platformlu bir araçtır.\n\n"
    },
    {
      "title": "EtchDroid kullanarak",
      "level": 4,
      "content": "EtchDroid, Android için bir OS (işletim sistemi) kalıbı yazdırıcısıdır. Android 5'ten itibaren kök izni gerektirmeden çalışmaktadır. Herhangi bir problemle karşılaşmanız durumunda GitHub depolarına göz atın.\n\nArch Linux yükleyicisi oluşturmak için öncelikle ISO kalıbını Android cihazınıza indirin. USB diskinizi cihazınıza bağlayın, eğer gerekiyorsa USB-OTG adaptörü kullanabilirsiniz. EtchDroid'i açın ve Ham kalıp veya ISO dosyası yaz seçeneğine tıklayın, Arch ISO dosyasını seçin ve ardından USB diskinizi seçin ve son olarak USB API iznini onaylayın.\n\nEğer USB-OTG adaptörü kullanıyorsanız cihazınızı düz bir yüzeyde tutmanız tavsiye edilir. Çoğu USB-OTG adaptörü biraz oynaktır ve biraz hareket ettirildiğinde siz farkında olmadan çıkabilir.\n\n"
    },
    {
      "title": "GNU/Linux'da",
      "level": 4,
      "content": "Bu yöntem kalıbı dd ile direkt olarak yazmaktan biraz daha karışıktır. Ama flaş diskinizde kullanılabilir veri depolama alanı bulundurabilmenizi sağlar. (yani ISO'yu belli bir bölüme kurup hâlihazırda bölümlendirilmiş bir cihazın diğer bölümlerinde değişiklik yapmadan)\n\n- Eğer hazırlamamışsanız /dev/disk/by-id/usb-Benim_flash_diskim'de bir bölümlendirme tablosu oluşturun.\n- Eğer hazırlamamışsanız cihazda bir bölüm oluşturun. Oluşturduğunuz /dev/disk/by-id/usb-Benim_flash_diskim-partn bölümü FAT32 şeklinde biçimlendirilmelidir.\n- USB flaş diskinizde bulunan bu FAT32 dosya sistemini bilgisayara bağlayın ve ISO kalıbının içindekileri bu dosya sistemine çıkartın. Örneğin şu şekilde:\n\n```\n# mount /dev/disk/by-id/usb-Benim_flash_diskim-partn /mnt\n# bsdtar -x -f archlinux-sürüm-x86_64.iso -C /mnt\n```\n\nBIOS sistemler için gerekli olan Syslinux dosyaları /mnt/boot/syslinux/'a kopyalanmış durumdadır. FAT dosya sisteminin bağlantısını kesin, syslinux ve mtools paketlerini indirin ve bölümü önyüklenebilir hâle getirmek için aşağıdaki komutları girin:\n\n```\n# umount /mnt\n# syslinux --directory boot/syslinux --install /dev/disk/by-id/usb-Benim_flash_diskim-partn\n# dd bs=440 count=1 conv=notrunc if=/usr/lib/syslinux/bios/mbr.bin of=/dev/disk/by-id/usb-Benim_flash_diskim\n```\n\n"
    },
    {
      "title": "Windows'ta",
      "level": 4,
      "content": "Note: **Önyüklenebilir USB Oluşturucu aracı** \n\n- Elle biçimlendirirken, UEFI ile önyüklenecek ise hiçbir Önyüklenebilir USB Oluşturucu aracını kullanmayın. Yine elle biçimlendirirken Windows için ddyi kullanmayın.\n- Aşağıdaki komutlarda X: ile belirtilen kısımları diskinizin harfi ile değiştirin.\n- Aşağıdaki tüm komutlar komut isteminde yönetici olarak çalıştırılmalıdır.\n- > şeklinde başlayan bölümler komut istemi girdi ekranını belirtir.\n\n- Rufus USB bölümlendirici programını kullanarak USB diskinizi bölümlendirin ve biçimlendirin. Disk Bölüm Düzeni olarak BIOS ya da UEFI Bilgisayarlar için MBR Bölüm Düzeni'ni seçin ve dosya sistemi olarak da FAT32'yi seçin. \"Açılış Diski Oluşturma Yöntemi\" ve \"Genişletilmiş Etiket ve Simge Dosyaları Oluştur\" seçeneklerinin işaretini kaldırın.\n- 7-Zip kullanarak USB diskinize ISO dosyasını çıkartın (ZIP dosyası çıkartır gibi).\n- Resmî Syslinux 6.xx programını (binary, zip dosyası), https://www.kernel.org/pub/linux/utils/boot/syslinux/ sitesinden indirin ve indirmiş olduğunuz ZIP dosyasını çıkartın. Syslinux'un sürümü ISO kalıbında kullanılan ile aynı olmalıdır.\n\n- Aşağıdaki komutu çalıştırın (Komut isteminde, yönetici olarak):\n\n```\n> cd bios\\\n> for /r %Y in (*.c32) do copy \"%Y\" \"X:\\boot\\syslinux\\\" /y\n> copy mbr\\*.bin X:\\boot\\syslinux\\ /y\n```\n\n- Aşağıdaki komutları girerek Syslinux'u USB diskinize kurun (x64 tabanlı Windows türevleri için win64\\syslinux64.exe'ü kullanın):\n\n```\n> cd bios\\\n> win32\\syslinux.exe -d /boot/syslinux -i -a -m X:\n```\n\n- Sadece dosyaları kopyalamak önyüklenemeyen bir cihaz oluşmasına sebep olabilir: son komut Syslinux dosyalarını USB bölümünün VBR'sine kurar, bölümü MBR bölüm tablosunda \"aktif/önyükleme\" şeklinde ayarlar ve MBR önyükleme kodunu USB diske yazar.\n- -d anahtarı kullanılırken *unix sistemlerindekine benzer yol ayracı (eğik çizgi) girilmesi gerekir.\n\n"
    },
    {
      "title": "GNU/Linux'da",
      "level": 4,
      "content": "Bazı eski BIOS sistemleri için sadece USB-ZIP sürücüsünden önyükleme destekleniyor olabilir. Bu yol USB-HDD sürücüden önyükleyebilmenizi sağlamaktadır.\n\n- syslinux ve mtools paketlerini resmî depolardan kurun.\n- ls /dev/disk/by-id/usb-* ile USB diskinizi saptayın.\n\nBuradan sonra elle biçimlendirme yöntemiyle devam edin. ZIP sürücülerinin çalışma şeklinden dolayı bölüm /dev/disk/by-id/usb-Benim_flash_diskim-part4 şeklinde gösterilebilir.\n\n"
    },
    {
      "title": "Sadece UEFI kullanımı için",
      "level": 3,
      "content": "Sadece UEFI ile önyükleme durumunda; ISO'nin içindeki dosyaları, FAT şeklinde biçimlendirilmiş bir USB diske kopyalamanız yeterli olacaktır.\n\nTüm UEFI sistemler sorunsuz bir şekilde, USB flaş disklerin herhangi bir FAT bölümünü önyükleyebileceğinden dolayı bu yöntem, sürücüde bir EFI sistem bölümü oluşturmayı gerektirmez. En uyumlu yöntem, 0c \"W95 FAT32 (LBA)\" tipinde, tek aktif (önyüklenebilir) birincil bölüm barındıran bir MBR bölümlendirme tablosu olacaktır. [3]\n\n"
    },
    {
      "title": "GNU/Linux'da",
      "level": 4,
      "content": "Bu yöntem yukarıda da bahsedildiği gibi ISO kalıbındaki dosyaları USB diske çıkarmak şeklindedir.\n\n1. Eğer yapmamışsanız, cihazda, /dev/disk/by-id/usb-Benim_flash_diskim'te bir bölümlendirme tablosu ve bir bölüm (/dev/disk/by-id/usb-Benim_flash_diskim-partn) oluşturun.\n1. Eğer yapmamışsanız bölümü FAT32 şeklinde biçimlendirin: # mkfs.fat -F 32 /dev/disk/by-id/usb-Benim_flash_diskim-partn\n1. FAT32 dosya sistemini bağlayın: # mount /dev/disk/by-id/usb-Benim_flash_diskim-partn /mnt\n1. ISO kalıbını bağlı dosya sisteminde çıkarın: # bsdtar -x -f archlinux-sürüm-x86_64.iso -C /mnt\n1. FAT32 dosya siteminin bağlantısını kesin.\n\n```\n# mkfs.fat -F 32 /dev/disk/by-id/usb-Benim_flash_diskim-partn\n```\n\n```\n# mount /dev/disk/by-id/usb-Benim_flash_diskim-partn /mnt\n```\n\n```\n# bsdtar -x -f archlinux-sürüm-x86_64.iso -C /mnt\n```\n\n"
    },
    {
      "title": "Windows'ta",
      "level": 4,
      "content": "Bu yöntem ISO imajındaki dosyaları USB flaş diske kopyalamak şeklindedir.\n\n1. USB diski bölümlendirin ve FAT32 şeklinde biçimlendirin.\n1. archlinux-version-x86_64.iso dosyasına sağ tıklayın ve Bağla deyin.\n1. Bağlamış olduğunuz ISO dosyası DVD sürücüsü şeklinde gözükecektir, DVD sürücüsünü dosya gezgininde açın ve içindeki tüm dosyaları USB diskinize kopyalayın.\n1. Kopyalama işlemi bittiğinde, DVD sürücüsüne sağ tıklayın ve Çıkar deyin.\n1. USB diskinizi çıkarın.\n\n"
    },
    {
      "title": "macOS'te",
      "level": 4,
      "content": "Ne DiskImageMounter ne de Disk İzlencisi isohybrid ISOlarını bağlayamaz, ancak macOS libarchive kütüphanesini bünyesinde barındırdığı için ISO dosyası, bsdtar komutu ile flaş diske çıkartılabilir.\n\n1. Eğer yapılmamışsa, USB diski bölümlendirin ve Disk İzlencisi'ni kullanarak FAT32 şeklinde biçimlendirin.\n1. İlgili disk bölümünü bağlayın.\n1. Terminal uygulamasını açın ve bsdtar komutunu kullanarak ISO imajını, bağladığınız dosya sistemine çıkartın: $ bsdtar -x -f archlinux-sürüm-x86_64.iso -C /Volumes/flaş-diskin-adı\n1. Bittiğinde USB diskin bağlantısını kesip çıkarın.\n\n```\n$ bsdtar -x -f archlinux-sürüm-x86_64.iso -C /Volumes/flaş-diskin-adı\n```\n\n"
    },
    {
      "title": "Çoklu önyüklemeli USB disk kullanarak",
      "level": 2,
      "content": "Bu yöntem tek USB diskten birden çok ISO dosyasını, archiso dahil, önyükleyebilmenizi sağlar. Yine bu yöntemde eski bir ISO'yu yenisi ile değiştirmek çoğu diğer yöntemden daha kolaydır. Multiboot USB drive sayfasına bakın.\n\n"
    },
    {
      "title": "Ventoy kullanarak",
      "level": 3,
      "content": "Ventoy açık kaynak kodlu, ISO/WIM/IMG/VHD(x)/EFI dosyaları ile önyüklenebilir USB disk oluşturma aracıdır. Ventoy ile diski tekrar tekrar biçimlendirmenize gerek yoktur, kaynak olarak kullanacağınız dosya kalıplarını USB diskinize atmak önyükleyebilmeniz için yeterli olacaktır. Ventoy önyükleme için bir menü sunacağı için tek seferde birden fazla kalıp dosyasını diskinize kopyalayabilirsiniz. ventoy-binAUR olarak AUR'da mevcuttur.\n\n"
    },
    {
      "title": "Kurulum ortamını RAM'den yükleme",
      "level": 4,
      "content": "Bu yöntem Arch Linux ISO kalıbını tamamen RAM'de çalıştırmak için Syslinux ve bir Ramdisk (MEMDISK) kullanır. Bu süreçte tüm ISO RAM'den çalışacağı için sisteminizin yeterli miktarda RAM'e sahip olduğundan emin olmalısınız. En az 500MB ile 1GB arası bellek MEMDISK temelli bir Arch Linux kurulumu için yeterli olacaktır.\n\nSistem gereksinimleri ve MEMDISK hakkındaki bilgiler için Kurulum Rehberi'ne ve bu sayfaya bakabilirsiniz. Referans olması için bu forum konusunu inceleyebilirsiniz.\n\nUSB flaş diski FAT32 şeklinde biçimlendirerek başlayın. Ardından yeni biçimlendirmiş olduğunuz diskte aşağıdaki klasörleri oluşturun.\n\n- Boot Boot/ISOs Boot/Settings\n\n- Boot/ISOs\n- Boot/Settings\n\nÖnyüklemek istediğiniz ISO dosyalarını Boot/ISOs klasörüne kopyalayın. Sonrasında syslinux'un en son sürümünü buradan indirip ilgili dosyaları aşağıdaki dizinlere çıkartın:\n\n- ./win32/syslinux.exe dosyasını sisteminizin Masaüstü'ne veya İndirilenler'ine\n- ./memdisk/memdisk'i, USB diskinizdeki Settings klasörüne\n\nGerekli dosyaları kopyaladıktan sonra USB diskinizde /Boot/Settings klasöründe syslinx.cfg dosyası oluşturun.\n\n```\n/Boot/Settings/syslinux.cfg\n```\n\n```\nDEFAULT arch_iso\n\nLABEL arch_iso\n        MENU LABEL Arch Setup\n        LINUX memdisk\n        INITRD /Boot/ISOs/archlinux-sürüm-x86_64.iso\n        APPEND iso\n```\n\nDaha fazla bilgi için Syslinux makalesine bakın.\n\nSon olarak, syslinux.exe'nin bulunduğu konumda *.bat dosyası oluşturun ve çalıştırın (Windows 7 veya Vista kullanıyorsanız yönetici olarak çalıştırın):\n\n```\nC:\\Kullanıcılar\\kullaniciadi\\Masaüstü\\install.bat\n```\n\n```\n@echo off\nsyslinux.exe -m -a -d /Boot/Settings X:\n```\n\n"
    },
    {
      "title": "etcher kullanarak",
      "level": 3,
      "content": "etcher, analitik takipçiler ve birinci taraf reklamlar barındırır. Daha fazla bilgi için [4], [5] ve [6] raporlarına bakabilirsiniz.\n\n"
    },
    {
      "title": "Universal USB Installer kullanarak",
      "level": 3,
      "content": "- İndirme sayfası zararlı yazılımların indirilmesine sebep olabilecek sahte İndir butonları barındırıyor.\n- Universal USB Installer ISO'yu olduğu gibi yazmadığı için BIOS sistemlerinde önyükleme gerçekleşmez veya hatalı bir şekilde gerçekleşir. Bunun sebebi syslinux ile alakalı bir sürüm uyuşmazlığıdır. Hatayla alakalı daha fazla bilgi için [7] forum başlığına bakın.\n- Arch Linux kurulum kalıbının önyükleyicisi, ISO içeriklerinin ARCH_YYYYXX bölüm etiketinde bulunmasını bekler. Universal USB Installer dosya sistemi etiketini güncellemez veya önyükleyici yapılandırma dosyasını düzenlemez bu yüzden önyükleme yapılamaz.\n\n"
    },
    {
      "title": "UNetbootin kullanarak",
      "level": 3,
      "content": "- UNetbootin ISO dosyasını olduğu gibi yazmaz bu yüzden BIOS ile önyükleme yapacak sistemlerde syslinux sürüm uyuşmazlığı yüzünden kurulum ortamı açılmaz.\n- Arch Linux kurulum kalıbının önyükleyicisi, ISO içeriklerinin ARCH_YYYYXX bölüm etiketinde bulunmasını bekler. UNetbootin dosya sistemi etiketini güncellemez veya önyükleyici yapılandırma dosyasını düzenlemez bu yüzden önyükleme yapılamaz.\n\n"
    },
    {
      "title": "Diskinize ek veri bölümü ekleyin",
      "level": 3,
      "content": "#ISO'yu olduğu gibi kullanma (BIOS ve UEFI için) yöntemini kullanırken, diske ek bir (üçüncü) bölüm eklemenin iki yolu vardır.\n\n1. İstenilen boyutta bir dosya sistemi imajı oluşturup ISO'ya bağlamak (ISO dosyasını USB flaş diske yazdırmadan önce). Örnek üzerinden takip etmek için Install Arch Linux via SSH#Using a single USB flash drive bölümüne bakın.\n1. fdisk ile, ISO 9660'a veya geçersiz GPT iskeletlerine dokunmadan diskin MBR bölümünü düzenleyerek. Bu yöntem geçersiz GPT'deki yedek GPT başlığını yok eder, ama bir önemi yoktur.\n\nDiskteki MBR bölüm tablosunu düzenlemek için şu komutu çalıştırın:\n\n```\n# fdisk -t mbr --wipe never /dev/disk/by-id/usb-Benim_flash_diskim\n```\n\nn komutunu kullanarak yeni bir bölüm oluşturun (eğer diskin kullanılabilir tüm boş alanı kullanması gerekiyorsa ilk ve son sektörlerin değerlerini varsayılan hâlinde bırakın). Eğer başka işletim sistemlerinde de bu diske erişmek istiyorsanız, MBR bölüm tipi ID'sini t komutu ile değiştirin (örneğin 0c \"W95 FAT32 (LBA)\" veya 07 \"HPFS/NTFS/exFAT\"). Değişiklikleri diske yazmak ve çıkmak için w komutunu kullanın.\n\nBölümlendirmenin ardından yeni bölümde bir dosya sistemi oluşturun (/dev/disk/by-id/usb-Benim_flash_diskim-part3).\n\n"
    },
    {
      "title": "Cihaz gözükmüyor (Device does not show up)",
      "level": 3,
      "content": "Eğer /dev/disk/by-label/ARCH_YYYYAA'ın bağlanmamasından dolayı device did not show up after 30 seconds hatası alıyorsanız, Arch'ın bulabilmesi için USB diskinizin ismini ARCH_YYYYMM şeklinde değiştirmeyi deneyin. (e.g. archlinux-2021.02.01-x86_64.iso için ARCH_202102)\n\n"
    },
    {
      "title": "Failed to set up loop devices: No such file or directory",
      "level": 3,
      "content": "losetup: /run/archiso/bootmnt/arch/x86_64/airootfs.sfs: failed to set up loop devices: No such file or directory hatası alıyorsanız USB 2.0 portunu kullanmayı deneyin. Örneğin bazı USB çoklayıcılarında USB 3.0 portları çalışmayabilir.\n\n"
    },
    {
      "title": "Diğer hatalar",
      "level": 3,
      "content": "Başka hatalar alıyorsanız farklı bir USB disk kullanmayı deneyin. Yeni bir disk kullanmanın bazı durumlarda tüm sorunları çözdüğü görülmüştür.\n\n"
    },
    {
      "title": "Ayrıca bakınız",
      "level": 2,
      "content": "- Gentoo:LiveUSB/Guide\n- Fedora:How to create and use Live USB\n- openSUSE wiki - SDB:Live USB stick\n\n"
    }
  ]
}