{
  "title": "USB Installation Media (Español)",
  "url": "https://wiki.archlinux.org/title/USB_Installation_Media_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2018-11-06** \n\nArtículos relacionados\n\n- Optical disc drive (Español)\n- Archiso (Español)\n- Multiboot USB drive (Español)\n\nEsta página aborda varios métodos sobre cómo grabar la instatánea de Arch Linux en una unidad USB (también conocida por «unidad flash», «lápiz USB», «llave USB», etc.) El resultado será un sistema de tipo LiveCD («LiveUSB», si se prefiere) que, debido a la naturaleza de SquashFS, descarta todos los cambios una vez que se apaga el equipo.\n\nSi desea realizar una instalación completa de Arch Linux desde una unidad USB (es decir, con valores persistentes), véase Installing Arch Linux on a USB key (Español). Si desea usar la memoria USB arrancable de Arch Linux como un USB de rescate, consulte chroot (Español).\n\n"
    },
    {
      "title": "En GNU/Linux",
      "level": 4,
      "content": "Note: **x** \n\nNote: **no** \n\nEjecute la siguiente orden, reemplazando /dev/sdx con su unidad, por ejemplo. /dev/sdb. No agregue un número de partición, así que no use algo como /dev/sdb1.\n\n```\n# dd bs=4M if=/path/to/archlinux.iso of=/dev/sdx status=progress oflag=sync\n```\n\nConsulte dd(1) para obtener más información sobre dd. Consulte dd(1) § DESCRIPTION para obtener más información sobre oflag=sync.\n\n"
    },
    {
      "title": "En Windows",
      "level": 4,
      "content": "Rufus es una grabadora de ISO en USB para diferentes propósitos. Basta con seleccionar el archivo ISO de Arch Linux, la unidad USB en la que desea grabar la imagen de Arch Linux arrancable y hacer clic en START.\n\nComo a Rufus no le importa si la unidad está formateada correctamente o no y proporciona una interfaz gráfica, puede ser la herramienta más fácil y robusta de usar.\n\nNote: **DD Image mode** \n\n- Para la versión Rufus ≥ 3.0, seleccione GPT en el menú desplegable Partition scheme. Después de hacer clic en START aparecerá el cuadro de diálogo de selección de modo, seleccione DD Image mode.\n- Para la versión Rufus <3.0, seleccione el modo DD Image del menú desplegable en la parte inferior.\n\nEste método no requiere ninguna instrucción y es tan sencillo como realizar dd en Linux. Simplemente descargue la ISO de Arch Linux y, con los derechos de administrador local, use la herramienta USBwriter para grabarla en la memoria flash USB.\n\nwin32diskimager es otra herramienta gráfica de grabación de ISO en USB para Windows. Simplemente seleccione la imagen ISO y la letra de la unidad USB de destino (es posible que tenga que formatearla primero para asignarle una letra de unidad) y haga clic en «Write».\n\nAsegúrese de que la instalación de Cygwin contiene el paquete dd.\n\nColoque el archivo de imagen en su directorio personal, por ejemplo:\n\n```\nC:\\cygwin\\home\\nombre_de_usuario\\\n```\n\nEjecute cygwin como administrador (necesario para que cygwin pueda acceder al hardware). Para grabar en el disco USB utilice la siguiente orden:\n\n```\ndd if=image.iso of=\\\\.\\x: bs=4M\n```\n\ndonde image.iso es la ruta al archivo de imagen ISO en el directorio cygwin y \\\\.\\[x]: es el dispositivo USB donde x es la letra designada por windows, que en el ejemplo seguido es: \\\\.\\d:.\n\nEn cygwin 6.0 busque la salida de la partición correcta con:\n\n```\ncat /proc/partitions\n```\n\ny escriba la imagen ISO con la información obtenida de la salida.\n\nEjemplo:\n\n```\ndd if=image.iso of=/dev/sdb bs=4M\n```\n\nUna versión dd con licencia GPL para Windows está disponible en http://www.chrysocome.net/dd. La ventaja de este sobre Cygwin es que la descarga es más pequeña. Úselo como se indica para las instrucciones de Cygwin mencionadas más arriba.\n\nPara comenzar, descargue la última versión de dd para Windows. Una vez descargado, extraiga el contenido del archivo en la carpeta Descargas o en otra carpeta.\n\nAhora, inicie un prompt de órdenes como administrador. A continuación, muevase al directorio (con la orden cd) de Descargas (o a la carpeta donde haya extraido el paquete).\n\nSi la ISO de Arch Linux está en otra carpeta, distinta de la de Descargas, es posible que deba indicar la ruta completa; por tanto, por comodidad es posible que desee poner la ISO de Arch Linux en la misma carpeta que el ejecutable dd. El formato básico de la orden se verá así:\n\n```\n# dd if=archlinux-2017-XX-YY-x86_64.iso od=\\\\.\\x: bs=4M\n```\n\nBasta con reemplazar los distintos puntos vacíos (indicados con una «x») con la fecha correcta y la letra de unidad correcta. He aquí un ejemplo completo.\n\n```\n# dd if=ISOs\\archlinux-2017.04.01-x86_64.iso od=\\\\.\\d: bs=4M\n```\n\nNote: Puede averiguar el número de unidad física escribiendo wmic diskdrive list brief en el términal o con dd --list\n\n```\n# dd if=ISOs\\archlinux-2017.04.01-x86_64.iso of=\\\\.\\PhysicalDrive1 bs=4M\n```\n\nPuede averiguar el número de unidad física escribiendo wmic diskdrive list brief en el términal o con dd --list\n\n"
    },
    {
      "title": "En macOS",
      "level": 4,
      "content": "Primero, necesita identificar el dispositivo USB. Abra /Applications/Utilities/Terminal y enumere todos los dispositivos de almacenamiento con la orden:\n\n```\n$ diskutil list\n```\n\nSu dispositivo USB aparecerá como algo así como /dev/disk2 (external, physical). Verifique que este sea el dispositivo que desea borrar comprobando su nombre y tamaño, y luego use su identificador para las órdenes a continuación en lugar de /dev/diskX.\n\nUn dispositivo USB normalmente se monta automáticamente en macOS, y se debe desmontar (no expulsarlo) antes de grabarlo en bloque con dd. En el Terminal, escriba:\n\n```\n$ diskutil unmountDisk /dev/diskX\n```\n\nAhora copie el archivo de imagen ISO en el dispositivo. La orden dd es similar a su contraparte de Linux, pero observe la 'r' antes del 'disk' para el modo raw, lo que hace que la transferencia sea mucho más rápida:\n\n```\n# dd if=path/to/arch.iso of=/dev/rdiskX bs=1m\n```\n\nTenga en cuenta que diskX aquí no debe incluir el sufijo s1, de lo contrario, el dispositivo USB solo podrá iniciarse en modo UEFI y no «legacy». Una vez completado, macOS puede quejarse de que «The disk you inserted was not readable by this computer» («el disco que insertó no se puede leer en este equipo»). Seleccione 'Ignorar'. El dispositivo USB será de arranque.\n\n"
    },
    {
      "title": "En GNU/Linux",
      "level": 4,
      "content": "Este método es un poco más complicado que grabar la imagen directamente con dd, pero, en cambio, mantiene la unidad utilizable para el almacenamiento de datos (that is, the ISO is installed in a specific partition within the already partitioned device without altering other partitions).\n\nNote: **Xn** \n\n- Asegúrese de que tiene el paquete más reciente de syslinux instalado en el sistema.\n\n- Si aún no ha terminado, cree la tabla de partición y / o la partición en el dispositivo antes de continuar. La partición /dev/sdXn debe estar formateada en FAT32.\n\n- Monte la imagen ISO, monte el sistema de archivos FAT32 ubicado en el dispositivo USB y copie en él el contenido de la imagen ISO. Luego desmonte la imagen ISO, pero mantenga la partición FAT32 montada (esto se usará en los pasos posteriores). Por ejemplo:\n\n```\n# mkdir -p /mnt/{iso,usb}\n# mount -o loop archlinux-2017.04.01-x86_64.iso /mnt/iso\n# mount /dev/sdXn /mnt/usb\n# cp -a /mnt/iso/* /mnt/usb\n# sync\n# umount /mnt/iso\n```\n\nPara arrancar es necesario o bien una etiqueta o bien un UUID para seleccionar la partición desde la que arrancar. Por defecto, se utiliza la etiqueta ARCH_2017XX con el mes de publicación adecuado). Por lo tanto, la etiqueta de la partición debe establecerse a drede, por ejemplo, utilizando \"gparted\". Alternativamente, puede cambiar este comportamiento modificando las líneas que terminan con archisolabel=ARCH_2017XX en el archivo /mnt/usb/arch/boot/syslinux/archiso_sys.cfg (para el arranque BIOS), y en /mnt/usb/loader/entries/archiso-x86_64.conf (para el arranque UEFI). Para usar un UUID en su lugar, reemplace esas fragmentos de líneas con archisodevice=/dev/disk/by-uuid/YOUR-UUID. El UUID se puede obtener con blkid -o value -s UUID /dev/sdXn.\n\nSyslinux ya está preinstalado en /mnt/usb/arch/boot/syslinux. Instálelo completamente en esa carpeta siguiendo Syslinux#Manually. Las instrucciones se reproducen aquí para mayor comodidad.\n\n- Sobrescriba los módulos Syslinux existentes (archivos .c32) presentes en el USB (desde la ISO) con los del paquete syslinux (que se encuentran en /usr/lib/syslinux/bios/). Esto es necesario para evitar un error de arranque debido a una posible discrepancia de versiones.\n\n```\n# cp /usr/lib/syslinux/bios/*.c32 /mnt/usb/arch/boot/syslinux/\n```\n\n- Ejecute:\n\n```\n# extlinux --install /mnt/usb/arch/boot/syslinux\n```\n\n- Desmonte la partición (umount /mnt/usb).\n- Marque la partición como activa (o «boteable»).\n\n"
    },
    {
      "title": "En Windows",
      "level": 4,
      "content": "Note: **Bootable USB Creator utility** \n\n- No utilice cualquier Bootable USB Creator utility para crear el USB de arranque UEFI. Para el formateo manual, no utilice dd para Windows para transferir la ISO a la unidad USB.\n- En las siguientes órdenes X se supone que es la unidad USB en Windows.\n- Windows usa la barra diagonal invertida \\ como separación de la ruta, por lo que la misma se utiliza en las órdenes de abajo.\n- Todas las órdenes se deben ejecutar en el prompt de órdenes de Windows como administrador.\n- > indica el prompt de órdenes de Windows.\n\n- Particione y formatee la unidad USB utilizando Rufus USB partitioner. Seleccione la opción del esquema de particionado como MBR for BIOS and UEFI y el sistema de archivos como FAT32. Desmarque las opciones «Create a bootable disk using ISO image» y «Create extended label and icon files».\n\n- Cambie Volume Label de la unidad USB X: para hacerla coincidir con el LABEL mencionado en archisolabel= parte de <ISO>\\loader\\entries\\archiso-x86_64.conf. Este paso es necesario para la ISO Oficial (Archiso (Español)). Este paso también se puede realizar utilizando Rufus, durante el paso anterior de «partición y formateo».\n\n- Extraiga la ISO (de modo similar a como se extrae un archivo ZIP) en la unidad USB (utilizando 7-Zip).\n\n- Descargue los binarios oficiales (archivo zip) mas recientes de syslinux 6.xx desde https://www.kernel.org/pub/linux/utils/boot/syslinux/ y extráigalos. La versión de Syslinux debe ser la misma que la versión utilizada en la imagen ISO.\n\n- Ejecute las siguientes órdenes (en el prompt de órdenes de Windows, como administrador):\n\n```\n> cd bios\\\n> for /r %Y in (*.c32) do copy \"%Y\" \"X:\\arch\\boot\\syslinux\\\" /y\n> copy mbr\\*.bin X:\\arch\\boot\\syslinux\\ /y\n```\n\n- Instale Syslinux en el USB para poder ejecutarlo (utilice win64/syslinux64.exe en Windows x64):\n\n```\n> cd bios\\\n> win32/syslinux.exe -d /boot/syslinux -i -a -m X:\n```\n\n- El paso anterior instala ldlinux.sys de Syslinux en el VBR de la partición USB, establece la partición como activa/arrancable en la tabla de particiones MBR, y escribe el código de arranque del MBR en los primeros 400 bytes, la región del código de arranque del USB.\n- El parámetro -d convierte la ruta esperada a la ruta con la barra invertida de separación como en los sistemas *unix.\n\n"
    },
    {
      "title": "Utilizar una unidad USB multiarranque",
      "level": 4,
      "content": "Esto permite arrancar múltiples ISO desde un solo dispositivo USB, incluido archiso. Actualizar una unidad USB existente con una ISO más reciente es más simple que con la mayoría de los otros métodos. Consulte Multiboot USB drive (Español).\n\n"
    },
    {
      "title": "Utilizar la utilidad de GNOME «Disk Utility»",
      "level": 4,
      "content": "Las distribuciones de Linux que ejecutan GNOME pueden crear fácilmente un CD live a través de nautilus y gnome-disk-utility. Basta con hacer clic con el botón secundario del ratón sobre el archivo .iso, y seleccionar Abrir con Disk Image Writer. Cuando se abra la utilidad de disco de GNOME, especifique la unidad USB en Destino del menú desplegable y haga clic en Iniciar restauración.\n\n"
    },
    {
      "title": "Fabricar una unidad USB-ZIP",
      "level": 4,
      "content": "Para algunos sistemas BIOS antiguos, solo se admite el arranque desde unidades USB-ZIP. Este método le permite arrancar desde una unidad de disco duro USB.\n\n- Descargue syslinux y mtools de los repositorios oficiales.\n- Encuentra la unidad USB con lsblk.\n- Escriba mkdiskimage -4 /dev/sdx 0 64 32 (reemplaza x con la letra de su disco). Esto llevará un rato.\n\nDesde aquí continúe con el método de formateo manual. La partición será /dev/sdx4 debido a la forma en que funcionan las unidades ZIP.\n\n"
    },
    {
      "title": "Utilizar UNetbootin",
      "level": 4,
      "content": "UNetbootin se puede utilizar en cualquier distribución de Linux o Windows para copiar la ISO en un dispositivo USB. Sin embargo, Unetbootin sobrescribe syslinux.cfg, por lo que crea un dispositivo USB que no arranca correctamente. Por esta razón, Unetbootin no se recomienda — en su lugar, use dd o uno de los métodos descritos abajo —.\n\nEdite syslinux.cfg:\n\n```\nsysconfig.cfg\n```\n\n```\ndefault menu.c32\nprompt 0\nmenu title Archlinux Installer\ntimeout 100\n\nlabel unetbootindefault\nmenu label Archlinux_x86_64\nkernel /arch/boot/x86_64/vmlinuz\nappend initrd=/arch/boot/x86_64/archiso.img archisodevice=/dev/sdx1 ../../\n```\n\nEn /dev/sdx1 debe sustituir x con la primera letra libre después de la última letra en uso en el sistema en el que va a instalar Arch Linux (por ejemplo, si tiene dos unidades de disco duro, utilice c). Puede hacer este cambio durante la primera fase del arranque pulsando Tab cuando se muestra el menú.\n\n"
    },
    {
      "title": "El método Flashnul",
      "level": 4,
      "content": "flashnul es una utilidad para comprobar la funcionalidad y el mantenimiento de memorias flash (USB-Flash, IDE-Flash, SecureDigital, MMC, MemoryStick, SmartMedia, XD, CompactFlash, etc.).\n\nDesde un intérprete de órdenes, invoque flashnul con el parámetro -p, y determine qué dispositivo indica como unidad USB. Por ejemplo:\n\n```\nC:\\>flashnul -p\n```\n\n```\nAvaible physical drives:\nAvaible logical disks:\nC:\\\nD:\\\nE:\\\n```\n\nEn este caso, la unidad USB es E:\n\nUna vez que haya determinado qué dispositivo es el correcto, puede grabar la imagen en la unidad, invocando la orden flashnul, con la letra del dispositivo, el parámetro -L, y la ruta a la imagen. En este caso, sería:\n\n```\nC:\\>flashnul E: -L ruta\\a\\arch.iso\n```\n\nSi está realmente seguro de que desea grabar los datos, escriba «yes», y luego espere un poco para que pueda grabar. Si se obtiene un error de «access denied error», cierre todas las ventanas que tenga abiertas con «Explorer».\n\nSi está en Vista o Win7, debe abrir la consola como administrador, o de lo contrario flashnul fallará al abrir la memoria usb como si fuese un dispositivo de bloque y solo será capaz de grabarlo a través del manejo de la unidad proporcionada por Windows.\n\n"
    },
    {
      "title": "Cargar el soporte de instalación desde la RAM",
      "level": 4,
      "content": "Este método utiliza Syslinux (Español) y un Ramdisk (MEMDISK) para cargar toda la imagen ISO de Arch Linux ISO en la memoria RAM. Dado que esto se ejecuta por completo desde la memoria del sistema, tendrá que asegurarse de que dicha memoria del sistema cuenta con una cantidad adecuada. Una cantidad mínima de RAM entre 500 MB y 1 GB debería ser suficiente para instalar Arch Linux desde un MEMDISK.\n\nPara obtener más información sobre los requisitos del sistema de Arch Linux, así como los de MEMDISK véase la Installation guide (Español) y esto. Para referencia, aquí está el hilo anterior del foro.\n\nFormatee la memoria USB con FAT32 y cree las siguientes carpetas en la unidad recien formateada:\n\n- Boot Boot/ISOs Boot/Settings\n\n- Boot/ISOs\n- Boot/Settings\n\nCopie la imagen ISO que desea arrancar a la carpeta Boot/ISOs, y extraiga los archivos la última liberación de syslinux desde aquí y cópielos en las siguientes carpetas:\n\n- ./win32/syslinux.exe podría ubicarse en el «Escritorio» o en la carpeta «Descargas» de su equipo.\n\n- ./memdisk/memdisk iría a la carpeta Settings de la unidad USB.\n\nDespués de copiar los archivos necesarios, navegue por la unidad USB a /boot/Settings y cree un archivo syslinux.cfg.\n\n```\n/Boot/Settings/syslinux.cfg\n```\n\n```\nDEFAULT arch_iso\n\nLABEL arch_iso\n        MENU LABEL Arch Setup\n        LINUX memdisk\n        INITRD /Boot/ISOs/archlinux-2017.04.01-x86_64.iso\n        APPEND iso\n```\n\nPara más información sobre Syslinux véase el artículo de Arch Wiki.\n\nPor último, cree un archivo *.bat en la carpeta donde esté ubicado syslinux.exe y ejecútelo («ejecute como administrador» si está en Vista o Windows 7):\n\n```\nC:\\Documents and Settings\\username\\Desktop\\install.bat\n```\n\n```\n@echo off\nsyslinux.exe -m -a -d /Boot/Settings X:\n```\n\n"
    },
    {
      "title": "Solución de problemas",
      "level": 2,
      "content": "- Si aparece el error «device did not show up after 30 seconds» debido a que /dev/disk/by-label/ARCH_XXXXYY no se monta, intente cambiar el nombre de su dispositivo USB a ARCH_XXXXYY (por ejemplo, ARCH_201501).\n- Si obtiene errores, intente usar otro dispositivo USB. Hay escenarios donde se resolvieron los problemas así.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Wiki de Gentoo — LiveUSB/HOWTO\n- Fedora wiki — Cómo crear y usar un USB Live\n- Wiki de openSUSE — SDB:Live USB stick\n\n"
    }
  ]
}