{
  "title": "USB flash installation medium (Русский)",
  "url": "https://wiki.archlinux.org/title/USB_flash_installation_medium_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Optical disc drive#Burning\n- Archiso (Русский)\n- Multiboot USB drive\n\nНа этой странице описаны различные способы создания загрузочной флешки с Arch Linux как для загрузки в системах с BIOS, так и с UEFI. Результатом будет система LiveUSB (подобная LiveCD), которую можно будет использовать для установки Arch Linux, обслуживания системы или в целях восстановления. Обратите внимание, что после выключения все изменения на носителе будут отмены из-за особенностей SquashFS.\n\nЕсли вам нужно запускать Arch Linux с USB-накопителя с сохранением изменений, посмотрите статью Installing Arch Linux on a USB key. Если вы хотите использовать загрузочный USB-носитель Arch Linux в целях восстановления, посмотрите статью Cмена суперпользователя.\n\n"
    },
    {
      "title": "В GNU/Linux",
      "level": 4,
      "content": "Note: **sdx** \n\nNote: **не** \n\nВыполните следующую команду, заменив /dev/sdx на ваше устройство, например, на /dev/sdb. (Не добавляйте номер раздела, т.е. не используйте что-то вроде /dev/sdb1)\n\n```\n# dd bs=4M if=путь/до/archlinux.iso of=/dev/sdx status=progress oflag=sync\n```\n\nДля получения дополнительной информации о dd, а также о oflag=sync смотрите соответственно dd(1) и dd(1) § DESCRIPTION.\n\n"
    },
    {
      "title": "В Windows",
      "level": 4,
      "content": "Rufus - универсальная утилита для записи ISO на USB-накопители. Просто выберите образ Arch Linux, USB-накопитель, который вы хотите сделать загрузочным, и нажмите СТАРТ.\n\nПоскольку Rufus не проверяет правильно ли отформатировано устройство и предоставляет GUI, его можно посчитать самым простым и надежным инструментом для использования.\n\nNote: **режиме DD-образ** \n\n- Для версий Rufus ≥ 3.0 выберите GPT в Схема раздела. После нажатия СТАРТ вы получите диалоговое окно для выбора режима, выберите Записать в режиме DD-образ.\n- Для версий Rufus < 3.0 выберите режим DD-образ из выпадающего меню напротив пункта \"Создать загрузочный диск\".\n\nЭтот способ не требует каких-либо обходных решений и прост как dd в Linux. Вам нужно только скачать образ Arch Linux и использовать утилиту USBwriter с локальными правами администратора для записи USB флешки.\n\nwin32diskimager - инструмент для записи iso на USB с GUI для Windows. Просто выберите ваш iso образ и букву USB-носителя (вам может потребоваться сначала отформатировать его для назначения буквы), потом нажмите Write.\n\nУбедитесь, что установка Cygwin содержит пакет dd.\n\nПоложите образ в ваш домашний каталог:\n\n```\nC:\\cygwin\\home\\John\\\n```\n\nЗапустите cygwin от администратора (это необходимо cygwin'y для доступа к железу). Для записи на USB-носитель выполните следующую команду:\n\n```\ndd if=образ.iso of=\\\\.\\x: bs=4M\n```\n\nгде образ.iso - путь до образа iso без директории cygwin, а \\\\.\\x: - ваша флешка, где x это буква, присвоенная устройству windows, например, \\\\.\\d:.\n\nВ Cygwin 6.0 узнайте имя устройства с помощью:\n\n```\ncat /proc/partitions\n```\n\nи запишите образ ISO, согласно выходной информации предыдущей команды. Например:\n\n```\ndd if=образ.iso of=/dev/sdb bs=4M\n```\n\nGPL версия утилиты dd для Windows доступна на сайте http://www.chrysocome.net/dd. Преимуществом над Cygwin является меньший размер. Используйте ее, как показано в инструкциях для Cygwin выше.\n\nДля начала скачайте последнюю версию dd для Windows. После загрузки распакуйте содержимое архива в каталог Загрузки или в другое место.\n\nТеперь запустите командную строку от администратора. Далее смените директорию с помощью (cd) на Загрузки.\n\nЕсли ISO Arch Linux в другом месте, укажите полный путь до него. Для удобства вы можете поместить образ Arch Linux в ту же папку, что и исполняемый файл dd. Основной формат команды будет выглядеть следующим образом.\n\n```\n# dd if=archlinux-версия-x86_64.iso od=\\\\.\\x: bs=4M\n```\n\nЗамените все пустые места (обозначенные \"x\") правильной датой и правильной буквой диска. Вот полный пример.\n\n```\n# dd if=ISOs\\archlinux-версия-x86_64.iso od=\\\\.\\d: bs=4M\n```\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nNote: Вы можете узнать физический номер вводом wmic diskdrive list brief в комадную строку или с dd --list.\n\n```\n# dd if=ISOs\\archlinux-версия-x86_64.iso of=\\\\.\\PhysicalDrive1 bs=4M\n```\n\nВы можете узнать физический номер вводом wmic diskdrive list brief в комадную строку или с dd --list.\n\n"
    },
    {
      "title": "В macOS",
      "level": 4,
      "content": "Сначала, вам нужно идентифицировать USB-устройство. Откройте /Applications/Utilities/Terminal и перечислите все устройства хранения с помощью команды:\n\n```\n$ diskutil list\n```\n\nВаше USB-устройство появится, как /dev/disk2 (external, physical). Убедитесь, что это устройство, которое вы хотите использовать, проверив его имя и размер, а затем используйте его идентификатор для приведенных ниже команд вместо /dev/diskX.\n\nUSB-устройства обычно автомонтируются в macOS, и вам необходимо отключить его (не извлечь) перед записью через dd. В Терминале выполните:\n\n```\n$ diskutil unmountDisk /dev/diskX\n```\n\nТеперь скопируйте ISO образ на устройство. Команда dd похожа на версию dd в Linux, но заметьте, что 'r' перед 'disk' обозначает режим raw, который делает процесс намного быстрее:\n\n```\n# dd if=путь/до/arch.iso of=/dev/rdiskX bs=1m\n```\n\nОбратите внимание, что в diskX здесь не включается суффикс s1, иначе USB-носитель будет загружаться только в режиме UEFI, а не в legacy. После завершения macOS может жаловаться, что \"The disk you inserted was not readable by this computer\" (\"Вставленный диск не читается этим компьютером\"). Выберите 'Игнорировать'. Устройство USB будет загрузочным.\n\n"
    },
    {
      "title": "В GNU/Linux",
      "level": 4,
      "content": "Это способ сложнее, чем запись напрямую через dd. Но преимущество этого способа - сохранение возможности хранение прочей информации на флешке (ISO образ устанавливается в определенный раздел уже размеченного устройства без изменения оставшихся).\n\n- Если это еще не сделано, создайте таблицу разделов на /dev/disk/by-id/usb-My_flash_drive.\n\n- Если это еще не сделано, создайте раздел на устройстве. Раздел /dev/disk/by-id/usb-My_flash_drive-partn должен быть отформатирован в FAT32\n\n- Смонтируйте файловую систему FAT32, расположенную на флешке, и извлеките туда содержимое ISO-образа. Например:\n\n```\n# mount /dev/disk/by-id/usb-My_flash_drive-partn /mnt\n# bsdtar -x -f archlinux-version-x86_64.iso -C /mnt\n```\n\nДля загрузки в режиме BIOS требуется указать том, на котором находятся файлы. По умолчанию UUID YYYY-mm-dd-HH-MM-SS-00 (с соответствующей датой и временем выпуска в формате UTC). Замените параметр archisodevice= в /mnt/boot/syslinux/archiso_sys-linux.cfg на постоянный идентификатор устройства для вашего устройства. Например, archisodevice=UUID=YOUR-UUID.\n\nФайлы Syslinux для систем BIOS уже скопированы в /mnt/boot/syslinux/. Размонтируйте файловую систему FAT, установите пакеты syslinux и mtools и выполните следующие команды, чтобы сделать раздел загрузочным:\n\n```\n# umount /mnt\n# syslinux --directory boot/syslinux --install /dev/disk/by-id/usb-My_flash_drive-partn\n# dd bs=440 count=1 conv=notrunc if=/usr/lib/syslinux/bios/mbr.bin of=/dev/disk/by-id/usb-My_flash_drive\n```\n\n- Замените mbr.bin на gptmbr.bin, если /dev/disk/by-id/usb-My_flash_drive имеет таблицу разделов GUID. См. Syslinux (Русский)#Таблица разделов MBR для получения подробной информации.\n- Для таблицы разделов MBR вам нужно будет установить флаг «boot». См. Syslinux (Русский)#Таблица разделов MBR для получения подробной информации.\n\n"
    },
    {
      "title": "В Windows",
      "level": 4,
      "content": "Note: **утилиты для создания загрузочных USB** \n\n- При ручном форматирование не используйте утилиты для создания загрузочных USB для UEFI. Также не используйте dd для Windows, чтобы записать ISO на USB.\n- В командах ниже X: предполагает USB-носитель в Windows.\n- Windows использует обратную косую черту \\ для разделения пути, поэтому она в командах ниже.\n- Все команды следует выполнять в командной строке Windows от администратора.\n- > обозначает командную строку Windows.\n\n- Разметку и форматирование USB-устройства выполните, используя Rufus. Выберите схему разделов MBR для BIOS и UEFI и файловую систему FAT32. Уберите галку с пунктов \"Создать загрузочный диск используя ISO-образ\" и \"Создать расширенную метку и значок устройства\".\n- Измените Метку устройства USB-носителя X: на МЕТКУ archisolabel=, находящейся в <ISO>\\loader\\entries\\archiso-x86_64.conf. Этот шаг необходим для официального ISO (Archiso). Этот шаг также можно было выполнить через Rufus, на предыдущем шаге \"разбиение и форматирование\".\n- Распакуйте ISO (похоже на распаковку архива ZIP) на флешку, используя 7-Zip.\n- Скачайте официальный бинарник Syslinux 6.xx (архив zip) с https://www.kernel.org/pub/linux/utils/boot/syslinux/ и извлеките его. Версия Syslinux желательно должна совпадать с версией в образе ISO.\n\n- Запустите следующие команды (в cmd Windows от администратора):\n\n```\n> cd bios\\\n> for /r %Y in (*.c32) do copy \"%Y\" \"X:\\arch\\boot\\syslinux\\\" /y\n> copy mbr\\*.bin X:\\arch\\boot\\syslinux\\ /y\n```\n\n- Установите Syslinux на USB (используйте win64\\syslinux64.exe для x64 Windows):\n\n```\n> cd bios\\\n> win32\\syslinux.exe -d /arch/boot/syslinux -i -a -m X:\n```\n\n- Приведенный выше шаг устанавливает ldlinux.sys Syslinux'а в VBR раздела USB, устанавливает раздел как \"активный/загрузочный\" в таблице разделов MBR и записывает код загрузки MBR в 1-й 440-байтовый загрузочный код USB.\n- Параметр -d ожидает путь с разделителем пути косой черты, как в *unix системах.\n\n"
    },
    {
      "title": "Через мультизагрузочную флешку",
      "level": 4,
      "content": "Этот способ позволяет запускать несколько ISO с одного USB-носителя, включая archiso. Обновление ISO образа на USB-накопителе здесь делается проще, чем в большинстве других методах. Для получения дополнительной информации смотрите Multiboot USB drive.\n\n"
    },
    {
      "title": "Через GNOME Disk Utility",
      "level": 4,
      "content": "В дистрибутивах Linux с GNOME легко можно сделать liveCD через nautilus и gnome-disk-utility. Просто нажмите правой кнопкой мыши на файл .iso и выберите Open With Disk Image Writer. Когда откроется GNOME Disk Utility, укажите флешку в Destination и нажмите Start Restoring.\n\n"
    },
    {
      "title": "Создание USB-ZIP накопителя",
      "level": 4,
      "content": "Некоторые старые системы с BIOS поддерживают загрузку только с USB-ZIP носителя. Этот способ позволяет вам все еще загружаться с накопителя USB-HDD.\n\n- Скачайте syslinux и mtools с официальных репозиториев.\n- Найдите вашу флешку с помощью lsblk.\n- Введите mkdiskimage -4 /dev/sdx 0 64 32 (заменив x на букву вашего устройства). Это займет некоторое время.\n\nТеперь выполняйте инструкции из раздела ручного форматирования выше. Раздел будет /dev/sdx4 из-за особенностей работы ZIP-дисков.\n\n"
    },
    {
      "title": "Через UNetbootin",
      "level": 4,
      "content": "UNetbootin можно использовать на любом дистрибутиве Linux или Windows для копирования iso на USB. Но он перезаписывает syslinux.cfg, поэтому созданная загрузочная флешка не правильно загружается. Из-за этого Unetbootin не рекомендуется -- пожалуйста используйте dd или один из других описанных здесь способов.\n\nИзмените syslinux.cfg:\n\n```\nsysconfig.cfg\n```\n\n```\ndefault menu.c32\nprompt 0\nmenu title Archlinux Installer\ntimeout 100\n\nlabel unetbootindefault\nmenu label Archlinux_x86_64\nkernel /arch/boot/x86_64/vmlinuz\nappend initrd=/arch/boot/x86_64/archiso.img archisodevice=/dev/sdx1 ../../\n```\n\nВ строке /dev/sdx1 вы должны заменить x на первую свободную букву т.е. на букву, которая следует за последней использованой в системе, на которую устанавливаете Arch Linux (например, если у вас два жестких диска, используйте c.). Вы можете сделать это изменение во время первой фазы загрузки, нажав Tab, когда отображается меню.\n\n"
    },
    {
      "title": "Через Flashnul",
      "level": 4,
      "content": "flashnul - утилита для проверки работоспособности и обслуживания Flash-памяти (USB-Flash, IDE-Flash, SecureDigital, MMC, MemoryStick, SmartMedia, XD, CompactFlash и т.д.).\n\nВ командной строке вызовите flashnul с параметром -p и определите, какой индекс устройства является вашим USB-накопителем, например:\n\n```\nC:\\>flashnul -p\n```\n\n```\nAvaible physical drives:\nAvaible logical disks:\nC:\\\nD:\\\nE:\\\n```\n\nКогда вы определили, какое вам нужно устройство, вы можете записать образ на него, вызвав flashnul с индексом устройства, -L и с путем к образу, например:\n\n```\nC:\\>flashnul E: -L путь\\до\\arch.iso\n```\n\nЕсли вы действительно уверены, что хотите записать данные, введите yes, а затем немного подождите, пока они будут записываться. Если вы получили ошибку \"Отказано в доступе\", закройте все открытые окна Проводника.\n\nЕсли вы используете Vista или Win7, вы должны открыть консоль от имени администратора, иначе flashnul не сможет открыть флешку как блочное устройство и сможет писать только через дескриптор диска.\n\n"
    },
    {
      "title": "Загрузка установочного носителя из ОЗУ",
      "level": 4,
      "content": "Этот способ использует Syslinux и Ramdisk (MEMDISK) для загрузки всего образа Arch Linux в ОЗУ. Поскольку он будет работать полностью из оперативной памяти, вам необходимо убедиться, что система, на которую вы будете его устанавливать, имеет достаточный объем. Минимальное количество ОЗУ - между 500 MB и 1 GB. Этого должно хватить для MEMDISK на основе Arch Linux.\n\nДля получения дополнительной информации о системных требованиях Arch Linux, а также о требованиях для MEMDISK соответственно смотрите Руководство по установке и это. Для справки, вот тема форума об этом.\n\nОтформатируйте USB-носитель в FAT32. Затем создайте следующие папки на нем.\n\n- Boot Boot/ISOs Boot/Settings\n\n- Boot/ISOs\n- Boot/Settings\n\nДалее скопируйте ISO, с которого вы хотите загружаться, в каталог Boot/ISOs. После этого извлеките следующие файлы из последней версии syslinux отсюда и скопируйте их в следующие каталоги.\n\n- ./win32/syslinux.exe на Рабочий стол или в Загрузки вашей системы.\n- ./memdisk/memdisk в каталог Settings на вашей флешки.\n\nПосле копирования необходимых файлов перейдите на USB-накопителе в /boot/Settings и создайте файл syslinux.cfg.\n\n```\n/Boot/Settings/syslinux.cfg\n```\n\n```\nDEFAULT arch_iso\n\nLABEL arch_iso\n        MENU LABEL Arch Setup\n        LINUX memdisk\n        INITRD /Boot/ISOs/archlinux-версия-x86_64.iso\n        APPEND iso\n```\n\nДля получения дополнительной информации о Syslinux смотрите статью Arch Wiki.\n\nНаконец, создайте файл *.bat в месте расположения syslinux.exe и запустите его (\"Запустите от администратора\" если вы используете Vista или Windows 7):\n\n```\nC:\\Documents and Settings\\username\\Desktop\\install.bat\n```\n\n```\n@echo off\nsyslinux.exe -m -a -d /Boot/Settings X:\n```\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "- Если появляется сообщение об ошибке \"устройство не появляется через 30 секунд\" (\"device did not show up after 30 seconds\") из-за того, что /dev/disk/by-label/ARCH_YYYYMM не монтируется, попробуйте переименовать USB-носитель в ARCH_YYYYMM (например, ARCH_201501).\n- Если вы получили ошибки, попробуйте использовать другое USB-устройство. Существуют примеры ситуаций, в которых решаются все проблемы.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Gentoo wiki - LiveUSB/HOWTO\n- Fedora wiki - How to create and use Live USB\n- openSUSE wiki - SDB:Live USB stick\n\n"
    }
  ]
}