{
  "title": "Ventoy (Русский)",
  "url": "https://wiki.archlinux.org/title/Ventoy_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Multiboot USB drive\n\nVentoy — бесплатный инструмент с открытым исходным кодом для создания накопителей, позволяющих выбрать и загрузить любые EFI, IMG, ISO, VHD(x), или WIM файлы, хранящиеся на перезаписываемом разделе диска.\n\nПоддерживается большинство операционных систем (Windows/WinPE/Linux/ChromeOS/Unix/VMware/Xen...), смотрите полный список.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет ventoy-binAUR или пакет ventoyAUR.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Для настройки носителя существует три утилиты:\n\n1. /opt/ventoy/Ventoy2Disk.sh, который является является shell скриптом для запуска с командной строки.\n1. /opt/ventoy/VentoyGUI.x86_64, который является графическим приложением. xauth или похожее приложение необходимо для эскалации до root, если приложение запущено не с правами root.\n1. file:///opt/ventoy/WebUI/index.html открывается с web-браузером.\n\nТе же утилиты могут использоваться для обновления установки Ventoy на накопитель.\n\nVentoy создаёт два раздела на накопителе. Их названия по умолчанию: Ventoy and VTOYEFI. Раздел Ventoy используется для хранения загрузочных образов (iso файли), и другие данные. VTOYEFI используется для бинарных файлов Ventoy.\n\nДля добавления образа, с которого вы можете загрузиться, смонтируйте первый раздел и скопируйте образы.\n\n"
    },
    {
      "title": "Использование без установки",
      "level": 3,
      "content": "Если вы хотите только создать мультизагрузочный накопитель, вы можете только скачать готовый исполнительный файл на странице релизов на GitHub. Вам необходим dosfstools для установки, потому что раздел vfat создан с использованием mkfs.vfat. После верификации sha256sum и распаковки, вы можете отобразить страницу помощи включенного CLI [1], запустив shell скрипт без каких-либо аргументов:\n\n```\n# ./ventoy-VERSION/Ventoy2Disk.sh\n```\n\nПосле этого можно обновить диск до будущих версий, выполнив аналогичную процедуру. Загрузка НОВОЙ ВЕРСИИ, проверка суммы sha256sum, распаковка, запуск\n\n```\n# ./ventoy-NEWER-VERSION/Ventoy2Disk.sh\n```\n\nи следование появляющемуся на экране справочному сообщению.\n\nВ качестве альтернативы оболочке .sh скрипта описанной здесь, GTK (Русский)/qt (Русский)[2], и webUI[3], также включены.\n\n"
    },
    {
      "title": "Какая версия уже установлена?",
      "level": 3,
      "content": "Утилитой Ventoy2Disk.sh, упомянутой ранее, запустите процесс обновления (-u) и не утверждайте его. Утилита сообщит, с какой версии она собирается обновиться, а затем попросит подтверждения.\n\n"
    },
    {
      "title": "Проверка целостности файлов",
      "level": 3,
      "content": "Как описано в исходной документации, встроенная утилита проверки контрольных сумм позволяет проверить целостность файлов на диске.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Документация Ventoy\n- wikipedia\n\n"
    }
  ]
}