{
  "title": "Verificação de idioma",
  "url": "https://wiki.archlinux.org/title/Verifica%C3%A7%C3%A3o_de_idioma",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Esse artigo cobre softwares corretores/verificadores ortográficos e verificadores gramaticais.\n\n"
    },
    {
      "title": "Verificadores ortográficos",
      "level": 2,
      "content": "- GNU Aspell — Verificador ortográfico projetado para eventualmente substituir o ispell, veja também aspell(1) e o documento info.\n\n- Hunspell — Verificador ortográfico e biblioteca e programa de analisador morfológico, veja também hunspell(1).\n\n- Ispell — Programa de verificação ortográfica interativa para o Unix, veja também ispell(1).\n\n"
    },
    {
      "title": "Específico do idioma",
      "level": 3,
      "content": "- Hspell — Verificador ortográfico hebraico\n\n- Voikko — Programa finlandês Verificador ortográfico e gramatical, hifenizador e coleção de dados relacionados a linguística\n\n"
    },
    {
      "title": "Enchant",
      "level": 3,
      "content": "Enchant é uma biblioteca interfaceadora para a verificação ortográfica genérica, desenvolvido como parte do AbiWord, com suporte a todos os verificadores ortográficos acima, com exceção do Ispell.\n\nEnchant está disponível como o pacote enchant. Para seu uso e arquivo de ordem, veja enchant-2(1).\n\nEnchant é usado por vários aplicativos pelas bibliotecas GTK a seguir:\n\n- gspell — API flexível para implementar verificação ortográfica em aplicativos GTK.\n\n- GtkSpell — Fornece realce no estilo de processador de texto e substituição de palavras com erro de escrita em um widget GtkTextView.\n\n"
    },
    {
      "title": "Aplicativos",
      "level": 3,
      "content": "Firefox, Thunderbird, Chromium e LibreOffice podem todos usar dicionários Hunspell instalados no sistema, assim como dicionários/outros verificadores ortográficos instalados por meio de seu próprio sistema de extensão. Veja as seções a seguir:\n\n- Firefox#Spell checking\n- Thunderbird#Spell checking\n- LibreOffice#Spell checking\n\nAbiWord e Gedit usam o Enchant.\n\n"
    },
    {
      "title": "Verificadores gramaticais",
      "level": 2,
      "content": "- LanguageTool — Verificador de idioma de código aberto, escrito em Java.\n\n- Style and Diction — Diction identifica frases prolixas e comumente mal utilizadas. Style analisa as características da superfície de um documento.\n\n"
    },
    {
      "title": "Aplicativos",
      "level": 3,
      "content": "Firefox, Thunderbird, Chromium e LibreOffice todos possuem suporte a verificação gramatical apenas por meio de extensões. Para o LibreOffice, veja LibreOffice#Grammar checking with LanguageTool.\n\nAbiWord possui um verificador gramatical interno, veja AbiWord (Português)#Verificação gramatical.\n\n"
    }
  ]
}