{
  "title": "Via (Русский)",
  "url": "https://wiki.archlinux.org/title/Via_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "The proprietary VIA drivers (xf86-video-via) are not available since 2008 as they are considered unstable and insecure. The unmaintained xf86-video-unichrome driver is not packaged since 2012 either.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "To get the OpenChrome driver, install the xf86-video-openchromeAUR package.\n\nThe xorg.conf driver name is openchrome.\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "To enable any of the following options to fix issues, first create a new file 10-openchrome.conf in /etc/X11/xorg.conf.d/:\n\n```\nSection \"Device\"\n    Identifier \"My Device Name\"\n    Driver \"openchrome\"\nEndSection\n```\n\n"
    },
    {
      "title": "Artifacts",
      "level": 3,
      "content": "If your X Server shows artifacts and fails to redraw some windows, try disabling the EnableAGPDMA option:\n\n```\nOption     \"EnableAGPDMA\"               \"false\"\n```\n\nIf your machine freeze at startup (GDM) or after login (SLiM), try adding the XAA option XaaNoImageWriteRect. Note that this only applies if you are using the XAA acceleration method (configured by the AccelMethod option). Since 0.2.906, the default acceleration method is EXA.\n\n```\nOption \"XaaNoImageWriteRect\"\n```\n\nIf you experience significant CPU usage and low UI framerate, try adding:\n\n```\nOption \"AccelMethod\" \"XAA\"\n```\n\n"
    },
    {
      "title": "Black screen when booting from LiveCD",
      "level": 3,
      "content": "If you experience a black screen when booting from Live-CD, add modprobe.blacklist=viafb on the kernel command line.\n\nAfter installing the system you will need to blacklist the viafb module.\n\n"
    },
    {
      "title": "DPMS problems",
      "level": 3,
      "content": "If you experience problems with DPMS not turning off laptop's backlight, try adding:\n\n```\nOption \"VBEModes\" \"true\"\n```\n\nto the device section of xorg.conf.\n\n"
    },
    {
      "title": "Hangup on exit",
      "level": 3,
      "content": "If your computer crashes when closing X, you may try not using the vesa driver for the kernel console. Just delete the vga-related parameters from the kernel command line.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- OpenChrome-project\n\n"
    }
  ]
}