{
  "title": "Video game platform emulators (Русский)",
  "url": "https://wiki.archlinux.org/title/Video_game_platform_emulators_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Эмулятор – программа, повторяющая функции другой платформы или системы для запуска приложений и игр в окружении, для которого они изначально не создавались.\n\nNote: **незаконными** \n\n"
    },
    {
      "title": "Консоли",
      "level": 2,
      "content": "- Cemu — эмулятор Wii U, использующий Wine.\n\n- Citra — эмулятор Nintendo 3DS.\n\n- DeSmuME — эмулятор Nintendo DS.\n\n- Dolphin — эмулятор GameCube и Wii с широкими возможностями.\n\n- DuckStation — симулятор/эмулятор Sony PlayStation, сфокусированный на игровых возможностях, скорости и долгосрочной поддержке.\n\n- epsxe — эмулятор PlayStation для ПК с архитектурой x86.\n\n- FCEUX — NTSC и PAL 8-битный эмулятор Nintendo/Famicom, являющийся продолжением оригинального эмулятора FCE Ultra. Он точный, совместимый и активно поддерживаемый.\n\n- gngeo — консольный эмулятор NeoGeo.\n\n- higan — мультисистемный эмулятор, фокусирующийся на точности и поддерживаемый SNES, NES, GB, GBC, GBA.\n\n- mednafen — консольный мультисистемный эмулятор.\n\n- Mupen64Plus — высокосовместимый эмулятор Nintendo 64 с системой плагинов.\n\n- Nestopia — очень точный эмулятор NES.\n\n- pSX — эмулятор PlayStation с относительно высокой совместимостью и без системы плагинов.\n\n- PCSXR — эмулятор PlayStation; Форк Debian заброшенного оригинального PCSX.\n\n- PCSX2 — эмулятор PlayStation 2. До сих пор поддерживается и разрабатывается. Требуются файлы BIOS.\n\n- PPSSPP — эмулятор PlayStation Portable.\n\n- RPCS3 — экспериментальный свободный эмулятор и отладчик Sony PlayStation 3.\n\n- Snes9x — портативный, бесплатный (freeware) эмулятор Super Nintendo Entertainment System (SNES).\n\n- Visual Boy Advance — эмулятор Game Boy с поддержкой Game Boy Advance, Game Boy Color и Super Game Boy.\n\n- xemu — оригинальный эмулятор Xbox (форк проекта XQEMU).\n\n- XQEMU — оригинальный эмулятор Xbox.\n\n- Yuzu — экспериментальный свободный эмулятор и отладчик Nintendo Switch.\n\n- ZSNES — высокосовместимый эмулятор Super Nintendo.\n\n"
    },
    {
      "title": "Другое",
      "level": 2,
      "content": "- DOSBox — свободный эмулятор DOS, в основном фокусирующийся на запуске DOS-игр.\n\n- DOSEmu — свободный эмулятор DOS.\n\n- MAME — эмулятор различных аркадных автоматов.\n\n- RetroArch — фронтенд для libretro (библиотеки для эмуляции, использующей модифицированные версии существующих эмуляторов в качестве плагинов).\n\n- ScummVM — виртуальная машина для \"олд скульных\" приключений.\n\n- X Neko Project II — эмулятор PC-9801.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Общий вики-ресурс по эмуляции\n- Список эмуляторов игровых приставок\n\n"
    }
  ]
}