{
  "title": "Video game platform emulators (Español)",
  "url": "https://wiki.archlinux.org/title/Video_game_platform_emulators_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nNote: **2019-03-20** \n\nUn emulador es un programa que sirve para replicar las funciones de otra plataforma o sistema a fin de permitir que las aplicaciones y juegos se ejecuten en entornos para los que no estaban programados.\n\nNote: **ilegales** \n\n"
    },
    {
      "title": "Consolas",
      "level": 2,
      "content": "- Citra — Emulador de Nintendo 3DS.\n\n- DeSmuME — Emulador Nintendo DS.\n\n- Dolphin — Emulador muy capaz de GameCube y Wii.\n\n- epsxe — Emulador para la consola de videojuegos de PlayStation para hardware de PC basado en x86.\n\n- FCEUX — Emulador de Nintendo/Famicom de 8 bit NTSC y PAL que es una evolución del emuldor FCE Ultra original. Es preciso, compatible y mantenido activamente.\n\n- gngeo — Emulador de NeoGeo de línea de órdenes.\n\n- higan — Emulador multisistema centrado en la precisión, compatible con SNES, NES, GB, GBC, GBA.\n\n- mednafen — Emulador multisistema controlado por línea de órdenes.\n\n- Mupen64Plus — Emulador de Nintendo 64 altamente compatible con sistema de complementos.\n\n- Nestopia — Emulador de NES muy preciso.\n\n- pSX — Un emulador de PlayStation no basado en complementos con compatibilidad bastante alta.\n\n- PCSXR — Emulador de PlayStation; Derivado de Debian del PCSX original abandonado\n\n- PCSX2 — Emulador de PlayStation 2. Sigue siendo mantenido y desarrollado. Requiere archivos de BIOS.\n\n- PPSSPP — Emulador de PlayStation Portable.\n\n- RPCS3 — Emulador y depurador experimental de Sony PlayStation 3 de código abierto.\n\n- Snes9x — Emulador portable, freeware de Super Nintendo Entertainment System (SNES).\n\n- Visual Boy Advance — Emulador de Game Boy con soporte para Game Boy Advance, Game Boy Color y Super Game Boy.\n\n- ZSNES — Emulador de Super Nintendo altamente compatible.\n\n"
    },
    {
      "title": "Otros",
      "level": 2,
      "content": "- DOSBox — Emulador de DOS de código abierto que se centra principalmente en ejecutar juegos de DOS.\n\n- DOSEmu — Emulador de DOS de código abierto.\n\n- MAME — Multiple Arcade Machine Emulator.\n\n- RetroArch — Interfaz de libretro (biblioteca de emulación, que utiliza versiones modificadas de emuladores existentes como complementos).\n\n- ScummVM — Máquina virtual para las aventuras de la vieja escuela.\n\n- X Neko Project II — Emulador de PC-9801.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Emulation General wiki\n- Wikipedia:List of video game console emulators\n\n"
    }
  ]
}