{
  "title": "Virt-Manager (Português)",
  "url": "https://wiki.archlinux.org/title/Virt-Manager_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nVirt-Manager é um front-end gráfico de usuário para o Libvirt biblioteca que fornece serviços de gerenciamento de máquinas virtuais. A interface do Virt-manager torna mais fácil para o usuário criar, excluir e manipular máquinas virtuais sem passar pelo terminal.\n\nVirt-manager oferece suporte principalmente a KVM, mas pode funcionar com outros hipervisores como Xen e LXC.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale virt-manager qemu-desktop libvirt edk2-ovmf dnsmasq iptables-nft.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nPara usar a variante padrão do sistema (root) de libvirtd inicie/habilite libvirtd.service.\n\nVocê pode verificar o status do unit para garantir que o serviço esteja em execução.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Para usar como um usuário normal sem root precisamos configurar o KVM, isso também habilitará os componentes de rede libvirt.\n\nDefina a propriedade do soquete do domínio UNIX como libvirt e a permissão do soquete UNIX para leitura e gravação.\n\n```\n/etc/libvirt/libvirtd.conf\n```\n\n```\n...\nunix_sock_group = 'libvirt'\n...\nunix_sock_rw_perms = '0770'\n...\n```\n\nAdicione seu usuário ao grupo de usuários libvirt.\n\nAdicione seu usuário a /etc/libvirt/qemu.conf. Caso contrário, o QEMU fornecerá um erro de permissão negada ao tentar acessar as unidades locais.\n\nProcure por user = \"libvirt-qemu\" ou group = \"libvirt-qemu\", descomente ambas as entradas e altere libvirt-qemu ao seu nome de usuário ou ID. Uma vez editado, deve ficar algo como abaixo.\n\n```\n/etc/libvirt/qemu.conf\n```\n\n```\n# Alguns exemplos de valores válidos são:\n#\n#       user = \"qemu\"   # A user named \"qemu\"\n#       user = \"+0\"     # Super user (uid=0)\n#       user = \"100\"    # A user named \"100\" or a user with uid=100\n#\nuser = \"nome-de-usuário\"\n\n# The group for QEMU processes run by the system instance. It can be\n# specified in a similar way to user.\ngroup = \"nome-de-usuário\"\n```\n\nAo abrir o Virt-Manager, o padrão será a variante do sistema (root) da conexão QEMU.\n\nIsso pode ser alterado para a conexão do usuário acessando: File > Add Connection.\n\nAgora selecione QEMU/KVM User session como Hypervisor e clique em OK. Isso agora se conectará automaticamente à sessão do usuário. Agora você pode desconectar e remover a conexão do sistema, se desejar.\n\n"
    }
  ]
}