{
  "title": "VLC (Español)",
  "url": "https://wiki.archlinux.org/title/VLC_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **Este artículo o sección necesita ser traducido.** Este artículo o sección necesita ser traducido.\n\nEste artículo o sección necesita ser traducido.\n\nNote: **2018-10-22** \n\nDesde la página de inicio del proyecto:\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete vlc.\n\nLas variantes notables son:\n\n- vlc-gitAUR - Rama de desarrollo.\n- vlc-noxAUR - Sin soporte X.\n\n"
    },
    {
      "title": "Idioma",
      "level": 2,
      "content": "VLC no ofrece una opción para cambiar el idioma en su menú Preferencias. Pero puedes usar el prefijo LANGUAGE=. Por ejemplo, modifique la línea /usr/share/applications/vlc.desktop:\n\n```\nExec=/usr/bin/vlc %U\n```\n\na:\n\n```\nExec=LANGUAGE=fr /usr/bin/vlc %U\n```\n\npara cambiar la interfaz VLC al francés.\n\n"
    },
    {
      "title": "Máscaras",
      "level": 2,
      "content": "VLC puede ser \"desollado\" para una apariencia diferente. Puede obtener máscaras en el sitio web skins.\n\nPara instalar una máscara descárguela y muévala a:\n\n```\n~/.local/share/vlc/skins2\n```\n\nAbra VLC, haga clic en Herramientas> Preferencias. Cuando se abra la ventana de preferencias, debería estar en la pestaña \"Interfaz\"\n\nElija el botón de opción \"Usar máscara personalizada\" y seleccione la máscara descargada.\n\nReinicie VLC para que el cambio surta efecto.\n\n"
    },
    {
      "title": "Interfaz Web",
      "level": 2,
      "content": "Ejecute VLC con el parámetro --extraintf=http para usar la interfaz de escritorio y web. El parámetro --http-host especifica la dirección a, que es localhost por defecto. Para establecer una contraseña, use --http-password, de lo contrario VLC no le permitirá iniciar sesión\n\n```\n# vlc --extraintf=http --http-host 0.0.0.0 --http-port 8080 --http-password 'sucontraseñaaquí'\n```\n\nO puede habilitar esta función en la interfaz de usuario si navega a \"Ver> Agregar interfaz> Interfaz web\".\n\nEl puerto por defecto de VLC es el 8080: http://127.0.0.1:8080\n\nEdite /usr/share/vlc/lua/http/.hosts para permitir conexiones remotas. Deberá reiniciar VLC para que los cambios surtan efecto.\n\n"
    },
    {
      "title": "Twitch.tv transmitiendo a través de VLC",
      "level": 3,
      "content": "Vea Streamlink#Twitch.\n\n"
    },
    {
      "title": "Reproducción de contenido transmitido desde un servidor DLNA local",
      "level": 3,
      "content": "Si descubre que está intentando reproducir contenido uPNP/DLNA (yendo a \"Ver> Lista de reproducción> Red local> Reproducir y conectar universal\"), vlc no ve el servidor DLNA en la red local, luego asegúrese de que el firewall no está bloqueando el puerto 1900 UDP. Es esencial que este puerto esté abierto para reproducir contenido local de uPNP / DLNA.\n\n"
    },
    {
      "title": "Control usando teclas de acceso rápido o cli",
      "level": 3,
      "content": "Instale openbsd-netcat.\n\nObtenga el script en: https://crunchbang.org/forums/viewtopic.php?pid=112035%23p112035#p112035\n\nSiga las instrucciones en el script para configurar un socket para VLC.\n\nEjecute el script desde la línea de comandos o registre el script con atajos de teclado a través de su escritorio.\n\nAlternativamente, puede usar dbus-send como se explica aquí para interactuar con VLC:\n\n```\n$ dbus-send --print-reply --session --dest=org.mpris.MediaPlayer2.vlc /org/mpris/MediaPlayer2 org.mpris.MediaPlayer2.Player.PlayPause\n```\n\n"
    },
    {
      "title": "Previniendo múltiples instancias",
      "level": 3,
      "content": "La configuración predeterminada para VLC es abrir una nueva instancia del programa para cada archivo que se abre. Esto puede ser molesto si está utilizando VLC para algo como reproducir su colección de música. Puede deshabilitar esto en Herramientas> Preferencias> Interfaz> Instancias> Permitir solo una instancia . Opcionalmente, marque \"Encolar archivos cuando se encuentre en modo de instancia\", que mantiene la reproducción del archivo actual y agrega cualquier archivo recién abierto a la lista de reproducción actual.\n\n"
    },
    {
      "title": "Aceleración de vídeo por hardware",
      "level": 3,
      "content": "Véase Hardware video acceleration.\n\nVLC intenta automáticamente usar una API disponible, pero puede anularla yendo a \"Herramientas> Preferencias> Entrada y códecs\" y seleccionando la opción adecuada en \"Decodificación acelerada por hardware\", por ejemplo. API de aceleración de vídeo (VA) para VA-API o Video Decode y API de presentación para Unix (VDPAU) para VDPAU.\n\n"
    },
    {
      "title": "Servicio de systemd",
      "level": 3,
      "content": "La interfaz web de VLC se puede iniciar desde systemd. Primero, necesita crear un usuario predeterminado:\n\n```\n# useradd -c \"VLC daemon\" -d / -G audio -M -p \\! -r -s /usr/bin/nologin -U vlcd\n```\n\nAhora cree el archivo de servicio systemd:\n\n```\n/etc/systemd/system/vlc.service\n```\n\n```\n[Unit]\nDescription=VideoOnLAN Service\nAfter=network.target\n\n[Service]\nType=forking\nUser=vlcd\nExecStart=/usr/bin/vlc --daemon --syslog -I http --http-port 8090 --http-password password\nRestart=on-abort\n\n[Install]\nWantedBy=multi-user.target\n```\n\nInicie y habilite vlc.service. Inicie sesión en http://yourmachine:8090/ sin nombre de usuario y con la contraseña que ingresa en el archivo de servicio.\n\n"
    },
    {
      "title": "Soporte de Chromecast",
      "level": 3,
      "content": "A partir de la versión 3.0 (rama Vetinari), VLC puede transmitir a dispositivos Chromecast en la misma red inalámbrica.\n\nInstale los paquetes:\n\n- libmicrodns - VLC puede encontrar el dispositivo Chromecast y aparece en el menú Reproducción > Procesador\n- protobuf - habilita la transmisión al dispositivo seleccionado en el menú Reproducción > Renderizador\n\n"
    },
    {
      "title": "Vídeo roto u otro problema después de la actualización",
      "level": 3,
      "content": "De vez en cuando, VLC tendrá algunos problemas con la configuración incluso en versiones menores. Antes de realizar informes de errores, elimine o cambie el nombre de su configuración ubicada en ~/.config/vlc y confirme si el problema sigue ahí.\n\nSi utiliza una variante ffmpeg de AUR, asegúrese de que también la haya actualizado. Pacman no lo actualizará cuando sea necesario y una falta de coincidencia interrumpirá VLC.\n\n"
    },
    {
      "title": "Fallo de segmentación",
      "level": 3,
      "content": "Al iniciar VLC, puede obtener un fallo de seguridad y descartar factores generales como microcódigo, una posible solución a esto es ejecutar lo siguiente:\n\n```\n# /usr/lib/vlc/vlc-cache-gen /usr/lib/vlc/plugins\n```\n\nLuego vuelva a instalar VLC.\n\nSi eso no funciona, VLC tiene un problema de segfault con plugins.dat (vea FS#57777), simplemente elimine el archivo:\n\n```\n# rm /usr/lib/vlc/plugins/plugins.dat\n```\n\n"
    },
    {
      "title": "Faltan iconos en los menús desplegables",
      "level": 3,
      "content": "Esto puede suceder bajo XFCE, no habrá más íconos en los menús desplegables, como el ícono de la tarjeta PCI.\n\nEjecute estos comandos para reactivar estos iconos:\n\n```\n$ gconftool-2 --type boolean --set /desktop/gnome/interface/buttons_have_icons true\n$ gconftool-2 --type boolean --set /desktop/gnome/interface/menus_have_icons true\n```\n\n"
    },
    {
      "title": "Error al abrir el backend VDPAU",
      "level": 3,
      "content": "consulte Hardware video acceleration#Failed to open VDPAU backend.\n\nComo su sistema probablemente no admita VDPAU, debería decirle a VLC que use VA-API en su lugar, véase #Aceleración de vídeo por hardware.\n\n"
    },
    {
      "title": "No se reproducen a través de SFTP los nombres de los archivos multimedia que contienen espacios",
      "level": 3,
      "content": "Si VLC no reproduce ningún vídeo o archivo de audio a través de SFTP, asegúrese de tener instalado sshfs.\n\nSi se niega a reproducir cualquier archivo multimedia que contenga espacios a través de SFTP y siempre solicita autenticación, cambie la línea Exec en el archivo vlc.desktop a:\n\n```\nExec=/usr/bin/vlc --started-from-file %F\n```\n\nVer [1].\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- Artículo Wikipedia\n- List of applications (Español)/Multimedia (Español)\n- Página inicial VLC\n- playerctl: Una utilidad de línea de comandos y una biblioteca para controlar reproductores multimedia\n- Controlar VLC a través de un navegador\n\n"
    }
  ]
}