{
  "title": "VLC media player (Українська)",
  "url": "https://wiki.archlinux.org/title/VLC_media_player_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From the project home page:\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the vlc package.\n\nNotable variants are:\n\n- vlc-gitAUR - Development branch.\n- vlc-noxAUR - Without X support.\n\n"
    },
    {
      "title": "Language",
      "level": 2,
      "content": "VLC does not offer an option to change language in its Preferences menu. But you can use the LANGUAGE= prefix. For instance, modify the vlc.desktop desktop entry to change:\n\n```\nExec=/usr/bin/vlc %U\n```\n\nto:\n\n```\nExec=env LANGUAGE=fr /usr/bin/vlc %U\n```\n\nto switch VLC interface to French.\n\n"
    },
    {
      "title": "Skins",
      "level": 2,
      "content": "VLC can be \"skinned\" for a different look and feel. You can get skins at the skins website.\n\nTo install a skin download it and move it to ~/.local/share/vlc/skins2/.\n\nOpen up VLC, click Tools > Preferences. When the preferences window opens up you should be in the \"Interface\" tab\n\nChoose the \"Use custom skin\" radio button, and select the downloaded skin.\n\nRestart VLC for the change to take effect.\n\n"
    },
    {
      "title": "Web interface",
      "level": 2,
      "content": "Run VLC with the parameter --extraintf=http to use both the desktop and web interface. The --http-host parameter specifies the address to bind to, which is localhost by default. To set a password, use --http-password, otherwise VLC will not allow you to log in.\n\n```\n$ vlc --extraintf=http --http-host 0.0.0.0 --http-port 8080 --http-password yourpasswordhere\n```\n\nTo enable the web interface from the graphical interface, navigate to View > Add Interface > Web Interface. Set the password via Tools > Preferences > Show settings: All > Interface > Main interfaces > Lua > Lua HTTP > Password.\n\nVLC defaults to port 8080: http://localhost:8080\n\nEdit /usr/share/vlc/lua/http/.hosts to allow remote connections. You will need to restart VLC in order for changes to take effect.\n\n"
    },
    {
      "title": "Twitch.tv streaming over VLC",
      "level": 3,
      "content": "See Streamlink#Twitch.\n\n"
    },
    {
      "title": "Playing streamed content from a local DLNA server",
      "level": 3,
      "content": "If you find that trying to play uPNP/DLNA content (by going to View > Playlist > Local Network > Universal Plug'n'Play), that vlc fails to see the DLNA server on the local network, then make sure that the firewall is not blocking port 1900 UDP. It is essential that this port is open in order to play local uPNP/DLNA content.\n\n"
    },
    {
      "title": "Control using hotkeys or cli",
      "level": 3,
      "content": "Install openbsd-netcat.\n\nGet script at: https://crunchbang.org/forums/viewtopic.php?pid=112035%23p112035#p112035\n\nFollow instructions in script to setup a socket for VLC.\n\nEither run the script from the command line or register the script with keyboard shortcuts through your desktop.\n\nAlternatively, you can use MPRIS to interact with VLC.\n\nIt is also possible to start vlc with an ncurses interface:\n\n```\n$ vlc -I ncurses\n```\n\nsee the documentation for more information\n\n"
    },
    {
      "title": "Preventing multiple instances",
      "level": 3,
      "content": "The default settings for VLC is to open a new instance of the program for each file that is opened. This can be annoying if you are using VLC for something like playing your music collection. You can disable this in Tools > Preferences > Interface > Instances > Allow only one instance. Optionally, tick Enqueue files when in one instance mode which keeps current file playing and adds any newly opened files to the current playlist.\n\n"
    },
    {
      "title": "Hardware video acceleration",
      "level": 3,
      "content": "See Hardware video acceleration.\n\nVLC automatically tries to use an available API, but you can override it by going to Tools > Preferences > Input & Codecs and choosing the suitable option under Hardware-accelerated decoding, e.g. Video Acceleration (VA) API for VA-API or Video Decode and Presentation API for Unix (VDPAU) for VDPAU.\n\n"
    },
    {
      "title": "systemd service",
      "level": 3,
      "content": "VLC's web interface can be started from systemd. First, you need to create a default user:\n\n```\n# useradd -c \"VLC daemon\" -d / -G audio -M -p \\! -r -s /usr/bin/nologin -U vlcd\n```\n\nNow create the systemd service file:\n\n```\n/etc/systemd/system/vlc.service\n```\n\n```\n[Unit]\nDescription=VideoOnLAN Service\nAfter=network.target\n\n[Service]\nType=forking\nUser=vlcd\nExecStart=/usr/bin/vlc --daemon --syslog -I http --http-port 8090 --http-password password\nRestart=on-abort\n\n[Install]\nWantedBy=multi-user.target\n```\n\nStart and enable vlc.service. Log in to http://yourmachine:8090/ with no username and with the password you put in the service file.\n\n"
    },
    {
      "title": "Chromecast support",
      "level": 3,
      "content": "Starting with 3.0 release (Vetinari branch), VLC can stream to Chromecast devices on the same network.\n\nInstall packages:\n\n- libmicrodns - VLC can find the Chromecast device and it shows up in Playback > Renderer menu\n- protobuf - enables streaming to the selected device in Playback > Renderer menu\n\nThen, edit the file /etc/nsswitch.conf and change the hosts line to include mdns_minimal [NOTFOUND=return] before resolve and dns:\n\n```\nhosts: ... mdns_minimal [NOTFOUND=return] resolve [!UNAVAIL=return] dns ...\n```\n\n- If you experience slowdowns in resolving .local hosts try to use mdns4_minimal instead of mdns_minimal.\n- Look towards avahi for more information.\n\n"
    },
    {
      "title": "Pause click plugin",
      "level": 3,
      "content": "Install vlc-pause-click-pluginAUR, which allows you to click on the video inside VLC's window, and it will be paused or resumed. It is a commonly expected behavior.\n\nIt is not activated after installation, you need to manually enable it in settings as described in https://github.com/nurupo/vlc-pause-click-plugin#usage.\n\n"
    },
    {
      "title": "Video broken or other issue after upgrade",
      "level": 3,
      "content": "Now and then VLC will have some issues with configuration even in minor releases. Before making bug reports, remove or rename your configuration located at ~/.config/vlc and confirm whether the issue is still there.\n\nIf using a ffmpeg variant from the AUR, be sure that you have upgraded it as well. Pacman will not upgrade it when necessary and a mismatch will break VLC.\n\n"
    },
    {
      "title": "Fault when initiating VLC",
      "level": 4,
      "content": "When starting VLC you can get a segfault, and ruling out general factors such as Microcode, a possible workaround to this is running the following:\n\n```\n# /usr/lib/vlc/vlc-cache-gen /usr/lib/vlc/plugins\n```\n\nThen reinstall VLC.\n\n"
    },
    {
      "title": "Fault when playing a video",
      "level": 4,
      "content": "If VLC can open and play audio files, but closes when you play a video with a segfault, then Hardware video acceleration was wrongly configured, making VLC unable to refer to graphics devices. It occurs especially when you are using different graphic cards on one computer.\n\n"
    },
    {
      "title": "Missing icons in dropdown menus",
      "level": 3,
      "content": "This can happen under XFCE, there will be no more icons in dropdown menus, like the PCI card icon.\n\nExecute these commands to reactivate these icons:\n\n```\n$ gconftool-2 --type boolean --set /desktop/gnome/interface/buttons_have_icons true\n$ gconftool-2 --type boolean --set /desktop/gnome/interface/menus_have_icons true\n```\n\n"
    },
    {
      "title": "Failed to open VDPAU backend",
      "level": 3,
      "content": "See Hardware video acceleration#Failed to open VDPAU backend.\n\nSince your system probably does not support VDPAU you should tell VLC to use VA-API instead, see #Hardware video acceleration.\n\n"
    },
    {
      "title": "VLC fails to open a second time after closing",
      "level": 3,
      "content": "Manually set VLC to use the VA-API acceleration backend in Settings -> Input/Codecs. VLC seems to select VDPAU by default, which is broken for many people.\n\n"
    },
    {
      "title": "No playback via SFTP of media files names containing spaces",
      "level": 3,
      "content": "If VLC does not play any videos or audio files over SFTP make sure you have sshfs installed.\n\nIf it refuses to play any media files containing spaces via SFTP and always asks for authentication change the Exec line in the vlc.desktop file to:\n\n```\nExec=/usr/bin/vlc --started-from-file %F\n```\n\nSee [1].\n\n"
    },
    {
      "title": "Cannot open DVD",
      "level": 3,
      "content": "To be able to play DVDs via Media > Open Disc, VLC optional dependencies libdvdread and libdvdcss need to be installed.\n\nIf you have both of those and still can't open DVDs, try deleting your ~/.dvdcss folder. This will force a re-download of your CSS keys, which may fix the problem.\n\n"
    },
    {
      "title": "Cannot navigate DVD menus",
      "level": 3,
      "content": "To navigate DVD menus and play episode by episode, VLC optional dependency libdvdnav needs to be installed.\n\n"
    },
    {
      "title": "Media does not load",
      "level": 3,
      "content": "If some RTP, RTSP, DVB-T streams or Blu-rays look like they are endlessly buffering or silently do not load, without giving an error message in the logs (e.g. IPTV from French FAI Free) install aribb24.\n\n"
    },
    {
      "title": "Wayland support",
      "level": 3,
      "content": "vlc-gitAUR builds with Wayland support by default. Set the QT_QPA_PLATFORM=wayland environment variable to enable Wayland. See Wayland#Qt for more info.\n\nNote that although the --enable-wayland build flag is used in the vlc PKGBUILD (which currently uses VLC version 3.0), Xwayland is used anyway, as Wayland support on VLC 3 is broken. Video output in VLC may be cropped or otherwise malformed unless xorg-xwayland is installed.\n\nWith the following command VLC 3 will start using Wayland:\n\n```\n$ env -u DISPLAY vlc\n```\n\nThis works because VLC 3 checks for the environment variable DISPLAY on startup and will use Wayland if it is not set. Globally removing DISPLAY from the environment is not recommended, because some older Applications still rely on this variable.\n\n"
    },
    {
      "title": "Failed to connect to RTSP stream",
      "level": 3,
      "content": "When connection to RTSP stream ends up with the failed to setup rtsp session error, install live-media.\n\n"
    },
    {
      "title": "Random colors when playing streams with Streamlink",
      "level": 3,
      "content": "Install the optional dependency aribb24.\n\n"
    },
    {
      "title": "Unresponsive system when playing HEVC video with AMDGPU",
      "level": 3,
      "content": "When playing a video encoded with HEVC (H265), users may encounter a total system freeze and are unable to do anything or shutdown.\n\nThis can be fixed by changing the settings for Open GL/GLES hardware converter to something other than Automatic (e.g. VDPAU OpenGL surface converter or VA-API OpenGL surface converter for Wayland).\n\nSee https://gitlab.freedesktop.org/drm/amd/-/issues/2113#note_1602599\n\n"
    },
    {
      "title": "Sound disappears briefly after changing playback progress",
      "level": 3,
      "content": "Change Tools > Preferences > Audio > Output module to ALSA audio output.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Wikipedia article\n- List of applications/Multimedia\n- VLC homepage\n- playerctl: A command-line utility and library for controlling media players\n- Control VLC via a browser\n\n"
    }
  ]
}