{
  "title": "Volnoti (Русский)",
  "url": "https://wiki.archlinux.org/title/Volnoti_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Advanced Linux Sound Architecture (Русский)\n- Desktop notifications\n\nVolnoti - это, в соответствии с описанием на странице Github,\n\nVolnoti может быть полезен для проверки изменения уровня громкости, если вы используете легковесный оконный менеджер, такой как Openbox, который обычно не поставляется вместе с демоном сообщений, особенно в комбинации с медиаклавишами ноутбука/клавиатуры.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет volnotiAUR из AUR.\n\n"
    },
    {
      "title": "Запуск Volnoti",
      "level": 3,
      "content": "Для запуска демона выполните команду\n\n```\n$ volnoti\n```\n\nVolnoti будет запущен в фоновом режиме. Для того чтобы Volnoti запускался автоматически при запуске вашего оконного менеджера, добавьте команду в файл автозапуска (например, ~/.config/openbox/autostart, если вы используете Openbox). Проверить запущена ли программа можно командой в терминале\n\n```\n$ volnoti-show 20\n```\n\nВ результате должен отобразиться полупрозрачный квадрат по центру экрана, показывающий уровень громкости 25%. Далее вам следует настроить Volnoti для отображения сообщения, каждый раз как изменится уровень громкости.\n\n"
    },
    {
      "title": "Настройка для Xbindkeys",
      "level": 3,
      "content": "Настройки, приведенные ниже, используют Volnoti, Alsa и Xbindkeys для отображения изменения уровня громкости при нажатии горячих клавиш. Этот пример рассчитан на то, что Xbindkeys уже установлен и настроен как описано на его странице.\n\nОткройте ~./xbindkeysrc в текстовом редакторе и добавьте следующий код перед строкой # End of xbindkeys configuration:\n\n```\n# Увеличить громкость\n\"amixer set Master 5%+ && volnoti-show $(amixer get Master | grep -Po \"[0-9]+(?=%)\" | tail -1)\"\n   XF86AudioRaiseVolume\n\n# Уменьшить громкость\n\"amixer set Master 5%- && volnoti-show $(amixer get Master | grep -Po \"[0-9]+(?=%)\" | tail -1)\"\n   XF86AudioLowerVolume\n\n# Выключить/включить звук\n\"amixer set Master toggle; if amixer get Master | grep -Fq \"[off]\"; then volnoti-show -m; else volnoti-show $(amixer get Master | grep -Po \"[0-9]+(?=%)\" | tail -1); fi\"\n   XF86AudioMute\n```\n\nПервые две команды увеличат или уменьшат уровень громкости, когда будут нажаты соответствующие специальные клавиши, считают новое значение громкости и отправят его как аргумент в volnoti-show. Третья команда выключит/включит звук и отобразит сообщение Volnoti об этом (был ли звук включен или выключен).\n\nТеперь вы можете перезапустить Xbindkeys с помощью команды kill -1 $(pidof xbindkeys) (или перезагрузить ПК, после того как убедитесь, что и Volnoti и Xbindkeys прописаны в файле автозапуска) и проверить ваши настройки.\n\n"
    },
    {
      "title": "Настройки для i3",
      "level": 3,
      "content": "Добавьте следующие 3 строки в ваш файл конфигурации i3 (~/.i3/config или ~/.config/i3/config по умолчанию)\n\n```\nbindsym XF86AudioRaiseVolume exec --no-startup-id \"amixer set Master 2%+ && volnoti-show $(amixer get Master | grep -Po '[0-9]+(?=%)' | head -1)\"\n bindsym XF86AudioLowerVolume exec --no-startup-id \"amixer set Master 2%- && volnoti-show $(amixer get Master | grep -Po '[0-9]+(?=%)' | head -1)\"\n bindsym XF86AudioMute exec --no-startup-id \"amixer set Master toggle && if amixer get Master | grep -Fq '[off]'; then volnoti-show -m; else volnoti-show $(amixer get Master | grep -Po '[0-9]+(?=%)' | head -1); fi\"\n```\n\n"
    }
  ]
}