{
  "title": "Vulkan (Русский)",
  "url": "https://wiki.archlinux.org/title/Vulkan_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Из Википедии:\n\nДополнительная информация доступна на веб-сайте Khronos.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "- Vulkan в настоящее время официально не поддерживается Bumblebee [1], но работает с primus_vk или primus-vk-gitAUR.\n- Драйвер Radeon Vulkan теперь поддерживает PRIME [2].\n\nЧтобы запустить Vulkan-приложение потребуется установить пакет vulkan-icd-loader (и lib32-vulkan-icd-loader, если планируется запускать 32-битные приложения), а также драйвер Vulkan для видеокарты:\n\n- Intel: vulkan-intel (или lib32-vulkan-intel для 32-битных предложений)\n- NVIDIA: nvidia-utils (или lib32-nvidia-utils)\n- AMD: есть три реализации, которые можно установить одновременно: vulkan-radeon (или lib32-vulkan-radeon) — RADV (часть проекта Mesa) amdvlk (или lib32-amdvlk) — AMDVLK Open (поддерживается AMD) vulkan-amdgpu-proAUR (или lib32-vulkan-amdgpu-proAUR) — AMDVLK Closed (поддерживается AMD)\n\n- vulkan-radeon (или lib32-vulkan-radeon) — RADV (часть проекта Mesa)\n- amdvlk (или lib32-amdvlk) — AMDVLK Open (поддерживается AMD)\n- vulkan-amdgpu-proAUR (или lib32-vulkan-amdgpu-proAUR) — AMDVLK Closed (поддерживается AMD)\n\nТакже возможно установить программную реализацию Vulkan, известную, как lavapipe — vulkan-swrast.\n\nДругие драйверы можно установить вручную:\n\n- PowerVR: https://imgtec.com/vulkan[устаревшая ссылка 2024-07-30 ⓘ]\n- Adreno: https://developer.qualcomm.com/software/adreno-gpu-sdk/gpu\n\nДля разработки приложений Vulkan установите vulkan-headers и, опционально, vulkan-validation-layers и vulkan-tools (в этом пакете также содержится утилита vulkaninfo).\n\n"
    },
    {
      "title": "Проверка",
      "level": 2,
      "content": "Чтобы узнать, какие реализации Vulkan в настоящее время установлены в вашей системе, используйте следующую команду::\n\n```\n$ ls /usr/share/vulkan/icd.d/\n```\n\n"
    },
    {
      "title": "Выбор драйвера Vulkan",
      "level": 2,
      "content": "В некоторых случаях устанавливается несколько драйверов Vulkan (например, RADV и AMDVLK). Выбрать необходимый драйвер можно с помощью переменной окружения VK_DRIVER_FILES. Например, запустить Steam с RADV-драйвером возможно следующей командой:\n\n```\n$ VK_DRIVER_FILES=/usr/share/vulkan/icd.d/radeon_icd.i686.json:/usr/share/vulkan/icd.d/radeon_icd.x86_64.json steam\n```\n\nЧтобы избежать сбоев в 32-битных играх, переменной окружения можно задать 32- и 64-битный вариант значения.\n\n"
    },
    {
      "title": "База данных оборудования Vulkan",
      "level": 2,
      "content": "База данных оборудования Vulkan содержит комбинации графических процессоров и драйверов. Предоставление собственной информации возможно с помощью vulkan-caps-viewer-waylandAUR или vulkan-caps-viewer-x11AUR.\n\n"
    },
    {
      "title": "Error - vulkan: No DRI3 support",
      "level": 3,
      "content": "При получении данной ошибки с драйвером Intel graphics может потребоваться принудительный выбор DRI3 и перезапуск Xorg:\n\n```\n/etc/X11/xorg.conf.d/20-intel.conf\n```\n\n```\nSection \"Device\"\n   Identifier  \"Intel Graphics\"\n   Driver      \"intel\"\n   Option      \"DRI\"    \"3\"\nEndSection\n```\n\n"
    },
    {
      "title": "Nvidia - vulkan is not working and can not initialize",
      "level": 3,
      "content": "Проверьте, установлены ли в системе другие драйверы Vulkan, так как они могут предотвратить обнаружение Vulkan-драйвера Nvidia.\n\nВ качестве альтернативы задайте переменной окружения VK_DRIVER_FILES значение /usr/share/vulkan/icd.d/nvidia_icd.json.\n\n"
    },
    {
      "title": "No device for the display GPU found. Are the intel-mesa drivers installed?",
      "level": 3,
      "content": "Попробуйте задать конфигурации intel_icd и primus_vk_wrapper в переменной окружения VK_DRIVER_FILES:\n\n```\nexport VK_DRIVER_FILES=/usr/share/vulkan/icd.d/intel_icd.x86_64.json:/usr/share/vulkan/icd.d/nv_vulkan_wrapper.json\n```\n\n"
    }
  ]
}