{
  "title": "Vulkan (Português)",
  "url": "https://wiki.archlinux.org/title/Vulkan_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "From wikipedia:Vulkan (API):\n\nSaiba mais em Khronos.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "- Vulkan não é oficialmente suportado por Bumblebee [1] mas funciona com primus_vk ou primus-vk-gitAUR.\n- O driver Radeon Vulkan agora suporta PRIME [2].\n\nPara executar um aplicativo Vulkan, você precisará instalar o pacote vulkan-icd-loader (e o lib32-vulkan-icd-loader se você também deseja executar aplicativos de 32 bits), bem como os drivers Vulkan para sua(s) placa(s) gráfica(s):\n\n- Intel: vulkan-intel (ou lib32-vulkan-intel para aplicativos de 32 bits)\n- NVIDIA: nvidia-utils (ou lib32-nvidia-utils)\n- AMD: existem três implementações, que podem ser instaladas simultaneamente: vulkan-radeon (ou lib32-vulkan-radeon) - RADV (parte do projeto mesa) amdvlk (ou lib32-amdvlk) - AMDVLK Open (mantido pela a AMD) vulkan-amdgpu-proAUR (ou lib32-vulkan-amdgpu-proAUR) - AMDVLK Closed (Fechado) (mantido pela a AMD)\n\n- vulkan-radeon (ou lib32-vulkan-radeon) - RADV (parte do projeto mesa)\n- amdvlk (ou lib32-amdvlk) - AMDVLK Open (mantido pela a AMD)\n- vulkan-amdgpu-proAUR (ou lib32-vulkan-amdgpu-proAUR) - AMDVLK Closed (Fechado) (mantido pela a AMD)\n\nVocê também pode instalar o software Vulkan rasterizer conhecido como lavapipe: vulkan-swrast\n\nOutros drivers podem ser instalados manualmente:\n\n- PowerVR: https://developer.imaginationtech.com/vulkan[link inativo 2024-07-30 ⓘ]\n- Adreno: https://developer.qualcomm.com/software/adreno-gpu-sdk/gpu\n\nPara o desenvolvimento de aplicativos Vulkan, instale o pacote vulkan-headers, e opcionalmente o vulkan-validation-layers e o vulkan-tools (você pode encontrar a ferramenta vulkaninfo aqui).\n\n"
    },
    {
      "title": "Verificação",
      "level": 2,
      "content": "Para ver quais implementações Vulkan estão instaladas atualmente em seu sistema, use o seguinte comando:\n\n```\n$ ls /usr/share/vulkan/icd.d/\n```\n\nPara ver quais pacotes fornecem vulkan-driver que estão instalados atualmente:\n\n```\n$ expac -Qs '%n' vulkan-driver\n```\n\nPara garantir que Vulkan está funcionando com seu hardware, instale o pacote vulkan-tools e usar o comando vulkaninfo para obter informações relevantes sobre o seu sistema. Se você obtiver informações sobre sua placa gráfica, saberá que o Vulkan está funcionando.\n\n```\n$ vulkaninfo\n```\n\nVocê pode ver https://linuxconfig.org/install-and-test-vulkan-on-linux Para maiores informações.\n\n"
    },
    {
      "title": "Selecionando driver vulkan",
      "level": 2,
      "content": "Em alguns casos, vários drivers vulkan são instalados (por exemplo, RADV e AMDVLK). Você pode escolher seu driver preferido definindo a variável de ambiente VK_DRIVER_FILES. Executar a steam com o driver radv\n\n```\n$ VK_DRIVER_FILES=/usr/share/vulkan/icd.d/radeon_icd.i686.json:/usr/share/vulkan/icd.d/radeon_icd.x86_64.json steam\n```\n\nPara evitar travamentos com jogos de 32 bits, é possível atribuir a variante de 32 bits e a variante de 64 bits à variável de ambiente.\n\n"
    },
    {
      "title": "Vulkan Hardware Database",
      "level": 2,
      "content": "O Vulkan Hardware Database fornece combinações de GPU/driver relatadas pelo usuário. Fornecer informações próprias é possível usando vulkan-caps-viewer-waylandAUR ou vulkan-caps-viewer-x11AUR. .\n\n"
    },
    {
      "title": "Error - vulkan: No DRI3 support",
      "level": 3,
      "content": "Se você receber a mensagem acima e está usando Intel Graphics, você pode precisar forçar DRI3 e reiniciar o Xorg:\n\n```\n/etc/X11/xorg.conf.d/20-intel.conf\n```\n\n```\nSection \"Device\"\n   Identifier  \"Intel Graphics\"\n   Driver      \"intel\"\n   Option      \"DRI\"    \"3\"\nEndSection\n```\n\n"
    },
    {
      "title": "Nvidia - vulkan não está funcionando e não pode inicializar",
      "level": 3,
      "content": "Verifique se você tem qualquer outro driver vulkan instalado, isso pode impedir que o driver vulkan da Nvidia seja detectado.\n\nAlternativamente, defina a variável de ambiente VK_DRIVER_FILES no /usr/share/vulkan/icd.d/nvidia_icd.json.\n\n"
    },
    {
      "title": "Nenhum dispositivo para a GPU de exibição encontrado. Os drivers intel-mesa estão instalados?",
      "level": 3,
      "content": "Tente listar as configurações intel_icd e primus_vk_wrapper em VK_DRIVER_FILES\n\n```\nexport VK_DRIVER_FILES=/usr/share/vulkan/icd.d/intel_icd.x86_64.json:/usr/share/vulkan/icd.d/nv_vulkan_wrapper.json\n```\n\n"
    }
  ]
}