{
  "title": "Wget (Español)",
  "url": "https://wiki.archlinux.org/title/Wget_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2022-09-03** \n\nGNU Wget es un paquete de software libre para recuperar archivos utilizando HTTP, HTTPS, FTP y FTPS (FTPS desde la versión 1.18). Es una herramienta de línea de órdenes no interactiva, por lo que puede ser llamada fácilmente desde scripts.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete wget. La versión git está presente en AUR por el nombre wget-gitAUR.\n\n"
    },
    {
      "title": "Configuración",
      "level": 2,
      "content": "La configuración se realiza en /etc/wgetrc. No solo el archivo de configuración predeterminado está bien documentado; alterarlo rara vez es necesario. Véase wget(1) § OPTIONS para opciones más intrincadas.\n\n"
    },
    {
      "title": "Automatización FTP",
      "level": 3,
      "content": "Normalmente, SSH se utiliza para transferir archivos de forma segura en una red. Sin embargo, FTP es más ligero en recursos en comparación con scp y rsync sobre SSH. FTP no es seguro, pero cuando se transfieren grandes cantidades de datos dentro de un entorno protegido por un cortafuegos en sistemas vinculados a la CPU, la utilización de FTP puede resultar beneficioso.\n\n```\nwget ftp://root:algunacontraseña@10.13.X.Y//ifs/home/test/big/\"*.tar\"\n\n3,562,035,200 74.4M/s   en 47s\n```\n\nEn este caso, Wget transfirió un archivo de 3.3 GiB a un ratio de 74.4MB/segundo.\n\nEn resumen, este procedimiento es:\n\n- programable (en scripts)\n- más rápido que ssh\n- utilizado fácilmente por lenguajes que pueden sustituir variables de cadena\n- capaz de utilizar comodines (*, ?, etc.)\n\n"
    },
    {
      "title": "Proxy",
      "level": 3,
      "content": "Wget utiliza las variables de entorno proxy estándar. Véase Ajustes del Proxy.\n\nPara utilizar la función de autenticación proxy:\n\n```\n$ wget --proxy-user \"DOMINIO\\USUARIO\" --proxy-password \"CONTRASEÑA\" URL\n```\n\nLos proxies que utilizan formularios de autenticación HTML no están cubiertos.\n\n"
    },
    {
      "title": "Integración con pacman",
      "level": 3,
      "content": "Para que pacman utilice automáticamente Wget y un proxy con autenticación, coloque la orden Wget en /etc/pacman.conf, en la sección [options]:\n\n```\nXferCommand = /usr/bin/wget --proxy-user \"dominio\\usuario\" --proxy-password=\"contraseña\" --passive-ftp -q --show-progress -c -O %o %u\n```\n\n"
    },
    {
      "title": "Utilización",
      "level": 2,
      "content": "Esta sección explica algunos de los escenarios de uso para Wget.\n\n"
    },
    {
      "title": "Utilización básica",
      "level": 3,
      "content": "Uno de los casos de uso más básicos y comunes para Wget es descargar un archivo de Internet.\n\n```\n$ wget <url>\n```\n\nCuando ya conoce la URL de un archivo para descargar, esto puede ser mucho más rápido que la rutina habitual, descargándolo en su navegador y moviéndolo manualmente al directorio correcto. No hace falta decir que, solo con el uso más simple, es probable que pueda ver algunas formas de utilizar esto para algunas descargas automáticas, si así lo desea.\n\n"
    },
    {
      "title": "Archivar un sitio web completo",
      "level": 3,
      "content": "Wget puede archivar un sitio web completo al tiempo que conserva los enlaces de destino correctos cambiando los enlaces absolutos a enlaces relativos.\n\n```\n$ wget -r -np -k 'url-destino-aqui'\n```\n\nEn el caso de un sitio web dinámico, están disponibles algunas opciones adicionales para la conversión a HTML estático.\n\n```\n$ wget -r -np -p -E -k -K 'url-destino-aqui'\n```\n\nwget también ofrece opciones para evitar los mecanismos de prevención de descargas.\n\n```\n$ wget -r -np -k --random-wait -e robots=off --user-agent \"Mozilla/5.0\" 'url-destino-aqui'\n```\n\nY si se va a incluir contenido de terceros en la descarga, se puede utilizar la opción -H junto con -r para la recursividad en los hosts vinculados.\n\n"
    }
  ]
}