{
  "title": "Wget (Polski)",
  "url": "https://wiki.archlinux.org/title/Wget_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "GNU Wget to darmowy pakiet oprogramowania do pobierania plików za pomocą HTTP, HTTPS, FTP i FTPS (FTPS od wersji 1.18). Jest to nieinteraktywne narzędzie wiersza poleceń, więc można je łatwo wywołać ze skryptów.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Zainstaluj pakiet wget. Wersja git występuje w AUR pod nazwą wget-gitAUR.\n\n"
    },
    {
      "title": "Konfiguracja",
      "level": 2,
      "content": "Konfiguracja odbywa się w /etc/wgetrc. Nie tylko domyślny plik konfiguracyjny jest dobrze udokumentowany, jego zmiana jest rzadko konieczna. Zobacz wget(1) § OPTIONS dla bardziej skomplikowanych opcji.\n\n"
    },
    {
      "title": "Automatyzacja FTP",
      "level": 3,
      "content": "Zwykle SSH służy do bezpiecznego przesyłania plików w sieci. Jednak FTP jest lżejszy pod względem zasobów w porównaniu do scp i rsync przez SSH. FTP nie jest bezpieczny, ale podczas przesyłania dużych ilości danych w środowisku chronionym zaporą ogniową w systemach powiązanych z procesorem, korzystanie z FTP może okazać się korzystne.\n\n```\nwget ftp://root:somepassword@10.13.X.Y//ifs/home/test/big/\"*.tar\"\n\n3,562,035,200 74.4M/s   in 47s\n```\n\nW takim przypadku Wget przesłał plik o wielkości 3,3 GiB z szybkością 74,4 MB/sekundę\n\nW skrócie ta procedura to:\n\n- skryptowalny\n- szybciej niż ssh\n- łatwo używane przez języki, które mogą zastępować zmienne łańcuchowe\n- globbing capable\n\n"
    },
    {
      "title": "Proxy",
      "level": 3,
      "content": "Wget używa standardowych zmiennych środowiskowych proxy. Zobacz Proxy settings.\n\nAby skorzystać z funkcji uwierzytelniania proxy:\n\n```\n$ wget --proxy-user \"DOMAIN\\USER\" --proxy-password \"PASSWORD\" URL\n```\n\nSerwery proxy, które używają formularzy uwierzytelniania HTML nie są uwzględnione.\n\n"
    },
    {
      "title": "integracja z pacmanem",
      "level": 3,
      "content": "Aby pacman automatycznie używał Wget i proxy z uwierzytelnianiem, umieść polecenie Wget w /etc/pacman.conf, w sekcji [options]\n\n```\nXferCommand = /usr/bin/wget --proxy-user \"domain\\user\" --proxy-password=\"password\" --passive-ftp --quiet --show-progress --continue --output-document=%o %u\n```\n\n"
    },
    {
      "title": "Używanie",
      "level": 2,
      "content": "Ta sekcja wyjaśnia niektóre scenariusze przypadków użycia dla Wget.\n\n"
    },
    {
      "title": "Podstawowe zastosowanie",
      "level": 3,
      "content": "Jednym z najbardziej podstawowych i najczęstszych przypadków użycia Wgeta jest pobranie pliku z Internetu.\n\n```\n$ wget <url>\n```\n\nKiedy znasz już adres URL pliku do pobrania, może to być znacznie szybsze niż zwykłe pobieranie go w przeglądarce i ręczne przenoszenie do odpowiedniego katalogu. Nie trzeba dodawać, że po najprostszym użyciu prawdopodobnie można zobaczyć kilka sposobów wykorzystania tego do automatycznego pobierania, jeśli tego chcesz.\n\n"
    },
    {
      "title": "Zarchiwizuj całą witrynę",
      "level": 3,
      "content": "Wget może archiwizować całą witrynę internetową, zachowując prawidłowe miejsca docelowe linków, zmieniając linki bezwzględne na linki względne.\n\n```\n$ wget --recursive --no-parent --convert-links 'docelowy-adres-url'\n```\n\nW przypadku strony dynamicznej dostępne są dodatkowe opcje konwersji na statyczny HTML.\n\n```\n$ wget -recursive --no-parent --page-requisites --adjust-extension --convert-links --backup-converted 'docelowy-adres-url'\n```\n\nwget udostępnia również opcje obchodzenia mechanizmów zapobiegających pobieraniu.\n\n```\n$ wget --recursive --no-parent --convert-links --random-wait --execute robots=off --user-agent \"Mozilla/5.0\" 'docelowy-adres-url'\n```\n\nA jeśli zawartość stron trzecich ma być dołączona do pobierania, przełącznik -H/--span-hosts może być użyty wraz z -r/--recursive do rekursji do połączonych hostów.\n\n"
    }
  ]
}