{
  "title": "Window manager (Français)",
  "url": "https://wiki.archlinux.org/title/Window_manager_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Xdg-menu\n- Xorg\n- xinit\n- Start X at Login\n- Wayland#Compositors\n\nUn gestionnaire de fenêtres (abrégé WM pour Window Manager en anlais) est un logiciel qui contrôle le placement et l'apparence des fenêtres dans un système de fenêtrage dans une interface utilisateur graphique (GUI). Il peut faire partie d'un environnement de bureau (abrégé DE pour Desktop Environment en anglais) ou être utilisé de manière autonome.\n\n"
    },
    {
      "title": "Aperçu",
      "level": 2,
      "content": "Les gestionnaires de fenêtres sont des clients X qui contrôlent l'apparence et le comportement des cadres (\"fenêtres\") où sont dessinées les différentes applications graphiques. Ils déterminent la bordure, la barre de titre, la taille et la possibilité de redimensionner les fenêtres, et fournissent souvent d'autres fonctionnalités telles que des zones réservées pour coller des docks comme Window Maker, ou la possibilité de tabuler les fenêtres comme Fluxbox. Certains gestionnaires de fenêtres sont même fournis avec des utilitaires simples comme des menus pour démarrer des programmes ou pour configurer le gestionnaire de fenêtres lui-même.\n\nLa spécification Extended Window Manager Hints est utilisée pour permettre aux gestionnaires de fenêtres d'interagir de manière standard avec le serveur et les autres clients.\n\nCertains gestionnaires de fenêtres sont développés dans le cadre d'un environnement de bureau plus complet, permettant généralement aux autres applications fournies de mieux interagir entre elles, offrant ainsi une expérience plus cohérente à l'utilisateur, avec des fonctionnalités telles que des icônes de bureau, des polices, des barres d'outils, des fonds d'écran ou des widgets de bureau.\n\nD'autres gestionnaires de fenêtres sont conçus pour être utilisés de manière autonome, laissant à l'utilisateur une liberté totale dans le choix des autres applications à utiliser. Cela permet à l'utilisateur de créer un environnement plus léger et personnalisé, adapté à ses propres besoins. Les \"extras\" tels que les icônes de bureau, les barres d'outils, les fonds d'écran ou les widgets de bureau, si nécessaire, devront être ajoutés avec des applications dédiées supplémentaires.\n\nCertains gestionnaires de fenêtres autonomes peuvent également être utilisés pour remplacer le gestionnaire de fenêtres par défaut d'un environnement de bureau, tout comme certains gestionnaires de fenêtres orientés environnement de bureau peuvent également être utilisés de manière autonome.\n\nAvant d'installer un gestionnaire de fenêtres, une installation fonctionnelle du serveur X est nécessaire. Consultez Xorg pour des informations détaillées.\n\n"
    },
    {
      "title": "Types",
      "level": 3,
      "content": "- Les gestionnaires de fenêtres empilables (alias flottantes) fournissent la métaphore traditionnelle du bureau utilisée dans les systèmes d'exploitation commerciaux tels que Windows et macOS. Les fenêtres agissent comme des feuilles de papier sur un bureau, et peuvent être empilées les unes sur les autres. Pour les pages disponibles sur Arch Wiki, consultez Category:Stacking window managers.\n- Les gestionnaires de fenêtres pavant font en sorte que les fenêtres ne se chevauchent pas. Ils font généralement un usage intensif des raccourcis clavier et font moins (ou pas du tout) appel à la souris. Les gestionnaires de fenêtres en mosaïque peuvent être manuels, offrir des dispositions prédéfinies, ou les deux. Pour les pages disponibles sur Arch Wiki, consultez Category:Tiling window managers.\n- Les gestionnaires de fenêtres dynamiques peuvent basculer dynamiquement entre la disposition des fenêtres en mosaïque ou flottantes. Pour les pages Wiki d'Arch disponibles, consultez Category:Dynamic window managers.\n\nConsultez Comparison of tiling window managers et Wikipedia:Comparison of X window managers pour une comparaison des gestionnaires de fenêtres.\n\n"
    },
    {
      "title": "Liste des gestionnaires de fenêtres",
      "level": 2,
      "content": "Consultez Window manager#List of window managers\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Site répertoriant les gestionnaires de fenêtres\n- Hit-parade des gestionnaires de fenêtres\n- Poids en RAM de quelques gestionnaires pour Linux\n\n"
    }
  ]
}