{
  "title": "Windows PE (Русский)",
  "url": "https://wiki.archlinux.org/title/Windows_PE_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Windows PE — это легковесная версия Windows, предназначенная для установки Windows Vista и более поздних версий, а также для обслуживания системы. Она запускается полностью в оперативной памяти и может быть загружена по сети. Эта страница описывает создание настроенного образа Windows PE и, опционально, публикацию его в сети с использованием только свободного программного обеспечения на компьютере с Arch Linux вместе с Microsoft Windows Automated Installation Kit (WAIK). WAIK может быть загружена бесплатно и требуется только для извлечения файла boot.wim, который содержит исходную копию Windows PE вместе с некоторыми загрузочными файлами.\n\n"
    },
    {
      "title": "Варианты использования",
      "level": 2,
      "content": "Обычно, образ Windows PE может быть создан только с использованием Windows Automated Installation Kit (WAIK) на компьютере с Windows. Тем не менее, существует возможность создания и модифицирования образов Windows PE используя компьютер с (Arch) Linux, и, опционально, публикации его в сети для загрузки с помощью PXE. Компьютер с Windows не требуется. Вы можете сделать это если:\n\n- вам необходимо установить Windows по сети или загрузить Windows PE по сети для системного администрирования используя Arch Linux-сервер. Это может быть связано с тем, что у вас нет Windows-сервера, или вы предпочитаете использовать сервер на Linux по причине более высокой безопасности и настраиваемости, или вы уже используете сервер на Linux для других целей.\n- вам необходимо запустить Windows-окружение для запуска программы для Win32, у вас нет доступа к компьютеру с Windows, и вы не желаете использовать Wine или программа работает некорректно с Wine.\n\n"
    },
    {
      "title": "Создание загрузочного образа Windows PE",
      "level": 2,
      "content": "Установите wimlib.\n\n"
    },
    {
      "title": "Настройка образа Windows PE",
      "level": 3,
      "content": "Для загрузки в командную строку создайте стартовый скрипт, который может быть включён в загрузочный образ следующим образом:\n\n```\nstart.cmd\n```\n\n```\ncmd.exe\npause\n```\n\nСкрипт mkwinpeimg поддерживает внесение дальнейших модификаций в Windows PE при использовании опции --overlay. Смотрите страницу руководства для mkwinpeimg чтобы получить больше информации. При желании вы можете добавить Windows-приложения, хоторые хотите запускать в Windows PE или добавить дополнительные драйвера которые необходимы Windows PE (драйвера могут быть загружены при помощи команды drvload в Windows PE).\n\n"
    },
    {
      "title": "Получение Windows ISO или WAIK-образа",
      "level": 3,
      "content": "mkwinpeimg позволяет создать загрузочный Windows PE ISO из нескольких источников. Для начала необходимо получить один из вариантов:\n\n- Вариант А для Windows 7 и более поздних: установочный Windows ISO / образ диска. Он может быть загружен бесплатно на сайте Microsoft: Windows 10 ISO. Это наиболее простой вариант.\n- Вариант Б: образ Windows Automated Installation Kit (WAIK). Вплоть до Windows Vista/7 он может быть получен как самостоятельный дистрибутив WAIK от Microsoft. Начиная с Windows 8 WAIK был переименован в WADK и распространяется через adksetup.exe.\n- Вариант В с уменьшенным дистрибутивом: Hiren's BootCD включает в себя Windows PE, весящий примерно вдвое меньше (~2.8GB) полного образа Windows 10. Это полнофункциональная среда, включающая в себя Internet Explorer, который может быть полезен для поиска справки по командам bcdedit или bootrec для восстановления загрузчика Windows.\n\nРазличные версии установочных образов Windows содержат различные версии Windows PE. Для соотнесения версий Windows и Windows PE обратитесь к Википедии.\n\n"
    },
    {
      "title": "Подготовка загрузочного ISO Windows PE",
      "level": 3,
      "content": "Как только вы получили установочный образ Windows или образ WAIK/WADK, необходимо примонтировать его. Предполагая, что образ называется winimg.iso:\n\n```\n# mkdir /media/winimg\n# mount winimg.iso /media/winimg\n```\n\nИспользуйте скрипт mkwinpeimg, поставляемый с wimlib для создания загрузочного Windows PE ISO winpe.iso, вместе со стартовыми скриптами из предыдущей секции:\n\nВариант А: в качестве источника выступает установочный образ Windows:\n\n```\n$ mkwinpeimg --iso --windows-dir=/media/winimg --start-script=start.cmd winpe.iso\n```\n\nВариант Б: в качестве источника выступает образ WAIK/WADK:\n\n```\n$ mkwinpeimg --iso --waik-dir=/media/winimg --start-script=start.cmd winpe.iso\n```\n\nСмотрите mkwinpeimg(1) для дополнительной информации, включающей опцию --overlay для копирования файлов в образ.\n\nДемонтируйте исходный ISO:\n\n```\n# umount /media/winimg\n```\n\nВариант В: в качестве источника выступает образ Hiren's BootCD:\n\nHiren's BootCD уже является загрузочным и нуждается лишь в записи на USB-накопитель.\n\n```\ndd bs=4M if=./HBCD_PE_x64.iso of=/dev/sdX status=progress && sync\n```\n\nУдостоверьтесь, что USB-накопитель использует таблицу разделов GPT как описано ниже.\n\n"
    },
    {
      "title": "Подготовка загрузочной флешки Windows PE для систем с UEFI",
      "level": 3,
      "content": "К сожалению, в версии 1.13.1-1 wimlib, mkwinpeimg не может создавать загрузочные UEFI-системы. Но мы легко можем создать такую UEFI-систему: установочный ISO Windows 10 уже содержит необходимые загрузочные UEFI-файлы.\n\nНа USB-носителе создайте таблицу разметки GPT, включающую единственный раздел FAT32 с типом \"EFI System\". Это может быть выполнено в интерактивном режиме с cfdisk или через fdisk:\n\n```\n# fdisk /dev/sdX\n(fdisk) g  # Создать новую таблицу разделов GPT\n(fdisk) n  # Создать новый раздел, оставив все параметры по умолчанию\n(fdisk) t  # Сменить тип раздела\n(fdisk) 1  # Тип 1 это \"EFI System Partition\"\n(fdisk) w  # Сохранить и выйти\n```\n\nЗатем отформатируйте раздел в FAT32:\n\n```\n# mkfs.vfat /dev/sdX1\n```\n\nПримонтируйте файл winpe.iso, созданный mkwinpeimg, примонтируйте свой USB-носитель и скопируйте на него данные:\n\n```\n# mkdir /media/{winpe,usb}\n# mount winpe.iso /media/winpe\n# mount /dev/sdX1 /media/usb\n# cp -r /media/winpe/* /media/usb/\n```\n\nНаконец, примонтируйте оригинальный Windows ISO и скопируйте загрузочные файлы в efi:\n\n```\n# mount winimg.iso /media/winimg\n# cp -r /media/winimg/efi /media/usb/\n```\n\nВы можете отмонтировать все ISO и USB-носитель, который теперь готов к загрузке.\n\nЭто правда: нет нужды в магии syslinux или grub. Прошивка UEFI должна обнаружить раздел FAT и загрузить /efi/boot/bootx64.efi, предоставленный Windows для загрузки с USB-носителя.\n\n"
    },
    {
      "title": "Загрузка Windows PE",
      "level": 2,
      "content": "После создания загрузочного ISO Windows PE (winpe.iso), как описано в предыдущей секции, вы можете пожелать загрузить Windows PE следующими способами:\n\n"
    },
    {
      "title": "В виртуальной машине",
      "level": 3,
      "content": "Запустите виртуальную машину с winpe.iso подключённом как CD-ROM. Удостоверьтесь, что выделили достаточно оперативной памяти — определённо больше, чем размер ISO — поскольку Windows PE запускается из оперативной памяти. Смотрите Category:Hypervisors для списка доступного ПО для виртуализации.\n\n"
    },
    {
      "title": "С USB-носителя",
      "level": 3,
      "content": "Если у вас есть подготовленный согласно руководству выше USB-носитель для UEFI-систем, должна просто произойти загрузка. Может потребоваться некоторое время на загрузку (от десяти да двадцати секунд в среднем, в зависимости от вашего USB-носителя) так как загрузчик копирует некоторые/все данные в оперативную память.\n\n"
    },
    {
      "title": "С компакт-диска",
      "level": 3,
      "content": "Просто запишите winpe.iso на CD и вы готовы к загрузке.\n\n"
    },
    {
      "title": "Через сеть",
      "level": 3,
      "content": "Windows PE может быть загружена по сети с использованием PXELINUX и его модуля MEMDISK на BIOS-системах. Для UEFI-систем можно воспользоваться wimboot и iPXE.\n\nУстановите syslinux и tftp-hpa.\n\nСкопируйте необходимые файлы PXELINUX в корневой каталог TFTP-сервера.\n\n```\n# rsync -aq /usr/lib/syslinux/bios/ /var/tftpboot/\n```\n\nПоместите winpe.iso в корневой каталог TFTP-сервера.\n\n```\n# mv winpe.iso /var/tftpboot\n```\n\nСоздайте файл конфигурации для PXELINUX подобный следующему:\n\n```\n/var/tftpboot/pxelinux.cfg/default\n```\n\n```\nUI         menu.c32\nMENU TITLE Network Boot\nTIMEOUT    50\n\nLABEL      winpe\nMENU LABEL Boot Windows PE from network\nKERNEL     /memdisk\nINITRD     winpe.iso\nAPPEND     iso raw\n\nLABEL      localboot\nMENU LABEL Boot from local disk\nLOCALBOOT  0\n```\n\nЗапустите TFTP-сервер.\n\nНастройте ваш DHCP-сервер (такой как Dhcpd или Dnsmasq) так, чтобы он указывал на pxelinux.0 как на загрузочный файл с IP-адресом Linux-сервера. Будьте внимательны: если ваш DHCP-сервер находится на роутере, это может быть невозможным без установки кастомной прошивки.\n\nПосле завершения предыдущих шагов, вы можете загрузить Windows PE по сети.\n\n"
    },
    {
      "title": "Установка Windows через Windows PE",
      "level": 2,
      "content": "После загрузки в Windows PE вы можете установить Windows с установочного носителя.\n\nУстановочным носителем может быть общий сетевой ресурс (Samba). Смотрите Samba для настройки Samba-сервера на другом устройстве в LAN. Для того, чтобы предоставить общий доступ у установочному образу /media/winimg, добавьте следующее определение к /etc/samba/smb.conf:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[REMINST]\nbrowsable = true\nread only = no\nguest ok = yes\npath = /media/winimg\n```\n\nПосле загрузки в окружение командной строки Windows PE запустите следующую команду для инициализации сетевого интерфейса, получения IP Samba-сервера (при условии, что Windows PE загружается через PXE с устройства на котором запущены DHCP, TFTP и Samba-сервер, IP сервера будет соответствовать IP шлюза), монтирования общего ресурса и запуска графического установщика:\n\n```\n> wpeinit\n > ipconfig\n > net use I: \\\\IP.ADDRESS.OF.SAMBA.SERVER\\REMINST\n > I:\\setup.exe\n```\n\n"
    },
    {
      "title": "System error 58 has occurred. The specified server cannot perform the requested operation",
      "level": 3,
      "content": "Если при использовании команды net use вы получили следующую ошибку:\n\n```\nSystem error 58 has occurred.\n\nThe specified server cannot perform the requested operation.\n```\n\n1. Удостоверьтесь, что вы случайно не отмонтировали каталог /media/winimg.\n\n2. Добавьте map to guest в /etc/samba/smb.conf. Добавьте следующее в начало файла:\n\n```\n/etc/samba/smb.conf\n```\n\n```\n[global]\nmap to guest = Bad User\n...\n```\n\n3. Перезапустите smbd.service.\n\n4. Укажите любой логин/пароль для команды net use:\n\n```\nnet use I: \\\\IP.ADDRESS.OF.SAMBA.SERVER\\REMINST /user:user pass\n```\n\nЭто происходит потому, что Windows 10 подключается к анонимным общедоступным ресурсам, проверяя имя пользователя и пароль для проверки возможности входа в систему, и, если оно получено, то разрешает анонимное соединение. По-видимому, часть, скрывающая это от пользователя, не вошла в сборку PE.\n\n"
    },
    {
      "title": "См. также",
      "level": 2,
      "content": "- Microsoft's documentation for Windows PE\n- Another article about making Windows PE images on Linux\n- A guide with scripts for unattended installation of Windows 7 from Linux using Windows PE\n- Windows 10 PE Unable to map network drive anonymously\n\n"
    }
  ]
}