{
  "title": "Wine (Русский)",
  "url": "https://wiki.archlinux.org/title/Wine_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- CrossOver\n- Deepin-wine\n- Wine package guidelines\n\nWine — слой совместимости, позволяющий запускать приложения Microsoft Windows в Unix-подобных операционных системах. Программы, запущенные в Wine, работают так же, как и \"родные\" — без потерь производительности и увеличения потребления памяти, характерных для эмуляторов.\n\n- Wine не изолирован от вашей системы.\n- Если в рамках вашей учётной записи у вас есть доступ к определённому файлу или ресурсу, то программы, запущенные в Wine, тоже его получат. Некоторые меры предосторожности на этот случай описаны в разделе #Отдельная учётная запись для запуска Wine и статье Безопасность#Запуск приложений в песочнице.\n- Wine может запускать в том числе и вредоносные программы (см. Wine FAQ).\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Чтобы установить Wine, подключите репозиторий multilib и установите пакет wine (development-версия), wine-stableAUR (stable) или wine-staging (testing). Wine Staging — пропатченная версия Wine с исправлениями багов и некоторыми возможностями, которые ещё не были добавлены в stable- и development-версии. См. также #Графические драйвера и #Звук.\n\nЕсли вы собираетесь запускать приложения, которые зависят от Internet Explorer и .NET, то имеет смысл также установить пакеты wine-gecko и wine-mono соответственно. Этот шаг не является обязательным, поскольку Wine может самостоятельно подгружать необходимые файлы по мере необходимости. Тем не менее, если скачать файлы заранее, то работать будет можно без подключения к сети, а Wine не придётся скачивать файлы каждый раз, когда они потребуются какому-нибудь префиксу.\n\n"
    },
    {
      "title": "Сторонние приложения",
      "level": 3,
      "content": "Перечисленные ниже приложения являются отдельными проектами, с собственными сообществами и веб-сайтами, и не поддерживаются основным сообществом Wine. Подробности можно найти в Wine Wiki.\n\n- CrossOver — Платная коммерческая версия Wine с более надёжной службой поддержки пользователей.\n\n- icoextract — Генерирует эскизы для исполняемых файлов Windows (.exe и .dll).\n\n- Lutris — Игровой лончер для всех типов игр, в том числе игр Wine (с управлением префиксами), игр Linux и эмуляторов.\n\n- PlayOnLinux — Графический префикс менеджер для Wine. Включает скрипты для помощи в установке и настройке программ.\n\n- Proton — Иструмент совместимости для Steam на основе Wine и дополнительных компонентов. На странице ProtonDB можно найти список совместимости.\n\n- PyWinery — Простой графический префикс менеджер для Wine.\n\n- Q4Wine — Графический префикс менеджер для Wine. Может экспортировать темы Qt в конфигурацию Wine для лучшей интеграции.\n\n- Bottles — Графический менеджер префиксов и запуска программ для Wine на основе GTK.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Настройка Wine обычно выполняется следующими инструментами:\n\n- winecfg — графический настройщик Wine, запускается командой winecfg.\n- regedit — утилита Wine для редактирования реестра, запускается командой regedit. См. статью Useful Registry Keys на сайте WineHQ.\n- control — реализация Панели управления Windows для Wine, запускается командой wine control.\n- Полный список команд можно найти в статье List of Commands на WineHQ.\n\n"
    },
    {
      "title": "WINEPREFIX",
      "level": 3,
      "content": "По умолчанию Wine хранит файлы настроек и установленные программы Windows в каталоге ~/.wine. Этот каталог обычно называют \"префикс Wine\" или \"бутылка Wine\" (wine bottle - \"бутылка вина\"). Каталог создаётся/обновляется каждый раз, когда вы запускаете программу Windows или одну из связанных с Wine программ вроде winecfg. Каталог префикса содержит дерево, которое ваши программы будут видеть как диск C:.\n\nС помощью переменной окружения WINEPREFIX можно задать произвольный каталог для префикса. Это удобно, если вы хотите использовать разные настройки для разных Windows-программ. Когда программа впервые запускается с новым префиксом, Wine автоматически создает каталог с чистым диском C и реестром.\n\nНапример, если вы запустите одну программу командой $ env WINEPREFIX=~/.win-a wine program-a.exe, а другую — командой $ env WINEPREFIX=~/.win-b wine program-b.exe, то у каждой программы будет отдельный диск С и отдельный реестр.\n\nЧтобы создать нужный префикс без запуска Windows-программы или графического инструмента, выполните:\n\n```\n$ env WINEPREFIX=~/.префикс wineboot -u\n```\n\n"
    },
    {
      "title": "WINEARCH",
      "level": 3,
      "content": "Wine по умолчанию запускает 64-битное окружение. Это поведение можно изменить переменной окружения WINEARCH. Переименуйте каталог ~/.wine и создайте новое окружение Wine командой $ WINEARCH=win32 winecfg. Это окружение будет 32-битным. Если переменная WINEARCH не указана, то создаётся 64-битное окружение.\n\nWINEARCH можно совместить с WINEPREFIX, чтобы создать отдельные окружения для win32 и win64:\n\n```\n$ WINEARCH=win32 WINEPREFIX=~/win32 winecfg\n$ WINEPREFIX=~/win64 winecfg\n```\n\nТакже WINEARCH можно совместить с другими программами Wine вроде winetricks (Steam взят для примера):\n\n```\nWINEARCH=win32 WINEPREFIX=~/.local/share/wineprefixes/steam winetricks steam\n```\n\nУзнать архитектуру существующего префикса можно в файле реестра. Следующая команда считывает системный реестр префикса ~/.wine и возвращает строку #arch=win32 или #arch=win64 в зависимости от типа архитектуры:\n\n```\n$ grep '#arch' ~/.wine/system.reg\n```\n\n"
    },
    {
      "title": "Графические драйвера",
      "level": 3,
      "content": "Вам придётся установить 32-битную версию вашего графического драйвера. Выберите нужный пакет из столбца OpenGL (multilib) в таблице Xorg#Установка драйвера.\n\nВерным признаком того, что ваш драйвер не подходит или неправильно настроен, будет следующее сообщение Wine в окне терминала:\n\n```\nDirect rendering is disabled, most likely your OpenGL drivers have not been installed correctly\n```\n\n"
    },
    {
      "title": "Звук",
      "level": 3,
      "content": "При запуске приложений в Wine могут возникнуть некоторые проблемы со звуком. Убедитесь, что в winecfg выбрано только одно звуковое устройство.\n\nУстановите необходимые вашему аудиодрайверу пакеты:\n\n- Для ALSA установите lib32-alsa-lib и lib32-alsa-plugins.\n- Для PulseAudio установите lib32-libpulse.\n- Для OSS установите lib32-alsa-oss.\n\nДополнительные пакеты:\n\n- Играм, в которых используется продвинутая звуковая система (например, TESV: Skyrim), может потребоваться пакет lib32-openal.\n\nЕсли winecfg по-прежнему не может обнаружить звуковой драйвер (Selected driver: (none)), настройте его через реестр. Например, если не работает микрофон в 32-битном приложении Windows на 64-битной базовой установке wine-1.9.7, получить полный доступ к звуковому аппаратному обеспечению можно следующим образом: откройте regedit, найдите HKEY_CURRENT_USER → Software → Wine → Drivers, добавьте строку с названием Audio и задайте ей значение alsa. Возможно, также поможет пересоздание префикса.\n\n"
    },
    {
      "title": "Поддержка MIDI",
      "level": 4,
      "content": "MIDI — довольно популярная музыкальная система видеоигр 90-х. Если вы пытаетесь запустить старую игру, то \"из коробки\" звук скорее всего работать не будет.\n\nВ Wine имеется отличная поддержка MIDI. Тем не менее, в первую очередь она должна работать на вашей хостовой системе, как объяснено в статье MIDI. Кроме того, убедитесь, что Wine использует правильный MIDI-разъём.\n\n"
    },
    {
      "title": "Прочие зависимости",
      "level": 3,
      "content": "Некоторым приложениям могут потребоваться дополнительные пакеты для различных целей:\n\n- Проигрывание музыки: lib32-mpg123.\n- \"Родные\" библиотеки обработки изображений: lib32-giflib и lib32-libpng.\n- Поддержка шифрования: lib32-gnutls.\n- 32-битные видеокодеки: lib32-gst-plugins-base, lib32-gst-plugins-good, lib32-gst-plugins-badAUR и lib32-gst-plugins-uglyAUR.\n- NTLM-аутентификация: samba.\n\n"
    },
    {
      "title": "Шрифты",
      "level": 3,
      "content": "Если в приложении Wine шрифты отображаются неразборчиво, проблема может быть в том, что они просто не установлены. Вы можете настроить Wine, чтобы он использовал системные шрифты:\n\n```\n$ cd ${WINEPREFIX:-~/.wine}/drive_c/windows/Fonts && for i in /usr/share/fonts/**/*.{ttf,otf}; do ln -s \"$i\" ; done\n```\n\nWine использует FreeType для построения шрифтов, и стандартные настройки FreeType изменились несколько релизов назад. Попробуйте использовать следующее окружение для Wine-программ:\n\n```\nFREETYPE_PROPERTIES=\"truetype:interpreter-version=35\"\n```\n\nМожно также попробовать установить шрифты Microsoft (TrueType) в префикс Wine. Если это не поможет, попробуйте сначала выполнить winetricks corefonts, а затем, как крайнее средство, winetricks allfonts.\n\nПосле выполнения этих команд \"убейте\" все запущенные сервера Wine и выполните winecfg. Шрифты должны быть доступны.\n\nЕсли шрифты выглядат немного смазанными, импортируйте следующий текстовый файл в реестр Wine с помощью regedit:\n\n```\nWindows Registry Editor Version 5.00\n[HKEY_CURRENT_USER\\Software\\Wine\\X11 Driver]\n\"ClientSideWithRender\"=\"N\"\n```\n\nДля мониторов с высоким разрешением значения dpi можно задать в winecfg.\n\nСм. также Настройка шрифтов#Приложения без поддержки fontconfig.\n\n"
    },
    {
      "title": "Сглаживаение шрифтов",
      "level": 4,
      "content": "Хороший способ улучшить рендеринг шрифтов в Wine — включить сглаживание ClearType. Следующий скрипт включит режим \"Subpixel smoothing (ClearType) RGB\":\n\n```\ncat << EOF > /tmp/fontsmoothing\nREGEDIT4\n\n[HKEY_CURRENT_USER\\Control Panel\\Desktop]\n\"FontSmoothing\"=\"2\"\n\"FontSmoothingOrientation\"=dword:00000001\n\"FontSmoothingType\"=dword:00000002\n\"FontSmoothingGamma\"=dword:00000578\nEOF\n\nWINE=${WINE:-wine} WINEPREFIX=${WINEPREFIX:-$HOME/.wine} $WINE regedit /tmp/fontsmoothing 2> /dev/null\n```\n\nПодробнее см. оригинальный ответ.\n\n"
    },
    {
      "title": "Иконки рабочего стола",
      "level": 3,
      "content": "Когда установщик приложения Windows пытается создать ярлык, Wine создает файл .desktop вместо него.\n\n- Ярлыки рабочего стола сохраняются в каталоге ~/Desktop.\n- Ярлыки стартового меню сохраняются в каталоге ~/.local/share/applications/wine/Programs/.\n\n"
    },
    {
      "title": "Пункты меню для утилит Wine",
      "level": 4,
      "content": "По умолчанию, при установке Wine пункты меню и иконки для относящихся к Wine программ (например, winecfg, winebrowser и т.д.) не создаются. Чтобы это исправить, установите мета-пакет wine-installerAUR или wine-installer-gitAUR (у последнего есть дополнительные зависимости) или следуйте инструкциям ниже.\n\nВо-первых, установите любую программу Windows, чтобы Wine создал меню. Затем создайте файлы со следующим содержанием в каталоге ~/.local/share/applications/wine/:\n\n```\nwine-browsedrive.desktop\n```\n\n```\n[Desktop Entry]\nName=Browse C: Drive\nComment=Browse your virtual C: drive\nExec=wine winebrowser c:\nTerminal=false\nType=Application\nIcon=folder-wine\nCategories=Wine;\n```\n\n```\nwine-uninstaller.desktop\n```\n\n```\n[Desktop Entry]\nName=Uninstall Wine Software\nComment=Uninstall Windows applications for Wine\nExec=wine uninstaller\nTerminal=false\nType=Application\nIcon=wine-uninstaller\nCategories=Wine;\n```\n\n```\nwine-winecfg.desktop\n```\n\n```\n[Desktop Entry]\nName=Configure Wine\nComment=Change application-specific and general Wine options\nExec=winecfg\nTerminal=false\nIcon=wine-winecfg\nType=Application\nCategories=Wine;\n```\n\nПосле этого создайте следующий файл в каталоге ~/.config/menus/applications-merged/:\n\n```\nwine.menu\n```\n\n```\n<!DOCTYPE Menu PUBLIC \"-//freedesktop//DTD Menu 1.0//EN\"\n\"http://www.freedesktop.org/standards/menu-spec/menu-1.0.dtd\">\n<Menu>\n  <Name>Applications</Name>\n  <Menu>\n    <Name>wine-wine</Name>\n    <Directory>wine-wine.directory</Directory>\n    <Include>\n      <Category>Wine</Category>\n    </Include>\n  </Menu>\n</Menu>\n```\n\nЕсли с этими настройками иконки выглядят уродливо (или не появились вовсе), то их нет среди доступных. Необходимо заменить настройки явным указанием расположения желаемых иконок. Того же можно добиться правым кликом по иконке и изменением настроек. Большой набор иконок для ярлыков можно найти в GNOME-colors.\n\n"
    },
    {
      "title": "Удаление пунктов меню",
      "level": 4,
      "content": "Созданные Wine пункты меню хранятся в каталоге ~/.local/share/applications/wine/Programs/. Если удалить соответствующий программе файл .desktop, то приложение исчезнет из меню.\n\nКроме того, чтобы удалить нежелательные расширения Wine, выполните следующие команды (источник — сайт Wine):\n\n```\n$ rm ~/.local/share/mime/packages/x-wine*\n$ rm ~/.local/share/applications/wine-extension*\n$ rm ~/.local/share/icons/hicolor/*/*/application-x-wine-extension*\n$ rm ~/.local/share/mime/application/x-wine-extension*\n```\n\nВ KDE, возможно, для полной очистки меню также потребуется удалить файлы wine-*.menu из каталога /.config/menus/.\n\n"
    },
    {
      "title": "Внешний вид",
      "level": 3,
      "content": "Оформление в стиле XP можно загрузить отсюда. Руководство по установке можно найти здесь. После установки выберите тему оформления в winecfg.\n\nПользователи Wine Staging могут вместо этого включить опцию Enable GTK3 Theming в разделе Staging winecfg. Будет выбрана текущая GTK-тема.\n\n"
    },
    {
      "title": "Печать",
      "level": 3,
      "content": "Чтобы использовать принтер (локальный или удалённый) с приложениями Wine в win32 prefixes (например, MS Word), установите пакет lib32-libcups, перезагрузите Wine (wineboot) и перезапустите приложение.\n\n"
    },
    {
      "title": "Сеть",
      "level": 3,
      "content": "Для приложений, работающих через TLS или HTTPS, установите пакет lib32-gnutls.\n\nWine также могут потребоваться специальные разрешения (capability) на доступ к сети по протоколу ICMP (пинги) (см. WineHQ FAQ):\n\n```\n# setcap cap_net_raw+epi /usr/bin/wine-preloader\n```\n\nЕсли после этого возникают проблемы (например, при обработке исключений или привилегированных команд), для удаления capability выполните:\n\n```\n# setcap -r /usr/bin/wine-preloader\n```\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Общую информацию об использовании Wine можно найти на странице Wine User's Guide.\n\nЗапуск конкретных приложений Windows в Wine описан на странице Wine Application Database (AppDB).\n\n"
    },
    {
      "title": "Wayland",
      "level": 3,
      "content": "В настоящее время Wine не поддерживает Wayland напрямую, но вы можете использовать Xwayland.\n\nНекоторые попытки реализовать поддержку Wayland:\n\n- Экспериментальный драйвер Wayland для Wine, который поддерживает работу OpenGL- и Windows GDI-приложений. См. это[устаревшая ссылка 2024-12-15 ⓘ] и это[устаревшая ссылка 2024-12-15 ⓘ] сообщения почтовой рассылки wine-devel.\n- wine-wayland: альтернативная сборка Wine с поддержкой Wayland посредством Vulkan (работает с DirectX 9, 10 и 11 (через #DXVK) и с Vulkan-совместимыми приложениями).\n\n"
    },
    {
      "title": "Wineconsole",
      "level": 3,
      "content": "Часто появляется необходимость запустить .exe-файл, чтобы пропатчить файлы игры, например, добавить поддержку широкоформатного экрана в старую игру. Запуск .exe-файла в Wine обычным способом ни к чему не приведёт. В этом случае откройте терминал и выполните:\n\n```\n$ wineconsole cmd\n```\n\nЗатем перейдите в каталог с .exe-файлом и запустите его.\n\n"
    },
    {
      "title": "Winetricks",
      "level": 3,
      "content": "Winetricks — скрипт, помогающий установить базовые зависимости, необходимые программам Windows. Устанавливаются DirectX 9.x, MSXML (для Microsoft Office 2007 и Internet Explorer), библиотеки Visual Runtime и многое другое.\n\nУстановите пакет winetricks или winetricks-gitAUR, после чего выполните:\n\n```\n$ winetricks\n```\n\nГрафический интерфейс можно установить с пакетом zenity.\n\n"
    },
    {
      "title": "CSMT",
      "level": 4,
      "content": "CSMT — технология Wine, использующая отдельный поток для вызовов OpenGL, что значительно повышает производительность. Начиная с Wine 3.2 CSMT по умолчанию включён. Для более ранних версий Wine его необходимо включить вручную. Для \"ванильного\" Wine запустите wine regedit и задайте DWORD-значение 0x01 (включено) для HKEY_CURRENT_USER -> Software > Wine > Direct3D > csmt. Для Wine Staging выполните winecfg и включите CSMT на вкладке Staging.\n\nИмейте в виду, что для некоторых приложений CSMT может привести к обратному эффекту — к снижению производительности. В этом случае отключите его вручную, создав/изменив значение в реестре на 0x00 (отключено).\n\nПодробная информация:\n\n- Обсуждение на Phoronix Forum с разработчиком CSMT Stefan Dösinger.\n\n"
    },
    {
      "title": "Режим OpenGL в играх",
      "level": 4,
      "content": "В некоторых играх есть поддержка OpenGL, который может работать лучше, чем стандартный DirectX. Хотя способ включения OpenGL варьируется от приложения к приложению, многие игры используют флаг -opengl:\n\n```\n$ wine /путь/к/3d_игре.exe -opengl\n```\n\nРазумеется, перед запуском приложения в этом режиме необходимо тщательно изучить его документацию и информацию из базы данных Wine AppDB.\n\n"
    },
    {
      "title": "DXVK",
      "level": 4,
      "content": "DXVK — новая многообещающая реализация DirectX версий 9, 10 и 11 поверх Vulkan. Значительно повышает производительность и в некоторых случаях обеспечивает даже лучшую совместимость. Battlefield 1, например, работает только под DXVK. С другой стороны, на данный момент DXVK поддерживает не все игры Wine.\n\nЧтобы использовать DXVK, установите пакет dxvk-binAUR. Команда ниже активирует его для указанного префикса (по умолчанию ~/.wine):\n\n```\n$ WINEPREFIX=префикс setup_dxvk install\n```\n\n"
    },
    {
      "title": "Gallium Nine",
      "level": 4,
      "content": "Для открытых драйверов на основе Gallium (в основном карты AMD) существует проект трекера состояний Gallium Direct3D, который ставит целью добиться производительноси, сравнимой с нативными показателями DirectX 9. В большинстве случаев выдаёт вдвое большую производительность, чем стандартный Wine, и меньшее количество визуальных помех. Потреблене времени центрального процессора значительно ниже по сравнению с CSMT.\n\nЧтобы его использовать, установите пакет wine-nine. Это одиночный пакет, подходящий для любой версии Wine. Команда wine ninewinecfg позволяет проверить, включён Gallium Nine или нет.\n\n"
    },
    {
      "title": "Удаление ненужных файловых ассоциаций",
      "level": 3,
      "content": "Wine используется как приложение по умолчанию для большого количества форматов файлов. Некоторые из них, например, vbs или chm, являются специфичными для Windows, и такая привязка вполне логична. С другой стороны, довольно неприятно, когда файл gif, jpeg, txt или js открывается в запущенном в Wine браузере Internet Explorer или редакторе Notepad.\n\nАссоциации Wine хранятся в каталоге ~/.local/share/applications/ в виде файлов wine-extension-расширение.desktop. Удалите те из них, которые не нужны, либо удалите все расширения Wine:\n\n```\n$ rm -f ~/.local/share/applications/wine-extension*.desktop\n$ rm -f ~/.local/share/icons/hicolor/*/*/application-x-wine-extension*\n```\n\nПосле этого очистите кэш:\n\n```\n$ rm -f ~/.local/share/applications/mimeinfo.cache\n$ rm -f ~/.local/share/mime/packages/x-wine*\n$ rm -f ~/.local/share/mime/application/x-wine-extension*\n```\n\nИ обновите его:\n\n```\n$ update-desktop-database ~/.local/share/applications\n$ update-mime-database ~/.local/share/mime/\n```\n\nВ качестве альтернативы можно удалить все файлы, относящиеся к Wine:\n\n```\n$ find ~/.local/share -name \"*wine*\" | xargs -I '{}' --no-run-if-empty rm -r '{}'\n```\n\nПосле этого тоже обновите кэш, как показано выше.\n\nИмейте в виду, что Wine может создать новые ассоциации и даже пересоздать удалённые, если того потребует какое-нибудь приложение.\n\n"
    },
    {
      "title": "Запрет на создание файловых ассоциаций",
      "level": 3,
      "content": "Данный метод предотвращает создание файловых ассоциаций, но оставляет возможность для создания XDG-файлов .desktop (которые вы видите, например, в меню).\n\nЕсли вы хотите запретить Wine создавать файловые ассоциации, запустите winecfg и уберите галочку \"Manage File Associations\" на вкладке Desktop Integration. Подробнее см. Wine FAQ.\n\nЧтобы сделать то же самое, но с помощью реестра, добавьте строку Enable со значением N в\n\n```\nHKEY_CURRENT_USER\\Software\\Wine\\FileOpenAssociations\n```\n\nСначала необходимо создать ключ FileOpenAssociations!\n\nЕсли вы хотите, чтобы эти настройки автоматически применялись к новым префиксам, отредактируйте файл /usr/share/wine/wine.inf, добавив следующую строку в раздел [Services]:\n\n```\nHKCU,\"Software\\Wine\\FileOpenAssociations\",\"Enable\",2,\"N\"\n```\n\nПредотвратить перезапись изменённых файлов при обновлении пакета можно создав хук pacman, который будет вносить изменения автоматически:\n\n```\n/etc/pacman.d/hooks/stop-wine-associations.hook\n```\n\n```\n[Trigger]\nOperation = Install\nOperation = Upgrade\nType = Path\nTarget = usr/share/wine/wine.inf\n\n[Action]\nDescription = Stopping Wine from hijacking file associations...\nWhen = PostTransaction\nExec = /bin/sh -c '/usr/bin/grep -q \"HKCU,\\\"Software\\\\\\Wine\\\\\\FileOpenAssociations\\\",\\\"Enable\\\",2,\\\"N\\\"\" /usr/share/wine/wine.inf || /usr/bin/sed -i \"s/\\[Services\\]/\\[Services\\]\\nHKCU,\\\"Software\\\\\\Wine\\\\\\FileOpenAssociations\\\",\\\"Enable\\\",2,\\\"N\\\"/g\" /usr/share/wine/wine.inf'\n```\n\nПодробнее см. pacman#Хуки\n\n"
    },
    {
      "title": "Неявный запуск бинарников Windows",
      "level": 3,
      "content": "Пакет wine содержит файл binfmt, который позволяет запускать программы Windows напрямую. Например, команда ./myprogram.exe будет запускать программу так же, как wine ./myprogram.exe. Соответствующая системная служба запускается автоматически при старте системы. Если вы ещё не перезагружались после установки Wine, то можете вручную запустить службу systemd-binfmt.service, чтобы она заработала.\n\n"
    },
    {
      "title": "Два монитора с разными разрешениями",
      "level": 3,
      "content": "Если у вас возникли проблемы с разрешением экрана на втором мониторе, возможно, в системе отсутствует пакет lib32-libxrandr.\n\nКроме того, установка пакета lib32-libxinerama поможет решить некоторые другие проблемы работы с двумя мониторами в Wine: ненажимаемые иконки и пункты меню, плохая отрисовка интерфейса приложения, зависание курсора мыши и т.п.\n\n"
    },
    {
      "title": "Прожиг оптического носителя",
      "level": 3,
      "content": "Для прожига CD- и DVD-дисков необходимо загрузить модуль ядра sg.\n\n"
    },
    {
      "title": "Монтирование образов оптических дисков",
      "level": 3,
      "content": "Приложения могут проверять наличие оптического диска в дисководе. Иногда это просто проверка присутствия данных, и в этом случае будет достаточно с помощью winecfg настроить определённый путь в файловой системе выступать в качестве привода CD-ROM. Другие приложения могут проверять название носителя и/или серийный номер, и в этом случае потребуется смонтировать соответствующий образ.\n\nНекоторые утилиты для работы с виртуальными дисками, в том числе основанные на fuse, не умеют работать с такими метаданными — например, Acetoneiso. CDEmu, наоборот, работает вполне корректно.\n\n"
    },
    {
      "title": "Показ FPS в играх",
      "level": 3,
      "content": "Wine отслеживает FPS графических приложений, если установлена переменная окружения WINEDEBUG=fps. Количество кадров будет выводиться в stdout. Утилита osd_cat из пакета xosd позволяет отобразить FPS в верхней части экрана поверх окна приложения. См также вспомогательный скрипт.\n\n"
    },
    {
      "title": "Отдельная учётная запись для запуска Wine",
      "level": 3,
      "content": "Поскольку приложения Windows имеют доступ к вашей домашней директории, имеет смысл создать отдельную учётную запись для работы только с Wine.\n\nПервым делом создайте саму учётную запись:\n\n```\n# useradd -m -s /bin/bash wineuser\n```\n\nЗатем переключитесь в другую виртуальную консоль и запустите оконный менеджер или окружение рабочего стола (или прото читайте дальше)...\n\nЧтобы теперь запускать Wine от новой учётной записи, необходимо добавить её в список разрешений X server:\n\n```\n$ xhost +SI:localuser:wineuser\n```\n\nНаконец, можно запускать Wine, передав ему с помощью env необходимые переменные окружения:\n\n```\n$ sudo -u wineuser env HOME=/home/wineuser USER=wineuser USERNAME=wineuser LOGNAME=wineuser wine аргументы\n```\n\nПроцесс запуска приложений Windows в Wine можно автоматизировать с помощью скрипта:\n\n```\n/usr/local/bin/runaswine\n```\n\n```\n#!/bin/bash\nxhost +SI:localuser:wineuser\nsudo -u wineuser env HOME=/home/wineuser USER=wineuser USERNAME=wineuser LOGNAME=wineuser wine \"$@\"\n```\n\nТеперь приложение Wine запустится следующей командой:\n\n```\n$ runaswine \"C:\\путь\\к\\приложению.exe\"\n```\n\nЧтобы не вводить пароль каждый раз при запуске Wine, добавьте следующий пункт в файл /etc/sudoers: имя_основного_пользователя ALL=(wineuser) NOPASSWD: ALL. Подробнее см. Sudo#Настройка.\n\nРекомендуется также запустить winecfg от пользователя Wine, и в окне настроек (раздел \"Desktop Integration\") убрать привязки ко всем каталогам за пределами домашнего. Так Wine будет иметь доступ только к нему и ни к чему более.\n\nПравда, нужно иметь в виду, что при таком способе работы в приложениях, использующих PulseAudio, может перестать работать звук. В статье PulseAudio/Примеры#Одновременное использование PulseAudio несколькими пользователями описано, как дать пользователю Wine доступ к демону PulseAudio основного аккаунта.\n\n"
    },
    {
      "title": "Каталог Temp в tmpfs",
      "level": 3,
      "content": "По умолчанию Wine записывает временные файлы на физический носитель, но можно использовать для этого файловую систему tmpfs. Удалите текущий каталог для временных файлов и создайте символическую ссылку на новый:\n\n```\n$ rm -r ~/.wine/drive_c/users/$USER/Temp\n$ ln -s /tmp/ ~/.wine/drive_c/users/$USER/Temp\n```\n\n"
    },
    {
      "title": "Запрет на установку Mono/Gecko",
      "level": 3,
      "content": "Если Gecko и/или Mono нет ни в префиксе, ни в системе в целом, Wine будет запрашивать разрешение на скачивание их из сети. Если ни Gecko, ни Mono вам не нужны, то этот диалог можно отключить. Установите переменную окружения WINEDLLOVERRIDES в значение mscoree=d;mshtml=d.\n\n"
    },
    {
      "title": "Vulkan",
      "level": 3,
      "content": "В Wine 3.3 была добавлена поддержка Vulkan. Базовый ICD-загрузчик Vulkan в большинстве приложений работает вполне нормально, но в нём отсутствуют некоторые продвинутые возможности вроде Vulkan layers. Чтобы получить к ним доступ, установите официальный Vulkan SDK (см. шаг 2-4 на GitHub-странице автора патча).\n\n"
    },
    {
      "title": "Удаление файловых привязок",
      "level": 3,
      "content": "По соображениям безопасности полезно удалить предустановленные привязки Wine, чтобы приложения Windows не могли быть запущены напрямую из файлового менеджера или браузера (Firefox предлагает открыть EXE-файлы сразу в Wine!).\n\nЧтобы это сделать, добавьте следующие строки в раздел [options] файла /etc/pacman.conf:\n\n```\nNoExtract = usr/lib/binfmt.d/wine.conf\nNoExtract = usr/share/applications/wine.desktop\n```\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Общие советы по решению возможных проблем можно найти на страницах Wine User's Guide и Wine FAQ (прежде всего в разделе Решение проблем).\n\nСоветы для конкретных приложений можно найти в Wine AppDB.\n\n"
    },
    {
      "title": "Проблемы с Xwayland",
      "level": 3,
      "content": "Если вы используете Wine в Xwayland, опция \"Эмуляция виртуального рабочего стола\" на вкладке Graphics в winecfg позволяет решить следующие проблемы:\n\n- мерцание;\n- неправильное положение окна;\n- неправильное положение курсора мыши и реакция на клики;\n- обнаружение клавиатуры.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Wine Homepage\n- Wine Wiki\n- Wine Application Database (AppDB) — Информация о запуске конкретных приложений Windows (известные проблемы, рейтинги, руководства и т.п.).\n- Wine Forums — Здесь можно задавать вопросы, но только после прочтения FAQ и AppDB.\n- Gentoo:Wine\n- Darling — аналогичный проект для программ MacOS\n\n"
    }
  ]
}