{
  "title": "Wine (Français)",
  "url": "https://wiki.archlinux.org/title/Wine_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- CrossOver (Français)\n- Deepin-wine\n- Wine package guidelines\n\nWine est une couche de compatibilité capable d'exécuter des applications Microsoft Windows sur des systèmes d'exploitation de type Unix. Les programmes s'exécutant dans Wine se comportent comme des programmes natifs, sans les pénalités de performance/mémoire d'un émulateur.\n\n- Wine n'est pas isolé de votre système.\n- Si vous pouvez accéder à un fichier ou à une ressource avec votre compte utilisateur, les programmes s'exécutant dans Wine le peuvent également. Voir #Exécuter Wine sous un compte utilisateur distinct et Security#Sandboxing applications pour les précautions à prendre.\n- Wine peut également exécuter des logiciels malveillants (voir Wine FAQ on Malware compatibility)\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Activez le dépôt multilib et installez les paquets wine (développement), wine-stableAUR (stable) ou wine-staging (testing). Wine Staging est une version patchée de Wine, qui contient des corrections de bogues et des fonctionnalités qui n'ont pas encore été intégrées dans la branche stable ou de développement.\n\nVoir également #Pilotes graphiques et #Son pour des exigences supplémentaires.\n\nPensez à installer wine-gecko et wine-mono pour les applications qui dépendent d'Internet Explorer et de .NET, respectivement. Ces paquets ne sont pas strictement nécessaires car Wine téléchargera les fichiers correspondants au fur et à mesure des besoins. Cependant, avoir les fichiers téléchargés à l'avance vous permet de travailler hors ligne et fait en sorte que Wine ne télécharge pas les fichiers pour chaque préfixe Wine qui en a besoin.\n\n"
    },
    {
      "title": "Applications tierces",
      "level": 3,
      "content": "Celles-ci ont leurs propres communautés et sites web, et ne sont pas pris en charge par la communauté principale de Wine. Voir Wine Wiki pour plus de détails.\n\n- CrossOver — Version payante et commercialisée de Wine qui fournit un support plus complet à l'utilisateur final.\n\n- icoextract — Génère des vignettes pour les fichiers exécutables Windows (.exe et .dll).\n\n- Lutris — Lanceur de jeux pour tous les types de jeux, y compris les jeux Wine (avec gestion des préfixes), les jeux Linux natifs et les émulateurs.\n\n- PlayOnLinux — Gestionnaire graphique de préfixes pour Wine. Contient des scripts pour aider à l'installation et à la configuration des programmes.\n\n- Proton — Outil de compatibilité conçu pour Steam basé sur Wine et des composants supplémentaires. Voir ProtonDB pour la liste de compatibilité.\n\n- PyWinery — Gestionnaire graphique simple de préfixes pour Wine.\n\n- Q4Wine — Gestionnaire graphique de préfixes pour Wine. Peut exporter les thèmes Qt dans la configuration de Wine pour une meilleure intégration.\n\n- Bottles — Gestionnaire graphique de préfixes et de coureurs pour Wine basé sur GTK.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "La configuration de Wine est généralement réalisée en utilisant :\n\n- winecfg est un outil de configuration GUI pour Wine, qui peut être lancé en exécutant winecfg.\n- regedit est l'outil d'édition du registre de Wine, qui peut être lancé en exécutant regedit. Voir l'article de WineHQ sur Useful Registry Keys.\n- control est l'implémentation par Wine du panneau de configuration de Windows, qui peut être lancé en exécutant wine control.\n- Voir l'article de WineHQ List of Commands pour la liste complète.\n\n"
    },
    {
      "title": "WINEPREFIX",
      "level": 3,
      "content": "Par défaut, Wine stocke ses fichiers de configuration et les programmes Windows installés dans ~/.wine. Ce répertoire est communément appelé \"Wine prefix\" ou \"Wine bottle\". Il est créé/mis à jour automatiquement chaque fois que vous exécutez un programme Windows ou l'un des programmes intégrés à Wine comme winecfg. Le répertoire prefix contient également une arborescence que vos programmes Windows verront comme C: (le lecteur C).\n\nVous pouvez remplacer l'emplacement que Wine utilise pour un préfixe avec la variable d'environnement WINEPREFIX. Ceci est utile si vous souhaitez utiliser des configurations distinctes pour différents programmes Windows. La première fois qu'un programme est exécuté avec un nouveau préfixe Wine, il créera automatiquement un répertoire avec un lecteur C et un registre vides.\n\nPar exemple, si vous exécutez un programme avec env WINEPREFIX=~/.win-a wine program-a.exe, et un autre avec env WINEPREFIX=~/.win-b wine program-b.exe, les deux programmes auront chacun un lecteur C et des registres distincts.\n\nPour créer un préfixe par défaut sans exécuter un programme Windows ou un autre outil GUI, vous pouvez utiliser :\n\n```\n$ env WINEPREFIX=~/.customprefix wineboot -u\n```\n\n"
    },
    {
      "title": "WINEARCH",
      "level": 3,
      "content": "Wine démarre un environnement 64 bits par défaut. Vous pouvez modifier ce comportement en utilisant la variable d'environnement WINEARCH. Renommez votre répertoire ~/.wine et créez un nouvel environnement Wine en exécutant $ WINEARCH=win32 winecfg. Vous obtiendrez ainsi un environnement Wine 32 bits. Si vous ne définissez pas WINEARCH, vous obtiendrez un environnement 64 bits.\n\nVous pouvez combiner cette option avec WINEPREFIX pour créer un environnement séparé win32 et win64 :\n\n```\n$ WINEARCH=win32 WINEPREFIX=~/win32 winecfg\n$ WINEPREFIX=~/win64 winecfg\n```\n\nVous pouvez également utiliser WINEARCH en combinaison avec d'autres programmes Wine, tels que winetricks (en utilisant Steam comme exemple) :\n\n```\nWINEARCH=win32 WINEPREFIX=~/.local/share/wineprefixes/steam winetricks steam\n```\n\nAfin de voir l'architecture d'un préfixe existant, vous pouvez vérifier son fichier de registre. La commande ci-dessous lit le registre système du préfixe ~/.wine et retourne #arch=win32 ou #arch=win64 selon le type d'architecture :\n\n```\n$ grep '#arch' ~/.wine/system.reg\n```\n\n"
    },
    {
      "title": "Pilotes graphiques",
      "level": 3,
      "content": "Vous devez installer la version 32 bits de votre pilote graphique. Veuillez installer le paquet qui est listé dans la colonne OpenGL (multilib) du tableau dans Xorg (Français)#Installation des pilotes.\n\nUn bon signe que vos pilotes sont inadéquats ou mal configurés est lorsque Wine affiche le message suivant dans votre fenêtre de terminal :\n\n```\nDirect rendering is disabled, most likely your OpenGL drivers have not been installed correctly\n```\n\n"
    },
    {
      "title": "Son",
      "level": 3,
      "content": "Par défaut, des problèmes de son peuvent survenir lors de l'exécution d'applications Wine. Assurez-vous qu'un seul périphérique audio est sélectionné dans winecfg.\n\nInstallez les paquets corrects pour le pilote audio que vous souhaitez utiliser :\n\n- Pour Advanced Linux Sound Architecture, installez lib32-alsa-lib et lib32-alsa-plugins.\n- Pour PulseAudio, installez lib32-libpulse.\n- Pour PipeWire, installez soit pipewire-pulse et lib32-libpulse, soit pipewire-alsa et lib32-alsa-lib. + lib32-alsa-plugins.\n- Pour OSS installer lib32-alsa-oss\n\nPaquets supplémentaires :\n\n- Les jeux qui utilisent des systèmes sonores avancés (par exemple TESV : Skyrim) peuvent nécessiter des installations supplémentaires de lib32-openal.\n\nSi winecfg ne parvient toujours pas à détecter le pilote audio (Pilote sélectionné : (aucun)), configurez le via le registre. Par exemple, dans un cas où le microphone ne fonctionnait pas dans une application Windows 32 bits sur une installation stock 64 bits de wine-1.9.7, ceci a permis un accès complet au matériel audio (lecture du son et micro) : ouvrez regedit, cherchez la clé HKEY_CURRENT_USER → Software → Wine → Drivers, et ajoutez une chaîne appelée Audio et donnez-lui la valeur alsa. En outre, il peut être utile de récréer le préfixe.\n\n"
    },
    {
      "title": "Prise en charge du MIDI",
      "level": 4,
      "content": "MIDI était un système assez populaire pour la musique des jeux vidéo dans les années 90. Si vous essayez de vieux jeux, il n'est pas rare que la musique ne soit pas jouée d'emblée. Wine dispose d'un excellent support MIDI. Cependant, vous devez d'abord le faire fonctionner sur votre système hôte, comme expliqué dans MIDI. Enfin et surtout, vous devez vous assurer que Wine utilisera la sortie MIDI correcte.\n\n"
    },
    {
      "title": "Autres dépendances",
      "level": 3,
      "content": "Certaines applications peuvent nécessiter des paquets supplémentaires [1] :\n\n- Pour la prise en charge du chiffrement, installez lib32-gnutls.\n- Pour la lecture des médias dans les programmes 32 bits, installez lib32-gst-plugins-base, lib32-gst-plugins-good, lib32-gst-plugins-badAUR et lib32-gst-plugins-uglyAUR.\n- Pour l'authentification NTLM, installez samba.\n\n"
    },
    {
      "title": "Polices de caractères",
      "level": 3,
      "content": "Si les applications Wine n'affichent pas des polices facilement lisibles, il se peut que vous n'ayez aucune police installée. Pour lier facilement toutes les polices du système afin qu'elles soient accessibles depuis Wine :\n\n```\n$ cd ${WINEPREFIX:-~/.wine}/drive_c/windows/Fonts && for i in /usr/share/fonts/**/*.{ttf,otf} ; do ln -s \"$i\" ; done\n```\n\nWine utilise FreeType pour le rendu des polices, et les valeurs par défaut de FreeType ont changé il y a quelques versions. Essayez d'utiliser ce paramètre d'environnement pour les programmes Wine :\n\n```\nFREETYPE_PROPERTIES=\"truetype:interpreter-version=35\"\n```\n\nUne autre possibilité est d'installer les polices TrueType de Microsoft dans votre préfixe wine. Si cela ne vous aide pas, essayez d'exécuter d'abord winetricks corefonts, puis winetricks allfonts en dernier recours.\n\nAprès avoir exécuté ces programmes, tuez tous les serveurs Wine et exécutez winecfg. Les polices devraient maintenant être lisibles.\n\nSi les polices ont l'air de s'estomper, importez le fichier texte suivant dans le registre de Wine avec regedit :\n\n```\nWindows Registry Editor Version 5.00\n[HKEY_CURRENT_USER\\Software\\Wine\\X11 Driver]\n\"ClientSideWithRender\"=\"N\"\n```\n\nPour les écrans haute résolution, vous pouvez ajuster les valeurs de ppp dans winecfg.\n\nConsultez également Font configuration#Applications without Fontconfig support.\n\n"
    },
    {
      "title": "Activer le lissage des polices",
      "level": 4,
      "content": "Un bon moyen d'améliorer le rendu des polices de Wine est d'activer le lissage des polices de type clair. Pour activer le \"Lissage des sous-pixels (ClearType) RGB\" :\n\n```\n/tmp/fontsmoothing.reg\n```\n\n```\nREGEDIT4\n\n[HKEY_CURRENT_USER\\Control Panel\\Desktop]\n\"FontSmoothing\"=\"2\"\n\"FontSmoothingOrientation\"=dword:00000001\n\"FontSmoothingType\"=dword:00000002\n\"FontSmoothingGamma\"=dword:00000578\nEOF\n```\n\n```\n$ WINE=${WINE:-wine} WINEPREFIX=${WINEPREFIX:-$HOME/.wine} $WINE regedit /tmp/fontsmoothing.reg 2> /dev/null\n```\n\nPour plus d'informations, consultez la réponse originale.\n\n"
    },
    {
      "title": "Menus du lanceur de bureau",
      "level": 3,
      "content": "Lorsqu'un installateur d'application Windows crée un raccourci, Wine crée un fichier .desktop à la place. Les emplacements par défaut de ces fichiers dans Arch Linux sont :\n\n- Les raccourcis du bureau sont placés dans ~/Desktop\n- Les raccourcis du menu Démarrer sont placés dans ~/.local/share/applications/wine/Programs/.\n\n"
    },
    {
      "title": "Création d'entrées de menu pour les utilitaires de Wine",
      "level": 4,
      "content": "Par défaut, l'installation de Wine ne crée pas de menus/icônes de bureau pour les logiciels fournis avec Wine (par exemple, pour winecfg, winebrowser, etc). Ceci peut être réalisé en installant le méta-paquet wine-installerAUR ou wine-installer-gitAUR (ce dernier n'a pas de dépendances supplémentaires), sinon ces instructions ajouteront des entrées pour ces applications.\n\nTout d'abord, installez un programme Windows en utilisant Wine pour créer le menu de base. Une fois le menu de base créé, vous pouvez créer les fichiers suivants dans ~/.local/share/applications/wine/ :\n\n```\nwine-browsedrive.desktop\n```\n\n```\n[Desktop Entry]\nName=Browse C: Drive\nComment=Browse your virtual C: drive\nExec=wine winebrowser c:\nTerminal=false\nType=Application\nIcon=folder-wine\nCategories=Wine;\n```\n\n```\nwine-uninstaller.desktop\n```\n\n```\n[Desktop Entry]\nName=Uninstall Wine Software\nComment=Uninstall Windows applications for Wine\nExec=wine uninstaller\nTerminal=false\nType=Application\nIcon=wine-uninstaller\nCategories=Wine;\n```\n\n```\nwine-winecfg.desktop\n```\n\n```\n[Desktop Entry]\nName=Configure Wine\nComment=Change application-specific and general Wine options\nExec=winecfg\nTerminal=false\nIcon=wine-winecfg\nType=Application\nCategories=Wine;\n```\n\nEt créez le fichier suivant dans ~/.config/menus/applications-merged/ :\n\n```\nwine.menu\n```\n\n```\n<!DOCTYPE Menu PUBLIC \"-//freedesktop//DTD Menu 1.0//EN\"\n\"http://www.freedesktop.org/standards/menu-spec/menu-1.0.dtd\">\n<Menu>\n  <Name>Applications</Name>\n  <Menu>\n    <Name>wine-wine</Name>\n    <Directory>wine-wine.directory</Directory>\n    <Include>\n      <Category>Wine</Category>\n    </Include>\n  </Menu>\n</Menu>\n```\n\nSi ces paramètres produisent une icône laide/inexistante, cela signifie qu'il n'y a pas d'icônes pour ces lanceurs dans le jeu d'icônes que vous avez activé. Vous devez remplacer les paramètres de l'icône par l'emplacement explicite de l'icône que vous voulez. Cliquer sur l'icône dans le menu des propriétés du lanceur aura le même effet. Un excellent jeu d'icônes qui prend en charge ces raccourcis est gnome-colors-icon-themeAUR.\n\n"
    },
    {
      "title": "Suppression des entrées de menu",
      "level": 4,
      "content": "Les entrées de menu créées par Wine sont situées dans ~/.local/share/applications/wine/Programs/. Supprimez l'entrée .desktop du programme pour supprimer l'application du menu.\n\nEn outre, pour supprimer les extensions indésirables liées par Wine, exécutez les commandes suivantes (tirées du site web de Wine) :\n\n```\n$ rm ~/.local/share/mime/packages/x-wine*\n$ rm ~/.local/share/applications/wine-extension*\n$ rm ~/.local/share/icons/hicolor/*/*/application-x-wine-extension*\n$ rm ~/.local/share/mime/application/x-wine-extension*\n```\n\nParfois, vous devez également supprimer les fichiers wine-*.menu de /.config/menus/ pour supprimer complètement les éléments du sous-menu Wine dans KDE.\n\n"
    },
    {
      "title": "Apparence",
      "level": 3,
      "content": "Un thème similaire à celui de XP peut être téléchargé. Pour l'installer, voir cet article wiki en amont. Enfin, utilisez winecfg pour le sélectionner.\n\nLes utilisateurs de Wine staging peuvent plutôt essayer d'activer l'option Enable GTK3 Theming dans la section Staging de winecfg pour un thème qui correspond au thème GTK actuel.\n\n"
    },
    {
      "title": "Impression",
      "level": 3,
      "content": "Afin d'utiliser vos imprimantes installées (locales et réseau) avec les applications wine en préfixes win32 (par exemple MS Word), installez le paquet lib32-libcups, redémarrez wine (wineboot) et relancez votre application wine.\n\n"
    },
    {
      "title": "Mise en réseau",
      "level": 3,
      "content": "Après l'installation, il se peut que le paquet lib32-gnutls doive être installé pour que les applications établissant des connexions TLS ou HTTPS fonctionnent.\n\nPour ICMP (ping), Wine peut avoir besoin d'un accès réseau comme décrit dans la FAQ de WineHQ :\n\n```\n# setcap cap_net_raw+epi /usr/bin/wine-preloader\n```\n\nSi des problèmes surviennent après cela (comme une exception non gérée ou une instruction privilégiée), supprimez-les via :\n\n```\n# setcap -r /usr/bin/wine-preloader\n```\n\n"
    },
    {
      "title": "Utilisation",
      "level": 2,
      "content": "Voir Wine User's Guide pour des informations générales sur l'utilisation de Wine.\n\nVoir Wine Application Database (AppDB) pour des informations supplémentaires sur des applications Windows spécifiques dans Wine.\n\n"
    },
    {
      "title": "Wayland",
      "level": 3,
      "content": "Actuellement, Wine ne prend pas directement en charge Wayland, mais vous pouvez utiliser Xwayland à la place.\n\nIl y a cependant quelques efforts pour prendre en charge Wayland :\n\n- Pilote Wayland expérimental pour Wine, qui prend en charge les applications OpenGL et Windows GDI. Voir ici[dead link 2024-12-15 ⓘ] et là[dead link 2024-12-15 ⓘ] sur la liste de diffusion wine-devel.\n- wine-wayland : une version personnalisée de Wine, qui prends en charge Wayland via Vulkan (donc il prends en charge seulement : DirectX 9, 10 et 11 via #DXVK et les applications compatibles avec Vulkan).\n\n"
    },
    {
      "title": "Wineconsole",
      "level": 3,
      "content": "Souvent, vous pouvez avoir besoin d'exécuter des .exe pour patcher des fichiers de jeu, par exemple un mod d'écran large pour un vieux jeu, et exécuter le .exe normalement par Wine pourrait ne rien donner. Dans ce cas, vous pouvez ouvrir un terminal et exécuter la commande suivante :\n\n```\n$ wineconsole cmd\n```\n\nPuis naviguez dans le répertoire et exécutez le fichier .exe à partir de là.\n\n"
    },
    {
      "title": "Winetricks",
      "level": 3,
      "content": "Winetricks est un script qui permet d'installer les composants de base nécessaires à l'exécution des programmes Windows. Les composants installables incluent DirectX 9.x, MSXML (requis par Microsoft Office 2007 et Internet Explorer), les bibliothèques Visual Runtime et bien d'autres.\n\nInstallez le paquet winetricks (ou alternativement winetricks-gitAUR). Exécutez-le ensuite avec :\n\n```\n$ winetricks\n```\n\nPour utiliser l'interface graphique, installez le paquet zenity (GTK) ou kdialog (Qt).\n\n"
    },
    {
      "title": "CSMT",
      "level": 4,
      "content": "CSMT est une technologie utilisée par Wine pour utiliser un thread séparé pour les appels OpenGL afin d'améliorer sensiblement les performances. Depuis Wine 3.2, CSMT est activé par défaut.\n\nNotez que CSMT peut en fait nuire aux performances de certaines applications − si c'est le cas, désactivez-le en exécutant wine regedit et définissez la valeur DWORD de HKEY_CURRENT_USER -> Software > Wine > Direct3D > csmt à 0x00 (désactivé).\n\nInformations complémentaires :\n\n"
    },
    {
      "title": "Forcer le mode OpenGL dans les jeux",
      "level": 4,
      "content": "Certains jeux peuvent avoir un mode OpenGL qui peut être plus performant que leur mode DirectX par défaut. Bien que les étapes pour activer le rendu OpenGL soient spécifiques à l'application, de nombreux jeux acceptent le paramètre -opengl.\n\n```\n$ wine /path/to/3d_game.exe -opengl\n```\n\nVous devez bien sûr vous référer à la documentation de votre application et à la AppDB de Wine pour de telles informations spécifiques à l'application.\n\n"
    },
    {
      "title": "VKD3D-Proton",
      "level": 4,
      "content": "VKD3D-Proton est un fork de VKD3D qui vise à implémenter l'API Direct3D 12 complète en utilisant Vulkan. Le projet représente le développement pour la prise en charge de Direct3D 12 dans Proton, améliorant les performances et la compatibilité pour les jeux DirectX 12.\n\nPour l'utiliser, installez vkd3d-proton-binAUR. Exécutez ensuite la commande suivante pour l'activer dans votre Wineprefix (par défaut ~/.wine) :\n\n```\n$ WINEPREFIX=votre-préfixe setup_vkd3d_proton install\n```\n\nNote: **banissement** \n\n"
    },
    {
      "title": "DXVK",
      "level": 4,
      "content": "DXVK est une nouvelle implémentation prometteuse de DirectX 9, 10 et 11 sur Vulkan. Cela devrait permettre de meilleures performances et, dans certains cas, une meilleure compatibilité. Battlefield 1, par exemple, ne fonctionne que sous DXVK. Par contre, DXVK ne prends pas (encore) en charge tous les jeux Wine.\n\nPour l'utiliser, installez dxvk-binAUR. Ensuite, exécutez la commande suivante pour l'activer dans votre Wineprefix (par défaut ~/.wine) :\n\n```\n$ WINEPREFIX=votre-préfixe setup_dxvk install\n```\n\n"
    },
    {
      "title": "Gallium Nine",
      "level": 4,
      "content": "Avec les pilotes open-source basés sur Gallium (principalement les cartes AMD et Intel), il existe un Gallium Direct3D state tracker qui vise à fournir des performances quasi-natives pour DirectX 9. Dans la plupart des cas, il y a moins de problèmes visuels que Wine en amont et les performances sont doublées. Il consomme beaucoup moins de temps CPU que CSMT.\n\nInstallez wine-nine pour l'utiliser. Il s'agit d'un paquet autonome qui peut être installé avec n'importe quelle version de Wine. Utilisez wine ninewinecfg pour vérifier s'il est activé.\n\nPour les anciennes cartes graphiques Intel (gen4-7 : GMA 3000, GMA 4500, HD 2000-5000 ; année 2006-2014) le pilote Crocus Gallium doit être utilisé à la place de i965 depuis Mesa 21.2. Exportez la variable d'environnement suivante avant d'exécuter Wine :\n\n```\nMESA_LOADER_DRIVER_OVERRIDE=crocus\n```\n\n"
    },
    {
      "title": "Désenregistrer les associations de fichiers Wine existantes",
      "level": 3,
      "content": "Par défaut, Wine s'impose comme l'application par défaut pour un grand nombre de formats. Certains (par exemple, vbs ou chm) sont spécifiques à Windows, et les ouvrir avec Wine peut être pratique. Cependant, l'ouverture d'autres formats (par exemple, gif, jpeg, txt, js) dans les simulations de base d'Internet Explorer et du Bloc-notes de Wine peut être ennuyeuse.\n\nLes associations de fichiers de Wine sont définies dans ~/.local/share/applications/ comme fichiers wine-extension-extension.desktop. Supprimez les fichiers correspondant aux extensions que vous voulez désenregistrer. Ou, pour supprimer toutes les extensions de Wine :\n\n```\n$ rm -f ~/.local/share/applications/wine-extension*.desktop\n$ rm -f ~/.local/share/icons/hicolor/*/*/application-x-wine-extension*\n```\n\nEnsuite, supprimez l'ancien cache :\n\n```\n$ rm -f ~/.local/share/applications/mimeinfo.cache\n$ rm -f ~/.local/share/mime/packages/x-wine*\n$ rm -f ~/.local/share/mime/application/x-wine-extension*\n```\n\nEt, mettez à jour le cache :\n\n```\n$ update-desktop-database ~/.local/share/applications\n$ update-mime-database ~/.local/share/mime/\n```\n\nVeuillez noter que Wine créera toujours de nouvelles associations de fichiers et recréera même les associations de fichiers si l'application définit à nouveau les associations de fichiers.\n\n"
    },
    {
      "title": "Empêcher Wine de créer des associations de type de fichier",
      "level": 3,
      "content": "Cette méthode empêche la création d'associations de type de fichier mais conserve la création de fichiers XDG .desktop (que vous pouvez voir par exemple dans les menus).\n\nSi vous voulez empêcher wine de créer des associations de types de fichiers via winecfg, vous devez décocher la case \"Gérer les associations de fichiers\" sous l'onglet Intégration au bureau. Voir la FAQ de Wine\n\nPour effectuer le même changement via le registre, ajoutez la chaîne Enable avec la valeur N sous :\n\n```\nHKEY_CURRENT_USER\\Software\\Wine\\FileOpenAssociations\n```\n\nIl se peut que vous deviez d'abord créer la clé FileOpenAssociations!\n\nPour effectuer cette modification via la ligne de commande, exécutez la commande suivante :\n\n```\n$ wine reg add \"HKEY_CURRENT_USER\\Software\\Wine\\FileOpenAssociations\" /v Enable /d N\n```\n\nSi vous voulez appliquer ceci par défaut pour les nouveaux WINEPREFIXES, éditez /usr/share/wine/wine.inf et ajoutez cette ligne par exemple sous la section [Services] :\n\n```\nHKCU, \"Software\\Wine\\FileOpenAssociations\", \"Enable\",2, \"N\"\n```\n\nPour éviter qu'une mise à jour de paquet ne remplace le fichier modifié, créez un hook pacman pour effectuer le changement automatiquement :\n\n```\n/etc/pacman.d/hooks/stop-wine-associations.hook\n```\n\n```\n[Trigger]\nOperation = Install\nOperation = Upgrade\nType = Path\nTarget = usr/share/wine/wine.inf\n\n[Action]\nDescription = Stopping Wine from hijacking file associations...\nWhen = PostTransaction\nExec = /bin/sh -c '/usr/bin/grep -q \"HKCU,\\\"Software\\\\\\Wine\\\\\\FileOpenAssociations\\\",\\\"Enable\\\",2,\\\"N\\\"\" /usr/share/wine/wine.inf || /usr/bin/sed -i \"s/\\[Services\\]/\\[Services\\]\\nHKCU,\\\"Software\\\\\\Wine\\\\\\FileOpenAssociations\\\",\\\"Enable\\\",2,\\\"N\\\"/g\" /usr/share/wine/wine.inf'\n```\n\nVoir Pacman (Français)#Hooks.\n\n"
    },
    {
      "title": "Exécuter les binaires Windows avec Wine implicitement",
      "level": 3,
      "content": "Le paquet wine installe un fichier binfmt qui vous permettra d'exécuter directement des programmes Windows, par exemple, ./myprogram.exe se lancera comme si vous aviez tapé wine ./myprogram.exe. Le service démarre par défaut au démarrage, si vous n'avez pas redémarré après avoir installé Wine, démarrez systemd-binfmt.service pour l'utiliser immédiatement.\n\n"
    },
    {
      "title": "Double écran avec différentes résolutions",
      "level": 3,
      "content": "Si vous avez des problèmes avec des configurations à double écran et des résolutions d'affichage différentes, il vous manque probablement lib32-libxrandr.\n\nL'installation de lib32-libxinerama peut également résoudre les problèmes de double tête avec Wine (par exemple, boutons et menus d'application non cliquables sur l'écran le plus à droite ou le plus en bas, interface d'application non redessinable dans cette zone, état du curseur de la souris bloqué après avoir quitté la zone d'application).\n\n"
    },
    {
      "title": "Gravure de supports optiques",
      "level": 3,
      "content": "Pour graver des CD ou des DVD, vous devez charger le module du noyau sg.\n\n"
    },
    {
      "title": "Montage correct des images disque",
      "level": 3,
      "content": "Certaines applications vérifient que le disque se trouve dans le lecteur. Elles peuvent ne vérifier que les données, auquel cas il peut être suffisant de configurer le chemin correspondant comme étant un lecteur de CD-ROM dans winecfg. Cependant, d'autres applications rechercheront un nom et/ou un numéro de série, auquel cas l'image doit être montée avec ces propriétés spéciales.\n\nCertains outils de lecteur virtuel ne gèrent pas ces métadonnées, comme les lecteurs virtuels basés sur des fusibles (Acetoneiso par exemple). CDemu les traitera correctement.\n\n"
    },
    {
      "title": "Afficher l'overlay FPS dans les jeux",
      "level": 3,
      "content": "Wine dispose d'un moniteur de FPS intégré qui fonctionne pour toutes les applications graphiques si la variable d'environnement WINEDEBUG=fps est définie. Le taux d'images par seconde est alors affiché dans le fichier stdout. Vous pouvez afficher le FPS en haut de la fenêtre grâce à osd_cat du paquet xosd. Voir winefps.sh pour un script d'aide.\n\n"
    },
    {
      "title": "Exécuter Wine sous un compte utilisateur distinct",
      "level": 3,
      "content": "Il peut être souhaitable d'exécuter Wine sous un compte utilisateur spécifiquement créé afin de réduire les problèmes d'accès des applications Windows à votre répertoire personnel.\n\nTout d'abord, créez un compte utilisateur pour Wine :\n\n```\n# useradd -m -s /bin/bash wineuser\n```\n\nPassez maintenant à un autre TTY et démarrez votre X WM ou DE comme vous le feriez normalement ou continuez à lire...\n\nEnsuite, afin d'ouvrir les applications Wine en utilisant ce nouveau compte utilisateur, vous devez ajouter le nouvel utilisateur à la liste des permissions du serveur X :\n\n```\n$ xhost +SI:localuser:wineuser\n```\n\nEnfin, vous pouvez exécuter Wine via la commande suivante, qui utilise env pour lancer Wine avec les variables d'environnement qu'il attend :\n\n```\n$ sudo -u wineuser env HOME=/home/wineuser USER=wineuser USERNAME=wineuser LOGNAME=wineuser wine arguments\n```\n\nIl est possible d'automatiser le processus d'exécution des applications Windows avec Wine via cette méthode en utilisant un script shell comme suit :\n\n```\n/usr/local/bin/runaswine\n```\n\n```\n#!/bin/sh\nxhost +SI:localuser:wineuser\nsudo -u wineuser env HOME=/home/wineuser USER=wineuser USERNAME=wineuser LOGNAME=wineuser wine \"$@\"\n```\n\nLes applications Wine peuvent ensuite être lancées via :\n\n```\n$ runaswine \"C:\\path\\to\\application.exe\"\n```\n\nAfin de ne pas se voir demander un mot de passe à chaque fois que Wine est lancé en tant qu'autre utilisateur, l'entrée suivante peut être ajoutée au fichier sudoers : mainuser ALL=(wineuser) NOPASSWD : ALL. Voir Sudo (Français)#Configuration pour plus d'informations.\n\nIl est recommandé d'exécuter winecfg en tant qu'utilisateur Wine et de supprimer tous les raccourcis pour les répertoires en dehors du répertoire personnel de l'utilisateur Wine dans la section \"Desktop Integration\" de la fenêtre de configuration afin qu'aucun programme exécuté avec Wine n'ait accès en lecture à un fichier en dehors du répertoire personnel de l'utilisateur spécial.\n\nGardez à l'esprit que l'audio sera probablement non fonctionnel dans les programmes Wine qui sont exécutés de cette façon si PulseAudio est utilisé. Voir PulseAudio/Examples#Allowing multiple users to share a PulseAudio daemon pour des informations sur l'autorisation de l'utilisateur Wine à accéder au daemon PulseAudio de l'utilisateur principal.\n\n"
    },
    {
      "title": "Répertoire temporaire sur tmpfs",
      "level": 3,
      "content": "Pour empêcher Wine d'écrire ses fichiers temporaires sur un disque physique, on peut définir un emplacement alternatif, comme tmpfs. Supprimez le répertoire par défaut de Wine pour les fichiers temporaires et créez un lien symbolique :\n\n```\n$ rm -r ~/.wine/drive_c/users/$USER/Temp ~/.wine/drive_c/windows/temp\n$ ln -s /tmp/ ~/.wine/drive_c/users/$USER/Temp\n$ ln -s /tmp/ ~/.wine/drive_c/windows/temp\n```\n\n"
    },
    {
      "title": "Empêcher l'installation de Mono/Gecko",
      "level": 3,
      "content": "Si Gecko et/ou Mono ne sont pas présents sur le système ni dans le préfixe de Wine, Wine demandera de les télécharger depuis Internet. Si vous n'avez pas besoin de Gecko et/ou Mono, vous pouvez désactiver cette boîte de dialogue, en définissant la variable d'environnement WINEDLLOVERRIDES à mscoree=d;mshtml=d.\n\n"
    },
    {
      "title": "Vulkan",
      "level": 3,
      "content": "Le chargeur ICD par défaut de Wine Vulkan fonctionne bien pour la plupart des applications, mais ne prends pas en charge les fonctionnalités avancées, comme les couches Vulkan. Pour utiliser ces fonctionnalités, vous devez installer le SDK Vulkan officiel, voir les étapes 2-4 sur la page GitHub de l'auteur des patches Vulkan originaux [2].\n\n"
    },
    {
      "title": "Supprimer les liens de fichiers Wine",
      "level": 3,
      "content": "Pour des raisons de sécurité, il peut être utile de supprimer les raccourcis Wine préinstallées afin que les applications Windows ne puissent pas être lancées directement à partir d'un gestionnaire de fichiers ou d'un navigateur (Firefox propose d'ouvrir les fichiers EXE directement avec Wine !) Si vous voulez faire cela, vous pouvez ajouter ce qui suit à la section [options] de /etc/pacman.conf\n\n```\nNoExtract = usr/lib/binfmt.d/wine.conf\nNoExtract = usr/share/applications/wine.desktop\n```\n\n"
    },
    {
      "title": "WineASIO",
      "level": 3,
      "content": "Si vous avez besoin d'un support audio professionnel sous wine, vous pouvez utiliser wineasioAUR qui fournit une interface ASIO pour wine que vous pouvez ensuite utiliser avec JACK.\n\nPour utiliser wineasio, vous devez vous ajouter au groupe d'utilisateurs realtime.\n\nEnsuite, vous devez enregistrer wineasio dans le préfixe de Wine que vous souhaitez. Enregistrez la version 32 bits et/ou 64 bits selon vos besoins :\n\n```\n$ regsvr32 /usr/lib32/wine/i386-windows/wineasio.dll\n$ wine64 regsvr32 /usr/lib/wine/x86_64-windows/wineasio.dll\n```\n\n"
    },
    {
      "title": "Dépannage",
      "level": 2,
      "content": "Consultez Guide de l'utilisateur de Wine et la FAQ de Wine (en particulier la section Dépannage) pour des conseils généraux.\n\nConsultez également la Wine AppDB pour obtenir des conseils sur des applications spécifiques.\n\n"
    },
    {
      "title": "Problèmes liés à Xwayland",
      "level": 3,
      "content": "Si vous utilisez Wine sous Xwayland, vous pouvez activer l'option \"Emulation d'un bureau virtuel\" dans l'onglet Graphique de winecfg, afin d'éviter les problèmes de :\n\n- scintillement ;\n- mauvais emplacement de la fenêtre\n- mauvais emplacement du curseur de la souris et clics ;\n- détection du clavier.\n\n"
    },
    {
      "title": "La saisie au clavier ne fonctionne pas",
      "level": 3,
      "content": "Cela peut être dû au fait que le gestionnaire de fenêtres ne change pas le focus. Dans l'onglet Graphiques de winecfg, désactivez les options 'Autoriser le gestionnaire de fenêtres…', ou définissez le mode fenêtré avec 'Emuler un bureau virtuel'.\n\n- Certains suggèrent de basculer tous les paramètres de fenêtre, de cliquer sur Appliquer, puis de les modifier à nouveau. Si cela ne fonctionne pas, essayez ce qui précède.\n\nSi le clavier ne fonctionne pas après avoir défocalisé l'application, essayez de modifier le registre :\n\n- Sous HKEY_CURRENT_USER\\Software\\Wine\\X11 Driver, ajoutez une chaîne de valeur UseTakeFocus et mettez-la à N.\n- Au lieu de cela, vous pouvez utiliser winetricks pour définir cette valeur: $ winetricks usetakefocus=n\n\n```\n$ winetricks usetakefocus=n\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Page d'accueil de Wine\n- Wine Wiki\n- Wine Application Database (AppDB) - Informations sur l'exécution d'applications Windows spécifiques (problèmes connus, évaluations, guides, etc. adaptés à des applications spécifiques).\n- Wine Forums - Un endroit idéal pour poser des questions \"après\" avoir consulté la FAQ et l'AppDB.\n- Gentoo:Wine\n- Darling - un projet similaire pour les logiciels MacOS\n- WineASIO - Page GitHub du projet WineASIO avec de plus amples informations.\n\n"
    }
  ]
}