{
  "title": "Wireshark (Español)",
  "url": "https://wiki.archlinux.org/title/Wireshark_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-10-06** \n\nWireshark es un analizador de paquetes gratuito y de código abierto. Se utiliza para la resolución de problemas de red, análisis, desarrollo de software y protocolo de comunicaciones, y con fines educativos.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale el paquete wireshark-qt para la interfaz gráfica de Wireshark o wireshark-cli para usar solo la CLI tshark.\n\n"
    },
    {
      "title": "Capturar privilegios",
      "level": 2,
      "content": "No ejecute Wireshark como root, es inseguro. Wireshark ha implementado la separación de privilegios [1].\n\nEl script de instalación wireshark-cli establece la captura de paquetes capabilities en el ejecutable /usr/bin/dumpcap.\n\n/usr/bin/dumpcap solo puede ser ejecutado por root y miembros del grupo wireshark, por lo tanto, para usar Wireshark como usuario normal, debe agregar su usuario al grupo del usuario wireshark (consulte Users and groups (Español)#Administración de grupos).\n\n"
    },
    {
      "title": "Algunas técnicas de captura",
      "level": 2,
      "content": "Hay varias maneras diferentes de capturar exactamente lo que está buscando en Wireshark, aplicando filtros de captura o filtros de visualización.\n\n"
    },
    {
      "title": "Filtrar paquetes TCP",
      "level": 3,
      "content": "Si desea ver todos los paquetes TCP actuales, escriba tcp en la barra «Filter» o en la CLI, introduzca:\n\n```\n$ tshark -f \"tcp\"\n```\n\n"
    },
    {
      "title": "Filtrar paquetes UDP",
      "level": 3,
      "content": "Si desea ver todos los paquetes TCP actuales, escriba udp en la barra «Filter» o en la CLI, introduzca:\n\n```\n$ tshark -f \"udp\"\n```\n\n"
    },
    {
      "title": "Filtrar paquetes a una dirección IP específica",
      "level": 3,
      "content": "- Si desea ver todo el tráfico que va a una dirección específica, introduzca el filtro de visualización ip.dst == 1.2.3.4, reemplazando 1.2.3.4 con la dirección IP a la que se está enviando al tráfico saliente.\n- Si desea ver todo el tráfico entrante para una dirección específica, introduzca el filtro de visualización ip.src == 1.2.3.4, reemplazando 1.2.3.4 con la dirección IP a la que se está enviando al tráfico entrante.\n- Si desea ver todo el tráfico entrante y saliente para una dirección específica, introduzca el filtro de visualización ip.addr == 1.2.3.4, reemplazando 1.2.3.4 con la dirección IP relevante.\n\n"
    },
    {
      "title": "Excluir paquetes de una dirección IP específica",
      "level": 3,
      "content": "```\nip.addr != 1.2.3.4\n```\n\n"
    },
    {
      "title": "Filtrar paquetes a la LAN",
      "level": 3,
      "content": "Para ver solo el tráfico LAN, sin el tráfico de Internet, ejecute:\n\n```\nip.src==192.168.0.0/16 and ip.dst==192.168.0.0/16\n```\n\n"
    },
    {
      "title": "Filtrar paquetes por puerto",
      "level": 3,
      "content": "Vea todo el tráfico en dos puertos o más:\n\n```\ntcp.port==80||tcp.port==3306\ntcp.port==80||tcp.port==3306||tcp.port==443\n```\n\n"
    }
  ]
}