{
  "title": "Wireshark (Português)",
  "url": "https://wiki.archlinux.org/title/Wireshark_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "O Wireshark é um analisador de pacotes livre e de código aberto. Ele é usado para solucionar de problemas de rede, análise, desenvolvimento de software e protocolo de comunicação e educação.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote wireshark-qt para a GUI do Wireshark ou wireshark-cli para apenas a CLI tshark.\n\n"
    },
    {
      "title": "Privilégios de captura",
      "level": 2,
      "content": "Não execute Wireshark como root, é inseguro. O Wireshark implementou a separação de privilégios.[1]\n\nO script de instalação do wireshark-cli define as capacidades de captura de pacotes no executável /usr/bin/dumpcap.\n\n/usr/bin/dumpcap só pode ser executado como root e membros do grupo wireshark, de forma que, para usar Wireshark como um usuário normal, você precisa adicionar seu usuário ao grupo de usuários wireshark (Veja Usuários e grupos#Gerenciamento de grupo).\n\n"
    },
    {
      "title": "Algumas técnicas de captura",
      "level": 2,
      "content": "Existem várias maneiras de capturar exatamente o que você está procurando no Wireshark, aplicando filtros de captura ou filtros de exibição.\n\n"
    },
    {
      "title": "Filtrando pacotes TCP",
      "level": 3,
      "content": "Se quiser ver todos os pacotes TCP atuais, digite tcp na barra \"Filter\" ou na CLI, digite:\n\n```\n$ tshark -f \"tcp\"\n```\n\n"
    },
    {
      "title": "Filtrando pacotes UDP",
      "level": 3,
      "content": "Se quiser ver todos os pacotes UDP atuais, digite udp na barra \"Filter\" ou na CLI, digite:\n\n```\n$ tshark -f \"udp\"\n```\n\n"
    },
    {
      "title": "Filtrar pacotes para um endereço IP específico",
      "level": 3,
      "content": "- Se você quiser ver todo o tráfego indo para um endereço específico, digite o filtro de exibição ip.dst == 1.2.3.4, substituindo 1.2.3.4 pelo endereço IP ao qual o tráfego de saída está sendo enviado.\n- Se você quiser ver todo o tráfego de entrada para um endereço específico, digite o filtro de exibição ip.src == 1.2.3.4, substituindo 1.2.3.4 pelo endereço IP ao qual o tráfego de entrada está sendo enviado.\n- Se você quiser ver todo o tráfego de entrada ou saída para um endereço específico, digite o filtro de exibição ip.addr == 1.2.3.4, substituindo 1.2.3.4 pelo endereço IP relevante.\n\n"
    },
    {
      "title": "Excluir pacotes de um endereço IP específico",
      "level": 3,
      "content": "```\nip.addr != 1.2.3.4\n```\n\n"
    },
    {
      "title": "Filtrar pacotes para LAN",
      "level": 3,
      "content": "Para ver apenas tráfego de LAN, nenhum tráfego de internet, execute\n\n```\nip.src==192.168.0.0/16 and ip.dst==192.168.0.0/16\n```\n\n"
    },
    {
      "title": "Filtrar pacotes por porta",
      "level": 3,
      "content": "Veja todo tráfego em duas portas ou mais:\n\n```\ntcp.port==80||tcp.port==3306\ntcp.port==80||tcp.port==3306||tcp.port==443\n```\n\n"
    }
  ]
}