{
  "title": "Wireshark (Русский)",
  "url": "https://wiki.archlinux.org/title/Wireshark_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Wireshark — бесплатная программа-анализатор сетевых пакетов с открытым исходным кодом. Она используется для решения проблем в сети, анализа, разработки программного обеспечения и протоколов связи, а также для обучения.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет wireshark-qt, который предоставляет графический интерфейс. Версия для командной строки (tshark(1)) доступна в пакете wireshark-cli.\n\ntermshark — альтернативная версия для командной строки.\n\n"
    },
    {
      "title": "Разрешение на захват пакетов",
      "level": 2,
      "content": "Не запускайте Wireshark от имени root; это небезопасно. Wireshark позволяет разделить привилегии: пользовательский интерфейс запускается от имени обычного пользователя, в то время как утилита dumpcap запускается от имени root. [1]\n\nУстановочный скрипт пакета wireshark-cli настраивает привилегии для исполняемого файла /usr/bin/dumpcap.\n\n/usr/bin/dumpcap может выполняться только пользователем root и пользователями из группы wireshark, поэтому для использования Wireshark от имени обычного пользователя добавьте себя в группу wireshark.\n\n"
    },
    {
      "title": "Методы анализа захваченных пакетов",
      "level": 2,
      "content": "В Wireshark есть много разных способов захватить в точности то, что вам нужно. Для этого используются фильтры захвата (capture filters) и дисплейные фильтры (display filters).\n\n"
    },
    {
      "title": "Фильтрация TCP-пакетов",
      "level": 3,
      "content": "Чтобы посмотреть все текущие TCP-пакеты, введите tcp в фильтр захвата. В командной строке:\n\n```\n$ tshark -f \"tcp\"\n```\n\n"
    },
    {
      "title": "Фильтрация UDP-пакетов",
      "level": 3,
      "content": "Чтобы посмотреть все текущие UDP-пакеты, введите udp в фильтр захвата. В командной строке:\n\n```\n$ tshark -f \"udp\"\n```\n\n"
    },
    {
      "title": "Фильтрация пакетов с определённым IP-адресом",
      "level": 3,
      "content": "- Для просмотра трафика, отправляемый на определённый адрес, используйте следующий дисплейный фильтр: ip.dst == 1.2.3.4.\n- Для просмотра трафика, отправляемого с определённого адреса: ip.src == 1.2.3.4.\n- Для просмотра входящего и исходящего трафика, связанного с указанным адресом: ip.addr == 1.2.3.4.\n\n"
    },
    {
      "title": "Исключение пакетов с определённым IP-адресом",
      "level": 3,
      "content": "```\nip.addr != 1.2.3.4\n```\n\n"
    },
    {
      "title": "Фильтрация пакетов локальной сети",
      "level": 3,
      "content": "Чтобы посмотреть только локальный трафик, не связанный с интернетом, можно использовать такой дисплейный фильтр:\n\n```\n(ip.src==10.0.0/8 AND ip.dst==10.0.0/8) OR (ip.src==172.16.0.0/12 AND ip.dst==172.16.0.0/12) OR (ip.src==192.168.0.0/16 and ip.dst==192.168.0.0/16)\n```\n\nОн покажет только трафик в пределах локальных сетей.\n\n"
    },
    {
      "title": "Фильтрация пакетов с определённым портом",
      "level": 3,
      "content": "Просмотр всех пакетов с указанными TCP-портами:\n\n```\ntcp.port==80||tcp.port==3306\ntcp.port==80||tcp.port==3306||tcp.port==443\n```\n\n"
    },
    {
      "title": "Захват в фоне с помощью dumpcap",
      "level": 3,
      "content": "dumpcap — компонент Wireshark, используемый для захвата пакетов без какого-либо графического интерфейса. В сочетании с tmux он позволяет захватывать пакеты в фоновом сеансе.\n\nДля просмотра всех доступных параметров запустите dumpcap с флагом -h.\n\nСледующий пример захватывает пакеты из кольцевого буфера. Он захватывает двадцать файлов .pcap размером 100 МБ каждый, заменяя самый старый файл двадцать первым и так далее. Это позволяет осуществлять непрерывный захват без исчерпания дискового пространства.\n\n```\n# dumpcap -i 1 -b filesize:100000 -b files:20 -w mycapture.pcapng\n```\n\n- -i − номер интерфейса (как указано в dumpcap -D)\n\n- -b filesize: − размер файла (в килобайтах), при достижении которого начнётся запись нового файла .pcap\n\n- -b files: − максимальное число сохраняемых файлов\n\n- -w − запись захвата в файл mycaptureidentifier.pcapng\n\n"
    }
  ]
}