{
  "title": "Wolfenstein: Enemy Territory (Italiano)",
  "url": "https://wiki.archlinux.org/title/Wolfenstein:_Enemy_Territory_(Italiano)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Wolfenstein®: Enemy Territory è un videogioco sparatutto in prima persona del 2004 sviluppato da Splash Damage e pubblicato da Activision. È un gioco standalone basato sul motore di gioco di Return to Castle Wolfenstein, ma con una nuova modalità multiplayer incentrata sulla squadra. Video d'inizio\n\n"
    },
    {
      "title": "Installazione",
      "level": 2,
      "content": "Prima di far partire l'installatore dovete abilitare il software multilib e installare il driver grafico 32bit OpenGL per la vostra scheda grafica, una volta fatto questo potete scaricarlo dal sito ufficiale e installarlo con sudo.\n\n"
    },
    {
      "title": "Il gioco parte senza audio",
      "level": 3,
      "content": "Wolfenstein: Enemy Territory è stato sviluppato in un periodo in cui OSS era il sistema audio ufficiale di Linux, ma successivamente è stato sostituito da ALSA. Di conseguenza sui sistemi di adesso partirà senza audio. Questo problema può essere risolto seguendo questi passaggi:\n\n1. Installare alsa-oss e caricare questi moduli tramite systemd: snd-seq-oss snd-pcm-oss snd-mixer-oss.\n1. Usare questo script per direzionare l'audio del gioco:\n\n```\n$ sudo nano /usr/bin/enemyterritoryscript\n```\n\n```\n#! /bin/sh\necho \"et.x86 0 0 direct\" > /proc/asound/card0/pcm0p/oss\necho \"et.x86 0 0 disable\" > /proc/asound/card0/pcm0c/oss\n```\n\nIn alcuni casi è necessario anche modificare il dispositivo di uscita audio nel gioco, quindi editare la propria etconfig.cfg e modificare i seguenti parametri:\n\n```\n$ nano ~/.etwolf/etmain/profiles/NIKNAME/etconfig.cfg\n```\n\n```\nseta snddevice \"/dev/dsp\"\n```\n\nAd esempio, per utilizzare la scheda audio numero due impostare:\n\n```\nseta snddevice \"/dev/dsp2\"\n```\n\n"
    },
    {
      "title": "Manca il file etkey",
      "level": 3,
      "content": "Poiché PunkBuster ha abbandonato il supporto per Wolfenstein: Enemy Territory, non c'è modo di ottenere un nuovo file etkey da PunkBuster e senza questo file non si può giocare su nessun server PunkBuster. Il file può comunque essere generato manualmente da http://etkey.net/, da dove si dovrà scaricare per poi salvarlo nella cartella ~/.etwolf/etmain.\n\n"
    },
    {
      "title": "Disabilitare l'accelerazione del mouse",
      "level": 3,
      "content": "Non basta avere un profilo flat (senza accelerazione) nel ambiente desktop, bisogna anche settare questo parametro nella propria etconfig.cfg.\n\n```\n$ nano ~/.etwolf/etmain/profiles/NIKNAME/etconfig.cfg\n```\n\n```\nseta in_dgamouse \"2\"\n```\n\n"
    },
    {
      "title": "Allocazione della memoria",
      "level": 3,
      "content": "Per il corretto funzionamento del gioco editare la propria etconfig.cfg e assegnare i seguenti parametri.\n\n```\n$ nano ~/.etwolf/etmain/profiles/NIKNAME/etconfig.cfg\n```\n\n```\nseta com_hunkMegs \"192\"\nseta com_soundMegs \"160\"\nseta com_zoneMegs \"64\"\n```\n\n"
    },
    {
      "title": "Impostare risoluzione video",
      "level": 3,
      "content": "Per impostare la corretta risoluzione video del gioco editare la propria etconfig.cfg e modificare i seguenti parametri. Ad esempio:\n\n```\n$ nano ~/.etwolf/etmain/profiles/NIKNAME/etconfig.cfg\n```\n\n```\nseta r_customheight \"1080\"\nseta r_customwidth \"1920\"\nseta r_mode \"-1\" unsafe\n```\n\n"
    },
    {
      "title": "FPS bassi",
      "level": 3,
      "content": "Se i vostri FPS sono bassi e non stabili, impostate questi parametri nella etconfig.cfg.\n\n```\n$ nano ~/.etwolf/etmain/profiles/NIKNAME/etconfig.cfg\n```\n\n```\nseta com_maxfps \"125\" (se possibile anche 200)\nseta r_primitives \"2\"\nseta cg_atmosphericeffects \"0\"\nseta cg_wolfparticles \"0\"\nseta r_fastsky \"1\"\nseta r_picmip \"3\"\n```\n\n"
    },
    {
      "title": "Avvio et con la mod etpro",
      "level": 3,
      "content": "Per avviare Wolfenstein: Enemy Territory direttamente con la mod etpro, eseguire il seguente comando nel terminale:\n\n```\net +set fs_game etpro\n```\n\n"
    },
    {
      "title": "Problemi irrisolti con Wayaland",
      "level": 3,
      "content": "Con Wayland si incorre in svariati problemi che non riesco a risolvere, come ad esempio il mancato input della tastiera o l'impossibilità di avere il mouse senza accelerazione in gioco. Per questo consiglio l'uso di X11 per giocare a Wolfenstein: Enemy Territory.\n\n"
    },
    {
      "title": "Un solo canale audio",
      "level": 3,
      "content": "Purtroppo con questo metodo non è possibile giocare e allo stesso tempo usare un software per comunicare in quanto OSS consente un solo canale audio.\n\n"
    },
    {
      "title": "ET: Legacy",
      "level": 2,
      "content": "Un altro metodo per giocare è utilizzare il client ET: Legacy. (Consiglio di installare la versione 64-bit.)\n\nE' un progetto open source basato sul codice di Wolfenstein: Enemy Territory che è stato rilasciato nel 2010 sotto i termini della licenza GPLv3. A differenza del client originale, basta installarlo e funziona senza particolari attenzioni. Non è compatibile con la mod etpro, ma è possibile giocare, anche a livello competitivo la nuova mod Legacy. A differenza di Wolfenstein: Enemy Territory classico, è in continuo sviluppo, con periodiche correzioni di bug, miglioramenti grafici, della qualità di gioco e della compatibilità.\n\n"
    },
    {
      "title": "Giocare a livello competitivo",
      "level": 3,
      "content": "Per giocare a livello competitivo esiste ET: Legacy Competitive, un server Discord dove ci si organizza per degli scontri. Entra in chiamata con cuffie e microfono assieme ai tuoi compagni di squadra!\n\n"
    }
  ]
}