{
  "title": "WPS Office (Español)",
  "url": "https://wiki.archlinux.org/title/WPS_Office_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **2019-03-26** \n\nWPS Office para Linux es una alternativa eficiente, estable y compatible para Microsoft Office con interfaz de usuario moderna que admite transferencia de archivos entre dispositivos, copia de seguridad en la nube. La suite contiene Writer, Presentation y Spreadsheet.\n\n"
    },
    {
      "title": "Instalación",
      "level": 2,
      "content": "Instale wps-officeAUR de AUR\n\n- opcionalmente puede instalar las fuentes que necesita WPS: ttf-wps-fontsAUR\n\n"
    },
    {
      "title": "Idioma de la interface",
      "level": 3,
      "content": "Para cambiar el idioma de la interface de WPS puede instalar wps-office-mui-frAUR para Francés, wps-office-mui-ruAUR para Ruso, etc. Después establezca su idioma al seleccionar Review->Spell Check->Set Language escoger su idioma y reiniciar WPS.\n\n"
    },
    {
      "title": "Cuál es la órden para iniciar WPS Office",
      "level": 3,
      "content": "wps,et,wpp es el comando para iniciar WPS Writer, WPS Spreadsheet y WPS Presentation\n\n"
    },
    {
      "title": "Las fórmulas no se muestran de forma normal",
      "level": 3,
      "content": "El desplegado de la mayoría de las fórmulas Matemáticas necesitan las fuentes que se muestran a continuación:\n\n```\nsymbol.ttf webdings.ttf wingding.ttf wingdng2.ttf wingdng3.ttf monotypesorts.ttf MTExtra.ttf\n```\n\nttf-wps-fontsAUR en AUR contiene todas éstas fuentes excepto monotypesorts.ttf, puede instarla directamente.\n\n"
    },
    {
      "title": "Archivo de Microsoft Office en KDE es reconozido como Zip",
      "level": 3,
      "content": "Después de instalar WPS Office, los archivos de Microsoft Office serán reconocidos como zip, y no se pueden abrir con WPS, puede cambiar éste tipo de reconocimiento al eliminar el archivo mime en /usr/share/packages/:\n\n```\nsudo rm /usr/share/mime/packages/wps-office-*.xml\nsudo update-mime-database /usr/share/mime\n```\n\n"
    },
    {
      "title": "Framework de método de introducción Fcitx no puede introducir en WPS",
      "level": 3,
      "content": "Agregue las siguientes líneas a /usr/bin/wps /usr/bin/et /usr/bin/wpp de manera separada para añadir fcitx a Writer, Spreadsheet y Presentation:\n\n```\nexport XMODIFIERS=\"@im=fcitx\"\nexport QT_IM_MODULE=\"fcitx\"\n```\n\n"
    },
    {
      "title": "Incorrecta integración con temas oscuros de KDE Plasma",
      "level": 3,
      "content": "Ejecuta cualquiera de las aplicaciones con la siguiente variable de entorno:\n\n```\nenv GTK2_RC_FILES=/usr/share/themes/Breeze/gtk-2.0/gtkrc et -style gtk+\n```\n\nEl tema Breeze puede ser reemplazado por cualquier tema claro, como por ejemplo, Adwaita, Breath, etc.\n\nDespués de correr la aplicación, WPS mostrará una advertencia: 'Unable to open \"gtk+\"'. Ignorala y presiona Ok.\n\n"
    },
    {
      "title": "Véase también",
      "level": 2,
      "content": "- WPS Office Community\n- WPS For Linux\n\n"
    }
  ]
}