{
  "title": "Writing Short Article Names",
  "url": "https://wiki.archlinux.org/title/Writing_Short_Article_Names",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Help:Effective use of headers\n- Help:Writing article introductions\n- Help:Editing\n- Help:Style\n- Help:i18n\n\nArticle naming is one of the most important tasks for wiki writers and editors. This article is a complete guideline on choosing appropriate article names, and also presents ArchWiki writers and editors with some issues to consider when naming their articles.\n\n"
    },
    {
      "title": "About article names",
      "level": 2,
      "content": "Article names serve two purposes. They are identifiers of the wiki content on the ArchWiki site. Also, they are means by which readers identify the content. Therefore, an article name has to be unique and descriptive.\n\nSometimes, article names reflect the type of article content, and also offer additional information like language in which the article was written.\n\n"
    },
    {
      "title": "Descriptive names",
      "level": 2,
      "content": "Names should be as specific as possible, and they should reflect the article scope.\n\nDocumentation projects are seldom like software/hardware reviews commonly seen in newspapers and news sites. Documentation is usually read when some problem arises, or some other specific need has to be met. Therefore, quick identification of those needs and swift solution is of utmost importance. For improved readability and faster access to information, article names (and, therefore, their titles) should be as descriptive and specific as the article scope permits.\n\n"
    },
    {
      "title": "Example",
      "level": 3,
      "content": "Titles like \"Boost pacman\" may be misleading for most readers. Some of the readers may be looking to boost some aspect of pacman, and that aspect may not necessarily be the aspect described in the article. Therefore, the article name must be as specific as possible without being too long to quickly scan. Such an article may be renamed to read \"How to improve pacman download speed using wget, snarf, and lftp\".\n\n"
    },
    {
      "title": "Allowing for article enhancement",
      "level": 2,
      "content": "Names should be general enough to allow for future enhancement of the article contents.\n\nIn order to allow room for future edits and enhancements, an article's name sometimes needs to be less specific. Of course, making article names less specific just for the sake of shortening it is not a good idea. On the other hand, if you think you have covered all the bases, and that no future edits will enhance the article's scope, make your article's name as specific as possible.\n\n"
    },
    {
      "title": "Example",
      "level": 3,
      "content": "Let us go back to the previous example. The new title of the article is \"Improve pacman download speed using wget, snarf, and lftp\". However, some day, new download managers may emerge that would replace or become an alternative to wget, snarf, and/or lftp. This calls for a more generic title, something like: \"How to improve pacman download speed using alternative download managers\".\n\n"
    },
    {
      "title": "Shorten article names",
      "level": 2,
      "content": "Names should be as short as possible.\n\nMaking article names short is important in order to allow quick scanning of article listings. Many people use the browsing technique when reading wikis, so you do not want to waste their time by writing article names that are miles long. Also, shorter names tend to sound more professional.\n\nHereinafter, we will use this name as an example: \"How to improve pacman download speed using alternative download managers\".\n\nWe will cover a few techniques that will help us shorten the name. There are probably many more techniques that do not apply to this particular example, but you will still get insight into the concept of title editing.\n\n"
    },
    {
      "title": "Avoid using question form",
      "level": 3,
      "content": "Instead of saying \"How to improve\", simply say \"Improve\".\n\nNow compare the two:\n\n- \"How to improve pacman download speed using alternative download managers\"\n- \"Improve pacman download speed using alternative download managers\"\n\n"
    },
    {
      "title": "Rewording long parts",
      "level": 3,
      "content": "The text \"Improve pacman download speed\" is rather long. Instead, we will say \"Speed up pacman download\".\n\nNow compare:\n\n- \"Improve pacman download speed using alternative download managers\"\n- \"Speed up pacman download using alternative download managers\"\n\n"
    },
    {
      "title": "Avoid fancy words",
      "level": 3,
      "content": "Fancy words (like \"alternative\" in our example) are not only fancy; they are used less often than ordinary words, and thus tend to be longer. It is well known that words that are used regularly are in most cases shorter, so try to find an ordinary alternative for your words.\n\nInstead of saying \"alternative\", you may say \"other\".\n\nCompare the two versions:\n\n- \"Speed up pacman download using alternative download managers\"\n- \"Speed up pacman download using other download managers\"\n\n"
    },
    {
      "title": "Deviating from formal technical expressions",
      "level": 3,
      "content": "This may be frowned upon by some of the more technically oriented users, but most people would not mind at all. Avoid technical terms if that makes your article names shorter.\n\nInstead of saying \"download managers\", you may say \"downloaders\".\n\nCompare:\n\n- \"Speed up pacman download using other download managers\"\n- \"Speed up pacman download using other downloaders\"\n\n"
    },
    {
      "title": "Review the result",
      "level": 3,
      "content": "Do not get too excited yet. We still need to review the two titles and see if they still communicate the same meaning.\n\n- \"How to improve pacman download speed using alternative download managers\"\n- \"Speed up pacman download using other downloaders\"\n\nOkay, we see the end result is a much shorter article name, but what about its meaning? Well, it certainly seems like we did a good job. But now we have a different problem. pacman is not a downloader; both \"alternative download managers\" and \"other downloaders\" imply that pacman is a downloader, which is not what we want. We need to change the meaning by saying \"external downloaders\".\n\nCompare:\n\n- \"How to improve pacman download speed using alternative download managers\"\n- \"Speed up pacman download using other downloaders\"\n- \"Speed up pacman download using external downloaders\"\n\n"
    },
    {
      "title": "Multi-language articles",
      "level": 2,
      "content": "Non-English names are required to have a language identifier.\n\nTo facilitate administration and inter-language linking, non-English articles should use titles of the form \"Title in English (Language)\" where \"Language\" is the localized spelling of said language. A redirect with a localized title can and should be added for convenience. See Help:i18n for details.\n\n"
    },
    {
      "title": "Example",
      "level": 3,
      "content": "For example, if you have an article called pacman, you would call the Italian translation pacman (Italiano), the Korean translation pacman (한국어), and the Serbian translation pacman (Српски).\n\n"
    }
  ]
}