{
  "title": "Wvdial от пользователя",
  "url": "https://wiki.archlinux.org/title/Wvdial_%D0%BE%D1%82_%D0%BF%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8F",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "WvDial — программа дозвона, работающая по сетевому протоколу PPP: она устанавливает соединение с модемом и запускает ppp для подключения к Интернету.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет wvdial.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "При запуске wvdial сперва загружает свою конфигурацию из /etc/wvdial.conf и ~/.wvdialrc. Если /etc/wvdial.conf отсутствует, то для его создания проще всего использовать встроенную утилиту конфигурации wvdialconf:\n\n```\n# wvdialconf /etc/wvdial.conf\n```\n\nОна помогает в создании файла конфигурации, необходимого wvdial. wvdialconf обнаруживает ваш модем и автоматически заполняет Modem, Baud, записывает правильную строку инициализации (см. опции Init) и создаёт или обновляет файл конфигурации wvdial (/etc/wvdial.conf) на основе этой информации.\n\nМожно безопасно запускать wvdialconf, если файл конфигурации уже существует. В таком случае меняются только опции Modem, Baud, Init и Init2 в разделе [Dialer Defaults] и только в случае успешного автоматического обнаружения.\n\nПосле заполнения информации для входа, wvdial должен заработать. Можете переходить к следующему разделу. Для провайдеров USB модемов, которые требуют определённых строк Init и комбинаций логин/пароль, mkwvconf-gitAUR может помочь в создании конфигурации wvdial (на основе пакета mobile-broadband-provider-info-gitAUR).\n\nОбычно /etc/wvdial.conf выглядит примерно так после настройки пользователем:\n\n```\n[Dialer Defaults]\nInit1 = ATZ\nInit2 = ATQ0 V1 E1 S0=0 &C1 &D2 +FCLASS=0\nModem Type = Analog Modem\nISDN = 0\nModem = /dev/ttyUSB2\nBaud = 9600\n\n[Dialer thenet]\nPhone = *99***1#\nUsername = thenetuser\nPassword = thenetpw\n; Username = 9180****** (Если ваш провайдер не использует имя пользователя)\n; Password = 9180****** (Если ваш провайдер не использует пароль)\nStupid Mode = 1\nBaud = 460800\nInit3 = AT+CGDCONT=1,\"IP\",\"apn.thenet.net\"\n\n[Dialer mypin]\nInit4 = AT+CPIN=1234\n```\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Существует несколько различных способов дать пользователям возможность использовать wvdial для создания ppp-соединения. Этот документ описывает три различных способа, отличающиеся друг от друга сложностью использования и степенями безопасности.\n\nwvdial следует запускать с правами root следующей командой:\n\n```\n# wvdial опция\n```\n\nОставьте опцию пустой, если не добавляли разделов или если /etc/wvdial.conf был создан автоматически.\n\n```\n# wvdial\n```\n\n"
    },
    {
      "title": "suid",
      "level": 3,
      "content": "Note: **любой пользователь может запустить** \n\nТак как обычные пользователи не могут по умолчанию использовать wvdial для дозвона, то необходимо поменять права:\n\n```\n# chmod u+s /usr/bin/wvdial\n```\n\nВы должны увидеть следующие разрешения:\n\n```\n# ls -l /usr/bin/wvdial\n```\n\n```\n-rwsr-xr-x 1 root root 114368 2005-12-07 19:21 /usr/bin/wvdial\n```\n\n"
    },
    {
      "title": "Группа",
      "level": 3,
      "content": "Другой, немного более безопасный способ — создать группу dialout (вы можете, впрочем, назвать ее как вам угодно) и дать членам этой группы права на запуск wvdial с правами root.\n\nВо-первых, необходимо создать группу и добавить туда пользователей:\n\n```\n# groupadd dialout\n# gpasswd -a пользователь dialout\n```\n\nЗатем установить группу и дать разрешение на использование wvdial:\n\n```\n# chgrp dialout /usr/bin/wvdial\n# chmod u+s,o= /usr/bin/wvdial\n```\n\nФайл должен иметь следующие разрешения:\n\n```\nls -l /usr/bin/wvdial\n```\n\n```\n-rwsr-x— 1 root dialout 114368 2005-12-07 19:21 /usr/bin/wvdial\n```\n\n"
    },
    {
      "title": "sudo",
      "level": 3,
      "content": "sudo предлагает, вероятно, самый безопасный способ позволить пользователям устанавливать dial-up соединения с помощью wvdial. sudo может использоваться для того, чтобы дать права для как пользователю, так и определённой группе пользователей. Другая выгода от использования sudo состоит в том, что достаточно однажды установить права, и при установке нового пакета wvdial не будет необходимости заново давать разрешения, в отличие от двух предыдущих способов.\n\nИспользуйте visudo для редактирования файла /etc/sudoers:\n\n```\n# visudo\n```\n\nЧтобы предоставить разрешение конкретному пользователю использовать wvdial с правами суперпользователя, необходимо добавить следующую строку (заменив имя пользователя на нужное):\n\n```\nпользователь localhost = /usr/bin/wvdial\n```\n\nЧтобы предоставить права всем членам группы (в данном случае dialout):\n\n```\n%dialout localhost = /usr/bin/wvdial\n```\n\nЕсли ip addr показывает запись pppd, значит сессия готова.\n\n"
    },
    {
      "title": "Советы и хитрости",
      "level": 2,
      "content": "Следующие советы применимы к USB модемам.\n\n"
    },
    {
      "title": "Низкая скорость соединения",
      "level": 3,
      "content": "См. USB 3G Modem#Low connection speed (англ.).\n\n"
    },
    {
      "title": "Автоматическое переподключение",
      "level": 3,
      "content": "Если wvdial произвольно сбрасывает соединение, можете использовать следующий сценарий:\n\n```\n#! /bin/bash\n(\n   while : ; do\n       wvdial\n       sleep 10\n   done\n) &\n```\n\n"
    },
    {
      "title": "Несколько устройств",
      "level": 3,
      "content": "Зачастую присутствует несколько USB устройств(например /dev/ttyUSB0, /dev/ttyUSB1, /dev/ttyUSB2). Если сомневаетесь, какое использовать, попробуйте каждое из них по очереди или используйте /dev/gsmmodem (ссылка, создаваемая usb_modeswitch), которая должна указывать на нужное. Когда файлы конфигурации настроены, интернет-соединение устанавливается запуском:\n\n```\n$ wvdial опции\n```\n\nЕсли необходимо, можно поместить дополнительные команды настройки в простой сценарий вроде этого:\n\n```\nusb_modeswitch\nsleep 2\nmodprobe usbserial vendor=0xVVVV product=0xMMMM maxSize=4096\nsleep 2\nwvdial thenet\n```\n\nгде VVVV это шестнадцатеричный ID производителя из lsusb, MMMM это шестнадцатеричный ID устройства в режиме модема, а \"thenet\" это имя раздела в wvdial.conf, который собираетесь использовать. Опция maxSize не всегда необходима. Она упрощает работу при выключенном SIM PIN, но если вы её используете, то запустите wvdial mypin перед wvdial thenet.\n\nПоследняя команда wvdial должна запустить pppd и полученный IP адрес должен быть выведен в терминале. На этом этапе интернет-соединение должно стать активным, что легко проверить, открыв браузер или использовав ping на внешний IP адрес.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- GitHub-репозиторий\n\n"
    }
  ]
}