{
  "title": "X (Português)",
  "url": "https://wiki.archlinux.org/title/X_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Inicialização automática\n- Gerenciador de exibição\n- Gerenciador de janela\n- Configuração de fontes\n- Temas de cursor\n- Ambiente de desktop\n- Wayland\n- xinit\n- xrandr\n\nDa https://www.x.org/wiki/:\n\nXorg (normalmente chamado de X) é o servidor de exibição mais popular entre os usuários do Linux. Sua onipresença lhe fez um pré-requisito para programas GUI, Isto resultou em uma massiva adoção na maioria das distribuições Linux. Veja a página do Wikipédia Xorg ou visite o site do Xorg para mais informações.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Xorg pode ser instalado com o pacote xorg-server.\n\nAlguns pacotes do grupo xorg-apps são necessários para certas tarefas de configuração, eles serão destacados nas seções relevantes.\n\nO grupo xorg também é uma opção, ele oferece pacotes do servidor Xorg, pacotes do grupo xorg-apps e fontes.\n\n"
    },
    {
      "title": "Instalação de driver",
      "level": 3,
      "content": "O kernel Linux inclui drivers de vídeo de código aberto e suporta aceleração de hardware para framebuffers. No entanto, é necessário suporte para OpenGL e aceleração 2D no X11.\n\nPrimeiro, identifique sua placa:\n\n```\n$ lspci | grep -e VGA -e 3D\n```\n\nEntão, instale o driver apropriado. Você pode procurar por uma lista completa de drivers de vídeo com:\n\n```\n$ pacman -Ss xf86-video\n```\n\nXorg procura por drivers de vídeo instalados automaticamente:\n\n- Se ele não achar o driver específico instalado (listados abaixo), ele primeiro procura por fbdev (xf86-video-fbdev).\n- Se não for achado, ele procura por vesa (xf86-video-vesa), o driver genérico, que manuseia um grande número de chipsets mas não inclui nenhuma aceleração 2D e 3D.\n- Se vesa não é encontrado, Xorg irá fazer uso do kernel mode setting, que inclui aceleração GLAMOR (veja modesetting(4)).\n\nPara aceleração de vídeo funcionar, e geralmente para usar todos os modos configuráveis da GPU, é necessário o driver apropriado:\n\nTable content:\nMarca | Tipo | Driver | OpenGL | OpenGL (multilib) | Documentação\nAMD / ATI | Código aberto | xf86-video-amdgpu | mesa | lib32-mesa | AMDGPU\nxf86-video-ati | ATI\nIntel | Código aberto | xf86-video-intel | mesa | lib32-mesa | Gráficos Intel\nNVIDIA | Código aberto | xf86-video-nouveau | mesa | lib32-mesa | Nouveau\nProprietário | nvidia | nvidia-utils | lib32-nvidia-utils | NVIDIA\nnvidia-390xx-dkmsAUR | nvidia-390xx-utilsAUR | lib32-nvidia-390xx-utilsAUR\n\n- Para habilitar NVIDIA Optimus que usa uma placa de vídeo integrada com uma placa GPU dedicada, Veja NVIDIA Optimus.\n- Para gráficos Intel da quarta geração e posterior, veja Intel graphics#Installation para drivers disponíveis.\n\nOutros drivers de vídeo podem ser encontrados no grupo xorg-drivers.\n\nXorg deve rodar suavemente sem drivers de código fechado, que são tipicamente necessários somente para características avançadas como rápida renderização 3D para jogos. As exceções para esta regra são GPUs recentes (especialmente GPUs da NVIDIA), que não são suportadas por drivers de código aberto.\n\n"
    },
    {
      "title": "AMD",
      "level": 3,
      "content": "Table content:\nArquitetura da GPU | Placas Radeon | Driver de código aberto | Driver proprietário\nGCN 4e recentes | vários | AMDGPU | AMDGPU PRO\nGCN 3 | AMDGPU | AMDGPU PRO\nGCN 2 | AMDGPU* / ATI | não disponível\nGCN 1 | AMDGPU* / ATI | não disponível\nTeraScale 2&3 | HD 5000 - HD 6000 | ATI | não disponível\nTeraScale 1 | HD 2000 - HD 4000 | não disponível\nMais antigo | X1000 e antigo | não disponível\n\n"
    },
    {
      "title": "Iniciando",
      "level": 2,
      "content": "O comando Xorg(1) não é normalmente iniciado diretamente, ao invés disso o servidor X é iniciado por um gerenciador de exibição ou xinit.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "Xorg usa o arquivo de configuração xorg.conf e arquivos terminando com o sufixo .conf para sua inicialização: a lista completa das pastas onde estes arquivos são procurados podem ser encontrados em xorg.conf(5), juntamente com explicações detalhadas de todas as opções disponíveis.\n\n"
    },
    {
      "title": "Usando arquivos .conf",
      "level": 3,
      "content": "O diretório /etc/X11/xorg.conf.d/ guarda configurações específicas do usuário. Você é livre para adicionar arquivos de configuração, mas eles deve ter o sufixo .conf: os arquivos são lidos na ordem ASCII, e por convenção seus nomes começam com XX- (dois dígitos e um hífen, e por exemplo, 10 é lido antes de 20). Estes arquivos são analisados pelo servidor X e são tratados como parte do arquivo de configuração tradicional xorg.conf. Note que em caso de configuração conflitante, o arquivo lido por último será processado. Por esta razão os arquivos de configuração genéricos devem ser ordenados primeiro por nome. As configurações no arquivo xorg.conf são processadas no final.\n\nPara opções de configuração, veja também a página da wiki do Fedora.\n\n"
    },
    {
      "title": "Usando xorg.conf",
      "level": 3,
      "content": "Xorg pode ser configurado modificando /etc/X11/xorg.conf ou /etc/xorg.conf. Você também pode gerar um esqueleto do para xorg.conf com:\n\n```\n# Xorg :0 -configure\n```\n\nIsto deve criar um arquivo xorg.conf.new em /root/ que você pode copiar para /etc/X11/xorg.conf.\n\nAlternativamente, seu driver proprietário pode vir com uma ferramenta para automaticamente configurar o Xorg: veja o artigo do seu driver de vídeo, NVIDIA ou AMDGPU PRO, para mais detalhes.\n\n"
    },
    {
      "title": "Dispositivos de entrada",
      "level": 2,
      "content": "Para dispositivos de entrada o servidor X usa o driver libinput (xf86-input-libinput), mas xf86-input-evdev e drivers relacionados estão disponíveis como alternativa.[1]\n\nUdev, oferecido como dependência do systemd, irá detectar o hardware e ambos os drivers irão agir dinamicamente como driver de entrada para quase todos dispositivos, como definido nos arquivos de configuração padrão 10-quirks.conf e 40-libinput.conf no diretório /usr/share/X11/xorg.conf.d/.\n\nDepois de iniciar o servidor X, o arquivo de log irá mostrar que driver foi selecionado para dado dispositivo (note que o nome do arquivo de log mais recente pode variar):\n\n```\n$ grep -e \"Using input driver \" Xorg.0.log\n```\n\nSe ambos não suportam um dispositivo particular, instale o driver necessário do grupo xorg-drivers. O mesmo se aplica, se você quiser usar outro driver.\n\nPara influenciar a troca dinâmica entre os drivers, Veja #Configuração.\n\nPara instruções específicas, veja também o artigo libinput, as seguintes páginas abaixo, ou a wiki do Fedora para mais exemplos.\n\n"
    },
    {
      "title": "Identificação de entrada",
      "level": 3,
      "content": "Veja Keyboard input#Identifying keycodes in Xorg.\n\n"
    },
    {
      "title": "Aceleração do mouse",
      "level": 3,
      "content": "Veja Mouse acceleration.\n\n"
    },
    {
      "title": "Botões adicionais do mouse",
      "level": 3,
      "content": "Veja Mouse buttons.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "Veja libinput or Synaptics.\n\n"
    },
    {
      "title": "Toque de tela",
      "level": 3,
      "content": "Veja Touchscreen.\n\n"
    },
    {
      "title": "Configurações do teclado",
      "level": 3,
      "content": "Veja Keyboard configuration in Xorg.\n\n"
    },
    {
      "title": "Configuração manual",
      "level": 3,
      "content": "- Novas versões do Xorg são automaticamente configuráveis, então configurações manuais não devem ser necessárias.\n- Se Xorg não é capaz de detectar qualquer monitor ou para evitar automaticamente configuração, um arquivo de configuração pode ser usado. Um exemplo de uso, é em um servidor, que liga sem um monitor e inicia o Xorg automaticamente, com console virtual no login, ou por um gerenciador de exibição\n\nPara configuração headless o driver xf86-video-dummy é necessário; instale e crie um arquivo de configuração, como o seguinte:\n\n```\n/etc/X11/xorg.conf.d/10-headless.conf\n```\n\n```\nSection \"Monitor\"\n        Identifier \"dummy_monitor\"\n        HorizSync 28.0-80.0\n        VertRefresh 48.0-75.0\n        Modeline \"1920x1080\" 172.80 1920 2040 2248 2576 1080 1081 1084 1118\nEndSection\n\nSection \"Device\"\n        Identifier \"dummy_card\"\n        VideoRam 256000\n        Driver \"dummy\"\nEndSection\n\nSection \"Screen\"\n        Identifier \"dummy_screen\"\n        Device \"dummy_card\"\n        Monitor \"dummy_monitor\"\n        SubSection \"Display\"\n        EndSubSection\nEndSection\n```\n\n"
    },
    {
      "title": "Múltiplos monitores",
      "level": 3,
      "content": "Veja o artigo Múltiplos monitores para informações gerais.\n\nVeja também as instruções específicas da GPU:\n\n- NVIDIA#Múltiplos monitores\n- ATI#Configuração múltiplos monitores\n\n"
    },
    {
      "title": "Mais de uma placa de vídeo",
      "level": 4,
      "content": "Você deve definir o driver correto a ser usado e botar o bus ID de sua placa de vídeo (em notação decimal).\n\n```\nSection \"Device\"\n    Identifier             \"Screen0\"\n    Driver                 \"intel\"\n    BusID                  \"PCI:0:2:0\"\nEndSection\n\nSection \"Device\"\n    Identifier             \"Screen1\"\n    Driver                 \"nouveau\"\n    BusID                  \"PCI:1:0:0\"\nEndSection\n```\n\nPara descobrir os bus IDs (em hexadecimal):\n\n```\n$ lspci | grep -e VGA -e 3D\n```\n\n```\n00:02.0 VGA compatible controller: Intel Corporation HD Graphics 630 (rev 04)\n01:00.0 3D controller: NVIDIA Corporation GP107M [GeForce GTX 1050 Mobile] (rev a1)\n```\n\nOs bus IDs desse exemplo são 0:2:0 e 1:0:0.\n\n"
    },
    {
      "title": "Tamanho da tela e DPI",
      "level": 3,
      "content": "Note: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nO DPI do servidor X é determinado da seguinte maneira:\n\n1. A opção da linha de comando -dpi tem a maior prioridade.\n1. Se ela não é usada, a configuração DisplaySize no arquivo de configuração do X é usada para entregar o DPI, dado o tamanho de resolução da tela.\n1. Se nenhum DisplaySize é dado, os valores de tamanho do monitor da DDC são usados para definir o DPI, dado a resolução de tela.\n1. Se DDC não especifica um tamanho, é usado por padrão 75 DPI.\n\nPara conseguir pontos por polegada (DPI) correto, o tamanho da tela deve ser reconhecido ou configurado. Ter o DPI correto é um requisito quando detalhes finos são necessários (como renderização de fontes). Antigamente, fabricantes tentaram criar um padrão para 96 DPI (um monitor de 10.3\" deveria ser 800X600, um monitor de 13.2\" deveria ser 1024X768). Atualmente, DPIs variam e podem não ser iguais horizontalmente e verticalmente. Por exemplo, uma tela panorâmica LCD de 19\" 1440X900 poderia ter um DPI de 89X87. Para configurar o DPI, o servidor Xorg tenta a auto detecção do tamanho de tela físico através da placa gráfica com DDC. Quando o servidor Xorg sabe o tamanho físico da tela, ele será capaz de configurar o DPI corretamente baseado no tamanho da resolução.\n\nPara ver se o tamanho da sua tela e DPI são detectados/calculados corretamente:\n\n```\n$ xdpyinfo | grep -B2 resolution\n```\n\nVerifique se as dimensões correspondem ao tamanho da sua tela. Se o servidor Xorg não é capaz de corretamente calcular o tamanho de tela, o DPI será definido como 75X75 e você terá que calcular isto você mesmo.\n\nSe você tem especificações do tamanho físico da tela, pode colocá-los no arquivo de configuração do Xorg para então o DPI apropriado ser calculado (ajuste o Identifier de acordo com a saída do xrandr):\n\n```\nSection \"Monitor\"\n    Identifier             \"DVI-D-0\"\n    DisplaySize             286 179    # Em milímetros\nEndSection\n```\n\nSe você somente quer colocar sua especificação de monitor sem criar um novo arquivo xorg.conf. Por exemplo (/etc/X11/xorg.conf.d/90-monitor.conf):\n\n```\nSection \"Monitor\"\n    Identifier             \"<monitor padrão>\"\n    DisplaySize            286 179    # Em milímetros\nEndSection\n```\n\nSe você não tem as especificações físicas de altura e largura da tela, (a maioria das especificações atualmente somente listam o tamanho diagonal) você pode usar a nativa resolução do monitor (ou aspecto de proporção) e comprimento diagonal para calcular a dimensão horizontal e vertical física. Usando o Teorema de Pitágoras em uma tela diagonal de 13.3\" com uma resolução nativa de 1280X800 (ou aspecto de proporção 16:10):\n\n```\n$ echo 'scale=5;sqrt(1280^2+800^2)' | bc  # 1509.43698\n```\n\nIsto dará o comprimento do pixel diagonal e com este valor você pode descobrir o comprimento horizontal e vertical físico (e converter eles para milímetros):\n\n```\n$ echo 'scale=5;(13.3/1509)*1280*25.4' | bc  # 286.43072\n$ echo 'scale=5;(13.3/1509)*800*25.4'  | bc  # 179.01920\n```\n\n"
    },
    {
      "title": "Definindo o DPI manualmente",
      "level": 4,
      "content": "Para drivers compatíveis com RandR (por exemplo, o driver ATI de código aberto), você pode configurá-lo da seguinte maneira:\n\n```\n$ xrandr --dpi 144\n```\n\nPara torná-lo permanente, consulte Inicialização automática#Na inicialização de Xorg.\n\nO DPI pode ser configurado manualmente se você deseja usar somente uma resolução (calculadora de DPI):\n\n```\nSection \"Monitor\"\n    Identifier             \"Monitor0\"\n    Option                 \"DPI\" \"96 x 96\"\nEndSection\n```\n\nVocê pode configurar manualmente o DPI adicionando as opções abaixo no arquivo /etc/X11/xorg.conf.d/20-nvidia.conf (dentro da seção Device):\n\n```\nOption              \"UseEdidDpi\" \"False\"\nOption              \"DPI\" \"96 x 96\"\n```\n\nGTK frequentemente sobrescreve o DPI do servidor com o Xresource opcional Xft.dpi. Para descobrir se isto está acontecendo com você, verifique:\n\n```\n$ xrdb -query | grep dpi\n```\n\nA partir da versão 3.16 do GTK quando esta variável não é explicitamente definida, GTK define como 96. Para os programas GTK obedecerem o DPI do servidor você deve explicitamente definir Xft.dpi. O recurso Xft.dpi é o metodo pelo qual alguns ambientes desktop opcionalmente forçam o DPI para um valor específico. Dentre estes KDE e TDE.\n\n"
    },
    {
      "title": "Gerenciamento de energia do monitor",
      "level": 3,
      "content": "DPMS (Gerenciamento de energia do monitor baseado em sinalização) é uma tecnologia que habilita o modo de economia de energia para monitores quando o computador não está em uso. Isto permite que os monitores vão para o modo standby automaticamente depois de determinado período de tempo.\n\n"
    },
    {
      "title": "Composição",
      "level": 2,
      "content": "A extensão de Composição para X gera uma completa subárvore hierárquica de janelas a serem renderizadas para um buffer off-screen (renderização fora da tela). Programas então pegam o conteúdo desse buffer e fazem o que quiser com ele. O buffer off-screen pode ser automaticamente fundido com a janela pai ou com programas externos, chamados gerenciadores de composição. Veja o seguinte artigo para mais informações: gerenciador de janelas compositor\n\nAlguns gerenciadores de janela (por exemplo: compiz, Enlightenment, KWin, Marco, Metacity, Muffin, Mutter, Xfwm) fazem composição. Para outros gerenciadores de janela, um gerenciador de composição pode ser usado.\n\n"
    },
    {
      "title": "Lista de gerenciadores de composição",
      "level": 3,
      "content": "- Picom — Compositor (um fork do Compton)\n\n- Xcompmgr — Gerenciador de efeitos de janela de composição\n\n- Unagi — Um modular gerenciador de composição escrito em C baseado no XCB\n\n"
    },
    {
      "title": "Dicas e truques",
      "level": 2,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\n"
    },
    {
      "title": "Automação",
      "level": 3,
      "content": "Esta seção lista utilitários para automatizar a entrada do teclado ou mouse e operações de janela (como mover, redimensionar e iniciar).\n\nTable content:\nFerramenta | Pacote | Manual | EntradaKeysym | Operações dejanela | Nota\nxautomation | xautomation | xte(1) | Sim | Não | Também contém ferramentas de screen scraping. Não pode simular F13+.\nxdo | xdo | xdo(1) | Não | Sim | Pequena ferramenta do X para ações elementárias em janelas.\nxdotool | xdotool | xdotool(1) | Sim | Sim | Muitos bugs e não está em desenvolvimento ativo, exemplo: tem parseamento da linha de comando quebrado.[2][3]\nxvkbd | xvkbdAUR | xvkbd(1) | Sim | Não | Teclado virtual para Xorg, também tem a opção -text para envio de caracteres.\n\nVeja também Clipboard#Tools e uma visão geral de ferramentas de automação do X (em inglês).\n\n"
    },
    {
      "title": "Sessão X aninhada",
      "level": 3,
      "content": "Para executar uma sessão aninhada de outro ambiente de desktop:\n\n```\n$ /usr/bin/Xnest :1 -geometry 1024x768+0+0 -ac -name Windowmaker & wmaker -display :1\n```\n\nIsso vai iniciar uma sessão de Window Maker em uma janela 1024 por 768 dentro de sua sessão X atual.\n\nIsso precisa do pacote xorg-server-xnest para ser instalado.\n\n"
    },
    {
      "title": "Iniciando programas GUI remotamente",
      "level": 3,
      "content": "Veja o artigo principal: OpenSSH#X11 forwarding.\n\n"
    },
    {
      "title": "Habilitando e desabilitando em demanda dispositivos de entrada",
      "level": 3,
      "content": "Com a ajuda de xinput você pode temporariamente desabilitar ou habilitar dispositivos de entrada. Isto pode ser útil, por exemplo, em sistemas que tem mais de um mouse, como os ThinkPads, e você prefere usar somente um para evitar clicks indesejados.\n\nInstale o pacote xorg-xinput.\n\nEncontre o nome ou ID do dispositivo que você quer desabilitar:\n\n```\n$ xinput\n```\n\nPor exemplo, em um Lenovo ThinkPad T500, a saída parece com isto:\n\n```\n$ xinput\n```\n\n```\n⎡ Virtual core pointer                          id=2    [master pointer  (3)]\n⎜   ↳ Virtual core XTEST pointer                id=4    [slave  pointer  (2)]\n⎜   ↳ TPPS/2 IBM TrackPoint                     id=11   [slave  pointer  (2)]\n⎜   ↳ SynPS/2 Synaptics TouchPad                id=10   [slave  pointer  (2)]\n⎣ Virtual core keyboard                         id=3    [master keyboard (2)]\n    ↳ Virtual core XTEST keyboard               id=5    [slave  keyboard (3)]\n    ↳ Power Button                              id=6    [slave  keyboard (3)]\n    ↳ Video Bus                                 id=7    [slave  keyboard (3)]\n    ↳ Sleep Button                              id=8    [slave  keyboard (3)]\n    ↳ AT Translated Set 2 keyboard              id=9    [slave  keyboard (3)]\n    ↳ ThinkPad Extra Buttons                    id=12   [slave  keyboard (3)]\n```\n\nDesabilite o dispositivo com xinput --disable dispositivo, onde o dispositivo é o ID ou nome do dispositivo que você quer desabilitar. Neste exemplo nós iremos desabilitar o Synaptics Touchpad, com o ID 10:\n\n```\n$ xinput --disable 10\n```\n\nPara habilitar novamente o dispositivo, execute o comando:\n\n```\n$ xinput --enable 10\n```\n\nAlternatively using the device name, the command to disable the touchpad would be:\n\nAlternativamente, usando o nome do dispositivo, o comando para desabilitar o touchpad seria:\n\n```\n$ xinput --disable \"SynPS/2 Synaptics TouchPad\"\n```\n\n"
    },
    {
      "title": "Atalho para matar um programa",
      "level": 3,
      "content": "Faça um atalho com o seguinte script:\n\n```\n#!/bin/sh\nwindowFocus=$(xdotool getwindowfocus);\npid=$(xprop -id \"$windowFocus\" | grep PID);\nkill -9 \"$pid\"\n```\n\nDependências: xorg-xprop, xdotool.\n\n"
    },
    {
      "title": "Impeça acesso ao TTY",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nPara impedir o acesso ao TTY no X, adicione no xorg.conf:\n\n```\nSection \"ServerFlags\"\n    Option \"DontVTSwitch\" \"True\"\nEndSection\n```\n\n"
    },
    {
      "title": "Impeça um usuário de matar o X",
      "level": 3,
      "content": "Para prevenir um usuário de matar uma sessão X quando ela está rodando, adicione o seguinte no xorg.conf:\n\n```\nSection \"ServerFlags\"\n    Option \"DontZap\"      \"True\"\nEndSection\n```\n\n"
    },
    {
      "title": "Xorg sem root",
      "level": 3,
      "content": "Xorg pode ser executado com privilégios de usuário comum ao invês do root (conhecido em inglês como \"rootless\" Xorg). É uma melhora significativa na segurança quando comparado com executar como root. Note que a maioria dos gerenciadores de login não suportam Xorg sem root.\n\nVocê pode verificar que usuário está executando o Xorg com ps -o user $(pgrep Xorg).\n\nVeja também Xorg.wrap(1), systemd-logind(8), Systemd/User#Xorg as a systemd user service, [4] e FS#41257.\n\n"
    },
    {
      "title": "Usando xinitrc",
      "level": 4,
      "content": "Para configurar Xorg sem root usando xinitrc:\n\n- Executar startx como um subpprocesso do shell de login; executar startx diretamente e não usarexec startx.\n- Se usa certos drivers de vídeo proprietários, a detecção automática do kernel mode setting vai falhar. Em tais casos, você deve definir needs_root_rights = no em /etc/X11/Xwrapper.config.\n\n"
    },
    {
      "title": "Usando GDM",
      "level": 4,
      "content": "GDM vai executar o Xorg sem privilégios root por padrão quando o kernel mode setting é usado.\n\n"
    },
    {
      "title": "Redirecionamento do log da sessão",
      "level": 4,
      "content": "Quando Xorg é executado sem privilégios root, os logs do xorg são armazenados em ~/.local/share/xorg/Xorg.log. No entanto, as saídas stdout e stderr da sessão Xorg não são redirecionadas para este arquivo. Para habilitar o redirecionamento, inicie o Xorg com a opção -keeptty e redirecione a saída stdout e stderr para um arquivo:\n\n```\nstartx -- -keeptty &> ~/.xorg.log\n```\n\nOu copie /etc/X11/xinit/xserverrc para ~/.xserverrc, e adicione -keeptty. Veja [5].\n\n"
    },
    {
      "title": "Geral",
      "level": 3,
      "content": "Se um problema acontecer, veja o log armazenado em /var/log/ ou, se executa o servidor X como usuário comum (possível desde v1.16), em ~/.local/share/xorg/. Usuários do GDM devem verificar os registros do systemd. [6]\n\nOs arquivos de log estão na forma de Xorg.n.log com n sendo o número de exibição($DISPLAY). Para uma maquina de único usuário com configuração padrão, o arquivo de log é frequentemente Xorg.0.log, mas isto pode variar. Para ter certeza de qual é o arquivo certo você pode olhar o log da inicialização da sessão X e de qual console ele foi iniciado. Por exemplo:\n\n```\n$ grep -e Log -e tty Xorg.0.log\n```\n\n```\n[    40.623] (==) Log file: \"/home/archuser/.local/share/xorg/Xorg.0.log\", Time: Thu Aug 28 12:36:44 2014\n[    40.704] (--) controlling tty is VT number 1, auto-enabling KeepTty\n```\n\n- No arquivo de log você pode procurar por qualquer linhas começando com (EE), que representam erros, e também (WW), que são avisos que podem indicar outros problemas.\n- Se o arquivo xinitrc estiver vazio em seu $HOME, exclua ou edite ele para o X iniciar apropriadamente. Se você não fizer isto X irá mostrar uma tela vazio sem erros aparentes no seu Xorg.0.log. Ao exclui-lo a próxima vez que for iniciado o X será executado com o ambiente X padrão.\n- Se a tela ficar preta, você pode ainda tentar trocar para um diferente console virtual (por exemplo, Ctrl+Alt+F6), e entrar como root. Você pode fazer isto ao digitar root (pressionando Enter depois) e entrar com a senha do usuário root (denovo, pressione Enter depois).\n\n```\n# pkill -x X\n```\n\n```\n# reboot\n```\n\n- Veja páginas específicas na Categoria:Dispositivos de entrada se você tiver problemas com o teclado, mouse, Touchpad e etc, considere verificar a pagina em inglês se não achar o que procura.\n- Procure por problemas comuns nos artigos da AMDGPU, Intel e NVIDIA.\n\n"
    },
    {
      "title": "Tela preta, nenhum protocolo especificado.., recurso temporariamente não disponível para todos ou alguns usuários",
      "level": 3,
      "content": "X cria configuração e arquivos temporários no diretório do usuário ($HOME). Tenha certeza que existe espaço de disco disponível na partição utilizada. Infelizmente, o servidor X não informa isso de maneira óbvia.\n\n"
    },
    {
      "title": "DRI com placas Matrox parou de funcionar",
      "level": 3,
      "content": "Se você usa um cartão Matrox e DRI parou de funcionar depois de atualizar o Xorg, tente adicionar a seguinte linha:\n\n```\nOption \"OldDmaInit\" \"On\"\n```\n\nNa seção Device que referência a placa de vídeo em xorg.conf.\n\n"
    },
    {
      "title": "Problemas no modo renderizador de quadros (framebuffer mode)",
      "level": 3,
      "content": "Se X falha para iniciar com a seguinte messagem de log:\n\n```\n(WW) Falling back to old probe method for fbdev\n(II) Loading sub module \"fbdevhw\"\n(II) LoadModule: \"fbdevhw\"\n(II) Loading /usr/lib/xorg/modules/linux//libfbdevhw.so\n(II) Module fbdevhw: vendor=\"X.Org Foundation\"\n       compiled for 1.6.1, module version=0.0.2\n       ABI class: X.Org Video Driver, version 5.0\n(II) FBDEV(1): using default device\n\nFatal server error:\nCannot run in framebuffer mode. Please specify busIDs for all framebuffer devices\n```\n\nDesinstale o pacote xf86-video-fbdev.\n\n"
    },
    {
      "title": "Programa requer \"font '(null)'\"",
      "level": 3,
      "content": "Messagem de erro: unable to load font `(null)'.\n\nAlguns programas somente funcionam com fontes bitmap. Os dois maiores pacotes com fontes bipmap disponíveis são xorg-fonts-75dpi e xorg-fonts-100dpi. Você não precisa de ambos, um deve ser o bastante. Para descobrir qual o mais apropriado para sua situação, tente xdpyinfo, do pacote xorg-xdpyinfo, desse jeito:\n\n```\n$ xdpyinfo | grep resolution\n```\n\nUse o que for mais próximo do valor mostrado.\n\n"
    },
    {
      "title": "Recuperação: Desabilitar o Xorg antes do login GUI",
      "level": 3,
      "content": "Se o Xorg está configurado para iniciar automaticamente e por alguma razão você precisa evitar isto antes de iniciar o login/gerenciador de exibição Aparecerem (e o sistema está mal configurado e o Xorg não reconhece o mouse ou teclado, por exemplo), você pode fazer isto com dois métodos.\n\n- Mude o alvo padrão para rescue.target. Veja Systemd#Alterar target padrão para inicializar.\n- Se você além de ter um sistema com falhas que fazem o Xorg não usável, tem o menu do GRUB sem tempo de espera, e não pode usar o GRUB para prevenir o Xorg de iniciar. Você pode usar um live CD do Arch Linux. Veja no guia de instalação sobre como montar e chroot o sistema Arch Linux instalado.Você também pode tentar trocar para outro tty com Ctrl+Alt + a tecla de função (normalmente do F1 para F7, use um que não está sendo usado pelo X), logue como root e siga os passos abaixo.\n\nDependendo da configuração, você vai precisar fazer um ou mais desses passos:\n\n- Desabilite o gerenciador de exibição.\n- Desabilite o Inicio automático do X no login.\n- Renomeie o ~/.xinitrc ou comente a linha que contém exec dentro dele.\n\n"
    },
    {
      "title": "Cliente X começando com falha \"su\"",
      "level": 3,
      "content": "Se você está ecebendo \"Client is not authorized to connect to server\", tente adicionar essa linha:\n\n```\nsession        optional        pam_xauth.so\n```\n\nEm /etc/pam.d/su e /etc/pam.d/su-l. pam_xauth irá então apropriadamente definir as variáveis de ambiente e cuidar das chaves xauth.\n\n"
    },
    {
      "title": "X falhou para iniciar: Inicialização do teclado falhou",
      "level": 3,
      "content": "Se o sistema de arquivos, especificamente se /tmp está cheio, startx irá falhar. /var/log/Xorg.0.log irá terminar com:\n\n```\n(EE) Error compiling keymap (server-0)\n(EE) XKB: Could not compile keymap\n(EE) XKB: Failed to load keymap. Loading default keymap instead.\n(EE) Error compiling keymap (server-0)\n(EE) XKB: Could not compile keymap\nXKB: Failed to compile keymap\nKeyboard initialization failed. This could be a missing or incorrect setup of xkeyboard-config.\nFatal server error:\nFailed to activate core devices.\nPlease consult the The X.Org Foundation support at http://wiki.x.org\nfor help.\nPlease also check the log file at \"/var/log/Xorg.0.log\" for additional information.\n(II) AIGLX: Suspending AIGLX clients for VT switch\n```\n\nLibere espaço no sistema de arquivos e X irá iniciar.\n\n"
    },
    {
      "title": "Tela verde toda vez que tenta ver um vídeo",
      "level": 3,
      "content": "Sua profundidade de cor está errada. Pode ser 24 ao invés de 16, por exemplo.\n\n"
    },
    {
      "title": "Erro SocketCreateListener",
      "level": 3,
      "content": "Se X termina com a mensagem de erro \"SocketCreateListener() failed\", você pode precisar deletar os arquivos de socket em /tmp/.X11-unix. Isto pode acontecer se você antes tenha rodado o Xorg como superusuário (Por exemplo, para gerar uma xorg.conf).\n\n"
    },
    {
      "title": "Chave inválida MIT-MAGIC-COOKIE-1 enquanto tenta executar um programa como root",
      "level": 3,
      "content": "Este erro significa que somente o atual usuário tem acesso ao servidor X. Para resolver, dê acesso ao superusuário:\n\n```\n$ xhost +si:localuser:root\n```\n\nEsta linha também pode dar acesso a outros usuários.\n\n"
    },
    {
      "title": "Xorg-server Fatal server error: (EE) AddScreen/ScreenInit",
      "level": 3,
      "content": "Se o servidor do Xorg estiver apresentando um problema intermitente e no log do Xorg você vê:\n\n```\nsystemd-logind: failed to take device /dev/dri/card0: Operation not permitted\n...\nAddScreen/ScreenInit failed for driver 0\n```\n\nEntão este problema pode ser causado pelo issue 13943 do systemd. Configure um início antecipado de KMS.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- Xplain - Explicação detalhada do sistema de janelas X.\n- Xorg(1) - Página manual do Xorg.\n- Gentoo/Xorg#Configuration - Página de configuração do Xorg da Wiki do Gentoo.\n\n"
    }
  ]
}