{
  "title": "Xbindkeys (Русский)",
  "url": "https://wiki.archlinux.org/title/Xbindkeys_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Xmodmap (Русский)\n- Sxhkd\n- Xorg (Русский)#Автоматизация\n\nXbindkeys - программа, позволяющая назначать команды клавишам (в том числе мультимедийным) или сочетаниям клавиш. Она не зависит от окружения рабочего стола и оконного менеджера.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет xbindkeys.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Создайте пустой файл ~/.xbindkeysrc или создайте образец файла (обратите внимание, что в нем настроены некоторые сочетания клавиш, такие как Ctrl+f, которые вы можете изменить или удалить):\n\n```\n$ xbindkeys -d > ~/.xbindkeysrc\n```\n\nТеперь вы можете редактировать его вручную, либо воспользоваться для настройки графической утилитой.\n\n"
    },
    {
      "title": "Управление звуком",
      "level": 3,
      "content": "Вот пример конфигурационного файла, который связывает комбинации клавиш Fn на ноутбуке с командами pactl, которые регулируют громкость звука. Обратите внимание, что символ решетки (#) используется для создания комментариев.\n\n```\n# Увеличить громкость звука\n\"pactl set-sink-volume @DEFAULT_SINK@ +1000\"\n   XF86AudioRaiseVolume\n```\n\n```\n# Уменьшить громкость звука\n\"pactl set-sink-volume @DEFAULT_SINK@ -1000\"\n   XF86AudioLowerVolume\n```\n\n```\n# Отключить звук\n\"pactl set-sink-mute @DEFAULT_SINK@ toggle\"\n   XF86AudioMute\n```\n\nДля получения информации о дополнительных командах смотрите PulseAudio (Русский)#Регулировка звука клавиатурой или ALSA#Keyboard volume control.\n\n"
    },
    {
      "title": "Управление яркостью",
      "level": 3,
      "content": "Также можно определить сочетания клавиш, чтобы управлять яркостью экрана.\n\n```\n# Увеличить яркость\n\"xbacklight -inc 10\"\n   XF86MonBrightnessUp\n```\n\n```\n# Уменьшить яркость\n\"xbacklight -dec 10\"\n   XF86MonBrightnessDown\n```\n\n"
    },
    {
      "title": "Графический способ",
      "level": 3,
      "content": "Для графической настройке установите пакет xbindkeys_config-gtk2AUR и запустите:\n\n```\n$ xbindkeys_config\n```\n\n"
    },
    {
      "title": "Определение кодов клавиш",
      "level": 2,
      "content": "Чтобы найти код клавиши, введите следующую команду:\n\n```\n$ xbindkeys -k\n```\n\nПоявится пустое окно. Нажмите кнопку, которой вы хотите назначить команду и xbindkeys выведет удобный фрагмент, который можно вставить в ~/.xbindkeysrc. Например, пока окно открыто, нажмите Alt+o и вы получите следующий вывод (результат может отличаться):\n\n```\n\"(Scheme function)\"\n    m:0x8 + c:32\n    Alt + o\n```\n\nПервая строка представляет собой команду. Вторая содержит состояние (0x8) и код клавиши (32), о котором сообщает xev. Третья строка содержит значение клавиш, связанные с указанным кодом. Чтобы использовать этот вывод, скопируйте одну из двух последних строк в ~/.xbindkeysrc и замените \"(Scheme function)\" на команду, которую вы хотите использовать.\n\nДля определения клавиш мыши, вы можете использовать xev. Для получения дополнительной информации смотрите [1].\n\n"
    },
    {
      "title": "Постоянные изменения",
      "level": 2,
      "content": "После того как вы закончите настройку сочетаний клавиш, откройте файл xprofile или xinitrc (в зависимости от вашего оконного менеджера) и поместите\n\n```\nxbindkeys\n```\n\nперед строкой, которая запускает ваш оконный менеджер или окружение рабочего стола.\n\n"
    },
    {
      "title": "Имитация мультимедийных клавиш",
      "level": 2,
      "content": "XF86Audio* и другие мультимедийные клавиши [2] довольно хорошо реализованы в основных DE. Для клавиатур без таких клавиш вы можете имитировать их с помощью других клавиш.\n\n```\n# Уменьшить громкость звука при нажатии Super-minus\n\"pactl set-sink-volume 0 -1000\"\n   m:0x50 + c:20\n   Mod2+Mod4 + minus\n```\n\nОднако для самого выполнения этих клавиш вы можете использовать такие инструменты, как xdotool (из официальных репозиториев) и xmacroAUR (из AUR). К сожалению, поскольку вы уже удерживаете некоторую клавишу-модификатор (например, Super или Shift), X распознает ввод как Super-XF86AudioLowerVolume, который ничего не выполняет ничего полезного. Ниже приведен скрипт, основанный на утилитах xmacro и xmodmap из пакета xorg-xmodmap [3].\n\n```\n#!/bin/sh\necho 'KeyStrRelease Super_L KeyStrRelease minus'\n```\n\nЭто работает для одного вызова клавиши XF86AudioLowerVolume (если вы используете сочетание Super+minus), а не для нескольких при условие, что вы не отпускаете клавишу Super. Однако, если вы хотите, чтобы это работало, добавьте следующую строку в конец скрипта:\n\n```\necho 'KeyStrPress Super_L' | xmacroplay :0\n```\n\nС помощью этого модифицированного скрипта, если вы нажмете комбинацию клавиш достаточно быстро, ваша клавиша Super_L останется 'включенной' до следующего раза, когда вы ее нажмете, что может привести к некоторым интересным побочным эффектам. Просто нажмите Super_L снова, чтобы переключить его состояние, или используйте оригинальный скрипт, если хотите, чтобы все 'просто работало', и смиритесь с одним нажатием на громкость вверх/вниз.\n\nЭти инструкции совместимы с большим количеством XF86 мультимедиа клавиш (полезними из них будут XF86AudioRaiseVolume, XF86AudioLowerVolume, XF86AudioPlay, XF86AudioPrev, XF86AudioNext).\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Если по какой-либо причине горячая клавиша, которую вы уже настроили в ~/.xbindkeysrc не работает, откройте терминал и введите следующее:\n\n```\n$ xbindkeys -n\n```\n\nНажимая на не рабочую горячую клавишу, вы можете увидеть любую ошибку xbindkeys (например: mistyped command/keycode,...).\n\nЕсли команда для сочетания клавиш работает через xdotool в командной строке, но не при ее нажатие (это особенно заметно в gnome), добавьте \"+ Release\" к этой комбинации:\n\n```\n\"xdotool key --clearmodifiers XF86AudioPlay\"\n    Mod2 + F7 + Release\n```\n\nЭто заставит клавишу F7 воспроизвести/приостановить аудио. Где команда \"xdotool\" работает в командной строке. Если удалить \"+ Release\", сочетание клавиш не будет работать с xbindkeys.\n\n"
    }
  ]
}