{
  "title": "Xcompmgr (Русский)",
  "url": "https://wiki.archlinux.org/title/Xcompmgr_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Compiz (Русский)\n- Compton (Русский)\n\nXcompmgr - это простой композитный менеджер окон, умеющий рендерить тени, создавать примитивную прозрачность окон посредством transset. Разработан исключительно как доказательство концепции, Xcompmgr - легковесная альтернатива Compiz и ему подобных композитных менеджеров.\n\nТак как Xcompmgr не заменяет любой существующий оконный менеджер, он является идеальным решением для пользователей, использующих легковесные оконные менеджеры и желающих создать более элегантный рабочий стол.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Перед установкой Xcompmgr убедитесь в том, что Xorg установлен и правильно настроен. Чтобы убедиться в том, что расширение Composite для X Server включено, выполните:\n\n```\n$ xdpyinfo | grep Composite\n```\n\n```\nComposite\n```\n\nЕсли вывод отсутствует, добавьте Composite в раздел Extensions в xorg.conf:\n\n```\n/etc/X11/xorg.conf\n```\n\n```\nSection \"Extensions\"\n        Option  \"Composite\" \"true\"\nEndSection\n```\n\nУстановите пакет xcompmgr. Для прозрачности установите transset-dfAUR. Для примера смотрите Xterm#Automatic transparency.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Запуск xcompmgr:\n\n```\n$ xcompmgr -c\n```\n\nЧтобы запускать xcompmgr при старте сессии, добавьте в xprofile:\n\n```\nxcompmgr -c &\n```\n\nВы можете экспериментировать с параметрами, чтобы изменить отбрасывание теней или даже включить затухание. Например:\n\n```\nxcompmgr -c -t-5 -l-5 -r4.2 -o.55 &\n```\n\nПолучение полного списка опций:\n\n```\n$ xcompmgr --help\n```\n\n"
    },
    {
      "title": "Прозрачность окон",
      "level": 3,
      "content": "Практическое применение ограничено из-за низкой производительности, но можно использовать transset-df для установки прозрачности отдельных окон.\n\nЧтобы установить прозрачность окна программы, убедитесь в том, что она запущена, затем выполните:\n\n```\n$ transset-df прозрачность\n```\n\nгде прозрачность - это число от 0 до 1, где 0 - абсолютная прозрачность, 1 - непрозрачность.\n\nКурсор превратится в крест, наведите его на требуемую программу. Например, transset-df 0.25 установит непрозрачность на уровне 25% (75% прозрачности).\n\n"
    },
    {
      "title": "Запуск/остановка Xcompmgr по требованию",
      "level": 3,
      "content": "Этот скрипт позволяет легко запустить, перезапустить и остановить композитный менеджер.\n\n```\n~/.bin/comp\n```\n\n```\n#!/bin/bash\n#\n# Start a composition manager.\n# (xcompmgr in this case)\n\ncomphelp() {\n    echo \"Composition Manager:\"\n    echo \"   (re)start: COMP\"\n    echo \"   stop:      COMP -s\"\n    echo \"   query:     COMP -q\"\n    echo \"              returns 0 if composition manager is running, else 1\"\n    exit\n}\n\ncheckcomp() {\n    pgrep xcompmgr &>/dev/null\n}\n\nstopcomp() {\n    checkcomp && killall xcompmgr\n}\n\nstartcomp() {\n    stopcomp\n    # Example settings only. Replace with your own.\n    xcompmgr -CcfF -I-.015 -O-.03 -D6 -t-1 -l-3 -r4.2 -o.5 &\n    exit\n}\n\ncase \"$1\" in\n    \"\")   startcomp ;;\n    \"-q\") checkcomp ;;\n    \"-s\") stopcomp; exit ;;\n    *)    comphelp ;;\nesac\n```\n\nДля удобства использования можно назначить скрипт на горячую клавишу, используя, например, Xbindkeys. Это позволит перезапускать или временно приостанавливать Xcompmgr в случае необходимости, не прерывая работу.\n\n"
    },
    {
      "title": "Переключатель Xcompmgr",
      "level": 3,
      "content": "Назначьте следующий скрипт на любую горячую клавишу:\n\n```\n#!/bin/bash\n\nif pgrep xcompmgr &>/dev/null; then\n    echo \"Turning xcompmgr OFF\"\n    pkill xcompmgr &\nelse\n    echo \"Turning xcompmgr ON\"\n    xcompmgr -c -C -t-5 -l-5 -r4.2 -o.55 &\nfi\n\nexit 0\n```\n\n"
    },
    {
      "title": "Mozilla Firefox падает при заходе на сайт с Flash",
      "level": 3,
      "content": "Вы можете исправить это путем создания файла /etc/profile.d/flash.sh, который должен содержать следующее:\n\n```\nexport XLIB_SKIP_ARGB_VISUALS=1\n```\n\n"
    },
    {
      "title": "Фон становится светло-серым после входа в систему (например, в Openbox)",
      "level": 3,
      "content": "Эта ошибка исправляется установкой hsetroot и настройки цвета фона посредством hsetroot -solid \"#000000\" (просто введите код цвета, который вы хотите вместо #000000) перед xcompmgr. Если xcompmgr запускается до exec в ~/.xinitrc, то вы можете заменить xcompmgr & на (sleep 1 && xcompmgr) &; это позволит xcompmgr запускаться после старта оконного менеджера.\n\n"
    },
    {
      "title": "BadPicture request в awesome",
      "level": 3,
      "content": "Если вы получаете следующую ошибку в awesome:\n\n```\nerror 163: BadPicture request 149 minor 8 serial 34943\n error 163: BadPicture request 149 minor 8 serial 34988\n error 163: BadPicture request 149 minor 8 serial 35033\n```\n\nпросто установите feh и перезапустите awesome.\n\n"
    },
    {
      "title": "Не обновляется экран в awesome после изменения разрешения",
      "level": 3,
      "content": "При использовании внешнего монитора могут возникнуть проблемы при автоматическом изменении разрешения экрана: часть экрана становится \"застывшей\" и больше не обновляется. Эта проблема возникает из-за первоначального изменения разрешения (которое происходит перед стартом Xcompmgr), а также при установке фона в awesome посредством feh.\n\nЧтобы исправить это, вам нужно установить hsetroot и добавить следующую строчку в .xinitrc перед xcompmgr:\n\n```\nhsetroot -solid \"#000066\"\n```\n\n(можно заменить #000066 на любой другой цвет).\n\n"
    }
  ]
}