{
  "title": "XDG MIME Applications (Русский)",
  "url": "https://wiki.archlinux.org/title/XDG_MIME_Applications_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Ярлыки приложений\n- Окружение рабочего стола\n- Оконный менеджер\n- Приложения по умолчанию\n- xdg-utils (Русский)\n\nСпецификация XDG для приложений MIME основывается на общей базе данных MIME и ярлыках приложений для предоставления приложений по умолчанию.\n\n1. Программы описывают поддерживаемые MIME-типы, используя ярлыки приложений.\n1. Пакет desktop-file-utils регистрирует хук pacman для построения базы данных с кешем поддерживаемых MIME-типов на основе ярлыков приложений, см. update-desktop-database(1).\n1. Приложения могут устанавливать MIME-типы, добавляя XML-файлы в /usr/share/mime/packages/.\n1. Пакет shared-mime-info регистрирует хук pacman для построения общей базы данных с кешем MIME-типов, см. update-mime-database(1).\n1. Среды рабочего стола и пользователи могут изменять приложения по умолчанию и добавлять или удалять MIME-типы приложений, используя файлы mimeapps.list.\n\n"
    },
    {
      "title": "Общая база данных MIME",
      "level": 2,
      "content": "Спецификация от XDG для общей базы данных MIME-info способствует созданию общей базы данных MIME в среде рабочего стола и позволяет приложениям легко регистрировать новые типы MIME общесистемно.\n\nБаза данных построена из файлов XML, установленных пакетами в /usr/share/mime/packages/, используя инструменты из shared-mime-info.\n\nФайлы в /usr/share/mime/ не должны редактироваться напрямую, однако их можно сохранить в отдельную базу данных для каждого пользователя в ~/.local/share/mime/.\n\n\"Обработка схемы URI [..] обрабатывается через приложения, обрабатывающие MIME-тип x-scheme-handler/foo, где foo - это схема URI, о которой идет речь.\"[1]\n\n"
    },
    {
      "title": "Новый тип MIME",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nВ этом примере определяется новый тип MIME application/x-foobar и присваивается любому файлу с расширением .foo. Просто создайте следующий файл:\n\n```\n~/.local/share/mime/packages/application-x-foobar.xml\n```\n\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<mime-info xmlns=\"http://www.freedesktop.org/standards/shared-mime-info\">\n    <mime-type type=\"application/x-foobar\">\n        <comment>foo file</comment>\n        <icon name=\"application-x-foobar\"/>\n        <glob-deleteall/>\n        <glob pattern=\"*.foo\"/>\n    </mime-type>\n</mime-info>\n```\n\nА затем обновите базу данных MIME:\n\n```\n$ update-mime-database ~/.local/share/mime\n```\n\nКонечно, это ни на что не повлияет, если ярлыки приложения не связаны с типом MIME. Может потребоваться создание новых ярлыков приложений или редактирование mimeapps.list.\n\n"
    },
    {
      "title": "mimeapps.list",
      "level": 2,
      "content": "Стандарт XDG является наиболее распространённым для настройки среды рабочего стола. Приложения по умолчанию для каждого типа MIME хранятся в файлах mimeapps.list, которые могут храниться в нескольких местах. Они проверяются в следующем порядке, причём более ранние ассоциации имеют приоритет над более поздними:\n\nTable content:\nПуть | Применение\n~/.config/mimeapps.list | пользовательские переопределения\n/etc/xdg/mimeapps.list | общесистемные переопределения\n~/.local/share/applications/mimeapps.list | (Устаревшее) пользовательские переопределения\n/usr/local/share/applications/mimeapps.list/usr/share/applications/mimeapps.list | переопределения предоставляемые дистрибутивом по умолчанию\n\nКроме того, можно определить приложения по умолчанию, специфичные для конкретной среды рабочего стола, с помощью имени вида desktop-mimeapps.list где desktop это имя среды рабочего стола (из переменной окружения XDG_CURRENT_DESKTOP). Например, /etc/xdg/xfce-mimeapps.list определяет общесистемные переопределения приложений по умолчанию для Xfce. Эти переопределения для рабочего стола имеют приоритет над соответствующим файлом, не относящимся к среде рабочего стола. Например, файл /etc/xdg/xfce-mimeapps.list имеет приоритет над файлом /etc/xdg/mimeapps.list, но по-прежнему переопределяется файлом ~/.config/mimeapps.list.\n\n```\n$ ln -s ~/.config/mimeapps.list ~/.local/share/applications/mimeapps.list\n```\n\nТакже возможно получить список файлов, в которых происходит поиск MIME-типов, включив режим отладки с помощью переменной окружения XDG_UTILS_DEBUG_LEVEL=2 и выполнив, к примеру, команду xdg-mime query default <тип>.\n\n"
    },
    {
      "title": "Формат",
      "level": 3,
      "content": "Рассмотрим следующий пример:\n\n```\nmimeapps.list\n```\n\n```\n[Added Associations]\nimage/jpeg=bar.desktop;baz.desktop\nvideo/H264=bar.desktop\n[Removed Associations]\nvideo/H264=baz.desktop\n[Default Applications]\nimage/jpeg=foo.desktop\n```\n\nКаждый раздел назначает один или несколько ярлыков приложений типам MIME.\n\n- Added Associations (Добавленные ассоциации) указывают, что приложения поддерживают открытие этого типа MIME. Например, bar.desktop и baz.desktop могут открывать изображения JPEG. Это может повлиять на список приложений, который вы видите при щелчке правой кнопкой мыши по файлу в файловом менеджере.\n- Removed Associations (Удаленные ассоциации) указывают, что приложения не поддерживают этот тип MIME. Например, baz.desktop не может открыть видео H.264.\n- Default Applications (Приложения по умолчанию) указывают, что приложения должны выбираться по умолчанию для открытия этого типа MIME. Например, изображения JPEG должны быть открыты с помощью foo.desktop. Это неявно добавляет связь между приложением и типом MIME. Если есть несколько приложений, они проверяются по порядку.\n\nКаждый раздел является необязательным и может быть опущен, если он не нужен.\n\n"
    },
    {
      "title": "Утилиты",
      "level": 2,
      "content": "Хотя приложения по умолчанию и типы MIME можно настроить путём редактирования mimeapps.list и общей базы данных MIME, существует множество инструментов, которые упрощают данный процесс. Эти инструменты также важны, поскольку приложения могут делегировать открытие файлов этим инструментам, а не пытаться реализовать стандарт MIME-типов.\n\nЕсли вы используете среду рабочего стола, для начала проверьте, предоставляет ли она свою собственную утилиту. Она должна быть предпочтительнее альтернатив.\n\nОфициальные утилиты xdg-utils содержат инструменты для управления типами MIME и приложениями по умолчанию в соответствии со стандартом XDG (xdg-mime). Самое главное, что он предоставляет xdg-open, который многие приложения используют для открытия файла с его приложением по умолчанию.\n\n"
    },
    {
      "title": "lsdesktopf",
      "level": 3,
      "content": "lsdesktopfAUR предоставляет несколько способов поиска в базе данных MIME и ярлыков MIME на рабочем столе.\n\nНапример, чтобы увидеть все расширения MIME в файлах .desktop в системе, которые имеют тип MIME video, вы можете использовать lsdesktopf --gm -gx video или для поиска в файлах базы данных XML, используйте lsdesktopf --gdx -gx video. Чтобы получить краткий обзор того, сколько и какие файлы .desktop могут быть связаны с определенным типом MIME, используйте lsdesktopf --gen-mimeapps. Чтобы просмотреть все расширения имен файлов в файлах базы данных XML, используйте lsdesktopf --gdx -gfx.\n\n"
    },
    {
      "title": "selectdefaultapplication",
      "level": 3,
      "content": "selectdefaultapplication-gitAUR — это графическое приложение, которое показывает список всех приложений, поддерживающие различные MIME-типы, и позволяет быстро установить их по умолчанию для всех или некоторых MIME-типов (путём изменения mimeapps.list).\n\nОно также показывает «читаемое» имя и расширения файлов, так что вам не нужно запоминать названия MIME-типов.\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Если файл не открывается вашим желаемым приложением по умолчанию, существует несколько возможных причин. Вам может потребоваться проверить каждый случай.\n\n"
    },
    {
      "title": "Отсутствует ярлык приложения",
      "level": 3,
      "content": "Для связывания приложений с типами MIME требуются ярлыки приложений. Убедитесь, что такая запись существует и может использоваться для открытия (вручную) файлов в приложении.\n\n"
    },
    {
      "title": "Отсутствует ассоциация",
      "level": 3,
      "content": "Если в ярлыке приложения не указан тип MIME под его ключом MimeType, он не будет учитываться, когда приложение необходимо для открытия этого типа. Измените mimeapps.list, чтобы добавить связь между файлом .desktop и типом MIME.\n\n"
    },
    {
      "title": "Нет приложения по умолчанию",
      "level": 3,
      "content": "Если ярлык приложения связан с типом MIME, возможно, он просто не установлен по умолчанию. Измените mimeapps.list, чтобы задать связь по умолчанию.\n\n"
    },
    {
      "title": "Нестандартная ассоциация",
      "level": 3,
      "content": "Приложения могут игнорировать или частично реализовывать стандарт XDG. Проверьте использование устаревших файлов, таких как ~/.local/share/applications/mimeapps.list и ~/.local/share/applications/defaults.list. Если вы пытаетесь открыть файл из другого приложения (например, веб-браузера или файлового менеджера), проверьте, имеет ли это приложение собственный способ выбора приложений по умолчанию.\n\n"
    },
    {
      "title": "Переменные в файлах .desktop, которые влияют на запуск приложения",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nСреды рабочего стола и файловые менеджеры, поддерживающие спецификацию, запускают программы в соответствии с определением в файлах .desktop. Смотрите раздел Ярлыки приложений#Ярлык приложения.\n\nКак правило, настройка файлов .desktop, идущих в составе пакетов, не требуется, но иногда в них могут быть ошибки. Даже если приложение содержит необходимое описание MIME-типов в переменной MimeType в файле .desktop, иногда оно может запускаться неправильно или вообще не запускаться, или запускаться без открытия файла.\n\nЭто может произойти, например, если в переменной Exec отсутствуют внутренние параметры, необходимые для открытия файла или того, как приложение отображается в меню. Переменная Exec обычно начинается с %; чтобы узнать поддерживаемые параметры в настоящее время, см. переменные exec.\n\nВ следующей таблице перечислены основные записи переменных файлов .desktop которые влияют на запуск приложения, если у него есть связанный тип MIME.\n\nTable content:\nИмена переменных | Пример 1 | Пример 2 | Описание\nDBusActivatable | DBusActivatable=true | DBusActivatable=false | Приложение взаимодействует с D-Bus. Смотрите также настройки: D-Bus.\nMimeType | MimeType=application/vnd.oasis.opendocument.text | MimeType=application/vnd.sun.xml.math | Список типов MIME, поддерживаемых приложением\nStartupWMClass | StartupWMClass=google-chrome | StartupWMClass=xpad | Связывает окна с владельцем приложения\nTerminal | Terminal=true | Terminal=false | Запуск в терминале по умолчанию\n\n"
    }
  ]
}