{
  "title": "Xdg-open (Русский)",
  "url": "https://wiki.archlinux.org/title/Xdg-open_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "xdg-utils предоставляет официальные утилиты для управления MIME-приложениями XDG.\n\n- xdg-desktop-menu(1) — установка элементов меню рабочего стола\n- xdg-desktop-icon(1) — копирование ярлыков приложений на рабочий стол пользователя\n- xdg-email(1) — открытие предпочитаемого пользователем клиента электронной почты (с возможностью указания темы и других параметров создаваемого сообщения)\n- xdg-icon-resource(1) — установка значков\n- xdg-mime(1) — запрос и установка типов и ассоциаций MIME\n- xdg-open(1) — открытие файла или URI в предпочтительном приложении пользователя\n- xdg-screensaver(1) — разрешение, запрещение или приостановка хранителя экрана\n- xdg-settings(1) — установка веб-браузера и обработчиков URL-адресов по умолчанию\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет xdg-utils.\n\n"
    },
    {
      "title": "Переменные окружения",
      "level": 3,
      "content": "xdg-utils пытается интегрироваться с вашей средой рабочего стола, вызывая специализированные программы, которые она предоставляет, где это применимо. Выяснение текущей среды ребочего стола происходит так [1][устаревшая ссылка 2023-05-06 ⓘ]:\n\n- Если стандартная переменная окружения XDG_CURRENT_DESKTOP содержит одно из известных значений, то используется оно.\n- Если присутствуют какие-либо классические fallback'и или специфичные для среды переменные, такие как KDE_FULL_SESSION в KDE, то используется соответствующее значение.\n- Если старая переменная окружения DESKTOP_SESSION содержит одно из известных значений, то используется оно.\n\nКогда совпадение найдено, переменная DE внутренне перезаписывается нормализованным значением обнаруженной среды рабочего стола. Таким образом, DE — это и переменная окружения, и внутренняя переменная состояния xdg-utils. Например, если XDG_CURRENT_DESKTOP имеет значение KDE, то xdg-utils внутренне установит DE в значение kde. Если соответствие не найдено, то будет использовано любое ранее существующее значение DE; то есть, установка XDG_CURRENT_DESKTOP=KDE — это то же самое, как если бы переменная XDG_CURRENT_DESKTOP отсутствовала, а вместо неё была бы DE=kde. Это важная деталь реализации заслуживает внимания, так как следствие — предварительно установленная переменная DE игнорируется, если среда рабочего стола указана где-то ещё.\n\nЗначения переменных, которые распознаёт xdg-utils, следующие:\n\nTable content:\nСреда | XDG_CURRENT_DESKTOP | DE | DESKTOP_SESSION\n– | X-Generic1 | generic | –\nCinnamon | Cinnamon, X-Cinnamon | deepin | –\nDeepin | Deepin, DEEPIN, deepin1 | cinnamon | –\nEnlightenment | ENLIGHTENMENT1 | enlightenment | –\nGNOME | GNOME2 | gnome | gnome\nGNOME Flashback | GNOME-Flashback, GNOME-Flashback:GNOME2 | gnome | gnome\nKDE Plasma | KDE | kde | –\nLXDE | LXDE | lxde | LXDE\nLXQt | LXQt | lxqt | –\nMATE | MATE | mate | mate\nXfce | XFCE | xfce | xfce, xfce4, Xfce Session\n\n1. Это не среда, зарегистрированная на freedesktop.org.\n1. Варианты GNOME, в том числе режим GNOME Classic, рассматриваются xdg-utils как одно и то же.\n\nИмейте в виду, что это лишь список того, что способны обнаружить скрипты, которые предоставляет xdg-utils. Скрипты всё равно будут выполнять общие действия, не зависящие от среды, при следующих условиях:\n\n- Была запрошена общая процедура через XDG_CURRENT_DESKTOP=X-Generic или DE=generic.\n- Определить среду не удалось. Все соответствующие переменные окружения были не распознаны или не установлены, а поиск классических fallback'ов ни к чему не привёл.\n- Действия, специфичные для среды, были выполнены, но не увенчались успехом, например, из-за отсутствия нужной программы.\n\n"
    },
    {
      "title": "xdg-mime",
      "level": 3,
      "content": "xdg-mime(1) — это скрипт для прямого запроса и изменения стандартных приложений MIME. Он используется в других скриптах, таких как xdg-open, а также является полезным инструментом при устранении неполадок.\n\nОпределение MIME-типа файла:\n\n```\n$ xdg-mime query filetype photo.jpeg\nimage/jpeg\n```\n\nОпределение приложения по умолчанию для MIME-типа:\n\n```\n$ xdg-mime query default image/jpeg\ngimp.desktop\n```\n\nИзменение приложения по умолчанию для MIME-типа:\n\n```\n$ xdg-mime default feh.desktop image/jpeg\n```\n\nОтладка приложения по умолчанию для MIME-типа:\n\n```\n$ env XDG_UTILS_DEBUG_LEVEL=10  xdg-mime query default text/html\nChecking /home/пользователь/.config/mimeapps.list\nChecking /home/пользователь/.local/share/applications/defaults.list and /home/пользователь/.local/share/applications/mimeinfo.cache\nChecking /usr/local/share/applications/defaults.list and /usr/local/share/applications/mimeinfo.cache\nChecking /usr/share/applications/defaults.list and /usr/share/applications/mimeinfo.cache\nqutebrowser.desktop\n```\n\nКогда нужно определить MIME-тип файла, xdg-mime пытается использовать программу, подходящую для среды рабочего стола:\n\nTable content:\nСреда | Программа | Пакет\nCinnamon | gio | glib2\nGNOME\nGNOME Flashback\nLXDE\nMATE\nXfce\nDeepin | – | –\nEnlightenment\nLXQt\nKDE Plasma | kmimetypefinder | kde-cli-tools\n\nВ общем случае xdg-mime будет:\n\n- Обращаться к mimetype, если он доступен (пакет perl-file-mimeinfo).\n- Обращаться к file, если он доступен.\n\n"
    },
    {
      "title": "xdg-open",
      "level": 3,
      "content": "xdg-open(1) — это инструмент открытия ресурсов, используемый многими приложениями, реализующий стандарт XDG MIME Applications и при этом максимально интегрированный со средой рабочего стола.\n\nЕсли среда рабочего стола обнаружена, будет вызван предоставляемый ею обработчик [2][устаревшая ссылка 2023-05-06 ⓘ]:\n\nTable content:\nСреда | Программа | Пакет\nCinnamon | gio | glib2\nGNOME\nGNOME Flashback\nMATE\nDeepin | dde-open | deepin-api\nEnlightenment | enlightenment_open | enlightenment\nKDE Plasma | kde-open | kde-cli-tools\nLXDE | pcmanfm | pcmanfm\nLXQt | – | –\nXfce | exo-open1 | exo\n\n1. Также может быть предпринята попытка использования gio из пакета glib2.\n\nВ общем случае xdg-open:\n\n- Обратится к #xdg-mime, чтобы узнать связанное с ресурсом приложение по умолчанию, прочитает соответствующий .desktop файл и запустит прописанную в нём команду.\n- Обратится к run-mailcap, если он доступен (пакет run-mailcapAUR).\n- Обратится к mimeopen, если он доступен (пакет perl-file-mimeinfo).\n\nПоскольку xdg-mime полагается на пакет perl-file-mimeinfo для реализации стандарта XDG MIME Applications, если вы не используете среду рабочего стола, вам нужно либо установить пакет perl-file-mimeinfo, либо выбрать другой инструмент открытия ресурсов.\n\n"
    },
    {
      "title": "xdg-settings",
      "level": 3,
      "content": "См. xdg-settings(1).\n\nЯрлык для открытия всех веб-типов MIME с помощью одного приложения:\n\n```\n$ xdg-settings set default-web-browser firefox.desktop\n```\n\nЯрлык для установки приложения по умолчанию для схемы URL:\n\n```\n$ xdg-settings set default-url-scheme-handler irc xchat.desktop\n```\n\n"
    },
    {
      "title": "Обработчики URL схем",
      "level": 3,
      "content": "Для установки приложений по умолчанию для URL схем необходимо определить приложение по умолчанию для x-scheme-handler/* MIME-типов.\n\n```\n$ xdg-mime default firefox.desktop x-scheme-handler/https x-scheme-handler/http\n```\n\n"
    }
  ]
}