{
  "title": "Xephyr (Русский)",
  "url": "https://wiki.archlinux.org/title/Xephyr_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Xephyr — это X-сервер, который запускается внутри окна другого X-сервера.\n\nОн может быть полезен для обхода проблем плохо написанного приложения. Например, серверами Supermicro можно управлять с помощью java-приложения ipmi kvm viewer. Во время перезагрузки сервера приложение часто пересоздаёт свое окно и таким образом переводит фокус на себя. Это происходит несколько раз в минуту и фактически делает работу невозможной. При этом не очевидно, как сделать правило окна, которое не позволит окну такого приложения получить фокус при создании, потому что вы хотите, чтобы оно получило фокус при первом запуске. Использование xephyr позволит изолировать такие окна в отдельном окне, что предотвратит изменение фокуса на основном X-сервере.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет xorg-server-xephyr.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "Для запуска вложенного сеанса X выберите свободный номер дисплея и выполните примерно такую команду:\n\n```\n$ Xephyr -br -ac -noreset -screen 800x600 :1\n```\n\nОна создаст окно Xephyr, которое в данном примере использует номер дисплея :1. Чтобы запустить приложение внутри этого окна, укажите этот номер дисплея перед запуском:\n\n```\n$ DISPLAY=:1 xterm\n```\n\n"
    },
    {
      "title": "Запуск оконного менеджера",
      "level": 3,
      "content": "Аналогичным образом можно запустить оконный менеджер внутри Xephyr, например:\n\n```\n$ DISPLAY=:1 spectrwm\n```\n\nИли запустить xinitrc с помощью startx:\n\n```\n$ startx -- /usr/bin/Xephyr :1\n```\n\n"
    },
    {
      "title": "Захват мыши и клавиатуры",
      "level": 3,
      "content": "Нажатие Ctrl+Shift захватит мышь и клавиатуру, так что весь ввод будет перенаправляться в окно Xephyr. Повторное нажатие отключает захват.\n\n"
    },
    {
      "title": "Отправка Alt+Tab",
      "level": 3,
      "content": "Если вы используете KDE, создайте правило окна, чтобы игнорировать глобальные сочетания клавиш. Тогда вы сможете использовать Alt+Tab внутри Xephyr.\n\n"
    },
    {
      "title": "Советы и рекомендации",
      "level": 2,
      "content": "Другие примеры ситуаций, в которых Xephyr может быть полезен:\n\n1. Тестирование X-приложения или функции, при котором тестировщик хотел бы продолжать работать в своей обычной среде X, защищая при этом другие приложения от сбоев тестируемого приложения.\n1. OpenSSH (Русский)#Проброс X11 описывает три настройки сервера sshd для проброса X11 через ssh. Две из них являются настройками по умолчанию. Если клиент не может попросить администратора ssh-сервера изменить третий параметр X11Forwarding на yes, обходной путь, описанный на странице Forwarding X11 over ssh, предлагает использовать Xephyr.\n\n"
    }
  ]
}