{
  "title": "Xfce (Português)",
  "url": "https://wiki.archlinux.org/title/Xfce_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- GNOME\n- KDE Plasma\n- LXDE\n- Thunar\n- Xfwm\n\nXfce is a lightweight and modular desktop environment based on GTK. To provide a complete user experience, it includes a window manager, a file manager, desktop and panel.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the xfce4 group. You may also wish to install the xfce4-goodies group which includes extra plugins and a number of useful utilities such as the mousepad editor. Xfce uses the Xfwm window manager by default.\n\n"
    },
    {
      "title": "Starting",
      "level": 2,
      "content": "Choose Xfce Session from the menu in a display manager of choice, or add exec startxfce4 to Xinitrc.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Xfce stores configuration options in Xfconf. There are several ways to modify these options:\n\n- In the main menu, select Settings and the category you want to customize. Categories are programs usually located in /usr/bin/xfce4-* and /usr/bin/xfdesktop-settings.\n- xfce4-settings-editor can see and modify all settings. Options modified here will take effect immediately. Use xfconf-query to change settings from the commandline; see the documentation for details.\n- Settings are stored in XML files in ~/.config/xfce4/xfconf/xfce-perchannel-xml/ which can be edited by hand. However, changes made here will not take effect immediately.\n\n"
    },
    {
      "title": "Menu",
      "level": 3,
      "content": "See Xdg-menu for more info on using the Free Desktop menu system.\n\n"
    },
    {
      "title": "Whisker menu",
      "level": 4,
      "content": "xfce4-whiskermenu-plugin (also part of xfce4-goodies) is an alternative application launcher. It shows a list of favorites, browses through all installed applications through category buttons, and supports fuzzy searching. After package being installed, it can replace Applications Menu as first item in Panel 1 (in Settings > Panel > Items add Whisker Menu).\n\nTo set a keyboard shortcut to launch the whisker menu, go to Settings > Keyboard and then the Application Shortcuts tab. Click on the Add button, set the command to xfce4-popup-whiskermenu and assign the desired keyboard shortcut.\n\n"
    },
    {
      "title": "Edit entries",
      "level": 4,
      "content": "A number of graphical tools are available for this task:\n\n- MenuLibre — An advanced menu editor that provides modern features in a clean, easy-to-use interface.\n\n- Alacarte — Menu editor for GNOME\n\n- XAME (XFCE Applications Menu Editor) — GUI tool written in Gambas designed specifically for editing menu entries in Xfce, it will not work in other environments. (Discontinued)\n\nAlternatively, create the file ~/.config/menus/xfce-applications.menu manually. See the example configuration below:\n\n```\n<!DOCTYPE Menu PUBLIC \"-//freedesktop//DTD Menu 1.0//EN\"\n  \"http://www.freedesktop.org/standards/menu-spec/1.0/menu.dtd\">\n\n<Menu>\n    <Name>Xfce</Name>\n    <MergeFile type=\"parent\">/etc/xdg/menus/xfce-applications.menu</MergeFile>\n\n    <Exclude>\n        <Filename>xfce4-run.desktop</Filename>\n        <Filename>exo-terminal-emulator.desktop</Filename>\n        <Filename>exo-file-manager.desktop</Filename>\n        <Filename>exo-mail-reader.desktop</Filename>\n        <Filename>exo-web-browser.desktop</Filename>\n        <Filename>xfce4-about.desktop</Filename>\n        <Filename>xfhelp4.desktop</Filename>\n    </Exclude>\n\n    <Layout>\n        <Merge type=\"all\"/>\n        <Separator/>\n        <Menuname>Settings</Menuname>\n        <Separator/>\n        <Filename>xfce4-session-logout.desktop</Filename>\n    </Layout>\n</Menu>\n```\n\nThe <MergeFile> tag includes the default Xfce menu.\n\nThe <Exclude> tag excludes applications which we do not want to appear in the menu. Here we excluded some Xfce default shortcuts, but you can exclude firefox.desktop or any other application.\n\nThe <Layout> tag defines the layout of the menu. The applications can be organized in folders or however we wish. For more details see the Xfce wiki.\n\nYou can also make changes to the Xfce menu by editing the .desktop files themselves. To hide entries, see Desktop entries#Hide desktop entries. You can edit the application's category by modifying the Categories= line of the desktop entry, see Desktop entries#File example.\n\n"
    },
    {
      "title": "Set preferred applications",
      "level": 4,
      "content": "To change the default applications used for opening certain resources, use the Preferred Applications setting. This will change the behavior of exo-open, which is invoked by resource openers such as xdg-open.\n\n"
    },
    {
      "title": "Remove desktop icons",
      "level": 4,
      "content": "Issue the following command:\n\n```\n$ xfconf-query -c xfce4-desktop -v --create -p /desktop-icons/style -t int -s 0\n```\n\nTo reinstate icons on the desktop, issue the same command with a value of 2.\n\n"
    },
    {
      "title": "Kill window shortcut",
      "level": 4,
      "content": "Xfce does not have a shortcut to kill a window, for example when a program freezes.\n\nWith xorg-xkill, use xkill to interactively kill a window. For the currently active window, use xdotool:\n\n```\n$ xdotool getwindowfocus windowkill\n```\n\nAlternatively:\n\n```\n$ sh -c \"xkill -id $(xprop -root -notype | sed -n '/^_NET_ACTIVE_WINDOW/ s/^.*# *\\|\\,.*$//g p')\"\n```\n\nTo add the shortcut, use Settings > Keyboard or an application like xbindkeys.\n\n"
    },
    {
      "title": "Autostart",
      "level": 4,
      "content": "To launch custom applications when Xfce starts up, click the Applications Menu > Settings > Settings Manager and then choose the Session and Startup option and click the tab Application Autostart. You will see a list of programs that get launched on startup. To add an entry, click the Add button and fill out the form, specifying the path to an executable you want to run.\n\nAutostart application location paths are described in the XDG Autostart specification.\n\nAlternatively, add the commands you wish to run (including setting environment variables) to xinitrc (or xprofile when a display manager is being used).\n\nNote: **delay the startup of an application** \n\n"
    },
    {
      "title": "Lock the screen",
      "level": 4,
      "content": "xflock4 is the reference Shell script which is used to lock an Xfce session.\n\nIt tries to lock the screen with these screen lockers in the specified order:\n\n- xfce4-screensaver (also part of xfce4-goodies)\n- cinnamon-screensaver\n- mate-screensaver\n- Screen lockers providing the org.freedesktop.ScreenSaver.Lock D-Bus method (e.g. light-locker)\n- xdg-screensaver(1) from xdg-utils\n- xscreensaver\n\nIt exits with return code 1 if it fails to find any of these.\n\nThe List of applications/Security#Screen lockers contains a short description of these screen lockers together with other popular applications.\n\nTo have xflock4 run a custom session locker, set LockCommand in the session's xfconf channel to the command line to be used:\n\n```\n$ xfconf-query --create -c xfce4-session -p /general/LockCommand -t string -s \"session-locker-command\"\n```\n\nThe panel lock button in the Action Buttons panel simply executes /usr/bin/xflock4. It should work as expected as long as xflock4 is functioning i.e. one of the native lockers is installed or a custom locker is configured to integrate with it as proposed above.\n\n"
    },
    {
      "title": "Suspend",
      "level": 4,
      "content": "Whether or not the session is systematically locked on suspend can be configured through the xfconf properties or from the GUI.\n\nTo prevent locking on suspend using the CLI, turn lock-screen-suspend-hibernate to false:\n\n```\n$ xfconf-query -c xfce4-power-manager -p /xfce4-power-manager/lock-screen-suspend-hibernate -s false\n```\n\nSimilarly, turn it to true to lock the session on suspend.\n\nThe setting can also be controlled from the GUI: open the Session and Startup application and turn the flag General > Lock screen before sleep on or off.\n\nWhenever the suspend keyboard button is pressed, it can be handled by either Xfce's power manager or by systemd-logind. To give precedence to logind, the following xfconf setting must be set to true:\n\n```\n$ xfconf-query --create -c xfce4-power-manager -p /xfce4-power-manager/logind-handle-suspend-key -t bool -s true\n```\n\n"
    },
    {
      "title": "Disable saved sessions",
      "level": 4,
      "content": "Per user, saved sessions can be disabled by unchecking Applications > Settings > Session and Startup > General > Automatically save session on logout or by executing the following command:\n\n```\n$ xfconf-query --create -c xfce4-session -p /general/SaveOnExit -t bool -s false\n```\n\nAlternatively, Xfce kiosk mode can be used to disable the saving of sessions systemwide. To disable sessions, create or edit the file /etc/xdg/xfce4/kiosk/kioskrc and add the following:\n\n```\n[xfce4-session]\nSaveSession=NONE\n```\n\nYou may need to remove previously saved sessions. Navigate to Applications > Settings > Session and Startup > Saved Sessions and press the Clear Saved Sessions button, or simply delete the ~/.cache/sessions/ directory.\n\n"
    },
    {
      "title": "Use a different window manager",
      "level": 4,
      "content": "The files specifying the default window manager are found in the following locations:\n\n- ~/.config/xfce4/xfconf/xfce-perchannel-xml/xfce4-session.xml - per user\n- /etc/xdg/xfce4/xfconf/xfce-perchannel-xml/xfce4-session.xml - systemwide\n\nThe default window manager for the user can be set easily using xfconf-query:\n\n```\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client0_Command -t string -sa xfsettingsd\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client1_Command -t string -sa wm_name\n```\n\nIf you want to start the window manager with command line options, see the commands below:\n\n```\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client0_Command -t string -sa xfsettingsd\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client1_Command -t string -s wm_name -t string -s --wm-option\n```\n\nIf you need more command line options, simply add more -t string and -s --wm-option arguments to the command.\n\nIf you want to change the default window manager systemwide, edit the file specified above manually, changing xfwm4 to the preferred window manager and adding more <value type=\"string\" value=\"--wm-option\"/> lines for extra command line options if needed.\n\nYou can also change the window manager by autostarting wm_name --replace using the autostart facility or by running wm_name --replace & in a terminal and making sure the session is saved on logout. Be aware though that this method does not truly change the default manager, it merely replaces it at login. Note that if you are using the autostart facility, you should disable saved sessions as this could lead to the new window manager being started twice after the default window manager.\n\n"
    },
    {
      "title": "Theming",
      "level": 3,
      "content": "XFCE themes are available at xfce-look.org. Xfwm themes are stored in /usr/share/themes/theme_name/xfwm4, and set in Settings > Window Manager. GTK themes are stored in /usr/share/themes/theme_name/gtk-2.0 and /usr/share/themes/theme_name/gtk-3.0 and are set in Settings > Appearance.\n\nTo achieve a uniform look for all applications, see Uniform look for Qt and GTK applications.\n\nSee also Cursor themes, Icons, and Font configuration.\n\n"
    },
    {
      "title": "Consistent Look Between SSD and CSD Windows",
      "level": 4,
      "content": "Xfce currently uses Server-Side Decorations (SSD) (see Wikipedia:Window decoration) themed by Xfwm for most windows and Client-side decoration (CSD) themed by the respective programs for Xfce Settings, Print, Save, and other dialogs.\n\nXfwm SSD window styles can be themed to match the CSD windows by manually adjusting or creating themes in /usr/share/themes/theme_name/xfwm4 or by using a tool such as the Xfwm4 Theme Generator which \"Creates xfwm4 themes from client side decorations.\"\n\n"
    },
    {
      "title": "Reverting Client-Side Decorations",
      "level": 4,
      "content": "With Xfce 4.18, client-side decorations are optional and disabled by default. [1]\n\nNon-Xfce applications may still use client-side decorations. To disable them globally, see GTK#Client-side decorations.\n\n"
    },
    {
      "title": "Sound themes",
      "level": 4,
      "content": "XFCE4 supports freedesktop system sounds, but it is not configured out of the box.\n\nTo enable a sound theme:\n\n1. Check Enable event sounds in Settings > Appearance > Settings;\n1. In the Settings Editor set xsettings/Net/SoundThemeName to a sound theme located in /usr/share/sounds/;\n1. Turn on System Sounds in audio mixer (e.g. pavucontrol).\n\nsound-theme-freedesktop provides a compatible sound theme, but it lacks many required events. A better choice is sound-theme-smoothAUR (SoundThemeName should be Smooth).\n\n"
    },
    {
      "title": "Keyboard volume buttons",
      "level": 4,
      "content": "xfce4-pulseaudio-plugin provides a panel applet which has support for keyboard volume control and volume notifications. As an alternative, you can install xfce4-volumed-pulse, which also provides keybinding and notification control, but without an icon sitting in the panel. This is handy, for example, when using pasystray at the same time for a finer control.\n\nAlternatively, xfce4-mixer also provides a panel applet and keyboard shortcuts. The Arch package only supports ALSA, but you can rebuild it manually to add PulseAudio support.\n\nAfter installing the panels, you have to add it to the taskbar or the keyboard shortcuts will not work.\n\nFor non desktop environment specific alternatives, see List of applications/Multimedia#Volume control.\n\nIf you are not using an applet or daemon that controls the volume keys, you can map volume control commands to your volume keys manually using Xfce's keyboard settings. For the sound system you are using, see the sections linked to below for the appropriate commands.\n\n- ALSA: see Advanced Linux Sound Architecture#Keyboard volume control.\n- PulseAudio: see PulseAudio#Keyboard volume control.\n- OSS: see OSS#Keyboard volume control.\n\n"
    },
    {
      "title": "Keyboard shortcuts",
      "level": 3,
      "content": "Keyboard shortcuts are defined in two places: Settings > Window Manager > Keyboard, and Settings > Keyboard > Shortcuts.\n\n"
    },
    {
      "title": "Polkit Authentication Agent",
      "level": 3,
      "content": "The polkit-gnome agent will be installed along with xfce4-session and autostarted automatically; no user intervention is required. For more information, see Polkit#Authentication agents.\n\nA third party polkit authentication agent for Xfce is also available, see xfce-polkitAUR or xfce-polkit-gitAUR.\n\n"
    },
    {
      "title": "Display blanking",
      "level": 3,
      "content": "Some programs that are commonly used with Xfce will control monitor blanking and DPMS (monitor powersaving) settings. They are discussed below.\n\nXfce Power Manager controls DPMS settings only. They can be configured in the Power Manager GUI within the Display tab.\n\nNote that when Display power management is turned off, DPMS is fully disabled, but this does not mean that Power Manager will simply stop controlling DPMS. However, it does not control screen blanking, which may remain enabled even after display power management is disabled. [2] To disable both blanking and DPMS, right click on the power manager system tray icon or left click on the panel applet and make sure that the option labelled Presentation mode is ticked.\n\nIf xscreensaver is installed and runs alongside Xfce Power Manager, it may not be clear which application is in control of blanking and DPMS as both are competing for control of the same settings. Therefore, in a situation where it is important that the monitor not be blanked (when watching a video for instance), it is advisable to disable blanking and DPMS through both applications. To know more about XScreenSaver options, see XScreenSaver#DPMS and blanking settings.\n\nIf neither of the above applications are running, then blanking and DPMS settings can be controlled using the xset command, see DPMS#Runtime settings.\n\n"
    },
    {
      "title": "Mounting support for Thunar and xfdesktop",
      "level": 3,
      "content": "If plugged external drives does not appear and installation partitions are shown as mounted devices, on the desktop and in Thunar, install gvfs. See Udisks#Hide selected partitions for more advanced configuration options.\n\n"
    },
    {
      "title": "Screenshots",
      "level": 3,
      "content": "Xfce has its own screenshot tool, xfce4-screenshooter. It is part of the xfce4-goodies group.\n\nDefault keyboard shortcuts: Print opens the main dialog window, Alt+Print takes a screenshot of the active window, Shift+Print allows you to select a region to be captured.\n\nAlternatively, an independent screenshot program like scrot can be used.\n\n"
    },
    {
      "title": "Terminal color themes or palettes",
      "level": 3,
      "content": "Terminal color themes or palettes can be changed in the GUI, under the Colors tab in Preferences. These are the colors that are available to most console applications like Emacs, Vi and so on.\n\nThe settings are stored in Xfconf. Although you can edit them directly, it might be more convenient to download or create a color preset file. The default presets are stored in /usr/share/xfce4/terminal/colorschemes/, custom presets can be placed in ~/.local/share/xfce4/terminal/colorschemes/. You can select a preset in Preferences > Colors > Presets.\n\nCheck forum thread Terminal Colour Scheme Screenshots for hundreds of available choices and themes.\n\nA commented example of a color preset file:\n\n```\n~/.local/share/xfce4/terminal/colorschemes/tango-gray.theme\n```\n\n```\n[Scheme]\n\n# Name of the color preset\nName=Tango (gray background)\n\n# Name translated into other languages\nName[ru]=Танго (серый фон)\n\n# Color values are CSS colors (e.g. #ff0000, #ffff00000000, rgb(255, 0, 0) or red)\n\nColorForeground=white\nColorBackground=#323232\n\n# 16 colors separated by semicolon:\n# black;red;green;yellow;blue;purple;cyan;light-gray;gray;bright-red;bright-green;bright-yellow;bright-blue;bright-purple;bright-cyan;white\nColorPalette=#2e3436;#cc0000;#4e9a06;#c4a000;#3465a4;#75507b;#06989a;#d3d7cf;#555753;#ef2929;#8ae234;#fce94f;#739fcf;#ad7fa8;#34e2e2;#eeeeec\n\n# Uncomment to override:\n\n# TabActivityColor=#ef2929\n\n# ColorCursor=white\n# ColorCursorForeground=#323232\n# ColorCursorUseDefault=FALSE\n\n# ColorSelectionBackground=#ad7fa8\n# ColorSelection=#323232\n# ColorSelectionUseDefault=FALSE\n\n# ColorBold=white\n# ColorBoldUseDefault=FALSE\n\n# \"Vary the background color for each tab\"\n# ColorBackgroundVary=TRUE\n\n# \"Use system theme colors for text and background\"\n# ColorUseTheme=TRUE\n```\n\n"
    },
    {
      "title": "env-modules autocompletion in Terminal",
      "level": 3,
      "content": "The env-modulesAUR package provides shell autocompletion for login shells. However, by default, sessions in xfce4-terminal are not considered as login. To enable autocompletion for Environment Modules, tick the Run command as login shell checkbox in Preferences > General.\n\n"
    },
    {
      "title": "Colour management",
      "level": 3,
      "content": "Xfce has no native support for colour management. [5] See ICC profiles for alternatives.\n\n"
    },
    {
      "title": "Multiple monitors",
      "level": 3,
      "content": "Xfce has support for multiple monitors, which can be configured in the Applications > Settings > Display dialog. In the Advanced tab, one can save profiles for different monitors and have them applied automatically as soon as the connected monitors change. For more information, see the display article from the Xfce documentation.\n\nAlternatively, one can use arandr to manage display configurations in the form of xrandr commands which can be assigned to Xfce keyboard shortcuts.\n\n"
    },
    {
      "title": "SSH agents",
      "level": 3,
      "content": "By default, Xfce will try to load gpg-agent and ssh-agent. Since gpg-agent is handled by systemd, you may want to disable it in the Xfce settings:\n\n```\n$ xfconf-query --create -c xfce4-session -p /startup/gpg-agent/enabled -t bool -s false\n```\n\nIf you plan to use the ssh-agent.service user unit as described in SSH keys#Start ssh-agent with systemd user, disable ssh-agent in the Xfce settings as well:\n\n```\n$ xfconf-query --create -c xfce4-session -p /startup/ssh-agent/enabled -t bool -s false\n```\n\nTo use GNOME Keyring, simply tick the checkbox Launch GNOME services on startup in the Advanced tab of Session and Startup in Xfce's settings. This will also disable gpg-agent and ssh-agent.\n\nSource: https://docs.xfce.org/xfce/xfce4-session/advanced#ssh_and_gpg_agents\n\n"
    },
    {
      "title": "Scroll a background window without shifting focus on it",
      "level": 3,
      "content": "Go to Main Menu > Settings > Window Manager Tweaks > Accessibility tab. Uncheck Raise windows when any mouse button is pressed.\n\n```\n$ xfconf-query --channel xfwm4 --property /general/raise_with_any_button --set false\n```\n\n"
    },
    {
      "title": "Mouse button modifier",
      "level": 3,
      "content": "By default, the mouse button modifier in Xfce is set to Alt. This can be changed with xfconf-query. For instance, the following command will set the Super key as the mouse button modifier:\n\n```\n$ xfconf-query -c xfwm4 -p /general/easy_click -n -t string -s \"Super\"\n```\n\nStrictly speaking, using multiple modifiers is not supported. However, as a workaround, multiple modifiers can be specified if the key names are separated with ><. For instance, to set Ctrl+Alt as the mouse button modifier, you can use the following command:\n\n```\n$ xfconf-query -c xfwm4 -p /general/easy_click -n -t string -s \"Ctrl><Alt\"\n```\n\n"
    },
    {
      "title": "Limit the minimum brightness of the brightness-slider",
      "level": 3,
      "content": "Limiting the minimum brightness can be useful for displays which turn off backlight on a brightness level of 0. In xfce4-power-manager 1.3.2 a new hidden option had been introduced to set a minimum brightness value with a xfconf4-property. Add brightness-slider-min-level as an int property in xfconf4. Adjust the int value to get a suitable minimum brightness level.\n\n```\n$ xfconf-query --channel xfce4-power-manager --property '/xfce4-power-manager/brightness-slider-min-level' --create --type int --set 0\n```\n\n"
    },
    {
      "title": "Adding profile pictures",
      "level": 3,
      "content": "To add profile pictures for each user to be displayed in the whisker-menu, simply place a 96x96 PNG file in /home/user/.face.\n\nImage editing programs like GIMP can be used to scale your favourite images down to 96x96 and convert it.\n\n"
    },
    {
      "title": "Power manager plugin label",
      "level": 3,
      "content": "The xfconf option show-panel-label of type int controls the label of the power manager, it can be configured for different label formats: it can be set to 0 (no label), 1 (percentage), 2 (remaining time) or 3 (both).\n\nIt is also accessible through the power manager plugin GUI in Properties > Show label\n\n"
    },
    {
      "title": "Using the Windows (Super) key for shortcuts",
      "level": 3,
      "content": "The Super key is treated as a modifier key, like Ctrl and Alt, instead of producing a keypress. Assigning an action to it will keep you from using it for other shortcuts, because it will trigger that action in addition to whatever else you assign to it.\n\nTo get around this, and make it more useful for shortcuts, install the application xcape. This lets you configure modifier keys to act as other keys when pressed and released on their own.\n\nNext, go to Settings > Keyboard > Application Shortcuts and assign an unused key combination, say Alt+F1, to the Application menu (or whatever action you want when you press the Super key by itself). Test that it works. Next, use xcape to assign Alt+F1 to the Super key:\n\n```\n$ xcape -e 'Super_L=Alt_L|F1'\n```\n\nCheck that the Super key now performs the action you assigned to Alt+F1.\n\nIf all is well, make this an autostart action; go to Settings > Session and Startup > Application Autostart tab, press the Add button and enter the command there to make it run every time you start Xfce (if xcape was already installed, also check that there is not already a similar entry registered).\n\nNow, you can freely use the Super key in shortcuts. For example: In Window Manager > Keyboard, you can use Super and Up or Down for Raise window or Lower window.\n\n"
    },
    {
      "title": "Using the experimental Wayland support",
      "level": 3,
      "content": "Xfce supports both labwc and wayfireAUR as its Wayland compositor. However, only labwc works out of the box; Wayfire requires additional tweaking to the session file to make it work. For this purpose this section focuses on getting Xfce working with labwc as it requires the least effort to get Xfce working in Wayland.\n\nAfter installing labwc, you should be able to switch to the Xfce Session (Wayland) option in your display manager of choice and log in as usual. Note that Wayland support is marked as experimental for a good reason: things will not work like you expect it to and a lot of stuff are generally broken. For example, desktop icons placed by xfdesktop may appear and disappear as the desktop gain and lose focus.\n\n"
    },
    {
      "title": "Using labwc custom keymaps",
      "level": 4,
      "content": "The labwc configuration files for Xfce are located in ~/.config/xfce4/labwc/ instead of the default labwc directory ~/.config/labwc/. If you have a custom environment file with keymaps in it, you need a lock file ~/.config/xfce4/labwc/lock, otherwise the layout gets overwritten by startxfce4 with the system's default layout.\n\n"
    },
    {
      "title": "Modifying setting does not take effect",
      "level": 3,
      "content": "If you are running a separate Xsettings daemon, it may make some configuration not taking effect. Disable it by removing or commenting the corresponding line and restart Xorg.\n\n"
    },
    {
      "title": "NVIDIA and xfce4-sensors-plugin",
      "level": 3,
      "content": "To detect and use the sensors of an NVIDIA GPU, install libxnvctrl and then rebuild xfce4-sensors-plugin with ABS. Another option is xfce4-sensors-plugin-nvidiaAUR which replaces xfce4-sensors-plugin.\n\n"
    },
    {
      "title": "Panel applets keep being aligned on the left",
      "level": 3,
      "content": "Add a separator someplace before the right end and set its \"expand\" property. [6]\n\n"
    },
    {
      "title": "Restore default settings",
      "level": 3,
      "content": "If for any reason you need to revert back to the default settings, remove or rename ~/.config/xfce4/:\n\n```\n$ mv ~/.config/xfce4/ ~/.config/xfce4-bak\n```\n\nRelogin for changes to take effect. If you get Unable to load a failsafe session upon login, see the #Session failure section.\n\n"
    },
    {
      "title": "Session failure",
      "level": 3,
      "content": "Symptoms include:\n\n- The mouse is an X and/or does not appear at all;\n- Window decorations have disappeared and windows cannot be closed;\n- Desktop turns grey and all desktop icons disappear;\n- (xfwm4-settings) will not start, reporting These settings cannot work with your current window manager (unknown);\n- Errors reported by a display manager such as No window manager registered on screen 0;\n- Unable to load a failsafe session:\n\n```\nUnable to load a failsafe session.\nUnable to determine failsafe session name.  Possible causes: xfconfd is not running (D-Bus setup problem); environment variable $XDG_CONFIG_DIRS is set incorrectly (must include \"/etc\"), or xfce4-session is installed incorrectly.\n```\n\nRestarting Xfce or rebooting your system may solve the problem, but a corrupt session could also be the cause. Delete the session folder:\n\n```\n$ rm -r ~/.cache/sessions/\n```\n\nAlso make sure that the relevant folders in $HOME are owned by the user starting xfce4. See Chown.\n\n"
    },
    {
      "title": "Mousepad editor menu bar is not visible",
      "level": 3,
      "content": "Run the following to make it visible:\n\n```\n$ gsettings set org.xfce.mousepad.preferences.window menubar-visible true\n```\n\n"
    },
    {
      "title": "Trash icon not visible and trash applet does not work",
      "level": 3,
      "content": "Trash requires the optional dependency gvfs to work. Install gvfs and reboot the system.\n\n"
    },
    {
      "title": "Wayland support not working",
      "level": 3,
      "content": "If you are trying to get Xfce working with WayfireAUR, additional editing must be done to the session files to make it work.\n\nIf not, make sure you have labwc installed.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Xfce - Documentation\n- Xfce - Wiki\n- Xfce - About\n- Xfce - Tour\n- Wikipedia:Xfce\n- Xfce-Look - Themes, wallpapers, and more.\n- Xfce Wikia\n\n"
    }
  ]
}