{
  "title": "Xfce (Русский)",
  "url": "https://wiki.archlinux.org/title/Xfce_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Среда рабочего стола\n- Оконный менеджер\n- Xfwm (Русский)\n- Thunar (Русский)\n- LXDE (Русский)\n- GNOME (Русский)\n\nXfce это легковесная и модульная среда рабочего стола базирующаяся на библиотеке GTK 3. Для предоставления полного спектра возможностей пользователям включает в себя оконный менеджер, файловый менеджер, рабочий стол и панель инструментов.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите группу xfce4. Также по желанию можете установить группу xfce4-goodies содержащую дополнительные плагины и некоторые полезные утилиты, например редактор mousepad. Xfce по умолчанию использует оконный менеджер Xfwm.\n\n"
    },
    {
      "title": "Запуск",
      "level": 2,
      "content": "Выберите Сеанс Xfce в меню вашего экранного менеджера или добавьте exec startxfce4 в Xinitrc.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Xfce для хранения настроек использует иерархическую систему Xfconf. Есть несколько способов поменять конфигурацию:\n\n- В главном меню выберите Настройки и выберите нужную вам категорию. Категории это программы которые обычно находятся в /usr/bin/xfce4-* и /usr/bin/xfdesktop-settings.\n- В xfce4-settings-editor вы можете просматривать и менять все возможные настройки. Настройки измененные здесь будут применены немедлено. Для изменения настроек из командной строки используйте xfconf-query, смотрите документацию для подробностей.\n- Также настройки хранятся в XML файлах в каталоге ~/.config/xfce4/xfconf/xfce-perchannel-xml/. Изменения здесь будут применены только после перезапуска оболочки или системы.\n\n"
    },
    {
      "title": "Меню",
      "level": 3,
      "content": "Смотрите Xdg-menu для подробной информации об использовании стандарта меню Free Desktop.\n\n"
    },
    {
      "title": "Меню Whisker",
      "level": 4,
      "content": "Пакет xfce4-whiskermenu-plugin (содержится в группе xfce4-goodies) это альтернативный лаунчер приложений. Он показывает список часто используемых приложений, позволяет просматривать приложения по категориям и вести поиск по нечетким определениям. После установки он заменит стандартный лаунчер приложений в Панели 1.\n\n"
    },
    {
      "title": "Редактирование пунктов меню",
      "level": 4,
      "content": "Графические утилиты для редактирования меню:\n\n- MenuLibre — Продвинутый редактор меню предлагающий современный, легкий и чистый интерфейс.\n\n- Alacarte — Редактор меню из окружения GNOME\n\n- XAME (XFCE Applications Menu Editor) — Графическая утилита, написанная на Gambas, разработана специально для Xfce и не работает в других окружениях.(Проект заброшен)\n\nВы можете создать файл ~/.config/menus/xfce-applications.menu вручную. Пример такого файла:\n\n```\n<!DOCTYPE Menu PUBLIC \"-//freedesktop//DTD Menu 1.0//EN\"\n  \"http://www.freedesktop.org/standards/menu-spec/1.0/menu.dtd\">\n\n<Menu>\n    <Name>Xfce</Name>\n    <MergeFile type=\"parent\">/etc/xdg/menus/xfce-applications.menu</MergeFile>\n\n    <Exclude>\n        <Filename>xfce4-run.desktop</Filename>\n        <Filename>exo-terminal-emulator.desktop</Filename>\n        <Filename>exo-file-manager.desktop</Filename>\n        <Filename>exo-mail-reader.desktop</Filename>\n        <Filename>exo-web-browser.desktop</Filename>\n        <Filename>xfce4-about.desktop</Filename>\n        <Filename>xfhelp4.desktop</Filename>\n    </Exclude>\n\n    <Layout>\n        <Merge type=\"all\"/>\n        <Separator/>\n        <Menuname>Settings</Menuname>\n        <Separator/>\n        <Filename>xfce4-session-logout.desktop</Filename>\n    </Layout>\n</Menu>\n```\n\nТег <MergeFile> содержит путь до файла меню Xfce.\n\nТег <Exclude> содержит исключенные приложении, которые вы не хотите видеть в меню. В примере исключены некоторые ярлыки стандартных приложений Xfce, но вы можете исключить любое приложение, например firefox.desktop.\n\nТег <Layout> определяет компоновку меню. Приложения могут быть организованы по папкам. Для подробностей смотрите вики-страницу Xfce.\n\nВы также можете редактировать файлы .desktop для внесения изменений в меню Xfce. Чтобы спрятать пункты меню, смотрите Ярлыки приложений#Скрытие ярлыков. Вы можете поменять категорию приложения редактированием строки Categories= в файле ярлыка, подробнее Ярлыки приложений#Пример файла.\n\n"
    },
    {
      "title": "Прозрачный фон для названия иконок",
      "level": 4,
      "content": "Для смены стандартного белого фона названия иконок на более подходящий, создайте и отредактируйте ~/.gtkrc-2.0:\n\n```\nstyle \"xfdesktop-icon-view\" {\n    XfdesktopIconView::label-alpha = 10\n    base[NORMAL] = \"#000000\"\n    base[SELECTED] = \"#71B9FF\"\n    base[ACTIVE] = \"#71B9FF\"\n    fg[NORMAL] = \"#fcfcfc\"\n    fg[SELECTED] = \"#ffffff\"\n    fg[ACTIVE] = \"#ffffff\"\n}\nwidget_class \"*XfdesktopIconView*\" style \"xfdesktop-icon-view\"\n```\n\n"
    },
    {
      "title": "Удаление иконок с рабочего стола",
      "level": 4,
      "content": "Выполняется следующей командой:\n\n```\n$ xfconf-query -c xfce4-desktop -v --create -p /desktop-icons/style -t int -s 0\n```\n\nДля возвращения иконок обратно, выполните эту же команду с значением 2.\n\n"
    },
    {
      "title": "Обои на несколько экранов",
      "level": 4,
      "content": "Откройте xfce4-settings-editor и создайте новое свойство со следующими параметрами:\n\n```\nProperty: /backdrop/screen0/xinerama-stretch\nType: Boolean\nValue: TRUE|1|Enabled\n```\n\n"
    },
    {
      "title": "Закрытие зависших приложений",
      "level": 4,
      "content": "Xfce не имеет инструмента для завершения приложения, переставшего отвечать.\n\nИспользуйте команду xkill пакета xorg-xkill чтобы интерактивно завершить приложение. Для приложения, находящегося в фокусе используйте xdotool:\n\n```\n$ xdotool getwindowfocus windowkill\n```\n\nДругой способ:\n\n```\n$ sh -c \"xkill -id $(xprop -root -notype | sed -n '/^_NET_ACTIVE_WINDOW/ s/^.*# *\\|\\,.*$//g p')\"\n```\n\nИспользуйте команду в виде сочетания клавиш. Подробнее смотрите раздел #Сочетания клавиш.\n\n"
    },
    {
      "title": "Автозапуск",
      "level": 4,
      "content": "Для запуска нужных приложений при запуске Xfce зайдите в Настройки > Диспечер Настроек и выберите пункт Сеансы и запуск и нажмите на вкладку Автозапуск приложений. Вы увидите список приложений, находящихся в автозапуске. Чтобы добавить свое приложение нажмите кнопку + и введите в появившейся форме путь к исполняемому файлу.\n\nСписок приложений, запускаемых Xfce хранится в файлах приложение.desktop в директории ~/.config/autostart/.\n\nТакже вы можете добавить нужную команду (или задать нужную переменную окружения) в xinitrc (или в xprofile, если надо запустить во время запуска экранного менеджера).\n\n"
    },
    {
      "title": "Экран блокировки",
      "level": 4,
      "content": "xflock4 это Bash скрипт для блокировки сеанса Xfce.\n\nxflock4 попробует использовать следующие хранители экрана xfce4-screensaver (находится в составе xfce4-goodies), xscreensaver, gnome-screensaverAUR[ссылка недействительна: package not found], slock или xlockmore. Он последовательно будет искать их исполняемые файлы для запуска, а если не найдет то прекратит работу с кодом возврата 1.\n\nСмотрите List of applications (Русский)/Security (Русский)#Блокировка экрана для выбора сторонних блокировщиков экрана. Альтернативный блокировщик экрана light-locker частично совместим с xfce4-power-manager. После установки light-locker в Менеджере Питания появится дополнительная вкладка Безопасность с настройками для light-locker, а переключатель Блокировать экран при переходе в ждущий режим перемещается в нее. В этой вкладке можно настроить блокировку экрана при включении хранителя экрана и задержку блокировки.\n\nЧтобы указать xflock4 запускать light-locker или другой блокировщик экрана, неуказанный выше, установите переменную LockCommand через xfconf (вы можете написать команду нужного блокировщика экрана в скобках вместо используемой):\n\n```\n$ xfconf-query -c xfce4-session -p /general/LockCommand -s \"light-locker-command --lock\" --create -t string\n```\n\nКнопка блокировки на панели в апплете \"Системные действия\" просто выполняет /usr/bin/xflock4. Она должна работать, если один из стандартных блокировщиков экрана установлен, или сторонний правильно настроен.\n\n"
    },
    {
      "title": "Ждущий режим",
      "level": 4,
      "content": "Когда вы нажимаете кнопку перехода в ждущий режим, Xfce выполняет команду xfce4-session-logout(1) с параметром suspend:\n\n```\n$ xfce4-session-logout --suspend\n```\n\nВы можете настроить блокировку сессии после перехода в ждущий режим или гибернацию в меню настроек или через командную строку.\n\nДля настройки через командную строку, вам нужно изменить два параметра. Для того, чтобы предотвратить блокировку сессии при переходе в ждущий режим, поменяйте их значение на false:\n\n```\n$ xfconf-query -c xfce4-session -p /shutdown/LockScreen -s false\n$ xfconf-query -c xfce4-power-manager -p /xfce4-power-manager/lock-screen-suspend-hibernate -s false\n```\n\nЛибо задайте значение на true для обратного действия.\n\nДля настройки через через графический интерфейс, откройте Сеансы и запуск и во вкладке Общие поставте переключатель Блокировать экран перед сном в нужное положение.\n\nКлавиша клавиатуры для перехода в ждущий режим контролируется либо Менеджером питания, либо systemd-logind. Чтобы передать контроль systemd-logind, выполните следующую команду:\n\n```\n$ xfconf-query -c xfce4-power-manager -p /xfce4-power-manager/logind-handle-suspend-key -n -t bool -s true\n```\n\n"
    },
    {
      "title": "Отключить сохранение сеансов",
      "level": 4,
      "content": "Каждому пользователю для отключения функции сохранения сеанса необходимо выполнить следующую команду:\n\n```\n$ xfconf-query -c xfce4-session -p /general/SaveOnExit -s false\n```\n\nЗатем пройдите в Настройки > Сеансы и запуск > Сохраненные сеансы и нажмите кнопку Очистить сохраненные сеансы для удаления имеющихся сохраненных сеансов.\n\nВы также можете использовать режим \"kiosk\" Xfce для отключения сохранения сеансов для всей системы. Для этого, создайте файл /etc/xdg/xfce4/kiosk/kioskrc и измените его следующим образом:\n\n```\n[xfce4-session]\nSaveSession=NONE\n```\n\nЕсли режим \"kiosk\" не работает, вы можете установить директории сохраненных сеансов режим только для чтения:\n\n```\n$ rm ~/.cache/sessions/* && chmod 500 ~/.cache/sessions\n```\n\nЭтот способ должен препятствовать Xfce сохранять сеансы вне зависимости от настроек.\n\n"
    },
    {
      "title": "Использовать сторонний оконный менеджер",
      "level": 4,
      "content": "Файлы, определяющие оконный менеджер запускаемый по умолчанию, находятся в данных директориях:\n\n- ~/.config/xfce4/xfconf/xfce-perchannel-xml/xfce4-session.xml - для каждого пользователя\n- /etc/xdg/xfce4/xfconf/xfce-perchannel-xml/xfce4-session.xml - общий для всей системы\n\nПользователь может выбрать оконный менеджер с помощью xfconf-query:\n\n```\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client0_Command -t string -sa xfsettingsd\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client1_Command -t string -sa название_оконого_менеджера\n```\n\nЕсли вам нужно запускать оконный менеджер с определенными параметрами, смотрите пример ниже:\n\n```\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client0_Command -t string -sa xfsettingsd\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client1_Command -t string -s название_оконого_менеджера -t string -s --параметр\n```\n\nЕсли вам нужно использовать больше параметров, просто добавьте в команду еще -t string и -s --параметр.\n\nЕсли вы хотите поменять оконный менеджер для всей системы, отредактируйте файл указанный выше изменив xfwm4 на тот, который вы собираетесь использовать. Также можете добавить <value type=\"string\" value=\"--параметр\"/> если вам необходимо использовать дополнительные параметры.\n\nВы также можете поменять оконный менеджер путем добавления в автозапуск название_оконого_менеджера --replace или сделать это в текущем сеансе командой название_оконого_менеджера --replace & (можете сохранить сеанс для сохранения изменений после перезагрузки, но при этом, если вы добавили команду в автозагрузку, оконный менеджер будет запущен дважды). Но данный способ на самом деле не меняет оконный менеджер, а просто заменяет существующий на момент входа пользователя.\n\n"
    },
    {
      "title": "Изменение тем оформления",
      "level": 3,
      "content": "Темы XFCE доступны на сайте xfce-look.org. Темы Xfwm хранятся в директории /usr/share/themes/theme_name/xfwm4, и настраиваются по пути Настройки > Диспечер окон. Темы GTK хранятся в директориях /usr/share/themes/theme_name/gtk-2.0 и /usr/share/themes/theme_name/gtk-3.0 и настраиваются в Настройки > Внешний вид.\n\nДля применение общего вида для всех приложений , смотрите Единый вид приложений Qt и GTK.\n\nСмотрите также Темы курсора, Иконки и Настройка шрифтов.\n\n"
    },
    {
      "title": "Общий вид между окнами концептов SSD и CSD",
      "level": 4,
      "content": "Xfce использует концепты SSD (Server-Side Decorations, внешний вид настраиваемый системой), где внешний вид приложения настраивается средствами Xfwm и CSD (Client-side decoration, внешний вид настраиваемый внутри приложения), где за внешний вид отвечает само приложение.\n\nВы можете подобрать тему Xfwm для соответсвия теме приложений, использующих определенные темы CSD или воспользоваться утилитой Xfwm4 Theme Generator или подобными инструментами для создания тем Xfwm, подобным темам CSD.\n\n"
    },
    {
      "title": "Отключение CSD",
      "level": 4,
      "content": "Note: **Эта статья или раздел нуждается в переводе** Эта статья или раздел нуждается в переводе\n\nЭта статья или раздел нуждается в переводе\n\nДля того, чтобы запретить использование CSD, установите libxfce4ui-nocsdAUR[ссылка недействительна: package not found] и задайте:\n\n```\n$ xfconf-query -c xsettings -p /Gtk/DialogsUseHeader -s false\n```\n\nЭтот способ переместит кнопку \"Сохранить\" вниз диалогового окна сохранения и печати. Диалоговые окна настроек Xfce станут использовать SSD. Программы, по типу Catfish все еще будут использовать CSD.\n\nДля принудительного перехода на SSD, попробуйте gtk3-nocsd-gitAUR. Прочитайте инструкцию на странице проекта перед использованием.\n\n"
    },
    {
      "title": "Звуковые темы",
      "level": 4,
      "content": "XFCE4 поддерживает звуковые темы freedesktop, но их нельзя настроить стандартными средствами.\n\nЧтобы применить звуковую тему, выполните следующее:\n\n1. Установите libcanberra для поддержки PulseAudio;\n1. Модуль \"canberra-gtk-module\" должен находится в переменной окружения GTK_MODULES (потребуется перезагрузка);\n1. Включите Включить звуки событий во вкладке Настройки → Внешний вид → Настройки;\n1. В редакторе настроек задайте \"xsettings/Net/SoundThemeName\" имя звуковой темы, находящейся в /usr/share/sounds/;\n1. Включите \"Системные звуки\" в меню управления громкостью (например в pavucontrol).\n\nПакет sound-theme-freedesktop предоставляет звуковую тему, но содержит мало нужных звуковых событий. Лучшим выбором будет эта звуковая тема sound-theme-smoothAUR.\n\n"
    },
    {
      "title": "Клавиши смены громкости на клавиатуре",
      "level": 4,
      "content": "Плагин xfce4-pulseaudio-plugin предоставляет апплет на панель, поддерживающий клавиши громкости и имеющий уведомление смены громкости. Вы также можете установить xfce4-volumed-pulse как альтернативу, которая также поддерживает клавиши громкости и уведомление, но без иконки на панели. Это полезно, если вы используете pasystray для более точного контроля громкости.\n\nВы можете воспользоваться пакетом xfce4-mixer, который также предоставляет апплет на панель и поддерживает клавиши громкости, Но основан на функциях библиотеки GStreamer 0.10, которые были упразднены в версии 1.0.\n\nПосле установки, не забудте добавить элемент на панель иначе сочетания клавиш не будут работать.\n\nДля систем не использующих среду рабочего стола, смотрите List of applications/Multimedia#Volume control.\n\nЕсли вы не используйте апплет или службу, контролирующую изменение громкости клавишами громкости, вы можете назначить команды на сочетания клавиш используя настройки клавиатуры. Смотрите нужные команды для используемой звуковой системы по ссылкам ниже:\n\n- ALSA: Advanced Linux Sound Architecture#Keyboard volume control.\n- PulseAudio: PulseAudio (Русский)#Регулировка звука клавиатурой\n- OSS: Open Sound System#Keyboard volume control.\n\n"
    },
    {
      "title": "Сочетания клавиш",
      "level": 3,
      "content": "Сочетания клавиш настраивается в двух местах: Настройки > Диспечер окон > Клавиатура и Настройки > Клавиатура > Комбинации клавиш.\n\n"
    },
    {
      "title": "Менеджер политик Polkit",
      "level": 3,
      "content": "Менеджер polkit-gnome устанавливается вместе с xfce4-session и запускается автоматически, не требуя вмешательства пользователя. Подробнее смотрите polkit (Русский)#Агенты аутентификации.\n\nСторонние менеджеры политик также доступны для использования, например xfce-polkitAUR или xfce-polkit-gitAUR.\n\n"
    },
    {
      "title": "Потухание экрана",
      "level": 3,
      "content": "Некоторые программы в Xfce могут контролировать потухание экрана и сигналы Display Power Management Signaling (Русский).\n\nМенеджер питания управляет потуханием экрана и сигналами DPMS. Эти настройки можно изменить в Настройки > Менеджер питания вкладке Дисплей.\n\nПримите к сведению, что отключение переключателя Настройки питания для экрана или ползунков не означает, что Менеджер питания перестанет управлять потуханием экрана насовсем. Чтобы отключить полностью, щелкните на апплет менеджера питания на панели и выключите Режим презентации.\n\nЕсли xscreensaver установлен и работает вместе с Менеджером питания, то может возникнуть путаница в управлении потуханием экрана. Если вам нужно отключить функцию потухания экрана в ситуациях, например при просмотре видео, убедитесь что это настроено и в Менеджере питания, и в XScreenSaver. Подробнее о XScreenSaver смотрите XScreenSaver#DPMS and blanking settings.\n\nЕсли ни одно из вышеописанных приложений не используется, вы можете управлять потуханием экрана и DPMS с помощью команд xset, подробнее Display Power Management Signaling (Русский)#Изменение настроек DPMS и хранителя экрана с помощью команд.\n\n"
    },
    {
      "title": "Монтирование в Thunar и xfdesktop",
      "level": 3,
      "content": "Если внешние дисковые устройств не появляются в Thunar или на рабочем столе или внутренние дисковые устройства отображаются как внешние, установите gvfs. Смотрите Udisks (Русский)#Сокрытие отдельных разделов и Thunar (Русский)#Автомонтирование больших внешних накопителей для более продвинутой настройки.\n\n"
    },
    {
      "title": "Сделать скриншот (снимок экрана)",
      "level": 3,
      "content": "Xfce имеет инструмент создания скриншотов xfce4-screenshooter (часть группы приложений xfce4-goodies).\n\nПройдите в Настройки > Клавиатура вкладку Комбинации клавиш. Назначьте команду xfce4-screenshooter -f (или -w для снимка активного окна) на клавишу Print чтобы делать снимок всего экрана. Смотрите xfce4-screenshooter(1) для дополнительных аргументов.\n\nВы также можете использовать сторонние программы, например из этого списка Screen capture#Screenshot software.\n\n"
    },
    {
      "title": "Отключить клавиши F1 и F11 в терминале",
      "level": 3,
      "content": "В терминале xfce клавиши F1 и F11 назначенны на отображение справки и переход в полноэкранный режим, которые могут быть использованны в консольных приложениях, например в htop или mc. Для отключения действий на эти клавиши, создайте и отредактируйте следующие файлы и перезайдите в терминал для применения изменений. Также, клавиши F1 и F10 можно отключить в Настройках терминала, вкладке Дополнительно.\n\n```\n~/.config/xfce4/terminal/accels.scm\n```\n\n```\n(gtk_accel_path \"<Actions>/terminal-window/fullscreen\" \"\")\n(gtk_accel_path \"<Actions>/terminal-window/contents\" \"\")\n```\n\n"
    },
    {
      "title": "Цветовая схема терминала",
      "level": 3,
      "content": "Цветовую схему и палитру можно изменить в настройках терминала, вкладке Цвета. Эти схемы доступны для большинства консольных приложений, таких как Emacs и Vi. Их настройки хранятся индивидуально для каждого пользователя в файле ~/.config/xfce4/terminal/terminalrc. Можете просмотреть примеры цветовых тем для множества доступных схем и палитр.\n\n"
    },
    {
      "title": "Изменения стандартной цветовой схемы",
      "level": 4,
      "content": "Терминал Xfce содержит темную цветовую схему по умолчанию. Чтобы изменить ее, добавьте следующие строки к файлу terminalrc для светлой цветовой темы для читаемости на темном фоне терминала.\n\n```\n~/.config/xfce4/terminal/terminalrc\n```\n\n```\nColorPalette5=#38d0fcaaf3a9\nColorPalette4=#e013a0a1612f\nColorPalette2=#d456a81b7b42\nColorPalette6=#ffff7062ffff\nColorPalette3=#7ffff7bd7fff\nColorPalette13=#82108210ffff\n```\n\n"
    },
    {
      "title": "Цветовая тема tango",
      "level": 4,
      "content": "Чтобы поменять цветовую схему на tango, отредактируйте файл\n\n```\n~/.config/xfce4/terminal/terminalrc\n```\n\nИ замените следующие строки:\n\n```\nColorForeground=White\nColorBackground=#323232323232\nColorPalette1=#2e2e34343636\nColorPalette2=#cccc00000000\nColorPalette3=#4e4e9a9a0606\nColorPalette4=#c4c4a0a00000\nColorPalette5=#34346565a4a4\nColorPalette6=#757550507b7b\nColorPalette7=#060698989a9a\nColorPalette8=#d3d3d7d7cfcf\nColorPalette9=#555557575353\nColorPalette10=#efef29292929\nColorPalette11=#8a8ae2e23434\nColorPalette12=#fcfce9e94f4f\nColorPalette13=#72729f9fcfcf\nColorPalette14=#adad7f7fa8a8\nColorPalette15=#3434e2e2e2e2\nColorPalette16=#eeeeeeeeecec\n```\n\n"
    },
    {
      "title": "Открытие ссылок средней кнопкой мыши в терминале",
      "level": 3,
      "content": "После обновления терминала до версии 0.8 открытие ссылок средней кнопкой мыши выключено по умолчанию и работает как вставка с буфера обмена. Чтобы вернуть прежнее поведение, исправьте следующий параметр в ${XDG_CONFIG_HOME}/xfce4/terminal/terminalrc (по умолчанию XDG_CONFIG_HOME=${HOME}/.config):\n\n```\n${XDG_CONFIG_HOME}/xfce4/terminal/terminalrc\n```\n\n```\n[Configuration]\nMiscMiddleClickOpensUri=TRUE\n```\n\n"
    },
    {
      "title": "Автозавершение команд с помощью env-module в терминале",
      "level": 3,
      "content": "Пакеты env-modulesAUR и env-modules-tclAUR[ссылка недействительна: package not found] предоставляют login shell(оболочке со входом) инструменты автозавершения команд. Но по умолчанию сеансы в xfce4-terminal запускаются как non-login shell (оболочка без входа в систему). Чтобы изменить это поведение и включить автозавершение модулями окружения, включите переключатель Запускать команду в login shell или поменяйте параметр CommandLoginShell на TRUE в ~/.config/xfce4/terminal/terminalrc.\n\n"
    },
    {
      "title": "Управление цветом",
      "level": 3,
      "content": "Xfce не имеет поддержки управления цветами [3]. Смотрите ICC profiles (Русский) для различных решений.\n\n"
    },
    {
      "title": "Использование нескольких мониторов",
      "level": 3,
      "content": "Xfce поддерживает работу с несколькими мониторами. Настройки находятся в Настройки > Дисплей\n\nВо кладке Дополнительно вы можете сохранить профиль работы для различных экранов который будет применятся автоматически после подключения/отключения мониторов.\n\nДля подробностей смотрите этот раздел документации Xfce.\n\nВ качестве альтернативы вы можете использовать arandr для простого управления конфигурацией мониторов в виде команд xrandr, которые можно назначить на сочетания клавиш.\n\n"
    },
    {
      "title": "SSH-агенты",
      "level": 3,
      "content": "По умолчанию Xfce =>4.10 попытается загрузить gpg-agent или ssh-agent во время инициализации сеанса. Для отключения такого поведения, добавьте нужный ключ xfconf с помощью следующей команды:\n\n```\nxfconf-query -c xfce4-session -p /startup/ssh-agent/enabled -n -t bool -s false\n```\n\nЧтобы принудительно использовать ssh-agent вместо gpg-agent, используйте следующую команду:\n\n```\nxfconf-query -c xfce4-session -p /startup/ssh-agent/type -n -t string -s ssh-agent\n```\n\nДля использования GNOME Keyring, просто включите переключатель Запускать службы GNOME при входе в систему во вкладке Дополнительные меню Сессии и запуск настроек Xfce. Этим вы отключите gpg-agent и ssh-agent.\n\nИсточник: https://docs.xfce.org/xfce/xfce4-session/advanced\n\n"
    },
    {
      "title": "Прокрутка мышью окон на заднем фоне без смены фокуса",
      "level": 3,
      "content": "Пройдите во вкладку Настройки > Диспечер окон (дополнительно) > Доступность Выключите переключатель Поднимать окна при нажатии любой клавиши мыши.\n\n"
    },
    {
      "title": "Кнопка модификатор мыши",
      "level": 3,
      "content": "В Xfce по умолчанию для кнопки-модификатора мыши назначена клавиша Alt. Ее можно поменять с помощью xfconf-query. Для примера следующая команда назначит клавишу Super как кнопка модификатор мыши:\n\n```\n$ xfconf-query -c xfwm4 -p /general/easy_click -n -t string -s \"Super\"\n```\n\nНа самом деле использование сочетания клавиш не поддерживается, тем не менее вы можете назначить несколько клавиш, разделив их названия с помощью ><. В следующем примере вы можете назначить Ctrl+Alt как кнопку модификатор мыши:\n\n```\n$ xfconf-query -c xfwm4 -p /general/easy_click -n -t string -s \"Ctrl><Alt\"\n```\n\n"
    },
    {
      "title": "Назначить на тачпаде касание двумя пальцами как нажатие на среднюю кнопку мыши",
      "level": 3,
      "content": "Если вы хотите назначить касание двумя пальцами как клик средней кнопки мыши, создайте или отредактируйте следующий файл:\n\n```\n~/.config/xfce4/xfconf/xfce-perchannel-xml/pointers.xml\n```\n\n```\n<channel name=\"pointers\" version=\"1.0\">\n  <property name=\"SynPS2_Synaptics_TouchPad\" type=\"empty\">\n    <property name=\"Properties\" type=\"empty\">\n      <property name=\"Synaptics_Tap_Action\" type=\"array\">\n        <value type=\"int\" value=\"0\"/>\n        <value type=\"int\" value=\"0\"/>\n        <value type=\"int\" value=\"0\"/>\n        <value type=\"int\" value=\"0\"/>\n        <value type=\"int\" value=\"1\"/>\n        <value type=\"int\" value=\"2\"/>\n        <value type=\"int\" value=\"3\"/>\n      </property>\n    </property>\n  </property>\n</channel>\n```\n\n2 в масиве значит нажатие средней кнопки мыши.\n\n"
    },
    {
      "title": "Ограничить минимальное значение ползунка яркости",
      "level": 3,
      "content": "Ограничение минимального значения ползунка яркости может быть полезно, если при его достижении экран гаснет и вас не устраивает данное поведение. В xfce4-power-manager с версии 1.3.2 был добавлен скрытый параметр для установки минимального допустимого значения яркости через xfconf4-property. Добавьте int значение brightness-slider-min-level в xfconf4. Настройте это значение на минимальное доступное вам.\n\n"
    },
    {
      "title": "Добавить изображение профиля",
      "level": 3,
      "content": "Вы можете добавить изображение профиля каждому пользователю для отображения в меню whisker. Просто поместите PNG файл размером 96x96 в корень домашней директории нужного пользователя с расширением .face, например /home/bob/.face для пользователя bob.\n\nВы можете отредактировать нужное изображение в программе GIMP или других редакторах изображений чтобы изменить разрешение на 96x96.\n\n"
    },
    {
      "title": "Изменение отображения состояния батареи",
      "level": 3,
      "content": "В параметре xfconf show-panel-label значение типа int устанавливает вид подписи при наведени на апплет Менеджера питания. Может иметь следующие значения: 0 (без подписи), 1 (проценты), 2 (оставшееся время работы от батареи) или 3 (оба значения).\n\nВы также можете настроить через настройки апплета. Правой кнопкой мыши по значку > Свойства.\n\n"
    },
    {
      "title": "Иконки рабочего стола сортируются самостоятельно",
      "level": 3,
      "content": "При определенных событиях (например при открытии настроек панели) иконки самостоятельно сортируются. Так как положение иконки устанавливается в файлах директории ~/.config/xfce4/desktop/, каждый раз при изменении на рабочем столе (добавлении, удалении или при смене положения иконки) в директории генерируется новый файл и конфликтует с существующими.\n\nДля решения этой проблемы пройдите в каталог и удалите все файлы кроме того, который правильно определяет положение иконок. Правильность положения иконок можете проверить, открыв файл. Верхняя строка определяется как row 0 и первый столбец (слева) как col 0. Пример такой записи:\n\n```\n[Firefox]\nrow=3\ncol=0\n```\n\nозначает, что иконка Firefox будет находится в 4 строке первого столбца.\n\n"
    },
    {
      "title": "Темы GTK не работает на системах с несколькими мониторами",
      "level": 3,
      "content": "Некоторые инструменты могут испортить файл displays.xml, который влияет на GTK темы настроенные в Настройки > Внешний вид. Чтобы исправить эту проблему, удалите файл ~/.config/xfce4/xfconf/xfce-perchannel-xml/displays.xml и настройте конфигурацию мониторов заного.\n\n"
    },
    {
      "title": "Иконки меню правой кнопки мыши не отображаются",
      "level": 3,
      "content": "Пользователи могут обнаружить пропажу иконок в меню правой кнопки мыши, в частности если меню работает на библиотеке Qt. Эта проблема появляется только при работе в Xfce. Чтобы исправить, выполните следующие две команды:\n\n```\n$ gconftool-2 --type boolean --set /desktop/gnome/interface/buttons_have_icons true\n$ gconftool-2 --type boolean --set /desktop/gnome/interface/menus_have_icons true\n```\n\n"
    },
    {
      "title": "Нет изменений после применения настроек",
      "level": 3,
      "content": "Если у вас есть рабочий экземпляр службы Xsettingsd, он может влиять на применение некоторых настроек. Отключите его и перезапустите Xorg.\n\n"
    },
    {
      "title": "NVIDIA и xfce4-sensors-plugin",
      "level": 3,
      "content": "Чтобы обнаружить датчики и читать с них значения на видеокартах Nvidia вам нужно установить libxnvctrl и пересобрать xfce4-sensors-plugin с помощью ABS. либо просто установите пакет xfce4-sensors-plugin-nvidiaAUR, который заменит xfce4-sensors-plugin.\n\n"
    },
    {
      "title": "Черный экран после загрузки на видеокартах NVIDIA используя несколько мониторов",
      "level": 3,
      "content": "Использование NVIDIA, нескольких мониторов и способ из NVIDIA/Troubleshooting#Avoid screen tearing может быть причиной черного экрана после загрузки Xfce. Положение мониторов в файлах /etc/X11/xorg.conf и ~/.config/xfce4/xfconf/xfce-perchannel-xml/displays.xml конфликтуют между собой. Удаление displays.xml исправляет данную проблему.\n\n```\n$ rm ~/.config/xfce4/xfconf/xfce-perchannel-xml/displays.xml\n```\n\n"
    },
    {
      "title": "Иконки на панели принудительно ровняются на лево",
      "level": 3,
      "content": "Добавьте разделитель куда-нибудь перед правым концом и установите ему значение Расширять.\n\n"
    },
    {
      "title": "Выбор приложений по-умолчанию не работает",
      "level": 3,
      "content": "Большинство приложений полагается на xdg-open для выбора приложения для открытия подходящего файла или ссылки.\n\nДля того, чтобы xdg-open и xdg-settings обнаружили и интегрировались с рабочей средой Xfce, вам нужно установить пакет xorg-xprop.\n\nЕсли вы этого не сделаете, ваши приложения по-умолчанию (установленные exo-preferred-applications) не будут учтены. Установив пакет и дав ему разрешение на обнаружение Xfce повзволит xdg-open передавать вызовы exo-open чтобы открывать нужные приложения.\n\nУбедитесь, что интеграция xdg-open работает правильно командой xdg-settings, которая спрашивает веб-браузер по умолчанию:\n\n```\n# xdg-settings get default-web-browser\n```\n\nЕсли вывод такой:\n\n```\nxdg-settings: unknown desktop environment\n```\n\nэто значит, что рабочее окружение Xfce не обнаружено по вероятной причине отсутствия пакета xorg-xprop.\n\n"
    },
    {
      "title": "Сброс настроек",
      "level": 3,
      "content": "Если по какой либо причине вы хотите сбросить настройки Xfce, переименуйте ~/.config/xfce4-session/ и {ic|~/.config/xfce4/}} для сохранения текущих настроек, если вы захотите обратить изменения:\n\n```\n$ mv ~/.config/xfce4-session/ ~/.config/xfce4-session-bak\n$ mv ~/.config/xfce4/ ~/.config/xfce4-bak\n```\n\nПерезайдите для применения изменений. Если вы получаете ошибку Unable to load a failsafe session, смотрите раздел #Сбой сессии.\n\n"
    },
    {
      "title": "Сбой сессии",
      "level": 3,
      "content": "Если вы наблюдаете следующие проблемы:\n\n- Мышка выглядит как X и/или просто не появляется;\n- Заголовки окон пропадают и их невозможно закрыть;\n- xfwm4-settings не запускается, сообщая These settings cannot work with your current window manager (unknown);\n- Ошибки сообщаемые экранным менеджером, такие как No window manager registered on screen 0;\n- Ошибка Unable to load a failsafe session:\n\n```\nUnable to load a failsafe session.\nUnable to determine failsafe session name.  Possible causes: xfconfd is not running (D-Bus setup problem); environment variable $XDG_CONFIG_DIRS is set incorrectly (must include \"/etc\"), or xfce4-session is installed incorrectly.\n```\n\nПерезапуск Xfce или перезагрузка системы может решить проблему, но поврежденная сессия также может быть проблемой, поэтому удалите директорию с сессиями:\n\n```\n$ rm -r ~/.cache/sessions/\n```\n\nТакже удостоверьтесь, что используемые каталоги в домашней директории принадлежат пользователю при старте xfce4. Смотрите Разрешения и атрибуты файлов#Изменение владельца.\n\n"
    },
    {
      "title": "Шрифты в заголовках окон вызывают падение xfce4-title",
      "level": 3,
      "content": "Установите ttf-droid и ttf-dejavu. Смотреть подробнее FS#44382.\n\n"
    },
    {
      "title": "Игнорируются действия на закрытие крышки ноутбука",
      "level": 3,
      "content": "Если вы обнаружили, что настройки действий на закрытие крышки ноутбука в Менеджере питания игнорируются (Ноутбук всегда переходит в спящий режим независимо от настроек), это значит, что не Менеджер питания управляет этим событием, а systemd-logind. Чтобы вернуть управление менеджеру питания, выполните:\n\n```\n$ xfconf-query -c xfce4-power-manager -p /xfce4-power-manager/logind-handle-lid-switch -s false\n```\n\n"
    },
    {
      "title": "Кнопка смены пользователя неактивна",
      "level": 3,
      "content": "Кнопка Переключить пользователя зависит от исполняемого файла gdmflexiserver (Предоставляется GDM). Если вы не используете GDM, кнопка будет неактивна. Подробнее [5].\n\nВы можете создать исполняемый скрипт с названием gdmflexiserver в /usr/bin или /usr/local/bin с вызывом команды смены пользователя предоставляемой экранным менеджером который вы хотите использовать.\n\n- Через LXDM - LXDM (Русский)#Одновременные пользователи и их переключение.\n- Через LightDM - LightDM (Русский)#Переключение пользователей.\n\n"
    },
    {
      "title": "Макросы в .Xresources не работают",
      "level": 3,
      "content": "Xfce загружает файл $HOME/.Xresources используя xrdb с параметром -nocpp, предвотвращающий предвартиельную обработку. Скопируйте /etc/xdg/xfce4/xinitrc в $HOME/.config/xfce4 и удалите параметр -nocpp у xrdb. Подробнее смотреть [6].\n\n"
    },
    {
      "title": "Тема курсора не меняется",
      "level": 3,
      "content": "Убедитесь что курсору XDG, установленному системно выбрана нужная тема. Подробнее Темы курсора#Спецификация XDG.\n\n"
    },
    {
      "title": "Строка меню редактора Mousepad не отображается",
      "level": 3,
      "content": "Выполните gsettings set org.xfce.mousepad.preferences.window menubar-visible true чтобы сделать строку меню видимой.\n\n"
    },
    {
      "title": "Иконка корзины отсутствует и аплет корзины не работает",
      "level": 3,
      "content": "Корзина требует необязательную зависимость gvfs для работы. Установите gvfs и перезапустите систему.\n\n"
    },
    {
      "title": "Рабочий стол стал серым и все иконки пропали",
      "level": 3,
      "content": "Удалите ~/.cache/session командой:\n\n```\n$ rm -rf ~/.cache/session\n```\n\nи перезапуститесь.\n\n"
    },
    {
      "title": "Смотреть также",
      "level": 2,
      "content": "- Xfce - Документация\n- Xfce - Вики\n- Xfce - О проекте\n- Xfce - Тур по функциям\n- Страница на Википедии\n- Xfce-Look - Темы, обои и различные украшательства.\n- Xfce на Wikia\n\n"
    }
  ]
}