{
  "title": "Xfce (Čeština)",
  "url": "https://wiki.archlinux.org/title/Xfce_(%C4%8Ce%C5%A1tina)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nSouvisející články\n\n- Desktop environment\n- Window manager\n- Xfwm\n- Thunar\n- LXDE (Čeština)\n- GNOME (Čeština)\n\nXfce je lehké a modulární desktopové prostředí, které je v současné době založeno na GTK 3. Pro zajištění úplného uživatelského komfortu obsahuje správce oken, správce souborů, plochu a panely. Xfce lze jednoduše rozšiřovat pomocí extra pluginů.\n\n"
    },
    {
      "title": "Instalace",
      "level": 2,
      "content": "Nainstalovat xfce4 skupinu. Také si můžete nainstalovat skupinu xfce4-goodies, která obsahuje další doplňky a řadu užitečných nástrojů, jako je mousepad editor. Xfce používá Xfwm jako výchozí správce oken.\n\n"
    },
    {
      "title": "Spuštění",
      "level": 2,
      "content": "Vyberte Xfce Session (relaci Xfce) z nabídky ve správci zobrazení nebo přidejte exec startxfce4 do svého Xinitrc.\n\n"
    },
    {
      "title": "Konfigurace",
      "level": 2,
      "content": "Xfce ukládá své konfigurace do Xfconf. Tyto konfigurace lze upravit několika způsoby:\n\n- V hlavní nabídce vyberte Settings, kterou chcete přizpůsobit. Kategorie jsou programy, které se obvykle nacházejí v /usr/bin/xfce4-* a /usr/bin/xfdesktop-settings.\n- xfce4-settings-editor, kde můžete zobrazit a upravit všechna nastavení. Zde upravené modifikace nastavení se projeví okamžitě. Použití xfconf-query dokáže změnit nastavení z příkazového řádku; podrobnosti najdete v dokumentaci.\n- Nastavení jsou uložena v souborech XML v ~/.config/xfce4/xfconf/xfce-perchannel-xml/, které je možné ručně upravovat. Zde provedené změny se však neprojeví okamžitě.\n\n"
    },
    {
      "title": "Menu",
      "level": 3,
      "content": "Viz Xdg-menu pro více informací o používání systému menu Free Desktop.\n\n"
    },
    {
      "title": "Whisker menu",
      "level": 4,
      "content": "xfce4-whiskermenu-plugin (také součást xfce4-goodies) je alternativní spouštěč aplikací. Zobrazuje seznam oblíbených položek, prochází všechny nainstalované aplikace pomocí tlačítkových kategorií a podporuje fuzzy vyhledávání. Po instalaci balíčku může nahradit původní Applications Menu (nabídku aplikací) jako první položku v panelu 1 (v Settings > Panel > Items přidat Whisker Menu, tj. Nastavení > Panel > Položky přidat nabídku Whisker Menu).\n\n"
    },
    {
      "title": "Editace položek",
      "level": 4,
      "content": "Pro tento úkol je k dispozici řada grafických nástrojů:\n\n- MenuLibre — Pokročilý editor nabídek, který poskytuje moderní funkce v čistém a snadno použitelném rozhraní.\n\n- Alacarte — Editor nabídek pro GNOME. Podporuje XFCE.\n\n- XAME (XFCE Applications Menu Editor) — GUI nástroj napsaný v Gambas navržený speciálně pro úpravu položek nabídky v Xfce, nebude fungovat v jiných prostředích (Vývoj přerušen).\n\nPřípadně vytvořte soubor ~/.config/menus/xfce-applications.menu ručně. Viz příklad konfigurace níže:\n\n```\n<!DOCTYPE Menu PUBLIC \"-//freedesktop//DTD Menu 1.0//EN\"\n  \"http://www.freedesktop.org/standards/menu-spec/1.0/menu.dtd\">\n\n<Menu>\n    <Name>Xfce</Name>\n    <MergeFile type=\"parent\">/etc/xdg/menus/xfce-applications.menu</MergeFile>\n\n    <Exclude>\n        <Filename>xfce4-run.desktop</Filename>\n        <Filename>exo-terminal-emulator.desktop</Filename>\n        <Filename>exo-file-manager.desktop</Filename>\n        <Filename>exo-mail-reader.desktop</Filename>\n        <Filename>exo-web-browser.desktop</Filename>\n        <Filename>xfce4-about.desktop</Filename>\n        <Filename>xfhelp4.desktop</Filename>\n    </Exclude>\n\n    <Layout>\n        <Merge type=\"all\"/>\n        <Separator/>\n        <Menuname>Settings</Menuname>\n        <Separator/>\n        <Filename>xfce4-session-logout.desktop</Filename>\n    </Layout>\n</Menu>\n```\n\n<MergeFile> tag obsahuje výchozí nabídku Xfce.\n\n<Exclude> tag vylučuje aplikace, které nechceme, aby se zobrazovaly v nabídce. Zde jsme vyloučili některé výchozí zkratky Xfce, ale můžete vyloučit firefox.desktop nebo jakoukoli jinou aplikaci.\n\n<Layout> tag definuje rozložení nabídky. Aplikace mohou být organizovány do složek nebo do uspořádní dle našeho přání. Další podrobnosti najdete na Xfce wiki.\n\nZměny v nabídce Xfce můžete provádět také úpravou .desktop samotných souborů. Chcete -li skrýt položky, podívejte se na Skrýt položky na ploše. Kategorii aplikace můžete upravit Categories= řádkou položky desktop entry, viz Desktop entries#File example.\n\n"
    },
    {
      "title": "Transparentní pozadí pod nadpisy ikon",
      "level": 4,
      "content": "Chcete -li změnit výchozí bílé pozadí názvů ikon na ploše na něco vhodnějšího, vytvořte nebo upravte ~/.gtkrc-2.0:\n\n```\nstyle \"xfdesktop-icon-view\" {\n    XfdesktopIconView::label-alpha = 10\n    base[NORMAL] = \"#000000\"\n    base[SELECTED] = \"#71B9FF\"\n    base[ACTIVE] = \"#71B9FF\"\n    fg[NORMAL] = \"#fcfcfc\"\n    fg[SELECTED] = \"#ffffff\"\n    fg[ACTIVE] = \"#ffffff\"\n}\nwidget_class \"*XfdesktopIconView*\" style \"xfdesktop-icon-view\"\n```\n\n"
    },
    {
      "title": "Odstranění ikon na ploše",
      "level": 4,
      "content": "Zadejte následující příkaz:\n\n```\n$ xfconf-query -c xfce4-desktop -v --create -p /desktop-icons/style -t int -s 0\n```\n\nChcete-li obnovit ikony na ploše, zadejte stejný příkaz s hodnotou 2.\n\n"
    },
    {
      "title": "Jeden wallpaper roztažený přes všechny obrazovky (xinerama)",
      "level": 4,
      "content": "Otevřete xfce4-settings-editor a vytvořte novou vlastnost s následujícím nastavením:\n\n```\nProperty: /backdrop/screen0/xinerama-stretch\nType: Boolean\nValue: TRUE|1|Enabled\n```\n\n"
    },
    {
      "title": "Klávesová zkratka: Zabití okna",
      "level": 4,
      "content": "Xfce nemá zkratku pro zabití okna, například když program zamrzne.\n\nS xorg-xkill použijte xkillinteraktivně zabít okno. Pro aktuálně aktivní okno použijte xdotool : S xorg-xkill použijte xkill interaktivní zabití okna. Pro aktuálně aktivní okno použijte xdotool:\n\n```\n$ xdotool getwindowfocus windowkill\n```\n\nAlternativně:\n\n```\n$ sh -c \"xkill -id $(xprop -root -notype | sed -n '/^_NET_ACTIVE_WINDOW/ s/^.*# *\\|\\,.*$//g p')\"\n```\n\nChcete-li přidat zástupce, použijte Settings > Keyboard (Nastavení > Klávesnice) nebo jednu z možných aplikací xbindkeys.\n\n"
    },
    {
      "title": "Autostart",
      "level": 4,
      "content": "Chcete-li při spuštění Xfce spouštět vlastní aplikace, klikněte na Applications Menu > Settings > Settings Manager (Nabídka aplikací > Nastavení> Správce nastavení) a poté vyberte možnost Session and Startup (relace a spuštění) a klikněte na kartu Application Autostart (Automatické spuštění aplikací). Zobrazí se seznam programů, které se spustí po spuštění. Chcete -li přidat položku, klikněte na Přidat tlačítko a vyplňte formulář a zadejte cestu ke spustitelnému souboru, který chcete spustit.\n\nAutomaticky spuštěné aplikace jsou uloženy jako name.desktop v ~/.config/autostart/.\n\nPřípadně přidejte příkazy, které chcete spustit (včetně nastavení proměnných prostředí), do xinitrc (nebo xprofile kde se používá správce zobrazení).\n\nNote: **odložit spuštění aplikace** \n\n"
    },
    {
      "title": "Zamykání obrazovky (Lock Screen)",
      "level": 4,
      "content": "xflock4 je referenční skript Bash, který se používá k uzamčení relace Xfce.\n\nSnažší uzamčení obrazovky je pomocí xfce4-screensaver (spořiče obrazovky) (rovněž součástí xfce4-goodies), xscreensaver, gnome-screensaverAUR[broken link: package not found], slock nebo xlockmore. Postupně xfce vyhledá odpovídající binární soubor nebo ukončí návratový kód 1, pokud se mu nepodaří najít žádný z nich.\n\nList of applications/Security#Screen lockers obsahuje krátký popis těchto zamykacích obrazovek společně s dalšími oblíbenými aplikacemi. V tomto seznamu je alternativní zamykací nástroje, light-locker, která se obzvláště dobře integrují s xfce4-power-manager. Jakmile je nainstalován, nastavení Xfce Power Manager získá další Security (Zabezpečení) záložku pro konfiguraci light-locker a stávající Lock screen when system is going for sleep (zamykací obrazovka, když systém přechází do režimu spánku) nastavení se přemístí na tuto kartu. V tomto novém GUI je možné nastavit, zda má být relace uzamčena při aktivitě spořiče obrazovky, nebo kdykoli systém přejde do režimu spánku.\n\nChcete-li, aby xflock4 spustil light-locker nebo jakoukoli vlastní locker aplikaci, která není mezi výše uvedenými pěti, je třeba nastavit LockCommand v xfconf relaci pomocí příkazového řádku s uvedením, který locker má být použit (příkaz uvnitř uvozovek v následujícím příkladu lze odpovídajícím způsobem upravit pro jiné zamykací obrazovkové aplikace):\n\n```\n$ xfconf-query -c xfce4-session -p /general/LockCommand -s \"light-locker-command --lock\" --create -t string\n```\n\nTlačítko zámku v panelu se nachází v Action Buttons (Akční tlačítka), který jednoduše spustí /usr/bin/xflock4. Mělo by fungovat podle očekávání, pokud xflock4 funguje, tj. je nainstalována jedna z nativních uzamykacích aplikací nebo je nakonfigurována vlastní aplikace dle výše uvedeného.\n\n"
    },
    {
      "title": "Pozastavit (Suspend)",
      "level": 4,
      "content": "Kdykoli budete požádáni o pozastavení, Xfce provede příkaz xfce4-session-logout(1) pomocí suspend volby:\n\n```\n$ xfce4-session-logout --suspend\n```\n\nZde je nebo není relace systematicky uzamčena na pozastavení (suspend) lze nakonfigurovat pomocí vlastností xfconf nebo z grafického uživatelského rozhraní.\n\nChcete-li tento stav ovládat pomocí CLI: jsou použita dvě nastavení, LockScreen a lock-screen-suspend-hibernate, umístěno v relaci a v xfconf správci napájení (power manager xfconf).\n\nChcete-li zabránit uzamčení při pozastavení, nastavte LoskScreen na false:\n\n```\n$ xfconf-query -c xfce4-session -p /shutdown/LockScreen -s false\n$ xfconf-query -c xfce4-power-manager -p /xfce4-power-manager/lock-screen-suspend-hibernate -s false\n```\n\nPodobně jej můžete nastavit na true pro uzamčení sezení při pozastavení.\n\nNastavení lze také ovládat z grafického uživatelského rozhraní: otevřete aplikaci Session and Startup a zapněte nebo vypněte flag Advanced > Lock screen before sleep (Pokročilé > Lock screen před spánkem) na on nebo off.\n\nKdykoli je stisknuto tlačítko pozastavení na klávesnici, lze to ovládat buď pomocí správce napájení Xfce nebo pomocí systemd-logind. Aby logind dostal přednost, musí být následující nastavení xfconf nastaveno na true:\n\n```\n$ xfconf-query -c xfce4-power-manager -p /xfce4-power-manager/logind-handle-suspend-key -n -t bool -s true\n```\n\n"
    },
    {
      "title": "Zakázat ukládání relací",
      "level": 4,
      "content": "U každého uživatele lze uložené relace deaktivovat provedením následujícího:\n\n```\n$ xfconf-query -c xfce4-session -p /general/SaveOnExit -s false\n```\n\nPoté přejděte do části Applications > Settings > Session and Startup > Sessions (Aplikace > Nastavení > Relace a spuštění> Relace) a stisknutím tlačítka Clear saved sessions (Vymazat uložené relace) odeberte všechny dříve uložené relace.\n\nAlternativně Xfce kiosk mode lze použít k deaktivaci ukládání relací v celém systému. Chcete-li relace zakázat, vytvořte nebo upravte soubor /etc/xdg/xfce4/kiosk/kioskrc a přidejte následující:\n\n```\n[xfce4-session]\nSaveSession=NONE\n```\n\nPokud režim kiosku nefunguje, uživatel může nastavit oprávnění pouze pro čtení pro adresář relací:\n\n```\n$ rm ~/.cache/sessions/* && chmod 500 ~/.cache/sessions\n```\n\nTo zabrání Xfce v ukládání jakýchkoli relací navzdory jakékoli konfiguraci, která určuje jinak.\n\n"
    },
    {
      "title": "Použítí alternativního window managera",
      "level": 4,
      "content": "Soubory určující výchozího správce oken se nacházejí v následujících umístěních:\n\n- ~/.config/xfce4/xfconf/xfce-perchannel-xml/xfce4-session.xml - per uživatel\n- /etc/xdg/xfce4/xfconf/xfce-perchannel-xml/xfce4-session.xml - pro celý systém\n\nVýchozí správce oken pro uživatele lze snadno nastavit pomocí xfconf-query:\n\n```\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client0_Command -t string -sa xfsettingsd\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client1_Command -t string -sa wm_name\n```\n\nPokud chcete spustit správce oken s možnostmi příkazového řádku, podívejte se na níže uvedené příkazy:\n\n```\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client0_Command -t string -sa xfsettingsd\n$ xfconf-query -c xfce4-session -p /sessions/Failsafe/Client1_Command -t string -s wm_name -t string -s --wm-option\n```\n\nPokud potřebujete více možností příkazového řádku, jednoduše přidejte další -t string a -s --wm-option argumenty příkazu.\n\nPokud chcete změnit výchozího správce oken v celém systému, upravte výše uvedený soubor ručně, změňte xfwm4 na preferovaného správce oken a přidejte další <value type=\"string\" value=\"--wm-option\"/> řádky pro další možnosti příkazového řádku v případě potřeby.\n\nSprávce oken můžete také změnit automatickým spuštěním wm_name --replace pomocí mechanismu pro automatické spuštění nebo spuštěním wm_name --replace & v terminálu a zajistit, aby byla relace uložena při odhlášení. Uvědomte si však, že tato metoda ve skutečnosti nemění výchozího správce, pouze jej nahrazuje při přihlášení. Všimněte si toho, že pokud používáte funkci automatického spuštění, měli byste zakázat uložené relace, protože by to mohlo vést k tomu, že se nový správce oken spustí dvakrát po výchozím správci oken!\n\n"
    },
    {
      "title": "Motivy",
      "level": 3,
      "content": "Motivy XFCE jsou k dispozici na xfce-look.org. Xfwm Motivy jsou uloženy v /usr/share/themes/theme_name/xfwm4 a nastavení v Settings > Window Manager (Nastavení > Správce oken). GTK Motivy jsou uloženy v /usr/share/themes/theme_name/gtk-2.0 a /usr/share/themes/theme_name/gtk-3.0 a jsou nastaveny v Settings > Appearance (Nastavení> Vzhled).\n\n"
    },
    {
      "title": "Konzistentní vzhled mezi SSD a CSD okny",
      "level": 4,
      "content": "Xfce aktuálně používá Server-Side Decorations (SSD) (viz Dekorace oken) s motivem Xfwm pro většinu oken a dekorace na straně klienta Client-side decoration (CSD) s motivem příslušných programů pro Xfce Settings (Xfce Nastavení), Print (Tisk), Save (Uložení) a další dialogy.\n\nStyly oken Xfwm SSD lze konfigurovat tak, aby odpovídaly oknům CSD, ruční úpravou nebo vytvořením motivů v /usr/share/themes/theme_name/xfwm4 nebo pomocí nástroje, jako je Xfwm4 Theme Generator, který „Vytváří motivy xfwm4 z dekorací na straně klienta“.\n\n"
    },
    {
      "title": "Obnova Client-Side Dekorací",
      "level": 4,
      "content": "Note: **This article or section needs to be translated.** This article or section needs to be translated.\n\nThis article or section needs to be translated.\n\nChcete-li odstranit většinu CSD z Xfce, nainstalujte libxfce4ui-nocsdAUR[broken link: package not found] a nastavte\n\n```\n$ xfconf-query -c xsettings -p /Gtk/DialogsUseHeader -s false\n```\n\nTím se tlačítko Uložit přesune do spodní části okna v dialogech Uložit a to samé u dialogů Tisk. Dialogová okna pro nastavení Xfce se vrátí na SSD. Programy jako Catfish budou mít stále CSD.\n\nChcete-li vynutit SSD ve všech oknech, zkuste gtk3-nocsd-gitAUR. Nezapomeňte si přečíst všechny pokyny na stránce projektu.\n\n"
    },
    {
      "title": "Zvukové motivy",
      "level": 4,
      "content": "XFCE4 podporuje freedesktop system sounds, toto však není defaultně nakonfigurováno. Lze jednoduše přidat.\n\nPovolení zvukového motivu:\n\n1. Nainstalujte libcanberra pro PulseAudio podporu;\n1. canberra-gtk-module by měl být v proměnné prostředí GTK_MODULES (může být vyžadováno opětovné přihlášení);\n1. Zaškrtněte \"Enable event sounds\" („Povolit zvuky událostí“) ve Settings Manager → Appearance → Settings záložce (Správci nastavení → Vzhled → karta Nastavení);\n1. V Editoru nastavení (aplikace xfce4-settings-editor) nastavte \"xsettings/Net/SoundThemeName\" na umístění zvukového tématu v /usr/share/sounds/;\n1. Zapněte \"System Sounds\" („Zvuky systému“) v mixéru zvuku (např. pavucontrol).\n\nsound-theme-freedesktop poskytuje kompatibilní zvukové téma, ale postrádá mnoho požadovaných událostí. Daleko lepší volbou je sound-theme-smoothAUR (SoundThemeName nastavte na \"Smooth\", pozor na velké písmeno).\n\n"
    },
    {
      "title": "Klávesová tlačítka pro změnu hlasitosti",
      "level": 4,
      "content": "xfce4-pulseaudio-plugin poskytuje panelový applet, který podporuje ovládání hlasitosti klávesnicí a notifikační upozornění na hlasitost. Jako alternativu můžete nainstalovat xfce4-volumed-pulse, který také poskytuje ovládání kláves a upozornění, ale bez ikony na panelu. To je praktické například při současném používání pasystray pro jemnější ovládání.\n\nAlternativně xfce4-mixer také poskytuje panelový aplet a klávesové zkratky, které také podporují Alsu. Všimněte si však, že je založen na funkci GStreamer 0.10, která byla opuštěna v 1.0.\n\nPo instalaci panelů je musíte přidat na hlavní panel, jinak nebudou fungovat klávesové zkratky.\n\nAlternativy, které nejsou specifické pro desktopové prostředí, viz List of applications/Multimedia#Volume control.\n\nPokud nepoužíváte applet nebo démona, který ovládá klávesy hlasitosti, můžete příkazy ovládání hlasitosti namapovat na klávesy hlasiosti ručně pomocí Xfce's keyboard settings (nastavení klávesnice Xfce). Příslušné příkazy týkající se zvukového systému, který používáte, naleznete v níže uvedených oddílech.\n\n- ALSA: viz Advanced Linux Sound Architecture#Keyboard volume control.\n- PulseAudio: viz PulseAudio#Keyboard volume control\n- OSS: viz Open Sound System#Keyboard volume control.\n\n"
    },
    {
      "title": "Klávesové zkratky",
      "level": 3,
      "content": "Klávesové zkratky jsou definovány na dvou místech: Settings > Window Manager > Keyboard (Nastavení > Správce oken > Klávesnice) a Settings > Keyboard > Shortcuts (Nastavení > Klávesnice > Zkratky).\n\n"
    },
    {
      "title": "Polkit Authentication Agent",
      "level": 3,
      "content": "polkit-gnome Agent budou nainstalovány spolu s xfce4-session a autostarted automaticky; není nutný žádný zásah uživatele. Další informace najdete v článku Polkit#Authentication agents.\n\nK dispozici je také polkit authentication agent for Xfce (ověřovací agent pro Xfce), viz xfce-polkitAUR nebo xfce-polkit-gitAUR.\n\n"
    },
    {
      "title": "Vypnutí displeje",
      "level": 3,
      "content": "Některé programy, které se běžně používají s Xfce, budou ovládat zatemnění monitoru a nastavení DPMS (monitor powersaving, monitor úspory energie)) settings. Jsou diskutovány níže.\n\nXfce Power Manager ovládá ztmavení a nastavení DPMS. Tato nastavení lze konfigurovat v Power Manager GUI aplikace na Display (Zobrazení) záložce.\n\nVšimněte si toho, že když Display power management (správa napájení displeje) je vypnutá (off), DPMS je plně deaktivován, neznamená to, že Power Manager jednoduše přestane ovládat DPMS. Nezakáže ani vypínání obrazovky. Chcete-li vypnout ztmavení i DPMS, klikněte pravým tlačítkem na ikonu na hlavním panelu správce napájení nebo klikněte levým tlačítkem na aplet panelu a ujistěte se, že možnost označená Presentation mode (Režim prezentace) je zaškrtnuta.\n\nPokud xscreensaver je nainstalován a běží vedle Xfce Power Manager, nemusí být jasné, která aplikace má kontrolu nad ztmavením a DPMS, protože oba soutěží o kontrolu nad stejným nastavením. Proto v situaci, kdy je důležité, aby nebyl monitor prázdný (například při sledování videa), je vhodné vypnout ztmavení a DPMS prostřednictvím obou aplikací. Další informace o XScreenSaver možnostech najdete v části XScreenSaver#DPMS and blanking settings.\n\nPokud není spuštěna ani jedna z výše uvedených aplikací, lze nastavení ztmavení a DPMS ovládat pomocí xset příkazu, viz DPMS#Runtime settings.\n\n"
    },
    {
      "title": "Mounting podpora pro Thunar a xfdesktop",
      "level": 3,
      "content": "Pokud se připojené externí jednotky nezobrazí a instalační oddíly se zobrazí jako připojená zařízení, na plochu a v Thunaru nainstalujte gvfs. Viz Udisks#Hide selected partitions pro pokročilejší možnosti konfigurace.\n\n"
    },
    {
      "title": "Snímky obrazovky (Screenshots)",
      "level": 3,
      "content": "Xfce má svůj vlastní nástroj pro screenshoty, xfce4-screenshooter. Je součástí skupiny xfce4-goodies.\n\nPřejděte na Applications > Settings > Keyboard (Aplikace > Nastavení > Klávesnice), Application Shortcuts (Zkratky aplikací). Přidat xfce4-screenshooter -f (nebo -w pro aktivní okno) použijte příkaz Print klíčové k pořizování snímků obrazovky na celou obrazovku. Viz xfce4-screenshooter(1) pro další volitelné argumenty.\n\nAlternativně lze použít nezávislý program screenshotů, jako je scrot.\n\n"
    },
    {
      "title": "Zakázání terminálových zkratek F1 a F11",
      "level": 3,
      "content": "Xfce terminál váže F1 a F11 na okno s pomocí a na celoobrazovkový mód, což může ztížit používání programů, jako je htop. Chcete -li tyto zkratky deaktivovat, vytvořte nebo upravte jejich konfigurační soubor, poté se odhlaste a znovu přihlaste. F10 lze deaktivovat v nabídce Preferences (Předvolby).\n\n```\n~/.config/xfce4/terminal/accels.scm\n```\n\n```\n(gtk_accel_path \"<Actions>/terminal-window/fullscreen\" \"\")\n(gtk_accel_path \"<Actions>/terminal-window/contents\" \"\")\n```\n\n"
    },
    {
      "title": "Terminálové barevné motivy nebo palety",
      "level": 3,
      "content": "Terminálové barevné motivy nebo palety lze změnit v GUI na kartě Appearance (Vzhled) v Preferences (Předvolbách). To jsou barvy, které jsou k dispozici většině konzolových aplikací, jako jsou Emacs, Vi a tak dále. Jejich nastavení jsou uložena jednotlivě pro každého uživatele systému v ~/.config/xfce4/terminal/terminalrc souboru. Na výběr je také mnoho dalších témat. Podívejte se na vlákna fóra Terminal Colour Scheme Screenshots pro stovky dostupných možností a témat.\n\n"
    },
    {
      "title": "Změna defaultního barevného motivu",
      "level": 4,
      "content": "Xfce extra/terminal balíček je dodáván s tmavší paletou barev. Chcete-li to změnit, připojte v souboru terminalrc následující téma pro světlejší barevný motiv, který je vždy viditelný na tmavších pozadí Terminálu.\n\n```\n~/.config/xfce4/terminal/terminalrc\n```\n\n```\nColorPalette5=#38d0fcaaf3a9\nColorPalette4=#e013a0a1612f\nColorPalette2=#d456a81b7b42\nColorPalette6=#ffff7062ffff\nColorPalette3=#7ffff7bd7fff\nColorPalette13=#82108210ffff\n```\n\n"
    },
    {
      "title": "Terminal tango barevné schéma",
      "level": 4,
      "content": "Chcete-li přepnout na barevné téma tango, otevřete jej ve svém oblíbeném editoru\n\n```\n~/.config/xfce4/terminal/terminalrc\n```\n\nA přidejte (nahraďte) tyto řádky:\n\n```\nColorForeground=White\nColorBackground=#323232323232\nColorPalette1=#2e2e34343636\nColorPalette2=#cccc00000000\nColorPalette3=#4e4e9a9a0606\nColorPalette4=#c4c4a0a00000\nColorPalette5=#34346565a4a4\nColorPalette6=#757550507b7b\nColorPalette7=#060698989a9a\nColorPalette8=#d3d3d7d7cfcf\nColorPalette9=#555557575353\nColorPalette10=#efef29292929\nColorPalette11=#8a8ae2e23434\nColorPalette12=#fcfce9e94f4f\nColorPalette13=#72729f9fcfcf\nColorPalette14=#adad7f7fa8a8\nColorPalette15=#3434e2e2e2e2\nColorPalette16=#eeeeeeeeecec\n```\n\n"
    },
    {
      "title": "Otevření URLs prostředním tlačítekm myši v terminálu",
      "level": 3,
      "content": "Při update na verzi 0.8 otevření URL prostředním tlačítklem myši bylo vypnuto a nahrazeno vkládáním textu ze schránky do místa umístění kurzoru. Chcete-li povolit staré chování, opravte vlastnost v ${XDG_CONFIG_HOME}/xfce4/terminal/terminalrc (XDG_CONFIG_HOME=${HOME}/.config by default)\n\n```\n${XDG_CONFIG_HOME}/xfce4/terminal/terminalrc\n```\n\n```\n[Configuration]\nMiscMiddleClickOpensUri=TRUE\n```\n\n"
    },
    {
      "title": "env-modules autocompletion v terminálu",
      "level": 3,
      "content": "env-modulesAUR a env-modules-tclAUR[broken link: package not found] balíčky zajišťují automatické doplňování pro přihlašovací shell. Ve výchozím nastavení však relace v xfce4-terminal nejsou považovány za login (přihlášení). Chcete -li povolit automatické doplňování pro moduly prostředí, zaškrtněte odpovídající políčko v Preferences (Předvolbách) nebo je jednoduše změňte CommandLoginShell na TRUE v ~/.config/xfce4/terminal/terminalrc.\n\n"
    },
    {
      "title": "Správa barev",
      "level": 3,
      "content": "Xfce nemá nativní podporu pro správu barev. [3] Najdete ICC profiles pro alternativy.\n\n"
    },
    {
      "title": "Podpora více monitorů",
      "level": 3,
      "content": "Xfce má podporu pro více monitorů. Nastavení lze konfigurovat v dialogu Applications > Settings > Display (Aplikace> Nastavení> Zobrazit).\n\nNa Advanced (Upřesnit) záložce lze uložit profily pro různé monitory a nechat je aplikovat automaticky, jakmile se připojené monitory změní.\n\nDalší informace najdete v display článku z dokumentace Xfce.\n\nAlternativně lze použít arandr ke snadné správě konfigurací zobrazení ve formě příkazů xrandr, které lze přiřadit ke klávesovým zkratkám XFCE.\n\n"
    },
    {
      "title": "SSH agents",
      "level": 3,
      "content": "Ve výchozím nastavení se Xfce 4.10 pokusí během inicializace relace načíst gpg-agent nebo ssh-agent v uvedeném pořadí. Chcete-li to zakázat, vytvořte klíč xfconf pomocí následujícího příkazu:\n\n```\nxfconf-query -c xfce4-session -p /startup/ssh-agent/enabled -n -t bool -s false\n```\n\nChcete-li vynutit použití ssh-agent, i když je nainstalován agent gpg, spusťte místo toho následující:\n\n```\nxfconf-query -c xfce4-session -p /startup/ssh-agent/type -n -t string -s ssh-agent\n```\n\nChcete používat GNOME Keyring, jednoduše zaškrtněte políčko Launch GNOME services on startup (Spustit služby GNOME při spuštění) v Advanced (Upřesnit) záložce v Session and Startup (Relace a spuštění) v Xfce's nastavení. To také zakáže gpg-agent a ssh-agent.\n\nZdroj: https://docs.xfce.org/xfce/xfce4-session/advanced\n\n"
    },
    {
      "title": "Scrolování spodního okna bez nutnosti fokusu na okno",
      "level": 3,
      "content": "Přejděte na záložku Main Menu > Settings > Window Manager Tweaks > Accessibility (Hlavní nabídky > Nastavení > Vylepšení správce oken > Usnadnění). Zrušte zaškrtnutí políčka Raise windows when any mouse button is pressed (Po stisknutí libovolného tlačítka myši zaměřit okna).\n\n"
    },
    {
      "title": "Modifikátor tlačítek myši",
      "level": 3,
      "content": "Ve výchozím nastavení je modifikátor tlačítka myši v Xfce nastaven na Alt. To lze změnit pomocí xfconf-query. Například následující příkaz nastaví Super klávesu jako modifikátor tlačítka myši:\n\n```\n$ xfconf-query -c xfwm4 -p /general/easy_click -n -t string -s \"Super\"\n```\n\nPřesně řečeno, použití více modifikátorů není podporováno. Pokud však jsou názvy klíčů oddělena pomocí ><, lze jako alternativní řešení zadat více modifikátorů. Například nastavit Ctrl+Alt jako modifikátor tlačítka myši můžete použít následující příkaz:\n\n```\n$ xfconf-query -c xfwm4 -p /general/easy_click -n -t string -s \"Ctrl><Alt\"\n```\n\n"
    },
    {
      "title": "Nastavení limitu pro minimální jas na posuvníku jasu",
      "level": 3,
      "content": "Omezení minimálního jasu může být užitečné u displejů, které vypínají podsvícení při úrovni jasu 0. V xfce4-power-manager 1.3.2 byla zavedena nová skrytá možnost pro nastavení minimální hodnoty jasu pomocí vlastnosti xfconf4-property. Přidat brightness-slider-min-level jako vlastnost int v xfconf4. Upravte hodnotu int, abyste získali vhodnou minimální úroveň jasu.\n\n"
    },
    {
      "title": "Přidání profilového obrázku",
      "level": 3,
      "content": "Chcete-li přidat profilové obrázky pro každého uživatele, které se mají zobrazit v nabídce whisker-menu, jednoduše umístěte soubor 96x96 PNG do domovského adresáře příslušného uživatele se jménem .face. Například soubor PNG /home/bob/.face pro uživatele bob.\n\nProgramy pro úpravu obrázků, jako je GIMP, lze použít k převodu a zmenšení vašich oblíbených obrázků až na 96x96.\n\n"
    },
    {
      "title": "Popisek pluginu Správce napájení",
      "level": 3,
      "content": "Možnost xfconf show-panel-label typu int ovládá popisek správce napájení, lze jej konfigurovat pro různé formáty popisků: lze jej nastavit na 0 (bez labelu), 1 (procentuální), 2 (zbývající čas) or 3 (oba dohromady).\n\nJe také přístupný prostřednictvím GUI pluginu správce napájení v části Properties > Show label (Vlastnosti > Zobrazit popisky).\n\n"
    },
    {
      "title": "Odstraňování problémů",
      "level": 2,
      "content": "Tato kapitola je velmi často dynamicky a aktivně editována uživateli v originálním anglickém jazyce. Není tedy jednoduché udržovat synchronizaci českých stránek. Pro odstraňování problémů tedy odkazujeme na originální kapitolu Xfce#Troubleshooting.\n\n"
    },
    {
      "title": "Reference",
      "level": 2,
      "content": "- Xfce - Documentation\n- Xfce - Wiki\n- Xfce - About\n- Xfce - Tour\n- Wikipedia:cs:Xfce\n- Xfce-Look - Themes, wallpapers, and more.\n- Xfce Wikia\n\n"
    }
  ]
}