{
  "title": "Xmodmap (Français)",
  "url": "https://wiki.archlinux.org/title/Xmodmap_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Xorg (Français)\n- Xorg (Français)/Keyboard configuration (Français)\n- Keyboard input\n- Linux console (Français)/Keyboard configuration (Français)#Création d'une keymap personnalisé\n- Xbindkeys (Français)\n\nxmodmap est un utilitaire permettant de modifier les mappages des touches et des boutons du pointeur dans Xorg.\n\nxmodmap n'est pas directement lié à X keyboard extension. (XKB), car il utilise des idées différentes (pré-XKB) sur la façon dont les keycodes sont traités dans X. En général, il n'est recommandé que pour les tâches les plus simples. Consultez X keyboard extension pour une configuration avancée de la disposition.\n\n- Les paramètres xmodmap sont réinitialisés par setxkbmap, qui non seulement modifie les touches alphanumériques aux valeurs données dans la carte, mais réinitialise également toutes les autres touches aux valeurs par défaut du démarrage (consultez LQWiki:Configuring keyboards).\n- En raison d'une limitation d'Xorg, les paramètres xmodmap ne sont pas appliqués automatiquement aux périphériques branchés à chaud. Si un clavier est ajouté à un système après qu'une table personnalisée ait été appliquée, la table personnalisée devra être appliquée à nouveau. [1]\n\n"
    },
    {
      "title": "Introduction",
      "level": 2,
      "content": "Il existe deux types de valeurs de clavier dans Xorg : les keycodes et les keysyms.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "xmodmap peut être installé par le paquet xorg-xmodmap.\n\nEn option, installez xkeycaps, qui est une interface graphique pour xmodmap.\n\n"
    },
    {
      "title": "Tableau des touches de clavier",
      "level": 2,
      "content": "Imprimer le tableau des touches de clavier actuel formaté en expressions :\n\n```\n$ xmodmap -pke\n```\n\n```\n[...]\nkeycode 57 = n N\n[...]\n```\n\nChaque keycode est suivi de la keysym à laquelle il est associé. L'exemple ci-dessus indique que le keycode 57 est associé à la minuscule n, tandis que la majuscule N est associée au keycode 57 plus Shift.\n\nChaque colonne keysym du tableau correspond à une combinaison particulière de touches de modification :\n\n1. Key\n1. Shift+Key\n1. Mode_switch+Key\n1. Mode_switch+Shift+Key\n1. ISO_Level3_Shift+Key\n1. ISO_Level3_Shift+Shift+Key\n\nIl n'est pas nécessaire de définir tous les keysyms, mais pour n'attribuer qu'un dernier keysym, utilisez la valeur NoSymbol.\n\nPour consulter le keycode correspondant à une touche, consultez Keyboard input#Identifying keycodes in Xorg pour plus de détails sur l'utilitaire xev qui affichera les informations relatives au keycode/keysym d'une touche lorsque vous appuyez dessus.\n\nNotez que xmodmap est influencé par les paramètres xkbd, ainsi les huit keysym sont disponibles pour la disposition xkbd US(intl) mais pas pour la disposition US par défaut (il manque le symbole ralt_switch défini dans level3). Pour avoir les 8 keysyms disponibles, vous devez configurer la variante (intl) du clavier. En utilisant la disposition US comme exemple, $ setxkbmap -layout 'us(intl)' avant d'appeler xmodmap pour tester vos changements dans la session X actuelle. Pour effectuer ce changement de manière permanente, modifiez la configuration xorg ou votre fichier .xprofile ou .xinitrc. Consultez Xorg (Français)/Keyboard configuration (Français)#Configurer la disposition du clavier pour une explication complète.\n\n"
    },
    {
      "title": "Table personnalisée",
      "level": 2,
      "content": "Pour créer une «keymap» (i.e. ~/.Xmodmap) :\n\n```\n$ xmodmap -pke > ~/.Xmodmap\n```\n\nPour tester les changements :\n\n```\n$ xmodmap ~/.Xmodmap\n```\n\n"
    },
    {
      "title": "Activation de la table personnalisée",
      "level": 3,
      "content": "Avec GDM, XDM ou LightDM, il n'est pas nécessaire de créer la source ~/.Xmodmap. Pour startx, utilisez :\n\n```\n~/.xinitrc\n```\n\n```\n[[ -f ~/.Xmodmap ]] && xmodmap ~/.Xmodmap\n```\n\nAlternativement, éditez le script de démarrage global /etc/X11/xinit/xinitrc.\n\n"
    },
    {
      "title": "Tester les modifications",
      "level": 3,
      "content": "Pour effectuer des changements temporaires :\n\n```\n$ xmodmap -e \"keycode 46 = l L l L lstroke Lstroke lstroke\"\n$ xmodmap -e \"keysym a = e E\"\n```\n\n"
    },
    {
      "title": "Touches de modification",
      "level": 2,
      "content": "xmodmap peut également être utilisé pour remplacer les touches de combinaison, par exemple pour permuter Control et Super (la «touche Windows»).\n\nImprimer la table des modificateurs actuels de manière verbeuse (exemple complet) :\n\n```\n$ xmodmap -pm\n```\n\n```\nxmodmap:  up to 4 keys per modifier, (keycodes in parentheses):\n\nshift       Shift_L (0x32),  Shift_R (0x3e)\nlock        Caps_Lock (0x42)\ncontrol     Control_L (0x25),  Control_R (0x69)\nmod1        Alt_L (0x40),  Meta_L (0xcd)\nmod2        Num_Lock (0x94)\nmod3      \nmod4        Super_R (0x86),  Super_L (0xce),  Hyper_L (0xcf)\nmod5        ISO_Level3_Shift (0x5c),  ISO_Level3_Shift (0x6c),  Mode_switch (0x85),  Mode_switch (0xcb)\n```\n\n"
    },
    {
      "title": "Réaffectation des modificateurs aux touches de votre clavier",
      "level": 3,
      "content": "Avant l'affectation, les touches de modification doivent être effacées. Cela s'applique à la fois aux modificateurs que vous avez l'intention d'assigner et aux modificateurs des touches que vous avez l'intention d'utiliser. Par exemple, si vous avez l'intention d'attribuer Caps_Lock à votre touche A et B à votre touche NumLock, vous devez d'abord effacer les modificateurs pour Caps_Lock et Num_Lock, puis attribuer les keysyms et enfin ajouter à nouveau les modificateurs.\n\n```\n~/.Xmodmap\n```\n\n```\n[...]\nclear lock\nclear mod2\nkeycode  38 = Caps_Lock\nkeycode  77 = Num_Lock\nadd lock = Caps_Lock\nadd mod2 = Num_Lock\n```\n\n! est un commentaire, donc seuls les modificateurs Control et Mod4 sont effacés dans l'exemple suivant. Ensuite, les keysyms Control_L, Control_R, Super_L et Super_R sont assignés au modificateur opposé. L'affectation de la gauche et de la droite au même modificateur signifie que les deux touches sont traitées de la même manière.\n\n```\n~/.Xmodmap\n```\n\n```\n[...]\n!clear Shift\n!clear Lock\nclear Control\n!clear Mod1\n!clear Mod2\n!clear Mod3\nclear Mod4\n!clear Mod5\n!add Shift   = Shift_L Shift_R\n!add Lock    = Caps_Lock\nadd Control = Super_L Super_R\n!add Mod1    = Alt_L Alt_R\n!add Mod2    = Mode_switch\n!add Mod3    =\nadd Mod4    = Control_L Control_R\n!add Mod5    =\n```\n\nL'exemple suivant modifie CapsLock en Control, et Shift+CapsLock en CapsLock :\n\n```\n~/.Xmodmap\n```\n\n```\nclear lock\nclear control\nadd control = Caps_Lock Control_L Control_R\nkeycode 66 = Control_L Caps_Lock NoSymbol NoSymbol\n```\n\n"
    },
    {
      "title": "Touche de composition",
      "level": 2,
      "content": "Une touche de composition sert à créer des caractères spéciaux et des symboles qui peuvent ne pas être directement accessibles sur le clavier. Cela est particulièrement utile pour taper des lettres accentuées provenant de langues non anglaises. Par exemple, si vous appuyez sur la touche Compose e ' successivement pour obtenir é. Certains caractères nécessitent d'appuyer sur plus de deux touches après Compose. En général, une touche de modification de votre choix est affectée à Compose. La touche de composition peut être définie dans les paramètres de l'interface graphique de la plupart des environnements de bureau, mais ces options ne fonctionneront pas si une table de correspondance des touches personnalisée est utilisée comme décrit dans cet article. Pour définir la touche de composition à l'aide de Xmodmap, utilisez l'identifiant Multi_key. Par exemple, pour associer la touche alt droite (AltGr) à la touche de composition :\n\n```\n~/.Xmodmap\n```\n\n```\n[...]\nkeycode 108 = Multi_key Alt_R Meta_R Alt_R Meta_R\n```\n\nLe numéro du keycode peut varier en fonction des modèles de clavier.\n\n"
    },
    {
      "title": "Défilement inversé",
      "level": 2,
      "content": "La fonction de défilement naturel disponible dans OS X Lion (imitant le défilement des smartphones ou des tablettes) peut être reproduite avec xmodmap. Comme le pilote synaptique utilise les boutons 4/5/6/7 pour le défilement haut/bas/gauche/droite, il suffit d'intervertir l'ordre dans lequel les boutons sont déclarés dans ~/.Xmodmap :\n\n```\n~/.Xmodmap\n```\n\n```\npointer = 1 2 3 5 4 7 6 8 9 10 11 12\n```\n\nPuis mettez à jour xmodmap :\n\n```\n$ xmodmap ~/.Xmodmap\n```\n\n"
    },
    {
      "title": "Échanger les boutons de la souris",
      "level": 2,
      "content": "Les boutons gauche, central et droit de la souris correspondent respectivement aux boutons 1, 2 et 3 du pilote synaptique. Pour échanger les boutons gauche et droit de la souris, il suffit d'inverser l'ordre dans lequel ils sont listés dans votre ~/.Xmodmap :\n\n```\n~/.Xmodmap\n```\n\n```\npointer = 3 2 1\n```\n\nCela devrait suffire pour une configuration simple de la souris. Encore une fois, mettez à jour xmodmap :\n\n```\n$ xmodmap ~/.Xmodmap\n```\n\n"
    },
    {
      "title": "Espagnol",
      "level": 3,
      "content": "```\n~/.Xmodmap\n```\n\n```\nkeycode  24 = a A aacute Aacute ae AE ae\nkeycode  26 = e E eacute Eacute EuroSign cent EuroSign\nkeycode  30 = u U uacute Uacute downarrow uparrow downarrow\nkeycode  31 = i I iacute Iacute rightarrow idotless rightarrow\nkeycode  32 = o O oacute Oacute oslash Oslash oslash\nkeycode  57 = n N ntilde Ntilde n N n\nkeycode  58 = comma question comma questiondown dead_acute dead_doubleacute dead_acute\nkeycode  61 = exclam section exclamdown section dead_belowdot dead_abovedot dead_belowdot\n!Maps the Mode key to the Alt key\nkeycode 64 = Mode_switch\n```\n\n"
    },
    {
      "title": "Esperanto",
      "level": 3,
      "content": "```\n~/.Xmodmap\n```\n\n```\nkeycode 54 = c C c C ccircumflex Ccircumflex\nkeycode 42 = g G g G gcircumflex Gcircumflex\nkeycode 43 = h H h H hcircumflex Hcircumflex\nkeycode 44 = j J j J jcircumflex Jcircumflex\nkeycode 39 = s S s S scircumflex Scircumflex\nkeycode 30 = u U u U ubreve Ubreve\n```\n\n"
    },
    {
      "title": "Transformer CapsLock en Control",
      "level": 3,
      "content": "Exemple le plus simple pour transformer CapsLock en Control.\n\n```\n~/.Xmodmap\n```\n\n```\nclear lock\nclear control\nkeycode 66 = Control_L\nadd control = Control_L Control_R\n```\n\n"
    },
    {
      "title": "Transformer CapsLock en Control, et LeftControl en Hyper",
      "level": 3,
      "content": "Les utilisateurs d'ordinateurs portables peuvent préférer avoir CapsLock comme Control. La touche Control gauche peut être utilisée comme modificateur Hyper (un modificateur supplémentaire pour emacs, openbox ou i3).\n\n```\n~/.Xmodmap\n```\n\n```\nclear      lock \nclear   control\nclear      mod1\nclear      mod2\nclear      mod3\nclear      mod4\nclear      mod5\nkeycode      37 = Hyper_L\nkeycode      66 = Control_L\nadd     control = Control_L Control_R\nadd        mod1 = Alt_L Alt_R Meta_L\nadd        mod2 = Num_Lock\nadd        mod3 = Hyper_L\nadd        mod4 = Super_L Super_R\nadd        mod5 = Mode_switch ISO_Level3_Shift\n```\n\n"
    },
    {
      "title": "Transformer Super_R en Hyper_R",
      "level": 3,
      "content": "Les utilisateurs qui souhaitent avoir une touche Hyper sur un clavier complet peuvent utiliser la touche Super droite comme Hyper.\n\n```\n~/.Xmodmap\n```\n\n```\nremove  mod4 = Super_R\nkeycode  134 = Hyper_R\nadd     mod3 = Hyper_R\n```\n\n"
    },
    {
      "title": "Intervertir chaque touche numérique N avec Shift-N et vice-versa, pour la disposition croate",
      "level": 3,
      "content": "Cela devrait également fonctionner pour les dispositions similaires à la disposition croate.\n\n```\n~/.Xmodmap\n```\n\n```\nkeycode 10 = exclam 1 1 exclam asciitilde dead_tilde asciitilde\nkeycode 11 = quotedbl 2 2 quotedbl dead_caron caron dead_caron\nkeycode 12 = numbersign 3 3 numbersign asciicircum dead_circumflex asciicircum\nkeycode 13 = dollar 4 4 dollar dead_breve breve dead_breve\nkeycode 14 = percent 5 5 percent degree dead_abovering degree\nkeycode 15 = ampersand 6 6 ampersand dead_ogonek ogonek dead_ogonek\nkeycode 16 = slash 7 7 slash grave dead_grave grave\nkeycode 17 = parenleft 8 8 parenleft dead_abovedot abovedot dead_abovedot\nkeycode 18 = parenright 9 9 parenright dead_acute apostrophe dead_acute\nkeycode 19 = equal 0 0 equal dead_doubleacute doubleacute dead_doubleacute\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- xmodmap(1)\n- Multimediakeys with .Xmodmap HOWTO par Christian Weiske\n- Mapping unsupported keys with xmodmap par Pascal Bleser\n- LQWiki:List of Keysyms Recognised by Xmodmap\n\n"
    }
  ]
}