{
  "title": "Xorg.conf (Русский)",
  "url": "https://wiki.archlinux.org/title/Xorg.conf_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Автозапуск\n- Экранный менеджер\n- Оконный менеджер\n- Настройка шрифтов\n- Темы курсора\n- Среда рабочего стола\n- Wayland (Русский)\n- xinit (Русский)\n- xrandr (Русский)\n- XDMCP\n\nC https://www.x.org/wiki/:\n\nXorg (обычно называемый просто X) очень популярен среди пользователей Linux, что привело к тому, что большинство приложений с графическим интерфейсом используют X11, из-за этого Xorg доступен в большинстве дистрибутивов. Для более подробной информации смотрите статью Xorg в Википедии или посетите веб-сайт Xorg.\n\nWayland — альтернатива и преемник Xorg.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет xorg-server.\n\nВ дополнение к нему, могут понадобиться пакеты из группы xorg-apps для некоторых способов настроек. О них рассказано в соответствующих разделах.\n\nК тому же имеется группа xorg, которая включает пакеты оконной системы Xorg и пакеты из группы xorg-apps, а также шрифты.\n\n"
    },
    {
      "title": "Установка драйвера",
      "level": 3,
      "content": "Ядро Linux включает в себя видеодрайверы с открытым исходным кодом и поддержку аппаратного ускорения буфера кадров. Однако для работы OpenGL и 2D-ускорения в X11 требуется поддержка на стороне пользовательского ПО.\n\nСперва определите вашу видеокарту (в строке Subsystem будет написана её модель):\n\n```\n$ lspci -v | grep -A1 -e VGA -e 3D\n```\n\nЗатем установите соответствующий драйвер. Вы можете поискать в базе данных пакетов полный список видеодрайверов с открытым исходным кодом:\n\n```\n$ pacman -Ss xf86-video\n```\n\nXorg автоматически ищет установленные драйверы:\n\n- Если он не может найти установленным необходимый драйвер для оборудования (перечислены ниже), тогда он сначала ищет драйвер fbdev (xf86-video-fbdev), который не включает 2D или 3D ускорение.\n- Если и он не найден, тогда Xorg ищет общий драйвер vesa (xf86-video-vesa), который поддерживает большое количество чипсетов, но не включает 2D или 3D ускорение.\n- А если и vesa не найден, тогда X обратится к режиму KMS, который включает ускорение GLAMOR (смотрите modesetting(4)).\n\nДля того, чтобы ускорение видео работало, и часто для того, чтобы разблокировать все режимы, в которых может работать GPU, требуется правильный видеодрайвер:\n\nTable content:\nБренд | Тип | Документация | Драйвер | OpenGL | OpenGL (multilib) | Vulkan | Vulkan (multilib)\nAMD (ранее ATI) | Свободный | AMDGPU | xf86-video-amdgpu | mesa | lib32-mesa | vulkan-radeon / amdvlk4 | lib32-vulkan-radeon / lib32-amdvlk4\nATI | xf86-video-ati | Нет\nПроприетарный | AMDGPU PRO | xf86-video-amdgpu | amdgpu-pro-oglpAUR | lib32-amdgpu-pro-oglpAUR | vulkan-amdgpu-proAUR | lib32-vulkan-amdgpu-proAUR\nIntel | Свободный | Intel graphics | xf86-video-intel2 | mesa or mesa-amber3 | lib32-mesa | vulkan-intel | lib32-vulkan-intel\nNVIDIA | Свободный | Nouveau1 | xf86-video-nouveau | mesa | lib32-mesa | Нет5\nПроприетарный | NVIDIA1 | nvidia | nvidia-utils | lib32-nvidia-utils | nvidia-utils | lib32-nvidia-utils\nnvidia-470xx-dkmsAUR | nvidia-470xx-utilsAUR | lib32-nvidia-470xx-utilsAUR | nvidia-470xx-utilsAUR | lib32-nvidia-470xx-utilsAUR\nnvidia-390xx-dkmsAUR | nvidia-390xx-utilsAUR | lib32-nvidia-390xx-utilsAUR | nvidia-390xx-utilsAUR | lib32-nvidia-390xx-utilsAUR\n\n1. Если вы пользуетесь ноутбуком с поддержкой NVIDIA Optimus, который использует интегрированную видеокарту вместе с дискретной, обратитесь к статье NVIDIA Optimus (Русский).\n1. Чтобы узнать доступные драйверы для графики Intel 4-го поколения и выше, смотрите статью Intel graphics (Русский)#Установка.\n1. Классические драйверы OpenGL (не-Gallium3D) для старого оборудования (в Mesa 22.0 и выше поддержка классического драйвера i915 прекращена)\n1. Рекомендуется vulkan-radeon / lib32-vulkan-radeon вместо amdvlk / lib32-amdvlk (смотрите AMDGPU#Installation).\n1. NVK, экспериментальный свободный драйвер Vulkan для видеокарт NVIDIA, как ожидается, будет добавлен в mesa 23.3\n\nДругие видеодрайверы можно найти в группе xorg-drivers.\n\nXorg должен нормально работать без проприетарных драйверов, которые обычно требуются только для дополнительных возможностей, таких как аппаратное ускорение 3D-рендеринга в играх. Исключением из этого правила являются новейшие графические процессоры (особенно видеокарты NVIDIA), которые не поддерживаются драйверами с открытым исходным кодом.\n\n"
    },
    {
      "title": "AMD",
      "level": 4,
      "content": "Соответствие между моделью (например, Radeon RX 6800) и архитектурой GPU (например, RDNA 2) можно посмотреть здесь: Wikipedia:ru:Список графических процессоров AMD.\n\nTable content:\nАрхитектура GPU | Свободный драйвер | Проприетарный драйвер\nRDNA и новее | AMDGPU | AMDGPU PRO\nGCN 3 и новее\nGCN 1 и 2 | AMDGPU1 / ATI | недоступен\nTeraScaleи более старые | ATI | недоступен\n\n1. Экспериментальный.\n\n"
    },
    {
      "title": "Запуск",
      "level": 2,
      "content": "Команду Xorg(1) обычно не используют для запуска. Вместо этого оконный сервер X запускают с помощью экранного менеджера или xinit.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Xorg можно настроить через файл xorg.conf и файлы с расширением .conf: полный список каталогов, в которых ищутся эти файлы, есть в xorg.conf(5) вместе с подробным объяснением всех доступных опций.\n\n"
    },
    {
      "title": "Через файлы .conf",
      "level": 3,
      "content": "Каталог /etc/X11/xorg.conf.d/ хранит конфигурацию, специфичную для хоста (вашего компьютера). Вы можете свободно добавлять конфигурационные файлы сюда, но они обязательно должны оканчиваться на .conf: файлы читаются в алфавитном порядке и по соглашению их имена начинаются с XX- (две цифры и дефис; таким образом, например, файл, начинающийся на 10, читается раньше файла, начинающегося на 20). Эти файлы анализируются X-сервером при запуске и рассматриваются как часть традиционного конфигурационного файла xorg.conf. Обратите внимание, что при наличии конфликтующих настроек будут применены настройки из последнего прочитанного файла. Поэтому наиболее общие файлы конфигурации должны быть первыми в алфавитном порядке. Настройки из файла xorg.conf обрабатываются в самом конце.\n\nСмотрите также примеры настроек в Fedora Wiki.\n\n"
    },
    {
      "title": "Через файл xorg.conf",
      "level": 3,
      "content": "Xorg также можно настраивать через /etc/X11/xorg.conf или /etc/xorg.conf. Чтобы сгенерировать основу файла xorg.conf:\n\n```\n# Xorg :0 -configure\n```\n\nЭто создает файл xorg.conf.new в /root/, который можно скопировать в /etc/X11/xorg.conf.\n\nКроме того, ваш проприетарный видеодрайвер может поставляться с инструментом для автоматической настройки Xorg: смотрите статьи NVIDIA (Русский) или AMDGPU PRO (Русский) для подробностей.\n\n"
    },
    {
      "title": "Устройства ввода",
      "level": 2,
      "content": "Для устройств ввода в X по умолчанию используют драйвер libinput (xf86-input-libinput), но также можно использовать драйвер xf86-input-evdev и другие соответствующие драйверы.[1]\n\nUdev, являющийся зависимостью systemd, обнаруживает оборудование, и поэтому оба драйвера будут работать в режиме горячего подключения устройств ввода практически для всех устройств, как определенно в стандартных конфигурационных файлах 10-quirks.conf и 40-libinput.conf в каталоге /usr/share/X11/xorg.conf.d/.\n\nПосле запуска оконной системы X в журнал будет записываться информация об используемом драйвере для каждого подключенного устройства (обратите внимание, что имя последнего лог-файла может отличаться):\n\n```\n$ grep -e \"Using input driver \" Xorg.0.log\n```\n\nЕсли оба драйвера не поддерживают конкретное устройство, установите необходимый драйвер из группы xorg-drivers. То же самое относится, если вы желаете использовать другой драйвер.\n\nЧтобы изменить поведение горячего подключения (hotplugging), смотрите раздел #Настройка.\n\nКонкретные инструкции есть в статье libinput и в упомянутых ниже статьях, а дополнительные примеры можно посмотреть в Fedora Wiki.\n\n"
    },
    {
      "title": "Идентификация ввода",
      "level": 3,
      "content": "Смотрите Keyboard input (Русский)#Определение кодов клавиш в Xorg.\n\n"
    },
    {
      "title": "Ускорение мыши",
      "level": 3,
      "content": "Смотрите Mouse acceleration.\n\n"
    },
    {
      "title": "Дополнительные кнопки мыши",
      "level": 3,
      "content": "Смотрите кнопки мыши.\n\n"
    },
    {
      "title": "Тачпад",
      "level": 3,
      "content": "Смотрите libinput или Touchpad Synaptics (Русский).\n\n"
    },
    {
      "title": "Тачскрин",
      "level": 3,
      "content": "Смотрите Touchscreen.\n\n"
    },
    {
      "title": "Настройка клавиатуры",
      "level": 3,
      "content": "Смотрите конфигурация клавиатуры в Xorg.\n\n"
    },
    {
      "title": "Ручная настройка",
      "level": 3,
      "content": "- Новые версии Xorg автоматически всё настраивают, поэтому ручная настройка чаще всего не требуется.\n- Если Xorg не может обнаружить монитор или если автонастройка не нужна, можно использовать файл конфигурации. Распространённым случаем, когда это необходимо, является система без монитора (headless), которая автоматически запускает Xorg либо с виртуальной консоли при входе, либо с экранного менеджера.\n\nДля системы без монитора необходим драйвер xf86-video-dummy. Установите его и создайте файл конфигурации, например, с таким содержанием:\n\n```\n/etc/X11/xorg.conf.d/10-headless.conf\n```\n\n```\nSection \"Monitor\"\n        Identifier \"dummy_monitor\"\n        HorizSync 28.0-80.0\n        VertRefresh 48.0-75.0\n        Modeline \"1920x1080\" 172.80 1920 2040 2248 2576 1080 1081 1084 1118\nEndSection\n\nSection \"Device\"\n        Identifier \"dummy_card\"\n        VideoRam 256000\n        Driver \"dummy\"\nEndSection\n\nSection \"Screen\"\n        Identifier \"dummy_screen\"\n        Device \"dummy_card\"\n        Monitor \"dummy_monitor\"\n        SubSection \"Display\"\n        EndSubSection\nEndSection\n```\n\n"
    },
    {
      "title": "Несколько мониторов",
      "level": 3,
      "content": "Смотрите главную статью Multihead для получения общей информации.\n\n"
    },
    {
      "title": "Более одной видеокарты",
      "level": 4,
      "content": "Вы должны определить нужный драйвер для использования и ввести ID шины (bus ID) нужной видеокарты (в десятичном виде).\n\n```\nSection \"Device\"\n    Identifier             \"Screen0\"\n    Driver                 \"intel\"\n    BusID                  \"PCI:0:2:0\"\nEndSection\n\nSection \"Device\"\n    Identifier             \"Screen1\"\n    Driver                 \"nouveau\"\n    BusID                  \"PCI:1:0:0\"\nEndSection\n```\n\nЧтобы узнать ID шины (в шестнадцатеричном виде):\n\n```\n$ lspci | grep -e VGA -e 3D\n```\n\n```\n00:02.0 VGA compatible controller: Intel Corporation HD Graphics 630 (rev 04)\n01:00.0 3D controller: NVIDIA Corporation GP107M [GeForce GTX 1050 Mobile] (rev a1)\n```\n\nID шины здесь 0:2:0 и 1:0:0.\n\n"
    },
    {
      "title": "Размер дисплея и DPI",
      "level": 3,
      "content": "По умолчанию Xorg всегда устанавливает DPI равным 96, начиная с 2009-01-30. В версии 21.1 было добавлено корректное автоопределение DPI, но оно было убрано.\n\nЗадать DPI для X-сервера можно с помощью опции командной строки -dpi.\n\nНаличие правильного DPI особенно необходимо, когда требуются точные детали (например, рендеринг шрифтов). Ранее производители пытались создать стандарт для 96 DPI (монитор с диагональю размером 10,3 дюйма был бы 800x600, 13,2-дюймовый монитор - 1024x768). Сейчас DPI экранов отличаются и могут быть не равными по горизонтали и по вертикали. Например, 19-дюймовый широкоэкранный ЖК-дисплей с разрешением 1440x900 может иметь DPI 89х87.\n\nЧтобы убедиться, что разрешение вашего дисплея и DPI обнаружены/правильно рассчитаны:\n\n```\n$ xdpyinfo | grep -B2 resolution\n```\n\nУбедитесь, что выведенные размеры (dimensions) соответствуют настоящему размеру вашего монитора.\n\nЕсли вы знаете физический размер экрана, его можно ввести в конфигурационный файл Xorg так, чтобы был рассчитан правильный DPI (измените Identifier в соответствии с выводом вашего xrandr):\n\n```\nSection \"Monitor\"\n    Identifier             \"DVI-D-0\"\n    DisplaySize             286 179    # В миллиметрах\nEndSection\n```\n\nЕсли вы только хотите ввести спецификацию вашего монитора без создания полного xorg.conf, тогда создайте новый конфигурационный файл. Например, (/etc/X11/xorg.conf.d/90-monitor.conf):\n\n```\nSection \"Monitor\"\n    Identifier             \"<default monitor>\"\n    DisplaySize            286 179    # В миллиметрах\nEndSection\n```\n\nЕсли вы не знаете ширину и высоту монитора (сейчас в большинстве спецификаций указывается только размер диагонали), вы можете использовать родное разрешение монитора (или соотношение сторон) и размер диагонали для вычисления ширины и высоты. Используя теорему Пифагора для монитора с диагональю 13,3\" и с родным разрешением 1280x800 (или соотношением сторон 16:10):\n\n```\n$ echo 'scale=5;sqrt(1280^2+800^2)' | bc  # 1509.43698\n```\n\nВы получите размер диагонали в пикселях. С помощью него можно узнать ширину и высоту монитора в дюймах (а затем перевести их в миллиметры):\n\n```\n$ echo 'scale=5;(13.3/1509)*1280*25.4' | bc  # 286.43072\n$ echo 'scale=5;(13.3/1509)*800*25.4'  | bc  # 179.01920\n```\n\n"
    },
    {
      "title": "Настройка DPI вручную",
      "level": 4,
      "content": "Для RandR-совместимых драйверов (например, драйвер ATI с открытым исходным кодом) вы можете установить dpi так:\n\n```\n$ xrandr --dpi 144\n```\n\nЧтобы сделать его постоянным, посмотрите запуск команд после запуска X.\n\nВы можете установить DPI вручную, добавив в раздел Device или Screen:\n\n```\nOption              \"DPI\" \"96 x 96\"\n```\n\nGTK очень часто переопределяет DPI сервера через опциональный Xresource Xft.dpi. Чтобы выяснить, происходит ли это у вас, выполните:\n\n```\n$ xrdb -query | grep dpi\n```\n\nНачиная с версии GTK 3.16, если эта переменная явно не задана, GTK задаёт ей значение 96. Чтобы приложения GTK работали с DPI сервера, потребуется явно задать в Xft.dpi то же значение, что и у сервера. Некоторые среды рабочего стола также используют Xft.dpi при изменении DPI через настройки среды — например, KDE и TDE.\n\n"
    },
    {
      "title": "Управление питанием дисплея",
      "level": 3,
      "content": "DPMS (Display Power Management Signaling (англ), сигналы управления энергопотреблением дисплеев) — технология, позволяющая настроить энергосбережение монитора, когда компьютер не используется. Она позволит вам автоматически переключить монитор в режим ожидания через определенное время простоя.\n\n"
    },
    {
      "title": "Композит",
      "level": 2,
      "content": "Расширение Composite для X позволяет вывести всё поддерево иерархии окон в буфер вне экрана. Затем приложения могут загружать содержимое этого буфера и делать с ним всё, что им заблагорассудится. Закадровый буфер может автоматически объединяться в родительское окно или объединяться внешними программами, называемыми композитными менеджерами. Для получения дополнительной информации смотрите статью Wikipedia:ru:Композитный менеджер окон.\n\nНекоторые оконные менеджеры (например, Compiz, Enlightenment, KWin, Marco, Metacity, Muffin, Mutter, Xfwm) имеют встроенный композитинг. Для других оконных менеджеров можно использовать отдельные композитные менеджеры.\n\n"
    },
    {
      "title": "Список композитных менеджеров",
      "level": 3,
      "content": "- Picom — Легкий композитор с функциями добавления теней, размытия и выцветания. Форк Compton.\n\n- Xcompmgr — Композитный оконный менеджер.\n\n- Gamescope — Микрокомпозитор от Valve с возможностями, ориентированными на игры, такими как масштабирование с помощью FSR. Форк steamos-compositor.\n\n- steamos-compositor-plus — Композитор от Valve с некоторыми дополнительными исправлениями и доработками.\n\n"
    },
    {
      "title": "Автоматизация",
      "level": 3,
      "content": "В этом разделе перечислены утилиты для автоматизации операций с окнами (например, перемещение, изменение размера или фокусировка), ввода/вывода клавиатуры и мыши.\n\nTable content:\nУтилита | Пакет | Документация | Эмуляцияклавиш | Операциис окнами | Примечание\nxautomation | xautomation | xte(1) | Да | Нет | Также содержит инструменты для анализа содержимого экрана (screen scraping). Не может эмулировать F13+.\nxdo | xdo | xdo(1) | Нет | Да | Небольшая утилита X для выполнения элементарных действий над окнами.\nxdotool | xdotool | xdotool(1) | Да | Да | Очень забагованный и находится в неактивной разработке, например: имеет сломанный CLI parsing.[2][3]\nxvkbd | xvkbdAUR | xvkbd(1) | Да | Нет | Виртуальная клавиатура для Xorg, также имеет параметр -text для отправки символов.\nAutoKey | autokey-qtAUR autokey-gtkAUR | documentation | Да | Да | Высокоуровневая мощная утилита для работы с макросами и скриптами, имеющая интерфейсы Qt и GTK.\n\nСмотрите также Буфер обмена#Инструменты и обзор средств автоматизации X.\n\n"
    },
    {
      "title": "Вложенная X-сессия",
      "level": 3,
      "content": "Для запуска вложенного сеанса другой среды рабочего стола:\n\n```\n$ /usr/bin/Xnest :1 -geometry 1024x768+0+0 -ac -name Windowmaker & wmaker -display :1\n```\n\nЭто запустит сеанс Window Maker в окне 1024 на 768 в рамках текущей X-сессии.\n\nДля этого необходим установленный пакет xorg-server-xnest.\n\nБолее современный подход — использование Xephyr.\n\n"
    },
    {
      "title": "Запуск приложения без оконного менеджера",
      "level": 3,
      "content": "Смотрите xinit (Русский)#Запуск приложений без оконного менеджера.\n\n"
    },
    {
      "title": "Запуск графических программ удалённо",
      "level": 3,
      "content": "Смотрите основную статью: Secure Shell (Русский)#Проброс X11.\n\n"
    },
    {
      "title": "Отключение и включение устройств ввода при необходимости",
      "level": 3,
      "content": "С помощью xinput вы можете временно отключить или включить устройства ввода. Это полезно, например, на системах, имеющих несколько мышек, таких как ThinkPad, и вам хотелось бы использовать только одну, чтобы избежать случайные нажатия.\n\nУстановите пакет xorg-xinput.\n\nНайдите имя или ID устройства, которое вы хотите отключить:\n\n```\n$ xinput\n```\n\nНапример для ноутбука Lenovo ThinkPad T500 вывод выглядит следующим образом:\n\n```\n$ xinput\n```\n\n```\n⎡ Virtual core pointer                          id=2    [master pointer  (3)]\n⎜   ↳ Virtual core XTEST pointer                id=4    [slave  pointer  (2)]\n⎜   ↳ TPPS/2 IBM TrackPoint                     id=11   [slave  pointer  (2)]\n⎜   ↳ SynPS/2 Synaptics TouchPad                id=10   [slave  pointer  (2)]\n⎣ Virtual core keyboard                         id=3    [master keyboard (2)]\n    ↳ Virtual core XTEST keyboard               id=5    [slave  keyboard (3)]\n    ↳ Power Button                              id=6    [slave  keyboard (3)]\n    ↳ Video Bus                                 id=7    [slave  keyboard (3)]\n    ↳ Sleep Button                              id=8    [slave  keyboard (3)]\n    ↳ AT Translated Set 2 keyboard              id=9    [slave  keyboard (3)]\n    ↳ ThinkPad Extra Buttons                    id=12   [slave  keyboard (3)]\n```\n\nОтключить устройство можно командой xinput --disable устройство, где устройство это ID устройства или имя устройства, которое вы хотите отключить. В следующем примере мы отключим тачпад Synaptics с ID 10:\n\n```\n$ xinput --disable 10\n```\n\nЧтобы снова включить устройство, просто выполните противоположную команду:\n\n```\n$ xinput --enable 10\n```\n\nТак выглядит команда для выключения устройства (здесь тачпада) через его имя:\n\n```\n$ xinput --disable \"SynPS/2 Synaptics TouchPad\"\n```\n\n"
    },
    {
      "title": "Постоянное отключение устройства ввода",
      "level": 3,
      "content": "Полностью отключить определённое устройство ввода можно с помощью такой настройки:\n\n```\n/etc/X11/xorg.conf.d/30-disable-устройство.conf\n```\n\n```\nSection \"InputClass\"\n       Identifier   \"disable-устройство\"\n       Driver       \"имя_драйвера\"\n       MatchProduct \"имя_устройства\"\n       Option       \"Ignore\" \"True\"\nEndSection\n```\n\nустройство — произвольное имя, а имя_драйвера — например, libinput. имя_устройства — это то, что фактически используется для поиска нужного устройства. Могут быть и другие методы поиска нужного устройства, например MatchIsTouchscreen из libinput, о которых можно почитать в документации соответствующего драйвера. Хотя в данном примере используется libinput, это метод не зависит от драйвера и просто предотвращает передачу информации об устройстве в драйвер.\n\n"
    },
    {
      "title": "Закрытие приложения с помощью горячей клавиши",
      "level": 3,
      "content": "Привяжите скрипт к горячей клавише:\n\n```\n#!/bin/sh\nwindowFocus=$(xdotool getwindowfocus)\npid=$(xprop -id \"$windowFocus\" | grep PID)\nkill -9 \"$pid\"\n```\n\nЗависимости: xorg-xprop, xdotool\n\nСмотрите также #Визуальное закрытие приложения.\n\n"
    },
    {
      "title": "Блокирование доступа к TTY",
      "level": 3,
      "content": "Чтобы запретить доступ к tty при нахождении в сеансе X, добавьте следующее в файл xorg.conf:\n\n```\nSection \"ServerFlags\"\n    Option \"DontVTSwitch\" \"True\"\nEndSection\n```\n\nЭто можно использовать для ограничения доступа к командной строке на системе, доступной для недоверенных пользователей.\n\n"
    },
    {
      "title": "Запрет пользователю закрывать, перезапускать X",
      "level": 3,
      "content": "Чтобы запретить пользователю закрывать, перезапускать запущенный Xorg, добавьте следующее в файл xorg.conf:\n\n```\nSection \"ServerFlags\"\n    Option \"DontZap\"      \"True\"\nEndSection\n```\n\n"
    },
    {
      "title": "Визуальное закрытие приложения",
      "level": 3,
      "content": "Если приложение ведёт себя некорректно или зависло, вместо использования kill или killall из терминала и необходимости искать идентификатор или имя процесса можно использовать xorg-xkill, который позволяет щёлкнуть по окну проблемного приложения, чтобы закрыть его соединение с X-сервером. Многие существующие приложения действительно завершают свою работу (abort) при закрытии соединения с X-сервером, но некоторые могут продолжить работу.\n\n"
    },
    {
      "title": "Использование Xorg без прав суперпользователя",
      "level": 3,
      "content": "Xorg может запускаться с привилегиями обычного пользователя вместо root (так называемый «Rootless Xorg»). Это значительно повышает безопасность по сравнению с запуском от имени суперпользователя. Обратите внимание, что некоторые популярные экранные менеджеры не поддерживают rootless Xorg (например, LightDM или XDM).\n\nПроверить, от имени какого пользователя запущен Xorg, можно с помощью команды ps -o user= -C Xorg.\n\nСмотрите также Xorg.wrap(1), systemd-logind(8), systemd/Пользователь#Xorg как пользовательская служба systemd, Fedora:Changes/XorgWithoutRootRights и FS#41257.\n\n"
    },
    {
      "title": "Через xinitrc",
      "level": 4,
      "content": "Чтобы настроить запуск rootless Xorg с использованием xinitrc:\n\n- Запускайте startx как подпроцесс оболочки входа (login shell); запускайте startx напрямую и не используйте exec startx.\n- Убедитесь, что Xorg использует виртуальный терминал, для которого были установлены права доступа, то есть который logind передал в $XDG_VTNR через .xserverrc.\n- При использовании некоторых проприетарных драйверов дисплея автоопределение kernel mode setting может оказаться неудачным. В этом случае в файле /etc/X11/Xwrapper.config укажите needs_root_rights = no.\n\n"
    },
    {
      "title": "Через GDM",
      "level": 4,
      "content": "При использовании kernel mode setting по умолчанию GDM запускает Xorg без прав root.\n\n"
    },
    {
      "title": "Перенаправление журнала сеанса",
      "level": 4,
      "content": "Пока журналы пользователя Xorg хранятся в ~/.local/share/xorg/Xorg.log, они не включают вывод X-сессии. Чтобы повторно включить перенаправление, запустите X с флагом -keeptty:\n\n```\nstartx -- -keeptty >~/.xorg.log 2>&1\n```\n\nИли скопируйте /etc/X11/xinit/xserverrc в ~/.xserverrc и добавьте -keeptty. Для получения дополнительной информации смотрите [4].\n\n"
    },
    {
      "title": "Использование Xorg с правами суперпользователя",
      "level": 3,
      "content": "Как упоминалось выше, иногда по умолчанию используется Xorg без права root. Если это ваш случай и у вас есть необходимость запускать Xorg от имени root, вы можете настроить Xorg.wrap(1) на требование root:\n\n```\n/etc/X11/Xwrapper.config\n```\n\n```\nneeds_root_rights = yes\n```\n\n"
    },
    {
      "title": "Общее",
      "level": 3,
      "content": "Если произошла какая-то проблема с X, посмотрите лог (журнал), хранящийся в /var/log/ или для пользователей без рут-доступа в ~/.local/share/xorg/ (по умолчанию с версии 1.16). Пользователям GDM следует проверить журнал systemd. [5]\n\nФайлы журналов имеют следующий вид Xorg.n.log, где n — номер дисплея. Для однопользовательского компьютера с настройками по умолчанию имя нужного журнала обычно Xorg.0.log, но для остальных оно может отличаться. Чтобы убедиться, что выбранный вами файл правильный, посмотрите временную отметку запуска сеанса X сервера и из какой консоли он был запущен. Например:\n\n```\n$ grep -e Log -e tty Xorg.0.log\n```\n\n```\n[    40.623] (==) Log file: \"/home/archuser/.local/share/xorg/Xorg.0.log\", Time: Thu Aug 28 12:36:44 2014\n[    40.704] (--) controlling tty is VT number 1, auto-enabling KeepTty\n```\n\n```\n$ tail -f ~/.local/share/xorg/Xorg.0.log | ts\n```\n\n- При просмотре журнала будьте внимательны к строкам, начинающимся с (EE), которые обозначают ошибки, и к строкам (WW), которые предупреждают об возможных других проблемах.\n- Если файл .xinitrc пустой в $HOME, то его необходимо или удалить, или изменить для правильной загрузки X. Не сделав этого, вы получите пустой экран, а в журнале возможно Xorg.0.log не будет ошибок. Просто удалив его, у вас будет запускаться стандартное окружение X.\n- Если экран становится чёрным, вы всё ещё можете попытаться переключиться на другую виртуальную консоль (например, Ctrl+Alt+F6), и вслепую войти в систему как root. Чтобы сделать это, введите логин root (нажмите Enter после ввода), а потом введите пароль (снова нажмите Enter после ввода).\n\n```\n# pkill -x X\n```\n\n```\n# reboot\n```\n\n- Если у вас проблемы с устройствами ввода (клавиатурой, мышкой, тачпадом, и т.д.), смотрите страницы в Category:Input devices (Русский).\n- Смотрите также решение проблем в статьях AMDGPU (Русский), Intel graphics (Русский) и NVIDIA (Русский).\n\n"
    },
    {
      "title": "Чёрный экран, No protocol specified, Resource temporarily unavailable для всех или некоторых пользователей",
      "level": 3,
      "content": "X создает конфигурационные и временные файлы в текущем домашнем каталоге пользователя. Убедитесь в наличии свободного места на разделе, в котором находится домашний каталог. К сожалению, X сервер в этом случае не представляет очевидную информацию о недостатке места.\n\n"
    },
    {
      "title": "DRI с картами Matrox перестает работать",
      "level": 3,
      "content": "Если вы используете карту Matrox и DRI перестал работать после обновления Xorg, попробуйте добавить строку:\n\n```\nOption \"OldDmaInit\" \"On\"\n```\n\nв раздел Device, который ссылается на видеокарту в xorg.conf.\n\n"
    },
    {
      "title": "Проблемы с режимом Фреймбуфер",
      "level": 3,
      "content": "Если X не запускается со следующим сообщением в журнале,\n\n```\n(WW) Falling back to old probe method for fbdev\n(II) Loading sub module \"fbdevhw\"\n(II) LoadModule: \"fbdevhw\"\n(II) Loading /usr/lib/xorg/modules/linux//libfbdevhw.so\n(II) Module fbdevhw: vendor=\"X.Org Foundation\"\n       compiled for 1.6.1, module version=0.0.2\n       ABI class: X.Org Video Driver, version 5.0\n(II) FBDEV(1): using default device\n\nFatal server error:\nCannot run in framebuffer mode. Please specify busIDs for all framebuffer devices\n```\n\nУдалите пакет xf86-video-fbdev.\n\n"
    },
    {
      "title": "Программа требует \"font '(null)'\"",
      "level": 3,
      "content": "Сообщение об ошибке: unable to load font `(null)'.\n\nНекоторые программы работают только с растровыми шрифтами. Имеется два крупных пакета с растровыми шрифтами xorg-fonts-75dpi и xorg-fonts-100dpi. Вам не нужны оба; одного будет достаточно. Чтобы выяснить какой будет лучше в вашем случае, попробуйте утилиту xdpyinfo из пакета xorg-xdpyinfo таким образом:\n\n```\n$ xdpyinfo | grep resolution\n```\n\nи используйте тот шрифт, у которого dpi ближе к показанному значению.\n\n"
    },
    {
      "title": "Восстановление: отключение Xorg перед входом в GUI",
      "level": 3,
      "content": "Если Xorg настроен на автозапуск и по какой-то причине вам нужно предотвратить его запуск до менеджера входа/экранного менеджера (например, если ваша система неправильно настроена и Xorg не распознает ввод с помощью мыши или клавиатуры), вы можете решить эту задачу двумя способами.\n\n- Изменить цель по умолчанию на rescue.target. Для получения дополнительной информации смотрите systemd (Русский)#Изменение цели загрузки по умолчанию.\n- Если у вас не только сломанная система, которая делает Xorg непригодным для использования, но также задержка меню GRUB установлена в ноль, или никак иначе нельзя использовать GRUB для предотвращения загрузки Xorg, вы можете использовать установочный образ Arch Linux. Следуйте руководству по установке до момента монтирования разделов и выполните chroot в установленный Arch Linux. Другой вариант — попытайтесь переключиться на другую tty с помощью сочетания клавиш Ctrl+Alt + функциональная клавиша (обычно от F1 до F7 в зависимости от того, на какой не запущен X), войдите как root и следуйте шагам ниже.\n\nВ зависимости от настройки, вам необходимо выполнить один или более шагов:\n\n- Отключите экранный менеджер.\n- Отключите автозапуск X при входе в систему.\n- Переименуйте файл ~/.xinitrc или закомментируйте в нём строку с exec.\n\n"
    },
    {
      "title": "Клиент X запускается с ошибкой \"su\"",
      "level": 3,
      "content": "Если вы получаете сообщение Client is not authorized to connect to server (Клиент не авторизован для подключения к серверу), попробуйте добавить строку:\n\n```\nsession        optional        pam_xauth.so\n```\n\nв /etc/pam.d/su и /etc/pam.d/su-l. Затем pam_xauth правильно установит переменные окружения и обработает ключи xauth.\n\n"
    },
    {
      "title": "Не удалось запустить X: Ошибка инициализации клавиатуры",
      "level": 3,
      "content": "Если файловая система (в частности /tmp) заполнена, startx не запустится. В конце журнала /var/log/Xorg.0.log будет:\n\n```\n(EE) Error compiling keymap (server-0)\n(EE) XKB: Could not compile keymap\n(EE) XKB: Failed to load keymap. Loading default keymap instead.\n(EE) Error compiling keymap (server-0)\n(EE) XKB: Could not compile keymap\nXKB: Failed to compile keymap\nKeyboard initialization failed. This could be a missing or incorrect setup of xkeyboard-config.\nFatal server error:\nFailed to activate core devices.\nPlease consult the The X.Org Foundation support at http://wiki.x.org\nfor help.\nPlease also check the log file at \"/var/log/Xorg.0.log\" for additional information.\n(II) AIGLX: Suspending AIGLX clients for VT switch\n```\n\nОсвободите место на соответствующей файловой системе, и X сервер запустится.\n\n"
    },
    {
      "title": "Зелёный экран при попытке просмотра видео",
      "level": 3,
      "content": "У вас неправильно установлена цветовая глубина. Например, требуется 24 вместо 16.\n\n"
    },
    {
      "title": "Ошибка SocketCreateListener",
      "level": 3,
      "content": "Если X завершаются с сообщением об ошибке SocketCreateListener() failed, удалите файлы сокета в /tmp/.X11-unix. Это может происходить после того, как вы ранее запускали Xorg с правами суперпользователя (например, для создания xorg.conf).\n\n"
    },
    {
      "title": "Неверный ключ MIT-MAGIC-COOKIE-1 при попытке запустить программу от имени суперпользователя",
      "level": 3,
      "content": "Эта ошибка означает, что только текущий пользователь имеет доступ к X-серверу. Решение состоит в том, чтобы предоставить доступ для суперпользователя:\n\n```\n$ xhost +si:localuser:root\n```\n\nЭта строка также может быть использована для предоставления доступа к X другому пользователю, нежели root.\n\n"
    },
    {
      "title": "Фатальная ошибка сервера: (EE) AddScreen/ScreenInit",
      "level": 3,
      "content": "Если Xorg-server не работает случайным образом и в логе Xorg вы видите:\n\n```\nsystemd-logind: failed to take device /dev/dri/card0: Operation not permitted\n...\nAddScreen/ScreenInit failed for driver 0\n```\n\nТогда это может быть вызвано проблемой systemd #134943. Настройте ранний запуск KMS.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Xplain — подробное объяснение оконной системы X\n- Xorg(1) — справочная страница Xorg\n- Prepare for LPIC-1 exam 2 - topic 106.1: X11 — кратко описывает архитектуру, настройку, среды рабочего стола, удалённое использование, Wayland.\n- xorg.conf(5)\n- Gentoo:Xorg/Guide#Configuration — статья о конфигурации Xorg на Gentoo Wiki\n\n"
    }
  ]
}