{
  "title": "Xorg (Français)",
  "url": "https://wiki.archlinux.org/title/Xorg_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Autostarting\n- Display manager (Français)\n- Window manager (Français)\n- Font configuration\n- Cursor themes\n- Desktop environment\n- Wayland (Français)\n- xinit (Français)\n- xrandr\n- XDMCP\n\nSelon https://www.x.org/wiki/ :\n\nXorg (communément appelé simplement X) est le serveur d'affichage le plus populaire parmi les utilisateurs de Linux. Son omniprésence a conduit à en faire un élément indispensable pour les applications d'interface graphique, ce qui a entraîné une adoption massive de la plupart des distributions. Consultez l'article Xorg. Wikipedia ou visitez le Xorg website pour plus de détails.\n\nPour l'alternative et le successeur potentiel, renseignez-vous sur Wayland.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Xorg peut être installé avec le paquet xorg-server.\n\nDe plus, certains paquets du groupe xorg-apps sont nécessaires pour certaines tâches de configuration. Ils sont signalés dans les sections correspondantes.\n\nEnfin, un groupe xorg est également disponible, qui inclut les paquets du serveur Xorg, les paquets du groupe xorg-apps et les polices.\n\n"
    },
    {
      "title": "Installation des pilotes",
      "level": 3,
      "content": "Le noyau Linux comprend des pilotes vidéo à source ouverte et prend en charge les framebuffers accélérés par le matériel. Cependant, la prise en charge en espace utilisateur est nécessaire pour OpenGL et l'accélération 2D dans X11.\n\nTout d'abord, identifiez la carte graphique (la sortie Subsystem indique le modèle spécifique) :\n\n```\n$ lspci -v | grep -A1 -e VGA -e 3D\n```\n\nEnsuite, installez un pilote approprié. Vous pouvez consulter la base de données des paquets pour obtenir une liste complète des pilotes vidéo open-source :\n\n```\n$ pacman -Ss xf86-video\n```\n\nXorg recherche automatiquement les pilotes installés :\n\n- S'il ne trouve pas le pilote spécifique installé pour le matériel (listé ci-dessous), il recherche d'abord fbdev (xf86-video-fbdev) qui n'inclue aucune accélération 2D ou 3D.\n- S'il ne le trouve pas, il recherche vesa (xf86-video-vesa), le pilote générique, qui gère un grand nombre de chipsets mais n'inclut pas d'accélération 2D ou 3D.\n- Si vesa n'est pas trouvé, Xorg se rabattra sur le kernel mode setting, qui inclut l'accélération GLAMOR (consultez modesetting(4)).\n\nPour que l'accélération vidéo fonctionne, et souvent pour exposer tous les modes que le GPU peut définir, un pilote vidéo approprié est nécessaire :\n\nTable content:\nMarque | Type | Driver | OpenGL | OpenGL (multilib) | Documentation\nAMD / ATI | Libre | xf86-video-amdgpu | mesa | lib32-mesa | AMDGPU\nxf86-video-ati | ATI\nPropriétaire | xf86-video-amdgpu | amdgpu-pro-oglpAUR | lib32-amdgpu-pro-oglpAUR | AMDGPU PRO\nIntel | Libre | xf86-video-intel1 | mesa | lib32-mesa | Intel graphics\nNVIDIA | Libre | xf86-video-nouveau | mesa | lib32-mesa | Nouveau2\nPropriétaire | nvidia | nvidia-utils | lib32-nvidia-utils | NVIDIA2\nnvidia-470xx-dkmsAUR | nvidia-470xx-utilsAUR | lib32-nvidia-470xx-utilsAUR\nnvidia-390xx-dkmsAUR | nvidia-390xx-utilsAUR | lib32-nvidia-390xx-utilsAUR\n\n1. Pour les cartes graphiques Intel de 4ème génération et plus, consultez Intel graphics (Français)#Installation pour connaître les pilotes disponibles.\n1. Pour les ordinateurs portables équipés de NVIDIA Optimus qui utilisent une carte vidéo intégrée combinée à un GPU dédié, consultez NVIDIA Optimus.\n\nD'autres pilotes vidéo peuvent être trouvés dans le groupe xorg-drivers.\n\nXorg devrait fonctionner sans problème sans pilotes à source fermée, qui ne sont généralement nécessaires que pour les fonctionnalités avancées telles que le rendu rapide en 3D pour les jeux. Les exceptions à cette règle sont les GPU récents (en particulier les GPU NVIDIA) qui ne sont pas pris en charge par les pilotes open source.\n\n"
    },
    {
      "title": "AMD",
      "level": 4,
      "content": "Pour une traduction des noms de modèles (par exemple, Radeon RX 6800) en architectures de GPU (par exemple, RDNA 2), consultez wikipedia:List of AMD graphics processing units.\n\nTable content:\nGPU architecture | Open-source driver | Proprietary driver\nRDNA, RDNA 2 | AMDGPU | AMDGPU PRO\nGCN 3, GCN 4, GCN 5\nGCN 1, GCN 2 | AMDGPU* / ATI | non disponible\nTeraScaleet antérieur | ATI | non disponible\n\n"
    },
    {
      "title": "Exécution",
      "level": 2,
      "content": "La commande Xorg(1) n'est généralement pas exécutée directement. Au lieu de cela, le serveur X est lancé avec un gestionnaire d'affichage ou xinit.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Xorg utilise un fichier de configuration appelé xorg.conf et des fichiers se terminant par le suffixe .conf pour sa configuration initiale : la liste complète des dossiers dans lesquels ces fichiers sont recherchés se trouve dans xorg.conf(5), ainsi qu'une explication détaillée de toutes les options disponibles.\n\n"
    },
    {
      "title": "Utilisation des fichiers .conf",
      "level": 3,
      "content": "Le répertoire /etc/X11/xorg.conf.d/ stocke la configuration spécifique à l'hôte. Vous êtes libre d'y ajouter des fichiers de configuration, mais ils doivent avoir un suffixe .conf : les fichiers sont lus dans l'ordre ASCII, et par convention, leurs noms commencent par XX- (deux chiffres et un trait d'union, de sorte que par exemple 10 est lu avant 20). Ces fichiers sont analysés par le serveur X au démarrage et sont traités comme une partie du fichier de configuration traditionnel xorg.conf. Notez qu'en cas de conflit de configuration, le fichier lu en dernier sera conservé. Pour cette raison, les fichiers de configuration les plus génériques devraient être classés en premier par nom. Les entrées de configuration dans le fichier xorg.conf sont traitées à la fin.\n\nPour des exemples d'options à définir, consultez Fedora:Input device configuration#xorg.conf.d.\n\n"
    },
    {
      "title": "Utilisation de xorg.conf",
      "level": 3,
      "content": "Xorg peut également être configuré via /etc/X11/xorg.conf ou /etc/xorg.conf. Vous pouvez également générer un squelette pour xorg.conf avec :\n\n```\n# Xorg :0 -configure\n```\n\nCela devrait créer un fichier xorg.conf.new dans /root/ que vous pouvez copier dans /etc/X11/xorg.conf.\n\nIl se peut également que les pilotes de votre carte vidéo propriétaire soient fournis avec un outil permettant de configurer automatiquement Xorg : consultez l'article de votre pilote vidéo, NVIDIA ou AMDGPU PRO, pour plus de détails.\n\n"
    },
    {
      "title": "Périphériques d'entrée",
      "level": 2,
      "content": "Pour les périphériques d'entrée, le serveur X utilise par défaut le pilote libinput (xf86-input-libinput), mais xf86-input-evdev et les pilotes associés sont disponibles comme alternative. [1]\n\nUdev, qui est fourni comme dépendance de systemd, détectera le matériel et les deux pilotes agiront comme pilote d'entrée à chaud pour presque tous les périphériques, comme défini dans les fichiers de configuration par défaut 10-quirks.conf et 40-libinput.conf dans le répertoire /usr/share/X11/xorg.conf.d/.\n\nAprès le démarrage du serveur X, le fichier journal indiquera quel pilote a été branché à chaud pour les différents périphériques (notez que le nom du fichier journal le plus récent peut varier) :\n\n```\n$ grep -e \"Using input driver \" Xorg.0.log\n```\n\nSi les deux ne prennent pas en charge un périphérique particulier, installez le pilote nécessaire à partir du groupe xorg-drivers. La même chose s'applique si vous voulez utiliser un autre pilote.\n\nPour influencer le hotplugging, consultez #Configuration.\n\nPour des instructions spécifiques, consultez également l'article libinput, les pages suivantes ci-dessous, ou Fedora:Input device configuration pour plus d'exemples.\n\n"
    },
    {
      "title": "Identification de l'entrée",
      "level": 3,
      "content": "Consultez Keyboard input#Identifying keycodes in Xorg.\n\n"
    },
    {
      "title": "Accélération de la souris",
      "level": 3,
      "content": "Consultez Mouse acceleration.\n\n"
    },
    {
      "title": "Boutons de souris supplémentaires",
      "level": 3,
      "content": "Consultez Mouse buttons.\n\n"
    },
    {
      "title": "Touchpad",
      "level": 3,
      "content": "Consultez libinput ou Synaptics.\n\n"
    },
    {
      "title": "Écran tactile",
      "level": 3,
      "content": "Consultez Touchscreen.\n\n"
    },
    {
      "title": "Paramètres du clavier",
      "level": 3,
      "content": "Consultez Configuration du clavier dans Xorg.\n\n"
    },
    {
      "title": "Configuration manuelle",
      "level": 3,
      "content": "- Les versions récentes d'Xorg sont auto-configurées, donc la configuration manuelle ne devrait pas être nécessaire.\n- Si Xorg est incapable de détecter un moniteur ou pour éviter l'auto-configuration, un fichier de configuration peut être utilisé. Un cas courant où cela est nécessaire est un système headless, qui démarre sans moniteur et lance Xorg automatiquement, soit à partir d'une console virtuelle à la connexion, soit à partir d'un gestionnaire d'affichage.\n\nPour une configuration headless, le pilote xf86-video-dummy est nécessaire ; installez-le et créez un fichier de configuration, tel que le suivant :\n\n```\n/etc/X11/xorg.conf.d/10-headless.conf\n```\n\n```\nSection \"Monitor\"\n        Identifier \"dummy_monitor\"\n        HorizSync 28.0-80.0\n        VertRefresh 48.0-75.0\n        Modeline \"1920x1080\" 172.80 1920 2040 2248 2576 1080 1081 1084 1118\nEndSection\n\nSection \"Device\"\n        Identifier \"dummy_card\"\n        VideoRam 256000\n        Driver \"dummy\"\nEndSection\n\nSection \"Screen\"\n        Identifier \"dummy_screen\"\n        Device \"dummy_card\"\n        Monitor \"dummy_monitor\"\n        SubSection \"Display\"\n        EndSubSection\nEndSection\n```\n\n"
    },
    {
      "title": "Moniteurs multiples",
      "level": 3,
      "content": "Consultez l'article principal Multihead pour des informations générales.\n\nConsultez également les instructions spécifiques aux GPU :\n\n- NVIDIA (Français)#Multiple monitors\n- ATI#Multihead setup.\n\n"
    },
    {
      "title": "Plus d'une carte graphique",
      "level": 4,
      "content": "Vous devez définir le bon pilote à utiliser et mettre l'ID de bus de vos cartes graphiques (en notation décimale).\n\n```\nSection \"Device\"\n    Identifier             \"Screen0\"\n    Driver                 \"intel\"\n    BusID                  \"PCI:0:2:0\"\nEndSection\n\nSection \"Device\"\n    Identifier             \"Screen1\"\n    Driver                 \"nouveau\"\n    BusID                  \"PCI:1:0:0\"\nEndSection\n```\n\nPour obtenir vos identifiants de bus (en hexadécimal) :\n\n```\n$ lspci | grep -e VGA -e 3D\n```\n\n```\n00:02.0 VGA compatible controller: Intel Corporation HD Graphics 630 (rev 04)\n01:00.0 3D controller: NVIDIA Corporation GP107M [GeForce GTX 1050 Mobile] (rev a1)\n```\n\nLes ID de bus sont ici 0:2:0 et 1:0:0.\n\n"
    },
    {
      "title": "Taille de l'écran et DPI",
      "level": 3,
      "content": "Par défaut, Xorg définit toujours le DPI à 96 depuis 2009-01-30. Une modification a été apportée à la version 21.1 pour permettre une auto-détection correcte de la DPI, mais elle a été annulée.\n\nLe DPI du serveur X peut être définie avec l'option de ligne de commande -dpi.\n\nIl est utile d'avoir le bon DPI lorsque des détails fins sont nécessaires (comme le rendu des polices). Auparavant, les fabricants essayaient de créer une norme pour 96 DPI (un écran de 10,3 pouces de diagonale serait 800x600, un écran de 13,2 pouces 1024x768). De nos jours, les DPI des écrans varient et peuvent ne pas être égaux horizontalement et verticalement. Par exemple, un écran large LCD 19\" de 1440x900 peut avoir un DPI de 89x87.\n\nPour consulter si la taille de votre écran et le DPI sont correct :\n\n```\n$ xdpyinfo | grep -B2 resolution\n```\n\nVérifiez que les dimensions correspondent à la taille de votre écran.\n\nSi vous avez des spécifications sur la taille physique de l'écran, vous pouvez les entrer dans le fichier de configuration Xorg afin que le DPI approprié soit calculé (ajustez l'identifiant à votre sortie xrandr) :\n\n```\nSection \"Monitor\"\n    Identifier             \"DVI-D-0\"\n    DisplaySize             286 179    # In millimeters\nEndSection\n```\n\nSi vous voulez seulement entrer les spécifications de votre moniteur sans créer un xorg.conf complet, créez un nouveau fichier de configuration. Par exemple (/etc/X11/xorg.conf.d/90-monitor.conf) :\n\n```\nSection \"Monitor\"\n    Identifier             \"<default monitor>\"\n    DisplaySize            286 179    # In millimeters\nEndSection\n```\n\nSi vous ne disposez pas de spécifications pour la largeur et la hauteur physiques de l'écran (la plupart des spécifications actuelles ne mentionnent que la taille diagonale), vous pouvez utiliser la résolution native du moniteur (ou le rapport hauteur/largeur) et la longueur diagonale pour calculer les dimensions physiques horizontales et verticales. En utilisant le théorème de Pythagore sur un écran de 13,3 pouces de diagonale avec une résolution native de 1280x800 (ou un rapport d'aspect de 16:10) :\n\n```\n$ echo 'scale=5;sqrt(1280^2+800^2)'. | bc # 1509.43698\n```\n\nCela donnera la longueur diagonale du pixel et avec cette valeur vous pouvez découvrir les longueurs physiques horizontale et verticale (et les convertir en millimètres) :\n\n```\n$ echo 'scale=5 ;(13.3/1509)*1280*25.4'. | bc # 286.43072\n$ echo 'scale=5 ;(13.3/1509)*800*25.4'.  | bc # 179.01920\n```\n\n"
    },
    {
      "title": "Réglage manuel du DPI",
      "level": 4,
      "content": "Pour les pilotes compatibles avec RandR (par exemple le pilote open source ATI), vous pouvez le définir par :\n\n```\n$ xrandr --dpi 144\n```\n\nPour le rendre permanent, consultez Autostarting#On Xorg startup.\n\nVous pouvez définir manuellement le DPI en ajoutant l'option sous la section Device ou Screen :\n\n```\nOption \"DPI\" \"96 x 96\"\n```\n\nGTK remplace très souvent le DPI du serveur par la ressource X facultative Xft.dpi. Pour savoir si cela se produit dans votre cas, vérifiez avec :\n\n```\n$ xrdb -query | grep dpi\n```\n\nAvec les versions de la bibliothèque GTK depuis 3.16, lorsque cette variable n'est pas explicitement définie, GTK la définit à 96. Pour que les applications GTK obéissent au DPI du serveur, vous pouvez avoir besoin de définir explicitement Xft.dpi à la même valeur que le serveur. La ressource Xft.dpi est la méthode par laquelle certains environnements de bureau forcent optionnellement le DPI à une valeur particulière dans les paramètres personnels. Parmi ceux-ci figurent KDE et TDE.\n\n"
    },
    {
      "title": "Display Power Management Signaling",
      "level": 3,
      "content": "DPMS (Gestion de la puissance d'affichage) est une technologie qui permet d'économiser l'énergie des moniteurs lorsque l'ordinateur n'est pas utilisé. Vous pourrez ainsi faire en sorte que vos moniteurs se mettent automatiquement en veille après une période de temps prédéfinie.\n\n"
    },
    {
      "title": "Compositeur",
      "level": 2,
      "content": "L'extension Composite pour X permet de rendre un sous-arbre entier de la hiérarchie des fenêtres dans un tampon hors écran. Les applications peuvent alors prendre le contenu de ce tampon et faire ce qu'elles veulent. La mémoire tampon hors écran peut être automatiquement fusionnée avec la fenêtre parent, ou fusionnée par des programmes externes appelés gestionnaires de composition. Pour plus d'informations, consultez Wikipedia:fr:Compositeur (logiciel).\n\nCertains gestionnaires de fenêtres (par exemple Compiz, Enlightenment, KWin, Marco, Metacity, Muffin, Mutter, Xfwm) font la composition eux-mêmes. Pour les autres gestionnaires de fenêtres, un gestionnaire composite autonome peut être utilisé.\n\n"
    },
    {
      "title": "Liste des gestionnaires de composites",
      "level": 3,
      "content": "- Picom — Compositeur (un fork de Compton)\n\n- Xcompmgr — Compositeur d'effets de fenêtre\n\n- steamos-compositor-plus — Le compositeur de Valve, avec quelques modifications et corrections supplémentaires.\n\n"
    },
    {
      "title": "Automatisation",
      "level": 3,
      "content": "Cette section liste les utilitaires permettant d'automatiser les entrées clavier/souris et les opérations sur les fenêtres (comme le déplacement, le redimensionnement ou l'élévation).\n\nTable content:\nOutil | Paquet | Manuel | Saisie deKeysym | Opérationssur les fenêtres | Note\nxautomation | xautomation | xte(1) | Oui | Non | Contient également des outils de lecture d'écran. Ne peut pas simuler F13 et plus.\nxdo | xdo | xdo(1) | Non | Oui | Petit utilitaire X permettant d'effectuer des actions élémentaires sur les fenêtres.\nxdotool | xdotool | xdotool(1) | Oui | Oui | Très bogué et pas en développement actif, par exemple : interpréteur de ligne de commande cassé. [2] [3]\nxvkbd | xvkbdAUR | xvkbd(1) | Oui | Non | Clavier virtuel pour Xorg, possède également l'option -text pour l'envoi de caractères.\nAutoKey | autokey-qtAUR autokey-gtkAUR | documentation | Oui | Oui | Utilitaire de macro et de script puissant, de plus haut niveau, avec des interfaces Qt et Gtk.\n\nConsultez également Clipboard#Tools et un aperçu des outils d'automatisation de X.\n\n"
    },
    {
      "title": "Session X imbriquée",
      "level": 3,
      "content": "Pour exécuter une session imbriquée d'un autre environnement de bureau :\n\n```\n$ /usr/bin/Xnest :1 -geometry 1024x768+0+0 -ac -name Windowmaker & wmaker -display :1\n```\n\nCeci lancera une session Window Maker dans une fenêtre de 1024 par 768 dans votre session X actuelle.\n\nCeci nécessite l'installation du paquet xorg-server-xnest.\n\nUne façon plus moderne de faire une session X imbriquée est avec Xephyr.\n\n"
    },
    {
      "title": "Démarrer une application sans gestionnaire de fenêtres",
      "level": 3,
      "content": "Consultez xinit (Français)#Démarrer des applications sans gestionnaire de fenêtres.\n\n"
    },
    {
      "title": "Démarrer des programmes GUI à distance",
      "level": 3,
      "content": "Consultez l'article principal : OpenSSH (Français)#Déport d'affichage X11.\n\n"
    },
    {
      "title": "Désactivation et activation à la demande des sources d'entrée",
      "level": 3,
      "content": "Avec l'aide de xinput vous pouvez temporairement désactiver ou activer les sources d'entrée. Cela peut être utile, par exemple, sur les systèmes qui possèdent plus d'une souris, comme les ThinkPads, et vous préférez n'en utiliser qu'une seule pour éviter les clics de souris indésirables.\n\nInstallez le paquet xorg-xinput.\n\nTrouvez le nom ou l'ID du périphérique que vous voulez désactiver :\n\n```\n$ xinput\n```\n\nPar exemple, sur un Lenovo ThinkPad T500, la sortie ressemble à ceci :\n\n```\n$ xinput\n```\n\n```\n⎡ Virtual core pointer                          id=2    [master pointer  (3)]\n⎜   ↳ Virtual core XTEST pointer                id=4    [slave  pointer  (2)]\n⎜   ↳ TPPS/2 IBM TrackPoint                     id=11   [slave  pointer  (2)]\n⎜   ↳ SynPS/2 Synaptics TouchPad                id=10   [slave  pointer  (2)]\n⎣ Virtual core keyboard                         id=3    [master keyboard (2)]\n    ↳ Virtual core XTEST keyboard               id=5    [slave  keyboard (3)]\n    ↳ Power Button                              id=6    [slave  keyboard (3)]\n    ↳ Video Bus                                 id=7    [slave  keyboard (3)]\n    ↳ Sleep Button                              id=8    [slave  keyboard (3)]\n    ↳ AT Translated Set 2 keyboard              id=9    [slave  keyboard (3)]\n    ↳ ThinkPad Extra Buttons                    id=12   [slave  keyboard (3)]\n```\n\nDésactivez le périphérique avec xinput --disable device, où device est l'ID ou le nom du périphérique que vous souhaitez désactiver. Dans cet exemple, nous allons désactiver le Touchpad Synaptics, avec l'ID 10 :\n\n```\n$ xinput --disable 10\n```\n\nPour réactiver le périphérique, il suffit de lancer la commande inverse :\n\n```\n$ xinput --enable 10\n```\n\nAlternativement en utilisant le nom du périphérique, la commande pour désactiver le touchpad serait :\n\n```\n$ xinput --disable \"SynPS/2 Synaptics TouchPad\" (en anglais)\n```\n\n"
    },
    {
      "title": "Tuer une application avec un raccourci clavier",
      "level": 3,
      "content": "Exécutez le script suivant avec un raccourci clavier :\n\n```\n#!/bin/sh\nwindowFocus=$(xdotool getwindowfocus)\npid=$(xprop -id \"$windowFocus\" | grep PID)\nkill -9 \"$pid\"\n```\n\nDépendances : xorg-xprop, xdotool\n\nConsultez également #Tuer une application visuellement\n\n"
    },
    {
      "title": "Bloquer l'accès au TTY",
      "level": 3,
      "content": "Pour bloquer l'accès au tty lorsque vous êtes dans un X, ajoutez ce qui suit à xorg.conf :\n\n```\nSection \"ServerFlags\"\n    Option \"DontVTSwitch\" \"True\"\nEndSection\n```\n\nCeci peut être utilisé pour aider à restreindre l'accès à la ligne de commande sur un système accessible à des utilisateurs non fiables.\n\n"
    },
    {
      "title": "Empêcher un utilisateur de tuer X",
      "level": 3,
      "content": "Pour empêcher un utilisateur de tuer X lorsqu'il est en cours d'exécution, ajoutez ce qui suit à xorg.conf :\n\n```\nSection \"ServerFlags\"\n    Option \"DontZap\"      \"True\"\nEndSection\n```\n\n"
    },
    {
      "title": "Tuer une application visuellement",
      "level": 3,
      "content": "Lorsqu'une application se comporte mal ou est bloquée, au lieu d'utiliser kill ou killall depuis un terminal et de devoir trouver l'ID ou le nom du processus, xorg-xkill permet de cliquer sur ladite application pour fermer sa connexion au serveur X. De nombreuses applications existantes s'interrompent effectivement lorsque leur connexion au serveur X est fermée, mais certaines peuvent choisir de continuer.\n\n"
    },
    {
      "title": "Xorg sans root",
      "level": 3,
      "content": "Xorg peut s'exécuter avec les privilèges d'un utilisateur standard au lieu de ceux de root (ce qu'on appelle Xorg «rootless»). Il s'agit d'une amélioration significative de la sécurité par rapport à l'exécution en tant que root. Notez que certains gestionnaires d'affichage populaires ne prennent pas en charge Xorg «rootless» (par exemple LightDM ou XDM).\n\nVous pouvez vérifier sous quel utilisateur Xorg est exécuté avec ps -o user $(pgrep Xorg).\n\nConsultez également Xorg.wrap(1), systemd-logind(8), Systemd (Français)/User (Français)#Xorg comme service utilisateur systemd, Fedora:Changes/XorgWithoutRootRights et FS#41257.\n\n"
    },
    {
      "title": "Avec xinitrc",
      "level": 4,
      "content": "Pour configurer Xorg «rootless» en utilisant xinitrc :\n\n- Exécutez startx comme un sous-processus du shell de connexion ; exécutez startx directement et n'utilisez pas exec startx.\n- Assurez-vous que Xorg utilise le terminal virtuel pour lequel les permissions ont été définies, c'est à dire passées par logind dans $XDG_VTNR via .xserverrc.\n- Si vous utilisez certains pilotes d'affichage propriétaires, l'auto-détection du kernel mode setting échouera. Dans ce cas, vous devez définir needs_root_rights = no dans /etc/X11/Xwrapper.config.\n\n"
    },
    {
      "title": "Avec GDM",
      "level": 4,
      "content": "GDM exécutera Xorg sans privilèges root par défaut lorsque kernel mode setting est utilisé.\n\n"
    },
    {
      "title": "Redirection du journal de session",
      "level": 4,
      "content": "Lorsque Xorg est exécuté en mode sans root, les journaux Xorg sont enregistrés dans ~/.local/share/xorg/Xorg.log. Cependant, les sorties stdout et stderr de la session Xorg ne sont pas redirigées vers ce journal. Pour réactiver la redirection, démarrez Xorg avec le paramètre -keeptty et redirigez les sorties stdout et stderr vers un fichier :\n\n```\nstartx -- -keeptty >~/.xorg.log 2>&1\n```\n\nAlternativement, copiez /etc/X11/xinit/xserverrc dans ~/.xserverrc, et ajoutez -keeptty. Consultez [4].\n\n"
    },
    {
      "title": "Xorg en root",
      "level": 3,
      "content": "Comme expliqué ci-dessus, il y a des circonstances dans lesquelles Xorg sans root est utilisé par défaut. Si c'est le cas pour votre configuration, et que vous avez besoin d'exécuter Xorg en tant que root, vous pouvez configurer Xorg.wrap(1) pour exiger root :\n\n```\n/etc/X11/Xwrapper.config\n```\n\n```\nneeds_root_rights = yes\n```\n\n"
    },
    {
      "title": "Général",
      "level": 3,
      "content": "Si un problème survient, consultez le journal stocké soit dans /var/log/ ou, pour le système X «rootless» par défaut depuis la v1.16, dans ~/.local/share/xorg/. Les utilisateurs de GDM devraient consulter le journal de systemd. [5]\n\nLes fichiers journaux sont de la forme Xorg.n.log avec n étant le numéro d'affichage. Pour une machine mono-utilisateur avec la configuration par défaut, le journal applicable est fréquemment Xorg.0.log, mais autrement cela peut varier. Pour être sûr de choisir le bon fichier, il peut être utile de regarder l'horodatage du démarrage de la session du serveur X et la console à partir de laquelle elle a été lancée. Par exemple :\n\n```\n$ grep -e Log -e tty Xorg.0.log\n```\n\n```\n[    40.623] (==) Log file: \"/home/archuser/.local/share/xorg/Xorg.0.log\", Time: Thu Aug 28 12:36:44 2014\n[    40.704] (--) controlling tty is VT number 1, auto-enabling KeepTty\n```\n\n- Dans le fichier journal, soyez à l'affût de toute ligne commençant par (EE), qui représente des erreurs, et aussi (WW), qui sont des avertissements pouvant indiquer d'autres problèmes.\n- S'il existe un fichier .xinitrc vide dans votre $HOME, supprimez-le ou modifiez-le pour que X puisse démarrer correctement. Si vous ne le faites pas, X affichera un écran vide avec ce qui semble être des erreurs dans votre Xorg.0.log. En le supprimant simplement, vous obtiendrez un environnement X par défaut.\n- Si l'écran devient noir, vous pouvez toujours essayer de basculer vers une console virtuelle différente (par exemple Ctrl+Alt+F6), et vous connecter aveuglément en tant que root. Vous pouvez le faire en tapant root (appuyez sur Enter après l'avoir tapé) et en saisissant le mot de passe root (appuyez à nouveau sur Enter après l'avoir tapé).\n\n```\n# pkill -x X\n```\n\n```\n# reboot\n```\n\n- Vérifiez les pages spécifiques dans Category:Input devices si vous avez des problèmes avec le clavier, la souris, le touchpad, etc.\n- Recherchez les problèmes courants dans les articles de ATI, Intel et NVIDIA.\n\n"
    },
    {
      "title": "Écran noir, Aucun protocole spécifié, Ressource temporairement indisponible pour tous ou certains utilisateurs",
      "level": 3,
      "content": "X crée des fichiers de configuration et des fichiers temporaires dans le répertoire personnel de l'utilisateur actuel. Assurez-vous qu'il y a de l'espace disque disponible sur la partition où se trouve votre répertoire personnel. Malheureusement, le serveur X ne fournit pas d'informations plus évidentes sur le manque d'espace disque dans ce cas.\n\n"
    },
    {
      "title": "Les DRI avec des cartes Matrox ne fonctionnent plus",
      "level": 3,
      "content": "Si vous utilisez une carte Matrox et que DRI a cessé de fonctionner après la mise à jour vers Xorg, essayez d'ajouter la ligne :\n\n```\nOption \"OldDmaInit\" \"On\"\n```\n\nà la section Device qui référence la carte vidéo dans xorg.conf.\n\n"
    },
    {
      "title": "Problèmes de mode frame-buffer",
      "level": 3,
      "content": "X ne parvient pas à démarrer avec les messages de journal suivants :\n\n```\n(WW) Falling back to old probe method for fbdev\n(II) Loading sub module \"fbdevhw\"\n(II) LoadModule: \"fbdevhw\"\n(II) Loading /usr/lib/xorg/modules/linux//libfbdevhw.so\n(II) Module fbdevhw: vendor=\"X.Org Foundation\"\n       compiled for 1.6.1, module version=0.0.2\n       ABI class: X.Org Video Driver, version 5.0\n(II) FBDEV(1): using default device\n\nFatal server error:\nCannot run in framebuffer mode. Please specify busIDs for all framebuffer devices\n```\n\nPour corriger cela, désinstallez le paquet xf86-video-fbdev.\n\n"
    },
    {
      "title": "Le programme demande la police '(null)'",
      "level": 3,
      "content": "Message d'erreur : unable to load font `(null)'.\n\nCertains programmes ne fonctionnent qu'avec des polices bitmap. Deux paquets majeurs avec des polices bitmap sont disponibles, xorg-fonts-75dpi et xorg-fonts-100dpi. Vous n'avez pas besoin des deux ; un seul devrait suffire. Pour savoir lequel serait le meilleur dans votre cas, essayez xdpyinfo de xorg-xdpyinfo, comme ceci :\n\n```\n$ xdpyinfo | grep resolution\n```\n\net utilisez ce qui est le plus proche de la valeur indiquée.\n\n"
    },
    {
      "title": "Récupération : désactivation d'Xorg avant la connexion à l'interface graphique",
      "level": 3,
      "content": "Si Xorg est configuré pour démarrer automatiquement et que pour une raison quelconque vous devez l'empêcher de démarrer avant l'apparition du gestionnaire de connexion/affichage (si le système est mal configuré et que Xorg ne reconnaît pas votre souris ou votre clavier, par exemple), vous pouvez accomplir cette tâche avec deux méthodes.\n\n- Changer la cible par défaut en rescue.target. Consultez Systemd (Français)#Changer la cible par défaut pour le démarrage.\n- Si vous avez non seulement un système défectueux qui rend Xorg inutilisable, mais que vous avez également mis le temps d'attente du menu GRUB à zéro, ou que vous ne pouvez pas utiliser GRUB pour empêcher Xorg de démarrer, vous pouvez utiliser le live CD Arch Linux. Suivez le guide d'installation sur la façon de monter et de se connecter en chroot à l'Arch Linux installé. Vous pouvez aussi essayer de basculer vers un autre tty avec Ctrl+Alt + touche de fonction (généralement de F1 à F7 selon celle qui n'est pas utilisée par X), connectez-vous en tant que root et suivez les étapes ci-dessous.\n\nSelon la configuration, vous aurez besoin de faire une ou plusieurs de ces étapes :\n\n- Désactivez le gestionnaire d'affichage.\n- Désactiver le démarrage automatique de X.\n- Renommez le fichier ~/.xinitrc ou commentez la ligne exec qu'il contient.\n\n"
    },
    {
      "title": "Les clients X démarrés avec \"su\" échouent",
      "level": 3,
      "content": "Si vous obtenez Client is not authorized to connect to server, essayez d'ajouter la ligne :\n\n```\nsession optional pam_xauth.so\n```\n\nà /etc/pam.d/su et /etc/pam.d/su-l. pam_xauth définira alors correctement les variables d'environnement et gérera les clés xauth.\n\n"
    },
    {
      "title": "Le démarrage de X a échoué : Keyboard initialization failed",
      "level": 3,
      "content": "Si le système de fichiers (en particulier /tmp) est plein, startx échouera. /var/log/Xorg.0.log se terminera par :\n\n```\n(EE) Error compiling keymap (server-0)\n(EE) XKB: Could not compile keymap\n(EE) XKB: Failed to load keymap. Loading default keymap instead.\n(EE) Error compiling keymap (server-0)\n(EE) XKB: Could not compile keymap\nXKB: Failed to compile keymap\nKeyboard initialization failed. This could be a missing or incorrect setup of xkeyboard-config.\nFatal server error:\nFailed to activate core devices.\nPlease consult the The X.Org Foundation support at http://wiki.x.org\nfor help.\nPlease also check the log file at \"/var/log/Xorg.0.log\" for additional information.\n(II) AIGLX: Suspending AIGLX clients for VT switch\n```\n\nLibérez de l'espace sur le système de fichiers concerné et X démarrera.\n\n"
    },
    {
      "title": "Un écran vert lorsque vous essayez de regarder une vidéo",
      "level": 3,
      "content": "Votre profondeur de couleur est mal définie. Elle doit être de 24 au lieu de 16, par exemple.\n\n"
    },
    {
      "title": "Erreur de SocketCreateListener",
      "level": 3,
      "content": "Si X se termine avec le message d'erreur SocketCreateListener() failed, vous devez peut-être supprimer les fichiers de socket dans /tmp/.X11-unix. Cela peut se produire si vous avez précédemment lancé Xorg en tant que root (par exemple pour générer un xorg.conf).\n\n"
    },
    {
      "title": "Clé MIT-MAGIC-COOKIE-1 invalide lors de l'exécution d'un programme en tant que root",
      "level": 3,
      "content": "Cette erreur signifie que seul l'utilisateur actuel a accès au serveur X. La solution est de donner l'accès à root :\n\n```\n$ xhost +si:localuser:root\n```\n\nCette ligne peut également être utilisée pour donner l'accès à X à un utilisateur différent de root.\n\n"
    },
    {
      "title": "Xorg-server Fatal server error : (EE) AddScreen/ScreenInit",
      "level": 3,
      "content": "Si le serveur Xorg ne fonctionne pas de manière aléatoire et que dans le journal Xorg vous consultez :\n\n```\nsystemd-logind : failed to take device /dev/dri/card0 : Operation not permitted\n...\nAddScreen/ScreenInit failed for driver 0\n```\n\nAlors, ce problème peut être causé par le problème 13943 de systemd. Configurez le démarrage précoce de KMS.\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Xplain - Explication approfondie du système X Window.\n- Xorg(1)\n- xorg.conf(5)\n- Gentoo:Xorg/Guide#Configuration\n\n"
    }
  ]
}