{
  "title": "Xorg (Українська)/Keyboard configuration (Українська)",
  "url": "https://wiki.archlinux.org/title/Xorg_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)/Keyboard_configuration_(%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B0)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Повʼязані статті\n\n- X keyboard extension\n- Linux console/Keyboard configuration\n- Extra keyboard keys\n- Xorg (Українська)\n- Keyboard shortcuts\n\nУ цій статті мова йде про налаштування клавіатури для Xorg. Щоб дізнатись про складніші теми, на зразок модифікування розкладки чи перевизначення клавіш, прочитайте X keyboard extension та Extra keyboard keys відповідно.\n\nXorg сервер використовує X keyboard extension (Клавіатурне розширення X) (XKB) для визначення розкладок клавіатури. Також, можна використати xmodmap щоб отримати прямий доступ до внутрішньої таблиці кодів клавіш, проте її не варто використовувати для складних робіт. Окрім цього, можна використати localectl із systemd щоб визначити розкладку клавіатури як для Xorg, так і для віртуальної консолі.\n\n"
    },
    {
      "title": "Перегляд налаштувань клавіатури",
      "level": 2,
      "content": "Ви можете використати цю команду, щоб дізнатись, які налаштування XKB дійсні на даний момент:\n\n```\n$ setxkbmap -print -verbose 10\n```\n\n```\nSetting verbose level to 10\nlocale is C\nApplied rules from evdev:\nmodel:      evdev\nlayout:     us\noptions:    terminate:ctrl_alt_bksp\nTrying to build keymap using the following components:\nkeycodes:   evdev+aliases(qwerty)\ntypes:      complete\ncompat:     complete\nsymbols:    pc+us+inet(evdev)+terminate(ctrl_alt_bksp)\ngeometry:   pc(pc104)\nxkb_keymap {\n        xkb_keycodes  { include \"evdev+aliases(qwerty)\" };\n        xkb_types     { include \"complete\"      };\n        xkb_compat    { include \"complete\"      };\n        xkb_symbols   { include \"pc+us+inet(evdev)+terminate(ctrl_alt_bksp)\"    };\n        xkb_geometry  { include \"pc(pc104)\"     };\n};\n```\n\n"
    },
    {
      "title": "Сторонні допоміжні програми",
      "level": 3,
      "content": "Існують „неофіційні“ програми, які займаються виводом інформації про розкладку клавіатури.\n\n- xkb-switch-gitAUR:\n\n```\n$ xkb-switch\n```\n\n```\nus\n```\n\n- xkblayout-state-gitAUR:\n\n```\n$ xkblayout-state print \"%s\"\n```\n\n```\nde\n```\n\n"
    },
    {
      "title": "Вибір розкладки",
      "level": 2,
      "content": "Keyboard layout in Xorg can be set in multiple ways. Here is an explanation of used options:\n\n- XkbModel обирає модель клавіатури. Вона має вплив на роботу лише кількох додаткових клавіш, які може мати ваша клавіатура. У разі чого, завжди можна виставити значення pc104 або pc105. Але, наприклад, ноутбуки, зазвичай, мають додаткові клавіші, і щоб заставити їх робити, іноді, достатньо просто вказати правильну модель клавіатури.\n- XkbLayout обирає розкладку. Можна вказати декілька розкладок, через кому.\n- XkbVariant обирає конкретний різновид розкладки для XkbLayout. Наприклад, за замовчуванням sk (Словацька) використовує qwertz, але її можна явно змінити на qwerty, і так далі.\n- XkbOptions містить додаткові налаштування (через кому). Тут можна визначити: як перемикати розкладку, роботу світлодіодів, комбінації клавіш, тощо. У розділі #Широковживані параметри XKB наведені приклади.\n\nНазва розкладки — це, зазвичай, код країни із двох літер. Щоб побачити весь список моделей клавіатур, розкладок, їх підвидів та додаткових налаштувань, разом із коротким описом, відкрийте /usr/share/X11/xkb/rules/base.lst. Або ж, Ви можете скористатись цими командами, щоб отримати списки без описів:\n\n- localectl list-x11-keymap-models\n- localectl list-x11-keymap-layouts\n- localectl list-x11-keymap-variants [layout]\n- localectl list-x11-keymap-options\n\nОсь що робить приклад з наступного розділу: він визначає модель клавіатури як pc104, cz — як основну розкладку, us — як другорядну, використовує такий різновид розкладки us як dvorak, та дозволяє перемикати розкладки клавішами Win+Space. Дізнайтеся більше: xkeyboard-config(7).\n\n"
    },
    {
      "title": "Використання setxkbmap",
      "level": 3,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nЗміни, зроблені setxkbmap стосуються лише одного сеансу роботи X, їх можна зробити постійними в xinitrc або в xprofile. Цим ви перезапишете загальносистемні налаштування, задавання яких описане в розділі #Використання файлів налаштування X. Проте, налаштування сторонніх клавіатур усе одно не будуть зберігатись якщо не задати їх id в setxkbmap. Або ж якщо це основна клавіатура X сервера.\n\nВикористовується він ось так (див. setxkbmap(1)):\n\n```\n$ setxkbmap [-model xkb_model] [-layout xkb_layout] [-variant xkb_variant] [-option xkb_options]\n```\n\nЩоб просто поміняти розкладку (-layout — це ключ за замовчуванням):\n\n```\n$ setxkbmap xkb_layout\n```\n\nДля множинного налаштування:\n\n```\n$ setxkbmap -model pc104 -layout cz,us -variant ,dvorak -option grp:win_space_toggle\n```\n\n"
    },
    {
      "title": "Використання файлів налаштування X",
      "level": 3,
      "content": "Синтаксис файлів X пояснено в Xorg#Configuration. Вони задають параметри, які зберігаються після завершення роботи.\n\nПриклад такого файлу:\n\n```\n/etc/X11/xorg.conf.d/00-keyboard.conf\n```\n\n```\nSection \"InputClass\"\n        Identifier \"system-keyboard\"\n        MatchIsKeyboard \"on\"\n        Option \"XkbLayout\" \"cz,us\"\n        Option \"XkbModel\" \"pc104\"\n        Option \"XkbVariant\" \",dvorak\"\n        Option \"XkbOptions\" \"grp:win_space_toggle\"\nEndSection\n```\n\n"
    },
    {
      "title": "Використання localectl",
      "level": 4,
      "content": "Для зручності, можна використати localectl замість того, щоб вручну переписувати файли налаштувань X. Ця команда зберігає налаштування в /etc/X11/xorg.conf.d/00-keyboard.conf. Цей файл не потрібно міняти самотужки бо localectl перезапише його щойно ви її запустите.\n\nЇї можна викликати ось так:\n\n```\n# localectl [--no-convert] set-x11-keymap layout [model [variant [options]]]\n```\n\nЯкщо ви хочете задати model, variant чи options, вам потрібно задати всі перелічені поля, хоча ви можете їх пропустити вказавши пропуск \"\". Якщо ключ --no-convert не вказаний, то найбільш схожий до заданої клавіатури, варіант консольної клавіатури, буде використаний в налаштуваннях консолі в vconsole.conf. Дізнайтеся більше в localectl(1).\n\nСтворити /etc/X11/xorg.conf.d/00-keyboard.conf можна так:\n\n```\n# localectl --no-convert set-x11-keymap cz,us pc104 ,dvorak grp:win_space_toggle\n```\n\n"
    },
    {
      "title": "Зміна розкладки",
      "level": 3,
      "content": "Щоб мати змогу швидко змінювати розкладку, спершу, вкажіть всі ці розкладки (перша з них буде основною). А потім — клавішу (або комбінацію клавіш) якою вони будуть перемикатись. Наприклад, щоб перемикатись між англійською та шведською розкладками використовуючи клавішу CapsLock, передайте аргумент us,se до XkbLayout і grp:caps_toggle як аргумент до XkbOptions. В XkbLayout потрібно вказати стільки ж розкладок, скільки і їх різновидів у XkbVariant. А якщо ви хочете переключатись між різними видами однієї розкладки, вкажіть її двічі (de,de).\n\nЯкщо вам хочеться перемикати розкладки іншими клавішами окрім CapsLock, то доступні варіанти перелічені в /usr/share/X11/xkb/rules/base.lst, починаються на grp: і закінчуються на toggle. Щоб отримати повний список, запустіть команду:\n\n```\n$ grep \"grp:.*toggle\" /usr/share/X11/xkb/rules/base.lst\n```\n\nЗверніть увагу: параметр grp:alts_toggle не надійний і навряд чи коли його виправлять; виберіть щось інше!\n\n"
    },
    {
      "title": "Зупинка Xorg з Ctrl+Alt+Backspace",
      "level": 3,
      "content": "За замовчуванням, комбінація клавіш Ctrl+Alt+Backspace вимкнена. Ми можете увімкнути її передавши terminate:ctrl_alt_bksp в XkbOptions. Це також можна зробити прив'язавши до певної клавіші функцію Terminate_Server в xmodmap (який відмінить усі налаштування зроблені XkbOptions). Щоб ці способи спрацювали, параметр DontZap в ServerFlags повинен мати значення \"off\". Хоча, з версії R6.8.0 (2004 рік) [1] воно стоїть за замовчуванням.\n\n"
    },
    {
      "title": "Зміна місцями лівого Control і Caps Lock",
      "level": 3,
      "content": "Щоб поміняти Caps Lock з лівим Control, додайте ctrl:swapcaps до XkbOptions. Ця команда дасть вам список схожих параметрів з описами:\n\n```\n$ grep -E \"(ctrl|caps):\" /usr/share/X11/xkb/rules/base.lst\n```\n\n"
    },
    {
      "title": "Кнопки переміщення курсора",
      "level": 3,
      "content": "Кнопки переміщення курсора (ті що на цифровій клавіатурі а не на мишці), вимкнені за замовчуванням. Виправити це можна додавши keypad:pointerkeys до XkbOptions. Цим ви заставити комбінацію Shift+NumLock вмикати/вимикати кнопки переміщення курсора.\n\nБільше інформації є у статті X keyboard extension#Mouse control.\n\n"
    },
    {
      "title": "Налаштування клавіші compose",
      "level": 3,
      "content": "Хоч більшість клавіатур і не мають клавіші Compose, її функціонал можна назначити іншій клавіші.\n\nКлавіша Compose дозволяє вводити складні та рідковживані символи, які не передбачені розробником клавіатури, які не можна ввести з натиснутою AltGr. Вони вводяться почерговим натисненням групи клавіш, перша з яких — Compose. Наприклад: Compose ' e напише é, а Compose - - - напише „довге тире“: —.\n\nХоч деякі незвичайні клавіатури й мають клавішу Compose, зазвичай, використовують інші клавіші в якості неї. Наприклад, щоб клавіша Menu працювала як Compose використайте налаштування середовища стільниці, або передайте compose:menu до XkbOptions (чи setxkbmap: setxkbmap -option compose:menu). Дозволені заміни клавіш визначені в /usr/share/X11/xkb/rules/base.lst:\n\n```\n$ grep \"compose:\" /usr/share/X11/xkb/rules/base.lst\n```\n\nЯкщо потрібної вам клавіші немає в списку, скористайтесь xmodmap щоб перевизначити ту клавішу на Multi_key, яка працює як Compose (зверніть увагу: setxkbmap стирає зміни, зроблені xmodmap ).\n\n"
    },
    {
      "title": "Комбінації клавіш",
      "level": 4,
      "content": "Стандартні комбінації клавіш залежать від мови системи і зберігаються в /usr/share/X11/locale/використана_мова/Compose, де використана_мова це, наприклад, en_US.UTF-8.\n\nВи можете додати свої власні комбінації для compose, скопіювавши файл зі списком комбінацій в ~/.XCompose та зробивши допис до нього. Інакше, створіть пустий файл ~/.XCompose та додайте до нього загальний список командою include \"%L\", наприклад:\n\n```\n~/.XCompose\n```\n\n```\ninclude \"%L\"\n\n<Multi_key> <g> <a> : \"α\"\n<Multi_key> <g> <b> : \"β\"\n<Multi_key> <g> <g> : \"γ\"\n```\n\nКлавіша compose (названа <Multi_key> у файлі ~/.XCompose) з будь-яким із тисяч символів юнікоду, включно з тими, які знаходяться за межами базової багатомовної площини. Перегляньте сторінку посібника Compose(5), там описаний формат файлу XCompose.\n\nGTK не використовує XIM а тому не сприймає клавіші, визначені в ~/.XCompose. це можна виправити й заставити GTK використовувати XIM якщо додати export GTK_IM_MODULE=xim і/або export XMODIFIERS=\"@im=none\" до ~/.xprofile.\n\n"
    },
    {
      "title": "Символ валюти на іншій клавіші",
      "level": 3,
      "content": "Більшість європейських розкладок мають символ євро (€) намальований на клавіші 5. Щоб мати змогу вводити його через Alt+5, використайте lv3:lalt_switch та eurosign:5.\n\nТаким же чином можна використати знак рупії (₹) rupeesign:4.\n\n"
    },
    {
      "title": "Миттєва зміна стану при натисненні на Caps Lock",
      "level": 3,
      "content": "Ті, хто любить писати великі літери з Caps Lock'ом можуть стикатись із короткою затримкою при зміні стану Caps Lock, через що великими стануть дві чи більше літер (АЛе, ХОча, ЛІнукс). Так стається, бо Caps Lock вмикається миттєво, щойно клавіша натиснута, але вимикається лише коли вдруге натиснута клавіша буде відпущена. Така поведінка — це спадок друкарських машинок, в яких для набору великими літерами фізично затискались клавіші зміни регістру, і для того, щоб звільнити їх, потрібно було відпустити клавішу замка\n\nДеякі більш популярні операційні системи прибрали цю особливість або свідомо (бо вона може збивати з пантелику), або випадково, але все це питання смаку. На трекер Xserver'а приходила купа скарг на неполадки, так як на данай момент немає простого способу перевести систему, щоб вона працювала так, як інші ОС. Для всіх, хто хоче спробувати: скарги та здійснену роботу можна знайти на [2] й [3].\n\n"
    },
    {
      "title": "Спосіб обійти проблему",
      "level": 4,
      "content": "Спершу, вивантажте ваші налаштування клавіатури до файлу:\n\n```\n$ xkbcomp -xkb $DISPLAY xkbmap\n```\n\nУ файлі xkbmap, знайдіть розділ Caps Lock. Він починається з key <CAPS>:\n\n```\nkey <CAPS> {         [       Caps_Lock ] };\n```\n\nІ замініть увесь розділ на цей код:\n\n```\nkey <CAPS> {\n    repeat=no,\n    type[group1]=\"ALPHABETIC\",\n    symbols[group1]=[ Caps_Lock, Caps_Lock],\n    actions[group1]=[ LockMods(modifiers=Lock), Private(type=3,data[0]=1,data[1]=3,data[2]=3)]\n};\n```\n\nЗбережіть та перезавантажте налаштування клавіатури:\n\n```\n$ xkbcomp -w 0 xkbmap $DISPLAY\n```\n\nНалаштування не зберігаються після перезавантаження комп'ютера, тому вам варто зробити так, щоб вони запускались відразу кожного разу після початку роботи X.\n\n"
    },
    {
      "title": "Одноклавішні функції",
      "level": 2,
      "content": "Щоб назначити клавіші функцію, скористайтесь xcape. Для прикладу, можна зробити так, щоб CapsLock робив як Escape якщо натиснути його самого, але як Control якщо його зажати і натиснути на іншу клавішу. Спершу поставте заміну Control скориставшись setxkbmap як було вже сказано раніше, і та призначте клавіші функцію Escape з xcape:\n\n```\n$ xcape -e 'Caps_Lock=Escape'\n```\n\nВи можете призначити декілька функцій через кому: Caps_Lock=Escape;Shift_L=Escape.\n\nЯкщо ви триматимете клавішу довше встановленого проміжку часу (500мс за замовчуванням), xcape не оброблятиме натиск кнопки (вона вважатиметься затисненою).\n\n"
    },
    {
      "title": "Налагодження затримки друку",
      "level": 2,
      "content": "Затримка друку (typematic delay) визначає як довго (в мілісекундах) потрібно тримати кнопку щоб вона спрацювала повторно. Щойно це станеться, новий символ буде вводитись із частотою (в герцах) заданою темпом друку (typematic rate). Ці два параметри налагоджуються окремо для Xorg і для віртуальної консолі.\n\n"
    },
    {
      "title": "Використовуючи xset",
      "level": 3,
      "content": "Затримку і темп друку для запущеного X сервера можна задати з xset, деякі дії із сервером X можуть заставити його відмінити зміни й повернутись до звичайних налаштувань.\n\nВикористання:\n\n```\n$ xset r rate delay [rate]\n```\n\nЩоб виставити затримку 200мс і темп 30гц, скористайтесь командою (додайте її до xinitrc щоб зробити постійною):\n\n```\n$ xset r rate 200 30\n```\n\nЗапуск команди без заданих параметрів відкотить їх до стандартних: затримку до 660мс і темп — до 25гц:\n\n```\n$ xset r rate\n```\n\n"
    },
    {
      "title": "Використовуючи налаштування запуску X сервера",
      "level": 3,
      "content": "Надійніший спосіб задати затримку й темп друку — зробити їх звичайними налаштуваннями передавши бажані значення, як параметри, до сервера, на старті:\n\n- -ardelay мілісекунди - задає затримку автоповтору (проміжок часу в мілісекундах, який треба тримати клавішу щоб запустити автоповтор).\n- -arinterval мілісекунди - задає період автоповтору (проміжок часу в мілісекундах, який який проходить між введенням символу).\n\nУ посібнику Xserver(1) є список всіх параметрів запуску сервера X. Дізнайтесь, як передаються ці параметри у вашому менеджері входу.\n\n"
    },
    {
      "title": "Див. також",
      "level": 2,
      "content": "- Стаття про розширення XKB (заархівована на Wayback Machine)\n\n"
    }
  ]
}