{
  "title": "Xrandr (Português)",
  "url": "https://wiki.archlinux.org/title/Xrandr_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Xorg\n- Multihead\n\nO xrandr é um utilitário de configuração oficial para o RandR (Redimensionar e girar) a extensãoX Window System. Pode ser usado para definir o tamanho, orientação ou reflexo das saídas para uma tela. Para configurar vários monitores, consulte a página Multihead.\n\n"
    },
    {
      "title": "Instalação",
      "level": 2,
      "content": "Instale o pacote xorg-xrandr.\n\n"
    },
    {
      "title": "Front-ends gráficos",
      "level": 3,
      "content": "- ARandR — Fornece um front-end visual simples para XRandR. As posições relativas do monitor são mostradas graficamente e podem ser alteradas arrastando e soltando.\n\n- LXRandR — Resolução de tela e ferramenta de gerenciamento de monitores externos para LXDE.\n\n"
    },
    {
      "title": "Front-ends CLI",
      "level": 3,
      "content": "- xlayoutdisplay — Detecta e organiza exibições. Alças: estado da tampa do laptop, taxas de atualização mais altas disponíveis, cálculo e aplicação do DPI real. Melhor usado em .xinitrc, então pode ser chamado ao conectar/desconectar monitores ou fechar a tampa do laptop.\n\n"
    },
    {
      "title": "Configuração de teste",
      "level": 2,
      "content": "Quando executado sem qualquer opção, o xrandr mostra os nomes de diferentes saídas disponíveis no sistema (VGA-1, HDMI-1, etc.) e as resoluções disponíveis em cada um, com um * após a atual e um + após a preferida:\n\n```\nxrandr\n```\n\n```\nScreen 0: minimum 320 x 200, current 3200 x 1080, maximum 8192 x 8192\nVGA-1 disconnected (normal left inverted right x axis y axis)\nHDMI-1 connected primary 1920x1080+0+0 (normal left inverted right x axis y axis) 531mm x 299mm\n   1920x1080     59.93 +  60.00*   50.00    59.94  \n   1920x1080i    60.00    50.00    59.94  \n   1680x1050     59.88  \n…\n```\n\nVocê pode usar xrandr para definir uma resolução diferente (deve estar presente na lista acima) em alguma saída:\n\n```\n$ xrandr --output HDMI-1 --mode 1920x1080\n```\n\nQuando várias taxas de atualização estão presentes na lista, ela pode ser alterada pela a opção --rate, ao mesmo tempo ou de forma independente. Por exemplo:\n\n```\n$ xrandr --output HDMI-1 --mode 1920x1080 --rate 60\n```\n\nA opção --auto irá ligar a saída especificada se estiver desligada e definir a resolução preferida (máxima):\n\n```\n$ xrandr --output HDMI-1 --auto\n```\n\nÉ possível especificar várias saídas em um comando, por exemplo, desligar HDMI-1 e ligar HDMI-2 com resolução preferida:\n\n```\n$ xrandr --output HDMI-1 --off --output HDMI-2 --auto\n```\n\n- Alterações que você faz usando xrandr durará apenas na sessão atual.\n- xrandr tem muito mais recursos - veja xrandr(1) para detalhes.\n\n"
    },
    {
      "title": "Configuração",
      "level": 2,
      "content": "O xrandr é apenas uma interface simples para a extensão RandR e não possui arquivo de configuração. No entanto, existem várias maneiras de obter configuração persistente:\n\n1. A extensão RandR pode ser configurada via configuração do X, veja Multihead#RandR para detalhes. Este método fornece apenas configuração estática.\n1. Se você precisa de configuração dinâmica, você precisa executar o comando xrandr cada vez que o servidor X é iniciado. Veja na inicialização do Xorg para detalhes. Este método tem a desvantagem de ocorrer bastante tarde no processo de inicialização, portanto, não irá alterar a resolução do gerenciador de exibição se você usar um.\n1. Scripts personalizados chamando o xrandr pode ser vinculado a eventos (por exemplo, quando o monitor externo está conectado), veja udev ou acpid para detalhes. O #Scripts A seção fornece alguns scripts de exemplo que podem ser úteis para essa finalidade.\n\n"
    },
    {
      "title": "Alternar monitor externo",
      "level": 4,
      "content": "Este script alterna entre um monitor externo (especificado por $extern) e um monitor padrão (especificado por $intern), para que apenas um monitor esteja ativo por vez.\n\nO monitor padrão deve estar conectado ao executar o script, o que sempre é verdade para um laptop.\n\n```\n#!/bin/bash\nintern=LVDS1\nextern=VGA1\n\nif xrandr | grep \"$extern disconnected\"; then\n    xrandr --output \"$extern\" --off --output \"$intern\" --auto\nelse\n    xrandr --output \"$intern\" --off --output \"$extern\" --auto\nfi\n```\n\n"
    },
    {
      "title": "Alternar configurações automaticamente com autorandr",
      "level": 4,
      "content": "O pacote autorandr permite que você configure facilmente o xrandr \"profiles\" que será ativado automaticamente quando você conectar / desconectar monitores. O Autorandr é executado automaticamente sempre que um monitor é conectado ou desconectado graças a um hook do udev. Veja a homepage para exemplos de uso.\n\n"
    },
    {
      "title": "Gerenciar 2 monitores",
      "level": 4,
      "content": "O monsAUR é um script de shell compatível com POSIX para gerenciar rapidamente a exibição de 2 monitores.\n\nEle fornece modos bem conhecidos como computador, duplicar, estender e modo de projetor, bem como selecionar e posicionar um ou dois monitores entre aqueles conectados (para mais detalhes, veja mons).\n\n"
    },
    {
      "title": "Evite o travamento do X com xrasengan",
      "level": 4,
      "content": "Use esta solução alternativa para ligar as saídas conectadas que podem estar no modo suspenso e, portanto, mostradas como desconectadas, como costuma ser o caso de monitores DisplayPort:\n\n```\ndeclare -i count=2\ndeclare -i seconds=1\n\nwhile ((count)); do\n    xrandr >/dev/null\n    sleep $seconds\n    ((count--))\ndone\n```\n\nO xrasenganAUR é um wrapper xrandr com esta solução alternativa embutida.\n\n```\n$ xrasengan --force -on DisplayPort-0 -off HDMI-0\n```\n\nCom a opção --force, xrasengan irá atualizar o status de todas as saídas antes que HDMI-0 seja desligado, evitando uma falha do X se fossem as únicas saídas conectadas/ativas.\n\nPara forçar o recarregamento das configurações atuais, o xrasengan fornece uma opção --try-reload-active-layout, que usa --force e unxrandr do pacote arandr para montar a linha de comando:\n\n```\n$ xrasengan --try-reload-active-layout\n```\n\nIsso pode ser usado na unidade do systemd ou em um teclado para evitar tela em branco ao retomar os monitores DisplayPort da suspensão.\n\n"
    },
    {
      "title": "Configuração usando arandr",
      "level": 3,
      "content": "arandr can graphically arrange your monitors, change resolutions, and save a script to duplicate your setup. By default, if you \"Save As\" it will be saved in ~/.screenlayout/. These files can then be added to your ~/.profile. Sometimes problems arise from running the arandr script too soon after login.\n\nNote: **The factual accuracy of this article or section is disputed.** The factual accuracy of this article or section is disputed.\n\nThe factual accuracy of this article or section is disputed.\n\nEdit ~/.profile\n\n```\n$ sleep 3\n$ /home/<user>/.screenlayout/myLayout.sh\n```\n\n"
    },
    {
      "title": "Adicionando resoluções não detectadas",
      "level": 3,
      "content": "Devido a erros de hardware ou drivers, as resoluções corretas do seu monitor nem sempre podem ser detectadas pelo xrandr. Por exemplo, o bloco de dados EDID consultado no monitor pode estar incorreto. No entanto, podemos adicionar as resoluções desejadas ao xrandr. Além disso, este mesmo procedimento pode ser usado para adicionar taxas de atualização que você sabe que são suportadas, mas não habilitadas pelo seu driver.\n\nPrimeiro execute gtf ou cvt para obter o Modeline para a resolução que queremos:\n\n```\n$ cvt 1280 1024\n```\n\n```\n# 1280x1024 59.89 Hz (CVT 1.31M4) hsync: 63.67 kHz; pclk: 109.00 MHz\nModeline \"1280x1024_60.00\"  109.00  1280 1368 1496 1712  1024 1027 1034 1063 -hsync +vsync\n```\n\nNote: Você também pode encontrar linhas semelhantes para o driver de configuração de modo.\n\n```\n[    45.063] (II) intel(0): clock: 241.5 MHz   Image Size:  597 x 336 mm\n[    45.063] (II) intel(0): h_active: 2560  h_sync: 2600  h_sync_end 2632 h_blank_end 2720 h_border: 0\n[    45.063] (II) intel(0): v_active: 1440  v_sync: 1443  v_sync_end 1448 v_blanking: 1481 v_border: 0\n```\n\n```\nxrandr --newmode \"2560x1440\" 241.50 2560 2600 2632 2720 1440 1443 1448 1481 -hsync +vsync\n```\n\nVocê também pode encontrar linhas semelhantes para o driver de configuração de modo.\n\nEm seguida, criamos um novo modo xrandr. Observe que a palavra-chave Modeline precisa ser omitida.\n\n```\n$ xrandr --newmode \"1280x1024_60.00\"  109.00  1280 1368 1496 1712  1024 1027 1034 1063 -hsync +vsync\n```\n\n*/\n\nDepois de criá-lo, precisamos de uma etapa extra para adicionar este novo modo à nossa saída atual (VGA1). Usamos apenas o nome do modo, uma vez que os parâmetros foram configurados anteriormente.\n\n```\n$ xrandr --addmode VGA1 1280x1024_60.00\n```\n\nAgora mudamos a resolução da tela para a que acabamos de adicionar:\n\n```\n$ xrandr --output VGA1 --mode 1280x1024_60.00\n```\n\nObserve que essas configurações só têm efeito durante esta sessão.\n\nSe você não tiver certeza sobre a resolução que irá testar, você pode adicionar um sleep 5 e uma linha de comando de resolução segura a seguir, como esta:\n\n```\n$ xrandr --output VGA1 --mode 1280x1024_60.00 && sleep 5 && xrandr --newmode \"1024x768-safe\" 65.00 1024 1048 1184 1344 768 771 777 806 -HSync -VSync && xrandr --addmode VGA1 1024x768-safe && xrandr --output VGA1 --mode 1024x768-safe\n```\n\nAlém disso, mude VGA1 para corrigir o nome da saída.\n\n"
    },
    {
      "title": "A soma de verificação EDID é inválida",
      "level": 4,
      "content": "Se o método anterior resultar em um *ERROR* EDID checksum is invalid erro durante a inicialização, veja KMS#Forcing modes and EDID e [2].\n\nOu xrandr --addmode pode dar-lhe o erro X Error of failed request: BadMatch. Os usuários da NVIDIA devem ler NVIDIA/Troubleshooting#xrandr BadMatch. BadMatch pode indicar uma soma de verificação EDID inválida. Para verificar se este é o caso, execute o X no modo detalhado (por exemplo startx -- -logverbose 6) e verifique seu log do Xorg para mensagens sobre um EDID incorreto.\n\n"
    },
    {
      "title": "A resolução da tela volta após um piscar",
      "level": 4,
      "content": "Se você usa GNOME e seu monitor não tem um EDID, acima #Adicionando resoluções não detectadas pode não funcionar, com a tela piscando apenas uma vez, após xrandr --output.\n\nEdite o arquivo ~/.config/monitors.xml, ou exclua-o completamente e reinicie.\n\nIt is better explained in this article.\n\n"
    },
    {
      "title": "Adicionando resoluções não detectadas permanentemente",
      "level": 3,
      "content": "Assim que uma resolução adequada for encontrada usando o xrandr, o modo pode ser adicionado permanentemente criando uma entrada em /etc/X11/xorg.conf.d/:\n\n```\n/etc/X11/xorg.conf.d/10-monitor.conf\n```\n\n```\nSection \"Monitor\"\n    Identifier \"VGA1\"\n    Modeline \"1280x1024_60.00\"  109.00  1280 1368 1496 1712  1024 1027 1034 1063 -hsync +vsync\n    Option \"PreferredMode\" \"1280x1024_60.00\"\nEndSection\n\nSection \"Screen\"\n    Identifier \"Screen0\"\n    Monitor \"VGA1\"\n    DefaultDepth 24\n    SubSection \"Display\"\n        Modes \"1280x1024_60.00\"\n    EndSubSection\nEndSection\n\nSection \"Device\"\n    Identifier \"Device0\"\n    Driver \"intel\"\nEndSection\n```\n\nSubstituir intel com o driver certo, por exemplo: nvidia. Quando o servidor X for reiniciado, você poderá definir a nova resolução.\n\nSe isso não funcionar para você, tente remover as seções Tela e Dispositivo e apenas sair da seção monitor. [3]\n\n"
    },
    {
      "title": "Resolução menor do que o esperado",
      "level": 3,
      "content": "Se sua placa de vídeo for reconhecida, mas a resolução for menor do que o esperado, você pode tentar fazer isso.\n\nHistórico: Placa de vídeo ATI X1550 e dois monitores LCD DELL 2408 (até 1920x1200) e Samsung 206BW (até 1680x1050). No primeiro login após a instalação, o padrão de resolução é 1152x864. xrandr não lista nenhuma resolução superior a 1152x864. Você pode querer tentar editar /etc/X11/xorg.conf, adicionar uma seção sobre tela virtual, logout, login e ver se isso ajuda. Se não, então continue a ler.\n\nAlterar xorg.conf\n\n```\n/etc/X11/xorg.conf\n```\n\n```\nSection \"Screen\"\n        ...\n        SubSection \"Display\"\n                Virtual 3600 1200\n        EndSubSection\nEndSection\n```\n\nSobre os números: DELL à esquerda e Samsung à direita. Portanto, a largura virtual é a soma de ambas as larguras do LCD 3600 = 1920 + 1680; A altura então é calculada como o máximo deles, que é máximo (1200,1050) = 1200. Se você colocar um LCD acima do outro, use este cálculo: (max (largura1, largura2), altura1 + altura2).\n\n"
    },
    {
      "title": "Correção de resoluções de tv overscan através da propriedade underscan",
      "level": 3,
      "content": "Com uma TV de tela plana, w:overscan parece que a foto é \"ampliada\" então as bordas são cortadas.\n\nVerifique na sua TV se há um parâmetro a ser alterado. Caso contrário, verifique se a saída tem suporte para a propriedade underscan (xrandr --prop), em caso afirmativo, aplique um underscan e alterar os valores das bordas. O necessário underscan vborder e underscan hborder os valores podem ser diferentes para você, basta verificar e alterar para mais ou menos.\n\n```\n$ xrandr --output HDMI-0 --set underscan on --set \"underscan vborder\" 25 --set \"underscan hborder\" 40\n```\n\n"
    },
    {
      "title": "Correção de resoluções de tv overscan via --transform",
      "level": 3,
      "content": "Se o underscan não estiver disponível, outra solução está usando xrandr --transform a,b,c,d,e,f,g,h,i, que aplica uma matriz de transformação na saída. Veja a página de manual xrandr(1) § RandR_version_1.3_options para a explicação da transformação.\n\nPor exemplo, a transformação escalando coordenadas horizontais por 0.8, coordenadas verticais por 1.04 e mover a tela 35 pixels para a direita e 19 pixels para baixo é:\n\n```\n$ xrandr --output HDMI1 --transform 0.80,0,-35,0,1.04,-19,0,0,1\n```\n\n"
    },
    {
      "title": "Desativando monitor fantasma",
      "level": 3,
      "content": "Em alguns casos, um monitor inexistente pode ser detectado pelo sistema. Para desativá-lo, encontre o nome da saída fantasma, por exemplo: VGA1, e desligue-o com\n\n```\n$ xrandr --output VGA1 --off\n```\n\nPara tornar isso permanente, adicione o seguinte a uma entrada em /etc/X11/xorg.conf.d/:\n\n```\n/etc/X11/xorg.conf.d/10-monitor.conf\n```\n\n```\nSection \"Monitor\"\n    Identifier \"VGA1\"\n    Option \"Ignore\" \"true\"\nEndSection\n```\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- https://wiki.ubuntu.com/X/Config/Resolution\n- Debian Wiki - RandR 1.2 tutorial\n- Xorg RandR 1.2 on ThinkWiki\n- FAQVideoModes - more information about modelines\n\n"
    }
  ]
}