{
  "title": "XScreenSaver (Русский)",
  "url": "https://wiki.archlinux.org/title/XScreenSaver_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Display Power Management Signaling (Русский)\n- X resources (Русский)\n- Блокировка экрана\n- Список приложений/Безопасность#Блокировка экрана\n\nXScreenSaver — реализация хранителя экрана (заставки) и блокировки сеанса для X Window System.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет xscreensaver.\n\nПакет xscreensaver-arch-logoAUR предоставляет модифицированную версию с логотипом Arch Linux.\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Большинство опций настраиваются для каждого пользователя отдельно через графический интерфейс xscreensaver-settings. Эта программа записывает настройки в ~/.xscreensaver, отменяя любые ручные изменения этого файла. Глобальные параметры определены в /usr/share/X11/app-defaults/XScreenSaver.\n\nС версии 5.22 можно изменять настройки с помощью Xresources, в том числе тему.\n\n"
    },
    {
      "title": "Темы",
      "level": 3,
      "content": "С версии 6.0 XScreenSaver имеет несколько встроенных тем. Можно переключаться между ними через xscreensaver-settings или с помощью опции dialogTheme (dialogTheme: имятемы в ~/.xscreensaver или через X resources: xscreensaver-auth.dialogTheme: имятемы).\n\nВы можете изменять темы с помощью X resources. Пример ниже демонстрирует изменение некоторых цветов и шрифтов. Если вы выбрали тему отличную от стандартной, замените default на название выбранной вами темы в нижнем регистре или пропишите вопросительный знак (?), чтобы изменение повлияло все темы:\n\n```\n~/.Xresources\n```\n\n```\n! Шрифт для обычного текста.\n! Имена шрифтов не чувствительны к регистру.\n! Можно прописать список через запятую, чтобы задать fallback-шрифт.\nxscreensaver-auth.default.Dialog.bodyFont: times new roman 12, dejavu serif 12\n\n! Фоновый цвет окна. Цвета можно задавать с помощью имён.\nxscreensaver-auth.default.Dialog.background: black\n\n! Основной цвет текста. Цвета можно задавать также с помощью HEX-кода.\nxscreensaver-auth.default.Dialog.foreground: #ffffff\n```\n\nПосмотреть список всех доступных для изменения ресурсов можно в файле /usr/share/X11/app-defaults/XScreenSaver.\n\nНе забудьте перезагрузить файл ресурсов после изменения.\n\n"
    },
    {
      "title": "DPMS и затемнение экрана",
      "level": 3,
      "content": "XScreenSaver управляет затемнением экрана и энергосбережением дисплея (DPMS) независимо от самого X и переопределяет его. Чтобы настроить тайминги для затемнения экрана, режима ожидания, выключения дисплея и т.п., используйте xscreensaver-demo или отредактируйте файл конфигурации вручную, например, ~/.xscreensaver:\n\n```\ntimeout:\t1:00:00\ncycle:\t\t0:05:00\nlock:\t\tFalse\nlockTimeout:\t0:00:00\npasswdTimeout:\t0:00:30\nfade:\t\tTrue\nunfade:\t\tFalse\nfadeSeconds:\t0:00:03\nfadeTicks:\t20\ndpmsEnabled:\tTrue\ndpmsStandby:\t2:00:00\ndpmsSuspend:\t2:00:00\ndpmsOff:\t4:00:00\n```\n\nОтключить затемнение экрана и DPMS можно через xscreensaver-settings, выбрав в списке Режим пункт Disable Screen Saver.\n\n"
    },
    {
      "title": "Использование",
      "level": 2,
      "content": "В Xfce, LXDE и LXQt XScreenSaver запускается автоматически и дополнительные действия не требуются.\n\nВ KDE Plasma заставка и блокировка экрана реализуются через ksmserver, который будет конфликтовать с XScreenSaver. Чтобы отключить его, нужно включить запуск KDE через systemd и изменить пользовательский юнит plasma-ksmserver.service:\n\n```\n~/.config/systemd/user/plasma-ksmserver.service.d/override.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=/usr/bin/ksmserver --no-lockscreen\n```\n\nЗатем перелогиньтесь, и после этого XScreenSaver должен заработать нормально. Смотрите xscreensaver(1) § INSTALLING XSCREENSAVER ON KDE для более подробной информации.\n\nДля других сред смотрите статью Автозапуск.\n\nКогда демон XScreenSaver запущен, можно немедленно заблокировать экран с помощью следующей команды:\n\n```\n$ xscreensaver-command -lock\n```\n\n"
    },
    {
      "title": "Блокировка при переходе в ждущий режим",
      "level": 3,
      "content": "XScreenSaver имеет в своём составе утилиту xscreensaver-systemd, которая обрабатывает D-Bus сигнал PrepareForSleep от systemd и автоматически блокирует экран при переходе в ждущий или спящий режим. Она запускается автоматически вместе с xscreensaver, дополнительные действия не требуются. Смотрите xscreensaver-systemd(6) для более подробной информации.\n\nОднако она не обрабатывает другие сигналы systemd, например loginctl lock-session. Для их обработки используйте Power management#xss-lock. Укажите опцию --ignore-sleep, потому что события перехода в ждущий и спящий режим уже обрабатывает xscreensaver-systemd.\n\n```\n$ xss-lock --ignore-sleep -- xscreensaver-command -lock\n```\n\nВозможно, стоит выставить время перехода к чёрному в 0.\n\n"
    },
    {
      "title": "Переключение пользователя с экрана блокировки",
      "level": 3,
      "content": "По умолчанию кнопка New Login выполняет команду gdmflexiserver -ls для переключения пользователя. Это работает в GDM, но для других экранных менеджеров нужно прописать правильную команду в настройках.\n\nxscreensaver-settings сбрасывает ручные изменения файла ~/.xscreensaver, поэтому здесь используется ~/.Xresources.\n\n"
    },
    {
      "title": "LXDM",
      "level": 4,
      "content": "```\nxscreensaver-auth.default.*.newLoginCommand: lxdm -c USER_SWITCH\n```\n\n"
    },
    {
      "title": "LightDM",
      "level": 4,
      "content": "```\nxscreensaver-auth.default.*.newLoginCommand: dm-tool switch-to-greeter\n```\n\n"
    },
    {
      "title": "SDDM",
      "level": 4,
      "content": "SDDM не поддерживает переключение пользователей. [1] Вы можете попробовать вызвать метод SwitchToGreeter с помощью dbus-send, но это может работать некорректно.\n\n"
    },
    {
      "title": "Отключение во время просмотра видео",
      "level": 3,
      "content": "Начиная с версии 5.45, утилита xscreensaver-systemd реализует D-Bus интерфейс ScreenSaver. Она запускается автоматически вместе с xscreensaver, так что большинство приложений должны корректно отключать хранитель экрана без дополнительных настроек. Однако некоторые приложения не поддерживают D-Bus или используют другие интерфейсы.\n\n"
    },
    {
      "title": "mpv",
      "level": 4,
      "content": "По умолчанию mpv использует X11 Screen Saver extension (XSS). Он выключает заставку при запуске и включает её снова при выходе. Заставка также включается, когда проигрыватель приостанавлен. Поведение можно настроить в файле ~/.config/mpv/mpv.conf:\n\n```\nstop-screensaver = \"yes\"\n```\n\nЭто поддерживается не на всех видеовыходах и платформах. Если вы столкнулись с проблемами, попробуйте создать Lua-скрипт, который будет отключать заставку каждые полминуты:\n\n```\n~/.config/mpv/scripts/xscreensaver.lua\n```\n\n```\nlocal utils = require 'mp.utils'\nmp.add_periodic_timer(30, function()\n    utils.subprocess({args={\"xscreensaver-command\", \"-deactivate\"}})\nend)\n```\n\nСкрипт будет запускать указанную команду каждые полминуты.\n\n"
    },
    {
      "title": "mplayer",
      "level": 4,
      "content": "Добавьте в ~/.mplayer/config:\n\n```\nheartbeat-cmd=\"xscreensaver-command -deactivate >&- 2>&- &\"\n```\n\n"
    },
    {
      "title": "Kodi",
      "level": 4,
      "content": "Kodi не имеет встроенной поддержки XScreenSaver (он использует свой собственный хранитель экрана). Установите пакет kodi-prevent-xscreensaverAUR или используйте расширение OS Screen Saver Manager.\n\n"
    },
    {
      "title": "HTML5-видео в браузерах",
      "level": 4,
      "content": "Большинство браузеров (Chromium и основанные на нём, Firefox, GNOME Web, Otter Browser и т.д.) поддерживают интерфейс D-Bus ScreenSaver и должны нормально отключать хранитель экрана при воспроизведении HTML5-видео.\n\n"
    },
    {
      "title": "Другие приложения",
      "level": 4,
      "content": "Если вы используете приложения, которые не умеют отключать хранитель эрана, можно попробовать использовать скрипт lightsonplus, который отключает хранитель экрана, когда обнаруживает полноэкранное видео. Некоторые приложения (totem, Steam и другие) поддерживаются из коробки, нужно лишь включить их обнаружение в скрипте lightson+. Если используемое вами приложение не поддерживается, но имеет постоянное имя окна, можно прописать его в переменной window_name.\n\n"
    },
    {
      "title": "Анимированный фон",
      "level": 3,
      "content": "Можно поставить заставку на фон рабочего стола. Для этого сперва завершите все процессы, которые контролируют фон (корневое окно), а затем найдите исполняемый файл нужной вам заставки (они обычно лежат в /usr/lib/xscreensaver/) и запустите с опцией -root, например:\n\n```\n$ /usr/lib/xscreensaver/glslideshow -root &\n```\n\n```\n$ xwinwrap -b -fs -sp -nf -ov -- /usr/lib/xscreensaver/glslideshow -root -window-id WID &\n```\n\n"
    },
    {
      "title": "Решение проблем",
      "level": 2,
      "content": "Для вывода более подробного журнала запустите xscreensaver с опцией --verbose. Также можно добавить verbose: True в файл ~/.xscreensaver, чтобы сделать это постоянным.\n\nДля записи журнала в файл можно указать путь к файлу с помощью опции --log. Использование этой опции автоматически включает подробный вывод. (Эквивалента данной опции в файле ~/.xscreensaver или ресурсах X нет.)\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Сайт XScreenSaver\n\n"
    }
  ]
}