{
  "title": "XScreenSaver (Español)",
  "url": "https://wiki.archlinux.org/title/XScreenSaver_(Espa%C3%B1ol)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- Display Power Management Signaling#Xorg\n- Xresources\n- Session lock\n- List of applications/Security#Screen lockers\n\nXScreenSaver is a screen saver and screen locker with graphical effects. The X Window System has functional screen-saving (in the power management sense) by default.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the xscreensaver package.\n\nFor an Arch Linux branded experience, install the xscreensaver-arch-logoAUR package.\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "Most options are configured on a user-by-user basis by running xscreensaver-settings. xscreensaver-settings writes the chosen configuration to ~/.xscreensaver, discarding any manual modifications to the file. Global options are defined in /usr/lib/X11/app-defaults/XScreenSaver.\n\nSince at least XScreenSaver 5.22, there is another way to edit XScreenSaver's user configuration, using X resources.\n\n"
    },
    {
      "title": "Theming",
      "level": 3,
      "content": "Starting from version 6.0, XScreenSaver comes with several pre-installed themes. You can select a theme using xscreensaver-settings or by changing the dialogTheme option (dialogTheme: themename in ~/.xscreensaver or using X resources: xscreensaver-auth.dialogTheme: themename).\n\nYou can customize themes using X resources. The example below demonstrates changing some colors and fonts. If you are using a non-default theme, replace default with the name of your chosen theme in lower case, or use question mark (?) to affect all themes:\n\n```\n~/.Xresources\n```\n\n```\n! Font for regular texts.\n! Font names are case-insensitive.\n! You can use a comma-separated list of fonts to set a fallback font.\nxscreensaver-auth.default.Dialog.bodyFont: times new roman 12, dejavu serif 12\n\n! Window background color. You can use color names.\nxscreensaver-auth.default.Dialog.background: black\n\n! Main text color. You can also use HEX color codes.\nxscreensaver-auth.default.Dialog.foreground: #ffffff\n```\n\nYou can view a list of the available X resources in /usr/lib/X11/app-defaults/XScreenSaver.\n\nDo not forget to reload the resource file after changes.\n\n"
    },
    {
      "title": "DPMS and blanking settings",
      "level": 3,
      "content": "Note: **This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.** This article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nThis article or section needs language, wiki syntax or style improvements. See Help:Style for reference.\n\nXScreenSaver manages screen blanking and display energy saving (DPMS) independently of X itself and overrides it. To configure the timings for blanking, standby, display poweroff and such, use xscreensaver-demo or edit the configuration file manually, e.g. ~/.xscreensaver:\n\n```\ntimeout:\t1:00:00\ncycle:\t\t0:05:00\nlock:\t\tFalse\nlockTimeout:\t0:00:00\npasswdTimeout:\t0:00:30\nfade:\t\tTrue\nunfade:\t\tFalse\nfadeSeconds:\t0:00:03\ndpmsEnabled:\tTrue\ndpmsStandby:\t2:00:00\ndpmsSuspend:\t2:00:00\ndpmsOff:\t4:00:00\n```\n\nDPMS and screen blanking can be disabled by starting xscreensaver-demo and, for the Mode setting, choosing Disable Screen Saver.\n\n"
    },
    {
      "title": "Usage",
      "level": 2,
      "content": "In the LXDE and LXQt environments, XScreenSaver is autostarted automatically if it is available - no further action is required.\n\nFor other environments, see Autostarting.\n\nIn KDE Plasma, screen saver and locker features are handled by ksmserver, which conflicts with XScreenSaver. To disable it, edit the plasma-ksmserver.service user unit:\n\n```\n~/.config/systemd/user/plasma-ksmserver.service.d/override.conf\n```\n\n```\n[Service]\nExecStart=\nExecStart=/usr/bin/ksmserver --no-lockscreen\n```\n\nAlso open KDE System Settings and disable Power Management > Turn off screen.\n\nThen logout and login again, and XScreenSaver should work properly now. See xscreensaver(1) § INSTALLING XSCREENSAVER ON KDE for more information.\n\nTo immediately trigger xscreensaver, if it is running, and lock the screen, execute the following command:\n\n```\n$ xscreensaver-command -lock\n```\n\n"
    },
    {
      "title": "Lock on suspend",
      "level": 3,
      "content": "XScreenSaver ships with a small utility named xscreensaver-systemd, which handles signals from systemd using D-Bus and automatically locks the screen on suspend and hibernate. It is started automatically with xscreensaver, no further action required. See xscreensaver-systemd(6) for more information.\n\n"
    },
    {
      "title": "User switching from the lock screen",
      "level": 3,
      "content": "By default, XScreenSaver's New Login button in the lock screen will call gdmflexiserver -ls to switch users. Display managers other than GDM that support user switching require a different command.\n\nAs modifications in ~/.xscreensaver are discarded by xscreensaver-settings, ~/.Xresources is used in this section.\n\n"
    },
    {
      "title": "LXDM",
      "level": 4,
      "content": "To use LXDM's switching mode:\n\n```\nxscreensaver-auth.default.*.newLoginCommand: lxdm -c USER_SWITCH\n```\n\n"
    },
    {
      "title": "LightDM",
      "level": 4,
      "content": "To use LightDM's switching mode:\n\n```\nxscreensaver-auth.default.*.newLoginCommand: dm-tool switch-to-greeter\n```\n\n"
    },
    {
      "title": "SDDM",
      "level": 4,
      "content": "SDDM does not support user switching. [1] You can try to call the SwitchToGreeter method using dbus-send, but it may not work properly.\n\n"
    },
    {
      "title": "Disable during media playback",
      "level": 3,
      "content": "Starting from version 5.45, the xscreensaver-systemd utility implements the D-Bus ScreenSaver interface. It is started automatically with xscreensaver, so most applications should properly disable the screensaver without additional configuration. However, some applications do not support D-Bus or use another interfaces.\n\n"
    },
    {
      "title": "mpv",
      "level": 4,
      "content": "By default mpv uses the X11 Screen Saver extension (XSS). It turns off the screensaver at startup and turns it on again on exit. The screensaver is always re-enabled when the player is paused. The option can be controlled in mpv's configuration file located in ~/.config/mpv/mpv.conf:\n\n```\nstop-screensaver = \"yes\"\n```\n\nThis is not supported on all video outputs or platforms. If you face some issues you might use a Lua script to manually disable the screensaver. Create a file at ~/.config/mpv/scripts/xscreensaver.lua with the following contents:\n\n```\nlocal utils = require 'mp.utils'\nmp.add_periodic_timer(30, function()\n    utils.subprocess({args={\"xscreensaver-command\", \"-deactivate\"}})\nend)\n```\n\nThe above script will call xscreensaver-command -deactivate every 30 seconds.\n\n"
    },
    {
      "title": "mplayer",
      "level": 4,
      "content": "Add the following to ~/.mplayer/config:\n\n```\nheartbeat-cmd=\"xscreensaver-command -deactivate >&- 2>&- &\"\n```\n\n"
    },
    {
      "title": "Kodi",
      "level": 4,
      "content": "Kodi has no native support to disable XScreenSaver (it uses its own screensaver). Install the kodi-prevent-xscreensaverAUR package as a workaround or try Kodi extension from https://sourceforge.net/projects/osscreensavermanager/.\n\n"
    },
    {
      "title": "Browser HTML5 video",
      "level": 4,
      "content": "Most browsers (Chromium and Chromium-based spin-offs, Firefox, GNOME Web, Otter Browser etc.) support the D-Bus ScreenSaver interface and should disable the screensaver during HTML5 video playback.\n\n"
    },
    {
      "title": "Other applications",
      "level": 4,
      "content": "If you are using applications that do not disable the screensaver, you can try a script named lightsonplus, which disables the screensaver when a fullscreen video is detected. Some applications (such as totem, Steam and others) are supported out of the box, you just need to enable their detection in the lightson+ script. If your application is unsupported but has a permanent window name, you can set it in the window_name variable.\n\n"
    },
    {
      "title": "Animated wallpaper",
      "level": 3,
      "content": "One can run xscreensaver in the background, just like a wallpaper. First, kill any process that is controlling the background (the root window).\n\nThen, locate the desired XScreenSaver executable (typically in /usr/lib/xscreensaver/) and run it with the -root flag, for example:\n\n```\n$ /usr/lib/xscreensaver/glslideshow -root &\n```\n\n```\n$ xwinwrap -b -fs -sp -nf -ov -- /usr/lib/xscreensaver/glslideshow -root -window-id WID &\n```\n\n"
    },
    {
      "title": "Troubleshooting",
      "level": 2,
      "content": "To log verbose debugging information, start xscreensaver with the --verbose command line option. You can also add verbose: True to the ~/.xscreensaver file to make it persistent.\n\nTo save the log to a file, you can set the path using the --log option. Using this option also implies verbose output. (There is no equivalent option in ~/.xscreensaver or X resources).\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Homepage for XScreenSaver\n\n"
    }
  ]
}