{
  "title": "Xterm (Русский)",
  "url": "https://wiki.archlinux.org/title/Xterm_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "xterm — стандартный эмулятор терминала для системы окон X. Он широко настраиваемый и имеет множество полезных и необычных функций.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет xterm.\n\n"
    },
    {
      "title": "Настройка файла ресурсов",
      "level": 3,
      "content": "Есть несколько опций, которые вы можете задать в файле Ресурсы Х, они помогут сделать этот эмулятор терминала гораздо проще в использовании. Смотрите полный список xterm(1).\n\n"
    },
    {
      "title": "Переменная окружения TERM",
      "level": 4,
      "content": "Разрешите xterm правильно сообщать о переменной TERM. Не устанавливайте переменную TERM из ~/.bashrc или ~/.bash_profile или похожего файла. Сам терминал должен сообщить правильную TERM в систему, чтобы использовать надлежащий terminfo. Два используемых имени terminfo - xterm and xterm-256color. Чтобы установить имя, используйте ресурс\n\n```\nXTerm.termName: xterm-256color\n```\n\nВы можете проверить результат в xterm с помощью любой из следующих команд:\n\n```\n$ echo $TERM\n$ tset -q\n```\n\n"
    },
    {
      "title": "UTF-8",
      "level": 4,
      "content": "Убедитесь, что ваша локаль настроена на UTF-8. Если вы не используете UTF-8, вам может понадобиться заставить xterm более строго следовать вашей локале, установив\n\n```\nXTerm.vt100.locale: true\n```\n\n"
    },
    {
      "title": "Клавиша «Alt» ведет себя как на других эмуляторах терминала",
      "level": 4,
      "content": "Поведение клавиши Alt по умолчанию в xterm является модификатором для отправки восьмибитных входных символов, например для вставки æ нажмите клавиши Alt+f. Чтобы вместо Alt отправить команду ^[ (escape) (как в gnome-terminal и konsole), установите\n\n```\nXTerm.vt100.metaSendsEscape: true\n```\n\n"
    },
    {
      "title": "Исправление клавиши 'Backspace'",
      "level": 4,
      "content": "На Arch Linux xterm отправляет ^H при нажатии клавиши 'Backspace'. Это разрывает комбинацию кнопок Ctrl+H на Emacs. Обходной путь заключается в том, чтобы отправить ^?, когда нажата клавиша backspace, задав ресурсы\n\n```\nXTerm.vt100.backarrowKey: false\nXTerm.ttyModes: erase ^?\n```\n\n"
    },
    {
      "title": "Привязка клавиш",
      "level": 4,
      "content": "xterm определяет целый набор \"действий\" для управления терминалом, например copy-selection(), hard-reset(), scroll-back()и т.д. Эти действия могут быть сопоставлены с мышкой/сочетаниями клавиш с помощью translations ресурса. Например, можно сопоставить клавиши Ctrl+M и Ctrl+R для развертывания/восстановления окна:\n\n```\nXTerm.vt100.translations: #override \\n\\\n    Ctrl <Key>M: maximize() \\n\\\n    Ctrl <Key>R: restore()\n```\n\n#override указывает на то, что эти привязки клавиш должны переопределить любые существующие (вы почти всегда хотите этого для пользовательских сочетаний клавиш). Каждая привязка должна быть отделена escape-последовательностью \\n. Если вы хотите вставить литеральную новую строку, она также должна быть escaped (следовательно \\n\\). Смотрите раздел KEY BINDINGS xterm(1) для полного списка действий и множество примеров.\n\n"
    },
    {
      "title": "Прокрутка",
      "level": 3,
      "content": "Когда новые строки записываются в нижней части окна xterm, старые строки исчезают сверху. Для прокрутки вверх и вниз по строкам можно использовать колёсико мыши, комбинации клавиш Shift+PageUp и Shift+PageDown, или полосу прокрутки.\n\nПо умолчанию сохраняется 1024 строки. Вы можете изменить сохраняемое количество строк ресурсом saveLines,\n\n```\nXTerm.vt100.saveLines: 4096\n```\n\nДругие ресурсы X, влияющие на прокрутку — jumpScroll, multiScroll и fastScroll (все в XTerm.vt100, см. xterm(1)). Для прокрутки внутри #альтернативного экрана установите параметру alternateScroll значение true.\n\n"
    },
    {
      "title": "Полоса прокрутки",
      "level": 4,
      "content": "Полоса прокрутки по умолчанию не отображается. Она может быть включена, а её внешний вид изменён настройками ресурсов (обратите внимание на различную капитализацию \"полосы прокрутки\"!)\n\n```\nXTerm.vt100.scrollBar: true\nXTerm.vt100.scrollbar.width: 8\n```\n\nСмотрите xterm(1) для получения информации о других ресурсах прокрутки.\n\nПолоса прокрутки управляется иначе, от того что вы может быть привыкли использовать\n\n- Для прокрутки вниз:\n\n- Для прокрутки вверх:\n\n- Чтобы разместить текст, двигаясь в любом направлении:\n\n"
    },
    {
      "title": "Меню",
      "level": 3,
      "content": "xterm компилируется с отключённым toolbar, или menubar. Меню по-прежнему доступно как всплывающие окна при нажатии сочетания клавиш Ctrl+MouseButton в окне xterm. Действия, вызываемые элементами меню, часто могут выполняться с использованием параметров командной строки или путем задания значений ресурсов.\n\n```\nXTerm.vt100.geometry: 80x32\n```\n\nНекоторые из опций меню обсуждаются ниже.\n\n"
    },
    {
      "title": "Главные опции меню",
      "level": 4,
      "content": "Ctrl + LeftMouse\n\n- Secure Keyboard пытается обеспечить, чтобы только окно xterm получало ваши нажатия, а никакие другие приложения. Дисплей переключается на обратное видео при его вызове. Если на дисплее нет обратного видео, режим Secure Keyboard не действует. Пожалуйста, прочитайте раздел \"БЕЗОПАСНОСТЬ\" man-страницы xterm для ограничений этого параметра.\n\n- Allow SendEvents позволяет другим процессам отправлять нажатия клавиш и события мыши в окно xterm. Из-за угрозы безопасности не включайте его, если вы не уверены, что знаете с этим параметром делать.\n\n- Log to File – Файл журнала будет иметь имя Xterm.log.hostname.yyyy.mm.dd.hh.mm.ss.XXXXXX. Этот файл будет содержать весь напечатанный вывод и все перемещения курсора. Ведение журнала может иметь риск для безопасности.\n\n- Шесть пунктов меню Send *** Signal не всегда полезны, за исключением, когда ваша клавиатура неисправна. HUP, TERM и KILL закроют окно xterm. KILL следует избегать, так как он не позволяет запускать код очистки.\n\n- Пункт меню Quit также закроет окно xterm - это то же самое, что и отправка сигнала HUP. Большинство пользователей будут использовать комбинацию клавиш Ctrl+d или наберут exit, чтобы закрыть экземпляр xterm.\n\n"
    },
    {
      "title": "Опции меню VT",
      "level": 4,
      "content": "Ctrl + MiddleMouse\n\n- Select to Clipboard – обычно выбранный текст сохраняется в PRIMARY, который должен быть вставлен с помощью Shift+Insert или с помощью средней кнопки мыши. Переключив эту опцию в on, выбранный текст будет использовать CLIPBOARD, позволяющий вставлять текст, выбранный в окне xterm, в приложение GUI с помощью Ctrl+v. Соответствующим ресурсом является XTerm.vt100.selectToClipboard.\n\n- Show Alternate Screen – когда вы используете приложение терминала, такое как vim, или less, открывается альтернативный экран. Главное окно VT, которое сейчас скрыто, остается в памяти. Вы можете просмотреть это главное окно, но не вызывать никаких команд в нем, переключив этот пункт меню. Вы можете выбрать и скопировать текст из этого главного окна.\n\n- Show Tek Window и Switch to Tek Mode – Tektronix 4014 был графическим терминалом 1970-х годов, используемым для САПР и построения приложений. Программа командной строки graph из plotutils и приложение gnuplot могут быть использованы для использования эмуляции Tek; большинство людей предпочтут более современные варианты отображения данных. Смотрите демонстрацию Tek 4014 ниже.\n\n"
    },
    {
      "title": "Шрифты меню VT",
      "level": 4,
      "content": "Ctrl + RightMouse\n\n- При использовании XLFD-шрифтов первые семь пунктов меню будут изменять шрифт и его размер, который используется в текущем окне xterm. Если вы используете шрифт Xft, изменится только размер шрифта, начертания шрифт не изменится с разными вариантами выбора.\n\n- Selection при использовании имен шрифтов XLFD позволяет переключиться на имя шрифта, сохраненное в выборе PRIMARY (или CLIPBOARD).\n\n"
    },
    {
      "title": "Опции меню Tek",
      "level": 4,
      "content": "Из окна Tek Window, Ctrl + MiddleMouse\n\nПараметры первого раздела позволяют изменять размер шрифта окна Tek. Второй набор опций используется для перемещения фокуса между окном эмуляции Tek и основным или VT, а также закрытием или скрытием окна Tek.\n\n"
    },
    {
      "title": "Копирование и вставка",
      "level": 3,
      "content": "Выделение текста выполняется с помощью мыши в xterm (или, как альтернатива, в другом приложении), сначала выберите текст для копирования, а затем нажмите среднюю кнопку мыши, чтобы вставить выделенный текст. Также комбинация клавиш Shift+Insert вставляет выделенный текст, но только внутри xterm\n\n"
    },
    {
      "title": "PRIMARY или CLIPBOARD",
      "level": 4,
      "content": "Note: **This article or section needs expansion.** This article or section needs expansion.\n\nThis article or section needs expansion.\n\nПо умолчанию xterm и многие другие приложения, использующие X, копируют выделенный текст в буфер, называемый PRIMARY-выделением. PRIMARY недолговечен — популярный текст сразу заменяется новым выбором PRIMARY, как только выделяется другой фрагмент текста. Некоторые приложения позволяют вставлять PRIMARY-выделения, используя среднюю кнопку мыши, но не Shift+Insert, а некоторые другие приложения могут полностью не вставлять содержимое буфера PRIMARY.\n\nСуществует ещё один буфер, используемый для скопированного текста, называемый CLIPBOARD выбор. Текст в CLIPBOARD долговечен, оставаясь доступным до тех пор, пока пользователь не перезапишет его. Приложения, использующие Ctrl+c и Ctrl+x для операций копирования и вырезания текста и Ctrl+v для вставки, используют CLIPBOARD.\n\nМимолетный характер PRIMARY выбора, где скопированный текст теряется, как только выделяется другой, раздражает некоторых пользователей. Xterm позволяет пользователю переключаться между использованием PRIMARY и CLIPBOARD с помощью Select to Clipboard в меню VT или с ресурсом XTerm.vt100.selectToClipboard.\n\n"
    },
    {
      "title": "PRIMARY и CLIPBOARD",
      "level": 4,
      "content": "С приведенной выше настройкой вы можете выбрать, хотите ли вы использовать PRIMARY или CLIPBOARD, но вы также можете взломать его, чтобы добавить выделение в оба. Просто отмените привязку клавиш для отпускания левой кнопки мыши:\n\n```\n<Btn1Up>: select-end(PRIMARY, CLIPBOARD, CUT_BUFFER0)\n```\n\nВы можете добавить привязки клавиш похожие на поведение копирования/вставки других терминалов (например, терминал gnome):\n\n```\nCtrl Shift <Key>C: copy-selection(CLIPBOARD) \\n\\\nCtrl Shift <Key>V: insert-selection(CLIPBOARD)\n```\n\n"
    },
    {
      "title": "Выбор текста",
      "level": 4,
      "content": "Новый пользователь обычно обнаруживает, что текст может быть выбран с помощью \"щелчка мышью и перетаскивания\" левой кнопки мыши. Двойным щелчком выбирается слово, в котором слово определяется как последовательные буквенные символы плюс символ подчеркивания или основное регулярное выражение (BRE) [A-Za-z_]. Трехкратное нажатие выбирает строку с символом \"tab\", который обычно копируется как несколько \"пробельных\" символов.\n\nДругой способ выбора текста, особенно полезный при копировании более одного полного экрана, заключается в следующем:\n\n1. Щелкните левой кнопкой мыши в начале предполагаемого выбора.\n1. Прокрутите список до тех пор, пока не будет выделен конец выделения.\n1. Щелкните правой кнопкой мыши в конце выделения.\n\nВы не обязаны сразу попасть в нужное вам место щелчком правой кнопки мыши - любой выделенный фрагмент может быть расширен или сокращен с помощью правой кнопки мыши.\n\nВы можете удалить любой выделенный текст, щелкнув левой кнопкой мыши один раз, в любом месте окна xterm.\n\nКогда в xterm запускается приложение на основе символов, ему разрешено принимать события мыши. Это может быть проблемой, если программа не может взаимодействовать с буфером обмена X11. Чтобы передать эти события в основной xterm, они должны сопровождаться клавишей Shift. Например, в links (не xlinks -g) можно щелкнуть среднюю кнопкой мыши по URL-адресам и пунктам меню, но при этом ничего не выбирется и не вставится. Чтобы скопировать, нажмите клавишу Shift, а затем выполните щелчки мыши (клавиша должна быть нажата только во время щелчка, поэтому нет необходимости удерживать ее при перетаскивании мыши, чтобы выбрать, например, текстовый блок).\n\n"
    },
    {
      "title": "Цвета",
      "level": 2,
      "content": "Xterm по умолчанию имеет черный текст, цвет переднего плана, на белом фоне. Цвета переднего плана и фона могут быть отменены путем установки ресурса\n\n```\nXTerm.vt100.reverseVideo: true\n```\n\nКроме того, вы можете напрямую изменять цвета переднего плана и фона (а также первые шестнадцать цветов терминала) с использованием ресурсов:\n\n```\nXTerm.vt100.foreground: white\nXTerm.vt100.background: black\nXTerm.vt100.color0: rgb:28/28/28\n! ...\nXTerm.vt100.color15: rgb:e4/e4/e4\n```\n\nNote: Некоторые цвета могут быть указаны назначенными именами. Если emacs или vim установлены, вы можете изучить /usr/share/emacs/*/etc/rgb.txt или /usr/share/vim/*/rgb.txt чтобы просмотреть список названий цветов с их десятичными значениями RGB. Цвета могут также указываться с использованием шестнадцатеричных значений RGB с форматом rgb:RR/GG/BB, или более старым и не поощряемым синтаксисом #RRGGBB.\n\nНекоторые цвета могут быть указаны назначенными именами. Если emacs или vim установлены, вы можете изучить /usr/share/emacs/*/etc/rgb.txt или /usr/share/vim/*/rgb.txt чтобы просмотреть список названий цветов с их десятичными значениями RGB. Цвета могут также указываться с использованием шестнадцатеричных значений RGB с форматом rgb:RR/GG/BB, или более старым и не поощряемым синтаксисом #RRGGBB.\n\nЦвет PapayaWhip совпадает с rgb:ff/ef/d5, который такой же, как и #ffefd5.\n\nМногие предложения по цветовым схемам можно просмотреть в разделе форума, Terminal Colour Scheme Screenshots.\n\n```\n*foreground: rgb:b2/b2/b2\n*background: rgb:08/08/08\n```\n\n"
    },
    {
      "title": "Стандартные шрифты",
      "level": 3,
      "content": "По умолчанию шрифт xterm - это шрифт растрового изображения, названный фиксированным псевдонимом X Logical Font Description, часто разрешающими\n\n```\n-misc-fixed-medium-r-semicondensed--13-120-75-75-c-60-iso8859-?\n```\n\nЭтот шрифт также псевдоним имени 6x13, имеет очень широкий охват символов Unicode. По умолчанию шрифт TrueType - это 14-точечный шрифт, сопоставляемый именем mono. С помощью этой команды можно найти шрифт FreeType , который будет использоваться:\n\n```\n$ fc-match mono\n```\n\nШрифты могут быть указаны в ваших ресурсах в зависимости от шрифта TrueType или нет:\n\n```\nXTerm.vt100.faceName: Liberation Mono:size=10:antialias=false\nXTerm.vt100.font: 7x13\n```\n\nЧтобы проверить, вы также можете установить шрифт в командной строке: -fa для faceName, -fn для font. Если вы устанавливаете оба типа шрифтов, вы можете чередовать их между собой двумя способами: TrueType Fonts из меню VT. Вы также можете выбрать значение по умолчанию со следующим ресурсом\n\n```\n! start with TrueType fonts disabled\nXTerm.vt100.renderFont: false\n```\n\n"
    },
    {
      "title": "Жирные и подчеркнутые шрифты",
      "level": 3,
      "content": "Курсивные шрифты отображаются как подчеркнутые символы при использовании имен XLFD в xterm. Шрифты TrueType должны использовать наклонный шрифт.\n\nЕсли вы не укажете жирный шрифт в командной строке -fb или через ресурс XTerm.vt100.boldFont, xterm попытается найти жирный шрифт, соответствующий нормальному шрифту. Если соответствующий шрифт не найден, жирный шрифт будет создан путем \"чрезмерного\" обычного шрифта.\n\n"
    },
    {
      "title": "Шрифты CJK",
      "level": 3,
      "content": "Многие шрифты не содержат глифов для двукратного китайского, японского и корейского языков. Другие эмуляторы терминала, такие как urxvt, могут лучше подходить, если вы часто работаете с этими языками.\n\nИспользование растровых XLFD-шрифтов с CJK несёт много ошибок в xterm. Гораздо проще использовать шрифты TrueType для отображения CJK, используя ресурс faceNameDoublesize. В этом примере используется DejaVu Sans Mono как обычный шрифт и WenQuanYi WenQuanYi Bitmap Song в качестве шрифта двойной ширины:\n\n```\nXTerm.vt100.faceName: DejaVu Sans Mono:style=Book:antialias=false\nXTerm.vt100.faceNameDoublesize: WenQuanYi WenQuanYi Bitmap Song\nXTerm.vt100.faceSize: 8\n```\n\n"
    },
    {
      "title": "Автоматическая прозрачность",
      "level": 3,
      "content": "Установите пакет transset-dfAUR и композитный менеджер, такой как Xcompmgr. Затем добавьте следующую строку в ~/.bashrc:\n\n```\n[ -n \"$XTERM_VERSION\" ] && transset-df --id \"$WINDOWID\" >/dev/null\n```\n\nТеперь, каждый раз, когда вы запускаете оболочку в xterm и запущен композитный менеджер, окно xterm будет прозрачным. Проверка перед transset-df запрещает выполнение transet, если параметр XTERM_VERSION не определен. Обратите внимание, что ваш терминал не будет прозрачным, если вы запускаете программу, отличную от оболочки. Вероятно, это можно обойти, если вы хотите использовать эту функциональность.\n\nСмотрите также прозрачность для каждого приложения.\n\n"
    },
    {
      "title": "Включение срочного звонка",
      "level": 3,
      "content": "Чтобы символ колокола уведомил оконный менеджер срочности, установите:\n\n```\nXTerm.vt100.bellIsUrgent: true\n```\n\n"
    },
    {
      "title": "Использование цвета вместо жирного и курсивного",
      "level": 4,
      "content": "При использовании небольших размеров шрифта, жирным шрифтом или курсивом возможно будет затруднительно читать. Одно из решений - отключить выделение жирным шрифтом, подчеркивание или курсив и использовать цвет вместо этого. Этот пример делает именно это:\n\n```\n! отключаем жирный шрифт и вместо него делаем текст синим.\nXTerm.vt100.colorBDMode: true\nXTerm.vt100.colorBD: rgb:82/a4/d3\n! отключаем подчеркнутый текст и вместо него делаем его белым.\nXTerm.vt100.colorULMode: true\nXTerm.vt100.colorUL: rgb:e4/e4/e4\n! аналогично использовать colorIT для курсива\n```\n\nСмотрите цвет для форматирования информации.\n\n"
    },
    {
      "title": "Настройка расстояния между строк",
      "level": 4,
      "content": "Строки текста иногда могут быть слишком близко находиться друг к другу, или они могут оказаться слишком далеко друг от друга. Например, используя DejaVu Sans Mono, низкий символ подчеркивания может приклеиваться к глифам CJK или курсорному блоку в строке ниже. Межстрочный интервал, называемый ведущим по типографам, может быть отрегулирован с помощью следующего ресурса, например, чтобы расширить интервал:\n\n```\nXTerm.scaleHeight: 1.01\n```\n\nДопустимые значения этого диапазона от 0.9 до 1.5, при этом 1.0 является значением по умолчанию.\n\n"
    },
    {
      "title": "Демонстрация Tek 4014",
      "level": 3,
      "content": "Если у вас установлен plotutils, вы можете использовать эмуляцию Tektronix 4014 для просмотра некоторых тестовых файлов пакета plotutils. Откройте окно Tek из пункта меню VT Switch to Tek Mode или запустите новый экземпляр xterm, используя следующую команду:\n\n```\n$ xterm -t -tn tek4014\n```\n\nВаш запрос PS1 не будет отображаться правильно, если он вообще появится. В новом окне введите команду,\n\n```\ncat /usr/share/tek2plot/dmerc.tek\n```\n\nВ окне Tek появится карта мира. Вы также можете просмотреть другие файлы *.tek из того же каталога. Чтобы закрыть окно Tek, вы можете использовать меню xterm.\n\n"
    },
    {
      "title": "Защита от отслеживания ввода X11",
      "level": 3,
      "content": "Возможно неудобно активировать режим Secure Keyboard из главного меню. Вместо этого вы можете вызвать действие secure() с помощью привязки клавиш:\n\n```\nCtrl Alt <Key>S: secure()\n```\n\n"
    },
    {
      "title": "Мерцание при прокрутке",
      "level": 3,
      "content": "Перестройте xterm с использованием ABS и включите флаг --enable-double-buffer:\n\n```\n./configure --prefix=/usr \\\n     ...\n     --with-utempter \\\n     --enable-double-buffer\n```\n\nПодробнее смотрите в Xterm изменениях.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Скрытые драгоценные камни Xterm\n- Комментарии ресурсов XTerm\n- Внедрение XTerm и настройка шрифтов TrueType\n\n"
    }
  ]
}