{
  "title": "Xterm (Français)",
  "url": "https://wiki.archlinux.org/title/Xterm_(Fran%C3%A7ais)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "xterm est l'émulateur de terminal standard pour X Window. Il est hautement configurable et propose de nombreuses options utiles ainsi que quelques fonctions moins usuelles.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Installez le paquet xterm.\n\n"
    },
    {
      "title": "Paramétrage par le fichier ressources",
      "level": 3,
      "content": "Il existe plusieurs options que vous pouvez définir dans vos fichiers de ressources X (en) qui peuvent rendre cet émulateur de terminal beaucoup plus agréable à utiliser. Consultez xterm(1) pour une liste complète.\n\n"
    },
    {
      "title": "Variable d'environnement TERM",
      "level": 4,
      "content": "Permettez à xterm de signaler correctement la variable TERM. Ne définissez pas la variable TERM à partir de votre fichier ~/.bashrc ou ~/.bash_profile ou d'un fichier similaire. Le terminal lui-même doit signaler le TERM correct au système afin que le fichier terminfo approprié soit utilisé. Les deux noms utilisables par terminfo sont xterm et xterm-256color. Pour définir le nom, utilisez la ressource\n\n```\nXTerm.termName : xterm-256color\n```\n\nVous pouvez vérifier le résultat dans xterm en utilisant l'une de ces commandes :\n\n```\n$ echo $TERM\n$ tset -q\n```\n\n"
    },
    {
      "title": "UTF-8",
      "level": 4,
      "content": "Assurez-vous que votre jeu de caractères codés local est bien UTF-8. Si vous n'utilisez pas UTF-8, vous devrez peut-être forcer xterm à suivre plus strictement vos paramètres linguistiques en définissant les paramètres suivants\n\n```\nXTerm.vt100.locale : true\n```\n\nPour forcer UTF-8, définissez\n\n```\nXTerm.vt100.locale : false\nXTerm.vt100.utf8 : true\n```\n\nCes paramètres peuvent se révéler nécessaire car XTerm ne prend pas en charge toutes les locales UTF-8, y compris eo.UTF-8.\n\n"
    },
    {
      "title": "Faire en sorte que la touche 'Alt' se comporte comme sur les autres émulateurs de terminal",
      "level": 4,
      "content": "Le comportement par défaut de la touche Alt dans xterm est un modificateur pour envoyer des caractères d'entrée de huit bits, par exemple pour insérer æ en appuyant sur Alt+f. Pour que Alt envoie plutôt une ^[ (échappement) (comme dans gnome-terminal et konsole), définissez le paramètre\n\n```\nXTerm.vt100.metaSendsEscape : true\n```\n\n"
    },
    {
      "title": "Correction de la touche 'retour arrière'",
      "level": 4,
      "content": "Sous Arch Linux, xterm envoie la touche ^H lorsque la touche de retour arrière est pressée. Ceci casse la combinaison de touches Ctrl+H sur Emacs. La solution consiste à envoyer ^? lorsque l'on appuie sur la touche d'espacement arrière en définissant les ressources suivantes\n\n```\nXTerm.vt100.backarrowKey : false\nXTerm.ttyModes : erase ^?\n```\n\n"
    },
    {
      "title": "Raccourcis clavier",
      "level": 4,
      "content": "xterm définit toute une série d'\"actions\" pour manipuler le terminal, par exemple copy-selection(), hard-reset(), scroll-back(), etc... Ces actions peuvent être associées à des combinaisons souris/touche à l'aide de la ressource translations. Par exemple, vous pouvez associer Ctrl+M et Ctrl+R pour agrandir/rétablir la fenêtre :\n\n```\nXTerm.vt100.translations : #override \\n\\\n    Ctrl <Key>M : maximize() \\n\n    Ctrl <Key>R : restore()\n```\n\n#override indique que ces raccourcis doivent remplacer celles qui existent déjà (c'est presque toujours ce que vous voulez pour les raccourcis clavier personnalisées). Chaque raccourci doit être séparée par la séquence d'échappement \\n. Si vous souhaitez insérer une nouvelle ligne littérale, celle-ci doit également être échappée (d'où la séquence \\n). Consultez la section KEY BINDINGS de xterm(1) pour la liste complète des actions et de nombreux exemples.\n\n"
    },
    {
      "title": "Défilement",
      "level": 3,
      "content": "Lorsque de nouvelles lignes sont écrites en bas d'une fenêtre xterm, les anciennes lignes disparaissent par le haut. Pour faire défiler le texte jusqu'aux lignes alors invisibles, il est possible d'utiliser la molette de la souris ou la combinaison de touches Shift+PageUp et Shift+PageDown, ou bien encore la barre de défilement.\n\nPar défaut, 1024 lignes sont sauvées. Vous pouvez modifier ce nombre grâce à saveLines:\n\n```\nXTerm.vt100.saveLines : 4096\n```\n\nLes autres ressources X qui affectent le défilement sont jumpScroll, multiScroll et fastScroll (toutes sous XTerm.vt100, consultez xterm(1)). Pour faire défiler les pages d'un autre élément, attribuez la valeur alternateScroll à true.\n\n"
    },
    {
      "title": "La barre de défilement",
      "level": 4,
      "content": "Par défaut, la barre de défilement n'est pas apparente. Elle peut être rendue visible et apparaître sur la gauche ou la droite de la fenêtre. Son apparence est configurable via le .Xresources (notez la différence de majuscule de \"scrollbar\" !).\n\n```\nXTerm.vt100.scrollBar : true\nXTerm.vt100.scrollbar.width : 8\n```\n\nConsultez xterm(1) pour d'autres ressources de barre de défilement.\n\nLa barre de défilement fonctionne différemment de ce que vous avez peut-être l'habitude d'utiliser.\n\n- Pour faire défiler vers le bas :\n\n- Pour faire défiler vers le haut :\n\n- Pour positionner le texte, en se déplaçant dans les deux sens :\n\n"
    },
    {
      "title": "Menus",
      "level": 3,
      "content": "xterm est compilé avec la barre d'outils ou la menubar désactivée. Les menus sont toujours disponibles sous forme de popups lorsque vous appuyez sur Ctrl+BoutonDeSouris dans la fenêtre xterm. Les actions invoquées par les éléments de menu peuvent souvent être réalisées à l'aide d'options de ligne de commande ou en définissant les valeurs des ressources.\n\n```\nXTerm.vt100.geometry: 80x32\n```\n\nCertaines des options de menu sont présentées ci-dessous.\n\n"
    },
    {
      "title": "Menu des options principales",
      "level": 4,
      "content": "Ctrl + Clic gauche\n\n- Secure Keyboard permet de s'assurer que seule la fenêtre xterm, et aucune autre application, reçoit vos frappes au clavier. L'affichage passe en vidéo inverse lorsqu'il est invoqué. Si l'affichage n'est pas en vidéo inverse, le mode Clavier sécurisé n'est pas en vigueur. Veuillez lire la section \"SECURITY\" de la page de manuel xterm pour connaître les limitations de cette option.\n\n- Allow SendEvents permet à d'autres processus d'envoyer des événements de pression sur le clavier et de souris à la fenêtre xterm. En raison du risque de sécurité, n'activez pas cette option à moins d'être sûr de savoir ce que vous faites.\n\n- Log to File (Journal dans un fichier) - Le fichier journal sera nommé Xterm.log.hostname.yyyy.mm.dd.hh.mm.ss.XXXXXX. Ce fichier contiendra toutes les sorties imprimées et tous les mouvements du curseur. La journalisation peut présenter un risque pour la sécurité.\n\n- Les six éléments du menu Send *** Signal ne sont pas souvent utiles, sauf en cas de défaillance de votre clavier. HUP, TERM et KILL ferment la fenêtre xterm. KILL est à éviter, car il ne permet pas l'exécution du code de nettoyage.\n\n- L'élément de menu Quit ferme également la fenêtre xterm - cela revient à envoyer un signal HUP. La plupart des utilisateurs utiliseront la combinaison clavier Ctrl+d ou taperont exit pour fermer une instance de xterm.\n\n"
    },
    {
      "title": "Menu des options du terminal virtuel",
      "level": 4,
      "content": "Ctrl + Souris centrale\n\n- Sélectionner dans le Presse-papiers - Normalement, le texte sélectionné est stocké dans PRIMARY, pour être collé avec Shift+Insert ou en utilisant le bouton central de la souris. En activant cette option, le texte sélectionné utilisera CLIPBOARD, ce qui vous permettra de coller le texte sélectionné dans une fenêtre xterm dans une application GUI en utilisant Ctrl+v. La ressource correspondante est XTerm.vt100.selectToClipboard.\n\n- Show Alternate Screen (Afficher un autre écran) - Lorsque vous utilisez une application de terminal telle que vim, ou less, l'écran alternatif est ouvert. La fenêtre principale de VT, maintenant cachée, reste en mémoire. Vous pouvez afficher cette fenêtre principale, mais pas y lancer de commandes, en activant cette option de menu. Vous pouvez sélectionner et copier du texte à partir de cette fenêtre principale.\n\n- Show Tek Window et Switch to Tek Mode (Afficher la fenêtre Tek et basculer en mode Tek) - Le Tektronix 4014 était un terminal graphique des années 1970 utilisé pour les applications de CAO et de traçage. Le programme de ligne de commande graph, de plotutils, et l'application gnuplot peuvent utiliser l'émulation Tek de xterm ; la plupart des gens préfèrent des options d'affichage plus modernes pour les données graphiques. Consultez la #Démonstration de Tek 4014, ci-dessous.\n\n"
    },
    {
      "title": "Menu des polices du terminal virtuel",
      "level": 4,
      "content": "Ctrl + Souris droite\n\n- Lorsque vous utilisez des polices XLFD, les sept premiers éléments du menu modifient le type et la taille de la police utilisée dans la fenêtre xterm actuelle. Si vous utilisez une police Xft, seule la taille de la police change, la police de caractères ne change pas avec les différentes sélections.\n\n- Selection, lors de l'utilisation de noms de polices XLFD, vous permet de passer au nom de police stocké dans la sélection PRIMARY (ou CLIPBOARD).\n\n"
    },
    {
      "title": "Menu des options Tek",
      "level": 4,
      "content": "A partir de la Tek Window, Ctrl + MiddleMouse\n\nLes options de la première section vous permettent de modifier la taille de la police de la fenêtre Tek. Le deuxième ensemble d'options est utilisé pour déplacer le focus entre la fenêtre d'émulation Tek et la fenêtre principale, ou VT, et pour fermer ou cacher la fenêtre Tek.\n\n"
    },
    {
      "title": "Copier-coller",
      "level": 3,
      "content": "Tout d'abord, le surlignement du texte à l'aide de la souris dans un xterm (ou alternativement dans une autre application) sélectionnera le texte à copier, puis un clic sur le bouton central de la souris collera le texte surligné. La combinaison de touches Shift+Insert permet également de coller le texte surligné.\n\n"
    },
    {
      "title": "PRIMARY ou CLIPBOARD",
      "level": 4,
      "content": "Par défaut, xterm, et de nombreuses autres applications fonctionnant sous X, copient le texte surligné dans un tampon appelé sélection PRIMARY (en). La sélection PRIMARY est éphémère ; le texte est immédiatement remplacé par une nouvelle sélection PRIMARY dès qu'un autre morceau de texte est surligné. Certaines applications vous permettent de coller des sélections PRIMARY en utilisant la souris centrale ou Shift+Insert, et d'autres applications peuvent ne pas autoriser le collage à partir de PRIMARY entièrement.\n\nIl existe un autre tampon utilisé pour le texte copié, appelé sélection CLIPBOARD. Le texte contenu dans le CLIPBOARD a une longue durée de vie et reste disponible jusqu'à ce que l'utilisateur l'écrase. Les applications qui utilisent Ctrl+c et Ctrl+x pour copier et couper du texte, et Ctrl+v pour le coller, utilisent le CLIPBOARD.\n\nLa nature fugace de la sélection PRIMARY, où le texte copié est perdu dès qu'une autre sélection est surlignée, agace certains utilisateurs. xterm permet à l'utilisateur de basculer entre l'utilisation de PRIMARY et de CLIPBOARD en utilisant Select to Clipboard dans le #Menu des options du terminal virtuel ou avec la ressource XTerm.vt100.selectToClipboard.\n\n"
    },
    {
      "title": "PRIMARY et CLIPBOARD",
      "level": 4,
      "content": "Avec le paramètre ci-dessus, vous pouvez choisir d'utiliser PRIMARY ou CLIPBOARD, mais vous pouvez aussi le modifier pour ajouter la sélection aux deux. Il suffit de remplacer le #Raccourcis clavier pour relâcher le bouton gauche de la souris :\n\n```\n<Btn1Up> : select-end(PRIMARY, CLIPBOARD, CUT_BUFFER0)\n```\n\nVous pouvez ajouter des #Raccourcis clavier similaires au comportement de copier/coller d'autres terminaux (comme le terminal gnome) :\n\n```\nCtrl Shift <Key>C : copier-sélection(CLIPBOARD) \\n\\\nCtrl Shift <Key>V : insérer-sélection(CLIPBOARD)\n```\n\n"
    },
    {
      "title": "Sélection de texte",
      "level": 4,
      "content": "Le nouvel utilisateur découvre généralement que le texte peut être sélectionné par un \"cliquer-glisser\" avec le bouton gauche de la souris. Un double-clic permet de sélectionner un mot, un mot étant défini comme des caractères alphabétiques consécutifs plus le trait de soulignement, ou l'expression régulière de base (BRE) [A-Za-z_]. Un triple-clic permet de sélectionner une ligne, le caractère \"tabulation\" étant généralement copié comme plusieurs caractères \"espace\".\n\nUne autre façon de sélectionner du texte, particulièrement utile lorsque vous copiez plus d'un écran complet, est la suivante :\n\n1. Cliquez avec le bouton gauche au début de la sélection souhaitée.\n1. Faites défiler jusqu'à ce que la fin de la sélection soit visible.\n1. Cliquez avec le bouton droit de la souris à la fin de la sélection.\n\nVous n'êtes pas obligé d'être précis immédiatement avec le clic droit - toute sélection surlignée peut être étendue ou raccourcie en utilisant un clic droit.\n\nVous pouvez effacer tout texte sélectionné en cliquant une fois avec le bouton gauche de la souris, n'importe où dans la fenêtre xterm.\n\nLorsqu'une application basée sur des caractères s'exécute dans xterm, elle est autorisée à recevoir des événements de souris. Cela peut poser un problème si le programme ne peut pas communiquer avec le presse-papiers X11. Afin de transmettre ces événements au xterm sous-jacent, ils doivent être accompagnés de la touche Shift. Par exemple, dans links (et non xlinks -g), on peut cliquer avec la souris sur les URL et les éléments de menu, mais pas sélectionner ou coller avec le bouton du milieu. Pour faire du copier-coller, il faut appuyer sur la touche Shift puis effectuer des clics de souris (la touche ne doit être enfoncée que pendant le clic, il n'est donc pas nécessaire de la maintenir enfoncée lorsqu'on fait glisser la souris pour sélectionner, par exemple, un bloc de texte).\n\n"
    },
    {
      "title": "Couleurs",
      "level": 2,
      "content": "Par défaut, xterm affiche du texte noir, la couleur de premier plan, sur un arrière-plan blanc. Les couleurs d'avant-plan et d'arrière-plan peuvent être inversées en configurant la ressource\n\n```\nXTerm.vt100.reverseVideo : true\n```\n\nVous pouvez également modifier directement les couleurs d'avant-plan et d'arrière-plan (ainsi que les seize premières couleurs du terminal) à l'aide de ressources :\n\n```\nXTerm.vt100.foreground : blanc\nXTerm.vt100.background : noir\nXTerm.vt100.color0: rgb:28/28/28\n! ...\nXTerm.vt100.color15 : rgb:e4/e4/e4\n```\n\nNote: Certaines couleurs peuvent être spécifiées par des noms attribués. Si emacs ou vim a été installé, vous pouvez examiner /usr/share/emacs/*/etc/rgb.txt ou /usr/share/vim/*/rgb.txt pour afficher la liste des noms de couleurs avec leurs valeurs RVB décimales. Les couleurs peuvent également être spécifiées en utilisant des valeurs RVB hexadécimales au format rgb:RR/GG/BB, ou la syntaxe plus ancienne et non encouragée #RRGGBB.\n\nCertaines couleurs peuvent être spécifiées par des noms attribués. Si emacs ou vim a été installé, vous pouvez examiner /usr/share/emacs/*/etc/rgb.txt ou /usr/share/vim/*/rgb.txt pour afficher la liste des noms de couleurs avec leurs valeurs RVB décimales. Les couleurs peuvent également être spécifiées en utilisant des valeurs RVB hexadécimales au format rgb:RR/GG/BB, ou la syntaxe plus ancienne et non encouragée #RRGGBB.\n\nLa couleur PapayaWhip est identique à rgb:ff/ef/d5, qui est identique à #ffefd5.\n\nDe nombreuses suggestions de thèmes de couleurs peuvent être consultées dans le fil de discussion du forum, Terminal Colour Scheme Screenshots (en).\n\n```\n*foreground : rgb:b2/b2/b2\n*background : rgb:08/08/08\n```\n\n"
    },
    {
      "title": "Polices par défaut",
      "level": 3,
      "content": "La police par défaut de xterm est la police bitmap nommée par l'alias fixed de X Logical Font Description (en), qui se résout souvent en\n\n```\n-misc-fixed-medium-r-semicondensed--13-120-75-75-c-60-iso8859-?\n```\n\nCette police, également aliasée sous le nom 6x13, a une couverture remarquablement large pour les glyphes unicode. La police \"TrueType\" par défaut est la police 14 points correspondant au nom mono. La police FreeType qui sera utilisée peut être trouvée avec cette commande :\n\n```\n$ fc-match mono\n```\n\nLes polices peuvent être spécifiées dans vos ressources, selon que la police est TrueType ou non :\n\n```\nXTerm.vt100.faceName : Liberation Mono:size=10:antialias=false\nXTerm.vt100.font : 7x13\n```\n\nPour tester, vous pouvez également définir la police sur la ligne de commande : -fa pour faceName, -fn pour font. Si vous définissez les deux types de polices, vous pouvez alterner entre les deux en activant TrueType Fonts dans le #Menu des polices du terminal virtuel. Vous pouvez également choisir la valeur par défaut avec la ressource suivante\n\n```\n! démarrer avec les polices TrueType désactivées\nXTerm.vt100.renderFont : false\n```\n\n"
    },
    {
      "title": "Polices en gras et soulignées",
      "level": 3,
      "content": "Les polices italiques sont affichées comme des caractères soulignés lors de l'utilisation des noms XLFD dans xterm. Les polices TrueType doivent utiliser une police oblique.\n\nSi vous ne spécifiez pas une police en gras sur la ligne de commande, -fb, ou par le biais de la ressource XTerm.vt100.boldFont, xterm tentera de trouver une police en gras correspondant à la police normale. Si une police correspondante n'est pas trouvée, la police en gras sera créée en \"surimprimant\" la police normale.\n\n"
    },
    {
      "title": "Polices CJK",
      "level": 3,
      "content": "De nombreuses polices ne contiennent pas de glyphes pour les langues chinoises, japonaises et coréennes à double largeur. D'autres émulateurs de terminal tels que urxvt peuvent être mieux adaptés si vous travaillez fréquemment avec ces langues.\n\nL'utilisation de polices XLFD bitmap avec le CJK présente de nombreux pièges dans xterm. Il est beaucoup plus facile d'utiliser des polices TrueType pour l'affichage CJK, en utilisant la ressource faceNameDoublesize. Cet exemple utilise DejaVu Sans Mono comme police normale et WenQuanYi WenQuanYi Bitmap Song comme police double largeur :\n\n```\nXTerm.vt100.faceName : DejaVu Sans Mono:style=Book:antialias=false\nXTerm.vt100.faceNameDoublesize : Chanson bitmap WenQuanYi WenQuanYi\nXTerm.vt100.faceSize : 8\n```\n\n"
    },
    {
      "title": "Transparence",
      "level": 3,
      "content": "Installez le paquet transset-dfAUR et un compositeur tel que Xcompmgr (en). Ajoutez ensuite la ligne suivante à votre ~/.bashrc:\n\n```\n[ -n \"$XTERM_VERSION\" ] && transset-df --id \"$WINDOWID\" >/dev/null\n```\n\nMaintenant, chaque fois que vous lancerez un shell dans un xterm et qu'un compositeur est en cours d'exécution, la fenêtre du xterm sera transparente. Le test devant transset-df l'empêche de s'exécuter si XTERM_VERSION n'est pas défini. Notez que votre terminal ne sera pas transparent si vous lancez un programme autre qu'un shell de cette manière. Il est probablement possible de contourner ce problème si vous souhaitez bénéficier de cette fonctionnalité. Consultez également la transparence par application (en)\n\n"
    },
    {
      "title": "Activer l'urgence pour le caractère \"cloche\"",
      "level": 3,
      "content": "Pour que le caractère cloche informe le gestionnaire de fenêtre de l'urgence, définissez :\n\n```\nXTerm.vt100.bellIsUrgent : true\n```\n\n"
    },
    {
      "title": "Utilisation de la couleur en lieu et place de l'italique et du gras",
      "level": 4,
      "content": "Lors de l'utilisation de petites tailles de police, les lettres en gras ou en italique peuvent être difficiles à lire. Une solution est de les transformer en couleur. Cet exemple fait justement cela :\n\n```\nForbid bold font faces; bold type is light blue.\nXTerm*colorBDMode: true\nXTerm*colorBD: rgb:82/a4/d3\n! Do not underscore text, underlined text is white.\nXTerm*colorULMode: true\nXTerm*colorUL: rgb:e4/e4/e4\n```\n\n"
    },
    {
      "title": "Ajuster l'espacement des lignes",
      "level": 4,
      "content": "Les lignes de texte peuvent parfois être trop rapprochées ou sembler trop espacées. Par exemple, avec DejaVu Sans Mono, le glyphe de soulignement bas peut buter contre les glyphes CJK ou le bloc du curseur dans la ligne du dessous. L'espacement des lignes, appelé leading par les typographes, peut être ajusté avec la ressource suivante, par exemple pour élargir l'espacement :\n\n```\nXTerm.vt100.scaleHeight : 1.01\n```\n\nLes valeurs valides vont de 0.9 à 1.5, 1.0 étant la valeur par défaut.\n\n"
    },
    {
      "title": "Démonstration de Tek 4014",
      "level": 3,
      "content": "Si vous avez installé plotutils, vous pouvez utiliser l'émulation Tektronix 4014 de xterm pour visualiser certains des fichiers de test du paquet plotutils. Ouvrez la fenêtre Tek à partir de l'élément du menu #Menu des options du terminal virtuel Switch to Tek Mode ou démarrez une nouvelle instance de xterm en utilisant cette commande :\n\n```\n$ xterm -t -tn tek4014\n```\n\nVotre invite PS1 ne s'affichera pas correctement, si tant est qu'elle apparaisse. Dans la nouvelle fenêtre, entrez la commande,\n\n```\ncat /usr/share/tek2plot/dmerc.tek\n```\n\nUne carte du monde apparaît dans la fenêtre Tek. Vous pouvez également visualiser d'autres fichiers *.tek de ce même répertoire. Pour fermer la fenêtre Tek, on peut utiliser les menus de xterm.\n\n"
    },
    {
      "title": "Protection contre le détournement des entrées X11",
      "level": 3,
      "content": "Il peut être difficile d'activer le mode Clavier sécurisé à partir du #Menu des options principales. Vous pouvez plutôt invoquer l'action secure() parmis les #Raccourcis clavier :\n\n```\nCtrl Alt <Key>S : secure()\n```\n\n"
    },
    {
      "title": "Scintillement lors du défilement",
      "level": 3,
      "content": "Reconstruisez xterm en utilisant Arch Build System et incluez l'indicateur --enable-double-buffer :\n\n```\n./configure --prefix=/usr \\\n     ...\n     --with-utempter \\\n     --enable-double-buffer\n```\n\nVoir Xterm modifications (en) pour plus de détails.\n\n"
    },
    {
      "title": "La configuration n'est pas appliquée",
      "level": 3,
      "content": "Certaines applications, telles que I3, appellent la surcouche uxterm au lieu de xterm. Ceci peut être résolu en ajoutant les mêmes configurations pour uxterm, telles que :\n\n```\nUXTerm.vt100.reverseVideo : true\n```\n\nSi vous préférez ne pas avoir d'entrées en double dans le fichier de configuration, vous pouvez utiliser des jokers :\n\n```\n*.vt100.reverseVideo : true\n```\n\n"
    },
    {
      "title": "Voir aussi",
      "level": 2,
      "content": "- Les joyaux cachés de Xterm\n- Ressources XTerm commentées.\n- Introduction à XTerm et configuration des polices TrueType.\n\n"
    }
  ]
}