{
  "title": "Yandex Disk (Русский)",
  "url": "https://wiki.archlinux.org/title/Yandex_Disk_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Яндекс.Диск — бесплатный облачный сервис от Яндекса, который позволяет синхронизировать фотографии, видео и документы между любыми устройствами, имеющими доступ в интернет. Официальный консольный клиент позволяет:\n\n- Синхронизировать файлы и папки на Диске\n- Настроить общий доступ к файлам и папкам через ссылки\n- Настроить синхронизацию\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет yandex-diskAUR. Официальный клиент не имеет графического интерфейса, но есть #Неофициальные клиенты.\n\nДля настройки прокcи, имени пользователя и локального каталога введите:\n\n```\n$ yandex-disk setup\n```\n\nПосле этого начнётся автоматическая синхронизация, и Яндекс.Диск будет готов к использованию.\n\n"
    },
    {
      "title": "Команды",
      "level": 2,
      "content": "Вы можете управлять Яндекс.Диском через файловый менеджер или консоль.\n\nПолный список команд для консоли доступен через man yandex-disk или\n\n```\n$ yandex-disk --help\n```\n\nНесколько примеров:\n\n- setup — запустить мастер первоначальной настройки.\n- start — запустить как демон и начать синхронизацию папки. В файл .sync/status записывается текущий статус синхронизации.\n- stop — остановить демон.\n- status — показать статус демона: статус синхронизации, ошибки, последние синхронизированные файлы, состояние дискового пространства. Если указан FILE, будет возвращен статус для этого файла.\n- token — получить OAuth токен, зашифровать и сохранить его в специальном файле (по умолчанию ~/.config/yandex-disk/passwd). Если не указаны опции -p пароль или --password пароль, то пароль будет прочитан из стандартного ввода.\n- sync — синхронизировать папку и завершить сеанс (если демон запущен, необходимо дождаться завершения синхронизации).\n- publish — сделать файл/папку публичной и вывести ссылку в STDOUT. Объект будет скопирован в папку для синхронизации. Для перезаписи существующих объектов используйте опцию --overwrite.\n- unpublish — удаление публичного доступа к файлу/папке.\n\n"
    },
    {
      "title": "Неофициальные клиенты",
      "level": 2,
      "content": "- eksterteraAUR — графический клиент, написанный с использованием Qt5.\n- yandex-disk-indicatorAUR и yandex-disk-indicator-gitAUR - индикатор для панели.\n- ydcmdAUR - консольный клиент, написанный на Python 3.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "https://help.yandex.ru/disk/cli-clients.xml\n\n"
    }
  ]
}