{
  "title": "Yggdrasil",
  "url": "https://wiki.archlinux.org/title/Yggdrasil",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Yggdrasil is an early-stage implementation of a fully end-to-end encrypted IPv6 network. It is lightweight, self-arranging, supported on multiple platforms, and allows pretty much any IPv6-capable application to communicate securely with other Yggdrasil nodes.\n\nThis article describes how to set up and use Yggdrasil.\n\n"
    },
    {
      "title": "Installation",
      "level": 2,
      "content": "Install the yggdrasil package.\n\n"
    },
    {
      "title": "Running",
      "level": 2,
      "content": "Start/enable yggdrasil.service.\n\nThis will create a tun network interface and make available two new IPv6 network interfaces. The important one starts with 200: which is what your machine will be known as in the Yggdrasil network. This IP address is using a reserved part of the IPv6 standard. This avoids any conflicts with the wider Internet.\n\nTo test this works you can run:\n\n```\n# yggdrasilctl getself\n```\n\n"
    },
    {
      "title": "Configuration",
      "level": 2,
      "content": "You can create default configuration file /etc/yggdrasil.conf by running yggdrasil-default-config.service, also it will be created and used by running yggdrasil.service first time. By default your Yggdrasil instance will not have any peers and thus you are running a standalone service. Editing the /etc/yggdrasil.conf file, which uses the JSON format, allows one to add peers and after restarting the service your node can both reach the wider network, as well as others can find your node.\n\nMore details about the configuration is available in the upstream documentation.\n\nTo peer with the wider network, start with the public-peers documentation.\n\n"
    },
    {
      "title": "Local firewall",
      "level": 2,
      "content": "In todays networking practices a common Linux installation is not exposed directly to the Internet. Only servers will typically have a public IP address. As a result our ssh or similar services are not able to be attacked by anyone and everyone.\n\nIt is important to realize that running Yggdrasil and peering it to the wider Yggdrasil network changes this. Services that listen on all network connections will become reachable by anyone that connects to this network. You might want configure them to not listen on the Yggdrasil network or quickly hide running services with a couple of firewall rules.\n\n```\n/etc/iptables/ip6tables.rules\n```\n\n```\n#yggdrasil\n*filter\n:INPUT ACCEPT [8:757]\n:FORWARD ACCEPT [0:0]\n:OUTPUT ACCEPT [5:463]\n-A INPUT -i tun0 -m conntrack --ctstate RELATED,ESTABLISHED -j ACCEPT\n-A INPUT -i tun0 -m conntrack --ctstate INVALID -j DROP\n-A INPUT -i tun0 -j DROP\nCOMMIT\n```\n\nStart/enable ip6tables.service to make this take effect.\n\n"
    },
    {
      "title": "See also",
      "level": 2,
      "content": "- Upstream documentation\n- Yggdrasil services\n- Wiki of Yggdrasil network users / yggdrasil network link\n- Alfis - DNS in Yggdrasil\n\n"
    }
  ]
}