{
  "title": "Yggdrasil (Русский)",
  "url": "https://wiki.archlinux.org/title/Yggdrasil_(%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Yggdrasil - это сетевой протокол и организованная с помощью него компьютерная сеть со сквозным шифрованием и автоматической маршрутизацией. Он доступен в большинстве популярных ОС и позволяет практически любому приложению с поддержкой IPv6 безопасно взаимодействовать с другими узлами Yggdrasil.\n\nВ статье содержится общая информация об установке и использовании Yggdrasil.\n\n"
    },
    {
      "title": "Установка",
      "level": 2,
      "content": "Установите пакет yggdrasil.\n\n"
    },
    {
      "title": "Запуск",
      "level": 2,
      "content": "Запустите/включите yggdrasil.service.\n\nПри запуске будет создан сетевой интерфейс tun и станут доступны два новых IPv6 интерфейса. Основным из них является тот, который начинается с 200: - это адрес под которым ваш компьютер будет известен в сети Yggdrasil. Для IP адресов используется зарезервированная часть стандарта IPv6, что позволяет избежать конфликтов в глобальной сети Интернет.\n\nДля проверки работы сервиса запустите:\n\n```\n# yggdrasilctl getself\n```\n\n"
    },
    {
      "title": "Настройка",
      "level": 2,
      "content": "Для создания файла конфигурации /etc/yggdrasil.conf по умолчанию запустите yggdrasil-default-config.service, также он будет создан при первом запуске yggdrasil.service. По умолчанию Yggdrasil не подключается к публичным пирам и будет запущен как локальный сервис. В файл конфигурации /etc/yggdrasil.conf (в формате JSON) можно добавить публичные пиры, и после перезапуска сервиса ваш узел получит доступ к глобальной сети, а также станет доступен другим узлам сети.\n\nДополнительная информация о настройке доступна в официальной документации.\n\nДля доступа к глобальной сети Yggdrasil, начните с раздела публичные пиры в документации.\n\n"
    },
    {
      "title": "Локальный межсетевой экран",
      "level": 2,
      "content": "В современных сетевых технологиях обычная установка Linux не имеет прямого доступа к Интернету. Обычно только серверы имеют общедоступный IP-адрес. В результате ssh и подобные сервисы не могут быть атакованы кем угодно.\n\nВажно понимать, что запуск и подключение к сети Yggdrasil изменяет эту ситуацию. Службы, прослушивающие все сетевые подключения, станут доступными для всех, кто подключается к этой сети. Возможно, вы захотите настроить их так, чтобы они не прослушивали сеть Yggdrasil или скрыть запущенные службы с помощью межсетевого экрана. Например:\n\n```\n/etc/iptables/ip6tables.rules\n```\n\n```\n#yggdrasil\n*filter\n:INPUT ACCEPT [8:757]\n:FORWARD ACCEPT [0:0]\n:OUTPUT ACCEPT [5:463]\n-A INPUT -i tun0 -m conntrack --ctstate RELATED,ESTABLISHED -j ACCEPT\n-A INPUT -i tun0 -m conntrack --ctstate INVALID -j DROP\n-A INPUT -i tun0 -j DROP\nCOMMIT\n```\n\nЗапустите/включите ip6tables.service, чтобы изменения вступили в силу.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Официальная документация\n- Сервисы Yggdrasil\n- Wiki of Yggdrasil network users / ссылка в сети Yggdrasil\n- Статья в Wikipedia.\n- Alfis - DNS в Yggdrasil\n\n"
    }
  ]
}