{
  "title": "Youtube-dl (Polski)",
  "url": "https://wiki.archlinux.org/title/Youtube-dl_(Polski)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "youtube-dl jest programem działającym w linii poleceń, który pozwala na łatwe pobieranie filmów i audio z ponad tysiąca stron internetowych. Zobacz lista lista obsługiwanych witryn.\n\n"
    },
    {
      "title": "Instalacja",
      "level": 2,
      "content": "Install pakiet youtube-dlAUR lub youtube-dl-gitAUR dla wersji rozwojowej. Zaleca się również zainstalowanie FFmpeg, ponieważ jest on używany do muxowania w niektórych witrynach. Zobacz opcjonalne zależności.\n\nIstnieją również różne forki youtube-dl, które mogą zawierać dodatkowe funkcje, w szczególności yt-dlp dodaje obsługę większej liczby stron, pobieranie komentarzy, ulepszenia preferencji formatu i inne zmiany. youtube-dlcAUR[broken link: package not found] jest kolejnym forkiem z wieloma z wyżej wymienionych nowych funkcji. Istnieją również różne graficzne nakładki na youtube-dl i/lub jego forki, takie jak tartubeAUR i yt-dlg (youtube-dl-gui-gitAUR).\n\n"
    },
    {
      "title": "Konfiguracja",
      "level": 2,
      "content": "Ogólnosystemowy plik konfiguracyjny to /etc/youtube-dl.conf a plik konfiguracyjny specyficzny dla użytkownika to ~/.config/youtube-dl/config. Składnia to po prostu jedna opcja wiersza poleceń na wiersz. Przykładowa konfiguracja:\n\n```\n--ignore-errors\n# --no-playlist\n\n# Save in ~/Videos\n-o ~/Videos/%(title)s.%(ext)s\n\n# Prefer 1080p or lower resolutions\n-f bestvideo[ext=mp4][width<2000][height<=1200]+bestaudio[ext=m4a]/bestvideo[ext=webm][width<2000][height<=1200]+bestaudio[ext=webm]/bestvideo[width<2000][height<=1200]+bestaudio/best[width<2000][height<=1200]/best\n```\n\nZobacz [1] po więcej informacji.\n\n"
    },
    {
      "title": "Używanie",
      "level": 2,
      "content": "Zobacz youtube-dl(1)[dead link 2023-11-25] do manuala.\n\n```\n$ youtube-dl [OPTIONS] URL\n```\n\n"
    },
    {
      "title": "Wybór formatu",
      "level": 3,
      "content": "Gdy dostępnych jest wiele formatów filmu, „youtube-dl” domyślnie pobierze najlepsze z nich.\n\nAby wybrać konkretny do pobrania:\n\n```\n$ youtube-dl -f format URL\n```\n\nAby uzyskać listę dostępnych formatów:\n\n```\n$ youtube-dl -F URL\n```\n\n"
    },
    {
      "title": "Wyodrębnij dźwięk",
      "level": 3,
      "content": "Użyj -x do pobierania tylko audio (wymaga FFmpeg):\n\n```\n$ youtube-dl -x -f bestaudio URL\n```\n\nW zależności od dostępnych strumieni źródłowych często będzie to poprawny kontener audio-only. Jeśli strumień tylko audio nie jest dostępny, wyklucz -f bestaudio z powyższego przykładu. Spowoduje to pobranie wideo i skopiowanie jego dźwięku jako procesu końcowego. Domyślnie spowoduje to usunięcie pobranych plików wideo, dołącz -k, aby je zachować.\n\nAby dołączyć także okładkę albumu (wymaga atomicparsley):\n\n```\n$ youtube-dl -x -f bestaudio[ext=m4a] --add-metadata --embed-thumbnail URL\n```\n\n"
    },
    {
      "title": "Napisy",
      "level": 3,
      "content": "Aby zobaczyć, które języki są dostępne:\n\n```\n$ youtube-dl --list-subs URL\n```\n\nAby pobrać film z wybranymi napisami (oddzielonymi przecinkami):\n\n```\n$ youtube-dl --write-sub --sub-lang LANG URL\n```\n\nW przypadku napisów generowanych automatycznie:\n\n```\n$ youtube-dl --write-auto-sub --sub-lang LANG URL\n```\n\nDodaj --skip-download aby uzyskać tylko napisy.\n\n"
    },
    {
      "title": "Szybsze pobieranie",
      "level": 3,
      "content": "Niektóre strony internetowe dławią prędkość transferu. Często można to obejść, wybierając strumienie inne niż DASH lub używając aria2, zewnętrznego downloadera, który obsługuje pobieranie przez wiele połączeń. Na przykład:\n\n```\n$ youtube-dl --external-downloader aria2c --external-downloader-args '-c -j 3 -x 3 -s 3 -k 1M' URL\n```\n\n"
    },
    {
      "title": "Playlista",
      "level": 3,
      "content": "Używanie youtube-dl do tworzenia playlisty zazwyczaj sprowadza się do następujących opcji:\n\n```\n$ youtube-dl --ignore-errors --continue --no-overwrites --download-archive progress.txt usual options URL\n```\n\nTen zestaw opcji pozwala na skuteczne kontynuowanie pobierania nawet po przerwaniu. Jeśli archiwizujesz, dodaj zwykłe opcje --write-xxx i --embed-xxx, które możesz mieć.\n\n"
    },
    {
      "title": "Przytnij (częściowe pobranie)",
      "level": 3,
      "content": "Części filmów można pobrać, używając wyjścia youtube-dl -g -f format URL jako wejścia ffmpeg z -ss (dla danych wejściowych), -t i -c copy opcje.\n\n"
    },
    {
      "title": "URL ze schowka",
      "level": 3,
      "content": "Powłoka alias, desktop launcher lub można ustawić skrót klawiaturowy, aby pobrać wideo (lub audio) z wybranego (lub skopiowanego) adresu URL, wysyłając go z X wybór. Zobacz Clipboard#Tools.\n\n"
    },
    {
      "title": "Zobacz też",
      "level": 2,
      "content": "- GitHub repository do dokumentacji.\n\n"
    }
  ]
}