{
  "title": "Zathura (Suomi)",
  "url": "https://wiki.archlinux.org/title/Zathura_(Suomi)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "zathura on helposti muokattava dokumentin katseluohjelma vi-tyyllisillä näppäimillä. Se tarjoaa minimalistisen ja työtilaa säästävän käyttäjäliittymän. Zathuraa käytetään pääosin vain näppäimistön kanssa. Erilaisille tiedostomuodoille löytyy tuki lisäosien kautta. Tuki löytyy lisäosilla PDF, PS, DjVu sekä comic book tiedostoille.\n\n"
    },
    {
      "title": "Asennus",
      "level": 2,
      "content": "Asenna zathura paketti haluttujen vaihtoehtoisten riippuvuuksien kanssa:\n\n- zathura-cb — Comic book tuki\n- zathura-djvu — DjVu tuki\n- zathura-pdf-mupdf — EPUB, PDF ja XPS tuki perutuen MuPDF:ään\n- zathura-pdf-poppler — PDF tuki perustuen Poppleriin\n- zathura-ps — PostScript tuki\n\n"
    },
    {
      "title": "Ominaisuuksia",
      "level": 2,
      "content": "Zathura lataa automaattisesti dokumentit. Kun käytetään käännettyjä dokumentteja, kuten LaTeXilla kirjoitettuja, zathura päivittää ulostulevan tulosteen aina, kun käännöstä tapahtuu. Zathuralla on mahdollista aktivoida käänteinen haku (\"synctex\" avulla).\n\nZathura pystyy asettamaan dokumentin sivun mukaan (a) tai leveyden mukaan (s), ja se pystyy kääntämään sivuja (r). Sillä voi asettaa sivut vierekkäin (d) ja siitä löytyy myös täyden näytön tila. Sivut pystyy myös uudelleen värjäämään niin, että niillä on musta tausta ja valkoinen etuosa eli teksti ja merkinnät (C-r). Valtaosa vi:n liikekomennoista on tuettuna.\n\nLinkkejä pystyy seuraamaan niitä klikkaamalla. Lisäksi on mahdollista käyttää f painiketta kaikkien linkkien korostamiseksi sivulla, jonka lisäksi niille annetaan numero. Linkkiä vastaavaa numeroa sekä entteriä painamalla pystytään hyppäämään linkin osoittamaan paikkaan. Jos F painiketta painetaan, vain linkin sijainti näytetään tila-palkissa.\n\nZathura pystyy etsimään ja kopioimaan tekstiä X:n ensisijaiseen valintaan. Se tukee kirjanmerkkejä ja pystyy avaamaan suojattuja tiedostoja.\n\nZathuran käyttäytymistä ja ulkonäköä pystyy muokkaamaan käyttäen konfigurointi tiedostoa. Zathura kykenee suorittamaan ulkoisia shell komentoja. Se voidaan avata sivulehdellä käyttäen tabbedia.\n\nZathurassa on vaihtoehtoinen hiekkalaatikkotila seccomp soudatinta käyttämällä, jolla saadaan lujitettu suoritusympäristö käyttäjille.\n\n"
    },
    {
      "title": "Vinkkejä ja konsteja",
      "level": 2,
      "content": "Komentoja voidaan antaa suoraan zathuraan painamalla :, aivan kuten vi:ssä on ominaisuutena.\n\n"
    },
    {
      "title": "Aktivoi leikepöydälle kopiointi",
      "level": 3,
      "content": "```\n~/.config/zathura/zathurarc\n```\n\n```\nset selection-clipboard clipboard\n```\n\n"
    },
    {
      "title": "Vierekkäin asettelu",
      "level": 3,
      "content": "Paina d vierekkäin asettelutilan vaihtamiseksi.\n\nVierekkäin asettelutilassa, jotta saadaan ensimmäinen sivu vasemmalle puolelle, suorita komento set first-page-column 1:1 Zathurassa. Tämä on hyvinkin käytännöllinen, kun luetaan musiikin skannauksia, missä ladonta optimoi sivun kääntämiseen joillain sivuilla. Kuten muutkin zathura komennot, tämän voi laittaa zathurarc tiedostoon.\n\n"
    },
    {
      "title": "Otsikkopalkin ja tilapalkin parantelu",
      "level": 3,
      "content": "Katso zathurarc(5).\n\n"
    },
    {
      "title": "Välilehditetty zathura",
      "level": 3,
      "content": "Zathura voidaan käyttää välilehdillä käyttäen tabbed.\n\n```\ntabbed -c zathura -e\n```\n\nHuomioithan, että ikkunoinninhallintajärjestelmissä, joissa on olemassa välilehti asetelma, ei tarvitse käyttää tabbedia. Tälläinen on esimerkiksi i3.\n\n"
    },
    {
      "title": "Sivun numeron offset",
      "level": 3,
      "content": "Monet painokset printatuista kirjoista aloittavat sivun numeroiden laskemisen vasta tekstin alussa. Zathura laskee kumminkin kaikki sivut PDF:stä, mukaanlukien ne sivut, joita jotkin painokset eivät laske: etukansi, painoksen erityinen huomio, ne muutavat tyhjät sivut, jne. Tästä syystä Zathuran sivu numerointi on joskus hieman painoksen numeroinnista poikkeava, joka tekee sivunumeroiden seuraamisesta hankalaa.\n\n:offset <numero> komento Zathurassa ottaa huomioon poikkeaman, kun hypätään jollekkin sivulle (kirjoittamalla <numero>G, komento :<numero> ei huomioi tätä poikkeamaa [1][dead link 2024-07-30 ⓘ]). Esimerkiksi, kirja aloittaa sivujen laskemisen PDFn 17. sivulla (joten sivulla 17, indeksi on 1; sivulla 18 se on 2, jne.). Asetuksella :offset 16, 245G hyppää PDFn 261. sivulle ennemmin kuin 245. sivulle.\n\n"
    },
    {
      "title": "Aktivoi Hiekkalaatikko",
      "level": 3,
      "content": "Zathurassa on hiekkalaatikkotila, joka tarjoaa suojatun ympäristön käyttämällä hyvin tiukkaa seccomp suodatinta. Tämä tila voidaan asettaa zathurarc tiedostossa seuraavanlaisesti:\n\n```\nset sandbox strict\n```\n\nJotkin ominaisuudet on pois käytöstä, kun käytetään tiukkaa hiekkalaatikkotilaa, kuten tiedostojen kirjoittaminen, printtaminen ja kirjanmerkit.\n\n"
    },
    {
      "title": "Tee zathurasta oletus pdf katseluohjelma",
      "level": 3,
      "content": "Varmistaa, että esimerkiksi xdg-open(1) avaa pdf tiedostot Zathuralla.\n\nEnsin, varmista zathuran desktop tiedoston olemassa olo: /usr/share/applications/org.pwmt.zathura.desktop. Jos se ei ole olemassa, lataa desktop tiedosto zathuran tiedostolähteestä polkuun /usr/share/applications/.\n\nSen jälkeen, aseta Zathura oletukseksi xdg-mime(1) komennolla:\n\n```\n$ xdg-mime default org.pwmt.zathura.desktop application/pdf\n```\n\n"
    },
    {
      "title": "Lue Microsoft Office/LibreOffice dokumentteja zathuralla",
      "level": 3,
      "content": "zaread-gitAUR skripti mahdollistaa Microsoft Office/LibreOffice dokumenttien avaamisen zathuralla.\n\nKäyttääksesi sitä, suorita\n\n```\n$ zaread /polku/siihen/dokumenttiin.docx\n```\n\n"
    },
    {
      "title": "Emacs näppäinkartta",
      "level": 3,
      "content": "Zathura käyttää oletukselta vi -tyyppistä näppäinkarttaa. Emacs näppäinyhdistelmät pitää asettaa erikseen. Esimerkkiä saa täältä[dead link 2023-10-29 ⓘ].\n\n"
    },
    {
      "title": "Valtava muistin käyttö Popplerilla",
      "level": 3,
      "content": "Viassa 88[dead link 2024-07-30 ⓘ] kerrotaan, että zathura-pdf-mupdf vaihtaminen zathura-pdf-poppler tilalle saattaa korjata ongelman. Jos kumminkin tarkastelet isoa tiedostoa, Zathura vie paljon muistia myös silloin.\n\n"
    },
    {
      "title": "Katso myös",
      "level": 2,
      "content": "- Zathuran verkkosivu\n- Poppler verkkosivu\n- Man sivu näppäinyhdistelmien kanssa[dead link 2024-07-30 ⓘ]\n\n"
    }
  ]
}