{
  "title": "Zswap (Português)",
  "url": "https://wiki.archlinux.org/title/Zswap_(Portugu%C3%AAs)",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Artigos relacionados\n\n- Parâmetros do kernel\n- Mkinitcpio\n\nZswap É um recurso do kernel que fornece um cache de RAM compactado para páginas de troca. As páginas que, de outra forma, seriam trocadas para o disco são compactadas e armazenadas em um pool de memória na RAM. Quando o pool estiver cheio ou a RAM esgotada, o menos usado recentemente (LRU) a página é descompactada e gravada no disco, como se não tivesse sido interceptada. Após a página ser descompactada no cache de troca, a versão compactada no pool pode ser liberada.\n\nA diferença em comparação com ZRAM é que o zswap funciona em conjunto com um swap dispositivo enquanto zram é um dispositivo de troca na RAM que não requer um dispositivo de troca de apoio.\n\n"
    },
    {
      "title": "Alternando zswap",
      "level": 2,
      "content": "No pacote de kernel estável oficial linux, zswap é habilitado por padrão. Isso pode ser verificado através do sinalizador CONFIG_ZSWAP_DEFAULT_ON na configuração do kernel estável.\n\nPara desativar zswap em tempo de execução, execute o seguinte comando:\n\n```\n# echo 0 > /sys/module/zswap/parameters/enabled\n```\n\nPara desativar zswap permanentemente, adicione zswap.enabled=0 aos seus parâmetros do kernel.\n\n"
    },
    {
      "title": "Parâmetros atuais",
      "level": 3,
      "content": "Zswap tem vários parâmetros personalizáveis. As configurações podem ser exibidos usando:\n\n```\n$ grep -R . /sys/module/zswap/parameters\n```\n\n```\n/sys/module/zswap/parameters/same_filled_pages_enabled:Y\n/sys/module/zswap/parameters/enabled:Y\n/sys/module/zswap/parameters/max_pool_percent:20\n/sys/module/zswap/parameters/compressor:lz4\n/sys/module/zswap/parameters/zpool:z3fold\n/sys/module/zswap/parameters/accept_threshold_percent:90\n```\n\nVeja a documentação do zswap para a descrição dos diferentes parâmetros.\n\nA mensagem de carregamento do tempo de inicialização mostrando a configuração inicial pode ser recuperada com:\n\n```\n# dmesg | grep zswap:\n```\n\n```\n[    0.317569] zswap: loaded using pool lz4/z3fold\n```\n\n"
    },
    {
      "title": "Usando sysfs",
      "level": 3,
      "content": "Cada configuração pode ser alterada em tempo de execução através do sysfs interface. Por exemplo, para alterar o compressor use o parâmetro:\n\n```\n# echo lz4 > /sys/module/zswap/parameters/compressor\n```\n\n"
    },
    {
      "title": "Usando parâmetros de inicialização do kernel",
      "level": 4,
      "content": "Para manter a alteração de parâmetro, a opção correspondente, por exemplo zswap.compressor=lz4, deve ser adicionado para a inicialização do kernel. Portanto, para definir permanentemente todas as definições acima, os seguintes parâmetros do kernel devem ser adicionados:\n\n```\nzswap.enabled=1 zswap.compressor=lz4 zswap.max_pool_percent=20 zswap.zpool=z3fold\n```\n\nQuando alterar o algoritmo de compressão através do parâmetro de arranque, o que precisa para garantir o correspondente compressão módulo é carregado no início durante a inicialização (confira o #Algoritmo de compressão).\n\n"
    },
    {
      "title": "Usando systemd-swap",
      "level": 4,
      "content": "Para aqueles que estão usando o script systemd-swap que modifica os parâmetros sysfs em uma fase posterior do processo de arranque com base na sua configuração armazenada em /etc/systemd/swap.conf.\n\n"
    },
    {
      "title": "Tamanho máximo do pool",
      "level": 3,
      "content": "O pool de memória não é pré-alocado, ele pode crescer até um certo limite, em porcentagem da memória total disponível, por padrão até 20% do total de RAM. Uma vez que este limite é atingido, as páginas são expulsas do pool no dispositivo swap. O máximo comprimidos de pool de tamanho é controlado com o parâmetro max_pool_percent.\n\n"
    },
    {
      "title": "Alocador de pull de memória comprimida",
      "level": 3,
      "content": "O parâmetro zpool controla a gestão do comprimido de memória de pool.\n\nCom o alocador de dados zbud, 2 objetos comprimidos são armazenadas em 1 página, o que limita a taxa de compressão de 2 ou menos.\n\nO alocador superior z3fold permite que até 3 comprimidos de objetos por página. A taxa de compressão com z3fold normalmente é em média 2,7 enquanto é de 1,7 para o zbud.\n\nUm zpool do tipo z3fold é criado por padrão. Use o parâmetro do kernel zswap.zpool para selecionar outro método no momento da inicialização. O alocador de dados também pode ser alterado posteriormente por meio da interface sysfs.\n\n"
    },
    {
      "title": "Algoritmo de compressão",
      "level": 3,
      "content": "Para compressão de página, o zswap usa módulos compactadores fornecidos pela API criptográfica do kernel. Ele usa por padrão o algoritmo de compressão lz4, mas isso pode ser alterado com zswap.compressor no momento da inicialização. Outras opções incluem deflate, lz4hc, lzo, lzo-rle, 842 e zstd.\n\nNão há problema em alterar a compressão em tempo de execução usando sysfs ou via systemd-swap, mas o zswap começa neste caso com lz4 e muda em um estágio posterior para o algoritmo definido. Para iniciar o zswap com outro algoritmo imediatamente, isso deve ser definido por meio dos parâmetros de inicialização do kernel e o módulo correspondente deve ser carregado antecipadamente pelo kernel. Isso pode ser alcançado seguindo estas etapas:\n\n1. Adicione os módulos relacionados ao compressor escolhido ao array mkinitcpio (Português)#MODULES.\n1. Gere novamente os ambientes ramdisk após modificar a configuração do mkinitcpio: consulte mkinitcpio (Português)#Criação e ativação de imagem.\n1. Defina zswap.compressor ao seu algoritmo escolhido nos parâmetros do kernel.\n\nNa próxima inicialização, consulte #Parâmetros atuais para verificar se zswap agora usa o compressor solicitado.\n\n"
    },
    {
      "title": "Veja também",
      "level": 2,
      "content": "- zswap: Como determinar se está comprimindo páginas de troca?.\n- IBM Support Article \"New Linux zswap compression functionality\" (Imagens de benchmark não carregam).\n- Ask Ubuntu: zram vs. zswap vs. zcache.\n- Tópico no fórum do Arch Linux.\n- Artigo técnico da LWN.net pelo desenvolvedor principal do zswap.\n\n"
    }
  ]
}