{
  "title": "Évitez certaines commandes de pacman",
  "url": "https://wiki.archlinux.org/title/%C3%89vitez_certaines_commandes_de_pacman",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Related articles\n\n- General recommendations (Français)\n\nUne Maintenance régulière du système est nécessaire au maintien d'un bon fonctionnement d'Arch dans la durée. Il faut s'habituer à un entretien périodique.\n\n"
    },
    {
      "title": "Échec de services de systemd",
      "level": 3,
      "content": "Recenser les services défaillants :\n\n```\n$ systemctl --failed\n```\n\nInformation complémentaire: Systemd (Français)#Dépannage.\n\n"
    },
    {
      "title": "Fichiers de Log",
      "level": 3,
      "content": "Pour la recherche d'erreurs dans les journaux, fichiers de /var/log, ainsi que les erreurs de haute priorité du journal de systemd:\n\n```\n# journalctl -p 3 -xb\n```\n\nInformation complémentaire: systemd (Français)/Journal (Français). Voir Xorg (Français)#Dépannage pour des informations sur où et comment Xorg garde trace des erreurs.\n\n"
    },
    {
      "title": "Sauvegardes",
      "level": 2,
      "content": "Disposer de sauvegardes des données importantes est une mesure nécessaire à prendre, car les erreurs de traitement des humains et des machines sont très susceptibles de générer de la corruption au fil du temps, et aussi le support physique où sont stockées les données est inévitablement destiné à tomber en panne.\n\nConsultez Synchronization and backup programs pour connaître les nombreuses applications alternatives qui pourraient mieux convenir à votre cas. Consultez Category:System recovery pour d'autres articles d'intérêt.\n\nIl est encouragé d'automatiser les sauvegardes, consultez Autostarting#On time events.\n\n"
    },
    {
      "title": "Fichiers de Configuration",
      "level": 3,
      "content": "Avant de modifier des fichiers de configuration, créez des sauvegardes afin de pouvoir revenir à une version fonctionnelle en cas de problèmes.\n\nLes éditeurs comme Vim et Emacs peuvent le faire automatiquement. Plus largement, envisagez d'utiliser un gestionnaire de configuration.\n\nPour les dotfiles (fichiers de configuration dans le répertoire home), consultez dotfiles#Tracking dotfiles directly with Git.\n\n"
    },
    {
      "title": "Liste des paquets installés",
      "level": 3,
      "content": "Gardez à jour une liste des paquets installés sur votre machine pour retrouver plus facilement votre environnement si une réinstallation complète était inévitable.\n\nVoir Pacman (Français)/Tips and tricks (Français)#Liste des paquets installés.\n\n"
    },
    {
      "title": "Sauvegarde de la base de données de Pacman",
      "level": 3,
      "content": "Voir Pacman (Français)/Tips and tricks (Français)#Sauvegarde de la base de données de pacman.\n\n"
    },
    {
      "title": "Métadonnées de chiffrement des disques",
      "level": 3,
      "content": "Voir Data-at-rest encryption#Backup for disk encryption scenarios.\n\n"
    },
    {
      "title": "Système et données Utilisateur",
      "level": 3,
      "content": "Voir System backup.\n\n"
    },
    {
      "title": "Mises à jour du système",
      "level": 2,
      "content": "Il est recommandé de faire les mises à jour complètes du système via pacman à intervalles réguliers, à la fois pour profiter des dernières corrections de bogues et des mises à jour de sécurité, et aussi pour n'avoir pas trop d'éventuelles interventions manuelles en une seule fois. Lorsqu'on demande de l'aide à la communauté, on suppose généralement que le système est à jour.\n\nAssurez-vous de la disponibilité - pour sauvetage en cas de problème - d'un media d'installation Arch Linux ou autre CD/USB-Live. Si vous utilisez Arch dans un environnement de production, ou si vous ne pouvez vous permettre aucun temps d'arrêt pour quelque raison que ce soit, testez d'abord les modifications des fichiers de configuration, et les mises à jour des progiciels, sur un système en double non critique. Ensuite, si aucun problème ne se pose, déployer les changements dans le système de production.\n\nEn cas de paquets AUR dans le système, mettez-les à jour prudemment.\n\npacman est un puissant outil de gestion des paquets, mais il n'essaie pas de traiter tous les cas critiques. Les utilisateurs doivent être vigilants et assumer la responsabilité de la maintenance de leur propre système.\n\n"
    },
    {
      "title": "À lire avant toute mise à jour",
      "level": 3,
      "content": "Avant une mise à jour prenez connaissance des actualités, sur le site Archlinux.fr, ou par souscription au flux RSS ou la liste de diffusion arch-announce. Lorsque des mises à jour nécessitent une intervention inhabituelle de l'utilisateur (au-delà de ce qui peut être traité simplement en suivant les instructions données par pacman), un message d'information approprié sera publié.\n\nAvant de mettre à jour un logiciel fondamental (tels que linux, Xorg, Systemd, ou glibc) vers une nouvelle version, consultez le forum approprié pour voir s'il y a eu des problèmes signalés.\n\nLes utilisateurs doivent également être conscients que la mise à jour des paquets peut soulever des problèmes inattendus qui pourraient nécessiter une intervention immédiate; par conséquent, il est déconseillé de mettre à jour un système stable peu de temps avant qu'il ne soit nécessaire à l'exécution d'une tâche importante. Il est sage d'attendre plutôt d'avoir suffisamment de temps pour être en mesure de traiter d'éventuels problèmes après la mise à jour.\n\n"
    },
    {
      "title": "Évitez certaines commandes de pacman",
      "level": 3,
      "content": "Éviter absolument toute mise à jour partielle. Autrement dit ne jamais utiliser la commande pacman -Sy; mais, à la place, toujours pacman -Syu.\n\nÉviter l'option --overwrite de pacman. Celle-ci prend un «glob» comme argument. Lorsqu'elle est utilisée, pacman va ignorer les conflits de fichier, pour tout fichier qui correspondrait à ce glob. Un système correctement maintenu ne devrait utiliser cette option qu'en cas de recommandation explicite des développeurs d'Arch. (voir #À lire avant toute mise à jour).\n\nÉviter l'option -d de pacman: pacman -Rdd paquet qui désactive le contrôle des dépendances dans la désinstallation d'un paquet. Il peut en résulter la désinstallation associée d'une dépendance critique et la casse de votre système.\n\n"
    },
    {
      "title": "Les mises à jour partielles ne sont pas prises en charge",
      "level": 3,
      "content": "Arch Linux est une distribution de type rolling release. Ceci signifie que lorsque de nouvelles versions de bibliothèques logicielles sont poussées vers les dépôts, les développeurs et utilisateurs de confiance reconstruisent dans les dépôts la totalité des paquets qui doivent l'être par rapport aux bibliothèques. Par exemple, si deux paquets dépendent de la même bibliothèque, la mise à jour d'un seul paquet pourrait également mettre à jour la bibliothèque (en tant que dépendance), ce qui pourrait briser l'autre paquet qui dépend d'une version plus ancienne de la bibliothèque.\n\nC'est pourquoi les mises à jour partielles ne sont pas prises en charge. N'utilisez pas :\n\n- pacman -Sy paquet\n- pacman -Sy suivi de pacman -S paquet (Notez l'absence de -Su dans l'installation du paquet.)\n- pacman -Syuw (Notez que pacman -Syuw implique les mêmes risques que pacman -Sy, car il mettra à jour la base de données de synchronisation de pacman sans installer les nouveaux paquets).\n\nLorsque vous rafraîchissez la base de données des paquets, faites toujours une mise à jour complète avec pacman -Syu. Notez que si pacman -Syu n'effectue pas la mise à jour en raison d'une erreur, le résultat final est le même que l'exécution de pacman -Sy. Par conséquent, l'erreur doit être résolue et l'opération de mise à jour terminée dès que possible.\n\nSoyez très prudent lorsque vous utilisez IgnorePkg et IgnoreGroup pour la même raison. Si le système a des paquets installés localement (comme les paquets AUR), les utilisateurs devront les reconstruire lorsque leurs dépendances recevront un «soname bump».\n\nDans un scénario de mise à jour partielle, avec des binaires cassés parce qu'ils ne peuvent pas trouver les bibliothèques auxquelles ils sont liés, ne \"corrigez\" pas le problème simplement en créant des liens symboliques. Les bibliothèques incrémentent leur soname lorsqu'elles ne sont pas rétrocompatibles. Un simple pacman -Syu vers un miroir correctement synchronisé résoudra le problème tant que pacman n'est pas cassé.\n\nLe script bash checkupdates, inclus dans le paquet pacman-contrib, fournit un moyen sûr de vérifier les mises à jour des paquets installés sans exécuter une mise à jour du système en même temps, et propose une option pour télécharger les mise-à-jours en attente vers le cache de pacman sans modifier sa base de données.\n\n"
    },
    {
      "title": "Restez vigilants lors d'une mise à jour",
      "level": 3,
      "content": "Lors d'une mise à jour-système, soyez attentif aux messages d'alertes de pacman. Si l'utilisateur est invité à une action complémentaire, assurez-vous de la faire de suite. Si une alerte pacman est déroutante, recherchez les forums et les nouvelles récentes pour plus de détails.\n\n"
    },
    {
      "title": "Traiter rapidement les nouveaux fichiers de configuration",
      "level": 3,
      "content": "L'utilisation de pacman peut créer des fichiers .pacnew et .pacsave. Pacman avertit en ce cas et l'utilisateur doit traiter ces fichiers rapidement. Se référer à Pacman (Français)/Pacnew and Pacsave (Français) pour détails.\n\nPensez également aux autres fichiers de configuration que vous avez pu copier ou créer. Si un paquet avait un exemple de configuration que vous avez copié dans votre répertoire personnel, vérifiez si un nouveau fichier a été créé.\n\n"
    },
    {
      "title": "Redémarrage après une mise à jour",
      "level": 3,
      "content": "La mise à jour n'affecte pas les processus en cours d’exécution. Certains peuvent le réclamer, mais la plupart doivent être relancés manuellement pour appliquer la mis à jour.\n\nLe paquet archlinux-contrib fournit un script appelé checkservices qui exécute pacdiff pour fusionner les fichiers .pacnew puis vérifier les processus en cours d'exécution utilisant des bibliothèques obsolètes et demande à l'utilisateur s'il souhaite qu'ils soient redémarrés.\n\nLe noyau est particulièrement difficile à patcher «en production», aussi le redémarrage de la machine est la solution la plus sûre. Dans des cas pour lesquels ceci n'est pas envisageable voir la page: Kernel live patching (en).\n\n"
    },
    {
      "title": "Annuler une mise à jour cassée",
      "level": 3,
      "content": "S'il est connu ou attendu qu'une mise à jour de paquet cause des problèmes, les mainteneurs s'assureront que pacman affiche un message approprié lors de la mise à jour. Si vous rencontrez ces problèmes en ce cas, vérifiez bien la sortie de pacman en regardant /var/log/pacman.log.\n\nA ce stade, sans information disponible par pacman, sans note à ce sujet dans les actualités sur https://archlinux.fr/, et sans messages sur le forum à propos de la mise à jour, envisagez de chercher de l'aide sur le site par le forum ou le canal IRC, ou rétrogradez le paquet incriminé.\n\n"
    },
    {
      "title": "Vérification des paquets orphelins et/ou abandonnés",
      "level": 3,
      "content": "Après mise à jour, il peut maintenant y avoir des paquets qui ne sont plus nécessaires ou qui ne sont plus dans les dépôts officiels.\n\nLa commande pacman -Qtd cherche ces paquets \"orphelins\": installés comme dépendances mais n'étant plus requiqs par aucun paquet installé. Si un tel orphelin est utile en tant que paquet isolé il est recommandé de modifier son motif d'installation. Autrement, s'il n'a pas utilité ce dernier peut être désinstallé.\n\nEn sus, certains paquets ne sont plus dans les dépôts distants mais peuvent toujours se trouver sur votre système local. On liste tous les paquets étrangers avec pacman -Qm. Mais notez que cette liste comprendra aussi les paquets installés manuellement, par exemple depuis AUR. Pour exclure les paquets qui sont (toujours) disponibles sur l'AUR, utilisez l'utilitaire ancient-packagesAUR.\n\n"
    },
    {
      "title": "Utiliser le gestionnaire de paquets pour installer un logiciel",
      "level": 2,
      "content": "Pacman gardera bien mieux que vous une trace des paquets installés. Tôt ou tard vous oublierez une installation manuelle, l'avoir faite, quand, pourquoi, vous installeriez en créant des conflits avec d'autres paquets, à des emplacements non conformes, etc.\n\n- Installez les paquets présents dans les dépôts officiels comme décrit ici: Installation de paquets.\n- Si le programme souhaité n'est pas dans les dépôts, voyez si quelqu'un a créé un paquet AUR et suivez la méthode de l'article pour l'installer.\n- Enfin, pour un programme souhaité mais absent des dépôts, officiels ou AUR, apprenez à créer pour lui un paquet AUR Créer et modifier un paquet.\n\nVoir les détails pour Pacman (Français)/Tips and tricks (Français)#Recherche des fichiers n'appartenant à aucun paquet.\n\n"
    },
    {
      "title": "Choix de pilotes libres",
      "level": 3,
      "content": "Privilégiez toujours les pilotes libres avant de recourir aux pilotes propriétaires. La plupart du temps, les pilotes libres sont plus stables et plus fiables que les pilotes propriétaires. Les bogues des pilotes libres sont corrigés plus facilement et plus rapidement. Si les pilotes propriétaires peuvent offrir plus de fonctionnalités et de capacités, cela peut se faire au détriment de la stabilité. Pour éviter ce dilemme, essayez de choisir des composants matériels connus pour avoir un support mûr de pilotes libres avec des fonctionnalités complètes. Des informations sur le matériel avec des pilotes Linux libres sont disponibles à l'adresse suivante linux-drivers.org.\n\n"
    },
    {
      "title": "Prudence avec les paquets non-officiels",
      "level": 3,
      "content": "Usez avec précaution des paquets AUR ou des dépôts non officiels. La plupart sont fournis par des utilisateurs normaux et n'ont pas les mêmes standards que ceux des dépôts officiels. Soyez prudents avec les assistants AUR qui automatisent l'installation. Toujours vérifier les PKGBUILDs du point de vue de leur rigueur, cherchant de simples erreurs mais parfois des codes malicieux, avant de les compiler et de les installer.\n\nPour simplifier la maintenance, limitez le nombre de paquets non officiels utilisés. Effectuer des contrôles périodiques de ceux qui sont réellement utilisés et supprimer (ou remplacer par leurs homologues officiels) tous les autres. Voir Pacman (Français)/Tips and tricks (Français)#Maintenance pour quelques commandes utiles.\n\n"
    },
    {
      "title": "Mettre à jour de la liste des miroirs",
      "level": 3,
      "content": "La qualité, en rapidité de mise à jour et débit, des dépôts-miroirs varie dans le temps, avec parfois dégradation ou même désactivation.\n\nVoir Miroirs pour les details.\n\n"
    },
    {
      "title": "Nettoyer le Système",
      "level": 2,
      "content": "Pour la suppression de fichiers à supprimer, il est important de trouver ceux qui occupent le plus d'espace disque. Les programmes d'aide à ce sujet se trouvent dans:\n\n- List of applications#Disk usage display (en)\n- List of applications#Disk cleaning (en)\n\n"
    },
    {
      "title": "Cache des Paquets",
      "level": 3,
      "content": "Supprimez les fichiers .pkg dont vous ne voulez plus de /var/cache/pacman/pkg/ pour un gain d'espace.\n\nVoir Pacman (Français)#Nettoyage du cache des paquets pour plus d'information.\n\n"
    },
    {
      "title": "Paquets Inutiles (orphelins)",
      "level": 3,
      "content": "Supprimez les paquets inutilisés du système pour libérer de l'espace disque et simplifier la maintenance.\n\nVoir Pacman (Français)/Tips and tricks (Français)#Suppression des paquets inutilisés (orphelins) pour plus de détails.\n\n"
    },
    {
      "title": "Fichiers de configuration anciens",
      "level": 3,
      "content": "Les anciens fichiers de configuration peuvent être en conflit avec les mises à jour de paquets, ou se corrompre avec le temps. Supprimez périodiquement ceux inutiles, en particulier dans votre répertoire personnel et ~/.config. Pour les mêmes raisons soyez prudent lorsque vous partagez des répertoires personnels entre les installations.\n\nSurveillez les répertoires suivants:\n\n- ~/.config/ -- emplacement des configuration des applications\n- ~/.cache/ -- le cache de certains programmes peut croître exagérément\n- ~/.local/share/ -- des fichiers périmés peuvent y rester\n\nVoir XDG Base Directory support(en)\n\nPour garder propre le répertoire home de fichiers temporaires à de mauvais endroits, une bonne idée est de gérer une liste de fichiers non désirés et de les supprimer régulièrement, par exemple avec rmshit.py.\n\nrmlint-gitAUR pour trouver et éventuellement supprimer les fichiers en double, les fichiers vides, les répertoires vides récursifs et les liens symboliques cassés.\n\n"
    },
    {
      "title": "Liens symboliques cassés",
      "level": 3,
      "content": "Il peut s'en trouver dispersés dans votre système: exemples de façons d'y parvenir: ici et ici aussi.\n\nPour une liste rapide :\n\n```\n# find -xtype l -print\n```\n\nPuis voyez la liste et supprimez les entrées inutiles.\n\n"
    },
    {
      "title": "Trucs et astuces",
      "level": 2,
      "content": "Les conseils suivants ne sont généralement pas nécessaires, mais certains utilisateurs peuvent les trouver utiles.\n\n"
    },
    {
      "title": "Utiliser des paquets logiciels éprouvés",
      "level": 3,
      "content": "La publication en continue d'Arch peut être une aubaine pour les utilisateurs qui veulent essayer les dernières fonctionnalités et obtenir les mises à jour dès que possible, mais elles peuvent aussi rendre la maintenance du système plus difficile. Pour simplifier la maintenance et améliorer la stabilité, essayez d'éviter les logiciels de pointe et n'installez que des logiciels mûrs et éprouvés. Ces logiciels sont moins susceptibles de recevoir des mises à jour difficiles, telles que des changements de configuration majeurs ou la suppression de fonctionnalités. Préférez les logiciels qui disposent d'une communauté de développement forte et active, ainsi que d'un grand nombre d'utilisateurs compétents, afin de simplifier l'aide en cas de problème.\n\nÉvitez toute utilisation du dépôt de testing, même les paquets individuels de testing. Ces paquets sont expérimentaux et ne conviennent pas à un système stable. De même, évitez les paquets construits directement à partir de sources de développement en amont. Ils se trouvent généralement dans l'AUR, avec des noms tels que : \"dev\", \"devel\", \"svn\", \"cvs\", \"git\", etc.\n\n"
    },
    {
      "title": "Installer le paquet linux-lts",
      "level": 3,
      "content": "Le paquet linux-lts est un autre paquet du noyau Arch, et est disponible dans le dépôt core. Cette version particulière du noyau bénéficie d'un support à long terme (LTS) de la part des développeurs en amont, incluant des corrections de sécurité et quelques fonctionnalités rétroportées. Elle est utile si vous préférez la stabilité des mises à jour moins fréquentes du noyau ou si vous voulez un noyau de secours au cas où une nouvelle version du noyau poserait des problèmes.\n\nPour le rendre disponible en tant qu'option de démarrage, vous devrez mettre à jour le fichier de configuration de votre chargeur d'amorçage pour utiliser le noyau LTS et son «initramfs» : vmlinuz-linux-lts et initramfs-linux-lts.img.\n\n"
    },
    {
      "title": "À voir aussi",
      "level": 2,
      "content": "- Arch News Bash Script\n\n"
    }
  ]
}