{
  "title": "Βοήθεια:Πώς να γράφετε την εισαγωγή ενός άρθρου",
  "url": "https://wiki.archlinux.org/title/%CE%92%CE%BF%CE%AE%CE%B8%CE%B5%CE%B9%CE%B1:%CE%A0%CF%8E%CF%82_%CE%BD%CE%B1_%CE%B3%CF%81%CE%AC%CF%86%CE%B5%CF%84%CE%B5_%CF%84%CE%B7%CE%BD_%CE%B5%CE%B9%CF%83%CE%B1%CE%B3%CF%89%CE%B3%CE%AE_%CE%B5%CE%BD%CF%8C%CF%82_%CE%AC%CF%81%CE%B8%CF%81%CE%BF%CF%85",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Σχετικά άρθρα\n\n- ArchWiki:About\n- Help:Style\n- Help:Editing\n- Help:Article naming guidelines\n- Help:Effective use of headers\n\nΤο άρθρο αυτό γράφτηκε για να βοηθήσει τους συντάκτες και τους επιμελητές του wiki να δημιουργούν αποτελεσματικά αρθρα και για να διευρύνει την αναγνωστική επειρία των χρηστών του ArchWiki.\n\nΓια να κατανοήσετε το άρθρο αυτό δεν χρειάζεται να γνωρίζετε πώς θα επεξεργαστείτε μια σελίδα του wiki. Η σελίδα αυτή είναι ένας γενικός οδηγός παρά ένα HOWTO τεχνικής επεξεργασίας άρθρων.\n\n"
    },
    {
      "title": "Εισαγωγή άρθρου",
      "level": 2,
      "content": "Η εισαγωγή ενός άρθρου είναι το πρώτο πράγμα που συναντούν οι αναγνώστες και έχει στόχο την εισαγωγή του στο αντικείμενο του άρθρου.\n\nΚάθε άρθρο ξεκινά με ένα σύνολο προϋποθέσεων. Οι προϋποθέσεις αυτές σπανίως ισχύουν για τους περισσότερους χρήστες και η εισαγωγή του άρθρου έχει σκοπό το... φιλτράρισμα των αναγνωστών οι οποίοι ικανοποιούν τις προϋποθέσεις που θέτει η αρθρογράφος. Δεν είναι απαραίτητο να εισάγεται τους αναγνώστες στο υπόλοιπο του άρθρου, θα βοηθούσε όμως να ξεκαθαριστούν ορισμένα πράγματ τα οποία αλλιώς θα παρέμεναν ασαφή ακόμη και μετά από πολλές αναγνώσεις του άρθρου!\n\nΓια παράδειγμα, ας υποθέσουμε ότι γράψατε ένα άρθρο για την ρύθμιση του συστήματος με συγκεκριμένο τρόπο. Προϋποθέτετε, όμως, ότι οι αναγνώστες έχουν ένα καθαρό και φρεσκο-εγκατεστημένο Arch Linux στον πρωτεύοντα δίσκο τους. Πώς θα επηρεαστεί η μέθοδός σας αν, για παράδειγμα, ο πυρήνας στον υπολογιστή του χρήστη είναι προσαρμοσμένος στις ανάγκες του; Πώς θα εξελιχθεί το βήμα 3 αν λείπει το Χ πακέτο;\n\nΘα πρέπει να μελετήσετε τα προαπαιτούμενα που θέτει η μέθοδός σας και να τα παρουσιάσετε πριν ξεκινήσετε τη συγγραφή του άρθρου σας. Αυτή η πρακτική προσφέρει δυο οφέλη:\n\n1. Επιτρέπει από νωρίς στους χρήστες να αποφασίσουν αν επιθυμούν να διαβάσουν ολόκληρο το άρθρο.\n1. Σας επιτρέπει να γράψετε το άρθρο σας χωρίς πολλές παρεκβάσεις.\n\nΗ δεύτερη περίπτωση έχει τεράστια επίδραση στην εκπλήρωση της ανάγνωσης και κάνει το άρθρο σας στοιβαρό.\n\nΥπάρχουν κάποια πράγματα που ίσως πρέπει να συμπεριλάβετε στην εισαγωγή του άρθρου σας, αλλά παρακάτω παρουσιάζουμε μερικά από τα σημαντικότερα χωρίς συγκεκριμένη σειρά:\n\n- απαιτείται προηγούμενη εμπειρία και γνώσεις\n- κατάσταση και ρύθμιση συστήματος\n- ιδιοκτησιακός καθεστώς του εξοπλισμού\n- τι δεν θα βρουν οι αναγνώστες στο άρθρο σας\n\n"
    },
    {
      "title": "Το κείμενο",
      "level": 2,
      "content": "Έχουμε ήδη αναφέρει μερικά πράγματα που πρέπει να αναφέρετε στην εισαγωγή ενός άρθρου. Θα ρίξουμε τώρα μια ματιά σε κάποια προβλήματα στην διαμόρφωση μιας επιτυχημένης και χρήσιμης εισαγωγής άρθρου.\n\n"
    },
    {
      "title": "Προηγούμενη εμπειρία και γνωσεις",
      "level": 3,
      "content": "Όταν λέμε «προηγούμενη εμπειρία» πρέπει να έχετε υπόψη σας ότι ο όρος έχει δυο σημασίες. Ο ένας έχει γενικότερη σημασία. Μπορούμε να χαρακτηρίσουμε κάποιον ή κάποια αρχάριο/α ή γκουρού βάσει της συνολικής γνώσης/εμπειρίας/φημης για το άτομο αυτό. Ο άλλος αναφέρεται σε μια συγκεκριμένη εμπειρία συμμετοχής σε κάποιο συμβάν ή γεγονός (και στην γνώση που αποκτά από αυτό). Για λόγους πρακτικούς είναι καλύτερο να απαιτούμε «προηγούμενη εμπειρία» σύμφωνα με την τελευταία έννοια. Τα περισσότερα άρθρα του ArchWiki αναφέρονται σε θέματα που είναι ειδικά και βρίσκονται εντός κάποιων πλαισίων. Σε κάποιο δεδομένο πλαίσιο ένας αρχάριος μπορεί να επιδείξει επαγγελματισμό ενώ ένας γκουρού να παρουσιάσει έλλειψη ενδιαφέροντος. Αν απαιτήσετε ειδική προηγούμενη εμπειρία οι αναγνώστες θα έχουν την ευκαιρία να κρίνουν την ικανότητά τους να ακολουθήσουν το υπόλοιπο του άρθρου σας.\n\nΜπορείτε επίσης, αν θέλετε, να παράσχετε στους αναγνώστες σας συνδέσμους προς πηγές που θα τους βοηθήσουν να αποκτήσουν τις γνώσεις που απαιτούνται για την κατανόηση του άρθρου σας.\n\n"
    },
    {
      "title": "Καταστάσεις συστήματος και ρύθμιση",
      "level": 3,
      "content": "Μερικές φορές ένα απών πακέτο ή ένα διαφορετικά ρυθμισμένο εξάρτημα του συστήματος ίσως καταστίσουν το άρθρο σας άχρηστο για κάποια συστήματα. Για τον λόγο αυτό πρέπει να αναζητάτε και να καθορίζετε κάθε σχετική ρύθμιση συστήματος (ας πούμε, σχετικές παραμέτρους του αρχείου rc.config, απαιτούμενα πακέτα, κλπ) όποτε αυτό είναι εφικτό.\n\n"
    },
    {
      "title": "Απαιτήσεις εξοπλισμού",
      "level": 3,
      "content": "Οι απαιτήσεις του εξοπλισμού και των εξαρτημάτων είναι συνήθως πρόδηλες. Αν γράφετε για το υλικολογισμικό εγκατάστασης του τάδε κατ' επιλογή (dial-up) μόντεμ, κανείς δεν θα εννοήσει ότι μιλάτε για κάποιο άλλο μόντεμ. Είναι όμως καλό σε κάποιες περιπτώσεις να αναφέρετε τις ειδικές απαιτήσεις σε εξοπλισμό. Για παράδειγμα, αν γράφετε ένα άρθρο για την εγκατάσταση του υλικολογισμικού της συσκευής XYZ-123, θα πρέπει να προειδοποιήσετε τους χρήστες ότι οι οδηγίες δεν έχουν εφαρμογή για την συσκευή XYZ-456.\n\nΕπίσης, θα ήταν έξυπνο εκ μέρους σας να συνοδεύσετε το άρθρο σας με μια φωτογραφία του εξοπλισμού που συζητάτε...\n\n"
    },
    {
      "title": "Τι δεν θα βρουν οι χρήστες στο άρθρο σας",
      "level": 3,
      "content": "Κάποιες φορές ο τίτλος του άρθρου είναι ελαφρώς παραπλανητικός. Γι' αυτός ίσως πρέπει να προειδοποιήσετε τους αναγνώστες σας για το κύριο θέμα του άρθρου και πιθανόν να παράσχετε κάποιον σύνδεσμο προς κάποια άλλα άρθρα τα οποία οι αναγνώστες σας ίσως αναζητούν.\n\nΓια παράδειγμα, κάποιοι αναγνώστες ίσως σκέφτηκαν ότι το παρόν άρθρο είναι σχετικά για τον τρόπο διαμόρφωσης σελίδας με την χρήση κειμένου wiki. Γι' αυτό οι αναγνώστες προειδοποιήθηκαν ότι η σελίδα αυτή δεν είναι εκείνη που αναζητούν και δίνεται ο συνδεσμος στα δεξιά της.\n\n"
    },
    {
      "title": "Διαμόρφωση",
      "level": 2,
      "content": "Η διαμόρφωση της εισαγωγής ενός άρθρου ακολουθεί τα έθιμα του ArchWiki. Υπάρχουν, όμως, κάποιες λεπτομέρειες που αξίζουν περισσότερης προσοχής.\n\nΌταν βάζετε απαιτήσεις εξοπλισμού ή λογισμικού σε λίστα, έχετε δυο επιλογές. Η μια είναι να εξηγήσετε με απλά λόγια αλλά με λεπτομέρειες τις απαιτήσεις και άλλες εισαγωγικές σημειώσεις. Η άλλη μέθοδος είναι να καταστρώσετε μια καλά οργανωμένη λίστα απαιτήσεων.\n\n"
    }
  ]
}