{
  "title": "Συνεισφορά",
  "url": "https://wiki.archlinux.org/title/%CE%A3%CF%85%CE%BD%CE%B5%CE%B9%CF%83%CF%86%CE%BF%CF%81%CE%AC",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Το ArchWiki προσπαθεί να είναι ένα σαφές, περιεκτικό και επαγγελματικό μοντέλο τεκμηρίωσης. Για να επιτύχουμε τον στόχο αυτό πρέπει να οργανώσουμε τις εργασίες με τρόπο λογικό και λειτουργικό: το άρθρο αυτό προσπαθεί να εξηγήσει σχηματικά τις σημαντικότερες εργασίες στις οποίες μπορείτε να βοηθήσετε ώστε να ολοκληρωθούν.\n\nΠαρότι η προσπάθεια αυτή είναι κοινοτική, αν αναλάβετε κάποιο έργο με σοβαρότητα θα ανακηρυχθείτε σε συντηρητή του wiki.\n\n"
    },
    {
      "title": "Οι 3 θεμελιώδεις κανόνες",
      "level": 2,
      "content": "Υπάρχουν 3 απλοί κανόνες τους οποίους όλοι όσοι και όσες συνεισφέρουν πρέπει να προσπαθούν να τηρούν ως ένδειξη σεβασμού προς τους άλλους χρήστες του wiki: #Χρησιμοποιείτε πάντοτε σωστά την σύνοψη επεξεργασίας, #Μην κάνετε με μιας περίπλοκες επεξεργασίες και #Ανακοινώνετε τις παρεμβάσεις στα άρθρα μέσα από μια σελίδα συζήτησης.\n\nΌλοι και όλες που συνεισφέρουν πρέπει να γνωρίζουν και να αναμένουν ότι, αργά ή γρήγορα, κάποιο άλλοι χρήστες θα ελέγξουν τις επεξεργασίες τους, δικαίωμα το οποίο πρέπει να σέβονται και να διευκολύνουν την χρήση του ακολουθώντας αυτούς τους κανόνες. Όσοι και όσες είναι εξοικειωμένοι/ες με τα συνεργατικά εγχειρήματα λογισμικού μπορούν εύκολα να αντιληφθούν την αναλογία μεταξύ της σύνοψης επεξεργασίας ενός wiki και των μηνυμάτων git commit, καθώς και μεταξύ των edit diffs και git diffs.\n\n"
    },
    {
      "title": "Χρησιμοποιείτε πάντοτε σωστά την σύνοψη επεξεργασίας",
      "level": 3,
      "content": "Η σύνοψη επεξεργασίας είναι το μικρό πλαίσιο κειμένου που βρίσκεται κάτω από την κυρίως περιοχή επεξεργασίας και ακριβώς επάνω από το πλήκτρο «Αποθήκευση σελίδας». Είναι σημαντικό να γράφετε πάντοτε, με τρόπο σαφή και ξεκάθαρο, τι και γιατί αλλάξατε. Σημειώστε ότι, εσωτερικοί σύνδεσμοι του wiki μπορούν να μπουν και στην σύνοψη επεξεργασίας και μπορείτε να τους χρησιμοποιείτε για να παραπέμπετε σε άλλες σχετικές συζητήσεις ή άρθρα· μπορείτε, επίσης, να επικολάτε διευθύνσεις url προς σχετικά diffs επεξεργασιών ή προς εξωτερικές πηγές πληροφοριών, όπως νήματα δημόσιων συζητήσεων ή λίστες ταχυδρομείου.\n\nΜπορείτε να παραλείψετε το \"γιατί;\" μόνο στην περίπτωση μικρών αλλαγών, όπως για παράδειγμα συντακτικές ή ορθογραφικές διορθώσεις ή μια απλή αναδιατύπωση μιας πρότασης. Αν ξεκινήσετε μια νέα συζήτηση ή απαντήσετε σε κάποια υπάρχουσα, δεν απαιτείται να ξαναγράψετε το μήνυμά σας στην περίληψη της επεξεργασίας.\n\n- Διαβάστε τις περιλήψεις επεξεργασίας των Πρόσφατων αλλαγών για να πάρετε μια ιδέα τι πρέπει να γράψετε στις δικές σας περιλήψεις, αλλά να γνωρίζετε ότι δεν είναι όλοι οι χρήστες ενήμεροι για τις οδηγίες αυτές.\n- Χρησιμοποιείτε συνδέσμους όπως Special:Diff/359881/next για τα προσβάσιμα diffs. Για λεπτομέρειες σύνταξης, δείτε mw:Help:Diff.\n\n"
    },
    {
      "title": "Μην κάνετε με μιας περίπλοκες επεξεργασίες",
      "level": 3,
      "content": "Αν θέλετε να κάνετε εκτεταμένες αλλαγές σε κάποια σελίδα, είτε αυτή είναι ένα κανονικό άρθρο ή μια σελίδα συζήτησης, πάντοτε να χωρίζετε την εργασία σας σε πολλές απλούστερες επεξεργασίες. Για παράδειγμα, ακολουθώντας απλά λογικά βήματα. Αν έχετε αμφιβολίες προβάλετε σε προεπισκόπηση τα diff που προκύπτουν πατώντας το κουμπί \"Show changes\", εξετάστε αν είναι κατανοητή, λαμβάνοντας υπόψη την περίληψη επεξεργασίας όπως εξηγήθηκε πιο πάνω. Μερικές κοινές ενέργειες που μπορούν να δημιουργήσουν σύγχυση είναι:\n\n- Μεταφορά μιας ενότητας κάποιου άρθρου και ταυτόχρονη επεξεργασία του περιεχομένου της. Λύση: μεταφέρετε την ενότητα χωρίς να την μεταβάλετε, αποθηκεύστε την και προχωρήστε στις αλλαγές οποιαδήποτε άλλη στιγμή.\n- Ταυτόχρονη αναδιάταξη ενοτήτων ενός άρθρου. Λύση: μετακινήστε μόνον μια ενότητα σε κάθε επεξεργασία, δηλαδή, μετακίνηση-αποθήκευση-επεξεργασία.\n\n"
    },
    {
      "title": "Ανακοινώνετε τις παρεμβάσεις στα άρθρα μέσα από μια σελίδα συζήτησης",
      "level": 3,
      "content": "Αν θέλετε να αναδιοργανώσετε ριζικά ή να ξαναγράψετε ένα άρθρο ή ομάδα άρθρων, πρώτα ανακοινώστε και εξηγήστε τις προθέσεις σας σε μια κατάλληλη σελίδα συζήτησης, δίνοντας στους ενδιαφερόμενους χρήστες τον χρόνο για να σας απαντήσουν και να σας πουν τις απόψεις τους.\n\nΝα έχετε υπόψη σας ότι οι επεξεργασίες σας των #Χρησιμοποιείτε πάντοτε σωστά την σύνοψη επεξεργασίας και #Μην κάνετε με μιας περίπλοκες επεξεργασίες δεν πρέπει να εξαιρούνται από την ανακοίνωση των αλλαγών που προτίθεστε να κάνετε.\n\n"
    },
    {
      "title": "Η πιο σημαντική δουλειά",
      "level": 2,
      "content": "Στο υπόλοιπο αυτού του άρθρου θα αναφερθούν οι διάφοροι τρόποι με τους οποίους μπορείτε να συμβάλετε στο wiki. Μεταξύ αυτών, όμως, υπάρχει ένας τον οποίο πρέπει να θεωρείτε ως τον πλέον σημαντικό όλων: προσθέτετε τα άρθρα σας στην watchlist και προστατέψτε τα από αντι-παραγωγικές επεξεργασίες.\n\nΚαθημερινά το ArchWiki δέχεται πολλές δεκάδες επεξεργασιών από πολλούς διαφορετικούς χρήστες: παρότι οι περισσότερες από αυτές τις αλλαγές είναι πραγματικές βελτιώσεις, μια και μόνη επεξεργασία, συχνά καλοπροαίρετη, είναι αρκετή για να διαστρεβλώσει το νόημα ολόκληρης παραγράφου ή μιας ενότητας, ή ακόμη και να την διαγράψει αδικαιολόγητα. Αν αυτή η μεταβολή μείνει απαρατήρητη θα καταστρέψει όλη την πολύτιμη εργασία που έχετε κάνει εσείς ή άλλοι χρήστες. Αυτό δυστυχώς συμβαίνει περισσότερο συχνά από ό,τι θα περιμένατε: το επίσημο προσωπικό του wiki κάνει ό,τι μπορεί για να φιλτράρει και να επιδιορθώσει αντι-παραγωγικές επεξεργασίες, αλλά ποτέ δεν πρέπει να βασίζεστε εξολοκλήρου σε αυτό τόσο επειδή εκείνοι, όπως κι εσείς, διαθέτουν περιορισμένο χρόνο, όσο και επειδή δεν είναι παντογνώστες: είναι πολύ πιθανό οι δικές σας γνώσεις σχετικά με ζητήματα των άρθρων σας να είναι περισσότερες από τις δικές τους. Γενικά, ένα wiki δεν μπορεί να λειτουργήσει αν οι χρήστες του εστιάζουν μόνο στη συγγραφή νέου περιεχομένου αλλά δεν ενδιαφέρονται για την τύχη των συνεισφορών τους.\n\nΕυτυχώς υπάρχει ένας εύκολος τρόπος να παρακολουθείτε τα άρθρα (σ)τα οποία έχετε συνεισφέρει ή εκείνα που σας αρέσουν περισσότερο ή γνωρίζετε για τα θέματα που αναφέρονται σε αυτά: στην κορυφή κάθε άρθρου υπάρχει ο σύνδεσμος \"watch\" και πατώντας σε αυτόν το άρθρο θα προστεθεί στην δική σας watchlist. Θα μπορείτε μετά να παρακολουθείτε τις αλλαγές μέσα από την Special:Watchlist ή επιλέγοντας να ειδοποιηθείτε με email όταν το άρθρο που παρακολουθείται υποστεί σε ενημερώσεις, μέσα από το πεδίο \"Email options\" των Special:Preferences#mw-prefsection-personal. Οι σελίδες που παρακολουθείτε θα σημαίνονται, επίσης, με έντονη γραμματοσειρά στην σελίδα Special:RecentChanges. Τέλος, οι προτιμήσεις για την watchlist βρίσκονται στην σελίδα Special:Preferences#mw-prefsection-watchlist: μεταξύ των διαθέσιμων επιλογών, υπάρχει ακόμη και η προτίμηση να ξεκινά αυτόματα η παρακολούθηση των σελίδων που δημιουργήσατε ή επεξεργαστήκατε.\n\nΑν παρατηρήσετε κάποια ανακριβή επεξεργασία σε άρθρο που βρίσκεται στην watchlist σας, ή αν απλώς δεν το καταλαβαίνετε, σας παροτρύνουμε είτε να το επιδιορθώσετε, είτε, εφόσον είναι δυνατόν, να ξεκινήσετε μια συζήτηση στην σελίδα συζήτησης του άρθρου ή στην σελίδα συζήτησης του υπεύθυνου συντάκτη.\n\n"
    },
    {
      "title": "Πηγές",
      "level": 2,
      "content": "Εδώ θα βρείτε ένα κατάλογο σελίδων οι οποίες περιέχουν αναγκαίες πληρορορίες:\n\n- Οδηγίες ονοματοθεσίας άρθρων, όπου συζητούνται αποτελεσματικές στρατηγικές ονοματοθεσίας άρθρων και προτάσεις που εξασφαλίζουν την αναγνωσιμότητα και βελτιώνουν την πλοήγηση στο wiki. Διαβάστε το πριν δημιουργήσετε μια νέα σελίδα.\n- Επεξεργασία, όπου περιγράφονται η πολύ γνωστή γλώσσα σήμανσης του MediaWiki και οδηγίες που αφορούν ειδικά στο ArchWiki. Απαραίτητο για κάθε επίδοξο χρήστη που θέλει να συνεισφέρει.\n- Συζήτηση, όπου παρέχονται οδηγίες για τις συζητήσεις με άλλα άτομα στις σελίδες συζητήσεων.\n- Στυλ, όπου δίνονται οδηγίες κανονικοποίησης των στυλ των άρθρων του ArchWiki.\n- Κατηγορία, όπου εξηγούνται οι τρόποι ορισμού κατηγορίας σελίδας, δημιουργίας σελίδων κατηγοριών όπου αυτές λείπουν και μετακίνησης μιας σελίδας σε διαφορετική κατηγορία.\n- Ομάδα μεταφράσεων του ArchWiki, όπου θα βρείτε οδηγίες βήμα-βήμα για δημιουργία νέας σελίδας μετάφρασης. Ακολουθήστε τις για να μεταφράσετε σελίδες στη γλώσσα σας.\n- Help:i18n, όπου θα βρείτε έναν περιεκτικό οδηγό για την διεθνοποίηση και εντοπισμό του ArchWiki.\n- Διαδικασίες, όπου υπάρχει μια συλλογή χρήσιμων check-lists για πιο περίπλοκες ενέργειες.\n\nΔιαβάστε Category:Help για όλα τα άρθρα βοηθείας.\n\n"
    },
    {
      "title": "Δημιουργία άρθρου",
      "level": 2,
      "content": "Βεβαιωθείτε ότι έχετε κατανοήσει την \"φιλοσοφία\" του ArchWiki και αναλογιστείτε τι θα ήθελαν οι άλλοι χρήστες να διαβάσουν (για ιδέες, διαβάστε Αιτήματα). Όπως έχει αναφερθεί, το πεδίο του wiki είναι αρκετά ευρύ.\n\nΜιλήστε με τους admins για να σας βοηθήσουν στον συντονισμό μεγάλων έργων.\n\nΗ σελίδα Δημιουργώντας σελίδες καλύπτει τα βήματα δημιουργίας νέου άρθρου στον κυρίως χώρο ονομάτων.\n\nΗ λειτουργία υποσελίδας του wiki (άρθρο/υποσελίδα) διατίθεται για την σελίδα σας χρήστη. Με την χρήση της μπορείτε να δημιουργείτε πρόχειρα σε μια λευκή υποσελίδα. Σημειώστε ότι τα περιεχόμενα της σελίδας χρήστη δεν πρέπει να μπουν σε κατηγορίες, αλλά μπορείτε να χρησιμοποιήσετε όλες τις άλλες λειτουργίες. Όταν ολοκληρώσετε την σύνταξη του προχείρου, μπορείτε να μεταφέρετε την υποσελίδα στο νέο της όνομα. Παρακαλούμε, προσθέστε τα σχετικά πρότυπα κατάστασης (μόνο) μετά την μετακίνησή της. Όσο καλύτερα αιτιολογείτε την κατάσταση του προτύπου template, τόσο ευκολότερο είναι για τους χρήστες του wiki που το #Βελτίωση να συνεργαστούν μαζί σας.\n\n"
    },
    {
      "title": "Βελτίωση",
      "level": 2,
      "content": "Η επεξεργασία περιεχομένου, η επιμέλεια και η ενημέρωση είναι εργασίες χωρίς τέλος για ένα wiki. Αν θέλετε να βοηθήσετε απλώς καταχωρήστε ένα λογαριασμό και ξεκινήστε τα μαγικά σας!\n\n- Βοηθηστε στην ικανοποίηση αιτημάτων\n- Προσθέστε περιεχόμενο στα stubs, επεκτείνετε τα incomplete|ανολοκλήρωτα άρθρα ή νοικοκυρέψτε το poorly-written|κακογραμμένο περιεχόμενο.\n- Διορθώστε inaccurate|ανακρίβειες, outdated|ξεπερασμένο περιεχόμενο, την γραμματική, το συντακτικό ή το style|στυλ των άρθρων.\n- Ενημερώστε το FAQ με σχετικές ερωτήσεις παρμένες από τα φόρουμ και διαγράψτε τις απαρχαιωμένες ερωτήσεις.\n\n"
    },
    {
      "title": "Οι χρήστες που δεν χρησιμοποιούν Arch",
      "level": 3,
      "content": "Οι χρήστες που δεν χρησιμοποιούν Arch είναι ευπρόσδεκτοι να συνεισφέρουν. Άλλωστε ο καθένας και η καθεμιά μπορεί να register an account|καταχωρήσει ένα λογαριασμό. Πρέπει, όμως, να είναι σίγουροι ότι κάθε περιεχόμενο που προσθέτουν ή αλλάζουν βρίσκει εφαρμογή και στο Arch, αποφεύγοντας τα σχόλια για συγκεκριμένες άλλες διανομές. Για παράδειγμα, μια χρήστρια Fedora που υποβάλλει συνεισφορές στην σελίδα του systemd είναι γεγονός ευτυχές, αλλά αν αναφέρει ότι το περιεχόμενο που μόλις πρόσθεσε βρίσκει εφαρμογή στο Fedora, αυτό το σχόλιο θα απομακρύνεται ως άσχετο.\n\n"
    },
    {
      "title": "Συντήρηση",
      "level": 2,
      "content": "- Παρακολουθείτε τις Πρόσφατες αλλαγές, αναφέροντας και διορθώνοντας αμφίβολες επεξεργασίες.\n- Σημάνετε άρθρα με τα κατάλληλα πρότυπα κατάστασης άρθρου όπως, {{Ξεπερασμενο}}, {{Ακρίβεια}}, {{Απομάκρυνση}}, {{Αρχείο}}, κλπ.\n- Προσθέστε τα αγαπημένα σας άρθρα στην λίστα παρακολούθησής σας και προστατέψτε τα από αντιπαραγωγικές επεξεργασίες (#Η πιο σημαντική δουλειά).\n- Πάρτε μέρος στις συζητήσεις των διαφόρων σελίδων συζήτησης: οι περισσότεροι χρήστες ενδιαφέρονται να παρακολουθούν τα πιο πρόσφατα μηνύματα των γενικών συζητήσεων σε αυτό τον σύνδεσμο. Αντιθέτως, τα μηνύματα που αφορούν ιδιαίτερα στην συντήρηση του wiki παρατίθενται στα [1], [2], [3] και [4], ενώ η σελίδα Αιτήματα χρησιμοποιείται ως σελίδα συζήτησης, παρά το όνομά της.\n\n"
    },
    {
      "title": "Οργάνωση",
      "level": 2,
      "content": "Για τους συντηρητές που υλοποιούν και βελτιώνουν το το δένδρο κατηγοριών του wiki η διάταξη, η κατηγοριοποίηση και η μετακίνηση άρθρων έχει γίνει η σημαντικότερη εργασία.\n\n- Μειώστε και συνδυάστε τις διπλότυπες σελίδες.\n- Βελτιώστε την πλοήγηση στο wiki.\n- Ταξινομήστε τις σελίδες εκτός κατηγοριών, τις κατηγορίες εκτός ταξινόμησης και τις επιθυμητές κατηγορίες.\n- Επιδιορθώστε τους άκυρους και διπλούς συνδέσμους. Συζητήστε ή εφαρμόστε προτεινόμενους συνδέσμους.\n- Για περισσότερα εργαλεία συντήρησης, δείτε την σελίδα Special:SpecialPages.\n\n"
    },
    {
      "title": "Μεταφράσεις",
      "level": 2,
      "content": "Προσθέστε ή βελτιώστε μεταφράσεις. Βεβαιωθείτε ότι οι μεταφράσεις είναι συγχρονισμένες μεταξύ τους. Για μερικές γλώσσες (δείτε την πιο κάτω λίστα) έχουν ξεκινήσει συνεργατικά έργα ώστε να οργανώσουν αποτελεσματικά την μετάφραση των άρθρων. Παρακαλούμε, φροντίστε να γίνετε μέλος της Μεταφραστικής Ομάδας για την γλώσσας σας, ή τουλάχιστον ενημερώστε την όταν θα αρχίσετε να μεταφράζετε κάποιο άρθρο.\n\n- ArchWiki Translation Team\n- ArchWiki Translation Team (Español)\n- ArchWiki Translation Team (Hrvatski)\n- ArchWiki Translation Team (Italiano)\n- ArchWiki Translation Team (Polski)\n- ArchWiki Translation Team (Português)\n- ArchWiki Translation Team (Русский)\n- ArchWiki Translation Team (日本語)\n- ArchWiki Translation Team (简体中文)\n- ArchWiki Translation Team (Ελληνικά)\n- ArchWiki Translation Team (Català)\n\nΚάποιες γλώσσες χρησιμοποιούν εξωτερικό wiki και ίσως απαιτούνται διαφορετικά στάδια για την μετάφραση. Στην σελίδα Help:i18n θα βρείτε ένα κατάλογο εξωτερικών wikis.\n\n"
    },
    {
      "title": "Μετάφραση ειδικών μηνυμάτων",
      "level": 3,
      "content": "Στο Arch Wiki χρησιμοποιούνται κάποια ειδικά μηνύματα. Παρακαλούμε δώστε την μετάφρασή τους στην γλώσσα σας στους παρακάτω συνδέσμους:\n\n- Also in (Message in Categories tree): Προσθέστε τις μεταφράσεις εδώ.\n- Talkpagetext : Προσθέστε τις μεταφράσεις εδώ.\n\n"
    },
    {
      "title": "Υποβολή ιδεών",
      "level": 2,
      "content": "Για τον συντονισμό, σε πραγματικό χρόνο, μεταξύ των συνεισφορών και των άλλων χρηστών υπάρχει το επίσημο IRC κανάλι #archlinux-wiki. Αν δεν γνωρίζετε πώς και από που να ξεκινήσετε ή δεν επιθυμείτε να επεξεργάζεστε έργα άλλων ανθρώπων, μπορείτε να συμβάλλετε καταθέτοντας ιδέες και προτάσεις στην ενότητα Forum & Wiki discussion των Arch Linux Forums.\n\n"
    },
    {
      "title": "Συντήρηση λογισμικού υποστήριξης",
      "level": 2,
      "content": "Για να αναφέρετε σφάλματα ή να βοηθήσετε στην επιδιόρθωση και βελτίωση του κώδικα προγραμματισμού του MediaWiki, χρησιμοποιείτε την σελίδα Arch Linux Bugtracker.\n\n"
    },
    {
      "title": "Παράπονα",
      "level": 2,
      "content": "Αν έχετε οποιαδήποτε γενική αρνητική παρατήρηση ή παράπονο για τον τρόπο που διευθύνεται και διαχειρίζεται το wiki, παρακαλούμε γράψτε το μήνυμά σας στην σελίδα ArchWiki talk:Administrators. Δεν χρειάζεται να τονίσουμε ότι πρέπει να υποβάλετε τα παράπονά σας με τρόπο κόσμιο και αξιοπρεπή. Για παράπονα που αφορούν σε ειδικές επεξεργασίες περιεχομένου, παρακαλούμε χρησιμοποιήστε την αντίστοιχη ή μια καταλληλότερη σελίδα συζήτησης.\n\n"
    }
  ]
}