{
  "title": "Блокировка экрана",
  "url": "https://wiki.archlinux.org/title/%D0%91%D0%BB%D0%BE%D0%BA%D0%B8%D1%80%D0%BE%D0%B2%D0%BA%D0%B0_%D1%8D%D0%BA%D1%80%D0%B0%D0%BD%D0%B0",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Существует множество утилит для блокировки экрана в текущем сеансе. Но важно отметить, что выбор утилиты сильно зависит от среды, в которой вы находитесь: виртуальная консоль или графический сервер (Xorg или Wayland).\n\nСмотрите Список приложений/Безопасность#Блокировка экрана.\n\n"
    },
    {
      "title": "Виртуальная консоль",
      "level": 3,
      "content": "Для блокировки виртуальной консоли можно использовать vlock или physlockAUR.\n\n"
    },
    {
      "title": "Xorg",
      "level": 3,
      "content": "В Xorg есть много разных блокировки сеанса, поэтому этот раздел, скорее всего, будет неполным. Тем не менее, вот некоторые методы:\n\n- xlock из пакета xlockmore\n- xsecurelock из пакета xsecurelock\n- xscreensaver-command -lock из пакета xscreensaver\n- xss-lock\n- slock из пакета slock\n- kscreenlocker\n- i3lock\n- i3lock-colorAUR\n- alockAUR\n\nВ большинстве сред рабочего стола предусмотрены способы блокировки сеанса.\n\n"
    },
    {
      "title": "Wayland",
      "level": 3,
      "content": "Можно использовать один из следующих методов:\n\n- swaylock\n- waylock\n- gtklock\n\n"
    },
    {
      "title": "Блокировка сеанса",
      "level": 2,
      "content": "Заблокировать сеанс можно различными способами:\n\n- через терминал\n- с помощью графического интерфейса: значком рабочего стола с помощью горячих углов из меню (управляемого мышью или клавиатурой)\n- с помощью горячих клавиш\n- по событию: бездействие (с помощью systemd, xss-lock или xautolock) события systemd (приостановка, гибернация и т.д.).\n\n- значком рабочего стола\n- с помощью горячих углов\n- из меню (управляемого мышью или клавиатурой)\n\n- бездействие (с помощью systemd, xss-lock или xautolock)\n- события systemd (приостановка, гибернация и т.д.).\n\nПоследний пункт (срабатывание блокировки от события) является самым сложным, потому что вы можете сделать это одним из двух способов:\n\n- получить триггер действия для выполнения блокировки, а затем выполнить изначальное действие.\n- из триггера события добавить блокировку в цепочку событий. Пока это можно сделать только с помощью systemd.\n\n"
    },
    {
      "title": "Zsh",
      "level": 4,
      "content": "Чтобы выполнить команду после бездействия терминала, можно использовать переменную окружения TMOUT.\n\nДля выполнения блокировки её можно объединить с ловушкой по сигналу ALARM. Без ловушки оболочка просто завершится.\n\nВозможно, вы захотите определить, находитесь ли вы в графической среде, иначе ваши графические терминалы могут начать исчезать без понимания причин.\n\n"
    },
    {
      "title": "xss-lock",
      "level": 4,
      "content": "xss-lock срабатывает при одном из двух событий:\n\n- события systemd\n- DPMS\n\nПреимуществом является то, что вы можете управлять ручной блокировкой, блокировкой по бездействию и блокировкой при уходе в ждущий режим в одном и том же месте.\n\nЧтобы выполнить действие по одному из этих событий:\n\n```\n$ xss-lock <утилита-блокировки>\n```\n\nПо умолчанию xss-lock подписывается на suspend, hibernate, lock-session и unlock-session с соответствующими действиями (запустить блокировщик и ждать, пока пользователь разблокирует или убьёт блокировщик).\n\nВы можете предотвратить срабатывание xss-lock при при событиях suspend и hibernate (ждущий и спящий режимы) с помощью опции --ignore-sleep.\n\nЗаблокировать текущий сеанс вручную можно командой loginctl lock-session, также можно заблокировать все сеансы командой loginctl lock-sessions.\n\nНастройка таймаута DPMS:\n\n```\n# Переход в энергоэффективный режим после 10 минут бездействия\nxset s on\nxset s 600\n```\n\nСигналы DPMS также можно настроить в /etc/X11/xorg.conf.d/ в секции Monitor.\n\nИспользуя сигнал DPMS, можно установить второй таймер, например, для уведомления пользователя или затемнения экрана. Например (из xss-lock(1)):\n\n```\n# Погасить экран спустя три минуты неактивности, заблокировать экран спустя ещё две минуты, используя i3lock:\nxset s 180 120\nxss-lock -n dim-screen.sh -- i3lock -n\n```\n\nПример dim-screen.sh есть в каталоге /usr/share/doc/xss-lock.\n\n"
    },
    {
      "title": "xautolock",
      "level": 4,
      "content": "```\n$ xautolock -time 12 -locker \"systemctl suspend\" -detectsleep\n```\n\n- от 1 минуты до 1 часа для time\n- от 10 минут до 2 часов для killtime\n\n"
    },
    {
      "title": "swayidle",
      "level": 4,
      "content": "swayidle получает от Wayland-композитора информацию о неактивности, а также следит за событиями systemd, и выполняет соответствующие команды. Смотрите Sway#Idle.\n\n"
    },
    {
      "title": "Уведомления D-Bus",
      "level": 4,
      "content": "Используя loginctl lock-session или действие lock в logind.conf(5), вы можете уведомить систему через DBUS о том, что хотите заблокировать сеанс. Это уведомление может быть обработано, например, с помощью xss-lock.\n\n"
    },
    {
      "title": "Бездействие",
      "level": 4,
      "content": "В logind.conf(5) вы можете настроить IdleAction на lock. Это отправит уведомление DBUS, которое должно быть кем-то обработано (например, xss-lock) для блокировки сеанса.\n\nОбратите внимание, что это относится ко всей системе целиком (так что это не идеально для многопользовательской среды).\n\nОбратите также внимание, что «это требует, чтобы пользовательские сеансы правильно сообщали системе о бездействии».\n\n"
    },
    {
      "title": "Юниты",
      "level": 4,
      "content": "Можно использовать хук сна.\n\n```\n[Unit]\nDescription=Lock the screen\nBefore=sleep.target\n\n[Service]\nUser=%I\nType=forking\nEnvironment=DISPLAY=:0\nExecStart=/usr/bin/i3lock -c 000000\n\n[Install]\nWantedBy=sleep.target\n```\n\nЧтобы включить его для определённого пользователя, включите sleep@имяпользователя.service.\n\nМожно использовать действие lock для соответствующего события ACPI.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Geoff Greer's site: Linux Laptop Locking\n\n"
    }
  ]
}