{
  "title": "Буфер обмена",
  "url": "https://wiki.archlinux.org/title/%D0%91%D1%83%D1%84%D0%B5%D1%80_%D0%BE%D0%B1%D0%BC%D0%B5%D0%BD%D0%B0",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Ссылки по теме\n\n- Копирование текста из терминала\n- Firefox (Русский)#Поведение при нажатии средней кнопки мыши\n- GTK (Русский)#Отключение вставки мышью\n- Vim (Русский)#Буфер обмена\n\nВикипедия:\n\n"
    },
    {
      "title": "История",
      "level": 2,
      "content": "В X10 были введены cut buffers. Это были ограниченные буферы, которые хранили произвольный текст и использовались большинством приложений. Однако они были неэффективны, и их реализации различались, поэтому были введены selections. Cut buffers давно устарели, и хотя некоторые приложения (например xterm) ещё имеют их поддержку, их использование не рекомендуется.\n\n"
    },
    {
      "title": "Буферы",
      "level": 2,
      "content": "Freedesktop.org определяет два основных вида буфера (selections):[1]\n\nБольшинство программ для Xorg, в том числе приложения Qt и GTK, следуют этому поведению. Хотя ICCCM также определяет буфер SECONDARY, он не имеет согласованной цели.\n\nСтатья Горячие клавиши описывает стандартные сочетания клавиш, работающие во многих программах.\n\nВажно также понимать, что, согласно протоколам, ничего не копируется до тех пор, пока не будет вставлено куда-нибудь. Например, если вы выделите какое-то слово в окне терминала и затем закроете терминал, то вставить его в какое-то другое место уже не получится, потому что терминал исчез, а текст никуда не был скопирован. Если вы хотите, чтобы слово сохранилось после закрытия окна терминала, установите менеджер буфера обмена.\n\n"
    },
    {
      "title": "Инструменты",
      "level": 2,
      "content": "Здесь представлен список инструментов командной строки для управления буферами обмена.\n\n- sselp — Печатает выделение X в стандартный вывод.\n\n- xclip — Лёгкий командный интерфейс для управления буферами.\n\n- xsel — Программа командной строки для получения и установки содержимого выделения X.\n\n- wl-clipboard — Простой инструмент копирования и вставки для композиторов Wayland.\n\n"
    },
    {
      "title": "Менеджеры",
      "level": 2,
      "content": "В этом разделе перечислены менеджеры буфера обмена, предоставляющие дополнительные функции, такие как история буфера обмена или синхронизация.\n\n- Anamnesis — Менеджер буфера обмена, который хранит всю историю буфера обмена и предлагает интерфейс для полнотекстового поиска. Он имеет как командную строку, так и графический интерфейс.\n\n- Autocutsel — Интерфейс командной строки и демон для синхронизации PRIMARY, CLIPBOARD и cut buffer.\n\n- Clipboard Indicator — Расширение для GNOME Shell. Добавляет индикатор буфера обмена на верхнюю панель и хранит историю буфера обмена.\n\n- Clipcat — Менеджер буфера обмена, написанный на языке Rust.\n\n- Clipman — Плагин для панели Xfce4. Он сохраняет в себе содержимое буфера обмена при закрытии приложения. Он может работать с текстом и изображениями, а также имеет возможность выполнять действия над текстовыми выделениями, сопоставляя их с регулярными выражениями.\n\n- ClipManager — Кроссплатформенный менеджер буфера обмена, написанный на Python и Qt.\n\n- Clipmenu — Менеджер буфера обмена на основе Dmenu.\n\n- Clipster — Лёгкий менеджер буфера обмена, управляемый из командной строки, написанный на языке Python.\n\n- CopyQ — Умный менеджер буфера обмена Qt с возможностью поиска и редактирования истории, пользовательскими действиями над элементами и поддержкой командной строки.\n\n- GPaste — Система управления буфером обмена, которая стремится стать новым поколением Parcellite, с модульной структурой, разделённой на пару библиотек, и демон для адаптивности. Предоставляет расширение для GNOME Shell и интерфейс командной строки.\n\n- Greenclip — Простой менеджер буфера обмена для интеграции с rofi.\n\n- Klipper — Полнофункциональный менеджер буфера обмена для рабочего стола KDE.\n\n- Parcellite — Лёгкий, но многофункциональный менеджер буфера обмена. Имеет как командную строку, так и графический интерфейс.\n\n- Qlipper — Лёгкий и кроссплатформенный апплет истории буфера обмена, основанный на Qt.\n\n- xclipboard — Официальный клиент командной строки буфера обмена X.\n\n- xcmenu — Синхронизатор буфера обмена, разработанный для пользователей оконных менеджеров.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- Cut-and-paste in X\n- X Selections, Cut Buffers, and Kill Rings.\n- X11: How does “the” clipboard work?\n\n"
    }
  ]
}