{
  "title": "Дополнительные клавиши",
  "url": "https://wiki.archlinux.org/title/%D0%94%D0%BE%D0%BF%D0%BE%D0%BB%D0%BD%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D1%8B%D0%B5_%D0%BA%D0%BB%D0%B0%D0%B2%D0%B8%D1%88%D0%B8",
  "sections": [
    {
      "title": "Introduction",
      "level": 1,
      "content": "Эта статья подразумевает, что вы прочли статью Keyboard input (Русский).\n\nНа многих клавиатурах есть специальные клавиши (их иногда называют горячими клавишами или мультимедиа-клавишами), которые сделаны для того, чтобы запускать приложения или печатать специальные символы (которые не назначены на стандартной национальной раскладке). udev содержит в себе большую базу данных назначений клавиш, соответствующих конкретным клавиатурам, поэтому чаще всего клавиатуры работают из коробки. Если у вас очень новая или очень редкая клавиатура, вам может понадобиться настроить раскладку самостоятельно.\n\n"
    },
    {
      "title": "Apple MacBook",
      "level": 3,
      "content": "Смотрите статью Apple Keyboard.\n\n"
    },
    {
      "title": "Asus M series",
      "level": 3,
      "content": "Чтобы контролировать индикатор освещения и мультимедиа клавиши на вашем ноутбуке Asus, вы должны использовать следующую команду:\n\n```\n# echo 1 > /sys/devices/platform/asus_laptop/ls_switch\n```\n\nЧтобы она выполнялась всегда при запуске, создайте Systemd tmpfile:\n\n```\n/etc/tmpfiles.d/local.conf\n```\n\n```\nw /sys/devices/platform/asus_laptop/ls_switch - - - - 1\n```\n\n"
    },
    {
      "title": "Asus N56VJ (возможно подойдёт и для других)",
      "level": 3,
      "content": "Если большинство специальных клавиш не работает, попробуйте загрузить модуль ядра asus-nb-wmi с помощью команды:\n\n```\n# modprobe asus-nb-wmi\n```\n\nзатем проверьте, заработали ли они, с помощью xev. Если вы совмещаете этот способ с опцией загрузки acpi_osi=\"!Windows 2012\", вы можете получить странные результаты в xev, поэтому постарайтесь не использовать её. Если это помогло, сделайте модуль загружаемым автоматически, как описано в статье Модуль ядра#Автоматическая загрузка модулей.\n\n"
    },
    {
      "title": "Lenovo T460p (возможно подойдёт и для других)",
      "level": 3,
      "content": "Из коробки клавиши подсветки (на F5, F6) могут быть недоступны, даже через интерфейс /dev/input. Исправление смотрите в статье Backlight (Русский)#Параметры ядра.\n\n"
    },
    {
      "title": "Игровые клавиатуры",
      "level": 2,
      "content": "Игровые клавиатуры имеют некоторые особенности, из-за которых они могут «плохо себя вести» в Linux.\n\n"
    },
    {
      "title": "Cooler Master CM Storm QuickFire TK",
      "level": 3,
      "content": "У этой клавиатуры есть две особенности, которые могут вызвать путаницу в Linux: N-Key Rollover и клавиша Win-Lock.\n\nN-Key Rollover может вызвать проблемы с функциональными клавишами. Чтобы отключить N-key rollover, удерживайте клавишу FN lock (рядом с правым ctrl), пока она не загорится, затем удерживайте Escape и нажмите 6, чтобы переключиться на 6-key rollover. Чтобы отключить Fn lock, удерживайте клавишу FN lock.\n\nКлавиша Win-Lock полностью отключает клавиши Super (Windows). Чтобы включить или выключить Win-Lock, просто нажмите клавишу FN lock и F12.\n\n"
    },
    {
      "title": "Клавиатуры Corsair K",
      "level": 3,
      "content": "На этих клавиатурах есть кнопка winlock, которая позволяет отключить использование клавиш Super (Windows). Эта кнопка расположена в верхней правой части клавиатуры рядом с кнопками num и capslock. С помощью CKB можно полностью отключить эту функцию, предотвратив дальнейшую блокировку. Однако в состоянии по умолчанию простое нажатие кнопки снова включит клавиши Super (Windows).\n\n"
    },
    {
      "title": "Logitech G710 и 710+",
      "level": 3,
      "content": "Эта клавиатура имеет ряд из 6 программируемых G-клавиш. Чтобы использовать их по назначению, установите пакет sidewinderdAUR и запустите службу sidewinderd.service.\n\n"
    },
    {
      "title": "Logitech G613",
      "level": 3,
      "content": "Эта клавиатура имеет ряд из 6 программируемых G-клавиш. Чтобы использовать их так, как задумано Logitech, установите программу solaar. В solaar вы сможете переадресовать (divert) функции G-клавиш и переназначать их.\n\n"
    },
    {
      "title": "Logitech MX",
      "level": 3,
      "content": "На этих клавиатурах имеются специальные клавиши, такие как Snipping Tool, Mic Mute, которые не генерируют коды клавиш. С помощью программы solaar можно переадресовать (divert) эти клавиши и переназначать их.\n\n"
    },
    {
      "title": "Royal Kludge RK61 и, возможно, другие клавиатуры Apple",
      "level": 3,
      "content": "На некоторых клавиатурах Apple (включая Royal Kludge RK61) функциональные клавиши F1–F12 по умолчанию работают как мультимедийные клавиши mac. Если Fn Lock недоступен, это единственное доступное поведение, если не изменено поведение клавиатуры Apple по умолчанию. Чтобы исправить ситуацию, убедитесь, что клавиатура определяется как клавиатура Apple, выполнив следующую команду:\n\n```\n# lsusb | grep \"Apple.*Keyboard\"\n```\n\nВ таком случае следуйте инструкциям, описанным в статье Apple Keyboard#Function keys do not work.\n\n"
    },
    {
      "title": "Смотрите также",
      "level": 2,
      "content": "- LQWiki:Configuring keyboards#Enabling Keyboard Multimedia Keys\n\n"
    }
  ]
}